{
  "title": "Paper_849",
  "abstract": "pmc Pharmaceuticals (Basel) Pharmaceuticals (Basel) 2102 pharmaceuticals pharmaceuticals Pharmaceuticals 1424-8247 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472457 PMC12472457.1 12472457 12472457 41011227 10.3390/ph18091358 pharmaceuticals-18-01358 1 Article Antimicrobial Activity and Potential of Olive Leaf Extract as a Topical Agent to Combat Staphylococcus aureus https://orcid.org/0000-0002-3503-2331 Clusa Laura 1 2 * https://orcid.org/0000-0001-9932-0124 Latorre-Millán Miriam 1 https://orcid.org/0000-0002-3888-8952 Milagro Ana María 1 3 https://orcid.org/0000-0002-5263-4414 Tristancho-Baró Alexander 1 3 https://orcid.org/0000-0003-1753-5418 López-Calleja Ana Isabel 1 3 https://orcid.org/0000-0002-9582-5472 García-Lechuz Juan Manuel 3 Fortuño Blanca 1 3 del Villar Nuno 4 https://orcid.org/0009-0007-4476-9988 Asensio Mario 4 https://orcid.org/0000-0002-7027-6972 Martín-Belloso Olga 5 6 https://orcid.org/0000-0002-3753-0975 Odriozola-Serrano Isabel 5 6 https://orcid.org/0000-0002-8100-5596 Martínez-Beamonte Roberto 4 7 * https://orcid.org/0000-0002-8251-8457 Osada Jesús 4 7 https://orcid.org/0000-0001-7294-245X Rezusta Antonio 1 3 † https://orcid.org/0000-0001-8034-3617 Gilaberte Yolanda 2 8 † Birlutiu Victoria Academic Editor 1 mlatorre@iisaragon.es amilagro@salud.aragon.es aitristancho@salud.aragon.es 2 ygilaberte@salud.aragon.es 3 jmgarcialechuz@salud.aragon.es 4 mario.asensio.franco@gmail.com 5 6 7 8 * lclusa@iisaragon.es romartin@unizar.es † These authors contributed equally to this work. 11 9 2025 9 2025 18 9 497460 1358 14 8 2025 02 9 2025 07 9 2025 11 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background Staphylococcus aureus S. aureus Objectives Methods S. aureus Results w v 10 w v Conclusions olive leaf extract Staphylococcus aureus MRSA skin and soft tissue infection Plan de Recuperación, Transformación y Resiliencia (Instituto de Salud Carlos III, Ministerio de Ciencia, Innovación y Universidades) from Unión Europea-NextGeneration EU Sara Borrell CD22/00152 Ministerio de Ciencia e Innovación-Fondo Europeo de Desarrollo Regional PID2022-136414OB-I00 European Union NextGeneration EU Recovery, Transformation and Resilience Plan PRTR-C17.I1 Interreg Sudoe Program NEWPOWER, S1/1.1/E01116 CIBER Fisiopatología de la Obesidad y la Nutrición as an initiative of FEDER-ICCIII CIBEROBN, CB06/03/1012 Fondo Social Europeo-Gobierno de Aragón B10_23R B16_23R B59_23D Laura Clusa holds a postdoctoral contract from Plan de Recuperación, Transformación y Resiliencia (Instituto de Salud Carlos III, Ministerio de Ciencia, Innovación y Universidades) from Unión Europea-NextGeneration EU, grant number Sara Borrell CD22/00152. This research was funded by Ministerio de Ciencia e Innovación-Fondo Europeo de Desarrollo Regional, grant number PID2022-136414OB-I00, the Spanish Ministry of Science and Innovation, with funds from the European Union NextGeneration EU Recovery, Transformation and Resilience Plan, grant number PRTR-C17.I1, Interreg Sudoe Program, grant number NEWPOWER, S1/1.1/E01116, CIBER Fisiopatología de la Obesidad y la Nutrición as an initiative of FEDER-ICCIII, grant number CIBEROBN, CB06/03/1012, and Fondo Social Europeo-Gobierno de Aragón, grant number research groups: B10_23R, B16_23R, and B59_23D. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Staphylococcus aureus 1 2 3 4 5 6 S. aureus 2 S. aureus 6 7 S. aureus 8 9 10 S. aureus 11 12 5 13 14 Traditionally, olive trees have been broadly used in medicine [ 15 16 17 18 19 20 21 22 23 Candida albicans Escherichia coli Helicobacter pylori S. aureus 24 25 26 27 S. aureus 28 29 Listeria monocytogenes E. coli Salmonella enteritidis 30 Apart from that, olive tree products have been applied to the skin as anti-ageing, photoprotective, anti-inflammatory, and antioxidant agents, as well as for skin wound regeneration [ 31 32 33 34 35 36 37 38 S. aureus S. aureus 2. Results 2.1. Epidemiological Description of Clinical Samples A total of 126 clinical samples were collected and analysed over a three-month period at a Spanish tertiary hospital ( Table S1 Table 1 The analysis of all samples revealed that the median patient age was 56 years (IQR: 27.5–73.8). Seventy-four samples were from male patients, and 52 were from female patients. Gender showed no association with samples regarding the type of sample, location, associated pathology, age, and number of antibiotic resistances. The majority of samples came from patients with skin infections without any previous dermatological disease (31%), followed by surgical procedure samples (22.2%). They were collected predominantly from skin lesions (42.9%) and were located on the trunk (22.2%), leg (23.0%), foot (19.0%), and head (19.0%) ( Table 1 Table S1 p Table 1 Figure 1 p Table 1 Figure 1 2.2. Antibiotic Resistance Patterns Of the 126 samples, 103 (82%) were identified as MSSA and 23 (18%) as MRSA, with 63 (61%) and 11 (48%) from male patients, respectively. Over 90% of MSSA strains showed less than five antibiotic resistances, whereas 82% of MRSA strains were resistant to more than six antibiotics ( Table 1 Figure 1 Figure 2 p p Table 1 Figure 1 p Table 1 Figure 3 p Figure 4 2.2.1. Susceptibility Tests on ATCC (American Type Culture Collection) Samples The susceptibility test on agar plates showed an inhibition of growth in S. aureus w v w v w v w v Regarding the lethal curve, the concentration of OLE employed was the maximum feasible concentration (12.5% w v 10 p 9 Table 2 Figure 5 2.2.2. Susceptibility Tests on Clinical Samples All clinical isolates described were susceptible to OLE at concentrations of 25, 12.5, and 6.25% ( w v w v Table S1 Table 3 Figure 6 Table 3 p Table 3 Table S1 The interpretation of fusidic acid susceptibility was limited due to testing panel concentrations (2 mg/L) that did not align with EUCAST breakpoints (1 mg/L and 0.5 mg/L for topical use) [ 39 Table 3 39 When looking for more than one antibiotic resistance in each sample, 8 out of 126 strains were resistant to oxacillin and gentamicin. Additionally, six (three MSSA, three MRSA) out of 28 strains analysed were resistant to both fusidic acid and mupirocin. Similarly, 3 out of 28 MRSA strains tested were resistant to both fusidic acid and gentamicin. Furthermore, two of these MRSA were resistant to four antibiotics: fusidic acid, gentamicin, mupirocin, and oxacillin ( Table S1 2.2.3. Antibiotic Families and Efficacy In terms of antibiotic susceptibility by antibiotic family, penicillins had the lowest susceptibility rate (19.8%) ( Figure 6 Figure 6 3. Discussion The present study demonstrated the antibiotic effect of OLE against multidrug-resistant strains of S. aureus In our research, susceptibility tests on agar plates showed that MBC values were slightly lower in the MRSA ATCC strain when compared to the MSSA ATCC strain. This variation can be attributed to the faster in vitro growth rate of MSSA, which is characterised by its metabolic efficiency and adaptability. It has been reported that MSSA strains generally exhibit faster replication rates under laboratory conditions, whereas MRSA mechanisms of resistance frequently incur a metabolic cost [ 40 41 42 Regarding other studies on OLE, Sujana et al. reported a minimum inhibitory concentration (MIC) of 0.62% for S. aureus 26 Table S2 35 w v S. aureus 25 22 23 26 27 30 25 Most authors assign the antimicrobial activity of OLE to polyphenols, such as oleuropein and its derivatives [ 22 23 43 44 26 L. monocytogenes Enterococcus faecium Enterococcus faecalis 45 L. monocytogenes 30 E. coli 46 47 Apart from the lack of knowledge about how it works, its antimicrobial efficacy is believed to stem from the synergistic effects of its constituent compounds [ 23 30 48 49 S. aureus Table S1 Regarding skin and soft tissue infections, the short study period and the geographic restriction could limit generalisability by misrepresenting the results in terms of seasonality and location. Despite this, the results are consistent with other unbiassed epidemiological studies: 31% of our samples were derived from a skin infection without any underlying dermatological disease, such as burns, wound infections, trauma, etc. ( Table 1 Table S1 9 Table 1 12 9 Figure 3 8 The most common treatment for S. aureus 5 7 50 51 10 9 Table 3 9 10 52 53 53 10 53 Table 3 Looking in detail at topical antibiotic resistance, up to 22% of samples analysed were resistant to both fusidic acid and mupirocin simultaneously, which could lead to the failure of topical treatment and progression to more severe disease. Additionally, two strains analysed were found to be resistant to the four conventional topical antibiotics (fusidic acid, gentamicin, mupirocin, and oxacillin), whereas all these aforementioned strains were susceptible to OLE ( Table S1 In addition, OLE and its derivatives have already been successfully used on the skin as protective and antioxidant agents to reduce skin damage, as well as for healing diabetic foot ulcers and even in virus infections [ 31 32 33 34 37 38 32 54 35 For these reasons, OLE may be used not only as treatment but also to improve healing, prevent skin infections caused by S. aureus, 3 Table 1 The potential of OLE as a topical antimicrobial is highlighted by the present work. We propose a localised treatment with OLE as single agent or in combination with other antibiotics to prevent the dispersion of bacteria. It would be easy to implement in the clinic, given that OLE is already sold as a natural supplement. For instance, it could be useful in countries with high MRSA prevalence [ 12 The present work adds epidemiological data on clinical samples and measures MBC and rapid kill kinetics. This is the first report demonstrating that its antimicrobial action, after 2 h incubation, leads to a 6-log reduction in the bacterial load (no growth observed) of both MSSA and MRSA. Additionally, it has been tested on different strains of S. aureus S. aureus 4. Materials and Methods 4.1. OLE Extraction Olive leaf extract was prepared as follows: Olea europaea w v ® w v w v 4.2. OLE Phenolic Profile OLE was homogenised with 70% ethanol in Milli-Q water (1600 rpm, 2 min) using an Ultra-Turrax T25-Basic mixer (Janke & Kunkel, Staufen, Germany). Then, the mixture was centrifuged (12,500 rpm, 4 °C, 15 min) and the supernatant was filtered through a 0.45 μm membrane. The resulting extracts were stored at −18 °C in the dark until further analysis. Identification and quantification of the individual phenolic compounds were carried out by UPLC-MS/MS on an AcQuity Ultra-Performance™ liquid chromatography/tandem mass spectrometry system (Waters, Milford, MA, USA) similarly to that described by Martínez-Beamonte [ 55 2 Table S2 4.3. Bacteria 4.3.1. Reference S. aureus The reference strains used were MSSA ATCC 29213 and MRSA ATCC 700699, cultured on Columbia blood agar (CBA) (Thermo Scientific™, Waltham, MA, USA) under aerobic conditions at 35 °C for 18–24 h to obtain fresh isolated colonies. These strains were used to test the bacterial susceptibility to OLE on agar plates and calculate the minimum bactericidal concentration (MBC) and the lethal curve. 4.3.2. S. aureus This study included all samples from patients with skin and soft tissue infections that were received between 29 May and 29 August 2024 at the Microbiology Department of Miguel Servet University Hospital (a tertiary hospital whose catchment area covers approximately 400,000 people), in which S. aureus ® S. aureus S. aureus S. aureus S. aureus S. aureus S. aureus S. aureus S. aureus Table S1 Data related to antibiotic susceptibility, sample type, location of infection, associated pathology (when possible), and patient age and gender were collected for each sample. The type of sample was classified according to the standard laboratory practice as an abscess, skin lesion, surgical wound, ulcer, or pressure ulcer. The location was categorised as generalised (all body), head, hand, arm, trunk, leg, foot, and toenail. The associated pathology was divided into six groups as follows: (a) immunosuppression (samples associated with angiosarcoma, basal cell carcinoma, and squamous cell cancer); (b) surgical procedure (samples from catheter, surgery, amputation, and prostheses); (c) skin infection without dermatological factors (burns, insect stings, omphalitis, knife cuts, trauma, and any skin or wound infection); (d) skin infection with dermatological disease (epidermolysis bullosa, herpes zoster, impetigo, psoriasis, and scalded skin syndrome); (e) vascular disease (elephantiasis, lymphedema, lymphocele, and vascular ulcer); (f) pressure ulcer (immobilisation); and (g) diabetic foot. 4.4. OLE Bacterial Susceptibility Test on Agar Plate The inoculum was prepared by direct saline suspension of freshly isolated colonies, adjusting the turbidity to 0.5 McFarland using a MicroScan turbidity metre (Beckman Coulter ® 8 w v w v w v, w v 56 4.5. Minimum Bactericidal Concentration (MBC) The MBC of OLE was determined for the two reference strains by the broth microdilution method according to the Clinical Laboratory Standards Institute guidelines [ 57 ® 6 5 w v 4.6. Lethal Curve The protocol was similar to that described for the MBC. In this case, 50 µL of the inoculum was mixed with either 50 µL of 25% w v 8 5 4.7. Antibiotic Susceptibility Antibiotic susceptibility testing was performed using a Microscan Walkway™ semi-automatic system (Beckman Coulter ® https://www.beckmancoulter.com/es/products/microbiology/conventional-panels#/ 58 39 59 4.8. Statistical Analysis Values were expressed as means and standard deviations (SDs) or median values (P25–P75). Normality was tested by the Shapiro–Wilk test. Differences between the experimental groups in terms of the number of colony-forming units in the lethal curve were assessed using the Students’ t 2 p p 60 https://www.freepik.es/ https://pixabay.com/es/ Acknowledgments We are grateful to the Microbiology Department at Miguel Servet University Hospital for providing the clinical samples and to the technicians Carmen Guerrero and Rebeca Fernández for performing the routine antibiotic susceptibility tests on the clinical samples. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/ph18091358/s1 Author Contributions Conceptualization, L.C., R.M.-B., A.R. and Y.G.; methodology, L.C., R.M.-B., A.R. and Y.G.; software, L.C. and M.L.-M.; validation, L.C.; formal analysis, L.C., M.L.-M. and A.M.M.; investigation, L.C., A.T.-B., A.I.L.-C., J.M.G.-L., B.F., N.d.V., M.A., O.M.-B., I.O.-S. and R.M.-B.; resources, L.C., A.I.L.-C., J.M.G.-L., B.F., R.M.-B., J.O., A.R. and Y.G.; data curation, L.C.; writing—original draft preparation, L.C.; writing—review and editing, M.L.-M., A.M.M., A.T.-B., A.I.L.-C., J.M.G.-L., B.F., N.d.V., M.A., O.M.-B., I.O.-S., R.M.-B., J.O., A.R. and Y.G.; supervision, A.M.M., A.R. and Y.G.; visualisation, L.C.; project administration, A.R. and Y.G.; funding acquisition, J.O., A.R. and Y.G. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was conducted in accordance with the Declaration of Helsinki and approved by the Ethics Committee of the Autonomous Community of Aragon (protocol code C.I. PI24/316, approval date 10 July 2024 and updated on 25 September 2024 and 18 December 2024). Informed Consent Statement Patient consent was waived due to the use of historical samples. Data Availability Statement The original contributions presented in this study are included in the article/ Supplementary Material Supplementary Material (Table S1) Supplementary Material (Table S2) Conflicts of Interest The authors declare no conflicts of interest. The funders had no role in the design of the study; in the collection, analyses, or interpretation of data; in the writing of the manuscript; or in the decision to publish the results. Abbreviations The following abbreviations are used in this manuscript: SSTIs Skin and soft tissue infections MSSA Methicillin-susceptible Staphylococcus aureus MRSA Methicillin-resistant Staphylococcus aureus OLE Olive leaf extract MBC Minimum bactericidal concentration CFU Colony-forming units AMR Antimicrobial resistance UVB Ultraviolet B IQR Interquartile range DF Diabetic foot IS Immunosuppression PU Pressure ulcer SIWDD Skin infection with dermatological disease SIWODF Skin infection without dermatological factors SP Surgical procedure VD Vascular disease ATCC American Type Culture Collection EUCAST European Committee on Antimicrobial Susceptibility Testing MIC Minimum inhibitory concentration CBA Columbia blood agar MALDI-TOF Matrix-Assisted Laser Desorption/Ionisation Time of Flight MHA Müller-Hinton agar CAMHB Cation Adjusted Müller-Hinton Broth SD Standard deviation UPLC-MS/MS Ultra-Performance liquid chromatography/tandem mass spectrometry system References 1. Gehrke A.-K.E. Giai C. Gómez M.I. Staphylococcus aureus Antibiotics 2023 12 1520 10.3390/antibiotics12101520 37887220 PMC10604630 2. Ikuta K.S. Swetschinski L.R. Robles Aguilar G. Sharara F. Mestrovic T. Gray A.P. Davis Weaver N. Wool E.E. Han C. Gershberg Hayoon A. Global Mortality Associated with 33 Bacterial Pathogens in 2019: A Systematic Analysis for the Global Burden of Disease Study 2019 Lancet 2022 400 2221 2248 10.1016/S0140-6736(22)02185-7 36423648 PMC9763654 3. Schachner L.A. Andriessen A. Gonzalez M.E. Lal K. Hebert A.A. Eichenfield L.F. Lio P. A Consensus on Staphylococcus aureus J. Drugs Dermatol. 2024 23 825 832 10.36849/JDD.8240 39361702 4. Tomi N.S. Kränke B. Aberer E. Staphylococcal Toxins in Patients with Psoriasis, Atopic Dermatitis, and Erythroderma, and in Healthy Control Subjects J. Am. Acad. Dermatol. 2005 53 67 72 10.1016/j.jaad.2005.02.034 15965423 5. Linz M.S. Mattappallil A. Finkel D. Parker D. Clinical Impact of Staphylococcus aureus Antibiotics 2023 12 557 10.3390/antibiotics12030557 36978425 PMC10044708 6. Ki V. Rotstein C. Bacterial Skin and Soft Tissue Infections in Adults: A Review of Their Epidemiology, Pathogenesis, Diagnosis, Treatment and Site of Care Can. J. Infect. Dis. Med. Microbiol. 2008 19 173 184 10.1155/2008/846453 19352449 PMC2605859 7. Tognetti L. Martinelli C. Berti S. Hercogova J. Lotti T. Leoncini F. Moretti S. Bacterial Skin and Soft Tissue Infections: Review of the Epidemiology, Microbiology, Aetiopathogenesis and Treatment: A Collaboration between Dermatologists and Infectivologists J. Eur. Acad. Dermatol. Venereol. 2012 26 931 941 10.1111/j.1468-3083.2011.04416.x 22214317 8. Manzur A. Gavalda L. Ruiz De Gopegui E. Mariscal D. Dominguez M.A. Perez J.L. Segura F. Pujol M. Prevalence of Methicillin-Resistant Staphylococcus aureus Clin. Microbiol. Infect. 2008 14 867 872 10.1111/j.1469-0691.2008.02060.x 18844688 9. Habib A. Qadir A. Frequency and Antibiotic Susceptibility Pattern of Community-Associated Methicillin-Resistant Staphylococcus aureus J. Coll. Physicians Surg. Pak. 2022 32 1398 1403 10.29271/jcpsp.2022.11.1398 36377004 10. Frazee B.W. Lynn J. Charlebois E.D. Lambert L. Lowery D. Perdreau-Remington F. High Prevalence of Methicillin-Resistant Staphylococcus aureus Ann. Emerg. Med. 2005 45 311 320 10.1016/j.annemergmed.2004.10.011 15726056 11. King M.D. Humphrey B.J. Wang Y.F. Kourbatova E.V. Ray S.M. Blumberg H.M. Emergence of Community-Acquired Methicillin-Resistant Staphylococcus aureus Ann. Intern. Med. 2006 144 309 317 10.7326/0003-4819-144-5-200603070-00005 16520471 12. Murray C.J.L. Ikuta K.S. Sharara F. Swetschinski L. Robles Aguilar G. Gray A. Han C. Bisignano C. Rao P. Wool E. Global Burden of Bacterial Antimicrobial Resistance in 2019: A Systematic Analysis Lancet 2022 399 629 655 10.1016/S0140-6736(21)02724-0 35065702 PMC8841637 13. European Centre for Disease Prevention and Control Antimicrobial Resistance in the EU-EEA (EARS-Net) Annual Epidemiological Report for 2021 ECDC Stockholm, Sweden 2022 20 14. Dadgostar P. Antimicrobial Resistance: Implications and Costs Infect. Drug Resist. 2019 12 3903 3910 10.2147/IDR.S234610 31908502 PMC6929930 15. Hashmi M.A. Khan A. Hanif M. Farooq U. Perveen S. Traditional Uses, Phytochemistry, and Pharmacology of Olea europaea Evid.-Based Complement. Altern. Med. 2015 2015 541591 10.1155/2015/541591 25802541 PMC4352757 16. Cabrera-Vique C. Navarro-Alarcón M. Rodríguez Martínez C. Fonollá-Joya J. Efecto hipotensor de un extracto de componentes bioactivos de hojas de olivo: Estudio clínico preliminar Nutr. Hosp. 2015 32 242 249 10.3305/nh.2015.32.1.8644 26262723 17. Ismail M.A. Norhayati M.N. Mohamad N. Olive Leaf Extract Effect on Cardiometabolic Profile among Adults with Prehypertension and Hypertension: A Systematic Review and Meta-Analysis PeerJ 2021 9 e11173 10.7717/peerj.11173 33868820 PMC8035902 18. Lins P.G. Marina Piccoli Pugine S. Scatolini A.M. De Melo M.P. In Vitro Antioxidant Activity of Olive Leaf Extract ( Olea europaea Heliyon 2018 4 e00805 10.1016/j.heliyon.2018.e00805 30255162 PMC6148714 19. Wainstein J. Ganz T. Boaz M. Bar Dayan Y. Dolev E. Kerem Z. Madar Z. Olive Leaf Extract as a Hypoglycemic Agent in Both Human Diabetic Subjects and in Rats J. Med. Food 2012 15 605 610 10.1089/jmf.2011.0243 22512698 20. Goldsmith C.D. Bond D.R. Jankowski H. Weidenhofer J. Stathopoulos C.E. Roach P.D. Scarlett C.J. The Olive Biophenols Oleuropein and Hydroxytyrosol Selectively Reduce Proliferation, Influence the Cell Cycle, and Induce Apoptosis in Pancreatic Cancer Cells Int. J. Mol. Sci. 2018 19 1937 10.3390/ijms19071937 30004416 PMC6073890 21. European Medicines Agency Oleae Folium—Herbal Medicinal Product | European Medicines Agency (EMA) Available online: https://www.ema.europa.eu/en/medicines/herbal/oleae-folium (accessed on 21 March 2025) 22. Borjan D. Leitgeb M. Knez Ž. Hrnčič M.K. Microbiological and Antioxidant Activity of Phenolic Compounds in Olive Leaf Extract Molecules 2020 25 5946 10.3390/molecules25245946 33334001 PMC7765412 23. Pereira A.P. Ferreira I.C. Marcelino F. Valentão P. Andrade P.B. Seabra R. Estevinho L. Bento A. Pereira J.A. Phenolic Compounds and Antimicrobial Activity of Olive ( Olea europaea Cv Molecules 2007 12 1153 1162 10.3390/12051153 17873849 PMC6149345 24. Karygianni L. Cecere M. Skaltsounis A.L. Argyropoulou A. Hellwig E. Aligiannis N. Wittmer A. Al-Ahmad A. High-Level Antimicrobial Efficacy of Representative Mediterranean Natural Plant Extracts against Oral Microorganisms BioMed Res. Int. 2014 2014 839019 10.1155/2014/839019 25054150 PMC4098616 25. Markin D. Duek L. Berdicevsky I. In Vitro Antimicrobial Activity of Olive Leaves. Antimikrobielle Wirksamkeit von Olivenblättern in Vitro Mycoses 2003 46 132 136 10.1046/j.1439-0507.2003.00859.x 12870202 26. Sudjana A.N. D’Orazio C. Ryan V. Rasool N. Ng J. Islam N. Riley T.V. Hammer K.A. Antimicrobial Activity of Commercial Olea europaea Int. J. Antimicrob. Agents 2009 33 461 463 10.1016/j.ijantimicag.2008.10.026 19135874 27. Zorić N. Kopjar N. Bobnjarić I. Horvat I. Tomić S. Kosalec I. Antifungal Activity of Oleuropein against Candida albicans Molecules 2016 21 1631 10.3390/molecules21121631 27916806 PMC6273721 28. Ayana B. Turhan K.N. Use of Antimicrobial Methylcellulose Films to Control Staphylococcus aureus Packag. Technol. Sci. 2009 22 461 469 10.1002/pts.870 29. Ahmed A.M. Rabii N.S. Garbaj A.M. Abolghait S.K. Antibacterial Effect of Olive ( Olea europaea Penaeus semisulcatus Int. J. Vet. Sci. Med. 2014 2 53 56 10.1016/j.ijvsm.2014.04.002 30. Liu Y. McKeever L.C. Malik N.S.A. Assessment of the Antimicrobial Activity of Olive Leaf Extract Against Foodborne Bacterial Pathogens Front. Microbiol. 2017 8 113 10.3389/fmicb.2017.00113 28210244 PMC5288333 31. Melguizo-Rodríguez L. González-Acedo A. Illescas-Montes R. García-Recio E. Ramos-Torrecillas J. Costela-Ruiz V.J. García-Martínez O. Biological Effects of the Olive Tree and Its Derivatives on the Skin Food Funct. 2022 13 11410 11424 10.1039/D2FO01945K 36282027 32. Torrecillas-Baena B. Camacho-Cardenosa M. Carmona-Luque M.D. Dorado G. Berenguer-Pérez M. Quesada-Gómez J.M. Gálvez-Moreno M.Á. Casado-Díaz A. Comparative Study of the Efficacy of EHO-85, a Hydrogel Containing Olive Tree ( Olea europaea Int. J. Mol. Sci. 2023 24 13328 10.3390/ijms241713328 37686133 PMC10487427 33. Sumiyoshi M. Kimura Y. Effects of Olive Leaf Extract and Its Main Component Oleuroepin on Acute Ultraviolet B Irradiation-induced Skin Changes in C57BL/6J Mice Phytother. Res. 2010 24 995 1003 10.1002/ptr.3048 19957248 34. Mehraein F. Sarbishegi M. Aslani A. Evaluation of Effect of Oleuropein on Skin Wound Healing in Aged Male Balb/c Mice Cell J. 2014 16 25 30 24518972 PMC3933436 35. Elnahas R.A. Elwakil B.H. Elshewemi S.S. Olama Z.A. Egyptian Olea europaea J. Tradit. Complement. Med. 2021 11 427 434 10.1016/j.jtcme.2021.02.008 34522637 PMC8427474 36. Zamanifard M. Nasiri M. Yarahmadi F. Zonoori S. Razani O. Salajegheh Z. Imanipour M. Mohammadi S.M. Jomehzadeh N. Asadi M. Healing of Diabetic Foot Ulcer with Topical and Oral Administrations of Herbal Products: A Systematic Review and Meta-analysis of Randomized Controlled Trials Int. Wound J. 2024 21 e14760 10.1111/iwj.14760 38356150 PMC10867296 37. Mehrabi Rad F. Changaee F. Toulabi T. Yari F. Rashidipour M. Mohammadi R. Yarahmadi S. Almasian M. The Efficacy of Combined Olive Leaf and Curcumin Extract on Healing Human Papillomavirus: A Randomized Clinical Trial Evid.-Based Complement. Altern. Med. 2023 2023 2001770 10.1155/2023/2001770 38. Toulabi T. Delfan B. Rashidipour M. Yarahmadi S. Ravanshad F. Javanbakht A. Almasian M. The Efficacy of Olive Leaf Extract on Healing Herpes Simplex Virus Labialis: A Randomized Double-Blind Study Explore 2022 18 287 292 10.1016/j.explore.2021.01.003 33541815 39. European Committee on Antimicrobial Susceptibility Testing Breakpoint Tables for Interpretation of MICs and Zone Diameters Version 14.0 European Committee on Antimicrobial Susceptibility Testing Växjö, Sweden 2024 Available online: https://www.eucast.org (accessed on 1 December 2024) 40. Hiramatsu K. Ito T. Tsubakishita S. Sasaki T. Takeuchi F. Morimoto Y. Katayama Y. Matsuo M. Kuwahara-Arai K. Hishinuma T. Genomic Basis for Methicillin Resistance in Staphylococcus aureus Infect. Chemother. 2013 45 117 10.3947/ic.2013.45.2.117 24265961 PMC3780952 41. Laurent F. Fitness and Competitive Growth Advantage of New Gentamicin-Susceptible MRSA Clones Spreading in French Hospitals J. Antimicrob. Chemother. 2001 47 277 283 10.1093/jac/47.3.277 11222560 42. Stevens C.E. Deventer A.T. Johnston P.R. Lowe P.T. Boraston A.B. Hobbs J.K. Staphylococcus aureus Mol. Microbiol. 2025 mmi.70000 10.1111/mmi.70000 PMC12423488 40491039 43. Li X. Liu Y. Jia Q. LaMacchia V. O’Donoghue K. Huang Z. A Systems Biology Approach to Investigate the Antimicrobial Activity of Oleuropein J. Ind. Microbiol. Biotechnol. 2016 43 1705 1717 10.1007/s10295-016-1841-8 27771782 44. Silvan J.M. Guerrero-Hurtado E. Gutierrez-Docio A. Prodanov M. Martinez-Rodriguez A.J. Olive Leaf as a Source of Antibacterial Compounds Active against Antibiotic-Resistant Strains of Campylobacter jejuni Campylobacter coli Antibiotics 2023 12 26 10.3390/antibiotics12010026 PMC9854969 36671227 45. Kim S. Lee H. Lee S. Yoon Y. Choi K.-H. Antimicrobial Action of Oleanolic Acid on Listeria monocytogenes Enterococcus faecium Enterococcus faecalis PLoS ONE 2015 10 e0118800 10.1371/journal.pone.0118800 25756202 PMC4355482 46. Carraro L. Fasolato L. Montemurro F. Martino M.E. Balzan S. Servili M. Novelli E. Cardazzo B. Polyphenols from Olive Mill Waste Affect Biofilm Formation and Motility in Escherichia coli Microb. Biotechnol. 2014 7 265 275 10.1111/1751-7915.12119 24628798 PMC3992022 47. Zouhir A. Jridi T. Nefzi A. Ben Hamida J. Sebei K. Inhibition of Methicillin-Resistant Staphylococcus aureus Pharm. Biol. 2016 54 3136 3150 10.1080/13880209.2016.1190763 27246787 48. Lim A. Subhan N. Jazayeri J.A. John G. Vanniasinkam T. Obied H.K. Plant Phenols as Antibiotic Boosters: In Vitro Interaction of Olive Leaf Phenols with Ampicillin Phytother. Res. 2016 30 503 509 10.1002/ptr.5562 26931616 49. Cela E.M. Urquiza D. Gómez M.I. Gonzalez C.D. New Weapons to Fight against Staphylococcus aureus Antibiotics 2023 12 1477 10.3390/antibiotics12101477 37887178 PMC10603739 50. Kaushik A. Kest H. Sood M. Steussy B. Thieman C. Gupta S. Biofilm Producing Methicillin-Resistant Staphylococcus aureus Pathogens 2024 13 76 10.3390/pathogens13010076 38251383 PMC10819455 51. Porras-Luque J.I. Antimicrobianos tópicos en Dermatología Actas Dermo-Sifiliográficas 2007 98 29 39 10.1016/S0001-7310(07)70179-5 18093497 52. Zabielinski M. McLeod M.P. Aber C. Izakovic J. Schachner L.A. Trends and Antibiotic Susceptibility Patterns of Methicillin-Resistant and Methicillin-Sensitive Staphylococcus aureus JAMA Dermatol. 2013 149 427 432 10.1001/jamadermatol.2013.2424 23325388 53. Zhanel G.G. Adam H.J. Baxter M. Lagace-Wiens P.R.S. Karlowsky J.A. In Vitro Activity and Resistance Rates of Topical Antimicrobials Fusidic Acid, Mupirocin and Ozenoxacin against Skin and Soft Tissue Infection Pathogens Obtained across Canada (CANWARD 2007–2018) J. Antimicrob. Chemother. 2021 76 1808 1814 10.1093/jac/dkab098 33792700 54. Jazideh F. Tarkhnishvili E. Hashemi Feyzabadi S.E. Effects of Olea europaea GMJ Med. 2023 2 63 67 55. Martínez-Beamonte R. Barranquero C. Gascón S. Mariño J. Arnal C. Estopañán G. Rodriguez-Yoldi M.J. Surra J.C. Martín-Belloso O. Odriozola-Serrano I. Effect of Virgin Olive Oil as Spreadable Preparation on Atherosclerosis Compared to Dairy Butter in Apoe-Deficient Mice J. Physiol. Biochem. 2024 80 671 683 10.1007/s13105-024-01029-8 38787512 PMC11502577 56. Clinical and Laboratory Standards Institute (CLSI) Performance Standards for Antimicrobial Disk Susceptibility Test Approved Standards—Twelfth Edition Clinical and Laboratory Standards Institute Wayne, PA, USA 2015 978-1-56238-985-7 57. Clinical and Laboratory Standards Institute (CLSI) Methods for Dilution Antimicrobial Susceptibility Tests for Bacteria That Grow Aerobically Approved Standard—Ninth Edition Clinical and Laboratory Standards Institute Wayne, PA, USA 2012 978-1-56238-783-9 58. Eucast. S, I and R Definitions Available online: https://www.eucast.org/newsiandr (accessed on 23 September 2024) 59. MIC EUCAST Available online: https://mic.eucast.org/search/ (accessed on 27 March 2025) 60. The Jamovi Project 2022 Available online: https://www.jamovi.org/ (accessed on 1 December 2024) Figure 1 Box plots. ( A B C D p p p Figure 2 Scatter plot for age (years) versus number of antibiotic resistances (N_R) in MRSA isolates. Note: The absolute frequency of samples for each antibiotic resistance and each age is shown in green and orange respectively. The blue line shows the regression line. Figure 3 Relative frequency (%) of strains by number of antibiotic resistances classified and type of pathology. DF: diabetic foot; PU: pressure ulcer; IS: immunosuppression; SIWODF: skin infection without dermatological factors; SIWDD: skin infection with dermatology disease; SP: surgical procedure; VD: vascular disease. Figure 4 Relative frequency (%) of MSSA and MRSA strains classified by type of sample. Figure 5 Log 10 w v A B Figure 6 Relative frequency (%) of susceptible strains per antibiotic family. Olive leaf extract (OLE), 25 to 6.25% w v pharmaceuticals-18-01358-t001_Table 1 Table 1 Descriptive characteristics of MSSA, MRSA, overall samples, age, and quantity of antibiotic resistances: age range, number of antibiotic resistances, sample type, location, and associated pathology.  MSSA N (%) MRSA N (%) Overall Samples N (%) Age Quantity of Antibiotic Resistances  103 (81.7) 23 (18.3) 126 56.0 (27.5–73.8) 3.0 (2.0–5.0) Gender      Men 63 (61.2) 11 (47.8) 74 (58.7) 59.5 (25.3–72.8) 3.5 (2.0–5.0) Women 40 (38.8) 12 (52.2) 52 (41.3) 50.0 (28.5–74.8) 3.0 (2.0–5.0) Age (years)      0–18 22 (21.4) 4 (17.4) 26 (20.6) 8.0 (5.0–12.8) 3.5 (2.0–4.0) 19–65 44 (42.7) 10 (43.5) 54 (42.9) 50.0 (36.3–58.8) 3.5 (2.0–5.0) >65 37 (35.9) 9 (39.1) 46 (36.5) 78.5 (72.3–85.3) 2.0 (2.0–4.75) Number of antibiotic resistances      0–5 97 (94.2) 4 (17.4) 101 (80.2) 56.0 (20.0–72.0) 2.0 (2.0–4.0) 6–10 6 (5.8) 5 (21.7) 11 (8.7) 45.0 (35.0–59.0) 7.0 (6.0–8.5) 11–15 0 (0) 14 (60.9) 14 (11.1) 71.5 (50.3–84.3) 12.5 (11.0–13.8) Type of sample      Abscess 10 (9.7) 2 (8.7) 12 (9.5) 58.5 (27.8–74.3) 2.0 (2.0–5.25) Pressure ulcer 2 (1.9) 4 (17.4) 6 (4.8) 60.5 (53.3–73.0) 12.0 (7.25–13.8) Other Ulcers 18 (17.5) 4 (17.4) 22 (17.5) 73.0 (64.5–86.8) 4.0 (2.0–6.0) Surgical wound 27 (26.2) 5 (21.7) 32 (25.4) 62.0 (47.8–72.5) 2.0 (2.0–4.25) Skin lesion 46 (44.7) 8 (34.8) 54 (42.9) 31.0 (12.3–54.5) 3.0 (2.0–4.0) Location      Generalised (all body) 2 (1.9) 0 (0) 2 (1.6) 3.5 (3.25–3.75) 4.5 (4.25–4.75) Arm 8 (7.8) 2 (8.7) 10 (7.9) 59.0 (40.3–69.5) 3.50 (2.0–5.0) Hand 3 (2.9) 2 (8.7 5 (4.0) 50.0 (22.0–68.0) 5.0 (4.0–5.0) Head 21 (20.4) 3 (13.0) 24 (19.0) 50.5 (18.8–73.3) 4.0 (2.0–4.0) Trunk 21 (20.4) 7 (30.4) 28 (22.2) 58.0 (30.0–68.0) 2.5 (2.0–6.25) Leg 26 (25.2) 3 (13.0) 29 (23.0) 64.0 (24.0–82.0) 2.0 (2.0–4.0) Foot 20 (19.4) 4 (17.4) 24 (19.0) 62.5 (50.0–80.5) 3.0 (2.0–6.0) Toenail 2 (1.9) 2 (8.7) 4 (3.2) 34.0 (28.0–39.5) 2.0 (1.5–3.25) Associated pathology      Diabetic foot 7 (6.8) 2 (8.7) 9 (7.1) 62.0 (56.0–66.0) 4.0 (2.0–6.0) Immunosuppression 4 (3.9) 2 (8.7) 6 (4.8) 76.5 (73.5–78.8) 3.5 (2.25–9.25) Immobilisation (pressure ulcer) 2 (1.9) 3 (13.0) 5 (4.0) 60.0 (51.0–61.0) 11 (6.0–13.0) Skin infection w o 31 (30.1) 8 (34.8) 39 (31.0) 47.0 (26.5–65.5) 2.0 (2.0–4.0) Skin infection with dermatological disease 22 (21.4) 1 (4.3) 23 (18.3) 12.0 (6.50–18.0) 4.0 (2.0–4.0) Surgical procedure 25 (24.3) 3 (13.0) 28 (22.2) 65.0 (47.8–74.0) 2.0 (2.0–4.0) Vascular disease 12 (11.7) 4 (17.4) 16 (12.7) 79.0 (68.8–86.5) 4 (2.75–6.5) Note. Data are expressed as absolute (N) and relative (%) frequencies for categorical variables, and as medians and interquartile ranges (M (P25–P75)) for continuous ones. MSSA: methicillin-susceptible Staphylococcus aureus Staphylococcus aureus w o pharmaceuticals-18-01358-t002_Table 2 Table 2 MSSA ATCC 29213 and MRSA ATCC 700699 concentration after 0, 2, 4, 8, and 24 h, treated either with 12.5% w v  MSSA MRSA  Control OLE Control OLE 0 (hours) 5.95 ± 0.11 5.95 ± 0.11 5.76 ± 0.25 5.76 ± 0.25 2 (hours) 6.60 ± 0.18 0.22 ± 0.53 6.17 ± 0.26 0.00 ± 0.00 4 (hours) 7.42 ± 0.33 0.17 ± 0.41 6.83 ± 0.33 0.00 ± 0.00 8 (hours) 8.49 ± 0.10 0.00 ± 0.00 8.12 ± 0.20 0.00 ± 0.00 24 (hours) 9.37 ± 0.13 0.00 ± 0.00 9.14 ± 0.22 0.00 ± 0.00 Note. Data report means and standard deviations (SDs) of log 10 Staphylococcus aureus Staphylococcus aureus pharmaceuticals-18-01358-t003_Table 3 Table 3 Antibiotic susceptibility characterisation for overall analysed and resistant isolates, including MSSA and MRSA. Antibiotic Class Antibiotic Overall N Resistant N (%) MSSA N (%) MRSA N (%) p Fucidane Fusidic acid 28 10 (35.7) 4 (22.2) 6 (60.0)  Aminoglycosides  126 31 (24.6) 17 (16.5) 14 (60.9) <0.001  Amikacin 119 16 (13.4) 3 (3.0) 13 (68.4) <0.001  Gentamicin 126 13 (10.3) 5 (4.9) 8 (34.8) <0.001  Tobramycin 119 29 (24.4) 17 (17.0) 12 (63.2) <0.001 Penicillins  126 101 (80.2) 78 (75.7) 23 (100.0) 0.008 Cephalosporins Ceftaroline * 119 0 (0.0) 0 (0) 0 (0.0)  Fluoroquinolones  126 29 (23.0) 12 (11.7) 17 (73.9) <0.001  Ciprofloxacin 126 28 (22.2) 11 (10.7) 17 (73.9) <0.001  Levofloxacin 119 24 (20.2) 9 (9.0) 15 (78.9) <0.001  Moxifloxacin 22 22 (100.0) 7 (100) 15 (100)  Lincosamides Clindamycin 126 39 (31.0) 28 (27.2) 11 (47.8)  Macrolides Erythromycin 125 47 (37.6) 31 (30.1) 16 (72.7) <0.001 Streptogramins Quinupristin–dalfopristin 119 1 (0.8) 0 (0.0) 1 (5.3) 0.021 Oxazolidinones Linezolid * 126 0 (0.0) 0 (0.0) 0 (0.0)  Tetracyclines  126 10 (7.9) 6 (5.8) 4 (17.4)   Minocycline 118 1 (0.8) 0 (0.0) 1 (5.3) 0.022  Tetracycline 126 10 (7.9) 6 (5.8) 4 (17.4)  Phenicols Chloramphenicol 119 2 (1.7) 1 (1.0) 1 (5.3)  Lipopeptides Daptomycin * 119 0 (0.0) 0 (0.0) 0 (0.0)  Phosphonic acids Fosfomycin 118 1 (0.8) 0 (0.0) 1 (5.3) 0.022  Mupirocin 126 22 (17.5) 13 (12.6) 9 (39.1) 0.002  Pristinamycin * 119 0 (0.0) 0 (0.0) 0 (0.0)  Ansamycins Rifampicin 126 1 (0.8) 0 (0.0) 1 (4.3) 0.034 Folate pathway inhibitors Trimethoprim–sulfamethoxazole * 126 0 (0.0) 0 (0.0) 0 (0.0)  Glycopeptides and lipoglycopeptides Teicoplanin * 119 0 (0.0) 0 (0.0) 0 (0.0)   Vancomycin * 119 0 (0.0) 0 (0.0) 0 (0.0)  Olive leaf extract OLE 25% * 126 0 (0.0) 0 (0.0) 0 (0.0)   OLE 12.5% * 126 0 (0.0) 0 (0.0) 0 (0.0)   OLE 6.25% * 126 0 (0.0) 0 (0.0) 0 (0.0)   OLE 3.125% 126 119 (94.5) 99 (96.1) 20 (87.0)  Note. Data are expressed as absolute (N) and relative (%) frequencies for categorical variables. p 2 Staphylococcus aureus Staphylococcus aureus ",
  "metadata": {
    "Title of this paper": "The Jamovi Project",
    "Journal it was published in:": "Pharmaceuticals",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472457/"
  }
}