{
  "title": "Paper_214",
  "abstract": "pmc JCI Insight JCI Insight 3101 jciinsight JCI Insight JCI Insight 2379-3708 American Society for Clinical Investigation PMC12487672 PMC12487672.1 12487672 12487672 40694426 10.1172/jci.insight.192507 192507 1 Research Article DGAT2 reduction and lipid dysregulation drive psoriasis development in keratinocyte-specific SPRY1-deficient mice Li Ying-Ying lyyupup99@zju.edu.cn Ye Li-Ran 21918595@zju.edu.cn Cui Ying-Zhe cuiyingzhe90@zju.edu.cn https://orcid.org/0000-0003-2758-3114 Xu Fan fannyxu@zju.edu.cn Chen Xi-Bei chenxb@zju.edu.cn Zhang Feng-Fei zhangfengfei@zju.edu.cn Lu Yi 22318145@zju.edu.cn Zheng Yu-Xin zhengyuxin@zju.edu.cn Man Xiao-Yong manxy@zju.edu.cn Department of Dermatology, Second Affiliated Hospital, Zhejiang University School of Medicine, Hangzhou, China. Address correspondence to: Xiao-Yong Man, Department of Dermatology, Second Affiliated Hospital, Zhejiang University School of Medicine, Hangzhou, Zhejiang, China. Phone: 86.13600516219; Email: manxy@zju.edu.cn 22 7 2025 9 9 2025 10 17 498102 e192507 18 2 2025 18 7 2025 22 07 2025 02 10 2025 02 10 2025 © 2025 Li et al. 2025 Li et al. https://creativecommons.org/licenses/by/4.0/ This work is licensed under the Creative Commons Attribution 4.0 International License. To view a copy of this license, visit http://creativecommons.org/licenses/by/4.0/ This article is available online at https://insight.jci.org/articles/view/192507 Psoriasis is a chronic autoimmune skin disease characterized by abnormal keratinocyte proliferation and immune dysregulation. Altered lipid metabolism has been implicated in its pathogenesis, but the underlying mechanisms remain unclear. In this study, we generated a keratinocyte-specific Sprouty RTK signaling antagonist 1 (SPRY1) knockout (Spry1 ΔEpi ΔEpi ΔEpi ΔEpi +  The dysregulation of DGAT2 and lipid metabolism enhances TLR3-mediated inflammation in keratinocytes and promotes CD8⁺ T cell activation, driving psoriasis development in keratinocyte-specific SPRY1-deficient mice. Dermatology Inflammation Metabolism Cellular immune response Lipidomics National Natural Science Foundation of China https://doi.org/10.13039/501100001809 82230104,82203905,81930089 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Psoriasis is a common chronic autoimmune skin disorder characterized by excessive immune responses that drive abnormal proliferation and differentiation of epidermal keratinocytes. It presents with erythematous plaques, covered by silvery-white scales, and thickened skin lesions, frequently accompanied by intense pruritus and discomfort ( 1 2 3 4 Altered lipid metabolism is a key factor in the development of psoriasis. Imbalances in lipid composition are evident not only in the plasma ( 5 6 10 11 13 14 15 16 17 18 19 20 21 SPRY1 (Sprouty RTK signaling antagonist 1), a member of the Sprouty protein family, functions as a key negative regulator of receptor tyrosine kinase (RTK) signaling ( 22 23 24 25 ΔEpi 26 In this study, we investigated the underlying causes of psoriasis-like symptoms in Spry1 ΔEpi ΔEpi + Results Dysregulated glyceride metabolism and decreased DGAT2 expression in lesional psoriatic skin. The table ( Figure 1A 27 32 Figure 1B Supplemental Figure 1 https://doi.org/10.1172/jci.insight.192507DS1 Figure 1C Figure 1D Diacylglycerol acyltransferase 2 (DGAT2) is a key enzyme in the synthesis of TG from DG and fatty acids (FAs). This process represents the final step in the TG synthesis pathway and is a crucial step in fat synthesis and storage. Given the abnormalities of glycerides in psoriasis lesions and the key role of DGAT2 in glyceride metabolism, we examined the expression of DGAT2 in psoriasis using datasets from the National Center for Biotechnology Information (NCBI) Gene Expression Omnibus (GEO), such as GSE30999 GSE13355 Figure 1E GSE197056 Figure 1F To validate these findings at the protein level, Western blot (WB) analysis was performed using keratinocytes from both healthy individuals and patients with psoriasis. The results showed a notable reduction in DGAT2 protein levels in patients compared with healthy controls ( Figure 1G Figure 1H Figure 1I Figure 1J Spry1 ΔEpi Based on our previous findings that Spry1 in keratinocytes suppresses psoriasis-like skin inflammation by inhibiting cathelicidin production and cutaneous immune activation, we next examined the impact of Spry1 loss in epidermal keratinocytes ( 25 ΔEpi 26 33 ΔEpi Figure 2A Figure 2B ΔEpi ΔEpi Figure 2C ΔEpi ΔEpi Figure 2D ΔEpi Figure 2E Similar to the glyceride abnormalities observed in psoriasis lesions, in the IMQ-induced psoriasis-like mouse model (data derived from ref. 6 Supplemental Figure 2A ΔEpi ΔEpi Figure 2F ΔEpi ΔEpi ΔEpi Supplemental Figure 2B ΔEpi Figure 2G ΔEpi Figure 2H SPRY1 is associated with DGAT2 expression and stability in keratinocytes. Glyceride metabolism consists of 2 main pathways: the glyceride salvage pathway and the de novo glyceride synthesis pathway ( Figure 3A ΔEpi Figure 3B ΔEpi Figure 3C GSE13355 GSE30999 Supplemental Figure 3A ΔEpi ΔEpi Figure 3D ΔEpi ΔEpi Figure 3E ΔEpi Figure 3F To investigate the regulatory mechanism underlying DGAT2 downregulation, we first asked whether SPRY1 controls Dgat2 Dgat2 Supplemental Figure 3B Dgat2 Supplemental Figure 3C Given the observed protein-level correlation between SPRY1 and DGAT2, we next explored whether SPRY1 modulates DGAT2 posttranslationally. Co-immunoprecipitation experiments verified a direct interaction between SPRY1 and DGAT2 in keratinocytes ( Figure 3G Supplemental Figure 3D Figure 3H To further support the physical interaction, molecular modeling using AlphaFold3 predicted a stable complex between SPRY1 and DGAT2, with hydrogen bonds forming between SPRY1 (residues TYR-53, ASN-51, and THR-37) and DGAT2 (residues THR-147, ASN-149, and ARG-154). All predicted hydrogen bonds were within a reasonable spatial distance (<3.6 Å), supporting the formation of a stable interaction interface ( Supplemental Figure 3E Figure 3I Figure 3I Altered lipid profiles in the epidermis and plasma of Spry1 ΔEpi To further investigate the lipid metabolic dysregulation in the Spry1 ΔEpi ΔEpi ΔEpi Figure 4A ΔEpi ΔEpi Figure 4B ΔEpi Figure 4C ΔEpi Figure 4D Figure 4E ΔEpi Figure 4, F and G Figure 4F ΔEpi Figure 4, H and I Lipid alterations in the plasma of Spry1 ΔEpi Supplemental Figure 4A Supplemental Figure 4B Supplemental Figure 4 ΔEpi ΔEpi DGAT2 inhibition and EPA amplify TLR3-mediated inflammatory responses in keratinocytes. DGAT2 could catalyze the conversion of DG and EPA (a UFA) into TG, and its expression is reduced in keratinocytes of Spry1 ΔEpi ΔEpi Figure 5A 34 36 37 38 Figure 5B Figure 5C Figure 5D IL-1β + + Supplemental Figure 5B + + Figure 5E Figure 5F To assess whether the EPA+DGAT2i condition mimics a psoriatic keratinocyte phenotype, we compared it with untreated primary lesional epidermal keratinocytes (PLEKs) ( Supplemental Figure 5C Previous studies have shown that TLR3 serves as a pattern recognition receptor that detects double-stranded RNA and primarily participates in antiviral immune responses ( 39 40 Figure 5, G and H Supplemental Figure 5 Elevated DGAT2 secretion enhances CD8 + We observed increased DGAT2 levels in the supernatant of keratinocytes derived from patients with psoriasis compared with healthy controls, despite reduced intracellular DGAT2 expression ( Figure 6A Figure 6B ΔEPI Flow cytometry analysis of epidermal samples from patients with psoriasis and healthy controls demonstrated that CD8 + Figure 6C Supplemental Figure 6B + 41 ΔEPI + Figure 6D To investigate the effects of DGAT2 on CD8 + + Figure 6E Supplemental Figure 6C + + Figure 6F + Figure 6G + + Figure 6H Figure 6H Figure 6I + To explore whether the effect of DGAT2 on CD8 + + Supplemental Figure 6D + + + Discussion In this study, we investigate the role of DGAT2 and lipid metabolism in the skin lesions of both a psoriasis-like mouse model (Spry1 ΔEpi + We found that in the lesional psoriatic skin, there are a substantial disruption of glyceride metabolism and a marked reduction in DGAT2 expression. A study has reported that Dgat2 gene was decreased in human psoriatic skin ( 42 16 21 43 44 45 Using the Spry1 ΔEpi Cyp21a1 Cyp17a1 Col17a1 46 47 48 49 We also found reduced DGAT2 expression in the epidermis of Spry1 ΔEpi 34 50 51 52 39 40 CD8 + 53 54 55 56 57 + 58 59 60 18 61 A limitation to consider is that DGAT2 mRNA is expressed in the sebaceous glands of normal human skin, where it may help produce TGs and sebum ( 42 62 63 Spry1 In conclusion, we found that Spry1 ΔEpi ΔEpi ΔEpi + Methods Sex as a biological variable. Sex as a biological variable was not initially considered in this study. Both male and female mice, as well as patients, were included in the analysis. Mice. Epidermal keratinocyte-specific Spry1-knockout (Spry1 ΔEpi 26 Epidermal keratinocyte culture. Primary human epidermal keratinocytes, including normal human epidermal keratinocytes (NHEKs) and PLEKs, were isolated from skin samples obtained at the Second Affiliated Hospital, Zhejiang University School of Medicine, as previously described. Primary epidermal keratinocytes from both human and mouse skin were isolated using the same procedure ( 25 Isolation of peripheral blood mononuclear cells (PBMCs). To prepare PBMCs, fresh anticoagulated blood (2 mL) was collected from donors and diluted 1:1 with calcium- and magnesium-free PBS or another suitable buffer. Next, 3 mL of Lymphocyte Separation Medium (Biosharp, #BL590) was added to a centrifuge tube, and the diluted blood was carefully layered on top of the medium. The tube was centrifuged at 750 × g g Human peripheral CD8 + Human purified CD8 + The collected cell suspension was centrifuged at 300 × g 2 g For subsequent assays, CD8 + 5 + Cell proliferation assay. Primary human CD8 + C34554 5 Apoptosis assay. For apoptosis analysis, cells were stained using an Annexin V-FITC Apoptosis Kit (Beyotime Biotechnology, #C1062S) following the manufacturer’s instructions. Primary human CD8 + 5 g g RNA isolation and quantitative real-time PCR. Total RNA was extracted from the samples using FastPure Cell/Tissue Total RNA Isolation Kit V2 (Vazyme, #RC112-01). One microgram of total RNA was used to synthesize cDNA with HiScript III All-in-one RT SuperMix Perfect for qPCR (Vazyme, #R333-01). Real-time RT-PCR was performed using FastStart Universal SYBR Green Master Mix (ROX) (Roche Life Science, #04913914001) following the manufacturer’s instructions. Primer sequences are listed in Supplemental Table 5 Western blot analysis. Protein levels were measured using a BCA protein assay kit (Thermo Fisher Scientific, 23225). Proteins were separated by SDS-PAGE and transferred onto a nitrocellulose membrane (MilliporeSigma). The membrane was blocked with 5% skim milk in TBS-T (20 mM Tris-HCl, pH 7.5, 137 mM NaCl, and 0.05% Tween 20) for 1 hour at room temperature, followed by overnight incubation with primary antibodies (details provided in Supplemental Table 4 Supplemental Table 3 Histology and immunofluorescence. Paraffin-embedded skin sections were obtained from healthy individuals and patients with psoriasis. For histology, 8-μm-thick skin sections were stained with H&E. For immunofluorescence staining, tissues were embedded in optimal cutting temperature compound. Six-micrometer-thick skin sections were fixed in 4% paraformaldehyde, permeabilized for 10 minutes with 0.1% Triton X-100, and blocked with 3% BSA (Sigma-Aldrich, A9418). The sections were then incubated with primary antibodies, followed by Alexa 488/555–conjugated secondary antibodies (1:1000) for 1 hour at room temperature, with 3 PBS washes in between. Finally, the sections were stained with DAPI, mounted with antifade mounting medium (Solarbio), and imaged using a fluorescence microscope (Leica DM5500B). Lipid analysis by Nile red. A stock solution of Nile red (1 mg/mL; Sigma-Aldrich) in acetone was diluted to a 1 μg/mL working solution in a 75:25 mixture of glycerol and water, then mixed thoroughly by vortexing. Frozen skin sections from mice and humans were thawed at room temperature for 5 minutes, briefly rinsed with PBS, and stained with the working solution in the dark for 30 minutes. Afterward, the sections were stained with DAPI for 10 minutes, and coverslips were applied. For staining primary human and mouse keratinocytes, cells were cultured on coverslips, washed once with PBS, and stained following the same protocol as used for skin sections. Images were taken using a fluorescence microscope (Leica DM5500B). ELISA. Cell supernatants were collected from primary keratinocytes of healthy individuals, patients with psoriasis, Spry1-knockout mice, and wild-type mice. When the keratinocytes reached 60% confluence, stimulants were added to the culture medium, and the supernatant was collected after 48 hours. The concentrations of diacylglycerol, triglyceride, and IL-23 in the supernatant were measured using ELISA kits (Cloud-Clone Corp, #CEC038Ge; Nanjing Jiancheng Bioengineering Institute, #A110-1-1; UpingBio, #SYP-M0194) according to the manufacturer’s instructions. Plasmid construction and transfection. The pCMV-Dgat2(mouse)-3×HA-Neo plasmid encodes the mouse DGAT2 gene with 3 HA tags for detection. Similarly, the pCMV-Spry1(mouse)-3×FLAG-Neo plasmid was designed to express the mouse Spry1 gene fused with a 3×FLAG tag. Plasmids were obtained from MiaoLingBio, China. Both plasmids feature a CMV promoter to ensure strong gene expression in mammalian cells and a neomycin resistance (NeoR/KanR) cassette for cell selection. The backbone includes an SV40 origin for replication in mammalian cells, an AmpR gene for bacterial selection, and multiple cloning sites with restriction enzyme recognition sites, such as KpnI, HindIII, and EcoRI, for easy gene manipulation. Additionally, these plasmids incorporate a WPRE element to enhance expression levels and an HSV TK poly(A) signal for proper transcription termination. We seeded cells in a 6-well plate 1 day before transfection to ensure they reached 70%–90% confluence. To prepare the DNA-transfection reagent complexes, we diluted 5 μg of plasmid DNA per well in Opti-MEM™ medium (Thermo Fisher Scientific, #31985070). Separately, we diluted Lipofectamine™ 3000 (Thermo Fisher Scientific, #L3000015) in Opti-MEM™ medium according to the manufacturer’s instructions. We combined the diluted DNA and transfection reagent in a 1:1 ratio, mixed gently, and incubated at room temperature for 20 minutes to allow complex formation. We removed the existing growth medium from the cells and replaced it with Opti-MEM™ medium. We carefully added the DNA-transfection reagent complexes dropwise to the cells, ensuring even distribution, and gently rocked the plate to mix. We incubated the cells with the complexes at 37°C in a humidified incubator with 5% CO 2 Flow cytometric analysis. The skin sample was digested overnight at 4 °C using Dispase medium (Gibco, #17105041). For the preparation of a single-cell suspension, the epidermis was separated and further digested with 0.25% trypsin (Thermo Fisher Scientific, #15050065). After digestion, the epidermal cells were neutralized with fetal bovine serum and centrifuged at 450 g g + Supplemental Table 1 Immunoprecipitation. The mouse keratinocytes were transfected with plasmids encoding FLAG-spry1, HA-dgat2, or both, as indicated. After 72 hours, cells were washed with PBS and lysed in RIPA Complete Lysis Buffer (Beyotime Biotechnology, #P0038-100ml) supplemented with Protease and Phosphatase Inhibitors (Thermo Fisher Scientific, #78442) to extract the proteins. The lysates were then incubated with anti-FLAG antibody-conjugated beads (AlpalifeBio, #KTSM1338) at 4°C for 4 hours with gentle rotation to allow immunoprecipitation of FLAG-tagged spry1. Following extensive washing with lysis buffer to remove unbound proteins, the beads were subjected to magnetic separation, resuspended in 1× loading buffer, and boiled for 5 minutes before western blot analysis. Non-targeted lipid metabolism profiling. Metabolites were extracted from the samples using organic reagents for protein precipitation, simultaneously preparing quality control (QC) samples by mixing equal volumes of the experimental samples. The extracted samples were then analyzed using a random sample order, with QC samples inserted at the beginning, middle, and end of the sample sequence for technical replicate evaluation. The samples underwent both positive and negative ion scanning in mass spectrometry. The raw mass spectrometry data were converted into readable mzXML format using the MSConvert software from Proteowizard. Peak extraction was performed using XCMS software, followed by quality control of the extracted peaks. The extracted compounds were annotated for adduct ions using CAMERA software, and primary identification was performed using metaX software. Identification was conducted with both primary mass spectrometry data and secondary mass spectrometry data, which were matched against an in-house standard database. Candidate metabolites were annotated using databases such as HMDB, KEGG, and others, providing information on the metabolites’ physicochemical properties and biological functions. MetaX software was used to quantify the differential metabolites and screen for significant metabolic differences. Chromatin immunoprecipitation (ChIP). Chromatin immunoprecipitation was performed using epidermal tissue from mouse skin. The tissue was immediately frozen in liquid nitrogen and ground to a fine powder before further processing. ChIP assays were carried out using the Chromatin Immunoprecipitation (ChIP) Assay Kit (Millipore, #17-295), following the manufacturer’s instructions with minor adjustments for epidermal tissue. Briefly, chromatin was cross-linked by incubating the tissue homogenate with 1% formaldehyde at 37°C for 10 minutes. The reaction was quenched, and the material was washed with ice-cold PBS containing protease inhibitors. The pellet was resuspended in SDS lysis buffer and incubated on ice for 10 minutes. Chromatin was sheared to an average size of 200–1000 bp using a Cole Parmer ultrasonic processor (50 W, 2 mm probe, 30% amplitude) with 3–4 cycles of 10-second pulses, while maintaining the sample on ice. After centrifugation at 12,000 g 3 Supplemental Table 2 Cycloheximide chase assay. To assess protein stability, a cycloheximide chase assay was performed. Primary mouse keratinocytes were cultured under standard conditions and treated with cycloheximide (MCE, #HY-12320) at a final concentration of 20 uM to inhibit de novo protein synthesis. Cells were harvested at multiple time points (0, 2, 4, and 8 hours) following CHX treatment for protein extraction. After lysis in RIPA buffer containing protease inhibitors, total protein was collected and analyzed by western blotting to assess protein levels. Statistics. Statistical analyses were conducted using GraphPad Prism 10.2.3. Unpaired 2-tailed Student’s t tests were used to compare differences between 2 groups, and 1-way analysis of variance (ANOVA) followed by Tukey’s post hoc test was used to compare differences between multiple groups. Data are presented as the mean ± SD, unless stated otherwise. A P P Study approval. The collection of patient samples was approved by the Ethics Committee of the Second Affiliated Hospital of Zhejiang University School of Medicine (approval number 2022-1062). All participants provided written informed consent for the procedures involved. All animal experiments were approved by the Animal Ethics Committee of the Second Affiliated Hospital of Zhejiang University School of Medicine (2020.NO.101) and conducted following the committee’s guidelines. Data availability. All data associated with this study are present in this article or in the supplement, and values for all data points in graphs are reported in the Supporting Data Values GSE289141 GSE289142 Author contributions XYM and YYL performed conceptualization; YZC and FX performed data curation; YZC and FX performed formal analysis; XYM acquired funding; YYL, LRY, YZC, FX, XBC, FFZ, YL, and YXZ investigated; YYL and LRY developed methodology; XYM and YYL performed project administration; XYM supervised; YYL, LRY, YZC, and FX prepared the original draft; and YYL and XYM performed review and editing. Supplementary Material Supplemental data Unedited blot and gel images Supporting data values The authors would like to thank all the patients and healthy donors for their enthusiastic participation in the study; Yong Yang, Wei Li, Xu Yao, Yu-ping Lai, and Ling-juan Zhang for providing kind advice on this work; Yuqiong Xie, Meirong Yu, Amin Liu, and Yonglan Zhu, Center for Basic and Translational Research, The Second Affiliated Hospital of Zhejiang University for laboratory management and technical support; and BioRender.com for providing professional icons for figures and templates for the graphical abstract. This study was supported by grants from the National Natural Science Foundation of China (numbers 82230104, 82203905, and 81930089). Conflict of interest: Copyright: Reference information: JCI Insight 1 Komiya E et al Molecular and cellular mechanisms of itch in psoriasis Int J Mol Sci 2020 21 21 8406 10.3390/ijms21218406 33182442 PMC7664892 2 Zeidler C et al Pruritus in autoimmune and inflammatory dermatoses Front Immunol 2019 10 1303 10.3389/fimmu.2019.01303 31293565 PMC6598632 3 Gisondi P et al Pathogenesis of chronic plaque psoriasis and its intersection with cardio-metabolic comorbidities Front Pharmacol 2020 11 117 10.3389/fphar.2020.00117 32161545 PMC7052356 4 Woo YR et al The risk of systemic diseases in those with psoriasis and psoriatic arthritis: from mechanisms to clinic Int J Mol Sci 2020 21 19 7041 10.3390/ijms21197041 32987907 PMC7583918 5 Greve AM et al Elevated plasma triglycerides increase the risk of psoriasis: a cohort and Mendelian randomization study Br J Dermatol 2024 191 2 209 215 10.1093/bjd/ljae089 38411598 6 Liu P et al Lipidomic profiling reveals metabolic signatures in psoriatic skin lesions Clin Immunol 2023 246 109212 10.1016/j.clim.2022.109212 36563946 7 Matwiejuk M et al The interplay between bioactive sphingolipids in the psoriatic skin and the severity of the disease Int J Mol Sci 2023 24 14 11336 37511095 10.3390/ijms241411336 PMC10378918 8 Gruber F et al The impact of recent advances in lipidomics and redox lipidomics on dermatological research Free Radic Biol Med 2019 144 256 265 10.1016/j.freeradbiomed.2019.04.019 31004751 9 Burger B et al Abnormalities of sphingolipids metabolic pathways in the pathogenesis of psoriasis Metabolites 2023 13 2 291 10.3390/metabo13020291 36837912 PMC9968075 10 Tyrrell VJ et al Lipidomic and transcriptional analysis of the linoleoyl-omega-hydroxyceramide biosynthetic pathway in human psoriatic lesions J Lipid Res 2021 62 100094 10.1016/j.jlr.2021.100094 34171322 PMC8326207 11 Zhang X et al Abnormal lipid metabolism in epidermal Langerhans cells mediates psoriasis-like dermatitis JCI Insight 2022 7 13 e150223 10.1172/jci.insight.150223 35801590 PMC9310522 12 Lei L et al Lysophosphatidic acid mediates the pathogenesis of psoriasis by activating keratinocytes through LPAR5 Signal Transduct Target Ther 2021 6 1 19 10.1038/s41392-020-00379-1 33452232 PMC7810744 13 Sivasami P et al Obesity-induced dysregulation of skin-resident PPARγ + Immunity 2023 56 8 1844 1861 10.1016/j.immuni.2023.06.021 37478855 PMC10527179 14 Vietri Rudan M et al Human epidermal stem cell differentiation is modulated by specific lipid subspecies Proc Natl Acad Sci U S A 2020 117 36 22173 22182 10.1073/pnas.2011310117 32843345 PMC7486749 15 Naeem Z et al Role of the soluble epoxide hydrolase in keratinocyte proliferation and sensitivity of skin to inflammatory stimuli Biomed Pharmacother 2024 171 116127 10.1016/j.biopha.2024.116127 38198951 PMC10857809 16 Chitraju C et al The triglyceride synthesis enzymes DGAT1 and DGAT2 have distinct and overlapping functions in adipocytes J Lipid Res 2019 60 6 1112 1120 10.1194/jlr.M093112 30936184 PMC6547635 17 Wang L et al The role of DGAT1 and DGAT2 in tumor progression via fatty acid metabolism: a comprehensive review Int J Biol Macromol 2024 278 pt 3 134835 10.1016/j.ijbiomac.2024.134835 39154689 18 Li Y et al Dgat2 reduces hepatocellular carcinoma malignancy via downregulation of cell cycle-related gene expression Biomed Pharmacother 2019 115 108950 10.1016/j.biopha.2019.108950 31078041 19 Li J et al Dysregulation of lipid metabolism in Mkp-1 deficient mice during gram-negative sepsis Int J Mol Sci 2018 19 12 3904 10.3390/ijms19123904 30563203 PMC6321205 20 Arellano-García LI et al Comparative effects of viable Lactobacillus rhamnosus GG and its heat-inactivated paraprobiotic in the prevention of high-fat high-fructose diet-induced non-alcoholic fatty liver disease in rats Biofactors 2025 51 1 e2116 10.1002/biof.2116 39135211 PMC11680974 21 Brunner PM et al Early-onset pediatric atopic dermatitis is characterized by TH2/TH17/TH22-centered inflammation and lipid alterations J Allergy Clin Immunol 2018 141 6 2094 2106 10.1016/j.jaci.2018.02.040 29731129 22 Sun J et al Sprouty2 regulates positioning of retinal progenitors through suppressing the Ras/Raf/MAPK pathway Sci Rep 2020 10 1 13752 10.1038/s41598-020-70670-2 32792568 PMC7426826 23 Lu Z et al Inhibition of miR-29b suppresses MAPK signaling pathway through targeting SPRY1 in atherosclerosis Vascul Pharmacol 2018 102 29 36 10.1016/j.vph.2018.01.006 29398368 24 Wang P et al The role of Sprouty1 in the proliferation, differentiation and apoptosis of epidermal keratinocytes Cell Prolif 2018 51 5 e12477 10.1111/cpr.12477 30039569 PMC6528922 25 Zhou Y et al Sprouty1 exerts a preventive effect on the initiation of psoriasis by inhibiting innate immune antimicrobial peptide cathelicidin and immunocytes Cell Prolif 2022 55 10 e13290 10.1111/cpr.13290 35716036 PMC9528767 26 Cui Y-Z et al SPRY1 deficiency in keratinocytes induces follicular melanocyte stem cell migration to the epidermis through p53/stem cell factor/C-KIT signaling J Invest Dermatol 2024 144 10 2255 2266 10.1016/j.jid.2024.02.018 38462125 27 Ianiri G et al Malassezia: a commensal, pathogen, and mutualist of human and animal skin Annu Rev Microbiol 2022 76 757 782 10.1146/annurev-micro-040820-010114 36075093 28 Granchi C et al A patent review of monoacylglycerol lipase (MAGL) inhibitors (2013-2017) Expert Opin Ther Pat 2017 27 12 1341 1351 10.1080/13543776.2018.1389899 29053063 29 Bhattacharya N et al Epidermal lipids: key mediators of atopic dermatitis pathogenesis Trends Mol Med 2019 25 6 551 562 10.1016/j.molmed.2019.04.001 31054869 PMC6698381 30 Del Rosso JQ Kircik L The primary role of sebum in the pathophysiology of acne vulgaris and its therapeutic relevance in acne management J Dermatolog Treat 2024 35 1 2296855 10.1080/09546634.2023.2296855 38146664 31 Lwin SM et al Acne, quorum sensing and danger Clin Exp Dermatol 2014 39 2 162 167 10.1111/ced.12252 24524558 32 Simard M et al Current knowledge of the implication of lipid mediators in psoriasis Front Immunol 2022 13 961107 10.3389/fimmu.2022.961107 36091036 PMC9459139 33 Xu F et al CXCL10 secreted by SPRY1-deficient epidermal keratinocytes fuels joint inflammation in psoriatic arthritis via CD14 signaling J Clin Invest 2025 e186135 e186135 10.1172/JCI186135 40471688 PMC12321389 34 Mogilenko DA et al Metabolic and innate immune cues merge into a specific inflammatory response via the UPR Cell 2019 177 5 1201 1216 10.1016/j.cell.2019.03.018 31031005 35 Kang JY Lee J-O Structural biology of the Toll-like receptor family Annu Rev Biochem 2011 80 917 941 10.1146/annurev-biochem-052909-141507 21548780 36 Miller YI Shyy JY-J Context-dependent role of oxidized lipids and lipoproteins in inflammation Trends Endocrinol Metab 2017 28 2 143 152 10.1016/j.tem.2016.11.002 27931771 PMC5253098 37 Lavazais S et al IRAK4 inhibition dampens pathogenic processes driving inflammatory skin diseases Sci Transl Med 2023 15 683 eabj3289 10.1126/scitranslmed.abj3289 36791209 38 Lebre MC et al Human keratinocytes express functional Toll-like receptor 3, 4, 5, and 9 J Invest Dermatol 2007 127 2 331 341 10.1038/sj.jid.5700530 17068485 39 Kawasaki T Kawai T Toll-like receptor signaling pathways Front Immunol 2014 5 461 10.3389/fimmu.2014.00461 25309543 PMC4174766 40 Lomphithak T et al Receptor-interacting protein kinase 1 is a key mediator in TLR3 ligand and Smac mimetic-induced cell death and suppresses TLR3 ligand-promoted invasion in cholangiocarcinoma Cell Commun Signal 2020 18 1 161 10.1186/s12964-020-00661-3 33036630 PMC7545934 41 Zhang P et al The roles of T cells in psoriasis Front Immunol 2023 14 1081256 10.3389/fimmu.2023.1081256 37942312 PMC10628572 42 Wakimoto K et al A novel diacylglycerol acyltransferase (DGAT2) is decreased in human psoriatic skin and increased in diabetic mice Biochem Biophys Res Commun 2003 310 2 296 302 10.1016/j.bbrc.2003.09.015 14521909 43 Yenilmez B et al An RNAi therapeutic targeting hepatic DGAT2 in a genetically obese mouse model of nonalcoholic steatohepatitis Mol Ther 2022 30 3 1329 1342 10.1016/j.ymthe.2021.11.007 34774753 PMC8899521 44 Choi R-Y et al Scopoletin supplementation ameliorates steatosis and inflammation in diabetic mice Phytother Res 2017 31 11 1795 1804 10.1002/ptr.5925 28921708 45 Chen W et al The translational potential of miR-26 in atherosclerosis and development of agents for its target genes ACC1/2, COL1A1, CPT1A, FBP1, DGAT2, and SMAD7 Cardiovasc Diabetol 2024 23 1 21 10.1186/s12933-024-02119-z 38195542 PMC10777520 46 Zhang M-F et al Transcription factor Dmrt1 triggers the SPRY1-NF-κB pathway to maintain testicular immune homeostasis and male fertility Zool Res 2023 44 3 505 521 10.24272/j.issn.2095-8137.2022.440 37070575 PMC10236308 47 Urs S et al Sprouty1 is a critical regulatory switch of mesenchymal stem cell lineage allocation FASEB J 2010 24 9 3264 3273 10.1096/fj.10-155127 20410440 PMC2923355 48 Liu X et al SPRY1 promotes the degradation of uPAR and inhibits uPAR-mediated cell adhesion and proliferation Am J Cancer Res 2014 4 6 683 697 25520860 PMC4266704 49 Tian L et al A novel Sprouty4-ERK1/2-Wnt/β-catenin regulatory loop in marrow stromal progenitor cells controls osteogenic and adipogenic differentiation Metabolism 2020 105 154189 10.1016/j.metabol.2020.154189 32105664 50 Prens EP et al IFN-alpha enhances poly-IC responses in human keratinocytes by inducing expression of cytosolic innate RNA receptors: relevance for psoriasis J Invest Dermatol 2008 128 4 932 938 10.1038/sj.jid.5701087 17928888 51 Teo QW et al Usp25-Erlin1/2 activity limits cholesterol flux to restrict virus infection Dev Cell 2023 58 22 2495 2509 10.1016/j.devcel.2023.08.013 37683630 PMC10914638 52 Wu LH et al Loss of toll-like receptor 3 function improves glucose tolerance and reduces liver steatosis in obese mice Metabolism 2012 61 11 1633 1645 10.1016/j.metabol.2012.04.015 22607770 53 Sieminska I et al The immunology of psoriasis-current concepts in pathogenesis Clin Rev Allergy Immunol 2024 66 2 164 191 10.1007/s12016-024-08991-7 38642273 PMC11193704 54 Kowal J et al Proteomic comparison defines novel markers to characterize heterogeneous populations of extracellular vesicle subtypes Proc Natl Acad Sci U S A 2016 113 8 E968 E977 10.1073/pnas.1521230113 26858453 PMC4776515 55 Raposo G Stoorvogel W Extracellular vesicles: exosomes, microvesicles, and friends J Cell Biol 2013 200 4 373 383 10.1083/jcb.201211138 23420871 PMC3575529 56 Wilfling F et al Triacylglycerol synthesis enzymes mediate lipid droplet growth by relocalizing from the ER to lipid droplets Dev Cell 2013 24 4 384 399 10.1016/j.devcel.2013.01.013 23415954 PMC3727400 57 Stone SJ et al The endoplasmic reticulum enzyme DGAT2 is found in mitochondria-associated membranes and has a mitochondrial targeting signal that promotes its association with mitochondria J Biol Chem 2009 284 8 5352 5361 10.1074/jbc.M805768200 19049983 PMC2643492 58 Catlin NR et al The postnatal resolution of developmental toxicity induced by pharmacological diacylglycerol acyltransferase 2 (DGAT2) inhibition during gestation in rats Toxicol Sci 2022 189 2 225 236 10.1093/toxsci/kfac077 35866640 59 Li S et al Obesity promotes gastric cancer metastasis via diacylglycerol acyltransferase 2-dependent lipid droplets accumulation and redox homeostasis Redox Biol 2020 36 101596 10.1016/j.redox.2020.101596 32506038 PMC7276427 60 Nisticò C et al Lipid droplet biosynthesis impairment through DGAT2 inhibition sensitizes MCF7 breast cancer cells to radiation Int J Mol Sci 2021 22 18 10102 10.3390/ijms221810102 34576263 PMC8466244 61 Mazar J et al The functional characterization of long noncoding RNA SPRY4-IT1 in human melanoma cells Oncotarget 2014 5 19 8959 8969 10.18632/oncotarget.1863 25344859 PMC4253410 62 Ádám D et al The TRPM5 antagonist triphenylphosphine oxide increases sebaceous lipogenesis and modulates immune phenotype of human sebocytes in a TRPM5-independent manner Exp Dermatol 2025 34 5 e70115 10.1111/exd.70115 40329688 PMC12056537 63 Stone SJ et al Lipopenia and skin barrier abnormalities in DGAT2-deficient mice J Biol Chem 2004 279 12 11767 11776 10.1074/jbc.M311000200 14668353 Version 1 07/22/2025 In-Press Preview Version 2 09/09/2025 Electronic publication Figure 1 Dysregulated glyceride metabolism and decreased DGAT2 expression in lesional psoriatic skin. ( A B C D n E GSE30999 GSE13355 F GSE197056 G H I J n t P P P P Figure 2 Spry1 ΔEpi ( A CreERT fl/fl ΔEpi B ΔEpi ΔEpi C ΔEpi D ΔEpi E ΔEpi n F ΔEpi G H ΔEpi n t P P P P Figure 3 SPRY1 is associated with DGAT2 expression and stability in keratinocytes. ( A B ΔEpi C ΔEpi n D ΔEpi E ΔEpi F G H I n t P P P Figure 4 Altered lipid profiles in the epidermis and plasma of Spry1 ΔEpi ( A ΔEpi B ΔEpi C ΔEpi D ΔEpi E ΔEpi F ΔEpi G ΔEpi H I ΔEpi n Figure 5 DGAT2 inhibition and EPA amplify TLR3-mediated inflammatory responses in keratinocytes. ( A ΔEpi n B n C n D n E F + + n G H n P P P Figure 6 Elevated DGAT2 secretion enhances CD8 + ( A n B ΔEpi n n C + D ΔEpi + E + n F G + n H I + n t P P P ",
  "metadata": {
    "Title of this paper": "Lipopenia and skin barrier abnormalities in DGAT2-deficient mice",
    "Journal it was published in:": "JCI Insight",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487672/"
  }
}