{
  "title": "Paper_233",
  "abstract": "pmc Reprod Health Reprod Health 251 reprohlth Reproductive Health 1742-4755 BMC PMC12486962 PMC12486962.1 12486962 12486962 41035036 10.1186/s12978-025-02105-y 2105 1 Research Quality of maternal and child health services in Tanzanian primary healthcare: a 2021–2022 star rating review Kinyenje Erick S. kinyenje2003@yahoo.com 1 Degeh Martin M. 1 Hokororo Joseph C. 1 Mwaisengela Syabo M. 1 Ngowi Ruth R. 1 Nassoro Omary A. 1 German Chrisogone J. 1 Bahegwa Radenta P. 1 Msigwa Yohanes S. 1 Musyani Atuganile 2 Marandu Laura E. 1 Habtu Michael 3 Mbise Jennifer T. 4 Ismail Habibu 5 Masuma Janeth 6 Msemwa Faraja 6 Muruve Joanita 7 Manangwa Saturini 8 Msasi Daudi 9 Mbelwa Jimmy 10 Pembe Athman 11 Makuwani Ahmad M. 5 Kapologwe Ntuli A. 12 Nagu Tumaini J. 13 Eliakimu Eliudi S. 1 1 https://ror.org/03vt2s541 grid.415734.0 0000 0001 2185 2147 Health Quality Assurance Unit, Ministry of Health, 2 3 https://ror.org/04rtx9382 grid.463718.f 0000 0004 0639 2906 World Health Organization Regional Office for Africa, 4 5 6 https://ror.org/03vt2s541 grid.415734.0 0000 0001 2185 2147 Division of Reproductive, Maternal and Child Health, Ministry of Health, 7 8 https://ror.org/03vt2s541 grid.415734.0 0000 0001 2185 2147 The Division of Nursing and Midwifery Services, Ministry of Health, 9 https://ror.org/03vt2s541 grid.415734.0 0000 0001 2185 2147 Pharmaceutical Services Unit, Ministry of Health, 10 https://ror.org/0479aed98 grid.8193.3 0000 0004 0648 0244 College of Information and Communication Technologies, University of Dar es Salaam, 11 12 https://ror.org/03vt2s541 grid.415734.0 0000 0001 2185 2147 Preventive Services Division, Ministry of Health, 13 https://ror.org/03vt2s541 grid.415734.0 0000 0001 2185 2147 Office of Chief Medical Officer, Ministry of Health, 1 10 2025 2025 22 478363 180 24 12 2024 14 7 2025 01 10 2025 02 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Tanzania faces high maternal and infant mortality rates, yet key service quality metrics remain underexamined, limiting targeted improvements. Star Rating Assessment (SRA), introduced in 2015, aims to improve primary health care (PHC) quality, including maternal and child health (MCH) services. This study analyses SRA data to assess the prevalence of PHC quality in MCH and its associated factors. Methods Data for this cross-sectional study were collected from November 2021 to March 2022 across 10 regions. The tool used included 12 MCH-related indicators, each comprising specific criteria. Facilities scoring ≥ 80% across these criteria were considered to meet MCH quality standards, which was the primary study outcome. A descriptive analysis of indicator performance was conducted, followed by multivariate logistic regression to assess characteristics associated with achieving the quality standard. Results are reported as adjusted odds ratios (AOR) with 95% confidence intervals (CI). Results A total of 2,583 facilities assessed: 2,189 dispensaries (84.7%), 303 health centres (11.7%), and 91 district-level hospitals (3.5%). Only 280(10.8%) met the MCH quality standards. Maternal audit and review practices aligned with guidelines in 2,057 facilities (79.6%). Moderate adherence was observed for family planning guidelines (48.3%), accurate partogram completion (47.9%), and immunisation standards (46.3%). Major gaps included cervical cancer screening, offered by 199 facilities (7.7%), and essential obstetric medicines, available in 424 facilities (16.4%). Among 394 hospitals and health centres, only 60(15.2%) offered postnatal and essential newborn care with dedicated neonatal and Kangaroo Mother Care spaces. Compliance was higher in public, rural, and higher-level facilities. Nurse availability, functional management, and quality improvement teams were key predictors of MCH quality. Conclusion The quality of MCH services in Tanzania varies widely by facility type, ownership, nurse staffing, and management functionality. Targeted improvements in cervical cancer screening, emergency obstetric care, and newborn care are essential to raise overall MCH service standards. Keywords Maternal and child health Star rating Assessment Primary healthcare Quality of MCH services Tanzania pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Maternal and child health (MCH) is one of the key elements of public health and an essential indicator of healthcare system performance [ 1 3 4 There is increasing evidence that improved health outcomes for maternal and child healthcare are mostly influenced by the quality of care, not just accessibility [ 5 1 3 The quality of MCH services is a crucial factor in attaining both Universal Healthcare (UHC) and SDGs targets on maternal, neonatal and under-5 mortality [ 1 3 1 6 7 2 8 11 12 13 As of 2020, approximately 800 women worldwide succumb to childbirth-related causes each day [ 14 14 5 15 Both structural and process-related obstacles to efficient MCH service delivery have been identified by earlier research conducted in Tanzania and in SSA [ 16 17 18 19 20 The quality of maternal health before conception significantly influences pregnancy outcomes [ 15 15 Complications during childbirth often stem from inadequate emergency obstetric and neonatal care (EmONC). These services, including key signal functions and the proper use of partograms, are critical in preventing maternal and neonatal deaths. Pregnant women may also experience life-threatening conditions like postpartum hemorrhage and pre-eclampsia, which require trained providers and proper clinical tools. The first 28 days after delivery are particularly vulnerable, with many maternal and infant deaths linked to infections and lack of essential care. PHC facilities must implement national guidelines on postnatal and newborn care, including services like Kangaroo Mother Care (KMC) [ 21 Research in context Low-quality MCH services are thought to be a bigger challenge than it is estimated because of inadequate statistics in resource-limited countries. Tanzania, as one of these countries, needs more statistics to describe the extent of the difficulties in the quality of MCH services in the areas mentioned above. Word Bank estimates that “238 women die per 100,000 live births due to pregnancy-related causes in Tanzania” by 2020 [ 22 23 Among other initiatives, Tanzania developed a list of MCH indicators to assess and identify areas needing improvement in MCH services. These indicators were formulated considering the aforementioned processes and international standards. They were used to conduct assessments and, rate facilities based on service quality. The MCH indicators were part of a broader set of indicators used to measure the quality of service delivery in PHC facilities under a nationwide quality initiative called “Star Rating Assessment” (SRA). SRA evaluates the quality of the facility across 12 service areas simultaneously [ 24 25 The SRA was one of the initiatives under the Big Result Now program, which was established in 2015 to improve facility performance by enhancing management effectiveness and the quality of health services [ 25 27 The objective of this study was to ascertain the prevalence of PHC facilities achieving the recommended status in the quality of MCH services, as well as the performance of MCH indicators and predictors of MCH service quality. The results are intended to drive specific quality improvement measures at the operational and policy levels as well as to feed continuing health system reforms. Methods Study design This is a cross-sectional study that utilised data collected between November 2021 and March 2022 in 10 out of the 26 regions in the country. Study setting The United Republic of Tanzania is a union of two countries, Tanganyika and Zanzibar. After their union in 1964, the area of Tanganyika became known as Tanzania Mainland and covered 945,500 square kilometres [ 28 According to the National Census 2022, the total population in these 10 regions is about 30% (17,554,018) of the entire country’s population (59,517,754) [ 29 Study population This study includes all PHC facilities in the 10 target regions. These10 regions were purposively samped to ensure each of the 8 zones is represented in this research. Logistics challenges led to one region not being reached, resulting in one zone being unrepresented. However, another region with similar characteristics was substituted in the assessment. In Tanzania, healthcare facilities are divided into the following two main categories: PHC facilities and referral healthcare facilities. PHC facilities account for more than 90% of all healthcare facilities available in the country. Within each region, PHC facilities range from dispensaries and health centres to hospitals at level 1 (council level), in increasing order of expertise [ 30 31 32 31 32 30 33 30 Additional facility characteristics, such as location (urban or rural) and ownership status (private or public), can significantly impact access, management, and service quality. Between November 2021 and March 2022, a SRA was conducted on 2,584 PHC facilities distributed across the 10 regions, as depicted in Fig. 1  Fig. 1 Tanzanian Regions in which Star Rating Assessment was conducted and the respective number of the facilities visited, 2021/22 Inclusion and exclusion criteria MCH indicators and data management The data used in this study are stored in the SRA database, part of the DHIS2 platform managed by the Ministry of Health. In collaboration with the University of Dar es Salaam (DHIS2 Project), the Ministry developed the SRA mobile app, which was used for data collection during the assessment. Data collectors from all levels of the health system in Tanzania were gathered and given one week of training on accurate data collection methods, verification, and analysis. At each facility, the team of assessors included representatives from the council, regional, and national levels to eliminate the possibility of unfair assessment. The collected data underwent quality assessment and were directly entered into DHIS2. The tool used to collect this data was divided into 12 quality assessment areas. Area 11 is called “clinical services” and covers various sub-areas, including MCH. The performance of MCH at each healthcare facility was measured using 12 indicators, as described in Table 1  Table 1 Summary of maternal and child health (MCH) indicators and scoring criteria Indicator Description Scoring criteria 1. Antenatal Care (ANC) Facility follows ANC guidelines Yes = 1.00, Partial = 0.50, No = 0.00 (for each sub-item: services, SOPs, equipment) 2. Family Planning Services follow national guidelines Yes = 1.00, Partial = 0.50, No = 0.00 (per method availability, informed choice, staff training) 3. Cervical Cancer Screening Availability of screening and treatment services Yes = 1.00, No = 0.00 4. Immunisation Services Services follow national immunisation guidelines Yes = 1.00, Partial = 0.50, No = 0.00, NA = 1.00 5. Basic or Comprehensive Emergency Obstetric and Neonatal Care (BEmONC or CEmONC) Signal Functions Facility performs required obstetric functions Each function: Yes = 1.00, No = 0.00 6. Trained B/CEmONC Provider At least one trained staff in past 2 years Yes = 1.00, No = 0.00 7. Integrated management in pregnancy and childcare (IMPAC) Tools Availability of checklists and protocols Yes = 1.00, No = 0.00 (per each checklist) 8. Partogram Use Properly completed partograms Yes = 1.00, No = 0.00 9. Maternal Death Reviews Conducted per national guidelines Yes = 1.00, No = 0.00 10. Emergency Supplies Availability of key obstetric medicines/supplies Yes = 1.00, No = 0.00 11. Postnatal/Newborn Care Services follow national guidelines Yes = 1.00, No = 0.00 (per item assessed) 12. Child Growth Monitoring Services follow Integrated Management of Childhood Illness (IMCI) guidelines Yes = 1.00, No = 0.00 (per component) This table provides a concise overview of the key MCH indicators assessed in the study, including the scoring criteria used for each indicator. For detailed descriptions and scoring methodologies, refer to Appendix 1 *Note: See Appendix 1 Management of study variables and statistical analysis The dependent variable of this study was “quality MCH services”. Each Facility was required to score ≥ 80% points among all allocated indicator score points to meet the quality service criteria for MCH. This cut-off point is provided in the National Guidelines for Recognition of Implementation Status of Quality Improvement Initiatives in Health Facilities [ 34 Furthermore, we described facility-related variables that could influence the performance of MCH indicators. These variables include the location (urban or rural), ownership (public or private), and facility level (hospital/health centre/dispensary). Additionally, we considered other facility variables such as the functionality of the HFMT, the QIT, and the availability of adequate staffing levels for nurses, clinicians, and all healthcare providers. A multivariate logistic regression analysis was conducted to identify the characteristics of PHC facilities associated with this outcome, and adjusted odds ratios (AOR) with 95% confidence intervals (CI) were reported. Results Description of study participants The study included 2,583 healthcare facilities: 2,189 dispensaries (84.7%), 303 health centres (11.7%), and 91 hospitals (3.5%). Nearly four-fifths (2,068, 80.1%) were publicly owned- the rest were private facilities, and approximately the same proportion were based in rural areas (2,139, 82.8%) - with the remaining based in urban areas. Performance of healthcare facilities in MCH indicators Approximately one out of ten (10.8%) of the 280 facilities met the quality assessment scores for MCH services. Considering individual indicators (Fig. 2 Excluding the availability of essential checklists, charts, and protocols for integrated management in pregnancy and childcare in 1,467 facilities (56.8%), the remaining indicators were met by less than half of the facilities as follows: 1,247 facilities (48.3%) followed family planning guidelines, 1,238 facilities (47.9%) accurately completed partograms, immunization services adhered to guidelines in 1,197 facilities (46.3%), and 1,035 facilities (40.1%) followed ANC service guidelines. Additionally, staff received BEmONC or CEmONC training in 995 facilities (38.5%), BEmONC or CEmONC services were provided in 816 facilities (31.6%), and quality child growth monitoring, as per IMCI, was offered in 1,054 facilities (40.8%). Three indicators scored the lowest among others: provision of PNC and essential newborn care (including the utilization of neonatal wards and KMC rooms) in 60 hospitals/health centres (15.2%), cervical cancer screening in 199 facilities (7.7%), and the availability of required medicines and medical supplies for obstetric emergencies in 424 facilities (16.4%).  Fig. 2 The performance of the healthcare facilities in individual MCH indicators Facility’s characteristics that predicted quality of MCH services As presented in Table 2  Table 2 Predictors associated with quality MCH services in primary healthcare facilities MCH quality criteria Bivariate Multivariate Variable Yes % No % COR 95% CI p AOR 95% CI p Facility type < 0.001  < 0.001 Health Centre 93 30.7 210 69.3 6.29 4.67, 8.46 7.21 4.37, 11.9 Hospital 43 47.3 48 52.7 12.7 8.14, 19.9 34.7 14.6, 84.3 Dispensary 144 6.6 2,045 93.4 Ref Ref Ownership  0.009  < 0.001 Public 240 11.6 1,828 88.4 1.56 1.11, 2.24 2.94 1.80, 5.05 Private 40 7.8 475 92.2 Ref Ref Location 0.11 0.75 Urban 58 13.1 386 86.9 1.30 0.95, 1.76 1.07 0.69, 1.62 Rural 222 10.4 1,917 89.6 Ref Sufficient nurse staffing 0.13  0.001 Yes 163 9.0 1,658 91.0 1.32 0.92, 1.94 2.12 1.34, 3.53 No 37 6.9 496 93.1 Ref Ref Sufficient clinician staffing  0.005 0.34 Yes 109 7.2 1,400 92.8 0.65 0.49, 0.88 1.20 0.83, 1.75 No 90 10.6 756 89.4 Ref Ref Sufficient staffing for all staff 0.32 0.11 Yes 11 11.3 86 88.7 1.40 0.70, 2.56 1.85 0.87, 3.67 No 189 8.4 2,072 91.6 ref Ref Functional HFMT  < 0.001  0.005 Yes 105 12.8 717 87.2 2.22 1.66, 2.98 1.62 1.15, 2.27 No 95 6.2 1,441 93.8 Ref Ref Functional QIT  < 0.001  0.003 Yes 84 15.0 476 85.0 2.56 1.89, 3.44 1.71 1.20, 2.43 No 116 6.5 1,682 93.5 Ref Bolded values are statistically significant values COR AOR HFMT QIT p- *Predictors whose association was found significant in the final logistic regression Discussion Poor quality of MCH services is a major driver of maternal and child mortality [ 2 35 36 One major theme is inadequate adherence to policies and guidelines related to the quality of antenatal and intrapartum care, which significantly contribute to poor MCH outcomes [ 37 23 38 39 The above findings are consistent with findings in other countries in the SSA region [ 36 40 43 44 45 Several factors contribute to poor guideline adherence. These include lack of access to the relevant guidelines [ 38 44 46 41 42 47 44 48 2 21 Training and onsite clinical mentorship lead to significant positive changes in the performance of MCH services [ 49 50 48 51 48 52 A second major challenge is the inadequate provision of post-natal and essential newborn care services. This was largely due to the lack of neonatal wards and KMC rooms in hospitals and health centres. The presence of well-equipped neonatal wards and KMC rooms can reduce neonatal mortality by 40% in healthcare facilities [ 53 54 55 56 57 37 57 Another finding of concern is that less than 10% of PHC Facilities were providing cancer screening services for women, making this the most MCH-challenging area. Cancer screening is one step towards protecting women from cervical cancer [ 58 60 59 61 62 61 90–70–90 targets by 2030 63 64 In contrast, MPDSR adherence emerged as the most implemented MCH quality indicator, as seen in other countries in SSA [ 65 65 37 66 67 In Tanzania, management and the quality improvement teams directly contribute to initiatives for improving the quality of MCH services and addressing challenges in the quality of MCH services [ 68 70 70 71 The provision of quality emergency obstetric care depends on skilled health attendants working in an environment where drugs and medical supplies are available when needed [ 72 73 76 73 Staffing is another crucial determinant of quality MCH services [ 37 2 77 78 67 79 80 Facility ownership also influenced performance. As seen in other SSA countries [ 37 81 82 81 82 83 84 Facility level and location were also important. Higher-level facilities performed better in providing MCH services compared to lower-level facilities. This has also been demonstrated in various previous studies in Tanzania, where the quality of services improved with the level of the facility [ 70 71 85 88 42 70 71 85 88 A limitation of this study is that we did not interview HCWs specifically about service quality, though they are the primary providers of MCH care. Their perspectives—as well as those of clients and families; could impact how MCH services are delivered [ 37 79 38 Another limitation is that the data were collected during a single-day visits, which may not provide an accurate long-term picture of the facility, especially for consumable commodities like medicines. Conclusion This study highlights critical gaps in the quality of MCH services in PHC facilities in Tanzania. Despite the availability of national guidelines and tools, implementation remains suboptimal, especially in areas such as antenatal care, intrapartum monitoring, emergency obstetric services, postnatal and newborn care, and cervical cancer screening. Key challenges include poor adherence to the available guidelines, inadequate staffing—especially nurses, weak functionality of management and quality improvement teams, shortage of key emergency medicines, and infrastructure deficits such as neonatal wards and KMC rooms. Private facilities, in particular, lag behind government facilities in providing comprehensive MCH services. To address these challenges, we recommend the following policy actions:  i. Reinforce training and clinical mentorship for all MCH service providers, with a focus on guideline adherence, emergency care, and respectful maternity care. ii. Improve functionality of Quality Improvement and management Teams at all levels of the health system to ensure ongoing monitoring, evaluation, and improvement of MCH service delivery. iii. Ensure continuous supply of essential medicines and supplies, particularly those required for managing obstetric emergencies, across all PHC facilities. iv. Scale up infrastructure for newborn care, including functional neonatal wards and KMC rooms. v. Expand cervical cancer screening services and integrate them into routine PHC services to support national targets for cancer prevention and early detection. vi. Address human resource gaps by recruiting and equitably distributing skilled healthcare workers, prioritizing the retention and motivation of nurses, who are central to MCH service delivery. The quality and equality of MCH services in Tanzania may be greatly enhanced by putting these policy initiatives into practice, which will ultimately lower preventable maternal and infant mortality and move the country closer to universal health coverage. Future studies could employ research designs capable of establishing cause-and-effect relationships and incorporate qualitative methods to capture stakeholders’ perspectives on the reasons for facilities’ inadequate adherence to MCH quality standards. Appendix 1. Description and scoring of MCH indicators/variables related to Facility characteristics  Indicator/variable Description and means of scoring Indicator 1: Antenatal care (ANC) services follow guidelines This indicator aimed to determine whether the facility follows ANC guidelines. To assess this, the evaluators asked 3 main questions, each with a possible score of 3 points. The first question was whether routine antenatal services were provided as required. Seven routine services were inquired about in this question, which are: i. Iron supplementation ii. Folic acid supplementation iii. Mebendazole tablets iv. Intermittent preventive treatment (IPT) for malaria v. Tetanus toxoid vaccination vi. Monitoring for hypertensive disorders of pregnancy (checking the antenatal card) vii. Syphilis rapid diagnostic test To verify the above services, the assessor was required to review three ANC visits to ensure that the cards were filled out properly and that the package of services was provided. The cards were selected randomly. There were three possible scores: Yes: 1.00, Partial: 0.50, and No: 0.00. A Yes score was given if the entire package of services was provided and the cards were correctly filled out in all three ANC visits. A Partial score was given if less than the entire package was provided or if the ANC card was incorrectly filled out in one case. A No score was given for less than half of the full package. The second question was whether ANC guidelines, SOPs, checklists, or job aids, including wall charts, were available for reference. The possible scores were Yes: 1.00 and No: 0.00. A Yes score was given if all items were available, and a No score was given if not all items were available. The last question for this indicator was to check if 3 equipment—BP machines, foetoscopes, and adult weighing scales—were available and functioning. The possible scores were Yes: 1.00 and No: 0.00. A Yes score was given if all three items were available and functioning, and a No score was given if one or more items were unavailable for use. Indicator 2: Family planning services follow guidelines The goal of this indicator was to determine whether the family planning services provided adhere to guidelines. To assess this, the evaluators asked three main questions, each with a possible score of 3 points. The first question is whether all family planning methods were offered according to the level of health facility and expertise. The assessor was required to check and review records of issues in the previous week. Possible scores were Yes: 1.00, Partial: 0.50, and No: 0.00. Yes was scored if family planning methods offered include oral contraceptives, injectable contraceptives, condoms, and ovulation methods. Partial was scored if fewer than four methods were offered. No was scored if none of the methods were offered. The second question is whether family planning methods were offered according to the client’s informed choice. This was achieved through exit interviews with three family planning clients to ascertain their informed choice of family planning method. Possible scores were Yes: 1.00 and No: 0.00. Yes was scored if all three clients were offered contraceptives according to informed choice. No was scored if fewer than three clients were offered contraceptives according to informed choice. The final question in this indicator is whether there was any healthcare worker trained in family planning methods. At the dispensary level, any method was considered suitable, while at the health centre and hospital levels, the requirement was for at least 2 healthcare workers to be trained on long-term/permanent family planning methods. Examples of long-term methods include intrauterine devices (IUDs), implants, female sterilization, and vasectomy. Two possible scores were available: Yes:1.00 and No:0.00. Indicator 3: Cervical Cancer screening is provided This indicator included only health centres and hospitals and aimed to determine whether the facility offered cervical cancer screening and treatment services for early cervical lesions. Two possible scores were available: Yes: 1.00 and No: 0.00. Indicator 4: Immunization services follow guidelines The goal of this indicator was to determine if the immunization services provided adhere to guidelines. To assess this, assessors asked four main questions, each with a possible score of 4 points. The first question is whether the national guidelines for child immunization were available for reference. Possible scores were Yes: 1.00, No: 0.00, NA: 1.00. Yes, if the immunization guidelines were seen, No, if not seen, and NA if the private facility does not offer immunization services. The second question is whether any healthcare worker or provider(s) of immunization services received any training in child immunization services in the last two years. Possible scores were Yes: 1.00 (At least one trained), No: 0.00 (None trained), and NA: 1.00 (If the private facility does not offer immunization service). The third question is to check whether cold chain equipment (standard vaccine refrigerator, vaccine carrier, thermometer, fridge, and freezer tag, daily updated temperature chart, and power source) was available and functioning on the day of assessment. Possible scores were Yes: 1.00, No: 0.00, NA: 1.00. Yes, was scored if all items were available and functioning on the day. No, if any item was missing (cold chain not fully functional). NA if the private facility does not offer immunization services. The fourth question is whether the facility had all necessary vaccines (i. BCG, ii. Polio, iii. Measles and Rubella, iv. Pentavalent, v. Rotavirus, vi. Pneumococcal Vaccine (PCV 13), vii. Tetanus Toxoid, viii. Human Papilloma Virus) available and usable on the assessment day. Possible scores were Yes: 1.00, Partial: 0.50, No: 0.00, NA: 1.00. Yes, was scored if all vaccines were available and usable. Partial if one vaccine was unavailable or not usable, and No, if more than one was not available or not usable. NA, if the private facility does not offer immunization services. Indicator 5: The facility is performing B/CEmONC signal functions. The purpose of this indicator was to determine whether the facility could perform Basic Emergency Obstetric and Newborn Care (BEmONC) signal functions (for dispensaries) or CEmONC signal functions (for health centres and hospitals). CEmONC comprises 9 signal functions, including the 7 signal functions of BEmONC. Each signal function was allocated one score, and Yes; 1.00 was scored for each signal function if the facility could provide it to clients on the assessment day. The 7 BEmONC signal functions assessed were: i. Parenteral administration of antibiotics (IV or IM), ii. Parenteral administration of oxytocic (IV or IM), iii. Parenteral administration of anticonvulsant (magnesium sulphate) for hypertensive disorders of pregnancy (IV or IM), iv. Assisted vaginal delivery (vacuum extraction), v. Manual removal of placenta, vi. Manual Vacuum Aspiration (MVA)/ Post Abortal Care (PAC), vii. Neonatal resuscitation/Penguin sucker. The two additional signal functions for CEmONC were: viii. Blood transfusion and ix. Caesarean section. Indicator 6: Provider trained in either Basic or Comprehensive Emergency Obstetric and Neonatal Care (BEmONC or CEmONC) The indicator aims to determine whether any providers have been trained in B/CEmONC in the past 2 years. Two possible scores were available: Yes: 1.00 and No: 0.00. Indicator 7: Availability of checklists, charts, and protocols for integrated management in pregnancy and childcare (IMPAC) The indicator aims to determine whether the facility has checklists, charts, and protocols for integrated management in pregnancy and childcare. To assess this, the assessors asked three questions, each with one possible score point. The first question is whether checklists, charts, and protocols for the management of pregnancy and childbirth are available. The second question is whether checklists, charts, and protocols for the management of postpartum haemorrhage (PPH) are available for reference. The third question is whether checklists, charts, and protocols for the management of pre-eclampsia/eclampsia are available for reference. Indicator 8: correct filling of Partograms for mothers in labour The indicator aims to determine whether partograms for mothers in labour are correctly filled out. Three partograms were selected randomly to check if all variables, such as the name of the client, the opening of the partograph, parity, gestational age, etc., were correctly filled. Possible scores were Yes: 1.00 and No: 0.00. Yes, was scored if all three partograms were filled out correctly, and No, was scored if fewer than three were correctly filled. Indicator 9: Maternal death audits/reviews conducted as per guidelines. The indicator aims to determine whether maternal audits/reviews were conducted and adhered to the MPDSR guidelines. Indicator 10: Availability of medicines and medical supplies for managing obstetric emergencies The indicator aims to determine whether the facility had medicines and medical supplies for obstetric emergencies on the day of assessment. The items checked were: hydralazine, magnesium sulphate, calcium gluconate, and an oxygen concentrator/cylinder. Yes: 1.00 was scored if all items were available; otherwise, No: 0.00. Indicator 11: Post-natal and essential new-born care follow guidelines The indicator aims to determine whether health centres and hospitals provide post-natal and essential newborn care according to guidelines. To assess this, the assessors asked seven main questions at health centres and hospitals, with one additional question specifically for hospitals. The seven questions are: i . Is there a general neonatal ward and a Kangaroo mother care room for pre-term and low birth weight newborn care. ii. Are there job aids, checklists, protocols, and postnatal care (PNC) guidelines for the assessment and management of neonatal conditions. iii. Is there a dedicated person, at the newborn care unit with special training for newborn care? (E.g., essential new-born care, KMC, HBB, Neo Natalie) iv. Are there necessary functional equipment and supplies for newborn care? (Eg; Resuscitation table, Suction machine, Incubators, cPAP machines etc.) v. Is the newborn care offered according to available guidelines, checklists and protocols. vi. Is there a provision of counseling on newborn health issues on discharge vii. Are there antibiotics for neonates with bacterial infection? (E.g: Benzyl Penicillin injection/Ampicillin injection/ Cloxacillin injection, Neonatal Ampiclox syrup, Tetracycline eye ointment, etc.) The eighth question, which was asked only at hospitals, is if other medicines and supplies are important for the care of a sick neonate. Indicator 12: The facility is offering child growth monitoring services according to guidelines 1. Are staff trained to provide quality growth monitoring according to IMCI guidelines? Ask the staff Observe if child growth monitoring services are provided according to guidelines. (Possible Answers; Yes: 1.00 No: 0.00) Yes. At least one member of staff has been trained on IMCI. No. None of the members has been trained on IMCI 2. Are child growth charts filled properly? Check five charts Observe if child growth monitoring services are provided according to guidelines. (Possible Answers; Yes: 1.00 No: 0.00) Yes. All five charts filled properly No. Less than five charts filled properly. 3. Are HIV Exposed Infants (HEI) systematically identified and Early Infant Diagnosis (EID) services provided alongside child growth monitoring? Adequate staffing level for nurses The facility was considered to have an adequate staffing level for nurses if complied with “Tanzanian Staffing Levels for the Ministry of Health and Social Welfare Departments Health Service Facilities Health Training Institutions and Agencies” 89 Adequate staffing level for clinicians The facility was considered to have adequate staffing level for clinicians if complied with “Tanzanian Staffing Levels for the Ministry of Health and Social Welfare Departments Health Service Facilities Health Training Institutions and Agencies” 89 Adequate staffing level for all healthcare providers The facility was considered to have adequate staffing levels for all key healthcare providers if complied with “Tanzanian Staffing Levels for the Ministry of Health and Social Welfare Departments Health Service Facilities Health Training Institutions and Agencies” 89 At the health centre; the list included one Medical Officer, an Assistant Medical Officer, a Clinical Officer/ Assistant Clinical Officer, an Assistant Nursing Officer, nine Nurses, six medical Attendants, a Dental Therapist, a Pharmaceutical Technologist, Laboratory Technologist, Assistant Laboratory Technologist, and Assistant Environmental Health Officer, Assistance Social Welfare Officer, and Medical Recorder as per establishment. At the hospital; the list included six Medical Officers, 12 Assistant Medical Officers, 9 Nursing Officers, 25 Assistant Nursing Officers, 25 Nurses, 33 Medical Attendants, a Dental Officer, Assistant Dental Officer, a Dental Therapist, Pharmacist, two Pharmaceutical Technologists, three Laboratory Technologists, two Assistant Laboratory Technologist, Radiology Scientist, two Radiographer Technologists, two Biomedical Technologists, and three Assistant Environmental Health Officers, Social Welfare Officer, three Nutritionists and three Medical Record Technicians as per establishment. Note: Assistant Clinical Officer Clinical Officer Assistant Medical Officers and Medical Officers are in order of increasing education level from holding a 2 year-certificate in clinical medicine a 3- year diploma in medicine a 3- year diploma in medicine plus extended training and a 5-year degree in clinical medicine plus internship; respectively. 90 Nurses in this part refer to Enrolled Nurses holding certificate level while Assistant Nurse Officers and Nurse Officers are Registered Nurses with an advanced diploma and bachelor’s degree respectively. Functional health facility management team The health facility management team was deemed functional if met the following four criteria: i. There is a Health Facility Management Team (HFMT) ii. The HFMT has been formally appointed, with Terms of Reference iii. The HFMT meets on a regular schedule (schedule of meetings available) iv. HFMT meetings conducted at least monthly and recorded (Minutes are available for HFMT for the past 3 months and evidence that report is sent to higher management level) Functional quality improvement team The health facility quality improvement team was deemed functional if met the following five criteria: i. There is a Quality Improvement Team (QIT) ii. The QIT meets on a regular schedule (Schedule of meetings available) iii. QIT meetings are conducted at least quarterly, and recorded (Minutes are available for QIT for the past 3 months and evidence that report is sent to higher management level) iv. If QIT conducts and reports internal (self-) assessment on the quality of services at least quarterly (Report of internal quality assessment available, gaps identified, and quality improvement plans specified for the last quarter) v. There have been documented quality improvement activities at the facility in the past six months Facility’s ownership, Facility’s level and Facility’s location These variables are detailed in this manuscript’s “study population” section. Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements The authors thank the Ministry of Health, especially the Health Quality Assurance Unit for permitting us to use the SRA data. Also, we would like to acknowledge PORALG and UDSM for coordination and participation during the SRA assessment. Aside from government institutions, the authors would like to express their gratitude to Development Partners: The World Bank, the US-CDC, DANIDA, and WHO; and the Development Partners in Health-Group (DPG-H) who played a crucial role in making SRA possible. Additional acknowledgements go to: the communities associated with the visited facilities; the Association of Private Health Facilities in Tanzania (APHTA); the Christian Social Services Commission (CSSC); and The National Muslim Council of Tanzania (BAKWATA). Author contributions E.S.K. conceptualized the manuscript’s initial draft. M.M.D., J.C.H., E.S.K., S.M.M., R.R.N., M.H., O.A.N., C.J.G., R.P.B., Y.S.M., J.T.M., L.E.M., and E.S.E. made substantial contributions to data acquisition, analysis, and interpretation. A.M. and E.S.K. prepared Figs. 1 2 Funding No specific fund was provided for the preparation and publication of this manuscript. Data availability To request data for this study, please contact the Principal Secretary of the Ministry of Health at ps@afya.go.tz. Declarations Ethics approval and consent to participate The assessment was considered a programmatic quality improvement activity and did not require formal ethical clearance. However, all standard ethical procedures including voluntary participation, informed consent, and data confidentiality were strictly observed. Prior permission was sought from the Ministry of Health, Community Development, Gender, Elderly and Children (Recently renamed as Ministry of Health) before use of the dataset. The Ministry of Health is a custodian of Health Management Information Systems data including the SRA database. Ethical clearance is not necessary for this type of a study because data were collected in the course of implementing an initiative by the government and hence this analysis aims to give feedback on prevailing circumstances after its successful implementation. Competing interests The authors declare no competing interests. References 1. Pettigrew LM De Maeseneer J Anderson M-IP Essuman A Kidd MR Haines A Primary health care and the sustainable development goals Lancet 2015 386 10009 2119 10.1016/S0140-6736(15)00949-6 26638948 Pettigrew LM, De Maeseneer J, Anderson M-IP, Essuman A, Kidd MR, Haines A. Primary health care and the sustainable development goals. Lancet. 2015;386(10009):2119. 10.1016/S0140-6736(15)00949-6. 26638948 10.1016/S0140-6736(15)00949-6 2. Kruk ME, Gage AD, Joseph NT, Danaei G, García-Saisó S, Salomon JA. Mortality due to low-quality health systems in the universal health coverage era: a systematic analysis of amenable deaths in 137 countries. The Lancet. 10.1016/S0140-6736(18)31668-4 PMC6238021 30195398 3. Eregata GT, Hailu A, Memirie ST, Norheim OF. Measuring progress towards universal health coverage: National and subnational analysis in Ethiopia. BMJ Global Health. 2019;4(6). 10.1136/bmjgh-2019-001843. 10.1136/bmjgh-2019-001843 PMC6861121 31798996 4. World Health Organization. Maternal health. Geneva: WHO. 2020; https://www.who.int/health-topics/maternal-health 5. Kruk ME Gage AD Arsenault C High-quality health systems in the sustainable development goals era: time for a revolution Lancet Global Health 2018 6 11 e1196 252 10.1016/S2214-109X(18)30386-3 30196093 PMC7734391 Kruk ME, Gage AD, Arsenault C, et al. High-quality health systems in the sustainable development goals era: time for a revolution. Lancet Global Health. 2018;6(11):e1196–252. 30196093 10.1016/S2214-109X(18)30386-3 PMC7734391 6. De P Dhar A Inequality in child mortality across different States of india: a comparative study J Child Health Care 2013 17 4 397 10.1177/1367493512468359 23435164 De P, Dhar A. Inequality in child mortality across different States of india: a comparative study. J Child Health Care. 2013;17(4):397. 10.1177/1367493512468359. 23435164 10.1177/1367493512468359 7. Kumar C Singh PK Rai RK Coverage gap in maternal and child health services in india: assessing trends and regional deprivation during 1992–2006 J Public Health 2013 35 4 598 606 10.1093/pubmed/fds108 23359666 Kumar C, Singh PK, Rai RK. Coverage gap in maternal and child health services in india: assessing trends and regional deprivation during 1992–2006. J Public Health. 2013;35(4):598–606. 10.1093/pubmed/fds108. 10.1093/pubmed/fds108 23359666 8. Sanders D Nandi S Labonté R Vance C Van Damme W From primary health care to universal health coverage—one step forward and two steps back Lancet 2019 394 10199 619 10.1016/S0140-6736(19)31831-8 31448726 Sanders D, Nandi S, Labonté R, Vance C, Van Damme W. From primary health care to universal health coverage—one step forward and two steps back. Lancet. 2019;394(10199):619. 10.1016/S0140-6736(19)31831-8. 31448726 10.1016/S0140-6736(19)31831-8 9. Sacks E Schleiff M Were M Chowdhury AM Perry HB Communities, universal health coverage and primary health care Bull World Health Organ 2020 98 11 773 10.2471/BLT.20.252445 33177774 PMC7607457 Sacks E, Schleiff M, Were M, Chowdhury AM, Perry HB. Communities, universal health coverage and primary health care. Bull World Health Organ. 2020;98(11):773. 10.2471/BLT.20.252445. 33177774 10.2471/BLT.20.252445 PMC7607457 10. Langlois EV McKenzie A Schneider H Mecaskey JW Measures to strengthen primary health-care systems in low-and middle-income countries Bull World Health Organ 2020 98 11 781 10.2471/BLT.20.252742 33177775 PMC7607465 Langlois EV, McKenzie A, Schneider H, Mecaskey JW. Measures to strengthen primary health-care systems in low-and middle-income countries. Bull World Health Organ. 2020;98(11):781. 10.2471/BLT.20.252742. 33177775 10.2471/BLT.20.252742 PMC7607465 11. Walker C Peterson CL Universal health coverage and primary health care: their place in people’s health J Eval Clin Pract 2021 27 5 1027 10.1111/jep.13445 33189085 Walker C, Peterson CL. Universal health coverage and primary health care: their place in people’s health. J Eval Clin Pract. 2021;27(5):1027. 10.1111/jep.13445. 33189085 10.1111/jep.13445 12. Kapologwe NA Meara JG Kengia JT Development and upgrading of public primary healthcare facilities with essential surgical services infrastructure: a strategy towards achieving universal health coverage in Tanzania BMC Health Serv Res 2020 20 1 10.1186/s12913-020-5057-2 PMC7076948 32183797 Kapologwe NA, Meara JG, Kengia JT, et al. Development and upgrading of public primary healthcare facilities with essential surgical services infrastructure: a strategy towards achieving universal health coverage in Tanzania. BMC Health Serv Res. 2020;20:1. 10.1186/s12913-020-5057-2. 10.1186/s12913-020-5057-2 PMC7076948 32183797 13. Hokororo JC, Eliakimu ES, Ngowi R, et al. Determinants of pregnant mothers to bypass primary health facilities and directly seek postnatal care in hospitals in Dar Es Salaam region–A community health needs assessment. Cross Sectional Study; 2019. 14. World Health Organization. Trends in maternal mortality 2000 to 2020: estimates by WHO, UNICEF, UNFPA, World Bank Group., and UNDESA/Population Division: executive summary. 2023.ISBN: 978 92 4 006875 9. ISBN: 978 92 4 006875 9. 15. Rosa-Mangeret F Benski A-C Golaz A 2.5 Million annual deaths—are neonates in low-and middle-income countries too small to be seen? A bottom-up overview on neonatal Morbi-mortality Trop Med Infect Disease 2022 7 5 64 10.3390/tropicalmed7050064 35622691 PMC9148074 Rosa-Mangeret F, Benski A-C, Golaz A, et al. 2.5 Million annual deaths—are neonates in low-and middle-income countries too small to be seen? A bottom-up overview on neonatal Morbi-mortality. Trop Med Infect Disease. 2022;7(5):64. 10.3390/tropicalmed7050064. 35622691 10.3390/tropicalmed7050064 PMC9148074 16. Makuka GJ Sango MM Mashambo AE Mashambo AE Msuya SE Mtweve SP Clients’ perspectives on quality of delivery services in a rural setting in tanzania: findings from a qualitative action-oriented research Int J MCH AIDS 2017 6 1 60 10.21106/ijma.191 28798894 PMC5547226 Makuka GJ, Sango MM, Mashambo AE, Mashambo AE, Msuya SE, Mtweve SP. Clients’ perspectives on quality of delivery services in a rural setting in tanzania: findings from a qualitative action-oriented research. Int J MCH AIDS. 2017;6(1):60. PMCID: PMC5547226. PMCID: PMC5547226. 28798894 10.21106/ijma.191 PMC5547226 17. Msafiri D, Katera L. Healthcare Delivery Environment and Performance in Tanzania 2020; chrome-extension://efaidnbmnnnibpcajpcglclefindmkaj/ https://www.repoa.or.tz/wp-content/uploads/2021/02/SDI-Health-Designed-Sept-2020.pdf 18. Kinyenje E Degeh MM Nassoro OA Patient-Provider interaction in primary healthcare facilities in tanzania: findings from star rating assessment J Service Sci Manage 2023 16 5 642 10.4236/jssm.2023.165034 PMC10584114 37851603 Kinyenje E, Degeh MM, Nassoro OA, et al. Patient-Provider interaction in primary healthcare facilities in tanzania: findings from star rating assessment. J Service Sci Manage. 2023;16(5):642. 10.4236/jssm.2023.165034. 10.1371/journal.pgph.0001489 PMC10584114 37851603 19. Nyamtema A, Mtey G, LeBlanc J, Murphy GT. Assisting Safe Deliveries in Tanzania (ASDIT). 2020; chrome-extension://efaidnbmnnnibpcajpcglclefindmkaj/ https://idl-bnc-idrc.dspacedirect.org/server/api/core/bitstreams/2d222e6f-202f-4edc-8f11-1e40f1622f00/content 20. Ministry of Health CD, Gender. Elderly and Children (MoHCDGEC),. Health Sector Strategic Plan July 2021–June 2026 (HSSP V). 2021; chrome-extension://efaidnbmnnnibpcajpcglclefindmkaj/ https://mitu.or.tz/wp-content/uploads/2021/07/Tanzania-Health-Sector-Strategic-Plan-V-17-06-2021-Final-signed.pdf 21. Organization WH. Improving the quality of care for maternal, newborn and child health: implementation guide for national, district and facility levels. In: Improving the quality of care for maternal, newborn and child health: implementation guide for national, district and facility levels. 22. World Bank Group. 238 women die per 100,000 live births due to pregnancy-related causes in Tanzania. 2021. https://genderdata.worldbank.org/en/economies/tanzania#sr-subnavigation 23. Mangu CD Rumisha SF Lyimo EP Trends, patterns and cause-specific neonatal mortality in tanzania: a hospital-based retrospective survey Int Health 2021 13 4 334 43 10.1093/inthealth/ihaa070 32975558 PMC8253992 Mangu CD, Rumisha SF, Lyimo EP, et al. Trends, patterns and cause-specific neonatal mortality in tanzania: a hospital-based retrospective survey. Int Health. 2021;13(4):334–43. 32975558 10.1093/inthealth/ihaa070 PMC8253992 24. Gage AD Yahya T Kruk ME Assessment of health facility quality improvements, united Republic of Tanzania Bull World Health Organ 2020 98 12 849 10.2471/BLT.20.258145 33293745 PMC7716095 Gage AD, Yahya T, Kruk ME, et al. Assessment of health facility quality improvements, united Republic of Tanzania. Bull World Health Organ. 2020;98(12):849. 33293745 10.2471/BLT.20.258145 PMC7716095 25. Yahya T Mohamed M Raising a mirror to quality of care in tanzania: the five-star assessment Lancet Global Health 2018 6 11 e1155 7 10.1016/S2214-109X(18)30348-6 30196094 Yahya T, Mohamed M. Raising a mirror to quality of care in tanzania: the five-star assessment. Lancet Global Health. 2018;6(11):e1155–7. 30196094 10.1016/S2214-109X(18)30348-6 26. German CJ Mollel HA Anasel MG Assessment of implementation of the star rating system in primary health facilities: experience from Tanzania J Service Sci Manage 2023 16 3 249 65 10.4236/jssm.2023.163014 German CJ, Mollel HA, Anasel MG, et al. Assessment of implementation of the star rating system in primary health facilities: experience from Tanzania. J Service Sci Manage. 2023;16(3):249–65. 27. World Bank Group. Tanzania - Big Results Now for Health Project (English. 2015; http://documents.worldbank.org/curated/en/648601468112497753/Tanzania-Big-Results-Now-for-Health-Project 28. The United Republic of Tanzania. 2021 Tanzania in Figures. In. Dodoma2021. 29. The United Republic of Tanzania. 2022 Population and Housing Census - Administrative units Population Distribution and Age and Sex Distribution Reports. In:2022. 30. Ministry of Health CD. In: Division HQA, editor. Gender, elderly and children (MoHCDGEC),. Basic standards for health facilities volume 3. Volume 3. Dar es SalaamNovember; 2017. 31. Kapologwe NA Kalolo A Kibusi SM Understanding the implementation of direct health facility financing and its effect on health system performance in tanzania: a non-controlled before and after mixed method study protocol Health Res Policy Syst 2019 17 1 13 10.1186/s12961-018-0400-3 30700308 PMC6354343 Kapologwe NA, Kalolo A, Kibusi SM, et al. Understanding the implementation of direct health facility financing and its effect on health system performance in tanzania: a non-controlled before and after mixed method study protocol. Health Res Policy Syst. 2019;17:1–13. 30700308 10.1186/s12961-018-0400-3 PMC6354343 32. Ministry of Health CD. In: Division HQA, editor. Gender, elderly and children (MoHCDGEC),. Basic standards for health facilities volume 2. Volume 2. Dar es SalaamNovember; 2017. 33. Hokororo J Eliakimu E Ngowi R German C Bahegwa R Msigwa Y Report of trend for compliance of infection prevention and control standards in Tanzania from 2020 to 2017 in Tanzania Mainland Microbiol Infect Dis 2021 5 3 1 10 Hokororo J, Eliakimu E, Ngowi R, German C, Bahegwa R, Msigwa Y. Report of trend for compliance of infection prevention and control standards in Tanzania from 2020 to 2017 in Tanzania Mainland. Microbiol Infect Dis. 2021;5(3):1–10. 34. United Republic of Tanzania - Ministry of Health and Social Welfare. National Guidelines for Recognition of Implementation Status of Quality Improvement Initiatives in Health Facilities. January 2014; Available at: http://www.tzdpg.or.tz/fileadmin/documents/dpg_internal/dpg_working_groups_clusters/cluster_2/health/Sub_Sector_Group/Quality_Assurance/12_Recognition-Guidelines.pdf 35. Ramadan M, Gutierrez JC, Feil C, Bolongaita S, Bernal O, Uribe MV. Capacity and quality of maternal and child health services delivery at the subnational primary healthcare level in relation to intermediate health outputs: a cross-sectional study of 12 low-income and middle-income countries. BMJ Open 2023;13(1). p.e065223 10.1136/bmjopen-2022-065223 PMC9890757 36720573 36. Hategeka C Arsenault C Kruk ME Temporal trends in coverage, quality and equity of maternal and child health services in rwanda, 2000–2015 BMJ Global Health 2020 5 11 e002768 10.1136/bmjgh-2020-002768 33187962 PMC7668303 Hategeka C, Arsenault C, Kruk ME. Temporal trends in coverage, quality and equity of maternal and child health services in rwanda, 2000–2015. BMJ Global Health. 2020;5(11):e002768. 33187962 10.1136/bmjgh-2020-002768 PMC7668303 37. Kinshella M-LW Hiwa T Pickerill K Barriers and facilitators of facility-based Kangaroo mother care in sub-Saharan africa: a systematic review BMC Pregnancy Childbirth 2021 21 1 1 10 10.1186/s12884-021-03646-3 33663415 PMC7934357 Kinshella M-LW, Hiwa T, Pickerill K, et al. Barriers and facilitators of facility-based Kangaroo mother care in sub-Saharan africa: a systematic review. BMC Pregnancy Childbirth. 2021;21(1):1–10. 33663415 10.1186/s12884-021-03646-3 PMC7934357 38. Gondwe A Munthali A Ashorn P Ashorn U Investigating preterm care at the facility level: stakeholder qualitative study in central and Southern Malawi Matern Child Health J 2016 20 1441 7 10.1007/s10995-016-1942-z 26976282 Gondwe A, Munthali A, Ashorn P, Ashorn U. Investigating preterm care at the facility level: stakeholder qualitative study in central and Southern Malawi. Matern Child Health J. 2016;20:1441–7. 26976282 10.1007/s10995-016-1942-z 39. World Health Organization. Standards for improving quality of maternal and newborn care in health facilities. 2016; https://cdn.who.int/media/docs/default-source/mca-documents/qoc/quality-of-care/standards-for-improving-quality-of-maternal-and-newborn-care-in-health-facilities_1a22426e-fdd0-42b4-95b2-4b5b9c590d76.pdf?sfvrsn=3b364d8_4 40. Amoakoh-Coleman M Agyepong IA Zuithoff NP Client factors affect provider adherence to clinical guidelines during first antenatal care PLoS ONE 2016 11 6 e0157542 10.1371/journal.pone.0157542 27322643 PMC4913935 Amoakoh-Coleman M, Agyepong IA, Zuithoff NP, et al. Client factors affect provider adherence to clinical guidelines during first antenatal care. PLoS ONE. 2016;11(6):e0157542. 27322643 10.1371/journal.pone.0157542 PMC4913935 41. Yazbek M, Rossouw S, Ontiretse ML. Barriers and facilitators associated with partograph completion by midwives in a referral hospital in Botswana. University of Pretoria; 2022. 42. Gebrehiwot SW Abrha MW Weldearegay HG Health care professionals’ adherence to partograph use in ethiopia: analysis of 2016 National emergency obstetric and newborn care survey BMC Pregnancy Childbirth 2020 20 1 1 9 10.1186/s12884-020-03344-6 PMC7585173 33097018 Gebrehiwot SW, Abrha MW, Weldearegay HG. Health care professionals’ adherence to partograph use in ethiopia: analysis of 2016 National emergency obstetric and newborn care survey. BMC Pregnancy Childbirth. 2020;20(1):1–9. 10.1186/s12884-020-03344-6 PMC7585173 33097018 43. Leslie HH, Malata A, Ndiaye Y, Kruk ME. Effective coverage of primary care services in eight high-mortality countries. BMJ Global Health 2017;2(3).p.e000424. 10.1136/bmjgh-2017-000424 PMC5887868 29632704 44. Bahizi A, Lwanga D, Victor T. Assessment of partograph utilization and its association with pregnancy outcomes in uganda: a case of Kamwenge district. Br J Healthc Med Res-Vol. 2022;9(3). 45. Anyanwu EC Maduka CP Ayo-Farai O Okongwu CC Daraojimba AI Maternal and child health policy: A global review of current practices and future directions World J Adv Res Reviews 2024 21 2 1770 81 10.30574/wjarr.2024.21.2.0306 Anyanwu EC, Maduka CP, Ayo-Farai O, Okongwu CC, Daraojimba AI. Maternal and child health policy: A global review of current practices and future directions. World J Adv Res Reviews. 2024;21(2):1770–81. 46. Seyoum T, Alemayehu M, Christensson K, Lindgren H. Client factors affect provider adherence to guidelines during first antenatal care in public health facilities, ethiopia: a multi-center cross-sectional study. Ethiop J Health Sci 2020;30(6). 10.4314/ejhs.v30i6.8 PMC8047236 33883835 47. Mdoe PF Kaminsa PJ Massawe S Quality of partogram recordings and perinatal outcome at muhimbili National hospital Tanzania Women‘s Heal Sci J 2018 3 1 1 9 Mdoe PF, Kaminsa PJ, Massawe S. Quality of partogram recordings and perinatal outcome at muhimbili National hospital Tanzania. Women‘s Heal Sci J. 2018;3(1):1–9. 48. Nygaard Moller A-B. Midwifery care providers’ competencies in sub-Saharan Africa and global perinatal health outcomes. 2024. 49. Mwansisya T Mbekenga C Isangula K The impact of training on self-reported performance in reproductive, maternal, and newborn health service delivery among healthcare workers in tanzania: a baseline-and endline-survey Reproductive Health 2022 19 1 143 10.1186/s12978-022-01452-4 35725562 PMC9210613 Mwansisya T, Mbekenga C, Isangula K, et al. The impact of training on self-reported performance in reproductive, maternal, and newborn health service delivery among healthcare workers in tanzania: a baseline-and endline-survey. Reproductive Health. 2022;19(1):143. 35725562 10.1186/s12978-022-01452-4 PMC9210613 50. Adzitey SP, Wombeogo M, Mumin A-H, Adzitey F. Knowledge and attitude of nurses in the Tamale metropolis toward Kangaroo mother care (KMC). Ann Med Health Sci Res. 2017;7(6) 51. Leider JP Stang J Bonilla ZE Training the MCH workforce: the time for change is now Matern Child Health J 2022 26 Suppl 1 60 8 10.1007/s10995-022-03438-x 35980498 PMC9386196 Leider JP, Stang J, Bonilla ZE, et al. Training the MCH workforce: the time for change is now. Matern Child Health J. 2022;26(Suppl 1):60–8. 35980498 10.1007/s10995-022-03438-x PMC9386196 52. Nelson JR Ess RH Dickerson TT Strategies to increase rural maternal utilization of skilled health personnel for childbirth delivery in low-and middle-income countries: a narrative review Global Health Action 2022 15 1 2058170 10.1080/16549716.2022.2058170 35506937 PMC9090426 Nelson JR, Ess RH, Dickerson TT, et al. Strategies to increase rural maternal utilization of skilled health personnel for childbirth delivery in low-and middle-income countries: a narrative review. Global Health Action. 2022;15(1):2058170. 35506937 10.1080/16549716.2022.2058170 PMC9090426 53. Lawn JE Mwansa-Kambafwile J Horta BL Barros FC Cousens S Kangaroo mother care’to prevent neonatal deaths due to preterm birth complications Int J Epidemiol 2010 39 suppl1 i144 54 10.1093/ije/dyq031 20348117 PMC2845870 Lawn JE, Mwansa-Kambafwile J, Horta BL, Barros FC, Cousens S. Kangaroo mother care’to prevent neonatal deaths due to preterm birth complications. Int J Epidemiol. 2010;39(suppl1):i144–54. 20348117 10.1093/ije/dyq031 PMC2845870 54. Conde-Agudelo A Belizán JM Diaz‐Rossello J Cochrane review: Kangaroo mother care to reduce morbidity and mortality in low birthweight infants Evidence‐Based Child Health: Cochrane Rev J 2012 7 2 760 876 10.1002/ebch.1837 11034759 Conde-Agudelo A, Belizán JM, Diaz‐Rossello J. Cochrane review: Kangaroo mother care to reduce morbidity and mortality in low birthweight infants. Evidence‐Based Child Health: Cochrane Rev J. 2012;7(2):760–876. 10.1002/14651858.CD002771 11034759 55. Bhutta ZA Das JK Bahl R Can available interventions end preventable deaths in mothers, newborn babies, and stillbirths, and at what cost? Lancet 2014 384 9940 347 70 10.1016/S0140-6736(14)60792-3 24853604 Bhutta ZA, Das JK, Bahl R, et al. Can available interventions end preventable deaths in mothers, newborn babies, and stillbirths, and at what cost? Lancet. 2014;384(9940):347–70. 24853604 10.1016/S0140-6736(14)60792-3 56. Group WIKS Immediate Kangaroo mother care and survival of infants with low birth weight N Engl J Med 2021 384 21 2028 38 10.1056/NEJMoa2026486 34038632 PMC8108485 Group WIKS. Immediate Kangaroo mother care and survival of infants with low birth weight. N Engl J Med. 2021;384(21):2028–38. 34038632 10.1056/NEJMoa2026486 PMC8108485 57. Dramowski A Aucamp M Beales E Healthcare-associated infection prevention interventions for neonates in resource-limited settings Front Pead 2022 10 919403 10.3389/fped.2022.919403 PMC9301049 35874586 Dramowski A, Aucamp M, Beales E, et al. Healthcare-associated infection prevention interventions for neonates in resource-limited settings. Front Pead. 2022;10:919403. 10.3389/fped.2022.919403 PMC9301049 35874586 58. Nobbenhuis MA Walboomers JM Helmerhorst TJ Relation of human papilloma virus status to cervical lesions and consequences for cervical-cancer screening: a prospective study Lancet 1999 354 9172 20 5 10.1016/S0140-6736(98)12490-X 10406360 Nobbenhuis MA, Walboomers JM, Helmerhorst TJ, et al. Relation of human papilloma virus status to cervical lesions and consequences for cervical-cancer screening: a prospective study. Lancet. 1999;354(9172):20–5. 10406360 10.1016/S0140-6736(98)12490-X 59. Pimple S, Mishra G. Cancer cervix: epidemiology and disease burden. Cytojournal 2022;19 p.21. 10.25259/CMAS_03_02_2021 PMC9063649 35510109 60. Jalil AAT. Epidemiology of cervical cancer and high risk of human papilloma virus in patient (2021). ББК 286 З.85(7). 61. Cecilia NC Rosliza A Suriani I Global burden of cervical cancer: a literature review Int J Public Health Clin Sci 2017 4 2 10 8 Cecilia NC, Rosliza A, Suriani I. Global burden of cervical cancer: a literature review. Int J Public Health Clin Sci. 2017;4(2):10–8. 62. Ngcobo N Jaca A Iwu-Jaja CJ Mavundza E Reflection: burden of cervical cancer in Sub-Saharan Africa and progress with HPV vaccination Curr Opin Immunol 2021 71 21 6 10.1016/j.coi.2021.03.006 33857884 Ngcobo N, Jaca A, Iwu-Jaja CJ, Mavundza E. Reflection: burden of cervical cancer in Sub-Saharan Africa and progress with HPV vaccination. Curr Opin Immunol. 2021;71:21–6. 33857884 10.1016/j.coi.2021.03.006 63. World Health Organization. Global strategy to accelerate the elimination of cervical cancer as a public health problem. World Health Organization; 2020. 64. Kumawat G Vishwakarma SK Chakrabarti P Chittora P Chakrabarti T Lin JC-W Prognosis of cervical Cancer disease by applying machine learning techniques J Circuits Syst Computers 2023 32 01 2350019 10.1142/S0218126623500196 Kumawat G, Vishwakarma SK, Chakrabarti P, Chittora P, Chakrabarti T, Lin JC-W. Prognosis of cervical Cancer disease by applying machine learning techniques. J Circuits Syst Computers. 2023;32(01):2350019. 65. Gebreselassie BA. Quality improvement interventions in maternal and newborn care in Ethiopia: literature review. 2022. 66. Ten Ham W Minnie KC Van der Walt CS Health care professionals’ perspectives on the requirements facilitating the roll-out of Kangaroo mother care in South Africa Health Sa Gesondheid 2016 21 228 37 10.1016/j.hsag.2015.10.005 Ten Ham W, Minnie KC, Van der Walt CS. Health care professionals’ perspectives on the requirements facilitating the roll-out of Kangaroo mother care in South Africa. Health Sa Gesondheid. 2016;21:228–37. 67. Gill VR Liley HG Erdei C Improving the uptake of Kangaroo mother care in neonatal units: a narrative review and conceptual framework Acta Paediatr 2021 110 5 1407 16 10.1111/apa.15705 33289201 Gill VR, Liley HG, Erdei C, et al. Improving the uptake of Kangaroo mother care in neonatal units: a narrative review and conceptual framework. Acta Paediatr. 2021;110(5):1407–16. 33289201 10.1111/apa.15705 68. Ministry of Health and Social Welfare. The Tanzania Quality Improvement Framework in Health Care 2011–2016. October 2011; https://tzdpg.or.tz/storage/2022/06/The-Tanzania-Quality-Improvement-Framework-in-Health-Care-2011-2016.pdf 69. Kacholi G, Kalolo A, Mahomed OH. Performance of quality improvement teams and associated factors in selected regional referral hospitals in Tanzania: a cross-sectional study. Pan African Medical Journal. 2021 Feb 26;38(1) 10.11604/pamj.2021.38.223.23767 PMC8140683 34046128 70. Mwaisengela S Hokororo JC German CJ Functionality of quality improvement teams in primary healthcare facilities in tanzania: findings from star rating assessment J Service Sci Manage 2023 16 4 409 27 10.4236/jssm.2023.164023 Mwaisengela S, Hokororo JC, German CJ, et al. Functionality of quality improvement teams in primary healthcare facilities in tanzania: findings from star rating assessment. J Service Sci Manage. 2023;16(4):409–27. 71. Mwaisengela SM Hokororo JC German CJ Functionality of primary health facilities management teams: learning from 2017/2018’s Tanzania star rating assessment J Service Sci Manage 2023 16 2 94 109 10.4236/jssm.2023.162007 Mwaisengela SM, Hokororo JC, German CJ, et al. Functionality of primary health facilities management teams: learning from 2017/2018’s Tanzania star rating assessment. J Service Sci Manage. 2023;16(2):94–109. 72. Mkoka DA Goicolea I Kiwara A Mwangu M Hurtig A-K Availability of drugs and medical supplies for emergency obstetric care: experience of health facility managers in a rural district of Tanzania BMC Pregnancy Childbirth 2014 14 1 10 10.1186/1471-2393-14-108 24646098 PMC3995093 Mkoka DA, Goicolea I, Kiwara A, Mwangu M, Hurtig A-K. Availability of drugs and medical supplies for emergency obstetric care: experience of health facility managers in a rural district of Tanzania. BMC Pregnancy Childbirth. 2014;14:1–10. 24646098 10.1186/1471-2393-14-108 PMC3995093 73. Kabera JC Mukanyangezi MF Influence of inventory management practices on the availability of emergency obstetric drugs in Rwandan public hospitals: a case of Rwanda Southern Province BMC Health Serv Res 2024 24 1 14 10.1186/s12913-023-10459-x 38178088 PMC10768461 Kabera JC, Mukanyangezi MF. Influence of inventory management practices on the availability of emergency obstetric drugs in Rwandan public hospitals: a case of Rwanda Southern Province. BMC Health Serv Res. 2024;24(1):14. 38178088 10.1186/s12913-023-10459-x PMC10768461 74. Geetanjali Katageri GK, Umesh Charantimath UC, Anjali Joshi AJ et al. Availability and use of magnesium sulphate at health care facilities in two selected districts of North Karnataka, India. 2018. 10.1186/s12978-018-0531-6 PMC6020005 29945665 75. Nkamba DM Vangu R Elongi M Health facility readiness and provider knowledge as correlates of adequate diagnosis and management of pre-eclampsia in kinshasa, Democratic Republic of congo BMC Health Serv Res 2020 20 1 13 10.1186/s12913-020-05795-1 PMC7542875 33028310 Nkamba DM, Vangu R, Elongi M, et al. Health facility readiness and provider knowledge as correlates of adequate diagnosis and management of pre-eclampsia in kinshasa, Democratic Republic of congo. BMC Health Serv Res. 2020;20:1–13. 10.1186/s12913-020-05795-1 PMC7542875 33028310 76. Ridge AL Bero LA Hill SR Identifying barriers to the availability and use of magnesium sulphate injection in resource poor countries: a case study in Zambia BMC Health Serv Res 2010 10 1 9 10.1186/1472-6963-10-340 21162717 PMC3018452 Ridge AL, Bero LA, Hill SR. Identifying barriers to the availability and use of magnesium sulphate injection in resource poor countries: a case study in Zambia. BMC Health Serv Res. 2010;10:1–9. 21162717 10.1186/1472-6963-10-340 PMC3018452 77. Chaturvedi S, Upadhyay S, De Costa A. RESEARCH ARTICLE Open Access Competence of birth attendants at providing emergency obstetric care under India’s JSY conditional cash transfer program for institutional delivery: an assessment using case vignettes in Madhya Pradesh province. BMC Pregnancy Childbirth 2014;14(1) p.174. 10.1186/1471-2393-14-174 PMC4075933 24885817 78. Scheffler RM Mahoney CB Fulton BD Dal Poz MR Preker AS Estimates of health care professional shortages in Sub-Saharan Africa by 2015: critical shortages of health workers are projected in 2015 throughout sub-Saharan africa, and the projected cost to eliminate them approaches $20 billion Health Aff 2009 28 Suppl1 w849 62 10.1377/hlthaff.28.5.w849 19661111 Scheffler RM, Mahoney CB, Fulton BD, Dal Poz MR, Preker AS. Estimates of health care professional shortages in Sub-Saharan Africa by 2015: critical shortages of health workers are projected in 2015 throughout sub-Saharan africa, and the projected cost to eliminate them approaches $20 billion. Health Aff. 2009;28(Suppl1):w849–62. 10.1377/hlthaff.28.5.w849 19661111 79. Lincetto O Nazir A Cattaneo A Brief report. Kangaroo mother care with limited resources J Trop Pediatr 2000 46 5 293 5 10.1093/tropej/46.5.293 11077939 Lincetto O, Nazir A, Cattaneo A. Brief report. Kangaroo mother care with limited resources. J Trop Pediatr. 2000;46(5):293–5. 11077939 10.1093/tropej/46.5.293 80. Ganatra B Faundes A Role of birth spacing, family planning services, safe abortion services and post-abortion care in reducing maternal mortality Best Pract Res Clin Obstet Gynecol 2016 36 145 55 10.1016/j.bpobgyn.2016.07.008 27640082 Ganatra B, Faundes A. Role of birth spacing, family planning services, safe abortion services and post-abortion care in reducing maternal mortality. Best Pract Res Clin Obstet Gynecol. 2016;36:145–55. 10.1016/j.bpobgyn.2016.07.008 27640082 81. Onubogu U Okoh B Implementation of Kangaroo mother care by health workers in Nigeria Nigerian J Paediatrics 2016 43 4 252 7 10.4314/njp.v43i4.4 Onubogu U, Okoh B. Implementation of Kangaroo mother care by health workers in Nigeria. Nigerian J Paediatrics. 2016;43(4):252–7. 82. Weldearegay HG Medhanyie AA Abrha MW Quality of Kangaroo mother care services in ethiopia: implications for policy and practice PLoS ONE 2019 14 11 e0225258 10.1371/journal.pone.0225258 31756225 PMC6874352 Weldearegay HG, Medhanyie AA, Abrha MW, et al. Quality of Kangaroo mother care services in ethiopia: implications for policy and practice. PLoS ONE. 2019;14(11):e0225258. 31756225 10.1371/journal.pone.0225258 PMC6874352 83. Ministry of Health CD, Gender, Elderly and Children,. National Plan for Reproductive, Maternal, Newborn, Child and Adolescent Health & Nutrition. (2021/2022–2025/2026). November, 2021; https://www.globalfinancingfacility.org/sites/default/files/Tanzania-One-Plan-III.pdf 84. Ministry of Health CD, Gender, Elderly and Children,. Health Sector Strategic Plan July 2021– June 2026 (HSSP V). 2021; https://mitu.or.tz/wp-content/uploads/2021/07/Tanzania-Health-Sector-Strategic-Plan-V-17-06-2021-Final-signed.pdf 85. Kinyenje E Hokororo J Eliakimu E Status of infection prevention and control in Tanzanian primary health care facilities: learning from star rating assessment Infect Prev Pract 2020 2 3 100071 10.1016/j.infpip.2020.100071 34316561 PMC7311348 Kinyenje E, Hokororo J, Eliakimu E, et al. Status of infection prevention and control in Tanzanian primary health care facilities: learning from star rating assessment. Infect Prev Pract. 2020;2(3):100071. 34316561 10.1016/j.infpip.2020.100071 PMC7311348 86. Kinyenje ES Yahya TA Degeh MM Clients satisfaction at primary healthcare facilities and its association with implementation of client service charter in Tanzania PLoS ONE 2022 17 8 e0272321 10.1371/journal.pone.0272321 35969601 PMC9377608 Kinyenje ES, Yahya TA, Degeh MM, et al. Clients satisfaction at primary healthcare facilities and its association with implementation of client service charter in Tanzania. PLoS ONE. 2022;17(8):e0272321. 35969601 10.1371/journal.pone.0272321 PMC9377608 87. Kinyenje ES Yahya TA Hokororo JC Social accountability in primary health care facilities in tanzania: results from star rating assessment PLoS ONE 2022 17 7 e0268405 10.1371/journal.pone.0268405 35877654 PMC9312412 Kinyenje ES, Yahya TA, Hokororo JC, et al. Social accountability in primary health care facilities in tanzania: results from star rating assessment. PLoS ONE. 2022;17(7):e0268405. 35877654 10.1371/journal.pone.0268405 PMC9312412 88. Kinyenje E Ngowi RR Msigwa YS Status of countrywide laboratory services quality and capacity in primary healthcare facilities in tanzania: findings from star rating assessment PLOS Global Public Health 2023 3 10 e0001489 10.1371/journal.pgph.0001489 37851603 PMC10584114 Kinyenje E, Ngowi RR, Msigwa YS, et al. Status of countrywide laboratory services quality and capacity in primary healthcare facilities in tanzania: findings from star rating assessment. PLOS Global Public Health. 2023;3(10):e0001489. 37851603 10.1371/journal.pgph.0001489 PMC10584114 89. Ministry of Health and Social Welfare. Staffing levels for ministry of health and social welfare departments, health service facilities. Health Train Institutions Agencies. 2014;2018:2014. https://www.jica.go.jp/project/tanzania/006/materials/ku57pq00001x6jyl-att/REVIEW_STAFFING_LEVEL_2014-01.pdf https://www.jica.go.jp/project/tanzania/006/materials/ku57pq00001x6jyl-att/REVIEW_STAFFING_LEVEL_2014-01.pdf 90. Ndimbo D. Tanzania Assistant Medical Officers and Clinical Officers Social Inovations. 2021. Accessed 30 Jul 2024. https://socialinnovationsjournal.com/index.php/sij/article/download/989/738 ",
  "metadata": {
    "Title of this paper": "Status of countrywide laboratory services quality and capacity in primary healthcare facilities in tanzania: findings from star rating assessment",
    "Journal it was published in:": "Reproductive Health",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486962/"
  }
}