{
  "title": "Paper_592",
  "abstract": "pmc Front Surg Front Surg 2654 frontsurg Front. Surg. Frontiers in Surgery 2296-875X Frontiers Media SA PMC12477208 PMC12477208.1 12477208 12477208 41030563 10.3389/fsurg.2025.1601111 1 Surgery Original Research A novel approach of manual manipulation of the transnasal ileus tube for severe or recurrent benign adhesive small bowel obstruction Li Er-Sheng * Zhai Yin-Jun Han Yin Chang Qian Wang Qi Zhang Hong-Yu Department of Radiology, The Second Affiliated Hospital, Xingtai Medical College/Xingtai Cancer Hospital Xingtai, Hebei Province China Edited by: Robert Kliček Reviewed by: Satoshi Obata Emanuel Shapera * Correspondence: 13700397871@139.com 15 9 2025 2025 12 480749 1601111 14 4 2025 18 8 2025 15 09 2025 30 09 2025 01 10 2025 © 2025 Li, Zhai, Han, Chang, Wang and Zhang. 2025 Li, Zhai, Han, Chang, Wang and Zhang https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY) Purpose This study seeks to evaluate the safety and efficacy of an innovative manual manipulation technique for the transnasal ileus tube in patients experiencing severe or recurrent adhesive small bowel obstruction (ASBO). Materials and Methods Prior to the initiation of this research, approval was obtained from the institutional review board. The study was conducted within our institution, involving a cohort of fifty-four patients diagnosed with severe, multiple, or recurrent ASBO. These patients underwent treatment through active manipulation of the transnasal ileus tube, which entailed navigating obstructions by adjusting two balloons and resolving adhesions through the alternate advancement and retraction of the ileus tube. Angiographic outcomes were categorized as either complete or incomplete resolution of obstructions. Data were collected on technical success, initial and final angiographic outcomes, mortality, morbidity, and overall clinical outcomes. Follow-up assessments were conducted at 1, 3, 6, and 12 months, with annual evaluations thereafter. Results The transnasal ileus tube was successfully placed in all patients without any procedure-related complications. The tube was successfully navigated and passed through obstructions to the cecum in 94.4% of cases, specifically in 51 out of 54 attempts. Follow-up angiograms, conducted over a period of 3–38 months, confirmed the unobstructed passage of contrast medium through the small bowel in 52 patients. Clinical follow-up data, with an average duration of 20 ± 11 months (95% CI: 17, 23 months; range, 6–45 months), were available for 52 patients. One patient died due to multiple organ failure, while the remaining 51 patients exhibited no clinical symptoms of small bowel obstruction. Conclusion These preliminary findings indicate that manual manipulation of the transnasal ileus tube is non-surgical and therefore non-traumatic but nonetheless an effective method of internally lysing the adhesions with their double balloon technique and pulling the tube back and forth. small bowel obstruction ileus tube adhesion manual manipulation draw back The author(s) declare that no financial support was received for the research and/or publication of this article. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Visceral Surgery Introduction Small bowel obstruction (SBO) is the most frequently encountered surgical complication involving the small intestine ( 1 3 3 5 6 8 Since the 1930s, favorable outcomes have been acquired in the management of ASBO through a long ileus tube to decompress the obstructed intestine ( 9 14 Materials and methods Patients The study protocol was approved by our institutional review board, and written informed consent was obtained from all eligible participants prior to their inclusion in the study. Between April 2017 and December 2023, a total of 54 patients diagnosed with severe, multiple, or recurrent adhesive small bowel obstruction (ASBO) were enrolled and subsequently monitored at our institution. The inclusion criteria were as follows: 1. prior surgical history; 2. the presence of definitive clinical symptoms and physical signs indicative of mechanical intestinal obstruction, such as abdominal pain and distension, nausea, vomiting, and constipation; 3. a diagnosis of benign adhesive ASBO confirmed through abdominal plain radiographs and computed tomography (CT) scans, corroborated by at least two attending radiologists; and 4. the availability of at least one control angiogram conducted a minimum of three months post-treatment. Patients with suspected postoperative peritoneal cavity infection, paralytic ileus, strangulated intestinal obstruction, adynamic obstruction, or ileus due to volvulus, recurrent tumor, or hernia were excluded from the study. Ileus tube In this study, the CLINY Ileus Tube suite (Create Medic, Tokyo, Japan) was employed ( Figure 1 Figure 1 The transnasal ileus tube. Transnasal ileus tube shown with labeled parts: a coiled blue tube featuring an anterior and posterior balloon, six steel balls, and connectors at one end. The left image shows the tube's layout, and the right offers a close-up of the balloons. Interventional techniques All procedures were executed under local anesthesia by two interventional radiologists, E.S.L. and J.X.M., with 25 and 18 years of experience, respectively. The interventions were carried out utilizing a single-plane angiography system with fluoroscopic guidance. When required, patients' vital signs, including blood pressure, heart rate, and oxygen saturation (SPO2), were continuously monitored using an electrocardiogram monitor throughout the duration of the procedure. Step 1: ileus tube placement The patient was positioned on the operating table in either a right anterior oblique or supine orientation. Following the administration of topical anesthesia with 2% lidocaine, a tube was inserted through the nasal cavity into the stomach. A 0.035-inch Amplatz super-stiff guidewire was subsequently introduced into the main channel and navigated to the distal duodenum under fluoroscopic guidance. The tube was then advanced over the guidewire into the distal duodenum. Upon withdrawal of the guidewire, the long tube was secured to the patient's cheek. The anterior balloon was inflated with 15 ml of distilled water and propelled forward by bowel peristalsis and its weighted tip. As the anterior balloon advanced, the tube was further progressed. The external end of the tube was connected to a spontaneous negative pressure bag. Intermittent lavage was performed once daily through the long tube, beginning on the second day post-intubation, with careful measurement of the tube's advancement. Step 2: pass through the obstructive site Diagrams illustrating the novel procedures for the manual manipulation of the transnasal ileus tube as it traverses the obstructive site are presented in Figure 2 Supplementary Figure S1 Figure 2A Figure 2B Figure 2 Diagrams illustrates the innovative steps involved in the manual manipulation of a transnasal ileus tube as it traverses an obstructive site, ultimately resolving adhesive obstruction. (A) (B) (C) (D) (E) (F) (G) (H) Diagram illustrating the sequence of nasogastric tube insertion into a person's digestive system, labeled from A to H. Each step shows the tube's progression from the nasal passage, down the esophagus, into the stomach and intestines. The tube path is highlighted in blue, with arrows indicating movement or alignment at various stages. Generally, the combination of the deflated anterior balloon and its weighted tip can be advanced through the obstruction by the inflation of the posterior balloon, aided by bowel peristalsis ( Figure 2C Figure 2D Figure 2E Step 3: loosening and resolving the adhesive small bowel Diagrams illustrating the steps for loosening and resolving adhesions in the small bowel are presented in Figure 2 Supplementary Figure S2 Figure 2E Figure 2F Figures 2G,H Angiographic studies utilizing a 76% meglumine diatrizoate solution, alongside abdominal flat plate radiographs, are performed every 12–24 h post-ileus tube insertion to confirm tube positioning, evaluate the resolution of the obstruction, and inform subsequent clinical decisions. Following the insertion of the long tube, intermittent continuous suction is employed to alleviate intraluminal pressure within the small intestine, while fluid and electrolyte imbalances are addressed. Once the tube's tip reaches the colon, the proximal portion is excised, and the tube is extracted through the anus. Oral feeding is cautiously reintroduced upon substantial improvement in the clinical manifestations of mechanical intestinal obstruction. Should the patient's condition fail to improve within 72 h post-tube placement, or if there is progression to strangulation, surgical intervention is advised ( 12 . Follow-up and postoperative outcome evaluation Follow-up protocols were implemented at intervals of 1, 3, 6, and 12 months post-removal of the ileus tube, and subsequently on an annual basis. These follow-ups were conducted by one of the two authors and encompassed clinical evaluations, gastroenterography, and abdominal computed tomography (CT) scans. Data pertaining to technical success, initial and final angiographic outcomes, mortality, morbidity, and the ultimate clinical outcome were prospectively collected and analyzed by the authors at the time of patient discharge and at the end of the follow-up period. Angiographic data were categorized into two classifications: complete resolution of adhesive small bowel obstruction (ASBO), defined by the absence of air-fluid levels and gas in bowel loops, and incomplete resolution, characterized by a reduction of gas and fluid in bowel loops. Clinical follow-ups were classified into four categories: complete recovery from ASBO symptoms and signs, improvement in ASBO symptoms and signs, no change in symptoms, or worsening of ASBO symptoms and signs. Statistical analysis Data are presented as the mean ± standard deviation, and statistical analyses were conducted using SPSS statistical software (version 24.0 for Windows, SPSS Inc., Chicago, IL, USA). A Wilcoxon or Student's t p p Results Patient population A total of 54 patients (comprising 36 men with a mean age of 53 ± 12 years, ranging from 27–76 years, and 18 women with a mean age of 52 ± 12 years, ranging from 36–82 years) were included in this study. The baseline characteristics of the patients are detailed in Table 1 Table 1 The baseline characteristics of the 54 patients with adhesive small bowel obstruction (ASBO). Characteristic Value Age (years) 53.96 ± 11.06 Female/Male 36/18 complete/incomplete ASBO (no.) 19/35 Duration of ASBO (months) 13.22 ± 5.78 (range, 2–27) Frequency of ASBO (no.) 2.0 ± 0.87 (range,1–5) Reasons for ASBO Appendectomy 12 Alimentary tract perforation neoplasty 11 Radical correction for Colon cancer 10 Gynecilogical operation 9 Radical correction for Gastric cancer 7 Intestinal necrosis resection 2 Others 3 Duration of the ileus tube placement 24.73 ± 8.65 (range, 9–42 mm) Number of the obstructions 2.50 ± 0.87 (range, 1–4) Angiogram follow-ups (months) 15.12 ± 9.29(range, 3–38) Clinical follow-up (months) 20.23 ± 10.89(range, 6–45) Final angiogram results (complete occlusion) [no. (%)] 52 (100) Final clinical results (full recovery) [no. (%)] 52 (100) Primary procedural results The comprehensive procedures for the manual manipulation of the transnasal ileus tube to address adhesive small bowel obstruction (ASBO) are depicted in Figures 3 4 Figure 3 In a 63-year-old male patient, adhesive small bowel obstruction (ASBO) occurred six months following a surgical small bowel resection, which was initially performed to address ASBO secondary to a surgical repair of a stomach perforation that took place 30 years prior. (A) (B) (C) (D) (E) (F) (G-I) (J) (K,L) Twelve-panel sequence of abdominal X-rays labeled A to L. Each X-ray shows varying levels of contrast in the gastrointestinal tract, with some images, such as B, C, D, E, and F, highlighted with arrows pointing to specific areas of interest. The other X-rays illustrate different stages or conditions, showing changes over time or across different examinations. The images suggest a focus on the digestive system, potentially indicating a study or diagnosis process. Figure 4 In a 45-year-old male patient, adhesive small bowel obstruction (ASBO) was observed two weeks following radical resection for appendicitis. (A) (B) (C) (D) (E) (F) (G) (H-J) (K,L) Twelve-panel X-ray images labeled A through L showing various abdominal conditions. Panels D, G, and H have notable differences, with G showing yellow arrows pointing at specific areas. Images K and L contain significant white areas, indicating contrast or calcification. Excluding the two patients who experienced technique failure, angiographic analysis revealed complete obstruction in 15 patients and incomplete obstructions in 37 patients. A single obstruction was identified in 6 patients, two obstructions in 21 patients ( Figure 3 Figure 4 Follow-up results At the time of composing this manuscript, follow-up angiograms had been completed for all 52 patients, with a mean follow-up duration of 15 ± 9 months (95% CI: 13, 18 months) and a range of 3–38 months. Angiograms were performed at three and six months for all patients, while 37 patients completed the 12-month follow-up, 15 patients underwent the two-year follow-up, and four patients completed the three-year follow-up. The angiograms obtained at the final follow-up indicated complete resolution of the ABSO in all 52 patients, with no evidence of recurrence. Clinical follow-up data were available for all patients, with a mean duration of 20 ± 11 months (95% CI: 17, 23 months) and a range of 6–45 months. During this period, one patient succumbed to multiple organ failure due to diffuse metastasis. Importantly, no clinical symptoms or physical signs of mechanical intestinal obstruction were reported by any of the 52 patients, including the patient for whom the ileus tube did not pass to the cecum and the patient who died. Discussion In this study, we introduced an innovative procedure involving the manual manipulation of a transnasal ileus tube for the treatment of severe, multiple, or recurrent adhesive small bowel obstruction (ASBO) and assessed its clinical outcomes. Despite the limited sample size, the transnasal ileus tube successfully navigated obstructions in 94.4% (51 out of 54) of the patients. Complete resolution and full recovery from ASBO were achieved in 100% (52 out of 52) of the patients, with no observed recurrence. The significant improvement in clinical outcomes appears to be primarily attributable to the active adjustment of the two balloons and the back-and-forth manipulation of the tube. These promising results suggest that active manipulation of the transnasal ileus tube is a safe and effective procedure for managing ASBO. Furthermore, a notable finding of this study was the ability to identify the site and number of obstructions, a capability not possible with traditional ileus tubes. The presence of fixed curvatures, indicative of obstructive sites or zones, became apparent when the tip of the tube began to retract during the manipulation process. The site and number of obstructions could be determined based on the location and number of these fixed curvatures. The ileus tube possesses the capability to aspirate intestinal contents, alleviate bowel wall edema, enhance bowel motility, improve circulation within the affected intestine, rectify intestinal kinking, and prevent bacterial translocation. Unlike traditional ileus tubes documented in the literature, our study introduces notable innovations, particularly through the active manipulation of dual balloons and the bidirectional movement of the tube. The balloons were manually adjusted to navigate obstructions, and the ileus tube was moved back and forth to facilitate the loosening and resolution of adhesive small bowel obstruction (ASBO). This method offers several advantages: 1. successful passage of the transnasal ileus tube through severe, multiple, or recurrent ASBO in the majority of patients, 2. more comprehensive loosening and resolution of ASBO, and 3. a reduced recurrence rate. In the literature, the traditional ileus tube was characterized by its passive function. It was typically inserted above the distal duodenum, relying on bowel peristalsis to advance the inflated anterior balloon and its weighted tip. This method was generally indicated for cases of incomplete or simple adhesive small bowel obstruction (ASBO), but proved ineffective for complete or multiple ASBOs due to its reliance solely on bowel peristalsis to navigate obstructions. Recent studies on ASBO management using transnasal ileus tubes have demonstrated a resolution rate of approximately 90% among treated patients ( 9 14 15 16 17 The passage through the obstruction serves as the foundational premise for the treatment of adhesive small bowel obstructions (ASBOs). The key to effectively treating and preventing the recurrence of ASBOs lies in the repeated advancement and retraction of the ileus tube. Although the balloon may occasionally traverse the obstructions smoothly, this does not necessarily signify that the adhesive zones are completely loosened. In many instances, the adhesive zones are only partially loosened, potentially leading to future recurrence. Therefore, we frequently advance the tip of the ileus tube into the cecum after navigating through the obstructions and subsequently retract the deflated ileus tube to the proximal small bowel. These procedures should be repeated as necessary until the ASBOs are thoroughly loosened and resolved. Throughout the process of advancing and retracting the ileus tube, the small curvatures enlarge, the tortuous sections of the bowel decrease, and the fixed curvatures become less pronounced. Concurrently, the time required to retract the ileus tube from the colon to the proximal small bowel decreases, while the tube traverses the small bowel to the cecum more swiftly than before ( Figures 3 4 Our findings demonstrated a 100% resolution rate of adhesive small bowel obstruction (ASBO) during follow-up, surpassing the reported range of 90% ASBO resolution in the literature ( 9 15 The advancement of the ileus tube within the small intestine was not consistently successful after its initial placement, often encountering resistance that hindered its progression. Three primary scenarios may account for this impediment: 1. The presence of viscous fecal matter obstructing the tube's forward movement. This issue can often be mitigated by diluting the feces using compound meglumine diatrizoate or saline solutions. 2. Pronounced bowel curvatures, particularly in the jejunum and proximal ileum. This challenge is typically addressed by retracting and repositioning the tube to alleviate the curvature. 3. Obstructions located distal to the tube's tip, which impede its advancement. In such cases, active manipulation of the two balloons is employed to navigate through the obstruction. When the ileus tube proved ineffective, angiographic procedures employing a 76% solution of meglumine diatrizoate were deemed necessary. Meglumine diatrizoate, a water-soluble contrast agent, is advantageous for both the diagnosis and treatment of adhesive small bowel obstruction (ASBO) ( 18 19 Potential complications, such as intestinal mucosal damage and intestinal rupture, may occur during these procedures; however, they were not observed in this study. Frequent retraction of the ileus tube can exacerbate intestinal mucosal damage; thus, it is generally recommended that this procedure be performed only once daily to facilitate mucosal healing. Additionally, forceful retraction of the ileus tube may lead to intestinal rupture. Patients often perform the retraction themselves, and the procedure should be halted if abdominal pain arises or if increased resistance is encountered during retraction, to prevent bowel rupture. Consequently, it is imperative to consistently remind patients to execute the procedure gently and avoid vigorous movements to mitigate the risk of potential complications. This study acknowledges several limitations: it was not structured as a comparative analysis, the sample size was limited, and a control group was absent. The primary aim was to elucidate the techniques and outcomes associated with innovative approaches for managing adhesive small bowel obstruction (ASBO) within our clinical practice. Moreover, the procedures utilized to address ASBO entailed considerable radiation exposure due to repeated plain abdominal radiographs and angiograms, although each individual dose was low. Additionally, the complexity of these procedures resulted in prolonged outpatient examination durations. In instances involving true strictures or severe obstructions, the advancement of the ileus tube through the obstructions was challenging. In conclusion, the manual manipulation of the transnasal ileus tube is non-surgical and therefore non-traumatic but nonetheless an effective method of internally lysing the adhesions with their double balloon technique and pulling the tube back and forth. While the initial results are promising, extended follow-up and larger clinical trials are essential to further substantiate these findings. Data availability statement The raw data supporting the conclusions of this article will be made available by the authors, without undue reservation. Ethics statement The studies involving humans were approved by The Second Affiliated Hospital, Xingtai Medical College/Xingtai Cancer Hospital. The studies were conducted in accordance with the local legislation and institutional requirements. The participants provided their written informed consent to participate in this study. Author contributions E-SL: Writing – review & editing, Data curation, Methodology, Supervision, Conceptualization. Y-JZ: Writing – original draft, Formal analysis, Resources. YH: Writing – original draft, Resources. QC: Writing – original draft, Resources. QW: Writing – original draft, Resources. H-YZ: Writing – original draft, Resources. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher's note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fsurg.2025.1601111/full#supplementary-material References 1. Diaz JJ Jr Bokhari F Mowery NT Acosta JA Block EF Bromberg WJ Guidelines for management of small bowel obstruction J Trauma 2008 64 6 1651 64 10.1097/TA.0b013e31816f709e 18545135 2. Kendrick ML Partial small bowel obstruction: clinical issues and recent technical advances Abdom Imaging 2009 34 329 34 10.1007/s00261-008-9436-0 18597140 3. Attard JA1 MacLean AR Adhesive small bowel obstruction: epidemiology, biology and prevention Can J Surg 2007 50 291 300 17897517 PMC2386166 4. Menzies D Peritoneal adhesions. Incidence, cause, and prevention Surg Annu 1992 24 27 45 1727325 5. Luijendijk RW de Lange DCD Wauters CCAP Hop WCJ Duron JJ Pailler JL Foreign material in postoperative adhesions Ann Surg 1996 223 242 8 10.1097/00000658-199603000-00003 8604903 PMC1235111 6. Catena F Di Saverio S Kelly MD Biffl WL Ansaloni L Mandalà V Bologna guidelines for diagnosis and management of adhesive small bowel obstruction (ASBO): 2010 evidence-based guidelines of the world society of emergency surgery World J Emerg Surg 2011 6 5 10.1186/1749-7922-6-5 21255429 PMC3037327 7. Coleman G McLain AD Moran BJ Impact of previous surgery on time taken for incision and division of adhesions during laparotomy Dis Colon Rectum 2000 43 1297 9 10.1007/BF02237441 11005501 8. van der Krabben AA Dijkstra FR Nieuwenhuijzen M Reijnen MMPJ Schaapveld M van Goor H Morbidity and mortality of inadvertent enterotomy during adhesiotomy Br J Surg 2000 87 467 71 10.1046/j.1365-2168.2000.01394.x 10759744 9. Wolfson PJ Bauer JJ Gelernt IM Kreel I Aufses AH Use of the long tube in the management of patients with smallintestinal obstruction due to adhesions Arch Surg 1985 120 1001 6 10.1001/archsurg.1985.01390330013002 4026552 10. Fazel MZ Jamieson RW Watson CJ Long-term follow-up of the use of the Jones’ intestinal tube in adhesive small bowel obstruction Ann R Coll Surg Engl 2009 91 50 4 10.1308/003588409X358999 18990270 PMC2752244 11. Tanaka S Yamamoto T Kubota D Matsuyama M Uenishi T Kubo S Predictive factors for surgical indication in adhesive small bowel obstruction Am J Surg 2008 196 23 7 10.1016/j.amjsurg.2007.05.048 18367141 12. Gowen GF Long tube decompression is successful in 90% of patients with adhesive small bowel obstruction Am J Surg 2003 185 512 5 10.1016/S0002-9610(03)00074-6 12781876 13. Zuo L Cao L Ding C Tu H Wei C Yuan L Strategy to small intestine obstruction caused by Crohn's disease on the basis of transnasal ileus tube insertion BMC Surg 2022 22 1 183 10.1186/s12893-022-01632-w 35568851 PMC9107679 14. Lin YX Wang SJ Liang HS Lin S Bian LY Ding J Clinical analysis of the curative effect of a transnasal ileus tube in the treatment of small bowel obstruction caused by a phytobezoar Gastroenterol Res Pract 2020 2020 1 10.1155/2020/4295024 PMC7539104 33061959 15. Guo SB Duan ZJ Decompression of the small bowel by endoscopic long-tube placement World J Gastroenterol 2012 18 1822 6 10.3748/wjg.v18.i15.1822 22553408 PMC3332297 16. Chen XL Ji F Lin Q Chen YP Lin JJ Ye F A prospective randomized trial of transnasal ileus tube vs nasogastric tube for adhesive small bowel obstruction World J Gastroenterol 2012 18 1968 74 10.3748/wjg.v18.i16.1968 22563179 PMC3337574 17. Li RH Li DC Lv XP Quan B Radiophotographically controlled nasointestinal intubation to treat recurrent postoperative adhesive ileus Cell Biochem Biophys 2015 72 509 14 10.1007/s12013-014-0496-1 25567660 18. Yamaguchi D Ikeda K Takeuchi Y Kinoshita R Higuchi T Fukuda H New insertion method of transnasal ileus tube for small bowel obstruction: anterior balloon method PLoS One 2018 13 11 e0207099 10.1371/journal.pone.0207099 30462677 PMC6248956 19. Branco BC Barmparas G Schnüriger B Inaba K Chan LS Demetriades D Systematic review and meta-analysis of the diagnostic and therapeutic role of water-soluble contrast agent in adhesive small bowel obstruction Br J Surg 2010 97 470 8 10.1002/bjs.7019 20205228 ",
  "metadata": {
    "Title of this paper": "Systematic review and meta-analysis of the diagnostic and therapeutic role of water-soluble contrast agent in adhesive small bowel obstruction",
    "Journal it was published in:": "Frontiers in Surgery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477208/"
  }
}