{
  "title": "Paper_766",
  "abstract": "pmc Pharmaceutics Pharmaceutics 2103 pharmamdpi pharmaceutics Pharmaceutics 1999-4923 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473489 PMC12473489.1 12473489 12473489 41012552 10.3390/pharmaceutics17091217 pharmaceutics-17-01217 1 Article Selective Inhibition of Yersinia enterocolitica Lindera obtusiloba Yoo Jin-Hee Conceptualization Methodology Software Validation Formal analysis Investigation Data curation Writing – original draft Visualization https://orcid.org/0000-0002-7483-0432 Kim Tae-Jong Conceptualization Methodology Software Validation Formal analysis Resources Data curation Writing – review & editing Visualization Supervision Project administration Funding acquisition * Izake Emad L. Academic Editor Department of Forest Products and Biotechnology, Kookmin University, 77 Jeongneungro, Seongbukgu, Seoul 02707, Republic of Korea; jhy0730@kookmin.ac.kr * bigbell@kookmin.ac.kr 18 9 2025 9 2025 17 9 497664 1217 25 8 2025 15 9 2025 17 9 2025 18 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives Methods Lindera obtusiloba Yersinia enterocolitica Results Y. enterocolitica Conclusions L. obtusiloba Yersinia enterocolitica type III secretion system virulence factor inhibition cinnamtannin B1 Lindera obtusiloba macrophage protection National Research Foundation of Korea (NRF) 2021R1F1A1061888 This research was supported by a National Research Foundation of Korea (NRF) grant (No. 2021R1F1A1061888) funded by the Korean government (MSIT). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Traditional antibiotics target bacterial-specific metabolisms to selectively kill bacteria. However, this creates selective pressure that accelerates the emergence of antibiotic-resistant strains [ 1 2 3 The type III secretion system (T3SS) is a critical virulence factor in many Gram-negative bacteria, including Yersinia Shigella Pseudomonas aeruginosa Escherichia coli E. coli Chlamydia 4 5 Yersinia enterocolitica 6 Y. enterocolitica 7 Yersinia enterocolitica 8 Yersinia 9 Yersinia 10 11 The genes encoding the Ysc T3SS are located on a ~70 kb plasmid, the pYV plasmid. Yop effectors play a pivotal role in immune evasion by suppressing macrophage and polymorphonuclear leukocyte phagocytosis, inhibiting the activation of T and B lymphocytes, and modulating cytokine production by T and B lymphocytes [ 12 13 14 The Ysa T3SS is encoded by the ysa locus in the chromosome of Y. enterocolitica 9 Y. enterocolitica 15 16 Y. enterocolitica 17 The secretion-dependent phospholipase activity of YplA, a phospholipase A in Y. enterocolitica 18 12 19 Building on prior research into the antimicrobial and antibiofilm activities of plant-derived extracts [ 20 21 Lindera obtusiloba L. obtusiloba 22 23 24 25 25 22 26 27 L. obtusiloba Cinnamtannin B1 (PubChem Identifier: CID 475277), a condensed tannin derived from natural sources, including L. obtusiloba 25 28 29 30 31 32 33 The purpose of this study is to identify and characterize compounds that selectively inhibit the T3SS in Y. enterocolitica L. obtusiloba O Y. enterocolitica 2. Materials and Methods 2.1. Bacterial and Culture Media Yersinia enterocolitica Y. enterocolitica 34 19 9 34 12 Yersinia enterocolitica 17 2 13 2.2. Analysis of T3SS-Secreted Proteins Yersinia enterocolitica Y. enterocolitica 600 600 600 600 600 To analyze the proteins secreted via all three T3SSs, cells were removed from the culture media by centrifugation at 7280× g g g 600 2.3. YplA Phospholipase Activity Assay To assess protein secretion, precultured Y. enterocolitica 600 600 2 g 2 35 36 595 TM 2.4. Preparation of the L. obtusiloba Extract The stem bark of L. obtusiloba ® 2.5. Isolation of Active Ingredients The methanol extract (353.5 g) was fractionated using butanol, dichloromethane, ethyl acetate, and water. The ethyl acetate fraction (9.5 g) was separated by silica gel vacuum column chromatography (400 mesh) using a solvent mixture of 83.3% dichloromethane and 16.7% methanol, yielding three fractions (E1-1–E1-3). Of these, E1-2 exhibited strong inhibitory activity against YplA phospholipase. Thus, 2.221 g of E1-2 was further separated into three fractions (E2-1–E2-3) through C18 reverse-phase column chromatography with 11.1% methanol. Among these fractions, E2-2 showed strong inhibitory activity against YplA phospholipase, so 889 mg was purified through C18 reverse-phase column chromatography with 9.1% methanol, and E3-3 (final weight: 185 mg) showed strong inhibitory activity against YplA phospholipase. The chemical structure of the compound in E3-3 was analyzed using INOVA 300 MHz nuclear magnetic resonance (NMR) spectrometer (Varian, Walnut Creek, CA, USA) and a Micromass ZQ detector (Waters Co., Milford, MA, USA) attached to an Alliance HPLC system (Separation Module 2695, Waters Co., Milford, MA, USA). A single compound was identified as inhibiting T3SS protein secretion using a YplA assay. The chemical shifts are reported in δ (ppm) with coupling constant J (Hz). 2.6. Morphological Changes to Macrophage Cells Following Y. enterocolitica Infection RAW 264.7 macrophage cells were cultured at 37 °C and 5% CO 2 v v 5 For infection, Y. enterocolitica Y. enterocolitica g 2 2.7. Measuring Cell Cytotoxicity Due to Y. enterocolitica Infection RAW 264.7 macrophage cells were seeded at 2 × 10 4 2 Y. enterocolitica Y. enterocolitica g 2 2 37 2.8. Gene Expression Analysis The Y. enterocolitica Table 1 38 −ΔΔCt p 2.9. Detection of Poly (ADP-Ribose) Polymerase (PARP) by Immunoblotting The RAW 264.7 macrophage cells were seeded at 3 × 10 5 2 Y. enterocolitica Y. enterocolitica Y. enterocolitica g 2 g 3. Results 3.1. An Ethyl Acetate Fraction of L. obtusiloba Inhibited the Secretion of YplA Using methanol, 353.5 g of extract solid was prepared from 3 kg of L. obtusiloba Figure 1 In a previous study, YplA, a phospholipase, was secreted by Y. enterocolitica 12 Figure 2 Figure 2 Figure 2 The ethyl acetate fraction (gray bars in Figure 2 Figure 2 Figure 2 Figure 2 The phospholipase activity decreased proportionally with increasing concentrations of the ethyl acetate fraction ( Figure 2 L. obtusiloba 3.2. Cinnamtannin B1 Was Identified in the Ethyl Acetate Fraction of the L. obtusiloba Extract, Which Inhibited YplA Phospholipase Activity Secreted by T3SSs in Y. enterocolitica The ethyl acetate fraction (9.5 g) was further fractionated to identify the active compound ( Figure 1 The compound from E3-3 was obtained as a brown amorphous powder, and its molecular formula appeared to be C 45 36 18 − Supplementary Table S1 39 40 The 1 H J H J 13 C 1 13 Table S1 Figure 3 The inhibitory activity of cinnamtannin B1 against the YplA phospholipase secreted by the T3SSs was evaluated ( Figure 3 3.3. Protein Secretion via the T3SS Is Inhibited by Cinnamtannin B1 The inhibitory effect of 50 µM cinnamtannin B1 on protein secretion via the three T3SSs was confirmed by SDS-PAGE ( Figure 4 Y. enterocolitica Figure 4 Figure 4 p Figure 4 Y. enterocolitica To further investigate the selective effect of 50 μM cinnamtannin B1 on the secretion of YopH and YopO, the expression levels of the genes corresponding to four Yop proteins were analyzed using RT-qPCR ( Figure 4 gapA 41 yopH yopO p yopM yopP p yopH yopO 3.4. Cinnamtannin B1 Prevents the Killing of RAW 264.7 Macrophages by Y. enterocolitica The effect of cinnamtannin B1 on the survival of RAW 264.7 macrophages during Y. enterocolitica Figure 5 Figure 5 Untreated RAW 264.7 cells ( Figure 5 Figure 5 Y. enterocolitica Figure 5 Figure 5 Figure 5 Figure 5 An MTT assay was performed to quantify cell survival ( Figure 5 Y. enterocolitica yopH yopO 3.5. Cinnamtannin B1 Inhibited the Y. enterocolitica-Induced Apoptosis of RAW 264.7 Macrophages Cinnamtannin B1 significantly increased the cell survival of RAW 264.7 macrophages under attack from Y. enterocolitica Figure 5 Macrophages exposed to Y. enterocolitica Figure 6 Y. enterocolitica Y. enterocolitica Figure 6 Y. enterocolitica 4. Discussion The emergence of antibiotic-resistant bacteria is a major challenge in the treatment of bacterial infections. One promising strategy to address this problem is to target and inactivate bacterial virulence factors—key elements that allow pathogens to infect host cells. Rather than killing the bacteria directly, this approach neutralizes their infection ability, preventing disease progression. By rendering pathogens non-pathogenic, the host’s innate immune system can naturally clear the infection. This strategy provides a viable solution for treating bacterial infections, including those caused by multidrug-resistant strains, where conventional treatments are ineffective. In this study, we investigated compounds that selectively inactivate the T3SS, using Y. enterocolitica Y. enterocolitica 12 This study showed that cinnamtannin B1, a compound identified from the ethyl acetate fraction of L. obtusiloba yopH yopO 42 Yops play a critical role in evading the host’s innate immune response. These proteins interfere with phagocytosis and disrupt host cell signaling [ 43 44 45 46 47 YopO, also known as YpkA, is an 81 kDa serine/threonine kinase with structural and functional similarities to eukaryotic serine/threonine kinases [ 48 49 50 51 Yersinia Its inhibition of the effector proteins YopH and YopO, both of which interfere with phagocytic mechanisms, suggests that cinnamtannin B1 has a protective function in preventing Y. enterocolitica This finding also highlights YopH and YopO’s critical roles in the infection of host cells. In addition, the targeted inhibition of virulence factors by cinnamtannin B1 minimizes disruption of the host’s resident microbiota, providing a targeted therapeutic strategy. By attenuating bacterial virulence without directly killing the pathogen, cinnamtannin B1 also reduces the risk of antibiotic resistance emergence, providing an alternative candidate to conventional antibiotics. Future studies will be essential to identify the molecular targets of cinnamtannin B1 responsible for the suppression of yopH yopO The potential applications of cinnamtannin B1 as an anti-virulence agent are vast. In addition to treating infections caused by Y. enterocolitica L. obtusiloba 42 yopH yopO While our data clearly demonstrate that cinnamtannin B1 reduces Yersinia The targets and biological mechanisms underpinning this selective inhibition remain unclear. Future studies addressing these aspects may lead to innovative therapeutic approaches to combating T3SS-dependent pathogens. Furthermore, as this study is primarily based on in vitro experiments, and thus, its findings need to be validated in animal models to evaluate the therapeutic potential of cinnamtannin B1 in more complex biological systems. In addition, the long-term effects on bacterial resistance development and the safety profile of the compound across various cell types need to be thoroughly investigated. While our study demonstrates the anti-virulence effects of cinnamtannin B1 in vitro, its translational feasibility in vivo remains to be determined. Like many proanthocyanidins, cinnamtannin B1 exhibits low aqueous solubility and limited oral bioavailability, which may constrain its systemic therapeutic applications. Nonetheless, our assay conditions used 0.1% DMSO to enhance solubility without observed cytotoxicity. Future studies should focus on formulation strategies, such as nanoparticle encapsulation or the use of structural analogs, to improve cinnamtannin B1’s pharmacokinetic properties. Additionally, although the MOI values used in our macrophage assays (50–100) are standard for in vitro infection models, they exceed physiological relevant exposure levels. Future studies will therefore aim to evaluate efficacy at lower MOIs and in appropriate in vivo models to more accurately determine the therapeutic potential of cinnamtannin B1 under physiologically relevant conditions. 5. Conclusions Cinnamtannin B1, a compound isolated from L. obtusiloba Y. enterocolitica Y. enterocolitica L. obtusiloba Acknowledgments All authors would like to thank Eun-Jin Park for carefully reading the entire manuscript and providing valuable comments. During the preparation of this manuscript, the author(s) used Scholar GPT 4o for the purposes of English editing. The authors have reviewed and edited the output and take full responsibility for the content of this publication. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/pharmaceutics17091217/s1 1 13 4 Lindera obtusiloba Author Contributions Conceptualization, J.-H.Y. and T.-J.K.; Methodology, J.-H.Y. and T.-J.K.; Software, J.-H.Y. and T.-J.K.; Validation, J.-H.Y. and T.-J.K.; Formal analysis, J.-H.Y. and T.-J.K.; Investigation, J.-H.Y.; Resources, T.-J.K.; Data curation, J.-H.Y. and T.-J.K.; Writing—original draft preparation, J.-H.Y.; Writing—review and editing, T.-J.K.; Visualization, J.-H.Y. and T.-J.K.; Supervision, T.-J.K.; Project administration, T.-J.K.; Funding acquisition, T.-J.K. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement The original contributions presented in this study are included in the article. Further inquiries can be directed to the corresponding author. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: ATCC American Type Culture Collection DMEM Dulbecco’s modified Eagle’s medium DMSO Dimethyl sulfoxide Fops Flagellar outer proteins GDI Guanine nucleotide dissociation inhibitor KCCM Korean Culture Center of Microorganisms MOI Multiplicity of infection MTT 3-(4,5-dimethylthiazol-2-yl)-2,5-diphenyltetrazolium bromide NMR Nuclear magnetic resonance PARP Poly (ADP-ribose) polymerase PBS Phosphate-buffered saline RT-qPCR Reverse-transcription polymerase chain reaction SDS-PAGE Sodium dodecyl sulfate-polyacrylamide gel electrophoresis SKU Stock keeping unit T3SS Type III secretion system Ysps Yersinia Yops Yersinia References 1. Ventola C. The antibiotic resistance crisis: Part 1: Causes and threats Pharm. Ther. 2015 40 277 283 PMC4378521 25859123 2. Silva L.N. Zimmer K.R. Macedo A.J. Trentin D.S. Plant natural products targeting bacterial virulence factors Chem. Rev. 2016 116 9162 9236 10.1021/acs.chemrev.6b00184 27437994 3. Clatworthy A.E. Pierson E. Hung D.T. Targeting virulence: A new paradigm for antimicrobial therapy Nat. Chem. Biol. 2007 3 541 548 10.1038/nchembio.2007.24 17710100 4. Puhar A. Sansonetti P.J. Type III secretion system Curr. Biol. 2014 24 R784 R791 10.1016/j.cub.2014.07.016 25202865 5. Beckham K.S.H. Roe A.J. From screen to target: Insights and approaches for the development of anti-virulence compounds Front. Cell. Infect. Microbiol. 2014 4 139 10.3389/fcimb.2014.00139 25325019 PMC4179734 6. Robins-Browne R.M. Yersinia enterocolitica Food Microbiology Elsevier Amsterdam, The Netherlands 2012 339 376 7. Zhou S. Wang H. Li H. Yang Y. Shi D. Yang Z. Yang D. Chen T. Li J. Jin M. Emergence of polymyxin-resistant Yersinia enterocolitica Environ. Pollut. 2025 364 125341 10.1016/j.envpol.2024.125341 39571713 8. Young G.M. Schmiel D.H. Miller V.L. A new pathway for the secretion of virulence factors by bacteria: The flagellar export apparatus functions as a protein-secretion system Proc. Natl. Acad. Sci. USA 1999 96 6456 6461 10.1073/pnas.96.11.6456 10339609 PMC26903 9. Haller J.C. Carlson S. Pederson K.J. Pierson D.E. A chromosomally encoded type III secretion pathway in Yersinia enterocolitica Mol. Microbiol. 2000 36 1436 1446 10.1046/j.1365-2958.2000.01964.x 10931293 10. Cornelis G.R. Boland A. Boyd A.P. Geuijen C. Iriarte M. Neyt C. Sory M.-P. Stainier I. The Virulence plasmid of Yersinia Microbiol. Mol. Biol. Rev. 1998 62 1315 1352 10.1128/MMBR.62.4.1315-1352.1998 9841674 PMC98948 11. Young B.M. Young G.M. Evidence for targeting of Yop effectors by the chromosomally encoded Ysa type III secretion system of Yersinia enterocolitica J. Bacteriol. 2002 184 5563 5571 10.1128/JB.184.20.5563-5571.2002 12270813 PMC139599 12. Young B.M. Young G.M. YplA is exported by the Ysc, Ysa, and flagellar type III secretion systems of Yersinia enterocolitica J. Bacteriol. 2002 184 1324 1334 10.1128/JB.184.5.1324-1334.2002 11844761 PMC134849 13. Heesemann J. Gross U. Schmidt N. Laufs R. Immunochemical analysis of plasmid-encoded proteins released by enteropathogenic Yersinia Infect. Immun. 1986 54 561 567 10.1128/iai.54.2.561-567.1986 3770952 PMC260198 14. Michiels T. Wattiau P. Brasseur R. Ruysschaert J.M. Cornelis G. Secretion of Yop proteins by Yersiniae Infect. Immun. 1990 58 2840 2849 10.1128/iai.58.9.2840-2849.1990 2129533 PMC313576 15. Matsumoto H. Young G.M. Translocated effectors of Yersinia Curr. Opin. Microbiol. 2009 12 94 100 10.1016/j.mib.2008.12.005 19185531 PMC2669664 16. Venecia K. Young G.M. Environmental regulation and virulence attributes of the Ysa type III secretion system of Yersinia enterocolitica Infect. Immun. 2005 73 5961 5977 10.1128/IAI.73.9.5961-5977.2005 16113317 PMC1231061 17. Mildiner-Earley S. Miller V.L. Walker K.A. Environmental stimuli affecting expression of the Ysa type three secretion locus The Genus Yersinia: From Genomics to Function Perry R.D. Fetherston J.D. Springer New York, NY, USA 2007 211 216 10.1007/978-0-387-72124-8_18 17966417 18. Schmiel D.H. Wagar E. Karamanou L. Weeks D. Miller V.L. Phospholipase A of Yersinia enterocolitica Infect. Immun. 1998 66 3941 3951 10.1128/IAI.66.8.3941-3951.1998 9673284 PMC108459 19. Warren S.M. Young G.M. An amino-terminal secretion signal Is required for YplA export by the Ysa, Ysc, and flagellar type III secretion systems of Yersinia enterocolitica J. Bacteriol. 2005 187 6075 6083 10.1128/JB.187.17.6075-6083.2005 16109949 PMC1196154 20. Ham Y. Kim T.-J. Inhibition of biofilm formation in Yersinia enterocolitica J. Korean Wood Sci. Technol. 2022 50 448 457 10.5658/WOOD.2022.50.6.448 21. Ham Y. Xu D. Kim T.-J. Effect of licorice extract on biofilm formation in two pathogenic bacteria: Aeromonas hydrophila Yersinia enterocolitica J. Korean Wood Sci. Technol. 2025 53 77 88 10.5658/WOOD.2025.53.1.77 22. Lee B.-W. Ha J.-H. Shin H.-G. Jeong S.-H. Kim J.-H. Lee J. Park J.-Y. Kwon H.-J. Jung K. Lee W.-S. Lindera obtusiloba Antioxidants 2020 9 563 10.3390/antiox9070563 32605045 PMC7402094 23. Lee J.-A. Gu M.J. Lee Y.R. Kim Y. Choi I. Kim D. Ha S.K. Lindera obtusiloba ε Nutrients 2024 16 2330 10.3390/nu16142330 39064772 PMC11280000 24. Lee Y.J. Lee D.K. Kim J.S. Park K.J. Cha D.S. Kim D.K. Kwon J. Oh C.H. Kim K.S. Jeon H. Sedative and antinociceptive properties of Lindera obtusiloba Nat. Prod. Sci. 2012 18 215 220 25. Haque M.E. Azam S. Balakrishnan R. Akther M. Kim I.-S. Therapeutic potential of Lindera obtusiloba Plants 2020 9 1765 10.3390/plants9121765 33322185 PMC7763160 26. Kim S.-H. Do J.-S. Chung H.-J. Antimicrobial activities of Lindera obtusiloba Zanthoxylum piperitum Korean J. Food Preserv. 2014 21 427 433 10.11002/kjfp.2014.21.3.427 27. Freise C. Ruehl M. Erben U. Neumann U. Seehofer D. Kim K.Y. Trowitzsch-Kienast W. Stroh T. Zeitz M. Somasundaram R. A hepatoprotective Lindera obtusiloba BMC Complement. Altern. Med. 2011 11 39 10.1186/1472-6882-11-39 21569410 PMC3117754 28. López J.J. Jardín I. Salido G.M. Rosado J.A. Cinnamtannin B-1 as an antioxidant and platelet aggregation inhibitor Life Sci. 2008 82 977 982 10.1016/j.lfs.2008.03.009 18433795 29. Li M. Hao L. Li L. Liu L. Chen G. Jiang W. Xu W. Zhu C. Yao G. Fang S. Cinnamtannin B-1 prevents ovariectomy-induced osteoporosis via attenuating osteoclastogenesis and ROS generation Front. Pharmacol. 2020 11 1023 10.3389/fphar.2020.01023 32754032 PMC7365944 30. Ksouri A. Klouz A. Bouhaouala-Zahar B. Moussa F. Bezzarga M. Docking-based evidence for the potential of ImmunoDefender: A novel formulated essential oil blend incorporating synergistic antiviral bioactive compounds as promising Mpro inhibitors against SARS-CoV-2 Molecules 2023 28 4296 10.3390/molecules28114296 37298772 PMC10254185 31. Carriere P.P. Kapur N. Mir H. Ward A.B. Singh S. Cinnamtannin B-1 inhibits cell survival molecules and induces apoptosis in colon cancer Int. J. Oncol. 2018 53 1442 1454 10.3892/ijo.2018.4489 30066888 PMC6086629 32. Jia J. Xia J. Liu W. Tao F. Xiao J. Cinnamtannin B-1 inhibits the progression of osteosarcoma by regulating the miR-1281/PPIF axis Biol. Pharm. Bull. 2023 46 67 73 10.1248/bpb.b22-00600 36273900 33. Kan H.-L. Wang C.-C. Cheng Y.-H. Yang C.-L. Chang H.-S. Chen I.-S. Lin Y.-C. Cinnamtannin B1 attenuates rosacea-like signs via inhibition of pro-inflammatory cytokine production and down-regulation of the MAPK pathway PeerJ 2020 8 e10548 10.7717/peerj.10548 33391878 PMC7759128 34. Oh Y. Kim T.-J. Temperature adaptive biofilm formation in Yersinia enterocolitica Antibiotics 2025 14 857 10.3390/antibiotics14090857 41009836 35. Berring E. Brancato S. Grant K. Schaper E. Kadavil S. Smagin H. Hatic S.O. Picking W. Serfis A.B. Destabilization of phospholipid model membranes by YplA, a phospholipase A2 secreted by Yersinia enterocolitica Chem. Phys. Lipids 2004 131 135 149 10.1016/j.chemphyslip.2004.04.009 15351266 36. Meysick K.C. Seidman J. Falconio J.R. The Yersinia pseudotuberculosis Yersinia enterocolitica Microb. Pathog. 2009 47 24 32 10.1016/j.micpath.2009.04.008 19397992 37. Ivanov M.I. Stuckey J.A. Schubert H.L. Saper M.A. Bliska J.B. Two substrate-targeting sites in the Yersinia Mol. Microbiol. 2005 55 1346 1356 10.1111/j.1365-2958.2005.04477.x 15720545 38. Fàbrega A. Roca I. Vila J. Fluoroquinolone and multidrug resistance phenotypes associated with the overexpression of AcrAB and an orthologue of MarA in Yersinia enterocolitica Int. J. Med. Microbiol. 2010 300 457 463 10.1016/j.ijmm.2010.02.003 20510648 39. Kamiya K. Watanabe C. Endang H. Umar M. Satake T. Studies on the constituents of bark of Parameria laevigata 1) Chem. Pharm. Bull. 2001 49 551 557 10.1248/cpb.49.551 11383605 40. Jayaprakasha G.K. Ohnishi-Kameyama M. Ono H. Yoshida M. Jaganmohan Rao L. Phenolic constituents in the fruits of Cinnamomum zeylanicum J. Agric. Food Chem. 2006 54 1672 1679 10.1021/jf052736r 16506818 41. Bancerz-Kisiel A. Lipczyńska-Ilczuk K. Evaluation of the correlation between the mRNA expression levels of ystA ymoA Y. enterocolitica Pathogens 2021 10 1136 34578168 10.3390/pathogens10091136 PMC8467024 42. Nakasone N. Higa N. Toma C. Ogura Y. Suzuki T. Yamashiro T. Epigallocatechin gallate inhibits the type III secretion system of Gram-negative enteropathogenic bacteria under model conditions FEMS Microbiol. Lett. 2017 364 fnx111 10.1093/femsle/fnx111 28651361 43. Ruckdeschel K. Deuretzbacher A. Haase R. Crosstalk of signalling processes of innate immunity with Yersinia Immunobiology 2008 213 261 269 10.1016/j.imbio.2007.11.001 18406372 44. Viboud G.I. Bliska J.B. Yersinia Annu. Rev. Microbiol. 2005 59 69 89 10.1146/annurev.micro.59.030804.121320 15847602 45. Black D.S. Marie-Cardine A. Schraven B. Bliska J.B. The Yersinia Cell. Microbiol. 2000 2 401 414 10.1046/j.1462-5822.2000.00061.x 11207596 46. Cantwell A.M. Bubeck S.S. Dube P.H. YopH inhibits early pro-inflammatory cytokine responses during plague pneumonia BMC Immunol. 2010 11 29 10.1186/1471-2172-11-29 20565713 PMC2894752 47. Matsuda R. Daniel S. Zhang J. Peterson S.T. Grayczyk J.P. Yost W. Apenes N. Kovalik M.E. Herrmann B. O’Neill R. A TNF-IL-1 circuit controls Yersinia J. Exp. Med. 2024 221 e20230679 10.1084/jem.20230679 38363547 PMC10873131 48. Lee W.L. Singaravelu P. Wee S. Xue B. Ang K.C. Gunaratne J. Grimes J.M. Swaminathan K. Robinson R.C. Mechanisms of Yersinia Sci. Rep. 2017 7 39998 10.1038/srep39998 28051168 PMC5209680 49. Pha K. Wright M.E. Barr T.M. Eigenheer R.A. Navarro L. Regulation of Yersinia J. Biol. Chem. 2014 289 26167 26177 10.1074/jbc.M114.601153 25086045 PMC4176208 50. Ke Y. Tan Y. Wei N. Yang F. Yang H. Cao S. Wang X. Wang J. Han Y. Bi Y. Yersinia Cell. Microbiol. 2015 17 473 485 10.1111/cmi.12378 25298072 51. Lee W.L. Grimes J.M. Robinson R.C. Yersinia Nat. Struct. Mol. Biol. 2015 22 248 255 10.1038/nsmb.2964 25664724 PMC4745138 Figure 1 Fractionation procedure for the L. obtusiloba Figure 2 YplA phospholipase activity of Y. enterocolitica L. obtusiloba A Y. enterocolitica Y. enterocolitica Yersinia enterocolitica L. obtusiloba B L. obtusiloba 595 Figure 3 Chemical structure of cinnamtannin B1 ( A Y. enterocolitica B Figure 4 Secreted extracellular proteins and gene expression in Y. enterocolitica A B C A B C D yopH yopO yopM yopP Y. enterocolitica gapA p p Figure 5 Morphological changes in RAW 264.7 macrophages after infection with Y. enterocolitica A B Y. enterocolitica C Y. enterocolitica D Y. enterocolitica E F Y. enterocolitica Figure 6 Composite image of the membrane from a Western blot analysis of PARP cleavage in RAW 264.7 macrophages infected with Y. enterocolitica Y. enterocolitica Y. enterocolitica Y. enterocolitica pharmaceutics-17-01217-t001_Table 1 Table 1 Primers used in this study. Target Gene Primer Direction Sequence (5′ to 3′) gapA Sense CATCCCAGAACATCATCCC Antisense GCAGTCAGGTCAACAACT  yopH Sense CTAACTCAAGAAGATACCGCTAA Antisense CTATTACCATTGCCGACACT  yopM Sense CTTCTTGACTGCGATTTATGC Antisense AACTCTGCGGTAATTCTGG  yopO Sense ATTCCAACGAAGCCAGAC Antisense GTTATCCGCCTTACATCAGT  yopP Sense GAGAGAGATAGCCTGTTGAAAA Antisense ACTTATTGTGGGGTAAAGGATTT ",
  "metadata": {
    "Title of this paper": null,
    "Journal it was published in:": "Pharmaceutics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473489/"
  }
}