{
  "title": "Paper_267",
  "abstract": "pmc FEBS Open Bio FEBS Open Bio 2013 febsopenbio FEB4 FEBS Open Bio 2211-5463 Wiley PMC12485818 PMC12485818.1 12485818 12485818 40542654 10.1002/2211-5463.70074 FEB470074 FEBSOPEN-25-0050.R1 1 Tumor Microenvironment Cancer and Oncology Extra Cellular Matrix Integrins Review Review Matrix: a complex amalgam of structures and functions in tumor microenvironment Tumor matrix: a complex molecular amalgam S. S. Skandalis et al. Skandalis Spyros S. https://orcid.org/0000-0003-1156-2896  1 skandalis@upatras.gr Tsoukala Evgenia  1 Sarantopoulou Theodora D.  1 Christopoulou Maria‐Elpida  2   1 Biochemistry, Biochemical Analysis & Matrix Pathobiology Res. Group, Laboratory of Biochemistry, Department of Chemistry University of Patras Greece   2 Department of Pneumology Medical Center‐University of Freiburg, Faculty of Medicine, University of Freiburg Germany * Correspondence skandalis@upatras.gr 21 6 2025 10 2025 15 10 498067 10.1002/feb4.v15.10 In the Limelight: Tumor‐Stroma Interactions 1552 1569 25 4 2025 31 1 2025 11 6 2025 21 06 2025 02 10 2025 02 10 2025 © 2025 The Author(s). FEBS Open Bio https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ Cancer cells surrounded by a rich diversity of nonmalignant cell types are collectively embedded in the matrix, which is a dynamic, intricate three‐dimensional mesh of biomolecules with both structural and functional properties. The matrix contains proteins, carbohydrates, and other glycoproteins that facilitate essential cellular communication and impact in various ways a broad spectrum of cellular functions, such as anchoring cells, guiding migration, and shaping signal gradients driving cell growth, apoptosis, survival, and differentiation. This review deals with the complexity of this amalgam of structures and functions and highlights the importance of the tumor microenvironment in the maintenance and evolution of tumors by describing certain bioactive macromolecules of the matrix, such as proteoglycans, hyaluronan, collagens, elastin, matricellular proteins as well as their cellular receptors like integrins and CD44. The matrix is a dynamic, intricate three‐dimensional mesh of biomolecules with both structural and functional properties. This review deals with the complexity of this ‘molecular amalgam’ in the tumor microenvironment and highlights its importance in the maintenance and evolution of tumors by describing certain matrix biomolecules, such as proteoglycans, hyaluronan, collagens, elastin, matricellular proteins as well as specific matrix receptors. CD44 hyaluronan integrins matrix proteoglycans tumor pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:01.10.2025 Edited by Isabel Fabregat Abbreviations ABC ATP‐binding cassette CAFs cancer‐associated fibroblasts CD44 cluster of differentiation 44 CD44s CD44 standard isoform CD44v CD44 variant isoforms CS chondroitin sulfate CSCs cancer stem cells CSPGs chondroitin sulfate‐containing proteoglycans DS dermatan sulfate DSPGs dermatan sulfate‐containing proteoglycans EBP elastin‐binding protein ECM extracellular matrix EDPs elastin‐derived peptides EMT epithelial‐to‐mesenchymal transition ERM ezrin‐radixin‐moesin GAG glycosaminoglycan HAS hyaluronan synthase Hep heparin HMW high molecular weight HS heparan sulfate HYAL hyaluronidase KS keratan sulfate LMW low molecular weight LOX lysyl oxidase LRRs leucine‐rich repeats MCPs matricellular proteins MDR multidrug resistance MMP matrix metalloproteinase NCAM neural cell adhesion molecule OPN osteopontin RGD arginine‐glycine‐aspartate RONS reactive oxygen or nitrogen species RTKs receptor tyrosine kinases SDC1 syndecan‐1 SLRPs small leucine‐rich proteoglycans SPARC secreted protein acidic and rich in cysteine SRGN serglycin TME tumor microenvironment TSP thrombospondin VCAN versican Tumor microenvironment (TME) is a highly structured ecosystem that contains tumor cells surrounded by a rich diversity of noncancerous cell types including cancer‐associated fibroblasts (CAFs), endothelial cells, immune cells, pericytes as well as tissue‐specific cells such as adipocytes and neurons [ 1 1 2 3 4 Fig. 1 Structures, interactions, and functions of matrix biomolecules in the tumor microenvironment. (A) serglycin, (B) syndecan‐1, (C) perlecan, (D) decorin, (E) versican, (F) hyaluronan‐CD44, (G) WISP1. Please consult the manuscript for additional details. Image generated using BioRender. Proteoglycans Proteoglycans are hybrid molecules that consist of a core protein onto which one or more glycosaminoglycan (GAG) chains are covalently linked while they are synthesized in the Golgi apparatus. These GAGs are negatively charged heteropolysaccharides containing repeating disaccharides of N‐acetylated hexosamines and hexuronic acid epimers forming chondroitin sulfate (CS), dermatan sulfate (DS), heparan sulfate (HS), heparin (Hep), and keratan sulfate (KS), which contains D‐galactose instead of hexuronic acid. Iozzo and Schaefer (2015) proposed a simplified and comprehensive classification of the various proteoglycan gene families and their products based on their cellular/subcellular topology, their gene/protein homology, and their specific core protein structural motifs [ 5 4 5 Intracellular/secretory proteoglycans—Serglycin Serglycin (SRGN) is an intracellular proteoglycan composed of a short core protein with eight Ser‐Gly residue repeats, where GAG chains are attached. The type and the sulfation pattern of these GAG chains (CS, DS, HS) vary depending on the cell type [ 6 1A 7 8 9 Increased SRGN expression has been observed in aggressive tumor cells, including glioblastoma [ 10 11 12 13 14 8 15 16 17 18 12 19 16 20 10 21 21 Cell surface proteoglycans This class contains seven transmembrane proteoglycans (syndecans 1–4, CSPG4/NG2, betaglycan/TGF‐β type III receptor, phosphacan/receptor‐type protein tyrosine phosphatase β) and six GPI‐anchored glypicans (glypicans 1–6) [ 5 Syndecan‐1 Syndecan‐1 (SDC1) is the first studied member of the syndecan family of transmembrane HSPGs. Its structure is defined by an extracellular region that carries HS and CS chains, a single transmembrane domain and a well‐conserved cytoplasmic domain (Fig. 1B 22 23 24 25 26 27 28 29 26 Apart from being located on the cell surface, SDC1 exists also in a soluble form (s‐SDC1) (Fig. 1B 23 24 30 31 30 32 33 The role of SDC1 is altered during tumorigenesis in different cancer types. In breast cancer, increased expression of SDC1 on the cell surface was associated with reduced overall survival in ER‐ cells, while higher levels of stromal SDC1 indicate poor survival prognosis for patients with ER+ cancer. In lung cancer cells, high SDC1 expression was linked to a prediction of invasiveness but favorable survival after surgery, whereas elevated soluble SDC1 indicated poor clinical outcome. On the other hand, decreased epithelial expression of SDC1 showed tumor aggressiveness in head and neck cancer cells [ 24 30 Pericellular and basement membrane zone proteoglycans Pericellular proteoglycans include perlecan, agrin, and collagens XVIII/XV [ 5 Perlecan Perlecan is a HSPG that is a key component of basement membranes. It is expressed in both vascular and avascular tissues, participating in crucial biological processes and it consists of five distinct domains (Fig. 1C 5 34 34 35 36 37 38 39 40 41 42 In contrast, the C‐terminal fragment of perlecan (domain V), known as endorepellin, is released from the endothelial basement membrane via MMPs and has angiostatic and antitumorigenic effects (Fig. 1C 43 44 45 46 47 48 49 Extracellular proteoglycans Extracellular proteoglycans include the following: four hyalectans (aggrecan, versican brevican, and neurocan), an acronym for hyaluronan‐ and lectin‐binding proteoglycans that form supramolecular complexes of high viscosity and act as molecular bridges between cell surfaces and ECM; eighteen small leucine‐rich proteoglycans (SLRPs) that are characterized by a relatively small core protein with a central region constituted by leucine‐rich repeats (LRRs) grouped into five classes (I‐V) (decorin, biglycan, lumican, fibromodulin, PRELP, and others); and the testican/SPOCK family of proteoglycans that comprise three members [ 5 Decorin Decorin, the prototype member of the SLRP family, is expressed in most tissues mainly in stromal and endothelial cells. It consists of a central curved domain rich in leucine residues responsible for the interaction with collagen, flanked by terminal sequences rich in Cys and attached with one N‐terminal GAG chain (CS or DS) (Fig. 1D 5 50 51 52 Τhe presence of decorin in tumor stroma impedes the tumorigenic process [ 52 53 54 55 56 1D 57 58 59 60 waf 51 58 2+ 61 62 63 64 65 in vivo 56 Versican Versican (VCAN) is a large CS/DSPG that belongs to the hyalectans [ 5 66 67 1E 68 69 70 71 72 73 74 75 68 75 76 77 78 79 80 75 81 66 Hyaluronan Although it has almost been a century since the first official report of hyaluronan in 1934 by Karl Meyer and John W. Palmer, there is still an emerging ongoing survey on the profound comprehension of the role that hyaluronan polysaccharide poses in both physiological and pathological events, primarily focusing on cancer progression (Fig. 1F 82 83 84 85 86 87 88 89 The equilibrium between the synthesis and the breakdown of hyaluronan by the coordinated actions of HASes and its degrading enzymes (mainly HYAL1, HYAL2, PH‐20, KIAA1199, and TMEM2) may be the key to understanding how normal functions turn into malignant ones based on the interactions that hyaluronan has with different molecules of the matrix and specifically the diverse behavior of the amount and size of hyaluronan molecules [ 82 84 90 91 92 93 94 95 96 97 98 99 100 101 102 103 86 104 105 106 107 3 108 109 91 106 110 111 112 113 102 114 115 116 117 118 119 120 113 113 121 122 123 124 125 116 126 Collagens and elastin Collagens and elastin are essential structural components of the ECM, providing mechanical support and elasticity to tissues [ 127 128 129 130 127 131 3 132 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150 151 Matricellular proteins Matricellular proteins (MCPs) are a group of nonstructural ECM molecules that play key roles in regulating cellular behavior, particularly in the context of cancer and the tumor microenvironment [ 152 153 154 Key matricellular proteins—thrombospondins (TSP1, TSP2), SPARC (secreted protein acidic and rich in cysteine), osteonectin, and tenascins—modulate critical processes in cancer and the TME. Among these, thrombospondins and SPARC have garnered particular attention for their dual roles in tumor suppression and progression. For instance, TSP2 binds MMP2 to suppress tumor growth and angiogenesis but also enhances the migratory potential in osteosarcoma by upregulating MMP9 expression [ 155 156 157 158 159 160 Other notable families of MCPs include CCNs, fasciclin, galectins, R‐spondins (RSPOs), fibulins, SIBLINGs, and olfactomedins [ 161 162 Within the CCN family, WISP1 (CCN4) has emerged as a particularly intriguing protein due to its critical involvement in tumor biology and Wnt‐1‐induced signaling pathways [ 163 1G 164 165 166 167 168 169 170 164 171 172 Overall, the diverse functions of MCPs within the tumor microenvironment highlight their critical role in regulating cancer progression and metastasis; however, WISP1's unique contributions—such as its role in collagen linearization, immune modulation, and angiogenesis—underscore its potential as a novel therapeutic target. Matrix receptors Cells transduce extracellular signals into intracellular responses through their transmembrane receptors. Among these receptors are integrins, syndecans, discoidin domain receptors, and cluster of differentiation 44 or CD44, which are the main matrix receptors. CD44 CD44 operates as a receptor for various matrix molecules including OPN, collagen, fibronectin, laminin, growth factors, cytokines, MMPs, SRGN and, primarily, hyaluronan (Fig. 1F 173 3 174 175 176 177 178 179 180 181 182 183 184 185 186 187 188 189 190 85 191 192 193 Integrins Integrins are heterodimeric transmembrane receptors that mediate cell–cell and cell–matrix adhesion. Different combinations of 18 α‐subunits with 8 β‐subunits result in the formation of at least 24 heterodimeric integrins that have varying affinities to extracellular ligands and are clustered into arginine‐glycine‐aspartate (RGD)‐binding integrins, collagen‐binding integrins, laminin‐binding integrins, and leukocyte‐specific integrins. Integrins can carry out both outside‐in and inside‐out signaling pathways thus regulating cell polarity, survival, cytoskeleton rearrangement as well as cell adhesion and migration [ 3 194 194 195 196 197 198 199 Conclusive remarks Matrix influences essential processes such as stem cell niche formation, branching morphogenesis, angiogenesis, bone remodeling, and wound healing, as well as pathological conditions like tissue fibrosis and cancer. There is a growing number of examples showing that individual matrix components can significantly affect disease phenotypes [ 200 201 202 203 Conflict of interest There is no conflict of interest. Author contributions SSS conceived and designed the study; SSS, MEC, ET, and TDS wrote the paper. References 1 de Visser KE Joyce JA 2023 The evolving tumor microenvironment: from cancer initiation to metastatic outgrowth Cancer Cell 41 374 403 36917948 10.1016/j.ccell.2023.02.016 2 Winkler J Abisoye‐Ogunniyan A Metcalf KJ Werb Z 2020 Concepts of extracellular matrix remodelling in tumour progression and metastasis Nat Commun 11 5120 33037194 10.1038/s41467-020-18794-x PMC7547708 3 Karamanos NK Theocharis AD Piperigkou Z Manou D Passi A Skandalis SS Vynios DH Orian‐Rousseau V Ricard‐Blum S Schmelzer CEH et al 2021 A guide to the composition and functions of the extracellular matrix FEBS J 288 6850 6912 33605520 10.1111/febs.15776 4 Theocharis AD Skandalis SS Gialeli C Karamanos NK 2016 Extracellular matrix structure Adv Drug Deliv Rev 97 4 27 26562801 10.1016/j.addr.2015.11.001 5 Iozzo RV Schaefer L 2015 Proteoglycan form and function: a comprehensive nomenclature of proteoglycans Matrix Biol 42 11 55 25701227 10.1016/j.matbio.2015.02.003 PMC4859157 6 Kolset SO Pejler G 2011 Serglycin: a structural and functional chameleon with wide impact on immune cells J Immunol 187 4927 4933 22049227 10.4049/jimmunol.1100806 7 Korpetinou A Skandalis SS Labropoulou VT Smirlaki G Noulas A Karamanos NK Theocharis AD 2014 Serglycin: at the crossroad of inflammation and malignancy Front Oncol 3 327 24455486 10.3389/fonc.2013.00327 PMC3888995 8 Lv B Gao G Guo Y Zhang Z Liu R Dai Z Ju C Liang Y Tang X Tang M et al 2021 Serglycin promotes proliferation, migration, and invasion via the JAK/STAT signaling pathway in osteosarcoma Aging 13 21142 21154 34493692 10.18632/aging.203392 PMC8457593 9 Manou D Karamanos NK Theocharis AD 2020 Tumorigenic functions of serglycin: regulatory roles in epithelial to mesenchymal transition and oncogenic signaling Semin Cancer Biol 62 108 115 31279836 10.1016/j.semcancer.2019.07.004 10 Manou D Golfinopoulou MA Alharbi SND Alghamdi HA Alzahrani FM Theocharis AD 2024 The expression of Serglycin is required for active transforming growth factor beta receptor I tumorigenic signaling in glioblastoma cells and paracrine activation of stromal fibroblasts via CXCR‐2 Biomolecules 14 461 38672477 10.3390/biom14040461 PMC11048235 11 Hosoya K Nosaka K Sakabe T Wakahara M Oshima Y Suzuki Y Nakamura H Umekita Y 2022 Clinical significance of Serglycin expression in human breast cancer patients Anticancer Res 42 279 285 34969735 10.21873/anticanres.15483 12 Chu Q Huang H Huang T Cao L Peng L Shi S Zheng L Xu L Zhang S Huang J et al 2016 Extracellular serglycin upregulates the CD44 receptor in an autocrine manner to maintain self‐renewal in nasopharyngeal carcinoma cells by reciprocally activating the MAPK/beta‐catenin axis Cell Death Dis 7 e2456 27809309 10.1038/cddis.2016.287 PMC5260886 13 Purushothaman A Toole BP 2014 Serglycin proteoglycan is required for multiple myeloma cell adhesion, in vivo growth, and vascularization J Biol Chem 289 5499 5509 24403068 10.1074/jbc.M113.532143 PMC3937626 14 Tanaka I Dayde D Tai MC Mori H Solis LM Tripathi SC Fahrmann JF Unver N Parhy G Jain R et al 2022 SRGN‐triggered aggressive and immunosuppressive phenotype in a subset of TTF‐1‐negative lung adenocarcinomas J Natl Cancer Inst 114 290 301 34524427 10.1093/jnci/djab183 PMC8826620 15 Purushothaman A Bandari SK Chandrashekar DS Jones RJ Lee HC Weber DM Orlowski RZ 2017 Chondroitin sulfate proteoglycan serglycin influences protein cargo loading and functions of tumor‐derived exosomes Oncotarget 8 73723 73732 29088739 10.18632/oncotarget.20564 PMC5650294 16 He Y Cheng D Lian C Liu Y Luo W Wang Y Ma C Wu Q Tian P He D et al 2021 Serglycin induces osteoclastogenesis and promotes tumor growth in giant cell tumor of bone Cell Death Dis 12 868 34556636 10.1038/s41419-021-04161-1 PMC8460728 17 Skliris A Happonen KE Terpos E Labropoulou V Borset M Heinegard D Blom AM Theocharis AD 2011 Serglycin inhibits the classical and lectin pathways of complement via its glycosaminoglycan chains: implications for multiple myeloma Eur J Immunol 41 437 449 21268013 10.1002/eji.201040429 18 Skliris A Labropoulou VT Papachristou DJ Aletras A Karamanos NK Theocharis AD 2013 Cell‐surface serglycin promotes adhesion of myeloma cells to collagen type I and affects the expression of matrix metalloproteinases FEBS J 280 2342 2352 23387827 10.1111/febs.12179 19 Cao L Luo FF Huang HB Huang TJ Hu H Zheng LS Wang J Peng LX Qian CN Huang BJ 2021 The autoregulatory serglycin/CD44 axis drives stemness‐like phenotypes in TNBC in a beta‐catenin‐dependent manner Clin Transl Med 11 e311 33634997 10.1002/ctm2.311 PMC7851355 20 Li X Xie G Chen J Wang Y Zhai J Shen L 2024 Tumour cell‐derived serglycin promotes IL‐8 secretion of CAFs in gastric cancer Br J Cancer 131 271 282 38862740 10.1038/s41416-024-02735-2 PMC11263384 21 Tellez‐Gabriel M Tekpli X Reine TM Hegge B Nielsen SR Chen M Moi L Normann LS Busund LR Calin GA et al 2022 Serglycin is involved in TGF‐beta induced epithelial‐mesenchymal transition and is highly expressed by immune cells in breast cancer tissue Front Oncol 12 868868 35494005 10.3389/fonc.2022.868868 PMC9047906 22 Bernfield M Gotte M Park PW Reizes O Fitzgerald ML Lincecum J Zako M 1999 Functions of cell surface heparan sulfate proteoglycans Annu Rev Biochem 68 729 777 10872465 10.1146/annurev.biochem.68.1.729 23 Yang Z Chen S Ying H Yao W 2022 Targeting syndecan‐1: new opportunities in cancer therapy Am J Physiol Cell Physiol 323 C29 C45 35584326 10.1152/ajpcell.00024.2022 PMC9236862 24 Szatmari T Otvos R Hjerpe A Dobra K 2015 Syndecan‐1 in cancer: implications for cell signaling, differentiation, and prognostication Dis Markers 2015 796052 26420915 10.1155/2015/796052 PMC4569789 25 Czarnowski D 2021 Syndecans in cancer: a review of function, expression, prognostic value, and therapeutic significance Cancer Treat Res Commun 27 100312 33485180 10.1016/j.ctarc.2021.100312 26 Gopal S Arokiasamy S Pataki C Whiteford JR Couchman JR 2021 Syndecan receptors: pericellular regulators in development and inflammatory disease Open Biol 11 200377 33561383 10.1098/rsob.200377 PMC8061687 27 Pham SH Pratt K Okolicsanyi RK Oikari LE Yu C Peall IW Arif KT Chalmers TA Gyimesi M Griffiths LR et al 2022 Syndecan‐1 and ‐4 influence Wnt signaling and cell migration in human breast cancers Biochimie 198 60 75 35183674 10.1016/j.biochi.2022.01.014 28 Beauvais DM Rapraeger AC 2010 Syndecan‐1 couples the insulin‐like growth factor‐1 receptor to inside‐out integrin activation J Cell Sci 123 3796 3807 20971705 10.1242/jcs.067645 PMC2964108 29 Beauvais DM Jung O Yang Y Sanderson RD Rapraeger AC 2016 Syndecan‐1 (CD138) suppresses apoptosis in multiple myeloma by activating IGF1 receptor: prevention by SynstatinIGF1R inhibits tumor growth Cancer Res 76 4981 4993 27364558 10.1158/0008-5472.CAN-16-0232 PMC5010496 30 Nadanaka S Bai Y Kitagawa H 2021 Cleavage of Syndecan‐1 promotes the proliferation of the basal‐like breast cancer cell line BT‐549 via Akt SUMOylation Front Cell Dev Biol 9 659428 34113616 10.3389/fcell.2021.659428 PMC8185021 31 Purushothaman A Uyama T Kobayashi F Yamada S Sugahara K Rapraeger AC Sanderson RD 2010 Heparanase‐enhanced shedding of syndecan‐1 by myeloma cells promotes endothelial invasion and angiogenesis Blood 115 2449 2457 20097882 10.1182/blood-2009-07-234757 PMC2845901 32 Stewart MD Ramani VC Sanderson RD 2015 Shed syndecan‐1 translocates to the nucleus of cells delivering growth factors and inhibiting histone acetylation: a novel mechanism of tumor‐host cross‐talk J Biol Chem 290 941 949 25404732 10.1074/jbc.M114.608455 PMC4294521 33 Stewart MD Sanderson RD 2014 Heparan sulfate in the nucleus and its control of cellular functions Matrix Biol 35 56 59 24309018 10.1016/j.matbio.2013.10.009 PMC4364407 34 Melrose J 2020 Perlecan, a modular instructive proteoglycan with diverse functional properties Int J Biochem Cell Biol 128 105849 32947020 10.1016/j.biocel.2020.105849 35 Elgundi Z Papanicolaou M Major G Cox TR Melrose J Whitelock JM Farrugia BL 2019 Cancer metastasis: the role of the extracellular matrix and the Heparan sulfate proteoglycan Perlecan Front Oncol 9 1482 32010611 10.3389/fonc.2019.01482 PMC6978720 36 Jansson M Billing O Herdenberg C Lundin C Tolockiene E Nazemroaya A Sund M 2020 Expression and circulating levels of Perlecan in breast cancer – implications for Oestrogen dependent stromal remodeling J Mammary Gland Biol Neoplasia 25 69 77 32124140 10.1007/s10911-020-09447-2 37 Samarzija I Lukiyanchuk V Loncaric M Rac‐Justament A Stojanovic N Gorodetska I Kahya U Humphries JD Fatima M Humphries MJ et al 2024 The extracellular matrix component perlecan/HSPG2 regulates radioresistance in prostate cancer cells Front Cell Dev Biol 12 1452463 39149513 10.3389/fcell.2024.1452463 PMC11325029 38 Iozzo RV Cohen I 1994 Altered proteoglycan gene expression and the tumor stroma Experientia 70 199 214 10.1007/978-3-0348-7545-5_12 8298247 39 Hasegawa M Cheng J Maruyama S Yamazaki M Abe T Babkair H Saito C Saku T 2016 Differential immunohistochemical expression profiles of perlecan‐binding growth factors in epithelial dysplasia, carcinoma in situ, and squamous cell carcinoma of the oral mucosa Pathol Res Pract 212 426 436 26965914 10.1016/j.prp.2016.02.016 40 Furini S Falciani C 2021 Expression and role of Heparan sulfated proteoglycans in pancreatic cancer Front Oncol 11 695858 34249755 10.3389/fonc.2021.695858 PMC8267412 41 Hayes AJ Farrugia BL Biose IJ Bix GJ Melrose J 2022 Perlecan, a multi‐functional, cell‐instructive, matrix‐stabilizing proteoglycan with roles in tissue development has relevance to connective tissue repair and regeneration Front Cell Dev Biol 10 856261 35433700 10.3389/fcell.2022.856261 PMC9010944 42 Amer Ismail SI Helmy ET Abdel Aziz AM Shibel PEE 2023 Immunohistochemical evaluation of Perlecan (Heparan Sulphate proteoglycan 2) expression in invasive female breast carcinoma Asian Pac J Cancer Prev 24 4277 4283 38156864 10.31557/APJCP.2023.24.12.4277 PMC10909087 43 Mead TJ Bhutada S Martin DR Apte SS 2022 Proteolysis: a key post‐translational modification regulating proteoglycans Am J Physiol Cell Physiol 323 C651 C665 35785985 10.1152/ajpcell.00215.2022 PMC9448339 44 Mongiat M Pascal G Poletto E Williams DM Iozzo RV 2024 Proteoglycans of basement membranes: crucial controllers of angiogenesis, neurogenesis, and autophagy Proteoglycan Res 2 e22 39184370 10.1002/pgr2.22 PMC11340296 45 Gubbiotti MA Buraschi S Kapoor A Iozzo RV 2020 Proteoglycan signaling in tumor angiogenesis and endothelial cell autophagy Semin Cancer Biol 62 1 8 31078640 10.1016/j.semcancer.2019.05.003 PMC7864242 46 Kapoor A Chen CG Iozzo RV 2020 Endorepellin evokes an angiostatic stress signaling cascade in endothelial cells J Biol Chem 295 6344 6356 32205445 10.1074/jbc.RA120.012525 PMC7212646 47 Neill T Andreuzzi E Wang ZX Peiper SC Mongiat M Iozzo RV 2018 Endorepellin remodels the endothelial transcriptome toward a pro‐autophagic and pro‐mitophagic gene signature J Biol Chem 293 12137 12148 29921586 10.1074/jbc.RA118.002934 PMC6078466 48 Chen CG Kapoor A Xie C Moss A Vadigepalli R Ricard‐Blum S Iozzo RV 2023 Conditional expression of endorepellin in the tumor vasculature attenuates breast cancer growth, angiogenesis and hyaluronan deposition Matrix Biol 118 92 109 36907428 10.1016/j.matbio.2023.03.005 PMC10259220 49 Chen CG Gubbiotti MA Kapoor A Han X Yu Y Linhardt RJ Iozzo RV 2020 Autophagic degradation of HAS2 in endothelial cells: a novel mechanism to regulate angiogenesis Matrix Biol 90 1 19 32084457 10.1016/j.matbio.2020.02.001 50 Jia X Chen L Yu C 2024 Decorin suppresses stemness and migration potential of malignant peripheral nerve sheath tumor through inhibiting epidermal growth factor receptor signaling Biochim Biophys Acta Mol Basis Dis 1870 167181 38653361 10.1016/j.bbadis.2024.167181 51 Diehl V Huber LS Trebicka J Wygrecka M Iozzo RV Schaefer L 2021 The role of Decorin and Biglycan signaling in tumorigenesis Front Oncol 11 801801 34917515 10.3389/fonc.2021.801801 PMC8668865 52 Mondal DK Xie C Pascal GJ Buraschi S Iozzo RV 2024 Decorin suppresses tumor lymphangiogenesis: a mechanism to curtail cancer progression Proc Natl Acad Sci USA 121 e2317760121 38652741 10.1073/pnas.2317760121 PMC11067011 53 Karamanos NK Theocharis AD Neill T Iozzo RV 2019 Matrix modeling and remodeling: a biological interplay regulating tissue homeostasis and diseases Matrix Biol 75‐76 1 11 10.1016/j.matbio.2018.08.007 PMC6377817 30130584 54 Ferdous Z Peterson SB Tseng H Anderson DK Iozzo RV Grande‐Allen KJ 2009 A role for decorin in controlling proliferation, adhesion, and migration of murine embryonic fibroblasts J Biomed Mater Res 93A 419 428 10.1002/jbm.a.32545 PMC4396830 19569212 55 Cui J Zhang S Acharya K Xu Y Guo H Li T Fu D Yang Z Hou L Xing X et al 2024 Decorin attenuates hypertrophic scar fibrosis via TGFbeta/Smad signalling Exp Dermatol 33 e15133 39045898 10.1111/exd.15133 56 Baghy K Reszegi A Tatrai P Kovalszky I 2020 Decorin in the tumor microenvironment Tumor Microenvironment: Extracellular Matrix Components–Part B 17 38 Springer 10.1007/978-3-030-48457-6_2 32845500 57 Xie C Mondal DK Ulas M Neill T Iozzo RV 2022 Oncosuppressive roles of decorin through regulation of multiple receptors and diverse signaling pathways Am J Physiol Cell Physiol 322 C554 C566 35171698 10.1152/ajpcell.00016.2022 PMC8917911 58 Hu X Villodre ES Larson R Rahal OM Wang X Gong Y Song J Krishnamurthy S Ueno NT Tripathy D et al 2021 Decorin‐mediated suppression of tumorigenesis, invasion, and metastasis in inflammatory breast cancer Commun Biol 4 72 33452400 10.1038/s42003-020-01590-0 PMC7811004 59 Aljagthmi WA Alasmari MA Daghestani MH Al‐Kharashi LA Al‐Mohanna FH Aboussekhra A 2024 Decorin (DCN) downregulation activates breast stromal fibroblasts and promotes their pro‐carcinogenic effects through the IL‐6/STAT3/AUF1 signaling Cells 13 680 38667295 10.3390/cells13080680 PMC11049637 60 Patel S Santra M McQuillan DJ Iozzo RV Thomas AP 1998 Decorin activates the epidermal growth factor receptor and elevates cytosolic Ca 2+ J Biol Chem 273 3121 3124 9452417 10.1074/jbc.273.6.3121 61 Zhu JX Goldoni S Bix G Owens RT McQuillan DJ Reed CC Iozzo RV 2005 Decorin evokes protracted internalization and degradation of the epidermal growth factor receptor via caveolar endocytosis J Biol Chem 280 32468 32479 15994311 10.1074/jbc.M503833200 62 Xie C Schaefer L Iozzo RV 2023 Global impact of proteoglycan science on human diseases iScience 26 108095 37867945 10.1016/j.isci.2023.108095 PMC10589900 63 Neill T Xie C Iozzo RV 2022 Decorin evokes reversible mitochondrial depolarization in carcinoma and vascular endothelial cells Am J Physiol Cell Physiol 323 C1355 C1373 36036446 10.1152/ajpcell.00325.2022 PMC9602711 64 Neill T Iozzo RV 2022 The role of Decorin proteoglycan in Mitophagy Cancers 14 804 35159071 10.3390/cancers14030804 PMC8834502 65 Goldoni S Humphries A Nyström A Sattar S Owens RT McQuillan DJ Ireton K Iozzo RV 2009 Decorin is a novel antagonistic ligand of the met receptor J Cell Biol 185 743 754 19433454 10.1083/jcb.200901129 PMC2711571 66 Papadas A Cicala A Kraus SG Arauz G Deming D Asimakopoulos F 2022 Versican in tumor progression, tumor–host interactions, and cancer immunotherapy The Extracellular Matrix and the Tumor Microenvironment 93 118 67 Zimmermann DR Ruoslahti E 1989 Multiple domains of the large fibroblast proteoglycan, versican EMBO J 8 2975 2981 2583089 10.1002/j.1460-2075.1989.tb08447.x PMC401368 68 Hirani P Gauthier V Allen CE Wight TN Pearce OMT 2021 Targeting Versican as a potential immunotherapeutic strategy in the treatment of cancer Front Oncol 11 712807 34527586 10.3389/fonc.2021.712807 PMC8435723 69 Du WW Fang L Yang X Sheng W Yang BL Seth A Zhang Y Yang BB Yee AJ 2013 The role of versican in modulating breast cancer cell self‐renewal Mol Cancer Res 11 443 455 23449934 10.1158/1541-7786.MCR-12-0461 70 Tauriello DVF Palomo‐Ponce S Stork D Berenguer‐Llergo A Badia‐Ramentol J Iglesias M Sevillano M Ibiza S Canellas A Hernando‐Momblona X et al 2018 TGFbeta drives immune evasion in genetically reconstituted colon cancer metastasis Nature 554 538 543 29443964 10.1038/nature25492 71 Tang F Brune JE Chang MY Reeves SR Altemeier WA Frevert CW 2022 Defining the versican interactome in lung health and disease Am J Physiol Cell Physiol 323 C249 C276 35649251 10.1152/ajpcell.00162.2022 PMC9291419 72 Kato K Fukai M Hatanaka KC Takasawa A Aoyama T Hayasaka T Matsuno Y Kamiyama T Hatanaka Y Taketomi A 2022 Versican secreted by cancer‐associated fibroblasts is a poor prognostic factor in hepatocellular carcinoma Annals of Surgical Oncology 29 7135 7146 35543908 10.1245/s10434-022-11862-0 73 Song J Wei R Huo S Liu C Liu X 2022 Versican enrichment predicts poor prognosis and response to adjuvant therapy and immunotherapy in gastric cancer Front Immunol 13 960570 36203562 10.3389/fimmu.2022.960570 PMC9530562 74 Shibahara K Nishida H Kusaba T Etoh T Amano S Daa T 2024 Immunohistochemical staining of versican as a potential marker for predicting lymph node metastasis in gastric cancer Pathol Res Pract 253 155055 38176310 10.1016/j.prp.2023.155055 75 Papadas A Arauz G Cicala A Wiesner J Asimakopoulos F 2020 Versican and Versican‐matrikines in cancer progression, inflammation, and immunity J Histochem Cytochem 68 871 885 32623942 10.1369/0022155420937098 PMC7711242 76 Wight TN Kang I Evanko SP Harten IA Chang MY Pearce OMT Allen CE Frevert CW 2020 Versican‐a critical extracellular matrix regulator of immunity and inflammation Front Immunol 11 512 32265939 10.3389/fimmu.2020.00512 PMC7105702 77 Ping Q Wang C Cheng X Zhong Y Yan R Yang M Shi Y Li X Li X Huang W et al 2023 TGF‐beta1 dominates stromal fibroblast‐mediated EMT via the FAP/VCAN axis in bladder cancer cells J Transl Med 21 475 37461061 10.1186/s12967-023-04303-3 PMC10351189 78 Zhang Y Zou X Qian W Weng X Zhang L Zhang L Wang S Cao X Ma L Wei G et al 2019 Enhanced PAPSS2/VCAN sulfation axis is essential for Snail‐mediated breast cancer cell migration and metastasis Cell Death Differ 26 565 579 29955124 10.1038/s41418-018-0147-y PMC6370781 79 Oktem G Sercan O Guven U Uslu R Uysal A Goksel G Ayla S Bilir A 2014 Cancer stem cell differentiation: TGFbeta1 and versican may trigger molecules for the organization of tumor spheroids Oncol Rep 32 641 649 24927163 10.3892/or.2014.3252 80 Sheng W Wang G La Pierre DP Wen J Deng Z Wong CK Lee DY Yang BB 2006 Versican mediates mesenchymal‐epithelial transition Mol Biol Cell 17 2009 2020 16452631 10.1091/mbc.E05-10-0951 PMC1415306 81 Papadas A Asimakopoulos F 2020 Versican in the tumor microenvironment Advances in Experimental Medicine and Biology 55 72 Springer 10.1007/978-3-030-48457-6_4 32845502 82 Garantziotis S Savani RC 2019 Hyaluronan biology: a complex balancing act of structure, function, location and context Matrix Biol 78‐79 1 10 10.1016/j.matbio.2019.02.002 PMC6774756 30802498 83 Heldin P Karousou E Bernert B Porsch H Nishitsuka K Skandalis SS 2008 Importance of hyaluronan‐CD44 interactions in inflammation and tumorigenesis Connect Tissue Res 49 215 218 18661346 10.1080/03008200802143323 84 Heldin P Lin CY Kolliopoulos C Chen YH Skandalis SS 2019 Regulation of hyaluronan biosynthesis and clinical impact of excessive hyaluronan production Matrix Biol 78‐79 100 117 10.1016/j.matbio.2018.01.017 29374576 85 Skandalis SS Karalis TT Chatzopoulos A Karamanos NK 2019 Hyaluronan‐CD44 axis orchestrates cancer stem cell functions Cell Signal 63 109377 31362044 10.1016/j.cellsig.2019.109377 86 Karousou E Parnigoni A Moretto P Passi A Viola M Vigetti D 2023 Hyaluronan in the cancer cells microenvironment Cancers 15 798 36765756 10.3390/cancers15030798 PMC9913668 87 Kobayashi T Chanmee T Itano N 2020 Hyaluronan: metabolism and function Biomolecules 10 1525 33171800 10.3390/biom10111525 PMC7695009 88 Ricard‐Blum S Vives RR Schaefer L Gotte M Merline R Passi A Heldin P Magalhaes A Reis CA Skandalis SS et al 2024 A biological guide to glycosaminoglycans: current perspectives and pending questions FEBS J 291 3331 3366 38500384 10.1111/febs.17107 89 Skandalis SS Karalis T Heldin P 2020 Intracellular hyaluronan: importance for cellular functions Semin Cancer Biol 62 20 30 31276783 10.1016/j.semcancer.2019.07.002 90 Cyphert JM Trempus CS Garantziotis S 2015 Size matters: molecular weight specificity of Hyaluronan effects in cell biology Int J Cell Biol 2015 563818 26448754 10.1155/2015/563818 PMC4581549 91 Rosales P Vitale D Icardi A Sevic I Alaniz L 2024 Role of hyaluronic acid and its chemical derivatives in immunity during homeostasis, cancer and tissue regeneration Semin Immunopathol 46 15 39240397 10.1007/s00281-024-01024-7 92 Karamanos NK Piperigkou Z Theocharis AD Watanabe H Franchi M Baud S Brezillon S Gotte M Passi A Vigetti D et al 2018 Proteoglycan chemical diversity drives multifunctional cell regulation and therapeutics Chem Rev 118 9152 9232 30204432 10.1021/acs.chemrev.8b00354 93 Jiang D Liang J Noble PW 2011 Hyaluronan as an immune regulator in human diseases Physiol Rev 91 221 264 21248167 10.1152/physrev.00052.2009 PMC3051404 94 Camenisch TD Spicer AP Brehm‐Gibson T Biesterfeldt J Augustine ML Calabro A Jr Kubalak S Klewer SE McDonald JA 2000 Disruption of hyaluronan synthase‐2 abrogates normal cardiac morphogenesis and hyaluronan‐mediated transformation of epithelium to mesenchyme J Clin Invest 106 349 360 10930438 10.1172/JCI10272 PMC314332 95 Munjal A Hannezo E Tsai TY Mitchison TJ Megason SG 2021 Extracellular hyaluronate pressure shaped by cellular tethers drives tissue morphogenesis Cell 184 6313 6325 34942099 10.1016/j.cell.2021.11.025 PMC8722442 96 Yoshida H Nagaoka A Komiya A Aoki M Nakamura S Morikawa T Ohtsuki R Sayo T Okada Y Takahashi Y 2018 Reduction of hyaluronan and increased expression of HYBID (alias CEMIP and KIAA1199) correlate with clinical symptoms in photoaged skin Br J Dermatol 179 136 144 29330857 10.1111/bjd.16335 97 Papakonstantinou E Roth M Karakiulakis G 2012 Hyaluronic acid: a key molecule in skin aging Dermatoendocrinol 4 253 258 23467280 10.4161/derm.21923 PMC3583886 98 Zoller M 2015 CD44, Hyaluronan, the hematopoietic stem cell, and leukemia‐initiating cells Front Immunol 6 235 26074915 10.3389/fimmu.2015.00235 PMC4443741 99 Lee‐Sayer SS Dong Y Arif AA Olsson M Brown KL Johnson P 2015 The where, when, how, and why of hyaluronan binding by immune cells Front Immunol 6 150 25926830 10.3389/fimmu.2015.00150 PMC4396519 100 Josefsson A Adamo H Hammarsten P Granfors T Stattin P Egevad L Laurent AE Wikstrom P Bergh A 2011 Prostate cancer increases hyaluronan in surrounding nonmalignant stroma, and this response is associated with tumor growth and an unfavorable outcome Am J Pathol 179 1961 1968 21854754 10.1016/j.ajpath.2011.06.005 PMC3181394 101 Schwertfeger KL Cowman MK Telmer PG Turley EA McCarthy JB 2015 Hyaluronan, inflammation, and breast cancer progression Front Immunol 6 236 26106384 10.3389/fimmu.2015.00236 PMC4459097 102 Amorim S Soares da Costa D Mereiter S Pashkuleva I Reis CA Reis RL Pires RA 2021 Multilayer platform to model the bioactivity of hyaluronic acid in gastric cancer Mater Sci Eng C Mater Biol Appl 119 111616 33321659 10.1016/j.msec.2020.111616 103 Tavianatou AG Caon I Franchi M Piperigkou Z Galesso D Karamanos NK 2019 Hyaluronan: molecular size‐dependent signaling and biological functions in inflammation and cancer FEBS J 286 2883 2908 30724463 10.1111/febs.14777 104 Parnigoni A Moretto P Viola M Karousou E Passi A Vigetti D 2023 Effects of Hyaluronan on breast cancer aggressiveness Cancers 15 3813 37568628 10.3390/cancers15153813 PMC10417239 105 Spinelli FM Vitale DL Sevic I Alaniz L 2020 Hyaluronan in the tumor microenvironment Adv Exp Med Biol 1245 67 83 32266653 10.1007/978-3-030-40146-7_3 106 Donelan W Dominguez‐Gutierrez PR Kusmartsev S 2022 Deregulated hyaluronan metabolism in the tumor microenvironment drives cancer inflammation and tumor‐associated immune suppression Front Immunol 13 971278 36238286 10.3389/fimmu.2022.971278 PMC9550864 107 Asplund T Versnel MA Laurent TC Heldin P 1993 Human mesothelioma cells produce factors that stimulate the production of hyaluronan by mesothelial cells and fibroblasts Cancer Res 53 388 392 8417831 108 Caon I Parnigoni A Viola M Karousou E Passi A Vigetti D 2020 Cell energy metabolism and Hyaluronan synthesis J Histochem Cytochem 69 22155420929772 10.1369/0022155420929772 PMC7780193 32623953 109 Marozzi M Parnigoni A Negri A Viola M Vigetti D Passi A Karousou E Rizzi F 2021 Inflammation, extracellular matrix remodeling, and Proteostasis in tumor microenvironment Int J Mol Sci 22 8102 34360868 10.3390/ijms22158102 PMC8346982 110 Takasugi M Firsanov D Tombline G Ning H Ablaeva J Seluanov A Gorbunova V 2020 Naked mole‐rat very‐high‐molecular‐mass hyaluronan exhibits superior cytoprotective properties Nat Commun 11 2376 32398747 10.1038/s41467-020-16050-w PMC7217962 111 Tian X Azpurua J Hine C Vaidya A Myakishev‐Rempel M Ablaeva J Mao Z Nevo E Gorbunova V Seluanov A 2013 High‐molecular‐mass hyaluronan mediates the cancer resistance of the naked mole rat Nature 499 346 349 23783513 10.1038/nature12234 PMC3720720 112 Price ZK Lokman NA Ricciardelli C 2018 Differing roles of Hyaluronan molecular weight on cancer cell behavior and chemotherapy resistance Cancers 10 482 30513961 10.3390/cancers10120482 PMC6316154 113 Vitale DL Parnigoni A Viola M Karousou E Sevic I Moretto P Passi A Alaniz L Vigetti D 2024 Deciphering drug resistance: investigating the emerging role of Hyaluronan metabolism and signaling and tumor extracellular matrix in cancer chemotherapy Int J Mol Sci 25 7607 39062846 10.3390/ijms25147607 PMC11276752 114 Liu Y Li L Wang L Lu L Li Y Huang G Song J 2023 ‘Two‐faces’ of hyaluronan, a dynamic barometer of disease progression in tumor microenvironment Discov Oncol 14 11 36698043 10.1007/s12672-023-00618-1 PMC9877274 115 Spinelli FM Vitale DL Icardi A Caon I Brandone A Giannoni P Saturno V Passi A Garcia M Sevic I et al 2019 Hyaluronan preconditioning of monocytes/macrophages affects their angiogenic behavior and regulation of TSG‐6 expression in a tumor type‐specific manner FEBS J 286 3433 3449 31044513 10.1111/febs.14871 116 Spinelli FM Rosales P Pluda S Vitale DL Icardi A Guarise C Reszegi A Kovalszky I Garcia M Sevic I et al 2022 The effects of sulfated hyaluronan in breast, lung and colorectal carcinoma and monocytes/macrophages cells: its role in angiogenesis and tumor progression IUBMB Life 74 927 942 35218610 10.1002/iub.2604 117 Huang L Wang Y Liu H Huang J 2018 Local injection of high‐molecular hyaluronan promotes wound healing in old rats by increasing angiogenesis Oncotarget 9 8241 8252 29492191 10.18632/oncotarget.23246 PMC5823590 118 Carvalho AM Reis RL Pashkuleva I 2023 Hyaluronan receptors as mediators and modulators of the tumor microenvironment Adv Healthc Mater 12 e2202118 36373221 10.1002/adhm.202202118 PMC11469756 119 Porsch H Bernert B Mehic M Theocharis AD Heldin CH Heldin P 2013 Efficient TGFbeta‐induced epithelial‐mesenchymal transition depends on hyaluronan synthase HAS2 Oncogene 32 4355 4365 23108409 10.1038/onc.2012.475 PMC3778714 120 Kolliopoulos C Lin CY Heldin CH Moustakas A Heldin P 2019 Has2 natural antisense RNA and Hmga2 promote Has2 expression during TGFbeta‐induced EMT in breast cancer Matrix Biol 80 29 45 30194979 10.1016/j.matbio.2018.09.002 121 Ricciardelli C Ween MP Lokman NA Tan IA Pyragius CE Oehler MK 2013 Chemotherapy‐induced hyaluronan production: a novel chemoresistance mechanism in ovarian cancer BMC Cancer 13 476 24124770 10.1186/1471-2407-13-476 PMC3852938 122 Provenzano PP Hingorani SR 2013 Hyaluronan, fluid pressure, and stromal resistance in pancreas cancer Br J Cancer 108 1 8 23299539 10.1038/bjc.2012.569 PMC3553539 123 Karalis TT Heldin P Vynios DH Neill T Buraschi S Iozzo RV Karamanos NK Skandalis SS 2019 Tumor‐suppressive functions of 4‐MU on breast cancer cells of different ER status: regulation of hyaluronan/HAS2/CD44 and specific matrix effectors Matrix Biol 78‐79 118 138 10.1016/j.matbio.2018.04.007 29673760 124 Karalis TT Chatzopoulos A Kondyli A Aletras AJ Karamanos NK Heldin P Skandalis SS 2020 Salicylate suppresses the oncogenic hyaluronan network in metastatic breast cancer cells Matrix Biol Plus 6‐7 100031 10.1016/j.mbplus.2020.100031 PMC7852211 33543028 125 Karalis T Shiau AK Gahman TC Skandalis SS Heldin CH Heldin P 2022 Identification of a small molecule inhibitor of Hyaluronan synthesis, DDIT, targeting breast cancer cells Cancers 14 5800 36497283 10.3390/cancers14235800 PMC9741431 126 Koutsakis C Tavianatou AG Kokoretsis D Baroutas G Karamanos NK 2021 Sulfated Hyaluronan modulates the functional properties and matrix effectors expression of breast cancer cells with different estrogen receptor status Biomolecules 11 1916 34944559 10.3390/biom11121916 PMC8699821 127 Frantz C Stewart KM Weaver VM 2010 The extracellular matrix at a glance J Cell Sci 123 4195 4200 21123617 10.1242/jcs.023820 PMC2995612 128 Rozario T DeSimone DW 2010 The extracellular matrix in development and morphogenesis: a dynamic view Dev Biol 341 126 140 19854168 10.1016/j.ydbio.2009.10.026 PMC2854274 129 Ricard‐Blum S 2011 The collagen family Cold Spring Harb Perspect Biol 3 a004978 21421911 10.1101/cshperspect.a004978 PMC3003457 130 Gordon MK Hahn RA 2010 Collagens Cell Tissue Res 339 247 257 19693541 10.1007/s00441-009-0844-4 PMC2997103 131 Sun B 2021 The mechanics of fibrillar collagen extracellular matrix Cell Rep Phys Sci 2 100515 34485951 10.1016/j.xcrp.2021.100515 PMC8415638 132 Heinz A 2021 Elastic fibers during aging and disease Ageing Res Rev 66 101255 33434682 10.1016/j.arr.2021.101255 133 Schmelzer CEH Duca L 2022 Elastic fibers: formation, function, and fate during aging and disease FEBS J 289 3704 3730 33896108 10.1111/febs.15899 134 Lockhart‐Cairns MP Newandee H Thomson J Weiss AS Baldock C Tarakanova A 2020 Transglutaminase‐mediated cross‐linking of Tropoelastin to Fibrillin Stabilises the elastin precursor prior to elastic fibre assembly J Mol Biol 432 5736 5751 32898582 10.1016/j.jmb.2020.08.023 PMC7610145 135 Schmelzer CEH Hedtke T Heinz A 2020 Unique molecular networks: formation and role of elastin cross‐links IUBMB Life 72 842 854 31834666 10.1002/iub.2213 136 Schmelzer CEH Heinz A Troilo H Lockhart‐Cairns MP Jowitt TA Marchand MF Bidault L Bignon M Hedtke T Barret A et al 2019 Lysyl oxidase‐like 2 (LOXL2)‐mediated cross‐linking of tropoelastin FASEB J 33 5468 5481 30676771 10.1096/fj.201801860RR PMC6629125 137 Huang J Zhang L Wan D Zhou L Zheng S Lin S Qiao Y 2021 Extracellular matrix and its therapeutic potential for cancer treatment Signal Transduct Target Ther 6 153 33888679 10.1038/s41392-021-00544-0 PMC8062524 138 Belhabib I Zaghdoudi S Lac C Bousquet C Jean C 2021 Extracellular matrices and cancer‐associated fibroblasts: targets for cancer diagnosis and therapy? Cancers 13 3466 34298680 10.3390/cancers13143466 PMC8303391 139 Heino J 2014 Cellular signaling by collagen‐binding integrins Adv Exp Med Biol 819 143 155 25023173 10.1007/978-94-017-9153-3_10 140 Levental KR Yu H Kass L Lakins JN Egeblad M Erler JT Fong SFT Csiszar K Giaccia A Weninger W et al 2009 Matrix crosslinking forces tumor progression by enhancing integrin signaling Cell 139 891 906 19931152 10.1016/j.cell.2009.10.027 PMC2788004 141 Deng Y Chakraborty P Jolly MK Levine H 2021 A theoretical approach to coupling the epithelial‐mesenchymal transition (EMT) to extracellular matrix (ECM) stiffness via LOXL2 Cancers 13 1609 33807227 10.3390/cancers13071609 PMC8037024 142 Fujisaki H Futaki S 2022 Epithelial‐mesenchymal transition induced in cancer cells by adhesion to type I collagen Int J Mol Sci 24 198 36613638 10.3390/ijms24010198 PMC9820580 143 Ricard‐Blum S Salza R 2014 Matricryptins and matrikines: biologically active fragments of the extracellular matrix Exp Dermatol 23 457 463 24815015 10.1111/exd.12435 144 Brassart‐Pasco S Brézillon S Brassart B Ramont L Oudart JB Monboisse JC 2020 Tumor microenvironment: extracellular matrix alterations influence tumor progression Front Oncol 10 397 32351878 10.3389/fonc.2020.00397 PMC7174611 145 Wang Y Song EC Resnick MB 2020 Elastin in the tumor microenvironment Adv Exp Med Biol 1272 1 16 32845499 10.1007/978-3-030-48457-6_1 146 Sellami M Meghraoui‐Kheddar A Terryn C Fichel C Bouland N Diebold MD Guenounou M Héry‐Huynh S Le Naour R 2016 Induction and regulation of murine emphysema by elastin peptides Am J Physiol Lung Cell Mol Physiol 310 L8 L23 26519205 10.1152/ajplung.00068.2015 147 Szychowski KA Skóra B 2024 Elastin‐derived peptides (EDPs) as a potential pro‐malignancy factor in human leukemia cell lines Immunol Res 72 1092 1107 38967692 10.1007/s12026-024-09511-7 PMC11564322 148 Heinz A Jung MC Duca L Sippl W Taddese S Ihling C Rusciani A Jahreis G Weiss AS Neubert RH et al 2010 Degradation of tropoelastin by matrix metalloproteinases – cleavage site specificities and release of matrikines FEBS J 277 1939 1956 20345904 10.1111/j.1742-4658.2010.07616.x 149 Maquart FX Pasco S Ramont L Hornebeck W Monboisse JC 2004 An introduction to matrikines: extracellular matrix‐derived peptides which regulate cell activity. Implication in tumor invasion Crit Rev Oncol Hematol 49 199 202 15036260 10.1016/j.critrevonc.2003.06.007 150 Maurice P Blaise S Gayral S Debelle L Laffargue M Hornebeck W Duca L 2013 Elastin fragmentation and atherosclerosis progression: the elastokine concept Trends Cardiovasc Med 23 211 221 23561795 10.1016/j.tcm.2012.12.004 151 Antonicelli F Bellon G Debelle L Hornebeck W 2007 Elastin‐elastases and inflamm‐aging Curr Top Dev Biol 79 99 155 17498549 10.1016/S0070-2153(06)79005-6 152 Vincent KM Postovit LM 2018 Matricellular proteins in cancer: a focus on secreted frizzled‐related proteins J Cell Commun Signal 12 103 112 28589318 10.1007/s12079-017-0398-2 PMC5842174 153 Bornstein P Sage EH 2002 Matricellular proteins: extracellular modulators of cell function Curr Opin Cell Biol 14 608 616 12231357 10.1016/s0955-0674(02)00361-7 154 Wong GS Rustgi AK 2013 Matricellular proteins: priming the tumour microenvironment for cancer development and metastasis Br J Cancer 108 755 761 23322204 10.1038/bjc.2012.592 PMC3590656 155 Krady MM Zeng J Yu J MacLauchlan S Skokos EA Tian W Bornstein P Sessa WC Kyriakides TR 2008 Thrombospondin‐2 modulates extracellular matrix remodeling during physiological angiogenesis Am J Pathol 173 879 891 18688033 10.2353/ajpath.2008.080128 PMC2527070 156 Liu JF Chen PC Chang TM Hou CH 2020 Thrombospondin‐2 stimulates MMP‐9 production and promotes osteosarcoma metastasis via the PLC, PKC, c‐Src and NF‐kappaB activation J Cell Mol Med 24 12826 12839 33021341 10.1111/jcmm.15874 PMC7686970 157 López‐Moncada F Torres MJ Lavanderos B Cerda O Castellón EA Contreras HR 2022 SPARC induces E‐cadherin repression and enhances cell migration through integrin αvβ3 and the transcription factor ZEB1 in prostate cancer cells Int J Mol Sci 23 5874 35682554 10.3390/ijms23115874 PMC9180154 158 Rentz TJ Poobalarahi F Bornstein P Sage EH Bradshaw AD 2007 SPARC regulates processing of procollagen I and collagen fibrillogenesis in dermal fibroblasts J Biol Chem 282 22062 22071 17522057 10.1074/jbc.M700167200 159 Sun Z Schwenzer A Rupp T Murdamoothoo D Vegliante R Lefebvre O Klein A Hussenet T Orend G 2018 Tenascin‐C promotes tumor cell migration and metastasis through integrin α9β1‐mediated YAP inhibition Cancer Res 78 950 961 29259017 10.1158/0008-5472.CAN-17-1597 PMC5901716 160 Eun K Kim AY Ryu S 2024 Matricellular proteins in immunometabolism and tissue homeostasis BMB Rep 57 400 416 38919018 10.5483/BMBRep.2023-0156 PMC11444987 161 Raja E Clarin MTRDC Yanagisawa H 2023 Matricellular proteins in the homeostasis, regeneration, and aging of skin Int J Mol Sci 24 14274 37762584 10.3390/ijms241814274 PMC10531864 162 Perbal B 2013 CCN proteins: a centralized communication network J Cell Commun Signal 7 169 177 23420091 10.1007/s12079-013-0193-7 PMC3709049 163 Deng W Fernandez A McLaughlin SL Klinke DJ 2nd 2019 WNT1‐inducible signaling pathway protein 1 (WISP1/CCN4) stimulates melanoma invasion and metastasis by promoting the epithelial‐mesenchymal transition J Biol Chem 294 5261 5280 30723155 10.1074/jbc.RA118.006122 PMC6462510 164 Christopoulou M‐E Aletras AJ Papakonstantinou E Stolz D Skandalis SS 2024 WISP1 and macrophage migration inhibitory factor in respiratory inflammation: novel insights and therapeutic potentials for asthma and COPD Int J Mol Sci 25 10049 39337534 10.3390/ijms251810049 PMC11432718 165 Desnoyers L Arnott D Pennica D 2001 WISP‐1 binds to decorin and biglycan J Biol Chem 276 47599 47607 11598131 10.1074/jbc.M108339200 166 Singh K Oladipupo SS 2024 An overview of CCN4 (WISP1) role in human diseases J Transl Med 22 601 38937782 10.1186/s12967-024-05364-8 PMC11212430 167 Jia H Janjanam J Wu SC Wang R Pano G Celestine M Martinot O Breeze‐Jones H Clayton G Garcin C et al 2019 The tumor cell‐secreted matricellular protein WISP1 drives pro‐metastatic collagen linearization EMBO J 38 e101302 31294477 10.15252/embj.2018101302 PMC6694215 168 Kim HJ Yang K Kim K Lee YJ Lee S Ahn SY Ahn YH Kang JL 2022 Reprogramming of cancer‐associated fibroblasts by apoptotic cancer cells inhibits lung metastasis via Notch1‐WISP‐1 signaling Cell Mol Immunol 19 1373 1391 36241874 10.1038/s41423-022-00930-w PMC9708692 169 Chang AC Lien MY Tsai MH Hua CH Tang CH 2019 WISP‐1 promotes epithelial‐mesenchymal transition in Oral squamous cell carcinoma cells via the miR‐153‐3p/Snail Axis Cancers 11 1903 31795469 10.3390/cancers11121903 PMC6966565 170 Tsai HC Tzeng HE Huang CY Huang YL Tsai CH Wang SW Wang PC Chang AC Fong YC Tang CH 2017 WISP‐1 positively regulates angiogenesis by controlling VEGF‐A expression in human osteosarcoma Cell Death Dis 8 e2750 28406476 10.1038/cddis.2016.421 PMC5477571 171 Tsui KH Liu C‐L Yeh H‐L Liu M‐K Li C‐H Chen W‐H Jiang K‐C Li H‐R Thuy Dung PV Hsiao M et al 2024 WNT1‐inducible signaling pathway protein 1 activation through C‐X‐C motif chemokine ligand 5/C‐X‐C chemokine receptor type 2/leukemia inhibitory factor/leukemia inhibitory factor receptor signaling promotes immunosuppression and neuroendocrine differentiation in prostate cancer iScience 27 110562 39175775 10.1016/j.isci.2024.110562 PMC11338985 172 Liu Y Song Y Ye M Hu X Wang ZP Zhu X 2019 The emerging role of WISP proteins in tumorigenesis and cancer therapy J Transl Med 17 28 30651114 10.1186/s12967-019-1769-7 PMC6335850 173 Heldin P Kolliopoulos C Lin CY Heldin CH 2020 Involvement of hyaluronan and CD44 in cancer and viral infections Cell Signal 65 109427 31654718 10.1016/j.cellsig.2019.109427 174 Screaton GR Bell MV Jackson DG Cornelis FB Gerth U Bell JI 1992 Genomic structure of DNA encoding the lymphocyte homing receptor CD44 reveals at least 12 alternatively spliced exons Proc Natl Acad Sci U S A 89 12160 12164 1465456 10.1073/pnas.89.24.12160 PMC50718 175 Hassn Mesrati M Syafruddin SE Mohtar MA Syahir A 2021 CD44: a multifunctional mediator of cancer progression Biomolecules 11 1850 34944493 10.3390/biom11121850 PMC8699317 176 Liu X Taftaf R Kawaguchi M Chang YF Chen W Entenberg D Zhang Y Gerratana L Huang S Patel DB et al 2019 Homophilic CD44 interactions mediate tumor cell aggregation and polyclonal metastasis in patient‐derived breast cancer models Cancer Discov 9 96 113 30361447 10.1158/2159-8290.CD-18-0065 PMC6328322 177 Li W Qian L Lin J Huang G Hao N Wei X Wang W Liang J 2017 CD44 regulates prostate cancer proliferation, invasion and migration via PDK1 and PFKFB4 Oncotarget 8 65143 65151 29029419 10.18632/oncotarget.17821 PMC5630319 178 Misra S Heldin P Hascall VC Karamanos NK Skandalis SS Markwald RR Ghatak S 2011 Hyaluronan‐CD44 interactions as potential targets for cancer therapy FEBS J 278 1429 1443 21362138 10.1111/j.1742-4658.2011.08071.x PMC3166356 179 Wang Z Tang Y Xie L Huang A Xue C Gu Z Wang K Zong S 2019 The prognostic and clinical value of CD44 in colorectal cancer: a meta‐analysis Front Oncol 9 309 31114754 10.3389/fonc.2019.00309 PMC6503057 180 Gzil A Zarebska I Bursiewicz W Antosik P Grzanka D Szylberg L 2019 Markers of pancreatic cancer stem cells and their clinical and therapeutic implications Mol Biol Rep 46 6629 6645 31486978 10.1007/s11033-019-05058-1 181 Wolf KJ Shukla P Springer K Lee S Coombes JD Choy CJ Kenny SJ Xu K Kumar S 2020 A mode of cell adhesion and migration facilitated by CD44‐dependent microtentacles Proc Natl Acad Sci U S A 117 11432 11443 32381732 10.1073/pnas.1914294117 PMC7261014 182 Hassn Mesrati M Behrooz AB Syahir A 2020 Understanding glioblastoma biomarkers: knocking a mountain with a hammer Cells 9 1236 32429463 10.3390/cells9051236 PMC7291262 183 Zhang H Brown RL Wei Y Zhao P Liu S Liu X Deng Y Hu X Zhang J Gao XD et al 2019 CD44 splice isoform switching determines breast cancer stem cell state Genes Dev 33 166 179 30692202 10.1101/gad.319889.118 PMC6362815 184 Brown RL Reinke LM Damerow MS Perez D Chodosh LA Yang J Cheng C 2011 CD44 splice isoform switching in human and mouse epithelium is essential for epithelial‐mesenchymal transition and breast cancer progression J Clin Invest 121 1064 1074 21393860 10.1172/JCI44540 PMC3049398 185 Zhao P Xu Y Wei Y Qiu Q Chew TL Kang Y Cheng C 2016 The CD44s splice isoform is a central mediator for invadopodia activity J Cell Sci 129 1355 1365 26869223 10.1242/jcs.171959 PMC6518308 186 Lin CY Basu K Ruusala A Kozlova I Li YS Skandalis SS Heldin CH Heldin P 2023 Hyaluronan‐induced CD44‐iASPP interaction affects fibroblast migration and survival Cancers 15 1082 36831425 10.3390/cancers15041082 PMC9954134 187 Skandalis SS Kozlova I Engstrom U Hellman U Heldin P 2010 Proteomic identification of CD44 interacting proteins IUBMB Life 62 833 840 21117172 10.1002/iub.392 188 Kozlova I Ruusala A Voytyuk O Skandalis SS Heldin P 2012 IQGAP1 regulates hyaluronan‐mediated fibroblast motility and proliferation Cell Signal 24 1856 1862 22634185 10.1016/j.cellsig.2012.05.013 189 Bourguignon LYW 2019 Matrix Hyaluronan‐CD44 interaction activates MicroRNA and LncRNA signaling associated with Chemoresistance, invasion, and tumor progression Front Oncol 9 492 31293964 10.3389/fonc.2019.00492 PMC6598393 190 Skandalis SS 2023 CD44 intracellular domain: a long tale of a short tail Cancers 15 5041 37894408 10.3390/cancers15205041 PMC10605500 191 Karousou E Misra S Ghatak S Dobra K Gotte M Vigetti D Passi A Karamanos NK Skandalis SS 2017 Roles and targeting of the HAS/hyaluronan/CD44 molecular system in cancer Matrix Biol 59 3 22 27746219 10.1016/j.matbio.2016.10.001 192 Morath I Hartmann TN Orian‐Rousseau V 2016 CD44: more than a mere stem cell marker Int J Biochem Cell Biol 81 166 173 27640754 10.1016/j.biocel.2016.09.009 193 Sonnentag SJ Ibrahim NSM Orian‐Rousseau V 2024 CD44: a stemness driver, regulator, and marker‐all in one? Stem Cells 42 1031 1039 39364735 10.1093/stmcls/sxae060 194 Hamidi H Ivaska J 2018 Every step of the way: integrins in cancer progression and metastasis Nat Rev Cancer 18 533 548 30002479 10.1038/s41568-018-0038-z PMC6629548 195 Chastney MR Kaivola J Leppanen VM Ivaska J 2024 The role and regulation of integrins in cell migration and invasion Nat Rev Mol Cell Biol 26 147 167 39349749 10.1038/s41580-024-00777-1 196 Hoshino A Costa‐Silva B Shen TL Rodrigues G Hashimoto A Tesic Mark M Molina H Kohsaka S Di Giannatale A Ceder S et al 2015 Tumour exosome integrins determine organotropic metastasis Nature 527 329 335 26524530 10.1038/nature15756 PMC4788391 197 Barbazan J Alonso‐Alconada L Elkhatib N Geraldo S Gurchenkov V Glentis A van Niel G Palmulli R Fernandez B Viano P et al 2017 Liver metastasis is facilitated by the adherence of circulating tumor cells to vascular fibronectin deposits Cancer Res 77 3431 3441 28536280 10.1158/0008-5472.CAN-16-1917 198 Shibue T Weinberg RA 2009 Integrin beta1‐focal adhesion kinase signaling directs the proliferation of metastatic cancer cells disseminated in the lungs Proc Natl Acad Sci USA 106 10290 10295 19502425 10.1073/pnas.0904227106 PMC2700942 199 Shen YQ Sun L Wang SM Zheng XY Xu R 2024 Exosomal integrins in tumor progression, treatment and clinical prediction (review) Int J Oncol 65 118 39540373 10.3892/ijo.2024.5706 PMC11575930 200 Iozzo RV Theocharis AD Neill T Karamanos NK 2020 Complexity of matrix phenotypes Matrix Biol Plus 6‐7 100038 10.1016/j.mbplus.2020.100038 PMC7852209 33543032 201 Seki T Saida Y Kishimoto S Lee J Otowa Y Yamamoto K Chandramouli GV Devasahayam N Mitchell JB Krishna MC et al 2022 PEGPH20, a PEGylated human hyaluronidase, induces radiosensitization by reoxygenation in pancreatic cancer xenografts. A molecular imaging study Neoplasia 30 100793 35523073 10.1016/j.neo.2022.100793 PMC9079680 202 Reardon DA Cheresh D 2011 Cilengitide: a prototypic integrin inhibitor for the treatment of glioblastoma and other malignancies Genes Cancer 2 1159 1165 22866207 10.1177/1947601912450586 PMC3411133 203 Tsiros D Sheehy CE Nugent MA 2021 Heparin–Avastin complexes show enhanced VEGF binding and inhibition of VEGF‐mediated cell migration Int J Translat Medicine 1 101 115 ",
  "metadata": {
    "Title of this paper": "Heparin–Avastin complexes show enhanced VEGF binding and inhibition of VEGF‐mediated cell migration",
    "Journal it was published in:": "FEBS Open Bio",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485818/"
  }
}