{
  "title": "Paper_292",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12485164 PMC12485164.1 12485164 12485164 41027955 10.1038/s41598-025-00424-5 424 1 Article Role of Notch Sharma Abhay Kumar 1 2 Nimisha Nimisha 2 Kumar Arun 3 Apurva Apurva 2 Kumar Abhishek 1 Ahmad Ejaj 2 Ali Asgar 4 Prasad Birendra bprasad.pu@gmail.com 1 Saluja Sundeep Singh sundeepsaluja@yahoo.co.in 2 5 1 https://ror.org/04ysp6769 grid.412457.1 0000 0001 1276 6626 Department of Botany/Biotechnology, Patna University Patna, 2 3 https://ror.org/02n9z0v62 grid.444644.2 0000 0004 1805 0217 Department of Biotechnology, Amity University Noida, 4 https://ror.org/02dwcqs71 grid.413618.9 0000 0004 1767 6103 Department of Biochemistry, All India Institute of Medical Sciences Patna, 5 30 9 2025 2025 15 478255 33782 28 7 2024 28 4 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ The incidence of colorectal cancer (CRC) is increasing across the world, especially in younger age groups and the Indian subcontinent. Dysregulation in Notch pathway genes and their Single Nucleotide Polymorphism (SNPs) can potentially lead to aberrant signaling and contribute to CRC development. We investigated SNPs of Notch1 Notch2 Notch3 Notch4 Notch1 p p Notch3 p Notch3 p Notch3 p p Notch4 p p Notch Notch3, Notch3 Notch4 Keywords Colorectal cancer Single nucleotide polymorphism Notch PCR–RFLP Western bloting Survival Subject terms Cancer Molecular biology pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Colorectal cancer (CRC) is among the most common gastrointestinal malignancy, with a high rate of cancer-related death globally. The incidence of CRC was estimated to be 9.6% of all new cases diagnosed while 9.3% of all deaths related to cancer reported worldwide; hence, it has ranked 3 rd nd 1 2 Epidemiological studies suggest that alcohol intake, smoking, high consumption of red and processed meat, and genetic variations are associated with an increased risk of developing CRC 3 4 5 6 7 8 9 The Notch signalling pathway is an important signal transduction pathway involving cancer stem cells 10 11 12 . 13 Notch 14 Notch 15 The SNPs in key genes of the Notch pathway can affect the signalling of this pathway, resulting in the development of cancer. The genetic variations in Notch have been linked to the development and progression of different solid tumors, including breast cancer, liver, CRC, lung, and glioma 16 22 19 22 Notch1 Notch2 Notch3 Notch4 Material and methods Patient population and sample collection A total of 103 patients with histo-pathologically confirmed CRC and an equal number of age and sex-matched healthy controls unrelated to cases were enrolled in the study. Patients who had received neoadjuvant treatment before the sample collection or those who had dual malignancies, as well as those with age < 18yrs were exclude. Tumor and normal tissue from CRC cases were obtained either at colonoscopy or at the time of surgery. Tissue samples were collected in a nuclease-free collection tube containing 1X phosphate buffer saline (pH-7.4) and stored at -80 °C. Whole blood (2 ml) was collected in Ethylene diamine tetra acetic acid (EDTA) containing vacutainers from CRC patients and healthy volunteers. Informed consent was taken from all participants. Clinical and pathological details were recorded. The clinical tumor stage was classified according to the American Journal of Cancer Classification (AJCC). DNA extraction Genomic DNA was extracted from tumor and normal tissue collected from CRC patients and whole blood of healthy control using the Wizard Genomic DNA purification kit (Promega; A1125) as per manufacturer’s instruction, with minor modifications. The purity of isolated DNA was checked by taking absorbance at 260/280 nm on NanoDrop one spectrophotometer (Thermo Fischer, New York), and quantification was done by Qubit 4 fluorometer (Invitrogen, USA) using dsDNA BR Assay Kits (Invitrogen; Q32850 Whole exome sequencing Whole-exome libraries were prepared using the Twist EF 2.0 kit following the standard Twist target enrichment protocol (Twist Bioscience, South San Francisco, CA). DNA fragmentation, end-repaired, and dA-tailed was achieved using the enzymes and buffers provided in the kit. Paired-end adaptors were ligated, and libraries were purified and amplified with UDI primers. Further genomic libraries were pooled and hybridized with Twist oligo probe at 70 °C for 15–16 h. Hybridized targets were captured using streptavidin beads and amplified using PCR. Finally, libraries were purified and quantified with 1 × dsDNA HS Qubit, and size-validated using an Agilent Bioanalyzer High Sensitivity DNA kit. Sequencing was performed on an Illumina NextSeq 2000 platform with 2 × 151 bp reads. FASTQ files were generated using Illumina DRAGEN BCL Convert 4.2.7. To identify common SNPs from our in-house sequencing data (n = 14), raw sequencing reads were quality-checked using FastQC. Trimmomatic was used for adapter trimming and low-quality read filtering. The cleaned reads were then aligned to the human reference genome (GRCh38) using BWA-MEM, and duplicate reads were marked. Variant calling was conducted using GATK HaplotypeCaller, generating a VCF file of potential SNPs. The resulting variants are filtered based on quality metrics and annotated using dbSNP. Polymerase chain reaction-restriction fragment length polymorphism (PCR–RFLP) In the present study, Notch receptor genes ( Notch 1–4 Notch Notch1, Notch2, Notch3, Notch4 https://www.ncbi.nlm.nih.gov/snp/?term= Notch1 Notch2 Notch3 Notch4 2 Taq Notch1, 2, 3 Sanger sequencing The PCR amplicons of Notch1 Notch3, Notch4 https://blast.ncbi.nlm.nih.gov/Blast.cgi?PROGRAM=lastnandPAGE_TYPE=lastSearchandBLAST_SPEC=ndLINK_LOC=blasttabandLAST_PAGE=blastx https://blast.ncbi.nlm.nih.gov/Blast.cgi?PROGRAM=blastxandPAGE_TYPE=BlastSearchandLINK_LOC=blasthome Western blot Protein was extracted using tissue protein extraction reagent (T-PER, Thermo Scientific, cat-78510) following the manufacturer’s instructions. The concentration of protein was measured using a Pierce BCA protein assay kit (Thermo Scientific; 23,225). The estimated protein of 25 µg was separated on 12% sodium dodecyl sulfate–polyacrylamide gel electrophoresis (SDS-PAGE) and then electrophoretically transferred on nitrocellulose membranes. The membranes were saturated in 5%blocking buffer (non-fat dried milk) for 1 h at room temperature, membranes were washed with 1X TBST and then membrane were incubated with primary antibody of Notch1 (CST; #3608) Notch2 (CST; #5732) Notch3 (Abcam; ab23426) and Notch4 (Abcam; ab184742) overnight at 4°Ct. The β-actin (Affinity; #AF7018) was used as an internal control. After incubation, membranes were washed with 1X TBST, followed by incubation with HRP-linked secondary antibody (CST; #7074) for 1 h at room temperature. Again, after washing with 1X TBST, the protein bands were detected using Pierce ECL Plus reagent (Thermo Fisher Scientific, USA) and visualized under Chemi doc (Bio-Rad Laboratories Inc.). Survival analysis The follow-up of patients was done every three months in 1st year and then every six months till the date of survival analysis, either through telephonic conversation or a hospital OPD visit. The Kaplan–Meier log-rank test was used to calculate the mean survival time and assess the effect of Notch polymorphism on survival. Statistical analysis The genotype and allele frequency for all SNPs and test for deviation from Hardy Weinberg Equilibrium (HWE) were performed by using the online available tool https://www.had2know.org/academics/hardy-weinberg-equilibrium-calculator-2-alleles.html https://www.snpstats.net/ 2 p Results Demographical and clinical parameters One hundred three CRC patients and an equal number of age-sex-matched healthy controls were taken for RFLP. The mean age of patients was 50.59 ± 13.61 years compared to the healthy control, 49.8 ± 12.71 years, respectively. Approximately 25% of patients were less than 40 years old, with a similar male–female distribution. Among the 103 cases, 59 were male and 44 were female. In the control group55were, male and 48 were female. The clinicopathological characteristics of CRC patients are summarised in supplementary table 2. Notch Genotyping: Notch3 Genotyping was analyzed by PCR–RFLP method. The amplified PCR product and digested pattern of Notch1-4 are shown in Fig. 1 Notch1 Notch4 Notch3 p Notch1 Notch3 Notch4 Notch2 1 Notch1 p 1 Notch3 Notch3 Notch4 Fig. 1 Representative image of PCR–RFLP: ( a Notch1 b Notch2 c Notch3 d Notch4 Table 1 Genotype and allelic frequency distribution across different models of inheritance of Notch1-4 Model Genotype Cases (n = 103) Controls (n = 103) OR (95% CI) p Notch 1 (rs3124591) Codominant C/C 54 (52.4%) 39 (37.9%) 1.00 0.0002 C/T 42 (40.8%) 64 (62.1%) 2.11 (1.20–3.72) T/T 7 (6.8%) 0 (0%) 0.00 (0.00-NA) Dominant C/C 54 (52.4%) 39 (37.9%) 1.00 0.035 C/T-T/T 49 (47.6%) 64 (62.1%) 1.81 (1.04–3.15) Recessive C/C–C/T 96 (93.2%) 103 (100%) 1.00 0.0016 T/T 7 (6.8%) 0 (0%) 0.00 (0.00-NA) Overdominant C/C-T/T 61 (59.2%) 39 (37.9%) 1.00 0.0021 C/T 42 (40.8%) 64 (62.1%) 2.38 (1.36–4.17) Allele CT 150 (72.82) 56 (27.58) 142 (68.93) 64 (31.07) 1.000.828 (0.541–1.268) 0.385 Log-additive – – – 1.28 (0.79–2.10) 0.32 Notch 3 SNP (rs1043994) Codominant A/A 69 (67%) 80 (77.7%) 1.00 0.2 A/G 26 (25.2%) 19 (18.4%) 0.63 (0.32–1.24) G/G 8 (7.8%) 4 (3.9%) 0.43 (0.12–1.49) Dominant A/A 69 (67%) 80 (77.7%) 1.00 0.086 A/G-G/G 34 (33%) 23 (22.3%) 0.58 (0.31–1.08) Recessive A/A-A/G 95 (92.2%) 99 (96.1%) 1.00 0.23 G/G 8 (7.8%) 4 (3.9%) 0.48 (0.14–1.65) Overdominant A/A-G/G 77 (74.8%) 84 (81.5%) 1.00 0.24 A/G 26 (25.2%) 19 (18.4%) 0.67 (0.34–1.31) Allele AG 164 (79.62) 42 (20.38) 179 (86.90) 27 (13.10) 1.00 1.697 (1.001–2.873) 0.049 Log-additive – – – 0.64 (0.40–1.05) 0.071 Notch 4 SNP (rs367398) Codominant C/C 58 (56.3%) 64 (62.1%) 1.00 0.67 C/T 37 (35.9%) 33 (32%) 0.81 (0.45–1.46) T/T 8 (7.8%) 6 (5.8%) 0.68 (0.22–2.08) Dominant C/C 58 (56.3%) 64 (62.1%) 1.00 0.39 C/T-T/T 45 (43.7%) 39 (37.9%) 0.79 (0.45–1.37) Recessive C/C–C/T 95 (92.2%) 97 (94.2%) 1.00 0.58 T/T 8 (7.8%) 6 (5.8%) 0.73 (0.25–2.20) Overdominant C/C-T/T 66 (64.1%) 70 (68%) 1.00 0.56 C/T 37 (35.9%) 33 (32%) 0.84 (0.47–1.50) Allele CT 153 (74.27) 53 (25.72) 161 (78.15) 45 (21.84) 1.00 1.043 (0.647–1.681) 0.862 Log-additive – – – 0.82 (0.52–1.27) 0.37 Association between Notch We looked at the association between clinical characteristics, demographic features, and genotype distribution of Notch1, 3, 4 Notch Notch1 p Notch1 Notch3 p Notch4 p 2 Table 2 Clinico-pathological correlation with Notch1, 3, 4 Clinico-pathological parameters Notch1 Notch3 Notch4 CC CT TT p AA AG GG p CC CT TT p Age (years) ≤ 40 11 13 03 0.29 15 09 03 0.33 1642 1027 0107 0.65 > 40 43 29 04 54 17 05 Gender Male 29 27 3 0.42 38 15 06 0.55 3424 2116 0404 0.89 Female 25 15 4 31 11 02 Site Colon 37 261 03 0.38 47 15 04 0.44 3622 2512 0503 0.85 Rectum 17 6 04 22 11 04 Grade of differentiation Well 05 07 00 0.66 07 02 03 0.15 07 02 03 0.03 Moderate 42 29 06 54 19 04 40 32 05 Poor 07 06 01 08 05 01 11 03 00 TNM stage I 01 07 02 0.12 08 00 02 0.01 09 01 00 0.10 II 24 18 02 34 10 00 26 15 03 III 25 14 03 21 15 06 21 18 03 IV 04 03 00 06 01 00 02 03 02 Tumor Depth T1 00 03 00 0.03 02 00 01 0.19 03 00 00 0.19 T2 03 04 02 08 00 01 08 01 00 T3 33 30 04 44 20 03 37 25 05 T4 18 05 01 15 06 03 10 11 03 Lymph node Positive 25 15 01 0.20 26 11 04 0.76 2137 17 03 0.63 Negative 29 27 06 43 15 04 20 05 LNI Positive 12 10 01 0.85 18 04 01 0.42 14 07 02 0.82 Negative 42 32 06 51 22 07 44 30 06 PNI Positive 07 06 00 0.57 09 03 01 0.98 10 02 01 0.23 Negative 44 36 07 60 23 07 48 35 07 Validation of RFLP of Notch1, 3 4 The polymorphic change of Notch Notch1 Notch3, Notch4 2 Notch1 Notch3 Notch4 Fig. 2 Electropherogram of Sanger sequencing obtained from the Notch1 Notch3, Notch4 Outcome of whole exome sequencing The common SNPs in the Notch family in colorectal cancer are shown in the Heat Map (Fig. 3 Fig. 3 Heat Map representing common SNPs in the Notch family. Protein expression and its correlation with polymorphism The protein expression of Notch1-4 in tumor and normal tissue was detected by western blot techniques (Fig. 4 Notch3 3 Notch3 3 Fig. 4 Protein expression Notch1-4 in normal and tumor CRC tissue analyzed by western blot technique. N and T indicate normal and tumor, respectively. Beta-actin was used as an internal control. Table 3 Association between alleles of Notch Gene Allele Up Down OR (95% CI) p Sensitivity Specificity Power Notch1 C 71 79 1.00 1.00 0.724 0.269 0.36 G 27 29 0.96 (0.52–1.78) Notch3 A 85 79 1.00 0.01 0.267 0.878 1.00 G 31 11 2.62 (1.23–5.56) Notch4 C 64 89 1.00 0.74 0.273 0.754 0.99 T 24 29 1.15 (0.61–2.15) Overall survival analysis and association with Notch SNP and clinicopathological characteristics Of the 103 patients, 82 underwent resection. After histopathology, six patients did not have R0 resection and were excluded from the survival analysis (Table 4 Notch3 Notch4 Notch3 p Notch4 p p p p p p 5 Table 4 Kaplan–Meier analysis of CRC patients and association with Notch Parameters n = 18 Event = Death Mean Survival (%) 1-year survival(%) 3-year survival (%) 95%CI p- Age < 40 07 36.9 94.7 60.2 28.7–45.2 0.344 > 40 11 49.9 84.8 75.2 43.5–56.3 Gender Male 09 41.4 88.7 73.7 36.0–46.9 0.412 Female 09 43.4 85.0 65.0 34.0–52.8 Tumor site Colon 09 50.81 90.3 81.0 44.2–57.4 0.018 Rectum 09 30.99 80.0 43.6 22.0–39.9 Grade of differentiation Well 04 35.8 90.9 54.5 24.5–47.1 0.557 Moderate 13 47.0 84.5 72.4 40.1–53.9 Poor 01 27.8 83.3 83.3 23.9–31.7 Tumor depth T1 00 – – – – T2 02 – 77.8 77.8 – 0.444 T3 12 – 91.8 68.0 – T4 04 – 73.3 61.1 – Lymph node Positive 12 30.6 77.4 42.6 22.7–38.5 0.001 Negative 06 53.6 93.2 86.6 47.4–59.7 TNM Staging I 01 47.1 90.0 90.0 39.8–54.3 0.005 II 05 50.4 93.8 83.4 41.5–59.2 III 10 33.9 80.2 51.5 26.0–41.8 IV 02 14.2 75.0 – 07.6–20.8 LVI Present 09 34.2 58.5 41.0 21.9–46.5 0.007 Absent 09 47.6 92.5 80.8 42.1–53.0 PNI Present 06 27.1 81.8 40.9 17.8–36.4 Absent 12 49.8 88.5 77.2 43.7–55.9 0.017 Notch1 SNP CC 10 – 84.7 62.6 – CT 08 – 87.8 72.5 – 0.285 TT 00 – – – – Notch3 SNP AA 11 48.6 90.0 71.2 41.7–55.5 GA 05 38.8 87.5 68.1 29.6–48.1 0.546 GG 02 32.8 60.0 60.0 16.4–49.1 Notch4 SNP CC 08 51.8 90.8 78.7 45.5–58.1 0.081 CT 08 34.1 82.1 53.9 24.7–43.4 TT 02 29.2 80.0 53.3 13.8–44.5 Fig. 5 Kaplan–Meier analysis of overall survival in CRC patients shows a significantly worse survival in rectal tumor ( p p p p p Notch4 p Discussion The present study looked at the association between Notch polymorphism, protein expression, and clinicopathological characteristics of CRC patients in the Indian population. The SNPs targeted in this study were located at various sites; rs3224591 is a 3’ UTR variant of Notch1 Notch2 Notch3 Notch4 Notch We found that the CT genotype of Notch1 23 2 p 2 p Notch1 22 Notch1 p 23 Notch2 Notch3 24 Notch3 p p p Notch3 22 Notch3 25 Notch2 Notch3 23 Notch3 p Notch4 p Notch4 Notch4 Notch4 26 Notch4 Notch4 27 We also looked at the effect of Notch Notch1 28 29 Notch1 Notch2 30 Notch3 Notch Notch3 31 32 Notch3 33 35 p p Notch3 Notch3 Notch3 Notch4 36 Notch4 37 Notch4 36 38 Notch4 39 The survival analysis revealed that rectal tumors ( p p p p p Notch Notch3 Notch4 Notch Conclusions Among Notch receptors, Notch3 Notch3 Notch3 Notch1 Notch4 Notch3 Notch4 Notch3 Notch4 Supplementary Information  Supplementary Information. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Supplementary Information The online version contains supplementary material available at 10.1038/s41598-025-00424-5. Acknowledgements We acknowledge the Department of Biotechnology (DBT), Government of India, for supporting the research facility at Central Molecular Lab, GIPMER, to conduct this study (grant number BT/INF/22/SP33063/2019). Author contributions Abhay Kumar Sharma: Experimental conception, design and manuscript preparation. Nimisha, Arun Kumar, Apurva and Abhishek Kumar: Helped in experiments and analysis. Ejaj Ahmad and Asgar Ali: Reviewed the manuscript. Birendra Prasad and Sundeep Singh Saluja: Critically reviewed the manuscript and gave final consent for publication. Funding No financial support was received to conduct this research. Data availability Sanger sequencing data that we analyzed to support our findings have been submitted to GenBank under submission ID #2,862,335. The datasets used and/or analyzed during the current study are available from the corresponding author upon reasonable request. The whole-exome sequencing data is available in the Sequence Read Archive (SRA) under BioProject accession PRJNA1079014. ( https://www.ncbi.nlm.nih.gov/bioproject/PRJNA1079014 Declarations Competing interests The authors declare no competing interests. Ethical approval The study was approved by the Institutional Ethics Committee (IEC) Maulana Azad Medical College and Associated Hospital (Approval No: F.1/IEC/MAMC/85/032021/No.430). We also confirm that all the methods performed in the study were done in accordance with the guidelines and regulations of our Institutional Ethical Committee. References 1. Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries - Bray - 2024 - CA: A Cancer Journal for Clinicians - Wiley Online Library. https://acsjournals.onlinelibrary.wiley.com/doi/10.3322/caac.21834. Accessed 19 Oct 2024 10.3322/caac.21834 38572751 2. 356-india-fact-sheet.pdf 3. Kruk J Czerniak U Physical activity and its relation to cancer risk: updating the evidence Asian Pac. J. Cancer Prev. 2013 25 1 10.7314/apjcp.2013.14.7.3993 23991944 Kruk, J. & Czerniak, U. Physical activity and its relation to cancer risk: updating the evidence. Asian Pac. J. Cancer Prev. 25 10.7314/apjcp.2013.14.7.3993 23991944 4. Tse G Eslick GD Cruciferous vegetables and risk of colorectal neoplasms: a systematic review and meta-analysis Nutr. Cancer 2014 26 2 10.1080/01635581.2014.852686 24341734 Tse, G. & Eslick, G. D. Cruciferous vegetables and risk of colorectal neoplasms: a systematic review and meta-analysis. Nutr. Cancer 26 10.1080/01635581.2014.852686 24341734 5. Zhang P Biological significance and therapeutic implication of resveratrol-inhibited Wnt, Notch and STAT3 signaling in cervical cancer cells Genes Cancer 2014 5 154 164 10.18632/genesandcancer.15 25061499 PMC4104760 Zhang, P. Biological significance and therapeutic implication of resveratrol-inhibited Wnt, Notch and STAT3 signaling in cervical cancer cells. Genes Cancer 5 25061499 10.18632/genesandcancer.15 PMC4104760 6. Phipps AI Passarelli MN Chan AT Common genetic variation and survival after colorectal cancer diagnosis: a genome-wide analysis Carcinogenesis 2016 37 87 95 10.1093/carcin/bgv161 26586795 PMC4715234 Phipps, A. I. et al. Common genetic variation and survival after colorectal cancer diagnosis: a genome-wide analysis. Carcinogenesis 37 26586795 10.1093/carcin/bgv161 PMC4715234 7. Riva A Kohane IS SNPper: retrieval and analysis of human SNPs Bioinforma Oxf. Engl. 2002 18 1681 1685 10.1093/bioinformatics/18.12.1681 12490454 Riva, A. & Kohane, I. S. SNPper: retrieval and analysis of human SNPs. Bioinforma Oxf. Engl. 18 10.1093/bioinformatics/18.12.1681 12490454 8. Xu M Gao Y Yu T Functional promoter rs2295080 T>G variant in MTOR gene is associated with risk of colorectal cancer in a Chinese population Biomed. Pharmacother. Biomed. Pharmacother. 2015 70 28 32 10.1016/j.biopha.2014.12.045 25776475 Xu, M. et al. Functional promoter rs2295080 T>G variant in MTOR gene is associated with risk of colorectal cancer in a Chinese population. Biomed. Pharmacother. Biomed. Pharmacother. 70 25776475 10.1016/j.biopha.2014.12.045 9. Zhu X Zhang J Fan W The rs391957 variant cis-regulating oncogene GRP78 expression contributes to the risk of hepatocellular carcinoma Carcinogenesis 2013 34 1273 1280 10.1093/carcin/bgt061 23416888 Zhu, X. et al. The rs391957 variant cis-regulating oncogene GRP78 expression contributes to the risk of hepatocellular carcinoma. Carcinogenesis 34 23416888 10.1093/carcin/bgt061 10. Xu Q Lin D Li X Association between single nucleotide polymorphisms of NOTCH signaling pathway-related genes and the prognosis of NSCLC Cancer Manag Res 2019 11 6895 6905 10.2147/CMAR.S197747 31413635 PMC6662170 Xu, Q. et al. Association between single nucleotide polymorphisms of NOTCH signaling pathway-related genes and the prognosis of NSCLC. Cancer Manag Res 11 31413635 10.2147/CMAR.S197747 PMC6662170 11. Dontu G Jackson KW McNicholas E Role of Notch signaling in cell-fate determination of human mammary stem/progenitor cells Breast Cancer Res 2004 6 605 10.1186/bcr920 PMC1064073 15535842 Dontu, G., Jackson, K. W. & McNicholas, E. Role of Notch signaling in cell-fate determination of human mammary stem/progenitor cells. Breast Cancer Res 6 10.1186/bcr920 PMC1064073 15535842 12. Wang Z Li Y Banerjee S Sarkar FH Emerging role of notch in stem cells and cancer Cancer Lett 2009 279 8 12 10.1016/j.canlet.2008.09.030 19022563 PMC2699045 Wang, Z., Li, Y., Banerjee, S. & Sarkar, F. H. Emerging role of notch in stem cells and cancer. Cancer Lett 279 19022563 10.1016/j.canlet.2008.09.030 PMC2699045 13. Koveitypour Z Panahi F Vakilian M Signaling pathways involved in colorectal cancer progression Cell Biosci 2019 27 3 10.1186/s13578-019-0361-4 PMC6889432 31827763 Koveitypour, Z. et al. Signaling pathways involved in colorectal cancer progression. Cell Biosci 27 10.1186/s13578-019-0361-4 PMC6889432 31827763 14. Ziouti F Ebert R Rummler M NOTCH signaling is activated through mechanical strain in human bone marrow-derived mesenchymal stromal cells Stem Cells Int 2019 28 4 10.1155/2019/5150634 PMC6413410 30936923 Ziouti, F. et al. NOTCH signaling is activated through mechanical strain in human bone marrow-derived mesenchymal stromal cells. Stem Cells Int 28 10.1155/2019/5150634 PMC6413410 30936923 15. Rajendran D, Subramaniyan B, Mathan G (2017) Role of Notch Signaling in Colorectal Cancer. In: Role of Transcription Factors in Gastrointestinal Malignancies. pp 305–312 16. Shao S Zhao X Zhang X Notch1 signaling regulates the epithelial-mesenchymal transition and invasion of breast cancer in a Slug-dependent manner Mol Cancer 2015 30 6 10.1186/s12943-015-0295-3 PMC4322803 25645291 Shao, S. et al. Notch1 signaling regulates the epithelial-mesenchymal transition and invasion of breast cancer in a Slug-dependent manner. Mol Cancer 30 10.1186/s12943-015-0295-3 PMC4322803 25645291 17. Huntzicker EG Hötzel K Choy L Differential effects of targeting Notch receptors in a mouse model of liver cancer Hepatology 2015 31 7 10.1002/hep.27566 PMC4447303 25311838 Huntzicker, E. G. et al. Differential effects of targeting Notch receptors in a mouse model of liver cancer. Hepatology 31 10.1002/hep.27566 PMC4447303 25311838 18. Zhang Z Bu X Yang J NOTCH4 regulates colorectal cancer proliferation, invasiveness, and determines clinical outcome of patients J. Cell Physiol. 2018 32 8 10.1002/jcp.26619 29693251 Zhang, Z. et al. NOTCH4 regulates colorectal cancer proliferation, invasiveness, and determines clinical outcome of patients. J. Cell Physiol. 32 10.1002/jcp.26619 29693251 19. Fu Y-P Edvardsen H Kaushiva A NOTCH2 in breast cancer: association of SNP rs11249433 with gene expression in ER-positive breast tumors without TP53 mutations Mol. Cancer 2010 9 113 10.1186/1476-4598-9-113 20482849 PMC2887795 Fu, Y.-P. et al. NOTCH2 in breast cancer: association of SNP rs11249433 with gene expression in ER-positive breast tumors without TP53 mutations. Mol. Cancer 9 20482849 10.1186/1476-4598-9-113 PMC2887795 20. Shen Z Hou X Chen B NOTCH3 gene polymorphism is associated with the prognosis of gliomas in chinese patients Med. (Baltimore) 2015 94 e482 10.1097/MD.0000000000000482 PMC4553966 25738469 Shen, Z. et al. NOTCH3 gene polymorphism is associated with the prognosis of gliomas in chinese patients. Med. (Baltimore) 94 10.1097/MD.0000000000000482 PMC4553966 25738469 21. Yagci E Degirmenci I Ozbayer C Common variants rs3815188 and rs1043994 on Notch3 gene confer susceptibility to lung cancer: a hospital-based case-control study J. Environ. Pathol. Toxicol. Oncol. Off. Organ Int. Soc. Environ. Toxicol. Cancer 2019 38 61 68 10.1615/JEnvironPatholToxicolOncol.2018028403 30806291 Yagci, E. et al. Common variants rs3815188 and rs1043994 on Notch3 gene confer susceptibility to lung cancer: a hospital-based case-control study. J. Environ. Pathol. Toxicol. Oncol. Off. Organ Int. Soc. Environ. Toxicol. Cancer 38 10.1615/JEnvironPatholToxicolOncol.2018028403 30806291 22. Alanazi IO Shaik JP Parine NR NOTCH Single Nucleotide Polymorphisms in the Predisposition of Breast and Colorectal Cancers in Saudi Patients Pathol Oncol Res 2021 10.3389/pore.2021.616204 34257585 PMC8262141 Alanazi, I. O. et al. NOTCH Single Nucleotide Polymorphisms in the Predisposition of Breast and Colorectal Cancers in Saudi Patients. Pathol Oncol Res 34257585 10.3389/pore.2021.616204 PMC8262141 23. Cao YW, Wan GX, Zhao CX, et al (2014) Notch1 single nucleotide polymorphism rs3124591 is associated with the risk of development of invasive ductal breast carcinoma in a Chinese population. Int J Clin Exp Pathol 7 PMC4129046 25120811 24. Zhou B Lin W Long Y Notch signaling pathway: Architecture, disease, and therapeutics Signal Transduct. Target Ther. 2022 7 95 10.1038/s41392-022-00934-y 35332121 PMC8948217 Zhou, B. et al. Notch signaling pathway: Architecture, disease, and therapeutics. Signal Transduct. Target Ther. 7 35332121 10.1038/s41392-022-00934-y PMC8948217 25 Yagci E Degirmenci I Ozbayer C Common variants rs3815188 and rs1043994 on Notch3 gene confer susceptibility to lung cancer: A hospital-based case-control study J. Environ. Pathol. Toxicol. Oncol. 2019 38 61 10.1615/JEnvironPatholToxicolOncol.2018028403 30806291 Yagci, E. et al. Common variants rs3815188 and rs1043994 on Notch3 gene confer susceptibility to lung cancer: A hospital-based case-control study. J. Environ. Pathol. Toxicol. Oncol. 38 30806291 10.1615/JEnvironPatholToxicolOncol.2018028403 26. Terzić T Kastelic M Dolžan V Plesničar BK Genetic variability testing of neurodevelopmental genes in schizophrenic patients J. Mol. Neurosci. MN 2015 56 205 211 10.1007/s12031-014-0482-5 25529856 Terzić, T., Kastelic, M., Dolžan, V. & Plesničar, B. K. Genetic variability testing of neurodevelopmental genes in schizophrenic patients. J. Mol. Neurosci. MN 56 25529856 10.1007/s12031-014-0482-5 27. Anttila S Illi A Kampman O Interaction between NOTCH4 and catechol-O-methyltransferase genotypes in schizophrenia patients with poor response to typical neuroleptics Pharmacogenetics 2004 14 303 307 10.1097/00008571-200405000-00005 15115916 Anttila, S. et al. Interaction between NOTCH4 and catechol-O-methyltransferase genotypes in schizophrenia patients with poor response to typical neuroleptics. Pharmacogenetics 14 15115916 10.1097/00008571-200405000-00005 28. Meng RD Shelton CC Li Y-M gamma-Secretase inhibitors abrogate oxaliplatin-induced activation of the Notch-1 signaling pathway in colon cancer cells resulting in enhanced chemosensitivity Cancer Res. 2009 69 573 582 10.1158/0008-5472.CAN-08-2088 19147571 PMC3242515 Meng, R. D. et al. gamma-Secretase inhibitors abrogate oxaliplatin-induced activation of the Notch-1 signaling pathway in colon cancer cells resulting in enhanced chemosensitivity. Cancer Res. 69 19147571 10.1158/0008-5472.CAN-08-2088 PMC3242515 29. Xiong Y Zhang Y-Y Wu Y-Y Correlation of over-expressions of miR-21 and Notch-1 in human colorectal cancer with clinical stages Life Sci. 2014 106 19 24 10.1016/j.lfs.2014.04.017 24780321 Xiong, Y. et al. Correlation of over-expressions of miR-21 and Notch-1 in human colorectal cancer with clinical stages. Life Sci. 106 24780321 10.1016/j.lfs.2014.04.017 30. Demitrack ES Gifford GB Keeley TM NOTCH1 and NOTCH2 regulate epithelial cell proliferation in mouse and human gastric corpus Am. J. Physiol. - Gastrointest. Liver Physiol. 2017 312 G133 G144 10.1152/ajpgi.00325.2016 27932500 PMC5338607 Demitrack, E. S. et al. NOTCH1 and NOTCH2 regulate epithelial cell proliferation in mouse and human gastric corpus. Am. J. Physiol. - Gastrointest. Liver Physiol. 312 27932500 10.1152/ajpgi.00325.2016 PMC5338607 31. Fernandez SV Robertson FM J P, Inflammatory breast cancer (IBC): Clues for targeted therapies Breast Cancer Res. Treat. 2013 140 23 33 10.1007/s10549-013-2600-4 23784380 PMC4273486 Fernandez, S. V., Robertson, F. M. & J P,. Inflammatory breast cancer (IBC): Clues for targeted therapies. Breast Cancer Res. Treat. 140 23784380 10.1007/s10549-013-2600-4 PMC4273486 32. Zhang TH Liu HC LJ Z, Activation of Notch signaling in human tongue carcinoma J. Oral Pathol. Med. 2011 40 37 45 10.1111/j.1600-0714.2010.00931.x 20819128 Zhang, T. H., Liu, H. C. & LJ Z,. Activation of Notch signaling in human tongue carcinoma. J. Oral Pathol. Med. 40 20819128 10.1111/j.1600-0714.2010.00931.x 33 Zhou L Zhang N Song W The significance of Notch1 compared with Notch3 in high metastasis and poor overall survival in hepatocellular carcinoma PLoS ONE 2013 8 57382 10.1371/journal.pone.0057382 PMC3585338 23468978 Zhou, L. et al. The significance of Notch1 compared with Notch3 in high metastasis and poor overall survival in hepatocellular carcinoma. PLoS ONE 8 10.1371/journal.pone.0057382 PMC3585338 23468978 34. Varga J Nicolas A Petrocelli V AKT-dependent NOTCH3 activation drives tumor progression in a model of mesenchymal colorectal cancer J Exp Med 2020 217 e20191515 10.1084/jem.20191515 32749453 PMC7537393 Varga, J. et al. AKT-dependent NOTCH3 activation drives tumor progression in a model of mesenchymal colorectal cancer. J Exp Med 217 32749453 10.1084/jem.20191515 PMC7537393 35 Lee HJ Eom D-W Kang GH Colorectal micropapillary carcinomas are associated with poor prognosis and enriched in markers of stem cells Mod. Pathol. Off. J. U S Can. Acad. Pathol. Inc 2013 26 1123 1131 10.1038/modpathol.2012.163 23060121 Lee, H. J. et al. Colorectal micropapillary carcinomas are associated with poor prognosis and enriched in markers of stem cells. Mod. Pathol. Off. J. U S Can. Acad. Pathol. Inc 26 10.1038/modpathol.2012.163 23060121 36. Wu G Chen Z Li J NOTCH4 Is a novel prognostic marker that correlates with colorectal cancer progression and prognosis J. Cancer 2018 9 2374 2379 10.7150/jca.26359 30026833 PMC6036718 Wu, G., Chen, Z. & Li, J. NOTCH4 Is a novel prognostic marker that correlates with colorectal cancer progression and prognosis. J. Cancer 9 30026833 10.7150/jca.26359 PMC6036718 37 Xiu M Wang Y Li B The role of Notch3 signaling in cancer stemness and chemoresistance: Molecular mechanisms and targeting strategies Front. Mol. Biosci. 2021 10.3389/fmolb.2021.694141 34195229 PMC8237348 Xiu, M. et al. The role of Notch3 signaling in cancer stemness and chemoresistance: Molecular mechanisms and targeting strategies. Front. Mol. Biosci. 34195229 10.3389/fmolb.2021.694141 PMC8237348 38. Xiu M Zeng X Shan R Targeting Notch4 in cancer: Molecular mechanisms and therapeutic perspectives Cancer Manag. Res. 2021 13 7033 7045 10.2147/CMAR.S315511 34526819 PMC8436177 Xiu, M. et al. Targeting Notch4 in cancer: Molecular mechanisms and therapeutic perspectives. Cancer Manag. Res. 13 34526819 10.2147/CMAR.S315511 PMC8436177 39. H. H, G. F, J. HS, Regulation of breast cancer stem cell activity by signaling through the Notch4 receptor Cancer Res. 2010 70 709 718 10.1158/0008-5472.CAN-09-1681 20068161 PMC3442245 H. H, G. F, J. HS, et al. Regulation of breast cancer stem cell activity by signaling through the Notch4 receptor. Cancer Res. 70 20068161 10.1158/0008-5472.CAN-09-1681 PMC3442245 ",
  "metadata": {
    "Title of this paper": "Regulation of breast cancer stem cell activity by signaling through the Notch4 receptor",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485164/"
  }
}