{
  "title": "Paper_447",
  "abstract": "pmc Infect Dis Ther Infect Dis Ther 2527 infecdisther Infectious Diseases and Therapy 2193-8229 2193-6382 Springer PMC12480238 PMC12480238.1 12480238 12480238 40931314 10.1007/s40121-025-01225-z 1225 1 Original Research Cardiovascular Safety of COVID-19 Treatments: A Disproportionality Analysis of Adverse Event Reports from the WHO VigiBase http://orcid.org/0009-0000-0409-5930 Cheng Hoi K. 1 http://orcid.org/0000-0001-5262-661X Lai Angel 1 http://orcid.org/0000-0001-5920-9341 Kwok Maxwell 2 3 http://orcid.org/0000-0003-0430-5752 Yan Bryan P. bryan.yan@cuhk.edu.hk 1 4 http://orcid.org/0000-0002-9280-3681 Poon Ellen Ngar-Yun ellen.poon@cuhk.edu.hk 2 3 5 6 1 https://ror.org/00t33hh48 grid.10784.3a 0000 0004 1937 0482 Division of Cardiology, Department of Medicine and Therapeutics, Faculty of Medicine, The Chinese University of Hong Kong (CUHK), 2 https://ror.org/00t33hh48 grid.10784.3a 0000 0004 1937 0482 School of Biomedical Sciences, The Chinese University of Hong Kong (CUHK), 3 https://ror.org/00t33hh48 grid.10784.3a 0000 0004 1937 0482 Hong Kong Hub of Paediatric Excellence (HK HOPE), The Chinese University of Hong Kong (CUHK), 4 https://ror.org/00t33hh48 grid.10784.3a 0000 0004 1937 0482 Heart and Vascular Institute, The Chinese University of Hong Kong (CUHK), 5 https://ror.org/00t33hh48 grid.10784.3a 0000 0004 1937 0482 Centre for Cardiovascular Genomics and Medicine, Lui Che Woo Institute of Innovative Medicine, The Chinese University of Hong Kong (CUHK), 6 https://ror.org/00t33hh48 grid.10784.3a 0000 0004 1937 0482 Ministry of Education Key Laboratory for Regenerative Medicine, The Chinese University of Hong Kong (CUHK), 11 9 2025 10 2025 14 10 497952 2445 2463 23 7 2025 18 8 2025 11 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc/4.0/ Open Access http://creativecommons.org/licenses/by-nc/4.0/ Introduction The high mortality of Coronavirus Disease 2019 (COVID-19) highlights the need for safe and effective antiviral treatment. Small molecular antivirals (remdesivir, molnupiravir, nirmatrelvir/ritonavir) and immunomodulators (baricitinib, tocilizumab) have been developed or repurposed to suppress viral replication and ameliorate cytokine storms, respectively. Despite U.S. Food and Drug Administration (FDA) approval, serious cardiovascular adverse events (CVAEs) may not be apparent in initial trials. Methods A retrospective analysis of CVAEs linked to five World Health Organization (WHO) recommended COVID-19 therapies was conducted using the WHO VigiBase database from March 2020 to July 2023. Adjusted reporting odds ratios (aROR) with 95% confidence intervals (CI) were calculated to assess CVAE risks. Results A total of 276,631 AEs were reported to be associated with COVID-19, of which 13,091 were classified as cardiovascular events. Remdesivir was associated with significantly increased odds of CVAEs, particularly bradycardia (aROR 2.4, 95% CI 2.28–2.52). In contrast, nirmatrelvir/ritonavir and molnupiravir showed reduced CVAEs odds. Among immunomodulators, baricitinib was associated with increased CVAEs risk (aROR 2.31, 95% CI 2.07–2.59), with deep vein thrombosis being the most prominent (aROR 45.34, 95% CI 34.89–58.9), accounting for 38.8% of reported study cases in the database. Also, CVAEs odds were higher during the Omicron period compared to pre-Omicron period. Conclusions These findings highlight the importance of continued pharmacovigilance and suggest potential CV safety differences among COVID-19 immunomodulators. Since tocilizumab and baricitinib are similarly indicated for severe patients with COVID-19, further clinical trials are warranted to explore whether tocilizumab represents a safer alternative to baricitinib for these patients. Insights from this study may guide future antiviral repurposing and pandemic preparedness strategies. Supplementary Information The online version contains supplementary material available at 10.1007/s40121-025-01225-z. Keywords COVID-19 Baricitinib Deep vein thrombosis Cardiovascular safety Cardiovascular adverse events Pharmacovigilance Antiviral Immunomodulator Vigibase Health and Medical Research Fund 22210062 Poon Ellen Ngar-Yun pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Healthcare Ltd., part of Springer Nature 2025 Key Summary Points   Why carry out this study? COVID-19’s high mortality required rapid drug approval, but rare cardiovascular (CV) adverse effects (AEs) may not appear in initial trials due to small samples and short durations. Post-marketing surveillance is critical for detecting CV safety signals of COVID-19 therapies, especially as these drugs may be repurposed for future pandemics. This study examined whether five World Health Organization (WHO)-recommended COVID-19 therapies are associated with increased CVAE reporting in the WHO VigiBase database.  What was learned from the study? Remdesivir showed significantly increased CV risk, while nirmatrelvir/ritonavir and molnupiravir were associated with reduced CVAE odds. Baricitinib demonstrated the highest risk of CVAEs with dramatically elevated odds of deep vein thrombosis (adjusted reporting odds ratio (aROR): 45.34). Larger clinical trials are needed to test if tocilizumab is a safer alternative to baricitinib for patients with severe COVID-19, with insights potentially guiding future antiviral repurposing and pandemic preparedness. Introduction The unprecedented death toll from COVID-19 underscores the critical need for safe and effective antiviral treatments to address viral pandemics. Viral diseases such as COVID-19 often consist of an initial infectious phase, followed, in severe patients, by an inflammatory phase [ 1 During the early stages of viral infection, small molecular antiviral therapeutics are often employed to control viral replication [ 1 2 3 4 pro 1 1 4 1 5 6 7 Given that multiple drugs are approved for the treatment of patients with COVID-19, the risk of adverse effects is a critical determinant of clinical use. Antivirals, particularly nucleotide analogues, have been shown to induce mitochondrial toxicity, which targets metabolically demanding tissues such as the heart [ 8 9 10 11 In this work, we conducted a retrospective disproportionality pharmacovigilance cohort study using data from VigiBase, the World Health Organisation (WHO) global database of ICSRs to define the cardiac safety of antiviral and immunomodulatory treatment against COVID-19. We report that of the three antiviral drugs, remdesivir is associated with increased odds of CVAEs, while nirmatrelvir/ritonavir and molnupiravir are associated with decreased odds of the latter. As for the immune modulators, we observed increased odds of CVAEs associated with the use of baricitinib, and substantially higher risk of pulmonary embolism and deep vein thrombosis, while CVAEs are minimally over-represented among the adverse reports associated with tocilizumab. Methods Study Design and Data Source Our study utilized data from VigiBase, the WHO global database of individual case safety report. VigiBase contains over 35 million adverse drug reaction (ADR) reports from approximately 150 countries, collected since 1968 as part of the WHO Program for International Drug Monitoring, and is managed by the Uppsala Monitoring Center (UMC) in Sweden. Drugs are coded according to WHODrug, while ADRs are classified according to MEdDRA terminology (version 26.0). It is structured hierarchically and comprises five levels: system organ class (SOC), high-level group term, high-level term, preferred term (PT) and lower-level term (LLT) [ 12 13 14 The study population comprised adverse event reports in the VigiBase database related to COVID-19. Case reports with drug indications for COVID-19 were extracted from VigiBase for analysis, from the inception of the database to July 2023. Relevant cardiovascular ADR reports for COVID-19 treatments were extracted from the VigiBase database from March 2020 until July 2023. Reports were categorized into case and non-case groups based on the target drugs, which included Nirmatrelvir/ritonavir (Paxlovid ® ® ® ® ® ® To assess the impact of SARS-CoV-2 variants, we also divided the reported ADRs into those associated with the Omicron variants and those related to pre-Omicron variants, based on the first reporting date (Nov 24, 2021) to the World Health Organization [ 15 VigiBase occasionally includes duplicate reports. To address this, the Uppsala Monitoring Center uses statistical algorithms to identify and exclude these potential duplicates from the analysis [ 16 Ethical Approval This article is based on available data in VigiBase ( https://who-umc.org/vigibase-search-services/about-vigibase/ The study was approved by the ethics committee of The Chinese University of Hong Kong (CUHK) and New Territories East Cluster (NTEC) (Ref. No. 2023.186). Since only anonymous data was collected, informed consent was waived. Statistical Analysis We conducted an analysis to determine whether the proportion of cardiovascular toxicities reported for the study drugs differed from that observed in the control group, which includes the entire extracted COVID-19 database. The top ten most frequently reported PTs for CV ADRs associated with the investigated COVID-19 treatment drugs were identified from the extracted ICSRs. A disproportionality analysis was performed by constructing a 2 × 2 contingency table, relating the observed drug-event combinations to all other drugs and events in the extracted database to calculate the reporting odds ratio (ROR) with a 95% confidence interval (CI) for each adverse event term. Adjusted (a) RORs with 95% CIs were derived using a logistic regression model that accounted for age group and sex. Disproportionate reporting was further evaluated by calculating the information component (IC) values. The IC measures the disproportionality between the observed and expected number of reports for a drug-event combination. \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$IC = \\log_{2} \\frac{O + \\alpha 1}{{E + \\alpha 2}}$$\\end{document} I C = log 2 O + α 1 E + α 2 O \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\alpha 1 \\;{\\text{and}}\\; \\alpha 2 = 0.5$$\\end{document} α 1 and α 2 = 0.5 E \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$E = \\frac{{\\left( {{\\text{no}}.\\;{\\text{of}}\\;{\\text{reports}}\\;{\\text{on}}\\;{\\text{the}}\\;{\\text{drug}}} \\right) \\times \\left( {{\\text{no}}.\\;{\\text{of}}\\;{\\text{reports}}\\;{\\text{on}}\\;{\\text{the}}\\;{\\text{event}}} \\right)}}{{{\\text{total}}\\;{\\text{number}}\\;{\\text{of}}\\;{\\text{reports}}}}$$\\end{document} E = no . of reports on the drug × no . of reports on the event total number of reports A positive IC indicates that the number of reported cases exceeds the expected number. Traditional significance thresholds were applied, requiring the lower limit of the 95% confidence interval to be greater than 1 for the ROR and greater than 0 for the IC. A safety signal was deemed present if both methods demonstrated statistical significance [ 17 19 To assess the significance of the differences in reporting odds ratios between the pre-Omicron and Omicron periods for baricitinib, remdesivir, and tocilizumab, Z Results Overview of AEs During the study period, a total of 326,655 adverse events related to COVID-19 were identified in VigiBase. After excluding cases with missing data on age, sex, and MedDRA ID, as well as reports prior to January 1, 2020, 276,631 case reports remained for analysis. Among these, 263,540 and 13,091 were categorized as non-CVAEs and CVAEs, respectively (Fig. 1 1 2 Fig. 1 Flow diagram for inclusion and exclusion of study. COVID-19 ICSRs CVAEs Table 1 Demographics and characteristics of ICSRs with CVAEs associated with the five studied drugs in VigiBase during the study period Remdesivir Nirmatrelvir/ritonavir Molnuparvir Baricitinib Tocilizumab All CVAEs No. of reports, n 2115 (16.2) 1045 (8.0) 70 (0.5) 352 (2.7) 443 (3.4) 13,091 Regions, n Americas 1667 (78.8) 830 (79.4) 36 (51.4) 344 (97.7) 316 (71.3) 8971 (68.5) European region 321 (15.2) 163 (15.6) 29 (41.4) 6 (1.7) 66 (14.9) 3130 (23.9) Western Pacific 23 (1.1) 52 (5.0) 2 (2.9) 2 (0.6) 32 (7.2) 261 (2.0) South-East Asia 59 (2.8) 0 (0.0) 0 (0.0) 0 (0.0) 9 (2.0) 271 (2.1) Eastern Mediterranean 45 (2.1) 0 (0.0) 3 (4.3) 0 (0.0) 19 (4.3) 430 (3.3) African 0 (0) 0 (0) 0 (0) 0 (0) 1 (0.2) 28 (0.2) Age groups, n Under  18 years 71 (3.4) 1 (0.1) 0 (0) 6 (1.7) 2 (0.4) 361 (2.8) 18–44 years 289 (13.7) 142 (13.6) 2 (2.9) 62 (17.6) 89 (20.1) 3001 (22.9) 45–74 years 1296 (61.3) 625 (59.8) 34 (48.6) 243 (69.0) 278 (62.8) 7414 (56.7) ≥ 75 years 459 (21.7) 277 (26.5) 34 (48.6) 41 (11.6) 74 (16.7) 2315 (17.7) Sex, n Male 1245 (58.9) 323 (30.9) 24 (34.3) 252 (71.6) 323 (72.9) 6600 (50.4) Female 870 (41.1) 722 (69.1) 46 (65.7) 100 (28.4) 120 (27.1) 6491 (49.6) Report type, n Spontaneous 1996 (94.4) 1022 (97.8) 69 (98.6) 348 (98.9) 399 (90.1) 11,511 (87.9) Report from study 113 (5.3) 23 (2.2) 1 (1.4) 4 (1.1) 20 (4.5) 1371 (10.5) Other/unknown 6 (0.3) 0 (0.0) 0 (0) 0 (0) 24 (5.4) 209 (1.6) Report period, n Pre-omicron 1622 (76.7) 0 (0.0) 0 (0) 172 (48.9) 290 (65.5) 7226 (55.2) Omicron 493 (23.3) 1045 (100.0) 70 (100) 180 (51.1) 153 (34.5) 5865 (44.8) ICSRs CVAEs Table 2 Demographics and characteristics of the top ten most frequently reported CVAEs associated with COVID-19 treatments during the study period Tachycardia Hypotension Bradycardia Flushing Hypertension Palpitations Cardiac arrest Atrial fibrillation Sinus bradycardia Pallor Total Event number, n 1357 (17.1) 1308 (16.5) 1234 (15.5) 910 (11.4) 801 (10.1) 705 (8.9) 577 (7.3) 471 (5.9) 305 (3.8) 280 (3.5) 7948 Regions, n Americas 905 (66.7) 1016 (77.7) 855 (69.3) 851 (93.5) 586 (73.2) 275 (39.0) 491 (85.1) 365 (77.5) 121 (39.7) 260 (92.9) 5725 (72.0) European 280 (20.6) 169 (12.9) 255 (20.7) 40 (4.4) 161 (20.1) 304 (43.1) 62 (10.7) 91 (19.3) 148 (48.5) 19 (6.8) 1529 (19.2) Eastern Mediterranean 123 (9.1) 40 (3.1) 16 (1.3) 13 (1.4) 10 (1.2) 52 (7.4) 11 (1.9) 9 (1.9) 7 (2.3) 1 (0.4) 282 (3.5) South-East Asia 35 (2.6) 22 (1.7) 63 (5.1) 1 (0.1) 22 (2.7) 35 (5.0) 2 (0.3) 0 (0) 21 (6.9) 0 (0) 201 (2.5) Western Pacific 13 (1.0) 60 (4.6) 45 (3.6) 5 (0.5) 20 (2.5) 23 (3.3) 6 (1.0) 6 (1.3) 8 (2.6) 0 (0) 186 (2.3) African 1 (0.1) 1 (0.1) 0 (0) 0 (0) 2 (0.2) 16 (2.3) 5 (0.9) 0 (0) 0 (0) 0 (0) 25 (0.3) Age groups, n Under 18 years 48 (3.5) 24 (1.8) 39 (3.2) 28 (3.1) 11 (1.4) 8 (1.1) 9 (1.6) 0 (0) 12 (3.9) 25 (8.9) 204 (2.6) 18–44 years 534 (39.4) 244 (18.7) 229 (18.6) 456 (50.1) 135 (16.9) 277 (39.3) 85 (14.7) 36 (7.6) 64 (21.0) 92 (32.9) 2152 (27.1) 45–74 years 616 (45.4) 756 (57.8) 725 (58.7) 364 (40) 485 (60.6) 364 (51.7) 356 (61.7) 262 (55.6) 184 (60.4) 142 (50.7) 4254 (53.5) ≥ 75 years 159 (11.7) 284 (21.7) 241 (19.5) 62 (6.8) 170 (21.2) 56 (7.9) 127 (22.0) 173 (36.7) 45 (14.8) 21 (7.5) 1338 (16.8) Sex, n Male 609 (44.9) 730 (55.8) 731 (59.2) 231 (25.4) 323 (40.3) 222 (31.5) 368 (63.8) 274 (58.2) 172 (56.4) 149 (53.2) 3809 (47.9) Female 748 (55.1) 578 (44.2) 503 (40.8) 679 (74.6) 478 (59.7) 483 (68.5) 209 (36.2) 197 (41.8) 133 (43.6) 131 (46.8) 4139 (52.1) Report period, n Pre-omicron 813 (59.9) 736 (56.3) 839 (68.0) 218 (24.0) 332 (41.4) 240 (34.0) 407 (70.5) 278 (59.0) 198 (64.9) 159 (56.8) 4220 (53.1) Omicron 544 (40.1) 572 (43.7) 395 (32.0) 692 (76.0) 469 (58.6) 465 (66.0) 170 (29.5) 193 (41.0) 107 (35.1) 121 (43.2) 3728 (46.9) CVAEs The five studied COVID-19 treatment drugs, remdesivir, nirmatrelvir/ritonavir, molnupiravir, baricitinib and tocilizumab contributed to 4025 CVAEs during the study period. The analysis of exposure ORs revealed notable associations between various COVID-19 treatments and incidence of CVAEs, as summarized in Fig. 2 Fig. 2 Forest plot of reporting odds ratios for CVAEs associated with five studied drugs during the study period. CVAEs ICSRs IC/IC 0.25 aROR CI CVAEs by Treatment Antiviral Agents Remdesivir Our analysis identified 20,373 ICSRs associated with remdesivir, of which 2115 were CVAEs (Fig. 2 1 0.25 3 Fig. 3 CVAEs associated with remdesivir, nirmatrelvir/ritonavir and molnupiravir. Forest plots of reporting odds ratios for ten most frequently reported CVAEs associated with A B C ICSRs CVAE %CVAE IC/IC 0.25 aROR CI Nirmatrelvir/Ritonavir CVAEs associated with nirmatrelvir/ritonavir were reported in 1045 cases out of 79,334 ICSRs. The aROR was calculated at 0.20 (95% CI 0.19–0.21; IC 0.25 0.25 0.25 3 1 Molnupiravir Molnupiravir demonstrated a moderate exposure odds ratio for CVAEs, with an aROR of 0.54 (95% CI 0.43–0.69; IC 0.25 2 3 Immune Modulators Baricitinib Baricitinib was associated with a total of 352 CVAEs out of 3329 ICSRs, resulting in an aROR of 2.31 (95% CI 2.07–2.59; IC 0.25 2 1 4 0.25 0.25 0.25 0.25 0.25 0.25 0.25 Fig. 4 CVAEs associated with baricitinib and tocilizumab. Forest plots of reporting odds ratios for the ten most frequently reported CVAEs associated with A B C D ICSRs CVAE %CVAE IC/IC 0.25 aROR CI Tocilizumab Our study found 443 CVAEs linked to tocilizumab out of 7719 ICSRs (Fig. 2 0.25 0.25 0.25 4 Thrombosis Since baricitinib, but not tocilizumab, was associated with an unexpected high risk of thrombosis, we further examined the pattern of thrombosis among patients with COVID-19 (Fig. 4 Analysis During the Omicron and Pre-Omicron Period Next, we examined if the CVAE profiles differed during the Omicron and pre-Omicron periods. We defined the Omicron period as November 24, 2021 onwards, after the Omicron variant was first reported by the WHO [ 15 20 In the Omicron period, there were 160,578 reported AEs related to COVID-19, including 5865 classified as CVAEs. The pre-Omicron phase recorded 116,053 total adverse events, with 7226 being CVAEs. The demographic and case characteristics of CVAEs reported for studied drugs in pre-Omicron vs. Omicron periods are shown in Table S1 Both nirmatrelvir/ritonavir and molnupiravir were introduced during the Omicron period; thus no pre-Omicron data was available for analysis. By contrast, remdesivir, baricitinib and tocilizumab were first approved by the US-FDA for emergency use against COVID-19 in May 2020 [ 21 22 6 23 24 25 5 S1 p 6 p 6 p Fig. 5 Forest plot of reporting odds ratios of CVAEs associated with remdesivir, baricitinib, and tocilizumab in the pre-Omicron vs. Omicron periods. CVAEs ICSRs IC/IC 0.25 aROR CI p z Fig. 6 CVAEs associated with remdesivir, baricitinib, and tocilizumab in the pre-Omicron vs. Omicron periods. Forest plots of reporting odds ratios for ten most frequently reported CVAEs associated with A B C CVAEs ICSRs CVAE %CVAE IC/IC 0.25 aROR CI p z Discussion Since COVID-19 emerged as a global pandemic, there have been numerous studies on treatment that can ameliorate this disease. Most studies focus on the efficacy, but safety concerns have been less extensively evaluated. CVAEs are common among patients with COVID-19 because this disease can damage the heart and because CV co-morbidities are very frequent among these patients. Therefore, treatment-related CVAEs might have been overlooked. In this retrospective pharmacovigilance cohort study, we analysed CVAEs associated with five COVID-19 treatments for patients with this disease. Our findings highlight significant differences in the incidence of CVAEs among various antiviral agents and immune modulators. Among small molecular antivirals designed to suppress viral replication, remdesivir was associated with higher odds of CVAEs, with bradycardia being the most common. Conversely, nirmatrelvir/ritonavir and molnupiravir were associated with decreased odds of CVAEs. Among immune modulators designed to control the cytokine storm, baricitinib use carries increased risks of CVAEs. In particular, the risks of thrombotic embolism (deep vein thrombosis and thrombosis) were both substantially increased with baricitinib, while these trends were not observed with tocilizumab. Considering that these two drugs are similarly indicated to treat patients with severe COVID-19, our study highlights potential CV safety concerns specifically associated with baricitinib. To date, there have been limited reports on the adverse CV effects of nirmatrelvir/ritonavir. Our analysis shows that nirmatrelvir/ritonavir exhibits the smallest OR for CV events, indicating a weak association with CVAEs, consistent with the results of previous studies [ 26 27 28 29 1 30 31 1 32 33 32 34 35 37 36 38 39 While our results on antivirals are broadly consistent with those reported in prior studies, we made the unexpected finding that baricitinib is associated with increased odds of CVAE (aROR 2.31) and substantially higher odds of deep vein thrombosis (aROR 45.3) and thrombosis (aROR 6.92). Furthermore, arterial thrombosis is a frequent cause of acute myocardial infarction, and the latter is also overrepresented among the AEs of baricitinib (aROR 4.85). Contradictory evidence exists regarding the safety profile of baricitinib. A Swedish comparative safety study showed that JAK inhibitors, including baricitinib, were associated with increased incidence of venous thromboembolism among patients with rheumatoid arthritis [ 10 6 40 41 42 43 11 6 44 less 45 46 47 Since COVID-19 was first detected, multiple variants of this virus have emerged, and they differ in their tropism and pathogenicity. In particular, the Omicron variant is known for its high transmissibility and reduced severity compared to earlier variants such as the wild-type, Alpha, and Delta variants [ 48 39 This study's key strength lies in its use of VigiBase, a comprehensive global database of ICSRs. This resource offers a large sample size and diverse data sources, facilitating the identification of rare adverse drug reactions and generating hypotheses regarding drug safety that may not be observed in clinical studies. The inclusion of reports from multiple countries and various types of reporters enhances the generalizability of the findings [ 16 16 32 49 Conclusions Our study revealed differences in the CV safety profiles of COVID-19 treatment, and during different periods of the pandemic. These results underscore the need for continued post-marketing surveillance and safety monitoring in patients receiving these treatments, particularly baricitinib. Since tocilizumab and baricitinib have similar efficacy against COVID-19 [ 50 Supplementary Information Below is the link to the electronic supplementary material. Supplementary file1 (PDF 127 kb) Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Author Contributions Conceptualization: Ellen Ngar-Yun Poon; Methodology: Hoi Ki Cheng, Angel Lai, Maxwell Kwok; Formal analysis and investigation: Hoi Ki Cheng, Maxwell Kwok; Writing and editing manuscript: Hoi Ki Cheng, Maxwell Kwok, Ellen Ngar-Yun Poon; Funding acquisition: Bryan P. Yan, Ellen Ngar-Yun Poon; Supervision: Bryan P. Yan, Ellen Ngar-Yun Poon. All authors read and approved the final manuscript. Funding This work was supported by funding from the Health and Medical Research Fund (22210062) from the Health Bureau, Hong Kong SAR, China, to E.N.P. The Rapid Service Fee was funded by the Chinese University of Hong Kong. Data Availability All data generated or analyzed during this study are included in this published article and its supplementary information files. Declarations Conflict of interest Hoi Ki Cheng is an employee of Pfizer Inc, but the latter did not play any role in the design and execution of this study. All other authors (Angel Lai, Maxwell Kwok, Bryan P Yan, Ellen N Poon) have no conflicts of interest relevant to the content of this manuscript. Ethical approval This article is based on available data in VigiBase ( https://who-umc.org/vigibase-search-services/about-vigibase/ References 1. Focosi D Franchini M Maggi F Shoham S COVID-19 therapeutics Clin Microbiol Rev 2024 37 2 e0011923 10.1128/cmr.00119-23 38771027 PMC11237566 Focosi D, Franchini M, Maggi F, Shoham S. COVID-19 therapeutics. Clin Microbiol Rev. 2024;37(2):e0011923. 38771027 10.1128/cmr.00119-23 PMC11237566 2. Lei S Chen X Wu J Duan X Men K Small molecules in the treatment of COVID-19 Signal Transduct Target Ther 2022 7 1 387 10.1038/s41392-022-01249-8 36464706 PMC9719906 Lei S, Chen X, Wu J, Duan X, Men K. Small molecules in the treatment of COVID-19. Signal Transduct Target Ther. 2022;7(1):387. 36464706 10.1038/s41392-022-01249-8 PMC9719906 3. Pruijssers AJ George AS Schafer A Leist SR Gralinksi LE Dinnon KH 3rd Remdesivir inhibits SARS-CoV-2 in human lung cells and chimeric SARS-CoV expressing the SARS-CoV-2 RNA polymerase in mice Cell Rep 2020 32 3 107940 10.1016/j.celrep.2020.107940 32668216 PMC7340027 Pruijssers AJ, George AS, Schafer A, Leist SR, Gralinksi LE, Dinnon KH 3rd, et al. Remdesivir inhibits SARS-CoV-2 in human lung cells and chimeric SARS-CoV expressing the SARS-CoV-2 RNA polymerase in mice. Cell Rep. 2020;32(3): 107940. 32668216 10.1016/j.celrep.2020.107940 PMC7340027 4. Jayk Bernal A Gomes da Silva MM Musungaie DB Kovalchuk E Gonzalez A Delos Reyes V Molnupiravir for oral treatment of COVID-19 in nonhospitalized patients N Engl J Med 2022 386 6 509 520 10.1056/NEJMoa2116044 34914868 PMC8693688 Jayk Bernal A, Gomes da Silva MM, Musungaie DB, Kovalchuk E, Gonzalez A, Delos Reyes V, et al. Molnupiravir for oral treatment of COVID-19 in nonhospitalized patients. N Engl J Med. 2022;386(6):509–20. 34914868 10.1056/NEJMoa2116044 PMC8693688 5. Costela-Ruiz VJ Illescas-Montes R Puerta-Puerta JM Ruiz C Melguizo-Rodriguez L SARS-CoV-2 infection: the role of cytokines in COVID-19 disease Cytokine Growth Factor Rev 2020 54 62 75 10.1016/j.cytogfr.2020.06.001 32513566 PMC7265853 Costela-Ruiz VJ, Illescas-Montes R, Puerta-Puerta JM, Ruiz C, Melguizo-Rodriguez L. SARS-CoV-2 infection: the role of cytokines in COVID-19 disease. Cytokine Growth Factor Rev. 2020;54:62–75. 32513566 10.1016/j.cytogfr.2020.06.001 PMC7265853 6. Rubin R Baricitinib is first approved COVID-19 immunomodulatory treatment JAMA 2022 327 23 2281 35727290 10.1001/jama.2022.9846 Rubin R. Baricitinib is first approved COVID-19 immunomodulatory treatment. JAMA. 2022;327(23):2281. 35727290 10.1001/jama.2022.9846 7. Shafran IH Alasti F Smolen JS Aletaha D Implication of baseline levels and early changes of C-reactive protein for subsequent clinical outcomes of patients with rheumatoid arthritis treated with tocilizumab Ann Rheum Dis 2020 79 7 874 882 10.1136/annrheumdis-2019-215987 32371387 Shafran IH, Alasti F, Smolen JS, Aletaha D. Implication of baseline levels and early changes of C-reactive protein for subsequent clinical outcomes of patients with rheumatoid arthritis treated with tocilizumab. Ann Rheum Dis. 2020;79(7):874–82. 32371387 10.1136/annrheumdis-2019-215987 8. Apostolova N Blas-Garcia A Esplugues JV Mitochondrial interference by anti-HIV drugs: mechanisms beyond Pol-gamma inhibition Trends Pharmacol Sci 2011 32 12 715 725 10.1016/j.tips.2011.07.007 21899897 Apostolova N, Blas-Garcia A, Esplugues JV. Mitochondrial interference by anti-HIV drugs: mechanisms beyond Pol-gamma inhibition. Trends Pharmacol Sci. 2011;32(12):715–25. 21899897 10.1016/j.tips.2011.07.007 9. Sharma A Garcia G Jr. Wang Y Plummer JT Morizono K Arumugaswami V Human iPSC-derived cardiomyocytes are susceptible to SARS-CoV-2 infection Cell Rep Med 2020 1 4 100052 10.1016/j.xcrm.2020.100052 32835305 PMC7323681 Sharma A, Garcia G Jr., Wang Y, Plummer JT, Morizono K, Arumugaswami V, et al. Human iPSC-derived cardiomyocytes are susceptible to SARS-CoV-2 infection. Cell Rep Med. 2020;1(4): 100052. 32835305 10.1016/j.xcrm.2020.100052 PMC7323681 10. Molander V Bower H Frisell T Delcoigne B Di Giuseppe D Askling J Venous thromboembolism with JAK inhibitors and other immune-modulatory drugs: a Swedish comparative safety study among patients with rheumatoid arthritis Ann Rheum Dis 2023 82 2 189 197 10.1136/ard-2022-223050 36150749 PMC9887398 Molander V, Bower H, Frisell T, Delcoigne B, Di Giuseppe D, Askling J, et al. Venous thromboembolism with JAK inhibitors and other immune-modulatory drugs: a Swedish comparative safety study among patients with rheumatoid arthritis. Ann Rheum Dis. 2023;82(2):189–97. 36150749 10.1136/ard-2022-223050 PMC9887398 11. Zou J Jing F Cardiovascular adverse events associated with monoclonal antibody products in patients with COVID-19 Pharmaceuticals (Basel) 2022 10.3390/ph15121472 36558922 PMC9782649 Zou J, Jing F. Cardiovascular adverse events associated with monoclonal antibody products in patients with COVID-19. Pharmaceuticals (Basel). 2022. 10.3390/ph15121472. 36558922 10.3390/ph15121472 PMC9782649 12. Wang L Jiang G Li D Liu H Standardizing adverse drug event reporting data J Biomed Semant 2014 5 36 10.1186/2041-1480-5-36 PMC4142531 25157320 Wang L, Jiang G, Li D, Liu H. Standardizing adverse drug event reporting data. J Biomed Semant. 2014;5: 36. 10.1186/2041-1480-5-36 PMC4142531 25157320 13. Lindquist M Vigibase, the WHO global ICSR database system: basic facts Drug Inf J DIJ/Drug Inf Assoc 2008 42 5 409 419 10.1177/009286150804200501 Lindquist M. Vigibase, the WHO global ICSR database system: basic facts. Drug Inf J DIJ/Drug Inf Assoc. 2008;42(5):409–19. 14. Uppsala Monitoring Centre. VigiBase, WHO’s global database 2024. https://who-umc.org/vigibase/vigibase-who-s-global-database/ 15. Chenchula S Karunakaran P Sharma S Chavan M Current evidence on efficacy of COVID-19 booster dose vaccination against the Omicron variant: a systematic review J Med Virol 2022 94 7 2969 2976 10.1002/jmv.27697 35246846 PMC9088621 Chenchula S, Karunakaran P, Sharma S, Chavan M. Current evidence on efficacy of COVID-19 booster dose vaccination against the Omicron variant: a systematic review. J Med Virol. 2022;94(7):2969–76. 35246846 10.1002/jmv.27697 PMC9088621 16. Uppsala Monitoring Centre. Guideline for using VigiBase data in studies. 2021. 17. Raschi E Salvo F Khouri C Conceiving, conducting, reporting, interpreting, and publishing disproportionality analyses: a call to action Br J Clin Pharmacol 2022 88 7 3535 3536 10.1111/bcp.15269 35178726 Raschi E, Salvo F, Khouri C. Conceiving, conducting, reporting, interpreting, and publishing disproportionality analyses: a call to action. Br J Clin Pharmacol. 2022;88(7):3535–6. 35178726 10.1111/bcp.15269 18. Noren GN Hopstadius J Bate A Shrinkage observed-to-expected ratios for robust and transparent large-scale pattern discovery Stat Methods Med Res 2013 22 1 57 69 10.1177/0962280211403604 21705438 PMC6331976 Noren GN, Hopstadius J, Bate A. Shrinkage observed-to-expected ratios for robust and transparent large-scale pattern discovery. Stat Methods Med Res. 2013;22(1):57–69. 21705438 10.1177/0962280211403604 PMC6331976 19. Bate A Lindquist M Edwards IR Olsson S Orre R Lansner A A Bayesian neural network method for adverse drug reaction signal generation Eur J Clin Pharmacol 1998 54 4 315 321 10.1007/s002280050466 9696956 Bate A, Lindquist M, Edwards IR, Olsson S, Orre R, Lansner A, et al. A Bayesian neural network method for adverse drug reaction signal generation. Eur J Clin Pharmacol. 1998;54(4):315–21. 9696956 10.1007/s002280050466 20. Khetran SR Mustafa R Mutations of SARS-CoV-2 structural proteins in the Alpha, Beta, Gamma, and Delta variants: bioinformatics analysis JMIR Bioinform Biotechnol 2023 4 e43906 10.2196/43906 37485046 PMC10353769 Khetran SR, Mustafa R. Mutations of SARS-CoV-2 structural proteins in the Alpha, Beta, Gamma, and Delta variants: bioinformatics analysis. JMIR Bioinform Biotechnol. 2023;4: e43906. 37485046 10.2196/43906 PMC10353769 21. U.S. Food and Drug Administration. Coronavirus (COVID-19) Update: FDA Issues Emergency Use Authorization for Potential COVID-19 Treatment May 01, 2020. https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-issues-emergency-use-authorization-potential-covid-19-treatment 22. Rubin D Chan-Tack K Farley J Sherwat A FDA approval of remdesivir—a step in the right direction N Engl J Med 2020 383 27 2598 2600 10.1056/NEJMp2032369 33264539 Rubin D, Chan-Tack K, Farley J, Sherwat A. FDA approval of remdesivir—a step in the right direction. N Engl J Med. 2020;383(27):2598–600. 33264539 10.1056/NEJMp2032369 23. U.S. Food and Drug Administration. Coronavirus (COVID-19) Update: FDA Authorizes Drug Combination for Treatment of COVID-19 November 19. 2020. https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-authorizes-drug-combination-treatment-covid-19 24. U.S. Food and Drug Administration. Coronavirus (COVID-19) Update: FDA Authorizes Drug for Treatment of COVID-19 June 24, 2021. https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-authorizes-drug-treatment-covid-19 25. Padasas BT Espano E Kim SH Song Y Lee CK Kim JK COVID-19 therapeutics: an update on effective treatments against infection with SARS-CoV-2 variants Immune Netw 2023 23 2 e13 10.4110/in.2023.23.e13 37179752 PMC10166656 Padasas BT, Espano E, Kim SH, Song Y, Lee CK, Kim JK. COVID-19 therapeutics: an update on effective treatments against infection with SARS-CoV-2 variants. Immune Netw. 2023;23(2): e13. 37179752 10.4110/in.2023.23.e13 PMC10166656 26. Gu J Han ZH Wang CQ Zhang JF The impacts of nirmatrelvir-ritonavir on myocardial injury and long-term cardiovascular outcomes in hospitalized patients with COVID-19 amid the Omicron wave of the pandemic Cardiovasc Drugs Ther 2024 10.1007/s10557-024-07570-4 38466547 Gu J, Han ZH, Wang CQ, Zhang JF. The impacts of nirmatrelvir-ritonavir on myocardial injury and long-term cardiovascular outcomes in hospitalized patients with COVID-19 amid the Omicron wave of the pandemic. Cardiovasc Drugs Ther. 2024. 10.1007/s10557-024-07570-4. 38466547 10.1007/s10557-024-07570-4 27. Wang W Wang YH Huang CH Hsieh TH Ibarburu GH Wei JC Paxlovid use is associated with lower risk of cardiovascular diseases in COVID-19 patients with autoimmune rheumatic diseases: a retrospective cohort study BMC Med 2024 22 1 117 10.1186/s12916-024-03331-0 38481216 PMC10938827 Wang W, Wang YH, Huang CH, Hsieh TH, Ibarburu GH, Wei JC. Paxlovid use is associated with lower risk of cardiovascular diseases in COVID-19 patients with autoimmune rheumatic diseases: a retrospective cohort study. BMC Med. 2024;22(1):117. 38481216 10.1186/s12916-024-03331-0 PMC10938827 28. DeMarco E Turnipseed M Clarke B Qadeer F Possible nirmatrelvir/ritonavir-induced bradycardia in a patient with asymptomatic COVID-19 SAGE Open Med Case Rep 2023 11 2050313X231168304 10.1177/2050313X231168304 37113391 PMC10119650 DeMarco E, Turnipseed M, Clarke B, Qadeer F. Possible nirmatrelvir/ritonavir-induced bradycardia in a patient with asymptomatic COVID-19. SAGE Open Med Case Rep. 2023;11: 2050313X231168304. 37113391 10.1177/2050313X231168304 PMC10119650 29. Ganipisetti VM Bollimunta P Maringanti S Paxlovid-induced symptomatic bradycardia and syncope Cureus 2023 15 1 e33831 36655157 10.7759/cureus.33831 PMC9842109 Ganipisetti VM, Bollimunta P, Maringanti S. Paxlovid-induced symptomatic bradycardia and syncope. Cureus. 2023;15(1):e33831. 36655157 10.7759/cureus.33831 PMC9842109 30. Liang Y Ma L Wang Y Zheng J Su L Lyu J Adverse events associated with molnupiravir: a real-world disproportionality analysis in the Food and Drug Administration Adverse Event Reporting System Front Pharmacol 2023 14 1253799 10.3389/fphar.2023.1253799 38026949 PMC10644225 Liang Y, Ma L, Wang Y, Zheng J, Su L, Lyu J. Adverse events associated with molnupiravir: a real-world disproportionality analysis in the Food and Drug Administration Adverse Event Reporting System. Front Pharmacol. 2023;14:1253799. 38026949 10.3389/fphar.2023.1253799 PMC10644225 31. Santi Laurini G Montanaro N Motola D Safety profile of molnupiravir in the treatment of COVID-19: a descriptive study based on FAERS data J Clin Med 2022 12 1 34 10.3390/jcm12010034 36614834 PMC9821679 Santi Laurini G, Montanaro N, Motola D. Safety profile of molnupiravir in the treatment of COVID-19: a descriptive study based on FAERS data. J Clin Med. 2022;12(1):34. 36614834 10.3390/jcm12010034 PMC9821679 32. World Health Organization. Therapeutics and COVID-19: living guideline. Geneva; 2023 10 November. Report No.: WHO/2019-nCoV/clinical/2023.2. 33. U.S. Food and Drug Administration. Fact Sheet for Patients and Caregivers: Emergency Use Authorization (EUA) of LAGEVRIO™ (molnupiravir) capsules for Coronavirus Disease 2019 (COVID-19) 2024. https://www.fda.gov/media/155055/download 34. Terzic V Miantezila Basilua J Billard N de Gastines L Belhadi D Fougerou-Leurent C Cardiac adverse events and remdesivir in hospitalized patients with COVID-19: a post hoc safety analysis of the randomized DisCoVeRy Trial Clin Infect Dis 2024 79 2 382 391 10.1093/cid/ciae170 38552208 PMC11327784 Terzic V, Miantezila Basilua J, Billard N, de Gastines L, Belhadi D, Fougerou-Leurent C, et al. Cardiac adverse events and remdesivir in hospitalized patients with COVID-19: a post hoc safety analysis of the randomized DisCoVeRy Trial. Clin Infect Dis. 2024;79(2):382–91. 38552208 10.1093/cid/ciae170 PMC11327784 35. Alsowaida YS Shehadeh F Kalligeros M Mylonakis E Incidence and potential risk factors for remdesivir-associated bradycardia in hospitalized patients with COVID-19: a retrospective cohort study Front Pharmacol 2023 14 1106044 10.3389/fphar.2023.1106044 36817161 PMC9930471 Alsowaida YS, Shehadeh F, Kalligeros M, Mylonakis E. Incidence and potential risk factors for remdesivir-associated bradycardia in hospitalized patients with COVID-19: a retrospective cohort study. Front Pharmacol. 2023;14:1106044. 36817161 10.3389/fphar.2023.1106044 PMC9930471 36. Jung SY Kim MS Li H Lee KH Koyanagi A Solmi M Cardiovascular events and safety outcomes associated with remdesivir using a World Health Organization international pharmacovigilance database Clin Transl Sci 2022 15 2 501 513 10.1111/cts.13168 34719115 PMC8841455 Jung SY, Kim MS, Li H, Lee KH, Koyanagi A, Solmi M, et al. Cardiovascular events and safety outcomes associated with remdesivir using a World Health Organization international pharmacovigilance database. Clin Transl Sci. 2022;15(2):501–13. 34719115 10.1111/cts.13168 PMC8841455 37. Nabati M Parsaee H Potential cardiotoxic effects of remdesivir on cardiovascular system: a literature review Cardiovasc Toxicol 2022 22 3 268 272 10.1007/s12012-021-09703-9 34643857 PMC8511861 Nabati M, Parsaee H. Potential cardiotoxic effects of remdesivir on cardiovascular system: a literature review. Cardiovasc Toxicol. 2022;22(3):268–72. 34643857 10.1007/s12012-021-09703-9 PMC8511861 38. Choi SW Shin JS Park SJ Jung E Park YG Lee J Antiviral activity and safety of remdesivir against SARS-CoV-2 infection in human pluripotent stem cell-derived cardiomyocytes Antivir Res 2020 184 104955 10.1016/j.antiviral.2020.104955 33091434 PMC7571425 Choi SW, Shin JS, Park SJ, Jung E, Park YG, Lee J, et al. Antiviral activity and safety of remdesivir against SARS-CoV-2 infection in human pluripotent stem cell-derived cardiomyocytes. Antivir Res. 2020;184: 104955. 33091434 10.1016/j.antiviral.2020.104955 PMC7571425 39. Mok BW Kwok M Li HS Ling L Lai A Yan B SARS-CoV-2 variants divergently infect and damage cardiomyocytes in vitro and in vivo Cell Biosci 2024 14 1 101 10.1186/s13578-024-01280-y 39095802 PMC11297708 Mok BW, Kwok M, Li HS, Ling L, Lai A, Yan B, et al. SARS-CoV-2 variants divergently infect and damage cardiomyocytes in vitro and in vivo. Cell Biosci. 2024;14(1):101. 39095802 10.1186/s13578-024-01280-y PMC11297708 40. Marconi VC Ramanan AV de Bono S Kartman CE Krishnan V Liao R Efficacy and safety of baricitinib for the treatment of hospitalised adults with COVID-19 (COV-BARRIER): a randomised, double-blind, parallel-group, placebo-controlled phase 3 trial Lancet Respir Med 2021 9 12 1407 1418 10.1016/S2213-2600(21)00331-3 34480861 PMC8409066 Marconi VC, Ramanan AV, de Bono S, Kartman CE, Krishnan V, Liao R, et al. Efficacy and safety of baricitinib for the treatment of hospitalised adults with COVID-19 (COV-BARRIER): a randomised, double-blind, parallel-group, placebo-controlled phase 3 trial. Lancet Respir Med. 2021;9(12):1407–18. 34480861 10.1016/S2213-2600(21)00331-3 PMC8409066 41. Sun J Wang S Ma X Wei Q Peng Y Bai Y Efficacy and safety of baricitinib for the treatment of hospitalized adults with COVID-19: a systematic review and meta-analysis Eur J Med Res 2023 28 1 536 10.1186/s40001-023-01403-0 37990249 PMC10661565 Sun J, Wang S, Ma X, Wei Q, Peng Y, Bai Y, et al. Efficacy and safety of baricitinib for the treatment of hospitalized adults with COVID-19: a systematic review and meta-analysis. Eur J Med Res. 2023;28(1): 536. 37990249 10.1186/s40001-023-01403-0 PMC10661565 42. Alsulaim T Alhassan N Khalil H Almutlaq A Tocilizumab effect on lipid profile in correlation to cardiovascular events: a retrospective cohort study Int J Rheumatol 2021 2021 5535486 10.1155/2021/5535486 34422057 PMC8378990 Alsulaim T, Alhassan N, Khalil H, Almutlaq A. Tocilizumab effect on lipid profile in correlation to cardiovascular events: a retrospective cohort study. Int J Rheumatol. 2021;2021:5535486. 34422057 10.1155/2021/5535486 PMC8378990 43. Aljuhani O Al Sulaiman K Korayem GB Altebainawi AF Alsohimi S Alqahtani R The association between tocilizumab therapy and the development of thrombosis in critically ill patients with COVID-19: a multicenter, cohort study Sci Rep 2024 14 1 3037 10.1038/s41598-024-53087-z 38321099 PMC10847412 Aljuhani O, Al Sulaiman K, Korayem GB, Altebainawi AF, Alsohimi S, Alqahtani R, et al. The association between tocilizumab therapy and the development of thrombosis in critically ill patients with COVID-19: a multicenter, cohort study. Sci Rep. 2024;14(1): 3037. 38321099 10.1038/s41598-024-53087-z PMC10847412 44. COVID-19 update: Tocilizumab (Actemra) FDA-approved for treatment of COVID-19. Med Lett Drugs Ther. 2023;65(1667):e9. 10.58347/tml.2023.1667d 36649082 45. Kragstrup TW Glintborg B Svensson AL McMaster C Robinson PC Deleuran B Waiting for JAK inhibitor safety data RMD Open 2022 10.1136/rmdopen-2022-002236 35197363 PMC8867353 Kragstrup TW, Glintborg B, Svensson AL, McMaster C, Robinson PC, Deleuran B, et al. Waiting for JAK inhibitor safety data. RMD Open. 2022. 10.1136/rmdopen-2022-002236. 35197363 10.1136/rmdopen-2022-002236 PMC8867353 46. Kotyla PJ Engelmann M Giemza-Stokłosa J Wnuk B Islam MA Thromboembolic adverse drug reactions in Janus kinase (JAK) inhibitors: does the inhibitor specificity play a role? Int J Mol Sci 2021 10.3390/ijms22052449 33671049 PMC7957632 Kotyla PJ, Engelmann M, Giemza-Stokłosa J, Wnuk B, Islam MA. Thromboembolic adverse drug reactions in Janus kinase (JAK) inhibitors: does the inhibitor specificity play a role? Int J Mol Sci. 2021. 10.3390/ijms22052449. 33671049 10.3390/ijms22052449 PMC7957632 47. Knight R Walker V Ip S Cooper JA Bolton T Keene S Association of COVID-19 with major arterial and venous thrombotic diseases: a population-wide cohort study of 48 million adults in England and Wales Circulation 2022 146 12 892 906 10.1161/CIRCULATIONAHA.122.060785 36121907 PMC9484653 Knight R, Walker V, Ip S, Cooper JA, Bolton T, Keene S, et al. Association of COVID-19 with major arterial and venous thrombotic diseases: a population-wide cohort study of 48 million adults in England and Wales. Circulation. 2022;146(12):892–906. 36121907 10.1161/CIRCULATIONAHA.122.060785 PMC9484653 48. Shuai H Chan JF Hu B Chai Y Yuen TT Yin F Attenuated replication and pathogenicity of SARS-CoV-2 B.1.1.529 Omicron Nature 2022 603 7902 693 699 10.1038/s41586-022-04442-5 35062016 Shuai H, Chan JF, Hu B, Chai Y, Yuen TT, Yin F, et al. Attenuated replication and pathogenicity of SARS-CoV-2 B.1.1.529 Omicron. Nature. 2022;603(7902):693–9. 35062016 10.1038/s41586-022-04442-5 49. Hilser JR Spencer NJ Afshari K Gilliland FD Hu H Deb A COVID-19 is a coronary artery disease risk equivalent and exhibits a genetic interaction with ABO blood type Arterioscler Thromb Vasc Biol 2024 44 11 2321 2333 10.1161/ATVBAHA.124.321001 39381876 PMC11495539 Hilser JR, Spencer NJ, Afshari K, Gilliland FD, Hu H, Deb A, et al. COVID-19 is a coronary artery disease risk equivalent and exhibits a genetic interaction with ABO blood type. Arterioscler Thromb Vasc Biol. 2024;44(11):2321–33. 39381876 10.1161/ATVBAHA.124.321001 PMC11495539 50. Karampitsakos T Papaioannou O Tsiri P Katsaras M Katsimpris A Kalogeropoulos AP Tocilizumab versus baricitinib in hospitalized patients with severe COVID-19: an open label, randomized controlled trial Clin Microbiol Infect 2023 29 3 372 378 10.1016/j.cmi.2022.10.015 36273769 PMC9636985 Karampitsakos T, Papaioannou O, Tsiri P, Katsaras M, Katsimpris A, Kalogeropoulos AP, et al. Tocilizumab versus baricitinib in hospitalized patients with severe COVID-19: an open label, randomized controlled trial. Clin Microbiol Infect. 2023;29(3):372–8. 36273769 10.1016/j.cmi.2022.10.015 PMC9636985 ",
  "metadata": {
    "Title of this paper": "Tocilizumab versus baricitinib in hospitalized patients with severe COVID-19: an open label, randomized controlled trial",
    "Journal it was published in:": "Infectious Diseases and Therapy",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12480238/"
  }
}