{
  "title": "Paper_533",
  "abstract": "pmc Cureus Cureus 2757 cureus Cureus 2168-8184 Cureus Inc. PMC12478982 PMC12478982.1 12478982 12478982 41030718 10.7759/cureus.91268 1 Therapeutics Oncology Dermatology Targeting Photoaging With Heat-Killed Escherichia coli Nissle 1917: A Novel Cellular Model and Anti-photoaging Strategy Muacevic Alexander Adler John R Zandsalimi Farshid 1 Azizi Zahra 1 Mazloomi Mohammad Ali 2 Abdolhosseini Mansoreh 1 Absalan Moloud 1 Tabibian Mobina 3 Motevaseli Elahe 1  1  2  3 Elahe Motevaseli e_motevaseli@tums.ac.ir 29 8 2025 8 2025 17 8 494304 e91268 27 8 2025 29 08 2025 30 09 2025 01 10 2025 Copyright © 2025, Zandsalimi et al. 2025 Zandsalimi et al. https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License CC-BY 4.0., which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. This article is available from https://cureus.com/articles/398680-targeting-photoaging-with-heat-killed-escherichia-coli-nissle-1917-a-novel-cellular-model-and-anti-photoaging-strategy Background: Ultraviolet (UV) radiation is a major contributor to skin aging, manifesting as wrinkles, pigmentation, and structural dysfunction, collectively termed photoaging. Chronic photoaging is strongly linked to an increased risk of skin cancer. Despite the growing demand for effective anti-photoaging agents, a gap remains in both understanding the molecular basis of photoaging and validating the efficacy of new therapeutic candidates. This study aimed to establish a reliable in vitro photoaging model and evaluate the potential anti-photoaging effects of heat-killed Escherichia coli Methods: Human dermal fibroblast (HDF) cells were exposed to UVB radiation three times at one-day intervals. Cell viability was assessed using the MTT assay. Post-irradiation, cells were treated with varying concentrations of heat-killed EcN. Effects were evaluated through live/dead staining, apoptosis assay, cell cycle analysis, and reactive oxygen species (ROS) quantification. Resveratrol (RES), a known anti-inflammatory and anti-aging compound, was used as a reference control. Results: UVB exposure at 0.3 J/cm² reduced HDF cell viability to approximately 50% compared to the control group. Morphological and biochemical assessments validated the photoaging model’s reliability. Treatment with 10% v/v heat-killed EcN and 100 μM RES after each UVB cycle significantly restored cell viability, reduced apoptosis and cell cycle arrest, and markedly decreased intracellular ROS levels. Conclusion: This study demonstrates the efficacy of heat-killed EcN and RES in alleviating UVB-induced photoaging, likely via suppression of oxidative stress and apoptosis. The developed in vitro model offers a robust platform for future investigations into molecular mechanisms of photoaging and the evaluation of emerging photoprotective agents. e. coli nissle 1917 (ecn) photoaging senescence skin ultraviolet (uv) radiation pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction The skin, being continuously exposed to sunlight throughout life, is significantly affected by ultraviolet (UV) radiation. Prolonged and unprotected exposure is a major contributor to premature skin aging, characterized by visible signs such as wrinkles, loss of firmness, and pigmentation, commonly referred to as photoaging [ 1 UV radiation is categorized into three main bands: UVC (100-280 nm), UVB (280-315 nm), and UVA (315-400 nm). UVC, the shortest and most energetic band, is effectively absorbed by the Earth’s atmosphere and thus can be disregarded [ 2 3 As the body’s primary barrier against UV radiation, skin performs a critical defensive role. However, its structure and function decline with age and can be further compromised by repeated or prolonged UV exposure. Over time, numerous synthetic and naturally derived agents have been explored to mitigate UV-related damage, an area of growing interest in both cosmetic and medical science. However, despite these efforts, no fully effective strategy has been established to prevent photoaging. The complexity of its molecular underpinnings and the lack of robust experimental models remain key limitations in advancing this field. Probiotics, defined as live microorganisms that confer health benefits to the host, have a long history of human use [ 4 5 6 7 8 This study investigates the anti-photoaging potential of inactivated Escherichia coli 9 Materials and methods Materials Dulbecco’s modified eagle medium (DMEM), fetal bovine serum (FBS), penicillin-streptomycin (Pen-Strep), phosphate-buffered saline (PBS), and trypsin were procured from Biowest (France). MTT reagent (3-[4,5-dimethylthiazol-2-yl]-2,5-diphenyltetrazolium bromide), dimethyl sulfoxide (DMSO), glycerol, 0.22 μm membrane filters, Luria-Bertani (LB) broth, Annexin V, propidium iodide (PI), resveratrol (RES), acetone, and DCFH-DA (2′,7′-dichlorodihydrofluorescein diacetate) were purchased from Sigma-Aldrich (Germany). Cell culture HDF cells were obtained from the Iranian Biological Resource Center (IBRC), Tehran, Iran. Cells were cultured in DMEM supplemented with 10% FBS and 1% Pen-Strep. Upon reaching 90% confluency, cells were harvested using trypsinization and subsequently passaged for use in downstream experiments. UV radiation HDF cells (1.2 × 10⁵ cells per well) were seeded into six-well culture plates. Once the cultures reached approximately 90% confluency, the culture medium was removed, and cells were washed and covered with a thin layer of PBS. Cells were then exposed to UVB radiation at graded intensities (0.1, 0.2, 0.3, 0.4, 0.5, and 0.6 J/cm²). Following irradiation, fresh complete medium was added to each well, and plates were returned to the incubator. This irradiation protocol was repeated three times for each intensity at 24-hour intervals. This exposure pattern was chosen based on prior studies demonstrating that repeated UVB irradiation induces more robust photoaging markers in fibroblasts than single-dose protocols [ 10 11 Cell viability assay Cell viability was assessed using the standard MTT assay [ 12 Inactivation of E. coli An overnight culture of EcN was grown in LB broth and subsequently centrifuged at 8000 × g for 10 minutes. The resulting pellet was washed three times with sterile PBS. A suspension containing 1 × 10⁸ colony-forming units (CFU)/mL was then subjected to thermal inactivation by incubation at 70 °C for one hour in a water bath. Successful inactivation of EcN was confirmed by inoculating the heated suspension on LB agar plates and verifying the absence of bacterial growth. Effect of heat-killed EcN on irradiated HDF cells To evaluate the protective effect of heat-killed EcN on UVB-irradiated HDF cells, cell viability was assessed using the standard MTT assay. Briefly, 8 × 10³ HDF cells per well were seeded into 96-well plates. Upon reaching approximately 90% confluency, cells were subjected to UVB irradiation. Immediately following exposure, fresh complete culture medium supplemented with different concentrations of inactivated EcN (5, 10, 20, 30, 40, and 50% v/v of final volume) was added to each well. Viability was then measured as previously described using the MTT assay. The concentration of heat-killed EcN that conferred the highest protective effect on irradiated cells was selected for subsequent experiments. Effect of RES on irradiated HDF cells To validate the responsiveness of the In vitro photoaging model, the effect of RES - a natural polyphenolic compound with notable anti-inflammatory properties - was evaluated in irradiated HDF cells. Previous studies have shown that RES can reduce photoaging markers and protect fibroblasts against UV-induced damage [ 13 Live and dead analysis To evaluate the impact of UVB irradiation and the selected treatments on cell viability, PI fluorescent staining was performed. HDF cells (1.2 × 10⁵ cells per well) were seeded into six-well plates and subjected to the UVB irradiation protocol. Following each irradiation cycle, cells were treated with the optimal concentrations of heat-killed EcN and RES, as determined in previous assays. After completion of the treatment cycles, cells were harvested and stained with PI solution to label non-viable cells. The proportion of live versus dead cells was then quantified via flow cytometric analysis. Apoptosis assay Apoptotic cell death in HDF cells was evaluated using Annexin V-FITC/PI dual staining. Briefly, HDF cells were seeded in six-well plates at a density of 1.2 × 10⁵ cells per well. Following the completion of the UVB irradiation and treatment cycles, cells were harvested by trypsinization. Staining was performed by resuspending the collected cells in 1x binding buffer and adding Annexin V-FITC and PI according to the manufacturer’s protocol. After a 15-minute incubation in the dark at room temperature, samples were analyzed using a FACS Calibur flow cytometer (BD Biosciences, San Jose, USA). Cell cycle analysis To evaluate the distribution of cell cycle phases (G₀/G₁, S, and G₂/M), HDF cells were subjected to UVB irradiation and treatment protocols as previously described. After the final cycle, cells were harvested and incubated for 30 minutes with a standard staining solution containing PI, DNase-free RNase, and PBS. DNA content was then analyzed using a BD FACS Calibur flow cytometer (BD Biosciences, San Jose, USA), and the proportion of cells in each cell cycle phase was determined. Reactive oxygen species (ROS) measurement Intracellular reactive oxygen species (ROS) levels in HDF cells were quantified using DCFH-DA staining followed by flow cytometric analysis. Irradiated and treated cells were prepared and harvested as previously described. Cells were then incubated with a solution containing PI and DCFH-DA for 20 minutes at room temperature, protected from light. Fluorescence intensity-indicative of ROS levels-was measured using a BD FACS Calibur flow cytometer (BD Biosciences, San Jose, USA). Statistical analysis All experiments were conducted in triplicate, and data are presented as mean ± standard deviation. Differences between experimental groups were assessed using two-way analysis of variance (ANOVA), followed by Tukey’s post-hoc multiple comparison test. A p-value < 0.05 was considered statistically significant. Graphs were generated using GraphPad Prism 8 (GraphPad Software, LLC). Results Construction of the model To establish a reliable In vitro photoaging model, HDF cells were exposed to escalating doses of UVB radiation. As shown in Figure 1A 1B Figure 1 Effect of UVB on HDF cells. A) The viability of the cells decreased in a dose-dependent manner. B) 0.3 J/cm 2 HDF: human dermal fibroblast Effect of heat-killed EcN on irradiated HDF cells To assess the protective effects of heat-killed EcN on UVB-irradiated HDF cells, various concentrations of the extract were introduced into the culture medium following each irradiation cycle. Cell viability was then evaluated using the MTT assay. As illustrated in Figure 2 Figure 2 Effect of different concentrations of heat-killed EcN on the viability of irradiated HDF cells. 10% v/v had the maximum protective effect. * shows significance level compared to the control group (*p < 0.05, **p < 0.01, and ***p < 0.001). Hk EcN: heat-killed Escherichia coli Effect of RES on irradiated HDF cells The protective effect of RES, a well-characterized anti-inflammatory polyphenol, was evaluated in UVB-irradiated HDF cells using the MTT assay. As shown in Figure 3 Figure 3 Effect of different concentrations of RES on the viability of irradiated HDF cells. RES restored the viability of irradiated HDF cells in a dose-dependent manner. * shows significance level compared to the control group (*p < 0.05, **p < 0.01, and ***p < 0.001). RES: resveratrol, HDF: human dermal fibroblast Live and dead analysis To compare the protective effects of heat-killed EcN and RES on UVB-irradiated HDF cells, PI staining was performed. Following each UVB irradiation cycle, cells were treated with fresh medium containing 10% v/v heat-killed EcN or 100 μM RES. At the conclusion of the radiation protocol, the proportion of live and dead cells was quantified. As shown in Figure 4 Figure 4 Live and dead analysis using PI staining. A) Flow cytometry plots. B) Quantitative comparison of live and dead cells in the studied groups. Control: HDF cells, UVB: irradiated HDF cells (0.3 J/cm2), Hk EcN: irradiated HDF cells treated with 10% v/v heat-killed E. coli PI: propidium iodide, HDF: human dermal fibroblast, EcN: Escherichia coli Apoptosis assay To evaluate the capacity of the developed photoaging model to induce apoptosis and the potential protective effects of heat-killed EcN and RES, HDF cells were analyzed using Annexin V-FITC/PI staining. UVB irradiation alone induced substantial apoptosis in HDF cells, with a combined early and late apoptotic rate of 47%. Necrotic cell death was also elevated, reaching 3.24%. Treatment with 10% v/v heat-killed EcN and 100 μM RES after each UVB exposure significantly reduced apoptosis. Apoptotic rates decreased to 14.5% and 11.4% in EcN- and RES-treated groups, respectively. Furthermore, necrosis was markedly suppressed in both treatment conditions, dropping to 0.99% for EcN and 0.48% for RES (Figure 5 Figure 5 Apoptosis assay. A) Flow cytometry plots. B) Quantitative comparison of the studied groups. * shows significance level compared to the control group (*p < 0.05, **p < 0.01, and ***p < 0.001). Control: HDF cells, UVB: irradiated HDF cells (0.3 J/cm2), Hk EcN: irradiated HDF cells treated with 10% v/v heat-killed E. coli HDF: human dermal fibroblast, EcN: Escherichia coli Cell cycle analysis Cell cycle distribution across experimental groups was analyzed and compared, as shown in Figure 6 Figure 6 Cell cycle analysis. A) Flow cytometry plots. B) Quantitative comparison of cell cycle phases, including G0/G1, S, and G2/M, in the studied groups. Control: HDF cells, UVB: irradiated HDF cells (0.3 J/cm2), Hk EcN: irradiated HDF cells treated with 10% v/v heat-killed E. coli HDF: human dermal fibroblast, EcN: Escherichia coli Reactive oxygen species (ROS) measurement Intracellular ROS levels in HDF cells were quantified using DCFH-DA staining, followed by flow cytometric analysis. Compared to the non-irradiated control group (ROS level: 96.7), UVB irradiation significantly elevated ROS production, reaching 524 arbitrary units. Treatment with 10% v/v heat-killed EcN and 100 μM RES markedly reduced ROS accumulation, with levels dropping to 145 and 141, respectively, indicating substantial antioxidant and cytoprotective effects (Figure 7 Figure 7 ROS level measurement. A) Flow cytometry plots. B) Quantitative comparison of ROS levels in the studied groups. * shows significance level compared to the control group (*p < 0.05, **p < 0.01, and ***p < 0.001). Control: HDF cells, UVB: irradiated HDF cells (0.3 J/cm2), Hk EcN: irradiated HDF cells treated with 10% v/v heat-killed E. coli ROS: reactive oxygen species, HDF: human dermal fibroblast, EcN: Escherichia coli Nissle 1917 Discussion A reliable in vitro model of photoaging was established in this study. We showed that 0.3 J/cm² of UV-B radiation would decrease the viability of fibroblast cells to 50% of normal. The induction of photoaging in the model was confirmed by microscopy appraisal, as well as live and dead staining, apoptosis assay, cell cycle analysis, and ROS measurement. Functional analysis of the established model also revealed that the treatment of fibroblast cells with 10% v/v heat-killed EcN and 100 μM RES after each UVB cycle significantly restored cell viability, reduced apoptosis and cell cycle arrest, and markedly decreased intracellular ROS levels. UV radiation remains the most prevalent and detrimental external threat to skin health. While moderate exposure to UV contributes to beneficial physiological processes such as vitamin D synthesis and endorphin production, excessive irradiation is a major risk factor for skin disorders, including cancer [ 14 15 16 Over recent decades, a wide array of anti-UV agents has been developed to chemically, physically, or synergistically mitigate UV damage [ 17 18 This study aimed to construct a reliable In vitro photoaging model using HDF cells subjected to varying doses of UVB radiation. Fibroblasts play a vital role in skin integrity through their secretion of extracellular matrix (ECM) components, such as collagen and elastin, as well as their involvement in inflammation via cytokine and chemokine production. Cellular senescence or UV-induced damage can severely impair these functions, contributing to photoaging [ 19 20 The established model was then used to evaluate the anti-photoaging potential of heat-killed EcN and RES. Both treatments demonstrated significant protective effects, as evidenced by PI staining and flow cytometry, which revealed reduced cytotoxicity following UVB exposure. Apoptosis and cell cycle analyses indicated that EcN and RES mitigated UVB-induced damage by suppressing apoptosis and alleviating cell cycle arrest. UVB-induced apoptosis proceeds via both intrinsic and extrinsic pathways, commonly initiated by DNA damage and activation of p53-regulated pro-apoptotic genes including BAX, PUMA, and NOXA [ 21 22 23 The anti-apoptotic effects of EcN and RES appear to be linked to their ability to reduce intracellular ROS. UVB exposure led to a pronounced accumulation of ROS, which regulates a network of signaling cascades that drive senescence and cell death. For example, ROS-mediated activation of MAPK signaling increases AP-1 activity through ERK and p38 pathways, thereby enhancing MMP expression and collagen degradation - hallmarks of photoaging [ 24 21 25 The antioxidant capacity of EcN and RES has been previously reported. EcN's therapeutic potential in IBD is attributed to its ROS-scavenging activities via antioxidant enzymes such as superoxide dismutase (SOD) and catalase (CAT) [ 26 27 Lactobacillus rhamnosus L. rhamnosus 28 29 Limitations of the study This study mainly focused on the development of an In vitro model to assess the anti-photoaging property of elements. The primary function of the model was also investigated using heat-killed EcN. While this objective and the presented findings valuably provide a basis for future studies, there are some limitations that should be considered. The signaling pathways affected by UVB radiation and the impact of treatments on these pathways were not appraised. Such an investigation could be seen as an extra authenticator of the function of the photoaging model. More molecular assessments could also expand our knowledge about UVB-skin interaction and involved mechanisms. In addition, here we did not investigate the mechanisms underlying the anti-photaging effect of heat-killed EcN on UV-B irradiated fibroblast cells. Furthermore, we did not try to develop a clinical approach for topical applications of heat-killed EcN. Although finding ways to formulate and clinical applications of heat-killed EcN was out of the scope of this study, this is a critical step in the commercialization of this product. In sum, subsequent detailed studies on the suggested model and clinical utilization of the proposed treatments are planned and strongly encouraged. Conclusions This study establishes a robust in vitro model for evaluating the anti-photoaging properties of active compounds in HDF cells. The model’s performance was validated through a series of morphological, biochemical, and molecular assessments. Using this platform, heat-killed EcN and RES demonstrated notable anti-photoaging activity by suppressing UVB-induced apoptosis and reducing intracellular ROS levels. These findings provide a foundation for future investigations aimed at assessing additional bioactive compounds with photoprotective potential. Moreover, the development of molecular markers to further characterize photoaging responses represents a promising direction for expanding the applicability of this model in dermatological research and therapeutic development. The authors want to thank all those who warmly contributed to this work, specifically, the members of the Department of Molecular Medicine, School of Advanced Technologies in Medicine, Tehran University of Medical Sciences, Tehran, Iran, for their support. Disclosures Human subjects: Animal subjects: Conflicts of interest: Payment/services info: Financial relationships: Other relationships: Author Contributions Concept and design: Acquisition, analysis, or interpretation of data: Drafting of the manuscript: Critical review of the manuscript for important intellectual content: Supervision: References 1 Unveiling the dual-edged roles of melanocytes: key insights into skin photoaging and therapeutic avenues Pharmacol Res Jia X He L 107848 218 2025 40614794 10.1016/j.phrs.2025.107848 2 Inflammatory molecules associated with ultraviolet radiation-mediated skin aging Int J Mol Sci Ansary TM Hossain MR Kamiya K Komine M Ohtsuki M 22 2021 10.3390/ijms22083974 PMC8069861 33921444 3 Ultraviolet radiation biological and medical implications Curr Issues Mol Biol Al-Sadek T Yusuf N 1924 1942 46 2024 38534742 10.3390/cimb46030126 PMC10968857 4 Mechanisms of action of probiotics Adv Nutr Plaza-Diaz J Ruiz-Ojeda FJ Gil-Campos M Gil A 0 66 10 2019 10.1093/advances/nmy063 PMC6363529 30721959 5 Isolation and molecular identification of a cellulotic bacterium from muncipal waste and investigation of its cellulase production Biosci J Zamani H Salehzadeh A Abdolhosseini M 761 768 2018 6 Probiotics in cosmetic and personal care products: trends and challenges Molecules Puebla-Barragan S Reid G 26 2021 10.3390/molecules26051249 PMC7956298 33652548 7 The concept of postbiotics Foods Vinderola G Sanders ME Salminen S 11 2022 10.3390/foods11081077 PMC9027423 35454664 8 Bacillus subtilis supernatant improves the efficacy of radiation therapy in rat intestinal epithelial cells by upregulation of bax and caspase-3 genes Mol Biol Rep Nazari N Zandsalimi F Abdolhosseini M Ghahremani MH Motevaseli E 7639 7647 50 2023 37528313 10.1007/s11033-023-08694-w 9 Probiotic Escherichia coli NISSLE 1917 for inflammatory bowel disease applications Food Funct Zhao Z Xu S Zhang W Wu D Yang G 5914 5924 13 2022 35583304 10.1039/d2fo00226d 10 An in vitro model for fibroblast photoaging comparing single and repeated UVA irradiations Photochem Photobiol Nakyai W Saraphanchotiwitthaya A Viennet C Humbert P Viyoch J 1462 1471 93 2017 28599356 10.1111/php.12801 11 Effects of repeated UVA irradiation on human skin fibroblasts embedded in 3D tense collagen matrix Photochem Photobiol Nakyai W Tissot M Humbert P Grandmottet F Viyoch J Viennet C 715 724 94 2018 29421845 10.1111/php.12895 12 Cell viability assays Assay Guidance Manual [Internet] Riss TL Moravec RA Niles AL Bethesda (MD) Eli Lilly & Company and the National Center for Advancing Translational Sciences 2016 https://www.ncbi.nlm.nih.gov/books/NBK144065/ 13 Resveratrol treats UVB‐induced photoaging by anti‐MMP expression, through anti‐inflammatory, antioxidant, and antiapoptotic properties, and treats photoaging by upregulating VEGF‐B expression Oxid Med Cell Longev Cui B Wang Y Jin J 6037303 2022 2022 35028009 10.1155/2022/6037303 PMC8752231 14 Current insights and future perspectives of ultraviolet radiation (UV) exposure: friends and foes to the skin and beyond the skin Environ Int Tang X Yang T Yu D Xiong H Zhang S 108535 185 2024 38428192 10.1016/j.envint.2024.108535 15 The impact of ultraviolet radiation on skin photoaging - review of in vitro studies J Cosmet Dermatol Gromkowska-Kępka KJ Puścion-Jakubik A Markiewicz-Żukowska R Socha K 3427 3431 20 2021 33655657 10.1111/jocd.14033 PMC8597149 16 Prolonged DNA damage at suberythemal UV dose - dependency on skin type and age J Photochem Photobiol B Zamudio Díaz DF Schleusener J Pacagnelli Infante VH 113206 270 2025 40617063 10.1016/j.jphotobiol.2025.113206 17 Molecular basis of skin photoaging and therapeutic interventions by plant-derived natural product ingredients: a comprehensive review Heliyon Tanveer MA Rashid H Tasduq SA 0 9 2023 10.1016/j.heliyon.2023.e13580 PMC9988502 36895391 18 Caenorhabditis elegans as a model to study aging and photoaging Biomolecules Jeayeng S Thongsroy J Chuaijit S 14 2024 10.3390/biom14101235 PMC11505728 39456168 19 Regulatory mechanisms of natural active ingredients and compounds on keratinocytes and fibroblasts in mitigating skin photoaging Clin Cosmet Investig Dermatol Hu X Chen M Nawaz J Duan X 1943 1962 17 2024 10.2147/CCID.S478666 PMC11368101 39224224 20 Molecular mechanisms of UVB-induced senescence of dermal fibroblasts and its relevance for photoaging of the human skin Exp Gerontol Cavinato M Jansen-Dürr P 78 82 94 2017 28093316 10.1016/j.exger.2017.01.009 21 Effects of ultraviolet irradiation on cellular senescence in keratinocytes versus fibroblasts J Craniofac Surg Moon KC Yang JP Lee JS Jeong SH Dhong ES Han SK 270 275 30 2019 30444781 10.1097/SCS.0000000000004904 22 DNA damage responses and p53 in the aging process Blood Ou HL Schumacher B 488 495 131 2018 29141944 10.1182/blood-2017-07-746396 PMC6839964 23 Apoptosis and necrosis of lymphocytes induced by UV-radiation in the presence of autological plasma Tsitologiia Artiukhov V Zemchenkova O Basharina O 77 83 56 2014 25509146 24 Tiron inhibits UVB-induced AP-1 binding sites transcriptional activation on MMP-1 and MMP-3 promoters by MAPK signaling pathway in human dermal fibroblasts PLoS One Lu J Guo JH Tu XL Zhang C Zhao M Zhang QW Gao FH 0 11 2016 10.1371/journal.pone.0159998 PMC4972414 27486852 25 Activation of the JNKs/ATM-p53 axis is indispensable for the cytoprotection of dermal fibroblasts exposed to UVB radiation Cell Death Dis Mavrogonatou E Angelopoulou M Rizou SV Pratsinis H Gorgoulis VG Kletsas D 647 13 2022 35879280 10.1038/s41419-022-05106-y PMC9314411 26 Oral administration of nanozyme-armed probiotic Escherichia coli Nissle 1917 with ROS scavenging for inflammatory bowel disease therapy ChemEng J Cui T Li B Lou Z 164949 2025 27 Factors derived from Escherichia coli Nissle 1917, grown in different growth media, enhance cell death in a model of 5-fluorouracil-induced Caco-2 intestinal epithelial cell damage Nutr Cancer Wang H Bastian SE Lawrence A Howarth GS 316 326 67 2015 25625670 10.1080/01635581.2015.990570 28 Heat‐killed Lactobacillus rhamnosus ATCC 7469 improved UVB‐induced photoaging via antiwrinkle and antimelanogenesis impacts Photochem Photobiol Zhang X Xu J Ma M 1318 1331 99 2023 36588480 10.1111/php.13775 29 Role of resveratrol in regulation of cellular defense systems against oxidative stress Biofactors Truong VL Jun M Jeong WS 36 49 44 2018 29193412 10.1002/biof.1399 ",
  "metadata": {
    "Title of this paper": "Role of resveratrol in regulation of cellular defense systems against oxidative stress",
    "Journal it was published in:": "Cureus",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478982/"
  }
}