{
  "title": "Paper_112",
  "abstract": "pmc JMIR Med Educ JMIR Med Educ 3099 jmirme mededu JMIR Medical Education 2369-3762 JMIR Publications Inc. PMC12490813 PMC12490813.1 12490813 12490813 10.2196/78862 78862 1 New Methods and Approaches in Medical Education e-Learning and Digital Medical Education Teamwork Continuing Medical Education (CME) for Allied Health Professionals Research Training Peer-Learning in Medical and Health Education Original Paper Effectiveness of a Fully Online Scientific Research Works Peer Support Group Model for Research Capacity Building Through Conducting Systematic Reviews Among Health Care Professionals: Retrospective Cohort Studies https://orcid.org/0000-0001-7982-5213 Kataoka Yuki MD, MPH, DrPH 1 2 3 4 5 6 https://orcid.org/0000-0002-9838-350X So Ryuhei MD, MPH, DrPH 1 7 8 https://orcid.org/0000-0002-2539-1031 Banno Masahiro MD, PhD 1 9 https://orcid.org/0000-0002-7214-5589 Tsujimoto Yasushi MD, MPH, DrPH 1 10 11 SRWS-PSG Mentors 1 1 Scientific Research WorkS Peer Support Group 12-12 Osaka Ekimae Dai-2 Building 1-2-2 Umeda, Kita-ku Osaka 5300001 Japan 81 757016111 2 Center for Postgraduate Clinical Training and Career Development Nagoya University Hospital Aichi Japan 3 Center for Medical Education Graduate School of Medicine, Nagoya University Aichi Japan 4 Department of Internal Medicine Kyoto Min-iren Asukai Hospital Kyoto Japan 5 Department of Healthcare Epidemiology Kyoto University Graduate School of Medicine/School of Public Health Kyoto Japan 6 Department of International and Community Oral Health Tohoku University Graduate School of Dentistry Miyagi Japan 7 Department of Psychiatry Okayama Psychiatric Medical Center Okayama Japan 8 CureApp, Inc. Tokyo Japan 9 Department of Psychiatry and Neurology Seichiryo Hospital Nagoya Japan 10 Oku Internal Medicine Clinic Osaka Japan 11 Department of Health Promotion and Human Behavior Kyoto University Graduate School of Medicine/School of Public Health Kyoto Japan Lesselroth Blake Yuki Kataoka, MD, MPH, DrPH, Scientific Research WorkS Peer Support Group, 12-12 Osaka Ekimae Dai-2 Building 1-2-2 Umeda, Kita-ku, Osaka, 5300001, Japan, 81 757016111 youkiti@gmail.com 2025 2 10 2025 11 479436 e78862 12 6 2025 13 8 2025 09 9 2025 02 10 2025 03 10 2025 03 10 2025 Copyright © Yuki Kataoka, Ryuhei So, Masahiro Banno, Yasushi Tsujimoto, SRWS-PSG mentors. Originally published in JMIR Medical Education (https://mededu.jmir.org) 2025 https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License ( https://creativecommons.org/licenses/by/4.0/ https://mededu.jmir.org/ Abstract Background Research capacity building (RCB) among health care professionals remains limited, particularly for those working outside academic institutions. Japan is experiencing a decline in original clinical research due to insufficient RCB infrastructure. Our previous hospital-based workshops were effective but faced geographical and sustainability constraints. We developed a fully online Scientific Research Works Peer Support Group (SRWS-PSG) model that addresses geographical and time-bound constraints and establishes a sustainable economic model. Mentees use online materials, receive support from mentors via a communication platform after formulating their research question, and transition into mentors upon publication. Objective We evaluated whether our model’s theoretical benefits translated into actual program effectiveness in RCB among health care professionals. Methods We conducted a retrospective cohort study of health care professionals who participated in the SRWS-PSG program between September 2019 and January 2025. Mentees progressed through a structured modular curriculum covering systematic review methodology, from protocol development to manuscript preparation, with personalized mentoring support. We evaluated manuscript submission, program discontinuation, promotion to a mentor status, and mentor response time. We collected data from program records and chat logs. Manuscript submission was defined as mentor-confirmed submission of a systematic review manuscript to a peer-reviewed journal. Program discontinuation referred to formal withdrawal before manuscript submission. Mentor promotion was defined as acceptance of an invitation to serve as a junior mentor after manuscript submission. Mentor response time was the elapsed time from a mentee’s question in the chat to the first reply by an assigned mentor. Results Of 85 mentees analyzed, 31 (36.5%) held academic degrees (PhD or MPH), and 68 (80%) were medical doctors. During a median follow-up of 10 months, 51 (60%) submitted manuscripts and 46 (90%) became mentors. Ten mentees (12%) discontinued the program. The median mentor response time was 0.8 hours, with 90% responding within 24 hours. Conclusions A majority of participants of SRWS-PSG submitted manuscripts. This fully online RCB program might address geographical barriers and provides an adaptable approach for RCB across diverse health care contexts. Keywords research capacity building online education systematic review peer support group health care professionals mentoring e-learning pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf no pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Research capacity building (RCB) among health care professionals is essential for addressing clinical challenges and improving health care quality. Cooke’s RCB framework [ 1 2 3 RCB programs for practicing health care professionals outside academic institutions remain limited [ 2 4 5 6 7 8 9 10 11 We previously developed a structured, in-person scholarly productive model workshop for hospital-based health care staff between 2014 and 2017 [ 11 While the need for RCB for health care professionals is clear, scalable and sustainable programs remain scarce, particularly for those outside academic institutions in Japan. This study, therefore, aimed to evaluate the effectiveness of our fully online and economically self-sustaining SRWS-PSG model. Our research question was “How effective is this program in enabling health care professionals to complete and submit systematic reviews?” To address this, we conducted a retrospective cohort study analyzing data from participants enrolled between 2019 and 2025. We hypothesized that this peer-supported, online model would demonstrate a high proportion of manuscript submission and program continuation, validating its utility as a scalable RCB solution. The findings are intended to inform medical educators, hospital administrators, and health policymakers seeking to develop and implement effective RCB programs. Methods Study Design We conducted a retrospective cohort study of health care professionals who participated in the SRWS-PSG program between September 2019 and January 2025. The SRWS-PSG is designed specifically to support health care professionals from any discipline in conducting systematic reviews as their primary research output. The SRWS-PSG program is now operated by the SRWS-PSG, a non-profit general incorporated association registered in Japan (corporate Number: 6120005024588). The mission is to increase clinical research in Japan. The members consist of health care professionals, and it is funded through membership and mentorship fees. The program provides a structured, modular curriculum covering the entire systematic review process, from protocol development to manuscript submission. Learning is facilitated through self-paced online materials and personalized, responsive mentorship via a communication platform. We applied Cooke’s RCB framework [ 1 12 Setting This study was conducted in a fully online environment. We recruited participants through social media, websites, academic conferences, and referrals from previous participants. The primary registration portal was CAMPFIRE, a Japanese crowdfunding platform [ 13 Participants As of 2025, the SRWS-PSG uses a tiered membership structure with different levels of engagement and fee schedules. Entry-level “members” pay 500 yen (3‐4 US$) per month to access educational materials and participate in research-related discussions through a Facebook group. “Mentees” pay 8900 yen (around 60 US$) per month for comprehensive mentoring support throughout their systematic review projects. Mentees who submit their manuscript to a peer-reviewed journal are invited to become mentors—with waived fees and compensation—if their two assigned mentors assess them as suitable for the role based on their aptitude for chat-based communication ( Figure 1 Figure 1. The Scientific Research Works Peer Support Group (SRWS-PSG) membership structure. In this study, we analyzed mentees who were health care professionals from various disciplines including physicians, nurses, pharmacists, physical therapists, clinical psychologists, and registered dietitians. All mentees could communicate online, had research questions suitable for systematic review topics, and agreed to participate. None had conducted a systematic review as the lead author. We excluded those withdrew before program initiation or did not complete initial training. The cumulative incidences of manuscript submission and discontinuation of the program, stratified by university affiliation, are plotted with 95% CIs. Shaded areas represent the 95% CIs. Curriculum The SRWS-PSG curriculum uses outcome-based learning objectives to enable health care professionals to conduct systematic reviews and publish in peer-reviewed journals [ 14 Multimedia Appendix 1 15 16 The instructional methodology combines asynchronous self-paced learning with responsive mentoring support. Mentees first view 10 to 30 minutes of video content explaining systematic review concepts and methodologies. Mentees then draft specific sections of their research protocols—structured tasks with concrete deliverables. Each mentee receives personalized feedback from two assigned mentors—a junior and a senior mentor—through Slack, a business-oriented chat application [ 17 To enhance learning through practical application, members actively contribute to other mentees’ projects. This approach leverages the systematic review methodology’s requirement for independent dual assessment of article screening, data extraction, and risk of bias evaluation [ 18 Outcomes Overview We selected four outcomes based on data available from our existing program records. These outcomes partially reflect key dimensions of Cooke’s RCB framework [ 1 Manuscript Submission Manuscript submission was defined as the time from mentor approval of the mentee’s research question to start the protocol to the submission of systematic review manuscripts to academic journals. Mentees self-reported manuscript submission with mentor confirmation. Program Discontinuation Discontinuation was defined as when a mentee formally notified the program of their withdrawal, leading to the cessation of monthly program fee payments prior to manuscript submission. Promotion to a Mentor Promotion to mentor status was evaluated by determining the proportion of manuscript-submitting mentees who accepted the invitation to become a junior mentor after being assessed as suitable by their assigned mentors. This transition was documented in program administration records. Mentor Response Time The mentor response time was defined as the time from a mentee posting a question in a designated Slack channel to the first response from any assigned mentor in the same channel. Data were extracted from Slack chat logs. Study Size We included all mentees during the program operation period, without formal sample size calculation. This size was similar to that in other research capacity development program evaluation studies [ 19 20 Statistical Analysis We used descriptive statistics to summarize participant characteristics, continuation rate, and mentor response time. Manuscript submission and publication were analyzed as time-to-event outcomes. We estimated the cumulative incidence functions for both submission and publication using the Aalen-Johansen estimator [ 21 lifelines scikit-survival cmprsk Ethical Considerations The Ethics Committee of Kyoto Min-iren Asukai Hospital approved the study protocol (Approval number: 202502‐3) and waived the need for individual informed consent. The waiver was granted because this retrospective study analyzed routinely collected clinical data without any direct contact or intervention, posed no more than minimal risk to participants, and obtaining consent from all eligible patients would have been impracticable. All procedures complied with the institutional ethics standards and the Declaration of Helsinki. To protect privacy and confidentiality, the analytic dataset was deidentified before analysis: direct identifiers were removed. Study data were kept on access-controlled servers. Results Participants During the study period, 118 individuals registered. After excluding 33 participants (30 who failed initial training for formulating research questions, and 3 who did not start), 85 mentees entered the final analysis. Of 85 mentees, 31 (36.5%) held academic degrees (PhD: 27, MPH: 2, PhD and MPH: 2), and 44 (51.8%) were working at university-affiliated hospitals. Sixty-eight (80%) were medical doctors, and 17 (20%) represented other health care professions: physical therapists (n=8), pharmacists (n=3), clinical psychologists (n=2), nurses (n=1), registered dietitians (n=1), dentists (n=1), and unspecified (n=1). No mentees had missing follow-up data. Outcomes During a median follow-up of 10 months (range, 0‐54 months), 51 mentees (60%) submitted manuscripts. Forty-six (90%) became mentors. Ten (12%) discontinued. Discontinuation reasons included work commitments (n=4), workplace change (n=2), unclear (n=2), personal reasons (n=1), and competing systematic review publication (n=1). Twenty-four mentees continue projects. Cumulative manuscript submission reached 75.2% (95% CI 62.1%‐84.3%), and cumulative discontinuation was 18% (95% CI 9.3%‐28.9%) at the end of follow-up ( Figure 2 Figures3 5 Multimedia Appendix 2 The Annals of Translational Medicine Figure 2. Cumulative incidence of manuscript submission and discontinuation of the program are plotted with 95% CIs. Shaded areas represent the 95% CIs. Figure 3. Cumulative incidence of manuscript submission and discontinuation of the program, stratified by the presence or absence of an academic degree (PhD or MPH), are plotted with 95% CIs. Shaded areas represent the 95% CIs. Figure 4. Cumulative incidences of manuscript submission and discontinuation of the program, stratified by profession (medical doctor or non-medical doctor), are plotted with 95% CIs. Shaded areas represent the 95% CIs. Figure 5. Cumulative incidences of manuscript submission and discontinuation of the program, stratified by university affiliation, are plotted with 95% CIs. Shaded areas represent the 95% CIs. Discussion Principal Results The principal finding is that our fully online, peer-supported RCB model might contribute to actual research outputs for health care professionals. Specifically, cumulative manuscript submission reached 75.2% at the end of follow-up, while cumulative discontinuation remained at 18%. The publications appeared in journals indexed in the Web of Science, with a median citation count of 6 (range 0‐60), indicating initial uptake. The rapid mentor responsiveness (median 0.8 hours) further contributed to program effectiveness. Ninety percent of mentees who submitted manuscripts transitioned to mentors. These quantitative outcomes provide a foundation for the subsequent discussion of the program’s effectiveness through the lens of Cooke’s RCB framework [ 1 While we did not set specific a priori cut-offs for outcomes, we consider the observed outcomes meaningful. Of note, we view discontinuation as a particularly critical metric because it directly reflects program adequacy—participants who leave the program cannot achieve the primary outcome of manuscript submission. The reasons for discontinuation (work commitments, workplace changes, personal reasons, and competing publications) were all external factors beyond the scope of SRWS-PSG’s organizational support, suggesting that the program’s support structure itself was adequate. Implications of Findings Research-novice medical professionals were able to participate in the SRWS-PSG program. Our subgroup analyses demonstrated that manuscript submission rates were similar regardless of participants’ academic degrees, professional backgrounds, or institutional affiliations. The program’s fully online format addresses geographical and temporal constraints, enabling flexible participation around clinical duties. Rapid mentor feedback provides continuous support for novices navigating the systematic review process. This accessibility suggests that the SRWS-PSG model might expand RCB opportunities beyond traditional academic boundaries. Hospital administrators seeking to foster their medical professionals’ research competency could provide protected time for SRWS-PSG participation. The primary reasons for program discontinuation were external factors such as work commitments and workplace changes rather than program inadequacy. Institutional support through protected time could address these barriers and enhance completion rates [ 6 The SRWS-PSG model’s features suggest broad applicability across diverse global contexts, including low- and middle-income countries. The fully online format eliminates geographical barriers and infrastructure requirements, while the focus on systematic reviews—requiring only internet access without expensive equipment or data collection costs—makes research accessible in resource-limited settings. The self-sustaining economic model through participant fees offers an alternative to scarce grant funding. While implementation would require translation and fee adjustment to local contexts, the core elements—peer support, standardized methodology following international guidelines, and progression from mentee to mentor—address universal challenges in RCB regardless of economic or cultural setting. Comparison to the Literature Our findings extend previous RCB evaluations in several ways. The SRWS-PSG model’s continuous feedback approach shares elements with intensive programs like writing boot camps [ 22 20 Mentees formulated research questions directly relevant to their clinical environments, bridging research and practice in ways that promote Boyer’s scholarship concept of “integration” and “application” [ 23 The self-supporting economic model offers a sustainable alternative to grant-dependent programs. Mentee fees fund mentor compensation and administrative costs. This enables 5 years of operation without external funding. Many RCB programs require institutional or funding support [ 2 24 Limitations and Future Directions This study has several limitations. First, this retrospective observational study without a control group cannot establish causality. Although continuous program improvements pose a challenge for evaluation, a rigorously designed well-powered randomized controlled trial is the necessary next step to definitively assess the efficacy. Second, our metrics emphasized outputs such as submission but did not directly evaluate some dimensions of Cooke’s framework. Specifically, we did not assess changes in individual research skills (including systematic review methodology competency beyond evidence-based medicine competency [ 25 6 Looking forward, we are exploring large language models as a “third mentor” [ 26 27 28 29 30 Conclusion A majority of health care professionals who participated in the SRWS-PSG program submitted manuscripts with low discontinuation rates. This model might address geographical barriers and create a self-sustaining financial structure, providing an adaptable approach for RCB across health care contexts. Future research should incorporate a more comprehensive evaluation of program mechanisms and outcomes. Supplementary material 10.2196/78862 Multimedia Appendix 1 Scientific Research Works Peer Support Group (SRWS-PSG) curriculum. 10.2196/78862 Multimedia Appendix 2 Published articles from Scientific Research Works Peer Support Group (SRWS-PSG) mentees. Acknowledgments We would like to express our gratitude to all SRWS-PSG participants and mentors who contributed to this program over the years. Special thanks to Chisato Fujiwara for her invaluable secretarial assistance. We used Claude 4.0 Opus for English Editing. All authors reviewed the final manuscript. Open Access publication supported by Tohoku University FY2025 APC Support Program. Data Availability: Authors’ Contributions: Tetsuro Aita, MD, PhD (ORCID https://orcid.org/0000-0002-1693-361X) 1. Department of General Internal Medicine and Family Medicine, Fukushima Medical University, 1 Hikarigaoka, Fukushima City, Fukushima, 960-1295, Japan 2. Scientific Research Works Peer Support Group (SRWS-PSG), Osaka, Japan. Takashi Ariie, PT, PhD (ORCID:https://orcid.org/0000-0003-1457-3427) 1. Department of Physical Therapy, School of Health Sciences at Fukuoka, International University of Health and Welfare, 137-1 Enokizu, Okawa-shi, Fukuoka, 831-8501, Japan 2. Scientific Research Works Peer Support Group (SRWS-PSG), Osaka, Japan. Eriya Imai, MD (ORCID: https://orcid.org/0000-0002-4511-4672) 1. Division of Anesthesia, Mitsui Memorial Hospital, Kanda-Izumi-cho-1, Chiyoda-ku, Tokyo 101-8643, Japan 2. International University of Health and Welfare Graduate School of Public Health,Tokyo, Japan. 4-1-26 Akasaka, Minato City, Tokyo 107-8402, Japan. Kyosuke Kamijo, MD (ORCID: https://orcid.org/0000-0001-7375-7651) 1.Department of Obstetrics and Gynecology, Nagano Prefectural Shinshu Medical Center, 1332 Suzaka, Suzaka, 382-8577, Japan. 2. Scientific Research Works Peer Support Group (SRWS-PSG), Osaka, Japan m10025kk@jichi.ac.jp Ryota Kimura, MD, PhD (ORCID https://orcid.org/0000-0002-4855-3283) 1. Department of Orthopedic Surgery, Akita University Graduate School of Medicine, 1-1-1 Hondo, Akita, Akita, 010-8543, Japan 2. Scientific Research Works Peer Support Group (SRWS-PSG), Osaka, Japan. Takashi Kitagawa, PT, PhD 1. Department of Physical Therapy, School of Health Sciences, Shinshu University, 3-1-1 Asahi, Matsumoto, 390-8621 Japan 2. Scientific Research Works Peer Support Group (SRWS-PSG), Osaka, Japan. Shunsuke Kondo, MD (https://orcid.org/0009-0007-3372-010X) 1. Department of Medicine, John A Burns School of Medicine, Honolulu, Hawaii, 96813, US 2. Scientific Research Works Peer Support Group (SRWS-PSG), Osaka, Japan. Kazumasa Kotake, BS (ORCID: https://orcid.org/0000-0001-9869-1177) 1. Department of Pharmacy, Zikei Hospital/Zikei Institute of Psychiatry, 100-2 Urayasu Honmachi, Minami-Ku, Okayama-shi, Okayama, 702-8508, Japan 2. Scientific Research Works Peer Support Group (SRWS-PSG), Osaka, Japan. Yasutaka Kuniyoshi, MD, PhD (ORCID: https://orcid.org/0000-0001-6012-0037) 1. Department of Social Services and Healthcare Management, International University of Health and Welfare, Otawara, Tochigi 324-8501, Japan 2. Scientific Research Works Peer Support Group (SRWS-PSG), Osaka, Japan. Naoto Kuroda, MD, PhD 1. Department of Pediatrics, Wayne State University, Detroit, MI, USA 2. Scientific Research Works Peer Support Group (SRWS-PSG), Osaka, Japan. Ryo Momosaki MD, MPH, PhD (ORCID: https://orcid.org/0000-0003-3274-3952) 1. Department of Rehabilitation Medicine, Mie University Graduate School of Medicine, Edobashi 2-174, Tsu, Mie 514-8507 Japan 2. Scientific Research Works Peer Support Group (SRWS-PSG), Osaka, Japan. Takeshi Nakata, MD, PhD 1. Department of Endocrinology, Metabolism, Rheumatology and Nephrology, Faculty of Medicine, Oita University, 1-1 idaigaoka Yufu-shi, Oita,879-5593, Japan 2. Scientific Research Works Peer Support Group (SRWS-PSG), Osaka, Japan. Yuki Nakashima PT PhD (ORCID:https://orcid.org/0000-0001-7838-9472) 1 Division of Rehabilitation, Department of Clinical Practice and Support, Hiroshima University Hospital, Kasumi 1-2-3, Minami-ku, Hiroshima, 734-8551 Japan 2 Scientific Research Works Peer Support Group (SRWS-PSG), Osaka, Japan. Yasuhiro Ogura, MD (ORCID: https://orcid.org/0000-0001-8310-2069) 1. Department of Radiation Oncology, Cancer Institute Hospital of the Japanese Foundation for Cancer Research, 3-8-31 Ariake, Koto-ku, 135–8550, Tokyo, Japan 2. Division of Cellular Senescence, Cancer Institute, Japanese Foundation for Cancer Research, 3-8-31 Ariake, Koto-ku, Tokyo 135-8550, Japan 3. Department of JFCR Cancer Biology, Graduate School of Medical and Dental Sciences, Institute of Science Tokyo, 4-5-19 Yushima, Bunkyo-ku, Tokyo 113-0034, Japan 4. Scientific Research Works Peer Support Group (SRWS-PSG), Osaka, Japan. Masatsugu Okamura, PT, PhD (ORCID: https://orcid.org/0000-0001-9136-5037) 1. Berlin Institute of Health Center for Regenerative Therapies (BCRT), Charité – Universitätsmedizin Berlin, Augustenburger Platz 1, 13353 Berlin, Germany 2. Department of Rehabilitation Medicine, School of Medicine, Yokohama City University, 3-9 Fukuura, Kanazawa-ku, Yokohama-city, Kanagawa, 236-0004 Japan 3. Scientific Research Works Peer Support Group (SRWS-PSG), Osaka, Japan. Yusuke Saishoji, MD, MHA(ORCID:https://orcid.org/0000-0001-7163-8229) 1.Department of General Medicine, Hakujyuji Hospital, 4-3-1, Ishimaru, NIshi-ku, Fukuoka-shi, Fukuoka, 819-8511, Japan 2. Scientific Research Works Peer Support Group (SRWS-PSG), Osaka, Japan. Akihiro Shiroshita, MD, MPH (ORCID: https://orcid.org/0000-0003-0262-459X) 1. Division of Epidemiology, Department of Medicine, Vanderbilt University School of Medicine 2. Scientific Research Works Peer Support Group (SRWS-PSG), Osaka, Japan Hidehiro Someko, MD (ORCID: https://orcid.org/0000-0002-7195-2055) 1 Department of Healthcare Epidemiology, Kyoto University Graduate School of Medicine / Public Health, Yoshida Konoe-cho, Sakyo-ku, Kyoto 606-8501, Japan 2 Nagoya Tokushukai General Hospital, Department of Internal Medicine, Kozojichokita 2-52, Kasugai, Aichi, 487-0016, Japan 3 Scientific Research Works Peer Support Group (SRWS-PSG), Osaka, Japan. Yukiyoshi Sumi, MD, PhD (ORCID: https://orcid.org/0000-0001-6775-0883) 1. Department of Psychiatry, Shiga University of Medical Science, Tsukinowa-cho, Seta, Otsu-city, Shiga, 520-2192, Japan 2. Scientific Research Works Peer Support Group (SRWS-PSG), Osaka, Japan. Shunsuke Taito PT PhD (ORCID: https://orcid.org/0000-0003-1218-4225) 1 Division of Rehabilitation, Department of Clinical Practice and Support, Hiroshima University Hospital, Kasumi 1-2-3, Minami-ku, Hiroshima, 734-8551 Japan 2 Scientific Research Works Peer Support Group (SRWS-PSG), Osaka, Japan. Takahiro Tsuge, PT, MPH (ORCID:https://orcid.org/0000-0003-0497-944X) 1. Department of Rehabilitation, Kurashiki Medical Center, 250 Bakuro, Kurashiki, Okayama 710-8522, Japan. 2. Department of Epidemiology, Graduate School of Medicine, Dentistry and Pharmaceutical Sciences, Okayama University, 2-5-1 Shikata-cho, Okayama 700-8558, Japan. 3. Scientific Research Works Peer Support Group (SRWS-PSG), Koraibashi, Chuo-ku 1-7-7, Osaka, 541-0043, Japan. takahiro_tsuge@yahoo.co.jp Yoshimitsu Wada, MD (ORCID: https://orcid.org/0000-0001-5986-8726) 1. School of Public Health, The University of Tokyo, 7-3-1 Hongo, Bunkyō, Tokyo, 113-8654 Japan. 2. Scientific Research Works Peer Support Group (SRWS-PSG), Osaka, Japan Jun Watanabe MD, PhD (ORCID: https://orcid.org/0000-0003-4477-4238) 1. Department of Surgery, Division of Gastroenterological, General and Transplant Surgery, Jichi Medical University, 3311-1 Yakushiji Shimotsuke City, Tochigi, 329-0498 Japan 2. Center for Community Medicine, Jichi Medical University, 3311-1 Yakushiji Shimotsuke City, Tochigi, 329-0498 Japan 3. Scientific Research Works Peer Support Group (SRWS-PSG), Osaka, Japan. Mari Yamamoto, MD (ORCID: https://orcid.org/0000-0003-3927-399X) 1. Department of Rheumatology and Nephrology, Chubu Rosai Hospital, 1-10-6 Komei, Minato-ku, Nagoya, Aichi 455-8530, Japan 2. Scientific Research Works Peer Support Group (SRWS-PSG), Osaka, Japan. Norio Yamamoto MD,PhD (ORCID:https://orcid.org/0000-0002-7902-9994) 1.Department of Orthopedic Surgery, Minato Medical Coop-Kyoritsu General Hospital, Nagoya, Aichi, 456-8611, Japan 2. Scientific Research Works Peer Support Group (SRWS-PSG), Japan. Yuki Yoshimatsu, MD, PhD (ORCID: https://orcid.org/0000-0003-0913-3507) 1. Department of Ageing and Health, Guy’s and St Thomas’ NHS Foundation Trust, Great Maze Pond, London SE1 9RT, United Kingdom Centre for Exercise, Activity and Rehabilitation, University of Greenwich, Avery Hill Road, Eltham, London, SE9 2UG, United Kingdom 2. Scientific Research Works Peer Support Group (SRWS-PSG), Osaka, Japan. Shodai Yoshihiro, MPharm (ORCID: https://orcid.org/0000-0003-2418-2323) 1. Department of pharmaceutical services, Hiroshima University Hospital. Kasumi 1-2-3, Minami-ku, Hiroshima 734-8551, Japan. 2. Scientific Research Works Peer Support Group (SRWS-PSG), Osaka, Japan. Conflicts of Interest: Abbreviations CI confidence interval RCB research capacity building sdHR subdistribution hazard ratio SRWS-PSG Scientific Research Works Peer Support Group STROBE Strengthening the Reporting of Observational Studies in Epidemiology References 1. Cooke J A framework to evaluate research capacity building in health care BMC Fam Pract Oct 27 2005 6 1 44 doi 10.1186/1471-2296-6-44 Medline 16253133 PMC1289281 2. Matus J Walker A Mickan S Research capacity building frameworks for allied health professionals - a systematic review BMC Health Serv Res Sep 15 2018 18 1 716 doi 10.1186/s12913-018-3518-7 Medline 30219065 PMC6139135 3. King O West E Lee S et al Research education and training for nurses and allied health professionals: a systematic scoping review BMC Med Educ 05 19 2022 22 1 385 doi 10.1186/s12909-022-03406-7 Medline 35590359 PMC9121620 4. Ikarashi A Japanese research is no longer world class - here’s why Nature New Biol Nov 2023 623 7985 14 16 doi 10.1038/d41586-023-03290-1 Medline 37880529 5. Fukuhara S Kataoka Y Aoki T Green J Shimizu S Toyoda N International collaboration and commercial involvement in randomized controlled trials from 10 leading countries, 1997 through 2019 Cureus 05 2024 16 5 e61205 doi 10.7759/cureus.61205 Medline 38939267 PMC11208843 6. Kataoka Y Ikegaki S Kato D et al Scholarly activity support systems in internal medicine residency programs: a national representative survey in Japan Intern Med 07 1 2019 58 13 1859 1864 doi 10.2169/internalmedicine.2312-18 Medline 30918184 PMC6663531 7. Kinoshita S Kishimoto T Decline in Japan’s research capabilities: challenges in the medical field Lancet Oct 7 2023 402 10409 1239 1240 doi 10.1016/S0140-6736(23)01465-4 Medline 37805213 8. Sanftenberg L Stofella J Mayr K et al Expectations of general practitioners on a practice based research network in Germany- a qualitative study within the Bavarian Research Practice Network (BayFoNet) BMC Prim Care 01 2 2024 25 1 10 doi 10.1186/s12875-023-02239-7 Medline 38166677 PMC10759500 9. Goda K Igaki T Kuhn B et al Japan can be a science heavyweight once more - if it rethinks funding Nature New Biol Feb 2025 638 8050 318 320 doi 10.1038/d41586-025-00394-8 Medline 39934325 10. Nishigori H Harrison R Busari J Dornan T Bushido and medical professionalism in Japan Acad Med Apr 2014 89 4 560 563 doi 10.1097/ACM.0000000000000176 Medline 24556758 PMC4342315 11. Tsujimoto H Kataoka Y Sato Y et al A model six-month workshop for developing systematic review protocols at teaching hospitals: action research and scholarly productivity BMC Med Educ Feb 10 2021 21 1 98 doi 10.1186/s12909-021-02538-6 Medline 33568114 PMC7875449 12. von Elm E Altman DG Egger M Pocock SJ Gøtzsche PC Vandenbroucke JP The Strengthening the Reporting of Observational Studies in Epidemiology (STROBE) statement: guidelines for reporting observational studies The Lancet Oct 2007 370 9596 1453 1457 doi 10.1016/S0140-6736(07)61602-X 18064739 13. Scientific Research Works Peer Support Group Increase clinical research in japan! Write a systematic review paper and become a mentor! URL https://community.camp-fire.jp/projects/view/187310 Accessed 10-05-2025 14. Harden RM AMEE Guide No. 14: Outcome-based education: Part 1-An introduction to outcome-based education Med Teach 01 1999 21 1 7 14 doi 10.1080/01421599979969 21281173 15. Higgins JPT Thomas J Chandler J et al Cochrane handbook for systematic reviews of interventions URL https://training.cochrane.org/handbook Accessed 03-07-2024 16. Cochrane Risk of Bias 2 Tool Group RoB 2 tool URL https://sites.google.com/site/riskofbiastool/welcome/rob-2-0-tool Accessed 13-05-2025 17. Slack What is slack URL https://slack.com/what-is-slack Accessed 16-09-2025 18. Belur J Tompson L Thornton A Simon M Interrater reliability in systematic review methodology: exploring variation in coder decision-making Sociol Methods Res SAGE Publications 05 2021 50 2 837 865 doi 10.1177/0049124118799372 19. King O West E Lee S et al Research education and training for nurses and allied health professionals: a systematic scoping review BMC Med Educ 2022 22 1 385 doi 10.1186/s12909-022-03406-7 35590359 PMC9121620 20. Webster E Thomas M Ong N Cutler L Rural research capacity building program: capacity building outcomes Aust J Prim Health 2011 17 1 107 doi 10.1071/PY10060 21616034 21. Austin PC Ibrahim M Putter H Accounting for competing risks in clinical research JAMA Jun 25 2024 331 24 2125 2126 doi 10.1001/jama.2024.4970 Medline 38809526 22. Duncanson K Webster EL Schmidt DD Impact of a remotely delivered, writing for publication program on publication outcomes of novice researchers Rural Remote Health 05 2018 18 2 4468 doi 10.22605/RRH4468 Medline 29793344 23. Boyer EL Scholarship Reconsidered: Priorities of the Professoriate Carnegie Foundation for the Advancement of Teaching 1990 URL https://eric.ed.gov/?id=ED326149 Accessed 16-09-2025 ISBN ISBN-0-931050-43-X 24. Hidetoshi F Rothman T Sacred Mathematics: Japanese Temple Geometry Princeton University Press 2008 URL https://press.princeton.edu/books/hardcover/9780691127453/sacred-mathematics?srsltid=AfmBOopAzDiaMFjejvuGb2Ru1lpRhEH2hOQs3vfUqkMNX0M9sX4Pgoi2 Accessed 16-09-2025 ISBN 9780691127453 25. Someko H Yamamoto R Ariie T et al Validity and reliability of the Japanese version of the ACE tool for assessing evidence-based medicine competencies in medical practitioners and students: an evaluation in an online setting Intern Med 07 15 2025 64 14 2136 2142 doi 10.2169/internalmedicine.4724-24 Medline 39721681 PMC12331312 26. Nordling L How research managers are using AI to get ahead Nature New Biol Dec 2023 doi 10.1038/d41586-023-04160-6 38129607 27. Burtch G Lee D Chen Z The consequences of generative AI for online knowledge communities Sci Rep 05 6 2024 14 1 10413 doi 10.1038/s41598-024-61221-0 Medline 38710885 PMC11074245 28. Kataoka Y So R Banno M et al Development of meta-prompts for large language models to screen titles and abstracts for diagnostic test accuracy reviews Health Informatics Preprint posted online on 2023 doi 10.1101/2023.10.31.23297818 29. Kataoka Y Takayama T Yoshimura K et al Automating the data extraction process for systematic reviews using GPT-4o and o3 Res Synth Methods Sep 17 2025 1 21 doi 10.1017/rsm.2025.10030 30. Sun L Han Y Zhao Z SciEval: a multi-level large language model evaluation benchmark for scientific research arXiv [csCL] Preprint posted online on Aug 25 2023 doi 10.48550/arXiv.2308.13149 ",
  "metadata": {
    "Title of this paper": "SciEval: a multi-level large language model evaluation benchmark for scientific research",
    "Journal it was published in:": "JMIR Medical Education",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490813/"
  }
}