{
  "title": "Paper_903",
  "abstract": "pmc Medicina (Kaunas) Medicina (Kaunas) 3494 medicina medicina Medicina 1010-660X 1648-9144 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471470 PMC12471470.1 12471470 12471470 41011008 10.3390/medicina61091617 medicina-61-01617 1 Article Diagnostic Value of Bronchoscopy in Detecting Laryngopharyngeal Disorders: Clinical Utility and Limitations Kim Deok Hyong Methodology Investigation Writing – review & editing 1 Kang Bo Hyoung Methodology 2 https://orcid.org/0000-0001-7096-7215 Um Soo-Jung Conceptualization Supervision 2 https://orcid.org/0000-0001-9575-4945 Kim Insu Conceptualization Writing – original draft Writing – review & editing 2 * Magliulo Giuseppe Academic Editor 1 deokhyung@naver.com 2 eeyoun@dau.ac.kr sjum@dau.ac.kr * wisedoc08@gmail.com 07 9 2025 9 2025 61 9 497654 1617 11 8 2025 03 9 2025 04 9 2025 07 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Published by MDPI on behalf of the Lithuanian University of Health Sciences. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background and Objectives Materials and Methods Results p p p p Conclusions bronchoscopy laryngeal diseases laryngoscopy malignancy upper respiratory tract diseases Dong-A University This work was supported by the Dong-A University research fund. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Flexible bronchoscopy is an essential and widely adopted diagnostic and treatment modality in respiratory medicine since its development in the 1960s, primarily intended to visualize and evaluate intrathoracic airways and parenchymal lung diseases, including lung malignancy [ 1 2 Diseases involving the upper respiratory tract, particularly those of otolaryngological origin, may present subtle or non-specific symptoms such as hoarseness, dysphagia, chronic cough, or dyspnea [ 3 4 5 6 7 8 9 8 10 Therefore, this study aimed to evaluate the diagnostic significance and effectiveness of bronchoscopy in assessing upper airway diseases, including those involving the larynx, based on real-world data. 2. Materials and Methods 2.1. Study Population We conducted a retrospective observational study using data collected from patients who underwent bronchoscopy between March 2019 and December 2023 according to the Strengthening the Reporting of Observational Studies in Epidemiology statement. Patients with abnormal findings in the oropharynx after bronchoscopy underwent further laryngoscopic evaluation at the Department of Otolaryngology. This retrospective study was conducted in accordance with the Declaration of Helsinki and approved by the Institutional Review Board of Dong-A University Hospital (Protocol# DAUHIRB-24-032). The requirement for written informed consent was waived owing to the retrospective design of the study. 2.2. Data Collection Baseline characteristics included age, sex, presumptive diagnosis, bronchoscopic findings, presence or absence of abnormalities and details, otolaryngology (OL) consultation status or results, final diagnosis, and the presence of malignant or benign disease. Only cases with histologically confirmed malignant disease were included. 2.3. Bronchoscopy Operator Bronchoscopy outcomes can vary significantly depending on the operator, highlighting the need for a learning curve to acquire a certain level of skill while performing bronchoscopy. Voduc N et al. reported that bronchoscopy skill acquisition differs among trainees, with a notable variation in the number of procedures required to reach competency between high- and low-performing groups [ 11 12 13 2.4. Additional Consultation The definition of abnormal findings included mucosal lesions and morphological structures not normally observed in the typical anatomical configuration, anatomical deformities, and additional masses, as well as depigmentation and discoloration identified via visual inspections. If abnormal findings were observed in the laryngopharyngeal or oral cavity during bronchoscopy, the patient was referred to the Department of Otolaryngology for further evaluation. In most cases, the Department of Otolaryngology conducted additional assessments; however, such evaluations could not always be performed due to scheduling conflicts or patient refusal. 2.5. Statistical Analysis Variables were expressed as numbers with percentages for categorical data and as means with standard deviations for continuous data, as appropriate. To compare the two independent groups, the chi-squared test or Fisher’s exact test was used for categorical variables, whereas the independent t p 3. Results 3.1. Patients In total, 2471 patients underwent bronchoscopy during the study period. However, 242 patients who underwent tracheostomy were excluded from the study, leaving 2229 patients ( Figure 1 The mean age of the included group was 65.4 years, and 1413 men accounted for 63.4% of the group. Bronchoscopy was performed by experienced practitioners in 93.9% of cases (2092 cases) and by inexperienced practitioners in 6.1% of cases (137 cases). Of the patients, 869 (39%) had malignant diseases and 72 (3.2%) had abnormal findings after bronchoscopy. Of these, 40 (56%) underwent additional consultations with an otolaryngologist ( Table 1 3.2. Bronchoscopy Operator The detection of abnormal findings in each anatomical region was analyzed based on whether an experienced or inexperienced operator performed the procedures. In total, 2092 and 137 procedures were performed by experienced operators and inexperienced operators, respectively. These findings were categorized according to anatomical regions, namely, the oral cavity, larynx, and vocal cords ( Table 2 In the oral cavity region, no abnormalities were observed in 137 procedures performed by inexperienced practitioners. Among the 2092 procedures performed by the experienced practitioners, only one abnormality was identified. No statistically significant difference was observed between the two groups ( p p p p 3.3. Presence of Malignancy Of all patients, 1360 (61%) and 869 had benign and malignant diseases, respectively. In the oral cavity, no abnormalities were observed in patients with benign diseases, whereas one abnormality was identified in patients with malignant diseases; however, this difference was not statistically significant ( p p p p Table 3 3.4. Multivariate Analysis for the Abnormal Finding Group Multivariate logistic regression analysis was performed to identify factors associated with the presence of significant abnormalities. The results demonstrated that male sex was significantly associated with a higher likelihood of detecting abnormal findings, with an OR of 2.069 (95% CI, 1.138–3.761; p p p p Table 4 4. Discussion This study aimed to evaluate the diagnostic utility of flexible bronchoscopy in detecting upper airway abnormalities, particularly those involving the oral cavity, larynx, and vocal cords, using real-world data from a large cohort of patients who underwent bronchoscopy over a nearly five-year period. Bronchoscopy plays a critical role in evaluating upper airway diseases by enabling direct visualization of the larynx, trachea, and proximal bronchi [ 1 2 12 12 14 13 15 16 1 12 We observed that operator experience was not significantly associated with the detection of abnormalities in the oral cavity, larynx, or vocal cords. Experienced practitioners performed the majority of the bronchoscopic procedures in our cohort (93.9%); however, the detection rates of upper airway abnormalities were not significantly different from those of procedures performed by inexperienced operators. This finding may appear counterintuitive given the assumption that procedural skill influences diagnostic yield; however, the finding is likely attributable to the anatomical exposure inherent in the procedure. We observed that even relatively inexperienced operators may adequately detect gross mucosal lesions, masses, or asymmetries without requiring advanced navigational skills because the upper airway, including the oropharynx and laryngeal inlet, is visualized early in the bronchoscopic examination. This result is consistent with the concept that, while procedural experience is essential for navigating distal airways and performing complex interventions, such as transbronchial biopsies or endobronchial ultrasound-guided transbronchial needle aspiration, the detection of proximal upper airway pathology may rely more on thorough visual inspection and clinical suspicion than on procedural volume alone. Furthermore, the presence of an underlying malignancy was significantly associated with a higher rate of abnormal findings in the upper airway, particularly in the larynx and vocal cords. Among patients with malignant diseases, abnormal findings were three times more likely to be observed than in those with benign conditions, as confirmed by multivariable logistic regression. This observation aligns with previous reports indicating that head and neck malignancies, including primary lung cancers, may involve the upper aerodigestive tract through either direct extension, metastasis, or synchronous tumors [ 17 18 19 20 21 It should also be emphasized that diseases involving the oral cavity and oropharynx are generally easier to diagnose because they are often accompanied by specific clinical symptoms (e.g., hoarseness, dysphagia) and can be directly examined without specialized equipment. In contrast, laryngeal and vocal cord lesions may remain under-recognized until they are incidentally identified during bronchoscopy, particularly in patients with coexisting pulmonary disease. Of the 21 laryngeal abnormalities detected, 18 were located in the supraglottic region, whereas only 3 were identified in the subglottic region. Subglottic lesions accounted for a minority of cases and were less readily apparent on bronchoscopy. This distribution highlights the relative diagnostic challenge of subglottic lesions, which tend to be under-detected compared with supraglottic abnormalities. Their subtle mucosal changes and hidden anatomical location in the early stages may explain the lower detection rate, underscoring the complementary role of laryngoscopy in comprehensive evaluation of the upper airway. These observations highlight the complementary rather than competitive roles of bronchoscopy and laryngoscopy in comprehensive airway evaluation and underscore the need for a systematic approach that integrates both procedures when feasible. A younger age (<74 years) and male sex were independent predictors of abnormal findings. The mechanisms underlying these associations remain unclear; however, several hypotheses have been proposed. Younger patients may be more likely to present for evaluation at earlier stages of the disease, when subtle mucosal abnormalities remain detectable. Alternatively, certain behavioral or environmental exposures, such as smoking, alcohol consumption, or occupational irritants, may differ between age groups and sexes, influencing the prevalence of upper airway pathology [ 22 23 24 25 26 One of the most clinically meaningful findings of this study was the frequency at which upper airway lesions were detected incidentally during routine bronchoscopy, even in patients not initially referred for upper airway symptoms. In our cohort, 72 patients (3.2%) showed visible abnormalities in the oropharyngeal, laryngeal, and vocal cord regions during bronchoscopy. This may appear to be a relatively small proportion; however, we consider it clinically relevant given the potential implications of missed upper airway lesions, particularly in patients with malignancies. In more than half of these cases, further evaluation by otolaryngologists was pursued, allowing for more definitive diagnosis and management. This highlights the role of bronchoscopy as a diagnostic tool for lower airway disease and adjunctive screening method for upper airway abnormalities, particularly in resource-limited settings or when laryngoscopic evaluation is delayed. Acknowledging the limitations of the current standard diagnostic tools for upper airway assessment is important. Laryngoscopy is considered the gold standard for evaluating vocal cords and supraglottic structures [ 7 8 10 Despite the strengths of this study, including its relatively large sample size, use of real-world data, and standardized procedural criteria, it has some limitations. First, because this study was retrospective and observational, an inherent risk of selection and information biases was observed. Not all patients with observed abnormalities underwent confirmatory laryngoscopic evaluation, either because of logistical constraints or patient refusal, which may have resulted in under-reporting or misclassification. However, this was due to the emphasis on patients’ autonomy in diagnosis and treatment in domestic medical guidelines, as well as the restrictions imposed by the national health insurance system regarding the cost of additional examinations, which made it impossible to perform further evaluations, including laryngoscopy, for all patients. Second, the relatively small number of procedures performed by inexperienced operators limits their ability to detect subtle differences in diagnostic performance. Third, operator experience was defined solely by procedural volume, without accounting for other important factors, such as training background, supervision quality, or ongoing procedural competency assessments. Finally, we did not assess inter-observer variability in abnormality detection, which could have influenced the generalizability of the results. 5. Conclusions This study demonstrated that flexible bronchoscopy has an underappreciated value in detecting upper airway abnormalities, particularly in patients with malignancy, and that abnormal findings can be reliably identified regardless of operator experience. Our findings support routine inspection of the upper airway during bronchoscopy, especially in male patients, younger individuals, and those with known or suspected malignant diseases. Future prospective studies incorporating routine laryngoscopic confirmation, standardized upper airway screening protocols, and long-term outcome data are warranted to further validate and refine the role of bronchoscopy in upper airway assessment. The integration of upper airway evaluation into bronchoscopic practice may ultimately improve early detection of clinically significant lesions and contribute to more comprehensive patient care. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, I.K. and S.-J.U.; methodology, B.H.K. and D.H.K.; investigation, D.H.K.; writing—original draft preparation, I.K.; writing—review and editing, I.K. and D.H.K.; supervision, S.-J.U. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement This study was conducted in accordance with the Declaration of Helsinki and approved by the Institutional Review Board of Dong-A University Hospital (Protocol# DAUHIRB-24-032, 21 February 2024). Informed Consent Statement Patient consent was waived owing to the retrospective design of the study. Data Availability Statement The data presented in this study are available on request from the corresponding author. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: CT Computed tomography MRI Magnetic resonance imaging OR Odds ratio OL Otolaryngology CI Confidence interval SPSS Statistical Package for the Social Sciences References 1. Miller R.J. Casal R.F. Lazarus D.R. Ost D.E. Eapen G.A. Flexible bronchoscopy Clin. Chest Med. 2018 39 1 16 10.1016/j.ccm.2017.09.002 29433707 2. Casal R.F. Ost D.E. Eapen G.A. Flexible bronchoscopy Clin. Chest Med. 2013 34 341 352 10.1016/j.ccm.2013.03.001 23993807 3. Zhang J. Perret J.L. Chang A.B. Idrose N.S. Bui D.S. Lowe A.J. Abramson M.J. Walters E.H. Lodge C.J. Dharmage S.C. Risk factors for chronic cough in adults: A systematic review and meta-analysis Respirology 2022 27 36 47 10.1111/resp.14169 34658107 4. Athish K.K. Guruprasad T.J. Padmanabha S. Harshitha K.R. Subglottic adenoid cystic carcinoma mimicking bronchial asthma: A case report Cureus 2024 16 e60571 10.7759/cureus.60571 38894795 PMC11183517 5. Kashif M. Singh T. Aslam A. Khaja M. Asthma mimic: Case report and literature review of vocal cord nodule associated with wheezing SAGE Open Med. Case Rep. 2017 5 2050313X17744980 10.1177/2050313X17744980 PMC5718308 29230286 6. Kompelli A.R. Li H. Neskey D.M. Impact of Delay in Treatment Initiation on Overall Survival in Laryngeal Cancers Otolaryngol. Head Neck Surg. 2019 160 651 657 10.1177/0194599818803330 30322343 7. Paul B.C. Chen S. Sridharan S. Fang Y. Amin M.R. Branski R.C. Diagnostic accuracy of history, laryngoscopy, and stroboscopy Laryngoscope 2013 123 215 219 10.1002/lary.23630 23070976 8. Mannelli G. Cecconi L. Gallo O. Laryngeal preneoplastic lesions and cancer: Challenging diagnosis. Qualitative literature review and meta-analysis Crit. Rev. Oncol. Hematol. 2016 106 64 90 10.1016/j.critrevonc.2016.07.004 27637353 9. Hut A.-R. Boia E.R. Para D. Iovanescu G. Horhat D. Mikša L. Chiriac M. Galant R. Motofelea A.C. Balica N.C. Laryngeal Cancer in the Modern Era: Evolving Trends in Diagnosis, Treatment, and Survival Outcomes J. Clin. Med. 2025 14 3367 10.3390/jcm14103367 40429363 PMC12112285 10. Thoeny H.C. Delaere P.R. Hermans R. Correlation of local outcome after partial laryngectomy with cartilage abnormalities on CT AJNR Am. J. Neuroradiol. 2005 26 674 678 15760887 PMC7976475 11. Voduc N. Adamson R. Kashgari A. Fenton M. Porhownick N. Wojnar M. Sharma K. Gillson A.M. Chung C. McConnell M. Development of learning curves for bronchoscopy: Results of a multicenter study of pulmonary trainees Chest 2020 158 2485 2492 10.1016/j.chest.2020.06.046 32622822 12. Mohan A. Madan K. Hadda V. Tiwari P. Mittal S. Guleria R. Khilnani G.C. Luhadia S.K. Solanki R.N. Gupta K.B. Guidelines for diagnostic flexible bronchoscopy in adults: Joint Indian Chest Society/National College of Chest Physicians (I)/Indian Association for Bronchology recommendations Lung India 2019 36 (Suppl. S2) S37 S89 10.4103/lungindia.lungindia_108_19 32445309 PMC6681731 13. Ernst A. Silvestri G.A. Johnstone D. Interventional pulmonary procedures: Guidelines from the American College of Chest Physicians Chest 2003 123 1693 1717 10.1378/chest.123.5.1693 12740291 14. Ning J. Ge T. Jiang M. Jia K. Wang L. Li W. Chen B. Liu Y. Wang H. Zhao S. Early diagnosis of lung cancer: Which is the optimal choice? Aging 2021 13 6214 6227 10.18632/aging.202504 33591942 PMC7950268 15. Ong P.G. Debiane L.G. Casal R.F. Recent advances in diagnostic bronchoscopy J. Thorac. Dis. 2016 8 3808 3817 10.21037/jtd.2016.12.70 28149581 PMC5227282 16. Kuo C.H. Niu C.K. Yu H.R. Chung M.Y. Hwang C.F. Hwang K.P. Applications of flexible bronchoscopy in infants with congenital vocal cord paralysis: A 12-year experience Pediatr. Neonatol. 2008 49 183 188 10.1016/S1875-9572(09)60006-1 19133570 17. Haddad G. Sataloff R.T. Hamdan A.L. Laryngeal metastatic lesions: A literature review J. Voice 2024 38 1458 1464 10.1016/j.jvoice.2022.06.016 35918235 18. Lee Y.C. Fang T.J. Lin C.T. Metastatic endometrial adenocarcinoma to the larynx: A case report and discussion of upper airway management J. Palliat. Med. 2014 17 867 869 10.1089/jpm.2014.0077 24992372 19. Chen T.Y. Hung G.U. Hung C.C. Chiu J.S. Kao C.H. Asymptomatic metastasis to the larynx detected by FDG PET/CT in a patient with recurrent rectal adenocarcinoma Clin. Nucl. Med. 2012 37 e178 e180 10.1097/RLU.0b013e3182443b98 22691530 20. Glastonbury C.M. Parker E.E. Hoang J.K. The postradiation neck: Evaluating response to treatment and recognizing complications AJR Am. J. Roentgenol. 2010 195 W164 W171 10.2214/AJR.09.4122 20651177 21. Koroulakis A. Agarwal M. Laryngeal Cancer StatPearls [Internet] StatPearls Publishing Treasure Island, FL, USA 2025 30252332 22. Bhattacharyya S. Mandal S. Banerjee S. Mandal G.K. Bhowmick A.K. Murmu N. Cannabis smoke can be a major risk factor for early-age laryngeal cancer—A molecular signaling-based approach Tumour Biol. 2015 36 6029 6036 10.1007/s13277-015-3279-4 25736926 23. Ferster A.P.O. Schubart J. Kim Y. Goldenberg D. Association between laryngeal cancer and asbestos exposure: A systematic review JAMA Otolaryngol. Head Neck Surg. 2017 143 409 416 10.1001/jamaoto.2016.3421 27918783 24. Menach P. Oburra H.O. Patel A. Cigarette smoking and alcohol ingestion as risk factors for laryngeal squamous cell carcinoma at Kenyatta National Hospital, Kenya Clin. Med. Insights Ear Nose Throat 2012 5 17 24 10.4137/CMENT.S8610 24179405 PMC3791957 25. Park J.O. Nam I.C. Kim C.S. Park S.J. Lee D.H. Kim H.B. Han K.D. Joo Y.H. Sex differences in the prevalence of head and neck cancers: A 10-year follow-up study of 10 million healthy people Cancers 2022 14 2521 10.3390/cancers14102521 35626129 PMC9139445 26. Jang W. Kim S. Son Y. Kim S. Lee S. Kim H.J. Jo H. Park J. Lee K. Lee H. Global, regional, and national burden of pharyngeal cancer and projections to 2050 in 185 countries: A population-based systematic analysis of GLOBOCAN 2022 J. Korean Med. Sci. 2025 40 e177 10.3346/jkms.2025.40.e177 40762594 PMC12322593 Figure 1 Flow diagram of study subjects. medicina-61-01617-t001_Table 1 Table 1 Baseline characteristics of study subjects. Overall Group n Age, years 65.4 ± 13.4 Male gender 1413 (63.4) Operator  Experienced 2092 (93.9) Inexperienced 137 (6.1) Presence of malignancy  Benign disease 1360 (61.0) Malignant disease 869 (39.0) Additional consultation  No consultation 32 (1.4) Consultation 40 (1.8) Not applicable 2157 (96.8) The data are presented as mean No (%). medicina-61-01617-t002_Table 2 Table 2 Detection of abnormalities by experienced vs. inexperienced operators in anatomical regions.  Operator p Inexperienced n Experienced ( n Oral cavity Normal findings 137 (100) 2091 (100) 1.000 Abnormal findings 0 (0) 1 (0) Larynx Normal findings 137 (100) 2071 (99) 0.636 Abnormal findings 0 (0) 21 (1) Vocal cords Normal findings 132 (96) 2045 (98) 0.248 Abnormal findings 5 (4) 47 (2) Total Normal findings 132 (96) 2024 (97) 0.802 Abnormal findings 5 (4) 68 (3) The data are presented as mean No (%). medicina-61-01617-t003_Table 3 Table 3 Detection of oral and laryngeal region abnormalities by presence of malignancy.  Presence of Malignancy p Benign n Malignant n Oral cavity Normal findings 1360 (100) 868 (100) 0.390 Abnormal findings 0 (0) 1 (0) Larynx Normal findings 1354 (100) 854 (98) 0.002 Abnormal findings 6 (0) 15 (2) Vocal cords Normal findings 1338 (98) 839 (96) 0.005 Abnormal findings 22 (2) 30 (4) Total Normal findings 1334 (98) 822 (95) 0.000 Abnormal findings 26 (2) 47 (5) The data are presented as mean No (%). medicina-61-01617-t004_Table 4 Table 4 Multivariate analysis of abnormal bronchoscopic finding group. Variables Category Abnormality Univariate Analysis None n Presence n OR (95% CI) p Sex Female 802 (98) 14 (2) Reference  Male 1354 (96) 59 (4) 2.069 (1.138–3.761) 0.017 Age ≥74 560 (98) 11 (2) Reference  <74 1596 (96) 62 (4) 2.404 (1.247–4.634) 0.009 Operator Inexperienced 132 (96) 5 (4) Reference  Experienced 2024 (97) 68 (3) 0.648 (0.251–1.672) 0.370 Presence of malignancy Benign disease 1334 (98) 26 (2) Reference  Malignant disease 822 (95) 47 (5) 3.030 (1.829–5.017) 0.000 OR, odds ratio; CI, confidence interval. The data are presented as mean No (%). ",
  "metadata": {
    "Title of this paper": "Global, regional, and national burden of pharyngeal cancer and projections to 2050 in 185 countries: A population-based systematic analysis of GLOBOCAN 2022",
    "Journal it was published in:": "Medicina",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471470/"
  }
}