{
  "title": "Paper_94",
  "abstract": "pmc Int J Clin Pediatr Dent Int J Clin Pediatr Dent 2393 ijcpd IJCPD International Journal of Clinical Pediatric Dentistry 0974-7052 0975-1904 Jaypee Brothers Medical Publishing (P) Ltd. PMC12488507 PMC12488507.1 12488507 12488507 10.5005/jp-journals-10005-3131 1 Original Research Effect of Polyherbal Toothpaste on Dental Plaque, Gingivitis, and Salivary Antioxidant Levels: A Single-blind Randomized Controlled Trial Pentapati Kalyana C 1 Anand Lahari 2 Shenoy Revathi P 3 Yelleti Geethika 4 Kumar Saurabh 5 1,2 3,4 5 Kalyana C Pentapati, Department of Public Health Dentistry, Manipal College of Dental Sciences, Manipal Academy of Higher Education, Manipal, Karnataka, India, Phone: +91 9916036303, e-mails: drkalyan81@gmail.com; kalyan.cp@manipal.edu 5 2025 25 7 2025 18 5 498143 533 538 25 7 2024 10 10 2024 01 06 2025 03 10 2025 03 10 2025 Copyright © 2025; The Author(s). 2025 https://creativecommons.org/licenses/by-nc/4.0/ This article is distributed under the terms of the Creative Commons Attribution 4.0 International License ( https://creativecommons.org/licenses/by-nc/4.0/ http://creativecommons.org/publicdomain/zero/1.0/ A bstract Objective To compare the antiplaque, antigingivitis, and saliva antioxidant properties of commercially available polyherbal toothpaste with conventional toothpaste after 1 month of usage. Materials and methods We conducted a randomized controlled single-blind trial among adolescents. About 80 adolescents were randomized into a test or control group using block randomization. Plaque and gingival indices were recorded, and unstimulated saliva was collected at baseline and 30 days after the intervention to assess salivary antioxidants. Results About 79 adolescents completed the study out of which 45 adolescents were male. The intragroup comparison showed a significant reduction in the mean plaque and gingival indices at 30 days when compared to the baseline in both groups. There was no significant difference in the mean reduction of these indices between the test and control groups ( p p Conclusion Polyherbal toothpaste can be a suitable alternative in reducing plaque and gingivitis and enhancing salivary antioxidant levels. Clinical Trial Registry of India registration number CTRI/2023/05/052169. How to cite this article Pentapati KC, Anand L, Shenoy RP, et al Keywords Bleeding Dental plaque Gingiva Herbal Saliva Toothpaste pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes I ntroduction Dental plaque is the main risk factor for oral diseases such as caries, gingivitis, and periodontitis. It deposits on the teeth and restoration alike sequentially with a complex biofilm structure interspersed with a variety of microorganisms and extracellular matrix. Hence, plaque control daily is imperative to prevent oral diseases. Self-care plaque control involves the use of a toothbrush, toothpaste, appropriate technique, frequency, and duration of toothbrushing. Brushing with toothpaste helps reduce the dependency on mechanical plaque control methods as they have antimicrobial agents and other additives that may inhibit the growth of dental plaque. However, these antimicrobial agents have potential side effects on long-term usage. There has been increased availability and acceptance of herbal-based toothpastes among the consumers which led to the introduction of newer herbal extracts and polyherbal formulations in the commercially available products. The antimicrobial, anti-inflammatory, and antioxidant properties of these products help in maintaining oral health. The oral cavity has a complex environment with constant interactions with microorganisms and environmental irritants which increase the production of reactive oxygen and nitrogen species. 1 2 2 3 1 2 4 5 5 6 7 Assessment of MDA, NO, and total thiols (TT) is widely used in studies due to their availability, economical, and simple to measure by making the analysis easy and accurate. MDA is a well-known marker for lipid peroxidation and indicates cell damage to the membrane. The overall antioxidant capacity can be detected by TT which includes various thiol-containing compounds. NO plays a significant role in inflammation as a signaling molecule. Together, these markers help in assessing oxidative stress and antioxidant mechanisms in saliva. 8 10 Herbal products such as green tea extract, 11 12 Azadirachta indica 13 Salvadora persica 14 15 Scutellaria baicalensis 16 Carica papaya 17 Aloe vera 18 Calendula 19 Calendula Echinacea 20 25 26 Given the background, this study aims to compare the effect of polyherbal and conventional toothpaste on plaque, gingivitis, and saliva antioxidant properties after 1 month of usage. The null hypothesis was that no significant differences in the plaque, gingivitis, and saliva antioxidant levels between the toothpastes. M aterials and ethods A randomized controlled single-blind trial was conducted to compare polyherbal and conventional toothpastes among adolescents. The protocol was approved by the “Kasturba Medical College and Kasturba Hospital Institutional Ethics Committee” (IEC1: 357/2022). Prior informed consent was sought from all the adolescents. The protocol was registered with the “Clinical Trial Registry of India” (CTRI/2023/05/052169). The sample size was determined using G*Power software based on the results of previous research (effect size = 0.72). 25 Participants who had plaque and/or gingivitis of more than score 1 were willing to participate; participants above 18 years were included. Participants were excluded if they had used antibiotics, anti-inflammatories, or antioxidants in the last 7 days; had known allergies to any herbal ingredients used in the toothpaste, multiple caries, missing teeth, crowns, or large restorations; any form of tobacco habits; and had systemic diseases. A total of 294 adolescents were screened from government technical college out of which 87 were eligible and 80 consented to participate. Eighty were enrolled and randomized into test or control groups using block randomization (block size: 4) ( Fig. 1 Fig. 1: CONSORT flowchart Clinical Examination A trained, calibrated, and blinded dentist (KCP) conducted an oral examination and recorded the “Turesky, Gilmore, Glickman modification of Quigley–Hein Plaque Index” 27 28 29 30 Saliva Collection and Storage Unstimulated saliva was collected at baseline and 30 days after the intervention and was stored at −80°C without centrifugation and processed within 24 hours. Antioxidants Assay Malondialdehyde Estimation Kei Satoh method was employed for MDA which uses the thiobarbituric acid (TBA) reaction. Saliva samples were treated with trichloroacetic acid (TCA) to precipitate lipoproteins, followed by the addition of TBA in a sodium hydroxide solution. The mixture was incubated at 100°C for 20 minutes to facilitate the formation of a pink MDA–TBA complex. Subsequently, the samples were cooled, and the absorbance was assessed at 532 nm with a spectrophotometer. 31 5 −1 −1 Total Thiol Estimation Ellman's method was utilized for the estimation of TT. Saliva samples were treated with “5,5’-dithiobis(2-nitrobenzoic acid)” in phosphate buffer which produces a yellow-colored “5-thio-2-nitrobenzoic acid” (TNB) compound. They were incubated at room temperature, and the absorbance of the yellow TNB compound was measured at 412 nm with a spectrophotometer. 32 −1 −1 Nitric Oxide Estimation The Griess reagent method (Sigma-Aldrich) was employed for NO estimation. In this procedure, 0.1 mL of saliva and Griess reagent were added flat-bottomed 96-well microtitration plate. It was shaken for 10 minutes at room temperature, resulting in a purple color in positive samples. The absorbance was then measured at 570 nm with a microplate reader. 33 2 Interventions The test group was given a nonfluoride toothpaste containing extracts of “cloves ( Syzygium aromaticum Cinnamomum zeylanicum Piper nigrum Mimusops elengi Quercus infectoria Cinnamomum camphora Statistical Analysis Statistical Package for the Social Sciences (SPSS) software version 26 (IBM SPSS Statistics for Windows, Armonk, NY) was used to analyze the data. A p t t U R esults A total of 79 adolescents completed the study out of which 45 were male (56.97%). The mean age in the test and control groups was 19 (SD: 1.05) and 19.1 (SD: 1.1) years, respectively ( Table 1 Table 1: Age and sex distribution of the participants in test and control groups  Test  Control Age Mean (SD) 19 (1.05) 19.1 (1.1) Gender Male 23 (59.0%) 22 (55.0%) Female 16 (41.0%) 18 (45.0%) In comparison to baseline scores, there was a significant reduction in the mean plaque index, PSS, gingival index, and GSS at 30 days in both test ( p p Table 2 p Table 3 Table 2: Intragroup comparison of mean plaque index, plaque severity index, gingival index, and number of bleeding sites in test and control groups  Group  Index  Baseline (mean ± SD)  30 days (mean ± SD)  p-value Test ( n Plaque index † 1.4 ± 0.52 0.4 ± 0.17 <0.001; Sig PSS ‡ 3.21 ± 3.61 0.23 ± 0.9 <0.001; Sig Gingival index † 1.18 ± 0.33 0.45 ± 0.2 <0.001; Sig GSS ‡ 5.82 ± 5.48 1.87 ± 2.15 <0.001; Sig Control ( n Plaque index † 1.53 ± 0.61 0.47 ± 0.23 <0.001; Sig PSS ‡ 4.7 ± 5.47 0.63 ± 1.64 <0.001; Sig Gingival index † 1.27 ± 0.33 0.52 ± 0.19 <0.001; Sig GSS ‡ 6.37 ± 5.55 2.93 ± 3.21 <0.001; Sig † t ‡ Table 3: Intergroup comparison of mean difference of plaque index, plaque severity index, gingival index, and number of bleeding sites between the test and control groups  Difference (baseline—30 days)  Test (mean ± SD)  Control (mean ± SD)  p-value Plaque index † 1.00 ± 0.48 1.06 ± 0.54 0.617 PSS ‡ 2.97 ± 3.56 4.08 ± 5.01 0.37 Gingival index † 0.73 ± 0.33 0.74 ± 0.27 0.825 GSS ‡ 3.95 ± 5.31 3.45 ± 5.32 0.965 † t- ‡ U A significant decrease in the mean salivary MDA and NO levels was seen at 30 days when compared to baseline in both test ( p p p Table 4 p Table 5 Table 4: Intragroup comparison of mean salivary MDA, NO, and TT in test and control groups  Group  Antioxidant  Baseline (mean ± SD)  30 days (mean ± SD)  p-value Test ( n MDA 1.12 ± 0.86 0.81 ± 0.58 <0.001; Sig NO 92.24 ± 42.27 61.97 ± 36.01 0.001; Sig TT 92.88 ± 68.81 223.42 ± 114.18 <0.001; Sig Control ( n MDA 1.21 ± 0.90 0.80 ± 0.68 <0.001; Sig NO 96.52 ± 42.33 66.21 ± 35.88 <0.001; Sig TT 80.83 ± 69.02 224.76 ± 105.73 <0.001; Sig Wilcoxon signed rank test Table 5: Intergroup comparison of mean difference of salivary MDA, NO, and TT between the test and control groups  Difference (baseline—30 days)  Test (mean ± SD)  Control (mean ± SD)  p-value MDA 0.31 ± 0.58 0.41 ± 0.64 0.308 NO 30.27 ± 47.58 30.32 ± 38.22 0.852 TT −130.54 ± 80.71 −143.93 ± 92.45 0.543 Mann–Whitney U D iscussion Plaque is known to be a risk factor for oral diseases. Twice daily toothbrushing with toothpaste is essential to minimize plaque formation and maturation. Commercially available toothpastes have a wide variety of antimicrobials and additives which can have implications over long-term usage both to the individual and environment. Hence, there is a general growing interest in the increased awareness and acceptance of herbal alternatives among consumers. Due to this, manufacturers have supplemented many herbal ingredients into oral care products. The herbal toothpaste included in this study has many such ingredients which are known to have a multitude of beneficial effects. Syzygium aromaticum C. zeylanicum 34 P. nigrum 35 37 Q. infectoria M. elengi 38 It was seen that both polyherbal and control toothpastes were effective in reducing plaque and gingivitis after 30 days of usage. Similar findings were reported from earlier studies that had single or polyherbal extracts in toothpaste concerning gingivitis, 22 39 14 24 14 22 24 39 25 20 21 23 14 22 39 The novelty in this study was the assessment of saliva antioxidant properties after the use of herbal and control toothpastes. Findings of our study suggest a protective effect by increasing the antioxidant activity of the saliva. Direct comparisons of our results with the literature were not attempted, as there were no studies that reported the salivary antioxidant activity of toothpastes. All the ingredients in the polyherbal toothpaste have been shown to have anti-inflammatory, antibacterial, and antioxidant properties which was evident in the findings of our study. MDA is a marker for lipid peroxidation and indicates cell damage of the membrane. NO plays a significant role in inflammation as a signaling molecule. The overall antioxidant capacity was measured using the TT. A decrease in MDA and NO and an increase in TT after the use of toothpaste for 30 days suggest a protective role which could be attributed to the herbal ingredients. However, a similar decrease in the control toothpaste could be due to the antimicrobial agents. Due to these properties, the polyherbal toothpaste was as effective as commercially available antimicrobial toothpaste in enhancing saliva antioxidant levels. This suggests that polyherbal toothpaste can be a suitable alternative in reducing plaque, gingivitis, plaque severity, number of bleeding sites, and enhance salivary antioxidant levels. There were limitations in our study. Participants could not be blinded as the taste and color of the toothpaste were very evident. Moreover, the control toothpaste was a commonly available over-the-counter product. Numerous salivary antioxidant assays are available, but we limited our evaluation to the most commonly available assays at our disposal due to a paucity of resources. Also, the saliva collection was done after 2 hours of brushing due to which the antioxidant levels may be underestimated. Future studies should include the long-term beneficial effects of these polyherbal toothpastes. C onclusion Polyherbal toothpaste can be a suitable alternative in reducing plaque and gingivitis and enhancing salivary antioxidant levels. E thics ommittee Kasturba Medical College and Kasturba Hospital Institutional Ethics Committee (IEC1: 357/2022). A uthor ontributions Conceptualization: PKC, SK, RPS, GY, and LA. Data curation and validation: LA, GY, and RPS. Methodology: PKC and RPS. Data analysis: PKC. Project administration: PKC and SK. Initial draft: PKC, RPS, GY, and LA. Final draft: PKC and SK. Source of support: Conflict of interest: R eferences 1. Żukowski P Maciejczyk M Waszkiel D Sources of free radicals and oxidative stress in the oral cavity Arch Oral Biol 2018 92 8 17 29729478 10.1016/j.archoralbio.2018.04.018 2. Maciejczyk M Zalewska A Ładny JR Salivary antioxidant barrier, redox status, and oxidative damage to proteins and lipids in healthy children, adults, and the elderly Oxid Med Cell Longev 2019 2019 4393460 31885792 10.1155/2019/4393460 PMC6915128 3. Lushchak VI Free radicals, reactive oxygen species, oxidative stress and its classification Chem Biol Interact 2014 224 164 175 25452175 10.1016/j.cbi.2014.10.016 4. Ndokaj A Marasca B Duś- Ilnicka I et al. Dental and medical problems Dent Med Probl 2022 59 4 637 645 36537854 10.17219/dmp/145895 5. Tóthová L Kamodyová N Červenka T et al. Salivary markers of oxidative stress in oral diseases Front Cell Infect Microbiol 2015 5 73 26539412 10.3389/fcimb.2015.00073 PMC4611854 6. Smriti K Pai KM Ravindranath V et al. Role of salivary malondialdehyde in assessment of oxidative stress among diabetics J Oral Biol Craniofac Res 2016 6 1 41 44 26937368 10.1016/j.jobcr.2015.12.004 PMC4756067 7. Reznick AZ Shehadeh N Shafir Y et al. Free radicals related effects and antioxidants in saliva and serum of adolescents with type 1 diabetes mellitus Arch Oral Biol 2006 51 8 640 648 16620776 10.1016/j.archoralbio.2006.02.004 8. Waddington RJ Moseley R Embery G Reactive oxygen species: a potential role in the pathogenesis of periodontal diseases Oral Dis 2000 6 3 138 151 10822357 10.1111/j.1601-0825.2000.tb00325.x 9. Battino M Bullon P Wilson M et al. Oxidative injury and inflammatory periodontal diseases: the challenge of anti-oxidants to free radicals and reactive oxygen species Crit Rev Oral Biol Med 1999 10 4 458 476 10634583 10.1177/10454411990100040301 10. Trivedi S Lal N Mahdi AA et al. Evaluation of antioxidant enzymes activity and malondialdehyde levels in patients with chronic periodontitis and diabetes mellitus J Periodontol 2014 85 5 713 720 23895253 10.1902/jop.2013.130066 11. Hrishi TS Kundapur PP Naha A et al. Effect of adjunctive use of green tea dentifrice in periodontitis patients—a randomized controlled pilot study Int J Dent Hyg 2016 14 3 178 183 25690541 10.1111/idh.12131 12. Wolinsky LE Cuomo J Quesada K et al. A comparative pilot study of the effects of a dentifrice containing green tea bioflavonoids, sanguinarine or triclosan on oral bacterial biofilm formation J Clin Dent 2000 11 2 53 59 11460284 13. Abhishek KN Supreetha S Sam G et al. Effect of neem containing toothpaste on plaque and gingivitis—a randomized double blind clinical trial J Contemp Dent Pract 2015 16 11 880 883 26718296 10.5005/jp-journals-10024-1776 14. Azaripour A Mahmoodi B Habibi E et al. Effectiveness of a miswak extract-containing toothpaste on gingival inflammation: a randomized clinical trial Int J Dent Hyg 2017 15 3 195 202 26694786 10.1111/idh.12195 15. Quinlan R Robson G Pack AR A study comparing the efficacy of a toothpaste containing extract of Salvadora persica J N Z Soc Periodontol 1994 77 7 14 8699489 16. Arweiler NB Pergola G Kuenz J et al. Clinical and antibacterial effect of an anti-inflammatory toothpaste formulation with Scutellaria baicalensis Clin Oral Investig 2011 15 6 909 913 10.1007/s00784-010-0471-1 20936314 17. Saliasi I Llodra JC Bravo M et al. Effect of a toothpaste/mouthwash containing Carica papaya Int J Environ Res Public Health 2018 15 12 2660 30486374 10.3390/ijerph15122660 PMC6313435 18. de Oliveira SMA Torres TC Pereira SLDS et al. Effect of a dentifrice containing Aloe vera J Appl Oral Sci 2008 16 4 293 296 19089263 10.1590/S1678-77572008000400012 PMC4327540 19. Amoian B Moghadamnia AA Mazandarani M et al. The effect of Calendula Res J Med Plant 2010 4 3 132 140 20. George J Hegde S Rajesh KS et al. The efficacy of a herbal-based toothpaste in the control of plaque and gingivitis: a clinico-biochemical study Indian J Dent Res 2009 20 4 480 482 20139575 10.4103/0970-9290.59460 21. Pannuti CM de Mattos JP Ranoya PN et al. Clinical effect of a herbal dentifrice on the control of plaque and gingivitis: a double-blind study Pesqui Odontol Bras 2003 17 4 314 318 15107912 10.1590/s1517-74912003000400004 22. Ozaki F Pannuti CM Imbronito AV et al. Efficacy of a herbal toothpaste on patients with established gingivitis—a randomized controlled trial Braz Oral Res 2006 20 2 172 177 16878213 10.1590/s1806-83242006000200015 23. Howshigan J Perera K Samita S et al. The effects of an Ayurvedic medicinal toothpaste on clinical, microbiological and oral hygiene parameters in patients with chronic gingivitis: a double-blind, randomised, placebo-controlled, parallel allocation clinical trial Ceylon Med J 2015 60 4 126 132 26778391 10.4038/cmj.v60i4.8219 24. Al-Kholani AI Comparison between the efficacy of herbal and conventional dentifrices on established gingivitis Dent Res J (Isfahan) 2011 8 2 57 63 22013464 PMC3177395 25. Pentapati KC Kukkamalla MA Siddiq H et al. Effectiveness of novel herbal dentifrice in control of plaque, gingivitis, and halitosis—randomized controlled trial J Tradit Complement Med 2019 10 6 565 569 33134132 10.1016/j.jtcme.2019.06.006 PMC7588330 26. Suresh S Arumugham IM Doraikannan S et al. Comparing the effectiveness of herbal and conventional dentifrices in reducing dental plaque and gingivitis: a systematic review J Int Soc Prev Community Dent 2021 11 6 601 608 35036369 10.4103/jispcd.JISPCD_171_21 PMC8713501 27. Turesky S Gilmore ND Glickman I Reduced plaque formation by the chloromethyl analogue of victamine C J Periodontol 1970 41 1 41 43 5264376 10.1902/jop.1970.41.41.41 28. Quigley GA Hein JW Comparative cleansing efficiency of manual and power brushing J Am Dent Assoc 1962 65 26 29 14489483 10.14219/jada.archive.1962.0184 29. Talbott K Mandel ID Chilton NW Reduction of baseline gingivitis scores with repeated prophylaxes J Prev Dent 1977 4 6 28 29 275491 30. Loe H Silness J Periodontal disease in pregnancy. I. Prevalence and severity Acta Odontol Scand 1963 21 533 551 14121956 10.3109/00016356309011240 31. Kei S Serum lipid peroxide in cerebrovascular disorders determined by a new colorimetric method Clin Chim Acta 1978 90 1 37 43 719890 10.1016/0009-8981(78)90081-5 32. Sedlak J Lindsay RH Estimation of total, protein-bound, and nonprotein sulfhydryl groups in tissue with Ellman's reagent Anal Biochem 1968 25 1 192 205 4973948 10.1016/0003-2697(68)90092-4 33. Panjwani S Bagewadi A Keluskar V et al. Estimation and comparison of levels of salivary nitric oxide in patients with oral lichen planus and controls Int J Prev Med 2013 4 6 710 23930190 PMC3733040 34. Rao PV Gan SH Cinnamon: a multifaceted medicinal plant Evid Based Complement Alternat Med 2014 2014 642942 24817901 10.1155/2014/642942 PMC4003790 35. Pradeep CR Kuttan G Effect of piperine on the inhibition of nitric oxide (NO) and TNF-alpha production Immunopharmacol Immunotoxicol 2003 25 3 337 346 19180797 10.1081/iph-120024502 36. Majdalawieh AF Carr RI In vitro investigation of the potential immunomodulatory and anti-cancer activities of black pepper ( Piper nigrum Elettaria cardamomum J Med Food 2010 13 2 371 381 20210607 10.1089/jmf.2009.1131 37. Dwivedi D Singh V Effects of the natural compounds embelin and piperine on the biofilm-producing property of Streptococcus mutans J Tradit Complement Med 2016 6 1 57 61 26870681 10.1016/j.jtcme.2014.11.025 PMC4738039 38. Safiaghdam H Oveissi V Bahramsoltani R et al. Medicinal plants for gingivitis: a review of clinical trials Iran J Basic Med Sci 2018 21 10 978 991 30524670 10.22038/IJBMS.2018.31997.7690 PMC6281068 39. Hosadurga R Boloor VA Rao SN et al. Effectiveness of two different herbal toothpaste formulations in the reduction of plaque and gingival inflammation in patients with established gingivitis—a randomized controlled trial J Tradit Complement Med 2018 8 1 113 119 29321998 10.1016/j.jtcme.2017.04.005 PMC5755992 ",
  "metadata": {
    "Title of this paper": "Effectiveness of two different herbal toothpaste formulations in the reduction of plaque and gingival inflammation in patients with established gingivitis—a randomized controlled trial",
    "Journal it was published in:": "International Journal of Clinical Pediatric Dentistry",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488507/"
  }
}