{
  "title": "Paper_290",
  "abstract": "pmc Perm J 1290 permanentej tpj The Permanente Journal 1552-5767 1552-5775 Kaiser Permanente PMC12485251 PMC12485251.1 12485251 12485251 40717474 10.7812/TPP/25.028 TPJ-25-028 1 Brief Report patient-safety Patient safety health-care-quality Health care quality Optimizing Care for Neutropenic Fever in Pediatric Patients: An Analysis of Treatment Approaches and Clinical Outcomes https://orcid.org/0000-0002-4241-4119 Bhattacharjee Saptati MD, MPH  1  2 Zhao Yanting PhD  3 Tucker Lue-Yen S BA  3 https://orcid.org/0000-0002-9453-0242 Ritterman Weintraub Miranda L PhD, MPH  4 Hu Caroline MD  1  1 Department of Pediatrics, Kaiser Permanente Northern California, Oakland Medical Center Oakland CA USA  2 Now with Pediatric Hematology Oncology, Children’s Hospital Los Angeles Los Angeles CA USA  3 Division of Research, Kaiser Permanente Northern California Pleasanton CA USA  4 Graduate Medical Education, Kaiser Permanente Northern California, Oakland Medical Center Oakland CA USA Saptati Bhattacharjee, MD, MPH sbhattacharjee@chla.usc.edu 2025 28 7 2025 29 3 498051 97 104 28 07 2025 02 10 2025 03 10 2025 © 2025 The Authors. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Published by The Permanente Federation LLC under the terms of the CC BY-NC-ND 4.0 license https://creativecommons.org/licenses/by-nc-nd/4.0/ Abstract Introduction Febrile neutropenia is a serious complication in pediatric oncology. Kaiser Permanente Northern California hospitals use varying fever thresholds for admission criteria: the Kaiser Permanente Oakland hospital employs a threshold of 101.5 °F, and Kaiser Permanente Roseville and Kaiser Permanente Santa Clara use lower thresholds. This study aims to assess the potential risks associated with adopting different fever thresholds, including bacteremia, pediatric intensive care unit (PICU) transfer, septic shock, and length of hospital stay. Methods This retrospective cohort study includes Kaiser Permanente Northern California members aged 1 to 18 years with an oncologic diagnosis admitted to 1 of 3 Kaiser Permanente Northern California hospitals with neutropenic fever between 2016 and 2022. Patients admitted with a fever ≥ 101.5 °F (high-temperature group) were compared to those admitted with a fever < 101.5 °F (low-temperature group). Results The study cohort included 177 patients with a mean age of 8.2 ± 5.4 years, 59.3% male. Of these patients, 70 (39.6%) were in the low-temperature group, and 107 (60.5%) were in the high-temperature group. Overall, 24 (13.6%) patients developed bacteremia, and 24 (13.6%) required PICU transfer. Comparisons between the low- and high-temperature groups showed no statistically significant differences in rates of bacteremia (8.6% vs 16.8%, P P P P Discussion and Conclusion Future studies with larger sample sizes are needed to validate these findings. Similar studies evaluating outcomes based on admitting temperature can shed light on the most appropriate fever threshold for admission to optimize outcomes for pediatric oncology patients. Keywords fever neutropenia pediatric hospitalization outcomes pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Febrile neutropenia is a common and serious complication in pediatric oncology. Fever occurs in nearly 40% of neutropenic periods, especially in patients undergoing aggressive treatments for acute leukemia, non-Hodgkin lymphoma, solid tumors, or hematopoietic stem cell transplants (HSCT),  1  2 Despite its prevalence, there is no consistent definition for neutropenic fever across pediatric oncology centers in the United States. Some centers adopt the UK National Institute for Health and Care Excellence definition, setting a threshold ≥ 38 °C (100.4 °F) with an absolute neutrophil count (ANC) < 500 cells/uL. Others follow the joint American Society of Clinical Oncology/Infectious Diseases Society of America (ASCO/IDSA) guidelines for adults, defining neutropenic fever as a single oral temperature ≥ 38.3 °C (101 °F) or a temperature ≥ 38 °C (100.4 °F) sustained over 1 hour.  3 The absence of a standardized temperature threshold represents a notable gap in current research, especially for well-appearing, clinically stable patients.  4  5  6–9  10 Different Kaiser Permanente Northern California sites utilize varying temperature thresholds for pediatric neutropenic fever. For instance, Kaiser Permanente Roseville uses a threshold of 100.4 °F sustained for an hour or a single temperature of ≥ 101 °F, Kaiser Permanente Santa Clara uses a threshold of ≥ 100.5 °F, and Kaiser Permanente Oakland employs a threshold of ≥ 101.5 °F. This study aims to assess the potential risks associated with adopting different fever thresholds for hospital admission in patients with neutropenic fever across Kaiser Permanente Northern California sites. Methods This is a retrospective cohort study of pediatric Kaiser Permanente Northern California members aged 1 to 18 years with an oncologic diagnosis who were admitted to 1 of 3 Kaiser Permanente Northern California hospitals (Oakland, Roseville, and Santa Clara) with a diagnosis of neutropenic fever between January 1, 2016 and December 31, 2022. Kaiser Permanente Northern California is an integrated health care delivery system serving more than 4.5 million members across 21 medical centers and hospitals. The 3 centers in this study are referral centers and represent the only Kaiser Permanente Northern California facilities with capacity for pediatric oncology inpatient care. Kaiser Permanente Northern California members are representative of the Northern California population, with a similar distribution of neighborhood-linked income, education, and social vulnerability to their respective communities.  11 In this study, neutropenic fever is defined as fever in the context of an ANC < 500, identified using the International Classification of Disease, Tenth Revision, Clinical Modification [ICD-10-CM] diagnosis codes D70.9 and R50.81 and internal Kaiser Permanente Northern California diagnosis ID codes. Patients with a history of allogeneic hematopoietic stem cell transplantation (identified via structured electronic health record review by the study investigator [Saptati Bhattacharjee, MD, MPH]) or acute myeloid leukemia (identified using ICD-10-CM diagnosis codes) were excluded. All patients admitted to the hospital with neutropenic fever were reviewed by the investigator (Saptati Bhattacharjee) to confirm the temperature used for hospital admission. Patients with a fever of ≥ 101.5 °F were categorized as the high-temperature group, and those with a fever < 101.5 °F were categorized as the low-temperature group. If multiple eligible hospitalizations were found for a patient, only the first encounter was included in the analysis. The safety and efficacy outcomes included development of bacteremia, PICU transfer, septic shock, death within the index hospitalization, and length of hospital stay. Bacteremia was defined as a positive initial blood culture during hospitalization. Because PICU transfer is based on various factors, including patient acuity, need for more dedicated nursing care, and development of hemodynamic instability, the outcome of “developing septic shock” was defined based on the use of pressors evaluated by chart review by the investigator (Saptati Bhattacharjee). Patient demographic and clinical characteristics were extracted from Kaiser Permanente Northern California electronic databases. The neighborhood deprivation index (NDI) was used as a marker of socioeconomic status.  12 Comparisons between the high- and low-temperature groups were made using the t  13 P Results A total of 177 patients met selection criteria; 70 (39.6%) were admitted with a temperature < 101.5 °F, and 107 (60.5%) were admitted with a temperature ≥ 101.5 °F ( Table 1 Figure Table 1: Patient characteristics and outcomes according to admitting temperature Patient characteristics Total (N = 177, 100%) Low temperature (n = 70, 39.6%) High temperature (n = 107, 60.5%)  P  a Demographic characteristics Age, y, mean (SD) 8.2 (5.4) 7.3 (5.0) 8.8 (5.7) .08 Age, y, median (IQR) 6.0 (3.0–13.0) 5.5 (3.0–12.0) 8.0 (4.0–14.0) .09 Sex, n (%) .63 Male 105 (59.3) 40 (57.1) 65 (60.8) Female 72 (40.7) 30 (42.9) 42 (39.3) Race and ethnicity, n (%) .41 White 64 (36.2) 24 (34.3) 40 (37.4) Black 16 (9.0) 5 (7.1) 11 (10.3) Asian/Pacific Islander 35 (19.8) 12 (17.1) 23 (21.5) Hispanic 57 (32.2) 28 (40.0) 29 (27.1) Other 5 (2.8) 1 (1.4) 4 (3.7) Neighborhood deprivation index, n (%) .68 Quintile 1 (least deprived) 25 (14.1) 7 (10.0) 18 (16.8) Quintile 2 39 (22.0) 14 (20.0) 25 (23.4) Latinx Quintile 3 35 (19.8) 15 (21.4) 20 (18.7) Quintile 4 46 (26.0) 20 (28.6) 26 (24.3) Quintile 5 (most deprived) 32 (18.1) 14 (20.0) 18 (16.8) Clinical characteristics, n (%) Oncologic diagnosis .54 Leukemia (all types) 87 (49.2) 38 (54.3) 49 (45.8) Hodgkin/non-Hodgkin lymphoma 22 (12.4) 8 (11.4) 14 (13.1) Other solid tumors  b 68 (38.4) 24 (34.3) 44 (41.1) Outcomes Safety outcomes, n (%) Developed bacteremia 24 (13.6) 6 (8.6) 18 (16.8) .12 Transferred to PICU 24 (13.6) 9 (12.9) 15 (14.0) .83 Developed septic shock 7 (4.0) 2 (2.9) 5 (4.7) .71 Death 1 (0.6) 0 (0) 1 (0.9) NA Efficacy outcome Days of hospitalization, median (IQR) 4.4 (2.6–8.1) 4.5 (2.5–8.4) 4.2 (2.6–8.1) .98  Note: a Overall comparisons between low-temperature and high-temperature groups were tested using χ2 or Fisher’s exact tests for categorical variables, independent 2-sample t b “Other solid tumors” includes central nervous system tumor, connective/soft tissue tumor, bone/cartilage tumor, Wilms, renal cell carcinoma, neuroblastoma, germ cell tumor, thymoma, hepatoblastoma, and retinoblastoma. IQR, interquartile range; NA, not applicable; PICU, pediatric intensive care unit; SD, standard deviation. Figure: Distribution of patients by center type: high-threshold vs low-threshold. Studies have shown that decisions on hospital admission, especially in pediatrics, can be influenced by practitioner implicit bias.  14 P Clinical characteristics were similar between the 2 groups ( Table 1 In terms of the safety and efficacy outcomes, 24 patients (13.6%) developed bacteremia (6 [8.6%] in the low-temperature group, 18 [16.8%] in the high-temperature group, P P P Table 1 There were no statistically significant differences in outcomes between high- and low-threshold centers ( Table 2 Table 3 Table 2 Table 2: Outcomes according to (a) center using high- vs low-threshold criteria and (b) absolute neutrophil count group  (a) Outcomes by center  Total (N = 177, 100%)  Low-threshold center (n = 83, 46.9%)  High-threshold center (n = 94, 53.1%)   P value Safety outcomes, n (%) Developed bacteremia 24 (13.6) 9 (10.8) 15 (16.0) .32 Transferred to PICU 24 (13.6) 15 (18.1) 9 (9.6) .10 Developed septic shock 7 (4.0) 5 (6.0) 2 (2.1) .26 Death 1 (0.6) 0 (0) 1 (1.1) NA Efficacy outcome Days of hospitalization, median (IQR) 4.4 (2.6–8.1) 4.2 (2.7–8.9) 4.6 (2.6–7.7) .97  (b) Safety outcomes by ANC, n (%)  Very severe neutropenia (n = 124, 70.1%)  Severe neutropenia (n = 32, 18.1%)  Functionally neutropenic (n = 15, 8.5%)  Down-trending ANC (n = 6, 3.4%)   P Developed bacteremia 19 (15.3) 1 (3.1) 2 (13.3) 2 (33.3) .10 Transferred to PICU 9 (7.3) 6 (18.8) 8 (53.3) 1 (16.7) < .001 Developed septic shock 5 (4.0) 0 (0) 2 (13.3) 0 (0) .19 Death 0 (0) 0 (0) 1 (6.7) 0 (0) .12 ANC, absolute neutrophil count; IQR, interquartile range; NA, not applicable; PICU, pediatric intensive care unit. Table 3: Unadjusted risk ratios and 95% confidence intervals for developing bacteremia, being transferred to the pediatric intensive care unit, and developing septic shock Patient characteristics Bacteremia PICU stay Septic shock RR (95% CI)  P   a RR (95% CI)  P  a RR (95% CI)  P  a High temperature (reference = low temperature) 1.96 (0.82–4.70) .13 1.09 (0.51–2.35) .83 1.64 (0.33–8.20) .55 Age, y 0.97 (0.91–1.05) .48 1.00 (0.93–1.07) .92 1.28 (1.06–1.56) .01 Female (reference = male) 2.04 (0.96–4.34) .06 1.46 (0.69–3.06) .32 1.94 (0.45–8.43) .37 Race and ethnicity (reference = White) Black 0.80 (0.19–3.30) .76 1.33 (0.41–4.37) .63 2.00 (0.19–20.70) .56 Asian/Pacific Islander 0.91 (0.34–2.46) .86 0.61 (0.18–2.11) .43 0.91 (0.09–9.73) .94 Hispanic 0.67 (0.26–1.74) .41 1.12 (0.48–2.63) .79 1.68 (0.29–9.72) .56 Neighborhood deprivation index (reference = quintile 1) Quintile 2 2.24 (0.51–9.95) .29 0.48 (0.12–1.97) .31 0.65 (0.04–9.79) .75 Quintile 3 2.14 (0.47–9.76) .32 0.71 (0.20–2.59) .61 0.72 (0.05–10.89) .81 Quintile 4 0.82 (0.15–4.56) .82 0.68 (0.20–2.30) .53 1.09 (0.10–11.40) .94 Quintile 5 2.34 (0.52–10.63) .27 1.56 (0.53–4.60) .42 1.56 (0.15–16.27) .71 Oncologic diagnosis Leukemia (reference = no) 1.98 (0.89–4.38) .09 1.64 (0.76–3.57) .20 0.74 (0.17–3.22) .69 Hodgkin/non-Hodgkin lymphoma (reference = no) 1.76 (0.73–4.26) .21 0.29 (0.04–2.05) .22 1.12 (0.14–8.85) .92 Other solid tumors  b 0.42 (0.17–1.08) .07 0.80 (0.36–1.77) .58 1.20 (0.28–5.21) .81  Note: a Unadjusted RRs were obtained by log binomial regression model. b “Other solid tumors” includes central nervous system tumor, connective/soft tissue tumor, bone/cartilage tumor, Wilms, renal cell carcinoma, neuroblastoma, germ cell tumor, thymoma, hepatoblastoma, retinoblastoma. CI, confidence interval; PICU, pediatric intensive care unit; RR, risk ratio. Overall, although the unadjusted risk ratios show higher point estimates for bacteremia, PICU transfer, and septic shock in the high-temperature group compared to the low-temperature group, the differences are not statistically significant for any of the outcomes ( Table 3 Discussion This study found no statistically significant evidence that higher admitting temperatures led to poorer safety outcomes in pediatric patients with febrile neutropenia. Future studies can build on this finding to explore the clinical implications of different fever thresholds in pediatric patients with febrile neutropenia and determine the optimum temperature to use as a standardized admission threshold across centers, balancing quality of life and chance of nosocomial infection with risk for complications and sepsis from neutropenic infection. To the authors’ knowledge, this is the first study in the United States to compare admitting temperatures in pediatric febrile neutropenia. The differences in admission protocols across the 3 Kaiser Permanente Northern California sites provided a unique opportunity to study these variations. A notable finding was the death of 1 patient in the high-temperature group, with no deaths in the low-temperature cohort. Upon further review, the patient in question was afebrile upon admission but developed a fever of 102.9 °F on the second day and was functionally neutropenic from their disease burden. The patient ultimately defervesced with negative blood cultures at 48 hours, and the fever was attributed to inflammatory cytokine release associated with acute leukemia.  15,16 One limitation of this study was the inability to specifically analyze patients triaged at Kaiser Permanente Oakland with initial temperatures between 100.4 °F and 101.5 °F. These patients might have been hospitalized had they presented at different Kaiser Permanente sites; at Oakland, these patients received close follow-up with outpatient clinic and telehealth appointments. Investigating whether adverse outcomes occur in this subgroup would be valuable but challenging as they are not captured with the ICD-10 code for febrile neutropenia. Of the 107 patients in the high-temperature group, the majority developed their first fever within 12 to 24 hours preceding admission. Fifteen of the 107 patients (14.0%) had a documented lower-grade fever noted more than 24 hours prior to admission. Of these 15 patients, 2 were found to have positive blood cultures on admission. None of these 15 patients developed septic shock, required pressors, or were admitted to the PICU. There were no adverse outcomes in waiting for the patients to spike a temperature above 101.5 °F, and admitting earlier in their disease course would not have changed their management. A larger study with more participants and events would allow for more thorough investigation of potential confounders through multivariable analyses, which could better inform improvements in hospital admission practices. Expanding the study’s scope presents several future avenues. Increasing the study’s sample size or number of events by including additional medical center sites nationwide would improve the study’s ability to detect meaningful differences. Moreover, temperature could be studied as a continuous rather than dichotomous variable, revealing alternative temperature thresholds that better optimize safety and efficacy. Lastly, other variables may warrant examination in multivariate analyses. For example, considering the treatment phase (eg, induction, maintenance, delayed intensification) or timing of steroid pulses in a patient’s treatment regimen could shed light on how these factors influence the outcomes of interest. Conclusion The authors aim to expand upon this study in the future. Establishing standardized hospital admission criteria for febrile neutropenia in pediatric patients could potentially transform pediatric oncologic care, leading to improved quality of life, fewer nosocomial infections, and reduced implicit biases in medical decision-making. Acknowledgments The authors thank Eve Zaritsky of the Kaiser Permanente East Bay and San Francisco Research Training Program for guidance on research methods to assist with the creation of the study design. The authors are also deeply grateful to the patients included in this study for their contributions to their research findings, including from the use of data from the electronic health record. Author Contributions: Conflicts of Interest: Funding: Data-Sharing Statement: References 1. Castagnola E Fontana V Caviglia I et al. A prospective study on the epidemiology of febrile episodes during chemotherapy-induced neutropenia in children with cancer or after hemopoietic stem cell transplantation Clin Infect Dis 2007 45 10 1296 1304 10.1086/522533 17968824 2. Davis K Wilson S Febrile neutropenia in paediatric oncology Paediatr Child Health 2020 30 3 93 97 10.1016/j.paed.2019.12.002 3. Baluch A Shewayish SSN Neutropenic fever Infections in Neutropenic Cancer Patients Heidelberg, Germany: Springer Nature 2019 105 117 10.1007/978-3-030-21859-1_8 4. Lehrnbecher T Robinson PD Ammann RA et al. Guideline for the management of fever and neutropenia in pediatric patients with cancer and hematopoietic cell transplantation recipients: 2023 update J Clin Oncol 2023 41 9 1774 1785 10.1200/JCO.22.02224 36689694 PMC10022858 5. Mueller EL Jacob SA Cochrane AR Carroll AE Bennett WE Jr Variation in hospital admission from the emergency department for children with cancer: A pediatric health information system study Pediatr Blood Cancer 2020 67 6 e28140 10.1002/pbc.28140 32275120 PMC8955607 6. Sung L Johnston DL Approach to febrile neutropenia in the general paediatric setting Paediatr Child Health 2007 12 1 19 21 10.1093/pch/12.1.19 19030334 PMC2528657 7. Mukkada S Hakim H Fever in neutropenia: Time to re-evaluate an old paradigm? Lancet Child Adolesc Health 2020 4 7 480 481 10.1016/S2352-4642(20)30138-3 32497519 8. Cennamo F Masetti R Largo P Argentiero A Pession A Esposito S Update on febrile neutropenia in pediatric oncological patients undergoing chemotherapy Children 2021 8 12 1086 10.3390/children8121086 34943282 PMC8700030 9. Boeriu E Borda A Vulcanescu DD et al. Diagnosis and management of febrile neutropenia in pediatric oncology patients-A systematic review Diagnostics (Basel) 2022 12 8 1800 10.3390/diagnostics12081800 35892511 PMC9394251 10. Koenig C Bodmer N Agyeman PKA et al. 39·0°C versus 38·5°C ear temperature as fever limit in children with neutropenia undergoing chemotherapy for cancer: A multicentre, cluster-randomised, multiple-crossover, non-inferiority trial Lancet Child Adolesc Health 2020 4 7 495 502 10.1016/S2352-4642(20)30092-4 32497520 11. Davis AC Voelkel JL Remmers CL Adams JL McGlynn EA Comparing Kaiser Permanente members to the general population: Implications for generalizability of research Perm J 2023 27 2 87 98 10.7812/TPP/22.172 37170584 PMC10266863 12. Messer LC Laraia BA Kaufman JS et al. The development of a standardized neighborhood deprivation index J Urban Health 2006 83 6 1041 1062 10.1007/s11524-006-9094-x 17031568 PMC3261293 13. Spiegelman D Hertzmark E Easy SAS calculations for risk or prevalence ratios and differences Am J Epidemiol 2005 162 3 199 200 10.1093/aje/kwi188 15987728 14. Carter RG Lake S Explicitly addressing implicit bias on inpatient rounds: Student and faculty reflections Pediatrics 2023 151 5 e2023061585 10.1542/peds.2023-061585 37051801 15. Johnson M Neoplastic fever Palliat Med 1996 10 3 217 224 10.1177/026921639601000306 8817592 16. Toussaint E Bahel-Ball E Vekemans M et al. Causes of fever in cancer patients (prospective study over 477 episodes) Support Care Cancer 2006 14 7 763 769 10.1007/s00520-005-0898-0 16528534 ",
  "metadata": {
    "Title of this paper": "Causes of fever in cancer patients (prospective study over 477 episodes)",
    "Journal it was published in:": "The Permanente Journal",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485251/"
  }
}