{
  "title": "Paper_579",
  "abstract": "pmc ISME J ISME J 1478 ismej ismej The ISME Journal 1751-7362 1751-7370 Oxford University Press PMC12477602 PMC12477602.1 12477602 12477602 40568973 10.1093/ismejo/wraf130 wraf130 1 Original Article AcademicSubjects/SCI00010 AcademicSubjects/SCI00960 AcademicSubjects/SCI01150 AcademicSubjects/SCI02281  Eubacterium limosum Lu Yao  National Key Laboratory of Intelligent Tracking and Forecasting for Infectious Diseases, National Institute for Communicable Disease Control and Prevention, Chinese Center for Disease Control and Prevention Beijing 102206 China https://orcid.org/0000-0001-9834-5258 Lan Ruiting  School of Biotechnology and Biomolecular Sciences, University of New South Wales Sydney, NSW 2052 Australia Fan Qianhua  National Key Laboratory of Intelligent Tracking and Forecasting for Infectious Diseases, National Institute for Communicable Disease Control and Prevention, Chinese Center for Disease Control and Prevention Beijing 102206 China  Department of Epidemiology, Center for Global Health, School of Public Health, Nanjing Medical University Nanjing, Jiangsu 211166 China Tang Huijing  National Key Laboratory of Intelligent Tracking and Forecasting for Infectious Diseases, National Institute for Communicable Disease Control and Prevention, Chinese Center for Disease Control and Prevention Beijing 102206 China  Department of Epidemiology, Center for Global Health, School of Public Health, Nanjing Medical University Nanjing, Jiangsu 211166 China Hu Dalong  School of Biotechnology and Biomolecular Sciences, University of New South Wales Sydney, NSW 2052 Australia Zhang Shuwei  National Key Laboratory of Intelligent Tracking and Forecasting for Infectious Diseases, National Institute for Communicable Disease Control and Prevention, Chinese Center for Disease Control and Prevention Beijing 102206 China  Department of Epidemiology, Center for Global Health, School of Public Health, Nanjing Medical University Nanjing, Jiangsu 211166 China Lin Xiaoying  National Key Laboratory of Intelligent Tracking and Forecasting for Infectious Diseases, National Institute for Communicable Disease Control and Prevention, Chinese Center for Disease Control and Prevention Beijing 102206 China  Department of Epidemiology, Center for Global Health, School of Public Health, Nanjing Medical University Nanjing, Jiangsu 211166 China Wang Ruoshi  National Key Laboratory of Intelligent Tracking and Forecasting for Infectious Diseases, National Institute for Communicable Disease Control and Prevention, Chinese Center for Disease Control and Prevention Beijing 102206 China Zhao Ruiqing  National Key Laboratory of Intelligent Tracking and Forecasting for Infectious Diseases, National Institute for Communicable Disease Control and Prevention, Chinese Center for Disease Control and Prevention Beijing 102206 China Sun Hui  National Key Laboratory of Intelligent Tracking and Forecasting for Infectious Diseases, National Institute for Communicable Disease Control and Prevention, Chinese Center for Disease Control and Prevention Beijing 102206 China Liu Liyun  National Key Laboratory of Intelligent Tracking and Forecasting for Infectious Diseases, National Institute for Communicable Disease Control and Prevention, Chinese Center for Disease Control and Prevention Beijing 102206 China  Research Units of Discovery of Unknown Bacteria and Function, Chinese Academy of Medical Sciences Beijing 100730 China  Hebei Key Laboratory of Intractable Pathogens, Shijiazhuang Center for Disease Control and Prevention Shijiazhuang, Hebei 050011 China Xu Jianguo  National Key Laboratory of Intelligent Tracking and Forecasting for Infectious Diseases, National Institute for Communicable Disease Control and Prevention, Chinese Center for Disease Control and Prevention Beijing 102206 China  Department of Epidemiology, Center for Global Health, School of Public Health, Nanjing Medical University Nanjing, Jiangsu 211166 China  Research Units of Discovery of Unknown Bacteria and Function, Chinese Academy of Medical Sciences Beijing 100730 China Corresponding authors. Liyun Liu and Jianguo Xu, National Institute for Communicable Disease Control and Prevention, Chinese Center for Disease Control and Prevention, 155 Changbai Road, Beijing 102206, China. E-mails: liuliyun@icdc.cn xujianguo@icdc.cn 1 2025 26 6 2025 19 1 478932 wraf130 03 2 2025 27 5 2025 24 6 2025 29 9 2025 26 06 2025 30 09 2025 30 09 2025 © The Author(s) 2025. Published by Oxford University Press on behalf of the International Society for Microbial Ecology. 2025 https://creativecommons.org/licenses/by/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution License ( https://creativecommons.org/licenses/by/4.0/ Abstract Gut microbiota play a key role in ameliorating colorectal cancer (CRC). Eubacterium limosum In vitro E. limosum Enterobacter, Pseudomonas Staphylococcus Staphylococcus succinus . Roseburia Eubacterium Staphylococcus Enterococcus. E. limosum Graphical Abstract  Graphical Abstract Eubacterium limosum colorectal cancer metabolites tumor microenvironment gut microbiota Research Units of Discovery of Unknown Bacteria and Function 2018RU010 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Colorectal cancer (CRC) is a prevalent gastrointestinal malignancy, which ranks the 3 rd nd 1 2 3 4 Fusobacterium nucleatum Streptococcus bovis Enterotoxigenic Bacteroides fragilis Helicobacter pylori Escherichia coli 3 Lactobacillus gallinarum 5 Clostridium butyricum 6 Roseburia intestinalis + 7 Lactobacillus plantarum 8 Eubacterium callanderi in vivo in vitro 9  Eubacterium 10 Eubacterium 11 12 Ruminococcus Alistipes Eubacterium 13 Eubacterium The genus Eubacterium E. limosum 10 E. limosum + 14 E. limosum 15 E. limosum E. limosum 16 E. limosum In this study, we aimed to determine the mechanism of E. limosum E. limosum in vitro in vivo Materials and methods Cell culture The HT-29, Caco-2 (human colorectal adenocarcinoma), CT26 (mouse colorectal carcinoma), NCM460 (human normal colonic epithelium), A549 (human non-small cell lung cancer), Hela (human cervical cancer), AGS and MGC-803 (human gastric cancer) cell lines used in this study were all purchased from the Cell Resource Center of Peking Union Medical College. The experiments were all completed within three to 15 generations. Isolation and culture of E. limosum Fresh fecal samples from healthy volunteers were collected and gradient diluted in phosphate buffered saline (PBS), and 100 μl dilutions were evenly spread on reinforced clostridial medium (RCM; Hopebio, China) agar. After anaerobic incubation at 37°C for 48–72 h, white smooth colonies were selected and subcultured on RCM plates. Purified colonies were maintained in RCM broth with 20% glycerol and stored at −80°C. Subsequently, the species identity of isolates was determined using 16S rRNA gene sequencing. Three isolates (El1405, El1408, El1739) were identified as E. limosum E. limosum El1405 was revived from −80°C and anaerobically cultured at 37°C on RCM plates for 48 hours. E. coli 600 E. limosum 8 Animal experiments Female BALB/c mice (5–6 weeks, 16–18 g) were purchased from Vital River Lab Animal Technology Co., Ltd. (Beijing, China) [laboratory animal permit no. SYXK (Jing) 2022–0029]. Mice were maintained at 23 ± 2°C, 55% ± 5% relative humidity, and a 12 h light–dark cycle under specific pathogen-free conditions. At the end of the acclimatization period, CT26 cells (5 × 10 5 2 Bacterial gavage was started at the same time as tumor inoculation on Day 0. Mice were randomized and daily gavage with (i) PBS, (ii) E. limosum 8 Staphylococcus succinus 8 8 For the metabolites model, mice were daily gavaged with (i) indole-3-lactic acid (ILA) (Sigma-Aldrich, 20 mg/kg), [ 5 17 18 19 20 All animal studies were approved by the Ethics Review Committee of the National Institute for Communicable Disease Control and Prevention at the Chinese Center for Disease Control and Prevention (Approval number: 2024–004). Statistical analysis Differences between two groups were tested using Student’s t-test. Differences among multiple groups using one-way analysis of variance (ANOVA) test with multiple comparisons test. Tumor volume was determined by a two-way ANOVA test. All tests were performed using GraphPad Prism 9.0 software. Data were presented as mean ± SEM. P * P ** P *** P **** P Additional methods are provided in the supplemental material. Results  E. limosum Among three E. limosum E. limosum Fig. S1A E. coli Fig. 1A Fig. 1B Fig. 1C Fig. S1B Figure 1  E. limosum P * P ** P *** P **** P E. coli E. limosum Flow cytometry showed that compared with RCM treatment, CT26 cells treated with El1405CS significantly arrested the cell cycle of G0/G1 and G2/M phases, and decreased the distribution of S phase cells at 24 hours. El1405CS treatment induced early-stage and late-stage apoptosis of CT26 cells at 24 hours, whereas it induced late-stage apoptosis of CT26 cells at 48 hours ( Fig. 1D E Fig. S1C D We found that there was no significant change in the ability of El1405CS to inhibit the proliferation of CRC cells following various treatments (including adjusting the pH of El1405CS from 5.1 to 7.0, heating at 100°C for 10 minutes, or treatment with protease K) ( Fig. 1F S1E Fig. 1G S1F Potential anti-CRC metabolites in El1405CS were identified using untargeted LC–MS/MS assay. PCA indicated that the metabolite profiles of RCM and El1405CS were distinct ( Fig. 1H P Fig. 1I Tables S1 S2, and S3 Fig. 1J ILA and IAA are associated with tryptophan metabolism [ 21 Fig. S1G Fig. S1H I 21 CH223191 Fig. S1J Genomic evidence of E. limosum- To determine whether El1405 encodes the genes involved in the catabolism of above detected metabolite, genomic analysis of El1405 was performed. The El1405 genome contained genes encoding phenyllactate dehydrogenase (FldH) (41.8% identity, 97.3% coverage), tryptophan synthase beta chain (TrpB) (64.9% identity, 96.7% coverage), aldehyde dehydrogenase (AldH) (99.4% identity, 99.8% coverage), and aromatic amino acid aminotransferase (ArAT) (100% identity, 99.8% coverage), which are required for the production of indole derivatives ( Fig. 2A Fig. 2B Figure 2 Genomic and metabolome analyses of E. limosum E. limosum The genome of El1405 was found to contain all the genes required for the synthesis of L-arginine from L-glutamate ( Fig. 2C Fig. 2D  E. limosum To investigate the antitumor effect of El1405 in vivo, Fig. 3A Fig. 3B-D Fig. 3E Fig. 3F G P 22–31 Fig. 3H I 32 33 Figure 3  E. limosum P P * P ** P *** P **** P Analysis of 16S rRNA gene sequences from mouse cecal contents revealed a significant increase in microbial abundance in the El1405 group compared to the PBS group, whereas there was no significant difference between the El1405 and the NC groups in terms of alpha diversity ( Fig. 3J Fig. 3K Staphylococcus Lachnospiraceae_ Fig. 3L Staphylococcus LEfSe also showed that pathogenic genera, such as Staphylococcus Enterococcus 34–36 Fig. 3M Lachnospiraceae Roseburia Eubacterium 37 E. limosum Fig. S2A Supplementation with E. limosum TME contains various types of immune cells that play a significant role in tumor development [ 38 Fig. 4A Figure 4 Daily supplementation with E. limosum * P ** P *** P **** P Live bacteria have been found in various tumors [ 39 40 S. succinus Streptococcus danieliae Lactobacillus murinus Staphylococcus sciuri Fig. 4B S. succinus S. succinus Fig. 4C Sequencing of the 16S rRNA genes was performed on the tumors to investigate changes in intratumoral microbes. No significant difference was found in microbial abundance between the El1405 and PBS groups ( Fig. S2B Enterobacter Fig. 4D Pseudomonas Variovorax Enterobacter, Pseudomonas, and Staphylococcus Collinsella Fig. 4E 41 42 Inactivated E. Limosum We tested the antitumor effect of inactivated El1405 (El1405HT) in vivo Fig. 5A Fig. 5B-D Fig. 5E Figure 5 Inactivated E. limosum * P ** P *** P **** P Analysis of the 16S rRNA gene sequences from mouse cecal contents revealed that there was no significant difference in microbial abundance among the NC, PBS, El1405HT , Fig. 5F Fig. 5G L. murinus Lactobacillus taiwanensis Fig. 5H Clostridium 43 Fig. 5I Alistipes obesi  E. limosum To investigate the antitumor effect of El1405CS in vivo Fig. 6A Fig. 6B-D Fig. 6E Figure 6  E. limosum * P ** P *** P **** P E. limosum Analysis of the 16S rRNA gene sequences from mouse cecal contents revealed that there was no significant difference in microbial abundance among the NC, RCM, and El1405CS groups ( Fig. 6F Fig. 6G L. murinus L. taiwanensis Fig. 6H Bacteroides Eubacterium plexicaudatum Lachnospiraceae Fig. 6I Fig. S2C D Antitumor effect of metabolites in the CT26 syngeneic mouse model The antitumor effect of the metabolites of El1405 was investigated by using the CT26 syngeneic mouse model ( Fig. 7A Fig. 7B-D Fig. 7E Figure 7 Antitumor effect of metabolites in the CT26 syngeneic mouse model; (A) schematic diagram of the CT26 syngeneic mouse model and metabolites gavage schedule; (B) Oral gavage of metabolites daily, ILA, IAA, Arg, and butyrate significantly inhibited tumor growth, as evidenced by tumor volume; (C) representative tumor picture; (D) tumor weight in the CT26 syngeneic mouse model (n = 5); (E) ELISA for TNF-α, IFN-γ, CD4, CD8, IL-6, IL-10, and TGF-β in the tumor tissue; the statistical significance of the tumor volume was determined by two-way ANOVA test. Statistical significance was determined by one-way ANOVA with Dunnett’s multiple comparisons test (D and E). Data are presented as mean ± SEM. ns, not significant; * P ** P *** P **** P  E. limosum The serum metabolites of mice were analyzed by targeted metabolomics. Orthogonal partial least squares-discriminant analysis (OPLS-DA) revealed distinct serum metabolite profiles between the PBS and El1405 groups ( Fig. S2E Fig. S2F P Fig. 8A P Table S4 Fig. 8B Figure 8  E. limosum P * P ** P *** P **** P The serum levels of ILA, IAA, indole-3-carboxylic acid (ICA), melatonin, N-acetylserotonin, IAM, 5-hydroxyindole-3-acetic acid (5-HIAA), and GABA in mice treated with El1405 live bacteria were significantly higher than those in PBS-treated mice ( Fig. 8C Fig. S2G H Fig. 8D  S. succinus The effect of S. succinus Fig. S3A S. succinus S. succinus Fig. S3 44 S. succinus Fig. S3F Analysis of the 16S rRNA gene sequences from the mouse cecal contents revealed that there was no significant difference in microbial abundance among the NC, PBS, and S. succinus Fig. S3G S. succinus Fig. S3H L. taiwanensis L. murinus S. succinus Fig. S3I S. succinus, Clostridioides difficile, and S. succinus 45–47 Fig. S3J Discussion Previous studies have found that Eubacterium Escherichia Shigella Enterococcus Streptococcus 11 E. limosum Eubacterium E. limosum 15 5 E. limosum Recently, it has been reported that microbial derived metabolites play key roles in regulating anti-tumor response [ 48 L. plantarum 8 49 + 50 + 14 51 + + ArAT is a key enzyme in tryptophan metabolism [ 52 E. limosum E. limosum Lactobacillus reuteri 52 L. reuteri 53 Indole derivatives, including ILA and IAA, are downstream metabolites of L-tryptophan, which usually exert their effects through their receptor AhR [ 21 CH223191 L. gallinarum 5 54 55 56 Compared to the control group, live El1405 induced a significant increase in multiple indole derivatives (such as IAA and ILA). In contrast, El1405HT only increased IAA, whereas El1405CS exclusively elevated the level of 5-HIAA. This indicates that the complete bacterial viability of El1405 is crucial for coordinating microbial tryptophan metabolism. In addition, the levels of 5-HIAA, GABA, DHA, and anandamide were also increased in the serum of mice treated with El1405CS. 5-HIAA did not suppress the proliferation of CT26 cells, and though GABA showed an anti-proliferative effect in vitro in vivo 57 58 59 60 Our study found that 5-FU was present in the supernatant of El1405. Although there had been no reports that bacteria can synthesize 5-FU through natural metabolic pathways, our findings raise this possibility. However, further studies are required. Untargeted metabolomics analysis of the intestinal contents in the CT26 syngeneic mice indicated that El1405 intervention increased the levels of capecitabine, sabarubicin, enoxacin, and kirenol related to anti-tumor in the gut [ 22–31 23 24 22 29 30 31 Actinomycetes Streptomyces peucetius 61 62 The occurrence of CRC is closely related to the intestinal microbiota. Studies have demonstrated that several pathogenic species were enriched in CRC patients, including F. nucleatum Peptostreptococcus anaerobius Peptostreptococcus stomatis 11 12 63 Apc Min/+ 64 65 66 67 68 63 Companilactobacillus crustorum 69 C. butyricum 70 Lachnospiraceae Roseburia, Eubacterium Staphylococcus Enterococcus. Lachnospiraceae 71 Roseburia Eubacterium 37 72 + 20 Enterococcus faecalis Staphylococcus aureus 73–75 TME cells and their secreted molecules play critical roles in the pathogenesis of cancer, making them attractive therapeutic targets [ 76 + 77–80 + H H H + 81 82 83 84 Akkermansia muciniphila + + + + + 85 Bifidobacterium + 86 E. coli 87 88 Microorganisms in the TME affect cancer progression and treatment effectiveness [ 89–91 F. nucleatum E. coli B. fragilis E. faecalis Streptococcus gallolyticus, Peptostreptococcus 92 Enterobacter Pseudomonas Staphylococcus Staphylococcus xylosus Lactobacillus animalis, Streptococcus cuniculi 93 S. succinus S. succinus S. succinus S. succinus S. succinus 45 94 S. succinus 95 S. succinus S. succinus C. difficile M. sciuri C. difficile 96 Staphylococcus We verified that El1405CS could not inhibit the proliferation of human non-small cell lung cancer cell line A549 and the human cervical carcinoma cell line HeLa, whereas El1405 could inhibit the proliferation of digestive cancer cell lines including gastric cancer cell lines AGS and MGC-803 ( Fig. S2I 97 Fig. S2J In conclusion, our study demonstrates that E. limosum Limitations of the study The study has some limitations regarding mechanism investigation. We have only confirmed the antitumor effect of El1405 in the CT26 syngeneic mouse model. We will need to validate the antitumor effect of El1405 in Apc Min/+ Supplementary Material Supplemental_material_wraf130 Author contributions Yao Lu (Conceptualization, Investigation, Formal Analysis, Visualization, Writing—original draft, Writing—review & editing), Ruiting Lan (Writing—review & editing), Qianhua Fan (Investigation), Huijing Tang (Investigation), Dalong Hu (Writing—review & editing), Shuwei Zhang (Investigation), Xiaoying Lin (Investigation), Ruoshi Wang (Investigation), Ruiqing Zhao (Investigation), Hui Sun (Resources), Liyun Liu (Conceptualization, Supervision, Funding acquisition, Writing—review & editing), Jianguo Xu (Funding acquisition, Supervision). Conflicts of interest The authors declare no competing interests. Funding This work was supported by the Research Units of Discovery of Unknown Bacteria and Function (2018RU010). Data availability The article and Supplementary Material include the original contributions presented in this study. Further inquiries can be directed to the corresponding author. The GenBank accession number for the whole-genome sequence of strain El1405 is PRJNA1170505 PRJNA1172170 PRJNA1171310 Ethics approval and consent to participate The animal study was reviewed and approved by the Ethics Review Committee of the National Institute for Communicable Disease Control and Prevention at the Chinese Center for Disease Control and Prevention (Approval number: 2024–004). References 1. Bray F Ferlay J Soerjomataram I et al. Global cancer statistics 2018: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2018 68 394 424 10.3322/caac.21492 30207593 2. Brenner H Kloor M Pox CP Colorectal cancer Lancet Lond Engl 2014 383 1490 502 10.1016/S0140-6736(13)61649-9 24225001 3. Song M Chan AT Sun J Influence of the gut microbiome, diet, and environment on risk of colorectal cancer Gastroenterology 2020 158 322 40 10.1053/j.gastro.2019.06.048 31586566 PMC6957737 4. Dougherty MW Jobin C Intestinal bacteria and colorectal cancer: etiology and treatment Gut Microbes 2023 15 2185028 10.1080/19490976.2023.2185028 36927206 PMC10026918 5. Sugimura N Li Q Chu ESH et al. Lactobacillus gallinarum Gut 2021 71 2011 21 10.1136/gutjnl-2020-323951 34937766 PMC9484392 6. Xu H Luo H Zhang J et al. Therapeutic potential of clostridium butyricum Gut Microbes 2023 15 2186114 10.1080/19490976.2023.2186114 36941257 PMC10038047 7. Kang X Liu C Ding Y et al. Roseburia intestinalis + Gut 2023 72 2112 22 10.1136/gutjnl-2023-330291 37491158 PMC10579466 8. Zhang Q Zhao Q Li T et al. Lactobacillus plantarum + Cell Metab 2023 35 943 960.e9 10.1016/j.cmet.2023.04.015 37192617 9. Ryu SW Kim J-S Oh BS et al. Gut microbiota Eubacterium callanderi Microbiol Spectr 2022 10 e0253122 10.1128/spectrum.02531-22 36448791 PMC9769849 10. Mukherjee A Lordan C Ross RP et al. Gut microbes from the phylogenetically diverse genus Eubacterium Gut Microbes 2020 12 1802866 10.1080/19490976.2020.1802866 32835590 PMC7524325 11. Wang T Cai G Qiu Y et al. Structural segregation of gut microbiota between colorectal cancer patients and healthy volunteers ISME J 2012 6 320 9 10.1038/ismej.2011.109 21850056 PMC3260502 12. Gao R Wu C Zhu Y et al. Integrated analysis of colorectal cancer reveals cross-cohort gut microbial signatures and associated serum metabolites Gastroenterology 2022 163 1024 1037.e9 10.1053/j.gastro.2022.06.069 35788345 13. Routy B Le Chatelier E Derosa L et al. Gut microbiome influences efficacy of PD-1–based immunotherapy against epithelial tumors Science 2018 359 91 7 10.1126/science.aan3706 29097494 14. Zhu X Li K Liu G et al. Microbial metabolite butyrate promotes anti-PD-1 antitumor efficacy by modulating T cell receptor signaling of cytotoxic CD8 T cell Gut Microbes 2023 15 2249143 10.1080/19490976.2023.2249143 37635362 PMC10464552 15. Kanauchi O Fukuda M Matsumoto Y et al. Eubacterium limosum World J Gastroenterol 2006 12 1071 7 10.3748/wjg.v12.i7.1071 16534848 PMC4087899 16. Gou H Su H Liu D et al. Traditional medicine Pien Tze Huang suppresses colorectal tumorigenesis through restoring gut microbiota and metabolites Gastroenterology 2023 165 1404 19 10.1053/j.gastro.2023.08.052 37704113 17. Liu Y Yang K Jia Y et al. Gut microbiome alterations in high-fat-diet-fed mice are associated with antibiotic tolerance Nat Microbiol 2021 6 874 84 10.1038/s41564-021-00912-0 34017107 18. Ishitobi K Kotani H Iida Y et al. A modulatory effect of L-arginine supplementation on anticancer effects of chemoimmunotherapy in colon cancer-bearing aged mice Int Immunopharmacol 2022 113 109423 10.1016/j.intimp.2022.109423 36461608 19. Kim S Jo K Hong K-B et al. GABA and l-theanine mixture decreases sleep latency and improves NREM sleep Pharm Biol 2019 57 65 73 10.1080/13880209.2018.1557698 30707852 PMC6366437 20. He Y Fu L Li Y et al. Gut microbial metabolites facilitate anticancer therapy efficacy by modulating cytotoxic CD8 + Cell Metab 2021 33 988 1000.e7 10.1016/j.cmet.2021.03.002 33761313 21. Agus A Planchais J Sokol H Gut microbiota regulation of tryptophan metabolism in health and disease Cell Host Microbe 2018 23 716 24 10.1016/j.chom.2018.05.003 29902437 22. Bigioni M Benzo A Irrissuto C et al. Antitumour effect of combination treatment with Sabarubicin (MEN 10755) and cis-platin (DDP) in human lung tumour xenograft Cancer Chemother Pharmacol 2008 62 621 9 10.1007/s00280-007-0645-y 18038274 23. Alzahrani SM Al Doghaither HA Al-Ghafari AB et al. 5-fluorouracil and capecitabine therapies for the treatment of colorectal cancer Oncol Rep 2023 50 175 10.3892/or.2023.8612 37594133 24. Schmoll H-J Arnold D Update on capecitabine in colorectal cancer Oncologist 2006 11 1003 9 10.1634/theoncologist.11-9-1003 17030642 25. Luo X Yu Z Yue B et al. Obacunone reduces inflammatory signalling and tumour occurrence in mice with chronic inflammation-induced colorectal cancer Pharm Biol 2020 58 886 97 10.1080/13880209.2020.1812673 32878512 PMC8202763 26. Chidambara Murthy KN Jayaprakasha GK Patil BS Obacunone and obacunone glucoside inhibit human colon cancer (SW480) cells by the induction of apoptosis Food Chem Toxicol Int J Publ Br Ind Biol Res Assoc 2011 49 1616 25 10.1016/j.fct.2011.04.014 21515332 27. Kossoy G Zandbank J Tendler E et al. Epitalon and colon carcinogenesis in rats: proliferative activity and apoptosis in colon tumors and mucosa Int J Mol Med 2003 12 473 7 10.3892/ijmm.12.4.473 12964022 28. Anisimov VN Khavinson VK Popovich IG et al. Inhibitory effect of peptide Epitalon on colon carcinogenesis induced by 1,2-dimethylhydrazine in rats Cancer Lett 2002 183 1 8 10.1016/s0304-3835(02)00090-3 12049808 29. Jałbrzykowska K Chrzanowska A Roszkowski P et al. The new face of a well-known antibiotic: a review of the anticancer activity of enoxacin and its derivatives Cancers 2022 14 3056 10.3390/cancers14133056 35804828 PMC9264829 30. Melo S Villanueva A Moutinho C et al. Small molecule enoxacin is a cancer-specific growth inhibitor that acts by enhancing TAR RNA-binding protein 2-mediated microRNA processing Proc Natl Acad Sci USA 2011 108 4394 9 10.1073/pnas.1014720108 21368194 PMC3060242 31. Liu W Li Y Li C Kirenol exhibits the protective role against N-methyl-N-Nitrosourea-induced gastric cancer in rats via modulating the oxidative stress and inflammatory markers J Environ Pathol Toxicol Oncol Off Organ Int Soc Environ Toxicol Cancer 2020 39 345 55 10.1615/JEnvironPatholToxicolOncol.2020035475 33389906 32. Mu T Chu T Li W et al. N1, N12-Diacetylspermine is elevated in colorectal cancer and promotes proliferation through the miR-559/CBS axis in cancer cell lines J Oncol 2021 2021 6665704 10.1155/2021/6665704 34603448 PMC8486517 33. Venäläinen MK Roine AN Häkkinen MR et al. Altered polyamine profiles in colorectal cancer Anticancer Res 2018 38 3601 7 10.21873/anticanres.12634 29848716 34. D’Alessandro-Gabazza CN Kobayashi T Yasuma T et al. A staphylococcus Nat Commun 2020 11 1539 10.1038/s41467-020-15344-3 32210242 PMC7093394 35. Fiore E Van Tyne D Gilmore MS Pathogenicity of enterococci Microbiol Spectr 2019 7 10.1128/microbiolspec.GPP3-0053-2018 PMC6629438 31298205 36. Ab S Jenior ML Keenan O et al. Enterococci enhance Clostridioides difficile Nature 2022 611 780 6 10.1038/s41586-022-05438-x 36385534 PMC9691601 37. Vital M Howe AC Tiedje JM Revealing the bacterial butyrate synthesis pathways by analyzing (meta)genomic data mBio 2014 5 e00889 10.1128/mBio.00889-14 24757212 PMC3994512 38. de Visser KE Joyce JA The evolving tumor microenvironment: from cancer initiation to metastatic outgrowth Cancer Cell 2023 41 374 403 10.1016/j.ccell.2023.02.016 36917948 39. Zhang N Kandalai S Zhou X et al. Applying multi-omics toward tumor microbiome research iMeta 2023 2 e73 10.1002/imt2.73 38868335 PMC10989946 40. Nejman D Livyatan I Fuks G et al. The human tumor microbiome is composed of tumor type–specific intracellular bacteria Science 2020 368 973 80 10.1126/science.aay9189 32467386 PMC7757858 41. Kwon J Bae M Szamosvári D et al. Collinsella aerofaciens J Am Chem Soc 2023 145 7071 4 10.1021/jacs.3c00250 36952265 PMC10080676 42. Hirayama M Nishiwaki H Hamaguchi T et al. Intestinal Collinsella PLoS One 2021 16 e0260451 10.1371/journal.pone.0260451 34813629 PMC8610263 43. Biggs MB Medlock GL Moutinho TJ et al. Systems-level metabolism of the altered Schaedler flora, a complete gut microbiota ISME J 2017 11 426 38 10.1038/ismej.2016.130 27824342 PMC5270571 44. Liu W Xu J Wang M et al. Tumor-derived vascular endothelial growth factor (VEGF)-a facilitates tumor metastasis through the VEGF-VEGFR1 signaling pathway Int J Oncol 2011 39 1213 20 10.3892/ijo.2011.1138 21785819 45. Ruffier d’Epenoux L Fayoux E Laurent F et al. Staphylococcus succinus Emerg Infect Dis 2024 30 601 3 10.3201/eid3003.230986 38407206 PMC10902547 46. Gismene C González JEH de Freitas CM et al. Necrotic activity of ExhC from Mammaliicoccus sciuri Int J Biol Macromol 2024 254 127741 10.1016/j.ijbiomac.2023.127741 38287568 47. Sandhu BK McBride SM Clostridioides difficile Trends Microbiol 2018 26 1049 50 10.1016/j.tim.2018.09.004 30297117 PMC6637408 48. Jiang S Ma W Ma C et al. An emerging strategy: probiotics enhance the effectiveness of tumor immunotherapy via mediating the gut microbiome Gut Microbes 2024 16 2341717 10.1080/19490976.2024.2341717 38717360 PMC11085971 49. Tintelnot J Xu Y Lesker TR et al. Microbiota-derived 3-IAA influences chemotherapy efficacy in pancreatic cancer Nature 2023 615 168 74 10.1038/s41586-023-05728-y 36813961 PMC9977685 50. Meza-Perez S Liu M Silva-Sanchez A et al. Proteobacteria impair anti-tumor immunity in the omentum by consuming arginine Cell Host Microbe 2024 32 1177 1191.e7 10.1016/j.chom.2024.06.003 38942027 PMC11245731 51. Song L Du A Xiong Y et al. Γ-aminobutyric acid inhibits the proliferation and increases oxaliplatin sensitivity in human colon cancer cells Tumour Biol J Int Soc Oncodevelopmental Biol Med 2016 37 14885 94 10.1007/s13277-016-5367-5 27644246 52. Montgomery TL Eckstrom K Lile KH et al. Lactobacillus reuteri Microbiome 2022 10 198 10.1186/s40168-022-01408-7 36419205 PMC9685921 53. Wilson CA Kreychman J Gerstein M Assessing annotation transfer for genomics: quantifying the relations between protein sequence, structure and function through traditional and probabilistic scores J Mol Biol 2000 297 233 49 10.1006/jmbi.2000.3550 10704319 54. Fong W Li Q Ji F et al. Lactobacillus gallinarum Gut 2023 72 2272 85 10.1136/gutjnl-2023-329543 37770127 PMC10715476 55. Gao J Hou Y Yang X et al. Melatonin enhances the sensitivity of colorectal cancer cells to 5-fluorouracil through the regulation of the miR-532-3p/β-catenin pathway Environ Toxicol 2024 39 367 76 10.1002/tox.23978 37755321 56. Jurjus A El Masri J Ghazi M et al. Mechanism of action of melatonin as a potential adjuvant therapy in inflammatory bowel disease and colorectal cancer Nutrients 2024 16 1236 10.3390/nu16081236 38674926 PMC11054672 57. Murad LB da Silva NP de Araújo WM et al. Docosahexaenoic acid promotes cell cycle arrest and decreases proliferation through WNT/β-catenin modulation in colorectal cancer cells exposed to γ-radiation Biofactors Oxf Engl 2019 45 24 34 10.1002/biof.1455 30521071 58. Sam MR Tavakoli-Mehr M Safaralizadeh R Omega-3 fatty acid DHA modulates p53, survivin, and microRNA-16-1 expression in KRAS-mutant colorectal cancer stem-like cells Genes Nutr 2018 13 8 10.1186/s12263-018-0596-4 29619114 PMC5879572 59. Jiang Y-L Li X Tan Y-W et al. Docosahexaenoic acid inhibits the invasion and migration of colorectal cancer by reversing EMT through the TGF-β1/smad signaling pathway Food Funct 2024 15 9420 33 10.1039/d4fo02346c 39189524 60. Patsos HA Hicks DJ Dobson RRH et al. The endogenous cannabinoid, anandamide, induces cell death in colorectal carcinoma cells: a possible role for cyclooxygenase 2 Gut 2005 54 1741 50 10.1136/gut.2005.073403 16099783 PMC1774787 61. Arcamone F-M Sabarubicin Top Curr Chem 2008 283 171 89 10.1007/128_2007_1 23605632 62. Yang L Yang D Wang Q et al. Functional expression and purification of DoxA, a key cytochrome P450 from streptomyces peucetius ATCC 27952 PeerJ 2022 10 e14373 10.7717/peerj.14373 36411834 PMC9675340 63. Wong CC Yu J Gut microbiota in colorectal cancer development and therapy Nat Rev Clin Oncol 2023 20 429 52 10.1038/s41571-023-00766-x 37169888 64. Sh W Zhao L Zhang X et al. Gavage of fecal samples from patients with colorectal cancer promotes intestinal carcinogenesis in germ-free and conventional mice Gastroenterology 2017 153 1621 1633.e6 10.1053/j.gastro.2017.08.022 28823860 65. Li L Li X Zhong W et al. Gut microbiota from colorectal cancer patients enhances the progression of intestinal adenoma in Apc min/+ EBioMedicine 2019 48 301 15 10.1016/j.ebiom.2019.09.021 31594750 PMC6838415 66. Garrett WS Cancer and the microbiota Science 2015 348 80 6 10.1126/science.aaa4972 25838377 PMC5535753 67. Gagnière J Raisch J Veziant J et al. Gut microbiota imbalance and colorectal cancer World J Gastroenterol 2016 22 501 18 10.3748/wjg.v22.i2.501 26811603 PMC4716055 68. Viaud S Saccheri F Mignot G et al. The intestinal microbiota modulates the anticancer immune effects of cyclophosphamide Science 2013 342 971 6 10.1126/science.1240537 24264990 PMC4048947 69. Wang T Wang P Ge W et al. The probiotic Companilactobacillus crustorum via Food Funct 2021 12 11331 42 10.1039/d1fo01531a 34668003 70. Chen D Jin D Huang S et al. Clostridium butyricum Cancer Lett 2020 469 456 67 10.1016/j.canlet.2019.11.019 31734354 71. Zhou J Li M Chen Q et al. Programmable probiotics modulate inflammation and gut microbiota for inflammatory bowel disease treatment after effective oral delivery Nat Commun 2022 13 3432 10.1038/s41467-022-31171-0 35701435 PMC9198027 72. Archer SY Meng S Shei A et al. p21(WAF1) is required for butyrate-mediated growth inhibition of human colon cancer cells Proc Natl Acad Sci USA 1998 95 6791 6 10.1073/pnas.95.12.6791 9618491 PMC22637 73. Zhang L Liu J Deng M et al. Enterococcus faecalis J Transl Med 2023 21 72 10.1186/s12967-023-03929-7 36732757 PMC9896694 74. Henstra C van Praagh J Olinga P et al. The gastrointestinal microbiota in colorectal cancer cell migration and invasion Clin Exp Metastasis 2021 38 495 510 10.1007/s10585-021-10130-x 34748126 75. Odunitan TT Apanisile BT Akinboade MW et al. Microbial mysteries: Staphylococcus aureus Microb Pathog 2024 194 106831 10.1016/j.micpath.2024.106831 39089512 76. Bejarano L Jordāo MJC Joyce JA Therapeutic targeting of the tumor microenvironment Cancer Discov 2021 11 933 59 10.1158/2159-8290.CD-20-1808 33811125 77. Shin AE Giancotti FG Rustgi AK Metastatic colorectal cancer: mechanisms and emerging therapeutics Trends Pharmacol Sci 2023 44 222 36 10.1016/j.tips.2023.01.003 36828759 PMC10365888 78. Ivashkiv LB IFNγ: signalling, epigenetics and roles in immunity, metabolism, disease and cancer immunotherapy Nat Rev Immunol 2018 18 545 58 10.1038/s41577-018-0029-z 29921905 PMC6340644 79. Aggarwal BB Gupta SC Kim JH Historical perspectives on tumor necrosis factor and its superfamily: 25 years later, a golden journey Blood 2012 119 651 65 10.1182/blood-2011-04-325225 22053109 PMC3265196 80. Philip M Schietinger A CD8 + Nat Rev Immunol 2022 22 209 23 10.1038/s41577-021-00574-3 34253904 PMC9792152 81. Speiser DE Chijioke O Schaeuble K et al. CD4 + Nat Cancer 2023 4 317 29 10.1038/s43018-023-00521-2 36894637 82. Derynck R Turley SJ Akhurst RJ TGFβ biology in cancer progression and immunotherapy Nat Rev Clin Oncol 2021 18 9 34 10.1038/s41571-020-0403-1 32710082 PMC9721352 83. Shiri AM Zhang T Bedke T et al. IL-10 dampens antitumor immunity and promotes liver metastasis via PD-L1 induction J Hepatol 2024 80 634 44 10.1016/j.jhep.2023.12.015 38160941 PMC10964083 84. Fisher DT Appenheimer MM Evans SS The two faces of IL-6 in the tumor microenvironment Semin Immunol 2014 26 38 47 10.1016/j.smim.2014.01.008 24602448 PMC3970580 85. Shi L Sheng J Chen G et al. Combining IL-2-based immunotherapy with commensal probiotics produces enhanced antitumor immune response and tumor clearance J Immunother Cancer 2020 8 e000973 10.1136/jitc-2020-000973 33028692 PMC7542661 86. Sivan A Corrales L Hubert N et al. Commensal Bifidobacterium Science 2015 350 1084 9 10.1126/science.aac4255 26541606 PMC4873287 87. Geiger R Rieckmann JC Wolf T et al. L-arginine modulates T cell metabolism and enhances survival and anti-tumor activity Cell 2016 167 829 842.e13 10.1016/j.cell.2016.09.031 27745970 PMC5075284 88. Canale FP Basso C Antonini G et al. Metabolic modulation of tumours with engineered bacteria for immunotherapy Nature 2021 598 662 6 10.1038/s41586-021-04003-2 34616044 89. Zhao K Hu Y Microbiome harbored within tumors: a new chance to revisit our understanding of cancer pathogenesis and treatment Signal Transduct Target Ther 2020 5 136 10.1038/s41392-020-00244-1 32728023 PMC7391753 90. Heymann CJF Bard J-M Heymann M-F et al. The intratumoral microbiome: characterization methods and functional impact Cancer Lett 2021 522 63 79 10.1016/j.canlet.2021.09.009 34517085 91. Wong-Rolle A Wei HK Zhao C et al. Unexpected guests in the tumor microenvironment: microbiome in cancer Protein Cell 2021 12 426 35 10.1007/s13238-020-00813-8 33296049 PMC8106554 92. Janney A Powrie F Mann EH Host-microbiota maladaptation in colorectal cancer Nature 2020 585 509 17 10.1038/s41586-020-2729-3 32968260 93. Fu A Yao B Dong T et al. Tumor-resident intracellular microbiota promotes metastatic colonization in breast cancer Cell 2022 185 1356 1372.e26 10.1016/j.cell.2022.02.027 35395179 94. Song J Lim HX Lee A et al. Staphylococcus succinus Front Immunol 2019 10 1269 10.3389/fimmu.2019.01269 31231389 PMC6559308 95. Kalaora S Nagler A Nejman D et al. Identification of bacteria-derived HLA-bound peptides in melanoma Nature 2021 592 138 43 10.1038/s41586-021-03368-8 33731925 PMC9717498 96. Drewes JL Chen J Markham NO et al. Human colon cancer-derived Clostridioides difficile Cancer Discov 2022 12 1873 85 10.1158/2159-8290.CD-21-1273 35678528 PMC9357196 97. Haynes J Manogaran P Mechanisms and strategies to overcome drug resistance in colorectal cancer Int J Mol Sci 2025 26 1988 10.3390/ijms26051988 40076613 PMC11901061 ",
  "metadata": {
    "Title of this paper": "Mechanisms and strategies to overcome drug resistance in colorectal cancer",
    "Journal it was published in:": "The ISME Journal",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477602/"
  }
}