{
  "title": "Paper_1003",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469958 PMC12469958.1 12469958 12469958 41009656 10.3390/ijms26189084 ijms-26-09084 1 Article Integrating MALDI-MSI-Based Spatial Proteomics and Machine Learning to Predict Chemoradiotherapy Outcomes in Head and Neck Cancer https://orcid.org/0009-0002-7189-5617 Grzeski Marta Conceptualization Methodology Formal analysis Investigation Writing – original draft Writing – review & editing Visualization Project administration 1 https://orcid.org/0000-0002-8479-4885 Jensen Patrick Moeller Software Formal analysis Investigation Writing – review & editing Visualization 2 https://orcid.org/0000-0002-1998-4033 Hempel Benjamin-Florian Formal analysis Writing – review & editing 1 3 https://orcid.org/0000-0003-2913-8305 Thiele Herbert Methodology Writing – review & editing 4 https://orcid.org/0000-0002-5243-0331 Lellmann Jan Methodology Software Writing – review & editing Supervision 5 https://orcid.org/0000-0002-7897-7116 Schallenberg Simon Investigation Writing – review & editing 6 Budach Volker Resources Writing – review & editing 7 https://orcid.org/0000-0001-6773-9406 Keilholz Ulrich Conceptualization Writing – review & editing Funding acquisition 8 9 https://orcid.org/0000-0002-0512-549X Tinhofer Ingeborg Conceptualization Resources Writing – review & editing Project administration 7 9 Klein Oliver Conceptualization Methodology Software Writing – review & editing Supervision Funding acquisition 1 * Gazouli Maria Academic Editor 1 marta.grzeski@charite.de benjamin.hempel@fu-berlin.de 2 patmjen@dtu.dk 3 4 herbert.thiele@mevis.fraunhofer.de 5 jan.lellmann@uni-luebeck.de 6 simon.schallenberg@charite.de 7 prof.budach@radiotherapy.care ingeborg.tinhofer@charite.de 9 8 ulrich.keilholz@charite.de * oliver.klein@bih-charite.de 18 9 2025 9 2025 26 18 497349 9084 21 7 2025 05 9 2025 12 9 2025 18 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Head and neck squamous cell carcinoma (HNSCC) is often diagnosed at advanced stages. Due to pronounced intratumoral heterogeneity (ITH), reliable risk stratification and prediction of treatment response remain challenging. This study aimed to identify peptide signatures in HNSCC tissue that are associated with treatment outcomes in HPV-negative, advanced-stage HNSCC patients undergoing 5-fluorouracil/platinum-based chemoradiotherapy (CDDP-CRT). We integrated matrix-assisted laser desorption/ionization mass spectrometry imaging (MALDI-MSI) of tryptic peptides with univariate statistics and machine learning approaches to uncover potential prognostic patterns. Formalin-fixed, paraffin-embedded whole tumor sections from 31 treatment-naive, HPV-negative HNSCC patients were digested in situ with trypsin, and the generated peptides were analyzed using MALDI-MSI. Clinical follow-up revealed recurrence or progression (RecPro) in 20 patients, while 11 patients showed no evidence of disease (NED). Classification models were developed based on the recorded peptide profiles using both unrestricted and feature-restricted approaches, employing either the full set of m z m z MALDI-MSI spatial proteomics machine learning prognostic classifier head and neck cancer chemoradiotherapy outcome Federal Ministry of Education and Research (BMBF) 03LW0239K This research was funded by the Federal Ministry of Education and Research (BMBF), grant number 03LW0239K, through the project titled “Multimodal Clinical Mass Spectrometry to Target Treatment Resistance (MSTARS)”. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Head and neck squamous cell carcinoma (HNSCC) is the most common malignancy of the head and neck, arising from the mucosal epithelium of the oral cavity, pharynx, and larynx. HNSCC is the seventh most prevalent cancer globally, and its incidence continues to rise, with projections indicating an increase of 30% by 2030 [ 1 2 3 4 5 6 7 Reliable biomarkers for HNSCC remain scarce, despite extensive research on prognostic and predictive markers [ 8 9 10 11 Although substantial progress has been made in understanding the molecular pathways driving HNSCC, and numerous studies have proposed novel clinical factors and biomarkers, routine clinical practice still lacks reliable tools to inform treatment decisions based on a tumor’s individual genetic or biological profile [ 8 12 13 These requirements are effectively met by matrix-assisted laser desorption/ionization mass spectrometry imaging (MALDI-MSI), a technique that combines the high sensitivity of mass spectrometry with the spatial resolution typically associated with histological staining. Precisely, by acquiring separate mass spectra at each XY coordinate across the tissue, MALDI-MSI generates spatially resolved molecular maps that reflect the inherent biochemical composition of the tissue. Notably, unlike conventional histological assessments that rely on the prior selection of specific markers, MALDI-MSI enables spatially resolved, yet untargeted analysis of a wide range of analytes—including metabolites, proteins, peptides, lipids, and glycans—within a single tissue section [ 14 15 16 17 18 19 20 21 22 As a consequence of providing comprehensive and spatially resolved molecular signatures of tissue, MALDI-MSI generates large volumes of complex data, the analysis of which is both time- and computationally intensive. Recent advances in machine learning have enabled efficient dimensionality reduction in the high-dimensional datasets produced by MALDI-MSI, facilitating the identification of meaningful molecular signatures. By isolating relevant features, machine learning models can improve diagnostic accuracy, enable patient stratification, and offer deeper insights into molecular heterogeneity [ 17 23 24 25 In this pilot study, we integrate MALDI-MSI with univariate statistical analyses and machine learning to identify tryptic peptide signatures associated with treatment outcomes in HNSCC patients subjected to 5-fluorouracil/platinum-based chemoradiotherapy (CDDP-CRT). Using pre-treatment FFPE tumor specimens from patients with locally advanced, HPV-negative HNSCC, we focus on a subgroup known for poor therapeutic response. By leveraging the spatial resolution of MALDI-MSI and advanced statistical modeling, we aim to assess the prognostic accuracy of in situ proteomic signatures that could inform personalized treatment strategies. This approach holds promise for identifying patients at higher risk of recurrence, thereby supporting more informed clinical decision-making and potentially improving therapeutic outcomes. 2. Results In this study, we investigated whether MALDI-MSI of tryptic peptides in combination with machine learning could identify putative in situ proteomic signatures predictive of treatment outcome in patients with advanced-stage, HPV-negative HNSCC treated with concurrent 5-fluorouracil (5-FU) and cisplatin-based chemoradiotherapy (CDDP-CRT). The study material consisted of FFPE whole tissue specimens obtained at diagnosis from 31 patients. Based on clinical follow-up at two years post-treatment, 11 patients showed no evidence of disease (NED), while 20 experienced disease recurrence or progression (RecPro). To assess the specificity of the identified peptide signatures to the CDDP-CRT treatment regimen, the performance of the trained classification models was evaluated in a separate cohort of 29 HPV-negative HNSCC patients, treated with mitomycin C-based chemoradiotherapy (MMC-CRT). These patients were participants of the same clinical trial and were matched with the CDDP-CRT cohort for age and disease stage. Clinicopathological characteristics of both cohorts are detailed in Table 1 Supplementary Figure S1 All FFPE tissue samples were randomly arrayed on 17 indium tin oxide (ITO)-coated glass slides and processed in accordance with the workflow outlined in Figure 1 Supplementary Figure S3 In total, MALDI-MSI analysis of the examined CDDP-CRT tissue regions generated 109.310 mass spectra (RecPro: 57.198; NED: 52.112), with 711 aligned m z m z Supplementary Table S1 Supplementary Figure S4 2.1. Univariate Statistics in Combination with Bottom-Up Proteomics Reveals Discriminative m/z Features Associated with Treatment Outcome in HNSCC Since no reliable markers currently exist to predict CDDP-CRT treatment outcome in HNSCC, we first conducted univariate receiver operating characteristic (ROC) curve analysis to evaluate the ability of detected m z m z Supplementary Table S1 m z p The alignment of MALDI-MSI and nano-LC-ESI-MS/MS output enabled the initial identification of 247 out of 249 discriminative m z Supplementary Table S2 27 28 Supplementary Table S2 Supplementary Table S3 m z The spatial distribution of peptides corresponding to the four most discriminatory proteins, as determined by the ROC-AUC values of their respective peptide signals, in representative tissue specimens from both groups, is presented in Figure 2 Although the identified proteins demonstrated strong discriminatory power in distinguishing treatment outcomes within the investigated tissue cohort, their effectiveness as single markers in clinical settings may be limited due to biological variability in the general population, heterogeneous expression patterns across patients, and potential confounding factors that influence marker expression [ 29 2.2. Predictive Value of Multivariate MALDI-MSI–Derived Proteomic Signatures for Two-Year Outcomes in CDDP-CRT-Treated HNSCC Given that molecular signatures may offer improved robustness over individual markers, we then investigated the classification capacity of the in situ proteomic landscape of HNSCC tumor resections acquired via MALDI-MSI using a multivariate modeling approach. To this end, a logistic regression model was applied to two feature sets: all detected m z m z Supplementary Table S1 m z m z Table 2 A graphical summary of the classification performance of both models across all patients is presented in Figure 3 Supplementary Figure S5 2.2.1. Classification Performance Based on All MALDI-MSI m z At the spectral level, the model fitted to all m z Table 2 m z Based on a majority voting approach, defined as correct classification of more than 50% of all spectra per patient, the classification model trained on all m z Figure 3 m z Notably, as shown in Supplementary Figure S5 m z The distribution and magnitude of coefficients from a model fitted to all m z Supplementary Figure S6 m z m z m z m z m z m z Supplementary Table S4 m z m z m z m z m z m z Supplementary Figure S6 m z m z m z m z Supplementary Table S4 2.2.2. Feature Selection as a Means to Improve Specificity of the Classification Model Since the complete MALDI-MSI dataset—comprising all detected m z m z As summarized in the bottom panel of Table 2 m z m z Table 2 However, this improvement in specificity came at the cost of reduced sensitivity, reflecting a decreased ability to correctly identify true positives (here, NED patients). Compared to the full-feature model, the feature-restricted model showed a decrease in mean sensitivity; from 69% to 47% at the spectral level and from 75% to 52% at the patient level. In terms of balanced accuracy, the feature-restricted model performed slightly worse than the original one at the spectral level, achieving on average 60% compared to 65%. At the patient level, performance of both models was similar, with average balanced accuracy of 70.5% being recorded for the all m z As shown in Figure 3 m z Compared to the model trained on all m z m z As visualized in Supplementary Figure S5 Yet again, this degree of heterogeneity underscores the challenge of reliably assessing patient outcomes in a clinical setting, particularly when analyses are based on limited or unrepresentative tumor samples. 2.3. Performance of Classification Models in HNSCC Patient Cohort Subjected to Other Treatment Regimens To assess whether the identified peptide signatures and classification models are specific to prognosing outcomes following CDDP-CRT, we evaluated their performance in another HNSCC patient cohort that received mitomycin C-based CRT instead of the platinum-based regimen. This cohort originated from the same clinical study and was matched to the CDDP-CRT group by age and HPV status. Tissue specimens from the MMC-CRT cohort were randomly deposited across the same 17 glass slides that were used for the CDDP-CRT cohort to minimize potential batch effects. Clinicopathological details of the MMC-CRT cohort are presented in Table 1 Table 3 The classification models trained on the CDDP-CRT-treated HNSCC patient cohort performed poorly when applied to the MMC-CRT cohort. At the spectra level, balanced accuracy across cross-validation splits did not exceed 57% for the model using all m z m z m z m z 3. Discussion Despite advances in therapeutic strategies, HNSCC patients exhibit high recurrence, highlighting the medical need for robust molecular signatures to improve the patient risk assessment and enable personalized treatment. In this study, we employed MALDI-MSI of tryptic peptides to assess whether the spatially resolved intrinsic proteomic profiles of tumors resected from advanced-stage HNSCC patients—prior to the initiation of platinum-based chemoradiotherapy—could provide prognostic insights into treatment outcomes evaluated two years post-therapy. Patients were stratified based on clinical follow-up into two groups: poor outcome (RecPro) and favorable outcome (NED). Intratumoral heterogeneity is a major contributor to treatment failure, drug resistance, and tumor recurrence, making it difficult to identify robust molecular signatures for accurate risk stratification [ 30 31 32 33 As part of a standard data analysis pipeline for MALDI-MSI datasets, we first analyzed the recorded peptide signatures using univariate statistical methods (ROC) to evaluate the discriminatory potential of individual m z m z 34 35 36 37 38 39 40 Although the role of these proteins in modulating CRT outcome in HNSCC remains largely unexplored, altered expression of some has already been implicated in head and neck cancer development and progression. For example, downregulation of keratin 19 has been shown to influence the invasive phenotype of several squamous cell carcinoma cell lines, including those derived from the oral epithelium [ 41 42 43 44 45 In addition to spatial context, molecular signatures—combinations of multiple markers—have demonstrated better reliability for patient stratification and disease classification compared to single molecular markers, whose interpretative value is often limited by interindividual variability [ 46 47 48 49 MALDI-MSI provides spatially resolved molecular signatures, making it particularly well-suited for characterizing complex molecular patterns in diseased tissue. However, the high dimensionality of the data presents significant analytical challenges—especially when working with complex biological samples such as whole tissue specimens, as in our study—requiring both intensive mathematical and computational processing. Notably, the rich spatial and spectral information captured by MALDI-MSI is well-suited for machine learning (ML) approaches, which can effectively extract meaningful features from molecular distributions and spectral intensities [ 24 In this study, we implemented logistic regression models to evaluate the classification performance of intrinsic peptide profiles of investigated HNSCC tumors in distinguishing patients showing distinct treatment outcomes at 2 years post-treatment. Since the performance of the classification model may vary depending on the number of features being used [ 50 m z m z By integrating ML with full MALDI-MSI-derived in situ peptide profiles—using all detected m z 51 52 In our cohort, feature selection improved model specificity to nearly 92% at the patient level, significantly reducing false positives and thereby enhancing the identification of patients likely to experience poor outcomes from CDDP-CRT (i.e., the RecPro group). Accurate prognostication of an unfavorable outcome is particularly crucial, as CRT is associated with considerable cellular toxicity, which can elevate the risk of non-cancer-related mortality [ 7 However, the gain in specificity in the feature-restricted classification model came at the cost of reduced sensitivity, reflecting a higher rate of false negatives—i.e., misclassifying patients who are actually likely to experience a good treatment outcome. This trade-off was clearly evident in the NED group, where several patients shifted from being correctly to incorrectly classified following feature selection. These findings highlight a critical consideration in clinical model optimization: while feature selection can enhance classification performance for one subgroup (in this case, RecPro), it may reduce accuracy for others. It is important to note that the reduced sensitivity of the feature-restricted model in our study is likely attributable to the small cohort size and pronounced group imbalance, particularly the underrepresentation of patients with favorable treatment outcomes (i.e., the NED group, n = 11). The resulting limited biological variability could have contributed to model underfitting, affecting the robustness and generalizability of the results. Future studies involving larger and more balanced cohorts will be crucial to validate our findings and more fully capture patient heterogeneity and biological variability, ultimately enhancing model performance and clinical applicability. In addition to evaluating the classification performance of in situ proteomic profiles for prognosticating outcomes of CDDP-CRT, we also assessed whether the generated models could identify patients likely to respond well or poorly to an alternative chemoradiotherapy regimen—MMC-CRT. Interestingly, both models demonstrated poor performance in this setting, suggesting that the identified peptide-based proteomic signatures may be specifically associated with response to platinum-based treatment. As such, the results of this study should not be generalized to other CRT regimens. Moreover, due to the relatively small sample size, the presented findings warrant validation in a larger, independent cohort. Although, to the best of our knowledge, this is the very first study implementing MALDI-MSI to investigate the capacity of the intrinsic HNSCC proteome profile in distinguishing CRT treatment outcome, this technique has already been utilized to explore molecular signatures in HNSCC in the past. The majority of studies have focused on comparing the molecular composition of tumors with normal tissue or the surrounding microenvironment, underscoring its role in diagnostic tumor classification. Despite these differing objectives, the findings of these studies may still provide valuable insights in the context of our research. Bednarczyk et al. [ 53 21 m z m z Even more directly relevant to our own research, Kurczyk et al. [ 22 These observations further underline the importance of spatially resolved analyses, since these ITH profiles would be irretrievably lost during homogenization of the tissue, which is a prerequisite for all tissue bulk analysis techniques [ 54 In conclusion, in this study, MALDI-MSI in combination with ML was able to identify patients at elevated risk of recurrence following CDDP-CRT. In addition to facilitating tissue classification, these profiles show promise as prognostic tools, addressing a current gap in biomarker availability for this clinically and biologically heterogeneous group of malignancies. Given the substantial interpatient variability inherent to HNSCC, the prognostic performance of the proposed classification models must be validated in larger patient cohorts. This is expected to enhance classification sensitivity, an essential requirement for the reliable identification of treatment responders, and may provide deeper insights into the relationship between intratumoral heterogeneity and response to CRT. 4. Materials and Methods 4.1. Patient Material Formalin-fixed, paraffin-embedded (FFPE) primary tumor specimens were obtained at diagnosis from 60 HNSCC patients enrolled in the ARO-0401 phase III clinical trial. ARO-0401 was a prospective, randomized, multicentre study (total n = 364; recruitment completed in 2008) designed to optimize concurrent chemoradiotherapy (CRT) for advanced oropharyngeal and hypopharyngeal carcinoma [ 55 Supplementary Figure S1 Supplementary Figure S2 56 Table 1 4.2. Tissue Sample Preparation and MALDI-MSI Measurement MALDI-MSI was conducted on 5 µm thick FFPE tissue sections mounted on conductive glass slides (MALDI IntelliSlides, Bruker Daltonik GmbH, Bremen, Germany). A total of 17 glass slides were used, with tissue specimens from all 60 investigated patients (31 CDDP-CRT, 29 MMC-CRT) being randomly distributed across the slides. The slides were incubated at 60 °C for 1 h, then deparaffinized and rehydrated through sequential washing in xylene (2 × 5 min), isopropanol (100%; 1 × 5 min), graded ethanol (100%, 96%, 70%, and 50%; 1 × 5 min each), and MilliQ water (2 × 10 s). To reverse formaldehyde-induced protein cross-linking, heat-induced antigen retrieval was performed in near-boiling MilliQ water (~98 °C) for 20 min in a steamer. Afterwards, the slides were scanned at high resolution using a digital slide scanner (Reflecta MF 5000; Reflecta, Eutingen im Gäu, Germany). Trypsin/LysC solution (0.025 µg/µL in 20 mM ammonium bicarbonate buffer with 0.01% glycerol; Promega, Madison, WI, USA) was evenly applied onto the tissue sections using an automated spraying device (HTX TM-sprayer, HTX Technologies, Chapel Hill, NC, USA) under the following conditions: 16 layers, flow rate of 0.015 mL/min, spray velocity of 750 mm/min, track spacing of 2 mm, and nozzle temperature set to 30 °C. Enzymatic digestion was performed at 50 °C for 2 h in a humidified chamber containing saturated potassium sulfate solution. The slides were then coated with α-cyano-4-hydroxycinnamic acid (CHCA) matrix solution (7 mg/mL in 70% ACN, 1% TFA; Bruker Daltonik GmbH) using the same spraying device, with the following parameters: 4 layers, flow rate of 0.120 mL/min, velocity of 1200 mm/min, track spacing of 3 mm, and nozzle temperature of 75 °C. MALDI-MSI measurements were performed on a rapifleX MALDI Tissuetyper (Bruker Daltonik GmbH) mass spectrometer operating in positive ionization reflectron mode at a spatial resolution of 50 µm. The mass range was set to 600–3200 m z The annotation of tumor regions, defined as areas containing at least 70% tumor cells, was performed by two pathologists according to the “four-eyes” principle. To minimize temporal variability and ensure consistency across the dataset, all slides were annotated on the same day under identical conditions. Exemplary images of H&E-stained tissue specimens, along with pathological annotations of tumor regions, are provided in Supplementary Figure S3 4.3. MALDI-MSI Data Processing MALDI-MSI raw data were imported into and processed in SCiLS Lab 2024a Pro software (Bruker Daltonik GmbH, Bremen, Germany). Baseline removal was performed using the TopHat algorithm, with a peak width of 200, followed by total ion count normalization. Regions of interest (ROIs) corresponding to tumor areas were annotated using QuPath software under the guidance of a trained pathologist (S.S.) from the Institute of Pathology, Charité – Universitätsmedizin Berlin [ 57 4.4. Univariate Statistical Testing Receiver operating characteristic (ROC) curve analysis was conducted in SCiLS Lab software for all aligned m z 58 59 4.5. Machine Learning-Based Data Analysis Machine learning analysis, including logistic regression and cross-validation, was conducted outside of the SCiLS Lab software environment using the scikit-learn open-source tool ( https://scikit-learn.org Logistic regression analyses were performed in two ways: (1) using all detected m z m z m z m z m z 4.6. Protein Identification by Nano-LC-ESI-MS/MS A bottom-up nano-liquid chromatography electrospray ionization tandem mass spectrometry (nano-LC-ESI-MS/MS) analysis was performed on serial tissue sections from 4 randomly selected HPV/p16-negative HNSCC patients to identify m z Data acquisition was performed using a data-dependent acquisition method, with precursor ions automatically selected for MS/MS fragmentation via collision-induced dissociation using Auto MS/MS InstantExpertise mode. The raw data files (.baf) were analyzed using PEAKS Studio 12 (Bioinformatics Solutions Inc., Waterloo, ON, Canada) [ 60 Finally, in order to identify MALDI-MSI m z Acknowledgments The authors of this work want to cordially thank Marie-Lisa Eich for her valuable assistance with the pathological annotation of tumor regions, and Grit Nebrich and Sylwia Handzik for their excellent technical assistance with tissue preparation and measurement. We also gratefully acknowledge Gina Dörpholz and Pia-Katharina Larsen for their support in coordinating activities within the MSTARS project. Disclaimer/Publisher’s Note: Supplementary Materials The supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/ijms26189084/s1 Author Contributions Conceptualization, M.G., U.K., I.T. and O.K.; Formal analysis, M.G., P.M.J. and B.-F.H.; Funding acquisition, U.K. and O.K.; Investigation, M.G., P.M.J. and S.S.; Methodology, M.G., H.T., J.L. and O.K.; Project administration, M.G. and I.T.; Resources, V.B. and I.T.; Software, P.M.J., J.L. and O.K.; Supervision, J.L. and O.K.; Visualization, M.G. and P.M.J.; Writing—original draft, M.G.; Writing—review and editing, M.G., P.M.J., B.-F.H., H.T., J.L., S.S., V.B., U.K., I.T. and O.K. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was conducted in accordance with the Declaration of Helsinki, and approved by the Ethics Committee of Charité – Universitätsmedizin Berlin (vote number EA2/086/10, approval date: 6 October 2010). Informed Consent Statement Informed patient consent was obtained for the tumor samples used in the study. Data Availability Statement The original contributions presented in this study are included in the article/ Supplementary Materials Conflicts of Interest The authors declare no conflicts of interest. The funders had no role in the design of the study; in the collection, analyses, or interpretation of data; in the writing of the manuscript; or in the decision to publish the results. Abbreviations The following abbreviations are used in this manuscript: 5-FU 5-fluorouracil AUC Area under the curve CDDP cis-Diammindichloridoplatin (cisplatin) CHCA α-Cyano-4-hydroxycinnamic acid CRT Chemoradiotherapy FFPE Formalin-fixed paraffin-embedded H&E Hematoxylin and eosin HNSCC Head and neck squamous cell carcinoma HPV Human papillomavirus ITH Intratumoral heterogeneity ITO Indium tin oxide LC Liquid chromatography LCM Laser capture microdissection MALDI Matrix-assisted laser desorption/ionization ML Machine learning MMC Mitomycin C MSI Mass spectrometry imaging MS/MS Tandem mass spectrometry m z Mass-to-charge ratio NED No evidence of disease RecPro Recurrence/progression ROC Receiver operating characteristic ROI Region of interest TNM Tumor, node, metastasis References 1. Sung H. Ferlay J. Siegel R.L. Laversanne M. Soerjomataram I. Jemal A. Bray F. Global Cancer Statistics 2020: GLOBOCAN Estimates of Incidence and Mortality Worldwide for 36 Cancers in 185 Countries CA Cancer J. Clin. 2021 71 209 249 10.3322/caac.21660 33538338 2. Ferlay J. Colombet M. Soerjomataram I. Mathers C. Parkin D.M. Pineros M. Znaor A. Bray F. Estimating the global cancer incidence and mortality in 2018: GLOBOCAN sources and methods Int. J. Cancer 2019 144 1941 1953 10.1002/ijc.31937 30350310 3. Gormley M. Creaney G. Schache A. Ingarfield K. Conway D.I. Reviewing the epidemiology of head and neck cancer: Definitions, trends and risk factors Br. Dent. J. 2022 233 780 786 10.1038/s41415-022-5166-x 36369568 PMC9652141 4. Burri R.J. Lee N.Y. Concurrent chemotherapy and radiotherapy for head and neck cancer Expert. Rev. Anticancer Ther. 2009 9 293 302 10.1586/14737140.9.3.293 19275508 5. Pignon J.P. le Maitre A. Maillard E. Bourhis J. Group M.-N.C. Meta-analysis of chemotherapy in head and neck cancer (MACH-NC): An update on 93 randomised trials and 17,346 patients Radiother. Oncol. 2009 92 4 14 10.1016/j.radonc.2009.04.014 19446902 6. Rettig E.M. D’Souza G. Epidemiology of head and neck cancer Surg. Oncol. Clin. N. Am. 2015 24 379 396 10.1016/j.soc.2015.03.001 25979389 7. Rivelli T.G. Mak M.P. Martins R.E. da Costa e Silva V.T. de Castro G. Jr. Cisplatin based chemoradiation late toxicities in head and neck squamous cell carcinoma patients Discov. Med. 2015 20 57 66 26321088 8. Budach V. Tinhofer I. Novel prognostic clinical factors and biomarkers for outcome prediction in head and neck cancer: A systematic review Lancet Oncol. 2019 20 e313 e326 10.1016/S1470-2045(19)30177-9 31162105 9. Amin M.B. Greene F.L. Edge S.B. Compton C.C. Gershenwald J.E. Brookland R.K. Meyer L. Gress D.M. Byrd D.R. Winchester D.P. The Eighth Edition AJCC Cancer Staging Manual: Continuing to build a bridge from a population-based to a more \"personalized\" approach to cancer staging CA Cancer J. Clin. 2017 67 93 99 10.3322/caac.21388 28094848 10. Lydiatt W.M. Patel S.G. O’Sullivan B. Brandwein M.S. Ridge J.A. Migliacci J.C. Loomis A.M. Shah J.P. Head and Neck cancers-major changes in the American Joint Committee on cancer eighth edition cancer staging manual CA Cancer J. Clin. 2017 67 122 137 10.3322/caac.21389 28128848 11. Chen T.C. Wu C.T. Ko J.Y. Yang T.L. Lou P.J. Wang C.P. Chang Y.L. Clinical characteristics and treatment outcome of oropharyngeal squamous cell carcinoma in an endemic betel quid region Sci. Rep. 2020 10 526 10.1038/s41598-019-57177-1 31949181 PMC6965138 12. Mroz E.A. Tward A.D. Pickering C.R. Myers J.N. Ferris R.L. Rocco J.W. High intratumor genetic heterogeneity is related to worse outcome in patients with head and neck squamous cell carcinoma Cancer 2013 119 3034 3042 10.1002/cncr.28150 23696076 PMC3735618 13. Mroz E.A. Tward A.D. Hammon R.J. Ren Y. Rocco J.W. Intra-tumor genetic heterogeneity and mortality in head and neck cancer: Analysis of data from the Cancer Genome Atlas PLoS Med. 2015 12 e1001786 Erratum in PLoS Med. 2015 12 10.1371/journal.pmed.1001786 25668320 PMC4323109 14. Berghmans E. Boonen K. Maes E. Mertens I. Pauwels P. Baggerman G. Implementation of MALDI Mass Spectrometry Imaging in Cancer Proteomics Research: Applications and Challenges J. Pers. Med. 2020 10 54 10.3390/jpm10020054 32580362 PMC7354689 15. Schone C. Hofler H. Walch A. MALDI imaging mass spectrometry in cancer research: Combining proteomic profiling and histological evaluation Clin. Biochem. 2013 46 539 545 10.1016/j.clinbiochem.2013.01.018 23388677 16. Stillger M.N. Li M.J. Honscheid P. von Neubeck C. Foll M.C. Advancing rare cancer research by MALDI mass spectrometry imaging: Applications, challenges, and future perspectives in sarcoma Proteomics 2024 24 e2300001 10.1002/pmic.202300001 38402423 17. Klein O. Kanter F. Kulbe H. Jank P. Denkert C. Nebrich G. Schmitt W.D. Wu Z. Kunze C.A. Sehouli J. MALDI-Imaging for Classification of Epithelial Ovarian Cancer Histotypes from a Tissue Microarray Using Machine Learning Methods Proteom. Clin. Appl. 2019 13 e1700181 10.1002/prca.201700181 30471200 18. Pertzborn D. Arolt C. Ernst G. Lechtenfeld O.J. Kaesler J. Pelzel D. Guntinas-Lichius O. von Eggeling F. Hoffmann F. Multi-Class Cancer Subtyping in Salivary Gland Carcinomas with MALDI Imaging and Deep Learning Cancers 2022 14 4342 10.3390/cancers14174342 36077876 PMC9454426 19. Patterson N.H. Alabdulkarim B. Lazaris A. Thomas A. Marcinkiewicz M.M. Gao Z.H. Vermeulen P.B. Chaurand P. Metrakos P. Assessment of pathological response to therapy using lipid mass spectrometry imaging Sci. Rep. 2016 6 36814 10.1038/srep36814 27841360 PMC5107952 20. Hardesty W.M. Kelley M.C. Mi D. Low R.L. Caprioli R.M. Protein signatures for survival and recurrence in metastatic melanoma J. Proteom. 2011 74 1002 1014 10.1016/j.jprot.2011.04.013 PMC3178099 21549228 21. Hoffmann F. Umbreit C. Kruger T. Pelzel D. Ernst G. Kniemeyer O. Guntinas-Lichius O. Berndt A. von Eggeling F. Identification of Proteomic Markers in Head and Neck Cancer Using MALDI-MS Imaging, LC-MS/MS, and Immunohistochemistry Proteom. Clin. Appl. 2019 13 e1700173 10.1002/prca.201700173 30411850 22. Kurczyk A. Gawin M. Paul P. Chmielik E. Rutkowski T. Pietrowska M. Widlak P. Prognostic Value of Molecular Intratumor Heterogeneity in Primary Oral Cancer and Its Lymph Node Metastases Assessed by Mass Spectrometry Imaging Molecules 2022 27 5458 10.3390/molecules27175458 36080226 PMC9458238 23. Boskamp T. Lachmund D. Oetjen J. Cordero Hernandez Y. Trede D. Maass P. Casadonte R. Kriegsmann J. Warth A. Dienemann H. A new classification method for MALDI imaging mass spectrometry data acquired on formalin-fixed paraffin-embedded tissue samples Biochim. Biophys. Acta Proteins Proteom. 2017 1865 916 926 10.1016/j.bbapap.2016.11.003 27836618 24. Galli M. Zoppis I. Smith A. Magni F. Mauri G. Machine learning approaches in MALDI-MSI: Clinical applications Expert Rev. Proteom. 2016 13 685 696 10.1080/14789450.2016.1200470 27322705 25. Kanter F. Lellmann J. Thiele H. Kalloger S. Schaeffer D.F. Wellmann A. Klein O. Classification of Pancreatic Ductal Adenocarcinoma Using MALDI Mass Spectrometry Imaging Combined with Neural Networks Cancers 2023 15 686 10.3390/cancers15030686 36765644 PMC9913229 26. Ang K.K. Harris J. Wheeler R. Weber R. Rosenthal D.I. Nguyen-Tan P.F. Westra W.H. Chung C.H. Jordan R.C. Lu C. Human papillomavirus and survival of patients with oropharyngeal cancer N. Engl. J. Med. 2010 363 24 35 10.1056/NEJMoa0912217 20530316 PMC2943767 27. Cillero-Pastor B. Heeren R.M. Matrix-assisted laser desorption ionization mass spectrometry imaging for peptide and protein analyses: A critical review of on-tissue digestion J. Proteome Res. 2014 13 325 335 10.1021/pr400743a 24087847 28. Wu Z. Hundsdoerfer P. Schulte J.H. Astrahantseff K. Boral S. Schmelz K. Eggert A. Klein O. Discovery of Spatial Peptide Signatures for Neuroblastoma Risk Assessment by MALDI Mass Spectrometry Imaging Cancers 2021 13 3184 10.3390/cancers13133184 34202325 PMC8269054 29. Kushner I.K. Clair G. Purvine S.O. Lee J.Y. Adkins J.N. Payne S.H. Individual Variability of Protein Expression in Human Tissues J. Proteome Res. 2018 17 3914 3922 10.1021/acs.jproteome.8b00580 30300549 30. Rasmussen J.H. Olin A.B. Lelkaitis G. Hansen A.E. Andersen F.L. Johannesen H.H. Kjaer A. Fischer B.M. Specht L. Bentzen S.M. Intratumor heterogeneity is biomarker specific and challenges the association with heterogeneity in multimodal functional imaging in head and neck squamous cell carcinoma Eur. J. Radiol. 2021 139 109668 10.1016/j.ejrad.2021.109668 33848777 31. McGranahan N. Swanton C. Clonal Heterogeneity and Tumor Evolution: Past, Present, and the Future Cell 2017 168 613 628 10.1016/j.cell.2017.01.018 28187284 32. Kundig P. Giesen C. Jackson H. Bodenmiller B. Papassotirolopus B. Freiberger S.N. Aquino C. Opitz L. Varga Z. Limited utility of tissue micro-arrays in detecting intra-tumoral heterogeneity in stem cell characteristics and tumor progression markers in breast cancer J. Transl. Med. 2018 16 118 Erratum in J. Transl. Med. 2018 16 10.1186/s12967-018-1495-6 29739401 PMC5941467 33. Balermpas P. Michel Y. Wagenblast J. Seitz O. Weiss C. Rodel F. Rodel C. Fokas E. Tumour-infiltrating lymphocytes predict response to definitive chemoradiotherapy in head and neck cancer Br. J. Cancer 2014 110 501 509 Erratum in Br. J. Cancer 2014 110 10.1038/bjc.2013.640 24129245 PMC3899751 34. Eckert R.L. Sequence of the human 40-kDa keratin reveals an unusual structure with very high sequence identity to the corresponding bovine keratin Proc. Natl. Acad. Sci. USA 1988 85 1114 1118 10.1073/pnas.85.4.1114 2448790 PMC279716 35. Wiche G. Role of plectin in cytoskeleton organization and dynamics J. Cell Sci. 1998 111 Pt 17 2477 2486 10.1242/jcs.111.17.2477 9701547 36. Calderwood D.A. Shattil S.J. Ginsberg M.H. Integrins and actin filaments: Reciprocal regulation of cell adhesion and signaling J. Biol. Chem. 2000 275 22607 22610 10.1074/jbc.R900037199 10801899 37. Hailstones D.L. Gunning P.W. Characterization of human myosin light chains 1sa and 3nm: Implications for isoform evolution and function Mol. Cell Biol. 1990 10 1095 1104 10.1128/mcb.10.3.1095-1104.1990 2304459 PMC360973 38. Montagna G.N. Matuschewski K. Buscaglia C.A. Small heat shock proteins in cellular adhesion and migration: Evidence from Plasmodium genetics Cell Adhes. Migr. 2012 6 78 84 10.4161/cam.20101 22568951 PMC3499316 39. Gottardi C.J. Gumbiner B.M. Adhesion signaling: How beta-catenin interacts with its partners Curr. Biol. 2001 11 R792 R794 10.1016/S0960-9822(01)00473-0 11591340 40. Dowling J. Yu Q.C. Fuchs E. Beta4 integrin is required for hemidesmosome formation, cell adhesion and cell survival J. Cell Biol. 1996 134 559 572 10.1083/jcb.134.2.559 8707838 PMC2120864 41. Crowe D.L. Milo G.E. Shuler C.F. Keratin 19 downregulation by oral squamous cell carcinoma lines increases invasive potential J. Dent. Res. 1999 78 1256 1263 10.1177/00220345990780061001 10371250 42. Lu X. Mei Y. Fan C. Chen P. Li X. Zeng Z. Li G. Xiong W. Xiang B. Yi M. Silencing AHNAK promotes nasopharyngeal carcinoma progression by upregulating the ANXA2 protein Cell Oncol. 2024 47 833 850 10.1007/s13402-023-00898-3 37962808 43. Katada K. Tomonaga T. Satoh M. Matsushita K. Tonoike Y. Kodera Y. Hanazawa T. Nomura F. Okamoto Y. Plectin promotes migration and invasion of cancer cells and is a novel prognostic marker for head and neck squamous cell carcinoma J. Proteom. 2012 75 1803 1815 10.1016/j.jprot.2011.12.018 22245045 44. Rong C. Muller M.F. Xiang F. Jensen A. Weichert W. Major G. Plinkert P.K. Hess J. Affolter A. Adaptive ERK signalling activation in response to therapy and in silico prognostic evaluation of EGFR-MAPK in HNSCC Br. J. Cancer 2020 123 288 297 10.1038/s41416-020-0892-9 32424150 PMC7374086 45. Longuespee R. Alberts D. Baiwir D. Mazzucchelli G. Smargiasso N. De Pauw E. MALDI Imaging Combined with Laser Microdissection-Based Microproteomics for Protein Identification: Application to Intratumor Heterogeneity Studies Methods Mol. Biol. 2018 1788 297 312 10.1007/7651_2017_114 29224050 46. Hartl J. Kurth F. Kappert K. Horst D. Mulleder M. Hartmann G. Ralser M. Quantitative protein biomarker panels: A path to improved clinical practice through proteomics EMBO Mol. Med. 2023 15 e16061 10.15252/emmm.202216061 36939029 PMC10086577 47. Turck N. Vutskits L. Sanchez-Pena P. Robin X. Hainard A. Gex-Fabry M. Fouda C. Bassem H. Mueller M. Lisacek F. A multiparameter panel method for outcome prediction following aneurysmal subarachnoid hemorrhage Intensive Care Med. 2010 36 107 115 10.1007/s00134-009-1641-y 19760205 48. Robin X. Turck N. Hainard A. Lisacek F. Sanchez J.C. Muller M. Bioinformatics for protein biomarker panel classification: What is needed to bring biomarker panels into in vitro diagnostics? Expert Rev. Proteom. 2009 6 675 689 10.1586/epr.09.83 19929612 49. Drucker E. Krapfenbauer K. Pitfalls and limitations in translation from biomarker discovery to clinical utility in predictive and personalised medicine EPMA J. 2013 4 7 10.1186/1878-5085-4-7 23442211 PMC3599714 50. Hemphill E. Lindsay J. Lee C. Mandoiu I.I. Nelson C.E. Feature selection and classifier performance on diverse bio- logical datasets BMC Bioinform. 2014 15 (Suppl. 13) S4 10.1186/1471-2105-15-S13-S4 PMC4248652 25434802 51. Zhang Y. Bernau C. Parmigiani G. Waldron L. The impact of different sources of heterogeneity on loss of accuracy from genomic prediction models Biostatistics 2020 21 253 268 10.1093/biostatistics/kxy044 30202918 PMC7868050 52. Benkarim O. Paquola C. Park B.Y. Kebets V. Hong S.J. Vos de Wael R. Zhang S. Yeo B.T.T. Eickenberg M. Ge T. Population heterogeneity in clinical cohorts affects the predictive accuracy of brain imaging PLoS Biol. 2022 20 e3001627 10.1371/journal.pbio.3001627 35486643 PMC9094526 53. Bednarczyk K. Gawin M. Chekan M. Kurczyk A. Mrukwa G. Pietrowska M. Polanska J. Widlak P. Discrimination of normal oral mucosa from oral cancer by mass spectrometry imaging of proteins and lipids J. Mol. Histol. 2019 50 1 10 10.1007/s10735-018-9802-3 30390197 PMC6323087 54. Wisniewski J.R. Dus K. Mann M. Proteomic workflow for analysis of archival formalin-fixed and paraffin-embedded clinical samples to a depth of 10 000 proteins Proteom. Clin. Appl. 2013 7 225 233 10.1002/prca.201200046 23090905 55. Tinhofer I. Stenzinger A. Eder T. Konschak R. Niehr F. Endris V. Distel L. Hautmann M.G. Mandic R. Stromberger C. Targeted next-generation sequencing identifies molecular subgroups in squamous cell carcinoma of the head and neck with distinct outcome after concurrent chemoradiation Ann. Oncol. 2016 27 2262 2268 10.1093/annonc/mdw426 27681865 56. Hess A.K. Muer A. Mairinger F.D. Weichert W. Stenzinger A. Hummel M. Budach V. Tinhofer I. MiR-200b and miR-155 as predictive biomarkers for the efficacy of chemoradiation in locally advanced head and neck squamous cell carcinoma Eur. J. Cancer 2017 77 3 12 10.1016/j.ejca.2017.02.018 28347920 57. Bankhead P. Loughrey M.B. Fernandez J.A. Dombrowski Y. McArt D.G. Dunne P.D. McQuaid S. Gray R.T. Murray L.J. Coleman H.G. QuPath: Open source software for digital pathology image analysis Sci. Rep. 2017 7 16878 10.1038/s41598-017-17204-5 29203879 PMC5715110 58. Hosmer D. Lemeshow S. Applied Logistic Regression 2nd ed. John Wiley and Sons New York, NY, USA 2000 Chapter 5 59. Sonego P. Kocsor A. Pongor S. ROC analysis: Applications to the classification of biological sequences and 3D structures Brief. Bioinform. 2008 9 198 209 10.1093/bib/bbm064 18192302 60. Zhang J. Xin L. Shan B. Chen W. Xie M. Yuen D. Zhang W. Zhang Z. Lajoie G.A. Ma B. PEAKS DB: De novo sequencing assisted database search for sensitive and accurate peptide identification Mol. Cell Proteom. 2012 11 M111.010587 10.1074/mcp.M111.010587 PMC3322562 22186715 Figure 1 Schematic of the study’s analytical workflow, featuring ( A B BioRender.com Figure 2 Signal intensity distribution of four tentatively identified proteins across two representative tissue specimens from the investigated cohorts: ( top bottom Figure 3 Classification performance of the logistic regression models evaluated in this study. ( A m z m z B ijms-26-09084-t001_Table 1 Table 1 Clinicopathological characteristics of the investigated patient cohorts.   CDDP-CRT MMC-CRT  total number (n) 31 29 Age at diagnosis  56.4 (±9.3) 56.1 (±6.2) Sex male 24 (77%) 23 (79%)  female 7 (23%) 6 (21%) HPV negative 33 (100%) 29 (100%) Stage of the disease IVA 27 (87%) 26 (90%)  IVB 4 (13%) 3 (10%) Risk category 1 high 33 (100%) 29 (100%) Smoking yes 18 (58%) 23 (79%)  no 13 (42%) 6 (21%) Localization oropharynx 15 (55%) 16 (55%)  hypopharynx 16 (45%) 13 (45%) Outcome 2 NED 11 (35%) 14 (48%)  RecPro 20 (65%) 15 (52%) 1 26 2 ijms-26-09084-t002_Table 2 Table 2 Classification results and model performance metrics across five cross-validation splits using the full (all m z m z Model Level Metric Split 1 Split 2 Split 3 Split 4 Split 5 Mean all m z Spectra b.acc. 0.917 0.388 0.824 0.690 0.452 0.654  AUC 0.975 0.293 0.899 0.892 0.449 0.702  sensitivity 0.945 0.049 0.830 0.993 0.646 0.693  specificity 0.888 0.727 0.819 0.388 0.257 0.616 Patient b.acc. 1.000 0.375 0.900 0.750 0.500 0.705  AUC 1.000 0.500 1.000 0.833 0.438 0.754  sensitivity 1.000 0.000 1.000 1.000 0.750 0.750  specificity 1.000 0.750 0.800 0.500 0.250 0.660 249 m z Spectra b.acc. 0.903 0.414 0.679 0.544 0.471 0.602  AUC 0.967 0.470 0.791 0.555 0.433 0.643  sensitivity 0.947 0.033 0.489 0.554 0.345 0.474  specificity 0.859 0.794 0.869 0.535 0.597 0.731 Patient b.acc. 1.000 0.500 0.667 0.917 0.500 0.717  AUC 1.000 0.500 1.000 0.833 0.375 0.742  sensitivity 1.000 0.000 0.333 1.000 0.250 0.517  specificity 1.000 1.000 1.000 0.833 0.750 0.917 ijms-26-09084-t003_Table 3 Table 3 Performance metrics of classification models trained on the CDDP-CRT cohort applied to the MMC-CRT patient cohort. Model Level Metric Split 1 Split 2 Split 3 Split 4 Split 5 Mean all m z Spectra b.acc. 0.509 0.568 0.564 0.538 0.534 0.543  AUC 0.524 0.586 0.585 0.575 0.546 0.563  sensitivity 0.399 0.469 0.454 0.573 0.480 0.475  specificity 0.618 0.667 0.674 0.504 0.589 0.610 Patient b.acc. 0.440 0.540 0.474 0.445 0.443 0.469  AUC 0.476 0.476 0.538 0.467 0.457 0.483  sensitivity 0.214 0.214 0.214 0.357 0.286 0.257  specificity 0.667 0.867 0.733 0.533 0.600 0.680 249 m z Spectra b.acc. 0.485 0.466 0.509 0.524 0.465 0.490  AUC 0.477 0.460 0.506 0.526 0.440 0.482  sensitivity 0.415 0.257 0.340 0.449 0.198 0.332  specificity 0.555 0.675 0.679 0.599 0.733 0.648 Patient b.acc. 0.376 0.369 0.436 0.405 0.469 0.411  AUC 0.438 0.390 0.424 0.419 0.448 0.424  sensitivity 0.286 0.071 0.071 0.143 0.071 0.129  specificity 0.467 0.667 0.800 0.667 0.867 0.693 ",
  "metadata": {
    "Title of this paper": "PEAKS DB: De novo sequencing assisted database search for sensitive and accurate peptide identification",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469958/"
  }
}