{
  "title": "Paper_920",
  "abstract": "pmc J Clin Med J Clin Med 2745 jclinmed jcm Journal of Clinical Medicine 2077-0383 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471212 PMC12471212.1 12471212 12471212 41010845 10.3390/jcm14186641 jcm-14-06641 1 Article Dinutuximab Beta for the Treatment of High-Risk Neuroblastoma: Data from the Hungarian Pediatric Oncology Network Hernádfői Márk Conceptualization Methodology Formal analysis Investigation Resources Data curation Writing – original draft Writing – review & editing Supervision 1 2 Szabados Márton Conceptualization Investigation Data curation Writing – review & editing Supervision 1 3 Brückner Edit Conceptualization Investigation Data curation Writing – review & editing Supervision 3 Varga Ágnes Conceptualization Investigation Data curation Writing – review & editing Supervision 4 https://orcid.org/0000-0002-8307-8975 Hauser Péter Conceptualization Investigation Data curation Writing – review & editing Supervision 3 4 5 6 https://orcid.org/0000-0002-8990-6620 Ottóffy Gábor Conceptualization Investigation Data curation Writing – review & editing Supervision 7 Vojcek Ágnes Conceptualization Investigation Data curation Writing – review & editing Supervision 7 Csanádi Krisztina Conceptualization Investigation Data curation Writing – review & editing Supervision 8 https://orcid.org/0000-0001-6071-8290 Kertész Gabriella Conceptualization Investigation Data curation Writing – review & editing Supervision 5 Jakab Zsuzsanna Conceptualization Methodology Formal analysis Investigation Data curation Writing – review & editing Supervision 3 https://orcid.org/0000-0003-2489-3790 Agócs Gergely Conceptualization Methodology Formal analysis Investigation Data curation Writing – original draft Writing – review & editing Visualization Supervision 1 9 https://orcid.org/0000-0003-4298-2746 Garami Miklós Conceptualization Methodology Formal analysis Investigation Data curation Writing – original draft Writing – review & editing Supervision 1 3 * Herold Nikolas Academic Editor 1 hernadfoi.mark@bethesda.hu szabados.marton@semmelweis.hu agocs.gergely@semmelweis.hu 2 3 bruckner.edit@semmelweis.hu hauserpeti@yahoo.com dr.jakab.zsuzsa@gmail.com 4 agnesvargadr@gmail.com 5 kerteszgabi77@gmail.com 6 7 ottoffy.gabor@pte.hu vojcek.agnes@pte.hu 8 csakri.dr@gmail.com 9 * garami.miklos@semmelweis.hu 20 9 2025 9 2025 14 18 497642 6641 05 8 2025 05 9 2025 18 9 2025 20 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives: Methods: Results: Conclusions: anti-GD2 monoclonal antibody dinutuximab beta high-risk neuroblastoma immunotherapy maintenance therapy refractory and relapsed neuroblastoma Recordati Rare Diseases National Research, Development and Innovation Fund KDP-12-3/PALY-2022 The preparation of this manuscript was funded by Recordati Rare Diseases. M. Hernádfői was supported by the KDP-21 Cooperative Doctoral Programme for Doctoral Scholarships (KDP-12-3/PALY-2022) of the Ministry for Innovation and Technology, funded by the National Research, Development and Innovation Fund. Sponsors had no role in the design, data collection, analysis, interpretation, and manuscript preparation. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The incidence of neuroblastoma, a malignancy of the peripheral sympathetic nervous system [ 1 2 3 4 5 5 6 7 8 6 For patients with HR-NB, anti-GD2 monoclonal antibodies, such as dinutuximab beta, have become the standard of care maintenance therapy in the first-line setting [ 9 10 11 12 13 2 2 12 13 14 15 HuPON is a professional organization dedicated to advancing the care of children with cancer and to oncology research in Hungary ( https://www.gyermekdaganat.hu/ 16 We present data from patients with HR-NB included in the Hungarian Childhood Cancer Registry who received dinutuximab beta either as first-line maintenance therapy or in the relapsed or refractory setting. 2. Materials and Methods A retrospective review was undertaken of data from patients with HR-NB who had received dinutuximab beta immunotherapy first-line or in the relapsed or refractory setting in one of the following five HuPON centers in Hungary between October 2018 and February 2023: Pediatric Center, Semmelweis University, Budapest; Heim Pál National Pediatrics Institute, Budapest; Department of Pediatric Bone Marrow & Stem Cell Transplant, South-Pest Hospital Centre–National Institute for Hematology and Hematology, Budapest; Department of Pediatrics, University of Pécs, Pécs; and Velkey László Children’s Health Center, B.A.Z. County Central Hospital and University Teaching Hospital, Miskolc. Data were collected from the Hungarian Childhood Cancer Registry and from the participating centers directly. The parents/legal guardians of the patient or the patient themselves provided informed consent for treatment. 2.1. Patients and Treatment HR-NB was defined using the International Neuroblastoma Staging System (INSS) classification system, i.e., patients ≥12 months of age with INSS stage 4 neuroblastoma; patients with INSS stage 3, 4 or 4S neuroblastoma and MYCN MYCN 17 18 MYCN MYCN MYCN 19 20 21 9 11 All patients received anti-GD2 antibody dinutuximab beta (ch14.18/CHO; DB; Recordati, Schiphol-Rijk, The Netherlands, B.V.) continuously over the first 10 days of each 35-day cycle. The daily dose of dinutuximab beta was calculated individually, depending on the body surface area/body weight of patients ( Table S1 13 22 Intolerable toxicity was typically defined as any Grade 3 or 4 toxicity that failed to reduce to Grade 1 or 2 before the commencement of the subsequent treatment cycle, or Grade 4 hematological toxicities that persisted across treatment cycles. In cases where consolidation treatment was intended, the number of dinutuximab beta plus chemotherapy cycles depended on the treatment’s effectiveness. Treatment stopped either when the response was adequate for administering megachemotherapy or upon the diagnosis of progressive disease (PD). 2.2. Assessments and Outcomes Tumor responses were evaluated using the International Neuroblastoma Response Criteria for metastatic lesions [ 23 In patients with measurable disease, tumors were assessed radiographically using computed tomography and/or magnetic resonance imaging. Patients with 123 131 OS was defined as the time from diagnosis until death from any cause and event-free survival (EFS) was defined as the time from diagnosis until the occurrence of a disease-related event, including progression of disease. Patients were monitored for adverse events (AEs), which were coded using the Common Terminology Criteria for Adverse Events version 5.0 (CTCAE v5.0). CTCAE v5.0 was also used to determine the severity of AEs. 2.3. Statistical Analysis Data cutoff for survival analysis was 9 April 2025. OS and EFS were analyzed, stratified by relevant predictors, including MYCN 24 25 26 27 MYCN MYCN Analyses were stratified by line of therapy at first dinutuximab beta exposure: first-line maintenance vs. relapsed/refractory (dinutuximab beta given after relapse/progression), following prior real-world reports. Patients remained in their subgroup for all primary analyses. 3. Results 3.1. Patients In total, 37 patients with HR-NB received dinutuximab beta at one of five HuPON centers in Hungary between October 2018 and February 2023 ( Table 1 Table S2 At dinutuximab beta initiation, all included patients had measurable or evaluable disease by design (see eligibility). Baseline status was assessed using INRC across soft tissue, bone, and marrow components. Semi-quantitative MIBG scores (Curie/SIOPEN) were not available for this retrospective dataset and are not presented. The majority of patients were male (n = 26, 70.3%) and the median age was 39.2 months (range 22 days–12.4 years). MYCN Most primary tumors were found in the adrenal glands (91.9%), with two (5.4%) found in the abdomen and one (2.7%) in the lymph nodes. At diagnosis, only four (10.8%) patients did not have metastases, with the majority of patients having metastases in two or more compartments (59.5%), most commonly the bone marrow, bone and lymph nodes. 3.2. Treatment Five cycles of dinutuximab beta were received by 23 (62.2%) patients ( Figure S1 Table 2 28 In total, 11 (29.7%) patients received additional treatment after dinutuximab beta ( Table 2 3.3. Tumor Response and Survival Analysis At data cutoff, the objective response rate was 51.4% (19/37), with a CR in 19 (51.4%) patients and a PR in zero (0.0%) patients ( Table 3 The median OS for the entire cohort was 11.8 years (95% CI 4.6—not available [NA; the upper bound cannot be determined due to the low number of patients reaching endpoint]) and the median EFS was 9.8 years (95% CI 2.9—NA) ( Figure 1 Figure S2A,B p p MYCN MYCN ( Figure S2C,D MYCN p p The Cox proportional hazards model revealed no statistically significant differences in overall survival (OS) or event-free survival (EFS) based on treatment setting (first-line vs. second-line dinutuximab beta), MYCN 3.4. Toxicities The most common Grade 3 or 4 AEs (affecting ≥5% of patients), categorized using CTCAE v5.0, were blood and lymphatic system disorders–other (37.8%), hypoxia (37.8%), hepatobiliary disorders–other (29.2%), hypotension (27.0%), capillary leak syndrome (13.5%), diarrhea (8.1%), generalized edema (5.4%) and urinary tract infection (5.4%) ( Table S3 4. Discussion We conducted a retrospective review of data from patients with HR-NB included in the Hungarian Childhood Cancer Registry treated with dinutuximab beta either as first-line maintenance therapy (n = 30) or in the relapsed/refractory setting (n = 7). Patients were treated according to the HR-NB Study 1/SIOPEN protocol, without interleukin-2. The overall disease control rate was 54.1%, with 51.4% of patients experiencing a CR, 0.0% experiencing a PR and 2.7% with SD. Patients treated with dinutuximab beta in the first-line setting demonstrated a 5-year OS rate of 58% and a 5-year EFS rate of 56%, while corresponding values for patients who received dinutuximab beta in the relapsed/refractory were 71% and 54%, respectively. Grade 3 or 4 AEs experienced by the patients were generally consistent with dinutuximab beta’s known safety profile [ 13 All but four patients (89.2%) had metastatic disease at baseline, and the majority (59.5%) had metastases in two or more compartments [ 29 Approximately one third of patients (29.7%) received additional treatment following their initial dinutuximab beta therapy, which encompassed a variety of regimens. In the first-line setting, the most commonly used treatment was RIST, which was utilized alone in six (16.2%) patients and following radiotherapy in one patient. RIST was also used in one patient following dinutuximab beta treatment in the second-line setting, together with one cycle each of N5 and N6, MIBG therapy, and haplo-SCT. RIST is a novel multimodal metronomic treatment protocol [ 30 30 30 31 32 33 Several other real-world studies have investigated the effectiveness and tolerability of dinutuximab therapy in patients with HR-NB [ 34 35 36 33 33 33 34 34 33 33 34 33 35 35 34 35 34 35 35 36 33 36 33 34 The predominance of Tier 2M cases is a notable feature of the current study population, perhaps indicating either a need for earlier detection and treatment of neuroblastoma in Hungarian clinical practice, or a relatively cautious approach to using dinutuximab beta earlier in the first-line setting at the present time. However, although 89.2% of patients presented with metastatic disease and three cases were initially misdiagnosed, suggesting possible delays, we cannot confirm a rural diagnostic delay in Hungarian pediatric oncology clinics (historical data show no delay vs. Western Europe). Nonetheless, general practitioner workforce shortages/urban–rural performance gaps and higher childhood-cancer mortality outside Budapest indicate that health-system factors could contribute to this [ 16 37 38 39 34 35 36 5. Conclusions This retrospective study demonstrates that dinutuximab beta is an effective and safe treatment for high-risk neuroblastoma, achieving a 54.1% disease control rate and a 5-year overall survival of 63.3%. The manageable safety profile and positive survival outcomes support its use in both first-line and relapsed/refractory settings, providing practical insights for optimizing treatment strategies in pediatric oncology. Acknowledgments Editorial assistance was provided by m X Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/jcm14186641/s1 MYCN Author Contributions Conceptualization, M.H., M.S., E.B., Á.V. (Ágnes Varga), P.H., G.O., Á.V. (Ágnes Vojcek), K.C., G.K., Z.J., G.A., M.G.; Methodology, M.H., Z.J., G.A., M.G., Formal Analysis, M.H., Z.J., G.A., M.G., Investigation, M.H., M.S., E.B., Á.V. (Ágnes Varga), P.H., G.O., Á.V. (Ágnes Vojcek), K.C., G.K., Z.J., G.A., M.G., Data curation, M.H., M.S., E.B., Á.V. (Ágnes Varga), P.H., G.O., Á.V. (Ágnes Vojcek), K.C., G.K., Z.J., G.A., M.G., Writing—original draft preparation, M.H., G.A., M.G., Writing—review and editing, M.H., M.S., E.B., Á.V. (Ágnes Varga), P.H., G.O., Á.V. (Ágnes Vojcek), K.C., G.K., Z.J., G.A., M.G., Visualization, G.A., Supervision, M.H., M.S., E.B., Á.V. (Ágnes Varga), P.H., G.O., Á.V. (Ágnes Vojcek), K.C., G.K., Z.J., G.A., M.G. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Ethical review and approval were waived for this study, due to its retrospective design. Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Data Availability Statement The original contributions presented in this study are included in the article/ Supplementary Materials Conflicts of Interest M. Hernádfői was supported by the KDP-21 Cooperative Doctoral Programme for Doctoral Scholarships (KDP-12-3/PALY-2022) of the Ministry for Innovation and Technology funded by the National Research, Development and Innovation Fund. Sponsors had no role in the design, data collection, analysis, interpretation, and manuscript preparation. All other authors have nothing to declare. References 1. Ponzoni M. Bachetti T. Corrias M.V. Brignole C. Pastorino F. Calarco E. Bensa V. Giusto E. Ceccherini I. Perri P. Recent advances in the developmental origin of neuroblastoma: An overview J. Exp. Clin. Cancer Res. 2022 41 92 10.1186/s13046-022-02281-w 35277192 PMC8915499 2. Georgakis M.K. Dessypris N. Baka M. Moschovi M. Papadakis V. Polychronopoulou S. Kourti M. Hatzipantelis E. Stiakaki E. Dana H. Neuroblastoma among children in Southern and Eastern European cancer registries: Variations in incidence and temporal trends compared to US Int. J. Cancer 2018 142 1977 1985 10.1002/ijc.31222 29250786 3. Swift C.C. Eklund M.J. Kraveka J.M. Alazraki A.L. Updates in Diagnosis, Management, and Treatment of Neuroblastoma Radiographics 2018 38 566 580 10.1148/rg.2018170132 29528815 4. London W.B. Castleberry R.P. Matthay K.K. Look A.T. Seeger R.C. Shimada H. Thorner P. Brodeur G. Maris J.M. Reynolds C.P. Evidence for an age cutoff greater than 365 days for neuroblastoma risk group stratification in the Children's Oncology Group J. Clin. Oncol. 2005 23 6459 6465 10.1200/JCO.2005.05.571 16116153 5. Bender H.G. Irwin M.S. Hogarty M.D. Castleberry R. Maris J.M. Kao P.C. Zhang F.F. Naranjo A. Cohn S.L. London W.B. Survival of Patients With Neuroblastoma After Assignment to Reduced Therapy Because of the 12- to 18-Month Change in Age Cutoff in Children's Oncology Group Risk Stratification J. Clin. Oncol. 2023 41 3149 3159 10.1200/JCO.22.01946 37098238 PMC10256433 6. Cole K.A. Maris J.M. New strategies in refractory and recurrent neuroblastoma: Translational opportunities to impact patient outcome Clin. Cancer Res. 2012 18 2423 2428 10.1158/1078-0432.CCR-11-1409 22427348 PMC3660732 7. Zafar A. Wang W. Liu G. Wang X. Xian W. McKeon F. Foster J. Zhou J. Zhang R. Molecular targeting therapies for neuroblastoma: Progress and challenges Med. Res. Rev. 2021 41 961 1021 10.1002/med.21750 33155698 PMC7906923 8. Ploessl C. Pan A. Maples K.T. Lowe D.K. Dinutuximab: An Anti-GD2 Monoclonal Antibody for High-Risk Neuroblastoma Ann. Pharmacother. 2016 50 416 422 10.1177/1060028016632013 26917818 9. Ladenstein R. Pötschger U. Valteau-Couanet D. Luksch R. Castel V. Ash S. Laureys G. Brock P. Michon J.M. Owens C. Investigation of the Role of Dinutuximab Beta-Based Immunotherapy in the SIOPEN High-Risk Neuroblastoma 1 Trial (HR-NBL1) Cancers 2020 12 309 10.3390/cancers12020309 32013055 PMC7072500 10. Chung C. Boterberg T. Lucas J. Panoff J. Valteau-Couanet D. Hero B. Bagatell R. Hill-Kayser C.E. Neuroblastoma Pediatr. Blood Cancer 2021 68 (Suppl. 2) e28473 10.1002/pbc.28473 33818884 PMC8785544 11. Ladenstein R. Pötschger U. Valteau-Couanet D. Luksch R. Castel V. Yaniv I. Laureys G. Brock P. Michon J.M. Owens C. Interleukin 2 with anti-GD2 antibody ch14.18/CHO (dinutuximab beta) in patients with high-risk neuroblastoma (HR-NBL1/SIOPEN): A multicentre, randomised, phase 3 trial Lancet Oncol. 2018 19 1617 1629 10.1016/S1470-2045(18)30578-3 30442501 12. Ladenstein R.L. Poetschger U. Valteau-Couanet D. Gray J. Luksch R. Balwierz W. Castel V. Ash S. Beck Popovic M. Laureys G. Randomization of dose-reduced subcutaneous interleukin-2 (scIL2) in maintenance immunotherapy (IT) with anti-GD2 antibody dinutuximab beta (DB) long-term infusion (LTI) in front–line high-risk neuroblastoma patients: Early results from the HR-NBL1/SIOPEN trial J. Clin. Oncol. 2019 37 10013 10.1200/JCO.2019.37.15_suppl.10013 13. European Medicines Agency Qarziba (Dinutuximab Beta) Summary of Product Characteristics Available online: https://www.ema.europa.eu/en/documents/product-information/qarziba-epar-product-information_en.pdf (accessed on 5 September 2025) 14. Lode H.N. Valteau-Couanet D. Gray J. Luksch R. Wieczorek A. Castel V. Ash S. Laureys G. Papadakis V. Owens C. Randomized use of anti-GD2 antibody dinutuximab beta (DB) long-term infusion with and without subcutaneous interleukin-2 (scIL-2) in high-risk neuroblastoma patients with relapsed and refractory disease: Results from the SIOPEN LTI-trial J. Clin. Oncol. 2019 37 10014 10.1200/JCO.2019.37.15_suppl.10014 15. SIOPEN Research Network High Risk Neuroblastoma Study 1 (HR-NBL1) Available online: https://www.siopen.org/siopen-clinical-trials-1/hr1 (accessed on 3 September 2025) 16. Nyári T.A. Kajtár P. Parker L. Neuroblastoma in hungary Eur. J. Cancer 2006 42 2350 2354 10.1016/j.ejca.2005.12.029 16876992 17. Brodeur G.M. Pritchard J. Berthold F. Carlsen N.L. Castel V. Castelberry R.P. De Bernardi B. Evans A.E. Favrot M. Hedborg F. Revisions of the international criteria for neuroblastoma diagnosis, staging, and response to treatment J. Clin. Oncol. 1993 11 1466 1477 10.1200/JCO.1993.11.8.1466 8336186 18. Liang W.H. Federico S.M. London W.B. Naranjo A. Irwin M.S. Volchenboum S.L. Cohn S.L. Tailoring Therapy for Children With Neuroblastoma on the Basis of Risk Group Classification: Past, Present, and Future JCO Clin. Cancer Inform. 2020 4 895 905 10.1200/CCI.20.00074 33058692 PMC7608590 19. Ladenstein R. Valteau-Couanet D. Brock P. Yaniv I. Castel V. Laureys G. Malis J. Papadakis V. Lacerda A. Ruud E. Randomized Trial of prophylactic granulocyte colony-stimulating factor during rapid COJEC induction in pediatric patients with high-risk neuroblastoma: The European HR-NBL1/SIOPEN study J. Clin. Oncol. 2010 28 3516 3524 10.1200/JCO.2009.27.3524 20567002 20. Amoroso L. Erminio G. Makin G. Pearson A.D.J. Brock P. Valteau-Couanet D. Castel V. Pasquet M. Laureys G. Thomas C. Topotecan-Vincristine-Doxorubicin in Stage 4 High-Risk Neuroblastoma Patients Failing to Achieve a Complete Metastatic Response to Rapid COJEC: A SIOPEN Study Cancer Res. Treat. 2018 50 148 155 10.4143/crt.2016.511 28324923 PMC5784636 21. Ladenstein R. Pötschger U. Pearson A.D.J. Brock P. Luksch R. Castel V. Yaniv I. Papadakis V. Laureys G. Malis J. Busulfan and melphalan versus carboplatin, etoposide, and melphalan as high-dose chemotherapy for high-risk neuroblastoma (HR-NBL1/SIOPEN): An international, randomised, multi-arm, open-label, phase 3 trial Lancet Oncol. 2017 18 500 514 10.1016/S1470-2045(17)30070-0 28259608 22. Barone G. Barry A. Bautista F. Brichard B. Defachelles A.S. Herd F. Manzitti C. Reinhardt D. Rubio P.M. Wieczorek A. Managing Adverse Events Associated with Dinutuximab Beta Treatment in Patients with High-Risk Neuroblastoma: Practical Guidance Paediatr. Drugs 2021 23 537 548 10.1007/s40272-021-00469-9 34541620 PMC8563639 23. Park J.R. Bagatell R. Cohn S.L. Pearson A.D. Villablanca J.G. Berthold F. Burchill S. Boubaker A. McHugh K. Nuchtern J.G. Revisions to the International Neuroblastoma Response Criteria: A Consensus Statement From the National Cancer Institute Clinical Trials Planning Meeting J. Clin. Oncol. 2017 35 2580 2587 10.1200/JCO.2016.72.0177 28471719 PMC5676955 24. R Core Team R: A Language and Environment for Statistical Computing Available online: https://www.R-project.org/ (accessed on 16 December 2024) 25. Therneau T.M. Grambsch P.M. Modeling Survival Data: Extending the Cox Model Springer New York, NY, USA 2000 26. Therneau T.M. Lumley T. Atkinson E. Crowson C. A Package for Survival Analysis in R Available online: https://CRAN.R-project.org/package=survival (accessed on 16 December 2024) 27. Kassambara A. Kosinski M. Biecek P. Fabian S. Survminer: Drawing Survival Curves Using ‘ggplot2’ Available online: https://CRAN.R-project.org/package=survminer (accessed on 16 December 2024) 28. Corbacioglu S. Lode H. Ellinger S. Zeman F. Suttorp M. Escherich G. Bochennek K. Gruhn B. Lang P. Rohde M. Irinotecan and temozolomide in combination with dasatinib and rapamycin versus irinotecan and temozolomide for patients with relapsed or refractory neuroblastoma (RIST-rNB-2011): A multicentre, open-label, randomised, controlled, phase 2 trial Lancet Oncol. 2024 25 922 932 10.1016/S1470-2045(24)00202-X 38936379 29. Aitken J.F. Youlden D.R. Moore A.S. Baade P.D. Ward L.J. Thursfield V.J. Valery P.C. Green A.C. Gupta S. Frazier A.L. Assessing the feasibility and validity of the Toronto Childhood Cancer Stage Guidelines: A population-based registry study Lancet Child. Adolesc. Health 2018 2 173 179 10.1016/S2352-4642(18)30023-3 30169253 30. Waetzig R. Matthes M. Leister J. Penkivech G. Heise T. Corbacioglu S. Sommer G. Comparing mTOR inhibitor Rapamycin with Torin-2 within the RIST molecular-targeted regimen in neuroblastoma cells Int. J. Med. Sci. 2021 18 137 149 10.7150/ijms.48393 33390782 PMC7738968 31. Nonnenmacher L. Westhoff M.A. Fulda S. Karpel-Massler G. Halatsch M.E. Engelke J. Simmet T. Corbacioglu S. Debatin K.M. RIST: A potent new combination therapy for glioblastoma Int. J. Cancer 2015 136 E173 E187 10.1002/ijc.29138 25123598 32. Kieran M.W. Turner C.D. Rubin J.B. Chi S.N. Zimmerman M.A. Chordas C. Klement G. Laforme A. Gordon A. Thomas A. A feasibility trial of antiangiogenic (metronomic) chemotherapy in pediatric patients with recurrent or progressive cancer J. Pediatr. Hematol. Oncol. 2005 27 573 581 10.1097/01.mph.0000183863.10792.d4 16282886 33. Robison N.J. Campigotto F. Chi S.N. Manley P.E. Turner C.D. Zimmerman M.A. Chordas C.A. Werger A.M. Allen J.C. Goldman S. A phase II trial of a multi-agent oral antiangiogenic (metronomic) regimen in children with recurrent or progressive cancer Pediatr. Blood Cancer 2014 61 636 642 10.1002/pbc.24794 24123865 PMC4285784 34. Wieczorek A. Żebrowska U. Ussowicz M. Sokół A. Stypińska M. Dembowska-Bagińska B. Pawińska-Wąsikowska K. Balwierz W. Dinutuximab Beta Maintenance Therapy in Patients with High-Risk Neuroblastoma in First-Line and Refractory/Relapsed Settings-Real-World Data J. Clin. Med. 2023 12 5252 10.3390/jcm12165252 37629294 PMC10455178 35. Giljević J.S. Rajačić N. Mikulić D. Batoš A.T. Dinutuximab Beta in Children with High-Risk Neuroblastoma: Experience from a Single Center in Croatia Children 2022 9 943 10.3390/children9070943 35883927 PMC9318789 36. Achbergerová M. Hederová S. Hrašková A. Kolenová A. Dinutuximab beta in the treatment of high-risk neuroblastoma: A follow-up of a case series in Bratislava Medicine 2022 101 e28716 10.1097/MD.0000000000028716 35089239 PMC8797591 37. Papp M. Kőrösi L. Sándor J. Nagy C. Juhász A. Ádány R. Workforce crisis in primary healthcare worldwide: Hungarian example in a longitudinal follow-up study BMJ Open 2019 9 e024957 10.1136/bmjopen-2018-024957 31340955 PMC6661691 38. Kovács N. Pálinkás A. Sipos V. Nagy A. Harsha N. Kőrösi L. Papp M. Ádány R. Varga O. Sándor J. Factors Associated with Practice-Level Performance Indicators in Primary Health Care in Hungary: A Nationwide Cross-Sectional Study Int. J. Environ. Res. Public Health 2019 16 3153 10.3390/ijerph16173153 31470573 PMC6747708 39. Németh K. Nyári T.A. Lantos T. Patterns of Childhood Cancer Mortality in Hungary Since the Turn of the Millennium, Including the Two Years of the COVID-19 Pandemic Cancers 2024 16 3961 10.3390/cancers16233961 39682149 PMC11640402 Figure 1 Kaplan–Meier curves for ( A B jcm-14-06641-t001_Table 1 Table 1 Baseline patient demographics and disease characteristics. Number of Patients N = 37  Patients with HR-NB who received dinutuximab beta, n (%) a 37 (100) First line 31 (83.8) Relapsed disease 6 (16.2) Distant relapse 4 (10.8)  Male, n (%) 26 (70.3)  Age, median (range) months 39.2 (0.7–150.4)  INSS stage at diagnosis, n (%)  2 1 (2.7) 3 2 (5.4) 4 27 (73.0) 4S 1 (2.7) rec b 6 (16.2)  MYCN c 15 (40.5) INSS stage 2 1 (2.7) INSS stage 3 c 1 (2.7) INSS stage 4 11 (29.7) INSS stage 4S 1 (2.7) rec b 1 (2.7)  Unfavorable histopathology, d 30 (81.1)  Primary tumor major location, n (%)  Adrenal glands 34 (91.9) Abdomen 2 (5.4) Lymph nodes 1 (2.7)  Number of metastatic compartments at diagnosis, n (%)  0 4 (10.8) 1 11 (29.7) 2 7 (18.9) 3 9 (24.3) ≥4 6 (16.2) a b c MYCN d jcm-14-06641-t002_Table 2 Table 2 Number of dinutuximab beta cycles received and subsequent treatments, including further DB therapy at relapse. Number of Patients N = 37  Number of dinutuximab beta cycles received, n (%)  1 4 (10.8) 2 2 (5.4) 3 4 (10.8) 4 2 (5.4) 5 23 (62.2) 6 1 (2.7) 9 1 (2.7)  Subsequent treatment after initial dinutuximab beta course, n (%) 11 (29.7) First-line dinutuximab beta 9 (24.3) RIST 6 (16.2) MIBG + HSCT 1 (2.7) Radiotherapy, RIST 1 (2.7) KIERAN 1 (2.7) Second-line dinutuximab beta 2 (5.4) RIST, 1 × N5, 1 × N6, MIBG + haplo-HSCT 1 (2.7) 4 × N5, 4 × N6, MIBG + haplo-HSCT 1 (2.7)  No further treatment after initial dinutuximab beta course, n (%) 26 (70.3) The table shows the total number of DB cycles received and treatments administered following the initial DB course, regardless of cycle count. Notably, two patients received additional DB cycles as part of relapse therapy after completing 5 cycles in the first-line setting. These patients are listed under “Second-line dinutuximab beta” in the subsequent treatment section. DB, dinutuximab beta; HSCT, Hematopoietic Stem Cell Transplantation; KIERAN (metronomic therapy), celecoxib, thalidomide, and fenofibrate, with alternating 21-day cycles of low-dose cyclophosphamide and etoposide; MIBG, meta-iodobenzylguanidine; RIST, rapamycin (R) and dasatinib (S) plus chemotherapy with irinotecan (I) and temozolomide (T) [ 28 jcm-14-06641-t003_Table 3 Table 3 Treatment response at data cutoff (14 November 2024). Number of Patients N = 37 (100%)  Objective response rate, n (%) 19 (51.4) Complete response (CR) 19 (51.4) Partial response (PR) 0 (0.0)  Disease control rate, n (%) 20 (54.1) Stable disease (SD) 1 (2.7)  Progressive disease, n (%) 2 (5.4)  Death, n (%) 15 (40.5) ",
  "metadata": {
    "Title of this paper": "Patterns of Childhood Cancer Mortality in Hungary Since the Turn of the Millennium, Including the Two Years of the COVID-19 Pandemic",
    "Journal it was published in:": "Journal of Clinical Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471212/"
  }
}