{
  "title": "Paper_78",
  "abstract": "pmc Neurol Sci Neurol Sci 365 springeropen Neurological Sciences 1590-1874 1590-3478 pmc-is-collection-domain yes pmc-collection-title Springer PMC12488819 PMC12488819.1 12488819 12488819 40638015 10.1007/s10072-025-08337-x 8337 1 Neuro-Images NeuroImages: IgG4-related disease with meningeal and parenchymal involvement on MRI and histopathology Li Lina 1 http://orcid.org/0000-0002-6968-2404 Xiao Haibing xiaohb@hku-szh.org 1 2 1 https://ror.org/047w7d678 grid.440671.0 0000 0004 5373 5131 Department of Neuromedicine Center, The University of Hong Kong-Shenzhen Hospital, 2 10 7 2025 2025 46 10 498144 5585 5587 23 5 2025 25 6 2025 10 07 2025 03 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ IgG4-related disease (IgG4-RD) rarely involves the CNS parenchyma. We report a 44-year-old man with left facial numbness and seizures. MRI showed right frontal-parietal dural thickening and parenchymal edema. Biopsy revealed IgG4 + plasma cells (> 50/HPF) with obliterative phlebitis, confirming IgG4-RD. This case highlights the need to consider IgG4-RD in meningo-parenchymal lesions mimicking tumors or infections. Glucocorticoids should be initiated promptly after histopathologic confirmation. Keywords IgG4-related disease Central nervous system Parenchymal involvement Glucocorticoids pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Fondazione Società Italiana di Neurologia 2025 Clinical presentation A 44-year-old man presented with left facial numbness and focal seizures involving the left mouth corner. Neurologic examination revealed reduced pinprick sensation in the left trigeminal V2/V3 distribution. Imaging findings Thickened, enhancing dura mater in the right frontal-parietal region with adjacent leptomeningeal involvement. Parenchymal FLAIR hyperintensity and subtle ring enhancement, suggesting edema and inflammation (Fig. 1 Fig. 1 A B C D Pathology Dense lymphoplasmacytic infiltrates with obliterative phlebitis (Fig. 1 IgG4 + plasma cells (> 50/HPF, IgG4/IgG ratio > 40%) (Fig. 1 Teaching point Immunoglobulin G4-related disease (IgG4-RD) of the central nervous system (CNS) primarily involves the dura mater and pituitary gland, but parenchymal infiltration (as in this case) is rare. This case underscores three key lessons: Diagnostic Pitfall: IgG4-RD can mimic neoplasms (e.g., meningioma) or infections (e.g., tuberculosis) on MRI due to meningo-parenchymal lesions with enhancement. Pathologic Hallmarks: Dense lymphoplasmacytic infiltrates (IgG4 + plasma cells ≥ 10/HPF and a IgG4 +/IgG + cell ratio > 40%), storiform fibrosis, and obliterative phlebitis are diagnostic [ 1 Therapeutic Implication: Glucocorticoids and rituximab often lead to rapid symptom resolution, emphasizing the need for early biopsy [ 2 Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Author contributions L.L.: Data collection, manuscript drafting. H.X.: Study design, critical revision. Funding This work was supported by Shenzhen Clinical Research Center for Rare Diseases (LCYSSQ20220823091402005) and Sanming Project of Medicine in Shenzhen (No. SZSM202311022). Data Availability All data generated or analyzed during this study are included in this published article (and its supplementary information files). No additional external data repositories were used. Declarations Ethical approval This case report was exempt from ethical approval by the Institutional Review Board of The University of Hong Kong – Shenzhen Hospital, as it involved retrospective analysis of anonymized clinical data without compromising patient privacy or welfare. Informed consent Written informed consent was obtained from the patient for publication of this case report and accompanying images. The signed consent form is available for editorial review as a supplemental file. References 1. Wallace ZS, Naden RP, Chari S, Choi H, Della-Torre E, Dicaire JF, Hart PA, Inoue D, Kawano M, Khosroshahi A, Kubota K, Lanzillotta M, Okazaki K, Perugino CA, Sharma A, Saeki T, Sekiguchi H, Schleinitz N, Stone JR, Takahashi N, Umehara H, Webster G, Zen Y, Stone JH American College of Rheumatology/European League Against Rheumatism IgG4-Related Disease Classification Criteria Working Group. The American College of Rheumatology/European League Against Rheumatism Classification Criteria for IgG4-Related Disease Arthritis Rheumatol. 2019 72 1 7 19 10.1002/art.41120 31793250 Wallace ZS, Naden RP, Chari S, Choi H, Della-Torre E, Dicaire JF, Hart PA, Inoue D, Kawano M, Khosroshahi A, Kubota K, Lanzillotta M, Okazaki K, Perugino CA, Sharma A, Saeki T, Sekiguchi H, Schleinitz N, Stone JR, Takahashi N, Umehara H, Webster G, Zen Y, Stone JH American College of Rheumatology/European League Against Rheumatism IgG4-Related Disease Classification Criteria Working Group. The (2019) American College of Rheumatology/European League Against Rheumatism Classification Criteria for IgG4-Related Disease. Arthritis Rheumatol. 72(1):7–19. 10.1002/art.41120 31793250 10.1002/art.41120 2. Katz G Stone JH Clinical Perspectives on IgG4-Related Disease and Its Classification Annu Rev Med 2022 27 73 545 562 10.1146/annurev-med-050219-034449 34669430 Katz G, Stone JH (2022) Clinical Perspectives on IgG4-Related Disease and Its Classification. Annu Rev Med 27(73):545–562. 10.1146/annurev-med-050219-034449 10.1146/annurev-med-050219-034449 34669430 ",
  "metadata": {
    "Title of this paper": "Clinical Perspectives on IgG4-Related Disease and Its Classification",
    "Journal it was published in:": "Neurological Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488819/"
  }
}