{
  "title": "Paper_395",
  "abstract": "pmc Virus Res Virus Res 4445 virusres Virus Research 0168-1702 1872-7492 Elsevier PMC12481941 PMC12481941.1 12481941 12481941 40945531 10.1016/j.virusres.2025.199630 S0168-1702(25)00108-X 199630 1 Article Evaluation of Potential Inhibitors of Zika Virus Envelope Protein Through Molecular Docking and Molecular Dynamics Simulation Tayyeb Jehad Zuhair jztayyeb@uj.edu.sa a da Silva Maria Karolaynne b Al-Mutairi Aamal A. aamutairi@imamu.edu.sa c Alharbi Hanan M. hmsharbi@uqu.edu.sa d Khojah Alaa A. d Bayıl Imren ib57001@student.gaziantep.edu.tr e Alzahrani Abdullah Yahya Abdullah ayalzahrani@kku.edu.sa f Tóth Zsolt toth.zsolt@uni-sopron.hu g ⁎ Oliveira Jonas Ivan Nobre b Zaki Magdi E.A. mezaki@imamu.edu.sa c ⁎⁎ a b c d e f g ⁎ toth.zsolt@uni-sopron.hu ⁎⁎ mezaki@imamu.edu.sa 11 2025 11 9 2025 361 497994 199630 1 7 2025 9 9 2025 10 9 2025 11 09 2025 01 10 2025 01 10 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). Highlights • An integrated in silico approach was used to identify flavonoid-based compounds as potential inhibitors of the Zika virus (ZIKV) envelope protein. • Molecular docking revealed strong binding affinities for quercetin, pinocembrin, and naringenin to the ZIKV E protein active sites. • Quantum chemical analyses and molecular dynamics simulations confirmed the stability, reactivity, and binding strength of the selected ligands. • Pharmacokinetic and toxicity predictions showed excellent drug-likeness, with high gastrointestinal absorption and no major safety concerns. • These findings highlight the therapeutic potential of natural flavonoids as novel antiviral agents against ZIKV, warranting further experimental validation. Zika virus (ZIKV) infection remains a global health threat with no approved antivirals or vaccines to date, creating an urgent need for therapeutics targeting ZIKV. The viral envelope (E) protein is critical for host cell entry and represents a validated target for antiviral intervention. Here, we aimed to identify natural flavonoid compounds capable of inhibiting the ZIKV E protein using a dual-phase in silico in vitro in vivo Graphical abstract Image, graphical abstract Keywords ZIKV Molecular modelling Drug-likeness ADMET Quantum chemical descriptors Molecular dynamic QM/MM calculations pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction The ongoing public health emergency caused by the mosquito-borne Zika virus (ZIKV) has elicited global concern. Historically confined to Africa and Asia, ZIKV’s emergence in Brazil in 2015 led to a global outbreak across the Americas. While the majority of ZIKV infections manifest as mild to moderate flu-like symptoms, the virus is also associated with severe complications - most notably, microcephaly in infants born to infected mothers. The absence of a definitive cure and a licensed vaccine further exacerbates the clinical challenges posed by this virus ( Plourde and Bloch, 2016 Chowdhury et al., 2023 Campos et al., 2020 The ZIKV life cycle encompasses critical phases including viral attachment, entry, translation, replication, assembly, and release. Central to these processes is the envelope protein (E protein), which plays a decisive role during the initial stages of viral entry ( Gómez et al., 2022 Roy et al., 2024 This fusion event is pivotal as it enables the liberation of the viral RNA genome into the host cytoplasm, thereby commandeering cellular machinery to drive replication and virion assembly. In essence, the conformational dynamics of the E protein and its role in membrane fusion make it an attractive target for antiviral drug development, since inhibiting this step could effectively prevent ZIKV infection at an early stage ( Roy et al., 2024 Tréguier et al., 2022 The primary urban vector for ZIKV transmission is the Aedes mosquito (subgenus Stegomyia), which also serves as a vector for dengue, chikungunya, and yellow fever viruses ( Marcondes and Ximenes, 2015 Shragai et al., 2017 Musso and Gubler, 2016 Haddow et al., 2012 Retallack et al., 2016 Alera et al., 2012 Weaver et al., 2016 Buathong et al., 2015 Presently, more than 40 vaccine candidates are in various stages of development—some under accelerated approval—while one DNA vaccine has already reached phase 1 clinical trials. Nevertheless, a broadly effective vaccine remains at least two years away, and the longevity of immunity post-infection remains uncertain ( Thomas et al., 2016 Cohen, 2016 in vitro in vivo Retallack et al., 2016 In this study, we introduce an innovative, two-phased drug design strategy aimed at targeting the ZIKV envelope protein. In the first phase, we conduct a comprehensive evaluation of selected natural flavonoid ligands. This phase involves rigorous geometry optimizations using Density Functional Theory (DFT) at the B3LYP/6–311G+ (d,p) level, detailed analysis of Molecular Electrostatic Potential (MEP) surfaces, and the determination of essential quantum chemical descriptors—including the HOMO-LUMO gap, ionization potential, and electrophilicity. Additionally, we perform extensive in silico In the second phase, the optimized ligands are integrated into a biological context through their docking into the high-resolution structure of the ZIKV envelope protein (PDB ID: 5JHM This dual-phase approach not only facilitates the identification of promising lead compounds for anti-ZIKV therapy but also provides profound mechanistic insights into the molecular interactions governing complex formation. Moreover, by integrating these advanced in silico Brogi et al., 2020 Jiang et al., 2025 Huang et al., 2024 Xiong et al., 2024 2 Method and material 2.1 Calculations of flavonoids compounds 2.1.1 Ligand preparation and molecular optimization The selection and preparation of the best ligands is one of the most critical steps in studies of potential therapeutics. This process involves identifying compounds with the highest potential for therapeutic activity and preparing them by optimizing their geometries to achieve the lowest ground-state energy. This step is essential as molecular docking and molecular dynamics (MD) simulations require ligands with well-defined geometries. Initially, the chemical structures of flavonoid derivatives were obtained from the PubChem database in SDF format. Each structure was optimized using density functional theory (DFT) at the B3LYP/6–311G+ (d,p) level with the Gaussian 09 software ( Asogwa et al., 2023 Fig. 2 Rupa et al., 2022 2.1.2 Molecular electrostatic potential (MEP) surface The MEP describes the combined electrostatic influence exerted by the charge distribution of a molecule at a given point in space. It includes molecular properties such as dipole moments, electronegativity, partial charges, and chemical reactivity and provides information about the relative polarity of the molecule ( Murray and Sen, 1996 Karrouchi et al., 2022 2.1.3 Quantum chemical descriptors DFT is a computational quantum mechanical modeling method that is used extensively in various molecular optimization applications. This approach provides comprehensive insights into the behavior of electrons in molecules and their effects on crucial quantum mechanical parameters and descriptors, such as the energies of the highest occupied molecular orbital (HOMO) and the lowest unoccupied molecular orbital (LUMO), the energy gap (HOMO-LUMO), the ionization potential (I), the electron affinity (A), the chemical hardness (ɳ), the softness (σ), the chemical potential (μ), the electronegativity index (χ) and the electrophilicity index (ω) ( Kawsar et al., 2022 Amin et al., 2021 Eq. (1) Thanikaivelan et al., 2000 (1) G A P = ε H O M O − ε L U M O (2) I ≈ − ε H O M O (3) A ≈ − ε L U M O (4) σ = 1 / η (5) η ≈ 1 / 2 ( ε L U M O − ε H O M O ) ≈ 1 / 2 ( I − A ) (6) μ ≈ − 1 / 2 ( ε H O M O + ε L U M O ) ≈ − 1 / 2 ( I + A ) (7) χ ≈ − μ ≈ ( I + A ) / 2 (8) ω ≈ χ 2 / 2 η 2.1.4 Determination of ADMET, Lipinski rule, and pharmacokinetics Predicting pharmacokinetic and toxicity characteristics of a molecule, such as its ADMET properties (absorption, distribution, metabolism, excretion, and toxicity) is an essential part of the drug development process to avoid failures in the clinical phases. Therefore, we evaluated nine selected flavonoids for their in silico Pires et al., 2015 http://www.swissadme.ch/index.php Walters, 2012 Quantum Calculation, 2022 2.1.5 Pharmacophore mapping PharmMapper, an online server, was used to perform pharmacophore mapping analysis for three promising ligands. The ligands were uploaded to the server in SDF format for analysis ( Wang et al., 2017 In the advanced settings, a fit score cutoff value of 0 was established. The fit score represents the quality of pharmacophore matching. By selecting a cutoff value of 0, all potential matches, regardless of their fit score, were considered for further evaluation. Default settings were used for all other parameters as they were optimized within the PharmMapper server to enable reliable and consistent analyses based on established standards. 2.2 Calculations of flavonoid-based compound-envelope protein complexes 2.2.1 Protein preparation and molecular docking study The three-dimensional crystal structure of the ZIKV envelope protein (PDB ID 5JHM https://www.rcsb.org/ Fig. 1 . Fig. 1 Yuan et al., 2017 Dallakyan and Olson, 2015 Eberhardt et al., 2021 x y z x y z Fig. 1 Dai et al., 2016 Akash, 2022 Guedes et al., 2024 Fig. 1 3D structural representation of the zikv envelope protein (pdb id: 5jhm Fig 1 2.2.2 Molecular dynamics simulation (MDs), normal mode analysis (NMA) We conducted Molecular dynamics (MD) simulations to ensure the accuracy of molecular docking, which is widely recognized as the main method for assessing the stability of protein-ligand complexes. This study provides an accurate understanding of the fluctuations and conformational changes of protein-ligand complexes ( Shukla and Tripathi, 2020 5JHM Che Omar, 2020 Valdés-Tresanco et al., 2021 To maintain neutrality, a 0.15 M concentration of sodium (Na+) and chloride (Cl-) ions was added to the systems, along with three sodium ions to neutralize the charge for each of the ligands quercetin, pinocembrin, and naringenin ( Streu, 2003 Ziegler, 2008 After the 100-nanosecond MD simulations, the results were realigned to the center. We analyzed the trajectory data using the integrated tools in Gromacs and VMD to investigate the dynamic conformational changes and interactions within the complexes ( Humphrey et al., 1996 Normal mode analysis (NMA) was performed to assess the conformational stability of the docked complex using the iMODS server, focusing on the ZIKV envelope protein in complex with naringenin, pinocembrin and quercetin. The iMODS server determines deformability data, B-factors, and eigenvalues of protein-ligand interactions to project the direction and magnitude of intrinsic motions ( López-Blanco et al., 2014 We used the coarse-grained model with C-alpha ( CA López-Blanco et al., 2014 Tama and Sanejouand, 2001 The evaluation of binding free energy of ligands in proteins is a crucial parameter in molecular dynamics simulations, and the calculation of the free energy plays an important role in determining this value. In this study, we employed the MM-PBSA approach to calculate the binding free energy of the interaction between ligands and the ZIKV envelope target protein. The binding free energy (ΔG) was calculated using the equation ΔG= G complex receptor ligand Wang et al., 2019 Terefe and Ghosh, 2022 2.2.3 Quantum mechanics/molecular mechanics (QM/MM) calculations The combined quantum mechanics/molecular mechanics (QM/MM) technique was applied to select the optimum complex (ligand-receptor) from the docking result. QM/MM optimization was performed within the framework of the ONIOM multilayer method (our own Integrated Molecular Orbital and N-layer Molecular Mechanics), which is available in Gaussian code. It is considered as the best method that ensure the accuracy initio calculations of the total energy of large complexes, like biochemical systems. Noted that these systems are divided into two or three layers. The MM layer in the present study has been implemented to the receptor, whereas the QM layer was allocated to the flavonoid derivatives. An well-known B3LYP functional and basis set 6–311G+ (d,p) were applied to analysis the electronic orbitals for the QM layer, and all amino acid residues within a radius of 6.0 Å from the centroid of the ligand were allowed to move during geometry optimization ( Chow et al., 2023 Chen et al., 2022 The QM/MM method help to break down the total energy, especially the interaction energy, into separate parts. This strategy helps scientists better understand how the protein environment—right down to particular residues—affects the system, which is especially useful when many electrostatic interactions are involved ( Wang et al., 2019 Senn and Thiel, 2009 3 Results and discussion 3.1 Optimization and energetic characterization of flavonoids compounds In our study, nine flavonoid derivatives underwent thorough optimization and analysis ( Fig. 2 Fig. 2 Optimized three-dimensional molecular structures of flavonoid derivatives. Geometrically optimized spatial configurations of nine flavonoids using DFT method. Fig 2 Among these compounds, Quercetin exhibited the highest number of conformations ( Gómez et al., 2022 Naringenin showed a higher degree of flexibility with 6 conformations. Despite its slightly smaller gyrational radius (3.77 Å), the RMSD values varied considerably, ranging from 0.09 to 1.34 Å, with an average of 0.85 Å. Tricine was characterized by the largest number of pharmacophore fingerprints (2759), all of which were unique. Its radius of gyration (4.44 Å) and solvent accessible surface area (556.39 Å²) were the highest among the derivatives analyzed. The RMSDs for tricine were very consistent, with minimal variability. Apigenin showed similar characteristics to biochanin in terms of number of conformations ( Campos et al., 2020 Table 1 Table 1 Comparative structural and physicochemical characterization of flavonoid derivatives. Summary of pharmacophore fingerprints, number of conformations, radius of gyration, solvent-accessible surface area, and RMSD values for the nine flavonoid compounds. Table 1 Compound P.F. 1 U.F. 2 T.C. 3 Avg. C./Lig. 4 R.G. 5 S.A.S.A. 6 Min RMSD (Å) Max RMSD (Å) Avg RMSD (Å) Quercetin 1884 1884 4 4 4.11 490.51 0.63 1.48 1.15 Pinocembrin 273 273 2 2 3.79 463.38 0.17 0.17 0.17 Genistein 813 813 2 2 4.07 463.91 0.61 0.61 0.61 Naringenin 1068 1068 6 6 3.77 472.79 0.09 1.34 0.85 Tricin 2759 2759 3 3 4.44 556.39 0.5 0.52 0.5 Apigenin 688 688 3 3 4.05 467.68 0.09 0.3 0.2 Biochanin 1293 1293 3 3 4.44 495.86 0.48 0.76 0.63 Taxifolin 2402 2402 14 14 3.68 493.95 0.18 1.94 1.15 Myricetin 1588 1588 2 2 4.15 505.63 0.13 0.13 0.13 1 P.F. - Pharmacophore Fingerprints. 2 U.F. - Unique Fingerprints. 3 T.C. - Total Conformations. 4 Avg. C./Lig. - Average Conformations per Ligand;. 5 R.G. - Radius of Gyration;. 6 S.A.S.A. - Solvent Accessible Surface Area. 3.2 Lipinski rule and pharmacokinetics The Lipinski rule, accessed through the SwissADME web server, was applied to further drug-likeness analysis on the reported compounds to determine the drug-like properties of our compounds. For this section and the next ones pertaining to ADMET properties, we have also included results pertaining to the FDA approved drug Ribavirin, offering a comparison to a drug currently available on the market. According to the Lipinski rule, oral molecules should have a molecular weight (M.W.) below 500 Da, no more than 5 hydrogen bond donors (HBD), no more than 10 hydrogen bond acceptors (HBA), and a logarithm of the partition coefficient (log P) below 5. Fulfilling these requirements is a prerequisite for compounds to be considered drug-like molecules ( Chen et al., 2020 Table 2 Table 2 Lipinski’s Rule compliance and pharmacokinetic profiles of flavonoid candidates. Evaluation of drug-likeness based on molecular weight, hydrogen bond donors/acceptors, Log P values, and rule violations for each compound. Table 2 PubChem CID Ligand Name Molecular weight Hydrogen bond acceptor Hydrogen bond donor Consensus Log P o/w QED Lipinski rule Result violation 5280343 Quercetin 302.34 07 05 1.23 0.43 Yes 00 68071 Pinocembrin 256.25 04 03 2.26 0.82 Yes 00 5280961 Genistein 270.24 05 03 2.04 0.63 Yes 00 439246 Naringenin 272.25 05 03 1.84 0.74 Yes 00 5281702 Tricin 330.29 07 03 2.15 0.68 Yes 00 5280443 Apigenin 270.24 05 03 2.98 0.63 Yes 00 5280373 Biochanin 284.26 05 03 2.44 0.76 Yes 00 439533 Taxifolin 304.25 07 05 0.51 0.50 Yes 00 5281672 Myricetin 318.24 08 06 0.79 0.37 Yes 01 37542 Ribavirin 244.08 09 05 −1.66 0.44 Yes 00 The Ro5 provides a useful for evaluating drug-likeness based on parameters such as molecular weight, hydrogen bond donors/acceptors, and lipophilicity. However, it is important to recognize its limitations. Many FDA-approved drugs, including antibiotics and anti-cancer agents, violate one or more Ro5 criteria, demonstrating that effective drugs can exist outside these parameters ( Lohit et al., 2025 Fagerholm et al., 2024 3.3 ADMET data investigation The absorption, distribution, metabolism, excretion, and toxicity (ADMET) properties of the evaluated flavonoids were assessed using computational approaches. Optimal pharmacokinetic and toxicological profiles are critical for antiviral agents to ensure therapeutic efficacy while minimizing potential adverse effects ( Fig. 3 Fig. 4 Kerna et al., 2024 Hussein et al., 2023 Shamim et al., 2024 Fig. 3 Heatmap visualization of ADMET properties across all lead flavonoid compounds. Comparative graphical display of absorption, distribution, metabolism, excretion, and toxicity data for each molecule. Fig 3 Fig. 4 Comparative screening of physicochemical properties using multiple drug-likeness filters. Charts evaluating compliance with Pfizer, GSK, Egan, REOS, Golden Triangle, and Drug-Like Soft rules for all compounds. Fig 4 3.3.1 Absorption and distribution Effective oral bioavailability is essential for antiviral agents to achieve therapeutic concentrations in systemic circulation. Typically, the Caco-2 cell permeability assay is employed as a preliminary in vitro Frenț et al., 2024 Itagaki et al., 2023 Zhang et al., 2024 Kondo and Miyake, 2023 Lin and Chiu, 2023 Nevertheless, the limited aqueous solubility commonly exhibited by flavonoids presents substantial obstacles for achieving sufficient oral bioavailability. Specifically, quercetin, despite possessing multiple beneficial pharmacological properties, suffers from notably poor water solubility (∼1 µg/mL), significantly hampering its gastrointestinal absorption and thus restricting clinical effectiveness. This limited solubility stems primarily from its molecular structure, characterized by hydrophobic aromatic rings juxtaposed with polar hydroxyl functionalities, complicating efficient diffusion across the intestinal mucosal barrier and uptake by enterocytes ( Shamim et al., 2024 Furthermore, additional pharmacokinetic limitations of quercetin include reduced intrinsic bioactivity (<10 %), extensive metabolism (>40 %), rapid systemic clearance (plasma half-life typically <1 h), and the rapid formation of inactive metabolites ( Wang et al., 2020 Burlou-Nagy et al., 2023 Deng et al., 2019 The predicted volume of distribution (VDss) values for the flavonoids investigated were generally low, suggesting that these compounds may have limited tissue penetration and tend to remain within the vascular compartment. While this may reduce the risk of tissue accumulation and associated toxicities, it could also necessitate more frequent dosing or formulation strategies to maintain therapeutic levels in peripheral and target tissues. On the other hand, Ribavirin exhibited a VDss of 22.12, which is on the opposite end of the other flavonoids, with values above the higher threshold of 20L/kg. Despite exhibiting high plasma protein binding (PPB > 95 %, compared to the 6.7 % of Ribavirin), which may extend plasma half-life, the limited distribution volume of the flavonoids indicates that only a small free fraction of the compound might be available for pharmacological action. These characteristics underscore the importance of optimizing delivery methods and dosage regimens to ensure adequate bioavailability and sustained therapeutic efficacy. Furthermore, the compounds’ capability to permeate the blood-brain barrier (BBB), as demonstrated by pinocembrin, enhances their relevance in addressing neurological complications associated with neurotropic viral infections such as ZIKV ( Pardridge, 2012 Kim et al., 2018 3.3.2 Metabolism and drug interactions Flavonoid metabolism predominantly involves extensive hepatic biotransformation via cytochrome P450 (CYP) enzymes and phase II conjugation reactions. The studied flavonoids exhibited strong predicted inhibitory effects on several key CYP isoforms, notably CYP3A4 (all), CYP1A2 (8/9), CYP2C19 (5/9), and CYP2D6 (4/9), suggesting a high potential for drug-drug interactions, particularly in polypharmacy scenarios ( Kondža et al., 2024 Bojić et al., 2019 Experimental studies have confirmed that pinocembrin acts as an irreversible inhibitor of CYP3A4, reducing enzymatic activity by approximately 50 % as evaluated via testosterone 6β-hydroxylation and HPLC-DAD detection ( Šarić Mustapić et al., 2018 Amin et al., 2021 Amin et al., 2021 Cao et al., 2015 Sayre et al., 2013 Notably, both preclinical and clinical evidence also supports that quercetin, despite its widespread dietary consumption and natural origin, can significantly modulate drug metabolism. It has been shown to interfere with key drug-metabolizing enzymes such as CYP3A4 and efflux transporters like P-glycoprotein, leading to altered drug pharmacokinetics and bioavailability ( Navrátilová et al., 2018 3.3.3 Excretion and clearance Rapid excretion and efficient clearance are critical to prevent toxic accumulation and ensure pharmacokinetic adequacy. In this study, in silico However, experimental data from a Phase I clinical trial presents a more favorable pharmacokinetic profile for pinocembrin than suggested by in silico Amin et al., 2021 3.3.4 Detailed toxicological profiles and safety evaluations In silico These predicted profiles underscore the limitations of relying solely on in silico in vitro in vivo in vivo To quercetin, human clinical studies at supplemental doses up to 1000 mg/day generally report only mild adverse events, including headaches and gastrointestinal discomfort ( Andres et al., 2018 Andres et al., 2018 in vitro in vivo Moroy et al., 2012 Initial Phase I clinical studies involving intravenous pinocembrin demonstrated a largely favorable safety profile. Doses up to 120 mg were well tolerated, while higher doses (150 mg) resulted in mild-to-moderate urticaria in some subjects ( Cao et al., 2015 Cao et al., 2015 Šarić Mustapić et al., 2018 Navrátilová et al., 2018 Computational predictions indicated an optimal LD₅₀ and minimal toxicity for naringenin, suggesting it is safe at typical therapeutic and dietary levels. Experimental studies support this safety assessment: human clinical trials reported no clinically relevant adverse events at doses ranging from 150 to 900 mg/day ( EFSA Panel on Food Additives and Flavourings (FAF) 2024 EFSA Panel on Food Additives and Flavourings (FAF) 2024 EFSA Panel on Food Additives and Flavourings (FAF) 2024 3.3.5 Limitations of in silico While computational ADMET analyses provide valuable preliminary insights, significant limitations remain when assessing the toxicological profiles of flavonoids. Current predictive models are predominantly trained on synthetic drug libraries adhering to Lipinski’s rules, which inadequately capture the unique chemical features and extensive phase II conjugative metabolism ( e.g. Frenț et al., 2024 For example, although naringenin is frequently predicted as non-toxic, extensive in vivo EFSA Panel on Food Additives and Flavourings (FAF) 2024 in silico Moroy et al., 2012 Another critical limitation is that many in silico Frenț et al., 2024 Furthermore, the scarcity of high-quality experimental datasets for flavonoids hampers the refinement of computational models. Without robust pharmacokinetic and toxicological data, predictions remain largely extrapolative and subject to considerable uncertainty ( Bhowmik et al., 2021 in silico EFSA Panel on Food Additives and Flavourings (FAF) 2024 Bhowmik et al., 2021 To overcome these challenges, it is imperative to integrate comprehensive empirical validation strategies—such as targeted in vitro in vivo Future research should prioritize in vivo 3.4 Quantum calculations of flavonoids compounds 3.4.1 Energetic characterization This study thoroughly analyzed several energy-related characteristics for a series of nine flavonoid compounds ( Table 3 Table 3 Quantum mechanical energy parameters of optimized flavonoids. Calculated total energy, binding energy, dipole moment, solvation energy, molecular surface area, and cavity volume using DFT-based quantum method. Table 3 Name Total energy (Ha) Binding energy (Ha) Dipole Mag Dielectric sol energy (Ha) Solvation energy (Ha) Surface Area Cavity volume Quercetin −1169.082 −74.22517 2.8120539 0.066328 0.0663282 1016.323 1977.63 Pinocembrin −932.4411 −61.29858 1.6979104 0.046101 0.0461008 947.1669 1836.59 Genistein −1010.535 −65.47291 2.604126 0.056329 0.056329 959.636 1864.36 Naringenin −1011.715 −65.67548 2.1939691 0.055877 0.0558765 976.543 1889.85 Tricin −1181.511 −7.17904 1.0805842 0.043415 0.0434149 1152.701 2245.979 Apigenin −1010.546 −65.48369 2.808361 0.056454 0.0564537 962.9695 1864.34 Biochanin −1052.248 −68.49523 2.4094422 0.049625 0.0496245 1030.801 2001.07 Taxifolin −1170.251 −74.41805 3.0066148 0.068344 0.068344 1033.513 2018.95 Myricetin −1248.352 −78.59883 2.5985562 0.06629 0.0662896 1050.55 2051.97 The dielectric solvation energy represents the polarization energy in a dielectric media, whereas the solvation energy refers to the energy shift that occurs when a molecule is transferred from a vacuum to a solvent. These parameters were determined for each molecule, and the results ranged from 0.0434 Ha to 0.0683 Ha Surface areas of the molecules ranged from 947.1669 Å² to 1152.7014 Å², indicating their interaction with the environment. Finally, cavity volumes were estimated to measure the space within molecular structures, and they ranged from 1836.59 cubic angstroms to 2245.979 cubic angstroms. 3.4.2 Quantum chemical descriptors Quantum chemical calculations are extensively utilized in chemistry and related fields, enabling the development of new materials, exploration of reaction mechanisms, and prediction of spectroscopic properties. These calculations were effectively applied in a DFT study to suggest new pharmacological possibilities ( Amin et al., 2021 Kawsar et al., 2024 Quantum Calculation, 2022 Kawsar et al., 2024 We can determine the interaction between molecules by analyzing their frontier molecular orbitals (FMOs). This analysis involves two main orbitals: the HOMO, which is the outermost orbital that contains electrons and typically acts as an electron donor, and the LUMO, which is the innermost orbital with available space to accept electrons ( Kawsar et al., 2024 Figs. 5 and 6 Table 4 . Table 4 Fig. 5 Visualization of HOMO and LUMO orbitals for Quercetin, Pinocembrin, Genistein, Naringenin, and Tricin. Frontier molecular orbital maps indicating electron donor and acceptor regions that influence reactivity and interactions. Fig 5 Fig. 6 Frontier Molecular Orbitals (HOMO and LUMO) and Electrostatic Potential Isosurfaces of Apigenin, Biochanin, Taxifolin, and Myricetin. Fig 6 Table 4 Frontier Molecular Orbital Energies and Quantum Chemical Descriptors of Flavonoid Derivatives. Table 4 Ligand Quantum chemical descriptors * ⁎⁎ HOMO LUMO GAP I A η σ μ χ ω Quercetin −5.72828 −2.10629 3.62198 5.72828 2.106295 1.810992 0.552183 3.917287 −3.91729 13.89497 Pinocembrin −6.38885 −1.65222 4.73662 6.388846 1.652222 2.368312 0.422242 4.020534 −4.02053 19.14152 Genistein −5.91027 −1.62657 4.2837 5.91027 1.626569 2.14185 0.466886 3.76842 −3.76842 15.20819 Naringenin −6.20836 −1.63718 4.57118 6.208361 1.637176 2.285592 0.437523 3.922769 −3.92277 17.58548 Tricin −5.12416 −2.71963 2.40453 5.124159 2.719632 1.202263 0.831764 3.921895 −3.9219 9.246166 Apigenin −6.10497 −1.88651 4.21846 6.104968 1.886507 2.109231 0.474107 3.995737 −3.99574 16.8379 Biochanin −5.87005 −1.61803 4.25202 5.870048 1.618027 2.12601 0.470365 3.744038 −3.74404 14.90101 Taxifolin −6.04355 −1.94767 4.09588 6.043548 1.947673 2.047938 0.488296 3.995611 −3.99561 16.34756 Myricetin −5.76204 −2.13597 3.62608 5.762044 2.135966 1.813039 0.55156 3.949005 −3.949 14.13684 Ribavirin −7.78654 −1.47268 6.31386 7.786542 1.472681 3.156931 0.316763 −4.62961 4.62961 33.83172 ⁎ Ionization potential (I), electron affinity (A), chemical hardness (ɳ), softness (σ), chemical potential (μ), electronegativity index (χ) and electrophilicity index (ω);. ⁎⁎ Unit of measurement: eV. Quercetin has a HOMO value of −5.72828 eV and a LUMO value of −2.10629 eV, resulting in a relatively low energy gap (GAP) of 3.62198 eV. This lower GAP indicates that Quercetin has a higher reactivity, which may enhance its ability to interact with biological targets. Pinocembrin, on the other hand, shows the second most negative HOMO (−6.38885 eV) and a LUMO of −1.65222 eV, leading to the second largest energy gap among the compounds at 4.73662 eV, suggesting it is less reactive but potentially more stable. Genistein and Naringenin also exhibit relatively large energy gaps (4.2837 eV and 4.57118 eV, respectively), indicating moderate reactivity. Tricin shows the smallest GAP (2.40453 eV), suggesting it might be the most reactive of all the ligands, which could be advantageous or disadvantageous depending on the target interaction context. Ribavirin showed the highest GAP out of all compounds (6.31386 eV), hinting at its experimentally proven chemical stability. For ionization potential (I) and electron affinity (A), quercetin presents a relatively moderate ionization potential (5.72828 eV) and electron affinity (2.106295 eV), which balances its reactivity and stability. Pinocembrin and naringenin have higher ionization potentials (6.388846 eV and 6.208361 eV, respectively), indicating that they require more energy to remove an electron, correlating with their larger energy gaps and suggesting higher stability. Tricin exhibits a lower ionization potential (5.124159 eV) and higher electron affinity (2.719632 eV), further indicating its higher reactivity compared to other ligands. At 7.786542 and 1.472681 eV for ionization and electron affinity respectively, Ribavirin once again presents itself as the more stable compound of all ligands, also correlating to the large HOMO-LUMO gap observed. In another analysis about chemical hardness (η) and softness (σ), pinocembrin shows the second highest chemical hardness (2.368312 eV), corresponding to the lowest softness (0.422242 eV), reinforcing its stability and lower reactivity. In contrast, tricin has the lowest hardness (1.202263 eV) and the second highest softness (0.831764 eV), aligning with its high reactivity. Quercetin and myricetin demonstrate moderate values for hardness and softness, balancing between stability and reactivity. With a chemical hardness of 3.156931 and softness of 0.316763 eV respectively, Ribavirin has the highest η and lowest σ of all compounds. For the chemical potential (μ) and electronegativity (χ), quercetin and naringenin have chemical potentials of −3.917287 eV and −3.922769 eV, respectively, with electronegativity values around −3.92 eV. These values indicate a moderate tendency to attract electrons, which is beneficial in binding interactions. Pinocembrin exhibits a slightly higher chemical potential (−4.020534 eV), making it slightly less reactive in comparison. Ribavirin presented values of −4.62961 eV for chemical potential and 4.629612 eV for electronegativity. Tricin shows a lower chemical potential (−3.921895 eV), consistent with its higher reactivity. Latelly, electrophilicity index (ω) pinocembrin has the highest electrophilicity index (19.14152 eV) out of the proposed compounds, suggesting it is the most likely to accept electrons during a reaction, which can be advantageous in specific drug-target interactions. Quercetin and naringenin show moderately high electrophilicity values (13.89497 eV and 17.58548 eV, respectively), indicating their suitability as electrophiles in biological systems. Tricin exhibits the lowest electrophilicity (9.246166 eV), which aligns with its overall higher reactivity and less selective electron-accepting behavior. At 33.83172 eV for its electrophilicity index, Ribavirin was shown as an outlier and highlights its position as a market-available drug compared to other lead compounds. Studies have shown that flavonoids, with their lower energy gap and high electrophilicity, effectively inhibit the replication of ZIKV by interacting with viral proteases and altering viral RNA synthesis ( Cataneo et al., 2021 3.4.3 Molecular electrostatic potential (MEP) surface result analysis Fig. 7 Fig. 7 Molecular electrostatic potential (mep) surface maps and optimized structures. Electrostatic potential distributions mapped onto the molecular surface, showing electrophilic and nucleophilic regions. Fig 7 Among these flavonoids, the oxygen-containing functional groups - particularly hydroxyl moieties - often appear in red, indicating a propensity to donate electron density or form hydrogen bonds. In contrast, hydrogen atoms linked to carbon skeletons typically emerge in blue, reflecting electron-poor areas that may engage in electrostatic attractions with negatively charged sites. By mapping these electrostatic potentials, it becomes clearer how each compound could interact with biological targets, for instance, through hydrogen bonding, π–π stacking, or other non-covalent interactions (details in). Ultimately, the MEP data assist in rationalizing both the reactivity profiles of the flavonoids and their potential binding modes to target proteins, including the ZIKV envelope protein. 3.5 Pharmacophore mapping In ligand-based drug design, pharmacophore mapping helps identify the essential features or chemical properties (such as hydrogen bond donors/acceptors, hydrophobic regions, aromatic rings, etc.) that are critical for a molecule to interact with a target receptor or enzyme. By incorporating the necessary pharmacophoric elements, we can use this information to design new drug candidates or optimize existing ones. In pharmacophore mapping, we use the fit score as a quantitative measure to evaluate the degree of similarity or match between a pharmacophore model and a specific chemical structure or molecule. Fig. 8 Fig. 8 Pharmacophore mapping models of the top three compounds using PharmMapper. Fig 8 While the flavonoids studied are not directly known to inhibit the target protein, their fit scores, as shown in Table 6 The normalized fit score also gives a consistent way to measure how similar two things are, which lets researchers compare different compounds and pharmacophore models in pharmacophore mapping studies. This approach enhances our understanding of the potential biological activity and therapeutic relevance of the compounds ( Gece, 2008 Mahmud et al., 2023 In our study, we made an intriguing discovery regarding the compound's quercetin, pinocembrin, and naringenin. Interestingly, all three compounds exhibited comparable normalized fit scores, namely 0.7425, 0.767, and 0.7564, respectively ( Table 5 Table 5 Pharmacophore mapping output for top-ranked ligands (quercetin, pinocembrin, and naringenin): fit scores, normalized fit scores, and number of pharmacophoric features identified, including hydrogen bond donors, hydrogen bond acceptors, and hydrophobic centers. Table 5 Parameters Quercetin Pinocembrin Naringenin Fit score 2.97 3.068 3.026 Normalized fit score 0.7425 0.767 0.7564 Hydrophobic centre 2 3 3 Positively charged centre 0 0 0 Negatively charged centre 0 0 0 H bond donor 2 0 0 H bond acceptor 0 1 1 Aromatic ring 0 0 0 Furthermore, we examined the specific characteristics of these compounds and found that both pinocembrin and naringenin ligands possessed the same number of hydrophobic centers and hydrogen bond acceptors. Conversely, only quercetin exhibited a hydrogen bond donor, while none of the compounds had positively charged centers, negatively charged centers, or aromatic rings (as shown in Table 5 Overall, our study shows that quercetin, pinocembrin, and naringenin not only have similar normalized fit scores, which means they strongly agree with the pharmacophore model, but they also have unique properties that may affect how they interact with the target receptor or enzyme. 3.6 Molecular docking analysis of targeted receptor of With the help of molecular modeling methods, it is possible to determine the binding capacity of small molecules to target proteins. The docking process can be described in two main steps: the prediction of the ligand conformation and its position and orientation within the binding site (often referred to as the pose) and the estimation of binding affinity using a scoring function ( Najmi et al., 2022 Kumer, 2022 Using ribavirin as a reference control underscores the apparent preference of the ZIKV envelope protein (ZIKV_E) pocket for polyphenolic scaffolds. Across our panel, docking scores ranged from –6.5 to –8.3 kcal/mol, with quercetin (–8.3 kcal/mol), pinocembrin (–8.1 kcal/mol), and naringenin (–8.0 kcal/mol) ranking highest and outperforming ribavirin (–5.9 kcal/mol) by ∼2.1–2.4 kcal/mol ( Table 6 e.g. Table 6 Molecular docking binding affinity of flavonoids against ZIKV envelope Protein (PDB ID: 5JHM). Binding energies (kcal/mol) of each flavonoid compound when docked with the ZIKV envelope protein, indicating inhibitory potential. Table 6 Name of compound Molecular Formula ZIKV Envelope protein (PDB ID 5JHM Binding Affinity (kcal/mol) Quercetin C 15 10 7 −8.3 Pinocembrin C 15 12 4 −8.1 Genistein C 15 10 5 −7.7 Naringenin C 15 12 5 −8.0 Tricin C 6 13 5 −7.4 Apigenin C 15 10 5 −7.0 Biochanin A C 16 1 5 −6.5 Taxifolin C 15 12 7 −7.9 Myricetin C 15 10 8 −7.5 Ribavirin C 8 2 4 5 −5.9 Upon additional docking using Dockthor, the binding affinities were further compared. Quercetin demonstrated the strongest binding affinity (−8.634 kcal/mol), followed by pinocembrin (−8.396 kcal/mol) and naringenin (−7.125 kcal/mol). These updated results support the original findings and confirm that quercetin and pinocembrin show very stable interactions with the ZIKV_E, while naringenin shows comparatively weaker binding. Furthermore, they emphasize that flavonoid-based molecules can effectively interact with the ZIKV_E, potentially stabilizing the protein in a non-functional conformation and preventing viral entry. The strong binding affinities observed for quercetin in this study are consistent with prior reports of its antiviral activity against ZIKV. Experimental studies have shown that quercetin inhibits ZIKV replication and viral particle production in A549 and Vero cells ( Cataneo et al., 2021 Saivish et al., 2023 The high binding affinities can be attributed to specific molecular interactions such as hydrogen bonding, hydrophobic interactions, and π-π stacking, which are critical for stable ligand-protein complexes ( Ozawa et al., 2017 Seo et al., 2021 Table 6 Pereira et al., 2023 Molecular interaction analysis of naringenin-ZIKV_E complex, the ligand forms significant hydrogen bonds with HIS A:144 and VAL A:300, which play a central role in anchoring to the active site. These interactions are supported by hydrophobic contacts with residues such as VAL A:364, ALA A:361 and TYR A:305 as well as weak van der Waals interactions with nearby residues. Taken together, these interactions provide stable positioning of naringenin within the binding pocket and emphasize its potential as a potent inhibitor. In the quercetin-ZIKV_E complex, a combination of hydrogen bonding and hydrophobic interactions enhances binding. Quercetin forms hydrogen bonds with ASN A:362, ASP A:37 and LYS A:39, anchoring the molecule firmly in the active site. Stabilization is enhanced by hydrophobic interactions with residues such as VAL A:356 and ALA A:361, while additional van der Waals forces involve residues such as GLN A:344 and MET A:345. This series of interactions gives quercetin a robust and stable binding orientation, supporting its potential as a potent inhibitor. For the pinocembrin-ZIKV_E complex, a crucial hydrogen bond with HIS A:144 plays an important role in stabilizing the ligand in the active site. Hydrophobic interactions with residues such as VAL A:364 and LEU A:300 further strengthen its positioning, while weak van der Waals contacts with ASN A:362, PRO A:39 and TYR A:305 contribute to additional stabilization. These combined interactions emphasize the strong binding affinity of pinocembrin and its potential efficacy as an inhibitor. 3.7 Molecular dynamics simulation (MDs) and quantum mechanics/molecular mechanics (QM/MM) results 3.7.1 Root mean square deviation analysis (RMSD) Root mean square deviation (RMSD) calculations were conducted on the ligands and complexes throughout a 100 ns molecular dynamics (MD) simulation for each protein-ligand interaction to determine the structural stability, with lower values indicating greater stability ( Lindorff-Larsen et al., 2010 Fig. 9A Fig. 9 (A) Root Mean Square Deviation (RMSD) plot showing the structural stability of the ligands quercetin (black), pinocembrin (red), and naringenin (green) throughout the 100 ns simulation; (B) RMSD plot of the protein-ligand complexes highlighting the dynamic stability of quercetin (black), pinocembrin (red), and naringenin (green) within the ZIKV envelope protein binding site over time. Fig 9 However, after 35 ns, the naringenin and quercetin ligands showed a sharp increase in RMSD values. The naringenin ligand achieved the highest RMSD increases in the simulation between 65–70 ns and 90–95 ns. Similarly, the quercetin ligand exhibited the highest RMSD values, particularly at 65 ns and 80 ns during the simulation. These findings indicate that both naringenin and quercetin, when bound, exhibit numerous binding orientations and move beyond the binding pocket during the MD simulations. Both the quercetin and naringenin ligands changed the direction of their binding during the simulation. The pinocembrin ligand, on the other hand, stayed in its binding state the whole time. This observation indicates that the intermolecular interactions of the pinocembrin compound remain unchanged during the simulation, and its conformational orientation remains consistent without significant fluctuation. We calculated the RMSD values of all three protein-ligand complexes throughout the 100 ns MD trajectory to assess the stability of each complex, as shown in Figure 19B The average absolute RMSD values for the complexes are 15.65, 6.201, and 16.575 Å, respectively. All three complexes continued to move away from their initial positions until 20 ns after the start of the simulation, with this increase being particularly noticeable in the naringenin complex. After this period, there was a notable decrease in the naringenin complex. While it remained stable for a short time, the RMSD value began to gradually increase after 35 nanoseconds (ns), reaching its peak values, particularly between 60–80 ns and the last 10 ns of the simulation. The quercetin complex showed a similar behavior throughout the simulation. The RMSD value showed the highest increase, especially after 40 ns, and continued to fluctuate until the end of the simulation. However, the pinocembrin complex showed a different stability compared to the other two structures. Although the pinocembrin complex showed a sharp increase at 20 ns, it remained stable from this point until the simulation's end. Overall, the pinocembrin complex with the ZIKV envelope protein (PDB ID 5JHM 3.7.2 Root mean square fluctuation (RMSF) analysis RMSF is a valuable method for assessing the residual flexibility of a protein's backbone, which is an important aspect of MD modeling. The RMSF metric evaluates the crucial role of protein residues in achieving a stable conformation in a protein-ligand complex. A higher RMSF value indicates greater flexibility, while lower RMSF values indicate a more stable region ( Karjiban et al., 2009 Shukla and Tripathi, 2020 Fig. 10 Fig. 10 Residue-level RMSF analysis of protein backbone in ligand-bound complexes. Per-residue fluctuation patterns showing flexible and stable regions of the protein backbone after ligand binding. Fig 10 The RMSF plot produces a graphical representation characterized by distinct peaks, with each peak corresponding to a relatively high RMSF value ( Fig. 10 Fig. 10 Fig. 10 3.7.3 Radius of gyration (Rg) analysis We plotted the gyration radius diagram of each structure throughout the simulation to evaluate the changes in structural compression. We calculated Rg to ascertain the system's compactness over time, where a higher Rg value signifies less compactness (more unfolded) with conformational entropy, and a lower Rg value indicates more compactness with increased structural stability (more folded) ( Chen et al., 2020 In general, the fluctuations observed in the Rg values exhibit different characteristics for each complex, and their structural compactness is quite different. According to the results, complex-naringenin exhibits the largest Rg value and suffers a greater loss of compactness compared to the other complexes. During the first 40 nanoseconds and after the simulation, the RG value increased significantly, indicating a relatively low binding affinity between the ligand and the active site. In contrast, the pinocembrin complex and the naringenin complexes exhibit lower RG values. The pinocembrin complex exhibited considerable fluctuations during the simulation, particularly between 80 and 90 nanoseconds. However, it ultimately maintained its stability and compactness until the end of the simulation ( Fig. 11 Fig. 11 Radius of Gyration (Rg) analysis of ZIKA vius protein–ligand complexes throughout the simulation. Evaluates structural compactness and conformational integrity of protein–ligand systems over 100 ns. Fig 11 3.7.4 Hydrogen bond analysis We quantified hydrogen bonds (H-bonds) occupancy/time evolution, then we interpreted those data together with RMSD/RMSF/Rg to understand stability during the simulation. To comprehend the relationships between biomolecules, it is necessary to perform a geometric study of hydrogen bonds. Hydrogen bonds play a crucial role in preserving the structural integrity of biomolecules. During MD simulations, the formation of hydrogen bonds (H-bonds) is crucial for the stability of the complexes. We calculated and plotted the number of H-bonds formed by the ligand molecule with the proteins (quercetin and pinocembrin) on a graph, as shown in Fig. 12 (A and B) Fig. 12 Hydrogen bond formation timeline during molecular dynamics simulations for (A) quercetin and (B) pinocembrin. Fig 12 We used the VMD H-bonding analysis program to investigate all possible H-bonding interactions between the protein and the ligand over a period of time. The result calculates the cumulative count of hydrogen bonds and their presence for a given time period. The numbers can be obtained from the \"Percentage occupancy of the Hbond\" output of the H-bond analysis tool. The output of the H-bond analysis tool provides the numbers for the percentage occupancy of the H-bond. The MD simulations preserved not all hydrogen bonds present in the docking structures, but they also observed the formation of new hydrogen bonds. The MD simulation of the naringenin complex detected hydrogen bonds. Conversely, the quercetin molecule retained the majority of hydrogen bonds observed in the docking simulation, whereas the pinocembrin compound had a lower number of such bonds ( Table 7 Table 7 Hydrogen bonding interactions and occupancy percentage in protein–ligand complexes. List of key donors–acceptor pairs and the percentage of time these hydrogen bonds persisted during MD simulation. Table 7 Compound Donor Acceptor Occupancy Quercetin MET345-Main-N UNK0-Side-O6 3.29 % UNK0-Side-O6 ASP348-Main-O 3.19 % Pinocembrin UNK0-Side-O3 HSP144-Main-O 33.13 % UNK0-Side-O3 ALA361-Main-O 10.08 % During the simulation, the quercetin molecule had a lower number of hydrogen bonds, with the majority occurring between 10 ns and 30–58 ns. However, the pinocembrin molecule exhibited a higher degree of hydrogen bond formation, and this formation persists throughout the entire simulation. These hydrogen bonds reached their highest value between 40–60 ns and 80–90 ns, especially in the simulation. The quercetin complex remained stable throughout the molecular dynamics (MD) due to its connections with the amino acids MET345 and ASP348, whereas the pinocembrin complex maintained its connections with HSP144 and ALA361. As a result, the pinocembrin compound has a lower total number of hydrogen bonds but a higher hydrogen bond occupancy than the quercetin compound. Because the number and occupancy of hydrogen bonds are key for stabilizing the interaction of the protein-ligand complex, the pinocembrin complex is a highly stable system. 3.7.5 Principal component and free energy landscape analysis We used Principal Component Analysis (PCA) to analyze the simulation trajectory and identify the main modes of motion and generated PCA graphs to analyze the primary structural variations of the quercetin, pinocembrin, and naringenin complexes. Fig. 13 (A and B Fig. 13 Fig. 13 (A) 2d projections of trajectories on eigenvectors of quercetin, pinocembrin, and naringenin. (B) Cumulative variance explained by PC1 and PC2 for quercetin, pinocembrin, and naringenin. Quercetin (black), Pinocembrin (red), and Naringenin (green) complexes. Fig 13 In the figure of Fig. 13b Fig. 13 3.7.6 Gibbs free energy landscape (FEL) We used Gibb's free energy landscape (FEL) to better understand the general conformational behavior of the system. To identify the low-energy basins (minima) investigated during the simulation, we conducted an FEL analysis ( Abouzied et al., 2024 Figure S1B The stability of the corresponding conformation and system improves as the Gibb's free energy value decreases. The findings indicate that the pinocembrin complex has a larger number of conformations in a low energy state compared to naringenin and quercetin. The dark blue patches in Figure S1 Figure S1 A-C 3.7.7 Dynamics cross-correlation matrices (DCCM) analysis We used DCCM analysis to investigate the conformational changes of the targeted ZIKV envelope, analyzing all Ca Figure S2 When comparing the DCCM diagrams of the three systems, it becomes evident that the correlation behavior of the numbered systems naringenin and quercetin differs drastically from that of the pinocembrin system. The black boxes reveal a notable rise in negative correlation movements in both systems, while the positive correlation decreases in comparison to the pinocembrin system. This rise is particularly noticeable in the structure of naringenin ( Figure S2 A-C This increase indicates significant changes in protein-related motions following ligand binding. Analysis of the DCCM diagrams for the quercetin and naringenin systems revealed no significant differences in the correlation motions. The fact that the naringenin and quercetin systems have negatively correlated motions shows that the protein's structure is very unstable, especially after it comes into contact with a ligand. These results link the DCCM results to the biological functionality of the ZIKV envelope protein. The increase in negative correlations observed for the naringenin and quercetin systems, particularly in regions critical for conformational rearrangements, suggests that these ligands may destabilize the dynamic flexibility required for the protein’s functional transitions. This destabilization likely impairs the ability of the envelope protein to undergo the structural rearrangements required for membrane fusion and viral entry. In contrast, the relatively stable correlation patterns in the pinocembrin system suggest that this ligand maintains the conformational integrity of the protein to a greater extent, which may correspond to a less pronounced inhibitory effect. These observations highlight the influence of ligand binding on the functional dynamics of the ZIKV coat protein, with quercetin and naringenin showing a greater potential to disrupt its biological activity. 3.7.8 Binding free energy analysis We used the MM/PBSA approach to calculate the binding free energy in protein-ligand complexes (quercetin-ZIKV_E, pinocembrin-ZIKV_E, and naringenin-ZIKV_E) for the analysis of molecular binding relationships. This approach takes into account several interactions, such as binding and non-binding forces, like van der Waals and electrostatic forces. The binding free energy of these complexes was calculated using the MM/PBSA approach, focusing on the last 10 nanoseconds of the trajectory. We employed the MM/PBSA approach to determine the binding free energy (DG bind) of the ligands quercetin, pinocembrin, and naringenin. MM/PBSA values for the less stable complexes should be interpreted comparatively, as they reflect equilibrated sub-windows rather than the entire trajectory. Although a larger amount of frames could be selected for this step, it would come at the risk of including highly unstable conformations from our 100 ns MD, so preference was given to the last, and theoretically more stable, frames; moreover, as this analysis is purely comparative, as long as the same amount of frames is selected for each system, the overall behavior should remain similar compared to more lasting calculations. In this approach the binding affinity values are integrated. Lower DG values suggest higher binding affinities between proteins and ligands. As the values become increasingly negative, the free energy between proteins and ligands becomes more favorable. Table 8 Figure S3 (A-C) Table 8 Binding free energy decomposition of flavonoid-ZIKV_E complexes based on mm-pbsa calculations. Displays the contribution of van der Waals (ΔE VDW EEL PB NP DISP Binding Table 8 Name ΔE VDW ΔE EEL ΔG PB ΔG NP ΔG DISP ΔG Binding Quercetin −0.00 −0.01 −0.02 0.00 0.00 −0.03±4.88 Pinocembrin −30.85 −11.44 37.27 −3.25 0.00 −8.27±2.50 Naringenin −0.00 0.00 −0.13 −0.00 0.00 −0.13±4.14 3.7.9 Normal mode analysis We investigated the dynamic behavior of the ZIKV envelope protein in complex with naringenin, pinocembrin and quercetin using the IMODS platform. The analysis showed how each of these compounds affects the flexibility and stability of the receptor, which may be consistent with the other analyzes developed in this work. These results act as a complement to our MD findings, allowing us to explore longer simulated timeframes at low computational costs when compared to more robust dynamic simulations. These results are used to predict how a given system would behave over longer periods of time, expanding further than regular dynamics. The eigenvalue analysis of the three complexes reveals distinct differences in the flexibility of the ZIKV envelope protein upon ligand binding. Quercetin stands out as it induces the most flexible state of the protein, as evidenced by the lowest eigenvalue (5.803972 × 10 −05 (Figure S4 A). −05 (Figure S5A) −05 (Figure S6A) While our findings suggest that quercetin induces the highest degree of flexibility in the ZIKV envelope protein, as evidenced by the lowest eigenvalue (5.803972 x −05 Tu et al., 2015 The variance distribution further corroborates our observations. While all three compounds allow the receptor to explore its conformational landscape, Quercetin facilitates a broader range of motion, with nearly 90 % (Figure S4B) (Figure S5B) (Figure S6B) Donyapour et al., 2023 The covariance matrices provided a deeper understanding of the dynamics between residues within the ZIKV envelope protein when complexed with these flavonoids. Quercetin again showed a pronounced effect, triggering extensive correlated and anticorrelated movements between residues (Figure S4C, S5C) (Figure S6C) The elastic network models for these complexes show important differences in the structural rigidity conferred by each flavonoid (Figure S4D, S5D and S6D) Kerna et al., 2024 Donyapour et al., 2023 3.7.10 QM/MM results The energetic profiles of the three principal flavonoid–ZIKV_E complexes - quercetin–ZIKV_E, pinocembrin–ZIKV_E, and naringenin–ZIKV_E - were comprehensively evaluated using QM/MM calculations. The results revealed a marked enhancement in system stability following QM/MM optimization, most notably for the quercetin–ZIKV_E complex. Prior to the QM/MM refinement, quercetin–ZIKV_E already exhibited the lowest quantum mechanical energy (−13,978.515 Ha), suggesting inherent structural stability relative to the other complexes. Post-optimization, the energy further decreased substantially to −71,718.787 Ha, indicating a pronounced stabilization effect mediated by the QM/MM interaction ( Table 9 . Table 9 QM/MM optimization and energy minimization data for flavonoid–zikv envelope protein complexes. Initial and final quantum mechanical (QM) energies (in Hartrees, Ha) and QM/MM interaction energies (in kcal/mol) for naringenin, pinocembrin, and quercetin complexes with the ZIKV envelope receptor, obtained through ONIOM-based hybrid quantum mechanics/molecular mechanics (QM/MM) calculations. Table 9 Naringenin Pinocembrin Quercetin Initial ( Final −13,890.064 −13,849.426 −13,978.515 Initial ( Final 105.98 104.04 −27.244 This energetic profile is consistent with previous findings that underscore quercetin’s high binding affinity and its pronounced capacity to stabilize protein conformations through an extensive network of hydrogen bonds and hydrophobic contacts ( Zhang et al., 2024 Shaw et al., 2025 Shaw et al., 2025 In comparison, both naringenin–ZIKV_E and pinocembrin–ZIKV_E demonstrated enhanced energetic stability following QM/MM optimization, with their Quantum energies decreasing from −13,890.064 to −29,575.465 and from −13,849.426 to −29,580.622, respectively. Nonetheless, the substantially lower final energy observed for the quercetin–ZIKV_E complex underscores its superior stability, likely reflecting more extensive and effective binding interactions - an observation aligned with previous molecular docking studies. These findings are consistent with literature reports describing the moderate binding affinities of naringenin and pinocembrin and their therapeutic relevance in contexts such as neuroprotection and cardiovascular modulation ( García Forero et al., 2019 Habtemariam, 2019 Borriello et al., 2019 A critical insight emerges when comparing the initial and post-optimization QM/MM interaction energies across the three flavonoid–ZIKV_E complexes. All compounds exhibited a marked decrease in interaction energy following optimization, indicating enhanced binding stability - a desirable and significant outcome. Initially, both naringenin–ZIKV_E and pinocembrin–ZIKV_E presented positive interaction energies (105.98 and 104.04 kcal/mol, respectively), denoting thermodynamically unfavorable binding when evaluated in their pre-optimization, force field-based docking conformations. This observation underscores a pivotal point: despite favorable docking scores, the most promising docked complexes can be intrinsically unstable when examined through a quantum mechanical lens. The electronic structure analysis revealed inconsistencies between apparent docking affinity and true energetic viability, exposing limitations inherent in classical force field-based docking approaches. Therefore, we emphasize the critical importance of performing quantum-level optimization following preliminary molecular docking procedures to obtain more accurate and energetically reliable representations of biomolecular interactions. After optimization, all complexes reached negative interaction energies: −69.146 kcal/mol for naringenin, −56.425 kcal/mol for pinocembrin, and −67.917 kcal/mol for quercetin. The transition from positive to negative interaction energy for naringenin and pinocembrin confirms that QM/MM refinement substantially improved binding stability ( Table 9 . 3.7.11 Interaction analysis of flavonoid–ZIKV_E complexes after QMMM calculations Figures S7A, S7B S7C In the case of naringenin (Figure S7A) Pinocembrin (Figure S7B) Quercetin (Figure S7C) The binding interactions of naringenin, pinocembrin and quercetin with the target protein emphasize their potential as therapeutic agents, particularly in modulating protein functions relevant to diseases such as cancer and viral infections. The strong binding affinity of quercetin, for example, supported by multiple hydrogen bonds, is consistent with its known antioxidant and anti-inflammatory properties, which have been shown to inhibit critical enzymes involved in viral replication and carcinogenesis ( EFSA Panel on Food Additives and Flavourings (FAF) 2024 EFSA Panel on Food Additives and Flavourings (FAF) 2024 3.8 Selectivity of flavonoids (Quercetin, pinocembrin, naringenin) for viral versus Evaluating the selectivity of antiviral compounds for viral proteins versus versus One pertinent study, although focusing on a different flavonoid (silibinin), provides insights into how selectivity assessments can highlight the therapeutic promise of flavonoids. Silibinin exhibited strong selectivity for SARS-CoV-2 viral proteins such as the spike protein (IC50 0.029 μM), main protease (IC50 0.021 μM), and RNA-dependent RNA polymerase (IC50 0.042 μM), without any inhibitory effect on the human transmembrane serine protease TMPRSS2. Notably, silibinin was safe for mammalian cells at concentrations significantly higher than its antiviral IC50, underscoring its high therapeutic index ( Hamdy et al., 2022 Additionally, studies focusing on flavonoids such as quercetin have predominantly investigated their binding properties to specific human proteins, such as human serum albumin (HSA), rather than evaluating their preferential selectivity toward viral proteins. Quercetin’s binding affinity to HSA sites has been shown to be influenced significantly by structural modifications, but without a direct comparison against viral proteins, the clinical relevance for antiviral specificity remains uncertain ( Mukai et al., 2024 The broader flavonoid literature demonstrates potential antiviral activities but generally lacks explicit comparative selectivity evaluations against human proteins. For instance, virtual molecular docking models have demonstrated quercetin's effective interaction with SARS-CoV-2 replication-cycle proteins, including spike, 3CLpro/MPro, and RdRP, highlighting multiple potential antiviral targets ( Toigo et al., 2023 Berkane et al., 2024 Li et al., 2020 Alvarez De Lauro et al., 2023 Similarly, naringenin has been reported to prevent ZIKV infection in human A549 cells effectively in a concentration-dependent and ZIKV-lineage-independent manner, with molecular docking suggesting potential interactions with the protease domain of the NS2B-NS3 protein ( Cataneo et al., 2019 Morimoto et al., 2022 While our study provides an in-depth analysis of flavonoid interactions specifically with the ZIKV envelope protein, we did not directly assess their selectivity against human proteins or other off-target receptors. Although our in silico Future investigations should therefore aim to expand our computational methodologies to systematically include selectivity profiling. Performing comparative docking and molecular dynamics simulations against a panel of representative human proteins, and possibly other viral targets, would significantly enhance the reliability and clinical relevance of flavonoid-based antiviral research. Furthermore, extensive virtual screening approaches employing cross-docking analyses and in silico 4 Conclusion This computational study was conducted to identify new inhibitors for the ZIKV. We focused on naturally occurring compounds known as flavonoids and employed molecular docking to evaluate their antiviral potential. Through in silico 5JHM in silico Ethics approval and consent to participate Not applicable since it’s a theoretical study. Consent for publication Not applicable. Clinical trial number Not applicable. Availability of data and materials The datasets generated and/or analyzed during the current study are available in the manuscript. However, some data are taken from online sources such as protein databank and they are available in this link ( https://www.rcsb.org/structure/5jhm Funding None. CRediT authorship contribution statement Jehad Zuhair Tayyeb: Maria Karolaynne da Silva: Aamal A. Al-Mutairi: Hanan M. Alharbi: Alaa A. Khojah: Imren Bayıl: Abdullah Yahya Abdullah Alzahrani: Zsolt Tóth: Jonas Ivan Nobre Oliveira: Magdi E.A. Zaki: Declaration of competing interest The authors declare no conflicts of interest References Abouzied A.S. Alqarni S. Younes K.M. Alanazi S.M. Alrsheed D.M. Alhathal R.K. Huwaimel B. Elkashlan A.M. Structural and free energy landscape analysis for the discovery of antiviral compounds targeting the cap-binding domain of influenza polymerase PB2 Sci. Rep. 14 2024 25441 10.1038/s41598-024-69816-3 PMC11512052 39455591 Akash S. Computational screening of novel therapeutic and potent molecules from bioactive trehalose and it’s eight derivatives by different in silico studies for the treatment of diabetes mellitus Org. Commun. 3 2022 288 296 Alera M.T. Hermann L. Tac-An I.A. Klungthong C. Rutvisuttinunt W. Manasatienkij W. Zika Virus Infection 2012 Emerging Infectious Diseases journal - CDC Philippines Volume 21, Number 4—April 2015 [cited 2025 Aug 7]; Available from: https://wwwnc.cdc.gov/eid/article/21/4/14-1707_article 10.3201/eid2104.141707 PMC4378478 25811410 Alvarez De Lauro A.E. Pelaez M.A. Marquez A.B. Wagner M.S. Scolaro L.A. García C.C. Effects of the natural flavonoid quercetin on arenavirus Junín infection Viruses. 15 8 2023 1741 37632083 10.3390/v15081741 PMC10459926 Amin M.R. Yasmin F. Hosen M.A. Dey S. Mahmud S. Saleh M.A. Synthesis, antimicrobial, anticancer, PASS, molecular docking, molecular dynamic simulations & pharmacokinetic predictions of some methyl β-D-galactopyranoside analogs Molecules. 26 22 2021 7016 34834107 10.3390/molecules26227016 PMC8621697 Andres S. Pevny S. Ziegenhagen R. Bakhiya N. Schäfer B. Hirsch-Ernst K.I. Safety aspects of the use of quercetin as a dietary supplement Mol. Nutr. Food Res. 62 1 2018 1700447 10.1002/mnfr.201700447 29127724 Asogwa F.C. Izuchukwu U.D. Louis H. Eze C.C. Ekeleme C.M. Ezugwu J.A. Synthesis, characterization and theoretical investigations on the molecular structure, electronic property and anti-trypanosomal activity of benzenesulphonamide-based carboxamide and its derivatives Polycycl. Aromat. Compd. 43 10 2023 8690 8709 Berkane A. Kundu N. Munia A.A. Chakrabarty B. Utpal B.K. Kumar N. Quercetin derivatives as potential inhibitors of Nipah virus phosphoprotein through in silico J. Indian Chem. Soc. 101 8 2024 101196 Bhowmik D. Nandi R. Prakash A. Kumar D. Evaluation of flavonoids as 2019-nCoV cell entry inhibitor through molecular docking and pharmacological analysis Heliyon. 7 3 2021 e06515 10.1016/j.heliyon.2021.e06515 PMC7955945 33748510 Bojić M. Kondža M. Rimac H. Benković G. Maleš Ž. The effect of flavonoid aglycones on the CYP1A2, CYP2A6, CYP2C8 and CYP2D6 enzymes activity Molecules. 24 17 2019 3174 31480528 10.3390/molecules24173174 PMC6749521 Borriello M. Iannuzzi C. Sirangelo I. Pinocembrin protects from AGE-induced cytotoxicity and inhibits non-enzymatic glycation in human insulin Cells 8 5 2019 385 10.3390/cells8050385 31035509 PMC6562854 Brogi S. Ramalho T.C. Kuca K. Medina-Franco J.L. Valko M. Editorial: in silico methods for drug design and discovery Front. Chem. [Internet] 2020 Aug 7 [cited 2025 Aug 7]; 8. Available from: https://www.frontiersin.org/journals/chemistry/articles/10.3389/fchem.2020.00612/full 10.3389/fchem.2020.00612 PMC7427335 32850641 Buathong R., Hermann L., Thaisomboonsuk B., Rutvisuttinunt W., Klungthong C., Chinnawirotpisan P., et al. Detection of Zika virus infection in Thailand, 2012–2014. 2015 Aug 5 [cited 2025 Aug 7]; Available from: https://www.ajtmh.org/view/journals/tpmd/93/2/article-p380.xml 10.4269/ajtmh.15-0022 PMC4530765 26101272 Burlou-Nagy C. Bănică F. Negrean R.A. Jurca T. Vicaș L.G. Marian E. Determination of the bioactive compounds from echinacea purpurea (L.) moench leaves extracts in correlation with the antimicrobial activity and the In vitro Molecules. 28 15 2023 5711 37570681 10.3390/molecules28155711 PMC10420800 Campos D.M.O. Bezerra K.S. Esmaile S.C. Fulco U.L. Albuquerque E.L. Oliveira J.I.N. Intermolecular interactions of cn-716 and acyl-KR-aldehyde dipeptide inhibitors against Zika virus Phys. Chem. Chem. Phys. 22 27 2020 15683 15695 32618974 10.1039/d0cp02254c Cao G. Ying P. Yan B. Xue W. Li K. Shi A. Pharmacokinetics, safety, and tolerability of single and multiple-doses of pinocembrin injection administered intravenously in healthy subjects J. Ethnopharmacol. 168 2015 31 36 25814318 10.1016/j.jep.2015.03.041 Cataneo A.H.D. Kuczera D. Koishi A.C. Zanluca C. Silveira G.F. de Arruda T.B. The citrus flavonoid naringenin impairs the in vitro Sci. Rep. 9 2019 16348 10.1038/s41598-019-52626-3 PMC6841724 31705028 Cataneo A.H.D. Ávila E.P. Mendes L.A.O. de Oliveira V.G. Ferraz C.R. de Almeida M.V. Flavonoids as molecules with anti-Zika virus activity Front. Microbiol. 12 2021 710359 10.3389/fmicb.2021.710359 PMC8462986 34566915 Che Omar M.T. Data analysis of molecular dynamics simulation trajectories of β-sitosterol, sonidegib and cholesterol in smoothened protein with the CHARMM36 force field Data Brief 33 2020 106350 10.1016/j.dib.2020.106350 PMC7554031 33083505 Chen X. Li H. Tian L. Li Q. Luo J. Zhang Y. Analysis of the physicochemical properties of acaricides based on Lipinski’s rule of five J. Comput. Biol. 27 9 2020 1397 1406 32031890 10.1089/cmb.2019.0323 Chen J. Harper J.B. Ho J. Improving the accuracy of quantum mechanics/molecular mechanics (QM/MM) models with polarized fragment charges J. Chem. Theory. Comput. 18 9 2022 5607 5617 35952004 10.1021/acs.jctc.2c00491 Chow M. Lambros E. Li X. Hammes-Schiffer S. Nuclear–Electronic orbital QM/MM approach: geometry optimizations and molecular dynamics J. Chem. Theory. Comput. 19 13 2023 3839 3848 37329317 10.1021/acs.jctc.3c00361 Chowdhury N. Khalid A. Turin T.C. Understanding misinformation infodemic during public health emergencies due to large-scale disease outbreaks: a rapid review Z. Gesundh. Wiss. 31 4 2023 553 573 33968601 10.1007/s10389-021-01565-3 PMC8088318 Cohen J. The race for a Zika vaccine is on Science 351 6273 2016 543 544 26912676 10.1126/science.351.6273.543 Dai L. Song J. Lu X. Deng Y.Q. Musyoki A.M. Cheng H. Structures of the Zika Virus envelope protein and its complex with a flavivirus broadly protective antibody Cell Host. Microbe 19 5 2016 696 704 10.1016/j.chom.2016.04.013 27158114 Dallakyan S. Olson A.J. Small-molecule library screening by docking with PyRx editors Hempel J.E. Williams C.H. Hong C.C. Chemical Biology: Methods and Protocols [Internet] 2015 Springer New York, NY 243 250 10.1007/978-1-4939-2269-7_19 [cited 2024 Dec 18] Available from: 25618350 Deng S.P. Yang Y.L. Cheng X.X. Li W.R. Cai J.Y. Synthesis, spectroscopic study and radical scavenging activity of kaempferol derivatives: enhanced water solubility and antioxidant activity Int. J. Mol. Sci. 20 4 2019 975 10.3390/ijms20040975 30813425 PMC6412309 Donyapour N. Niazi F.F. Roussey N. Bose S. Dickson A. Flexible topology: a new method for dynamic drug design [Internet] ChemRxiv. 2023 [cited 2024 Aug 15]. Available from: https://chemrxiv.org/engage/chemrxiv/article-details/64396b1673c6563f14d92204 Eberhardt J. Santos-Martins D. Tillack A.F. Forli S. AutoDock Vina 1.2.0: new docking methods, expanded force field, and Python bindings J. Chem. Inf. Model. 61 8 2021 3891 3898 34278794 10.1021/acs.jcim.1c00203 PMC10683950 EFSA Panel on Food Additives and Flavourings (FAF) Flavouring group evaluation 413 (FGE.413): naringenin EFSA J. 22 2 2024 e08747 10.2903/j.efsa.2024.8747 PMC11094580 38751504 Fagerholm U. Hellberg S. Alvarsson J. Ekmefjord M. Spjuth O. Comparing Lipinski’s rule of 5 and machine learning based prediction of fraction absorbed for assessing oral absorption in humans [Internet] bioRxiv. 2024 [cited 2024 Dec 17]. p. 2024.08.20.608791. Available from: https://www.biorxiv.org/content/10.1101/2024.08.20.608791v1 Frenț O.D. Ștefan L. Morgovan C.M. Duteanu N. Dejeu I.L. Marian E. A systematic review: quercetin—Secondary metabolite of the flavonol class, with multiple health benefits and low bioavailability Int. J. Mol. Sci. 25 22 2024 12091 10.3390/ijms252212091 PMC11594109 39596162 Gómez S.A. Rojas-Valencia N. Gómez S. Lans I. Restrepo A. Initial recognition and attachment of the Zika Virus to host cells: a molecular dynamics and quantum interaction approach Chembiochem. 23 21 2022 e202200351 10.1002/cbic.202200351 35951472 García Forero A. Villamizar Mantilla D.A. Núñez L.A. Ocazionez R.E. Stashenko E.E. Fuentes J.L Photoprotective and antigenotoxic effects of the flavonoids apigenin, Naringenin and Pinocembrin Photochem. Photobiol. 95 4 2019 1010 1018 30636010 10.1111/php.13085 Gece G. The use of quantum chemical methods in corrosion inhibitor studies Corros. Sci. 50 11 2008 2981 2992 Guedes I.A. Pereira da Silva M.M. Galheigo M. Krempser E. de Magalhães C.S. Correa Barbosa H.J. DockThor-VS: a free platform for receptor-Ligand virtual screening J. Mol. Biol. 436 17 2024 168548 10.1016/j.jmb.2024.168548 39237203 Habtemariam S. The Nrf2/HO-1 axis as targets for flavanones: neuroprotection by pinocembrin, naringenin, and eriodictyol Oxid. Med. Cell Longev. 2019 2019 4724920 10.1155/2019/4724920 PMC6878820 31814878 Haddow A.D. Schuh A.J. Yasuda C.Y. Kasper M.R. Heang V. Huy R. Genetic characterization of Zika virus strains: geographic expansion of the Asian lineage PLoS. Negl. Trop. Dis. 6 2 2012 e1477 22389730 10.1371/journal.pntd.0001477 PMC3289602 Hamdy R. Mostafa A. Abo Shama N.M. Soliman S.S.M. Fayed B. Comparative evaluation of flavonoids reveals the superiority and promising inhibition activity of silibinin against SARS-CoV-2 Phytother. Res. 36 7 2022 2921 2939 35596627 10.1002/ptr.7486 PMC9347486 Huang S.Q. Zhang Y.J. Wang Z.H. Xiong F. Computational discovery of SARS-CoV-2 main protease inhibitors via a virtual screening, molecular docking, molecular dynamics and MM/PBSA calculation-driven approach New. J. Chem. 48 46 2024 19650 19660 Humphrey W. Dalke A. Schulten K. VMD: visual molecular dynamics J. Mol. Graph. 14 1 1996 33 38 8744570 10.1016/0263-7855(96)00018-5 K Hussein R. Marashdeh M. El-Khayatt A.M. Molecular docking analysis of novel quercetin derivatives for combating SARS-CoV-2 Bioinformation. 19 2 2023 178 183 37814680 10.6026/97320630019178 PMC10560307 Itagaki M. Kamei N. Takeda-Morishita M. Evaluation of function and features of Human induced pluripotent stem cell-derived small intestinal epithelial cells for analyzing peptide drug intestinal absorption profiles JPharmSci 112 9 2023 2591 2595 10.1016/j.xphs.2023.05.013 37230251 Jiang J. Liu Y. Zhao Y. Wang Y. Li G. Xu H. Discovery of severe acute respiratory syndrome coronavirus 2 main protease inhibitors through rational design of novel fluorinated 1,3,4-oxadiazole amide derivatives: an in-silico study Chem. Biodivers. 22 8 2025 e202403179 10.1002/cbdv.202403179 39853882 Karjiban R.A. Rahman M.B.A. Basri M. Salleh A.B. Jacobs D. Wahab H.A. Molecular dynamics study of the structure, flexibility and dynamics of thermostable L1 lipase at high temperatures Protein J. 28 1 2009 14 23 10.1007/s10930-008-9159-7 19130194 Karrouchi K. Celik I. Fettach S. Karthick T. Bougrin K. Radi S. Synthesis and investigations of reactive properties, photophysical properties and biological activities of a pyrazole-triazole hybrid molecule J. Mol. Struct. 1265 2022 133363 Kawsar M.A.A. Kumer A. Hosen M.A. Akash S. Rahman M. Khan M.F. Chemical descriptors, PASS, molecular docking, molecular dynamics and ADMET predictions of glucopyranoside derivatives as inhibitors to bacteria and fungi growth Org. Commun. 15 2 2022 1 20 10.25135/acg.oc.122.2203.2397 Kawsar S.M.A. MdA Hossain Saha S. Abdallah E.M. Bhat A.R. Ahmed S. Nucleoside-based drug target with general antimicrobial screening and specific computational studies against SARS-CoV-2 main protease ChemistrySelect. 9 15 2024 e202304774 Kerna N.A. Ngwu D.C. Akuma O.M. Holets H.M. Chawla S. Flores J.V. Quercetin: exploring its unique flavonol properties, bioavailability, safety profile, and therapeutic potential in high-impact medical conditions Eur. J. Med. Health Res. 2 3 2024 178 198 Kim J.A. Seong R.K. Kumar M. Shin O.S. Favipiravir and ribavirin inhibit replication of Asian and African strains of Zika virus in different cell models Viruses. 10 2 2018 72 10.3390/v10020072 29425176 PMC5850379 Kondža M. Brizić I. Jokić S. Flavonoids as CYP3A4 inhibitors In vitro Biomedicines. 12 3 2024 644 38540257 10.3390/biomedicines12030644 PMC10968035 Kondo S. Miyake M. Simultaneous prediction method for intestinal absorption and metabolism using the mini-ussing chamber system Pharmaceutics. 15 12 2023 2732 38140073 10.3390/pharmaceutics15122732 PMC10747201 Kumer Ajoy Modified D-glucofuranose computationally screening for inhibitor of breast cancer and triple breast cancer: Chemical descriptor, molecular docking, molecular dynamics and QSAR J. Chilean Chem. Soc. 67 3 2022 5623 5635 López-Blanco J.R. Aliaga J.I. Quintana-Ortí E.S. Chacón P. iMODS: internal coordinates normal mode analysis server Nucleic. Acids. Res. 42 2014 W271 W276 24771341 10.1093/nar/gku339 PMC4086069 Li Z. Cao H. Cheng Y. Zhang X. Zeng W. Sun Y. Inhibition of porcine epidemic diarrhea virus replication and viral 3C-like protease by quercetin Int. J. Mol. Sci. 21 21 2020 8095 33142980 10.3390/ijms21218095 PMC7662296 Lin H.C. Chiu W.A. Development of physiologically based gut absorption model for probabilistic prediction of environmental chemical bioavailability ALTEX. 40 3 2023 361 376 10.14573/altex.2210031 PMC10898273 37158362 Lindorff-Larsen K. Piana S. Palmo K. Maragakis P. Klepeis J.L. Dror R.O. Improved side-chain torsion potentials for the Amber ff99SB protein force field Proteins 78 8 2010 1950 1958 20408171 10.1002/prot.22711 PMC2970904 Lohit N. Singh A.K. Kumar A. Singh H. Yadav J.P. Singh K. Description and In silico ADME studies of US-FDA approved drugs or drugs under clinical trial which violate the Lipinski’s rule of 5 Lett. Drug Des. Discov. 21 8 2025 1334 1358 Mahmud A.R. Ema T.I. Siddiquee M.F.R. Shahriar A. Ahmed H. Md M.-U.-H. Natural flavonols: actions, mechanisms, and potential therapeutic utility for various diseases Beni-Suef Univ. J. Basic Appl. Sci. 12 1 2023 47 37216013 10.1186/s43088-023-00387-4 PMC10183303 Marcondes C.B. Ximenes M.D.F.F.D.M. Zika virus in Brazil and the danger of infestation by Aedes (Stegomyia) Rev. Soc. Bras. Med. Trop. 49 2015 4 10 26689277 10.1590/0037-8682-0220-2015 Morimoto R. Matsubara C. Hanada A. Omoe Y. Ogata T. Isegawa Y. Effect of structural differences in naringenin, prenylated naringenin, and their derivatives on the anti-influenza virus activity and cellular uptake of their flavanones Pharmaceuticals. (Basel) 15 12 2022 1480 10.3390/ph15121480 36558931 PMC9785311 Moroy G. Martiny V.Y. Vayer P. Villoutreix B.O. Miteva M.A. Toward in silico structure-based ADMET prediction in drug discovery Drug Discov. Today 17 1–2 2012 44 55 22056716 10.1016/j.drudis.2011.10.023 Mukai R. Okuyama H. Uchimura M. Sakao K. Matsuhiro M. Ikeda-Imafuku M. The binding selectivity of quercetin and its structure-related polyphenols to human serum albumin using a fluorescent dye cocktail for multiplex drug-site mapping Bioorg. Chem. 145 2024 107184 10.1016/j.bioorg.2024.107184 38364549 Murray J.S. Sen K. editors 1st ed. Molecular Electrostatic potentials: Concepts and Applications 3 1996 Elsevier Science Amsterdam 443 10.1016/S1383-7303 (96)80079-4 ISBN: 9780444823533 Musso D. Gubler D.J. Zika virus Clin. Microbiol. Rev. 29 3 2016 487 524 10.1128/CMR.00072-15 27029595 PMC4861986 Najmi A. Javed S.A. Al Bratty M. Alhazmi H.A Modern approaches in the discovery and development of plant-based natural products and their analogues as potential therapeutic agents Molecules. 27 2 2022 349 10.3390/molecules27020349 35056662 PMC8779633 Navrátilová L. Ramos Mandíková J. Pávek P. Mladěnka P. Trejtnar F. Honey flavonoids inhibit hOATP2B1 and hOATP1A2 transporters and hOATP-mediated rosuvastatin cell uptake in vitro Xenobiotica 48 7 2018 745 755 28745105 10.1080/00498254.2017.1358469 Ozawa M. Ozawa T. Nishio M. Ueda K. The role of CH/π interactions in the high affinity binding of streptavidin and biotin J. Mol. Graph. Model. 75 2017 117 124 28551501 10.1016/j.jmgm.2017.05.002 Pardridge W.M. Drug transport across the blood-brain barrier J. Cereb. Blood Flow Metab. 32 11 2012 1959 1972 22929442 10.1038/jcbfm.2012.126 PMC3494002 Pereira R.S. Santos F.C.P. Campana P.R.V. Costa V.V. de Pádua R.M. Souza D.G. Natural products and derivatives as potential Zika virus inhibitors: a comprehensive review Viruses. 15 5 2023 1211 37243296 10.3390/v15051211 PMC10222392 Pires D.E.V. Blundell T.L. Ascher D.B. pkCSM: predicting small-molecule pharmacokinetic and toxicity properties using graph-based signatures J. Med. Chem. 58 9 2015 4066 4072 10.1021/acs.jmedchem.5b00104 25860834 PMC4434528 Plourde A.R. Bloch E.M. A literature review of Zika Virus Emerg. Infect. Dis. 22 7 2016 1185 1192 27070380 10.3201/eid2207.151990 PMC4918175 Quantum Calculation Docking, ADMET and molecular dynamics of ketal and non-ketal forms of D-glucofuranose against bacteria, black & white fungus, and triple-negative breast cancer Biointerface Res. Appl. Chem. 13 4 2022 374 Retallack H. Di Lullo E. Arias C. Knopp K.A. Laurie M.T. Sandoval-Espinosa C. Zika virus cell tropism in the developing human brain and inhibition by azithromycin Proc. Natl. Acad. Sci. U. S. A. 113 50 2016 14408 14413 10.1073/pnas.1618029113 27911847 PMC5167169 Retallack H. Di Lullo E. Arias C. Knopp K.A. Laurie M.T. Sandoval-Espinosa C. Zika virus cell tropism in the developing human brain and inhibition by azithromycin Proc. Natl. Acad. Sci. U. S. A. 113 50 2016 14408 14413 10.1073/pnas.1618029113 27911847 PMC5167169 Roy A. Liu Q. Yang Y. Debnath A.K. Du L. Envelope protein-targeting Zika virus entry inhibitors Int. J. Mol. Sci. 25 17 2024 9424 39273370 10.3390/ijms25179424 PMC11394925 Rupa S.A. Moni M.R. Patwary M.A.M. Mahmud M.M. Haque M.A. Uddin J. Synthesis of novel tritopic hydrazone ligands: spectroscopy, biological activity, DFT, and molecular docking studies Molecules. 27 5 2022 1656 35268756 10.3390/molecules27051656 PMC8911750 Saivish M.V. Menezes G. de L. da Silva R.A. Fontoura M.A. Shimizu J.F. da Silva G.C.D. Antiviral activity of quercetin hydrate against Zika virus Int. J. Mol. Sci. 24 8 2023 7504 37108665 10.3390/ijms24087504 PMC10144977 Šarić Mustapić D. Debeljak Ž. Maleš Ž. Bojić M. The inhibitory effect of flavonoid aglycones on the metabolic activity of CYP3A4 enzyme Molecules. 23 10 2018 2553 30301254 10.3390/molecules23102553 PMC6222669 Sayre C.L. Takemoto J.K. Martinez S.E. Davies N.M. Chiral analytical method development and application to pre-clinical pharmacokinetics of pinocembrin Biomed. Chromatogr. 27 6 2013 681 684 23212747 10.1002/bmc.2853 Senn H.M. Thiel W. QM/MM methods for biomolecular systems Angewandte Chemie Int. Ed. 48 7 2009 1198 1229 10.1002/anie.200802019 19173328 Seo S. Choi J. Park S. Ahn J. Binding affinity prediction for protein-ligand complex using deep attention mechanism based on intermolecular interactions [Internet] bioRxiv. 2021 [cited 2024 Dec 17]. p. 2021.03.18.436020. Available from: https://www.biorxiv.org/content/10.1101/2021.03.18.436020v1 10.1186/s12859-021-04466-0 PMC8576937 34749664 Shamim S. Akhtar M. Gul S. Novel designed analogues of quercetin against SARS-CoV2:an in-silico pharmacokinetic evaluation, molecular modeling, MD simulations based study J. Biomol. Struct. Dyn. 42 21 2024 11773 11791 37798928 10.1080/07391102.2023.2265469 Shaw S. Chourasia M. Nayak R. Kumeria T. Ghosh M.P. Santoshi S. Molecular interaction of quercetin and its derivatives against nucleolin in breast cancer: in-silico and in-vitro study J. Biomol. Struct. Dyn. 0 0 2025 1 12 10.1080/07391102.2024.2326668 38468538 Shragai T. Tesla B. Murdock C.C. Harrington L.C. Zika and chikungunya: mosquito-borne viruses in a changing world Ann. N. Y. Acad. Sci. 1399 1 2017 61 77 10.1111/nyas.13306 28187236 Shukla R. Tripathi T. Molecular dynamics simulation of protein and protein–Ligand complexes editor Singh D.B. Computer-Aided Drug Design [Internet] 2020 Springer Singapore 133 161 10.1007/978-981-15-6815-2_7 [cited 2025 Aug 8] Streu K. Structure, thermodynamics, and Dynamical Properties of Nucleic acids, proteins, and Glass-Forming Liquids [dissertation] 2003 Boston College Boston (MA) 241 Available from: https://core.ac.uk/download/pdf/151480633.pdf Tama F. Sanejouand Y.H. Conformational change of proteins arising from normal mode calculations Protein Eng., Des. Select. 14 1 2001 1 6 10.1093/protein/14.1.1 11287673 Terefe E.M. Ghosh A. Molecular docking, validation, dynamics simulations, and pharmacokinetic prediction of phytochemicals isolated from Croton dichogamus Evol. Bioinform. Online 18 2022 11779322221125605 10.1177/11779322221125605 PMC9516429 36185760 Thanikaivelan P. Subramanian V. Raghava Rao J. Unni Nair B. Application of quantum chemical descriptor in quantitative structure activity and structure property relationship Chem. Phys. Lett. 323 1 2000 59 70 Thomas S.J. L’Azou M. Barrett A.D.T. Jackson N.A.C. Fast-track Zika vaccine development — is it possible? N. Engl. J. Med. 375 13 2016 1212 1216 27682032 10.1056/NEJMp1609300 Toigo L. Dos Santos Teodoro E.I. Guidi A.C. Gancedo N.C. Petruco M.V. Melo E.B. Flavonoid as possible therapeutic targets against COVID-19: a scoping review of in silico studies Daru 31 1 2023 51 68 37195402 10.1007/s40199-023-00461-3 PMC10191091 Tréguier Y. Cochard J. Burlaud-Gaillard J. Lemoine R. Chouteau P. Roingeard P. The envelope protein of Zika virus interacts with apolipoprotein E early in the infectious cycle and this interaction is conserved on the secreted viral particles Virol. J. 19 1 2022 124 35902969 10.1186/s12985-022-01860-9 PMC9331583 Tu B. Liu Z.J. Chen Z.F. Ouyang Y. Hu Y.J. Understanding the structure–activity relationship between quercetin and naringenin: in vitro RSC. Adv. 5 128 2015 106171 106181 Valdés-Tresanco M.S. Valdés-Tresanco M.E. Valiente P.A. Moreno E. gmx_MMPBSA: a new tool to perform end-state free energy calculations with GROMACS J. Chem. Theory. Comput. 17 10 2021 6281 6291 10.1021/acs.jctc.1c00645 34586825 Walters W.P. Going further than Lipinski’s rule in drug design Expert Opin. Drug Discov. 7 2 2012 99 107 22468912 10.1517/17460441.2012.648612 Wang X. Shen Y. Wang S. Li S. Zhang W. Liu X. PharmMapper 2017 update: a web server for potential drug target identification with a comprehensive target pharmacophore database Nucl. Acids. Res. 45 W1 2017 W356 W360 28472422 10.1093/nar/gkx374 PMC5793840 Wang E. Sun H. Wang J. Wang Z. Liu H. Zhang J.Z.H. End-point binding free energy calculation with MM/PBSA and MM/GBSA: strategies and applications in drug design Chem. Rev. 119 16 2019 9478 9508 31244000 10.1021/acs.chemrev.9b00055 Wang Y. Tao B. Wan Y. Sun Y. Wang L. Sun J. Drug delivery based pharmacological enhancement and current insights of quercetin with therapeutic potential against oral diseases Biomed. Pharmacother. 128 2020 110372 10.1016/j.biopha.2020.110372 32521458 Weaver S.C. Costa F. Garcia-Blanco M.A. Ko A.I. Ribeiro G.S. Saade G. Zika virus: history, emergence, biology, and prospects for control Antiviral Res. 130 2016 69 80 26996139 10.1016/j.antiviral.2016.03.010 PMC4851879 Xiong F. Zhang Y.J. Jiang H.Y. Wang Z.H. Exploring the efficacy of noncovalent SARS-CoV-2 main protease inhibitors: a computational simulation analysis study Chem. Biodivers. 21 5 2024 e202302089 10.1002/cbdv.202302089 38526531 Yuan S. Chan H.C.S. Hu Z. Using PyMOL as a platform for computational drug design WIREs Comput. Mol. Sci. 7 2 2017 e1298 Zhang S.Y. Ong W.S.Y. Subelzu N. Gleeson J.P. Validation of a Caco-2 microfluidic chip model for predicting intestinal absorption of BCS class I–IV drugs Int. J. Pharm. 651 2024 124089 10.1016/j.ijpharm.2024.124089 38599444 Zhang H. Zhang J. Zhang H.X. Effect of quercetin on the protein-substrate interactions in SIRT6: insight from MD simulations J. Mol. Graph. Model. 130 2024 108778 10.1016/j.jmgm.2024.108778 38652998 M.J. Ziegler. Molecular dynamics simulations of lipid bilayers in megavolt per meter electric fields. 2008. Appendix Supplementary materials  Image, application 1 Data availability Data will be made available on request. Acknowledgement The authors extend their appreciation to the Deanship of Research and Graduate Studies at King Khalid University for funding this work through Large Research Project under grant number RGP2/363/46. We thank to the High-Performance Processing Nucleus NPAD UFRN CAPES CNPQ Supplementary material associated with this article can be found, in the online version, at doi:10.1016/j.virusres.2025.199630 ",
  "metadata": {
    "Title of this paper": "Effect of quercetin on the protein-substrate interactions in SIRT6: insight from MD simulations",
    "Journal it was published in:": "Virus Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481941/"
  }
}