{
  "title": "Paper_538",
  "abstract": "Sci Transl Med Sci Transl Med 319 nihpa Science translational medicine 1946-6234 1946-6242 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12478711 PMC12478711.1 12478711 12478711 NIHMS2107001 40737434 10.1126/scitranslmed.ady6831 NIHMS2107001 NIHPA2107001 1 Article Vaccination with mRNA-encoded membrane-anchored HIV envelope trimers elicited tier 2 neutralizing antibodies in a phase 1 clinical trial Parks K. Rachael 1 Moodie Zoe 1 Allen Mary A. 2 Yen Catherine 2 Furch Briana D. 1 MacPhee Kellie J. 1 Ozorowski Gabriel 3 Heptinstall Jack 4 Hahn William O. 1 5 Zheng Zihan 1 Lu Huiyin 1 Grant Shannon 1 Domin Elize 6 Duff Michael O. 1 Seese Aaron 1 Marini-Macouzet Constanza 1 Ballweber-Fleming Lamar 1 Lee Wen-Hsin 3 Cottrell Christopher A. 7 8 Liguori Alessia 7 8 9 Georgeson Erik 7 8 9 Alavi Nushin 7 8 9 Kubitz Michael 7 8 9 Phelps Nicole 7 8 9 Seaton Kelly E. 4 Cohen Kristen W. 10 Anderson Maija A. 1 Mondal Kajari 1 Laufer Dagna S. 11 Kublin James G. 1 Ward Andrew B. 3 Hyrien Ollivier 1 12 De Rosa Stephen C. 1 13 Himansu Sunny 11 Leav Brett 10 Reuter Caroline 10 Tomaras Georgia D. 4 Montefiori David 6 Walsh Stephen R. 14 Frank Ian 15 Sobieszczyk Magdalena E. 16 Goepfert Paul A. 17 Stephenson Kathryn E. 18 Baden Lindsey R. 14 Van Tieu Hong 19 Keefer Michael C. 20 Clark Jesse 21 Riddler Sharon A. 22 Schief William R. 7 8 9 10 * McElrath M. Juliana 1 5 * 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 Author Contributions: WRS conceived the trial concept and basic design and obtained funding for production of the vaccine products. ZM, CY, BDF, KM, JC, SR, GDT, KWC, and WS designed the clinical protocol. LRB, JC, IF, PAG, SAR, KES, MES, HVT, SRW, and MJM recruited participants, collected clinical specimens and generated clinical data. SH provided clinical trial material. LRB, JC, BF, IF, PAG, WOH, BL, DSL, CR, SR, KES, MES, HVT, SRW, MJM, and CY monitored safety. MJM provided oversight of the HVTN laboratory studies. CAC designed disulfide-stabilized trimer for EMPEM, baseKO trimer for BAMA and sorting, and internal epitope constructs for BAMA. AL carried out and CAC interpreted SPR analyses. EG, NA, MK, and NP produced trimers for BAMA, B cell sorting, EMPEM, and SPR under supervision of CAC. GO, W-HL, and ABW generated and analyzed nsEM and EMPEM data. JH, KES, and GDT generated, curated, and evaluated binding antibody BAMA data. JH, ED, GDT, and DCM generated antibody data. LAC, SDR, and MJM generated CD4 and CD8 T cell data. KRP, KM, AS, CMM, LFB, MD, MJM, and OH generated B cell phenotyping, B cell receptor sequencing and analysis, and performed monoclonal antibody generation and evaluation. HL, SG, and ZM performed statistical and data analysis. KRP, ZM, CY, KM, WOH, BDF, KWC, and WRS drafted the initial manuscript. In accordance with ICMJE guidelines, all authors provided guidance and helped with revisions and provided final approval for it to be published. * Competing interests: 30 7 2025 30 7 2025 17 809 497744 eady6831 eady6831 21 09 2025 29 09 2025 30 09 2025 30 09 2025 mRNA technology might accelerate development of an urgently needed preventive human immunodeficiency virus (HIV) vaccine. We evaluated the safety and immunogenicity of three mRNA-encoded envelope trimers, including two doses of soluble and membrane-anchored forms, in a randomized, open-label, phase 1 clinical trial. Vaccines were generally well-tolerated, although 6.5% (7/108) of participants developed urticaria, a higher proportion than seen with other mRNA vaccines. mRNA-encoded trimers induced strong envelope-specific B and T cell responses. Immunization with membrane-anchored trimers, intended to obscure epitopes at the trimer base targeted by non-neutralizing antibodies, reduced the frequency of base-binding serum antibodies in comparison with soluble trimers. Three immunizations elicited autologous tier 2 serum neutralizing antibodies in 80% of vaccinees receiving the membrane-anchored trimers, in contrast to only 4% receiving the soluble trimer. Thus, with demonstration of more favorable safety, mRNA-encoded membrane-anchored HIV envelope trimers represent a promising platform for HIV vaccine clinical development. One-Sentence Summary: Membrane-anchored HIV envelope trimer mRNA vaccines elicited high response rates of serum autologous tier 2 neutralizing antibodies in humans. Editor’s Summary: A Better Immunogen for HIV. Vaccines for human immunodeficiency virus (HIV) usually target the envelope (Env) trimer that is present on the surface of virions. However, protein-based vaccines require the Env trimer be soluble; this creates a site at the base of the Env for antibodies to bind that’s unable to confer protection against infection. In two papers, Ramezani-Rad and Cottrell et al. et al. et al. et al. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Vaccination with mRNA-encoded membrane-anchored HIV envelope trimers elicited tier 2 neutralizing antibodies in a phase 1 clinical trial",
    "Journal it was published in:": "Science translational medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478711/"
  }
}