{
  "title": "Paper_122",
  "abstract": "pmc Nanomedicine (Lond) Nanomedicine (Lond) 3032 nanomed Nanomedicine 1743-5889 1748-6963 Taylor & Francis PMC12490393 PMC12490393.1 12490393 12490393 40782045 10.1080/17435889.2025.2544522 2544522 1 Version of Record Research Article Research Article Storage stability of cowpea mosaic virus cancer drug candidate – a two-year update A. SIMMS ET AL. NANOMEDICINE Simms Andrea  a  b  c  d Minasov Narek  a  b  c  d Steinmetz Nicole F.  a  b  c  d  e  f  g  h a University of California San Diego CA USA b University of California San Diego CA USA c University of California San Diego CA USA d University of California San Diego CA USA e University of California San Diego CA USA f University of California San Diego CA USA g University of California San Diego CA USA h University of California San Diego CA USA CONTACT Nicole F. Steinmetz nsteinmetz@ucsd.edu San Diego, La Jolla CA 92093 USA 9 8 2025 2025 20 19 498195 2425 2431 09 08 2025 03 10 2025 03 10 2025 Integra 12 9 2025 Integra 12 9 2025 15 5 2025 04 8 2025 © 2025 The Author(s). Published by Informa UK Limited, trading as Taylor & Francis Group. 2025 The Author(s) https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution-NonCommercial-NoDerivatives License ( http://creativecommons.org/licenses/by-nc-nd/4.0/ ABSTRACT Aim To evaluate the structural stability and biological activity of cowpea mosaic virus (CPMV) after 2 years of storage. Materials and methods CPMV was stored at room temperature (RT), 4°C, and −20°C for 2 years. Structural stability was assayed using dynamic light scattering (DLS), size exclusion chromatography (SEC), native and denaturing gel electrophoresis, and transmission electron microscopy (TEM). Biological activity was assessed by anti-tumor efficacy studies using a B16F10 dermal mouse melanoma model and by a cowpea plant infection challenge. Results Storage at −20°C preserved CPMV’s structural properties and biological activity. Storage at 4°C caused aggregation, S-protein cleavage, and RNA degradation – samples stored at 4°C had decreased anti-tumor efficacy yet retained plant infectivity. CPMV stored at RT was degraded and lost biological activity. Conclusion Frozen storage allows CPMV to maintain structural and biological stability for at least 2 years. KEYWORDS Cowpea mosaic virus intratumoral immunotherapy cancer immunotherapy storage stability translational drug development National Institutes of Health (NIH) R01 CA274640 R01 CA224605 R01 CA253615 American Cancer Society and F.M. Kirby Foundation Inc. Mission Boost Grant MBGI-23-1030244-01-MBG UCSD-CMM-EM Core UCSD-CMM-EM Core National Institutes of Health (NIH) #S10OD023527 This work was supported in part by the National Institutes of Health (NIH) [R01 CA274640, R01 CA224605, R01 CA253615] as well as the American Cancer Society and F.M. Kirby Foundation Inc. Mission Boost Grant, [MBGI-23-1030244-01-MBG]. Molecular graphics and analyses were performed with UCSF Chimera, developed by the Resource for Biocomputing, Visualization, and Informatics at the University of California, San Francisco, with support from NIH [P41-GM103311]. The authors would like to thank the University of California, San Diego– Cellular and Molecular Medicine Electron Microscopy Core (UCSD-CMM-EM Core, RRID:SCR_022039) for equipment access and technical assistance. The UCSD-CMM-EM Core is supported in part by the National Institutes of Health (NIH) Award [#S10OD023527]. The funders had no role in the study design, data collection and analysis, decision to publish, or preparation of the manuscript. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Plant viruses and virus-like particles (VLPs) produced in plants are a new class of therapeutics with several candidates in the pipeline. Examples include engineered tobacco mosaic virus (TMV) [ 1 2 3 4 5 6 7–9 10–12 Storage stability is a critical consideration in the clinical development of biologics, as there are additional considerations than for small-molecule drugs, which typically are more stable at room temperature and for which chemical degradation is the primary concern. Biologics, on the other hand, also experience structural degradation, meaning proteins can unfold and aggregate, which impacts the safety and efficacy of the drug [ 13 14 Our group has previously published an evaluation of CPMV’s stability in multiple storage conditions, where we found that frozen storage (−20°C or colder) maintained structural stability and biological activity for up to 9 months (biological activity, though not structural characterization, was also confirmed upon 12 months of storage) [ 15 16 17 2. Materials and methods 2.1. CPMV production, extended storage, and physicochemical characterization CPMV virions were purified from infected black-eyed pea plants ( Vigna unguiculata 15 18 15 Characterization after 2 years was carried out by first diluting aliquots to 1 mg/mL using 0.1 M KP buffer pH 7.0 then analyzing by UV–Vis spectroscopy, DLS, SEC, TEM, and native agarose gel as previously described [ 15 SDS-PAGE was conducted using a different type of pre-cast gel than in the previous work (we found that the 12% gels with wedge-shaped wells used here provided higher resolution of the cleaved vs. uncleaved S protein, see under Results & Discussion). CPMV (20 µL of 1 mg/mL) was mixed with 10 µL 4x lithium dodecyl sulfate buffer (Life Technologies, Carlsbad, CA, USA), 6 µL 0.1 M KP buffer pH 7.0, and 4 µL 10x NuPAGE reducing agent (Invitrogen, Waltham, MA, USA), then heated at 95°C for 10 min. 10 µL ladder (SeeBlue Plus2 Pre-stained Protein Standard, Invitrogen) and 20 µL each CPMV sample were added to a Bolt 12% Bis-Tris Plus Wedgewell protein gel (Thermo Fisher Scientific, Waltham, MA, USA) and run at 200 V, 120 mA, and 25 W for 45 min in 1x NuPAGE MOPS running buffer (Invitrogen). GelCode TM 2.2. CPMV infection challenge using Black-eyed pea No. 5 plants Black-eyed pea No. 5 seeds were planted three per pot in PRO-MIX BX soil with Biofungicide and Mycorrhizae (Walmart Inc., Bentonville, AR, USA), then watered every other day until plants had grown sufficiently for infection, i.e., primary leaves were developed, and trifoliates began development (~7 days post-planting). Primary leaves were mechanically inoculated with fresh CPMV or CPMV stored at RT, 4°C, or −20°C for 2 years as previously described; nine pots were assigned per CPMV group [ 18 2.3. CPMV intratumoral treatment study using a B16F10 tumor model B16F10 murine melanoma cells (ATCC CRL-6475, Manassas, VA, USA) were grown in tissue culture-treated flasks using Dulbecco’s Modified Eagle Medium (DMEM) + 4.5 g/L glucose and L-glutamine (Corning, Glendale, AZ, USA) supplemented with 1% (w/v) penicillin–streptomycin (Cytiva, Marlborough, MA, USA) and 10% (v/v) fetal bovine serum (FBS, R&D Systems, Minneapolis, MN, USA). Cells were cultured in a 37°C/5% CO 2 6 Female mice aged 6 weeks old were purchased from Charles River Laboratories and had unlimited access to food and water. Mouse study was performed under protocol S18021 and according to guidelines set by the UCSD Institutional Animal Care and Use Committee (IACUC). Mice were injected intradermally on day 0 with 2 × 10 5 6 lx w 2 2 Mice were treated with 20 µL sterile PBS or 100 µg fresh CPMV or CPMV stored at 4°C or −20°C (20 µL of 5 mg/mL CPMV) when tumors reached ~30 mm 3 3 3 3. Results 3.1. Structural stability of CPMV upon 2 years of storage at different temperatures CPMV was purified from infected black-eyed pea plant leaves and fully characterized (Figure S1) to confirm structural integrity and purity prior to being aliquoted and stored at RT, 4°C, and −20°C for 24 months (2 years). CPMV stored for 2 years was then structurally characterized by UV–Vis spectroscopy, dynamic light scattering (DLS), size exclusion chromatography (SEC), transmission electron microscopy (TEM), SDS-PAGE, and native agarose gel electrophoresis ( Figure 1) Figure 1. Characterization of fresh CPMV or CPMV after 2 years of storage at room temperature (RT), 4°C, or − 20°C. CPMV was analyzed by dynamic light scattering (DLS) (n = 3 runs) (A) Size exclusion chromatography (SEC) (B) Transmission electron microscopy (TEM) (C) SDS-PAGE (D) or native agarose gel electrophoresis (E) In DLS and SEC graphs, values marked in green indicate particles within acceptable ranges and red indicates values out of acceptable range. UV–Vis spectroscopy is employed to measure CPMV concentration (using Beer’s Law and extinction coefficient ε = 8.1 mL mg −1 −1 19 DLS, SEC, and TEM are used to assay CPMV size, aggregation, and physical degradation. In DLS, CPMV typically measures ~30 nm in diameter and is highly monodisperse. Fresh CPMV measured 31.48 ± 0.70 nm with a polydispersity index (PDI) of 0.020. RT-stored CPMV is presented as highly aggregated with an average size of 748.20 ± 94.25 nm and PDI = 0.156 ( Figure 1(A) Figure 1(B) Figure 1(C) In denaturing gel electrophoresis (SDS-PAGE), fresh preparations of CPMV and those stored at −20°C present with a single band at 42 kDa for the large (L) coat protein (CP) and two bands at ~24 kDa for the small (S) protein, Figure 1(E) 20 21 15 To evaluate the RNA integrity further, we extracted nucleic acids from fresh, 4°C, and −20°C CPMV and then analyzed the RNA using native agarose gel electrophoresis (Figure S3). Analyzing fresh and −20°C CPMV, the bipartite genome was detectable as two distinct RNA bands at 6.0 and 3.5 knots representing ssRNA-1 and ssRNA-2, respectively. In contrast, RNA from 4°C-stored CPMV appeared smeared at smaller sizes, which is consistent with RNA release and degradation. 3.2. Biological activity: plant infection and antitumor efficacy of CPMV upon 2 years of storage at different temperatures We used two assays to determine CPMV’s biological activity: a plant infection assay (plant virus’s natural function) and testing of antitumor efficacy using a solid tumor model (intended application). First, fresh preparations of CPMV or CPMV stored at RT, 4°C, or −20°C for 2 years (all at 0.1 mg/mL) were manually inoculated onto the primary leaves of 1-week-old carborundum-coated black-eyed pea No. 5 plants. Leaves were collected after 14 days and photographed to qualitatively examine the infection. By visual inspection, fresh, 4°C, and −20°C CPMV caused plant infection yielding the typical yellow, mottling spots on the primary leaves. CPMV maintained at RT for 2 years was no longer infectious toward the plants. To assess biological activity for the intended application as an intratumoral immunotherapy, CPMV stored at 4°C and −20°C was tested against fresh CPMV preparations. The samples that were stored at RT for 2 years were not considered for safety reasons, as the CPMV particles appear aggregated and lost structural integrity. A dermal B16F10 murine melanoma model was used: 200,000 B16F10 cells were injected intradermally on day 0, then 100 µg of fresh, 4°C, or −20°C-stored CPMV was injected intratumorally on days 8, 15, and 22 (weekly). CPMV stored at −20°C maintained its anti-tumor potency, with tumor growth curves matching those of animals treated with fresh CPMV preparations; in stark contrast, samples stored at 4°C had lost their activity (with tumor growth curves being comparable to PBS-treated controls). Statistical significance was achieved by day 15 with fresh or −20°C-stored CPMV significantly delaying tumor growth vs. the PBS control group (p < 0.0001 and p = 0.0017, respectively) ( Figure 2 Figure 2. Biological activity of CPMV after 2 years of storage. (A) CPMV (fresh, RT, 4°C, or − 20°C) was mechanically inoculated in black-eyed pea leaves and infection was allowed to proceed for 14 days (n = 31–40 individually infected leaves per group). Infection is indicated by a mosaic of yellow spots. (B–C) female C57BL6 mice were inoculated intradermally with 200,000 B16F10 cells on day 0; then, mice were treated intratumorally starting on day 8 with 100 µg of fresh, RT, 4°C, or − 20°C CPMV (n = 10 per group). Mice received treatments weekly for a total of three treatments. Panel (B) shows overall tumor growth (left) and survival (right), with growth curves ending when there are fewer than three mice alive in any given group. Panel (C) shows individual mouse tumor growth. Mice were euthanized when tumors reached 1000 mm 3 Regarding overall survival, there was no difference between PBS (median survival of 15 days) and 4°C-stored CPMV-treated mice (median survival of 16 days, p = 0.9068), but there was a significant difference compared to fresh (median survival of 22 days) and −20°C-stored CPMV (median survival of 21.5 days, p = 0.0108 and 0.0340, respectively), Figure 2(B) 4. Discussion In our previous study, we showed that CPMV was structurally stable and efficacious after 9 months of storage in frozen conditions (−20°C or colder). CPMV stored at 4°C appeared structurally intact yet had batch-dependent variable efficacy after 6–9 months, and CPMV stored at warmer temperatures was neither intact nor effective prior to 6 months [ 15 4.1. Structural stability of CPMV is maintained when samples are frozen Structural analysis via UV–Vis spectrometry, DLS, SEC, and TEM of CPMV stored for 2 years at different temperatures indicated that samples stored at 4°C and −20°C still appeared intact by SEC, DLS, and TEM (A260/280 between 1.7 and 1.8 in UV–Vis and SEC, elution peaks the same as fresh CPMV by SEC, and sized around 30 nm by DLS and TEM). Nevertheless, subtle changes were apparent such as some evidence of aggregation (likely degradation of the CPs) in both 4°C and −20°C samples, as indicated by increased PDI (= 0.274 for 4°C and 0.156 for −20°C vs. 0.020 for freshly prepared CPMV) and minor additional peaks in SEC (7.9% and 6.6% of total peak area for 4°C and −20°C, respectively), with the effect being more pronounced for CPMV stored at 4°C than −20°C. In stark contrast, it was evident that CPMV stored at RT was degraded with A260/280 >1.8 and high intensity peaks at 20 mL (vs. 11–12 mL for intact CPMV) in the SEC elution profile (75.4% of total peak area was not the primary CPMV peak), indicative of broken, disassembled, or denatured particles and proteins. Only a few RT-stored CPMV particles could be imaged; it was challenging to find intact CPMV on TEM grids, which also correlated with significant aggregation observed in DLS (average diameter ~750 nm by DLS) and degradation observed by SEC. Electrophoretic patterns via SDS-PAGE (denatured CPs) and native agarose (intact nucleoprotein assemblies) gel electrophoresis gave insights into protein and/or RNA degradation. Frozen CPMV (−20°C) matched the electrophoretic pattern to that of fresh CPMV preparations. While overall refrigerated CPMV (4°C) appeared mostly intact, a key differentiator was the state of the S protein: there is heterogeneity in the S protein due to autoproteolytic cleavage leading to loss of the 24 C-terminal amino acids of S [ 20 21 In addition to the distinct cleavage state of the 4°C-stored CPMV samples, differences in RNA integrity were observed. While native gels indicate that the nucleoprotein assemblies remain intact when stored at −20°C and 4°C with RNA and protein co-migrating, staining of the RNA for the samples stored at 4°C was more intense. This may indicate that the CPMV samples with cleaved S protein are more porous allowing more stains to penetrate the particles. In contrast, samples stored at RT lost their RNA due to structural instability. Interestingly, when RNA was extracted from CPMV particles stored under various conditions, data indicate that the bipartite genome remained intact for samples stored at −20°C, showing the characteristic 6 and 3.5 knts RNA-1 and RNA-2; however, the RNA isolated from CPMV stored at 4°C appeared degraded. Thus, while data indicate that the RNA remained inside the capsid, CPMV with cleaved S (as a result of prolonged storage at 4°C) appears less stable as the RNA genome is more prone to degradation. Overall, aside from the minor aggregation observed in the CPMV samples stored at −20°C, these structural characterization results correlate well with the previous data following 6 and 9 months of RT and frozen storage. While the protein components of 4°C-stored CPMV appear structurally sound (though minimally aggregated), the S protein is cleaved leading to RNA instability. 4.2. Biological activity is maintained when CPMV is frozen As a first biological activity assay, we tested whether CPMV samples stored long term remained infectious toward black-eyed pea No. 5 plants. CPMV infection presents as yellow, mosaic-patterned spots on otherwise green leaves. Qualitatively, fresh CPMV preparations as well as CPMV stored at 4°C and −20°C produced visible infections, while CPMV stored at RT did not. This complements the structural data and shows that RNA-laden CPMV is infectious, while RT-stored samples that appeared broken particles and lost their RNA genome were unable to instigate infection. Of note, even the 4°C samples that showed some RNA degradation within the capsid were infectious. In future work, dilution curves should be tested to assess the differences in the degree of infection. It is expected that 4°C-stored samples lost some potency due to RNA degradation. Importantly, we assayed the biological activity of the intended application: the use of CPMV as an intratumoral immunotherapy. CPMV stored at 4°C and −20°C was tested against fresh CPMV preparations (with PBS as negative control); weekly intratumoral treatments were given for 3 weeks and tumor burden assessed using a mouse model of dermal melanoma (C57BL6 mice and B16F10 tumors). We opted not to include the samples stored at RT, because the samples displayed a high degree of aggregation raising safety concerns; the samples already proved ineffective against tumors after 6 months of storage as was shown in our earlier work [ 15 The anti-tumor efficacy study showed that CPMV stored at −20°C maintained efficacy similar to fresh CPMV preparations, with no significant differences in tumor growth or overall survival. CPMV stored in 4°C, however, did not generate comparable efficacy to either fresh or −20°C CPMV and was rather no different from the PBS-treated mice. We can point to some increased aggregation, S protein cleavage, and RNA degradation as differences between 4°C-stored CPMV and −20°C. Of note, the same batch of CPMV maintained at 4°C was still efficacious after 6 months of storage. The key differentiators appear to be the state of S protein cleavage and RNA quality. While not effective as an anti-tumor agent, the 4°C sample was still infectious to plants; however, more research is needed to delineate the degree of infectivity, i.e., a dose–response curve should be established using Phaseolus vulgaris cv. Pinto 22 With regard to the lack of anti-tumor efficacy, previous formulation studies delineated that RNA-laden CPMV is more efficacious compared to RNA-free CPMV [ 23 5 24 10 11 5. Conclusions There are ongoing efforts to translate CPMV intratumoral immunotherapy to the clinic. This study aids translational development as it helps define the chemistry, manufacturing, and controls (CMC) package for this drug candidate. Toward that goal, here we showed that CPMV stored in frozen conditions (−20°C) is still intact and provides the same efficacy as fresh CPMV in a murine intradermal model of B16F10 melanoma. Storage at warmer conditions (4°C or RT) was not sufficient to maintain structural integrity or biological activity. A future goal remains to fully elucidate why 4°C storage is more variable for in vivo Supplementary Material Supplemental Material Article highlights  CPMV is a drug candidate for intratumoral immunotherapy. CPMV in buffered solution and stored at −20°C maintains structural integrity and biological activity over a period of at least 2 years. CPMV preparations stored at RT were significantly degraded and aggregated, resulting in loss of biological activity. For CPMV stored at 4°C, it was found that the capsid was mostly intact, however presenting with a cleaved S protein, while the RNA cargo showed signs of degradation; these preparations were infectious toward plants but did not induce antitumor immunity in a dermal tumor mouse model. Author contributions Andrea Simms: investigation, methodology, data analysis, visualization, writing – original draft. Narek Minasov: investigation. Nicole F. Steinmetz: conceptualization, funding acquisition, resources, data analysis, writing – review & editing. Disclosure statement The authors declare the following competing financial interest(s): Dr Steinmetz is a co-founder of, has equity in, and has a financial interest in PlantiosX Inc. Dr Steinmetz is a co-founder of, has equity in, and has a financial interest in Mosaic ImmunoEngineering Inc. Dr Steinmetz is a co-founder and manager of Pokometz Scientific LLC, under which she is a paid consultant to Flagship Labs 95 Inc. The other authors have no relevant affiliations or financial involvement with any organization or entity with a financial interest in or financial conflict with the subject matter or materials discussed in the manuscript. This includes employment, consultancies, honoraria, stock ownership or options, expert testimony, grants or patents received or pending, or royalties. Writing assistance No writing assistance was utilized in the production of this manuscript. Reviewer disclosures Peer reviewers in this manuscript have no relevant financial or other relationships to disclose. Data availability statement The data supporting this article are available in the Cancer Nanotechnology Laboratory (caNanoLab) data repository portal ( https://cananolab.cancer.gov/#/ Supplementary material Supplemental data for this article can be accessed online at https://doi.org/10.1080/17435889.2025.2544522 References  Papers of special note have been highlighted as either of interest (•) or of considerable interest (••) to readers. 1. Phiri K Grill L. Development of a candidate TMV epitope display vaccine against SARS-CoV-2 Vaccines (Basel) 2024 Apr 23 12 5 448 10.3390/vaccines12050448 38793699 PMC11125883 2. Hager Karen J Pérez Marc G Gobeil P Efficacy and safety of a recombinant plant-based adjuvanted COVID-19 vaccine N Engl J Med 2022 Jun 01 386 22 2084 2096 10.1056/NEJMoa2201300 35507508 PMC9127773 3. Lebel M-È Chartrand K Tarrab E Potentiating cancer immunotherapy using papaya mosaic virus-derived nanoparticles Nano Lett 2016 Mar 09 16 3 1826 1832 10.1021/acs.nanolett.5b04877 26891174 4. Langley J Pastural E Halperin S A randomized controlled study to evaluate the safety and reactogenicity of a novel rVLP-based plant virus nanoparticle adjuvant combined with seasonal trivalent influenza vaccine following single immunization in healthy adults 18–50 years of age Vaccines (Basel) 2020 8 3 393 10.3390/vaccines8030393 32698532 PMC7564144 5. Mao C Beiss V Fields J Cowpea mosaic virus stimulates antitumor immunity through recognition by multiple MYD88-dependent toll-like receptors Biomaterials 2021 Aug 01 275 120914 10.1016/j.biomaterials.2021.120914 34126409 PMC8542346  •• This work provides the key mechanism data detailing that CPMV acts as TLR agonist. 6. Bachmann MF Jennings GT. Vaccine delivery: a matter of size, geometry, kinetics and molecular patterns Nat Rev Immunol 2010 Nov 10 11 787 796 10.1038/nri2868 20948547 7. Lizotte PH Wen AM Sheen MR In situ vaccination with cowpea mosaic virus nanoparticles suppresses metastatic cancer Nat Nanotechnol 2016 Mar 11 3 295 303 10.1038/nnano.2015.292 26689376 PMC4777632  •• This is the initial study demonstarting anti-tumor efficacy of CPMV is as an intratumoral immunotherapy applied in mouse tumor models. 8. Wang C Fiering SN Steinmetz NF. Cowpea mosaic virus promotes anti-tumor activity and immune memory in a mouse ovarian tumor model Adv Ther 2019 May 01 2 5 1900003 10.1002/adtp.201900003 PMC8101952 33969181 9. Mao C Beiss V Ho GW In situ vaccination with cowpea mosaic virus elicits systemic antitumor immunity and potentiates immune checkpoint blockade J Immunother Cancer 2022 10 12 e005834 10.1136/jitc-2022-005834 36460333 PMC9723958 10. Sergent P Pinto-Cárdenas JC Carrillo AJA An abscopal effect on lung metastases in canine mammary cancer patients induced by neoadjuvant intratumoral immunotherapy with cowpea mosaic virus nanoparticles and anti-canine PD-1 Cells 2024 Sep 3 13 17 1478 10.3390/cells13171478 39273048 PMC11394642 11. Alonso-Miguel D Valdivia G Guerrera D Neoadjuvant in situ vaccination with cowpea mosaic virus as a novel therapy against canine inflammatory mammary cancer J Immunother Cancer 2022 10 3 e004044 10.1136/jitc-2021-004044 35277459 PMC8919457 12. Hoopes PJ Wagner RJ Duval K Treatment of canine oral melanoma with nanotechnology-based immunotherapy and radiation Mol Pharm 2018 Sep 04 15 9 3717 3722 10.1021/acs.molpharmaceut.8b00126 29613803 PMC6296751  • One of the initial studies establishing that CPMV is also effective against spontaneous canine tumors. 13. Rathore N Rajan RS Current perspectives on stability of protein drug products during formulation, fill and finish operations Biotechnol Prog 2008 May 01 24 3 504 514 10.1021/bp070462h 18484778 14. Yu YB Briggs KT Taraban MB Grand challenges in pharmaceutical research series: ridding the cold chain for biologics Pharm Res 2021 Jan 38 1 3 7 10.1007/s11095-021-03008-w 33555493 PMC7869771 15. Simms A Zhao Z Cedrone E Cowpea mosaic virus intratumoral immunotherapy maintains stability and efficacy after long-term storage Bioeng Transl Med 2024 Nov 01 9 6 e10693 10.1002/btm2.10693 39545091 PMC11558193  •• This study shows the initial long-term CPMV stability data that this work is the follow-up to. 16. Stability Testing of New Drug Substances and Products Q1A(R2) International conference on harmonisation of technical requirements for registration of pharmaceuticals for human use 2003 https://database.ich.org/sites/default/files/Q1A%28R2%29%20Guideline.pdf 17. Stability Testing of Drug Substances and Drug Products Q1 (Draft Version) International Council for Harmonisation of Technical Requirements for Pharmaceuticals for Human Use 2025 https://database.ich.org/sites/default/files/ICH_Q1EWG_Step2_Draft_Guideline_2025_0411.pdf 18. Wen AM Lee KL Yildiz I Viral nanoparticles for in vivo tumor imaging J Vis Exp 2012 Nov 16 69 e4352 10.3791/4352 PMC3572551 23183850 19. Porterfield JZ Zlotnick A A simple and general method for determining the protein and nucleic acid content of viruses by UV absorbance Virology 2010 Nov 25 407 2 281 288 10.1016/j.virol.2010.08.015 20850162 PMC2964155 20. Taylor KM Spall VE Jonathan P The cleavable carboxyl-terminus of the small coat protein of cowpea mosaic virus is involved in RNA encapsidation Virology 1999 Mar 01 255 1 129 137 10.1006/viro.1998.9567 10049828 21. Hesketh EL Meshcheriakova Y Dent KC Mechanisms of assembly and genome packaging in an RNA virus revealed by high-resolution cryo-EM Nat Commun 2015 Dec 10 6 1 10113 10.1038/ncomms10113 26657148 PMC4682053 22. van Kammen A van Lent J Wellink J Dpv no: 378 cowpea mosaic virus 2001 Available from: https://dpvweb.net/dpv/showdpv/?dpvno=378 23. Wang C Beiss V Steinmetz NF Cowpea mosaic virus nanoparticles and empty virus-like particles show distinct but overlapping immunostimulatory properties J Virol 2019 Nov 1 93 21 10.1128/JVI.00129-19 PMC6803287 31375592 24. Chariou PL Beiss V Ma Y In situ vaccine application of inactivated CPMV nanoparticles for cancer immunotherapy Mater Adv 2021 2 5 1644 1656 10.1039/D0MA00752H 34368764 PMC8323807 ",
  "metadata": {
    "Title of this paper": "In situ vaccine application of inactivated CPMV nanoparticles for cancer immunotherapy",
    "Journal it was published in:": "Nanomedicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490393/"
  }
}