{
  "title": "Paper_282",
  "abstract": "pmc Mol Cancer Ther Mol Cancer Ther 4147 aacrsd Molecular Cancer Therapeutics 1535-7163 1538-8514 pmc-is-collection-domain yes pmc-collection-title AACR Open Access PMC12485380 PMC12485380.1 12485380 12485380 40531186 10.1158/1535-7163.MCT-24-0646 MCT-24-0646 1 Version of Record Breast Cancer Cell Death And Senescence Apoptosis Immunology Antibodies/Immunoconjugates Immunotherapy Large Molecule Therapeutics Antineoplastic Activity of a Novel Trispecific Single-Chain Antibody Targeting the hERG1/β1 Integrin Complex and TRAIL Receptors TRAIL-Conjugated Antibody against hERG1/β1 Molecular Complex https://orcid.org/0000-0002-0409-0037 Duranti Claudia 1 2 3 https://orcid.org/0000-0002-1059-6077 Iorio Jessica 1 2 https://orcid.org/0009-0009-2292-5999 Capitani Chiara 1 https://orcid.org/0000-0002-1495-0918 Lottini Tiziano 1 2 https://orcid.org/0009-0004-5708-3262 Martinelli Michele 1 4 https://orcid.org/0009-0009-5107-2809 Roosz Julia 5 https://orcid.org/0000-0002-4360-9778 Anderle Nicole 5 https://orcid.org/0000-0002-8661-6871 Maulana Tengku Ibrahim 6 https://orcid.org/0000-0002-5000-0581 Loskill Peter M. 5 6 https://orcid.org/0009-0005-3140-2904 Colasurdo Rossella 1 4 https://orcid.org/0000-0002-2219-098X Sala Cesare 1 https://orcid.org/0000-0003-3258-5800 Magni Lara 1 https://orcid.org/0000-0002-6317-9648 Arcangeli Annarosa 1 2 3 *  1  2  3  4  5  6 * Corresponding Author: annarosa.arcangeli@unifi.it Mol Cancer Ther 2025;24:1584–99 Current address for L. Magni: Cell Biology and Physiology, Copenhagen, Denmark. 01 10 2025 18 6 2025 24 10 498054 1584 1599 31 7 2024 04 2 2025 13 6 2025 01 10 2025 02 10 2025 03 10 2025 ©2025 The Authors; Published by the American Association for Cancer Research 2025 American Association for Cancer Research https://creativecommons.org/licenses/by/4.0/ This open access article is distributed under the Creative Commons Attribution 4.0 International (CC BY 4.0) license. Abstract Targeted therapies and immunotherapies have largely improved cancer treatment in the last years. One of the most promising approaches is the induction of tumor apoptosis by TRAIL through its binding to apoptosis-inducing receptors DR4 and DR5 on the plasma membrane of target cells. However, some constraints (e.g., the short in vivo in vitro in vivo Fondazione AIRC per la ricerca sul cancro ETS (AIRC) http://dx.doi.org/10.13039/100020581 1662 15627 21510 and 30874 Arcangeli A. Ministero dell'Istruzione, dell'Università e della Ricerca (MIUR) http://dx.doi.org/10.13039/501100003407 20174TB8KW 2022APEBMY Arcangeli A. European Commission (EC) http://dx.doi.org/10.13039/501100000780 813834 ECS00000017 Arcangeli A. Università degli Studi di Firenze (UniFI) http://dx.doi.org/10.13039/501100004434 ex 60% Arcangeli A. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Over the past 20 years, targeted therapies and immunotherapies have largely improved cancer treatment ( 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 in vivo 16 17 18 19 In this scenario, we have generated a TRAIL-based immunoconjugate in which the targeting moiety is represented by a single-chain diabody (scDb-hERG1-β1) directed against two proteins, hERG1 and the β1 integrin, which form a complex in cancer cells ( 20 20 20 21 22 in vitro in vivo Materials and Methods Reagents For PCR, KOD Hot Start DNA Polymerase (Novagen, cat. 71086-5) was used. pPIC9K (Thermo Fisher Scientific, cat. V17520): expression vector for the scDb-hERG1-β1 antibody in Pichia pastoris AB206386 Solutions Elution buffer: 20 mmol/L sodium phosphate, 500 mmol/L NaCl, and 500 mmol/L imidazole, pH 7.3. Development of the scDb-hERG1-β1-TRAIL antibody To develop the scDb-hERG1-β1-TRAIL antibody, the following steps were followed: (i) the sequence encoding for scDb-hERG1-β1 was isolated from the pPIC9K vector ( 20 Escherichia coli 5 R25001 Fig. 1A Figure 1. Biochemical characterization of the scDb-hERG1-β1-TRAIL antibody. A, B, C, D, E, A, https://BioRender.com/bqymq1f Labeling of scDb-hERG1/β1 with indocyanine green Amine-reactive indocyanine green (ICG)-NHS (ICG-NHS, Iris Biotech) dye equipped with succinimidyl (NHS) ester reacts efficiently with primary amines of proteins to form stable dye–protein conjugates. ICG-NHS was first dissolved in anhydrous DMSO (Sigma-Aldrich). The scDb-hERG1-β1 solutions in PBS were incubated with ICG at molar ratios of ICG:scDb of 5 (condition 1), 10 (condition 2), and 20 (condition 3; 5×, 10×, and 20×) in conjugation buffer (0.002 MNaHCO 3 2 3 The concentration of scDb-hERG1-β1 and scDb-hERG1-β1-TRAIL was calculated for all the three above-mentioned conjugation conditions using the following equation: protein concentration = A protein × protein molecular weight/∑ protein, in which A protein = A280 − Amax × 0.07, with Amax (absorbance of the dye at ≤ max) determined at 800 nm and 0.07 = contribution of the dye to the absorbance at A280 (CF ICG-NHS = 0.07). Subsequently, the degree of labeling (D.O.L., corresponding to the number of dye molecules present on the labeled protein) was calculated for the three conditions using the following equation: D.O.L. = (Amax × protein molecular weight)/([protein] × ∑dye), in which ∑dye = 223,000 cm −1 −1 in vivo Cell cultures Cells were obtained from the ATCC in 2014. Cell authentication has been performed through morphology test by microscopy, growth curve analysis, and Mycoplasma 23 R25001 2 in vivo Mycoplasma Mycoplasma Cell viability assay Cell viability was measured by the trypan blue exclusion test as in ( 24 Apoptosis assay Apoptosis was determined using the annexin-V/PI test (Annexin-V FLUOS Staining Kit, Roche Diagnostics, cat. 11 858 777 001) as previously described in ( 24 Peptide- and cell-based ELISAs Peptide-ELISA was performed following the procedure described in ( 20 20 Competitive ELISA Competitive cell ELISAs were performed on MDA-MB-231 cells. First test: MDA-MB-231 cells were seeded in the absence or presence of s-trimer-TRAIL (1 µmol/L) for 1 hour, then incubated with either scDb-hERG1-β1 (1.5 µmol/L) or scDb-hERG1-β1-TRAIL (1.5 µmol/L) for 1 hour, and then revealed by anti-His antibody. Second test: MDA-MB-231 cells were seeded in the presence of s-trimer TRAIL (1 µmol/L) for 1 hour, then incubated with scDb-hERG1-β1-TRAIL or nothing, and then revealed with the anti-His or anti-TRAIL antibody (final dilution 1:100, see the “Reagents” section) and then with mouse IgG–HRP conjugate as a secondary antibody (see the “Reagents” section). Cell cultures in microfluidic chips Tumor-on-chip concept, design, and fabrication The study was conducted using a previously established tumor-on-chip system ( 2 5 2 The tumor chambers (1 mm in diameter, 0.3 mm in height, and six chambers per chip) branch off a main injection channel (0.2 mm in height) at a 45 degrees angle and a high-resistance channel toward the outlet port, which forces the aggregates/organoids to sequentially enter the tumor chambers during the injection process. This concept and design enable the integration of any aggregate/organoid below 0.2 mm in size. The medium channel is situated right above the tumor chambers and is separated by a porous PET membrane (Supplementary Fig. S4B). The 200- to 300-μm-high tumor chambers and medium channels were microstructured via replica molding of polydimethylsiloxane (PDMS; Sylgard, cat. 184, Dow Corning) on two differently patterned master wafers fabricated via photolithographic processes. For the replica molding, PDMS was homogeneously mixed in a 10:1 (elastomer base: curing agent) mass ratio and then degassed in a desiccator to remove air bubbles. Two different replica molding approaches were conducted: (i) Standard molding comprising pouring of PDMS prepolymer solution onto the silicon wafer master mold was used to obtain 3-mm-thick PDMS pieces featuring the medium channel structures. PDMS was cured at 60°C for 4 hours. After curing, the PDMS modules were cut to the size of the chip, and ports were pierced using a biopsy punch (Disposable Biopsy Punch, 0.75 mm diameter; cat. 504 529; World Precision Instruments) to access the channels (for both cell injection and medium perfusion). (ii) Exclusion molding was used to fabricate the bottom layer featuring through-hole structures, the tumor chambers. In this study, PDMS prepolymer solution was poured onto the silicon wafer master mold, which was then clamped against a 5-mm-thick PMMA disk to produce a 0.3 mm thin layer with hole structures. PDMS was cured at 60°C for 2 hours. Once the PDMS parts were cured, they were cleaned using isopropanol followed by deionized water and blow-dried with an air gun. Finally, the microfluidic modules were assembled in three consecutive bonding steps: (i) tumor layer to glass coverslip, (ii) medium layer to the membrane, and (iii) tumor layer to medium layer. For all steps, bonding was achieved by oxygen plasma activation (75 W, 0.2 cm 3 −1 2 2 3 −1 2 1. Tumor aggregate generation and integration into the tumor-on-chip system Cells (either MDA-MB-231 or PANC-1) were detached, counted, and subsequently resuspended in a 1:1 mixture of BME (Basement Membrane Extract2 Cultrex Reduced Growth Factor, Bio-Techne, cat. 3532-010-02) and cell culture medium on ice. After carefully removing the medium from the agarose mold, 200 µL of cell–gel suspension was added to each well. Following a centrifugation step at 900 × g 2. Tumor-on-chip perfusion and withdraw treatment Before starting the cell culture, the medium was warmed up, degassed, and filter-sterilized by applying negative pressure on a 50-mL Falcon tube via a Steriflip conical filter unit (Merck, cat. SCGP00525) for 30 minutes while simultaneously warming up the medium in a 37°C water bath. After that, the medium temperature and gas saturation were equilibrated by placing the Falcon tube in the humidified incubator with a loosened cap for 30 minutes. Afterward, 2.5 mL of medium was loaded into a syringe, followed by connecting the syringe to the inlet tubing. Syringes were then mounted onto the pump. Each chip was perfused with medium from a syringe. Prior to connecting the inlet tubing into the chip’s inlet, the tubing was primed with medium using the pump. Chips were connected to the pumps and downstream 5-mL Eppendorf tubes as a reservoir to collect the effluent. The entire setup was then transferred into the incubator, and the pump flow rate was set to 20 μL/hours. After preparing tubings (previously autoclaved), syringes, and syringe pump (12 channel; Landgraf Laborsysteme, cat. 106720190) in the sterile bench, the syringes were mounted on the syringe pump on a fully dispensed plunger position. The syringe diameter was set on the pump. The inlet tubings were carefully connected to the media channel inlet. Using the P100 pipette tip, 20 μL of medium were administered on the inlet. The flow rate was set to 100 μL/hours and the pump in “withdraw” mode to generate negative pressure. Once the liquid level on the pipette tip decreases normally, 400 μL of medium were added to the pipette tip. At this point, the pump flow rate was set to 20 μL/hours and the whole setup was moved into the incubator. 3. Calcein/PI assay 3D cell cultures of PANC-1, MDA-MB-231, and HCT-116 were treated with the IC 50 4. LDH assay 3D cell cultures of PANC-1, MDA-MB-231, and HCT-116 were treated with the IC 50 After collecting and diluting all samples, 50 μL of diluted sample were transferred into a 96-well opaque-walled, nontransparent assay plate (with clear or opaque bottom). Fifty μL of LDH detection reagent (Promega, cat. J2381) were added to each well. Plates were then incubated for 60 minutes at RT. Luminescence was recorded after 30 to 60 minutes after adding LDH detection reagent. Cytotoxicity  ( % )  =  100  ×  ( Experimental  LDH  release  -  Medium  background ) / ( Maximum  LDH  release  control  -  Medium  background ) Protein extraction, Coomassie, WB, and coimmunoprecipitation Protein extraction and quantification were performed essentially as reported in ( 23 25 25 Densitometric analysis Proteins were quantified by optical densitometry using ImageJ and plotting the data with OriginPro8 software (OriginLab Corporation). For the quantification of the hERG1/β1 integrin complex, the signal of the coimmunoprecipitated hERG1 protein was divided by the signal of the protein used for immunoprecipitation (β1 integrin) and then normalized to the signal of the corresponding protein in the total lysate (β1 integrin input). Animal studies  1. Pharmacokinetics Eight-week-old immunocompetent FVB female mice (Envigo RMS S.r.l, Italy) were injected with 160 µg (8 mg/kg) of scDb-hERG1-β1-TRAIL antibody, and blood samples were collected from the tail vein at 15′, 30′, 60′, 180′, 6, 24, and 48 hours after antibody injection. Each sample was spun at 12,000 rpm for 5 minutes, and the resulting plasma was stored at −80°C until analyzed. The plasma concentration of scDb-hERG1-β1-TRAIL antibody was determined by WB (see “Materials and Methods”), using the anti-TRAIL antibody (Thermo Fisher Scientific, cat. PA1-955; RRID: AB_2256246) 1 µg/mL in PBS-5% BSA to reveal the scDb-hERG1-β1-TRAIL antibody, followed by anti-rabbit IgG (LI-COR Biosciences, cat. 926-32211 Lincoln, NE; RRID: AB_6218431) 1:20.000 in PBS-5% BSA. The serum stability against proteolytic activities of the scDb-hERG1-β1-TRAIL antibody was assessed using 150 mg of the antibody. The scDb-hERG1-β1-TRAIL antibody was incubated at 37°C in mouse serum up to 96 hours (0, 15′, 30′, 2, 12, 2, 48, 72, and 96 hours), and its concentration was determined through a WB and densitometric analysis. 2. Half-life determination The half-lives for the elimination phase were determined using Origin 7.0 Software by fitting the last four data points into the first-order equation, T t t t C t t t C t T 3. Biodistribution Following the methodology described below, endogenous peroxidases were inhibited using a 1% H 2 2 4. Kidney perfusion Kidney perfusion status was assessed using contrast-enhanced US imaging with VevoF2-LAZR-X after intravenous injection of a 50 mL bolus ultrasound (US) contrast agents (Vevo MicroMarker, Bracco Research s.p.a.), equivalent to 2 × 10 7 5. AST/ALT determination The levels of AST and ALT in mice were measured in blood samples after 24 hours of treatment with scDb-hERG1-β1-TRAIL. Protocol was performed following manufacturer instructions (see the “Reagents” section). The results are reported as the AST/ALT ratio. 6. In Vivo Two mouse models of breast cancer have been established. The first was generated by subcutaneous injection of MDA-MB-231 cells on six-week-old female athymic Foxn1 nu/nu mice (Envigo S.r.l, Italy). Before the injection, MDA-MB-231 cells were cultured in DMEM +5% FBS medium under the conditions of 37°C and 5% CO 2 6 n n To generate the second model, 1 × 10 6 n n All the experiments were performed at the Animal House (Ce.S.A.L) of the University of Florence. Mice were housed inside the sterile room in ventilated cabinets with a canonical 12-hour dark–light cycle and unlimited access to food and water. The procedures were performed accomplishing the ARRIVE guidelines for animal research. All the animal experiments received the approval from the Italian Ministry of Health with authorization number 769/2023-PR. 7. US and imaging In order to assess tumor growth, US imaging was performed with the VevoLAZR-X system (Fujifilm Visualsonics) on live animals. A 55-Mhz transducer was used for the 3D axial scan of tumor masses. The 3D acquisition was performed in B-mode using the 3D motor that allows the transducer to scan the tumor masses in various sections along the longitudinal axis. In each section, the tumor perimeter was bordered (region of interest), and then, by using VevoLAB software, the 3D rendering of the entire tumor masses was generated. During the imaging of tumors, mice were maintained anesthetized by 2% isoflurane on a pad heated at 37°C. scDb-hERG1-β1 and scDb-TRAIL conjugated with ICG (scDb-hERG1-β1-ICG and scDb-TRAIL-ICG, respectively) were administered subcutaneously in the peritumoral region 15 minutes before the imaging session. The photoacoustic (PA) signal of ICG in the tumor was observed by PA imaging (PAI) performed with VevoF2-LAZR-X. PA images were acquired using the 55 MHz linear array transducer. The quantification of the percent of PA signal inside the whole tumor mass was performed by using Vevo Lab software as reported in World Molecular Imaging Congress: September 2023, Prague, oral presentation and September 2024, Montreal, oral presentation. 8. Histology and IHC on tumor masses Tumor masses of mice were analyzed for anti-His expression (see the detailed protocol in section 3, Biodistribution) and TUNEL assay. After dewaxing and rehydrating, the sections were probed using a commercially available kit (see supplementary reagents section) according to the manufacturer’s instructions. Statistical analysis Unless otherwise indicated, data are given as the means ± SEM in at least three independent experiments. Statistical comparisons were performed with OriginPro 2015 and SAS 9.2 (SAS Institute) software. The normality of data distribution was checked with K-S test. In the case of normal distributions, each data set was first checked for variance homogeneity using the F test for equality of two variances and the Brown–Forsythe test for multiple comparisons. For comparisons between two groups of data, we used the Student t post hoc P post hoc post hoc P Data availability The data generated in this study are available within the article and its supplementary data files. The raw data are available on request from the corresponding author. Results Generation and target antigen–specific binding of the scDb-hERG1-β1-TRAIL antibody The scDb-hERG1-β1-TRAIL was developed by fusing three TRAIL sequences to the sequence encoding scDb-hERG1-β1 which specifically targets the hERG1/β1 integrin complex in cancer cells ( 20 26 Figure 1A Pichia pastoris Fig. 1B 20 Fig. 1C 27 20 28 Fig. 1D Fig. 1E Fig. 1E Fig. 2A Fig. 2B 29 23 29 30 31 32 33 34 33 35 Fig. 2C Fig. 2C Fig. 2C Fig. 2C Fig. 2D Fig. 2D Figure 2. Cell-based ELISA of scDb-hERG1-β1, scDb-hERG1-β1-TRAIL, and s-trimer-TRAIL on cells with different expressions of the hERG1/β1 integrin complex and TRAIL receptors. A, B, A B, C, R 2 P R 2 P R 2 P D, C D C P Overall, the main determinant in the binding capacity of scDb-hERG1-β1-TRAIL is represented by scDb-hERG1-β1, which recognizes the hERG1/β1 integrin complex, whereas TRAIL-Rs are bound more slowly and, in general, with less avidity. Effects of scDb-hERG1-β1-TRAIL on breast cancer cell vitality, apoptosis, and proliferation The functional effects of scDb-hERG1-β1-TRAIL were then tested and compared with those of scDb-hERG1-β1, of the s-trimer TRAIL and of E4031, a specific blocker of hERG1 currents ( 36 Fig. 2 33 33 29 31 50 37 Fig. 3A Figure 3B Figure 3C Fig. 3D 38 Fig. 4A Figure 3. Effects of the scDb-hERG1-β1-TRAIL, scDb-hERG1-β1, s-trimer-TRAIL, and E4031 on cell viability, apoptosis, and proliferation. A, B, A C, A D, A P P P Figure 4. Effects of the scDb-hERG1-β1-TRAIL, scDb-hERG1-β1, s-trimer-TRAIL, and E4031 on cell signaling and vitality in a microfluidic 3D culture system. A, Fig. 3A B, Fig. 3A C, Fig. 3A D, Fig. 3A P P P scDb-hERG1-β1-TRAIL (as well as scDb-hERG1-β1, s-trimer-TRAIL, and E4031) was then tested on MDA-MB-231 TNBC cells cultured as 3D within a microfluidic system which better mimics the conditions occurring within the tumor tissue ( 39 40 Fig. 4B Fig. 4C 24 96 Fig. 4D Figs. 3 4  In vivo  a. Pharmacokinetics and toxicity scDb-hERG1-β1-TRAIL was then tested in vivo Fig. 5A 20 22 Fig. 5B Fig. 5B Fig. 5C Fig. 5D Fig. 5E Fig. 5F Fig. 5G b. Pharmacodynamics in TNBC mouse models Figure 5. Pharmacokinetic and toxicity in vivo A, B, In vivo 1/2 C, B D, B B E, F G B The in vivo Fig. 6A Fig. 6C 3 3 Fig. 6A C 20 Figure 6. Pharmacodynamics in vivo A, B, C, D, E, F, C G, C H, C P P P scDb-hERG1-β1-TRAIL significantly reduced the volume of subcutaneous masses arising from MDA-MB-231 cells after 1 week of treatment ( Fig. 6A Fig. 6B Fig. 6C Fig. 6D in vivo Fig. 6E 41 Fig. 6F Fig. 6G 3 Fig. 6H Discussion In the present article, we describe a novel recombinant, single-chain antibody which targets the proteins hERG1, β1 integrin, and TRAIL-Rs on the plasma membrane of cancer cells. Such “trispecific” antibody, named scDb-hERG1-β1-TRAIL, derives from the fusion of three TRAIL sequences to an existing diabody (scDb-hERG1-β1) which binds to the complex formed by hERG1 and β1 integrin. It combines the specific targeting of cancer cells by the scDb-hERG1-β1 with the proapoptotic activity triggered by TRAIL. Indeed, scDb-hERG1-β1-TRAIL exerts proapoptotic, antiproliferative effects in breast cancer cells, mainly TNBC, which express the hERG1/β1 integrin complex and are TRAIL-sensitive, cultured in vitro in vivo The scDb-hERG1-β1-TRAIL antibody is easily produced in CHO cells, stable at 4°C, and secreted as a monomer, a not commonly occurring positive feature ( 42 28 43 44 15 45 40 scDb-hERG1-β1-TRAIL showed a good penetration into cancer tissues in vivo 46 47 48 22 Overall, we have here provided the proof of concept of the therapeutic valence of a novel scDb-hERG1-β1-TRAIL antibody, which targets the hERG1/β1 integrin complex as well as TRAIL-Rs in breast cancer and TNBC which overexpress the complex, hence representing a novel antibody–drug conjugate for difficult-to-treat cancers. Supplementary Material Supplementary Figure S1 Development of the scDb-hERG1-β1-TRAIL Supplementary Figure S2 Dose response curves and antibody correlation in different cell lines. Supplementary Figure S3 Dose-dependence curves of HEK293, HEK-hERG1, MCF10A, MCF7, MDA-MB-231 and U2932 Supplementary Figure S4 Cyclin western-blot and schematic representation of the tumor-on-chip model. Supplementary Figure S5 Stability and pharmacokinetic data. Supplementary Figure S6 In vivo data. Supplementary Table S1 PRODUCTION OF scDb-TRAIL FUSION PROTEIN Supplementary Table S2 Cycle steps Supplementary Table S3 Peptides used for ELISA assays. Supplementary Table S4 IC50 values of the scDb-hERG1-β1, scDb-hERG1-β1-TRAIL and s-trimer-TRAIL on cell viability in different cell lines. Acknowledgments The data presented in the current study were in part generated using grants by the European Union–NextGenerationEU - National Recovery and Resilience Plan, Mission 4 Component 2 - Investment 1.5 - Tuscany Health Ecosystem - ECS00000017 - CUP B83C22003920001 to C. Duranti and A. Arcangeli. This research was funded by the University of Florence (ex 60%) to A. Arcangeli. This work was supported by Associazione Italiana per la Ricerca sul Cancro (grant numbers 1662, 15627, 21510, and 30874), the PRIN Italian Ministry of University and Research “Leveraging basic knowledge of ion channel network in cancer for innovative therapeutic strategies (LIONESS)” 20174TB8KW and “Dynamics of ion channel–based macromolecular complexes in triggering mechanotransduction through lipid rafts: Toward understanding mechanisms underlying cell invasiveness in pancreatic cancer (MECHIONRAFT)” 2022APEBMY, and pHioniC: European Union’s Horizon 2020 grant number 813834 to A. Arcangeli. J. Iorio was supported by Regione Tocana fellowship within the project “Progetti di alta formazione attraverso l’attivazione di Assegni di Ricerca” (MutCoP project) cofunded by Fondazione Cassa di Risparmio di Pistoia e Pescia and was formely funded by a fellowship of Fondazione Cassa di Risparmio di Pistoia e Pescia within Giovani@Ricerca Scientifica program. C. Duranti was supported by an Associazione Italiana per la Ricerca sul Cancro fellowship for Italy “Francesco Tonni” ID 24020. The data presented in the current study were in part generated using grants by the European Union, National Recovery and Resilience Plan, Mission 4 Component 2 – Investment 1.4 - National Center for Gene Therapy and Drugs based on RNA Technology - NextGenerationEU – Project Code CN00000041-CUP B13C22001010001 to A. Arcangeli.  Note: http://mct.aacrjournals.org/ Authors’ Disclosures C. Duranti reports a patent for “Novel antibodies WO2019/015,936” issued and licensed. A. Arcangeli reports grants from European Union–NextGenerationEU, the University of Florence (ex 60%), Associazione Italiana per la Ricerca sul Cancro (grant numbers 1662, 15627, 21510 and 30874), the PRIN Italian Ministry of University and Research, and pHioniC: European Union’s Horizon 2020 grant no. 813834 during the conduct of the study; in addition, A. Arcangeli has a patent for “Novel antibodies WO2019/015,936” issued and licensed. No disclosures were reported by the other authors. Authors’ Contributions  C. Duranti: J. Iorio: C. Capitani: T. Lottini: M. Martinelli: J. Roosz: N. Anderle: T.I. Maulana: P.M. Loskill: R. Colasurdo: C. Sala: L. Magni: A. Arcangeli: References 1. Min HY Lee HY Molecular targeted therapy for anticancer treatment Exp Mol Med 2022 54 1670 94 36224343 10.1038/s12276-022-00864-3 PMC9636149 2. Rui R Zhou L He S Advances in the research of exosomes in renal cell carcinoma: from mechanisms to applications Front Immunol 2023 14 1271669 37942325 10.3389/fimmu.2023.1271669 PMC10628008 3. Parakh S King D Gan HK Scott AM Current development of monoclonal antibodies in cancer therapy Recent Results Cancer Res 2020 214 1 70 31473848 10.1007/978-3-030-23765-3_1 4. Klein C Brinkmann U Reichert JM Kontermann RE The present and future of bispecific antibodies for cancer therapy Nat Rev Drug Discov 2024 23 301 19 38448606 10.1038/s41573-024-00896-6 5. Duranti C Arcangeli A Ion channel targeting with antibodies and antibody fragments for cancer diagnosis Antibodies (Basel) 2019 8 33 31544839 10.3390/antib8020033 PMC6640718 6. Newsom-Davis T Prieske S Walczak H Is TRAIL the holy grail of cancer therapy? Apoptosis 2009 14 607 23 19194800 10.1007/s10495-009-0321-2 7. Johnstone RW Frew AJ Smyth MJ The TRAIL apoptotic pathway in cancer onset, progression and therapy Nat Rev Cancer 2008 8 782 98 18813321 10.1038/nrc2465 8. Gampa SC Garimella SV Pandrangi SL Nano-TRAIL: a promising path to cancer therapy Cancer Drug Resist 2023 6 78 102 37065863 10.20517/cdr.2022.82 PMC10099604 9. Ashkenazi A Pai RC Fong S Leung S Lawrence DA Marsters SA Safety and antitumor activity of recombinant soluble Apo2 ligand J Clin Invest 1999 104 155 62 10411544 10.1172/JCI6926 PMC408479 10. Walczak H Miller RE Ariail K Gliniak B Griffith TS Kubin M Tumoricidal activity of tumor necrosis factor-related apoptosis-inducing ligand in vivo Nat Med 1999 5 157 63 9930862 10.1038/5517 11. De Miguel D Gallego-Lleyda A M. Ayuso J Pawlak A Conde B Ochoa I Improved anti-tumor activity of novel highly bioactive liposome-bound TRAIL in breast cancer cells Recent Pat Anticancer Drug Discov 2016 11 197 214 26924736 10.2174/1574892811666160229121544 12. Cao L Du P Jiang SH Jin GH Huang QL Hua ZC Enhancement of antitumor properties of TRAIL by targeted delivery to the tumor neovasculature Mol Cancer Ther 2008 7 851 61 18413798 10.1158/1535-7163.MCT-07-0533 13. Liu H Su D Zhang J Ge S Li Y Wang F Improvement of pharmacokinetic profile of TRAIL via trimer-tag enhances its antitumor activity in vivo Sci Rep 2017 7 8953 28827692 10.1038/s41598-017-09518-1 PMC5566391 14. Vaughan HJ Zamboni CG Radant NP Bhardwaj P Revai Lechtich E Hassan LF Poly(beta-amino ester) nanoparticles enable tumor-specific TRAIL secretion and a bystander effect to treat liver cancer Mol Ther Oncolytics 2021 21 377 88 34189258 10.1016/j.omto.2021.04.004 PMC8208964 15. Bellail A Qi L Mulligan P Chhabra V Hao C TRAIL agonists on clinical trials for cancer therapy: the promises and the challenges Rev Recent Clin Trials 2009 4 34 41 19149761 10.2174/157488709787047530 16. Pishavar E Attaranzadeh A Alibolandi M Ramezani M Hashemi M Modified PAMAM vehicles for effective TRAIL gene delivery to colon adenocarcinoma: in vitro and in vivo evaluation Artif Cells Nanomed Biotechnol 2018 46 S503 13 30095012 10.1080/21691401.2018.1500372 17. Schneider B Münkel S Krippner-Heidenreich A Grunwald I Wels WS Wajant H Potent antitumoral activity of TRAIL through generation of tumor-targeted single-chain fusion proteins Cell Death Dis 2010 1 e68 21364672 10.1038/cddis.2010.45 PMC3032523 18. Wang LH Ni CW Lin YZ Yin L Jiang C Bin Lv CT Targeted induction of apoptosis in glioblastoma multiforme cells by an MRP3-specific TRAIL fusion protein in vitro Tumour Biol 2014 35 1157 68 24272336 10.1007/s13277-013-1155-7 19. Garg G Gibbs J Belt B Powell MA Mutch DG Goedegebuure P Novel treatment option for MUC16-positive malignancies with the targeted TRAIL-based fusion protein Meso-TR3 BMC Cancer 2014 14 35 24447304 10.1186/1471-2407-14-35 PMC3903436 20. Duranti C Iorio J Lottini T Lastraioli E Crescioli S Bagni G Harnessing the hERG1/β1 integrin complex via a novel bispecific single-chain antibody: an effective strategy against solid cancers Mol Cancer Ther 2021 20 1338 49 34045227 10.1158/1535-7163.MCT-20-1111 21. Arcangeli A Iorio J Duranti C Targeting the hERG1 and β1 integrin complex for cancer treatment Expert Opin Ther Targets 2024 28 145 57 38372580 10.1080/14728222.2024.2318449 22. Lottini T Duranti C Iorio J Martinelli M Colasurdo R D’Alessandro FN Combination therapy with a bispecific antibody targeting the hERG1/β1 integrin complex and gemcitabine in pancreatic ductal adenocarcinoma Cancers (Basel) 2023 15 2013 37046674 10.3390/cancers15072013 PMC10093586 23. Becchetti A Crescioli S Zanieri F Petroni G Mercatelli R Coppola S The conformational state of hERG1 channels determines integrin association, downstream signaling, and cancer progression Sci Signal 2017 10 eaaf3236 28377405 10.1126/scisignal.aaf3236 24. Petroni G Bagni G Iorio J Duranti C Lottini T Stefanini M Clarithromycin inhibits autophagy in colorectal cancer by regulating the hERG1 potassium channel interaction with PI3K Cell Death Dis 2020 11 161 32123164 10.1038/s41419-020-2349-8 PMC7052256 25. Duranti C Iorio J Bagni G Chioccioli Altadonna G Fillion T Lulli M Integrins regulate hERG1 dynamics by girdin-dependent Gαi3: signaling and modeling in cancer cells Life Sci Alliance 2024 7 e202302135 37923359 10.26508/lsa.202302135 PMC10624597 26. Duranti C Lastraioli E Iorio J Capitani C Carraresi L Gonnelli L Expression and purification of a novel single-chain diabody (scDb-hERG1/β1) from Pichia pastoris transformants Protein Expr Purif 2021 184 105879 33826963 10.1016/j.pep.2021.105879 27. Kagawa S He C Gu J Koch P Rha S Roth J Antitumor activity and bystander effects of the tumor necrosis factor-related apoptosis-inducing ligand (TRAIL) gene Cancer Res 2001 61 3330 8 11309289 28. Yuan X Gajan A Chu Q Xiong H Wu K Wu GS Developing TRAIL/TRAIL death receptor-based cancer therapies Cancer Metastasis Rev 2018 37 733 48 29541897 10.1007/s10555-018-9728-y PMC6138568 29. Alaei A Solali S Mirzapour MM Study of TRAIL and SAHA co-treatment on leukemia K562 cell line Cell Biochem Biophys 2024 83 1087 96 39392552 10.1007/s12013-024-01543-y 30. Qu Y Han B Yu Y Yao W Bose S Karlan BY Evaluation of MCF10A as a reliable model for normal human mammary epithelial cells PLoS One 2015 10 e0131285 26147507 10.1371/journal.pone.0131285 PMC4493126 31. Das S Tripathi N Preet R Siddharth S Nayak A Bharatam PV Quinacrine induces apoptosis in cancer cells by forming a functional bridge between TRAIL-DR5 complex and modulating the mitochondrial intrinsic cascade Oncotarget 2017 8 248 67 27542249 10.18632/oncotarget.11335 PMC5352116 32. Horwitz KB Costlow ME McGuire WL MCF-7: a human breast cancer cell line with estrogen, androgen, progesterone, and glucocorticoid receptors Steroids 1975 26 785 95 175527 10.1016/0039-128x(75)90110-5 33. Rahman M Davis SR Pumphrey JG Bao J Nau MM Meltzer PS TRAIL induces apoptosis in triple-negative breast cancer cells with a mesenchymal phenotype Breast Cancer Res Treat 2009 113 217 30 18266105 10.1007/s10549-008-9924-5 PMC2615075 34. Chavez KJ Garimella SV Lipkowitz S Triple negative breast cancer cell lines: one tool in the search for better treatment of triple negative breast cancer Breast Dis 2010 32 35 48 21778573 10.3233/BD-2010-0307 PMC3532890 35. Amini RM Berglund M Rosenquist R Von Heideman A Lagercrantz S Thunberg U A novel B-cell line (U-2932) established from a patient with diffuse large B-cell lymphoma following Hodgkin lymphoma Leuk Lymphoma 2002 43 2179 89 12533045 10.1080/1042819021000032917 36. Iorio J Duranti C Lottini T Lastraioli E Bagni G Becchetti A KV11.1 potassium channel and the Na+/H+ antiporter NHE1 modulate adhesion-dependent intracellular pH in colorectal cancer cells Front Pharmacol 2020 11 848 32587517 10.3389/fphar.2020.00848 PMC7297984 37. Masi A Becchetti A Restano-Cassulini R Polvani S Hofmann G Buccoliero AM hERG1 channels are overexpressed in glioblastoma multiforme and modulate VEGF secretion in glioblastoma cell lines Br J Cancer 2005 93 781 92 16175187 10.1038/sj.bjc.6602775 PMC2361632 38. Falschlehner C Emmerich CH Gerlach B Walczak H TRAIL signalling: decisions between life and death Int J Biochem Cell Biol 2007 39 1462 75 17403612 10.1016/j.biocel.2007.02.007 39. Beer M Kuppalu N Stefanini M Becker H Schulz I Manoli S A novel microfluidic 3D platform for culturing pancreatic ductal adenocarcinoma cells: comparison with in vitro cultures and in vivo xenografts Sci Rep 2017 7 1325 28465513 10.1038/s41598-017-01256-8 PMC5430997 40. Maulana TI Teufel C Cipriano M Roosz J Lazarevski L van den Hil FE Breast cancer-on-chip for patient-specific efficacy and safety testing of CAR-T cells Cell Stem Cell 2024 31 989 1002.e9 38754430 10.1016/j.stem.2024.04.018 41. Kalyuzhny AE Combination of TUNEL assay with immunohistochemistry for simultaneous detection of DNA fragmentation and oxidative cell damage Methods Mol Biol 2011 682 15 27 21057917 10.1007/978-1-60327-409-8_2 42. Hartung F Stühmer W Pardo LA Tumor cell-selective apoptosis induction through targeting of K(V)10.1 via bifunctional TRAIL antibody Mol Cancer 2011 10 109 21899742 10.1186/1476-4598-10-109 PMC3179451 43. Graves JD Kordich JJ Huang TH Piasecki J Bush TL Sullivan T Apo2L/TRAIL and the death receptor 5 agonist antibody AMG 655 cooperate to promote receptor clustering and antitumor activity Cancer Cell 2014 26 177 89 25043603 10.1016/j.ccr.2014.04.028 44. Tuthill MH Montinaro A Zinngrebe J Prieske K Draber P Prieske S TRAIL-R2-specific antibodies and recombinant TRAIL can synergise to kill cancer cells Oncogene 2015 34 2138 44 24909167 10.1038/onc.2014.156 PMC4240732 45. Gasparini C Vecchi Brumatti L Monasta L Zauli G TRAIL-based therapeutic approaches for the treatment of pediatric malignancies Curr Med Chem 2013 20 2254 71 23458616 10.2174/0929867311320170009 46. Xiong C Mao Y Wu T Kang N Zhao M Di R Optimized expression and characterization of a novel fully human bispecific single-chain diabody targeting vascular endothelial growth factor165 and programmed death-1 in Pichia pastoris and evaluation of antitumor activity in vivo Int J Mol Sci 2018 19 2900 30257416 10.3390/ijms19102900 PMC6213929 47. Duranti C Carraresi L Sette A Stefanini M Lottini T Crescioli S Generation and characterization of novel recombinant anti-hERG1 scFv antibodies for cancer molecular imaging Oncotarget 2018 9 34972 89 30405887 10.18632/oncotarget.26200 PMC6201861 48. Brin E Wu K Dagostino E Meng-Chiang Kuo M He Y Shia WJ TRAIL stabilization and cancer cell sensitization to its pro-apoptotic activity achieved through genetic fusion with arginine deiminase Oncotarget 2018 9 36914 28 30651925 10.18632/oncotarget.26398 PMC6319333 ",
  "metadata": {
    "Title of this paper": "TRAIL stabilization and cancer cell sensitization to its pro-apoptotic activity achieved through genetic fusion with arginine deiminase",
    "Journal it was published in:": "Molecular Cancer Therapeutics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485380/"
  }
}