{
  "title": "Paper_1048",
  "abstract": "pmc Gels Gels 3575 gels gels Gels 2310-2861 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469318 PMC12469318.1 12469318 12469318 41002535 10.3390/gels11090761 gels-11-00761 1 Review Polymer Network-Based Nanogels and Microgels: Design, Classification, Synthesis, and Applications in Drug Delivery https://orcid.org/0000-0003-1933-293X Sutradhar Sabuj Chandra 1 Banik Nipa 1 https://orcid.org/0000-0002-5704-7577 Bari Gazi A. K. M. Rafiqul 2 * https://orcid.org/0000-0002-1797-2565 Jeong Jae-Ho 3 * Chen Guang Academic Editor Yuan Jiaxing Academic Editor 1 2 3 * grafiqulbari@gachon.ac.kr jaehojeong@cau.ac.kr 22 9 2025 9 2025 11 9 497641 761 30 7 2025 03 9 2025 08 9 2025 22 09 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Polymer network-based nanogels (NGs) and microgels (MGs) have emerged as highly versatile platforms for advanced drug delivery, owing to their tunable architecture, biocompatibility, and responsiveness to diverse stimuli. This review presents a comprehensive and structured analysis of NG/MGs, encompassing their classification based on polymer origin, crosslinking mechanisms, composition, charge, stimuli-responsiveness, and structural architecture. We detail synthesis strategies—including inverse microemulsion and radiation-induced polymerization—and highlight key characterization techniques essential for evaluating physicochemical and functional properties. Emphasis is placed on the design-driven applications of NG/MGs in overcoming biological barriers and enabling targeted therapies, particularly in cancer, inflammation, diabetes, and viral infections. Multifunctional NGs integrating therapeutic and diagnostic capabilities (theranostics), as well as emerging platforms for immunotherapy and personalized medicine, are critically discussed. Finally, we address translational challenges and future directions, including scalable manufacturing, regulatory considerations, and integration with smart diagnostics. This review aims to serve as a foundational resource for researchers and clinicians developing next-generation NG/MG-based therapeutics. nanogels microgels stimuli-responsive polymers drug delivery theranostics personalized medicine Korea Institute of Energy Technology Evaluation and Planning (KETEP) and the Ministry of Trade, Industry & Energy (MOTIE) of the Republic of Korea RS-2025-02221568 Nuclear Safety Research Program through the Regulatory Research Management Agency for SMRs (RMAS) and the Nuclear Safety and Security Commission (NSSC) of the Republic of Korea RS-2024-00509653 This work was supported by the Korea Institute of Energy Technology Evaluation and Planning (KETEP) and the Ministry of Trade, Industry & Energy (MOTIE) of the Republic of Korea (No. RS-2025-02221568). This work was also supported by the Nuclear Safety Research Program through the Regulatory Research Management Agency for SMRs (RMAS) and the Nuclear Safety and Security Commission (NSSC) of the Republic of Korea. (No. RS-2024-00509653). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The development of advanced drug delivery systems has become a cornerstone of modern therapeutics, aiming to enhance efficacy, reduce side effects, and enable targeted treatment. Among these systems, polymer-based NG/MGs have garnered significant attention due to their unique structural and functional properties. These soft, water-swolled for accurate correspondence, crosslinked polymeric networks—ranging from nanometer to micrometer scales—offer high drug loading capacity, tunable release kinetics, and responsiveness to environmental stimuli [ 1 NGs, typically sized between 1 and 1000 nm, and MGs, which span the micrometer range, are synthesized using natural or synthetic polymers. Their internal network structure allows them to absorb large amounts of water or biological fluids without dissolving, maintaining mechanical integrity, and enabling controlled drug release [ 2 Natural polymers such as chitosan [ 3 4 5 6 7 8 9 10 11 12 13 A key advantage of NG/MGs lies in their stimuli-responsive behavior [ 14 15 16 8 Recent advances have focused on engineering NG/MGs with stimuli-responsive properties (e.g., pH, temperature, redox, and enzymatic), enabling on-demand drug release and real-time biosensing [ 17 18 19 20 21 22 23 24 25 26 27 12 27 28 29 30 31 Looking ahead, emerging trends include the development of hybrid NGs combining organic polymers with inorganic components (e.g., gold, silica, iron oxide) for theranostics, photothermal therapy, and magnetic targeting [ 32 33 Despite these advancements, several challenges remain in the clinical translation of NG/MG technologies. Issues such as scalability, reproducibility, long-term stability, and regulatory approval must be addressed to realize their full potential. Emerging trends in green chemistry and sustainable polymer design are paving the way for eco-friendly synthesis methods, while advances in manufacturing technologies are improving scalability and consistency [ 34 This review is particularly timely and significant as it addresses the growing demand for multifunctional and stimuli-responsive drug delivery platforms capable of overcoming biological barriers and achieving site-specific therapeutic action. While several reviews have discussed NG/MGs, our manuscript provides a uniquely structured classification framework, a comparative analysis of synthesis techniques, and a broad overview of biomedical applications, including cancer therapy, inflammation control, and antiviral treatments. We also highlight emerging trends such as hybrid NGs, theranostic systems, and personalized medicine, which are reshaping the future of precision therapeutics. By integrating recent advances in polymer chemistry, nanotechnology, and biomedical engineering, this review aims to serve as a comprehensive resource for researchers and clinicians seeking to understand and apply polymer network-based NG/MGs in next-generation drug delivery systems. 2. Classification of Polymeric NG/MGs Hydrogels are polymer networks formed by the combination of a dispersed phase (polymer chains) and a continuous phase (typically water). Depending on their particle size, they are categorized into macrogels, microgels, and nanogels. Macrogels are large, crosslinked structures that typically have a jelly-like consistency ( Figure 1 35 MGs generally range from 0.1 to 100 µm in diameter and are uniformly dispersed in a solvent where they swell. NGs are even smaller, typically sized between 10 and 100 nm. Unlike bulk hydrogels, MGs and NGs have a higher surface area exposed to the surrounding medium, allowing them to respond quickly to environmental stimuli such as pH, temperature, or ionic strength. This responsiveness enables them to expand or contract, a feature that solid particles lack due to their rigidity and limited interaction with solvents [ 37 While NGs are often spherical, their shape can vary depending on the synthesis method and polymer architecture. For example, star-shaped NGs can be formed from polymers with multiple arms connected to a central core [ 38 Their versatility in biomedical applications—ranging from drug delivery to tissue engineering—is largely attributed to their tunable physicochemical properties. A comprehensive classification framework is essential for understanding their design, functionality, and therapeutic potential [ 39 Scheme 1 2.1. Based on Origin of Polymers The origin of the polymers used in NG/MGs synthesis plays a critical role in determining their physicochemical properties, biocompatibility, and suitability for biomedical applications. These polymers are broadly classified into natural, synthetic, and hybrid sources, each offering distinct advantages and limitations [ 41 42 2.1.1. Natural and Hybrid Polymer NG/MGs Natural polymer gels are made from biopolymers commonly found in living organisms, such as polysaccharides (e.g., xanthan gum, alginate, starch, chitosan), proteins (e.g., fibrin, collagen, gelatin), and polynucleotides [ 43 44 45 46 45 47 48 2.1.2. Synthetic Polymer NG/MGs Synthetic polymer gels are engineered materials known for their tunable mechanical properties and controlled degradation behavior, making them suitable for a wide range of applications in biomedicine, materials science, and engineering [ 49 50 51 52 53 54 55 53 56 57 2.2. Based on Crosslinking Mechanism The crosslinking mechanism is a fundamental criterion in the classification of polymeric NG/MGs, as it directly influences their structural integrity, responsiveness to environmental stimuli, and suitability for various biomedical applications. Crosslinking refers to the process by which polymer chains are interconnected to form a three-dimensional network, and it can occur through either physical or chemical interactions [ 58 59 2.2.1. Physically Crosslinked NGs Physically crosslinked NGs are formed through non-covalent interactions such as hydrogen bonding, ionic interactions, hydrophobic forces, and van der Waals associations, which result in reversible and stimuli-responsive networks. These gels are advantageous due to their ease of synthesis, as they do not require chemical crosslinkers, thereby minimizing residual toxicity. Their dynamic nature allows them to respond to environmental changes like pH, temperature, or solvent composition, making them ideal for applications in drug delivery, diagnostics, and biomedical devices [ 17 18 60 61 62 63 64 2.2.2. Chemically Crosslinked NGs In contrast, chemically crosslinked NGs are formed through covalent bonding between polymer chains, resulting in permanent, robust networks with controlled degradation and long-term stability. These gels are typically synthesized via methods such as addition or condensation polymerization, photopolymerization, and radiation-induced crosslinking, which can occur under mild conditions without added crosslinkers [ 65 17 66 67 68 69 70 2.3. Based on Polymeric Composition Micro/NGs can be synthesized using various polymeric strategies, each offering distinct structural and functional attributes that influence their mechanical properties, responsiveness to stimuli, and compatibility with biological systems. These strategies are broadly categorized into homopolymeric, copolymeric, and interpenetrating polymer networks (IPNs), each with unique advantages for biomedical applications. Micro/NGs can be synthesized using various polymeric strategies, each offering distinct structural and functional attributes that influence their mechanical properties, responsiveness to stimuli, and compatibility with biological systems. These strategies are broadly categorized into homopolymeric, copolymeric, and interpenetrating polymer networks (IPNs), each with unique advantages for biomedical applications. 2.3.1. Homopolymeric NG/MGs Homopolymeric micro- and NGs are made from a single type of monomer. Depending on how the monomers are arranged during polymerization, the resulting gel networks can vary in structure and properties. For example, block sequences group monomers into distinct segments, which may lead to phase separation within the gel. Alternating sequences arrange monomers in a regular pattern, influencing mechanical strength and swelling behavior. Random sequences, on the other hand, distribute monomers without a fixed order, resulting in more heterogeneous networks. These gels are relatively simple in design and are often chosen when uniform chemical functionality is needed, such as in basic drug delivery systems or biosensors [ 70 2.3.2. Copolymeric NG/MGs Copolymers are composed of two or more different monomers, typically including at least one hydrophilic component. This combination allows researchers to fine-tune the physical and chemical properties of the gel. By adjusting the ratio and type of monomers, scientists can control the gel’s hydrophilicity, mechanical strength, degradation rate, and responsiveness to stimuli like pH or temperature. Copolymeric NGs are especially useful in biomedical applications because they offer greater flexibility in design. They can be engineered to carry specific drugs, respond to environmental changes, or interact with biological targets, making them ideal for targeted and controlled drug delivery [ 15 16 71 72 2.3.3. Multipolymer Interpenetrating Polymer Networks (IPNs) Interpenetrating polymer networks (IPNs) are more complex structures formed by combining two or more polymer networks. Typically, one network is chemically crosslinked, while the other remains linear or loosely associated. These networks are physically intertwined but not covalently bonded. IPNs can be made from synthetic, natural, or hybrid polymers, and their unique architecture provides enhanced mechanical strength and multifunctionality. The combination of different polymers allows IPNs to respond more effectively to environmental stimuli such as changes in pH or temperature. Because of their structural complexity and adaptability, IPNs are widely used in tissue engineering and advanced drug delivery systems [ 11 73 74 2.4. Based on Physical Appearance The internal structure of micro- and NGs plays a key role in how they behave in solution and interact with biological systems. Based on their physical appearance, these gels can be categorized as amorphous, semicrystalline, or crystalline [ 75 2.5. Based on Electrical Charge of the Network The electrical charge of a gel’s polymer network significantly affects its interaction with biological molecules, membranes, and external stimuli. Micro- and NGs can be neutral, ionic, amphoteric, or zwitterionic [ 75 Amphoteric gels contain both acidic and basic functional groups, allowing them to respond dynamically to changes in pH. This makes them particularly useful in environments where pH fluctuates, such as inflamed tissues or tumor sites. Zwitterionic gels are unique in that each repeating unit contains both positive and negative charges, resulting in an overall neutral charge. These gels are highly biocompatible and resistant to protein adsorption, making them ideal for implantable devices and biosensors. 2.6. Based on Responsiveness to Stimuli Stimulus-responsive micro/NGs are designed to remain stable under normal physiological conditions but undergo controlled changes in response to specific external triggers. This property is particularly valuable in drug delivery, where NGs must circulate intact in the bloodstream and release their payload only at targeted sites. These stimuli can be physical (e.g., temperature, light, ultrasound, magnetic or electric fields, pressure), chemical (e.g., pH, redox potential), or biological (e.g., enzymes, biomolecules) [ 76 77 Figure 2 78 2.6.1. Physical Stimulus-Responsiveness NG/MGs can be engineered to respond to various physical stimuli, enabling precise control over drug release and therapeutic action. Temperature-responsive NGs exhibit a volume phase transition temperature (VPTT), where their size changes due to altered interactions among polymer chains and solvents. These NGs are classified based on their response direction: those with a lower critical solution temperature (LCST) shrink above a threshold, while those with an upper critical solution temperature (UCST) swell when heated. Materials like PNIPAM, PNVCL, and Pluronic copolymers are commonly used to engineer such systems [ 77 79 80 81 82 83 84 85 86 87 88 76 77 89 89 90 91 92 77 93 94 95 96 97 98 99 100 2.6.2. Chemical Stimulus-Responsive Micro/NGs Stimulus-responsive NGs can be engineered to react to specific chemical or biological signals, enabling controlled structural changes and functional responses. Among chemical triggers, pH-responsiveness is one of the most widely studied. NGs designed with pH-sensitive polymers respond to environmental pH shifts through mechanisms such as protonation/deprotonation or cleavage of acid-labile bonds like hydrazone, imine, oxime, acetal, and ketal [ 101 102 69 95 77 103 104 105 2 2 105 106 7 2.6.3. Biological Stimulus-Responsive Micro/NGs Biological stimuli play a crucial role in the design of smart micro/NGs, enabling them to respond selectively to specific biochemical signals present in pathological environments. These stimuli include enzymes, biomolecules (such as glucose, ATP, and reactive oxygen species), and cellular conditions that are often dysregulated in diseases like cancer, inflammation, and infections. By incorporating biologically sensitive moieties into their polymer networks, NGs can undergo structural or chemical transformations that trigger drug release, change surface properties, or activate therapeutic functions. Enzyme-sensitive NGs are designed with substrates or analogues that can be cleaved by specific enzymes, leading to structural changes and functional activation. Enzymes such as matrix metalloproteinases (MMPs), trypsin, phosphatases, and elastases have been used to trigger responses in NGs for drug release or biosensing applications [ 107 108 109 110 111 112 113 114 105 106 2 2 1 2 115 116 117 118 119 120 121 2.7. Based on Structural Architecture The internal structure of gel particles is influenced by factors such as the choice of monomers, crosslinkers, and the kinetics of particle formation, which together determine the segment density and spatial organization within the gel. Even when composed of homopolymers, these variables can lead to diverse architectural configurations. Table 1 3. Synthesis and Characterization of Micro/NGs 3.1. Synthesis Methods MGs and NGs are synthesized through either chemical or physical crosslinking of hydrophilic polymers, each offering distinct structural and functional properties. Physical crosslinking relies on reversible, non-covalent interactions such as ionic, hydrophobic, and hydrogen bonding forces, enabling responsiveness to environmental stimuli and biodegradability—features particularly valuable for drug, protein, or cell encapsulation and release. In contrast, chemically crosslinked gels are formed via covalent bonds, providing enhanced structural stability and typically requiring crosslinking agents [ 131 132 133 Effective synthesis of micro/NGs demands precise control over particle size distribution, functional group placement, and colloidal stability [ 131 132 131 132 134 135 NGs follow similar principles but are often tailored for biomedical applications, where dispersion stability is critical. Their synthesis is generally categorized into crosslinking polymerization—using monomers and crosslinkers—and crosslinking of polymer precursors, such as amphiphilic or reactive polymers capable of self-assembly. Additional techniques include physical self-assembly in aqueous media, forming NGs through hydrogen bonding, van der Waals forces, and electrostatic interactions, and template-assisted fabrication using photolithography or micromolding, which enables precise particle design [ 136 137 138 139 140 A particularly clean and efficient method involves ionizing radiation, such as gamma rays or fast electron beams, which initiate intramolecular crosslinking in water-soluble polymers without the need for monomers, surfactants, or crosslinking agents—thus eliminating purification steps [ 136 141 136 141 142 143 Table 2 3.2. Comparative Evaluation of NG/MGs Synthesis Techniques NG/MGs synthesis methods vary widely in their mechanisms, scalability, and compatibility with different polymer types. Among these, inverse microemulsion polymerization and radiation-induced polymerization are particularly noteworthy due to their unique advantages and limitations. 3.2.1. NGs Fabrication by Inverse Microemulsion Inverse microemulsion polymerization confines free-radical polymerization within nanometer-sized aqueous droplets dispersed in a continuous oil phase, stabilized by surfactants and co-surfactants. These droplets act as nanoreactors, and their size—and thus NG diameter—can be tuned by adjusting the water-to-surfactant ratio (W 0 154 155 156 157 158 156 157 156 155 8 157 158 However, limitations remain, such as (i) surfactant removal challenges requiring extensive dialysis or ultrafiltration, (ii) scale-up limitations due to microemulsion stability and phase separation, and (iii) restricted monomer scope favoring water-soluble vinyl monomers [ 155 156 3.2.2. Radiation-Induced Polymerization Radiation-induced polymerization utilizes ionizing radiation sources, including gamma rays, electron beams, or X-rays, to initiate polymerization and crosslinking processes without the need for chemical initiators. Radiolysis of water generates reactive species (e.g., hydroxyl radicals, hydrated electrons) that initiate and propagate polymer chains. The absorbed dose and dose rate determine crosslink density, NG size, and swelling behavior [ 159 160 161 160 162 12 162 9 12 161 However, limitations include (i) dependence on specialized facilities for gamma or electron-beam irradiation, (ii) payload radiosensitivity, which may lead to degradation of proteins or nucleic acids, and (iii) polymer specificity, favoring radiation-sensitive backbones or vinyl-functionalized polymers [ 12 161 3.2.3. Comparative Perspective and Design Guidance Inverse microemulsion polymerization is preferred when precise size control (20–200 nm) and high loading of hydrophilic therapeutics are critical, provided that surfactant removal and batch processing are acceptable [ 157 158 12 161 Table 3 3.2.4. Practical Parameter Windows To achieve reproducible and application-specific NG properties, both inverse microemulsion polymerization and radiation-induced polymerization require careful control of key synthesis parameters. These parameters influence droplet stability, crosslinking behavior, responsiveness, and ultimately the scalability and functionality of the resulting NGs. In inverse microemulsion polymerization, critical factors include the water-to-surfactant ratio (W 0 156 157 In radiation-induced polymerization, the absorbed dose (kGy) and dose rate are key determinants of crosslink density and NG size. Maintaining the polymer concentration within the dilute-to-semi-dilute regime favors intramolecular crosslinking, which is essential for forming discrete NGs and avoiding undesirable bulk gelation [ 160 161 A comparative overview of the scalability and application relevance of these two techniques is presented in Table 4 3.2.5. Strategic Selection Based on Application The choice between inverse microemulsion polymerization and radiation-induced polymerization depends on the intended application, processing constraints, and regulatory considerations. For precision drug delivery, where tight size control (20–200 nm) and high encapsulation efficiency of hydrophilic therapeutics are critical, inverse microemulsion polymerization is generally preferred [ 157 158 0 156 158 156 160 In contrast, radiation-induced polymerization offers a cleaner, initiator-free synthesis route with built-in sterilization, making it particularly attractive for clinical translation and large-scale manufacturing [ 162 12 162 9 Overall, inverse microemulsion polymerization is strategically suited for customized NG systems in research and early-stage development, while radiation-induced polymerization provides a regulatory-friendly, scalable pathway for clinical-grade products, particularly in applications demanding sterility and high purity, such as injectable drug delivery systems and tissue engineering scaffolds. 3.3. Tools and Techniques for Characterizing NG/MGs A wide array of analytical techniques is employed to investigate the size, structure, composition, behavior, and appearance of metal nanoparticle-based NG/MGs. These methods are essential for distinguishing NG/MGs from their corresponding smart NG/MGs and for understanding their physicochemical properties. Figure 3 3.3.1. Chemical Functionalities Fourier-transform infrared spectroscopy (FTIR), shown in Figure 3 1 X-ray diffraction (XRD), depicted in Figure 3 Thermal stability and decomposition behavior are assessed using thermogravimetric analysis (TGA), differential scanning calorimetry (DSC), and differential mechanical analysis (DMA). TGA, shown in Figure 3 Energy-dispersive spectroscopy (EDS), illustrated in Figure 3 Optical techniques such as UV-Visible/NIR spectroscopy ( Figure 3 3.3.2. Morphological Characterization Scanning Electron Microscopy (SEM) and Transmission Electron Microscopy (TEM) are essential for visualizing particle morphology. SEM provides 3D-like surface images with high depth of field, useful for examining topography and aggregation. TEM offers high-resolution 2D images of internal structures and compartments. Figure 4 Atomic Force Microscopy (AFM) is used to analyze surface roughness, particle height, and mechanical properties such as stiffness. It operates by scanning a sharp probe across the sample surface and measuring interaction forces. Phase imaging modes allow for the detection of chemical heterogeneity. Fluorescence Microscopy enables visualization of the spatial distribution within NGs/MGs. It can distinguish layers or compartments using fluorescent dyes or intrinsic fluorescence, revealing complex internal structures. 3.3.3. Particle Size and Size Distribution Dynamic Light Scattering (DLS) is a non-invasive technique that measures particle size based on light scattering caused by Brownian motion. It provides the hydrodynamic diameter, which includes both the particle and its surrounding solvent shell. This value is typically larger than the size measured by SEM or TEM, which observes particles in a collapsed or dried state. Figure 4 Figure 4 DLS is also used to assess size distribution and detect aggregates. The polydispersity index (PDI) derived from DLS reflects the uniformity of particle sizes. A PDI below 0.5 indicates a narrow distribution, while values above 0.7 suggest significant heterogeneity, as shown in Figure 4 3.3.4. Macroscopic Properties Although NGs and MGs are nano-/microscale materials, they exhibit macroscopic behaviors that are observable and relevant to their practical applications. These include turbidity, swelling, viscosity, and rheological behavior. Turbidity and Swelling Behavior The swelling behavior of NGs/MGs is governed by interactions among polymer chains, solvent molecules, and ionic species. Figure 4 Figure 5 Rheological Properties Rheological behavior reflects how NGs/MGs respond to mechanical stress. At low concentrations, particles are dispersed and exhibit viscous behavior. As concentration increases, physical interactions intensify, leading to viscoelastic behavior—a combination of fluid-like and solid-like properties. This transition is marked by increases in viscosity and modulus, indicating greater stiffness and resistance to deformation. Figure 5 Figure 5 Figure 5 3.4. Limitations of Common NG/MGs Characterization Techniques Accurate characterization of NG/MGs is essential for understanding their physicochemical properties, optimizing formulation strategies, and ensuring reproducibility in biomedical applications. A wide array of analytical techniques is employed to assess particle size, morphology, chemical composition, and mechanical behavior. However, each method has inherent limitations that must be critically considered to avoid misinterpretation of data. Dynamic Light Scattering (DLS) is one of the most commonly used techniques for estimating the hydrodynamic diameter of particles based on Brownian motion. While DLS is rapid and non-invasive, it is highly sensitive to the presence of aggregates. Even minor aggregation can lead to significant overestimation of particle size and polydispersity index (PDI), potentially misrepresenting the true size distribution of the sample [ 58 169 174 175 Scanning Electron Microscopy (SEM) and Transmission Electron Microscopy (TEM) offer high-resolution imaging of particle morphology and internal structure. However, these techniques require extensive sample preparation, including drying, staining, and exposure to vacuum conditions. Such steps can introduce artifacts like shrinkage, deformation, or aggregation, which may not reflect the native hydrated state of NGs [ 167 169 To overcome these limitations, complementary techniques such as Atomic Force Microscopy (AFM), Cryo-TEM, and nanoparticle tracking analysis (NTA) are often employed. AFM enables imaging under ambient conditions without vacuum or staining, preserving hydrated morphology. Cryo-TEM allows visualization of NGs in their frozen hydrated state, minimizing structural distortion. Nevertheless, AFM is limited by its small scan area and slow imaging speed, making it less suitable for statistically representative sampling [ 176 Other characterization methods also present specific challenges. Fourier Transform Infrared Spectroscopy (FTIR) is widely used to identify functional groups, but overlapping peaks and low sensitivity to minor chemical changes can hinder precise interpretation [ 58 175 169 171 In summary, no single technique can comprehensively characterize NG/MGs. A multi-technique strategy, combining complementary methods and careful experimental design, is crucial for obtaining accurate, reproducible, and physiologically relevant data. 4. Applications of Nano/Microgels (NG/MG) for Drug Delivery 4.1. Limitations, Translational Barriers, and Comparative Performance of Conventional Nanocarriers Despite the growing interest in nanocarrier-based drug delivery systems, several translational barriers continue to hinder their clinical success [ 177 178 Dendrimers, with their hyperbranched architecture, offer precise molecular design and high drug-loading capacity. They can encapsulate small molecules and even nanoparticles [ 179 180 181 182 183 184 185 Polymeric micelles, formed from amphiphilic block copolymers, are commonly used to solubilize hydrophobic drugs [ 186 187 4.2. Therapeutic Versatility and Barrier-Penetrating Capabilities of Nano/Microgels (NG/MGs) In contrast, nano/microgels (NG/MGs) offer a versatile and robust platform that addresses many of the limitations faced by traditional nanocarriers. Their high water content enables efficient encapsulation of hydrophilic biomacromolecules, such as proteins, DNA, and RNA, while their internal hydrophobic domains allow for the loading of hydrophobic drugs [ 188 189 190 191 NG/MGs also exhibit stimulus-responsive behavior, enabling site-specific and controlled drug release in response to environmental cues such as pH, temperature, and redox conditions [ 21 192 193 194 The effectiveness of NGs in drug delivery is often challenged by physiological barriers, which vary depending on the route of administration [ 195 196 197 197 20 20 197 4.2.1. Crossing the Blood–Brain Barrier The BBB, composed of tightly joined endothelial cells, restricts the entry of most molecules into the CNS, posing a significant obstacle for treating neurological disorders [ 20 20 A notable example is the development of a near-infrared (NIR) responsive biomimetic NG system, ARNGs@TMZ/ICG, designed by Zhang et al. for glioblastoma multiforme (GBM) therapy [ 198 Figure 6 The NGs were loaded with two key agents: indocyanine green (ICG), a near-infrared (NIR) photosensitizer approved by the FDA, and temozolomide (TMZ), a standard chemotherapy drug for glioblastoma multiforme (GBM). This dual-loaded formulation, referred to as NGs@TMZ/ICG, was further coated with erythrocyte membranes modified with apolipoprotein E (ApoE) peptides. The ApoE decoration enhances circulation time in the bloodstream and facilitates targeted delivery to brain tumors by interacting with receptors overexpressed on both BBB endothelial cells and GBM cells. Once the NGs accumulate in the tumor site following intravenous administration, NIR light is applied externally to activate the system. The light triggers ICG to produce ROS, which causes the NG structure to degrade and release both TMZ and ICG. This controlled release mechanism promotes deeper penetration into the tumor tissue and enhances the therapeutic effect through a combination of photodynamic therapy and chemotherapy. In preclinical models, this NIR-responsive NG system demonstrated significant tumor suppression in mice with orthotopic GBM, highlighting its potential as a promising strategy for targeted brain cancer treatment. 4.2.2. Ophthalmic Drug Delivery Ophthalmic disorders such as cataracts, infections, glaucoma, and dry eye syndrome are increasingly prevalent [ 199 200 201 200 An innovative approach was demonstrated by Wang et al., who developed therapeutic contact lenses embedded with NGs for sustained ophthalmic drug delivery [ 200 Figure 7 NG/MGs, with their tunable synthesis, surface modification capabilities, and diverse administration routes, offer a robust platform for overcoming physiological barriers in drug delivery. Their successful application across various disease models underscores their potential in advancing therapeutic strategies for complex conditions. 4.2.3. Cancer Therapy Delivery of Small Molecules for Cancer Therapy Using NGs Chemotherapy has long been a cornerstone of cancer treatment, and more recently, phototherapy has emerged as a complementary approach. Both strategies rely heavily on small molecules—chemotherapeutic agents like doxorubicin (DOX) and paclitaxel (PTX) [ 22 202 203 204 205 206 207 208 209 210 211 To address these limitations, NG-based drug delivery systems have been developed to enhance drug efficacy and reduce toxicity [ 211 22 212 213 214 215 A notable example is the hypoxia-responsive NG developed by She et al., known as HPMPC NG [ 22 Figure 8 Beyond chemotherapy, NGs are also used to deliver photosensitizers and photothermal agents via intravenous routes [ 216 217 218 219 220 221 222 218 Figure 9 Given the complexity and heterogeneity of tumors, single-drug therapies often fall short, leading to incomplete tumor eradication and recurrence [ 219 223 224 202 Figure 10 In summary, NGs offer a highly adaptable platform for small-molecule delivery in cancer therapy. Their ability to improve drug stability, target specific tissues, and enable combination treatments makes them a promising tool for advancing cancer care. Delivery of Biomacromolecules for Cancer Therapy Using NGs Beyond small-molecule drugs, NGs have also been employed to deliver biomacromolecules—such as proteins and nucleic acids—for cancer treatment. These macromolecular therapeutics often offer greater specificity and reduced toxicity compared to traditional chemotherapeutics [ 202 Protein drugs can act either outside or inside cells. While extracellular proteins are more commonly used clinically, intracellular proteins require delivery systems capable of crossing cell membranes, protecting the proteins from enzymatic degradation, and releasing them in the correct cellular compartment [ 225 226 227 228 229 230 231 232 233 234 226 226 Figure 11 Another innovative system involved neutrophil-inspired NGs carrying two enzymes—superoxide dismutase (SOD) and chloroperoxidase (CPO)—to elevate reactive oxygen species (ROS) levels inside cancer cells [ 229 Figure 12 · 2 NGs have also been widely explored for gene therapy, delivering various nucleic acids such as plasmid DNA (pDNA) [ 229 235 236 237 238 239 240 241 242 Figure 13 In another example, siRNAs were incorporated into NGs by hybridizing with brush-like DNA-grafted polymers, forming the crosslinked structure of the gel [ 242 243 Figure 14 Additionally, miRNA-loaded NGs have been designed to modulate immune responses. Gao et al. created a virus-mimicking NG system called Vir-Gel, which encapsulated miR-155 to reprogram tumor-associated microglia and macrophages from a pro-tumor (M2) to an anti-tumor (M1) phenotype [ 238 Figure 15 NGs offer a powerful and flexible platform for delivering biomacromolecules in cancer therapy. Their ability to protect sensitive molecules, target specific cells, and respond to intracellular conditions makes them ideal for advancing protein- and gene-based treatments. As research progresses, the diversity of nucleic acids and proteins that can be delivered using NGs continues to expand, broadening their therapeutic potential. NGs as Multifunctional Platforms for Cancer Therapy Cancer remains one of the most challenging diseases due to its complexity, heterogeneity, and resistance to treatment. To improve therapeutic outcomes while minimizing side effects, researchers have developed NG platforms capable of delivering multiple therapeutic agents or combining different treatment modalities. These platforms can carry not only small molecules and biomacromolecules but also nanoparticles, enabling a wide range of combination therapies [ 244 245 246 247 248 249 234 239 240 241 242 243 244 245 246 247 248 249 250 251 252 253 254 255 256 257 Figure 16 258 259 260 261 262 263 264 265 Multidrug resistance in cancer is often driven by factors like drug efflux transporters (DETs) and anti-apoptotic proteins [ 266 267 254 Figure 17 In another study, a self-traceable nanoreservoir called Gem/Cip@SiPNG@HA was designed to treat bacterium-associated tumors [ 258 Figure 18 258 Some NGs are designed not only for therapy but also for diagnosis, making them powerful theranostic platforms. These systems can simultaneously deliver therapeutic agents and enable imaging or monitoring of disease progression [ 190 268 269 270 271 272 273 274 235 275 276 190 Figure 18 1 2 Beyond theranostics, NGs can be engineered for precision medicine, where their structure and surface chemistry are tailored to match specific therapeutic needs. Their ability to encapsulate a wide range of materials—regardless of size, charge, or hydrophobicity—makes them ideal for customized drug delivery [ 191 277 278 191 Figure 19 Another example comes from the Peppas group, who created a tunable NG platform using poly(acrylamide-co-methacrylic acid) [P(AAm-co-MAA)] ( Figure 19 278 These features allowed the NGs to deliver multiple drugs, respond to tumor-specific stimuli, and support combination therapies—all essential for personalized cancer treatment. NGs are emerging as multifunctional platforms that bridge therapy, diagnostics, and precision medicine. Their tunable chemistry, responsiveness to biological environments, and compatibility with diverse therapeutic agents make them ideal candidates for next-generation cancer treatment strategies. NGs as Cancer Vaccines and Synthetic Antibodies Vaccination is a well-established method for preventing and treating diseases by stimulating the immune system with antigens derived from pathogens or their subunits [ 222 279 280 281 In the immune response, extracellular antigens are processed by antigen-presenting cells (APCs) and presented via MHC class II molecules to activate CD4 + 281 + 281 282 283 268 273 284 285 279 286 287 288 288 Figure 20 NGs can also deliver nucleic acids that encode TAAs. For instance, plasmid DNA gp100, used to treat metastatic melanoma, was encapsulated in an Alg-Tat-gp100 NG composed of alginate and Tat peptide [ 241 Figure 20 Beyond vaccines, NGs can function as synthetic antibodies through molecular imprinting. These molecularly imprinted polymer (MIP) NGs are created by polymerizing around a template molecule (e.g., an antigen), which is later removed to leave specific recognition sites [ 289 290 291 291 Figure 21 NGs offer a versatile platform for cancer immunotherapy, functioning as both vaccines and synthetic antibodies. Their ability to deliver antigens or genetic material, target immune cells, and stimulate robust immune responses makes them promising tools for next-generation cancer treatments. NGs for Anti-Inflammatory Therapy NGs have emerged as promising carriers for delivering a wide range of anti-inflammatory agents, including antibiotics [ 292 293 26 26 26 23 294 295 Many inflammatory diseases are linked to immune system dysfunction. For example: inflammatory bowel disease (IBD) [ 295 296 297 298 299 300 301 Beyond chemotherapeutic agents, nanogels have also been employed for the delivery of nucleic acids to help mitigate inflammatory responses. For instance, Yavvari et al. developed an NG for oral delivery of PIAS1-encoded DNA to treat IBD [ 26 302 Figure 22 303 304 305 NGs are also effective against bacterial-induced inflammation. They can deliver antibiotics and enhance their antimicrobial activity [ 24 309 310 311 312 E. coli C. reinhardtii 311 306 Figure 22 S. aureus E. coli Besides antibiotics and photothermal agents, NGs can incorporate metal ions like Zn 2+ 306 2+ 110 309 313 314 2+ 314 307 Figure 22 Biofilms represent a protective mode of bacterial growth, where bacteria are embedded in a matrix of extracellular polymeric substances (EPS), including polysaccharides, proteins, lipids, and nucleic acids [ 315 Pseudomonas aeruginosa 316 292 293 317 318 319 320 293 Figure 22 Like cancer therapy, biofilm treatment can benefit from multimodal NG platforms that combine different therapeutic agents. For instance, Cai et al. developed a carbon monoxide (CO)-enhanced NG system called ICG&CO@G3KBPY, which integrates photothermal therapy (PTT), photodynamic therapy (PDT), and gas therapy [ 308 Figure 22 5 NGs for Antidiabetic Therapy Diabetes mellitus is a chronic metabolic disorder characterized by elevated blood glucose levels (BGLs), which significantly impacts patients’ quality of life [ 308 308 NGs, known for their excellent protein-loading capacity and biocompatibility, have been explored as carriers for insulin delivery [ 321 322 323 324 323 Traditional insulin injections cannot fully mimic the natural secretion pattern of insulin, which includes both steady release and post-meal bursts [ 29 322 2+ 324 Figure 23 Another approach involved using glucose oxidase (GOx). Li et al. developed a dual-responsive NG containing mPEGA, AHMDM (a glucose- and H 2 2 321 2 2 NGs for Antiviral Therapy Throughout history, viral infections have caused numerous global health crises. Notable examples include the COVID-19 pandemic caused by SARS-CoV-2 [ 321 325 326 327 328 328 329 330 331 332 333 291 334 335 329 330 330 To overcome these limitations, Warren et al. designed a biodegradable cationic NG composed of cholesterol-modified epsilon-polylysine (CEPL) and a peptide linker that targets the ApoE receptor, facilitating CNS delivery [ 330 NGs are increasingly being explored as platforms for virus prevention and treatment, particularly in the development of vaccines and synthetic antibodies [ 336 337 338 339 337 340 340 In another example, Chen et al. designed a redox-responsive NG containing the receptor-binding domain (RBD) of the SARS-CoV-2 spike protein, a key antigen for COVID-19 vaccines [ 338 Figure 24 The RBD was crosslinked using disulfide-containing linkers to form S-RBD-NG, a pro-antigen nanoparticle with improved lymph node targeting and enhanced uptake by dendritic cells (DCs) and macrophages. Upon internalization, the NG degraded in response to intracellular redox conditions, releasing RBD monomers and triggering strong immune responses. This strategy demonstrated the potential of NGs in next-generation COVID-19 vaccine development. NGs can also be engineered to mimic antibodies, either through molecular imprinting or ligand-receptor interactions. Molecularly imprinted polymer (MIP) NGs, also known as synthetic antibodies, are created by polymerizing around a target epitope, then removing the template to leave specific binding sites [ 291 334 335 341 289 335 NGs offer a versatile platform for antiviral vaccines and synthetic antibody development, capable of enhancing immune responses, targeting lymph nodes, and blocking viral entry. Their adaptability and multifunctionality make them promising candidates for future virus prevention and treatment strategies. Beyond their established roles in cancer, inflammation, diabetes, and viral infections, NGs have shown promise in a variety of other therapeutic areas, including anticoagulation, liver fibrosis, neurodegenerative diseases, immune modulation, pain relief, and even blood transfusion compatibility [ 342 343 344 345 346 347 348 349 350 Anticoagulant and Thrombolytic Therapy Blood clot formation can lead to life-threatening conditions. To address this, Xu et al. developed thrombin-responsive NGs (HV/ctNGs) for targeted delivery of recombinant hirudin variant 3 (HV), a potent thrombin inhibitor [ 343 Figure 25 Metabolic syndrome, which includes conditions like insulin resistance, obesity, and chronic inflammation, is a growing global health concern [ 351 352 353 281 354 355 356 NGs have been explored as promising tools in the context of blood transfusion. To address the challenge of blood type incompatibility, Jiang et al. created molecularly imprinted NGs (MIgels) using blood group B antigens as templates [ 357 Figure 26 NGs continue to expand their therapeutic potential across diverse medical fields. From anticoagulation and metabolic regulation to blood compatibility and neuroimmune modulation, their versatility, responsiveness, and biocompatibility make them promising candidates for next-generation biomedical applications. 5. Emerging Innovations and Clinical Translation in NG/MGs Technologies The field of NG/MG technologies is rapidly evolving, driven by interdisciplinary advances in polymer chemistry, nanotechnology, biomedical engineering, and computational modeling. These soft, tunable materials are increasingly recognized as intelligent platforms capable of integrating therapeutic delivery, diagnostic imaging, and real-time physiological monitoring. As research progresses, several emerging trends are shaping the future of NG-based systems. 5.1. Multifunctionality and Theranostic Applications NGs are increasingly being recognized not merely as drug carriers but as multifunctional platforms capable of integrating therapeutic delivery, diagnostic imaging, and immunomodulation [ 1 358 359 360 361 362 363 364 365 9 366 367 5.2. Immunotherapy and Vaccine Delivery A particularly promising area is the application of NGs in immunotherapy [ 360 368 5.3. Hybrid Nanogels and Functional Integration One significant development is the rise of hybrid NGs, which combine organic polymer networks with inorganic nanomaterials. This integration enhances the functional versatility of NGs, allowing them to serve as multimodal platforms for theranostics, photothermal therapy, and magnetic targeting [ 369 370 371 372 365 373 373 374 375 374 5.4. Personalized Medicine and Smart Diagnostics The integration of NGs into personalized medicine and smart diagnostics represents another exciting frontier [ 376 377 366 5.5. Clinical Translation Challenges and Microfluidic Solutions Despite the promising therapeutic potential of NG/MGs, their clinical translation faces several challenges, particularly in scalability, reproducibility, and long-term stability [ 364 365 5.5.1. Reproducibility and Regulatory Compliance One promising solution is microfluidic synthesis, which enables precise control over reaction parameters such as flow rate, temperature, and mixing conditions. This approach allows for the continuous and reproducible fabrication of NGs with uniform size and composition [ 378 379 33 379 380 381 382 5.5.2. Scalability and Manufacturing Scalability, once considered a limitation of microfluidic systems, is being actively addressed through parallelization and modular reactor designs, enabling production at clinically relevant volumes without compromising quality [ 383 384 385 5.5.3. Long-Term Stability In terms of long-term stability, strategies such as lyophilization with cryoprotectants, incorporation of stabilizing agents, and surface modification with hydrophilic polymers like PEG have been shown to improve shelf-life and maintain functional integrity [ 386 387 388 6. Conclusions 6.1. Summary of Key Findings This review has presented a detailed and structured analysis of polymer network-based NG/MGs, emphasizing their architectural diversity, synthesis techniques, and versatile applications in drug delivery and biomedical engineering. By comparing NGs/MGs, we highlighted their distinct advantages—NGs for systemic and intracellular delivery due to their small size, and MGs for localized therapies and tissue scaffolding due to their larger dimensions and mechanical tunability. The review underscores the critical influence of polymer network parameters, such as crosslinking density and porosity, on drug encapsulation efficiency, release behavior, and mechanical properties. Stimuli-responsive systems have emerged as a transformative approach, enabling precise control over drug release and biosensing through responsiveness to environmental triggers. Functionalization strategies, including ligand conjugation, have significantly improved targeting capabilities, allowing NGs to traverse biological barriers and deliver therapeutics to challenging sites like tumors and the brain. Importantly, the integration of hybrid NGs, multifunctional theranostic platforms, and AI-assisted diagnostics is reshaping the landscape of personalized medicine. These innovations demonstrate the growing relevance of NG/MGs in developing smart, adaptive, and patient-specific therapeutic solutions. 6.2. Outlook on Future Research Directions To advance the clinical translation of NG/MG technologies, future research must focus on scalable and reproducible manufacturing methods, such as microfluidics and continuous flow synthesis, which are essential for industrial production and regulatory approval. Harmonizing regulatory frameworks will be crucial to facilitate the transition from bench to bedside. The convergence of NGs with digital health platforms and biosensors opens new possibilities for real-time monitoring and dynamic treatment adjustment. Developing biodegradable and immunologically inert materials will enhance long-term safety and reduce adverse immune responses. Moreover, expanding the application of these systems into emerging therapeutic areas—such as regenerative medicine, immunotherapy, and neurodegenerative disease treatment—will significantly broaden their clinical impact. In conclusion, this review not only consolidates current knowledge but also highlights the strategic importance of NG/MGs in shaping the future of precision medicine. By identifying key challenges and proposing actionable research directions, it serves as a valuable reference for researchers, clinicians, and developers working toward next-generation therapeutic platforms. Disclaimer/Publisher’s Note: Author Contributions Conceptualization: S.C.S., G.A.K.M.R.B. and J.-H.J.; Methodology: S.C.S. and N.B.; Validation: S.C.S., G.A.K.M.R.B. and J.-H.J.; Writing—Original Draft: S.C.S. and N.B.; Writing—Review and Editing: G.A.K.M.R.B. and J.-H.J.; Resources: S.C.S., G.A.K.M.R.B. and J.-H.J.; Supervision: G.A.K.M.R.B. and J.-H.J.; Funding Acquisition: J.-H.J. All authors have read and agreed to the published version of the manuscript. Data Availability Statement No new data were created or analyzed in this study. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: Abbreviation Full Term 5-ALA 5-Aminolevulinic Acid APC Antigen-Presenting Cell ATRP Atom Transfer Radical Polymerization ATP Adenosine Triphosphate AuNPs Gold Nanoparticles BBB Blood–Brain Barrier CC Cytochrome c CHP Cholesterol-bearing Pullulan CLSM Confocal Laser Scanning Microscopy CMC Critical Micelle Concentration Con A Concanavalin A CPO Chloroperoxidase CPT Camptothecin CS Chitosan CTL Cytotoxic T Lymphocyte DC Dendritic Cell Dex Dextran DMA Dynamic Mechanical Analysis DMEM Dulbecco’s Modified Eagle Medium DOX Doxorubicin DSC Differential Scanning Calorimetry DLS Dynamic Light Scattering DNA Deoxyribonucleic Acid ECM Extracellular Matrix EDX/EDS Energy-Dispersive X-ray Spectroscopy EMA European Medicines Agency EPR Enhanced Permeability and Retention FBS Fetal Bovine Serum FDA Food and Drug Administration FTIR Fourier Transform Infrared Spectroscopy GOx Glucose Oxidase GrB Granzyme B GSH Glutathione HA Hyaluronic Acid H&E Hematoxylin and Eosin H 2 2 Hydrogen Peroxide HPLC High-Performance Liquid Chromatography IC 50 Half Maximal Inhibitory Concentration IBD Inflammatory Bowel Disease ICG Indocyanine Green IMDQ Imidazoquinoline IPN Interpenetrating Polymer Network IVIS In Vivo Imaging System LCST Lower Critical Solution Temperature MG Microgel MHC Major Histocompatibility Complex miRNA MicroRNA MIP Molecularly Imprinted Polymer MPA 2,2-Bis(hydroxymethyl)propionic acid MPN Metal–Phenolic Network MTT 3-(4,5-Dimethylthiazol-2-yl)-2,5-diphenyltetrazolium bromide MTX Methotrexate MW Molecular Weight NETs Neutrophil Extracellular Traps NG Nanogel NIR Near-Infrared NIR-II Second Near-Infrared Window NMR Nuclear Magnetic Resonance NO Nitric Oxide NPs Nanoparticles NTP Nucleoside Triphosphate PAMAM Poly(amidoamine) PAAm Polyacrylamide PAA Poly(acrylic acid) PBS Phosphate-Buffered Saline PBA Phenylboronic Acid PCL Polycaprolactone PDT Photodynamic Therapy PEG Polyethylene Glycol PEG–PLE Poly(ethylene glycol)-poly(L-glutamic acid) PEI Polyethylenimine PHEMA Poly(2-hydroxyethyl methacrylate) PLGA Poly(lactic-co-glycolic acid) PMMA Poly(methyl methacrylate) PNIPAM Poly(N-isopropylacrylamide) PNVCL Poly(N-vinylcaprolactam) PpIX Protoporphyrin IX PspA Pneumococcal Surface Protein A PTT Photothermal Therapy PVA Polyvinyl Alcohol PVP Polyvinylpyrrolidone pDNA Plasmid DNA PDI Polydispersity Index RA Rheumatoid Arthritis RAFT Reversible Addition–Fragmentation Chain Transfer RAR Retinoic Acid Receptor RBD Receptor-Binding Domain RES Reticuloendothelial System RGD Arginine-Glycine-Aspartic Acid RNA Ribonucleic Acid ROS Reactive Oxygen Species RPM Revolutions Per Minute RSV Respiratory Syncytial Virus RT Room Temperature SCI Spinal Cord Injury SEM Scanning Electron Microscopy SiNDs Silicon Nanodots siRNA Small Interfering RNA SOD Superoxide Dismutase TAA Tumor-Associated Antigen TEM Transmission Electron Microscopy TGA Thermogravimetric Analysis TLR Toll-like Receptor TME Tumor Microenvironment TMZ Temozolomide TPZ Tirapazamine UV-Vis Ultraviolet–Visible Spectroscopy VPTT Volume Phase Transition Temperature XRD X-ray Diffraction NG/MG Nanogel/Microgel References 1. Javaid A. Malik N.S. Tulain U.R. Mahmood A. Khan M.F.A. Akram S. Jabeen A. Hussain S. Nanogels as Multifunctional Platforms: From Drug Delivery to Gene Therapy Polym. Bull. 2025 10.1007/s00289-025-05939-5 2. Manimaran V. Nivetha R.P. Tamilanban T. Narayanan J. Vetriselvan S. Fuloria N.K. Chinni S.V. Sekar M. Fuloria S. Wong L.S. Nanogels as Novel Drug Nanocarriers for CNS Drug Delivery Front. Mol. Biosci. 2023 10 1232109 10.3389/fmolb.2023.1232109 37621994 PMC10446842 3. Fan M. Si J. Xu X. Chen L. Chen J. Yang C. Zhu J. Wu L. Tian J. Chen X. A Versatile Chitosan Nanogel Capable of Generating AgNPs In-Situ and Long-Acting Slow-Release of Ag+ for Highly Efficient Antibacterial Carbohydr. Polym. 2021 257 117636 10.1016/j.carbpol.2021.117636 33541661 4. Hesan M. Gholipour-Kanani A. Lotfi M. Shafiee M. The Synthesis and Characterization of Core-Shell Nanogels Based on Alginate and Chitosan for the Controlled Delivery of Mupirocin Biochem. Eng. J. 2023 190 108742 10.1016/j.bej.2022.108742 5. Pillarisetti S. Vijayan V. Rangasamy J. Bardhan R. Uthaman S. Park I.K. A Multi-Stimuli Responsive Alginate Nanogel for Anticancer Chemo-Photodynamic Therapy J. Ind. Eng. Chem. 2023 123 361 370 10.1016/j.jiec.2023.03.053 6. Byeon J.H. Kang Y.R. Chang Y.H. Physicochemical and in Vitro Digestion Properties of Gelatin/Low-Methoxyl Pectin Synbiotic Microgels Co-Encapsulating Lacticaseibacillus casei Food Hydrocoll. 2023 142 108757 10.1016/j.foodhyd.2023.108757 7. Fu Y. Jang M.S. Liu C. Lee J.H. Li Y. Yang H.Y. Hypoxia-Responsive Hyaluronic Acid Nanogels with Improved Endo/Lysosomal Escape Ability for Tumor-Targeted Cytochrome c Delivery Eur. Polym. J. 2022 173 111259 10.1016/j.eurpolymj.2022.111259 8. Peters J.T. Hutchinson S.S. Lizana N. Verma I. Peppas N.A. Synthesis and Characterization of Poly(N-Isopropyl Methacrylamide) Core/Shell Nanogels for Controlled Release of Chemotherapeutics Chem. Eng. J. 2018 340 58 65 10.1016/j.cej.2018.01.009 9. Basak S. Khare H.A. Roursgaard M. Kempen P.J. Lee J.H. Bazban-Shotorbani S. Kræmer M. Chernyy S. Andresen T.L. Almdal K. Simultaneous Cross-Linking and Cross-Polymerization of Enzyme Responsive Polyethylene Glycol Nanogels in Confined Aqueous Droplets for Reduction of Low-Density Lipoprotein Oxidation Biomacromolecules 2021 22 386 398 10.1021/acs.biomac.0c01238 33125232 10. Du B. Feng S. Wang J. Cao K. Shi Z. Men C. Yu T. Wang S. Huang Y. Collagen-Based Micro/Nanogel Delivery Systems: Manufacturing, Release Mechanisms, and Biomedical Applications Chin. Med. J. 2025 138 1135 1152 10.1097/CM9.0000000000003611 40264376 PMC12091658 11. Silverstein M.S. Interpenetrating Polymer Networks: So Happy Together? Polymer 2020 207 122929 10.1016/j.polymer.2020.122929 12. Chandra S.S. Kim J. Ahmed F. Yang H. Yoon S. Kim W. Ryu T. Lee S. Kim K. Synthesis of Sulfonation Poly( N 2 J. Nanosci. Nanotechnol. 2018 19 1562 1566 10.1166/jnn.2019.16227 30469223 13. Sharma B.K. Singh M. Lokhandwala S. Wagh S. Chowdhury S.R. Ray S. Radiation Processed Emerging Materials for Biomedical Applications Applications of High Energy Radiations: Synthesis and Processing of Polymeric Materials Springer Berlin/Heidelberg, Germany 2023 185 218 10.1007/978-981-19-9048-9_6 14. Katopodi T. Petanidis S. Floros G. Porpodis K. Kosmidis C. Hybrid Nanogel Drug Delivery Systems: Transforming the Tumor Microenvironment through Tumor Tissue Editing Cells 2024 13 908 10.3390/cells13110908 38891040 PMC11171955 15. Hu Y. Wu X.Y. Xu J.R. Self-Assembled Supramolecular Hydrogels Formed by Biodegradable PLA/CS Diblock Copolymers and β-Cyclodextrin for Controlled Dual Drug Delivery Int. J. Biol. Macromol. 2018 108 18 23 10.1016/j.ijbiomac.2017.11.104 29180049 16. Yapar E.A. Inal Ö. Poly(Ethylene Oxide)-Poly(Propylene Oxide)-Based Copolymers for Transdermal Drug Delivery: An Overview Trop. J. Pharm. Res. 2012 11 855 866 10.4314/tjpr.v11i5.20 17. Chen M. Cui Y. Wang Y. Chang C. Triple Physically Cross-Linked Hydrogel Artificial Muscles with High-Stroke and High-Work Capacity Chem. Eng. J. 2023 453 139893 10.1016/j.cej.2022.139893 18. Dong X. Yao F. Jiang L. Liang L. Sun H. He S. Shi M. Guo Z. Yu Q. Yao M. Facile Preparation of a Thermosensitive and Antibiofouling Physically Crosslinked Hydrogel/Powder for Wound Healing J. Mater. Chem. B 2022 10 2215 2229 10.1039/D2TB00027J 35289348 19. Roy A. Manna K. Pal S. Recent Advances in Various Stimuli-Responsive Hydrogels: From Synthetic Designs to Emerging Healthcare Applications Mater. Chem. Front. 2022 6 2338 2385 10.1039/D2QM00469K 20. Cuggino J.C. Blanco E.R.O. Gugliotta L.M. Alvarez Igarzabal C.I. Calderón M. Crossing Biological Barriers with Nanogels to Improve Drug Delivery Performance J. Control. Release 2019 307 221 246 10.1016/j.jconrel.2019.06.005 31175895 21. Xue H. Zhu C. Wang Y. Gu Q. Shao Y. Jin A. Zhang X. Lei L. Li Y. Stimulus-Responsive Cellulose Hydrogels in Biomedical Applications and Challenges Mater. Today Bio 2025 32 101814 10.1016/j.mtbio.2025.101814 PMC12098173 40416785 22. She D. Huang H. Li J. Peng S. Wang H. Yu X. Hypoxia-Degradable Zwitterionic Phosphorylcholine Drug Nanogel for Enhanced Drug Delivery to Glioblastoma Chem. Eng. J. 2021 408 127359 10.1016/j.cej.2020.127359 23. Ma Y. Yang H. Zong X. Wu J. Ji X. Liu W. Yuan P. Chen X. Yang C. Li X. Artificial M2 Macrophages for Disease-Modifying Osteoarthritis Therapeutics Biomaterials 2021 274 120865 10.1016/j.biomaterials.2021.120865 33991950 24. Obuobi S. Julin K. Fredheim E.G.A. Johannessen M. Škalko-Basnet N. Liposomal Delivery of Antibiotic Loaded Nucleic Acid Nanogels with Enhanced Drug Loading and Synergistic Anti-Inflammatory Activity against S. Aureus Intracellular Infections J. Control. Release 2020 324 620 632 10.1016/j.jconrel.2020.06.002 32525012 25. Zhu Q. Chen X. Xu X. Zhang Y. Zhang C. Mo R. Tumor-Specific Self-Degradable Nanogels as Potential Carriers for Systemic Delivery of Anticancer Proteins Adv. Funct. Mater. 2018 28 1707371 10.1002/adfm.201707371 26. Yavvari P.S. Verma P. Mustfa S.A. Pal S. Kumar S. Awasthi A.K. Ahuja V. Srikanth C.V. Srivastava A. Bajaj A. A Nanogel Based Oral Gene Delivery System Targeting SUMOylation Machinery to Combat Gut Inflammation Nanoscale 2019 11 4970 4986 10.1039/C8NR09599J 30839018 27. Xue H. Ding F. Zhang J. Guo Y. Gao X. Feng J. Zhu X. Zhang C. DNA Tetrahedron-Based Nanogels for SiRNA Delivery and Gene Silencing Chem. Commun. 2019 55 4222 4225 10.1039/C9CC00175A 30896698 28. Jiang L. Zhang X. Wang S. Zhang J. Chen J. Lu J. Yao L. Jin W. Li N. Li Q. Functional Monomers Equipped Microgel System for Managing Parkinson’s Disease by Intervening Chemokine Axis-mediated Nerve Cell Communications Adv. Sci. 2025 12 2410070 10.1002/advs.202410070 PMC11831437 39721010 29. Berger M. Cüppers H.J. Hegner H. Jörgens V. Berchtold P. Absorption Kinetics and Biologic Effects of Subcutaneously Injected Insulin Preparations Diabetes Care 1982 5 77 91 10.2337/diacare.5.2.77 6765510 30. Wiita E.G. Toprakcioglu Z. Jayaram A.K. Knowles T.P.J. Selenium-Silk Microgels as Antifungal and Antibacterial Agents Nanoscale Horiz. 2024 9 609 619 10.1039/D3NH00385J 38288551 PMC10962633 31. Kittel Y. Kuehne A.J.C. De Laporte L. Translating Therapeutic Microgels into Clinical Applications Adv. Healthc. Mater. 2022 11 2101989 10.1002/adhm.202101989 34826201 32. Yang C. Lin Z.I. Chen J.A. Xu Z. Gu J. Law W.C. Yang J.H.C. Chen C.K. Organic/Inorganic Self-Assembled Hybrid Nano-Architectures for Cancer Therapy Applications Macromol. Biosci. 2022 22 2100349 10.1002/mabi.202100349 34735739 33. Lye F.S.N. Loo Y.S. Mat Azmi I.D. Lee C.S. Zahid N.I. Madheswaran T. Microfluidic-Enabled Nanomedicine: A Comprehensive Review of Recent Advances and Translational Potential Microfluid. Nanofluidics 2025 29 51 10.1007/s10404-025-02826-3 34. Urifa J. Shah K.W. Developmental Framework and Umbrella Review of AI-Driven Strategies for Hydrogel Microneedles Preprints 2025 10.20944/preprints202504.2168.v1 35. Kausar N. Chowdhry B.Z. Snowden M. Microgels from Smart Polymers Smart Polymers: Applications in Biotechnology and Biomedicine CRC Press Boca Raton, FL, USA 2007 138 169 10.1081/E-EBPP-120052183 36. Pinyakit Y. Hoven V.P. Microgels and Nanogels Natural and Synthetic Hydrogels: Rational Design, Synthesis and Biomedical Applications Elsevier Amsterdam, The Netherlands 2025 313 349 10.1016/B978-0-443-16168-1.00013-1 37. Plamper F.A. Richtering W. Functional Microgels and Microgel Systems Acc. Chem. Res. 2017 50 131 140 10.1021/acs.accounts.6b00544 28186408 38. Yang D.P. Oo M.N.N.L. Deen G.R. Li Z. Loh X.J. Nano-Star-Shaped Polymers for Drug Delivery Applications Macromol. Rapid Commun. 2017 38 1700410 10.1002/marc.201700410 28895248 39. Chelu M. Musuc A.M. Polymer Gels: Classification and Recent Developments in Biomedical Applications Gels 2023 9 161 10.3390/gels9020161 36826331 PMC9956074 40. Mauri E. Giannitelli S.M. Trombetta M. Rainer A. Synthesis of Nanogels: Current Trends and Future Outlook Gels 2021 7 36 10.3390/gels7020036 33805279 PMC8103252 41. Nasution H. Harahap H. Dalimunthe N.F. Ginting M.H.S. Jaafar M. Tan O.O.H. Aruan H.K. Herfananda A.L. Hydrogel and Effects of Crosslinking Agent on Cellulose-Based Hydrogels: A Review Gels 2022 8 568 10.3390/gels8090568 36135281 PMC9498307 42. Zhao W. Jin X. Cong Y. Liu Y. Fu J. Degradable Natural Polymer Hydrogels for Articular Cartilage Tissue Engineering J. Chem. Technol. Biotechnol. 2013 88 327 339 10.1002/jctb.3970 43. Mano J.F. Silva G.A. Azevedo H.S. Malafaya P.B. Sousa R.A. Silva S.S. Boesel L.F. Oliveira J.M. Santos T.C. Marques A.P. Natural Origin Biodegradable Systems in Tissue Engineering and Regenerative Medicine: Present Status and Some Moving Trends J. R. Soc. Interface 2007 4 999 1030 10.1098/rsif.2007.0220 17412675 PMC2396201 44. Chelu M. Calderon Moreno J. Atkinson I. Pandele Cusu J. Rusu A. Bratan V. Aricov L. Anastasescu M. Seciu-Grama A.M. Musuc A.M. Green Synthesis of Bioinspired Chitosan-ZnO-Based Polysaccharide Gums Hydrogels with Propolis Extract as Novel Functional Natural Biomaterials Int. J. Biol. Macromol. 2022 211 410 424 10.1016/j.ijbiomac.2022.05.070 35569685 45. Zerbinati N. Capillo M.C. Sommatis S. Maccario C. Alonci G. Rauso R. Galadari H. Guida S. Mocchi R. Rheological Investigation as Tool to Assess Physicochemical Stability of a Hyaluronic Acid Dermal Filler Cross-Linked with Polyethylene Glycol Diglycidyl Ether and Containing Calcium Hydroxyapatite, Glycine and L-Proline Gels 2022 8 264 10.3390/gels8050264 35621562 PMC9140203 46. Balaci T. Ozon E. Baconi D. Nițulescu G. Velescu B. Bălălău C. Păunică I. Fița C. Study on the Formulation and Characterization of a Photoprotective Cream Containing a New Synthetized Compound J. Mind Med. Sci. 2020 7 193 200 10.22543/7674.72.P193200 47. Shi Y. Ma C. Peng L. Yu G. Conductive “Smart” Hybrid Hydrogels with PNIPAM and Nanostructured Conductive Polymers Adv. Funct. Mater. 2015 25 1219 1225 10.1002/adfm.201404247 48. Chafran L. Carfagno A. Altalhi A. Bishop B. Green Hydrogel Synthesis: Emphasis on Proteomics and Polymer Particle-Protein Interaction Polymers 2022 14 4755 10.3390/polym14214755 36365747 PMC9656617 49. Ahmad Z. Salman S. Khan S.A. Amin A. Rahman Z.U. Al-Ghamdi Y.O. Akhtar K. Bakhsh E.M. Khan S.B. Versatility of Hydrogels: From Synthetic Strategies, Classification, and Properties to Biomedical Applications Gels 2022 8 167 10.3390/gels8030167 35323280 PMC8950628 50. Guilherme M.R. Silva R. Girotto E.M. Rubira A.F. Muniz E.C. Hydrogels Based on PAAm Network with PNIPAAm Included: Hydrophilic–Hydrophobic Transition Measured by the Partition of Orange II and Methylene Blue in Water Polymer 2003 44 4213 4219 10.1016/S0032-3861(03)00370-7 51. Zhang X. Wu D. Chu C.C. Synthesis and Characterization of Partially Biodegradable, Temperature and PH Sensitive Dex–MA/PNIPAAm Hydrogels Biomaterials 2004 25 4719 4730 10.1016/j.biomaterials.2003.11.040 15120518 52. Lin C.C. Anseth K.S. PEG Hydrogels for the Controlled Release of Biomolecules in Regenerative Medicine Pharm. Res. 2009 26 631 643 10.1007/s11095-008-9801-2 19089601 PMC5892412 53. Peppas N.A. Turbidimetric Studies of Aqueous Poly(Vinyl Alcohol) Solutions Die Makromol. Chem. 1975 176 3433 3440 10.1002/macp.1975.021761125 54. Schacht E.H. Polymer Chemistry and Hydrogel Systems J. Phys. Conf. Ser. 2004 3 22 10.1088/1742-6596/3/1/004 55. Das N. Preparation Methods and Properties of Hydrogel: A Review Int. J. Pharm. Pharm. Sci. 2013 5 112 117 56. Kumar A. Srivastava A. Galaev I.Y. Mattiasson B. Smart Polymers: Physical Forms and Bioengineering Applications Prog. Polym. Sci. 2007 32 1205 1237 10.1016/j.progpolymsci.2007.05.003 57. Piras C.C. Slavik P. Smith D.K. Self-Assembling Supramolecular Hybrid Hydrogel Beads Angew. Chem.-Int. Ed. 2020 59 853 859 10.1002/anie.201911404 PMC6973155 31697017 58. Soni K.S. Desale S.S. Bronich T.K. Nanogels: An Overview of Properties, Biomedical Applications and Obstacles to Clinical Translation J. Control. Release 2016 240 109 126 10.1016/j.jconrel.2015.11.009 26571000 PMC4862943 59. Bashir S. Hina M. Iqbal J. Rajpar A.H. Mujtaba M.A. Alghamdi N.A. Wageh S. Ramesh K. Ramesh S. Fundamental Concepts of Hydrogels: Synthesis, Properties, and Their Applications Polymers 2020 12 2702 10.3390/polym12112702 33207715 PMC7697203 60. Tang Z. Liu D. Lyu X. Liu Y. Liu Y. Yang W. Shen Z. Fan X. Ultra-Stretchable Ion Gels Based on Physically Cross-Linked Polymer Networks J. Mater. Chem. C 2022 10 10926 10934 10.1039/D2TC01721K 61. Mahmood S. Khan N.R. Razaque G. Shah S.U. Shahid M.G. Albarqi H.A. Alqahtani A.A. Alasiri A. Basit H.M. Microwave-Treated Physically Cross-Linked Sodium Alginate and Sodium Carboxymethyl Cellulose Blend Polymer Film for Open Incision Wound Healing in Diabetic Animals—A Novel Perspective for Skin Tissue Regeneration Application Pharmaceutics 2023 15 418 10.3390/pharmaceutics15020418 36839741 PMC9959634 62. Guo Y. Wu M. Li R. Cai Z. Zhang H. Thermostable Physically Crosslinked Cryogel from Carboxymethylated Konjac Glucomannan Fabricated by Freeze-Thawing Food Hydrocoll. 2022 122 107103 10.1016/j.foodhyd.2021.107103 63. Wu M. Chen X. Xu J. Zhang H. Freeze-Thaw and Solvent-Exchange Strategy to Generate Physically Cross-Linked Organogels and Hydrogels of Curdlan with Tunable Mechanical Properties Carbohydr. Polym. 2022 278 119003 10.1016/j.carbpol.2021.119003 34973803 64. Sarmah D. Karak N. Physically Cross-Linked Starch/Hydrophobically-Associated Poly(Acrylamide) Self-Healing Mechanically Strong Hydrogel Carbohydr. Polym. 2022 289 119428 10.1016/j.carbpol.2022.119428 35483842 65. Caló E. Khutoryanskiy V.V. Biomedical Applications of Hydrogels: A Review of Patents and Commercial Products Eur. Polym. J. 2015 65 252 267 10.1016/j.eurpolymj.2014.11.024 66. Horkay F. Douglas J.F. Polymer Gels: Basics, Challenges, and Perspectives Gels and Other Soft Amorphous Solids ACS Symposium Series American Chemical Society Washington, DC, USA 2018 Volume 1296 1 13 10.1021/bk-2018-1296.ch001 67. Zhou Y. Chu R. Fan L. Meng X. Zhao J. Wu G. Li X. Jiang X. Sun F.C. Study on the Mechanism and Performance of Polymer Gels by TE and PVA Chemical Cross-Linking J. Appl. Polym. Sci. 2022 139 52043 10.1002/app.52043 68. Khan R. Zaman M. Salawi A. Khan M.A. Iqbal M.O. Riaz R. Ahmed M.M. Butt M.H. Alvi M.N. Almoshari Y. Synthesis of Chemically Cross-Linked PH-Sensitive Hydrogels for the Sustained Delivery of Ezetimibe Gels 2022 8 281 10.3390/gels8050281 35621579 PMC9140580 69. Barbero C.A. Martínez M.V. Acevedo D.F. Molina M.A. Rivarola C.R. Cross-Linked Polymeric Gels and Nanocomposites: New Materials and Phenomena Enabling Technological Applications Macromol 2022 2 440 475 10.3390/macromol2030028 70. Wang P. Meng X. Wang R. Yang W. Yang L. Wang J. Wang D.A. Fan C. Biomaterial Scaffolds Made of Chemically Cross-Linked Gelatin Microsphere Aggregates (C-GMSs) Promote Vascularized Bone Regeneration Adv. Healthc. Mater. 2022 11 2102818 10.1002/adhm.202102818 35306762 71. Sen-Britain S. Hicks W.L. Hard R. Gardella J.A. Differential Orientation and Conformation of Surface-Bound Keratinocyte Growth Factor on (Hydroxyethyl)Methacrylate, (Hydroxyethyl)Methacrylate/Methyl Methacrylate, and (Hydroxyethyl)Methacrylate/Methacrylic Acid Hydrogel Copolymers Biointerphases 2018 13 06E406 10.1116/1.5051655 30360629 PMC6905655 72. Lanzalaco S. Armelin E. Poly(N-Isopropylacrylamide) and Copolymers: A Review on Recent Progresses in Biomedical Applications Gels 2017 3 36 10.3390/gels3040036 30920531 PMC6318659 73. Mohite P.B. Adhav S.S. A Hydrogels: Methods of Preparation and Applications Int. J. Adv. Pharm. 2017 6 79 85 74. Singhal R. Gupta K. A Review: Tailor-Made Hydrogel Structures (Classifications and Synthesis Parameters) Polym.-Plast. Technol. Eng. 2016 55 54 70 10.1080/03602559.2015.1050520 75. Thakur S. Thakur V.K. Arotiba O.A. History, Classification, Properties and Application of Hydrogels: An Overview Hydrogels: Gels Horizons—From Science to Smart Materials Springer Singapore 2018 10.1007/978-981-10-6077-9_2 76. Zha L. Banik B. Alexis F. Stimulus Responsive Nanogels for Drug Delivery Soft Matter 2011 7 5908 5916 10.1039/c0sm01307b 77. Karimi M. Ghasemi A. Sahandi Zangabad P. Rahighi R. Moosavi Basri S.M. Mirshekari H. Amiri M. Shafaei Pishabad Z. Aslani A. Bozorgomid M. Smart Micro/Nanoparticles in Stimulus-Responsive Drug/Gene Delivery Systems Chem. Soc. Rev. 2016 45 1457 1501 10.1039/C5CS00798D 26776487 PMC4775468 78. Balcerak-Woźniak A. Dzwonkowska-Zarzycka M. Kabatc-Borcz J. A Comprehensive Review of Stimuli-Responsive Smart Polymer Materials—Recent Advances and Future Perspectives Materials 2024 17 4255 10.3390/ma17174255 39274645 PMC11396725 79. Wang H. Yi J. Mukherjee S. Banerjee P. Zhou S. Magnetic/NIR-Thermally Responsive Hybrid Nanogels for Optical Temperature Sensing, Tumor Cell Imaging and Triggered Drug Release Nanoscale 2014 6 13001 13011 10.1039/C4NR03748K 25243783 80. Karimi M. Sahandi Zangabad P. Ghasemi A. Amiri M. Bahrami M. Malekzad H. Ghahramanzadeh Asl H. Mahdieh Z. Bozorgomid M. Ghasemi A. Temperature-Responsive Smart Nanocarriers for Delivery of Therapeutic Agents: Applications and Recent Advances ACS Appl. Mater. Interfaces 2016 8 21107 21133 10.1021/acsami.6b00371 27349465 PMC5003094 81. Uchiyama S. Tsuji T. Kawamoto K. Okano K. Fukatsu E. Noro T. Ikado K. Yamada S. Shibata Y. Hayashi T. A Cell-Targeted Non-Cytotoxic Fluorescent Nanogel Thermometer Created with an Imidazolium-Containing Cationic Radical Initiator Angew. Chem.-Int. Ed. 2018 57 5413 5417 10.1002/anie.201801495 29537622 82. Theune L.E. Buchmann J. Wedepohl S. Molina M. Laufer J. Calderón M. NIR- and Thermo-Responsive Semi-Interpenetrated Polypyrrole Nanogels for Imaging Guided Combinational Photothermal and Chemotherapy J. Control. Release 2019 311–312 147 161 10.1016/j.jconrel.2019.08.035 31476343 83. Gao F. Wu X. Wu D. Yu J. Yao J. Qi Q. Cao Z. Cui Q. Mi Y. Preparation of Degradable Magnetic Temperature- and Redox-Responsive Polymeric/Fe 3 4 Colloids Surfaces A Physicochem. Eng. Asp. 2020 587 124363 10.1016/j.colsurfa.2019.124363 84. Zuo Y. Jiao Z. Ma L. Song P. Wang R. Xiong Y. Hydrogen Bonding Induced UCST Phase Transition of Poly(Ionic Liquid)-Based Nanogels Polymer 2016 98 287 293 10.1016/j.polymer.2016.06.048 85. Elluru M. Ma H. Hadjiargyrou M. Hsiao B.S. Chu B. Synthesis and Characterization of Biocompatible Hydrogel Using Pluronics-Based Block Copolymers Polymer 2013 54 2088 2095 10.1016/j.polymer.2013.02.017 86. Seo S. Lee C.S. Jung Y.S. Na K. Thermo-Sensitivity and Triggered Drug Release of Polysaccharide Nanogels Derived from Pullulan-g-Poly(l-Lactide) Copolymers Carbohydr. Polym. 2012 87 1105 1111 10.1016/j.carbpol.2011.08.061 87. Ko D.Y. Moon H.J. Jeong B. Temperature-Sensitive Polypeptide Nanogels for Intracellular Delivery of a Biomacromolecular Drug J. Mater. Chem. B 2015 3 3525 3530 10.1039/C5TB00366K 32262236 88. Peng S. Wang H. Zhao W. Xin Y. Liu Y. Yu X. Zhan M. Shen S. Lu L. Zwitterionic Polysulfamide Drug Nanogels with Microwave Augmented Tumor Accumulation and On-Demand Drug Release for Enhanced Cancer Therapy Adv. Funct. Mater. 2020 30 2001832 10.1002/adfm.202001832 89. Unger E.C. Mccreery T.P. Sweitzer R.H. Ultrasound Enhances Gene Expression of Liposomal Transfection Investig. Radiol. 1997 32 723 727 10.1097/00004424-199712000-00001 9406011 90. Teng Y. Jin H. Nan D. Li M. Fan C. Liu Y. Lv P. Cui W. Sun Y. Hao H. In Vivo Evaluation of Urokinase-Loaded Hollow Nanogels for Sonothrombolysis on Suture Embolization-Induced Acute Ischemic Stroke Rat Model Bioact. Mater. 2018 3 102 109 10.1016/j.bioactmat.2017.08.001 29744447 PMC5935765 91. Obeso-Vera C. Cornejo-Bravo J.M. Serrano-Medina A. Licea-Claverie A. Effect of Crosslinkers on Size and Temperature Sensitivity of Poly(N-Isopropylacrylamide) Microgels Polym. Bull. 2013 70 653 664 10.1007/s00289-012-0832-9 92. Halliwell M. A Tutorial on Ultrasonic Physics and Imaging Techniques Proc. Inst. Mech. Eng. Part H J. Eng. Med. 2010 224 127 142 10.1243/09544119JEIM656 20349811 93. Cazares-Cortes E. Espinosa A. Guigner J.M. Michel A. Griffete N. Wilhelm C. Ménager C. Doxorubicin Intracellular Remote Release from Biocompatible Oligo(Ethylene Glycol) Methyl Ether Methacrylate-Based Magnetic Nanogels Triggered by Magnetic Hyperthermia ACS Appl. Mater. Interfaces 2017 9 25775 25788 10.1021/acsami.7b06553 28723064 94. Mandal P. Maji S. Panja S. Bajpai O.P. Maiti T.K. Chattopadhyay S. Magnetic Particle Ornamented Dual Stimuli Responsive Nanogel for Controlled Anticancer Drug Delivery New J. Chem. 2019 43 3026 3037 10.1039/C8NJ04841J 95. Ekanger L.A. Allen M.J. Overcoming the Concentration-Dependence of Responsive Probes for Magnetic Resonance Imaging Metallomics 2015 7 405 421 10.1039/C4MT00289J 25579206 PMC4357574 96. Ying X. Wang Y. Liang J. Yue J. Xu C. Lu L. Xu Z. Gao J. Du Y. Chen Z. Angiopep-Conjugated Electro-Responsive Hydrogel Nanoparticles: Therapeutic Potential for Epilepsy Angew. Chem. 2014 126 12644 12648 10.1002/ange.201403846 25044856 97. Mehrali M. Thakur A. Pennisi C.P. Talebian S. Arpanaei A. Nikkhah M. Dolatshahi-Pirouz A. Nanoreinforced Hydrogels for Tissue Engineering: Biomaterials That Are Compatible with Load-Bearing and Electroactive Tissues Adv. Mater. 2016 8 1603612 10.1002/adma.201603612 27966826 98. Weaver C.L. Larosa J.M. Luo X. Cui X.T. Electrically Controlled Drug Delivery from Graphene Oxide Nanocomposite Films ACS Nano 2014 8 1834 1843 10.1021/nn406223e 24428340 PMC4004293 99. Qiu Y. Park K. Environment-Sensitive Hydrogels for Drug Delivery Adv. Drug Deliv. Rev. 2001 53 321 339 10.1016/S0169-409X(01)00203-4 11744175 100. Hosseinifar T. Sheybani S. Abdouss M. Hassani Najafabadi S.A. Shafiee Ardestani M. Pressure Responsive Nanogel Base on Alginate-Cyclodextrin with Enhanced Apoptosis Mechanism for Colon Cancer Delivery J. Biomed. Mater. Res.-Part A 2018 106 349 359 10.1002/jbm.a.36242 28940736 101. Kanamala M. Wilson W.R. Yang M. Palmer B.D. Wu Z. Mechanisms and Biomaterials in PH-Responsive Tumour Targeted Drug Delivery: A Review Biomaterials 2016 85 152 167 10.1016/j.biomaterials.2016.01.061 26871891 102. Li D. Xu W. Liu H. Fabrication of Chitosan Functionalized Dual Stimuli-Responsive Injectable Nanogel to Control Delivery of Doxorubicin Colloid Polym. Sci. 2023 301 879 891 10.1007/s00396-023-05103-3 103. Lee E.S. Oh K.T. Kim D. Youn Y.S. Bae Y.H. Tumor PH-Responsive Flower-like Micelles of Poly(l-Lactic Acid)-b-Poly(Ethylene Glycol)-b-Poly(l-Histidine) J. Control. Release 2007 123 19 26 10.1016/j.jconrel.2007.08.006 17826863 PMC2196406 104. Cheng R. Feng F. Meng F. Deng C. Feijen J. Zhong Z. Glutathione-Responsive Nano-Vehicles as a Promising Platform for Targeted Intracellular Drug and Gene Delivery J. Control. Release 2011 152 2 12 10.1016/j.jconrel.2011.01.030 21295087 105. Nakahata M. Mori S. Takashima Y. Hashidzume A. Yamaguchi H. Harada A. PH- and Sugar-Responsive Gel Assemblies Based on Boronate-Catechol Interactions ACS Macro Lett. 2014 3 337 340 10.1021/mz500035w 35590743 106. Mu M. Luo X. Wang W. Yin H. Feng Y. CO 2 J. Colloid Interface Sci. 2018 522 10 19 10.1016/j.jcis.2018.03.020 29574264 107. Ghadiali J.E. Stevens M.M. Enzyme-Responsive Nanoparticle Systems Adv. Mater. 2008 20 4359 4363 10.1002/adma.200703158 108. Wang Y. Luo Y. Zhao Q. Wang Z. Xu Z. Jia X. An Enzyme-Responsive Nanogel Carrier Based on PAMAM Dendrimers for Drug Delivery ACS Appl. Mater. Interfaces 2016 8 19899 19906 10.1021/acsami.6b05567 27420576 109. DeVinney R. Steele-Mortimer O. Finlay B.B. Phosphatases and Kinases Delivered to the Host Cell by Bacterial Pathogens Trends Microbiol. 2000 8 29 33 10.1016/S0966-842X(99)01657-1 10637641 110. Padmavathy N. Samantaray P.K. Ghosh L.D. Madras G. Bose S. Selective Cleavage of the Polyphosphoester in Crosslinked Copper Based Nanogels: Enhanced Antibacterial Performance through Controlled Release of Copper Nanoscale 2017 9 12664 12676 10.1039/C7NR02446K 28828457 111. Haddar H.O. Zaghloul T.I. Saeed H.M. Biodegradation of Native Feather Keratin by Bacillus Subtilis Recombinant Strains Biodegradation 2009 20 687 694 10.1007/s10532-009-9256-0 19322665 112. Chai P.J. Li Y.S. Tan C.X. An Efficient and Convenient Method for Preparation of Disulfides from Thiols Using Air as Oxidant Catalyzed by Co-Salophen Chin. Chem. Lett. 2011 22 1403 1406 10.1016/j.cclet.2011.06.007 113. Zhao M. Zhang Y. Yuan S. Xu X. Wu Z. Wu Z. Qi X. ATP Responsive DNA Nanogels Grown on Biocompatible Branches for Anticancer Drug Delivery Soft Matter 2019 15 3655 3658 10.1039/C9SM00480G 31012474 114. Kashyap N. Viswanad B. Sharma G. Bhardwaj V. Ramarao P. Ravi Kumar M.N.V. Design and Evaluation of Biodegradable, Biosensitive in Situ Gelling System for Pulsatile Delivery of Insulin Biomaterials 2007 28 2051 2060 10.1016/j.biomaterials.2007.01.007 17240443 115. Saravanakumar G. Kim J. Kim W.J. Reactive-Oxygen-Species-Responsive Drug Delivery Systems: Promises and Challenges Adv. Sci. 2017 4 1600124 10.1002/advs.201600124 PMC5238745 28105390 116. Lee S.H. Gupta M.K. Bang J.B. Bae H. Sung H.J. Current Progress in Reactive Oxygen Species (ROS)-Responsive Materials for Biomedical Applications Adv. Healthc. Mater. 2013 2 908 915 10.1002/adhm.201200423 25136729 PMC4146500 117. Chen Y. Wang W. Wu D. Zeng H. Hall D.G. Narain R. Multiresponsive and Self-Healing Hydrogel via Formation of Polymer-Nanogel Interfacial Dynamic Benzoxaborole Esters at Physiological PH ACS Appl. Mater. Interfaces 2019 11 44742 44750 10.1021/acsami.9b16139 31682100 118. Biglione C. Bergueiro J. Wedepohl S. Klemke B. Strumia M.C. Calderón M. Revealing the NIR-Triggered Chemotherapy Therapeutic Window of Magnetic and Thermoresponsive Nanogels Nanoscale 2020 12 21635 21646 10.1039/D0NR02953J 32856647 119. Ferguson C.T.J. Huber N. Landfester K. Zhang K.A.I. Dual-Responsive Photocatalytic Polymer Nanogels Angew. Chem.-Int. Ed. 2019 58 10567 10571 10.1002/anie.201903309 31066484 120. Zhou N. Cao X. Du X. Wang H. Wang M. Liu S. Nguyen K. Schmidt-Rohr K. Xu Q. Liang G. Hyper-Crosslinkers Lead to Temperature- and PH-Responsive Polymeric Nanogels with Unusual Volume Change Angew. Chem.-Int. Ed. 2017 56 2623 2627 10.1002/anie.201611479 28128498 121. Cheng R. Meng F. Deng C. Klok H.A. Zhong Z. Dual and Multi-Stimuli Responsive Polymeric Nanoparticles for Programmed Site-Specific Drug Delivery Biomaterials 2013 34 3647 3657 10.1016/j.biomaterials.2013.01.084 23415642 122. Gao J. Frisken B.J. Cross-Linker-Free N-Isopropylacrylamide Gel Nanospheres Langmuir 2003 19 5212 5216 10.1021/la0269762 123. Virtanen O.L.J. Mourran A. Pinard P.T. Richtering W. Persulfate Initiated Ultra-Low Cross-Linked Poly (N-Isopropylacrylamide) Microgels Possess an Unusual Inverted Cross-Linking Structure Soft Matter 2016 12 3919 3928 10.1039/C6SM00140H 27033731 124. Nayak S. Gan D. Serpe M.J. Lyon L.A. Hollow Thermoresponsive Microgels Small 2005 1 416 421 10.1002/smll.200400089 17193466 125. Zhang Y. Guan Y. Zhou S. Permeability Control of Glucose-Sensitive Nanoshells Biomacromolecules 2007 8 3842 3847 10.1021/bm700802p 18020392 126. Brossault D.F.F. McCoy T.M. Routh A.F. Preparation of Multicore Colloidosomes: Nanoparticle-Assembled Capsules with Adjustable Size, Internal Structure, and Functionalities for Oil Encapsulation ACS Appl. Mater. Interfaces 2021 13 51495 51503 10.1021/acsami.1c15334 34672538 127. Eqbal M.D. Gundabala V. Controlled Fabrication of Multi-Core Alginate Microcapsules J. Colloid Interface Sci. 2017 507 27 34 10.1016/j.jcis.2017.07.100 28780332 128. Trongsatitkul T. Budhlall B.M. Multicore–Shell PNIPAm-Co-PEGMa Microcapsules for Cell Encapsulation Langmuir 2011 27 13468 13480 10.1021/la203030j 21962146 129. Choi J.H. Lee J.S. Park K.M. Bae J.W. Lee Y. Park K.D. Multi-Layered Nanogels with MMP-Sheddable PEG Masks: Preparation and Promotion of Tumor Cell Uptake by Controlling Surface Characteristics Colloids Surfaces B Biointerfaces 2017 156 71 78 10.1016/j.colsurfb.2017.05.007 28514710 130. Jeon S. Yoo C.Y. Park S.N. Improved Stability and Skin Permeability of Sodium Hyaluronate-Chitosan Multilayered Liposomes by Layer-by-Layer Electrostatic Deposition for Quercetin Delivery Colloids Surfaces B Biointerfaces 2015 129 7 14 10.1016/j.colsurfb.2015.03.018 25819360 131. Seyfoori A. Koshkaki K. Majidzadeh A. Nanohybrid Stimuli-Responsive Microgels: A New Approach in Cancer Therapy Nanoarchitectonics for Smart Delivery and Drug Targeting Holban A.M. William Andrew Norwich New York, NY, USA 2016 715 742 132. Das M. Sanson N. Fava D. Kumacheva E. Microgels Loaded with Gold Nanorods: Photothermally Triggered Volume Transitions under Physiological Conditions Langmuir 2007 23 196 201 10.1021/la061596s 17190504 133. Peppas N.A. Hilt J.Z. Khademhosseini A. Langer R. Hydrogels in Biology and Medicine: From Molecular Principles to Bionanotechnology Adv. Mater. 2006 18 1345 1360 10.1002/adma.200501612 134. Khutoryanskiy V.V. Mun G.A. Nurkeeva Z.S. Dubolazov A.V. PH and Salt Effects on Interpolymer Complexation via Hydrogen Bonding in Aqueous Solutions Polym. Int. 2004 53 1382 1387 10.1002/pi.1549 135. Sing C.E. Development of the Modern Theory of Polymeric Complex Coacervation Adv. Colloid Interface Sci. 2017 239 2 16 10.1016/j.cis.2016.04.004 27161661 136. Kadlubowski S. Radiation-Induced Synthesis of Nanogels Based on Poly(N-Vinyl-2-Pyrrolidone)—A Review Radiat. Phys. Chem. 2014 102 29 39 10.1016/j.radphyschem.2014.04.016 137. Neamtu I. Rusu A.G. Diaconu A. Nita L.E. Chiriac A.P. Basic Concepts and Recent Advances in Nanogels as Carriers for Medical Applications Drug Deliv. 2017 24 539 557 10.1080/10717544.2016.1276232 28181831 PMC8240973 138. Zhang H. Zhai Y. Wang J. Zhai G. New Progress and Prospects: The Application of Nanogel in Drug Delivery Mater. Sci. Eng. C 2016 60 560 568 10.1016/j.msec.2015.11.041 26706564 139. Jawaid M. Mohammad F. Nanocellulose and Nanohydrogel Matrices: Biotechnological and Biomedical Applications John Wiley & Sons Hoboken, NJ, USA 2017 3527803823 140. Chacko R.T. Ventura J. Zhuang J. Thayumanavan S. Polymer Nanogels: A Versatile Nanoscopic Drug Delivery Platform Adv. Drug Deliv. Rev. 2012 64 836 851 10.1016/j.addr.2012.02.002 22342438 PMC3359494 141. Duygu Sütekin S. Güven O. Application of Radiation for the Synthesis of Poly(n-Vinyl Pyrrolidone) Nanogels with Controlled Sizes from Aqueous Solutions Appl. Radiat. Isot. 2019 145 161 169 10.1016/j.apradiso.2018.12.028 30639632 142. Lanzalaco S. Sirés I. Sabatino M.A. Dispenza C. Scialdone O. Galia A. Synthesis of Polymer Nanogels by Electro-Fenton Process: Investigation of the Effect of Main Operation Parameters Electrochim. Acta 2017 246 812 822 10.1016/j.electacta.2017.06.097 143. An J.C. Weaver A. Kim B. Barkatt A. Poster D. Vreeland W.N. Silverman J. Al-Sheikhly M. Radiation-Induced Synthesis of Poly(Vinylpyrrolidone) Nanogel Polymer 2011 52 5746 5755 10.1016/j.polymer.2011.09.056 144. de Lima C.S.A. Balogh T.S. Varca J.P.R.O. Varca G.H.C. Lugão A.B. Camacho-Cruz L.A. Bucio E. Kadlubowski S.S. An Updated Review of Macro, Micro, and Nanostructured Hydrogels for Biomedical and Pharmaceutical Applications Pharmaceutics 2020 12 970 10.3390/pharmaceutics12100970 33076231 PMC7602430 145. Fernandez-Nieves A. Wyss H.M. Mattsson J. Weitz D.A. Microgel Suspensions: Fundamentals and Applications John Wiley & Sons Hoboken, NJ, USA 2011 146. Sung M.R. Xiao H. Decker E.A. McClements D.J. Fabrication, Characterization and Properties of Filled Hydrogel Particles Formed by the Emulsion-Template Method J. Food Eng. 2015 155 16 21 10.1016/j.jfoodeng.2015.01.007 147. McClements D.J. Designing Biopolymer Microgels to Encapsulate, Protect and Deliver Bioactive Components: Physicochemical Aspects Adv. Colloid Interface Sci. 2017 240 31 59 10.1016/j.cis.2016.12.005 28034309 148. Oh J.K. Drumright R. Siegwart D.J. Matyjaszewski K. The Development of Microgels/Nanogels for Drug Delivery Applications Prog. Polym. Sci. 2008 33 448 477 10.1016/j.progpolymsci.2008.01.002 149. Makuuchi K. Critical Review of Radiation Processing of Hydrogel and Polysaccharide Radiat. Phys. Chem. 2010 79 267 271 10.1016/j.radphyschem.2009.10.011 150. Pino-Ramos V.H. Ramos-Ballesteros A. López-Saucedo F. López-Barriguete J.E. Varca G.C. Bucio E. Radiation Grafting for the Functionalization and Development of Smart Polymeric Materials Top. Curr. Chem. 2016 374 63 10.1007/s41061-016-0063-x 27573505 151. Farjami T. Madadlou A. Fabrication Methods of Biopolymeric Microgels and Microgel-Based Hydrogels Food Hydrocoll. 2017 62 262 272 10.1016/j.foodhyd.2016.08.017 152. Wu W. Zhou S. Hybrid Micro-/Nanogels for Optical Sensing and Intracellular Imaging Nano Rev. 2010 1 5730 10.3402/nano.v1i0.5730 22110866 PMC3215222 153. Kendre P.N. Satav T.S. Current Trends and Concepts in the Design and Development of Nanogel Carrier Systems Polym. Bull. 2019 76 1595 1617 10.1007/s00289-018-2430-y 154. Yong C.P. Gan L.M. Microemulsion Polymerizations and Reactions Polym. Part. -/- 2005 175 257 298 155. Capek I. The Inverse Mini-Emulsion Polymerization of Acrylamide Des. Monomers Polym. 2003 6 399 409 10.1163/156855503771816859 156. Guo Q. Yin L. Wang X. Yuan J. Zhang Q. An Environmentally Friendly Inverse Microemulsion Method to Synthesize Polyacrylamide Materials 2022 15 5927 10.3390/ma15175927 36079308 PMC9457084 157. Murphy A.C. Oldenkamp H.F. Peppas N.A. A Highly Tuneable Inverse Emulsion Polymerization for the Synthesis of Stimuli-Responsive Nanoparticles for Biomedical Applications Biomater. Sci. 2024 12 1707 1715 10.1039/D3BM01765F 38334980 PMC10965376 158. Mastella P. Todaro B. Luin S. Nanogels: Recent Advances in Synthesis and Biomedical Applications Nanomaterials 2024 14 1300 10.3390/nano14151300 39120405 PMC11314474 159. Ahmed M.S. Islam M. Hasan M.K. Nam K.-W. A Comprehensive Review of Radiation-Induced Hydrogels: Synthesis, Properties, and Multidimensional Applications Gels 2024 10 381 10.3390/gels10060381 38920928 PMC11203285 160. Sütekin S.D. Güven O. Şahiner N. Nanogel Synthesis by Irradiation of Aqueous Polymer Solutions Emerging Technologies for Nanoparticle Manufacturing Springer Cham, Switzerland 2021 167 202 10.1007/978-3-030-50703-9_8 161. Ashfaq A. Clochard M.C. Coqueret X. Dispenza C. Driscoll M.S. Ulański P. Al-Sheikhly M. Polymerization Reactions and Modifications of Polymers by Ionizing Radiation Polymers 2020 12 2877 10.3390/polym12122877 33266261 PMC7760743 162. El-Adl K. Ghobashy M.M. Ismail A.F.M. El-Morsy A. Shoman N.A. Radiation-Induced Nanogel Engineering Based on Pectin for PH-Responsive Rutin Delivery for Cancer Treatment Naunyn. Schmiedebergs. Arch. Pharmacol. 2025 398 5249 5271 10.1007/s00210-024-03573-y 39540896 PMC11985661 163. Calvillo-Muñoz E.Y. Vega-Paz A. Guzman-Lucero D. Lijanova I.V. Olivares-Xometl O. Likhanova N. V Synthesis of Water-Soluble Ionic Terpolymers by Inverse Microemulsion and Solution Polymerization Methods RSC Adv. 2022 12 12273 12282 10.1039/D2RA01173E 35480365 PMC9036531 164. Chanda M. Direct Synthesis of Nano-Size Polymers by Microemulsion Polymerization Nano-Size Polymers: Preparation, Properties, Applications Fakirov S. Springer International Publishing Cham, Switzerland 2016 49 86 978-3-319-39715-3 165. Arif M. Raza H. Haroon S.M. Naseem K. Majeed H. Tahir F. Fatima U. Ibrahim S.M. Ul Mahmood S. Copper (II) Ions Extraction by Poly(N-Vinylcaprolactam-Mathacrylic Acid) Microgels for in Situ Reduction Formation of Copper Nanoparticles to Reduce Pollutants J. Mol. Liq. 2023 392 123541 10.1016/j.molliq.2023.123541 166. Begum R. Farooqi Z.H. Aboo A.H. Ahmed E. Sharif A. Xiao J. Reduction of Nitroarenes Catalyzed by Microgel-Stabilized Silver Nanoparticles J. Hazard. Mater. 2019 377 399 408 10.1016/j.jhazmat.2019.05.080 31176075 167. Jiang Y. Colazo M.G. Serpe M.J. Poly(N-Isopropylacrylamide) Microgel-Based Sensor for Progesterone in Aqueous Samples Colloid Polym. Sci. 2016 294 1733 1741 10.1007/s00396-016-3926-3 168. Kawano S. Kida T. Akashi M. Sato H. Shizuma M. Ono D. Preparation of Pickering Emulsions through Interfacial Adsorption by Soft Cyclodextrin Nanogels Beilstein J. Org. Chem. 2015 11 2355 2364 10.3762/bjoc.11.257 26734085 PMC4685927 169. Wu W. Yao W. Wang X. Xie C. Zhang J. Jiang X. Bioreducible Heparin-Based Nanogel Drug Delivery System Biomaterials 2015 39 260 268 10.1016/j.biomaterials.2014.11.005 25468376 170. Li Z. Van Zee N.J. Bates F.S. Lodge T.P. Polymer Nanogels as Reservoirs to Inhibit Hydrophobic Drug Crystallization ACS Nano 2019 13 1232 1243 10.1021/acsnano.8b06393 30648859 171. Chaudhary G. Ghosh A. Kang J.G. Braun P.V. Ewoldt R.H. Schweizer K.S. Linear and Nonlinear Viscoelasticity of Concentrated Thermoresponsive Microgel Suspensions J. Colloid Interface Sci. 2021 601 886 898 10.1016/j.jcis.2021.05.111 34186277 172. Highley C.B. Song K.H. Daly A.C. Burdick J.A. Jammed Microgel Inks for 3D Printing Applications Adv. Sci. 2019 6 1801076 10.1002/advs.201801076 PMC6325587 30643716 173. Lee S. Choi G. Yang Y.J. Joo K.I. Cha H.J. Visible Light-Crosslinkable Tyramine-Conjugated Alginate-Based Microgel Bioink for Multiple Cell-Laden 3D Artificial Organ Carbohydr. Polym. 2023 313 120895 10.1016/j.carbpol.2023.120895 37182936 174. MacCuspie R. Comparison of Nanoparticle Sizing Techniques: TEM vs. DLS vs. AFM Delong Am. 2011 1 4 175. Fissan H. Ristig S. Kaminski H. Asbach C. Epple M. Comparison of Different Characterization Methods for Nanoparticle Dispersions before and after Aerosolization Anal. Methods 2014 6 7324 7334 10.1039/C4AY01203H 40883942 176. Dufrêne Y.F. Ando T. Garcia R. Alsteens D. Martinez-Martin D. Engel A. Gerber C. Müller D.J. Imaging Modes of Atomic Force Microscopy for Application in Molecular and Cell Biology Nat. Nanotechnol. 2017 12 295 307 10.1038/nnano.2017.45 28383040 177. Balash M. Boucetta H. He W. Factors Affecting Drug Delivery System Translation: A Focus on Advanced Technologies, Biological Barriers, and Regulatory Challenges J. Control. Release 2025 387 114167 10.1016/j.jconrel.2025.114167 40865878 178. Barenholz Y.C. Doxil®—The First FDA-Approved Nano-Drug: Lessons Learned J. Control. Release 2012 160 117 134 10.1016/j.jconrel.2012.03.020 22484195 179. Gillies E.R. Frechet J.M.J. Dendrimers and Dendritic Polymers in Drug Delivery Drug Discov. Today 2005 10 35 43 10.1016/S1359-6446(04)03276-3 15676297 180. Stiriba S. Frey H. Haag R. Dendritic Polymers in Biomedical Applications: From Potential to Clinical Use in Diagnostics and Therapy Angew. Chem. Int. Ed. 2002 41 1329 1334 10.1002/1521-3773(20020415)41:8&#x0003c;1329::AID-ANIE1329&#x0003e;3.0.CO;2-P 19750755 181. Bosman A.W. Janssen H.M. Meijer E.W. About Dendrimers: Structure, Physical Properties, and Applications Chem. Rev. 1999 99 1665 1688 10.1021/cr970069y 11849007 182. Ballarín-González B. Howard K.A. Polycation-Based Nanoparticle Delivery of RNAi Therapeutics: Adverse Effects and Solutions Adv. Drug Deliv. Rev. 2012 64 1717 1729 10.1016/j.addr.2012.07.004 22800620 183. Zhang S. Zhao B. Jiang H. Wang B. Ma B. Cationic Lipids and Polymers Mediated Vectors for Delivery of SiRNA J. Control. Release 2007 123 1 10 10.1016/j.jconrel.2007.07.016 17716771 184. Cavazzana-Calvo M. Thrasher A. Mavilio F. The Future of Gene Therapy Nature 2004 427 779 781 10.1038/427779a 14985734 185. Waehler R. Russell S.J. Curiel D.T. Engineering Targeted Viral Vectors for Gene Therapy Nat. Rev. Genet. 2007 8 573 587 10.1038/nrg2141 17607305 PMC7097627 186. Stuart M.A.C. Huck W.T.S. Genzer J. Müller M. Ober C. Stamm M. Sukhorukov G.B. Szleifer I. Tsukruk V.V. Urban M. Emerging Applications of Stimuli-Responsive Polymer Materials Nat. Mater. 2010 9 101 113 10.1038/nmat2614 20094081 187. Cai K. He X. Song Z. Yin Q. Zhang Y. Uckun F.M. Jiang C. Cheng J. Dimeric Drug Polymeric Nanoparticles with Exceptionally High Drug Loading and Quantitative Loading Efficiency J. Am. Chem. Soc. 2015 137 3458 3461 10.1021/ja513034e 25741752 188. Kawasaki R. Sasaki Y. Katagiri K. Mukai S. Sawada S. Akiyoshi K. Magnetically Guided Protein Transduction by Hybrid Nanogel Chaperones with Iron Oxide Nanoparticles Angew. Chem. 2016 128 11549 11553 10.1002/ange.201602577 27295070 189. Singh S. Topuz F. Hahn K. Albrecht K. Groll J. Embedding of Active Proteins and Living Cells in Redox-Sensitive Hydrogels and Nanogels through Enzymatic Cross-Linking Angew. Chem. Int. Ed. Engl. 2013 52 3000 10.1002/anie.201206266 23386357 PMC3601431 190. Zhang X. Chen X. Wang H.Y. Jia H.R. Wu F.G. Supramolecular Nanogel-Based Universal Drug Carriers Formed by “Soft–Hard” Co-Assembly: Accurate Cancer Diagnosis and Hypoxia-Activated Cancer Therapy Adv. Ther. 2019 2 1800140 10.1002/adtp.201800140 191. Zhang Y. Andrén O.C.J. Nordström R. Fan Y. Malmsten M. Mongkhontreerat S. Malkoch M. Off-Stoichiometric Thiol-Ene Chemistry to Dendritic Nanogel Therapeutics Adv. Funct. Mater. 2019 29 1806693 10.1002/adfm.201806693 35865651 PMC9286377 192. Mi P. Stimuli-Responsive Nanocarriers for Drug Delivery, Tumor Imaging, Therapy and Theranostics Theranostics 2020 10 4557 4588 10.7150/thno.38069 32292515 PMC7150471 193. Chen X. Wu D. Chen Z. Biomedical Applications of Stimuli-Responsive Nanomaterials MedComm 2024 5 e643 10.1002/mco2.643 39036340 PMC11260173 194. Lin Y. Lin P. Chen X. Zhao X. Cui L. Harnessing Nanoprodrugs to Enhance Cancer Immunotherapy: Overcoming Barriers to Precision Treatment Mater. Today Bio 2025 32 101933 10.1016/j.mtbio.2025.101933 PMC12167063 40520550 195. Blagojevic L. Kamaly N. Nanogels: A Chemically Versatile Drug Delivery Platform Nano Today 2025 61 102645 10.1016/j.nantod.2025.102645 196. Ezike T.C. Okpala U.S. Onoja U.L. Nwike C.P. Ezeako E.C. Okpara O.J. Okoroafor C.C. Eze S.C. Kalu O.L. Odoh E.C. Advances in Drug Delivery Systems, Challenges and Future Directions Heliyon 2023 9 e17488 10.1016/j.heliyon.2023.e17488 37416680 PMC10320272 197. Zhao Q. Zhang S. Wu F. Li D. Zhang X. Chen W. Xing B. Rational Design of Nanogels for Overcoming the Biological Barriers in Various Administration Routes Angew. Chem.-Int. Ed. 2021 60 14760 14778 10.1002/anie.201911048 31591803 198. Zhang D. Tian S. Liu Y. Zheng M. Yang X. Zou Y. Shi B. Luo L. Near Infrared-Activatable Biomimetic Nanogels Enabling Deep Tumor Drug Penetration Inhibit Orthotopic Glioblastoma Nat. Commun. 2022 13 6835 10.1038/s41467-022-34462-8 36369424 PMC9652403 199. Fan X. Torres-Luna C. Azadi M. Domszy R. Hu N. Yang A. David A.E. Evaluation of Commercial Soft Contact Lenses for Ocular Drug Delivery: A Review Acta Biomater. 2020 115 60 74 10.1016/j.actbio.2020.08.025 32853799 200. Wang Z. Li X. Zhang X. Sheng R. Lin Q. Song W. Hao L. Novel Contact Lenses Embedded with Drug-loaded Zwitterionic Nanogels for Extended Ophthalmic Drug Delivery Nanomaterials 2021 11 2328 10.3390/nano11092328 34578644 PMC8465176 201. Kuno N. Fujii S. Recent Advances in Ocular Drug Delivery Systems Polymers 2011 3 193 221 10.3390/polym3010193 202. Lu Y. Jia D. Ma X. Liang M. Hou S. Qiu W. Gao Y. Xue P. Kang Y. Xu Z. Reduction-Responsive Chemo-Capsule-Based Prodrug Nanogel for Synergistic Treatment of Tumor Chemotherapy ACS Appl. Mater. Interfaces 2021 13 8940 8951 10.1021/acsami.0c21710 33565847 203. Li X. Ouyang Z. Li H. Hu C. Saha P. Xing L. Shi X. Pich A. Dendrimer-Decorated Nanogels: Efficient Nanocarriers for Biodistribution in Vivo and Chemotherapy of Ovarian Carcinoma Bioact. Mater. 2021 6 3244 3253 10.1016/j.bioactmat.2021.02.031 33778202 PMC7970313 204. Wei P. Gangapurwala G. Pretzel D. Wang L. Schubert S. Brendel J.C. Schubert U.S. Tunable Nanogels by Host-Guest Interaction with Carboxylate Pillar[5]Arene for Controlled Encapsulation and Release of Doxorubicin Nanoscale 2020 12 13595 13605 10.1039/D0NR01881C 32555817 205. Zhang Y. Dosta P. Conde J. Oliva N. Wang M. Artzi N. Prolonged Local In Vivo Delivery of Stimuli-Responsive Nanogels That Rapidly Release Doxorubicin in Triple-Negative Breast Cancer Cells Adv. Healthc. Mater. 2020 9 e1901101 10.1002/adhm.201901101 31957227 206. Borah P.K. Das A.S. Mukhopadhyay R. Sarkar A. Duary R.K. Macromolecular Design of Folic Acid Functionalized Amylopectin–Albumin Core–Shell Nanogels for Improved Physiological Stability and Colon Cancer Cell Targeted Delivery of Curcumin J. Colloid Interface Sci. 2020 580 561 572 10.1016/j.jcis.2020.07.056 32711206 207. Sun M. He L. Fan Z. Tang R. Du J. Effective Treatment of Drug-Resistant Lung Cancer via a Nanogel Capable of Reactivating Cisplatin and Enhancing Early Apoptosis Biomaterials 2020 257 120252 10.1016/j.biomaterials.2020.120252 32738659 208. Zhang W. Tung C.H. Redox-Responsive Cisplatin Nanogels for Anticancer Drug Delivery Chem. Commun. 2018 54 8367 8370 10.1039/C8CC01795F 29995047 PMC6057802 209. Jin H. Zhao G. Hu J. Ren Q. Yang K. Wan C. Huang A. Li P. Feng J.P. Chen J. Melittin-Containing Hybrid Peptide Hydrogels for Enhanced Photothermal Therapy of Glioblastoma ACS Appl. Mater. Interfaces 2017 9 25755 25766 10.1021/acsami.7b06431 28714303 210. Jing T. Fu L. Liu L. Yan L. A Reduction-Responsive Polypeptide Nanogel Encapsulating NIR Photosensitizer for Imaging Guided Photodynamic Therapy Polym. Chem. 2016 7 951 957 10.1039/C5PY01629K 211. Nuhn L. De Koker S. Van Lint S. Zhong Z. Catani J.P. Combes F. Deswarte K. Li Y. Lambrecht B.N. Lienenklaus S. Nanoparticle-Conjugate TLR7/8 Agonist Localized Immunotherapy Provokes Safe Antitumoral Responses Adv. Mater. 2018 30 e1803397 10.1002/adma.201803397 30276880 212. Singh S. Drude N. Blank L. Desai P.B. Königs H. Rütten S. Langen K.J. Möller M. Mottaghy F.M. Morgenroth A. Protease Responsive Nanogels for Transcytosis across the Blood−Brain Barrier and Intracellular Delivery of Radiopharmaceuticals to Brain Tumor Cells Adv. Healthc. Mater. 2021 10 2100812 10.1002/adhm.202100812 34490744 PMC11468667 213. Li Z. Zheng Y. Shi H. Xie H. Yang Y. Zhu F. Ke L. Chen H. Gao Y. Convenient Tuning of the Elasticity of Self-Assembled Nano-Sized Triterpenoids to Regulate Their Biological Activities ACS Appl. Mater. Interfaces 2021 13 44065 44078 10.1021/acsami.1c12418 34515464 214. Li S. Zhang T. Xu W. Ding J. Yin F. Xu J. Sun W. Wang H. Sun M. Cai Z. Sarcoma-Targeting Peptide-Decorated Polypeptide Nanogel Intracellularly Delivers Shikonin for Upregulated Osteosarcoma Necroptosis and Diminished Pulmonary Metastasis Theranostics 2018 8 1361 1375 10.7150/thno.18299 29507626 PMC5835942 215. Gao C. Lin Z. Jurado-Sánchez B. Lin X. Wu Z. He Q. Stem Cell Membrane-Coated Nanogels for Highly Efficient In Vivo Tumor Targeted Drug Delivery Small 2016 12 4056 4062 10.1002/smll.201600624 27337109 216. Zhang X. Chen X. Guo Y. Jia H.R. Jiang Y.W. Wu F.G. Endosome/Lysosome-Detained Supramolecular Nanogels as an Efflux Retarder and Autophagy Inhibitor for Repeated Photodynamic Therapy of Multidrug-Resistant Cancer Nanoscale Horiz. 2020 5 481 487 10.1039/C9NH00643E 32118218 217. Liu D. Ma L. An Y. Li Y. Liu Y. Wang L. Guo J. Wang J. Zhou J. Thermoresponsive Nanogel-Encapsulated PEDOT and HSP70 Inhibitor for Improving the Depth of the Photothermal Therapeutic Effect Adv. Funct. Mater. 2016 26 4749 4759 10.1002/adfm.201600031 218. Guo H. Li F. Xu W. Chen J. Hou Y. Wang C. Ding J. Chen X. Mucoadhesive Cationic Polypeptide Nanogel with Enhanced Penetration for Efficient Intravesical Chemotherapy of Bladder Cancer Adv. Sci. 2018 5 1800004 10.1002/advs.201800004 29938183 PMC6010003 219. Guo H. Li F. Qiu H. Xu W. Li P. Hou Y. Ding J. Chen X. Synergistically Enhanced Mucoadhesive and Penetrable Polypeptide Nanogel for Efficient Drug Delivery to Orthotopic Bladder Cancer Research 2020 2020 8970135 10.34133/2020/8970135 32832909 PMC7420878 220. De Araújo Pereira R.R. Bruschi M.L. Vaginal Mucoadhesive Drug Delivery Systems Drug Dev. Ind. Pharm. 2012 38 643 652 10.3109/03639045.2011.623355 21999572 221. Di Colo G. Zambito Y. Zaino C. Polymeric Enhancers of Mucosal Epithelia Permeability: Synthesis, Transepithelial Penetration-Enhancing Properties, Mechanism of Action, Safety Issues J. Pharm. Sci. 2008 97 1652 1680 10.1002/jps.21043 17828745 222. Salatin S. Barar J. Barzegar-Jalali M. Adibkia K. Milani M.A. Jelvehgari M. Hydrogel Nanoparticles and Nanocomposites for Nasal Drug/Vaccine Delivery Arch. Pharm. Res. 2016 39 1181 1192 10.1007/s12272-016-0782-0 27352214 223. Al-Eisawi Z. Beale P. Chan C. Yu J.Q. Huq F. Carboplatin and Oxaliplatin in Sequenced Combination with Bortezomib in Ovarian Tumour Models J. Ovarian Res. 2013 6 78 10.1186/1757-2215-6-78 24209693 PMC3826510 224. Grunberg S.M. Dugan M. Muss H. Wood M. Burdette-Radoux S. Weisberg T. Siebel M. Effectiveness of a Single-Day Three-Drug Regimen of Dexamethasone, Palonosetron, and Aprepitant for the Prevention of Acute and Delayed Nausea and Vomiting Caused by Moderately Emetogenic Chemotherapy Support. Care Cancer 2009 17 589 594 10.1007/s00520-008-0535-9 19037667 225. Gu Z. Biswas A. Zhao M. Tang Y. Tailoring Nanocarriers for Intracellular Protein Delivery Chem. Soc. Rev. 2011 40 3638 3655 10.1039/c0cs00227e 21566806 226. Chen J. Zou Y. Deng C. Meng F. Zhang J. Zhong Z. Multifunctional Click Hyaluronic Acid Nanogels for Targeted Protein Delivery and Effective Cancer Treatment in Vivo Chem. Mater. 2016 28 8792 8799 10.1021/acs.chemmater.6b04404 227. Kawasaki R. Sasaki Y. Nishimura T. Katagiri K. Morita K. Sekine Y. Sawada S.I. Mukai S.A. Akiyoshi K. Magnetically Navigated Protein Transduction In Vivo Using Iron Oxide-Nanogel Chaperone Hybrid Adv. Healthc. Mater. 2021 10 2001988 10.1002/adhm.202001988 33694289 228. Canakci M. Canakci M. Canakci M. Singh K. Singh K. Munkhbat O. Shanthalingam S. Mitra A. Gordon M. Osborne B.A. Targeting CD4+Cells with Anti-CD4 Conjugated Mertansine-Loaded Nanogels Biomacromolecules 2020 21 2473 2481 10.1021/acs.biomac.0c00442 32383874 PMC7354862 229. Wu Q. He Z. Wang X. Zhang Q. Wei Q. Ma S. Ma C. Li J. Wang Q. Cascade Enzymes within Self-Assembled Hybrid Nanogel Mimicked Neutrophil Lysosomes for Singlet Oxygen Elevated Cancer Therapy Nat. Commun. 2019 10 240 10.1038/s41467-018-08234-2 30651559 PMC6335431 230. Chen J. Ouyang J. Chen Q. Deng C. Meng F. Zhang J. Cheng R. Lan Q. Zhong Z. EGFR and CD44 Dual-Targeted Multifunctional Hyaluronic Acid Nanogels Boost Protein Delivery to Ovarian and Breast Cancers in Vitro and in Vivo ACS Appl. Mater. Interfaces 2017 9 24140 24147 10.1021/acsami.7b06879 28675028 231. Zhao W. Hu J. Gao W. Glucose Oxidase-Polymer Nanogels for Synergistic Cancer-Starving and Oxidation Therapy ACS Appl. Mater. Interfaces 2017 9 23528 23535 10.1021/acsami.7b06814 28650613 232. Li D. van Nostrum C.F. Mastrobattista E. Vermonden T. Hennink W.E. Nanogels for Intracellular Delivery of Biotherapeutics J. Control. Release 2017 259 16 28 10.1016/j.jconrel.2016.12.020 28017888 233. Liang K. Ng S. Lee F. Lim J. Chung J.E. Lee S.S. Kurisawa M. Targeted Intracellular Protein Delivery Based on Hyaluronic Acid-Green Tea Catechin Nanogels Acta Biomater. 2016 33 142 152 10.1016/j.actbio.2016.01.011 26785145 234. Li Y. Maciel D. Rodrigues J. Shi X. Tomás H. Biodegradable Polymer Nanogels for Drug/Nucleic Acid Delivery Chem. Rev. 2015 115 8564 8608 10.1021/cr500131f 26259712 235. Peng Y. Gao Y. Yang C. Guo R. Shi X. Cao X. Low-Molecular-Weight Poly(Ethylenimine) Nanogels Loaded with Ultrasmall Iron Oxide Nanoparticles for T1-Weighted MR Imaging-Guided Gene Therapy of Sarcoma ACS Appl. Mater. Interfaces 2021 13 27806 27813 10.1021/acsami.1c04081 34105346 236. Dykxhoorn D.M. Palliser D. Lieberman J. The Silent Treatment: SiRNAs as Small Molecule Drugs Gene Ther. 2006 13 541 552 10.1038/sj.gt.3302703 16397510 237. Ma Y. Liu H. Mou Q. Yan D. Zhu X. Zhang C. Floxuridine-Containing Nucleic Acid Nanogels for Anticancer Drug Delivery Nanoscale 2018 10 8367 8371 10.1039/C8NR01226A 29722417 238. Gao X. Li S. Ding F. Liu X. Wu Y. Li J. Feng J. Zhu X. Zhang C. A Virus-Mimicking Nucleic Acid Nanogel Reprograms Microglia and Macrophages for Glioblastoma Therapy Adv. Mater. 2021 33 e2006116 10.1002/adma.202006116 33501743 239. Mou Q. Ma Y. Pan G. Xue B. Yan D. Zhang C. Zhu X. DNA Trojan Horses: Self-Assembled Floxuridine-Containing DNA Polyhedra for Cancer Therapy Angew. Chem.-Int. Ed. 2017 56 12528 12532 10.1002/anie.201706301 28806476 240. Li Z. Rana T.M. Molecular Mechanisms of RNA-Triggered Gene Silencing Machineries Acc. Chem. Res. 2012 45 1122 1131 10.1021/ar200253u 22304792 PMC3398549 241. Shen Y. Qiu L. Effective Oral Delivery of Gp100 Plasmid Vaccine against Metastatic Melanoma through Multi-Faceted Blending-by-Blending Nanogels Nanomed. Nanotechnol. Biol. Med. 2019 22 102114 10.1016/j.nano.2019.102114 31655203 242. Li R.Q. Wu W. Song H.Q. Ren Y. Yang M. Li J. Xu F.J. Well-Defined Reducible Cationic Nanogels Based on Functionalized Low-Molecular-Weight PGMA for Effective PDNA and SiRNA Delivery Acta Biomater. 2016 41 282 292 10.1016/j.actbio.2016.06.006 27267781 243. Ding F. Mou Q. Ma Y. Pan G. Guo Y. Tong G. Choi C.H.J. Zhu X. Zhang C. A Crosslinked Nucleic Acid Nanogel for Effective SiRNA Delivery and Antitumor Therapy Angew. Chem.-Int. Ed. 2018 57 3064 3068 10.1002/anie.201711242 29364558 244. Li H. Qian K. Zhang H. Li L. Yan L. Geng S. Zhao H. Zhang H. Xiong B. Li Z. Pickering Gel Emulsion of Lipiodol Stabilized by Hairy Nanogels for Intra-Artery Embolization Antitumor Therapy Chem. Eng. J. 2021 418 129534 10.1016/j.cej.2021.129534 245. Zhang H. Li Z. Gao C. Fan X. Pang Y. Li T. Wu Z. Xie H. He Q. Dual-Responsive Biohybrid Neutrobots for Active Target Delivery Sci. Robot. 2020 6 eaaz9519 10.1126/scirobotics.aaz9519 34043546 246. Fan M. Jia L. Pang M. Yang X. Yang Y. Kamel Elyzayati S. Liao Y. Wang H. Zhu Y. Wang Q. Injectable Adhesive Hydrogel as Photothermal-Derived Antigen Reservoir for Enhanced Anti-Tumor Immunity Adv. Funct. Mater. 2021 31 2010587 10.1002/adfm.202010587 247. Qin X. Wu C. Niu D. Qin L. Wang X. Wang Q. Li Y. Peroxisome Inspired Hybrid Enzyme Nanogels for Chemodynamic and Photodynamic Therapy Nat. Commun. 2021 12 5243 10.1038/s41467-021-25561-z 34475406 PMC8413279 248. Song Q. Zhang G. Wang B. Cao G. Li D. Wang Y. Zhang Y. Geng J. Li H. Li Y. Reinforcing the Combinational Immuno-Oncotherapy of Switching “Cold” Tumor to “Hot” by Responsive Penetrating Nanogels ACS Appl. Mater. Interfaces 2021 13 36824 36838 10.1021/acsami.1c08201 34314148 249. Liu Y. Liang S. Jiang D. Gao T. Fang Y. Fu S. Guan L. Zhang Z. Mu W. Chu Q. Manipulation of TAMs Functions to Facilitate the Immune Therapy Effects of Immune Checkpoint Antibodies J. Control. Release 2021 336 621 634 10.1016/j.jconrel.2021.07.009 34246701 250. Yao J. Li T. Shi X. Wang Y. Fang S. Wang H. A General Prodrug Nanohydrogel Platform for Reduction-Triggered Drug Activation and Treatment of Taxane-Resistant Malignancies Acta Biomater. 2021 130 409 422 10.1016/j.actbio.2021.05.047 34087447 251. Gao J. Wang F. Wang S. Liu L. Liu K. Ye Y. Wang Z. Wang H. Chen B. Jiang J. Hyperthermia-Triggered On-Demand Biomimetic Nanocarriers for Synergetic Photothermal and Chemotherapy Adv. Sci. 2020 7 1903642 10.1002/advs.201903642 PMC7284223 32537410 252. Chen Z. Liu F. Chen Y. Liu J. Wang X. Chen A.T. Deng G. Zhang H. Liu J. Hong Z. Targeted Delivery of CRISPR/Cas9-Mediated Cancer Gene Therapy via Liposome-Templated Hydrogel Nanoparticles Adv. Funct. Mater. 2017 27 1703036 10.1002/adfm.201703036 29755309 PMC5939593 253. Fiorica C. Mauro N. Pitarresi G. Scialabba C. Palumbo F.S. Giammona G. Double-Network-Structured Graphene Oxide-Containing Nanogels as Photothermal Agents for the Treatment of Colorectal Cancer Biomacromolecules 2017 18 1010 1018 10.1021/acs.biomac.6b01897 28192653 254. Chen X. Zhang X. Guo Y. Zhu Y.X. Liu X. Chen Z. Wu F.G. Smart Supramolecular “Trojan Horse”-Inspired Nanogels for Realizing Light-Triggered Nuclear Drug Influx in Drug-Resistant Cancer Cells Adv. Funct. Mater. 2019 29 1807772 10.1002/adfm.201807772 255. Pu X.Q. Ju X.J. Zhang L. Cai Q.W. Liu Y.Q. Peng H.Y. Xie R. Wang W. Liu Z. Chu L.Y. Novel Multifunctional Stimuli-Responsive Nanoparticles for Synergetic Chemo-Photothermal Therapy of Tumors ACS Appl. Mater. Interfaces 2021 13 28802 28817 10.1021/acsami.1c05330 34109788 256. Feng X. Xu W. Liu J. Li D. Li G. Ding J. Chen X. Polypeptide Nanoformulation-Induced Immunogenic Cell Death and Remission of Immunosuppression for Enhanced Chemoimmunotherapy Sci. Bull. 2021 66 362 373 10.1016/j.scib.2020.07.013 36654416 257. Ding F. Gao X. Huang X. Ge H. Xie M. Qian J. Song J. Li Y. Zhu X. Zhang C. Polydopamine-Coated Nucleic Acid Nanogel for SiRNA-Mediated Low-Temperature Photothermal Therapy Biomaterials 2020 245 119976 10.1016/j.biomaterials.2020.119976 32213362 258. Zhang X. Chen X. Guo Y. Gao G. Wang D. Wu Y. Liu J. Liang G. Zhao Y. Wu F.G. Dual Gate-Controlled Therapeutics for Overcoming Bacterium-Induced Drug Resistance and Potentiating Cancer Immunotherapy Angew. Chem.-Int. Ed. 2021 60 14013 14021 10.1002/anie.202102059 33768682 259. Wang J. Xu W. Zhang N. Yang C. Xu H. Wang Z. Li B. Ding J. Chen X. X-Ray-Responsive Polypeptide Nanogel for Concurrent Chemoradiotherapy J. Control. Release 2021 332 1 9 10.1016/j.jconrel.2021.02.003 33561483 260. Li X. Sun H. Li H. Hu C. Luo Y. Shi X. Pich A. Multi-Responsive Biodegradable Cationic Nanogels for Highly Efficient Treatment of Tumors Adv. Funct. Mater. 2021 31 2100227 10.1002/adfm.202100227 261. Zhang H. Ren Y. Hou L. Chang J. Zhang Z. Zhang H. Positioning Remodeling Nanogels Mediated Codelivery of Antivascular Drug and Autophagy Inhibitor for Cooperative Tumor Therapy ACS Appl. Mater. Interfaces 2020 12 6978 6990 10.1021/acsami.9b22412 31951366 262. Martin S.J. Henry C.M. Cullen S.P. A Perspective on Mammalian Caspases as Positive and Negative Regulators of Inflammation Mol. Cell 2012 46 387 397 10.1016/j.molcel.2012.04.026 22633487 263. Bonfil R.D. Bustuoabad O.D. Ruggiero R.A. Meiss R.P. Pasqualini C.D. Tumor Necrosis Can Facilitate the Appearance of Metastases Clin. Exp. Metastasis 1988 6 121 129 10.1007/BF01784843 3345611 264. Huang H.C. Sung Y.C. Li C.P. Wan D. Chao P.H. Tseng Y.T. Liao B.W. Cheng H.T. Hsu F.F. Huang C.C. Reversal of Pancreatic Desmoplasia by a Tumour Stroma-Targeted Nitric Oxide Nanogel Overcomes TRAIL Resistance in Pancreatic Tumours Gut 2022 71 1843 1855 10.1136/gutjnl-2021-325180 34921062 PMC9380514 265. Fisher J.W. Sarkar S. Buchanan C.F. Szot C.S. Whitney J. Hatcher H.C. Torti S.V. Rylander C.G. Rylander M.N. Photothermal Response of Human and Murine Cancer Cells to Multiwalled Carbon Nanotubes after Laser Irradiation Cancer Res. 2010 70 9855 9864 10.1158/0008-5472.CAN-10-0250 21098701 PMC3699181 266. Gottesman M.M. Fojo T. Bates S.E. Multidrug Resistance in Cancer: Role of ATP-Dependent Transporters Nat. Rev. Cancer 2002 2 48 58 10.1038/nrc706 11902585 267. Zhang M. Liu E. Cui Y. Huang Y. Nanotechnology-Based Combination Therapy for Overcoming Multidrug-Resistant Cancer Cancer Biol. Med. 2017 14 212 227 10.20892/j.issn.2095-3941.2017.0054 28884039 PMC5570599 268. Li L. Zhang B. Liu Y. Gao R. Zhou J. Fu L.M. Wang J. A Spontaneous Membrane-Adsorption Approach to Enhancing Second Near-Infrared Deep-Imaging-Guided Intracranial Tumor Therapy ACS Nano 2021 15 4518 4533 10.1021/acsnano.0c08532 33619957 269. Lin Y. Li C. Liu A. Zhen X. Gao J. Wu W. Cai W. Jiang X. Responsive Hyaluronic Acid-Gold Cluster Hybrid Nanogel Theranostic Systems Biomater. Sci. 2021 9 1363 1373 10.1039/D0BM01815E 33367388 PMC7934158 270. Wang Y. Zu M. Ma X. Jia D. Lu Y. Zhang T. Xue P. Kang Y. Xu Z. Glutathione-Responsive Multifunctional “Trojan Horse” Nanogel as a Nanotheranostic for Combined Chemotherapy and Photodynamic Anticancer Therapy ACS Appl. Mater. Interfaces 2020 12 50896 50908 10.1021/acsami.0c15781 33107728 271. Xu F. Zhu J. Lin L. Zhang C. Sun W. Fan Y. Yin F. van Hest J.C.M. Wang H. Du L. Multifunctional PVCL Nanogels with Redox-Responsiveness Enable Enhanced MR Imaging and Ultrasound-Promoted Tumor Chemotherapy Theranostics 2020 10 4349 4358 10.7150/thno.43402 32292499 PMC7150492 272. Peng N. Ding X. Wang Z. Cheng Y. Gong Z. Xu X. Gao X. Cai Q. Huang S. Liu Y. Novel Dual Responsive Alginate-Based Magnetic Nanogels for Onco-Theranostics Carbohydr. Polym. 2019 204 32 41 10.1016/j.carbpol.2018.09.084 30366540 273. Zhu Y. Wang X. Chen J. Zhang J. Meng F. Deng C. Cheng R. Feijen J. Zhong Z. Bioresponsive and Fluorescent Hyaluronic Acid-Iodixanol Nanogels for Targeted X-Ray Computed Tomography Imaging and Chemotherapy of Breast Tumors J. Control. Release 2016 244 229 239 10.1016/j.jconrel.2016.08.027 27568289 274. Kelkar S.S. Reineke T.M. Theranostics: Combining Imaging and Therapy Bioconjug. Chem. 2011 22 1879 1903 10.1021/bc200151q 21830812 275. Zhao C. Sun S. Li S. Lv A. Chen Q. Jiang K. Jiang Z. Li Z. Wu A. Lin H. Programmed Stimuli-Responsive Carbon Dot-Nanogel Hybrids for Imaging-Guided Enhanced Tumor Phototherapy ACS Appl. Mater. Interfaces 2022 14 10142 10153 10.1021/acsami.2c00174 35175020 276. Pan Y.T. Ding Y.F. Han Z.H. Yuwen L. Ye Z. Mok G.S.P. Li S. Wang L.H. Hyaluronic Acid-Based Nanogels Derived from Multicomponent Self-Assembly for Imaging-Guided Chemo-Photodynamic Cancer Therapy Carbohydr. Polym. 2021 268 118257 10.1016/j.carbpol.2021.118257 34127228 277. Duan Q.Y. Zhu Y.X. Jia H.R. Guo Y. Zhang X. Gu R. Li C. Wu F.G. Platinum-Coordinated Dual-Responsive Nanogels for Universal Drug Delivery and Combination Cancer Therapy Small 2022 18 e2203260 10.1002/smll.202203260 36333101 278. Clegg J.R. Irani A.S. Ander E.W. Ludolph C.M. Venkataraman A.K. Zhong J.X. Peppas N.A. Synthetic Networks with Tunable Responsiveness, Biodegradation, and Molecular Recognition for Precision Medicine Applications Sci. Adv. 2019 5 eaax7946 10.1126/sciadv.aax7946 31598554 PMC6764836 279. Miura R. Sawada S.I. Mukai S.A. Sasaki Y. Akiyoshi K. Antigen Delivery to Antigen-Presenting Cells for Adaptive Immune Response by Self-Assembled Anionic Polysaccharide Nanogel Vaccines Biomacromolecules 2020 21 621 629 10.1021/acs.biomac.9b01351 31800235 280. Hilf N. Kuttruff-Coqui S. Frenzel K. Bukur V. Stevanović S. Gouttefangeas C. Platten M. Tabatabai G. Dutoit V. van der Burg S.H. Actively Personalized Vaccination Trial for Newly Diagnosed Glioblastoma Nature 2019 565 240 245 10.1038/s41586-018-0810-y 30568303 281. Mosquera M.J. Kim S. Zhou H. Jing T.T. Luna M. Guss J.D. Reddy P. Lai K. Leifer C.A. Brito I.L. Immunomodulatory Nanogels Overcome Restricted Immunity in a Murine Model of Gut Microbiome–Mediated Metabolic Syndrome Sci. Adv. 2019 5 eaav9788 10.1126/sciadv.aav9788 30944865 PMC6436937 282. Yue H. Wei W. Gu Z. Ni D. Luo N. Yang Z. Zhao L. Garate J.A. Zhou R. Su Z. Exploration of Graphene Oxide as an Intelligent Platform for Cancer Vaccines Nanoscale 2015 7 19949 19957 10.1039/C5NR04986E 26419315 283. Shao K. Singha S. Clemente-Casares X. Tsai S. Yang Y. Santamaria P. Nanoparticle-Based Immunotherapy for Cancer ACS Nano 2015 9 16 30 10.1021/nn5062029 25469470 284. Li D. Sun F. Bourajjaj M. Chen Y. Pieters E.H. Chen J. Van Den Dikkenberg J.B. Lou B. Camps M.G.M. Ossendorp F. Strong: In Vivo Antitumor Responses Induced by an Antigen Immobilized in Nanogels via Reducible Bonds Nanoscale 2016 8 19592 19604 10.1039/C6NR05583D 27748778 285. Mehta N.K. Moynihan K.D. Irvine D.J. Engineering New Approaches to Cancer Vaccines Cancer Immunol. Res. 2015 3 836 843 10.1158/2326-6066.CIR-15-0112 26156157 PMC4527881 286. Warnatsch A. Bergann T. Krüger E. Oxidation Matters: The Ubiquitin Proteasome System Connects Innate Immune Mechanisms with MHC Class I Antigen Presentation Mol. Immunol. 2013 55 106 109 10.1016/j.molimm.2012.10.007 23140834 287. Palucka K. Banchereau J. Cancer Immunotherapy via Dendritic Cells Nat. Rev. Cancer 2012 12 265 277 10.1038/nrc3258 22437871 PMC3433802 288. Wang C. Li P. Liu L. Pan H. Li H. Cai L. Ma Y. Self-Adjuvanted Nanovaccine for Cancer Immunotherapy: Role of Lysosomal Rupture-Induced ROS in MHC Class I Antigen Presentation Biomaterials 2016 79 88 100 10.1016/j.biomaterials.2015.11.040 26702587 289. Mier A. Maffucci I. Merlier F. Prost E. Montagna V. Ruiz-Esparza G.U. Bonventre J.V. Dhal P.K. Tse Sum Bui B. Sakhaii P. Molecularly Imprinted Polymer Nanogels for Protein Recognition: Direct Proof of Specific Binding Sites by Solution STD and WaterLOGSY NMR Spectroscopies Angew. Chem.-Int. Ed. 2021 60 20849 20857 10.1002/anie.202106507 34296498 PMC8562893 290. Vlatakis G. Andersson L.I. Müller R. Mosbach K. Drug Assay Using Antibody Mimics Made by Molecular Imprinting Nature 1993 361 645 647 10.1038/361645a0 8437624 291. Takeuchi T. Kitayama Y. Sasao R. Yamada T. Toh K. Matsumoto Y. Kataoka K. Molecularly Imprinted Nanogels Acquire Stealth In Situ by Cloaking Themselves with Native Dysopsonic Proteins Angew. Chem.-Int. Ed. 2017 56 7088 7092 10.1002/anie.201700647 28455941 292. Montanari E. Mancini P. Galli F. Varani M. Santino I. Coviello T. Mosca L. Matricardi P. Rancan F. Di Meo C. Biodistribution and Intracellular Localization of Hyaluronan and Its Nanogels. A Strategy to Target Intracellular S. Aureus in Persistent Skin Infections J. Control. Release 2020 326 1 12 10.1016/j.jconrel.2020.06.007 32553788 293. Weldrick P.J. Hardman M.J. Paunov V.N. Enhanced Clearing of Wound-Related Pathogenic Bacterial Biofilms Using Protease-Functionalized Antibiotic Nanocarriers ACS Appl. Mater. Interfaces 2019 11 43902 43919 10.1021/acsami.9b16119 31718141 294. Lin H.Y. Wang S.W. Mao J.Y. Chang H.T. Harroun S.G. Lin H.J. Huang C.C. Lai J.Y. Carbonized Nanogels for Simultaneous Antibacterial and Antioxidant Treatment of Bacterial Keratitis Chem. Eng. J. 2021 411 128469 10.1016/j.cej.2021.128469 295. Li B. Xie J. Yuan Z. Jain P. Lin X. Wu K. Jiang S. Mitigation of Inflammatory Immune Responses with Hydrophilic Nanoparticles Angew. Chem.-Int. Ed. 2018 57 4527 4531 10.1002/anie.201710068 29436098 296. Wang Y. Fu S. Lu Y. Lai R. Liu Z. Luo W. Xu Y. Chitosan/Hyaluronan Nanogels Co-Delivering Methotrexate and 5-Aminolevulinic Acid: A Combined Chemo-Photodynamic Therapy for Psoriasis Carbohydr. Polym. 2022 277 118819 10.1016/j.carbpol.2021.118819 34893236 297. Choi Y. Arron J.R. Townsend M.J. Promising Bone-Related Therapeutic Targets for Rheumatoid Arthritis Nat. Rev. Rheumatol. 2009 5 543 548 10.1038/nrrheum.2009.175 19798028 PMC2797318 298. Liddelow S.A. Barres B.A. Reactive Astrocytes: Production, Function, and Therapeutic Potential Immunity 2017 46 957 967 10.1016/j.immuni.2017.06.006 28636962 299. Liddelow S.A. Guttenplan K.A. Clarke L.E. Bennett F.C. Bohlen C.J. Schirmer L. Bennett M.L. Münch A.E. Chung W.S. Peterson T.C. Neurotoxic Reactive Astrocytes Are Induced by Activated Microglia Nature 2017 541 481 487 10.1038/nature21029 28099414 PMC5404890 300. Vismara I. Papa S. Veneruso V. Mauri E. Mariani A. De Paola M. Affatato R. Rossetti A. Sponchioni M. Moscatelli D. Selective Modulation of A1 Astrocytes by Drug-Loaded Nano-Structured Gel in Spinal Cord Injury ACS Nano 2020 14 360 371 10.1021/acsnano.9b05579 31887011 301. Knipe J.M. Strong L.E. Peppas N.A. Enzyme- and PH-Responsive Microencapsulated Nanogels for Oral Delivery of SiRNA to Induce TNF-α Knockdown in the Intestine Biomacromolecules 2016 17 788 797 10.1021/acs.biomac.5b01518 26813877 302. Yeo J. Lee Y.M. Lee J. Park D. Kim K. Kim J. Park J. Kim W.J. Nitric Oxide-Scavenging Nanogel for Treating Rheumatoid Arthritis Nano Lett. 2019 19 6716 6724 10.1021/acs.nanolett.9b00496 31082252 303. Nagy G. Koncz A. Telarico T. Fernandez D. Érsek B. Buzás E. Perl A. Central Role of Nitric Oxide in the Pathogenesis of Rheumatoid Arthritis and Sysemic Lupus Erythematosus Arthritis Res. Ther. 2010 12 210 216 10.1186/ar3045 20609263 PMC2911902 304. Kolios G. Valatas V. Ward S.G. Nitric Oxide in Inflammatory Bowel Disease: A Universal Messenger in an Unsolved Puzzle Immunology 2004 113 427 437 10.1111/j.1365-2567.2004.01984.x 15554920 PMC1782592 305. Vincent J.L. Zhang H. Szabo C. Preiser J.C. Effects of Nitric Oxide in Septic Shock Am. J. Respir. Crit. Care Med. 2000 161 1781 1785 10.1164/ajrccm.161.6.9812004 10852744 306. Li L. Fu L. Ai X. Zhang J. Zhou J. Design and Fabrication of Temperature-Sensitive Nanogels with Controlled Drug Release Properties for Enhanced Photothermal Sterilization Chem.—A Eur. J. 2017 23 18180 18186 10.1002/chem.201702796 28809441 307. Chen Y.F. Chiou Y.H. Chen Y.C. Jiang Y.S. Lee T.Y. Jan J.S. ZnO-Loaded DNA Nanogels as Neutrophil Extracellular Trap-like Structures in the Treatment of Mouse Peritonitis Mater. Sci. Eng. C 2021 131 112484 10.1016/j.msec.2021.112484 34857270 308. Cai X. Tian J. Zhu J. Chen J. Li L. Yang C. Chen J. Chen D. Photodynamic and Photothermal Co-Driven CO-Enhanced Multi-Mode Synergistic Antibacterial Nanoplatform to Effectively Fight against Biofilm Infections Chem. Eng. J. 2021 426 131919 10.1016/j.cej.2021.131919 309. Weldrick P.J. Iveson S. Hardman M.J. Paunov V.N. Breathing New Life into Old Antibiotics: Overcoming Antibacterial Resistance by Antibiotic-Loaded Nanogel Carriers with Cationic Surface Functionality Nanoscale 2019 11 10472 10485 10.1039/C8NR10022E 31112150 310. Zhu J. Li F. Wang X. Yu J. Wu D. Hyaluronic Acid and Polyethylene Glycol Hybrid Hydrogel Encapsulating Nanogel with Hemostasis and Sustainable Antibacterial Property for Wound Healing ACS Appl. Mater. Interfaces 2018 10 13304 13316 10.1021/acsami.7b18927 29607644 311. Al-Awady M.J. Fauchet A. Greenway G.M. Paunov V.N. Enhanced Antimicrobial Effect of Berberine in Nanogel Carriers with Cationic Surface Functionality J. Mater. Chem. B 2017 5 7885 7897 10.1039/c7tb02262j 32264390 312. Li N. Han H. Li M. Qiu W. Wang Q. Qi X. He Y. Wang X. Liu L. Yu J. Eco-Friendly and Intrinsic Nanogels for Durable Flame Retardant and Antibacterial Properties Chem. Eng. J. 2021 415 129008 10.1016/j.cej.2021.129008 313. Han H. Zhu J. Wu D.Q. Li F.X. Wang X.L. Yu J.Y. Qin X.H. Inherent Guanidine Nanogels with Durable Antibacterial and Bacterially Antiadhesive Properties Adv. Funct. Mater. 2019 29 1806594 10.1002/adfm.201806594 314. Panja S. Bharti R. Dey G. Lynd N.A. Chattopadhyay S. Coordination-Assisted Self-Assembled Polypeptide Nanogels to Selectively Combat Bacterial Infection ACS Appl. Mater. Interfaces 2019 11 33599 33611 10.1021/acsami.9b10153 31429277 315. Flemming H.C. Wingender J. The Biofilm Matrix Nat. Rev. Microbiol. 2010 8 623 633 10.1038/nrmicro2415 20676145 316. Costerton J.W. Lewandowski Z. Caldwell D.E. Korber D.R. Lappin-Scott H.M. Microbial Biofilms Annu. Rev. Microbiol. 1995 49 711 745 10.1146/annurev.mi.49.100195.003431 8561477 317. Ashrafi B. Rashidipour M. Marzban A. Soroush S. Azadpour M. Delfani S. Ramak P. Mentha Piperita Essential Oils Loaded in a Chitosan Nanogel with Inhibitory Effect on Biofilm Formation against S. Mutans on the Dental Surface Carbohydr. Polym. 2019 212 142 149 10.1016/j.carbpol.2019.02.018 30832841 318. Wang A. Weldrick P.J. Madden L.A. Paunov V.N. Biofilm-Infected Human Clusteroid Three-Dimensional Coculture Platform to Replace Animal Models in Testing Antimicrobial Nanotechnologies ACS Appl. Mater. Interfaces 2021 13 22182 22194 10.1021/acsami.1c02679 33956425 319. Horvat S. Yu Y. Böjte S. Teßmer I. Lowman D.W. Ma Z. Williams D.L. Beilhack A. Albrecht K. Groll J. Engineering Nanogels for Drug Delivery to Pathogenic Fungi Aspergillus Fumigatus by Tuning Polymer Amphiphilicity Biomacromolecules 2020 21 3112 3121 10.1021/acs.biomac.0c00489 32603103 320. Kłodzińska S.N. Wan F. Jumaa H. Sternberg C. Rades T. Nielsen H.M. Utilizing Nanoparticles for Improving Anti-Biofilm Effects of Azithromycin: A Head-to-Head Comparison of Modified Hyaluronic Acid Nanogels and Coated Poly (Lactic-Co-Glycolic Acid) Nanoparticles J. Colloid Interface Sci. 2019 555 595 606 10.1016/j.jcis.2019.08.006 31404843 321. Li C. Liu X. Liu Y. Huang F. Wu G. Liu Y. Zhang Z. Ding Y. Lv J. Ma R. Glucose and H 2 2 Nanoscale 2019 11 9163 9175 10.1039/C9NR01554J 31038150 322. Chou H.S. Larsson M. Hsiao M.H. Chen Y.C. Röding M. Nydén M. Liu D.M. Injectable Insulin-Lysozyme-Loaded Nanogels with Enzymatically-Controlled Degradation and Release for Basal Insulin Treatment: In Vitro Characterization and in Vivo Observation J. Control. Release 2016 224 33 42 10.1016/j.jconrel.2015.12.036 26723525 323. Wang X. Cheng D. Liu L. Li X. Development of Poly(Hydroxyethyl Methacrylate) Nanogel for Effective Oral Insulin Delivery Pharm. Dev. Technol. 2018 23 351 357 10.1080/10837450.2017.1295064 28655281 324. Li C. Wu G. Ma R. Liu Y. Liu Y. Lv J. An Y. Shi L. Nitrilotriacetic Acid (NTA) and Phenylboronic Acid (PBA) Functionalized Nanogels for Efficient Encapsulation and Controlled Release of Insulin ACS Biomater. Sci. Eng. 2018 4 2007 2017 10.1021/acsbiomaterials.7b00546 33445271 325. Hejaz H.A. Palestinian Strategies, Guidelines, and Challenges in the Treatment and Management of Coronavirus Disease-2019 (COVID-19) Avicenna J. Med. 2020 10 135 162 10.4103/ajm.ajm_171_20 33437687 PMC7791278 326. Sharp P.M. Hahn B.H. Origins of HIV and the AIDS Pandemic Cold Spring Harb. Perspect. Med. 2011 1 a006841 10.1101/cshperspect.a006841 22229120 PMC3234451 327. Dick O.B. San Martín J.L. Montoya R.H. Del Diego J. Zambrano B. Dayan G.H. Review: The History of Dengue Outbreaks in the Americas Am. J. Trop. Med. Hyg. 2012 87 584 593 10.4269/ajtmh.2012.11-0770 23042846 PMC3516305 328. Chowell G. Echevarría-Zuno S. Viboud C. Simonsen L. Tamerius J. Miller M.A. Borja-Aburto V.H. Characterizing the Epidemiology of the 2009 Influenza A/H1N1 Pandemic in Mexico PLoS Med. 2011 8 e1000436 10.1371/journal.pmed.1000436 21629683 PMC3101203 329. Kim Y. Thapa M. Hua D.H. Chang K.O. Biodegradable Nanogels for Oral Delivery of Interferon for Norovirus Infection Antivir. Res. 2011 89 165 173 10.1016/j.antiviral.2010.11.016 21144866 PMC3027895 330. Warren G. Makarov E. Lu Y. Senanayake T. Rivera K. Gorantla S. Poluektova L.Y. Vinogradov S.V. Amphiphilic Cationic Nanogels as Brain-Targeted Carriers for Activated Nucleoside Reverse Transcriptase Inhibitors J. Neuroimmune Pharmacol. 2015 10 88 101 10.1007/s11481-014-9576-7 25559020 PMC4336642 331. Jang H. Sutradhar S.C. Ryu T. Choi K. Yoon S. Lee S. Kim W. Preparation and Characterization of Anti-Scratch Polycarbonate Containing Acrylate Group J. Nanosci. Nanotechnol. 2017 17 7454 7459 10.1166/jnn.2017.14809 332. Hossain M.A. Jang H. Sutradhar S.C. Ha J. Yoo J. Lee C. Lee S. Kim W. Novel Hydroxide Conducting Sulfonium-Based Anion Exchange Membrane for Alkaline Fuel Cell Applications Int. J. Hydrogen Energy 2016 41 10458 10465 10.1016/j.ijhydene.2016.01.051 333. Lopa N.S. Rahman M.M. Jang H. Sutradhar S.C. Ahmed F. Ryu T. Kim W. A Glassy Carbon Electrode Modified with Poly(2,4-Dinitrophenylhydrazine) for Simultaneous Detection of Dihydroxybenzene Isomers Microchim. Acta 2018 185 23 10.1007/s00604-017-2567-7 29594658 334. Cai G. Yang J. Wang L. Chen C. Cai C. Gong H. A Point-to-Point “Cap” Strategy to Construct a Highly Selective Dual-Function Molecularly-Imprinted Sensor for the Simultaneous Detection of HAV and HBV Biosens. Bioelectron. 2023 219 114794 10.1016/j.bios.2022.114794 36279822 335. Bhatia S. Hilsch M. Cuellar-Camacho J.L. Ludwig K. Nie C. Parshad B. Wallert M. Block S. Lauster D. Böttcher C. Adaptive Flexible Sialylated Nanogels as Highly Potent Influenza A Virus Inhibitors Angew. Chem.-Int. Ed. 2020 59 12417 12422 10.1002/anie.202006145 PMC7384064 32441859 336. Nagatomo D. Taniai M. Ariyasu H. Taniguchi M. Aga M. Ariyasu T. Ohta T. Fukuda S. Cholesteryl Pullulan Encapsulated TNF-α Nanoparticles Are an Effective Mucosal Vaccine Adjuvant against Influenza Virus Biomed Res. Int. 2015 2015 471468 10.1155/2015/471468 26421290 PMC4569761 337. Nuhn L. Van Hoecke L. Deswarte K. Schepens B. Li Y. Lambrecht B.N. De Koker S. David S.A. Saelens X. De Geest B.G. Potent Anti-Viral Vaccine Adjuvant Based on PH-Degradable Nanogels with Covalently Linked Small Molecule Imidazoquinoline TLR7/8 Agonist Biomaterials 2018 178 643 651 10.1016/j.biomaterials.2018.03.026 29573820 338. Chen L. Liu B. Sun P. Wang W. Luo S. Zhang W. Yang Y. Wang Z. Lin J. Chen P.R. Severe Acute Respiratory Syndrome Coronavirus-2 Spike Protein Nanogel as a Pro-Antigen Strategy with Enhanced Protective Immune Responses Small 2020 16 e2004237 10.1002/smll.202004237 33107685 PMC7645880 339. Wibowo D. Jorritsma S.H.T. Gonzaga Z.J. Evert B. Chen S. Rehm B.H.A. Polymeric Nanoparticle Vaccines to Combat Emerging and Pandemic Threats Biomaterials 2021 268 120597 10.1016/j.biomaterials.2020.120597 33360074 PMC7834201 340. Vasilakos J.P. Tomai M.A. The Use of Toll-like Receptor 7/8 Agonists as Vaccine Adjuvants Expert Rev. Vaccines 2013 12 809 819 10.1586/14760584.2013.811208 23885825 341. Dey P. Bergmann T. Cuellar-Camacho J.L. Ehrmann S. Chowdhury M.S. Zhang M. Dahmani I. Haag R. Azab W. Multivalent Flexible Nanogels Exhibit Broad-Spectrum Antiviral Activity by Blocking Virus Entry ACS Nano 2018 12 6429 6442 10.1021/acsnano.8b01616 29894156 342. Nguyen T.D. Nguyen T.N. Nguyen T.T.T. Ivanov I.A. Nguyen K.C. Tran Q.N. Hoang A.N. Utkin Y.N. Nanoencapsulation Enhances Anticoagulant Activity of Adenosine and Dipeptide IleTrp Nanomaterials 2019 9 1191 10.3390/nano9091191 31443607 PMC6780593 343. Xu X. Huang X. Zhang Y. Shen S. Feng Z. Dong H. Zhang C. Mo R. Self-Regulated Hirudin Delivery for Anticoagulant Therapy Sci. Adv. 2020 6 eabc0382 10.1126/sciadv.abc0382 33036973 PMC7546707 344. Wang Y. Wu H. Zhou Z. Maitz M.F. Liu K. Zhang B. Yang L. Luo R. Wang Y. A Thrombin-Triggered Self-Regulating Anticoagulant Strategy Combined with Anti-Inflammatory Capacity for Blood-Contacting Implants Sci. Adv. 2022 8 eabm3378 10.1126/sciadv.abm3378 35245113 PMC8896797 345. Nan D. Jin H. Yang D. Yu W. Jia J. Yu Z. Tan H. Sun Y. Hao H. Qu X. Combination of Polyethylene Glycol-Conjugated Urokinase Nanogels and Urokinase for Acute Ischemic Stroke Therapeutic Implications Transl. Stroke Res. 2021 12 844 857 10.1007/s12975-020-00865-2 33067776 346. Lee J.H. Lee H. Joung Y.K. Jung K.H. Choi J.H. Lee D.H. Park K.D. Hong S.S. The Use of Low Molecular Weight Heparin-Pluronic Nanogels to Impede Liver Fibrosis by Inhibition the TGF-β/Smad Signaling Pathway Biomaterials 2011 32 1438 1445 10.1016/j.biomaterials.2010.10.023 21074845 347. Eskandari S.K. Sulkaj I. Melo M.B. Li N. Allos H. Alhaddad J.B. Kollar B. Borges T.J. Eskandari A.S. Zinter M.A. Regulatory T Cells Engineered with TCR Signaling-Responsive IL-2 Nanogels Suppress Alloimmunity in Sites of Antigen Encounter Sci. Transl. Med. 2020 12 eaaw4744 10.1126/scitranslmed.aaw4744 33177180 PMC8519505 348. Ashrafi H. Azadi A. Mohammadi-Samani S. Hamidi M. New Candidate Delivery System for Alzheimer’s Disease: Deferoxamine Nanogels Biointerface Res. Appl. Chem. 2020 10 7106 7119 10.33263/briac106.71067119 349. Prieto M. Usón L. Garcia-Salinas S. Yus C. Landa G. Alejo T. Lujan L. Perez M. Irusta S. Sebastian V. Light Activated Pulsatile Drug Delivery for Prolonged Peripheral Nerve Block Biomaterials 2022 283 121453 10.1016/j.biomaterials.2022.121453 35272224 350. Van Hoeck J. Van de Vyver T. Harizaj A. Goetgeluk G. Merckx P. Liu J. Wels M. Sauvage F. De Keersmaecker H. Vanhove C. Hydrogel-Induced Cell Membrane Disruptions Enable Direct Cytosolic Delivery of Membrane-Impermeable Cargo Adv. Mater. 2021 33 2008054 10.1002/adma.202008054 34106486 351. Ussar S. Griffin N.W. Bezy O. Fujisaka S. Vienberg S. Softic S. Deng L. Bry L. Gordon J.I. Kahn C.R. Interactions between Gut Microbiota, Host Genetics and Diet Modulate the Predisposition to Obesity and Metabolic Syndrome Cell Metab. 2015 22 516 530 10.1016/j.cmet.2015.07.007 26299453 PMC4570502 352. Lu Y. Hajifathalian K. Ezzati M. Woodward M. Rimm E.B. Danaei G. Selmer R. Strand B.H. Dobson A. Hozawa A. Metabolic Mediators of the Effects of Body-Mass Index, Overweight, and Obesity on Coronary Heart Disease and Stroke: A Pooled Analysis of 97 Prospective Cohorts with 1.8 Million Participants Lancet 2014 383 970 983 10.1016/S0140-6736(13)61836-X 24269108 PMC3959199 353. Lusis A.J. Attie A.D. Reue K. Metabolic Syndrome: From Epidemiology to Systems Biology Nat. Rev. Genet. 2008 9 819 830 10.1038/nrg2468 18852695 PMC2829312 354. Kau A.L. Ahern P.P. Griffin N.W. Goodman A.L. Gordon J.I. Human Nutrition, the Gut Microbiome and the Immune System Nature 2011 474 327 336 10.1038/nature10213 21677749 PMC3298082 355. Sheridan P.A. Paich H.A. Handy J. Karlsson E.A. Hudgens M.G. Sammon A.B. Holland L.A. Weir S. Noah T.L. Beck M.A. Obesity Is Associated with Impaired Immune Response to Influenza Vaccination in Humans Int. J. Obes. 2012 36 1072 1077 10.1038/ijo.2011.208 PMC3270113 22024641 356. Azegami T. Yuki Y. Sawada S. Mejima M. Ishige K. Akiyoshi K. Itoh H. Kiyono H. Nanogel-Based Nasal Ghrelin Vaccine Prevents Obesity Mucosal Immunol. 2017 10 1351 1360 10.1038/mi.2016.137 28120848 357. Jiang L. Liu H. Huang C. Shen X. Blood Group Antigen Shielding Facilitated by Selective Cell Surface Engineering ACS Appl. Mater. Interfaces 2020 12 22426 22432 10.1021/acsami.0c00914 32347090 358. Gupta J. Sharma G. Nanogel: A Versatile Drug Delivery System for the Treatment of Various Diseases and Their Future Perspective Drug Deliv. Transl. Res. 2025 15 455 482 10.1007/s13346-024-01684-w 39103593 359. Mao W. Jia S. Chen P. Research Progress on Tumor Whole-Cell Vaccines Prepared with Nanoparticles for Tumor Immunotherapy J. Nanoparticle Res. 2023 25 135 10.1007/s11051-023-05792-5 360. Rosales-Mendoza S. González-Ortega O. Nanogels-Based Mucosal Vaccines Nanovaccines: An Innovative Technology to Fight Human and Animal Diseases Springer International Publishing Cham, Switzerland 2019 131 157 978-3-030-31668-6 361. Wagner A.M. Lanier O.L. Savk A. Peppas N.A. Polybasic Nanogels for Intracellular Co-Delivery of Paclitaxel and Carboplatin: A Novel Approach to Ovarian Cancer Therapy RSC Pharm. 2025 2 553 569 10.1039/D4PM00330F 39990011 PMC11843545 362. Mohammadi M. Arabi L. Alibolandi M. Doxorubicin-Loaded Composite Nanogels for Cancer Treatment J. Control. Release 2020 328 171 191 10.1016/j.jconrel.2020.08.033 32866591 363. Chan M. Almutairi A. Nanogels as Imaging Agents for Modalities Spanning the Electromagnetic Spectrum Mater. Horiz. 2016 3 21 40 10.1039/C5MH00161G 27398218 PMC4906372 364. Siafaka P.I. Okur N.Ü. Karantas I.D. Okur M.E. Gündoğdu E.A. Current Update on Nanoplatforms as Therapeutic and Diagnostic Tools: A Review for the Materials Used as Nanotheranostics and Imaging Modalities Asian J. Pharm. Sci. 2021 16 24 46 10.1016/j.ajps.2020.03.003 33613728 PMC7878458 365. Altinbasak I. Alp Y. Sanyal R. Sanyal A. Theranostic Nanogels: Multifunctional Agents for Simultaneous Therapeutic Delivery and Diagnostic Imaging Nanoscale 2024 16 14033 10.1039/D4NR01423E 38990143 366. Ghosh Majumdar A. Pany B. Parua S.S. Mukherjee D. Panda A. Mohanty M. Das B. Si S. Mohanty P.S. Stimuli-Responsive Nanogel/Microgel Hybrids as Targeted Drug Delivery Systems: A Comprehensive Review Bionanoscience 2024 14 3496 3521 10.1007/s12668-024-01577-9 367. Zhou Z. Lu Z.-R. Gadolinium-Based Contrast Agents for Magnetic Resonance Cancer Imaging Wiley Interdiscip. Rev. Nanomed. Nanobiotechnol. 2013 5 190 10.1002/wnan.1198 PMC3552562 23047730 368. Priyanka Abusalah M.A.H. Chopra H. Sharma A. Mustafa S.A. Choudhary O.P. Sharma M. Dhawan M. Khosla R. Loshali A. Nanovaccines: A Game Changing Approach in the Fight against Infectious Diseases Biomed. Pharmacother. 2023 167 115597 10.1016/j.biopha.2023.115597 37783148 369. Esporrín-Ubieto D. Huck-Iriart C. Picco A.S. Beloqui A. Calderón M. Hybrid Nanogel-wrapped Anisotropic Gold Nanoparticles Feature Enhanced Photothermal Stability Small 2024 20 2404097 10.1002/smll.202404097 39221696 PMC11600699 370. Yanar F. Carugo D. Zhang X. Hybrid Nanoplatforms Comprising Organic Nanocompartments Encapsulating Inorganic Nanoparticles for Enhanced Drug Delivery and Bioimaging Applications Molecules 2023 28 5694 10.3390/molecules28155694 37570666 PMC10420199 371. Badir A. Refki S. Sekkat Z. Utilizing Gold Nanoparticles in Plasmonic Photothermal Therapy for Cancer Treatment Heliyon 2025 11 e42738 10.1016/j.heliyon.2025.e42738 40084020 PMC11904586 372. Rahman M. Magnetic Resonance Imaging and Iron-Oxide Nanoparticles in the Era of Personalized Medicine Nanotheranostics 2023 7 424 449 10.7150/ntno.86467 37650011 PMC10464520 373. Zhang N. Xiong G. Liu Z. Toxicity of Metal-Based Nanoparticles: Challenges in the Nano Era Front. Bioeng. Biotechnol. 2022 10 1001572 10.3389/fbioe.2022.1001572 36619393 PMC9822575 374. Khan S.M. Saleemi S. Mannan H.A. Toxicology, Stability, and Recycling of Organic–Inorganic Nanohybrids Hybrid Nanomaterials: Biomedical, Environmental and Energy Applications Rizwan K. Bilal M. Rasheed T. Nguyen T.A. Springer Nature Singapore 2022 485 497 978-981-19-4538-0 375. Li Y. Vulpe C. Lammers T. Pallares R.M. Assessing Inorganic Nanoparticle Toxicity through Omics Approaches Nanoscale 2024 16 15928 15945 10.1039/D4NR02328E 39145718 376. Yu J. Liu Y. Zhang Y. Ran R. Kong Z. Zhao D. Liu M. Zhao W. Cui Y. Hua Y. Smart Nanogels for Cancer Treatment from the Perspective of Functional Groups Front. Bioeng. Biotechnol. 2024 11 1329311 10.3389/fbioe.2023.1329311 38268937 PMC10806105 377. Wang H. Gao L. Fan T. Zhang C. Zhang B. Al-Hartomy O.A. Al-Ghamdi A. Wageh S. Qiu M. Zhang H. Strategic Design of Intelligent-Responsive Nanogel Carriers for Cancer Therapy ACS Appl. Mater. Interfaces 2021 13 54621 54647 10.1021/acsami.1c13634 34767342 378. Moreira A. Carneiro J. Campos J.B.L.M. Miranda J.M. Production of Hydrogel Microparticles in Microfluidic Devices: A Review Microfluid. Nanofluidics 2021 25 10 10.1007/s10404-020-02413-8 379. Yu M. Mathew A. Liu D. Chen Y. Wu J. Zhang Y. Zhang N. Microfluidics for Formulation and Scale-Up Production of Nanoparticles for Biopharma Industry Microfluidics in Pharmaceutical Sciences: Formulation, Drug Delivery, Screening, and Diagnostics Lamprou D.A. Weaver E. Springer Nature Cham, Switzerland 2024 395 420 978-3-031-60717-2 380. Agha A. Waheed W. Stiharu I. Nerguizian V. Destgeer G. Abu-Nada E. Alazzam A. A Review on Microfluidic-Assisted Nanoparticle Synthesis, and Their Applications Using Multiscale Simulation Methods Discov. Nano 2023 18 18 10.1186/s11671-023-03792-x 36800044 PMC9936499 381. Alavi S.E. Alharthi S. Alavi S.F. Alavi S.Z. Zahra G.E. Raza A. Ebrahimi Shahmabadi H. Microfluidics for Personalized Drug Delivery Drug Discov. Today 2024 29 103936 10.1016/j.drudis.2024.103936 38428803 382. Ejeta F. Recent Advances of Microfluidic Platforms for Controlled Drug Delivery in Nanomedicine Drug Des. Devel. Ther. 2021 15 3881 3891 10.2147/DDDT.S324580 34531650 PMC8439440 383. Lai X. Yang M. Wu H. Li D. Modular Microfluidics: Current Status and Future Prospects Micromachines 2022 13 1363 10.3390/mi13081363 36014285 PMC9414757 384. Nunziata G. Borroni A. Rossi F. Advanced Microfluidic Strategies for Core-Shell Nanoparticles: The next-Generation of Polymeric and Lipid-Based Drug Nanocarriers Chem. Eng. J. Adv. 2025 22 100759 10.1016/j.ceja.2025.100759 385. Bi Y. Xie S. Li Z. Dong S. Teng L. Precise Nanoscale Fabrication Technologies, the “Last Mile” of Medicinal Development Acta Pharm. Sin. B 2025 15 2372 2401 10.1016/j.apsb.2025.03.040 40487646 PMC12145073 386. Arora S. Dash S.K. Dhawan D. Sahoo P.K. Jindal A. Gugulothu D. Freeze-Drying Revolution: Unleashing the Potential of Lyophilization in Advancing Drug Delivery Systems Drug Deliv. Transl. Res. 2024 14 1111 1153 10.1007/s13346-023-01477-7 37985541 387. Lee S.-K. Ha E.-S. Park H. Jeong J.-S. Shin C.Y. Kim J.-S. Jeong S.H. Kim M.-S. Lyophilization of Pharmaceuticals: An Overview and Practical Approaches for Developing the Lyophilization Cycle J. Pharm. Investig. 2025 1 25 10.1007/s40005-025-00750-w 388. Seong Y.-J. Lin G. Kim B.J. Kim H.-E. Kim S. Jeong S.-H. Hyaluronic Acid-Based Hybrid Hydrogel Microspheres with Enhanced Structural Stability and High Injectability ACS Omega 2019 4 13834 13844 10.1021/acsomega.9b01475 31497700 PMC6714525 Figures, Scheme and Tables Figure 1 Illustration depicting gel structures across multiple size scales. Redrawn and adapted with permission from Ref. [ 36 gels-11-00761-sch001_Scheme 1 Scheme 1 Schematic representation of various classes of polymeric NG/MGs. Redrawn and adapted with permission from [ 25 36 40 Figure 2 Schematic representation of polymeric MG/NGs classification based on stimulus-responsiveness. Reproduced with permission from Motornov et al. [ 78 Figure 3 Characterization techniques for NGs: ( A 165 B 165 C 166 D 165 E 165 A B D E 165 166 Figure 4 ( A 167 168 169 154 155 156 B C D 36 Figure 5 ( A 170 B 171 C 36 D 172 E 173 Figure 6 Schematic of ( A B 198 Figure 7 ( A B 200 Figure 8 Schematic of poly(phosphorylcholine)-based (HPMPC) NG with extended circulation, BBB penetration, and hypoxia-responsive drug release for glioblastoma therapy, reproduced with permission from ref. [ 22 Figure 9 Chemical structure of NG/HCPT and its metabolic pathway in vivo. NG/HCPT accumulates in tumor tissue due to mucoadhesion and cellular uptake, with GSH-triggered HCPT release, reproduced with permission from ref. [ 218 Figure 10 Reduction-responsive chemo-capsule-based prodrug NG for enhanced chemotherapy, reproduced with permission from ref. [ 202 Figure 11 Bioresponsive fluorescent HA NGs for protein encapsulation and tumor-targeted delivery via inverse nanoprecipitation and photoclick chemistry, reproduced with permission from ref. [ 226 Figure 12 Illustration of the responsive enzyme-driven therapy (EDT) mechanism and synthesis of SCNGs; ( A 2 − 2 2 2 2 1 2 B 2 − 2 2 1 2 229 Figure 13 Preparation of PGED-NG and its complexes with pDNA and siRNA for nucleic acid delivery [ 242 201 Figure 14 Crosslinked NG formation and siRNA delivery in vivo, reproduced with permission from ref. [ 243 Figure 15 Virus-mimicking nucleic acid NG (Vir-Gel) for glioblastoma therapy. ( A B 238 Figure 16 Synthesis of PDA-coated nucleic acid NG and its role in siRNA-mediated low-temperature photothermal therapy. ( A B 257 Figure 17 Rational design of Dox-encapsulated NGs acting as ‘Trojan horses’ for enhanced cellular uptake and nuclear drug delivery to overcome MDR, reproduced with permission from ref. [ 254 Figure 18 NGs for cancer therapy. ( A 258 B 190 Figure 19 NGs for cancer therapy. ( A 191 B 278 Figure 20 NGs as vaccines. ( A 288 B C 241 Figure 21 ( A B 291 Figure 22 NGs for anti-inflammatory therapy. ( A 302 B 306 C 307 D 293 E 308 Figure 23 NGs for diabetes treatment. Glucose-responsive insulin release from P(NIPAM-co-AAPBA-co-AANTA) NG. Reprinted with permission from Ref. [ 324 Figure 24 Development of a redox-responsive NG (S-RBD-NG) incorporating the SARS-CoV-2 spike receptor-binding domain (S-RBD) as a pro-antigen platform for COVID-19 subunit vaccines. The NG enhances delivery to lymph nodes and uptake by antigen-presenting cells (APCs). Once internalized, the NG gradually releases S-RBD monomers, promoting a stronger immune response capable of neutralizing the virus, reproduced with permission from ref. [ 338 Figure 25 ( A B 343 Figure 26 Function of MIgels in selective binding with B antigen to block antibody recognition, reproduced with permission from ref. [ 357 gels-11-00761-t001_Table 1 Table 1 Gel Particle Architectures and Their Key Features [ 36 Architecture Type Description and Characteristics Ultralow Crosslinked MGs These particles have extremely low crosslinking density and swell rapidly in solvents. Despite the absence of chemical crosslinkers, physical interactions can still form a stable polymer network [ 122 123 Uniform Structure Features a consistent internal architecture with evenly distributed polymer chains and crosslinking points, resulting in homogeneous particle properties. Core–Shell Composed of a dense central core surrounded by a softer outer shell. This structure is typically achieved by using different monomers or crosslinkers in each region. Core–Corona Similar to core–shell but with a more gradual transition between core and outer regions. The crosslinking density is more evenly distributed, leading to a less defined boundary. Hollow Particles Created by removing the inner core through chemical or physical methods, or via degradable core strategies followed by shell formation. These are often referred to as capsules [ 124 125 Multicore/Multishell Designed to encapsulate multiple agents within separate compartments, enabling staged or sequential release of payloads [ 126 127 128 Multilayered Network Constructed through stepwise chemical or physical modifications, allowing for enhanced protection, stability, and multifunctionality within a single particle [ 129 130 gels-11-00761-t002_Table 2 Table 2 NG/MGs Synthesis Methods [ 144  Category Specific Technique Description Refs. MGs Homogeneous Nucleation Emulsion Polymerization Monomers and crosslinkers are dispersed in water to form a uniform solution. Polymerization occurs under conditions that prevent macrogel formation. [ 145 Emulsification: W/O Heterogeneous Emulsion Emulsion Polymerization Water-soluble monomers and bioactives are emulsified in oil using surfactants and shear forces. Gelation is induced chemically or thermally. [ 146 147 Inverse Microemulsion Polymerization Inverse Emulsion Polymerization Monomer droplets are dispersed in an oil phase by mechanical stirring, allowing for the incorporation of drugs and other substances. Crosslinking agents are used. [ 148 Membrane Emulsification Membrane Emulsification An emulsion is passed through membrane pores into a nanofluid phase to create MGs. [ 131 Heterogeneous Controlled/Living Radical Polymerization Controlled Radical Polymerization Includes stable radical polymerization, RAFT, and transfer radical polymerization techniques. [ 131 Polymer Complexation Polyelectrolyte Complexation MGs are formed by mixing oppositely charged polymer solutions, resulting in polyelectrolyte complexes. [ 67 Radiation Radiation-Induced Polymerization Polymer solution is placed in molds and exposed to γ-rays for crosslinking and sterilization. Hydroxyl radicals from water radiolysis react with polymer chains. [ 149 150 Physical-Based Methods Photolithographic Techniques Monomer solution with photoinitiator and crosslinker is exposed to UV or laser light. Masks and stamps control MG size and shape. [ 148 Micromolding Method Polymer solution is placed in a mold, and gelation occurs via temperature change or gelling agent. [ 151 Microfluidic and Droplet Formation Polymer solutions are injected into an oil phase and crosslinked using microfluidic devices to form particles with specific morphologies. [ 147 NGs Traditional Method Emulsion Polymerization Simultaneous polymerization and crosslinking in an emulsion system. [ 137 140 Precipitation Polymerization Polymerization in a solvent where the polymer is insoluble, forming NGs. [ 137 Inverse Emulsion Polymerization Polymerization in aqueous droplets dispersed in the oil phase. [ 137 Dispersion Polymerization Polymerization in a medium where monomers are soluble but polymers precipitate. [ 137 Controlled Radical Polymerization Includes ATRP, RAFT, and iodine-mediated polymerization techniques. [ 152 Uncontrolled Radical Polymerization Polymerization without control over molecular weight or structure. [ 137 Crosslinking of Polymer Precursors Disulfide-Based Crosslinking Crosslinking via disulfide bonds for redox-responsive NGs. [ 137 140 Amine-Based Crosslinking Crosslinking via amine groups for stable NG networks. [ 137 140 Imine Crosslinking Formation of imine bonds for pH-sensitive NGs. [ 92 105 Click Chemistry-Based Crosslinking Efficient crosslinking using azide-alkyne cycloaddition. [ 137 140 Photoinduced Crosslinking Crosslinking is initiated by light exposure. Physical Crosslinking Non-covalent interactions are used for reversible NG formation. Controlled Aggregation Self-assembly of hydrophilic polymers into NGs. [ 141 Template-Assisted Fabrication Photolithography NGs formed using light exposure through templates. [ 137 141 153 Micromolding Techniques NGs formed by molding polymer solutions. [ 137 141 153 Novel Methods Pullulan Chemistry Modification Modified pullulan used for novel NG synthesis. [ 153 Photochemical Approach New photochemical techniques for NG formation. Radical Polymerization with Inverse Mini-Emulsion Combines radical polymerization with mini-emulsion technology. Addition-Fragmentation Transfer Process Advanced polymerization technique for NG synthesis. Chemical Modification Chemical alteration of polymers to form NGs. gels-11-00761-t003_Table 3 Table 3 Comparative Summary of Two NG/MGs Fabrication Routes. Attribute Inverse Microemulsion Radiation-Induced Typical size & dispersity 20–200 nm; narrow (droplet-templated) [ 158 50–300 nm; dose- and concentration-dependent [ 12 Encapsulation bias Hydrophilic biomolecules (aqueous core) [ 157 Broad; limited by radiation sensitivity [ 162 Chemistry scope Water-soluble vinyl monomers (AAm, NIPAM, PEG-MA) [ 157 Radiation-sensitive polymers (PVA, PEG, PVP, chitosan, PAA) [ 161 Process intensity High surfactant load; batch-wise [ 156 Initiator-free; sterilization built-in; continuous possible [ 161 Main bottlenecks Surfactant removal; scale-up limitations [ 156 Facility access; payload degradation risk [ 161 Recent highlights Tunable pH/thermal responses; green formulations [ 156 Cancer-targeted pH-responsive systems; clean injectables [ 162 gels-11-00761-t004_Table 4 Table 4 Scalability and Application Relevance. Feature Inverse Microemulsion Polymerization Radiation-Induced Polymerization Scalability Limited (batch-wise) [ 163 High (continuous processing) [ 161 Biocompatibility Moderate (surfactant residues) [ 164 High (initiator-free) [ 161 Sterilization Requires a separate step [ 164 Built-in during synthesis [ 161 Polymer Compatibility Hydrophilic monomers [ 163 Radiation-sensitive polymers [ 161 Encapsulation of Biomolecules High [ 164 Moderate (radiation-sensitive) [ 161 Industrial Feasibility Low to moderate [ 163 High [ 161 ",
  "metadata": {
    "Title of this paper": "Hyaluronic Acid-Based Hybrid Hydrogel Microspheres with Enhanced Structural Stability and High Injectability",
    "Journal it was published in:": "Gels",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469318/"
  }
}