{
  "title": "Paper_498",
  "abstract": "Skin Appendage Disord Skin Appendage Disord 2974 sad SAD Skin Appendage Disorders 2296-9195 2296-9160 Karger Publishers PMC11460835 PMC11460835.1 11460835 11460835 39386310 10.1159/000538834 538834 1 Clinical Investigations – Research Article Nail Disease in a Nail Consultation at a Tertiary Referral Center: A 10-Year Retrospective Study Nail Disease 2738512 Rosca Aureliu 2738513 Magalhães César 2738514 Matos Joana 2738515 Teixeira Diogo 2738516 Guedes Rita Dermatology and Venereology Department, Vila Nova de Gaia/Espinho Hospital Center, Vila Nova de Gaia Portugal Correspondence to: Aureliu Rosca, aureliu_rosca@icloud.com 21 5 2024 10 2024 10 5 471887 396 401 27 2 2024 5 4 2024 2024 01 10 2025 01 10 2025 09 10 2024 01 10 2025 © 2024 S. Karger AG, Basel 2024 Copyright: All rights reserved. No part of this publication may be translated into other languages, reproduced or utilized in any form or by any means, electronic or mechanical, including photocopying, recording, microcopying, or by any information storage and retrieval system, without permission in writing from the publisher. Abstract Introduction The primary objective of this study was to determine the prevalence of nail diseases and its population in nail consultation. Methods A retrospective study of clinical records between 2012 and 2022 was conducted. The 1,372 established diagnoses were categorized into nosological groups, which included physical signs, infectious diseases, dermatological diseases, systemic diseases, drug reactions, occupational disorders, congenital diseases, traumatic disorders, and tumors. Results Overall, 1,239 records were enrolled, with 64% ( n n n Conclusion Onychomycosis was the most prevalent diagnosis and revealed a descending trend over the 10-year period study. Keywords Nail disease Onychomicosis Ingrown toenail This study was not supported by any sponsor or funder. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Nail Disease in a Nail Consultation at a Tertiary Referral Center: A 10-Year Retrospective Study",
    "Journal it was published in:": "Skin Appendage Disorders",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11460835/"
  }
}