{
  "title": "Paper_1200",
  "abstract": "pmc Biomolecules Biomolecules 2397 biomol biomolecules Biomolecules 2218-273X Multidisciplinary Digital Publishing Institute  (MDPI) PMC12466986 PMC12466986.1 12466986 12466986 41008625 10.3390/biom15091318 biomolecules-15-01318 1 Article Activin A Secreted by Cancer-Associated Fibroblasts Reduces the Sensitivity of Breast Cancer Cells to Ixazomib via Inhibition of Proteasome Activity Geng Shuaiming Methodology Software Writing – original draft Writing – review & editing 1 Liu Siyao Software Formal analysis 2 Liu He Formal analysis Resources 2 Wang Siao Investigation 1 Niu Yichen Data curation 1 Gao Jing Methodology Visualization 1 https://orcid.org/0000-0002-7528-3274 Meng Yong Data curation Funding acquisition 1 3 * Gao Mingqing Formal analysis Writing – original draft Writing – review & editing Funding acquisition 1 * Nass Norbert Academic Editor Martin Tracey Academic Editor 1 202233088@stumail.nwu.edu.cn 202324253@stumail.nwu.edu.cn 202434415@stumail.nwu.edu.cn 202422182@stumail.nwu.edu.cn 2 202332664@stumail.nwu.edu.cn 202310284@stumail.nwu.edu.cn 3 * mengyong@nwu.edu.cn gaomingqing@nwu.edu.cn 15 9 2025 9 2025 15 9 497615 1318 22 5 2025 08 8 2025 11 8 2025 15 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Breast cancer (BC) remains a leading cause of cancer-related mortality among women globally, and the role of cancer-associated fibroblasts (CAFs) in promoting BC progression is well established. Ixazomib, a proteasome inhibitor approved for the treatment of multiple myeloma, has demonstrated therapeutic potential in BC in preclinical trials. However, whether its efficacy is influenced by the tumor microenvironment, particularly CAFs, remains unclear. This study aims to investigate the role of CAFs with high expression of Activin A (encoded by INHBA) in modulating the sensitivity of BC cells to ixazomib. We demonstrate that ixazomib exhibited significant cytotoxicity in BC cells, but high-INHBA CAFs compromise ixazomib cytotoxicity through ERK-mediated proteasome suppression, reversible by Activin A antagonism. Additionally, the overexpression of INHBA in fibroblasts reduces the efficacy of ixazomib in xenograft models. Clinical data analysis revealed that high INHBA expression is associated with poor prognosis in BC patients and reduced immune cell infiltration. These findings suggest that targeting INHBA in CAFs could enhance the therapeutic efficacy of ixazomib in BC, particularly in patients with low INHBA expression. This study provides novel insights into the role of CAFs in drug resistance and identifies INHBA as a potential therapeutic target. breast cancer cancer-associated fibroblasts drug resistance INHBA/Activin A ixazomib Research start-up foundation in Northwest University 363042005143 Cultivation Project for National Natural Science Foundation of Xi’an No. 3 Hospital, the Affiliated Hospital of Northwest University Y2023ms0001 This work was supported by Research start-up foundation in Northwest University (grant number 363042005143) and the Cultivation Project for National Natural Science Foundation of Xi’an No. 3 Hospital, the Affiliated Hospital of Northwest University (grant number Y2023ms0001). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Breast cancer is one of the most common cancers in women and remains the leading cause of cancer death in women worldwide [ 1 2 3 4 5 6 7 8 Cancer-associated fibroblasts (CAFs) are the major stromal cells in the tumor microenvironment and play important roles in the development of tumors, including breast cancer [ 9 10 11 12 13 14 INHBA, as a member of the TGF-β superfamily, encodes the βA subunit of inhibin, which can form Activin A through disulphide bonds [ 15 16 17 18 In this study, we demonstrated whether ixazomib has significant cytotoxic effects on breast cancer cells and CAFs through in vitro and in vivo experiments, whether CAFs mediate this process, and the possible mechanisms. 2. Materials and Methods 2.1. Isolation and Culture of CAFs CAFs were isolated from fresh breast tumor tissues collected after surgical removal at the Affiliated Hospital of Northwest University. This was approved by the Medical Ethics Committee of Northwestern University and consented to by the patients. Briefly, tumor tissue samples were rinsed with phosphate-buffer solution (PBS) and cut into tissue pieces of less than 1 mm 3 2 2.2. Cell Lines and Culture Breast cancer cell lines MCF7 and MDA-MB-231, 293T cells, and human BJ fibroblasts were purchased from the National Collection of Authenticated Cell Cultures (Shanghai, China). All cells used in this study were negative for mycoplasma and were cultured in DMEM/F12 containing 10% FBS at 37 °C with 5% CO 2 2.3. RNA-Sequence (RNA-Seq) and Data Process Total RNA was extracted from CAFs using TransZol Up reagent (TransGen, Beijing, China), and Nano Drop ND-1000 was used to control the amount and purity of the total RNA. Reverse transcription was performed to obtain cDNA and construct specific libraries. The library products were sequenced using Illumina NovaseqTM 6000 (LC-Bio Technology Co., Ltd., Hangzhou, China) for bipartite sequencing. We used the following process for RNA-seq data analysis: raw data filtering and quality control were first performed using Cutadapt-1.9, and data quality was verified by FastQC-0.11.9. Subsequently, sequencing reads were compared to the human reference genome using HISAT2. Based on the comparison results, we applied StringTie-2.1.6 and Ballgown-2.40.0 software for transcript quantification and expressed mRNA expression levels as FPKM values. Differential analysis was performed by DESeq2, and the screening criteria were genes with FDR < 0.05 and fold change ≥ 2 [ 19 2.4. Preparation of CAF-Conditioned Medium (CM) CAFs were cultured in DMEM/F12 containing 10% FBS to approximately 70% confluence and washed twice with PBS. Fresh culture medium was added and incubated for 24 h in an incubator with 5% CO 2 2.5. Cell Counting Kit-8 (CCK-8) Assay Cells were cultured into 96-well plates at 2 × 10 3 2.6. Western Blotting Total cellular proteins were extracted using RIPA lysate (Beyotime, Shanghai, China) and protein concentrations were determined by a BCA protein assay kit (Solarbio, Beijing, China). Equal amounts of proteins were separated by SDS-PAGE and transferred to polyvinylidene difluoride membranes, followed by blockage with 10% skim milk to block non-specific binding sites. The membranes were incubated with antibodies against p-AKT (Abclonal, Wuhan, China), p-ERK1/2 (Abclonal), AKT (Abclonal), ERK1/2 (Abclonal), or GAPDH (Proteintech, Wuhan, China). This followed incubation with corresponding peroxidase-labeled secondary antibodies goat anti-mouse (Proteintech) or goat anti-rabbit (Proteintech). Protein bands were visualized using a chemiluminescence kit (Thermo, Waltham, MA, USA) and were acquired by an imaging system (LAS-4000, Fujifilm, Tokyo, Japan) 2.7. Real-Time Quantitative PCR (RT-qPCR) Total RNA was extracted from cells using the TransZol Up reagent (TransGen). RNA concentration was measured using a microplate reader, and all samples were adjusted to a uniform concentration of 500 ng/μL. Reverse transcription was then performed by using the PrimeScript TM ® (−ΔΔCt) 20 2.8. ELISA ELISA was performed to determine the secretion level of Activin A in different cells. Briefly, cells were cultured in DMEM/F12 containing 10% FBS until about 70% confluence; then, the cells were washed with PBS and cultured in fresh medium for another 24 h. Subsequently, the culture medium was collected and Activin A in medium were measured using the Activin A ELISA kit (Huzhen, Shanghai, China) assay according to the manufacturer’s instructions. 2.9. Determination of Proteasome Activity We employed a proteasome activity assay kit (Abcam, Cambridge, MA, USA) to measure chymotrypsin-like activity in this study. This assay is based on 7-Amino-4-methylcoumarin (AMC) fluorescently labeled peptide substrates, which release free, highly fluorescent AMC in the presence of proteolytic activity. The fluorescence intensity is detected to quantitatively analyze proteasome activity. The specific operational steps were performed according to the manufacturer’s instructions with minor modifications. Briefly, cells were collected and lysed using NP-40 cell lysis buffer, which contained 50 mM Tris-HCl (pH 7.4), 150 mM NaCl, and 1% NP-40. This was supplemented with sodium pyrophosphate, β-glycerophosphate, sodium orthovanadate, sodium fluoride, EDTA, and leupeptin as protease/phosphatase inhibitors. For each sample, we set up a pair of sample reaction wells. Then, 25 µL sample and 1 µL proteasome inhibitor were added into one well, and 25 µL sample without proteasome inhibitor was added into another well. The total volume of both wells was adjusted to 100 µL with assay buffer. Then, 1 µL proteasome substrate was added into each sample well and incubate for 20 min (T 1 2 1 2 2 2 1 1 2 1 2.10. Transfection with Lentiviral Vector The INHBA gene sequence was cloned into the TK-PCDH-copGFP-T2A-Puro lentiviral vector. We mixed the plasmid (INHBA:pMD2.G:psPAX2 = 2 μg:1 μg:2 μg) and Lipofectamine 3000 with a fresh serum-free, antibiotic-free culture medium and added it dropwise to 293T cells for virus packaging; then, the viral solution was concentrated, purified, and used to infect the BJ fibroblasts. Finally, the increased expression level of INHBA in transfected BJ cell (INHBA-BJ) was validated by RT-qPCR and ELISA after screening with puromycin (Beyotime). BJ cells transfected with empty vectors (Vector-BJ) were used as control. 2.11. Tumor-Bearing Mice Female nude mice (BALB/cNj-Foxn1 nu 6 6 6 6 3 2.12. Analyses Based on Public Datasets INHBA expression levels in tumor tissues of patients with breast cancer were processed using the GEPIA ( http://gepia2.cancer-pku.cn/#index https://kmplot.com http://timer.cistrome.org/ 2.13. Statistical Analysis All data are expressed as the mean ± SEM of three independent experiments. Statistical analyses were performed using GraphPad Prism v.8 and comparisons were performed using two-sided paired Student’s t p p 3. Results 3.1. CAFs Reduced the Sensitivity of MCF7 Cancer Cells to Ixazomib We found that ixazomib had a significant dose-dependent toxic effect on both MCF7 and MDA-MB-231 breast cancer cells at indicated concentration ranges when they were cultured in regular complete medium (Control) ( Figure 1 Figure 1 Figure 1 Figure 1 Based on the different effects of these CAFs from different patients on the sensitivity of MCF7 cancer cells to ixazomib, we divided CAFs from different patients into two groups, one of which was designated as CAFs reduce not Finally, ixazomib at the concentration of IC 50 not reduce reduce Figure 1 These results collectively demonstrate that CAFs reduce 3.2. Screening CAFs reduce RNA-Seq was performed to investigate the molecular characteristics of CAFs reduce not reduce not reduce not Figure 2 In order to reveal the potential functions of these DEGs, we performed Kyoto Encyclopedia of Genes and Genomes (KEGG) and Gene Ontology (GO) enrichment analyses. The signaling pathways associated with cancer progression in the KEGG enrichment analysis results mainly included TGF-β pathway, MAPK pathway, PI3K-Akt pathway, cytokine–cytokine receptor interaction, focal adhesion, and chemokine signaling, etc. ( Figure 2 Figure 2 reduce Figure 2 Of the 747 up-regulated genes in CAFs reduce reduce not Figure 2 reduce not Figure 2 Among these three genes, the up-regulation of INHBA genes has been reported to be a key factor in the development of breast cancer [ 21 22 18 23 Figure 2 Figure 2 reduce not We further reanalyzed the data of single-cell sequencing obtained from tumor tissues of 3 breast cancer patients in our previous work [ 24 Figure 2 Figure 2 Figure 2 GSE176078 Supplementary Figure S1 Supplementary Figure S2 These results suggested that CAFs from different breast cancer patients expressed different mRNA levels of INHBA. INHBA might be a crucial functional factor in CAFs, derived from different individuals, contributing the resistance of MCF7 cells to ixazomib. 3.3. Blockade of CAFs-Secreted Activin a Restores the Sensitivity of MCF7 Cells to Ixazomib Given that CAFs reduce not To evaluate this, we used ixazomib to treat MCF7 cells that were cultured in complete medium with or without exogenous recombinant Activin A. Results showed that Activin A attenuated the sensitivity of MCF7 cells to ixazomib as indicated by relative cell viability ( Figure 3 We next investigated whether FST, an antagonist of Activin A, [ 17 reduce Figure 3 reduce reduce reduce reduce not reduce Figure 3 reduce 3.4. CAFs reduce It is reported that when cancer cells have low proteasome activity, they face low proteotoxic pressure. Thus, less cells died when treated with proteasome inhibitors [ 25 26 27 reduce Figure 4 Previous studies suggested that Activin A exert biological functions by regulating MAPK/ERK and PI3K/AKT signaling pathways [ 28 29 Figure 4 Furthermore, we observed that the phosphorylation level of ERK in MCF7 cells cultured in CAFs reduce not reduce not Figure 4 We also assessed whether the inhibition of the ERK signal pathway resulted in reduced the sensitivity of MCF7 to ixazomib. We found PD98059, an inhibitor of ERK pathway, could reduce the sensitivity of MCF7 cells to ixazomib ( Figure 4 Figure 4 In summary, Activin A secreted by CAFs reduced the sensitivity of MCF7 cells to ixazomib, which may be related to the inhibition of proteasome activity mediated by the ERK1/2 signaling pathway. 3.5. Up-Regulation of INHBA in CAFs Reduces the Sensitivity of MCF7 to Ixazomib In Vivo and In Vitro To further validate the above functions of INHBA genes, we constructed a cell line (INHBA-BJ) that stably overexpressed INHBA in both mRNA expression ( Figure 5 Figure 5 Figure 5 Figure 5 Figure 5 When MCF7 cells were in vitro cultured in CM of INHBA-BJ, their sensitivity to ixazomib was reduced compared to those cells cultured in CM of Vector-BJ, as relative cell viability. Importantly, this protective effect of INHBA-BJ was also attenuated when Activin A in INHBA-BJ-CM was neutralized by FST ( Figure 5 Subsequently, we evaluated whether INHBA-BJ induced the in vivo resistance of MCF7 cells to ixazomib by using a subcutaneous co-injection model ( Figure 5 3 Figure 5 Within 28 days after ixazomib treatment, the average tumor volume gradually decreased in two co-injection groups, but the reduction in tumor volume in INHBA-BJ group was significantly smaller than that in MCF7+Vector-BJ group ( Figure 5 Figure 5 Figure 5 3.6. Analysis of the Clinical Relevance of INHBA Expression with Breast Cancer The clinical relevance of INHBA expression with breast cancer was analyzed by using the TCGA database. Results showed that INHBA gene expression was significantly up-regulated in breast tumor tissues compared to normal breast tissues ( Figure 6 Figure 6 Figure 6 Figure 6 Figure 6 Figure 6 We subsequently assessed the set of INHBA-related genes in breast cancer and found that genes encoding collagens COL10A1, COL12A1, COL5A2 and COL11A1 were associated with INHBA expression ( Figure 6 reduce not Figure 2 reduce not Figure 6 Subsequently, TIMER2.0 analysis confirmed this speculation. Results showed that INHBA expression was significantly negatively correlated with CD8+ T cells and B cell infiltration, but it was not associated with CD4+T cells ( Figure 6 Figure 6 4. Discussion In this study, we systematically elucidated the key role of CAFs in breast cancer treatment resistance and their molecular mechanisms. CAFs, main stromal cells in tumor microenvironment, are always in dynamic crosstalk with tumor cells and nourish the tumor to promote tumor progression [ 11 30 31 reduce not Recent studies have shown that different subpopulations of CAFs are involved in the process of tumor drug resistance through multiple mechanisms [ 32 reduce not 18 33 34 We demonstrated that Activin A secreted by CAFs reduced the sensitivity of MCF7 to ixazomib by in vitro and in vivo experiments. Considering that the sensitivity of proteasome inhibitors is related to proteasome activity [ 25 26 35 36 37 38 Our finding that the inhibition of ERK phosphorylation levels by Activin A led to a reduction in proteasome activity is similar to a previous study in which a decrease in ERK phosphorylation levels in MCF7 led to a reduction in proteasome viability [ 39 40 41 42 43 In addition, we found that high expression of INHBA in breast tumor tissue was associated with the reduced survival of patients. INHBA expression in breast cancer tissues is closely associated with collagen production [ 44 45 46 47 48 49 5. Conclusions Our study demonstrates that ixazomib exerts significant cytotoxic effects on both MDA-MB-231 and MCF7 breast cancer cell lines. However, in the presence of CAFs within the tumor microenvironment, ixazomib’s cytotoxicity displays subtype specificity. Specifically, CAFs with high INHBA expression can attenuate MCF7 cell sensitivity to ixazomib through Activin A secretion, which may be related to the down-regulation of ERK1/2 signaling pathway-mediated inhibition of proteasome activity. The limitation of this study is that our conclusions are based on in vivo and in vitro experiments, and further clinical trials are needed to support the extended use of ixazomib in the clinic, except in cases of multiple myeloma. Acknowledgments The authors would like to thank Z. Zhang, Q. Guan, X. Dong and Y. Dai for their help in data collation and visualization to this work. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/biom15091318/s1 GSE176078 GSE176078 Figure 4 Author Contributions S.G. contributed to the conceptualization, data curation, methodology, software, investigation, formal analysis, validation, visualization and writing—original draft. S.L. and H.L. contributed to the manuscript editing, investigation, visualization formal analysis and project administration. S.W., Y.N. and J.G. contributed to the software, validation and conceptualization. Y.M. provided supervision, resources and funding acquisition. M.G. contributed to the conceptualization, resources, project administration, supervision, writing—review and editing and funding acquisition. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement This study was approved by the Medical Ethics Committee of Northwest University (No. 230306013; 6 March 2023). The tissue samples were obtained with written informed consent from each patient. The animal study was carried out in compliance with the guidance suggestion of the Research Ethics Committee of Northwest University (No. NWU-AWC-20240904M, 6 September 2024). Informed Consent Statement All subjects involved provided written informed consent, with additional patient authorization obtained for publication of this research. Data Availability Statement The original contributions presented in this study are included in the article/ Supplementary Materials Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: BC breast cancer CAFs cancer-associated fibroblasts FST follistatin PBS phosphate-buffer solution RNA-Seq RNA-sequence CM conditioned medium CCK-8 cell counting kit-8 RT-qPCR real-time quantitative PCR RFU relative fluorescence unit DEG differential gene expression KEGG kyoto encyclopedia of genes and genomes GO gene ontology GSEA gene set enrichment analysis ECM extracellular matrix scRNA-Seq single-cell RNA sequencing TMB tumor mutational burden MSI microsatellite instability OS overall survival RFS recurrence-free survival DMFS distant metastasis-free survival ARE antioxidant response element NRF nuclear respiratory factor References 1. Nolan E. Lindeman G.J. Visvader J.E. Deciphering breast cancer: From biology to the clinic Cell 2023 186 1708 1728 10.1016/j.cell.2023.01.040 36931265 2. Kumar S.K. Bensinger W.I. Zimmerman T.M. Reeder C.B. Berenson J.R. Berg D. Hui A.-M. Gupta N. Di Bacco A. Yu J. Phase 1 study of weekly dosing with the investigational oral proteasome inhibitor ixazomib in relapsed/refractory multiple myeloma Blood 2014 124 1047 1055 10.1182/blood-2014-01-548941 24904120 PMC4468583 3. Richardson P.G. Baz R. Wang M. Jakubowiak A.J. Laubach J.P. Harvey R.D. Talpaz M. Berg D. Liu G. Yu J. Phase 1 study of twice-weekly ixazomib, an oral proteasome inhibitor, in relapsed/refractory multiple myeloma patients Blood 2014 124 1038 1046 10.1182/blood-2014-01-548826 24920586 PMC4574453 4. Shirley M. Ixazomib: First Global Approval Drugs 2016 76 405 411 10.1007/s40265-016-0548-5 26846321 5. Larsson P. Pettersson D. Olsson M. Sarathchandra S. Abramsson A. Zetterberg H. Ittner E. Forssell-Aronsson E. Kovács A. Karlsson P. Repurposing proteasome inhibitors for improved treatment of triple-negative breast cancer Cell Death Discov. 2024 10 57 10.1038/s41420-024-01819-5 38286854 PMC10825133 6. Dameri M. Garlaschi A. Cuccarolo P. Ceccardi A. Stabile M. Valente I. Gristina L. Calabrese M. Ballestrero A. Tagliafico A. Complete pathological response of hormone receptor positive invasive breast cancer in a patient with multiple myeloma treated with ixazomib Tumori J. 2023 109 NP14 NP20 10.1177/03008916231176586 37265183 PMC10702304 7. Schwartz G. Shee K. Romo B. Marotti J. Kisselev A. Lewis L. Miller T. Phase Ib study of the oral proteasome inhibitor ixazomib (MLN9708) and fulvestrant in advanced ER+ breast cancer progressing on fulvestrant Oncologist 2021 26 467-e924 10.1002/onco.13733 33641211 PMC8176977 8. Rinnerthaler G. Gampenrieder S.P. Petzer A. Burgstaller S. Fuchs D. Rossmann D. Balic M. Egle D. Rumpold H. Singer C.F. Ixazomib in combination with carboplatin in pretreated women with advanced triple-negative breast cancer, a phase I/II trial of the AGMT (AGMT MBC-10 trial) BMC Cancer 2018 18 1074 10.1186/s12885-018-4979-0 30400780 PMC6220453 9. Caligiuri G. Tuveson D.A. Activated fibroblasts in cancer: Perspectives and challenges Cancer Cell 2023 41 434 449 10.1016/j.ccell.2023.02.015 36917949 PMC11022589 10. Biffi G. Tuveson D.A. Diversity and biology of cancer-associated fibroblasts Physiol. Rev. 2021 101 147 176 10.1152/physrev.00048.2019 32466724 PMC7864232 11. Kalluri R. The biology and function of fibroblasts in cancer Nat. Rev. Cancer 2016 16 582 598 10.1038/nrc.2016.73 27550820 12. Su S. Chen J. Yao H. Liu J. Yu S. Lao L. Wang M. Luo M. Xing Y. Chen F. CD10+GPR77+ cancer-associated fibroblasts promote cancer formation and chemoresistance by sustaining cancer stemness Cell 2018 172 841 856.e16 10.1016/j.cell.2018.01.009 29395328 13. Liu X. Lu Y. Huang J. Xing Y. Dai H. Zhu L. Li S. Feng J. Zhou B. Li J. CD16+ fibroblasts foster a trastuzumab-refractory microenvironment that is reversed by VAV2 inhibition Cancer Cell 2022 40 1341 1357.e13 10.1016/j.ccell.2022.10.015 36379207 14. Bartoschek M. Oskolkov N. Bocci M. Lövrot J. Larsson C. Sommarin M. Madsen C.D. Lindgren D. Pekar G. Karlsson G. Spatially and functionally distinct subclasses of breast cancer-associated fibroblasts revealed by single cell RNA sequencing Nat. Commun. 2018 9 5150 10.1038/s41467-018-07582-3 30514914 PMC6279758 15. Brown C.W. Houston-Hawkins D.E. Woodruff T.K. Matzuk M.M. Insertion of Inhbb into the Inhba locus rescues the Inhba-null phenotype and reveals new activin functions Nat. Genet. 2000 25 453 457 10.1038/78161 10932194 16. Li F. Long Y. Yu X. Tong Y. Gong L. Different Immunoregulation Roles of Activin A Compared With TGF-β Front. Immunol. 2022 13 921366 10.3389/fimmu.2022.921366 35774793 PMC9237220 17. Walker R.G. Kattamuri C. Goebel E.J. Zhang F. Hammel M. Tainer J.A. Linhardt R.J. Thompson T.B. Heparin-mediated dimerization of follistatin Exp. Biol. Med. 2020 246 467 482 10.1177/1535370220966296 PMC7885052 33197333 18. Hamalian S. Güth R. Runa F. Sanchez F. Vickers E. Agajanian M. Molnar J. Nguyen T. Gamez J. Humphries J.D. A SNAI2-PEAK1-INHBA stromal axis drives progression and lapatinib resistance in HER2-positive breast cancer by supporting subpopulations of tumor cells positive for antiapoptotic and stress signaling markers Oncogene 2021 40 5224 5235 10.1038/s41388-021-01906-2 34239043 PMC8376636 19. Han B.A. Yang X.P. Hosseini D.K. Zhang P. Zhang Y. Yu J.-T. Chen S. Zhang F. Zhou T. Sun H.-Y. Identification of candidate aberrantly methylated and differentially expressed genes in Esophageal squamous cell carcinoma Sci. Rep. 2020 10 9735 10.1038/s41598-020-66847-4 32546690 PMC7297810 20. Livak K.J. Schmittgen T.D. Analysis of relative gene expression data using real-time quantitative PCR and the 2(-Delta Delta C(T)) Method Methods 2001 25 402 408 10.1006/meth.2001.1262 11846609 21. Liu M. Smith R. Liby T. Chiotti K. López C.S. Korkola J.E. INHBA is a mediator of aggressive tumor behavior in HER2+ basal breast cancer Breast Cancer Res. 2022 24 18 10.1186/s13058-022-01512-4 35248133 PMC8898494 22. Kalli M. Mpekris F. Wong C.K. Panagi M. Ozturk S. Thiagalingam S. Stylianopoulos T. Papageorgis P. Activin A signaling regulates IL13Rα2 expression to promote breast cancer metastasis Front. Oncol. 2019 9 32 10.3389/fonc.2019.00032 30805303 PMC6370707 23. Zhang Z. Chen L. Yang Q. Tang X. Li J. Zhang G. Wang Y. Huang H. INHBA regulates Hippo signaling to confer 5-FU chemoresistance mediated by cellular senescence in colon cancer cells Int. J. Biochem. Cell Biol. 2024 171 106570 10.1016/j.biocel.2024.106570 38588888 24. Yang W. Xu M. Xu S. Guan Q. Geng S. Wang J. Wei W. Xu H. Liu Y. Meng Y. Single-cell RNA reveals a tumorigenic microenvironment in the interface zone of human breast tumors Breast Cancer Res. 2023 25 100 10.1186/s13058-023-01703-7 37644609 PMC10463980 25. Jiang T.Y. Pan Y.F. Wan Z.H. Lin Y.K. Zhu B. Yuan Z.G. Ma Y.H. Shi Y.-Y. Zeng T.-M. Dong L.-W. PTEN status determines chemosensitivity to proteasome inhibition in cholangiocarcinoma Sci. Transl. Med. 2020 12 eaay0152 10.1126/scitranslmed.aay0152 32967970 26. Jiang T.Y. Feng X.F. Fang Z. Cui X.W. Lin Y.K. Pan Y.F. Yang C. Ding Z.-W. Zhang Y.-J. Tan Y.-X. PTEN deficiency facilitates the therapeutic vulnerability to proteasome inhibitor bortezomib in gallbladder cancer Cancer Lett. 2021 501 187 199 10.1016/j.canlet.2020.11.016 33220333 27. Moreau P. Masszi T. Grzasko N. Bahlis N.J. Hansson M. Pour L. Sandhu I. Ganly P. Baker B.W. Jackson S.R. Oral Ixazomib, Lenalidomide, and Dexamethasone for Multiple Myeloma N. Engl. J. Med. 2016 374 1621 1634 10.1056/NEJMoa1516282 27119237 28. De C.M. The transforming growth factor-β superfamily of receptors Cytokine Growth Factor Rev. 2004 15 1 11 10.1016/j.cytogfr.2003.10.004 14746809 29. Weiss A. Attisano L. The TGFbeta superfamily signaling pathway Wiley Interdiscip Rev. Dev. Biol. 2012 2 47 63 10.1002/wdev.86 23799630 30. Fan G. Yu B. Tang L. Zhu R. Chen J. Zhu Y. Huang H. Zhou L. Liu J. Wang W. TSPAN8(+) myofibroblastic cancer-associated fibroblasts promote chemoresistance in patients with breast cancer Sci. Transl. Med. 2024 16 eadj5705 10.1126/scitranslmed.adj5705 38569015 31. Hu D. Li Z. Zheng B. Lin X. Pan Y. Gong P. Zhuo W. Hu Y. Chen C. Chen L. Cancer-associated fibroblasts in breast cancer: Challenges and opportunities Cancer Commun. 2022 42 401 434 10.1002/cac2.12291 PMC9118050 35481621 32. Saw P.E. Chen J. Song E. Targeting CAFs to overcome anticancer therapeutic resistance Trends Cancer 2022 8 527 555 10.1016/j.trecan.2022.03.001 35331673 33. Bashir M. Damineni S. Mukherjee G. Kondaiah P. Activin-A signaling promotes epithelial-mesenchymal transition, invasion, and metastatic growth of breast cancer NPJ Breast Cancer 2015 1 15007 10.1038/npjbcancer.2015.7 28721365 PMC5515205 34. Ries A. Schelch K. Falch D. Pany L. Hoda M.A. Grusch M. Activin A: An emerging target for improving cancer treatment? Expert Opin. Ther. Targets 2020 24 985 996 10.1080/14728222.2020.1799350 32700590 35. Morianos I. Papadopoulou G. Semitekolou M. Xanthou G. Activin-A in the regulation of immunity in health and disease J. Autoimmun. 2019 104 102314 10.1016/j.jaut.2019.102314 31416681 36. Xue L.X. Xu Z.H. Wang J.Q. Cui Y. Liu H.Y. Liang W.Z. Ji Q.Y. He J.-T. Shao Y.-K. Mang J. Activin A/Smads signaling pathway negatively regulates Oxygen Glucose Deprivation-induced autophagy via suppression of JNK and p38 MAPK pathways in neuronal PC12 cells Biochem. Biophys. Res. Commun. 2016 480 355 361 10.1016/j.bbrc.2016.10.050 27769861 37. Mukerji S.S. Rainey R.N. Rhodes J.L. Hall A.K. Delayed activin A administration attenuates tissue death after transient focal cerebral ischemia and is associated with decreased stress-responsive kinase activation J. Neurochem. 2009 111 1138 1148 10.1111/j.1471-4159.2009.06406.x 19780899 PMC2792943 38. Huang H.M. Chang T.W. Liu J.C. Basic fibroblast growth factor antagonizes activin A-mediated growth inhibition and hemoglobin synthesis in K562 cells by activating ERK1/2 and deactivating p38 MAP kinase Biochem. Biophys. Res. Commun. 2004 320 1247 1252 10.1016/j.bbrc.2004.06.083 15249224 39. He X. Arrotta N. Radhakrishnan D. Wang Y. Romigh T. Eng C. Cowden syndrome-related mutations in PTEN associate with enhanced proteasome activity Cancer Res. 2013 73 3029 3040 10.1158/0008-5472.CAN-12-3811 23475934 PMC3655114 40. Ben-Nissan G. Sharon M. Regulating the 20S proteasome ubiquitin-independent degradation pathway Biomolecules 2014 4 862 884 10.3390/biom4030862 25250704 PMC4192676 41. Pickering A.M. Linder R.A. Zhang H. Forman H.J. Davies K.J.A. Nrf2-dependent induction of proteasome and Pa28αβ regulator are required for adaptation to oxidative stress J. Biol. Chem. 2012 287 10021 10031 10.1074/jbc.M111.277145 22308036 PMC3323025 42. Wang P. Li T. Niu C. Sun S. Liu D. ROS-activated MAPK/ERK pathway regulates crosstalk between Nrf2 and Hif-1α to promote IL-17D expression protecting the intestinal epithelial barrier under hyperoxia Int. Immunopharmacol. 2023 116 109763 10.1016/j.intimp.2023.109763 36736221 43. Steffen J. Seeger M. Koch A. Krüger E. Proteasomal degradation is transcriptionally controlled by TCF11 via an ERAD-dependent feedback loop Mol. Cell 2010 40 147 158 10.1016/j.molcel.2010.09.012 20932482 44. Cohen N. Mundhe D. Deasy S.K. Adler O. Ershaid N. Shami T. Levi-Galibov O. Wassermann R. Scherz-Shouval R. Erez N. Breast cancer–secreted factors promote lung metastasis by signaling systemically to induce a fibrotic premetastatic niche Cancer Res. 2023 83 3354 3367 10.1158/0008-5472.CAN-22-3707 37548552 45. Sun X. Wu B. Chiang H.C. Deng H. Zhang X. Xiong W. Liu J. Rozeboom A.M. Harris B.T. Blommaert E. Tumour DDR1 promotes collagen fibre alignment to instigate immune exclusion Nature 2021 599 673 678 10.1038/s41586-021-04057-2 34732895 PMC8839149 46. Nurmik M. Ullmann P. Rodriguez F. Haan S. Letellier E. In search of definitions: Cancer-associated fibroblasts and their markers Int. J. Cancer 2020 146 895 905 10.1002/ijc.32193 30734283 PMC6972582 47. Dieci M.V. Miglietta F. Guarneri V. Immune infiltrates in breast cancer: Recent updates and clinical implications Cells 2021 10 223 10.3390/cells10020223 33498711 PMC7911608 48. Monteran L. Erez N. The dark side of fibroblasts: Cancer-associated fibroblasts as mediators of immunosuppression in the tumor microenvironment Front. Immunol. 2019 10 1835 10.3389/fimmu.2019.01835 31428105 PMC6688105 49. Hu Y. Recouvreux M.S. Haro M. Taylan E. Taylor-Harding B. Walts A.E. Karlan B.Y. Orsulic S. INHBA(+) cancer-associated fibroblasts generate an immunosuppressive tumor microenvironment in ovarian cancer NPJ Precis. Oncol. 2024 8 35 10.1038/s41698-024-00523-y 38360876 PMC10869703 Figure 1 CAFs reduced the sensitivity of MCF7 cancer cells to ixazomib. ( A n B n p C not reduce n D A n p Figure 2 The screening of crucial secretory proteins for CAFs reduce A not reduce B C D not reduce E not reduce left Right F not reduce G not reduce n p t H not reduce n p t I J K Figure 3 The blockade of CAF-secreted Activin A restores the sensitivity of MCF7 cells to ixazomib. ( A n p B n t C n p Figure 4 CAF reduce A n p t B Figure S3 n p t C not reduce Figure S3 n p D n p t E PPD98059 n p t Figure 5 Up-regulation of INHBA in CAFs reduces ixazomib sensitivity of MCF7 in vivo and in vitro. ( A n p t B n p t C n p t D n p t E n F Left Right n p t G 3 H 3 n p t I n p t J left right n p t K Figure 6 Analysis of clinical relevance of INHBA expression with breast cancer. ( A B n n n n n n p C E C D E F n n n G H I J K ",
  "metadata": {
    "Title of this paper": "INHBA(+) cancer-associated fibroblasts generate an immunosuppressive tumor microenvironment in ovarian cancer",
    "Journal it was published in:": "Biomolecules",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12466986/"
  }
}