{
  "title": "Paper_875",
  "abstract": "pmc Microorganisms Microorganisms 3054 microorg microorganisms Microorganisms 2076-2607 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472003 PMC12472003.1 12472003 12472003 41011374 10.3390/microorganisms13092042 microorganisms-13-02042 1 Article Antioxidant and Antifungal Effects of Six Plant Essential Oils Against Penicillium digitatum Penicillium italicum García-Custodio María del Carmen Conceptualization Methodology Software Formal analysis Investigation Writing – original draft Writing – review & editing https://orcid.org/0000-0002-4420-2822 Márquez-García Francisco Conceptualization Methodology Formal analysis Investigation Writing – original draft Writing – review & editing * https://orcid.org/0000-0002-9593-6164 García-Alonso David Formal analysis Software Writing – review & editing Investigation Brieva-Trejo Cristian David Writing – review & editing Investigation https://orcid.org/0000-0001-7826-8814 Vázquez Pardo Francisco María Pusztahelyi Tünde Academic Editor Kovács Szilvia Academic Editor Centro de Investigaciones Científicas y Tecnológicas de Extremadura (CICYTEX), Instituto de Investigaciones Agrarias Finca La Orden-Valdesequera, Área de Biodiversidad Vegetal Agraria, Autovía A-5 Km 372, Guadajira, 06187 Badajoz, Spain; carmen.garciac@juntaex.es frvazquez50@hotmail.com * francisco.marquezga@juntaex.es 01 9 2025 9 2025 13 9 496716 2042 21 8 2025 25 8 2025 28 8 2025 01 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Six aromatic plants ( Lavandula pedunculata sampaioana Lavandula stoechas luisieri Mentha × piperita Origanum vulgare virens Thymus mastichina Thymus zygis sylvestris Penicillium digitatum Penicillium italicum Th. zygis sylvestris L. stoechas luisieri L. pedunculata sampaioana Th. mastichina Th. zygis sylvestris P. digitatum P. italicum antifungal activity antioxidant essential oil lavandula mentha origanum penicillium thymus European Union NextGenerationEU PRTR-C17.I1 This study forms part of the AGROALNEXT program and was supported by MCIN with funding from European Union NextGenerationEU (PRTR-C17.I1). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Postharvest fruit and vegetable diseases caused by fungal infections ( Aspergillus Penicillium Fusarium Alternaria 1 2 3 4 5 6 7 Penicillium digitatum Penicillium italicum 8 9 10 11 12 13 9 14 15 6 11 16 17 18 19 20 21 Essential oils and medicinal plant extracts are composed of mixtures of volatile organic compounds. These include alcohols, ethers, oxides, aldehydes, ketones, esters, amines, amides, phenols and heterocycles, as well as mainly terpenes [ 22 23 24 25 26 27 Work is currently underway to identify active ingredients of natural origin that are more environmentally friendly to produce and use. The aim is to develop effective treatments for antibiotic resistance in human and animal health and herbicides for agricultural crops [ 28 29 30 31 32 33 34 35 36 Studies of the antifungal capacity of medicinal plants extracts or essential oils have reported the ability of fight various fungal infections caused by Aspergillus Candida Cryptococcus Epidermophyton Fusarium Microsporum Penicillium Trichophyton 37 38 39 40 41 Penicillium P. digitatum P. italicum 42 43 44 45 46 47 48 49 50 P. digitatum P. italicum 51 52 53 54 55 56 57 58 59 The use of essential oils from medicinal plants whose chemical composition includes antifungal compounds (e.g., thymol, carvacrol, terpinen-4-ol, etc. [ 59 P. digitatum P. italicum 2. Materials and Methods 2.1. Plant Material, Essential Oil Extraction, and Chemical Characterization of Essential Oils Aerial parts of six aromatic plants ( Lavandula pedunculata sampaioana Lavandula stoechas luisieri Mentha × piperita Origanum vulgare virens Thymus mastichina Thymus zygis sylvestris Fresh stems, leaves, and flowers from each specie were cut into small pieces and submitted to hydro-distillation in Clevenger-type apparatus for 2 h. The essential oils (EOs) were stored in amber vial at 4 °C. The chemical analysis of the essential oils was carried out using a combination of two gas chromatography techniques (GC-FID + GC-MS), chemical compounds were identified by CG-MS and quantified by CG-FID. The analysis was performed on Agilent 8890 GC paired with the 5977B MSD (Mass Selective Detector). Polar column DB-WAX UI (60 m long, 0.25 mm diameter and 0.5 µm film thicknesses) was employed using Helium carrier gas at constant flow of 2 mL/min. Apolar column HP-5MS UI (60 m long, 0.25 mm diameter and 0.25 µm film thicknesses) was employed using Helium carrier gas at constant flow of 1 mL/min. The column temperature started at 50 °C and increased to 240 °C (polar column) and 285 °C (apolar column). 2.2. Antioxidant Activity The antioxidant activity of each essential oil sample was determined by ABTS and DPPH assay method. The absorbance was measured using a spectrophotometer (Beckman Coulter DU ® The standard line from each assay was designed using Trolox (6-hidroxy-2,5,7,8-tetramethylchroman-carboxylic acid) (Sigma-Aldrich 238813, Sigma-Aldrich, Inc., St. Louis, MO, USA) between 1 mM and 2 mM concentration and measured the absorbance at 734 nm (ABTS) and 517 nm (DPPH). All the essential oil samples were analyzed in triplicate. The sample volume used was 3 mL (2.95 mL from DPPH/ABTS + 50 μL from essential oil sample). The results, from both analyses (ABTS and DPPH) were presented as millimoles (mM) of Trolox equivalents and grams of Trolox equivalents per gram of essential oil, with the main objective of developing a data matrix comparable between each other. 2.2.1. ABTS [2,2′-Azino-bis(3-ethylbenzothiazoline-6-sulphonic acid)] Assay ABTS assay is based on the ability of molecules to scavenge the free radical of ABTS in comparison with Trolox [ 60 2.2.2. DPPH (2,2-Diphenyl-1-picrylhydrazyl) Assay The DPPH protocol to measure antioxidant activity was based on the description in reference [ 61 2.3. In Vitro Antifungal Activity Assay 2.3.1. Fungal Isolation The fungal species used are P. digitatum P. italicum Citrus aurantium 8 62 63 64 65 2.3.2. Antifungal Activity–Disk Diffusion Method The disk diffusion method was used to evaluate the antifungal activity of each of the essential oils [ 66 67 8 The study included a control group and a study group with 3 repetitions of each for each species of essential oil. Thus, 12 Petri dishes were used for each essential oil species (3 control dishes + 3 study dishes for each one of the analyzed molds, P. digitatum P. italicum 2.4. Statistical Analysis Descriptive and inferential statistical analysis were performed using R v 4.3.3 software [ 68 3. Results 3.1. Essential Oil Composition Table 1 w w Th. mastichina L. pedunculata sampaioana Th. zygis sylvestris M. × piperita L. stoechas luisieri O. vulgare virens The essential oils have a rich monoterpene-based chemical composition ( Table 2 Th zygis sylvestris O. vulgare virens Th. mastichina L. stoechas luisieri L. pedunculata sampaioana O. vulgare virens M. × piperita L. stoechas luisieri 3.2. Antioxidant Activity The obtained results ( Table 3 L. stoechas luisieri O vulgare Virens Th zygis sylvestris The essential oils tested showed a higher antioxidant capacity using the ABTS method than the DPPH method. In the ABTS method, the essential oils with the highest antioxidant capacity values are as follows: Th. zygis sylvestris O. vulgare virens L. stoechas luisieri L. stoechas luisieri Th. zygis sylvestris O. vulgare virens In contrast, the species Th. mastichina L. pedunculata sampaioana M. × piperita Th. mastichina L. pedunculata sampaioana M. × piperita L. pedunculata sampaioana M. × piperita Th. mastichina 3.3. In Vitro Antifungal Activity Assay 3.3.1. Fungal Isolation The P. italicum P. digitatum Figure 1 3.3.2. Antifungal Activity The Petri dishes were photographed every 24 h, and it could be observed that the filter disk infused with the essential oils is able to inhibit the fungal species development (inhibition halo) and delay conidiospore development of both species. Figure 2 Th. zygis sylvestris M piperita Table 4 P. digitatum P. italicum Finally, the data distribution in relation to each essential oil species is presented in a boxplot for each fungal species ( Figure 3 Th. zygis sylvestris P. digitatum P. italicum L. stoechas luisieri P. digitatum P. italicum O. vulgare virens P. digitatum P. italicum The essential oil of Th. mastichina P. italicum P. digitatum 4. Discussion The obtained data shows the essential oils of Th. zygis sylvestris O. vulgare virens L. stoechas luisieri 69 Th mastichina M. × piperita L. pedunculata sampaioana P. italicum P. digitatum In terms of their chemical composition, the essential oils of Th. zygis sylvestris Origanum vulgare virens L. stoechas luisieri L. pedunculata sampaioana Th. mastichina M. × piperita High antifungal and antioxidant activity from Th. zygis 70 71 72 73 74 75 Th. zygis 72 74 75 76 77 60 62 63 64 65 66 Thymus 47 78 79 80 71 78 P digitatum P italicum Th zygis sylvestris Penicillium 47 50 70 On the other hand, the other thyme species included in this study, Th. mastichina 73 81 82 83 Penicillium Sclerotinia Fusarium Alternaria Candida 73 84 85 86 O. vulgare virens 87 88 O. vulgare vulgare P. digitatum P. italicum 50 88 89 90 91 The two Lavandula L. stoechas luisieri L. pedunculata sampaioana 92 P. digitatum P. italicum L. stoechas luisieri 93 L. pedunculata sampaioana 73 82 M. × piperita Penicillium P. digitatum 94 95 96 97 5. Conclusions The Th. zygis sylvestris O. vulgare Virens L. stoechas luisieri P. digitatum P. italicum Citrus P. digitatum P. italicum Essential oils with a chemical composition rich in phenolic monoterpenes and ethers have greater antioxidant and antifungal capacity against P. digitatum P. italicum Acknowledgments The authors would like to acknowledge Alonso Martín Jabato and Julian Mor-cillo Solis for their help and maintenance of the assay crops used in this research. Additionally, we are grateful for the help of Pedro Del Viejo Esteban and Alicia Gil de los Santos during the development of the laboratory studies. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, M.d.C.G.-C. and F.M.-G.; methodology, M.d.C.G.-C. and F.M.-G.; software, M.d.C.G.-C. and D.G.-A.; formal analysis, M.d.C.G.-C., D.G.-A. and F.M.-G.; investigation, M.d.C.G.-C., F.M.-G., C.D.B.-T. and D.G.-A.; resources, F.M.V.P.; writing—original draft preparation, M.d.C.G.-C. and F.M.-G.; writing—review and editing, D.G.-A., C.D.B.-T. and F.M.V.P. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement The original contributions presented in this study are included in the article. Further inquiries can be directed to the corresponding author. Conflicts of Interest The authors declare no conflicts of interest. References 1. Hodges R.J. Buzby J.C. Bennett B. Postharvest losses and waste in developed and less developed countries: Opportunities to improve resource use J. Agric. Sci. 2011 149 37 45 10.1017/S0021859610000936 2. Snyder A.B. Worobo R.W. Fungal Spoilage in Food Processing J. Food Prot. 2018 81 1035 1040 10.4315/0362-028X.JFP-18-031 29768029 3. Rizwana H. Bokahri N.A. Alsahli S.A. Al Showiman A.S. Alzahrani R.M. Aldehaish H.A. Postharvest disease management of Alternaria Annona muricata Saudi J. Biol. Sci. 2021 28 2236 2244 10.1016/j.sjbs.2021.01.014 33935566 PMC8071963 4. Shakeel Q. Shaheen M.R. Ali S. Ahmad A. Raheel M. Bajwa R.T. Chapter 1—Postharvest management of fruits and vegetables Applications of Biosurfactant in Agriculture Inamuddin C.O.A. Academic Press Cambridge, MA, USA 2022 1 16 10.1016/B978-0-12-822921-7.00001-5 5. Zakaria L. Fusarium Horticulturae 2023 9 322 10.3390/horticulturae9030322 6. Pouris J. Kolyva F. Bratakou S. Vogiatzi C.A. Chaniotis D. Beloukas A. The Role of Fungi in Food Production and Processing Appl. Sci. 2024 14 5046 10.3390/app14125046 7. Dijksterhuis J. Houbraken J. Fungal Spoilage of Crops and Food Agricultural and Industrial Applications. The Mycota Grüttner S. Kollath-Leiß K. Kempken F. Springer Cham, Switzerland 2025 Volume 16 31 66 10.1007/978-3-031-81904-9_3 8. Palou L. Valencia-Chamorro S.A. Pérez-Gago M.B. Antifungal edible coatings for fresh citrus fruit: A review Coatings 2015 5 962 986 10.3390/coatings5040962 9. Costa J.H. Wassano C.I. Angolini C.F.F. Scherlach K. Hertweek C. Fill T.P. Antifungal potential of secondary metabolites involved in the interaction between citrus pathogens Sci. Rep. 2019 9 18647 10.1038/s41598-019-55204-9 31819142 PMC6901458 10. Papoutsis K. Mathioudakis M.M. Hasperué J.H. Ziogas V. Non-chemical treatments for preventing the postharvest fungal rotting of citrus caused by Penicillium digitatum Penicillium italicum Trends Food Sci. Technol. 2019 86 479 491 10.1016/j.tifs.2019.02.053 11. Cheng Y. Lin Y. Cao H. Li Z. Citrus Postharvest Green Mold: Recent Advances in Fungal Pathogenicity and Fruit Resistance Microorganisms 2020 8 449 10.3390/microorganisms8030449 32209982 PMC7143998 12. Hanif Z. Ashari H. Post-harvest losses of citrus fruits and perceptions of farmers in marketing decisions E3S Web Conf. 2021 306 02059 10.1051/e3sconf/202130602059 13. Kadhim Z.R. Ali S.H. AL-Rubaye S.A. The economic impacts of the post-harvest losses of tangerines and Seville oranges crops in Iraq (Baghdad Governorate: As a case study) Bulg. J. Agric. Sci. 2025 31 237 244 14. Hall D.J. Comparative activity of selected food preservatives as citrus postharvest fungicides Proc. Fla. State Hortic. Soc. 1988 101 184 187 15. Holmes G.J. Eckert J.W. Sensitivity of Penicillium digitatum P. italicum Phytopathology 1999 89 716 721 10.1094/PHYTO.1999.89.9.716 18944698 16. Talibi I. Boubaker H. Boudyach E.H. Ait Ben Aoumar A. Alternative methods for the control of postharvest citrus diseases J. Appl. Microbiol. 2014 117 1 17 10.1111/jam.12495 24617532 17. Ma J. Li Y. Chen H. Zeng Z. Li Z.-L. Jiang H. Synthesis of Oxylipin Mimics and Their Antifungal Activity against the Citrus Postharvest Pathogens Molecules 2016 21 254 10.3390/molecules21020254 26907241 PMC6273781 18. Chen J. Shen Y. Chen C. Wan C. Inhibition of Key Citrus Postharvest Fungal Strains by Plant Extracts In Vitro and In Vivo: A Review Plants 2019 8 26 10.3390/plants8020026 30678206 PMC6409944 19. Kanashiro A.M. Akiyama D.Y. Kupper K.C. Fill T.P. Penicillium italicum Front. Microbiol. 2020 11 606852 10.3389/fmicb.2020.606852 33343551 PMC7746842 20. Wang Z. Sui Y. Li J. Tian X. Wang Q. Biological control of postharvest fungal decays in citrus: A review Crit. Rev. Food Sci. Nutr. 2020 62 861 870 10.1080/10408398.2020.1829542 33034197 21. Strano M.C. Altieri G. Allegra M. Di Renzo G.C. Paterna G. Matera A. Genovese F. Postharvest Technologies of Fresh Citrus Fruit: Advances and Recent Developments for the Loss Reduction during Handling and Storage Horticulturae 2022 8 612 10.3390/horticulturae8070612 22. Dhifi W. Bellili S. Jazi S. Bahloul N. Mnif W. Essential Oils’ Chemical Characterization and Investigation of Some Biological Activities: A Critical Review Medicines 2016 3 25 10.3390/medicines3040025 28930135 PMC5456241 23. Teles S. Pereira J.A. Santos C.H.B. Menezes R.V. Malheiro R. Lucchese A.M. Silva F. Effect of geographical origin on the essential oil content and composition of fresh and dried Mentha × villosa Ind. Crop. Prod. 2013 46 1 7 10.1016/j.indcrop.2012.12.009 24. Ademiluyi A.O. Sharifi-Rad R. Ayatollahi S.A. Iriti M. Biological Activities of Essential Oils: From Plant Chemoecology to Traditional Healing Systems Molecules 2017 22 70 10.3390/molecules22010070 28045446 PMC6155610 25. Heydari Z. Jafari L. Yavari A. Diversity in Essential Oil Compounds in Relation to Different Geographic Origins and Plant Organs of Salvia sharifii J. Med. Plants By Prod. 2023 12 83 92 10.22092/jmpb.2022.356878.1434 26. Tomou E.-M. Fraskou P. Dimakopoulou K. Dariotis E. Krigas N. Skaltsa H. Chemometric Analysis Evidencing the Variability in the Composition of Essential Oils in 10 Salvia Species from Different Taxonomic Sections or Phylogenetic Clades Molecules 2024 29 1547 10.3390/molecules29071547 38611827 PMC11013157 27. Iseppi R. Mariani M. Condò C. Sabia C. Messi P. Essential Oils: A Natural Weapon against Antibiotic-Resistant Bacteria Responsible for Nosocomial Infections Antibiotics 2021 10 417 10.3390/antibiotics10040417 33920237 PMC8070240 28. Dos Santos Janotto L. de Melo Nazareth T. Meca G. Bittecourt Luciano F. Gonçalves Evangelista A. Exploring the efficacy of antibiotic-essential oil combinations: Implications for combating antimicrobial resistance Bioresour. Technol. Rep. 2023 24 101679 10.1016/j.biteb.2023.101679 29. Öner E.K. Yeşil M. Effects of altitudes on secondary metabolite contents of Origanum majorana Sci. Rep. 2023 13 10765 10.1038/s41598-023-37909-0 37402865 PMC10319814 30. Miloudi S. Abbad I. Soulaimani B. Ferradous A. Abbad A. El Mouden H. Optimization of herbicidal activity of essential oil mixtures from Satureja alpina Thymus satureioides Myrtus communis Amaranthus retroflexus Crop Prot. 2024 180 106642 10.1016/j.cropro.2024.106642 31. Nazzaro F. Fratianni F. Coppola R. Feo V.D. Essential Oils and Antifungal Activity Pharmaceuticals 2017 10 86 10.3390/ph10040086 29099084 PMC5748643 32. Blowman K. Magalhães M. Lemos M.F.L. Cabral C. Pires I.M. Anticancer Properties of Essential Oils and Other Natural Products Evid. Based Complement. Altern. Med. 2018 2018 3149362 10.1155/2018/3149362 PMC5889900 29765461 33. Abd Rashed A. Rathi D.-N.G. Ahmad Nasir N.A.H. Abd Rahman A.Z. Antifungal Properties of Essential Oils and Their Compounds for Application in Skin Fungal Infections: Conventional and Nonconventional Approaches Molecules 2021 26 1093 10.3390/molecules26041093 33669627 PMC7922942 34. Mohamed Abdoul-Latif F. Ainane A. Houmed Aboubaker I. Mohamed J. Ainane T. Exploring the Potent Anticancer Activity of Essential Oils and Their Bioactive Compounds: Mechanisms and Prospects for Future Cancer Therapy Pharmaceuticals 2023 16 1086 10.3390/ph16081086 37631000 PMC10458506 35. Ivanova S. Gvozdeva Y. Staynova R. Grekova-Kafalova D. Nalbantova V. Benbassat N. Koleva N. Ivanov K. Essential oils—A review of the natural evolution of applications and some future perspectives Pharmacia 2025 72 1 12 10.3897/pharmacia.72.e140059 36. Tejeswini M.G. Sowmya H.V. Swarnalatha S.P. Negi P.S. Antifungal activity of essential oils and their combinations in vitro and in vivo conditions Arch. Phytopathol. Plant Prot. 2013 47 564 570 10.1080/03235408.2013.814235 37. Felšöciová S. Vukovic N. Jeżowski P. Kačániová M. Antifungal activity of selected volatile essential oils against Penicillium Open Life Sci. 2020 15 511 521 10.1515/biol-2020-0045 33817239 PMC7874545 38. Ferreira E.S. Rosalen P.L. Benso B. de Cássia Orlandi Sardi J. Denny C. de Sousa S.A. Guerra F.Q.S. de Oliveira Lima E. Almeida Freires I. Dias de Castro R. The Use of Essential Oils and Their Isolated Compounds for the Treatment of Oral Candidiasis: A Literature Review Evid. Based Complement. Altern. Med. 2021 2021 1059274 10.1155/2021/1059274 PMC7810551 33505486 39. Hou T. Sana S.S. Li H. Xing Y. Nanda A. Netala V.R. Zhang Z. Essential oils and its antibacterial, antifungal and anti-oxidant activity applications: A review Food Biosci. 2022 47 101716 10.1016/j.fbio.2022.101716 40. Tran H.M. Le D.H. Nguyen V.-A.T. Vu T.X. Thanh N.T.K. Giang D.H. Dat N.T. Pham H.T. Muller M. Nguyen H.Q. Penicillium digitatum J. Fungi 2022 8 956 10.3390/jof8090956 PMC9502062 36135681 41. Daferera D.J. Ziogas B.N. Polissiou M.G. GC-MS analysis of essential oils from some Greek aromatic plants and their fungitoxicity on Penicillium digitatum J. Agric. Food Chem. 2000 48 2576 2581 10.1021/jf990835x 10888587 42. Plaza P. Torres R. Usall J. Lamarca N. Vinas I. Evaluation of the potential of commercial postharvest application of essential oils to control citrus decay J. Hortic. Sci. Biotechnol. 2004 79 935 940 10.1080/14620316.2004.11511869 43. Yahyazadeh M. Omidbaigi R. Zare R. Taheri H. Effect of some essential oils on mycelial growth of Penicillium digitatum World J. Microbiol. Biotechnol. 2008 24 1445 1450 10.1007/s11274-007-9636-8 44. Jing L. Lei Z. Li L. Xie R. Xi W. Guan Y. Sumner L.W. Zhou Z. Antifungal Activity of Citrus Essential Oils J. Agric. Food Chem. 2014 62 3011 3033 10.1021/jf5006148 24628448 45. Tao N. Jia L. Zhou H. Anti-fungal activity of Citrus reticulata Blanco essential oil against Penicillium italicum Penicillium digitatum Food Chem. 2014 153 265 271 10.1016/j.foodchem.2013.12.070 24491729 46. Boubaker H. Karim H. El Hamdaoui A. Msanda F. Leach D. Bombarda I. Vanloot P. Abbad A. Boudyach E.H. Ait Ben Aoumar A. Chemical characterization and antifungal activities of four Thymus Ind. Crops Prod. 2016 86 95 101 10.1016/j.indcrop.2016.03.036 47. Moussa H. El Omari B. Chefchaou H. Tanghort M. Mzabi A. Chami N. Remmal A. Action of thymol, carvacrol and eugenol on Penicillium Geotrichum Can. J. Plant Pathol. 2020 43 26 34 10.1080/07060661.2020.1767692 48. Et-tazy L. Lamiri A. Satia L. Essahli M. Bencheqroun S.K. In Vitro Antioxidant and Antifungal Activities of Four Essential Oils and Their Major Compounds against Post-Harvest Fungi Associated with Chickpea in Storage Plants 2023 12 3587 10.3390/plants12203587 37896050 PMC10610340 49. Martins G.A. Bicas J.L. Antifungal activity of essential oils of tea tree, oregano, thyme, and cinnamon, and their components Braz. J. Food Technol. 2024 27 e2023071 10.1590/1981-6723.07123 50. Arras G. Usai M. Fungitoxic Activity of 12 Essential Oils against Four Postharvest Citrus Pathogens: Chemical Analysis of Thymus capitatus J. Food Prot. 2001 64 1025 1029 10.4315/0362-028X-64.7.1025 11456187 51. Rahman M.M. Wills R.B.H. Bowyer M.C. Golding J.B. Kirkman T. Pristijono P. Efficacy of Orange Essential Oil and Citral after Exposure to UV-C Irradiation to Inhibit Penicillium digitatum Horticulturae 2020 6 102 10.3390/horticulturae6040102 52. Alvarez M.V. Palou L. Taberner V. Fernández-Catalán A. Argente-Sanchis M. Pitta E. Pérez-Gago M.B. Natural Pectin-Based Edible Composite Coatings with Antifungal Properties to Control Green Mold and Reduce Losses of ‘Valencia’ Oranges Foods 2022 11 1083 10.3390/foods11081083 35454670 PMC9033115 53. Wardana A.A. Kingwascharapong P. Wigati L.P. Tanaka F. Tanaka F. The antifungal effect against Penicillium italicum Food Packag. Shelf Life 2022 32 100849 10.1016/j.fpsl.2022.100849 54. Olmedo G.M. Zhang J. Zhao W. Mattia M. Rosskopf E.N. Ritenour M. Plotto A. Bai J. Application of Thymol Vapors to Control Postharvest Decay Caused by Penicillium digitatum Lasiodiplodia theobromae Foods 2023 12 3637 10.3390/foods12193637 37835290 PMC10572620 55. Gharzouli M. Aouf A. Mahmoud E. Ali H. Alsulami T. Badr A.N. Ban Z. Farouk A. Antifungal effect of Algerian essential oil nanoemulsions to control Penicillium digitatum Penicillium expansum Citrus sinensis Front. Plant Sci. 2024 15 1491491 10.3389/fpls.2024.1491491 39640995 PMC11617202 56. Maunpuii C.V.L. Maisnam R. Antuhu Y.L. Kumari A. López-Menchero J.R. González-Coloma A. Andrés M.F. Kaushik N. Evaluating the efficiency of essential oils as fumigants in controlling Penicillium digitatum BIO Web Conf. 2024 110 02009 10.1051/bioconf/202411002009 57. Maswanganye L.T.C. Pillai S.K. Sivakumar D. Chitosan Coating Loaded with Spearmint Essential Oil Nanoemulsion for Antifungal Protection in Soft Citrus ( Citrus reticulata Coatings 2025 15 105 10.3390/coatings15010105 58. Sánchez-Torres P. Emerging alternatives to control fungal contamination Curr. Opin. Food Sci. 2025 61 101255 10.1016/j.cofs.2024.101255 59. Pérez-Alonso C.O. Martínez-Romero D. Zapata P.J. Serrano M. Valero D. Castillo S. The effects of essential oils carvacrol and thymol on growth of Penicillium digitatum P. italicum Int. J. Food Microbiol. 2012 158 101 106 10.1016/j.ijfoodmicro.2012.07.002 22831817 60. Re R. Pellegrini N. Proteggente A. Pannala A. Yang M. Rice-Evans C. Antioxidant activity applying an improved ABTS radical cation decolorization assay Free Radic. Biol. Med. 1999 26 1231 1237 10.1016/S0891-5849(98)00315-3 10381194 61. Brand-Williams W. Cuvelier M.E. Berset C. Use of a free radical method to evaluate antioxidant activity LWT Food Sci. Technol. 1995 28 25 30 10.1016/S0023-6438(95)80008-5 62. Morris S.C. Nicholls P.J. An evaluation of optical density to estimate fungal spore concentrations in water suspensions Phytopathology 1978 68 1240 1242 10.1094/Phyto-68-1240 63. Barnett H.L. Hunter B.B. Illustrated Genera of Imperfect Fungi 4th ed. APS Press Saint Paul, MN, USA 1998 218p 64. Pitt J.I. A Laboratory Guide to Common Penicillium 2nd ed. CSIRO Division of Food Processing North Ryde, New South Wales, Australia 1988 187p 65. Romero C.S. Hongos Fitopatógenos Universidad Autónoma Chapingo Chapingo, Estado de México, Mexico 1988 347p 66. Bauer A.W. Kirby W.M.M. Sherris J.C. Turck M. Antibiotic susceptibility testing by a standardized single disk method Am. J. Clin. Pathol. 1966 45 493 496 10.1093/ajcp/45.4_ts.493 5325707 67. Hossain T.J. Methods for screening and evaluation of antimicrobial activity: A review of protocols, advantages, and limitations Eur. J. Microbiol. Immunol. 2024 14 97 115 10.1556/1886.2024.00035 38648108 PMC11097785 68. R Core Team R: A Language and Environment for Statistical Computing R Foundation for Statistical Computing Vienna, Austria 2024 69. Thaipong K. Boonprakob U. Crosby K. Cisneros-Zevallos L. Hawkins Byrne D. Comparison of ABTS, DPPH, FRAP, and ORAC assays for estimating antioxidant activity from guava fruit extracts J. Food Compos. Anal. 2006 19 669 675 10.1016/j.jfca.2006.01.003 70. El Hajli F. Chakir S. Annemer S. Assouguem A. Elaissaoui F. Ullah R. Ali E.A. Choudhary R. Hammani K. Lahlali R. Tetraclinis articulata Mentha pulegium Thymus zygis Open Chem. 2025 23 20250131 10.1515/chem-2025-0131 71. Radi F.Z. Bouhrim M. Mechchate H. Al-zahrani M. Qurtam A.A. Aleissa A.M. Drioiche A. Handaq N. Zair T. Phytochemical Analysis, Antimicrobial and Antioxidant Properties of Thymus zygis Thymus willdenowii Plants 2022 11 15 10.3390/plants11010015 PMC8747066 35009019 72. Gonçalves M.J. Cruz M.T. Cavaleiro C. Lopes M.C. Salgueiro L. Chemical, antifungal and cytotoxic evaluation of the essential oil of Thymus zygis sylvestris Ind. Crops Prod. 2010 32 70 75 10.1016/j.indcrop.2010.03.005 73. Pina-Vaz C. Gonçalves A. Pinto E. Costa-de-Oliveira S. Tavares C. Salgueiro L. Cavaleiro C. Gonçalves M.J. Martinez-de-Oliveira J. Antifungal activity of Thymus J. Eur. Acad. Dermatol. Venereol. 2004 18 73 78 10.1111/j.1468-3083.2004.00886.x 14678536 74. Gourich A.A. Bencheikh N. Bouhrim M. Regragui M. Rhafouri R. Drioiche A. Asbabou A. Remok F. Mouradi A. Addi M. Comparative Analysis of the Chemical Composition and Antimicrobial Activity of Four Moroccan North Middle Atlas Medicinal Plants’ Essential Oils: Rosmarinus officinalis Mentha pulegium Salvia officinalis Thymus zygis gracilis Chemistry 2022 4 1775 1788 10.3390/chemistry4040115 75. Sáez F. Essential oil variability of Thymus zygis Phytochemistry 1995 40 819 825 10.1016/0031-9422(95)00347-A 76. Rodrigues V. Cabral C. Évora L. Ferreira I. Cavaleiro C. Cruz M.T. Salgueiro L. Chemical composition, anti-inflammatory activity and cytotoxicity of Thymus zygis sylvestris Arab. J. Chem. 2015 12 3236 3243 10.1016/j.arabjc.2015.08.026 77. Pérez-Sánchez R. Ubera J.L. Lafont F. Gálvez C. Composition and Variability of the Essential Oil in Thymus zygis J. Essent. Oil Res. 2008 20 192 200 10.1080/10412905.2008.9699989 78. Šegvić M. Kosalec I. Mastelić J. Piecková E. Pepeljnak S. Antifungal activity of thyme ( Thymus vulgaris Lett. Appl. Microbiol. 2007 44 36 42 10.1111/j.1472-765X.2006.02032.x 17209812 79. Golparvar A.R. Hadipanah A. A Review of the Chemical Composition of Essential Oils of Thymus Res. Crop Ecophysiol. 2023 18 25 51 10.30486/roce.2023.705509 80. Etri K. Pluhár Z. Exploring Chemical Variability in the Essential Oils of the Thymus Plants 2024 13 1375 10.3390/plants13101375 38794445 PMC11124942 81. Delgado T. Marinero P. Asensio-S.-Manzanera M.C. Asensio C. Herrero B. Pereira J.A. Ramalhosa E. Antioxidant activity of twenty wild Spanish Thymus mastichina LWT Food Sci. Technol. 2014 57 412 418 10.1016/j.lwt.2013.12.041 82. Macedo S. Piçarra A. Guerreiro M. Salvador C. Candeias F. Caldeira A.T. Martins M.R. Toxicological and pharmacological properties of essential oils of Calamintha nepeta Origanum virens Thymus mastichina Food Chem. Toxicol. 2019 133 110747 10.1016/j.fct.2019.110747 31377137 83. Mateus D. Costa F. de Jesus V. Malaquias L. Biocides Based on Essential Oils for Sustainable Conservation and Restoration of Mural Paintings in Built Cultural Heritage Sustainability 2024 16 11223 10.3390/su162411223 84. Fraternale D. Giamperi L. Ricci D. Chemical Composition and Antifungal Activity of Essential Oil Obtained from In Vitro Plants of Thymus mastichina J. Essent. Oil Res. 2003 15 278 281 10.1080/10412905.2003.9712142 85. Rodrigues M. Lopes A.C. Vaz F. Filipe M. Alves G. Ribeiro M.P. Coutinho P. Araujo A.R.T.S. Thymus mastichina Pharmaceuticals 2020 13 479 10.3390/ph13120479 33352776 PMC7766293 86. Diánez F. Santos M. Parra C. Navarro M.J. Blanco R. Gea F.J. Screening of antifungal activity of 12 essential oils against eight pathogenic fungi of vegetables and mushroom Lett. Appl. Microbiol. 2018 67 400 410 10.1111/lam.13053 30022505 87. Machado A.M. Lopes V. Barata A.M. Póvoa O. Farinha N. Figueiredo A.C. Essential Oils from Origanum vulgare virens Plants 2023 12 621 10.3390/plants12030621 36771704 PMC9919071 88. Soltani S. Shakeri A. Iranshahi M. Boozari M. A Review of the Phytochemistry and Antimicrobial Properties of Origanum vulgare Iran J. Pharm. Res. 2001 20 268 285 10.22037/ijpr.2020.113874.14539 PMC8457725 34567161 89. Kocić-Tanackov S.D. Dimić G.R. Tanackov I.J. Pejin D.J. Mojović L.V. Pejin J.D. Antifungal activity of Oregano ( Origanum vulgare Fusarium Penicillium Hemjska Ind. 2012 66 33 41 10.2298/HEMIND110614073K 90. Zulu L. Gao H. Zhu Y. Wu H. Xie Y. Liu X. Yao H. Rao Q. Antifungal effects of seven plant essential oils against Penicillium digitatum Chem. Biol. Technol. Agric. 2023 10 82 10.1186/s40538-023-00434-3 91. Vitoratos A. Bilalis D. Karkanis A. Efthimiadou A. Antifungal Activity of Plant Essential Oils Against Botrytis cinerea Penicillium italicum Penicillium digitatum Not. Bot. Horti. Agrobot. 2013 41 86 92 10.15835/nbha4118931 92. Domingues J. Goulão M. Delgado F. Gonçalves J.C. Gonçalves J. Pintado C.S. Essential Oils of Two Portuguese Endemic Species of Lavandula as a Source of Antifungal and Antibacterial Agents Processes 2023 11 1165 10.3390/pr11041165 93. Pombal S. Rodrigues C.F. Araújo J.P. Rocha P.M. Rodilla J.M. Diez D. Granja Á.P. Gomes A.C. Silva L.A. Antibacterial and antioxidant activity of Portuguese Lavandula luisieri SpringerPlus 2016 5 1711 10.1186/s40064-016-3415-7 27777848 PMC5050179 94. Tyagi A.K. Malik A. Antimicrobial potential and chemical composition of Mentha piperita Food Control 2011 22 1707 1714 10.1016/j.foodcont.2011.04.002 95. Reddy D.N. Al-Rajab A.J. Sharma M. Moses M.M. Reddy G.R. Albratty M. Chemical constituents, in vitro antibacterial and antifungal activity of Mentha  ×  Piperita J. King Saud Univ. Sci. 2019 31 528 533 10.1016/j.jksus.2017.07.013 96. Zamanian Z. Bonyadian M. Moshtaghi H. Ebrahimi A. Antifungal effects of essential oils of Zataria multiflora Mentha pulegium Mentha piperita J. Food Qual. Hazards Control 2021 8 41 44 10.18502/jfqhc.8.1.5462 97. Kgang I.E. Mathabe P.M.K. Klein A. Kalombo L. Belay Z.A. Caleb O.J. Effects of lemon ( Citrus Limon Cymbopogon citratus Mentha piperita Botrytis cinerea Penicillium expansum JSFA Rep. 2022 2 405 414 10.1002/jsf2.75 Figure 1 Fungal isolation: ( a P. digitatum b P. italicum Figure 2 Photographic progression of P. digitatum P italicum Th. zygis sylvestris M. × piperita Figure 3 Inhibition halo boxplot produced by the different essential oil samples. (Note 2: OVV: O vulgare virens L pedunculata sampaioana L stoechas luisieri Th mastichina Th zygis sylvestris M × piperita microorganisms-13-02042-t001_Table 1 Table 1 Yield of the essential oil extraction by hydrodistillation. Species Code Yield ( w w % ( w w O. vulgare virens OVV 4.09 0.41 L. pedunculata sampaioana LPS 12.80 1.28 L. stoechas luisieri LSL 4.22 0.42 Th. zygis sylvestris TZS 8.78 0.88  Th. mastichina TM 24.29 2.43 M piperita MP 6.17 0.62 microorganisms-13-02042-t002_Table 2 Table 2 Composition of the essential oils. (Note 1: value in %). (Note 2: OVV: O vulgare virens L pedunculata sampaioana L stoechas luisieri Th mastichina Th zygis sylvestris M × piperita RI-WAX RI-HP5 Compound OVV LPS LSL TM TZS MP 1025 933 Alpha-Pinene 0.67 6.35 1.83 3.44 0.51 0.74 1029 918 Alpha-Thujene 1.63 0.01  0.21 1.32 0.06 1069 953 Camphene 0.29 2.29 0.10 0.10 0.14 0.02 1114 978 Beta-Pinene 0.18 0.05 0.30 5.11 0.13 1.17 1126 972 Sabinene 0.29 0.03 0.12 3.83 0.07 0.67 1133 940 Cymene Isomer   2.67    1165 991 Beta-Myrcene 2.28 0.17 0.07 1.87 1.91 0.33 1186 1018 Alpha-Terpinene 3.76 0.03   1.33 0.26 1206 1021 Limonene 0.35 2.03 0.20 1.17 0.32 3.42 1222 1039 1,8-Cineole 0.02 0.93 17.71 66.06  6.72 1238 1035 Cis-Beta-Ocimene 2.15 0.15 0.45 0.02 0.01 0.27 1254 1058 Gamma-Terpinene 30.69 0.05 0.12 1.79 5.72 0.41 1278 1025 Para-Cymene 5.26 0.24 0.14 1.03 9.36 0.08 1418 1090 Fenchone  34.20 0.28    1465 1074 Trans-Sabinene Hydrate 0.16   0.70 0.68 0.82 1484 1124 Menthone      29.12 1500 1164 Menthofuran      4.94 1510 1166 Isomenthone      4.31 1541 1149 Camphor  36.51 1.00    1553 1100 Linalool 0.16 2.00 2.29 4.14 0.86 0.26 1574 1294 Menthyl Acetate      2.36 1592 1239 Thymol Methyl Ether 1.88    0.01  1595 1119 Fenchol <endo->  0.86     1599 1288 Bornyl Acetate  0.98 0.06 <0.01   1606 1280 Trans-Alpha-Necrodyl Acetate   20.46    1607 1239 Carvacrol Methyl Ether 2.38    0.05  1608 1165 Neo-Menthol      4.11 1617 1450 Trans-Beta Caryophyllene 1.61 0.04 0.22 0.12 1.41 1.18 1619 1284 Lavandulyl Acetate  0.20 4.01    1636 1296 Arbozol   2.24    1653 1169 L-Menthol      27.56 1662 1170 Delta-Terpineol    1.50  0.22 1665 1244 Pulegone      3.98 1668 1187 5-Methylene-2,3,4,4-tetrame-2-Cyclopentenone   2.37     1860 Unknown Sesquiterpenol   2.06    1679 1172 Trans-Alpha-Necrodol   6.56    1696 1195 Alpha-Terpineol 0.11 0.29 0.29 4.86 0.13 0.44 1713 1167 Borneol 0.65 0.78  0.12 0.34 0.02 2168 1293 Thymol 36.72    68.83 0.08 2192 1316 Carvacrol 0.28   0.17 2.54  microorganisms-13-02042-t003_Table 3 Table 3 Antioxidant Activity Results (ABTS and DPPH methods). (Note 1: mean ± standard deviation) (Note 2: EO: Essential oil, OVV: O vulgare virens L pedunculata sampaioana L stoechas luisieri Th mastichina Th zygis sylvestris M × piperita Code ABTS DPPH mM TROLOX eq. g TROLOX eq./g EO mM TROLOX eq. g TROLOX eq./g EO OVV 76.45 ± 3.02 433.01 ± 17.10 25.15 ± 1.69 142.45 ± 9.57 LPS 3.84 ± 0.26 20.79 ± 1.41 2.17 ± 0.16 11.73 ± 0.87 LSL 24.06 ± 0.64 131.33 ± 3.47 33.91 ± 1.21 184.99 ± 6.58 TM 9.76 ± 0.41 54.19 ± 2.30 0.96 ± 0.03 5.31 ± 0.16 TZS 161.70 ± 0.15 864.20 ± 0.81 25.34 ± 1.08 135.42 ± 5.78 MP 4.83 ± 0.09 26.94 ± 0.51 3.83 ± 0.13 21.34 ± 0.74 microorganisms-13-02042-t004_Table 4 Table 4 Statistical parameters from inhibition halo measurement (Note 1: x̅ = mean, s = standard deviation, Me = median, Max = maximum value, Min = minimum value, SEM = standard error) (Note 2: OVV: O vulgare virens L pedunculata sampaioana L stoechas luisieri Th mastichina Th zygis sylvestris M × piperita EO x̅ s Me Max Min SEM  P. digitatum OVV 31.33 3.21 30.00 35.00 29.00 1.86 LPS 20.17 3.25 20.00 23.50 17.00 1.88 LSL 30.67 1.15 30.00 32.00 30.00 0.67 TM 16.17 0.29 16.00 16.50 16.00 0.17 TZS 60.50 5.77 60.00 66.50 55.00 3.33 MP 19.33 3.21 18.00 23.00 17.00 1.86  P. italicum OVV 27.00 6.38 28.50 32.50 20.00 3.69 LPS 14.17 0.76 14.00 15.00 13.50 0.44 LSL 37.33 2.52 37.00 40.00 35.00 1.45 TM 13.67 1.26 13.50 15.00 12.50 0.73 TZS 54.33 2.93 55.50 56.50 51.00 1.69 MP 20.33 3.06 21.00 23.00 17.00 1.76 ",
  "metadata": {
    "Title of this paper": "Effects of lemon (",
    "Journal it was published in:": "Microorganisms",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472003/"
  }
}