{
  "title": "Paper_301",
  "abstract": "pmc J Public Health Res J Public Health Res 2534 jphr PHJ Journal of Public Health Research 2279-9028 2279-9036 SAGE Publications PMC12484908 PMC12484908.1 12484908 12484908 41040469 10.1177/22799036251380778 10.1177_22799036251380778 1 Article Effectiveness of Youth-Led awareness and advocacy intervention in shaping adolescents’ attitudes toward tobacco products in Nepal: A quasi-experimental study https://orcid.org/0000-0002-2076-5604 Karki Sandeepa 1 https://orcid.org/0000-0001-5244-5536 Khatri Dhurba 1 https://orcid.org/0000-0003-3077-6697 Paudel Shishir 1 2 https://orcid.org/0009-0005-5534-4876 Chhetri Yamuna 1 https://orcid.org/0009-0004-4267-2670 Shetty Ganesh 1 https://orcid.org/0009-0002-6515-6770 Khadka Prashant 1 https://orcid.org/0009-0001-7622-1577 Pandey Pratikshya 3 Koirala Bhagawan 1 1 2 3 Shishir Paudel, Kathmandu Institute of Child Health, Hepali Height, Kathmandu 44600, Nepal. Email: shishirpaudel11@gmail.com 30 9 2025 7 2025 14 3 492847 22799036251380778 7 5 2025 4 9 2025 30 09 2025 02 10 2025 03 10 2025 © The Author(s) 2025 2025 SAGE Publications Ltd unless otherwise noted. Manuscript content on this site is licensed under Creative Commons Licenses. https://creativecommons.org/licenses/by-nc/4.0/ This article is distributed under the terms of the Creative Commons Attribution-NonCommercial 4.0 License ( https://creativecommons.org/licenses/by-nc/4.0/ https://us.sagepub.com/en-us/nam/open-access-at-sage Background: Tobacco use among adolescents (aged 10–19 years) remains a pressing public health concern, particularly in low-and middle-income countries like Nepal. Despite the presence of tobacco control policies, adolescents continue to access tobacco products. This study assessed effectiveness of a youth-led intervention in shaping adolescents’ attitudes toward tobacco products in Budhanilkantha Municipality, Nepal. Design and Methods: Quasi-experimental pre-post study was conducted among 305 adolescents. The intervention, implemented under the “Youth for Tobacco Initiative,” included sensitization, peer-led education, and stakeholder engagement. Data were collected using a structured, self-administered questionnaire, which was completed by students in their classroom setting. The questionnaire assessed sociodemographic characteristics, tobacco exposure, and attitudes toward tobacco use. Changes in attitudes were analyzed using paired t d Results: Age of the participants ranged between 12 and 18 years (mean age: 15.0 ± 1.32 years). At baseline, 18.7% of adolescents reported tobacco use, and 13.8% reported currently smoking tobacco. Post-intervention, there was a statistically significant improvement in attitudes toward tobacco (mean score increased from 5.86 to 6.12; p d Conclusions: Youth-led awareness initiatives can positively influence adolescents’ attitudes toward tobacco, particularly through peer education and community involvement. Integrating such interventions into broader, multi-sectoral strategies can enhance their long-term impact. adolescent tobacco use health education implementation research peer education tobacco prevention tobacco control intervention Nepal AstraZeneca https://doi.org/10.13039/100004325 Request ID 89903437 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes cover-date July-September 2025 typesetter ts1 Introduction Tobacco use remains a significant global public health challenge, contributing to preventable morbidity and mortality worldwide. It has been estimated that tobacco use is responsible for more than 8 million deaths annually, with the vast majority occurring in low- and middle-income countries (LMICs) due to higher consumption rates, weaker tobacco control policies, and limited access to cessation programs. 1 2 1 3  1 Adolescents (aged 10–19 years), represent a particularly vulnerable group, as early exposure to tobacco and nicotine significantly increases the risk of long-term nicotine dependence. 4 5  6  5 6 8 6 9  10 11 12 In Nepal, comprehensive national data on adolescent tobacco use remain limited. However, findings from the Global Youth Tobacco Survey (GYTS) conducted in 2007 revealed that 7.9% of Nepalese students aged 13–15 years had smoked cigarettes at least once, while 8% had used other tobacco products.  13  6  14  14  1  15 Nepal has introduced several policies to regulate tobacco use, particularly among young people. The Tobacco Product Control and Regulatory Act 2011 aims to reduce tobacco consumption by prohibiting the sale of tobacco products to minors and restricting tobacco sales within 100 m of educational institutions.  16  17  16  18 Recognizing the limitations of existing tobacco control policies, the Youth for Tobacco Initiative has emerged as a promising intervention to curb adolescent tobacco use in Nepal. This program aims to prevent tobacco initiation among adolescents by fostering negative attitudes toward tobacco products through peer-led health education programs, advocacy efforts, and interactive awareness campaigns. Adolescents play an active role in these interventions, engaging their peers through workshops, discussions, and media campaigns designed to shift social norms around tobacco consumption. Such peer-led programs have been proven effective in high-income settings as well, such as the ASSIST (A Stop Smoking In Schools Trial) program in England and Wales trained influential adolescents to discourage tobacco use among peers, significantly reducing smoking prevalence by up to 22% at follow-ups up to 2 years.  19  20 The Theory of Planned Behavior (TPB) suggests that attitudes, social norms, and perceived behavioral control significantly influence behavioral intentions. Youth-led awareness programs align with this framework by promoting negative perceptions of tobacco use, reinforcing social norms against smoking, and empowering adolescents to resist peer pressure.  21  22 Method Study design and setting This study employed a quasi-experimental, pre-post intervention design without a control group to assess the effectiveness of a youth-led awareness initiative on adolescents’ attitudes toward tobacco use. The study was conducted in Budhanilkantha Municipality, Nepal, among school-going adolescents. The intervention was part of the Youth for Tobacco Initiative, a community-driven program aimed at reducing tobacco use among young people through peer-led education and awareness campaigns. Baseline data were collected between 27 December 2024 and 5 January 2025. The youth-led intervention was implemented over a 2-week period from 6 January to 19 January 2025. Post-intervention data collection was conducted from 11 to 27 March 2025, approximately 7 weeks after the completion of the intervention Sample size determination The sample size for this study was determined using the formula for comparing means ( n Z α/2+ Z β 2 σ 2 d 2 Z α/2 Z β σ d Intervention program The “Youth for Tobacco Initiative” Sensitization program The intervention began with a sensitization program led by the research team to introduce the Youth for Tobacco Initiative Youth-led advocacy and education program A youth-led advocacy and education component was implemented after the sensitization program. Three students from each school were selected as peer leaders based on their leadership skills and willingness to participate. Each school also designated one teacher as a facilitator to guide and support the peer leaders. These selected students underwent structured training sessions conducted by public health professionals, equipping them with knowledge of tobacco-related health risks, the legal framework governing tobacco use, and effective peer education strategies. After completing their training, the peer leaders conducted various advocacy activities within their schools. These activities included classroom sessions where they educated their fellow students on the dangers of tobacco, interactive workshops, quiz competitions, exhibitions, and role-playing exercises. Demonstrations and gamified learning activities were integrated to maintain student engagement and make learning more impactful. The peer leaders also initiated social media awareness campaigns and poster competitions to spread anti-tobacco messages beyond the classroom setting. The intervention program was closely monitored through regular check-ins with peer leaders and facilitators to assess participation levels and knowledge retention among students. Community stakeholder engagement To ensure the sustainability of the intervention, community stakeholder engagement was a key component. Meetings were conducted with school administrators, local government officials, municipal authorities, healthcare professionals, and representatives from non-governmental organizations working on tobacco control to discuss long-term strategies for integrating tobacco prevention into school curricula. Parents and community leaders were also engaged in dialog sessions to reinforce the importance of collective efforts in preventing adolescent tobacco use. In addition to these discussions, key stakeholders actively participated in youth-led activities, attending workshops, judging competitions, and providing mentorship to students to further strengthen their advocacy efforts. Feedback was collected from teachers, students, and community stakeholders to monitor the progress and effectiveness of the intervention. The research team provided ongoing support and facilitated discussions to address any challenges encountered during implementation. Data collection Data were collected using a structured, self-administered questionnaire at two-time points: baseline (pre-intervention) and post-intervention. Both rounds of data collection were conducted in the students’ regular classroom settings during dedicated 1-hour sessions, coordinated with the support of schoolteachers to minimize disruption to academic schedules. The questionnaire was divided into four sections to ensure comprehensive data collection. The first section captured sociodemographic information, including age, gender, ethnicity, parental education, and employment status. The second section focused on environmental exposure, assessing parental and peer tobacco use, exposure to anti-tobacco messages, and school-based tobacco education. The third section measured attitudes toward tobacco use through a Likert-scale questionnaire adapted from validated tobacco perception scales. This section evaluated perceptions of smoking, the perceived harm of secondhand smoke, and support for smoking bans. The final section included self-reported tobacco use behaviors to monitor changes before and after the intervention. The questions were based on the Global Youth Tobacco Survey (GYTS).  23 Assessment of attitudes toward tobacco use The attitude of adolescents toward tobacco use was assessed based on a structured questionnaire developed in consultation with experts in public health, health promotion and education, and community medicine. The tool was developed in reflection of the Global Youth Tobacco Survey (GYTS) tool and focused on capturing participants’ perceptions of smoking, awareness of tobacco-related harm, and their stance on tobacco control measures. The attitude assessment scale comprised seven items, each rated on a binary response format (Yes/No). The items assessed key domains, including susceptibility to smoking, perceived harm of secondhand smoke, and support for smoking bans. Higher scores indicated stronger anti-tobacco attitudes. The detailed questionnaire used in this study is attached as supplementary document Statistical analysis The data were entered through EpiData and exported to SPSS version 16 for further analysis. Descriptive statistics, including frequencies and proportions, summarized categorical variables such as sociodemographic characteristics and different tobacco use patterns among adolescents. The paired t d p Ethical approval and informed consent Ethical approval for this study was obtained from the Ethical Review Board of the Nepal Health Research Council, Kathmandu, Nepal (Ref. No: 1274; Proposal ID: 420_2024). With the support of the schools, parents were oriented about the study and provided with written informed consent forms, which they returned with either a signature or thumbprint. Written informed assent was obtained from the adolescents at school after explaining the study procedures. Participation was voluntary, and participants had the right to withdraw from the study at any time without consequence. The confidentiality and anonymity of participants were strictly maintained throughout the study. Result A total of 305 adolescents participated in the study, with ages ranging from 12 to 18 years (mean age: 15.0 ± 1.32 years). The sample comprised almost equal proportion of female and male students at 53.8% and 46.2%, respectively. In terms of ethnicity, Janajati adolescents made up the largest proportion (59.3%), followed by Brahmin/Chhetri (32.5%) and Dalit (8.2%). In terms of parental education, 19.3% of fathers and 29.8% of mothers were illiterate, while 23.6% of fathers and 17.4% of mothers had secondary-level education. Regarding household composition, 74.4% of participants lived with their parents, 22.3% with relatives, and 3.3% with friends ( Table 1 Table 1. Sociodemographic characteristics of participants. Variables n Age <16 years 200 (65.6) ≥16 years 105 (34.4) Gender Male 141 (46.2) Female 164 (53.8) Ethnicity Janajati 181 (59.3) Brahmin/Chhetri 99 (32.5) Dalit 25 (8.2) Father education Illiterate 59 (19.3) Informal education 64 (21.0) Primary level (1–5) 18 (5.9) Lower secondary (6–7) 70 (23.0) Secondary level (8–10) 72 (23.6) Higher secondary 22 (7.2) Mothers education Illiterate 91 (29.8) Informal education 76 (24.9) Primary level (1–5) 13 (4.3) Lower secondary level (6–8) 57 (18.7) Secondary level (8–10) 53 (17.4) Higher secondary 15 (4.9) Father’s employment Business 103 (33.8) Foreign employment 82 (26.9) Private jobs 59 (19.3) Government jobs 32 (10.5) Unemployed 29 (9.5) Mother’s employment Homemaker 165 (54.1) Business 66 (21.6) Private jobs 28 (9.2) Foreign employment 25 (8.2) Governmental jobs 21 (6.9) Currently living with Parents 227 (74.4) Relatives 68 (22.3) Friends 10 (3.3) The overall prevalence of tobacco use among adolescents was 18.7% (95% CI: 14.7–23.4), while 13.8% (95% CI: 10.4–18.1) were classified as people who actively smoke. Lifetime smoking was reported by 7.9% of participants, with 5.6% identified as currently consuming cigarette. Additionally, 4.6% reported bidi smoking, while 7.2% used other forms of smoking products. The use of smokeless tobacco was lower, with 3.0% consuming Gutka, 6.6% using pan masala, and 2.0% consuming khaini ( Table 2 Table 2. Prevalence of tobacco use among students. Variable Yes, n No, n Lifetime smoking 24 (7.9) 281 (92.1) Current cigarette smoking 17 (5.6) 288 (94.4) Bidi smoking 14 (4.6) 291 (95.4) Other forms of smoking 22 (7.2) 283 (92.8) Gutka consumption 9 (3.0) 296 (97.0) Pan masala consumption 20 (6.6) 285 (93.4) Khaini tobacco consumption 6 (2.0) 299 (98.0) Smokeless tobacco consumption 7 (2.3) 298 (97.7) Overall tobacco use (prevalence of tobacco use) 57 (18.7) 248 (81.3) Overall smoking prevalence (prevalence of smoking) 42 (13.8) 263 (86.2) Parental smoking prevalence was notable, with 26.2% of fathers and 9.2% of mothers identified as individuals who use tobacco through smoking. Among other family members, 33.4% reported smoking tobacco, while 23.0% used smokeless tobacco products. The majority of the studies (72.8%) reported being exposed to anti-tobacco messages through mass media in the last 30 days. However, only 36.7% had discussed tobacco effects in class, and 41.6% had received formal education about the risks associated with tobacco use ( Table 3 Table 3. Family tobacco use and environmental exposure. Variable Yes, n No, n Father’s smoking prevalence 80 (26.2) 225 (73.8) Mother’s smoking prevalence 28 (9.2) 277 (90.8) Other family members smoking product 102 (33.4) 203 (66.6) Other family members using smokeless tobacco 70 (23.0) 235 (77.0) Availability of school health nurse at their school 195 (63.9) 110 (36.1) Seen anti-tobacco messages (in the last 30 days) 222 (72.8) 83 (27.2) Seen advertisements of tobacco products in newspapers or magazines (in the last 30 days) 173 (56.7) 132 (43.3) Discussed tobacco effects in the classroom 112 (36.7) 193 (63.3) Taught about tobacco effects in school 127 (41.6) 178 (58.4) Is it possible for you to buy tobacco products near your school 36 (11.8) 269 (88.2) Have something with a cigarette brand logo on it 27 (8.9) 278 (91.1) Following the intervention, negative attitudes toward tobacco products increased, as evidenced by greater recognition of the harms of secondhand smoke and stronger support for smoking bans. The proportion of participants who stated that they would accept a cigarette from a friend declined from 2.3% to 1.3%, while those who believed they would smoke in the next 12 months decreased from 2.3% to 1.6%. Similarly, the proportion of adolescents who thought they would be smoking in 5 years decreased from 5.2% to 2.0%. Recognition of the harmful effects of secondhand smoke increased from 77.7% to 87.9%, and support for banning smoking in enclosed public spaces rose from 57.4% to 63.6%. Meanwhile, perceptions regarding smoking’s impact on attractiveness remained largely unchanged. The overall attitude score showed an increase from 5.86 (SD = 0.95) to 6.12 (SD = 1.02). The paired t-test indicated a statistically significant improvement ( p d Table 4 Table 4. Comparison of attitude toward tobacco products before and after intervention. Statement Pre yes ( n Post yes ( n p A1. I might try a cigarette if a close friend of mine offers it to me  * 7 (2.3) 4 (1.3) 0.508 A2. I think I might smoke or try a cigarette in the next 12 months  * 7 (2.3) 5 (1.6) 0.774 A3. I feel there is a change that I might start smoking or still be smoking 5 years from now  * 16 (5.2) 6 (2.0) 0.048 A4. I believe it’s fine to smoke for a short time (like a year or two) as long as I can quit it later  * 127 (41.6) 116 (38.0) 0.037 A5. I think that even if I don’t smoke, breathing in smoke from others nearby is harmful to me 237 (77.7) 268 (87.9) 0.001 A6. I support rules that don’t allow smoking in closed public places like buses, restaurants, or halls 175(57.4) 194(63.6) 0.045 A7. I feel that smoking makes a person look less attractive 72 (23.6) 76 (24.9) 0.506 Overall score (Mean ± SD) 5.86 ± 0.95 6.12 ± 1.02 (Pre-test vs. post-test score) 0.001  a  b Cohen’s d 0.26 a The Paired t b The Wilcoxon signed-rank test after checking normality by Shapiro-Wilk test. * Items A1–A4 are reverse-coded (Yes=0, No=1), while A5–A7 are coded normally (Yes=1, No=0); higher scores indicate stronger anti-tobacco attitudes Discussion This study evaluated the effectiveness of a youth-led awareness initiative in shaping adolescents’ attitudes toward tobacco use in Budhanilkantha Municipality, Nepal. The findings indicate that peer-led educational interventions can contribute to a shift in adolescent perceptions regarding tobacco, particularly by increasing awareness of secondhand smoke risks and strengthening support for smoking bans. The study found that 18.7% of adolescents had used tobacco products, while 13.8% were actively smoking. These findings are comparable to those from previous studies conducted in Nepal. A study in Dharan, Nepal, reported that 19.7% of adolescents had used tobacco products,  24  25  26  13  27  28  29  30 The study also identified gaps in exposure to tobacco-related education and prevention efforts among Nepalese adolescents. While 72.8% of adolescents reported seeing anti-tobacco messages through mass media, only 41.6% had received formal education on the risks of tobacco use, and just 36.7% had discussed tobacco effects in classrooms. This limited exposure to structured tobacco education aligns with previous findings from Nepal, where only 12% of school personnel had received formal training to prevent youth tobacco use.  31  32 26 33 34 As per the fifth edition of the WHO global report on trends in prevalence of tobacco use 2000–2030, in SEA Region only India and Nepal are likely to achieve at least a 30% relative reduction in tobacco use by 2025, assuming they are able to continue implementing tobacco control measures.  10  16  17  35  16  18 The study demonstrated a statistically significant improvement in adolescents’ anti-tobacco attitudes following the intervention. The overall attitude score increased from 5.86 (SD = 0.95) pre-intervention to 6.12 (SD = 1.02) post-intervention, with a small but meaningful effect size (Cohen’s d 36 38  39  40  41 Strengths and limitations This study has several notable strengths. The findings suggest that youth-led, peer-driven interventions are an effective strategy for engaging adolescents in tobacco control efforts in Nepal. By positioning students as change agents within their schools and communities, this initiative demonstrated measurable improvements in knowledge and behavior. A key strength of this study is its co-designed, youth-led, peer-to-peer intervention model, which has been shown in other settings to improve both engagement and message retention among adolescents. Bias mitigation in this non-randomized intervention was achieved through a standardized, youth-led curriculum consistently delivered by trained facilitators across all schools. Furthermore, rigorous and uniform data collection procedures, employing piloted questionnaires at both pre- and post-intervention, minimized measurement bias. Additionally, the study utilized a pre-post design, enabling direct measurement of changes in knowledge and attitudes. The sample was drawn from multiple schools, enhancing contextual relevance and generalizability to similar urban school environments within Nepal. While this study provides valuable insights, several limitations should be acknowledged. First, the study employed a pre-post design without a control group. This decision was influenced by logistical and ethical constraints within the school setting, where withholding potentially beneficial educational content from certain students was not considered appropriate. These limitations restrict the strength of causal inferences, as the absence of a control group limits the ability to attribute observed changes in attitudes and susceptibility solely to the intervention. External factors such as concurrent health campaigns, media exposure, or parental influence may have also contributed to these changes. Future studies should consider employing controlled or randomized designs where feasible with longer follow-up periods to assess the sustained impact of youth-led interventions on both attitudes and behavioral outcomes. Second, the reliance on self-reported data may introduce recall bias and social desirability bias, where participants could have underreported tobacco use or overreported positive changes in attitudes due to perceived expectations. Third, the study was limited to a single municipality, potentially limiting representation of adolescents in rural or socio-economically diverse areas of Nepal. We did not conduct sensitivity analyses to compare these students with those who completed both assessments. While the small number is unlikely to have introduced significant bias, we acknowledge this as a limitation. Although advanced analytical methods such as repeated measures ANOVA are often recommended for studies with multiple time points, our study involved only two measurements and a single group, making such analyses unsuitable. Future research should explore longitudinal and geographically diverse designs to assess better whether attitude changes translate into sustained behavioral modification over time. Implications and recommendations The findings suggest that school-based, youth-focused interventions can play a role in improving adolescents’ attitudes toward tobacco in Nepal. While the intervention demonstrated a measurable impact in changing tobacco-related attitudes and susceptibility, a more comprehensive, multi-sectoral approach is essential for sustained behavioral change. This includes active engagement from schools, families, health systems, and policymakers. Strengthening life skills–based school curricula, enforcing school-level and national tobacco control policies, and incorporating community and parental education into adolescent-focused prevention strategies could further amplify the long-term effectiveness of such youth-driven initiatives. Scaling up similar awareness activities through integration with existing school health programs could strengthen tobacco prevention efforts. However, future studies should incorporate more rigorous evaluation methods, including randomized controlled trials, longer follow-up periods, and advanced analytical techniques to strengthen the evidence base and assess the sustainability of intervention effects. Conclusion This study highlights the potential of youth-led awareness initiatives in shaping adolescent attitudes toward tobacco use. While the intervention demonstrated measurable improvements in anti-tobacco perceptions, a multi-sectoral approach involving schools, families, and policymakers is essential for sustaining long-term reductions in adolescent tobacco susceptibility. Strengthening school curricula, enforcing tobacco control policies, and incorporating parental education into prevention strategies will be crucial in ensuring that tobacco prevention efforts yield lasting public health benefits. Supplemental Material sj-docx-1-phj-10.1177_22799036251380778 – Supplemental material for Effectiveness of Youth-Led awareness and advocacy intervention in shaping adolescents’ attitudes toward tobacco products in Nepal: A quasi-experimental study Supplemental material, sj-docx-1-phj-10.1177_22799036251380778 for Effectiveness of Youth-Led awareness and advocacy intervention in shaping adolescents’ attitudes toward tobacco products in Nepal: A quasi-experimental study by Sandeepa Karki, Dhurba Khatri, Shishir Paudel, Yamuna Chhetri, Ganesh Shetty, Prashant Khadka, Pratikshya Pandey and Bhagawan Koirala in Journal of Public Health Research We would like to express our heartfelt gratitude to all the schools, students, parents, and local representatives of Budhanilkantha Municipality for their generous cooperation and unwavering support throughout the course of this study. We are especially thankful to the peer leaders, whose dedication, enthusiasm, and commitment played a vital role in the successful implementation of the Youth for Tobacco Initiative. ORCID iDs: https://orcid.org/0000-0002-2076-5604 Dhurba Khatri https://orcid.org/0000-0001-5244-5536 Shishir Paudel https://orcid.org/0000-0003-3077-6697 Yamuna Chhetri https://orcid.org/0009-0005-5534-4876 Ganesh Shetty https://orcid.org/0009-0004-4267-2670 Prashant Khadka https://orcid.org/0009-0002-6515-6770 Pratikshya Pandey https://orcid.org/0009-0001-7622-1577 Author contributions: Funding: The authors declared no potential conflicts of interest with respect to the research, authorship, and/or publication of this article. Data availability statement: Supplemental material: References 1 World Health Organization Tobacco, newsroom, fact sheets https://www.who.int/news-room/fact-sheets/detail/tobacco 2023 accessed 4 July 2025 2 Reitsma MB Kendrick PJ Ababneh E et al Spatial, temporal, and demographic patterns in prevalence of smoking tobacco use and attributable disease burden in 204 countries and territories, 1990–2019: a systematic analysis from the Global Burden of Disease Study 2019 The Lancet 2021 397 2337 2360 10.1016/S0140-6736(21)01169-7 PMC8223261 34051883 3 Sharma T Khapre M. Exposure of second hand smoke in women and children: a narrative review J Fam Med Prim Care 2021 10 1804 1807 10.4103/jfmpc.jfmpc_1397_20 PMC8208198 34195106 4 Colyer-Patel K Kuhns L Weidema A et al Age-dependent effects of tobacco smoke and nicotine on cognition and the brain: a systematic review of the human and animal literature comparing adolescents and adults Neurosci Biobehav Rev 2023 146 105038 36627063 10.1016/j.neubiorev.2023.105038 5 World Health Organization Smoking still a core challenge for child and adolescent health reveals WHO report https://www.who.int/europe/news/item/05-06-2020-smoking-still-a-core-challenge-for-child-and-adolescent-health-reveals-who-report 2020 accessed 5 April 2025 6 Nazir MA Al-Ansari A Abbasi N et al Global prevalence of tobacco use in adolescents and its adverse oral health consequences Open Access Maced J Med Sci 2019 7 3659 3666 32010395 10.3889/oamjms.2019.542 PMC6986508 7 Gartner C Hall WD. Mixed progress in global tobacco control PLoS Med 2024 21 10.1371/journal.pmed.1004392 PMC11060751 38626200 8 Wang L Mamudu HM Collins C et al High prevalence of tobacco use and exposure to secondhand tobacco smoke among adolescents in low- and middle-income countries Ann Transl Med 2017 5 10.21037/atm.2017.03.37 PMC5440296 28567386 9 United States. Public Health Service Office of the Surgeon General, National Center for Chronic Disease Prevention, Health Promotion (US) https://www.ncbi.nlm.nih.gov/books/NBK99242/ 2012 accessed 23 April 2025 10 World Health Organization Tobacco control in South-East Asia region https://www.who.int/southeastasia/health-topics/tobacco/tobacco-control-in-the-south-east-asia-region 2025 accessed April 2025 11 Stone E Peters M. Young low and middle-income country (LMIC) smokers-implications for global tobacco control Transl Lung Cancer Res 2017 6 10.21037/tlcr.2017.10.11 PMC5750168 29299409 12 GBD 2015 Tobacco Collaborators Smoking prevalence and attributable disease burden in 195 countries and territories, 1990–2015: a systematic analysis from the Global Burden of Disease Study 2015 Lancet 2017 389 1885 1906 28390697 10.1016/S0140-6736(17)30819-X PMC5439023 13 World Health Organization Global youth tobacco survey 2011 https://extranet.who.int/ncdsmicrodata/index.php/catalog/234 2019 accessed April 2025 14 Shrestha N Mehata S Pradhan PMS et al A nationally representative study on socio-demographic and geographic correlates, and trends in tobacco use in Nepal Sci Rep 2019 9 2682 10.1038/s41598-019-39635-y PMC6389978 30804493 15 Australian Government, Department of Health. Disability and Ageing Effects of smoking and tobacco https://www.health.gov.au/topics/smoking-vaping-and-tobacco/about-smoking/effects 2025 accessed 5 April 2025 16 Shakya S Shrestha I Pradhan PMS Understanding the situation and effectiveness of adolescent focused tobacco control policies in Nepal: a qualitative study J Nepal Health Res Counc 2021 19 03 563 567 35140432 10.33314/jnhrc.v19i3.3643 17 Nepal Law Commission Tobacco Product (Control and Regulatory) Act, 2011 https://assets.tobaccocontrollaws.org/uploads/legislation/Nepal/Nepal-TP-Regs-2011.pdf 2012 accessed 4 April 2025 18 Bhakta K Oli LK Dahal N. Awareness and implementation status of tobacco policy provisions among students of public schools in Budhanilkantha Municipality, Nepal J Karnali Acad Health Sci 2020 3 41 46 19 Campbell R Starkey F Holliday J et al An informal school-based peer-led intervention for smoking prevention in adolescence (ASSIST): a cluster randomised trial The Lancet 2008 371 1595 1602 10.1016/S0140-6736(08)60692-3 PMC2387195 18468543 20 Dobbie F Purves R McKell J et al Implementation of a peer-led school based smoking prevention programme: a mixed methods process evaluation BMC Public Health 2019 19 742 31196124 10.1186/s12889-019-7112-7 PMC6567418 21 Tapera R Mbongwe B Mhaka-Mutepfa M et al The theory of planned behavior as a behavior change model for tobacco control strategies among adolescents in Botswana PLoS One 2020 15 10.1371/journal.pone.0233462 PMC7274417 32502211 22 Sussman S. Effects of sixty six adolescent tobacco use cessation trials and seventeen prospective studies of self-initiated quitting Tob Induc Dis 2002 1 35 81 19570247 10.1186/1617-9625-1-1-35 PMC2671530 23 World Health Organization Noncommunicable disease surveillance, monitoring and reporting, Global Youth Tobacco Survey https://www.who.int/teams/noncommunicable-diseases/surveillance/data 2020 accessed 25 April 2025 24 Pradhan PM Niraula SR Ghimire A et al Tobacco use and associated factors among adolescent students in Dharan, Eastern Nepal: a cross-sectional questionnaire survey BMJ Open 2013 3 10.1136/bmjopen-2012-002123 PMC3585970 23418297 25 Mandal AK. Tobacco consumption behavior and its associated factors among in-school adolescent students of Saptari, Nepal PLOS global public health 2025 5 10.1371/journal.pgph.0004139 PMC11698322 39752349 26 Bhaskar RK Sah MN Gaurav K et al Prevalence and correlates of tobacco use among adolescents in the schools of Kalaiya, Nepal: a cross-sectional questionnaire based study Tob Induc Dis 2016 14 1 11 27034647 10.1186/s12971-016-0075-x PMC4815189 27 The Tobacco Atlas Tobacco and the environment race, ethnicity and equity https://tobaccoatlas.org/factsheets/nepal/ 2024 accessed April 2025 28 Jaisoorya TS Beena KV Beena M et al Prevalence & correlates of tobacco use among adolescents in Kerala, India Indian J Med Res 2016 144 704 711 28361823 10.4103/ijmr.IJMR_1873_14 PMC5393081 29 Khan JR Raheem E Daniel M. The prevalence and correlates of tobacco use among 7-9th grade students in Bangladesh Child Youth Serv Rev 2019 104 104406 30 Raja B Devi VK. Prevalence of tobacco use among school-going adolescents in India: a systematic review of the literature Cancer Res Stat Treat 2018 1 110 31 Ministry of Health and Population Brief profile on tobacco control in Nepal https://extranet.who.int/fctcapps/sites/default/files/2023-09/nepal_2012_annex2_tobacco_profile.pdf accessed 2 April 2025 32 Tan Y-L Chen Z-Y He Y-P et al Awareness of tobacco control policies and anti-tobacco attitudes and behaviors among school personnel Tob Induc Dis 2022 20 10.18332/tid/149926 PMC9179323 35799622 33 Wang M Zhong JM Fang L et al Prevalence and associated factors of smoking in middle and high school students: a school-based cross-sectional study in Zhejiang Province, China BMJ Open 2016 6 10.1136/bmjopen-2015-010379 PMC4735178 26769793 34 Talip T Murang Z Kifli N et al Systematic review of smoking initiation among Asian adolescents, 20052015: utilizing the frameworks of triadic influence and planned behavior Asian Pac J Cancer Prev 2016 17 3341 3355 27509974 35 Poudel A Kaphle HP Poudel S et al Awareness and compliance with tobacco control policies among retailers near schools in Arghakhanchi, Nepal: a mixed-methods study PLOS Glob Public Health 2025 5 10.1371/journal.pgph.0004780 PMC12233269 40622968 36 Kim SY Jang M Yoo S et al School-based tobacco control and smoking in adolescents: evidence from multilevel analyses Int J Environ Res Public Health 2020 17 3422 32423028 10.3390/ijerph17103422 PMC7277168 37 Thomas RE McLellan J Perera R. Effectiveness of school-based smoking prevention curricula: systematic review and meta-analysis BMJ Open 2015 5 10.1136/bmjopen-2014-006976 PMC4360839 25757946 38 Flay BR. The promise of long-term effectiveness of school-based smoking prevention programs: a critical review of reviews Tob Induc Dis 2009 5 1 12 19323827 10.1186/1617-9625-5-7 PMC2669058 39 Khubchandani J Sharma M Huston D et al Tobacco use related attitudes and behaviors in Indian adolescents: association with school-based prevention education Health Promot Perspect 2017 7 128 133 28695100 10.15171/hpp.2017.24 PMC5497363 40 Rahayuwati L Castillo E Caragay R et al Determining the effects of a school-based intervention program on the knowledge, attitudes and behaviors on smoking of junior high school students in West Java Province, Indonesia Ilkogretim Online 2021 20 5 284 288 41 Tian B Qian L Zhang X. Effectiveness evaluation on school intervention activities about tobacco control activities in six cities Chin J Public Health 2006 22 1173 1175 ",
  "metadata": {
    "Title of this paper": "Effectiveness evaluation on school intervention activities about tobacco control activities in six cities",
    "Journal it was published in:": "Journal of Public Health Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484908/"
  }
}