{
  "title": "Paper_834",
  "abstract": "pmc Nutrients Nutrients 1692 nutrients nutrients Nutrients 2072-6643 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472623 PMC12472623.1 12472623 12472623 41010515 10.3390/nu17182991 nutrients-17-02991 1 Systematic Review Effectiveness of Vitamin D Supplementation on Biochemical, Clinical, and Inflammatory Parameters in Patients with Different Types of Diabetes: A Systematic Review and Meta-Analysis Bruna-Mejías Alejandro 1 Valdivia-Arroyo Rocío 2 https://orcid.org/0009-0000-7255-6831 Becerra-Rodríguez Emelyn Sofia 2 Clasing-Cárdenas Ignacio 2 Castaño-Gallego Yesica Tatiana 2 https://orcid.org/0000-0003-3953-2250 Granite Guinevere 3 https://orcid.org/0000-0002-1781-062X Orellana-Donoso Mathias 4 5 Oyanedel-Amaro Gustavo 6 Nova-Baeza Pablo 2 https://orcid.org/0000-0002-6497-3480 Cifuentes-Suazo Gloria 7 Suazo-Santibañez Alejandra 8 https://orcid.org/0000-0002-2599-8474 Sanchis-Gimeno Juan 9 https://orcid.org/0000-0002-4650-3426 Gutiérrez Espinoza Héctor 10 Valenzuela-Fuenzalida Juan José 2 11 * Hashimoto Yoshitaka Academic Editor 1 alejandro.bruna@upla.cl 2 rovaldiviaa04@gmail.com emelyn.becerra01@uceva.edu.co ignacio.clasing@gmail.com yesica.castano01@uceva.edu.co pablo.nova@gmail.com 3 guinevere.granite@usuhs.edu 4 mathor94@gmail.com 5 6 g.oyanedelamaro@gmail.com 7 gbcifuentess@gmail.com 8 alej.suazo@gmail.com 9 juan.sanchis@uv.es 10 hector.gutierrez@uautonoma.cl 11 * juan.kine.2015@gmail.com 18 9 2025 9 2025 17 18 497660 2991 30 7 2025 09 9 2025 10 9 2025 18 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background and Aims: Methods: Results: p p p Conclusions: vitamin D supplementation vitamin D diabetes mellitus type 1 diabetes type 2 This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Vitamin D is an essential nutrient primarily synthesized through exposure to sunlight, as natural dietary sources are limited [ 1 2 3 4 5 6 7 Diabetes mellitus (DM) is a metabolic disorder characterized by persistently elevated blood glucose levels. To understand this condition, it is essential to examine glucose metabolism and the role of insulin [ 7 8 9 9 10 Diabetes occurs either due to insufficient insulin production or reduced cellular responsiveness to insulin, resulting in persistent hyperglycemia [ 11 12 13 13 Vitamin D demonstrates potential therapeutic benefits, particularly in hereditary bone disorders, by enhancing calcitriol production, which promotes calcium and phosphate absorption [ 3 14 Vitamin D deficiency is defined as a serum concentration below 20 ng/mL, with levels under 12 ng/mL strongly associated with an elevated risk of osteometabolic disorders. Common contributing factors include inadequate sunlight exposure and poor dietary intake [ 14 2 Due to its endocrine role and metabolic significance, fluctuations in vitamin D levels can substantially influence overall health outcomes [ 9 11 13 14 Vitamin D supports immune regulation by modulating inflammatory mediators and enhancing insulin receptor (INS-R) expression, thereby improving insulin sensitivity—a benefit particularly relevant in prediabetic individuals [ 5 7 15 Given these findings, further investigation into the relationship between vitamin D and diabetes may provide valuable insights for developing targeted therapeutic strategies to manage this prevalent metabolic disorder. 2. Methods 2.1. Protocol and Registration This systematic review and meta-analysis followed the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) guidelines (see Supplementary Table S1 16 2.2. Search A comprehensive search was conducted across multiple electronic databases, including MEDLINE (via PubMed), EMBASE, Scopus, Cochrane Central Register of Controlled Trials, CINAHL, and Web of Science, covering all records up to February 2024. We included only randomized controlled clinical trials (RCTs) published in English or Spanish. The search terms included the following: “vitamin D supplementation” OR “Vitamin D” OR “Vitamin D supplement” OR Vitamin D supplements AND “diabetes” OR “impaired glucose tolerance” NOT “review” NOT “animals”. Two reviewers (RV & IC) independently screened titles and abstracts, retrieving full-text articles deemed relevant. Disagreements were resolved by a third reviewer (EB) (see Supplementary Table S2 2.3. Study Selection Eligible studies were RCTs involving participants with type 1 diabetes (T1DM) or type 2 diabetes (T2DM) who received varying doses of vitamin D supplementation. Studies evaluated biochemical, clinical, or inflammatory outcomes. Exclusions included letters, editorials, case reports, reviews, non-human studies, unrelated patient conditions, interventions unrelated to vitamin D, and trials without control groups (see Supplementary Table S3 2.4. Risk of Bias Assessment Two authors (AB & JJv-F) independently extracted data, including study characteristics (author, year, design), sample size, outcomes, dosage, administration methods, and geographic region. Risk of bias was assessed using the Cochrane Risk of Bias (RoB) tool [ 17 2.5. Data Synthesis and Statistical Analysis Primary outcomes were extracted and analyzed using standardized units and scales. Key variables included the following: Anthropometric and biochemical markers: BMI (kg/m 2 Inflammatory markers: Interleukin-6 (IL-6) and Interleukin-1β (pg/mL). Blood pressure: systolic and diastolic (mmHg). Biomarkers were interpreted against clinical reference ranges: BMI: underweight (<18.5), normal (18.5–24.9), overweight (25–29.9), obese (>30). LDL: <130 mg/dL (optimal), >190 mg/dL (high risk). HDL: >40 mg/dL (males), >45 mg/dL (females). Total cholesterol: <200 mg/dL; triglycerides: <150 mg/dL. Waist circumference: ≥102 cm (males), ≥88 cm (females). Body fat: 8.1–15.9% (males), 15.1–20.9% (females). Normal fasting glucose: <100 mg/dL. Effect sizes were calculated as mean differences (MD) and standardized mean differences (SMD) using Cohen’s d: trivial (<0.2), small (0.2–0.5), medium (0.6–0.8), large (>0.8). Pooled effect sizes with 95% confidence intervals (CI) were computed using the Mantel-Haenszel fixed-effect model, depending on heterogeneity. Heterogeneity ( I 2 2.6. Quality of Evidence The certainty of evidence for each outcome was assessed using the GRADE system, which categorizes evidence as being of high, moderate, low, or very low quality [ 18 Supplementary Table S3 3. Results 3.1. Study Selection The database search yielded 478 articles, of which 147 full-text studies were reviewed for eligibility. The selection process is illustrated in Figure 1 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 18 21 24 29 35 39 40 41 42 43 44 45 46 Supplementary Table S2 3.2. Study Characteristics A summary of the included studies is presented in Table 1 The combined sample across all studies included 14,831 participants, of whom 8196 were assigned to the vitamin D supplementation group and 6635 to comparison groups receiving alternative interventions. The mean age of participants across both groups was 50.89 years, with an average follow-up period of 17 months. For the meta-analysis, 13 of the 20 studies [ 18 21 24 29 35 39 40 41 42 43 44 45 46 nutrients-17-02991-t001_Table 1 Table 1 Characteristics of the included studies. Author Country Population Intervention Outcomes Follow-Up Results   Sample Size ( n Patients Type of Intervention Characteristics and Doses    Cojic et al., 2021 [ 20 Serbia CG: 65 ≥30 CG: Metformin CG: 65 patients with T2DM were given metformin alone as a control treatment. Vitamin D (nmol/L) 2 6 months 6 months p p p 2 p p p p p p p p p p p p p p p p p Boer et al., 2019 [ 21 USA CG: 320 67.6 CG: 2 Placebos CG: 320 patients with type 2 diabetes were given two inert placebos. Vitamin D 2 years and 9 months Vitamin D p p Byrn et al., 2022 [ 32 USA CG: 15 CG: 55.62 CG: Vitamin D3 supplement in a ten times lower dose CG: received a low-dose Vitamin D3 (Cholecalciferol) therapy of 5000 IU for 12 weeks Symbol-Digit Modality Z-score 3 months Symbol-Digit Modality Z-score p p p p p p p p p p p Huang et al., 2021 [ 17 China CG:70 CG: 31.3 ± 4.7 CG: placebo CG: placebo FBG (mmol/L) 6 weeks FBG (mmol/L) p p p p p p p p p Chou et al., 2021 [ 18 USA CG: 383 CG: 63.9 CG: Placebo CG: placebo Weight, mean (SD), kg 2 2 2 2 2 years Weight, mean (SD), kg p 2 p p p 2 p p 2 p p p 2 p p p Angellotti et al., 2019 [ 23 USA CG:61 average of 60 years CG: Placebo CG: they were given 1 placebo pill daily. Total cholesterol, mg/dL 48 weeks Total Cholesterol, mg/dL p p p p p p p Gnudi et al., 2023 [ 24 UK CG: 30 >40 years CG: placebo CG: they were given placebo LVMI (g/m 2 2 2 9 years LVMI (g/m 2 p p 2 p 2 p p Huang et al., 2013 [ 26 China 2708 48.5 ± 12.6 years Q1:677 The patients in the study were separated into quartiles based on lipoprotein lipase levels, obtaining Q1 (<532.8), Q2 (532.9−653.2), Q3 (653.3–778.6), Q4 (>778.6) 25(OH)D, ng/mL One shot 25(OH)D, ng/mL p p p p p p p p p p p p p Yin et al., 2024 [ 28 China CG: 771 28.5 years average CG: 400 IU/d vitamin D3 CG: serum 25(OH)D concentration <75 nmol/L at a dose of 400 IU/day HDLC, 2 months HDLC, p p p p p p p p p p p p p Rasouli et al., 2022 [ 29 USA CG: 886 60.5 ± 9.8 years CG: placebo equivalent CG: participants were asked to refrain from using specific diabetes or weight-loss medications during the study and to limit off-study vitamin D use to 1000 IU per day from all supplements, including multivitamins. Follow-up visits were carried out at months 12 and 24 CPI At the beginning, at month 12 and at month 24 BASELINE 0.64 Riek et al., 2018 [ 30 USA CG: 15 CG: 57.6 ± 1.9 CG: placebo Subjects were randomly assigned 1:1 to one of two groups: vitamin D3 4000 international units (IU) or matching placebo daily (supplied by Tishcon Corp.) for 4 months, with treatment allocation blinded to both investigators and participants. Both groups received calcium carbonate 500 mg twice daily. For safety reasons, patients BMI (kg/m 2 They were observed at 2 weeks, 1 month, 2 months, 3 months and 4 months. BMI (kg/m 2 Pittas et al., 2019 [ 31 USA CG: 1212 placebo  EG: 4000 IU of vitamin D3 Participants were asked to refrain from using specific diabetes or weight-loss medications during the trial and to limit their off-trial vitamin D use to 1000 IU per day from all supplements, including multivitamins. Participants were asked to limit calcium supplements to 600 mg per day. Participants were followed up for 4 years Fasting plasma glucose Month 3, month 6 and twice a year thereafter until year 4 Does not report Penckofer et al., 2022 [ 32 USA CG: 50.58 (11.13) EG: 50,000 IU of calciferol weekly A total of 119 women (57 at the lowest dose and 62 at the highest dose) received weekly oral vitamin D3 supplements (50,000 IU) or an active comparator (5000 IU) for 6 months. Vitamin D, 25-hydroxyvitamin D [25(OH)D] levels, and depression were measured at baseline, 3, and 6 months. Vitamin D laboratory values (ng/mL) Follow-up at 3 and 6 months. Women were contacted by telephone Laboratory values of serum vitamin D (ng/mL) 25 (OH) D: p Kawahara et al., 2022 [ 33 JAPAN CG: 626 61.3 years. EG: 75 μg of eldecalcitol Participants were randomly assigned to take a single hard gel tablet, once a day, containing 75 μg of eldecalcitol or a matching placebo, which has the same appearance Glycated hemoglobin Three-month intervals, Primary outcome ( p p Karonova et al., 2020 [ 34 RUSSIA GC: 34 Average age 56 (49; 61) GC: 5000 IU once a week Patients were randomly assigned by odd/even method into two cholecalciferol treatment groups: Group I ( n n 25(OH)D—25-hydroxyvitamin D 24 weeks HbA1c ( p p p Johny et al., 2022 [ 35 INDIA CG:placeBO 29 EG:Vitamin D3 30 CG: 55.06 ± 9.57 EG: 60,000 IU of cholecalciferol/week, control dose 60,000 IU/month The vitamin D3 group received 60,000 IU of cholecalciferol/week for the initial 3 months as a control dose, followed by 60,000 IU/month for 3 months as a maintenance dose. The placebo group received a matching placebo (consisting of powdered starch) similar to vitamin D HbA1c 6 months p Chao Gu et al., 2022 [ 36 China CG:92 Does not report CG: received regular treatment (type 2 diabetes group) Patients with type 2 diabetes were randomly assigned to receive an additional vitamin D supplement ( n n Vitamin D 90 days p Sadiya et al., 2015 [ 37 United Arab Emirates CG: 42 CG: 48 ± 8 CG: They received starch capsules It was divided into two phases of 3 months each. In phase 1, group D ( n n n n yeah 6 months Does not report Peivasteh Safarpour et al., 2020 [ 38 Iran CG: 43 CG: 50.05 ± (10.7) CG: or took similar pearls containing oral paraffin without VD 50,000 IU/week At baseline and endpoint, demographic, anthropometric, and dietary intake characteristics were determined using two 24 h food recalls (one weekend and one weekday). Physical activity was measured using a short version of the International Physical Activity Questionnaire (IPAQ). Sun exposure status was assessed using a valid questionnaire. Blood was drawn from the brachial vein at baseline and endpoint for measurement of serum factors Vitamin D (ng/mL) 8 weeks GL: Vitamin D (ng/mL) < 0.001 Xiaomi Sun et al., 2023 [ 39 China CG: 15 50.1 years ± 7.3 years  They received an exercise program and a daily dose of 1000 IU of vitamin D. They only performed the exercise program without vitamin D supplementation. They received a daily dose of 10,000 IU of vitamin D3. They received a placebo without exercise or vitamin D. This was a randomized controlled trial (RCT) with a 12-week intervention, followed by an additional 12-week follow-up period. In the 12-week intervention, participants in the intervention groups (EX + VD and VD) received vitamin D supplementation and/or exercise, while the control group received a placebo. After the intervention, follow-up was conducted to assess the persistence of the intervention’s effects on participants. This is important to understand whether the observed benefits are maintained over the long term table page 8 12 weeks Does not report Shih et al., 2014 [ 47 USA CG:12 <18 years old EG: Vitamin D3 for 6 months EG: therapy with 20,000 IU of Vitamin D3 per week for 6 months followed by 6 months of observation BMI (kg/m) + SD 6 months BMI (kg/m) + SD p p p p p p p p p p p p Corbin et al., 2023 [ 48 USA CG:1212 does not provide information CG: Placebo CG: 1 placebo pill per day 25-hydroxyvitamin D Level (ng/mL) 2.5 years 25-hydroxyvitamin D Level (ng/mL) p p p p El Hajj et al., 2020 [ 49 Lebanon CG:43 66.3 (±4.4) years CG: Placebo Pill CG: placebo pill three times a week for 6 months 25(OH)D (ng/mL) 2 6 months 25(OH)D (ng/mL) p 2 p p p p p p p p p p p p p Gulseth et al., 2017 [ 40 Norway CG: 25 average age 55.7 ± 9.5 CG: Placebo CG: they received a single dose of oral placebo HbA1c (%) 6 months HbA1c (%) p p p p p p p p p p p p p p p p p Joergensen et al., 2014 [ 41 Denmark CG:23 average age 57 years CG: Placebo capsule followed by paricalcitol capsule CG: they received a daily placebo capsule for an initial 12 weeks, followed by a daily paricalcitol capsule for the subsequent 12 weeks Plasma N 2 2 24 weeks Plasma N p p p p 2 p 2 p Limonte et al., 2021 [ 42 USA CG: 320 67.6 years average CG: Vitamin D3 placebo and n n n n CG: daily administration of placebos compatible with Vitamin D3 and placebo compatible with n n n n IL-6 (pg/mL) 5 years IL-6 (pg/mL) p p p Tabesh et al., 2014 [ 50 Iran CG: 30 >30 years CG: Vitamin D placebo and Calcium placebo CG: received separate placebos of calcium and vitamin D3 FPG (mmol/L) 8 weeks FPG (mmol/L) p p p p p p p p p p p p Upreti et al., 2018 [ 43 India CG:30 CG: 49.9 ± 6.9 CG: Placebo CG: oral placebo (microcrystalline Vitamin D (ng/mL) 6 months Vitamin D (ng/mL) p p p p p p p p p p Mager et al., 2016 [ 44 Canada Group 1: 60 From 18 to 80 years old. Group 1: Daily Vitamin D3 Group 1: daily dose of 2000 IU/D of vitamin D3 Hemoglobin Alc, 6 months Hemoglobin Alc, p p p p p p p p p p p p Ryu et al., 2014 [ 45 Korea CG:30 30 to 69 years old. CG: placebo CG: placebo containing 100 mg of elemental calcium twice daily HbA1c, % 24 weeks HbA1c, % p p p p p p p p p p p p p p p p p p CPI, C-peptide index; DI, disposition index using insulin-based indices; IGI, insulinogenic index; BMI: body mass index; CG: control group; EG: experimental group; EWL: excess weight loss; TWL: total weight loss; T2DM: type 2 diabetes mellitus; HbA1c, glycated hemoglobin; FI, fasting insulin; BMI, body mass index; toilet, waist circumference; HOMA-IR, Homeostatic Model Assessment of Insulin Resistance; FBG, fasting blood glucose; SBP, systolic blood pressure; DBP, diastolic blood pressure; MDA, malondialdehyde; AOPP, advanced oxidation protein products; CRP, C-reactive protein; TC, total cholesterol; TG, triglycerides; HDL, high-density lipoprotein; LDL, low-density lipoprotein; TBARS, thiobarbituric acid reactive substance; Ca, total calcium; Ca++, calcium ionized. FBG, fasting blood glucose; HOMA-β, homeostasis model assessment of beta cell; TG, triglyceride; LDL, low-density lipoprotein; HDL, high-density lipoprotein; VLDL, very-low-density lipoprotein. CVD risk: cardiovascular risk HbA1c, hemoglobin A1c; 25(OH)D, 25-hydroxy vitamin D; HDL-C, high-density lipoprotein cholesterol; LDL-C, low-density lipoprotein cholesterol; PTH, parathyroid hormone; hsCRP, high-sensitivity C-reactive protein; pSBP, brachial systolic blood pressure; pDBP, brachial diastolic blood pressure; cSBP, central systolic blood pressure; Aix, radial augmentation index; baPWV, brachial–ankle pulse wave velocity; OA, daytime outdoor physical activity. 3.3. Risk of Bias Assessment in Individual Studies The risk of bias assessment is illustrated in Figure 2 Figure 3 18 21 24 29 35 39 40 41 42 43 44 45 46 Allocation concealment: 61.5% of studies were assessed as low risk, while 38.5% were high risk [ 21 24 35 39 46 Blinding of participants and personnel: 69.27% were rated low risk, with 30.8% classified as high risk [ 39 40 45 46 Blinding of outcome assessment: 53.8% were low risk, and 46.26% were high risk [ 18 21 24 29 40 41 Incomplete outcome data: 53.8% were low risk, while 46.26% were high risk [ 21 29 40 41 42 44 Selective reporting: 61.57% of studies were classified as low risk, and 38.54% as high risk [ 18 41 42 43 44 Figure 2 Overview of bias risk [ 17 20 23 28 34 38 40 42 43 44 45 49 50 Figure 3 Diagram illustrating the risk of bias among the included studies. 3.4. Synthesis of Results The meta-analysis was performed using continuous variables in RevMan 5.4 (Cochrane Collaboration, London, UK). For each included study, group size (n), group means, and standard deviations (SDs) were entered. When SDs were not reported, they were estimated from confidence intervals using the formula: SD = √(n) × (maximum range − minimum IQ range)/3.92. The analysis applied the inverse variance method for continuous outcomes. A decrease in the measured parameter was interpreted as a positive effect, favoring the group with the largest reduction. 3.4.1. Body Mass Index (BMI) Vitamin D supplementation was compared with placebo regarding its effect on BMI. The pooled analysis of two studies showed no significant difference between groups (MD = −0.02; 95% CI: −4.93 to 4.89; p Figure 4 21 40 I 2 p Supplementary Table S4 Although BMI decreased slightly in participants receiving vitamin D supplementation, the reduction was not statistically significant ( p 3.4.2. Vitamin D Vitamin D supplementation was compared with placebo for its effect on serum vitamin D levels. The pooled analysis demonstrated a significant increase in vitamin D levels among participants receiving supplementation (MD = 35.80; 95% CI: 22.80 to 48.81; p Figure 5 21 40 I 2 p Supplementary Table S4 Although vitamin D levels significantly improved following supplementation, the high heterogeneity and low certainty of evidence warrant cautious interpretation of these findings. 3.4.3. Glycosylated Hemoglobin HbA1c% Vitamin D supplementation was compared with placebo to evaluate its effect on glycosylated hemoglobin (HbA1c%). Pooled analysis from nine studies demonstrated a significant reduction in HbA1c among participants receiving vitamin D (MD = −0.19; 95% CI: −0.31 to −0.07; p Figure 6 21 35 39 40 41 43 44 45 46 I 2 p Supplementary Table S4 These results indicate that vitamin D supplementation significantly reduces HbA1c%, reflecting an improvement in glycemic control that is clinically relevant for patients with diabetes. 3.4.4. 25-Hydroxyvitamin D 25(OH)D Vitamin D supplementation was compared with placebo to evaluate its effect on glycosylated hemoglobin (HbA1c%). Pooled analysis from nine studies demonstrated a significant reduction in HbA1c among participants receiving vitamin D (MD = −0.19; 95% CI: −0.31 to −0.07; p Figure 7 21 35 39 40 41 43 44 45 46 I 2 p Supplementary Table S4 These results indicate that vitamin D supplementation significantly reduces HbA1c%, reflecting an improvement in glycemic control that is clinically relevant for patients with diabetes. 3.4.5. Homeostasis Model of Assessment Estimated Insulin Resistance HOMA-IR Vitamin D supplementation was compared with placebo to evaluate its effect on insulin resistance measured by HOMA-IR. Pooled analysis from five studies demonstrated a significant reduction in HOMA-IR among participants receiving vitamin D (MD = −0.78; 95% CI: −1.37 to −1.18; p Figure 8 18 21 39 40 43 I 2 p Supplementary Table S4 These findings suggest that vitamin D supplementation may reduce insulin resistance in patients with diabetes, although the low certainty of evidence and observed heterogeneity warrant cautious interpretation. 3.4.6. Homeostasis Model Assessment of Beta Cell Function (HOMA-β) Vitamin D supplementation was compared with placebo to evaluate its effect on beta-cell function measured by HOMA-β. Pooled analysis from two studies showed no statistically significant difference between groups (MD = 5.83; 95% CI: −4.36 to 16.02; p Figure 9 18 43 I 2 p Supplementary Table S4 These results indicate that vitamin D supplementation does not produce a significant effect on beta-cell function in patients with diabetes. 3.4.7. HDL-Cholesterol (mg/dL) Vitamin D supplementation was compared with placebo to evaluate its effect on HDL-cholesterol levels. Pooled analysis from eight studies demonstrated a significant increase in HDL-cholesterol among participants receiving vitamin D (MD = 0.40; 95% CI: 0.25 to 0.56; p Figure 10 18 21 24 29 40 43 44 46 I 2 p Supplementary Table S4 These findings indicate that vitamin D supplementation significantly improves HDL-cholesterol compared to placebo in patients with diabetes despite the high heterogeneity and low certainty of the evidence. 3.4.8. LDL-Cholesterol (mg/dL) Vitamin D supplementation was compared with placebo to evaluate its effect on LDL-cholesterol levels. Pooled analysis from eight studies demonstrated a significant reduction in LDL among participants receiving vitamin D (MD = −0.40; 95% CI: −0.45 to −0.34; p Figure 11 18 21 24 29 40 43 44 46 I 2 p Supplementary Table S4 These results indicate that vitamin D supplementation significantly lowers LDL-cholesterol, which is clinically favorable for patients with diabetes. 3.4.9. Parathyroid Hormone (PTH) Vitamin D supplementation was compared with placebo to assess its effect on parathyroid hormone (PTH) levels. Pooled analysis from four studies showed no significant difference between groups (MD = −0.14; 95% CI: −2.14 to 1.86; p Figure 12 35 40 45 46 I 2 p Supplementary Table S4 Although PTH levels tended to decrease slightly in participants receiving vitamin D supplementation, this change was not statistically significant ( p 3.4.10. Calcium (Ca 2+ Vitamin D supplementation was compared with placebo to evaluate its effect on serum calcium (Ca 2+ p Figure 13 21 45 46 I 2 p Supplementary Table S4 Although calcium levels showed a slight decrease in the vitamin D supplementation group, this change was not statistically significant ( p 3.4.11. Total Cholesterol Vitamin D supplementation was compared with placebo to assess its effect on total cholesterol levels. Pooled analysis from nine studies showed a slight decrease in total cholesterol among participants receiving vitamin D (MD = −0.09; 95% CI: −0.94 to −0.75; p Figure 14 18 21 24 29 35 40 43 44 46 I 2 p Supplementary Table S4 Although total cholesterol decreased slightly in the vitamin D group, this change was not statistically significant ( p 3.4.12. Interleukin-6 (IL-6) Vitamin D supplementation was compared with placebo to evaluate its effect on interleukin-6 (IL-6) levels. Pooled analysis from three studies showed no significant difference between groups (MD = −0.37; 95% CI: −1.65 to 0.92; p Figure 15 29 35 42 I 2 p Supplementary Table S4 Although IL-6 levels tended to decrease slightly in participants receiving vitamin D supplementation, this change was not statistically significant ( p 3.4.13. Phosphorus Vitamin D supplementation was compared with placebo to evaluate its effect on serum phosphorus levels. Pooled analysis from two studies showed no significant difference between groups (MD = −0.12; 95% CI: −0.30 to 0.05; p Figure 16 45 46 I 2 p Supplementary Table S4 Although phosphorus levels tended to decrease slightly in participants receiving vitamin D supplementation, this change was not statistically significant ( p 3.4.14. Interleukin-1β (IL-1β) Vitamin D supplementation was compared with placebo to evaluate its effect on interleukin-1β (IL-1β) levels. Pooled analysis from two studies showed no significant difference between groups (MD = −0.00; 95% CI: −0.00 to 0.00; p Figure 17 29 35 I 2 p Supplementary Table S3 These results indicate that IL-1β levels did not differ significantly between participants receiving vitamin D supplementation and those receiving placebo ( p 3.4.15. Fasting Insulin Vitamin D supplementation was compared with placebo to evaluate its effect on fasting insulin levels. Pooled analysis from three studies demonstrated a significant reduction in fasting insulin among participants receiving vitamin D (MD = −4.16; 95% CI: −4.53 to −3.79; p Figure 18 18 21 41 I 2 p Supplementary Table S4 These findings indicate that fasting insulin levels significantly decreased in the vitamin D supplementation group, representing a clinically favorable change for patients with diabetes ( p 3.4.16. Triglycerides (TG) Vitamin D supplementation was compared with placebo to assess its effect on triglyceride levels (TG). Pooled analysis from eight studies demonstrated a significant reduction in triglycerides among participants receiving vitamin D (MD = −0.44; 95% CI: −0.87 to 0.00; p Figure 19 18 21 24 29 40 43 44 46 I 2 p Supplementary Table S4 These results indicate that triglyceride levels decreased significantly in the vitamin D supplementation group, representing a favorable effect for patients with diabetes ( p 3.4.17. C-Reactive Protein (CRP) Vitamin D supplementation was compared with placebo to assess its effect on C-reactive protein (CRP) levels. Pooled analysis from four studies indicated a decrease in CRP among participants receiving vitamin D (MD = −1.31; 95% CI: −2.66 to 0.05; p Figure 20 21 24 29 35 I 2 p Supplementary Table S4 Although CRP levels tended to decrease in the vitamin D supplementation group, this change was not statistically significant ( p 3.4.18. Fasting Plasma/Blood Glucose Vitamin D supplementation was compared with placebo to evaluate its effect on fasting plasma/blood glucose levels. Pooled analysis from six studies showed a reduction in fasting glucose among participants receiving vitamin D (MD = −0.55; 95% CI: −1.36 to 0.26; p Figure 21 18 21 40 43 44 46 I 2 p Supplementary Table S4 Although fasting plasma glucose tended to decrease in the vitamin D supplementation group, this change was not statistically significant ( p 3.4.19. Systolic Blood Pressure (BP) Vitamin D supplementation was compared with placebo to evaluate its effect on systolic blood pressure. Pooled analysis from five studies showed no significant difference between groups (b) ( Figure 22 21 29 40 44 46 I 2 p Supplementary Table S4 While systolic blood pressure tended to decrease slightly in the vitamin D group, this change was not statistically significant ( p 3.4.20. Diastolic Blood Pressure (BP) Vitamin D supplementation was compared with placebo to evaluate its effect on diastolic blood pressure. Pooled analysis from five studies indicated no significant difference between groups (MD = −0.18; 95% CI: −2.20 to 1.84; p Figure 23 21 29 40 44 46 I 2 p Supplementary Table S4 Although diastolic blood pressure tended to decrease slightly in the placebo group, this change was not statistically significant ( p 3.4.21. QUIKI (Quantitative Insulin Sensitivity Check Index) Vitamin D supplementation was compared with placebo to evaluate its effect on insulin sensitivity using the QUICKI index. Pooled analysis from two studies demonstrated a significant improvement in insulin sensitivity among participants receiving vitamin D (MD = 0.03; 95% CI: 0.02 to 0.03; p Figure 24 39 43 I 2 p Supplementary Table S4 These results indicate that the QUICKI scores significantly improved in the vitamin D supplementation group compared to placebo, reflecting enhanced insulin sensitivity ( p 3.5. Adverse Effects of Vitamin D Although vitamin D is essential for numerous physiological processes, it can also cause a range of adverse effects, from mild to severe. The most frequently reported side effects include nausea, vomiting from high-dose intake, abdominal discomfort, diarrhea, and general fatigue. While these effects are generally not severe enough to compromise hemodynamic stability, if left unaddressed, they can cause significant discomfort and potentially progress to a more symptomatic state. More serious complications include hypercalcemia, which occurs due to increased intestinal calcium absorption and simultaneous mobilization of calcium from bones, potentially elevating the risk of osteoporosis. Excess vitamin D intake can also lead to nephrocalcinosis and, if untreated, may progress to kidney failure. Additionally, high doses may result in cardiac arrhythmias, including monomorphic or polymorphic ventricular tachycardia and atrial fibrillation. When initiating supplementation, it is important to consider potential interactions with other medications. Careful monitoring of serum vitamin D levels and the patient’s overall health is critical, as proper supervision can prevent serious complications [ 13 15 18 21 25 27 3.6. Sensitivity Analysis An exclusion analysis was conducted to assess the impact of individual studies on the results. For HOMA-IR, removing the study by Huang et al., 2021 [ 17 Supplementary Figure S1 49 Supplementary Figure S2 44 Supplementary Figure S3 3.7. Meta-Regression Meta-regression analyses were conducted using moderators including age, vitamin D dose (mg), frequency of omega-3 supplementation per week, and total duration of vitamin D supplementation. Statistically significant associations were observed for several outcomes. For 25(OH)D levels, both dose (β = −0.02, 95% CI −0.02 to −0.01, p p p p p p p p Table 2 4. Discussion In this study, vitamin D supplementation was associated with significant improvements in several metabolic parameters. Notably, reductions were observed in BMI, an indicator of insulin resistance and diabetes; glycosylated hemoglobin (HbA1c%), which reflects average blood glucose levels over three months; HOMA-IR, a marker of insulin resistance; LDL cholesterol; total cholesterol; and triglycerides. These effects are consistent with vitamin D’s role in decreasing triglyceride synthesis, increasing HDL cholesterol, and reducing total cholesterol. Additionally, a reduction in IL-6, an inflammatory cytokine elevated in patients with excess visceral adiposity, was observed. This effect may be mediated through inhibition of the NF-κB pathway by vitamin D, contributing to reduced systemic inflammation. Collectively, the decrease in these parameters suggests a beneficial relationship between vitamin D supplementation, improved metabolic outcomes, and potentially reduced morbidity in patients with diabetes [ 50 51 52 53 54 55 Fasting insulin, C-reactive protein, and fasting glucose—typically elevated in diabetes—also showed decreases, likely reflecting vitamin D’s protective effects on pancreatic β cells. Minor reductions were observed for phosphorus, parathyroid hormone (PTH), and calcium (Ca 2+ In contrast, the placebo or non-vitamin D groups experienced declines in 25-hydroxyvitamin D levels, HOMA-β (a measure of β cell activity), HDL cholesterol, systolic and diastolic blood pressure, mean arterial pressure (MAP), and the QUIKI index. These changes underscore the importance of supplementation in maintaining metabolic homeostasis. Previous reviews provide additional context. Hartweg (2009) [ 56 36 26 18 57 58 59 Our findings align with these results: vitamin D supplementation decreased HbA1c, reflecting improved glycemic control, likely through direct effects on pancreatic β cells and modulation of intracellular calcium, which is critical for insulin secretion [ 60 Vitamin D has diverse extraskeletal effects. Its hormonal system, derived from 7-dehydrocholesterol, regulates bone and mineral metabolism, immune function, inflammation, blood pressure, and cellular proliferation and differentiation. Vitamin D enhances insulin secretion from pancreatic β cells, improves peripheral insulin sensitivity, and exerts anti-inflammatory and immunomodulatory effects. Both cholecalciferol (D3) and ergocalciferol (D2) are converted to the active form, 1,25-dihydroxyvitamin D, in the liver, kidneys, pancreas, and immune cells. Active vitamin D helps regulate calcium/phosphorus balance, inflammation, insulin resistance, and obesity. In individuals with T1D and T2D, 1,25(OH)2D interacts with β cell receptors, modulates the renin–angiotensin system, enhances insulin secretion via calcium channels, and increases insulin sensitivity through insulin receptor expression and PPAR-δ activation. Vitamin D also mitigates chronic inflammation by downregulating proinflammatory cytokines and promoting calbindin release, which protects against β cell apoptosis. Consequently, fasting plasma glucose decreased in patients receiving vitamin D supplementation. Supporting evidence includes the study of Holick et al. (2007) [ 61 High BMI is frequently associated with low serum 25(OH)D levels, potentially due to sequestration in adipose tissue [ 55 45 62 Vitamin D also regulates immune function, influencing monocytes, macrophages, dendritic cells, T cells, and B cells. It modulates genes involved in cell proliferation, differentiation, and apoptosis, potentially preventing β cell destruction and improving insulin production [ 56 5. Study Limitations This review has several limitations. Publication and authorship biases may have led to the omission of relevant studies. Search strategies may have affected study inclusion due to sensitivity and specificity limitations. Some studies were excluded because of inconsistent units, unclear dosing regimens (daily vs. weekly), or undefined follow-up durations, introducing potential reporting bias. Additionally, variability in supplementation doses, study populations, and outcome measures required grouping of values, which limited precision and may have influenced observed effects. This heterogeneity introduces bias and complicates standardization of dosing recommendations. 6. Conclusions Vitamin D supplementation positively affects multiple metabolic and inflammatory parameters in patients with diabetes and prediabetes. Supplementation was associated with significant reductions in HbA1c, HOMA-IR, HOMA-β, LDL cholesterol, total cholesterol, triglycerides, fasting insulin, fasting plasma glucose, and C-reactive protein, and it increased the likelihood of reversion to normoglycemia in prediabetic individuals. These findings support vitamin D’s role in modulating insulin secretion, insulin sensitivity, and systemic inflammation. Our meta-regression highlights that treatment dose and duration are key factors influencing outcomes, emphasizing the need for primary studies to define optimal dosing and supplementation periods. Although variability may be influenced by sun exposure, geographic location, genetics, or diet, the inclusion of high-quality trials and combined quantitative and qualitative analyses reinforces the robustness of our conclusions. Large, well-designed randomized trials are warranted to confirm these findings and establish optimal dosing strategies for specific populations. Acknowledgments We would like to thank the “Article Processing Payment Support Program 2025, General Directorate of Research, Universidad Playa Ancha, Chile” for the payment of open access. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/nu17182991/s1 17 49 44 Conflicts of Interest No conflicting relationship exists for any author. The authors have no financial or proprietary interest in a product, method, or material described. References 1. Biblioteca Nacional de Medicina Vitamina, D 2010 Available online: https://medlineplus.gov/spanish/vitamind.html (accessed on 2 March 2025) 2. Biblioteca Nacional de Medicina Deficiencia de Vitamina D 2017 Available online: https://medlineplus.gov/spanish/vitaminddeficiency.html (accessed on 2 March 2025) 3. Escrito por el Personal de Mayo Clinic Vitamina, D Available online: https://www.mayoclinic.org/es/drugs-supplements-vitamin-d/art-20363792 (accessed on 2 March 2025) 4. Boron W. Emile L. Fisiología Médica 3rd ed. Elsevier Barcelona, Spain 2017 5. Torres del Pliego E. Nogués Solán X. Cómo utilizar la vitamina D y qué dosis de suplementación sería la más idónea para tener el mejor balance eficacia/seguridad? Rev. Osteoporos Metab. Miner. 2014 6 1 4 Available online: https://scielo.isciii.es/scielo.php?script=sci_arttext&pid=S1889-836X2014000500001 (accessed on 2 March 2025) 10.4321/S1889-836X2014000500001 6. Nuszkiewicz J. Czuczejko J. Maruszak M. Pawłowska M. Woźniak A. Małkowski B. Szewczyk-Golec K. Parameters of Oxidative Stress, Vitamin D, Osteopontin, and Melatonin in Patients with Lip, Oral Cavity, and Pharyngeal Cancer Oxidative Med. Cell. Longev. 2021 2021 2364931 10.1155/2021/2364931 34721756 PMC8550860 7. Alshahrani F. Aljohani N. Vitamin D: Deficiency, sufficiency and toxicity Nutrients 2013 5 3605 3616 10.3390/nu5093605 24067388 PMC3798924 8. Sciacqua A. Perticone M. Grillo N. Falbo T. Bencardino G. Angotti E. Arturi F. Parlato G. Sesti G. Perticone F. Vitamin D and 1-hour post-load plasma glucose in hypertensive patients Cardiovasc. Diabetol. 2014 13 48 10.1186/1475-2840-13-48 24555478 PMC3931918 9. Bruna-Mejias A. San Martin J. Arciniegas-Diaz D. Meneses-Caroca T. Salamanca-Cerda A. Beas-Gambi A. Paola-Loaiza-Giraldo J. Ortiz-Ahumada C. Nova-Baeza P. Oyanedel-Amaro G. Comparison of the Mediterranean Diet and Other Therapeutic Strategies in Metabolic Syndrome: A Systematic Review and Meta-Analysis Int. J. Mol. Sci. 2025 26 5887 10.3390/ijms26125887 40565352 PMC12192665 10. Młynarska E. Czarnik W. Dzieża N. Jędraszak W. Majchrowicz G. Prusinowski F. Stabrawa M. Rysz J. Franczyk B. Type 2 Diabetes Mellitus: New Pathogenetic Mechanisms, Treatment and the Most Important Complications Int. J. Mol. Sci. 2025 26 1094 10.3390/ijms26031094 39940862 PMC11817707 11. American Diabetes Association Diagnosis and classification of diabetes mellitus Diabetes Care 2011 34 (Suppl. 1) S62 S69 10.2337/dc11-S062 21193628 PMC3006051 12. Kao K.T. Sabin M.A. Type 2 diabetes mellitus in children and adolescents Aust. Fam. Physician 2016 45 401 406 27622231 13. Zheng Y. Ley S.H. Hu F.B. Global aetiology and epidemiology of type 2 diabetes mellitus and its complications Nat. Rev. Endocrinol. 2018 14 88 98 10.1038/nrendo.2017.151 29219149 14. Stevens C.M. Weeks K. Jain S.K. Potential of Vitamin D and l-Cysteine Co-supplementation to Downregulate Mammalian Target of Rapamycin: A Novel Therapeutic Approach to Diabetes Metab. Syndr. Relat. Disord. 2025 23 13 22 10.1089/met.2024.0146 39279596 PMC12021770 15. Yu J. Sharma P. Girgis C.M. Gunton J.E. Vitamin D and Beta Cells in Type 1 Diabetes: A Systematic Review Int. J. Mol. Sci. 2022 23 14434 10.3390/ijms232214434 36430915 PMC9696701 16. Barcot O. Ivanda M. Buljan I. Pieper D. Puljak L. Enhanced access to recommendations from the Cochrane Handbook for improving authors’ judgments about risk of bias: A randomized controlled trial Res. Synth. Methods 2021 12 618 629 10.1002/jrsm.1499 34050603 17. Huang S. Fu J. Zhao R. Wang B. Zhang M. Li L. Shi C. The effect of combined supplementation with vitamin D and omega-3 fatty acids on blood glucose and blood lipid levels in patients with gestational diabetes Ann. Palliat. Med. 2021 10 5652 5658 10.21037/apm-21-1018 34107720 18. Chou S.H. Murata E.M. Yu C. Danik J. Kotler G. Cook N.R. Bubes V. Mora S. Chandler P.D. Tobias D.K. Effects of Vitamin D3 Supplementation on Body Composition in the VITamin D and OmegA-3 TriaL (VITAL) J. Clin. Endocrinol. Metab. 2021 106 1377 1388 10.1210/clinem/dgaa981 33513226 PMC8063236 19. Guyatt G. Oxman A.D. Akl E.A. Kunz R. Vist G. Brozek J. Norris S. Falck-Ytter Y. Glasziou P. DeBeer H. GRADE guidelines: 1. Introduction-GRADE evidence profiles and summary of findings tables J. Clin. Epidemiol. 2011 64 383 394 10.1016/j.jclinepi.2010.04.026 21195583 20. Cojic M. Kocic R. Klisic A. Kocic G. The Effects of Vitamin D Supplementation on Metabolic and Oxidative Stress Markers in Patients with Type 2 Diabetes: A 6-Month Follow Up Randomized Controlled Study Front. Endocrinol. 2021 12 610893 10.3389/fendo.2021.610893 34489860 PMC8417320 21. de Boer I.H. Zelnick L.R. Ruzinski J. Friedenberg G. Duszlak J. Bubes V.Y. Hoofnagle A.N. Thadhani R. Glynn R.J. Buring J.E. Effect of Vitamin D and Omega-3 Fatty Acid Supplementation on Kidney Function in Patients with Type 2 Diabetes: A Randomized Clinical Trial JAMA 2019 322 1899 1909 10.1001/jama.2019.17380 31703120 PMC6865245 22. Byrn M.A. Adams W. Penckofer S. Emanuele M.A. Vitamin D Supplementation and Cognition in People with Type 2 Diabetes: A Randomized Control Trial J. Diabetes Res. 2019 2019 5696391 10.1155/2019/5696391 31781666 PMC6875298 23. Angellotti E. D’ALessio D. Dawson-Hughes B. Chu Y. Nelson J. Hu P. Cohen R.M. Pittas A.G. Effect of vitamin D supplementation on cardiovascular risk in type 2 diabetes Clin. Nutr. 2019 38 2449 2453 10.1016/j.clnu.2018.10.003 30352748 PMC6456440 24. Gnudi L. Fountoulakis N. Panagiotou A. Corcillo A. Maltese G. Rife M.F. Ntalas I. Franks R. Chiribiri A. Ayis S. Effect of active vitamin-D on left ventricular mass index: Results of a randomized controlled trial in type 2 diabetes and chronic kidney disease Am. Heart J. 2023 261 1 9 10.1016/j.ahj.2023.03.003 36934979 25. Best C.M. Zelnick L.R. E Thummel K. Hsu S. Limonte C. Thadhani R. Sesso H.D. E Manson J. E Buring J. Mora S. Serum Vitamin D: Correlates of Baseline Concentration and Response to Supplementation in VITAL-DKD J. Clin. Endocrinol. Metab. 2022 107 525 537 10.1210/clinem/dgab693 34543425 PMC8764322 26. Huang Y. Li X. Wang M. Ning H. A L. Li Y. Sun C. Lipoprotein lipase links vitamin D, insulin resistance, and type 2 diabetes: A cross-sectional epidemiological study Cardiovasc. Diabetol. 2013 12 17 10.1186/1475-2840-12-17 23320821 PMC3570389 27. Mahmoodi M.R. Najafipour H. Associations between serum vitamin D3, atherogenic indices of plasma and cardiometabolic biomarkers among patients with diabetes in the KERCADR study BMC Endocr. Disord. 2022 22 126 10.1186/s12902-022-01043-1 35549686 PMC9103410 28. Yin W.-J. Wang P. Ma S.-S. Tao R.-X. Hu H.-L. Jiang X.-M. Zhang Y. Tao F.-B. Zhu P. Vitamin D supplementation for cardiometabolic risk markers in pregnant women based on the gestational diabetes mellitus or obesity status: A randomized clinical trial Eur. J. Nutr. 2024 63 2599 2609 10.1007/s00394-024-03443-6 38878202 29. Rasouli N. Brodsky I.G. Chatterjee R. Kim S.H. E Pratley R. A Staten M. Pittas A.G. D2d Research Group. Effects of Vitamin D Supplementation on Insulin Sensitivity and Secretion in Prediabetes J. Clin. Endocrinol. Metab. 2022 107 230 240 10.1210/clinem/dgab649 34473295 PMC8684490 30. Riek A.E. Oh J. Darwech I. Worthy V. Lin X. Ostlund R.E. Zhang R.M. Bernal-Mizrachi C. Vitamin D3 supplementation decreases a unique circulating monocyte cholesterol pool in patients with type 2 diabetes J. Steroid Biochem. Mol. Biol. 2018 177 187 192 10.1016/j.jsbmb.2017.09.011 28941998 PMC5826751 31. Pittas A.G. Dawson-Hughes B. Sheehan P. Ware J.H. Knowler W.C. Aroda V.R. Brodsky I. Ceglia L. Chadha C. Chatterjee R. Vitamin D Supplementation and Prevention of Type 2 Diabetes N. Engl. J. Med. 2019 381 520 530 10.1056/NEJMoa1900906 31173679 PMC6993875 32. Penckofer S. Ridosh M. Adams W. Grzesiak M. Woo J. Byrn M. Kouba J. Sheean P. Kordish C. Durazo-Arvizu R. Vitamin D Supplementation for the Treatment of Depressive Symptoms in Women with Type 2 Diabetes: A Randomized Clinical Trial J. Diabetes Res. 2022 2022 4090807 10.1155/2022/4090807 35280228 PMC8913152 33. Kawahara T. Suzuki G. Mizuno S. Inazu T. Kasagi F. Kawahara C. Okada Y. Tanaka Y. Effect of active vitamin D treatment on development of type 2 diabetes: DPVD randomised controlled trial in Japanese population BMJ 2022 377 e066222 10.1136/bmj-2021-066222 35613725 PMC9131780 34. Karonova T. Stepanova A. Bystrova A. Jude E.B. High-Dose Vitamin D Supplementation Improves Microcirculation and Reduces Inflammation in Diabetic Neuropathy Patients Nutrients 2020 12 2518 10.3390/nu12092518 32825324 PMC7551635 35. Johny E. Jala A. Nath B. Alam J. Kuladhipati I. Das R. Borkar R.M. Adela R. Vitamin D Supplementation Modulates Platelet-Mediated Inflammation in Subjects with Type 2 Diabetes: A Randomized, Double-Blind, Placebo-Controlled Trial Front. Immunol. 2022 13 869591 10.3389/fimmu.2022.869591 35720377 PMC9205628 36. Gu J.C. Wu Y.G. Huang W.G. Fan X.J. Chen X.H. Zhou B. Lin Z.J. Feng X.L. Effect of vitamin D on oxidative stress and serum inflammatory factors in the patients with type 2 diabetes J. Clin. Lab. Anal. 2022 36 e24430 10.1002/jcla.24430 35403296 PMC9102501 37. Sadiya A. Ahmed S.M. Carlsson M. Tesfa Y. George M. Ali S.H. Siddieg H.H. Abusnana S. Vitamin D supplementation in obese type 2 diabetes subjects in Ajman, UAE: A randomized controlled double-blinded clinical trial Eur. J. Clin. Nutr. 2015 69 707 711 10.1038/ejcn.2014.251 25406966 PMC4458894 38. Safarpour P. Daneshi-Maskooni M. Vafa M. Nourbakhsh M. Janani L. Maddah M. Amiri F.-S. Mohammadi F. Sadeghi H. Vitamin D supplementation improves SIRT1, Irisin, and glucose indices in overweight or obese type 2 diabetic patients: A double-blind randomized placebo-controlled clinical trial BMC Fam. Pract. 2020 21 26 10.1186/s12875-020-1096-3 32033527 PMC7007689 39. Sun X. Yan T. Li Z. Zhou S. Peng W. Cui W. Xu J. Cao Z.-B. Shi L. Wang Y. Effects of Endurance Exercise and Vitamin D Supplementation on Insulin Resistance and Plasma Lipidome in Middle-Aged Adults with Type 2 Diabetes Nutrients 2023 15 3027 10.3390/nu15133027 37447353 PMC10346630 40. Gulseth H.L. Wium C. Angel K. Eriksen E.F. Birkeland K.I. Effects of Vitamin D Supplementation on Insulin Sensitivity and Insulin Secretion in Subjects with Type 2 Diabetes and Vitamin D Deficiency: A Randomized Controlled Trial Diabetes Care 2017 40 872 878 10.2337/dc16-2302 28468770 41. Joergensen C. Tarnow L. Goetze J.P. Rossing P. Vitamin D analogue therapy, cardiovascular risk and kidney function in people with Type 1 diabetes mellitus and diabetic nephropathy: A randomized trial Diabet. Med. 2015 32 374 381 10.1111/dme.12606 25307511 42. Limonte C.P. Zelnick L.R. Ruzinski J. Hoofnagle A.N. Thadhani R. Melamed M.L. Lee I.M. Buring J.E. Sesso H.D. Manson J.E. Effects of long-term vitamin D and n-3 fatty acid supplementation on inflammatory and cardiac biomarkers in patients with type 2 diabetes: Secondary analyses from a randomised controlled trial Diabetologia 2021 64 437 447 10.1007/s00125-020-05300-7 33098434 PMC7855668 43. Upreti V. Maitri V. Dhull P. Handa A. Prakash M. Behl A. Effect of oral vitamin D supplementation on glycemic control in patients with type 2 diabetes mellitus with coexisting hypovitaminosis D: A parellel group placebo controlled randomized controlled pilot study Diabetes Metab. Syndr. Clin. Res. Rev. 2018 12 509 512 10.1016/j.dsx.2018.03.008 29580871 44. Mager D.R. Jackson S.T. Hoffmann M.R. Jindal K. Senior P.A. Vitamin D3 supplementation, bone health and quality of life in adults with diabetes and chronic kidney disease: Results of an open label randomized clinical trial Clin. Nutr. 2017 36 686 696 10.1016/j.clnu.2016.05.012 27302208 45. Ryu O.-H. Chung W. Lee S. Hong K.-S. Choi M.-G. Yoo H.J. The effect of high-dose vitamin D supplementation on insulin resistance and arterial stiffness in patients with type 2 diabetes Korean J. Intern. Med. 2014 29 620 629 10.3904/kjim.2014.29.5.620 25228838 PMC4164726 46. Gasca F. Efecto de la Suplementación con Vitamina D en el Control Glucémico Y Factores de Riesgo en la Diabetes Tipo 2 Available online: https://amhigo.com/actualidades/ultimas-noticias/120-nutricion-y-ejercicio/2235-efecto-de-la-suplementacion-con-vitamina-d-en-el-control-glucemico-y-factores-de-riesgo-en-la-diabetes-tipo-2 (accessed on 6 April 2025) 47. Shih E.M. Mittelman S. Pitukcheewanont P. Azen C.G. Monzavi R. Effects of vitamin D repletion on glycemic control and inflammatory cytokines in adolescents with type 1 diabetes Pediatr. Diabetes 2016 17 36 43 10.1111/pedi.12238 25524404 48. Corbin K.D. Pittas A.G. Desouza C. Grdinovac K.K. Herzig K.-H. Kashyap S.R. Kim S.H. Nelson J. Rasouli N. Vickery E.M. Indices of hepatic steatosis and fibrosis in prediabetes and association with diabetes development in the vitamin D and type 2 diabetes study J. Diabetes Complicat. 2023 37 108475 10.1016/j.jdiacomp.2023.108475 37104979 PMC10683797 49. El Hajj C. Walrand S. Helou M. Yammine K. Effect of Vitamin D Supplementation on Inflammatory Markers in Non-Obese Lebanese Patients with Type 2 Diabetes: A Randomized Controlled Trial Nutrients 2020 12 2033 10.3390/nu12072033 32659891 PMC7400886 50. Azadbakht L. Faghihimani E. Tabesh M. Esmaillzadeh A. Effects of calcium-vitamin D co-supplementation on metabolic profiles in vitamin D insufficient people with type 2 diabetes: A randomised controlled clinical trial Diabetologia 2014 57 2038 2047 10.1007/s00125-014-3313-x 25005333 51. Jódar-Gimeno E. Muñoz-Torres M. Sistema hormonal D y diabetes mellitus: Lecciones de los activadores selectivos del receptor de vitamina D [Vitamin D hormone system and diabetes mellitus: Lessons from selective activators of vitamin D receptor and diabetes mellitus] Endocrinol. Nutr. 2013 60 87 95 (In Spanish) 10.1016/j.endonu.2012.04.005 22763025 52. Despaigne O.L.P. Despaigne M.S.P. Cascaret A.R. Barros R.M.N. Mena M.A.D. Hemoglobina glucosilada en pacientes con diabetes mellitus Medisan 2015 19 555 561 Available online: https://medisan.sld.cu/index.php/san/article/view/271 (accessed on 6 April 2025) 53. Zago L. Zugasti B. Fernández J. Zuleta A. de la Plaza M. Vitamina D en la Prevención Y Evolución de la Diabetes Mellitus ActNut 2023 24 103 110 Available online: https://fi-admin.bvsalud.org/document/view/8w5wj (accessed on 9 September 2025) 10.48061/SAN.2022.24.3.205 54. Wiedemann T.G. Jin H.W. Gallagher B. Witek L. Miron R.J. Talib H.S. Vitamin D Screening and Supplementation-A Novel Approach to Higher Success: An Update and Review of the Current Literature J. Biomed. Mater. Res. B Appl. Biomater. 2025 113 e35558 10.1002/jbm.b.35558 39976133 55. Takiishi T. Gysemans C. Bouillon R. Mathieu C. Vitamin D and diabetes Endocrinol. Metab. Clin. N. Am. 2010 39 419 446 10.1016/j.ecl.2010.02.013 20511061 56. Hartweg J. Farmer A.J. Holman R.R. Neil A. Potential impact of omega-3 treatment on cardiovascular disease in type 2 diabetes Curr. Opin. Lipidol. 2009 20 30 38 10.1097/MOL.0b013e328321b3be 19133409 57. Barbarawi M. Zayed Y. Barbarawi O. Bala A. Alabdouh A. Gakhal I. Rizk F. Alkasasbeh M. Bachuwa G. Manson J.E. Effect of Vitamin D Supplementation on the Incidence of Diabetes Mellitus J. Clin. Endocrinol. Metab. 2020 105 dgaa335 10.1210/clinem/dgaa335 32491181 58. Chewcharat A. Chewcharat P. Rutirapong A. Papatheodorou S. The effects of omega-3 fatty acids on diabetic nephropathy: A meta-analysis of randomized controlled trials PLoS ONE 2020 15 e0228315 10.1371/journal.pone.0228315 32045421 PMC7012392 59. Putranto R. Harimurti K. Setiati S. Safitri E.D. Saldi S.R.F. Subekti I. Nasrun M.W.S. Shatri H. The Effect of Vitamin D Supplementation on Symptoms of Depression in Patients with Type 2 Diabetes Mellitus: A Systematic Review and Meta-Analysis of Randomized Controlled Trials Acta. Med. Indones. 2022 54 574 584 36624711 60. Calmarza P. Pérez Ajami R.I. Prieto López C. Berrozpe-Villabona C. Pérez Ajami D.T. Molina Botella M.I. Francés G.M.L. Paris A.S. Vitamin D concentration in type 1 diabetic children. Association with glycemic control, lipidic and bone metabolism Nutr. Hosp. 2022 39 997 1003 Available online: https://zaguan.unizar.es/record/119881?ln=e (accessed on 9 September 2025) 10.20960/nh.04040 36134589 61. Holick M.F. Vitamin D deficiency N. Engl. J. Med. 2007 357 266 281 10.1056/NEJMra070553 17634462 62. Pérez-Bravo F. Duarte L. Arredondo-Olguín M. Iñiguez G. Castillo-Valenzuela O. Vitamin D status and obesity in children from Chile Eur. J. Clin. Nutr. 2022 76 899 901 10.1038/s41430-021-01043-9 34773092 PMC9187513 Figure 1 Diagram of the search workflow. Figure 4 Forest plot for outcome BMI in patients treated with vitamin D versus other treatments [ 20 49 Figure 5 Forest plot for outcome vitamin D in patients treated with vitamin D versus other treatments [ 20 38 43 Figure 6 Forest plot for outcome glycosylated hemoglobin (HbA1c%) in patients treated with vitamin D versus other treatments [ 20 34 38 40 43 44 45 49 50 Figure 7 Forest plot for outcome 25-Hidroxivitamin D25(OH)D in patients treated with vitamin D versus other treatments [ 34 45 49 Figure 8 Forest plot for outcome HOMA-IR in patients treated with vitamin D versus other treatments according to Sin Huang [ 17 20 38 49 50 Figure 9 Forest plot for outcome HOMA-ꞵ in patients treated with vitamin D versus other treatments [ 17 50 Figure 10 Forest plot for outcome HDL-cholesterol (mg/dL) in patients treated with vitamin D versus other treatments [ 17 20 23 28 43 45 49 50 Figure 11 Forest plot for outcome LDL-cholesterol (mg/dL) in patients treated with vitamin D versus other treatments [ 17 20 23 28 43 45 49 50 Figure 12 Forest plot for outcome PTH in patients treated with vitamin D versus other treatments [ 34 44 45 49 Figure 13 Forest plot for outcome calcium in patients treated with vitamin D versus other treatments [ 20 44 45 Figure 14 Forest plot for outcome total cholesterol in patients treated with vitamin D versus other treatments [ 17 20 23 28 34 43 45 49 50 Figure 15 Forest plot for outcome IL-6 in patients treated with vitamin D versus other treatments [ 28 34 42 Figure 16 Forest plot for outcome phosphorus in patients treated with vitamin D versus other treatments [ 44 45 Figure 17 Forest plot for outcome IL-1B in patients treated with vitamin D versus other treatments [ 28 34 Figure 18 Forest plot for outcome fasting insulin in patients treated with vitamin D versus other treatments [ 17 20 40 Figure 19 Forest plot for outcome triglycerides in patients treated with vitamin D versus other treatments [ 17 20 23 28 43 45 49 50 Figure 20 Forest plot for outcome C-reactive protein in patients treated with vitamin D versus other treatments [ 20 23 28 34 Figure 21 Forest plot for outcome fasting plasma/blood glucose in patients treated with vitamin D versus other treatments [ 17 20 43 45 49 50 Figure 22 Forest plot for outcome systolic BP in patients treated with vitamin D versus another treatments [ 20 28 43 45 49 Figure 23 Forest plot for outcome diastolic BP in patients treated with vitamin D versus other treatments [ 20 28 43 45 49 Figure 24 Forest plot for outcome QUIKI (Quantitative Insulin Sensitivity Check Index) in patients treated with vitamin D versus another treatments [ 38 50 nutrients-17-02991-t002_Table 2 Table 2 Meta Regression. Outcome Moderator B 95% LLCI 95% ULCI p HDL Age 0.04 −0.08 0.16 0.48384 HDL Dose (mg) −0.15 −0.47 0.18 0.38439 HDL Treatment weeks 0.04 −0.09 0.17 0.56768 HDL Dose frequency per week −0.27 −0.59 0.06 0.10899 LDL Age 0.04 −0.08 0.16 0.48384 LDL Dose (mg) −0.15 −0.47 0.18 0.38439 LDL Treatment weeks 0.04 −0.09 0.17 0.56768 LDL Dose frequency per week −0.27 −0.59 0.06 0.10899 Cholesterol Age 0.13 −0.05 0.31 0.15484 Cholesterol Dose (mg) −0.34 −0.7 0.03 0.07351 Cholesterol Treatment weeks 0.13 −0.04 0.31 0.14254 Cholesterol Dose frequency per week −0.24 −0.83 0.35 0.42467 Triglycerides Age −0.19 −0.91 0.53 0.60387 Triglycerides Dose (mg) −0.09 −2.09 1.9 0.92790 Triglycerides Treatment weeks 0.29 −0.43 1.01 0.43522 Triglycerides Dose frequency per week 0.67 −1.29 2.64 0.50090 25(OH)D Age −0.01 −0.03 0.02 0.70183 25(OH)D Dose (mg) −0.02 −0.02 −0.01 0.00166 25(OH)D Treatment weeks 0.01 0 0.01 0.00321 25(OH)D Dose frequency per week 0.01 −0.02 0.03 0.66830 HOMA-IR Age 0.41 −0.01 0.83 0.05565 HOMA-IR Dose (mg) −0.21 −0.72 0.29 0.40873 HOMA-IR Treatment weeks 0.01 −0.14 0.16 0.90321 HOMA-IR Dose frequency per week −0.56 −0.94 −0.19 0.00335 Calcium Age 0.01 −0.01 0.02 0.42613 Calcium Dose (mg) −0.01 −0.03 0.01 0.31830 Calcium Treatment weeks 0 0 0.01 0.31830 Calcium Dose frequency per week 0 −0.03 0.02 0.76253 Diastolic BP Age 0.03 −0.19 0.26 0.78868 Diastolic BP Dose (mg) −0.25 −1.16 0.67 0.59782 Diastolic BP Treatment weeks 0 −0.4 0.4 0.99069 Diastolic BP Dose frequency per week 0.19 −0.54 0.91 0.61071 Systolic BP Age 0.04 −0.14 0.22 0.69207 Systolic BP Dose (mg) −0.6 −1.65 0.46 0.26602 Systolic BP Treatment weeks 0.1 −0.23 0.43 0.54804 Systolic BP Dose frequency per week −0.01 −0.71 0.7 0.98728 IL-6 Age −0.03 −0.14 0.08 0.56078 IL-6 Dose (mg) −2.02 −4.51 0.47 0.11225 IL-6 Dose frequency per week 0.27 −0.23 0.77 0.29067 Level VD Age 0.96 −1.4 3.33 0.42301 Level VD Dose (mg) 1.73 −2.17 5.62 0.38471 Level VD Treatment weeks 1.05 0.68 1.42 0.00000 Level VD Dose frequency per week 2.2 −2.47 6.87 0.35614 PTH Age 0.11 −0.74 0.97 0.79645 PTH Dose (mg) −3.3 −13.18 6.58 0.51246 PTH Dose frequency per week 0.2 −0.61 1 0.62987 C-reactive Protein Age −0.07 −0.29 0.15 0.54776 C-reactive Protein Dose (mg) −0.61 −0.71 −0.52 0.00000 C-reactive Protein Treatment weeks 0.07 −0.11 0.24 0.44845 C-reactive Protein Dose frequency per week −0.41 −1.53 0.7 0.46732 Fasting Insulin Age 0.05 −0.21 0.3 0.72676 Fasting Insulin Dose (mg) −0.28 −1.68 1.13 0.69917 Fasting Insulin Treatment weeks 0 −0.66 0.66 0.99293 Fasting Insulin Dose frequency per week 0.07 −1.34 1.47 0.92545 Fasting plasma blood glucose Age 0.03 0.03 0.04 0.00000 Fasting plasma blood glucose Dose (mg) −0.08 −0.15 0 0.03875 Fasting plasma blood glucose Treatment weeks −0.03 −0.12 0.05 0.42847 Fasting plasma blood glucose Dose frequency per week −0.1 −0.15 −0.06 0.00000 Glycosylated hemoglobin Age 0.01 −0.02 0.04 0.39986 Glycosylated hemoglobin Dose (mg) −0.01 −0.06 0.04 0.68259 Glycosylated hemoglobin Treatment weeks 0.01 −0.01 0.03 0.41729 Glycosylated hemoglobin Dose frequency per week 0.03 0 0.06 0.05730 ",
  "metadata": {
    "Title of this paper": "Vitamin D status and obesity in children from Chile",
    "Journal it was published in:": "Nutrients",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472623/"
  }
}