{
  "title": "Paper_983",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470261 PMC12470261.1 12470261 12470261 41009821 10.3390/ijms26189259 ijms-26-09259 1 Article Towards Designing Green-Inspired Nano- and Microemulsions Alongside Novel Solvatochromic Probes as an Effective Tool in Delivery Issues https://orcid.org/0000-0002-0232-1196 Szarwaryn Aleksandra Methodology Software Writing – original draft Visualization Bartkowiak Wojciech Methodology Formal analysis Writing – review & editing Project administration Funding acquisition https://orcid.org/0000-0001-8243-9313 Olszewski Tomasz K. Methodology Software Resources Writing – original draft https://orcid.org/0000-0002-7309-3696 Bazylińska Urszula Conceptualization Methodology Software Resources Writing – original draft Writing – review & editing Supervision Project administration * Valente Artur Academic Editor Department of Physical and Quantum Chemistry, Faculty of Chemistry, Wroclaw University of Science and Technology, Wybrzeze Wyspianskiego 27, 50-370 Wroclaw, Poland; aleksandra.szarwaryn@pwr.edu.pl wojciech.bartkowiak@pwr.edu.pl tomasz.olszewski@pwr.edu.pl * urszula.bazylinska@pwr.edu.pl 22 9 2025 9 2025 26 18 497349 9259 17 7 2025 21 8 2025 23 8 2025 22 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ The extensive use of submicron emulsion systems, particularly those stabilized by nonionic surfactants, with their proven effectiveness and safety profile, provides a reassuring foundation for our research. Consequently, we designed and engineered new submicron emulsion formulations stabilized with a biocompatible surfactant polyoxyethylated cocoamine, whose nonionic character is due to a high degree of polyoxyethylation. We chose oleic acid as the oil phase, a fatty acid known for its beneficial properties. This led to novel biocompatible nanoemulsions with high stability and cosurfactant-free microemulsions. The dynamic light scattering studies confirmed that both formulations have a nanometric size and low polydispersity index values. Moreover, transmission electron microscopy verified the nanodroplets’ morphological homogeneity and spherical shape. The resulting nanoplatforms can be applied to carry bioactive agents in the pharmaceutical and cosmetic fields. For this reason, we solubilized newly synthesized 5-dimethylamino-5′-nitro-2,2′-bithiophene as a model hydrophobic cargo for delivering poorly water-soluble compounds. This dye was chosen due to its strong solvatochromic behavior and suitability for micropolarity analysis via UV–Vis spectroscopy. We also present a simple method for rapid micropolarity screening to assess the type of nanodispersion via solvatochromic shift as an alternative procedure for evaluating of the oils used to fabricate nanoformulations for pharmaceutical and cosmetic purposes. solvatochromism micropolarity 5-dimethylamino-5′-nitro-2,2′-bithiophene UV–Vis spectroscopy nanoemulsion microemulsion National Science Centre (Poland) within the framework of the SONATA BIS 13 program 2023/50/E/ST4/00603 This research was funded by the National Science Centre (Poland) within the framework of the SONATA BIS 13 program (grant number 2023/50/E/ST4/00603). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Over recent years, there has been a drive to modify processes for designing stable emulsion formulations as novel and effective nanocarriers while maintaining sustainability and being environmentally friendly. Consequently, the main challenge is to maintaining high dispersion stability, while minimize potentially toxic components, preferably by replacing them with “green” alternatives. The nanoemulsions (NEs) and the microemulsions (MEs), with their extensive applications in various fields, hold promising potential as nanocarriers of bioactive substances in controlled drug delivery of cosmetics and pharmaceuticals. Regardless of the administration route, their versatility has been particularly appreciated [ 1 2 3 4 5 6 7 3 8 9 Since the interactions between solute and solvent are complex and often difficult to quantify, an empirical approach is often used with a suitable molecular sensor probe. The solvatochromic dyes provide a better understanding of solvent phenomena at the microscale compared to determining large-scale parameters such as the dielectric constant or refractive index. Due to this, single-parameter polarity scales based on the dye’s solvatochromic properties are effectively used as empirical indicators of the local microenvironment and have gained tremendous popularity in the past few years. This approach was also implemented as a tool for determining the polarity of the nanocarrier microenvironment [ 10 11 In this manuscript, we present two biocompatible submicron emulsion dispersions: cosurfactant-free microemulsions and nanoemulsions obtained via self-assembly processes with enhanced stability. Both formulations were designed with the inspiration of green chemistry and according to sustainable development principles, alongside achieving low production costs and sustaining high stability. Their high safety might be profitably used in the cosmetic, pharmaceutical, nutriceutical, and nanomedicine fields, opening up new possibilities for product development. Moreover, we propose a novel procedure to optimize and distinguish preliminarily emulsion-type systems as well as to evaluate the polarity of oils and a newly synthesized solvatochromic probe—5-Dimethylamino-5′-nitro-2,2′-bithiophene (DNBT)— using UV–Vis spectroscopy. DNBT is a solvatochromic dye, the so-called Effenberger probe in the literature data [ 12 13 14 15 16 17 18 19 20 21 22 23 Figure 1 The proposed approach involves the use of solvatochromic effects for polarity profiling in the designed emulsion systems, which we believe is a significant advancement in the field. To the best of our knowledge, such a comparative analysis has not been reported before. From an application point of view, the environment evaluation inside the nanocarriers is essential. With the appropriate formulation design and selection of a suitable composition for the loaded cargo, the effectiveness and stability of their ingredients are simultaneously improved. Furthermore, the solubilization effects and micropolarity evaluations in NEs and MEs have never been compared to each other in a single study using the solvatochromic approach. There is also virtually no ongoing research regarding solvatochromism in nanoemulsions. Consequently, the choice of the solvatochromic probe is also not coincidental. It was selected from others according to the strong positive solvatochromic behavior it exhibits, along with the recognition of its lack of previous studies in more complex mixtures and microheterogenic systems. Therefore, we believe it provides a remarkable contribution to the field of supramolecular and colloidal chemistry. We also believe that the results and conclusions from this manuscript will provide a bridge to a deeper understanding of solubilization in the emulsion systems using molecular probes representing strong solvatochromic behavior. 2. Results and Discussion Researchers are often inconsistent in assessing the differences between nano- and microemulsions. Fortunately, some have investigated solutions to distinguish those formulations from each other simply. Anton and Vandamme [ 24 25 24 Thakore et al. [ 26 26 3 26 The appropriate choice of the used solvatochromic dye (DNBT) may also provide a preliminary indication of the type of formulation presented. In the case of the micro- and nanoemulsions’ coexistence, it may allow us to potentially differentiate between these systems and infer the sample’s homogeneity (if the size distribution is heterogeneous, the spectrum will be shifted). 2.1. Evaluation and Optimization of Pseudoternary Phase Diagrams The pseudoternary diagrams are used to monitor phase behavior and distinguish dispersion (microemulsion, nanoemulsion, and macroemulsion) from two-phase areas and to map the specific regions of a particular formulation type. The diagrams are presented as an equilateral triangle, where each vertex indicates 100% content of a given component. While moving away from the vertex, the percentage changes, allowing for precise identification of each ingredient’s proportion required to obtain the desired system [ 27 Following this, it is possible to quickly identify a ratio between the surfactant and oil phases that will be optimal for the application of particular interest. Not all oil phases are equally compatible with a given surfactant. Depending on the structure of the oil and the surfactant, there may be unfavorable interactions with the oil phase; consequently, these can lead to a significant reduction in the area appearance, characteristic of a given emulsion type in the phase diagram [ 28 29 Supplementary Materials Figure 2 30 2.2. Influence of the Composition on the Formulation Stability One of the most critical requirements for the applicability of any formulation is the maintenance of its stability over time. A significant change in the droplet size and ζ-potential during long-time storage can indicate unsatisfactory stability. For this reason, the influence of time on the formulation behavior is an essential parameter to evaluate its potential for subsequent applications. Generally, to evaluate the colloidal stability, samples are stored under controlled conditions for a certain period, and the physicochemical parameters are monitored again [ 31 H Differences in stability between the respective formulations were investigated. The stability process was evaluated by leaving the samples in a dark place at 25 °C. The behavior of micro- and nanoemulsion systems after preparation (t 0 32 Figure 3 Figure 3 32 Modifying the ratio of the surfactant to the oil phase makes it possible to adjust the formulation, consequently obtaining the desired parameter from the application point of view, e.g., the appropriate size. There is also a discernible trend that as the proportion of the oil phase to surfactant increases, the size of the droplet increases too. In the case of nanoemulsions, the smallest droplet size is characterized by dispersions with lower oil in proportion to the surfactant ratio. This correlation is less prominent in the case of microemulsions since all obtained formulations are characterized by relatively small droplet sizes (D H 1 3 On the other hand, no significant changes in the ζ-potential during the formulation storage are observed; therefore, it can be considered that the colloidal stability is potentially not affected since monitoring charge changes on the nanocarrier surface is also a key parameter for determining its stability [ 1 7 7 33 Figure 3 Supplementary Materials 2.3. Physicochemical Characteristics of Micro- and Nanoemulsion Systems with the Solubilized DNBT Probe The bioactive agents of low water solubility generally do not show long-term stability after entering the body. Hence, various types of nanocarriers are applied to improve the bioactives’ solubility and avoid their possible degradation, protecting them from negative environmental impact. The solubilization of the hydrophobic cargo in a nanocarrier also enhances its bioavailability, which is crucial from the perspective of versatile use in nutriceutical, cosmetic, pharmaceutical, and even biomedicine applications [ 34 Emulsion systems—as more advanced micellar formulations with distinctive structures—are well-suited for the solubilization of hydrophobic molecules due to the addition of oil, which usually localizes in the surfactant-surrounded core of the nanocarrier. Thus, it is assumed that the cargo solubilization occurs particularly in the micellar aggregate core. However, the oil molecules can adopt different positions in this surfactant aggregate, thereby influencing the nanocarrier’s interior environment (see the Section 2.4.2 35 The loaded nano- and microemulsions were prepared following the ultrasonically supported solubilization of the solvatochromic probe (DNBT) in the formed nanocarriers (the detailed compositions are shown in Figure 4 Figure 5 36 37 38 35 39 Stratum corneum 40 Since the transmission electron microscope (TEM) is a widely used technique for imaging the morphology of nanoemulsions [ 41 Figure 5 Supplementary Materials Figure S1A,B The selection of an appropriate surfactant and its optimal ratio compared to the other components of the composition are crucial to maintaining the stability and morphology of the system. The chosen proportions of the formulation indicate that POE (15) cocoamine is very effective in the stabilization of micro- and nanoemulsion systems because, despite the drying of the samples, the images show a classic morphology for this type of structure. Due to the relatively small size of microemulsions (5–6 nm), the resolution of TEM images was affected. The TEM images (see Figure 4 Figure S2A,B Figure S2B 2.4. Monitoring Local Micropolarity 2.4.1. Comparison of the Model Dye UV–Vis Spectra in Pure Solvents The classic approach for solvatochromism studies is the comparative method, in which solutions of a solvatochromic probe are prepared in several pure solvents characterized by different polarities, and then UV–Vis spectra are measured. The polarity of the probe’s microenvironment can be assessed, indirectly demonstrating its preferential solvation in more complex mixtures such as binary or microheterogeneous systems [ 42 Consequently, the UV–Vis spectra of DNBT in different solvents are shown in Figure 6 Table S1 Supplementary Materials max 12 13 14 15 16 17 18 19 g e From the point of view of our investigation, the preliminary assessments of local micropolarity—based on the spectra of DNBT in pure solvents—have practical implications. The results of such analyses can be extrapolated to other microenvironments, providing a method to estimate the micropolarity inside specific types of nanocarriers indirectly. This awareness can guide the design and evaluation of the proposed formulations as potential nanocarriers in various applications. 2.4.2. Assessing Local Micropolarity Inside Various Formulations Considering the characteristic structure of o/w emulsion systems, the hydrophobic cargo is expected to be inside the core of the surfactant aggregate. However, depending on the chemical nature of the solute, the structure of the surfactant, and the oil’s nature, there are several alternative potential locations for the loaded bioactive agent. It can be found in the core, palisade layer, or even in the more outer regions, and sometimes extremely polar substances can be adsorbed at the surface [ 43 Figure 6 Micro- and nanoemulsions can potentially co-exist in a system composed of the same surfactant, oil, and water but with a different surfactant–oil ratio (SOR) and at the appropriate temperature state condition. In the case of microemulsion formation, it is essential to maintain the proper ratios of all system components to achieve thermodynamic equilibrium between them. It can be allowed by enough free energy in the system to promote the occurrence of the most stable emulsion type. However, not all surfactants will be able to form microemulsions, and often, the addition of a cosurfactant will be required. For this reason, more surfactants can form nanoemulsions than microemulsions [ 26 Figure 6 Table S1 Figure S3 Supplementary Materials Shifts in the UV–Vis spectra between the different micellar types were noted, as shown in Figure 7 Table S1 Supplementary Materials max max max max max Figure 1 max max max 44 45 The process parameters (homogenization time, cycle, amplitude, etc.) and formulation composition (type of surfactant, oil phase, and the ratio between components) can be readjusted to achieve the most desirable physicochemical characteristics for the target application of interest. Employing solvatochromic dyes to monitor the internal environment can also help optimize drug delivery systems for various applications. This approach can be applied in several ways—such as to monitor the microenvironment inside a variety of nanocarriers (for the evaluation of whether the interior of the nanoplatform is a suitable environment for solubilization of the chosen bioactive agent depending on its hydrophobicity); in addition, it can be used to assess the integrity and stability of nanocarriers by monitoring solvatochromic shifts (if some instability occurs, then the spectrum will be shifted towards more nonpolar solvents). Another appealing way to possibly apply a solvatochromic probe and UV–Vis spectroscopy is to potentially indirectly distinguish micro- and nanoemulsions from each other at the condition that both types of colloidal dispersions could be formed using the same surfactant and oil phase. That is due to solvatochromic probes being extremely sensitive to micropolarity changes [ 46 3. Materials and Methods 3.1. Materials The nonionic surfactant POE (15) cocoamine was purchased from PCC Chemax (Piedmont, CA, USA). The employed oil phase was oleic acid from POCH S.A. (Gliwice, Poland). Paraffin oil was obtained from Sigma Aldrich Chemical Company (Poznań, Poland), and Isostearyl palmitate, Isopropyl palmitate, Ethylhexyl palmitate, Coco caprylate/caprate, Diisopropyl sebacate were obtained from Stearinerie Dubois Fils (Ciron, France). The following solvents—DMF, DMSO, methanol, ethanol, DCM, acetone, THF, toluene—were obtained from POCH S.A. (Gliwice, Poland). Acetonitrile and hexane were provided by Sigma Aldrich (Poznań, Poland). Chloroform was purchased from Chempur (Piekary Śląskie, Poland). The water used for the experimental part was distilled and purified using a system HLP Smart Hydrolab (Labsystem S.C., Kraków, Poland). 3.2. Synthetic Procedure for 5-Dimethylamino-5′-Nitro-2,2′-Bithiophene (DNBT) The DNBT dye ( 4 Scheme 1 47 1 n 2 3 2 3 2 4 4 47 1 H 3 J J J J 47 1 H 3 Supplementary Materials Figure S4 3.3. Construction of Ternary Phase Diagrams For examination, the phase behavior of the system consisted of polyoxyethylene (15) cocoamine used as a surfactant (S), oleic acid applied as an oil phase (O), and distilled water (W), a pseudoternary diagram was constructed by an aqueous titration–ultrasound method. Water was added stepwise to the previously weighed surfactant–oil mixture (SOR ratios of 9:1, 8:2, 7:3, 6:4, 5:5, 4:6, 3:7, 2:8, and 1:9, respectively). The amount of aqueous phase introduced was adjusted to achieve a water concentration of 5% to 99% of the total volume at approximately 5% intervals. After each part, the samples were mixed and then placed in thermostated tubs at a constant temperature of 20 °C for 2 min to equilibrate. The phase boundaries correspond to identical distances between subsequent experimental observations on both sides of the phase boundary. Visual observations were conducted after each 5% addition of the aqueous phase to the oil–surfactant mixture and subsequent equilibration. Visual observations resulted in the following categories: (I) transparent—oil-in-water (o/w) microemulsion (ME); (II) translucent with a blue sheen—oil-in-water (o/w) nanoemulsion (NE); (III) milky or cloudy—emulsion (E); (IV) two separate phases (2Ph). 3.4. Solubilization of the DNBT in Nano- and Microemulsion Systems DNBT solubilization was performed by mixing the dye of 57.14 µg/mL concentration with the surfactant and the oil phases; then, water was added, and ultrasonic homogenization was performed. All the formulation compositions (ME or NE) were selected from the phase diagram regions and mixed by an ultrasound treatment using a tip sonicator (Hielscher Ultrasonics GmbH, Teltow, Germany) with an amplitude of 100% and a cycle of 0.6. Throughout the experiment, the sample was submerged in an ice bath to facilitate ultrasound emulsification while maintaining the processing temperature of 20 °C and minimizing the thermal effect. The procedures used for preparing empty base formulations according to the phase diagram have been disclosed in patents P.449470 (Bezkosurfaktantowe mikroemulsje oraz sposób ich wytwarzania/Surfactant-free microemulsions and preparation method thereof) [ 48 49 Supplementary Materials 50 51 52 3.5. Dynamic Light Scattering (DLS): Particle Size and Polydispersity Index The measurements of the average particle size (D H Supplementary Materials 53 54 55 56 57 58 Figures S5–S10 3.6. Electrophoretic Light Scattering (ELS): Zeta Potential The zeta (ζ) potential, was evaluated for the measurement of the nanodroplets’ charge using electrophoretic light scattering (ELS) by applying the Smoluchowski equation to the electrophoretic mobility. The ELS measurements were performed using a Malvern Zetasizer Pro (Blue) apparatus (Malvern Instruments, Worcestershire, UK). An average of three measurements, each with at least twenty runs, was provided for the findings. To verify the stability of the system, Z-Average, PdI, and ζ-potential measurements were conducted once more following an appropriate incubation period of 32 days at 25°C. 3.7. Shape and Morphology Determination The nano- and microemulsion structures and morphology were imaged using transmission electron microscopy (FEI Tecnai G2 XTWIN, Hillsboro, OR, USA). Before the imaging evaluation, a few drops of the non-diluted formulations were placed on a perforated carbon-film-coated copper grid and allowed to dry for about one hour at room temperature. Some of the samples were stained with 2% uranyl acetate before shooting. 3.8. UV–Vis Micropolarity Assessment The polarity in different environments was studied by measuring the UV–Vis spectra of the prepared samples containing the DNBT solubilized in micro- and nanoemulsion systems in quartz cuvettes with an optical path length of 1 cm, using a UV/Visible double-beam spectrophotometer (Halo DB-20S). The spectra of the samples were monitored over the influence of different compositions, different micellar systems (nano and microemulsions), and in comparison with pure solvents with various polarities. Considering the small size (and thus the relatively high transparency of the systems), the samples were not diluted before measurement to reduce the effect of compositional change on the properties of the systems. 4. Conclusions In the presented paper, the biocompatible submicron emulsion formulations with improved stability were revealed, i.e., the nanoemulsions with a high level of homogeneity as well as microemulsions that do not require the additional use of a cosurfactant. The compositions consist of oleic acid as a biocompatible oil phase, an aqueous phase, and a polyoxyethylated cocoamine as a potentially “green” emulsifier. The optimized procedure leads to a reduced cost of obtaining the product and, simultaneously, the potential toxicity of the system. The physicochemical properties (nanometric size, narrow size distribution, high ζ-potential values, and droplet homogeneity) of the proposed formulations predestine them as primary nanoplatforms for many applications. Moreover, we demonstrated a significant solvatochromic behavior of the newly synthesized dye (5-dimethylamino-5′-nitro-2,2′-bithiophene) to show the high solubilization efficiency of the obtained formulations and potentially offer appealing insights to infer differences between various types of micellar systems. For instance, it is also possible to indirectly evaluate the potential location of the applied hydrophobic agent and confirm that it is inside the nanoplatform. This is crucial since different bioactive substances have varying requirements for the micropolarity of the interior of the nanocarrier. By comparing the solvatochromic shift in nano- and microemulsions, it can be seen how much the components and the nature of the nanocarrier can affect the environment inside. The results suggest a potential difference in micropolarity between the studied dispersion interiors. The experiments also showed a bathochromic shift of the emulsion formulations relative to the probe spectrum of pure oleic acid. This finding may indicate that the oil molecules were potentially simultaneously in the core and may also be imprisoned between surfactant tails, changing the microenvironment to a more polar one, which was visualized as the solvatochromic shift. For this reason, it is crucial to rationally design nanoplatforms for a given application—in particular, meticulously selecting the process conditions and individual formulation components and carefully maintaining appropriate ratios between them. The environment inside the nanocarrier is very influential in the solubility of bioactive substances. Hence, precisely evaluating the micropolarity of the nanoplatform’s interior to optimally adapt it to the cargo is undoubtedly a key element. The demonstrated procedure is also suitable as a valuable tool for fast monitoring of the polarity of ingredients applied to cosmetic and pharmaceutical formulations, e.g., oil phases. It could be an alternative to the surface tension measurement techniques, allowing rapid screening. This approach has not yet been presented in the scientific literature and can bring many advantages. It must be highlighted that the sustainable nanoplatforms presented in this paper were designed with inspiration from green chemistry. They can be a promising tool for delivering bioactive agents with prospective various industrial applications due to their physicochemical characteristics, great colloidal stability and, especially, their potentially reduced toxicity due to biocompatible natural-origin components. 5. Patents P.449470: patent application, A. Szarwaryn & U. Bazylińska, Bezkosurfaktantowe mikroemulsje oraz sposób ich wytwarzania [Surfactant-free microemulsions and preparation method thereof] P.49471: patent application, A. Szarwaryn & U. Bazylińska, Biokompatybilna nanoemulsja typu olej w wodzie i sposób jej wytwarzania [Biocompatible oil-in-water nanoemulsion and preparation method thereof] Acknowledgments The authors gratefully acknowledge the support of the Department of Physical and Quantum Chemistry at Wroclaw University of Science and Technology (Poland). Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at https://www.mdpi.com/article/10.3390/ijms26189259/s1 Author Contributions Conceptualization, U.B.; methodology, A.S., T.K.O. and U.B.; software, A.S. and U.B.; formal analysis, T.K.O., W.B. and U.B.; investigation, A.S. and U.B.; resources, A.S., T.K.O. and U.B.; writing—original draft preparation, A.S., T.K.O. and U.B.; writing—review and editing, W.B. and U.B.; visualization, A.S.; supervision, U.B.; project administration, U.B.; funding acquisition, U.B. and W.B. All authors have read and agreed to the published version of the manuscript. Data Availability Statement All the data supporting the findings of this study are available within the article. Raw data are available from the corresponding authors upon reasonable request. Conflicts of Interest The authors declare no conflicts of interest. References 1. Waglewska E. Bazylińska U. Biodegradable Amphoteric Surfactants in Titration-Ultrasound Formulation of Oil-in-Water Nanoemulsions: Rational Design, Development, and Kinetic Stability Int. J. Mol. Sci. 2021 22 11776 10.3390/ijms222111776 34769205 PMC8584213 2. Mitra D. Microemulsion and Its Application: An inside Story Mater. Today Proc. 2023 83 75 82 10.1016/j.matpr.2023.01.149 3. McClements D.J. Nanoemulsions versus Microemulsions: Terminology, Differences, and Similarities Soft Matter 2012 8 1719 1729 10.1039/C2SM06903B 4. Flanagan J. Singh H. Microemulsions: A Potential Delivery System for Bioactives in Food Crit. Rev. Food Sci. Nutr. 2006 46 221 237 10.1080/10408690590956710 16527754 5. Das P. Panda J.R. Patro C.N. Sahu B. Patnaik S.S. A Comprehensive Review of Nanoemulsion Applications and Their Recent Advancements Curr. Nanomater. 2023 8 209 223 10.2174/2405461508666221103121439 6. Langevin D. Microemulsions and Liquid Crystals Mol. Cryst. Liq. Cryst. 1986 138 259 305 10.1080/00268948608071764 7. Vlaia L. Coneac G. Muţ A.M. Olariu I. Vlaia V. Anghel D.F. Maxim M.E. Dobrescu A. Hîrjău M. Lupuleasa D. Topical Biocompatible Fluconazole-Loaded Microemulsions Based on Essential Oils and Sucrose Esters: Formulation Design Based on Pseudo-Ternary Phase Diagrams and Physicochemical Characterization Processes 2021 9 144 10.3390/pr9010144 8. Chanama R. Horn G. McClements D.J. Influence of Oil Polarity on Droplet Growth in Oil-in-Water Emulsions Stabilized by a Weakly Adsorbing Biopolymer or a Nonionic Surfactant J. Colloid Interface Sci. 2002 247 167 176 10.1006/jcis.2001.8110 16290453 9. El-Mahrab-Robert M. Rosilio V. Bolzinger M.A. Chaminade P. Grossiord J.L. Assessment of Oil Polarity: Comparison of Evaluation Methods Int. J. Pharm. 2008 348 89 94 10.1016/j.ijpharm.2007.07.027 17728082 10. Reichardt C. Solvatochromic Dyes as Solvent Polarity Indicators Chem. Rev. 1994 94 2319 2358 10.1021/cr00032a005 11. Szarwaryn A. Bartkowiak W. Bazylińska U. UV-Visible Study on the Solubilization of Solvatochromic-Origin Dyes in Various Micellar Systems Colloids Surf. A Physicochem. Eng. Asp. 2023 675 132083 10.1016/j.colsurfa.2023.132083 12. Effenberger F. Würthner F. 5-Dimethylamino-5′-Nitro-2,2′-Bithiophene—A New Dye with Pronounced Positive Solvatochromism Angew. Chem. Int. Ed. Engl. 1993 32 719 721 10.1002/anie.199307191 13. Hartmann H. Eckert K. Schröder A. New Solvatochromic Dyes of the 5-Dimethylamino-5′nitro-2,2′-Bithiophene Type Angew. Chem. Int. Ed. 2000 39 556 558 10.1002/(SICI)1521-3773(20000204)39:3&#x0003c;556::AID-ANIE556&#x0003e;3.0.CO;2-O 10671256 14. Domínguez M. Rezende M.C. A Monte Carlo–Quantum Mechanics Study of a Solvatochromic Π* Probe J. Mol. Model. 2016 22 218 10.1007/s00894-016-3083-0 27553303 15. Nandi P.K. Das K.K. Bhattacharyya S.P. Solvent Modulation of Ground and Excited State Properties of 5-Dimethyl amino 5 H-Nitro-2,2 H-Bithiophene (DNBT): A Case Study within the Framework of a Scaled Self Consistent Reaction Field Method J. Mol. Struct. THEOCHEM 1999 466 155 164 10.1016/S0166-1280(98)00370-4 16. Würthner F. Solvent Effects in Supramolecular Chemistry: Linear Free Energy Relationships for Common Intermolecular Interactions J. Org. Chem. 2022 87 1602 1615 10.1021/acs.joc.1c00625 33973476 17. Ortí E. Viruela P.M. Viruela R. Effenberger F. Hernández V. López Navarrete J.T. Raman and Theoretical Study of the Solvent Effects on the Sizable Intramolecular Charge Transfer in the Push-Pull 5-(Dimethylamino)-5′- Nitro-2,2′-Bithiophene J. Phys. Chem. A 2005 109 8724 8731 10.1021/jp052137n 16834274 18. Meng S. Ma J. Solvatochromic Shift of Donor—Acceptor Substituted Bithiophene in Solvents of Different Polarity: Quantum Chemical and Molecular Dynamics Simulations J. Phys. Chem. B 2008 112 4313 4322 10.1021/jp710456p 18336016 19. Steybe F. Effenberger F. Gubler U. Bosshard C. Günter P. Highly Polarizable Chromophores for Nonlinear Optics: Syntheses, Structures and Properties of Donor-Acceptor Substituted Thiophenes and Oligothiophenes Tetrahedron 1998 54 8469 8480 10.1016/S0040-4020(98)00450-5 20. Homocianu M. Exploring Solvatochromism: A Comprehensive Analysis of Research Data Microchem. J. 2024 198 110166 10.1016/j.microc.2024.110166 21. Domínguez M.E. Rezende M.C. Márquez S. Theoretical Study of the Solvatochromism of a Donor-Acceptor Bithiophene J. Mol. Model. 2013 19 689 696 10.1007/s00894-012-1593-y 23011609 22. de Melo C.E.A. Domínguez M. Rezende M.C. Machado V.G. Solvatochromism of Dyes Inspired in Effenberger’s Probe Dye. Pigment. 2021 184 108757 10.1016/j.dyepig.2020.108757 23. Popczyk A. Cheret Y. El-Ghayoury A. Sahraoui B. Mysliwiec J. Solvatochromic Fluorophores Based on Thiophene Derivatives for Highly-Precise Water, Alcohols and Dangerous Ions Detection Dye. Pigment. 2020 177 108300 10.1016/j.dyepig.2020.108300 24. Anton N. Vandamme T.F. Nano-Emulsions and Micro-Emulsions: Clarifications of the Critical Differences Pharm. Res. 2011 28 978 985 10.1007/s11095-010-0309-1 21057856 25. Bera A. Kumar S. Mandal A. Temperature-Dependent Phase Behavior, Particle Size, and Conductivity of Middle-Phase Microemulsions Stabilized by Ethoxylated Nonionic Surfactants J. Chem. Eng. Data 2012 57 3617 3623 10.1021/je300845q 26. Thakore S. Patel R.B. Patel M. Nanoemulsion or Microemulsion?-Understanding the Differences and Similarities Pharma. Rev. 2014 136 142 27. Jadhav C. Kate V. Payghan S.A. Investigation of Effect of Non-Ionic Surfactant on Preparation of Griseofulvin Non-Aqueous Nanoemulsion J. Nanostructure Chem. 2015 5 107 113 10.1007/s40097-014-0141-y 28. Wuttikul K. Boonme P. Formation of Microemulsions for Using as Cosmeceutical Delivery Systems: Effects of Various Components and Characteristics of Some Formulations Drug Deliv. Transl. Res. 2016 6 254 262 10.1007/s13346-016-0279-x 26813671 29. Ramli S. Chyi K.T. Zainuddin N. Mokhtar W.N.A.W. Abdul Rahman I. The Influence of Surfactant/Co-Surfactant Hydrophilic-Lipophilic Balance on the Formation of Limonene-Based Microemulsion as Vitamin C Carrier Sains Malays. 2019 48 1035 1042 10.17576/jsm-2019-4805-12 30. Douglas D. de Oliveira M.C. de Araujo G.R.S. Amaral-Machado L. Porto D.L. Aragão C.F.S. do Nascimento Alencar E. do Egito E.S.T. Low-Surfactant Microemulsion, a Smart Strategy Intended for Curcumin Oral Delivery Colloids Surf. A Physicochem. Eng. Asp. 2022 652 129720 10.1016/j.colsurfa.2022.129720 31. Guttoff M. Saberi A.H. McClements D.J. Formation of Vitamin D Nanoemulsion-Based Delivery Systems by Spontaneous Emulsification: Factors Affecting Particle Size and Stability Food Chem. 2015 171 117 122 10.1016/j.foodchem.2014.08.087 25308650 32. Hassan S.F. Asghar S. Ullah Khan I. Munir R. Khalid S.H. Curcumin Encapsulation in Geranium Oil Microemulsion Elevates Its Antibacterial, Antioxidant, Anti-Inflammatory, and Anticancer Activities ACS Omega 2024 9 5624 5636 10.1021/acsomega.3c08033 38343911 PMC10851249 33. Chaurawal N. Misra C. Abul Barkat H. Jatyan R. Chitkara D. Barkat M.A. Sharma T. Singh B. Raza K. Oral Sorafenib-Loaded Microemulsion for Breast Cancer: Evidences from the in-Vitro Evaluations and Pharmacokinetic Studies Sci. Rep. 2022 12 13746 10.1038/s41598-022-17333-6 35962160 PMC9374710 34. Pucek A. Tokarek B. Waglewska E. Bazylińska U. Recent Advances in the Structural Design of Photosensitive Agent Formulations Using “Soft” Colloidal Nanocarriers Pharmaceutics 2020 12 587 10.3390/pharmaceutics12060587 32599791 PMC7356306 35. Marhamati M. Ranjbar G. Rezaie M. Effects of Emulsifiers on the Physicochemical Stability of Oil-in-Water Nanoemulsions: A Critical Review J. Mol. Liq. 2021 340 117218 10.1016/j.molliq.2021.117218 36. Fazeli S. Sohrabi B. Tehrani-Bagha A.R. The Study of Sunset Yellow Anionic Dye Interaction with Gemini and Conventional Cationic Surfactants in Aqueous Solution Dye. Pigment. 2012 95 768 775 10.1016/j.dyepig.2012.03.022 37. Waglewska E. Kulbacka J. Bazylińska U. Superior Drug Delivery Performance of Multifunctional Bilosomes: Innovative Strategy to Kill Skin Cancer Cells for Nanomedicine Application Int. J. Nanomed. 2024 19 4701 4717 10.2147/IJN.S450181 PMC11131132 38808148 38. Sivakumar M. Tang S.Y. Tan K.W. Cavitation Technology—A Greener Processing Technique for the Generation of Pharmaceutical Nanoemulsions Ultrason. Sonochemistry 2014 21 2069 2083 10.1016/j.ultsonch.2014.03.025 24755340 39. Mazonde P. Khamanga S.M.M. Walker R.B. Design, Optimization, Manufacture and Characterization of Efavirenz-Loaded Flaxseed Oil Nanoemulsions Pharmaceutics 2020 12 797 10.3390/pharmaceutics12090797 32842501 PMC7559825 40. Azeem A. Khan Z.I. Aqil M. Ahmad F.J. Khar R.K. Talegaonkar S. Microemulsions as a Surrogate Carrier for Dermal Drug Delivery Drug Dev. Ind. Pharm. 2009 35 525 547 10.1080/03639040802448646 19016057 41. Preeti Sambhakar S. Malik R. Bhatia S. Al Harrasi A. Rani C. Saharan R. Kumar S. Geeta Sehrawat R. Nanoemulsion: An Emerging Novel Technology for Improving the Bioavailability of Drugs Scientifica 2023 1 6640103 10.1155/2023/6640103 PMC10625491 37928749 42. Ma J. Sun R. Xia K. Xia Q. Liu Y. Zhang X. Design and Application of Fluorescent Probes to Detect Cellular Physical Microenvironments Chem. Rev. 2024 124 1738 1861 10.1021/acs.chemrev.3c00573 38354333 43. Abe M. Measurement Techniques and Practices of Colloid and Interface Phenomena Measurement Techniques and Practices of Colloid and Interface Phenomena Springer Singapore 2019 1 145 9789811359316 44. Liu F. Guan X. Liu X. McClements D.J. Ngai T. Bioinspired Eggosomes with Dual Stimuli-Responsiveness ACS Appl. Bio Mater. 2021 4 7825 7835 10.1021/acsabm.1c00765 35006764 45. Buyuktimkin T. Water Titration Studies on Microemulsions with a Nonionic Surfactant Derived from Castor Oil and a Series of Polar Oils J. Drug Deliv. Sci. Technol. 2020 56 101521 10.1016/j.jddst.2020.101521 46. Reichardt C. Pyridinium-N-Phenolate Betaine Dyes as Empirical Indicators of Solvent Polarity: Some New Findings Pure Appl. Chem. 2008 80 1415 1432 10.1351/pac200880071415 47. Effenberger F. Würthner F. Steybe F. Synthesis and Solvatochromic Properties of Donor-Acceptor-Substituted Oligothiophenes J. Org. Chem. 1995 60 2082 2091 10.1021/jo00112a032 48. Szarwaryn A. Bazylińska U. Bezkosurfaktantowe mikroemulsje oraz sposób ich wytwarzania [Surfactant-free microemulsions and preparation method thereof] Patent No. P.449470 Application for Granting a Patent Adopted in the Patent Office of the Republic of Poland on 7 August 2024. Unpublished yet 49. Szarwaryn A. Bazylińska U. Biokompatybilna nanoemulsja typu olej w wodzie i sposób jej wytwarzania [Biocompatible oil-in-water nanoemulsion and preparation method thereof] Patent No. P.449471 Application for Granting a Patent Adopted in the Patent Office of the Republic of Poland on 7 August 2024. Unpublished yet 50. Bunk M. Daniels R. Influence of Oil Polarity and Cosurfactants on the Foamability of Mono-and Diacylphosphatidylcholine Stabilized Emulsions Pharmaceutics 2022 14 1212 10.3390/pharmaceutics14061212 35745785 PMC9230088 51. Terescenco D. Picard C. Clemenceau F. Grisel M. Savary G. Influence of the Emollient Structure on the Properties of Cosmetic Emulsion Containing Lamellar Liquid Crystals Colloids Surf. A Physicochem. Eng. Asp. 2018 536 10 19 10.1016/j.colsurfa.2017.08.017 30303546 52. Lionetti N. Rigano L. The New Sunscreens among Formulation Strategy, Stability Issues, Changing Norms, Safety and Efficacy Evaluations Cosmetics 2017 4 15 10.3390/cosmetics4020015 53. Parker E.T. Lollar P. Measurement of the translational diffusion coefficient and hydrodynamic radius of proteins by dynamic light scattering Bio-Protocol 2021 11 e4195 10.21769/BioProtoc.4195 34761067 PMC8554817 54. Maguire C.M. Rösslein M. Wick P. Prina-Mello A. Characterisation of particles in solution—A perspective on light scattering and comparative technologies Sci. Technol. Adv. Mater. 2018 19 732 745 10.1080/14686996.2018.1517587 30369998 PMC6201793 55. Ferreira D. Bachelard R. Guerin W. Kaiser R. Fouché M. Connecting field and intensity correlations: The Siegert relation and how to test it Am. J. Phys. 2020 88 831 837 10.1119/10.0001630 56. Provencher S.W. A constrained regularization method for inverting data represented by linear algebraic or integral equations Comput. Phys. Commun. 1982 27 213 227 10.1016/0010-4655(82)90173-4 57. Kolman K. Steffen W. Bugla-Płoskońska G. Skwara A. Pigłowski J. Butt H.J. Kiersnowski A. Exfoliation of montmorillonite in protein solutions J. Colloid Interface Sci. 2012 374 135 140 10.1016/j.jcis.2012.02.009 22405581 58. Scotti A.E. Liu W. Hyatt J.S. Herman E.S. Choi H.S. Kim J.W. Fernandez-Nieves A. The CONTIN algorithm and its application to determine the size distribution of microgel suspensions J. Chem. Phys. 2015 142 234905 10.1063/1.4921686 26093577 Figures and Scheme Figure 1 Schematic representation of the investigation into green nanoplatform design and the utilization of the solvatochromic approach. Figure 2 Representative partial pseudoternary phase diagram indicating the o/w macroemulsion (blue), o/w nanoemulsion (light green), o/w microemulsion (pink), and double phase (orange) regions at room temperature. Figure 3 Changes in hydrodynamic diameter (D H 0 32 Figure 4 Hydrodynamic diameter (D H Figure 5 Hydrodynamic diameter (D H Figure 6 UV–Vis spectra for investigation of the solvatochromic behavior of bithiophene in pure solvents, as well as nanoemulsion and microemulsion systems. The potential site of cargo solubilization can be inferred from solvatochromic shifts observed with a micropolarity-sensitive probe. Figure 7 UV–Vis spectra for investigation of the solvatochromic behavior of bithiophene in nanoemulsion and microemulsion systems in comparison with bithiophene in the pure oil phase (oleic acid). Solvatochromic shifts suggest potential changes in the polarity of the local microenvironment inside different types of nanocarriers. ijms-26-09259-sch001_Scheme 1 Scheme 1 Synthetic pathway leading to 5–dimethylamino-5′–nitro-substituted 2,2′–bithiophene (DNBT) 4. ",
  "metadata": {
    "Title of this paper": "The CONTIN algorithm and its application to determine the size distribution of microgel suspensions",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470261/"
  }
}