{
  "title": "Paper_729",
  "abstract": "pmc Viruses Viruses 1559 viruses viruses Viruses 1999-4915 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12474219 PMC12474219.1 12474219 12474219 41012647 10.3390/v17091219 viruses-17-01219 1 Review Hypochlorous Acid (HOCl) as a Promising Respiratory Antiseptic https://orcid.org/0000-0003-4667-576X Winter Michael 1 Boecker Dirk 2 https://orcid.org/0000-0001-8955-7654 Posch Wilfried 3 * De la Torre Juan Academic Editor 1 michael.winter@hocl.at 2 dirk@totoconsulting.net 3 * wilfried.posch@i-med.ac.at 07 9 2025 9 2025 17 9 497677 1219 21 7 2025 01 9 2025 03 9 2025 07 09 2025 28 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ The COVID-19 pandemic has inflicted unprecedented pressure on communities and healthcare systems around the world. An outstandingly broad and intensive investigation of possible therapeutic interventions is currently taking place to prevent similar future threats to the global population. Investigating the related mechanisms of action is often complex and time consuming. Moreover, research on biochemical interactions of new drugs involves a considerable amount of effort, consequently bearing inherent financial and operational risks for pharmaceutical companies. An interesting approach to counteract colonization and infection is the concept of antiseptic treatment in vivo. Antiseptics are cost-effective and globally accessible, due to their ease of production, transportation and handling. A broad spectrum of active agents with different properties is readily available. One of these substances is hypochlorous acid (HOCl), which is also a naturally occurring biocidal agent and as such part of the innate immune system. Its successful history of medical use in wound treatment, combined with low cytotoxicity and documented efficacy against various pathogens, suggests that HOCl might be an effective agent for treating the respiratory mucosa. This could potentially enable therapeutic inhalation for combating bacterial infections and viral pathogens such as human respiratory syncytial, influenza, and SARS-CoV-2 viruses, which will be discussed in the present article. HOCl respiratory infection antiseptic antimicrobial treatment RSV influenza COVID-19 SARS-CoV-2 Austrian Science Fund (FWF) This research was funded by the Austrian Science Fund (FWF) [DOI 10.55776/P34070]. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The pursuit of novel antibiotic treatment options to mitigate the worldwide problem of growing bacterial resistance has become increasingly difficult and cost-intensive in recent years [ 1 In comparison, an antiseptic approach is limited to mainly external application, but more resilient against diagnostic ambiguities and errors, due to its agnostic mechanism of action [ 2 3 Its broad efficacy is therefore advantageous in less developed areas with limited access to medical infrastructure. Concurrently, in suitable fields of application it may prove helpful even in advanced medical institutions by exerting protective action against various nosocomial pathogens [ 4 A variety of existing antiseptic agents exhibit notable resilience against microbial resistance, characterized by their continuously effective reduction in bacterial loads in vitro [ 5 6 7 8 Thus, especially considering emerging viruses and the COVID-19 pandemic, it would be pertinent to investigate the potential applications of these antiseptic agents in treating common infections, like those affecting the respiratory mucosa. Understanding their effectiveness in such contexts could provide valuable insights into expanding their therapeutic utility beyond conventional uses. However, in a potential new scientific field of antiseptic treatment of respiratory tract infections, it is crucial to rigorously evaluate safety concerns. For these efforts it is reasonable to re-examine the respiratory pathways, for their distinct tissue properties, characteristics in microbiome and systemic functional contributions. Depending on the area of mucosal application, a variety of different antimicrobial and antiviral agents may be considered [ 9 10 2. Antiseptics of Interest In their recommendations in the context of the COVID-19 pandemic [ 11 In the area of medical antiseptics, povidone-iodine (PVP-I) has been used internationally in tolerable concentrations between 0.23% and 1.25% inside the nose and mouth for prophylaxis, and could be effective in early treatment [ 11 12 11 13 14 However, not all common antiseptics were reported as effective against SARS-CoV-2. Common antiseptic mouthwashes based on hydrogen peroxide (H 2 2 10 11 The DGKH outlined its perspective on sodium hypochlorite and HOCl. A comparative in vitro study with encouraging results of an HOCl/stabilized hypochlorite mouthwash was mentioned [ 11 13 11 15 Although not mentioned in the DGKH paper, the HOCl derivative N-chlorotaurine (NCT) formed by reaction with taurine might be considered as well, and has been suggested to be a suitable agent for respiratory disinfection [ 16 While several agents were discussed in the DGKH publication, HOCl may be considered particularly interesting, due to its natural presence in the respiratory tract [ 17 3. HOCl In general, an ideal antiseptic agent should possess attributes such as low cell toxicity, sufficient efficacy against a broad spectrum of pathogens, and should be non-allergenic as well as non-irritating. Current research demonstrated all of these favorable characteristics for HOCl [ 3 18 3.1. Key Role of HOCl in the Innate Immune System White blood cells, particularly neutrophils and monocytes, produce reactive oxygen species like H 2 2 19 HOCl is a weak acid but a strong oxidizing agent. It interacts with structural components of viruses and bacteria, making it a crucial endogenous molecule for effective phagocytosis [ 3 20 In biological systems, HOCl can be regarded as the most effective and most common oxidizing agent. It is one of the foremost endogenous molecules for effective phagocytosis of invading bacteria or viruses [ 21 3.2. Production of Exogenous HOCl HOCl has been broadly used in therapeutic applications, as well as for disinfection of surfaces, water, food and room air [ 22 HOCl solutions can be produced through 2 methods: either direct injection of gaseous chlorine into water, or electrolysis of hydrochloric acid or an aqueous solution of sodium chloride. Several factors influence the production and efficiency of electrolyzed water, including water and electrolyte properties, electrode material, current, storage, and application factors. A comprehensive overview is given by Ampiaw et al. [ 23 In aqueous solutions under physiological conditions the pair of HOCl with its conjugated base OCl − − − 24 25 At pH 5 HOCl is the dominant oxidizing agent. Lowering the pH of HOCl/OCl − 2 26 3.3. Reaction Mechanisms of Externally Applied HOCl In wound treatment, HOCl at suitable concentrations supports the healing process upon application. Research has demonstrated its beneficial effects on healing mechanisms of the mucosa and other tissue types, rendering it an effective ingredient and possible future gold standard for topical wound care solutions [ 27 The chemical reaction of HOCl with endothelial structures deactivates microbes by oxidizing their cellular components, such as proteins, lipids, and DNA, leading to cell death [ 20 Furthermore, HOCl stimulates the production of neutrophil extracellular traps (NETs), which can trap and kill microbes [ 28 29 Besides its direct biocidal activities HOCl is also involved in complement-mediated immunity, a synergistic acting protein cascade of the innate immune system that helps eliminate pathogens and initiate inflammation [ 20 21 30 Finally, it promotes the abundant presence of the antimicrobial acting N-chlorotaurine (NCT) in the extracellular medium. This reversible reaction modulates the oxidizing capability of HOCl through the formation of the less reactive oxidant NCT [ 31 Due to these antimicrobial properties, HOCl is expected to exert significant influence on the microbiome of the application area. Therefore, it is important to investigate possible adverse systemic effects of its use on the respiratory mucosa, particularly in emerging applications such as inhalation. 4. Systemic Relevance of Respiratory Microbiome Reduction 4.1. Mucosal Environment and Reactive Oxygen Species In healthy individuals, upper airways are relatively robust and typically host a diverse and balanced array of microbial species, collectively known as the mucosal microbiome [ 32 33 Changes in its equilibrium can be potentially problematic. Accumulations of specific bacterial organisms are often linked to cardiovascular diseases like hypertension and various forms of dementia, among them Chlamydia pneumoniae 34 Treponema denticola 35 Porphyromonas gingivalis 36 37 The metabolic activity of the mucosal microbiome contributes to a variety of essential systemic mechanisms. Some of the factors possibly being impacted by antiseptic intervention are vitally important, like the bioavailability of nitric oxide (NO), through which the mucosal microbiome likely participates in the regulation of blood pressure [ 38 39 40 The respiratory epithelium employs mucociliary mechanisms to continually clear inhaled particles and pathogens by constant movement of mucus to the oropharynx and eventual dispatch through the digestive system [ 41 42 43 Apart from these immune cells, several types of other cells of the ciliated epithelium also recognize bacterial components through specific PRR-receptors on their surface. Activation of these receptors triggers signaling pathways, which leads to the release of inflammatory mediators like cytokines and chemokines [ 44 45 46 Epithelial cells contribute directly to the control of microbial contamination, producing antimicrobial peptides, surfactant proteins, immunoglobulins and ROS including HOCl [ 3 17 47 48 As a result of the combined effect of this interplay, healthy microbiome of lower airways typically shows similar microbial community variation with significantly lower log counts [ 49 4.2. Implications for Inhalation Inhalation of supplementary exogenous HOCl is anticipated to have minimal impact on oral microbial biomass compared to mouthwashes, due to its minor concentration and dosage. In the lower airways, microbial counts are generally low. Additionally, antiseptic treatments are generally less specific and therefore less likely to inflict dysbiosis than current antibiotics [ 50 It may instead be anticipated to provide a favorable effect in the respiratory tract similar to toothpaste [ 51 52 5. HOCl-Containing Products An increasing variety of HOCl-containing health products is available throughout Europe. Depending on their intended use, they are predominantly approved as medical devices in the appropriate class, as shown in Table 1 In the United States, several medical devices formulated with HOCl have FDA 510(k) clearance [ 53 54 55 56 viruses-17-01219-t001_Table 1 Table 1 Examples of HOCl-based medical devices and health products in Europe. Product Name Manufacturer Country Total Free Chlorine (ppm) Medical Device Class Approval Recommended Use Plasma Liquid ® Regeno GmbH Mannheim, Germany <600 [ 57 IIa CE marked Cleansing and moisturizing the nasal mucosa Granudacyn ® Mölnlycke Health Care GmbH Düsseldorf, Germany 105 [ 58 IIa CE marked Mouthwash for oral hygiene and pathogen reduction Oji Biosafety Room Air Disinfection System oji Europe GmbH, Nauen, Germany <0.5 (regulatory limit [ 59 not applicable not applicable Long-term air disinfection to reduce airborne pathogens Veriforte ® P.G.F. Industry Solutions GmbH Elixhausen, Austria 93 [ 58 IIb CE marked Cleansing and irrigation of acute and chronic wounds Actimaris ® ActiMaris AG Appenzell, Switzerland 440 [ 60 I CE marked Cleansing and moisturizing the nasal mucosa Hydroliq Fogging Solution Hydroliq AG Lucerne, Switzerland <0.5 (regulatory limit [ 59 not applicable not applicable Surface and air disinfection in various settings Microdacyn60 ® Oculus Innovative Sciences Netherlands B.V. Delft, Netherlands 80 [ 58 IIb CE marked Cleansing and irrigation of acute and chronic wounds Spectricept™ Skincare Solution SpectrumX Direct Limited Knutsford, United Kingdom unknown IIa CE marked Skincare solution for cleansing and moisturizing OraWize+ Mouthwash/Dental Rinse Tec-Safe Maccelsfield, United Kingdom 100–200 [ 13 IIa CE marked Mouthwash for oral hygiene and pathogen reduction Briotech Topical Skin Spray Briotech EU Vantaa, Finland unknown not applicable unknown Topical spray for cleansing and moisturizing the skin * Reference occupational exposure limit for chlorine in workplace air (Germany). 6. Dosage and Safety Considerations on HOCl-Inhalation The concentrations of HOCl vary significantly depending on the intended application. It is important to consider pH and the ratio between HOCl and other ROS in these products, especially those produced through electrolysis, with the goal of ensuring that HOCl, the more effective and less cytotoxic component, is the predominant species [ 61 62 In the context of inhalation, recent evidence notably suggests that aerosolized base fluids containing up to ≈5.72 mM (300 ppm) HOCl at a pH of 6.5 do not affect respiratory tissue, cellular viability, or morphology [ 63 64 While it is commonly presumed that droplet size of aerosols defines the maximum bronchiolar propagation range, from a physical perspective some outgassing from droplets in their proximity is to be expected during inhalation. Traces of HOCl in its gas phase will therefore likely reach the pulmonary alveoli, along with some very small droplets under 1 μm [ 65 66 67 68 Biological HOCl concentrations within inflamed tissue can reach micromolar levels of about 200 μM (≈10.5 ppm) [ 69 70 71 72 High second-order rate constants, in the range of 10 7 8 −1 −1 73 − 74 − − 75 A modest amount of oxidative stress is thought to be beneficial rather than harmful to human cells, inducing a hormetic response [ 76 77 Depending on HOCl concentration, different mechanisms of action against pathogens have been discussed. Some authors have proposed that concentrations in the micromolar range impact bacterial DNA synthesis, while concentrations in the millimolar range result in membrane disruption [ 78 79 ROS inducers have been suggested as a possible intervention against viral infections, including SARS-CoV-2, by impairment of RNA integrity [ 80 81 82 However, HOCl rapidly compromises and cleaves disulfide bonds at very low concentrations [ 83 84 85 Figure 1 Conceivable additional targets within the spike glycoprotein include the accessible cysteine residues and disulfide bond at C391-C525 and the bridge at C379-C432 [ 87 88 A similar approach to virucidal effects by low supplemental HOCl-concentrations may be feasible in human respiratory syncytial virus (RSV) as well, for example through the oxidation of the structurally critical and sterically accessible residues C69/C212 [ 89 90 91 Compared to SARS-CoV-2 and RSV, influenza virions appear to be even more susceptible to oxidation, due to their delicate lipid layer and high dependance on exposed disulfides [ 92 93 94 For an inhalative intervention, a conservative and practical strategy would involve using concentrations close to physiological levels, aiming for a target concentration of approximately 200 μM. Experimental studies suggest a considerable loss in free chlorine concentration of airborne electrolyzed water during spraying, reaching almost 50% decrease during a travel distance of 25 cm [ 95 Furthermore, dilution at the target site, as well as reactive consumption by surfactant proteins, thiol groups and other reactive species is to be expected. However, under infectious and inflammatory conditions, the buffering capacity of the airway lining fluid may be compromised [ 96 This strategy involves comparatively low external HOCl concentrations, however it may induce favorable secondary biochemical reactions in situ, which lead to a selectively increased oxidative potential in close proximity of some pathogens (discussed in Section 7 97 7. Discussion The possibility of administering antiseptic treatments repeatedly in quick succession (e.g., 3 or 4 times per day), with the goal of reducing viral and bacterial loads over prolonged periods, may help alleviate the metabolic burden of infection and improve clinical efficacy. This strategy relies to a significant extent on low cytotoxicity and side-effects, which is an established advantage of HOCl in wound treatment [ 3 98 99 While other antiseptic agents like benzalkonium chloride or triclosan may induce cross-resistance in some bacterial species, there is no documentation of resistance facilitated by NaOCl [ 100 There is some evidence for a “trade-off” between antimicrobial efficacy and undesirable effects like decreasing viability of keratinocytes and fibroblasts [ 58 While HOCl as an oxidative species may initially have beneficial effects in infections, ROS have been documented to play a role in the formation of macrophage extracellular traps [ 28 81 101 Conversely, excessive ROS levels can also induce cancer cell death, and are deliberately exploited in therapeutic approaches such as radiation and chemotherapy [ 102 Interestingly, HOCl was shown to induce apoptosis selectively in malignant cells expressing NADPH oxidase. Selective action against transformed cells apparently depends on the interaction between their NOX1-generated superoxide anions and HOCl, resulting in hydroxyl radicals, which then induce apoptosis [ 103 HOCl has been documented to ameliorate nuclear factor-κB-mediated skin diseases in mice [ 104 105 106 107 Recently, HOCl has also shown favorable results in a comparison of oral antiseptics for radiation- or chemotherapy induced mucositis [ 108 109 16 110 Further clinical research on the possible role of HOCl in the ongoing fight against SARS-CoV-2 was recommended in several recent publications [ 3 22 111 112 HOCl has been acknowledged as effective against SARS-CoV-2 in vitro by a Japanese NITE special committee, at concentrations of 35 ppm and above [ 113 Prevotella intermedia 2 Antiviral efficacy against human norovirus and two surrogate viruses was observed at very low concentrations, with HOCl applied both as a liquid and a fog at 18.8 ppm and above [ 114 Efficacy of HOCl against biofilms like those created by Streptococcus mutans Streptococcus gordonii 115 116 117 118 Despite their early documentation [ 79 E. coli The presence of pathogens correlates with local concentrations of biological ROS. Potential explanations for a higher-than-expected in vivo efficacy of externally applied micromolar HOCl therefore include its possible interaction with locally available biological H 2 2 103 119 HOCl + H 2 2 2 1 O 2 + − HOCl + O 2 ⋅− − 2 8. Conclusions An experimental clinical strategy for early treatment of a broad range of bacterial and viral infections, including those caused by the Pneumoviridae 8 120 121 122 A conservative approach, loosely resembling and supplementing endogenous countermeasures to infections, may presumably be repeated frequently—initially covering a time period similar to the reaction time of the adaptive immune system, aiming to keep microbial or viral replication and log counts low and manageable, until specific antibodies and T-cells have arrived at the infection site. Therapeutic success of this kind of intervention would likely result in mitigation of clinical symptoms and reduced morbidity rather than PCR test negativity, since impaired and non-reproductive virions or bacteria [ 123 Acknowledgments Michael Winter would like to express his deep gratitude for the extraordinarily valuable insights provided by Georg Bauer. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, M.W. and W.P.; resources, M.W., D.B. and W.P.; writing—original draft preparation, M.W., D.B. and W.P.; writing—review and editing, M.W. and W.P.; visualization, M.W.; supervision, W.P.; project administration, W.P.; funding acquisition, W.P. All authors have read and agreed to the published version of the manuscript. Conflicts of Interest Michael Winter and Wilfried Posch declare no conflicts of interest. Dirk Boecker is personally acquainted and currently providing pro bono advice to oji Europe GmbH. References 1. Butler M.S. Henderson I.R. Capon R.J. Blaskovich M.A.T. Antibiotics in the clinical pipeline as of December 2022 J. Antibiot. 2023 76 431 473 10.1038/s41429-023-00629-8 37291465 PMC10248350 2. Tazawa K. Jadhav R. Azuma M.M. Fenno J.C. McDonald N.J. Sasaki H. Hypochlorous acid inactivates oral pathogens and a SARS-CoV-2-surrogate BMC Oral Health 2023 23 111 10.1186/s12903-023-02820-7 36803460 PMC9938691 3. Boecker D. Zhang Z. Breves R. Herth F. Kramer A. Bulitta C. Antimicrobial efficacy, mode of action and in vivo use of hypochlorous acid (HOCl) for prevention or therapeutic support of infections GMS Hyg. Infect Control 2023 18 Doc07 10.3205/dgkh000433 37034111 PMC10073986 4. Kiamco M.M. Zmuda H.M. Mohamed A. Call D.R. Raval Y.S. Patel R. Beyenal H. Hypochlorous-Acid-Generating Electrochemical Scaffold for Treatment of Wound Biofilms Sci. Rep. 2019 9 2683 10.1038/s41598-019-38968-y 30804362 PMC6389966 5. Barakat N.A. Rasmy S.A. Hosny A.E.D.M.S. Kashef M.T. Effect of povidone-iodine and propanol-based mecetronium ethyl sulphate on antimicrobial resistance and virulence in Staphylococcus aureus Antimicrob. Resist. Infect. Control 2022 11 139 10.1186/s13756-022-01178-9 36369050 PMC9652812 6. Chen C.J. Chen C.C. Ding S.J. Effectiveness of hypochlorous acid to reduce the biofilms on titanium alloy surfaces in vitro Int. J. Mol. Sci. 2016 17 1161 10.3390/ijms17071161 27447617 PMC4964533 7. Hacioglu M. Oyardi O. Yilmaz F.N. Nagl M. Comparative Fungicidal Activities of N-Chlorotaurine and Conventional Antiseptics against Candida J. Fungi 2022 8 682 10.3390/jof8070682 PMC9322802 35887439 8. Tamaki S. Bui V.N. Ngo L.H. Ogawa H. Imai K. Virucidal effect of acidic electrolyzed water and neutral electrolyzed water on avian influenza viruses Arch. Virol. 2014 159 405 412 10.1007/s00705-013-1840-2 24026292 9. Kamal Arefin M. Banu S.S. Nasir Uddin A.K.M. Nurul Fattah Rumi S.K. Khan M. Kaiser A. Arafat M.S. Chowdhury J.A. Khan M.A.S. Hasan M.J. Virucidal Effect of Povidone Iodine on SARS-CoV-2 in Nasopharynx: An Open-Label Randomized Clinical Trial Indian. J. Otolaryngol. Head. Neck Surg. 2022 74 3283 3292 10.1007/s12070-022-03106-0 35572740 PMC9075709 10. Meister T.L. Brüggemann Y. Todt D. Conzelmann C. Müller J.A. Groß R. Münch J. Krawczyk A. Steinmann J. Steinmann J. Virucidal efficacy of different oral rinses against severe acute respiratory syndrome Coronavirus 2 J. Infect. Dis. 2020 222 1289 1292 10.1093/infdis/jiaa471 32726430 PMC7454736 11. Kramer A. Eggers M. Exner M. Simon A. Steinmann E. Zwicker P. Recommendation of the German Society of Hospital Hygiene (DGKH): Prevention of COVID-19 by virucidal gargling and virucidal nasal spray—Updated version April 2022 GMS Hyg. Infect. Control 2022 17 Doc13 10.3205/dgkh000416 35909651 PMC9285112 12. Choudhury M.I.M. Shabnam N. Ahsan T. Kabir M.S. Md Khan R. Ahsan S.A. Effect of 1% Povidone Iodine Mouthwash/Gargle, Nasal and Eye Drop in COVID-19 patient Biores. Commun. 2021 7 919 923 10.3329/brc.v7i1.54245 13. Davies K. Buczkowski H. Welch S.R. Green N. Mawer D. Woodford N. Roberts A.D.G. Nixon P.J. Seymour D.W. Killip M.J. Effective in vitro inactivation of SARS-CoV-2 by commercially available mouthwashes J. Gen. Virol. 2021 102 001578 10.1099/jgv.0.001578 33913803 PMC8290272 14. Ludwig M. Enzenhofer E. Schneider S. Rauch M. Bodenteich A. Neumann K. Prieschl-Grassauer E. Grassauer A. Lion T. Mueller C.A. Efficacy of a Carrageenan nasal spray in patients with common cold: A randomized controlled trial Respir. Res. 2013 14 124 10.1186/1465-9921-14-124 24219370 PMC3840586 15. Meister T.L. Todt D. Brüggemann Y. Steinmann J. Banava S. Brill F.H.H. Pfaender S. Steinmann E. Virucidal activity of nasal sprays against severe acute respiratory syndrome coronavirus-2 J. Hosp. Infect. 2022 120 9 13 10.1016/j.jhin.2021.10.019 34752803 PMC8572043 16. Marcinkiewicz J. Nagl M. Kyriakopoulos A. Walczewska M. Skóra M. Skalska P. Current Opinion on the Therapeutic Capacity of Taurine-Containing Halogen Derivatives in Infectious and Inflammatory Diseases Taurine 12 Advances in Experimental Medicine and Biology Schaffer S.W. El Idrissi A. Murakami S. Springer Cham, Switzerland 2022 Volume 1370 83 98 10.1007/978-3-030-93337-1_8 35882784 17. Hiemstra P.S. McCray P.B. Bals R. The innate immune function of airway epithelial cells in inflammatory lung disease Eur. Respir. J. 2015 45 1150 1162 10.1183/09031936.00141514 25700381 PMC4719567 18. Küster I. Kramer A. Bremert T. Langner S. Hosemann W. Beule A.G. Eradication of MRSA skull base osteitis by combined treatment with antibiotics and sinonasal irrigation with sodium hypochlorite Eur. Arch. Oto-Rhino-Laryngol. 2016 273 1951 1956 10.1007/s00405-015-3739-x 26227617 19. Nguyen G.T. Green E.R. Mecsas J. Neutrophils to the ROScue: Mechanisms of NADPH Oxidase Activation and Bacterial Resistance Front. Cell Infect. Microbiol. 2017 7 373 10.3389/fcimb.2017.00373 28890882 PMC5574878 20. Andrés C.M.C. Pérez de la Lastra J.M. Juan C.A. Plou F.J. Pérez-Lebeña E. Hypochlorous Acid Chemistry in Mammalian Cells—Influence on Infection and Role in Various Pathologies Int. J. Mol. Sci. 2022 23 10735 10.3390/ijms231810735 36142645 PMC9504810 21. Ulfig A. Leichert L.I. The effects of neutrophil-generated hypochlorous acid and other hypohalous acids on host and pathogens Cell. Mol. Life Sci. 2021 78 385 414 10.1007/s00018-020-03591-y 32661559 PMC7873122 22. Block M.S. Rowan B.G. Hypochlorous Acid: A Review J. Oral Maxillofac. Surg. 2020 78 1461 1466 10.1016/j.joms.2020.06.029 32653307 PMC7315945 23. Ampiaw R.E. Yaqub M. Lee W. Electrolyzed water as a disinfectant: A systematic review of factors affecting the production and efficiency of hypochlorous acid J. Water Process Eng. 2021 43 102228 10.1016/j.jwpe.2021.102228 24. USDA Hypochlorous Acid. Technical Evaluation Report 2015 Available online: https://www.ams.usda.gov/sites/default/files/media/Hypochlorous%20Acid%20TR%2008%2013%2015.pdf (accessed on 6 April 2024) 25. Briotech, Inc. Application for Inclusion in the 2021 WHO Essential Medicines List 2021 Available online: https://www.who.int/groups/expert-committee-on-selection-and-use-of-essential-medicines/23rd-expert-committee/a18-hypochlorous (accessed on 4 September 2025) 26. Cherney D.P. Duirk S.E. Tarr J.C. Collette T.W. Monitoring the Speciation of Aqueous Free Chlorine from pH 1 to 12 with Raman Spectroscopy to Determine the Identity of the Potent Low-pH Oxidant Appl. Spectrosc. 2006 60 764 772 10.1366/000370206777887062 16854264 27. Gold M.H. Andriessen A. Bhatia A.C. Bitter P. Chilukuri S. Cohen J.L. Robb C.W. Topical stabilized hypochlorous acid: The future gold standard for wound care and scar management in dermatologic and plastic surgery procedures J. Cosmet. Dermatol. 2020 19 270 277 10.1111/jocd.13280 31904191 28. Rayner B.S. Zhang Y. Brown B.E. Reyes L. Cogger V.C. Hawkins C.L. Role of hypochlorous acid (HOCl) and other inflammatory mediators in the induction of macrophage extracellular trap formation Free Radic. Biol. Med. 2018 129 25 34 10.1016/j.freeradbiomed.2018.09.001 30189264 29. Islam M.d.M. Takeyama N. Role of Neutrophil Extracellular Traps in Health and Disease Pathophysiology: Recent Insights and Advances Int. J. Mol. Sci. 2023 24 15805 10.3390/ijms242115805 37958788 PMC10649138 30. Biedroń R. Konopiński M.K. Marcinkiewicz J. Józefowski S. Oxidation by Neutrophils-Derived HOCl Increases Immunogenicity of Proteins by Converting Them into Ligands of Several Endocytic Receptors Involved in Antigen Uptake by Dendritic Cells and Macrophages PLoS ONE 2015 10 e0123293 10.1371/journal.pone.0123293 25849867 PMC4388828 31. Zgliczyński J.M. Stelmaszyńska T. Domański J. Ostrowski W. Chloramines as intermediates of oxidation reaction of amino acids by myeloperoxidase Biochim. Biophys. Acta (BBA) Enzymol. 1971 235 419 424 10.1016/0005-2744(71)90281-6 4378090 32. Sender R. Fuchs S. Milo R. Revised Estimates for the Number of Human and Bacteria Cells in the Body PLoS Biol. 2016 14 e1002533 10.1371/journal.pbio.1002533 27541692 PMC4991899 33. Human Microbiome Project Consortium Structure, function and diversity of the healthy human microbiome Nature 2012 486 207 214 10.1038/nature11234 22699609 PMC3564958 34. Campbell L.A. Kuo C.C. Chlamydia pneumoniae—An infectious risk factor for atherosclerosis? Nat. Rev. Microbiol. 2004 2 23 32 10.1038/nrmicro796 15035006 35. Ide M. Harris M. Stevens A. Sussams R. Hopkins V. Culliford D. Fuller J. Ibbett P. Raybould R. Thomas R. Periodontitis and Cognitive Decline in Alzheimer’s Disease PLoS ONE 2016 11 e0151081 10.1371/journal.pone.0151081 26963387 PMC4786266 36. Dominy S.S. Lynch C. Ermini F. Benedyk M. Marczyk A. Konradi A. Nguyen M. Haditsch U. Raha D. Griffin C. Porphyromonas gingivalis in Alzheimer’s disease brains: Evidence for disease causation and treatment with small-molecule inhibitors Sci. Adv. 2019 5 eaau3333 10.1126/sciadv.aau3333 30746447 PMC6357742 37. Kinane D.F. Stathopoulou P.G. Papapanou P.N. Periodontal diseases Nat. Rev. Dis. Primers 2017 3 17038 10.1038/nrdp.2017.38 28805207 38. Lundberg J.O. Weitzberg E. Gladwin M.T. The nitrate–nitrite–nitric oxide pathway in physiology and therapeutics Nat. Rev. Drug Discov. 2008 7 156 167 10.1038/nrd2466 18167491 39. Tribble G.D. Angelov N. Weltman R. Wang B.Y. Eswaran S.V. Gay I.C. Parthasarathy K. Dao D.H.V. Richardson K.N. Ismail N.M. Frequency of tongue cleaning impacts the human tongue microbiome composition and enterosalivary circulation of nitrate Front. Cell. Infect. Microbiol. 2019 9 434270 10.3389/fcimb.2019.00039 PMC6406172 30881924 40. Cespuglio R. Amrouni D. Meiller A. Buguet A. Gautier-Sauvigné S. Nitric oxide in the regulation of the sleep-wake states Sleep. Med. Rev. 2012 16 265 279 10.1016/j.smrv.2012.01.006 22406306 41. Fahy J.V. Dickey B.F. Airway Mucus Function and Dysfunction N. Engl. J. Med. 2010 363 2233 2247 10.1056/NEJMra0910061 21121836 PMC4048736 42. Worbs T. Hammerschmidt S.I. Förster R. Dendritic cell migration in health and disease Nat. Rev. Immunol. 2017 17 30 48 10.1038/nri.2016.116 27890914 43. Whitsett J.A. Alenghat T. Respiratory epithelial cells orchestrate pulmonary innate immunity Nat. Immunol. 2015 16 27 35 10.1038/ni.3045 25521682 PMC4318521 44. Akira S. Uematsu S. Takeuchi O. Pathogen Recognition and Innate Immunity Cell 2006 124 783 801 10.1016/j.cell.2006.02.015 16497588 45. Kawai T. Akira S. The role of pattern-recognition receptors in innate immunity: Update on Toll-like receptors Nat. Immunol. 2010 11 373 384 10.1038/ni.1863 20404851 46. Tanaka T. Narazaki M. Kishimoto T. IL-6 in Inflammation, Immunity, and Disease Cold Spring Harb. Perspect. Biol. 2014 6 a016295 10.1101/cshperspect.a016295 25190079 PMC4176007 47. Wright J.R. Immunoregulatory functions of surfactant proteins Nat. Rev. Immunol. 2005 5 58 68 10.1038/nri1528 15630429 48. Woof J.M. Mestecky J. Mucosal immunoglobulins Immunol. Rev. 2005 206 64 82 10.1111/j.0105-2896.2005.00290.x 16048542 49. Dickson R.P. Erb-Downward J.R. Freeman C.M. McCloskey L. Beck J.M. Huffnagle G.B. Curtis J.L. Spatial Variation in the Healthy Human Lung Microbiome and the Adapted Island Model of Lung Biogeography Ann. Am. Thorac. Soc. 2015 12 821 830 10.1513/AnnalsATS.201501-029OC 25803243 PMC4590020 50. Stroman D.W. Mintun K. Epstein A.B. Brimer C.M. Patel C.R. Branch J.D. Najafi-Tagol K. Reduction in bacterial load using hypochlorous acid hygiene solution on ocular skin Clin. Ophthalmol. 2017 11 707 714 10.2147/OPTH.S132851 28458509 PMC5402722 51. Hong I. Lee H.G. Keum H.L. Kim M.J. Jung U.W. Kim K. Kim S.Y. Park T. Kim H.J. Kim J.J. Clinical and microbiological efficacy of pyrophosphate containing toothpaste: A double-blinded placebo-controlled randomized clinical trial Microorganisms 2020 8 1806 10.3390/microorganisms8111806 33212981 PMC7698517 52. Zayed N. Vertommen R. Simoens K. Bernaerts K. Boon N. Srivastava M.G. Braem A. Van Holm W. Castro A.B. Teughels W. How well do antimicrobial mouth rinses prevent dysbiosis in an in vitro periodontitis biofilm model? J. Periodontol. 2024 95 880 891 10.1002/JPER.23-0674 38946115 53. U.S. Food & Drug Administration 510(k) Premarket Notification—Spectricept Skin and Wound Cleanser (K213514) 2023 Available online: https://www.accessdata.fda.gov/cdrh_docs/pdf21/K213514.pdf (accessed on 3 July 2025) 54. U.S. Food & Drug Administration 510(k) Premarket Notification—Microdacyn Wound Care Solution (K233399) 2024 Available online: https://www.accessdata.fda.gov/cdrh_docs/pdf23/K233399.pdf (accessed on 2 July 2025) 55. Del Rosso J.Q. Bhatia N. Status Report on Topical Hypochlorous Acid: Clinical Relevance of Specific Formulations, Potential Modes of Action, and Study Outcomes J. Clin. Aesthetic Dermatol. 2018 11 36 39 Available online: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6303114/ (accessed on 14 June 2025) PMC6303114 30588272 56. Menta N. Vidal S.I. Friedman A. Hypochlorous Acid: A Blast from the Past J. Drugs Dermatol. 2024 23 909 910 Available online: https://jddonline.com/articles/hypochlorous-acid-blast-past-S1545961624P1024X/ (accessed on 1 September 2025) 39361697 57. Regeno GmbH Patient Information Leaflet “Plasma Liquid Nasal Spray Gel.” Regeno, GmbH Mannheim, Germany 2022 58. Severing A.L. Rembe J.D. Koester V. Stuermer E.K. Safety and efficacy profiles of different commercial sodium hypochlorite/hypochlorous acid solutions (NaClO/HClO): Antimicrobial efficacy, cytotoxic impact and physicochemical parameters in vitro J. Antimicrob. Chemother. 2019 74 365 372 10.1093/jac/dky432 30388236 59. TRGS 900 Arbeitsplatzgrenzwerte Ausschuss für Gefahrstoffe (AGS) Dortmund, Germany 2024 60. Actimaris A.G. Patient Information Leaflet “Actimaris Nasal Spray.” Actimaris, A.G. Appenzell, Switzerland 2020 61. Sismanoglu S. Ercal P. The cytotoxic effects of various endodontic irrigants on the viability of dental mesenchymal stem cells Aust. Endod. J. 2022 48 305 312 10.1111/aej.12570 34590392 62. Mehendale F.V. Clayton G. Homyer K.M. Reynolds D.M. HOCl vs OCl−: Clarification on chlorine-based disinfectants used within clinical settings J. Glob. Health Rep. 2023 7 e2023052 10.29392/001c.84488 63. Benedusi M. Tamburini E. Sicurella M. Summa D. Ferrara F. Marconi P. Cervellati F. Costa S. Valacchi G. The Lesson Learned from the COVID-19 Pandemic: Can an Active Chemical Be Effective, Safe, Harmless-for-Humans and Low-Cost at a Time? Evidence on Aerosolized Hypochlorous Acid Int. J. Environ. Res. Public Health 2022 19 13163 10.3390/ijerph192013163 36293740 PMC9602504 64. Lewandowski R.B. Stȩpińska M. Osuchowski Ł. Kasprzycka W. Dobrzyńska M. Mierczyk Z. Trafny E.A. The HOCl dry fog-is it safe for human cells? PLoS ONE 2024 19 e0304602 10.1371/journal.pone.0304602 38809935 PMC11135740 65. Boecker D. Breves R. Zhang Z. Bulitta C. Antimicrobial Activity in the Gasphase with Hypochloric Acid Curr. Dir. Biomed. Eng. 2021 7 511 514 10.1515/cdbme-2021-2130 66. Rasmussen E.D. Robins L.I. Stone J.R. Williams J.F. Inhalation of Microaerosolized Hypochlorous Acid (HOCl): Biochemical, Antimicrobial, and Pathological Assessment Arch. Intern. Med. Res. 2022 05 311 318 10.26502/aimr.0111 67. Noszticzius Z. Wittmann M. Kály-Kullai K. Beregvári Z. Kiss I. Rosivall L. Szegedi J. Chlorine dioxide is a size-selective antimicrobial agent PLoS ONE 2013 8 e79157 10.1371/journal.pone.0079157 24223899 PMC3818415 68. Leiby K.L. Raredon M.S.B. Niklason L.E. Bioengineering the blood-gas barrier Compr. Physiol. 2020 10 415 452 10.1002/j.2040-4603.2020.tb00124.x 32163210 PMC7366783 69. Qadir Tantry I. Ali A. Mahmood R. Hypochlorous acid decreases antioxidant power, inhibits plasma membrane redox system and pathways of glucose metabolism in human red blood cells Toxicol Res. 2021 10 264 271 10.1093/toxres/tfaa111 PMC8045585 33884176 70. Jin S.J. Piao S. Cha Y.N. Kim C. Taurine chloramine activates Nrf2, increases HO-1 expression and protects cells from death caused by hydrogen peroxide J. Clin. Biochem. Nutr. 2009 45 37 43 10.3164/jcbn.08-262 19590705 PMC2704325 71. Kearns S. Dawson R. Cytoprotective Effect of Taurine Against Hypochlorous Acid Toxicity to PC12 Cells Taurine 4; Advances in Experimental Medicine and Biology Della Corte L. Huxtable R. Sgaragli G. Tipton K. Springer Berlin/Heidelberg, Germany 2002 Volume 483 563 570 10.1007/0-306-46838-7_60 11787641 72. Antosova M. Mokra D. Pepucha L. Plevkova J. Buday T. Sterusky M. Bencova A. Physiology of nitric oxide in the respiratory system Physiol. Res. Czech Acad. Sci. 2017 66 S159 S172 10.33549/physiolres.933673 28937232 73. Storkey C. Davies M.J. Pattison D.I. Reevaluation of the rate constants for the reaction of hypochlorous acid (HOCl) with cysteine, methionine, and peptide derivatives using a new competition kinetic approach Free Radic. Biol. Med. 2014 73 60 66 10.1016/j.freeradbiomed.2014.04.024 24794410 74. Ashby M.T. Carlson A.C. Scott M.J. Redox Buffering of Hypochlorous Acid by Thiocyanate in Physiologic Fluids J. Am. Chem. Soc. 2004 126 15976 15977 10.1021/ja0438361 15584727 75. Cegolon L. Mirandola M. Salaris C. Salvati M.V. Mastrangelo G. Salata C. Hypothiocyanite and Hypothiocyanite/Lactoferrin Mixture Exhibit Virucidal Activity In Vitro against SARS-CoV-2 Pathogens 2021 10 233 10.3390/pathogens10020233 33669635 PMC7922920 76. Bárcena C. Mayoral P. Quirós P.M. Mitohormesis, an Antiaging Paradigm Int. Rev. Cell. Mol. Biol. 2018 340 35 77 10.1016/bs.ircmb.2018.05.002 30072093 77. Merry T.L. Ristow M. Mitohormesis in exercise training Free Radic. Biol. Med. 2016 98 123 130 10.1016/j.freeradbiomed.2015.11.032 26654757 78. McDonnell G. Russell A.D. Antiseptics and Disinfectants: Activity, Action, and Resistance Clin. Microbiol. Rev. 1999 12 147 179 10.1128/CMR.12.1.147 9880479 PMC88911 79. McKenna S.M. Davies K.J.A. The inhibition of bacterial growth by hypochlorous acid. Possible role in the bactericidal activity of phagocytes Biochem. J. 1988 254 685 692 10.1042/bj2540685 2848494 PMC1135139 80. Nadhan R. Patra D. Krishnan N. Rajan A. Gopala S. Ravi D. Srinivas P. Perspectives on mechanistic implications of ROS inducers for targeting viral infections Eur. J. Pharmacol. 2021 890 173621 10.1016/j.ejphar.2020.173621 33068588 PMC7554476 81. Kayesh M.E.H. Kohara M. Tsukiyama-Kohara K. Effects of oxidative stress on viral infections: An overview npj Viruses 2025 3 27 10.1038/s44298-025-00110-3 40295852 PMC11993764 82. Hati S. Bhattacharyya S. Impact of Thiol-Disulfide Balance on the Binding of Covid-19 Spike Protein with Angiotensin-Converting Enzyme 2 Receptor ACS Omega 2020 5 16292 16298 10.1021/acsomega.0c02125 32656452 PMC7346263 83. Karimi M. Crossett B. Cordwell S.J. Pattison D.I. Davies M.J. Characterization of disulfide (cystine) oxidation by HOCl in a model peptide: Evidence for oxygen addition, disulfide bond cleavage and adduct formation with thiols Free Radic. Biol. Med. 2020 154 62 74 10.1016/j.freeradbiomed.2020.04.023 32370994 84. Landino L.M. Lessard E.E. Lactate Dehydrogenase-B Oxidation and Inhibition by Singlet Oxygen and Hypochlorous Acid Oxygen 2024 4 432 448 10.3390/oxygen4040027 85. Lan J. Ge J. Yu J. Shan S. Zhou H. Fan S. Zhang Q. Shi X. Wang Q. Zhang L. Structure of the SARS-CoV-2 spike receptor-binding domain bound to the ACE2 receptor Nature 2020 581 215 220 10.1038/s41586-020-2180-5 32225176 86. Schrödinger L.L.C. The PyMOL Molecular Graphics System 2024 Available online: https://pymol.org (accessed on 23 June 2025) 87. Debnath U. Mitra A. Dewaker V. Prabhakar Y.S. Tadala R. Krishnan K. Wagh P. Velusamy U. Baliyan A. Kurpad A.V. Conformational perturbation of SARS-CoV-2 spike protein using N-acetyl cysteine: An exploration of probable mechanism of action to combat COVID-19 J. Biomol. Struct. Dyn. 2024 42 5042 5052 10.1080/07391102.2023.2234031 37477247 88. Andrés C.M.C. Pérez de la Lastra J.M. Andrés Juan C. Plou F.J. Pérez-Lebeña E. Impact of Reactive Species on Amino Acids—Biological Relevance in Proteins and Induced Pathologies Int. J. Mol. Sci. 2022 23 14049 10.3390/ijms232214049 36430532 PMC9692786 89. Hicks S.N. Chaiwatpongsakorn S. Costello H.M. McLellan J.S. Ray W. Peeples M.E. Five Residues in the Apical Loop of the Respiratory Syncytial Virus Fusion Protein F2 Subunit Are Critical for Its Fusion Activity J. Virol. 2018 92 e00621-18 10.1128/JVI.00621-18 29743373 PMC6052300 90. McLellan J.S. Yang Y. Graham B.S. Kwong P.D. Structure of Respiratory Syncytial Virus Fusion Glycoprotein in the Postfusion Conformation Reveals Preservation of Neutralizing Epitopes J. Virol. 2011 85 7788 7796 10.1128/JVI.00555-11 21613394 PMC3147929 91. McLellan J.S. Chen M. Leung S. Graepel K.W. Du X. Yang Y. Zhou T. Baxa U. Yasuda E. Beaumont T. Crystal Structure of Respiratory Syncytial Virus Fusion Glycoprotein Stabilized in the Prefusion Conformation by Human Antibody D25 Science 2013 340 1113 1117 10.1126/science.1234914 23618766 PMC4459498 92. Florido M. Chiu J. Hogg P.J. Influenza A Virus Hemagglutinin Is Produced in Different Disulfide-Bonded States Antioxid. Redox Signal. 2021 35 1081 1092 10.1089/ars.2021.0033 33985344 93. Yang S. Chuang C.Y. Huang H.C. Fang W. Inactivation of Avian Influenza Virus Aerosol Using Membrane-Less Electrolyzed Water Spraying Aerobiology 2023 1 70 81 10.3390/aerobiology1020006 94. Urushidani M. Kawayoshi A. Kotaki T. Saeki K. Mori Y. Kameoka M. Inactivation of SARS-CoV-2 and influenza A virus by dry fogging hypochlorous acid solution and hydrogen peroxide solution PLoS ONE 2022 17 e0261802 10.1371/journal.pone.0261802 35389997 PMC8989197 95. Zhao Y. Xin H. Zhao D. Zheng W. Tian W. Ma H. Liu K. Hu H. Wang T. Soupir M. Free chlorine loss during spraying of membraneless acidic electrolyzed water and its antimicrobial effect on airborne bacteria from poultry house Ann. Agric. Environ. Med. 2014 21 249 255 10.5604/1232-1966.1108585 24959770 96. Amatore D. Sgarbanti R. Aquilano K. Baldelli S. Limongi D. Civitelli L. Nencioni L. Garaci E. Ciriolo M.R. Palamara A.T. Influenza virus replication in lung epithelial cells depends on redox-sensitive pathways activated by NOX4-derived ROS Cell. Microbiol. 2015 17 131 145 10.1111/cmi.12343 25154738 PMC4311438 97. Venkitanarayanan K.S. Ezeike G.O.I. Hung Y.C. Doyle M.P. Inactivation of Escherichia coli O157:H7 and Listeria monocytogenes on Plastic Kitchen Cutting Boards by Electrolyzed Oxidizing Water J. Food Prot. 1999 62 857 860 10.4315/0362-028X-62.8.857 10456736 98. Kubota A. Goda T. Tsuru T. Yonekura T. Yagi M. Kawahara H. Yoneda A. Tazuke Y. Tani G. Ishii T. Efficacy and safety of strong acid electrolyzed water for peritoneal lavage to prevent surgical site infection in patients with perforated appendicitis Surg. Today 2015 45 876 879 10.1007/s00595-014-1050-x 25387655 99. Fernández L.G. Matthews M.R. Seal L. Intraabdominal Lavage of Hypochlorous Acid: A New Paradigm for the Septic and Open Abdomen Wounds 2020 32 107 114 32155118 100. Kampf G. Antibiotic Resistance Can Be Enhanced in Gram-Positive Species by Some Biocidal Agents Used for Disinfection Antibiotics 2019 8 13 10.3390/antibiotics8010013 30717270 PMC6466599 101. Li K. Deng Z. Lei C. Ding X. Li J. Wang C. The Role of Oxidative Stress in Tumorigenesis and Progression Cells 2024 13 441 10.3390/cells13050441 38474405 PMC10931308 102. Gorrini C. Harris I.S. Mak T.W. Modulation of oxidative stress as an anticancer strategy Nat. Rev. Drug Discov. 2013 12 931 947 10.1038/nrd4002 24287781 103. Bauer G. HOCl and the control of oncogenesis J. Inorg. Biochem. 2018 179 10 23 10.1016/j.jinorgbio.2017.11.005 29156213 104. Leung T.H. Zhang L.F. Wang J. Ning S. Knox S.J. Kim S.K. Topical hypochlorite ameliorates NF-κB-mediated skin diseases in mice J. Clin. Investig. 2013 123 5361 5370 10.1172/JCI70895 24231355 PMC3859383 105. Natarelli N. Nong Y. Maloh J. Sivamani R. Hypochlorous Acid: Applications in Dermatology J. Integr. Dermatol. Available online: https://jintegrativederm.org/article/view/93/17 (accessed on 23 February 2025) 106. Jandova J. Snell J. Hua A. Dickinson S. Fimbres J. Wondrak G.T. Topical hypochlorous acid (HOCl) blocks inflammatory gene expression and tumorigenic progression in UV-exposed SKH-1 high risk mouse skin Redox Biol. 2021 45 102042 10.1016/j.redox.2021.102042 34144392 PMC8217684 107. Snell J.A. Jandova J. Wondrak G.T. Hypochlorous Acid: From Innate Immune Factor and Environmental Toxicant to Chemopreventive Agent Targeting Solar UV-Induced Skin Cancer Front. Oncol. 2022 12 887220 10.3389/fonc.2022.887220 35574306 PMC9106365 108. Zwicker P. Freitag M. Heidel F.H. Kocher T. Kramer A. Antiseptic efficacy of two mouth rinses in the oral cavity to identify a suitable rinsing solution in radiation- or chemotherapy induced mucositis BMC Oral Health 2023 23 176 10.1186/s12903-023-02884-5 36966298 PMC10040117 109. Robins L.I. Keim E.K. Robins D.B. Edgar J.S. Meschke J.S. Gafken P.R. Williams J.F. Modifications of IL-6 by Hypochlorous Acids: Effects on Receptor Binding ACS Omega 2021 6 35593 35599 10.1021/acsomega.1c05297 34984290 PMC8717532 110. Marcinkiewicz J. Grabowska A. Bereta J. Stelmaszynska T. Taurine chloramine, a product of activated neutrophils, inhibits in vitro the generation of nitric oxide and other macrophage inflammatory mediators J. Leukoc. Biol. 1995 58 667 674 10.1002/jlb.58.6.667 7499964 111. Mueller C.A. Winter M. Renner B. A Concept for the Reduction of Mucosal SARS-CoV-2 Load using Hypochloric Acid Solutions Drug Res. 2021 71 348 350 10.1055/a-1467-5956 33890267 112. Mueller C.A. Winter M. Lippert A. Hochauf-Stange K. Renner B. Double-Blind, Randomised, Placebo-Controlled Study to Investigate the Efficacy of Nasal Spray and Mouth Wash Containing Hypochlorous Acid in SARS-CoV-2 Infected Patients; Deutsches Register Klinischer Studien (DRKS) 2022 Available online: https://drks.de/search/de/trial/DRKS00030721 (accessed on 24 April 2024) 113. The Committee on Efficacy Assessment of Disinfecting Substances Alternative to Alcohol for Use Against Severe Acute Respiratory Syndrome Coronavirus 2 (SARS-CoV-2) Final Report on Efficacy Assessment of Disinfecting Substances Alternative to Alcohol for Use Against Severe Acute Respiratory Syndrome Coronavirus 2 (SARS-CoV-2) 2020 Available online: https://www.nite.go.jp/data/000115863.pdf (accessed on 2 July 2025) 114. Park G.W. Boston D.M. Kase J.A. Sampson M.N. Sobsey M.D. Evaluation of liquid- and fog-based application of sterilox hypochlorous acid solution for surface inactivation of human norovirus Appl. Environ. Microbiol. 2007 73 4463 4468 10.1128/AEM.02839-06 17483283 PMC1932820 115. Aherne O. Ortiz R. Fazli M.M. Davies J.R. Effects of stabilized hypochlorous acid on oral biofilm bacteria BMC Oral Health 2022 22 415 10.1186/s12903-022-02453-2 36127658 PMC9487106 116. Nizer WSda C. Inkovskiy V. Overhage J. Surviving reactive chlorine stress: Responses of gram-negative bacteria to hypochlorous acid Microorganisms 2020 8 1220 10.3390/microorganisms8081220 32796669 PMC7464077 117. Posch W. Vosper J. Noureen A. Zaderer V. Witting C. Bertacchi G. Gstir R. Filipek P.A. Bonn G.K. Huber L.A. C5aR inhibition of nonimmune cells suppresses inflammation and maintains epithelial integrity in SARS-CoV-2–infected primary human airway epithelia J. Allergy Clin. Immunol. 2021 147 2083 2097.e6 10.1016/j.jaci.2021.03.038 33852936 PMC8056780 118. Lafon E. Diem G. Witting C. Zaderer V. Bellmann-Weiler R.M. Reindl M. Bauer A. Griesmacher A. Fux V. Hoermann G. Potent SARS-CoV-2-Specific T Cell Immunity and Low Anaphylatoxin Levels Correlate with Mild Disease Progression in COVID-19 Patients Front. Immunol. 2021 12 684014 10.3389/fimmu.2021.684014 34194438 PMC8237940 119. Held A.M. Halko D.J. Hurst J.K. Mechanisms of chlorine oxidation of hydrogen peroxide J. Am. Chem. Soc. 1978 100 5732 5740 10.1021/ja00486a025 120. Hakim H. Thammakarn C. Suguro A. Ishida Y. Kawamura A. Tamura M. Satoh K. Tsujimura M. Hasegawa T. Takehara K. Evaluation of sprayed hypochlorous acid solutions for their virucidal activity against avian influenza virus through in vitro experiments J. Vet. Med. Sci. 2015 77 211 215 10.1292/jvms.14-0413 25421399 PMC4363024 121. Yu M.S. Park H.W. Kwon H.J. Jang Y.J. The Effect of a Low Concentration of Hypochlorous Acid on Rhinovirus Infection of Nasal Epithelial Cells Am. J. Rhinol. Allergy 2011 25 40 44 10.2500/ajra.2011.25.3545 21711976 122. Guan H. Nuth M. Weiss S.R. Fausto A. Liu Y. Koo H. Wolff M.S. Ricciardi R.P. HOCl Rapidly Kills Corona, Flu, and Herpes to Prevent Aerosol Spread J. Dent. Res. 2023 102 1031 1037 10.1177/00220345231169434 37246843 PMC10227542 123. Darie A.M. Khanna N. Jahn K. Osthoff M. Bassetti S. Osthoff M. Schumann D.M. Albrich W.C. Hirsch H. Brutsche M. Fast multiplex bacterial PCR of bronchoalveolar lavage for antibiotic stewardship in hospitalised patients with pneumonia at risk of Gram-negative bacterial infection (Flagship II): A multicentre, randomised controlled trial Lancet Respir. Med. 2022 10 877 887 10.1016/S2213-2600(22)00086-8 35617987 Figure 1 SARS-CoV-2 receptor-binding domain bound to the extracellular domain of the human ACE2-receptor. The receptor-binding domain (RBD) of the spike protein (green) is engaging human ACE2 (cyan) through the receptor-binding motif (RBM, yellow). The cysteine residues C480 and C488 (red), as well as their disulfide bridge, are sterically exposed and critical for ACE2 binding. Structure visualized using PyMOL [ 86 85 ",
  "metadata": {
    "Title of this paper": "Fast multiplex bacterial PCR of bronchoalveolar lavage for antibiotic stewardship in hospitalised patients with pneumonia at risk of Gram-negative bacterial infection (Flagship II): A multicentre, randomised controlled trial",
    "Journal it was published in:": "Viruses",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474219/"
  }
}