{
  "title": "Paper_827",
  "abstract": "pmc Pharmaceuticals (Basel) Pharmaceuticals (Basel) 2102 pharmaceuticals pharmaceuticals Pharmaceuticals 1424-8247 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472684 PMC12472684.1 12472684 12472684 41011257 10.3390/ph18091390 pharmaceuticals-18-01390 1 Systematic Review Survival and Radiotherapy-Related Adverse Events in Patients Receiving Radiotherapy and Concurrent Metformin: A Systematic Review and Meta-Analysis of Randomised Controlled Trials and Cohort Studies Liao Wan-Chuen 1 2 † https://orcid.org/0000-0002-0973-0558 Shokr Hala 1 * † https://orcid.org/0000-0001-5617-9781 Faivre-Finn Corinne 3 4 Dempsey Clare 3 Williams Kaye Janine 1 https://orcid.org/0000-0002-6158-6645 Chen Li-Chia 1 Lu Shuiyu Academic Editor 1 d08450001@ntu.edu.tw kaye.williams@manchester.ac.uk li-chia.chen@manchester.ac.uk 2 3 corinne.finn@nhs.net clare.dempsey@manchester.ac.uk 4 * hala.shokr@manchester.ac.uk † These authors contributed equally to this work. 17 9 2025 9 2025 18 9 497460 1390 19 6 2025 05 9 2025 10 9 2025 17 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background Methods Results Conclusions radiotherapy polypharmacy radiotherapy–drug interaction metformin diabetes mellitus cancer survival outcome adverse effects Cancer Research UK RadNet Manchester C1994/A28701 This work was supported by Cancer Research UK RadNet Manchester [C1994/A28701]. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Metformin is the first-line oral treatment for type 2 diabetes mellitus (T2DM) [ 1 2 3 4 5 6 7 8 9 10 11 12 Radiotherapy is an essential cancer treatment [ 7 13 14 15 16 17 18 12 11 19 20 21 11 19 In addition, the association between metformin use and radiotherapy-related adverse events varied by cancer type and stage. In a retrospective cohort study of 6993 patients with early-stage breast cancer receiving adjuvant breast radiotherapy, metformin users had a significantly reduced risk of radiation-induced cardiac toxicity [ 22 23 The controversial evidence regarding the effects of metformin use in patients receiving radiotherapy may be attributed to variations in other treatments given in combination with radiotherapy, cancer prognoses, and study biases. Currently, there is no consensus on the impact of metformin on outcomes and adverse events in diabetic or non-diabetic patients during radiotherapy. It remains unclear in clinical oncology whether the concurrent use of metformin with radiotherapy raises any additional concerns regarding survival outcomes or the toxicities of radiotherapy. Therefore, this systematic review and meta-analysis aimed to investigate the existing evidence on the impact of metformin on survival outcomes and adverse events in patients with cancer undergoing radiotherapy, thereby clarifying its role in cancer treatment. 2. Materials and Methods This systematic review and meta-analysis followed the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) statement guidelines [ 24 Supplemental S1 2.1. Selection Criteria This study’s inclusion and exclusion criteria are summarised as follows ( Table 1 2.2. Types of Studies Prospective or retrospective cohort studies, cross-sectional studies, and clinical trials were included, whilst case–control studies, case series, case reports, systematic reviews, meta-analyses, conference abstracts, editorials, letters to editors, commentary, and grey literature were excluded. 2.3. Types of Participants Studies enrolled participants aged eighteen and above with histologically confirmed cancer scheduled for radiotherapy. Exclusions were studies with participants under eighteen, mixed age groups, individuals undergoing neoadjuvant radiotherapy or diagnostic radiology, and cancers not indicated for radiotherapy. 2.4. Types of Interventions Patients who received metformin orally, either as monotherapy or in combination with other medications (e.g., chemotherapy), during the course of radiotherapy were included. Patients not using metformin concurrently during radiotherapy were excluded. 2.5. Types of Outcome Measures Studies evaluating survival outcomes and radiotherapy-related side effects were included. Survival outcomes encompassed survival or recurrence results. Radiotherapy-related adverse events occurring during or immediately after radiotherapy were included. Any radiation-related toxicity that occurred before the administration of metformin was not considered. 2.6. Data Sources and Search Strategies A comprehensive electronic database search was conducted on MEDLINE, EMBASE, Web of Science, Scopus, and PubMed from January 2000 to 10 August 2025. The search start date was determined based on a preliminary search indicating that relevant literature emerged after 2000. Various structured search strategies were employed ( Supplemental S2 Table 1 2.7. Study Selection Two reviewers (WCL and HS) independently screened titles and abstracts of articles retrieved from electronic database searches based on predefined selection criteria ( Table 1 25 2.8. Data Extraction and Management Two reviewers (WCL and HS) independently extracted data from each study using a standardised and piloted electronic data extraction sheet. Discrepancies were resolved by a third reviewer (LCC). Extracted information included the study title, lead author, country, publication year, study design, setting, targeted population (disease and cancer stages), intervention (metformin exposure), comparison, outcome measures, and follow-up period. Study results were retrieved, including the number of numerator and denominator of survival outcomes and the proportion of adverse events during or immediately after radiotherapy. If raw data were unavailable, the mean (with standard deviation) or median (range) of survival duration, or any other results convertible into raw data, were extracted. 2.9. Risk of Bias Assessment Quality assessment of all included studies was conducted using the Cochrane Risk of Bias Assessment Tool (RoB 2) for randomised controlled trials (RCTs) and the Risk of Bias in Non-randomised Studies of Interventions tool (ROBINS-I) for non-randomised studies [ 26 27 2.10. Data Analysis All outcomes were compared between metformin-exposed (users) and non-exposed (non-users) groups, with consideration of diabetic status categorised into five groups, including “not specified (NS)”, indicating mixed populations ( Supplemental S1 28 The primary outcome is pooled effect sizes for overall survival rates presented as ORs with 95%CIs. Radiotherapy-related adverse events were tabulated with OR (95%CI) and categorised by cancer type in pooled results. Effect sizes for survival outcomes and radiotherapy-related adverse events were synthesised using a random-effects model (Der-Simonian and Laird method) [ 29 I 2 Other survival rate outcomes were presented by OR and 95%CI across groups. Pooled effect sizes (OR and 95%CI) were calculated for progression-free, distant metastasis-free, disease-free survival, distant metastasis, locoregional recurrence, and biochemical failure rates when data were available. Meta-analyses and meta-regression were conducted using STATA (Release 14, College Station, TX, USA: StataCorp LLC). A p 3. Results 3.1. Selection of Study Of the 2415 records identified, 622 duplicates and 1756 irrelevant records were removed, leaving 37 articles for full-text screening. Exclusions were due to unrelated topics (n = 1217), non-human studies (n = 352), non-original studies (n = 176), and studies involving non-adult populations (n = 11). Twelve articles were excluded, resulting in 25 studies (20,953 patients) analysed ( Figure 1 3.2. Characteristics of Included Studies The 25 included studies comprised 20 cohort studies [ 11 19 22 23 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 20 21 46 47 48 30 31 34 35 36 38 41 46 19 20 21 40 45 47 48 22 32 11 23 33 37 39 42 43 44 Table 2 11 19 23 31 32 33 35 36 37 38 39 40 41 43 44 45 20 21 32 46 47 48 22 30 34 42 Supplemental S3 11 19 20 21 31 33 37 38 39 40 41 43 44 46 47 48 11 19 32 33 37 38 39 40 41 43 44 22 23 30 34 35 36 42 45 19 21 23 30 31 33 37 38 39 42 43 44 45 47 48 30 31 46 20 21 47 22 32 23 3.3. Quality Assessment Among the five RCTs, three were flagged for potential bias related to varying cancer stages influencing the outcome (n = 3) [ 20 46 48 20 46 47 21 47 21 21 Supplemental S4 Using the ROBINS-I tool, ten cohort studies had a serious risk of bias [ 11 23 32 33 34 36 38 40 41 42 34 36 38 41 42 11 23 32 34 42 11 33 34 33 42 Supplemental S5 3.4. Overall Survival Rates No significant differences were found in overall survival rates between metformin users and non-users across diabetic status categories (pooled odds ratio [OR] ranged from 1.00 to 1.77) despite heterogeneity in several groups ( I 2 Table 3 Supplemental S6 However, a significant correlation between overall survival and cancer type was observed in studies involving patients with unspecified diabetes mellitus (DM) status (Group 1, n = 5), with a meta-regression coefficient of β = −0.99 (95%CI: −1.95, −0.02; p p No significant correlation with cancer type was found in studies where both metformin users and non-users had DM (Group 3, n = 6). For Group 2 (metformin users with DM vs. non-users with unspecified DM status), only two studies were available, which were insufficient for meta-regression analysis. Group 5 included only NSCLC studies comparing metformin users and non-users without DM (n = 3), limiting the ability to assess cancer-type correlations in this subgroup. 3.5. Cancer Progression Outcomes Likewise, substantial heterogeneity and no significant differences were found between metformin users and non-users in the pooled progression-free ( I 2 I 2 I 2 I 2 Table 4 In one study of NSCLC, metformin users with DM had a significantly lower progression rate (OR: 0.50; 95%CI: 0.29, 0.87) compared to non-users with unspecified DM condition [ 45 Supplemental S7 11 19 45 19 40 40 19 40 40 19 19 Supplemental S7 Significant correlations with cancer type were observed only in the distant metastasis-free survival rates (β: −1.68; 95%CI: −2.26, −1.10; p 3.6. Other Survival Outcome Measures Metformin users with DM presented a significantly lower overall prostate cancer mortality rate than non-users with (OR: 0.22; 95%CI: 0.13, 0.37) or without DM (OR: 0.67; 95%CI: 0.46, 0.97) [ 41 Supplemental S6 35 Median survival times varied across studies. Metformin users with DM had a longer median survival time than non-users with unspecified conditions and NSCLC (n = 1) [ 45 19 Supplemental S7 3.7. Radiotherapy-Related Adverse Events The pooled results were presented if the same adverse events were reported in different studies. However, most of them were elucidated separately and diversely with OR and 95%CI by a single study. Overall, there was no significant difference between metformin users and non-users in the pooled results of acute gastrointestinal toxicity in patients with prostate cancer. In addition, there was no significant difference between metformin users and non-users in grade ≥3 nausea and vomiting in patients with head and neck SCC and NSCLC ( Table 5 23 4. Discussion This study investigated whether concurrent metformin use positively or negatively impacts survival outcomes and adverse events in patients with cancer receiving radiotherapy, aiming to inform oncology practices. Based on the current clinical evidence, there was no significant difference in overall survival rates between metformin users and non-users, even when categorising them into different diabetes mellitus status subgroups. However, the type of cancer influenced survival rates differently across these subcategories, suggesting that the DM condition might affect them. Interestingly, within the limited adverse event reports, metformin showed significant benefits in reducing radiotherapy-related adverse events, particularly in heart failure and all heart events among patients with breast cancer. The conflicting results regarding the effect of metformin on cancer radiotherapy outcomes in our study align with findings from past research [ 49 50 51 52 The unexpected lack of a consistently significant effect of metformin in observational cohort studies and RCTs may have resulted from unavoidable confounding factors or variations among the studied participants. As substantial heterogeneity exists among the included studies, this may mask metformin’s efficacy due to differences in cancer types, grades, and stages [ 19 41 52 19 40 19 49 53 54 52 51 55 Rates of adverse events did not significantly differ between metformin users and non-users in this study. Only patients with early-stage breast cancer showed a reduced risk of heart failure and all heart events in one retrospective cohort study [ 22 21 32 23 31 31 23 This study’s strengths lie in its comprehensive search and inclusion of current evidence on metformin’s effect in patients undergoing radiotherapy for various cancers, allowing for pooled result analysis. We analysed 25 studies (20 retrospective cohort studies and five RCTs), surpassing a previous meta-analysis from 2018, which included only 17 retrospective cohort studies and DM patients [ 56 The primary limitation of this study is the inclusion of mainly retrospective observational cohort studies, which are susceptible to bias in confounding and selection of reported results. This poses a moderate to serious risk of bias and may influence the outcomes. However, five RCTs were included; two were identified as having a high risk of bias, and small sample sizes with missing outcome data introduce uncertainty into the interpretation. Additionally, all participants in the metformin user and non-user groups of these trials did not have DM, which distinguished them from other observational cohort studies regarding patients’ characteristics. Although subgroup analyses were conducted by DM status and cancer type, stratification by study design (i.e., separating RCTs from cohort studies) was not feasible due to limited sample sizes. Future studies with larger datasets should consider this approach to better address heterogeneity and improve interpretability. Most studies included in this meta-analysis identified patients as having DM as well as reported metformin use, but few provided details on the timing of DM diagnosis or the sequence of antidiabetic treatments. The lack of consistent reporting on these factors may contribute to heterogeneity in outcomes and limit the ability to fully understand metformin’s effects in the context of DM duration and treatment lines. In addition, cardiovascular comorbidities or specific treatments related to macrovascular complications among patients with DM could impact the results. Still, they could not be thoroughly investigated due to unavailable data, which were not consistently reported in the included literature. Since the included studies mainly focused on radiotherapy outcomes and did not elucidate patient characteristics regarding glycaemic control or other metabolic parameters, the specific effects of metformin, independent of overall DM management, could not be thoroughly assessed. Despite our best efforts to consider patients’ DM status by grouping them, only one type of cancer (NSCLC) was included in group 5, where both metformin users and non-users were without DM. This limited the analysis of the prophylactic effect of metformin in non-diabetic patients compared to non-users across different types of cancer. Besides, more studies focused on two types of common cancers, prostate cancer (n = 8) and NSCLC (n = 7), potentially affecting the analysis results. Divergent reporting of adverse events also precluded meta-analysis for pooled results. Finally, this study is constrained by the data and indicators reported in the included studies. The diverse and sometimes conflicting results from past research on metformin’s effect on patients with cancer undergoing radiotherapy highlight the need for more rigorous and well-structured future studies. RCTs offer maximum control over confounding factors but present challenges relating to cost, ethical considerations, and participant recruitment [ 57 12 As the impact of metformin in the context of cancer treatment remains uncertain, the challenges of polypharmacy in patients with cancer highlight the lack of evidence to guide oncology practice. Studying interactions between different treatments, particularly drugs and radiotherapy, is complex. This study will help guide discussions with patients. Based on the presented evidence, diabetic patients with cancer taking metformin and treated with radiotherapy are not expected to experience a significant impact on the outcome of the medication. For non-diabetic patients with cancer treated with radiotherapy, there is currently insufficient evidence to support metformin prophylaxis for improving survival outcomes or mitigating radiotherapy-related side effects. 5. Conclusions In conclusion, this study found that metformin had no significant impact on radiotherapy survival outcomes regardless of patients’ DM status. Metformin may reduce heart-related adverse events in patients with breast cancer, but this finding is based on limited data and should be interpreted cautiously. Whilst the type of cancer may influence the overall survival rate between metformin users and non-users, inconsistent findings under different DM conditions warrant further research. Acknowledgments The authors thank Douglas Steinke for his insightful discussions, Tony Wei for data extraction and technical support, Claire Hodkinson from the University of Manchester Library for refining search strategies, and Abi Henshall for her guidance on journal surveys. Corinne Faivre-Finn was supported by the NIHR Manchester Biomedical Research Centre. Wan-Chuen Liao acknowledges the National Science and Technology Council, Taiwan, for supporting her Overseas Project for Postgraduate Research (112-2917-I-002-025) at the University of Manchester from 2023 to 2024. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/ph18091390/s1 58 Author Contributions L.-C.C. and H.S. led and supervised the project. Conceptualisation: L.-C.C., H.S., C.F.-F., C.D., and K.J.W. Methodology: L.-C.C., H.S., and W.-C.L. Validation: L.-C.C., H.S., C.F.-F., C.D., and K.J.W. Formal analysis: L.-C.C., H.S., and W.-C.L. Writing—original draft: L.-C.C., H.S., and W.-C.L. Writing—review and editing: L.-C.C., H.S., C.F.-F., C.D., and K.J.W. Visualisation: L.-C.C., H.S., C.F.-F., C.D., K.J.W., and W.-C.L. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The protocol has been registered at PROSPERO (no. CRD42023487336). Informed Consent Statement Not applicable. Data Availability Statement No new data were created or analysed in this study. Conflicts of Interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. References 1. Baker C. Retzik-Stahr C. Singh V. Plomondon R. Anderson V. Rasouli N. Should metformin remain the first-line therapy for treatment of type 2 diabetes? Ther. Adv. Endocrinol. Metab. 2021 12 2042018820980225 10.1177/2042018820980225 33489086 PMC7809522 2. Alrashed F.A. Iqbal M. Alsubiheen A.M. Ahmad T. Exploring determinants of sex and family history-based disparity in type 2 diabetes mellitus prevalence among clinical patients BMC Public Health 2024 24 682 10.1186/s12889-024-18170-0 38438994 PMC10913685 3. Papadakos S.P. Argyrou A. Lekakis V. Arvanitakis K. Kalisperati P. Stergiou I.E. Konstantinidis I. Schizas D. Koufakis T. Germanidis G. Metformin in esophageal carcinoma: Exploring molecular mechanisms and therapeutic insights Int. J. Mol. Sci. 2024 25 2978 10.3390/ijms25052978 38474224 PMC10932447 4. Viollet B. Guigas B. Garcia N.S. Leclerc J. Foretz M. Andreelli F. Cellular and molecular mechanisms of metformin: An overview Clin. Sci. 2012 122 253 270 10.1042/CS20110386 22117616 PMC3398862 5. Jalving M. Gietema J.A. Lefrandt J.D. de Jong S. Reyners A.K. Gans R.O. de Vries E.G. Metformin: Taking away the candy for cancer? Eur. J. Cancer 2010 46 2369 2380 10.1016/j.ejca.2010.06.012 20656475 6. Marini C. Cossu V. Bauckneht M. Lanfranchi F. Raffa S. Orengo A.M. Ravera S. Bruno S. Sambuceti G. Metformin and cancer glucose metabolism: At the bench or at the bedside? Biomolecules 2021 11 1231 10.3390/biom11081231 34439897 PMC8392176 7. Agbele A.T. Faromika O.P. Awe O.O. Amodu F.R. Edaogbogun G.O. Bello K.A. Impact of metformin on the therapeutic effect of radiotherapy Radiat. Med. Prot. 2021 2 17 22 10.1016/j.radmp.2020.12.002 8. Morales D.R. Morris A.D. Metformin in cancer treatment and prevention Annu. Rev. Med. 2015 66 17 29 10.1146/annurev-med-062613-093128 25386929 9. Zi F. Zi H. Li Y. He J. Shi Q. Cai Z. Metformin and cancer: An existing drug for cancer prevention and therapy Oncol. Lett. 2018 15 683 690 10.3892/ol.2017.7412 29422962 PMC5772929 10. Saraei P. Asadi I. Kakar M.A. Moradi-Kor N. The beneficial effects of metformin on cancer prevention and therapy: A comprehensive review of recent advances Cancer Manag. Res. 2019 11 3295 3313 10.2147/CMAR.S200059 31114366 PMC6497052 11. Adeberg S. Bernhardt D. Ben Harrabi S. Bostel T. Mohr A. Koelsche C. Diehl C. Rieken S. Debus J. Metformin influences progression in diabetic glioblastoma patients Strahlenther. Onkol. 2015 191 928 935 10.1007/s00066-015-0884-5 26329695 12. Yu O.H.Y. Suissa S. Metformin and cancer: Solutions to a real-world evidence failure Diabetes Care 2023 46 904 912 10.2337/dci22-0047 37185680 13. Mee T. Kirkby N.F. Defourny N.N. Kirkby K.J. Burnet N.G. The use of radiotherapy, surgery and chemotherapy in the curative treatment of cancer: Results from the FORTY (Favourable Outcomes from RadioTherapY) project Br. J. Radiol. 2023 96 20230334 10.1259/bjr.20230334 37807934 PMC10646636 14. Marks L.B. Yu X. Vujaskovic Z. Small W. Jr. Folz R. Anscher M.S. Radiation-induced lung injury Semin. Radiat. Oncol. 2003 13 333 345 10.1016/S1053-4296(03)00034-1 12903021 15. De Ruysscher D. Niedermann G. Burnet N.G. Siva S. Lee A.W.M. Hegi-Johnson F. Radiotherapy toxicity Nat. Rev. Dis. Primers 2019 5 13 Erratum in Nat. Rev. Dis. Primers 2019 5 10.1038/s41572-019-0064-5 30792503 16. Werner-Wasik M. Pequignot E. Leeper D. Hauck W. Curran W. Predictors of severe esophagitis include use of concurrent chemotherapy, but not the length of irradiated esophagus: A multivariate analysis of patients with lung cancer treated with nonoperative therapy Int. J. Radiat. Oncol. Biol. Phys. 2000 48 689 696 10.1016/S0360-3016(00)00699-4 11020565 17. Bharath L.P. Nikolajczyk B.S. The intersection of metformin and inflammation Am. J. Physiol. Cell Physiol. 2021 320 C873 C879 10.1152/ajpcell.00604.2020 33689478 PMC8163577 18. Zhang K. Bai P. Dai H. Deng Z. Metformin and risk of cancer among patients with type 2 diabetes mellitus: A systematic review and meta-analysis Prim. Care Diabetes 2021 15 52 58 10.1016/j.pcd.2020.06.001 32605879 19. Ahmed I. Ferro A. Cohler A. Langenfeld J. Surakanti S.G. Aisner J. Zou W. Haffty B.G. Jabbour S.K. Impact of metformin use on survival in locally-advanced, inoperable non-small cell lung cancer treated with definitive chemoradiation J. Thorac. Dis. 2015 7 346 355 10.3978/j.issn.2072-1439.2014.12.32 25922712 PMC4387400 20. Chun S.G. Liao Z. Jeter M.D. Chang J.Y. Lin S.H. Komaki R.U. Guerrero T.M. Mayo R.C. Korah B.M. Koshy S.M. Metabolic responses to metformin in inoperable early-stage non–small cell lung cancer treated with stereotactic radiotherapy: Results of a randomised phase II clinical trial Am. J. Clin. Oncol. 2020 43 231 235 10.1097/COC.0000000000000632 31990759 21. Tsakiridis T. Pond G.R. Wright J. Ellis P.M. Ahmed N. Abdulkarim B. Roa W. Robinson A. Swaminath A. Okawara G. Metformin in combination with chemoradiotherapy in locally advanced non-small cell lung cancer: The OCOG-ALMERA randomised clinical trial JAMA Oncol. 2021 7 1333 1341 10.1001/jamaoncol.2021.2328 34323924 PMC8323053 22. Yu J.M. Hsieh M.C. Qin L. Zhang J. Wu S.Y. Metformin reduces radiation-induced cardiac toxicity risk in patients having breast cancer Am. J. Cancer Res. 2019 9 1017 1026 31218109 PMC6556611 23. Chang P.H. Yeh K.Y. Wang C.H. Chen E.Y. Yang S.W. Chou W.C. Hsieh J.C. Impact of metformin on patients with advanced head and neck cancer undergoing concurrent chemoradiotherapy Head Neck 2017 39 1573 1577 10.1002/hed.24793 28449193 24. Liberati A. Altman D.G. Tetzlaff J. Mulrow C. Gøtzsche P.C. Ioannidis J.P. Clarke M. Devereaux P.J. Kleijnen J. Moher D. The PRISMA statement for reporting systematic reviews and meta-analyses of studies that evaluate health care interventions: Explanation and elaboration Ann. Intern. Med. 2009 151 W65 W94 10.7326/0003-4819-151-4-200908180-00136 19622512 25. Koo T.K. Li M.Y. A guideline of selecting and reporting intraclass correlation coefficients for reliability research J. Chiropr. Med. 2016 15 155 163 10.1016/j.jcm.2016.02.012 27330520 PMC4913118 26. Sterne J.A. Hernán M.A. Reeves B.C. Savović J. Berkman N.D. Viswanathan M. Henry D. Altman D.G. Ansari M.T. Boutron I. ROBINS-I: A tool for assessing risk of bias in non-randomised studies of interventions BMJ 2016 355 i4919 10.1136/bmj.i4919 27733354 PMC5062054 27. Sterne J.A.C. Savović J. Page M.J. Elbers R.G. Blencowe N.S. Boutron I. Cates C.J. Cheng H.Y. Corbett M.S. Eldridge S.M. RoB 2: A revised tool for assessing risk of bias in randomised trials BMJ 2019 366 l4898 10.1136/bmj.l4898 31462531 28. Lipitz-Snyderman A. Curry M.A. Rubin D.M. Li D.G. Duck E. Radzyner M.H. Bach P. A conundrum in cancer quality measurement: Performance on long-term survival reflects performance a long time ago J. Clin. Oncol. 2019 37 e18222 10.1200/JCO.2019.37.15_suppl.e18222 29. Kontopantelis E. Reeves D. Metaan: Random-effects meta-analysis Stata J. 2010 10 395 407 10.1177/1536867X1001000307 30. Cadeddu G. Hervás-Morón A. Martín-Martín M. Pelari-Mici L. Ytuza-Charahua de Kirsch K. Hernández-Corrales A. Vallejo-Ocaña C. Sastre-Gallego S. Carrasco-Esteban E. Sancho-García S. Metformin and statins: A possible role in high-risk prostate cancer Rep. Pract. Oncol. Radiother. 2020 25 163 167 10.1016/j.rpor.2019.12.027 32021570 PMC6994275 31. Dağdelen M. Barlas C. Yıldırım C. Karaçam S.Ç. Dinçbaş H. Effect of diabetes mellitus and metformin usage on treatment outcomes and side effects on prostate cancer treated with radical radiotherapy Üroonkoloji Bülteni 2021 20 162 167 10.4274/uob.galenos.2020.1830 32. Ferro A. Goyal S. Kim S. Wu H. Taunk N.K. Schiff D. Pirlamarla A. Haffty B.G. Evaluation of diabetic patients with breast cancer treated with metformin during adjuvant radiotherapy Int. J. Breast Cancer 2013 2013 659723 10.1155/2013/659723 24416595 PMC3876696 33. Jang W.I. Kim M.S. Lim J.S. Yoo H.J. Seo Y.S. Han C.J. Park S.C. Kay C.S. Kim M. Jang H.S. Survival advantage associated with metformin usage in hepatocellular carcinoma patients receiving radiotherapy: A propensity score matching analysis Anticancer Res. 2015 35 5047 5054 26254406 34. Li K. Si-Tu J. Qiu J. Lu L. Mao Y. Zeng H. Chen M. Lai C. Chang H.-J. Wang D. Statin and metformin therapy in prostate cancer patients with hyperlipidemia who underwent radiotherapy: A population-based cohort study Cancer Manag. Res. 2019 11 1189 1197 10.2147/CMAR.S166638 30787638 PMC6366348 35. Liu X. Li J. Schild S.E. Schild M.H. Wong W. Vora S. Herman M.G. Fatyga M. Statins and metformin use is associated with lower PSA levels in prostate cancer patients presenting for radiation therapy J. Cancer Ther. 2017 8 73 85 10.4236/jct.2017.82007 28239505 PMC5325211 36. Ranasinghe W.K. Williams S. Ischia J. Wetherell D. Baldwin G. Shulkes A. Sengupta S. Bolton D. Patel O. Metformin may offer no protective effect in men undergoing external beam radiation therapy for prostate cancer BJU Int. 2019 123 36 42 10.1111/bju.14709 31012989 37. Skinner H.D. Crane C.H. Garrett C.R. Eng C. Chang G.J. Skibber J.M. Rodriguez-Bigas M.A. Kelly P. Sandulache V.C. Delclos M.E. Metformin use and improved response to therapy in rectal cancer Cancer Med. 2013 2 99 107 10.1002/cam4.54 24133632 PMC3797563 38. Spratt D.E. Zhang C. Zumsteg Z.S. Pei X. Zhang Z. Zelefsky M.J. Metformin and prostate cancer: Reduced development of castration-resistant disease and prostate cancer mortality Eur. Urol. 2013 63 709 716 10.1016/j.eururo.2012.12.004 23287698 PMC4034673 39. Spratt D.E. Beadle B.M. Zumsteg Z.S. Rivera A. Skinner H.D. Osborne J.R. Garden A.S. Lee N.Y. The influence of diabetes mellitus and metformin on distant metastases in oropharyngeal cancer: A multicenter study Int. J. Radiat. Oncol. Biol. Phys. 2016 94 523 531 10.1016/j.ijrobp.2015.11.007 26867881 PMC4993040 40. Stang K. Alite F. Adams W. Altoos B. Small C. Melian E. Emami B. Harkenrider M. Impact of concurrent coincident use of metformin during lung stereotactic body radiation therapy Cureus 2021 13 e14157 10.7759/cureus.14157 33927955 PMC8076758 41. Taira A.V. Merrick G.S. Galbreath R.W. Morris M. Butler W.M. Adamovich E. Metformin is not associated with improved biochemical free survival or cause-specific survival in men with prostate cancer treated with permanent interstitial brachytherapy J. Contemp. Brachyther. 2014 6 254 261 10.5114/jcb.2014.45757 PMC4200187 25337126 42. Takiuchi T. Machida H. Hom M.S. Mostofizadeh S. Frimer M. Brunette L.L. Matsuo K. Association of metformin use and survival outcome in women with cervical cancer Int. J. Gynecol. Cancer 2017 27 1455 1463 10.1097/IGC.0000000000001036 29049093 PMC7526033 43. Tsou Y.A. Chang W.D. Lu J.J. Wu T.F. Chen H.L. Chen C.M. Tsai M.H. The effect of metformin use on hypopharyngeal squamous cell carcinoma in diabetes mellitus patients BMC Cancer 2019 19 862 10.1186/s12885-019-6083-5 31470817 PMC6716861 44. Van De Voorde L. Janssen L. Larue R. Houben R. Buijsen J. Sosef M. Vanneste B. Schraepen M.-C. Berbée M. Lambin P. Can metformin improve ‘the tomorrow’of patients treated for oesophageal cancer? Eur. J. Surg. Oncol. 2015 41 1333 1339 10.1016/j.ejso.2015.05.012 26091848 45. Wink K.C. Belderbos J.S. Dieleman E.M. Rossi M. Rasch C.R. Damhuis R.A. Houben R.M. Troost E.G. Improved progression free survival for patients with diabetes and locally advanced non-small cell lung cancer (NSCLC) using metformin during concurrent chemoradiotherapy Radiother. Oncol. 2016 118 453 459 10.1016/j.radonc.2016.01.012 26861738 46. Kim J.O. McDonald M.O. Ong A. Koul R. Dubey A. Hunter W. Ahmed S. Quon H. Yee D. Parliament M. Gastrointestinal and genitourinary toxicity profiles of metformin versus placebo in men with prostate cancer receiving prostate radiotherapy: Interim toxicity results of a double-blinded, multicenter, phase II randomised controlled trial Radiat. Oncol. 2021 16 212 10.1186/s13014-021-01935-x 34736499 PMC8567697 47. Skinner H. Hu C. Tsakiridis T. Santana-Davila R. Lu B. Erasmus J.J. Doemer A.J. Videtic G.M. Coster J. Yang A.X. Addition of metformin to concurrent chemoradiation in patients with locally advanced non-small cell lung cancer: The NRG-LU001 phase 2 randomised clinical trial JAMA Oncol. 2021 7 1324 1332 10.1001/jamaoncol.2021.2318 34323922 PMC8323052 48. Tate M.K. Hernandez M. Chang J.Y. Lin S.H. Liao Z. Koshy S.M. Skinner H.D. Chun S.G. Metformin in conjunction with stereotactic radiotherapy for early-stage non-small cell lung cancer: Long-term results of a prospective phase II clinical trial Anticancer Res. 2024 44 133 137 10.21873/anticanres.16795 38159979 PMC11663441 49. Samsuri N.A.B. Leech M. Marignol L. Metformin and improved treatment outcomes in radiation therapy—A review Cancer Treat. Rev. 2017 55 150 162 10.1016/j.ctrv.2017.03.005 28399491 50. Chevalier B. Pasquier D. Lartigau E.F. Chargari C. Schernberg A. Jannin A. Mirabel X. Vantyghem M.-C. Escande A. Metformin: (future) best friend of the radiation oncologist? Radiother. Oncol. 2020 151 95 105 10.1016/j.radonc.2020.06.030 32592892 51. Wen J. Yi Z. Chen Y. Huang J. Mao X. Zhang L. Zeng Y. Cheng Q. Ye W. Liu Z. Efficacy of metformin therapy in patients with cancer: A meta-analysis of 22 randomised controlled trials BMC Med. 2022 20 402 10.1186/s12916-022-02599-4 36280839 PMC9594974 52. Coyle C. Cafferty F.H. Vale C. Langley R.E. Metformin as an adjuvant treatment for cancer: A systematic review and meta-analysis Ann. Oncol. 2016 27 2184 2195 10.1093/annonc/mdw410 27681864 PMC5178140 53. Zannella V.E. Pra A.D. Muaddi H. McKee T.D. Stapleton S. Sykes J. Glicksman R. Chaib S. Zamiara P. Milosevic M. Reprogramming metabolism with metformin improves tumor oxygenation and radiotherapy response Clin. Cancer Res. 2013 19 6741 6750 10.1158/1078-0432.CCR-13-1787 24141625 54. Yao X. Liu H. Xu H. The impact of metformin use with survival outcomes in urologic cancers: A systematic review and meta-analysis Biomed. Res. Int. 2021 2021 5311828 10.1155/2021/5311828 34660791 PMC8519697 55. Buzzai M. Jones R.G. Amaravadi R.K. Lum J.J. DeBerardinis R.J. Zhao F. Viollet B. Thompson C.B. Systemic treatment with the antidiabetic drug metformin selectively impairs p53-deficient tumor cell growth Cancer Res. 2007 67 6745 6752 10.1158/0008-5472.CAN-06-4447 17638885 56. Rao M. Gao C. Guo M. Law B.Y.K. Xu Y. Effects of metformin treatment on radiotherapy efficacy in patients with cancer and diabetes: A systematic review and meta-analysis Cancer Manag. Res. 2018 10 4881 4890 10.2147/CMAR.S174535 30425579 PMC6205529 57. Bulpitt C.J. The advantages and disadvantages of randomised controlled trials Randomised Controlled Clinical Trials Springer Boston, MA, USA 1996 379 385 10.1007/978-1-4615-6347-1_20 58. Page M.J. McKenzie J.E. Bossuyt P.M. Boutron I. Hoffmann T.C. Mulrow C.D. Shamseer L. Tetzlaff J.M. Akl E.A. Brennan S.E. The PRISMA 2020 statement: An updated guideline for reporting systematic reviews BMJ 2021 372 n71 10.1136/bmj.n71 33782057 PMC8005924 Figure 1 Selection of studies. pharmaceuticals-18-01390-t001_Table 1 Table 1 Inclusion and exclusion criteria of this study. Component Inclusion Criteria Exclusion Criteria Population and conditions  Patients aged 18 years and above. Patients diagnosed with histologically confirmed cancer (newly diagnosed or recurrent) are scheduled to receive radiotherapy.  Patients include paediatrics, children, adolescents, neonates, and infants. Studies involved mixed-age groups. Neoadjuvant radiotherapy or diagnostic radiology (e.g., X-rays, magnetic resonance images). Patients with cancer types not amenable to radiotherapy. Intervention and comparator Oral administration of metformin, either alone or in combination with other drugs, such as chemotherapy.  Non-concurrent use of metformin and radiotherapy (not during the radiotherapy cycles). Outcome  Survival outcomes included overall survival and other related results. Adverse events occurred during or right after the radiotherapy.  Radiation-related toxicity occurred before the administration of metformin. Study type Human studies. Animal or in vitro studies. Language English. Other languages without English translation. Publication Full-text article on prospective or retrospective cohort study, cross-sectional study, and clinical trial. Case-control study, case series, case report, systematic review, meta-analysis, conference abstract, abstract without full article, editorial, letter to editors, commentary, and grey literature. pharmaceuticals-18-01390-t002_Table 2 Table 2 Characteristics of included studies. Author, Year, Country Cancer Types of Radiation Radiation Dose (Gy) Number of Patients Age of Patients (Year) Outcome Category Total Metformin Users Non-User DM (+) DM (−) DM (+) § DM (−) Ferro, 2013, US [ 32 Breast cancer WBI or external-beam partial-breast irradiation Range: 45, 50 130 51 51 28  Mean (range): 60 (27, 83) RT-related side effects Skinner, 2013, US [ 37 Rectal cancer CRT Median (range): 50.4 (20, 63) 482 20  40 422 Median (range): 58 (19, 84) Survival outcomes Spratt, 2013, US [ 38 Prostate cancer EBRT NA 2901 157  162 2582 Median (IQR): 69 (64, 73) Survival outcomes Taira, 2014, US [ 41 Prostate cancer Interstitial brachytherapy NA 2298 126  144 2028 Mean ± SD: 65.3 ± 7.4 Survival outcomes Adeberg, 2015, Germany [ 11 Primary glioblastoma RT Median (range): 60.0 (36.0, 68.0) 276 20  20 236 Median (range): 63.0 (17.2, 86.6) Survival outcomes Ahmed, 2015, US [ 19 NSCLC Thoracic RT Median (range): 62 (60, 66) 166 20  20 126 Median (range): 65 (24, 86) Survival outcomes Jang, 2015, Korea [ 33 Hepatocellular carcinoma SBRT or hypofractionated RT Range: 25, 60 217 19  29 169 NA Survival outcomes Van De Voorde, 2015, Netherlands [ 44 Oesophageal cancer EBRT Median (NA): 41.4 (NA) or 50.4 (NA) 196 19  5 172 Mean (range): 63 (37, 82) Survival outcomes Spratt, 2016, US [ 39 Oropharyngeal cancer EBRT Median (IQR): 69.96 (66, 70) 1745 102  82 1561 Median (range): 56 (25, 91) Survival outcomes Wink, 2016, Germany [ 45 Locally advanced NSCLC CRT Median (range): 66.1 (50, 129.6) 682 59   Non-user ¶ Median (range): 63 (29, 87) Survival outcomes Chang, 2017, Taiwan [ 23 Head and neck SCC CRT Range: 70, 74 252 39   Non-user ¶ Median (range): 55 (26, 83) Survival outcomes Liu, 2017, US [ 35 Prostate cancer RT Median (range): 2000–2005: 75.6 (NA); 2009–2012: 80.3 (NA) 381 27   Non-user ¶ Mean ± SD: 74.4 ± 6.0 Survival outcomes Takiuchi, 2017, US [ 42 Cervical cancer Whole pelvic RT NA 478 Metformin user ¦   Non-user ¶ NA Survival outcomes Li, 2019, Taiwan [ 34 Prostate cancer RT NA 567 Metformin user ¶   Non-user ¶ Mean ± SD: 71.8 ± 8.7 Survival outcomes Ranasinghe, 2019, Australia [ 36 Prostate cancer EBRT NA 2055 113   Non-user ¶ Median (range): 70 (54, 79) Survival outcomes Tsou, 2019, Taiwan [ 43 Hypopharyngeal SCC CRT Range: 60, 70 141 49  43 49 Mean ± SD: 63.64 ± NA Survival outcomes Yu, 2019, Taiwan [ 22 Early-stage breast cancer Breast RT Median (range): 50.4 (50, 59.4) 6993 Metformin user ¦   Non-user ¶ Median (range): metformin user: 59.89 (NA); non-user: 59.35 (NA) RT-related side effects Cadeddu, 2020, Spain [ 30 High-risk prostate cancer RT Range: 72, 76 447 Metformin users ¤   Non-user ¤ Median (range): 70 (46, 83) Survival outcomes Chun, 2020, US [ 20 Squamous or adenocarcinoma NSCLC SBRT Median (range): peripheral: 50 (NA); central: 70 (NA) 15  14  1 Median (range): 73 (51, 84) Survival outcomes Dağdelen, 2021, Turkey [ 31 Prostate cancer Radical RT Median (range): 78 (70, 80) 94 22   72 Median (range): 69 (53, 88) Survival outcomes Kim, 2021, Canada [ 46 Prostate cancer Prostate/pelvic RT Range: 76, 78 81  39  42 Mean ± SD: 72 ± 7.1 RT-related side effects Skinner, 2021, US [ 47 Locally advanced NSCLC 3D conformal or intensity-modulated RT Median (range): 60 (NA) 167  86  81 Median (range): 64 (43, 86) Survival outcomes Stang, 2021, US [ 40 Locally advanced NSCLC SBRT Range: 50, 60 120 31  11 78 Mean ± SD: 71.38 ± 9.09 Survival outcomes Tsakiridis, 2021, Canada [ 21 Locally advanced NSCLC Chest RT Range: 60, 63 54  26  28 Mean ± SD: 65.6 ± 7.6 Survival outcomes Tate, 2024, US [ 48 NSCLC SBRT Median (range): peripheral: 50 (NA); central: 70 (NA) 15  14  1 Median (range): 73 (51, 84) Survival outcomes (Note) US: United States. NSCLC: non-small cell lung cancer. SCC: squamous cell carcinoma. WBI: whole breast irradiation. CRT: chemoradiotherapy. EBRT: external beam radiation therapy. RT: radiotherapy. SBRT: stereotactic body radiation therapy. 3D: 3-dimensional. NA: not available. IQR: Interquartile range. DM: diabetes mellitus. § ¶ ¦ ¤ pharmaceuticals-18-01390-t003_Table 3 Table 3 Overall survival rate outcome in five groups. Study Cancer Comparison Event Rate Odds Ratio (95%CI) Effect Size  Group 1: metformin (NS) vs. non-user (NS)  Jang (2015) [ 33 Hepatocellular carcinoma Metformin (NS) vs. non-user (NS) 14/19 vs. 21/57 4.80 (1.51, 15.22) Van De Voorde (2015) [ 44 Oesophageal cancer Metformin (NS) vs. non-user (NS) 15/19 vs. 88/177 3.79 (1.21, 11.88) Takiuchi (2017) [ 42 Cervical cancer Metformin (NS) vs. non-user (NS) 27/41 vs. 317/437 0.73 (0.37, 1.44) Cadeddu (2020) [ 30 High-risk prostate cancer Metformin (NS) vs. non-user (NS) 63/70 vs. 341/377 0.95 (0.40, 2.23) Dağdelen (2021) [ 31 Prostate cancer Metformin (NS) vs. non-user (NS) 20/22 vs. 66/72 0.91 (0.17, 4.86)  Overall   Metformin (NS) vs. non-user (NS)  139/171 vs. 833/1120  1.56 (0.71, 3.44), I 2  Group2: metformin (DM+) vs. non-user (NS) Wink (2016) [ 45 Locally advanced NSCLC Metformin (DM+) vs. non-user (NS) 33/59 vs. 301/623 1.36 (0.79, 2.32) Chang (2017) [ 23 Head and neck SCC Metformin (DM+) vs. non-user (NS) 28/39 vs. 137/213 1.41 (0.67, 2.99)  Overall   Metformin (DM+) vs. non-user (NS)  61/98 vs. 438/836  1.38 (0.89, 2.13), I 2 < 0.1%  Group 3: metformin (DM+) vs. non-user (DM+) Skinner (2013) [ 37 Rectal cancer Metformin (DM+) vs. non-user (DM+) 16/20 vs. 22/40 3.27 (0.93, 11.54) Spratt (2013) [ 38 Prostate cancer Metformin (DM+) vs. non-user (DM+) 128/157 vs. 90/162 3.53 (2.12, 5.87) Ahmed (2015) [ 19 NSCLC Metformin (DM+) vs. non-user (DM+) 2/20 vs. 4/20 0.44 (0.07, 2.76) Jang (2015) [ 33 Hepatocellular carcinoma Metformin (DM+) vs. non-user (DM+) 14/19 vs. 16/29 2.27 (0.65, 7.99) Spratt (2016) [ 39 Oropharyngeal cancer Metformin (DM+) vs. non-user (DM+) 72/102 vs. 67/82 0.54 (0.27, 1.09) Tsou (2019) [ 43 Hypopharyngeal SCC Metformin (DM+) vs. non-user (DM+) 27/49 vs. 12/43 3.17 (1.33, 7.59)  Overall   Metformin (DM+) vs. non-user (DM+)  259/367 vs. 211/376  1.77 (0.79, 3.96), I 2 = 77.8%  Group 4: metformin (DM+) vs. non-user (DM−) Skinner (2013) [ 37 Rectal cancer Metformin (DM+) vs. non-user (DM−) 16/20 vs. 359/422 0.70 (0.23, 2.17) Spratt (2013) [ 38 Prostate cancer Metformin (DM+) vs. non-user (DM−) 128/157 vs. 1854/2582 1.73 (1.15, 2.62) Ahmed (2015) [ 19 NSCLC Metformin (DM+) vs. non-user (DM−) 2/20 vs. 25/126 0.45 (0.10, 2.06) Jang (2015) [ 33 Hepatocellular carcinoma Metformin (DM+) vs. non-user (DM−) 14/19 vs. 80/169 3.12 (1.07, 9.03) Spratt (2016) [ 39 Oropharyngeal cancer Metformin (DM+) vs. non-user (DM−) 72/102 vs. 1296/1561 0.49 (0.31, 0.77)  Overall   Metformin (DM+) vs. non-user (DM−)  232/318 vs. 3614/4860  1.00 (0.46, 2.18), I 2 = 82.2%  Group 5: metformin (DM−) vs. non-user (DM−) Skinner (2021) [ 47 Locally advanced NSCLC Metformin (DM−) vs. non-user (DM−) 56/86 vs. 53/81 0.99 (0.52, 1.87) Tsakiridis (2021) [ 21 Locally advanced NSCLC Metformin (DM−) vs. non-user (DM−) 14/26 vs. 7/28 3.50 (1.11, 11.07) Tate (2024) [ 48 NSCLC Metformin (DM−) vs. non-user (DM−) 6/14 vs. 1/1 0.25 (0.01, 7.34)  Overall   Metformin (DM−) vs. non-user (DM−)  76/126 vs. 61/110  1.41 (0.47, 4.24), I 2 = 55.2% (Note) NS: The condition of diabetes mellitus was not specified. DM: diabetes mellitus. NSCLC: non-small cell lung cancer. SCC: squamous cell carcinoma. pharmaceuticals-18-01390-t004_Table 4 Table 4 Cancer progression outcomes. Study Cancer Comparison Event Rate Odds Ratio (95%CI) Effect Size  Pooled progression-free  Jang (2015) [ 33 Hepatocellular carcinoma Metformin (NS) vs. non-user (NS) 9/19 vs. 9/57 4.80 (1.52, 15.13) Wink (2016) [ 45 Locally advanced NSCLC Metformin (DM+) vs. non-user (NS) 34/59 vs. 232/623 2.29 (1.33, 3.94) Takiuchi (2017) [ 42 Cervical cancer Metformin (NS) vs. non-user (NS) 23/41 vs. 233/437 1.12 (0.59, 2.13) Skinner (2021) [ 47 Locally advanced NSCLC Metformin (DM−) vs. non-user (DM−) 30/86 vs. 32/81 0.82 (0.44, 1.54) Tsakiridis (2021) [ 21 Locally advanced NSCLC Metformin (DM−) vs. non-user (DM−) 18/26 vs. 13/28 2.60 (0.85, 7.92) Tate (2024) [ 48 NSCLC Metformin (DM−) vs. non-user (DM−) 4/14 vs. 1/1 0.14 (0.00, 4.22)  Overall    118/245 vs. 520/1227  1.62 (0.91, 2.91), I 2  Distant metastasis-free survival rate Spratt (2013) [ 38 Prostate cancer Metformin (DM+) vs. non-user (DM−) 141/157 vs. 2223/2582 1.42 (0.84, 2.42) Van De Voorde (2015) [ 44 Oesophageal cancer Metformin (NS) vs. non-user (NS) 1/19 vs. 44/177 0.17 (0.02, 1.29) Spratt (2016) [ 39 Oropharyngeal cancer Metformin (DM+) vs. non-user (DM−) 80/102 vs. 1399/1561 0.42 (0.26, 0.69) Wink (2016) [ 45 Locally advanced NSCLC Metformin (DM+) vs. non-user (NS) 44/59 vs. 332/623 2.57 (1.40, 4.72)  Overall    266/337 vs. 3998/4943  0.88 (0.32, 2.39), I 2  Disease-free survival rate Skinner (2013) [ 37 Rectal cancer Metformin (DM+) vs. non-user (DM−) 16/20 vs. 325/422 1.19 (0.39, 3.65) Tsou (2019) [ 43 Hypopharyngeal SCC Metformin (DM+) vs. non-user (DM+) 22/49 vs. 26/43 0.53 (0.23, 1.22)  Overall    38/69 vs. 351/465  0.73 (0.34, 1.57), I 2  Distant metastasis rate Spratt (2013) [ 38 Prostate cancer Metformin (DM+) vs. non-user (DM−) 9/157 vs. 298/2582 0.47 (0.24, 0.92) Wink (2016) [ 45 Locally advanced NSCLC Metformin (DM+) vs. non-user (NS) 13/59 vs. 248/623 0.43 (0.23, 0.81) Skinner (2021) [ 47 Locally advanced NSCLC Metformin (DM−) vs. non-user (DM−) 25/86 vs. 19/81 1.34 (0.67, 2.68)  Overall    47/302 vs. 565/3286  0.64 (0.31, 1.30), I 2  Locoregional recurrence rate Wink (2016) [ 45 Locally advanced NSCLC Metformin (DM+) vs. non-user (NS) 14/59 vs. 196/623 0.68 (0.36, 1.26) Skinner (2021) [ 47 Locally advanced NSCLC Metformin (DM−) vs. non-user (DM−) 23/86 vs. 23/81 0.92 (0.47, 1.82)  Overall    37/145 vs. 219/704  0.78 (0.49, 1.23), I 2  Biochemical failure rate Spratt (2013) [ 38 Prostate cancer Metformin (DM+) vs. non-user (DM−) 26/157 vs. 666/2582 0.57 (0.37, 0.88) Taira (2014) [ 41 Prostate cancer Metformin (DM+) vs. non-user (DM−) 6/126 vs. 93/2028 1.04 (0.45, 2.42) Ranasinghe (2019) [ 36 Prostate cancer Metformin (DM+) vs. non-user (NS) 61/113 vs. 483/1942 3.54 (2.41, 5.20)  Overall    93/396 vs. 1242/6552  1.29 (0.35, 4.74), I 2 (Note) NSCLC: non-small cell lung cancer. SCC: squamous cell carcinoma. NS: The condition of diabetes mellitus was not specified. DM: diabetes mellitus. pharmaceuticals-18-01390-t005_Table 5 Table 5 Radiotherapy-related adverse events. Adverse Event Study Comparison Follow-Up (Months) Event Rate Odds Ratio (95%CI)  Prostate cancer Acute gastrointestinal toxicity Cadeddu (2020) [ 30 Metformin (NS) vs. non-user (NS) Median (range): 88 (1–194) NA/70 vs. NA/377 ¦ 1.00 (0.50, 1.60) † Acute gastrointestinal toxicity Dağdelen (2021) [ 31 Metformin (NS) vs. non-user (NS) Median (range): 57 (15–128) 6/22 vs. 18/72 1.13 (0.38, 3.31) † Acute genitourinary toxicity Cadeddu (2020) [ 30 Metformin (NS) vs. non-user (NS) Median (range): 88 (1–194) NA/70 vs. NA/377 ¦ 1.4 (0.30, 0.90) § Acute genitourinary toxicity Dağdelen (2021) [ 31 Metformin (NS) vs. non-user (NS) Median (range): 57 (15–128) 20/22 vs. 54/72 3.33 (0.71, 15.68) § Chronic gastrointestinal toxicity Cadeddu (2020) [ 30 Metformin (NS) vs. non-user (NS) Median (range): 88 (1–194) NA/70 vs. NA/377 ¦ 1.10 (0.30, 2.30) Chronic genitourinary toxicity Cadeddu (2020) [ 30 Metformin (NS) vs. non-user (NS) Median (range): 88 (1–194) NA/70 vs. NA/377 ¦ 1.0 (0.50, 1.80) Late genitourinary side effects Dağdelen (2021) [ 31 Metformin (NS) vs. non-user (NS) Median (range): 57 (15–128) 4/22 vs. 9/72 1.56 (0.43, 5.65) Late gastrointestinal side effects Dağdelen (2021) [ 31 Metformin (NS) vs. non-user (NS) Median (range): 57 (15–128) 3/22 vs. 3/72 3.63 (0.68, 19.47) Overall genitourinary toxicity Kim (2021) [ 46 Metformin (DM−) vs. non-user (DM−) Mean (range): 27.3 (0.5–63.2) 2/29 vs. 1/28 2.00 (0.17, 23.39) Overall gastrointestinal toxicity Kim (2021) [ 46 Metformin (DM−) vs. non-user (DM−) Mean (range): 27.3 (0.5–63.2) 1/29 vs. 0/28 2.00 (0.06, 62.06)  Head and neck SCC Feeding tube placement Chang (2017) [ 23 Metformin (DM+) vs. non-user (NS) NA 29/39 vs. 125/213 2.04 (0.95, 4.40) Toxic death (grade 5 toxicity) Chang (2017) [ 23 Metformin (DM+) vs. non-user (NS) NA 2/39 vs. 9/213 1.23 (0.25, 5.90) ≥grade 3 mucositis/pharyngitis Chang (2017) [ 23 Metformin (DM+) vs. non-user (NS) NA 16/39 vs. 116/213 0.58 (0.29, 1.16) ≥grade 3 nausea/vomiting Chang (2017) [ 23 Metformin (DM+) vs. non-user (NS) NA 11/39 vs. 33/213 2.14 (0.97, 4.72) ¶¤  Locally advanced NSCLC ≥grade 3 toxicities Chun (2020) [ 20 Metformin (DM−) vs. non-user (DM−) Median (range): 6 (NA) 0/14 vs. 0/1 0.07 (0.00, 5.90) ≥grade 3 nausea Skinner (2021) [ 47 Metformin (DM−) vs. non-user (DM−) Median (range): 27.7 (0.03–47.21) 2/86 vs. 1/81 1.90 (0.17, 21.42) ¶ ≥grade 3 nausea Tsakiridis (2021) [ 21 Metformin (DM−) vs. non-user (DM−) NA 0/26 vs. 1/28 0.52 (0.02, 16.15) ¶ ≥grade 3 vomiting Skinner (2021) [ 47 Metformin (DM−) vs. non-user (DM−) Median (range): 27.7 (0.03–47.21) 1/86 vs. 1/81 0.94 (0.06, 15.30) ¤ ≥grade 3 vomiting Tsakiridis (2021) [ 21 Metformin (DM−) vs. non-user (DM−) NA 0/26 vs. 1/28 0.52 (0.02, 16.15) ¤ ≥grade 3 diarrhoea Skinner (2021) [ 47 Metformin (DM−) vs. non-user (DM−) Median (range): 27.7 (0.03–47.21) 1/86 vs. 2/81 0.46 (0.04, 5.23) ≥grade 3 pneumonitis Skinner (2021) [ 47 Metformin (DM−) vs. non-user (DM−) Median (range): 27.7 (0.03–47.21) 1/86 vs. 2/81 0.46 (0.04, 5.23) ≥grade 3 anaemia Tsakiridis (2021) [ 21 Metformin (DM−) vs. non-user (DM−) NA 1/26 vs. 1/28 1.08 (0.06, 18.21) ≥grade 3 body odour Tsakiridis (2021) [ 21 Metformin (DM−) vs. non-user (DM−) NA 1/26 vs. 0/28 2.24 (0.07, 69.68) ≥grade 3 dysphagia Tsakiridis (2021) [ 21 Metformin (DM−) vs. non-user (DM−) NA 2/26 vs. 0/28 4.67 (0.20, 108.54) ≥grade 3 esophagitis Tsakiridis (2021) [ 21 Metformin (DM−) vs. non-user (DM−) NA 0/26 vs. 1/28 0.52 (0.02, 16.15) ≥grade 3 lymphocyte count decreased Tsakiridis (2021) [ 21 Metformin (DM−) vs. non-user (DM−) NA 5/26 vs. 1/28 6.43 (0.70, 59.28) ≥grade 3 neutrophil count decreased Tsakiridis (2021) [ 21 Metformin (DM−) vs. non-user (DM−) NA 2/26 vs. 1/28 2.25 (0.19, 26.41) ≥grade 3 white blood cell count decreased Tsakiridis (2021) [ 21 Metformin (DM−) vs. non-user (DM−) NA 3/26 vs. 1/28 3.52 (0.34, 36.22) ≥grade 3 respiratory failure Tsakiridis (2021) [ 21 Metformin (DM−) vs. non-user (DM−) NA 1/26 vs. 0/28 2.24 (0.07, 69.68)  Breast cancer Treatment breaks secondary to skin toxicity Ferro (2013) [ 32 Metformin (DM+) vs. non-user (DM+) NA 9/51 vs. 1/28 5.79 (0.69, 48.29) Desquamation Ferro (2013) [ 32 Metformin (DM+) vs. non-user (DM+) NA 28/51 vs. 9/28 2.57 (0.98, 6.75) Heart failure Yu (2019) [ 22 Metformin (NS) vs. non-user (NS) Mean ± SD: 61.68 ± 17.28 74/2062 vs. 241/4931 0.72 (0.56, 0.94) * All heart events Yu (2019) [ 22 Metformin (NS) vs. non-user (NS) Mean ± SD: 61.68 ± 17.28 129/2062 vs. 419/4931 0.72 (0.59, 0.88) * (Note) SCC: squamous cell carcinoma. NSCLC: non-small cell lung cancer. NS: The condition of diabetes mellitus was not specified. DM: diabetes mellitus. NA: not available. SD: standard deviation. ¦ † I 2 § ¶ I 2 ¤ I 2 ",
  "metadata": {
    "Title of this paper": "The PRISMA 2020 statement: An updated guideline for reporting systematic reviews",
    "Journal it was published in:": "Pharmaceuticals",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472684/"
  }
}