{
  "title": "Paper_167",
  "abstract": "pmc Virchows Arch Virchows Arch 365 springeropen Virchows Archiv 0945-6317 1432-2307 pmc-is-collection-domain yes pmc-collection-title Springer PMC12488805 PMC12488805.1 12488805 12488805 40670724 10.1007/s00428-025-04169-4 4169 1 Original Article Indirect clinical validation for predictive biomarkers in oncology: International Quality Network for Pathology (IQN Path) Position Paper http://orcid.org/0000-0003-1856-9804 Torlakovic Emina E. emina.torlakovic@saskhealthauthority.ca 1 20 Al Dieri Raed 2 Badrick Tony 3 Chen Zongming Eric 4 5 Cheung Carol C. 6 Deans Zandra 7 8 Dodson Andrew 8 Fenizia Francesca 9 Kijima Hiroshi 10 Maas Joerg 11 Martinez Antonio 12 Nielsen Søren 13 Patton Simon 14 Rouleau Etienne 15 Schirmacher Peter 16 Shet Tanuja 17 Stockley Tracy 18 Normanno Nicola 9 19 1 https://ror.org/010x8gc63 grid.25152.31 0000 0001 2154 235X Canadian Biomarker Quality Assurance and College of Medicine, Department of Pathology and Laboratory Medicine, University of Saskatchewan, 2 3 https://ror.org/02evbg326 grid.464677.0 0000 0004 0637 7589 Royal College of Pathologists of Australasia Quality Assurance Programs, 4 https://ror.org/02qp3tb03 grid.66875.3a 0000 0004 0459 167X Division of Anatomic Pathology, Department of Laboratory Medicine and Pathology, Mayo Clinic, 5 https://ror.org/035h6e956 grid.418762.e 0000 0001 1088 6536 College of American Pathologists, 6 https://ror.org/010x8gc63 grid.25152.31 0000 0001 2154 235X Canadian Biomarker Quality Assurance, University of Saskatchewan, 7 https://ror.org/03q82t418 grid.39489.3f 0000 0001 0388 0742 GenQA, NHS Lothian, Royal Infirmary of Edinburgh, 8 9 10 11 12 13 https://ror.org/02jk5qe80 grid.27530.33 0000 0004 0646 7349 NordiQC, Aalborg University Hospital, 14 15 https://ror.org/0321g0743 grid.14925.3b 0000 0001 2284 9388 Gen&Tiss - GFCO, Gustave Roussy, 16 https://ror.org/038t36y30 grid.7700.0 0000 0001 2190 4373 Institute of Pathology, Heidelberg University Hospital, Heidelberg University, 17 https://ror.org/010842375 grid.410871.b 0000 0004 1769 5793 Department of Pathology, NCGEQAS, Tata Memorial Hospital India, 18 https://ror.org/03dbr7087 grid.17063.33 0000 0001 2157 2938 Canadian Biomarker Quality Assurance and Department of Laboratory Medicine and Pathobiology, University of Toronto, 19 https://ror.org/013wkc921 grid.419563.c 0000 0004 1755 9177 IRCCS Istituto Romagnolo Per Lo Studio Dei Tumori (IRST), “Dino Amadori” Meldola, 20 https://ror.org/00wg2b048 grid.412271.3 0000 0004 0462 8356 Royal University Hospital, 17 7 2025 2025 487 3 498144 565 572 23 5 2025 23 6 2025 24 6 2025 17 07 2025 03 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Validation of biomarker assays is mandatory not only for their applications in clinical trials but also for their subsequent transfer to clinical laboratories in routine clinical care. There are two critical components relevant to their transfer to clinical practice: regulatory oversight and methodology transfer. Both aspects are simplified where companion diagnostic (CDx) assays relevant to a given indication are being implemented in clinical laboratories. However, when laboratory developed tests (LDTs) are being used either because CDx is not available or because LDT is preferred, both aspects need special consideration from regulatory agencies as well as clinical laboratories. The key component that links these two aspects is evidence of validation of the new LDTs. For predictive and prognostic biomarkers in oncology, clinical validation is feasible only in clinical trials. This approach is not available or feasible to clinical laboratories that develop LDTs. While clinical laboratories routinely perform technical/analytical validation, depending on the type of biomarker, this may not be sufficient to provide evidence of the LDT’s clinical relevance. Laboratories must perform and document their assessment for the need for indirect clinical validation. When indirect clinical validation is required, it must be performed according to existing guidelines for this purpose. This paper provides expert consensus guidance and recommendations on how to assess for the need for indirect clinical validation and how to perform indirect clinical validation where required. This paper also provides a conceptual framework to regulatory agencies for determining requirements for validation of predictive and prognostic biomarkers in oncology. Keywords Oncology Clinical validation Biomarker testing Laboratory developed tests Companion diagnostic pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer-Verlag GmbH Germany, part of Springer Nature 2025 Introduction Validation and verification are processes required to develop, implement, and maintain laboratory assays. However, these processes may not be appropriately executed if left unspecified. Although several guidelines, recommendations, and position papers have been published for the validation and verification of laboratory assays, there remains significant confusion about what is needed to fulfill the requirements for validation of predictive biomarker assays as defined by the International Organization for Standardization (ISO) [ 1 17 18 The ISO 9000 definition of validation is the starting point. Validation is “ confirmation objective evidence intended use 1 19 Table 1 Three essential components of ISO 9000 definition of validation ISO 9000 definition component Relevance for validation of predictive biomarkers Comments Confirmation Level of certainty Defined by relevant professional organizations/societies (e.g., 90% diagnostic sensitivity and 95% diagnostic specificity) Objective evidence Test performance characteristics Examples: analytic sensitivity and specificity, reproducibility, robustness, diagnostic accuracy, readout accuracy, etc Intended use Purpose, fit-for-purpose If a predictive biomarker’s use/purpose changes, a new biomarker assay is created, and it requires initial clinical or initial indirect clinical validation Predictive biomarkers are being increasingly used in drug development and in precision medicine to aid in the selection of patients for targeted therapy or immunotherapy. Validation of biomarker assays is mandatory not only for their applications in clinical trials but also for their subsequent transfer to clinical laboratories in routine clinical care following successful clinical trials. As early as 2003, the American Association of Pharmaceutical Sciences/Clinical Ligand Assay Society Biomarkers Workshop had already emphasized the essential role of fit-for-purpose validation of predictive biomarkers [ 2 2 1 3 3 13 20 23 4 31 Table 2 Sphere of validation for predictive biomarker assays Timeline Sphere of validation Tools Purpose Pre-clinical trial Analytic validation Reference materials ± cases Analytic performance (test performance characteristics) Clinical trial Clinical validation Patients Clinical outcomes Post-clinical trial (clinical application) Verification for CDx (Tier 1 of analytic validation) Reference materials ± cases for analytic validation Stratification of patients for targeted therapy or immunotherapy Indirect clinical validation for LDT (analytic or diagnostic validation depending on the ICV Group of the predictive biomarker) Cases for diagnostic validation Since no new clinical trials will be conducted to clinically validate predictive LDTs, it is essential to perform indirect clinical validation that is fit-for-purpose for LDTs. The need for clinical validation is then strengthened by the FDA and European regulation with the IVDR in Europe. This article further defines, emphasizes the role of, and provides recommendations for indirect clinical validation for LDTs. IQN Path recommendations for indirect clinical validation will be helpful to clinical laboratories especially in the context of an evolving regulatory framework for LDTs. Rationale To perform fit-for-purpose indirect clinical validation, consideration of the type of predictive biomarker is paramount. This consideration typically addresses the distinction between three basic groups of predictive biomarkers: the first group detects a specific biological event that triggers the presence or overexpression of tumor driver (e.g., fusion events or gene amplification of different tyrosine kinases, such as involving ALK, NTRK, and HER2/EGFR), the second detects other molecular events that are directly or indirectly informative about immunological responses to the tumor and potential benefits of immunotherapy (e.g., tumor mutation burden (TMB), microsatellite instability, c-MET protein overexpression, PD-L1 or PD1, and other), and the third is a technical screening assay developed to decrease the cost of testing and shorten turnaround time for excluding patients with no chance to be positive with a definitive biomarker assay (e.g., ROS1 and pan-TRK IHC assays). It is foreseeable that additional groups of predictive biomarker assays may be developed as our understanding of cancer biology evolves. At such times, special consideration and assessment will be required to determine what are best practices for indirect clinical validation of the new group(s). The first group (Group 1) is typically characterized by no or minimal tumor heterogeneity, while the second group (Group 2) is often characterized by tumor heterogeneity [ 24 30 Furthermore, special consideration should be given to indirect clinical validation of a biomarker readout. While the readout is automated as a part of the analytical phase of most laboratory testing methodologies, for in situ methodologies, it is still performed mostly manually by pathologists for IHC and by pathologists/scientists/technologists (P/S/T) for FISH. Such readout for in situ methodologies could also be performed by or assisted by image analysis/artificial intelligence (IA/AI). In clinical trials, the specific readout is being performed by trial-specific P/S/T and/or IA/AI and is clinically validated for the specific purpose(s) of the clinical trial. However, the transfer into the clinical domain often requires special training of P/S/T and subsequently indirect clinical validation. Furthermore, if IA/AI readout is not a part of a specific CDx, the algorithm for the readout would also require indirect clinical validation. Recommendations for indirect clinical validation Recommendations are summarized in Table 3 1 2 Table 3 Recommendations for indirect clinical validation ICV Group 1 ICV Group 2 ICV Group 3 ICV of readout Examples EGFR, ROS1, and ALK in lung cancer PD-L1 Pan-TRK IHC PD-L1 CPS Purpose of predictive biomarker assay Demonstrate the presence or absence of a tumor driver Stratify patients as “positive” or “negative” for a specific biomarker based on readout and cutoff determined in the relevant clinical trial Decrease the cost of testing by excluding the cases/patients with no chance for positive results by a definitive biomarker assay As per ICV group Purpose of validation Generate evidence that a biological event is accurately demonstrated by a candidate assay Accurate stratification of patients as “positive” or “negative” by a candidate assay compared to a CDx assay Generate evidence that a candidate assay is 100% sensitive with the best possible specificity As per ICV group Sphere of validation Analytic Diagnostic Diagnostic As per ICV group Guidelines e.g., CAP and IQN Path/ISIMM e.g., CLSI-EP12 e.g., CLSI-EP12 CLSI-EP12 Test performance characteristics As per guidelines, it may include analytic sensitivity and specificity, reproducibility, technical accuracy, robustness, readout accuracy, etc Diagnostic sensitivity and specificity Diagnostic sensitivity and specificity Readout precision (intra-observer reproducibility) and accuracy (diagnostic sensitivity and specificity against designated gold standard) Type of samples Reference materials, selected tumor samples (cases) Tumor samples (cases) Tumor samples (cases) Tumor samples (cases) Fig. 1 When a new predictive biomarker assay is introduced in the clinical laboratory, and a regulatory agency-approved companion diagnostic (CDx) is used, the clinical laboratory should perform verification according to the manufacturer’s specifications. However, if an in-house laboratory-developed test (LDT) is used, it is usually not possible to conduct clinical validation in a clinical trial for this new biomarker assay. Instead, the laboratory should perform indirect clinical validation Fig. 2 The scope and extent of indirect clinical validation depend on the intended purpose of the new biomarker assay, which defines the appropriate indirect clinical validation (ICV) group. Analytic validation of a new LDT always preceeds diagnostic validation/indirect clinical validation as depicted in Fig. 1 ICV Group 1 For Group 1, indirect clinical validation is achieved by following published guidelines/recommendations for analytic validation, which may differ for different test methodologies (e.g., FISH, NGS, dPCR, and IHC) [ 17 32 34 ALK 17 31 33 34 36 ICV Group 2 Group 2 assays are almost always qualitative assays; therefore, CLSI EP-12 ED3:2023 guidelines apply [ 35 same 35 36 Of importance, analytic validation needs to be performed for all LDTs before indirect clinical validation is performed. Although there may exist some overlaps, analytic validation and indirect clinical validation are distinct processes. Analytic validation requires reference materials (e.g., tissue controls and synthetic or cell line calibrators) in order to calibrate biomarker assays for a specific purpose/use [ 37 4 31 34 38 ICV Group 3 Group 3 assays are technical screening assays. This is in contrast to ICV Group 1 and 2, which are definite biomarker assays, for which results would be used to decide on the treatment of patients. Therefore, their purpose and their patient safety risk profile are different, and the sensitivity must be 100% even with suboptimal specificity. Lower specificity will only reflect in the higher cost as more cases will be forwarded for testing with a definitive biomarker assay. For those biomarker assays where the readout is performed by P/S/T and/or IA/AI, the readout must be adjusted so that sensitivity remains 100%. This is critical for indirect clinical validation where an LDT assay protocol may need to undergo indirectly clinical validation only once, but any new “reader” (human or not) would need to be validated separately on the readout of the LDT assay protocol. Indirect validation of readout for in situ methodologies Indirect clinical validation of readout for in situ methodologies refers to the readout of in situ hybridization Disease prevalence and indirect clinical validation Disease prevalence is an important parameter in the design of assay validation protocols. However, the prevalence serves as a contextual factor and is not a tool for validation. The prevalence of a disease may have an impact on estimated sensitivity and specificity; however, the prevalence does not directly validate the intrinsic accuracy of the assay itself [ 39 Acceptability criteria and indirect clinical validation Acceptability criteria refer to an allowable error of an assay [ 19 19 40 41 Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements We are grateful to Dr. Benedikt Westphalen from the University of Munich for the review of the manuscript. Author contribution All authors contributed to the study conception and design. Material preparation was performed by Emina Torlakovic. The first draft of the manuscript was written by Emina Torlakovic, and all authors commented on previous versions of the manuscript. All authors have read and approved the final manuscript. Declarations Ethics approval This is not applicable, since no patients were included. Competing interests Emina E. Torlakovic declares the following conflicts of interest: advisory board member: Boehringer Ingelheim, AbbVie; presentations/lectures: AstraZeneca, Agilent; operational and educational grants for CBQA: Roche, Merck, BMS, Pfizer, Eli Lilly, AstraZeneca, and Incyte. Carol C. Cheung declares the following conflicts of interest: advisory board participant/consultant/speaker: Abbvie, Agilent Technologies, Astellas Pharma, AstraZeneca, Bayer, Boehringer-Ingelheim, Merck, Pfizer, Roche, and Sanofi-Aventis. Simon Patton declares the following conflicts of interest: personal financial interests (speaker’s fee/advisory boards): AstraZeneca, Novartis-Institutional financial interests (financial support to research projects): AstraZeneca, Diaceutics, MSD, Amgen, Novartis, Janssen, and Johnson & Johnson; and non-financial interests: Chair, External Advisory Committee, International Quality Network for Pathology (IQN Path), Executive Board member of EMQN CIC. Etienne Rouleau declares the following conflicts of interest: boards/oral presentation: AstraZeneca, BMS, Roche, GSK, Clovis, MSD—travel: GSK, AstraZeneca—research: AstraZeneca. Tracy Stockley received honoraria from AstraZeneca and Janssen for advisory board participation. Nicola Normanno declares the following conflicts of interest: speaker’s fee and/or advisory boards from MSD, Bayer, Biocartis, Illumina, Incyte, Roche, BMS, Merck, Thermofisher, AstraZeneca, and Eli Lilly; financial support to research projects (institutional grants) from Merck, Thermofisher, QIAGEN, Roche, AstraZeneca, Biocartis, and Illumina; and non-financial interests: President of the International Quality Network for Pathology (IQN Path). The other authors declare no financial or non-financial existing or potential conflicts of interest that are directly or indirectly related to the work submitted for publication. References 1. Torlakovic EE Cheung CC D’Arrigo C Evolution of quality assurance for clinical immunohistochemistry in the era of precision medicine. Part 3: Technical Validation of Immunohistochemistry (IHC) Assays in Clinical IHC Laboratories Appl Immunohistochem Mol Morphol 2017 25 151 159 10.1097/PAI.0000000000000470 28187030 Torlakovic EE, Cheung CC, D’Arrigo C et al (2017) Evolution of quality assurance for clinical immunohistochemistry in the era of precision medicine. Part 3: Technical Validation of Immunohistochemistry (IHC) Assays in Clinical IHC Laboratories. Appl Immunohistochem Mol Morphol 25:151–159 28187030 10.1097/PAI.0000000000000470 2. Lee JW Weiner RS Sailstad JM Method validation and measurement of biomarkers in nonclinical and clinical samples in drug development: a conference report Pharm Res 2005 22 499 511 10.1007/s11095-005-2495-9 15846456 Lee JW, Weiner RS, Sailstad JM et al (2005) Method validation and measurement of biomarkers in nonclinical and clinical samples in drug development: a conference report. Pharm Res 22:499–511 15846456 10.1007/s11095-005-2495-9 3. Lee JW Devanarayan V Barrett YC Fit-for-purpose method development and validation for successful biomarker measurement Pharm Res 2006 23 312 328 10.1007/s11095-005-9045-3 16397743 Lee JW, Devanarayan V, Barrett YC et al (2006) Fit-for-purpose method development and validation for successful biomarker measurement. Pharm Res 23:312–328 16397743 10.1007/s11095-005-9045-3 4. Fitzgibbons PL Bradley LA Fatheree LA Principles of analytic validation of immunohistochemical assays: guideline from the College of American Pathologists Pathology and Laboratory Quality Center Arch Pathol Lab Med 2014 138 1432 1443 10.5858/arpa.2013-0610-CP 24646069 Fitzgibbons PL, Bradley LA, Fatheree LA et al (2014) Principles of analytic validation of immunohistochemical assays: guideline from the College of American Pathologists Pathology and Laboratory Quality Center. Arch Pathol Lab Med 138:1432–1443 24646069 10.5858/arpa.2013-0610-CP 5. Halling KC Schrijver I Persons DL Test verification and validation for molecular diagnostic assays Arch Pathol Lab Med 2012 136 11 13 10.5858/arpa.2011-0212-ED 22208481 Halling KC, Schrijver I, Persons DL (2012) Test verification and validation for molecular diagnostic assays. Arch Pathol Lab Med 136:11–13 22208481 10.5858/arpa.2011-0212-ED 6. Burd EM Validation of laboratory-developed molecular assays for infectious diseases Clin Microbiol Rev 2010 23 550 576 10.1128/CMR.00074-09 20610823 PMC2901657 Burd EM (2010) Validation of laboratory-developed molecular assays for infectious diseases. Clin Microbiol Rev 23:550–576 20610823 10.1128/CMR.00074-09 PMC2901657 7. Chau CH Rixe O McLeod H Validation of analytic methods for biomarkers used in drug development Clin Cancer Res 2008 14 5967 5976 10.1158/1078-0432.CCR-07-4535 18829475 PMC2744124 Chau CH, Rixe O, McLeod H et al (2008) Validation of analytic methods for biomarkers used in drug development. Clin Cancer Res 14:5967–5976 18829475 10.1158/1078-0432.CCR-07-4535 PMC2744124 8. Cummings J Ward TH Greystoke A Biomarker method validation in anticancer drug development Br J Pharmacol 2008 153 646 656 10.1038/sj.bjp.0707441 17876307 PMC2259203 Cummings J, Ward TH, Greystoke A et al (2008) Biomarker method validation in anticancer drug development. Br J Pharmacol 153:646–656 17876307 10.1038/sj.bjp.0707441 PMC2259203 9. Dobbin KK, Cesano A, Alvarez J, et al (2016) Validation of biomarkers to predict response to immunotherapy in cancer: Volume II — clinical validation and regulatory considerations. J Immunotherap Cancer 4. Available at: http://jitc.biomedcentral.com/articles/10.1186/s40425-016-0179-0 10.1186/s40425-016-0179-0 PMC5109653 27891226 10. Elliott K McQuaid S Salto-Tellez M Immunohistochemistry should undergo robust validation equivalent to that of molecular diagnostics J Clin Pathol 2015 68 766 770 10.1136/jclinpath-2015-203178 26280782 Elliott K, McQuaid S, Salto-Tellez M et al (2015) Immunohistochemistry should undergo robust validation equivalent to that of molecular diagnostics. J Clin Pathol 68:766–770 26280782 10.1136/jclinpath-2015-203178 11. European Medicines Agency (EMEA) (2005) Validation of analytical procedures: text and methodology. Q2 (R1);1. Available at: http://somatek.com/content/uploads/2014/06/sk140605h.pdf 12. Hayes DF Biomarker validation and testing Mol Oncol 2015 9 960 966 10.1016/j.molonc.2014.10.004 25458054 PMC5528748 Hayes DF (2015) Biomarker validation and testing. Mol Oncol 9:960–966 25458054 10.1016/j.molonc.2014.10.004 PMC5528748 13. On behalf of the Bioanalysis and Quality Assurance (BAQA) Group of the ECMC, Cummings J, Raynaud F et al (2010) Fit-for-purpose biomarker method validation for application in clinical trials of anticancer drugs. British J Cancer 103:1313–1317 10.1038/sj.bjc.6605910 PMC2990602 20924371 14. Marchiò C Dowsett M Reis-Filho JS Revisiting the technical validation of tumour biomarker assays: how to open a Pandora’s box BMC Med 2011 9 1 10.1186/1741-7015-9-41 21504565 PMC3102629 Marchiò C, Dowsett M, Reis-Filho JS (2011) Revisiting the technical validation of tumour biomarker assays: how to open a Pandora’s box. BMC Med 9:1 21504565 10.1186/1741-7015-9-41 PMC3102629 15. Masucci GV, Cesano A, Hawtin R et al (2016) Validation of biomarkers to predict response to immunotherapy in cancer: Volume I — pre-analytical and analytical validation. J Immunotherap Cancer 4. Available at: http://jitc.biomedcentral.com/articles/10.1186/s40425-016-0178-1 10.1186/s40425-016-0178-1 PMC5109744 27895917 16. Ohtsu Y Tanaka S Igarashi H Analytical method validation for biomarkers as a drug development tool: points to consider Bioanalysis 2021 13 1379 1389 10.4155/bio-2021-0173 34517750 Ohtsu Y, Tanaka S, Igarashi H et al (2021) Analytical method validation for biomarkers as a drug development tool: points to consider. Bioanalysis 13:1379–1389 34517750 10.4155/bio-2021-0173 17. Goldsmith JD Troxell ML Roy-Chowdhuri S Principles of analytic validation of immunohistochemical assays: guideline update Arch Pathol Lab Med 2024 148 e111 e153 10.5858/arpa.2023-0483-CP 38391878 Goldsmith JD, Troxell ML, Roy-Chowdhuri S et al (2024) Principles of analytic validation of immunohistochemical assays: guideline update. Arch Pathol Lab Med 148:e111–e153 38391878 10.5858/arpa.2023-0483-CP 18. Pum J (2019) A practical guide to validation and verification of analytical methods in the clinical laboratory. In: Adv Clinic Chem 90. Elsevier; 215–281. Available at: https://linkinghub.elsevier.com/retrieve/pii/S006524231930006X 10.1016/bs.acc.2019.01.006 31122610 19. Palmer J, Galior K (2024) Defining allowable total error limits in the clinical laboratory. In: Advances in Clinical Chemistry 118. Elsevier:205–223. Available at: https://linkinghub.elsevier.com/retrieve/pii/S0065242323001166 10.1016/bs.acc.2023.11.006 38280806 20. Cheung CC Dietel M Gilks CB Evolution of quality assurance for clinical immunohistochemistry in the era of precision medicine: Part 1: Fit-for-purpose approach to classification of clinical immunohistochemistry biomarkers Appl Immunohistochem Mol Morphol 2016 25 8 10.1097/PAI.0000000000000451 27922482 Cheung CC, Dietel M, Gilks CB et al (2016) Evolution of quality assurance for clinical immunohistochemistry in the era of precision medicine: Part 1: Fit-for-purpose approach to classification of clinical immunohistochemistry biomarkers. Appl Immunohistochem Mol Morphol 25:8 10.1097/PAI.0000000000000451 27922482 21. Neely RJ Evolution of fit-for-purpose biomarker validations: an LBA perspective Bioanalysis 2018 10 905 907 10.4155/bio-2017-0267 29923756 Neely RJ (2018) Evolution of fit-for-purpose biomarker validations: an LBA perspective. Bioanalysis 10:905–907 29923756 10.4155/bio-2017-0267 22. Marrero A Lawrence S Wilsker D Translating pharmacodynamic biomarkers from bench to bedside: analytical validation and fit-for-purpose studies to qualify multiplex immunofluorescent assays for use on clinical core biopsy specimens Semin Oncol 2016 43 453 463 10.1053/j.seminoncol.2016.06.003 27663477 PMC5065024 Marrero A, Lawrence S, Wilsker D et al (2016) Translating pharmacodynamic biomarkers from bench to bedside: analytical validation and fit-for-purpose studies to qualify multiplex immunofluorescent assays for use on clinical core biopsy specimens. Semin Oncol 43:453–463 27663477 10.1053/j.seminoncol.2016.06.003 PMC5065024 23. Wagner JA Williams SA Webster CJ Biomarkers and surrogate end points for fit-for-purpose development and regulatory evaluation of new drugs Clin Pharmacol Ther 2007 81 104 107 10.1038/sj.clpt.6100017 17186007 Wagner JA, Williams SA, Webster CJ (2007) Biomarkers and surrogate end points for fit-for-purpose development and regulatory evaluation of new drugs. Clin Pharmacol Ther 81:104–107 17186007 10.1038/sj.clpt.6100017 24. Gerlinger M Rowan AJ Horswell S Intratumor heterogeneity and branched evolution revealed by multiregional sequencing New Engl J Med 2012 366 883 892 10.1056/NEJMoa1113205 22397650 PMC4878653 Gerlinger M, Rowan AJ, Horswell S et al (2012) Intratumor heterogeneity and branched evolution revealed by multiregional sequencing. New Engl J Med 366:883–892 22397650 10.1056/NEJMoa1113205 PMC4878653 25. Patel NM Jo H Eberhard DA Improved tumor purity metrics in next-generation sequencing for clinical practice: the integrated interpretation of neoplastic cellularity and sequencing results (IINCaSe) approach Appl Immunohistochem Mol Morphol 2018 10.1097/PAI.0000000000000684 PMC6887630 30102605 Patel NM, Jo H, Eberhard DA et al (2018) Improved tumor purity metrics in next-generation sequencing for clinical practice: the integrated interpretation of neoplastic cellularity and sequencing results (IINCaSe) approach. Appl Immunohistochem Mol Morphol. 10.1097/PAI.0000000000000684 10.1097/PAI.0000000000000684 PMC6887630 30102605 26. Libbrecht L Baldin P Dekairelle AF Evaluation of the correlation between KRAS mutated allele frequency and pathologist tumorous nuclei percentage assessment in colorectal cancer suggests a role for zygosity status J Clin Pathol 2018 71 743 744 10.1136/jclinpath-2018-205085 29703759 Libbrecht L, Baldin P, Dekairelle AF et al (2018) Evaluation of the correlation between KRAS mutated allele frequency and pathologist tumorous nuclei percentage assessment in colorectal cancer suggests a role for zygosity status. J Clin Pathol 71:743–744 29703759 10.1136/jclinpath-2018-205085 27. Sottoriva A Kang H Ma Z Big Bang model of human colorectal tumor growth Nat Genet 2015 47 209 216 10.1038/ng.3214 25665006 PMC4575589 Sottoriva A, Kang H, Ma Z et al (2015) Big Bang model of human colorectal tumor growth. Nat Genet 47:209–216 25665006 10.1038/ng.3214 PMC4575589 28. Normanno N Rachiglio AM Lambiase M Heterogeneity of KRAS, NRAS, BRAF and PIK3CA mutations in metastatic colorectal cancer and potential effects on therapy in the CAPRI GOIM trial Ann Oncol 2015 26 171 1714 10.1093/annonc/mdv176 25851630 Normanno N, Rachiglio AM, Lambiase M et al (2015) Heterogeneity of KRAS, NRAS, BRAF and PIK3CA mutations in metastatic colorectal cancer and potential effects on therapy in the CAPRI GOIM trial. Ann Oncol 26:171–1714 10.1093/annonc/mdv176 25851630 29. Saito T Niida A Uchi R A temporal shift of the evolutionary principle shaping intratumor heterogeneity in colorectal cancer Nat Commun 2018 9 2884 10.1038/s41467-018-05226-0 30038269 PMC6056524 Saito T, Niida A, Uchi R et al (2018) A temporal shift of the evolutionary principle shaping intratumor heterogeneity in colorectal cancer. Nat Commun 9:2884 30038269 10.1038/s41467-018-05226-0 PMC6056524 30. Reiter JG Makohon-Moore AP Gerold JM Minimal functional driver gene heterogeneity among untreated metastases Science 2018 361 1033 1037 10.1126/science.aat7171 30190408 PMC6329287 Reiter JG, Makohon-Moore AP, Gerold JM et al (2018) Minimal functional driver gene heterogeneity among untreated metastases. Science 361:1033–1037 30190408 10.1126/science.aat7171 PMC6329287 31. Torlakovic EE (2017) Evolution of quality assurance for clinical immunohistochemistry in the era of precision medicine. Part 3: Technical Validation of Immunohistochemistry (IHC) Assays in Clinical IHC Laboratories. Appl Immunohistochem Mol Morphol;00:9 10.1097/PAI.0000000000000470 28187030 32. Watson MS, Buchanan PD, Cohen MM et al (2000) Technical and clinical assessment of fluorescence in situ hybridization: An ACMG/ASHG position statement. I. Technical considerations: Test and Technology Transfer Committee. Genetics in Medicine 2:356–361 10.1097/00125817-200011000-00011 11339659 33. Wiktor AE Van Dyke DL Stupca PJ Preclinical validation of fluorescence in situ hybridization assays for clinical practice Genet Med 2006 8 16 23 10.1097/01.gim.0000195645.00446.61 16418595 Wiktor AE, Van Dyke DL, Stupca PJ et al (2006) Preclinical validation of fluorescence in situ hybridization assays for clinical practice. Genet Med 8:16–23 16418595 10.1097/01.gim.0000195645.00446.61 34. Jennings L Van Deerlin VM Gulley ML Recommended principles and practices for validating clinical molecular pathology tests Arch Pathol Lab Med 2009 133 743 755 10.5858/133.5.743 19415949 Jennings L, Van Deerlin VM, Gulley ML (2009) Recommended principles and practices for validating clinical molecular pathology tests. Arch Pathol Lab Med 133:743–755 19415949 10.5858/133.5.743 35. CLSI (2023) Evaluation of qualitative, binary output examination performance. CLSI guideline EP12 36. Rabenau HF Kessler HH Kortenbusch M Verification and validation of diagnostic laboratory tests in clinical virology J Clin Virol 2007 40 93 98 10.1016/j.jcv.2007.07.009 17766174 Rabenau HF, Kessler HH, Kortenbusch M et al (2007) Verification and validation of diagnostic laboratory tests in clinical virology. J Clin Virol 40:93–98 17766174 10.1016/j.jcv.2007.07.009 37. Cheung CC Dietel M Fulton R Evolution of quality assurance for clinical immunohistochemistry in the era of precision medicine: part 4: tissue tools for quality assurance in immunohistochemistry Appl Immunohistochem Mol Morphol 2016 00 4 10.1097/PAI.0000000000000469 27941560 Cheung CC, Dietel M, Fulton R et al (2016) Evolution of quality assurance for clinical immunohistochemistry in the era of precision medicine: part 4: tissue tools for quality assurance in immunohistochemistry. Appl Immunohistochem Mol Morphol 00:4 10.1097/PAI.0000000000000469 27941560 38. Jennings LJ Arcila ME Corless C Kamel-Reid S Lubin IM Pfeifer J Temple-Smolkin RL Voelkerding KV Nikiforova MN Guidelines for validation of next-generation sequencing–based oncology panels: a joint consensus recommendation of the association for molecular pathology and college of american pathologists J Molecul Diagnost 2017 19 3 341 365 10.1016/j.jmoldx.2017.01.011 PMC6941185 28341590 Jennings LJ, Arcila ME, Corless C, Kamel-Reid S, Lubin IM, Pfeifer J, Temple-Smolkin RL, Voelkerding KV, Nikiforova MN (2017) Guidelines for validation of next-generation sequencing–based oncology panels: a joint consensus recommendation of the association for molecular pathology and college of american pathologists. J Molecul Diagnost 19(3):341–365 10.1016/j.jmoldx.2017.01.011 PMC6941185 28341590 39. Murad MH Lin L Chu H Hasan B Alsibai RA Abbas AS Mustafa RA Wang Z The association of sensitivity and specificity with disease prevalence: analysis of 6909 studies of diagnostic test accuracy CMAJ 2023 195 27 E925 E931 10.1503/cmaj.221802.PMID:37460126;PMCID:PMC10356012 37460126 PMC10356012 Murad MH, Lin L, Chu H, Hasan B, Alsibai RA, Abbas AS, Mustafa RA, Wang Z (2023) The association of sensitivity and specificity with disease prevalence: analysis of 6909 studies of diagnostic test accuracy. CMAJ 195(27):E925–E931. 10.1503/cmaj.221802 37460126 10.1503/cmaj.221802 PMC10356012 40. Sandberg S, Fraser CG, Horvath AR et al (2015) Defining analytical performance specifications: Consensus Statement from the 1st Strategic Conference of the European Federation of Clinical Chemistry and Laboratory Medicine. Clinical Chemistry and Laboratory Medicine (CCLM) 53. Available at: https://www.degruyter.com/document/doi/10.1515/cclm-2015-0067/html 10.1515/cclm-2015-0067 25719329 41. Fitzgibbons PL Murphy DA Hammond MEH Recommendations for validating estrogen and progesterone receptor immunohistochemistry assays Arch Pathol Lab Med 2010 134 930 935 10.5858/134.6.930 20524870 Fitzgibbons PL, Murphy DA, Hammond MEH et al (2010) Recommendations for validating estrogen and progesterone receptor immunohistochemistry assays. Arch Pathol Lab Med 134:930–935 20524870 10.5858/134.6.930 ",
  "metadata": {
    "Title of this paper": "Recommendations for validating estrogen and progesterone receptor immunohistochemistry assays",
    "Journal it was published in:": "Virchows Archiv",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488805/"
  }
}