{
  "title": "Paper_211",
  "abstract": "pmc J Pain Res J Pain Res 1405 jpainres jpr Journal of Pain Research 1178-7090 Dove Press PMC12487695 PMC12487695.1 12487695 12487695 41041662 10.2147/JPR.S533027 533027 1 Original Research Developing Quality Indicators for the Pharmacological Management of Chronic Non-Cancer Pain in Older Adult Inpatients: A RAND/UCLA Delphi Study Goetschi et al Goetschi et al http://orcid.org/0000-0002-9674-5124 Goetschi Aljoscha Noël  1  2 http://orcid.org/0000-0001-5530-8502 Schönenberger Nicole  1  2 http://orcid.org/0000-0002-6361-614X Wernli Ursina  1  2 http://orcid.org/0000-0002-3523-5729 Meyer-Massetti Carla  1  3 1 Clinical Pharmacology and Toxicology, Department of General Internal Medicine, Bern University Hospital Bern Bern Switzerland 2 Graduate School for Health Sciences, University of Bern Bern Bern Switzerland 3 Institute of Primary Health Care (BIHAM), University of Bern Bern Bern Switzerland Correspondence: Aljoscha Noël Goetschi, Clinical Pharmacology & Toxicology,Department of General Internal Medicine, Inselspital, Bern University Hospital Anna-von-Krauchthal-Weg 7 Bern CH-3010 Switzerland 27 9 2025 2025 18 478629 5037 5056 23 4 2025 11 9 2025 27 09 2025 02 10 2025 03 10 2025 © 2025 Goetschi et al. 2025 Goetschi et al. https://creativecommons.org/licenses/by/4.0/ This work is published by Dove Medical Press Limited, and licensed under a Creative Commons Attribution License. The full terms of the License are available at https://creativecommons.org/licenses/by/4.0/ Purpose Chronic non-cancer pain (CNCP) is a disabling condition affecting many older adult inpatients. While first-line therapy for CNCP consists of non-pharmacological approaches, many older adults receive pharmacotherapy nevertheless, putting them at a high risk of medication-related problems. Quality indicators (QIs) for the pharmacological management of CNCP could help reduce this risk. This Delphi study aimed to establish the face validity and feasibility of a list of previously developed QIs for the pharmacological management of CNCP in older adult inpatients. Patients and Methods We followed the RAND/UCLA Delphi study methodology to establish an expert consensus on a list of proposed QIs. Over two written rounds, nursing, pharmacy and medical experts rated the face validity and feasibility of the QIs identified in a previous systematic literature search. QI ratings that were uncertain or disagreed upon after the first round were discussed in three expert focus group discussions. The QIs discussed were rated again in round two, and the most relevant QI in each category was prioritised. Results Twenty-two experts agreed to participate in the study’s deliberations. Nineteen experts (86%) returned their ratings in each written round, and 9 (41%) participated in the focus groups. They evaluated 61 proposed QIs, modified 11 of them and suggested 13 new ones. The final set consisted of 51 QIs, with the experts prioritising 23 different ones. The 51 QIs covered the categories of general pharmacotherapy and the appropriate use of opioids, non-steroidal anti-inflammatory drugs (NSAIDs), paracetamol, metamizole and co-analgesics. Conclusion Through consensus, we developed a first set of QIs for the pharmacological management of CNCP in older adult inpatients. This set will help standardise care, track and benchmark the quality of care, and be used as a trigger to prioritise patients for clinical or pharmacological interventions. Keywords chronic non-cancer pain drug therapy medication safety medication review older adults pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Chronic non-cancer pain (CNCP) significantly reduces the quality of life of the individuals affected by it. As 28–88% of older adults may suffer from CNCP, this is a highly relevant public health concern. 1 2 3 4–6 7 8 9 10 11 Because of its complexity, CNCP management should consider different treatment types. First-line therapies should be non-pharmacological and can include both psychological and somatic interventions. Pharmacological therapies should be considered second-line therapies. 12 7 MRPs are particularly prevalent among older adult inpatients, largely due to their complex clinical presentations involving multimorbidity and polypharmacy. 13 14 15 16 17 Quality indicators (QIs) are measurable items used to assess and track care, both within and between institutions. 18 18 19 18 20 Although there are different methods for developing QIs, most involve systematic searches of the relevant literature and/or the expert validation of the QIs selected. 18 21 18 21 22 Materials and Methods Design Campbell et al proposed that developing QIs first requires collating evidence using a systematic literature search and then establishing expert consensus on the QIs identified. 18 18 23 21 To find a consensus on the face validity and feasibility of this proposed set of QIs, we conducted a two-round Delphi study with three focus group discussions between the two rounds, as the RAM proposes. In the first round, experts rated the face validity and feasibility of the proposed set of QIs. Those for which no consensus could be found or for which we received many suggestions for improvement were discussed in three focus groups. Each expert was asked to participate in one focus group. Subsequently, QIs without a consensus decision and those that had been adapted were rated again. A visual representation of the RAM Delphi study methods used is shown in Figure 1 22 Figure 1 Schematic overview of the methods used in this RAND/UCLA Appropriateness Method Delphi study. QI = Quality indicator. Created in BioRender. Goetschi, A (2025) https://BioRender.com/i93a003 Expert Selection The RAM recommends creating an expert panel of 7–15, but acknowledges that the optimal composition depends on the desired geographic and professional representation. 23 21 Selection of QIs to Be Rated We conducted a systematic literature search using an integrative review to screen 6,842 articles. This identified 11 validated QIs, 10 of which were included in the Delphi study. 21 Written Delphi Rounds Our RAM study used two written Delphi rounds to establish an expert consensus. In both rounds, the experts rated the face validity and feasibility of each item on a Likert scale ranging from 1–9 (1 = extremely invalid/unfeasible; 5 = uncertain; 9 = extremely valid/feasible). Experts were able to comment on each QI if they thought it necessary and could suggest new QIs. ANG set up both questionnaires in Excel ® ® ® Supplementary File 1 Supplementary File 1 The experts rated 64 items in the first round, which took place from 10 to 31 June 2024. To facilitate experts’ decisions, we provided them with a synopsis of the results from the integrative review. 21 23 Include: a panel median score of ≥ 6.5, without disagreement in either face validity or feasibility. Exclude: a panel median score of < 3.5 in either face validity or feasibility, without disagreement. Uncertain: a panel median of ≥ 3.5 and < 6.5 in either face validity or feasibility, or disagreement. The “exclude” category had priority: if one category was “uncertain” and the other was “exclude”, then the QI was excluded. We calculated disagreement using the Interpercentile Range Adjusted for Symmetry required for disagreement (IPRAS) proposed by the RAM. 23 For the second Delphi round, which took place after the focus groups (described in the next paragraph), we applied the same procedures. Experts received an Excel spreadsheet showing the median first-round ratings for each QI, plus their own ratings. In addition, we asked the authors to list the most important QI in each pharmacological category (ie general drug therapy, opioids, NSAIDs, paracetamol, metamizole and co-analgesics). The second round took place from 14 to 28 August 2024 and involved rating the uncertain QIs again and rating the newly proposed QIs. We had decided a priori to limit the workload and time burdens put on the experts to two rounds of rating using the two questionnaires and participating in a 1.5-hour focus group. This approach overcame the possible limitations of a fixed two-round procedure, and we also excluded from the second round all the QIs that had not met the criteria for the “include” category. Focus Group Discussions Semi-structured focus group discussions occurred between the two written Delphi rounds. These enabled our experts to exchange thoughts and supported the co-construction of a shared clinical reality, recommendations and rules. 22 23 We tried to balance the composition of these discussion meetings using profession as the main criterion. Meetings followed the RAM recommendations to ensure that each expert had an opportunity to speak up and give their perspective. 23 23 verbatim © Results First Round We initially contacted 52 experts, and 22 agreed to participate. In the first Delphi round, 19 (86%) experts returned their ratings (see Table 1 Table 2 Figure 2 Table 1 Summary of the Characteristics of the Experts Who Agreed to Participate in Our Delphi Study. As Some Experts Were Working in Multiple Settings, the Percentages and Absolute Numbers May Add up to More Than 22 Characteristic Number of experts (n = 22) Gender Female 16 (73%) Male 6 (27%) Other 0 (0%) Profession Pharmacist 11 (50%) Physician 6 (27%) Nurse 5 (23%) Years of experience > 20 years 9 (41%) 16–20 years 6 (27%) 11–15 years 1 (5%) 6–10 years 5 (23%) 1–5 years 1 (5%) Work setting Inpatient care 17 (77%) Research 10 (45%) Outpatient care 4 (18%) Long-term care 2 (9%) Country of work Switzerland 17 (77%) Germany 4 (18%) Qatar 1 (5%) Table 2 Overview of the Median Expert Ratings for Face Validity and Feasibility, as Well as Disagreements Concerning Quality Indicators (QIs) Over the Two Delphi Rounds No. Quality Indicator First Round Second Round New No. Validity Feasibility Decision Validity Feasibility Final Decision Median Dis. 1 Median Dis. 1 Median Dis. 1 Median Dis. 1 1 IF an older adult has a new diagnosis of CNCP 2 6 No 8 No Uncertain 7 No n/a n/a Included G5 2.1 IF an older adult is being treated for CNCP 2 8 No 7 No Discussion n/a n/a n/a n/a Excluded 2.2 IF an older adult is being treated for CNCP 2 n/a n/a n/a n/a n/a 9 No 7 No Included G4 3.1 IF an older adult with CNCP 2 8 No 8 No Discussion n/a n/a n/a n/a Excluded 3.2 IF an older adult with CNCP 2 n/a n/a n/a n/a n/a 8 No 8 No Included G7 N1 IF an older adult has CNCP 2 n/a n/a n/a n/a n/a 9 No 7 No Included G1 4 IF an older adult with CNCP 2 9 No 7.5 No Included n/a n/a n/a n/a Included O6 5.1 IF an older adult with CNCP 2 9 No 7 No Discussion n/a n/a n/a n/a Excluded 5.2 IF an older adult with CNCP 2 n/a n/a n/a n/a n/a 9 No 7 No Included O1 N2 IF an older adult with CNCP 2 n/a n/a n/a n/a n/a 9 No 7 No Included O3 6 IF an older adult with CNCP 2 9 No 9 No Included n/a n/a n/a n/a Included O7 7 IF an older adult has been prescribed a cyclooxygenase-nonselective NSAID 3 2 3 9 No 7 No Included n/a n/a n/a n/a Included N5 8.1 IF an older adult with CNCP 2 3 9 No 8 No Discussion n/a n/a n/a n/a Excluded 8.2 IF an older adult with CNCP 2 3 n/a n/a n/a n/a n/a 9 No 8 No Included N1 10 IF oral pharmacological therapy is initiated to treat symptomatic osteoarthritis in an older adult, THEN paracetamol/acetaminophen should be the first drug used. 6 No 8 No Uncertain 6 No n/a n/a Excluded 11 IF an older adult’s oral pharmacological therapy for symptomatic osteoarthritis is changed from acetaminophen to a different agent, THEN there should be evidence that they have trialled the maximum dose of paracetamol/acetaminophen. 7 No 6 No Uncertain n/a n/a 6 No Excluded 12 IF an older adult is diagnosed with CNCP 2 9 No 5 No Uncertain n/a n/a 5.5 No Excluded 13 IF an older adult is diagnosed with CNCP 2 7 No 8 No Included n/a n/a n/a n/a Included G10 14 IF an older adult has CNCP 2 9 No 6.5 No Included n/a n/a n/a n/a Included G2 15 IF an older adult has CNCP 2 9 No 6.5 No Included n/a n/a n/a n/a Included G3 16 IF an older adult is being treated for CNCP 2 8 No 7 No Included n/a n/a n/a n/a Included G6 17 IF an older adult has localised CNCP 2 7 No 6.5 No Included n/a n/a n/a n/a Included G8 18 IF an older adult is being treated for CNCP 2 5.5 No 6.5 No Uncertain 6.5 No n/a n/a Excluded* 19 IF an older adult has CNCP 2 7 No 6.5 No Included n/a n/a n/a n/a Included G9 20 IF an older adult with CNCP 2 8 No 8 No Included n/a n/a n/a n/a Included O9 21 IF an older adult with CNCP 2 8 No 7 No Included n/a n/a n/a n/a Included O10 22 IF an older adult with CNCP 2 9 No 7 No Included n/a n/a n/a n/a Included O4 23 IF an older adult with CNCP 2 7 No 5 No Uncertain n/a n/a 6 No Excluded 24 IF an older adult with CNCP 2 7 No 5 No Uncertain n/a n/a 5.5 No Excluded N3 IF an older adult with CNCP 2 n/a n/a n/a n/a n/a 8 No 5.5 No Excluded 25 IF an older adult with CNCP 2 9 No 8 No Included n/a n/a n/a n/a Included O5 26 IF an older adult with CNCP 2 9 No 7 No Included n/a n/a n/a n/a Included O8 27 IF an older adult with CNCP 2 9 No 5.5 No Uncertain n/a n/a 6 No Excluded 28 IF an older adult with CNCP 2 8 No 7 No Included n/a n/a n/a n/a Included O11 29.1 IF an older adult with CNCP 2 9 No 7 No Discussion n/a n/a n/a n/a Excluded 29.2 IF an older adult with CNCP 2 n/a n/a n/a n/a n/a …buprenorphine. n/a n/a n/a n/a n/a 8 No 7 No Included O12 …fentanyl. n/a n/a n/a n/a n/a 7 No 6 No Excluded …hydromorphone. n/a n/a n/a n/a n/a 8 No 8 No Included O12 …oxycodone. n/a n/a n/a n/a n/a 6.5 No 8 No Included O12 …tapentadol. n/a n/a n/a n/a n/a 7 No 5 No Excluded 30.1 IF an older adult with CNCP 2 8 No 7 No Discussion n/a n/a n/a n/a Excluded 30.2 IF an older adult with CNCP 2 n/a n/a n/a n/a n/a 8 No 7.5 No Included O16 31.1 IF an older adult with CNCP 2 6 No 5 No Uncertain n/a n/a n/a n/a Excluded 31.2 IF an older adult with CNCP 2 n/a n/a n/a n/a n/a 8 No 8 No Included O2 32 IF an older adult with CNCP 2 8 No 6.5 No Included n/a n/a n/a n/a Included O14 33 IF an older adult with CNCP 2 8 No 6 No Uncertain n/a n/a 6.5 No Included O15 34 IF an older adult with CNCP 2 7 No 7.5 No Included n/a n/a n/a n/a Included O17 35 IF an older adult with CNCP 2 4 No 6 No Uncertain 4 No 6 No Excluded N4 IF an older adult has CNCP 2 n/a n/a n/a n/a n/a 7 No 5 No Excluded N5 IF an older adult with CNCP 2 n/a n/a n/a n/a n/a 7 No 6.5 No Included O18 N6 IF an older adult CNCP 1 n/a n/a n/a n/a n/a 8 No 8 No Included O13 36 IF an older adult has CNCP 2 3 7 No 5 No Uncertain n/a n/a 6 No Excluded 37 IF an older adult has CNCP 2 3 6 No 5 No Uncertain n/a n/a n/a n/a Excluded 39 IF an older adult with CNCP 2 3 9 No 8 No Included n/a n/a n/a n/a Included N2 40 IF an older adult with CNCP 2 3 8 No 7 No Included n/a n/a n/a n/a Included N7 41 IF an older adult with CNCP 2 3 9 No 7.5 No Included n/a n/a n/a n/a Included N3 42 IF an older adult with CNCP 2 3 7 No 6 No Uncertain n/a n/a 7 No Included N10 43 IF an older adult with CNCP 2 3 9 No 6.5 No Included n/a n/a n/a n/a Included N4 44 IF an older adult with CNCP 2 3 3 9 No 8 No Included n/a n/a n/a n/a Included N6 45 IF an older adult with CNCP 2 3 8 No 7 No Included n/a n/a n/a n/a Included N8 46 IF an older adult with CNCP 2 3 4 8 No 5.5 No Uncertain n/a n/a 6 No Excluded 47 IF an older adult with CNCP 2 3 8 No 7.5 No Included n/a n/a n/a n/a Included N9 48 IF an older adult with CNCP 2 3 7 No 8 No Included n/a n/a n/a n/a Included N11 N7 IF an older adult with CNCP 2 3 n/a n/a n/a n/a n/a 5 No 3 No Excluded N8 IF an older adult with CNCP 2 3 n/a n/a n/a n/a n/a 5 No 3 No Excluded 49 IF an older adult with CNCP 2 9 No 8 No Included n/a n/a n/a n/a Excluded + 50 IF an older adult with CNCP 2 9 No 8 No Included n/a n/a n/a n/a Included P1 52.1 IF an older adult with CNCP 2 9 No 8 No Discussion n/a n/a n/a n/a Excluded 52.2 IF an older adult with CNCP 2 n/a n/a n/a n/a n/a 8 No 7 No Included P2 53 IF an older adult with CNCP 2 7 No 7 No Discussion n/a n/a n/a n/a Excluded # 54.1 IF an older adult with CNCP 2 8 No 7 No Discussion n/a n/a n/a n/a Excluded 54.2 IF an older adult with CNCP 2 n/a n/a n/a n/a n/a 8 No 7 No Included P3 N9 IF an older adult has non-inflammatory CNCP 2 n/a n/a n/a n/a n/a 7 No 7 No Included M3 N10 IF an older adult with CNCP 2 n/a n/a n/a n/a n/a 9 No 7 No Included M2 N11 IF an older adult has CNCP 2 n/a n/a n/a n/a n/a 8.5 No 8 No Included M1 55 IF an older adult has neuropathic CNCP 2 9 No 7 No Included n/a n/a n/a n/a Included C1 56.1 IF an older adult with CNCP 2 5 8 No 7 No Discussion n/a n/a n/a n/a Excluded 56.2 IF an older adult with CNCP 2 5 n/a n/a n/a n/a n/a 7 No 7 No Included C4 57 IF an older adult has CNCP 2 5 7.5 No 7 No Included n/a n/a n/a n/a Included C3 58.1 IF an older adult with CNCP 2 5 9 No 6 No Uncertain n/a n/a n/a n/a Excluded 58.2 IF an older adult with CNCP 2 5 n/a n/a n/a n/a n/a 8 No 7 No Included C2 59 IF an older adult with CNCP 2 5 5 No 5.5 No Uncertain 6 No 7 No Excluded 60 IF an older adult with CNCP 2 6 No 7 No Included 6.5 No n/a n/a Included C5 N12 IF an older adult with CNCP 2 n/a n/a n/a n/a n/a 6.5 No 5 No Excluded 61 IF an older adult has CNCP 2 5 No 5 No Uncertain 4.5 No 5 No Excluded 62 IF an older adult has CNCP 2 6 5 Yes 7 No Uncertain 5.5 No n/a n/a Excluded 63 IF an older adult has CNCP 2 7 4 No 5 No Uncertain 4 No 5 No Excluded 64 IF an elder with CNCP 2 7 6.5 No 7 No Included n/a n/a n/a n/a Included C6 N13 IF an older adult with CNCP 2 5 n/a n/a n/a n/a n/a 6 No 5 No Excluded Notes 1 2 3 4 5 6 7 + # Table 3 Table 3 The Final Set of Quality Indicators (QIs) for the Pharmacological Management of Chronic Non-Cancer Pain in Older Adult Inpatients No. Quality indicator Validity Feasibility Priorities General drug therapy G1 IF an older adult has CNCP 1 9 7 5 G2 IF an older adult has CNCP 1 9 6.5 2 G3 IF an older adult has CNCP 1 9 6.5 2 G4 IF an older adult is being treated for CNCP 1 8 7 2 G5 IF an older adult has a new diagnosis of CNCP 1 7 8 2 G6 IF an older adult is being treated for CNCP 1 8 7 0 G7 IF an older adult with CNCP 1 8 8 0 G8 IF an older adult has localised CNCP 1 7 6.5 0 G9 IF an older adult has CNCP 1 7 6.5 0 G10 IF an older adult is diagnosed with CNCP 1 7 8 0 Opioids O1 IF an older adult with CNCP 1 9 7.5 3 O2 IF an older adult with CNCP 1 8 8 2 O3 IF an older adult with CNCP 1 9 7 1 O4 IF an older adult with CNCP 1 9 7 1 O5 IF an older adult with CNCP 1 9 8 1 O6 IF an older adult with CNCP 1 9 7 0 O7 IF an older adult with CNCP 1 9 9 0 O8 IF an older adult with CNCP 1 9 7 0 O9 IF an older adult with CNCP 1 8 8 0 O10 IF an older adult with CNCP 1 8 7 0 O11 IF an older adult with CNCP 1 8 7 0 O12 IF an older adult with CNCP 1 8 8 0 O13 IF an older adult with CNCP 1 8 8 0 O14 IF an older adult with CNCP 1 8 6.5 0 O15 IF an older adult with CNCP 1 8 6.5 0 O16 IF an older adult with CNCP 1 8 7.5 0 O17 IF an older adult with CNCP 1 7 7 0 O18 IF an older adult with CNCP 1 7 6.5 0 Non-steroidal anti-inflammatory drugs (NSAIDs) N1 IF an older adult with CNCP 1 2 3 9 8 7 N2 IF an older adult with CNCP 1 3 9 8 3 N3 IF an older adult with CNCP 1 3 9 7.5 1 N4 IF an older adult with CNCP 1 3 9 6.5 0 N5 IF an older adult has been prescribed a cyclooxygenase-nonselective NSAID 3 1 3 9 7 0 N6 IF an older adult with CNCP 1 3 3 9 8 0 N7 IF an older adult with CNCP 1 3 8 7 0 N8 IF an older adult with CNCP 1 3 8 7 0 N9 IF an older adult with CNCP 1 3 8 7.5 0 N10 IF an older adult with CNCP 1 3 7 7 0 N11 IF an older adult with CNCP 1 3 7 8 0 Paracetamol P1 IF an older adult with CNCP 1 9 8 5 P2 IF an older adult with CNCP 1 8 7 3 P3 IF an older adult with CNCP 1 8 7 2 Metamizole M1 IF an older adult has CNCP 1 8.5 8 6 M2 IF an older adult with CNCP 1 9 7 5 M3 IF an older adult has non-inflammatory CNCP 1 7 7 3 Co-analgesics C1 IF an older adult has neuropathic CNCP 1 9 7 8 C2 IF an older adult with CNCP 1 4 8 7 2 C3 IF an older adult has CNCP 1 4 7.5 7 1 C4 IF an older adult with CNCP 1 4 7 7 1 C5 IF an older adult with CNCP 1 6.5 7 0 C6 IF an elder with CNCP 1 5 6.5 7 0 Notes Abbriviations Figure 2 Sankey plot depicting how the experts evaluated, modified, rated uncertain, included and excluded the 61 original QIs identified in a previous integrative review, plus an extra 13 new QIs, over the two written rounds and the focus groups. Created in BioRender. Goetschi, A (2025) https://BioRender.com/m32m131 Focus Group Eighteen of our 22 experts (81%) agreed to participate in one of our three focus group discussions; however, mostly due to clinical emergencies, only 9 (50%) of them actually did so. The experts discussed the “uncertain” QIs, the QIs with suggested improvements and the new QIs proposed by the experts in round one. As a result, 11 QIs were modified before being rated again, and 13 new QIs were proposed for rating in round two. The experts deemed one QI to be inappropriate, and we excluded it. Table 2 Regarding general drug therapy, the experts discussed when patients should have their medication re-evaluated and the value of numerical rating scales. QI 2 advised that a patient’s medication should be re-evaluated after every 3–6 months of therapy. In their discussions, the experts agreed that this period was too long. The consensus was that treatment re-evaluations would ideally occur as soon as 1 week after treatment initiation or change. As this would decrease the QI’s feasibility, the experts agreed to the wording “within 1 month”. In their opinion, this QI should emphasise that if an earlier evaluation were possible, then it should be carried out. The experts discussed the value of numerical rating scales at length ( eg When discussing the QIs on opioids, the experts focussed on therapeutic monitoring and the risks of addiction. Regarding opioid initiation, the experts stressed the importance of distinguishing safety and efficacy. Safety should be evaluated earlier—within one week, according to QI 5.2. Experts also underlined the importance of nurses monitoring the patient. Efficacy, on the other hand, should be measured with improvements in quality of life. The experts emphasised that if no improvements occurred, opioid therapy should be stopped. They also acknowledged the importance of screening for and monitoring addiction to opioids. However, they doubted the feasibility of implementing this widely, especially in a European context. They argued that clinicians had limited time and lacked the necessary knowledge about screening tools and how to interpret results. The experts noted that a scarcity of evidence made discussing QIs on metamizole challenging; only a few countries use this active substance. There was discussion about whether metamizole should be a first-line drug, comparable to paracetamol, but due to the lack of evidence, especially on efficacy and safety, they agreed to recommend using metamizole solely in cases of non-inflammatory CNCP where paracetamol is insufficiently effective. In doing so, the experts acknowledged the increased risk of agranulocytosis when using metamizole, and they proposed two QIs as risk-reduction strategies. The experts also discussed pharmacogenetic testing’s value in CNCP management. While most agreed that it might be relevant in some cases, they had doubts about the cost–benefit analysis and healthcare professionals’ ability to interpret the testing’s results. Some participants also voiced concerns that the pharmacogenetic testing of polymedicated older adults with CNCP might be inferior to phenotyping as drug–drug, drug–gene and drug–disease interactions become too complex to predict. Second Round Nineteen (86%) experts participated in the second round, rating the “uncertain”, modified and new QIs and prioritising them all according to their relevance. These ratings led to a final set of 51 QIs meeting our pre-specified inclusion criteria. QI 18 (prefer topical drugs) received a sufficiently high median rating to be included; however, multiple experts stated that it was less valid than QI 17 (prefer topical drugs for localised pain). Due to their similarity, we followed their recommendation and excluded it. All the median QI ratings are shown in Table 2 Table 3 Discussion This RAM Delphi study aimed to reach a consensus on the face validity and feasibility of a set of potential QIs for the pharmacological management of CNCP in older adult inpatients. After two written rounds rating the QIs and three focus group discussions between them, our experts included a total of 51 QIs, of which 23 were given a priority rating. To the best of our knowledge, this is the first set of expert-validated QIs prepared for the pharmacological management of CNCP in older adult inpatients. We chose a RAM Delphi study approach based on a systematic literature search because this is a recommended process for developing a set of QIs. 18 22 24 25 26 23 27 27 The set of QIs developed in this study could be used in different ways. They could help to standardise the pharmacological care delivered to older adult inpatients with CNCP 18 19 Although most of the QIs excluded from our final set were considered valid—sometimes highly valid—our experts doubted that current healthcare systems would be able to implement them, making them infeasible. One specific example of this was QI 12, which recommends multimodal treatments. This concept is reflected in most clinical guidelines. 12 28 29 Some QIs included in this set may prove controversial. For instance, QI 1 recommends prescribing pharmacological treatments to all older adult inpatients with CNCP. Many guidelines recommend that pharmacological treatments should only be second-line treatments. 12 28 29 Other QIs involving some uncertainties included those for metamizole. Metamizole is only licensed in a few countries, but it is used a lot in Switzerland, Austria and Germany, particularly for older adults. 30 31 32 33 34 35 36 Limitations Although this Delphi study was performed following a systematic literature search and conducted using the RAM’s rigorous methodology, it had some limitations. First, the quality of the consensus reached in any Delphi study relies on the quality of the available evidence and the panel members’ clinical expertise. Because CNCP in older adult inpatients has been poorly studied, the evidence base may be too weak to formulate robust QIs. However, as the rate of retention of the QIs from the literature was high, we believe that the selection presented to the experts was appropriate. Second, participation in the focus group discussions was low. Although we tried to make participating in a focus group as easy as possible, many experts failed to attend. We nevertheless fully informed every expert about the discussions, whether they had attended one or not, and allowed them to give full written input on our suggested QIs in both rounds. We believe, therefore, that even if some experts did not participate in the focus group discussions, they had sufficient possibilities to intervene. Third, the QIs present here are not generalisable, particularly regarding their feasibility. Our experts were predominantly from German-speaking countries, and their recommendations may reflect the clinical practices in those countries. The feasibility of QIs, in particular, may also vary between institutions. Conclusion This two-round Research and Development Corporation (RAND) and University of California at Los Angeles (UCLA) Appropriateness Method Delphi study involved three focus groups and 19 experts rating potential quality indicators (QIs) for the pharmacological management of chronic non-cancer pain (CNCP) in older adult inpatients. Our experts included 51 QIs in the final set. This is the first expert-validated set of QIs developed out of a systematic search of the relevant literature, and it could help to support the standardisation of the care provided to older adult inpatients with CNCP, increasing the overall quality of the care delivered to them. These QIs could also be used as trigger tools to prioritise patients for interventions. To this end and to generalise the QIs to other settings, our QIs may still need to be adapted to local clinical practices and imperatives, and they require further clinical validation using real-world data. Acknowledgments The authors would like to acknowledge the experts’ expertise and efforts, without which this study would not have been possible. Abbreviations CNCP, chronic non-cancer pain; CREDES, Conducting and Reporting of Delphi Studies; IPRAS, Interpercentile Range Adjusted for Symmetry required for disagreement; NSAID, non-steroidal anti-inflammatory drugs; QI, quality indicator; RAM, RAND/UCLA Appropriateness Method; RAND, Research and Development Corporation; UCLA, University of California, Los Angeles. Author Contributions All authors made a significant contribution to the work reported, whether that is in the conception, study design, execution, acquisition of data, analysis and interpretation, or in all these areas; took part in drafting, revising or critically reviewing the article; gave final approval of the version to be published; have agreed on the journal to which the article has been submitted; and agree to be accountable for all aspects of the work. Disclosure The salaries of Aljoscha Noël Goetschi and Carla Meyer-Massetti are covered by the endowed professorship from PharmaSuisse - the Swiss Pharmacists Association. The authors have no other conflicts of interest to report with regard to this work. References 1. Helme RD Gibson SJ The epidemiology of pain in elderly people Clin Geriatric Med 2001 17 3 417 431 10.1016/S0749-0690(05)70078-1 11459713 2. Mills SEE Nicolson KP Smith BH Chronic pain: a review of its epidemiology and associated factors in population-based studies Br J Anaesth 2019 123 2 e273 e83 10.1016/j.bja.2019.03.023 31079836 PMC6676152 3. Scherer M Hansen H Gensichen J Association between multimorbidity patterns and chronic pain in elderly primary care patients: a cross-sectional observational study BMC Family Prac 2016 17 1 68 10.1186/s12875-016-0468-1 PMC4895952 27267905 4. Jank R Gallee A Boeckle M Chronic pain and sleep disorders in primary care Pain Res Treatment 2017 2017 1 9 10.1155/2017/9081802 PMC5749281 29410915 5. Banks SM Kerns RD Explaining high rates of depression in chronic pain: a diathesis-stress framework Psychol Bull 1996 119 1 95 10.1037/0033-2909.119.1.95 6. Currie SR Wang J More data on major depression as an antecedent risk factor for first onset of chronic back pain Psycholog Med 2005 35 9 1275 1282 10.1017/S0033291705004952 16168150 7. Goetschi AN Verloo H Wernli B Prescribing pattern insights from a longitudinal study of older adult inpatients with polypharmacy and chronic non-cancer pain Eur J Pain 2024 28 10 1645 1655 10.1002/ejp.2298 38838067 8. El-Shormilisy N Strong J Meredith PJ Associations among gender, coping patterns and functioning for individuals with chronic pain: a systematic review Pain Res Manag 2015 20 1 48 55 10.1155/2015/490610 24927488 PMC4325891 9. Janevic MR McLaughlin SJ Heapy AA Racial and socioeconomic disparities in disabling chronic pain: findings from the health and retirement study J Pain 2017 18 12 1459 1467 10.1016/j.jpain.2017.07.005 28760648 PMC5682226 10. Orhurhu VJ Pittelkow TP Hooten WM Prevalence of smoking in adults with chronic pain Tob Induc Dis 2015 13 1 1 6 10.1186/s12971-015-0042-y 26185492 PMC4504349 11. Alford DP German JS Samet JH Primary care patients with drug use report chronic pain and self-medicate with alcohol and other drugs J Gen Intern Med 2016 31 5 486 491 10.1007/s11606-016-3586-5 26809204 PMC4835374 12. Gobet C Naef F NICE Guideline NG193 Chronic pain (primary and secondary) in over 16s: assessment of all chronic pain and management of chronic primary pain Methods 2021 203 10 10.1016/j.ymeth.2021.10.004 34673173 13. Pramotesiri P Putthipokin K Ruangritchankul S Drug related problems among older inpatients at a tertiary care setting J Clin Med 2024 13 6 1638 10.3390/jcm13061638 38541864 PMC10971276 14. Maher RL Hanlon J Hajjar ER Clinical consequences of polypharmacy in elderly Expert Opin Drug Saf 2014 13 1 57 65 10.1517/14740338.2013.827660 24073682 PMC3864987 15. Laufenberg-Feldmann R Jage J Acute pain management in the elderly - Pharmaceutics and psychosocial approaches Anasthesiol Intensivmed Notfallmed Schmerzther 2011 46 5 354 362 10.1055/s-0031-1277979 21560101 16. Forster AJ Murff HJ Peterson JF The incidence and severity of adverse events affecting patients after discharge from the hospital Ann Internal Med 2003 138 3 161 167 10.7326/0003-4819-138-3-200302040-00007/m12558354 12558354 17. Ambade PN Hoffman Z Vest T Factors influencing communication issues during hospital discharge for older adults in 11 high-income countries: a secondary analysis of the 2021 international health policy survey BMJ Open 2025 15 1 e089430 10.1136/bmjopen-2024-089430 PMC11748765 39755566 18. Campbell SM Braspenning J Hutchinson A Research methods used in developing and applying quality indicators in primary care Qual Saf Health Care 2002 11 4 358 364 10.1136/qhc.11.4.358 12468698 PMC1758017 19. Murphy DR Meyer AN Sittig DF Application of electronic trigger tools to identify targets for improving diagnostic safety BMJ Qual Saf 2019 28 2 151 159 10.1136/bmjqs-2018-008086 PMC6365920 30291180 20. Lloyd RC Quality Health Care: A Guide to Developing and Using Indicators Jones & Bartlett Learning 2017 21. Goetschi AN Verloo H Schönenberger N Quality indicators for the pharmacological management of chronic non-cancer pain in older adult patients: an integrative review J Evalu Clin Prac 2025 31 5 e7025 10.1111/jep.70253 PMC12365588 40831201 22. Jünger S Payne SA Brine J Guidance on conducting and reporting delphi studies (CREDES) in palliative care: recommendations based on a methodological systematic review Palliat Med 2017 31 8 684 706 10.1177/0269216317690685 28190381 23. Fitch K Bernstein SJ Aguilar MD The RAND/UCLA Appropriateness Method User’s Manual Santa Monica CA Rand Corporation 2001 24. Day J Bobeva M A generic toolkit for the successful management of Delphi studies Electron J Business Res Methods 2005 3 2 10316 25. Williams PL Webb C The Delphi technique: a methodological discussion J Adv Nurs 1994 19 1 180 186 10.1111/j.1365-2648.1994.tb01066.x 8138622 26. Goodman CM The Delphi technique: a critique J Adv Nurs 1987 12 6 729 734 10.1111/j.1365-2648.1987.tb01376.x 3320139 27. Keeney S Hasson F McKenna HP A critical review of the Delphi technique as a research methodology for nursing InterJ Nurs Stud 2001 38 2 195 200 10.1016/S0020-7489(00)00044-4 11223060 28. Dowell D CDC clinical practice guideline for prescribing opioids for pain—United States, 2022 MMWR Recommendations Rep 2022 71 10.15585/mmwr.rr7103a1 PMC9639433 36327391 29. Qaseem A Wilt TJ McLean RM Forciea MA Noninvasive Treatments for Acute Subacute, and chronic low back pain: a clinical practice guideline from the American college of physicians Ann Internal Med 2017 166 7 514 530 10.7326/m16-2367/m28192789 28192789 30. Gut S Rauch M Haschke M Use of metamizole and other non-opioid analgesics in Switzerland between 2014 and 2019: an observational study using a large health insurance claims database Swiss Med Weekly 2024 154 2 3535 10.57187/s.3535 38579298 31. Hoffmann F Meinecke P Freitag MH Who gets dipyrone (metamizole) in Germany? Prescribing by age, sex and region J Clin Pharm Therapeutics 2015 40 3 285 288 10.1111/jcpt.12261 25776531 32. Haschke M Liechti ME Metamizol: nutzen und Risiken im Vergleich zu Paracetamol und NSAR Schweiz Med Forum 2017 17 48 1067 1073 33. Huber M Andersohn F Sarganas G Metamizole-induced agranulocytosis revisited: results from the prospective Berlin case–control surveillance study Eur J Clin Pharmacol 2015 71 2 219 227 10.1007/s00228-014-1777-8 25378038 34. Kötter T da Costa BR Fässler M Metamizole-associated adverse events: a systematic review and meta-analysis PLoS One 2015 10 4 e0122918 10.1371/journal.pone.0122918 25875821 PMC4405027 35. Bachmann F Duthaler U Meyer Zu Schwabedissen HE Metamizole is a moderate cytochrome P450 inducer via the constitutive androstane receptor and a weak inhibitor of CYP1A2 Clin Pharmacol Ther 2021 109 6 1505 1516 10.1002/cpt.2141 33336382 PMC8247900 36. Watermeyer F Gaebler AJ Neuner I Discovering interactions in polypharmacy: impact of metamizole on the metabolism of quetiapine Br J Clin Pharmacol 2024 90 11 2793 2801 10.1111/bcp.16168 38970468 ",
  "metadata": {
    "Title of this paper": "Discovering interactions in polypharmacy: impact of metamizole on the metabolism of quetiapine",
    "Journal it was published in:": "Journal of Pain Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487695/"
  }
}