{
  "title": "Paper_723",
  "abstract": "pmc Vaccines (Basel) Vaccines (Basel) 2764 vaccines vaccines Vaccines 2076-393X Multidisciplinary Digital Publishing Institute  (MDPI) PMC12474260 PMC12474260.1 12474260 12474260 41012096 10.3390/vaccines13090890 vaccines-13-00890 1 Review Influenza Virus: Global Health Impact, Strategies, Challenges, Role of Nanotechnolgy in Influenza Vaccine Development https://orcid.org/0000-0002-9128-0751 Parvez Shabi 1 * https://orcid.org/0009-0006-5525-0543 Pathrathota Anushree 2 https://orcid.org/0009-0002-3780-4689 Uppar Arjun L. 3 https://orcid.org/0000-0002-5634-6006 Yadagiri Ganesh 4 https://orcid.org/0000-0003-3466-0616 Mudavath Shyam Lal 5 * Skwarczynski Mariusz Academic Editor 1 2 24p08002@jssuni.edu.in 3 arjunuppar2001@gmail.com 4 yadagiriganesh@gmail.com 5 * shabi.parvez@iftmuniversity.ac.in shyamlal_absls@uohyd.ac.in 22 8 2025 9 2025 13 9 497676 890 01 7 2025 07 8 2025 18 8 2025 22 08 2025 28 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Influenza is a serious and global health issue, and it is a major cause of morbidity, fatality, and economic loss every year. Seasonal vaccines exist but are not very effective due to strain mismatches, delays in production, and antigenic drift. This comprehensive overview discusses the current situation of influenza vaccination, including the numerous types of vaccines—inactivated, live attenuated, and recombinant vaccines—and their effectiveness, efficacy, and associated challenges. It highlights the effects of the COVID-19 pandemic on the trends of influenza vaccination and the level to which innovation should be practiced. In the future universal influenza vaccines will be developed that target conserved viral antigens to provide long-term protection to people. In the meantime, novel vaccine delivery platforms, such as mRNA technology, virus-like particle (VLP), and nanoparticle-based systems, and less cumbersome and invasive administration routes, as well as immune responses are also under development to increase access and production capacity. Collectively, these innovations have the potential to not only reduce the global influenza epidemic but also to change the way influenza is prevented and prepare the world for a pandemic. influenza vaccination nanoparticles infections immune response Indian Council of Medical Research IIRP-2023-3052 Dr. Shyam Lal Mudavath acknowledges funding from the Indian Council of Medical Research, Govt. of India (IIRP-2023-3052). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Influenza is an acute viral respiratory infection that can break out and potentially cause a pandemic or epidemic [ 1 2 3 Influenza viruses are an Orthomyxoviridae 4 5 6 7 8 9 10 11 12 13 Due to the constant evolution of influenza viruses, routine modifications to influenza vaccine formulations and global monitoring are necessary. For five decades, the World Health Organization has worked with scientists and policymakers to establish a framework for international influenza vaccine manufacturing and evaluation, as well as regulatory oversight of vaccine distribution. The constant evolution of influenza viruses requires global surveillance to create novel vaccine formulations. To recommend seasonal influenza vaccine strains for distribution in the northern and southern hemispheres, the WHO holds two annual technical meetings in February and September. Data gathered via the Global Influenza Surveillance and Response System (GISRS) of the World Health Organization (WHO) served as the basis for the recommendations. GISRS has expanded its scope since 2004 to include A (H5N1) and A (H9N2) influenza subtypes, which has improved pandemic response readiness. The process of developing high-yield candidate vaccine viruses combines the expertise of WHO Collaborating Centres and specialized laboratories, which may employ classical reassortment, established in 1971, or reverse genetics methods. Authorized organizations receive the characterized candidate viruses that the WHO creates through its laboratories. The production of reference materials for global distribution occurs through Essential Regulatory Laboratories, which work together with vaccine manufacturers to deliver their product [ 12 In March 2024, a significant epidemic of the H5N1 avian influenza was discovered in the dairy cattle herds of the United States, the first outbreak of this phenomenon in the bovine population. The epidemic peaked on March 31 and remained with 121 new cases in a herd of 3876 cows, but most of the infections (89.4 percent seroprevalence) were subclinical [ 14 15 16 This review article highlights the insights into the influenza virus’s impact on global health and strategies for vaccine development. It also focuses on the challenges in the development of vaccines against influenza, as well as the role of nanotechnology in vaccine development. 2. Influenza Immune Response The complex chain reaction of humoral and cellular immune responses is a crucial event in a protective immune response that wards off infection and prevents the emergence of serious illness, as shown in Figure 1 2.1. Antibody-Mediated (Humoral) Response Infection caused by the influenza virus induces specific antibody responses against the virus antigen [ 18 19 20 21 22 23 24 25 26 27 2.2. Cell-Mediated Immunity Cellular immunity refers to the response mediated by T cells. T cells are produced from the bone marrow and the fetal liver, then are transferred to the thymus for further maturation and the development of their T-cell receptor (TCR). Cell-mediated immunity (CMI), predominantly facilitated by CD8+ T cells (cytotoxic T lymphocytes (CTLs)) [ 15 28 29 30 31 32 Pattern recognition receptors (PRRs), including toll-like receptors (TLRs 3, 7, and 8), play a crucial role in the immune response to influenza by recognizing viral RNA. Upon detection, they activate dendritic cells and macrophages, leading to the production of pro-inflammatory cytokines and type I interferon. This enhances the effectiveness of CD8+ cytotoxic T cells and CD4+ helper T cells, aiding in the clearance of infected cells and strengthening the overall immune response against the virus [ 19 33 2.3. Mucosal Immunity Mucosal immunity is a protective immune response involving the respiratory mucosa passageway for influenza, which involves antibodies and cellular constituents to halt invading viruses. Before entering the systemic circulation, at the mucosal barrier, secretory immunoglobulins (S-IgA) eliminate the virus without activating the complement pathway. In this way, cytokine storm could be controlled, and severe complications due to the activation of pro-inflammatory responses can be avoided [ 34 35 3. Vaccination Strategies for Influenza To date, influenza vaccination is still the most powerful public health measure and can not only help stop the spread of flu but also cut down any linked health issues and deaths. Presently, the three kinds of influenza vaccines that people commonly use are inactivated influenza vaccine (IIV), live attenuated influenza vaccine (LAIV), and recombinant influenza vaccine (RIV). Various types of influenza vaccine are represented in Figure 2 Figure 3 3.1. Inactivated Vaccines Inactivated influenza vaccines (IIVs) have been manufactured and utilized since the 1940s and represent the most widely produced and used type of influenza vaccine. The main components of these vaccines are hemagglutinin and neuraminidase proteins; some specific formulations may also have nucleoprotein, either with or without an adjuvant that is added [ 36 The viruses present in these vaccines are inactivated, meaning they cannot cause influenza; however, mild side effects might occur, such as localized reactions where the injection was administered. IIV is approved for individuals 6 months of age and older, including pregnant women and those with chronic health conditions. A single dose is recommended to be administered into the deltoid muscle or thigh. However, for children between 6 months and 8 years who did not receive the seasonal influenza vaccine in the previous season, it is advised to give two doses at least 4 weeks apart. Receiving the influenza vaccine during pregnancy offers protection for both the mother and her newborn against influenza [ 37 38 39 40 3.2. Live Attenuated Vaccines Live attenuated influenza vaccines (LAIVs) consist of attenuated viruses and do not cause the flu but can cause mild symptoms, like a runny nose, nasal congestion, fever, or sore throat. Side effects of the vaccine are generally mild and temporary, in comparison to those of an influenza infection. LAIV is recommended for use in persons aged 2–49 years who do not have contraindications or precautions but should not be given to pregnant women. LAIV is given as a nasal spray and is only one dose, but children 2–8 years old who have not received the seasonal flu vaccine in the past should get two doses, at least 4 weeks apart [ 37 41 39 3.3. Recombinant Vaccines Recombinant influenza vaccines (RIVs) deliver the hemagglutinin (HA) protein of the influenza virus, the principal immunogenic protein for this disease, to the body. An RIV is manufactured in insect cells with a baculovirus expression vector system. It is licensed for use in adults ≥18 years of age and has shown superior efficacy against PCR-confirmed influenza illness compared with an egg-based standard-dose vaccine in this population [ 42 Table 1 43 44 36 4. Influenza Vaccine Effectiveness The evaluation of influenza vaccines depends on two fundamental criteria, which are efficacy and effectiveness. The measurement of vaccine efficacy demonstrates how vaccination decreases the chances of developing infections and related diseases, which occurs in randomized, placebo-controlled clinical trials. The concept of vaccine effectiveness determines how much vaccinated people experience reduced clinical outcomes, such as disease incidence and hospital admissions, in real-world scenarios analyzed through observational studies [ 52 Randomized placebo-controlled clinical trials are established as the highest standard for determining vaccine effectiveness; however, their implementation involves high costs and may generate moral dilemmas. Influenza vaccine efficacy trials often encounter challenges with effectiveness due to fluctuations in infection rates and the mismatch between vaccine strains and seasonal virus strains. Observational studies are becoming an increasingly viable solution for examining vaccine effectiveness (VE) due to practical limitations [ 53 52 Current influenza vaccines achieve effectiveness levels that do not reach optimal standards since they typically protect between 40 and 60 percent of cases when the vaccine strains match the current circulating viruses. Different factors influence the effectiveness of a vaccine, such as the age of the recipient, along with the degree of alignment of the vaccine strain with circulating viruses and potential egg-based vaccine modifications, and the individual’s past receipt of influenza vaccinations [ 54 Table 2 Annual re-administration is required for influenza vaccines due to high probabilities or risk of circulating virus mutation (antigenic drift), rapidly reducing the level of antibodies induced by influenza vaccine with time. Influenza vaccination has only short-term benefits because of the limited vaccination protection up to only the next epidemic, requiring repeated influenza vaccination annually, which is recommended in numerous countries [ 55 vaccines-13-00890-t002_Table 2 Table 2 Vaccine compared based on effectiveness in the past 5 years. Season Vaccine Type Target Strain(s) Effectiveness (%) Age Group Study Type References 2019–2020 Inactivated (IIV4) H1N1pdm09, H3N2, B/Victoria, B/Yamagata ~45% All adults TND (CDC) [ 56 2020–2021 Recombinant (RIV4) Same as above ~51% 18–49 yrs Clinical trial [ 57 2021–2022 Live Attenuated (LAIV) H3N2 mismatch season ~25% 2–17 yrs TND (US/UK) [ 58 2022–2023 Cell-based IIV H1N1, H3N2 ~47% Elderly TND (CDC) [ 59 2023–2024 mRNA Influenza (Trial) H3N2, B/Vic ~63% 18–64 yrs Phase II/III trial [ 60 IIV4: Inactivated influenza vaccine, quadrivalent, RIV4: recombinant influenza vaccine, quadrivalent, LAIV: live attenuated influenza vaccine, TND: test-negative design (a type of observational study commonly used to assess vaccine effectiveness), CDC: Centers for Disease Control and Prevention, mRNA: messenger ribonucleic acid, H1N1pdm09: pandemic H1N1 influenza A virus strain from 2009, H3N2: influenza A virus subtype H3N2, B/Victoria: influenza B virus, Victoria lineage, B/Yamagata: influenza B virus, Yamagata lineage, Phase II/III trial: combined phase II and phase III clinical trial (evaluates safety, dosing, and efficacy in larger populations). 5. Challenges in Vaccine Development 5.1. Antigen Drift and Shift Influenza viruses are constantly changing to hemagglutinin (HA) and neuraminidase (NA) proteins as a result of antigenic drifts ( Figure 4 61 62 Regardless of the antigenic drift, influenza A and B viruses differ in evolutionary rate as they go through their lifecycle. The evolutionary rate of the H3N2 viruses is more direct than with influenza B and H1N1 viruses and leads to rapid changes. Scientists suppose that influenza B viruses have a slower genetic change rate of two to three times when compared to influenza A [ 63 64 Figure 4 The antigenic drift of influenza viruses, primarily due to the high frequency of mutations and genetic recombination of genes encoding proteins associated with the surface of viruses, such as hemagglutinin (HA) and neuraminidase (NA), forming new viral strains that may escape pre-existing immunity [ 65 65 5.2. Vaccine Strain Selection The initial global influenza surveillance system came into existence through the World Health Organization in 1952 [ 66 67 67 67 68 63 69 Identification of the common antibody targets in individuals of different ages with diverse immune histories is important in scientific studies. Individuals have immune strategies that focus on epitopes (in the HA) of the initial childhood strains of the virus [ 70 63 Despite periodic modifications, vaccine manufacturers struggle to precisely align their products with the existing influenza virus types. The vaccine industry needs to forecast the prevalent strains of each flu season several months in advance because the current manufacturing timeline extends up to six months for vaccine development [ 71 A universal vaccine would target the conserved regions, provide long-lasting protection against the virus, and would probably require no annual reformulation. A successful universal flu vaccine would provide extended immunity against all strains, irrespective of antigenic shift or drift or virus subtypes [ 72 5.3. Production Limitation Most influenza vaccines (over 80%) undergo egg-based production methods, which require six months before completion and expose the process to supply chain breakdowns while creating egg-adaptive mutations that reduce vaccine effectiveness. Modern production methods, which include cell culture and recombinant technologies, provide quicker output times and avoid egg-related problems, yet they encounter limited production capacity and incur higher expenses. The global distribution of vaccine manufacturing facilities remains unequal because several major regions, including Africa, do not possess local production capabilities, which causes distribution problems during seasonal epidemics and pandemics. Global vaccine availability will improve through the essential development of new manufacturing facilities, particularly in low- and middle-income countries [ 73 The development of advanced vaccines faces difficulties related to increased scale operations, compliance requirements, and community resistance. The potential of mRNA vaccines and nanoparticle-based platforms requires extended verification, in addition to product refinement, for their successful implementation [ 74 6. Impact of COVID-19 on Influenza Vaccination Higher levels of vaccination were noted in 2020 when compared to previous influenza seasons, especially among the older population, healthcare workers (HCWs), and persons with chronic medical conditions. The increased vaccination rates were the result of better observance of precaution measures that were undertaken in the current pandemic and the better evaluation of the risk of influenza. Research shows that more COVID-19 consequences were associated with much higher influenza immunization rates among healthcare workers since they wanted to secure themselves and patients [ 75 76 General population rates of influenza vaccination have been variable, sometimes falling after the pandemic despite the initial impression of rising. Vaccine depletion, distribution problems, and the feeling that the risk of influenza had decreased also lowered influenza vaccination in several countries after the pandemic compared to before the pandemic. In the post-pandemic era, there was a decreasing rate of influenza vaccination in the general population of Saudi Arabia compared to that before the pandemic, i.e., 43.3% down to 29.1% [ 76 The healthcare system became overwhelmed as a result of the epidemic, and influenza vaccine efforts received even greater challenges. The provision of influenza and COVID-19 vaccines has to be thoroughly planned to avoid excessively overloading healthcare resources and to comply with demands of the recommended vaccine intervals. To sustain influenza vaccination coverage in the pandemic, important emphasis shifted to a smaller number of areas: the availability of vaccines in a convenient environment and, more importantly, their safety and easy access; and the implementation of tailor-made communication strategies [ 77 78 7. Role of Nanotechnology in Vaccine Development Human vaccines are developed with low pathogenicity and high antigenicity by using the altered forms of bacteria and viruses. Live attenuated bacterial vaccines have mutation problems, and killed vaccines need adjuvants, like polymers, mineral salts, and emulsions, to boost vaccine action by upregulating cytokines, sustained antigen release, or activating antigen-presenting cells [ 79 80 81 82 83 Nanoparticles less than 1000 nm are used in vaccines for prophylactic measures. Nanoparticles promote antigen processing or trigger immunity, and due to their small size, nanoparticles move through the cellular machinery by endocytosis and transport the active moiety alongside them [ 81 Figure 5 84 Figure 5 ( i 85 https://creativecommons.org/licenses/by/4.0/ ii 86 8. Various Types of Nanoparticles 8.1. Natural Nanoparticles 8.1.1. Virus-like Particles (VLPs) Virus-like particles (VLPs) are non-replicating and self-assembling in nature without any infectious genetic material. VLPs can be used as immunopotentiators or particulate carriers in the process of vaccine development because of their immunogenic characteristics, like size similarity with the pathogen, repetitive geometry of the surface, and the ability to provide potent antibody responses and B-cell activation. They can be produced from yeast, bacteria, animal cells, and insects as host cells [ 87 88 ® ® ® Figure 5 89 90 91 92 93 94 8.1.2. Bacterial Spore Bacterial species produce certain dormant cells, which are known as spores [ 95 96 97 98 99 100 8.1.3. Polysaccharide Polysaccharides are safe, biocompatible, and biodegradable, along with having an immunomodulatory action. Polysaccharides are polymers of natural origin with carbohydrate monomers linked glycosidically [ 101 102 103 8.1.4. Outer Membrane Vesicles (OMVs) Outer membrane vesicles (OMVs) are nano-sized spherical structures that Gram-negative bacteria spontaneously discharge from their outer membranes. These vesicles are typically 20 to 250 nanometers in diameter and consist of a lipid bilayer loaded with proteins, lipopolysaccharides (LPS), phospholipids, and periplasmic components. OMVs are released by bacterial cells in reaction to environmental stressors, such as antibiotic exposure, temperature changes, and host immunological responses [ 104 105 Furthermore, OMVs can be modified to carry specific antigens, detoxified to remove harmful LPS, and designed for injection, oral, or intranasal delivery. Their flexibility allows for the development of vaccines that guard against different infectious pathogens, including viruses and bacteria. Several approved vaccines have effectively used OMV-based platforms, particularly those that prevent meningococcal disease [ 106 107 8.1.5. Extracellular Vesicle Vaccines (EVs) Nearly every type of cell, including immune, epithelial, and tumor cells, secretes extracellular vesicles (EVs), which are small particles surrounded by a membrane. These vesicles are usually classified into three groups based on their size and origin. The potential of EV-based vaccines to protect against various diseases, including bacteria, parasites, and viruses like influenza [ 108 109 110 111 8.2. Synthetic Nanoparticles 8.2.1. Inorganic NPs Nanoparticles are typically assembled with an inorganic core and an organic shell layer, and recently, inorganic nanoparticles have attracted interest from various research groups for use in vaccines [ 112 113 Figure 6 114 115 114 3 4 2 3 2 4 116 117 118 119 Figure 6 The immunogenicity of subunit vaccines can be increased by developing a nanoformulation [ 114 8.2.2. Liposomes Liposomes are lipid bilayers containing an aqueous core for loading hydrophilic pathogenic antigens, or if they are hydrophobic, then in the bilayer (single- or multi-layered) [ 120 121 8.2.3. Polymer NPs Polymeric nanoparticles are composed of biocompatible polymers, mainly polyglycolic acid (PGA), poly (lactic-co-glycolic acid) (PLGA), and polylactic acid (PLA). These polymers could be altered in size, composition, and surface properties, resulting in controlled drug release and protection [ 122 123 124 125 Figure 7 Figure 7 Figure 7 Figure 7 126 Table 3 vaccines-13-00890-t003_Table 3 Table 3 Types of nanoparticles. Type of Nanoparticle Antigen Used Adjuvant Route of Administration Targeted Influenza Subtype Trial Phase/Outcome References  VLP (Virus-Like Particle) Hemagglutinin (HA) from H1N1 Matrix-M™ Intramuscular (IM) H1N1 Phase III (NanoFlu, Novavax)—Safe, strong immunogenicity [ 45  Lipid Nanoparticle (LNP) mRNA-encoding HA (H1, H3, B-Yamagata, B-Victoria) None (self-adjuvanting) Intramuscular (IM) Multivalent Phase I/II (Moderna mRNA-1010)—Under evaluation [ 49  Polymeric Nanoparticle (PLGA) Recombinant HA (rHA) from H5N1 MPLA Intranasal (IN) H5N1 Preclinical—Strong mucosal and systemic response [ 81  Gold Nanoparticles (AuNPs) Full-length HA from H3N2 CpG ODN Intranasal (IN) H3N2 Preclinical—Enhanced Th1-biased immune response [ 127  Chitosan Nanoparticle Conserved M2e peptide TLR agonist Intranasal (IN) Universal target Preclinical—Cross-protective, improved mucosal IgA [ 128  Liposome-Based HA and NP proteins Monophosphoryl lipid A Subcutaneous (SC) H5N1 Preclinical—High T-cell responses [ 129  Ferritin Nanoparticle HA from H1, H3, B strains None Intramuscular (IM) Multivalent Phase I (NIH)—Ongoing; induces broadly neutralizing antibodies [ 130  Micelle (Self-assembling) M2e peptide TLR7 agonist Intranasal (IN) Broad/universal Preclinical—Strong mucosal immunity, IgA, and IFN-γ [ 131  Polyanhydride Nanoparticle Inactivated whole virus None Subcutaneous (SC) H1N1 Preclinical—Prolonged antigen release [ 132 9. Challenges 9.1. Antigen Design Approaches (Universal Influenza Vaccine) One crucial future path is the development of a universal influenza vaccine, which would offer widespread and durable defense against a variety of influenza strains, including those with the potential to spread like a pandemic. Antigen design approaches (shown in Figure 8 133 134 135 136 137 9.2. Innovative Delivery Methods Researchers are looking into new delivery methods to increase the accessibility, safety, and effectiveness of vaccines. Traditional egg-based production has two drawbacks: lengthy manufacturing durations and possible antigenic alterations during virus propagation. However, emerging technologies, such as mRNA vaccines, recombinant protein expression, and viral vector platforms, enable more rapid and flexible vaccine manufacturing. Plans are underway to create new immunization delivery platforms, like mRNA vaccines. The current COVID-19 and influenza vaccines offer rapid design and production capabilities, strong immune responses, and good safety profiles. The influenza and SARS-CoV-2 antigens are now included in a number of formulations to speed up immunization campaigns [ 139 137 140 10. Conclusions To reduce the effects of both seasonal and pandemic flu, influenza vaccination is still a crucial part of public health initiatives. The current vaccines provide useful protection, but their production issues and strain-specific limits underscore the need for ongoing innovation. The goal of future research is to develop universal influenza vaccines that use cutting-edge vaccination technologies and target conserved viral components to produce widespread, long-lasting immunity. Modern delivery techniques, like mRNA platforms and enhanced antigen presentation systems, are anticipated to improve vaccine efficacy, speed up manufacturing, and expand accessibility at the same time. Nanotechnology has shown a new possibility for flu prevention and anti-influenza research, but the influenza virus rapidly and frequently modifies its genome, which poses a challenging task, and the mutation problem cannot be solved by the application of nanotechnology. Nanoparticles are excellent carriers to deliver nucleic acid, proteins/peptide, and vaccines, but they need to be check for their safety concerns for humans, as well as for the environment. Each nanocarrier system needs to be evaluated for its cytotoxic effects, drug interactions, and several other properties to utilize the complete potential of nanocarriers. By simplifying vaccination strategies, boosting immune responses, and strengthening preparedness for upcoming pandemics, these developments could collectively significantly improve influenza prevention and, eventually, lower the global burden of influenza. In the past few years, technology has achieved a magnificent achievement as a vaccine delivery platform due to its ability to prevent premature release of antigens and prolong the antigen presentation. Acknowledgments Shyam Lal Mudavath acknowledges funding from the Indian Council of Medical Research, Govt. of India (IIRP-2023- 3052). Disclaimer/Publisher’s Note: Author Contributions S.P. contributed by drafting the manuscript, editing the figures and tables, providing supervision, and revising the manuscript. A.P. contributed by drafting and revising the manuscript. A.L.U. contributed by drafting and revising the manuscript. G.Y. contributed by drafting the manuscript and editing the figures. S.L.M. contributed by drafting the manuscript, editing the figures and tables, providing supervision, securing funding, and revising the manuscript. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement Not applicable. Conflicts of Interest The authors declare no conflicts of interest. References 1. Gaitonde D.Y. Moore F.C. Morgan M.K. Influenza: Diagnosis and Treatment Am. Fam. Physician 2019 100 751 758 31845781 2. Stöhr K. Influenza—WHO cares Lancet Infect. Dis. 2002 2 517 10.1016/S1473-3099(02)00366-3 12206966 3. Ferdinands J.M. Thompson M.G. Blanton L. Spencer S. Grant L. Fry A.M. Does influenza vaccination attenuate the severity of breakthrough infections? A narrative review and recommendations for further research Vaccine 2021 39 3678 3695 10.1016/j.vaccine.2021.05.011 34090700 4. To J. Torres J. Viroporins in the Influenza Virus Cells 2019 8 654 10.3390/cells8070654 31261944 PMC6679168 5. Kreijtz J.H.C.M. Fouchier R.A.M. Rimmelzwaan G.F. Immune responses to influenza virus infection Virus Res. 2011 162 19 30 10.1016/j.virusres.2011.09.022 21963677 6. Influenza (Seasonal) Available online: https://www.who.int/news-room/fact-sheets/detail/influenza-(seasonal) (accessed on 6 June 2025) 7. Pandemic Influenza—Overview|Occupational Safety and Health Administration Available online: https://www.osha.gov/pandemic-influenza (accessed on 6 June 2025) 8. World Health Organization Emergency Cycle—Pandemic Influenza—A Threat That All Countries Need to Prepare for Available online: https://www.who.int/europe/emergencies/emergency-cycle/prepare/pandemic-influenza (accessed on 6 June 2025) 9. Ashraf M.A. Raza M.A. Amjad M.N. ud Din G. Yue L. Shen B. Chen L. Dong W. Xu H. Hu Y. A comprehensive review of influenza B virus, its biological and clinical aspects Front. Microbiol. 2024 15 1467029 10.3389/fmicb.2024.1467029 39296301 PMC11408344 10. Emerging Influenza D Virus Threat: What We Know so Far! Available online: https://www.mdpi.com/2077-0383/8/2/192 (accessed on 6 June 2025) 11. Liu B. Cao B. Wang C. Han B. Sun T. Miao Y. Lu Q. Cui F. Immunogenicity and Safety of Childhood Combination Vaccines: A Systematic Review and Meta-Analysis Vaccines 2022 10 472 10.3390/vaccines10030472 35335107 PMC8954135 12. Vaccines Available online: https://www.who.int/teams/global-influenza-programme/vaccines (accessed on 6 June 2025) 13. Influenza Vaccination for Elderly, Vulnerable and High-Risk Subjects: A Narrative Review and Expert Opinion—PMC Available online: https://pmc.ncbi.nlm.nih.gov/articles/PMC11039544/ (accessed on 6 June 2025) 10.1007/s11739-023-03456-9 PMC11039544 37891453 14. CDC H5 Bird Flu: Current Situation Available online: https://www.cdc.gov/bird-flu/situation-summary/index.html (accessed on 6 August 2025) 15. CDC CDC Confirms First Severe Case of H5N1 Bird Flu in the United States Available online: https://www.cdc.gov/media/releases/2024/m1218-h5n1-flu.html (accessed on 6 August 2025) 16. Cordeiro A.S. Patil-Sen Y. Shivkumar M. Patel R. Khedr A. Elsawy M.A. Nanovaccine Delivery Approaches and Advanced Delivery Systems for the Prevention of Viral Infections: From Development to Clinical Application Pharmaceutics 2021 13 2091 10.3390/pharmaceutics13122091 34959372 PMC8707864 17. Jones C.H. Hauguel T. Beitelshees M. Davitt M. Welch V. Lindert K. Allen P. True J.M. Dolsten M. Deciphering immune responses: A comparative analysis of influenza vaccination platforms Drug Discov. Today 2024 29 104125 10.1016/j.drudis.2024.104125 39097221 18. Mancini N. Solforosi L. Clementi N. De Marco D. Clementi M. Burioni R. A potential role for monoclonal antibodies in prophylactic and therapeutic treatment of influenza Antivir. Res. 2011 92 15 26 10.1016/j.antiviral.2011.07.013 21798290 19. Orenstein W.A. Offit P.A. Edwards K.M. Plotkin S.A. Plotkin’s Vaccines, E-Book Elsevier Health Sciences Amsterdam, The Netherlands 2022 978-0-323-79059-8 20. Krammer F. The human antibody response to influenza A virus infection and vaccination Nat. Rev. Immunol. 2019 19 383 397 10.1038/s41577-019-0143-6 30837674 21. Nuwarda R.F. Alharbi A.A. Kayser V. An overview of influenza viruses and vaccines Vaccines 2021 9 1032 10.3390/vaccines9091032 34579269 PMC8473132 22. Cox R.J. Correlates of protection to influenza virus, where do we go from here? Hum. Vaccines Immunother. 2013 9 405 408 10.4161/hv.22908 PMC3859764 23291930 23. Margine I. Krammer F. Hai R. Heaton N.S. Tan G.S. Andrews S.A. Runstadler J.A. Wilson P.C. Albrecht R.A. García-Sastre A. Hemagglutinin Stalk-Based Universal Vaccine Constructs Protect against Group 2 Influenza A Viruses J. Virol. 2013 87 10435 10446 10.1128/JVI.01715-13 23903831 PMC3807421 24. Gao R. Sheng Z. Sreenivasan C.C. Wang D. Li F. Influenza A Virus Antibodies with Antibody-Dependent Cellular Cytotoxicity Function Viruses 2020 12 276 10.3390/v12030276 32121563 PMC7150983 25. Zarnitsyna V.I. Ellebedy A.H. Davis C. Jacob J. Ahmed R. Antia R. Masking of antigenic epitopes by antibodies shapes the humoral immune response to influenza Philos. Trans. R. Soc. B Biol. Sci. 2015 370 20140248 10.1098/rstb.2014.0248 PMC4528424 26194761 26. Chen Y.-Q. Wohlbold T.J. Zheng N.-Y. Huang M. Huang Y. Neu K.E. Lee J. Wan H. Rojas K.T. Kirkpatrick E. Influenza Infection in Humans Induces Broadly Cross-Reactive and Protective Neuraminidase-Reactive Antibodies Cell 2018 173 417 429.e10 10.1016/j.cell.2018.03.030 29625056 PMC5890936 27. Smith G.E. Sun X. Bai Y. Liu Y.V. Massare M.J. Pearce M.B. Belser J.A. Maines T.R. Creager H.M. Glenn G.M. Neuraminidase-based recombinant virus-like particles protect against lethal avian influenza A(H5N1) virus infection in ferrets Virology 2017 509 90 97 10.1016/j.virol.2017.06.006 28624679 PMC5788299 28. McMichael A.J. Gotch F.M. Noble G.R. Beare P.A.S. Cytotoxic T-Cell Immunity to Influenza N. Engl. J. Med. 1983 309 13 17 10.1056/NEJM198307073090103 6602294 29. Brown L.E. Kelso A. Prospects for an influenza vaccine that induces cross-protective cytotoxic T lymphocytes Immunol. Cell Biol. 2009 87 300 308 10.1038/icb.2009.16 19308073 30. Brown D.M. Lampe A.T. Workman A.M. The Differentiation and Protective Function of Cytolytic CD4 T Cells in Influenza Infection Front. Immunol. 2016 7 93 10.3389/fimmu.2016.00093 27014272 PMC4783394 31. Romagnani S. Induction of TH1 and TH2 responses: A key role for the “natural” immune response? Immunol. Today 1992 13 379 381 10.1016/0167-5699(92)90083-J 1418371 32. Aleebrahim-Dehkordi E. Molavi B. Mokhtari M. Deravi N. Fathi M. Fazel T. Mohebalizadeh M. Koochaki P. Shobeiri P. Hasanpour-Dehkordi A. T helper type (Th1/Th2) responses to SARS-CoV-2 and influenza A (H1N1) virus: From cytokines produced to immune responses Transpl. Immunol. 2022 70 101495 10.1016/j.trim.2021.101495 34774738 PMC8579696 33. Jansen J.M. Gerlach T. Elbahesh H. Rimmelzwaan G.F. Saletti G. Influenza virus-specific CD4+ and CD8+ T cell-mediated immunity induced by infection and vaccination J. Clin. Virol. Off. Publ. Pan Am. Soc. Clin. Virol. 2019 119 44 52 10.1016/j.jcv.2019.08.009 31491709 34. van Riet E. Ainai A. Suzuki T. Hasegawa H. Mucosal IgA responses in influenza virus infections; thoughts for vaccine design Vaccine 2012 30 5893 5900 10.1016/j.vaccine.2012.04.109 22835738 35. Zheng M.Z.M. Wakim L.M. Tissue resident memory T cells in the respiratory tract Mucosal Immunol. 2022 15 379 388 10.1038/s41385-021-00461-z 34671115 PMC8526531 36. Sridhar S. Brokstad K.A. Cox R.J. Influenza Vaccination Strategies: Comparing Inactivated and Live Attenuated Influenza Vaccines Vaccines 2015 3 373 389 10.3390/vaccines3020373 26343192 PMC4494344 37. Types of Seasonal Influenza Vaccine Available online: https://www.who.int/europe/news-room/fact-sheets/item/types-of-seasonal-influenza-vaccine (accessed on 6 June 2025) 38. Dolan G.P. Harris R.C. Clarkson M. Sokal R. Morgan G. Mukaigawara M. Horiuchi H. Hale R. Stormont L. Béchard-Evans L. Vaccination of healthcare workers to protect patients at increased risk of acute respiratory disease: Summary of a systematic review Influenza Other Respir. Viruses 2013 7 93 96 10.1111/irv.12087 PMC5909400 24034492 39. The Human Antibody Response to Influenza a Virus Infection and Vaccination | Nature Reviews Immunology Available online: https://www.nature.com/articles/s41577-019-0143-6 (accessed on 6 August 2025) 10.1038/s41577-019-0143-6 30837674 40. Conners E.E. Screening and Testing for Hepatitis B Virus Infection: CDC Recommendations—United States, 2023 MMWR Recomm. Rep. 2023 72 1 25 10.15585/mmwr.rr7201a1 PMC9997714 36893044 41. Ambrose C.S. Levin M.J. The Rationale for Quadrivalent Influenza Vaccines Hum. Vaccines Immunother. 2012 8 81 88 10.4161/hv.8.1.17623 PMC3350141 22252006 42. Folegatti P.M. Pepin S. Tabar C. Fries K. Talanova O. See S. Essink B. Bertoch T. Drazan D. Natalini Martínez S. Comparative assessment of immunogenicity and safety of recombinant influenza vaccine in children, adolescents, and adults: Results from a phase 3, immunobridging, open-label, non-randomised study Lancet Infect. Dis. 2025 10.1016/S1473-3099(25)00153-7 40412421 43. Krammer F. Palese P. Universal Influenza Virus Vaccines That Target the Conserved Hemagglutinin Stalk and Conserved Sites in the Head Domain J. Infect. Dis. 2019 219 S62 S67 10.1093/infdis/jiy711 30715353 PMC6452318 44. Sedova E.S. Shcherbinin D.N. Migunov A.I. Smirnov I.A. Logunov D.I. Shmarov M.M. Tsybalova L.M. Naroditskiĭ B.S. Kiselev O.I. Gintsburg A.L. Recombinant Influenza Vaccines Acta Naturae 2012 4 17 27 10.32607/20758251-2012-4-4-17-27 23346377 PMC3548171 45. Novavax A Phase 3, Randomized, Observer-Blinded, Active-Controlled Trial to Evaluate Immunogenicity; Safety of a Recombinant Quadrivalent Nanoparticle Influenza Vaccine (Quad-NIV) with Matrix-M1TM Adjuvant Against Fluzone ® 2023 Available online: https://clinicaltrials.gov/study/NCT04120194 (accessed on 6 August 2025) 46. National Institute of Allergy and Infectious Diseases (NIAID) Randomized, Double-Blinded, Placebo-Controlled, Phase 1 Study of the Safety and Immunogenicity of BPL-1357, A BPL-Inactivated, Whole-Virus, Universal Influenza Vaccine 2025 Available online: https://clinicaltrials.gov/study/NCT05027932 (accessed on 6 August 2025) 47. Radboud University Medical Center First-in-Human Trial of the Coronavirus Virus-like Particle Subunit Vaccine ABNCoV2 in SARS-CoV-2-Naïve Adult Volunteers in Good Health 2023 Available online: https://onderzoekmetmensen.nl/en/node/50898/pdf (accessed on 6 August 2025) 48. BioNTech SE A PHASE 1/2/3, Placebo-Controlled, Randomized, Observer-Blind, Dose-Finding Study to Evaluate the Safety, Tolerability, Immunogenicity, and Efficacy of SARS-COV-2 RNA Vaccine Candidates Against COVID-19 in Healthy Individuals 2023 Available online: https://clinicaltrials.gov/study/NCT04368728 (accessed on 6 August 2025) 49. ModernaTX, Inc A Phase 1/2, Randomized, Stratified, Observer-Blind, Dose-Ranging Study to Evaluate the Safety, Reactogenicity, and Immunogenicity of mRNA-1010 Seasonal Influenza Vaccine in Healthy Adults 18 Years and Older 2023 Available online: https://clinicaltrials.gov/study/NCT04956575 (accessed on 6 August 2025) 50. National Institute of Allergy and Infectious Diseases (NIAID) VRC 321: A Phase I Open-Label Clinical Trial to Evaluate Dose, Safety, Tolerability, and Immunogenicity of an Influenza H1 Stabilized Stem Ferritin Vaccine, VRCFLUNPF099-00-VP, in Healthy Adults 2022 Available online: https://clinicaltrials.gov/study/NCT03814720 (accessed on 6 August 2025) 51. Hartikka J. Bozoukova V. Yang C.K. Ye M. Rusalov D. Shlapobersky M. Vilalta A. Wei Q. Rolland A. Smith L.R. Vaxfectin ® Vaccine 2009 27 6399 6403 10.1016/j.vaccine.2009.06.014 19552895 52. Trombetta C.M. Kistner O. Montomoli E. Viviani S. Marchi S. Influenza Viruses and Vaccines: The Role of Vaccine Effectiveness Studies for Evaluation of the Benefits of Influenza Vaccines Vaccines 2022 10 714 10.3390/vaccines10050714 35632470 PMC9143275 53. Evaluation of Influenza Vaccine Effectiveness—A Guide to the Design and Interpretation of Observational Studies Available online: https://www.who.int/publications/i/item/9789241512121 (accessed on 6 June 2025) 54. Rajaram S. Wojcik R. Moore C. Ortiz de Lejarazu R. de Lusignan S. Montomoli E. Rossi A. Pérez-Rubio A. Trilla A. Baldo V. The impact of candidate influenza virus and egg-based manufacture on vaccine effectiveness: Literature review and expert consensus Vaccine 2020 38 6047 6056 10.1016/j.vaccine.2020.06.021 32600916 55. Jones-Gray E. Robinson E.J. Kucharski A.J. Fox A. Sullivan S.G. Does repeated influenza vaccination attenuate effectiveness? A systematic review and meta-analysis Lancet Respir. Med. 2023 11 27 44 10.1016/S2213-2600(22)00266-1 36152673 PMC9780123 56. CDC Benefits of the Flu Vaccine Available online: https://www.cdc.gov/flu-vaccines-work/benefits/index.html (accessed on 6 August 2025) 57. Dunkle L.M. Izikson R. Patriarca P. Goldenthal K.L. Muse D. Callahan J. Cox M.M. Efficacy of Recombinant Influenza Vaccine in Adults 50 Years of Age or Older N. Engl. J. Med. 2017 376 2427 2436 10.1056/NEJMoa1608862 28636855 58. CDC Flu Vaccine Effectiveness (VE) Data for 2022–2023 Available online: https://www.cdc.gov/flu-vaccines-work/php/effectiveness-studies/2022-2023.html (accessed on 6 August 2025) 59. CDC U.S. Flu Vaccine Effectiveness (VE) Data for 2021–2022 Available online: https://www.cdc.gov/flu-vaccines-work/php/effectiveness-studies/2021-2022.html (accessed on 6 August 2025) 60. News Release Available online: https://feeds.issuerdirect.com/news-release.html?newsid=4899326521164266&symbol=MRNA (accessed on 6 August 2025) 61. Skehel J.J. Wiley D.C. Receptor Binding and Membrane Fusion in Virus Entry: The Influenza Hemagglutinin Annu. Rev. Biochem. 2000 69 531 569 10.1146/annurev.biochem.69.1.531 10966468 62. Gao Z. Robinson K. Skowronski D.M. De Serres G. Withers S.G. Quantification of the total neuraminidase content of recent commercially-available influenza vaccines: Introducing a neuraminidase titration reagent Vaccine 2020 38 715 718 10.1016/j.vaccine.2019.11.041 31818533 63. Gouma S. Anderson E.M. Hensley S.E. Challenges of Making Effective Influenza Vaccines Annu. Rev. Virol. 2020 7 495 512 10.1146/annurev-virology-010320-044746 32392457 PMC7529958 64. Treanor J. Influenza vaccine--outmaneuvering antigenic shift and drift N. Engl. J. Med. 2004 350 218 220 10.1056/NEJMp038238 14724300 65. Influenza | Nature Reviews Disease Primers Available online: https://www.nature.com/articles/s41572-018-0002-y (accessed on 7 August 2025) 66. Ziegler T. Mamahit A. Cox N.J. 65 years of influenza surveillance by a World Health Organization-coordinated global network Influenza Other Respir. Viruses 2018 12 558 565 10.1111/irv.12570 29727518 PMC6086847 67. Barr I.G. McCauley J. Cox N. Daniels R. Engelhardt O.G. Fukuda K. Grohmann G. Hay A. Kelso A. Klimov A. Epidemiological, antigenic and genetic characteristics of seasonal influenza A(H1N1), A(H3N2) and B influenza viruses: Basis for the WHO recommendation on the composition of influenza vaccines for use in the 2009–2010 northern hemisphere season Vaccine 2010 28 1156 1167 10.1016/j.vaccine.2009.11.043 20004635 68. Ravina Manjeet Mohan H. Narang J. Pundir S. Pundir C.S. A changing trend in diagnostic methods of Influenza A (H3N2) virus in human: A review 3 Biotech 2021 11 87 10.1007/s13205-021-02642-w PMC7816835 33495723 69. Smith D.J. Lapedes A.S. de Jong J.C. Bestebroer T.M. Rimmelzwaan G.F. Osterhaus A.D.M.E. Fouchier R.A.M. Mapping the antigenic and genetic evolution of influenza virus Science 2004 305 371 376 10.1126/science.1097211 15218094 70. Cobey S. Hensley S.E. Immune history and influenza virus susceptibility Curr. Opin. Virol. 2017 22 105 111 10.1016/j.coviro.2016.12.004 28088686 PMC5467731 71. Gerdil C. The annual production cycle for influenza vaccine Vaccine 2003 21 1776 1779 10.1016/S0264-410X(03)00071-9 12686093 72. Hu L. Lao G. Liu R. Feng J. Long F. Peng T. The race toward a universal influenza vaccine: Front runners and the future directions Antiviral Res. 2023 210 105505 10.1016/j.antiviral.2022.105505 36574905 73. Despite Global Influenza Vaccine Production Remaining Steady, Production and Distribution Challenges Remain Available online: https://www.who.int/news/item/25-03-2025-despite-global-influenza-vaccine-production-remaining-steady--production-and-distribution-challenges-remain (accessed on 6 June 2025) 74. Ashraf M.A. Raza M.A. Imran A. Amjad M.N. Next-generation vaccines for influenza B virus: Advancements and challenges Arch. Virol. 2025 170 25 10.1007/s00705-024-06210-4 39762648 75. Alshagrawi S. Impact of COVID-19 pandemic on influenza vaccination rate among health care workers Hum. Vaccines Immunother. 2024 20 2426284 10.1080/21645515.2024.2426284 PMC11556272 39523588 76. Alshagrawi S. Hazazi A. Impact of COVID-19 pandemic on influenza vaccination rates among healthcare workers and the general population in Saudi Arabia: A meta-analysis Hum. Vaccines Immunother. 2025 21 2477954 10.1080/21645515.2025.2477954 PMC11901379 40068961 77. Influenza Vaccination During the COVID-19 Pandemic IFPMA Available online: https://www.ifpma.org/wp-content/uploads/2023/01/i2023_IFPMA_HPP_Influenza_vaccination_during_COVID-19_pandemic.pdf (accessed on 6 June 2025) 78. Debbag R. Rudin D. Ceddia F. Watkins J. The Impact of Vaccination on COVID-19, Influenza, and Respiratory Syncytial Virus-Related Outcomes: A Narrative Review Infect. Dis. Ther. 2025 14 63 97 10.1007/s40121-024-01079-x 39739199 PMC11724835 79. Awate S. Babiuk L.A. Mutwiri G. Mechanisms of Action of Adjuvants Front. Immunol. 2013 4 114 10.3389/fimmu.2013.00114 23720661 PMC3655441 80. Vicente S. Prego C. Csaba N. Alonso M.J. From single-dose vaccine delivery systems to nanovaccines J. Drug Deliv. Sci. Technol. 2010 20 267 276 10.1016/S1773-2247(10)50044-3 81. Zhao L. Seth A. Wibowo N. Zhao C.-X. Mitter N. Yu C. Middelberg A.P.J. Nanoparticle vaccines Vaccine 2014 32 327 337 10.1016/j.vaccine.2013.11.069 24295808 82. Nandedkar T.D. Nanovaccines: Recent developments in vaccination J. Biosci. 2009 34 995 1003 10.1007/s12038-009-0114-3 20093753 83. Sutherland T.E. Dyer D.P. Allen J.E. The extracellular matrix and the immune system: A mutually dependent relationship Science 2023 379 eabp8964 10.1126/science.abp8964 36795835 84. Priyanka Abusalah M.A.H. Chopra H. Sharma A. Mustafa S.A. Choudhary O.P. Sharma M. Dhawan M. Khosla R. Loshali A. Nanovaccines: A game changing approach in the fight against infectious diseases Biomed. Pharmacother. 2023 167 115597 10.1016/j.biopha.2023.115597 37783148 85. Pati R. Shevtsov M. Sonawane A. Nanoparticle Vaccines Against Infectious Diseases Front. Immunol. 2018 9 2224 10.3389/fimmu.2018.02224 30337923 PMC6180194 86. Poria R. Kala D. Nagraik R. Dhir Y. Dhir S. Singh B. Kaushik N.K. Noorani M.S. Kaushal A. Gupta S. Vaccine development: Current trends and technologies Life Sci. 2024 336 122331 10.1016/j.lfs.2023.122331 38070863 87. Grgacic E.V.L. Anderson D.A. Virus-like particles: Passport to immune recognition Methods San Diego Calif 2006 40 60 65 10.1016/j.ymeth.2006.07.018 16997714 PMC7128828 88. Young K.R. Ross T.M. Particle-based vaccines for HIV-1 infection Curr. Drug Targets Infect. Disord. 2003 3 151 169 10.2174/1568005033481213 12769792 89. Zhao Q. Li S. Yu H. Xia N. Modis Y. Virus-like particle-based human vaccines: Quality assessment based on structural and functional properties Trends Biotechnol. 2013 31 654 663 10.1016/j.tibtech.2013.09.002 24125746 90. Bright R.A. Carter D.M. Daniluk S. Toapanta F.R. Ahmad A. Gavrilov V. Massare M. Pushko P. Mytle N. Rowe T. Influenza virus-like particles elicit broader immune responses than whole virion inactivated influenza virus or recombinant hemagglutinin Vaccine 2007 25 3871 3878 10.1016/j.vaccine.2007.01.106 17337102 91. Taylor D.N. Treanor J.J. Strout C. Johnson C. Fitzgerald T. Kavita U. Ozer K. Tussey L. Shaw A. Induction of a potent immune response in the elderly using the TLR-5 agonist, flagellin, with a recombinant hemagglutinin influenza-flagellin fusion vaccine (VAX125, STF2.HA1 SI) Vaccine 2011 29 4897 4902 10.1016/j.vaccine.2011.05.001 21596084 92. Wang B.-Z. Quan F.-S. Kang S.-M. Bozja J. Skountzou I. Compans R.W. Incorporation of membrane-anchored flagellin into influenza virus-like particles enhances the breadth of immune responses J. Virol. 2008 82 11813 11823 10.1128/JVI.01076-08 18786995 PMC2583664 93. Tao P. Zhu J. Mahalingam M. Batra H. Rao V.B. Bacteriophage T4 nanoparticles for vaccine delivery against infectious diseases Adv. Drug Deliv. Rev. 2019 145 57 72 10.1016/j.addr.2018.06.025 29981801 PMC6759415 94. Patterson D.P. Rynda-Apple A. Harmsen A.L. Harmsen A.G. Douglas T. Biomimetic antigenic nanoparticles elicit controlled protective immune response to influenza ACS Nano 2013 7 3036 3044 10.1021/nn4006544 23540530 PMC3773536 95. Fritze D. Taxonomy of the genus bacillus and related genera: The aerobic endospore-forming bacteria Phytopathology 2004 94 1245 1248 10.1094/PHYTO.2004.94.11.1245 18944461 96. McKenney P.T. Driks A. Eichenberger P. The Bacillus subtilis endospore: Assembly and functions of the multilayered coat Nat. Rev. Microbiol. 2013 11 33 44 10.1038/nrmicro2921 23202530 PMC9910062 97. Ciabattini A. Parigi R. Isticato R. Oggioni M.R. Pozzi G. Oral priming of mice by recombinant spores of Bacillus subtilis Vaccine 2004 22 4139 4143 10.1016/j.vaccine.2004.05.001 15474704 98. Duc L.H. Hong H.A. Fairweather N. Ricca E. Cutting S.M. Bacterial spores as vaccine vehicles Infect. Immun. 2003 71 2810 2818 10.1128/IAI.71.5.2810-2818.2003 12704155 PMC153275 99. Zhao G. Miao Y. Guo Y. Qiu H. Sun S. Kou Z. Yu H. Li J. Chen Y. Jiang S. Development of a heat-stable and orally delivered recombinant M2e-expressing B. subtilis spore-based influenza vaccine Hum. Vaccines Immunother. 2014 10 3649 3658 10.4161/hv.36122 PMC4514050 25483702 100. Song M. Hong H.A. Huang J.-M. Colenutt C. Khang D.D. Nguyen T.V.A. Park S.-M. Shim B.-S. Song H.H. Cheon I.S. Killed Bacillus subtilis spores as a mucosal adjuvant for an H5N1 vaccine Vaccine 2012 30 3266 3277 10.1016/j.vaccine.2012.03.016 22446640 101. Ferreira S.S. Passos C.P. Madureira P. Vilanova M. Coimbra M.A. Structure-function relationships of immunostimulatory polysaccharides: A review Carbohydr. Polym. 2015 132 378 396 10.1016/j.carbpol.2015.05.079 26256362 102. Mbow M.L. De Gregorio E. Valiante N.M. Rappuoli R. New adjuvants for human vaccines Curr. Opin. Immunol. 2010 22 411 416 10.1016/j.coi.2010.04.004 20466528 103. Zhao K. Shi X. Zhao Y. Wei H. Sun Q. Huang T. Zhang X. Wang Y. Preparation and immunological effectiveness of a swine influenza DNA vaccine encapsulated in chitosan nanoparticles Vaccine 2011 29 8549 8556 10.1016/j.vaccine.2011.09.029 21945253 104. Li Q. von Ehrlich-Treuenstätt V. Schardey J. Wirth U. Zimmermann P. Andrassy J. Bazhin A.V. Werner J. Kühn F. Gut Barrier Dysfunction and Bacterial Lipopolysaccharides in Colorectal Cancer J. Gastrointest. Surg. Off. J. Soc. Surg. Aliment. Tract 2023 27 1466 1472 10.1007/s11605-023-05654-4 PMC10366024 36973501 105. Ahmed A.A.Q. Besio R. Xiao L. Forlino A. Outer Membrane Vesicles (OMVs) as Biomedical Tools and Their Relevance as Immune-Modulating Agents against H. pylori Infections: Current Status and Future Prospects Int. J. Mol. Sci. 2023 24 8542 10.3390/ijms24108542 37239888 PMC10218342 106. Schick J. Altunay M. Lacorcia M. Marschner N. Westermann S. Schluckebier J. Schubart C. Bodendorfer B. Christensen D. Alexander C. IL-4 and helminth infection downregulate MINCLE-dependent macrophage response to mycobacteria and Th17 adjuvanticity eLife 2023 12 e72923 10.7554/eLife.72923 36753434 PMC9908076 107. Shehata M.M. Mostafa A. Teubner L. Mahmoud S.H. Kandeil A. Elshesheny R. Boubak T.A. Frantz R. Pietra L.L. Pleschka S. Bacterial Outer Membrane Vesicles (OMVs)-Based Dual Vaccine for Influenza A H1N1 Virus and MERS-CoV Vaccines 2019 7 46 10.3390/vaccines7020046 31141982 PMC6631769 108. Jiang Y. Cai X. Yao J. Guo H. Yin L. Leung W. Xu C. Role of Extracellular Vesicles in Influenza Virus Infection Front. Cell. Infect. Microbiol. 2020 10 366 10.3389/fcimb.2020.00366 32850473 PMC7396637 109. Pordanjani P.M. Bolhassani A. Milani A. Pouriayevali M.H. Extracellular vesicles in vaccine development and therapeutic approaches for viral diseases Process Biochem. 2023 128 167 180 10.1016/j.procbio.2023.02.028 110. Sabanovic B. Piva F. Cecati M. Giulietti M. Promising Extracellular Vesicle-Based Vaccines against Viruses, Including SARS-CoV-2 Biology 2021 10 94 10.3390/biology10020094 33513850 PMC7912280 111. Santos P. Almeida F. Exosome-Based Vaccines: History, Current State, and Clinical Trials Front. Immunol. 2021 12 711565 10.3389/fimmu.2021.711565 34335627 PMC8317489 112. Turner C.T. McInnes S.J.P. Voelcker N.H. Cowin A.J. Therapeutic Potential of Inorganic Nanoparticles for the Delivery of Monoclonal Antibodies J. Nanomater. 2015 2015 309602 10.1155/2015/309602 113. Dreaden E.C. Alkilany A.M. Huang X. Murphy C.J. El-Sayed M.A. The golden age: Gold nanoparticles for biomedicine Chem. Soc. Rev. 2012 41 2740 2779 10.1039/C1CS15237H 22109657 PMC5876014 114. Wang C. Zhu W. Luo Y. Wang B.-Z. Gold nanoparticles conjugating recombinant influenza hemagglutinin trimers and flagellin enhanced mucosal cellular immunity Nanomedicine Nanotechnol. Biol. Med. 2018 14 1349 1360 10.1016/j.nano.2018.03.007 29649593 PMC6177327 115. Tao W. Gill H.S. M2e-immobilized gold nanoparticles as influenza A vaccine: Role of soluble M2e and longevity of protection Vaccine 2015 33 2307 2315 10.1016/j.vaccine.2015.03.063 25842219 PMC4418433 116. Neto L.M.M. Zufelato N. de Sousa-Júnior A.A. Trentini M.M. da Costa A.C. Bakuzis A.F. Kipnis A. Junqueira-Kipnis A.P. Specific T cell induction using iron oxide based nanoparticles as subunit vaccine adjuvant Hum. Vaccines Immunother. 2018 14 2786 2801 10.1080/21645515.2018.1489192 29913109 PMC6314432 117. Rojas J.M. Sanz-Ortega L. Mulens-Arias V. Gutiérrez L. Pérez-Yagüe S. Barber D.F. Superparamagnetic iron oxide nanoparticle uptake alters M2 macrophage phenotype, iron metabolism, migration and invasion Nanomed. Nanotechnol. Biol. Med. 2016 12 1127 1138 10.1016/j.nano.2015.11.020 26733263 118. Mody K.T. Popat A. Mahony D. Cavallaro A.S. Yu C. Mitter N. Mesoporous silica nanoparticles as antigen carriers and adjuvants for vaccine delivery Nanoscale 2013 5 5167 5179 10.1039/c3nr00357d 23657437 119. Carvalho L.V. de Ruiz R.C. Scaramuzzi K. Marengo E.B. Matos J.R. Tambourgi D.V. Fantini M.C.A. Sant’Anna O.A. Immunological parameters related to the adjuvant effect of the ordered mesoporous silica SBA-15 Vaccine 2010 28 7829 7836 10.1016/j.vaccine.2010.09.087 20937318 120. Tenchov R. Bird R. Curtze A.E. Zhou Q. Lipid Nanoparticles─From Liposomes to mRNA Vaccine Delivery, a Landscape of Research Diversity and Advancement ACS Nano 2021 15 16982 17015 10.1021/acsnano.1c04996 34181394 121. Fries C.N. Curvino E.J. Chen J.-L. Permar S.R. Fouda G.G. Collier J.H. Advances in nanomaterial vaccine strategies to address infectious diseases impacting global health Nat. Nanotechnol. 2021 16 1 14 10.1038/s41565-020-0739-9 32807876 122. Jain S. O’Hagan D.T. Singh M. The long-term potential of biodegradable poly(lactide-co-glycolide) microparticles as the next-generation vaccine adjuvant Expert Rev. Vaccines 2011 10 1731 1742 10.1586/erv.11.126 22085176 123. Thomas C. Rawat A. Hope-Weeks L. Ahsan F. Aerosolized PLA and PLGA nanoparticles enhance humoral, mucosal and cytokine responses to hepatitis B vaccine Mol. Pharm. 2011 8 405 415 10.1021/mp100255c 21189035 124. Pawar D. Mangal S. Goswami R. Jaganathan K.S. Development and characterization of surface modified PLGA nanoparticles for nasal vaccine delivery: Effect of mucoadhesive coating on antigen uptake and immune adjuvant activity Eur. J. Pharm. Biopharm. Off. J. Arbeitsgem. Pharm. Verfahrenstech. EV 2013 85 550 559 10.1016/j.ejpb.2013.06.017 23831265 125. Panyam J. Labhasetwar V. Biodegradable nanoparticles for drug and gene delivery to cells and tissue Adv. Drug Deliv. Rev. 2003 55 329 347 10.1016/S0169-409X(02)00228-4 12628320 126. Kim H. Kirtane A.R. Kim N.Y. Rajesh N.U. Tang C. Ishida K. Hayward A.M. Langer R. Traverso G. Gastrointestinal Delivery of an mRNA Vaccine Using Immunostimulatory Polymeric Nanoparticles AAPS J. 2023 25 81 10.1208/s12248-023-00844-z 37589795 PMC10845796 127. Deng L. Wang B.-Z. A perspective of nanoparticle universal influenza vaccines ACS Infect. Dis. 2018 4 1656 1665 10.1021/acsinfecdis.8b00206 30394725 PMC8650199 128. Jitoboam K. Phaonakrop N. Libsittikul S. Thepparit C. Roytrakul S. Smith D.R. Actin Interacts with Dengue Virus 2 and 4 Envelope Proteins PLoS ONE 2016 11 e0151951 10.1371/journal.pone.0151951 27010925 PMC4806980 129. Petousis-Harris H. Poole T. Stewart J. Turner N. Goodyear-Smith F. Coster G. Lennon D. An investigation of three injections techniques in reducing local injection pain with a human papillomavirus vaccine: A randomized trial Vaccine 2013 31 1157 1162 10.1016/j.vaccine.2012.12.064 23306361 130. Hemagglutinin-stem nanoparticles generate heterosubtypic influenza protection|Nature Medicine Available online: https://www.nature.com/articles/nm.3927 (accessed on 7 August 2025) 10.1038/nm.3927 26301691 131. Wöll S. Schiller S. Bachran C. Swee L.K. Scherließ R. Pentaglycine lipid derivates—rp-HPLC analytics for bioorthogonal anchor molecules in targeted, multiple-composite liposomal drug delivery systems Int. J. Pharm. 2018 547 602 610 10.1016/j.ijpharm.2018.05.052 29807093 132. Wang L. Xiao T. Xu C. Li J. Liu G. Yin K. Cui Y. Wei Q. Huang B. Sun H. Protective immune response against Toxoplasma gondii Vaccine 2018 36 3943 3948 10.1016/j.vaccine.2018.05.072 29793893 133. Pielak R.M. Chou J.J. Influenza M2 proton channels Biochim. Biophys. Acta 2011 1808 522 529 10.1016/j.bbamem.2010.04.015 20451491 PMC3108042 134. Stauffer S. Feng Y. Nebioglu F. Heilig R. Picotti P. Helenius A. Stepwise priming by acidic pH and a high K+ concentration is required for efficient uncoating of influenza A virus cores after penetration J. Virol. 2014 88 13029 13046 10.1128/JVI.01430-14 25165113 PMC4249060 135. De Jong N.M.C. Aartse A. Van Gils M.J. Eggink D. Development of broadly reactive influenza vaccines by targeting the conserved regions of the hemagglutinin stem and head domains Expert Rev. Vaccines 2020 19 563 577 10.1080/14760584.2020.1777861 32510256 136. Nguyen Q.-T. Choi Y.-K. Targeting Antigens for Universal Influenza Vaccine Development Viruses 2021 13 973 10.3390/v13060973 34073996 PMC8225176 137. Wang W.-C. Sayedahmed E.E. Sambhara S. Mittal S.K. Progress towards the Development of a Universal Influenza Vaccine Viruses 2022 14 1684 10.3390/v14081684 36016306 PMC9415875 138. Yassine H.M. Boyington J.C. McTamney P.M. Wei C.-J. Kanekiyo M. Kong W.-P. Gallagher J.R. Wang L. Zhang Y. Joyce M.G. Hemagglutinin-stem nanoparticles generate heterosubtypic influenza protection Nat. Med. 2015 21 1065 1070 10.1038/nm.3927 26301691 139. Akingbola A. Adegbesan A. Adegoke K. Idahor C. Mariaria P. Peters F. Salami R.A. Ojo O. Nwaeze E. Abdullahi O. Comparing Moderna’s mRNA-1083 and Pfizer’s dual-target mRNA vaccines for influenza and COVID-19 NPJ Vaccines 2025 10 105 10.1038/s41541-025-01145-6 40413212 PMC12103547 140. Gupta D. Mohan S. Influenza vaccine: A review on current scenario and future prospects J. Genet. Eng. Biotechnol. 2023 21 154 10.1186/s43141-023-00581-y 38030859 PMC10686931 Figure 1 Immune responses to influenza viruses. Abbreviations: CD8, cluster of differentiation 8; PA, polymerase acidic; PB1, polymerase basic protein 1; PB2, polymerase basic 2; RNP, ribonucleoprotein [ 17 Figure 2 Various types of influenza vaccine. Image was created by BioRender. Figure 3 Phylogenetic tree of influenza antigens. Image was created by BioRender. Figure 7 ( i ii iii iv 126 http://creativecommons.org/licenses/by/4.0/ Figure 8 Diagrammatic representation of antigen design approaches. The figure shows the evolution of influenza vaccine strategies, from traditional techniques, such as whole inactivated virus vaccines, live attenuated virus vaccines, split inactivated virus vaccine, and HA and NA subunits of the virus, to the development of broader and universal vaccines that cover conserved sequences in the HA protein. Although existing vaccines primarily induce antibodies to the variable HA1 domain, new strategies target the conserved HA2 stalk domain [ 65 138 vaccines-13-00890-t001_Table 1 Table 1 Different vaccines under clinical trials. Product Name Developer Company Disease Nanocarrier System Viral Antigen Cargo Clinical Trial (Registration Number) Marketing Authorization Ref. NanoFlu Novavax Influenza Virus-like particle (VLP) rHA (H1N1, H3N2, B-Yamagata, B-Victoria) Phase III ( NCT04120194 No [ 45 IVX-411 Icosavax SARS-CoV-2 VLP (I53-50 scaffold) SARS-CoV-2 RBD trimer Phase I/II ( NCT05027932 No [ 46 ABNCoV2 AdaptVac SARS-CoV-2 Capsid VLP (cVLP) SARS-CoV-2 RBD Phase II ( NCT04839146 No [ 47 BNT162b2 Pfizer/BioNTech SARS-CoV-2 Lipid Nanoparticle (LNP) mRNA-encoding SARS-CoV-2 spike protein Phase III ( NCT04368728 Yes (Emergency Use) [ 48 mRNA-1010 Moderna Influenza Lipid Nanoparticle (LNP) mRNA-encoding HA (H1, H3, B-Yam, B-Vic) Phase I/II ( NCT04956575 No [ 49 Ferritin-HA NIH/VRC Influenza Ferritin Nanoparticle Hemagglutinin (H1, H3, B) Phase I ( NCT03814720 No [ 50 Vaxfectin ® Vical Inc. Influenza Cationic lipid (Vaxfectin ® DNA plasmid encoding HA Phase I (NCT00709877) No [ 51 ",
  "metadata": {
    "Title of this paper": "Influenza vaccine: A review on current scenario and future prospects",
    "Journal it was published in:": "Vaccines",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474260/"
  }
}