{
  "title": "Paper_1199",
  "abstract": "pmc Bioengineering (Basel) Bioengineering (Basel) 3241 bioeng bioengineering Bioengineering 2306-5354 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12466996 PMC12466996.1 12466996 12466996 41007192 10.3390/bioengineering12090944 bioengineering-12-00944 1 Review Smart Microbiomes: How AI Is Revolutionizing Personalized Medicine Alexandrescu Luana 1 2 Tofolean Ionut Tiberiu 1 2 * Condur Laura Maria 2 https://orcid.org/0000-0003-4057-348X Tofolean Doina Ecaterina 2 3 https://orcid.org/0000-0002-6702-7086 Nicoara Alina Doina 4 Serbanescu Lucian 2 Rusu Elena 5 * https://orcid.org/0000-0002-5872-4381 Twakor Andreea Nelson 4 https://orcid.org/0000-0002-7268-3723 Dumitru Eugen 1 2 https://orcid.org/0000-0002-9550-3537 Dumitru Andrei 1 Tocia Cristina 1 2 Herlo Lucian Flavius 6 7 Alexandrescu Daria Maria 5 Stanigut Alina Mihaela 2 6 7 Balan Venkatesh Academic Editor 1 alexandrescu_l@yahoo.com eugen.dumitru@yahoo.com dr.andreidumitru@gmail.com cristina.tocia@yahoo.com 2 lauracondur@yahoo.com tofoleandoina@yahoo.com lucian.serbanescu@365.univ-ovidius.ro alina.stanigut@365.univ-ovidius.ro 3 4 alina.nicoara@365.univ-ovidius.ro andreea.purcaru@365.univ-ovidius.ro 5 alexandrescu_daria@yahoo.com 6 flavius.herlo@umft.ro 7 * tofoleanioan@yahoo.com elenarusu98@yahoo.com 31 8 2025 9 2025 12 9 497612 944 21 6 2025 26 8 2025 29 8 2025 31 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background: Results: Conclusions: gut microbiota chronic inflammation probiotics gastrointestinal disorders metabolic diseases autoimmune diseases machine learning artificial intelligence This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The human intestine harbors a vast community of commensal microorganisms, collectively known as the gut microbiota. These microbes, numbering in the trillions, collectively possess a genetic repertoire estimated to be over 100 times larger than that of the human genome [ 1 In this review, we define dysbiosis not only as a broad imbalance of the gut microbiota but also in terms of measurable ecological features. Dysbiosis may involve the loss of keystone taxa, a reduction in functional diversity, or a shift in overall community structure. To quantify these changes, researchers frequently rely on ecological diversity and dissimilarity metrics. For example, Bray–Curtis dissimilarity is often used to measure differences in microbial composition between individuals or cohorts, while Shannon and Simpson diversity indices capture both richness and evenness of species distributions within a sample. In addition, evenness metrics help evaluate whether a microbial community is dominated by only a few taxa or is more uniformly distributed. Together, these indices provide a standardized way to capture and compare dysbiotic states across studies. Prior studies have shown that reduced functional diversity of human gut microbiota is a critical factor in the development of diabetes, obesity, inflammatory bowel disease, liver diseases, and some neurological disorders, including autism spectrum disorder, as well as cardiovascular diseases and cancer of the colon and rectum [ 2 3 4 Pathological conditions, which include chronic inflammatory diseases (CIDs), metabolic disorders, and autoimmune diseases are thought to be related to changes in the composition and function of the gut microbiota [ 5 6 7 Recent advances in artificial intelligence have also introduced hybrid deep-learning architectures and explainable AI methods that can be adapted for microbiome applications [ 8 9 10 11 In parallel, there has been an increased interest in the use of probiotics to treat and change the gut microbiota. Restoring microbial homeostasis and lowering inflammatory reactions in the gut is promised by probiotic mixtures with particular selected strains [ 12 Several reviews have previously examined the intersection of the gut microbiome and artificial intelligence; however, most have remained descriptive or limited in technical depth [ 13 14 Our review differs by integrating a more detailed discussion of methodological considerations such as preprocessing, validation, and bias correction, along with quantitative summaries of landmark AI/ML studies. In addition, we highlight emerging approaches, including autoencoder-based dimensionality reduction, federated learning, and explainable AI. Further, we discuss the concept of dysbiosis and its associations with human diseases. Here, we provide an overview of current microbiome modulation strategies such as diet, probiotics, and fecal microbiota transplantation, and we present the main machine-learning categories and analytical workflows relevant to microbiome data. We also summarize key case studies with quantitative outcomes that illustrate the application of AI/ML in this field; and finally, we examine the challenges, limitations, and future directions that must be addressed to translate these approaches into precision medicine. 1.1. The Gut Microbiota in Human Diseases Numerous investigations have indicated that the disruption of the gut microbiota is believed to be responsible for the development and progression of human diseases, as reported recently. For instance, obesity is linked with higher Firmicutes/Bacteroidetes Akkermansia Faecalibacterium 15 Roseburia hominis Faecalibacterium prausnitziii Escherichia coli 16 Firmicutes Faecalibacterium prausnitzii Bifidobacterium adolescentis 17 Parvimonas micra Solobacterium moorei 18 Actinobacteria 19 1.2. The Use of Gut Microbiota as a Potential Treatment Option There is emerging evidence that suggests the modification of the gut microbiota may be beneficial for disease prevention and/or treatment through dietary interventions, fecal microbiota transplantation (FMT), or probiotic and/or prebiotic supplements [ 20 21 Clostridioides difficile infection 22 23 24 25 26 2. Methodology To ensure a comprehensive overview, we conducted a structured literature search in PubMed, Web of Science, and Google Scholar covering the years 2010 to 2025. The search focused on studies applying artificial intelligence and machine-learning approaches to gut microbiome datasets. Inclusion criteria were: (i) original research articles, (ii) studies conducted in human cohorts or large-scale animal models, (iii) explicit application of AI/ML algorithms, and (iv) relevance to disease classification, biomarker discovery, or therapeutic prediction. We excluded reviews, editorials, and studies that did not implement AI/ML methods. 3. Technologies Used in Microbiome Studies Lately, AI has been a topical theme, emerging as one of the most advanced and powerful tools used to analyze any set or cluster of interrelated, connected, or dependent complex indeterminate information pertaining to the specific domain of microbiota. AI brings additional aspects of understanding the relationships between human health and gut microbiota. This is because of its capacity to process and analyze humongous amounts of data single handedly and also identify concealed correlations [ 27 Table 1 Each method has distinct advantages and challenges that impact its applicability in different research and clinical settings. Further, 16S rRNA profiling provides high sensitivity but has limitations in taxonomic resolution and functional characterization [ 35 36 37 38 Figure 1 Figure 1 AI technology, capable of analyzing large datasets to extract meaningful relationships, demonstrates remarkable correlations between groups of microbes and people’s health. Predictive models on how microbes interact are yet another aspect where AI is innovating [ 21 40 41 42 43 Machine learning, or ML, is a field of artificial intelligence that enables systems to learn and improve autonomously from data inputs. ML algorithms are mainly classified into unsupervised learning and supervised learning, which have been widely applied for analysis of gut microbiome [ 44 45 46 47 48 Figure 2 The process begins with the collection of stool samples from patients, which are then subjected to NGS sequencing and bioinformatic analysis to identify microbial compositions [ 49 Investigating AI-Powered Techniques and Machine Learning Resources to Analyze the Intricate Microbiota Table 2 For a clear comprehension of the linkages between the human diseases and the gut microbiota, characterization of the microbial communities and their features was done through next generation sequencing approaches such as amplicon sequencing and shotgun sequencing [ 57 58 59 60 61 62 63 64 65 Recent advances have also introduced autoencoder-based dimensionality reduction techniques for microbiome analysis. Methods such as variational autoencoders (VAEs) and denoising autoencoders enable the compression of high-dimensional microbiome profiles into dense latent feature spaces while retaining biologically meaningful information [ 66 4. Machine Learning Machine learning plays a crucial role in modern healthcare, offering diverse approaches to data-driven decision-making [ 67 Recent applications of machine learning in microbiome research illustrate how specific algorithms have been tailored to different study designs and data modalities. For instance, Random Forest classifiers have been widely employed to predict host phenotypes such as obesity, inflammatory bowel disease, and colorectal cancer using 16S rRNA sequencing data, achieving robust performance in distinguishing case–control cohorts [ 68 69 70 Table 3 In order to better illustrate their applicability, each machine-learning category can be contextualized with examples from microbiome research. In supervised learning, Random Forest classifiers have been widely used to distinguish colorectal cancer patients from healthy controls based on metagenomic profiles, demonstrating strong predictive performance in disease classification tasks [ 81 82 On the other hand, unsupervised learning detects hidden patterns within data, making it valuable for clustering similar disease profiles and identifying new biomarkers [ 83 84 85 Figure 3 It can be seen that supervised learning relies on labeled datasets to train algorithms, while unsupervised learning identifies patterns in unlabeled data. Also, different machine-learning models include decision trees, deep-learning neural networks, and autoencoders. Decision trees illustrate hierarchical decision-making based on input features, whereas deep-learning neural networks involve multiple interconnected layers that process complex patterns [ 86 87 To address the translational value of machine learning in microbiome studies, we expanded our discussion beyond theoretical descriptions. In Table 4 Random Forest algorithms have been successfully used for colorectal cancer classification [ 88 91 89 90 92 94 93 95 To move beyond general statements, in Table 5 In colorectal cancer, Zeller et al. [ 88 91 89 96 92 Complementing these results on 16S rRNA data, Topçuoğlu et al. [ 93 Beyond disease labels, unsupervised structure has also been quantified. Arumugam et al. [ 90 To illustrate model performance with concrete metrics, we also summarize two other representative, large-scale T2D microbiome prediction studies. First, Reitmeier et al. [ 97 98 An important aspect of applying machine learning to microbiome datasets is the use of appropriate preprocessing strategies, as recommended by initiatives such as ML4Microbiome [ 99 100 99 Another important challenge in microbiome-based machine learning is the presence of systematic biases in compositional data. For example, reference genome incompleteness can limit accurate taxonomic assignment, leaving many microbial reads unclassified or misclassified [ 101 102 103 104 5. Ethical, Legal, and Social Implications The integration of AI into microbiome research also raises important ethical, legal, and social considerations that must be addressed to ensure responsible translation into clinical practice. One key concern is algorithmic bias, which can arise when models are trained on datasets that underrepresent certain populations, leading to reduced accuracy and inequitable outcomes in minority groups [ 105 106 6. Existing Challenges and Future Directions for AI in Microbiome-Based Healthcare Although artificial intelligence is gaining attention in microbiome-related disease research, few models have made it to clinical practice, which can be assumed to stem from the lack of robustness and generalizability [ 107 108 Another significant challenge for the translational scientific investigations is the AI model’s typical opacity. In situations wherein an AI model meets business requirements, determining the logic behind its action is exceedingly complex. While random forests and similar techniques can analyze the relevance of a feature for the model’s decision, other forms of machine learning have to be evaluated with regard to the significance of features separately [ 109 Another common problem is data leakage, which occurs if data are not sufficiently divided into training and test subsets, resulting in method-learning shortcuts, which culminates in over reporting and poor performance in practice [ 60 An essential component in training sophisticated AI models is the availability of thorough, substantial, and high-quality microbiome data. There have been several failed international attempts in the past for microbiome data collection, such as the Human Microbiome Project and the MetaHIT project (as previously mentioned), which have now opened new endeavors like the Million Microbiomes from Humans Project [ 58 7. Conclusions The massive volumes of gut metagenomic data available now allow ML technologies to be applied for the identification of many uncharacterized microbial genomes and proteins, something which was previously impossible. This represents a first step towards a deeper mechanistic understanding of the gut microbiome. Moreover, these unexplogenic protein sequences can be further analyzed through ML to predict protein structure and aid in enzyme or drug design. Additionally, ML can aid in the development of probiotics, as well as in the creation of synthetic consortia of multiple species of microbes. Hence, these ML approaches will eventually facilitate achieving personalized nutrition and targeted medicine at the microbiome level. However, alongside these opportunities, several challenges and limitations must be recognized. A major concern remains data standardization, as microbiome studies often employ heterogeneous sequencing platforms, pipelines, and reference databases that complicate reproducibility and cross-study comparisons. Another critical issue is clinical applicability: while many AI-driven models demonstrate high performance in research settings, their translation into clinical practice requires robust validation in large, diverse cohorts, and the establishment of regulatory pathways. A critical concern is the risk of data leakage when training and test sets are not strictly separated, which can artificially inflate model performance; to avoid this, nested cross-validation, validation on independent external cohorts, and multi-population benchmarking are recommended as best practices. Furthermore, ethical considerations, including data privacy, patient consent, and algorithmic bias, must be carefully addressed to ensure responsible and equitable implementation of AI in healthcare. There are countless challenges, but the arrival of AI and big data analytics has opened doors to many applications of the gut microbiota, creating immense opportunities for developing novel strategies aimed at disease treatment and prevention through modification of the gut microbiota. Acknowledgments We would like to thank the reviewers for their valuable feedback which helped improve the manuscript. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, L.A., A.D., I.T.T., E.D., D.M.A., L.S., E.R., A.N.T., A.D.N., D.E.T., L.F.H., E.D., A.M.S., L.M.C. and C.T.; methodology, A.D., E.D., D.M.A., C.T. and software L.F.H., L.S., E.R., I.T.T., A.N.T., E.D. and L.M.C.; validation, D.E.T., L.M.C., A.M.S., A.D.N. and E.D.; formal analysis, L.A., A.D., E.D., D.M.A., A.N.T., I.T.T., D.E.T., L.F.H. and E.D.; investigation L.A., A.D., E.D., D.M.A., L.S., E.R., C.T., D.E.T., A.M.S., L.S., E.R., L.M.C., A.N.T. and E.D.; resources, L.A., A.D., E.D., D.M.A., I.T.T., A.D.N. and C.T.; data curation C.T., D.E.T. Writing—original draft preparation, D.E.T., A.M.S., L.M.C., A.D.N., A.N.T. and E.D.; writing—review and editing, L.A., A.D., E.D., D.M.A., C.T. and visualization L.A., A.D., E.D., D.M.A., C.T., D.E.T., A.D.N., L.M.C., L.S., E.R., A.M.S., A.N.T. and E.D.; supervision, L.A. and D.M.A.; project administration L.A., L.S., I.T.T., E.R. and D.M.A. All authors have read and agreed to the published version of the manuscript. Data Availability Statement No new data were created. Conflicts of Interest The authors declare no conflicts of interest. References 1. Thursby E. Juge N. Introduction to the human gut microbiota Biochem. J. 2017 474 1823 1836 10.1042/BCJ20160510 28512250 PMC5433529 2. Madhogaria B. Bhowmik P. Kundu A. Correlation between human gut microbiome and diseases Infect. Med. 2022 1 180 191 10.1016/j.imj.2022.08.004 38077626 PMC10699709 3. DeGruttola A.K. Low D. Mizoguchi A. Mizoguchi E. Current Understanding of Dysbiosis in Disease in Human and Animal Models Inflamm. Bowel Dis. 2016 22 1137 1150 10.1097/MIB.0000000000000750 27070911 PMC4838534 4. Gebrayel P. Nicco C. Al Khodor S. Bilinski J. Caselli E. Comelli E.M. Egert M. Giaroni C. Karpinski T.M. Loniewski I. Microbiota medicine: Towards clinical revolution J. Transl. Med. 2022 20 111 10.1186/s12967-022-03296-9 35255932 PMC8900094 5. Ullah H. Arbab S. Tian Y. Liu C.Q. Chen Y. Qijie L. Khan M.I.U. Hassan I.U. Li K. The gut microbiota-brain axis in neurological disorder Front. Neurosci. 2023 17 1225875 10.3389/fnins.2023.1225875 37600019 PMC10436500 6. Pahwa R. Goyal A. Jialal I. Chronic Inflammation StatPearls StatPearls Publishing Treasure Island, FL, USA 2025 Available online: https://www.ncbi.nlm.nih.gov/books/NBK493173/ (accessed on 12 June 2025) 29630225 7. Shan Y. Lee M. Chang E.B. The Gut Microbiome and Inflammatory Bowel Diseases Annu. Rev. Med. 2022 73 455 468 10.1146/annurev-med-042320-021020 34555295 PMC10012812 8. Probul N. Huang Z. Saak C.C. Baumbach J. List M. AI in microbiome-related healthcare Microb. Biotechnol. 2024 17 e70027 10.1111/1751-7915.70027 39487766 PMC11530995 9. Chechkin A. Pleshakova E. Gataullin S. A Hybrid KAN-BiLSTM Transformer with Multi-Domain Dynamic Attention Model for Cybersecurity Technologies 2025 13 223 10.3390/technologies13060223 10. Baranwal M. Clark R.L. Thompson J. Sun Z. Hero A.O. Venturelli O.S. Recurrent neural networks enable design of multifunctional synthetic human gut microbiome dynamics Elife 2022 11 e73870 10.7554/eLife.73870 35736613 PMC9225007 11. Hermosilla P. Berríos S. Allende-Cid H. Explainable AI for Forensic Analysis: A Comparative Study of SHAP and LIME in Intrusion Detection Models Appl. Sci. 2025 15 7329 10.3390/app15137329 12. Cristofori F. Dargenio V.N. Dargenio C. Miniello V.L. Barone M. Francavilla R. Anti-Inflammatory and Immunomodulatory Effects of Probiotics in Gut Inflammation: A Door to the Body Front. Immunol. 2021 12 578386 10.3389/fimmu.2021.578386 33717063 PMC7953067 13. Kumar B. Lorusso E. Fosso B. Pesole G. A comprehensive overview of microbiome data in the light of machine learning applications: Categorization, accessibility, and future directions Front. Microbiol. 2024 15 1343572 10.3389/fmicb.2024.1343572 38419630 PMC10900530 14. Gilbert J.A. Blaser M.J. Caporaso J.G. Jansson J.K. Lynch S.V. Knight R. Current understanding of the human microbiome Nat. Med. 2018 24 392 400 10.1038/nm.4517 29634682 PMC7043356 15. Pinart M. Dötsch A. Schlicht K. Laudes M. Bouwman J. Forslund S.K. Pischon T. Nimptsch K. Gut Microbiome Composition in Obese and Non-Obese Persons: A Systematic Review and Meta-Analysis Nutrients 2021 14 12 10.3390/nu14010012 35010887 PMC8746372 16. Deli C.K. Fatouros I.G. Poulios A. Liakou C.A. Draganidis D. Papanikolaou K. Rosvoglou A. Gatsas A. Georgakouli K. Tsimeas P. Gut Microbiota in the Progression of Type 2 Diabetes and the Potential Role of Exercise: A Critical Review Life 2024 14 1016 10.3390/life14081016 39202758 PMC11355287 17. El-Sayed A. Kapila D. Taha R.S.I. El-Sayed S. Mahen M.R.A. Taha R. Alrubaiy L. The Role of the Gut Microbiome in Inflammatory Bowel Disease: The Middle East Perspective J. Pers. Med. 2024 14 652 10.3390/jpm14060652 38929872 PMC11204866 18. Avuthu N. Guda C. Meta-Analysis of Altered Gut Microbiota Reveals Microbial and Metabolic Biomarkers for Colorectal Cancer Microbiol. Spectr. 2022 10 e0001322 10.1128/spectrum.00013-22 35766483 PMC9431300 19. Hou K. Wu Z.-X. Chen X.-Y. Wang J.-Q. Zhang D. Xiao C. Zhu D. Koya J.B. Wei L. Li J. Microbiota in health and diseases Sig. Transduct. Target. Ther. 2022 7 135 10.1038/s41392-022-00974-4 PMC9034083 35461318 20. Jabeen Z. Bukhari S.A. Malik S.A. Hussain G. Kamal S. Improved gut microbiota escalates muscle function rehabilitation and ameliorates oxidative stress following mechanically induced peripheral nerve injury in mice Pak. Vet. J. 2023 43 707 713 10.29261/pakvetj/2023.098 21. Ghosh T.S. Rampelli S. Jeffery I.B. Santoro A. Neto M. Capri M. Giampieri E. Jennings A. Candela M. Turroni S. Mediterranean diet intervention alters the gut microbiome in older people reducing frailty and improving health status: The NU-AGE 1-year dietary intervention across five European countries Gut 2020 69 1218 1228 10.1136/gutjnl-2019-319654 32066625 PMC7306987 22. Xie Q. Zhang Y. Zhang Z. Gong S. Mo Q. Li J. Characteristics and dynamic changes of gut microbiota in cats with colitis Pak. Vet. J. 2024 44 414 422 10.29261/pakvetj/2024.175 23. de Groot P. Scheithauer T. Bakker G.J. Prodan A. Levin E. Khan M.T. Herrema H. Ackermans M. Serlie M.J.M. de Brauw M. Donor metabolic characteristics drive effects of faecal microbiota transplantation on recipient insulin sensitivity, energy expenditure and intestinal transit time Gut 2020 69 502 512 10.1136/gutjnl-2019-318320 31147381 PMC7034343 24. Ayesha I.E. Monson N.R. Klair N. Patel U. Saxena A. Patel D. Venugopal S. Probiotics and Their Role in the Management of Type 2 Diabetes Mellitus (Short-Term Versus Long-Term Effect): A Systematic Review and Meta-Analysis Cureus 2023 15 e46741 10.7759/cureus.46741 38022046 PMC10631563 25. Nachum Z. Perlitz Y. Shavit L.Y. Magril G. Vitner D. Zipori Y. Weiner E. Alon A.S. Ganor-Paz Y. Nezer M. The effect of oral probiotics on glycemic control of women with gestational diabetes mellitus-a multicenter, randomized, double-blind, placebo-controlled trial Am. J. Obs. Gynecol. MFM 2024 6 101224 10.1016/j.ajogmf.2023.101224 37956906 26. Zhen J. Zhou Z. He M. Han H.X. Lv E.H. Wen P.B. Liu X. Wang Y.T. Cai X.C. Tian J.Q. The gut microbial metabolite trimethylamine N-oxide and cardiovascular diseases Front. Endocrinol. 2023 14 1085041 10.3389/fendo.2023.1085041 36824355 PMC9941174 27. Majumder S. Sen K. Karanjai R. Artificial Intelligence-Based Target for Personalized Interventions of Atherosclerosis from Gut Microbiota Signature SynBio 2025 3 2 10.3390/synbio3010002 28. Alsayed A.R. Abed A. Khader H.A. Al-Shdifat L.M.H. Hasoun L. Al-Rshaidat M.M.D. Alkhatib M. Zihlif M. Molecular Accounting and Profiling of Human Respiratory Microbial Communities: Toward Precision Medicine by Targeting the Respiratory Microbiome for Disease Diagnosis and Treatment Int. J. Mol. Sci. 2023 24 4086 10.3390/ijms24044086 36835503 PMC9966333 29. Pérez-Cobas A.E. Gomez-Valero L. Buchrieser C. Metagenomic approaches in microbial ecology: An update on whole-genome and marker gene sequencing analyses Microb Genom. 2020 6 mgen000409 10.1099/mgen.0.000409 32706331 PMC7641418 30. Aplakidou E. Vergoulidis N. Chasapi M. Venetsianou N.K. Kokoli M. Panagiotopoulou E. Iliopoulos I. Karatzas E. Pafilis E. Georgakopoulos-Soares I. Visualizing metagenomic and metatranscriptomic data: A comprehensive review Comput. Struct. Biotechnol. J. 2024 23 2011 2033 10.1016/j.csbj.2024.04.060 38765606 PMC11101950 31. Liu X. Peng T. Xu M. Lin S. Hu B. Chu T. Liu B. Xu Y. Ding W. Li L. Spatial multi-omics: Deciphering technological landscape of integration of multi-omics and its applications J. Hematol. Oncol. 2024 17 72 10.1186/s13045-024-01596-9 39182134 PMC11344930 32. Winand R. D’hooge E. Van Uffelen A. Bogaerts B. Van Braekel J. Hoffman S. Roosens N.H.C.J. Becker P. De Keersmaecker S.C.J. Vanneste K. Investigating fungal diversity through metabarcoding for environmental samples: Assessment of ITS1 and ITS2 Illumina sequencing using multiple defined mock communities with different classification methods and reference databases BMC Genom. 2025 26 729 10.1186/s12864-025-11917-y 40770684 PMC12329927 33. Shi Z. Yin H. Van Nostrand J.D. Voordeckers J.W. Tu Q. Deng Y. Yuan M. Zhou A. Zhang P. Xiao N. Functional Gene Array-Based Ultrasensitive and Quantitative Detection of Microbial Populations in Complex Communities mSystems 2019 4 e00296-e19 10.1128/mSystems.00296-19 31213523 PMC6581690 34. Cao Z. Zuo W. Wang L. Chen J. Qu Z. Jin F. Dai L. Spatial profiling of microbial communities by sequential FISH with error-robust encoding Nat. Commun. 2023 14 1477 10.1038/s41467-023-37188-3 36932092 PMC10023729 35. Almeida A. Nayfach S. Boland M. Strozzi F. Beracochea M. Shi Z.J. Pollard K.S. Sakharova E. Parks D.H. Hugenholtz P. A unified catalog of 204,938 reference genomes from the human gut microbiome Nat. Biotechnol. 2021 39 105 114 10.1038/s41587-020-0603-3 32690973 PMC7801254 36. Kashaf S.S. Proctor D.M. Deming C. Saary P. Hölzer M. Program N.C.S. Mullikin J. Thomas J. Young A. Bouffard G. Integrating cultivation and metagenomics for a multi-kingdom view of skin microbiome diversity and functions Nat. Microbiol. 2022 7 169 179 10.1038/s41564-021-01011-w 34952941 PMC8732310 37. Cuber P. Chooneea D. Geeves C. Salatino S. Creedy T.J. Griffin C. Sivess L. Barnes I. Price B. Misra R. Comparing the accuracy and efficiency of third generation sequencing technologies, Oxford Nanopore Technologies, and Pacific Biosciences, for DNA barcode sequencing applications Ecol. Genet. Genom. 2023 28 100181 10.1016/j.egg.2023.100181 38. Fadiji A.E. Babalola O.O. Metagenomics methods for the study of plant-associated microbial communities: A review J. Microbiol. Methods 2020 170 105860 10.1016/j.mimet.2020.105860 32027927 39. Scientific image and illustration software|BioRender Available online: https://www.biorender.com/ (accessed on 12 June 2025) 40. Rooks M.G. Garrett W.S. Gut microbiota, metabolites and host immunity Nat. Rev. Immunol. 2016 16 341 352 10.1038/nri.2016.42 27231050 PMC5541232 41. Hajjo R. Sabbah D.A. Al Bawab A.Q. Unlocking the Potential of the Human Microbiome for Identifying Disease Diagnostic Biomarkers Diagnostics 2022 12 1742 10.3390/diagnostics12071742 35885645 PMC9315466 42. Marcos-Zambrano L.J. Karaduzovic-Hadziabdic K. Loncar Turukalo T. Przymus P. Trajkovik V. Aasmets O. Berland M. Gruca A. Hasic J. Hron K. Applications of Machine Learning in Human Microbiome Studies: A Review on Feature Selection, Biomarker Identification, Disease Prediction and Treatment Front. Microbiol. 2021 12 634511 10.3389/fmicb.2021.634511 33737920 PMC7962872 43. Mazumder M.H.H. Hussain S. Air-Pollution-Mediated Microbial Dysbiosis in Health and Disease: Lung–Gut Axis and Beyond J. Xenobiotics 2024 14 1595 1612 10.3390/jox14040086 PMC11503347 39449427 44. Koteluk O. Wartecki A. Mazurek S. Kołodziejczak I. Mackiewicz A. How Do Machines Learn? Artificial Intelligence as a New Era in Medicine J. Pers. Med. 2021 11 32 10.3390/jpm11010032 33430240 PMC7825660 45. Badrulhisham F. Pogatzki-Zahn E. Segelcke D. Spisak T. Vollert J. Machine learning and artificial intelligence in neuroscience: A primer for researchers Brain Behav. Immun. 2024 115 470 479 10.1016/j.bbi.2023.11.005 37972877 46. Sarmina B.G. Sun G.-H. Dong S.-H. Principal Component Analysis and t-Distributed Stochastic Neighbor Embedding Analysis in the Study of Quantum Approximate Optimization Algorithm Entangled and Non-Entangled Mixing Operators Entropy 2023 25 1499 10.3390/e25111499 37998191 PMC10670472 47. Rahnenführer J. De Bin R. Benner A. Ambrogi F. Lusa L. Boulesteix A.L. Migliavacca E. Binder H. Michiels S. Sauerbrei W. Statistical analysis of high-dimensional biomedical data: A gentle introduction to analytical goals, common approaches and challenges BMC Med. 2023 21 182 10.1186/s12916-023-02858-y 37189125 PMC10186672 48. Ng S. Masarone S. Watson D. Barnes M.R. The benefits and pitfalls of machine learning for biomarker discovery Cell Tissue Res. 2023 394 17 31 10.1007/s00441-023-03816-z 37498390 PMC10558383 49. Alowais S.A. Alghamdi S.S. Alsuhebany N. Alqahtani T. Alshaya A.I. Almohareb S.N. Aldairem A. Alrashed M. Bin Saleh K. Badreldin H.A. Revolutionizing healthcare: The role of artificial intelligence in clinical practice BMC Med. Educ. 2023 23 689 10.1186/s12909-023-04698-z 37740191 PMC10517477 50. Patil A. Singh N. Patwekar M. Patwekar F. Patil A. Gupta J.K. Elumalai S. Priya N.S. Sahithi A. AI-driven insights into the microbiota: Figuring out the mysterious world of the gut Intell. Pharm. 2025 3 46 52 10.1016/j.ipha.2024.08.003 51. Tunali V. Arslan N.Ç. Ermiş B.H. Derviş Hakim G. Gündoğdu A. Hora M. Nalbantoğlu Ö.U. A Multicenter Randomized Controlled Trial of Microbiome-Based Artificial Intelligence-Assisted Personalized Diet vs Low-Fermentable Oligosaccharides, Disaccharides, Monosaccharides, and Polyols Diet: A Novel Approach for the Management of Irritable Bowel Syndrome Am. J. Gastroenterol. 2024 119 1901 1912 10.14309/ajg.0000000000002862 38717025 PMC11365594 52. Lopes C.M. de Jesus Monteiro C.S. Duarte A.P. dos Santos J.L. Probiotics and Prebiotics for the Treatment of Irritable Bowel Syndrome—A Narrative Review J. Clin. Med. 2024 13 6337 10.3390/jcm13216337 39518476 PMC11546470 53. Han X. Liu Q. Li Y. Zhang M. Liu K. Kwok L. Zhang H. Zhang W. Synergizing Artificial Intelligence and Probiotics: A Comprehensive review of emerging applications in health promotion and industrial innovation Trends Food Sci. Technol. 2025 159 104938 10.1016/j.tifs.2025.104938 54. Dixon D. Sattar H. Moros N. Kesireddy S.R. Ahsan H. Lakkimsetti M. Fatima M. Doshi D. Sadhu K. Junaid Hassan M. Unveiling the Influence of AI Predictive Analytics on Patient Outcomes: A Comprehensive Narrative Review Cureus 2024 16 e59954 10.7759/cureus.59954 38854327 PMC11161909 55. Asar R. Erenler S. Devecioglu D. Ispirli H. Karbancioglu-Guler F. Ozturk H.I. Dertli E. Understanding the Functionality of Probiotics on the Edge of Artificial Intelligence (AI) Era Fermentation 2025 11 259 10.3390/fermentation11050259 56. Anuyah N.S. Singh N.M.K. Nyavor N.H. Advancing clinical trial outcomes using deep learning and predictive modelling: Bridging precision medicine and patient-centered care World J. Adv. Res. Rev. 2024 24 001 025 10.30574/wjarr.2024.24.3.3671 57. Maheshwari K. Musyuni P. Moulick A. Mishra H. Ekielski A. Mishra P.K. Aggarwal G. Unveiling the microbial symphony: Next-Gen sequencing and bioinformatics insights into the human gut microbiome Health Sci. Rev. 2024 11 100173 10.1016/j.hsr.2024.100173 58. Cordis C. Metagenomics of the Human Intestinal Tract. CORDIS|European Commission 11 July 2011 Available online: https://cordis.europa.eu/project/id/201052/reporting (accessed on 12 June 2025) 59. Li J. Jia H. Cai X. Zhong H. Feng Q. Sunagawa S. Arumugam M. Kultima J.R. Prifti E. Nielsen T. An integrated catalog of reference genes in the human gut microbiome Nat. Biotechnol. 2014 32 834 841 10.1038/nbt.2942 24997786 60. Hiseni P. Rudi K. Wilson R.C. Hegge F.T. Snipen L. HumGut: A comprehensive human gut prokaryotic genomes collection filtered by metagenome data Microbiome 2021 9 165 10.1186/s40168-021-01114-w 34330336 PMC8325300 61. Chen C. Wang J. Pan D. Wang X. Xu Y. Yan J. Wang L. Yang X. Yang M. Liu G.P. Applications of multi-omics analysis in human diseases MedComm 2023 4 e315 10.1002/mco2.315 37533767 PMC10390758 62. Matthewman C. Narin A. Huston H. Hopkins C.E. Systems to model the personalized aspects of microbiome health and gut dysbiosis Mol. Asp. Med. 2022 91 101115 10.1016/j.mam.2022.101115 36104261 63. Venkatesh G.P. Kuruvalli G. Syed K. Reddy V.D. An Updated Review on Probiotic Production and Applications Gastroenterol. Insights 2024 15 221 236 10.3390/gastroent15010016 64. Saxena R. Sharma V. Saxena A.R. Patel A. Harnessing AI and gut microbiome research for precision health J. Artif. Intell. Gen. Sci. 2024 3 74 88 10.60087/jaigs.v3i1.68 65. Hughes R.L. Marco M.L. Hughes J.P. Keim N.L. Kable M.E. The role of the gut microbiome in predicting response to diet and the Development of Precision Nutrition Models—Part I: Overview of Current Methods Adv. Nutr. 2019 10 953 978 10.1093/advances/nmz022 31225589 PMC6855943 66. Baig Y. Ma H.R. Xu H. You L. Autoencoder neural networks enable low dimensional structure analyses of microbial growth dynamics Nat. Commun. 2023 14 7937 10.1038/s41467-023-43455-0 38049401 PMC10696002 67. Khosravi M. Zare Z. Mojtabaeian S.M. Izadi R. Artificial Intelligence and Decision-Making in Healthcare: A Thematic Analysis of a Systematic Review of Reviews Health Serv. Res. Manag. Epidemiol. 2024 11 23333928241234863 10.1177/23333928241234863 38449840 PMC10916499 68. Teixeira M. Silva F. Ferreira R.M. Pereira T. Figueiredo C. Oliveira H.P. A review of machine learning methods for cancer characterization from microbiome data NPJ Precis. Oncol. 2024 8 123 10.1038/s41698-024-00617-7 38816569 PMC11139966 69. Ghannam R.B. Techtmann S.M. Machine learning applications in microbial ecology, human microbiome studies, and environmental monitoring Comput. Struct. Biotechnol. J. 2021 19 1092 1107 10.1016/j.csbj.2021.01.028 33680353 PMC7892807 70. Little L. A Guide to Multi-Omics—Front Line Genomics 6 February 2024 Available online: https://frontlinegenomics.com/a-guide-to-multi-omics/#:~:text=A%20multi%2Domics%20approach%20involves,molecular%20mechanisms%20that%20underpin%20biology (accessed on 12 June 2025) 71. Nasteski V. An overview of the supervised machine learning methods Horiz. B 2017 4 51 62 10.20544/HORIZONS.B.04.1.17.P05 72. Ono S. Goto T. Introduction to supervised machine learning in clinical epidemiology Ann. Clin. Epidemiol. 2022 4 63 71 10.37737/ace.22009 38504945 PMC10760492 73. Mohalder R.N. Hossain M.A. Hossain N. CLASSIFYING THE SUPERVISED MACHINE LEARNING AND COMPARING THE PERFORMANCES OF THE ALGORITHMS Int. J. Adv. Res. 2024 12 422 438 10.21474/IJAR01/18138 74. Eckhardt C.M. Madjarova S.J. Williams R.J. Ollivier M. Karlsson J. Pareek A. Nwachukwu B.U. Unsupervised machine learning methods and emerging applications in healthcare Knee Surg. Sports Traumatol. Arthrosc. 2023 31 376 381 10.1007/s00167-022-07233-7 36378293 75. Iqbal T. Elahi A. Wijns W. Shahzad A. Exploring Unsupervised Machine Learning Classification Methods for Physiological Stress Detection Front. Med. Technol. 2022 4 782756 10.3389/fmedt.2022.782756 35359827 PMC8962952 76. Ahmed F. Shamsuddin M. Sultana T. Shamsuddin R. Semi-Supervised Machine Learning Method for Predicting Observed Individual Risk Preference Using Gallup Data Math. Comput. Appl. 2024 29 21 10.3390/mca29020021 77. Reddy Y.C.a.P. Viswanath P. Reddy B.E. Semi-supervised learning: A brief review Int. J. Eng. Technol. 2018 7 81 10.14419/ijet.v7i1.8.9977 78. van Engelen J.E. Hoos H.H. A survey on semi-supervised learning Mach. Learn. 2020 109 373 440 10.1007/s10994-019-05855-6 79. Sivamayil K. Rajasekar E. Aljafari B. Nikolovski S. Vairavasundaram S. Vairavasundaram I. A Systematic Study on Reinforcement Learning Based Applications Energies 2023 16 1512 10.3390/en16031512 80. Sarker I.H. Machine Learning: Algorithms, Real-World Applications and Research Directions SN Comput. Sci. 2021 2 160 10.1007/s42979-021-00592-x 33778771 PMC7983091 81. Gao Y. Zhu Z. Sun F. Increasing prediction performance of colorectal cancer disease status using random forests classification based on metagenomic shotgun sequencing data Synth. Syst. Biotechnol. 2022 7 574 585 10.1016/j.synbio.2022.01.005 35155839 PMC8801753 82. Asnicar F. Berry S.E. Valdes A.M. Nguyen L.H. Piccinno G. Drew D.A. Leeming E. Gibson R. Le Roy C. Khatib H.A. Microbiome connections with host metabolism and habitual diet from 1,098 deeply phenotyped individuals Nat. Med. 2021 27 321 332 10.1038/s41591-020-01183-8 33432175 PMC8353542 83. McLeish E. Slater N. Mastaglia F.L. Needham M. Coudert J.D. From data to diagnosis: How machine learning is revolutionizing biomarker discovery in idiopathic inflammatory myopathies Brief Bioinform. 2023 25 bbad514 10.1093/bib/bbad514 38243695 PMC10796252 84. Al-Azzam N. Shatnawi I. Comparing supervised and semi-supervised Machine Learning Models on Diagnosing Breast Cancer Ann. Med. Surg. 2021 62 53 64 10.1016/j.amsu.2020.12.043 PMC7806524 33489117 85. Gentleman R. Carey V.J. Unsupervised Machine Learning Bioconductor Case Studies Springer New York, NY, USA 2008 137 157 10.1007/978-0-387-77240-0_10 86. Lepakshi V.A. Machine Learning and Deep Learning based AI Tools for Development of Diagnostic Tools Computational Approaches for Novel Therapeutic and Diagnostic Designing to Mitigate SARS-CoV-2 Infection Academic Press Cambridge, MA, USA 2022 399 420 10.1016/B978-0-323-91172-6.00011-X 87. Walczyna T. Jankowski D. Piotrowski Z. Enhancing Anomaly Detection Through Latent Space Manipulation in Autoencoders: A Comparative Analysis Appl. Sci. 2025 15 286 10.3390/app15010286 88. Zeller G. Tap J. Voigt A.Y. Sunagawa S. Kultima J.R. Costea P. Bork P. Potential of fecal microbiota for early-stage detection of colorectal cancer Mol. Syst. Biol. 2014 10 766 10.15252/msb.20145645 25432777 PMC4299606 89. Qin J. Li Y. Cai Z. Li S. Zhu J. Zhang F. Liang S. Zhang W. Guan Y. Shen D. A metagenome-wide association study of gut microbiota in type 2 diabetes Nature 2012 490 55 60 10.1038/nature11450 23023125 90. Arumugam M. Raes J. Pelletier E. Le Paslier D. Yamada T. Mende D.R. Fernandes G.R. Tap J. Bruls T. Batto J.M. Enterotypes of the human gut microbiome Nature 2011 473 174 180 10.1038/nature09944 21508958 PMC3728647 91. Wirbel J. Pyl P.T. Kartal E. Zych K. Kashani A. Milanese A. Fleck J.S. Voigt A.Y. Palleja A. Ponnudurai R. Meta-analysis of fecal metagenomes reveals global microbial signatures that are specific for colorectal cancer Nat. Med. 2019 25 679 689 10.1038/s41591-019-0406-6 30936547 PMC7984229 92. Pasolli E. Truong D.T. Malik F. Waldron L. Segata N. Machine Learning Meta-analysis of Large Metagenomic Datasets: Tools and Biological Insights PLoS Comput. Biol. 2016 12 e1004977 10.1371/journal.pcbi.1004977 27400279 PMC4939962 93. Topçuoğlu B.D. Lesniak N.A. Ruffin M.T. Wiens J. Schloss P.D. A framework for Effective Application of Machine Learning to Microbiome-Based Classification Problems mBio 2020 11 10 1128 10.1128/mBio.00434-20 32518182 PMC7373189 94. Asgari E. Garakani K. McHardy A.C. Mofrad M.R.K. MicroPheno: Predicting environments and host phenotypes from 16S rRNA gene sequencing using a k-mer based representation of shallow sub-samples Bioinformatics 2018 34 i32 i42 Erratum in Bioinformatics 2019 35 https://doi.org/10.1093/bioinformatics/bty652 10.1093/bioinformatics/bty296 29950008 PMC6022683 95. Vilne B. Ķibilds J. Siksna I. Lazda I. Valciņa O. Krūmiņa A. Could Artificial Intelligence/Machine Learning and inclusion of Diet-Gut microbiome interactions improve disease risk prediction? Case study: Coronary artery disease Front. Microbiol. 2022 13 627892 10.3389/fmicb.2022.627892 35479632 PMC9036178 96. Karlsson F.H. Tremaroli V. Nookaew I. Bergström G. Behre C.J. Fagerberg B. Nielsen J. Bäckhed F. Gut metagenome in European women with normal, impaired and diabetic glucose control Nature 2013 498 99 103 10.1038/nature12198 23719380 97. Reitmeier S. Kiessling S. Clavel T. List M. Almeida E.L. Ghosh T.S. Neuhaus K. Grallert H. Linseisen J. Skurk T. Arrhythmic Gut Microbiome Signatures Predict Risk of Type 2 Diabetes Cell Host Microbe 2020 28 258 272.e6 10.1016/j.chom.2020.06.004 32619440 98. Zeng Q. Zhao M. Wang F. Li Y. Li H. Zheng J. Chen X. Zhao X. Ji L. Gao X. Integrating Choline and Specific Intestinal Microbiota to Classify Type 2 Diabetes in Adults: A Machine Learning Based Metagenomics Study Front. Endocrinol. 2022 13 906310 10.3389/fendo.2022.906310 35832425 PMC9271784 99. Papoutsoglou G. Tarazona S. Lopes M.B. Klammsteiner T. Ibrahimi E. Eckenberger J. Novielli P. Tonda A. Simeon A. Shigdel R. Machine learning approaches in microbiome research: Challenges and best practices Front. Microbiol. 2023 14 1261889 10.3389/fmicb.2023.1261889 37808286 PMC10556866 100. Zhang Y. Schluter J. Zhang L. Cao X. Jenq R.R. Feng H. Haines J. Zhang L. Review and revamp of compositional data transformation: A new framework combining proportion conversion and contrast transformation Comput. Struct. Biotechnol. J. 2024 23 4088 4107 10.1016/j.csbj.2024.11.003 39624165 PMC11609487 101. Guccione C. Patel L. Tomofuji Y. McDonald D. Gonzalez A. Sepich-Poore G.D. Sonehara K. Zakeri M. Chen Y. Dilmore A.H. Incomplete human reference genomes can drive false sex biases and expose patient-identifying information in metagenomic data Nat. Commun. 2025 16 825 10.1038/s41467-025-56077-5 39827261 PMC11742726 102. Yang J.X. Peng Y. Yu Q.Y. Yang J.J. Zhang Y.H. Zhang H.Y. Adams C.A. Willing C.E. Wang C. Li Q.S. Gene horizontal transfers and functional diversity negatively correlated with bacterial taxonomic diversity along a nitrogen gradient NPJ Biofilms Microbiomes 2024 10 128 10.1038/s41522-024-00588-4 39550371 PMC11569254 103. Lin X. Hu T. Chen J. Liang H. Zhou J. Wu Z. Ye C. Jin X. Xu X. Zhang W. The genomic landscape of reference genomes of cultivated human gut bacteria Nat. Commun. 2023 14 1663 10.1038/s41467-023-37396-x 36966151 PMC10039858 104. Shoer S. Reicher L. Zhao C. Pollard K.S. Pilpel Y. Segal E. Pangenomes of human gut microbiota uncover links between genetic diversity and stress response Cell Host Microbe 2024 32 1744 1757.e2 10.1016/j.chom.2024.08.017 39353429 PMC12060796 105. Cross J.L. Choma M.A. Onofrey J.A. Bias in medical AI: Implications for clinical decision-making PLOS Digit. Health 2024 3 e0000651 10.1371/journal.pdig.0000651 39509461 PMC11542778 106. Ghasemian M. Gerido L.H. Ayday E. Safeguarding Privacy in Genome Research: A Comprehensive Framework for Authors AMIA Jt. Summits Transl. Sci. Proc. 2025 2025 177 186 10.1101/2024.09.20.614092 40502226 PMC12150713 107. Bašić-Čičak D. Hasić Telalović J. Pašić L. Utilizing Artificial Intelligence for Microbiome Decision-Making: Autism Spectrum Disorder in Children from Bosnia and Herzegovina Diagnostics 2024 14 2536 10.3390/diagnostics14222536 39594202 PMC11592508 108. Romano S. Wirbel J. Ansorge R. Schudoma C. Ducarmon Q.R. Narbad A. Zeller G. Machine learning-based meta-analysis reveals gut microbiome alterations associated with Parkinson’s disease Nat. Commun. 2025 16 4227 10.1038/s41467-025-56829-3 40335465 PMC12059030 109. Mohseni P. Ghorbani A. Exploring the synergy of artificial intelligence in microbiology: Advancements, challenges, and future prospects Comput. Struct. Biotechnol. Rep. 2024 1 100005 10.1016/j.csbr.2024.100005 Figure 1 AI-Driven workflow for precision medicine in microbiome research. Created with Biorender [ 39 Figure 2 AI-driven microbiome analysis for precision medicine. Created with Biorender [ 30 Figure 3 Overview of Machine-Learning approaches in data classification and decision-making. ( A B C D E F 39 bioengineering-12-00944-t001_Table 1 Table 1 Comparative analysis of microbiome profiling technologies: Advantages and limitations. Technology Benefits Limitations 16S rRNA profiling [ 28 - Offers high sensitivity for microbial identification - Limited taxonomic resolution Reference-based metagenomics [ 29 - Enables species- and strain-level classification for certain taxa - Strongly influenced by the quality and diversity of reference databases Metagenome-assembled genomes (MAGs) [ 30 - No need for amplification - Challenges in handling complex datasets Multi-omic analysis [ 31 - Detects functional genes, RNA transcripts, proteins, and metabolites - Complex data integration ITS sequencing (Internal Transcribed Spacer) [ 32 High resolution for fungal community profiling; complementary to 16S rRNA for bacterial communities Limited to fungal identification; subject to PCR biases; less standardized databases Microarrays (PhyloChip, GeoChip) [ 33 High-throughput; detects thousands of taxa/functional genes simultaneously; reproducible results Limited to predefined probes; cannot detect novel organisms; requires robust probe design FISH (Fluorescence In Situ Hybridization) [ 34 Visualizes microbes in situ; provides spatial organization; no need for cultivation Lower sensitivity for rare taxa; requires specific probes; limited multiplexing bioengineering-12-00944-t002_Table 2 Table 2 Detailed overview of how AI is shaping probiotic applications in clinical settings. Category Description Function What it Can Be Used? Predictive analysis [ 50 AI forecasts how various probiotic strains interact with the gut microbiome and their potential effects on health, using past clinical trials and datasets [ 51 It can determine the most effective probiotic strains for specific health conditions or demographic groups. An AI model may predict that a specific combination of Lactobacillus Bifidobacterium 52 Customized probiotic suggestions [ 53 AI enables tailored probiotic recommendations based on an individual’s microbiome composition and overall health status. AI designs personalized probiotic formulations suited for each patient using genomic, metabolomic, and clinical information. AI proposes a specialized probiotic formula to restore microbial equilibrium for individuals with an imbalanced gut microbiome and metabolic issues. AI-assisted clinical guidance [ 54 AI helps healthcare providers choose appropriate probiotic therapies by analyzing patient records and predicting treatment outcomes. AI-driven systems offer data-supported recommendations for probiotic interventions, aiding in chronic disease management or post-antibiotic recovery. AI assesses patient data to recommend probiotics that reduce the risk of antibiotic-associated diarrhea and enhance gut health. AI-driven probiotic strain discovery [ 55 Machine-learning algorithms identify novel probiotic strains with desirable metabolic or immunomodulatory traits. Screens microbial genomes and predicts beneficial functionalities. AI discovers new probiotic candidates with anti-inflammatory or cholesterol-lowering properties for targeted therapies. Clinical trial simulation & validation [ 56 AI models simulate probiotic interventions and predict trial outcomes before or alongside human studies. Reduces trial costs and accelerates validation of probiotic efficacy. AI predicts probiotic success rates in T2D management or validates formulations in silico before moving to clinical phases. bioengineering-12-00944-t003_Table 3 Table 3 Types of Machine Learning and their applications in healthcare. ML Type Description Labeled Data? Output Type Common Algorithms Where it Can Be Used? Supervised learning [ 71 72 73 Models are trained on labeled datasets with known inputs and outputs to make predictions. Yes (fully labeled) Classification labels, regression values Linear/Logistic Regression, Decision Trees, Random Forests, Support Vector Machines (SVM), Gradient Boosting Disease diagnosis (e.g., cancer classification from microbiome), biomarker discovery, clinical outcome prediction, medical imaging analysis Unsupervised learning [ 74 75 Finds hidden structures or patterns in unlabeled data. No Clusters, latent structures, reduced feature spaces K-means clustering, Hierarchical clustering, Self-Organizing Maps, Neural Networks, Dimensionality reduction (PCA, ICA, t-SNE) Identification of gut enterotypes, discovery of microbial community patterns, patient stratification for personalized treatment Semi-supervised learning [ 76 77 78 Uses both labeled and unlabeled data to improve performance. Yes (partially labeled) Improved predictive models leveraging partial labels Self-training, Co-training, Graph-based methods Rare disease classification, clinical trial predictions with incomplete data, microbiome classification when full annotations are missing Reinforcement learning [ 79 80 An agent learns by interacting with the environment and receiving feedback (rewards/penalties). No Policies, reward signals Q-learning, Deep Reinforcement Learning Optimizing personalized treatment plans, adaptive probiotic recommendations, drug–microbiome interaction modeling bioengineering-12-00944-t004_Table 4 Table 4 Applications of AI/ML in gut microbiome research. Study Algorithm Data Type Application/Outcome Zeller et al. [ 88 Random forest Metagenomic sequencing Disease classification: identified microbial signatures distinguishing colorectal cancer from controls Qin et al. [ 89 Support Vector machines Metagenomic Type 2 diabetes classification and biomarker discovery from gut microbiome profiles Arumugam et al. [ 90 Clustering/Unsupervised learning Metagenomic Discovery of human gut enterotypes across populations Wirbel et al. [ 91 Random forest, LASSO regression Metagenomic Developed multi-cohort model for colorectal cancer prediction and validated across external cohorts Pasolli et al. [ 92 Deep-learning neural networks Shotgun metagenomic Improved disease classification (IBD, obesity, CRC) across large-scale microbiome datasets Topçuoğlu et al. [ 93 Logistic regression, Random forest 16S rRNA amplicon Predictive modeling of host phenotypes and experimental outcomes from microbiome data Asgari et al. [ 94 Convolutional neural networks Metagenomic Biomarker discovery for host–microbiome associations and disease prediction Vilne et al. [ 95 Reinforcement learning models Diet–microbiome interaction data Optimized microbiome-based risk prediction models for coronary artery disease bioengineering-12-00944-t005_Table 5 Table 5 Quantitative outcomes from representative microbiome AI/ML studies. Study Sample Size (N) Data Type Algorithm(s) Validation Performance Metric(s) Zeller et al. [ 88 335 (France, Germany, Italy, Austria) Metagenomic Random forest Cross-cohort Metagenomics + fecal occult blood test (FOBT) sensitivity increased >45% vs. FOBT alone at matched specificity Wirbel et al. [ 91 768 metagenomes, 3 validation cohorts Metagenomic Random forest, LASSO Multi-study CV + external validation Cross-study AUCs stable with multi-study training; identified 29 robust CRC-associated species Qin et al. [ 89 345 (Chinese adults) Metagenomic SVM Train/validation split Gene markers classified T2D vs. controls with significant separation Karlsson et al. [ 96 145 (European women) Metagenomic SVM, logistic regression Internal CV High accuracy for T2D vs. controls; identified pre-diabetic individuals as “diabetes-like” Pasolli et al. [ 92 2424 metagenomes across 8 studies Shotgun metagenomic Deep learning, Random forest, SVM Cross-validation + cross-study Cirrhosis AUC = 0.945; CRC AUC = 0.873; IBD AUC = 0.890 Topçuoğlu et al. [ 93 490 stool 16S rRNA RF, logistic regression, others Repeated CV RF AUROC = 0.695 (IQR 0.651–0.739); Logistic regression AUROC = 0.680 (0.625–0.735)  Arumugam et al. [ 90 Multi-country cohorts Metagenomic Clustering (k-means, PCA) Replication across cohorts Identified 3 reproducible enterotypes, stable across populations Asgari et al. [ 94 16S datasets, multiple environments Deep learning (MicroPheno) Cross-validation Macro-F1 = 0.88 (18 environments); 0.87 (5 organismal environments)  Vilne et al. [ 95 Diet + metagenomic cohort (CAD study) Multi-omic Reinforcement learning Case study analysis Optimized diet–microbiome interactions for CAD risk prediction ",
  "metadata": {
    "Title of this paper": "Exploring the synergy of artificial intelligence in microbiology: Advancements, challenges, and future prospects",
    "Journal it was published in:": "Bioengineering",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12466996/"
  }
}