{
  "title": "Paper_485",
  "abstract": "J Dent Res J Dent Res 1509 jdr JDR Journal of Dental Research 0022-0345 1544-0591 International Assoc. for Dental, Oral, and Craniofacial Research/American Assoc. for Dental, Oral, and Craniofacial Research PMC11653339 PMC11653339.1 11653339 11653339 39272215 10.1177/00220345241265676 10.1177_00220345241265676 1 Reviews Critical Reviews in Oral Biology & Medicine Apoptotic Vesicles: Therapeutic Mechanisms and Critical Issues Ou Q. 1 * Huang W. 1 * Wang B. 1 Niu L. 1 Li Z. 1 Mao X. 1 https://orcid.org/0000-0002-0574-2148 Shi S. 1 2 1 2 S. Shi, South China Center of Craniofacial Stem Cell Research, Guanghua School and Hospital of Stomatology, Sun Yat-sen University, 74 Zhongshan 2Rd, Guangzhou, Guangdong 510080, China. Emails: shisongtao@mail.sysu.edu.cn songtaos@upenn.edu * Authors contributing equally to this article. The authors declared no potential conflicts of interest with respect to the research, authorship, and/or publication of this article. 13 9 2024 10 2024 103 11 477307 1057 1065 01 10 2025 01 10 2025 19 12 2024 01 10 2025 © International Association for Dental, Oral, and Craniofacial Research and American Association for Dental, Oral, and Craniofacial Research 2024 2024 International & American Associations for Dental Research Apoptosis is the most prominent mode of programmed cell death and is necessary for the maintenance of tissue homeostasis. During cell apoptosis, a distinctive population of extracellular vesicles is generated, termed apoptotic vesicles apoptosis extracellular vesicle apoptotic bodies therapeutics clinical trial chronic inflammation pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes typesetter ts1 ",
  "metadata": {
    "Title of this paper": "Apoptotic Vesicles: Therapeutic Mechanisms and Critical Issues",
    "Journal it was published in:": "Journal of Dental Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11653339/"
  }
}