{
  "title": "Paper_1137",
  "abstract": "pmc Curr Oncol Curr Oncol 481 curroncol curroncol Current Oncology 1198-0052 1718-7729 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468078 PMC12468078.1 12468078 12468078 41002573 10.3390/curroncol32090503 curroncol-32-00503 1 Article Single-Center Real World Study of Everolimus and Exemestane in HR+/HER2− Metastatic Breast Cancer Following CDK4/6 Inhibitor Therapy https://orcid.org/0000-0002-0634-7350 Altıntaş Yunus Emre Conceptualization Validation Writing – original draft Writing – review & editing Project administration 1 * https://orcid.org/0000-0001-5983-3291 Kınıkoğlu Oğuzcan Software 1 https://orcid.org/0000-0003-4398-5148 Işık Deniz Formal analysis 1 Batu Aziz Formal analysis 2 https://orcid.org/0000-0003-1782-7808 Bayramgil Ayberk Software 2 Niğdelioğlu Büşra Validation 2 Özkerim Uğur Methodology Data curation 1 https://orcid.org/0000-0003-4721-0585 Öksüz Sıla Validation Data curation 1 https://orcid.org/0000-0003-1604-8466 Sürmeli Heves Investigation 1 https://orcid.org/0000-0002-1140-8779 Turan Nedim Resources 1 https://orcid.org/0000-0002-5757-4705 Odabaş Hatice Visualization Supervision 1 1 ogokinikoglu@yahoo.com dnz.1984@yahoo.com ugur.ozkerim@hotmail.com sila.oksuz@gmail.com hevessurmeli@hotmail.com turan.nedim@hotmail.com odabashatice@yahoo.com 2 azizbatu84@gmail.com ayberkbayramgil@gmail.com busranigdelioglu@gmail.com * yunusaltintas1688@gmail.com 10 9 2025 9 2025 32 9 497631 503 20 7 2025 04 9 2025 09 9 2025 10 09 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Simple Summary Hormone receptor-positive breast cancer is the most common type of advanced breast cancer in women. While hormone treatments are usually effective, many patients eventually stop responding. In this real-world study, we looked at the use of two oral drugs, everolimus and exemestane, in women whose cancer had already progressed after modern treatments like CDK4/6 inhibitors and chemotherapy. We found that this drug combination helped control the disease in nearly 9 out of 10 patients and was generally well tolerated, with few serious side effects. Our results suggest that everolimus and exemestane can still offer meaningful benefits even in later stages of treatment, especially when newer targeted drugs are not available. These findings may help guide treatment decisions and support the continued use of this combination in everyday clinical practice. Abstract Background: Hormone receptor-positive (HR+), HER2− negative metastatic breast cancer (MBC) is the most common subtype of advanced breast cancer. Resistance to endocrine therapy often develops, particularly after CDK4/6 inhibitors. Everolimus, an mTOR inhibitor, may restore hormone sensitivity, but real-world data after CDK4/6 and chemotherapy are limited. Methods: This retrospective, single-center study included 70 patients with HR+/HER2− MBC who progressed on CDK4/6 inhibitors and at least one line of chemotherapy. All received daily oral everolimus (10 mg) plus exemestane (25 mg). Tumor response was assessed via RECIST v1.1, and survival outcomes were estimated using the Kaplan–Meier method. Results: Median progression-free survival was 6.6 months and overall survival was 22.6 months. The disease control rate was 88.6%, with 57.1% showing partial response. Fatigue (20%), skin toxicity (8.6%), and stomatitis (5.7%) were the most common adverse events. No grade 3–4 toxicities or discontinuations occurred. No clinical or pathological variables significantly influenced survival. Conclusions: Everolimus plus exemestane provided meaningful clinical benefit and manageable toxicity in heavily pretreated HR+/HER2− MBC patients. This regimen remains a valid later-line option, particularly in settings with limited access to newer targeted therapies or genomic testing. everolimus exemestane CDK4/6 inhibitor resistance mTOR inhibition advanced breast cancer This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Hormone receptor-positive (HR+), human epidermal growth factor receptor 2-negative (HER2−) metastatic breast cancer (MBC) represents the most prevalent subtype of advanced breast cancer in postmenopausal women. Although endocrine therapy remains the cornerstone of treatment in this group, resistance either de novo or acquired poses a major therapeutic challenge and limits the long-term efficacy of hormonal agents such as selective estrogen receptor modulators (SERMs), selective estrogen receptor degraders (SERDs), and aromatase inhibitors (AIs) [ 1 2 AIs, including anastrozole, letrozole, and exemestane, are particularly favored in postmenopausal patients due to their superior efficacy compared to tamoxifen [ 3 4 4 1 5 Multiple studies have elucidated that one key pathway implicated in this resistance is the phosphatidylinositol 3-kinase/protein kinase B/mammalian target of rapamycin (PI3K/AKT/mTOR) signaling cascade [ 6 7 6 8 Everolimus, an oral mTOR inhibitor, was evaluated in combination with exemestane in the BOLERO-2 study—a pivotal randomized phase III trial—which demonstrated significantly improved progression-free survival (PFS) in patients who had previously progressed on nonsteroidal AIs [ 7 5 7 8 Despite the evidence from clinical trials, real-world data remain limited, especially in regions with unique healthcare reimbursement frameworks. In Turkey, for instance, the national reimbursement authority mandates that everolimus plus exemestane therapy can only be reimbursed in patients with HR+/HER2− MBC who have failed prior treatment with nonsteroidal AIs and received at least one line of chemotherapy in the metastatic setting [ 9 Given this context, the present study aims to evaluate the efficacy and safety of everolimus combined with exemestane in a real-world cohort of postmenopausal patients with HR+/HER2− MBC treated in accordance with national reimbursement criteria. By providing insights from retrospective clinical experience, this analysis contributes to the evolving understanding of endocrine resistance and the therapeutic role of mTOR inhibition in advanced breast cancer. 2. Materials and Methods This retrospective, single-center study included premenopausal and postmenopausal women diagnosed with HR+, HER2− de novo MBC who were treated at Kartal Dr. Lütfi Kırdar City Hospital (Istanbul, Turkey) between January 2020 and December 2024. Eligible patients had received first-line therapy with a cyclin-dependent kinase 4/6 (CDK4/6) inhibitor in combination with endocrine therapy. In accordance with national reimbursement regulations, all patients subsequently received at least one line of chemotherapy in the metastatic setting prior to initiation of everolimus-based treatment. Everolimus plus exemestane was initiated following progression on chemotherapy. Inclusion criteria were as follows: (1) histologically confirmed diagnosis of HR+/HER2− de novo MBC; (2) premenopausal or postmenopausal status at diagnosis; (3) receipt of first-line therapy with a CDK4/6 inhibitor plus endocrine therapy; (4) administration of at least one line of chemotherapy before everolimus-based treatment; (5) initiation of everolimus at 10 mg/day and exemestane at 25 mg/day; and (6) availability of complete clinical, treatment, and follow-up data. De novo MBC was defined as the presence of metastatic disease at the time of the initial breast cancer diagnosis. Patients who developed metastatic relapses following prior curative surgery or adjuvant systemic therapy were excluded. Exclusion criteria included HER2-positive or triple-negative breast cancer, prior exposure to mTOR inhibitors, incomplete or missing medical records, and a history of another active malignancy within the last five years. A total of 70 patients who fulfilled these criteria were included in the final analysis. All clinical data were retrospectively retrieved from the institutional electronic medical records system. Estrogen receptor (ER) status was determined by immunohistochemistry (IHC), and tumors with ≥1% nuclear staining were classified as ER-positive, in line with ASCO/CAP recommendations. HER2 status was determined by IHC. Patients with IHC 0 were classified as HER2-negative, whereas patients with IHC 1+ or IHC 2+ and ISH-negative were categorized as HER2-low. In this study, both HER2-negative and HER2-low patients were included in the analysis, consistent with the current clinical categorization of HER2-low within the HER2-negative spectrum. Genetic data such as BRCA1/2 mutational status were not routinely available in the institutional records and therefore were not included in the present analysis. Everolimus was administered orally at a daily dose of 10 mg, and exemestane at 25 mg once daily, following the dosing strategy adopted in the BOLERO-2 trial. Treatment was continued until radiologically confirmed disease progression, intolerable toxicity, or voluntary discontinuation. The index date was defined as the initiation of everolimus plus exemestane therapy. None of the patients classified as HER2-low received trastuzumab deruxtecan, as this agent was not reimbursed or available in Türkiye during the study period. Radiological assessments were performed at baseline and subsequently at regular intervals of approximately every 8–12 weeks, or earlier if clinically indicated, to evaluate treatment response according to Response Evaluation Criteria in Solid Tumors (RECIST) version 1.1 [ 10 All statistical analyses were performed using SPSS Statistics version 26.0 (IBM Corporation, Armonk, NY, USA). Descriptive statistics were used to summarize baseline demographic and clinical characteristics. Continuous variables were expressed as means with standard deviations or medians with interquartile ranges, while categorical variables were summarized as frequencies and percentages. PFS was defined as the time from the initiation of everolimus plus exemestane therapy to radiologically confirmed disease progression or death from any cause. Overall survival (OS) was defined as the time from the same index date to death from any cause. Both survival endpoints were estimated using the Kaplan–Meier method. Median survival times and corresponding 95% confidence intervals were reported. As this was a single-arm study, no formal comparisons between treatment groups were performed. The proportional hazards assumption for Cox regression was tested using Schoenfeld residuals and was not violated. Categorical variables (HER2 status, menopausal status, and ECOG performance status) were coded as binary factors. The study protocol was reviewed and approved by the Institutional Review Board of Kartal Dr. Lütfi Kırdar City Hospital (Approval No: 2025/010.99/1611; Date: 27 May 2025). All procedures involving human participants were conducted in accordance with the Declaration of Helsinki and Good Clinical Practice guidelines. Patients’ data were collected retrospectively from institutional records after ethics committee approval was obtained. The datasets analyzed during the current study are not publicly available due to institutional data privacy policies but are available from the corresponding author upon reasonable request. Generative AI tools, including ChatGPT (OpenAI, GPT-4, 2024 release) and Grammarly (version 1.0.40, 2024 desktop application), were used solely for language refinement and grammar correction. No AI assistance was involved in study design, data collection, statistical analysis, or interpretation. A flow diagram illustrating patient selection, exclusions, and the final study cohort ( n Figure 1 3. Results 3.1. Patient Characteristics A total of 70 premenopausal and postmenopausal women with HR+, human epidermal growth factor HER2− or HER2-low de novo metastatic breast cancer were included in the analysis. The median age at diagnosis was 51 years (range: 33–77 years). At the time of CDK4/6 inhibitor initiation, 53 patients (75.7%) were postmenopausal and 17 patients (24.3%) were premenopausal. The majority had an ECOG performance status of 0 ( n HER2 status was classified according to IHC assessment. Patients with HER2 IHC 0 were considered HER2-negative ( n n In terms of CDK4/6 inhibitor use in the first-line setting, 37 patients (52.9%) received palbociclib and 33 (47.1%) received ribociclib. All patients had received a CDK4/6 inhibitor in combination with endocrine therapy (aromatase inhibitor or fulvestrant) as first-line treatment. In addition, each patient received at least one line of chemotherapy in the metastatic setting before everolimus initiation, most commonly taxane- or anthracycline-based regimens. Some patients received more than one line of chemotherapy, consistent with the definition of a heavily pretreated population. Histologically, 37 patients (52.9%) had invasive ductal carcinoma, 26 (37.1%) had invasive carcinoma of no special type (NST), and 7 (10.0%) had invasive lobular carcinoma. Based on the duration of prior CDK4/6 inhibitor therapy, patients were divided into two using the median treatment duration of 14.3 months. Thirty-five patients (50.0%) received CDK4/6 inhibitors for less than 14.3 months, while the remaining 35 patients (50.0%) received treatment for a longer duration. The clinicopathological characteristics of the patients are summarized in Table 1 3.2. Survival Outcomes The median PFS was 6.6 months (95% CI: 5.59–7.61), as determined by Kaplan–Meier analysis ( Figure 2 The median OS was 22.6 months (95% CI: 11.92–33.35). Out of 70 patients, 36 (51.4%) had died, while 34 (48.6%) were censored at the time of data cutoff. The Kaplan–Meier survival curve demonstrated a continuous decline in survival probability over time, with approximately 30% of patients remaining alive at 36 months ( Figure 3 Univariate Cox regression analysis was performed to assess the impact of clinical and pathological variables on PFS. None of the tested variables including HER2 status (HER2-low vs. HER2-negative), menopausal status, ECOG performance status, histological subtype, type of CDK4/6 inhibitor received, and duration of CDK4/6 inhibitor use were found to be significantly associated with PFS in univariate analysis (all p These variables were subsequently included in a multivariate Cox regression model. Similarly, no independent association with PFS was observed for any of the included covariates in the multivariate analysis. Although both premenopausal (n = 17) and postmenopausal (n = 53) patients were included, no significant differences in PFS or OS were observed between these groups in subsequent analyses (all p A detailed summary of the univariate and multivariate regression results is provided in Table 2 Univariate Cox regression analysis revealed no statistically significant association between OS and the assessed clinical variables, including HER2 status, menopausal status, ECOG performance score, type of CDK4/6 inhibitor used, or duration of CDK4/6 inhibitor therapy. Consistently, none of these variables remained significant in the multivariate Cox regression model. A detailed summary of these analyses is presented in Table 3 3.3. Tumor Response and Disease Control Tumor response was evaluated radiologically according to RECIST criteria. Among the 70 patients included in the study, partial response (PR) was observed in 40 patients (57.1%), stable disease (SD) in 22 patients (31.4%), and progressive disease (PD) in 8 patients (11.4%). The disease control rate (DCR), defined as the combined proportion of PR and SD, was 88.6%. Response categories and their distribution are presented in Figure 4 3.4. Adverse Events Adverse events were recorded retrospectively based on clinical documentation. Among the 70 patients included in the analysis, no adverse events were reported in 38 patients (54.3%). The most frequently reported treatment-related side effect was fatigue ( n n n n n n Table 4 4. Discussion In this retrospective, single-center study, we evaluated the real world efficacy and safety of everolimus in combination with exemestane in a cohort of postmenopausal and premenopausal women with HR+/HER2− metastatic breast cancer who had previously received CDK4/6 inhibitor therapy and at least one line of chemotherapy. One of the main mechanisms responsible for endocrine resistance in HR+ breast cancer is the activation of the PI3K/AKT/mTOR pathway. This signaling pathway plays a key role in regulating cell growth, survival, and metabolism. When activated, it can stimulate estrogen receptor (ER) activity even in the absence of estrogen, contributing to resistance against hormonal treatments. Everolimus is a selective mTOR inhibitor that blocks this pathway by binding to mTOR complex 1 (mTORC1). This inhibition prevents the activation of downstream proteins such as S6 kinase and 4EBP1, which are involved in cancer cell growth and proliferation. Preclinical studies have shown that everolimus can restore hormone sensitivity and enhance the effect of endocrine therapy in resistant tumors [ 11 The efficacy outcomes observed in our study are in line with those reported in the pivotal BOLERO-2 trial, which demonstrated a significant improvement in PFS with the addition of everolimus to exemestane in postmenopausal women with HR+/HER2− advanced breast cancer previously treated with nonsteroidal aromatase inhibitors. In BOLERO-2, everolimus plus exemestane achieved a median PFS of 6.9 months (local assessment) compared to 2.8 months in the placebo group (HR: 0.43; p 6 One of the most noteworthy aspects of the BOLERO-6 trial was the inclusion of capecitabine as a comparator, offering valuable insights into the choice between targeted therapy and chemotherapy in the endocrine-resistant setting. In BOLERO-6, capecitabine yielded a median PFS of 9.6 months, which was numerically longer than that of the everolimus plus exemestane arm (8.4 months); however, this difference was not statistically tested and was influenced by baseline imbalances and potential informative censoring [ 12 The EMERALD trial demonstrated the efficacy of elacestrant, a novel oral SERD, in patients with ER-positive, HER2-negative advanced breast cancer who had progressed after prior endocrine therapy and CDK4/6 inhibitors. In this phase 3 trial, which included both ESR1-mutant and wild-type populations, the median PFS with elacestrant was 2.8 months in the overall population and 3.8 months in patients with ESR1 mutations [ 13 The SOLAR-1 trial led to the approval of alpelisib plus fulvestrant for patients with PIK3CA-mutated, HR+/HER2− advanced breast cancer. However, only about 6% of the patients in that trial had previously received CDK4/6 inhibitors, which limits how well its results apply to current treatment practice [ 14 15 Recent studies have also explored the combination of everolimus and exemestane with CDK4/6 inhibitors. The TRINITI-1 trial evaluated the triplet regimen of ribociclib, everolimus, and exemestane in HR+/HER2− advanced breast cancer patients who had progressed on prior CDK4/6 inhibitor therapy. The study reported a clinical benefit rate of 41.1% at 24 weeks and a median PFS of 5.7 months, despite the continuation of CDK4/6 inhibition beyond progression [ 16 17 The safety profile observed in our study was largely consistent with the known toxicity spectrum of everolimus plus exemestane reported in the BOLERO-2 trial [ 6 Interestingly, in both univariate and multivariate analyses, no statistically significant associations were observed between clinical or pathological variables including HER2 status, menopausal status, ECOG performance score, CDK4/6 inhibitor type or duration and progression free or overall survival. The number of events in the OS analysis (36 deaths) was relatively limited, which may affect the precision of the multivariate estimates. While such findings might suggest a lack of predictive markers for treatment response, they may also reflect the broadly consistent efficacy of everolimus plus exemestane across diverse patient subgroups. This observation is particularly relevant given the single-arm design of our study and the real-world setting, where heterogeneity in baseline characteristics is common. The absence of significant subgroup differences reinforces the notion that this combination therapy may offer clinical benefit to a wide spectrum of HR+/HER2− metastatic breast cancer patients who have progressed following CDK4/6 inhibition and chemotherapy. However, some limitations of our study should be considered. Since this was a retrospective, single-center study, there may have been selection bias, and our results may not fully reflect the broader patient population. Also, we did not have access to detailed molecular data such as PIK3CA or ESR1 mutation status, which could have helped identify which patients benefit most from everolimus-based treatment. Another important point is the lack of a control group, which makes it difficult to compare our results directly with other treatment options. Because the study was performed in a real-world setting, adverse events may not have been recorded completely, especially if they were mild. Despite these limitations, our findings provide useful information about the effectiveness and tolerability of everolimus plus exemestane in daily clinical practice, especially in patients who have already received CDK4/6 inhibitors and chemotherapy. Further prospective studies with larger patient numbers and biomarker analysis are needed to guide more personalized treatment decisions. 5. Conclusions In this real-world, retrospective study, the combination of everolimus and exemestane demonstrated meaningful clinical activity in patients with HR+/HER2− metastatic breast cancer who had progressed after both CDK4/6 inhibitors and chemotherapy. The observed progression-free survival and disease control rates were comparable to those reported in clinical trials, despite a more heavily pretreated population. No significant associations were identified between survival outcomes and baseline clinical features, suggesting a potential benefit across a broad patient spectrum. These findings support the continued use of everolimus plus exemestane as a valuable treatment option in later lines of therapy, particularly in settings where access to newer targeted agents is limited. Prospective studies incorporating molecular profiling are warranted to further optimize patient selection and outcomes. Acknowledgments We acknowledge the use of generative AI tools, including DeepL Translate, and Grammarly, for language refinement and grammatical corrections. However, all intellectual contributions, analyses, and interpretations presented in this manuscript are solely our own. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, Y.E.A.; methodology, U.Ö.; software, A.B. (Aziz Batu) and O.K.; validation, S.Ö., B.N. and Y.E.A.; formal analysis, A.B. (Ayberk Bayramgil) and D.I.; investigation, H.S.; resources, N.T.; data curation, S.Ö. and U.Ö.; writing—original draft preparation, Y.E.A.; writing—review and editing, Y.E.A.; visualization, H.O.; supervision, H.O.; project administration, Y.E.A. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study protocol was reviewed and approved by the Institutional Review Board of Kartal Dr. Lütfi Kırdar City Hospital (Approval No: 2025/010.99/1611; Date: 27 May 2025). All procedures involving human participants were conducted in accordance with the Declaration of Helsinki and Good Clinical Practice guidelines. Informed Consent Statement Patients data were collected retrospectively from patients records after ethics committee approval was obtained from Kartal Dr. Lütfi Kırdar City Hospital. Data Availability Statement While the datasets analyzed in this study are not publicly accessible, they can be obtained from the corresponding author upon reasonable request. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: HR+ Hormone receptor positive HER2 Human epidermal growth factor receptor 2 negative MBC Metastatic breast cancer SERMs Selective estrogen receptor modulators SERDs Selective estrogen receptor degraders AIs Aromatase inhibitors PI3K Phosphatidylinositol 3-kinase AKT Protein kinase B mTOR Mammalian target of rapamycin HIF-1α Hypoxia-inducible factor 1-alpha CDK4/6 Cyclin-dependent kinase 4 and 6 IHC Immunohistochemistry ISH In situ hybridization ECOG Eastern Cooperative Oncology Group PFS Progression-free survival OS Overall survival RECIST Response Evaluation Criteria in Solid Tumors HR Hazard ratio CI Confidence interval PR Partial response SD Stable disease PD Progressive disease DCR Disease control rate ER Estrogen receptor ESR1 Estrogen receptor 1 NST No special type (as in invasive carcinoma NST) References 1. Johnston S.R.D. New strategies in estrogen receptor–positive breast cancer Clin. Cancer Res. 2010 16 1979 1987 10.1158/1078-0432.CCR-09-1823 20332324 2. Burstein H.J. Prestrud A.A. Seidenfeld J. Anderson H. Buchholz T.A. Davidson N.E. Gelmon K.E. Giordano S.H. Hudis C.A. Malin J. American Society of Clinical Oncology Clinical Practice Guideline: Endocrine therapy for hormone receptor–positive metastatic breast cancer J. Clin. Oncol. 2011 29 4845 4850 3. Bonneterre J. Thürlimann B. Robertson J.F. Krzakowski M. Mauriac L. Koralewski P. Vergote I. Webster A. Steinberg M. von Euler M. Anastrozole versus tamoxifen as first-line therapy for advanced breast cancer J. Clin. Oncol. 2001 19 2596 2606 4. Chia S. Gradishar W. Mauriac L. Bines J. Amant F. Federico M. Fein L. Romieu G. Buzdar A. Robertson J.F. Double-blind, randomized placebo controlled trial of fulvestrant compared with exemestane after prior nonsteroidal aromatase inhibitor therapy in postmenopausal women with hormone receptor-positive, advanced breast cancer: Results from EFECT J. Clin. Oncol. 2008 26 1664 1670 10.1200/JCO.2007.13.5822 18316794 5. Smith I.E. Dowsett M. Aromatase inhibitors in breast cancer N. Engl. J. Med. 2003 348 2431 2442 10.1056/NEJMra023246 12802030 6. Baselga J. Campone M. Piccart M. Burris H.A. Rugo H.S. 3rd Sahmoud T. Noguchi S. Gnant M. Pritchard K.I. Lebrun F. Everolimus in postmenopausal hormone-receptor–positive advanced breast cancer N. Engl. J. Med. 2012 366 520 529 10.1056/NEJMoa1109653 22149876 PMC5705195 7. Piccart M. Baselga J. Noguchi S. Burris H. Gnant M. Hortobagyi G. Mukhopadhyay P. Taran T. Sahmoud T. Rugo H. Final progression-free survival analysis of BOLERO-2 Lancet Oncol. 2014 15 648 656 8. Pouysségur J. Dayan F. Mazure N.M. Hypoxia signaling in cancer and approaches to enforce tumour regression Nature 2006 441 437 443 10.1038/nature04871 16724055 9. T.C. Sosyal Güvenlik Kurumu Sağlık Uygulama Tebliği (SUT) T.C. Sosyal Güvenlik Kurumu Ankara, Turkey 2024 10. Eisenhauer E.A. Therasse P. Bogaerts J. Schwartzd L.H. Sargente D. Fordf R. Danceyg J. Arbuckh S. Gwytheri S. New response evaluation criteria in solid tumours: Revised RECIST guideline (version 1.1) Eur. J. Cancer. 2009 45 228 247 10.1016/j.ejca.2008.10.026 19097774 11. Dhillon S. Everolimus in combination with exemestane: A review of its use in the treatment of patients with postmenopausal hormone receptor-positive, HER2-negative advanced breast cancer Drugs 2013 73 475 485 10.1007/s40265-013-0034-2 23529824 12. Jerusalem G. de Boer R.H. Hurvitz S. Yardley D.A. Kovalenko E. Ejlertsen B. Blau S. Özgüroğlu M. Landherr L. Ewertz M. Everolimus Plus Exemestane vs Everolimus or Capecitabine Monotherapy for Estrogen Receptor–Positive, HER2-Negative Advanced Breast Cancer: The BOLERO-6 Randomized Clinical Trial JAMA Oncol. 2018 4 1367 1374 10.1001/jamaoncol.2018.2262 29862411 PMC6233772 13. Bidard F.C. Kaklamani V.G. Neven P. Streich G. Montero A.J. Forget F. Mouret-Reynier M.A. Sohn J.H. Taylor D. Harnden K.K. Elacestrant (oral selective estrogen receptor degrader) versus standard endocrine therapy for ER-positive, HER2-negative advanced breast cancer: Results from the randomized phase III EMERALD trial J. Clin. Oncol. 2022 40 3246 3256 10.1200/JCO.22.00338 35584336 PMC9553388 14. André F. Ciruelos E. Rubovszky G. Campone M. Loibl S. Rugo H.S. Iwata H. Conte P. Mayer I.A. Kaufman B. Alpelisib for PIK3CA-mutated, hormone receptor–positive advanced breast cancer N. Engl. J. Med. 2019 380 1929 1940 10.1056/NEJMoa1813904 31091374 15. Rugo H.S. Lerebours F. Ciruelos E. Drullinsky P. Ruiz-Borrego M. Neven P. Park Y.H. Prat A. Bachelot T. Juric D. Alpelisib plus fulvestrant in PIK3CA mutated, hormone receptor positive advanced breast cancer after CDK4/6 inhibitor failure (BYLieve): Phase II cohort A Lancet Oncol. 2024 25 e629 e638 10.1016/S1470-2045(24)00673-9 39637900 16. Bardia A. Hurvitz S.A. DeMichele A. Clark A.S. Zelnak A. Yardley D.A. Karuturi M. Sanft T. Blau S. Hart L. TRINITI-1: A phase I/II study of ribociclib, everolimus, and exemestane in patients with HR-positive, HER2-negative advanced breast cancer after progression on a CDK4/6 inhibitor Clin. Cancer Res. 2021 27 4177 4185 10.1158/1078-0432.CCR-20-2114 33722897 PMC8487593 17. Gómez Tejeda Zañudo J. Barroso-Sousa R. Jain E. Jin Q. Li T. Buendia-Buendia J.E. Pereslete A. Abravanel D.L. Ferreira A.R. Wrabel E. Exemestane plus everolimus and palbociclib in metastatic breast cancer: Clinical response and genomic/transcriptomic determinants of resistance in a phase I/II trial Nat. Commun. 2024 15 2446 10.1038/s41467-024-45835-6 38503755 PMC10951222 Figure 1 Flow diagram of patient selection and inclusion in the study. Figure 2 Kaplan–Meier curve illustrating PFS in patients treated with everolimus plus exemestane after prior CDK4/6 inhibitor and chemotherapy. Figure 3 Kaplan–Meier curve illustrating OS in patients treated with everolimus plus exemestane after prior CDK4/6 inhibitor and chemotherapy. Figure 4 Bar chart showing the distribution of best radiologic responses among patients treated with everolimus plus exemestane. Abbreviations: PR, Partial response; SD, Stable Disease; PD, Progressive Disease. curroncol-32-00503-t001_Table 1 Table 1 Baseline clinicopathological characteristics of the patients. Variable n  Median age at diagnosis, years (range) 51 (33–77)  Menopausal status  Postmenopausal 53 (75.7%) Premenopausal 17 (24.3%)  ECOG performance status  0 56 (80.0%) 1 14 (20.0%)  HER2 status  HER2-negative (IHC 0) 33 (47.1%) HER2-low (IHC 1+ or 2+/ISH−) 37 (52.9%)  Histological type  Invasive ductal carcinoma 37 (52.9%) Invasive carcinoma NST 26 (37.1%) Invasive lobular carcinoma 7 (10.0%)  Type of CDK4/6 inhibitor used  Palbociclib 37 (52.9%) Ribociclib 33 (47.1%)  Duration of CDK4/6 inhibitor use  <14.3 months 35 (50.0%) ≥14.3 months 35 (50.0%) Abbreviations: HER2, human epidermal growth factor receptor 2; IHC, immunohistochemistry; CDK4/6, cyclin-dependent kinase 4 and 6; ISH, in situ hybridization. curroncol-32-00503-t002_Table 2 Table 2 Univariate and Multivariate Cox Regression Analysis for Progression-Free Survival. Variable HR 95% CI p HR 95% CI (Multivariate) p HER2 status (Low vs. negative) 0.70 0.43–1.13 0.148 0.68 0.40–1.16 0.160 Menopausal status 0.97 0.55–1.70 0.906 1.11 0.61–2.02 0.744 ECOG performance status 1.04 0.58–1.89 0.884 0.79 0.41–1.53 0.488 Histological subtype 0.86 0.67–1.11 0.241 0.91 0.66–1.26 0.568 Type of CDK4/6 inhibitor 1.36 0.83–2.21 0.218 1.44 0.87–2.39 0.155 Duration of CDK4/6 inhibitor 1.23 0.76–1.99 0.392 1.20 0.70–2.06 0.500 Abbreviations: HR, hazard ratio; CI, confidence interval; CDK4/6, cyclin-dependent kinase 4 and 6; ECOG, Eastern Cooperative Oncology Group. curroncol-32-00503-t003_Table 3 Table 3 Univariate and Multivariate Cox Regression Analysis for Overall Survival. Variable HR 95% CI p HR 95% CI (Multivariate) p HER2 status (Low vs. Negative) 1.55 0.75–3.21 0.238 1.46 0.68–3.12 0.331 Menopausal status 1.25 0.56–2.77 0.588 1.30 0.57–2.97 0.530 ECOG performance status 0.86 0.32–2.26 0.754 0.84 0.29–2.39 0.740 Duration of CDK4/6 inhibitor use 0.96 0.48–1.94 0.910 1.18 0.55–2.54 0.675 Type of CDK4/6 inhibitor 1.60 0.75–3.41 0.223 1.61 0.74–3.53 0.233 Abbreviations: HR, hazard ratio; CI, confidence interval; CDK4/6, cyclin-dependent kinase 4 and 6; ECOG, Eastern Cooperative Oncology Group. curroncol-32-00503-t004_Table 4 Table 4 Summary of Adverse Events. Adverse Event Number of Patients ( n None 38 (54.3%) Fatigue 14 (20%) Edema 1 (1.4%) Stomatitis 4 (5.7%) Skin toxicity 6 (8.6%) Pneumonitis 1 (1.4%) Allergy 2 (2.9%) Hematologic toxicity 1 (1.4%) Diarrhea 3 (4.3%) ",
  "metadata": {
    "Title of this paper": "Exemestane plus everolimus and palbociclib in metastatic breast cancer: Clinical response and genomic/transcriptomic determinants of resistance in a phase I/II trial",
    "Journal it was published in:": "Current Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468078/"
  }
}