{
  "title": "Paper_976",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470368 PMC12470368.1 12470368 12470368 41009795 10.3390/ijms26189233 ijms-26-09233 1 Review Advances in Psoriasis Research: Decoding Immune Circuits and Developing Novel Therapies Wang Lanying 1 2 Liu Ruiling 1 2 Tang Yulu 1 2 Ma Yuanfang 1 2 Wang Guimei 1 2 https://orcid.org/0000-0001-9315-3716 Ruan Qingguo 1 2 * https://orcid.org/0000-0001-9462-4794 Zheng Shijun J. 1 2 * Bettiol Alessandra Academic Editor 1 lan131600@163.com ruilingliu@henu.edu.cn 18238290585@163.com mayf@henu.edu.cn 17726067138@163.com 2 * ruanqg222@henu.edu.cn sjzheng@cau.edu.cn 21 9 2025 9 2025 26 18 497349 9233 23 8 2025 16 9 2025 19 9 2025 21 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Psoriasis is a chronic inflammatory autoimmune skin disease characterized by erythematous plaques covered with silvery-white scales, often accompanied by systemic complications such as psoriatic arthritis and cardiovascular diseases. The disease and its systemic complications substantially impair quality of life, compromise socioeconomic status, and threaten patient safety. The occurrence and progression of this disease are related to the IL-23/IL-17 axis and involve the aberrant activation and interactions of multiple immune cells, along with genetic predispositions and environmental triggers. Although current therapeutic approaches, including topical agents, systemic medications, biologic agents targeting key cytokines, and Janus Kinase inhibitors, can control symptoms and delay disease progression, a complete cure has not been achieved. Furthermore, these strategies face challenges relating to the cost, safety, efficacy and precision of targeting. This review summarizes recent advances in mechanistic research, highlighting the interplay among microorganisms, innate and adaptive immunity in psoriasis. We also evaluate a range of emerging therapies, including biologics, small-molecule inhibitors, Chimeric antigen receptor T-cell cell therapy, RNA interference-based strategies, and alternative medicine. Specifically, we focus on their novel mechanisms, efficacy challenges, safety profiles, and targeting accuracy. Finally, we assess their potential in personalized treatment, aiming to achieve long-term remission, and propose the future prospects of precision medicine in psoriasis management. psoriasis IL-23/IL-17 axis biologicals targeted therapy CAR-T cell therapy Henan University CX3050A1000178 CX3050A1000179 This work was supported by Start-Up fundings for faculty recruitment from Henan University (CX3050A1000178, CX3050A1000179). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The erroneous self-attack and destruction of tissue or organ by the immune system can result in autoimmune diseases. To date, over 150 distinct autoimmune disorders have been documented, including psoriasis, type 1 diabetes mellitus, multiple sclerosis, systemic lupus erythematosus, rheumatoid arthritis (RA), and so on [ 1 2 3 4 5 6 The pathogenesis of psoriasis involves multiple cell types and cytokines as well as both genetic predisposition and environmental triggers. Current evidence indicates that the interleukin (IL)-23/IL-17 axis is the central driver of psoriatic inflammation [ 7 8 9 10 11 12 Currently, the treatment strategies for psoriasis primarily include topical therapy, systemic therapy, and biologic therapy. Conventional topical treatments commonly involve corticosteroids and vitamin D3 analogs. Conventional systemic therapies encompass phototherapy, methotrexate, and cyclosporine. Recent advances in biologic agents, particularly monoclonal antibodies against IL-17 and IL-23, have demonstrated significant clinical efficacy and a favorable safety profile in psoriasis treatment. However, their long-term use may be associated with increased risks of drug resistance and infections [ 13 14 2. Epidemiology and Disease Burden Psoriasis is a globally distributed disease [ 15 16 17 18 19 20 21 2 x 10 22 23 Psoriasis induces multidimensional health impairments, including dermatological-articular comorbidities [ 3 24 25 5 26 27 28 29 30 31 32 3. Clinical Presentation Based on clinical and pathophysiological characteristics, psoriasis is mainly categorized into eight subtypes, such as chronic plaque, guttate psoriasis, erythrodermic psoriasis, psoriatic arthritis (PsA), pustular psoriasis, inverse psoriasis, seborrheic psoriasis, and nail psoriasis. The clinical characteristics of psoriasis subtypes are summarized in Table 1 Chronic plaque psoriasis, which accounts for approximately 90% of all psoriasis cases, initially presents as erythematous papules or plaques [ 33 34 35 Guttate psoriasis accounts for about 2% of psoriasis and predominantly affects adolescents. It typically presents with numerous scaly papules measuring 0.3 to 0.5 cm in diameter and is frequently triggered by streptococcal pharyngitis [ 36 37 Erythrodermic psoriasis, a severe and potentially life-threatening variant of psoriasis, accounts for approximately 1–2% of all psoriasis cases [ 38 39 PsA, an inflammatory joint disorder associated with psoriasis, may develop concurrently with or subsequent to cutaneous manifestations. Clinical features include joint swelling, pain, and progressive functional impairment. In severe cases, these may advance to irreversible joint deformities. This progressive and irreversible disease course highlights the critical importance of early diagnosis and timely intervention. Pustular psoriasis is characterized by the eruption of sterile, superficial micropustules ranging from pinhead to millet-sized (1–3 mm). This eruption is characterized by densely aggregated pustules that may coalesce into lakes of pus. While the disease can remain confined to the palms and soles, its generalized form manifests acutely, constitutes a severe variant of psoriasis, and necessitates systemic therapy. The pustules generally desiccate and crust within 1–2 weeks, followed by spontaneous resolution. However, the disease often exhibits a relapsing-remitting course, with periodic recurrence of pustular. Inverse psoriasis affects skin folds, such as the buttocks, groin and armpits. The skin lesions are red, shiny and without characteristic scales. Owing to the moist and friction-prone nature of the affected areas, this condition is frequently confused with or complicated by fungal or bacterial co-infections, thereby complicating both diagnosis and therapeutic management. Seborrheic psoriasis occurs in the sebaceous areas of the scalp and face, as well as in the area behind ears or in front of the sternum. Its clinical sign exhibits the features intermediate between psoriasis and seborrheic dermatitis, necessitating differential diagnosis against both conditions. Nail psoriasis manifests itself in a variety of ways, including small pits on the nail plate, nail separation, oil droplets (orange discoloration of the nail bed), or fragmentation of the nail plate. It affects about 40.9% of patients with plaque psoriasis, and patients with nail involvement have a longer duration of disease, higher severity of disease, and a higher frequency of PsA [ 40 ijms-26-09233-t001_Table 1 Table 1 Summary of Clinical Features of Psoriasis Subtypes. Subtype Name Approximate Prevalence Among Psoriasis Patients (%) Key Clinical Features Severity Psoriasis vulgaris 90% [ 33 Well-demarcated erythematous plaques covered with thick silvery-white scales; wax-drop phenomenon, thin-film phenomenon, Auspitz sign; symmetrically distributed, often accompanied by pruritus Mild to moderate (most common) Guttate psoriasis 2% [ 41 Frequently occurs in adolescents, often secondary to streptococcal infection; numerous scaling papules (0.3–0.5 cm in diameter) disseminated over the body; acute onset, may resolve within weeks Typically acute, transient, may progress to chronic phase Erythrodermic psoriasis 1–2% [ 38 Diffuse erythema and edema involving >75% of body surface area; extensive pityriasis-like scaling; accompanied by systemic symptoms such as fever and lymphadenopathy Severe, potentially life-threatening Psoriatic arthritis(PsA) 24% [ 42 Joint swelling, pain, and limited mobility, potentially leading to deformity in severe cases; can affect large and small joints, as well as sacroiliac joints; radiographic findings include joint erosion, space narrowing, and other destructive changes Severe, progressive Pustular psoriasis 1–3% [ 43 Sterile pinpoint to millet-sized pustules that may coalesce into “lakes of pus”; can be localized (e.g., palms and soles) or generalized Severe Inverse psoriasis / Occurs in skin folds; presents as erythematous, shiny plaques, typically without scaling Mild to moderate Sebopsoriasis / Occurs in sebaceous gland-rich areas; clinical features overlap between psoriasis and seborrheic dermatitis Mild to moderate Nail psoriasis 40.9% [ 40 Nail plate pitting, onycholysis, “oil-drop” discoloration, and crumbling of the nail plate Often associated with long disease duration, severe disease, and PsA The distribution of psoriasis subtypes is heterogeneous across different countries and regions. The diagnosis of psoriasis is primarily determined by the location, type and history of skin injury. Histopathological features have been shown to possess a certain degree of diagnostic value, while skin imaging has been identified as having auxiliary diagnostic value. Certain diseases exhibit symptoms similar to those of psoriasis and require differential diagnosis ( Table 2 4. Pathophysiology 4.1. Histological Features The histopathological characteristics of psoriasis include epidermal hyperplasia, hyperkeratosis with parakeratosis, presence of Munro microabscesses (focal collections of neutrophils within the epidermis), and marked diminution or complete absence of the granular layer [ 23 44 4.2. Genetic Contributions Psoriasis demonstrates strong genetic predisposition. Genome-wide association studies (GWAS) have identified 109 distinct susceptibility loci for psoriasis [ 45 46 47 48 49 50 Figure 1 HLA-C* 51 erap1 HLA-C + 52 HLA-DRB1* 53 il23r 54 ddx58 55 traf3ip2 56 57 4.3. Triggers In addition to genetic predisposition, environmental factors, hormonal levels, and lifestyles also contribute to the onset and progression of psoriasis. Microbial infections have been strongly implicated in both disease initiation and exacerbation. For example, infections with Streptococcus pyogenes 58 59 + 60 61 62 63 + 64 + 65 66 67 68 69 Fluctuations in estrogen levels can potentially impact the progression of psoriasis. Estrogen may exert anti-psoriatic effects via estrogen receptors α and β (ERα/ERβ)-mediated downregulation of proinflammatory cytokines in immune cells. Paradoxically, under specific conditions, estrogen can promote IL-23 secretion by dendritic cells, potentially exacerbating disease [ 70 71 72 71 73 74 75 47 76 77 78 79 4.4. Pathogenesis The pathogenesis of psoriasis involves intricate interactions of genetic, immunological, and environmental factors, characterized by the synergistic dysregulation of immune system activation and epidermal cell dysfunction [ 80 81 82 Keratinocytes (KCs), constituting approximately 90% of epidermal cells, exhibit abnormal proliferation and differentiation that directly contribute to psoriatic acanthosis [ 83 84 55 85 86 + 87 88 89 90 91 4.5. Innate Immunity Aberrant activation of the innate immune system may contribute to psoriatic inflammation, wherein immune cells including neutrophils, dendritic cells, and macrophages become hyperactivated through pattern recognition receptor (PRR)-mediated detection of DAMPs or PAMPs, subsequently releasing excessive proinflammatory cytokines that further stimulate adaptive immune responses (as shown in Figure 2 In psoriatic lesions, neutrophils accumulate within the epidermal compartment [ 92 93 94 95 96 97 98 99 100 101 102 + 103 104 In healthy skin tissue, dendritic cells (DCs) are predominantly confined to the dermal compartment, whereas approximately 50% of DCs migrate to the epidermal layer in psoriatic lesions [ 105 106 107 108 109 89 110 Cutaneous macrophages are broadly categorized into epidermal Langerhans cells (LCs) and dermal macrophages. As tissue-resident immune sentinels, LCs are critical in the early pathogenesis of psoriasis [ 111 112 + 113 114 115 116 Psoriatic lesions demonstrate increased activated macrophages, particularly during late-stage inflammation [ 106 117 118 119 120 118 121 Mast cells are critical in acute allergic and chronic inflammatory pathologies [ 122 123 124 125 126 γδ T cells significantly contribute to psoriatic inflammation, with Vγ5 + + 127 128 129 Natural killer cells (NKs) play a significant immunomodulatory role in psoriasis through cytokine-mediated regulation of Th1/Th2 and Th17/Treg cell network, thereby contributing to the disease pathogenesis [ 130 131 132 133 Myeloid-derived suppressor cells (MDSCs) typically secrete immunosuppressive cytokines like IL-10 and TGF-β to downregulate the expression of proinflammatory cytokines and inhibit immune responses. However, emerging evidence points to a paradoxical role for these cells in psoriasis. It was found that MDSCs from psoriasis patients paradoxically promoted Th17 responses by enhancing Th17 cell differentiation, increasing production of IL-23, IL-1β, and CCL4, while showing reduced expression of PD-1 and PD-L1 and failing to generate Tregs, thereby disrupting T cell homeostasis [ 134 135 4.6. Adaptive Immunity It was found that psoriatic skin lesions are enriched with CD4 + 121 + 136 137 138 139 140 141 142 Th1 cells produce IFN-γ and TNF-α, where IFN-γ enhances the antigen-presenting capacity of DCs and promotes M1 macrophage polarization (secreting IL-12 and NO), thereby reinforcing Th1 differentiation. TNF-α directly contributes to tissue damage, releasing additional DAMPs that sustain TLR7/8 pathway activation, establishing a proinflammatory positive feedback loop [ 121 143 The Th22 cell is characterized by producing IL-22, which promotes abnormal KCs proliferation and parakeratosis while establishing a positive feedback loop through CCL20 induction [ 144 145 146 147 148 However, in psoriasis patients, Th2 cells and their secreted cytokines, IL-4 and IL-10, are reduced [ 149 150 151 It was reported that specific K17 truncated variants (aa118-132) exhibited HLA-DRB1 53 + HLA-C* HLA-DR streptococcus 152 153 154 HLA-C + HLA-C 51 155 CD8 + 156 157 + + 158 + HLA-C* + 51 + 159 Compared to healthy skin, psoriatic lesions exhibit a 100-fold increase in T cell numbers, and a 50-fold increase compared to non-lesional skin, indicating significant tissue-resident memory T cells (TRM) expansion in psoriatic plaques [ 160 161 162 160 163 The functional and phenotypic alterations of Tregs in psoriasis remain incompletely understood. It was found that although the number of Treg increased systemically in psoriasis patients, their migration and survival within psoriatic lesions were impaired, resulting in insufficient immunosuppressive capacity and uncontrolled inflammation [ 164 165 166 166 167 Psoriasis patients exhibit increased levels of B cell activation in peripheral blood, correlating with the severity of clinical symptoms. It was reported that differential proportions of CD19 + 168 169 170 60 171 169 172 173 Regulatory B cells (Bregs) suppress psoriasiform inflammation through IL-10-dependent mechanisms, which concurrently enhance Tregs expansion and restrain Th17 differentiation [ 174 175 176 5. Management and Treatment 5.1. Conventional Topical Therapy Current treatment strategies for psoriasis primarily involve immunosuppression, anti-inflammatory therapy, and palliative care (Conventional treatment approaches are shown in Table 3 Corticosteroids serve as first-line topical therapeutic agents, demonstrating favorable safety and tolerability profiles. Clinically, formulations of varying potencies and durations of action can be selected based on disease severity, enabling rapid symptom control [ 177 178 179 180 Salicylic acid-based drugs are utilized in the treatment of psoriasis, as they promote desquamation of hyperkeratotic scales and enhance the penetration of concomitant topical therapies, such as corticosteroids [ 181 Calcipotriol, a vitamin D3 analog, primarily acts by binding to vitamin D receptors on keratinocytes to modulate keratinocyte proliferation and differentiation. It is commonly used for topical treatment of plaque psoriasis [ 182 182 183 Tapinarof cream, an aryl hydrocarbon receptor modulator, regulates IL-17 expression and skin barrier proteins (such as filaggrin), demonstrating significant efficacy in mild-to-severe plaque psoriasis while potentially causing local adverse reactions including folliculitis [ 184 ijms-26-09233-t003_Table 3 Table 3 Conventional Drug Therapies for Psoriasis. Category Drug Name Target/ Efficacy Profile Adverse Effects Notes Topical Corticosteroids [ 178 Suppression of Th17-mediated inflammation; modulation of dendritic and T-cell activity Rapid symptom control; suitable for mild-to-moderate plaque psoriasis hypothalamic–pituitary–adrenal axis suppression with prolonged use Avoid continuous long-term application Calcipotriol (Vitamin D3 analog) [ 185 Regulation of keratinocyte proliferation/differentiation; immunomodulation Improves hyperproliferation and differentiation; safe and effective Local irritation (erythema, pruritus) First-line for plaque psoriasis Tacrolimus ointment [ 186 Calcineurin inhibition High local tolerability Burning sensation, infection risk Suitable for mild cases or combination therapy Calcipotriol/betamethasone combo [ 187 Synergistic anti-inflammatory effects of Vitamin D3 analog combined with corticosteroid Superior efficacy to monotherapy; reduced relapse Reduced skin irritation vs. monotherapy Indicated for moderate-to-thick plaques Tapinarof cream [ 184 Aryl hydrocarbon receptor, modulation; IL-17 suppression; skin barrier enhancement Significant improvement in mild-to-severe plaque psoriasis Folliculitis, local irritation Favorable safety profile Systemic Therapies NB-UVB [ 188 local immunosuppression First-line therapy with high safety Frequent clinic visits; limited phototherapy center access Suitable for pregnant patients and children MTX [ 178 Folate metabolism inhibition; anti-inflammatory Effective for moderate-to-severe psoriasis and psoriatic arthritis Hepatotoxicity myelosuppression, gastrointestinal disturbances Requires regular liver function monitoring Cyclosporine [ 189 Selective T-cell inhibition; IL-2 blockade Rapid onset; used for acute flares Nephrotoxicity, immunosuppression renal monitoring Acitretin [ 190 191 Keratinocyte differentiation modulation; anti-inflammatory Controls hyperkeratosis; adjunct for severe psoriasis Teratogenicity, xerosis, photosensitivity Prohibited for pregnant women Due to space limitation, only representative drugs per category are listed. 5.2. Conventional Systemic Therapy Phototherapy is considered a first-line intervention for moderate-to-severe psoriasis following the failure of topical therapies. Ultraviolet B (UVB) radiation penetrates the epidermis directly, inducing the formation of pyrimidine dimers in DNA, which subsequently triggers apoptosis of activated and proliferating T cells [ 192 193 194 188 Acitretin, a synthetic retinoid used for moderate-to-severe psoriasis, has been shown to enhance therapeutic efficacy when combined with other systemic treatments while allowing dose reduction and minimizing adverse effects [ 195 196 197 198 199 191 200 Methotrexate (MTX), a folate antagonist, is recommended for the systemic treatment of moderate-to-severe psoriasis and psoriatic arthritis because it interferes with purine and pyrimidine synthesis by inhibiting dihydrofolate reductase (DHFR), thereby exerting antiproliferative and immunomodulatory effects. Serious adverse effects include hepatotoxicity and immunosuppression [ 201 Cyclosporine, a calcineurin inhibitor, is indicated for moderate-to-severe psoriasis and PsA [ 189 202 203 204 205 5.3. Biologicals The ideal therapeutic approach should precisely target pathological immune responses while preserving protective immunity, though this goal requires further investigation to achieve. In cases where conventional systemic therapies demonstrate inadequate efficacy, significant adverse effects, or contraindications due to comorbidities, biologicals have emerged as the treatment of choice. Antibodies: Monoclonal antibody demonstrates significant efficacy in psoriasis treatment, and bispecific antibodies targeting dual or multiple signaling pathways exhibit synergistic therapeutic effects. Ustekinumab (anti-IL-12/23p40 antibody) [ 206 207 208 209 210 211 212 213 Small RNA-mediated gene silencing strategy: Small interfering RNAs (siRNAs) have demonstrated therapeutic potential for psoriasis in recent years. MiR-340 specifically binds to the 3′UTR in mice, targeting and suppressing IL-17A expression, thereby alleviating disease severity in imiquimod-induced psoriatic mouse models [ 214 215 216 217 218 CAR-T immunotherapy: CAR-T is an innovative therapeutic approach that combines molecular biology, virology, and immunology to genetically engineer T-cells with synthetic CARs, enabling MHC-independent target cell recognition and elimination for precision medicine. While achieving groundbreaking success in treatment of cancers, its precise targeting capability has expanded applications to autoimmune diseases [ 1 173 219 220 Treg-targeted strategy: Tregs are crucial for maintaining immune tolerance by suppressing effector T cell response, and restoring Treg number and function has become a novel therapeutic target in psoriasis treatment. Genetically engineered CAR-FoxP3 Tregs, administered intranasally, effectively suppressed inflammation, ameliorated disease symptoms, and conferred sustained protection against secondary experimental autoimmune encephalomyelitis (EAE) induction in a murine model of EAE [ 221 222 223 Hematopoietic stem cell transplantation (HSCT): HSCT employs myeloablative conditioning to eliminate pathogenic immune cells (including T and B lymphocytes) and reconstitute normal hematopoietic and immune systems. This therapy is primarily indicated for patients with treatment-refractory severe psoriasis, particularly those with comorbid autoimmune disorders or hematologic abnormalities. Case reports have documented complete remission of both immunoglobulin light-chain amyloidosis and psoriasis following autologous HSCT [ 224 225 Mesenchymal stromal cells (MSCs) are adult stromal cells possessing self-renewal capacity, multilineage differentiation potential, and immunomodulatory properties. Their low immunogenicity enables allogeneic transplantation. Clinical trials demonstrate that psoriatic patients receiving allogeneic umbilical cord-derived MSCs (UMSCs) transplantation exhibited favorable safety profiles with significant therapeutic effects observed in some cases [ 226 227 228 229 230 Exosomes are 30–150 nm vesicular particles capable of transporting proteins, nucleic acids (e.g., miRNA), and lipids, participating in immunomodulation and inflammatory responses. In psoriasis, MSC-derived exosomes restore immune balance by delivering molecules such as miR-146a to inhibit Th17 differentiation and promote Treg proliferation [ 231 232 233 233 234 Bispecific T-cell engagers (BiTEs) represent a therapeutic approach that redirects T-cell cytotoxicity against specific target cells by simultaneously engaging CD3 on T cells and disease-associated antigens. The CD19xCD3 BiTE blinatumomab mediates T-B cell conjugation to induce B-cell apoptosis, demonstrating clinical improvement in rheumatoid arthritis patients even at low doses [ 235 Gene therapy: Targeting genetically altered loci or their transcriptional products in psoriatic patients represents a promising therapeutic strategy. As discussed earlier, the modulation of specific gene transcripts using siRNA approaches will not be further elaborated. It was demonstrated that CRISPR/Cas9-mediated PD-L1 overexpression ameliorated psoriatic manifestations in murine models [ 236 237 238 Immunometabolism has emerged as a research focus in psoriasis, with metabolic reprogramming of immune cells, offering novel therapeutic opportunities. Inhibition of Vγ4 + 239 91 240 Emerging therapeutic strategies have demonstrated that engineered pyrrole-imidazole polyamides specifically bind to the binding site of c-Rel transcription factor within the IL-23p19 subunit promoter, selectively suppressing IL-23 expression and showing therapeutic efficacy in both imiquimod-induced psoriatic and experimental autoimmune uveitis murine models [ 241 242 243 244 244 245 246 Bacterial Extracts: The novel exopolysaccharide Ebosin, isolated from Streptomyces tnfaip3 247 248 5.4. Small-Molecule Inhibitors Significant progress in the treatment of psoriasis using small-molecule inhibitors has been made, which provides patients with more therapeutic options. RORγt is a key regulator that promotes Th17 cell differentiation and IL-17 production. Currently, RORγt is considered a novel target for psoriasis drug development. VTP-43742 showed efficacy in alleviating psoriasis symptoms in a Phase IIa clinical trial, though potential safety concerns may exist due to insufficient participant numbers [ 249 250 251 252 253 5.5. Alternative Therapy In traditional Chinese medicine (TCM), psoriasis is termed “Bai Bi” and is treated through a holistic syndrome differentiation approach, forming a multi-target, multi-pathway integrated intervention system with the therapeutic principle of combined internal and external treatments. Clinical patterns mainly include blood-heat syndrome, blood-stasis syndrome, blood-dryness syndrome, and dampness-heat syndrome, treated following principles like “clearing heat-cooling blood (qing re liang xue)”, “activating blood-resolving stasis (huo xue hua yu)”, “nourishing blood-moistening dryness (yang xue run zao)”, and “clearing heat-resolving dampness (qing re hua shi)” [ 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 Currently, no definitive biomarker exists for the diagnosis of psoriasis. Patients with moderate-to-severe forms of the disease may be assessed using general inflammatory markers. These include cytokines, C-reactive protein (CRP), and erythrocyte sedimentation rate (ESR) [ 269 Future treatment strategies for psoriasis should prioritize multidisciplinary cooperation. Comprehensive management involving enhanced patient education, lifestyle modification, and integration of artificial intelligence (AI) technologies spanning diagnostic assessment, therapeutic decision-making, treatment response prediction, risk surveillance, and patient communication/education can significantly improve clinical outcomes. This approach holds promise for advancing future psoriasis management toward timely, intelligent, and efficient paradigms. By managing psoriasis and its complications in an integrated manner, the overall health and quality of life of patients can be much improved. 6. Prospectives The pathogenesis and treatment of psoriasis still have many questions to be addressed, which require a step forward to analyze the pathogenesis of psoriasis, the interaction between genetic and environmental factors and mechanisms, and the excavation and translation of novel immunotherapeutic targets. For example, the use of multi-omics technology to elucidate how susceptibility genes (e.g., HLA-C* il23r Although therapeutic strategies for psoriasis have advanced significantly over the past few decades (currently available biologicals and drug targets are listed in Table 4 270 250 In the field of immunotherapy, it is imperative to overcome the limitations of existing drug targets, particularly the key molecular mediators in the pathogenesis of psoriasis, though these targets still require further in-depth investigation. Future research should be encouraged to explore novel intervention strategies targeting molecular pathways such as the RORγt/NFAT1 axis [ 135 249 271 272 In recent years, cell-based therapies have achieved groundbreaking advances in oncology, and their potential applications in autoimmune diseases are increasingly gaining attention. Notably, an unexpected case of psoriasis remission following CD19 CAR-T cell therapy mediated through B-cell depletion has unveiled a novel therapeutic avenue for this disease [ 173 219 Future research should focus on exploring immune tolerance induction as a novel treatment approach, particularly through antigen-specific immunotherapy targeting psoriasis-associated autoantigens such as K17 [ 60 171 51 273 247 215 218 ijms-26-09233-t004_Table 4 Table 4 Novel and Investigational Therapies for Psoriasis. Category Drug Name Target/Mechanism Approval Status Efficacy Profile Adverse Effects/Potential Risks Notes IL-17 monoclonal antibody Secukinumab [ 209 IL-17A neutralization; blocks IL-17A signaling Approved (US, EU, CN, etc.) Psoriasis Area and Severity Index (PASI) 90 response: 80–90%; rapid lesion clearance Injection-site reactions, candidiasis Requires infection monitoring Vunakizumab (China-developed) [ 274 Blocks IL-17A signaling Approved (China) Annual dosing: 14 injections; PASI 100 response: >70% Low infection risk Cost-effective domestic innovator Bimekizumab [ 210 Dual IL-17A/F inhibition Approved (EU, UK; US pending) Superior to IL-17A monotherapy (higher PASI 100 rates) Oral candidiasis, diarrhea Synergistic dual-target action IL-23 monoclonal antibody Guselkumab [ 275 IL-23p19 blockade Approved (US, EU, CN, etc.) Q8W dosing; PASI 90 response >80% Mild injection-site reactions, low Tuberculosis risk Sustained long-term remission Ustekinumab [ 206 Dual IL-12/23p40 blockade; inhibits Th1/Th17 pathways Approved (Global) Long-term disease control in moderate-to-severe plaque psoriasis Respiratory infections First dual-target biologic for IL-12 and IL-23 TNF-α monoclonal antibody Adalimumab [ 276 TNF-α blockade Approved (Global) PASI 75 response: 70–80% in moderate-to-severe cases Tuberculosis reactivation, potential malignancy risk Preferred for psoriatic arthritis comorbidity IL-36 monoclonal antibody Spesolimab [ 212 IL-36 blockade Approved (US, EU, CN) Rapid control of generalized pustular psoriasis (GPP) Infections, infusion reactions First-in-class IL-36 pathway inhibitor Small-Molecule Inhibitors Apremilast [ 250 DE4 inhibitor; reduces proinflammatory cytokines Approved in multiple countries Suitable for mild-to-moderate cases; oral administration Diarrhea, nausea, weight loss Superior safety profile compared to traditional immunosuppressants Tofacitinib [ 272 JAK1/3 inhibition; blocks JAK-STAT signaling Approved for PsA in multiple countries Oral administration; rapid relief of articular symptoms Infection risk, thromboembolic events Requires long-term safety monitoring VTP-43742/PF-06763809 [ 249 277 RORγt inhibition; reduces IL-17 production Clinical trials Novel Th17 pathway suppression with promising efficacy Good tolerability/safety pending First-in-class RORγt inhibitors Cell Therapies CD19 CAR-T [ 173 CD19-targeted B-cell depletion Case reports only Complete psoriasis remission sustained CRS, B-cell aplasia-related infections Unclear mechanism; target optimization needed CAR-Tregs [ 221 Engineered Tregs for enhanced immune suppression Preclinical studies Effective in experimental autoimmune models (exploratory for psoriasis) Technical complexity, graft rejection risks Potential tolerance-restoring approach Umbilical/Adipose MSCs [ 227 228 229 Immunomodulation (paracrine effects) Clinical trials Good safety profile, preliminary evidence of sustained improvement in some patients Transient fever, infusion-related reactions Requires stringent quality control TCM Therapy Compound Indigo Capsule [ 278 Multi-target modulation Approved (China) Significant improvement in erythema and infiltration Diarrhea, abdominal pain Contraindicated in pregnancy miRNA miR-340 siRNA [ 214 Downregulates IL-17A expression via RNA interference Preclinical studies Attenuates inflammation in murine models Low delivery efficiency, poor stability Requires nanocarrier optimization Immunometabolic Modulator GLS1 Inhibitor [ 240 Glutamine metabolism blockade (Th17 differentiation) Preclinical studies Markedly improves imiquimod (IMQ)-induced psoriasiform dermatitis in mice Unknown Targets metabolic reprogramming, avoids direct immunosuppression Epigenetic Modulator KAT8 Inhibitor [ 238 Reduces H4K16ac (suppresses CXCL2/CCL3) Preclinical studies Ameliorates IMQ-induced murine model symptoms Unknown N/A Other Investigative Drugs CYnLIP (Nanocarrier) [ 218 Co-delivers IL-36α siRNA + erlotinib Preclinical studies Significantly reduces murine PASI scores Human safety unverified Combines gene therapy + chemical drug Ebosin ( Streptomyces 247 Inhibits Th17 differentiation; modulates miR-155-TNFAIP3-IL-17 axis Preclinical studies Attenuates inflammation in murine models Unclear toxicity profile Natural product with multi-pathway modulation Antibody-Nanoparticle Conjugate [ 104 Neutrophil-specific delivery of anti-inflammatory payload Preclinical studies Reduces systemic toxicity; site-specific action Preclinical safety pending Precision delivery technology prototype Due to space limitation, not all investigational psoriasis therapies are shown. Immunometabolic studies have revealed the pivotal role of metabolic reprogramming (e.g., OXPHOS, glutaminolysis) in psoriasis pathogenesis. Targeting these pathways (e.g., via GLS1 inhibitors) may represent a promising therapeutic strategy. Epigenetic regulation (e.g., KAT8 inhibition) offers precise intervention targets by modulating inflammatory gene expression, though its tissue specificity and safety profile require further investigation. TCM demonstrates unique advantages in psoriasis treatment through multi-target regulation (e.g., IL-17 inhibition, Th17/Treg balance modulation), particularly for mild-to-moderate cases or in synergistic combination with Western medicine. However, the lack of high-quality evidence-based medical data and standardized protocols remains a bottleneck for its global adoption. Future development requires integration with modern technologies to advance precision medicine in integrative TCM-Western approaches. In summary, the therapeutic landscape for psoriasis holds immense promise, with future research continuing to explore precise, safe, and effective treatment strategies. Interdisciplinary collaboration and technological innovation will facilitate the translation of the research results from bench to clinical applications, ultimately advancing psoriasis therapy toward individualized, precision-based and integrated approaches. While significant challenges remain, the continuous scientific and technological advancements will ultimately render the cure for psoriasis an achievable reality. Acknowledgments We thank Henan University for financial support. We thank all the researchers whose work contributed to this review. Disclaimer/Publisher’s Note: Author Contributions Writing—original draft preparation and revising, L.W.; figure and table preparation and proofread, R.L., Y.T., Y.M. and G.W.; conceived and designed, S.J.Z.; revising and editing, and funding acquisition, S.J.Z. and Q.R. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement All data in this paper were acquired from reference literatures ( https://pubmed.ncbi.nlm.nih.gov/ https://www.cnki.net/ Conflicts of Interest The authors declare no conflicts of interest. The funding sponsors had no role in the design of the study; in the collection, analyses, or interpretation of data; in the writing of the manuscript, and in the decision to publish the results. References 1. Song Y. Li J. Wu Y. Evolving understanding of autoimmune mechanisms and new therapeutic strategies of autoimmune disorders Signal Transduct. Target. Ther. 2024 9 263 10.1038/s41392-024-01952-8 39362875 PMC11452214 2. Vos T. Lim S.S. Abbafati C. Abbas K.M. Abbasi M. Abbasifard M. Abbasi-Kangevari M. Abbastabar H. Abd-Allah F. Abdelalim A. Global burden of 369 diseases and injuries in 204 countries and territories, 1990–2019: A systematic analysis for the Global Burden of Disease Study 2019 Lancet 2020 396 1204 1222 10.1016/S0140-6736(20)30925-9 33069326 PMC7567026 3. Ritchlin C.T. Colbert R.A. Gladman D.D. Psoriatic Arthritis N. Engl. J. Med. 2017 376 957 970 Erratum in N. Engl. J. Med. 2017 376 10.1056/NEJMra1505557 28273019 4. Gelfand J.M. Yeung H. Metabolic syndrome in patients with psoriatic disease J. Rheumatol. Suppl. 2012 89 24 28 10.3899/jrheum.120237 22751586 PMC3670770 5. Robati R.M. Partovi-Kia M. Haghighatkhah H.R. Younespour S. Abdollahimajd F. Increased serum leptin and resistin levels and increased carotid intima-media wall thickness in patients with psoriasis: Is psoriasis associated with atherosclerosis? J. Am. Acad. Dermatol. 2014 71 642 648 10.1016/j.jaad.2014.06.006 25043845 6. Sampogna F. Tabolli S. Abeni D. Living with psoriasis: Prevalence of shame, anger, worry, and problems in daily activities and social life Acta Derm. Venereol. 2012 92 299 303 10.2340/00015555-1273 22678565 7. Di Cesare A. Di Meglio P. Nestle F.O. The IL-23/Th17 axis in the immunopathogenesis of psoriasis J. Investig. Dermatol. 2009 129 1339 1350 10.1038/jid.2009.59 19322214 8. Ghoreschi K. Balato A. Enerbäck C. Sabat R. Therapeutics targeting the IL-23 and IL-17 pathway in psoriasis Lancet 2021 397 754 766 10.1016/S0140-6736(21)00184-7 33515492 9. van der Fits L. Mourits S. Voerman J.S. Kant M. Boon L. Laman J.D. Cornelissen F. Mus A.M. Florencia E. Prens E.P. Imiquimod-induced psoriasis-like skin inflammation in mice is mediated via the IL-23/IL-17 axis J. Immunol. 2009 182 5836 5845 10.4049/jimmunol.0802999 19380832 10. Dand N. Stuart P.E. Bowes J. Ellinghaus D. Nititham J. Saklatvala J.R. Teder-Laving M. Thomas L.F. Traks T. Uebe S. GWAS meta-analysis of psoriasis identifies new susceptibility alleles impacting disease mechanisms and therapeutic targets Nat. Commun. 2025 16 2051 10.1038/s41467-025-56719-8 40021644 PMC11871359 11. Mallon E. Bunce M. Savoie H. Rowe A. Newson R. Gotch F. Bunker C.B. HLA-C and guttate psoriasis Br. J. Dermatol. 2000 143 1177 1182 10.1046/j.1365-2133.2000.03885.x 11122018 12. Griffiths C.E.M. Armstrong A.W. Gudjonsson J.E. Barker J. Psoriasis Lancet 2021 397 1301 1315 10.1016/S0140-6736(20)32549-6 33812489 13. Langley R.G. Elewski B.E. Lebwohl M. Reich K. Griffiths C.E. Papp K. Puig L. Nakagawa H. Spelman L. Sigurgeirsson B. Secukinumab in plaque psoriasis--results of two phase 3 trials N. Engl. J. Med. 2014 371 326 338 10.1056/NEJMoa1314258 25007392 14. Reich K. Armstrong A.W. Langley R.G. Flavin S. Randazzo B. Li S. Hsu M.C. Branigan P. Blauvelt A. Guselkumab versus secukinumab for the treatment of moderate-to-severe psoriasis (ECLIPSE): Results from a phase 3, randomised controlled trial Lancet 2019 394 831 839 10.1016/S0140-6736(19)31773-8 31402114 15. Murray C.J. Vos T. Lozano R. Naghavi M. Flaxman A.D. Michaud C. Ezzati M. Shibuya K. Salomon J.A. Abdalla S. Disability-adjusted life years (DALYs) for 291 diseases and injuries in 21 regions, 1990–2010: A systematic analysis for the Global Burden of Disease Study 2010 Lancet 2012 380 2197 2223 10.1016/S0140-6736(12)61689-4 23245608 16. Danielsen K. Olsen A.O. Wilsgaard T. Furberg A.S. Is the prevalence of psoriasis increasing? A 30-year follow-up of a population-based cohort Br. J. Dermatol. 2013 168 1303 1310 10.1111/bjd.12230 23374051 17. Gibbs S. Skin disease and socioeconomic conditions in rural Africa: Tanzania Int. J. Dermatol. 1996 35 633 639 10.1111/j.1365-4362.1996.tb03687.x 8876289 18. Luo H. Global burden and cross-country inequalities in six major immune-mediated inflammatory diseases from 1990 to 2021: A systemic analysis of the Global Burden of Disease Study 2021 Autoimmun. Rev. 2024 23 103639 10.1016/j.autrev.2024.103639 39260756 19. Wang K. Zhao Y. Cao X. Global burden and future trends in psoriasis epidemiology: Insights from the global burden of disease study 2019 and predictions to 2030 Arch. Dermatol. Res. 2024 316 114 10.1007/s00403-024-02846-z 38530431 20. Wang C. Dai S. Zhang S. Zheng Z. Zhou Z. Chen Z. Wang M. Gao Y. Xin Y. Xiong W. Gut microbe-derived metabolites drive psoriatic inflammation via modulation of skin Th17 cells Immunity 2025 58 2241 2255.e7 10.1016/j.immuni.2025.08.006 40930076 21. Wu J. Chen H. Yang R. Yu H. Shang S. Hu Y. Short-term exposure to ambient fine particulate matter and psoriasis: A time-series analysis in Beijing, China Front. Public Health 2022 10 1015197 10.3389/fpubh.2022.1015197 36311636 PMC9597881 22. Wu J. Ma Y. Yang J. Tian Y. Exposure to Air Pollution, Genetic Susceptibility, and Psoriasis Risk in the UK JAMA Netw. Open 2024 7 e2421665 10.1001/jamanetworkopen.2024.21665 39012635 PMC11252902 23. Boehncke W.H. Schön M.P. Psoriasis Lancet 2015 386 983 994 10.1016/S0140-6736(14)61909-7 26025581 24. Fu Y. Lee C.H. Chi C.C. Association of Psoriasis with Inflammatory Bowel Disease: A Systematic Review and Meta-analysis JAMA Dermatol. 2018 154 1417 1423 10.1001/jamadermatol.2018.3631 30422277 PMC6583370 25. Ruan Z. Lu T. Chen Y. Yuan M. Yu H. Liu R. Xie X. Association Between Psoriasis and Nonalcoholic Fatty Liver Disease Among Outpatient US Adults JAMA Dermatol. 2022 158 745 753 10.1001/jamadermatol.2022.1609 35612851 PMC9134040 26. Ramessur R. Saklatvala J. Budu-Aggrey A. Ostaszewski M. Möbus L. Greco D. Ndlovu M. Mahil S.K. Barker J.N. Brown S. Exploring the Link Between Genetic Predictors of Cardiovascular Disease and Psoriasis JAMA Cardiol. 2024 9 1009 1017 10.1001/jamacardio.2024.2859 39292496 PMC11411451 27. Takeshita J. Grewal S. Langan S.M. Mehta N.N. Ogdie A. Van Voorhees A.S. Gelfand J.M. Psoriasis and comorbid diseases: Epidemiology J. Am. Acad. Dermatol. 2017 76 377 390 10.1016/j.jaad.2016.07.064 28212759 PMC5731650 28. Branisteanu D.E. Pirvulescu R.A. Spinu A.E. Porumb E.A. Cojocaru M. Nicolescu A.C. Branisteanu D.C. Branisteanu C.I. Dimitriu A. Alexa A.I. Metabolic comorbidities of psoriasis (Review) Exp. Ther. Med. 2022 23 179 10.3892/etm.2021.11102 35069860 PMC8764894 29. Pouplard C. Brenaut E. Horreau C. Barnetche T. Misery L. Richard M.A. Aractingi S. Aubin F. Cribier B. Joly P. Risk of cancer in psoriasis: A systematic review and meta-analysis of epidemiological studies J. Eur. Acad. Dermatol. Venereol. 2013 27 (Suppl. 3) 36 46 10.1111/jdv.12165 23845151 30. Ryan C. Sadlier M. De Vol E. Patel M. Lloyd A.A. Day A. Lally A. Kirby B. Menter A. Genital psoriasis is associated with significant impairment in quality of life and sexual functioning J. Am. Acad. Dermatol. 2015 72 978 983 10.1016/j.jaad.2015.02.1127 25824273 31. Singh S. Taylor C. Kornmehl H. Armstrong A.W. Psoriasis and suicidality: A systematic review and meta-analysis J. Am. Acad. Dermatol. 2017 77 425 440.e2 10.1016/j.jaad.2017.05.019 28807109 32. Rompoti N. Tsiori S. Kontoangelos K. Kouzoupis A. Papageorgiou C. Gregoriou S. Stratigos A. Rigopoulos D. Psychopathological Profile of Patients with Moderate-to-Severe Plaque Psoriasis and Its Correlation to DLQI: Results from a Prospective, Monocentric Clinical Study J. Clin. Med. 2024 13 6424 10.3390/jcm13216424 39518563 PMC11546461 33. Rendon A. Schäkel K. Psoriasis Pathogenesis and Treatment Int. J. Mol. Sci. 2019 20 1475 10.3390/ijms20061475 30909615 PMC6471628 34. Griffiths C.E. Barker J.N. Pathogenesis and clinical features of psoriasis Lancet 2007 370 263 271 10.1016/S0140-6736(07)61128-3 17658397 35. Mehta S. Singal A. Singh N. Bhattacharya S.N. A study of clinicohistopathological correlation in patients of psoriasis and psoriasiform dermatitis Indian J. Dermatol. Venereol. Leprol. 2009 75 100 10.4103/0378-6323.45241 19177702 36. Dupire G. Droitcourt C. Hughes C. Le Cleach L. Antistreptococcal interventions for guttate and chronic plaque psoriasis Cochrane Database Syst. Rev. 2019 3 Cd011571 10.1002/14651858.CD011571.pub2 30835819 PMC6400423 37. Martin B.A. Chalmers R.J. Telfer N.R. How great is the risk of further psoriasis following a single episode of acute guttate psoriasis? Arch. Dermatol. 1996 132 717 718 10.1001/archderm.1996.03890300147032 8651734 38. Rosenbach M. Hsu S. Korman N.J. Lebwohl M.G. Young M. Bebo B.F. Jr. Van Voorhees A.S. Treatment of erythrodermic psoriasis: From the medical board of the National Psoriasis Foundation J. Am. Acad. Dermatol. 2010 62 655 662 10.1016/j.jaad.2009.05.048 19665821 39. Singh R.K. Lee K.M. Ucmak D. Brodsky M. Atanelov Z. Farahnik B. Abrouk M. Nakamura M. Zhu T.H. Liao W. Erythrodermic psoriasis: Pathophysiology and current treatment perspectives Psoriasis 2016 6 93 104 10.2147/ptt.s101232 28856115 PMC5572467 40. Augustin M. Reich K. Blome C. Schäfer I. Laass A. Radtke M.A. Nail psoriasis in Germany: Epidemiology and burden of disease Br. J. Dermatol. 2010 163 580 585 10.1111/j.1365-2133.2010.09831.x 20456340 41. Alosaimi M.A. Alrubaiaan M.T. Alsuhaymi A.M. Alsulaiman S.A. Alanazy A.M. Al Eissa A.I. Alosaimi S.M. Owaidh Alilaj M. Association of Psoriasis with Thyroid Disorders: A Tertiary Center-Based Cross-Sectional Study Cureus 2025 17 e79706 10.7759/cureus.79706 40161193 PMC11952676 42. Alinaghi F. Calov M. Kristensen L.E. Gladman D.D. Coates L.C. Jullien D. Gottlieb A.B. Gisondi P. Wu J.J. Thyssen J.P. Prevalence of psoriatic arthritis in patients with psoriasis: A systematic review and meta-analysis of observational and clinical studies J. Am. Acad. Dermatol. 2019 80 251 265.e19 10.1016/j.jaad.2018.06.027 29928910 43. Bartosińska J. Szepietowski J.C. Raczkiewicz D. Griffiths C.E.M. Ashcroft D.M. Wright A.K. Podwójcic K. Turcza J. Maluchnik M. Chłoń-Domińczak A. Epidemiology of Psoriasis in Poland: Prevalence, Incidence, and Mortality Rates Int. J. Dermatol. 2025 64 1599 1606 10.1111/ijd.17848 40390157 PMC12332235 44. Park J.H. Park Y.J. Kim S.K. Kwon J.E. Kang H.Y. Lee E.S. Choi J.H. Kim Y.C. Histopathological Differential Diagnosis of Psoriasis and Seborrheic Dermatitis of the Scalp Ann. Dermatol. 2016 28 427 432 10.5021/ad.2016.28.4.427 27489423 PMC4969470 45. Tsoi L.C. Stuart P.E. Tian C. Gudjonsson J.E. Das S. Zawistowski M. Ellinghaus E. Barker J.N. Chandran V. Dand N. Large scale meta-analysis characterizes genetic architecture for common psoriasis associated variants Nat. Commun. 2017 8 15382 10.1038/ncomms15382 28537254 PMC5458077 46. Tang H. Jin X. Li Y. Jiang H. Tang X. Yang X. Cheng H. Qiu Y. Chen G. Mei J. A large-scale screen for coding variants predisposing to psoriasis Nat. Genet. 2014 46 45 50 10.1038/ng.2827 24212883 47. Sun L.D. Cheng H. Wang Z.X. Zhang A.P. Wang P.G. Xu J.H. Zhu Q.X. Zhou H.S. Ellinghaus E. Zhang F.R. Association analyses identify six new psoriasis susceptibility loci in the Chinese population Nat. Genet. 2010 42 1005 1009 10.1038/ng.690 20953187 PMC3140436 48. Lønnberg A.S. Skov L. Skytthe A. Kyvik K.O. Pedersen O.B. Thomsen S.F. Heritability of psoriasis in a large twin sample Br. J. Dermatol. 2013 169 412 416 10.1111/bjd.12375 23574549 49. Antonatos C. Grafanaki K. Asmenoudi P. Xiropotamos P. Nani P. Georgakilas G.K. Georgiou S. Vasilopoulos Y. Contribution of the Environment, Epigenetic Mechanisms and Non-Coding RNAs in Psoriasis Biomedicines 2022 10 1934 10.3390/biomedicines10081934 36009480 PMC9405550 50. Della Bella C. Corrà A. Mantengoli E. Galano A. Benagiano M. Bonciani D. Mariotti E.B. Pratesi S. Quintarelli L. Aimo C. Skin IL-17A and IFN-γ Production Correlate with Disease Severity in Patients with Psoriasis and Streptococcal Infection J. Investig. Dermatol. 2023 143 925 932 10.1016/j.jid.2022.10.025 36642401 51. Arakawa A. Siewert K. Stöhr J. Besgen P. Kim S.M. Rühl G. Nickel J. Vollmer S. Thomas P. Krebs S. Melanocyte antigen triggers autoimmunity in human psoriasis J. Exp. Med. 2015 212 2203 2212 10.1084/jem.20151093 26621454 PMC4689169 52. Arakawa A. Reeves E. Vollmer S. Arakawa Y. He M. Galinski A. Stöhr J. Dornmair K. James E. Prinz J.C. ERAP1 Controls the Autoimmune Response against Melanocytes in Psoriasis by Generating the Melanocyte Autoantigen and Regulating Its Amount for HLA-C*06:02 Presentation J. Immunol. 2021 207 2235 2244 10.4049/jimmunol.2100686 34580106 PMC7611875 53. Shen Z. Wang G. Fan J.Y. Li W. Liu Y.F. HLA DR B1*04, *07-restricted epitopes on Keratin 17 for autoreactive T cells in psoriasis J. Dermatol. Sci. 2005 38 25 39 10.1016/j.jdermsci.2005.01.001 15795121 54. Cargill M. Schrodi S.J. Chang M. Garcia V.E. Brandon R. Callis K.P. Matsunami N. Ardlie K.G. Civello D. Catanese J.J. A large-scale genetic association study confirms IL12B and leads to the identification of IL23R as psoriasis-risk genes Am. J. Hum. Genet. 2007 80 273 290 10.1086/511051 17236132 PMC1785338 55. Zhu H. Lou F. Yin Q. Gao Y. Sun Y. Bai J. Xu Z. Liu Z. Cai W. Ke F. RIG-I antiviral signaling drives interleukin-23 production and psoriasis-like skin disease EMBO Mol. Med. 2017 9 589 604 10.15252/emmm.201607027 28377495 PMC5412807 56. Hayashi M. Hirota T. Saeki H. Nakagawa H. Ishiuji Y. Matsuzaki H. Tsunemi Y. Kato T. Shibata S. Sugaya M. Genetic polymorphism in the traf3ip2 J. Dermatol. Sci. 2014 73 264 265 10.1016/j.jdermsci.2013.11.012 24373565 57. Harden J.L. Krueger J.G. Bowcock A.M. The immunogenetics of Psoriasis: A comprehensive review J. Autoimmun. 2015 64 66 73 10.1016/j.jaut.2015.07.008 26215033 PMC4628849 58. Teng Y. Xie W. Tao X. Liu N. Yu Y. Huang Y. Xu D. Fan Y. Infection-provoked psoriasis: Induced or aggravated (Review) Exp. Ther. Med. 2021 21 567 10.3892/etm.2021.9999 33850539 PMC8027725 59. Assarsson M. Söderman J. Seifert O. Significant Correlation Between Cutaneous Abundance of Streptococcus Acta Derm. Venereol. 2024 104 adv34892 10.2340/actadv.v104.34892 38898675 PMC11210493 60. Gudmundsdottir A.S. Sigmundsdottir H. Sigurgeirsson B. Good M.F. Valdimarsson H. Jonsdottir I. Is an epitope on keratin 17 a major target for autoreactive T lymphocytes in psoriasis? Clin. Exp. Immunol. 1999 117 580 586 10.1046/j.1365-2249.1999.01013.x 10469066 PMC1905362 61. Johnston A. Gudjonsson J.E. Sigmundsdottir H. Love T.J. Valdimarsson H. Peripheral blood T cell responses to keratin peptides that share sequences with streptococcal M proteins are largely restricted to skin-homing CD8(+) T cells Clin. Exp. Immunol. 2004 138 83 93 10.1111/j.1365-2249.2004.00600.x 15373909 PMC1809187 62. Yen Y.F. Chuang P.H. Jen I.A. Chen M. Lan Y.C. Liu Y.L. Lee Y. Chen Y.H. Chen Y.A. Incidence of autoimmune diseases in a nationwide HIV/AIDS patient cohort in Taiwan, 2000–2012 Ann. Rheum. Dis. 2017 76 661 665 10.1136/annrheumdis-2016-209815 27590658 63. Morar N. Willis-Owen S.A. Maurer T. Bunker C.B. HIV-associated psoriasis: Pathogenesis, clinical features, and management Lancet Infect. Dis. 2010 10 470 478 10.1016/S1473-3099(10)70101-8 20610329 64. Fuchs D. Hausen A. Reibnegger G. Werner E.R. Dierich M.P. Wachter H. Psoriasis, gamma-interferon, and the acquired immunodeficiency syndrome Ann. Intern. Med. 1987 106 165 10.7326/0003-4819-106-1-165_2 3098150 65. Liu S. He M. Jiang J. Duan X. Chai B. Zhang J. Tao Q. Chen H. Triggers for the onset and recurrence of psoriasis: A review and update Cell Commun. Signal. 2024 22 108 10.1186/s12964-023-01381-0 38347543 PMC10860266 66. Aram K. Patil A. Goldust M. Rajabi F. COVID-19 and exacerbation of dermatological diseases: A review of the available literature Dermatol. Ther. 2021 34 e15113 10.1111/dth.15113 34453380 PMC8646294 67. Chen M.L. Kao W.M. Huang J.Y. Hung Y.M. Wei J.C. Human papillomavirus infection associated with increased risk of new-onset psoriasis: A nationwide population-based cohort study Int. J. Epidemiol. 2020 49 786 797 10.1093/ije/dyaa027 32176290 68. Rousset L. Halioua B. Stress and psoriasis Int. J. Dermatol. 2018 57 1165 1172 10.1111/ijd.14032 29729012 69. Woźniak E. Owczarczyk-Saczonek A. Placek W. Psychological Stress, Mast Cells, and Psoriasis-Is There Any Relationship? Int. J. Mol. Sci. 2021 22 13252 10.3390/ijms222413252 34948049 PMC8705845 70. Kanda N. Watanabe S. Regulatory roles of sex hormones in cutaneous biology and immunology J. Dermatol. Sci. 2005 38 1 7 10.1016/j.jdermsci.2004.10.011 15795118 71. Adachi A. Honda T. Regulatory Roles of Estrogens in Psoriasis J. Clin. Med. 2022 11 4890 10.3390/jcm11164890 36013129 PMC9409683 72. Cemil B.C. Cengiz F.P. Atas H. Ozturk G. Canpolat F. Sex hormones in male psoriasis patients and their correlation with the Psoriasis Area and Severity Index J. Dermatol. 2015 42 500 503 10.1111/1346-8138.12803 25728622 73. Kobayashi K. Chikazawa S. Chen Y. Suzuki S. Ichimasu N. Katagiri K. Oestrogen inhibits psoriasis-like dermatitis induced by imiquimod in mice in relation to increased IL-10 producing cells despite elevated expression of IL-22, IL-23, IL-17 mRNA Exp. Dermatol. 2023 32 203 209 10.1111/exd.14688 36226700 74. Terán-Pérez G. Arana-Lechuga Y. Esqueda-León E. Santana-Miranda R. Rojas-Zamorano J. Velázquez Moctezuma J. Steroid hormones and sleep regulation Mini Rev. Med. Chem. 2012 12 1040 1048 10.2174/138955712802762167 23092405 75. Paus R. Theoharides T.C. Arck P.C. Neuroimmunoendocrine circuitry of the ‘brain-skin connection’ Trends Immunol. 2006 27 32 39 10.1016/j.it.2005.10.002 16269267 76. Wei J. Zhu J. Xu H. Zhou D. Elder J.T. Tsoi L.C. Patrick M.T. Li Y. Alcohol consumption and smoking in relation to psoriasis: A Mendelian randomization study Br. J. Dermatol. 2022 187 684 691 10.1111/bjd.21718 35764530 77. Brenaut E. Horreau C. Pouplard C. Barnetche T. Paul C. Richard M.A. Joly P. Le Maître M. Aractingi S. Aubin F. Alcohol consumption and psoriasis: A systematic literature review J. Eur. Acad. Dermatol. Venereol. 2013 27 (Suppl. 3) 30 35 10.1111/jdv.12164 23845150 78. Murzaku E.C. Bronsnick T. Rao B.K. Diet in dermatology: Part II. Melanoma, chronic urticaria, and psoriasis J. Am. Acad. Dermatol. 2014 71 1053.e1 1053.e16 10.1016/j.jaad.2014.06.016 25454037 79. Dai Y.X. Wang S.C. Chou Y.J. Chang Y.T. Chen T.J. Li C.P. Wu C.Y. Smoking, but not alcohol, is associated with risk of psoriasis in a Taiwanese population-based cohort study J. Am. Acad. Dermatol. 2019 80 727 734 10.1016/j.jaad.2018.11.015 30528570 80. Nestle F.O. Di Meglio P. Qin J.Z. Nickoloff B.J. Skin immune sentinels in health and disease Nat. Rev. Immunol. 2009 9 679 691 10.1038/nri2622 19763149 PMC2947825 81. Perera G.K. Di Meglio P. Nestle F.O. Psoriasis Annu. Rev. Pathol. 2012 7 385 422 10.1146/annurev-pathol-011811-132448 22054142 82. Zhang L.J. Sen G.L. Ward N.L. Johnston A. Chun K. Chen Y. Adase C. Sanford J.A. Gao N. Chensee M. Antimicrobial Peptide LL37 and MAVS Signaling Drive Interferon-β Production by Epidermal Keratinocytes during Skin Injury Immunity 2016 45 119 130 10.1016/j.immuni.2016.06.021 27438769 PMC4957248 83. Zhou X. Chen Y. Cui L. Shi Y. Guo C. Advances in the pathogenesis of psoriasis: From keratinocyte perspective Cell Death Dis. 2022 13 81 10.1038/s41419-022-04523-3 35075118 PMC8786887 84. Albanesi C. Madonna S. Gisondi P. Girolomoni G. The Interplay Between Keratinocytes and Immune Cells in the Pathogenesis of Psoriasis Front. Immunol. 2018 9 1549 10.3389/fimmu.2018.01549 30034395 PMC6043636 85. Yan S. Xu Z. Lou F. Zhang L. Ke F. Bai J. Liu Z. Liu J. Wang H. Zhu H. NF-κB-induced microRNA-31 promotes epidermal hyperplasia by repressing protein phosphatase 6 in psoriasis Nat. Commun. 2015 6 7652 10.1038/ncomms8652 26138368 PMC4506511 86. Silva de Melo B.M. Veras F.P. Zwicky P. Lima D. Ingelfinger F. Martins T.V. da Silva Prado D. Schärli S. Publio G. Hiroki C.H. S100A9 Drives the Chronification of Psoriasiform Inflammation by Inducing IL-23/Type 3 Immunity J. Investig. Dermatol. 2023 143 1678 1688.e8 10.1016/j.jid.2023.02.026 36921684 87. Homey B. Dieu-Nosjean M.C. Wiesenborn A. Massacrier C. Pin J.J. Oldham E. Catron D. Buchanan M.E. Müller A. deWaal Malefyt R. Up-regulation of macrophage inflammatory protein-3 alpha/CCL20 and CC chemokine receptor 6 in psoriasis J. Immunol. 2000 164 6621 6632 10.4049/jimmunol.164.12.6621 10843722 88. Müller A. Hennig A. Lorscheid S. Grondona P. Schulze-Osthoff K. Hailfinger S. Kramer D. IκBζ is a key transcriptional regulator of IL-36-driven psoriasis-related gene expression in keratinocytes Proc. Natl. Acad. Sci. USA 2018 115 10088 10093 10.1073/pnas.1801377115 30224457 PMC6176600 89. Ekman A.K. Bivik Eding C. Rundquist I. Enerbäck C. IL-17 and IL-22 Promote Keratinocyte Stemness in the Germinative Compartment in Psoriasis J. Investig. Dermatol. 2019 139 1564 1573.e8 10.1016/j.jid.2019.01.014 30684548 90. Lowes M.A. Suárez-Fariñas M. Krueger J.G. Immunology of psoriasis Annu. Rev. Immunol. 2014 32 227 255 10.1146/annurev-immunol-032713-120225 24655295 PMC4229247 91. Lou F. Sun Y. Xu Z. Niu L. Wang Z. Deng S. Liu Z. Zhou H. Bai J. Yin Q. Excessive Polyamine Generation in Keratinocytes Promotes Self-RNA Sensing by Dendritic Cells in Psoriasis Immunity 2020 53 204 216.e10 10.1016/j.immuni.2020.06.004 32553276 92. Rodriguez-Rosales Y.A. Langereis J.D. Gorris M.A.J. van den Reek J. Fasse E. Netea M.G. de Vries I.J.M. Gomez-Muñoz L. van Cranenbroek B. Körber A. Immunomodulatory aged neutrophils are augmented in blood and skin of psoriasis patients J. Allergy Clin. Immunol. 2021 148 1030 1040 10.1016/j.jaci.2021.02.041 33745888 93. Katayama H. Development of psoriasis by continuous neutrophil infiltration into the epidermis Exp. Dermatol. 2018 27 1084 1091 10.1111/exd.13746 30019426 94. Pruenster M. Immler R. Roth J. Kuchler T. Bromberger T. Napoli M. Nussbaumer K. Rohwedder I. Wackerbarth L.M. Piantoni C. E-selectin-mediated rapid NLRP3 inflammasome activation regulates S100A8/S100A9 release from neutrophils via transient gasdermin D pore formation Nat. Immunol. 2023 24 2021 2031 10.1038/s41590-023-01656-1 37903858 PMC10681899 95. Senra L. Mylonas A. Kavanagh R.D. Fallon P.G. Conrad C. Borowczyk-Michalowska J. Wrobel L.J. Kaya G. Yawalkar N. Boehncke W.H. IL-17E (IL-25) Enhances Innate Immune Responses during Skin Inflammation J. Investig. Dermatol. 2019 139 1732 1742.e17 10.1016/j.jid.2019.01.021 30738055 96. Lin A.M. Rubin C.J. Khandpur R. Wang J.Y. Riblett M. Yalavarthi S. Villanueva E.C. Shah P. Kaplan M.J. Bruce A.T. Mast cells and neutrophils release IL-17 through extracellular trap formation in psoriasis J. Immunol. 2011 187 490 500 10.4049/jimmunol.1100123 21606249 PMC3119764 97. Herster F. Bittner Z. Archer N.K. Dickhöfer S. Eisel D. Eigenbrod T. Knorpp T. Schneiderhan-Marra N. Löffler M.W. Kalbacher H. Neutrophil extracellular trap-associated RNA and LL37 enable self-amplifying inflammation in psoriasis Nat. Commun. 2020 11 105 10.1038/s41467-019-13756-4 31913271 PMC6949246 98. Shao S. Fang H. Dang E. Xue K. Zhang J. Li B. Qiao H. Cao T. Zhuang Y. Shen S. Neutrophil Extracellular Traps Promote Inflammatory Responses in Psoriasis via Activating Epidermal TLR4/IL-36R Crosstalk Front. Immunol. 2019 10 746 10.3389/fimmu.2019.00746 31024570 PMC6460719 99. Ma F. Plazyo O. Billi A.C. Tsoi L.C. Xing X. Wasikowski R. Gharaee-Kermani M. Hile G. Jiang Y. Harms P.W. Single cell and spatial sequencing define processes by which keratinocytes and fibroblasts amplify inflammatory responses in psoriasis Nat. Commun. 2023 14 3455 10.1038/s41467-023-39020-4 37308489 PMC10261041 100. Hu S.C. Yu H.S. Yen F.L. Lin C.L. Chen G.S. Lan C.C. Neutrophil extracellular trap formation is increased in psoriasis and induces human β-defensin-2 production in epidermal keratinocytes Sci. Rep. 2016 6 31119 10.1038/srep31119 27493143 PMC4974609 101. Shao S. Fang H. Zhang J. Jiang M. Xue K. Ma J. Zhang J. Lei J. Zhang Y. Li B. Neutrophil exosomes enhance the skin autoinflammation in generalized pustular psoriasis via activating keratinocytes FASEB J. 2019 33 6813 6828 10.1096/fj.201802090RR 30811955 102. Liu X.T. Shi Z.R. Lu S.Y. Hong D. Qiu X.N. Tan G.Z. Xiong H. Guo Q. Wang L. Enhanced Migratory Ability of Neutrophils Toward Epidermis Contributes to the Development of Psoriasis via Crosstalk with Keratinocytes by Releasing IL-17A Front. Immunol. 2022 13 817040 10.3389/fimmu.2022.817040 35401573 PMC8983831 103. Chen J. Zhu Z. Li Q. Lin Y. Dang E. Meng H. Sha N. Bai H. Wang G. An S. Neutrophils Enhance Cutaneous Vascular Dilation and Permeability to Aggravate Psoriasis by Releasing Matrix Metallopeptidase 9 J. Investig. Dermatol. 2021 141 787 799 10.1016/j.jid.2020.07.028 32888954 104. Lin C.Y. Yu H.P. Chang Y.T. Lin Z.C. Alalaiwe A. Hwang T.L. Fang J.Y. Targeting anti-inflammatory immunonanocarriers to human and murine neutrophils via the Ly6 antigen for psoriasiform dermatitis alleviation Biomater. Sci. 2023 11 873 893 10.1039/D2BM01521H 36515218 105. Lowes M.A. Chamian F. Abello M.V. Fuentes-Duculan J. Lin S.L. Nussbaum R. Novitskaya I. Carbonaro H. Cardinale I. Kikuchi T. Increase in TNF-alpha and inducible nitric oxide synthase-expressing dendritic cells in psoriasis and reduction with efalizumab (anti-CD11a) Proc. Natl. Acad. Sci. USA 2005 102 19057 19062 10.1073/pnas.0509736102 16380428 PMC1323218 106. Terhorst D. Chelbi R. Wohn C. Malosse C. Tamoutounour S. Jorquera A. Bajenoff M. Dalod M. Malissen B. Henri S. Dynamics and Transcriptomics of Skin Dendritic Cells and Macrophages in an Imiquimod-Induced, Biphasic Mouse Model of Psoriasis J. Immunol. 2015 195 4953 4961 10.4049/jimmunol.1500551 26466959 107. Cheng J.B. Sedgewick A.J. Finnegan A.I. Harirchian P. Lee J. Kwon S. Fassett M.S. Golovato J. Gray M. Ghadially R. Transcriptional Programming of Normal and Inflamed Human Epidermis at Single-Cell Resolution Cell Rep. 2018 25 871 883 10.1016/j.celrep.2018.09.006 30355494 PMC6367716 108. Zaba L.C. Fuentes-Duculan J. Eungdamrong N.J. Abello M.V. Novitskaya I. Pierson K.C. Gonzalez J. Krueger J.G. Lowes M.A. Psoriasis is characterized by accumulation of immunostimulatory and Th1/Th17 cell-polarizing myeloid dendritic cells J. Investig. Dermatol. 2009 129 79 88 10.1038/jid.2008.194 18633443 PMC2701224 109. Rebane A. Zimmermann M. Aab A. Baurecht H. Koreck A. Karelson M. Abram K. Metsalu T. Pihlap M. Meyer N. Mechanisms of IFN-γ-induced apoptosis of human skin keratinocytes in patients with atopic dermatitis J. Allergy Clin. Immunol. 2012 129 1297 1306 10.1016/j.jaci.2012.02.020 22445417 110. Nestle F.O. Conrad C. Tun-Kyi A. Homey B. Gombert M. Boyman O. Burg G. Liu Y.J. Gilliet M. Plasmacytoid predendritic cells initiate psoriasis through interferon-alpha production J. Exp. Med. 2005 202 135 143 10.1084/jem.20050500 15998792 PMC2212894 111. Zhou Y. Xu F. Chen X.Y. Yan B.X. Wang Z.Y. Chen S.Q. Zheng M. Man X.Y. The epidermal immune microenvironment plays a dominant role in psoriasis development, as revealed by mass cytometry Cell. Mol. Immunol. 2022 19 1400 1413 10.1038/s41423-022-00940-8 36348078 PMC9708662 112. Borek I. Köffel R. Feichtinger J. Spies M. Glitzner-Zeis E. Hochgerner M. Sconocchia T. Krump C. Tam-Amersdorfer C. Passegger C. BMP7 aberrantly induced in the psoriatic epidermis instructs inflammation-associated Langerhans cells J. Allergy Clin. Immunol. 2020 145 1194 1207.e11 10.1016/j.jaci.2019.12.011 31870764 113. Yoshiki R. Kabashima K. Honda T. Nakamizo S. Sawada Y. Sugita K. Yoshioka H. Ohmori S. Malissen B. Tokura Y. IL-23 from Langerhans cells is required for the development of imiquimod-induced psoriasis-like dermatitis by induction of IL-17A-producing γδ T cells J. Investig. Dermatol. 2014 134 1912 1921 10.1038/jid.2014.98 24569709 114. Zheng T. Zhao W. Li H. Xiao S. Hu R. Han M. Liu H. Liu Y. Otsu K. Liu X. p38α signaling in Langerhans cells promotes the development of IL-17-producing T cells and psoriasiform skin inflammation Sci. Signal. 2018 11 eaao1685 10.1126/scisignal.aao1685 29535261 115. Martini E. Wikén M. Cheuk S. Gallais Sérézal I. Baharom F. Ståhle M. Smed-Sörensen A. Eidsmo L. Dynamic Changes in Resident and Infiltrating Epidermal Dendritic Cells in Active and Resolved Psoriasis J. Investig. Dermatol. 2017 137 865 873 10.1016/j.jid.2016.11.033 28011143 116. Fujita H. Shemer A. Suárez-Fariñas M. Johnson-Huang L.M. Tintle S. Cardinale I. Fuentes-Duculan J. Novitskaya I. Carucci J.A. Krueger J.G. Lesional dendritic cells in patients with chronic atopic dermatitis and psoriasis exhibit parallel ability to activate T-cell subsets J. Allergy Clin. Immunol. 2011 128 574 582.e12 10.1016/j.jaci.2011.05.016 21704361 117. Wang Y. Edelmayer R. Wetter J. Salte K. Gauvin D. Leys L. Paulsboe S. Su Z. Weinberg I. Namovic M. Monocytes/Macrophages play a pathogenic role in IL-23 mediated psoriasis-like skin inflammation Sci. Rep. 2019 9 5310 10.1038/s41598-019-41655-7 30926837 PMC6441056 118. Wang H. Peters T. Kess D. Sindrilaru A. Oreshkova T. Van Rooijen N. Stratis A. Renkl A.C. Sunderkötter C. Wlaschek M. Activated macrophages are essential in a murine model for T cell-mediated chronic psoriasiform skin inflammation J. Clin. Investig. 2006 116 2105 2114 10.1172/JCI27180 16886059 PMC1523400 119. Stratis A. Pasparakis M. Rupec R.A. Markur D. Hartmann K. Scharffetter-Kochanek K. Peters T. van Rooijen N. Krieg T. Haase I. Pathogenic role for skin macrophages in a mouse model of keratinocyte-induced psoriasis-like skin inflammation J. Clin. Investig. 2006 116 2094 2104 10.1172/JCI27179 16886058 PMC1525004 120. Erbel C. Akhavanpoor M. Okuyucu D. Wangler S. Dietz A. Zhao L. Stellos K. Little K.M. Lasitschka F. Doesch A. IL-17A influences essential functions of the monocyte/macrophage lineage and is involved in advanced murine and human atherosclerosis J. Immunol. 2014 193 4344 4355 10.4049/jimmunol.1400181 25261478 PMC4201987 121. Sieminska I. Pieniawska M. Grzywa T.M. The Immunology of Psoriasis-Current Concepts in Pathogenesis Clin. Rev. Allergy Immunol. 2024 66 164 191 10.1007/s12016-024-08991-7 38642273 PMC11193704 122. Kolkhir P. Elieh-Ali-Komi D. Metz M. Siebenhaar F. Maurer M. Understanding human mast cells: Lesson from therapies for allergic and non-allergic diseases Nat. Rev. Immunol. 2022 22 294 308 10.1038/s41577-021-00622-y 34611316 123. Galli S.J. Gaudenzio N. Tsai M. Mast Cells in Inflammation and Disease: Recent Progress and Ongoing Concerns Annu. Rev. Immunol. 2020 38 49 77 10.1146/annurev-immunol-071719-094903 32340580 124. Cheung K.L. Jarrett R. Subramaniam S. Salimi M. Gutowska-Owsiak D. Chen Y.L. Hardman C. Xue L. Cerundolo V. Ogg G. Psoriatic T cells recognize neolipid antigens generated by mast cell phospholipase delivered by exosomes and presented by CD1a J. Exp. Med. 2016 213 2399 2412 10.1084/jem.20160258 27670592 PMC5068234 125. Zhou T. Du X. Zhang L. Zheng Y. Jia T. Song X. Che D. Geng S. Suprabasin-derived polypeptides: SBSN(50-63) induces inflammatory response via TLR4-mediated mast cell activation Inflammopharmacology 2023 31 1329 1339 10.1007/s10787-023-01137-9 36745245 126. Ji Y.Z. Liu S.R. Koebner phenomenon leading to the formation of new psoriatic lesions: Evidences and mechanisms Biosci. Rep. 2019 39 BSR20193266 10.1042/BSR20193266 31710084 PMC6893164 127. Ribot J.C. Lopes N. Silva-Santos B. γδ T cells in tissue physiology and surveillance Nat. Rev. Immunol. 2021 21 221 232 10.1038/s41577-020-00452-4 33057185 128. Cai Y. Xue F. Quan C. Qu M. Liu N. Zhang Y. Fleming C. Hu X. Zhang H.G. Weichselbaum R. A Critical Role of the IL-1β-IL-1R Signaling Pathway in Skin Inflammation and Psoriasis Pathogenesis J. Investig. Dermatol. 2019 139 146 156 10.1016/j.jid.2018.07.025 30120937 PMC6392027 129. Laggner U. Di Meglio P. Perera G.K. Hundhausen C. Lacy K.E. Ali N. Smith C.H. Hayday A.C. Nickoloff B.J. Nestle F.O. Identification of a novel proinflammatory human skin-homing Vγ9Vδ2 T cell subset with a potential role in psoriasis J. Immunol. 2011 187 2783 2793 10.4049/jimmunol.1100804 21813772 PMC3187621 130. Peng P. Lou Y. Wang S. Wang J. Zhang Z. Du P. Zheng J. Liu P. Xu L.X. Activated NK cells reprogram MDSCs via NKG2D-NKG2DL and IFN-γ to modulate antitumor T-cell response after cryo-thermal therapy J. Immunother. Cancer 2022 10 e005769 10.1136/jitc-2022-005769 36521929 PMC9756281 131. Choi Y. Saron W.A. O’Neill A. Senanayake M. Wilder-Smith A. Rathore A.P. St John A.L. NKT cells promote Th1 immune bias to dengue virus that governs long-term protective antibody dynamics J. Clin. Investig. 2024 134 e169251 10.1172/JCI169251 39088280 PMC11405039 132. Venken K. Jacques P. Mortier C. Labadia M.E. Decruy T. Coudenys J. Hoyt K. Wayne A.L. Hughes R. Turner M. RORγt inhibition selectively targets IL-17 producing iNKT and γδ-T cells enriched in Spondyloarthritis patients Nat. Commun. 2019 10 9 10.1038/s41467-018-07911-6 30602780 PMC6315029 133. Hu Y. Chen Y. Chen Z. Zhang X. Guo C. Yu Z. Xu P. Sun L. Zhou X. Gong Y. Dysregulated Peripheral Invariant Natural Killer T Cells in Plaque Psoriasis Patients Front. Cell Dev. Biol. 2021 9 799560 10.3389/fcell.2021.799560 35186952 PMC8850372 134. Liu P. Peng C. Chen X. Wu L. Yin M. Li J. Qin Q. Kuang Y. Zhu W. Acitretin Promotes the Differentiation of Myeloid-Derived Suppressor Cells in the Treatment of Psoriasis Front. Med. 2021 8 625130 10.3389/fmed.2021.625130 PMC8021725 33834031 135. Sarkar D. Pramanik A. Das D. Bhattacharyya S. Shifting phenotype and differentiation of CD11b(+)Gr.1(+) immature heterogeneous myeloid derived adjuster cells support inflammation and induce regulators of IL17A in imiquimod induced psoriasis Inflamm. Res. 2024 73 1581 1599 10.1007/s00011-024-01918-0 39052064 136. Jovanovic D.V. Di Battista J.A. Martel-Pelletier J. Jolicoeur F.C. He Y. Zhang M. Mineau F. Pelletier J.P. IL-17 stimulates the production and expression of proinflammatory cytokines, IL-beta and TNF-alpha, by human macrophages J. Immunol. 1998 160 3513 3521 10.4049/jimmunol.160.7.3513 9531313 137. Albanesi C. Cavani A. Girolomoni G. IL-17 is produced by nickel-specific T lymphocytes and regulates ICAM-1 expression and chemokine production in human keratinocytes: Synergistic or antagonist effects with IFN-gamma and TNF-alpha J. Immunol. 1999 162 494 502 10.4049/jimmunol.162.1.494 9886425 138. Kawaguchi M. Kokubu F. Odaka M. Watanabe S. Suzuki S. Ieki K. Matsukura S. Kurokawa M. Adachi M. Huang S.K. Induction of granulocyte-macrophage colony-stimulating factor by a new cytokine, ML-1 (IL-17F), via Raf I-MEK-ERK pathway J. Allergy Clin. Immunol. 2004 114 444 450 10.1016/j.jaci.2004.03.047 15316530 139. Johnston A. Fritz Y. Dawes S.M. Diaconu D. Al-Attar P.M. Guzman A.M. Chen C.S. Fu W. Gudjonsson J.E. McCormick T.S. Keratinocyte overexpression of IL-17C promotes psoriasiform skin inflammation J. Immunol. 2013 190 2252 2262 10.4049/jimmunol.1201505 23359500 PMC3577967 140. Yeste A. Mascanfroni I.D. Nadeau M. Burns E.J. Tukpah A.M. Santiago A. Wu C. Patel B. Kumar D. Quintana F.J. IL-21 induces IL-22 production in CD4+ T cells Nat. Commun. 2014 5 3753 10.1038/ncomms4753 24796415 PMC4157605 141. Hammer A.M. Morris N.L. Cannon A.R. Khan O.M. Gagnon R.C. Movtchan N.V. van Langeveld I. Li X. Gao B. Choudhry M.A. Interleukin-22 Prevents Microbial Dysbiosis and Promotes Intestinal Barrier Regeneration Following Acute Injury Shock 2017 48 657 665 10.1097/SHK.0000000000000900 28498296 PMC5681896 142. Bunte K. Beikler T. Th17 Cells and the IL-23/IL-17 Axis in the Pathogenesis of Periodontitis and Immune-Mediated Inflammatory Diseases Int. J. Mol. Sci. 2019 20 3394 10.3390/ijms20143394 31295952 PMC6679067 143. Chang H.W. Yan D. Singh R. Liu J. Lu X. Ucmak D. Lee K. Afifi L. Fadrosh D. Leech J. Alteration of the cutaneous microbiome in psoriasis and potential role in Th17 polarization Microbiome 2018 6 154 10.1186/s40168-018-0533-1 30185226 PMC6125946 144. Zheng Y. Danilenko D.M. Valdez P. Kasman I. Eastham-Anderson J. Wu J. Ouyang W. Interleukin-22, a T(H)17 cytokine, mediates IL-23-induced dermal inflammation and acanthosis Nature 2007 445 648 651 10.1038/nature05505 17187052 145. Trifari S. Kaplan C.D. Tran E.H. Crellin N.K. Spits H. Identification of a human helper T cell population that has abundant production of interleukin 22 and is distinct from T(H)-17, T(H)1 and T(H)2 cells Nat. Immunol. 2009 10 864 871 10.1038/ni.1770 19578368 146. Schlapbach C. Gehad A. Yang C. Watanabe R. Guenova E. Teague J.E. Campbell L. Yawalkar N. Kupper T.S. Clark R.A. Human TH9 cells are skin-tropic and have autocrine and paracrine proinflammatory capacity Sci. Transl. Med. 2014 6 219ra8 10.1126/scitranslmed.3007828 PMC4102325 24431112 147. Singh T.P. Schön M.P. Wallbrecht K. Gruber-Wackernagel A. Wang X.J. Wolf P. Involvement of IL-9 in Th17-associated inflammation and angiogenesis of psoriasis PLoS ONE 2013 8 e51752 10.1371/journal.pone.0051752 23335955 PMC3546056 148. Niu J. Song Z. Yang X. Zhai Z. Zhong H. Hao F. Increased circulating follicular helper T cells and activated B cells correlate with disease severity in patients with psoriasis J. Eur. Acad. Dermatol. Venereol. 2015 29 1791 1796 10.1111/jdv.13027 25712241 149. Austin L.M. Ozawa M. Kikuchi T. Walters I.B. Krueger J.G. The majority of epidermal T cells in Psoriasis vulgaris lesions can produce type 1 cytokines, interferon-gamma, interleukin-2, and tumor necrosis factor-alpha, defining TC1 (cytotoxic T lymphocyte) and TH1 effector populations: A type 1 differentiation bias is also measured in circulating blood T cells in psoriatic patients J. Investig. Dermatol. 1999 113 752 759 10.1046/j.1523-1747.1999.00749.x 10571730 150. Guenova E. Skabytska Y. Hoetzenecker W. Weindl G. Sauer K. Tham M. Kim K.W. Park J.H. Seo J.H. Ignatova D. IL-4 abrogates T(H)17 cell-mediated inflammation by selective silencing of IL-23 in antigen-presenting cells Proc. Natl. Acad. Sci. USA 2015 112 2163 2168 10.1073/pnas.1416922112 25646481 PMC4343151 151. Huang C. Sun P.-Y. Jiang Y. Liu Y. Liu Z. Han S.-L. Wang B.-S. Huang Y.-X. Ren A.-R. Lu J.-F. Sensory ASIC3 channel exacerbates psoriatic inflammation via a neurogenic pathway in female mice Nat. Commun. 2024 15 5288 10.1038/s41467-024-49577-3 38902277 PMC11190258 152. Baker B.S. Laman J.D. Powles A. van der Fits L. Voerman J.S. Melief M.J. Fry L. Peptidoglycan and peptidoglycan-specific Th1 cells in psoriatic skin lesions J. Pathol. 2006 209 174 181 10.1002/path.1954 16493599 153. Baker B.S. Powles A. Fry L. Peptidoglycan: A major aetiological factor for psoriasis? Trends Immunol. 2006 27 545 551 10.1016/j.it.2006.10.001 17045843 154. Menssen A. Trommler P. Vollmer S. Schendel D. Albert E. Gürtler L. Riethmüller G. Prinz J.C. Evidence for an antigen-specific cellular immune response in skin lesions of patients with psoriasis vulgaris J. Immunol. 1995 155 4078 4083 10.4049/jimmunol.155.8.4078 7561119 155. Lin W.J. Norris D.A. Achziger M. Kotzin B.L. Tomkinson B. Oligoclonal expansion of intraepidermal T cells in psoriasis skin lesions J. Investig. Dermatol. 2001 117 1546 1553 10.1046/j.0022-202x.2001.01548.x 11886521 156. Pantelyushin S. Haak S. Ingold B. Kulig P. Heppner F.L. Navarini A.A. Becher B. Rorγt+ innate lymphocytes and γδ T cells initiate psoriasiform plaque formation in mice J. Clin. Investig. 2012 122 2252 2256 10.1172/JCI61862 22546855 PMC3366412 157. Zhang Y.Y. Lin Y.T. Wang L. Sun X.W. Dang E.L. Xue K. Zhang W.G. Zhang K.M. Wang G. Li B. CD8αα(+)T cells exert a pro-inflammatory role in patients with psoriasis Ski. Health Dis. 2021 1 ski2.64 10.1002/ski2.64 PMC9060015 35663772 158. Diani M. Casciano F. Marongiu L. Longhi M. Altomare A. Pigatto P.D. Secchiero P. Gambari R. Banfi G. Manfredi A.A. Increased frequency of activated CD8(+) T cell effectors in patients with psoriatic arthritis Sci. Rep. 2019 9 10870 10.1038/s41598-019-47310-5 31350460 PMC6659700 159. Di Meglio P. Villanova F. Navarini A.A. Mylonas A. Tosi I. Nestle F.O. Conrad C. Targeting CD8(+) T cells prevents psoriasis development J. Allergy Clin. Immunol. 2016 138 274 276.e6 10.1016/j.jaci.2015.10.046 26782974 160. Cheuk S. Wikén M. Blomqvist L. Nylén S. Talme T. Ståhle M. Eidsmo L. Epidermal Th22 and Tc17 cells form a localized disease memory in clinically healed psoriasis J. Immunol. 2014 192 3111 3120 10.4049/jimmunol.1302313 24610014 PMC3962894 161. Migayron L. Merhi R. Seneschal J. Boniface K. Resident memory T cells in nonlesional skin and healed lesions of patients with chronic inflammatory diseases: Appearances can be deceptive J. Allergy Clin. Immunol. 2024 153 606 614 10.1016/j.jaci.2023.11.017 37995858 162. Deng G. Zhang Y. Song J. Zhang Y. Zheng Q. Luo Y. Fei X. Yang Y. Kuai L. Li B. The role and therapeutic strategies for tissue-resident memory T cells, central memory T cells, and effector memory T cells in psoriasis Immunology 2024 173 470 480 10.1111/imm.13843 39136109 163. Matos T.R. O’Malley J.T. Lowry E.L. Hamm D. Kirsch I.R. Robins H.S. Kupper T.S. Krueger J.G. Clark R.A. Clinically resolved psoriatic lesions contain psoriasis-specific IL-17-producing αβ T cell clones J. Clin. Investig. 2017 127 4031 4041 10.1172/JCI93396 28945199 PMC5663366 164. Lee B.H. Bang Y.J. Lim S.H. Kang S.J. Kim S.H. Kim-Schulze S. Park C.G. Kim H.J. Kim T.G. High-dimensional profiling of regulatory T cells in psoriasis reveals an impaired skin-trafficking property EBioMedicine 2024 100 104985 10.1016/j.ebiom.2024.104985 38306895 PMC10847473 165. Sugiyama H. Gyulai R. Toichi E. Garaczi E. Shimada S. Stevens S.R. McCormick T.S. Cooper K.D. Dysfunctional blood and target tissue CD4+CD25high regulatory T cells in psoriasis: Mechanism underlying unrestrained pathogenic effector T cell proliferation J. Immunol. 2005 174 164 173 10.4049/jimmunol.174.1.164 15611238 PMC2903964 166. Yang L. Li B. Dang E. Jin L. Fan X. Wang G. Impaired function of regulatory T cells in patients with psoriasis is mediated by phosphorylation of STAT3 J. Dermatol. Sci. 2016 81 85 92 10.1016/j.jdermsci.2015.11.007 26627723 167. Sivasami P. Elkins C. Diaz-Saldana P.P. Goss K. Peng A. Hamersky M.t. Bae J. Xu M. Pollack B.P. Horwitz E.M. Obesity-induced dysregulation of skin-resident PPARγ(+) Treg cells promotes IL-17A-mediated psoriatic inflammation Immunity 2023 56 1844 1861.e6 10.1016/j.immuni.2023.06.021 37478855 PMC10527179 168. Lu J. Ding Y. Yi X. Zheng J. CD19+ B cell subsets in the peripheral blood and skin lesions of psoriasis patients and their correlations with disease severity Braz. J. Med. Biol. Res. 2016 49 e5374 10.1590/1414-431x20165374 27532281 PMC4991840 169. Jones D.A. Yawalkar N. Suh K.Y. Sadat S. Rich B. Kupper T.S. Identification of autoantigens in psoriatic plaques using expression cloning J. Investig. Dermatol. 2004 123 93 100 10.1111/j.0022-202X.2004.22709.x 15191548 170. Guarneri C. Aguennouz M. Guarneri F. Polito F. Benvenga S. Cannavò S.P. Autoimmunity to heterogeneous nuclear ribonucleoprotein A1 in psoriatic patients and correlation with disease severity J. Dtsch. Dermatol. Ges. 2018 16 1103 1107 10.1111/ddg.13631 30179318 171. Yunusbaeva M. Valiev R. Bilalov F. Sultanova Z. Sharipova L. Yunusbayev B. Psoriasis patients demonstrate HLA-Cw*06:02 allele dosage-dependent T cell proliferation when treated with hair follicle-derived keratin 17 protein Sci. Rep. 2018 8 6098 10.1038/s41598-018-24491-z 29666398 PMC5904118 172. Yuan Y. Qiu J. Lin Z.T. Li W. Haley C. Mui U.N. Ning J. Tyring S.K. Wu T. Identification of Novel Autoantibodies Associated With Psoriatic Arthritis Arthritis Rheumatol. 2019 71 941 951 10.1002/art.40830 30618213 173. Wang S.Y. An W.H. Wang Z.S. Wang W.L. Zhang B. Xu K.L. Guo S.L. Gao M. Li B. Huang L. Incidentally cured psoriasis in a patient with refractory/relapsed diffuse large B-cell lymphoma receiving CD19 CAR-T cell therapy: A case report Front. Immunol. 2024 15 1418768 10.3389/fimmu.2024.1418768 39534606 PMC11555394 174. Mizumaki K. Horii M. Kano M. Komuro A. Matsushita T. Suppression of IL-23-mediated psoriasis-like inflammation by regulatory B cells Sci. Rep. 2021 11 2106 10.1038/s41598-021-81588-8 33483537 PMC7822829 175. Mavropoulos A. Zafiriou E. Simopoulou T. Brotis A.G. Liaskos C. Roussaki-Schulze A. Katsiari C.G. Bogdanos D.P. Sakkas L.I. Apremilast increases IL-10-producing regulatory B cells and decreases proinflammatory T cells and innate cells in psoriatic arthritis and psoriasis Rheumatology 2019 58 2240 2250 10.1093/rheumatology/kez204 31209492 176. Mavropoulos A. Varna A. Zafiriou E. Liaskos C. Alexiou I. Roussaki-Schulze A. Vlychou M. Katsiari C. Bogdanos D.P. Sakkas L.I. IL-10 producing Bregs are impaired in psoriatic arthritis and psoriasis and inversely correlate with IL-17- and IFNγ-producing T cells Clin. Immunol. 2017 184 33 41 10.1016/j.clim.2017.04.010 28461105 177. Menter A. Korman N.J. Elmets C.A. Feldman S.R. Gelfand J.M. Gordon K.B. Gottlieb A. Koo J.Y. Lebwohl M. Leonardi C.L. Guidelines of care for the management of psoriasis and psoriatic arthritis: Section 6. Guidelines of care for the treatment of psoriasis and psoriatic arthritis: Case-based presentations and evidence-based conclusions J. Am. Acad. Dermatol. 2011 65 137 174 10.1016/j.jaad.2010.11.055 21306785 178. Nast A. Boehncke W.H. Mrowietz U. Ockenfels H.M. Philipp S. Reich K. Rosenbach T. Sammain A. Schlaeger M. Sebastian M. S3—Guidelines on the treatment of psoriasis vulgaris (English version). Update J. Dtsch. Dermatol. Ges. 2012 10 (Suppl. 2) S1 S95 10.1111/j.1610-0387.2012.07919.x 22386073 179. Jones S.A. Perera D.N. Fan H. Russ B.E. Harris J. Morand E.F. GILZ regulates Th17 responses and restrains IL-17-mediated skin inflammation J. Autoimmun. 2015 61 73 80 10.1016/j.jaut.2015.05.010 26077873 180. Papp K.A. Gulliver W. Lynde C.W. Poulin Y. Adam D.N. Barankin B. Barber K. Bourcier M. Gooderham M. Guenther L.C. 2016 Addendum to the Canadian Guidelines for the Management of Plaque Psoriasis 2009 J. Cutan. Med. Surg. 2016 20 375 431 10.1177/1203475416655705 27421294 PMC5014087 181. Koo J. Cuffie C.A. Tanner D.J. Bressinck R. Cornell R.C. DeVillez R.L. Edwards L. Breneman D.L. Piacquadio D.J. Guzzo C.A. Mometasone furoate 0.1%-salicylic acid 5% ointment versus mometasone furoate 0.1% ointment in the treatment of moderate-to-severe psoriasis: A multicenter study Clin. Ther. 1998 20 283 291 10.1016/S0149-2918(98)80091-X 9589819 182. Mason A. Mason J. Cork M. Hancock H. Dooley G. Topical treatments for chronic plaque psoriasis: An abridged Cochrane systematic review J. Am. Acad. Dermatol. 2013 69 799 807 10.1016/j.jaad.2013.06.027 24124809 183. Segaert S. Duvold L.B. Calcipotriol cream: A review of its use in the management of psoriasis J. Dermatol. Treat. 2006 17 327 337 10.1080/09546630600999219 17853305 184. Lebwohl M.G. Stein Gold L. Strober B. Papp K.A. Armstrong A.W. Bagel J. Kircik L. Ehst B. Hong H.C. Soung J. Phase 3 Trials of Tapinarof Cream for Plaque Psoriasis N. Engl. J. Med. 2021 385 2219 2229 10.1056/NEJMoa2103629 34879448 185. Ortonne J.P. van de Kerkhof P.C. Prinz J.C. Bieber T. Lahfa M. Rubins A. Wozel G. Lorette G. 0.3% Tacrolimus gel and 0.5% Tacrolimus cream show efficacy in mild to moderate plaque psoriasis: Results of a randomized, open-label, observer-blinded study Acta Derm. Venereol. 2006 86 29 33 10.1080/00015550510039817 16585986 186. Remitz A. Reitamo S. Erkko P. Granlund H. Lauerma A.I. Tacrolimus ointment improves psoriasis in a microplaque assay Br. J. Dermatol. 1999 141 103 107 10.1046/j.1365-2133.1999.02927.x 10417522 187. Douglas W.S. Poulin Y. Decroix J. Ortonne J.P. Mrowietz U. Gulliver W. Krogstad A.L. Larsen F.G. Iglesias L. Buckley C. A new calcipotriol/betamethasone formulation with rapid onset of action was superior to monotherapy with betamethasone dipropionate or calcipotriol in psoriasis vulgaris Acta Derm. Venereol. 2002 82 131 135 10.1080/00015550252948194 12125943 188. Menter A. Korman N.J. Elmets C.A. Feldman S.R. Gelfand J.M. Gordon K.B. Gottlieb A. Koo J.Y.M. Lebwohl M. Lim H.W. Guidelines of care for the management of psoriasis and psoriatic arthritis: Section 5. Guidelines of care for the treatment of psoriasis with phototherapy and photochemotherapy J. Am. Acad. Dermatol. 2010 62 114 135 Erratum in J. Am. Acad. Dermatol. 2021 84 10.1016/j.jaad.2009.08.026 19811850 189. Ho V.C. Griffiths C.E. Albrecht G. Vanaclocha F. León-Dorantes G. Atakan N. Reitamo S. Ohannesson A. Mørk N.J. Clarke P. Intermittent short courses of cyclosporin (Neoral(R)) for psoriasis unresponsive to topical therapy: A 1-year multicentre, randomized study. The PISCES Study Group Br. J. Dermatol. 1999 141 283 291 10.1046/j.1365-2133.1999.02977.x 10468801 190. Elias K.M. Laurence A. Davidson T.S. Stephens G. Kanno Y. Shevach E.M. O’Shea J.J. Retinoic acid inhibits Th17 polarization and enhances FoxP3 expression through a Stat-3/Stat-5 independent signaling pathway Blood 2008 111 1013 1020 10.1182/blood-2007-06-096438 17951529 PMC2214761 191. Goldfarb M.T. Ellis C.N. Gupta A.K. Tincoff T. Hamilton T.A. Voorhees J.J. Acitretin improves psoriasis in a dose-dependent fashion J. Am. Acad. Dermatol. 1988 18 655 662 10.1016/S0190-9622(88)70086-9 2967310 192. Dong K.K. Damaghi N. Picart S.D. Markova N.G. Obayashi K. Okano Y. Masaki H. Grether-Beck S. Krutmann J. Smiles K.A. UV-induced DNA damage initiates release of MMP-1 in human skin Exp. Dermatol. 2008 17 1037 1044 10.1111/j.1600-0625.2008.00747.x 18459971 193. Wong T. Hsu L. Liao W. Phototherapy in psoriasis: A review of mechanisms of action J. Cutan. Med. Surg. 2013 17 6 12 10.2310/7750.2012.11124 23364144 PMC3736829 194. Walters I.B. Ozawa M. Cardinale I. Gilleaudeau P. Trepicchio W.L. Bliss J. Krueger J.G. Narrowband (312-nm) UV-B suppresses interferon gamma and interleukin (IL) 12 and increases IL-4 transcripts: Differential regulation of cytokines at the single-cell level Arch. Dermatol. 2003 139 155 161 10.1001/archderm.139.2.155 12588221 195. Rim J.H. Park J.Y. Choe Y.B. Youn J.I. The efficacy of calcipotriol + acitretin combination therapy for psoriasis: Comparison with acitretin monotherapy Am. J. Clin. Dermatol. 2003 4 507 510 10.2165/00128071-200304070-00006 12814339 196. Menter A. Gottlieb A. Feldman S.R. Van Voorhees A.S. Leonardi C.L. Gordon K.B. Lebwohl M. Koo J.Y. Elmets C.A. Korman N.J. Guidelines of care for the management of psoriasis and psoriatic arthritis: Section 1. Overview of psoriasis and guidelines of care for the treatment of psoriasis with biologics J. Am. Acad. Dermatol. 2008 58 826 850 10.1016/j.jaad.2008.02.039 18423260 197. Gisondi P. Del Giglio M. Cotena C. Girolomoni G. Combining etanercept and acitretin in the therapy of chronic plaque psoriasis: A 24-week, randomized, controlled, investigator-blinded pilot trial Br. J. Dermatol. 2008 158 1345 1349 10.1111/j.1365-2133.2008.08564.x 18410408 198. Boehm M.F. Zhang L. Zhi L. McClurg M.R. Berger E. Wagoner M. Mais D.E. Suto C.M. Davies J.A. Heyman R.A. Design and synthesis of potent retinoid X receptor selective ligands that induce apoptosis in leukemia cells J. Med. Chem. 1995 38 3146 3155 10.1021/jm00016a018 7636877 199. Tu J. Yin Z. Guo J. He F. Long F. Yin Z. Acitretin inhibits IL-17A-induced IL-36 expression in keratinocytes by down-regulating IκBζ Int. Immunopharmacol. 2020 79 106045 10.1016/j.intimp.2019.106045 31863918 200. Katz H.I. Waalen J. Leach E.E. Acitretin in psoriasis: An overview of adverse effects J. Am. Acad. Dermatol. 1999 41 S7 S12 10.1016/S0190-9622(99)70359-2 10459140 201. de Eusebio E. Armario-Hita J.C. de Miquel V.A. Treatment of psoriasis: Focus on clinic-based management with infliximab Am. J. Clin. Dermatol. 2014 15 (Suppl. 1) S5 S16 10.1007/s40257-013-0054-4 24777571 202. Ho V.C. Griffiths C.E. Berth-Jones J. Papp K.A. Vanaclocha F. Dauden E. Beard A. Puvanarajan L. Paul C. Intermittent short courses of cyclosporine microemulsion for the long-term management of psoriasis: A 2-year cohort study J. Am. Acad. Dermatol. 2001 44 643 651 10.1067/mjd.2001.112400 11260540 203. Bram R.J. Crabtree G.R. Calcium signalling in T cells stimulated by a cyclophilin B-binding protein Nature 1994 371 355 358 10.1038/371355a0 7522304 204. Huang H. Jin K. Ouyang K. Jiang Z. Yang Z. Hu N. Dai Y. Zhang Y. Zhang Q. Han Y. Cyclophilin A causes severe fever with thrombocytopenia syndrome virus-induced cytokine storm by regulating mitogen-activated protein kinase pathway Front. Microbiol. 2022 13 1046176 10.3389/fmicb.2022.1046176 36569095 PMC9768865 205. Lin V.W. Ringold S. Devine E.B. Comparison of Ustekinumab with Other Biological Agents for the Treatment of Moderate to Severe Plaque Psoriasis: A Bayesian Network Meta-analysis Arch. Dermatol. 2012 148 1403 1410 10.1001/2013.jamadermatol.238 23069736 206. Jairath V. Acosta Felquer M.L. Cho R.J. IL-23 inhibition for chronic inflammatory disease Lancet 2024 404 1679 1692 Erratum in Lancet 2025 404 10.1016/S0140-6736(24)01750-1 39461795 207. Mease P.J. Chohan S. Fructuoso F.J.G. Luggen M.E. Rahman P. Raychaudhuri S.P. Chou R.C. Mendelsohn A.M. Rozzo S.J. Gottlieb A. Efficacy and safety of tildrakizumab in patients with active psoriatic arthritis: Results of a randomised, double-blind, placebo-controlled, multiple-dose, 52-week phase IIb study Ann. Rheum. Dis. 2021 80 1147 1157 10.1136/annrheumdis-2020-219014 33985942 PMC8372392 208. Gordon K.B. Blauvelt A. Papp K.A. Langley R.G. Luger T. Ohtsuki M. Reich K. Amato D. Ball S.G. Braun D.K. Phase 3 Trials of Ixekizumab in Moderate-to-Severe Plaque Psoriasis N. Engl. J. Med. 2016 375 345 356 10.1056/NEJMoa1512711 27299809 209. Reich K. Sullivan J. Arenberger P. Jazayeri S. Mrowietz U. Augustin M. Elewski B. You R. Regnault P. Frueh J.A. Secukinumab shows high and sustained efficacy in nail psoriasis: 2.5-year results from the randomized placebo-controlled TRANSFIGURE study Br. J. Dermatol. 2021 184 425 436 10.1111/bjd.19262 32479641 210. Warren R.B. Blauvelt A. Bagel J. Papp K.A. Yamauchi P. Armstrong A. Langley R.G. Vanvoorden V. De Cuyper D. Cioffi C. Bimekizumab versus Adalimumab in Plaque Psoriasis N. Engl. J. Med. 2021 385 130 141 10.1056/NEJMoa2102388 33891379 211. Reich K. Warren R.B. Lebwohl M. Gooderham M. Strober B. Langley R.G. Paul C. De Cuyper D. Vanvoorden V. Madden C. Bimekizumab versus Secukinumab in Plaque Psoriasis N. Engl. J. Med. 2021 385 142 152 10.1056/NEJMoa2102383 33891380 212. Morita A. Strober B. Burden A.D. Choon S.E. Anadkat M.J. Marrakchi S. Tsai T.F. Gordon K.B. Thaçi D. Zheng M. Efficacy and safety of subcutaneous spesolimab for the prevention of generalised pustular psoriasis flares (Effisayil 2): An international, multicentre, randomised, placebo-controlled trial Lancet 2023 402 1541 1551 10.1016/S0140-6736(23)01378-8 37738999 213. Yang W. Bai X. Jia X. Li H. Min J. Li H. Zhang H. Zhou J. Zhao Y. Liu W. The binding of extracellular cyclophilin A to ACE2 and CD147 triggers psoriasis-like inflammation J. Autoimmun. 2024 148 103293 10.1016/j.jaut.2024.103293 39096717 214. Bian J. Liu R. Fan T. Liao L. Wang S. Geng W. Wang T. Shi W. Ruan Q. miR-340 Alleviates Psoriasis in Mice through Direct Targeting of IL-17A J. Immunol. 2018 201 1412 1420 10.4049/jimmunol.1800189 30012847 215. Chen L. Huang D. Huang Z. Liu X. He M. Luo M. Tang Z. Tan G. Guo Q. Xiong H. Decreased HMGCS1 inhibits proliferation and inflammatory response of keratinocytes and ameliorates imiquimod-induced psoriasis via the STAT3/IL-23 axis Int. Immunopharmacol. 2024 133 112033 10.1016/j.intimp.2024.112033 38608446 216. Kulkarni J.A. Witzigmann D. Chen S. Cullis P.R. van der Meel R. Lipid Nanoparticle Technology for Clinical Translation of siRNA Therapeutics Acc. Chem. Res. 2019 52 2435 2444 10.1021/acs.accounts.9b00368 31397996 217. Tang Q. Khvorova A. RNAi-based drug design: Considerations and future directions Nat. Rev. Drug Discov. 2024 23 341 364 10.1038/s41573-024-00912-9 38570694 PMC11144061 218. Boakye C.H.A. Patel K. Doddapaneni R. Bagde A. Marepally S. Singh M. Novel amphiphilic lipid augments the co-delivery of erlotinib and IL36 siRNA into the skin for psoriasis treatment J. Control. Release 2017 246 120 132 10.1016/j.jconrel.2016.05.017 27170227 219. Zhang A. Zhang G. Yang H. Gong B. Li S. Wei N. Xue H. Wei H. Wang J. Qiu S. Treatment of pro-B acute lymphoblastic leukemia and severe plaque psoriasis with anti-CD19 CAR T cells: A case report Front. Immunol. 2025 16 1529745 10.3389/fimmu.2025.1529745 40098975 PMC11911368 220. Wang X. Wu X. Tan B. Zhu L. Zhang Y. Lin L. Xiao Y. Sun A. Wan X. Liu S. Allogeneic CD19-targeted CAR-T therapy in patients with severe myositis and systemic sclerosis Cell 2024 187 4890 4904.e9 10.1016/j.cell.2024.06.027 39013470 221. Fransson M. Piras E. Burman J. Nilsson B. Essand M. Lu B. Harris R.A. Magnusson P.U. Brittebo E. Loskog A.S. CAR/FoxP3-engineered T regulatory cells target the CNS and suppress EAE upon intranasal delivery J. Neuroinflammation 2012 9 112 10.1186/1742-2094-9-112 22647574 PMC3403996 222. Zhang W. Chen Y. Zhao Z. Zheng H. Wang S. Liao Z. Sheng T. Zhao S. Hou W. Yu X. Adoptive T(reg) therapy with metabolic intervention via perforated microneedles ameliorates psoriasis syndrome Sci. Adv. 2023 9 eadg6007 10.1126/sciadv.adg6007 37196084 PMC11803960 223. Rosenzwajg M. Lorenzon R. Cacoub P. Pham H.P. Pitoiset F. El Soufi K. RIbet C. Bernard C. Aractingi S. Banneville B. Immunological and clinical effects of low-dose interleukin-2 across 11 autoimmune diseases in a single, open clinical trial Ann. Rheum. Dis. 2019 78 209 217 10.1136/annrheumdis-2018-214229 30472651 224. Chen W. Ren G. Zuo K. Huang X. Complete remission of both immunoglobulin light chain amyloidosis and psoriasis after autologous hematopoietic stem cell transplantation: A case report Medicine 2018 97 e13589 10.1097/MD.0000000000013589 30558027 PMC6320088 225. Kaffenberger B.H. Wong H.K. Jarjour W. Andritsos L.A. Remission of psoriasis after allogeneic, but not autologous, hematopoietic stem-cell transplantation J. Am. Acad. Dermatol. 2013 68 489 492 10.1016/j.jaad.2012.08.021 22981608 226. Ahn H. Lee S.Y. Jung W.J. Pi J. Lee K.H. Psoriasis treatment using minimally manipulated umbilical cord-derived mesenchymal stem cells: A case report World J. Clin. Cases 2021 9 6798 6803 10.12998/wjcc.v9.i23.6798 34447827 PMC8362539 227. Cheng L. Wang S. Peng C. Zou X. Yang C. Mei H. Li C. Su X. Xiao N. Ouyang Q. Human umbilical cord mesenchymal stem cells for psoriasis: A phase 1/2a, single-arm study Signal Transduct. Target. Ther. 2022 7 263 10.1038/s41392-022-01059-y 35927231 PMC9352692 228. Yao D. Ye S. He Z. Huang Y. Deng J. Wen Z. Chen X. Li H. Han Q. Deng H. Adipose-derived mesenchymal stem cells (AD-MSCs) in the treatment for psoriasis: Results of a single-arm pilot trial Ann. Transl. Med. 2021 9 1653 10.21037/atm-21-5028 34988162 PMC8667096 229. Tang L. Yao D. He Z. Ye S. Chen X. Huang Y. Han Q. Zeng X. Zheng X. Liu T. Distinct adaptive immune receptor feature of adipose-derived mesenchymal stem cells (AD-MSCs) treatment of psoriasis Arch. Dermatol. Res. 2024 316 542 10.1007/s00403-024-03296-3 39162818 230. Seetharaman R. Mahmood A. Kshatriya P. Patel D. Srivastava A. Mesenchymal Stem Cell Conditioned Media Ameliorate Psoriasis Vulgaris: A Case Study Case Rep. Dermatol. Med. 2019 2019 8309103 10.1155/2019/8309103 31186972 PMC6521531 231. Shao H. Chen J. Extracellular Vesicles from miR-146a Overexpressing Mesenchymal Stem Cells Attenuate Imiquimod-Induced Psoriasis by Regulating Cytokine Expression Iran. J. Immunol. 2025 22 119 130 10.22034/iji.2025.104576.2909 40546034 232. Mohseni Meybodi M.A. Nilforoushzadeh M.A. KhandanDezfully N. Mansouri P. The safety and efficacy of adipose tissue-derived exosomes in treating mild to moderate plaque psoriasis: A clinical study Life Sci. 2024 353 122915 10.1016/j.lfs.2024.122915 39013528 233. Ou M. Cao J. Luo R. Zhu B. Miao R. Yu L. Wang X. Li W. Fu Y. Zhang J. Drug-loaded microneedle patches containing regulatory T cell-derived exosomes for psoriasis treatment Acta Biomater. 2025 198 452 466 10.1016/j.actbio.2025.04.015 40210183 234. Chandran N.S. Bhupendrabhai M.N. Tan T.T. Zhang B. Lim S.K. Choo A.B.H. Lai R.C. A phase 1, open-label study to determine safety and tolerability of the topical application of mesenchymal stem/stromal cell (MSC) exosome ointment to treat psoriasis in healthy volunteers Cytotherapy 2025 27 633 641 10.1016/j.jcyt.2025.01.007 39918488 235. Bucci L. Hagen M. Rothe T. Raimondo M.G. Fagni F. Tur C. Wirsching A. Wacker J. Wilhelm A. Auger J.P. Bispecific T cell engager therapy for refractory rheumatoid arthritis Nat. Med. 2024 30 1593 1601 10.1038/s41591-024-02964-1 38671240 236. Gao C. Cai Y. Wu X. Song J. Zheng Q. Wang M. Luo Y. Luo Y. Fei X. Zhang Y. CRISPR/Cas9-Mediated Knockout and Overexpression Studies Unveil the Role of PD-L1 in Immune Modulation in a Psoriasis-like Mouse Model Inflammation 2025 10.1007/s10753-025-02281-w 40178656 237. Tan E. Wan T. Pan Q. Duan J. Zhang S. Wang R. Gao P. Lv J. Wang H. Li D. Dual-responsive nanocarriers for efficient cytosolic protein delivery and CRISPR-Cas9 gene therapy of inflammatory skin disorders Sci. Adv. 2024 10 eadl4336 10.1126/sciadv.adl4336 38630829 PMC11023524 238. Xiang Y. Jiang Y. Wang Z. Wang X. Ma L. Ding Y. Rui B. Zhao C. Li X. Xu M. Targeting KAT8 alleviates self-RNA-driven skin inflammation by modulating histone H4 lysine 16 acetylation in psoriasis Cell Death Differ. 2025 10.1038/s41418-025-01547-y 40691280 239. Dhillon-LaBrooy A. Braband K.L. Tantawy E. Rampoldi F. Kao Y.S. Boukhallouk F. Velasquez L.N. Mamareli P. Silva L. Damasceno L.E.A. Inhibition of Mitochondrial Translation Ameliorates Imiquimod-Induced Psoriasis-Like Skin Inflammation by Targeting Vγ4+ γδ T Cells J. Investig. Dermatol. 2024 144 844 854.e2 10.1016/j.jid.2023.09.275 37832844 240. Xia X. Cao G. Sun G. Zhu L. Tian Y. Song Y. Guo C. Wang X. Zhong J. Zhou W. GLS1-mediated glutaminolysis unbridled by MALT1 protease promotes psoriasis pathogenesis J. Clin. Investig. 2020 130 5180 5196 10.1172/JCI129269 32831293 PMC7524468 241. He X. Liu R. Fan T. Huang X. Wu C. Su W. Wang T. Ruan Q. Treating Autoimmune Diseases by Targeting IL-23 with Gene-Silencing Pyrrole-Imidazole Polyamide J. Immunol. 2020 204 2053 2063 10.4049/jimmunol.1901215 32169850 242. Hossen M.M. Ma Y. Yin Z. Xia Y. Du J. Huang J.Y. Huang J.J. Zou L. Ye Z. Huang Z. Current understanding of CTLA-4: From mechanism to autoimmune diseases Front. Immunol. 2023 14 1198365 10.3389/fimmu.2023.1198365 37497212 PMC10367421 243. Yu C. Sonnen A.F. George R. Dessailly B.H. Stagg L.J. Evans E.J. Orengo C.A. Stuart D.I. Ladbury J.E. Ikemizu S. Rigid-body ligand recognition drives cytotoxic T-lymphocyte antigen 4 (CTLA-4) receptor triggering J. Biol. Chem. 2011 286 6685 6696 10.1074/jbc.M110.182394 21156796 PMC3057841 244. Hosseini A. Gharibi T. Marofi F. Babaloo Z. Baradaran B. CTLA-4: From mechanism to autoimmune therapy Int. Immunopharmacol. 2020 80 106221 10.1016/j.intimp.2020.106221 32007707 245. Brunner H.I. Tzaribachev N. Vega-Cornejo G. Louw I. Berman A. Calvo Penadés I. Antón J. Ávila-Zapata F. Cuttica R. Horneff G. Subcutaneous Abatacept in Patients with Polyarticular-Course Juvenile Idiopathic Arthritis: Results From a Phase III Open-Label Study Arthritis Rheumatol. 2018 70 1144 1154 10.1002/art.40466 29481737 PMC6032847 246. Lee W.S. Nam K.H. Kim J.H. Kim W.J. Kim J.E. Shin E.C. Kim G.R. Choi J.M. Alleviating psoriatic skin inflammation through augmentation of Treg cells via CTLA-4 signaling peptide Front. Immunol. 2023 14 1233514 10.3389/fimmu.2023.1233514 37818377 PMC10560854 247. Guo W. Xu F. Zhuang Z. Liu Z. Xie J. Bai L. Ebosin Ameliorates Psoriasis-Like Inflammation of Mice via miR-155 Targeting tnfaip3 on IL-17 Pathway Front. Immunol. 2021 12 662362 10.3389/fimmu.2021.662362 33981308 PMC8107364 248. Stenderup K. Rosada C. Dam T.N. Salerno E. Belinka B.A. Kachlany S.C. Resolution of psoriasis by a leukocyte-targeting bacterial protein in a humanized mouse model J. Investig. Dermatol. 2011 131 2033 2039 10.1038/jid.2011.161 21654835 249. Gege C. RORγt inhibitors as potential back-ups for the phase II candidate VTP-43742 from Vitae Pharmaceuticals: Patent evaluation of WO2016061160 and US20160122345 Expert Opin. Ther. Pat. 2017 27 1 8 10.1080/13543776.2017.1262350 27852111 250. Armstrong A.W. Read C. Pathophysiology, Clinical Presentation, and Treatment of Psoriasis: A Review Jama 2020 323 1945 1960 10.1001/jama.2020.4006 32427307 251. Schaper-Gerhardt K. Rossbach K. Nikolouli E. Werfel T. Gutzmer R. Mommert S. The role of the histamine H(4) receptor in atopic dermatitis and psoriasis Br. J. Pharmacol. 2020 177 490 502 10.1111/bph.14550 30460986 PMC7012951 252. Zhu J. Yang T. Tang M. Yang Z. Pei H. Ye H. Tang Y. Cheng Z. Lin P. Chen L. Studies on the anti-psoriasis effects and its mechanism of a dual JAK2/FLT3 inhibitor flonoltinib maleate Biomed. Pharmacother. 2021 137 111373 10.1016/j.biopha.2021.111373 33761599 253. Armstrong A.W. Gooderham M. Warren R.B. Papp K.A. Strober B. Thaçi D. Morita A. Szepietowski J.C. Imafuku S. Colston E. Deucravacitinib versus placebo and apremilast in moderate to severe plaque psoriasis: Efficacy and safety results from the 52-week, randomized, double-blinded, placebo-controlled phase 3 POETYK PSO-1 trial J. Am. Acad. Dermatol. 2023 88 29 39 10.1016/j.jaad.2022.07.002 35820547 254. Deng B.X. Jiang C.Y. Wang P. Liu W.L. Qu X. Zhao Y.M. Chen K. Cai N.N. Tao Y. Distribution and evolution patterns of TCM syndromes in psoriasis J. Tradit. Chin. Med. 2006 47 770 772 10.13288/j.11-2166/r.2006.10.033 255. Liu A.M. Zhang B.X. Zhao W. Xu S.D. Discussion on etiology and pathogenesis of psoriasis vulgaris J. Beijing Univ. Tradit. Chin. Med. 2021 44 266 271 256. Huang G. Yuan X. Hu C.X. Fu J.J. Shi H.Y. Xin Q. Yang M. Gong L.P. Study on the effect of Xijiao Dihuang Decoction on intestinal Th17/Treg imbalance in psoriasis mice based on the gut-immune-skin axis Clin. J. Chin. Med. 2023 35 1569 1572 10.16448/j.cjtcm.2023.0825 257. Chen H. Wang S.P. Therapeutic effect of Compound Indigo Naturalis Capsule on psoriasis vulgaris and its influence on serum IL-2 and IL-8 levels J. Chin. Med. Mater. 2004 27 885 886 10.13863/j.issn1001-4454.2004.11.042 258. Feng J. Xu H.Q. Su B.S. Effect of Compound Qingdai Capsule on c-myc expression in epidermal keratinocytes of psoriasis patients Chin. J. Integr. Tradit. West. Med. 1996 16 146 148 9208535 259. Lei M. Liu R. Yao B. Hu Y.J. Wang W.J. Zhang X.J. Expression of p38MAPK/Th17 signaling pathway-related cytokines in psoriasis vulgaris patients and the regulatory effect of Modified Gentian Liver-Draining Decoction Lishizhen Med. Mater. Medica Res. 2020 31 1342 1347 260. Chen L.H. Clinical observation on Compound Indigo Naturalis Ointment for treating psoriasis vulgaris J. Gansu Coll. Tradit. Chin. Med. 2010 27 45 47 261. Zou J.H. Gong L.P. Huang G. Hu C.X. Yan J. Zhang F.Y. Meta-analysis of acupuncture efficacy for psoriasis vulgaris Hunan J. Tradit. Chin. Med. 2020 36 127 130 10.16808/j.cnki.issn1003-7705.2020.12.053 262. Li B. Li Z. Chen Q. Fang W.H. Zhang C.H. Effects of moving cupping therapy on peripheral blood CD4+ T lymphocyte subsets in plaque psoriasis patients with blood stasis syndrome China J. Tradit. Chin. Med. Pharm. 2021 36 1769 1772 263. Zhou Y. Yang M. Bai X.P. Gao Y. Han H. Guan H.W. Efficacy of NB-UVB phototherapy combined with self-prepared Cool-Blood Anti-Itching decoction herbal bath for psoriasis vulgaris and its effects on hemorheology Mod. J. Integr. Tradit. Chin. West. Med. 2017 26 3023 3026 264. Feng F. Wang Y. Zhao J.X. Di T.T. Meng Y.J. Chen Z.X. Qi C. Hu X.Q. Wang Y.Z. Li P. Effects of fire needle therapy on psoriasiform skin lesions and STAT3 pathway in imiquimod-induced mice Chin. Acupunct. Moxibustion 2022 42 541 548 10.13703/j.0255-2930.20211112-k0005 35543945 265. Song X. Tang S.W. Jiang W.C. Yang Y. Wang Q.L. Xie S.Q. Chinese herbal bath combined with NB-UVB phototherapy for stable plaque psoriasis and its impact on patients’ quality of life Chin. J. Dermatovenereology 2017 31 757 783 757–759+783 10.13735/j.cjdv.1001-7089.201612075 266. Guang Y.J. Clinical observation of NB-UVB combined with Chinese herbal fumigation for psoriasis vulgaris Med. Diet Health 2020 18 28 30 28+30 267. Chen C.F. Zheng Y.Z. Jia L.Y. Yu T.G. Clinical study of Shugan Jieyu Capsule in treating psoriasis vulgaris Chin. J. Clin. Pharmacol. 2017 33 222 225 10.13699/j.cnki.1001-6821.2017.03.009 268. Dai X.R. Peng F.F. Miao Y.X. Dong M. Jiang G.F. Nursing observation on the interventional effects of Five-Element Jue-tone music therapy for psoriasis patients with Qi-stagnation constitution J. Hunan Univ. Chin. Med. 2018 38 715 718 269. Ramessur R. Dand N. Langan S.M. Saklatvala J. Fritzsche M.C. Holland S. Arents B.W.M. McAteer H. Proctor A. McMahon D. Defining disease severity in atopic dermatitis and psoriasis for the application to biomarker research: An interdisciplinary perspective Br. J. Dermatol. 2024 191 14 23 10.1093/bjd/ljae080 38419411 PMC11188926 270. Langley R.G. Krueger G.G. Griffiths C.E. Psoriasis: Epidemiology, clinical features, and quality of life Ann. Rheum. Dis. 2005 64 (Suppl. 2) ii18 ii23 10.1136/ard.2004.033217 15708928 PMC1766861 271. Chen L. Su M. Jin Q. Wang C.G. Assani I. Wang M.X. Zhao S.F. Lv S.M. Wang J.W. Sun B. Discovery of N-(2-benzyl-4-oxochroman-7-yl)-2-(5-(ethylsulfonyl) pyridin-2-yl) acetamide (b12) as a potent, selective, and orally available novel retinoic acid receptor-related orphan receptor γt inverse agonist Bioorganic Chem. 2022 119 105483 10.1016/j.bioorg.2021.105483 34906860 272. Gladman D. Rigby W. Azevedo V.F. Behrens F. Blanco R. Kaszuba A. Kudlacz E. Wang C. Menon S. Hendrikx T. Tofacitinib for Psoriatic Arthritis in Patients with an Inadequate Response to TNF Inhibitors N. Engl. J. Med. 2017 377 1525 1536 10.1056/NEJMoa1615977 29045207 273. Orbai A.M. Fiorentino D. Perin J. Darrah E. Yang Q. Gutierrez-Alamillo L. Bingham C.O. Petri M. Rosen A. Casciola-Rosen L. SOX-5 Transcription Factor: A Novel Psoriatic Autoantigen Preferentially Found in Women ACR Open Rheumatol. 2024 6 807 819 10.1002/acr2.11740 39218617 PMC11638130 274. Yan K. Li F. Bi X. Han L. Zhang Z. Chen R. Li Y. Zhang L. Wang X. Li L. Efficacy and safety of vunakizumab in moderate-to-severe chronic plaque psoriasis: A randomized, double-blind, placebo-controlled phase 3 trial J. Am. Acad. Dermatol. 2025 92 92 99 10.1016/j.jaad.2024.09.031 39332633 275. Armstrong A.W. Reich K. Foley P. Han C. Song M. Shen Y.K. You Y. Papp K.A. Improvement in Patient-Reported Outcomes (Dermatology Life Quality Index and the Psoriasis Symptoms and Signs Diary) with Guselkumab in Moderate-to-Severe Plaque Psoriasis: Results from the Phase III VOYAGE 1 and VOYAGE 2 Studies Am. J. Clin. Dermatol. 2019 20 155 164 10.1007/s40257-018-0396-z 30417277 PMC6513809 276. Gordon K.B. Langley R.G. Leonardi C. Toth D. Menter M.A. Kang S. Heffernan M. Miller B. Hamlin R. Lim L. Clinical response to adalimumab treatment in patients with moderate to severe psoriasis: Double-blind, randomized controlled trial and open-label extension study J. Am. Acad. Dermatol. 2006 55 598 606 10.1016/j.jaad.2006.05.027 17010738 277. Berstein G. Zhang Y. Berger Z. Kieras E. Li G. Samuel A. Yeoh T. Dowty H. Beaumont K. Wigger-Alberti W. A phase I, randomized, double-blind study to assess the safety, tolerability and efficacy of the topical RORC2 inverse agonist PF-06763809 in participants with mild-to-moderate plaque psoriasis Clin. Exp. Dermatol. 2021 46 122 129 10.1111/ced.14412 32767679 PMC7756278 278. Chen L. Zhao W. Compound Indigo Naturalis Ointment in the Treatment of 60 Cases of Plaque Psoriasis Guangming J. Chin. Med. 2014 29 1413 1414 Figure 1 Schematic diagram of genetic and environmental factors driving immune activation in psoriasis. Environmental triggers (including infections, lifestyle factors, climate, hormonal fluctuations, and psychological stress) activate the immune system. Key genetic factors involve antigen presentation pathways (e.g., ERAP1 trimming antigenic peptides for presentation by HLA-C*06), innate immune sensors (e.g., RIG-I), and cytokine signaling (e.g., IL-12p40/IL-23R). This leads to immune activation characterized by CD8 + + Figure 2 Schematic diagram of dysregulated immune responses in psoriasis. In genetically predisposed individuals, skin injury or infectious triggers induce neutrophil infiltration, releasing neutrophil extracellular traps (NETs) that activate the TLRs-IFN-α pathway in dendritic cells (DCs), while exosomes and matrix metalloproteinase-9 (MMP9) further enhance the secretion of cytokines by keratinocytes (KCs). KCs release antimicrobial peptides (AMPs), cytokines, and alarmins, recruiting other immune cells to the inflammatory site. Additionally, DCs and Langerhans cells (LCs) drive T-cell differentiation via IL-23. CD4 + + ijms-26-09233-t002_Table 2 Table 2 Differential Diagnosis of Psoriasis. Differential Diagnosis Item Distinctive Features Commonly Affected Areas Atopic dermatitis Lesions may have ill-defined borders, but lichenified plaques with relatively clear borders may develop due to scratching Flexural surfaces of the body Seborrheic dermatitis Dandruff presents as greasy, yellow scales or crusts; the degree of underlying erythema varies and is often more pronounced on the face Sebaceous gland-rich regions Tinea capitis Often accompanied by hair loss and broken hairs; inflammatory reactions (e.g., pustules, abscesses) may be present; fungal microscopy is positive Scalp, hairline Secondary syphilis Diverse rash morphology (can mimic various skin diseases); copper-red papules or macules; positive syphilis serological tests Trunk, limbs Lichen planus Violaceous, polygonal, flat-topped papules with white reticulated streaks (Wickham’s striae) on the surface Wrists, forearms, ankles, oral mucosa, genitalia Chronic eczema Lesions have ill-defined borders; often presents with lichenification (skin thickening and accentuated skin markings) and hyperpigmentation; intense pruritus Variable sites Rheumatoid arthritis Rheumatoid factor (RF) is often positive; typically involves small joints (wrists, metacarpophalangeal, proximal interphalangeal joints) symmetrically; prolonged morning stiffness; absence of psoriatic skin lesions and nail changes Small joints Candidiasis/Fungal infection Well-demarcated red patches, potentially with satellite lesions; scales are non-silvery; positive fungal microscopy or culture Skin folds Pityriasis rosea Herald patch: a larger initial lesion appears 1–2 weeks before the generalized eruption; lesions align with skin cleavage lines (“Christmas-tree” distribution); collarette scaling. Trunk, proximal limbs Cutaneous T-cell lymphoma Early stages may present with solitary or multiple erythematous to dusky red patches/plaques, with thin, non-silvery scales; may progress to plaques and nodules; diagnosis is confirmed by pathological biopsy. Can occur anywhere on the body ",
  "metadata": {
    "Title of this paper": "Compound Indigo Naturalis Ointment in the Treatment of 60 Cases of Plaque Psoriasis",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470368/"
  }
}