{
  "title": "Paper_116",
  "abstract": "pmc Saf Health Work Saf Health Work 1859 shaw Safety and Health at Work 2093-7911 2093-7997 Occupational Safety and Health Research Institute PMC12490677 PMC12490677.1 12490677 12490677 10.1016/j.shaw.2024.06.004 S2093-7911(24)00050-7 1 Original Article Occupational Hazards in Lead-acid Battery Factories in Bangladesh: Assessing Excess Heat, Noise, Chemical Exposures, and Health Impacts on Workers Das Shobhan 1 Nath Tilak C. 2 Rahman Matiur 3 Uddin Jamal 4 7 Naher Naznin 5 Akter Margia 6 Rahman Masudur mmrahman.sau@sau.ac.bd 6 ∗ Adhikari Atin 1 1 2 3 4 5 6 7 ∗ mmrahman.sau@sau.ac.bd 9 2025 06 7 2024 16 3 498203 289 296 8 8 2023 5 2 2024 28 6 2024 06 07 2024 03 10 2025 03 10 2025 © 2024 Occupational Safety and Health Research Institute. Published by Elsevier B.V. on behalf of Institute, Occupational Safety and Health Research Institute, Korea Occupational Safety and Health Agency. 2024 Occupational Safety and Health Research Institute https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Background Lead-acid battery (LAB) manufacturing is growing in Bangladesh because of the expanding automotive industry and low lead prices. Although these factories employ a big workforce, the working environment has led to concerns about the possible health risks for employees. This study aimed to address this issue by investigating workplace chemical and physical hazards in three LAB industries and evaluating health outcomes among workers. Methods A cross-sectional study was conducted among 72 LAB factory workers, and participants were recruited by simple random sampling. A validated questionnaire was used to collect information on self-reported exposures to physical and chemical risks and related health effects. Data analysis was performed by using statistical software SPSS version 25. Results The age and work experience (Mean ± SD) of the participants were 34.2 ± 7.7 and 10.0 ± 5.7 years, respectively. High workplace temperature and noise from machinery, chemical odors, and skin exposure to acid (H 2 4 Conclusion Our study findings indicate that workers in LAB factories in Bangladesh are exposed to extreme temperatures, hazardous materials, and uncomfortable levels of noise, which can lead to serious health risks. To ensure the safety and well-being of employees, the LAB manufacturing sector in Bangladesh requires the immediate implementation of proper occupational health and safety standards. Keywords Bangladesh Hazard assessment Lead exposure Occupational safety Workplace environment pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction Since Roman times, lead ( Pb 1 2 The rapid rise of industrialization is becoming a part of a developing country like Bangladesh. Lead-acid battery (LAB) factories are a growing sector in Bangladesh. Many local and foreign investors are keeping a role in LAB production in Bangladesh. Nowadays acid batteries are used in various sectors for our daily necessities like, solar plants, automobile cars, easy bikes, auto-rickshaws, uninterruptible power sources, etc. Bangladesh has many factories that focus on exports of LAB products. Most of the major LAB companies in Bangladesh both produce and export LABs for domestic and foreign markets [ 3 3 Pure Earth’s investigators have identified eighty-five (85) sites in Bangladesh that were categorized as pollution sources (LAB recycling, manufacturing, repair, etc.) from February 2016 to January 2018 [ 4 5 6 7 7 7 8 9 10 11 12 13 14 2 Materials and methodology 2.1 Study design and area A cross-sectional study design was carried out to evaluate the effects of work patterns and the impact of workplace environment on the health of LAB-producing factory workers. This study was conducted in Gazipur district of Bangladesh. The geographical location of the study area was situated within a one-kilometer radius around latitude 23.99 and longitude 90.25. Gazipur district is well-known as an industrial zone to produces a wide range of goods. These production areas play a significant role in Bangladesh's economy and support exports to other countries. The research was conducted in September and October of 2019. The top four LAB factories of Gazipur district have been chosen for this investigation. The range of the workforce of these factories was 300–600. 2.2 Ethical approval The experimental design and protocol were reviewed and approved by the Ethical Committee of Sylhet Agricultural University, Sylhet 3100, Bangladesh. 2.3 Participant’s selection Selecting participants was done by simple random sampling method. In the Gazipur district there were twenty-one LAB-producing factories where near about N = 1500 workers are directly or indirectly engaged in LAB production. The sample size has been calculated by a formula [Sample Size = Z 2 . P ( 1 − p ) e 2 1 + Z 2 . P ( 1 − p ) e 2 N 2.4 Study tools and data collection For the data collection tools, a well-organized structured questionnaire has been used. During the data collection, a face-to-face interview was performed. A combination of open-end (thirty-five questions) and close-end (six questions) questions were used in the questionnaire. A total of forty-one questions were used in the questionnaire. The forty-one questions have been divided into four sections (Sections A-D) where Section A included basic information about the participants. Section B involved in participants’ work patterns. Section C incorporated on participants’ workplace environment. Section D takes into regarding the health outcomes of the workers. All questions in the Section D were regarding the most common lead exposure symptoms. In Section C, six environment-related questions (like presence or absence of discomfort temperature, humidity, smoke, sound, dust, and chemical smell) are answered by the participants themselves. Prior to the interview, the field research assistant took the written consent from the participants and mentioned objectives of this research to participants. All the data were collected from inside the factory while the participants were working. Every interview lasted roughly fifteen minutes. No clinical information and biological samples were collected for this study. Within sixty days, seven field trips were used to gather all the data. To guarantee the quality of the data, field research assistants received expert training in data collection, data entry, record keeping, interviewing, and motivational speech. The questionnaire was translated into Bengali before taking the interview. 2.5 Analysis of data For the statistical analysis, IBM SPSS version 25 was used. Frequency and percentage were used to interpret the categorical variables. The mean (M) and standard deviation were used to interpret the continuous variables (SD). All the analyses were calculated in two steps. In the first step, we calculated the frequency and percentile of the variables. Then we sorted out the top nine frequencies of work patterns and workplace environments that were harmful to the participants. Second, we applied the descriptive statistics of the top nine lead exposure-related syndromes with the top work pattern and workplace environment. 3 Results 3.1 Participants details The categorization of participants by designation and work section were presented in Fig. 1 Fig. 2 Fig. 2 Fig. 1 Table 1 Table 1 Table 2 Table 1 Fig. 1 Frequencies and percentages of workers are categorized by working sections. Fig. 1 Fig. 2 Percentages of participants according to job designations. Fig. 2 Table 1 Participants’ details and work patterns Table 1 Variables Frequency Percent n The age group of participants <30 years 25 34.7 30–40 years 32 44.4 >40 years 15 20.8 The education level of the participants Primary school 5 6.9 High school 36 50.0 Higher secondary school 27 37.5 University 4 5.6 Work experience in a battery factory <5 years 20 27.8 5–10 year 25 34.7 >10 year 27 37.5 Where did you work before this job? First job 45 62.5 NRMG ∗ 17 23.6 RMG † 8 11.1 Battery factory 2 2.8 The employment type of the participants Permanent 66 91.7 Daily wager 6 8.3 Participate in overtime work Yes 22 30.6 No 50 69.4 Work with automatic machine Yes 34 47.2 No 38 52.8 Seating facilities in the workplace Standing 63 87.5 Seating 9 12.5 Use of PPE during work time Yes 68 94.4 No 4 5.6 Worked at night Yes 32 44.4 No 40 55.6 Lived on factory premises Yes 3 4.2 No 69 95.8 ∗ NRMG: Non-Ready-Made Garments. † RMG: Ready Made Garments. Table 2 Workplace environment Table 2 Variables Frequency Percent ( n Uncomfortable workplace room temperature Absent 34 47.2 Present 38 52.8 Workplace acid (H 2 SO 4 ) handled Yes 15 20.8 No 57 79.2 Smoke or fume present in the workplace Absent 63 87.5 Present 9 12.5 Uncomfortable workplace humidity Absent 58 80.6 Present 14 19.4 Uncomfortable workplace dust Absent 61 84.7 Present 11 15.3 Uncomfortable workplace sound Absent 34 47.2 Present 38 52.8 Presence of chemical smell in workplace No 35 48.6 Yes 37 51.4 3.2 Work pattern In contrast to the 8.3% of participants who worked on a daily basis when this survey was being conducted, 91.7% of participants held permanent employment and 30.6% participants worked overtime. It’s important to note that 47.2% of participants used an automated machine. Only 12.5% of workers had access to seats while they were at work, leaving 87.5% of participants without such facilities. According to our observations, 94.4% of employees wore personal protective equipment (PPE) such as gloves, boots, goggles, earmuffs, and masks during work. For this study, we did not collect individual data on the use rate of these PPEs. Furthermore, 44.4% of the workers reported that they worked during night shifts, as shown in Table 1 3.3 Workplace environment According to our study findings, more than half of the workers (52.8%) reported feeling uncomfortable due to room temperature in their workplaces, while 12.5% said that there was the presence of smoke or fumes in their workplaces. During their workdays, 20.8% of the participants handled sulfuric acid (H 2 4 Table 2 3.4 Health condition of participants The participants were asked about the most common symptoms of lead poisoning and accidents or injuries in order to determine their general health. Insomnia (25.0%), joint discomfort (38.9%), memory loss (19.4%), low back pain (47.2%), skin illnesses (21.8%), weakness (47.2%), hypertension (19.4%), and hand injuries (9.7%) were mentioned by participants as occupational issues ( Table 3 Table 4 Table 3 Lead exposure syndromes of participants Table 3 Variables Frequency Percent ( n Insomnia No 54 75.0 Yes 18 25.0 Anorexia No 66 91.7 Yes 6 8.3 Bodyweight loss No 67 93.1 Yes 5 6.9 Abdominal pain No 59 81.9 Yes 13 18.1 Nausea No 66 91.7 Yes 6 8.3 Constipation No 63 87.5 Yes 9 12.5 Hearing loss No 66 91.7 Yes 6 8.3 Joint pain No 44 61.1 Yes 28 38.9 Memory loss No 58 80.6 Yes 14 19.4 Headache No 61 84.7 Yes 11 15.3 Respiratory problem No 68 94.4 Yes 4 5.6 Low back pain No 38 52.8 Yes 34 47.2 Eyesight problem No 58 80.6 Yes 14 19.4 Skin diseases No 70 97.2 Yes 2 2.8 Kidney disease No 70 97.2 Yes 2 2.8 Physical weakness No 38 52.8 Yes 34 47.2 Tremor No 71 98.6 Yes 1 1.4 Hypertension No 58 80.6 Yes 14 19.4 Low blood pressure No 62 86.1 Yes 10 13.9 Injury report Yes 12 16.7 No 60 83.3 Types of injury Hand injured 7 9.7 Hand broken 1 1.4 Leg injured 3 4.2 Eye injured 1 1.4 Table 4 Section-wise, the nine topmost lead exposure-related syndromes Table 4 Section Insomnia n Abdomen pain n Joint pain n Memory loss n Headache n LBP ‡ n ESP § n Weakness n HBP || n No (%) Yes (%) No (%) Yes (%) No (%) Yes (%) No (%) Yes (%) No (%) Yes (%) No (%) Yes (%) No (%) Yes (%) No (%) Yes (%) No (%) Yes (%) Pasting 6 (8.3) 0 (0.0) 6 (8.3) 0 (0.0) 6 (8.3) 0 (0.0) 6 (8.3) 0 (0.0) 6 (8.3) 0 (0.0) 5 (6.9) 1 (1.4) 5 (6.9) 1 (1.4) 6 (8.3) 0 (0.0) 5 (6.9) 1 (1.4) Assembling 15 (20.8) 4 (5.6) 16 (22.2) 3 (4.2) 10 (13.9) 9 (12.5) 15 (20.8) 4 (5.6) 15 (20.8) 4 (5.6) 9 (12.5) 10 (13.9) 18 (25.0) 1 (1.4) 8 (11.1) 11 (15.3) 15 (20.8) 4 (5.6) Loading 0 (0.0) 2 (2.8) 0 (0.0) 2 (2.8) 1 (1.4) 1 (1.4) 1 (1.4) 1 (1.4) 0 (0.0) 2 (2.8) 1 (1.4) 1 (1.4) 1 (1.4) 1 (1.4) 0 (0.0) 2 (2.8) 2 (2.8) 0 (0.0) Formation 1 (1.4) 0 (0.0) 1 (1.4) 0 (0.0) 1 (1.4) 0 (0.0) 1 (1.4) 0 (0.0) 1 (1.4) 0 (0.0) 1 (1.4) 0 (0.0) 1 (1.4) 0 (0.0) 1 (1.4) 0 (0.0) 1 (1.4) 0 (0.0) Security 3 (4.2) 0 (0.0) 3 (4.2) 0 (0.0) 3 (4.2) 0 (0.0) 3 (4.2) 0 (0.0) 3 (4.2) 0 (0.0) 2 (2.8) 1 (1.4) 2 (2.8) 1 (1.4) 3 (4.2) 0 (0.0) 3 (4.2) 0 (0.0) Recy. plant 3 (4.2) 0 (0.0) 3 (4.2) 0 (0.0) 3 (4.2) 0 (0.0) 3 (4.2) 0 (0.0) 3 (4.2) 0 (0.0) 2 (2.8) 1 (1.4) 3 (4.2) 0 (0.0) 2 (2.8) 1 (1.4) 3 (4.2) 0 (0.0) HR ∗ 5 (6.9) 2 (2.8) 7 (9.7) 0 (0.0) 6 (8.3) 1 (1.4) 4 (5.6) 3 (4.2) 7 (9.7) 0 (0.0) 5 (6.9) 2 (2.8) 4 (5.6) 3 (4.2) 6 (8.3) 1 (1.4) 5 (6.9) 2 (2.8) Plate prep. 11 (15.3) 5 (6.9) 14 (19.4) 2 (2.8) 8 (11.1) 8 (11.1) 15 (20.8) 1 (1.4) 16 (22.2) 0 (0.0) 9 (12.5) 7 (9.7) 12 (16.7) 4 (5.6) 8 (11.1) 8 (11.1) 15 (20.8) 1 (1.4) QC † 2 (2.8) 0 (0.0) 2 (2.8) 0 (0.0) 1 (1.4) 1 (1.4) 2 (2.8) 0 (0.0) 1 (1.4) 1 (1.4) 1 (1.4) 1 (1.4) 1 (1.4) 1 (1.4) 2 (2.8) 0 (0.0) 1 (1.4) 1 (1.4) Store 0 (0.0) 2 (2.8) 2 (2.8) 0 (0.0) 2 (2.8) 0 (0.0) 1 (1.4) 1 (1.4) 2 (2.8) 0 (0.0) 1 (1.4) 1 (1.4) 1 (1.4) 1 (1.4) 0 (0.0) 2 (2.8) 1 (1.4) 1 (1.4) Charging 3 (4.2) 2 (2.8) 2 (2.8) 3 (4.2) 0 (0.0) 5 (6.9) 3 (4.2) 2 (2.8) 3 (4.2) 2 (2.8) 0 (0.0) 5 (6.9) 5 (6.9) 0 (0.0) 0 (0.0) 5 (6.9) 2 (2.8) 3 (4.2) Maintain 3 (4.2) 1 (1.4) 1 (1.4) 3 (4.2) 2 (2.8) 2 (2.8) 2 (2.8) 2 (2.8) 2 (2.8) 2 (2.8) 1 (1.4) 3 (4.2) 3 (4.2) 1 (1.4) 0 (0.0) 4 (5.6) 4 (5.6) 0 (0.0) Casting 2 (2.8) 0 (0.0) 2 (2.8) 0 (0.0) 1 (1.4) 1 (1.4) 2 (2.8) 0 (0.0) 2 (2.8) 0 (0.0) 1 (1.4) 1 (1.4) 2 (2.8) 0 (0.0) 2 (2.8) 0 (0.0) 1 (1.4) 1 (1.4) Total 54 (75.0) 18 (25.0) 59 (81.9) 13 (18.1) 44 (61.1) 28 (38.9) 58 (80.6) 14 (19.4) 61 (84.7) 11 (15.3) 38 (52.8) 34 (47.2) 58 (80.6) 14 (19.4) 38 (52.8) 34 (47.2) 58 (80.6) 14 (19.4) Plate prep., plate preparation; Recy. plant, recycling plant. ∗ HR: Human Resources. † QC: Quality Control. ‡ LBP: Low Back Pain. § ESP: Eyesight Problem. || HBP: High Blood Pressure. 4 Discussion The present study aimed to assess the occupational hazards faced by workers in LAB factories in Bangladesh, focusing on excess heat, noise, chemical exposures, and their potential health impacts. The findings from this research shed light on the alarming conditions prevailing in these factories, emphasizing the urgent need for interventions to safeguard the health and well-being of the workers. According to the designation, thirteen broad categories of participants have been detected during the conduct of this study. A maximum of 61% of participants were technicians. The second maximum 8.3% of participants were operators. Thirteen categories of work sections have been counted among the LAB factories. More than one-fourth of the participants were from the assembly section. The second maximum, 22.2% of participants were from the plate preparation section. To measure the education status, half of the participants had high school level education. There was evidence that the maximum LAB-producing worker’s education was up to class ten secondary level [ [8] [15] More than half of the participants in our study worked in workplaces with uncomfortable room temperatures. These workplaces with high room temperatures showed evidence of occupational heat stress and could impair kidney health [ 16 2 4 [17] [18] 15 19 20 Among the nineteen lead exposure symptoms, only nine (insomnia, abdominal pain, joint pain, memory loss, LBP, ESP, physical weakness, hypertension) symptoms were prominent among the participants. This study also revealed that 9.7% of the participants had minor injuries or accidents. Among all the work sections, assembling section was the most significantly vulnerable section for lead exposure where we found all prominent symptoms of lead exposure among the participants. In the assembling section, 15.3% of participants had physical weakness during conducting this surveillance. The formation section was the safest section of the factory where nobody had the nine topmost symptoms of lead exposure. The plate preparation section was the second most dangerous section of the battery-producing factory. Chemical smell and lead exposure had a positive association with clinical cardiovascular diseases like hypertension [ [16] [21] 2 4 22 [15] [17] 6 23 The importance of our result was to identify work patterns that were harmful to the LAB workers as well as identification of workplace environments that had several adverse impacts on health. Among twenty-one health-related questions a total nineteen lead exposure-related questions have been asked and remaining two questions were enquired regarding the identification of workplace accident or injury. We also identified the vulnerable section of the LAB-producing factory. This research focuses on the relationship between presence of exposure to certain adverse conditions and chemical and physical agents and related potential adverse health outcomes in LAB factory workplaces and among workers with low socio-economic status and education. Although this work is currently in its preliminary stages and lacks sufficient quantitative data, it is the first of its kind to be conducted by occupational health researchers in Bangladesh. As a result, it has significant value for the field of occupational health and safety research in the country. We recognize the study’s limitations and acknowledge that future researchers will need to collect additional health outcomes’ data and conduct exposure assessment with new generation environmental monitoring devices. Despite the limited data currently available, this type of research is incredibly valuable in improving occupational health and safety in Bangladesh, particularly for the LAB-related industrial sector. Both work patterns and workplace environments had impact on the health of workers. Proper ventilation can reduce the air lead level to keep exposure levels within the occupational exposure limits [ 24 25 26 While this study provides valuable insights into the occupational hazards faced by workers in LAB factories in Bangladesh, some limitations should be acknowledged. The cross-sectional design restricted our ability to establish causality between exposures and health outcomes. All the answers of the participants were based only on their assumptions or feelings, but we did not test their answers in terms of work patterns, workplace environment, and their health issues. Additionally, relying on self-reported data for health symptoms might introduce recall bias. Likewise, to identify work patterns and workplace environmental impact on the health of the participants, some close-end questions did not expose the participants’ knowledge properly because participants may choose their answer just under the assumption. The use of objective health assessments could improve the accuracy of our findings in future research. In conclusion, this manuscript highlights the significant occupational hazards faced by workers in LAB factories in Bangladesh and emphasizes the urgent need for improved workplace safety measures. The comprehensive assessment conducted in this study revealed that workers in these factories are exposed to excess heat, high noise levels, and hazardous chemicals, leading to potential health impacts on their well-being. Our preliminary research can provide valuable insights to policymakers, industry stakeholders, and health professionals on how to reduce hazards in LAB factories and minimize related health risks for workers. For example, the NOSHRTI (National Occupational Safety and Health Research and Training Institute) and the DIFE (Department for Inspections of Factories and Establishments) of Bangladesh can collaborate to support the LAB factory workers to ensure a decent workplace and sound occupational health. The NOSHTRI can identify the potential hazards and lead exposure-related health risks in this industry sector and provide recommendations and reports accordingly. Conversely, the DIFE is responsible for enforcing labor laws related to occupational health and safety to ensure that factories comply with green LAB regulations. Therefore, the DIFE can train managers in violated LAB factories on occupational health and safety based on the data they obtain from the NOSHTRI in Bangladesh. Author’s contributions Das S, Akter M, and Rahman MM designed and conceived the experiment; Das S, Naher N, Adhikari A, and Uddin MJ analyzed and interpreted the data; Das S, and Adhikari A prepared the draft; Rahman MM, Nath TC, and Adhikari A revised the manuscript critically. All authors approved the final version of the manuscript before submission. Funding No specific funding was received for this study. Conflicts of interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. References 1 Beck B.D. An update on exposure and effects of lead Fundam Appl Toxicol 16 1992 1 16 10.1016/0272-0590(92)90189-o 1601199 2 Herman D.S. Geraldine M. Venkatesh T. Evaluation, diagnosis , and treatment of lead poisoning in a patient with occupational lead exposure: a case presentation Case presentation J Occup Med Toxicol 4 2007 1 4 10.1186/1745-6673-2-7 PMC2000868 17718907 3 Islam M. Khalekuzzaman M. Kabir S. Rana M. A study on recycling used lead-acid batteries (ULABs) in Bangladesh Proceedings of the WasteSafe 2021 2021 Khulna, Bangladesh:Paper ID 30 4 UNIDO Toxic sites identification program in Bangladesh 2018 DCI-ENV/2015/371157 5 Gupt Y. Sahay S. Managing used lead acid batteries in India: evaluation of EPR-DRS approaches J Health Pollut 5 8 2015 52 63 30524769 10.5696/i2156-9614-5-8.52 PMC6221476 6 Arif M. Islam M.T. Shekhar H.U. Lead induced oxidative DNA damage in battery-recycling child workers from Bangladesh Toxicol Ind Health 34 4 2018 213 218 29519200 10.1177/0748233717754163 7 Chen L. Xu Z. Liu M. Huang Y. Fan R. Su Y. Hu G. Peng X. Peng X. Lead exposure assessment from study near a lead-acid battery factory in China Sci Total Environ 429 2012 191 198 22578522 10.1016/j.scitotenv.2012.04.015 8 Ahmad S.A. Khan M.H. Khandker S. Sarwar A.F. Yasmin N. Faruquee M.H. Yasmin R. Blood lead levels and health problems of lead acid battery workers in Bangladesh Scientific World J 2014 2014 974104 10.1155/2014/974104 PMC3953567 24707223 9 Rudolph L. Sharp D.S. Samuels S. Perkins C. Rosenberg J. Environmental and biological monitoring for lead exposure in California workplaces Am J Public Health 80 8 1990 921 925 2368850 10.2105/ajph.80.8.921 PMC1404773 10 Paoliello M.M. De Capitani E.M. Occupational and environmental human lead exposure in Brazil Environ Res 103 2 2007 288 297 16919621 10.1016/j.envres.2006.06.013 11 Matte T.D. Figueroa J.P. Burr G. Flesch J.P. Keenlyside R.A. Baker E.L. Lead exposure among lead-acid battery workers in Jamaica Am J Ind Med 16 2 1989 167 177 2773946 10.1002/ajim.4700160208 12 Awad el Karim M.A. Hamed A.S. Elhaimi Y.A. Osman Y. Effects of exposure to lead among lead-acid battery factory workers in Sudan Arch Environ Health 41 4 1986 261 265 3767435 10.1080/00039896.1986.9938342 13 Agrawal R. Tripathi G.M. Saxena V. Singh N. Sharva V. Yadav K. Assessment of dental erosion status among battery factory workers in Mandideep, India Int J Occup Saf Heal 4 2014 11 15 14 Amin W.M. Al-Omoush S.A. Hattab F.N. Oral health status of workers exposed to acid fumes in phosphate and battery industries in Jordan Int Dent J 51 3 2001 169 174 11563682 10.1002/j.1875-595x.2001.tb00835.x 15 Frank J.J. Poulakos A.G. Tornero-Velez R. Xue J. Systematic review and meta-analyses of lead (Pb) concentrations in environmental media (soil, dust, water, food, and air) reported in the United States from 1996 to 2016 Sci Total Environ 694 2019 133489 10.1016/j.scitotenv.2019.07.295 PMC6918466 31756826 16 Sadeghniiat-haghighi K. Yousefian M. Aminian O. Najafi A. Association between blood lead level and sleep quality in lead- zinc factories in zanjan: a cross-sectional study J Sleep Sci 1 2016 19 22 17 Nerbass F.B. Pecoits-Filho R. Clark W.F. Sontrop J.M. McIntyre C.W. Moist L. Occupational heat stress and kidney health: from farms to factories Kidney Int Rep 2 6 2017 998 1008 29270511 10.1016/j.ekir.2017.08.012 PMC5733743 18 Gamble J. Jones W. Hancock J. Meckstroth R.L. Epidemiological-environmental study of lead acid battery workers. III. Chronic effects of sulfuric acid on the respiratory system and teeth Environ Res 35 1 1984 30 52 6386452 10.1016/0013-9351(84)90112-9 19 Koenig J.Q. Pierson W.E. Horike M. The effects of inhaled sulfuric acid on pulmonary function in adolescent asthmatics Am Rev Respir Dis 128 2 1983 221 225 6881680 10.1164/arrd.1983.128.2.221 20 Edelman D.A. Laryngeal cancer and occupational exposure to asbestos Int Arch Occup Environ Health 61 4 1989 223 227 2656525 10.1007/BF00381418 21 Navas-Acien A. Guallar E. Silbergeld E.K. Rothenberg S.J. Lead exposure and cardiovascular disease--a systematic review Environ Health Perspect 115 3 2007 472 482 17431501 10.1289/ehp.9785 PMC1849948 22 Milton R. Mathieu L. Hall A.H. Maibach H.I. Chemical assault and skin/eye burns: two representative cases, report from the Acid Survivors Foundation, and literature review Burns 36 6 2010 924 932 20080356 10.1016/j.burns.2009.10.020 23 Lack L.C. Gradisar M. Van Someren E.J. Wright H.R. Lushington K. The relationship between insomnia and body temperatures Sleep Med Rev 12 4 2008 307 317 18603220 10.1016/j.smrv.2008.02.003 24 Dyosi S. Evaluation of preventive and control measures for lead exposure in a South African lead-acid battery recycling smelter J Occup Environ Hyg 4 10 2007 762 769 17694442 10.1080/15459620701566324 25 Kosnett M.J. Wedeen R.P. Rothenberg S.J. Hipkins K.L. Materna B.L. Schwartz B.S. Hu H. Woolf A. Recommendations for medical management of adult lead exposure Environ Health Perspect 115 3 2007 463 471 17431500 10.1289/ehp.9784 PMC1849937 26 Dahodwalla H. Herat S. Cleaner production options for lead-acid battery manufacturing industry J Clean Prod 8 2000 133 142 Appendix A Supplementary data The following is the Supplementary data to this article: Multimedia component 1 Multimedia component 1 Acknowledgments The authors want to give special thanks to Mr. Bigyan Jyoti Chakma, Md. Shahed Parvej for supporting us during data collection and communication with the factory’s management. Another special thanks to Ms. Pratishtha Barua for helping us in developing the consent paper and questionnaire. Another heartfelt thanks to Md. Monjil Hasan for his nice support for logistics management and data collection while conducting this study. A cordial thanks to the management and factory owner who permitted us to collect data from their employees. Appendix A Supplementary data to this article can be found online at https://doi.org/10.1016/j.shaw.2024.06.004 ",
  "metadata": {
    "Title of this paper": "Cleaner production options for lead-acid battery manufacturing industry",
    "Journal it was published in:": "Safety and Health at Work",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490677/"
  }
}