{
  "title": "Paper_1114",
  "abstract": "pmc Diseases Diseases 3206 diseases diseases Diseases 2079-9721 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468459 PMC12468459.1 12468459 12468459 41002717 10.3390/diseases13090281 diseases-13-00281 1 Case Report The Rehabilitation of a Patient with Acute Transverse Myelitis After HPV Vaccination—A Case Report Kowalik Kornelia 1 * https://orcid.org/0009-0009-6218-2632 Niebrzydowski Piotr 2 https://orcid.org/0009-0004-0885-4585 Kropidłowska Julia 1 https://orcid.org/0009-0009-5309-442X Kvinen Alexandra 1 Kusiak-Kaczmarek Małgorzata 2 https://orcid.org/0000-0002-1969-8379 Szalewska Dominika 1 * Malaguarnera Michele Academic Editor 1 2 pniebrzydowski@uck.gda.pl * kornelia.kowalik@gumed.edu.pl dominika.szalewska@gumed.edu.pl 01 9 2025 9 2025 13 9 497627 281 24 7 2025 21 8 2025 25 8 2025 01 09 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Acute transverse myelitis (ATM) is a rare, immune-mediated disorder of the spinal cord characterized by sensory, motor, and autonomic dysfunction. Although the human papillomavirus (HPV) vaccine is widely regarded as safe, isolated reports have suggested a potential temporal association with autoimmune neurological events, including ATM. We present a case of a 21-year-old woman who developed ATM two weeks following administration of the first dose of the HPV vaccine (Cervarix). The clinical presentation included rapid-onset paraparesis, sensory deficits, and sphincter dysfunction. An MRI revealed a T2-hyperintense lesion at the Th10–Th12 level. A cerebrospinal fluid analysis showed elevated protein levels. The patient underwent corticosteroid therapy, plasmapheresis, and IVIG, followed by a comprehensive, individualized rehabilitation program. This included balance and stability training, Redcord-based neuromuscular activation, electrostimulation, and pelvic floor therapy. Although no causal link between HPV vaccination and ATM has been established, this case emphasizes the importance of considering post-vaccinal autoimmune phenomena. More importantly, it illustrates the critical role of early, targeted rehabilitation—particularly pelvic floor re-education and neuromodulation—in improving outcomes in patients with significant motor and autonomic deficits. acute transverse myelitis ATM human papillomavirus HPV vaccine rehabilitation This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The human papillomavirus (HPV) vaccine is a key preventive measure against HPV-related diseases. HPV comprises over 200 viruses, with types 16 and 18 responsible for ~71% of cervical cancers and many other anogenital and oropharyngeal malignancies [ 1 2 3 4 3 5 6 7 8 9 2. Case Presentation A previously healthy 21-year-old female was transferred to the Neurology Ward at the Clinical Center in Poland from a hospital in Slovakia following a diagnosis of acute transverse myelitis. The patient initially presented with neurological symptoms during a recreational hike, experiencing sudden-onset paresthesias in both lower limbs, accompanied by pain in the lumbar spine radiating along the nerve root pathways toward the lower extremities. Within an hour, her condition rapidly deteriorated, leading to difficulty in walking and impaired motor control of the lower limbs. Upon her initial hospital admission, the clinical examination revealed bilateral paresthesias, paraparesis, dysesthesia in the lower limbs, urinary sphincter dysfunction, and decreased sensation in the anogenital region. The neurological deficits were symmetrical and corresponded to a thoracic spinal cord involvement. Notably, the patient had received the first dose of the HPV vaccine Cervarix approximately two weeks prior to the onset of the symptoms. She denied any recent infections, systemic illnesses, or prior neurological complaints. Her medical history was otherwise unremarkable, and there was no known family history of autoimmune or demyelinating disorders. The initial diagnostic imaging, including MRI scans of the brain and thoracic and lumbar spine, did not reveal any significant abnormalities. A CSF analysis demonstrated a mild elevation of protein concentration (0.46 g/L) but no pleocytosis, and the neuropanel was negative for common neurotropic viruses. A weakly positive antinuclear antibody (ANA) titer was observed, though its clinical significance remained uncertain at that point. The anti-AQP4 and anti-MOG antibody tests were negative. An empirical treatment with 1 g of intravenous methylprednisolone was initiated and lasted for 5 days under the presumptive diagnosis of an inflammatory myelopathy. A follow-up MRI of the thoracic and lumbosacral spine revealed multiple small T2-hyperintense intramedullary lesions, the most prominent from T9/T10 to T11/T12, involving mainly the posterior spinal cord. At T12/L1 to L1/L2, symmetrical foci were seen in both the anterior and posterior horns, forming the characteristic “snake eye” sign. The post-contrast images showed an enhancement of the cauda equina nerve roots. No compressive lesions or vertebral abnormalities were present. The distribution and intensity of the lesions were stable compared to the prior scans and suggested an inflammatory or autoimmune etiology ( Figure 1 Further serological testing revealed the presence of IgM antibodies against Borrelia burgdorferi, confirmed by a Western blot analysis. Consequently, she was started on targeted antibiotic therapy with amoxicillin. However, the diagnosis of neuroborreliosis was later excluded due to the absence of inflammatory markers in the CSF. This discrepancy highlighted the diagnostic challenges often encountered in ATM, where incidental findings can mislead the clinical interpretation. Upon her transfer to the Clinical Center in Poland, the patient’s neurological examination revealed residual motor deficits. The muscle strength in the right lower limb was graded 3/5 in hip flexion and extension, while the left limb showed 4/5 strength. The knee flexion and extension were 4/5 bilaterally, and the ankle movements were preserved at 5/5. The deep tendon reflexes were diminished in the knees and absent at the ankles. A third spinal MRI showed the persistence of the thoracic lesion, consistent with the previous imaging findings. A repeat CSF analysis showed a slightly increased protein level (0.50 g/L) and mild pleocytosis (6 cells/μL). Further blood tests revealed reduced serum vitamin B12 levels and the presence of anti-parietal cell antibodies, indicating a possible autoimmune-mediated gastric pathology. Due to the previous plasmapheresis treatments, the patient’s IgG and IgA levels were significantly depleted, necessitating an intravenous immunoglobulin (IVIG) supplementation. She received two IVIG infusions; however, during the first administration, she developed an episode of anaphylaxis, requiring an antihistaminic premedication for the continuation of treatment. The therapy was resumed successfully without further complications. With ongoing physiotherapy at the Neurology Ward, the patient demonstrated progressive improvement in muscle strength and regained partial bladder control. Her motor performance improved to 4/5 strength in hip flexion and extension on the right, 4+/5 on the left, and 5/5 in the knees and ankles. Her sensory improvement remained limited, particularly in the perianal region. In early September, the patient was transferred to the Rehabilitation Clinic, where she underwent intensive rehabilitation from 1 September to 5 October 2023. On admission, her functional status was assessed using several scales: a modified Rankin Scale (mRS) score of 3, a Barthel Index of 14, and her muscle strength on the Oxford scale was graded at 2. She retained superficial sensation over the labia majora on the right side but lacked anal sensation and had no voluntary sphincter control. The maximal voluntary contraction of the pelvic floor muscles was less than 5 s, and incontinence was present. Her rehabilitation program included a comprehensive regimen: daily 60 min sessions involving breathing exercises, low-resistance active movement, conditioning and isometric training, balance re-education, and stair-climbing drills along with assisted ambulation with a walking aid ( Figure 2 Electrostimulation of the pelvic floor muscles was performed every two days, complemented by kinesiotherapy focusing on core stability. Following the third electrostimulation session, the patient reported the return of minimal sensory perception and discomfort with pressure stimuli. After the fifth session, she noticed subtle sensations in the anal region, indicating early neurological recovery. By the time of her discharge from the Rehabilitation Clinic, she had shown significant functional gains: improved voluntary control of bladder function, increased strength of pelvic floor contractions (sustained for 15 s), and a marginal enhancement of superficial sensation. She still experienced occasional urinary incontinence, sometimes accompanied by defecation, but no longer required assistance with daily activities. Her mRS improved to 1 and her Barthel Index to 20. She was advised to continue pelvic floor training at home using electrostimulation equipment, with a focus on the ischial region, and she was educated about strategies to assist defecation and urination. During an oral follow-up consultation conducted 18 months post-discharge, the patient reported ongoing care under multiple out-patient clinics, including neurology, gastroenterology, urology, immunology, and rheumatology. She continues to experience intermittent neuropathic pain in the lower extremities, for which she attends private physiotherapy sessions. Additionally, she reports persistent constipation and occasional gas incontinence, accompanied by reduced urethral sphincter tone, necessitating the use of sanitary pads. Despite these residual symptoms, the patient subjectively rates her overall condition as very good. Her modified Rankin Scale (mRS) score was 1, and her Barthel Index showed marked improvement ( Table 1 3. Discussion The presented case exemplifies a rare but serious neurological complication—acute transverse myelitis—potentially triggered by immunological mechanisms following HPV vaccination. Although causality cannot be firmly established, the temporal relationship, the absence of a prior neurological disease, and the exclusion of alternative etiologies provide a sufficient basis for discussing this case in the context of vaccine safety monitoring. ATM is a neuroinflammatory disorder characterized by focal spinal cord inflammation, resulting in sensory, motor, and autonomic dysfunction. While it can occur in the context of systemic autoimmune diseases such as systemic lupus erythematosus or Sjögren’s syndrome, it is often post-infectious or idiopathic [ 10 11 Although the HPV vaccine has been rigorously tested and found to be safe in millions of individuals worldwide, isolated case reports have documented immune-mediated neurological syndromes post-vaccination. In 2015, Baker et al. reviewed multiple such cases, including myelitis, and hypothesized the involvement of vaccine adjuvants in some autoimmune phenomena. Cervarix, specifically, contains the AS04 adjuvant—a combination of aluminum hydroxide and monophosphoryl lipid A—which enhances the immune response by stimulating Toll-like receptor 4 (TLR4). While this adjuvant has been approved and used extensively, some studies have suggested it may contribute to rare immune dysregulation in predisposed individuals [ 12 In the current case, the onset of neurological symptoms occurred approximately 14 days after the administration of the vaccine, a window commonly associated with immune-mediated reactions. While coincidental infections—such as asymptomatic viral illnesses—could not be completely ruled out, the extensive microbiological workup, including CSF PCR, was negative for a wide array of pathogens. The transient positivity for Borrelia burgdorferi IgM, which led to the initial antibiotic treatment, was eventually interpreted as a false positive or incidental exposure, particularly as no supporting CSF findings were present. The presence of anti-parietal cell antibodies and vitamin B12 deficiency suggests an underlying autoimmune gastritis, which raises the possibility of a broader predisposition to autoimmune reactions [ 13 14 The diagnosis of ATM was ultimately supported by the patient’s clinical profile, MRI findings, and a partial response to the immunomodulatory therapies. The longitudinally extensive lesion involving the posterior columns of the thoracic cord, observed in the T10–T12 region, correlated well with her sensory and motor deficits. It is worth noting that posterior column involvement typically results in proprioceptive loss and gait ataxia, which were among the patient’s initial symptoms. The absence of brain lesions on the MRI supported the exclusion of multiple sclerosis (MS), while the lack of oligoclonal bands in the CSF and negative anti-AQP4 and anti-MOG antibody results argued against neuromyelitis optica spectrum disorder (NMOSD) [ 8 The management of ATM generally consists of high-dose corticosteroids to reduce inflammation, followed by plasmapheresis or IVIG in steroid-refractory cases [ 15 16 To contextualize our case and underscore its novelty, it is valuable to compare it with the previously reported instances of ATM following HPV vaccination. Fernández-Fournier et al. (2014) described a 14-year-old girl who developed cervical ATM just 3 days after receiving the quadrivalent HPV vaccine (qHPV)—the shortest latency reported in the literature [ 17 18 19 Table 2 Our case adds a distinct perspective by documenting a 21-year-old woman who developed ATM two weeks after the first dose of the bivalent HPV vaccine (Cervarix), characterized by thoracic cord involvement (T9–T12), marked motor and sphincter dysfunction, and partial neurological recovery after multimodal immunotherapy combined with intensive rehabilitation. Taken together, the available evidence highlights the significant variability in latency (ranging from days to weeks), lesion characteristics (cervical, thoracic, hemorrhagic), and outcomes (steroid-responsive vs. rehabilitation-dependent recovery). This comparison strengthens the argument for continued vigilance and detailed reporting of such rare post-vaccination events while also underscoring the importance of individualized rehabilitation strategies in optimizing recovery. Rehabilitation played a pivotal role in the patient’s recovery. ATM often leaves patients with persistent deficits, especially in sphincter control and proprioception, which require long-term management. An intensive physiotherapy focusing on neuroplasticity, balance, strength, and motor control was crucial in her functional improvement. The use of the Redcord system and stabilometric platforms reflects the modern rehabilitation strategies aimed at engaging both the central and peripheral pathways for sensory and motor retraining [ 20 Pelvic floor muscle electrostimulation was included as a supportive element of the rehabilitation program and appeared to contribute to the gradual improvement of her perineal sensation and the partial recovery of her bladder control. In the context of acute transverse myelitis (ATM), where autonomic dysfunction—including neurogenic bladder—is frequently significant and recovery may be incomplete, the early use of pelvic floor-targeted interventions is considered beneficial. Although randomized clinical studies, such as the one conducted by Elmelund et al., did not demonstrate a clear superiority of intravaginal electrical stimulation (IVES) over pelvic floor muscle training (PFMT) alone in women with incomplete spinal cord injury, both of the approaches were associated with meaningful improvements in urinary continence and quality of life [ 21 In the present case, the marked improvement in both the Barthel Index and modified Rankin Scale scores over the course of one month supports the effectiveness of a multimodal, individualized rehabilitation approach in facilitating functional recovery, even in the presence of severe initial deficits. Despite these advances, the patient’s recovery remained incomplete at the time of discharge, particularly in terms of fine sensory discrimination and sphincter control. A long-term follow-up and continued rehabilitation are necessary in such cases. Additionally, given the suspected autoimmune background (i.e., the presence of anti-parietal cell antibodies and B12 deficiency), a further gastroenterological and immunological workup may be warranted to identify latent autoimmune gastritis or pernicious anemia. At the 18-month follow-up, the patient demonstrated good overall functional recovery and subjectively rated her health as very good, despite her residual symptoms such as neuropathic pain, constipation, and reduced urethral sphincter tone. She remains under the care of several outpatient specialists and does not currently engage in sports activities. While her general condition is favorable, the ongoing need for multidisciplinary follow-up, the limitations in daily functioning (e.g., during long journeys), and the persistent symptoms may carry a potential psychological burden, which should also be acknowledged when assessing long-term quality of life in such cases. The rarity of ATM post-vaccination presents a unique challenge: how to balance individual case observations against the overwhelming public health benefits of vaccination. It is essential to acknowledge that sporadic adverse events may occur, but causality is difficult to establish without systematic data. Surveillance systems such as VAERS (Vaccine Adverse Event Reporting System) in the US and EudraVigilance in the EU are critical tools in identifying signals, but they rely heavily on clinician reporting and cannot determine causation on their own. Large-scale, controlled studies are needed to better understand the risk profile for such complications, especially in genetically or immunologically predisposed individuals. Both at the Slovak facility and during hospitalization in the neurology department, a possible causal link between HPV vaccination and ATM was considered. The main argument in favor of such a link was the close temporal relationship between the vaccination and the symptom onset, along with the absence of other potential triggers (e.g., Lyme disease was excluded during diagnostics). Nevertheless, a single case report does not allow conclusions about causality. In light of Bradford Hill’s criteria (such as strength and consistency of association, biological plausibility, and coherence with epidemiological evidence), our observations should be regarded as a signal warranting further investigation rather than proof of a causal relationship [ 22 While this case contributes to the body of anecdotal evidence suggesting a possible link between HPV vaccination and ATM, it should not deter the implementation of HPV immunization programs. Rather, it underscores the importance of informed consent, patient education, and close monitoring of post-vaccination symptoms. Patients with a personal or family history of autoimmune diseases might benefit from individualized counseling before vaccination, though no current guidelines recommend a routine pre-vaccination screening for autoimmunity. In follow-up correspondence, the patient disclosed that she had not received additional doses of the HPV vaccine following the onset of her neurological symptoms. While the standard Cervarix vaccination schedule comprises three doses, the emerging evidence supports the efficacy of a single-dose regimen. A study published by Fokom-Defo et al. demonstrated that a single dose of the HPV vaccine provides comparable protection against HPV types 16 and 18 as the traditional three-dose schedule [ 23 24 25 4. Conclusions This case report describes a rare instance of acute transverse myelitis in a young woman following the administration of the first dose of the bivalent HPV vaccine Cervarix. Although causality cannot be conclusively proven, the temporal association and the absence of alternative explanations support the hypothesis of an immune-mediated mechanism potentially triggered by vaccination. The clinical presentation, diagnostic approach, and therapeutic interventions followed the standard neurological and rehabilitative protocols, resulting in a partial but significant recovery. Importantly, this report highlights the necessity of vigilance in recognizing and managing rare post-vaccination complications without undermining the fundamental importance of HPV vaccination in cancer prevention. Further research is needed to elucidate the immunopathogenic mechanisms that may predispose certain individuals to such adverse events. Meanwhile, this case reinforces the critical role of comprehensive rehabilitation in restoring function and improving quality of life after severe spinal cord inflammation. In conclusion, while HPV vaccines remain a cornerstone of the public health strategy against HPV-related cancers, healthcare providers should be aware of rare but serious neurological adverse events. A timely recognition, a thorough diagnostic workup, and a multidisciplinary approach to management—including immunotherapy and intensive rehabilitation—can significantly influence the outcomes. The continued reporting and analysis of such cases are essential to refining our understanding of vaccine safety and individual susceptibility to adverse reactions. Disclaimer/Publisher’s Note: Author Contributions K.K.: writing and editing, conceptualization, data curation; P.N.: writing, data curation, supervision; J.K.: writing, data curation; A.K.: writing, data curation; M.K.-K.: data curation; D.S.: editing, data curation, supervision, conceptualization. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Ethical approval has been exempted by our institution because the diagnosis and treatment of the patient was carried out in accordance with the recommen- dations of medical scientific societies and current medical knowledge. Informed Consent Statement Informed consent was obtained from the patient prior to inclusion in the study. No personal data were used, and all information was anonymized. Oral consent was provided, and the patient agreed to the use of her medical history with her full approval. Data Availability Statement The data can be obtained from this article. Conflicts of Interest The authors declare no conflicts of interest. References 1. European Centre for Disease Prevention and Control Efficacy, Effectiveness and Safety of HPV Vaccination in Women Undergoing Conisation: Systematic Review ECDC Solna, Suwede 2019 Available online: https://www.ecdc.europa.eu/en/publications-data/efficacy-effectiveness-and-safety-hpv-vaccination-women-conisation-systematic (accessed on 24 July 2025) 2. Sharpless K.E. Marcus J.Z. Kuroki L.M. Wiser A.L. Flowers L. ASCCP Committee Opinion: Adjuvant Human Papillomavirus Vaccine for Patients Undergoing Treatment for Cervical Intraepithelial Neoplasia J. Low. Genit. Tract Dis. 2023 27 93 96 10.1097/LGT.0000000000000703 36538783 PMC9770105 3. Cheng L. Wang Y. Du J. Human Papillomavirus Vaccines: An Updated Review Vaccines 2020 8 391 10.3390/vaccines8030391 32708759 PMC7565290 4. American College of Obstetricians and Gynecologists Human papillomavirus vaccination: ACOG Committee Opinion No. 809 Obstet. Gynecol. 2020 136 e15 e21 10.1097/AOG.0000000000004000 32732766 5. Boender T.S. Bartmeyer B. Coole L. Wichmann O. Harder T. Risk of Guillain–Barré syndrome after vaccination against human papillomavirus: A systematic review and meta-analysis, 1 January 2000 to 4 April 2020 Euro Surveill. 2022 27 2001619 10.2807/1560-7917.ES.2022.27.4.2001619 35086611 PMC8796292 6. Mouchet J. Salvo F. Raschi E. Poluzzi E. Antonazzo I.C. De Ponti F. Bégaud B. Human papillomavirus vaccine and demyelinating diseases—A systematic review and meta-analysis Pharmacol. Res. 2018 132 108 118 10.1016/j.phrs.2018.04.007 29665426 7. Fiszer U. Ostre poprzeczne zapalenie rdzenia kręgowego Pol. Prz. Neurol. 2006 2 32 36 Available online: https://journals.viamedica.pl/polski_przeglad_neurologiczny/article/view/20169/15871 (accessed on 24 July 2025) 8. Simone C.G. Emmady P.D. Transverse Myelitis StatPearls [Internet] StatPearls Publishing Treasure Island, FL, USA 2025 Available online: https://www.ncbi.nlm.nih.gov/books/NBK559302/ (accessed on 24 July 2025) 32644728 9. West T.W. Transverse myelitis—A review of the presentation, diagnosis, and initial management Discov. Med. 2013 16 167 177 24099672 10. Tristano A.G. Autoimmune diseases associated with transverse myelitis. Review Invest. Clin. 2009 50 251 270 Available online: https://pubmed.ncbi.nlm.nih.gov/19662820/ (accessed on 24 July 2025) 19662820 11. Naeem F.N. Hasan S.F.S. Ram M.D. Waseem S. Ahmed S.H. Shaikh T.G. The association between SARS-CoV-2 vaccines and transverse myelitis: A review Ann. Med. Surg. 2022 79 103870 10.1016/j.amsu.2022.103870 PMC9181565 35702684 12. Baker B. Guimarães L.E. Tomljenovic L. Agmon-Levin N. Shoenfeld Y. The safety of human papilloma virus-blockers and the risk of triggering autoimmune diseases Expert Opin. Drug Saf. 2015 14 1387 1394 10.1517/14740338.2015.1073710 26216756 13. Rodríguez-Castro K.I. Franceschi M. Noto A. Miraglia C. Nouvenne A. Leandro G. Tiziana M. Gian L.d.A. Francesco D.M. Autoimmune diseases in autoimmune atrophic gastritis Acta Biomed. 2018 89 (Suppl. S8) 100 103 10.23750/abm.v89i8-S.7919 30561426 PMC6502205 14. Vences M.A. Morocho-Pinedo M. Oliveros-Ramirez R.J. Ballena-Cupe L.C. Alvarez-Márquez J.C. Villafuerte-Espinoza M. Urrunaga-Pastor D. Transverse myelitis associated with autoimmune polyglandular syndrome type 3B: A case report in Peru Neurol. Argent. 2023 15 216 220 10.1016/j.neuarg.2023.01.001 15. Greenberg B.M. Treatment of acute transverse myelitis and its early complications Continuum 2011 17 733 743 10.1212/01.CON.0000403792.36161.f5 22810928 16. Compagno N. Malipiero G. Cinetto F. Agostini C. Immunoglobulin replacement therapy in secondary hypogammaglobulinemia Front. Immunol. 2014 5 626 10.3389/fimmu.2014.00626 25538710 PMC4259107 17. Fernández-Fournier M. Díaz de Terán J. Tallón Barranco A. Puertas I. Early cervical myelitis after human papilloma virus vaccination Neurol. Neuroimmunol. Neuroinflamm. 2014 1 e31 10.1212/NXI.0000000000000031 25340083 PMC4204223 18. Badarny S. Badarny Y. Goldfeld M. Wakid H. Hemorrhagic Myelitis after Papilloma Virus (HPV) Vaccination Austin J. Mult. Scler. Neuroimmunol. 2020 5 id1032 19. National Academies of Sciences, Engineering, and Medicine Human papillomavirus vaccine safety Adverse Effects of Vaccines: Evidence and Causality The National Academies Press Washington, DC, USA 2011 20. Sadowsky C.L. Becker D. Bosques G. Dean J.M. McDonald J.W. Recio A. Frohman E.M. Rehabilitation in transverse myelitis Continuum 2011 17 816 830 10.1212/01.CON.0000403797.10612.d3 22810933 21. Elmelund M. Biering-Sørensen F. Due U. Klarskov N. The effect of pelvic floor muscle training and intravaginal electrical stimulation on urinary incontinence in women with incomplete spinal cord injury: An investigator-blinded parallel randomized clinical trial Int. Urogynecology J. 2018 29 1597 1606 10.1007/s00192-018-3630-6 29574482 22. Shimonovich M. Pearce N. Cheung K.L. Saracci R. Porta M. Assessing causality in epidemiology: Revisiting Bradford Hill to incorporate developments in causal thinking Eur. J. Epidemiol. 2021 36 613 629 10.1007/s10654-020-00703-7 PMC8206235 33324996 23. Fokom-Defo V. Dille I. Fokom-Domgue J. Single dose HPV vaccine in achieving global cervical cancer elimination Lancet Glob. Health 2024 12 e360 e361 10.1016/S2214-109X(24)00009-3 38365404 24. Stanley M. Schuind A. Muralidharan K.K. Guillaume D. Willens V. Borda H. Jurgensmeyer M. Limaye R. Evidence for an HPV one-dose schedule Vaccine 2024 42 (Suppl. S2) S16 S21 10.1016/j.vaccine.2024.01.046 39521566 25. Malvi S.G. Esmy P.O. Muwonge R. Joshi S. Poli U.R.R. Lucas E. Verma Y. Lucksom P.G. Shah A. Patel B. A prospective cohort study comparing the efficacy of 1 dose of quadrivalent HPV vaccine to 2 and 3 doses at an average follow-up of 12 years post-vaccination IARC News 2023 Available online: https://www.iarc.who.int/news-events/a-prospective-cohort-study-comparing-efficacy-of-1-dose-of-quadrivalent-human-papillomavirus-vaccine-to-2-and-3-doses-at-an-average-follow-up-of-12-years-postvaccination/ (accessed on 24 July 2025) 10.1093/jncimonographs/lgae042 PMC11555276 39529521 Figure 1 Magnetic Resonance Imaging (MRI) of the spine (T2-weighted). ( a b Figure 2 The patient during gait training using a walker. diseases-13-00281-t001_Table 1 Table 1 The assessment of the patient’s condition before and after rehabilitation and 18 months post-discharge. Prior to Rehabilitation After One Month 18 Months Post-Discharge mRS * = 3 mRS * = 1 mRS * = 1 Barthel Index = 14 Barthel Index = 20 Barthel Index = 95 muscle strength muscle strength muscle strength sphincter control sphincter control sphincter control maximal pelvic floor maximal pelvic floor maximal pelvic floor * mRS = modified Rankin Scale diseases-13-00281-t002_Table 2 Table 2 Case reports of ATM after HPV vaccination. Author Patient Details Timing Presentation Type Key Features Our Case Report 21-year-old woman 2 weeks after Cervarix Thoracic ATM T9–T12 lesion, paraparesis, sphincter dysfunction; treated with steroids, plasmapheresis, IVIG + intensive rehab; marked improvement Fernández-Fournier et al., 2014 [ 17 14-year-old girl 3 days after qHPV Cervical ATM MRI C1–C2 lesion, CSF OCB; improved post-steroids Badarny et al., 2020 [ 18 30-year-old woman ~1 month after HPV Hemorrhagic ATM MRI with intramedullary hemorrhage; treated with steroids; marked improvement Stratton et al., 2011/2012 [ 19 Cases cited in safety review Variable (unspecified) Included in systematic vaccine safety analysis ",
  "metadata": {
    "Title of this paper": "A prospective cohort study comparing the efficacy of 1 dose of quadrivalent HPV vaccine to 2 and 3 doses at an average follow-up of 12 years post-vaccination",
    "Journal it was published in:": "Diseases",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468459/"
  }
}