{
  "title": "Paper_250",
  "abstract": "pmc J Int Soc Sports Nutr J Int Soc Sports Nutr 521 jissn Journal of the International Society of Sports Nutrition 1550-2783 Taylor & Francis PMC12486453 PMC12486453.1 12486453 12486453 41025612 10.1080/15502783.2025.2566373 2566373 1 Version of Record Research Article Research Article Comparison of cheese with and without Propionibacterium freudenreichii shermanii 2 H. E. LUNDBERG ET AL. JOURNAL OF THE INTERNATIONAL SOCIETY OF SPORTS NUTRITION https://orcid.org/0000-0003-3430-9068 Lundberg Helge Einar  a  b https://orcid.org/0000-0003-1751-0026 Larsen Stig  b https://orcid.org/0000-0003-3687-583X Mathisen Therese Fostervold  c Sundgot-Borgen Jorunn  a a Norwegian School of Sports Sciences, Department of Sports Medicine Oslo Norway b Meddoc AS, Hvamstubben 14 Skjetten Norway c Østfold University College, Department of Health and Welfare Halden Norway CONTACT Helge Einar Lundberg helgeel@nih.no Oslo Norway 30 9 2025 2025 22 1 477231 2566373 30 09 2025 02 10 2025 02 10 2025 Integra 30 9 2025 Integra 30 9 2025 20 12 2024 19 9 2025 © 2025 The Author(s). Published by Informa UK Limited, trading as Taylor & Francis Group. 2025 The Author(s) https://creativecommons.org/licenses/by/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution License ( http://creativecommons.org/licenses/by/4.0/ ABSTRACT Background and objective Nordic skiers represent a low-impact, weight-sensitive sport and may be inclined to engage in weight-controlling behavior, hence increasing their risk for low energy availability and impairment in health and performance. Jarlsberg cheese (J) is rich in vitamin K₂ from fermentation by Propionibacterium freudenreichii subsp. shermanii LMGT 2951 (Pf) and lactic acid bacteria and increases the osteocalcin (OC) level. Vitamin K is essential for activating OC, which is described to be associated positively with muscle strength, whereas propionic acid bacteria are found to enhance endurance. Except for Pf and its by-products, J and Norvegia (N) cheeses have almost identical nutrient content. The objective of this study was to compare the effects of Jarlsberg and N as potential supplements to training on muscle strength (MS), lean body mass (LBM) and VO 2 Methods Thirty female and 30 male Nordic skiers were block randomized 1:1 to either J or N and studied during a 24-week offseason training schedule. The Norvegia group served as a control group. Females and males were treated with 75 and 90 grams/day, respectively. MS by seated pulldown and half-squat, LBM by DXA, and VO 2 Results MS significantly increased in both groups after 24 weeks ( p p p p p Conclusion Both Jarlsberg cheese, characterized by its unique Propionibacterium freudenreichii content, and Norvegia cheese, when combined with off-season training, led to increases in LBM, VO₂ max, and MS, with no significant differences observed between groups. However, there was a trend toward greater improvements in MS in the Jarlsberg group. Overall, increases in LBM through structured training appear to be a key driver of gains in both muscle strength and aerobic capacity. Protocol number XCS-Jarlsberg/IIA ClinicalTrial.gov NCT06688032 KEYWORDS REDs performance probiotics osteocalcin propionibacterium freudenreichii cheese Norwegian Research Council 10.13039/501100005416 Ministry of Agriculture 10.13039/100021025 TINE SA TINE SA The study was funded by the Norwegian Research Council’s allocation of funds from the Ministry of Agriculture’s fund for land-based food industry and from TINE SA. TINE SA has not participated in any planning of the study design, data analysis, data interpretation or manuscript preparation. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Relative energy deficiency in sport (REDs) is a syndrome of impaired physiological and psychological functioning experienced by athletes upon exposure to problematic low energy availability (LEA) [ 1 1 2 Osteocalcin (OC), a peptide specifically produced by osteoblasts, plays a crucial role in bone calcification. Additionally, it is associated with several potential properties that may beneficially counteract many of the negative effects of low energy availability (LEA) [ 3 4 4 5 6 7 8 7 9 10 4 5 Vitamin K is essential for the carboxylation ucOC to cOC [ 11–13 12 14 Figure 1 8 15 16 17 17 18 17 Figure 1. How Norvegia and Jarlsberg cheeses are made from the same milk. The fermentation of both cheeses starts with a starter culture of lactic acid bacteria. The medium chained K 2 2 2 Propionate has been shown to increase heart rate, VO2 max, and blood pressure in mice, as well as increase resting energy expenditure and lipid oxidation in fasted humans [ 17 18 A previous dose-response study on cheese and bone markers showed an increase in VO₂ max and muscle strength (MS) indicating an anabolic effect [ 19 The hypothesis was that J because of its Pf content would result in better VO₂ max than N group. Additionally, it was hypothesized that J, with its superior content of vitamin K combined with training, would increase MS strength more effectively compared to the N. 2. Methods 2.1. Study population The study population consisted of female and male cross-country and biathlon skiers at tier 3–4 [ 20 2.2. Study sample To obtain a significant level of 0.05; a power of 90% and clinically relevant difference (CRD) between groups of one-time standard deviation (SD) related to bone markers, a minimum of 23 participants were required in each group to complete the studies. The study sample consisted of 30 female and 30 male athletes, recruited by advertisement through social media, snowball recruitment, and internally at Norwegian School of Sports Sciences (NSSS). Related to the bone health section of this project, females were included from 17 years of age due to earlier skeletal maturation in females, and males from 18 years of age. All participants signed the informed consent form before inclusion. One participant from each treatment group dropped out during the study ( Table 1 Table 1 Table 1. Baseline demographics and clinical characteristics. The results are expressed by mean values and total range. Variables Jarlsberg group Norvegia group Total Female n = 15 Male n = 14 Female n = 14 Male n = 15 Jarlsberg n = 29 Norvegia n = 29 Age 20 22 20 20 21 20 17–27 18–30 17–26 18–25 18–30 17–26 BMI 2 21.9 22.7 22.2 22.0 22.3 22.1 19.2–24.8 18.3–26.2 18.7–25.5 18.7–26.0 18.3–26 18.7–26.0 Number of menstruation/years 11  11  11 11 6–12 0–12 6–12 0–12 Testosterone  21.8  20.3 21.8 20.3 12–32 14–27 12–32 14–27 2.3. Study design and randomization The study was performed as a randomized clinical trial with stratified parallel group design at NSSS. The random allocation sequence was generated by SL, and it was blinded to the primary investigator at baseline. The two cheeses are different in appearance, taste and smell, hence further blinding was not possible. Principally we cannot adjust for an unblinded design, but all participants were eager to follow their training plan, and both cheese intake and physiological variables were monitored. The participants were stratified by sex and equally randomly assigned 1:1 to the J-group and N-group by block randomization with fixed block size of 10. The study was conducted during the off-season, with each participant’s study period lasting 24 weeks, from April 17 to 15 October 2023. This period began approximately three weeks after the competitive season and extended to the start of their most intensive training period. 2.4. Clinical procedure Clinical status, interview and blood samples were performed at baseline and every eight weeks. Measurements of upper and lower body muscle strength and VO 2 2.5. Measurements The set of outcome variables consist of maximum upper body muscle strength (MS ub lb MS ub lb 21 2 22 23 24 2 Table 2 25 Table 2. Comparison of Jarlsberg® and Norvegia cheese in development of muscle strength, lean body mass, VO 2 Variables Sex Baseline Week 24 Increase from baseline Cohens d Jarlsberg Norvegia Jarlsberg Norvegia Jarlsberg Norvegia Sex Total Muscle strength Female n n = 15 n = 13 n = 15 n = 13 n = 15 n = 13 0.60 0.38 Male n n = 14 n = 15 n = 14 n = 15 n = 14 n = 15 0.29 Muscle strength Female n n = 13 n = 11 n = 13 n = 11 n = 13 n = 11 0.45 0.11 Male n n = 11 n = 12 n = 11 n = 12 n = 11 n = 12 0.41 Lean body mass Female n n = 15 n = 14 n = 15 n = 14 n = 15 n = 14 0.18 0.16 Male n n = 14 n = 15 n = 14 n = 15 n = 14 n = 15 0.15 VO 2 Female n n = 14 n = 12 n = 14 n = 12 n = 14 n = 12 0.14 0.19 Male n n = 12 n = 15 n = 12 n = 15 n = 12 n = 15 0.20 Testosterone ) Male n n = 13 n = 15 n = 13 n = 15 n = 13 n = 15  0.72 LBM was measured according to recommended procedure at baseline and final visit using a dual energy X-ray absorptiometry (Lunar iDXA, E’CORE Software, version 14.10.022; GE Healthcare, Madison, WI) at lumbar spine (L1-L4), femoral neck, total hip and total body [ 26 Blood samples included serum for analyses of primary and supporting variables. Osteocalcin was analyzed by Vitas laboratories in Oslo, and K₂ at the biochemical laboratory of Norwegian University of Life Sciences [ 16 27 2.6. Diet registration The participants were asked not to change their usual diet during the study, except for avoiding cheese other than the cheese provided in the study. A diet registration was performed for four days at baseline, and every eight weeks during the study. The participants registered their dietary intake in an application based on the Norwegian food table [ 28 29 2.7. Training registration No training intervention was conducted. The participants followed their own cross-country ski-specific training programs, primarily consisting of endurance exercises aimed at both strength and aerobic capacity. Much of the muscular endurance training was derived from ski-specific training methods, such as roller skiing, but also running and cycling. In addition to their diet registration, the skiers registered their weekly hours of strength and endurance training at baseline and every eight weeks during the study. 2.8. Clinical intervention Following determination of optimal cheese/OC-doses (OED), the female participants in both groups received 5 slices of cheese (75 g, and the male participants received 6 slices (90 g). The cheese was delivered to the investigation team by the manufacturer TINE, a partner in the research project [ 30 Because Jarlsberg® (and Norvegia®) cheeses are commercially available, the manufacturer’s laboratory regularly analyzes the content of bacteria to ensure the bacterial count is stable, but each batch delivered to the clinical study was not analyzed prior to delivery. The daily Jarlsberg doses contained 75 × 10 8 8 Propionibacterium freudenreichii shermanii th The daily dose of cheese provides 33 and 40 mcg K 2 To adjust for any vitamin D deficiency, all participants were provided vitamin D-pearls (Pharma Nord, Denmark) 40 mcg from baseline. The dosage was individually adjusted according to baseline vitamin D status, with the aim of reaching 100 nmol/L during the study. Cheese and vitamin D intake and training breaks due to illness or injuries were recorded every four weeks. 2.9. Cheese compliance In females, there was no significant difference in cheese compliance between groups; 87.3% and 89.5% in the J-group and N-group, respectively. In males, the compliance was significantly better in the N-group by 99.5%, and 88% in the J-group. 2.10. Statistical analysis This study was designed and conducted as an open randomized clinical trial, primarily aimed at comparing the effects of two types of cheese on bone health, using Osteocalcin and bone markers as primary variables [ 25 If we reduce to CRD < 0.2xSD it might be possible to obtain significant difference between groups within both sexes for MS and LBM and in the total material for VO2. However, this will increase the sample size approximately 10 times. All tests within and between groups were performed two-tailed and differences considered significant with p 31 32 The continuously distributed variables were expressed by mean values with 95% confidence interval (CI) [ 33 34 33 35 Table 2 Multiple- and partial Pearson correlation model was used to investigate the correlation pattern within the set of outcome variables and between the input and outcome variables [ 34 2.11. Approvals The study was approved by the Ethical committee at Norwegian School of Sport Sciences (NSSS) (approval number 273–160323) and was performed in accordance with the research protocol. (Protocol number: XCS-Jarlsberg/IIA, ClinicalTrial.gov: NCT06688032 3. Results MS ub p p Figure 2(a) ub Table 2 p Figure 2. Development in a) Muscle strength upper body (MS ub lb 2 MS lb Figure 2(b) lb p p lb Table 2 LBM increased from 52.7 kg (95% CI: 49.0–56.4) at baseline to 53.3 kg (95% CI: 49.6–56.9) after 24 weeks in the J-group ( p Figure 2(c) p Table 2 VO₂ max increased in both cheese groups during the 24-weeks trial period ( Figure 2(d) p p Table 2 Table 2 The duration of endurance training showed a significant increase from baseline to 24 weeks in both cheese groups for both genders ( Figure 3(a) Table 3 Figure 3(b) p Figure 3c Table 3 Table 3 Figure 3. Development in a) Endurance training, b) Strength training, c) Total training from baseline to week-24. The columns express 95% confidence intervals of the mean values indicated by the horizontals line crossing the orange columns Table 3. Comparison of Jarlsberg® and Norvegia cheese in development of training, osteocalcin and energy intake during 24 weeks of daily cheese intake. The total number of participants in the Jarlsberg and the Norvegia cheese groups are given on the table. The results are expressed by means with SD in brackets and 95% confidence intervals. Variables Sex Baseline Week 24 Increase from baseline P-values Jarlsberg Norvegia Jarlsberg Norvegia Jarlsberg Norvegia Endurance Training Female n n = 12 n = 13 n = 12 n = 13 n = 12 n = 13 p = 0.84 9.3 (4.2) 9.4 (5.2) 13.6 (4.1) 13.7 (4.4) 4.3 (4.1) 4.4 (4.3) 6.6–11.9 6.2–12.5 11.0–16.2 11.1–16.4 1.8–6.9 1.8–7.0  Male n n = 13 n = 12 n = 13 n = 12 n = 13 n = 12 p = 0.76 8.4 (4.7) 7.5 (2.9) 14.7 (6.2) 15.2 (4.1) 6.4 (7.4) 7.7 (5.3) 5.5–11.2 5.6–9.3 11.0–18.4 12.6–17.8 1.9–10.8 4.3–11.1 Strength Female n n = 12 n = 13 n = 12 n = 13 n = 12 n = 13 p = 0.42 1.1 (0.6) 1.7 (1.1) 1.4 (0.6) 1.7 (0.9) 0.3 (0.7) 0.0 (0.5) 0.7–1.5 1.0–2.4 1.1–1.8 1.2–2.3 −0.1–0.8 −0.3–0.4 Male n n = 13 n = 12 n = 13 n = 12 n = 13 n = 12 p = 0.36 1.7 (1.1) 1.6 (1.4) 2.1 (1.0) 1.7 (0.7) 0.4 (0.9) 0.0 (1.3) 1.0–2.4 0.8–2.5 1.5–2.7 1.2–2.1 −0.2–0.9 −0.8–0.8 Total Training Female n n = 12 n = 13 n = 12 n = 13 n = 12 n = 13 p = 0.82 10.4 (4.4) 11.1 (5.5) 15.1 (4.3) 15.5 (4.5) 4.7 (4.3) 4.4 (4.4) 7.6–13.1 7.8–14.4 12.3–17.8 12.8–18.2 1.9–7.4 1.8–7.1 Male n n = 13 n = 12 n = 13 n = 12 n = 13 n = 12 p = 0.68 10.1 (4.9) 9.1 (3.7) 16.8 (5.5) 16.8 (4.2) 6.7 (7.5) 7.7 (5.7) 7.1–13.0 6.8–11.4 13.5–20.1 14.7–19.5 2.2–11.3 4.1–11.4 Total Osteocalcin (tOC) ng/ml Total n n = 29 n = 29 n = 29 n = 29 n = 29 n = 29 p < 0.01 39.4 (16.2) 38.4(15.9) 38.0(17.5) 26.8(7.6) −1.4(9.1) −11.6(10.3) 33.2–45.5 32.4–44.4 31.3–44.6 23.9–29.7 −4.9–2.1 −15.5- −7.7 Carboxylated Osteocalcin (cOC). ng/ml Total n n = 29 n = 29 n = 29 n = 29 n = 29 n = 29 p < 0.01 22.0 (8.9) 19.5(6.7) 23.3(14.1) 16.3(4.2) 1.3(6.5) −3.2(4.0) 18.7–25.4 17.0–22.1 17.2–33.5 15.6–20.3 −1.2–3.8 −4.7- −1.7 P1NP/CTX-ratio Total n n = 29 n = 29 n = 28 n = 29 n = 28 n = 29 p = 0.05 158(49.6) 195 (61.2) 175 (47.8) 194 (67.0) 19.2 (48.7) −0.7 (44.9) 139–177 172–218 156–194 169–220 0.4–38.1 −17.8–16.4 Energy intake (kcal) Total n n = 27 n = 29 n = 27 n = 29 n = 27 n = 29 p = 0.93 2072 (792) 2656 (785) 2897 (699) 3268 (879) 624 (501) 611 (635) 1959–2596 2357–2955 2620–3173 2933 – 3602 426–822 370–853 Both tOC and cOC decreased significantly ( p Table 3 p p Table 3 The four outcome variables were all significantly and positively multiple correlated both at baseline and after 24 weeks ( Table 4 ub ub lb lb Figure 4(a) 2 Figure 4. The correlation pattern between and within the outcome variable (MS ub lb, 2 Table 4. Multiple- and partial correlation coefficients between muscle strength, lean body mass, VO 2 Sex 24 weeks Baseline Variables recorded on baseline MS upper body ( n MS Lower body ( n Lean body mass ( n VO₂ - Max n Total n Training Endurance n Strength n Baseline Muscle strength n 1 0.65 0.85 0.65 0.01 0.22 −0.02 0.02 0.68 0.27 0.12 −0.20 −0.27 Muscle strength n 0.66 1 0.70 0.45 −0.05 −0.05 −0.08 −0.01 0.46 −0.08 0.01 −0.34 −0.29 Lean body mass n 0.83 0.66 1 0.67 0.03 0.27 0.10 0.70 0.45 0.21 −0.16 0.32 0.41 VO 2 n 0.57 0.43 0.66 1 0.01 0.32 −0.09 0.08 −0.11 0.36 0.11 0.15 −0.06 Total Osteocalcin n 0.19 −0.02 0.21 0.18 1 −0.05 0.25 0.10 −0.05 −0.03 0.06 −0.14 0.14 Endurance training n −0.21 −0.33 −0.01 −019 0.13 1 −0.21 −0.48 −0.10 0.52 −0.22 0.12 −0.45 Strength training n −0.01 −0.02 0.10 −0.10 0.19 0.18 1 −0.11 0.13 0.16 −0.17 0.18 0.02 At week 24, the correlation pattern within the outcome variables was nearly as described for baseline. Correcting for MS ub ub Figure 4(b) ub lb lb ub Including the input variables in the week-24 pattern, endurance training was significantly, positively multiple correlated to LBM and VO₂ max, and strength training to VO₂ max and OC-level ( Figure 4(b) 4. Discussion The relationship between OC and muscle strength, along with Pf’s potential impact on athletes` endurance, prompted our interest in exploring the effects of cheese on MS, LM and VO 2 3–5 4.1. Muscle strength and lean mass Both MS ub, lb 2 There was no difference in development in testosterone between the male groups, suggesting no beneficial effect from stimulated testosterone production in the J-group relative to the N-group. 4.2. VO 2 The VO 2 2 17 17 17 2 17 4.3. What influences the increased MS and VO 2 To examine the baseline status in relation to outcome variables and training conditions, a multiple and partial correlation analysis was conducted on the entire study sample. Differences in training experience causes differences in muscle strength, aerobic endurance and LM. Endurance training is the dominant input variable, and lean mass is the dominant outcome variable, explaining both MS ub lb 2 ub ub lb 21 36 2 ub 2 At baseline, there is a borderline significant ( p 2 37 38 4 5 10 4.4. Strengths and limitations The strength of the study lies in its randomization and prospective longitudinal design. To accurately assess the effects on MS, LBM, and VO 2 2 Propionibacterium freudenreichii 5. Conclusion There were no differences in MS, LBM, and VO2-max development between N and J. The significant increase in these metrics is likely due to increased endurance training volume and intensity during the off-season. Training that increases LBM is crucial for improving MS and VO2-max. No direct effect from Pf or increased OC-level was detected, although OC contributes to explaining LBM at baseline and week 24. Given the lack of group differences, consumption of PF-rich cheese did not yield any additional improvements in sport performance. Acknowledgments We would like to thank all the participants in the study, scientific assistants, and the staff of the Norwegian School of Sport Sciences and Meddoc for their willing facilitation so that the study could be carried out. We also thank professor emeritus Helge Holo for the discussions on microbiology and vitamin K₂, and the analyses he has performed, clinical nutritionist Anniken Sletta for the diet monitoring, and software developer Einar Kvam Lundberg for developing the diet registration application. We also want to thank Pharma Nord, who has provided a discount on the vitamin D supplement used in the study, as well as Tine SA who contributed with the cheese. In order to avoid conflicts with image rights, I used Microsoft 365 Copilot to create the illustrations in the graphical abstract Authorship HEL: conceptualization, formal analysis, investigation, visualization, writing – original draft, writing – review and editing. SL: conceptualization, data curation, formal analysis, methodology, project administration, visualizations, supervision, validation. TFM: conceptualization, resources, supervision. JSB: conceptualization, advice, supervision. Disclosure statement No potential conflict of interest was reported by the author(s). Data availability statement The data that support the findings of this study are available from the corresponding author, HEL, upon reasonable request. Protocol The protocol, XCS-Jarlsberg/IIA is registered and can be accessed in trial registry ClinicalTrial.gov: NCT06688032 References 1. Mountjoy M Ackerman KE Bailey DM 2023 International Olympic Committee’s (IOC) consensus statement on relative energy deficiency in sport (REDs) Br J Sports Med 2023 57 17 1073 14 10.1136/bjsports-2023-106994 37752011 2. Jones TW Lindblom HP Karlsson Ø Anthropometric, physiological, and performance developments in cross-country skiers Med Sci Sports Exerc 2021 53 12 2553 2564 10.1249/MSS.0000000000002739 34649265 3. Komori T. Functions of osteocalcin in bone, pancreas, testis, and muscle Int J Mol Sci 2020 21 20 7513 10.3390/ijms21207513 33053789 PMC7589887 4. Vitale JA Sansoni V Faraldi M Circulating carboxylated osteocalcin correlates with skeletal muscle mass and risk of fall in postmenopausal osteoporotic women Front Endocrinol (Lausanne) 2021 12 669704 10.3389/fendo.2021.669704 34025583 PMC8133362 5. Xiang Y Lu W Mao X Osteocalcin has a muscle-protective effect during weight loss in men without metabolic syndrome: a multicenter, prospective, observational study Front Endocrinol (Lausanne) 2023 14 1308452 10.3389/fendo.2023.1308452 38093960 PMC10716436 6. Mera P Laue K Wei J Osteocalcin is necessary and sufficient to maintain muscle mass in older mice Mol Metab 2016 5 10 1042 1047 10.1016/j.molmet.2016.07.002 27689017 PMC5034485 7. Manolagas SC Bateman JF Osteocalcin promotes bone mineralization but is not a hormone PLoS Genet 2020 16 6 e1008714 10.1371/journal.pgen.1008714 32484816 PMC7266291 8. Zoch ML Clemens TL Riddle RC New insights into the biology of osteocalcin Bone 2016 82 42 49 10.1016/j.bone.2015.05.046 26055108 PMC4670816 9. Pi M Nishimoto SK Darryl Quarles L Explaining divergent observations regarding osteocalcin/GPRC6A endocrine signaling Endocrinology 2021 162 4 10.1210/endocr/bqab011 PMC7880225 33474566 10. Smith C Lewis JR Sim M Higher undercarboxylated to total osteocalcin ratio is associated with reduced physical function and increased 15-year falls-related hospitalizations: the Perth Longitudinal Study of Aging Women J Bone Min Res 2021 36 3 523 530 10.1002/jbmr.4208 33615560 11. Iwamoto J Vitamin K₂ therapy for postmenopausal osteoporosis Nutrients 2014 6 5 1971 1980 10.3390/nu6051971 24841104 PMC4042573 12. Sato T Schurgers LJ Uenishi K Comparison of menaquinone-4 and menaquinone-7 bioavailability in healthy women Nutr J 2012 11 1 93 10.1186/1475-2891-11-93 23140417 PMC3502319 13. Luo G Ducy P McKee MD Spontaneous calcification of arteries and cartilage in mice lacking matrix GLA protein Nature 1997 386 6620 78 81 10.1038/386078a0 9052783 14. Schurgers LJ Teunissen KJ Hamulyák K Vitamin K-containing dietary supplements: comparison of synthetic vitamin K1 and natto-derived menaquinone-7 Blood 2007 109 8 3279 3283 10.1182/blood-2006-08-040709 17158229 15. Kita K Yamachika E Matsubara M Anti-osteoporosis effects of 1, 4-dihydroxy-2-naphthoic acid in ovariectomized mice with increasing of bone density J Oral Maxillofacial Surg Med Pathol 2016 28 1 66 72 10.1016/j.ajoms.2015.07.001 16. Lundberg HE Holand T Holo H Increased serum osteocalcin levels and vitamin K status by daily cheese intake 2020 17. Scheiman J Luber JM Chavkin TA Meta-omics analysis of elite athletes identifies a performance-enhancing microbe that functions via lactate metabolism Nat Med 2019 25 7 1104 1109 10.1038/s41591-019-0485-4 31235964 PMC7368972 18. Falentin H Deutsch S-M Jan G The complete genome of Propionibacterium freudenreichii CIRM-BIA1T, a hardy actinobacterium with food and probiotic applications PLOS ONE 2010 5 7 e11748 10.1371/journal.pone.0011748 20668525 PMC2909200 19. Lundberg HE Sundgot-Borgen J Mathisen TF Cheese positively affects serum osteocalcin levels, bone turnover markers and bone mineral density in cross-country skiers: a dose-response study Int J Clin Trials 2024 11 2 91 100 20. McKay AKA Stellingwerff T Smith ES Defining training and performance caliber: a participant classification framework Int J Sports Physiol Perform 2022 17 2 317 331 10.1123/ijspp.2021-0451 34965513 21. Losnegard T Mikkelsen K Rønnestad BR The effect of heavy strength training on muscle mass and physical performance in elite cross country skiers Scand J Med Sci Sports 2011 21 3 389 401 10.1111/j.1600-0838.2009.01074.x 20136751 22. Edvardsen E Hem E Anderssen SA End criteria for reaching maximal oxygen uptake must be strict and adjusted to sex and age: a cross-sectional study PLOS ONE 2014 9 1 e85276 10.1371/journal.pone.0085276 24454832 PMC3891752 23. Losnegard T Physiological determinants of performance in modern elite cross-country skiing 2013 24. Landgraff HW Riiser A Lihagen M Longitudinal changes in maximal oxygen uptake in adolescent girls and boys with different training backgrounds Scand J Med Sci Sports 2021 31 S1 65 72 10.1111/sms.13765 33871085 25. Lundberg Helge EL Mathisen Therese F Borgen Tove T Propionebacterium freudenrechii - a diet component with promising effect on bone health in athletes Norwegian School of Sports Sciences 2025 26. Nana A Slater GJ Stewart AD Methodology review: using dual-energy X-ray absorptiometry (DXA) for the assessment of body composition in athletes and active people Int J Sport Nutr Exerc Metab 2015 25 2 198 215 10.1123/ijsnem.2013-0228 25029265 27. Lundberg HE Glasø M Chhura R Effect on bone anabolic markers of daily cheese intake with and without vitamin K2: a randomised clinical trial BMJ Nutr Prev Health 2022 5 2 182 10.1136/bmjnph-2022-000424 PMC9813627 36619332 28. NFS A. Matvaretabellen 2022 Available from: www.matvaretabellen.no 29. Medin AC Web-based dietary assessment in Norway: new methods and their validity 2018 30. Lundberg HS-B Mathisen TF Holo H Cheese positively affects serum osteocalcin levels, bone turnover markers and bone mineral density in cross-country skiers: a dose-response study [original research] Int J Clin Trials 2024 11 2 91 100 31. Shapiro SS Wilk MB An analysis of variance test for normality (complete samples) Biometrika 1965 52 3–4 591 611 10.1093/biomet/52.3-4.591 32. Slakter MJ A comparison of the Pearson chi-square and Kolmogorov goodness-of-fit tests with respect to validity J Am Stat Assoc 1965 60 311 854 858 10.1080/01621459.1965.10480833 33. Altman D Practical statistics for medical research London Chapman & Hall. CRC 1991 34. Kleinbaum DG Kupper LL Nizam A Applied regression analysis and other multivariable methods Cengage Learning 2013 35. Cohen J Statistical power analysis for the behavioral sciences routledge 2013 36. Børve J Jevne SN Rud B Upper-body muscular endurance training improves performance following 50 min of double poling in well-trained cross-country skiers Front Physiol 2017 8 690 10.3389/fphys.2017.00690 29018351 PMC5615216 37. Kanbur NÖ Derman O Şen TA Osteocalcin. A biochemical marker of bone turnover during puberty Int J Adolesc Med Health 2002 14 3 235 244 10.1515/IJAMH.2002.14.3.235 12467198 38. Alam MF Rana MA Alam MS Osteocalcin, a promising marker of osteoporosis: evaluation in post-menopausal females with osteoporosis Int J Adv Med 2019 6 6 1746 1749 10.18203/2349-3933.ijam20194639 ",
  "metadata": {
    "Title of this paper": "Osteocalcin, a promising marker of osteoporosis: evaluation in post-menopausal females with osteoporosis",
    "Journal it was published in:": "Journal of the International Society of Sports Nutrition",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486453/"
  }
}