{
  "title": "Paper_1053",
  "abstract": "pmc Toxicol Sci Toxicol Sci 776 toxsci toxsci Toxicological Sciences 1096-6080 1096-0929 Oxford University Press PMC12469193 PMC12469193.1 12469193 12469193 40711967 10.1093/toxsci/kfaf095 kfaf095 1 Research Article Organ Specific Toxicology AcademicSubjects/MED00305 AcademicSubjects/SCI01040 Evaluating the role of alveolar macrophages in tolerance to ozone https://orcid.org/0000-0002-5305-0445 Smith Gregory J  Department of Genetics, University of North Carolina at Chapel Hill United States Nalesnik Morgan  Curriculum in Toxicology and Environmental Medicine, University of North Carolina at Chapel Hill United States https://orcid.org/0000-0003-1998-1307 Immormino Robert M  Department of Pediatrics, University of North Carolina School of Medicine United States  Center for Environmental Medicine, Asthma and Lung Biology, University of North Carolina at Chapel Hill United States Simon Jeremy M  Department of Genetics, University of North Carolina at Chapel Hill United States  Neuroscience Center, University of North Carolina School of Medicine United States  Department of Data Science, Dana-Farber Cancer Institute United States  Department of Biostatistics, Harvard T. H. Chan School of Public Health United States Harkema Jack R  Department of Pathobiology and Diagnostic Investigation, Michigan State University United States Mock Jason R  Division of Pulmonary Diseases and Critical Care Medicine, University of North Carolina at Chapel Hill United States  Marsico Lung Institute, University of North Carolina at Chapel Hill United States Moran Timothy P  Department of Pediatrics, University of North Carolina School of Medicine United States  Center for Environmental Medicine, Asthma and Lung Biology, University of North Carolina at Chapel Hill United States https://orcid.org/0000-0003-2676-9232 Kelada Samir N P  Department of Genetics, University of North Carolina at Chapel Hill United States  Marsico Lung Institute, University of North Carolina at Chapel Hill United States Corresponding author: Department of Genetics, University of North Carolina, 120 Mason Farm Road, Chapel Hill, NC 27599, United States. Email: samir_kelada@med.unc.edu 10 2025 25 7 2025 207 2 497639 487 497 28 7 2025 25 07 2025 27 09 2025 27 09 2025 © The Author(s) 2025. Published by Oxford University Press on behalf of the Society of Toxicology. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution-NonCommercial-NoDerivs licence ( https://creativecommons.org/licenses/by-nc-nd/4.0/ Abstract Acute exposure to ozone (O 3 3 3 3 3 3 3 3 3 3 3 ozone tolerance alveolar macrophages National Institutes of Health 10.13039/100000002 R01ES024965 R01ES036228 K08ES029118 UNC Center for Environmental Health and Susceptibility Pilot Project P30ES010126 ES007126-35 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Exposure to the ambient air pollutant ozone (O 3 Bell et al. 2004 Cromar et al. 2019 3 Seltzer et al. 1986 Koren et al. 1989 Devlin et al. 1991 Devlin et al. 1996 Que et al. 2011 3 Hackney et al. 1977 Farrell et al. 1979 Folinsbee et al. 1980 Dimeo et al. 1981 Horvath et al. 1981 Linn et al. 1982 Devlin et al. 1997 Christian et al. 1998 Jörres et al. 2000 Arjomandi et al. 2005 3 Wiester et al. 2000 van Bree et al. 2002 3 3 Matzen 1957 Frager et al. 1979 Nambu and Yokoyama 1982 Evans et al. 1985 van der Wal et al. 1994 Fairchild 1967 Adaptation and tolerance to inhaled toxicants both share the feature of attenuated responsiveness and likely share mechanisms in common. Although the two terms are sometimes used interchangeably in the literature, they can be distinguished by exposure paradigms. Adaptation is evidenced by differences in responses to a single vs. repeated exposures at a single concentration. In contrast, tolerance to O 3 Fig. S1 Mechanisms underlying tolerance to O 3 3 Nambu and Yokoyama 1982 Evans et al. 1985 Evans et al. 1985 3 Nambu and Yokoyama 1983 Wiester et al. 2000 Nambu and Yokoyama (1983) Evans et al. (1985) 3 Although previous studies have focused on the role of epithelial cells, we sought to evaluate the role of alveolar macrophages (AMs) in tolerance to O 3 3 Pendino et al. 1995 Dahl et al. 2007 Tighe et al. 2011 Sunil et al. 2012 Hussain et al. 2020 Guttenberg et al. 2024 3 Tovar et al. 2020 Choudhary et al. 2021 Tovar et al. 2022 Previous studies have shown that macrophages play key roles in adaptation to other stimuli, e.g. endotoxin and chlorine gas ( Foster et al., 2007 Allard et al., 2019 3 3 Nambu and Yokoyama 1982 Nambu and Yokoyama 1983 Evans et al. 1985 van der Wal et al. 1994 Materials and methods Mice Multiple studies have reported differences in O 3 Cabello et al. 2015 Mishra et al. 2016 Cho et al. 2019 Birukova et al. 2019 Yaeger et al. 2021 3 Cabello et al. 2015 Mishra et al. 2016 Birukova et al. 2019 O 3 Mice were exposed to filtered air (FA) or 0.8 ppm O 3 3 Fig. 1A Evans et al. 1985 van Bree et al. 2002 3 3 Smith et al. 2019 Lung phenotyping At designated time points, mice were anesthetized (2 g/kg urethane) and sacrificed by inferior vena cava/abdominal aorta exsanguination. Bronchoalveolar lavage (BAL) was performed by instilling the lungs with phosphate buffered saline (PBS) containing a protease inhibitor cocktail (Roche Cat. No. 11836170001) two times, first with 0.5 ml and then with 1.0 ml. The BAL fluid was centrifuged for 10 min at 400 × g ○ g For lung histopathology, the left lobe was immersion fixed in 10% neutral buffered formalin for 24 h. After formalin fixation, lung lobes were stored in 70% ethanol until further tissue processing for light microscopic examination. Five-micron-thick, formalin-fixed, paraffin-embedded tissue sections were prepared on positively charged slides and stained with hematoxylin and eosin or processed for immunohistochemistry using the following antibodies and conditions. Non-specific proteins were blocked with Rodent Block M (catalog #: RBM961, Biocare). Primary antibody for FOXJ1 (monoclonal rat anti-mouse HFH4, clone EPR21874 Total BAL protein was quantified with the Qubit Total Protein Quantification kit and the Qubit 2.0 fluorometer (Thermo Scientific). BAL albumin was quantified with a mouse albumin ELISA kit (E-90AL, Immunology Consultants Laboratory). BAL cytokines were measured using a MILLIPLEX protein immunoassay (Millipore) that was read on a Bio-Plex 200 multiplex suspension array system (Bio-Rad). Clodronate treatment PBS or clodronate (5 mg/ml) containing liposomes (Liposoma, Amsterdam, The Netherlands) were administered to mice by oropharyngeal aspiration on day 5 of the O 3 Adoptive transfer of AMs Mice were exposed to FA or 0.8 ppm O 3 n 3 Preparation and analysis of epithelial populations by multi-color flow cytometry Lungs were digested by intratracheal instillation via a 20-gauge catheter of 1 ml of 5 mg/ml collagenase I (Worthington Biochemical Corp, Lakewood, NJ) and 0.25 mg/ml DNase I (Sigma) prepared in RPMI media (Life Technologies, Carlsbad, CA) prior to instilling 0.5 ml of 1% (wt/vol) low melting agarose (Amresco, Solon, OH), similar to previous protocols ( Dial et al. 2017 Mock et al. 2019 2020a Mock et al. 2020a 6 Table S1 Table S1 Flow cytometry of epithelial populations was performed using a Cytoflex flow cytometer (Beckman Coulter, Brea, CA) and analyzed using CytExpert (Beckman Coulter) software, version 2.4, and the gating strategy is shown in Fig. S2 Dial et al. 2017 Mock et al. 2019 Mock et al. 2020b Preparation and analysis of leukocyte populations by multi-color flow cytometry Murine lung leukocytes were isolated and analyzed by flow cytometry as previously described ( Immormino et al. 2018 Table S1 Flow cytometry on leukocyte populations was performed using a four-laser LSRII (BD Biosciences) or a five-laser Fortessa (BD Biosciences) cytometer and analyzed using FlowJo (Treestar, Ashland, OR) software. Only single cells were analyzed, and leukocyte populations were identified using a manual gating strategy depicted in Fig. S3 Statistical analyses For the analyses of phenotypes in the model of tolerance ( Fig. 1 3 3 t 3 3 3 Fig. 1A 3 3 Fig. 1A Fig. 5 t 3 3 3 3 t AM gene expression analysis by RNA sequencing RNA-sequencing analysis was conducted on AMs isolated from mice on day 7 of the tolerance model. Total RNA was extracted from two batches of flow-sorted AMs using QIAGEN RNeasy kits per the manufacturer’s instructions. RNA integrity was analyzed using an Agilent Bioanalyzer. RIN values ranged from 8.9 to 9.7, indicating intact RNA. PolyA + RNA libraries were prepared with the Roche Kapa mRNA stranded library preparation kit as per the manufacturer's instructions. Paired-end sequencing (50 cycles) was performed on an Illumina NovaSeq SP to a depth of >55 million read pairs per sample by the UNC High-Throughput Sequencing Facility. RNA-seq data processing and analysis Raw reads were trimmed and filtered of adapter contamination using cutadapt ( Martin 2011 Table S2 Dobin et al. 2013 Patro et al. 2017 3 Love et al. 2014 Ritchie et al. 2015 Stephens 2017 Mangiola and Papenfuss 2020 Gu et al. 2016 Gene ontology enrichments were then assessed using gprofiler2 v0.2.1 ( Raudvere et al. 2019 Choudhary et al. (2021) GSE156799 3 Results Development and characterization of a model of O 3 Inspired by previous studies of O 3 Nambu and Yokoyama 1983 Evans et al. 1985 van der Wal et al. 1994 3 3 3 Fig. 1A 3 3 3 3 3 Fig. 1B and C Fig. 1D–G 3 Fig. S4 Fig. 1. A new model of ozone tolerance in mice. A) Female C57BL/6NJ mice were exposed to ozone as depicted, then sacrificed 6 or 24 h following 2 ppm challenge. B and C) Decreased injury and inflammation after ozone challenge in ozone pre-exposed mice as reflected by BAL total protein (B) and neutrophils (C and D) in BAL fluid, respectively. Neutrophil counts were quantified manually using cytospins. Control mice were harvested at 24 h. Differential cell counts were determined using morphological criteria of cytospin slides. D to G) Altered cytokine/chemokine concentrations in BAL fluid were also observed in the ozone pre-exposed group. N P 3 # P 3 3 3 We examined O 3 3 Fig. 2 3 Fig. 2E Fig. 2G 3 Fig. 2I Fig. 2K 3 Fig. 2F Fig. 2H 3 Fig. 2J 3 Fig. 2L 3 3 Fig. 2. Histological analysis of large and small airways shows a protective effect of ozone pre-exposure on acute ozone-induced epithelial injury. Light photomicrographs of respiratory epithelium lining proximal large diameter axial airway (A, C, E, G, I, K) or distal small diameter pre-terminal and terminal bronchioles (B, D, F, H, J, L) in the left lung lobe of mice exposed to FA + FA (A to D), FA + O 3 3 3 Prior studies reported an increased frequency of proliferating AT2 cells in the lungs of tolerized rats ( Nambu and Yokoyama 1982 Evans et al. 1985 Fig. 3 Fig. S5 Fig. 3. Changes in epithelial cell type frequencies and proliferation in ozone tolerized mice. Flow cytometry-based determination of epithelial types in whole lung digests. Mice were exposed to 0.8 ppm ozone for 4 days and harvested on day 7. Ki67 expression was measured on club cells, ciliated cells, and AT2 cells. N P Evaluation of the role of AMs in O 3 Having established a model of O 3 Fig. S6 Nguyen et al. 2022 Given findings from previous studies, which have shown widespread changes in the transcriptome of macrophage populations in other models of adaptation/tolerance ( Foster et al. 2007 Allard et al. 2019 Fig. 4A Table S3 3 Choudhary et al. 2021 Fig. S7 Cd200r2 Spp1 3 Barreno et al. 2013 Tovar et al. 2020 Choudhary et al. 2021 Leroy et al. 2015 Trem2 Turnbull et al. 2006 Cxcr2 Acp5 Bune et al. 2001 Fig. 4. Ozone tolerance causes a shift in AM gene expression toward decreased responsiveness. Mice were exposed to 0.8 ppm ozone for 4 days and harvested on day 7. A) MA plot showing differential gene expression as a function of average gene expression ( x y −10 N Tables S4 and S5 The roles of the most strongly down-regulated genes in relation to AM function were less obvious, though Itgad Miyazaki et al. 2008 Atf5 Mass et al. 2016 3 Tables S4 and S5 Fig. 4B Fig. S8 3 3 We then functionally tested the role of AMs in tolerance using two approaches. First, utilizing the same O 3 3 Fig. 5A Foster et al. 2007 Allard et al. 2019 Fig. 5B 3 Fig. 5C Fig. S9 3 Fig. 5D and E 3 Fig. S10 Fig. 5. Depletion of AMs using clodronate does not alter tolerance. A) Experimental paradigm in which mice were exposed to ozone or filtered air as depicted and treated with liposomes (empty vs. clodronate containing [Clod.]) via oropharyngeal aspiration. B to E) Effect of clodronate treatment on BAL alveolar macrophage (B) and neutrophil number (C) as determined using flow cytometry, total protein (D), and albumin (E). N P 3 3 P P 3 3 3 Subsequently, we asked whether AMs were sufficient for tolerance by transferring AMs from tolerized mice to naïve recipient mice and then challenging these mice with O 3 Fig. 6A 3 3 Fig. 6. Adoptive transfer of tolerized AMs does not alter response to acute ozone challenge. A) Experimental paradigm. BAL cells were collected from tolerized vs. non-tolerized mice and 400,000 cells were then transferred to naïve recipient mice by oropharyngeal aspiration (OPA). Recipient mice were challenged with filtered air or 2 ppm O 3 N P 3 Discussion We built a new mouse model of O 3 3 3 Nambu and Yokoyama 1982 Evans et al. 1985 3 After establishing a model of tolerance, we set out to evaluate the role of AMs, which have long been known to play a role in acute O 3 Arsalane et al. 1995 Pendino et al. 1995 Dahl et al. 2007 Tighe et al. 2011 Sunil et al. 2012 Francis et al. 2017 Hussain et al. 2020 Tovar et al. 2020 Choudhary et al. 2021 Guttenberg et al. 2024 Medvedev et al. 2000 Nomura et al. 2000 Foster et al. 2007 Piao et al. 2009 3 3 3 3 3 To circumvent the role of airway epithelial cells, we conducted adoptive transfer experiments in which we transferred AMs from tolerized or non-tolerized mice to naïve recipient mice. We found that adoptive transfer of tolerized AM did not alter inflammation or injury caused by acute O 3 Zahalka et al. 2022 3 3 Our results differ from a model of chlorine gas adaptation in which AMs were shown to be critical ( Allard et al. 2019 3 Nodelman and Ultman 1999 Bush et al. 2001 Morris et al. 2005 Squadrito et al. 2010 3 3 Guttenberg et al. 2024 3 3 3 3 Although many genes involved in receptor-mediated signaling and production of pro-inflammatory cytokines were downregulated, we did find that some genes were upregulated by four days of O 3 Spp1 3 Barreno et al. 2013 Tovar et al. 2020 Choudhary et al. 2021 Leroy et al. 2015 Acp5 Tnfaip3 Bune et al. 2001 Vereecke et al. 2009 Tnfaip3 Cd200r2 Cd200r1 Bissonnette et al. 2020 Cd200r1 Cd200r2 Cd200r1 Cd200r2 3 It should be noted that our results were obtained using a single inbred strain, C57BL/6NJ. Given that a previous study showed that adaptation to some inhaled toxicants, including O 3 Wesselkamper et al. 2001 3 In total, our results argue against an important role for AMs in tolerance to O 3 3 Bowers et al. 2021 Nambu and Yokoyama 1982 Evans et al. 1985 3 Supplementary Material kfaf095_Supplementary_Data Acknowledgments We thank Dr. Dan Costa for many helpful conversations about tolerance and adaptation, Dr. Adelaide Tovar for brainstorming sessions, Daniel Vargas and Rowan Merritt for their assistance in performing mouse experiments, the UNC Flow Cytometry Core Facility for assistance with cell sorting, the UNC Respiratory TRACTs Core Facility for assistance with Luminex assays, and Amy Porter of the Michigan State University Investigative Histopathology Laboratory for assistance with histology. Supplementary material  Supplementary material Toxicological Sciences Funding This research was funded by National Institutes of Health grants R01ES024965, R01ES036228, K08ES029118, a UNC Center for Environmental Health and Susceptibility Pilot Project Award (P30ES010126), and a T32 training grant (ES007126-35). Conflicts of interest. None declared. Data availability Raw and processed RNA-seq data have been deposited in the Gene Expression Omnibus (GEO) under accession GSE248291 Supplementary Tables S2 to S5 https://datadryad.org/stash/share/0gDN51HZrFFJheGU_2FUVZKFn-C5bo9xkGFXgUxWeag References Allard B Panariti A Pernet E Downey J Ano S Dembele M Nakada E Fujii U McGovern TK Powell WS et al 2019 Tolerogenic signaling of alveolar macrophages induces lung adaptation to oxidative injury J Allergy Clin Immunol 144 945 961.e9 10.1016/j.jaci.2019.07.015 31356919 Arjomandi M Witten A Abbritti E Reintjes K Schmidlin I Zhai W Solomon C Balmes J. 2005 Repeated exposure to ozone increases alveolar macrophage recruitment into asthmatic airways Am J Respir Crit Care Med 172 427 432 10.1164/rccm.200502-272OC 15937293 PMC2718526 Arsalane K Gosset P Vanhee D Voisin C Hamid Q Tonnel A-B Wallaert B. 1995 Ozone stimulates synthesis of imflammatory cytokines by alveolar macrophages in vitro Am J Respir Cell Mol Biol 13 60 68 7598938 10.1165/ajrcmb.13.1.7598938 Barreno RX Richards JB Schneider DJ Cromar KR Nadas AJ Hernandez CB Hallberg LM Price RE Hashmi SS Blackburn MR et al 2013 Endogenous osteopontin promotes ozone-induced neutrophil recruitment to the lungs and airway hyperresponsiveness to methacholine Am J Physiol Lung Cell Mol Physiol 305 L118 L129 10.1152/AJPLUNG.00080.2013 23666750 PMC3726951 Bell ML McDermott A Zeger SL Samet JM Dominici F. 2004 Ozone and short-term mortality in 95 US urban communities, 1987–2000 JAMA 292 2372 2378 10.1001/jama.292.19.2372 15547165 PMC3546819 Birukova A Cyphert-Daly J Cumming RI Yu Y-R Gowdy KM Que LG Tighe RM. 2019 Sex modifies acute Ozone-Mediated airway physiologic responses Toxicol Sci 169 499 510 10.1093/toxsci/kfz056 30825310 PMC6542336 Bissonnette EY Lauzon-Joset JF Debley JS Ziegler SF. 2020 Cross-talk between alveolar macrophages and lung epithelial cells is essential to maintain lung homeostasis Front Immunol 11 583042 10.3389/FIMMU.2020.583042/BIBTEX 33178214 PMC7593577 Bowers EC Martin EM Jarabek AM Morgan DS Smith HJ Dailey LA Aungst ER Diaz-Sanchez D McCullough SD. 2021 Ozone responsive gene expression as a model for describing repeat exposure response trajectories and interindividual toxicodynamic variability in vitro Toxicol Sci 185 38 49 10.1093/toxsci/kfab128 34718810 PMC8714356 Bune AJ Hayman AR Evans MJ Cox TM. 2001 Mice lacking tartrate-resistant acid phosphatase (Acp 5) have disordered macrophage inflammatory responses and reduced clearance of the pathogen, Staphylococcus aureus Immunology 102 103 113 10.1046/J.1365-2567.2001.01145.X 11168643 PMC1783156 Bush ML Zhang W Ben-Jebria A Ultman JS. 2001 Longitudinal distribution of ozone and chlorine in the human respiratory tract: simulation of nasal and oral breathing with the single-path diffusion model Toxicology Appl Pharmacol 173 137 145 10.1006/TAAP.2001.9182 11437635 Cabello N Mishra V Sinha U DiAngelo SL Chroneos ZC Ekpa NA Cooper TK Caruso CR Silveyra P. 2015 Sex differences in the expression of lung inflammatory mediators in response to ozone Am J Physiol Lung Cell Mol Physiol 309 L1150 L1163 10.1152/ajplung.00018.2015 26342085 PMC4652152 Cho Y Abu-Ali G Tashiro H Brown TA Osgood RS Kasahara DI Huttenhower C Shore SA. 2019 Sex differences in pulmonary responses to ozone in mice. Role of the microbiome Am J Respir Cell Mol Biol 60 198 208 10.1165/rcmb.2018-0099OC 30240285 PMC6376411 Choudhary I Vo T Paudel K Patial S Saini Y. 2021 Compartment-specific transcriptomics of ozone-exposed murine lungs reveals sex- and cell type-associated perturbations relevant to mucoinflammatory lung diseases Am J Physiol Lung Cell Mol Physiol 320 L99 L125 10.1152/AJPLUNG.00381.2020 33026818 PMC7847060 Christian DL Chen LL Scannell CH Ferrando RE Welch BS Balmes JR. 1998 Ozone-induced inflammation is attenuated with multiday exposure Am J Respir Crit Care Med 158 532 537 10.1164/ajrccm.158.2.9709023 9700132 Cromar KR Gladson LA Ewart G. 2019 Trends in excess morbidity and mortality associated with air pollution above American Thoracic Society-recommended standards, 2008–2017 Ann Am Thorac Soc 16 836 845 10.1513/AnnalsATS.201812-914OC 31112414 Dahl M Bauer AK Arredouani M Soininen R Tryggvason K Kleeberger SR Kobzik L. 2007 Protection against inhaled oxidants through scavenging of oxidized lipids by macrophage receptors MARCO and SR-AI/II J Clin Invest 117 757 764 10.1172/JCI29968.The 17332894 PMC1804372 Devlin RB Folinsbee LJ Biscardi F Hatch G Becker S Madden MC Robbins M Koren HS. 1997 Inflammation and cell damage induced by repeated exposure of humans to ozone Inhal Toxicol 9 211 235 10.1080/089583797198222 Devlin RB McDonnell WF Becker S Madden MC McGee MP Perez R Hatch G House DE Koren HS. 1996 Time-dependent changes of inflammatory mediators in the lungs of humans exposed to 0.4ppm ozone for 2hr: a comparison of mediators found in broncoalveolar lavage fluid 1 and 18 hr after exposure Toxicol Appl Pharmacol 138 176 185 8658507 10.1006/taap.1996.0111 Devlin RB McDonnell WF Mann R Becker S House DE Schreinemachers D Koren HS. 1991 Exposure of humans to ambient levels of ozone for 6.6 hours causes cellular and biochemical changes in the lung Am J Respir Cell Mol Biol 4 72 81 10.1165/ajrcmb/4.1.72 1846079 Dial CF Tune MK Doerschuk CM Mock JR. 2017 Foxp3+ regulatory T cell expression of keratinocyte growth factor enhances lung epithelial proliferation Am J Respir Cell Mol Biol 57 162 173 10.1165/RCMB.2017-0019OC 28296468 PMC5576587 Dimeo MJ Glenn MG Holtzman MJ Sheller JR Nadel JA Boushey HA. 1981 Threshold concentration of ozone causing an increase in bronchial reactivity in humans and adaptation with repeated exposures Am Rev Respir Dis 124 245 248 10.1164/arrd.1981.124.3.245 6169298 Dobin A Davis CA Schlesinger F Drenkow J Zaleski C Jha S Batut P Chaisson M Gingeras TR. 2013 STAR: ultrafast universal RNA-seq aligner Bioinformatics 29 15 21 10.1093/bioinformatics/bts635 23104886 PMC3530905 Evans MJ Dekker NP Cabral-Anderson LJ Shami SG. 1985 Morphological basis of tolerance to ozone Exp Mol Pathol 42 366 376 10.1016/0014-4800(85)90086-3 3996556 Fairchild EJ. 1967 Tolerance mechanisms: determinants of lung responses to injurious agents Arch Environ Health 14 111 126 10.1080/00039896.1967.10664702/ASSET//CMS/ASSET/1BF53109-5BE1-4A6A-BC65-44AAE70D1E0F/00039896.1967.10664702.FP.PNG 5334573 Farrell BP Kerr HD Kulle TJ Sauder LR Young JL. 1979 Adaptation in human subjects to the effects of inhaled ozone after repeated exposure Am Rev Respir Dis 119 725 730 10.1164/arrd.1979.119.5.725 453698 Folinsbee LJ Bedi JF Horvath SM. 1980 Respiratory responses in humans repeatedly exposed to low concentrations of ozone Am Rev Respir Dis 121 431 439 10.1164/arrd.1980.121.3.431 7416576 Foster SL Hargreaves DC Medzhitov R. 2007 Gene-specific control of inflammation by TLR-induced chromatin modifications Nature 447 972 978 10.1038/nature05836 17538624 Frager NB Phalen RF Kenoyer JL. 1979 Adaptations to ozone in reference to mucociliary clearance Arch Environ Health 34 : 51 57 10.1080/00039896.1979.10667367 434928 Francis M Groves AM Sun R Cervelli JA Choi H Laskin JD Laskin DL. 2017 CCR2 regulates inflammatory cell accumulation in the lung and tissue injury following ozone exposure Toxicol Sci 155 474 484 10.1093/toxsci/kfw226 27837169 PMC5291213 Gu Z Eils R Schlesner M. 2016 Complex heatmaps reveal patterns and correlations in multidimensional genomic data Bioinformatics 32 2847 2849 10.1093/BIOINFORMATICS/BTW313 27207943 Guttenberg MA Vose AT Birukova A Lewars K Cumming RI Albright MC Mark JI Salazar CJ Swaminathan S Yu Z et al 2024 Tissue-resident alveolar macrophages reduce ozone-induced inflammation via MerTK-mediated efferocytosis Am J Respir Cell Mol Biol 70 493 506 10.1165/RCMB.2023-0390OC/SUPPL_FILE/DISCLOSURES.PDF 38386777 PMC11160417 Hackney JD Linn WS Mohler JG Collier CR. 1977 Adaptation to short term respiratory effects of ozone in men exposed repeatedly J Appl Physiol Respir Environ Exerc Physiol 43 82 85 10.1152/jappl.1977.43.1.82 893270 Horvath SM Gliner JA Folinsbee LJ. 1981 Adaptation to ozone: duration of effect Am Rev Respir Dis 123 496 499 10.1164/arrd.1981.123.5.496 7235372 Hussain S Johnson CG Sciurba J Meng X Stober VP Liu C Cyphert-Daly JM Bulek K Qian W Solis A et al 2020 Tlr5 participates in the TLR4 receptor complex and promotes MyD88-dependent signaling in environmental lung injury eLife 9 10.7554/ELIFE.50458 PMC7032926 31989925 Immormino RM Lauzier DC Nakano H Hernandez ML Alexis NE Ghio AJ Tilley SL Doerschuk CM Peden DB Cook DN et al 2018 Neuropilin-2 regulates airway inflammatory responses to inhaled lipopolysaccharide Am J Physiol Lung Cell Mol Physiol 315 L202 L211 10.1152/ajplung.00067.2018 29671604 PMC6139664 Jörres RA Holz O Zachgo W Timm P Koschyk S Müller B Grimminger F Seeger W Kelly FJ Dunster C et al 2000 The effect of repeated ozone exposures on inflammatory markers in bronchoalveolar lavage fluid and mucosal biopsies Am J Respir Crit Care Med 161 1855 1861 10.1164/ajrccm.161.6.9908102 10852757 Koren HS Devlin RB Graham DE Mann R McGee MP Horstman DH Kozumbo WJ Becker S House DE McDonnell WF. 1989 Ozone-induced inflammation in the lower airways of human subjects Am Rev Respir Dis 139 407 415 10.1164/ajrccm/139.2.407 2913889 Leroy P Tham A Wong H Tenney R Chen C Stiner R Balmes JR Paquet AC Arjomandi M. 2015 Inflammatory and repair pathways induced in human bronchoalveolar lavage cells with ozone inhalation PLoS One 10 e0127283 10.1371/journal.pone.0127283 26035830 PMC4452717 Linn WS Medway DA Anzar UT Valencia LM Spier CE Tsao FS Fischer DA Hackney JD. 1982 Persistence of adaptation to ozone in volunteers exposed repeatedly for six weeks Am Rev Respir Dis 125 491 495 10.1164/arrd.1982.125.5.491 7081804 Love MI Huber W Anders S Lönnstedt I Speed T Robinson M Smyth G McCarthy D Chen Y Smyth G et al 2014 Moderated estimation of fold change and dispersion for RNA-seq data with DESeq2 Genome Biol 15 550 10.1186/s13059-014-0550-8 25516281 PMC4302049 Mangiola S Papenfuss AT. 2020. J Open Source Softw 5 2472 10.21105/joss.02472 Martin M. 2011 Cutadapt removes adapter sequences from high-throughput sequencing reads EMBnet.J 17 10 10.14806/ej.17.1.200 Mass E Ballesteros I Farlik M Halbritter F Günther P Crozet L Jacome-Galarza CE Händler K Klughammer J Kobayashi Y et al 2016 Specification of tissue-resident macrophages during organogenesis Science :aaf4238 10.1126/SCIENCE.AAF4238 PMC5066309 27492475 Matzen RN. 1957 Development of tolerance to ozone in reference to pulmonary edema The Am J Physiol 190 84 88 10.1152/AJPLEGACY.1957.190.1.84 13458415 Medvedev AE Kopydlowski KM Vogel SN. 2000 Inhibition of lipopolysaccharide-induced signal transduction in endotoxin-tolerized mouse macrophages: dysregulation of cytokine, chemokine, and toll-like receptor 2 and 4 gene expression J Immunol 164 5564 5574 10.4049/JIMMUNOL.164.11.5564 10820230 Mishra V DiAngelo SL Silveyra P. 2016 Sex-specific IL-6-associated signaling activation in ozone-induced lung inflammation Biol Sex Differ 7 16 10.1186/s13293-016-0069-7 26949510 PMC4779258 Miyazaki Y Bunting M Stafforini DM Harris ES McIntyre TM Prescott SM Frutuoso VS Amendoeira FC de Oliveira Nascimento D Vieira-de-Abreu A et al 2008 Integrin alphaDbeta2 is dynamically expressed by inflamed macrophages and alters the natural history of lethal systemic infections J Immunol 180 590 600 10.4049/JIMMUNOL.180.1.590 18097061 PMC2275910 Mock JR Dial CF Tune MK Gilmore RC O'Neal WK Dang H Doerschuk CM. 2020a Impact of regulatory t cells on type 2 alveolar epithelial cell transcriptomes during resolution of acute lung injury and contributions of IFN-γ Am J Respir Cell Mol Biol 63 464 477 10.1165/RCMB.2019-0399OC/SUPPL_FILE/DISCLOSURES.PDF 32543909 PMC7528916 Mock JR Dial CF Tune MK Norton DL Martin JR Gomez JC Hagan RS Dang H Doerschuk CM. 2019 Transcriptional analysis of Foxp3+ Tregs and functions of two identified molecules during resolution of ALI JCI Insight e124958. 10.1172/JCI.INSIGHT.124958 PMC6482998 30753170 Mock JR Tune MK Dial CF Torres-Castillo J Hagan RS Doerschuk CM. 2020b Effects of IFN‐γ on immune cell kinetics during the resolution of acute lung injury Physiol Rep 8 e14368 10.14814/PHY2.14368 32061190 PMC7023890 Morris JB Wilkie WS Shusterman DJ. 2005 Acute respiratory responses of the mouse to chlorine Toxicol Sci 83 380 387 10.1093/TOXSCI/KFI038 15548641 Nambu Z Yokoyama E. 1982 Experimental suppression of tolerance to ozone and of cross-tolerance (NO2O3) in rats by actinomycin D and colchicine Environ Res 29 62 69 10.1016/0013-9351(82)90007-X 6216101 Nambu Z Yokoyama E. 1983 Antioxidant system and ozone tolerance Environ Res 32 111 117 10.1016/0013-9351(83)90197-4 6617603 Nguyen J Deering-Rice CE Armstrong BS Massa C Reilly CA Venosa A. 2022 Parenchymal and inflammatory cell responses to single and repeated ozone exposure in healthy and surfactant protein-C mutant lung Toxicol Sci 189 107 123 10.1093/TOXSCI/KFAC074 35866636 PMC9412175 Nodelman V Ultman JS. 1999 Longitudinal distribution of chlorine absorption in human airways: a comparison to ozone absorption J Appl Physiol (1985 87 2073 2080 10.1152/JAPPL.1999.87.6.2073 10601152 Nomura F Akashi S Sakao Y Sato S Kawai T Matsumoto M Nakanishi K Kimoto M Miyake K Takeda K et al 2000 Cutting edge: Endotoxin tolerance in mouse peritoneal macrophages correlates with down-regulation of surface toll-like receptor 4 expression J Immunol 164 3476 3479 10.4049/JIMMUNOL.164.7.3476 10725699 Patro R Duggal G Love MI Irizarry RA Kingsford C. 2017 Salmon provides fast and bias-aware quantification of transcript expression Nat Methods 14 417 419 10.1038/nmeth.4197 28263959 PMC5600148 Pendino KJ Meidhof TM Heck DE Laskin JD Laskin DL. 1995 Inhibition of macrophages with gadolinium chloride abrogates ozone-induced pulmonary injury and inflammatory mediator production Am J Respir Cell Mol Biol 13 125 132 10.1165/ajrcmb.13.2.7542894 7542894 Piao W Song C Chen H Diaz MAQ Wahl LM Fitzgerald KA Li L Medvedev AE. 2009 Endotoxin tolerance dysregulates MyD88- and toll/IL-1R domain-containing adapter inducing IFN-β-dependent pathways and increases expression of negative regulators of TLR signaling J Leukoc Biol 86 863 875 10.1189/JLB.0309189 19656901 PMC2796624 Que LG Stiles JV Sundy JS Foster WM. 2011 Pulmonary function, bronchial reactivity, and epithelial permeability are response phenotypes to ozone and develop differentially in healthy humans J Appl Physiol (1985) 111 679 687 10.1152/japplphysiol.00337.2011 21700892 PMC3174797 Raudvere U Kolberg L Kuzmin I Arak T Adler P Peterson H Vilo J. 2019 g:Profiler: a web server for functional enrichment analysis and conversions of gene lists (2019 update) Nucleic Acids Res 47 W191 W198 10.1093/NAR/GKZ369 31066453 PMC6602461 Ritchie ME Phipson B Wu D Hu Y Law CW Shi W Smyth GK. 2015 Limma powers differential expression analyses for RNA-sequencing and microarray studies Nucleic Acids Res 43 e47 10.1093/nar/gkv007 25605792 PMC4402510 Seltzer J Bigby BG Stulbarg M Holtzman MJ Nadel JA Ueki IF Leikauf GD Goetzl EJ Boushey HA. 1986 O3-induced change in bronchial reactivity to methacholine and airway inflammation in humans J Appl Physiol (1985) 60 1321 1326 10.1152/jappl.1986.60.4.1321 3084448 Smith GJ Walsh L Higuchi M Kelada SNP. 2019 Development of a large-scale computer-controlled ozone inhalation exposure system for rodents Inhal Toxicol 31 61 72 10.1080/08958378.2019.1597222 31021248 PMC7055063 Squadrito GL Postlethwait EM Matalon S. 2010 Elucidating mechanisms of chlorine toxicity: reaction kinetics, thermodynamics, and physiological implications Am J Physiol Lung Cell Mol Physiol 299 L289 L300 10.1152/AJPLUNG.00077.2010 20525917 PMC2951076 Stephens M. 2017 False discovery rates: a new deal Biostatistics 18 275 294 10.1093/BIOSTATISTICS/KXW041 27756721 PMC5379932 Sunil VR Patel-Vayas K Shen J Laskin JD Laskin DL. 2012 Classical and alternative macrophage activation in the lung following ozone-induced oxidative stress Toxicol Appl Pharmacol 263 195 202 10.1016/j.taap.2012.06.009 22727909 PMC3670689 Tighe RM Li Z Potts EN Frush S Liu N Gunn MD Foster WM Noble PW Hollingsworth JW. 2011 Ozone inhalation promotes CX3CR1-dependent maturation of resident lung macrophages that limit oxidative stress and inflammation J Immunol 187 4800 4808 10.4049/jimmunol.1101312 21930959 PMC3197861 Tovar A Crouse WL Smith GJ Thomas JM Keith BP McFadden KM Moran TP Furey TS Kelada SNP. 2022 Integrative analysis reveals mouse strain-dependent responses to acute ozone exposure associated with airway macrophage transcriptional activity Am J Physiol Lung Cell Mol Physiol 322 L33 L49 10.1152/AJPLUNG.00237.2021 34755540 PMC8721896 Tovar A Smith GJ Thomas JM Crouse WL Harkema JR Kelada SNP. 2020 Transcriptional profiling of the murine airway response to acute ozone exposure Toxicol Sci 173 114 130 31626304 10.1093/toxsci/kfz219 PMC6944221 Turnbull IR Gilfillan S Cella M Aoshi T Miller M Piccio L Hernandez M Colonna M. 2006 Cutting edge: TREM-2 attenuates macrophage activation J Immunol 177 3520 3524 10.4049/JIMMUNOL.177.6.3520 16951310 van Bree L Dormans JA Koren HS Devlin RB Rombout PJA. 2002 Attenuation and recovery of pulmonary injury in rats following short-term, repeated daily exposure to ozone Inhal Toxicol 14 883 900 10.1080/0895837029008467 12122568 van der Wal WAA van Bree L Marra M Rombout PJA. 1994 Attenuation of acute lung injury by ozone inhalation—the effect of low level pre-exposure Toxicol Lett 72 291 298 10.1016/0378-4274(94)90040-X 8202943 Vereecke L Beyaert R van Loo G. 2009 The ubiquitin-editing enzyme A20 (TNFAIP3) is a central regulator of immunopathology Trends Immunol 30 383 391 10.1016/J.IT.2009.05.007 19643665 Wesselkamper SC Chen LC Kleeberger SR Gordon T. 2001 Genetic variability in the development of pulmonary tolerance to inhaled pollutants in inbred mice Am J Physiol Lung Cell Mol Physiol 281 L1200 L1209 10.1152/ajplung.2001.281.5.l1200 11597912 Wiester MJ Winsett DW Richards JH Jackson MC Crissman KM Costa DL. 2000 Ozone adaptation in mice and its association with ascorbic acid in the lung Inhal Toxicol 12 577 590 10.1080/08958370050030958 10880145 Yaeger MJ Reece SW Kilburg-Basnyat B Hodge MX Pal A Dunigan-Russell K Luo B You DJ Bonner JC Spangenburg EE et al 2021 Sex differences in pulmonary eicosanoids and specialized pro-resolving mediators in response to ozone exposure Toxicol Sci 183 170 183 10.1093/TOXSCI/KFAB081 34175951 PMC8404991 Zahalka S Starkl P Watzenboeck ML Farhat A Radhouani M Deckert F Hladik A Lakovits K Oberndorfer F Lassnig C et al 2022 Trained immunity of alveolar macrophages requires metabolic rewiring and type 1 interferon signaling Mucosal Immunol 15 896 907 10.1038/s41385-022-00528-5 35856089 PMC9385480 ",
  "metadata": {
    "Title of this paper": "Trained immunity of alveolar macrophages requires metabolic rewiring and type 1 interferon signaling",
    "Journal it was published in:": "Toxicological Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469193/"
  }
}