{
  "title": "Paper_123",
  "abstract": "pmc Future Oncol Future Oncol 3069 futoncol Future Oncology 1479-6694 1744-8301 Taylor & Francis PMC12490392 PMC12490392.1 12490392 12490392 40951933 10.1080/14796694.2025.2555170 2555170 1 Version of Record Plain Language Summary Plain Language Summary of Publication Managing side effects of talquetamab for relapsed/ refractory multiple myeloma in MonumenTAL- 1: a plain language summary Chari, Shenoy, Kruyswijk and co-authors Plain Language Summary of Publication Chari Ajai  a Shenoy Samantha  a Kruyswijk Sandy  b Hilder Brandi  c O’Rourke Lisa  c van de Donk Niels W.C.J.  b a b c 15 9 2025 2025 21 23 498190 2969 2984 15 09 2025 03 10 2025 03 10 2025 Integra 27 11 2024 Integra 27 11 2024 06 5 2025 27 8 2025 © 2025 The Author(s). Published by Informa UK Limited, trading as Taylor & Francis Group. 2025 The Author(s) https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution-NonCommercial-NoDerivatives License ( http://creativecommons.org/licenses/by-nc-nd/4.0/ Plain Language Summary What is this summary about? This summary describes side effects management in the MonumenTAL-1 clinical trial, testing the drug talquetamab in participants with relapsed/ refractory multiple myeloma. What were the study results? More than 70% of participants had their cancer get better or become undetectable, with some in remission for months or years. Some participants had side effects, with some linked to how talquetamab works. Adjustments to the dose or frequency of talquetamab treatment were helpful for some participants with oral side effects and nail changes. Moisturizers and corticosteroids (medicines that reduce immune reactions) were used to manage skin and nail side effects. Participants who benefited from talquetamab, but had to modify their dose, were still likely to continue receiving the same benefits as participants who did not alter their dose. Other side effects included infections, cytokine release syndrome, and immune effector cell–associated neurotoxicity syndrome. These side effects were prevented and/or treated using strategies agreed upon by healthcare professionals for people receiving cancer treatment. Almost all these side effects had resolved at study follow-up. What do the results of this study mean? While most patients’ cancer gets better with talquetamab, patients should work proactively with their healthcare team to manage side effects. This is an abstract of the Plain Language Summary of Publication article. View the full Plain Language Summary PDF pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Acknowledgements Johnson & Johnson would like to thank all the people who took part in this study as well as their families and caregivers; the physicians and nurses who cared for the participants as well as the staff at the clinical sites; the scientific staff for their assistance. Author contributions The original authors of the full article were involved in preparing this summary. Disclosure statement A Chari reports a consulting/advisory role for AbbVie, Antengene, Bristol Myers Squibb, Genentech, GlaxoSmithKline, Johnson & Johnson, Karyopharm Therapeutics, Oncopeptides, Sanofi, Seagen, Secura Bio, Shattuck Bio, Shattuck Labs, and Takeda; and has received research funding from Amgen, Celgene, Johnson & Johnson, Pharmacyclics, Seagen, and Takeda. S Shenoy has received honoraria from Johnson & Johnson. S Kruyswijk reports other support from Johnson & Johnson outside the submitted work. B Hilder and L O’Rourke are employees and stockholders of Johnson & Johnson. NWCJ van de Donk has received research support from AMGEN, BMS, Celgene, Cellectis, Johnson & Johnson, and Novartis; and serves in advisory boards for AbbVie, Adaptive, AMGEN, Bayer, BMS, Celgene, Johnson & Johnson, Kite Pharma, Merck, Novartis, Pfizer, Roche, Sanofi, Servier, and Takeda, all paid to institution. The authors have no other relevant affiliations or financial involvement with any organization or entity with a financial interest in or financial conflict with the subject matter or materials discussed in the manuscript apart from those disclosed. Summary prepared by Sandi Wong, PhD, of Eloquent, part of Envision Ignite, an Envision Medical Communications agency, a part of Envision Pharma Group, and funded by Johnson & Johnson. Patient reviewers on this PLSP have received honorarium from Future Oncology Peer reviewers on this manuscript have no relevant financial or other relationships to disclose. Funding This manuscript was funded by Johnson & Johnson. The funder was involved in study design, data collection and analysis, decision to publish, and preparation of the manuscript. ",
  "metadata": {
    "Title of this paper": "Managing side effects of talquetamab for relapsed/ refractory multiple myeloma in MonumenTAL- 1: a plain language summary",
    "Journal it was published in:": "Future Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490392/"
  }
}