{
  "title": "Paper_982",
  "abstract": "pmc J Clin Med J Clin Med 2745 jclinmed jcm Journal of Clinical Medicine 2077-0383 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470269 PMC12470269.1 12470269 12470269 41010624 10.3390/jcm14186419 jcm-14-06419 1 Systematic Review High-Energy Lasers in Oral Oncology: A Systematic Review and Meta-Analysis Dembicka-Mączka Diana 1 * https://orcid.org/0009-0009-3173-9389 Fiegler-Rudol Jakub 2 https://orcid.org/0000-0001-8732-251X Skaba Dariusz 2 * https://orcid.org/0000-0003-1284-3809 Kawczyk-Krupka Aleksandra 3 https://orcid.org/0000-0001-5673-7413 Wiench Rafał 2 Liu Lei Academic Editor 1 2 s88998@365.sum.edu.pl rwiench@sum.edu.pl 3 akawczyk@sum.edu.pl * dianadembicka@vp.pl dskaba@sum.edu.pl 11 9 2025 9 2025 14 18 497642 6419 22 8 2025 07 9 2025 10 9 2025 11 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background: Methods 2 Results 2 2 2 2 2 Conclusions 2 oral squamous cell carcinoma laser surgery CO 2 Er:YAG Er,Cr:YSGG oncology This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction 1.1. Rationale Oral squamous cell carcinoma (OSCC) is the most common oral malignancy, accounting for about 90% of oral cancers and representing the predominant head and neck squamous cell carcinoma worldwide [ 1 1 2 2 3 4 5 2 3 4 2 5 6 7 8 9 10 11 7 1.2. Aims This review aims to systematically evaluate the use of high-energy lasers in the surgical treatment of oral squamous cell carcinoma. It focuses on identifying the types of laser systems employed, outlining their clinical application conditions, and assessing their effectiveness in terms of local tumor control, recurrence rates, and postoperative functional outcomes. By consolidating the current evidence, the review seeks to clarify the therapeutic potential and limitations of laser technologies in oral malignancy management. 2. Methods 2.1. Focused Question This systematic review was structured using the PICO framework to define the following research question: In patients diagnosed with oral malignancies (Population), does surgical treatment using high-energy laser systems (Intervention) improve oncologic outcomes, reduce the number of complications, and enhance functional recovery and quality of life (Outcome) compared to the conventional surgical methods (Comparison)? Eligible studies included randomized controlled trials (RCTs), prospective and retrospective cohort studies, and case–control studies. The inclusion criteria were as follows: (1) adults diagnosed with primary OSCC or oral precancerous lesions managed with high-energy laser resection (CO 2 2.2. Search Strategy This study followed the PRISMA 2020 guidelines [ 12 2 Figure 1 The inclusion criteria were original clinical or experimental studies assessing laser treatment for primary OSCC or precancerous lesions, focusing on recurrence, survival, complications, and quality of life. Studies comparing laser surgery with scalpel or electrocautery were also included. The key outcomes were recurrence, overall/progression-free survival, intraoperative and functional complications (speech, swallowing, pain, and aesthetics), hospital stay, resection margins, and quality of life, primarily measured using EORTC QLQ-C30, UW-QOL, and MDADI. The review also covered studies on low-level laser therapy (LLLT) and laser combined with photodynamic therapy if clinically justified. Reviews, uncontrolled case reports, inaccessible full texts, and studies lacking verified quantitative data were excluded. All publications were imported into Zotero’s bibliographic manager. A total of 824 records were identified through database searching, including 282 from PubMed, 113 from Embase, 240 from Scopus, 145 from Web of Science, and 44 from Cochrane. After removing 60 duplicate records, 764 records were screened, of which 669 were excluded. A total of 95 reports were sought for retrieval and assessed for eligibility, with 42 subsequently excluded (18 did not meet the inclusion criteria and 24 were duplicates), resulting in 53 studies being included in the review. Additionally, six records were identified through other methods (five from websites and one through citation searching), all of which were assessed for eligibility and excluded for not meeting the inclusion criteria. This is shown in Figure 1 2.3. Risk of Bias in Individual Studies Risk of bias was assessed using the Cochrane RoB 2 tool for randomized controlled trials and the ROBINS-I tool for non-randomized studies. These tools evaluate multiple domains, including random sequence generation, allocation concealment, blinding, incomplete outcome data, selective reporting, and other potential sources of bias. Each study was independently reviewed, and disagreements were resolved through discussion. 2.4. Data Analysis and Outcome Measures The meta-analysis used pooled odds ratios (ORs), hazard ratios (HRs), F-statistics, or standardized mean differences (SMDs) based on the outcome type. The data were derived from published aggregate results, not individual patient data. Heterogeneity was assessed using the I 2 2 2 p p 2 3. Results 3.1. Risk of Bias Assessment The quality of the studies included in the meta-analysis was assessed using validated tools: for randomized controlled trials, the Jadad scale was used to assess methodological quality based on the criteria of randomization, blinding, and the description of participant attrition; for cohort and other observational studies, the Newcastle–Ottawa scale was used, which provides a scoring system for three domains: selection, comparability of groups, and outcome definition. To critically assess the validity of the studies included in the meta-analysis, a systematic assessment of the risk of systematic bias was performed following the criteria of the Cochrane Collaboration. The analysis included 30 studies [ 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 Table 1 Random sequence generation and allocation concealment were rated low risk in 19 out of 30 studies, while 11 lacked sufficient detail to assess clearly. Blinding was the most vulnerable domain, with 27 studies at high risk due to the open nature of surgical procedures; only 3 studies [ 23 30 34 3.2. GRADE Assessment of the Quality of Evidence on the Clinical Efficacy of Laser Systems for OSCC To assess the reliability of the evidence base for the use of high-energy lasers in the surgical treatment of oral squamous cell carcinoma, a systematic GRADE assessment was performed for each type of laser technology. The analysis was based on seven criteria: risk of systematic bias, inconsistency of results (heterogeneity and confidence intervals), compliance with PICO criteria, statistical accuracy (sample size and number of events), publication bias (visual and statistical evaluation of funnel plots), additional confounding factors (presence of a dose-dependent effect or gradient of results), and overall confidence. The results of the assessment are shown in Table 2 2 2 2 The generalized results of the meta-analysis demonstrated that the use of laser resection is associated with a higher level of local tumor control: the mean rate in the analyzed studies was 88.6% ( n n p 13 14 2 p 2 In terms of survival, the aggregate results of the meta-analysis showed that the five-year overall survival rate after laser surgery was 72.1% (95% CI: 67.3–76.9%), while the recurrence-free survival rate reached 66.4% (95% CI: 61.1–71.2%). In the subgroup of patients with localized forms of oral squamous cell carcinoma, this figure reached 80%, which is statistically significantly higher compared to the results of classical surgical techniques ( p According to the aggregated results of the meta-analysis, CO 2 2 18 17 25 17 25 p To visualize the generalized data on local tumor control after laser surgery, a Forest plot was constructed, covering the results of 16 independent clinical trials [ 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 Figure 2 The analysis of the presented data indicates the general consistency of effect estimates across studies. Most of the confidence intervals intersect with an aggregate value of 85.25%, indicating a moderate level of heterogeneity between studies. The vertical dotted line, which represents the weighted average aggregate value, serves as a guide for the visual assessment of the deviations of each result. In general, the graph demonstrates the overwhelming effectiveness of laser surgery, with a tendency toward high levels of local control, especially in studies using modern CO 2 2 Comparative studies have evaluated the clinical outcomes of different surgical modalities for OSCC, highlighting the potential advantages of laser-based techniques over conventional methods. High-energy lasers such as CO 2 29 30 31 32 33 34 35 36 37 38 39 40 41 42 Table 3 4. Discussion 4.1. Results in the Context of Other Studies The meta-analysis showed that laser resection is associated with improved local tumor control in OSCC, with a mean control rate of 88.6% (95% CI: 84.1–92.3%), significantly higher than that of conventional surgery ( p 13 14 2 15 16 2 15 16 17 18 19 p 20 21 17 19 23 24 25 26 2 17 18 25 27 28 2 27 28 4.2. Comparative Efficiency: Laser Versus Traditional Methods Laser resection (CO 2 29 p 30 19 2 31 32 2 2 p 2 p 28 29 30 31 32 2 33 2 p 34 29 2 2 p 35 36 2 29 27 32 Data synthesis showed that CO 2 2 p 37 2 38 39 40 41 2 2 p 38 17 29 42 2 p 29 35 38 35 The data confirms the clear clinical advantage of laser technologies over traditional OSCC surgery. CO 2 2 2 Results of the Meta-Analysis Nine studies reported one-year local recurrence rates. Pooled analysis showed lower recurrence with laser resection (8.9%; 95% CI: 6.2–11.3%) versus scalpels (13.6%) and electrocoagulation (15.8%). The pooled OR was 0.58 (95% CI: 0.43–0.77; p 2 Figure 3 The results confirm the consistent advantages of laser surgery in reducing the local recurrence of oral squamous cell carcinoma. The pooled OR < 1 with a 95% CI that excludes 1 indicates a statistically significant protective effect. Heterogeneity remained within the acceptable limits, showing consistency across studies and laser types. The most consistent findings came from studies [ 16 20 21 2 15 21 36 2 p Figure 4 2 The graph shows that all studies favor laser resection over scalpels or electrosurgery, with the HR values left of the neutral line (HR = 1) indicating reduced mortality risk. The confidence intervals do not cross the neutral line, confirming the statistical significance. The low heterogeneity justified the use of a fixed effects model, with the overall effect showing a 28% reduction in death risk for the laser group (HR = 0.72; p n p 2 Figure 5 Graph analysis shows a consistent trend favoring laser surgery for safety and reproducibility across diverse clinical settings. All studies report a reduced number of intraoperative complications, with narrow confidence intervals reflecting strong internal consistency. The moderate heterogeneity is likely due to differences in complication definitions (e.g., minor burns or variable bleeding). All point estimates shifting toward OR < 1 confirms the systemic advantages of laser technology: real-time coagulation, precision cutting, and reduced tissue trauma, making it ideal for preserving function in delicate anatomical areas. Postoperative quality of life was assessed using validated tools (EORTC QLQ-C30, UW-QOL, and MDADI). CO 2 p 2 2 4.3. Specific Clinical Scenarios and Adjuvant Use of Lasers LLLT effectively reduces mucositis severity in OSCC patients undergoing chemoradiation. Randomized trials report a ≥30% reduction in pain and a significant drop in grade III–IV mucositis incidence compared to controls. Meta-analyses confirm that LLLT halves severe mucositis rates [ 43 44 45 44 45 2 46 47 2 48 49 50 51 52 53 4.4. Subgroup Analysis of Effectiveness Depending on the Type of Laser Used To explore potential effect heterogeneity, a subgroup analysis was conducted based on the type of laser used in OSCC surgery. Studies were categorized by laser type: CO 2 Table 4 Subgroup analysis showed comparable efficacy across laser types in OSCC surgery. CO 2 2 4.5. Analysis of the Asymmetry of Publication Sources To assess potential publication bias and the robustness of the findings, a funnel plot was generated using the 30 studies included in the meta-analysis ( Figure 6 The average standardized effect across the included studies is 0.569, marked by the vertical dashed line in the funnel plot. The sloped lines represent the 95% confidence limits (μ ± 1.96 × SE), forming a triangular region with its apex at SE = 0.2—the highest standard error observed. Of the 30 studies plotted, 23 (76.7%) fall within this triangle, indicating a generally balanced distribution of effect sizes relative to study precision. Seven studies (23.3%) fall outside—four on the right and three on the left, suggesting slight asymmetry. This may reflect minor publication bias, though the bilateral distribution and symmetry among high-precision studies (SE < 0.1) suggest a limited impact. Overall, the funnel plot indicates a reasonably symmetrical distribution with acceptable variability. While some asymmetry exists, it is not substantial enough to undermine the reliability or clinical relevance of the meta-analytic findings. 4.6. Limitations The current evidence base on high-energy laser surgery for OSCC has several important limitations. There is substantial clinical and technical heterogeneity across studies, including tumor sites, T stage, margin definitions, adjuvant therapies, laser types, pulse modes, tip delivery systems, cooling strategies, power settings, fluence, and surgeon experience, which limits the direct comparability and may partly explain differences in effect sizes. Many included trials and cohorts enrolled small samples or single-center populations, reducing statistical power and increasing the risk of type II errors and center-specific effects. Follow-up was often limited, constraining inferences about late recurrences, long-term function, and survival beyond five years. The reporting of key covariates such as smoking status, HPV status, comorbidity burden, and rehabilitation protocols was inconsistent, limiting adjustment for confounding and reducing the certainty about effect attribution to the laser modality itself. Device parameters and surgeon learning curves were rarely standardized or documented, yet these factors plausibly influence bleeding control, thermal injury, and margin quality. Robust randomized evidence remains scarce for certain laser platforms, with several contributing studies being observational and subject to selection bias and residual confounding. Methodologically, we restricted inclusion to English-language, full-text articles, potentially introducing language bias and excluding relevant data from other regions. Grey literature and unpublished studies were not included, which may increase publication bias despite formal small-study assessments. Although screening, extraction, and risk-of-bias judgments were performed in duplicate with adjudication, subjective elements cannot be fully eliminated. 4.7. Clinical Implications Our findings suggest that high-energy laser resection can reduce perioperative morbidity and support faster functional recovery compared with conventional surgery. Pooled data showed fewer intraoperative complications with lasers (OR 0.29, 95% CI 0.18 to 0.47) and lower local recurrence (OR 0.58, 95% CI 0.43 to 0.77) [ 13 14 15 16 17 18 19 20 21 27 28 23 35 42 2 14 17 35 20 31 35 25 42 4.8. Summary Table 5 2 5. Conclusions High-energy laser surgery shows promise in improving local control, reducing the number of perioperative complications, and enhancing early functional recovery in the treatment of OSCC, with the most consistent benefits observed for CO 2 Disclaimer/Publisher’s Note: Author Contributions Conceptualization, D.D.-M., J.F.-R. and R.W.; methodology, D.S. and A.K.-K.; software, D.S. and A.K.-K.; validation, J.F.-R. and R.W.; formal analysis, J.F.-R. and R.W.; investigation, D.D.-M., J.F.-R., and R.W.; data curation, R.W.; writing—original draft preparation, D.D.-M., J.F.-R. and R.W.; writing—review and editing, R.W., D.S. and A.K.-K.; visualization, D.D.-M.; supervision, R.W., D.S. and A.K.-K.; project administration, R.W.; funding acquisition, D.S. and A.K.-K. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement All new data generated in this study is presented in this article. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations ANOVA Analysis of Variance CI Confidence Interval CO 2 Carbon Dioxide (laser) EORTC QLQ-C30 European Organization for Research and Treatment of Cancer Quality of Life Questionnaire-Core 30 Er,Cr:YSGG Erbium, Chromium-doped Yttrium Scandium Gallium Garnet (laser) Er:YAG Erbium-doped Yttrium Aluminum Garnet (laser) F F-statistic HR Hazard Ratio I 2 I-squared statistic (heterogeneity indicator) IL-1β Interleukin-1 beta LLLT Low-Level Laser Therapy MDADI MD Anderson Dysphagia Inventory Nd:YAG Neodymium-doped Yttrium Aluminum Garnet (laser) OR Odds Ratio OSCC Oral Squamous Cell Carcinoma PICO Population, Intervention, Comparison, Outcome PDT Photodynamic Therapy PRISMA Preferred Reporting Items for Systematic Reviews and Meta-Analyses QOL Quality of Life RoB 2 Revised Cochrane risk-of-bias tool for randomized trials ROBINS-I Risk of Bias in Non-randomized Studies of Interventions SMD Standardized Mean Difference TLM Transoral Laser Microsurgery TNF-α Tumor Necrosis Factor alpha UW-QOL University of Washington Quality of Life Questionnaire WALT World Association for Laser Therapy References 1. Montero P.H. Patel S.G. Cancer of the Oral Cavity Surg. Oncol. Clin. N. Am. 2015 24 491 508 10.1016/j.soc.2015.03.006 25979396 PMC5018209 2. He S. Chakraborty R. Ranganathan S. Proliferation and Apoptosis Pathways and Factors in Oral Squamous Cell Carcinoma Int. J. Mol. Sci. 2022 23 1562 10.3390/ijms23031562 35163485 PMC8836072 3. Capote-Moreno A. Brabyn P. Muñoz-Guerra M.F. Sastre-Pérez J. Escorial-Hernandez V. Rodríguez-Campo F.J. Naval-Gías L. Oral Squamous Cell Carcinoma: Epidemiological Study and Risk Factor Assessment Based on a 39-Year Series Int. J. Oral Maxillofac. Surg. 2020 49 1525 1534 10.1016/j.ijom.2020.03.009 32360101 4. Janiak-Kiszka J. Nowaczewska M. Kaźmierczak W. Oral Squamous Cell Carcinoma: Clinical Characteristics, Treatment, and Outcomes in a Single Institution Retrospective Cohort Study Pol. J. Otolaryngol. 2022 76 12 17 10.5604/01.3001.0015.7567 35796395 5. Datarkar A. Shah V. Pandilwar P. Daware S. Datarkar S. Godase P. Is CO 2 Lasers Med. Sci. 2025 40 132 10.1007/s10103-025-04396-w 40063178 6. Lai C.C. Chen S.Y. Tu Y.K. Ding Y.W. Lin J.J. Effectiveness of Low-Level Laser Therapy versus Cryotherapy in Cancer Patients with Oral Mucositis: Systematic Review and Network Meta-Analysis Crit. Rev. Oncol. Hematol. 2021 160 103276 10.1016/j.critrevonc.2021.103276 33716203 7. Kawczyk-Krupka A. Bartusik-Aebisher D. Latos W. Cieślar G. Sieroń K. Kwiatek S. Sieroń A. Clinical Trials and Basic Research in Photodynamic Diagnostics and Therapies from the Center for Laser Diagnostics and Therapy in Poland Photochem. Photobiol. 2020 96 539 549 10.1111/php.13243 32112419 8. Tabosa A.T.L. Souza M.G. de Jesus S.F. Rocha D.F. Queiroz L.D.R.P. Santos E.M. Guimarães A.L.S. Effect of Low-Level Light Therapy before Radiotherapy in Oral Squamous Cell Carcinoma: An In Vitro Study Lasers Med. Sci. 2022 37 3527 3536 10.1007/s10103-022-03632-x 36001245 9. Shirazian S. Mohseni A. Pourshahidi S. Alaeddini M. Etemad-Moghadam S. Vatanpour M. The Effect of Different Parameters of Low-Level Laser Used in the Treatment of Oral Mucositis on the Viability and Apoptosis of Oral Squamous Cell Carcinoma Cells: In Vitro Study Photochem. Photobiol. 2025 101 330 337 10.1111/php.13997 39032055 10. Tirelli G. Zanelli E. Polesel J. Gardenal N. Ramella V. Mineo C. Boscolo-Rizzo P. Improvement in Survival Rates and Quality of Life among Patients Surgically Treated for Squamous Cell Carcinoma of the Oral Cavity J. Maxillofac. Oral Surg. 2024 1 1 10 10.1007/s12663-024-02289-z 11. Jabłoński P. Musiał M. Wiench R. Stefanik N. Olchowy C. Matys J. Grzech-Leśniak K. Photobiomodulation Therapy in the Treatment of Oral Mucositis: A Case Report Medicina 2022 58 618 10.3390/medicina58050618 35630035 PMC9147415 12. Page M.J. McKenzie J.E. Bossuyt P.M. Boutron I. Hoffmann T.C. Mulrow C.D. Moher D. The PRISMA 2020 Statement: An Updated Guideline for Reporting Systematic Reviews BMJ 2021 372 n71 10.1136/bmj.n71 33782057 PMC8005924 13. Dalton C.L. Milinis K. Houghton D. Ridley P. Davies K. Williams R. Jones T.M. Transoral Laser Microsurgery and Radiotherapy for Oropharyngeal Squamous Cell Carcinoma: Equitable Survival and Enhanced Function Compared with Contemporary Standards of Care Eur. J. Surg. Oncol. 2020 46 2042 2049 10.1016/j.ejso.2020.06.045 32893045 14. Sievert M. Goncalves M. Zbidat A. Traxdorf M. Mueller S.K. Iro H. Gostian A.O. Outcomes of Transoral Laser Microsurgery and Transoral Robotic Surgery in Oropharyngeal Squamous Cell Carcinoma Auris Nasus Larynx 2021 48 295 301 10.1016/j.anl.2020.08.019 32883577 15. Rodriguez-Lujan A. López-Jornet P. Pons-Fuster López E. Recurrence of Oral Leukoplakia after CO 2 Cancers 2022 14 5455 10.3390/cancers14215455 36358873 PMC9658806 16. Nammour S. Mobadder M.E. Namour A. Namour M. Romeo U. España-Tost A.J. Vescovi P. Success Rate of Benign Oral Squamous Papilloma Treatments after Different Surgical Protocols (Conventional, Nd:YAG, CO 2 Photobiomodul. Photomed. Laser Surg. 2021 39 123 130 10.1089/photob.2020.4916 33450170 17. Broccoletti R. Cafaro A. Gambino A. Romagnoli E. Arduino P.G. Er:YAG Laser versus Cold Knife Excision in the Treatment of Nondysplastic Oral Lesions: A Randomized Comparative Study for the Postoperative Period Photomed. Laser Surg. 2015 33 604 609 10.1089/pho.2015.3967 26588688 18. Zaffe D. Vitale M.C. Martignone A. Scarpelli F. Botticelli A.R. Morphological, Histochemical, and Immunocytochemical Study of CO 2 Photomed. Laser Surg. 2004 22 185 189 10.1089/1549541041438678 15315724 19. González-Mosquera A. Seoane J. García-Caballero L. López-Jornet P. García-Caballero T. Varela-Centelles P. Er,Cr:YSGG Lasers Induce Fewer Dysplastic-Like Epithelial Artefacts than CO 2 Br. J. Oral Maxillofac. Surg. 2012 50 508 512 10.1016/j.bjoms.2011.09.006 21974898 20. Jacobs V.C. de Carvalho R.N. Sanches E.J. Tenório L.R. Nakai M.Y. Menezes M.B. Diode Laser Surgery for Early-Stage Oral and Oropharyngeal Cancer: A Comparative Study with Conventional Electrosurgery Einstein 2024 22 S29 21. Tirelli G. Bertolin A. Guida F. Zucchini S. Tofanelli M. Rizzotto G. Gardenal N. Post-Operative Outcomes of Different Surgical Approaches to Oropharyngeal Squamous Cell Cancer: A Case-Matched Study J. Laryngol. Otol. 2021 135 348 354 10.1017/S0022215121000876 33818328 22. Iaria R. Giovannacci I. Meleti M. Leão J.C. Vescovi P. Management of a Carcinoma In Situ of the Tongue Margin Using a Nd:YAG Laser, Cross-Linked Hyaluronic Acid Gel and a Porcine Pericardium Resorbable Membrane: A Case Report BMC Oral Health 2025 25 378 10.1186/s12903-025-05701-3 40082873 PMC11907964 23. Davis R.K. Laser Surgery of the Oral Cavity and Oropharynx Endoscopic Laser Surgery Handbook CRC Press Boca Raton, FL, USA 2020 151 161 Available online: https://www.taylorfrancis.com/chapters/edit/10.1201/9781003065753-3/laser-surgery-oral-cavity-oropharynx-kim-davis (accessed on 2 June 2025) 24. Suter V.G.A. Altermatt H.J. Bornstein M.M. A Randomized Controlled Trial Comparing Surgical Excisional Biopsies Using CO 2 Int. J. Oral Maxillofac. Surg. 2020 49 99 106 10.1016/j.ijom.2019.05.012 31230766 25. Boras V.V. Gabrič D. Comparison of Different Lasers in the Treatment of Precancerous Lesions of the Oral Cavity Libri Oncol. 2016 44 37 43 26. Nayak D.R. Balakrishnan R. Dalakoti P. Bhanu U. Nair S. Poojary K. KTP 532 Laser Assisted Surgery for Oral Cavity Malignancy: A Retrospective Study Indian J. Otolaryngol. Head Neck Surg. 2023 75 416 419 10.1007/s12070-022-03214-x PMC10235248 37275071 27. Gharibian M. The Use of Lasers in Treatment of Cancerous Lesions in the Mouth Master’s Thesis Boston University Boston, MA, USA 2022 Available online: https://www.proquest.com/openview/6f9fc0f1865bedb6c82a58ffcc5b7e6b/1?pq-origsite=gscholar&cbl=18750&diss=y (accessed on 31 May 2025) 28. Paglioni M.P. Migliorati C.A. Faustino I.S.P. Mariz B.A.L.A. Roza A.L.O.C. Vargas P.A. Santos-Silva A.R. Laser Excision of Oral Leukoplakia: Does It Affect Recurrence and Malignant Transformation? A Systematic Review and Meta-Analysis Oral Oncol. 2020 109 104850 10.1016/j.oraloncology.2020.104850 32540612 29. Bhandari R. Singla K. Sandhu S.V. Malhotra A. Kaur H. Pannu A.K. Soft Tissue Applications of Lasers: A Review Int. J. Dent. Res. 2014 2 16 19 10.14419/ijdr.v2i1.1720 30. Paglioni M.P. Pedroso C.M. Faustino I.S.P. Vargas P.A. de Goes M.F. Martins M.D. Santos-Silva A.R. Wound Healing and Pain Evaluation Following Diode Laser Surgery vs. Conventional Scalpel Surgery in the Surgical Treatment of Oral Leukoplakia: A Randomized Controlled Trial Front. Oral Health 2025 6 1568425 10.3389/froh.2025.1568425 40098816 PMC11911516 31. Bilder A. Rachmiel A. Ginini J.G. Capucha T. Ohayon C. Weitman E. Emodi O. A Comparative Study of Mucosal Wound Healing after Excision with a Scalpel, Diode Laser, or CO 2 Plast. Reconstr. Surg. Glob. Open 2023 11 e5150 10.1097/GOX.0000000000005150 37547354 PMC10403016 32. Bakshi I. Rana P. Srivastava G. Rawat H.S. Comparing Minimally Invasive Techniques to Traditional Surgery for Specific Tumor or Cancer Types: A Comprehensive Review Int. J. Multidiscip. Res. 2024 6 1 17 33. Yousefi-Koma A.A. Baniameri S. Yousefi-Koma H. Mashhadiabbas F. Comparative Evaluations of Different Surgical and Non-Surgical Treatment Methods for Early Invasive and Micro Invasive Squamous Cell Carcinoma in the Oral and Maxillofacial Regions: A Systematic Review J. Stomatol. Oral Maxillofac. Surg. 2024 126 102034 10.1016/j.jormas.2024.102034 39251070 34. Liu R. Sun K. Wang Y. Jiang Y. Kang J. Ma H. Clinical Comparison between Er:YAG and CO 2 Medicine 2020 99 e20942 10.1097/MD.0000000000020942 32791674 PMC7387021 35. Rosenthal M. Baser R.E. Migliacci J. Boyle J.O. Morris L.G. Cohen M.A. Ganly I. Flexible Fiber-Based CO 2 Laryngoscope Investig. Otolaryngol. 2021 6 690 698 10.1002/lio2.572 34401493 PMC8356859 36. Rezazadeh F. Andisheh-Tadbir A. Malek Mansouri Z. Khademi B. Bayat P. Sedarat H. Tayebi Khorami E. Evaluation of Recurrence, Mortality and Treatment Complications of Oral Squamous Cell Carcinoma in Public Health Centers in Shiraz during 2010 to 2020 BMC Oral Health 2023 23 341 10.1186/s12903-023-03071-2 37254138 PMC10227788 37. Romeo U. Russo C. Palaia G. Lo Giudice R. Del Vecchio A. Visca P. De Biase A. Biopsy of Different Oral Soft Tissue Lesions by KTP and Diode Laser: Histological Evaluation Sci. World J. 2014 2014 761704 10.1155/2014/761704 PMC4227390 25405233 38. Rashid M. Hashmi M.A. Maqbool S. Dastigir M. Comparison of Efficacy of Carbon Dioxide (CO 2 J. Coll. Physicians Surg. Pak. 2015 25 747 751 26454392 10.2015/JCPSP.747751 39. Zhou S. Zhang X. Liu W. Chen W. Evaluating Surgical Excision to Prevent Progression of Oral Precancerous Lesions: Highlighting Randomized Controlled Trials and Cohort Studies J. Dent. Sci. 2023 18 1876 1882 10.1016/j.jds.2023.05.033 37799862 PMC10547983 40. Brennan P.A. Dylgjeri F. Coletta R.D. Arakeri G. Goodson A.M. Surgical Tumour Margins and Their Significance in Oral Squamous Cell Carcinoma J. Oral Pathol. Med. 2022 51 311 314 10.1111/jop.13276 35080080 41. Nascimento J.P.S. Souto G.R. de Souza P.E.A. de Freitas J.B. Grossmann S.D.M.C. de Souza Noronha V.R.A. The Use of High-Power Laser for Surgical Resection of Small Lesions in Oral Pathology: Report of Two Cases Oral Surg. Oral Med. Oral Pathol. Oral Radiol. 2024 137 e229 e230 10.1016/j.oooo.2023.12.399 42. Roe J. Angadi V. Balaji A. Hutcheson K. Speech and Swallowing Rehabilitation Stell and Maran’s Head and Neck Surgery and Oncology 6th ed. CRC Press Boca Raton, FL, USA 2024 332 343 Available online: https://www.taylorfrancis.com/chapters/edit/10.1201/9781003515227-21/speech-swallowing-rehabilitation-justin-roe-vrushali-angadi-arun-balaji-kate-hutcheson (accessed on 2 June 2025) 43. Peng J. Shi Y. Wang J. Wang F. Dan H. Xu H. Zeng X. Low-Level Laser Therapy in the Prevention and Treatment of Oral Mucositis: A Systematic Review and Meta-Analysis Oral Surg. Oral Med. Oral Pathol. Oral Radiol. 2020 130 387 397 10.1016/j.oooo.2020.05.014 32624448 44. Hamblin M.R. Photobiomodulation and Light Therapy in Oncology: Mechanisms and Positive or Negative Effects on Cancer Orofacial Supportive Care in Cancer: A Contemporary Oral Oncology Perspective Springer Cham, Switzerland 2022 255 286 Available online: https://link.springer.com/chapter/10.1007/978-3-030-86510-8_17 (accessed on 2 June 2025) 45. Robijns J. Nair R.G. Lodewijckx J. Arany P. Barasch A. Bjordal J.M. Bossi P. Chilles A. Corby P.M. Epstein J.B. Photobiomodulation Therapy in Management of Cancer Therapy-Induced Side Effects: WALT Position Paper 2022 Front. Oncol. 2022 12 927685 10.3389/fonc.2022.927685 36110957 PMC9468822 46. Yao Y. Shen X. Shi L. Tang G. Wu L. The Combination of Photodynamic Therapy and Fractional CO 2 Photodiagn. Photodyn. Ther. 2020 29 101597 10.1016/j.pdpdt.2019.101597 31707101 47. Guo Q. Ji X. Zhang L. Liu X. Wang Y. Liu Z. Liu H. Differences in the Response of Normal Oral Mucosa, Oral Leukoplakia, Oral Squamous Cell Carcinoma-Derived Mesenchymal Stem Cells, and Epithelial Cells to Photodynamic Therapy J. Photochem. Photobiol. B Biol. 2024 255 112907 10.1016/j.jphotobiol.2024.112907 38677259 48. Zuo J. Huo M. Wang L. Li J. Chen Y. Xiong P. Photonic Hyperthermal and Sonodynamic Nanotherapy Targeting Oral Squamous Cell Carcinoma J. Mater. Chem. B 2020 8 9084 9093 10.1039/D0TB01089H 32926057 49. Hamdy O. Nour M. Kamel S.S. Eltayeb E.A. Zaky A.A. Faid A.H. Enhanced Laser-Induced Fluorescence and Raman Spectroscopy with Gold Nanoparticles for the Diagnosis of Oral Squamous Cell Carcinoma Discover Appl. Sci. 2024 6 157 10.1007/s42452-024-05817-1 50. Fan H.Y. Zhu Z.L. Zhang W.L. Yin Y.J. Tang Y.L. Liang X.H. Zhang L. Light Stimulus Responsive Nanomedicine in the Treatment of Oral Squamous Cell Carcinoma Eur. J. Med. Chem. 2020 199 112394 10.1016/j.ejmech.2020.112394 32402938 51. Parker S. Cronshaw M. Anagnostaki E. Mylona V. Lynch E. Grootveld M. Current Concepts of Laser-Oral Tissue Interaction Dent. J. 2020 8 61 10.3390/dj8030061 PMC7558496 32605215 52. Eber J. Schohn A. Carinato H. Brahimi Y. Schmitt M. Noël G. A Pilot Study Comparing Intraoral and Transcutaneous Photobiomodulation for Oral Mucositis in Head and Neck Cancer Patients Undergoing Radiotherapy or Chemoradiotherapy J. Clin. Med. 2025 14 2430 10.3390/jcm14072430 40217880 PMC11989608 53. Nandini D.B. Rao R.S. Hosmani J. Khan S. Patil S. Awan K.H. Novel Therapies in the Management of Oral Cancer: An Update Dis.-a-Mon. 2020 66 101036 10.1016/j.disamonth.2020.101036 32594997 Figure 1 PRISMA 2020 flowchart. Figure 2 Forest plot of local control of the tumor process after laser surgery for OSCC based on clinical trials. The yellow dashed line in the forest plot represents the aggregate or pooled value across all the studies included in the analysis. Black diamonds represent the point estimates for each individual study. Source: [ 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 Figure 3 Forest plot of recurrence rates after laser versus conventional surgery for OSCC. Source: [ 13 14 15 16 20 21 36 39 Figure 4 Forest plot of overall survival after laser and traditional resection of OSCC. Source: [ 13 14 21 35 36 Figure 5 Forest plot of intraoperative complications in laser and conventional surgical treatment of OSCC. Source: [ 13 14 16 20 21 23 35 36 Figure 6 Funnel plot to assess the presence of publication bias in the studies included in the meta-analysis. Source: [ 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 jcm-14-06419-t001_Table 1 Table 1 Risk of bias assessment in included studies. Authors Year Generation of a Random Sequence Hiding the Distribution Blinding Incomplete Initial Data Selective Reporting of Results Other Sources of Error Dalton et al. [ 13 2020 Low Low High Low Low Low Sievert et al. [ 14 2021 Low Low High Low Low Low Rodriguez-Lujan et al. [ 15 2022 Unclear Unclear High Low Low Unclear Nammour et al. [ 16 2021 Low Low High Low Low Low Broccoletti et al. [ 17 2015 Low Low High Low Low Low Zaffe et al. [ 18 2004 Unclear Unclear High Low Low Unclear González-Mosquera et al. [ 19 2012 Unclear Unclear High Low Low Unclear Jacobs et al. [ 20 2024 Low Low High Low Low Low Tirelli et al. [ 21 2021 Low Low High Low Low Low Iaria et al. [ 22 2025 Unclear Unclear High Low Low Unclear Davis et al. [ 23 2020 Unclear Unclear Low Low Low Unclear Suter et al. [ 24 2020 Low Low High Low Low Low Boras et al. [ 25 2016 Unclear Unclear High Low Low Unclear Nayak et al. [ 26 2023 Low Low High Low Low Low Gharibian et al. [ 27 2022 Unclear Unclear High Low Low Unclear Paglioni et al. (2020) [ 28 2020 Low Low High Low Low Low Bhandari et al. [ 29 2014 Unclear Unclear High Low Low Unclear Paglioni et al. (2025) [ 30 2025 Low Low Low Low Low Low Bilder et al. [ 31 2023 Low Low High Low Low Low Bakshi et al. [ 32 2024 Low Low High Low Low Low Yousefi-Koma et al. [ 33 2024 Low Low High Low Low Low Liu et al. [ 34 2020 Low Low Low Low Low Low Rosenthal et al. [ 35 2021 Low Low High Low Low Low Rezazadeh et al. [ 36 2023 Unclear Unclear High Low Low Unclear Romeo et al. [ 37 2014 Low Low High Low Low Low Rashid et al. [ 38 2015 Unclear Unclear High Low Low Unclear Zhou et al. [ 39 2023 Low Low High Low Low Low Brennan et al. [ 40 2022 Low Low High Low Low Low Nascimento et al. [ 41 2024 Unclear Unclear High Low Low Unclear Roe et al. [ 42 2024 Low Low High Low Low Low jcm-14-06419-t002_Table 2 Table 2 GRADE assessment of the quality of evidence for the clinical effectiveness of different types of high-energy lasers in the surgical treatment of OSCC. Laser Type RoB Inconsistency (I 2 Indirectness (PICO Compliance) Inaccuracy (Sample Size, Events) Publication Bias (Funnel Plot, Egger) Other Factors (Effect, Dose, Gradient) Final Assessment CO 2 Low (high Jadad, full randomization) I 2 Direct compliance with PICO High power: n Funnel is symmetrical; Egger p Dose effect is moderate, gradient is clear High Diode Moderate (observational, RoBINS-I = medium) I 2 Partial correspondence is often without direct comparisons n Egger p Weak gradient, effect in subgroups Moderate Nd:YAG Moderate (retrospective, incomplete data) I 2 Limited compliance (P is not always OSCC) n Suspicion of bias (Egger p High impact but no gradient Low Er:YAG Low (2 RCTs, Jadad ≥4) I 2 Full match between population and intervention n The funnel is symmetrical, Egger p Confirmed effect, dose dependence High Er,Cr: Low (RCT + case series with control groups) I 2 Direct compliance in 100% of cases n Visually symmetrical funnel plot Sustained effect, significant dose-dependent profile High Source: [ 29 30 31 32 33 34 35 36 37 38 39 40 41 42 jcm-14-06419-t003_Table 3 Table 3 Comparative effectiveness of laser and conventional methods in the treatment of OSCC.  CO 2 Diode Laser Nd:YAG Er:YAG Er,Cr:YSGG Scalpel Electrocoagulation Statistical Significance Duration of hospitalization, days 1.7–2.1 1.7–2.1 1.7–2.1 1.7–2.1 1.7–2.1 3.2–3.9 – p Intraoperative complications, % 2.3 3.5 3.8 2.9 2.8 9.1 11.4 χ 2 p Frequency of radical resections, % (clean edges) 92.7 91–92 91 up to 92 93.1 85.4 81.9 χ 2 p Relapse rate within 12 months, % 9.8 11.4 12.5–13 10.5–11 10–10.3 14.1 16.7 χ 2 p Functional complications (speech, swallowing), % 17.2 15.8 18.7–19.3 14.9–15.2 13.9 24.7 28.4 χ 2 p Quality of life (EORTC QLQ-C30, after 3 months, points) 81.3 80.1 77.9 80.8 82.4 73.6 71.4 F = 5.97; p Source: [ 29 30 31 32 33 34 35 36 37 38 39 40 41 42 jcm-14-06419-t004_Table 4 Table 4 Subgroup analysis of effectiveness depending on the type of laser used. Laser Type SMD 95% CI I 2 Number of Studies CO 2 0.61 0.38–0.84 42 10 [ 13 14 16 17 20 21 24 28 37 42 Er:YAG 0.48 0.29–0.67 35 5 [ 26 29 32 33 38 Er,Cr:YSGG 0.52 0.27–0.77 39 4 [ 27 31 36 41 Diode 0.58 0.34–0.82 45 6 [ 15 18 19 22 35 39 Nd:YAG 0.55 0.3–0.8 37 5 [ 23 25 30 34 40 jcm-14-06419-t005_Table 5 Table 5 Summary of advantages and disadvantages of high-energy laser systems in OSCC surgery. Laser Type Advantages (from Study Results) Disadvantages (from Study Results) Best-Suited Clinical Scenarios CO 2 - Highest local tumor control (90.3%) - Limited penetration depth → less effective for deep lesions Superficial or moderately deep lesions of the tongue, floor of the mouth, or retromolar trigone, where function preservation is critical Diode - Strong hemostatic effect, especially in vascularized areas (lowest number of bleeding-related complications: 2.1%) - Lower precision in margin control compared to CO 2 Small superficial lesions, patients with bleeding disorders or fragile vasculature Nd:YAG - Greatest tissue penetration for deeply infiltrative lesions - Higher postoperative pain and edema Deep tumors with >10 mm depth of invasion or extension beyond submucosa (deep lesions) Er:YAG - Minimal thermal damage and smallest necrosis zone - Limited coagulation ability → adjunctive hemostasis may be required Early-stage superficial OSCC, lesions in delicate anatomical areas requiring precision Er,Cr:YSGG - Balanced cutting and coagulation with minimal epithelial artifacts 2 - Steeper learning curve for surgeons Functionally sensitive regions (tongue or floor of the mouth), where speech and swallowing preservation are essential Source: Synthesized from pooled data in Figure 3 Figure 4 Figure 5 Table 3 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 ",
  "metadata": {
    "Title of this paper": "Novel Therapies in the Management of Oral Cancer: An Update",
    "Journal it was published in:": "Journal of Clinical Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470269/"
  }
}