{
  "title": "Paper_560",
  "abstract": "Psychooncology Psychooncology 319 nihpa Psycho-oncology 1057-9249 1099-1611 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12477991 PMC12477991.1 12477991 12477991 NIHMS2108260 35088926 10.1002/pon.5887 NIHMS2108260 NIHPA2108260 1 Article Patient, caregiver, and oncologist predictions of quality of life in advanced cancer: Accuracy and associations with end‐of‐life care and caregiver bereavement Hoerger Michael 1 2 Gramling Robert 3 Epstein Ronald 4 5 Fenton Joshua J. 6 Mohile Supriya G. 4 5 Kravitz Richard L. 6 7 Mossman Brenna 2 Prigerson Holly G. 8 Alonzi Sarah 2 Malhotra Kirti 7 Duberstein Paul 9 1 2 3 4 5 6 7 8 9 Correspondence: Michael Hoerger, Department of Psychology, Tulane University, New Orleans, Louisiana, USA. mhoerger@tulane.edu 6 2022 10 2 2022 31 6 497744 978 984 24 09 2025 29 09 2025 30 09 2025 30 09 2025 Background: Informed treatment decision‐making necessitates accurate prognostication, including predictions about quality of life. Aims: We examined whether oncologists, patients with advanced cancer, and caregivers accurately predict patients’ future quality of life and whether these predictions are prospectively associated with end‐of‐life care and bereavement. Materials & Methods: We conducted secondary analyses of clinical trial data. Patients with advanced cancer ( n n n n Results: Caregivers ( P P P P P P P P Conclusion: When caregivers have more negative expectations about patients’ quality of life, patients receive less intensive end‐of‐life care, and caregivers report worse bereavement outcomes. affective forecasting cancer caregivers end‐of‐life oncology prognostication psychooncology pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Patient, caregiver, and oncologist predictions of quality of life in advanced cancer: Accuracy and associations with end‐of‐life care and caregiver bereavement",
    "Journal it was published in:": "Psycho-oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477991/"
  }
}