{
  "title": "Paper_553",
  "abstract": "pmc Int J Chron Obstruct Pulmon Dis Int J Chron Obstruct Pulmon Dis 692 copd copd International Journal of Chronic Obstructive Pulmonary Disease 1176-9106 1178-2005 Dove Press PMC12478208 PMC12478208.1 12478208 12478208 41031390 10.2147/COPD.S534974 534974 1 Original Research Comparable Clinical Outcomes with Tiotropium/Olodaterol or Fluticasone Furoate/Umeclidinium/Vilanterol in Patients with COPD and Blood Eosinophil Count ≤300 Cells/μL Sethi et al Sethi et al http://orcid.org/0000-0003-0809-7604 Sethi Sanjay  1 http://orcid.org/0000-0002-1895-0384 Clark Brendan  2 http://orcid.org/0000-0003-0104-5836 Buysman Erin K  3 http://orcid.org/0009-0004-4805-1314 Sargent Andrew  3 http://orcid.org/0000-0002-5370-4090 Bengtson Lindsay G S  3 1 Jacobs School of Medicine and Biomedical Sciences, University at Buffalo Buffalo NY USA 2 HEOR Value Demonstration, Boehringer Ingelheim Pharmaceuticals, Inc. Ridgefield CT USA 3 Health Economics and Outcomes Research, Optum Life Sciences Eden Prairie MN USA Correspondence: Brendan Clark, HEOR Value Demonstration, Boehringer Ingelheim Pharmaceuticals, Inc. 900 Ridgebury Road Ridgefield CT 06877 USA 25 9 2025 2025 20 478627 3327 3338 19 4 2025 07 9 2025 25 09 2025 30 09 2025 01 10 2025 © 2025 Sethi et al. 2025 Sethi et al. https://creativecommons.org/licenses/by-nc/4.0/ This work is published and licensed by Dove Medical Press Limited. The full terms of this license are available at https://www.dovepress.com/terms.php http://creativecommons.org/licenses/by-nc/4.0/ https://www.dovepress.com/terms.php Introduction Assessment of blood eosinophil count (BEC) is recommended to guide the use of inhaled corticosteroids in chronic obstructive pulmonary disease (COPD), with BEC ≥300 cells/μL predictive of patients most likely to benefit. Objective To compare outcomes between patients initiating dual bronchodilator therapy with tiotropium/olodaterol (TIO/OLO) versus triple therapy with fluticasone furoate/umeclidinium/vilanterol (FF/UMEC/VI) in patients with COPD and BEC ≤300 cells/μL. Methods A retrospective cohort study using claims data from the Optum Research Database. Patients with COPD initiated on TIO/OLO or FF/UMEC/VI between 01 June 2015 and 30 November 2019, with a baseline BEC were included. TIO/OLO initiators were 1:1 propensity score matched with FF/UMEC/VI initiators. Time to first exacerbation and pneumonia diagnosis were assessed using Kaplan-Meier analysis. COPD exacerbations and COPD and/or pneumonia-related healthcare resource utilization (HRU) and cost outcomes were presented as population annualized averages. Results The study population included 3867 individuals with a baseline BEC result. Among these, 3168 (81.9%) had BEC ≤300 cells/μL. After matching, 1098 matched pairs with BEC ≤300 cells/μL were retained. The follow-up annualized count of moderate/severe exacerbations was not significantly different between TIO/OLO and FF/UMEC/VI initiators (1.05 vs 0.99, p=0.535). Annualized counts of COPD and/or pneumonia-related HRU were not significantly different, except for emergency department visits, which were lower for TIO/OLO than FF/UMEC/VI (0.59 vs 0.83, p=0.018). Annualized COPD and/or pneumonia-related emergency department ($370 vs $538, p=0.034) and pharmacy costs ($4692 vs $6573, p<0.001) were lower for TIO/OLO versus FF/UMEC/VI initiators. Conclusion Eight in ten patients with COPD who initiated FF/UMEC/VI had BEC ≤300 cells/μL. TIO/OLO and FF/UMEC/VI users with BEC ≤300 cells/μL experienced similar rates of COPD exacerbations. TIO/OLO initiators incurred lower pharmacy costs related to COPD and/or pneumonia than FF/UMEC/VI initiators. These results support treatment recommendations of reserving inhaled corticosteroids for frequent exacerbators and patients with elevated eosinophil counts. Plain Language Summary Chronic obstructive pulmonary disease (COPD) is a condition caused by lung damage that makes breathing difficult. Patients with COPD have several inhaler options for treating their symptoms and preventing COPD flareups. Some inhalers include steroids, which can help reduce lung inflammation. However, inhaled steroids can also cause side effects such as pneumonia. To choose the best inhaler for COPD patients, a blood draw can be used to check the levels of eosinophils, a type of white blood cell. Patients with high blood eosinophil count are most likely to benefit from inhaled steroids. However, most patients with COPD do not have high eosinophil levels. This study included patients without high eosinophil levels and compared COPD flare-ups and pneumonia outcomes in patients who used an inhaler with two (no steroid) or three medications (including a steroid). It also examined how often these patients needed to be treated for COPD or pneumonia and how expensive it was. The study found that for patients without high eosinophil levels, the number of COPD flare-ups and pneumonia events was similar for those who received an inhaler containing a steroid and those who did not. It was also found that medication costs related to COPD treatment were lower in patients using an inhaler without steroids. These findings indicate that COPD patients without high eosinophil counts are less likely to benefit from inhaled steroids and may help encourage healthcare providers to check eosinophil levels when selecting inhaled medications for patients with COPD. Keywords dual bronchodilator triple therapy eosinophil claims exacerbations costs was supported and funded by Boehringer Ingelheim Pharmaceuticals, Inc This study was supported and funded by Boehringer Ingelheim Pharmaceuticals, Inc. The authors did not receive payment related to the development of the manuscript. The authors meet criteria for authorship as recommended by the ICMJE. Boehringer Ingelheim Pharmaceuticals, Inc. was given the opportunity to review the manuscript for medical and scientific accuracy as well as intellectual property considerations. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Chronic obstructive pulmonary disease (COPD) is a progressive inflammatory lung disease characterized by airflow obstruction and symptoms of dyspnea, cough, and sputum production. 1 2–4 5 6 Peripheral blood eosinophil counts (BEC) have been shown to correlate with sputum eosinophil counts and are increasingly used as a more convenient surrogate for eosinophilic lung inflammation. 7 5 8 8 9 10 11 The 2025 Global Initiative for Chronic Obstructive Lung Disease (GOLD) report recommends pharmacological management of stable COPD based on assessment of patient symptoms, history of exacerbations, and BEC. 12 Although treatment algorithms have changed over time, since 2011, GOLD has consistently recommended reserving triple therapy for patients with frequent exacerbations. Despite these evidence-based recommendations, one in five patients starting triple therapy in clinical practice is maintenance-naive with a low exacerbation history. 13 14 15 Methods Study Design and Data Source This retrospective, non-interventional cohort study used medical and pharmacy claims data from the Optum Research Database (ORD). Medical claims included diagnosis and procedure codes recorded using the International Classification of Diseases, Ninth (ICD-9-CM) and Tenth (ICD-10-CM) Revisions, Clinical Modification codes, Current Procedural Terminology codes, Healthcare Common Procedure Coding System codes, site of service codes, provider specialty codes, revenue codes (for facilities), paid amounts, and other information. This claims database is fully de-identified and compliant with the Health Insurance Portability and Accountability Act. This study used aggregated, de-identified insurance claims data and, therefore, required no review by an institutional review board or informed consent procedures. This study followed the Strengthening the Reporting of Observational Studies in Epidemiology (STROBE) guidelines to ensure thorough reporting of the cohort study design, participant selection, variable measurements, and statistical analysis. This study was registered at ClinicalTrials.gov (identifier: NCT05127304 16 Study Population Patients with COPD were identified based on the presence of at least one facility claim with a diagnosis of COPD in the primary position or at least two professional claims with a diagnosis code of COPD in any position on separate dates of service from 01 June 2014 through 31 December 2019 (study period). The study population included patients with at least 30 consecutive days supply of TIO/OLO or FF/UMEC/VI initiated during the identification period of 01 June 2015 to 30 November 2019, allowing for a minimum of 12 months of data prior to and 30 days after treatment initiation. The index date was defined as the fill date of the first TIO/OLO or FF/UMEC/VI pharmacy claim with a minimum of 30 days of consecutive treatment during the identification period. Continuous health plan enrollment with medical and pharmacy coverage for 12 months prior to and including the index date (baseline period) and for at least 30 days following the index date was required. Included patients were at least 40 years of age on the index date. Individuals with pharmacy claims for both TIO/OLO and FF/UMEC/VI on the index date, and those who switched to another maintenance therapy (any non-index LAMA, LABA, or ICS) within 30-days following the index date were excluded. Patients with two or more baseline medical claims on separate dates of service with a diagnosis of asthma, cystic fibrosis, lung cancer, or interstitial lung disease, or any medical claim for lung volume reduction procedure were also excluded. Patients with 7 or more days of overlapping supply of LAMA and LABA, with or without ICS, in the six months prior to the index date were excluded to ensure that the included patients were new users at the class level. Individuals were also excluded due to unknown age, gender, business line, or unknown/other geographic region. The subgroup of patients with at least one blood eosinophil laboratory result during the 6 months prior to the index date through 15 days after the index date was retained for this analysis. Measures The 12-month period prior to and including the index date (index date – 364 days through index date) was used to assess baseline patient characteristics. Baseline measures included patient demographics, clinical characteristics, exacerbation history, respiratory medication use, HRU, and costs. Baseline respiratory medication use excluded claims on the index date. Patients without any baseline claims for LAMA, LABA, or ICS were considered maintenance-naive. BEC results from 6 months prior to the index date through 15 days after the index date were assessed and categorized as ≤300 cells/μL or >300 cells/μL, utilizing the result closest to the index date. The highest value was retained for multiple eosinophil laboratory results on the same service date. Moderate COPD exacerbation was defined as an ambulatory (office or outpatient) visit with a diagnosis code for COPD plus a pharmacy claim for an oral corticosteroid and/or COPD-guideline-recommended antibiotic within seven days of the visit. Severe exacerbation was defined as an inpatient or emergency department (ED) visit with 1) a primary diagnosis of COPD, 2) a primary diagnosis of acute respiratory failure plus a COPD diagnosis, or 3) a primary diagnosis of acute respiratory failure plus an inpatient or ED visit with a COPD diagnosis in any position within ± seven days. Exacerbations occurring within 14 days of each other were considered a single exacerbation episode and were classified according to the highest severity contributing event. Patients were categorized into GOLD group A/B (zero or one baseline moderate exacerbation [not leading to hospital admission]) or GOLD group E (two or more baseline moderate exacerbations or at least one exacerbation leading to hospitalization). HRU measures included ambulatory (physician office and hospital outpatient), ED, inpatient, other medical visits, and pharmacy claims. Other medical visits included services provided at independent laboratories, assisted living facilities, and by home health providers. COPD and/or pneumonia-related HRU measures were restricted to medical claims with a diagnosis of COPD, pneumonia, or acute bronchitis/bronchiolitis and pharmacy claims for COPD-related treatment, including guideline-recommended antibiotics. HRU costs were computed as the sum of health plan and patient-paid (copay and/or coinsurance) costs. Total costs were presented as combined medical and pharmacy costs. Costs were adjusted to 2020 US dollars using the medical care component of the Consumer Price Index. 17 Outcomes were assessed over a variable follow-up period, with a minimum of 30 days and maximum of 12 months. Patients were followed up until the earliest of treatment switch, discontinuation, health plan disenrollment, end of the study period (31 December 2019), or 1 year of follow-up. Discontinuation was defined as a gap in therapy of ≥60 days following the runout of days’ supply, and the discontinuation date was defined as the runout prior to the gap in therapy. Patients with <60 days of observation time following the runout of their last index prescription claim were flagged as censored because the discontinuation status of patients was unobservable, and their observation period ended on the runout date. An index therapy switch was defined as a pharmacy fill for ≥30 consecutive days of non-index ICS-, LABA-, or LAMA-containing medication (switch date = the first date of the new treatment regimen). The outcomes assessed during the follow-up period included COPD exacerbations, HRU, and costs. Statistical Analysis Patients were matched in a 1:1 ratio of TIO/OLO to FF/UMEC/VI initiators without replacement, using nearest-neighbor matching with a caliper of ±0.01. Covariates in the logistic regression model used to compute propensity scores included patient demographics (age, sex, geographic region, insurance type), proxies for COPD severity (baseline moderate and severe exacerbation counts, GOLD group), baseline COPD medication use (maintenance-naive status, count of controller and rescue medications, nebulized respiratory medication, and oxygen therapy), baseline HRU, and costs (all-cause, COPD-related, and pneumonia-related total costs). Patients not matched were excluded from the post-match analysis. Baseline characteristics before and after propensity score matching were compared between TIO/OLO and FF/UMEC/VI initiators using standardized differences. A standardized difference of ≤10% for a measure was considered an acceptable threshold for balance between the treatment cohorts. Kaplan-Meier analyses were conducted to examine the time to the first COPD exacerbation (any or severe) and pneumonia diagnosis. Cumulative incidence was estimated as the complement of the Kaplan-Meier survival function. Follow-up counts of COPD exacerbations, HRU, and costs were compared between cohorts and presented as annualized population averages with Wald 95% confidence intervals, using Taylor expansion to estimate the standard error. Annualized population averages were computed as the [(sum of outcome events or costs for each cohort)/(sum of follow-up time in years for each cohort)]. COPD and/or pneumonia-related total, medical, and pharmacy costs were also modeled using generalized linear modeling with a gamma distribution and log link to adjust for residual imbalance after propensity score matching. Statistical tests between cohorts included variance adjustments for clustering due to matching. Results From the overall population of TIO/OLO (n=6681) and FF/UMEC/VI (n=9657) initiators who met the study inclusion criteria, 1649 (24.7%) and 2218 (23.0%) had a baseline blood eosinophil laboratory result, respectively ( Figure 1 Table 1 Table 1 Baseline Characteristics of TIO/OLO and FF/UMEC/VI Cohorts with BEC ≤300 Cells/µL Before and After Propensity Score Matching Characteristic Pre-Matching Post-Matching TIO/OLO(N=1372) FF/UMEC/VI(N=1796) Standardized Difference a TIO/OLO(N=1098) FF/UMEC/VI(N=1098) Standardized Difference a Age, years (mean, SD) 71.6 (8.8) 70.4 (9.3) 13.3 71.6 (8.8) 71.5 (8.9) 1.1 Female (n, %) 721 (52.6) 959 (53.4) 1.7 580 (52.8) 580 (52.8) 0.0 Insurance coverage (n, %) MAPD 1323 (96.4) 1525 (84.9) 40.4 1049 (95.5) 1048 (95.5) 0.4 Commercial 49 (3.6) 271 (15.1) 40.4 49 (4.5) 50 (4.6) 0.4 CCI score excluding COPD (mean, SD) 2.1 (2.0) 2.0 (2.0) 1.9 2.1 (2.0) 2.1 (2.0) 1.0 Baseline comorbidities (n, %) Heart failure 341 (24.9) 499 (27.8) 6.7 282 (25.7) 300 (27.3) 3.7 Allergic rhinitis 180 (13.1) 330 (18.4) 14.5 156 (14.2) 199 (18.1) 10.7 Anxiety 319 (23.3) 515 (28.7) 12.4 256 (23.3) 306 (27.9) 10.5 Pneumonia 242 (17.6) 370 (20.6) 7.5 214 (19.5) 195 (17.8) 4.5 Sleep apnea 348 (25.4) 565 (31.5) 13.5 292 (26.6) 337 (30.7) 9.1 Baseline respiratory medication use (n, %) Naive to maintenance therapy b 857 (62.5) 786 (43.8) 38.2 602 (54.8) 613 (55.8) 2.0 LAMA 279 (20.3) 343 (19.1) 3.1 270 (24.6) 152 (13.8) 27.5 LABA/ICS 237 (17.3) 737 (41.0) 54.2 228 (20.8) 354 (32.2) 26.2 Baseline COPD exacerbations Count of baseline COPD exacerbations (mean, SD) 0.9 (1.3) 1.3 (1.5) 29.1 1.0 (1.4) 1.0 (1.3) 0.2 ≥ 1 moderate or severe exacerbation (n, %) 677 (49.3) 1135 (63.2) 28.2 601 (54.7) 605 (55.1) 0.7 ≥ 1 severe exacerbation (n, %) 259 (18.9) 509 (28.3) 22.4 236 (21.5) 248 (22.6) 2.6 GOLD A/B c 994 (72.5) 1063 (59.2) 28.2 750 (68.3) 746 (67.9) 0.8 COPD and/or pneumonia-related costs, $ (mean, SD) Total $8965 ($20,483) $12,558 ($24,172) 16.0 $9761 ($21,278) $9567 ($16,699) 1.0 Medical $7930 ($20,239) $10,924 ($23,968) 13.5 $8570 ($21,019) $8286 ($16,541) 1.5 Pharmacy $1036 ($1660) $1634 ($2134) 31.3 $1191 ($1749) $1281 ($1879) 5.0 Notes a b c Abbreviations Figure 1 Patient Disposition. Notes Abbreviations COPD Exacerbations and Pneumonia Kaplan-Meier analysis censor-adjusted proportions of patients experiencing moderate or severe exacerbation at one year were 48.4% for TIO/OLO initiators and 51.4% for FF/UMEC/VI initiators. The incidence of severe exacerbation at one year was 18.0% for TIO/OLO initiators and 18.6% for FF/UMEC/VI initiators. The time to the first moderate or severe exacerbation (p=0.830) and severe exacerbation (p=0.988) was not significantly different between the TIO/OLO and FF/UMEC/VI initiators ( Figures 2 3 Figure 2 Time to First Moderate or Severe Exacerbation in the Matched Population with Eosinophil Count ≤300 cells/μL. Abbreviations Figure 3 Time to First Severe Exacerbation in the Matched Population with Eosinophil Count ≤300 cells/μL. Abbreviations The censor-adjusted findings from the Kaplan-Meier analysis indicated the proportions of patients with a pneumonia diagnosis at one year were 15.6% of TIO/OLO initiators and 17.8% of FF/UMEC/VI initiators, with no significant difference in time to first pneumonia diagnosis (p= 0.772) ( Supplementary Figure 1 Healthcare Resource Utilization Follow-up annualized COPD and/or pneumonia-related HRU measures were not significantly different between cohorts, except for fewer ED visits among TIO/OLO initiators versus FF/UMEC/VI (0.59 [0.46–0.71] vs 0.83 [0.67–0.98], p=0.018) ( Table 2 Table 2 Population Annualized Average Counts of Follow-up COPD and/or Pneumonia-Related Healthcare Resource Utilization in Matched TIO/OLO and FF/UMEC/VI Cohorts with BEC ≤300 Cells/µL TIO/OLO FF/UMEC/VI p-value a COPD and/or pneumonia-related utilization counts – Population annualized averages (95% CI) Ambulatory visits b 9.58 (8.31–10.86) 9.88 (8.85–10.90) 0.723 ED visits 0.59 (0.46–0.71) 0.83 (0.67–0.98) 0.018 Inpatient visits 0.46 (0.37–0.54) 0.50 (0.41–0.58) 0.519 Inpatient days 5.53 (3.98–7.09) 5.35 (3.89–6.81) 0.866 Other medical visits 4.76 (4.15–5.36) 5.23 (4.61–5.84) 0.282 Pharmacy fills 15.62 (14.95–16.29) 15.34 (14.73–15.95) 0.552 Notes a b Abbreviations Costs The follow-up population annualized average COPD and/or pneumonia-related total (medical and pharmacy) and medical costs were not significantly different between the TIO/OLO and FF/UMEC/VI initiators ( Table 3 Supplementary Table 1 Table 3 Population Annualized Average Costs of Follow-up COPD and/or Pneumonia-Related Healthcare Resource Utilization in Matched TIO/OLO and FF/UMEC/VI Cohorts with BEC ≤300 Cells/µL TIO/OLO FF/UMEC/VI p-value a COPD and/or pneumonia-related costs – Population annualized averages (95% CI) Medical visits $13,405 $13,557 0.941 Ambulatory visits $2529 $2480 0.902 ED visits $370 $538 0.034 Inpatient visits $10,011 $10,126 0.954 Other medical visits $495 $413 0.210 Pharmacy $4692 $6573 <0.001 Total c $18,097 $20,130 0.326 Notes a b c Abbreviations Discussion This retrospective, non-interventional cohort study assessed clinical and economic outcomes following the initiation of dual bronchodilator therapy with TIO/OLO compared to triple therapy with FF/UMEC/VI in patients with COPD and BEC ≤300 cells/μL. In accordance with GOLD treatment recommendations, the findings suggest that triple therapy did not reduce the risk of COPD exacerbation compared with LAMA/LABA therapy. This result is consistent with that of another real-world study comparing single-inhaler triple therapy with LAMA/LABA, which found no significant difference in the incidence of moderate or severe COPD exacerbations in patients with BEC ≤300 cells/μL, even among a subset of GOLD E patients. 18 19 Evidence from RCTs of triple therapy supports the role of BEC in the identification of patients who are most likely to benefit from the addition of ICS to LAMA/LABA. AIRWISE was a pragmatic clinical trial that randomized patients not controlled on LABA, LAMA, or LABA/ICS to either TIO/OLO or triple therapy. A post-hoc subgroup analysis found that the risk of a first moderate or severe COPD exacerbation was similar between TIO/OLO and triple therapy for patients with BEC <300 cells/μL (hazard ratio [95% CI]: 1.02 [0.68–1.53]). 20 21 22 23 24 25 In this study, HRU and costs were generally similar among initiators of TIO/OLO and FF/UMEC/VI. However, ED visits and pharmacy costs related to COPD (including maintenance medications, short-acting bronchodilators, oral corticosteroids, and antibiotics) were significantly lower among TIO/OLO users. Approximately 17% and 19% of patients initiating TIO/OLO and FF/UMEC/VI, respectively, had a baseline BEC >300 cells/μL. This finding suggests that most patients with COPD who initiate dual bronchodilator or triple therapy do not have high eosinophil counts. Furthermore, less than half (47.2%) of the FF/UMEC/VI initiators with BEC >300 cells/μL also had GOLD E exacerbation history, which is the population most likely to benefit from TT. The limitations of this study include those inherent to the use of administrative claims data for retrospective observational research. Claims are subject to miscoding, omissions, and lack some clinically important data such as lung function measures, symptom burden, and behavioral characteristics. Propensity score matching was employed to mitigate the risks of confounding by indication, and resulted in well-balanced baseline characteristics of TIO/OLO and FF/UMEC/VI initiators with BEC ≤300 cells/μL. However, several baseline measures remained imbalanced after matching. The proportion of patients with comorbid allergic rhinitis and anxiety differed between cohorts, with standardized differences just above the a priori defined threshold of 10%. Prior maintenance medication use also differed, with a greater number of FF/UMEC/VI initiators with baseline use of LABA/ICS, reflecting expected treatment patterns. Multivariable analyses adjusted for baseline measures that remained imbalanced after matching were conducted for select cost outcomes, with consistent results. Our findings are also limited due to relatively short follow-up duration of approximately 4 months on average, however this reflects real-world treatment patterns (ie, treatment switching and discontinuation), our study design, and data limitations (eg, censoring due to end of data cut). Additionally, the limited sample size and differences in baseline characteristics between cohorts with BEC >300 cells/μL resulted in inadequate balance after propensity score matching; therefore, we were unable to assess the outcomes in this population. Given the differing dates of market availability, TIO/OLO users who initiated therapy in the years prior to the approval of FF/UMEC/VI were included in this study, resulting in an imbalance in index year. A greater proportion of FF/UMEC/VI patients had index dates in 2019, which resulted in more frequent censoring of follow-up due to the end of the data period. Furthermore, the generalizability of our findings is limited by the study population, which may not represent the broader COPD patient population without commercial or Medicare Advantage insurance coverage. Finally, COPD exacerbations were identified using a claims-based algorithm, which may have resulted in misclassifications. However, the algorithm used in this study was similar to that used in other COPD studies using claims data, including validated algorithms with high performance characteristics. 26 Conclusion Among patients with COPD initiating FF/UMEC/VI, eight in ten had BEC ≤300 cells/μL and less than 10% had BEC >300 cells/μL with GOLD E exacerbation history. TIO/OLO and FF/UMEC/VI initiators with BEC ≤300 cells/μL experienced similar rates of COPD exacerbations and COPD and/or pneumonia-related HRU. TIO/OLO initiators incurred lower ED and pharmacy costs related to COPD and/or pneumonia compared with FF/UMEC/VI initiators. These findings support practice recommendations for the assessment of BEC when considering initiating triple therapy and for reserving triple therapy for frequent exacerbators and patients with BEC ≥300 cells/μL. Acknowledgments The authors wish to thank Felix Cao and Yiyu Fang of Optum for dataset programming support; Swetha R. Palli, MS, of Boehringer Ingelheim at the time of the study, for conceptualization; and Marjan Zakeri, MD, PhD, of Boehringer Ingelheim, for editorial support and formatting assistance. Partial findings from this study were presented at the American Thoracic Society International Conference, May 19-34, 2023, in Washington, DC, USA. Data Sharing Statement The data used were licensed from Optum and are not publicly available. Ethics Approval and Informed Consent As this was a retrospective study, informed consent was not required. All data were de-identified, and therefore, the study did not necessitate ethics committee approval and was fully compliant with HIPAA regulations. Author Contributions All authors made a significant contribution to the work reported, whether that is in the conception, study design, execution, acquisition of data, analysis and interpretation, or in all these areas; took part in drafting, revising or critically reviewing the article; gave final approval of the version to be published; have agreed on the journal to which the article has been submitted; and agree to be accountable for all aspects of the work. Disclosure SS has received honoraria for consulting and speaking from Astra Zeneca, Boehringer Ingelheim, Chiesi, Nuvaira, Pulmonx, Glaxo Smith Kline and Sanofi-Regeneron. His institution has received research grants from Chiesi and Astra Zeneca. LGSB was an employee of Optum at the time of the study. EKB and AS are employees of Optum. LGSB and BC are employees of Boehringer Ingelheim Pharmaceuticals, Inc. The authors report no other conflicts of interest in this work. References 1. Celli B Fabbri L Criner G Definition and nomenclature of chronic obstructive pulmonary disease: time for its revision Am J Respir Crit Care Med 2022 206 11 1317 1325 10.1164/rccm.202204-0671PP 35914087 PMC9746870 2. Higham A Beech A Wolosianka S Type 2 inflammation in eosinophilic chronic obstructive pulmonary disease Allergy 2021 76 6 1861 1864 10.1111/all.14661 33206402 PMC8247000 3. Brightling C Greening N Airway inflammation in COPD: progress to precision medicine Eur Respir J 2019 54 2 1900651 10.1183/13993003.00651-2019 31073084 4. Oshagbemi OA Burden AM Braeken DCW Stability of blood eosinophils in patients with chronic obstructive pulmonary disease and in control subjects, and the impact of sex, age, smoking, and baseline counts Am J Respir Crit Care Med 2017 195 10 1402 1404 10.1164/rccm.201701-0009LE 28165763 5. Pascoe S Locantore N Dransfield MT Barnes NC Pavord ID Blood eosinophil counts, exacerbations, and response to the addition of inhaled fluticasone furoate to vilanterol in patients with chronic obstructive pulmonary disease: a secondary analysis of data from two parallel randomised controlled trials Lancet Respir Med 2015 3 6 435 442 10.1016/S2213-2600(15)00106-X 25878028 6. Siddiqui SH Guasconi A Vestbo J Blood eosinophils: a biomarker of response to extrafine beclomethasone/formoterol in chronic obstructive pulmonary disease Am J Respir Crit Care Med 2015 192 4 523 525 10.1164/rccm.201502-0235LE 26051430 PMC4595668 7. Negewo NA McDonald VM Baines KJ Peripheral blood eosinophils: a surrogate marker for airway eosinophilia in stable COPD Int J Chronic Obstr Pulm Dis 2016 11 1495 1504 10.2147/COPD.S100338 PMC4936821 27445469 8. Stockley RA Halpin DMG Celli BR Singh D Chronic obstructive pulmonary disease biomarkers and their interpretation Am J Respir Crit Care Med 2018 199 10 1195 1204 10.1164/rccm.201810-1860SO 30592902 9. Martinez-Garcia MA Faner R Oscullo G Inhaled steroids, circulating eosinophils, chronic airway infection, and pneumonia risk in chronic obstructive pulmonary disease. A network analysis Am J Respir Crit Care Med 2020 201 9 1078 1085 10.1164/rccm.201908-1550OC 31922913 10. Singh D Blood eosinophil counts in chronic obstructive pulmonary disease: a biomarker of inhaled corticosteroid effects Tuberc Respir Dis 2020 83 3 185 194 10.4046/trd.2020.0026 PMC7362755 32578413 11. David B Bafadhel M Koenderman L Soyza AD Eosinophilic inflammation in COPD: from an inflammatory marker to a treatable trait Thorax 2021 76 2 188 195 10.1136/thoraxjnl-2020-215167 33122447 PMC7815887 12. Global Initiative for Chronic Obstructive Lung Disease (GOLD) Global strategy for the diagnosis, management, and prevention of chronic obstructive pulmonary disease (2025 report) https://goldcopd.org/2025-gold-report/ Accessed December 13. Bhatt SP Blauer-Peterson C Buysman EK Bengtson LGS Palli SR Trends and characteristics of global initiative for chronic obstructive lung disease guidelines-discordant prescribing of triple therapy among patients with COPD Chronic Obstr Pulm Dis 2022 9 2 135 153 35157792 10.15326/jcopdf.2021.0256 PMC9166325 14. Quint JK Ariel A Barnes PJ Rational use of inhaled corticosteroids for the treatment of COPD NPJ Prim Care Respir Med 2023 33 1 27 10.1038/s41533-023-00347-6 37488104 PMC10366209 15. Keir HR Contoli M Chalmers JD Inhaled corticosteroids and the lung microbiome in COPD Biomedicines 2021 9 10 1312 10.3390/biomedicines9101312 34680429 PMC8533282 16. Sethi S Palli SR Bengtson LGS Clinical and economic outcomes in patients with chronic obstructive pulmonary disease initiating maintenance therapy with tiotropium bromide/olodaterol or fluticasone furoate/umeclidinium/vilanterol J Manag Care Spéc Pharm 2023 29 7 791 806 10.18553/jmcp.2023.22373 37133429 PMC10394184 17. U.S. Department of Labor, Bureau of Labor Statistics Consumer price index. medical care Series ID: CUUR0000SAM Washington, DC U.S. Dept. of Labor, Bureau of Labor Statistics 2022 Available from http://data.bls.gov/cgi-bin/surveymost?cu Accessed January 26 18. Suissa S Dell’Aniello S Ernst P Single-inhaler triple versus dual bronchodilator therapy in COPD: real-world comparative effectiveness and safety Int J Chronic Obstr Pulm Dis 2022 17 1975 1986 10.2147/COPD.S378486 PMC9440703 36065315 19. Suissa S Single-inhaler triple versus dual bronchodilator therapy for GOLD group E and other exacerbating patients with COPD: real-world comparative effectiveness and safety Eur Respir J 2023 62 3 2300883 10.1183/13993003.00883-2023 37414423 20. Mina BA Averill F Shaikh A Exacerbation risk in COPD patients based on eosinophil count: post hoc analysis of the randomized pragmatic trial, AIR-WISE, comparing tiotropium/olodaterol with triple therapy Chest 2022 162 4 A1899 A1900 10.1016/j.chest.2022.08.1581 21. Pascoe S Barnes N Brusselle G Blood eosinophils and treatment response with triple and dual combination therapy in chronic obstructive pulmonary disease: analysis of the IMPACT trial Lancet Respir Med 2019 7 9 745 756 10.1016/S2213-2600(19)30190-0 31281061 22. Bafadhel M Rabe KF Martinez FJ Benefits of budesonide/glycopyrronium/formoterol fumarate dihydrate on COPD exacerbations, lung function, symptoms, and quality of life across blood eosinophil ranges: a post-hoc analysis of data from ETHOS Int J Chronic Obstr Pulm Dis 2022 17 3061 3073 10.2147/COPD.S374670 PMC9738173 36510486 23. Lipson DA Barnhart F Brealey N Once-daily single-inhaler triple versus dual therapy in patients with COPD N Engl J Med 2018 378 18 1671 1680 10.1056/NEJMoa1713901 29668352 24. Rabe KF Martinez FJ Ferguson GT Triple inhaled therapy at two glucocorticoid doses in moderate-to-very-severe COPD N Engl J Med 2020 383 1 35 48 10.1056/NEJMoa1916046 32579807 25. Whittaker HR Torkpour A Quint J Eligibility of patients with chronic obstructive pulmonary disease for inclusion in randomised control trials investigating triple therapy: a study using routinely collected data Respir Res 2024 25 1 43 10.1186/s12931-024-02672-x 38238769 PMC10797743 26. Mapel DW Roberts MH Sama S Development and validation of a healthcare utilization-based algorithm to identify acute exacerbations of chronic obstructive pulmonary disease Int J Chronic Obstr Pulm Dis 2021 16 1687 1698 10.2147/COPD.S302241 PMC8200149 34135580 ",
  "metadata": {
    "Title of this paper": "Development and validation of a healthcare utilization-based algorithm to identify acute exacerbations of chronic obstructive pulmonary disease",
    "Journal it was published in:": "International Journal of Chronic Obstructive Pulmonary Disease",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478208/"
  }
}