{
  "title": "Paper_460",
  "abstract": "pmc Dysphagia Dysphagia 365 springeropen Dysphagia 0179-051X 1432-0460 pmc-is-collection-domain yes pmc-collection-title Springer PMC12479640 PMC12479640.1 12479640 12479640 39934443 10.1007/s00455-025-10807-5 10807 1 Original Article Acoustic and Perceptual Profiles of Swallowing Sounds in Preterm Neonates: A Cross-Sectional Study Cohort http://orcid.org/0000-0003-2724-6919 Frakking Thuy T. PhD thuy.frakking@health.qld.gov.au 1 2 3 4 Humphries Seiji PhD 1 Chang Anne B. PhD 5 6 7 Schwerin Belinda PhD 8 Palmer Majorie M. MA (Speech Pathology) 9 David Michael PhD 10 11 Kyriakou Annelise (nee Cron) MSpeechPath 2 12 So Stephen PhD 8 SUPERB collaborative Bautista Manuel MBBS RACP Blake Alicia GradDipMid Dunsmuir Julie MNursing Hong Timothy MBBS Weir Kelly PhD Carty Christopher PhD Colditz Paul PhD Lai Melissa PhD 1 grid.518311.f 0000 0004 0408 4408 Research Development Unit, Caboolture Hospital, Metro North Health, 2 https://ror.org/00rqy9422 grid.1003.2 0000 0000 9320 7537 Child Health Research Centre, School of Medicine, The University of Queensland, 3 https://ror.org/04zt8gw89 grid.507967.a Speech Pathology Department, Gold Coast University Hospital, Gold Coast Health, 4 https://ror.org/02sc3r913 grid.1022.1 0000 0004 0437 5432 School of Health Sciences & Social Work, Griffith University, 5 https://ror.org/02t3p7e85 grid.240562.7 Department of Respiratory Medicine, Queensland Children’s Hospital, 6 https://ror.org/048zcaj52 grid.1043.6 0000 0001 2157 559X Child Health Division, Menzies School of Health Research, Charles Darwin University, 7 https://ror.org/03pnv4752 grid.1024.7 0000 0000 8915 0953 Australian Centre for Health Services Innovation, Queensland University of Technology, 8 https://ror.org/02sc3r913 grid.1022.1 0000 0004 0437 5432 School of Engineering and Built Environment, Griffith University, 9 10 https://ror.org/0384j8v12 grid.1013.3 0000 0004 1936 834X The Daffodil Centre, The University of Sydney, a joint venture With Cancer Council, 11 https://ror.org/02sc3r913 grid.1022.1 0000 0004 0437 5432 School of Medicine and Dentistry, Griffith University, 12 11 2 2025 2025 40 5 497829 1113 1123 9 11 2024 27 1 2025 11 02 2025 01 10 2025 01 10 2025 © Crown 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Cervical auscultation, commonly used by speech-language pathologists in some countries as an adjuvant to the clinical feeding evaluation, requires data on acoustic and perceptual profiles of swallowing sounds. Whilst these exists in adults and children, none currently exist for preterm neonates. Our study aims to establish the acoustic and perceptual parameters of swallowing sounds in preterm neonates. Swallowing sounds were recorded on a digital microphone during oral feeding observations. Acoustic parameters of duration, peak frequency, peak power and peak intensity were determined. Perceptual parameters heard pre, during and post-swallows were rated as ‘present’, ‘absent’, or ‘cannot be determined’. Eighty preterm neonates (43 males; mean age = 33.4 weeks [SD 2.6]) from three Australian special care nurseries demonstrated mean swallow durations of < 1 s. The peak amplitude correlated with the number of medical co-morbidities ( r Supplementary Information The online version contains supplementary material available at 10.1007/s00455-025-10807-5. Keywords Cervical auscultation Deglutition disorders Oropharyngeal aspiration Deglutition Swallow sounds Preterm Neonate http://dx.doi.org/10.13039/100017511 Metro North Hospital and Health Service CRF-145 Frakking Thuy T. http://dx.doi.org/10.13039/501100000925 National Health and Medical Research Council 1058213 Chang Anne B. http://dx.doi.org/10.13039/501100018853 Prince Charles Hospital Foundation CKW2022-04 Frakking Thuy T. http://dx.doi.org/10.13039/100011302 Children's Hospital Foundation ECR0442020 WIS0072022 Frakking Thuy T. The University of Queensland Open Access funding enabled and organized by CAUL and its Member Institutions pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Science+Business Media, LLC, part of Springer Nature 2025 Introduction About 10% of preterm neonates have feeding difficulties, with higher rates seen in preterm neonates with very low birth weight or chronic neonatal lung disease [ 1 3 3 4 5 7 8 11 A videofluoroscopic swallow study (VFSS) is considered the gold-standard assessment for the assessment of aspiration in preterm neonates because it captures all phases of the swallow, including the direct visualization of aspiration events [ 12 13 15 8 16 17 18 19 Cervical auscultation (CA) is a non-invasive, low cost, highly accessible and repeatable assessment technique commonly used as an adjuvant to the clinical feeding evaluation in the United Kingdom, Ireland and Australia [ 20 21 22 23 24 25 26 27 22 28 27 29 34 35 37 38 39 Despite the increasing evidence on the clinical utility of digital CA to detect aspiration, data on CA in preterm neonates are limited. Seminal work by Reynolds and colleagues [ 40 41 42 42 43 46 47 48 49 50 48 51 52 56 Method Study Design This multisite cross-sectional study across 3 Australian special care nurseries with level 6 (Royal Brisbane & Women’s Hospital and Gold Coast University Hospital) and level 4 (Caboolture Hospital) clinical services capability [ 57 HE000128 Participants Inclusion criteria: gestational age ≤ 36 +6 58 59 8 60 59 61 62 Procedure Audio-visual recordings of feeding observations of preterm neonates breast or bottle feeding were collected. Two-minute segments from the feeding observations were extracted for use in this study using an acoustic editing software package (Adobe Audition CS6 v5, Adobe Systems, USA). All preterm neonates were fed in standard feeding positions (e.g. elevated side lying, semi-reclined position) by their caregiver or treating nurse. Equipment An omnidirectional condenser microphone (C417, AKG Acoustics, Vienna, Austria) (sensitivity at 1 kHz of 10 mV/Pa, impedance 200Ω, frequency range 20 to 20,000 Hz) [ 63 Identification of Swallow Sounds from Audiofiles Using the acoustic editing software package described above, the raw acoustic signal was displayed as a waveform plot (y-axis (amplitude, decibels, dB) versus x-axis (time, seconds, s) (44,100 Hz sampling rate) simultaneously with the visual recording of the neonate breast or bottle feeding and a spectrogram (y-axis: frequency, Hz; x-axis: time, s). The waveform plot was magnified so that a 1-s section of the audio waveform filled the majority of the program’s viewing window. The start and end of each individual swallow was characterized simultaneously with the audio feedback of the swallowing sound (i.e. presence of a fluid flushing sound immediately after the cessation of inspiratory/expiratory respiratory sounds), visualization of the swallow from the visual recording (i.e. wide jaw excursion) and visualization of the spectrogram (i.e. areas of intensity). The accurate use of cervical auscultation requires structured training to reliably interpret swallow sounds and swallow-respiratory coordination [ 26 Data Collection Acoustic Parameters Segmented swallow interval times (start and end points of the swallow) were extracted and analyzed for duration, peak frequency, peak amplitude and peak power using a Python program. Duration (in seconds) was defined as the total time elapsed from the beginning to the end of the swallowing sound. Peak frequency (Hertz, Hz) refers the highest frequency contained in the time segment of maximum energy. The signal was first filtered using a high pass fourth order Butterworth filter with a cutoff frequency of 400 Hz to remove large energy components in the low frequency range (0 – 400 Hz). The filtered signal was then divided into short 20 ms frames with a 50% overlap. The power spectral density (PSD) was then estimated for each frame using the Welch periodogram method [ 64 65 To determine peak frequency, a cumulative distribution function (CDF) of the PSD was constructed going from low to high frequency. This CDF was then used to determine the frequency range that captured or represented 95% of the total signal power in the frequency domain. This method relies on a more intuitive criteria for determining the peak frequency, as opposed to the arbitrary noise flooring that is typically used to enhance visual interpretation in spectrogram analysis. Peak amplitude (decibels, dB) was defined as the maximum signal value that was found in the swallow. To calculate the peak power, the total signal energy in each 20 ms frame was first computed and divided by the duration, so as to provide the signal power for that frame. The highest signal power was then determined to be the peak power. Any clipped samples were removed (and signal duration adjusted accordingly) so as not to bias the power measure. Perceptual Clinical Parameters The perceptual clinical parameters (Supplemental Table B, adapted from previously published normative data in children) [ 49 27 22 28 49 66 Statistical Analysis We planned for a sample size of 80 preterm neonates with 80% power (two-sided α = 0.05, difference ≥ 0.31 between acoustic parameter variables) [ 67 68 69 70 71 72 Results A total of 80 preterm neonates were recruited (n = 43 male; mean birth gestation 33.4 SD 2.6 weeks) between October 2021 to July 2022. The most common medical conditions were jaundice, hyaline membrane disease (HMD) and intrauterine growth restriction (IUGR). Over half the cohort required respiratory support during their admission, with no infants on any respiratory support at the time of their feeding observation. 52% of preterm neonates were on a combination of oral and tube feeding at the time of their feeding observation (Table 1 Table 1 Baseline characteristics of our cohort Characteristics Total Birth gestational age (weeks) Mean (SD) 33.4 (2.6) Median (IQR) 34 (32–35) Range 25 – 36 Birth weight (grams) Mean (SD) 2109.6 (560.3) Median (IQR) 2140 (1750–2470) Range 568 – 3545 Chronological gestational age at feeding observation (weeks) Mean (SD) 37 (1.6) Range 34 – 43 Sex Male 43 (53.8%) Female 37(46.2%) Multiple birth 32 (40.0%) Feeding status at feeding observation (n = 77) Full oral 25 (32.5%) Combination (feeding tube and oral feeds) 52 (67.5%) Days of tube feeding (n = 77) Mean (SD) 26.4 (25.3) Median (IQR) 18.5 (13–27) Range 1 – 133 Respiratory support required during admission 62 (77.5) Hours of respiratory support (n = 55) Mean (SD) 93.5 (191.8) Median (IQR) 25 (10–50.9) Range 0.1 – 921.7 Common Medical conditions Hyaline Membrane Disease (HMD) 35 (43.8%) Intrauterine growth restriction (IUGR) 34 (42.5%) Hypoglycaemia 31 (38.8%) Presumed sepsis 3 (3.9%) Management of monochrionic twin (MCDA) 3 (3.9%) Apnea 11 (13.8%) Jaundice 51 (63.8%) Chronic neonatal lung disease (CNLD) 5 (6.3%) Transient tachypnoea of the newborn (TTN) 9 (11.3%) Persistent pulmonary hypertension 2 (2.5%) Retinopathy of prematurity (ROP) 7 (8.8%) Non-specific respiratory disease 3 (3.9%) Data are mean (SD), n (%) SD IQR Acoustic Parameters The duration of all swallows was mean = 0.85 s (SD0.3). Peak amplitude (mean = 89.7 dB SD1.1) and peak power (mean = 80.8 dB SD4.8) were similar (Table 2 Table 2 Swallowing acoustic parameters for preterm neonates on thin fluids Duration (s) Peak frequency (Hz) Peak amplitude (dB) Peak power (dB) Thin fluids (N = 80) 0.85 ± 0.3 1678.3 ± 413.5 89.67 ± 1.1 80.83 ± 4.8 SD Relationship Between Acoustic Parameters, Gestational Age and Number Of Medical Conditions The peak amplitude (intensity) of thin fluid swallowing sounds significantly positively correlated with the number of medical conditions (r = 0.24; 95%CI 0.03,0.45). There was no correlation between swallowing acoustic parameters and birth or chronological gestational age at time of feeding observation. Perceptual Clinical Parameters Inter-rater Reliability There was moderate agreement for pre-swallow parameters, fair agreement for during swallowing parameters and moderate to substantial agreement for swallowing coordination and post-swallowing sound parameters between raters (Supplementary Table A). Respiratory Sounds Most of the cohort had normal breathing pre-swallow (n = 62/79, 78.5%). Respiratory sounds were present pre- and post-swallow in this cohort with the most commonly occurring: stridor, wheeze or wet breathing. Post-swallow cough was observed in 5 of 80 preterm neonates (6.3%), Table 3 Table 3 Data on the number of participants with presence of perceptual pre-, during and post-swallow sound parameters on thin fluid consistency Thin fluids (N = 80) n (%) Pre-swallow breath sounds Normal breathing 63* (78.5) Wet breathing 14 (17.5) Rattly chest 0 (0) Grunting 12 (15) Crackles 0 (0) Stridor 26 (32.5) Wheeze 16 (20) Throat clearing 0 (0) Coughing 0 (0) Swallow sounds Crisp “clear” 76 (95) Quick 80 (100) Loud 71 (88.8) Initial discrete sound (IDS) 79 (98.8) Bolus transit sound (BTS) 80 (100) Final discrete sound (FDS) 79 (98.8) Glottal release sound (GRS) 80 (100) Co-ordinated 65 (81.3) Unco-ordinated 15 (18.8) Post-swallow breath sounds Normal breathing 45 (56.3) Wet breathing 16 (20) Rattly chest 0 (0) Grunting 7 (8.8) Crackles 0 (0) Stridor 33 (41.3) Wheeze 24 (30) Throat clearing 5 (6.3) Coughing 1 (1.3) *n = 79 due to one consensus rating of cannot be determined Swallowing Sounds The bolus transit sound (BTS) and glottal release sound (GRS) was present on at least one swallow in all participants. The BTS, along with the quick and loud descriptors were consistently heard. A majority of preterm neonates were rated with a coordinated swallow (65/80, 81.3%), with nearly 20% rated with an uncoordinated swallow during the feeding observation (Table 3 Discussion Our study involving 3414 swallowing sounds in 80 preterm neonates recruited from 3 special-care nurseries provides the largest collection of acoustic and perceptual swallowing sound profiles in preterm neonates. The acoustic parameters for swallowing sounds in preterm neonates showed that all swallows were quick and took ~ 1 s and that our new proposed peak power for describing sound intensity was comparable to peak amplitude values. Specifically, the peak amplitude (intensity) of swallowing sounds significantly positively correlated with the number of medical conditions in our preterm cohort. For perceptual parameters, all preterm neonates demonstrated the presence of a bolus transit sound (BTS) and a glottal release sound (GRS). While most of the cohort were rated with a coordinated swallow, a substantial proportion (20%) rated with an uncoordinated swallow. Further, abnormal respiratory sounds of stridor (41%), wheeze (30%), wet breathing (20%) and coughing (6.3%) post-swallows were observed. Only half of the cohort were classified as having normal breathing post-swallow. Our findings of < 1 s mean swallow duration in preterm neonates is consistent with previous data for swallowing sounds on thin fluids in children [ 49 51 73 49 8 47 54 74 In this work, we proposed the use of peak power rather than the peak amplitude that was used in previous pediatric and adult studies [ 49 53 64 In this study, we found that the number of medical co-morbidities was positively correlated to peak amplitude (i.e. loudness). Indeed, increased multiple co-morbidities in neonates has been associated with reduced full oral feeding success [ 75 76 77 78 Previous studies on cervical auscultation have documented the presence of a BTS or main swallowing sound in preterm neonates [ 40 49 51 49 51 51 54 49 The presence of ‘wet breathing’ post-swallows has been previously described in infants with down syndrome (0 to 18 months) [ 28 50 49 79 80 81 82 83 77 84 86 87 88 The absence of FEES and/or VFSS to objectively confer the presence or absence of coordinated versus uncoordinated swallows was a limitation of this study. Without VFSS or FEES, there was no objective physiologic evidence of swallowing events. We acknowledge that it would be difficult to obtain ethical approval to complete VFSS on healthy preterm neonates. Nevertheless, the definitions used for coordinated and uncoordinated swallows in our study were based on previous studies on cervical auscultation where VFSS was used to determine the absence/presence of aspiration [ 22 28 56 27 89 90 Conclusion & Future Directions A majority of preterm neonates have coordinated swallows that are loud, quick and completed in < 1 s. The perceptual swallow sound parameters of a BTS and GRS were present in all preterm neonates. One in five preterm neonates have an uncoordinated swallow where wheeze, stridor and wet breath sounds can be present post-swallow. The acoustic and perceptual swallowing sound profiles provides clinicians with reference values when using cervical auscultation for pre-term neonates typically seen in the special care nursery setting. This study lays the foundation for future comparison to abnormal swallowing sounds in preterm neonates. Supplementary Information Below is the link to the electronic supplementary material. Supplementary file1 (DOCX 19 KB) Supplementary file2 (DOCX 36 KB) The members of the Swallowing Sounds in Premature Babies (SUPERB) collaborative investigators are mentioned in Acknowledgements section. Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements Swallowing Sounds in Premature Babies (SUPERB) collaborative investigators: Manuel Bautista MBBS RACP, Alicia Blake GradDipMid, Julie Dunsmuir MNursing, Timothy Hong MBBS, Kelly Weir PhD, Christopher Carty PhD, Paul Colditz PhD, Melissa Lai PhD. Affiliations of Swallowing Sounds in Premature Babies (SUPERB) collaborative investigators: Caboolture Hospital, Metro North Health; Gold Coast University Hospital, Gold Coast Health; University of Melbourne, Royal Children’s Hospital (Melbourne); Griffith University; Royal Brisbane & Women’s Hospital, Metro North Health. Funding Open Access funding enabled and organized by CAUL and its Member Institutions. TTF is supported by a Metro North Clinician Researcher Fellowship. ABC is supported by NHMRC Practitioner Fellowship (no. 1058213). This project received grant funding from The Common Good (CKW2022-04) and Children’s Hospital Foundation (ECR0442020 & WIS0072022). Data Availability Ethical approval was not received for sharing of the data for this study. Declarations Conflict of interest None declared. References 1. Motion S Northstone K Emond A Team TAS Persistent early feeding difficulties and subsequent growth and developmental outcomes Ambul Child Health 2001 7 3–4 231 7 10.1046/j.1467-0658.2001.00139.x Motion S, Northstone K, Emond A, Team TAS. Persistent early feeding difficulties and subsequent growth and developmental outcomes. Ambul Child Health. 2001;7(3–4):231–7. 2. Mercado-Deane M-G Burton EM Harlow SA Swallowing dysfunction in infants less than 1 year of age Pediatr Radiol 2001 31 6 423 8 10.1007/s002470100456 11436889 Mercado-Deane M-G, Burton EM, Harlow SA, et al. Swallowing dysfunction in infants less than 1 year of age. Pediatr Radiol. 2001;31(6):423–8. 11436889 10.1007/s002470100456 3. Uhm KE Yi S-H Chang HJ Cheon HJ Kwon J-Y Videofluoroscopic swallowing study findings in full-term and preterm infants with dysphagia Ann Rehabil Med 2013 37 2 175 82 10.5535/arm.2013.37.2.175 23705111 PMC3660477 Uhm KE, Yi S-H, Chang HJ, Cheon HJ, Kwon J-Y. Videofluoroscopic swallowing study findings in full-term and preterm infants with dysphagia. Ann Rehabil Med. 2013;37(2):175–82. 23705111 10.5535/arm.2013.37.2.175 PMC3660477 4. Patel T Clemmens C Bradburn K Effect of a standardized fluoroscopic procedural approach on fluoroscopy time during infant modified barium swallow studies Int J Pediatr Otorhinolaryngol 2020 138 110396 10.1016/j.ijporl.2020.110396 33152985 Patel T, Clemmens C, Bradburn K, et al. Effect of a standardized fluoroscopic procedural approach on fluoroscopy time during infant modified barium swallow studies. Int J Pediatr Otorhinolaryngol. 2020;138:110396. 33152985 10.1016/j.ijporl.2020.110396 5. Rommel N De Meyer A-M Feenstra L Veereman-Wauters G The complexity of feeding problems in 700 infants and young children presenting to a tertiary care institution J Pediatr Gastroenterol Nutr 2003 37 1 75 84 12827010 10.1097/00005176-200307000-00014 Rommel N, De Meyer A-M, Feenstra L, Veereman-Wauters G. The complexity of feeding problems in 700 infants and young children presenting to a tertiary care institution. J Pediatr Gastroenterol Nutr. 2003;37(1):75–84. 12827010 10.1097/00005176-200307000-00014 6. Jadcherla SR Stoner E Gupta A Evaluation and management of neonatal dysphagia: impact of pharyngoesophageal motility studies and multidisciplinary feeding strategy J Pediatr Gastroenterol Nutr 2009 48 2 186 92 10.1097/MPG.0b013e3181752ce7 19179881 PMC3791885 Jadcherla SR, Stoner E, Gupta A, et al. Evaluation and management of neonatal dysphagia: impact of pharyngoesophageal motility studies and multidisciplinary feeding strategy. J Pediatr Gastroenterol Nutr. 2009;48(2):186–92. 19179881 10.1097/MPG.0b013e3181752ce7 PMC3791885 7. Jadcherla SR Peng J Moore R Impact of personalized feeding program in 100 NICU infants: pathophysiology-based approach for better outcomes J Pediatr Gastroenterol Nutr 2012 54 1 62 70 10.1097/MPG.0b013e3182288766 21694638 PMC3800145 Jadcherla SR, Peng J, Moore R, et al. Impact of personalized feeding program in 100 NICU infants: pathophysiology-based approach for better outcomes. J Pediatr Gastroenterol Nutr. 2012;54(1):62–70. 21694638 10.1097/MPG.0b013e3182288766 PMC3800145 8. Thoyre SM Pados BF Shaker CS Fuller K Park J Psychometric properties of the early feeding skills assessment tool Adv Neonatal Care 2018 18 5 E13 23 10.1097/ANC.0000000000000537 30239407 Thoyre SM, Pados BF, Shaker CS, Fuller K, Park J. Psychometric properties of the early feeding skills assessment tool. Adv Neonatal Care. 2018;18(5):E13-23. 30239407 10.1097/ANC.0000000000000537 9. Zarem C Kidokoro H Neil J Wallendorf M Inder T Pineda R Psychometrics of the neonatal oral motor assessment scale Dev Med Child Neurol 2013 55 12 1115 20 10.1111/dmcn.12202 23869958 PMC3830735 Zarem C, Kidokoro H, Neil J, Wallendorf M, Inder T, Pineda R. Psychometrics of the neonatal oral motor assessment scale. Dev Med Child Neurol. 2013;55(12):1115–20. 23869958 10.1111/dmcn.12202 PMC3830735 10. Palmer MM Crawley K Blanco IA Neonatal oral-motor assessment scale: a reliability study J Perinatol 1993 13 1 28 35 8445444 Palmer MM, Crawley K, Blanco IA. Neonatal oral-motor assessment scale: a reliability study. J Perinatol. 1993;13(1):28–35. 8445444 11. da Costa SP Hübl N Kaufman N Bos AF New scoring system improves inter-rater reliability of the neonatal oral-motor assessment scale Acta Paediatr 2016 105 8 e339 44 10.1111/apa.13461 27164051 da Costa SP, Hübl N, Kaufman N, Bos AF. New scoring system improves inter-rater reliability of the neonatal oral-motor assessment scale. Acta Paediatr. 2016;105(8):e339-44. 27164051 10.1111/apa.13461 12. Arvedson JC Feeding children with cerebral palsy and swallowing difficulties Eur J Clin Nutr 2013 67 Suppl 2 S9 12 10.1038/ejcn.2013.224 24301008 Arvedson JC. Feeding children with cerebral palsy and swallowing difficulties. Eur J Clin Nutr. 2013;67(Suppl 2):S9-12. 24301008 10.1038/ejcn.2013.224 13. Hersh C Wentland C Sally S Radiation exposure from videofluoroscopic swallow studies in children with type 1 laryngeal cleft and pharyngeal dysphagia: a retrospective review Int J Pediatr Otorhinolaryngol 2016 89 92 6 10.1016/j.ijporl.2016.07.032 27619036 Hersh C, Wentland C, Sally S, et al. Radiation exposure from videofluoroscopic swallow studies in children with type 1 laryngeal cleft and pharyngeal dysphagia: a retrospective review. Int J Pediatr Otorhinolaryngol. 2016;89:92–6. 27619036 10.1016/j.ijporl.2016.07.032 14. Im HW Kim SY Oh BM Han TR Seo HG Radiation dose during videofluoroscopic swallowing studies and associated factors in pediatric patients Dysphagia 2020 35 1 84 9 10.1007/s00455-019-10006-z 30945001 Im HW, Kim SY, Oh BM, Han TR, Seo HG. Radiation dose during videofluoroscopic swallowing studies and associated factors in pediatric patients. Dysphagia. 2020;35(1):84–9. 30945001 10.1007/s00455-019-10006-z 15. Layly J Marmouset F Chassagnon G Can we reduce frame rate to 15 images per second in pediatric videofluoroscopic swallow studies? Dysphagia 2019 10.1007/s00455-019-10027-8 31165922 Layly J, Marmouset F, Chassagnon G, et al. Can we reduce frame rate to 15 images per second in pediatric videofluoroscopic swallow studies? Dysphagia. 2019. 10.1007/s00455-019-10027-8. 31165922 10.1007/s00455-019-10027-8 16. Hernandez AM Bianchini EMG Swallowing analyses of neonates and infants in breastfeeding and bottle-feeding: impact on videofluoroscopy swallow studies Int Arch Otorhinolaryngol 2019 23 3 e343 53 10.1055/s-0039-1677753 31360257 PMC6660293 Hernandez AM, Bianchini EMG. Swallowing analyses of neonates and infants in breastfeeding and bottle-feeding: impact on videofluoroscopy swallow studies. Int Arch Otorhinolaryngol. 2019;23(3):e343-53. 31360257 10.1055/s-0039-1677753 PMC6660293 17. Cichero JAY Nicholson T Dodrill P Liquid barium is not representative of infant formula: characterisation of rheological and material properties Dysphagia 2011 26 264 71 10.1007/s00455-010-9303-3 20830598 Cichero JAY, Nicholson T, Dodrill P. Liquid barium is not representative of infant formula: characterisation of rheological and material properties. Dysphagia. 2011;26:264–71. 20830598 10.1007/s00455-010-9303-3 18. Frazier J Chestnut AH Jackson A Barbon CEA Steele CM Pickler L Understanding the viscosity of liquids used in infant dysphagia management Dysphagia 2016 31 5 672 9 10.1007/s00455-016-9726-6 27412005 PMC5018449 Frazier J, Chestnut AH, Jackson A, Barbon CEA, Steele CM, Pickler L. Understanding the viscosity of liquids used in infant dysphagia management. Dysphagia. 2016;31(5):672–9. 27412005 10.1007/s00455-016-9726-6 PMC5018449 19. Reynolds J Carroll S Sturdivant C Fiberoptic endoscopic evaluation of swallowing: a multidisciplinary alternative for assessment of infants with dyspahgia in the neonatal intensive care unit Adv Neonatal Care 2016 16 1 37 43 10.1097/ANC.0000000000000245 26709466 Reynolds J, Carroll S, Sturdivant C. Fiberoptic endoscopic evaluation of swallowing: a multidisciplinary alternative for assessment of infants with dyspahgia in the neonatal intensive care unit. Adv Neonatal Care. 2016;16(1):37–43. 26709466 10.1097/ANC.0000000000000245 20. Bateman C Leslie P Drinnan MJ Adult dysphagia assessment in the UK and Ireland: are SLTs assessing the same factors? Dysphagia 2007 22 3 174 86 10.1007/s00455-006-9070-3 17294297 Bateman C, Leslie P, Drinnan MJ. Adult dysphagia assessment in the UK and Ireland: are SLTs assessing the same factors? Dysphagia. 2007;22(3):174–86. 17294297 10.1007/s00455-006-9070-3 21. Rumbach A Coombes C Doeltgen S A survey of Australian dysphagia practice patterns Dysphagia 2018 33 2 216 26 10.1007/s00455-017-9849-4 28932903 Rumbach A, Coombes C, Doeltgen S. A survey of Australian dysphagia practice patterns. Dysphagia. 2018;33(2):216–26. 28932903 10.1007/s00455-017-9849-4 22. Almeida STD Ferlin EL Maciel AC Acoustic signal of silent tracheal aspiration in children with oropharyngeal dysphagia Logoped Phoniatr Vocol 2018 43 4 169 74 10.1080/14015439.2018.1487993 30111199 Almeida STD, Ferlin EL, Maciel AC, et al. Acoustic signal of silent tracheal aspiration in children with oropharyngeal dysphagia. Logoped Phoniatr Vocol. 2018;43(4):169–74. 30111199 10.1080/14015439.2018.1487993 23. Frakking TT Chang AB O'Grady KA Walker-Smith K Weir KA Cervical auscultation in the diagnosis of oropharyngeal aspiration in children: a study protocol for a randomised controlled trial Trials 2013 14 377 377 10.1186/1745-6215-14-377 24199872 PMC4226202 Frakking TT, Chang AB, O’Grady KA, Walker-Smith K, Weir KA. Cervical auscultation in the diagnosis of oropharyngeal aspiration in children: a study protocol for a randomised controlled trial. Trials. 2013;14(377):377. 24199872 10.1186/1745-6215-14-377 PMC4226202 24. Frakking TT Chang AB O'Grady KF David M Walker-Smith K Weir KA The use of cervical auscultation to predict oropharyngeal aspiration in children: a randomized controlled trial Dysphagia 2016 31 6 738 48 10.1007/s00455-016-9727-5 27402004 Frakking TT, Chang AB, O’Grady KF, David M, Walker-Smith K, Weir KA. The use of cervical auscultation to predict oropharyngeal aspiration in children: a randomized controlled trial. Dysphagia. 2016;31(6):738–48. 27402004 10.1007/s00455-016-9727-5 25. Frakking TT Chang AB O'Grady KF David M Weir KA Reliability for detecting oropharyngeal aspiration in children using cervical auscultation Int J Speech Lang Pathol 2017 19 6 569 77 10.1080/17549507.2016.1222452 27686754 Frakking TT, Chang AB, O’Grady KF, David M, Weir KA. Reliability for detecting oropharyngeal aspiration in children using cervical auscultation. Int J Speech Lang Pathol. 2017;19(6):569–77. 27686754 10.1080/17549507.2016.1222452 26. Bergström L Cichero JAY Dysphagia management: does structured training improve the validity and reliability of cervical auscultation? Int J Speech Lang Pathol 2022 24 1 77 87 10.1080/17549507.2021.1953592 34328050 Bergström L, Cichero JAY. Dysphagia management: does structured training improve the validity and reliability of cervical auscultation? Int J Speech Lang Pathol. 2022;24(1):77–87. 34328050 10.1080/17549507.2021.1953592 27. Frakking T Chang A O'Grady K David M Weir K Aspirating and nonaspirating swallow sounds in children: a pilot study Ann Otol Rhinol Laryngol 2016 125 12 1001 9 10.1177/0003489416669953 27683588 Frakking T, Chang A, O’Grady K, David M, Weir K. Aspirating and nonaspirating swallow sounds in children: a pilot study. Ann Otol Rhinol Laryngol. 2016;125(12):1001–9. 27683588 10.1177/0003489416669953 28. Silva Hd Mathura N Wright A Jasmin K Wright A 1211 The use of cervical auscultation to detect subtle audible wet pharyngeal sounds (SAWPS-CA) as a screening tool for silent aspiration in infants with trisomy 21 Abstracts 2021 106 A275 10.1136/archdischild-2021-rcpch.478 Silva Hd, Mathura N, Wright A, Jasmin K, Wright A. 1211 The use of cervical auscultation to detect subtle audible wet pharyngeal sounds (SAWPS-CA) as a screening tool for silent aspiration in infants with trisomy 21. Abstracts. 2021;106:A275. 29. Dudik JM Kurosu A Coyle JL Sejdić E A statistical analysis of cervical auscultation signals from adults with unsafe airway protection J Neuroeng Rehabil 2016 13 1 7 10.1186/s12984-015-0110-9 26801236 PMC4722771 Dudik JM, Kurosu A, Coyle JL, Sejdić E. A statistical analysis of cervical auscultation signals from adults with unsafe airway protection. J Neuroeng Rehabil. 2016;13(1):7. 26801236 10.1186/s12984-015-0110-9 PMC4722771 30. Donohue C Khalifa Y Perera S Sejdic E Coyle JL A preliminary investigation of whether HRCA signals can differentiate between swallows from healthy people and swallows from people with neurodegenerative diseases Dysphagia 2020 10.1007/s00455-020-10177-0 32889627 PMC7933315 Donohue C, Khalifa Y, Perera S, Sejdic E, Coyle JL. A preliminary investigation of whether HRCA signals can differentiate between swallows from healthy people and swallows from people with neurodegenerative diseases. Dysphagia. 2020. 10.1007/s00455-020-10177-0. 32889627 10.1007/s00455-020-10177-0 PMC7933315 31. Merey C Kushki A Sejdić E Berall G Chau T Quantitative classification of pediatric swallowing through accelerometry J Neuroeng Rehabil 2012 9 1 34 10.1186/1743-0003-9-34 22682474 PMC3453511 Merey C, Kushki A, Sejdić E, Berall G, Chau T. Quantitative classification of pediatric swallowing through accelerometry. J Neuroeng Rehabil. 2012;9(1):34. 22682474 10.1186/1743-0003-9-34 PMC3453511 32. Lee J Blain S Casas M Kenny D Berall G Chau T A radial basis classifier for the automatic detection of aspiration in children with dysphagia J Neuroeng Rehabil 2006 3 14 10.1186/1743-0003-3-14 16846507 PMC1570357 Lee J, Blain S, Casas M, Kenny D, Berall G, Chau T. A radial basis classifier for the automatic detection of aspiration in children with dysphagia. J Neuroeng Rehabil. 2006;3:14. 16846507 10.1186/1743-0003-3-14 PMC1570357 33. Lee J Steele CM Chau T Classification of healthy and abnormal swallows based on accelerometry and nasal airflow signals Artif Intell Med 2011 52 1 17 25 10.1016/j.artmed.2011.03.002 21549579 Lee J, Steele CM, Chau T. Classification of healthy and abnormal swallows based on accelerometry and nasal airflow signals. Artif Intell Med. 2011;52(1):17–25. 21549579 10.1016/j.artmed.2011.03.002 34. Frakking TT Chang AB Carty C Using an automated speech recognition approach to differentiate between normal and aspirating swallowing sounds recorded from digital cervical auscultation in children Dysphagia 2022 37 6 1482 92 10.1007/s00455-022-10410-y 35092488 PMC9643257 Frakking TT, Chang AB, Carty C, et al. Using an automated speech recognition approach to differentiate between normal and aspirating swallowing sounds recorded from digital cervical auscultation in children. Dysphagia. 2022;37(6):1482–92. 35092488 10.1007/s00455-022-10410-y PMC9643257 35. Donohue C Mao S Sejdic E Coyle JL Tracking hyoid bone displacement during swallowing without videofluoroscopy using machine learning of vibratory signals Dysphagia 2020 10.1007/s00455-020-10124-z 32419103 PMC7669608 Donohue C, Mao S, Sejdic E, Coyle JL. Tracking hyoid bone displacement during swallowing without videofluoroscopy using machine learning of vibratory signals. Dysphagia. 2020. 10.1007/s00455-020-10124-z. 32419103 10.1007/s00455-020-10124-z PMC7669608 36. He Q Perera S Khalifa Y The association of high resolution cervical auscultation signal features with hyoid bone displacement during swallowing IEEE Trans Neural Syst Rehabil Eng 2019 27 9 1810 6 10.1109/TNSRE.2019.2935302 31443032 PMC6746228 He Q, Perera S, Khalifa Y, et al. The association of high resolution cervical auscultation signal features with hyoid bone displacement during swallowing. IEEE Trans Neural Syst Rehabil Eng. 2019;27(9):1810–6. 31443032 10.1109/TNSRE.2019.2935302 PMC6746228 37. Rebrion C Zhang Z Khalifa Y High-resolution cervical auscultation signal features reflect vertical and horizontal displacements of the hyoid bone during swallowing IEEE J Transl Eng Health Med 2019 7 1 9 10.1109/JTEHM.2018.2881468 PMC6345415 30701145 Rebrion C, Zhang Z, Khalifa Y, et al. High-resolution cervical auscultation signal features reflect vertical and horizontal displacements of the hyoid bone during swallowing. IEEE J Transl Eng Health Med. 2019;7:1–9. 10.1109/JTEHM.2018.2881468 PMC6345415 30701145 38. Mao S Sabry A Khalifa Y Coyle JL Sejdic E Estimation of laryngeal closure duration during swallowing without invasive X-rays Futur Gener Comput Syst 2021 115 610 8 10.1016/j.future.2020.09.040 PMC7584133 33100445 Mao S, Sabry A, Khalifa Y, Coyle JL, Sejdic E. Estimation of laryngeal closure duration during swallowing without invasive X-rays. Futur Gener Comput Syst. 2021;115:610–8. 10.1016/j.future.2020.09.040 PMC7584133 33100445 39. Kurosu A Coyle JL Dudik JM Sejdic E Detection of swallow kinematic events from acoustic high-resolution cervical auscultation signals in patients with stroke Arch Phys Med Rehabil 2019 100 3 501 8 10.1016/j.apmr.2018.05.038 30071198 PMC6402604 Kurosu A, Coyle JL, Dudik JM, Sejdic E. Detection of swallow kinematic events from acoustic high-resolution cervical auscultation signals in patients with stroke. Arch Phys Med Rehabil. 2019;100(3):501–8. 30071198 10.1016/j.apmr.2018.05.038 PMC6402604 40. Reynolds EW Vice FL Bosma JF Gewolb IH Cervical accelerometry in preterm infants Dev Med Child Neurol 2002 44 9 587 92 10.1111/j.1469-8749.2002.tb00843.x 12227613 Reynolds EW, Vice FL, Bosma JF, Gewolb IH. Cervical accelerometry in preterm infants. Dev Med Child Neurol. 2002;44(9):587–92. 12227613 10.1017/s0012162201002626 41. Reynolds EW Vice FL Gewolb IH Cervical accelerometry in preterm infants with and without bronchopulmonary dysplasia Dev Med Child Neurol 2003 45 7 442 6 10.1111/j.1469-8749.2003.tb00938.x 12828397 Reynolds EW, Vice FL, Gewolb IH. Cervical accelerometry in preterm infants with and without bronchopulmonary dysplasia. Dev Med Child Neurol. 2003;45(7):442–6. 12828397 10.1017/s0012162203000835 42. Yu-Lin W Jing-Sheng H Lin-Yu W Development of a wireless oral-feeding monitoring system for preterm infants IEEE J Biomed Health Inform 2015 19 3 866 73 10.1109/JBHI.2014.2335742 25014981 Yu-Lin W, Jing-Sheng H, Lin-Yu W, et al. Development of a wireless oral-feeding monitoring system for preterm infants. IEEE J Biomed Health Inform. 2015;19(3):866–73. 25014981 10.1109/JBHI.2014.2335742 43. Delaney AL Arvedson JC Development of swallowing and feeding: prenatal through first year of life Dev Disabil Res Rev 2008 14 2 105 17 10.1002/ddrr.16 18646020 Delaney AL, Arvedson JC. Development of swallowing and feeding: prenatal through first year of life. Dev Disabil Res Rev. 2008;14(2):105–17. 18646020 10.1002/ddrr.16 44. Sanchez KB Spittle AJP Slattery JMB Morgan ATP Oromotor feeding in children born before 30 weeks' gestation and term-born peers at 12 months' corrected age J Pediatr 2016 178 113 8.e111 10.1016/j.jpeds.2016.07.044 27609073 Sanchez KB, Spittle AJP, Slattery JMB, Morgan ATP. Oromotor feeding in children born before 30 weeks’ gestation and term-born peers at 12 months’ corrected age. J Pediatr. 2016;178:113-8.e111. 27609073 10.1016/j.jpeds.2016.07.044 45. Rommel N van Wijk M Boets B Development of pharyngo-esophageal physiology during swallowing in the preterm infant Neurogastroenterol Motil 2011 23 10 e401 8 10.1111/j.1365-2982.2011.01763.x 21827583 Rommel N, van Wijk M, Boets B, et al. Development of pharyngo-esophageal physiology during swallowing in the preterm infant. Neurogastroenterol Motil. 2011;23(10):e401-8. 21827583 10.1111/j.1365-2982.2011.01763.x 46. Ince DA Ecevit A Acar BO Noninvasive evaluation of swallowing sound is an effective way of diagnosing feeding maturation in newborn infants Acta Paediatr 2014 103 8 e340 8 10.1111/apa.12686 24814215 Ince DA, Ecevit A, Acar BO, et al. Noninvasive evaluation of swallowing sound is an effective way of diagnosing feeding maturation in newborn infants. Acta Paediatr. 2014;103(8):e340-8. 24814215 10.1111/apa.12686 47. Lau C Smith EO Schanler RJ Coordination of suck-swallow and swallow respiration in preterm infants Acta Paediatr 2003 92 6 721 7 10.1111/j.1651-2227.2003.tb00607.x 12856985 Lau C, Smith EO, Schanler RJ. Coordination of suck-swallow and swallow respiration in preterm infants. Acta Paediatr. 2003;92(6):721–7. 12856985 48. Vice FL Heinz JM Giuriati G Hood M Bosma JF Cervical auscultation of suckle feeding in newborn infants Dev Med Child Neurol 1990 32 9 760 8 10.1111/j.1469-8749.1990.tb08479.x 2227139 Vice FL, Heinz JM, Giuriati G, Hood M, Bosma JF. Cervical auscultation of suckle feeding in newborn infants. Dev Med Child Neurol. 1990;32(9):760–8. 2227139 10.1111/j.1469-8749.1990.tb08479.x 49. Frakking TT Chang AB O'Grady KF Yang J David M Weir KA Acoustic and perceptual profiles of swallowing sounds in children: normative data for 4–36 months from a cross-sectional study cohort Dysphagia 2017 32 2 261 70 10.1007/s00455-016-9755-1 27830392 Frakking TT, Chang AB, O’Grady KF, Yang J, David M, Weir KA. Acoustic and perceptual profiles of swallowing sounds in children: normative data for 4–36 months from a cross-sectional study cohort. Dysphagia. 2017;32(2):261–70. 27830392 10.1007/s00455-016-9755-1 50. Rommel N Diagnosis of oropharyngeal disorders in young children 2002 Kindergeneeskunde Department Neurowetenschappen en Psychiatrie, Katholieke Universiteit Leuven Rommel N. Diagnosis of oropharyngeal disorders in young children 51. Almeida ST Ferlin EL Parente MAMP Goldani HAS Assessment of swallowing sounds by digital cervical auscultation in children Ann Otol Rhinol Laryngol 2008 117 4 253 8 10.1177/000348940811700403 18478833 Almeida ST, Ferlin EL, Parente MAMP, Goldani HAS. Assessment of swallowing sounds by digital cervical auscultation in children. Ann Otol Rhinol Laryngol. 2008;117(4):253–8. 18478833 10.1177/000348940811700403 52. Cichero JAY Murdoch BE Acoustic signature of the normal swallow: characterization by age, gender, and bolus volume Ann Otol Rhinol Laryngol 2002 111 7 Pt 1 623 32 10.1177/000348940211100710 12126019 Cichero JAY, Murdoch BE. Acoustic signature of the normal swallow: characterization by age, gender, and bolus volume. Ann Otol Rhinol Laryngol. 2002;111(7 Pt 1):623–32. 12126019 10.1177/000348940211100710 53. Youmans SR Stierwalt JA An acoustic profile of normal swallowing Dysphagia 2005 20 195 209 10.1007/s00455-005-0013-1 16362508 Youmans SR, Stierwalt JA. An acoustic profile of normal swallowing. Dysphagia. 2005;20:195–209. 16362508 10.1007/s00455-005-0013-1 54. Youmans SR, Stierwalt JA. Normal Swallowing Acoustics Across Age, Gender, Bolus Viscosity, and Bolus Volume. Dysphagia. 10.1007/s00455-010-9323-z 21225287 55. Moriniere S Beutter P Boiron M Sound component duration fo healthy human pharyngoesophageal swallowing: a gender comparison study Dysphagia 2006 10.1007/s00455-006-9023-x 16897324 Moriniere S, Beutter P, Boiron M. Sound component duration fo healthy human pharyngoesophageal swallowing: a gender comparison study. Dysphagia. 2006. 10.1007/s00455-006-9023-x. 16897324 10.1007/s00455-006-9023-x 56. Moriniere S Boiron M Alison D Makris P Beutter P Origin of the sound components during pharyngeal swallowing in normal subjects Dysphagia 2008 23 3 267 73 10.1007/s00455-007-9134-z 18071792 Moriniere S, Boiron M, Alison D, Makris P, Beutter P. Origin of the sound components during pharyngeal swallowing in normal subjects. Dysphagia. 2008;23(3):267–73. 18071792 10.1007/s00455-007-9134-z 57. Clinical Services Capability Framework Self-Assessment. https://www.health.qld.gov.au/_data/assets/pdf_file/0025/634903/cscf-selfassess-sum-metro-north.pdf 58. Ludwig SM Waitzman KA Changing feeding documentation to reflect infant-driven feeding practice Newborn Infant Nurs Rev 2007 7 3 155 60 10.1053/j.nainr.2007.06.007 Ludwig SM, Waitzman KA. Changing feeding documentation to reflect infant-driven feeding practice. Newborn Infant Nurs Rev. 2007;7(3):155–60. 59. Howe TH Sheu CF Hsieh YW Hsieh CL Psychometric characteristics of the neonatal oral-motor assessment scale in healthy preterm infants Dev Med Child Neurol 2007 49 12 915 9 10.1111/j.1469-8749.2007.00915.x 18039238 Howe TH, Sheu CF, Hsieh YW, Hsieh CL. Psychometric characteristics of the neonatal oral-motor assessment scale in healthy preterm infants. Dev Med Child Neurol. 2007;49(12):915–9. 18039238 10.1111/j.1469-8749.2007.00915.x 60. Thoyre SM Shaker CS Pridham KF The early feeding skills assessment for preterm infants Neonatal Netw 2005 10.1891/0730-0832.24.3.7 15960007 PMC2828611 Thoyre SM, Shaker CS, Pridham KF. The early feeding skills assessment for preterm infants. Neonatal Netw. 2005. 10.1891/0730-0832.24.3.7. 15960007 10.1891/0730-0832.24.3.7 PMC2828611 61. Fattal M Suiter DM Warner HL Leder SB Effect of presence/absence of a nasogastric tube in the same person on incidence of aspiration Otolaryngol Head Neck Surg 2011 145 5 796 800 10.1177/0194599811417067 21810774 Fattal M, Suiter DM, Warner HL, Leder SB. Effect of presence/absence of a nasogastric tube in the same person on incidence of aspiration. Otolaryngol Head Neck Surg. 2011;145(5):796–800. 21810774 10.1177/0194599811417067 62. Khodami F Mahoney AS Coyle JL Sejdic E Elevating patient care with deep learning: high-resolution cervical auscultation signals for swallowing kinematic analysis in nasogastric tube patients IEEE J Transl Eng Health Med 2024 12 711 20 10.1109/JTEHM.2024.3497895 39698476 PMC11655099 Khodami F, Mahoney AS, Coyle JL, Sejdic E. Elevating patient care with deep learning: high-resolution cervical auscultation signals for swallowing kinematic analysis in nasogastric tube patients. IEEE J Transl Eng Health Med. 2024;12:711–20. 39698476 10.1109/JTEHM.2024.3497895 PMC11655099 63. Cichero JAY Murdoch BE Detection of swallowing sounds: methodology revisited Dysphagia 2002 17 1 40 9 10.1007/s00455-001-0100-x 11824392 Cichero JAY, Murdoch BE. Detection of swallowing sounds: methodology revisited. Dysphagia. 2002;17(1):40–9. 11824392 10.1007/s00455-001-0100-x 64. Welch P The use of fast Fourier transform for the estimation of power spectra: a method based on time averaging over short, modified periodograms IEEE Trans Audio Electroacoust 1967 15 2 70 3 10.1109/TAU.1967.1161901 Welch P. The use of fast Fourier transform for the estimation of power spectra: a method based on time averaging over short, modified periodograms. IEEE Trans Audio Electroacoust. 1967;15(2):70–3. 65. Kay SM Modern spectral estimation: theory and application 1988 Englewood-Cliffs Prentice-Hall Kay SM. Modern spectral estimation: theory and application. Englewood-Cliffs: Prentice-Hall; 1988. 66. Jaghbeer M Sutt A-L Bergström L Dysphagia management and cervical auscultation: reliability and validity against FEES Dysphagia 2023 38 1 305 14 10.1007/s00455-022-10468-8 35838785 PMC9873722 Jaghbeer M, Sutt A-L, Bergström L. Dysphagia management and cervical auscultation: reliability and validity against FEES. Dysphagia. 2023;38(1):305–14. 35838785 10.1007/s00455-022-10468-8 PMC9873722 67. Phillips PC Designing experiments to maximize the power of detecting correlations Evolution 1998 52 1 251 5 10.2307/2410940 28568159 Phillips PC. Designing experiments to maximize the power of detecting correlations. Evolution. 1998;52(1):251–5. 28568159 10.1111/j.1558-5646.1998.tb05158.x 68. Shapiro SS Wilk MB An analysis of variance test for normality (complete samples) Biometrika 1965 52 3/4 591 611 10.2307/2333709 Shapiro SS, Wilk MB. An analysis of variance test for normality (complete samples). Biometrika. 1965;52(3/4):591–611. 69. Cohen J A coefficient of agreement for nominal scales Educ Psychol Measur 1960 20 37 46 10.1177/001316446002000104 Cohen J. A coefficient of agreement for nominal scales. Educ Psychol Measur. 1960;20:37–46. 70. Landis J Koch G The measurement of observer agreement for categorical data Biometrics. 1977 33 159 74 10.2307/2529310 843571 Landis J, Koch G. The measurement of observer agreement for categorical data. Biometrics. 1977;33:159–74. 843571 71. Byrt T Bishop J Carlin JB Bias, prevalence and kappa J Clin Epidemiol 1993 46 5 423 9 10.1016/0895-4356(93)90018-V 8501467 Byrt T, Bishop J, Carlin JB. Bias, prevalence and kappa. J Clin Epidemiol. 1993;46(5):423–9. 8501467 10.1016/0895-4356(93)90018-v 72. Portney LG, Watkins MP. Foundations of clinical research : applications to practice. 73. Hennessey NW Fisher G Ciccone N Developmental changes in pharyngeal swallowing acoustics: a comparison of adults and children Logoped Phoniatr Vocol 2018 43 2 63 72 10.1080/14015439.2017.1326526 28523949 Hennessey NW, Fisher G, Ciccone N. Developmental changes in pharyngeal swallowing acoustics: a comparison of adults and children. Logoped Phoniatr Vocol. 2018;43(2):63–72. 28523949 10.1080/14015439.2017.1326526 74. Omori F Fujiu-Kurachi M Wada K Yamano T Effects of bolus types and swallowing maneuvers on laryngeal elevation: analysis of healthy young adult men and healthy older men Dysphagia 2024 39 4 573 85 10.1007/s00455-023-10638-2 38019278 Omori F, Fujiu-Kurachi M, Wada K, Yamano T. Effects of bolus types and swallowing maneuvers on laryngeal elevation: analysis of healthy young adult men and healthy older men. Dysphagia. 2024;39(4):573–85. 38019278 10.1007/s00455-023-10638-2 75. Horita HM Friesen TL Cahill G Development of a medical complexity score for pediatric aerodigestive patients J Pediatr 2023 261 113549 10.1016/j.jpeds.2023.113549 37301281 Horita HM, Friesen TL, Cahill G, et al. Development of a medical complexity score for pediatric aerodigestive patients. J Pediatr. 2023;261:113549. 37301281 10.1016/j.jpeds.2023.113549 76. Kaspy KR Burg G Garrison AP The follow up of complex infants in an aerodigestive clinic Paediatr Respir Rev 2022 44 3 10 36411238 10.1016/j.prrv.2022.06.002 Kaspy KR, Burg G, Garrison AP, et al. The follow up of complex infants in an aerodigestive clinic. Paediatr Respir Rev. 2022;44:3–10. 36411238 10.1016/j.prrv.2022.06.002 77. Durvasula VSPB Lawson BR Bower CM Richter GT Supraglottoplasty in premature infants with laryngomalacia: does gestation age at birth influence outcomes? Otolaryngol Head Neck Surg 2014 150 2 292 9 10.1177/0194599813514370 24323908 Durvasula VSPB, Lawson BR, Bower CM, Richter GT. Supraglottoplasty in premature infants with laryngomalacia: does gestation age at birth influence outcomes? Otolaryngol Head Neck Surg. 2014;150(2):292–9. 24323908 10.1177/0194599813514370 78. Medoff-Cooper B Rankin K Li Z Liu L White-Traut R Multi-sensory intervention for preterm infants improves sucking organization Adv Neonatal Care 2015 15 2 142 9 10.1097/ANC.0000000000000166 25822519 PMC4392385 Medoff-Cooper B, Rankin K, Li Z, Liu L, White-Traut R. Multi-sensory intervention for preterm infants improves sucking organization. Adv Neonatal Care. 2015;15(2):142–9. 25822519 10.1097/ANC.0000000000000166 PMC4392385 79. Mayerl CJ Gould FDH Adjerid K Edmonds C German RZ The pathway from anatomy and physiology to diagnosis: a developmental perspective on swallowing and dysphagia Dysphagia 2023 38 1 33 41 10.1007/s00455-022-10449-x 35441265 PMC9579268 Mayerl CJ, Gould FDH, Adjerid K, Edmonds C, German RZ. The pathway from anatomy and physiology to diagnosis: a developmental perspective on swallowing and dysphagia. Dysphagia. 2023;38(1):33–41. 35441265 10.1007/s00455-022-10449-x PMC9579268 80. Rhoads E Montgomery GS Ren CL Wheezing in preterm infants and children Pediatr Pulmonol 2021 56 11 3472 7 10.1002/ppul.25314 33580622 Rhoads E, Montgomery GS, Ren CL. Wheezing in preterm infants and children. Pediatr Pulmonol. 2021;56(11):3472–7. 33580622 10.1002/ppul.25314 81. Stevens TPMDMPH Finer NNMD Carlo WAMD Respiratory outcomes of the surfactant positive pressure and oximetry randomized trial (SUPPORT) J Pediatr 2014 165 2 240 9.e244 10.1016/j.jpeds.2014.02.054 24725582 PMC4111960 Stevens TPMDMPH, Finer NNMD, Carlo WAMD, et al. Respiratory outcomes of the surfactant positive pressure and oximetry randomized trial (SUPPORT). J Pediatr. 2014;165(2):240-9.e244. 24725582 10.1016/j.jpeds.2014.02.054 PMC4111960 82. Zhou L Marzbanrad F Ramanathan A Fattahi D Pharande P Malhotra A Acoustic analysis of neonatal breath sounds using digital stethoscope technology Pediatr Pulmonol 2020 55 3 624 30 10.1002/ppul.24633 31917903 Zhou L, Marzbanrad F, Ramanathan A, Fattahi D, Pharande P, Malhotra A. Acoustic analysis of neonatal breath sounds using digital stethoscope technology. Pediatr Pulmonol. 2020;55(3):624–30. 31917903 10.1002/ppul.24633 83. Leonard JA Reilly BK Laryngomalacia in the premature neonate NeoReviews 2021 22 10 e653 9 10.1542/neo.22-10-e653 34599063 Leonard JA, Reilly BK. Laryngomalacia in the premature neonate. NeoReviews. 2021;22(10):e653-9. 34599063 10.1542/neo.22-10-e653 84. Been JV Lugtenberg MJ Smets E Preterm birth and childhood wheezing disorders: a systematic review and meta-analysis PLoS Med 2014 11 1 e1001596 10.1371/journal.pmed.1001596 24492409 PMC3904844 Been JV, Lugtenberg MJ, Smets E, et al. Preterm birth and childhood wheezing disorders: a systematic review and meta-analysis. PLoS Med. 2014;11(1):e1001596. 24492409 10.1371/journal.pmed.1001596 PMC3904844 85. Kotecha SJ Watkins WJ Lowe J Granell R Henderson AJ Kotecha S Comparison of the associations of early-life factors on wheezing phenotypes in preterm-born children and term-born children Am J Epidemiol 2019 188 3 527 36 10.1093/aje/kwy268 30668648 PMC6395162 Kotecha SJ, Watkins WJ, Lowe J, Granell R, Henderson AJ, Kotecha S. Comparison of the associations of early-life factors on wheezing phenotypes in preterm-born children and term-born children. Am J Epidemiol. 2019;188(3):527–36. 30668648 10.1093/aje/kwy268 PMC6395162 86. Islam JY Keller RL Aschner JL Hartert TV Moore PE Understanding the short- and long-term respiratory outcomes of prematurity and bronchopulmonary dysplasia Am J Respir Crit Care Med 2015 192 2 134 56 10.1164/rccm.201412-2142PP 26038806 PMC4532824 Islam JY, Keller RL, Aschner JL, Hartert TV, Moore PE. Understanding the short- and long-term respiratory outcomes of prematurity and bronchopulmonary dysplasia. Am J Respir Crit Care Med. 2015;192(2):134–56. 26038806 10.1164/rccm.201412-2142PP PMC4532824 87. Crist AP Hibbs AM Prematurity-associated wheeze: current knowledge and opportunities for further investigation Pediatr Res 2023 94 1 74 81 10.1038/s41390-022-02404-1 36463364 PMC10238677 Crist AP, Hibbs AM. Prematurity-associated wheeze: current knowledge and opportunities for further investigation. Pediatr Res. 2023;94(1):74–81. 36463364 10.1038/s41390-022-02404-1 PMC10238677 88. Ganguly A Martin RJ Vulnerability of the developing airway Respir Physiol Neurobiol 2019 270 103263 10.1016/j.resp.2019.103263 31386914 PMC9760171 Ganguly A, Martin RJ. Vulnerability of the developing airway. Respir Physiol Neurobiol. 2019;270:103263. 31386914 10.1016/j.resp.2019.103263 PMC9760171 89. Pinnington LL Smith CM Ellis RE Morton RE Feeding efficiency and respiratory integration in infants with acute viral bronchiolitis J Pediatr 2000 137 4 523 6 10.1067/mpd.2000.108396 11035832 Pinnington LL, Smith CM, Ellis RE, Morton RE. Feeding efficiency and respiratory integration in infants with acute viral bronchiolitis. J Pediatr. 2000;137(4):523–6. 11035832 10.1067/mpd.2000.108396 90. Reynolds EW Grider D Caldwell R Swallow-breath interaction and phase of respiration with swallow during nonnutritive suck among low-risk preterm infants Am J Perinatol 2010 27 10 831 40 10.1055/s-0030-1262504 20607645 Reynolds EW, Grider D, Caldwell R, et al. Swallow-breath interaction and phase of respiration with swallow during nonnutritive suck among low-risk preterm infants. Am J Perinatol. 2010;27(10):831–40. 20607645 10.1055/s-0030-1262504 ",
  "metadata": {
    "Title of this paper": "Swallow-breath interaction and phase of respiration with swallow during nonnutritive suck among low-risk preterm infants",
    "Journal it was published in:": "Dysphagia",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479640/"
  }
}