{
  "title": "Paper_493",
  "abstract": "Eye (Lond) Eye (Lond) 1476 eye Eye 0950-222X 1476-5454 Nature Publishing Group PMC11461932 PMC11461932.1 11461932 11461932 38951672 10.1038/s41433-024-03207-w 3207 1 Article Factors at the initial visit associated with poor visual outcomes in patients with acute retinal necrosis Fukui Chihiro 1 2 http://orcid.org/0000-0003-0806-6146 Takeda Atsunobu atsutakeda@oita-u.ac.jp 1 2 Hasegawa Eiichi 1 Asahara Kenichiro 1 Shirane Mariko 1 Tsutsui Hiroki 1 Yoshitomi Keiko 1 Ito Takako 1 3 http://orcid.org/0000-0002-1879-5476 Akiyama Masato 1 4 Notomi Shoji 1 Ishikawa Keijiro 1 Murakami Yusuke 1 Hisatomi Toshio 5 Yawata Nobuyo 1 4 6 7 Sonoda Koh-Hei 1 1 https://ror.org/00p4k0j84 grid.177174.3 0000 0001 2242 4849 Department of Ophthalmology, Graduate School of Medical Sciences, Kyushu University, 2 https://ror.org/01nyv7k26 grid.412334.3 0000 0001 0665 3553 Department of Ophthalmology, Faculty of Medicine, Oita University, 3 https://ror.org/00p4k0j84 grid.177174.3 0000 0001 2242 4849 Department of Ophthalmic Function and Regenerative Science, Graduate School of Medical Sciences, Kyushu University, 4 https://ror.org/00p4k0j84 grid.177174.3 0000 0001 2242 4849 Department of Ocular Pathology and Imaging Science, Graduate School of Medical Sciences, Kyushu University, 5 https://ror.org/04nt8b154 grid.411497.e 0000 0001 0672 2176 Department of Ophthalmology, Chikushi Hospital, Fukuoka University, 6 https://ror.org/02crz6e12 grid.272555.2 0000 0001 0706 4670 Singapore Eye Research Institute, 7 https://ror.org/02j1m6098 grid.428397.3 0000 0004 0385 0924 Ophthalmology and Visual Sciences Academic Clinical Program, Duke-NUS Medical School, 29 6 2024 10 2024 38 15 472439 2992 2998 6 2 2024 2 5 2024 21 6 2024 01 10 2025 01 10 2025 10 10 2024 01 10 2025 © The Author(s), under exclusive licence to The Royal College of Ophthalmologists 2024. Springer Nature or its licensor (e.g. a society or other partner) holds exclusive rights to this article under a publishing agreement with the author(s) or other rightsholder(s); author self-archiving of the accepted manuscript version of this article is solely governed by the terms of such publishing agreement and applicable law. 2024 Background/Objective Acute retinal necrosis (ARN) is a vision-threatening disease caused by herpesvirus infection. This study aimed to investigate the visual prognostic factors that could be determined at the initial visit. Subjects and Methods This retrospective study included 34 patients with ARN. Logistic regression analysis was employed to evaluate the associations between poor final visual outcomes and various factors, including poor initial visual acuity, presence of retinal detachment at the initial visit, posterior extension of necrotizing retinitis, and circumferential extension of necrotizing retinitis. Posterior extension was evaluated with three zonings, from the periphery (zone 3), mid-periphery (zone 2), and macula (zone 1). Circumferential extension was evaluated according to the degree of necrotizing retinitis lesions using ultra-wide fundus imaging. Results The mean logarithm of the minimum angle of resolution was 0.63 ± 0.68 at the initial visit and 0.83 ± 0.65 at 12 months after the initial visit. Seven patients had a retinal detachment. The distribution of posterior extension at the initial visit was 5 in zone 1, 20 in zone 2, and 9 in zone 3. The average of necrotizing retinitis lesion angle was 249 ± 115°. The logistic regression analysis revealed that participants with wide angles of necrotizing retinitis were associated with final poor vision, with an odds ratio of 1.28 per 30° increase (95%CI: 1.00–1.65, p Conclusions Assessment of the widespread circumferential extension of white necrotizing retinal lesions at the initial visit is a crucial risk factor for the visual prognosis in ARN. Subject terms Uveal diseases Risk factors Viral infection The Japan Society for the Promotion of Science (JSPS), the Ministry of Education, Science, Sports, and Culture of Japan: Grant number through JP21K09745 and JP24K12810 (Tokyo, Japan). Alcon Pharma Research Grants (Tokyo, Japan). AMO Japan Research Grants (Tokyo, Japan). https://doi.org/10.13039/100009619 Japan Agency for Medical Research and Development (AMED) 23jk0210042h0001 Yawata Nobuyo pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © The Royal College of Ophthalmologists 2024 ",
  "metadata": {
    "Title of this paper": "Factors at the initial visit associated with poor visual outcomes in patients with acute retinal necrosis",
    "Journal it was published in:": "Eye",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11461932/"
  }
}