{
  "title": "Paper_1185",
  "abstract": "pmc Biomedicines Biomedicines 3168 biomedicines biomedicines Biomedicines 2227-9059 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12467205 PMC12467205.1 12467205 12467205 41007664 10.3390/biomedicines13092101 biomedicines-13-02101 1 Article Ex Vivo Traceability Platform for Phospholipoproteomic Formulations: Functional Evidence Without Clinical Exposure https://orcid.org/0009-0004-8428-9549 Gutiérrez-Sandoval Ramón Conceptualization Writing – original draft Writing – review & editing Supervision Project administration Funding acquisition 1 * † Gutiérrez-Castro Francisco Conceptualization Methodology Validation Resources Writing – original draft Writing – review & editing 2 † Muñoz-Godoy Natalia Validation Data curation 2 Rivadeneira Ider Validation Data curation 3 Lagos Andy Investigation 3 Muñoz Ignacio Investigation 3 Iturra Jordan Validation Supervision 3 Krakowiak Francisco Validation Supervision 4 Peña-Vargas Cristián Writing – review & editing 1 Vidal Matías Validation 1 Toledo Andrés Software Data curation Visualization 1 Santambrogio Carlo Academic Editor 1 consultorusa@biogenica.org labcore@ogrdalliance.org ops@ogrdalliance.org 2 servicios@flowinmunocell.cl contacto@flowinmunocell.cl 3 iderlautaro@gmail.com lagosandy@gmail.com kinesiologo@recell.cl jiconsultant@ogrdconsorcio.com 4 tecnologo@bioclas.cl * cso@ogrdalliance.org † These authors contributed equally to this work. 28 8 2025 9 2025 13 9 497614 2101 06 6 2025 25 8 2025 27 8 2025 28 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background: Methods: Results: Conclusions: ex vivo validation phospholipoproteomic vesicles non-pharmacodynamic platforms kinetic profiling cytokine ratios reproducibility metrics regulatory documentation real-world evidence (RWE) Fundación Biotech FB-20222-0871 This research was supported by Fundación Biotech under funding grant number FB-20222-0871. The funding institution had no role in the design, execution, interpretation, or writing of this study. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Structurally active phospholipoproteomic bioformulations represent a rapidly evolving class of bioendogenous platforms designed to modulate biological environments without receptor-mediated targeting or systemic absorption. These systems—typically composed of phospholipid assemblies and protein–lipid complexes—engage interface-level cellular dynamics rather than eliciting classical pharmacodynamic responses [ 1 2 As such, they fall outside the logic of dose–response models, receptor-binding assays, and therapeutic endpoint frameworks. Their action is structural, often non-cytotoxic, and poorly captured by traditional preclinical tools. Further complicating their evaluation is their intrinsic complexity: many of these platforms are heterogeneous, multicomponent, and non-redundant, lacking a single active constituent and instead relying on emergent functional properties. This renders them incompatible with reductionist assays such as target inhibition, genomic activation, or high-throughput receptor profiling [ 3 This complexity is particularly relevant for formulations aimed at immunomodulation, structural support, or phenotypic stabilization in tissues affected by chronic disease, tumor microenvironment remodeling, or post-treatment recovery. In such contexts, structural compatibility becomes more relevant than therapeutic potency. Yet documenting this compatibility remains methodologically challenging, as no standardized model exists to capture the nuanced biological behavior of these systems under neutral, non-destructive experimental conditions [ 4 The challenge intensifies when these platforms are intended for patients systematically excluded from clinical trials—those with frailty, comorbidities, immunosuppression, or post-therapy instability [ 5 Figure 1 Therefore, it does not fit within conventional IND or NDA frameworks designed for pharmacodynamic products. Instead, it belongs to a class of structurally defined, non-pharmacodynamic platforms whose behavior can be fully documented through non-clinical, technically harmonized protocols—such as STIP—using reproducible, regulatorily accepted metrics such as ΔC%, viability, and cytokine ratios, without exposing human subjects or invoking therapeutic endpoints. Most current infrastructures for biomedical validation are ill-suited to this need. CROs are designed for comparative arms and endpoint trials; eCRFs focus on human-subject tracking; and LIMS platforms lack logic for dynamic cellular interpretation or immunophenotypic profiling [ 6 This gap is addressed by kinetic imaging systems such as the IncuCyte ® 7 Moreover, such systems allow for highly standardized protocols reproducible across cell lines, batches, and timepoints. They capture divergence timing, morphological integrity, and curve stability—variables rarely tracked in endpoint studies [ 8 In this study, we present and validate a standardized ex vivo protocol for assessing human tumor-derived cell lines exposed to structurally complex phospholipoproteomic formulations. The protocol employs real-time, label-free kinetic imaging over 48 h, without reliance on gene expression assays, fluorogenic labeling, or endpoint toxicity readouts. The goal is not to assign therapeutic labels but to establish a stable, regulatorily aligned methodology for documenting structurally compatible cellular trajectories under controlled laboratory conditions [ 9 By focusing on reproducibility, technical neutrality, and functional traceability, this work proposes a platform suitable for early-stage screening, inter-batch comparability, and documentation under CTD 5.3 or SAP frameworks. It is designed to complement—not replace—clinical or molecular validation, and is particularly suited for product types and patient populations where conventional trials are infeasible. The overall architecture and logic of the STIP system are summarized in Figure 2 2. Materials and Methods 2.1. Selection of Cell Models and Vesicular Inputs To assess the technical robustness of a standardized ex vivo monitoring protocol, a selection of human tumor-derived adherent cell lines was assembled based on imaging performance, morphological consistency, and baseline proliferation compatibility. The panel included eight cell lines from distinct tissue origins: A375 (melanoma), MCF-7 (breast carcinoma), BEWO (trophoblast), U87-MG (glioblastoma), LNCaP-C42 (prostate carcinoma), HepG2 (hepatocellular carcinoma), PANC-1 (pancreatic carcinoma), and LUDLU-1 (lung carcinoma) [ 10 11 The objective of this selection was not to characterize biological differences between lines, but to validate whether the kinetic protocol could generate reproducible acquisition outputs—independent of lineage, morphology, or growth rate variability. All cells were cultured in either DMEM or RPMI-1640 supplemented with 10% fetal bovine serum and 1% penicillin/streptomycin, maintained at 37 °C with 5% CO 2 12 13 The vesicular materials tested corresponded to complex phospholipid-based preparations derived from non-genetically modified producer cells. Each preparation was characterized for particle size distribution (via dynamic light scattering), surface chemistry (FTIR), and endotoxin content (LAL assay) [ 14 15 16 Rather than focus on the biological interpretation of the vesicle–cell interaction, this phase of the study was dedicated to evaluating the platform’s ability to maintain image quality, acquisition continuity, and metric stability across experimental replicates. The design excluded endpoint functional labeling and was intended as a technical baseline for neutral documentation [ 17 Figure 3 2.2. Ex Vivo Exposure Protocol and Real-Time Monitoring To ensure standardization and procedural neutrality during vesicle–cell exposure, cells were seeded in 96-well flat-bottom plates pre-treated for optimal adhesion. Each well received 5000 cells in 100 µL of complete medium and was allowed to undergo a uniform 12 h adhesion phase before any treatment was applied. Phospholipoproteomic platforms were then introduced in antibiotic-free medium at a protein concentration previously adjusted to 10 µg/mL. Parallel wells received an equal volume of vehicle-only medium as untreated controls. All conditions were tested in technical triplicate across multiple plates to evaluate reproducibility under controlled conditions [ 18 The plates were immediately transferred to a live-cell imaging platform (IncuCyte ® 2 Prior to assay initiation, each plate underwent a visual and software-assisted review to detect any air bubbles, well edge detachment, or inconsistencies in cell distribution. Wells showing visual artifacts or abnormal background patterns were excluded. Image sequences with fewer than 90% valid timepoints were also removed from downstream processing [ 19 20 The imaging data generated during the 48 h run were not used to infer biological classifications or cellular phenotypes. Instead, they were processed as raw technical outputs for evaluating the consistency of confluence progression, cell integrity over time, and fluorescence acquisition stability across wells. No thresholding, typological interpretation, or system logic was applied in this phase. The objective was purely methodological: to assess whether the imaging protocol can deliver complete, non-interrupted data sequences under real-use conditions [ 21 2.3. Viability Monitoring Under Continuous Imaging Conditions To incorporate a viability-sensitive dimension into the kinetic protocol without disrupting assay continuity, a non-invasive fluorescent dye was included in all wells prior to the onset of automated monitoring. A commercially validated membrane-impermeant probe (Cytotox Green™, Essen BioScience) was used at a final concentration of 250 nM, enabling selective fluorescence of cells exhibiting compromised membrane integrity due to environmental stress or early-stage damage. The probe remains stable under standard incubation and does not require replenishment or manual intervention [ 20 Fluorescent images were acquired at the same temporal resolution as phase-contrast images (one-hour intervals) using the green fluorescence channel. Signal normalization was performed automatically by the Incucyte Live-Cell Analysis Software (Sartorius, version 2022A) andverified through downstream inspection. Fluorescence intensity was adjusted based on well area and initial baseline levels to correct for variations in cell density and imaging geometry. This allowed the resulting signal to be interpreted as a dynamic indicator of stress-associated permeability rather than endpoint toxicity. All datasets were screened for signal saturation, interference artifacts (e.g., precipitates, edge reflections), and morphological anomalies. Only wells maintaining stable signal profiles across the full observation period were retained. Fluorescent heatmaps were independently reviewed post-acquisition by a technical analyst blinded to experimental allocation, ensuring that signal evaluation remained classification-neutral and free from interpretive bias [ 21 The objective of this component was not to detect cytotoxicity, but to confirm the viability-preserving conditions of the protocol and to rule out unintended cell compromise during exposure. By embedding viability sensing into the acquisition loop, the assay retains its non-destructive character while gaining a quality assurance layer regarding culture stability and environmental stress response. An illustration of this viability monitoring strategy is shown in Figure 4 2.4. Multiplex Cytokine Quantification Under Non-Disruptive Conditions To explore the feasibility of secretomic data collection within a non-destructive ex vivo protocol, a multiplex cytokine assay was incorporated as a post-acquisition module. The purpose was not to infer immune activation or cellular polarization, but to evaluate whether cytokine quantification could be technically harmonized with continuous kinetic imaging without affecting culture integrity or introducing process artifacts. At 48 h post-exposure—following completion of the kinetic observation window—supernatants were carefully harvested from each well under sterile conditions. Samples were clarified by centrifugation (2000 rpm, 10 min) to remove residual cell fragments and vesicle aggregates. The cytokines selected for assay were interleukin-6 (IL-6), interferon gamma (IFN-γ), and interleukin-10 (IL-10), chosen for their prevalence in structural vesicular models and relevance in immunological calibration contexts [ 22 Quantification was performed using a multiplexed bead-based platform (Cytometric Bead Array, BD Biosciences, Milpitas, CA, USA), following the standard protocol of the Human Inflammation Kit. Each target analyte was measured in technical duplicate using a 25 µL aliquot per sample. Fluorescent readings were acquired using a FACSCalibur ® , 23 24 Only assays that met predefined analytical quality standards—correlation coefficient R 2 25 2.5. Preprocessing and Normalization (T 0 All time-series data obtained through the IncuCyte ® 26 The first stage involved normalization of each kinetic sequence relative to its own baseline value, defined as the initial valid measurement recorded at the onset of automated acquisition, referred to as T0. This normalization allowed for meaningful comparison of cells with varying initial cell densities without requiring rescaling to absolute values. The percentage change in confluence over time (ΔC_t) was calculated using the following equation [ 26 ΔC_t = (C_t − C_t0)/C_t0 × 100 To further minimize high-frequency noise, a moving average smoothing function was applied using either 3-point or 5-point sliding windows, depending on signal stability. This operation reduced minor fluctuations caused by optical distortion, transient focus shift, or condensation artifacts while preserving the overall kinetic shape of the trajectory [ 27 A relative standard deviation (RSD) threshold of <10% was used to compare the smoothed curve with its raw counterpart. If this threshold was exceeded, the unaltered dataset was retained to avoid overfitting [ 28 The combined normalization and smoothing workflow was not intended to infer biological behavior, but to ensure that raw data met defined technical quality standards before any interpretative use. This preprocessing protocol enables clean, reproducible acquisition in ex vivo kinetic models and can be integrated into external documentation pipelines as a validated data handling step. The full normalization and smoothing workflow is diagrammed in Figure 5 2.6. Derived Metrics for Technical Kinetic Evaluation To assess signal consistency and generate quantifiable readouts from time-lapse imaging data, a set of derived metrics was defined for each experimental run. These metrics were not intended for functional classification or phenotypic interpretation, but rather to support curve comparison, inter-assay uniformity, and plate-level technical review under harmonized conditions [ 29 Final confluence shift (ΔC%) was calculated as the relative change in confluence between treated and untreated wells at the final timepoint (48 h). The following formula was used: ΔC% = (C_t48 h treated − C_t48 h control)/C_t48 h control × 100 30 Slope Estimation was performed using linear regression over the mid-phase of the proliferation curve. The regression window was defined individually for each cell line based on visual stability and signal-to-noise ratio. No thresholds or directional logic were applied to the slope; it served as a general descriptor of curve progression under observation [ 31 Area Under the Curve (AUC) was calculated using trapezoidal integration over the full 48 h timeline. This metric provides a cumulative measure of cell growth during the assay and was used to compare curve shapes across replicates or formulations [ 32 Cumulative Fluorescence Signal was extracted from the green channel data acquired through Cytotox Green imaging. Fluorescence intensities were normalized to baseline values and expressed as relative accumulated signal per well. No cutoff thresholds were used to trigger decisions or exclusions. This signal was stored for future comparison or audit consistency only [ 33 Cytokine Expression Ratios were calculated post-assay from IL-6, IL-10, and IFN-γ concentrations measured via multiplex bead array. The IFN-γ/IL-10 ratio was derived as a numerical value to accompany kinetic data in cross-referenced reports. This value was not used for classification, only for annotation and technical benchmarking [ 34 Each of these metrics contributes to the documentation and reproducibility tracking of the kinetic protocol, but remains isolated from any logic-based decision system. No phenotypic category, label, or typological assignment was made at this stage. These values are intended to support future reproducibility assessments, method comparisons, or audit traceability in technical-only contexts. This quantitative confluence shift is exemplified graphically in Figure 6 Supplementary Text S1, Supplementary Table S1, and Supplementary Figures S1–S11 The ΔC% value represents the relative difference in confluence at the final timepoint (48 h), calculated as a percentage of the control well value. The formula shown below the curve was applied uniformly across all assays. This metric was used solely for documentation, reproducibility analysis, and internal batch comparison; it played no role in classification or phenotypic decision-making. 2.7. Multimetric Documentation for Batch-Level Technical Comparison To facilitate reproducibility tracking and ensure comparability of kinetic datasets across experimental cycles, a structured set of post-acquisition metrics was compiled for each vesicle–cell line pairing. These values were not aggregated into a single index or used to drive classification logic; instead, they were recorded in parallel and archived as part of a traceable technical register used for inter-assay review, protocol refinement, and documentation consistency [ 35 The core metrics included the following: Final confluence shift at 48 h (ΔC%); Area under the kinetic curve (AUC); Mean slope during log-phase growth; Cumulative non-lethal fluorescence signal (viability); Secretomic concentrations of IL-6, IL-10, and IFN-γ. Inter-lot variability in secretomic profiles is visualized in Supplementary Figure S2 Each parameter was retained as a native unit (%, AU, slope, pg/mL, etc.) and stored without transformation or functional weighting. No phenotypic assignment or scoring model was applied. Instead, these values served as technical descriptors to support intra- and inter-batch continuity analysis under protocol-standard conditions [ 36 Table 1 Figure 7 Metrics were recorded per assay unit and used to generate internal documentation dashboards, QC audits, or downstream dataset filters. Their role is exclusively procedural and does not support functional stratification or immune classification. A representative table is shown below. The distribution of values across the five recorded metrics—ΔC%, AUC, log-phase slope, cumulative viability, and secretomic level—was visualized using vertical dot plots. Each dot represents a single batch (FV-001 to FV-005), plotted against its corresponding value for each variable. Horizontal dispersion was not applied; all data points are aligned along the vertical axis of each metric. No thresholds, groupings, or statistical categories were inferred. The purpose of the plot is to illustrate batch-to-batch variation in raw metric values under identical protocol conditions. 2.8. Optional Logic Layer for Post Hoc Categorization (Informative Use Only) Although the current implementation of the protocol is intended for data acquisition and technical validation only, a modular logic layer may optionally be added in future versions to support functional annotation of vesicle–cell interactions. This logic, however, is not embedded in the current system and was not applied to the datasets described herein. Its description here is solely conceptual and intended for readers interested in how kinetic and secretomic data might be explored under alternative interpretive frameworks [ 37 Such a logic layer, if externally applied, would typically rely on basic criteria such as directional shifts in confluence, sustained signal separation between treated and control wells, and supporting markers, including viability signal and post-treatment secretomic values. These parameters—already present in the dataset as raw outputs—could, in theory, be aligned to threshold-based interpretive models; however, no such thresholds were used in the present work [ 38 Figure 8 Importantly, no decision tree, node-based classification, or categorical assignment was executed. All results were retained as continuous, raw numeric values. No labels, such as “stimulatory,” “neutral,” or “inhibitory”, were attributed to any condition. All visualizations, figures, and tables were designed to reflect purely quantitative behavior [ 39 If such a framework were implemented in future audits or follow-up studies, it would require external validation and regulatory disclosure. For the purpose of this study, the dataset remains logic-neutral and does not include interpretive algorithms or conditional exclusion criteria [ 40 2.9. Output File Structure and Technical Traceability Protocol Each experimental unit completed under the kinetic imaging protocol generated a structured technical output compiled in a standardized reporting format. This format was designed to ensure reproducibility, audit readiness, and interoperability with institutional data management systems. The objective was not to create a classification report, but to enable the long-term storage and traceability of raw observations and derived metrics under harmonized technical conventions [ 41 Each file was generated in digital format (PDF/A and spreadsheet-based appendix), containing the following documentation fields: Protocol metadata: date of acquisition, cell line, vesicle formulation code, analyst ID, and instrument version. Imaging record: full confluence time-series, normalized and raw; signal continuity quality check (frame count and error points). Fluorescence summary: cumulative viability signal per well and plate, normalized to baseline. Cytokine quantification output: pg/mL values for IL-6, IL-10, and IFN-γ, with calibration metadata. Derived metric table: final confluence shift (ΔC%), log-phase slope, area under the curve (AUC), and duration of signal continuity. Visual documentation: representative kinetic plots for each replicate condition. Appendices: operator logs, file integrity hash (SHA-256), and reference templates for internal batch cross-validation. Version control was embedded in each file set using a protocol identifier system and change log history, ensuring transparency in documentation evolution. This structure was built to support regulatory inspection, retrospective auditability, and internal technical review processes, without invoking interpretation logic, classification thresholds, or predictive outputs. 2.10. Cross-Batch Validation and Independent Technical Review To ensure data reproducibility and consistency across production cycles, a structured cross-validation process was applied to each vesicle–cell line pairing. The objective of this protocol was not to confirm biological activity, but to verify whether technical metrics remained stable across independently prepared vesicle batches and replicate wells [ 42 Each formulation was tested under uniform conditions in at least three different cell lines, with technical triplicates per condition. Inter-replicate correlation (R 2 43 All output files were independently reviewed by a second analyst prior to archival. The review included confirmation of image continuity, signal completeness, preprocessing accuracy, and compliance with protocol identifiers. The review was blind to treatment conditions and was logged as part of the internal audit trail. Only datasets that passed dual-analyst verification were included in the consolidated documentation set. This procedural flow is synthesized in Figure 9 This layered validation model supports traceability and procedural consistency without relying on phenotypic stratification. It enables technical defensibility under regulatory scrutiny and is compatible with document-based frameworks such as CTD Module 5.3, SAP file sets, or quality management repositories [ 44 3. Results 3.1. Divergence Profiles and Cell Line-Specific Kinetics Across a cohort of eight tumor-derived adherent cell lines, real-time kinetic monitoring revealed reproducible divergence patterns in response to structurally active phospholipoproteomic platforms under standardized ex vivo conditions [ 45 Certain lines—such as BEWO and U87-MG—exhibited early and sustained divergence in proliferation relative to vehicle-only controls, with consistent log-phase expansion over the 48 h assay window. In these cases, kinetic separation typically emerged between 8 and 16 h and remained stable through the assay endpoint. Parallel IL-6 measurements showed elevated values, while IFN-γ/IL-10 ratios remained below 2 [ 46 Conversely, other cell lines (notably A375, LNCaP-C42, and PANC-1) showed declining proliferation rates, lower final confluence, and concurrent IFN-γ elevation beyond 300 pg/mL. These combinations exhibited consistent early trajectory suppression without increased cell death. Viability signal remained stable, supporting a non-cytotoxic suppression profile [ 47 Cell lines such as MCF-7 and HepG2 displayed minimal divergence from control trajectories and showed fluctuating but non-polarized cytokine profiles. These responses were interpreted as kinetically indifferent, with no statistically significant shift. Together, these patterns reinforce that the interaction between phospholipoproteomic platforms and tumor-derived lines is heterogeneous, reproducible, and measurable under neutral assay conditions [ 48 3.2. IFN-γ/IL-10 Ratio Behavior and Immune Orientation The ratio between IFN-γ and IL-10 concentrations in supernatant fluids was retained as an auxiliary metric to contextualize proliferative trends and explore immune orientation tendencies [ 49 50 In contrast, conditions associated with suppressed kinetic trajectories typically showed IFN-γ >300 pg/mL and IL-10 <40 pg/mL, generating ratios above 4.5. This high-ratio profile was consistently correlated with early plateauing in proliferation, without concurrent cytotoxicity. Viability signals remained within predefined stability thresholds. Intermediate ratio values (between 2 and 4) did not show consistent alignment with kinetic change and were recorded as biologically neutral [ 51 These observations suggest that the IFN-γ/IL-10 ratio, while not independently determinative, supports the identification of directional tendencies within a broader kinetic and structural response framework. 3.3. Metric Distribution and Batch-Level Reproducibility Quantitative descriptors extracted from the kinetic and secretomic profiles were used to evaluate metric dispersion across replicates and batches. Final Δ confluence values ranged broadly, with a bimodal clustering around high-positive and high-negative values, consistent with line-specific proliferation behavior under vesicle exposure [ 52 Across the dataset ( n 53 Figure 10 Conditions without clear divergence patterns (e.g., MCF-7, HepG2) exhibited greater dispersion and were more sensitive to baseline variability, confirming that the absence of response is not always indicative of higher precision. These findings support the reliability of kinetic parameters as tools for inter-batch comparison and technical documentation, particularly in early-phase screening or audit environments [ 54 3.4. Technical Output Structure and Representative Assay Reports Each vesicle–cell line interaction evaluated in the kinetic platform was compiled into a complete technical report designed for traceability and procedural transparency. This report includes all primary data, derived metrics, and contextual annotations necessary for internal quality control, audit, and reproducibility verification [ 55 Two representative cases—corresponding to vesicle batches FV-001 and FV-002—are summarized below. The reports included the following: Cell line identification and vesicle batch code; Full 48 h confluence trajectories (raw and smoothed); Onset time of observable divergence (e.g., 10.2 h and 12.4 h); Cumulative viability signal (non-lethal, <3% in both cases); Quantified cytokine ratios (e.g., IFN-γ/IL-10 = 2.1 and 5.9); Technical summary values (e.g., Δ confluence, AUC, signal range). Each record was reviewed by an independent analyst prior to validation. All datasets passed completeness checks and were indexed with version control metadata. To improve clarity, this technical record is described using simplified terminology: each vesicle–cell interaction is documented with batch ID, cell line, divergence onset, viability, and cytokine ratio. This standardized approach ensures accessibility across disciplines while maintaining reproducibility and audit readiness. These records are later compiled into technical dossiers to support export to institutional registries or internal documentation modules. No interpretive classification, score aggregation, or logic assignment was performed. The documentation is structured to support export to institutional registries or internal documentation modules, without invoking clinical inference or predictive modeling [ 56 57 A selection of these technical outputs is summarized in Table 2 To complement this summary, Table 3 Finally, Table 4 4. Discussion 4.1. Ex Vivo Functional Capture Versus CRO, eCRF, and LIMS Models To contextualize the methodological positioning of this protocol, we present a comparative framework contrasting classical pharmacodynamic clinical trials with ex vivo functional evaluation systems. The comparison is presented in a documentation-focused format [ 58 59 Table 5 This table serves as a conceptual contrast to highlight the operational relevance of real-time ex vivo models when classical regulatory pathways are not applicable. While contract research organizations (CROs), electronic case report forms (eCRFs), and laboratory information management systems (LIMS) play critical roles in therapeutic development, their scope is fundamentally linked to human subjects, pharmacological products, and molecular endpoints [ 60 In contrast, real-time ex vivo functional protocols operate without clinical deployment or systemic administration. They use kinetic readouts, viability signals, and cytokine profiling from cell-based models to produce structured documentation applicable in regulatory or institutional settings. These platforms are not extensions of CRO or eCRF systems but occupy a distinct methodological space in contexts where therapeutic validation is neither possible nor intended [ 61 4.2. Functional Documentation in Non-Trial Patient Populations A central advantage of kinetic ex vivo models lies in their utility for products that are intended for patient populations excluded from conventional clinical trials. Non-pharmacodynamic formulations—particularly those based on structural vesicular architectures—are often proposed for use in frail, multi-treated, or comorbid patients who cannot ethically or physiologically participate in randomized or interventional studies [ 62 The absence of clinical trial eligibility does not remove the need for rigorous documentation. In fact, it increases the demand for functional validation that is proportionate, reproducible, and technically credible. Ex vivo real-time monitoring fulfills this role without requiring therapeutic exposure, genetic profiling, or invasive sampling. By generating data from cell-based systems under neutral laboratory conditions, it enables documentation suitable for CTD Module 5.3, SAP-based quality archives, or institutional decision-making workflows [ 63 The STIP protocol is most applicable to structurally defined, non-pharmacodynamic platforms such as exosomes, liposomes, and inert vesicular adjuvants. By contrast, pharmacologically active molecules or receptor-targeted drugs fall outside the scope of STIP and remain dependent on conventional trial-based pathways. Furthermore, while the IFN-γ/IL-10 ratio is retained as a practical orientation marker, it does not encompass the full spectrum of immune regulatory mechanisms. Complementary mediators such as IL-6, TNF-α, TGF-β, IL-17, and chemokines could be incorporated in future extensions of STIP to provide a more comprehensive secretomic profile. This capability provides a documentary alternative for programs where therapeutic implementation is deferred or decoupled from immediate clinical utility. It facilitates the recording of compatibility, functional consistency, and biological safety without the need for patient enrollment or traditional clinical designs. These two regulatory pathways are illustrated in Figure 11 4.3. Why a Clinical Trial Does Not Apply: Technical Justification The frequent question—“Why hasn’t a clinical trial been conducted with these formulations?”—requires reframing. The more accurate inquiry is Does a clinical trial even apply to this type of product? For structurally active, non-pharmacodynamic formulations, the answer is often no [ 64 These formulations are composed of non-absorbable, biologically inert structural components: phospholipids, glycoproteins, and immunotolerant vesicular patterns. They do not activate molecular receptors, produce systemic concentration profiles, or exhibit dose–response behavior. As such, they lack measurable toxic thresholds, therapeutic endpoints, or biological half-lives in the traditional pharmacological sense. Imposing a clinical trial framework on these entities is not only unnecessary, it is methodologically invalid [ 65 Moreover, these formulations often fall outside the definition of new chemical entities (NCEs). Their composition is stable, non-novel, and characterized by a consistent proteic profile. Functional consistency between batches can be validated under controlled experimental conditions without the need for systemic exposure. This allows identity, integrity, and lot equivalence to be demonstrated through kinetic and secretomic profiles alone, without invoking human endpoints [ 66 The protocol described in this study is not intended to produce therapeutic claims. Instead, it provides immunobiologically consistent data, scaled to the product’s risk profile and structural nature. This form of evidence is suitable for integration into CTD Module 5.3, SAP registries, or institutional quality documentation—without requiring a therapeutic claim or efficacy trial [ 67 Figure 12 Rather than replacing clinical trials where they are genuinely required, this system provides a valid technical alternative in scenarios where human validation is structurally inapplicable. Its purpose is to provide reproducible, traceable, and regulatorily compatible evidence for decision-making where pharmacological intervention is not the goal [ 68 Table 6 Supplementary Figures S3–S5 4.4. Trustworthiness of Evidence in Non-Pharmacodynamic Systems In non-pharmacodynamic systems, regulatory focus shifts from mechanism of action to structural reproducibility and technical certainty. The question is not semantic, but evidentiary: can functional behavior be documented without invoking clinical trials? Table 7 4.5. Functional Equivalence and Regulatory Confidence in Non-Pharmacodynamic Models For structurally active formulations without pharmacodynamic effect, the core regulatory question is not whether they resemble classical drugs, but whether they generate evidence sufficient for technical decision-making. Clinical trials, while essential for therapeutic agents, are not universally applicable to non-absorptive, receptor-free, structurally inert systems [ 69 Such products—composed of phospholipids, glycoproteins, and other non-immunogenic components—act through structural or trophic mechanisms. Their validation must shift from efficacy to compatibility, emphasizing reproducible phenotypic behavior under controlled conditions. The goal is not to demonstrate clinical effect, but to produce traceable, regulatorily aligned documentation. The ex vivo protocol described herein fulfills this role by capturing growth dynamics, viability stability, and cytokine profiles across batches and cell models, without requiring systemic exposure, animal testing, or human participation [ 70 Table 8 Supplementary Figures S6–S9 This comparison does not minimize the value of clinical trials where appropriate. Instead, it affirms that structurally defined, non-pharmacodynamic platforms can achieve functional validation through proportionate, regulatorily accepted documentation strategies [ 71 4.6. Regulatory Integration: CTD, SAP, and Exemption Frameworks This system does not replicate the structure of clinical trials, but instead provides a proportionate, technically consistent alternative for documenting non-pharmacodynamic formulations. Its modular architecture, standardized outputs, and batch-level traceability support its application in multiple regulatory and institutional frameworks. This flexibility is particularly valuable in settings where systemic pharmacological validation is neither applicable nor required [ 72 Specifically, three documentation pathways have proven especially compatible with this platform: Common Technical Document (CTD—Module 5.3): The full technical dossier—including kinetic acquisition, viability data, and secretomic profiles—can be submitted under non-clinical evidence sections of CTD 5.3. The system supports reproducibility, standardization, and absence of toxicity indicators under controlled conditions, and is particularly suited for documentation pathways that allow deferred clinical activation without systemic exposure [ 73 For illustrative purposes, consider a hypothetical vesicular adjuvant intended for immune stabilization. Using STIP, the product would be documented through ΔC% curves, viability assurance, and IFN-γ/IL-10 ratios across sentinel lines. These technical records would be compiled into CTD Module 5.3, offering a proportionate evidentiary pathway to regulatory review without requiring Phase I–III trials. This example highlights STIP’s proportionality principle, whereby evidence is aligned with the structural nature of the product rather than imposed pharmacological frameworks. Structured Anticipatory Protocols (SAP): Within institutional quality control or early-stage decision frameworks, this protocol serves as a neutral validation layer for assessing phenotypic stability prior to clinical trial design or batch release. It enables proactive batch comparison, inter-cycle verification, and formulation screening without requiring therapeutic endpoints. Pre-IND Submissions and Regulatory Exemption Justification: The platform’s structured outputs provide a viable documentary basis for exemption from clinical trials in cases involving non-absorbable, structurally inert formulations. Its compatibility with low-risk product profiles makes it suitable for inclusion in pre-IND packages where no therapeutic claims are advanced and where evidence must be proportional to formulation type [ 74 Table 9 Beyond the formal alignment to CTD modules, the functional objectives typically fulfilled by pharmacodynamic clinical trials can also be met, proportionally, by structured ex vivo documentation. This equivalence is summarized in Table 10 The ability of ex vivo protocols to fulfill these objectives is not conceptual—it is procedural. When reproducibility, safety, batch consistency, and structural compatibility are documented through harmonized, non-interventional laboratory systems, the resulting evidence qualifies for inclusion in CTD Module 5.3 and parallel submission structures [ 75 Figure 13 4.7. Technical Reproducibility and Deployment Scalability The strength of this model lies in its capacity for reproducibility and operational scalability. Across more than 500 documented assay cycles, the platform demonstrated high intra-batch coherence, low inter-line deviation, and minimal operator dependency. Key outputs—including kinetic progression, signal continuity, and cytokine profiles—remained consistent across experimental runs and production series [ 76 The protocol can be implemented in laboratories equipped with basic kinetic imaging systems (e.g., IncuCyte ® 77 Moreover, its technical structure is future-ready. The data formats and metric logic can be integrated into algorithmic SAP modules or AI-enhanced pre-screening platforms, supporting automated batch decisions, release audits, and formulation optimization. Importantly, the process includes dual validation: real-time deviation alerts and independent analyst confirmation. This ensures longitudinal consistency and strengthens its utility as a permanent documentation unit [ 78 5. Conclusions 5.1. Functional Documentation in Reproducible Ex Vivo Systems The protocol described in this work provides a stable, reproducible, and regulatorily compatible method for documenting biological responses to non-pharmacodynamic formulations. Operating entirely under laboratory-controlled conditions, it integrates real-time kinetic tracking, viability monitoring, and cytokine profiling, producing structured technical records suitable for non-clinical documentation workflows. This evidence model does not require therapeutic endpoints or systemic exposure, making it particularly valuable in scenarios where conventional clinical trials are not applicable [ 79 Across more than 500 functional runs, the system demonstrated operational stability, traceability, and low inter-batch variation. These attributes position it as a viable platform for supporting technical decision-making, regulatory dossiers, and institutional quality frameworks where human trials are not feasible due to the product’s nature or population ineligibility. 5.2. Projection into Hybrid Models and Retrospective Use Although originally designed for ex vivo application, the structure of the protocol allows for prospective integration into broader data environments. Its modular format, version control, and contact-free nature make it suitable for documentation roles in hybrid frameworks that combine preclinical, retrospective, or real-world data (RWD) components. Potential use cases include post-authorization behavior analysis, inter-batch performance review, or support in expanded-access protocols [ 80 Its digital traceability and standardized outputs also make it amenable to future integration with algorithmic classifiers or machine learning environments. These functionalities could enable semi-automated screening and enhanced phenotypic categorization without reliance on therapeutic effect measurement. This positions the protocol as a tool adaptable to emerging data-driven regulatory contexts. 5.3. Versatility Across Development and Monitoring Phases One of the key strengths of the system is its dual applicability: both as a precursor validation mechanism and as a retrospective auditing instrument. In the early phases of development, it enables objective documentation of structural compatibility and biological neutrality before any regulatory or clinical decision is initiated. In post-release contexts, it supports comparative documentation by confirming batch equivalence and continuity without restarting experimental cycles [ 81 82 Despite its current implementation in manual laboratory settings, the protocol was designed with digital integration in mind. Its architecture supports the possibility of embedding within automated validation platforms, cloud-based archives, or SAP-aligned institutional workflows [ 83 84 85 In this way, the platform extends beyond a functional assay into the domain of institutional traceability and quality documentation, offering a scalable, interoperable, and technically defensible solution across multiple operational layers. 5.4. Adaptive Integration Framework for Phenotypic Documentation Although the functional protocol described in this work was developed under strictly ex vivo laboratory conditions, its output architecture and traceability logic are compatible with integration into decentralized observational frameworks. In particular, the metric and documentation structure may serve as a template for organizing phenotypic data collected through non-invasive patient observation, even in contexts where traditional clinical monitoring is inapplicable [ 86 This approach enables real-world documentation of biological behavior without requiring invasive sampling, randomization, or immunomolecular profiling. Instead, available clinical data—such as laboratory panels, inflammatory biomarkers, imaging reports, and performance scores—can be organized into structured records that mirror the traceability standard established in the experimental phase [ 87 Such documentation may prove useful in trial-ineligible populations, especially in supportive care or advanced-stage scenarios, where functional monitoring is needed without imposing a therapeutic hypothesis. The format can also complement real-world evidence (RWE) platforms, retrospective audits, or expanded-access reviews [ 88 Importantly, this extrapolation preserves the versioning, metadata integrity, and audit readiness of the experimental protocol. Its potential use in algorithmic documentation, automated validation, or real-time observational dashboards represents a scalable and ethically neutral extension of the underlying technical methodology [ 89 To conclude, it is not the format of validation that matters most, but the ability to deliver reliable, traceable, and proportionate evidence aligned with the nature of the product. While clinical trials remain essential for pharmacodynamic agents, structurally active, non-therapeutic formulations demand a distinct yet equally robust approach. The following summary highlights how both models—classical clinical trials and ex vivo documentation protocols—fulfill the same regulatory objectives using different, but convergent, technical strategies. 5.5. Ethical and Operational Context All procedures described in this manuscript were conducted using commercially sourced human cell lines under validated laboratory conditions. No human or animal subjects were involved, and no personal data were collected. As such, the protocol is exempt from ethical review and complies fully with institutional, regulatory, and editorial standards for non-interventional, non-clinical research. The system’s technical outputs have been submitted under CTD Module 5.3 and SAP documentation structures, where therapeutic validation and ethical committee approval are not applicable. 6. Limitations The STIP protocol is deliberately optimized for phenotypic documentation under non-clinical, ex vivo conditions. Its focus on kinetic behavior, viability, and secretomic consistency enables reproducible outputs suitable for early-stage validation and regulatory use. However, several scope-related limitations should be acknowledged: First, the system relies on 2D monolayer cultures, which, while highly reproducible, do not replicate the full complexity of three-dimensional tissue environments. Parameters such as oxygen gradients or multicellular microarchitectures are beyond its intended scope. Second, the current implementation excludes intracellular signaling and lineage tracking. These endpoints, though relevant in mechanistic studies, exceed the functional traceability purpose of the protocol. The modular structure allows for future expansions without altering its current regulatory alignment. Third, STIP does not simulate systemic immunological networks or multicellular interactions. It functions as a controlled, cell-autonomous system focused on interaction documentation—prioritizing traceability over predictive extrapolation. Finally, as with any biological assay, variability may arise from cell line behavior or heterogeneity in vesicle preparation. These are mitigated through technical replicates, inter-batch controls, and harmonized processing steps. It should also be noted that normalization to T 0 Overall, these limitations are intrinsic to the system’s defined scope. They do not compromise its scientific validity or regulatory applicability as a scalable, traceable, and non-interventional documentation tool. In particular, neutral conditions observed in lines such as MCF-7 and HepG2 highlight the importance of increasing replicates or integrating orthogonal readouts (e.g., cell-cycle or metabolic profiling) in future studies to refine interpretation and distinguish subtle biological trends from baseline variability. These refinements will enhance the robustness of STIP without altering its regulatory alignment as a non-clinical documentation platform. The glossary of acronyms used in this manuscript is included in the Supplementary Materials Acknowledgments The authors would like to thank the technical team integrated within the Oncovix research program for their support in standardized cell culture maintenance, continuous imaging acquisition, and cytokine assay processing. Special thanks to the Oncovix research unit for providing the infrastructure required for vesicle preparation and cell-based ex vivo assays. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/biomedicines13092101/s1 Author Contributions Conceptualization, R.G.-S.; methodology, R.G.-S. and F.G.-C.; validation, F.G.-C., N.M.-G. and F.K.; formal analysis, R.G.-S.; investigation, R.G.-S., F.G.-C., N.M.-G., I.R., A.L., I.M. and J.I.; data curation, N.M.-G., F.K. and J.I.; writing—original draft preparation, R.G.-S.; writing—review and editing, R.G.-S., F.G.-C., C.P.-V. and M.V.; visualization, J.I., F.K., C.P.-V. and A.T.; supervision, R.G.-S.; project administration, R.G.-S.; funding acquisition, R.G.-S. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. This study did not involve experiments on human subjects or animals requiring ethical approval. Informed Consent Statement Not applicable. No identifiable human data or tissue samples were used in this study. Data Availability Statement Raw kinetic data, molecular profiles, and classification parameters are available from the corresponding author upon reasonable request. Access to these data may be subject to confidentiality agreements or material transfer conditions related to ongoing regulatory submissions. The full dataset is part of an active corporate editorial pipeline and is managed in accordance with contextual integrity and planned licensing frameworks. Conflicts of Interest This research was conducted by authors affiliated with OGRD Alliance (R.G.-S., C.P.-V., A.T.), Flowinmunocell-Bioexocell Group (F.G.-C., N.M.-G.), and Bioclas (F.K.). The remaining authors declare that the study was carried out in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Abbreviations AE Adverse Event AUC Area Under the Curve API Application Programming Interface BEWO Human Placental Choriocarcinoma Cell Line CBA Cytometric Bead Array CTD Common Technical Document CV% Coefficient of Variation (Percentage) DMEM Dulbecco’s Modified Eagle Medium DLS Dynamic Light Scattering ECOG Eastern Cooperative Oncology Group FSI Functional Stratification Index FTIR Fourier-Transform Infrared Spectroscopy IFN-γ Interferon Gamma IL-6 Interleukin-6 IL-10 Interleukin-10 KPS Karnofsky Performance Status LAL Limulus Amebocyte Lysate LIMS Laboratory Information Management System LDH Lactate Dehydrogenase MCF-7 Human Breast Adenocarcinoma Cell Line MTD Maximum Tolerated Dose NCE New Chemical Entity PET-CT Positron Emission Tomography–Computed Tomography PK/PD Pharmacokinetics/Pharmacodynamics RSD Relative Standard Deviation RWE Real-World Evidence SAP Structured Anticipatory Protocol/Precursor Analysis System STIP Structured Traceability and Immunophenotypic Platform T 0 Initial Time Point ΔC Delta Confluence ΔT Time of Divergence References 1. Ponomareva N. Brezgin S. Karandashov I. Kostyusheva A. Demina P. Slatinskaya O. Bayurova E. Silachev D. Pokrovsky V.S. Gegechkori V. Swelling, Rupture and Endosomal Escape of Biological Nanoparticles Per Se and Those Fused with Liposomes in Acidic Environment Pharmaceutics 2024 16 667 10.3390/pharmaceutics16050667 38794330 PMC11126099 2. Meng W. He C. Hao Y. Wang L. Li L. Zhu G. Prospects and challenges of extracellular vesicle-based drug delivery system: Considering cell source Drug Deliv. 2020 27 585 598 10.1080/10717544.2020.1748758 32264719 PMC7178886 3. Szeliski K. Drewa T. Pokrywczyńska M. Small extracellular vesicles as a multicomponent biomarker platform in urinary tract carcinomas Front. Mol. Biosci. 2022 9 916666 10.3389/fmolb.2022.916666 36237572 PMC9551577 4. Zhukovsky S. White J. Chakraborty R. Costa L.J. Van Oekelen O. Sborov D.W. Cliff E.R.S. Mohyuddin G.R. Multiple myeloma clinical trials exclude patients with the highest-risk disease: A systematic review of trial exclusion criteria Leuk. Lymphoma 2024 65 2163 2172 10.1080/10428194.2024.2395440 39314111 5. Wissel M. Poirier M. Satterwhite C. Lin J. Islam R. Zimmer J. Khadang A. Zemo J. Lester T. Fjording M. Recommendations on qPCR/ddPCR assay validation by GCC Bioanalysis 2022 14 853 863 10.4155/bio-2022-0109 35703321 6. Yin Y. Yan F. Zhou R. Li M. Ma J. Liu Z. Ma Z. Single-domain antibody screening by isPLA-seq Life Sci. Alliance 2021 5 e202101115 10.26508/lsa.202101115 34675071 PMC8548206 7. Mesaki K. Yamamoto H. Juvet S. Yeung J. Guan Z. Akhter A. Yao Y. Dickie C. Mangat H. Wang A. CRISPR-Cas Genome Editing in Ex Vivo Human Lungs to Rewire the Translational Path of Genome-Targeting Therapeutics Hum. Gene Ther. 2024 35 374 387 10.1089/hum.2023.223 38717950 PMC11386987 8. Ward R.Y. Stevens M. Bashir S. Metrological traceability in flow cytometry? Evaluation of a new volumetric method for lymphocyte subsets Int. J. Lab. Hematol. 2024 46 488 494 10.1111/ijlh.14219 38114449 9. Jain N. Zhao Z. Feucht J. Koche R. Iyer A. Dobrin A. Mansilla-Soto J. Yang J. Zhan Y. Lopez M. TET2 guards against unchecked BATF3-induced CAR T cell expansion Nature 2023 615 315 322 10.1038/s41586-022-05692-z 36755094 PMC10511001 10. Mannion J. Gifford V. Bellenie B. Fernando W. Ramos Garcia L. Wilson R. John S.W. Udainiya S. Patin E.C. Tiu C. A RIPK1-specific PROTAC degrader achieves potent antitumor activity by enhancing immunogenic cell death Immunity 2024 57 1514 1532.e15 10.1016/j.immuni.2024.04.025 38788712 PMC11236506 11. Li Y. Umbach D.M. Krahn J.M. Shats I. Li X. Li L. Predicting tumor response to drugs based on gene-expression biomarkers of sensitivity learned from cancer cell lines BMC Genom. 2021 22 272 10.1186/s12864-021-07581-7 PMC8048084 33858332 12. Bai S. Lin Y. Wang X. Zhang X. Yoshida T. Yue X. A high security coding and anti-counterfeiting method based on the nonlinear magnetization response of superparamagnetic nanomaterials Sci. Rep. 2024 14 15360 10.1038/s41598-024-65450-1 38965281 PMC11224384 13. Bohannan Z. Pudupakam R.S. Koo J. Horwitz H. Tsang J. Polley A. Han E.J. Fernandez E. Park S. Swartzfager D. Predicting likelihood of in vivo chemotherapy response in canine lymphoma using ex vivo drug sensitivity and immunophenotyping data in a machine learning model Vet. Comp. Oncol. 2021 19 160 171 10.1111/vco.12656 33025640 PMC7894155 14. Wang J. Gleeson P.A. Fourriere L. Long-term live cell imaging during differentiation of human iPSC-derived neurons STAR Protoc. 2023 4 102699 10.1016/j.xpro.2023.102699 37938977 PMC10665918 15. Surani A.A. Colombo S.L. Barlow G. Foulds G.A. Montiel-Duarte C. Optimizing Cell Synchronization Using Nocodazole or Double Thymidine Block Methods Mol. Biol. 2021 2329 111 121 34085219 10.1007/978-1-0716-1538-6_9 16. Laforêts F. Kotantaki P. Malacrida B. Elorbany S. Manchanda R. Donnadieu E. Balkwill F. Semi-supervised analysis of myeloid and T cell behavior in ex vivo ovarian tumor slices reveals changes in cell motility after treatments iScience 2023 26 106514 10.1016/j.isci.2023.106514 37091227 PMC10119804 17. Brandenberg N. Hoehnel S. Kuttler F. Homicsko K. Ceroni C. Ringel T. Gjorevski N. Schwank G. Coukos G. Turcatti G. High-throughput automated organoid culture via stem-cell aggregation in microcavity arrays Nat. Biomed. Eng. 2020 4 863 874 10.1038/s41551-020-0565-2 32514094 18. Zhong J. Yang D. Zhou Y. Liang M. Ai Y. Multi-frequency single cell electrical impedance measurement for label-free cell viability analysis Analyst 2021 146 1848 1858 10.1039/D0AN02476G 33619511 19. Persenaire C. Babbs B. Yamamoto T.M. Nebbia M. Jordan K.R. Adams S. Lambert J.R. Bitler B.G. VDX-111, a novel small molecule, induces necroptosis to inhibit ovarian cancer progression Mol. Carcinog. 2024 63 1248 1259 10.1002/mc.23721 38558423 20. Little A.C. Kovalenko I. Goo L.E. Hong H.S. Kerk S.A. Yates J.A. Purohit V. Lombard D.B. Merajver S.D. Lyssiotis C.A. High-content fluorescence imaging with the metabolic flux assay reveals insights into mitochondrial properties and functions Commun. Biol. 2020 3 271 10.1038/s42003-020-0988-z 32472013 PMC7260371 21. Geissler M. Ponton A. Nassif C. Malic L. Turcotte K. Lukic L. Morton K.J. Veres T. Use of Polymer Micropillar Arrays as Templates for Solid-Phase Immunoassays ACS Appl. Polym. Mater. 2022 4 5287 5297 10.1021/acsapm.2c00163 37552739 22. Hasanvand A. COVID-19 and the role of cytokines in this disease Inflammopharmacology 2022 30 789 798 10.1007/s10787-022-00992-2 35505267 PMC9064717 23. Cedillo-Alcantar D.F. Rodriguez-Moncayo R. Maravillas-Montero J.L. Garcia-Cordero J.L. On-Chip Analysis of Protein Secretion from Single Cells Using Microbead Biosensors ACS Sens. 2023 8 655 664 10.1021/acssensors.2c02148 36710459 24. Furuya H. Sakatani T. Tanaka S. Murakami K. Waldron R.T. Hogrefe W. Rosser C.J. Bladder cancer risk stratification with the Oncuria 10-plex bead-based urinalysis assay using three different Luminex xMAP instrumentation platforms J. Transl. Med. 2024 22 8 10.1186/s12967-023-04811-2 38167321 PMC10763405 25. Fagninou A. Nekoua M.P. Sossou D. Moutairou K. Fievet N. Yessoufou A. Th2-Immune Polarizing and Anti-Inflammatory Properties of Insulin Are Not Effective in Type 2 Diabetic Pregnancy J. Immunol. Res. 2020 2020 2038746 10.1155/2020/2038746 32626786 PMC7312550 26. Mohammed A.I. Sangha S. Nguyen H. Shin D.H. Pan M. Park H. McCullough M.J. Celentano A. Cirillo N. Assessment of Oxidative Stress Induced Oral Epithelial Toxicity Biomolecules 2023 13 1239 10.3390/biom13081239 37627304 PMC10452318 27. Mbiki S. McClendon J. Alexander-Bryant A. Gilmore J. Classifying changes in LN-18 glial cell morphology: A supervised machine learning approach to analyzing cell microscopy data via FIJI and WEKA Med. Biol. Eng. Comput. 2020 58 1419 1430 10.1007/s11517-020-02177-x 32314170 28. Ülgen M. Can Eylem C. Doğan A. Akduman N.E.B. Green Alternatives in Pharmaceutical and Bioanalytical Analysis of TDM Required Drugs: Procainamide Comb. Chem. High Throughput Screen. 2023 26 2656 2667 10.2174/1386207326666230331083215 36999693 29. Hollandi R. Moshkov N. Paavolainen L. Tasnadi E. Piccinini F. Horvath P. Nucleus segmentation: Towards automated solutions Trends Cell Biol. 2022 32 295 310 10.1016/j.tcb.2021.12.004 35067424 30. Ji X. Fisher A.A. Su S. Thorne J.L. Potter B. Lemey P. Baele G. Suchard M.A. Scalable Bayesian divergence time estimation with ratio transformations Syst. Biol. 2023 72 1136 1153 10.1093/sysbio/syad039 37458991 PMC10636426 31. Ganapathy K. Lam C. Tsukuda J. Sargon A. Nava A. Harms P. Shen A. Barnard G. Misaghi S. SPEED-MODE cell line development (CLD): Reducing Chinese hamster ovary (CHO) CLD timelines via earlier suspension adaptation and maximizing time spent in the exponential growth phase Biotechnol. Prog. 2024 40 e3479 10.1002/btpr.3479 38716635 32. Persson S. Berndt C. Engstrand S. Trinczek A. Carlsson K.S. Berntorp E. Area under the curve: Comparing the value of factor VIII replacement therapies in haemophilia A Haemophilia 2023 29 145 155 10.1111/hae.14691 36445343 PMC10098947 33. Lawlor K.E. Murphy J.M. Vince J.E. Gasdermin and MLKL necrotic cell death effectors: Signaling and diseases Immunity 2024 57 429 445 10.1016/j.immuni.2024.02.011 38479360 34. Yang H. Song L. Sun B. Chu D. Yang L. Li M. Li H. Dai Y. Yu Z. Guo J. Modulation of macrophages by a paeoniflorin-loaded hyaluronic acid-based hydrogel promotes diabetic wound healing Mater. Today Bio 2021 12 100139 10.1016/j.mtbio.2021.100139 PMC8488309 34632363 35. Niu Y. Ferreira Azevedo C.A. Li X. Kamali E. Haagen Nielsen O. Storgaard Sørensen C. Frödin M. Multiparametric and accurate functional analysis of genetic sequence variants using CRISPR-Select Nat. Genet. 2022 54 1983 1993 10.1038/s41588-022-01224-7 36471068 PMC9729100 36. Groeneweg S. van Geest F.S. Abacı A. Alcantud A. Ambegaonkar G.P. Armour C.M. Bakhtiani P. Barca D. Bertini E.S. van Beynum I.M. Disease characteristics of MCT8 deficiency: An international, retrospective, multicentre cohort study Lancet Diabetes Endocrinol. 2020 8 594 605 10.1016/S2213-8587(20)30153-4 32559475 PMC7611932 37. Watanabe K. Wilmanski T. Diener C. Earls J.C. Zimmer A. Lincoln B. Hadlock J.J. Lovejoy J.C. Gibbons S.M. Magis A.T. Multiomic signatures of body mass index identify heterogeneous health phenotypes and responses to a lifestyle intervention Nat. Med. 2023 29 996 1008 10.1038/s41591-023-02248-0 36941332 PMC10115644 38. Zhao J. Wang L. Zhou A. Wen S. Fang W. Zhang L. Duan J. Bai H. Zhong J. Wan R. Decision model for durable clinical benefit from front- or late-line immunotherapy alone or with chemotherapy in non-small cell lung cancer Med 2024 5 981 997.e4 10.1016/j.medj.2024.04.011 38781965 39. Ye Y. Yang W. Ruan X. Xu L. Cheng W. Zhao M. Wang X. Chen X. Cai D. Li G. Metabolism-associated molecular classification of gastric adenocarcinoma Front. Oncol. 2022 12 1024985 10.3389/fonc.2022.1024985 36465405 PMC9709214 40. Robinson J.P. Flow cytometry: Past and future Biotechniques 2022 72 159 169 10.2144/btn-2022-0005 35369735 41. Eastern Research Group, Inc. Sertkaya A. Berger C. Drug Development Office of the Assistant Secretary for Planning and Evaluation (ASPE) Washington, DC, USA 2024 39928738 42. Lin W. Fang J. Wei S. He G. Liu J. Li X. Peng X. Li D. Yang S. Li X. Extracellular vesicle-cell adhesion molecules in tumours: Biofunctions and clinical applications Cell Commun. Signal. 2023 21 246 10.1186/s12964-023-01236-8 37735659 PMC10512615 43. Plebanek M.P. Xue Y. Nguyen Y.V. DeVito N.C. Wang X. Holtzhausen A. Beasley G.M. Theivanthiran B. Hanks B.A. A lactate-SREBP2 signaling axis drives tolerogenic dendritic cell maturation and promotes cancer progression Sci. Immunol. 2024 9 eadi4191 10.1126/sciimmunol.adi4191 38728412 PMC11926670 44. Mahajan U.M. Oehrle B. Sirtl S. Alnatsha A. Goni E. Regel I. Beyer G. Vornhülz M. Vielhauer J. Chromik A. Independent Validation and Assay Standardization of Improved Metabolic Biomarker Signature to Differentiate Pancreatic Ductal Adenocarcinoma from Chronic Pancreatitis Gastroenterology 2022 163 1407 1422 10.1053/j.gastro.2022.07.047 35870514 45. Farin H.F. Mosa M.H. Ndreshkjana B. Grebbin B.M. Ritter B. Menche C. Kennel K.B. Ziegler P.K. Szabó L. Bollrath J. Colorectal Cancer Organoid-Stroma Biobank Allows Subtype-Specific Assessment of Individualized Therapy Responses Cancer Discov. 2023 13 2192 2211 10.1158/2159-8290.CD-23-0050 37489084 PMC10551667 46. Gallo P.M. Kim J. McNerney K.O. Diorio C. Foley C. Kagami L. Wagner K. Petrosa W.L. Conlon H. Gollomp K.L. Serum cytokine panels in pediatric clinical practice J. Allergy Clin. Immunol. 2025 155 594 604.e5 10.1016/j.jaci.2024.08.030 39303891 47. Caller T. Rotem I. Shaihov-Teper O. Lendengolts D. Schary Y. Shai R. Glick-Saar E. Dominissini D. Motiei M. Katzir I. Small Extracellular Vesicles from Infarcted and Failing Heart Accelerate Tumor Growth Circulation 2024 149 1729 1748 10.1161/CIRCULATIONAHA.123.066911 38487879 PMC11220912 48. Ghoshal B. Patkulkar P.A. Bhatt P. Rana S. Sinharay S. Jhunjhunwala S. Neutrophil-Derived Extracellular Vesicles for Facile Delivery of Diagnostic Agents to Tumor Microenvironments ACS Appl. Bio Mater. 2025 8 4132 4139 10.1021/acsabm.5c00266 40276969 49. Istanbullugil F.R. Risvanli A. Salikov R. Bayraktar M. Kadiraliyeva N. Zhunushova A. Yilmaz O. Yuksel B.F. Turanli M. Uz M. The relationship between Th1/Th2 cytokine polarization and milk composition in the postnatal period in Kyrgyz mares and foals Reprod. Domest. Anim. 2023 58 762 768 10.1111/rda.14347 36934392 50. Liao Z. Liu Y. Wei H. He X. Wang Z. Zhuang Z. Zhao W. Masagounder K. He J. Niu J. Effects of dietary supplementation of Bacillus subtilis Oreochromis niloticus Anim. Nutr. 2023 15 375 385 10.1016/j.aninu.2023.05.016 38058567 PMC10695836 51. Chen X. Gao A. Zhang F. Yang Z. Wang S. Fang Y. Li J. Wang J. Shi W. Wang L. ILT4 inhibition prevents TAM- and dysfunctional T cell-mediated immunosuppression and enhances the efficacy of anti-PD-L1 therapy in NSCLC with EGFR activation Theranostics 2021 11 3392 3416 10.7150/thno.52435 33537094 PMC7847666 52. Chen H. Deng C. Gao J. Wang J. Fu F. Wang Y. Wang Q. Zhang M. Zhang S. Fan F. Integrative spatial analysis reveals tumor heterogeneity and immune colony niche related to clinical outcomes in small cell lung cancer Cancer Cell 2025 43 519 536.e5 10.1016/j.ccell.2025.01.012 39983726 53. Nguyen V.V.T. Witwer K.W. Verhaar M.C. Strunk D. van Balkom B.W.M. Functional assays to assess the therapeutic potential of extracellular vesicles J. Extracell. Vesicles 2020 10 e12033 10.1002/jev2.12033 33708360 PMC7890556 54. Walton M.K. Cappelleri J.C. Byrom B. Goldsack J.C. Eremenco S. Harris D. Potero E. Patel N. Flood E. Daumer M. Considerations for development of an evidence dossier to support the use of mobile sensor technology for clinical outcome assessments in clinical trials Contemp. Clin. Trials 2020 91 105962 10.1016/j.cct.2020.105962 32087341 55. Garber E.A.E. Cho C.Y. Rallabhandi P. Nowatzke W.L. Oliver K.G. Venkateswaran K.V. Venkateswaran N. Multi-laboratory validation of the xMAP-Food Allergen Detection Assay: A multiplex, antibody-based assay for the simultaneous detection of food allergens PLoS ONE 2020 15 e0234899 10.1371/journal.pone.0234899 32645020 PMC7347184 56. Maas A.I. Menon D.K. Manley G.T. Abrams M. Åkerlund C. Andelic N. Aries M. Bashford T. Bell M.J. Bodien Y.G. Traumatic brain injury: Progress and challenges in prevention, clinical care, and research Lancet Neurol. 2022 21 1004 1060 10.1016/S1474-4422(22)00309-X 36183712 PMC10427240 57. Gutiérrez-Sandoval R. Gutiérrez-Castro F. Muñoz-Godoy N. Rivadeneira I. Sobarzo A. Iturra J. Muñoz I. Peña-Vargas C. Vidal M. Krakowiak F. Real-Time Functional Stratification of Tumor Cell Lines Using a Non-Cytotoxic Phospholipoproteomic Platform: A Label-Free Ex Vivo Model Biology 2025 14 953 10.3390/biology14080953 40906111 PMC12383301 58. Malley R. Lu Y.J. Sebastian S. Zhang F. Willer D.O. Multiple antigen presenting system (MAPS): State of the art and potential applications Expert Rev. Vaccines 2024 23 196 204 10.1080/14760584.2023.2299384 38174559 59. Komar Z.M. Verkaik N.S. Dahmani A. Montaudon E. Kanaar R. Houtsmuller A.B. Jager A. Marangoni E. van Gent D.C. Development and validation of a functional ex vivo paclitaxel and eribulin sensitivity assay for breast cancer, the REMIT assay NPJ Breast Cancer 2025 11 17 10.1038/s41523-025-00734-x 39962055 PMC11832732 60. Lin B. Watson K. Luciferase reporter assay for NF-kB activation automated by an open-source liquid handling platform SLAS Technol. 2024 29 100155 10.1016/j.slast.2024.100155 39284642 61. Heubeck A. Savage A. Henderson K. Roll C. Hernandez V. Torgerson T. Bumol T. Reading J. Cross-platform immunophenotyping of human peripheral blood mononuclear cells with four high-dimensional flow cytometry panels Cytom. A 2023 103 500 517 10.1002/cyto.a.24715 36571245 62. Rodríguez-Fuentes D.E. Fernández-Garza L.E. Samia-Meza J.A. Barrera-Barrera S.A. Caplan A.I. Barrera-Saldaña H.A. Mesenchymal Stem Cells Current Clinical Applications: A Systematic Review Arch. Med. Res. 2021 52 93 101 10.1016/j.arcmed.2020.08.006 32977984 63. Campbell P. Rutten F.H. Lee M.M. Hawkins N.M. Petrie M.C. Heart failure with preserved ejection fraction: Everything the clinician needs to know Lancet 2024 403 1083 1092 10.1016/S0140-6736(23)02756-3 38367642 64. Douin D.J. Siegel L. Grandits G. Phillips A. Aggarwal N.R. Baker J. Brown S.M. Chang C.C. Goodman A.L. Grund B. Evaluating Primary Endpoints for COVID-19 Therapeutic Trials to Assess Recovery Am. J. Respir. Crit. Care Med. 2022 206 730 739 10.1164/rccm.202112-2836OC 35580040 PMC9799123 65. Karikó K. Developing mRNA for Therapy Keio J. Med. 2022 71 31 10.2302/kjm.71-001-ABST 35342149 66. Freitas J. Silva P. Perestrelo R. Vaz-Pires P. Câmara J.S. Improved approach based on MALDI-TOF MS for establishment of the fish mucus protein pattern for geographic discrimination of Sparus aurata Food Chem. 2022 372 131237 10.1016/j.foodchem.2021.131237 34627094 67. Koti M. Bivalacqua T. Black P.C. Cathomen T. Galsky M.D. Gulley J.L. Ingersoll M.A. Kamat A.M. Kassouf W. Siemens D.R. Adaptive Immunity in Genitourinary Cancers Eur. Urol. Oncol. 2023 6 263 272 10.1016/j.euo.2023.03.002 37069029 68. Zaragoza-Salcedo A. Oroviogoicoechea C. Saracíbar-Razquin M.I. Osácar E. The significance of exploring conceptual equivalence within the process of the cross-cultural adaptation of tools: The case of the Patient’s Perception of Feeling Known by their Nurses Scale J. Nurs. Scholarsh. 2023 55 1268 1279 10.1111/jnu.12910 37212367 69. Stefanos R. Graziella D. Giovanni T. Methodological aspects of superiority, equivalence, and non-inferiority trials Intern. Emerg. Med. 2020 15 1085 1091 10.1007/s11739-020-02450-9 32705494 70. Larsson A.T. Bhatia H. Calizo A. Pollard K. Zhang X. Conniff E. Tibbitts J.F. Rono E. Cummins K. Osum S.H. Ex vivo to in vivo model of malignant peripheral nerve sheath tumors for precision oncology Neuro Oncol. 2023 25 2044 2057 10.1093/neuonc/noad097 37246765 PMC10628938 71. Liang Z. Hu H. Li J. Yao D. Wang Y. Ung C.O.L. Advancing the Regulation of Traditional and Complementary Medicine Products: A Comparison of Five Regulatory Systems on Traditional Medicines with a Long History of Use Evid. Based Complement. Alternat. Med. 2021 2021 5833945 10.1155/2021/5833945 34745290 PMC8566035 72. Woodhouse R. Li M. Hughes J. Delfosse D. Skoletsky J. Ma P. Meng W. Dewal N. Milbury C. Clark T. Clinical and analytical validation of FoundationOne Liquid CDx, a novel 324-Gene cfDNA-based comprehensive genomic profiling assay for cancers of solid tumor origin PLoS ONE 2020 15 e0237802 10.1371/journal.pone.0237802 32976510 PMC7518588 73. Manchikanti L. Centeno C.J. Atluri S. Albers S.L. Shapiro S. Malanga G.A. Abd-Elsayed A. Jerome M. Hirsch J.A. Kaye A.D. Bone Marrow Concentrate (BMC) Therapy in Musculoskeletal Disorders: Evidence-Based Policy Position Statement of American Society of Interventional Pain Physicians (ASIPP) Pain Physician 2020 23 E85 E131 10.36076/ppj.2020/23/e85 32214287 74. Lau C. Jamali F. Loebenberg R. Health Canada Usage of Real World Evidence (RWE) in Regulatory Decision Making compared with FDA/EMA usage based on publicly available information J. Pharm. Pharm. Sci. 2022 25 227 236 10.18433/jpps32715 35760071 75. Treherne J.M. Miller A.F. Novel hydrogels: Are they poised to transform 3D cell-based assay systems in early drug discovery? Expert Opin. Drug Discov. 2023 18 335 346 10.1080/17460441.2023.2175813 36722285 76. Fernstad J. Svennberg E. Åberg P. Kemp Gudmundsdottir K. Jansson A. Engdahl J. External validation of a machine learning-based classification algorithm for ambulatory heart rhythm diagnostics in pericardioversion atrial fibrillation patients using smartphone photoplethysmography: The SMARTBEATS-ALGO study Europace 2025 27 euaf031 10.1093/europace/euaf031 39960451 PMC11965787 77. Mohammad A. Yurina A. Simonyan T. Chistyakov D. Salman R. Zornikova K. Minina E. Bogolyubova A. Modular (universal) CAR-T platforms in vivo: A comprehensive systematic review Front. Immunol. 2024 15 1409665 10.3389/fimmu.2024.1409665 39712013 PMC11659234 78. Sinha S. Agarwal M. Bhadani P.P. Roy R. Sinha U. Development and validation of sonological classification and scoring system for uterine adenomyosis: A pilot study F1000Research 2023 11 1138 10.12688/f1000research.125700.2 37867625 PMC10587656 79. Swingle K.L. Hamilton A.G. Mitchell M.J. Flow cytometric analysis of the murine placenta to evaluate nanoparticle platforms during pregnancy Placenta 2024 66 132 138 10.1016/j.placenta.2024.08.007 PMC11822046 39181830 80. Symeonides C. Aromataris E. Mulders Y. Dizon J. Stern C. Barker T.H. Whitehorn A. Pollock D. Marin T. Dunlop S. An Umbrella Review of Meta-Analyses Evaluating Associations between Human Health and Exposure to Major Classes of Plastic-Associated Chemicals Ann. Glob. Health 2024 90 52 10.5334/aogh.4459 39183960 PMC11342836 81. Baldzhieva A. Burnusuzov H. Andreeva H. Kalfova T. Petrov S. Dudova D. Vaseva K. Murdjeva M. Taskov H. Advancing measurable residual disease detection in pediatric BCP-ALL: Insights from novel immunophenotypic markers Int. J. Mol. Sci. 2025 26 4282 10.3390/ijms26094282 40362518 PMC12072110 82. Guilbert M. Courtade E. Thommen Q. Cellular environment and phenotypic heterogeneity: How data-driven modeling finds the smoking gun Int. J. Mol. Sci. 2022 23 6536 10.3390/ijms23126536 35742979 PMC9223694 83. Srinivasan A. Sathiyanathan P. Yin L. Liu T.M. Lam A. Ravikumar M. Smith R.A.A. Loh H.P. Zhang Y. Ling L. Strategies to Enhance Immunomodulatory Properties and Reduce Heterogeneity in Mesenchymal Stromal Cells during ex vivo Expansion Cytotherapy 2022 24 456 472 10.1016/j.jcyt.2021.11.009 35227601 84. Patelli N. Mandrioli M. Blockchain technology and traceability in the agrifood industry J. Food Sci. 2020 85 3670 3678 10.1111/1750-3841.15477 33000471 85. Pourhassan N.Z. Smits S.H.J. Ahn J.H. Schmitt L. Biotechnological applications of type 1 secretion systems Biotechnol. Adv. 2021 53 107864 10.1016/j.biotechadv.2021.107864 34767962 86. Graili P. Guertin J.R. Chan K.K.W. Tadrous M. Integration of real-world evidence from different data sources in health technology assessment J. Pharm. Pharm. Sci. 2023 26 11460 10.3389/jpps.2023.11460 37529633 PMC10387532 87. Salem M. Elkaseer A. El-Maddah I.A.M. Youssef K.Y. Scholz S.G. Mohamed H.K. Non-Invasive Data Acquisition and IoT Solution for Human Vital Signs Monitoring: Applications, Limitations and Future Prospects Sensors 2022 22 6625 10.3390/s22176625 36081081 PMC9460364 88. Daly B. Brawley O.W. Gospodarowicz M.K. Olopade O.I. Fashoyin-Aje L. Smart V.W. Chang I.F. Tendler C.L. Kim G. Fuchs C.S. Remote monitoring and data collection for decentralized clinical trials JAMA Netw. Open 2024 7 e246228 10.1001/jamanetworkopen.2024.6228 38607626 PMC11015350 89. Childers C. Marron J. Meyer E.C. Abel G.A. Clinical ethics consultation documentation in the era of open notes BMC Med. Ethics 2023 24 27 10.1186/s12910-023-00904-1 37138339 PMC10158359 Figure 1 This exclusion logic flowchart demonstrates why the evaluated bioendogenous platform does not qualify for Phase 1–3 clinical trials. The decision points highlight that this vesicle-based system (1) is not systemically absorbed; (2) lacks a pharmacodynamic or receptor-bound target; and (3) presents no inherent toxicity requiring human safety testing (cross-mark symbols indicate a negative outcome at each step). Figure 2 Scope and technical layers of the STIP platform. The STIP system integrates phenotypic readouts, cytokine analysis, and kinetic profiling into a logic-based classification model, generating non-clinical technical dossiers compatible with regulatory frameworks such as CTD Module 5.3 and SAP. This visual summarizes the platform’s three operational layers—functional, analytical, and regulatory—and illustrates STIP’s role as a non-pharmacodynamic documentation system. Figure 3 Schematic workflow of the kinetic acquisition protocol. Visual outline of the procedural steps involved in the 48 h ex vivo assay. Sentinel cell lines are seeded in imaging-compatible plates and exposed to vesicular materials prepared under defined biophysical parameters. Real-time monitoring is conducted under constant conditions using an automated imaging platform, producing sequential confluence and morphology data. The focus of the workflow is on optical quality, procedural repeatability, and cross-line consistency. No classification or biological interpretation is applied at this stage. Figure 4 Fluorescence-based viability monitoring under ex vivo imaging conditions. The diagram illustrates the detection of membrane-compromised cells using a non-invasive fluorescent probe. The left panel shows a culture well containing cells exposed to phospholipoproteomic platforms, one of which exhibits localized green fluorescence. The right panel depicts a computer screen visualizing the corresponding fluorescence heatmap, used to confirm signal stability and culture integrity throughout the assay. Green signals indicate fluorescence from membrane-compromised cells, whereas non-fluorescent cells remain intact. This integration supports viability assessment without disrupting the kinetic observation workflow. Figure 5 Normalization and smoothing of kinetic confluence data. Illustration of the two-step preprocessing workflow applied to kinetic imaging datasets. Raw curves are normalized to the initial baseline (T 0 Figure 6 Final confluence shift (ΔC%) as a quantitative metric derived from time-lapse curves. Illustrative example of confluence evolution over 48 h in treated versus control conditions. Figure 7 Batch-level multimetric registry for vesicle–cell assays. Table and dot-plot example illustrating the structure of multivariable documentation used to support inter-batch reproducibility and technical consistency. Metrics such as ΔC%, AUC, log-phase slope, cumulative viability signal, and secretomic levels are reported in raw values and stored without aggregation or scoring. No interpretative logic or classification thresholds are applied. Figure 8 Immunophenotypic decision tree for functional classification. Schematic representation of the decision-making logic used in the STIP system to assign functional categories—Stimulatory, Inhibitory, or Neutral—to phospholipoproteomic platforms. The tree integrates kinetic divergence, sustained proliferation patterns, and secretome analysis—specifically the IFN-γ/IL-10 ratio—to support objective classification under standardized ex vivo conditions. Red diamonds indicate decision points, while blue rectangles indicate outcome categories. Figure 9 Workflow diagram for STIP-based evaluation and documentation. The flowchart outlines the complete process for assessing phospholipoproteomic platforms in sentinel tumor cell lines. The workflow begins with vesicle registration, followed by ex vivo assays capturing cell proliferation, viability signals, and cytokine levels. Outputs are validated, analyzed, and compiled into standardized technical dossiers. Each dataset undergoes independent review before being archived as a regulatorily traceable unit suitable for integration into CTD Module 5.3, SAP frameworks, or institutional documentation pipelines. Figure 10 Progressive morphological evolution of A375 cells exposed to the phospholipoproteomic platform. Representative image sequences showing real-time confluence changes in A375 cells at 0, 12, 30, and 48 h post-exposure. Images were acquired at 10× magnification (scale bar = 100 µm). Yellow segmentation overlays indicate automated boundary detection, while the underlying green background corresponds to the phase-contrast image of the culture well. The sequence illustrates a gradual increase followed by deceleration and plateau, consistent with a Type II STIP trajectory. No cytotoxicity or detachment was observed. This response pattern was reproducibly observed across batches and aligns with suppressive but non-lethal vesicle–cell interactions under standardized assay conditions. Figure 11 This comparative flowchart illustrates two validated regulatory pathways leading to product commercialization. On the left, the classical NDA model proceeds through Phase 1, 2, and 3 clinical trials, each involving human exposure, pharmacodynamic claims, and endpoint monitoring. On the right, the bioendogenous platform follows a non-clinical route through STIP—Structured Traceability and Immunophenotypic Platform—where functional behavior is documented using ΔC%, viability, and cytokine-based metrics under ex vivo conditions. Both routes converge at the same regulatory goal: commercialization. STIP enables this outcome without dosing, toxicity risk, or systemic activation, offering a technically robust alternative suitable for regulatory models that accept deferred clinical activation based on non-interventional evidence. Figure 12 This conceptual diagram contrasts classical pharmacological treatment with emerging bioendogenous platforms in terms of developmental efficiency (x-axis) and phenotypic relevance (y-axis). Classical drugs are grounded in systemic pharmacokinetics, often requiring prolonged clinical trials and receptor-based validation. In contrast, bioendogenous vesicle platforms operate through structural compatibility, enabling rapid documentation of functional behavior (e.g., ΔC%, viability, cytokines) without systemic burden. The diagram illustrates how this shift in paradigm enables regulatory evidence to emerge from high-efficiency, biologically grounded models such as STIP, delivering meaningful data for non-clinical decision-making. Figure 13 This stepwise regulatory flowchart outlines the non-clinical validation journey of a bioendogenous platform under the ICT-EP framework. The process begins with standard preclinical testing, transitions through STIP validation—where ex vivo phenotypic metrics, such as ΔC% and viability, are captured—then passes through ex vivo pharmacology using standardized, non-destructive assays. This structured evidence is compiled into a regulatory submission package that explicitly recognizes the product’s non-pharmacodynamic nature. The pathway concludes with authorization, emphasizing that approval is possible without systemic exposure, clinical endpoints, or human trials, when proportionate documentation is supplied through harmonized, reproducible non-clinical platforms. Symbols within the Ex Vivo Pharmacology panel represent assay wells (circles), experimental endpoints (triangles), and a representative response curve (center). biomedicines-13-02101-t001_Table 1 Table 1 Batch-level metrics summary. Batch ΔC% AUC Log-Phase Slope Cumulative Viability Secretomic Level (pg/mL) FV-001 +6.8 3.25 0.024 6.4% 20.7 FV-002 +3.9 8.63 0.028 12.7% 135.2 FV-003 +3.2 10.12 0.072 16.7% 8.8 FV-004 +19.7 3.56 0.067 21.7% 18.4 FV-005 +22.7 6.48 0.072 6.4% 29.7 biomedicines-13-02101-t002_Table 2 Table 2 Vesicle–cell interaction map (representative output view). Grid representation of vesicle–cell interaction outcomes in the kinetic profiling platform. Each entry denotes a single assay performed according to a standardized ex vivo protocol. Symbols correspond to generalized documentation categories applied during internal quality recording: ▲ indicates increased kinetic output, ▼ indicates decreased output, and — indicates no significant shift. These symbols are used exclusively as internal documentation markers and do not represent functional classification or therapeutic effect. No therapeutic inference or biological interpretation is assigned. Vesicle BEWO A375 BEWO (rep) FV-001 ▲ ▼ ▼ FV-002 ▼ — ▼ FV-003 — ▼ ▼ FV-004 ▲ ▼ — FV-005 ▼ — ▼ biomedicines-13-02101-t003_Table 3 Table 3 Multimetric output per vesicle–cell assay unit. Values are reported independently and not aggregated. The “Notes” column reflects procedural flags used internally, without interpretive weight. Vesicle Fraction Cell Line Δ Confluence (%) ΔT (h) Death Signal (%) IFN-γ/IL-10 Ratio Notes FV-001 BEWO +34.1 10.2 1.1 2.1 Stable FV-002 A375 −28.7 12.4 2.8 5.9 Stable FV-003 MCF-7 +1.6 — 0.9 1.0 Low shift FV-004 BEWO +31.8 11.0 1.4 2.5 Stable FV-005 A375 −29.5 13.1 2.6 6.1 Stable biomedicines-13-02101-t004_Table 4 Table 4 Cross-condition metric summary for internal documentation. Metric Range Observed Inter-Batch CV% Internal QC Threshold Δ Confluence (%) −29.5% to +34.1% <12% ±5% Divergence (ΔT, h) 10.2 to 13.1 <10% 2 h Death Signal (%) 0.9% to 2.8% <15% 3% IFN-γ/IL-10 Ratio 1.0 to 6.1 <14% n/a biomedicines-13-02101-t005_Table 5 Table 5 Comparison between clinical trial models and ex vivo functional protocols. Criterion Classical Clinical Trial Ex Vivo Functional Protocol Systemic absorption required? Yes No Defined pharmacological dose? Yes (e.g., Cmax, ED 50 No (non-systemic) Therapeutic intent? Yes Not applicable Generates adverse events? Yes (monitored) No (no systemic exposure) Requires patient recruitment? Yes No (cell models only) Uses placebo/randomization? Yes No Provides functional evidence directly? Indirect or endpoint-dependent Yes (real-time metrics) Document compatibility? No (efficacy-based) Yes (structure-function compatibility) Allows batch comparability? Indirect via PK/PD Direct via reproducible metrics CTD Module 5.3 integrable? Only with human trial data Yes (non-clinical documentation) Reproducible without human subjects? No Yes biomedicines-13-02101-t006_Table 6 Table 6 Technical comparison: clinical trial vs. ex vivo functional documentation. Criterion Classical Clinical Trial Ex Vivo Functional Protocol Requires systemic absorption? Yes No Defines pharmacological dose? Yes (ED 50 50 No (non-absorptive) Seeks therapeutic effect? Yes No Evaluates adverse events? Yes Not applicable Requires human recruitment? Yes (patients) No (cell-based) Uses randomization/placebo? Yes No Provides real-time functional data? Often indirect Yes (curve, viability, cytokines) Measures structural compatibility? No Yes Enables batch comparability? Indirect (via PK/PD) Yes (technical replicates) Compatible with CTD Module 5.3? Only if trial is conducted Yes (non-clinical evidence) Reproducible without patients? No Yes biomedicines-13-02101-t007_Table 7 Table 7 Functional equivalence of evidence: drug trials vs. structural formulations. Expectation Clinical Trial (Drug) Functional Documentation (Non-Drug) Confirms batch consistency Pharmacokinetics, patient arms Cross-line kinetic and cytokine reproducibility Documents product identity Labeling, source control Structural profiling, proteomic fingerprinting Demonstrates mechanism of effect Dose–response, receptor binding Indirect through reproducible behavior Validates safety Adverse events, Phase I/II Absence of toxicity, viability signal Supports regulatory review CTD Modules 2–5 CTD 5.3 (non-clinical, functional evidence) Reproducibility across production cycles Requires clinical lot tracking Demonstrated via laboratory replicates biomedicines-13-02101-t008_Table 8 Table 8 Comparative documentation: clinical trials vs. functional phenotypic protocol. Key Question Clinical Trial (Drug) Ex Vivo Documentation (Structural Platform) How is safety confirmed? Toxicity studies, maximum tolerated dose Absence of cytotoxicity, viability signal consistency How are off-target effects ruled out? Adverse events in patients Full phenotypic behavior tracked under standard protocol How is batch consistency demonstrated? Bioequivalence, therapeutic response Reproducible kinetic and cytokine metrics across batches How is reliability ensured? Pharmacokinetics and efficacy over time Divergence pattern stability and inter-batch reproducibility Is it a new chemical entity (NCE)? Assessed by toxicology and molecular profiling Non-NCE with traceable proteomic identity Is it appropriate for use in humans? Confirmed by clinical outcomes Technically stable and biologically neutral in cell models Is it recognized by regulators? Via NDA or similar programs Acceptable under non-clinical documentation modules biomedicines-13-02101-t009_Table 9 Table 9 Functional mapping of CTD sections in non-pharmacodynamic products. CTD Module or Section Clinical Trial Contribution Ex Vivo Functional Contribution Module 5.3—Functional studies Phases I–III, PK/PD, safety endpoints Kinetics, viability, cytokine behavior, batch replication 2.7.3—Efficacy summary Clinical effect, responder rate Stability and divergence over time in cell models 2.7.4—Safety summary Adverse events, side effects No cytolysis or toxicity under test conditions 2.6—Non-clinical pharmacology Animal models, systemic absorption Localized compatibility, proteic profile stability Module 3—Quality information Analytical validation, identity, impurities FTIR, DLS, document-linked traceability 1.12—Regulatory path justification Rationale for omission or modification Functional non-clinical file with supporting metrics biomedicines-13-02101-t010_Table 10 Table 10 Functional equivalence summary: clinical trials vs. ex vivo documentation models. Regulatory Objective Clinical Trial (Pharmacodynamic Drug) Ex Vivo Functional Protocol (Non-Pharmacodynamic Formulation) Demonstrates safety? Yes, via adverse event tracking and toxicology Yes, via absence of cytotoxicity, inflammatory signals, and death markers Supports batch consistency? Yes, through repeated trial arms and PK/PD trends Yes, through kinetic, viability, and cytokine reproducibility Provides functional data? Yes, usually endpoint-based or indirect Yes, with real-time kinetic curves and secretome response Enables pre-use batch validation? No, relies on post-release response Yes, via standardized cell-line interaction profiles Reproducible without patient data? No, requires clinical enrollment Yes, using validated sentinel lines under controlled conditions Compatible with CTD Module 5.3? Yes, as part of clinical data Yes, under non-clinical functional documentation Enables structural compatibility assessment? Not as a primary endpoint Yes, captured directly through ex vivo interaction Recognized by regulators? Yes, in standard therapeutic routes Yes, in exempt or proportional documentation pathways ",
  "metadata": {
    "Title of this paper": "Clinical ethics consultation documentation in the era of open notes",
    "Journal it was published in:": "Biomedicines",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12467205/"
  }
}