{
  "title": "Paper_115",
  "abstract": "pmc Asian J Urol Asian J Urol 3358 ajur Asian Journal of Urology 2214-3882 2214-3890 Second Military Medical University PMC12490678 PMC12490678.1 12490678 12490678 10.1016/j.ajur.2024.07.005 S2214-3882(24)00112-7 1 Original Article Enhancing postoperative functional recovery: Impact of the MAIA™ telerehabilitation platform in robot-assisted radical prostatectomy patients Amparore Daniele danieleamparore@hotmail.it a ⁎ 1 De Cillis Sabrina a 1 Sica Michele b Piramide Federico a Checcucci Enrico b Piana Alberto a Quara Alberto a Cisero Edoardo a Pini Federica a Gatti Cecilia a Manfredi Matteo a Fiori Cristian a Porpiglia Francesco a a b ⁎ danieleamparore@hotmail.it 1 Both authors contributed equally to this work. 7 2025 19 9 2024 12 3 498204 366 374 17 4 2024 26 7 2024 19 09 2024 03 10 2025 03 10 2025 © 2025 Editorial Office of Asian Journal of Urology. Publishing services by Elsevier B.Vé. 2025 Editorial Office of Asian Journal of Urology https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Objective To evaluate the efficacy and user satisfaction of the MAIA™ telemedicine platform for postoperative telemonitoring and telerehabilitation in patients undergoing robot-assisted radical prostatectomy (RARP). Methods Patients undergoing RARP (from April 2022 to January 2023) were divided into Group A, following the standard rehabilitation protocol, and Group B using the MAIA™ platform for the first 30-day post-intervention period. Perioperative, pathological, and functional variables (continence and potency rates, assessed via validated questionnaires) were collected and telerehabilitation protocol's adherence was monitored. The telerehabilitation system included an online platform for medical providers and a patient application, facilitating data acquisition, management, treatment planning, and monitoring. Patient and provider satisfaction were evaluated using the visual analogue scale score and validated telemedicine satisfaction questionnaire. Results Totally, 227 patients were enrolled. No differences in perioperative or pathological variables were found. Group B had higher potency recovery rates than Group A ( p p p p p Conclusion The MAIA™ telemedicine platform seems to have a role in optimizing early potency recovery after RARP. Patient and provider satisfaction levels were high, emphasizing the user-friendliness of the platform. Keywords Telemedicine Rehabilitation Continence Potency Surgical recovery Radical prostatectomy pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction Localized prostate cancer (PCa) significantly impacts the healthcare system, with radical prostatectomy (RP) as the preferred treatment, mostly performed robotically in developed countries. Despite its efficacy, postoperative complications affect patients' quality of life [ 1 2 Over time, surgeons have proposed various surgical techniques to improve patients' quality of life (QoL) by reducing the occurrence of postoperative complications, particularly urinary incontinence and erectile dysfunction [ 3 4 5 6 7 8 9 10 The aim of the study was to develop a new telerehabilitation and monitoring platform with a tailored design adapted for patients undergoing RARP and test its usability and efficacy in the real-life context, assessing early functional outcomes (continence and potency) up to 3 months after surgery. 2 Patients and methods 2.1 Study population This prospective observational study involved patients diagnosed with localized PCa (cT1–3, cN0, and cM0) undergoing RARP with or without pelvic lymph node dissection (PLND) from April 2022 to January 2023. RARP was performed by a single experienced surgeon (Porpiglia F who has performed more than 4000 cases of RARP) with the same surgical technique with a transperitoneal approach. The study adhered to good clinical practice guidelines with patients providing informed consent, and was approved by the Institutional Review Board of University of Turin, Orbassano, Turin, Italy (approval number 2778). Exclusion criteria were contraindications to RARP, preoperative urinary incontinence and/or erectile dysfunction (the International Index of Erectile Function-5 [IIEF-5] <17), contraindications to andrological rehabilitation with phosphodiesterase-5 inhibitor (PDE5-i) and pelvic floor muscle training (PFMT) [ 5 All enrolled patients underwent RARP with the bladder neck sparing technique and then total anatomical reconstruction, as previously reported [ 11 12 The MAIA™ platform (Ab Medica s.p.a., Cerro Maggiore, Italy) was developed as a telemonitoring and telerehabilitation system for continuous patient assessment, including a mobile application (app), available on iOS and Android, which securely transmits physiological data to healthcare providers. Originally designed for heart failure patient monitoring, our collaboration led to the creation of a custom module for patients undergoing RARP. This module integrates seamlessly, enabling data management, rehabilitation planning, and monitoring assessments. The patient app receives notifications for program execution and remote control feedback. Patients involved in the study were divided into Group A, prospectively enrolled from April 2022 to September 2022, in which patients underwent a standard postoperative recovery program, and Group B, enrolled from October 2022 to January 2023, in which patients were assisted by the MAIA™ platform in the rehabilitation timeframe. For the purpose of this study, the use of the MAIA™ smartphone app for patients was provided free of charge for the initial 3 months postoperatively. - Group A (standard care): all patients received PFMT instructions through dedicated nurse-led pre-discharge training, starting post-bladder catheter removal. Daily PFMT comprised four sets of 10 pubococcygeus muscle contractions in the supine position. Each contraction lasted 5–10 s during expiration, with a focus on avoiding abdominal and gluteus muscle contractions. Nerve-sparing (NS) RARP patients also underwent sexual rehabilitation using a PDE5-i, specifically tadalafil 20 mg thrice weekly after the catheter removal ( Fig. 1 Figure 1 The protocol flowcharts for standard rehabilitation program (Group A) and MAIA™ platform-assisted rehabilitation program (Group B). (A) Rehabilitation protocol; (B) Monitoring protocol. PFMT, pelvic floor muscle training; POD, postoperative day; IPSS, International Prostate Symptom Score; QoL, quality of life; ISI, Incontinence Severity Index; IIEF-5, International Index of Erectile Function-5. Figure 1 - Group B (telerehabilitation): patients in this group received the standard care alongside remote monitoring and rehabilitation through the MAIA™ platform. They underwent daily virtual PFMT guidance, following the same exercise and pre-discharge training as Group A. An app facilitated reporting on daily exercise sessions, while smartphone alerts every 2 days reminded them of oral PDE5-i intake, with required feedback. Failure to provide feedback for over two consecutive scheduled appointments prompted televisit assessments ( Fig. 1 2.2 Perioperative variables We examined preoperative variables, including age, body mass index, prostate-specific antigen levels at diagnosis, digital rectal examination positivity, primary and secondary Gleason scores from prostate biopsies, the International Society of Urological Pathology scores at fusion and standard biopsies. Patients also completed pre-surgery IPSS, ISI, and IIEF questionnaires. Intraoperative assessments included estimated blood loss, operative time, the number of PLND and NS approaches performed, classified as per the Pasadena Consensus Panel [ 13 Postoperatively, we assessed catheterization time and hospital stay, recorded complications according to the Clavien-Dindo classification system [ 14 Pathological variables analyzed encompassed the volume of prostate and tumor, the percentage of tumor involvement, the tumor-node-metastasis stage [ 15 2.3 Functional outcomes 2.3.1 Continence The Expanded Prostate Cancer Index Composite questionnaire's modified question was employed to define continence: “How many pads did you usually use to control urine leakage in the last 4 weeks?” The last part of the question was modified for continence assessment at catheter removal and 1 week after. Using this question, continence was defined as the answer “zero pad” per day. In Group A, continence assessments occurred at specific postoperative intervals: 1 week, 1 month, and 3 months after catheter removal. Also, ISI and IPSS questionnaires were administered preoperatively, 1 week, 1 month, and 3 months after the catheter removal. Continence monitoring of Group B involved tracking daily pad usage and pad weight through a pad test every 3 days after the catheter removal. Also for these patients, continence was defined as “zero pads” per day. Weekly ISI and IPSS questionnaires were completed via the MAIA™ app. 2.3.2 Potency In Group A, the level of postoperative erection recovery, with or without a PDE5-i, was assessed at 1 week, 1 month, and 3 months using the 25th question from the International Continence Society male questionnaire: “Do you have erections?” Valid answers excluded “no”. Additionally, the IIEF-5 questionnaire was completed at baseline, 1 week, 1 month, and 3 months after the catheter removal. For Group B, potency recovery was evaluated at 1 week, 1 month, and 3 months using the same International Continence Society male questionnaire question. Additionally, patients completed the IIEF-5 questionnaire preoperatively and then weekly after the bladder catheter removal. 2.4 MAIA™ platform use 2.4.1 Feasibility and satisfaction The first patients enrolled in Group B provided self-reported satisfaction feedback on the MAIA™ system after 30 days of application use. Feedback was gauged through the visual analogue scale (VAS, score range 0–100) and validated telemedicine satisfaction questionnaire (score range 1–5). Healthcare providers engaged in telerehabilitation and telemonitoring also assessed their satisfaction using a VAS score. Any technical issues or platform/app malfunctions within the 30-day period were meticulously documented. 2.4.2 Adherence and efficacy The adherence to the telerehabilitation protocol in Group B was gauged through patient app feedback. Lack of or negative feedback for over two consecutive appointments triggered televisit assessments. Effectiveness was evaluated for continence and potency recovery via the pad test, IIEF-5, IPSS, IPSS-QoL, and ISI, and these results were compared with those of Group A. Changes in protocols and adjustment times were recorded and compared as well. 2.5 Statistical analysis Continuous variables were presented as means (standard deviations) or medians with interquartile ranges (IQRs), while categorical variables were presented as percentages. The Chi-square test was used to compare proportions, and the Student's t p p 3 Results In this prospective study, 227 consecutive patients who underwent RARP with or without PLND were enrolled, 140 patients in Group A and 87 in Group B. Preoperative variables were comparable between the two groups ( Table 1 Table 1 Baseline characteristics of the patients. Table 1 Characteristic Group A (standard care; n Group B (telerehabilitation; n p Age, mean (SD), year 65.4 (5.8) 64.9 (6.6) 0.3 BMI, mean (SD), kg/m 2 26.2 (3.0) 26.6 (3.9) 0.8 Diabetes, n 14 (10) 6 (6.9) 0.14 Smoking, n 11 (7.9) 5 (5.7) 0.5 Hypertension, n 73 (52) 37 (43) 0.15 Cardiopathy, n 15 (11) 7 (8.0) 0.7 PSA, mean (SD), ng/mL 10.3 (8.2) 11.6 (7.2) 0.6 Positive DRE, n 62 (44) 35 (40) 0.3 ECE, n 23 (16) 9 (10) 0.2 Biopsy GS, median (IQR) 7 (7–8) 7 (7–7) 0.5 ASA score, median (IQR) 2 (2–2) 2 (2–2) 0.2 IPSS (preoperative), median (IQR) 9 (4–15) 10 (4–15) 0.5 IIEF-5 score (preoperative), median (IQR) 20 (17–22) 21 (17–23) 0.4 ISI score (preoperative), median (IQR) 0 (0–2) 0 (0–1) 0.3 D'Amico classification, n 0.17 High risk 37 (26) 19 (22) Intermediate risk 91 (65) 57 (66) Low risk 12 (8.6) 11 (13) Clinical stage, n 0.3 T1c 43 (31) 24 (28) T2 90 (64) 58 (67) T3 7 (5.0) 5 (5.7) BMI, body mass index; PSA, prostate-specific antigen; SD, standard deviation; ECE, extra-capsular extension; GS, Gleason score; ASA, American Society of Anesthesiologists; IPSS, International Prostate Symptom Score; IIEF-5, International Index of Erectile Function-5; ISI, Incontinence Severity Index; DRE, digital rectal examination. Perioperative data, postoperative complications up to 3 months after surgery, and pathological findings are summarized in Table 2 p p Table 2 Perioperative and pathological data. Table 2 Perioperative and pathological data Group A (standard care; n Group B (telerehabilitation; n p Operative time, mean (SD), min 145.0 (30.6) 140.4 (29.3) 0.3 PLND, n 122 (87) 68 (78) 0.071 NS approach, n Full NS 38 (27) 29 (33) Partial NS 71 (51) 43 (49) 0.5 Minimal NS 31 (22) 15 (17) Estimated blood loss, mean (SD), mL 253.4 (46.0) 241.0 (57.3) 0.4 Intraoperative complication, n 0 (0) 0 (0) 0 Catheterization time, median (IQR), day 4 (4–5) 4 (4–5) 0.5 Postoperative hospital stay, median (IQR), day 5 (5–6) 5 (5–6) 0.8 Postoperative complication, n 12 (8.6) 7 (8.0) 0.5 Clavien-Dindo grades 1–2 0.4 Fever 2 (1.4) 1 (1.1) Suprapubic hematoma 3 (2.1) 1 (1.1) Acute urinary retention 3 (2.1) 1 (1.1) Urine leakage 3 (2.1) 2 (2.3) Clavien-Dindo grade ≥3 Lymphocele requiring percutaneous drainage 1 (0.71) 2 (2.3) Positive surgical margin, n 30 (21) 18 (21) 0.9 Prostate volume, mean (SD), mL 44.4 (25.6) 45.6 (20.3) 1 Tumor volume, mean (SD), mL 4.9 (5.2) 5.6 (6.4) 0.2 Tumor percentage, mean (SD) 12.7 (13.4) 14.0 (12.6) 0.2 Pathological T stage, n 0.068 pT2 51 (36) 38 (44) pT3 89 (64) 49 (56) Pathological N stage, n 0.068 pN0 118 (84) 65 (75) pN1 4 (2.9) 3 (3.4) Pathological GS, n 0.2 6 4 (2.9) 1 (1.1) 7 110 (79) 71 (82) 8 11 (7.9) 6 (6.9) 9 15 (11) 9 (10) PLND, pelvic lymph node dissection; SD, standard deviation; IQR, interquartile range; NS, nerve-sparing; GS, Gleason score. Note: percentages may not add up to 100% due to rounding. Functional data and outcomes relative to sexual potency and urinary continence are shown in Table 3 Figure 2 Table 3 Functional outcomes and relative questionnaires. Table 3 Functional outcome Group A (standard care; n Group B (telerehabilitation; n p Postoperative continence, n 0.5 1 week 104 (74) 66 (76) 1 month 113 (81) 72 (83) 3 months 128 (91) 81 (93) Postoperative IPSS, median (IQR) 0.4 1 week 8 (3–8) 9 (8–10) 1 month 8 (4–10) 8 (4–10) 3 months 7 (4–9) 8 (5–10) Postoperative ISI score, median (IQR) 0.3 1 week 4 (2–4) 4 (2–4) 1 month 2 (2–4) 2 (1–2) 3 months 1 (0–2) 1 (0–2) Postoperative potency (based on ICS questionnaire), n 0.031 1 week 15 (11) 9 (10) 1 month 48 (34) 39 (45) 3 months 67 (48) 50 (57) Postoperative IIEF-5 score; median (IQR) 0.018 1 week 3 (0–12) 10 (0–15) 1 month 5 (0–17) 15 (0–20) 3 months 10 (0–18) 17 (0–20) IPSS, International Prostate Symptom Score; ISI, Incontinence Symptom Index; ICS, International Continence Society; IIEF-5, International Index of Erectile Function-5; IQR, interquartile range. Figure 2 Outcomes relative to urinary continence and sexual potency recovery rates at 1 week, 1 month, and 3 months after robotic radical prostatectomy, in case for the standard rehabilitation program (Group A) and MAIA™ platform-assisted rehabilitation program (Group B). (A) Urinary continence outcomes; (B) Sexual potency outcomes. Figure 2 In Group A, continence rates were 74%, 81%, and 91% at 1 week, 1 month, and 3 months, respectively; in Group B, the rates were 76%, 83%, and 93%, respectively ( Table 3 p p p Regarding potency, erectile rates at 1 week, 1 month, and 3 months after the catheter removal were 11%, 34%, and 48%, respectively, in Group A, and 10%, 45%, and 57%, respectively, in Group B ( Table 3 p p Similar results held after stratifying for the NS technique ( Supplementary Table 1 p p The univariate logistic regression analysis identified age (odd ratio [OR] 0.95, 95% confidence interval [CI] 0.91–0.99, p p p p p p p p Supplementary Tables 2 and 3 3.1 MAIA™ platform outcomes To assess feasibility and satisfaction of using the MAIA™ platform, the first 28 patients in Group B completed satisfaction questionnaires. Patients showed a high level of satisfaction with a mean VAS score of 88.7 (SD 17.2). Healthcare providers using the platform also expressed satisfaction, with a mean VAS score of 82.2 (SD 11.2) and a mean telemedicine satisfaction questionnaire score of 4.6 (SD 0.4). All patients would recommend the platform to others. Technical issues were encountered by 10 out of 28 patients, including notification problems for six patients and difficulties with online questionnaires for four patients. These issues were easily resolved by adjusting smartphone accessibility settings. Healthcare providers reported no technical malfunctions with the MAIA™ platform. Adherence and efficacy outcomes of the digital and standard rehabilitation programs are reported in Table 4 Table 4 Adherence to rehabilitation protocols. Table 4 Monitoring and rehabilitation Group A (standard care; n Group B (telerehabilitation; n p Non-adherence to rehabilitation protocols, n 0.2 PFMT 10 (7.1) 4 (4.6) PDE5-i 15 (11) 11 (13) Reasons for non-adherence, n 0.3 Perineal pain 10 (7.1) 4 (4.6) PDE5-i-mediated myalgia 15 (11) 9 (10) PDE5-i not purchased 0 2 (2.3) From discharge, median (IQR), day 0.011 Non-adherence to PFMT 38 (30–40) 4 (4–10) Non-adherence to a PDE5-i 28 (28–35) 7 (7–11) Therapy duration, days; median (IQR) 15 (10–20) 7 (7–7) 0.018 Delay for resumption of a rehabilitation protocol compared to Group B, median (IQR), day 0.031 PFMT 30 (25–32) 0 PDE5-i 21 (20–32) 0 PFMT, pelvic floor muscle training; PDE5-i, 5-phosphodiestherase inhibitor; IQR, interquartile range. In Group A, 7.1% (10/140) discontinued PFMT, and 11% (15/140) discontinued PDE5-i therapy at the 1-month visit due to perineal pain or PDE5-i-related adverse events. Those with perineal pain received a 7-day corticosteroid course with paracetamol plus codeine, resulting in a median delay of 30 (25–32) days compared to Group B. Switching PDE5-i molecules was well-tolerated, but the 11% in Group A started continuous andrological drug rehabilitation with a median delay of 21 (20–32) days compared to Group B. All Group B patients completed scheduled questionnaires and pad test measurements; 11% (10/87) of them recorded at least three consecutive pad test measurements exceeding 200 g, prompting telemedicine visits for second-level PFMT around 5 days after the last pad test. In Group A, 12% (17/140) reported pad test results indicating urinary leakage exceeding 200 g at the 1-month follow-up, initiating the second-level PFMT with a median delay of approximately 30 days compared to Group B. 4 Discussion After the development of RARP and its widespread adoption [ 16 17 18 19 Implementing these protocols in routine clinical practice poses logistic challenges due to the high prevalence of RARP, accounting for over 70% of uro-oncological surgical procedures in high-volume centers. Intensive rehabilitation regimens face limitations within the public health system, given the large number of patients undergoing surgical treatment for localized PCa [ 20 In these circumstances, telehealth technology becomes crucial in overcoming resource-related obstacles and expediting data collection for clinical monitoring [ [21] [22] [23] During the viability and satisfaction evaluation phase with patients treated with RARP ( n 24 This study underscores the pivotal role of digital health solutions in mitigating usability issues, especially considering factors like digital literacy, age, and language competency [ 25 23 Concurrently, the meticulous monitoring of adherence through the MAIA™ platform allowed researchers to identify precociously non-negligible percentages of patients (4.6% for PFMT and 13% for PDE5-i discontinuation) experiencing postoperative symptoms leading to rehabilitation program interruption prior to the scheduled 1-month on-site visit. This proactive approach enabled prompt management, resulting in a median gain of 30 (IQR 25–32) days and 21 (IQR 20–32) days in rehabilitation restart for Group B in comparison with Group A ( p Furthermore, the telemonitoring capability of the MAIA™ platform facilitated the early detection of mild to severe incontinence in 11% of patients in Group B before the scheduled 1-month on-site visit, allowing for immediate intervention and a more tailored approach. In contrast, 12% of patients in Group A reported urine leakage higher than 200 g at the 1-month on-site visit, initiating level II PFMT rehabilitation 30 (IQR 25–32) days later than their counterparts. Notably, despite this temporal delay, no significant difference in continence rates was observed between the two groups. These results are consistent with earlier research on the subject [ [26] [27] [28] [29] 30 Intriguingly, when it comes to erectile function recovery rates, there was a notable discrepancy between the two study groups. Patients utilizing the MAIA™ platform reported higher rates of potency at both 1 month and 3 months postoperatively, with this difference being particularly pronounced in cases where a full NS technique was employed ( p It is essential to acknowledge certain limitations inherent in the study design. The relatively small sample size, absence of randomization, and relatively short 3-month follow-up period may impact the generalizability of the findings. However, it has to be underlined that even if the two groups were composed of consecutive patients, the expertise of the surgeon did not impact the surgical outcomes over time, having already completed his learning curve. Moreover, the outcomes reported may not be universally applicable to low-volume RARP centers, and the inclusion criteria for telemedicine may introduce a degree of selection bias, limiting broader generalizability. Nevertheless, this study provides valuable insights into the potential benefits and challenges of incorporating telerehabilitation programs into postoperative care, emphasizing the need for further exploration and technological advancement in this rapidly evolving field. 5 Conclusion Designed for telemonitoring and telerehabilitation in RARP patients, the MAIA™ platform is user-friendly and highly satisfactory for both patients and providers, thus applicable in clinical practice. The meticulous telemonitoring of protocol adherence via the platform seems to allow higher rates of early potency recovery at 1 month and 3 months postoperatively. Further validation studies are needed to confirm these preliminary results. Author contributions Study concept and design Data acquisition Data analysis Drafting of manuscript Critical revision of the manuscript Conflicts of interest The authors declare no conflict of interest. References 1 Palumbo C. Bruni A. Antonelli A. Artibani W. Bassi P. Bertoni F. Pros-IT CNR Study Group Health-related quality of life 24 months after prostate cancer diagnosis: an update from the Pros-IT CNR prospective observational study Minerva Urol Nephrol 74 2022 11 20 33439570 10.23736/S2724-6051.20.04032-1 2 Remmers S. Venderbos L.D. Deschamps A. Dowling J. Carl E.G. Roobol M.J. Sexual and urinary function in prostate cancer clinical studies and the Europa Uomo Patient Reported Outcome Study: does it match? Minerva Urol Nephrol 75 2023 188 193 36519924 10.23736/S2724-6051.22.05120-5 3 Dal Moro F. How to preserve continence after radical prostatectomy: do not go straight, remember to curve Minerva Urol Nephrol 75 2023 548 551 37728491 10.23736/S2724-6051.23.05491-5 4 Albisinni S. Dasnoy C. Diamand R. Mjaess G. Aoun F. Esperto F. Anterior vs. Minerva Urol Nephrol 74 2022 137 145 34714037 10.23736/S2724-6051.21.04623-1 5 Geraerts I. Van Poppel H. Devoogdt N. Joniau S. Van Cleynenbreugel B. De Groef A. Influence of preoperative and postoperative pelvic floor muscle training (PFMT) compared with postoperative PFMT on urinary incontinence after radical prostatectomy: a randomized controlled trial Eur Urol 64 2013 766 772 23357349 10.1016/j.eururo.2013.01.013 6 Campbell S.E. Glazener C.M. Hunter K.F. Cody J.D. Moore K.N. Conservative management for postprostatectomy urinary incontinence Cochrane Database Syst Rev 1 2012 CD001843 10.1002/14651858.CD001843.pub4 15106164 7 Serrano L.P. Maita K.C. Avila F.R. Torres-Guzman R.A. Garcia J.P. Eldaly A.S. Benefits and challenges of remote patient monitoring as perceived by health care practitioners: a systematic review Perm J 27 2023 100 111 37735970 10.7812/TPP/23.022 PMC10730976 8 Cramer S.C. Dodakian L. Le V. See J. Augsburger R. McKenzie A. National Institutes of Health StrokeNet Telerehab Investigators Efficacy of home-based telerehabilitation vs. JAMA Neurol 76 2019 1079 1087 31233135 10.1001/jamaneurol.2019.1604 PMC6593624 9 Weiss K. Abimbola O. Mueller D. Basak R. Basch E. Parisse T. Feasibility, acceptability, and outcomes of a mobile health tool for radical cystectomy recovery J Urol 211 2024 266 275 37972245 10.1097/JU.0000000000003787 10 Agarwal D.K. Viers B.R. Rivera M.E. Nienow D.A. Frank I. Tollefson M.K. Physical activity monitors can be successfully implemented to assess perioperative activity in urologic surgery mHealth 4 2018 43 10.21037/mhealth.2018.09.05 30363722 PMC6182011 11 Porpiglia F. Bertolo R. Manfredi M. De Luca S. Checcucci E. Morra I. Total anatomical reconstruction during robot-assisted radical prostatectomy: implications on early recovery of urinary continence Eur Urol 69 2016 485 495 26297603 10.1016/j.eururo.2015.08.005 12 Manfredi M. Checcucci E. Fiori C. Garrou D. Aimar R. Amparore D. Total anatomical reconstruction during robot-assisted radical prostatectomy: focus on urinary continence recovery and related complications after 1000 procedures BJU Int 124 2019 477 486 30801887 10.1111/bju.14716 13 Montorsi F. Wilson T.G. Rosen R.C. Ahlering T.E. Artibani W. Carroll P.R. Pasadena Consensus Panel. Best practices in robot-assisted radical prostatectomy: recommendations of the Pasadena Consensus Panel Eur Urol 62 2012 368 381 22763081 10.1016/j.eururo.2012.05.057 14 Dindo D. Demartines N. Clavien P.A. Classification of surgical complications: a new proposal with evaluation in a cohort of 6336 patients and results of a survey Ann Surg 240 2004 205 213 15273542 10.1097/01.sla.0000133083.54934.ae PMC1360123 15 Brierley J.D. Gospodarowicz M.K. Wittekind C. TNM classification of malignant tumors 8th ed. 2017 Wiley Blackwell Publishers New Jersey 191 198 16 Baboudjian M. Gondran-Tellier B. Grabia A. Barret E. Beauval J.B. Brureau L. Perioperative outcomes after radical prostatectomy: does the surgical approach change the impact of hospital volume? A nationwide analysis Minerva Urol Nephrol 74 2022 638 640 35274905 10.23736/S2724-6051.22.04886-8 17 Stanford J.L. Feng Z. Hamilton A.S. Gilliland F.D. Stephenson R.A. Eley J.W. Urinary and sexual function after radical prostatectomy for clinically localized prostate cancer: the prostate cancer outcomes study JAMA 283 2000 354 360 10647798 10.1001/jama.283.3.354 18 Van Kampen M. De Weerdt W. Van Poppel H. De Ridder D. Feys H. Baert L. Effect of pelvic-floor re-education on duration and degree of incontinence after radical prostatectomy: a randomised controlled trial Lancet 355 2000 98 102 10675166 10.1016/S0140-6736(99)03473-X 19 Mariotti G. Sciarra A. Salciccia S. Cattarino S. Fiori C. Gentilucci A. Quantitative analysis of urinary incontinence after prostatectomy: lack of standardization in trials Minerva Urol Nephrol 74 2022 249 251 35607781 10.23736/S2724-6051.22.04958-8 20 Van Kampen M. De Weerdt W. Van Poppel H. De Ridder D. Feys H. Baert L. Effect of pelvic-floor re-education on duration and degree of incontinence after radical prostatectomy: a randomised controlled trial Lancet 355 2000 98 102 10675166 10.1016/S0140-6736(99)03473-X 21 Shiff B. Frankel J. Oake J. Blachman-Braun R. Patel P. Patient satisfaction with telemedicine appointments in an academic andrology-focused urology practice during the COVID-19 pandemic Urology 153 2021 35 41 33450281 10.1016/j.urology.2020.11.065 PMC9754887 22 Novara G. Checcucci E. Crestani A. Abrate A. Esperto F. Pavan N. Research Urology Network (RUN). Telehealth in urology: a systematic review of the literature. How much can telemedicine be useful during and after the COVID-19 pandemic? Eur Urol 78 2020 Dec 786 811 32616405 10.1016/j.eururo.2020.06.025 PMC7301090 23 Checcucci E. De Luca S. Alessio P. Verri P. Granato S. De Cillis S. Uro-technology and SoMe Working Group of the Young Academic Urologists Working Party of the European Association of Urology. Implementing telemedicine for the management of benign urologic conditions: a single centre experience in Italy World J Urol 39 2021 3109 3115 33385246 10.1007/s00345-020-03536-x PMC7775638 24 Amparore D. Campi R. Checcucci E. Piana A. Sica M. Grosso A.A. Patients' perspective on the use of telemedicine for outpatient urological visits: learning from the COVID-19 outbreak Actas Urol Esp 44 2020 637 638 32843151 10.1016/j.acuroe.2020.06.002 PMC7585493 25 Yavas I. Kahraman T. Sagici O. Ozdogar A.T. Yigit P. Baba C. Feasibility of telerehabilitation-based pelvic floor muscle training for urinary incontinence in people with multiple sclerosis: a randomized, controlled, assessor-blinded study J Neurol Phys Ther 47 2023 217 226 37306430 10.1097/NPT.0000000000000448 26 Tienforti D. Sacco E. Marangi F. D'Addessi A. Racioppi M. Gulino G. Efficacy of an assisted low-intensity programme of perioperative pelvic floor muscle training in improving the recovery of continence after radical prostatectomy: a randomized controlled trial BJU Int 110 2012 1004 1010 22332815 10.1111/j.1464-410X.2012.10948.x 27 Wennerberg C. Hellström A. Schildmeijer K. Ekstedt M. Effects of web-based and mobile self-care support in addition to standard care in patients after radical prostatectomy: randomized controlled trial JMIR Cancer 9 2023 e44320 10.2196/44320 PMC10512115 37672332 28 Belarmino A. Walsh R. Alshak M. Patel N. Wu R. Hu J. Feasibility of a mobile health application to monitor recovery and patient-reported outcomes after robot-assisted radical prostatectomy Eur Urol Oncol 2 2019 425 428 31277778 10.1016/j.euo.2018.08.016 29 Viers B.R. Lightner D.J. Rivera M.E. Tollefson M.K. Boorjian S.A. Karnes R.J. Efficiency, satisfaction, and costs for remote video visits following radical prostatectomy: a randomized controlled trial Eur Urol 68 2015 729 735 25900782 10.1016/j.eururo.2015.04.002 30 Goode P.S. Johnson TM 2nd Newman D.K. Vaughan C.P. Echt K.V. Markland A.D. Perioperative mobile telehealth program for post-prostatectomy incontinence: a randomized clinical trial J Urol 208 2022 379 387 35389239 10.1097/JU.0000000000002697 Appendix A Supplementary data The following is the Supplementary data to this article: Multimedia component 1 Multimedia component 1 Peer review under responsibility of Tongji University. Appendix A Supplementary data to this article can be found online at https://doi.org/10.1016/j.ajur.2024.07.005 ",
  "metadata": {
    "Title of this paper": "Perioperative mobile telehealth program for post-prostatectomy incontinence: a randomized clinical trial",
    "Journal it was published in:": "Asian Journal of Urology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490678/"
  }
}