{
  "title": "Paper_1144",
  "abstract": "pmc Biomolecules Biomolecules 2397 biomol biomolecules Biomolecules 2218-273X Multidisciplinary Digital Publishing Institute  (MDPI) PMC12467915 PMC12467915.1 12467915 12467915 41008624 10.3390/biom15091317 biomolecules-15-01317 1 Review Plasminogen Activator Inhibitor-1 in Skin Malignancies: Therapeutic Implications of Its Inhibition https://orcid.org/0000-0001-6809-5833 Fujimura Taku * https://orcid.org/0000-0002-7180-2786 Muto Yusuke https://orcid.org/0000-0001-5560-9778 Asano Yoshihide * Korać Petra Academic Editor Matulić Maja Academic Editor Department of Dermatology, Tohoku University Graduate School of Medicine, Sendai 980-8574, Japan; yusuk0610@derma.med.tohoku.ac.jp * taku.fujimura.e3@tohoku.ac.jp yasano@derma.med.tohoku.ac.jp 13 9 2025 9 2025 15 9 497615 1317 13 8 2025 12 9 2025 12 9 2025 13 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Plasminogen activator inhibitor-1 (PAI-1), a key regulator of fibrinolysis, has emerged as a critical stromal factor that contributes to tumor progression in various malignancies, including skin cancers. Beyond its classical role in inhibiting plasminogen activators, PAI-1 exerts pleiotropic effects within the tumor microenvironment, promoting immunosuppression, angiogenesis, and extracellular matrix remodeling. This review highlights the tumor-promoting functions of PAI-1 in melanoma, cutaneous squamous cell carcinoma, cutaneous angiosarcoma and cutaneous T-cell lymphoma, with a particular focus on its modulation of tumor-associated macrophages, cancer-associated fibroblasts, and endothelial cells. We also discuss recent preclinical and clinical studies targeting PAI-1, including TM5614, a novel oral PAI-1 inhibitor currently under investigation in phase II /III trials. By summarizing the multifaceted roles of PAI-1 and its impact on the immune and stromal landscape of skin malignancies, this review provides a rationale for PAI-1 as a promising therapeutic target and calls for further clinical validation of PAI-1–directed therapies. PAI-1 tumor microenvironment SASP melanoma immune checkpoints angiogenesis This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Plasminogen activator inhibitor-1 (PAI-1) is a serine protease inhibitor that contributes to tumor-supportive mechanisms such as enhanced angiogenesis and tumor cell survival, thereby leading to unfavorable clinical outcomes in various malignancies, including cutaneous cancers [ 1 2 3 4 PAI-1 is implicated in diverse pathological processes, including tissue fibrosis, atherosclerosis, and tumorigenesis [ 2 2 5 5 5 6 1 2 5 6 1 2 7 In addition to its function as an angiogenic regulator, PAI-1 also promotes recruitment of tumor-associated macrophages (TAMs) within the tumor microenvironment (TME) by upregulating focal adhesion kinase (FAK) expression [ 7 3 8 9 2. PAI-1 in Skin Cancers Accumulating evidence suggests that PAI-1 is a promising molecular target for treating various malignancies, including melanoma. To date, two clinical studies have been completed [ 10 11 12 13 2.1. Malignant Melanoma Unlike in Caucasian populations, the therapeutic efficacy of anti-PD-1 antibodies (Ab) in East Asian patients has been shown to be lower in several real-world clinical studies [ 14 15 15 15 15 p 15 15 16 Taken together, the efficacy of immune checkpoint inhibitors (ICIs) for unresectable melanoma in East Asia tends to be lower than in Caucasians [ 14 15 17 18 16 19 20 21 22 Plasminogen activator inhibitor-1 (PAI-1) is frequently expressed in both primary and metastatic melanoma lesions, with particularly high expression in cutaneous metastases correlating with increased invasiveness and motility, implicating PAI-1 in risk stratification for metastasis [ 23 3 + 9 9 24 Figure 1 In fact, the PAI-1 inhibitor TM5614 has demonstrated promising results in patients with unresectable melanoma resistant to anti-PD-1 Ab such as nivolumab (Trial ID: jRCT2021210029) [ 10 p 25 26 27 28 PAI-1 suppresses the proliferation and function of cytotoxic T cells as well as promotes the induction of TAMs and CAFs in the TME. PAI-1 also promotes the migration and tube formation of ECs in melanoma. 2.2. Cutaneous Squamous Cell Carcinoma (cSCC) In cSCC, PAI-1 expression is markedly elevated compared to basal cell carcinoma and actinic keratosis, and has long been implicated in tumor invasion and metastasis [ 29 30 31 31 31 32 33 34 35 Figure 2 36 36 37 38 It has been demonstrated in many models that SASP induces PAI-1, and furthermore, PAI-1 itself enhances SASP production, thereby establishing a positive feedforward loop between SASP and PAI-1 ( Figure 2 39 40 In cSCC, tumor-derived PAI-1 recruit immunosuppressive cells such as granulocytic myeloid-derived suppressor cells, neutrophils, TAMs, and Tregs, leading to promoting metastasis of cSCC. 2.3. Cutaneous Angiosarcoma (CAS) CAS is characterized by malignant transformation of endothelial cells (ECs), frequently exhibiting high expression of angiogenesis-related growth factors and receptors, such as VEGFR1/2/3 [ 41 42 43 44 43 44 PAI-1 has also been identified as a critical factor in the pathogenesis of cutaneous angiosarcoma (CAS), with high expression levels correlating with poor prognosis [ 45 45 5 32 34 35 46 47 + 47 32 12 2.4. Mycosis Fungoides (MF), Cutaneous T Cell Lymphoma (CTCL) Mycosis fungoides (MF) is an indolent subtype of cutaneous T-cell lymphoma (CTCL) [ 48 49 50 51 52 53 53 53 53 54 48 As noted above, SASP induces PAI-1 expression, while PAI-1 in turn amplifies SASP production, forming a SASP–PAI-1 feed-forward loop that promotes tumor progression. This mechanism has been implicated in other malignancies as well as skin cancer [ 32 55 55 56 55 32 55 The tumor-promoting effects of PAI-1 in different cancer types, as well as the therapeutic agents expected to exhibit synergistic efficacy when combined with PAI-1 inhibitors, are described below ( Table 1 3. Diverse Tumor-Promoting Effects of PAI-1 in the TME Over the past few decades, immunotherapy has become a leading treatment option for advanced skin cancers [ 44 45 45 14 15 57 58 59 60 14 15 60 60 61 61 3.1. Immunomodulatory Role of PAI-1 in TAM Regulation Within the TME TAMs are abundantly present in skin cancers and, together with stromal components such as CAFs and Tregs, contribute to tumor progression by maintaining an immunosuppressive TME [ 61 62 63 64 61 62 63 64 65 66 67 65 65 66 53 9 As a stromal-derived factor regulating TAM function, PAI-1 has attracted attention as a potential therapeutic target in various malignancies [ 3 8 62 64 68 69 9 9 8 3 65 62 63 69 68 Taken together, these findings demonstrate that PAI-1 is a key driver of TAM recruitment and M2 polarization in the TME through JAK/STAT3-dependent mechanisms. By inducing monocyte infiltration via SASP factors such as IL-6 and CXCL5, PAI-1 sustains an immunosuppressive TME, thereby facilitating tumor progression across a range of malignancies, including skin cancers. 3.2. Significant Effects of PAI-1 on Cancer-Associated Fibroblasts (CAFs) CAFs are a heterogeneous population of stromal cells that produce tumor-promoting factors across many cancer types, including cutaneous malignancies [ 70 71 70 70 71 + + + 72 + + + 72 Forsthuber et al. further subclassified CAFs in skin cancers into three groups: myofibroblast-like RGS5 + 73 74 75 Although the precise mechanisms through which PAI-1 drives tumor progression via CAFs remain incompletely understood, multiple studies have underscored the critical role of CAF-derived or CAF-activated PAI-1 [ 40 76 77 78 + 78 78 high 77 76 78 4. Future Perspective The growing body of evidence implicating PAI-1 as a central orchestrator of tumor–stroma interactions in skin malignancies underscores its potential as a therapeutic target. By modulating the activity of TAMs, CAFs, and other components of the TME, PAI-1 promotes immune evasion, angiogenesis, lymphangiogenesis, and resistance to both cytotoxic chemotherapy and ICIs. These multifaceted roles position PAI-1 inhibition as a strategy that could complement existing treatments across a broad spectrum of skin cancers, including melanoma, cSCC, CAS, and CTCL. Despite encouraging preclinical data and promising early-phase clinical trial results—particularly with the small-molecule inhibitor TM5614—several challenges remain. First, the dual and context-dependent effects of PAI-1 on tumor progression and angiogenesis suggest that optimal dosing, treatment duration, and patient selection criteria must be precisely defined. Second, the heterogeneity of PAI-1 expression among different tumor types and within distinct TME subtypes may necessitate biomarker-driven stratification to identify patients most likely to benefit. Third, resistance mechanisms to PAI-1 blockade, including compensatory pathways in stromal cells, require further elucidation. Future research should focus on integrating PAI-1 inhibition into rational combination regimens, such as pairing with ICIs, anti-angiogenic agents, or stroma-targeting therapies, to enhance therapeutic synergy. Longitudinal studies incorporating spatial transcriptomics and single-cell profiling will be critical to map dynamic changes in the TME during PAI-1 blockade and to refine predictive biomarkers. In addition, the exploration of PAI-1’s role in the interplay between SASP factors and ECM remodeling may reveal novel intervention points. Ultimately, advancing PAI-1-targeted strategies from experimental therapy to routine clinical practice will depend on well-designed, adequately powered trials that account for the biological diversity of skin malignancies. If successful, such approaches may offer a new avenue to overcome immune resistance, reduce metastatic spread, and improve survival outcomes for patients with otherwise refractory disease. 5. Conclusions PAI-1 has emerged as a pivotal stromal mediator in the pathogenesis and progression of skin malignancies. Beyond its canonical role in fibrinolysis, PAI-1 orchestrates a wide array of tumor-supportive mechanisms, including immunosuppression, angiogenesis, extracellular matrix remodeling, and resistance to immune checkpoint inhibitors and cytotoxic chemotherapy. Through its regulation of TAMs, CAFs, and endothelial cells, PAI-1 sustains an immunosuppressive tumor microenvironment and promotes cancer progression across melanoma, cSCC, CAS, and MF (CTCL). Recent preclinical studies and early-phase clinical trials—particularly those involving the small-molecule inhibitor TM5614—demonstrate that targeting PAI-1 can enhance anti-PD-1 antibody efficacy, suppress stromal-driven resistance mechanisms, and induce durable antitumor effects. However, the pleiotropic and context-dependent functions of PAI-1 necessitate careful evaluation of dosing strategies, patient stratification, and potential compensatory mechanisms within the tumor stroma. Furthermore, the heterogeneity of PAI-1 expression across tumor subtypes underscores the importance of biomarker-driven approaches to identify patients most likely to benefit from PAI-1 inhibition. Looking ahead, rational combination regimens incorporating PAI-1 inhibitors with immune checkpoint blockade, anti-angiogenic therapies, or stroma-targeted interventions may hold the greatest promise. Integration of high-resolution technologies such as spatial transcriptomics and single-cell profiling will be critical to unravel the dynamic interplay between PAI-1, SASP factors, and extracellular matrix remodeling. Collectively, advancing PAI-1-directed therapies from experimental strategies to clinical application represents a compelling opportunity to overcome immune resistance, mitigate metastatic progression, and improve survival outcomes for patients with otherwise refractory skin cancers. 6. Limitations The clinical trials aiming to develop novel therapies targeting PAI-1 have so far been based solely on exploratory or preclinical data, with inherent limitations in sample size and follow-up duration. Moreover, since all cutaneous malignancies under investigation are rare cancers, stratification remains highly challenging due to difficulties in securing a sufficient number of cases. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, T.F. and Y.A.; methodology, T.F.; validation, T.F., Y.M. and Y.A.; writing—original draft preparation, T.F.; writing—review and editing, Y.M. and Y.A.; supervision, Y.A. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement No new data were created or analyzed in this study. Data sharing is not applicable to this article. Conflicts of Interest No financial support or relationships that could pose conflicts of interest for this study were received. Abbreviations The following abbreviations are used in this manuscript: AD Atopic dermatitis CAFs Cancer associated fibroblasts CAS Cutaneous angiosarcoma cSCC Cutaneous squamous cell carcinoma ECs Endothelial cells ECM Extracellular matrix HA Hyaluronic acid HS Hidradenitis suppurativa ICIs Immune checkpoints inhibitors MMP Matrix metalloproteinase MF Mycosis fungoides PAI-1 plasminogen activator inhibitor-1 PD-L1 programmed cell death ligand 1 SASP Senescence-associated secretory phenotype TAMs tumor-associated macrophage TKI Tyrosine kinase inhibitor TME Tumor microenvironment References 1. Placencio V.R. DeClerck Y.A. Plasminogen Activator Inhibitor-1 in Cancer: Rationale and Insight for Future Therapeutic Testing Cancer Res. 2015 75 2969 2974 10.1158/0008-5472.CAN-15-0876 26180080 PMC4613764 2. Iwaki T. Urano T. Umemura K. PAI-1, progress in understanding the clinical problem and its aetiology Br. J. Haematol. 2012 157 291 298 10.1111/j.1365-2141.2012.09074.x 22360729 3. Ohuchi K. Kambayashi Y. Hidaka T. Fujimura T. Plasminogen activating inhibitor-1 might be a predictive marker for the efficacy of anti-PD1 antibody in advanced melanoma patients Front. Oncol. 2021 11 798385 10.3389/fonc.2021.798385 34912726 PMC8666429 4. Hisada Y. Mackman N. Cancer-associated pathways and biomarkers of venous thrombosis Blood 2017 130 1499 1506 10.1182/blood-2017-03-743211 28807983 PMC5620413 5. Bajou K. Peng H. Laug W.E. Maillard C. Noel A. Foidart J.M. Martial J.A. DeClerck Y.A. Plasminogen activator inhibitor-1 protects endothelial cells from FasL-mediated apoptosis Cancer Cell 2008 14 324 334 10.1016/j.ccr.2008.08.012 18835034 PMC2630529 6. Bajou K. Maillard C. Jost M. Lijnen R.H. Gils A. Declerck P. Carmeliet P. Foidart J.M. Noel A. Host-derived plasminogen activator inhibitor-1 (PAI-1) concentration is critical for in vivo tumoral angiogenesis and growth Oncogene 2004 23 6986 6990 10.1038/sj.onc.1207859 15286708 7. Thapa B. Koo B.H. Kim Y.H. Kwon H.J. Kim D.S. Plasminogen activator inhibitor-1 regulates infiltration of macrophages into melanoma via phosphorylation of FAK-Tyr925 Biochem. Biophys. Res. Commun. 2014 450 1696 1701 10.1016/j.bbrc.2014.07.070 25063025 8. Tseng Y.J. Lee C.H. Chen W.Y. Kwon H.J. Kim D.S. Inhibition of PAI-1 Blocks PD-L1 Endocytosis and Improves the Response of Melanoma Cells to Immune Checkpoint Blockade J. Investig. Dermatol. 2021 141 2690 2698 10.1016/j.jid.2021.03.030 34000287 9. Ibrahim A. Fujimura T. Uno T. Terada T. Dan T. Ohta A. Miyata T. Ando K. Yahata T. Plasminogen activator inhibitor-1 promotes immune evasion in tumors by facilitating the expression of programmed cell death-ligand 1 Front. Immunol. 2024 15 1365894 10.3389/fimmu.2024.1365894 38779680 PMC11109370 10. Fujimura T. Yoshino K. Kato H. Fukushima S. Ishizuki S. Otsuka A. Matsushita S. Amagai R. Muto Y. Yamazaki E. A phase II multicentre study of plasminogen activator inhibitor-1 inhibitor (TM5614) plus nivolumab for treating anti-programmed cell death 1 antibody-refractory malignant melanoma: TM5614-MM trial Br. J. Dermatol. 2024 191 691 697 10.1093/bjd/ljae231 38833158 11. Takahashi N. Kameoka Y. Onizuka M. Onishi Y. Takahashi F. Dan T. Miyata T. Ando K. Harigae H. Deep molecular response in patients with chronic phase chronic myeloid leukemia treated with the plasminogen activator inhibitor-1 inhibitor TM5614 combined with a tyrosine kinase inhibitor Cancer Med. 2023 12 4250 4258 10.1002/cam4.5292 36151699 PMC9972105 12. Fujimura T. Yoshino K. Nakamura M. Kato H. Ito T. Maekawa T. Fujisawa Y. Matsushita S. Amagai R. Yamazaki E. Efficacy and safety of TM5614 in combination with paclitaxel in the treatment of paclitaxel-resistant cutaneous angiosarcoma: Phase II study protocol Exp. Dermatol. 2024 33 e14976 10.1111/exd.14976 37946551 13. Masuda T. Hirata T. Sakamoto T. Tsubata Y. Ichihara E. Kozuki T. Shoda H. Motonaga M. Yoshida T. Fukutani M. Treatment rationale and protocol design: An. investigator-initiated phase II study of combination treatment of nivolumab and TM5614, a PAI-1 inhibitor for previously treated patients with non-small cell lung cancer J. Thorac. Dis. 2024 16 3381 3388 10.21037/jtd-23-1858 38883673 PMC11170418 14. Bai X. Shoushtari A.N. Betof Warner A. Si L. Tang B. Cui C. Yang X. Wei X. Quach H.T. Cann C.G. Benefit and toxicity of programmed death-1 blockade vary by ethnicity in patients with advanced melanoma: An international multicentre observational study Br. J. Dermatol. 2022 187 401 410 10.1111/bjd.21241 35293617 15. Nakamura Y. Namikawa K. Yoshino K. Yoshikawa S. Uchi H. Goto K. Nakamura Y. Fukushima S. Kiniwa Y. Takenouchi T. Anti-PD1 checkpoint inhibitor therapy in acral melanoma: A multicenter study of 193 Japanese patients. Anti-PD1 checkpoint inhibitor therapy in acral melanoma: A multicenter study of 193 Japanese patients Ann. Oncol. 2020 31 1198 1206 10.1016/j.annonc.2020.05.031 32522691 16. Minowa T. Murata K. Mizue Y. Murai A. Nakatsugawa M. Sasaki K. Tokita S. Kubo T. Kanaseki T. Tsukahara T. Single-cell profiling of acral melanoma infiltrating lymphocytes reveals a suppressive tumor microenvironment Sci. Transl. Med. 2024 16 eadk8832 10.1126/scitranslmed.adk8832 39630887 17. Fujisawa Y. Yoshikawa S. Minagawa A. Takenouchi T. Yokota K. Uchi H. Noma N. Nakamura Y. Asai J. Kato J. Clinical and histopathological characteristics and survival analysis of 4594 Japanese patients with melanoma Cancer Med. 2019 8 2146 2156 10.1002/cam4.2110 30932370 PMC6536943 18. Hayward N.K. Wilmott J.S. Waddell N. Johansson P.A. Field M.A. Nones K. Patch A.M. Kakavand H. Alexandrov L.B. Burke H. Whole-genome landscapes of major melanoma subtypes Nature 2017 545 175 180 10.1038/nature22071 28467829 19. Blank C.U. Rozeman E.A. Fanchi L.F. Sikorska K. van de Wiel B. Kvistborg P. Krijgsman O. van den Braber M. Philips D. Broeks A. Neoadjuvant versus adjuvant ipilimumab plus nivolumab in macroscopic stage III melanoma Nat. Med. 2018 24 1655 1661 10.1038/s41591-018-0198-0 30297911 20. Tawbi H.A. Schadendorf D. Lipson E.J. Ascierto P.A. Matamala L. Castillo Gutiérrez E. Rutkowski P. Gogas H.J. Lao C.D. De Menezes J.J. Relatlimab and Nivolumab versus Nivolumab in Untreated Advanced Melanoma N. Engl. J. Med. 2022 386 24 34 10.1056/NEJMoa2109970 34986285 PMC9844513 21. Sadik A. Somarribas Patterson L.F. Öztürk S. Mohapatra S.R. Panitz V. Secker P.F. Pfänder P. Loth S. Salem H. Prentzell M.T. IL4I1 Is a Metabolic Immune Checkpoint that Activates the AHR and Promotes Tumor Progression Cell 2020 182 1252 1270 10.1016/j.cell.2020.07.038 32818467 22. Dummer R. Long G.V. Robert C. Tawbi H.A. Flaherty K.T. Ascierto P.A. Nathan P.D. Rutkowski P. Leonov O. Dutriaux C. Randomized Phase III Trial Evaluating Spartalizumab Plus Dabrafenib and Trametinib for BRAF J. Clin. Oncol. 2022 40 1428 1438 10.1200/JCO.21.01601 35030011 PMC9061149 23. Klein R.M. Bernstein D. Higgins S.P. Higgins C.E. Higgins P.J. SERPINE1 expression discriminates site-specific metastasis in human melanoma Exp. Dermatol. 2012 21 551 554 10.1111/j.1600-0625.2012.01523.x 22716255 PMC3383094 24. Masuda T. Hattori N. Senoo T. Akita S. Ishikawa N. Fujitaka K. Haruta Y. Murai H. Kohno N. SK-216, an inhibitor of plasminogen activator inhibitor-1, limits tumor progression and angiogenesis Mol. Cancer Ther. 2013 12 2378 2388 10.1158/1535-7163.MCT-13-0041 23990114 25. Pires da Silva I. Ahmed T. Reijers I.L.M. Weppler A.M. Betof Warner A. Patrinely J.R. Serra-Bellver P. Allayous C. Mangana J. Nguyen K. Ipilimumab alone or ipilimumab plus anti-PD-1 therapy in patients with metastatic melanoma resistant to anti-PD-(L)1 monotherapy: A multicentre, retrospective, cohort study Lancet Oncol. 2021 22 836 847 10.1016/S1470-2045(21)00097-8 33989557 26. VanderWalde A. Bellasea S.L. Kendra K.L. Khushalani N.I. Campbell K.M. Scumpia P.O. Kuklinski L.F. Collichio F. Sosman J.A. Ikeguchi A. Ipilimumab with or without nivolumab in PD-1 or PD-L1 blockade refractory metastatic melanoma: A randomized phase 2 trial Nat. Med. 2023 29 2278 2285 10.1038/s41591-023-02498-y 37592104 PMC10708907 27. Takahashi A. Namikawa K. Ogata D. Jinnai S. Nakano E. Yamazaki N. Updated analysis of nivolumab and ipilimumab combination therapy in Japanese patients with advanced melanoma J. Dermatol. 2023 50 525 535 10.1111/1346-8138.16669 36514836 28. Yamazaki E. Fujimura T. Takahashi-Watanabe M. Tada S. Kitayama C. Amagai R. Kambayashi Y. Watanabe M. Maekawa M. Mano N. Decreased serum levels of IL-4 correlate with the efficacy of the PAI-1 inhibitor TM5614 in patients with malignant melanoma refractory to anti-PD-1 antibodies: Post hoc study of TM5614-MM trial Br. J. Dermatol. 2024 192 167 169 10.1093/bjd/ljae343 39215562 29. Sappino A.P. Belin D. Huarte J. Hirschel-Scholz S. Saurat J.H. Vassalli J.D. Differential protease expression by cutaneous squamous and basal cell carcinomas J. Clin. Investig. 1991 88 1073 1079 10.1172/JCI115406 1918364 PMC295554 30. Wilkins-Port C.E. Higgins C.E. Freytag J. Higgins S.P. Carlson J.A. Higgins P.J. PAI-1 is a Critical Upstream Regulator of the TGF-beta1/EGF-Induced Invasive Phenotype in Mutant p53 Human Cutaneous Squamous Cell Carcinoma J. Biomed. Biotechnol. 2007 2007 85208 10.1155/2007/85208 17515947 PMC1868077 31. Mizrahi A. Barzilai A. Gur-Wahnon D. Ben-Dov I.Z. Glassberg S. Meningher T. Elharar E. Masalha M. Jacob-Hirsch J. Tabibian-Keissar H. Alterations of microRNAs throughout the malignant evolution of cutaneous squamous cell carcinoma: The role of miR-497 in epithelial to mesenchymal transition of keratinocytes Oncogene 2018 37 218 230 10.1038/onc.2017.315 28925390 32. Shaikh S.B. Balaya R.D.A. Dagamajalu S. Bhandary Y.P. Unwalla H. Prasad T.S.K. Rahman I. A signaling pathway map of plasminogen activator inhibitor-1 (PAI-1/SERPINE-1): A review of an innovative frontier in molecular aging and cellular senescence Cell Commun. Signal 2024 22 544 10.1186/s12964-024-01910-5 39543686 PMC11566301 33. Salminen A. Cooperation between inhibitory immune checkpoints of senescent cells with immunosuppressive network to promote immunosenescence and the aging process Ageing Res. Rev. 2025 106 102694 10.1016/j.arr.2025.102694 39984130 34. Giroud J. Delvaux P. Carlier L. De Schutter C. Martin N. Rouget R. Bolouki A. De Glas V. Bouriez I. Bourdoux F. Targeting ATF6alpha Attenuates UVB-Induced Senescence and Improves Skin Homeostasis by Regulating IL8 Expression Aging Cell 2025 24 e70024 10.1111/acel.70024 40241256 PMC12151886 35. Wu J. Wang J. Pei Z. Zhu Y. Zhang X. Zhou Z. Ye C. Song M. Hu Y. Xue P. Endothelial senescence induced by PAI-1 promotes endometrial fibrosis Cell Death Discov. 2025 11 89 10.1038/s41420-025-02377-0 40050610 PMC11885584 36. Yamazaki E. Fujimura T. Takahashi-Watanabe M. Amagai R. Tamabuchi E. Oka K. Kambayashi Y. Hashimoto A. Omori R. Takahashi T. An Evaluation of Prognostic Factors in Cutaneous Squamous Cell Carcinoma: A Single-Center Study of 237 Japanese Cases J. Clin. Med. 2025 14 1243 10.3390/jcm14041243 40004774 PMC11856698 37. Meier C. Brieger A. The role of IL-8 in cancer development and its impact on immunotherapy resistance Eur. J. Cancer 2025 218 115267 10.1016/j.ejca.2025.115267 39899909 38. Alfaro C. Teijeira A. Oñate C. Pérez G. Sanmamed M.F. Andueza M.P. Alignani D. Labiano S. Azpilikueta A. Rodriguez-Paulete A. Tumor-Produced Interleukin-8 Attracts Human Myeloid-Derived Suppressor Cells and Elicits Extrusion of Neutrophil Extracellular Traps (NETs) Clin. Cancer Res. 2016 22 3924 3936 10.1158/1078-0432.CCR-15-2463 26957562 39. Zhang Y.P. Guo Z.Q. Cai X.T. Rong Z.X. Fang Y. Chen J.Q. Zhuang K.M. Ruan M.J. Ma S.C. Lin L.Y. PAI-1-driven SFRP2(high) cancer-associated fibroblasts hijack the abscopal effect of radioimmunotherapy Cancer Cell 2025 43 856 874 10.1016/j.ccell.2025.02.024 40086438 40. Che Y. Wang J. Li Y. Lu Z. Huang J. Sun S. Mao S. Lei Y. Zang R. Sun N. Cisplatin-activated PAI-1 secretion in the cancer-associated fibroblasts with paracrine effects promoting esophageal squamous cell carcinoma progression and causing chemoresistance Cell Death Dis. 2018 9 759 10.1038/s41419-018-0808-2 29988148 PMC6037765 41. Foekens J.A. Peters H.A. Look M.P. Portengen H. Schmitt M. Kramer M.D. Brünner N. Jänicke F. Meijer-van Gelder M.E. Henzen-Logmans S.C. The urokinase system of plasminogen activation and prognosis in 2780 breast cancer patients Cancer Res. 2000 60 636 643 10676647 42. Bagaria S.P. Gatalica Z. Maney T. Serie D. Parasramka M. Attia S. Krishna M. Joseph R.W. Association Between Programmed Death-Ligand 1 Expression and the Vascular Endothelial Growth Factor Pathway in Angiosarcoma Front. Oncol. 2018 8 71 10.3389/fonc.2018.00071 29623256 PMC5874284 43. Thiebaud J.A. Ravi V. Litwin S. Schuetze S.M. Movva S. Agulnik M. Kraft A.S. Tetzlaff E.D. Somaiah N. von Mehren M. OER-073: A multicenter phase 2 study evaluating the role of pazopanib in angiosarcoma Cancer 2022 128 3516 3522 10.1002/cncr.34403 35942596 PMC9616178 44. Jones R.L. Ravi V. Brohl A.S. Chawla S. Ganjoo K.N. Italiano A. Attia S. Burgess M.A. Thornton K. Cranmer L.D. Efficacy and Safety of TRC105 Plus Pazopanib vs Pazopanib Alone for Treatment of Patients with Advanced Angiosarcoma: A Randomized Clinical Trial JAMA Oncol. 2022 8 740 747 10.1001/jamaoncol.2021.3547 35357396 PMC8972152 45. Ohuchi K. Amagai R. Ikawa T. Muto Y. Roh Y. Endo J. Maekawa T. Kambayashi Y. Asano Y. Fujimura T. Plasminogen activating inhibitor-1 promotes angiogenesis in cutaneous angiosarcomas Exp. Dermatol. 2023 32 50 59 10.1111/exd.14681 36168721 46. Fjæstad K.Y. Rømer A.M.A. Goitea V. Johansen A.Z. Thorseth M.L. Carretta M. Engelholm L.H. Grøntved L. Junker N. Madsen D.H. Blockade of beta-adrenergic receptors reduces cancer growth and enhances the response to anti-CTLA4 therapy by modulating the tumor microenvironment Oncogene 2022 41 1364 1375 10.1038/s41388-021-02170-0 35017664 PMC8881216 47. Wagner M.J. Cranmer L.D. Loggers E.T. Pollack S.M. Propranolol for the treatment of vascular sarcomas J. Exp. Pharmacol. 2018 10 51 58 10.2147/JEP.S146211 30233257 PMC6130307 48. Mehta-Shah N. Horwitz S.M. Ansell S. Ai W.Z. Barnes J. Barta S.K. Clemens M.W. Dogan A. Fisher K. Goodman A.M. NCCN Guidelines Insights: Primary Cutaneous Lymphomas, Version 2.2020 J. Natl. Compr. Canc Netw. 2020 18 522 536 10.6004/jnccn.2020.0022 32380458 49. Vonderheid E.C. Hamilton R.G. Kadin M.E. Mycosis Fungoides and Its Relationship to Atopy, Serum Total IgE, and Eosinophil Counts Clin. Lymphoma Myeloma Leuk. 2021 21 279 288 10.1016/j.clml.2020.11.007 33342729 50. Ha Y.J. Tak K.H. Lee J.L. Kim C.W. Ah Y.C. Kim S.S. Moon I.J. Yoon Y.S. Polynucleotides Enhance Skin Barrier Function and Reduce Inflammation in a 2,4-Dinitrochlorobenzene-Induced Mouse Model of Atopic Dermatitis Skin. Res. Technol. 2025 31 e70189 10.1111/srt.70189 40484710 PMC12145983 51. Patil K. Kuttikrishnan S. Khan A.Q. Ahmad F. Alam M. Buddenkotte J. Ahmad A. Steinhoff M. Uddin S. Molecular pathogenesis of Cutaneous T cell Lymphoma: Role of chemokines, cytokines, and dysregulated signaling pathways Semin. Cancer Biol. 2022 86 382 399 10.1016/j.semcancer.2021.12.003 34906723 52. Bogdanowicz P. Bensadoun P. Noizet M. Béganton B. Philippe A. Alvarez-Georges S. Doat G. Tourette A. Bessou-Touya S. Lemaitre J.M. Senomorphic activity of a combination of niacinamide and hyaluronic acid: Correlation with clinical improvement of skin aging Sci. Rep. 2024 14 16321 10.1038/s41598-024-66624-7 39009698 PMC11251187 53. Ikawa T. Yamazaki E. Amagai R. Kambayashi Y. Sekine M. Takahashi T. Asano Y. Fujimura T. Impact of Hyaluronic Acid on the Cutaneous T-Cell Lymphoma Microenvironment: A Novel Anti-Tumor Mechanism of Bexarotene Cancers 2025 17 324 10.3390/cancers17020324 39858106 PMC11764198 54. Zheng B.W. Wang B.Y. Xiao W.L. Sun Y.J. Yang C. Zhao B.T. Different molecular weight hyaluronic acid alleviates inflammation response in DNFB-induced mice atopic dermatitis and LPS-induced RAW 264.7 cells Life Sci. 2022 301 120591 10.1016/j.lfs.2022.120591 35513086 55. Fujimura T. Ohuchi K. Ikawa T. Kambayashi Y. Amagai R. Furudate S. Asano Y. Plasminogen activator inhibitor-1 promote angiogenesis through matrix metalloproteinase 9 in advanced mycosis fungoides Hematol. Oncol. 2024 42 e3244 10.1002/hon.3244 38287534 56. Zuo Y. Huang L. Enkhjargal B. Xu W. Umut O. Travis Z.D. Zhang G. Tang J. Liu F. Zhang J.H. Activation of retinoid X receptor by bexarotene attenuates neuroinflammation via PPARgamma/SIRT6/FoxO3a pathway after subarachnoid hemorrhage in rats J. Neuroinflamm. 2019 16 47 10.1186/s12974-019-1432-5 30791908 PMC6385420 57. Adhikary K. Paul A. Madan A. Islam A. Ashique S. Ramzan M. Personalized precision: Revolutionizing cancer treatment with mRNA-based vaccines in melanoma therapy Adv. Immunol. 2025 166 137 167 40738542 10.1016/bs.ai.2024.10.011 58. Wolchok J.D. Chiarion-Sileni V. Rutkowski P. Cowey C.L. Schadendorf D. Wagstaff J. Queirolo P. Dummer R. Butler M.O. Hill A.G. Final, 10-Year Outcomes with Nivolumab plus Ipilimumab in Advanced Melanoma N. Eng. J. Med. 2025 392 11 22 10.1056/NEJMoa2407417 PMC12080919 39282897 59. Bai X. Lawless A.R. Czapla J.A. Gerstberger S.C. Park B.C. Jung S. Johnson R. Yamazaki N. Ogata D. Umeda Y. Benefit, recurrence pattern, and toxicity to adjuvant anti-PD-1 monotherapy varies by ethnicity and melanoma subtype: An international multicenter cohort study JAAD Int. 2024 15 105 114 10.1016/j.jdin.2023.11.014 38500872 PMC10945245 60. Bai X. Attrill G.H. Gide T.N. Ferguson P.M. Nahar K.J. Shang P. Vergara I.A. Palendira U. da Silva I.P. Carlino M.S. Stroma-infiltrating T cell spatiotypes define immunotherapy outcomes in adolescent and young adult patients with melanoma Nat. Commun. 2024 15 3014 10.1038/s41467-024-47301-9 38589406 PMC11002019 61. He Q. Xiang L. Luo Y. Wang R. Zheng C. Gao Y. Yao H. Tumor-associated macrophages in colon cancer immunotherapy: Mechanisms, natural product interventions, and microenvironment remodeling Front. Immunol. 2025 16 1642091 10.3389/fimmu.2025.1642091 40873588 PMC12378638 62. Ye Z. Yi J. Jiang X. Shi W. Xu H. Cao H. Qin L. Liu L. Wang T. Ma Z. Gastric cancer-derived exosomal let-7 g-5p mediated by SERPINE1 promotes macrophage M2 polarization and gastric cancer progression J. Exp. Clin. Cancer Res. 2025 44 2 10.1186/s13046-024-03269-4 39748408 PMC11694445 63. Sturniolo I. Váróczy C. Regdon Z. Mázló A. Muzsai S. Bácsi A. Intili G. Hegedűs C. Boothby M.R. Holechek J. PARP14 Contributes to the Development of the Tumor-Associated Macrophage Phenotype Int. J. Mol. Sci. 2024 25 3601 10.3390/ijms25073601 38612413 PMC11011797 64. Li Y. Shi Y. Zhang X. Li P. Ma L. Hu P. Xu L. Dai Y. Xia S. Qiu H. FGFR2 upregulates PAI-1 via JAK2/STAT3 signaling to induce M2 polarization of macrophages in colorectal cancer Biochim. Biophys. Acta Mol. Basis Dis. 2023 1869 166665 10.1016/j.bbadis.2023.166665 36781088 65. Yin H. Zhang X. Yang P. Zhang X. Peng Y. Li D. Yu Y. Wu Y. Wang Y. Zhang J. RNA m6A methylation orchestrates cancer growth and metastasis via macrophage reprogramming Nat. Commun. 2021 12 1394 10.1038/s41467-021-21514-8 33654093 PMC7925544 66. Noonepalle S.K.R. Gracia-Hernandez M. Aghdam N. Berrigan M. Coulibaly H. Li X. Zevallos-Delgado C. Pletcher A. Weselman B. Palmer E. Cell therapy using ex vivo reprogrammed macrophages enhances antitumor immune responses in melanoma J. Exp. Clin. Cancer Res. 2024 43 263 10.1186/s13046-024-03182-w 39272209 PMC11401321 67. Chen S. Wang M. Lu T. Liu Y. Hong W. He X. Cheng Y. Liu J. Wei Y. Wei X. JMJD6 in tumor-associated macrophage regulates macrophage polarization and cancer progression via STAT3/IL-10 axis Oncogene 2023 42 2737 2750 10.1038/s41388-023-02781-9 37567973 PMC10491492 68. Zhu C. Liu H. Li Z. Shi Y. Zhao J. Bai Y. Chen Q. Li W. Prognostic Significance and Therapeutic Potential of SERPINE1 in Head and Neck Squamous Cell Carcinoma Cancer Med. 2025 14 e70605 10.1002/cam4.70605 39817507 PMC11736624 69. Kubala M.H. Punj V. Placencio-Hickok V.R. Fang H. Fernandez G.E. Sposto R. DeClerck Y.A. Plasminogen Activator Inhibitor-1 Promotes the Recruitment and Polarization of Macrophages in Cancer Cell Rep. 2018 25 2177 2191 10.1016/j.celrep.2018.10.082 30463014 PMC6876299 70. Romano V. Belviso I. Venuta A. Ruocco M.R. Masone S. Aliotta F. Fiume G. Montagnani S. Avagliano A. Arcucci A. Influence of Tumor Microenvironment and Fibroblast Population Plasticity on Melanoma Growth, Therapy Resistance and Immunoescape Int. J. Mol. Sci. 2021 22 5283 10.3390/ijms22105283 34067929 PMC8157224 71. Omland S.H. Wettergren E.E. Mollerup S. Asplund M. Mourier T. Hansen A.J. Gniadecki R. Cancer associated fibroblasts (CAFs) are activated in cutaneous basal cell carcinoma and in the peritumoural skin BMC Cancer 2017 17 675 10.1186/s12885-017-3663-0 28987144 PMC5806272 72. Wongm P.F. Wei W. Gupta S. Smithy J.W. Zelterman D. Kluger H.M. Rimm D.L. Multiplex quantitative analysis of cancer-associated fibroblasts and immunotherapy outcome in metastatic melanoma J. Immunother. Cancer 2019 7 194 10.1186/s40425-019-0675-0 31337426 PMC6651990 73. Forsthuber A. Aschenbrenner B. Korosec A. Jacob T. Annusver K. Krajic N. Kholodniuk D. Frech S. Zhu S. Purkhauser K. Cancer-associated fibroblast subtypes modulate the tumor-immune microenvironment and are associated with skin cancer malignancy Nat. Commun. 2024 15 9678 10.1038/s41467-024-53908-9 39516494 PMC11549091 74. Papaccio F. Kovacs D. Bellei B. Caputo S. Migliano E. Cota C. Picardo M. Profiling Cancer-Associated Fibroblasts in Melanoma Int. J. Mol. Sci. 2021 22 7255 10.3390/ijms22147255 34298873 PMC8306538 75. Aronovich A. Moyal L. Gorovitz B. Amitay-Laish I. Naveh H.P. Forer Y. Maron L. Knaneh J. Ad-El D. Yaacobi D. Cancer-Associated Fibroblasts in Mycosis Fungoides Promote Tumor Cell Migration and Drug Resistance through CXCL12/CXCR4 J. Investig. Dermatol. 2021 141 619 627 10.1016/j.jid.2020.06.034 32795528 76. Wei W.F. Zhou H.L. Chen P.Y. Huang X.L. Huang L. Liang L.J. Guo C.H. Zhou C.F. Yu L. Fan L.S. Cancer-associated fibroblast-derived PAI-1 promotes lymphatic metastasis via the induction of EndoMT in lymphatic endothelial cells J. Exp. Clin. Cancer Res. 2023 42 160 10.1186/s13046-023-02714-0 37415190 PMC10324144 77. Masuda T. Nakashima T. Namba M. Yamaguchi K. Sakamoto S. Horimasu Y. Miyamoto S. Iwamoto H. Fujitaka K. Miyata Y. Inhibition of PAI-1 limits chemotherapy resistance in lung cancer through suppressing myofibroblast characteristics of cancer-associated fibroblasts J. Cell Mol. Med. 2019 23 2984 2994 10.1111/jcmm.14205 30734495 PMC6433668 78. Chen S. Morine Y. Tokuda K. Yamada S. Saito Y. Nishi M. Ikemoto T. Shimada M. Cancer-associated fibroblast-induced M2-polarized macrophages promote hepatocellular carcinoma progression via the plasminogen activator inhibitor-1 pathway Int. J. Oncol. 2021 59 59 10.3892/ijo.2021.5239 34195849 PMC8253588 Figure 1 The multiple tumor-promoting functions of PAI-1 in melanoma. Figure 2 PAI-1 promotes metastasis in cSCC. biomolecules-15-01317-t001_Table 1 Table 1 Summary for tumor-promoting effects of PAI-1.  Tumor Promoting Effects of PAI-1 Possible Add-On Medication for TM5614 Melanoma increase PD-L1 nivolumab sPD-L1 ratio of Tregs pembrolizumab decrease number of TAMs number of CAFs other anti-PD-1 Ab cytotoxic function of T cells cSCC induced by p53 mutant cisplatin Smad 2/3 signal activate p53/p21 pathway oxaliplatin LRP1/p65 signal increase IL-6, IL-8, other SASP radioimmunotherapy MMPs CAS increase IL-23p19, VEGF-C, CXCL5 paclitaxel VEGF signal activate Fas-L mediated apoptosis pazopanib p53/p21 signal MF induced by hyalronic acid mediated SASP bexarotene ",
  "metadata": {
    "Title of this paper": "Cancer-associated fibroblast-induced M2-polarized macrophages promote hepatocellular carcinoma progression via the plasminogen activator inhibitor-1 pathway",
    "Journal it was published in:": "Biomolecules",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12467915/"
  }
}