{
  "title": "Paper_1084",
  "abstract": "pmc Dent J (Basel) Dent J (Basel) 3384 dentj dentistry Dentistry Journal 2304-6767 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468743 PMC12468743.1 12468743 12468743 41002709 10.3390/dj13090436 dentistry-13-00436 1 Article Salivary Biomarker Analysis to Distinguish Between Health and Periodontitis Status: A Preliminary Study https://orcid.org/0000-0001-9776-5138 Bertoldi Carlo Formal analysis Writing – original draft Data curation Project administration Conceptualization Methodology Investigation Writing – review & editing Funding acquisition Visualization Validation Supervision Resources 1 † https://orcid.org/0000-0003-3079-8001 Nasi Milena Conceptualization Formal analysis Writing – review & editing Data curation Methodology Investigation 1 † https://orcid.org/0000-0002-7998-115X Salvatori Roberta Writing – original draft Formal analysis Methodology Investigation Writing – review & editing Validation Visualization Data curation 2 * † https://orcid.org/0000-0001-9118-1262 Pinti Marcello Conceptualization Formal analysis Investigation Writing – review & editing Data curation 3 † https://orcid.org/0000-0002-4421-5527 Montagna Silvia Validation Formal analysis Visualization 4 https://orcid.org/0000-0002-2743-0137 Tonetti Maurizio Conceptualization Formal analysis 5 6 7 8 https://orcid.org/0000-0003-3764-7046 Generali Luigi Validation Investigation Formal analysis Visualization 1 https://orcid.org/0000-0002-6801-0446 Bellei Elisa Validation Visualization Writing – review & editing Formal analysis Investigation Data curation Methodology 1 † https://orcid.org/0000-0003-1241-385X Zaffe Davide Formal analysis Writing – review & editing Data curation 9 https://orcid.org/0009-0004-9603-2396 Selleri Valentina Methodology Investigation Data curation 3 † https://orcid.org/0000-0003-1020-9580 Bergamini Stefania Conceptualization Formal analysis Methodology Data curation Investigation Writing – review & editing Visualization 1 † Garcia-Denche Jesus Torres Academic Editor 1 carlo.bertoldi@unimore.it milena.nasi@unimore.it luigi.generali@unimore.it elisa.bellei@unimore.it stefania.bergamini@unimore.it 2 3 marcello.pinti@unimore.it valentina.selleri@unimore.it 4 silvia.montagna@unimore.it 5 maurizio.tonetti@shsmu.edu.cn 6 7 8 9 davide.zaffe@unimore.it * roberta.salvatori@unimore.it † These authors contributed equally to this work. 22 9 2025 9 2025 13 9 497630 436 01 8 2025 12 9 2025 15 9 2025 22 09 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Objective: Methods: Results: Conclusions: periodontitis periodontal therapy periodontitis biomarker matrix metalloproteinase inflammation cytokine University of Modena and Reggio Emilia, Modena, Italy FAR 2022 This research was funded by the University Research Fund (FAR 2022), University of Modena and Reggio Emilia, Modena, Italy. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Periodontitis (PRD) is one of the most prevalent dysbiotic oral diseases triggered by microbial ecosystems. It involves severe chronic inflammation, clinical attachment loss, and alveolar bone resorption and can ultimately lead to tooth loss [ 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 Among the most important clinical discoveries of the last few decades is the involvement of the immune system and inflammatory processes in a wide range of health problems that dominate global morbidity and mortality [ 17 18 Furthermore, chronic inflammatory diseases have been identified as the leading cause of over 50% of all deaths worldwide [ 19 The risk of developing chronic inflammation is traced back to early development, with effects now known to persist throughout the lifespan, affecting adult health, causing disability, and even increasing the risk of mortality [ 20 5 18 21 22 23 24 25 26 27 The major share of periodontal and systemic damage induced by PRD is attributed to chronic inflammation [ 18 28 29 30 31 32 Despite what is already known, the diagnosis of PRD is still mainly established through clinical criteria. Periodontal attachment loss and the detection of periodontal pockets—clinical manifestations of PRD—are the primary clinical findings on which the diagnosis is based. This is due to the lack of reliable pathogenic criteria tied to a specific molecular network that is strictly and uniquely correlated with the disease [ 33 34 35 The current gap in understanding the pathogenesis of PRD leads to three significant consequences. First, PRD diagnosis is based on the presence of established, clinically evident, and irreversible pathological changes (i.e., the damage is not preventable). Second, periodontal therapy is primarily targeted at dysbiotic ecosystems—those that trigger PRD—but does not address the host response or modify the periodontopathic inflammatory diathesis. Third, the diagnosis should be carried out exclusively by experienced operators; otherwise, it becomes largely subjective, relying on periodontal probing due to the absence of a molecular network that could serve as an objective marker for PRD. Salivary matrix metalloproteinase-8 (MMP-8) is currently considered a promising marker for both the diagnosis and treatment of PRD [ 14 15 36 37 38 PRD tissue damage is most likely driven by the onset of acute inflammation, which fails to resolve, thus becoming chronic. Therefore, evaluating a set of molecules closely linked to PRD—molecules involved in the initiation and resolution of the inflammatory process—could help to characterize a reliable early diagnostic molecular network. Such a network could potentially anticipate the onset of periodontal damage and enhance our understanding of PRD pathogenesis. By assessing the periodontal immuno-inflammatory network, the current diagnostic guidelines based on clinical parameters may improve their predictive ability. This pathway would be grounded in molecular network analysis, which would also provide additional benefits in terms of patient care, particularly by offering a minimally invasive method to facilitate early diagnosis. Thus, the aim of this study is to explore the feasibility of using the local molecular network to discriminate between health and PRD and use such information to develop and test a practical diagnostic tool in future studies. 2. Materials and Methods This clinical study was performed at the Modena University Hospital, Periodontology Unit of Dentistry and Oral-Maxillofacial Surgery, 41124 Modena, Italy. All procedures were approved and supervised by the local ethical committee of the Health Service of the Emilia-Romagna region (University-Hospital of Modena- protocol nr 3968/2017, registration nr 315/17 and subsequent substantial amendment protocol AOU 0026796/22). Enrolled subjects signed informed consent detailing all procedures of the study, as requested by the Helsinki protocols [ 39 Subjects referred for dental and periodontal evaluation were selected between January 2023 and February 2024. 2.1. Participants Patients in good general health were screened. Inclusion criteria were as follows: 18 years or older, non-pregnant or lactating, non-smokers, no history of alcohol abuse, medical history of good health. Exclusion criteria comprised the following: bone disease, systemic or local inflammatory or infectious conditions (excluding periodontitis), use of anti-inflammatory drugs, uncontrolled or poorly controlled diabetes, unstable or life-threatening conditions, edentulous adults, use of antibiotics within the previous 3 months, and receipt of professional periodontal treatment (other than supragingival cleaning) within the previous 12 months [ 40 41 34 35 35 2.2. Clinical Measurements Clinical measurements for periodontal charting were taken by an independent, trained, and experienced examiner (L.G.). Periodontal charting was performed using a periodontal probe (PCP-UNC 15 tip, Hu-Friedy, Chicago, IL, USA), to the nearest millimeter, and radiological status was assessed when indicated [ 34 35 Full-mouth plaque score (FMPS), assessed by plaque disclosing gel, was recorded as the percentage of total surfaces (six aspects per tooth) displaying the presence of plaque. Bleeding on probing (BoP) was assessed dichotomously using a periodontal probe with 1-millimeter marks (modified Click-Probe, Kerr Corp., Bioggio, Switzerland), and full-mouth bleeding score (FMBS) was then calculated (six aspects per tooth) [ 42 Probing pocket depth (PPD) and gingival recession depth (REC) were recorded to the nearest millimeter. Clinical attachment level (CAL) was calculated as the sum of PPD and REC [ 4 43 2.3. Periodontal Procedures Dental and periodontal conditions were assessed and treated according to the individual needs and requirements of each patient. The first phase aimed to guide behavior change by motivating the patient. It included patient evaluation, case history, and dental screening. Emergencies, such as pulpitis or dental abscess, were treated. At this stage, a distinction was made between subjects with periodontal health and those with severe PRD (Stage III/IV). Afterwards, periodontal charting and periodontal diagnostic-quality radiographs (when appropriate) were performed at TP0, for both G1 and G2 patients. At TP1, these were performed only for G2 patients. TP0 was considered the baseline. At TP0, patients were enrolled and signed the informed consent if they met all requirements. Periodontal indices and salivary samples were taken at TP0 for both G1 and G2 patients, and at TP1 only for G2 patients. The periodontal therapy, aimed to guide behavioral changes by motivating patients to effectively remove dental biofilm and control periodontal risk factors (by reducing or eliminating them) through supragingival and subgingival non-surgical periodontal therapy (NSPT), was performed by a single experienced periodontist (CB), in accordance with the Clinical Practice Guidelines [ 2 44 45 46 After 180 days following the completion of the NSPT, which was only performed on G2 patients, an oral evaluation, complete with periodontal charting and salivary sample collection, was executed again at TP1 ( Figure 1 2.4. Salivary Sample Collection Salivary samples were collected at baseline (TP0) and after periodontal treatment of G2 (TP1). The collection was performed by a SalivaBio oral saliva swab (Salimetrics, State College, PA, USA). Subjects were required to avoid eating, consuming sugary drinks, fruit juices, carbonated beverages, coffee, or alcohol for at least 8 h. They were allowed to drink water when thirsty but were instructed to avoid excessive intake. Additionally, subjects had to refrain from drinking, brushing their teeth, or using mouthwash for at least 30 min prior to the test. The salivary collection was administered to the participants by a trained periodontist (CB), following the manufacturer’s instructions through the following steps: (a) a 30 s rinse with tap water; (b) a 60 s wait after the rinse; (c) intraoral positioning of proprietary and sterile salivary rollers; (d) collection of rollers in proprietary salivary storage tubes. The samples were immediately centrifuged at 1500× g 2.5. Matrix Metalloproteinase-8 Protein (MMP-8) Assay For MMP-8, quantification was performed using the Quantikine ® The obtained absorbance values (OD at 540 nm) for all samples fell within the dynamic range defined by the standard curve, and none were below the average detection limit (0.013 ng/mL); therefore, all samples were considered accurate for analysis. The MMP-8 Immunoassay (Quantikine ® 47 48 2.6. Cytokine Immunological Assay Cytokine concentrations were obtained using the Simple Plex™ ELLA platform (ProteinSimple), which automatically generates calibration curves within each cartridge, and all sample values were found to be above the respective detection thresholds. Before the test, the samples were thawed and centrifuged at 4 °C for 15 min at 12,000 rpm. Salivary samples were diluted 1:2 in sample diluent (ProteinSimple). Fifty microliters of the mixture from each salivary sample were loaded into the multi-analyte cartridge for the simultaneous measurement of cytokines (IL-1β, IL-4, IL-6, IL-8, IL-10) and IFN-α using the automated platform “Simple Plex ELLA” (ProteinSimple, Bio-Techne, Minneapolis, MN, USA) [ 49 50 All cytokine measurements were performed in duplicate using the same batch of reagents. Standard curves generated from known concentrations provided in the assay kits, along with a blank (zero control), were used for calibration. The intra-assay coefficients of variation were <10% for all analytes, indicating good reproducibility. 2.7. Study Outcomes Primary outcomes included characterizing an effective local molecular network to distinguish between healthy individuals and those with PRD and using this information to develop and evaluate a practical diagnostic test in future studies. The secondary outcomes were to obtain effective indications for PRD treatment and improve the pathogenic knowledge of PRD. 2.8. Statistical Analysis Data were expressed as mean (M) ± standard deviation (SD), standard error (SE), and median to describe the sample distribution [ 51 0 p Additionally, we examined the correlation between each clinical index–biomarker pair using Spearman’s rank correlation ( ρ 0 p Finally, to analyze the biomarker network relevant to oral health, we performed a cluster analysis using the k-means algorithm to identify natural groupings of salivary biomarkers and clinical indices. Biomarkers and clinical indices grouped within the same cluster may share underlying biological relationships, suggesting they co-vary across individuals. This co-occurrence could indicate that certain biomarkers reflect or predict clinical measures of disease severity. We also applied linear regression (LR) analysis, fitting LR models separately for each group (G1, G2 at TP0, and G2 at TP1), with each clinical index as the outcome and all biomarkers as predictors. Categorical and continuous variables (mean ± SD), collected at TP0 and TP1, were coded and entered into a spreadsheet by a single blinded author (E.B.). To investigate associations between the seven biomarkers and periodontal health status (healthy controls—G1; untreated PRD patients—G2 at TP0; PRD patients after treatment—G2 at TP1), we first fitted a multivariate logistic regression model with disease status as the outcome and all seven biomarkers as predictors. All covariates were standardized (mean-centered and scaled to unit variance) to facilitate coefficient interpretation and improve numerical stability. Diagnostic testing using the “detect separation” package in R was conducted to assess model fit. If the results confirmed the presence of complete separation, indicating that one or more biomarkers perfectly distinguished between outcome groups, this resulted in unreliable or infinite coefficient estimates in the multivariate model. To address this issue while retaining interpretability, we conducted univariate logistic regression analyses for each standardized biomarker. To assess classification performance, we performed ROC curve analysis using the “pROC” package in R. Each ROC curve represents the diagnostic ability of a single biomarker to distinguish between PRD cases (G2 at TP0), PRD after treatment (G2 at TP1), and healthy controls (G1), based on predicted probabilities from the corresponding univariate model. The area under the curve (AUC) quantifies overall classification accuracy, with higher AUC values indicating better performance. These ROC curves provide both visual and quantitative assessments of each biomarker’s potential utility as a standalone indicator of PRD. All the statistical analyses were performed by a single blinded statistician (S.M.). Statistical analyses were performed with the pROC (version 1.19.0.1) [ 52 53 54 3. Results 3.1. Examiner Calibration In the pre-experimental period, the examiner’s calibration procedures were performed through a clinical periodontal evaluation of six participants. The periodontal parameters considered were obtained on two separate occasions (14-day intervals). Data were tabulated and submitted to the Spearman correlation coefficient test. The obtained values were 0.89 ÷ 0.99 (i.e., excellent concordance). 3.2. Descriptive Clinical Analysis The study included 26 participants drawn from 32 consecutive potential patients. Of the 32 potential patients, two did not provide informed consent to participate in the study, three revealed they had taken antibiotics, and one did not attend the follow-up due to relocating for work in another city. G1 consisted of 16 patients, aged 24.9 ± 4.53 years (range 18–32 years). All the patients had 28 teeth (wisdom teeth were excluded from the count). The FMPS and FMBS were 8.13 ± 6.03% (M ± SD) and 3.63 ± 3.12%, respectively. G1 patients were periodontally healthy (EFP), so the CAL was 0 in all cases. The mean probing depth (MPD) was 1.24 ± 0.15 mm. They did not show any periodontal pocket, and FMBS < 10%. G1 patients did not suffer from PRD or gingivitis; therefore, no specific periodontal treatment was implemented to treat these patients, so they were considered only at TP0. G2 consisted of 10 non-smoker patients. G2 patients were 52.2 ± 8.28 years of age (range 43–66). G2 patients had 25.6 ± 4.30 teeth (wisdom teeth excluded) per patient and suffered from periodontitis stage 3 or 4 (five in the third and five in the fourth stage). In all cases, they showed grade C PRD. At TP0, FMPS and FMBS were 41.10 ± 22.20% and 33.80 ± 15.34%, respectively. The MPD and MAL were 2.63 ± 0.65 mm and 3.56 ± 0.75 mm, respectively. G2 patients showed 190 pockets with PPD ≥ 5 mm, and their NPP5 was 19.00 ± 12.76. At TM1, FMPS and FMBS were 20.72 ± 9.68% and 16.90 ± 10.82%, respectively. The MPD and the MAL were 1.94 ± 0.42 mm and 2.95 ± 0.67 mm, respectively. At TP1, G2 patients had 73 pockets with PPD ≥ 5 mm, with an NPP5 value of 7.3 ± 11.12. Both FMPS and FMBS were significantly higher in G2 patients at TP0 vs. G1 ( p Table 1 p Table 1 MPD and MAL were significantly lower in healthy controls (G1) compared to G2 patients at TP0 and TP1 and significantly higher in G2 patients at TP0 compared to TP1. Therefore, all these periodontal indices significantly decreased after NSPT ( Table 1 The full-mouth mean reduction observed after the NSPT was 0.7 mm, and the mean clinical attachment gain (CAL-gain) was 0.6 mm, whereas in deeper pockets (≥5 mm), a mean reduction in pocket depth of 2.4 mm was observed. The NSPT therapy was effective in reducing most of the periodontal pockets; the PPD reduction amount resulted directly correlated to the baseline (TP0) PPD, and on the contrary, the pocket closure was more frequent in shallower than deeper pockets. However, 117 pockets ≥ 5 mm, 61.58% of the overall pockets with PPD ≥ 5 mm at TP0 in G2 patients, became shallower (<5 mm) or closed after NSPT. In addition, an overall proportion of pocket closure of about 70% was observed. 3.3. Matrix Metalloproteinase-8 Protein (MMP-8) Assay Levels of MMP-8, one of the molecules mostly considered to obtain an objective diagnosis of PRD, were first measured ( Figure 2 Figure 2 Statistical analysis revealed significant differences in the mean MMP-8 levels between G1 and G2 patients at TP0 ( p p Furthermore, correlation analysis showed a significant negative correlation between MMP-8 and FMBS for G1 individuals ( ρ p ρ p ρ p Figure 3 3.4. Cytokine Immunological Assay We then measured the salivary concentration of an array of pro- and anti-inflammatory cytokines in the same samples to determine if PRD patients were characterized by an oral pro-inflammatory profile and if treatment contributed to resolving inflammation. Regarding pro-inflammatory molecules, IL-1β levels were significantly higher in G2 patients before treatment (TP0) (469.7 ± 234.1 pg/mL) compared to healthy controls (G1) (194.5 ± 157.8 pg/mL) ( Figure 4 Table 2 p p ρ p IL-8 followed a similar pattern to IL-1β. In G2 patients at TP0, IL-8 concentrations (664.2 ± 236.5 pg/mL) were significantly higher than those in healthy controls (336.1 ± 205.3 pg/mL; Wilcoxon rank-sum test, p p Figure 4 Table 2 p ρ p p Figure 5 IFN-α was detected at low concentrations across all groups. Therapy significantly reduced IFN-α levels in G2 patients from TP0 (0.95 ± 0.27 pg/mL) to TP1 (0.77 ± 0.19 pg/mL) ( Figure 4 Table 2 p ρ p Conversely, anti-inflammatory cytokines followed an opposite trend ( Figure 3 Figure 4 Table 2 p p ρ p Figure 5 Similarly, IL-10 showed concentrations never higher than 2 pg/mL in any condition tested. G2 patients at TP0 (before treatment) exhibited IL-10 salivary concentration (0.97 ± 0.62 pg/mL) significantly lower than control G1 (0.81 ± 0.44 pg/mL; p p Figure 4 Table 2 ρ p p We finally measured IL-6, which can have both pro- and anti- inflammatory effects ( Figure 4 Table 2 p Table S1 3.5. Logistic Regression Diagnostic testing using the “detectseparation” package in R confirmed complete separation, indicating that one or more biomarkers perfectly distinguished between outcome groups. In the comparison between healthy controls (G1) and PRD cases (G2 at TP0), four cytokine biomarkers showed statistically significant associations with disease status: IL-1β (β = 0.0067, p p p p IL-4 showed a protective association reducing the odds of PRD; per 1 pg/mL increase in biomarker level, the odds of disease reduce by ≈99.99% [OR = 0.0000142 = exp(−11.164)]. Similar interpretations apply to IL-10; per 1 pg/mL increase in biomarker level, the odds of disease reduce by ≈97% [OR = 0.030 = exp(−3.517)] ( Table 3 Four separate ROC curves were generated, one for each of the four biomarkers that showed a statistically significant association in univariate logistic regression. Each ROC curve in Figure 6 Figure 6 We then compared PRD patients before (G2 at TP0) and after treatment (G2 at TP1). Similar separation issues arose in the multivariate model, so we again relied on univariate analyses. IL-1β (β = −0.0038, p p Table 4 Figure 7 Finally, we compared healthy controls (G1) with treated PRD patients (G2 at TP1). Multivariate analysis showed no signs of separation but did not identify any significant predictors. In univariate models, only IL-8 was statistically significant (β = −0.0175, p Table 5 Figure 8 Interestingly, MMP-8 showed complete separation in univariate models for both G1 vs. G2 at TP0 and G2 at TP0 vs. TP1. Biomarker values perfectly or nearly perfectly distinguished between groups, making the ROC curve somewhat pleonastic. This finding highlights the potential of MMP-8 as a strong discriminator of PRD status and treatment response in this dataset. 4. Discussion In this study, we simultaneously considered the main periodontal clinical parameters related to the full mouth (FMPS, FMBS, MAL, MPD, and NPP5), alongside a biomarker molecular network. This approach allows for the integration of validated clinical diagnostic and prognostic processes related to objectively measured significant molecular markers. The decision to use clinical indices that reflected the condition of the entire mouth was also influenced by the type of periodontal therapy administered—non-surgical periodontal therapy (NSPT), which is not aimed at treating a specific defect or a particular type of periodontal defect but rather addresses the patient’s entire periodontal system. The molecular analyses aimed to identify early connective tissue damage associated with immune responses, inflammation initiation, and resolution mechanisms, enabling a comprehensive evaluation of significant molecular markers of periodontitis (PRD) in relation to clinically validated diagnoses. The cytokine network specific to PRD likely precedes periodontal damage, allowing for timely interventions in periodontal therapy to prevent disease progression. By comparing patients with complete periodontal health (G1) to those suffering from severe or advanced PRD (G2) [ 34 35 NSPT was able to reduce overall probing depths, particularly in stratified probing depths. The reduction was significantly greater in teeth with higher probing pocket depth (PPD) at baseline. Conversely, pocket closure occurred more frequently in shallower pockets than in deeper ones. NSPT proved to be an effective treatment for reducing inflammation, probing pocket depth, and the number of diseased sites in patients affected by periodontitis. Therefore, it appears that well-executed NSPT may limit the need for additional or alternative treatment approaches, which could be more invasive and entail higher costs. Additionally, this study demonstrated that in advanced PRD cases, NSPT therapy was more effective in reducing PPD, although complete disease resolution, as measured by pocket closure, was less likely. The FMBS is considered a clinical index of periodontal inflammation, directly related to the presence and amount of subgingival deposits and the periodontal inflamed surface area (PISA) [ 55 56 57 58 55 59 60 The clinical parameters measured at TP0 and TP1 aligned with the molecular analyses as a rule. Salivary harvesting has gained significance in clinical diagnostics compared to other biological fluids, primarily because saliva is easily accessible and its collection is safe and non-invasive for patients [ 61 MMP-8 has recently emerged as a key molecule in the pursuit of an objective diagnosis for PRD [ 12 14 16 62 36 37 38 18 63 64 Table 2 65 66 In this study, the MMP-8 analysis revealed greater concentrations in G2 at TP0, lower levels in G1, and intermediate levels in G2 at TP1, with significant differences observed between G2 at TP0 and both G1 and G2 at TP1, but not between G1 and G2 at TP1. The higher levels of MMP-8 in the population affected by severe/advanced PRD at TP0 are likely related to the cleavage of periodontal collagen and the inflammatory phase. G2 patients at TP1 exhibited, on average, a certain number of periodontal pockets and lower MMP-8 levels compared to G2 patients at TP0. Interestingly, Spearman’s rank correlation, which analyzes the relationships between clinical indices and MMP-8, identified correlations in G1, in G2 at TP1, and in G2 at TP0. These results, along with the greater dosage of MMP-8 detected in the saliva of G2 patients at TP1 compared to patients free of PRD in G1 (without statistical significance), highlight a pathogenic aspect of PRD and suggest a favorable effect of non-surgical periodontal therapy (NSPT). It is conceivable that, although collagen cleavage and inflammation were substantially reduced following NSPT, they were not completely abolished, as observed in G1 patients. In logistic analysis, MMP-8 showed complete separation in univariate models for both G1 vs. G2 at TP0 and G2 at TP0 vs. TP1. However, despite these very impressive results, the complexity of its biological functions and its lack of strict specificity for the PRD limit its utility as a standalone diagnostic tool and highlight the need for further research. Similar to MMP-8, IL-6, IFN-α, IL-1β, IL-8, IL-4, and IL-10 are also considered eligible biomarkers that can be routinely utilized for chair-side early diagnosis of tissue inflammatory conditions and PRD [ 67 68 69 70 71 72 73 74 75 Table 2 IFN-α contains a mixture of several proteins with partially overlapping structural, functional, and serological properties. This cytokine plays a substantial role in inducing a hyperactive phenotype in neutrophils, promoting oxidation through the reactive oxygen species (ROS) production, and contributing to the chronic inflammation observed in periodontal tissues [ 67 71 75 76 77 78 79 Table 2 67 In this study, IL-6 and IFN-α showed greater concentrations in G2 patients at TP0, lower concentrations in G2 patients at TP1, and intermediate levels in G1 patients. IFN-α and IL-6 showed a significant difference only between G2 patients before and after treatment. IFN-α resulted in a correlation with FMPS in G2 at TP1. IL-1β and IL-8 are considered potent pro-inflammatory interleukins (ILs) [ 23 80 10 68 81 Table 2 82 23 80 82 83 84 85 55 68 86 In this study, both IL-1β and IL-8 showed greater concentrations in G2 patients at TP0, with statistically significant differences between G2 patients at TP0 and TP1. IL-1β exhibited lower concentrations in G1 patients, while IL-8 showed lower concentrations in G2 patients at TP1. No statistical significance was found between G1 and G2 patients at TP1 for IL-1β. In G2 at TP0, IL-8 was found to cluster with FMPS and IL-10. Notably, IL-10 consistently grouped with IL-8, showed a positive correlation, and exhibited a linear relationship with FMPS in G1. However, IL-1β resulted in inverse correlation with FMBS in G2 at TP1. Additionally, logistic analysis showed that an increase in IL-8 predicted a decreased risk of disease, with an odds ratio favoring G1 over G2 at TP1, suggesting changes in the inflammatory response following therapy in PRD patients. Logistic regression confirmed the disease risk prediction for both IL-1β and IL-8 when comparing G1 vs. G2 at TP0. A decrease in IL-1β predicted a good outcome of periodontal therapy as a trend, without reaching statistical significance (borderline significance), when comparing G2 at TP0 vs. G2 at TP1. IL-4 and IL-10 are recognized as major anti-inflammatory cytokines [ 75 87 Table 2 75 In this study, both IL-4 and IL-10 exhibited higher concentrations in G2 patients at TP1 and lower concentrations in G2 patients at TP0, with G1 patients falling in between. Statistically significant differences were observed between G1 and G2 at TP0, as well as between G2 at TP0 and TP. Additionally, these results correlated with the periodontal indices considered, showing an inverse relationship between IL-4 and IL-10 levels and the clinical features of PRD. Treatment for G2 patients significantly increased anti-inflammatory IL levels, while PRD-free G1 patients showed significantly higher concentrations than G2 patients at TP0. IL-4 clustered with FMBS in G2 at TP0 and with FMPS in G1. IL-4 was inversely correlated with MAL in G2 at TP1. The logistic regression predicted a decrease in disease risk with the increase in both the ILs when comparing G1 vs. G2 at TP0, and the IL-10 increase predicted a good outcome of periodontal therapy when comparing G2 at TP0 vs. G2 at TP1 as a trend, with borderline statistical significance. All the pro-inflammatory cytokines considered (IL-1β, IL-8, IL-6, IFN-α) showed greater concentrations in G2 patients at TP0, while the anti-inflammatory cytokines (IL-4 and IL-10) exhibited lower concentrations in G2 patients at TP0. Almost all the pro-inflammatory cytokines (IL-8, IL-6, and IFN-α, but not IL-1β) displayed lower concentrations in G2 patients at TP1, whereas the anti-inflammatory cytokines (IL-4 and IL-10) showed greater concentrations in G2 patients at TP1. The cytokine concentrations (IL-1β, IL-8, IFN-α, IL-4, and IL-10) and MMP-8 levels between G2 patients at TP0 and G2 patients after NSPT at TP1 were mostly significantly different. Additionally, G1 and G2 patients at TP0 often exhibited significant differences in cytokine concentrations (IL-1β, IL-8, IL-4, and IL-10) and MMP-8 levels, while G1 and G2 patients after treatment at TP1 showed a significant difference in IL-8 concentrations. Cytokines, including interleukins (ILs), play a crucial role in regulating inflammation, which is essential for eliminating pathogenic bacteria and stimulating the regeneration of affected tissues [ 88 30 32 89 90 Despite the small sample size, the biomarker network examined has proven effective in confirming the diagnosis of severe PRD and in monitoring the effects of NSPT in a minimally invasive manner. Therefore, it represents a promising approach for further studies aimed at achieving more consolidated results in this area. Both MMP-8 and the cytokine network, particularly IL-1β, IL-4, IL-8, and IL-10, are associated with PRD. However, neither MMP-8 nor the single cytokines alone are strictly specific to the condition. Data and ROC curves demonstrated a close relationship between these molecules and periodontal health, PRD, and treated PRD. An imbalance between pro-inflammatory and anti-inflammatory mediators during acute inflammatory challenges plays a central role in the development and progression of both infectious diseases (such as PRD) and chronic inflammation [ 91 The molecular physiological defense mechanisms and tissue homeostasis undergo significant changes, becoming part of the disease-specific damage mechanisms. This shift goes beyond the normal pleomorphic biological behavior of cytokines. 5. Strengths and Limitations of the Study In this study, 61.5% of the patients were systemically healthy and unaffected by PRD or gingivitis. This represents an important sample for a study aiming to discriminate among patients with PRD (G2 at TP0), those who have been treated for PRD (G2 at TP1), and patients without PRD (G1), that is, those in complete periodontal health [ 34 35 92 In this study, in G2 patients at TP0 (untreated periodontitis patients), a lack of anti-inflammatory cytokines was found. In addition, directly in periodontal pocket tissues, a significant deficiency in the pro-resolving inflammation protein network was observed [ 6 93 94 95 96 On the contrary, a significant limitation of the study is the small sample size. Selecting compliant patients who were systemically healthy, non-smokers, and affected only by PRD (to avoid confounding variables) proved challenging, as did finding completely healthy control subjects. In this preliminary study, we selected a network of biomarkers that could each be individually associated with PRD and that exhibited the characteristic of being relatively stable over time in healthy adult subjects. None of the individual biomarkers, however, was strictly specific to PRD; therefore, the idea of considering them as a network could reduce the non-specificity resulting from evaluating any single marker in isolation. Moreover, the variation of these biomarkers with age was considerably less significant than the variation that could occur in relation to PRD. This study compares a group of healthy subjects with a group of patients; however, a limitation arises from the limited knowledge, particularly regarding the long-term stability of cytokine concentrations in healthy individuals. There is a clear need for studies evaluating the stability of biomarkers over the medium and long term, which remains an open question. Nevertheless, the results obtained provide a valuable starting point for future research involving a larger sample size. A future research roadmap may build upon our preliminary findings but will require larger sample sizes to overcome current statistical limitations, achieve more comprehensive results, and allow for a more refined characterization of the molecular network in relation to its clinical utility. A larger sample size would address the current statistical limitations in several ways. With more observations, estimates of both within-group and between-group variability become more reliable, reducing the likelihood that any single biomarker perfectly separates outcome classes. This, in turn, would allow for the simultaneous evaluation of multiple biomarkers via multivariate analysis, providing stable estimates of coefficients, confidence intervals, and potential interactions within the molecular network. We could then more accurately determine the predictive power of the biomarker network for distinguishing disease states and monitoring treatment response. 6. Conclusions Within the limitations of this study, we conclude the following: The NSPT produces clinically relevant effects, reducing the need for further, more invasive therapies. Molecular analysis, using validated procedures, provides objective and useful measurements. MMP-8 levels could reliably help differentiate between subjects with a healthy periodontium and those affected by severe PRD. The analysis of the biomarkers under consideration is at least a useful aid in differentiating between individuals with a healthy periodontium and patients with PRD. Assuming that changes in the biomarkers considered can be detected before periodontal damage occurs, this approach may serve as a valid starting point for effective early diagnosis of the disease, before tissue destruction becomes established. Moreover, the molecular network studied—including MMP-8—appears to have potential for monitoring the response to PRD therapy and provides a promising basis for future research. MMP-8, IL-1β, IL-4, IL-8, and IL-10 show the strongest statistical associations with clinical indices in both healthy and diseased states. Statistical evaluations reveal a clear distinction between the untreated PRD phase (G2 at TP0), the treated PRD phase (G2 at TP1), and periodontal health (G1), in terms of the behavior of clinical indices relative to the investigated biomarkers. These findings suggest that individuals with periodontal health or treated PRD could manage inflammation in a significantly different manner compared to those with untreated PRD. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at https://www.mdpi.com/article/10.3390/dj13090436/s1 Author Contributions Conceptualization, C.B., S.B., M.N., M.P. and M.T.; methodology, C.B., E.B., S.B., M.N., R.S. and V.S.; software—validation, C.B., E.B., L.G., S.M. and R.S.; formal analysis, C.B., E.B., S.B., L.G., M.N., S.M., M.P., R.S., D.Z. and M.T.; investigation, C.B., E.B., S.B., L.G., M.N., M.P., R.S. and V.S.; resources, C.B.; data curation, C.B., E.B., S.B., M.N., M.P., R.S., V.S. and D.Z.; writing—original draft preparation, C.B. and R.S.; writing—review and editing, E.B., S.B., M.N., M.P., R.S. and D.Z.; visualization, E.B., L.G., S.M. and R.S.; supervision, C.B.; project administration, C.B.; funding acquisition, C.B. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was conducted in accordance with the Declaration of Helsinki and approved by the Ethics Committee of the University Hospital of Modena (Provincial Ethics Committee, protocol code 3968/E.CE., approval date: 24 October 2017). A substantial amendment to the study protocol was subsequently approved by the Ethics Committee of Area Vasta Emilia Nord (protocol AOU 0026796/22, approval date: 21 September 2022). Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Data Availability Statement The data presented in this study are available on reasonable request from the corresponding author. The data are not publicly available due to privacy and ethical restrictions. Conflicts of Interest The authors declare no conflict of interest. Abbreviations The following abbreviations are used in this manuscript: AUC Area Under the Curve CAL Clinical Attachment Level DM Diabetes Mellitus FMBS Full-Mouth Bleeding Score FMPS Full-Mouth Plaque Score G1 Group 1: Healthy Controls G2 Group 2: Patients with PRD GCF Gingival Crevicular Fluid IFN-α Interferon Alpha IL Interleukin MAL Mean Attachment Level MMP-8 Matrix Metalloproteinase-8 MPD Mean Probing Depth NPP5 Number of Pockets with PPD ≥ 5 mm NSPT Non-Surgical Periodontal Therapy OD Optical Density PPD Probing Pocket Depth PRD Periodontitis RA Rheumatoid Arthritis REC Gingival Recession Depth ROC Receiver Operating Characteristic SD Standard Deviation SE Standard Error TP0 Time Point 0 (Baseline) TP1 Time Point 1 (Post-treatment Follow-Up) References 1. Divaris K. Searching Deep and Wide: Advances in the Molecular Understanding of Dental Caries and Periodontal Disease Adv. Dent. Res. 2019 30 40 44 10.1177/0022034519877387 31633389 PMC6806129 2. Werner N. Heck K. Walter E. Ern C. Bumm C.V. Folwaczny M. Probing Pocket Depth Reduction after Non-Surgical Periodontal Therapy: Tooth-Related Factors J. Periodontol. 2024 95 29 39 10.1002/JPER.23-0285 37436696 3. Kornman K.S. Mapping the Pathogenesis of Periodontitis: A New Look J. Periodontol. 2008 79 1560 1568 10.1902/jop.2008.080213 18673011 4. Bertoldi C. Zaffe D. In Vivo Comparison of Two Bone Substitutes in the Distal Femur of the Rabbit Int. J. Oral Maxillofac. Implant. 2012 27 119 127 22299088 5. Bertoldi C. Lalla M. Pradelli J.M. Cortellini P. Lucchi A. Zaffe D. Risk Factors and Socioeconomic Condition Effects on Periodontal and Dental Health: A Pilot Study among Adults over Fifty Years of Age Eur. J. Dent. 2013 7 336 346 10.4103/1305-7456.115418 24926214 PMC4053623 6. Monari E. Cuoghi A. Bellei E. Bergamini S. Lucchi A. Tomasi A. Cortellini P. Zaffe D. Bertoldi C. Analysis of Protein Expression in Periodontal Pocket Tissue: A Preliminary Study Proteome Sci. 2015 13 33 10.1186/s12953-015-0089-y 26719749 PMC4696085 7. Garlet G.P. Critical Reviews in Oral Biology & Medicine: Destructive and Protective Roles of Cytokines in Periodontitis: A Re-Appraisal from Host Defense and Tissue Destruction Viewpoints J. Dent. Res. 2010 89 1349 1363 10.1177/0022034510376402 20739705 8. Gupta M. Chaturvedi R. Jain A. Role of Cardiovascular Disease Markers in Periodontal Infection: Understanding the Risk Indian J. Dent. Res. Off. Publ. Indian Soc. Dent. Res. 2015 26 231 236 10.4103/0970-9290.162873 26275186 9. Bertoldi C. Forabosco A. Lalla M. Generali L. Zaffe D. Cortellini P. How Intraday Index Changes Influence Periodontal Assessment: A Preliminary Study Int. J. Dent. 2017 2017 1 10 10.1155/2017/7912158 PMC5554557 28828006 10. Huang Y.K. Tseng K.F. Tsai P.H. Wang J.S. Lee C.Y. Shen M.Y. IL-8 as a Potential Therapeutic Target for Periodontitis and Its Inhibition by Caffeic Acid Phenethyl Ester In Vitro Int. J. Mol. Sci. 2021 22 3641 10.3390/ijms22073641 33807391 PMC8037988 11. Abdullah A.N. Al-Habib O.A.M. Mohammed S.A. Changes in the Level of Cytokines in the Saliva of Hypertensive Patients with Chronic Periodontitis after Scaling and Root Planning Prostaglandins Other Lipid Mediat. 2023 169 106765 10.1016/j.prostaglandins.2023.106765 37451535 12. Taylor J.J. Jaedicke K.M. Merwe R.C. Bissett S.M. Landsdowne N. Whall K.M. Pickering K. Thornton V. Lawson V. Yatsuda H. A Prototype Antibody-Based Biosensor for Measurement of Salivary MMP-8 in Periodontitis Using Surface Acoustic Wave Technology Sci. Rep. 2019 9 11034 10.1038/s41598-019-47513-w 31363141 PMC6667706 13. Liu X. Li H. A Systematic Review and Meta-Analysis on Multiple Cytokine Gene Polymorphisms in the Pathogenesis of Periodontitis Front. Immunol. 2022 12 713198 10.3389/fimmu.2021.713198 35046930 PMC8761621 14. Deng K. Zonta F. Yang H. Pelekos G. Tonetti M.S. Development of a Machine Learning Multiclass Screening Tool for Periodontal Health Status Based on Non-Clinical Parameters and Salivary Biomarkers J. Clin. Periodontol. 2023 11 1547 1560 10.1111/jcpe.13856 PMC11651717 37697491 15. Yilmaz M. Sorsa T. Demir E. Gürsoy M. Suominen A. Tervahartiala T. Räisänen I.T. Gürsoy U.K. Accuracy of AMMP-8 Point-of-Care Test in Indicating Periodontal Treatment Outcomes in Stage III/IV Periodontitis: A 24-Week Follow-up Study J. Periodontal Res. 2023 58 325 335 10.1111/jre.13093 36618000 16. Zalewska E.A. Ławicka R. Grygorczuk P. Nowosielska M. Kicman A. Ławicki S. Importance of Metalloproteinase 8 (MMP-8) in the Diagnosis of Periodontitis Int. J. Mol. Sci. 2024 25 2721 10.3390/ijms25052721 38473967 PMC10931783 17. Slavich G.M. Understanding Inflammation, Its Regulation, and Relevance for Health: A Top Scientific and Public Priority Brain Behav. Immun. 2015 45 13 14 10.1016/j.bbi.2014.10.012 25449576 PMC4361086 18. Bertoldi C. Salvatori R. Pinti M. Mattioli A.V. Could the Periodontal Therapy Improve the Cardiologic Patient Health? A Narrative Review Curr. Probl. Cardiol. 2024 49 102699 10.1016/j.cpcardiol.2024.102699 38852913 19. GBD 2017 Causes of Death Collaborators Global, Regional, and National Age-Sex-Specific Mortality for 282 Causes of Death in 195 Countries and Territories, 1980-2017: A Systematic Analysis for the Global Burden of Disease Study 2017 Lancet 2018 392 1736 1788 10.1016/S0140-6736(18)32203-7 30496103 PMC6227606 20. Fleming T.P. Watkins A.J. Velazquez M.A. Mathers J.C. Prentice A.M. Stephenson J. Barker M. Saffery R. Yajnik C.S. Eckert J.J. Origins of Lifetime Health around the Time of Conception: Causes and Consequences Lancet 2018 391 1842 1852 10.1016/S0140-6736(18)30312-X 29673874 PMC5975952 21. Lockhart P.B. Bolger A.F. Papapanou P.N. Osinbowale O. Trevisan M. Levison M.E. Taubert K.A. Newburger J.W. Gornik H.L. Gewitz M.H. American Heart Association Rheumatic Fever, Endocarditis, and Kawasaki Disease Committee of the Council on Cardiovascular Disease in the Young, Council on Epidemiology and Prevention, Council on Peripheral Vascular Disease, and Council on Clinical Cardiol Circulation 2012 125 2520 2544 10.1161/CIR.0b013e31825719f3 22514251 22. Monsarrat P. Blaizot A. Kémoun P. Ravaud P. Nabet C. Sixou M. Vergnes J.N. Clinical Research Activity in Periodontal Medicine: A Systematic Mapping of Trial Registers J. Clin. Periodontol. 2016 43 390 400 10.1111/jcpe.12534 26881700 23. Jain P. Mirza M.A. Iqbal Z. Unraveling the Etiology of Periodontitis Int. J. Biomed. Investig. 2021 4 131 10.31531/2581-4745.1000131 24. Herrera D. Sanz M. Shapira L. Brotons C. Chapple I. Frese T. Graziani F. Hobbs F.D.R. Huck O. Hummers E. Association between Periodontal Diseases and Cardiovascular Diseases, Diabetes and Respiratory Diseases: Consensus Report of the Joint Workshop by the European Federation of Periodontology (EFP) and the European Arm of the World Organization of Family Doc J. Clin. Periodontol. 2023 50 819 841 10.1111/jcpe.13807 36935200 25. Bertolini M. Clark D. Periodontal Disease as a Model to Study Chronic Inflammation in Aging GeroScience 2024 46 3695 3709 10.1007/s11357-023-00835-0 37285008 PMC11226587 26. Leng Y. Hu Q. Ling Q. Yao X. Liu M. Chen J. Yan Z. Dai Q. Periodontal Disease Is Associated with the Risk of Cardiovascular Disease Independent of Sex: A Meta-Analysis Front. Cardiovasc. Med. 2023 10 1114927 10.3389/fcvm.2023.1114927 36923959 PMC10010192 27. Kassebaum N.J. Bernabé E. Dahiya M. Bhandari B. Murray C.J.L. Marcenes W. Global Burden of Severe Periodontitis in 1990-2010: A Systematic Review and Meta-Regression J. Dent. Res. 2014 93 1045 1053 10.1177/0022034514552491 25261053 PMC4293771 28. Hasturk H. Kantarci A. Activation and Resolution of Periodontal Inflammation and Its Systemic Impact Periodontol. 2000 2015 1 255 273 10.1111/prd.12105 PMC4530469 26252412 29. Sczepanik F.S.C. Grossi M.L. Casati M. Goldberg M. Glogauer M. Fine N. Tenenbaum H.C. Periodontitis Is an Inflammatory Disease of Oxidative Stress: We Should Treat It That Way Periodontology 2020 84 45 68 10.1111/prd.12342 32844417 30. Hajishengallis G. Chavakis T. Lambris J.D. Current Understanding of Periodontal Disease Pathogenesis and Targets for Host-Modulation Therapy Periodontol. 2000 2020 1 14 34 10.1111/prd.12331 PMC7457922 32844416 31. Martínez-García M. Hernández-Lemus E. Periodontal Inflammation and Systemic Diseases: An Overview Front. Physiol. 2021 12 709438 10.3389/fphys.2021.709438 34776994 PMC8578868 32. Loos B.G. Van Dyke T.E. The Role of Inflammation and Genetics in Periodontal Disease Periodontol. 2000 2020 83 26 39 10.1111/prd.12297 32385877 PMC7319430 33. Page R.C. Eke P.I. Case Definitions for Use in Population-Based Surveillance of Periodontitis J. Periodontol. 2007 78 1387 1399 10.1902/jop.2007.060264 17608611 34. Trombelli L. Farina R. Silva C.O. Tatakis D.N. Plaque-Induced Gingivitis: Case Definition and Diagnostic Considerations J. Clin. Periodontol. 2018 45 (Suppl. S20) S44 S67 10.1111/jcpe.12939 29926492 35. Tonetti M.S. Greenwell H. Kornman K.S. Staging and Grading of Periodontitis: Framework and Proposal of a New Classification and Case Definition J. Periodontol. 2018 89 (Suppl. S1) S159 S172 10.1002/jper.18-0006 29926952 36. Mattey D.L. Nixon N.B. Dawes P.T. Association of Circulating Levels of MMP-8 with Mortality from Respiratory Disease in Patients with Rheumatoid Arthritis Arthritis Res. Ther. 2012 14 204 10.1186/ar4042 23031278 PMC3580516 37. Thirkettle S. Decock J. Hugh A. Pennington C.J. Jaworski D.M. Edwards D.R. Matrix Metalloproteinase 8 (Collagenase 2) Induces the Expression of Interleukins 6 and 8 in Breast Cancer Cells J. Biol. Chem. 2013 288 16282 16294 10.1074/jbc.M113.464230 23632023 PMC3675567 38. Juurikka K. Butler G.S. Salo T. Nyberg P. Aström P. The Role of MMP8 in Cancer: A Systematic Review Int. J. Mol. Sci. 2019 20 4506 10.3390/ijms20184506 31514474 PMC6770849 39. American Medical Association World Medical Association Declaration of Helsinki: Ethical Principles for Medical Research Involving Human Subjects JAMA 2013 310 2191 2194 10.1001/jama.2013.281053 24141714 40. Duvina M. Barbato L. Brancato L. Glover G.D. Amunni F. Tonelli P. Biochemical Markers as Predictors of Bone Remodelling in Dental Disorders: A Narrative Description of Literature Clin. Cases Miner. Bone Metab. 2012 9 100 106 23087720 PMC3476527 41. Zhang Y. Huang L. Zhang J. De Souza Rastelli A.N. Yang J. Deng D. Anti-Inflammatory Efficacy of Curcumin as an Adjunct to Non-Surgical Periodontal Treatment: A Systematic Review and Meta-Analysis Front. Pharmacol. 2022 13 808460 10.3389/fphar.2022.808460 35140616 PMC8819153 42. O’leary T.J. Drake R.B. Naylor J.E. The Plaque Control Record J. Periodontol. 1972 43 38 10.1902/jop.1972.43.1.38 4500182 43. Kaldahl W.B. Kalkwarf K.L. Patil K.D. Molvar M.P. Dyer J.K. Long-Term Evaluation of Periodontal Therapy: I. Response to 4 Therapeutic Modalities J. Periodontol. 1996 67 93 102 10.1902/jop.1996.67.2.93 8667142 44. Sanz M. Herrera D. Kebschull M. Chapple I. Jepsen S. Berglundh T. Sculean A. Tonetti M.S. EFP Workshop Participants and Methodological Consultants Treatment of Stage I–III Periodontitis—The EFP S3 Level Clinical Practice Guideline J. Clin. Periodontol. 2020 47 4 60 10.1111/jcpe.13290 32383274 PMC7891343 45. Herrera D. Sanz M. Kebschull M. Jepsen S. Sculean A. Berglundh T. Papapanou P.N. Chapple I. Tonetti M.S. Treatment of Stage IV Periodontitis: The EFP S3 Level Clinical Practice Guideline J. Clin. Periodontol. 2022 49 (Suppl. S2) 4 71 10.1111/jcpe.13639 35688447 46. Suvan J. Leira Y. Moreno Sancho F.M. Graziani F. Derks J. Tomasi C. Subgingival Instrumentation for Treatment of Periodontitis. A Systematic Review J. Clin. Periodontol. 2020 47 155 175 10.1111/jcpe.13245 31889320 47. Gupta N. Gupta N.D. Gupta A. Khan S. Bansal N. Role of Salivary Matrix Metalloproteinase-8 (MMP-8) in Chronic Periodontitis Diagnosis Front. Med. 2015 9 72 76 10.1007/s11684-014-0347-x 25098434 48. Nędzi-Góra M. Górska R. Górski B. The Utility of Gingival Crevicular Fluid Matrix Metalloproteinase-8 Provides Site-Specific Diagnostic Value for Periodontal Grading Cent. Eur. J. Immunol. 2021 46 236 243 10.5114/ceji.2021.107031 34764793 PMC8568025 49. Wong S.P. Tan S.M. Lee C.S. Law K.B. Lim Y.A.L. Rajasuriar R. Prospective Longitudinal Analysis of Clinical and Immunological Risk Factors Associated with Oral and Gastrointestinal Mucositis Following Autologous Stem Cell Transplant in Adults Support. Care Cancer 2023 31 494 10.1007/s00520-023-07947-5 37498423 50. Beheshti R. Halstead E.S. Cusack B. Hicks S.D. Multi-Omic Factors Associated with Frequency of Upper Respiratory Infections in Developing Infants Int. J. Mol. Sci. 2023 24 934 10.3390/ijms24020934 36674462 PMC9860840 51. Glantz S.A. Primer of Biostatistic 6th ed. Mc-Graw Hill New York, NY, USA 2005 52. Robin X. Turck N. Hainard A. Tiberti N. Lisacek F. Sanchez J.-C. Müller M. PROC: An Open-Source Package for R and S+ to Analyze and Compare ROC Curves BMC Bioinform. 2011 12 77 10.1186/1471-2105-12-77 PMC3068975 21414208 53. Epskamp S. Cramer A.O.J. Waldorp L.J. Schmittmann V.D. Borsboom D. Qgraph: Network Visualizations of Relationships in Psychometric Data J. Stat. Softw. 2012 48 1 18 10.18637/jss.v048.i04 54. Kosmidis I. Schumacher D. Schwendinger F. Detect t and Check for Separation and Infinite Maximum Likelihood Estimates; R package version 0.8-3 2025 Available online: https://cran.r-project.org/package=detectseparation (accessed on 22 July 2025) 55. Offenbacher S. Barros S.P. Beck J.D. Rethinking Periodontal Inflammation J. Periodontol. 2008 79 (Suppl. S8) 1577 1584 10.1902/jop.2008.080220 18673013 56. Checchi L. Montevecchi M. Checchi V. Zappulla F. The Relationship between Bleeding on Probing and Subgingival Deposits. An Endoscopical Evaluation Open Dent. J. 2009 28 154 160 10.2174/1874210600903010154 19672332 PMC2724644 57. Nomura Y. Morozumi T. Numabe Y. Ogata Y. Nakayama Y. Sugaya T. Nakamura T. Sato S. Takashiba S. Sekino S. Estimation of the Periodontal Inflamed Surface Area by Simple Oral Examination J. Clin. Med. 2021 10 723 10.3390/jcm10040723 33673121 PMC7917734 58. Lang N.P. Adler R. Joss A. Nyman S. Absence of Bleeding on Probing. An Indicator of Periodontal Stability J. Clin. Periodontol. 1990 17 714 721 10.1111/j.1600-051X.1990.tb01059.x 2262585 59. Dukka H. Saleh M.H.A. Ravidà A. Greenwell H. Wang H.L. Is Bleeding on Probing a Reliable Clinical Indicator of Peri-Implant Diseases? J. Periodontol. 2021 92 1669 1674 10.1002/JPER.20-0890 33829501 60. Herz M.M. Hoffmann N. Braun S. Lachmann S. Bartha V. Petsos H. Periodontal Pockets: Predictors for Site-Related Worsening after Non-Surgical Therapy-A Long-Term Retrospective Cohort Study J. Clin. Periodontol. 2024 51 680 690 10.1111/jcpe.13957 38385991 61. Castagnola M. Scarano E. Passali G.C. Messana I. Cabras T. Iavarone F. Di Cintio G. Fiorita A. De Corso E. Paludetti G. Salivary Biomrakers and Proteomics: Future Diagnostics and Clinical Utilities Acta Otorhinolaryngol. Ital. 2017 37 94 101 10.14639/0392-100X-1598 28516971 PMC5463528 62. Reddahi S. Bouziane A. Rida S. Tligui H. Ennibi O. Salivary Biomarkers in Periodontitis Patients: A Pilot Study Int. J. Dent. 2022 2022 3664516 10.1155/2022/3664516 35368315 PMC8970949 63. Impola U. Jeskanen L. Ravanti L. Syrjänen S. Baldursson B. Kähäri V.M. Saarialho-Kere U. Expression of Matrix Metalloproteinase (MMP)-7 and MMP-13 and Loss of MMP-19 and P16 Are Associated with Malignant Progression in Chronic Wounds Br. J. Dermatol. 2005 152 720 726 10.1111/j.1365-2133.2005.06447.x 15840104 64. Van Lint P. Libert C. Matrix Metalloproteinase-8: Cleavage Can Be Decisive Cytokine Growth Factor Rev. 2006 17 217 223 10.1016/j.cytogfr.2006.04.001 16820317 65. Balbín M. Fueyo A. Knäuper V. Pendás A.M. López J.M. Jiménez M.G. Murphy G. López-Otín C. Collagenase 2 (MMP-8) Expression in Murine Tissue-Remodeling Processes. Analysis of Its Potential Role in Postpartum Involution of the Uterus J. Biol. Chem. 1998 273 23959 23968 10.1074/jbc.273.37.23959 9727011 66. Lee E.J. Park J.S. Lee Y.Y. Kim D.Y. Kang J.L. Kim H.S. Anti-Inflammatory and Anti-Oxidant Mechanisms of an MMP-8 Inhibitor in Lipoteichoic Acid-Stimulated Rat Primary Astrocytes: Involvement of NF-ΚB, Nrf2, and PPAR-γ Signaling Pathways J Neuroinflammation 2018 15 326 10.1186/s12974-018-1363-6 30470240 PMC6260848 67. Wright H.J. Matthews J.B. Chapple I.L. Ling-Mountford N. Cooper P.R. Periodontitis Associates with a Type 1 IFN Signature in Peripheral Blood Neutrophils J. Immunol. 2008 181 5775 5784 10.4049/jimmunol.181.8.5775 18832737 68. Cafiero C. Spagnuolo G. Marenzi G. Martuscelli R. Colamaio M. Leuci S. Predictive Periodontitis: The Most Promising Salivary Biomarkers for Early Diagnosis of Periodontitis J. Clin. Med. 2021 10 1488 10.3390/jcm10071488 33916672 PMC8038382 69. Czuszak C.A. Sutherland D.E. Billman M.A. Stein S.H. Prostaglandin E2 Potentiates Interleukin-1 Beta Induced Interleukin-6 Production by Human Gingival Fibroblasts J. Clin. Periodontol. 1996 23 635 640 10.1111/j.1600-051X.1996.tb00587.x 8841895 70. Xing Z. Gauldie J. Cox G. Baumann H. Jordana M. Lei X.F. Achong M.K. IL-6 Is an Anti-Inflammatory Cytokine Required for Controlling Local or Systemic Acute Inflammatory Responses J. Clin. Investig. 1998 101 311 320 10.1172/JCI1368 9435302 PMC508569 71. Chalise J. Narendra S. Paudyal B. Magnusson M. Interferon Alpha Inhibits Antigen-Specific Production of Proinflammatory Cytokines and Enhances Antigen-Specific Transforming Growth Factor Beta Production in Antigen-Induced Arthritis Arthritis Res. Ther. 2013 15 143 10.1186/ar4326 PMC3978460 24286140 72. Wolf J. Rose-John S. Garbers C. Interleukin-6 and Its Receptors: A Highly Regulated and Dynamic System Cytokine 2014 70 11 20 10.1016/j.cyto.2014.05.024 24986424 73. Adisa A. Bahrami-Hessari M. Bhangu A. George C. Ghosh D. Glasbey J. Haque P. Ingabire J.C.A. Kamarajah S.K. Kudrna L. Reducing the Environmental Impact of Surgery on a Global Scale: Systematic Review and Co-Prioritization with Healthcare Workers in 132 Countries Br. J. Surg. 2023 110 804 817 10.1093/bjs/znad092 37079880 PMC10364528 74. Mazurek-Mochol M. Bonsmann T. Mochol M. Poniewierska-Baran A. Pawlik A. The Role of Interleukin 6 in Periodontitis and Its Complications Int. J. Mol. Sci. 2024 25 2146 10.3390/ijms25042146 38396821 PMC10889213 75. Zhang J.M. An J. Cytokines, Inflammation, and Pain Int. Anesthesiol. Clin. 2007 45 27 37 10.1097/AIA.0b013e318034194e 17426506 PMC2785020 76. Mathur A. Michalowicz B. Castillo M. Aeppli D. Interleukin-1 Alpha, Interleukin-8 and Interferon-Alpha Levels in Gingival Crevicular Fluid J. Periodontal Res. 1996 31 489 495 10.1111/j.1600-0765.1996.tb01414.x 8915952 77. Serhan C.N. Chiang N. Van Dyke T.E. Resolving Inflammation: Dual Anti-Inflammatory and pro-Resolution Lipid Mediators Nat. Rev. Immunol. 2008 8 349 361 10.1038/nri2294 18437155 PMC2744593 78. Cordoba-David G. Garcia-Gimenez J. Cardoso Castelo-Branco R. Carrasco S. Cannata P. Ortiz A. Ramos A.M. Crosstalk between TBK1/IKKepsilon and the Type I Interferon Pathway Contributes to Tubulointerstitial Inflammation and Kidney Tubular Injury Front. Pharmacol. 2022 13 987979 10.3389/fphar.2022.987979 36386242 PMC9647636 79. Ji L. Li T. Chen H. Yang Y. Lu E. Liu J. Qiao W. Chen H. The Crucial Regulatory Role of Type I Interferon in Inflammatory Diseases Cell Biosci. 2023 13 230 10.1186/s13578-023-01188-z 38124132 PMC10734085 80. Silva A.C. Faria M.R. Fontes A. Campos M.S. Cavalcanti B.N. Interleukin-1 Beta and Interleukin-8 in Healthy and Inflamed Dental Pulps J. Appl. Oral Sci. 2009 17 527 532 10.1590/S1678-77572009000500031 19936537 PMC4327685 81. Cheng R. Wu Z. Li M. Shao M. Hu T. Interleukin-1β Is a Potential Therapeutic Target for Periodontitis: A Narrative Review Int. J. Oral Sci. 2020 12 2 10.1038/s41368-019-0068-8 31900383 PMC6949296 82. Kim G.Y. Lee J.W. Ryu H.C. Wei J.D. Seong C.M. Kim J.H. Proinflammatory Cytokine IL-1beta Stimulates IL-8 Synthesis in Mast Cells via a Leukotriene B4 Receptor 2-Linked Pathway, Contributing to Angiogenesis J. Immunol. 2010 184 3946 3954 10.4049/jimmunol.0901735 20194723 83. Bréchard S. Bueb J.L. Tschirhart E.J. Interleukin-8 Primes Oxidative Burst in Neutrophil-like HL-60 through Changes in Cytosolic Calcium Cell Calcium 2005 37 531 540 10.1016/j.ceca.2005.01.019 15862344 84. Uchida Y. Shiba H. Komatsuzawa H. Takemoto T. Sakata M. Fujita T. Kawaguchi H. Sugai M. Kurihara H. Expression of IL-1 Beta and IL-8 by Human Gingival Epithelial Cells in Response to Actinobacillus Actinomycetemcomitans Cytokine 2001 14 152 161 10.1006/cyto.2001.0863 11396993 85. Al-Qahtani A.A. Alhamlan F.S. Al-Qahtani A.A. Pro-Inflammatory and Anti-Inflammatory Interleukins in Infectious Diseases: A Comprehensive Review Trop. Med. Infect. Dis. 2024 9 13 10.3390/tropicalmed9010013 38251210 PMC10818686 86. Noh M.K. Jung M. Kim S.H. Lee S.R. Park K.H. Kim D.H. Kim H.H. Park Y.G. Assessment of IL-6, IL-8 and TNF-α Levels in the Gingival Tissue of Patients with Periodontitis Exp. Ther. Med. 2013 6 847 851 10.3892/etm.2013.1222 24137277 PMC3786859 87. Uceyler N. Valenza R. Stock M. Reduced Levels of Antiinflammatory Cytokines in Patients with Chronic Widespread Pain Arthritis Rheum 2006 54 2656 2664 16871547 10.1002/art.22026 88. Sachdeva S. Harish S. Amit M. Tanupriya S. Interleukins in Periodontics J. Head Neck Physicians Surg. 2020 8 70 75 89. Bertoldi C. Pellacani C. Lalla M. Consolo U. Pinti M. Cortellini P. Cossarizza A. Herpes Simplex i Virus Impairs Regenerative Outcomes of Periodontal Regenerative Therapy in Intrabony Defects. A Pilot Study J. Clin. Periodontol. 2012 39 385 392 10.1111/j.1600-051X.2012.01850.x 22292785 90. Di Benedetto A. Gigante I. Colucci S. Grano M. Periodontal Disease: Linking the Primary Inflammation to Bone Loss Clin. Dev. Immunol. 2013 2013 503754 10.1155/2013/503754 23762091 PMC3676984 91. Neurath N. Kesting M. Cytokines in Gingivitis and Periodontitis: From Pathogenesis to Therapeutic Targets Front. Immunol. 2024 15 1435054 10.3389/fimmu.2024.1435054 39253090 PMC11381234 92. Deng K. Pelekos G. Jin L. Tonetti M.S. Diagnostic Accuracy of Self-Reported Measures of Periodontal Disease: A Clinical Validation Study Using the 2017 Case Definitions J. Clin. Periodontol. 2021 48 1037 1050 10.1111/jcpe.13484 33998009 93. Bertoldi C. Bellei E. Pellacani C. Ferrari D. Lucchi A. Cuoghi A. Bergamini S. Cortellini P. Tomasi A. Zaffe D. Non-Bacterial Protein Expression in Periodontal Pockets by Proteome Analysis J. Clin. Periodontol. 2013 40 573 582 10.1111/jcpe.12050 23509886 94. Bellei E. Bertoldi C. Monari E. Bergamini S. Proteomics Disclose the Potential of Gingival Crevicular Fluid (GCF) as a Source of Biomarkers for Severe Periodontitis Materials 2022 15 2161 10.3390/ma15062161 35329612 PMC8950923 95. Headland S.E. Norling L.V. The Resolution of Inflammation: Principles and Challenges Semin. Immunol. 2015 27 149 160 10.1016/j.smim.2015.03.014 25911383 96. Sahni V. Dyke T.E. Immunomodulation of Periodontitis with SPMs Front. Oral Health 2023 4 1288722 10.3389/froh.2023.1288722 37927821 PMC10623003 Figure 1 Workflow of the study. G1 included systemically healthy subjects, without gingivitis and periodontitis; G2 included systemically healthy subjects suffering from severe or advanced periodontitis. Legend: TP = time point. NSPT = non-surgical periodontal therapy. Figure 2 MMP-8 concentrations (ng/mL) in saliva of healthy controls (G1), periodontitis patients at baseline (G2-TP0), and periodontitis patients after NSPT therapy (G2-TP1) as measured by ELISA. Dots are individual values; bars represent mean ± SEM. **** = p Figure 3 Spearman correlation analysis: Green interconnection lines indicate positive correlations, while red lines indicate negative correlations. The thickness of each line is proportional to the value of the Spearman’s correlation coefficient. Legend: TP = time point. IL = interleukin. IFN = interferon. MMP-8 = salivary matrix metalloproteinase-8. MAL = mean attachment level. MPD = mean probing depth. NPP5 = number of pockets with PPD ≥ 5 mm per patient. FMPS = full-mouth plaque score. FMBS = full-mouth bleeding score. Figure 4 Cytokine concentrations (pg/mL) of ( a b c p p p p Figure 5 Cluster aggregation analysis for G1, G2 at TP0, and G2 at TP1: Interconnection lines indicate correlations among biomarkers and clinical indices. The different colors of the ellipsoidal shapes indicate the different clusters. Legend: TP = time point. IL = interleukin. IFN = interferon. MMP-8 = salivary matrix metalloproteinase-8. MAL = mean attachment level. MPD = mean probing depth. NPP5 = number of pockets with PPD ≥ 5 mm per patient. FMPS = full-mouth plaque score. FMBS = full-mouth bleeding score. Figure 6 G1 vs. G2 at TP0 ROC curves for IL-1β, IL-8, IL-4, and IL-10 distinguishing healthy controls (G1) from untreated periodontitis patients (G2 at TP0). AUC values indicate each biomarker’s individual classification performance. Figure 7 G2 at TP0 vs. G2 at TP1 ROC curves for IL-1β and IL-10 distinguishing untreated periodontitis patients (G2 at TP0) from treated periodontitis patients (G2 at TP1). AUC values indicate each biomarker’s individual classification performance. Figure 8 G1 vs. G2 at TP1 ROC curves for IL-8 distinguishing healthy controls (G1) from treated periodontitis patients (G2 at TP1). AUC values indicate biomarker’s individual classification performance. dentistry-13-00436-t001_Table 1 Table 1 Main features of G1 (controls) and G2 patients at TP0 and TP1. G1 G2  TP0 TP0 TP1 N (females) 16 (8) 10 (6)  Age (years) 24.9 ± 4.53 52.2 ± 8.28 *  FMPS (%) 8.12 ± 6.03 41.10 ± 22.20 20.72 ± 9.68 *° FMBS (%) 3.62 ± 3.12 33.80 ± 15.34 16.90 ± 10.82 *° MPD (mm) 1.24 ± 0.15 2.63 ± 0.65 1.94 ± 0.42 *° MAL (mm) 0 3.56 ± 0.75 2.95 ± 0.67 *° NPP5 0 19.00 ± 12.76 7.30 ± 11.12 *° Data are expressed as mean ± SD. At TP0, G2 parameters significantly different from G1 are in bold. * significant difference of G2 patients at TP1 vs. healthy control. ° significant difference of G2 patients at TP0 vs. TP1. MPD = mean probing depth; MAL = mean attachment level; NPP5 = number of periodontal pockets. dentistry-13-00436-t002_Table 2 Table 2 MMP-8 and cytokines: expression in periodontitis patients at TP0, functions, and interactions. Biomarker Expression in Periodontitis Function Interaction MMP-8 Upregulated  – Non-specific connective tissue cleavage; – Connective tissue remodeling; – Promotes inflammation by enhancing leukocyte infiltration; – Resolves inflammation by degrading pro-inflammatory signals; – Overexpression is associated with chronic inflammation.  – IL-1β strongly induces MMP-8 expression; – IL-6 promotes MMP-8 expression in an inflammatory setting, depending on the presence of neutrophils. IL-1β Upregulated  – Pro-inflammatory; – Bone resorption; – Non-specific connective cleavage; – Transition from acute to chronic inflammation.  – Stimulates IL-8 production. – Activates neutrophils; – Stimulates osteoclastogenesis; – Stimulates MMP (matrix metalloproteinase) production; – Inhibited by IL-4 and IL-10. IL-8 Upregulated  – Pro-inflammatory; – Neutrophil recruitment; – Transition from acute to chronic inflammation.  – Amplified by IL-β1; – Enhanced by IL-6; – Inhibited by IL-4/and IL-10. IL-6 Upregulated  – Exhibits both pro-inflammatory and anti-inflammatory effects (depending on the context of its production); – Induces acute-phase protein production; – Causes non-specific connective tissue cleavage.  – Activates neutrophils; – Stimulates osteoclast differentiation; – Stimulates MMP production, and IL-1β promotes IL-6 production; – Downregulated by IL-4 and IL-10. IFN-α Upregulated  – Exhibits both pro-inflammatory and anti-inflammatory effects; – Involved in antiviral immune responses; – Exacerbates the inflammatory response; – Induces chronic inflammation; – Induces a hyperactive phenotype in neutrophils; – Promotes ROS production; – Contributes to the induction of chronic inflammation.  – The expression of IFN-α is enhanced by IL-1β; – IL-10 antagonizes IFN-α inflammatory activity; – IFN-α production is suppressed by IL-10; – IL-4 inhibits IFN-α expression. IL-4 Downregulated  – Anti-inflammatory; promotes Th2.  – Suppresses IL-1β and IL-8. IL-10 Downregulated or insufficient  – Anti-inflammatory; suppresses Th1.  – Suppresses IL-1β and IL-8; induced by IL-6. Legend: TP = time point. IL = interleukin. IFN = interferon. MMP-8 = salivary matrix metalloproteinase-8. ROS = reactive oxygen species. Th1 = T helper cell 1. Th2 = T helper cell 2. dentistry-13-00436-t003_Table 3 Table 3 43vs. PRD patients (G2-TP0). Biomarker β (Coeff.) St. Error p OR (exp(β)) 95% IC OR Effect % on Odds Biologic Significance IL-1-β 0.0067 0.0026 0.0108 1.0067 [1.0016–1.0119] ↑ +0.67% Increased Risk IL-8 0.0062 0.0024 0.0087 1.0062 [1.0015–1.0110] ↑ +0.62% Increased Risk IL-4 −11.1641 4.4322 0.0118 0.0000142 [6.19e−08–0.0334] ↓ −99.99% Reduced Risk IL-10 −3.5171 1.5243 0.0210 0.030 [0.0021–0.4416] ↓ –97% Reduced Risk ↑ indicates increased risk; ↓ indicates reduced risk. dentistry-13-00436-t004_Table 4 Table 4 State of illness; patients with untreated PRD (G2-TP0) vs. treated PRD (PRD G2- TP1). Biomarker β (Coeff.) St. Error p OR (exp(β)) 95% IC OR Effect % on Odds Biologic Significance IL-1-β −0.0038 0.0020 0.059 0.9962 [0.9923–1.0001] ↑ +0.38% Increased risk IL-10 3.289 1.687 0.0511 26.81 [2.67–268.33] ↑ +2581% Reduced Risk ↑ indicates increased risk. dentistry-13-00436-t005_Table 5 Table 5 State of illness; subjects without PRD (G1) vs. treated PRD (PRD G2- TP1). Biomarker β (Coeff.) St. Error p OR (exp(β)) 95% IC OR Effect % on Odds Biologic Significance IL-8 −0.0175 0.0089 0.0472 0.9896 [0.9657–0.9999] ↑ 1.74% Reduced Risk ↑ indicates increased risk. ",
  "metadata": {
    "Title of this paper": "Immunomodulation of Periodontitis with SPMs",
    "Journal it was published in:": "Dentistry Journal",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468743/"
  }
}