{
  "title": "Paper_269",
  "abstract": "pmc JAMA Netw Open JAMA Netw Open 3211 jamasd JAMA Network Open 2574-3805 pmc-is-collection-domain yes pmc-collection-title JAMA Network PMC12485646 PMC12485646.1 12485646 12485646 41026484 10.1001/jamanetworkopen.2025.34953 zoi250976 1 Research Original Investigation Online Only Pediatrics Adverse Events Following Short-Course Systemic Corticosteroids Among Children and Adolescents A Systematic Review and Meta-Analysis Adverse Events Following Short-Course Corticosteroids Among Children and Adolescents Adverse Events Following Short-Course Corticosteroids Among Children and Adolescents Lima João Pedro MD  1  2 Chowdhury Saifur R. MPH  1  3 Tangamornsuksan Wimonchat PharmD PhD  1 Zhai Chunjuan MD  9 Chu Xiajing MPH  1 Matos Silva Jessyca MD  1 Kabir Humayun MSc  1  4 Chowdhury Mahmudur Rahman BScN  4 Couban Rachel MA  2 Walsh Michael MD PhD  1  7  10 Rochwerg Bram MD MSc  1  7 Eltorki Mohamed MBChB MSc  5  6 Guyatt Gordon H. MD MSc OC  1  7  8 Chu Derek MD PhD  1  7 1 2 3 4 5 6 7 8 9 10 Article Information Accepted for Publication: Published: 10.1001/jamanetworkopen.2025.34953 Open Access: CC-BY License JAMA Network Open Corresponding Author: limaj1@mcmaster.ca Author Contributions: Concept and design: Acquisition, analysis, or interpretation of data: Drafting of the manuscript: Critical review of the manuscript for important intellectual content: Statistical analysis: Administrative, technical, or material support: Supervision: Conflict of Interest Disclosures: Data Sharing Statement: Supplement 2 30 9 2025 9 2025 8 9 498065 e2534953 16 4 2025 3 8 2025 30 09 2025 02 10 2025 03 10 2025 Copyright 2025 Lima JP et al. JAMA Network Open https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the CC-BY License. jamanetwopen-e2534953.pdf This systematic review and meta-analysis investigates whether short-term use of systemic corticosteroids is associated with adverse events among children and adolescents. Key Points Question What adverse events are associated with the use of systemic corticosteroids for 14 days or less in children and adolescents? Findings This systematic review and meta-analysis including 45 eligible trials involving 6470 children and adolescents found with moderate quality of evidence that corticosteroids were associated with an increased risk of hyperglycemia and sleep disturbance. Corticosteroids were also associated with increased risk of gastrointestinal bleeding, but the quality of evidence was low. Meaning These findings suggest that an individualized approach to short-term corticosteroid use in children and adolescents may be warranted and that further research is needed to obtain better quality of evidence. Importance Short courses of systemic corticosteroids are used in the management of a number of acute clinical conditions, including Bell palsy, croup, and pneumonia, but research on associations of corticosteroid use with adverse events (AEs) in children is limited. Objective To document AEs associated with short-term (≤14 days) use of systemic corticosteroids in children and adolescents (1 to younger than 18 years) across different clinical conditions. Data Sources MEDLINE, Embase, and the Cochrane Central Register of Controlled Trials (CENTRAL) databases were searched from inception to February 2025. Reference lists of eligible articles and related systematic reviews were also searched. Study Selection Randomized clinical trials evaluating AEs (any unfavorable and unintended signs, symptoms, or syndromes that occurred during the period of using an investigational product) after use of short-course systemic corticosteroids in children and adolescents were included. Data Extraction and Synthesis Using the Preferred Reporting Items for Systematic Reviews and Meta-Analyses reporting guideline, pairs of reviewers independently reviewed abstracts, extracted data, and assessed risk of bias of eligible trials. Pairwise, fixed-effects meta-analyses were performed using Mantel-Haenszel methods with risk difference (RD). Main Outcomes and Measures The primary outcomes were serious AEs (events resulting in death, life-threatening conditions, hospitalization, or substantial disability), AEs leading to discontinuation, hyperglycemia, sleep disturbances, change in behavior, and gastrointestinal bleeding. RDs were reported as AEs per 1000 patients with 95% CIs. The Grading of Recommendations Assessment, Development and Evaluation approach was used to assess the certainty of evidence (high, moderate, low, or very low certainty). Results A total of 45 eligible trials that included 6470 children (mean [SD] age, 5.57 [3.62] years; 3753 male [58%]) were identified. In pooled analysis, there was moderate certainty evidence that compared with usual care, corticosteroids were not associated with serious AEs (RD, 1 fewer AE per 1000 patients [95% CI], 9 fewer to 7 more AEs per 1000 patients]), AEs leading to discontinuation (RD, 4 more AEs per 1000 patients [95% CI, 3 fewer to 11 more AEs per 1000 patients]), or change in behavior (RD, 8 more AEs per 1000 patients [95% CI, 5 fewer to 21 more AEs per 1000 patients]). With moderate certainty evidence, corticosteroids were associated with an increased risk of hyperglycemia (RD, 38 more AEs per 1000 patients [95% CI, 11 to 64 more AEs per 1000 patients]) and sleep problems (RD, 15 more AEs per 1000 patients [95% CI, 1 to 28 more AEs per 1000 patients]). Corticosteroid use was also associated with an increased risk of gastrointestinal bleeding (RD, 13 more per AEs per 1000 patients [95% CI, 3 to 23 more AEs per 1000 patients]), but the certainty of evidence was low. Conclusions and Relevance In this systematic review and meta-analysis of randomized trials, there was moderate certainty evidence that corticosteroids were associated with an increased risk of hyperglycemia and sleep problems and low certainty evidence that corticosteroids were associated with increased risk of gastrointestinal bleeding, but these AEs were very seldom serious. These findings suggest that an individualized approach to short-term corticosteroid use may be warranted and that further research is needed to obtain better quality of evidence. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf no pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Corticosteroids are immunosuppressant anti-inflammatory drugs that, over the decades, have been widely used to treat a variety of children’s illnesses including asthma, croup, and urticaria. 1 2 3 4 5 6 7 In adults, the treatment of corticosteroid-associated adverse events (AEs) represents a substantial financial burden to patients and health care systems. 8 9 10 11 12 A major limitation of prior individual studies, and even systematic reviews of studies of individual clinical conditions, is relatively small numbers of patients, resulting in imprecision of estimates and low certainty evidence. While effectiveness of corticosteroids is likely to differ across clinical conditions, adverse effects are likely to be very similar. Therefore, we undertook a systematic review and meta-analysis of randomized clinical trials (RCTs) to investigate the harms of short-term use of systemic corticosteroids in patients between 1 and younger than 18 years that can be generalized across a variety of pediatric clinical conditions. We limited our population to those older than 1 year because of the rapid physiological and behavioral changes that occur before 1 year but not after that age. Methods This systematic review and meta-analysis adhered to the 2020 Preferred Reporting Items for Systematic Reviews and Meta-Analyses ( PRISMA 13 14 CRD42023400934 Literature Search With the help of a health science librarian, we searched MEDLINE, Embase, and the Cochrane Central Register of Controlled Trials (CENTRAL) databases from inception to February 2025 using a combination of keywords and medical subject headings terms related to systemic corticosteroids and AEs (eMethods in Supplement 1 1 6 7 15 Eligibility Criteria We included published RCTs evaluating the harms of short-course systemic (oral, sublingual, rectal, intravenous, intramuscular, and subcutaneous) corticosteroids in any condition. Eligible RCTs included noncritically ill children aged 1 to younger than 18 years and reported on AEs during short-course use of systemic corticosteroids—dexamethasone, prednisolone, prednisone, and methylprednisolone plus prednisone and hydrocortisone at any dose—vs placebo or nonsteroidal standard of care. We defined AEs as any unfavorable and unintended signs, symptoms, or syndromes that occur during the period of using an investigational product, regardless of their perceived relationship to the product 16 adverse events adverse drug reactions side effects harms safety toxicity Study Selection Using Covidence systematic review software (Veritas Health Innovation), pairs of reviewers (S.R.C., W.T., C.Z., X.C., J.M.S., H.K., and M.R.C.) worked independently and in duplicate to screen titles and abstracts and, subsequently, full texts of the potentially eligible trials. Reviewers resolved disagreements by consensus or, if necessary, by consultation with a third reviewer (J.P.L.). Data Extraction Pairs of reviewers (S.R.C., W.T., C.Z., X.C., J.M.S., H.K., and M.R.C.) independently extracted data from the eligible trials using a standardized data extraction form and resolved disagreements by discussion or, when necessary, through adjudication by a third reviewer (J.P.L.). Reviewers collected information describing trial characteristics (publication year, trial registration, designs, and country), patient characteristics (age, sex, comorbidities, setting, and conditions for which corticosteroids were used), intervention descriptions (corticosteroid molecule, route of administration, and doses), and extracted data on all AEs reported in the trials from the intention-to-treat population, and if not reported, in preferred order: modified intention-to-treat, per-protocol, and as-treated population. If authors reported data at different time points, we extracted data from the latest time point at which the intervention was still in use. Risk of Bias Assessment Pairs of reviewers (S.R.C., W.T., C.Z., X.C., J.M.S., H.K., and M.R.C.) independently performed the risk of bias assessment using the modified Cochrane tool for assessing the risk of bias in randomized trials, and resolved any disagreements, when necessary, by consensus or consultation with another reviewer (J.P.L.). We considered bias arising in the randomization process; bias due to inadequate allocation concealment; bias owing to unblinding of patients, health care practitioners, and outcome assessors; and bias from missing outcome data. We rated each domain as either low risk of bias, probably low risk of bias, probably high risk of bias, or high risk of bias. Statistical Analysis We performed all analyses using the meta and metafor packages in R version 4.03 (R Foundation for Statistical Computing). A 2-sided P < .05 was considered significant. Primary Analysis We conducted pairwise meta-analysis for all AEs, in which at least 2 studies reported at least 1 event (eFigure 1 in Supplement 1 17 Supplement 1 Subgroup and Sensitivity Analyses When there were at least 2 studies per subgroup reporting at least 1 event, we performed a priori subgroup analyses based on medication route (oral vs other routes), dose (high-dose vs low-dose; high-dose defined as ≥1 mg/kg/d of prednisone), treatment duration (≤7 days vs >7 to 14 days), and clinical condition. We hypothesized that intravenous or intramuscular, more than 7 days’ use, and higher doses of corticosteroids would be associated with a higher risk of AEs. To determine the glucocorticoid outcome, we used the following corticosteroid conversions: 1 mg of dexamethasone = 26.7 mg of hydrocortisone = 5.3 mg of methylprednisolone or prednisolone = 6.7 mg of prednisone. 18 19 20 Certainty of Evidence Assessment The Grading of Recommendations Assessment, Development and Evaluation (GRADE) approach guided the certainty of evidence assessment for each outcome. The outcomes were rated as high, moderate, low, or very low certainty of evidence. Eligible trials started as high certainty of evidence and were rated down for risk of bias, inconsistency, imprecision, indirectness, or publication bias. Based on a recent GRADE guidance, 21 22 We developed a summary of findings table using the MAGICapp. In the table, AEs were grouped together based on the system organ classes (eg, gastrointestinal disorders) from the Medical Dictionary for Regulatory Activities. 23 Results Our search identified 18 517 articles from database searching and 4 records from citation searching. After removing duplicates, we screened titles and abstracts of 15 572 articles and excluded 15 182 articles. The main reasons for exclusion at this stage were the absence of randomization procedures, inclusion of adult populations, and corticosteroid use exceeding 14 days. After full text review, 45 RCTs proved eligible. 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 Figure 1 Figure 1. Flow Diagram of Selected Studies ADR indicates adverse drug reaction; RCT, randomized clinical trial. Trial and Participants Characteristics Forty-five studies included 6470 children with a mean (SD) age of 5.57 (3.62) years, and 3753 (58%) were male. The majority were conducted in Europe and North America (31 studies 25 26 27 28 29 30 32 33 37 38 39 40 41 42 43 44 45 47 48 49 51 52 53 57 58 59 61 62 63 66 67 34 35 36 46 50 54 55 56 60 64 65 68 24 31 36 40 41 44 55 58 26 39 42 45 62 46 48 60 63 68 Of all trials, 17 (including 2421 participants) investigated dexamethasone, 25 26 34 35 36 39 40 41 42 44 45 51 55 58 59 62 63 27 33 46 48 49 50 54 60 61 65 66 67 68 24 28 29 30 31 32 38 43 47 56 57 64 37 52 53 25 27 33 34 35 36 39 40 41 42 44 45 46 48 49 50 53 54 55 58 60 61 62 63 65 67 68 24 26 28 30 31 32 37 38 39 43 47 51 52 56 57 59 64 66 25 27 28 31 33 34 35 36 38 40 41 42 43 44 45 46 48 49 50 52 53 54 55 58 60 61 62 63 64 65 67 68 24 26 30 32 37 39 51 56 57 59 66 29 47 Table 1 Table 1. Study Characteristics Source Trial registration Funding Country Age, mean, y Participants randomized, No. Male, No. (%) Inpatient, No. (%) Clinical condition Intervention Griffin et al, 33 NR Institutional US 7.70 56 33 (59) 56 (100) Sickle cell disease Methylprednisolone: 2 doses of 15 mg/kg IV for 2 d Hoffman et al, 35 NR None Indonesia 10.20 38 23 (61) 38 (100) Cerebral malaria Dexamethasone: initial dose of 3 mg/kg, followed by 6 doses of 1.4 mg/kg 4 times daily IV for 2 d Hoke et al, 36 NR Government Thailand 8.73 55 39 (71) 55 (100) Japanese encephalitis Dexamethasone: 0.6 mg/kg as a loading dose followed by 0.2 mg/kg 4 times daily IV for 5 d Johnson et al, 39 NR Industry Canada 2.00 96 67 (69) 0 Acute laryngotracheobronchitis (croup) Dexamethasone: 0.6 mg/kg IM once Kanra et al, 40 NR NR Türkiye 7.10 53 32 (60) 53 (100) Pneumococcal meningitis Dexamethasone: 0.6 mg/kg/d divided into 4 daily doses IV for 4 d King et al, 41 NR Not-for-profit foundation Canada 1.00 101 45 (45) 101 (100) Suspected bacterial meningitis Dexamethasone: 0.6 mg/kg/d every 6 h IV for 4 d Babl et al, 24 ANZCTR: ACTRN12615 Industry, Government Australia and New Zealand 10.37 187 90 (48) 0 Bell palsy Prednisolone: 1 mg/kg/d oral for 10 d Lebel et al, 44 NR Institutional US 1.29 200 105 (53) 200 (100) Bacterial meningitis Dexamethasone: 0.15 mg/kg every 6 h IV for 4 d Lv et al, 46 NR NR China 5.64 120 73 (61) 120 (100) Refractory mycoplasma pneumonia Methylprednisolone: 2 mg/kg/d IV for 7 d Medeiros et al, 47 NR Government US 10.00 45 5 (11) 13 (29) Acute hemarthrosis Prednisolone: 2mg/kg/d divided into 3 daily doses oral for 2 d Newburger et al, 49 ClinicalTrials.gov: NCT00132080 Government Canada and US 2.90 198 122 (62) 198 (100) Kawasaki disease Methylprednisolone: 30 mg/kg IV once Ogata et al, 50 UMIND: UMIN000005021 Government Japan 3.45 48 24 (50) 48 (100) Kawasaki disease Methylprednisolone: 30 mg/kg IV once Panickar et al, 52 UK Clinical Study Registry: ISRCTN58363576 Not-for-profit foundation UK 2.17 687 443 (64) 687 (100) Acute virus-induced wheezing Prednisone: 10 mg once a day for children ≤24 mos and 20 mg once a day for children >24 mos oral for 5 d Prakash et al, 54 NR NR India 15.81 52 36 (69) 52 (100) Solitary cysticercus granuloma with new-onset seizures Methylprednisolone: 1.0 g/1.72 m 2 Qazi et al, 55 NR Institutional Pakistan 3.16 89 54 (61) 89 (100) Suspected bacterial meningitis Dexamethasone: 0.6 mg/kg/d in 4 divided doses IV for 4 d Ranakusuma et al, 56 ANZCTR: ACTRN12618 Government Indonesia 5.58 62 33 (53) 0 Acute otitis media Prednisolone: 10 mg/d for children aged 6 mos to 2 y, 20 mg/d for children aged 2-6 y; and 30 mg/d for children aged 6-12 y oral for 5 d Ruohola et al, 57 NR Institutional Finland 1.91 50 28 (56) 0 Acute otitis media Prednisolone: 2 mg/kg/d divided in 3 equal doses oral for 3 d Schaad et al, 58 NR Industry Switzerland 3.00 115 69 (60) 115 (100) Bacterial meningitis Dexamethasone: 0.4 mg/kg every 12 h IV for 2 d Shaikh et al, 59 ClinicalTrials.gov: NCT01391793 Government US 1.58 546 44 (8) 0 Urinary tract infection Dexamethasone: 0.15 mg/kg twice daily oral for 3 d Shan et al, 60 NR Government China 7.34 112 57 (51) 112 (100) Refractory mycoplasma pneumonia Methylprednisolone: 2 mg/kg/d IV for 3 d Tagarro et al, 63 ClinicalTrials.gov: NCT01261546 Government Spain 4.70 60 25 (42) 60 (100) Parapneumonic pleural effusion Dexamethasone: 0.25 mg/kg every 6 h IV for 2 d Olympia et al, 51 NR NR US 11.94 125 52 (42) 0 Pharyngitis Dexamethasone: 0.6 mg/kg oral once Kuusela et al, 42 NR NR Finland 2.85 72 56 (78) 72 (100) Acute laryngotracheobronchitis (croup) Dexamethasone: 0.6 mg/kg IM once Bernini et al, 25 NR Not-for-profit foundation US 6.21 43 29 (67) 43 (100) Sickle cell disease Dexamethasone: 0.3 mg/kg every 12 h IV for 2 d Bjornson et al, 26 NR Institutional, not-for-profit Canada 2.92 720 439 (61) 0 Acute laryngotracheobronchitis (croup) Dexamethasone: 0.6 mg/kg oral once Carcao et al, 27 ClinicalTrials.gov: NCT00376077 Not-for-profit foundation Canada 9.40 32 22 (69) 32 (100) Immune thrombocytopenia Methylprednisolone: 30 mg/kg IV once Connett et al, 28 NR NR US 4.85 70 49 (70) 70 (100) Acute asthma Prednisolone: 2 mg/kg oral once Dudley et al, 30 UK Clinical Study Registry: ISRCTN71445600 Government UK 6.00 352 194 (55) 0 Henoch-Schönlein purpura Prednisolone: 2 mg/kg/d for 7 d followed by 1 mg/kg/d for 7 d oral Foster et al, 31 ANZCTR: ACTRN12612 Government Australia 3.44 624 420 (67) 624 (100) Acute virus-induced wheezing Prednisolone: 1 mg/kg/d oral for 3 d Francis et al, 32 UK Clinical Study Registry: ISRCTN49798431 Government UK 5.19 389 216 (56) 0 Otitis media Prednisolone: 20 mg/d for children aged 2-5 y or 30 mg/d for children aged 6-8 y oral for 7 d Tam et al, 64 UK Clinical Study Registry: ISRCTN39575233 Not-for-profit foundation Vietnam 13.00 225 161 (72) 225 (100) Dengue Prednisolone: 2 mg/kg or 0.5 mg/kg once daily oral for 3 d Tassniyom et al, 65 NR Institutional, not-for-profit Thailand 6.61 63 32 (51) 63 (100) Dengue Methylprednisolone: 30 mg/kg IV once Usta et al, 67 ClinicalTrials.gov: NCT02002078 None Türkiye 4.10 83 45 (54) 83 (100) Caustic esophageal burns Methylprednisolone: 1 g/1.73 m 2 Wang et al, 68 NR NR China 6.65 60 32 (53) 60 (100) Mycoplasma pneumoniae pneumonia Methylprednisolone: 2 mg/kg/d IV for 5 d Pierson et al, 53 NR Not-for-profit foundation US 12.06 45 28 (62) 45 (100) Acute asthma (1) hydrocortisone: 7 mg/kg as an immediate or priming dose, followed by 7 mg/kg/d administered continuously by IV infusion; (2) dexamethasone: 0.3 mg/kg, given immediately followed by 0.3 mg/kg/24 h by continuous IV infusion; (3) betamethasone: 0.3 mg/kg, as a primary dose followed by 0.3 mg/kg/d by continuous IV infusion in 24 h Huber et al, 37 UK Clinical Study Registry: ISRCTN85109383 NR Canada 5.52 40 20 (50) 0 Henoch-Schönlein purpura Prednisone: 2 mg/kg for 7 days, followed by a weaning dose of prednisone for the next 7 days oral Csonka et al, 29 NR Not-for-profit foundation Finland 1.41 230 150 (65) 123 (53) Viral respiratory infection–induced lower airway disease Prednisolone: 2 mg/kg/d in 2 divided daily doses oral for 4 d Sundel et al, 61 NR Not-for-profit foundation US 4.39 39 27 (69) 39 (100) Kawasaki disease Methylprednisolone: 30 mg/kg IV once Harel et al, 34 NR NR Israel 2.75 49 NR 49 (100) Septic arthritis Dexamethasone: 0.15 mg/kg every 6 h IV for 4 d Kvien et al, 43 NR Not-for-profit foundation Norway 10.54 20 5 (25) 20 (100) Juvenile rheumatoid arthritis Prednisolone: 0.4 mg/kg/d oral for 7 d Jartti et al, 38 NR Industry, government, not-for-profit Finland 2.60 59 39 (66) 59 (100) Recurrent wheezing Prednisolone: 2 mg/kg/d oral for 3 d Leipzig et al, 45 NR NR US 1.76 30 NR 30 (100) Acute laryngotracheobronchitis (croup) Dexamethasone: 0.3 mg/kg at the time of admission and repeated in 2 h IM Nagy et al, 48 EudraCT: 2007-006602-24 Not-for-profit foundation Hungary 4.91 59 35 (59) 59 (100) Community-acquired pneumonia Methylprednisolone: 0.5-2.0 mg/kg IV for 5 d Unüvar et al, 66 NR NR Türkiye 4.74 42 22 (52) 0 Bell palsy Methylprednisolone: 1 mg/kg/d oral for 14 d Super et al, 62 NR NR US 1.30 29 19 (66) 29 (100) Acute laryngotracheobronchitis (croup) Dexamethasone: 0.6 mg/kg IV or IM once Abbreviations: ANZCTR, Australian New Zealand Clinical Trials Registry; EudraCT, European Union Drug Regulating Authorities Clinical Trials Database; IM, intramuscular; IV, intravenous; NR, not reported; UMIN, University Hospital Medical Information Network. Risk of Bias Assessment Of the 45 eligible trials, 15 trials 25 38 39 46 48 50 51 54 56 59 60 61 66 67 68 39 46 48 50 54 56 60 61 66 67 68 46 48 50 54 60 61 66 68 46 48 50 54 60 61 66 67 68 Table 2 Table 2. Risk of Bias Assessment Source Risk of bias by domain 1: Was the allocation sequence adequately generated? 2: Was the allocation adequately concealed? 3: Were patients blinded? 4: Were health care practitioners blinded? 5: Were data collectors blinded? 6: Was loss to follow-up (missing outcome data) infrequent? Griffin et al, 33 Definitely yes Probably yes Probably yes Definitely yes Probably yes Definitely yes Hoffman et al, 35 Definitely yes Definitely yes Probably yes Probably yes Probably yes Definitely yes Hoke et al, 36 Definitely yes Probably yes Probably yes Probably yes Probably yes Definitely yes Johnson et al, 39 Definitely yes Definitely yes Definitely no Probably yes Probably yes Definitely no Kanra et al, 40 Definitely yes Probably yes Probably yes Probably yes Probably yes Definitely yes King et al, 41 Definitely yes Probably yes Probably yes Probably yes Probably yes Definitely yes Babl et al, 24 Definitely yes Definitely yes Definitely yes Definitely yes Definitely yes Probably yes Lebel et al, 44 Definitely yes Probably yes Probably yes Probably yes Probably yes Definitely yes Lv et al, 46 Probably yes Probably no Probably no Probably no Probably no Definitely yes Medeiros et al, 47 Probably yes Probably yes Probably yes Probably yes Probably yes Definitely yes Newburger et al, 49 Probably yes Probably yes Probably yes Probably yes Probably yes Definitely yes Ogata et al, 50 Definitely yes Probably no Definitely no Definitely no Definitely no Definitely yes Panickar et al, 52 Definitely yes Definitely yes Definitely yes Definitely yes Definitely yes Definitely yes Prakash et al, 54 Definitely yes Probably no Definitely no Definitely no Definitely no Definitely yes Qazi et al, 55 Definitely yes Definitely yes Definitely yes Definitely yes Probably yes Definitely yes Ranakusuma et al, 56 Definitely yes Definitely yes Definitely no Definitely yes Definitely yes Definitely yes Ruohola et al, 57 Definitely yes Probably yes Probably yes Probably yes Probably yes Definitely yes Schaad et al, 58 Definitely yes Probably yes Definitely yes Definitely yes Definitely yes Definitely yes Shaikh et al, 59 Definitely yes Definitely yes Definitely yes Definitely yes Definitely yes Definitely no Shan et al, 60 Definitely yes Probably yes Definitely no Definitely no Definitely no Probably yes Tagarro et al, 63 Definitely yes Definitely yes Definitely yes Definitely yes Definitely yes Definitely yes Olympia et al, 51 Definitely yes Definitely yes Probably yes Probably yes Probably yes Definitely no Kuusela et al, 42 Probably yes Probably yes Probably yes Probably yes Probably yes Definitely yes Bernini et al, 25 Definitely yes Definitely yes Definitely yes Definitely yes Definitely yes Definitely no Bjornson et al, 26 Definitely yes Definitely yes Definitely yes Probably yes Probably yes Definitely yes Carcao et al, 27 Definitely yes Definitely yes Definitely yes Definitely yes Definitely yes Definitely yes Connett et al, 28 Definitely yes Definitely yes Probably yes Probably yes Probably yes Definitely yes Dudley et al, 30 Definitely yes Definitely yes Definitely yes Definitely yes Definitely yes Definitely yes Foster et al, 31 Definitely yes Definitely yes Definitely yes Definitely yes Definitely yes Definitely yes Francis et al, 32 Definitely yes Definitely yes Definitely yes Definitely yes Definitely yes Definitely yes Tam et al, 64 Definitely yes Definitely yes Definitely yes Definitely yes Definitely yes Definitely yes Tassniyom et al, 65 Definitely yes Probably yes Definitely yes Definitely yes Definitely yes Definitely yes Usta et al, 67 Probably yes Probably no Probably no Definitely yes Probably no Definitely yes Wang et al, 68 Probably yes Probably no Probably no Probably no Probably no Definitely yes Pierson et al, 53 Probably yes Definitely yes Probably yes Probably yes Probably yes Definitely yes Huber et al, 37 Definitely yes Definitely yes Definitely yes Definitely yes Definitely yes Definitely yes Csonka et al, 29 Definitely yes Definitely yes Definitely yes Definitely yes Definitely yes Definitely yes Sundel et al, 61 Probably yes Probably no Definitely no Definitely no Definitely no Definitely yes Harel et al, 34 Definitely yes Definitely yes Definitely yes Definitely yes Definitely yes Definitely yes Kvien et al, 43 Probably yes Probably yes Definitely yes Definitely yes Definitely yes Definitely yes Jartti et al, 38 Probably no Probably yes Definitely yes Definitely yes Definitely yes Definitely yes Leipzig et al, 45 Probably yes Probably yes Definitely yes Definitely yes Definitely yes Definitely yes Nagy et al, 48 Definitely yes Probably yes Definitely no Definitely no Definitely no Definitely yes Unüvar et al, 66 Definitely yes Probably yes Probably no Probably no Probably no Definitely yes Super et al, 62 Definitely yes Definitely yes Definitely yes Definitely yes Definitely yes Definitely yes AEs Of the 36 AEs that we were able to meta-analyze, 31 did not show any compelling difference between corticosteroids and the control group. Table 3 Supplement 1 Figure 2 Table 3. Summary of Findings Outcome Participants, studies, and events, No. Risk difference, adverse events per 1000 patients (95% CI) Certainty of the evidence (quality) Serious adverse events 3418 participants in 19 studies 24 26 27 31 32 34 38 43 45 48 49 50 56 59 60 62 63 64 66 1 (−9 to 7) Moderate a Adverse events leading to discontinuation 2892 participants in 16 studies 29 31 33 34 37 38 43 45 48 52 58 59 60 62 64 66 4 (−3 to 11) Moderate a Abdominal pain 2410 participants in 15 studies 24 26 30 37 34 38 43 45 48 51 54 59 60 62 66 5 (−3 to 13) Moderate a Diarrhea 3280 participants in 19 studies 24 26 29 30 32 34 38 43 45 46 48 56 57 59 60 62 64 66 68 −1 (−12 to 9) Moderate a Gastritis 488 participants in 10 studies 34 38 43 45 47 48 56 60 62 66 −4 (−25 to 16) Low b Gastrointestinal bleeding 2555 participants in 22 studies 25 26 30 33 34 35 36 38 39 40 41 43 44 45 48 55 58 60 62 63 64 66 13 (3 to 23) Low c , d Hemoccult-positive stool 774 participants in 11 studies 34 38 41 43 44 45 48 58 60 62 66 22 (−10 to 54) Very low b , d Intussusception 771 participants in 10 studies 30 34 37 38 43 45 48 60 62 66 −8 (−17 to 1) Low b Nausea 1486 participants in 14 studies 24 27 30 32 34 38 43 45 48 51 56 60 62 66 −8 (−22 to 5) Moderate a Vomiting 2857 participants in 19 studies 24 28 29 30 34 38 43 45 46 48 51 52 56 59 60 61 62 66 68 −4 (−14 to 6) Low a , e Hyperglycemia f 792 participants in 12 studies 25 34 38 43 45 48 60 62 63 64 66 67 38 (11-64) Moderate f Decreased appetite 977 participants in 11 studies 24 32 34 38 43 45 48 60 62 66 68 −10 (−22 to 1) Low b Increased appetite 1024 participants in 12 studies 24 32 34 38 43 45 47 48 56 60 62 66 15 (−6 to 37) Moderate a Glycosuria g 778 participants in 10 studies 30 34 36 38 43 45 48 60 62 66 36 (16 to 55) Low a , f Polyuria 980 participants in 11 studies 24 30 34 38 43 45 48 56 60 62 66 −2 (−19 to 14) Low b Sleep problems 1525 participants in 12 studies 24 32 34 38 43 45 48 56 59 60 62 66 15 (1 to 28) Moderate e Headache 1754 participants in 16 studies 24 27 28 30 32 34 38 43 45 48 49 51 56 60 62 66 −6 (−20 to 9) Moderate a Change in behavior 1448 participants in 13 studies 24 30 32 33 34 38 43 45 48 51 60 62 66 8 (−5 to 21) Moderate a Convulsion or seizure 482 participants in 10 studies 34 35 38 43 45 48 60 62 65 66 17 (−3 to 36) Low b Febrile convulsion 1326 participants in 10 studies 26 34 38 43 45 48 60 62 64 66 3 (−1 to 6) Low b Irritability 1451 participants in 10 studies 26 30 34 38 43 45 48 60 62 66 0 (−5 to 5) Low b Dizziness 566 participants in 10 studies 34 38 43 45 48 51 60 62 66 68 −4 (−10 to 3) Very low b , e Tremor and/or hyperactivity 1412 participants in 11 studies 28 31 32 34 38 43 45 48 60 62 66 4 (−8 to 16) Moderate a Fatigue 917 participants in 10 studies 24 32 34 38 43 45 48 60 62 66 −2 (−13 to 9) Low b Local or injection site pain 561 participants in 10 studies 34 38 43 45 46 48 60 62 63 66 0 (−14 to 14) Very low b , e Candidiasis 503 participants in 10 studies 34 38 43 45 48 56 60 62 63 66 8 (−7 to 23) Very low b , e Pneumonia 1481 participants in 13 studies 26 34 35 36 38 43 45 48 60 62 64 65 66 4 (−12 to 19) Low b Secondary (opportunistic) infection 929 participants in 12 studies 25 30 34 38 42 43 45 48 60 62 66 67 8 (−7 to 24) Low b Otitis media 1164 participants in 10 studies 26 34 38 43 45 48 60 62 65 66 −7 (−16 to 3) Low b Urinary tract infection 1186 participants in 11 studies 26 34 35 36 38 43 45 48 60 62 66 2 (−11 to 15) Low b Musculoskeletal pain Based on data from 1080 participants in 10 studies 30 32 34 38 43 45 48 60 62 66 −4 (−9 to 1) Very low b , e Myalgia 693 participants in 10 studies 24 34 38 43 45 48 51 60 62 66 3 (−3 to 9) Very low b , e Anemia 701 participants in 11 studies 34 38 43 45 48 49 56 60 62 63 66 −12 (−35 to 12) Low b Hypertension 1270 participants in 16 studies 25 30 33 34 38 43 45 48 50 53 60 61 62 64 66 67 1 (−6 to 9) Low b Congestive heart failure 618 participants in 10 studies 34 38 43 45 48 49 60 61 62 66 −5 (−15 to 3) Very low b , e Rash and urticaria 3098 participants in 20 studies 24 26 29 31 32 34 37 38 43 45 46 48 54 56 60 62 63 64 66 68 −3 (−9 to 3) Moderate a  a Imprecision: serious; confidence intervals crossing null effect (risk difference = 0).  b Imprecision: very serious; confidence intervals crossing null effect (risk difference = 0) and a small number of total events (<30).  c Inconsistency: serious; P I 2  d Indirectness: serious.  e Risk of bias: serious.  f Inconsistency for hyperglycemia: serious; ( I 2  g Inconsistency for glycosuria; serious ( I 2 P Figure 2. Summary of Risk Differences Across Outcomes AE indicates adverse event; SAE, serious adverse event. SAEs Nineteen studies, 24 26 27 31 32 34 38 43 45 48 49 50 56 59 60 62 63 64 66 Table 3 AE Leading to Discontinuation Sixteen studies, 29 31 33 34 37 38 43 45 48 52 58 59 60 62 64 66 Table 3 Hyperglycemia Twelve studies, 25 34 38 43 45 48 60 62 63 64 66 67 Table 3 Sleep Problems Twelve studies, 24 32 34 38 43 45 48 56 59 60 62 66 Table 3 Change in Behavior Thirteen studies, 24 30 32 33 34 38 43 45 48 51 60 62 66 Table 3 24 32 51 30 Gastrointestinal Bleeding Twenty-two studies, 25 26 30 33 34 35 36 38 39 40 41 43 44 45 48 55 58 60 62 63 64 66 Table 3 Subgroup and Sensitivity Analyses For gastrointestinal bleeding, we found a statistically significant subgroup association based on the route of administration (intravenous or intramuscular: RD, 35 more per AEs per 1000 patients [95% CI, 9 to 61 more AEs per 1000 patients]; oral: RD, 1 fewer AE per 1000 patients [95% CI, 9 fewer to 8 more AEs per 1000 patients]; P Supplement 1 Supplement 1 Supplement 1 Discussion This systematic review and meta-analysis found moderate certainty evidence that using systemic corticosteroids for a short duration (≤14 days) in a pediatric population was associated with a small increase in the risk of nonserious hyperglycemia and sleep problems. Corticosteroids were also associated with an increased risk of gastrointestinal bleeding, but the certainty of evidence was low. Our results also demonstrated that corticosteroids were not associated with the risk of SAEs. A previous systematic review 7 7 7 Table 3 6 69 Several findings from our study align with results from other systematic reviews and meta-analyses in adult and pediatric populations. Previous reviews, one investigating the AEs of corticosteroids in children with acute respiratory conditions 6 70 Our results from gastrointestinal bleeding, on the other hand, differ from prior reviews. Fernandes and colleagues 6 71 Even though we found no credible subgroup association based on clinical condition, a significant proportion of gastrointestinal bleeding events happened in trials involving patients with central nervous system infections (mostly meningitis). The role of adjunctive corticosteroids in pediatric bacterial meningitis, however, remains controversial. The latest Cochrane review 72 73 74 Supplement 1 The importance of our work is that by looking across clinical conditions we were able to achieve sample sizes that were sufficient to result in sufficiently narrow confidence intervals to provide moderate certainty evidence of steroid associations with AE. Our research shows that corticosteroids—even when prescribed for a short period of time—were not harmless but rather were associated with an increased risk of AEs, including gastrointestinal bleeding, sleep disturbance, and hyperglycemia. The magnitude of the association was, however, small—less than 4% for hyperglycemia and less than 1.5% for the other outcomes. These results can inform both clinical practice guidelines and clinical practice. The impact on decision-making will depend on the importance patients and families place on the small increase in relatively minor AEs. The methodology used in this systematic review and meta-analysis—pooling data on AEs reported in RCTs regardless of clinical condition—should be widely used for medications, such as corticosteroids, with several clinical indications. Future research should not only focus on similar reviews for other classes of medications but also on developing methodological guidance for those interested in conducting their own reviews. Limitations The limitations of our study relate to limitations in AE reporting in RCTs. 75 Supplement 1 Conclusions This systematic review and meta-analysis of short-course use of corticosteroids in pediatric populations found that corticosteroids were associated with an increased risk of hyperglycemia and sleep problems, but these AEs were very seldom, if ever serious. Future research should not only focus on similar reviews for other classes of medications but also on developing methodological guidance. References 1 Chu X Wang J Ologundudu L Efficacy and safety of systemic corticosteroids for urticaria: a systematic review and meta-analysis of randomized clinical trials J Allergy Clin Immunol Pract 2024 12 7 1879 1889.e8 10.1016/j.jaip.2024.04.016 38642709 2 Smith DK McDermott AJ Sullivan JF Croup: diagnosis and management Am Fam Physician 2018 97 9 575 580 29763253 3 Wolfson DH Nypaver MM Blaser M Hogan A Evans R III Davis AT A controlled trial of methylprednisolone in the early emergency department treatment of acute asthma in children Pediatr Emerg Care 1994 10 6 335 338 10.1097/00006565-199412000-00008 7899118 4 Ferrara G Petrillo MG Giani T Clinical use and molecular action of corticosteroids in the pediatric age Int J Mol Sci 2019 20 2 444 10.3390/ijms20020444 30669566 PMC6359239 5 Statistics Canada 2012 https://www150.statcan.gc.ca/n1/pub/82-003-x/2021003/article/00001/tbl/tbl04-eng.htm 6 Fernandes RM Wingert A Vandermeer B Safety of corticosteroids in young children with acute respiratory conditions: a systematic review and meta-analysis BMJ Open 2019 9 8 e028511 10.1136/bmjopen-2018-028511 31375615 PMC6688746 7 Aljebab F Choonara I Conroy S Systematic review of the toxicity of short-course oral corticosteroids in children Arch Dis Child 2016 101 4 365 370 10.1136/archdischild-2015-309522 26768830 PMC4819633 8 Moure-Fernandez A Hollinghurst S Carroll FE Economic evaluation of the OSAC randomised controlled trial: oral corticosteroids for non-asthmatic adults with acute lower respiratory tract infection in primary care BMJ Open 2020 10 2 e033567 10.1136/bmjopen-2019-033567 32075830 PMC7045138 9 Tse G Ariti C Bafadhel M Oral corticosteroid-related healthcare resource utilization and associated costs in patients with COPD Adv Ther 2025 42 1 375 394 10.1007/s12325-024-03024-3 39560897 PMC11782346 10 Hodkinson A Kirkham JJ Tudur-Smith C Gamble C Reporting of harms data in RCTs: a systematic review of empirical assessments against the CONSORT harms extension BMJ Open 2013 3 9 e003436 10.1136/bmjopen-2013-003436 24078752 PMC3787508 11 Loke YK Price D Herxheimer A Cochrane Adverse Effects Methods Group Systematic reviews of adverse effects: framework for a structured approach BMC Med Res Methodol 2007 7 32 10.1186/1471-2288-7-32 17615054 PMC1933432 12 Hansen MP Scott AM McCullough A Adverse events in people taking macrolide antibiotics versus placebo for any indication Cochrane Database Syst Rev 2019 1 1 CD011825 10.1002/14651858.CD011825.pub2 30656650 PMC6353052 13 Page MJ McKenzie JE Bossuyt PM The PRISMA 2020 statement: an updated guideline for reporting systematic reviews BMJ 2021 372 71 10.1136/bmj.n71 PMC8005924 33782057 14 Zorzela L Loke YK Ioannidis JP PRISMAHarms Group PRISMA harms checklist: improving harms reporting in systematic reviews BMJ 2016 352 i157 10.1136/bmj.i157 26830668 15 Al Efraij K Johnson KM Wiebe D Sadatsafavi M FitzGerald JM A systematic review of the adverse events and economic impact associated with oral corticosteroids in asthma J Asthma 2019 56 12 1334 1346 10.1080/02770903.2018.1539100 30513226 16 US Department of Health and Human Services. E2D(R1) post-approval safety data: definitions and standards for management and reporting of individual case safety reports. Published March 2024. Accessed August 26, 2025. https://www.fda.gov/media/176977/download 17 Xu C Furuya-Kanamori L Zorzela L Lin L Vohra S A proposed framework to guide evidence synthesis practice for meta-analysis with zero-events studies J Clin Epidemiol 2021 135 70 78 10.1016/j.jclinepi.2021.02.012 33592277 18 Meikle AW Tyler FH Potency and duration of action of glucocorticoids. Effects of hydrocortisone, prednisone and dexamethasone on human pituitary-adrenal function Am J Med 1977 63 2 200 207 10.1016/0002-9343(77)90233-9 888843 19 Singer M Webb A Oxford Handbook of Critical Care Oxford University Press 2009 10.1093/med/9780199235339.001.0001 20 Schandelmaier S Briel M Varadhan R Development of the instrument to assess the credibility of effect modification analyses (ICEMAN) in randomized controlled trials and meta-analyses CMAJ 2020 192 32 E901 E906 10.1503/cmaj.200077 32778601 PMC7829020 21 Zeng L Brignardello-Petersen R Hultcrantz M GRADE guidance 34: update on rating imprecision using a minimally contextualized approach J Clin Epidemiol 2022 150 216 224 10.1016/j.jclinepi.2022.07.014 35934265 22 Santesso N Glenton C Dahm P GRADE Working Group GRADE guidelines 26: informative statements to communicate the findings of systematic reviews of interventions J Clin Epidemiol 2020 119 126 135 10.1016/j.jclinepi.2019.10.014 31711912 23 International Council for Harmonisation of Technical Requirements for Pharmaceuticals for Human Use http://www.meddra.org 24 Babl FE Herd D Borland ML Paediatric Research in Emergency Departments International Collaborative (PREDICT) Efficacy of prednisolone for Bell palsy in children: a randomized, double-blind, placebo-controlled, multicenter trial Neurology 2022 99 20 e2241 e2252 10.1212/WNL.0000000000201164 36008143 25 Bernini JC Rogers ZR Sandler ES Reisch JS Quinn CT Buchanan GR Beneficial effect of intravenous dexamethasone in children with mild to moderately severe acute chest syndrome complicating sickle cell disease Blood 1998 92 9 3082 3089 10.1182/blood.V92.9.3082 9787142 26 Bjornson CL Klassen TP Williamson J Pediatric Emergency Research Canada Network A randomized trial of a single dose of oral dexamethasone for mild croup N Engl J Med 2004 351 13 1306 1313 10.1056/NEJMoa033534 15385657 27 Carcao M Silva M David M A randomized, double-blinded, placebo controlled study of IVIG Vs. IVIG with high dose methylprednisolone in rapidly augmenting platelet counts in childhood ITP Blood 2016 128 22 868 10.1182/blood.V128.22.868.868 28 Connett GJ Warde C Wooler E Lenney W Prednisolone and salbutamol in the hospital treatment of acute asthma Arch Dis Child 1994 70 3 170 173 10.1136/adc.70.3.170 8135557 PMC1029734 29 Csonka P Kaila M Laippala P Iso-Mustajärvi M Vesikari T Ashorn P Oral prednisolone in the acute management of children age 6 to 35 months with viral respiratory infection-induced lower airway disease: a randomized, placebo-controlled trial J Pediatr 2003 143 6 725 730 10.1067/S0022-3476(03)00498-0 14657816 30 Dudley J Smith G Llewelyn-Edwards A Bayliss K Pike K Tizard J Randomised, double-blind, placebo-controlled trial to determine whether steroids reduce the incidence and severity of nephropathy in Henoch-Schonlein Purpura (HSP) Arch Dis Child 2013 98 10 756 763 10.1136/archdischild-2013-303642 23845696 31 Foster SJ Cooper MN Oosterhof S Borland ML Oral prednisolone in preschool children with virus-associated wheeze: a prospective, randomised, double-blind, placebo-controlled trial Lancet Respir Med 2018 6 2 97 106 10.1016/S2213-2600(18)30008-0 29373235 32 Francis NA Cannings-John R Waldron CA Oral steroids for resolution of otitis media with effusion in children (OSTRICH): a double-blinded, placebo-controlled randomised trial Lancet 2018 392 10147 557 568 10.1016/S0140-6736(18)31490-9 30152390 PMC6099122 33 Griffin TC McIntire D Buchanan GR High-dose intravenous methylprednisolone therapy for pain in children and adolescents with sickle cell disease N Engl J Med 1994 330 11 733 737 10.1056/NEJM199403173301101 8107739 34 Harel L Prais D Bar-On E Dexamethasone therapy for septic arthritis in children: results of a randomized double-blind placebo-controlled study J Pediatr Orthop 2011 31 2 211 215 10.1097/BPO.0b013e3182092869 21307717 35 Hoffman SL Rustama D Punjabi NH High-dose dexamethasone in quinine-treated patients with cerebral malaria: a double-blind, placebo-controlled trial J Infect Dis 1988 158 2 325 331 10.1093/infdis/158.2.325 3042874 36 Hoke CH Jr Vaughn DW Nisalak A Effect of high-dose dexamethasone on the outcome of acute encephalitis due to Japanese encephalitis virus J Infect Dis 1992 165 4 631 637 10.1093/infdis/165.4.631 1313068 37 Huber AM King J McLaine P Klassen T Pothos M A randomized, placebo-controlled trial of prednisone in early Henoch Schönlein Purpura [ISRCTN85109383] BMC Med 2004 2 7 10.1186/1741-7015-2-7 15059282 PMC400510 38 Jartti T Lehtinen P Vanto T Efficacy of prednisolone in children hospitalized for recurrent wheezing Pediatr Allergy Immunol 2007 18 4 326 334 10.1111/j.1399-3038.2007.00512.x 17584312 PMC7167944 39 Johnson DW Jacobson S Edney PC Hadfield P Mundy ME Schuh S A comparison of nebulized budesonide, intramuscular dexamethasone, and placebo for moderately severe croup N Engl J Med 1998 339 8 498 503 10.1056/NEJM199808203390802 9709042 40 Kanra GY Ozen H Seçmeer G Ceyhan M Ecevit Z Belgin E Beneficial effects of dexamethasone in children with pneumococcal meningitis Pediatr Infect Dis J 1995 14 6 490 494 10.1097/00006454-199506000-00005 7667053 41 King SM Law B Langley JM Dexamethasone therapy for bacterial meningitis: better never than late? Can J Infect Dis 1994 5 5 210 215 10.1155/1994/257198 22346503 PMC3250832 42 Kuusela AL Vesikari T A randomized double-blind, placebo-controlled trial of dexamethasone and racemic epinephrine in the treatment of croup Acta Paediatr Scand 1988 77 1 99 104 10.1111/j.1651-2227.1988.tb10606.x 3285638 43 Kvien TK Høyeraal HM Sandstad B Assessment methods of disease activity in juvenile rheumatoid arthritis–evaluated in a prednisolone/placebo double-blind study J Rheumatol 1982 9 5 696 702 7175841 44 Lebel MH Freij BJ Syrogiannopoulos GA Dexamethasone therapy for bacterial meningitis. Results of two double-blind, placebo-controlled trials N Engl J Med 1988 319 15 964 971 10.1056/NEJM198810133191502 3047581 45 Leipzig B Oski FA Cummings CW Stockman JA Swender P A prospective randomized study to determine the efficacy of steroids in treatment of croup J Pediatr 1979 94 2 194 196 10.1016/S0022-3476(79)80821-5 368299 46 Lv J Fan F Efficacy of methylprednisolone plus azithromycin in the treatment of RMPP and its effect on the changes of t lymphocyte subsets Evid Based Complement Alternat Med 2022 2022 1 1833195 10.1155/2022/1833195 35518348 PMC9064536 47 Medeiros D Laufenberg JA Miller KL Buchanan GR Short-term oral corticosteroid therapy for acute haemarthrosis in haemophilia patients with high-titer inhibitors Haemophilia 2007 13 1 85 89 10.1111/j.1365-2516.2006.01410.x 17212730 48 Nagy B Gaspar I Papp A Efficacy of methylprednisolone in children with severe community acquired pneumonia Pediatr Pulmonol 2013 48 2 168 175 10.1002/ppul.22574 22588852 49 Newburger JW Sleeper LA McCrindle BW Pediatric Heart Network Investigators Randomized trial of pulsed corticosteroid therapy for primary treatment of Kawasaki disease N Engl J Med 2007 356 7 663 675 10.1056/NEJMoa061235 17301297 50 Ogata S Ogihara Y Honda T Kon S Akiyama K Ishii M Corticosteroid pulse combination therapy for refractory Kawasaki disease: a randomized trial Pediatrics 2012 129 1 e17 e23 10.1542/peds.2011-0148 22144699 51 Olympia RP Khine H Avner JR Effectiveness of oral dexamethasone in the treatment of moderate to severe pharyngitis in children Arch Pediatr Adolesc Med 2005 159 3 278 282 10.1001/archpedi.159.3.278 15753273 52 Panickar J Lakhanpaul M Lambert PC Oral prednisolone for preschool children with acute virus-induced wheezing N Engl J Med 2009 360 4 329 338 10.1056/NEJMoa0804897 19164186 53 Pierson WE Bierman CW Kelley VC A double-blind trial of corticosteroid therapy in status asthmaticus Pediatrics 1974 54 3 282 288 10.1542/peds.54.3.282 4606117 54 Prakash S Garg RK Kar AM Intravenous methyl prednisolone in patients with solitary cysticercus granuloma: a random evaluation Seizure 2006 15 5 328 332 10.1016/j.seizure.2006.03.003 16621618 55 Qazi SA Khan MA Mughal N Dexamethasone and bacterial meningitis in Pakistan Arch Dis Child 1996 75 6 482 488 10.1136/adc.75.6.482 9014599 PMC1511808 56 Ranakusuma RW McCullough AR Safitri ED Oral prednisolone for acute otitis media in children: a pilot, pragmatic, randomised, open-label, controlled study (OPAL study) Pilot Feasibility Stud 2020 6 121 10.1186/s40814-020-00671-5 32874679 PMC7455987 57 Ruohola A Heikkinen T Jero J Oral prednisolone is an effective adjuvant therapy for acute otitis media with discharge through tympanostomy tubes J Pediatr 1999 134 4 459 463 10.1016/S0022-3476(99)70204-0 10190921 58 Schaad UB Lips U Gnehm HE Blumberg A Heinzer I Wedgwood J Swiss Meningitis Study Group Dexamethasone therapy for bacterial meningitis in children Lancet 1993 342 8869 457 461 10.1016/0140-6736(93)91592-A 8102428 59 Shaikh N Shope TR Hoberman A Corticosteroids to prevent kidney scarring in children with a febrile urinary tract infection: a randomized trial Pediatr Nephrol 2020 35 11 2113 2120 10.1007/s00467-020-04622-3 32556960 PMC7529851 60 Shan LS Liu X Kang XY Wang F Han XH Shang YX Effects of methylprednisolone or immunoglobulin when added to standard treatment with intravenous azithromycin for refractory Mycoplasma pneumoniae pneumonia in children World J Pediatr 2017 13 4 321 327 10.1007/s12519-017-0014-9 28130749 61 Sundel RP Baker AL Fulton DR Newburger JW Corticosteroids in the initial treatment of Kawasaki disease: report of a randomized trial J Pediatr 2003 142 6 611 616 10.1067/mpd.2003.191 12838187 62 Super DM Cartelli NA Brooks LJ Lembo RM Kumar ML A prospective randomized double-blind study to evaluate the effect of dexamethasone in acute laryngotracheitis J Pediatr 1989 115 2 323 329 10.1016/S0022-3476(89)80095-2 2754562 63 Tagarro A Otheo E Baquero-Artigao F CORTEEC Study Group Dexamethasone for parapneumonic pleural effusion: a randomized, double-blind, clinical trial J Pediatr 2017 185 117 123 10.1016/j.jpeds.2017.02.043 28363363 64 Tam DT Ngoc TV Tien NT Effects of short-course oral corticosteroid therapy in early dengue infection in Vietnamese patients: a randomized, placebo-controlled trial Clin Infect Dis 2012 55 9 1216 1224 10.1093/cid/cis655 22865871 PMC3466094 65 Tassniyom S Vasanawathana S Chirawatkul A Rojanasuphot S Failure of high-dose methylprednisolone in established dengue shock syndrome: a placebo-controlled, double-blind study Pediatrics 1993 92 1 111 115 8516054 66 Unüvar E Oğuz F Sidal M Kiliç A Corticosteroid treatment of childhood Bell’s palsy Pediatr Neurol 1999 21 5 814 816 10.1016/S0887-8994(99)00099-5 10593672 67 Usta M Erkan T Cokugras FC High doses of methylprednisolone in the management of caustic esophageal burns Pediatrics 2014 133 6 E1518 E1524 10.1542/peds.2013-3331 24864182 68 Wang J Zhang Y The effect of methylprednisolone combined with macrolide antibiotics on Mycoplasma pneumoniae pneumonia in children Farmacia 2022 70 5 850 854 10.31925/farmacia.2022.5.9 69 Chaudhuri D Israelian L Putowski Z Adverse effects related to corticosteroid use in sepsis, acute respiratory distress syndrome, and community-acquired pneumonia: a systematic review and meta-analysis Crit Care Explor 2024 6 4 e1071 10.1097/CCE.0000000000001071 38567382 PMC10986917 70 Kulkarni S Durham H Glover L Metabolic adverse events associated with systemic corticosteroid therapy-a systematic review and meta-analysis BMJ Open 2022 12 12 e061476 10.1136/bmjopen-2022-061476 36549729 PMC9772659 71 Yao TC Wang JY Chang SM Association of oral corticosteroid bursts with severe adverse events in children JAMA Pediatr 2021 175 7 723 729 10.1001/jamapediatrics.2021.0433 33871562 PMC8056312 72 Brouwer MC McIntyre P Prasad K van de Beek D Corticosteroids for acute bacterial meningitis Cochrane Database Syst Rev 2015 2015 9 CD004405 10.1002/14651858.CD004405.pub5 26362566 PMC6491272 73 National Institute for Health and Care Excellence. Meningitis (bacterial) and meningococcal disease: recognition, diagnosis and management. Published March 19, 2024 https://www.nice.org.uk/guidance/ng240 38843370 74 Le Saux N Canadian Paediatric Society, Infectious Diseases and Immunization Committee Guidelines for the management of suspected and confirmed bacterial meningitis in Canadian children older than one month of age Paediatr Child Health 2014 19 3 141 152 10.1093/pch/19.3.141 24665226 PMC3959975 75 Hartling L Ali S Dryden DM How safe are common analgesics for the treatment of acute pain for children? A systematic review Pain Res Manag 2016 2016 1 5346819 10.1155/2016/5346819 28077923 PMC5203901 Supplement 1. eMethods. eFigure 1. eFigure 2. eTable 1. eTable 2. eFigure 3. eFigure 4. eTable 3. eTable 4. Supplement 2. Data Sharing Statement ",
  "metadata": {
    "Title of this paper": "How safe are common analgesics for the treatment of acute pain for children? A systematic review",
    "Journal it was published in:": "JAMA Network Open",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485646/"
  }
}