{
  "title": "Paper_366",
  "abstract": "pmc Smart Mol Smart Mol 4751 smmol SMO2 Smart Molecules 2751-4587 2751-4595 Wiley PMC12483126 PMC12483126.1 12483126 12483126 41035520 10.1002/smo.20240067 SMO270008 1 Review Article Review Article Microneedle delivery systems for vaccines and immunotherapy Jia Haiyao  1  2 * Liu Jinyuan  1 * Shi Mengqian  1 * Abbas Manzar  3 * Xing Ruirui https://orcid.org/0000-0003-0603-2284  1  2 rrxing@ipe.ac.cn * Yan Xuehai https://orcid.org/0000-0002-0890-0340  1  2  4 yanxh@ipe.ac.cn *   1 State Key Laboratory of Biopharmaceutical Preparation and Delivery Institute of Process Engineering Chinese Academy of Sciences Beijing China   2 University of Chinese Academy of Sciences Beijing China   3 Department of Chemistry Khalifa University of Science and Technology Abu Dhabi United Arab Emirates   4 Center for Mesoscience Institute of Process Engineering Chinese Academy of Sciences Beijing China * Correspondence yanxh@ipe.ac.cn rrxing@ipe.ac.cn 25 4 2025 9 2025 3 3 498016 10.1002/smo2.v3.3 e20240067 23 3 2025 31 12 2024 12 4 2025 25 04 2025 01 10 2025 02 10 2025 © 2025 The Author(s). Smart Molecules https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ Abstract Microneedles (MNs) offer a precise and minimally invasive platform for delivering vaccines and therapeutic agents directly into the skin, leveraging the abundance of tissue‐resident immune cells to elicit robust and durable immune responses. Compared to traditional intramuscular or subcutaneous vaccination methods, MN‐based vaccines demonstrate superior patient compliance, enhanced antigen stability, and heightened immunogenicity, positioning them as a promising tool in biomedical applications. This review provides a comprehensive overview of the materials and fabrication techniques used in MN preparation, explores their structural classifications, and examines the role of antigens and adjuvants in optimizing vaccine efficacy. Furthermore, the diverse applications of MN delivery systems in preventing infectious diseases, advancing tumor immunotherapy, and addressing other immune‐related conditions are discussed. This paper reviews the preparation methods and materials of microneedles for drug delivery, summarizes the structures and types of microneedle systems, analyzes the influence of antigens and adjuvants on the efficacy of microneedle vaccines, and reviews the current application status of microneedles in the fields of vaccines and immunotherapy by listing microneedle vaccines used for the prevention or treatment of different diseases. delivery systems infectious disease prevention microneedles transdermal immunization tumor therapy vaccines pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date September 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:29.09.2025  H. Jia J. Liu M. Shi M. Abbas R. Xing X. Yan Smart Mol 2025 3 e20240067 10.1002/smo.20240067 Homepage: http://www.yan‐assembly.org 1 INTRODUCTION Vaccines are biological agents designed to elicit specific immune responses through the introduction of antigens, playing a pivotal role in disease prevention and treatment. However, current popular intramuscular vaccines have poor compliance, as pain and fear associated with injections may lead approximately 10% of the population to avoid vaccination.  [1]  [2]  [3] MNs are a new delivery system of transdermal drug, which is composed of a substrate and an array of needles of a few hundred microns, typically ranging from 100 to 1000 μm.  [4]  [4]  [5] + + 1  [6] FIGURE 1 (a) Professional antigen‐presenting cells on the skin surface. (b) Processes of antigen presentation and triggered immunity in dermal dendritic cells and Langerhans cells.  [6] Due to the unique advantages of MNs, their application in the field of vaccines and immunization has received extensive attention. There is considerable evidence that MN vaccines are more immunogenic (the ability of substances such as pathogens, vaccines, or proteins to trigger responses from the immune system) than intramuscular vaccines. Notably, they require significantly lower doses to achieve comparable protective effects, which in turn minimizes vaccine‐associated toxicity.  [7]  [8] This review provides a concise overview of the preparation methods and materials employed in MN systems for drug delivery. It summarizes the structural designs and classifications of MN platforms, analyzes the impact of antigens and adjuvants on the efficacy of MN‐based vaccines, and highlights the current advancements in MN applications within vaccination and immunotherapy. Furthermore, representative examples of MN vaccines developed for the prevention and treatment of various diseases are discussed to illustrate their therapeutic potential. Transcutaneous immunization using MN systems is expected to develop new therapeutic strategies for the prevention of infectious diseases or the treatment of tumors, with great potential for clinical translation. 2 PREPARATION OF MICRONEEDLES MNs have emerged as versatile tools in drug delivery, medical aesthetics, and various biomedical applications. The design and fabrication of MNs are highly application‐specific, with material selection playing a critical role in ensuring functionality and biocompatibility. The primary materials used in MN fabrication include metals, inorganic non‐metals, and polymers, each chosen based on the intended application and performance requirements. Additionally, two predominant fabrication techniques—mold filling and additive manufacturing (3D printing)—are widely employed in current research. This review will provide a concise overview of these materials and fabrication methods, highlighting their relevance to specific biomedical applications. 2.1 Preparation materials 2.1.1 Metals MNs need to effectively penetrate the epidermis to deliver therapeutic agents into the skin (penetrate the 10–15 μm thick drug diffusion barrier, the stratum corneum, into the dermis and deliver the drug to the dermal microcirculation)  [9] Stainless steel and titanium alloys, commonly used as implant materials in the medical field, have excellent physical properties. SUS316L stainless steel, which is widely used in medical implantable devices, has a Young's modulus (a physical measure of a material's ability to resist deformation; the larger the value, the harder the material is to be stretched or compressed) of around 180 GPa,  [9]  [10]  [11]  [12] In recent years, in addition to these metallic materials, which are already commonly used in the medical field, a number of new metallic materials with unique properties are being attempted for the preparation of MNs. Liquid metals have unique fluidity, excellent electrical conductivity and good biocompatibility, and MNs prepared with them have strong fixation capabilities and can also be used to stimulate wound healing by using the electrical signals generated by the conductivity of liquid metals.  [13]  [14] 2.1.2 Inorganic non‐metals Compared to metallic materials, inorganic non‐metallic materials offer greater ease of processing and shaping. Although their mechanical properties are generally inferior to those of metals, they still possess sufficient structural characteristics to enable effective skin penetration, making them promising candidates for biomedical applications. Therefore, inorganic non‐metallic materials are also often used in the preparation of MNs in order to simplify the process of MNs preparation for industrial mass production of MNs. Silicon is a biocompatible and biologically inert material commonly used in MNs preparation. With the continuous development of the semiconductor field, the processing method of silicon has become simpler and more convenient, which also provides convenience for the application of silicon in the field of MNs. Solid and hollow silicon MNs can be prepared using a single step wet etch process and the MNs are capable of efficiently delivering drugs into the skin.  [15]  [16] Ceramics and quartz glass can also be used to prepare MNs for drug delivery. Both ceramics and glass can be quickly produced in the desired shape, but both are brittle materials that may break during skin piercing. Some studies have shown that ceramic MNs prepared by micro‐nanofabrication techniques are partially broken during manual application.  [17]  [18] 2.1.3 Polymers Polymers represent a highly promising class of materials for the fabrication of MNs and have become a central focus of research in the field of MN materials science. Polymers have excellent biocompatibility and are biodegradable compared to the above two materials. Although their strength may be relatively low, their exceptional toughness, low cost, ease of operation, and other advantageous properties provide them with significant competitive potential in the field. Moreover, some of the polymers used for MNs preparation will themselves have certain biofunctional properties. Naturally degradable macromolecules of biological origin are an excellent material for MNs. Hyaluronic acid is a natural component of the skin and is non‐immunogenic. After entering the skin in the form of MNs, it can be dissolved in the interstitial fluid to release its loaded drugs or used in medical cosmetology.  [19]  [20] Compared with natural polymers, the MNs prepared from synthetic polymers have higher strength and greater plasticity. It has been shown that the compressive strength of PVP MNs can reach 284 KPa with sufficient flexibility and strength.  [21]  [22] 2.2 Preparation methods 2.2.1 Mold filling Mold filling is a commonly used method of MNs preparation which is popular for MNs preparation as this method is easy to operate, reusable and can be applied to mass production. Mold filling needs to centrifuge or adjust the pressure to make the prepared material into the mold, and then remove the excess material through drying, irradiation, and other ways to shape the MNs.  [23]  [24] With the deepening of research in the field of MNs, the method of mold filling is also constantly improved. To enhance the filling effect, the surface of the mold can be modified (Figure 2  [25]  [26]  [23] FIGURE 2 (a) Schematic illustration of the fabrication process of MNs. (b) Photograph of the MNs array (Scale bar, 1 cm). (c) Optical image of the magnified needles (Scale bar, 300 μm). (d) SEM image of MNs (Scale bar, 300 μm).  [25] 2.2.2 3D printing 3D printing is an emerging manufacturing technology that has been widely used in a variety of fields including the aerospace industry, production agriculture, and biomedicine.  [27] However, due to the small size of the MNs, this places high demands on the machines and inks used for 3D printing. Due to the low resolution of most current 3D printing machines, it is difficult to form a sharp tip when printing normally. To solve this problem, choo et al. adjusted the angle of printing and found that an optimal MN with a tip diameter of 30.2 ± 3.4 μm was obtained when the printing angle was 60°.  [28]  [29] 3  [30] FIGURE 3 Flow chart of direct and indirect manufacturing of MNs using 3D printing.  [30] 3 MICRONEEDLES STRUCTURES AND TYPES The function of MNs is related to their structure and type, and MNs usually have different structures for different purposes (Figure 4 1 FIGURE 4 (a–e) Schematic diagrams of the five types of MN modes of action. (f, g) Solid MNs under scanning electron microscope (f) and optical microscope (g).  [31]  [32]  [33]  [34]  [35] TABLE 1 Advantages, disadvantages and applications of five types of MNs. MNs type Advantages Disadvantages Applications Solid MNs  High mechanical strength with strong skin penetration Separation of preparation and delivery minimizes impact on drug activity  Complex usage steps Slower drug release Commonly used in the field of cosmetology Hollow MNs  High drug‐loading capacity. Controlled drug delivery rate and dosage Can sample interstitial fluid via capillary action  Low mechanical strength Needle holes are easily blocked Commonly used for delivery of large molecule drugs (e.g., insulin, vaccines) Hydrogel MNs  Good biocompatibility. Suitable for slow drug release  Low mechanical strength Complex preparation process Commonly used for long‐term drug release, (e.g., hormones, antibiotics, etc.) Coated MNs  Simple preparation and low cost. Fast drug release  Limited drug‐loading capacity The preparation process may affect drug effectiveness Suitable for topical treatments and rapid drug release Dissolving MNs  MN dissolution after use, eliminating the need for removal and reducing infection risk Controlled and complete drug release  Low mechanical strength with limited penetration depth High preparation cost Commonly used for vaccination and treatment of skin diseases Solid MNs do not load with drugs or vaccines. They are pressed to puncture the MNs into the skin and form conduits to increase the skin permeability of drugs or vaccines (Figure 4a,f,g  [31]  [36]  [37]  [38]  [39] Hollow MNs have large‐capacity cavities that can be loaded with drugs or vaccines, so they can be used for the delivery of large doses of drugs or vaccines.  [40] 4b,h,i  [32]  [41]  [42]  [43] Hydrogel MNs are synthesized from a hydrogel polymeric matrix. The MNs are water‐absorbent and soluble, and when inserted into the skin, they dissolve by absorbing interstitial fluids which creates pores to release the drugs (Figure 4c,j,k  [33]  [44]  [45]  [46]  [47] Coated MNs, in which drugs or vaccines are coated and immobilized on the surface of MNs, can be used to deliver a wide range of biologics with a simple fabrication process and fast delivery speed. Coated MNs immobilize the liquid formulation on the surface of the MNs into the solid formulation, which can increase the stability of the loaded vaccines.  [48]  [49] 4d,l,m  [34] Dissolving MNs are prepared from biodegradable materials that dissolve and release loaded biologically active substances, such as vaccines, after entering the skin. Compared to other types of MNs, dissolving MNs allow for long‐lasting drug delivery by controlling the dissolution time (Figure 4e,n,o  [35]  [50]  [51] 4 VACCINES DELIVERED BY MICRONEEDLES SYSTEM Percutaneous immunization via MN systems has garnered significant attention in vaccine delivery research due to its unique advantages including minimal invasiveness, reduced pain, and robust immunogenic responses. Extensive studies have demonstrated that MN‐based vaccine delivery not only improves immunization efficacy but also enhances vaccine stability, positioning this approach as a highly promising platform for next‐generation vaccine applications.  [52] 4.1 Influences of antigens on vaccines efficacy Antigens are an important component of MN vaccines, which can induce a specific immune response in the body and form an immune memory to prevent disease. There are many types of antigens used in vaccines, such as glycoproteins, peptides, whole cells, and so on. Their quantity, purity, and stability will affect the effectiveness of vaccines.  [53] The antigens should have high immunogenicity. Studies have shown that when their antigenicity spectrum is similar to that of natural viruses, it can effectively induce a specific immune response and improve the immunogenicity.  [54]  [24]  [55]  [56] 4.2 Modulating effects of adjuvants Adjuvants can modulate the immune response in the body, and the addition of appropriate adjuvants to MN vaccines can increase the immunogenicity of antigens, improve vaccine efficacy  [57]  [58]  [59]  [60] With the development of immunology, more and more studies have been conducted on adjuvants for MN vaccines. Studies have shown that many water‐soluble or prepared as aqueous formulation adjuvants are safer because they can be cleared quickly from the site of delivery.  [61]  [62]  [63]  [64]  [65]  [66] 5 THE APPLICATIONS OF MICRONEEDLES IN VACCINES AND IMMUNIZATION MNs were first conceptualized in 1976 as a promising strategy for transdermal drug delivery. However, their widespread application remained limited until the 1990s, primarily due to the absence of advanced microfabrication technologies necessary for their precise and scalable production.  [35] 5.1 Prophylactic vaccines 5.1.1 Influenza Influenza is a highly transmissible respiratory disease caused by viruses that can be seasonally prevalent in all age groups.  [67]  [68]  [69]  [70] MNs can mimic the natural infection of influenza by optimizing the preparation materials to allow sustained release of the vaccines for 1–2 weeks. These MN vaccines have been shown to increase the breadth and titer of antibodies, providing greater protection against a deadly flu challenge.  [71]  [7] p p NCT02438423  [72]  [73] 5.1.2 COVID‐19 Coronavirus disease 2019 (COVID‐19) is caused by Severe Acute Respiratory Syndrome Coronavirus 2 (SARS‐CoV‐2), which is highly infectious, pathogenic, and mutable.  [74]  [75]  [76]  [77] Unlike regular syringes, MNs can deliver vaccines while giving the skin other stimuli to boost immunity. The use of MN electroporation systems to deliver SARS‐CoV‐2 vaccines has been shown to induce high levels of antibodies, resulting in at least a tenfold reduction in dose compared with conventional intramuscular vaccines.  [78] 5  [79]  [80] FIGURE 5 (a) Schematic illustration of separable MN patch mediated intracutaneous delivery of DNA nano‐vaccines for fighting SARS‐CoV‐2 virus. (b) DA‐LPEI amphiphilic polymer was designed to encapsulate the hydrophobic R848 in the core of nanoparticles (DLP‐R) and plasmid DNA for expressing S‐ or N‐protein (pCOV‐S or pCOV‐N) was absorbed on the nanoparticles through electrostatic interaction (DLP‐RS or DLP‐RN).  [79] 5.1.3 Acquired Immunodeficiency Syndrome Acquired Immunodeficiency Syndrome (AIDS) is caused by the Human Immunodeficiency Virus (HIV) of the genus Lentivirus and is usually transmitted through blood, mother‐to‐child and sex.  [81]  [82]  [83] Due to the short length of the MNs, they can be inoculated in the nasal cavity or mucous membranes, and this type of inoculation can induce large amounts of HIV vaccine antigen‐specific IgA, which can be very effective in preventing HIV transmission through the mucous membranes.  [84]  [85]  [86] 5.2 Therapeutic vaccines (tumor therapy) In recent years, active immunotherapy for tumors was being developed and investigated.  [87]  [88]  [89]  [90] MN‐mediated transdermal delivery can target vaccines to DCs, which can improve tumor treatment efficacy and prolong survival time compared with non‐DC targeting methods (Figure 6  91  92  [93]  [94]  [95]  [96]  [97]  [98] FIGURE 6 TCV‐DMNs for antitumor immunotherapy. Cancer‐Immunity Cycle: I. Tumor antigen release; II. Tumor antigen is presented by DCs; III. Activate effector T cells; IV. T cell infiltration in tumor tissues; V. T cells kill tumor cells and release tumor antigen.  [91] 5.3 Other immunological treatments Due to the small size and high stability of MNs, they can be used for other immunological treatments in addition to vaccine delivery. Firstly, as MNs are a topical treatment on the skin, they can be used to treat allergies through Allergen‐Specific Immunotherapy (AIT) and prevent causing hypersensitivity reactions. MN‐assisted epidermal immunotherapy (EPIT) treats allergies by depositing allergens into the skin, stimulating immune cells, and achieving sustained allergen exposure to the skin, resulting in allergen tolerance.  [99] NCT05922176  [100]  [101] 6 CONCLUSION AND FUTURE PROSPECT MNs represent a versatile transdermal delivery platform capable of being fabricated from diverse materials through various manufacturing techniques. The structural and compositional variability among MNs enables distinct delivery mechanisms, offering flexibility for tailored applications. Given the abundance of tissue‐resident immune cells, such as LCs, in the skin, MNs have garnered significant attention in vaccine delivery and immunotherapy. Their use not only enhances vaccine stability and immunogenicity but also reduces required dosages and broadens immunization coverage across diverse populations. These attributes position MNs as a promising tool for the delivery of prophylactic vaccines, tumor immunotherapies, and treatments for a range of immune‐mediated diseases, underscoring their substantial advantages in modern biomedicine. However, they still need to be improved and optimized in a number of areas before they can be applied on a large scale and fully commercialized. Firstly, because of the immune properties of skin tissue, MN vaccines may cause unwanted immune response results such as over‐immunization. Therefore, how to regulate skin immunity while improving vaccine efficacy through adjuvants is a problem that needs to be considered. Secondly, although MN patches can enhance the stability of vaccines, the processing may lead to the loss of vaccines efficacy, so perfecting the preparation process is essential in the future development of MN vaccines. Thirdly, exploring the appropriate dose of percutaneous immunization in different populations is also a necessary study. Finally, with the development of MNs as an emerging delivery method, the state regulatory system for this medical device needs to be refined. As research efforts to address these challenges advance, MN vaccines are poised to emerge as a pivotal platform for vaccination in the future. CONFLICT OF INTEREST STATEMENT The authors declare no conflicts of interest. ACKNOWLEDGEMENTS This work was financially supported by the National Science Fund for National Natural Science Foundation of China (Grant Nos. 22232006, 22377127, and 52361145848), Chinese Academy of Sciences (CAS) Project for Young Scientists in Basic Research (Grant No. YSBR‐083), the Beijing Nova Program (Grant Nos. 20230484352 and 20240484650), Institute of Process Engineering Project for Frontier Basic Research (Grant No.QYJC‐2023‐05), and Progress of Strategy Priority Research Program (Category B) of CAS (Grant No. XDB0520300).  Haiyao Jia  Jinyuan Liu  Mengqian Shi  Manzar Abbas  Ruirui Xing  Xuehai Yan REFERENCES 1 M. K. Hossain T. Ahmed P. Bhusal R. K. Subedi I. Salahshoori M. Soltani M. Hassanzadeganroudsari Expert Rev. Vaccines 2021 19 1153 10.1080/14760584.2020.1874928 33427523 2 E. V. Vassilieva H. Kalluri D. Mcallister M. T. Taherbhai E. S. Esser W. P. Pewin J. A. Pulit‐Penaloza M. R. Prausnitz R. W. Compans I. Skountzou Drug Deliv. Transl Re 2015 5 360 10.1007/s13346-015-0228-0 PMC4530046 25895053 3 M. Zaric B. Ibarzo Yus P. P. Kalcheva L. S. Klavinskis Expert Opin. Drug Del. 2016 14 1177 10.1080/17425247.2017.1230096 27591122 4 M. R. Prausnitz Annu. Rev. Chem. Biomol. Eng. 2017 8 177 28375775 10.1146/annurev-chembioeng-060816-101514 5 C. Bangert P. M. Brunner G. Stingl Clin. Dermatol. 2011 29 360 21679864 10.1016/j.clindermatol.2011.01.006 6 L. Engelke G. Winter S. Hook J. Engert Vaccine 2015 33 4663 26006087 10.1016/j.vaccine.2015.05.012 7 F. S. Quan Y. C. Kim R. W. Compans M. R. Prausnitz S. M. Kang J. Control. Release 2010 147 326 20692307 10.1016/j.jconrel.2010.07.125 PMC2975779 8 A. Vander Straeten M. Sarmadi J. L. Daristotle M. Kanelli L. H. Tostanoski J. Collins A. Pardeshi J. Han D. Varshney B. Eshaghi J. Garcia T. A. Forster G. Li N. Menon S. L. Pyon L. Zhang C. Jacob‐Dolan O. C. Powers K. Hall S. K. Alsaiari M. Wolf M. W. Tibbitt R. Farra D. H. Barouch R. Langer A. Jaklenec Nat. Biotechnol. 2023 42 510 37095347 10.1038/s41587-023-01774-z PMC10593912 9 E. Larrañeta R. E. M. Lutton A. D. Woolfson R. F. Donnelly Mater 2016 104 1 10 F. Trevisan F. Calignano A. Aversa G. Marchese M. Lombardi S. Biamino D. Ugues D. Manfredi J. Appl. Biomater. Func 2017 16 57 10.5301/jabfm.5000371 28967051 11 F. J. Verbaan S. M. Bal D. J. Van Den Berg J. A. Dijksman M. Van Hecke H. Verpoorten A. Van Den Berg R. Luttge J. A. Bouwstra J. Control. Release 2008 128 80 18394741 10.1016/j.jconrel.2008.02.009 12 M. Cormier B. Johnson M. Ameri K. Nyam L. Libiran D. D. Zhang P. Daddona J. Control. Release 2004 97 503 15212882 10.1016/j.jconrel.2004.04.003 13 X. Zhang G. Chen L. Sun F. Ye X. Shen Y. Zhao Chem. Eng. J 2021 406 126741 14 L. E. González García M. N. Macgregor R. M. Visalakshan N. Ninan A. A. Cavallaro A. D. Trinidad Y. Zhao A. J. D. Hayball K. Vasilev Chem. Commun. 2019 55 171 10.1039/c8cc06035e 30418438 15 O. Howells G. J. Blayney B. Gualeni J. C. Birchall P. F. Eng H. Ashraf S. Sharma O. J. Guy Eur. J. Pharm. Biopharm. 2022 171 19 34144128 10.1016/j.ejpb.2021.06.005 16 P. Khanna K. Luongo J. A. Strom S. Bhansali Micro Syst. 2010 16 973 17 S. Bystrova R. Luttge Microelectron. Eng. 2011 88 1681 18 P. M. Wang M. Cornwell J. Hill M. R. Prausnitz J. Invest. Dermatol. 2006 126 1080 16484988 10.1038/sj.jid.5700150 19 I. Saha V. K. Rai Carbohydr. Polym. 2021 267 118168 34119141 10.1016/j.carbpol.2021.118168 20 T. Tomono Mater. Today Chem. 2019 13 79 21 S. J. Yang J. O. Jeong Y. M. Lim J. S. Park Mater. Des. 2021 201 109485 22 E. Dathathri S. Lal M. Mittal G. Thakur S. De Appl. Nanosci. 2020 10 371 23 R. Xing C. Yuan W. Fan X. Ren X. Yan Sci. Adv. 2023 9 eadd8105 36930715 10.1126/sciadv.add8105 PMC10022897 24 Y. Shin J. Kim J. H. Seok H. Park H. R. Cha S. H. Ko J. M. Lee M. S. Park J. H. Park Sci. Rep. 2022 12 12189 35842468 10.1038/s41598-022-16365-2 PMC9287697 25 J. Deng Z. Wang Z. Zhou W. Yu X. Li Z. Song H. Han L. Zhao Chem. Eng. J 2023 474 145496 26 Z. Chen Z. Guo T. Hu B. Huang Q. Zheng X. Du L. Huang W. Hu Int. J. Biol. Macromol. 2024 262 129961 38311138 10.1016/j.ijbiomac.2024.129961 27 C. Yuan W. Fan P. Zhou R. Xing S. Cao X. Yan Nat. Nanotechnol. 2024 19 1840 39187585 10.1038/s41565-024-01766-3 28 S. Choo S. Jin J. Jung Pharmaceutics 2022 14 766 35456599 10.3390/pharmaceutics14040766 PMC9027855 29 M. A. Luzuriaga D. R. Berry J. C. Reagan R. A. Smaldone J. J. Gassensmith Lab Chip 2018 18 1223 29536070 10.1039/c8lc00098k 30 X. Han Y. Yang Y. Xu X. Hong Z. Tang H. Zhang N. Liu M. Li Z. Wang A. Zheng J. Drug Deliv. Sci. Technol. 2024 96 105709 31 J. H. Park S. O. Choi S. Seo Y. B. Choy M. R. Prausnitz Eur. J. Pharm. Biopharm. 2010 76 282 20624460 10.1016/j.ejpb.2010.07.001 32 V. Ghate A. Renjith K. Badnikar S. Pahal S. N. Jayadevi M. M. Nayak P. K. Vemula D. N. Subramanyam Int. J. Pharm. 2023 632 122546 36574913 10.1016/j.ijpharm.2022.122546 33 M. Xing G. Yang H. Liu Z. Zhou S. Zhang Y. Gao Int. J. Pharm. 2024 653 123883 38341048 10.1016/j.ijpharm.2024.123883 34 S. Kommareddy B. C. Baudner A. Bonificio S. Gallorini G. Palladino A. S. Determan D. M. Dohmeier K. D. Kroells J. R. Sternjohn M. Singh P. R. Dormitzer K. J. Hansen D. T. O’hagan Vaccine 2013 31 3435 23398932 10.1016/j.vaccine.2013.01.050 35 A. J. Paredes I. K. Ramöller P. E. Mckenna M. T. A. Abbate F. Volpe‐Zanutto L. K. Vora M. Kilbourne‐Brook C. Jarrahian K. Moffatt C. Zhang I. A. Tekko R. F. Donnelly Adv. Drug Del. Rev. 2021 173 331 10.1016/j.addr.2021.04.002 33831475 36 W. Z. Li M. R. Huo J. P. Zhou Y. Q. Zhou B. H. Hao T. Liu Y. Zhang Int. J. Pharm. 2010 389 122 20096759 10.1016/j.ijpharm.2010.01.024 37 B. B. Newell W. Zhan Int. J. Heat Mass Transfer 2024 223 125291 38 G. Li A. Badkar S. Nema C. S. Kolli A. K. Banga Int. J. Pharm. 2009 368 109 18996461 10.1016/j.ijpharm.2008.10.008 39 A. S. Rzhevskiy T. R. R. Singh R. F. Donnelly Y. G. Anissimov J. Control. Release 2018 270 184 29203415 10.1016/j.jconrel.2017.11.048 40 M. J. Garland K. Migalska T. M. T. Mahmood T. R. R. Singh A. D. Woolfson R. F. Donnelly Expert Rev. Med. Devices 2011 8 459 21728732 10.1586/erd.11.20 41 G. Anbazhagan S. B. Suseela R. Sankararajan Microfluid Nanofluid Microfluid. Nanofluidics 2023 27 25 42 C. O'mahony R. Sebastian F. Tjulkins D. Whelan A. Bocchino Y. Hu J. O'brien J. Scully M. Hegarty A. Blake I. Slimi A. J. P. Clover A. Lyness A. M. Kelleher Int. J. Pharm. 2023 637 122888 36977451 10.1016/j.ijpharm.2023.122888 43 W. Zhang W. Zhang C. Li J. Zhang L. Qin Y. Lai Int. J. Mol. Sci. 2022 23 2401 35269545 10.3390/ijms23052401 PMC8909978 44 H. Wei S. Liu Z. Tong T. Chen M. Yang Y. Guo H. Sun Y. Wu Y. Chu L. Fan React. Funct. Polym. 2022 172 105200 45 P. Zhou R. Xing Q. Li J. Li C. Yuan X. Yan Matter 2023 6 1945 46 Y. Liu T. Huang Z. Qian W. Chen Chin. Chem. Lett. 2023 34 108103 47 A. Mandal A. V. Boopathy L. K. W. Lam K. D. Moynihan M. E. Welch N. R. Bennett M. E. Turvey N. Thai J. H. Van J. C. Love P. T. Hammond D. J. Irvine Sci. Transl. Med. 2018 10 eaar2227 30429353 10.1126/scitranslmed.aar2227 PMC11972007 48 M. C. Kim J. W. Lee H. J. Choi Y. N. Lee H. S. Hwang J. Lee C. Kim J. S. Lee C. Montemagno M. R. Prausnitz S. M. Kang J. Control. Release 2015 210 208 26003039 10.1016/j.jconrel.2015.05.278 PMC4489561 49 I. J. Choi H. R. Cha S. J. Hwang S. K. Baek J. M. Lee S. O. Choi Pharmaceutics 2021 13 209 50 J. W. Lee J. H. Park M. R. Prausnitz Biomaterials 2008 29 2113 18261792 10.1016/j.biomaterials.2007.12.048 PMC2293299 51 A. M. Rodgers A. J. Courtenay R. F. Donnelly Expert Opin. Drug Deliv. 2018 15 1039 30204003 10.1080/17425247.2018.1522301 52 J. Yang X. Liu Y. Fu Y. Song Acta Pharm. Sin. B 2019 9 469 31193810 10.1016/j.apsb.2019.03.007 PMC6543086 53 R. Chang C. Yuan P. Zhou R. Xing X. Yan Acc. Chem. Res. 2024 57 289 38232052 10.1021/acs.accounts.3c00592 54 A. V. Boopathy A. Mandal D. W. Kulp S. Menis N. R. Bennett H. C. Watkins W. Wang J. T. Martin N. T. Thai Y. He W. R. Schief P. T. Hammond D. J. Irvine Proc. Natl. Acad. Sci. USA 2019 116 16473 31358641 10.1073/pnas.1902179116 PMC6697788 55 T. J. Ellison G. C. Talbott D. R. Henderson Vaccine 2020 38 6839 32741668 10.1016/j.vaccine.2020.07.040 56 C. L. Chiang G. Coukos L. E. Kandalaft Vaccines 2015 3 344 26343191 10.3390/vaccines3020344 PMC4494356 57 S. Vijayanand S. Patil D. Joshi I. Menon K. Braz Gomes A. Kale P. Bagwe S. Yacoub M. N. Uddin M. J. D’souza Vaccines 2022 10 1491 36146568 10.3390/vaccines10091491 PMC9503342 58 E. V. Vassilieva S. Li H. Korniychuk D. M. Taylor S. Wang M. R. Prausnitz R. W. Compans Front. Immunol. 2020 11 583251 33603732 10.3389/fimmu.2020.583251 PMC7884748 59 M. Vogelbruch B. Nuss M. Körner A. Kapp P. Kiehl W. Bohm Allergy 2000 55 883 11003454 60 A. K. Andrianov D. P. Decollibus H. A. Gillis H. H. Kha A. Marin M. R. Prausnitz L. A. Babiuk H. Townsend G. Mutwiri Proc. Natl. Acad. Sci. USA 2009 106 18936 19864632 10.1073/pnas.0908842106 PMC2770009 61 X. Chen Int. J. Pharm. 2023 632 122559 36586639 10.1016/j.ijpharm.2022.122559 PMC9794530 62 H. Shirota D. M. Klinman Expert Rev. Vaccines 2014 13 299 24308579 10.1586/14760584.2014.863715 PMC6335645 63 M. Dupuis D. M. Mcdonald G. Ott Vaccine 1999 18 434 10519932 10.1016/s0264-410x(99)00263-7 64 S. Ito S. Hirobe T. Kawakita M. Saito Y.‐S. Quan F. Kamiyama K. J. Ishii M. Nagao T. Fujisawa M. Tachibana N. Okada Pharmaceutics 2020 12 267 32183437 10.3390/pharmaceutics12030267 PMC7151019 65 W. C. Weldon V. G. Zarnitsyn E. S. Esser M. T. Taherbhai D. G. Koutsonanos E. V. Vassilieva I. Skountzou M. R. Prausnitz R. W. Compans PLoS One 2012 7 e41501 22848514 10.1371/journal.pone.0041501 PMC3405087 66 S. G. Reed M. T. Orr C. B. Fox Nat. Med. 2013 19 1597 24309663 10.1038/nm.3409 67 W. C. Wang E. E. Sayedahmed S. Sambhara S. K. Mittal Viruses 2022 14 1684 36016306 10.3390/v14081684 PMC9415875 68 P. C. Soema R. Kompier J. P. Amorij G. F. A. Kersten Eur. J. Pharm. Biopharm. 2015 94 251 26047796 10.1016/j.ejpb.2015.05.023 69 A. Choi A. García‐Sastre M. Schotsaert Ann. Allergy Asthma Immunol. 2020 125 28 32325117 10.1016/j.anai.2020.04.008 PMC7327511 70 M. R. Sandbulte K. B. Westgeest J. Gao X. Xu A. I. Klimov C. A. Russell D. F. Burke D. J. Smith R. a. M. Fouchier M. C. Eichelberger Proc. Natl. Acad. Sci. USA 2011 108 20748 22143798 10.1073/pnas.1113801108 PMC3251064 71 J. A. Stinson A. V. Boopathy B. M. Cieslewicz Y. Zhang N. W. Hartman D. P. Miller M. Dirckx B. L. Hurst E. B. Tarbet J. A. Kluge K. M. Kosuda Vaccine 2021 39 5410 34391593 10.1016/j.vaccine.2021.07.064 PMC8405573 72 W. Zhu W. Pewin C. Wang Y. Luo G. X. Gonzalez T. Mohan M. R. Prausnitz B.‐Z. Wang J. Control. Release 2017 261 1 28642154 10.1016/j.jconrel.2017.06.017 PMC5567859 73 D. G. Koutsonanos M. Del Pilar Martin V. G. Zarnitsyn J. Jacob M. R. Prausnitz R. W. Compans I. Skountzou J. Infect. Dis. 2011 204 582 21685355 10.1093/infdis/jir094 PMC3144165 74 C. Li Y. Guo Z. Fang H. Zhang Y. Zhang K. Chen Front. Immunol. 2022 13 804945 35572594 10.3389/fimmu.2022.804945 PMC9095899 75 R. S. Patel B. Agrawal Front. Immunol. 2022 13 952229 36045689 10.3389/fimmu.2022.952229 PMC9420909 76 X. Hao F. Yuan X. Yao Front. Cell. Infect. Microbiol. 2024 14 1406091 38988812 10.3389/fcimb.2024.1406091 PMC11233461 77 M. S. Lee C. X. Pan V. E. Nambudiri Ther. Adv. Vaccin. Immunother 2021 9 25151355211039073 10.1177/25151355211039073 PMC8384302 34447901 78 D. Xia R. Jin G. Byagathvalli H. Yu L. Ye C. Y. Lu M. S. Bhamla C. Yang M. R. Prausnitz Proc. Natl. Acad. Sci. USA 2021 118 e2110817118 34670842 10.1073/pnas.2110817118 PMC8609327 79 Y. Yin W. Su J. Zhang W. Huang X. Li H. Ma M. Tan H. Song G. Cao S. Yu D. Yu J. H. Jeong X. Zhao H. Li G. Nie H. Wang ACS Nano 2021 15 14347 34472328 10.1021/acsnano.1c03252 80 C. L. D. Mcmillan A. Azuar J. J. Y. Choo N. Modhiran A. A. Amarilla A. Isaacs K. E. Honeyman S. T. M. Cheung B. Liang M. J. Wurm P. Pino J. Kint G. J. P. Fernando M. J. Landsberg A. A. Khromykh J. Hobson‐Peters D. Watterson P. R. Young D. A. Muller Vaccines 2022 10 578 35455326 10.3390/vaccines10040578 PMC9030474 81 J. L. Excler Expert Rev. Vaccines 2006 5 167 16608417 10.1586/14760584.5.2.167 82 A. C. S. De Oliveira C. M. Abreu Front. Cell. Infect. Microbiol. 2024 14 1434507 38947128 10.3389/fcimb.2024.1434507 PMC11214302 83 Y. Liu C. Chen Adv. Drug Del. Rev. 2016 103 76 10.1016/j.addr.2016.02.010 26952542 84 A. Pattani P. F. Mckay M. J. Garland R. M. Curran K. Migalska C. M. Cassidy R. K. Malcolm R. J. Shattock H. O. Mccarthy R. F. Donnelly J. Control. Release 2012 162 529 22960496 10.1016/j.jconrel.2012.07.039 PMC3778941 85 Y. Ma W. Tao S. J. Krebs W. F. Sutton N. L. Haigwood H. S. Gill Pharm. Res. 2014 31 2393 24623480 10.1007/s11095-014-1335-1 PMC4163144 86 S. M. Caucheteux J. P. Mitchell M. O. Ivory S. Hirosue S. Hakobyan G. Dolton K. Ladell K. Miners D. A. Price J. Kan‐Mitchell A. K. Sewell F. Nestle A. Moris R. O. Karoo J. C. Birchall M. A. Swartz J. A. Hubbel F. P. Blanchet V. Piguet J. Invest. Dermatol. 2016 136 1172 26896775 10.1016/j.jid.2016.01.033 87 Z. Hu P. A. Ott C. J. Wu Nat. Rev. Immunol. 2018 18 168 29226910 10.1038/nri.2017.131 PMC6508552 88 R. Yu F. Zhao Z. Xu G. Zhang B. Du Q. Shu Heliyon 2024 10 e24404 38293405 10.1016/j.heliyon.2024.e24404 PMC10826732 89 K. K. Wong W. A. Li D. J. Mooney G. Dranoff Adv. Immunol. 2016 130 191 26923002 10.1016/bs.ai.2015.12.001 90 Y. Chen J. Zhu J. Ding W. Zhou Chin. Chem. Lett. 2024 35 108706 91 D. Yang M. Chen Y. Sun C. Shi W. Wang W. Zhao T. Wen T. Liu J. Fu C. Lu C. Wu G. Quan X. Pan J. Control. Release 2023 357 641 37084892 10.1016/j.jconrel.2023.04.031 92 Y. Hu B. Xu J. Xu D. Shou E. Liu J. Gao W. Liang Y. Huang Polym. Chem. 2015 6 373 93 Y. Zheng Z. Li S. Li P. Zhao X. Wang S. Lu Y. Shi H. Chang Acta Biomater. 2024 185 203 39053817 10.1016/j.actbio.2024.07.031 94 H. Chang X. Wen Z. Li Z. Ling Y. Zheng C. Xu Bioeng. Transl Med. 2023 8 e10457 37693072 10.1002/btm2.10457 PMC10487323 95 Y. Zhang Z. Fang Z. Liu K. Xi Y. Zhang D. Zhao F. Feng H. Geng M. Liu J. Lou C. Chen Y. Zhang Z. Wu F. Xu X. Jiang S. Ni Adv. Mater. 2024 36 e2409857 39205511 10.1002/adma.202409857 96 K. J. Koh Y. Liu S. H. Lim X. J. Loh L. Kang C. Y. Lim K. K. L. Phua Sci. Rep. 2018 8 11842 30087399 10.1038/s41598-018-30290-3 PMC6081392 97 H. T. T. Duong Y. Yin T. Thambi T. L. Nguyen V. H. Giang Phan M. S. Lee J. E. Lee J. Kim J. H. Jeong D. S. Lee Biomaterials 2018 185 13 30216806 10.1016/j.biomaterials.2018.09.008 98 J. Zhu R. Chang B. Wei Y. Fu X. Chen H. Liu W. Zhou Research 2022 2022 9816272 36157510 10.34133/2022/9816272 PMC9484834 99 J. L. Paris L. K. Vora M. J. Torres C. Mayorga R. F. Donnelly Drug Discov. Today 2023 28 103556 36931387 10.1016/j.drudis.2023.103556 100 M. Xu Y. Liu H. Chen W. Hu Y. Li Y. Zhang Q. Wang T. Ma Colloids Surf. A Physicochem. Eng. Asp. 2024 693 133987 101 P. Xu W. Xiao K. Xu Y. He X. Miao Y. Dong L. Sun Eur. J. Pharm. Biopharm. 2024 195 114148 37995878 10.1016/j.ejpb.2023.11.013 ",
  "metadata": {
    "Title of this paper": "Microneedle delivery systems for vaccines and immunotherapy",
    "Journal it was published in:": "Smart Molecules",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483126/"
  }
}