{
  "title": "Paper_838",
  "abstract": "pmc Molecules Molecules 3416 molecules molecules Molecules 1420-3049 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472595 PMC12472595.1 12472595 12472595 41011638 10.3390/molecules30183747 molecules-30-03747 1 Article Immobilization of the Proteolytic Fraction P1G10 from Vasconcellea pubescens Cisternas-Jamet Jonathan Conceptualization Methodology Validation Formal analysis Investigation Data curation Writing – original draft Writing – review & editing 1 2 3 4 https://orcid.org/0000-0001-5002-8309 Plaza Verónica Methodology Validation Formal analysis 1 https://orcid.org/0000-0002-9490-0709 Salas Carlos Conceptualization Methodology Validation Formal analysis Writing – review & editing 5 https://orcid.org/0000-0001-9117-0483 Bernal Claudia Conceptualization Methodology Validation Formal analysis Investigation Resources Data curation Writing – original draft Writing – review & editing Visualization Supervision Project administration Funding acquisition 6 * https://orcid.org/0000-0003-1834-8390 Castillo Luis Conceptualization Methodology Validation Formal analysis Investigation Resources Data curation Writing – original draft Writing – review & editing Visualization Supervision Project administration Funding acquisition 1 * Fenice Massimiliano Academic Editor 1 jcisternas@userena.cl vplaza@userena.cl 2 3 4 5 cesbufmg@yahoo.com 6 * cbernal@userena.cl lcastillo@userena.cl 15 9 2025 9 2025 30 18 496804 3747 21 7 2025 05 9 2025 08 9 2025 15 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ The proteolytic fraction (P1G10) from Vasconcellea pubescens Botrytis cinerea −1 −3 −4 P1G10 antifungal chitosan alginate GORE-Coquimbo FIC-R 40059261-0 Research Department of Universidad de La Serena [DIDULS] PR222121 JST/JICA JPMJSA2206 This study was supported by grants from FIC-R 40059261-0 [GORE-Coquimbo], and the Research Department of Universidad de La Serena [DIDULS] PR222121, La Serena, Chile, to L.C. CB was supported by the SATREPS Project “Recovering High-Value Bioproducts for Sustainable Fisheries in Chile (ReBiS)” funded by JST/JICA (Grant Number JPMJSA2206). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The phytopathogenic fungus Botrytis cinerea 1 2 3 B. cinerea 4 5 6 B. cinerea 7 8 9 B. cinerea Likewise, latex components of several plant species act as a defense against herbivores, fungi, parasites and even viruses [ 10 Vasconcellea pubescens Carica candamarcencesis 11 12 13 14 B. cinerea 15 16 17 18 19 20 21 22 23 24 25 Recent studies further to expand the applicability and sophistication of alginate–chitosan protein delivery systems, ref. [ 26 27 28 29 30 In addition to its biotechnological relevance, P1G10 has been reported to exert antifungal effects against B. cinerea 15 This study aims to optimize the encapsulation and stabilization of the proteolytic fraction P1G10 within alginate–chitosan matrices and to evaluate the subsequent release of its enzymatic activity. Specifically, we investigated the effect of polymer addition order, the optimal ALG/CS ratio, and the protein loading capacity of the system. By integrating encapsulation yield, structural/thermal characterization, and release kinetics, this work provides insights into the stabilization of P1G10 and its potential application as a bioactive biocatalyst in agri-food contexts. 2. Results and Discusion 2.1. Encapsulation of P1G10 with ALG/CS Complex CS and ALG complexes, plus tripolyphosphate (TPP) as a crosslinker at different conditions, are frequently employed to create CS beads [ 31 2 32 Figure 1 Figure 1 33 2 2 Figure 1 2 2 34 2 Figure 1 Figure 1 Efficacy of biocatalyst formation. The order in which each component is added represents methods 1–5, assessing the changes in the yield of biocatalyst. See Table 1 2 2 2 p p molecules-30-03747-t001_Table 1 Table 1 Order of addition of encapsulating components.  Component Method CS P1G10 ALG CaCl 2 TPP Amount (mg) 25.0 7.5 25.0 25.0 12.0 1 First Third Second - - 2 First Second Third - - 3 First Second Third Fourth - 4 First Second Third - Fourth 5 First Second Fourth Fifth Third Methods 3 and 4 were described by [ 35 2 23 2 Figure 1 Supplementary Figure S1 Figure 2 23 Aspergillus oryzae 36 Having established the reaction order and the appropriate ALG/CS ratio, we evaluated the amount of protein between 2 and 26 mg that affords the best incorporation into the complex and preserves enzyme activity. Figure 3 Figure 3 Figure 3 −3 Figure 3 −3 2.2. Morphology and Physico-Chemical Attributes of AlG-CS-P1G10 Biocatalyst The morphology of the particles was analyzed by SEM images ( Figure 4 Figure 4 Figure 4 Figure 4 Figure 4 44 w w Figure 4 Figure 2 Differential scanning calorimetry (DSC) evaluates the thermal properties of bioactive compounds inside matrices [ 45 Figure 5 Figure 5 43 46 47 43 48 49 Figure 5 43 Table 2 molecules-30-03747-t002_Table 2 Table 2 Crystallization (Tcr) and melting (Tm) temperatures of ALG, CS, ALG-CS, P1G10, and ALG-CS-P1G10 samples determined by DSC. Sample Code T c T m ALG A 88 258 CS B 91 308 ALG-CS C 86 246 P1G10 D 76 242 ALG-CS-P1G10 E 80 246 Figure 5 Differential scanning calorimetry of samples. ( I II FTIR spectroscopic analysis confirmed crosslinking between CS, ALS and P1G10. Figure 6 −1 −1 50 −1 −1 50 −1 −1 51 52 Figure 6 −1 −1 Figure 6 In Figure 6 −1 −1 53 16 −1 −1 Figure 5 −1 Figure 5 −1 Figure 5 −1 Figure 5 2.3. P1G10 Release: Kinetics, Enzyme Activity and Material Characterization The protein release from ALG-CS-P1G10 was analyzed between 0.1 and 0.4 M NaCl at various pHs during a 48 h interval ( Figure 7 33 54 The enhanced release of P1G10 from the ALG-CS-P1G10 complex at ionic strength ≥ 0.3 M NaCl supports the notion that encapsulation relies on ionic interactions between ALG-CS and P1G10. In subsequent assays, we adopted 0.3 M NaCl to induce protein release; at this concentration, 70% of the protein is freed to the medium in 8 h ( Figure 7 55 56 57 2 2 2 Supplementary Table S1 The enzymatic activity expressed per mg of released protein ( Figure 7 58 59 Figure 8 Figure 4 Figure 8 Figure 4 60 The DSC thermograms in Figure 8 Figure 8 Figure 5 Figure 8 −1 −1 −1 Figure 6 −1 Figure 8 Figure 4 Figure 8 Figure 5 Figure 8 −1 −1 Figure 6 −1 −1 Supplementary Figure S2 −1 Figure 8 −1 Figure 8 Figure 6 −1 Figure 8 −1 Figure 6 −1 50 51 52 The spectrum in Figure 9 −1 −1 −1 Figure 6 Figure 9 Finally, to explore the potential applicability of the ALG-CS-P1G10 biocatalyst, preliminary antifungal assays were performed against B. cinerea Supplementary Figure S3 3. Materials and Methods 3.1. Papaya Latex Collection Latex collection ( Vasconcellea pubescens v v 12 3.2. Protein Extraction from Freeze-Dried Papaya Latex The protein extraction process, as previously described by [ 14 15 Supplementary Figure S4A 14 61 Supplementary Figure S4B 3.3. Encapsulation of the Proteolytic Fraction P1G10 The polymer solutions were prepared according to methodologies described by [ 62 63 w w w w v v The encapsulation of P1G10 was performed as outlined by [ 23 g 3.4. Protein Quantification Protein quantification was carried out according to [ 64 65 3.5. Determination of Enzyme Activity Enzyme activity was determined according to the methodology outlined by [ 66 A E E = U B i o c a t = A t E · l · V T · 1 V E · 1 B m 10−3 3.6. Evaluation of Encapsulating Parameters Although the processes of encapsulation by ionic gelation and complexation using polyelectrolytes are described in the literature [ 67 35 68 To assess the potential effects of tripolyphosphate, calcium chloride, and ALG/CS on the yield of ALG-CS-P1G10, several combinations of these components were evaluated ( Table 1 First, Second, Third, etc., reflect the order for the addition of each reagent. (-) indicates a lack of reagent. The volume of the reaction mix is 20 mL in 0.1 M acetate buffer at pH 5.1. Chitosan was selected as the first component of the immobilization sequence due to its higher viscosity and lower solubility at the concentration used, which complicates mixing if added later. Pre-mixing chitosan with P1G10 facilitates protein–polymer interactions and, upon subsequent addition of alginate, promotes the formation of a stable polyelectrolyte complex that improves protein entrapment. 3.7. Determination of the Mass Ratio ALG/CS To establish the mass ratio of the encapsulant media allowing the appropriate formation of the biocatalyst (ALG-CS-P1G10), the methodology used by [ 69 v v The biocatalyst formation yield was determined according to the following expression: Y % A L G / C S = M B M A L G + M C S + M P 1 G 10 × 100 The encapsulation yield was determined according to the following expression: Y ( % ) A L G − C S − P 1 G 10 = M 0 − M S M 0 × 100 3.8. Scanning Electron Microscopy (SEM) Imaging by scanning electron microscopy was performed according to [ 60 3.9. Differential Scanning Calorimetry (DSC) Changes in the transition temperature during the formation of the complex by the interaction of ALG, CS and P1G10 were measured by calorimetric assay, as described by [ 44 2 3.10. Fourier Transform Infrared Spectrometry (FTIR) To evaluate the interactions between ALG, CS and P1G10, Fourier transform infrared spectrometry (FTIR) was performed, as described by [ 70 −1 −1 3.11. Release Kinetics The protein was released as described by [ 71 64 Q % = C n · V · V i ∑ i = 0 n − 1 C i B m · Y ( % ) A L G − C S − P 1 G 10 4. Conclusions In this study, we demonstrated that the encapsulation of the proteolytic fraction P1G10 into an alginate–chitosan (ALG-CS) matrix provides both stabilization and the controlled release of the protein. The structural and thermal analyses (SEM, DSC, and FTIR) revealed that the observed morphological changes in the biocatalyst surface are attributable to electrostatic and steric interactions between P1G10 and the polymer network. These interactions account for the enhanced thermal stability and modified crystallization behavior detected by DSC, as well as the additional spectral bands detected by FTIR. From a functional perspective, the release assays confirmed that protein liberation is primarily governed by ionic strength, consistent with the ionic interactions underlying encapsulation. Importantly, while free P1G10 rapidly loses activity under similar conditions, encapsulation preserved enzymatic function and enabled a sustained release profile. Overall, the encapsulation of P1G10 in an ALG-CS matrix not only improves its stability and activity but also provides a practical strategy to overcome the intrinsic instability of free proteases in aqueous environments. This work highlights the potential of biopolymer-based delivery systems to enhance the applicability of proteolytic enzymes in biotechnological and biomedical contexts, where controlled activity and extended stability are essential. In addition to serving as a protective storage matrix, the ALG-CS system can also function as a delivery platform for P1G10 in agri-food contexts. Preliminary antifungal assays suggest that the encapsulated protein is able to inhibit the growth of B. cinerea 5. Patents Patent Application Number 202502137 (INAPI-Chile). Acknowledgments We are grateful to Universidad de La Serena and La Dirección de Investigación y Desarrollo and GORE-Coquimbo for supporting this investigation. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/molecules30183747/s1 Botrytis cinerea Author Contributions Conceptualization, J.C.-J., C.S., C.B. and L.C.; methodology, J.C.-J., V.P., C.S., C.B. and L.C.; validation, J.C.-J., V.P., C.S., C.B. and L.C.; formal analysis, J.C.-J., V.P., C.S., C.B. and L.C.; investigation, J.C.-J., C.B. and L.C.; resources, C.B. and L.C.; data curation, J.C.-J., C.B. and L.C.; writing—original draft preparation, J.C.-J., C.B. and L.C.; writing—review and editing, J.C.-J., C.S., C.B. and L.C.; visualization, C.B. and L.C.; supervision, C.B. and L.C.; project administration, C.B. and L.C.; funding acquisition, C.B. and L.C. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable for studies not involving humans or animals. Informed Consent Statement Not applicable for studies not involving humans. Data Availability Statement The original contributions presented in the study are included in the article/ Supplementary Materials Conflicts of Interest The authors declare no conflicts of interest. References 1. Dwivedi M. Singh P. Pandey A.K. Botrytis Food Microbiol. 2024 122 104564 10.1016/j.fm.2024.104564 38839226 2. Olmedo G.M. Cerioni L. González M.M. Cabrerizo F.M. Rapisarda V.A. Volentini S.I. Antifungal activity of β-carbolines on Penicillium digitatum Botrytis cinerea Food Microbiol. 2017 62 9 14 10.1016/j.fm.2016.09.011 27889171 3. Wang J. Xia X.-M. Wang H.-Y. Li P.-P. Wang K.-Y. Inhibitory effect of lactoferrin against gray mould on tomato plants caused by Botrytis cinerea Int. J. Food Microbiol. 2013 161 151 157 10.1016/j.ijfoodmicro.2012.11.025 23333340 4. Wroński M. Trawiński J. Skibiński R. Antifungal drugs in the aquatic environment: A review on sources, occurrence, toxicity, health effects, removal strategies and future challenges J. Hazard. Mater. 2023 465 133167 10.1016/j.jhazmat.2023.133167 38064946 5. Nicolopoulou-Stamati P. Maipas S. Kotampasi C. Stamatis P. Hens L. Chemical Pesticides and Human Health: The Urgent Need for a New Concept in Agriculture Front. Public Health 2016 4 148 10.3389/fpubh.2016.00148 27486573 PMC4947579 6. Abbey J.A. Percival D. Abbey L. Asiedu S.K. Prithiviraj B. Schilder A. Biofungicides as alternative to synthetic fungicide control of grey mould ( Botrytis cinerea Biocontrol Sci. Technol. 2018 29 207 228 10.1080/09583157.2018.1548574 7. Kfoury M. Lounès-Hadj Sahraoui A. Bourdon N. Laruelle F. Fontaine J. Auezova L. Greige-Gerges H. Fourmentin S. Solubility, photostability and antifungal activity of phenylpropanoids encapsulated in cyclodextrins Food Chem. 2016 196 518 525 10.1016/j.foodchem.2015.09.078 26593522 8. Aguilar-González A.E. Palou E. López-Malo A. Antifungal activity of essential oils of clove ( Syzygium aromaticum Brassica nigra Botrytis cinerea Innov. Food Sci. Emerg. Technol. 2015 32 181 185 10.1016/j.ifset.2015.09.003 9. Soylu E.M. Kurt Ş. Soylu S. In vitro and in vivo antifungal activities of the essential oils of various plants against tomato grey mould disease agent Botrytis cinerea Int. J. Food Microbiol. 2010 143 183 189 10.1016/j.ijfoodmicro.2010.08.015 20826038 10. Ramos M.V. Demarco D. Souza I.C.d.C. de Freitas C.D.T. Laticifers, Latex, and Their Role in Plant Defense Trends Plant Sci. 2019 24 553 567 10.1016/j.tplants.2019.03.006 30979674 11. Freitas K.M. Veloso E.S. Ferreira Ê. Caliari M.V. Salas C.E. Lopes M.T. Effects of P1G10 against UVB-induced damage: Reduction of antioxidant stress, inflammation and cell proliferation J. Photochem. Photobiol. 2025 25 100255 10.1016/j.jpap.2024.100255 12. Baeza G. Correa D. Salas C. Proteolytic enzymes in Carica candamarcensis J. Sci. Food Agric. 1990 51 1 9 10.1002/jsfa.2740510102 13. Lemos F.O. Villalba M.I.C. Tagliati C.A. Cardoso V.N. Salas C.E. Lopes M.T. Biodistribution, pharmacokinetics and toxicity of a Vasconcellea cundinamarcensis Rev. Bras. Farm. 2016 26 94 101 10.1016/j.bjp.2015.09.008 14. Teixeira R.D. Ribeiro H.A. Gomes M.-T.R. Lopes M.T. Salas C.E. The proteolytic activities in latex from Carica candamarcensis Plant Physiol. Biochem. 2008 46 956 961 10.1016/j.plaphy.2008.06.010 18672376 15. Torres-Ossandón M.J. Vega-Gálvez A. Salas C.E. Rubio J. Silva-Moreno E. Castillo L. Antifungal activity of proteolytic fraction (P1G10) from ( Vasconcellea cundinamarcensis Botrytis cinerea Int. J. Food Microbiol. 2019 289 7 16 10.1016/j.ijfoodmicro.2018.08.027 30193124 16. Denadai Â.M.L. Santoro M.M. Lopes M.T.P. Chenna A. de Sousa F.B. Avelar G.M. Gomes M.R.T. Guzman F. Salas C.E. Sinisterra R.D. A Supramolecular Complex between Proteinases and β-Cyclodextrin that Preserves Enzymatic Activity BioDrugs 2006 20 283 291 10.2165/00063030-200620050-00004 17025375 17. Rezagholizade-Shirvan A. Soltani M. Shokri S. Radfar R. Arab M. Shamloo E. Bioactive compound encapsulation: Characteristics, applications in food systems, and implications for human health Food Chem. X 2024 24 101953 10.1016/j.fochx.2024.101953 39582652 PMC11584689 18. Wen C. Tang J. Cao L. Fan M. Lin X. Liu G. Liang L. Liu X. Zhang J. Li Y. Strategic Approaches for Co-Encapsulation of Bioactive Compounds: Technological Advances and Mechanistic Insight Foods 2025 14 2024 10.3390/foods14122024 40565632 PMC12191517 19. Worrall E.A. Hamid A. Mody K.T. Mitter N. Pappu H.R. Nanotechnology for Plant Disease Management Agronomy 2018 8 285 10.3390/agronomy8120285 20. Zabot G.L. Rodrigues F.S. Ody L.P. Tres M.V. Herrera E. Palacin H. Córdova-Ramos J.S. Best I. Olivera-Montenegro L. Encapsulation of Bioactive Compounds for Food and Agricultural Applications Polymers 2022 14 4194 10.3390/polym14194194 36236142 PMC9571964 21. Mujtaba M. Khawar K.M. Camara M.C. Carvalho L.B. Fraceto L.F. Morsi R.E. Elsabee M.Z. Kaya M. Labidi J. Ullah H. Chitosan-based delivery systems for plants: A brief overview of recent advances and future directions Int. J. Biol. Macromol. 2020 154 683 697 10.1016/j.ijbiomac.2020.03.128 32194112 22. Kashyap P.L. Xiang X. Heiden P. Chitosan nanoparticle based delivery systems for sustainable agriculture Int. J. Biol. Macromol. 2015 77 36 51 10.1016/j.ijbiomac.2015.02.039 25748851 23. Ozaltin K. Postnikov P.S. Trusova M.E. Sedlarik V. Di Martino A. Polysaccharides based microspheres for multiple encapsulations and simultaneous release of proteases Int. J. Biol. Macromol. 2019 132 24 31 10.1016/j.ijbiomac.2019.03.189 30922912 24. Yi Y. Liu Y. Chu Y. Hou Z. Liu S. Yang Q. Liu S. Zuo P. Hu Y. Encapsulation of CBP1 antifungal protein into sodium alginate and chitosan to control the Aspergillus flavus Food Control 2023 156 110147 10.1016/j.foodcont.2023.110147 25. Boškov I.A. Savić I.M. Stanisavljević N.Đ.G. Kundaković-Vasović T.D. Selgrad J.S.R. Gajić I.M.S. Stabilization of Black Locust Flower Extract via Encapsulation Using Alginate and Alginate–Chitosan Microparticles Polymers 2024 16 688 10.3390/polym16050688 38475369 PMC10935368 26. Zhao B. Alonso N.F. Miras J. Vílchez S. García-Celma M.J. Morral G. Esquena J. Triggered protein release from calcium alginate/chitosan gastro-resistant capsules. Colloids Surfaces A: Physicochem Eng. Asp. 2024 693 133998 10.1016/j.colsurfa.2024.133998 27. Upadhyay U. Kolla S. Maredupaka S. Priya S. Srinivasulu K. Chelluri L.K. Development of an alginate–chitosan biopolymer composite with dECM bioink additive for organ-on-a-chip articular cartilage Sci. Rep. 2024 14 1 13 10.1038/s41598-024-62656-1 38782958 PMC11116456 28. Khatibi N. Naimi-Jamal M.R. Balalaie S. Shokoohmand A. Development and evaluation of a pH-sensitive, naturally crosslinked alginate-chitosan hydrogel for drug delivery applications Front. Biomater. Sci. 2024 3 1457540 10.3389/fbiom.2024.1457540 29. Ma L. Zhou W. Ma X. Li X. Zhang Q. Ma W. Chen N. Zhou X. Tang X. Preparation and property evaluation of oral colon targeted protein delivery system with sodium alginate and chitosan Sci. Rep. 2025 15 21598 10.1038/s41598-025-04983-5 40593991 PMC12218344 30. Yeerong K. Chantawannakul P. Anuchapreeda S. Juntrapirom S. Kanjanakawinkul W. Müllertz A. Rades T. Chaiyana W. Chitosan Alginate Nanoparticles of Protein Hydrolysate from Acheta domesticus with Enhanced Stability for Skin Delivery Pharmaceutics 2024 16 724 10.3390/pharmaceutics16060724 38931846 PMC11206680 31. Di Santo M.C. Antoni C.L.D. Rubio A.P.D. Alaimo A. Pérez O.E. Chitosan-tripolyphosphate nanoparticles designed to encapsulate polyphenolic compounds for biomedical and pharmaceutical applications—A review Biomed. Pharmacother. 2021 142 111970 10.1016/j.biopha.2021.111970 34333289 32. Costa M.J. Marques A.M. Pastrana L.M. Teixeira J.A. Sillankorva S.M. Cerqueira M.A. Physicochemical properties of alginate-based films: Effect of ionic crosslinking and mannuronic and guluronic acid ratio Food Hydrocoll. 2018 81 442 448 10.1016/j.foodhyd.2018.03.014 33. Shi X. Du Y. Sun L. Zhang B. Dou A. Polyelectrolyte complex beads composed of water-soluble chitosan/alginate: Characterization and their protein release behavior J. Appl. Polym. Sci. 2006 100 4614 4622 10.1002/app.23021 34. Patel M.A. AbouGhaly M.H. Schryer-Praga J.V. Chadwick K. The effect of ionotropic gelation residence time on alginate cross-linking and properties Carbohydr. Polym. 2017 155 362 371 10.1016/j.carbpol.2016.08.095 27702523 35. Caetano L.A. Almeida A.J. Gonçalves L.M. Effect of Experimental Parameters on Alginate/Chitosan Microparticles for BCG Encapsulation Mar. Drugs 2016 14 90 10.3390/md14050090 27187418 PMC4882564 36. Coppi G. Iannuccelli V. Leo E. Bernabei M.T. Cameroni R. Chitosan-Alginate Microparticles as a Protein Carrier Drug Dev. Ind. Pharm. 2001 27 393 400 10.1081/DDC-100104314 11448046 37. Thu T.T.M. Krasaekoopt W. Encapsulation of protease from Aspergillus oryzae Agric. Nat. Resour. 2016 50 155 161 10.1016/j.anres.2016.06.002 38. Li X. Kong X. Shi S. Zheng X. Guo G. Wei Y. Qian Z. Preparation of alginate coated chitosan microparticles for vaccine delivery BMC Biotechnol. 2008 8 89 10.1186/1472-6750-8-89 19019229 PMC2603011 39. Vandenberg G. Drolet C. Scott S. de la Noüe J. Factors affecting protein release from alginate–chitosan coacervate microcapsules during production and gastric/intestinal simulation J. Control. Release 2001 77 297 307 10.1016/S0168-3659(01)00517-X 11733097 40. Dumitriu S. Inclusion and release of proteins from polysaccharide-based polyion complexes Adv. Drug Deliv. Rev. 1998 31 223 246 10.1016/S0169-409X(97)00120-8 10837627 41. Gao S. Holkar A. Srivastava S. Protein–Polyelectrolyte Complexes and Micellar Assemblies Polymers 2019 11 1097 10.3390/polym11071097 31261765 PMC6680422 42. Gomes M.T.R. Teixeira R.D. Ribeiro H.d.A.L. Turchetti A.P. Junqueira C.F. Lopes M.T.P. Salas C.E. Nagem R.A.P. Purification, crystallization and preliminary X-ray analysis of CMS1MS2: A cysteine proteinase from Carica candamarcensis Acta Crystallogr. Sect. F Struct. Biol. Cryst. Commun. 2008 64 492 494 10.1107/S174430910801172X 18540057 PMC2496862 43. Sankalia M.G. Mashru R.C. Sankalia J.M. Sutariya V.B. Reversed chitosan–alginate polyelectrolyte complex for stability improvement of alpha-amylase: Optimization and physicochemical characterization Eur. J. Pharm. Biopharm. 2007 65 215 232 10.1016/j.ejpb.2006.07.014 16982178 44. Xiao S. Ahn D.U. Enhanced lutein stability under UV-Light and high temperature by loading it into alginate-chitosan complex LWT 2022 164 113663 10.1016/j.lwt.2022.113663 45. Rutz J.K. Borges C.D. Zambiazi R.C. da Rosa C.G. da Silva M.M. Elaboration of microparticles of carotenoids from natural and synthetic sources for applications in food Food Chem. 2016 202 324 333 10.1016/j.foodchem.2016.01.140 26920301 46. Jana S. Trivedi M.K. Tallapragada R.M. Branton A. Trivedi D. Nayak G. Mishra R. Characterization of Physicochemical and Thermal Properties of Chitosan and Sodium Alginate after Biofield Treatment Pharm. Anal. Acta 2015 6 10.4172/2153-2435.1000430 47. Wang L. Khor E. Lim L.Y. Chitosan-Alginate-CaCl2 System for Membrane Coat Application J. Pharm. Sci. 2001 90 1134 1142 10.1002/jps.1067 11536218 48. Pendekal M.S. Tegginamat P.K. Hybrid drug delivery system for oropharyngeal, cervical and colorectal cancer—In vitro and in vivo evaluation Saudi Pharm. J. 2012 21 177 186 10.1016/j.jsps.2012.07.002 23960833 PMC3744963 49. Thai H. Nguyen C.T. Thach L.T. Tran M.T. Mai H.D. Nguyen T.T.T. Le G.D. Van Can M. Tran L.D. Bach G.L. Characterization of chitosan/alginate/lovastatin nanoparticles and investigation of their toxic effects in vitro and in vivo Sci. Rep. 2020 10 909 10.1038/s41598-020-57666-8 31969608 PMC6976711 50. Hosseini S. Varidi M. Optimization of Microbial Rennet Encapsulation in Alginate – Chitosan Nanoparticles Food Chem. 2021 352 129325 10.1016/j.foodchem.2021.129325 33691212 51. Calvo T.A. Santagapita P. Physicochemical Characterization of Alginate Beads Containing Sugars and Biopolymers J. Qual. Reliab. Eng. 2016 2016 9184039 10.1155/2016/9184039 52. Han J. Guenier A.-S. Salmieri S. Lacroix M. Alginate and Chitosan Functionalization for Micronutrient Encapsulation J. Agric. Food Chem. 2008 56 2528 2535 10.1021/jf703739k 18324770 53. Gomes M.T.R. Teixeira R.D. Lopes M.T.P. Nagem R.A.P. Salas C.E. X-ray crystal structure of CMS1MS2: A high proteolytic activity cysteine proteinase from Carica candamarcensis Amino Acids 2012 43 2381 2391 10.1007/s00726-012-1318-7 22610687 54. Solgaard G. Thorsen K.H. Draget K.I. Encapsulation of a proteolytically active novel bioproduct; controlling the release of proteinous components Food Bioprod. Process. 2008 87 40 45 10.1016/j.fbp.2008.03.003 55. Lindhoud S. de Vries R. Schweins R. Stuart M.A.C. Norde W. Salt-induced release of lipase from polyelectrolyte complex micelles Soft Matter 2009 5 242 250 10.1039/B811640G 56. Mi F.-L. Sung H.-W. Shyu S.-S. Drug release from chitosan–alginate complex beads reinforced by a naturally occurring cross-linking agent Carbohydr. Polym. 2002 48 61 72 10.1016/S0144-8617(01)00212-0 57. Jahromi L.P. Ghazali M. Ashrafi H. Azadi A. A comparison of models for the analysis of the kinetics of drug release from PLGA-based nanoparticles Heliyon 2020 6 e03451 10.1016/j.heliyon.2020.e03451 32140583 PMC7049635 58. Alharbi K. Al-Osaimi A.A. Alghamdi B.A. Sodium Chloride (NaCl)-Induced Physiological Alteration and Oxidative Stress Generation in Pisum sativum ACS Omega 2022 7 20819 20832 10.1021/acsomega.2c01427 35755363 PMC9219073 59. Singh J. Sastry E.V.D. Singh V. Effect of salinity on tomato ( Lycopersicon esculentum Physiol. Mol. Biol. Plants 2011 18 45 50 10.1007/s12298-011-0097-z 23573039 PMC3550529 60. Xing L. Sun J. Tan H. Yuan G. Li J. Jia Y. Xiong D. Chen G. Lai J. Ling Z. Covalently polysaccharide-based alginate/chitosan hydrogel embedded alginate microspheres for BSA encapsulation and soft tissue engineering Int. J. Biol. Macromol. 2019 127 340 348 10.1016/j.ijbiomac.2019.01.065 30658141 61. Mello V.J. Gomes M.T.R. Lemos F.O. Delfino J.L. Andrade S.P. Lopes M.T. Salas C.E. The gastric ulcer protective and healing role of cysteine proteinases from Carica candamarcensis Phytomedicine 2008 15 237 244 10.1016/j.phymed.2007.06.004 17689943 62. Li J. Jin H. Razzak A. Kim E.J. Choi S.S. Crosslinker-free Bovine Serum Albumin-loaded Chitosan/alginate Nanocomplex for pH-responsive Bursting Release of Oral-administered Protein. Biotechnol Bioprocess Eng. 2022 27 40 50 10.1007/s12257-021-0243-6 63. Ataide J.A. Gérios E.F. Cefali L.C. Fernandes A.R. Teixeira M.D.C. Ferreira N.R. Tambourgi E.B. Jozala A.F. Chaud M.V. Oliveira-Nascimento L. Effect of Polysaccharide Sources on the Physicochemical Properties of Bromelain—Chitosan Nanoparticles Polymers 2019 11 1681 10.3390/polym11101681 31618858 PMC6835720 64. Lowry O.H. Rosebrough N.J. Farr A.L. Randall R.J. Protein measurement with the Folin phenol reagent J. Biol. Chem. 1951 193 265 275 10.1016/S0021-9258(19)52451-6 14907713 65. Deng Q.-Y. Zhou C.-R. Luo B.-H. Preparation and Characterization of Chitosan Nanoparticles Containing Lysozyme Pharm. Biol. 2006 44 336 342 10.1080/13880200600746246 66. Bernal C. Poveda-Jaramillo J.C. Mesa M. Raising the enzymatic performance of lipase and protease in the synthesis of sugar fatty acid esters, by combined ionic exchange -hydrophobic immobilization process on aminopropyl silica support Chem. Eng. J. 2018 334 760 767 10.1016/j.cej.2017.10.082 67. Niculescu A.-G. Grumezescu A.M. Applications of Chitosan-Alginate-Based Nanoparticles—An Up-to-Date Review Nanomaterials 2022 12 186 10.3390/nano12020186 35055206 PMC8778629 68. Bahreini E. Aghaiypour K. Abbasalipourkabir R. Mokarram A.R. Goodarzi M.T. Saidijam M. Preparation and nanoencapsulation of l-asparaginase II in chitosan-tripolyphosphate nanoparticles and in vitro release study Nanoscale Res. Lett. 2014 9 340 10.1186/1556-276X-9-340 25114635 PMC4110547 69. Antoniou J. Liu F. Majeed H. Qi J. Yokoyama W. Zhong F. Physicochemical and morphological properties of size-controlled chitosan–tripolyphosphate nanoparticles. Colloids Surfaces A: Physicochem Eng. Asp. 2015 465 137 146 10.1016/j.colsurfa.2014.10.040 70. Lazaridou M. Christodoulou E. Nerantzaki M. Kostoglou M. Lambropoulou D.A. Katsarou A. Pantopoulos K. Bikiaris D.N. Formulation and In-Vitro Characterization of Chitosan-Nanoparticles Loaded with the Iron Chelator Deferoxamine Mesylate (DFO) Pharmaceutics 2020 12 238 10.3390/pharmaceutics12030238 32156022 PMC7150847 71. Sáez M. Barros A. Vizcaíno A. López G. Alarcón F. Martínez T. Effect of alginate and chitosan encapsulation on the fate of BSA protein delivered orally to gilthead sea bream ( Sparus aurata Anim. Feed Sci. Technol. 2015 210 114 124 10.1016/j.anifeedsci.2015.09.008 Figure 2 The effect of ALG/CS mass ratio changes on ALG-CS-P1G10 biocatalyst formation. p Figure 3 Effect of amount of P1G10 protein on the encapsulation efficacy. ( I II III p 37 38 39 40 41 42 22 43 Figure 4 Scanning electron microscopy (SEM) analysis of samples. ( A w w B w w C w w D w w Figure 6 Fourier transform infrared spectra of samples. ( I II Figure 7 P1G10 protein release kinetics from ALG-CS-P1G10 biocatalyst as a function of sodium chloride concentration. ( I p II Figure 8 Effect of incubation on scanning electron microscopy (SCE) of ALG-CS and ALG-CS-P1G10 samples. Images represent the ALG-CS-P1G10 biocatalyst ( I IV w w II V III VI Figure 9 Evaluation of P1G10 release from ALG-CS-P1G10. ( I II ",
  "metadata": {
    "Title of this paper": "Effect of alginate and chitosan encapsulation on the fate of BSA protein delivered orally to gilthead sea bream (",
    "Journal it was published in:": "Molecules",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472595/"
  }
}