{
  "title": "Paper_761",
  "abstract": "pmc Pharmaceutics Pharmaceutics 2103 pharmamdpi pharmaceutics Pharmaceutics 1999-4923 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473596 PMC12473596.1 12473596 12473596 41012457 10.3390/pharmaceutics17091117 pharmaceutics-17-01117 1 Article Advances in Hydrophilic Drug Delivery: Encapsulation of Biotin in Alginate Microparticles https://orcid.org/0009-0000-5026-1311 Naveira-Souto Iria Conceptualization Software Formal analysis Investigation Data curation Writing – original draft Visualization 1 2 https://orcid.org/0000-0002-8230-0474 Rosell-Vives Elisabet Methodology Validation Resources Writing – review & editing Funding acquisition 2 https://orcid.org/0000-0001-8743-7229 Pena-Rodríguez Eloy Methodology Writing – review & editing 2 https://orcid.org/0000-0001-8224-2932 Fernandez-Campos Francisco Methodology Software Writing – review & editing 2 https://orcid.org/0000-0002-4080-3516 Lajarin-Reinares Maria Conceptualization Formal analysis Investigation Data curation Writing – original draft Supervision 2 * Timmins Peter Academic Editor 1 inaveira@reigjofre.com 2 erosell@reigjofre.com eloy.penarodriguez@microcaps.ch francisco.fernandez@labiana.com * mlajarin@reigjofre.com 27 8 2025 9 2025 17 9 497664 1117 28 7 2025 11 8 2025 12 8 2025 27 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background: Objectives: ® 2 Methods: 2 ® Results: Conclusions: alginate chitosan drug release biotin microparticles ionic reticulation design of experiments Generalitat of Catalonia, Industrial Doctorate Program 2022 DI 015 This research was funded by the Generalitat of Catalonia, Industrial Doctorate Program, grant number 2022 DI 015. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The development of effective delivery strategies for hydrophilic drugs has emerged as a critical area of pharmaceutical research, driven by the increasing interest in both macromolecular therapeutics—such as nucleic acids, peptides, and proteins—and small hydrophilic molecules for the treatment of cancer, infectious, and inflammatory diseases [ 1 2 3 Microencapsulation presents a highly effective strategy to overcome these limitations by enhancing the delivery of hydrophilic compounds such as biotin. Microparticles (MPs)—spherical structures typically ranging from 1 to 1000 µm in diameter—can protect sensitive bioactives from adverse environmental conditions (e.g., pH fluctuations, oxidation, temperature), enhance chemical and enzymatic stability, and allow for controlled and targeted release. These polymeric delivery systems can be incorporated into a wide array of pharmaceutical dosage forms, including solids (e.g., tablets, capsules), semisolids (e.g., gels, creams), and liquids (e.g., suspensions), making them highly adaptable to different therapeutic needs [ 2 Biotin, also known as vitamin B7 [ 4 5 6 Figure 1 7 8 8 9 10 6 10 11 12 13 This study presents the innovative fabrication of alginate–Eudragit ® 14 Figure 2 15 14 16 17 A key advantage of alginate is its ability to undergo gelation under mild conditions in the presence of divalent cations—such as calcium (Ca 2+ Figure 3 14 15 2 16 Alginate-based microparticles have been extensively studied for the encapsulation of hydrophilic drugs due to their protective and release-modulating properties. Previous research has demonstrated their effectiveness in the delivery of compounds such as insulin, vitamin C, and antibiotics, in both oral and topical formulations [ 18 19 20 ® To enhance the structural and functional properties of the microparticles, Eudragit ® Figure 2 21 22 ® ® 23 24 25 By combining the complementary properties of alginate and Eudragit ® Although biotin conjugates with alginate have previously been explored for biosensor construction [ 11 2. Materials and Methods 2.1. Materials Sodium alginate (MW (g/mol) > 200,000, Carbo Erba Reagents, Val de Reuil Cedex, France), Basic Butylated Methacrylate Copolymer (Eudragit ® 2.2. Synthesis of Alginate-MP and Biotin-Loaded Alginate-MP Three solutions were prepared at different concentrations of alginate (0.1–0.4% w w 2 w w ® w w 2 ® 22 2 ® The optimized formulation was used to encapsulate biotin. Biotin was incorporated at 0.05% w w w w 2.3. Development of Alginate Microparticles Preliminary screening trials were conducted. Twelve placebo batches ( n ® 2 Table 1 2 2 14 26 27 28 Statistical analysis of the variables studied was carried out using Minitab 17 statistical software (Minitab, Inc., 2010, State College, PA, USA) to obtain mathematical equations for each model. Subsequently, each model was optimized. Once the screening study was completed, only the significant variables of the model were used to optimize microparticles’ Z-average and PDI (Z-potential was excluded from the analysis, as explained in the Section 3 2 2 After the optimization, the final mathematical model obtained was used to produce microparticles. To evaluate the predictive capacity of the model, the properties of the optimized microparticles were compared with those predicted by the model, and the bias was calculated (Equation (1)). (1) % Bias =  R e f − Z 1  R e f  × 100 Ref Z 1 2.4. Microparticles Physicochemical Characterization 2.4.1. Hydrodynamic Diameter, Polydispersity Index, and Z-Potential The Z-potential (Z-Pot), hydrodynamic diameter (Z-Ave), and polydispersity index (PDI) were studied for alginate particles through dynamic light scattering (DLS) using a Malvern Zetasizer Nano ZS (Malvern Panalytical, Malvern, UK) ( n Three measurements were performed on each sample with 15 readings per measurement. The results obtained were considered correct when the autocorrelation function was between 0.6 and 1. PDI and the Z-Ave size were carried out in 10 mm × 10 mm × 45 mm polystyrene cuvettes. In the case of Z-Pot, DST1070 cells were used, which consist of two gold-covered copper electrodes (Malvern Panalytical, Worcestershire, UK). 2.4.2. Transmission Electron Microscopy The final placebo alginate-MPs and biotin-loaded alginate-MP morphology and structural features were studied using transmission electron microscopy (TEM) (FEI, Eindhoven, The Netherlands). The sample was adsorbed onto a carbon-coated copper grid for 1 min and then washed with milli-Q ® 2.5. High-Performance Liquid Chromatography (HPLC) Analysis, Encapsulation Efficiency, and Biotin Content Determination The encapsulation efficiency (% EE W T W NE g n (2) % E E = W T − W N E W T × 100 The biotin content was quantified using HPLC (Waters 2695, Cerdanyola del Vallès, Spain) with a photodiode array detector (Waters 2996, Cerdanyola del Vallès, Spain), following a calibration curve (range: 20 to 0.1 µg/mL, r 2 w v v v Table 2 The biotin content in the final formulation ( w w 2.6. In Vitro Release Tests In vitro release of biotin-loaded alginate-MP was studied using Slide-A-Lyzer ® ® w w Aliquots of 300 µL were taken at certain times (0.25, 0.5, 1, 1.5, 2, 3, 22, 23, and 24 h) and injected into the HPLC with the method described in Section 2.6 Kinetic modeling of the release data was studied with the DDSolver [ 23 Table 3 2.7. Scale-Up of Alginate Particles In order to reach higher production rates of alginate-MP, the first stage of the production process was scaled up. For the scale-up experiments, a UIP1000hdT ultrasonic device (Hielscher Ultrasonics, Teltow, Germany) (consisting of a transducer and ultrasonicator generator), a sonotrode (BS4d22; diameter 22 mm), and a flow cell reactor (FC100l1k-1S; Hielscher Ultrasonics, Teltow, Germany) were used. As the initial phase, the mixture between the CaCl 2 Figure 4 Figure 4 ® Figure 4 Figure 5 During the process, a constant amplitude of 100% (220 µm) was used for continuous sonication. The batches were manufactured using the % composition determined by the particle’s optimization of Section 2.3 Section 2.4.1 ® Section 2.4.1 A central composite design with 13 runs, 5 central points, 4 cube points, and 4 axial points was selected to obtain the maximum information about scaling with the minimum number of batches. A default α value of 1.4 was used to determine the axial points using Minitab 17 statistical software. A significance level (α) of 0.05 was set to identify trends during the scale-up process. In this case, the effect of batch size and sonication cycles on the PDI and hydrodynamic diameter variables was determined ( Table 4 An overview of the complete methodology employed in this investigation is provided in Figure 6 3. Results and Discussion 3.1. Preparation and Statistical Design to Evaluate the Effect of Experimental Variables on the Physicochemical Characteristics of MPs To evaluate the impact of the different excipients and manufacturing process on the physicochemical characteristics of the MPs (hydrodynamic diameter, polydispersity index and zeta potential), the values of the different variables were modified as follows: alginate concentration (0.1–0.3% w w 2 w w ® w w Table 5 A screening methodology was applied using Minitab ® Table 6 2 2 26 The factors X 1 2, 3 2 w w 1 p p p Figure 7 2 2 17 27 28 The concentrations of alginate and CaCl 2 w w p p Figure 8 2 2 Regarding Z-Pot, the concentrations of alginate and Eudragit ® w w p p Figure 9 29 ® Table 5 30 It should be noted that these measurements were carried out in the dispersion medium at pH 5.1, which corresponds to the medium in which the placebo microparticles were initially prepared and suspended. The aim at this stage was to evaluate the physiological properties of the carrier system itself. Subsequent formulation steps for specific routes of administration (e.g., oral or topical) would require further characterization at relevant physiological pH values. 3.2. Optimization of Alginate Microparticles Once the main variables were obtained, the three factors (% alginate, % CaCl 2 31 Table 7 Surface response methodology was applied using Minitab software (with a significance level of α = 0.05 for the level terms) to analyze the effect of the tested experimental variables (Z-Ave and PDI). The fitted response surface model equations are shown in Table 8 2 2 26 The amount of alginate and sonication energy were significant with respect to Z-Ave ( p Figure 10 32 2 2 p p 2 33 1 2 Table 8 Regarding PDI, different effects were observed. The levels of alginate, CaCl 2 p p p p 2 Figure 11 2 p p p 2 In contrast, the optimization study revealed significant effects and interactions, showing that higher concentrations of polymer and cross-linker can increase particle heterogeneity. This may be due to the formation of overly dense or irregular networks, leading to aggregation or incomplete cross-linking. Additionally, the combined effect of higher sonication energy could intensify particle breakup in an uneven manner, further increasing polydispersity. In the case of sonication energy (Ws), a quadratic relationship was obtained, and an interaction was found. A minimum polydispersity index (PDI) value was observed at an intermediate level of sonication energy, indicating the existence of an optimal energy input for particle size uniformity. At lower energies, insufficient dispersion likely leads to incomplete particle formation or aggregation, while excessively high energies may induce cavitation phenomena. These high-energy conditions generate intense shock waves and turbulence, which increase mass transfer and can cause both agglomeration and fragmentation of particles, ultimately resulting in a broader particle size distribution [ 34 Considering the high prediction values from the obtained model, statistical optimization of the formulation was carried out to minimize the PDI value (as an indicator of a more stable system), within the design space limits. As shown in Table 9 2, ® ® In order to assess the predictability of the model, two independent placebo formulations were produced. The bias from the theoretical predictions is reported in Table 10 3.3. Physicochemical Characterization of Biotin-Loaded MPs The encapsulation efficiency of the biotin-loaded microparticles was 90.50% ± 0.26, indicating a highly robust and reproducible encapsulation process. In addition to encapsulation efficiency, the biotin content ( w w w w In this work, biotin content was expressed relative to the total mass of the final dispersion rather than as drug loading on a dry particle basis. This approach was selected because the microparticles were not lyophilized, and the study aimed to characterize the formulation under the conditions in which it will be handled and stored in subsequent applications. While dry basis determination can be useful for comparative purposes, reporting the content in the liquid dispersion provides a more relevant measure for liquid-based dosage forms and early-stage formulation screening. The relatively low biotin content selected in this study (0.045% w w w w w w Biotin-loaded microparticles (MPs) exhibited a smaller particle size compared to that of the empty MPs, measuring 633.7 ± 77.15 nm with a polydispersity index (PDI) of 0.260 ± 0.021. This reduction in size can be attributed to the electrostatic interactions between biotin and Eudragit ® Biotin, initially dissolved in 0.1 N NaOH, remains in its deprotonated form (−COO − ® 3 + ® 35 ® 36 ® The zeta potential was −44.77 ± 1.06 mV, indicating high particle stability. 3.4. Transmission Electron Microscopy The high resolution of the TEM images ( Figure 12 Figure 12 Notably, the TEM micrographs reveal a distinct core–shell morphology, particularly evident in the biotin-loaded microparticles. This structural feature corresponds well with the two-step fabrication process described in Section 2.7 16 18 26 27 34 37 2 ® 2+ ® The appearance of a brighter core and darker shell is consistent with this configuration, suggesting successful complexation between both polymers. This architecture has been associated with enhanced particle robustness, protection of the encapsulated compound, and modulation of release kinetics. Similar core–shell morphologies have been reported in other systems involving alginate and Eudragit ® 14 38 39 The diameter distribution of the particles, as measured by TEM, is presented in Figure 13 The discrepancy between the particle sizes measured by DLS and TEM for both biotin-loaded and placebo microparticles can be explained by the fundamental differences between the two techniques [ 31 40 41 42 43 In dynamic light scattering (DLS), the measurement reflects the hydrodynamic diameter, which includes not only the solid core of the particles but also any surrounding hydration layer and potential aggregates present in the dispersion [ 44 45 In our case, the biotin-loaded particles show a DLS size of 633 nm versus a TEM size of 150 nm. This indicates that in suspension, the biotin-loaded microparticles are either swollen, possess a significant hydration layer, or form loose aggregates, leading to an increased effective hydrodynamic diameter. On the other hand, the placebo microparticles have an even larger DLS size (800–1000 nm) compared to a TEM size of 136 nm. This suggests that the placebo formulation may have a higher tendency to aggregate or swell in solution, likely due to differences in surface properties or the absence of biotin, which could otherwise impart some steric or electrostatic stabilization. Thus, the larger sizes observed by DLS are not contradictory but rather complementary to the TEM results: while TEM reveals the intrinsic particle dimensions, DLS reflects the dynamic behavior in solution and the influence of the surrounding medium. This interpretation aligns with previous studies [ 31 35 3.5. In Vitro Release Test The release profiles of the free biotin and biotin-loaded MPs can be seen in Figure 14 After adjusting the mean release data with the different mathematical models (see Table 11 For free biotin, the fitted Weibull parameter β 46 47 In contrast, biotin encapsulated in alginate microparticles yielded a β 24 48 β These results can be further understood by considering the structural and electrostatic characteristics of the polymeric matrix. Upon ionic cross-linking with Ca 2+ 49 50 β Moreover, biotin’s anionic character (–COO − ® 3 + 51 52 53 The difference in β 54 55 As shown in Figure 14 56 57 58 59 60 In summary, these findings demonstrate that encapsulation in alginate microparticles modulates the biotin release mechanism—from an exponential, concentration gradient-driven release ( β β 30 48 3.6. Scale-Up of Alginate-MPs To enter the pharmaceutical market, specific requirements must be met, i.e., having affordable, large-scale production techniques along with concurrent compliance with regulatory standards. An easy production process running in a laboratory setup becomes useful only when it can be taken to a large scale. Large-scale processes require qualified lines to function effectively [ 61 62 One of the important aspects to optimize in the design of microparticles as a delivery system is the control of particle size and polydispersity. Optimization becomes especially important when the formulation needs to be scaled up for industrial production [ 63 64 Table 12 Surface response methodology was employed using Minitab software, with a significance level of α = 0.05 for the level terms, to evaluate the effects of the experimental variables. However, no statistically significant factor ( p According to laboratory-scale observations, a decrease in Z-Ave and PDI was anticipated with increased energy applied. However, this significant reduction only occurred after the addition of Eudragit ® Figure 15 Figure 16 The outcome may be due to the low percentage of CaCl 2 ® The analysis examined the effects of sonication cycles and batch size on the PDI and hydrodynamic size, revealing that both variables significantly decreased after the addition of Eudragit ® ® ® After calculating the ratio before and after the addition of Eudragit ® Table 13 ® ® ® 65 Eudragit ® 44 However, the effects of sonication cycles and batch size following Eudragit ® 4. Conclusions The study effectively demonstrated the formulation and optimization of biotin-loaded microparticles utilizing alginate, Eudragit ® 2 Acknowledgments The authors thank the valuable contribution of Mari Carmen Moreno and Jordi Jodar (Laboratory Reig Jofre, Sant Joan Despí, Barcelona, Spain). Disclaimer/Publisher’s Note: Author Contributions Conceptualization, M.L.-R. and I.N.-S.; methodology, F.F.-C., and E.P.-R.; software, F.F.-C. and I.N.-S.; validation, E.R.-V.; formal analysis, I.N.-S. and M.L.-R.; investigation, I.N.-S. and M.L.-R.; resources, E.R.-V.; data curation, I.N.-S. and M.L.-R.; writing—original draft preparation, I.N.-S. and M.L.-R.; writing—review and editing, F.F.-C., E.P.-R., and E.R.-V.; visualization, M.L.-R. and I.N.-S.; supervision, M.L.-R.; project administration, E.R.-V.; funding acquisition, E.R.-V. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement Data is available upon request due to intellectual property. Conflicts of Interest M.L.-R., I.N.-S., and E.R.-V. are employees of Laboratory Reig Jofre. They belong to the Innovation and Biotechnology department and do not participate in marketing or commercial activities. The data presented were collected under good laboratory practices in general by Reig Jofre Laboratory. The authors declare no conflict of interest. References 1. Vrignaud S. Benoit J.P. Saulnier P. Strategies for the nanoencapsulation of hydrophilic molecules in poly-mer-based nanoparticles Biomaterials 2011 32 8593 8604 10.1016/j.biomaterials.2011.07.057 21831421 2. Lengyel M. Kállai-Szabó N. Antal V. Laki A.J. Antal I. Microparticles, Microspheres, and Microcapsules for Advanced Drug Delivery Sci. Pharm. 2019 87 20 10.3390/scipharm87030020 3. Bale S. Khurana A. Reddy A.S.S. Singh M. Godugu C. Overview on Therapeutic Applications of Micropar-ticulate Drug Delivery Systems Crit. Rev. Ther. Drug Carrier Syst. 2016 33 309 361 10.1615/CritRevTherDrugCarrierSyst.2016015798 27910739 4. Duchi S. Rebollo Torregrosa P. Hajuj A. Molho D. Shkoor R. Saada N.A. Fernández D.G. Goldstein D. Pérez-Fernández A. The formulation and in vitro evaluation of WS Biotin, a novel encapsulated form of D-BIOTIN with improved water solubility for hair and skin treatment applications Int. J. Cosmet. Sci. 2024 46 119 129 10.1111/ics.12914 37779197 5. Waqas B. Wu A. Yim E. Lipner S.R. A survey-based study of physician practices regarding biotin supple-mentation J. Dermatol. Treat. 2022 33 573 574 10.1080/09546634.2020.1770178 32419559 6. Lipner S.R. Rethinking biotin therapy for hair, nail, and skin disorders J. Am. Acad. Dermatol. 2018 78 1236 1238 10.1016/j.jaad.2018.02.018 29438761 7. Karachaliou C.E. Livaniou E. Biotin Homeostasis and Human Disorders: Recent Findings and Perspectives Int. J. Mol. Sci. 2024 25 6578 10.3390/ijms25126578 38928282 PMC11203980 8. Said H.M. Biotin: Biochemical, Physiological and Clinical Aspects Subcellular Biochemistry Springer Berlin/Heidenberg, Germany 2012 1 19 Available online: https://link.springer.com/chapter/10.1007/978-94-007-2199-9_1 (accessed on 25 May 2025) 10.1007/978-94-007-2199-9_1 22116691 9. Thompson K.G. Kim N. Dietary supplements in dermatology: A review of the evidence for zinc, biotin, vita-min D, nicotinamide, and Polypodium J. Am. Acad. Dermatol. 2021 84 1042 1050 10.1016/j.jaad.2020.04.123 32360756 10. León-Del-Río A. Biotin in metabolism, gene expression, and human disease J. Inherit. Metab. Dis. 2019 42 647 654 10.1002/jimd.12073 30746739 11. Polyak B. Geresh S. Marks R.S. Synthesis and Characterization of a Biotin-Alginate Conjugate and Its Appli-cation in a Biosensor Construction Biomacromolecules 2004 5 389 396 10.1021/bm034454a 15002998 12. Eloy J.O. Claro De Souza M. Petrilli R. Barcellos J.P.A. Lee R.J. Marchetti J.M. Liposomes as carriers of hy-drophilic small molecule drugs: Strategies to enhance encapsulation and delivery Colloids Surf. B Biointerfaces 2014 123 345 363 10.1016/j.colsurfb.2014.09.029 25280609 13. Ramazani F. Chen W. van Nostrum C.F. Storm G. Kiessling F. Lammers T. Hennink W.E. Kok R.J. Strat-egies for encapsulation of small hydrophilic and amphiphilic drugs in PLGA microspheres: State-of-the-art and challenges Int. J. Pharm. 2016 499 358 367 10.1016/j.ijpharm.2016.01.020 26795193 14. Sonavane G.S. Devarajan P.V. Preparation of Alginate Nanoparticles Using Eudragit E100 as a Ne: Ingenta Connect J. Biomed. Nanotechnol. 2007 3 160 169 10.1166/jbn.2007.005 15. Yurdasiper A. An Overview of Modified Release Chitosan, Alginate and Eudragit RS Microparticles Available online: https://www.academia.edu/76907537/An_overview_of_modified_release_chitosan_alginate_and_eudragit_RS_microparticles (accessed on 11 June 2025) 16. Paques J.P. Van Der Linden E. Van Rijn C.J.M. Sagis L.M.C. Preparation methods of alginate nanoparticles Adv. Colloid. Interface Sci. 2014 209 163 171 10.1016/j.cis.2014.03.009 24745976 17. Jacob S. Nair A.B. Shah J. Sreeharsha N. Gupta S. Shinu P. Emerging Role of Hydrogels in Drug Delivery Systems, Tissue Engineering and Wound Management Pharmaceutics 2021 13 357 10.3390/pharmaceutics13030357 33800402 PMC7999964 18. Builders P.F. Kunle O.O. Okpaku L.C. Builders M.I. Attama A.A. Adikwu M.U. Preparation and evaluation of mucinated sodium alginate microparticles for oral delivery of insulin Eur. J. Pharm. Biopharm. 2008 70 777 783 10.1016/j.ejpb.2008.06.021 18644444 19. Desai K.G.H. Liu C. Park H.J. Characteristics of vitamin C immobilized particles and sodium alginate beads containing immobilized particles J. Microencapsul. 2005 22 363 376 10.1080/02652040500098861 16214785 20. Łętocha A. Miastkowska M. Sikora E. Preparation and Characteristics of Alginate Microparticles for Food, Pharmaceutical and Cosmetic Applications Polymers 2022 14 3834 10.3390/polym14183834 36145992 PMC9502979 21. EUDRAGIT ® Available online: https://www.evonik.com/en/products/hc/pr_52000110.html (accessed on 11 June 2025) 22. PubChem E100 Available online: https://pubchem.ncbi.nlm.nih.gov/substance/223727344 (accessed on 11 June 2025) 23. Nazzal S. Nutan M. Palamakula A. Shah R. Zaghloul A.A. Khan M.A. Optimization of a self-nanoemulsified tablet dosage form of Ubiquinone using response surface methodology: Effect of formula-tion ingredients Int. J. Pharm. 2002 240 103 114 10.1016/S0378-5173(02)00130-8 12062506 24. Billon A. Bataille B. Cassanas G. Jacob M. Development of spray-dried acetaminophen microparticles using experimental designs Int. J. Pharm. 2000 203 159 168 10.1016/S0378-5173(00)00448-8 10967438 25. Rafat M. Cléroux C.A. Fong W.G. Baker A.N. Leonard B.C. O’Connor M.D. Tsilfidis C. PEG–PLA micro-particles for encapsulation and delivery of Tat-EGFP to retinal cells Biomaterials 2010 31 3414 3421 10.1016/j.biomaterials.2010.01.031 20149443 26. Dounighi M. Bidhendi M. Design and evaluate alginate nanoparticles as a protein delivery system Arch. Razi Inst. 2013 68 139 146 27. Dalmoro A. Sitenkov A.Y. Cascone S. Lamberti G. Barba A.A. Moustafine R.I. Hydrophilic drug encapsula-tion in shell-core microcarriers by two stage polyelectrolyte complexation method Int. J. Pharm. 2017 518 50 58 10.1016/j.ijpharm.2016.12.056 28034735 28. Dalmoro A. Sitenkov A.Y. Lamberti G. Barba A.A. Moustafine R.I. Ultrasonic atomization and polyelectro-lyte complexation to produce gastroresistant shell–core microparticles J. Appl. Polym. Sci. 2016 133 42976 10.1002/app.42976 29. Zhang Y. Huo M. Zhou J. Zou A. Li W. Yao C. Xie S. DDSolver: An Add-In Program for Modeling and Comparison of Drug Dissolution Profiles AAPS J. 2010 12 263 271 10.1208/s12248-010-9185-1 20373062 PMC2895453 30. Papadopoulou V. Kosmidis K. Vlachou M. Macheras P. On the use of the Weibull function for the discern-ment of drug release mechanisms Int. J. Pharm. 2006 309 44 50 10.1016/j.ijpharm.2005.10.044 16376033 31. Martín-Villena M.J. Fernández-Campos F. Calpena-Campmany A.C. Bozal-de Febrer N. Ruiz-Martínez M.A. Clares-Naveros B. Novel microparticulate systems for the vaginal delivery of nystatin: Development and characterization Carbohydr. Polym. 2013 94 1 11 10.1016/j.carbpol.2013.01.005 23544502 32. Supramaniam J. Adnan R. Mohd Kaus N.H. Bushra R. Magnetic nanocellulose alginate hydrogel beads as potential drug delivery system Int. J. Biol. Macromol. 2018 118 640 648 10.1016/j.ijbiomac.2018.06.043 29894784 33. Kim S. Jeong C. Cho S. Kim S.B. Effects of Thermal Treatment on the Physical Properties of Edible Calcium Alginate Gel Beads: Response Surface Methodological Approach Foods 2019 8 578 10.3390/foods8110578 31731744 PMC6915525 34. Hasanzadeh H. Mokhtari-Dizaji M. Zahra Bathaie S. Hassan Z.M. Nilchiani V. Goudarzi H. Enhancement and control of acoustic cavitation yield by low-level dual frequency sonication: A subharmonic analysis Ultrason Sonochem. 2011 18 394 400 10.1016/j.ultsonch.2010.07.005 20678953 35. Feng R. Zhao Y. Zhu C. Mason T.J. Enhancement of ultrasonic cavitation yield by multi-frequency soni-cation Ultrason. Sonochem. 2002 9 231 236 10.1016/S1350-4177(02)00083-4 12371198 36. McNeil S.E. Characterization of Nanoparticles Intended for Drug Delivery Humana Press Totowa, NJ, USA 2011 Volume 697 10.1007/978-1-60327-198-1 37. Obeidat W.M. Nokhodchi A. Alkhatib H. Evaluation of Matrix Tablets Based on Eu-dragit ® ® AAPS PharmSciTech. 2015 16 1169 1179 10.1208/s12249-015-0301-5 25724162 PMC4674641 38. Moustafine R.I. Kemenova V.A. Van den Mooter G. Characteristics of interpolyelectrolyte complexes of Eu-dragit E 100 with sodium alginate Int. J. Pharm. 2005 294 113 120 10.1016/j.ijpharm.2005.01.029 15814235 39. Yurdasiper A. Sevgi F. An overview of modified release chitosan, alginate and eudragit RS microparticles J. Chem. Pharm. Res. 2010 2 704 721 40. Polymers and Drug Delivery Systems|Bentham Science Available online: https://www.eurekaselect.com/article/43851 (accessed on 11 June 2025) 41. Wang M. Shen J. Thomas J.C. Mu T. Liu W. Wang Y. Pan J. Wang Q. Liu K. Particle Size Measurement Using Dynamic Light Scattering at Ultra-Low Concentration Accounting for Particle Number Fluctuations Materials 2021 14 5683 10.3390/ma14195683 34640079 PMC8510349 42. Precise Analysis of Nanoparticle Size Distribution in TEM Image Available online: https://www.mdpi.com/2409-9279/6/4/63 (accessed on 11 June 2025) 43. Souza T.G.F. Ciminelli V.S.T. Mohallem N.D.S. A comparison of TEM and DLS methods to characterize size distribution of ceramic nanoparticles J. Phys. Conf. Ser. 2016 733 012039 10.1088/1742-6596/733/1/012039 44. Saha P. Goyal A.K. Rath G. Formulation and Evaluation of Chitosan-Based Ampicillin Trihydrate Nanoparticles Trop. J. Pharm. Res. 2010 9 483 488 10.4314/tjpr.v9i5.61061 45. Balachandran S. Kentish S.E. Mawson R. Ashokkumar M. Ultrasonic enhancement of the supercritical ex-traction from ginger Ultrason Sonochem. 2006 13 471 479 10.1016/j.ultsonch.2005.11.006 16423551 46. Costa P. Sousa Lobo J.M. Modeling and comparison of dissolution profiles Eur. J. Pharm. Sci. 2001 13 123 133 10.1016/S0928-0987(01)00095-1 11297896 47. Pena-Rodríguez E. Lajarin-Reinares M. Mata-Ventosa A. Pérez-Torras S. Fernández-Campos F. Dexame-thasone-loaded lipomers: Development, characterization, and skin biodistribution studies Pharmaceutics 2021 13 533 10.3390/pharmaceutics13040533 33920403 PMC8068797 48. Kosmidis K. Argyrakis P. Macheras P. Fractal kinetics in drug release from finite fractal matrices J. Chem. Phys. 2003 119 6373 6377 10.1063/1.1603731 49. Draget K.I. Skjåk-Bræk G. Smidsrød O. Alginate based new materials Int. J. Biol. Macromol. 1997 21 47 55 10.1016/S0141-8130(97)00040-8 9283015 50. Braccini I. Pérez S. Molecular Basis of Ca2+ -Induced Gelation in Alginates and Pectins: The Egg-Box Model Revisited Biomacromolecules 2001 2 1089 1096 10.1021/bm010008g 11777378 51. Lankalapalli S. Kolapalli V.R.M. Polyelectrolyte Complexes: A Review of their Applicability in Drug Delivery Technology Indian. J. Pharm. Sci. 2009 71 481 487 10.4103/0250-474X.58165 20502564 PMC2866337 52. Elmowafy M. Samy A. Abdelaziz A.E. Shalaby K. Salama A. Raslan M.A. Abdelgawad M.A. Polymeric nanoparticles based topical gel of poorly soluble drug: Formulation, ex-vivo and in vivo evaluation. Beni-Suef Univ J. Basic. Appl. Sci. 2017 6 184 191 10.1016/j.bjbas.2017.03.004 53. Qiu Y. Park K. Environment-sensitive hydrogels for drug delivery Adv. Drug. Deliv. Rev. 2012 64 49 60 10.1016/j.addr.2012.09.024 11744175 54. Ritger P.L. Peppas N.A. A simple equation for description of solute release I. Fickian and non-fickian release from non-swellable devices in the form of slabs, spheres, cylinders or discs J. Control. Release 1987 5 23 36 10.1016/0168-3659(87)90034-4 25356469 55. Siepmann J. Peppas N.A. Modeling of drug release from delivery systems based on hydroxypropyl methyl-cellulose (HPMC) Adv. Drug Deliv. Rev. 2001 48 139 157 10.1016/S0169-409X(01)00112-0 11369079 56. Pekarek K.J. Jacob J.S. Mathiowitz E. Double-walled polymer microspheres for controlled drug release Nature 1994 367 258 260 10.1038/367258a0 8121490 57. Vasudev S.C. Chandy T. Sharrna C.P. Development of chitosan/polyethylene vinyl acetate co-matrix: Con-trolled release of aspirin-heDarin for preventing cardiovascular thrombosis Biomaterials 1997 18 375 381 10.1016/S0142-9612(96)00131-7 9061177 58. Patil N.S. Dordick J.S. Rethwisch D.G. Macroporous poly(sucrose acrylate) hydrogel for controlled release of macromolecules Biomaterials 1996 17 2343 2350 10.1016/S0142-9612(96)00089-0 8982474 59. Huang X. Brazel C.S. On the importance and mechanisms of burst release in matrix-controlled drug delivery systems J. Control. Release 2001 73 121 136 10.1016/S0168-3659(01)00248-6 11516493 60. Lucinda-Silva R.M. Salgado H.R.N. Evangelista R.C. Alginate–chitosan systems: In vitro controlled release of triamcinolone and in vivo gastrointestinal transit Carbohydr. Polym. 2010 81 260 268 10.1016/j.carbpol.2010.02.016 61. Khairnar S.V. Pagare P. Thakre A. Nambiar A.R. Junnuthula V. Abraham M.C. Kolimi P. Nyavanandi D. Dyawanapelly S. Review on the Scale-Up Methods for the Preparation of Solid Lipid Nanoparticles Pharmaceutics 2022 14 1886 10.3390/pharmaceutics14091886 36145632 PMC9503303 62. Large-Scale Manufacturing of Nanoparticles—An Industrial Outlook—ScienceDirect Available online: https://www.sciencedirect.com/science/article/abs/pii/B978012821222600004X?via%3Dihub (accessed on 11 June 2025) 63. Ranjan A.P. Mukerjee A. Helson L. Vishwanatha J.K. Scale up, optimization and stability analysis of Cur-cumin C3 complex-loaded nanoparticles for cancer therapy J. Nanobiotechnol. 2012 10 38 10.1186/1477-3155-10-38 PMC3497871 22937885 64. Li L. Zhao X. Yang C. Hu H. Qiao M. Chen D. Preparation and optimization of doxoru-bicin-loaded albumin nanoparticles using response surface methodology Drug Dev. Ind. Pharm. 2011 37 1170 1180 10.3109/03639045.2011.563781 21449822 65. Patra C.h.N. Priya R. Swain S. Kumar Jena G. Panigrahi K.C. Ghose D. Pharmaceutical significance of Eudragit: A review Future J. Pharm. Sci. 2017 3 33 45 10.1016/j.fjps.2017.02.001 Figure 1 Chemical structure of d-(+)-biotin. Figure 2 ( A B ® Figure 3 Ionic gelation process with egg-box junction of calcium and alginate. Figure 4 Process flow for scaling up alginate microparticles. The process is divided into two phases: Phase I involves mixing alginate and CaCl 2 ® Figure 5 Schematic illustration of the device for manufacturing alginate microparticles on a large scale. Figure 6 Schematic overview of the complete workflow, from microparticle synthesis to scale-up process. Figure 7 Plots of the main effect of alginate and CaCl 2 Figure 8 Plots of the main effect of alginate and CaCl 2 Figure 9 Plots of the main effect of alginate and Eudragit ® Figure 10 Plots of the main effect of alginate and sonication energy on the particle Z-average (nm). Figure 11 Plots of the main effects of alginate, CaCl 2, Figure 12 Transmission electron microscopy pictures of pta-stained microparticles with uranyl acetate. ( A B C D A C B D Figure 13 Histogram of ( A B Figure 14 Mean release data obtained from the free biotin and biotin-loaded alginate-MPs after 24 h of the in vitro release test. Figure 15 Effect of sonication cycles on the Z-average (nm). Figure 16 Effect of sonication cycles on the PDI. pharmaceutics-17-01117-t001_Table 1 Table 1 Levels studied for Plackett–Burman design. Factor Lower Level Higher Level Alginate (% w w 0.10 0.30 Eudragit ® w w 0.05 0.20 CaCl 2 w w 0.01 0.03 % Sonication amplitude 20 60 Total work energy (Ws) 2000 8000 pharmaceutics-17-01117-t002_Table 2 Table 2 Gradient profile for the HPLC analysis of biotin. Time (min) Mobile Phase A (% v v Mobile Phase B (% v v 0 90 10 20 90 10 25 50 50 40 50 50 45 90 10 50 90 10 pharmaceutics-17-01117-t003_Table 3 Table 3 Different kinetic models and equations were tested. Kinetic Model Equation First-Order   F = 100 · ( 1 − e ( − k 1 t ) ) Higuchi   F = K H ·  t 1 / 2 Korsmeyer–Peppas   F = K K P ·  t n Weibull   F = 100 × ( 1 − e ( − t β / α ) ) F t F max K 1 K H K KP n n n d β β β β β 24 25 pharmaceutics-17-01117-t004_Table 4 Table 4 Levels studied for central composite design of scale-up. Factor Lower Level Higher Level Sonication cycles 6 20 Batch size (L) 0.775 5.725 pharmaceutics-17-01117-t005_Table 5 Table 5 Influence of the excipients’ proportions and fabrication parameters on the physicochemical characteristics of MPs. Batch Alginate (% w w CaCl 2 w w Eudragit ® w w Amplitude (%) Sonication Energy (Ws) Z-Ave (nm) PDI ZP (mV) LP-01 0.3 0.01 0.20 60 8000 1040 0.350 −48.5 LP-02 0.3 0.01 0.20 60 2000 1599 0.419 −43.1 LP-03 0.3 0.03 0.20 20 8000 1950 0.516 −47.1 LP-04 0.3 0.03 0.05 20 2000 3305 0.243 −60.6 LP-05 0.3 0.03 0.05 60 2000 2769 0.039 −56.4 LP-06 0.1 0.01 0.05 20 2000 557.3 0.534 −48.2 LP-07 0.1 0.03 0.20 60 2000 620.3 0.379 −26.2 LP-08 0.1 0.01 0.20 20 2000 1133 0.752 −25.9 LP-09 0.1 0.01 0.05 60 8000 339.7 0.628 −42.7 LP-10 0.3 0.01 0.05 20 8000 1365 0.369 −54.3 LP-11 0.1 0.03 0.05 60 8000 255.1 0.481 −43.6 LP-12 0.1 0.03 0.20 20 8000 664.5 0.237 −26.7 pharmaceutics-17-01117-t006_Table 6 Table 6 Screening model equations for monitoring the effect of the alginate, CaCl 2, ® Quadratic Polynomial Model Equation R 2 Adj R 2 Y 1 1 2 3 0.8405 0.7807 Y 2 1 2 0.5224 0.4163 Y 3 1 4 0.9355 0.9212 X 1 w w 2 w w 2 3 4 w w ® 1 2 3 pharmaceutics-17-01117-t007_Table 7 Table 7 Influence of alginate, CaCl 2, Batch % Alginate ( w w % CaCl 2 w w Total Work Energy (Ws) Z-Ave PDI LP-13 0.20 0.020 9200 759 0.386 LP-14 0.10 0.030 2000 1144 0.488 LP-15 0.20 0.020 5000 928 0.330 LP-16 0.06 0.020 5000 679 0.323 LP-17 0.20 0.020 5000 1408 0.284 LP-18 0.34 0.020 5000 1786 0.422 LP-19 0.30 0.030 2000 1678 0.479 LP-20 0.30 0.010 2000 1780 0.462 LP-21 0.20 0.020 5000 1251 0.351 LP-22 0.10 0.010 2000 770 0.305 LP-23 0.30 0.010 8000 1173 0.306 LP-24 0.20 0.034 5000 900 0.336 LP-25 0.20 0.006 5000 1327 0.293 LP-26 0.20 0.020 5000 1428 0.361 LP-27 0.10 0.030 8000 569 0.255 LP-28 0.20 0.020 5000 1252 0.448 LP-29 0.10 0.010 8000 833 0.240 LP-30 0.30 0.030 8000 2035 0.436 LP-31 0.20 0.020 800 1477 0.537 LP-32 0.20 0.020 5000 1276 0.303 pharmaceutics-17-01117-t008_Table 8 Table 8 Response surface model equation for monitoring the effect of alginate and CaCl 2 Quadratic Polynomial Model Equation R 2 Adj R 2 Y 1 1 3 0.7255 0.6910 Y 2 1 2 3 3 3 0.7196 0.6449 X 1 w w 2 w w 2 3 1 2 pharmaceutics-17-01117-t009_Table 9 Table 9 Prediction of variables for alginate particles with minimum PDI value. Alginate ( w w CaCl 2 w w Sonication PDI Fit Composite 0.10 0.006 6909.09 0.228 1.00 pharmaceutics-17-01117-t010_Table 10 Table 10 Results after characterization of the final formulation with bias with respect to the theoretical value. Property Theoretical Value (95% CI) Placebo Placebo Bias (%) PDI 0.228 (0.103; 0.359) 0.245 0.255 9.65% pharmaceutics-17-01117-t011_Table 11 Table 11 Model selection and parameter estimation of the free biotin and biotin-loaded alginate-MPs. Bold type indicates the selected model, based on the lowest AIC. Formulation Model AIC Parameters Value Free Biotin First-order 71.33   k  ( h − 1 ) 0.1546 Higuchi 69.75   k H  ( % h − 1 / 2 ) 20.38 Korsmeyer–Peppas 69.26   k K P  ( % h − n ) 39.08 n 0.2246  Weibull  55.62  α  3.037   β  1.002 Biotin-loaded Alginate-MPs First-order 71.03   k  ( h − 1 ) 0.1128 Higuchi 65.15   k H  ( % h − 1 / 2 ) 18.18 Korsmeyer–Peppas 66.39   k K P  ( % h − n ) 22.33 n 0.4578  Weibull  57.04  α  3.723   β  0.6248 pharmaceutics-17-01117-t012_Table 12 Table 12 Scale-up production of alginate-MPs results. Batch Sonication Cycles Total Real Work Energy (Ws) Batch Size (L) Z-Ave (nm) PDI LP-61 8 27,857 1.500 538.2 0.599 LP-62 13 84,708 3.250 479.6 0.604 LP-63 13 90,488 3.250 540.4 0.601 LP-64 20 130,340 3.250 446.5 0.577 LP-65 6 41,887 3.250 590.2 0.668 LP-66 13 87,935 3.250 490.7 0.462 LP-67 13 20,801 0.775 648.7 0.581 LP-68 18 55,634 1.500 424.8 0.567 LP-69 13 151,890 5.725 513.8 0.612 LP-70 8 84,592 5.000 650.9 0.586 LP-71 18 195,750 5.000 524.6 0.555 LP-72 13 89,178 3.250 597.7 0.638 LP-73 13 95,669 3.250 597.9 0.627 pharmaceutics-17-01117-t013_Table 13 Table 13 Effect on Z-Ave and PDI before and after adding Eudragit ® Batch Z-Ave (nm) Z-Ave (nm) Ratio PDI PDI Ratio LP-61 1226 538 0.44 0.874 0.599 0.69 LP-62 1242 480 0.39 0.917 0.604 0.60 LP-63 982 540 0.55 0.820 0.601 0.73 LP-64 1055 447 0.42 0.771 0.577 0.75 LP-65 1049 590 0.56 0.941 0.668 0.71 LP-66 1021 491 0.29 0.835 0.462 0.55 LP-67 1112 649 0.58 0.913 0.581 0.64 LP-68 1050 425 0.41 0.856 0.567 0.66 LP-69 706 514 0.72 0.769 0.612 0.80 LP-70 1011 651 0.64 0.913 0.586 0.64 LP-71 824 525 0.64 0.745 0.555 0.75 LP-72 837 598 0.71 0.775 0.638 0.82 LP-73 856 598 0.70 0.808 0.627 0.78  Mean ratio ± SD (%) 54 ± 14% Mean ratio ± SD (%) 70 ± 8% ",
  "metadata": {
    "Title of this paper": "Pharmaceutical significance of Eudragit: A review",
    "Journal it was published in:": "Pharmaceutics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473596/"
  }
}