{
  "title": "Paper_581",
  "abstract": "pmc Cureus Cureus 2757 cureus Cureus 2168-8184 Cureus Inc. PMC12477456 PMC12477456.1 12477456 12477456 41030739 10.7759/cureus.91245 1 Endocrinology/Diabetes/Metabolism Impact of Metabolic Surgery on Obesity Outcomes and Framingham Risk Score in Iranian Diabetic Patients: A Short- and Long-Term Follow-Up Study Muacevic Alexander Adler John R Zaman Ferdos 1 Farhangiyan Zahra 1 Alamdari Maryam 1 Moradi Leila 1 Ashrafi Amir 2  1  2 Maryam Alamdari alamdari91@yahoo.com 29 8 2025 8 2025 17 8 494304 e91245 6 8 2025 29 08 2025 30 09 2025 01 10 2025 Copyright © 2025, Zaman et al. 2025 Zaman et al. https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License CC-BY 4.0., which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. This article is available from https://cureus.com/articles/390848-impact-of-metabolic-surgery-on-obesity-outcomes-and-framingham-risk-score-in-iranian-diabetic-patients-a-short--and-long-term-follow-up-study Type 2 diabetes mellitus (T2DM) and obesity are closely interlinked conditions, contributing significantly to health complications. Metabolic surgery (MS) could help to improve metabolic conditions, including diabetes, hypertension, and hyperlipidemia, which are significant risk factors for cardiovascular disease. This study aimed to evaluate the short-term and long-term effects of MS on obesity outcomes and the Framingham Risk Score (FRS) in Iranian diabetic patients. This multicenter, retrospective study included T2DM patients with body mass index (BMI) ≥ 30 kg/m² who underwent MS in Ahvaz, Iran, from 2019 to 2023. Of the 151 patients, 105 with a follow-up of at least one year were included. Among them, 29 patients (27.6%) had a long-term follow-up (four to five years). Anthropometric and biochemical parameters, comorbidities, and FRS were evaluated at baseline and at one-year and long-term follow-ups. One year postoperatively, there were significant reductions in weight, BMI, systolic and diastolic blood pressure, FRS, triglycerides, low-density lipoprotein (LDL), liver enzymes, fasting blood glucose, and hemoglobin A1c (HbA1c), with an increase in high-density lipoprotein (HDL) levels. The percentage of total weight loss (%TWL) and excess weight loss (%EWL) were 29.13 ± 8.42 and 71.03 ± 20.88, respectively. The median FRS decreased from 11.70 pre-surgery to 4.50 and 6.30 at one-year and long-term follow-ups (P<0.0001). Complete remission of T2DM, hypertension, and hyperlipidemia was achieved in 75.2%, 48.2%, and 35.1% of patients, respectively, and improvements were sustained throughout the follow-up period. The type of MS had no significant impact on changes in weight or BMI (P>0.05). Surgery-related side effects were observed in four cases (3.80%). MS is a safe and effective procedure for reducing obesity-related complications, including T2DM, hypertension, hyperlipidemia, and cardiovascular risk in both the short and long term. These findings highlight the promising potential of MS in managing diabetes. bariatric surgery cardiovascular risk factor diabetes mellitus framingham risk score obesity outcomes pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Obesity is a growing global health concern, affecting 13% of adults worldwide [ 1 2 4 3 5 4 6 Various strategies have been implemented for the long-term management of obesity, including lifestyle modification, dietary changes, pharmacological treatments, and surgical interventions [ 6 7 8 9 10 CVDs remain the leading cause of mortality globally, and obesity is a well-established risk factor for CVD [ 11 12 Materials and methods Study design This retrospective multicenter study was conducted among diabetic patients with a BMI of ≥30 kg/m² who underwent MS at Golestan, Naft, and Mehr Hospitals in Ahvaz, Iran, from 2019 to 2023. The study protocol was approved by the Research Ethics Committee of Golestan Hospital of Ahvaz Jundishapur University of Medical Sciences, Ahvaz, Iran (ethical code: IR.AJUMS.HGOLESTAN.REC.1403.116). This study was conducted in accordance with the guidelines established by the Declaration of Helsinki. Patients The sample size was calculated using G*Power software (Heinrich Heine University Düsseldorf, Düsseldorf, Germany) and the two-tailed test, with a 95% confidence interval (α=0.05), 90% power (β=0.1), and a 0.32 effect size (considering alanine aminotransferase (ALT) changes after MS in diabetic patients in the study by Alamro et al. [ 2 Inclusion Criteria Patients with T2DM according to the ADA guidelines [ 13 2 Exclusion Criteria Patients with active substance use, history of organ transplant, history of cancer, history of severe liver disease with ascites, pregnancy during follow-up, less than one year of follow-up, or incomplete clinical data after surgery were excluded from the study. Of the 151 patients reviewed, 105 who had a follow-up of at least one year were included in this study, and among them, 29 patients (27.6%) had long-term follow-up (four to five years) (Figure 1 Figure 1 Flowchart of the study T2DM: type 2 diabetes mellitus; MS: metabolic surgery Data collection The patients' data were collected retrospectively from the patients' electronic medical records in the hospital database. This information included demographic characteristics, anthropometric measurements, medical history (comorbidities and medications), smoking status, blood pressure (BP), and biochemical parameters. All data were collected at baseline (before MS), one year (short-term follow-up), and four to five years after MS (long-term follow-up). Surgery-related adverse events, including gastrointestinal bleeding, anemia, and mortality, were also assessed and recorded. Laboratory parameters that were assessed included hemoglobin (Hb), mean corpuscular volume (MCV), fasting blood glucose (FBS), hemoglobin A1C (HbA1c), HDL-cholesterol (HDL-C), LDL-cholesterol (LDL-C), triglycerides (TG), total cholesterol (TC), ALT, aspartate aminotransferase (AST), alkaline phosphatase (ALP), and serum vitamin D (25-OH Vitamin D). For all tests, sampling was performed after an eight-hour fast. Hypertension was defined as having a systolic blood pressure (SBP) of ≥140 mmHg, a diastolic blood pressure (DBP) of ≥90 mmHg, or the use of antihypertensive medications [ 14 15 https://reference.medscape.com/calculator/252/framingham-risk-score-2008 Outcome definitions The aim of this study was to determine the weight loss and comorbidity remission following MS. Postoperative weight loss was expressed in terms of percentage of total weight loss (%TWL), percentage of excess weight loss (%EWL), and percentage of BMI loss (%BMIL) [ 16 2 16 The status of comorbidities, including T2DM, hypertension, dyslipidemia, and FRS, was evaluated based on medical history, medications, and laboratory tests during preoperative, one-year, and four- to five-year postoperative visits. This classification was based on standards reported by the American Society for Metabolic and Bariatric Surgery (ASMBS) into four categories: remission (complete resolution of the comorbidity), improvement (partial remission), unchanged, and recurrence (worsening of the condition after remission) [ 16 Statistical analysis Continuous variables were reported as mean ± standard deviation (SD) or median (Q1-Q3), and categorical variables were expressed as number (percentage). The normality of data distribution was assessed using the Kolmogorov-Smirnov test. Independent t-tests (Mann-Whitney U tests) and ANOVA were used to compare quantitative variables, while chi-square tests were applied to compare qualitative variables. Spearman's correlation coefficient was used to assess associations between continuous variables. For intragroup comparisons over time, one-way ANOVA with repeated measures (or the Friedman test) was used. Comparisons between two time points were performed using a paired t-test (or Wilcoxon signed-rank test). McNemar's test was used to evaluate changes in comorbidity status after surgery. In some analyses, patients who underwent RYGB and MGB procedures were combined into one group, labeled as gastric bypass (GB), due to the small number of subjects. All statistical analyses were conducted using IBM SPSS Statistics for Windows, Version 22 (Released 2013; IBM Corp., Armonk, New York), and a P-value < 0.05 was considered statistically significant. Results The study included a total of 105 patients, with a mean age of 40.37 ± 9.40 years (range, 20-65 years) (Table 1 Table 1 Preoperative characteristics of patients Data are shown as mean ± SD for continuous variables and number (%) for categorical variables. MS: metabolic surgery; LSG: laparoscopic sleeve gastrectomy; RYGB: Roux-en-Y gastric bypass; MGB: mini-gastric bypass; BMI: body mass index. Characteristic Values Age (year) 40.37 ± 9.40 Gender Female 77 (73.3) Male 28 (26.7) Active smoker 2 (1.9) Type of MS LSG 52 (49.5) MGB 31 (29.5) RYGB 22 (21.0) Hypertension 56 (53.3) Hyperlipidemia 57 (54.3) Atrial fibrillation 1 (0.95) Coronary artery disease 4 (3.8) Height (cm) 163.99 ± 9.59 Weight (kg) 116.02 ± 17.59 BMI (kg/m 2 42.81 ± 4.15 Medication for diabetes Oral 59 (56.2) Insulin 4 (3.8) Oral + insulin 12 (11.4) No medication 30 (28.6) Mean ± SD weight decreased significantly from 116.02 ± 17.59 kg preoperatively to 82.02 ± 14.81 kg at the one-year follow-up (P<0.0001). Similarly, the mean ± SD BMI decreased from 42.81 ± 4.15 kg/m² preoperatively to 30.27 ± 4.00 kg/m² at the one-year follow-up (P<0.0001) (Figure 2 2 2 Figure 2 Weight and BMI change pre- and postoperatively A: Mean BMI (kg/m 2 B: Mean body weight (kg) at baseline, one year, and four to five years after surgery BMI: body mass index Table 2 Weight and BMI changes over time * P-values ​​were determined by one-way ANOVA with repeated measures or paired t-tests. # Data are shown as mean ± SD. BMI: body mass index; TBWL: total body weight loss; %TWL: percent total weight loss; %EWL: percent excess weight loss; %BMIL: percent BMI loss; N/A: not applicable. Variable Preoperative Postoperative 1 year Postoperative 4-5 years P-value* Weight (kg) 116.02 ± 17.59 82.02 ± 14.81 # 83.97 ± 13.17 # <0.0001 BMI (kg/m 2 42.81 ± 4.15 30.27 ± 4.00 # 31.96 ± 4.41 # <0.0001 TBWL (kg) N/A 34.00 ± 11.55 30.59 ± 9.47 0.345 %TWL N/A 29.13 ± 8.42 26.64 ± 7.28 0.352 %EWL N/A 71.03 ± 20.88 63.92 ± 19.96 0.483 BMI change (kg/m 2 N/A 12.55 ± 4.14 11.48 ± 2.95 0.249 %BMIL N/A 29.11 ± 8.33 26.57 ± 7.21 0.321 At the one-year follow-up, 13 patients (12.38%) achieved their ideal weight. Among the 29 patients with the long follow-up, two patients (6.90%) had achieved their ideal weight. Moreover, in the long-term follow-up after MS, 20 patients (68.97%) maintained their initial weight loss. A significant diﬀerence was found between the preoperative and postoperative values of mean SBP and DBP, FBS, HbA1c, TC, HDL-C, LDL-C, TG, and liver function tests (ALT, AST, ALP) at one-year and four- to five-year follow-ups (Table 3 Table 3 Postoperative changes in cardio-metabolic and biochemical variables * P-values ​​were determined by one-way ANOVA with repeated measures or Friedman's test. # Data are shown as mean ± SD for variables with normal distribution and as median (Q1-Q3) for variables with skewed distribution. SBP: systolic blood pressure; DBP: diastolic blood pressure; FRS: Framingham Risk Score; FBS: fasting blood sugar; HbA1c: hemoglobin A1C; HDL-C: high-density lipoprotein cholesterol; LDL-C: low-density lipoprotein cholesterol; TG: triglyceride; TC: total cholesterol; AST: aspartate aminotransferase; ALT: alanine aminotransferase; ALP: alkaline phosphatase; Hb: hemoglobin; MCV: mean corpuscular volume; 25-OH Vit D: 25-hydroxy vitamin D. Variable Preoperative Postoperative 1 year Postoperative 4-5 years P-value* SBP (mmHg) 127.00 ± 10.50 117.57 ± 7.31 # 118.28 ± 5.87 # <0.0001 DBP (mmHg) 78.48 ± 7.41 75.62 ± 6.15 # 76.90 ± 5.41 <0.0001 FRS (%) 11.70 (6.30–18.50) 4.50 (2.80–7.90) # 6.30 (3.45–9.85) # <0.0001 FBS (mg/dL) 137 (126–169) 96 (91–104) # 100 (92–104) # <0.0001 HbA1C (%) 6.80 (6.30–7.85) 5.30 (5.00–5.60) # 5.40 (5.00–5.50) # <0.0001 HDL-C (mg/dL) 45.16 ± 9.52 52.08 ± 9.36 # 54.97 ± 10.15 # <0.0001 LDL-C (mg/dL) 116.99 ± 36.71 101.26 ± 32.24 # 108.41 ± 34.43 0.024 TG (mg/dL) 163.23 ± 63.02 109.57 ± 36.26 # 114.69 ± 51.24 # <0.0001 TC (mg/dL) 195.63 ± 46.46 176.71 ± 36.73 # 186.62 ± 37.97 0.014 AST (U/L) 24 (18–34) 20 (16.5–25) # 17 (15–25.5) # <0.0001 ALT (IU/L) 27 (19–42.5) 18 (14.5–24.5) # 16 (12.5–26) # <0.0001 ALP (IU/L) 190 (153–218) 182 (150–220) # 198 (162–222.5) <0.0001 Hb (g/dL) 12.96 ± 1.42 12.72 ± 1.38 12.40 ± 1.62 0.233 MCV (fL) 83.0 (79.5–88.0) 85.0 (80.0–87.0) 85.0 (79.0–87.0) 0.611 25-OH Vit D (ng/mL) 28.0 (19.0–32.0) 30 (25.0–40.0) # 25 (20.7–27.0) 0.033 Furthermore, changes in FRS over time were statistically significant (P<0.0001). Pairwise comparisons revealed that postoperative FRS values at both the one-year and four- to five-year follow-ups were significantly lower than preoperative values. However, there was no significant difference between the one-year and four- to five-year follow-up (P=0.218) (Figure 3 3 3 Figure 3 Framingham Risk Score (FRS) change pre- and postoperatively Remission of T2DM was achieved in 79 patients (75.2%), and improvement was seen in 26 patients (24.8%) at the one-year follow-up. In the long-term follow-up, remission was observed in 20 out of 29 patients (69.0%), improvement in six (20.7%), and one patient (3.4%) remained unchanged. Two patients (6.9%) experienced recurrence after complete remission (Table 4 4 Table 4 Status of comorbidities pre- and postoperatively * P-values ​​were determined using McNemar's test. Comorbidities Preoperative n(%) Postoperative 1 year Postoperative 4-5 years P-value* Remission Improvement Unchanged Remission Improvement Unchanged Recurrence Diabetes mellitus 105 (100) 79 (75.2) 26 (24.8) 0 20 (69.0) 6 (20.7) 1 (3.4) 2 (6.9) <0.0001 Hypertension 56 (53.3) 27 (48.2) 26 (47.3) 3 (5.5) 5 (27.8) 13 (72.2) 0 0 <0.0001 Hyperlipidemia 57 (54.3) 20 (35.1) 31 (54.4) 6 (10.5) 4 (28.6) 5 (35.7) 1 (7.1) 4 (28.6) <0.0001 There was no significant difference in the frequency of T2DM and hyperlipidemia between different MS procedures at the one-year (P=0.193 and P=0.449, respectively) and long-term follow-ups (P=0.322 and P=0.085, respectively). However, the frequency of hypertension at one-year (P=0.032) and long-term (P=0.017) follow-up was significantly higher in patients undergoing LSG than in the GB (RYGB+MGB). Moreover, no new cases or worsening preexisting CVD (including myocardial infarction, coronary artery disease, stroke, atrial fibrillation, or heart failure) were observed during the one-year follow-up. Surgery-related adverse events were observed in four patients (3.80%), including three cases of cholecystectomy and one case of diabetic ketoacidosis. The mean weight reduction was significantly greater in men than in women one year after surgery (P=0.017) (Table 5 5 Table 5 Weight changes according to variables * P-values ​​were determined by an independent t-test or ANOVA. Weight changes (kg) are presented as the mean ± standard deviation, compared to preoperative values. LSG: laparoscopic sleeve gastrectomy; MGB: mini-gastric bypass; RYGB: Roux-en-Y gastric bypass. Variable  Weight changes after one year P-value* Weight changes after 4-5 years P-value* Gender Male 38.44 ± 11.09 0.017 34.82 ± 11.11 0.226 Female 32.38 ± 11.35 29.48 ± 8.94 Hypertension No 34.34 ± 11.45 0.780 33.56 ± 9.75 0.282 Yes 33.70 ± 11.73 29.25 ± 9.28 Hyperlipidemia No 35.13 ± 11.77 0.385 30.21 ± 11.13 0.829 Yes 33.04 ± 11.38 30.99 ± 7.70 Metabolic surgery, n(%) LSG 31.69 ± 10.61 0.106 28.17 ± 9.17 0.161 MGB 35.51 ± 10.54 35.70 ± 10.13 RYGB 37.34 ± 14.32 34.00 ± 5.19 No significant correlation was found between changes in weight, BMI, lipid profile, and BP (SBP and DBP) at one-year and long-term follow-up and changes in FBS and HbA1C in one-year follow-up and the patients' age (P>0.05). However, a significant and positive correlation was observed between the FRS changes one year after MS and patients' age (r=0.253, P=0.011), indicating that older patients experienced greater improvements in FRS. Furthermore, long-term changes in FBS and HbA1c after surgery were significantly correlated with the patients' age (r=0.406, P=0.029 and r=0.565, P=0.001, respectively); that is, older patients exhibited greater reductions in these parameters. The mean FRS change one year after MS was greater in men (P=0.001) and in patients with hypertension (P<0.0001) and hyperlipidemia (P=0.033) (Table 6 Table 6 FRS changes according to patient characteristics * P-values ​​were determined by the Mann-Whitney U test. FRS: Framingham Risk Score Variable  FRS changes after one year P-value* Gender Male 10.34 ± 6.05 0.001 Female 6.21 ± 5.61 Hypertension No 4.43 ± 3.27 <0.0001 Yes 9.65 ± 6.68 Hyperlipidemia No 5.92 ± 5.38 0.033 Yes 8.32 ± 6.25 Discussion The results of this study demonstrated that MS in patients with T2DM and BMI ≥ 30 kg/m² resulted in a significant and sustained reduction in weight (both TBWL and EWL) and BMI during the one-year and long-term (four to five years) follow-ups. In the long-term follow-up, 68.97% of patients maintained their primary weight loss, suggesting that MS in diabetic patients without considering underlying diseases results in significant and sustainable weight loss. These results are consistent with previous studies by Alamro et al. [ 2 17 18 19 Our study showed that the mean BMI and weight loss at both short- and long-term follow-ups were not influenced by patients' age or underlying hypertension and hyperlipidemia. However, male patients experienced more pronounced weight loss than females at the one-year follow-up. Furthermore, the mean weight loss was greater with GB (RYGB and MGB) than LSG at one-year follow-up, which is in line with findings from Tabesh et al. [ 20 21 22 23 Despite the increasing use of various metabolic surgical procedures, the underlying mechanisms of their effectiveness have not been fully understood. However, based on our findings, GB resulted in greater weight loss compared with LSG in a short time, which may be attributed to the malabsorption effects of this procedure [ 20 24 One of the main goals of MS is the improvement of obesity-related comorbidities such as T2DM, hypertension, dyslipidemia, and CVDs [ 20 25 2 26 18 5 20 27 13 Evidence suggests that MS may improve glucose control and insulin sensitivity through various mechanisms, including the reduction of ghrelin, increased levels of satiety hormones such as glucagon-like peptide 1 (GLP-1) and peptide YY (PYY), limited intestinal absorption, reduced hepatic gluconeogenesis, and the elimination of glucotoxic effects on pancreatic beta cells [ 8 28 29 Our results demonstrated a significant reduction in both SBP and DBP one year postoperatively compared to preoperative values, and this improvement remained stable during long-term follow-up for SBP. At the one-year follow-up, remission and improvement of hypertension were observed in 48.2% and 47.3% of patients, respectively. Similarly, in the study by Sun et al. [ 30 31 2 32 33 34 Our findings demonstrate that MS significantly reduced TC, LDL-C, and TG levels while increasing HDL-C in diabetic patients over a four- to five-year follow-up period. Furthermore, the remission and improvement rates for hyperlipidemia were 35.1% and 54.4%, respectively, in a one-year follow-up. In agreement with the present study, Jiménez et al. [ 35 2 27 20 36 In our study, the mean FRS at both one-year and long-term (four to five years) follow-up was significantly lower than the preoperative values. Our findings also indicated a significantly greater reduction of the FRS in males and patients with hypertension and hyperlipidemia one year following MS. Additionally, a direct and significant correlation was found between FRS changes and patient age. These results suggest that MS can help reduce the risk of CADs in T2DM, particularly in older patients and those with hypertension and hyperlipidemia, which are all known cardiovascular risk factors. Consistent with these findings, Alamro et al. reported a significant decrease in FRS one year after MS [ 2 37 38 11 12 28 39 In the present study, levels of liver enzymes, including AST, ALT, and ALP, significantly decreased at the one-year follow-up after MS. The changes in AST and ALT remained stable throughout the long-term follow-up. These findings are consistent with studies by Alamro et al. [ 2 40 41 42 In our study, the type of MS had no effect on the remission rate of diabetes and hyperlipidemia at both the one-year and four- to five-year follow-ups. However, the remission rate of hypertension was higher in the GB group compared to the LSG group (one-year follow-up: 62.1% vs. 33.3% and long-term: 74.9% vs. 14.3%). In the study by Khalaj et al., both LSG and RYGB procedures showed similar effects on diabetes remission (52.3% and 63.8%, respectively) but different effects on hypertension remission (39.1% vs. 54.7%, respectively), two years postoperatively [ 25 43 20 In our study, a low rate of surgery-related complications was observed (3.8%) during the follow-up period, and no mortality was reported, indicating that MS is a safe and effective intervention in T2DM patients. This relatively low complication rate is in contrast to the findings of Li et al. [ 32 27 44 6 6 27 32 Collectively, these findings confirm the long-term metabolic and cardiovascular benefits of MS in T2DM patients, with minimal complications and sustained improvement of obesity-related comorbidities. Ultimately, this multicenter follow-up study evaluated various metabolic and obesity outcomes following common MS in T2DM patients. To the best of our knowledge, this is the first comprehensive study for the evaluation of the impact of MS on FRS in diabetic patients in Iran. This study had several limitations. First, the retrospective design prevented access to relevant data, such as specific laboratory tests (albumin, ferritin, and creatinine levels) that were not available for all patients, as well as information on dietary intake and physical activity. Additionally, missing data and incomplete follow-up led to the exclusion of several patients. Second, the findings are based on data from an MS center in Ahvaz, Iran, which may limit the generalizability of the results to other national and international populations. Third, the use of convenience sampling led to uneven subgroup distribution (e.g., by surgery type), which may have introduced bias. Moreover, due to the limited sample size and the retrospective nature of the study, more complex analysis and subgroup exploration were not feasible. Additionally, given the observational nature of this study, there may be potential confounding factors that could have influenced the results. These factors were not controlled for, which is a limitation of the study. Future research should aim to control for confounders using appropriate statistical methods to minimize bias and improve the validity of findings. Therefore, randomized controlled trials and large-scale prospective studies are recommended to achieve more reliable and generalizable results. Future research should also focus on identifying personalized indicators for MS candidacy, rather than relying solely on high BMI and diabetes. Conclusions The findings of this study demonstrate that MS in obese patients with T2DM results in significant and sustained weight loss, improved glycemic control, BP, lipid profile, and liver enzyme levels, as well as the remission and improvement of obesity-related conditions such as T2DM, hypertension, and dyslipidemia. It also results in a reduced cardiovascular risk based on the FRS. These beneficial outcomes persisted during the four- to five-year postoperative follow-up, confirming the long-term efficacy of this intervention in diabetic patients with various levels of obesity (Class I-III). These results highlight the promising role of MS in the management of obesity and its complications in the diabetic population. Disclosures Human subjects: Animal subjects: Conflicts of interest: Payment/services info: Financial relationships: Other relationships: Author Contributions Acquisition, analysis, or interpretation of data: Drafting of the manuscript: Critical review of the manuscript for important intellectual content: Concept and design: Supervision: References 1 World Health Organization. Obesity 6 2025 2021 https://www.who.int/news-room/facts-in-pictures/detail/6-facts-on-obesity 2 Effect of bariatric surgery on metabolic syndrome, Framingham risk scores and thyroid function during one-year follow-up: a Saudi retrospective study Healthcare (Basel) Alamro N Azhri AS Almuqati A 10 2022 10.3390/healthcare10122530 PMC9778226 36554054 3 Association between bariatric surgery and major adverse diabetes outcomes in patients with diabetes and obesity JAMA Netw Open Doumouras AG Lee Y Paterson JM 0 4 2021 10.1001/jamanetworkopen.2021.6820 PMC8076963 33900401 4 Managing obesity in people with type 2 diabetes Clin Med (Lond) Grant B Sandelson M Agyemang-Prempeh B Zalin A 0 31 21 2021 10.7861/clinmed.2021-0370 PMC8313195 35192472 5 Bariatric surgery in the treatment of type 2 diabetes Curr Diab Rep Affinati AH Esfandiari NH Oral EA Kraftson AT 156 19 2019 31802258 10.1007/s11892-019-1269-4 PMC7522929 6 Long term outcomes of metabolic/bariatric surgery in adults BMJ Courcoulas AP Daigle CR Arterburn DE 0 383 2023 10.1136/bmj-2022-071027 38110235 7 Updates in bariatric surgery Am Surg Hsu JL Farrell TM 925 933 90 2024 38060198 10.1177/00031348231220576 8 Glucose metabolism after bariatric surgery: implications for T2DM remission and hypoglycaemia Nat Rev Endocrinol Sandoval DA Patti ME 164 176 19 2023 36289368 10.1038/s41574-022-00757-5 PMC10805109 9 Obesity and weight management for the prevention and treatment of type 2 diabetes: standards of care in diabetes-2025 Diabetes Care American Diabetes Association Professional Practice Committee 0 80 48 2025 10 Therapeutic effects of obesity surgery on glucose control in patients with type 2 diabetes Ann Bariatr Surg Safari S Samadi Afshar A Alemrajabi M Baghai Wadji M Hashemi Madani N 1 8 9 2020 https://annbsurg.iums.ac.ir/browse.php?a_code=A-10-51-1&slc_lang=en&sid=1 11 Cardiovascular risk reduction following metabolic and bariatric surgery Ann Transl Med English WJ Spann MD Aher CV Williams DB 0 8 2020 10.21037/atm.2020.01.88 PMC7154333 32309416 12 Cardiovascular risk reduction over time in patients with diabetes or pre-diabetes undergoing bariatric surgery: data from a single-center retrospective observational study BMC Endocr Disord Rubio-Almanza M Cámara-Gómez R Hervás-Marín D Ponce-Marco JL Merino-Torres JF 90 18 2018 30486823 10.1186/s12902-018-0317-4 PMC6263178 13 Diagnosis and classification of diabetes: standards of care in diabetes-2025 Diabetes Care American Diabetes Association Professional Practice Committee 0 49 48 2025 14 2024 ESC guidelines for the management of elevated blood pressure and hypertension Eur Heart J McEvoy JW McCarthy CP Bruno RM 3912 4018 45 2024 39439212 10.1093/ehjcvp/pvae084 PMC11805683 15 2019 ESC/EAS guidelines for the management of dyslipidaemias: lipid modification to reduce cardiovascular risk Eur Heart J Mach F Baigent C Catapano AL 111 188 41 2020 31504418 10.1093/eurheartj/ehz455 16 Standardized outcomes reporting in metabolic and bariatric surgery Surg Obes Relat Dis Brethauer SA Kim J el Chaar M 489 506 11 2015 26093765 10.1016/j.soard.2015.02.003 17 Type 2 diabetes remission after Roux-en-Y gastric bypass (RYGB), sleeve gastrectomy (SG), and one anastomosis gastric bypass (OAGB): results of the longitudinal assessment of bariatric surgery study BMC Endocr Disord Moradi M Kabir A Khalili D 260 22 2022 36289529 10.1186/s12902-022-01171-8 PMC9598002 18 Metabolic efficacy following laparoscopic sleeve gastrectomy with loop duodenal switch surgery for type 2 diabetes in Indian patients with severe obesity Diabetes Metab Syndr Vennapusa A Bhargav Panchangam R Kesara C Vyshnavi Vanta GR Madivada MS 581 587 15 2021 33706190 10.1016/j.dsx.2021.02.036 19 Comparative efficacy of bariatric surgery in the treatment of morbid obesity and diabetes mellitus: a systematic review and network meta-analysis Obes Surg Park CH Nam SJ Choi HS 2180 2190 29 2019 31037599 10.1007/s11695-019-03831-6 20 The impact of bariatric surgery procedures on the modulation of cardiometabolic risk factors in patients with severe obesity: a 12-month follow-up J Int Med Res Tabesh MR Abolhasani M Zali MR 50 2022 10.1177/03000605221119657 PMC9629577 36314880 21 Long-term efficacy of bariatric surgery for the treatment of super-obesity: comparison of SG Obes Surg Soong TC Lee MH Lee WJ Almalki OM Chen JC Wu CC Chen SC 3391 3399 31 2021 33993423 10.1007/s11695-021-05464-0 22 Effect of laparoscopic sleeve gastrectomy vs laparoscopic Roux-en-Y gastric bypass on weight loss in patients with morbid obesity: the SM-BOSS randomized clinical trial JAMA Peterli R Wölnerhanssen BK Peters T 255 265 319 2018 29340679 10.1001/jama.2017.20897 PMC5833546 23 Effect of laparoscopic sleeve gastrectomy vs laparoscopic Roux-en-Y gastric bypass on weight loss at 5 years among patients with morbid obesity: the SLEEVEPASS randomized clinical trial JAMA Salminen P Helmiö M Ovaska J 241 254 319 2018 29340676 10.1001/jama.2017.20313 PMC5833550 24 Benefits and risks of bariatric surgery in adults: a review JAMA Arterburn DE Telem DA Kushner RF Courcoulas AP 879 887 324 2020 32870301 10.1001/jama.2020.12567 25 Two-year outcomes of sleeve gastrectomy versus gastric bypass: first report based on Tehran obesity treatment study (TOTS) BMC Surg Khalaj A Tasdighi E Hosseinpanah F 160 20 2020 32689986 10.1186/s12893-020-00819-3 PMC7370506 26 Prediction of type 2 diabetes remission after bariatric or metabolic surgery J Obes Metab Syndr Park JY 213 222 27 2018 31089566 10.7570/jomes.2018.27.4.213 PMC6513303 27 A systematic review of one anastomosis/mini gastric bypass as a metabolic operation for patients with body mass index ≤ 35 kg/m2 Obes Surg Parmar CD Zakeri R Mahawar K 725 735 30 2020 31760604 10.1007/s11695-019-04293-6 28 The effect of bariatric surgery on metabolic syndrome: a retrospective cohort study in Colombia Health Sci Rep Domínguez Alvarado GA Otero Rosales MC Cala Duran JC 0 6 2023 10.1002/hsr2.1090 PMC9886857 36733668 29 Alterations in bile acid kinetics after bariatric surgery in patients with obesity with or without type 2 diabetes EBioMedicine Wahlström A Aydin Ö Olsson LM 105265 106 2024 39096744 10.1016/j.ebiom.2024.105265 PMC11345581 30 Achieving blood pressure targets and antihypertensive effects through metabolic surgery in type 2 diabetes patients with hypertension Diabetes Metab Res Rev Sun F Zhou X Li Q 0 37 2021 10.1002/dmrr.3422 33197293 31 Impact of bariatric surgery on cardiovascular risk reduction in Korean obese patients J Metab Bariatr Surg Jeon DJ Kim SH Kim JH Kim YJ 1 7 8 2019 32 Is bariatric surgery effective for Chinese patients with type 2 diabetes mellitus and body mass index < 35 kg/m2? A systematic review and meta-analysis Obes Surg Li Y Gu Y Jin Y Mao Z 4083 4092 31 2021 34244912 10.1007/s11695-021-05520-9 33 Bariatric surgery and hypertension: implications and perspectives after the GATEWAY randomized trial Cardiovasc Diagn Ther Benaiges D Climent E Goday A Flores-Le Roux JA Pedro-Botet J 100 103 9 2019 30881887 10.21037/cdt.2018.10.04 PMC6382659 34 Body mass index is strongly associated with hypertension: results from the longevity check-up 7+ study Nutrients Landi F Calvani R Picca A 10 2018 10.3390/nu10121976 PMC6316192 30551656 35 Changes in lipid profile, body weight variables and cardiovascular risk in obese patients undergoing one-anastomosis gastric bypass Int J Environ Res Public Health Jiménez JM Carbajo MA López M Cao MJ Rúiz-Tovar J García S Castro MJ 17 2020 10.3390/ijerph17165858 PMC7460060 32823485 36 Lipids and bariatric procedures part 1 of 2: scientific statement from the National Lipid Association, American Society for Metabolic and Bariatric Surgery, and Obesity Medicine Association: full report J Clin Lipidol Bays HE Jones PH Jacobson TA 33 57 10 2016 26892120 10.1016/j.jacl.2015.12.002 37 Effects of bariatric surgery in obese patients with hypertension: the GATEWAY randomized trial (gastric bypass to treat obese patients with steady hypertension) Circulation Schiavon CA Bersch-Ferreira AC Santucci EV 1132 1142 137 2018 29133606 10.1161/CIRCULATIONAHA.117.032130 PMC5865494 38 Risk prediction of complications of metabolic syndrome before and 6 years after gastric bypass Surg Obes Relat Dis Aminian A Daigle CR Romero-Talamás H Kashyap SR Kirwan JP Brethauer SA Schauer PR 576 582 10 2014 24837561 10.1016/j.soard.2014.01.025 39 The impact of bariatric surgery on cardiovascular risk factors and outcomes: a systematic review Cureus Srinivasan M Thangaraj SR Arzoun H Thomas SS Mohammed L 0 14 2022 10.7759/cureus.23340 PMC8938230 35371868 40 Bariatric metabolic surgery reduced liver enzyme levels in patients with non-alcohol fatty liver disease Kans J Med Kirkpatrick K Paull-Forney B Okut H Schwasinger-Schmidt T 209 214 14 2021 https://pubmed.ncbi.nlm.nih.gov/34540134/ 34540134 10.17161/kjm.vol1414984 PMC8415383 41 The effect of laparoscopic sleeve gastrectomy on the course of non-alcoholic fatty liver disease in morbidly obese patients during one year of follow up J Clin Med Głuszyńska P Łukaszewicz A Diemieszczyk I 12 2023 10.3390/jcm12124122 PMC10298871 37373815 42 Association between change in serum aminotransferase and mortality: a nationwide cohort study in Korea Medicine (Baltimore) Lee H Shin DW Lee TH 0 95 2016 10.1097/MD.0000000000003158 PMC4998394 27015199 43 Laparoscopic Roux-en-Y gastric bypass versus laparoscopic sleeve gastrectomy: 5-year outcomes of merged data from two randomized clinical trials (SLEEVEPASS and SM-BOSS) Br J Surg Wölnerhanssen BK Peterli R Hurme S 49 57 108 2021 33640917 10.1093/bjs/znaa011 44 Interventions and operations 5 years after bariatric surgery in a cohort from the US national patient-centered clinical research network bariatric study JAMA Surg Courcoulas A Coley RY Clark JM 194 204 155 2020 31940024 10.1001/jamasurg.2019.5470 PMC6990709 ",
  "metadata": {
    "Title of this paper": "Interventions and operations 5 years after bariatric surgery in a cohort from the US national patient-centered clinical research network bariatric study",
    "Journal it was published in:": "Cureus",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477456/"
  }
}