{
  "title": "Paper_1157",
  "abstract": "pmc Biomedicines Biomedicines 3168 biomedicines biomedicines Biomedicines 2227-9059 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12467715 PMC12467715.1 12467715 12467715 41007630 10.3390/biomedicines13092067 biomedicines-13-02067 1 Review Molecular Mechanisms of Iron Metabolism and Overload https://orcid.org/0009-0009-6209-8238 Tayal Aditi 1 2 Kaur Jasmeen 1 2 Sadeghi Payam 1 https://orcid.org/0000-0002-5424-5519 Maitta Robert W. 1 2 * Wallace David R. Academic Editor 1 aditi.tayal@uhhospitals.org jasmeen.kaur@uhhospitals.org payam.sadeghi@uhhospitals.org 2 * robert.maitta@case.edu 25 8 2025 9 2025 13 9 497614 2067 27 5 2025 08 8 2025 23 8 2025 25 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Iron represents an essential element required for normal physiologic processes throughout organ systems. A vast network of transporters is involved not only in uptake of this element but in processing, oxidation, and recycling to maintain it in a tight balance to avoid excess storage. This complex network of transporters, including heme and ferroportin, among many others, are responsible for facilitating inter-organ tissue iron exchange and availability, contributing to overall heme homeostasis. However, exposure to high levels of iron can overwhelm compensatory mechanisms that result in its accumulation and toxicity. This is the case of patients with genetic diseases such as hemoglobinopathies who suffer from chronic anemia and require, in most instances, a lifetime of red blood cell transfusions to overcome disease crises. Thus, in light of the extensive role of iron in the body, the aim of this review is to present important metabolic pathways involved in iron homeostasis across the cardiovascular, reproductive, hematopoietic, urinary, respiratory, endocrine, and central nervous systems while contrasting these against negative effects caused by iron excess. iron metabolism iron excess molecular mechanisms transfusion iron overload metabolism heme ferroportin hepcidin This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Iron metabolism is essential for a wide array of critical cellular and systemic physiological processes. Iron is needed for DNA synthesis, electron and oxygen transport through synthesis of hemoglobin and myoglobin, ATP production, spermatogenesis, and enzymatic reactions needed for the electron transfer chain [ 1 2 3 4 There can be at times exposure to increased iron concentrations resulting from either acute blood loss or from exposure to blood transfusions such as patients who are chronically transfused [ 5 6 7 3 4 A close balance in iron concentration is necessary for proper homeostasis, since iron is toxic when present in excess (overload) and toxicity leads to a variety of human health issues encountered frequently in patient populations exposed to frequent transfusions or among those with a genetic predisposition, such as individuals with hereditary hemochromatosis, sickle cell disease (SCD) and thalassemia [ 5 7 Figure 1 2. Physiologic Absorption of Iron 2.1. Absorption Dietary iron exists in two forms: heme and nonheme [ 8 9 2+ 3+ 10 3+ 2+ 11 12 13 12 Gastric acid in the proximal duodenum reduces Fe 3+ 14 2+ 15 14 2+ SLC40A1 + 3+ 15 16 2 3+ 17 18 Figure 2 2.2. Hepcidin and Other Related Mediators The HAMP 19 20 21 22 23 22 HAMP DMT1 DCYTB 24 25 26 27 28 29 Hepatocyte surface proteins including hereditary hemochromatosis protein (HFE), hemojuvelin (HJV), transferrin receptor (TFR)2, BMP receptors (ALK2, ALK3, BMPR-II), neogenin, and transmembrane protease serine 6 (TMPRSS6), modulate hepcidin expression in response to BMPs and diferric TF [ 30 HFE HJV TFR2 31 32 33 Inflammation and inflammatory cytokines, mainly interleukin (IL)-6, also lead to increased levels of hepcidin [ 34 Figure 3 35 36 The gut microbiome also contributes to regulation of dietary iron absorption and uptake. Intestinal microbes produce metabolites that inhibit iron absorption, thereby ensuring an adequate supply for their own metabolism [ 37 37 2.3. Cellular Nonheme Iron Uptake Erythroid precursors predominantly acquire circulating diferric TF for erythropoiesis through the TF cycle. In this process, diferric TF binds to TFR1 and is internalized via endocytosis [ 38 3+ Figure 3 38 39 40 Cellular iron uptake is regulated by IRPs, which control the translation of key mRNAs, including those for TFR1, DMT1, FPN, and ferritin [ 38 41 38 38 38 2.4. Non Cellular Heme Intracellular Iron Trafficking, Utilization, Storage, and Recycling A substantial portion of cellular iron is directed toward the mitochondria, where it is either stored or utilized for heme and Fe-S cluster synthesis [ 42 3+ Figure 2 38 43 44 45 46 47 Iron that is not used in cellular processes or directed to mitochondria is stored in ferritin. This protein is a hetero-polymer composed of 24 subunits of light and heavy chains, of which the latter has ferroxidase (converts Fe 2+ 3+ 48 3+ 38 49 Pcbp1 50 51 3+ 50 52 Iron mobilization from ferritin is regulated by “ferritinophagy”, a selective autophagy process carried out by auto-phagosomes and driven by NCOA4 ( Figure 3 53 53 54 53 52 52 55 2.4.1. Mitochondria and Fe-S Clusters Fe-S clusters are cofactors necessary for electron transfer through complexes I, II, and III leading to cytochrome c reduction in the mitochondrial respiratory pathway [ 56 56 57 58 59 60 Under iron-deficient/limiting conditions, ACO2 expression decreases, resulting in reduced mitochondrial citrate levels [ 61 57 61 62 63 63 62 2.4.2. Mitochondrial Iron Dysregulation Mitochondria, as sites for Fe-S cluster biosynthesis and energy generation via oxidative phosphorylation, can be affected by iron excess/dysregulation. Excessive mitochondrial iron leads to elevated ROS levels, mitochondrial membrane depolarization, and impairments in ATP production [ 64 64 65 66 67 2.5. Iron Elimination and Export Iron excretion occurs mostly via passive, unregulated pathways, such as the shedding of intestinal and skin epithelial cells, menstruation, and minor/limited epithelial trauma. Recent studies have shed light on additional mechanisms of iron excretion using a TF-deficient mouse model, in which TF treatment promoted gastrointestinal iron excretion, leading to normalization of iron levels [ 68 69 70 FPN (SLC40A1) is critical for exporting iron from cells involved in storage and recycling such as enterocytes and macrophages [ 71 2+ 3+ 72 73 74 75 In addition to systemic regulation by circulating hepcidin, FPN-mediated iron export is also influenced by intracellular and local environmental signals that help fine-tune iron elimination at the cellular level. These hepcidin-independent mechanisms enable cells to respond to their own iron needs and local physiological conditions, allowing for more precise control of iron handling beyond endocrine signaling. In duodenal enterocytes, FPN expression is regulated at both the translational and transcriptional levels [ 71 71 76 In macrophages, especially those involved in iron recycling from senescent erythrocytes, FPN expression is modulated by intracellular signals such as heme and iron levels. During red blood cell (RBC) breakdown, excess heme inactivates the repressor BACH1, allowing the transcription factor NRF2 to bind antioxidant response elements (AREs) and stimulate FPN transcription, facilitating safe iron export [ 77 77 78 79 2.6. Pathways Modulating Hepcidin 2.6.1. Erythropoietin-Responsive Factor Erythroferrone (ERFE) The renal medulla, which under physiologic conditions consumes significant energy, monitors oxygen delivery by monitoring hemoglobin levels, oxygen binding, and oxygen release [ 33 33 80 81 28 82 However, EPO does not directly suppress hepcidin but instead uses an intermediary EPO-responsive factor ERFE to this effect [ 83 84 84 85 TMPRSS6 86 TMPRSS6 −/− 87 TMPRSS6 −/− 87 88 ERFE Pathophysiology—Baseline Erythropoiesis and Stress Erythropoiesis Under normal conditions, the bone marrow constantly produces RBCs to replace senescent cells or damaged ones, with most of their iron content recycled by macrophages in the spleen and liver. When anemia or low oxygen levels occur, renal cells sense the reduced oxygen supply and respond by increasing EPO production through HIF-2 signaling [ 89 90 90 91 ERFE 91 92 92 93 92 ERFE Variants Excessive ERFE levels play an important role in iron-loading anemias. Variations in the ERFE 94 94 95 95 ERFE as a Biomarker in Chronic Kidney Disease Chronic kidney disease (CKD) often leads to anemia due to both lower EPO levels and limited iron availability [ 96 97 98 96 99 Myelodysplastic Syndromes and ERFE Myelodysplastic syndromes (MDS) are blood disorders where immature blood cells fail to develop properly, often dying in the bone marrow. Over time, surviving abnormal cells gain additional mutations and progress toward overt leukemia. A subtype called MDS-RS (with ring sideroblasts) features immature RBCs loaded with excess iron in their mitochondria, preventing them from properly maturing and entering the bloodstream [ 100 SF3B1 100 101 SF3B1 SF3B1 102 SF3B1 102 Beta-Thalassemia and ERFE Animal models of anemias involving ineffective erythropoiesis generally exhibit markedly elevated ERFE levels, because the number of ERFE-producing erythroblasts expands beyond what would be expected given the degree of anemia. For example, the Hbb (th3/+) 103 104 104 105 2.6.2. BMP Signaling via SMAD1/5/8 Transcription Factors The earlier mentioned BMP-SMAD pathway regulates hepcidin, and this modulates iron levels through its binding of FPN, inducing both its internalization and degradation. This process restricts iron absorption from the intestine and limits its release from cellular stores. This signaling pathway orchestrates the transcriptional regulation of the HAMP 106 106 107 107 HAMP 108 108 108 BMP/SMAD signaling pathway is involved in the suppression of hepcidin expression by epidermal growth factor (EGF) [ 109 HAMP 31 106 Smad1 Smad5 Smad8 31 2.6.3. NRF2 Activation Under Iron-Induced Oxidative Stress Under normal conditions, the transcription factor NRF2 is bound to Keap1, a protein that mediates its ubiquitination and proteasomal degradation [ 110 111 111 112 113 113 111 114 114 2.6.4. IL-6 Pathway Inflammatory cytokine IL-6 plays a pivotal role in triggering hepcidin production through the IL-6 receptor (IL-6R)/STAT3 signaling pathway [ 115 116 117 117 116 118 116 117 119 2.6.5. ZIP14 ZIP14, a member of the ZRT/IRT-like protein family, is the primary hepatic transporter for NTBI. Located on the basolateral membrane of hepatocytes, ZIP14 facilitates NTBI uptake during iron overload, aided by its metal-binding residues and structure comprising of eight transmembrane domains [ 120 D 121 122 120 123 122 120 124 125 125 2.6.6. Prion (PrP D PrP D D 126 127 PrP D−/− D 127 D D D D 127 3. Bone Marrow and Heme Iron Heme iron bioavailability is enhanced by the alkaline pH of the small intestine, which prevents polymerization. While nonheme iron uptake mechanisms are well-characterized, heme iron absorption remains less understood but likely involves two potential mechanisms: receptor-mediated endocytosis and membrane transport [ 128 129 130 131 132 SLC46A1 133 Caenorhabditis elegans 134 hrg1 hrg4 135 135 136 137 3.1. Heme Synthesis Heme is an iron-containing tetra-pyrrole that is important in binding oxygen, globin transportation, and detoxification [ 14 138 139 140 141 The synthesis of 5-aminolevulinate (ALA) from succinyl-CoA and glycine, catalyzed by ALA synthase (ALAS), is the first and rate-limiting step of heme biosynthesis occurring in the mitochondrial matrix [ 142 142 143 SLC25A38 144 145 146 147 2+ 147 148 149 3.1.1. Protoporphyrin IX PPIX requires eight molecules of glycine (from plasma) and eight molecules of succinyl-CoA to form the tetrapyrrole macrocycle [ 150 151 SLC25A38 145 151 152 3.1.2. Posttranscriptional Modifications Phosphorylation, lysine acylation, and cysteine glutathionylation are key to regulating metabolic pathways and their disruption can result in disease states [ 153 154 155 156 3.1.3. Dysfunctional Heme Synthesis Unlike iron deficiency anemia, which primarily arises from insufficient iron for heme synthesis, anemia of chronic disease (ACD)/inflammation involves dysfunctional heme synthesis among additional factors [ 157 157 Irg1 158 159 160 161 161 161 162 163 164 3.2. Heme in Erythrocytes In human bone marrow and fetal liver, hematopoietic stem cells sequentially generate burst-forming and colony-forming erythroid progenitors, then proerythroblasts, followed by basophilic, polychromatic, and orthochromatic erythroblasts that give origin to 2.5 billion erythrocytes per second [ 165 166 166 167 167 168 3.3. Systemic Heme Recycling, Transport, Sequestration, Degradation, and Elimination During erythrophagocytosis, HRG1 on phagolysosomal membranes transports heme into the cytosol, where it is catabolized by HO-1 and HO-2 [ 137 137 169 Hrg1 170 Hrg1 Hmox1 170 171 171 172 Vascular hemolysis releases free heme and hemoglobin into the bloodstream where they are predominantly cleared by acute-phase proteins [ 173 174 174 175 176 177 3+ 139 178 179 175 Alpha-1-microglobulin acts as a secondary scavenger, directing heme to the kidneys, which are key sites for hemoglobin and myoglobin clearance [ 180 181 181 181 Hemoparasites like Plasmodium 182 183 183 Hrg1 170 Hrg1 170 FLVCR1, identified as a plasma membrane heme exporter [ 184 185 FLVCR1 186 187 188 189 FLVCR2 190 191 MRP5/ABCC5 has been identified as a heme exporter in C. elegans 192 mrp5 192 193 ABCG2, also known as the breast cancer resistance protein, has been suggested as a cell surface heme exporter [ 194 Abcg2 147 195 195 196 197 198 ABCB7 199 188 4. Central Nervous System (CNS) Iron is indispensable for CNS function, contributing to essential processes such as energy metabolism, axonal myelination, and neurotransmitter synthesis. However, its redox activity poses a dual threat, as uncontrolled iron catalyzes production of toxic free radicals that can lead to oxidative stress and neuronal damage. As a result, a tightly regulated system governs iron homeostasis within the CNS to ensure simultaneous availability and detoxification when in excess. Dysregulation of this system is a central factor in several neurodegenerative diseases. The molecular signaling pathways involved in iron regulation and their dysfunction in pathological conditions provide insights into mechanisms of disease progression and opportunities for therapeutic intervention. 4.1. Normal CNS Mechanisms of Iron Traffic and Homeostasis Iron enters the CNS primarily through the blood-brain barrier (BBB) in either TF-bound or non-TF-bound forms [ 200 3+ 3+ 2+ 2+ Figure 4 201 202 203 204 66 205 4.2. The NRF2/GPX4 Axis in Antioxidant Defense This axis is pivotal in protecting neuronal cells from ferroptosis. NRF2 is sequestered in the cytoplasm under normal conditions by Keap1. During oxidative stress, NRF2 dissociates from Keap1 and enters the nucleus to induce expression of genes such as GPX4 204 206 Figure 4 65 64 204 202 4.3. BMP/SMAD-Mediated Hepcidin Regulation BMP6 secreted by liver sinusoidal endothelial cells binds to receptors on hepatocytes to induce phosphorylation of SMAD 1/5/8 proteins, through formation of complexes with SMAD4 that translocate to the nucleus to upregulate hepcidin expression [ 204 207 66 201 201 205 4.4. Ferritinophagy and Iron Availability Selective autophagic degradation of ferritin, termed ferritinophagy, provides labile iron needed for cellular functions. NCOA4 mediates ferritin trafficking to autophagosomes for degradation, releasing stored iron into the cytoplasm ( Figure 4 202 208 203 203 65 200 4.5. Neuroinflammation and Iron Dysregulation Neuroinflammation provides another layer of CNS iron regulation. Activation of microglia during inflammatory states increases hepcidin secretion and promotes iron sequestration within cells [ 203 208 209 4.6. Role of Iron in CNS Aging and Neurodegenerative Diseases Iron metabolism in the CNS is tightly regulated to support vital processes like myelination, mitochondrial function, and neurotransmitter synthesis while avoiding oxidative stress. With age, iron accumulates in certain brain regions, potentially amplifying inflammation and contributing to neurodegeneration [ 67 67 210 211 212 211 4.7. Mechanisms Underlying Iron-Induced Neurotoxicity Iron’s capacity to transition between Fe 3+ 2+ 213 67 4.8. Iron Accumulation and Possible Therapies Accumulated iron in the CNS does not merely reflect pathology but may also actively propagate it. In Alzheimer’s, iron is sequestered into non-bioavailable forms, impairing mitochondrial processes and neuronal metabolism [ 211 PITRM1 211 Advances in understanding the molecular pathways of iron dysregulation in the CNS have created avenues for targeted therapies. Enhancing NRF2 activity pharmacologically or modulating BMP/SMAD-induced hepcidin expression can recalibrate iron homeostasis and mitigate oxidative stress. Iron chelators such as deferoxamine, can reduce iron overload and prevent lipid peroxidation [ 66 204 213 67 211 213 5. Iron Metabolism in the Cardiovascular System 5.1. Iron Uptake Iron binds to TFR1 and is endocytosed by clathrin in cardiomyocytes [ 214 215 215 216 217 217 218 2+ Figure 4 120 2+ 2+ 219 5.2. Hepcidin–FPN Axis and Iron Export Regulation in Cardiovascular System Hepcidin exerts its action by degrading FPN in macrophages, intestine and liver as discussed earlier [ 220 221 221 221 5.3. BMP/SMAD Pathway in Hepcidin Regulation BMPs mediate a critical role in regulating organogenesis and cardiovascular function [ 222 222 223 224 5.4. Ferroptosis in Cardiomyocytes The involvement of ferroptosis in cardiovascular disease is well established [ 225 226 Figure 4 227 228 229 228 230 231 226 232 5.5. Iron Deficiency and Heart Failure The biomarkers fatty acid binding protein-4, growth differentiation factor-15, NT-proBNP, osteopontin, ST2 protein, tumor necrosis factor receptor-1, and TFR1 are increased in iron deficiency states, whereas paraoxonase-3 and tartrate-resistant acid phosphatase type-5 are downregulated [ 233 233 234 6. Iron Metabolism in Lungs 6.1. Iron Metabolism and TBI Uptake The lung has both extracellular and intracellular iron distribution mechanisms [ 235 236 237 235 6.2. NTBI in Lungs The key NTBI importers are DMT1, ZIP14, ZIP8, and lactoferrin receptors [ 238 238 ZIP8 −/− 239 240 238 241 242 243 244 6.3. Hepcidin–FPN Axis (Iron Export Regulation) in Lungs Hepcidin is expressed in lower concentration in the lungs compared to other organs [ 245 246 HAMP 247 HAMP 247 248 HAMP 247 249 6.4. Ferroptosis in the Lungs Inhaled oxidants or injured pulmonary cells lead to ROS formation. Pulmonary diseases such as acute respiratory distress syndrome are pro-oxidant states with increased body iron stores [ 238 250 250 251 252 253 254 250 Table 1 7. Iron Metabolism in Reproductive System Spermatogenesis is an iron-dependent process [ 255 256 257 7.1. Transferrin and Non-Transferring Bound Iron Extracellular or exogenous iron uptake is mainly mediated by the TF-TFR1 pathway in Sertoli cells [ 258 259 259 2+ 260 261 262 7.2. Hepcidin–FPN Axis (Iron Export Regulation) in Reproductive System Iron is stored as ferritin within cells and utilized during spermatogenesis. It is found in two sites in the testis: mitochondrial (in interstitial Leydig cells and germinal cells in seminiferous tubules) and cytosolic (interstitium) [ 261 261 262 263 7.3. Ferroptosis in Testis Ferroptosis is important during spermatogenesis. Mice lacking GTH-synthetase, final step in the synthesis of GTH, results in males with markedly reduced fertility [ 264 264 8. Endocrine 8.1. Mechanisms of Iron Toxicity Excess iron in endocrine tissues equally promotes oxidative stress and inflammation through ROS formation. This oxidative stress damages cells in the pancreas, pituitary, and thyroid, among other glands. ROS damages the ER, leading to ER stress and activation of the unfolded protein response in endocrine glands [ 265 266 267 266 268 268 269 270 271 272 8.2. Pituitary and Hypothalamus Iron accumulation in the anterior pituitary gland reduces gonadotropic hormone production, causing hypogonadism and delayed puberty in patients with transfusion-dependent thalassemia or hereditary hemochromatosis [ 273 274 275 276 277 278 279 280 276 278 Bone deformities and growth retardation observed in iron-overloaded patients are linked to iron’s interference with GH–insulin-like growth factor-1 (IGF-1) axis [ 281 281 281 282 8.3. Thyroid and Parathyroids In the thyroid, iron excess reduces production of TSH, free thyroxine (T4), and inhibits IGF-1 production by the liver, contributing to growth abnormalities [ 283 284 270 275 285 286 287 288 285 286 289 289 8.4. Pancreas The loss of β-cell function is a critical factor in the development of diabetes in patients with hemoglobinopathies. Excessive iron deposition impairs β-cell function, leading to glucose dysregulation, insulin resistance, and overt diabetes mellitus, often termed “bronze diabetes” [ 290 291 265 265 292 293 294 295 296 297 298 299 297 297 298 HO-1 GPX4 300 HFE C282Y H63D 301 8.5. Gonads and Adrenals ROS activates the p53 pathway causing DNA damage and p53-mediated apoptosis of endocrine cells, particularly in pituitary and testicular tissue [ 302 303 276 281 304 304 305 293 9. Therapeutic Approaches to Improve Iron Excess It is clear from the data presented that approaches that reduce iron deposition are needed to prevent multi-systemic complications associated with iron excess. Iron chelators have been used as first-line agents to reduce iron stores in patients such as those with SCD. The iron chelator deferasirox has been shown to effectively reduce ferritin concentration and overall oxidative stress, including telomere length, in dialysis-dependent patients [ 306 307 308 309 A different approach has sought to use vitamin E’s antioxidant capabilities to address oxidative stress in iron overload. For instance, a randomized trial ( NCT06509581 310 311 NCT02435212 312 313 For patients with iron overload due to hepcidin deficiency, use of peptide mimetics of this protein represents a therapeutic option to improve their iron absorption baseline. Rusfertide is such a mimetic that has been shown to significantly decrease not only iron stores but the number of phlebotomies needed by hemochromatosis patients over the length of treatment duration ( NCT04202965 314 NCT04057040 315 316 316 Another therapeutic target is FPN. In a SCD mouse model, the FPN inhibitor vamifeport reduced hemoglobin concentration, intravascular hemolysis and inflammation thus preventing disease crises [ 317 318 319 320 321 322 322 Without a doubt a new generation of gene therapies holds promise to cure patients with hemoglobinopathies. Products such as lovotibeglogene autotemcel (Lyfgenia) and exagamglogene autotemcel (Casgevy) which have been approved for use by the Food and Drug Administration to treat SCD and transfusion-dependent β-thalassemia (the latter) represent opportunities to free patients from the chains of a life of transfusions and high iron exposure [ 323 10. Conclusions Iron’s requirement for maintaining a large number of cellular functional processes is evident. The generation of transporters that establish links between sites of absorption to those sites where iron is recycled and biosynthetically required exemplifies a complex of multilayer regulatory pathways required to control its intake, utilization, export, storage and recycling. Beginning with mediators that bind it, reduce it, transport it across the cytosol to organelles including the mitochondria, to elimination from the cell, is orchestrated through an intricate and at times redundant set of pathways keeping iron concentration fine-tuned for proper physiology to be maintained. These pathways are tissue-specific and even result in gene expression to better control iron disposition. Thus, iron bioavailability is paramount to the organism and its deleterious effects seen when overwhelming these pathways results in profound pathological changes and extensive tissue damage through processes such as ROS generation. This is why despite current knowledge, additional research to get a comprehensive and better understanding of the negative effects secondary to iron overload is needed. Thankfully, iron chelation has shown to be helpful to minimize iron-associated complications and gene-editing therapies will likely result in quality-of-life improvements for patients requiring chronic transfusions due to hemoglobinopathies. Nevertheless, there ought to be a continuous development of targeted therapies to mitigate or prevent the severe complications associated with iron dysregulation. Acknowledgments The authors want to thank Iryna Maitta for assistance in formatting the manuscript Table. Disclaimer/Publisher’s Note: Author Contributions A.T. performed the literature search and co-wrote the manuscript. J.K. performed the literature search and co-wrote the manuscript. P.S. performed the literature search and co-wrote a section of the manuscript. R.W.M. conceptualized the topic, performed the literature search, co-wrote the manuscript, and edited the text to its final version. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement All data has been included in the text. Conflicts of Interest The authors declare no conflicts of interest. References 1. Grijota F.J. Toro-Roman V. Siquier-Coll J. Robles-Gil M.C. Munoz D. Maynar-Marino M. Total Iron Concentrations in Different Biological Matrices-Influence of Physical Training Nutrients 2022 14 3549 10.3390/nu14173549 36079807 PMC9460040 2. Abbaspour N. Hurrell R. Kelishadi R. Review on iron and its importance for human health J. Res. Med. Sci. 2014 19 164 174 24778671 PMC3999603 3. Mercadante C.J. Prajapati M. Parmar J.H. Conboy H.L. Dash M.E. Pettiglio M.A. Herrera C. Bu J.T. Stopa E.G. Mendes P. Gastrointestinal iron excretion and reversal of iron excess in a mouse model of inherited iron excess Haematologica 2019 104 678 689 10.3324/haematol.2018.198382 30409795 PMC6442972 4. Wallace D.F. The Regulation of Iron Absorption and Homeostasis Clin. Biochem. Rev. 2016 37 51 62 28303071 PMC5198508 5. Zheng Y. Maitta R.W. Alloimmunisation rates of sickle cell disease patients in the United States differ from those in other geographical regions Transfus. Med. 2016 26 225 230 10.1111/tme.12314 27197689 6. Prochazkova P. Skanta F. Roubalova R. Silerova M. Dvorak J. Bilej M. Involvement of the iron regulatory protein from Eisenia andrei earthworms in the regulation of cellular iron homeostasis PLoS ONE 2014 9 e109900 10.1371/journal.pone.0109900 25279857 PMC4184891 7. Ghosh M.C. Zhang D.L. Rouault T.A. Iron misregulation and neurodegenerative disease in mouse models that lack iron regulatory proteins Neurobiol. Dis. 2015 81 66 75 10.1016/j.nbd.2015.02.026 25771171 PMC4567523 8. Coad J. Pedley K. Iron deficiency and iron deficiency anemia in women Scand. J. Clin. Lab. Investig. 2014 244 82 89 82–89; discussion 89 10.3109/00365513.2014.936694 25083899 9. Piskin E. Cianciosi D. Gulec S. Tomas M. Capanoglu E. Iron Absorption: Factors, Limitations, and Improvement Methods ACS Omega 2022 7 20441 20456 10.1021/acsomega.2c01833 35755397 PMC9219084 10. Hinokuma H. Kanamori Y. Ikeda K. Hao L. Maruno M. Yamane T. Maeda A. Nita A. Shimoda M. Niimura M. Distinct functions between ferrous and ferric iron in lung cancer cell growth Cancer Sci. 2023 114 4355 4364 10.1111/cas.15949 37688294 PMC10637068 11. Weinborn V. Pizarro F. Olivares M. Brito A. Arredondo M. Flores S. Valenzuela C. The Effect of Plant Proteins Derived from Cereals and Legumes on Heme Iron Absorption Nutrients 2015 7 8977 8986 10.3390/nu7115446 26529009 PMC4663574 12. Schubert M.L. Physiologic, pathophysiologic, and pharmacologic regulation of gastric acid secretion Curr. Opin. Gastroenterol. 2017 33 430 438 10.1097/MOG.0000000000000392 28787289 13. Sharp P. Srai S.K. Molecular mechanisms involved in intestinal iron absorption World J. Gastroenterol. 2007 13 4716 4724 10.3748/wjg.v13.i35.4716 17729393 PMC4611193 14. Dutt S. Hamza I. Bartnikas T.B. Molecular Mechanisms of Iron and Heme Metabolism Annu. Rev. Nutr. 2022 42 311 335 10.1146/annurev-nutr-062320-112625 35508203 PMC9398995 15. Murata Y. Yoshida M. Sakamoto N. Morimoto S. Watanabe T. Namba K. Iron uptake mediated by the plant-derived chelator nicotianamine in the small intestine J. Biol. Chem. 2021 296 100195 10.1074/jbc.RA120.015861 33334885 PMC7948497 16. Pan Y. Ren Z. Gao S. Shen J. Wang L. Xu Z. Yu Y. Bachina P. Zhang H. Fan X. Structural basis of ion transport and inhibition in ferroportin Nat. Commun. 2020 11 5686 10.1038/s41467-020-19458-6 33173040 PMC7655804 17. Yu Y. Jiang L. Wang H. Shen Z. Cheng Q. Zhang P. Wang J. Wu Q. Fang X. Duan L. Hepatic transferrin plays a role in systemic iron homeostasis and liver ferroptosis Blood 2020 136 726 739 10.1182/blood.2019002907 32374849 PMC7414596 18. Gulec S. Anderson G.J. Collins J.F. Mechanistic and regulatory aspects of intestinal iron absorption Am. J. Physiol.-Gastrointest. Liver Physiol. 2014 307 G397 G409 10.1152/ajpgi.00348.2013 24994858 PMC4137115 19. Gupta R. Musallam K.M. Taher A.T. Rivella S. Ineffective Erythropoiesis: Anemia and Iron Overload Hematol./Oncol. Clin. N. Am. 2018 32 213 221 10.1016/j.hoc.2017.11.009 PMC5824437 29458727 20. Pandey S. Pandey S.K. Shah V. Role of HAMP Genetic Variants on Pathophysiology of Iron Deficiency Anemia Indian J. Clin. Biochem. 2018 33 479 482 10.1007/s12291-017-0707-9 30319197 PMC6170237 21. Billesbolle C.B. Azumaya C.M. Kretsch R.C. Powers A.S. Gonen S. Schneider S. Arvedson T. Dror R.O. Cheng Y. Manglik A. Structure of hepcidin-bound ferroportin reveals iron homeostatic mechanisms Nature 2020 586 807 811 10.1038/s41586-020-2668-z 32814342 PMC7906036 22. De Domenico I. Ward D.M. Kaplan J. Hepcidin and ferroportin: The new players in iron metabolism Semin. Liver Dis. 2011 31 272 279 10.1055/s-0031-1286058 21901657 PMC3706197 23. Traeger L. Wiegand S.B. Sauer A.J. Corman B.H.P. Peneyra K.M. Wunderer F. Fischbach A. Bagchi A. Malhotra R. Zapol W.M. UBA6 and NDFIP1 regulate the degradation of ferroportin Haematologica 2022 107 478 488 10.3324/haematol.2021.278530 34320783 PMC8804582 24. Schwartz A.J. Das N.K. Ramakrishnan S.K. Jain C. Jurkovic M.T. Wu J. Nemeth E. Lakhal-Littleton S. Colacino J.A. Shah Y.M. Hepatic hepcidin/intestinal HIF-2alpha axis maintains iron absorption during iron deficiency and overload J. Clin. Investig. 2019 129 336 348 10.1172/JCI122359 30352047 PMC6307944 25. Colucci S. Marques O. Altamura S. 20 years of Hepcidin: How far we have come Semin. Hematol. 2021 58 132 144 10.1053/j.seminhematol.2021.05.001 34389105 26. Xiao X. Dev S. Canali S. Bayer A. Xu Y. Agarwal A. Wang C.Y. Babitt J.L. Endothelial Bone Morphogenetic Protein 2 (Bmp2) Knockout Exacerbates Hemochromatosis in Homeostatic Iron Regulator (Hfe) Knockout Mice but not Bmp6 Knockout Mice Hepatology 2020 72 642 655 10.1002/hep.31048 31778583 PMC7253321 27. Wang R.H. Li C. Xu X. Zheng Y. Xiao C. Zerfas P. Cooperman S. Eckhaus M. Rouault T. Mishra L. A role of SMAD4 in iron metabolism through the positive regulation of hepcidin expression Cell Metab. 2005 2 399 409 10.1016/j.cmet.2005.10.010 16330325 28. Camaschella C. Pagani A. Nai A. Silvestri L. The mutual control of iron and erythropoiesis Int. J. Lab. Hematol. 2016 38 (Suppl. S1) 20 26 10.1111/ijlh.12505 27161430 29. Camaschella C. Nai A. Ineffective erythropoiesis and regulation of iron status in iron loading anaemias Br. J. Haematol. 2016 172 512 523 10.1111/bjh.13820 26491866 30. Enns C.A. Jue S. Zhang A.S. Hepatocyte neogenin is required for hemojuvelin-mediated hepcidin expression and iron homeostasis in mice Blood 2021 138 486 499 10.1182/blood.2020009485 33824974 PMC8370464 31. Wang C.Y. Xiao X. Bayer A. Xu Y. Dev S. Canali S. Nair A.V. Masia R. Babitt J.L. Ablation of Hepatocyte Smad1, Smad5, and Smad8 Causes Severe Tissue Iron Loading and Liver Fibrosis in Mice Hepatology 2019 70 1986 2002 10.1002/hep.30780 31127639 PMC6874904 32. Lim P.J. Duarte T.L. Arezes J. Garcia-Santos D. Hamdi A. Pasricha S.R. Armitage A.E. Mehta H. Wideman S. Santos A.G. Nrf2 controls iron homeostasis in haemochromatosis and thalassaemia via Bmp6 and hepcidin Nat. Metab. 2019 1 519 531 10.1038/s42255-019-0063-6 31276102 PMC6609153 33. Srole D.N. Ganz T. Erythroferrone structure, function, and physiology: Iron homeostasis and beyond J. Cell. Physiol. 2021 236 4888 4901 10.1002/jcp.30247 33372284 PMC8026552 34. Andrews N.C. Anemia of inflammation: The cytokine-hepcidin link J. Clin. Investig. 2004 113 1251 1253 10.1172/JCI21441 15124013 PMC398435 35. Wrighting D.M. Andrews N.C. Interleukin-6 induces hepcidin expression through STAT3 Blood 2006 108 3204 3209 10.1182/blood-2006-06-027631 16835372 PMC1895528 36. Nicolas G. Bennoun M. Porteu A. Mativet S. Beaumont C. Grandchamp B. Sirito M. Sawadogo M. Kahn A. Vaulont S. Severe iron deficiency anemia in transgenic mice expressing liver hepcidin Proc. Natl. Acad. Sci. USA 2002 99 4596 4601 10.1073/pnas.072632499 11930010 PMC123693 37. Das N.K. Schwartz A.J. Barthel G. Inohara N. Liu Q. Sankar A. Hill D.R. Ma X. Lamberg O. Schnizlein M.K. Microbial Metabolite Signaling Is Required for Systemic Iron Homeostasis Cell Metab. 2020 31 115 130.e6 10.1016/j.cmet.2019.10.005 31708445 PMC6949377 38. Mleczko-Sanecka K. Silvestri L. Cell-type-specific insights into iron regulatory processes Am. J. Hematol. 2021 96 110 127 10.1002/ajh.26001 32945012 39. Montemiglio L.C. Testi C. Ceci P. Falvo E. Pitea M. Savino C. Arcovito A. Peruzzi G. Baiocco P. Mancia F. Cryo-EM structure of the human ferritin-transferrin receptor 1 complex Nat. Commun. 2019 10 1121 10.1038/s41467-019-09098-w 30850661 PMC6408514 40. Zhang Z. Funcke J.B. Zi Z. Zhao S. Straub L.G. Zhu Y. Zhu Q. Crewe C. An Y.A. Chen S. Adipocyte iron levels impinge on a fat-gut crosstalk to regulate intestinal lipid absorption and mediate protection from obesity Cell Metab. 2021 33 1624 1639.e9 10.1016/j.cmet.2021.06.001 34174197 PMC8338877 41. Connell G.J. Abasiri I.M. Chaney E.H. A temporal difference in the stabilization of two mRNAs with a 3′ iron-responsive element during iron deficiency RNA 2023 29 1117 1125 10.1261/rna.079665.123 37160355 PMC10351883 42. Gao J. Zhou Q. Wu D. Chen L. Mitochondrial iron metabolism and its role in diseases Clin. Chim. Acta 2021 513 6 12 10.1016/j.cca.2020.12.005 33309797 43. Das A. Nag S. Mason A.B. Barroso M.M. Endosome-mitochondria interactions are modulated by iron release from transferrin J. Cell Biol. 2016 214 831 845 10.1083/jcb.201602069 27646275 PMC5037410 44. Braymer J.J. Freibert S.A. Rakwalska-Bange M. Lill R. Mechanistic concepts of iron-sulfur protein biogenesis in Biology Biochim. Biophys. Acta (BBA) Mol. Cell Res. 2021 1868 118863 10.1016/j.bbamcr.2020.118863 33007329 45. Crispin A. Guo C. Chen C. Campagna D.R. Schmidt P.J. Lichtenstein D. Cao C. Sendamarai A.K. Hildick-Smith G.J. Huston N.C. Mutations in the iron-sulfur cluster biogenesis protein HSCB cause congenital sideroblastic anemia J. Clin. Investig. 2020 130 5245 5256 10.1172/JCI135479 32634119 PMC7524500 46. Weber R.A. Yen F.S. Nicholson S.P.V. Alwaseem H. Bayraktar E.C. Alam M. Timson R.C. La K. Abu-Remaileh M. Molina H. Maintaining Iron Homeostasis Is the Key Role of Lysosomal Acidity for Cell Proliferation Mol. Cell 2020 77 645 655.e7 10.1016/j.molcel.2020.01.003 31983508 PMC7176020 47. Ast T. Meisel J.D. Patra S. Wang H. Grange R.M.H. Kim S.H. Calvo S.E. Orefice L.L. Nagashima F. Ichinose F. Hypoxia Rescues Frataxin Loss by Restoring Iron Sulfur Cluster Biogenesis Cell 2019 177 1507 1521.e16 10.1016/j.cell.2019.03.045 31031004 PMC6911770 48. Bellelli R. Federico G. Matte A. Colecchia D. Iolascon A. Chiariello M. Santoro M. De Franceschi L. Carlomagno F. NCOA4 Deficiency Impairs Systemic Iron Homeostasis Cell Rep. 2016 14 411 421 10.1016/j.celrep.2015.12.065 26776506 49. Yanatori I. Richardson D.R. Toyokuni S. Kishi F. The new role of poly (rC)-binding proteins as iron transport chaperones: Proteins that could couple with inter-organelle interactions to safely traffic iron Biochim. Biophys. Acta (BBA) Gen. Subj. 2020 1864 129685 10.1016/j.bbagen.2020.129685 32679248 50. Patel S.J. Protchenko O. Shakoury-Elizeh M. Baratz E. Jadhav S. Philpott C.C. The iron chaperone and nucleic acid-binding activities of poly(rC)-binding protein 1 are separable and independently essential Proc. Natl. Acad. Sci. USA 2021 118 e2104666118 10.1073/pnas.2104666118 34161287 PMC8237648 51. Yanatori I. Richardson D.R. Dhekne H.S. Toyokuni S. Kishi F. CD63 is regulated by iron via the IRE-IRP system and is important for ferritin secretion by extracellular vesicles Blood 2021 138 1490 1503 10.1182/blood.2021010995 34265052 PMC8667049 52. Fujimaki M. Furuya N. Saiki S. Amo T. Imamichi Y. Hattori N. Iron Supply via NCOA4-Mediated Ferritin Degradation Maintains Mitochondrial Functions Mol. Cell. Biol. 2019 39 e00010-19 10.1128/MCB.00010-19 31061094 PMC6597882 53. Li X. Lozovatsky L. Sukumaran A. Gonzalez L. Jain A. Liu D. Ayala-Lopez N. Finberg K.E. NCOA4 is regulated by HIF and mediates mobilization of murine hepatic iron stores after blood loss Blood 2020 136 2691 2702 10.1182/blood.2020006321 32659785 PMC7735158 54. Hoelzgen F. Nguyen T.T.P. Klukin E. Boumaiza M. Srivastava A.K. Kim E.Y. Zalk R. Shahar A. Cohen-Schwartz S. Meyron-Holtz E.G. Structural basis for the intracellular regulation of ferritin degradation Nat. Commun. 2024 15 3802 10.1038/s41467-024-48151-1 38714719 PMC11076521 55. Santana-Codina N. Del Rey M.Q. Kapner K.S. Zhang H. Gikandi A. Malcolm C. Poupault C. Kuljanin M. John K.M. Biancur D.E. NCOA4-Mediated Ferritinophagy Is a Pancreatic Cancer Dependency via Maintenance of Iron Bioavailability for Iron-Sulfur Cluster Proteins Cancer Discov. 2022 12 2180 2197 10.1158/2159-8290.CD-22-0043 35771492 PMC9437572 56. Read A.D. Bentley R.E. Archer S.L. Dunham-Snary K.J. Mitochondrial iron-sulfur clusters: Structure, function, and an emerging role in vascular biology Redox Biol. 2021 47 102164 10.1016/j.redox.2021.102164 34656823 PMC8577454 57. Gunawardena N.D. Schrott V. Richardson C. Cole T.N. Corey C.G. Wang Y. Shiva S.S. Bullock G.C. Aconitase: An Iron Sensing Regulator of Mitochondrial Oxidative Metabolism and Erythropoiesis Blood 2016 128 74 10.1182/blood.V128.22.74.74 58. Bresgen N. Eckl P.M. Oxidative stress and the homeodynamics of iron metabolism Biomolecules 2015 5 808 847 10.3390/biom5020808 25970586 PMC4496698 59. Lushchak O.V. Piroddi M. Galli F. Lushchak V.I. Aconitase post-translational modification as a key in linkage between Krebs cycle, iron homeostasis, redox signaling, and metabolism of reactive oxygen species Redox Rep. 2014 19 8 15 10.1179/1351000213Y.0000000073 24266943 PMC6837700 60. Fujii J. Imai H. Oxidative Metabolism as a Cause of Lipid Peroxidation in the Execution of Ferroptosis Int. J. Mol. Sci. 2024 25 7544 10.3390/ijms25147544 39062787 PMC11276677 61. Ross K.L. Eisenstein R.S. Iron deficiency decreases mitochondrial aconitase abundance and citrate concentration without affecting tricarboxylic acid cycle capacity in rat liver J. Nutr. 2002 132 643 651 10.1093/jn/132.4.643 11925455 62. Narahari J. Ma R. Wang M. Walden W.E. The aconitase function of iron regulatory protein 1. Genetic studies in yeast implicate its role in iron-mediated redox regulation J. Biol. Chem. 2000 275 16227 16234 10.1074/jbc.M910450199 10748225 63. Goralska M. Ferrell J. Harned J. Lall M. Nagar S. Fleisher L.N. McGahan M.C. Iron metabolism in the eye: A review Exp. Eye Res. 2009 88 204 215 10.1016/j.exer.2008.10.026 19059397 PMC3746754 64. Tian H.Y. Huang B.Y. Nie H.F. Chen X.Y. Zhou Y. Yang T. Cheng S.W. Mei Z.G. Ge J.W. The Interplay between Mitochondrial Dysfunction and Ferroptosis during Ischemia-Associated Central Nervous System Diseases Brain Sci. 2023 13 1367 10.3390/brainsci13101367 37891735 PMC10605666 65. Chen S. Chen Y. Zhang Y. Kuang X. Liu Y. Guo M. Ma L. Zhang D. Li Q. Iron Metabolism and Ferroptosis in Epilepsy Front. Neurosci. 2020 14 601193 10.3389/fnins.2020.601193 33424539 PMC7793792 66. Cui J. Guo X. Li Q. Song N. Xie J. Hepcidin-to-Ferritin Ratio Is Decreased in Astrocytes With Extracellular Alpha-Synuclein and Iron Exposure Front. Cell. Neurosci. 2020 14 47 10.3389/fncel.2020.00047 32210768 PMC7075942 67. Wimmer I. Scharler C. Kadowaki T. Hillebrand S. Scheiber-Mojdehkar B. Ueda S. Bradl M. Berger T. Lassmann H. Hametner S. Iron accumulation in the choroid plexus, ependymal cells and CNS parenchyma in a rat strain with low-grade haemolysis of fragile macrocytic red blood cells Brain Pathol. 2021 31 333 345 10.1111/bpa.12920 33220123 PMC8018038 68. Koleini N. Shapiro J.S. Geier J. Ardehali H. Ironing out mechanisms of iron homeostasis and disorders of iron deficiency J. Clin. Investig. 2021 131 e148671 10.1172/JCI148671 34060484 PMC8159681 69. Prajapati M. Conboy H.L. Hojyo S. Fukada T. Budnik B. Bartnikas T.B. Biliary excretion of excess iron in mice requires hepatocyte iron import by Slc39a14 J. Biol. Chem. 2021 297 100835 10.1016/j.jbc.2021.100835 34051234 PMC8214222 70. Speich C. Wegmuller R. Brittenham G.M. Zeder C. Cercamondi C.I. Buhl D. Prentice A.M. Zimmermann M.B. Moretti D. Measurement of long-term iron absorption and loss during iron supplementation using a stable isotope of iron ( 57 Br. J. Haematol. 2021 192 179 189 10.1111/bjh.17039 32862453 71. Nemeth E. Ganz T. Hepcidin-Ferroportin Interaction Controls Systemic Iron Homeostasis Int. J. Mol. Sci. 2021 22 6493 10.3390/ijms22126493 34204327 PMC8235187 72. Deshpande C.N. Xin V. Lu Y. Savage T. Anderson G.J. Jormakka M. Large scale expression and purification of secreted mouse hephaestin PLoS ONE 2017 12 e0184366 10.1371/journal.pone.0184366 28880952 PMC5589216 73. Camaschella C. Nai A. Silvestri L. Iron metabolism and iron disorders revisited in the hepcidin era Haematologica 2020 105 260 272 10.3324/haematol.2019.232124 31949017 PMC7012465 74. Pietrangelo A. Hereditary hemochromatosis: Pathogenesis, diagnosis, and treatment Gastroenterology 2010 139 393 408.e2 10.1053/j.gastro.2010.06.013 20542038 75. Langer A.L. Ginzburg Y.Z. Role of hepcidin-ferroportin axis in the pathophysiology, diagnosis, and treatment of anemia of chronic inflammation Hemodial. Int. 2017 21 (Suppl. S1) S37 S46 10.1111/hdi.12543 28328181 PMC7732206 76. Shah Y.M. Xie L. Hypoxia-inducible factors link iron homeostasis and erythropoiesis Gastroenterology 2014 146 630 642 10.1053/j.gastro.2013.12.031 24389303 PMC3943938 77. Namgaladze D. Fuhrmann D.C. Brune B. Interplay of Nrf2 and BACH1 in inducing ferroportin expression and enhancing resistance of human macrophages towards ferroptosis Cell Death Discov. 2022 8 327 10.1038/s41420-022-01117-y 35853860 PMC9296510 78. Abreu R. Quinn F. Giri P.K. Role of the hepcidin-ferroportin axis in pathogen-mediated intracellular iron sequestration in human phagocytic cells Blood Adv. 2018 2 1089 1100 10.1182/bloodadvances.2017015255 29764842 PMC5965048 79. Sangokoya C. Doss J.F. Chi J.T. Iron-responsive miR-485-3p regulates cellular iron homeostasis by targeting ferroportin PLoS Genet. 2013 9 e1003408 10.1371/journal.pgen.1003408 23593016 PMC3616902 80. Rankin E.B. Biju M.P. Liu Q. Unger T.L. Rha J. Johnson R.S. Simon M.C. Keith B. Haase V.H. Hypoxia-inducible factor-2 (HIF-2) regulates hepatic erythropoietin in vivo J. Clin. Investig. 2007 117 1068 1077 10.1172/JCI30117 17404621 PMC1838939 81. Handelman G.J. Levin N.W. Iron and anemia in human biology: A review of mechanisms Heart Fail. Rev. 2008 13 393 404 10.1007/s10741-008-9086-x 18363095 82. Frazer D.M. Inglis H.R. Wilkins S.J. Millard K.N. Steele T.M. McLaren G.D. McKie A.T. Vulpe C.D. Anderson G.J. Delayed hepcidin response explains the lag period in iron absorption following a stimulus to increase erythropoiesis Gut 2004 53 1509 1515 10.1136/gut.2003.037416 15361505 PMC1774251 83. Gammella E. Diaz V. Recalcati S. Buratti P. Samaja M. Dey S. Noguchi C.T. Gassmann M. Cairo G. Erythropoietin’s inhibiting impact on hepcidin expression occurs indirectly Am. J. Physiol. Regul. Integr. Comp. Physiol. 2015 308 R330 R335 10.1152/ajpregu.00410.2014 25519735 PMC4347750 84. Wang C.Y. Xu Y. Traeger L. Dogan D.Y. Xiao X. Steinbicker A.U. Babitt J.L. Erythroferrone lowers hepcidin by sequestering BMP2/6 heterodimer from binding to the BMP type I receptor ALK3 Blood 2020 135 453 456 10.1182/blood.2019002620 31800957 PMC7005366 85. Srole D.N. Jung G. Waring A.J. Nemeth E. Ganz T. Characterization of erythroferrone structural domains relevant to its iron-regulatory function J. Biol. Chem. 2023 299 105374 10.1016/j.jbc.2023.105374 37866631 PMC10692919 86. Ramsay A.J. Hooper J.D. Folgueras A.R. Velasco G. Lopez-Otin C. Matriptase-2 (TMPRSS6): A proteolytic regulator of iron homeostasis Haematologica 2009 94 840 849 10.3324/haematol.2008.001867 19377077 PMC2688576 87. Aschemeyer S. Gabayan V. Ganz T. Nemeth E. Kautz L. Erythroferrone and matriptase-2 independently regulate hepcidin expression Am. J. Hematol. 2017 92 E61 E63 10.1002/ajh.24672 28187515 PMC5389904 88. Arezes J. Foy N. McHugh K. Sawant A. Quinkert D. Terraube V. Brinth A. Tam M. LaVallie E.R. Taylor S. Erythroferrone inhibits the induction of hepcidin by BMP6 Blood 2018 132 1473 1477 10.1182/blood-2018-06-857995 30097509 PMC6238155 89. Haase V.H. Regulation of erythropoiesis by hypoxia-inducible factors Blood Rev. 2013 27 41 53 10.1016/j.blre.2012.12.003 23291219 PMC3731139 90. Hodges V.M. Rainey S. Lappin T.R. Maxwell A.P. Pathophysiology of anemia and erythrocytosis Crit. Rev. Oncol. Hematol. 2007 64 139 158 10.1016/j.critrevonc.2007.06.006 17656101 91. Kautz L. Jung G. Valore E.V. Rivella S. Nemeth E. Ganz T. Identification of erythroferrone as an erythroid regulator of iron metabolism Nat. Genet. 2014 46 678 684 10.1038/ng.2996 24880340 PMC4104984 92. Vento S. Cainelli F. Cesario F. Infections and thalassaemia Lancet Infect. Dis. 2006 6 226 233 10.1016/S1473-3099(06)70437-6 16554247 93. Spinelli S. Straface E. Gambardella L. Caruso D. Dossena S. Marino A. Morabito R. Remigante A. Iron Overload-Related Oxidative Stress Leads to Hyperphosphorylation and Altered Anion Exchanger 1 (Band 3) Function in Erythrocytes from Subjects with beta-Thalassemia Minor Int. J. Mol. Sci. 2025 26 1593 10.3390/ijms26041593 40004059 PMC11855117 94. Andolfo I. Rosato B.E. Marra R. De Rosa G. Manna F. Gambale A. Iolascon A. Russo R. The BMP-SMAD pathway mediates the impaired hepatic iron metabolism associated with the ERFE-A260S variant Am. J. Hematol. 2019 94 1227 1235 10.1002/ajh.25613 31400017 95. Iolascon A. Andolfo I. Russo R. Congenital dyserythropoietic anemias Blood 2020 136 1274 1283 10.1182/blood.2019000948 32702750 96. Hanudel M.R. Rappaport M. Chua K. Gabayan V. Qiao B. Jung G. Salusky I.B. Ganz T. Nemeth E. Levels of the erythropoietin-responsive hormone erythroferrone in mice and humans with chronic kidney disease Haematologica 2018 103 e141 e142 10.3324/haematol.2017.181743 29419424 PMC5865435 97. Levin A. Stevens P.E. Bilous R.W. Coresh J. De Francisco A.L.M. De Jong P.E. Summary of Recommendation Statements Kidney Int. Suppl. 2012 2 283 287 10.1038/kisup.2012.41 PMC4089599 25018947 98. Chapter 1: Diagnosis and evaluation of anemia in CKD Kidney Int. Suppl. 2012 2 288 291 10.1038/kisup.2012.33 PMC4089684 25018948 99. Noonan M.L. Clinkenbeard E.L. Ni P. Swallow E.A. Tippen S.P. Agoro R. Allen M.R. White K.E. Erythropoietin and a hypoxia-inducible factor prolyl hydroxylase inhibitor (HIF-PHDi) lowers FGF23 in a model of chronic kidney disease (CKD) Physiol. Rep. 2020 8 e14434 10.14814/phy2.14434 32476270 PMC7261757 100. Patnaik M.M. Tefferi A. Myelodysplastic syndromes with ring sideroblasts (MDS-RS) and MDS/myeloproliferative neoplasm with RS and thrombocytosis (MDS/MPN-RS-T)—“2021 update on diagnosis, risk-stratification, and management” Am. J. Hematol. 2021 96 379 394 10.1002/ajh.26090 33428785 101. Rozovski U. Keating M. Estrov Z. The significance of spliceosome mutations in chronic lymphocytic leukemia Leuk. Lymphoma 2013 54 1364 1366 10.3109/10428194.2012.742528 23270583 PMC4176818 102. Bondu S. Alary A.S. Lefevre C. Houy A. Jung G. Lefebvre T. Rombaut D. Boussaid I. Bousta A. Guillonneau F. A variant erythroferrone disrupts iron homeostasis in SF3B1-mutated myelodysplastic syndrome Sci. Transl. Med. 2019 11 eaav5467 10.1126/scitranslmed.aav5467 31292266 PMC8005358 103. Frazer D.M. Wilkins S.J. Mirciov C.S. Dunn L.A. Anderson G.J. Hepcidin independent iron recycling in a mouse model of beta-thalassaemia intermedia Br. J. Haematol. 2016 175 308 317 10.1111/bjh.14206 27410488 104. Kautz L. Jung G. Du X. Gabayan V. Chapman J. Nasoff M. Nemeth E. Ganz T. Erythroferrone contributes to hepcidin suppression and iron overload in a mouse model of beta-thalassemia Blood 2015 126 2031 2037 10.1182/blood-2015-07-658419 26276665 PMC4616236 105. Arezes J. Foy N. McHugh K. Quinkert D. Benard S. Sawant A. Frost J.N. Armitage A.E. Pasricha S.R. Lim P.J. Antibodies against the erythroferrone N-terminal domain prevent hepcidin suppression and ameliorate murine thalassemia Blood 2020 135 547 557 10.1182/blood.2019003140 31899794 PMC7046598 106. Xiao X. Alfaro-Magallanes V.M. Babitt J.L. Bone morphogenic proteins in iron homeostasis Bone 2020 138 115495 10.1016/j.bone.2020.115495 32585319 PMC7453787 107. Fillebeen C. Wilkinson N. Charlebois E. Katsarou A. Wagner J. Pantopoulos K. Hepcidin-mediated hypoferremic response to acute inflammation requires a threshold of Bmp6/Hjv/Smad signaling Blood 2018 132 1829 1841 10.1182/blood-2018-03-841197 30213871 108. Gao J. Chen J. Kramer M. Tsukamoto H. Zhang A.S. Enns C.A. Interaction of the hereditary hemochromatosis protein HFE with transferrin receptor 2 is required for transferrin-induced hepcidin expression Cell Metab. 2009 9 217 227 10.1016/j.cmet.2009.01.010 19254567 PMC2673483 109. Goodnough J.B. Ramos E. Nemeth E. Ganz T. Inhibition of hepcidin transcription by growth factors Hepatology 2012 56 291 299 10.1002/hep.25615 22278715 PMC3362690 110. Sajadimajd S. Khazaei M. Oxidative Stress and Cancer: The Role of Nrf2 Curr. Cancer Drug Targets 2018 18 538 557 10.2174/1568009617666171002144228 28969555 111. Zhang L. Zhang J. Jin Y. Yao G. Zhao H. Qiao P. Wu S. Nrf2 Is a Potential Modulator for Orchestrating Iron Homeostasis and Redox Balance in Cancer Cells Front. Cell Dev. Biol. 2021 9 728172 10.3389/fcell.2021.728172 34589492 PMC8473703 112. Kerins M.J. Ooi A. The Roles of NRF2 in Modulating Cellular Iron Homeostasis Antioxid. Redox Signal. 2018 29 1756 1773 10.1089/ars.2017.7176 28793787 PMC6208163 113. Jaramillo M.C. Zhang D.D. The emerging role of the Nrf2-Keap1 signaling pathway in cancer Genes Dev. 2013 27 2179 2191 10.1101/gad.225680.113 24142871 PMC3814639 114. Dodson M. Castro-Portuguez R. Zhang D.D. NRF2 plays a critical role in mitigating lipid peroxidation and ferroptosis Redox Biol. 2019 23 101107 10.1016/j.redox.2019.101107 30692038 PMC6859567 115. Li B. Gong J. Sheng S. Lu M. Guo S. Zhao X. Zhang H. Wang H. Tian Z. Tian Y. Increased hepcidin in hemorrhagic plaques correlates with iron-stimulated IL-6/STAT3 pathway activation in macrophages Biochem. Biophys. Res. Commun. 2019 515 394 400 10.1016/j.bbrc.2019.05.123 31153641 116. Schmidt P.J. Regulation of Iron Metabolism by Hepcidin under Conditions of Inflammation J. Biol. Chem. 2015 290 18975 18983 10.1074/jbc.R115.650150 26055723 PMC4521019 117. Ward R.J. Crichton R.R. Taylor D.L. Della Corte L. Srai S.K. Dexter D.T. Iron and the immune system J. Neural Transm. 2011 118 315 328 10.1007/s00702-010-0479-3 20878427 118. Carballo M. Conde M. El Bekay R. Martin-Nieto J. Camacho M.J. Monteseirin J. Conde J. Bedoya F.J. Sobrino F. Oxidative stress triggers STAT3 tyrosine phosphorylation and nuclear translocation in human lymphocytes J. Biol. Chem. 1999 274 17580 17586 10.1074/jbc.274.25.17580 10364193 119. Yu C. Cao J. Wang L. Yang Y. Ni Y. Wang J. Measuring the bioactivity of anti-IL-6/anti-IL-6R therapeutic antibodies: Presentation of a robust reporter gene assay Anal. Bioanal. Chem. 2018 410 7067 7075 10.1007/s00216-018-1307-0 30178083 120. Knutson M.D. Non-transferrin-bound iron transporters Free Radic. Biol. Med. 2019 133 101 111 10.1016/j.freeradbiomed.2018.10.413 30316781 121. Silva A.M.N. Rangel M. The (Bio)Chemistry of Non-Transferrin-Bound Iron Molecules 2022 27 1784 10.3390/molecules27061784 35335148 PMC8951307 122. Liuzzi J.P. Aydemir F. Nam H. Knutson M.D. Cousins R.J. Zip14 (Slc39a14) mediates non-transferrin-bound iron uptake into cells Proc. Natl. Acad. Sci. USA 2006 103 13612 13617 10.1073/pnas.0606424103 16950869 PMC1564235 123. Pietrangelo A. Physiology of iron transport and the hemochromatosis gene Am. J. Physiol. Gastrointest. Liver Physiol. 2002 282 G403 G414 10.1152/ajpgi.00404.2001 11841990 124. Yanatori I. Kishi F. DMT1 and iron transport Free Radic. Biol. Med. 2019 133 55 63 10.1016/j.freeradbiomed.2018.07.020 30055235 125. Nam H. Wang C.Y. Zhang L. Zhang W. Hojyo S. Fukada T. Knutson M.D. ZIP14 and DMT1 in the liver, pancreas, and heart are differentially regulated by iron deficiency and overload: Implications for tissue iron uptake in iron-related disorders Haematologica 2013 98 1049 1057 10.3324/haematol.2012.072314 23349308 PMC3696608 126. Singh A. Haldar S. Horback K. Tom C. Zhou L. Meyerson H. Singh N. Prion protein regulates iron transport by functioning as a ferrireductase J. Alzheimer’s Dis. 2013 35 541 552 10.3233/JAD-130218 23478311 PMC5450724 127. Tripathi A.K. Haldar S. Qian J. Beserra A. Suda S. Singh A. Hopfer U. Chen S.G. Garrick M.D. Turner J.R. Prion protein functions as a ferrireductase partner for ZIP14 and DMT1 Free Radic. Biol. Med. 2015 84 322 330 10.1016/j.freeradbiomed.2015.03.037 25862412 PMC4476631 128. West A.R. Oates P.S. Mechanisms of heme iron absorption: Current questions and controversies World J. Gastroenterol. 2008 14 4101 4110 10.3748/wjg.14.4101 18636652 PMC2725368 129. Grasbeck R. Kouvonen I. Lundberg M. Tenhunen R. An intestinal receptor for heme Scand. J. Haematol. 1979 23 5 9 10.1111/j.1600-0609.1979.tb02845.x 493872 130. Korolnek T. Hamza I. Like iron in the blood of the people: The requirement for heme trafficking in iron metabolism Front. Pharmacol. 2014 5 126 10.3389/fphar.2014.00126 24926267 PMC4045156 131. Wyllie J.C. Kaufman N. An electron microscopic study of heme uptake by rat duodenum Lab. Investig. J. Tech. Methods Pathol. 1982 47 471 476 7132290 132. Qiu A. Jansen M. Sakaris A. Min S.H. Chattopadhyay S. Tsai E. Sandoval C. Zhao R. Akabas M.H. Goldman I.D. Identification of an intestinal folate transporter and the molecular basis for hereditary folate malabsorption Cell 2006 127 917 928 10.1016/j.cell.2006.09.041 17129779 133. Fillebeen C. Gkouvatsos K. Fragoso G. Calve A. Garcia-Santos D. Buffler M. Becker C. Schumann K. Ponka P. Santos M.M. Mice are poor heme absorbers and do not require intestinal Hmox1 for dietary heme iron assimilation Haematologica 2015 100 e334 e337 10.3324/haematol.2015.126870 25975840 PMC4800685 134. Chen C. Hamza I. Notes from the Underground: Heme Homeostasis in C. elegans Biomolecules 2023 13 1149 10.3390/biom13071149 37509184 PMC10377359 135. Severance S. Rajagopal A. Rao A.U. Cerqueira G.C. Mitreva M. El-Sayed N.M. Krause M. Hamza I. Genome-wide analysis reveals novel genes essential for heme homeostasis in Caenorhabditis elegans PLoS Genet. 2010 6 e1001044 10.1371/journal.pgen.1001044 20686661 PMC2912396 136. Rajagopal A. Rao A.U. Amigo J. Tian M. Upadhyay S.K. Hall C. Uhm S. Mathew M.K. Fleming M.D. Paw B.H. Haem homeostasis is regulated by the conserved and concerted functions of HRG-1 proteins Nature 2008 453 1127 1131 10.1038/nature06934 18418376 PMC4058867 137. White C. Yuan X. Schmidt P.J. Bresciani E. Samuel T.K. Campagna D. Hall C. Bishop K. Calicchio M.L. Lapierre A. HRG1 is essential for heme transport from the phagolysosome of macrophages during erythrophagocytosis Cell Metab. 2013 17 261 270 10.1016/j.cmet.2013.01.005 23395172 PMC3582031 138. Liao R. Bresnick E.H. Heme as a differentiation-regulatory transcriptional cofactor Int. J. Hematol. 2022 116 174 181 10.1007/s12185-022-03404-x 35776402 PMC10170499 139. Duvigneau J.C. Esterbauer H. Kozlov A.V. Role of Heme Oxygenase as a Modulator of Heme-Mediated Pathways Antioxidants 2019 8 475 10.3390/antiox8100475 31614577 PMC6827082 140. Larsen R. Gouveia Z. Soares M.P. Gozzelino R. Heme cytotoxicity and the pathogenesis of immune-mediated inflammatory diseases Front. Pharmacol. 2012 3 77 10.3389/fphar.2012.00077 22586395 PMC3343703 141. Chung J. Chen C. Paw B.H. Heme metabolism and erythropoiesis Curr. Opin. Hematol. 2012 19 156 162 10.1097/MOH.0b013e328351c48b 22406824 PMC4086261 142. Zheng J. Shan Y. Lambrecht R.W. Donohue S.E. Bonkovsky H.L. Differential regulation of human ALAS1 mRNA and protein levels by heme and cobalt protoporphyrin Mol. Cell. Biochem. 2008 319 153 161 10.1007/s11010-008-9888-0 18719978 143. Munakata H. Sun J.Y. Yoshida K. Nakatani T. Honda E. Hayakawa S. Furuyama K. Hayashi N. Role of the heme regulatory motif in the heme-mediated inhibition of mitochondrial import of 5-aminolevulinate synthase J. Biochem. 2004 136 233 238 10.1093/jb/mvh112 15496594 144. Guernsey D.L. Jiang H. Campagna D.R. Evans S.C. Ferguson M. Kellogg M.D. Lachance M. Matsuoka M. Nightingale M. Rideout A. Mutations in mitochondrial carrier family gene SLC25A38 cause nonsyndromic autosomal recessive congenital sideroblastic anemia Nat. Genet. 2009 41 651 653 10.1038/ng.359 19412178 145. Lunetti P. Damiano F. De Benedetto G. Siculella L. Pennetta A. Muto L. Paradies E. Marobbio C.M. Dolce V. Capobianco L. Characterization of Human and Yeast Mitochondrial Glycine Carriers with Implications for Heme Biosynthesis and Anemia J. Biol. Chem. 2016 291 19746 19759 10.1074/jbc.M116.736876 27476175 PMC5025666 146. Liu G. Sil D. Maio N. Tong W.H. Bollinger J.M. Jr. Krebs C. Rouault T.A. Heme biosynthesis depends on previously unrecognized acquisition of iron-sulfur cofactors in human amino-levulinic acid dehydratase Nat. Commun. 2020 11 6310 10.1038/s41467-020-20145-9 33298951 PMC7725820 147. Severance S. Hamza I. Trafficking of heme and porphyrins in metazoa Chem. Rev. 2009 109 4596 4616 10.1021/cr9001116 19764719 PMC2769250 148. Donegan R.K. Moore C.M. Hanna D.A. Reddi A.R. Handling heme: The mechanisms underlying the movement of heme within and between cells Free Radic. Biol. Med. 2019 133 88 100 10.1016/j.freeradbiomed.2018.08.005 30092350 PMC6363905 149. Maio N. Kim K.S. Holmes-Hampton G. Singh A. Rouault T.A. Dimeric ferrochelatase bridges ABCB7 and ABCB10 homodimers in an architecturally defined molecular complex required for heme biosynthesis Haematologica 2019 104 1756 1767 10.3324/haematol.2018.214320 30765471 PMC6717564 150. Medlock A.E. Dailey H.A. New Avenues of Heme Synthesis Regulation Int. J. Mol. Sci. 2022 23 7467 10.3390/ijms23137467 35806474 PMC9267699 151. Fernandez-Murray J.P. Prykhozhij S.V. Dufay J.N. Steele S.L. Gaston D. Nasrallah G.K. Coombs A.J. Liwski R.S. Fernandez C.V. Berman J.N. Glycine and Folate Ameliorate Models of Congenital Sideroblastic Anemia PLoS Genet. 2016 12 e1005783 10.1371/journal.pgen.1005783 26821380 PMC4731144 152. Garcia-Santos D. Schranzhofer M. Bergeron R. Sheftel A.D. Ponka P. Extracellular glycine is necessary for optimal hemoglobinization of erythroid cells Haematologica 2017 102 1314 1323 10.3324/haematol.2016.155671 28495915 PMC5541866 153. Mailloux R.J. Willmore W.G. S-glutathionylation reactions in mitochondrial function and disease Front. Cell Dev. Biol. 2014 2 68 10.3389/fcell.2014.00068 25453035 PMC4233936 154. Newman J.C. He W. Verdin E. Mitochondrial protein acylation and intermediary metabolism: Regulation by sirtuins and implications for metabolic disease J. Biol. Chem. 2012 287 42436 42443 10.1074/jbc.R112.404863 23086951 PMC3522244 155. Rardin M.J. He W. Nishida Y. Newman J.C. Carrico C. Danielson S.R. Guo A. Gut P. Sahu A.K. Li B. SIRT5 regulates the mitochondrial lysine succinylome and metabolic networks Cell Metab. 2013 18 920 933 10.1016/j.cmet.2013.11.013 24315375 PMC4105152 156. McDonagh B. Pedrajas J.R. Padilla C.A. Barcena J.A. Thiol redox sensitivity of two key enzymes of heme biosynthesis and pentose phosphate pathways: Uroporphyrinogen decarboxylase and transketolase Oxid. Med. Cell. Longev. 2013 2013 932472 10.1155/2013/932472 23970950 PMC3730168 157. Davis S.L. Littlewood T.J. The investigation and treatment of secondary anaemia Blood Rev. 2012 26 65 71 10.1016/j.blre.2011.10.003 22133555 158. Lampropoulou V. Sergushichev A. Bambouskova M. Nair S. Vincent E.E. Loginicheva E. Cervantes-Barragan L. Ma X. Huang S.C. Griss T. Itaconate Links Inhibition of Succinate Dehydrogenase with Macrophage Metabolic Remodeling and Regulation of Inflammation Cell Metab. 2016 24 158 166 10.1016/j.cmet.2016.06.004 27374498 PMC5108454 159. Michelucci A. Cordes T. Ghelfi J. Pailot A. Reiling N. Goldmann O. Binz T. Wegner A. Tallam A. Rausell A. Immune-responsive gene 1 protein links metabolism to immunity by catalyzing itaconic acid production Proc. Natl. Acad. Sci. USA 2013 110 7820 7825 10.1073/pnas.1218599110 23610393 PMC3651434 160. Nemeth B. Doczi J. Csete D. Kacso G. Ravasz D. Adams D. Kiss G. Nagy A.M. Horvath G. Tretter L. Abolition of mitochondrial substrate-level phosphorylation by itaconic acid produced by LPS-induced Irg1 expression in cells of murine macrophage lineage FASEB J. 2016 30 286 300 10.1096/fj.15-279398 26358042 161. Marcero J.R. Cox J.E. Bergonia H.A. Medlock A.E. Phillips J.D. Dailey H.A. The immunometabolite itaconate inhibits heme synthesis and remodels cellular metabolism in erythroid precursors Blood Adv. 2021 5 4831 4841 10.1182/bloodadvances.2021004750 34492704 PMC9153040 162. Nemeth E. Valore E.V. Territo M. Schiller G. Lichtenstein A. Ganz T. Hepcidin, a putative mediator of anemia of inflammation, is a type II acute-phase protein Blood 2003 101 2461 2463 10.1182/blood-2002-10-3235 12433676 163. Kafina M.D. Paw B.H. Intracellular iron and heme trafficking and metabolism in developing erythroblasts Metallomics 2017 9 1193 1203 10.1039/C7MT00103G 28795723 PMC5607108 164. Rondelli C.M. Perfetto M. Danoff A. Bergonia H. Gillis S. O’Neill L. Jackson L. Nicolas G. Puy H. West R. The ubiquitous mitochondrial protein unfoldase CLPX regulates erythroid heme synthesis by control of iron utilization and heme synthesis enzyme activation and turnover J. Biol. Chem. 2021 297 100972 10.1016/j.jbc.2021.100972 34280433 PMC8361296 165. Muckenthaler M.U. Rivella S. Hentze M.W. Galy B. A Red Carpet for Iron Metabolism Cell 2017 168 344 361 10.1016/j.cell.2016.12.034 28129536 PMC5706455 166. Manwani D. Bieker J.J. The Erythroblastic Island Red Cell Development Bieker J.J. Elsevier Inc. Amsterdam, The Netherlands 2008 Volume 82 23 53 10.1016/S0070-2153(07)00002-6 PMC3234703 18282516 167. Chen J.J. Zhang S. Heme-regulated eIF2alpha kinase in erythropoiesis and hemoglobinopathies Blood 2019 134 1697 1707 10.1182/blood.2019001915 31554636 PMC6856985 168. Liang R. Menon V. Qiu J. Arif T. Renuse S. Lin M. Nowak R. Hartmann B. Tzavaras N. Benson D.L. Mitochondrial localization and moderated activity are key to murine erythroid enucleation Blood Adv. 2021 5 2490 2504 10.1182/bloodadvances.2021004259 34032849 PMC8152511 169. Pradhan P. Vijayan V. Gueler F. Immenschuh S. Interplay of Heme with Macrophages in Homeostasis and Inflammation Int. J. Mol. Sci. 2020 21 740 10.3390/ijms21030740 31979309 PMC7036926 170. Pek R.H. Yuan X. Rietzschel N. Zhang J. Jackson L. Nishibori E. Ribeiro A. Simmons W. Jagadeesh J. Sugimoto H. Hemozoin produced by mammals confers heme tolerance eLife 2019 8 e49503 10.7554/eLife.49503 31571584 PMC6773446 171. Ma S. Dubin A.E. Zhang Y. Mousavi S.A.R. Wang Y. Coombs A.M. Loud M. Andolfo I. Patapoutian A. A role of PIEZO1 in iron metabolism in mice and humans Cell 2021 184 969 982.e13 10.1016/j.cell.2021.01.024 33571427 PMC7927959 172. Andolfo I. Rosato B.E. Manna F. De Rosa G. Marra R. Gambale A. Girelli D. Russo R. Iolascon A. Gain-of-function mutations in PIEZO1 directly impair hepatic iron metabolism via the inhibition of the BMP/SMADs pathway Am. J. Hematol. 2020 95 188 197 10.1002/ajh.25683 31737919 173. Smith A. McCulloh R.J. Hemopexin and haptoglobin: Allies against heme toxicity from hemoglobin not contenders Front. Physiol. 2015 6 187 10.3389/fphys.2015.00187 26175690 PMC4485156 174. Chiabrando D. Vinchi F. Fiorito V. Mercurio S. Tolosano E. Heme in pathophysiology: A matter of scavenging, metabolism and trafficking across cell membranes Front. Pharmacol. 2014 5 61 10.3389/fphar.2014.00061 24782769 PMC3986552 175. Ashouri R. Fangman M. Burris A. Ezenwa M.O. Wilkie D.J. Dore S. Critical Role of Hemopexin Mediated Cytoprotection in the Pathophysiology of Sickle Cell Disease Int. J. Mol. Sci. 2021 22 6408 10.3390/ijms22126408 34203861 PMC8232622 176. Consoli V. Sorrenti V. Grosso S. Vanella L. Heme Oxygenase-1 Signaling and Redox Homeostasis in Physiopathological Conditions Biomolecules 2021 11 589 10.3390/biom11040589 33923744 PMC8072688 177. McMahon M. Ding S. Acosta-Jimenez L.P. Frangova T.G. Henderson C.J. Wolf C.R. Measuring in vivo responses to endogenous and exogenous oxidative stress using a novel haem oxygenase 1 reporter mouse J. Physiol. 2018 596 105 127 10.1113/JP274915 29086419 PMC5746521 178. Medina M.V. Sapochnik D. Garcia Sola M. Coso O. Regulation of the Expression of Heme Oxygenase-1: Signal Transduction, Gene Promoter Activation, and Beyond Antioxid. Redox Signal 2020 32 1033 1044 10.1089/ars.2019.7991 31861960 PMC7153632 179. Yachie A. Heme Oxygenase-1 Deficiency and Oxidative Stress: A Review of 9 Independent Human Cases and Animal Models Int. J. Mol. Sci. 2021 22 1514 10.3390/ijms22041514 33546372 PMC7913498 180. Balla J. Zarjou A. Heme Burden and Ensuing Mechanisms That Protect the Kidney: Insights from Bench and Bedside Int. J. Mol. Sci. 2021 22 8174 10.3390/ijms22158174 34360940 PMC8347331 181. Gburek J. Verroust P.J. Willnow T.E. Fyfe J.C. Nowacki W. Jacobsen C. Moestrup S.K. Christensen E.I. Megalin and cubilin are endocytic receptors involved in renal clearance of hemoglobin J. Am. Soc. Nephrol. 2002 13 423 430 10.1681/ASN.V132423 11805171 182. Coronado L.M. Nadovich C.T. Spadafora C. Malarial hemozoin: From target to tool Biochim. Biophys. Acta (BBA) Gen. Subj. 2014 1840 2032 2041 10.1016/j.bbagen.2014.02.009 PMC4049529 24556123 183. Matz J.M. Drepper B. Blum T.B. van Genderen E. Burrell A. Martin P. Stach T. Collinson L.M. Abrahams J.P. Matuschewski K. A lipocalin mediates unidirectional heme biomineralization in malaria parasites Proc. Natl. Acad. Sci. USA 2020 117 16546 16556 10.1073/pnas.2001153117 32601225 PMC7368307 184. Khan A.A. Quigley J.G. Heme and FLVCR-related transporter families SLC48 and SLC49 Mol. Aspects Med. 2013 34 669 682 10.1016/j.mam.2012.07.013 23506900 PMC3602793 185. Quigley J.G. Yang Z. Worthington M.T. Phillips J.D. Sabo K.M. Sabath D.E. Berg C.L. Sassa S. Wood B.L. Abkowitz J.L. Identification of a human heme exporter that is essential for erythropoiesis Cell 2004 118 757 766 10.1016/j.cell.2004.08.014 15369674 186. Philip M. Funkhouser S.A. Chiu E.Y. Phelps S.R. Delrow J.J. Cox J. Fink P.J. Abkowitz J.L. Heme exporter FLVCR is required for T cell development and peripheral survival J. Immunol. 2015 194 1677 1685 10.4049/jimmunol.1402172 25582857 PMC4323866 187. Chiabrando D. Marro S. Mercurio S. Giorgi C. Petrillo S. Vinchi F. Fiorito V. Fagoonee S. Camporeale A. Turco E. The mitochondrial heme exporter FLVCR1b mediates erythroid differentiation J. Clin. Investig. 2012 122 4569 4579 10.1172/JCI62422 23187127 PMC3533534 188. Swenson S.A. Moore C.M. Marcero J.R. Medlock A.E. Reddi A.R. Khalimonchuk O. From Synthesis to Utilization: The Ins and Outs of Mitochondrial Heme Cells 2020 9 579 10.3390/cells9030579 32121449 PMC7140478 189. Kalailingam P. Wang K.Q. Toh X.R. Nguyen T.Q. Chandrakanthan M. Hasan Z. Habib C. Schif A. Radio F.C. Dallapiccola B. Deficiency of MFSD7c results in microcephaly-associated vasculopathy in Fowler syndrome J. Clin. Investig. 2020 130 4081 4093 10.1172/JCI136727 32369449 PMC7410059 190. Li Y. Ivica N.A. Dong T. Papageorgiou D.P. He Y. Brown D.R. Kleyman M. Hu G. Chen W.W. Sullivan L.B. MFSD7C switches mitochondrial ATP synthesis to thermogenesis in response to heme Nat. Commun. 2020 11 4837 10.1038/s41467-020-18607-1 32973183 PMC7515921 191. Yuan X. Protchenko O. Philpott C.C. Hamza I. Topologically conserved residues direct heme transport in HRG-1-related proteins J. Biol. Chem. 2012 287 4914 4924 10.1074/jbc.M111.326785 22174408 PMC3281596 192. Korolnek T. Zhang J. Beardsley S. Scheffer G.L. Hamza I. Control of metazoan heme homeostasis by a conserved multidrug resistance protein Cell Metab. 2014 19 1008 1019 10.1016/j.cmet.2014.03.030 24836561 PMC4052561 193. Chambers I.G. Kumar P. Lichtenberg J. Wang P. Yu J. Phillips J.D. Kane M.A. Bodine D. Hamza I. MRP5 and MRP9 play a concerted role in male reproduction and mitochondrial function Proc. Natl. Acad. Sci. USA 2022 119 e2111617119 10.1073/pnas.2111617119 35121660 PMC8832985 194. Jonker J.W. Buitelaar M. Wagenaar E. Van Der Valk M.A. Scheffer G.L. Scheper R.J. Plosch T. Kuipers F. Elferink R.P. Rosing H. The breast cancer resistance protein protects against a major chlorophyll-derived dietary phototoxin and protoporphyria Proc. Natl. Acad. Sci. USA 2002 99 15649 15654 10.1073/pnas.202607599 12429862 PMC137771 195. Chambers I.G. Willoughby M.M. Hamza I. Reddi A.R. One ring to bring them all and in the darkness bind them: The trafficking of heme without deliverers Biochim. Biophys. Acta (BBA) Mol. Cell Res. 2021 1868 118881 10.1016/j.bbamcr.2020.118881 PMC7756907 33022276 196. Bryk A.H. Wisniewski J.R. Quantitative Analysis of Human Red Blood Cell Proteome J. Proteome Res. 2017 16 2752 2761 10.1021/acs.jproteome.7b00025 28689405 197. Krishnamurthy P.C. Du G. Fukuda Y. Sun D. Sampath J. Mercer K.E. Wang J. Sosa-Pineda B. Murti K.G. Schuetz J.D. Identification of a mammalian mitochondrial porphyrin transporter Nature 2006 443 586 589 10.1038/nature05125 17006453 198. Song G. Zhang S. Tian M. Zhang L. Guo R. Zhuo W. Yang M. Molecular insights into the human ABCB6 transporter Cell Discov. 2021 7 55 10.1038/s41421-021-00284-z 34312373 PMC8313675 199. Lill R. Kispal G. Mitochondrial ABC transporters Res. Microbiol. 2001 152 331 340 10.1016/S0923-2508(01)01204-9 11421280 200. Grubic Kezele T. Curko-Cofek B. Age-Related Changes and Sex-Related Differences in Brain Iron Metabolism Nutrients 2020 12 2601 10.3390/nu12092601 32867052 PMC7551829 201. Zierfuss B. Wang Z. Jackson A.N. Moezzi D. Yong V.W. Iron in multiple sclerosis—Neuropathology, immunology, and real-world considerations Mult. Scler. Relat. Disord. 2023 78 104934 10.1016/j.msard.2023.104934 37579645 202. Qin D. Li D. Wang C. Guo S. Ferroptosis and central nervous system demyelinating diseases J. Neurochem. 2023 165 759 771 10.1111/jnc.15831 37095635 203. Garringer H.J. Irimia J.M. Li W. Goodwin C.B. Richine B. Acton A. Chan R.J. Peacock M. Muhoberac B.B. Ghetti B. Effect of Systemic Iron Overload and a Chelation Therapy in a Mouse Model of the Neurodegenerative Disease Hereditary Ferritinopathy PLoS ONE 2016 11 e0161341 10.1371/journal.pone.0161341 27574973 PMC5004847 204. Li Y. Sun M. Cao F. Chen Y. Zhang L. Li H. Cao J. Song J. Ma Y. Mi W. The Ferroptosis Inhibitor Liproxstatin-1 Ameliorates LPS-Induced Cognitive Impairment in Mice Nutrients 2022 14 4599 10.3390/nu14214599 36364859 PMC9656387 205. Hu X. Xu Y. Xu H. Jin C. Zhang H. Su H. Li Y. Zhou K. Ni W. Progress in Understanding Ferroptosis and Its Targeting for Therapeutic Benefits in Traumatic Brain and Spinal Cord Injuries Front. Cell Dev. Biol. 2021 9 705786 10.3389/fcell.2021.705786 34422826 PMC8371332 206. Wu T. Liang X. Liu X. Li Y. Wang Y. Kong L. Tang M. Induction of ferroptosis in response to graphene quantum dots through mitochondrial oxidative stress in microglia Part. Fibre Toxicol. 2020 17 30 10.1186/s12989-020-00363-1 32652997 PMC7353734 207. Bardestani A. Ebrahimpour S. Esmaeili A. Esmaeili A. Quercetin attenuates neurotoxicity induced by iron oxide nanoparticles J. Nanobiotechnol. 2021 19 327 10.1186/s12951-021-01059-0 PMC8522232 34663344 208. Huang S. Li S. Feng H. Chen Y. Iron Metabolism Disorders for Cognitive Dysfunction After Mild Traumatic Brain Injury Front. Neurosci. 2021 15 587197 10.3389/fnins.2021.587197 33796002 PMC8007909 209. Slone J.D. Yang L. Peng Y. Queme L.F. Harris B. Rizzo S.J.S. Green T. Ryan J.L. Jankowski M.P. Reinholdt L.G. Integrated analysis of the molecular pathogenesis of FDXR-associated disease Cell Death Dis. 2020 11 423 10.1038/s41419-020-2637-3 32499495 PMC7272433 210. Lee S. Lucas S. Proudman D. Nellesen D. Paulose J. Sheehan V.A. Burden of central nervous system complications in sickle cell disease: A systematic review and meta-analysis Pediatr. Blood Cancer 2022 69 e29493 10.1002/pbc.29493 35038214 211. LeVine S.M. Tsau S. Gunewardena S. Exploring Whether Iron Sequestration within the CNS of Patients with Alzheimer’s Disease Causes a Functional Iron Deficiency That Advances Neurodegeneration Brain Sci. 2023 13 511 10.3390/brainsci13030511 36979320 PMC10046656 212. Porras C.A. Rouault T.A. Iron Homeostasis in the CNS: An Overview of the Pathological Consequences of Iron Metabolism Disruption Int. J. Mol. Sci. 2022 23 4490 10.3390/ijms23094490 35562883 PMC9104368 213. Chen P. Totten M. Zhang Z. Bucinca H. Erikson K. Santamaria A. Bowman A.B. Aschner M. Iron and manganese-related CNS toxicity: Mechanisms, diagnosis and treatment Expert Rev. Neurother. 2019 19 243 260 10.1080/14737175.2019.1581608 30759034 PMC6422746 214. Fang X. Ardehali H. Min J. Wang F. The molecular and metabolic landscape of iron and ferroptosis in cardiovascular disease Nat. Rev. Cardiol. 2023 20 7 23 10.1038/s41569-022-00735-4 35788564 PMC9252571 215. Kozlowska B. Sochanowicz B. Kraj L. Palusinska M. Kolsut P. Szymanski L. Lewicki S. Kruszewski M. Zaleska-Kociecka M. Leszek P. Clinical and Molecular Aspects of Iron Metabolism in Failing Myocytes Life 2022 12 1203 10.3390/life12081203 36013382 PMC9409945 216. Xu W. Barrientos T. Mao L. Rockman H.A. Sauve A.A. Andrews N.C. Lethal Cardiomyopathy in Mice Lacking Transferrin Receptor in the Heart Cell Rep. 2015 13 533 545 10.1016/j.celrep.2015.09.023 26456827 PMC4618069 217. Noetzli L.J. Papudesi J. Coates T.D. Wood J.C. Pancreatic iron loading predicts cardiac iron loading in thalassemia major Blood 2009 114 4021 4026 10.1182/blood-2009-06-225615 19726718 PMC2774543 218. Liu Q. Azucenas C. Mackenzie B. Knutson M. Metal-Ion Transporter SLC39A14 Is Required for Cardiac Iron Loading in the Hjv Mouse Model of Iron Overload Blood 2021 138 758 10.1182/blood-2021-154296 219. Oudit G.Y. Trivieri M.G. Khaper N. Liu P.P. Backx P.H. Role of L-type Ca2+ channels in iron transport and iron-overload cardiomyopathy J. Mol. Med. 2006 84 349 364 10.1007/s00109-005-0029-x 16604332 PMC7095819 220. Grammer T.B. Scharnagl H. Dressel A. Kleber M.E. Silbernagel G. Pilz S. Tomaschitz A. Koenig W. Mueller-Myhsok B. Marz W. Iron Metabolism, Hepcidin, and Mortality (the Ludwigshafen Risk and Cardiovascular Health Study) Clin. Chem. 2019 65 849 861 10.1373/clinchem.2018.297242 30917972 221. Sawicki K.T. De Jesus A. Ardehali H. Iron Metabolism in Cardiovascular Disease: Physiology, Mechanisms, and Therapeutic Targets Circ. Res. 2023 132 379 396 10.1161/CIRCRESAHA.122.321667 36730380 PMC9907000 222. Morrell N.W. Bloch D.B. ten Dijke P. Goumans M.J. Hata A. Smith J. Yu P.B. Bloch K.D. Targeting BMP signalling in cardiovascular disease and anaemia Nat. Rev. Cardiol. 2016 13 106 120 10.1038/nrcardio.2015.156 26461965 PMC4886232 223. Wang L. Trebicka E. Fu Y. Ellenbogen S. Hong C.C. Babitt J.L. Lin H.Y. Cherayil B.J. The bone morphogenetic protein-hepcidin axis as a therapeutic target in inflammatory bowel disease Inflamm. Bowel Dis. 2012 18 112 119 10.1002/ibd.21675 21351217 PMC3139830 224. Saeed O. Otsuka F. Polavarapu R. Karmali V. Weiss D. Davis T. Rostad B. Pachura K. Adams L. Elliott J. Pharmacological suppression of hepcidin increases macrophage cholesterol efflux and reduces foam cell formation and atherosclerosis Arterioscler. Thromb. Vasc. Biol. 2012 32 299 307 10.1161/ATVBAHA.111.240101 22095982 PMC3262074 225. Chen Z. Yan Y. Qi C. Liu J. Li L. Wang J. The Role of Ferroptosis in Cardiovascular Disease and Its Therapeutic Significance Front. Cardiovasc. Med. 2021 8 733229 10.3389/fcvm.2021.733229 34765653 PMC8576275 226. Wu X. Li Y. Zhang S. Zhou X. Ferroptosis as a novel therapeutic target for cardiovascular disease Theranostics 2021 11 3052 3059 10.7150/thno.54113 33537073 PMC7847684 227. Gao X. Hu W. Qian D. Bai X. He H. Li L. Sun S. The Mechanisms of Ferroptosis Under Hypoxia Cell Mol. Neurobiol. 2023 43 3329 3341 10.1007/s10571-023-01388-8 37458878 PMC10477166 228. Fang X. Cai Z. Wang H. Han D. Cheng Q. Zhang P. Gao F. Yu Y. Song Z. Wu Q. Loss of Cardiac Ferritin H Facilitates Cardiomyopathy via Slc7a11-Mediated Ferroptosis Circ. Res. 2020 127 486 501 10.1161/CIRCRESAHA.120.316509 32349646 229. Gozzelino R. Soares M.P. Coupling heme and iron metabolism via ferritin H chain Antioxid. Redox Signal 2014 20 1754 1769 10.1089/ars.2013.5666 24124891 PMC3961798 230. Koppula P. Zhang Y. Zhuang L. Gan B. Amino acid transporter SLC7A11/xCT at the crossroads of regulating redox homeostasis and nutrient dependency of cancer Cancer Commun. 2018 38 12 10.1186/s40880-018-0288-x 29764521 PMC5993148 231. Liu G. Xie X. Liao W. Chen S. Zhong R. Qin J. He P. Xie J. Ferroptosis in cardiovascular disease Biomed. Pharmacother. 2024 170 116057 10.1016/j.biopha.2023.116057 38159373 232. Xiao Z. Kong B. Fang J. Qin T. Dai C. Shuai W. Huang H. Ferrostatin-1 alleviates lipopolysaccharide-induced cardiac dysfunction Bioengineered 2021 12 9367 9376 10.1080/21655979.2021.2001913 34787054 PMC8809987 233. van der Wal H.H. Grote Beverborg N. Dickstein K. Anker S.D. Lang C.C. Ng L.L. van Veldhuisen D.J. Voors A.A. van der Meer P. Iron deficiency in worsening heart failure is associated with reduced estimated protein intake, fluid retention, inflammation, and antiplatelet use Eur. Heart J. 2019 40 3616 3625 10.1093/eurheartj/ehz680 31556953 PMC6868426 234. Wang Y. Yang J. Yang L. Zheng L. Association between dietary intake of iron and heart failure among American adults: Data from NHANES 2009–2018 BMC Nutr. 2024 10 148 10.1186/s40795-024-00957-4 39529173 PMC11552417 235. Kim J. Wessling-Resnick M. The Role of Iron Metabolism in Lung Inflammation and Injury J. Allergy Ther. 2012 3 004 10.4172/2155-6121.S4-004 29226014 PMC5718378 236. Heilig E.A. Thompson K.J. Molina R.M. Ivanov A.R. Brain J.D. Wessling-Resnick M. Manganese and iron transport across pulmonary epithelium Am. J. Physiol.-Lung Cell. Mol. Physiol. 2006 290 L1247 L1259 10.1152/ajplung.00450.2005 16428268 237. Zhang V. Nemeth E. Kim A. Iron in Lung Pathology Pharmaceuticals 2019 12 30 10.3390/ph12010030 30781366 PMC6469192 238. Cloonan S.M. Mumby S. Adcock I.M. Choi A.M.K. Chung K.F. Quinlan G.J. The “Iron”-y of Iron Overload and Iron Deficiency in Chronic Obstructive Pulmonary Disease Am. J. Respir. Crit. Care Med. 2017 196 1103 1112 10.1164/rccm.201702-0311PP 28410559 PMC5694836 239. Zhang V. Jenkitkasemwong S. Liu Q. Ganz T. Nemeth E. Knutson M.D. Kim A. A mouse model characterizes the roles of ZIP8 in systemic iron recycling and lung inflammation and infection Blood Adv. 2023 7 1336 1349 10.1182/bloodadvances.2022007867 36260707 PMC10119600 240. Ghio A.J. Carter J.D. Richards J.H. Richer L.D. Grissom C.K. Elstad M.R. Iron and iron-related proteins in the lower respiratory tract of patients with acute respiratory distress syndrome Crit. Care Med. 2003 31 395 400 10.1097/01.CCM.0000050284.35609.97 12576942 241. Cao X. Ren Y. Lu Q. Wang K. Wu Y. Wang Y. Zhang Y. Cui X.S. Yang Z. Chen Z. Lactoferrin: A glycoprotein that plays an active role in human health Front. Nutr. 2022 9 1018336 10.3389/fnut.2022.1018336 36712548 PMC9875800 242. Rosa L. Cutone A. Lepanto M.S. Paesano R. Valenti P. Lactoferrin: A Natural Glycoprotein Involved in Iron and Inflammatory Homeostasis Int. J. Mol. Sci. 2017 18 1985 10.3390/ijms18091985 28914813 PMC5618634 243. Ghio A.J. Stonehuerner J.G. Richards J.H. Crissman K.M. Roggli V.L. Piantadosi C.A. Carraway M.S. Iron homeostasis and oxidative stress in idiopathic pulmonary alveolar proteinosis: A case-control study Respir. Res. 2008 9 10 10.1186/1465-9921-9-10 18215276 PMC2265287 244. Mateos F. Gonzalez C. Dominguez C. Losa J.E. Jimenez A. Perez-Arellano J.L. Elevated non-transferrin bound iron in the lungs of patients with Pneumocystis carinii pneumonia J. Infect. 1999 38 18 21 10.1016/S0163-4453(99)90022-1 10090500 245. Zumerle S. Mathieu J.R. Delga S. Heinis M. Viatte L. Vaulont S. Peyssonnaux C. Targeted disruption of hepcidin in the liver recapitulates the hemochromatotic phenotype Blood 2014 123 3646 3650 10.1182/blood-2014-01-550467 24646470 246. Deschemin J.C. Mathieu J.R.R. Zumerle S. Peyssonnaux C. Vaulont S. Pulmonary Iron Homeostasis in Hepcidin Knockout Mice Front. Physiol. 2017 8 804 10.3389/fphys.2017.00804 29089902 PMC5650979 247. Nguyen N.B. Callaghan K.D. Ghio A.J. Haile D.J. Yang F. Hepcidin expression and iron transport in alveolar macrophages Am. J. Physiol. Lung Cell Mol. Physiol. 2006 291 L417 L425 10.1152/ajplung.00484.2005 16648237 248. Yang F. Wang X. Haile D.J. Piantadosi C.A. Ghio A.J. Iron increases expression of iron-export protein MTP1 in lung cells Am. J. Physiol. Lung Cell Mol. Physiol. 2002 283 L932 L939 10.1152/ajplung.00114.2002 12376346 249. Ward D.M. Kaplan J. Ferroportin-mediated iron transport: Expression and regulation Biochim. Biophys. Acta (BBA) Mol. Cell Res. 2012 1823 1426 1433 10.1016/j.bbamcr.2012.03.004 PMC3718258 22440327 250. Qu M. Zhang H. Chen Z. Sun X. Zhu S. Nan K. Chen W. Miao C. The Role of Ferroptosis in Acute Respiratory Distress Syndrome Front. Med. 2021 8 651552 10.3389/fmed.2021.651552 PMC8137978 34026785 251. Zhou H. Li F. Niu J.Y. Zhong W.Y. Tang M.Y. Lin D. Cui H.H. Huang X.H. Chen Y.Y. Wang H.Y. Ferroptosis was involved in the oleic acid-induced acute lung injury in mice Sheng Li Xue Bao 2019 71 689 697 31646322 252. Pei Z. Qin Y. Fu X. Yang F. Huo F. Liang X. Wang S. Cui H. Lin P. Zhou G. Inhibition of ferroptosis and iron accumulation alleviates pulmonary fibrosis in a bleomycin model Redox Biol. 2022 57 102509 10.1016/j.redox.2022.102509 36302319 PMC9614651 253. Liu P. Feng Y. Li H. Chen X. Wang G. Xu S. Li Y. Zhao L. Ferrostatin-1 alleviates lipopolysaccharide-induced acute lung injury via inhibiting ferroptosis Cell. Mol. Biol. Lett. 2020 25 10 10.1186/s11658-020-00205-0 32161620 PMC7045739 254. Lai K. Song C. Gao M. Deng Y. Lu Z. Li N. Geng Q. Uridine Alleviates Sepsis-Induced Acute Lung Injury by Inhibiting Ferroptosis of Macrophage Int. J. Mol. Sci. 2023 24 5093 10.3390/ijms24065093 36982166 PMC10049139 255. Gabrielsen J.S. Lamb D.J. Lipshultz L.I. Iron and a Man’s Reproductive Health: The Good, the Bad, and the Ugly Curr. Urol. Rep. 2018 19 60 10.1007/s11934-018-0808-x 29858708 PMC6902410 256. Leandri R. Power K. Buonocore S. De Vico G. Preliminary Evidence of the Possible Roles of the Ferritinophagy-Iron Uptake Axis in Canine Testicular Cancer Animals 2024 14 2619 10.3390/ani14172619 39272404 PMC11394645 257. El Osta R. Grandpre N. Monnin N. Hubert J. Koscinski I. Hypogonadotropic hypogonadism in men with hereditary hemochromatosis Basic Clin. Androl. 2017 27 13 10.1186/s12610-017-0057-8 28694969 PMC5501943 258. Sylvester S.R. Griswold M.D. Localization of transferrin and transferrin receptors in rat testes Biol. Reprod. 1984 31 195 203 10.1095/biolreprod31.1.195 6087946 259. Morales C. Sylvester S.R. Griswold M.D. Transport of iron and transferrin synthesis by the seminiferous epithelium of the rat in vivo Biol. Reprod. 1987 37 995 1005 10.1095/biolreprod37.4.995 3689862 260. Yuan W. Sun Z. Ji G. Hu H. Emerging roles of ferroptosis in male reproductive diseases Cell Death Discov. 2023 9 358 10.1038/s41420-023-01665-x 37770442 PMC10539319 261. Jabado N. Canonne-Hergaux F. Gruenheid S. Picard V. Gros P. Iron transporter Nramp2/DMT-1 is associated with the membrane of phagosomes in macrophages and Sertoli cells Blood 2002 100 2617 2622 10.1182/blood-2002-04-1182 12239176 262. Griffin K.P. Ward D.T. Liu W. Stewart G. Morris I.D. Smith C.P. Differential expression of divalent metal transporter DMT1 (Slc11a2) in the spermatogenic epithelium of the developing and adult rat testis Am. J. Physiol. Cell Physiol. 2005 288 C176 C184 10.1152/ajpcell.00061.2004 15355847 263. Leichtmann-Bardoogo Y. Cohen L.A. Weiss A. Marohn B. Schubert S. Meinhardt A. Meyron-Holtz E.G. Compartmentalization and regulation of iron metabolism proteins protect male germ cells from iron overload Am. J. Physiol.-Endocrinol. Metab. 2012 302 E1519 E1530 10.1152/ajpendo.00007.2012 22496346 264. Zhu H. Cheng Y. Wang X. Yang X. Liu M. Liu J. Liu S. Wang H. Zhang A. Li R. Gss deficiency causes age-related fertility impairment via ROS-triggered ferroptosis in the testes of mice Cell Death Dis. 2023 14 845 10.1038/s41419-023-06359-x 38114454 PMC10730895 265. De Sanctis V. Daar S. Soliman A. Tzoulis P. Yassin M. Kattamis C. A retrospective study of glucose homeostasis, insulin secretion, sensitivity/resistance in non- transfusion-dependent beta-thalassemia patients (NTD-beta Thal): Reduced beta-cell secretion rather than insulin resistance seems to be the dominant defect for glucose dysregulation (GD) Acta Biomed. 2023 94 e2023262 10.23750/abm.v94i6.15001 38054678 PMC10734240 266. Halon-Golabek M. Borkowska A. Herman-Antosiewicz A. Antosiewicz J. Iron Metabolism of the Skeletal Muscle and Neurodegeneration Front. Neurosci. 2019 13 165 10.3389/fnins.2019.00165 30949015 PMC6436082 267. Mathew M. Sivaprakasam S. Phy J.L. Bhutia Y.D. Ganapathy V. Polycystic ovary syndrome and iron overload: Biochemical link and underlying mechanisms with potential novel therapeutic avenues Biosci. Rep. 2023 43 BSR20212234 10.1042/BSR20212234 36408981 PMC9867939 268. Yu X. Peng Y. Nie T. Sun W. Zhou Y. Diabetes and two kinds of primary tumors in a patient with thalassemia: A case report and literature review Front. Oncol. 2023 13 1207336 10.3389/fonc.2023.1207336 37637036 PMC10455928 269. Sleiman J. Tarhini A. Bou-Fakhredin R. Saliba A.N. Cappellini M.D. Taher A.T. Non-Transfusion-Dependent Thalassemia: An Update on Complications and Management Int. J. Mol. Sci. 2018 19 182 10.3390/ijms19010182 29316681 PMC5796131 270. Stepniak J. Rynkowska A. Karbownik-Lewinska M. Membrane Lipids in the Thyroid Comparing to Those in Non-Endocrine Tissues Are Less Sensitive to Pro-Oxidative Effects of Fenton Reaction Substrates Front. Mol. Biosci. 2022 9 901062 10.3389/fmolb.2022.901062 35720119 PMC9203968 271. Chalmers A.W. Shammo J.M. Evaluation of a new tablet formulation of deferasirox to reduce chronic iron overload after long-term blood transfusions Ther. Clin. Risk Manag. 2016 12 201 208 10.2147/tcrm.s82449 26929633 PMC4760653 272. Ngim C.F. Lai N.M. Hong J.Y. Tan S.L. Ramadas A. Muthukumarasamy P. Thong M.K. Growth hormone therapy for people with thalassaemia Cochrane Database Syst. Rev. 2020 2020 CD012284 10.1002/14651858.cd012284.pub3 PMC7387677 32463488 273. Palmer W.C. Vishnu P. Sanchez W. Aqel B. Riegert-Johnson D. Seaman L.A.K. Bowman A.W. Rivera C.E. Diagnosis and Management of Genetic Iron Overload Disorders J. Gen. Intern. Med. 2018 33 2230 2236 10.1007/s11606-018-4669-2 30225768 PMC6258594 274. Chow L.C. Lee B.S. Tang S.O. Loh E.W. Ng S.C. Tan X.Y. Ahmad Noordin M.N. Ong G.B. Chew L.C. Iron burden and endocrine complications in transfusion-dependent thalassemia patients In Sarawak, Malaysia: A retrospective study Med. J. Malaysia 2024 79 281 287 38817060 275. De Sanctis V. Soliman A.T. Canatan D. Elsedfy H. Karimi M. Daar S. Rimawi H. Christou S. Skordis N. Tzoulis P. An ICET- A survey on Hypoparathyroidism in Patients with Thalassaemia Major and Intermedia: A preliminary report Acta Biomed. 2018 88 435 444 10.23750/abm.v88i4.6837 29350657 PMC6166174 276. Yaghobi M. Miri-Moghaddam E. Majid N. Bazi A. Navidian A. Kalkali A. Complications of Transfusion-Dependent beta-Thalassemia Patients in Sistan and Baluchistan, South-East of Iran Int. J. Hematol. Oncol. Stem Cell Res. 2017 11 268 272 29340121 PMC5767285 277. Shah R. Shah A. Badawy S.M. An evaluation of deferiprone as twice-a-day tablets or in combination therapy for the treatment of transfusional iron overload in thalassemia syndromes Expert Rev. Hematol. 2023 16 81 94 10.1080/17474086.2023.2178409 36755516 PMC9992344 278. Mahwi T.O. Rashid Z.G. Ahmed S.F. Hypogonadism among patients with transfusion-dependent thalassemia: A cross-sectional study Ann. Med. Surg. 2023 85 3418 3422 10.1097/MS9.0000000000000947 PMC10328634 37427192 279. De Sanctis V. Soliman A.T. Yassin M.A. Di Maio S. Daar S. Elsedfy H. Soliman N. Kattamis C. Hypogonadism in male thalassemia major patients: Pathophysiology, diagnosis and treatment Acta Biomed. 2018 89 6 15 10.23750/abm.v89i2-S.7082 PMC6179033 29451224 280. Di Maio S. Marzuillo P. Mariannis D. Christou S. Ellinides A. Christodoulides C. de Sanctis V. A Retrospective Long-Term Study on Age at Menarche and Menstrual Characteristics in 85 Young Women with Transfusion-Dependent beta-Thalassemia (TDT) Mediterr. J. Hematol. Infect. Dis. 2021 13 e2021040 10.4084/MJHID.2021.040 34276909 PMC8265331 281. Arab-Zozani M. Kheyrandish S. Rastgar A. Miri-Moghaddam E. A Systematic Review and Meta-Analysis of Stature Growth Complications in beta-thalassemia Major Patients Ann. Glob. Health 2021 87 48 10.5334/aogh.3184 34164261 PMC8194969 282. Giordano P. Urbano F. Lassandro G. Faienza M.F. Mechanisms of Bone Impairment in Sickle Bone Disease Int. J. Environ. Res. Public Health 2021 18 1832 10.3390/ijerph18041832 33668588 PMC7918363 283. Atmakusuma T.D. Hasibuan F.D. Purnamasari D. The Correlation Between Iron Overload and Endocrine Function in Adult Transfusion-Dependent Beta-Thalassemia Patients with Growth Retardation J. Blood Med. 2021 12 749 753 10.2147/JBM.S325096 34429676 PMC8380285 284. Carsote M. Vasiliu C. Trandafir A.I. Albu S.E. Dumitrascu M.C. Popa A. Mehedintu C. Petca R.C. Petca A. Sandru F. New Entity-Thalassemic Endocrine Disease: Major Beta-Thalassemia and Endocrine Involvement Diagnostics 2022 12 1921 10.3390/diagnostics12081921 36010271 PMC9406368 285. De Sanctis V. Soliman A.T. Canatan D. Yassin M.A. Daar S. Elsedfy H. Di Maio S. Raiola G. Corrons J.V. Kattamis C. Thyroid Disorders in Homozygous beta-Thalassemia: Current Knowledge, Emerging Issues and Open Problems Mediterr. J. Hematol. Infect. Dis. 2019 11 e2019029 10.4084/mjhid.2019.029 31205633 PMC6548211 286. D’Aprile S. Denaro S. Pavone A.M. Giallongo S. Giallongo C. Distefano A. Salvatorelli L. Torrisi F. Giuffrida R. Forte S. Anaplastic thyroid cancer cells reduce CD71 levels to increase iron overload tolerance J. Transl. Med. 2023 21 780 10.1186/s12967-023-04664-9 37924062 PMC10625232 287. Moreno-Risco M.B. Mendez M. Moreno-Carralero M.I. Lopez-Moreno A.M. Vagace-Valero J.M. Moran-Jimenez M.J. Juvenile Hemochromatosis due to a Homozygous Variant in the HJV Gene Case Rep. Pediatr. 2022 2022 7743748 10.1155/2022/7743748 35449524 PMC9017560 288. Hagag A.A. El-Farargy M.S. El-Enein A.M.A. Study of Adrenal Functions using ACTH stimulation test in Egyptian children with Sickle Cell Anemia: Correlation with Iron Overload Int. J. Hematol. Oncol. Stem Cell Res. 2015 9 60 66 25922645 PMC4410290 289. Tangngam H. Mahachoklertwattana P. Poomthavorn P. Chuansumrit A. Sirachainan N. Chailurkit L. Khlairit P. Under-recognized Hypoparathyroidism in Thalassemia J. Clin. Res. Pediatr. Endocrinol. 2018 10 324 330 10.4274/jcrpe.0020 29726397 PMC6280323 290. Mousa S.O. Abd Alsamia E.M. Moness H.M. Mohamed O.G. The effect of zinc deficiency and iron overload on endocrine and exocrine pancreatic function in children with transfusion-dependent thalassemia: A cross-sectional study BMC Pediatr. 2021 21 468 10.1186/s12887-021-02940-5 34686155 PMC8532363 291. Li J. Wang P. Li X. Wang Q. Zhang J. Lin Y. Cost-Utility Analysis of four Chelation Regimens for beta-thalassemia Major: A Chinese Perspective Mediterr. J. Hematol. Infect. Dis. 2020 12 e2020029 10.4084/mjhid.2020.029 32395218 PMC7202351 292. de Sanctis V. Soliman A.T. Daar S. Tzoulis P. Di Maio S. Kattamis C. Long-Term Follow-up of beta-Transfusion-Dependent Thalassemia (TDT) Normoglycemic Patients with Reduced Insulin Secretion to Oral Glucose Tolerance Test (OGTT): A Pilot Study Mediterr. J. Hematol. Infect. Dis. 2021 13 e2021021 10.4084/mjhid.2021.021 33747402 PMC7938924 293. Lee K.T. Lim S.L. Goh A.S. Prevalence of endocrine complications in transfusion dependent thalassemia in Hospital Pulau Pinang: A pilot study Med. J. Malays. 2020 75 33 37 32008017 294. Papanikolaou G. Pantopoulos K. Systemic iron homeostasis and erythropoiesis IUBMB Life 2017 69 399 413 10.1002/iub.1629 28387022 295. Pinto V.M. Forni G.L. Management of iron overload in beta-thalassemia patients: Clinical practice update based on case series Int. J. Mol. Sci. 2020 21 8771 10.3390/ijms21228771 33233561 PMC7699680 296. Tripathi A.K. Karmakar S. Asthana A. Ashok A. Desai V. Baksi S. Singh N. Transport of non-transferrin bound iron to the brain: Implications for Alzheimer’s disease J. Alzheimer’s Dis. 2017 58 1109 1119 10.3233/JAD-170097 28550259 PMC5637099 297. Tian C. Zhao J. Xiong Q. Yu H. Du H. Secondary iron overload induces chronic pancreatitis and ferroptosis of acinar cells in mice Int. J. Mol. Med. 2023 51 9 10.3892/ijmm.2022.5212 36484371 PMC9747200 298. Meloni A. Pistoia L. Gamberini M.R. Ricchi P. Cecinati V. Sorrentino F. Cuccia L. Allo M. Righi R. Fina P. The Link of Pancreatic Iron with Glucose Metabolism and Cardiac Iron in Thalassemia Intermedia: A Large, Multicenter Observational Study J. Clin. Med. 2021 10 5561 10.3390/jcm10235561 34884261 PMC8658115 299. Canali S. Wang C.Y. Zumbrennen-Bullough K.B. Bayer A. Babitt J.L. Bone morphogenetic protein 2 controls iron homeostasis in mice independent of Bmp6 Am. J. Hematol. 2017 92 1204 1213 10.1002/ajh.24888 28815688 PMC5986189 300. Kose T. Sharp P.A. Latunde-Dada G.O. Phenolic Acids Rescue Iron-Induced Damage in Murine Pancreatic Cells and Tissues Molecules 2023 28 4084 10.3390/molecules28104084 37241825 PMC10224177 301. Hattori Y. Kato H. Kato A. Tatsumi Y. Kato K. Hayashi H. A Japanese female with chronic mild anemia and primary iron overloading disease Nagoya J. Med. Sci. 2020 82 579 583 10.18999/nagjms.82.3.579 33132441 PMC7548253 302. Mostafa G.G. Zahran F.E. Omer S.A. Ibrahim A. Elhakeem H. The Effect of Serum Ferritin Level on Gonadal, Prolactin, Thyroid Hormones, and Thyroid Stimulating Hormone in Adult Males with Sickle Cell Anemia J. Blood Med. 2020 11 27 32 10.2147/JBM.S232562 32095088 PMC6995285 303. De Sanctis V. Soliman A.T. Daar S. Di Maio S. Adverse events during testosterone replacement therapy in 95 young hypogonadal thalassemic men Acta Biomed. 2019 90 228 232 10.23750/abm.v90i2.8477 31125000 PMC6776204 304. Evangelidis P. Venou T.M. Fani B. Vlachaki E. Gavriilaki E. on behalf of the International Hemoglobinopathy Research Network Endocrinopathies in Hemoglobinopathies: What Is the Role of Iron? Int. J. Mol. Sci. 2023 24 16263 10.3390/ijms242216263 38003451 PMC10671246 305. Mandava M. Lew J. Tisdale J.F. Limerick E. Fitzhugh C.D. Hsieh M.M. Thyroid and Adrenal Dysfunction in Hemoglobinopathies Before and After Allogeneic Hematopoietic Cell Transplant J. Endocr. Soc. 2023 7 bvad134 10.1210/jendso/bvad134 37953902 PMC10635581 306. Murillo Ortiz B.O. Ramirez Emiliano J. Romero Vazquez M.J. Amador Medina L.F. Martinez Garza S. Ramos Rodriguez E.M. Impact of iron chelation with deferasirox on telomere length and oxidative stress in hemodialysis patients: A randomized study Nefrologia 2025 45 68 76 10.1016/j.nefro.2024.06.006 39884801 307. Bollig C. Schell L.K. Rucker G. Allert R. Motschall E. Niemeyer C.M. Bassler D. Meerpohl J.J. Deferasirox for managing iron overload in people with thalassaemia Cochrane Database Syst. Rev. 2017 2017 CD007476 10.1002/14651858.CD007476.pub3 PMC6483623 28809446 308. Fortin P.M. Fisher S.A. Madgwick K.V. Trivella M. Hopewell S. Doree C. Estcourt L.J. Interventions for improving adherence to iron chelation therapy in people with sickle cell disease or thalassaemia Cochrane Database Syst. Rev. 2018 2018 CD012349 10.1002/14651858.CD012349.pub2 PMC5985157 29737522 309. Elalfy M.S. Adly A.M. Wali Y. Tony S. Samir A. Elhenawy Y.I. Efficacy and safety of a novel combination of two oral chelators deferasirox/deferiprone over deferoxamine/deferiprone in severely iron overloaded young beta thalassemia major patients Eur. J. Haematol. 2015 95 411 420 10.1111/ejh.12507 25600572 310. ElLaboudy M.A. Saber M.M. Adly A.A. Ismail E.A. Ibrahim F.A. Elalfy O.M. Oxidative stress markers and tissue iron overload after 12-months vitamin E supplementation for children with transfusion-dependent beta-thalassemia on different iron chelators: A randomized placebo-controlled trial Clin. Nutr. 2025 50 154 163 10.1016/j.clnu.2025.05.003 40424814 311. Merkel D. Soffer S. Filanovsky K. Braester A. Fibach E. Dana M. Ofran Y. Greenbaum U. Nagler A. Amitai I. The Effect of Oral Iron Chelator Deferiprone on Iron Overload and Oxidative Stress in Patients with Myelodysplastic Syndromes: A Study by the Israeli MDS Working Group Acta Haematol. 2024 147 427 434 10.1159/000535749 38104534 PMC11296558 312. Taher A.T. Wali Y. Cruz M.C. Charoenkwan P. Aydinok Y. Werner O. Govindaraju S. Romen F. Viprakasit V. Compliance and clinical benefit of deferasirox granule and dispersible tablet formulation in pediatric patients with transfusional iron overload: In a randomized, open-label, multicenter, phase II study Haematologica 2024 109 1413 1425 10.3324/haematol.2023.283133 37855069 PMC11063844 313. Hamdy M. El-Beshlawy A. Verissimo M.P.A. Kanter J. Inusa B. Williams S. Lee D. Temin N.T. Fradette C. Tricta F. Deferiprone versus deferoxamine for transfusional iron overload in sickle cell disease and other anemias: Pediatric subgroup analysis of the randomized, open-label FIRST study Pediatr. Blood Cancer 2024 71 e30711 10.1002/pbc.30711 37807937 314. Kowdley K.V. Modi N.B. Peltekian K. Vierling J.M. Ferris C. Valone F.H. Gupta S. Rusfertide for the treatment of iron overload in HFE-related haemochromatosis: An open-label, multicentre, proof-of-concept phase 2 trial Lancet Gastroenterol. Hepatol. 2023 8 1118 1128 10.1016/S2468-1253(23)00250-9 37863080 315. Kremyanskaya M. Kuykendall A.T. Pemmaraju N. Ritchie E.K. Gotlib J. Gerds A. Palmer J. Pettit K. Nath U.K. Yacoub A. Rusfertide, a Hepcidin Mimetic, for Control of Erythrocytosis in Polycythemia Vera N. Engl. J. Med. 2024 390 723 735 10.1056/NEJMoa2308809 38381675 316. Modi N.B. Dinh P. Ajari I. Multiple-Dose Pharmacokinetics, Pharmacodynamics, Safety, and Tolerability of Subcutaneous Rusfertide, a Hepcidin Mimetic, in Healthy Subjects Clin. Pharmacol. Drug Dev. 2025 14 311 323 10.1002/cpdd.1514 39888264 PMC11975206 317. Pilo F. Angelucci E. Vamifeport: Monography of the First Oral Ferroportin Inhibitor J. Clin. Med. 2024 13 5524 10.3390/jcm13185524 39337010 PMC11432582 318. Nyffenegger N. Flace A. Varol A. Altermatt P. Doucerain C. Sundstrom H. Durrenberger F. Manolova V. The oral ferroportin inhibitor vamifeport prevents liver iron overload in a mouse model of hemochromatosis Hemasphere 2024 8 e147 10.1002/hem3.147 39267817 PMC11391117 319. Porter J. Taher A. Viprakasit V. Kattamis A. Coates T.D. Garbowski M. Durrenberger F. Manolova V. Richard F. Cappellini M.D. Oral ferroportin inhibitor vamifeport for improving iron homeostasis and erythropoiesis in beta-thalassemia: Current evidence and future clinical development Expert. Rev. Hematol. 2021 14 633 644 10.1080/17474086.2021.1935854 34324404 320. Manolova V. Nyffenegger N. Flace A. Altermatt P. Varol A. Doucerain C. Sundstrom H. Durrenberger F. Oral ferroportin inhibitor ameliorates ineffective erythropoiesis in a model of beta-thalassemia J. Clin. Investig. 2019 130 491 506 10.1172/JCI129382 31638596 PMC6934209 321. Richard F. van Lier J.J. Roubert B. Haboubi T. Gohring U.M. Durrenberger F. Oral ferroportin inhibitor VIT-2763: First-in-human, phase 1 study in healthy volunteers Am. J. Hematol. 2020 95 68 77 10.1002/ajh.25670 31674058 PMC6916274 322. Banerjee S. Lu S. Jain A. Wang I. Tao H. Srinivasan S. Nemeth E. He P. Targeting PKCalpha alleviates iron overload in diabetes and hemochromatosis through the inhibition of ferroportin Blood 2024 144 1433 1444 10.1182/blood.2024023829 38861671 PMC11451300 323. Rahmat Z.S. Ali M.H. Talha M. Hasibuzzaman M.A. FDA approval of Casgevy and Lyfgenia: A dual breakthrough in gene therapies for sickle cell disease Ann. Med. Surg. 2024 86 4966 4968 10.1097/MS9.0000000000002409 PMC11374260 39239058 Figure 1 Organ systems requiring iron for normal function and affected by iron overload. Shown are (A) pituitary–hypothalamic axis, (B) central nervous system, (C) lungs, (D) heart and cardiovascular system, (E) bone marrow, (F) liver, (G) pancreas, (H) kidneys, (I) adrenal glands, (J) thyroid gland, (K) testes/reproductive system, (L,M) heme and erythrocytes (Illustration by authors). Figure 2 Overview of iron metabolism: Illustration showing key processes in iron metabolism, including intestinal absorption of dietary iron, transport via transferrin, utilization in erythropoiesis and cellular functions, storage in ferritin within the liver and macrophages, and recycling of iron via reticuloendothelial system. (Adapted and modified by authors from: “Iron in the Diet: Iron-Rich Foods, Excess and Deficiency Symptoms.” https://madebydiet.com/eu/iron-in-the-diet-iron-rich-foods-excess-and-deficiency-symptoms/ Figure 3 Molecular pathways regulating hepcidin transcription and iron metabolism in liver. Hepcidin expression is regulated by hepatic iron stores and plasma iron levels through the BMP2/6–BMPR–SMAD signaling pathway, modulated by hemojuvelin, matriptase-2, and neogenin. Plasma iron stimulates hepcidin via TFR1–HFE–TFR2 complex enhancing BMP signaling; while inflammation upregulates hepcidin through IL-6 activation of the JAK–STAT pathway. In contrast, erythropoietin-stimulated erythroblasts suppress hepcidin by secreting erythroferrone, which inhibits BMP2/6 signaling. Cellular iron homeostasis involves iron uptake (TFR1, STEAP3, DMT1), export (ferroportin), and storage in ferritin. Autophagic degradation of ferritin (ferritinophagy), mediated by NCOA4, releases iron into the labile pool, increasing reactive oxygen species (ROS) and promoting ferroptosis (Illustration by authors). Figure 4 Iron regulation at the cellular level in cardiomyocytes and CNS. ( Left Panel 2+ Right Panel 2+ 3+ 3+ 3+ 2+ 2+ 3+ 2+ biomedicines-13-02067-t001_Table 1 Table 1 Mediators involved in iron metabolism and pathologic mechanisms caused by iron dysregulation.  Physiological Iron and Pathways Involved Pathological RX 1 CNS  – TF-bound or non-TF-bound forms – TF/TFR1 complex facilitates Fe 3+ – Fe 3+ 2+ – Fe 2+ – Iron stored intracellularly in ferritin cages (FTL/FTH) – Iron export mediated by FPN – Hepcidin binds FPN and induces ubiquitin-mediated degradation.  Iron chelators: deferoxamine, has shown neuroprotective activity reducing iron overload and preventing lipid peroxidation  NRF2/GPX4 Axis GPX4 Disruption of NRF2/GPX4 associated with Parkinson’s and Alzheimer’s   BMP/SMAD-mediated hepcidin axis regulation – Astrocytes and microglia express hepcidin in response to inflammatory cytokines like IL-6 – IL-6 activates JAK/STAT3 pathway, inducing hepcidin during infection or inflammation. High CNS hepcidin inhibit FPN, reducing free iron during infection BMP6 inhibitor, LDN-193189, suppresses hepcidin and increases FPN expression  Ferritinophagy Dysregulation of NCOA4 expression or activity disrupts iron homeostasis → excessive ferritinophagy   Mitochondrial iron regulation – Fe-S cluster biosynthesis and energy generation via oxidative phosphorylation – Aconitase activity Excessive mitochondrial iron → elevated ROS levels    Iron in aging CNS/neurodegenerative diseases Iron accumulates in aged brain → amplifies inflammation and neurodegeneration  Heart  – Iron binds TFR1, endocytosed by clathrin in cardiomyocytes – Decreased iron in cardiomyocytes increases expression of IRP1 and IRP2 – NTBI uptake mediated by SLC39A14 – L-type Ca 2+ 2+     Hepcidin–FPN axis/iron export regulation Cardiac ischemic and reperfusion injuries → higher iron stores in mitochondria followed by oxidative damage of cardiomyocytes   BMP/SMAD axis in hepcidin regulation – Activated macrophages promote atherosclerosis via pro-atherogenic BMP2, BMP4, BMP6 – BMP9 anti-atherogenic effects → counters atherosclerosis  BMP6 inhibitor, LDN-193189, → anti-atherogenic agent  Ferroptosis – Upregulated SLC7A11 enhances GTH synthesis, boosting antioxidant defense – Increased GTH inhibits lipid peroxidation, prevents ferroptosis Reduced SLC7A11 and GTH-peroxidase 4 levels suppress ferroptosis → cardiomyocyte injury  Lungs  – DMT1 transports dietary nonheme iron and endosomal iron (from TF-TFR1 complex) into cytoplasm, regulated by IRPs/IREs – Pulmonary epithelial cells DMT1 and DCYTB import NTBI – ZIP8 (SLC39A8) expressed in lung and upregulated during inflammation In iron overload → NTBI uptake predominantly by hepatocytes, heart, pancreas, and pulmonary epithelial cells   Hepcidin–FPN axis – Increased FPN and FTL1 expression in lung epithelial cells enhances alveolar iron export – Iron accumulates in alveolar macrophages due to elevated epithelial iron efflux – Inflammation → HAMP – Hepcidin degrades FPN, reduces iron efflux from macrophages, promotes iron retention Iron loading of lungs regulated by hepcidin-FPN independent mechanism    Ferroptosis Downregulation of SLC7A11 reduces GTH synthesis, increasing ROS, promoting ferroptosis  Liver EPO–ERFE–Hepcidin axis Ineffective erythropoiesis (e.g., β-thalassemia): ↑ ERFE → ↓ hepcidin → iron overload → ROS generation and tissue damage   BMP-SMAD1/5/8 signaling HAMP In hereditary hemochromatosis: ↓ HFE → impaired BMP/SMAD activation → ↓ hepcidin → iron overload   ERFE expression MDS-RS with SF3B1 mutations: ↑ ERFE → systemic iron overload   NRF2 oxidative stress response In cancer NRF2 inhibition may restore ferroptosis and sensitize tumors to therapy  IL-6/STAT3 pathway Chronic inflammation/autoimmunity: Overactive pathway → anemia of chronic disease (ACD) IL-6R inhibitors in rheumatoid arthritis, cancer  ZIP14-mediated NTBI uptake Prolonged ZIP14 activity → hepatic iron overload → fibrosis, cirrhosis, hepatocellular carcinoma   Low hepcidin (during iron deficiency or increased erythropoiesis) → active FPN allows iron release into blood In hereditary hemochromatosis: ↓ hepcidin → unregulated FPN → systemic iron overload, oxidative stress → liver fibrosis, cirrhosis, hepatocellular carcinoma.  Heme/bone marrow HRG1-mediated intracellular heme transport    Heme synthesis (mitochondrial matrix) ALAS2 mutations/deficiency: Impairs erythroid heme production → sideroblastic anemia   Inflammation-mediated inhibition/ACD ACD: Inflammation suppresses heme synthesis via itaconate pathway (dual action: substrate depletion + enzyme inhibition) → reduced hemoglobin synthesis even with sufficient iron stores  1 ",
  "metadata": {
    "Title of this paper": "FDA approval of Casgevy and Lyfgenia: A dual breakthrough in gene therapies for sickle cell disease",
    "Journal it was published in:": "Biomedicines",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12467715/"
  }
}