{
  "title": "Paper_1094",
  "abstract": "pmc Dent J (Basel) Dent J (Basel) 3384 dentj dentistry Dentistry Journal 2304-6767 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468653 PMC12468653.1 12468653 12468653 41002693 10.3390/dj13090421 dentistry-13-00421 1 Article Digital Accuracy of Closed-Tray Implant Impressions: Influence of Polyvinyl Siloxane Viscosity and Subgingival Posterior Implant Angulation https://orcid.org/0000-0002-5404-7248 Ahmed Yousra 1 https://orcid.org/0009-0007-5868-8521 Hameed Shereen Moselhy Abdul 2 Sharkawy Zainab Refaey El 2 https://orcid.org/0000-0003-0433-5476 Alshahrani Faris A. 3 * https://orcid.org/0009-0007-5370-0106 Mahmoud Tarek AbdAllah 4 M. Mohamed Inas 5 https://orcid.org/0000-0002-1527-638X Taymour Noha 3 * Suzuki Marcelo Academic Editor 1 yousra.elsayed@ksiu.edu.eg 2 sherine.moselhy@gmail.com zainabelsharkawy.26@azhar.edu.eg 3 4 tarek.mahmoud@dnt.mti.edu.eg 5 enasalsherbiny@gmail.com * faalshahrani@iau.edu.sa ntyoussef@iau.edu.sa 12 9 2025 9 2025 13 9 497630 421 01 8 2025 03 9 2025 08 9 2025 12 09 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Objectives: Materials and Methods Results: p p Conclusions: subgingival implant implant angulation closed-tray impression implant cast accuracy polyvinyl siloxane This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The restoration of partial and complete edentulism with osseointegrated implants has emerged as the preferred standard of dental care in modern prosthetic dentistry [ 1 2 3 4 5 6 7 8 9 Although intraoral scanners are increasingly used in clinical practice, conventional impression materials remain widely applied in daily dentistry. It is important to note that these materials may exhibit dimensional changes during the impression and model fabrication process [ 10 11 The accuracy of implant impressions is multifactorial, including the type of impression material and technique, splinted impression copings, impression level (implant or abutment), implant angulation, and depth [ 12 13 14 15 16 17 Conversely, vinyl polysiloxane (PVS) offers superior elastic recovery [ 18 16 19 20 Implants are frequently placed subgingivally to address esthetic concerns, anatomical variations, or soft tissue thickness. This positioning necessitates deeper placement of impression copings within the gingival tissue, reducing the supragingival portion available for contact with impression material [ 21 22 While numerous studies have explored the effects of implant angulation and impression technique on impression accuracy in partially edentulous cases [ 21 23 01 02 2. Materials and Methods 2.1. Ethical Approval Ethical approval for the study was obtained from the Research Ethics Committee of the Faculty of Dental Medicine for Girls, Al-Azhar University, in July 2025, Code: REC-PD-25-15. 2.2. Sample Size Calculation Eight impressions were made per subgroup, based on a prior study [ 24 25 26 2.3. Master Model Preparation A commercially available Kennedy Class I partially edentulous mandibular model was duplicated three times using solvent-free transparent epoxy resin to create three master models. Each resin model was precisely drilled using a 5-axis CNC machine to accommodate four internal connection dental implant analogues (Implant Direct, Sybron International), positioned at teeth number 35, 37, 45, and 47 according to FDI notation. In all models, the two anterior analogues were placed parallel (0°), while the two posterior analogues were positioned at different angulations: ( Figure 1 Model 1: 30° mesiodistal angulation (tilted distally, Group 1: 30° MD). Model 2: 20° mesiodistal angulation (tilted distally, Group 2: 20° MD). Model 3: 20° buccolingual angulation (converging lingually, Group 3: 20° BL). 2.4. Custom Trays Fabrication Custom trays were fabricated for closed-tray, implant-level impressions. For each master model, implant-level impression transfers were attached to analogues, and three layers of baseplate wax were adapted over and around the copings [ 27 22 Table 1 The autopolymerizing resin was mixed at the manufacturer’s recommended 1:1 resin-to-monomer ratio to limit shrinkage and ensure proper polymerization. Trays were allowed to fully polymerize (15–20 min), then all of the trays were left for more 24 h before use, minimizing dimensional changes and ensuring accuracy [ 10 2.5. Impression Procedures Polyvinyl siloxane impressions were mixed using a mixing syringe to standardize the mixing process. As per standard procedure, the first part of the material was extruded and discarded to ensure the material was fully mixed in even quantities of base and catalyst. This step was taken to guarantee uniformity and accuracy in the impression material before application to the tray. All impressions were performed at 25 °C ± 2 °C. Copings were attached to analogues with a torque controller at 10 N/cm. Periapical radiographs confirmed seating of impression copings. Vinyl gloves were used to prevent retardation from latex interaction. Coping was secured with a hex tool. Heavy body PVS was loaded into the tray, while light body was injected around the copings. The tray was seated with light finger pressure onto the location marks and maintained during polymerization. A 1.5 kg metal block was placed on the tray to standardize pressure. After 4 min, the tray was removed with a sharp snap. Monophase PVS Technique: Copings were screwed onto the analogues first using a torque controller set to 10 N/cm. Regular viscosity monophase PVS was dispensed using an auto mix gun. The material was then applied both in the tray and around the copings. The tray was positioned and seated using finger pressure, and a 1.5 kg metal block was used to standardize pressure during the setting process. After 6 min, the tray was removed with a sharp snap. Impressions were inspected and repeated if defects, such as air voids or material separation, were detected. All components were verified for correct orientation and seating. The impression copings were removed from the cast, attached to the analogues, and reseated in the impression. The same operator secured the analogues to the copings at 10 N/cm to ensure consistent and accurate placement. 2.6. Cast Fabrication and Scanning Impressions were poured with type IV dental stone. The mixing ratio of gypsum to water for the type IV dental stone was 100 g of gypsum to 20 mL of water, as per the manufacturer’s guidelines, to ensure consistency and optimal flow. This procedure was performed by a single trained operator to ensure consistent mixing, pouring, and handling to minimize variability during the process. After 24 h, the casts were separated from impressions. PEEK scan bodies (Implant Direct, Sybron International) were attached to the analogues. All casts and master models were scanned using a laboratory scanner (Smart Optics, Activity 885, Germany) to produce STL files. Scan bodies were hand-tightened to a maximum of 15 N/cm, and the same scan bodies were transferred between models to eliminate variability. STL files of reference and test models were archived for analysis [ 28 Figure 2 2.7. Accuracy Evaluation and 3D Deviation Analysis Digital datasets were evaluated utilizing industrial reverse engineering software (Geomagic Control X 2022, 3D Systems, Rock Hill, SC, USA). All STL files were examined for anomalies. The accuracy of each impression material was assessed by 3D deviation analysis [ 29 Figure 3 16 2.8. Statistical Analysis The numerical data were assessed for normality by evaluating their distribution and applying both the Kolmogorov–Smirnov and Shapiro–Wilk tests. All datasets demonstrated a normal (parametric) distribution. Results are reported as mean values with corresponding standard deviations (SD). A two-way analysis of variance (ANOVA) was conducted to evaluate the influence of impression material, implant angulation, and their interactions on the mean trueness, expressed as root mean square (RMS, in millimeters). When the ANOVA indicated significant differences, Bonferroni’s post hoc test was employed for pairwise comparisons. The threshold for statistical significance was set at p 3. Results The two-way ANOVA analysis revealed that implant angulation, independent of the type of impression material, had a statistically significant impact on mean trueness ( p p p Table 2 Regardless of the impression material used, a statistically significant difference was observed between implant angulations ( p p Table 3 Comparison Between Angulations: When using the monophase PVS impression, a statistically significant difference was observed among the angulations ( p p Comparison Between Impression Materials: At the 30° MD angulation, the monophase PVS impression yielded a significantly higher mean deviation (96 ± 7 µm) compared to the heavy and light body PVS combination (77 ± 3 µm) ( p p p Table 4 Figure 4 4. Discussion This in vitro study investigated the influence of implant angulation and polyvinyl siloxane (PVS) impression material viscosity on the trueness of definitive implant casts using the closed-tray technique in a partially edentulous model with subgingivally placed implants. The closed-tray technique was selected in the present study due to its ease of use, reduced chairside time, and lower risk of distortion [ 30 31 30 13 20 21 To replicate this clinically relevant scenario where insufficient bone volume or thick, soft tissue necessitates subgingival implant positioning, the implant analogues in the present study were placed 2 mm below the gingival margin [ 32 33 34 35 22 36 37 38 30 The study revealed that heavy and light body PVS produced significantly lower RMS deviations compared to monophase PVS, particularly in 30 degrees angulated implant groups. Consequently, the first null hypothesis (H 01 These findings coincide with those of Richi et al., who found that implant angulation, impression technique, and coping type significantly affect the accuracy of impressions, particularly in cases involving multiple angulated implants [ 39 40 41 Regarding implant angulation, our results indicated that that increased implant angulation, particularly at 30° mesiodistal angle (MD), was associated with higher deviation in trueness, especially when monophase PVS was used. Thus, the second null hypothesis (H 02 It is worth noting that both impression viscosities produced accuracy results within the clinically acceptable threshold of 100 µm linear deviation, which is generally considered sufficient to ensure adequate passive fit and long-term prosthetic success [ 9 16 42 43 44 A previous study reported that angulations up to 15° had no substantial effect on impression accuracy when using monophase PVS [ 16 13 45 46 47 The direction of implant angulation also plays a critical role in impression accuracy. Baldissara et al. noted that buccolingual divergence contributes significantly to impression distortion, particularly when using transfer copings [ 48 42 The interaction between implant angulation and impression material was further highlighted by Vojdani et al., who found that while impression material had minimal impact under parallel implant conditions, heavy and light body PVS performed significantly better in nonparallel configurations. This supports the use of dual-viscosity PVS in complex angulated implant cases due to its superior elastic recovery and flow properties [ 25 Conrad et al. also agreed with our results, as they reported that implant angulation (5°, 10°, 15°), implant number, and impression technique did not significantly affect cast accuracy when using heavy and light-body PVS, suggesting that moderate angulations may not substantially compromise trueness with favorable elastomeric materials [ 38 42 49 The use of Light and Heavy Body PVS materials in combination has been shown to improve the accuracy of impressions compared to Monophase PVS. The greater filler content in Heavy Body material helps reduce shrinkage after polymerization, leading to more stable dimensional properties. This is because the denser structure of Heavy Body material, due to the higher filler content, undergoes less dimensional change during setting. In contrast, Monophase PVS, with lower filler content, tends to shrink more during polymerization, which could impact the final accuracy of the impression. Light and Heavy Body PVS materials improve accuracy due to the higher filler content in Heavy Body, which reduces shrinkage after polymerization. But the little filler content in the light body makes it more elastic upon removal from undercut created by angled implants. However, materials with higher hardness and greater filler content (like medium body) may experience lower elastic recovery, leading to potential distortion during tray removal [ 47 Both impression material viscosities yielded trueness values within clinically acceptable limits of less than 100 (µm) [ 40 Limitations and Recommendations This study has some limitations that should be considered. First, it was conducted under in vitro laboratory conditions, which although standardized do not fully replicate the intraoral environment where saliva, soft tissue resilience, temperature changes, and patient movement can affect impression accuracy. In addition, the study compared only two PVS impression techniques with a single implant system and laboratory scanner. Other impression materials, implant systems, or digital intraoral scanners were not evaluated, which may limit the generalizability of the findings. Finally, the analysis focused on immediate trueness without assessing long-term dimensional stability or clinical performance. Future studies are recommended to validate these findings in vivo under real oral conditions, to incorporate a wider range of impression materials and scanning technologies, and to examine the long-term stability of impressions and their influence on prosthetic fit. Expanding sample sizes, conducting multicenter investigations, and including patient-centered outcomes such as time efficiency and comfort would further strengthen the clinical relevance of future research 5. Conclusions Within the limitations of this in vitro study, both monophase and heavy + light body polyvinyl siloxane (PVS) impressions demonstrated clinically acceptable accuracy. The combination of heavy + light body PVS impressions provided enhanced accuracy compared to monophase impressions. The superiority of the heavy + light body PVS was most evident in cases with multiple angulated implants, particularly at a 30° distal angulation in sub-gingival positions, when using the closed-tray technique. These findings suggest that impression material selection should be carefully considered in challenging clinical scenarios involving angulated implants to optimize accuracy and prosthetic outcomes. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, Y.A. and N.T.; methodology, S.M.A.H. and Z.R.E.S.; software, S.M.A.H. and Z.R.E.S.; validation, T.A.M., I.M.M. and S.M.A.H.; formal analysis, T.A.M.; investigation, I.M.M.; resources, N.T.; data curation, Y.A.; writing—original draft preparation, N.T.; writing—review and editing, Y.A. and N.T.; visualization, S.M.A.H.; supervision, S.M.A.H.; project administration, Y.A. and N.T.; funding acquisition, F.A.A. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Ethical approval for the study was obtained from the Research Ethics Committee of the Faculty of Dental Medicine for Girls, Al-Azhar University, in July 2025, Code: REC-PD-25-15. Informed Consent Statement Not applicable. Data Availability Statement Available through the following link: https://figshare.com/s/9d9bcd9a01dec91a9923 Conflicts of Interest The authors declare no conflicts of interest. References 1. Taymour N. Fahmy A.E. Gepreel M.A.H. Kandil S. El-Fattah A.A. Improved Mechanical Properties and Bioactivity of Silicate Based Bioceramics Reinforced Poly(Ether-Ether-Ketone) Nanocomposites for Prosthetic Dental Implantology Polymers 2022 14 1632 10.3390/polym14081632 35458382 PMC9026494 2. Elsayed S. Ahmed Y. El-Anwar M.I. Elddamony E. Ashraf R. Influence of Different Polymeric Materials of Implant and Attachment on Stress Distribution in Implant-Supported Overdentures: A Three-Dimensional Finite Element Study BMC Oral Health 2025 25 166 10.1186/s12903-025-05440-5 39885486 PMC11783779 3. Moura R.V. Kojima A.N. Saraceni C.H.C. Bassolli L. Balducci I. Özcan M. Mesquita A.M.M. Evaluation of the Accuracy of Conventional and Digital Impression Techniques for Implant Restorations J. Prosthodont. 2019 28 e530 e535 10.1111/jopr.12799 29717518 4. Ahmed Y. Taha M.G.M. Elbelacy H. Gaber M.S. Fernandes G.V.O. Rahhal M. Radiographic Outcomes Comparing Mini-Implant Versus Conventional Implant-Retained Overdenture with Different Attachment Systems: A Randomized Controlled Clinical Trial Int. J. Oral Maxillofac. Implant. 2025 1 21 10.11607/jomi.11506 40879616 5. Hassanein F.E.A. El Barbary A. Hussein R.R. Ahmed Y. El-Guindy J. Sarhan S. Abou-Bakr A. Diagnostic Performance of ChatGPT-4o and DeepSeek-3 Differential Diagnosis of Complex Oral Lesions: A Multimodal Imaging and Case Difficulty Analysis Oral Dis. 2025 26 1255 1264 10.1111/odi.70007 40589366 6. Abou-Bakr A. Ahmed E. William H. Hassanein F.E.A. Frequency of Periodontal Disease in Head and Neck Cancer Patients after Radiation Therapy: A Cross-Sectional Study BMC Oral Health 2025 25 1008 10.1186/s12903-025-06391-7 40604898 PMC12225212 7. Alikhasi M. Siadat H. Rahimian S. The Effect of Implant Angulation on the Transfer Accuracy of External-Connection Implants Clin. Implant. Dent. Relat. Res. 2015 17 822 829 10.1111/cid.12185 24299654 8. Yasar M.N. Cetinsahin C. Bayar O. Ozer H.Y. Implant Impression Techniques Using Different Materials and Methods: A Review J. Clin. Diagn. Res. 2022 16 ZE12 ZE17 10.7860/JCDR/2022/53057.16014 9. Taymour N. Alabdrubalameer D.I. Al Shooq Z.H. Al Yaseen M.S. Al Zaher R.H. Shetty A.C. Rifaat S. Dimensional Accuracy of Polyether Elastomeric Impression Materials After Using Chitosan as a Disinfectant: A Sustainable Approach to Dental Infection Control Prosthesis 2025 7 7 10.3390/prosthesis7010007 10. Zenthöfer A. Rues S. Rammelsberg P. Ruckes D. Stober T. Accuracy of a New Fast-Setting Polyether Impression Material Int. J. Prosthodont. 2020 33 410 417 10.11607/ijp.6419 32639701 11. Nowakowska-Toporowska A. Malecka K. Raszewski Z. Wieckiewicz W. Changes in Hardness of Addition-Polymerizing Silicone-Resilient Denture Liners After Storage in Artificial Saliva J. Prosthet. Dent. 2019 121 317 321 10.1016/j.prosdent.2018.05.002 30093127 12. Kahramanoğlu E. Aslan Y.U. Özkan Y. Keskin Özyer E. İmplant Destekli Protetik Restorasyonlarda Kullanılan Ölçü Yöntemleri ve Materyalleri: Derleme Eur. J. Res. Dent. 2019 2 124 132 10.35333/erd.2019.101 13. Parameshwari G. Chittaranjan B. Sudhirchary N. Anulekha Avinash C. Taruna M. Ramureddy M. Evaluation of Accuracy of Various Impression Techniques and Impression Materials in Recording Multiple Implants Placed Unilaterally in a Partially Edentulous Mandible—An in Vitro Study J. Clin. Exp. Dent. 2018 10 e388 e395 10.4317/jced.54726 29750102 PMC5937963 14. Taymour N. Abdul Hameed S.M. AlGhamdi M.A. El Sharkawy Z.R. Farid Z.S. Ahmed Y. Accuracy of New-Generation Intraoral Scanners in Digitizing All-on-Four Implant Models with Varying Posterior Implant Angulations: An In Vitro Trueness and Precision Evaluation Prosthesis 2025 7 74 10.3390/prosthesis7040074 15. Izadi A. Heidari B. Roshanaei G. Allahbakhshi H. Fotovat F. Comparative Study of Dimensional Accuracy in Three Dental Implant Impression Techniques: Open Tray, Closed Tray with Impression Coping, and Snap Cap J. Contemp. Dent. Pract. 2018 19 974 981 10.5005/jp-journals-10024-2368 30150500 16. Önöral Ö. Kurtulmus-Yilmaz S. Toksoy D. Ozan O. Effect of Angulation on the 3D Trueness of Conventional and Digital Implant Impressions for Multi-Unit Restorations J. Adv. Prosthodont. 2023 15 290 10.4047/jap.2023.15.6.290 38205122 PMC10774637 17. Pera F. Pesce P. Bevilacqua M. Setti P. Menini M. Analysis of Different Impression Techniques and Materials on Multiple Implants Through 3-Dimensional Laser Scanner Implant. Dent. 2016 25 232 237 10.1097/ID.0000000000000353 26517068 18. Taymour N. Hussein Abdel Kader S. Aboushelib M.N. Gad M.M. Comparative Analysis of Dimensional Changes in Autoclavable Polyvinyl Siloxane (PVS) Impressions Under Various Sterilization/Disinfection Protocols: A Randomized Controlled Trial Saudi Dent. J. 2024 36 603 609 10.1016/j.sdentj.2024.01.016 38690388 PMC11056420 19. Saini H.S. Jain S. Kumar S. Aggarwal R. Choudhary S. Reddy N.K. Evaluating the Effect of Different Impression Techniques and Splinting Methods on the Dimensional Accuracy of Multiple Implant Impressions: An in Vitro Study J. Contemp. Dent. Pract. 2018 19 1005 1012 30150505 20. V M. Chirom B. Gunadhar K. Priyadarshini S. Nongthombam R.S. P M. The Accuracy of Casts Obtained Using Different Impression Techniques and Impression Materials in Combined Parallel and Angulated Implants: An In Vitro Study Cureus 2024 16 e59193 10.7759/cureus.59193 38807829 PMC11131036 21. Martínez-Rus F. García C. Santamaría A. Özcan M. Pradíes G. Accuracy of Definitive Casts Using 4 Implant-Level Impression Techniques in a Scenario of Multi-Implant System with Different Implant Angulations and Subgingival Alignment Levels Implant. Dent. 2013 22 268 276 10.1097/ID.0b013e3182920dc5 23615660 22. Awad E.M. ElSheikh M.M. El-Segai A.A.E.M. Effect of Soft Tissue Thickness on Accuracy of Conventional and Digital Implant Impression Techniques BMC Oral Health 2024 24 1318 10.1186/s12903-024-05037-4 39478512 PMC11523802 23. Rajendran R. Chander N. Anitha K. Muthukumar B. Dimensional Accuracy of Vinyl Polyether and Polyvinyl Siloxane Impression Materials in Direct Implant Impression Technique for Multiple Dental Implants Eur. Oral Res. 2021 55 54 59 10.26650/eor.20210110 34250470 PMC8244944 24. Abd El-fattah F. Alam-Eldein A. Elshenawy E. Effect of Impression Materials and Techniques on Impressions Accuracy for Angulated Implants Egypt. Dent. J. 2018 64 2501 2511 10.21608/edj.2018.77233 25. Vojdani M. Torabi K. Ansarifard E. Accuracy of Different Impression Materials in Parallel and Nonparallel Implants Dent. Res. J. 2015 12 315 10.4103/1735-3327.161429 PMC4533188 26288620 26. Alikhasi M. Siadat H. Nasirpour A. Hasanzade M. Three-Dimensional Accuracy of Digital Impression versus Conventional Method: Effect of Implant Angulation and Connection Type Int. J. Dent. 2018 2018 3761750 10.1155/2018/3761750 29971107 PMC6008832 27. Vigolo P. Mutinelli S. Fonzi F. Stellini E. An In Vitro Evaluation of Impression Techniques for Multiple Internal- and External-Connection Implant Prostheses Int. J. Oral Maxillofac. Implant. 2014 29 807 818 10.11607/jomi.3460 25032760 28. Andriessen F.S. Rijkens D.R. Van Der Meer W.J. Wismeijer D.W. Applicability and Accuracy of an Intraoral Scanner for Scanning Multiple Implants in Edentulous Mandibles: A Pilot Study J. Prosthet. Dent. 2014 111 186 194 10.1016/j.prosdent.2013.07.010 24210732 29. Dohiem M.M. Abdelaziz M.S. Abdalla M.F. Fawzy A.M. Digital Assessment of the Accuracy of Implant Impression Techniques in Free End Saddle Partially Edentulous Patients. A Controlled Clinical Trial BMC Oral Health 2022 22 486 10.1186/s12903-022-02505-7 36371189 PMC9655800 30. Farronato D. Pasini P.M. Campana V. Lops D. Azzi L. Manfredini M. Can Transfer Type and Implant Angulation Affect Impression Accuracy? A 3D in Vitro Evaluation Odontology 2021 109 884 894 10.1007/s10266-021-00619-y 34075492 PMC8387271 31. Osman M.S. Ziada H.M. Abubakr N.H. Suliman A.M. Implant Impression Accuracy of Parallel and Non-Parallel Implants: A Comparative In-Vitro Analysis of Open and Closed Tray Techniques Int. J. Implant. Dent. 2019 5 4 10.1186/s40729-019-0159-5 30778790 PMC6379502 32. Robaian A. Hamed M.M. Ahmed Y. Hassanein F.E.A. Comparative Evaluation of Customized CAD/CAM vs. Stock Titanium Abutments for Immediate Implant Placement in Class II Extraction Sockets: A Randomized Controlled Trial Dent. J. 2025 13 371 10.3390/dj13080371 40863074 PMC12385633 33. Linkevicius T. Svediene O. Vindasiute E. Puisys A. Linkeviciene L. The Influence of Implant Placement Depth and Impression Material on the Stability of an Open Tray Impression Coping J. Prosthet. Dent. 2012 108 238 243 10.1016/S0022-3913(12)60169-3 23031730 34. P M, G.; Sukumaran, K.; K, H.; Ravindran, S. Evaluation of the Stability of Open-Tray Impression Coping Using Two Different Impression Materials at Three Different Subgingival Implant Placement Depths Cureus 2024 16 e61117 10.7759/cureus.61117 38803409 PMC11129605 35. Kontis P. Güth J.-F. Keul C. Accuracy of Full-Arch Digitalization for Partially Edentulous Jaws—A Laboratory Study on Basis of Coordinate-Based Data Analysis Clin. Oral Investig. 2022 26 3651 3662 10.1007/s00784-021-04335-3 PMC8979898 34981252 36. Amin S. Weber H.P. Finkelman M. El Rafie K. Kudara Y. Papaspyridakos P. Digital vs. Conventional Full-Arch Implant Impressions: A Comparative Study Clin. Oral Implant. Res. 2017 28 1360 1367 10.1111/clr.12994 28039903 37. Lin W.-S. Harris B. Elathamna E. Abdel-Azim T. Morton D. Effect of Implant Divergence on the Accuracy of Definitive Casts Created from Traditional and Digital Implant-Level Impressions: An In Vitro Comparative Study Int. J. Oral Maxillofac. Implant. 2015 30 102 109 10.11607/jomi.3592 25615919 38. Conrad H.J. Pesun I.J. DeLong R. Hodges J.S. Accuracy of Two Impression Techniques with Angulated Implants J. Prosthet. Dent. 2007 97 349 356 10.1016/S0022-3913(07)60023-7 17618917 39. Richi M.W. Kurtulmus-Yilmaz S. Ozan O. Comparison of the Accuracy of Different Impression Procedures in Case of Multiple and Angulated Implants: Accuracy of Impressions in Multiple and Angulated Implants Head Face Med. 2020 16 9 10.1186/s13005-020-00225-3 32366261 PMC7197148 40. Ghahremanloo A. Seifi M. Ghanbarzade J. Abrisham S.M. Javan R.A. Effect of Polyvinyl Siloxane Viscosity on Accuracy of Dental Implant Impressions J. Dent. 2017 14 40 47 PMC5557995 28828016 41. Aidasani A.N. Jain S. Hassan S. Sharma A. Shanthi C. Fere S. Comparative Evaluation of the Rigidity and Accuracy of Different Elastomeric Impression Materials with Open Tray Implant Level Impression Technique—An In Vitro Study J. Pharm. Bioallied Sci. 2023 15 S1262 S1265 10.4103/jpbs.jpbs_131_23 37694071 PMC10485486 42. Shim J.S. Ryu J.J. Shin S.W. Lee J.Y. Effects of Implant Angulation and Impression Coping Type on the Dimensional Accuracy of Impressions Implant. Dent. 2015 24 726 729 10.1097/ID.0000000000000336 26384100 43. Papaspyridakos P. Chen C.-J. Gallucci G. Doukoudakis A. Weber H.-P. Chronopoulos V. Accuracy of Implant Impressions for Partially and Completely Edentulous Patients: A Systematic Review Int. J. Oral Maxillofac. Implant. 2014 29 836 845 10.11607/jomi.3625 25032763 44. Lyu M. Di P. Lin Y. Jiang X. Accuracy of Impressions for Multiple Implants: A Comparative Study of Digital and Conventional Techniques J. Prosthet. Dent. 2022 128 1017 1023 10.1016/j.prosdent.2021.01.016 33640093 45. Elshenawy E.A. Alam-Eldein A.M. Abd Elfatah F.A. Cast Accuracy Obtained from Different Impression Techniques at Different Implant Angulations (In Vitro Study) Int. J. Implant. Dent. 2018 4 9 10.1186/s40729-018-0118-6 29556841 PMC5859005 46. Filho H.G. Mazaro J.V.Q. Vedovatto E. Assunção W.G. Santos P.H.D. Accuracy of Impression Techniques for Impants. Part 2—Comparison of Splinting Techniques J. Prosthodont. 2009 18 172 176 10.1111/j.1532-849X.2008.00325.x 19178624 47. Sorrentino R. Gherlone E.F. Calesini G. Zarone F. Effect of Implant Angulation, Connection Length, and Impression Material on the Dimensional Accuracy of Implant Impressions: An In Vitro Comparative Study Clin. Implant. Dent. Relat. Res. 2010 12 e63 e76 10.1111/j.1708-8208.2009.00167.x 19438937 48. Baldissara P. Koci B. Messias A.M. Meneghello R. Ghelli F. Gatto M.R. Ciocca L. Assessment of Impression Material Accuracy in Complete-Arch Restorations on Four Implants J. Prosthet. Dent. 2021 126 763 771 10.1016/j.prosdent.2020.10.017 33526247 49. D’Albis G. D’Albis V. Susca B. Palma M. Al Krenawi N. Implant-Supported Zirconia Fixed Partial Dentures Cantilevered in the Lateral-Posterior Area: A 4-Year Clinical Results J. Dent. Res. Dent. Clin. Dent. Prospect. 2022 16 258 263 10.34172/joddd.2022.041 PMC10407873 37560497 Figure 1 Study design flowchart. Figure 2 Reference scans of models 1, 2 and 3 (( A B C Figure 3 Superimposition of reference and test models: ( A B C D E Figure 4 Bar chart showing RMS values (in mm) for trueness with two viscosities of silicone impression materials. Posterior implants were positioned at 30° MD (blue), 20° MD (orange), and 20° BL (gray) angles. Error bars represent standard deviation. dentistry-13-00421-t001_Table 1 Table 1 Materials and equipment used in the study. Material/Equipment Manufacturer (Country) Model/Reference Number Transparent epoxy resin CMB International, Egypt BN1443120720 E667 G Autopolymerizing resin Acrostone Dental Manufacturer, Egypt  Universal Tray Adhesive Zhermack, Badia Polesine, Italy C700025 PVS (Heavy + Light Body)—Elite HD+ Zhermack, Badia Polesine, Italy C202032 PVS (Monophase)—Hydrorise Monophase Zhermack, Badia Polesine, Italy C207007 Mixing syringe & dispensing gun DENTP, China  Type IV dental stone—Fujirock EP GC Corp., Tokyo, Japan 890222 PEEK scan adapters Implant Direct, Sybron International, USA #8035-09 Internal connection implant analogues Implant Direct, Sybron International, USA Legacy 1™ Internal Analogue. Impression coping Implant Direct, Sybron International, USA Closed tray, implant level transfer 5-axis CNC machine YCM Fanuc, Yeong Chin Machinery Ltd., Taiwan YCM-Fanuc 5X Laboratory scanner—Activity 885 Smart Optics, Germany Activity 885 Reverse engineering software 3D Systems, USA Geomagic Control X (2022) ™ (Trademark symbol), # (Catalog or Part Number indicator). dentistry-13-00421-t002_Table 2 Table 2 Two-way mixed model ANOVA results for the effect of different variables on mean trueness (RMS in mm). Source of Variation Type III Sum of Squares df Mean Square F p Effect Size (Partial Eta Squared) 95% CI for η 2 Angulation 0.001 2 0.0005 3.864 0.032 * 0.205 0.02–0.39 Impression material 0.0002 1 0.0002 3.115 0.088 0.094 0.00–0.27 Angulation × Impression material interaction 0.001 2 0.0005 7.12 0.003 * 0.322 0.08–0.49 df: degrees of freedom = (n − 1), *: Significant at p dentistry-13-00421-t003_Table 3 Table 3 The mean, standard deviation (SD) values and results of two-way ANOVA test for main effects of the two variables on trueness (RMS in mm). Variables Mean SD p  Effect Size (Partial Eta Squared) 95% CI for η 2 Angulation 30° MD 0.0866 A 0.0112 0.032 * 0.205  20° MD 0.0775 B 0.0074 0.02–0.39 20° BL 0.0817 AB 0.0099  Impression monophase 0.0843 0.0108 0.088 0.094 0.00–0.27 Heavy + light 0.0796 0.009  *: Significant at p p p dentistry-13-00421-t004_Table 4 Table 4 The mean, standard deviation (SD), 95% confidence intervals (CI), and results of two-way ANOVA test for comparison between trueness (RMS in mm) with different interactions of variables. Impression 30° MD 20° MD 20° BL p Effect Size (Partial Eta Squared) 95% CI for η 2 Mean SD Mean SD Mean SD Monophase 0.0961 A 0.0071 0.0756 C 0.0066 0.0813 B 0.0061 <0.001 * 0.409 0.19–0.55 Heavy + light 0.0771 0.0032 0.0794 0.0083 0.0822 0.0134 0.550 0.039 0.00–0.17 p <0.001 * 0.420 0.839    Effect size (Partial eta squared) 0.357 0.022 0.001    95% CI for η 2 0.11–0.49 0.00–0.15 0.00–0.09    *: Significant at p ",
  "metadata": {
    "Title of this paper": "Implant-Supported Zirconia Fixed Partial Dentures Cantilevered in the Lateral-Posterior Area: A 4-Year Clinical Results",
    "Journal it was published in:": "Dentistry Journal",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468653/"
  }
}