{
  "title": "Paper_1156",
  "abstract": "J Manag Care Spec Pharm J Manag Care Spec Pharm 4474 jmcsp jmcsp Journal of Managed Care & Specialty Pharmacy 2376-0540 2376-1032 Academy of Managed Care Pharmacy PMC12467749 PMC12467749.1 12467749 12467749 40938639 10.18553/jmcp.2025.25199 1 Research Selected drugs, therapeutic alternatives, and price benchmarks for IPAY 2027 Medicare drug price negotiation Sullivan Sean D. BScPharm, PhD Cousin Emma M. PharmD Li Kevin H. PharmD, MSc Gabriel Nico MA Martin Kristi MPA The CHOICE Institute, School of Pharmacy, University of Washington, Seattle Department of Health Policy, London School of Economics and Political Science, United Kingdom Skaggs School of Pharmacy, University of California San Diego Camber Collective, Washington, DC AUTHOR CORRESPONDENCE: Emma M. Cousin, 1.206.779.7169; emc95@uw.edu 10 2025 31 10 497622 968 981 01 10 2025 01 10 2025 27 09 2025 01 10 2025 Copyright © 2025, Academy of Managed Care Pharmacy. All rights reserved. 2025 BACKGROUND: On or before November 1, 2025, the Centers for Medicare & Medicaid Services (CMS) will report the agreed-upon negotiated prices (maximum fair prices [MFPs]) for the second round of up to 15 Medicare Part D drugs selected for price negotiation (Initial Price Applicability Year 2027). OBJECTIVE: To propose guideline-recommended therapeutic alternatives and estimate price benchmarks that may be considered by CMS for negotiation. METHODS: We identified US Food and Drug Administration (FDA)–approved indications for the 15 drugs selected for negotiation. We used 2022 Medicare claims data to identify drug-specific beneficiary utilization. Medical claims with International Classification of Diseases, Tenth Revision, Clinical Modification RESULTS: Four drugs were identified to have 1 (deutetrabenazine, linaclotide, and nintedanib-esylate) or no (rifaximin) therapeutic alternative. Eight of the 15 selected drugs will have the ceiling price set by the minimum statutory discount. Four products (acalabrutinib, semaglutide, linagliptin, and sitagliptin/metformin) will include therapeutic alternatives and MFPs from the first round of negotiation. The selection of therapeutic alternatives and estimation of price benchmarks by CMS will set the initial conditions for subsequent price negotiation. CONCLUSIONS: These analyses identify the likely ceiling price and various initial price offer scenarios for the second round of Medicare price negotiation. We report price benchmarks and likely therapeutic alternatives to improve transparency around the opaque CMS negotiation process. Plain language summary Medicare is currently negotiating, for the second time, with pharmaceutical companies for 15 high-cost, single-source drugs. As part of negotiations, Medicare identifies therapeutic alternatives and compares the selected drug’s prices to the prices of therapeutic alternatives. In this article, we offer possible therapeutic alternatives and describe key price benchmarks that are used to inform negotiation. Implications for managed care pharmacy The maximum fair prices from the Medicare Drug Price Negotiation Program are likely to influence formulary designs and, ultimately, patient access. Our analyses provide transparency in the key factors and estimates considered in the negotiation program. Managed care professionals can leverage the details and results from our analyses in anticipation of the maximum fair prices, given that the negotiation process remains opaque. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Selected drugs, therapeutic alternatives, and price benchmarks for IPAY 2027 Medicare drug price negotiation",
    "Journal it was published in:": "Journal of Managed Care & Specialty Pharmacy",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12467749/"
  }
}