{
  "title": "Paper_199",
  "abstract": "pmc Transbound Emerg Dis Transbound Emerg Dis 4732 tbed TBED Transboundary and Emerging Diseases 1865-1674 1865-1682 Wiley PMC12488310 PMC12488310.1 12488310 12488310 41041650 10.1155/tbed/9954682 1 Research Article First Evidence of Spillover of Rocahepevirus ratti Yamaguchi Julie  1  2 https://orcid.org/0000-0002-4853-8518 Orf Gregory S.  1  2 https://orcid.org/0000-0002-5717-5181 Perez Lester J.  1  2 Phoompoung Pakpoom  2  3 Chirakarnjanakorn Srisakul  3 https://orcid.org/0000-0001-7324-1698 Suputtamongkol Yupin  2  3 https://orcid.org/0009-0000-8221-7905 Cloherty Gavin A.  1  2 https://orcid.org/0000-0003-0233-5819 Berg Michael G. michael.berg@abbott.com  1  2  1  2  3 Academic Editor: Xing-Yi Ge 2025 24 9 2025 2025 487092 9954682 16 4 2025 20 8 2025 5 9 2025 24 09 2025 02 10 2025 03 10 2025 Copyright © 2025 Julie Yamaguchi et al. Transboundary and Emerging Diseases published by John Wiley & Sons Ltd. 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the Creative Commons Attribution License, which permits use, distribution and reproduction in any medium, provided the original work is properly cited.  Rocahepevirus ratti Paslahepevirus balayani Rocahepevirus Niviventer Rattus Rocahepevirus Keywords next-generation sequencing Orthohepevirus C rat hepatitis E virus Rocahepevirus ratti Thailand virus discovery Abbott Laboratories The funding was provided by Abbott Laboratories through the Abbott Pandemic Defense Coalition Program. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Acute, food- or water-borne infections due to hepatitis A virus (HAV) and hepatitis E virus (HEV) are usually self-limiting but represent a significant burden of disease worldwide, with 1.5 and 20 million cases, respectively, annually [ 1 Paslahepevirus balayani Orthohepevirus A 2 Hepeviridae Avihepevirus Rocahepevirus Chirohepevirus 3 Rocahepevirus 4 5 6 7 10 Rocahepevirus 11 12 6 13 14 11 15 16 11 6 10 17 The clinical picture that has emerged is that immunosuppressed individuals (solid organ transplant recipients, cancer patients, those with underlying chronic disease such as diabetes or hypertension) are at greatest risk of infection [ 6 18 19 6 12 19 11 20 21 22 In the course of screening acute febrile illness (AFI) patients in Thailand, we detected rHEV in one of the patients by metagenomic sequencing (mNGS) and assembled the full genome. The patient's medical history and clinical presentation matched the profile for rHEV infection. We determined that this is the first recorded human case in Thailand. Furthermore, the genome clusters within a clade comprised of rat-hosted sequences from nearby Asian countries. 2. Materials and Methods 2.1. Study Cohort Patients were enrolled in a retrospective viral discovery project to evaluate causes of unresolved acute undifferentiated fever in Thailand. The study was approved by the Siriraj Institutional Review Board committee (COA Si.391/2021). Serum or plasma was collected from leftover specimens and stored at a temperature of −70°C. Patient 09869 presented with a fever and an unknown cause of hepatitis. Consent for this case report was waived by the Review Board committee. 2.2. Extraction of Nucleic Acids and Preparation of Libraries for Next-Generation Sequencing (NGS) Patient 09869 serum was treated with Benzonase (MilliporeSigma, Burlington, MA, USA) to deplete cell-free host nucleic acids, and then the remaining nucleic acids were extracted on a KingFisher Apex (ThermoFisher Scientific, Waltham, MA, USA). Metagenomic cDNA libraries were synthesized from total nucleic acids using SuperScriptIV and Sequenase v2.0 (ThermoFisher Scientific, Waltham, MA, USA) and barcoded using an Illumina Nextera XT v2 library prep kit (Illumina, Inc., San Diego, CA, USA) and unique dual index IDT-Nextera adapters (Integrated DNA Technologies, Coralville, IA, USA). Metagenomic (mNGS) libraries were sequenced by Azenta Life Sciences (Burlington, MA, USA). 2.3. Target Enrichment of mNGS Libraries Sets of 24 mNGS libraries were pooled for enrichment of viral sequences using the Comprehensive Viral Research Panel (CVRP, Twist Biosciences, South San Francisco, CA, USA), composed of over 1M unique probes covering reference sequences for 3153 viruses, including 15,488 different strains, as previously described [ 23 24 2.4. RT-PCR and SMART-PCR to Fill Gaps Remaining in the Genome After mNGS and CVRP teNGS Two approaches were used to fill three large gaps in the genome following NGS. Standard RT-PCR1 and PCR2 amplification of gap 1 (G1-F1: CAGGGGCTWGAYAATTGGAC, G1-R1: ARCATCTCCAAAAGGACCCTCT, G1-F2: MTTACAGGCTGCYTRTTTGAGGC, G1-R2: CCGYGGRGGGTCARGGGCCA); gap 2 (G2-F1: CAGAGGGTCCTTTTGGAGAT, G2-R1: CGCATRACCTCCACATCATCA, G2-F2: TACCAGAYGGYGCCGCAGT, G2-R2: TCTCCTTRCCATACCTYCCCACA); and gap 3 (G3-F1: TCGGCTTGGTCTAAAACYCTTGT, G3-R1: TGGGCCACRATCCGCACAT, G3-F2: CCYTGTTTGGCCCTTGGTT, G3-R2: TGGACTGCGGCCAGAATGAC) were done at 50°C for 30 min, 98°C for 2 min, then 40 cycles of 98°C for 15 s, 58°C for 30 s, 72°C for 1 min, and 95°C for 10 min, then 40 cycles of 95°C for 15 s, 55°C for 30 s, and 72°C for 2 min, respectively, using the SuperScriptIV OneStep RT-PCR System (Invitrogen, Waltham, MA, USA) and AmpliTaq Gold DNA Polymerase (Applied Biosystems, Waltham, MA, USA). Sequences of all three fragments were obtained directly by Sanger sequencing on a 3130xL Genetic Analyzer (Applied Biosystems, Waltham, MA, USA) and edited using Sequencher PC Version 5.4.6 – Build 3767 software (Gene Codes Corp, Ann Arbor, MI, USA). SMART-PCR libraries were prepared in parallel to the standard PCR fragments using the SMART PCR method described previously [ 25 SMT-G4: AAGCAGTGGTATCAACGCAGAGTACAGAAAAACTAGACACTGTCGG). This approach is ideal for filling gaps and resolving genome termini, as it combines 5′ RACE with NGS to enable cDNA synthesis of transcripts with defined 3′ but variable 5′ ends. cDNA libraries were amplified using primers complementary to SMART tags affixed to the ends of the inserts. The PCR fragments and SMART PCR libraries were barcoded using both an Illumina Nextera XT v2 library prep kit with IDT-Nextera adapters and a SparQ DNA Frag and Library Prep Kit (QuantaBio, Beverly, MA, USA) with QuantaBio-TruSeq adapters. Libraries were assessed, diluted, and loaded on a MiSeq System (Illumina) according to manufacturer recommendations. rHEV reads were mapped and assembled using the CLC Genomics Workbench (Qiagen Corp, Germantown, MD, USA). 2.5. Sequence Comparisons and Phylogenetic Tree Construction All nucleotide sequences belonging to the family Hepeviridae Piscihepevirus Hepeviridae Hepeviridae Due to the variable levels of coverage in the 5′ and 3′ untranslated regions in the dataset, the genomes were aligned using the L-INS-i algorithm implemented in MAFFT v.7.487 [ 26 27 24 2.6. Principal Component Analysis (PCA) To further interrogate the molecular sequences and uncover potential signatures linked to host-viral interactions, we conducted an in-depth analysis focusing on the relationships between different hosts identified for Rocahepevirus ratti 28 29 3. Results While exploring cases in Thailand with AFI by NGS, we detected the presence of reads corresponding to rodent HEV, or Rocahepevirus Figure 1 Figure 1 30 We first reviewed the clinical history to determine whether this individual was at risk for infection and whether the symptoms exhibited were consistent with what has been recently learned about rHEV ( Figure 2 He was admitted to Siriraj Hospital in Bangkok on September 22, 2019, due to watery diarrhea and fatigue lasting 6 days. His medications included prednisolone 10 mg/day, mycophenolate 1.5 g/day, tacrolimus 1 mg/day, itraconazole 200 mg/day, and simvastatin 10 mg/day. He denied alcohol drinking, herbal use, and eating uncooked food. Physical examination revealed that he was afebrile and mildly dehydrated. On the day of admission, his complete blood count levels were relatively normal: Hb: 12.9 g/dL, Hct: 39.1%, WBC: 6360 cells/mm 3 N L 3 Table 1 Salmonella Leptospira spp Rickettsia typhi Orientia tsusugamushi Salmonella Renal function tests returned to baseline after 2 weeks of drug discontinuation. Despite improvement in liver function tests in October 2019 and withdrawal of all suspected culprit drugs, the patient continued to exhibit chronic active hepatitis ( Table 1 Figure 2 Next, to understand phylogenetically where this new sequence is positioned among Rocahepeviruses, we analyzed it in the context of previously reported strains in the Orthohepevirinae Paslahepevirus Avihepevirus Rocahepevirus Chirohepevirus Figure 3 R. ratti Rocahepevirus Figure 3 R. ratti 10 Figure 3 Figure 3 Patient Ma617-09869 appears to be the first human case in a clade where all the remaining sequences were obtained from rats ( Figure 3 Maxomys surifer MT085259 MT085260 Inspection of multiple sequence alignments did not reveal any obvious amino acid changes that might explain the jump from rats to humans. As an alternate approach, we performed a PCA of nucleotide sequences to gauge the evolutionary distance of Ma617-09869 and other human sequences from those obtained in other host species. Applying the Temura–Nei substitution model, which relates evolutionary rates, transitions vs. transversions, etc., and grouping sequences according to host using the PCO software, we mapped ORFs 1-3 in three-dimensional space. The first observation was that each open reading frame from a given host clustered together, indicating that the unique molecular signature acquired within the host was shared throughout the genome and unlikely to be altered by recombination. Given the wide distance of Niviventer niviventer R. ratti Rattus rattus Figure 4 Niviventer niviventer Rattus rattus Figure 4 versus 4. Discussion  Rocahepevirus 14 6 14 31 6 The larger question is whether rHEV poses a danger to the broader population. Thus far, the majority of human cases have been detected in China, with 17 from Hong Kong, six from Yunnan, and one from Hainan [ 13 14 32 33 34 35 36 19 37 38 39 22 40 41 Ma617-09869 branches with rat-only sequences from Southeast Asia and shares ~80% nt identity with other human strains in genotype C1 (Figures 1 3 42 R. ratti Our PCA indicated that Niviventer Figure 4 OP947208 43 44 45 Suncus marinus 46 Rattus rattus 11 47 48 The need for sensitive and specific diagnostics to have a true understanding of seroprevalence and to detect viremia has been stressed repeatedly [ 36 36 49 50 11 32 51 3 11 Acknowledgments The authors thank Dr. Todd Meyer and Dr. Mary Rodgers for bioinformatic and logistical support, respectively. Data Availability Statement The Rocahepevirus Disclosure Abbott Laboratories did not have any role in the study design, data collection and analysis, preparation of the manuscript, or decision to publish. Conflicts of Interest Julie Yamaguchi, Gregory S. Orf, Lester J. Perez, Gavin A. Cloherty, and Michael G. Berg are all Abbott Laboratories employees and shareholders. Yupin Suputtamongkol and Pakpoom Phoompoung receive funding from the Abbott Laboratories. Author Contributions Conceptualization: Julie Yamaguchi, Gregory S. Orf, Lester J. Perez, and Michael G. Berg. Data curation: Julie Yamaguchi, Gregory S. Orf, Lester J. Perez, and Michael G. Berg. Formal analysis: Gregory S. Orf and Lester J. Perez. Funding acquisition: Yupin Suputtamongkol and Gavin A. Cloherty. Investigation: Pakpoom Phoompoung, Srisakul Chirakarnjanakorn, and Yupin Suputtamongkol. Methodology: Julie Yamaguchi, Gregory S. Orf, and Lester J. Perez. Project administration: Michael G. Berg. Resources: Yupin Suputtamongkol and Gavin A. Cloherty. Software: Gavin A. Cloherty and Lester J. Perez. Supervision: Michael G. Berg and Gavin A. Cloherty. Visualization: Gregory S. Orf. Writing – original draft: Julie Yamaguchi, Gregory S. Orf, Lester J. Perez, and Michael G. Berg. Writing – review and editing: Julie Yamaguchi, Gregory S. Orf, Lester J. Perez, Pakpoom Phoompoung, Srisakul Chirakarnjanakorn, Yupin Suputtamongkol, Gavin A. Cloherty, and Michael G. Berg. Julie Yamaguchi and Gregory S. Orf are the co-first authors. 1 Gabrielli F. Alberti F. Russo C. Treatment Options for Hepatitis A and E: A Non-Systematic Review Viruses 2023 15 5 10.3390/v15051080 1080 PMC10221699 37243166 2 Purdy M. A. Drexler J. F. Meng X.-J. ICTV Virus Taxonomy Profile: Hepeviridae 2022 Journal of General Virology 2022 103 9 10.1099/jgv.0.001778 36170152 3 Smith D. B. Simmonds P. Emerson S. U. Consensus Proposals for Classification of the Family Hepeviridae Journal of General Virology 2014 95 10 2223 2232 10.1099/vir.0.068429-0 2-s2.0-84907211274 24989172 PMC4165930 4 Johne R. Heckel G. Plenge-Bonig A. Novel Hepatitis E Virus Genotype in Norway Rats, Germany Emerging Infectious Diseases 2010 16 9 1452 1455 10.3201/eid1609.100444 2-s2.0-77956032005 20735931 PMC3294985 5 Ryll R. Bernstein S. Heuser E. Detection of Rat Hepatitis E Virus in Wild Norway Rats ( Rattus norvegicus Rattus rattus Veterinary Microbiology 2017 208 58 68 10.1016/j.vetmic.2017.07.001 2-s2.0-85025078430 28888650 6 Benavent S. Carlos S. Reina G.  Rocahepevirus ratti Microorganisms 2023 11 12 10.3390/microorganisms11122996 2996 PMC10745784 38138140 7 Bai H. Li W. Guan D. Characterization of a Novel Rat Hepatitis E Virus Isolated From an Asian Musk Shrew ( Suncus murinus Viruses 2020 12 7 10.3390/v12070715 715 PMC7411586 32630296 8 Lanszki Z. Kurucz K. Zeghbib S. Identification of Hepatitis E Virus in the Feces of Red Foxes ( Vulpes vulpes Animals 2020 10 10 10.3390/ani10101841 1841 PMC7601027 33050408 9 Ryll R. Heckel G. Corman V. M. Drexler J. F. Ulrich R. G. Genomic and Spatial Variability of a European Common Vole Hepevirus Archives of Virology 2019 164 11 2671 2682 10.1007/s00705-019-04347-1 2-s2.0-85070331514 31399875 10 Reuter G. Boros A. Pankovics P. Review of Hepatitis E Virus in Rats: Evident Risk of Species Orthohepevirus C to Human Zoonotic Infection and Disease Viruses 2020 12 10 10.3390/v12101148 1148 PMC7600399 33050353 11 Sridhar S. Yip C. C. Y. Wu S. Rat Hepatitis E Virus as Cause of Persistent Hepatitis After Liver Transplant Emerging Infectious Diseases 2018 24 12 2241 2250 10.3201/eid2412.180937 2-s2.0-85056699274 30457530 PMC6256372 12 Sridhar S. Yip C. C. Wu S. Transmission of Rat Hepatitis E Virus Infection to Humans in Hong Kong: A Clinical and Epidemiological Analysis Hepatology 2021 73 1 10 22 10.1002/hep.31138 31960460 13 Wu H. Zhou L. Wang F. Chen Z. Lu Y. Molecular Epidemiology and Phylogeny of the Emerging Zoonotic Virus Rocahepevirus: A Global Genetic Analysis Infection Genetics and Evolution 2024 118 10.1016/j.meegid.2024.105557 105557 38244748 14 Sridhar S. Yip C. C. Y. Lo K. H. Y. Hepatitis E Virus Species C Infection in Humans, Hong Kong Clinical Infectious Diseases 2022 75 2 288 296 10.1093/cid/ciab919 34718428 15 Jirintai S. Tanggis Mulyanto Rat Hepatitis E Virus Derived From Wild Rats ( Rattus rattus Virus Research 2014 185 92 102 10.1016/j.virusres.2014.03.002 2-s2.0-84898846846 24631787 16 Schemmerer M. Erl M. Wenzel J. J. HuH-7-Lunet BLR Cells Propagate Rat Hepatitis E Virus (HEV) in a Cell Culture System Optimized for HEV Viruses 2022 14 5 10.3390/v14051116 1116 PMC9147593 35632857 17 Caballero-Gomez J. Casares-Jimenez M. Gallo-Marin M. Rat Hepatitis E Virus as an Aetiological Agent of Acute Hepatitis of Unknown Origin Journal of Hepatology 2025 83 3 662 669 40020930 10.1016/j.jhep.2025.02.027 18 Andonov A. Robbins M. Borlang J. Rat Hepatitis E Virus Linked to Severe Acute Hepatitis in an Immunocompetent Patient The Journal of Infectious Diseases 2019 220 6 951 955 10.1093/infdis/jiz025 30649379 19 Rivero-Juarez A. Frias M. Perez A. B. Orthohepevirus C Infection as an Emerging Cause of Acute Hepatitis in Spain: First Report in Europe Journal of Hepatology 2022 77 2 326 331 10.1016/j.jhep.2022.01.028 35167911 20 Li T. C. Yoshizaki S. Ami Y. Suzaki Y. Johne R. Wakita T. No Evidence of Rat Hepatitis E Virus Excretion in Urine Samples of Rats Japanese Journal of Infectious Diseases 2017 70 3 305 307 10.7883/yoken.JJID.2016.283 2-s2.0-85019949534 27580584 21 Li W. Guan D. Su J. High Prevalence of Rat Hepatitis E Virus in Wild Rats in China Veterinary Microbiology 2013 165 3-4 275 280 10.1016/j.vetmic.2013.03.017 2-s2.0-84893010414 23623690 22 Caballero-Gomez J. Fajardo-Alonso T. Rios-Munoz L. National Survey of the Rat Hepatitis E Virus in Rodents in Spain, 2022 to 2023 Eurosurveillance 2025 30 12 10.2807/1560-7917.ES.2025.30.12.2400473 PMC11951417 40156345 23 Berg M. G. Olivo A. Forberg K. Advanced Molecular Surveillance Approaches for Characterization of Blood Borne Hepatitis Viruses PLoS ONE 2020 15 7 10.1371/journal.pone.0236046 e0236046 PMC7367454 32678844 24 Orf G. S. Ahouidi A. D. Mata M. Next-Generation Sequencing Survey of Acute Febrile Illness in Senegal (2020–2022) Frontiers in Microbiology 2024 15 10.3389/fmicb.2024.1362714 1362714 PMC11037400 38655084 25 Berg M. G. Yamaguchi J. Alessandri-Gradt E. Tell R. W. Plantier J. C. Brennan C. A. A Pan-HIV Strategy for Complete Genome Sequencing Journal of Clinical Microbiology 2016 54 4 868 882 10.1128/JCM.02479-15 2-s2.0-84962615411 26699702 PMC4809961 26 Katoh K. Standley D. M. MAFFT Multiple Sequence Alignment Software Version 7: Improvements in Performance and Usability Molecular Biology and Evolution 2013 30 4 772 780 10.1093/molbev/mst010 2-s2.0-84875619226 23329690 PMC3603318 27 Minh B. Q. Schmidt H. A. Chernomor O. IQ-TREE 2: New Models and Efficient Methods for Phylogenetic Inference in the Genomic Era Molecular Biology and Evolution 2020 37 5 1530 1534 10.1093/molbev/msaa015 32011700 PMC7182206 28 Perez L. J. de Arce H. D. Cortey M. Phylogenetic Networks to Study the Origin and Evolution of Porcine Circovirus Type 2 (PCV2) in Cuba Veterinary Microbiology 2011 151 3-4 245 254 10.1016/j.vetmic.2011.03.022 2-s2.0-79960157673 21507587 29 Anderson M. J. Willis T. J. Canonical Analysis of Principal Coordinates: A Useful Method of Constrained Ordination for Ecology Ecology 2003 84 2 511 525 10.1890/0012-9658(2003)084[0511:CAOPCA]2.0.CO;2 2-s2.0-0042815050 30 Ding Q. Hu B. Yao X. Prevalence and Molecular Characterization of Hepatitis E Virus (HEV) From Wild Rodents in Hubei Province, China Infection, Genetics and Evolution 2024 121 10.1016/j.meegid.2024.105602 105602 38734397 31 NIDDKD Diseases NIoDaDaK https://www.niddk.nih.gov/health-information/liver-disease/hepatitis-e2024 32 Faber M. Wenzel J. J. Erl M. Stark K. Schemmerer M. No Evidence for Orthohepevirus C in Archived Human Samples in Germany, 2000–2020 Viruses 2022 14 4 10.3390/v14040742 742 PMC9029421 35458471 33 Parraud D. Lhomme S. Peron J. M. Rat Hepatitis E Virus: Presence in Humans in South-Western France? Frontiers in Medicine 2021 8 10.3389/fmed.2021.726363 726363 PMC8448288 34540871 34 Mueller L. J. Schmidt M. L. Ciesek S. Corman V. M. Berlin/Frankfurt/Munich Group for the Study of Rat HEV. Presence but Low Detection Rate of Rat Hepatitis E Virus in Patients in Germany 2022–2024 Journal of Hepatology 2025 83 3 e146 e148 10.1016/j.jhep.2025.05.023 40482720 35 Caballero-Gomez J. Pereira S. Rivero-Calle I. Acute Hepatitis in Children Due to Rat Hepatitis E Virus The Journal of Pediatrics 2024 273 10.1016/j.jpeds.2024.114125 114125 38815747 36 Situ J. Hon-Yin Lo K. Cai J. P. An Immunoassay System to Investigate Epidemiology of Rocahepevirus ratti JHEP Reports 2023 5 9 10.1016/j.jhepr.2023.100793 100793 PMC10415708 37575885 37 Casares-Jimenez M. Rivero-Juarez A. Lopez-Lopez P. Rat Hepatitis E Virus ( Rocahepevirus ratti Emerging Microbes & Infections 2024 13 1 10.1080/22221751.2023.2295389 2295389 PMC10763910 38095070 38 Casares-Jimenez M. Corona-Mata D. Garcia-Garcia T. Serological and Molecular Survey of Rat Hepatitis E Virus ( Rocahepevirus ratti Emerging Microbes & Infections 2024 13 1 10.1080/22221751.2024.2396865 2396865 PMC11376293 39193634 39 Johne R. Dremsek P. Kindler E. Rat Hepatitis E Virus: Geographical Clustering Within Germany and Serological Detection in Wild Norway Rats ( Rattus norvegicus Infection, Genetics and Evolution 2012 12 5 947 956 10.1016/j.meegid.2012.02.021 2-s2.0-84860369627 22554648 40 Yadav K. K. Boley P. A. Lee C. M. Rat Hepatitis E Virus Cross-Species Infection and Transmission in Pigs PNAS Nexus 2024 3 7 10.1093/pnasnexus/pgae259 259 PMC11259135 39035038 41 Rios-Munoz L. Gonzalvez M. Caballero-Gomez J. Detection of Rat Hepatitis E Virus in Pigs, Spain, 2023 Emerging Infectious Diseases 2024 30 4 823 826 10.3201/eid3004.231629 38526410 PMC10977822 42 Hon-Yin Lo K. Stanley Ho S. F. Hon-Kiu Shun E. Enhanced Surveillance, Subtyping, and Host Adaptation Analysis Reveal Genotype-Wide Zoonotic Potential of Rat Hepatitis E Virus Journal of Hepatology 2025 10.1016/j.jhep.2025.07.004 40669520 43 Kawashima I. Y. Lopez M. C. N. Cunha M. D. P. Hashimoto R. F. SARS-CoV-2 Host Prediction Based on Virus-Host Genetic Features Scientific Reports 2022 12 1 10.1038/s41598-022-08350-6 4576 PMC8930995 35301337 44 Tseng K. K. Koehler H. Becker D. J. Viral Genomic Features Predict Orthopoxvirus Reservoir Hosts Communications Biology 2025 8 1 10.1038/s42003-025-07746-0 309 PMC11862092 40000824 45 Perez L. J. Forberg K. Cloherty G. A. Berg M. G. Temporal and Coevolutionary Analyses Reveal the Events Driving the Emergence and Circulation of Human Mamastroviruses Emerging Microbes & Infections 2023 12 1 10.1080/22221751.2023.2217942 2217942 PMC10262812 37222427 46 Guan D. Li W. Su J. Asian Musk Shrew as a Reservoir of Rat Hepatitis E Virus, China Emerging Infectious Diseases 2013 19 8 1341 1343 10.3201/eid1908.130069 2-s2.0-84880723529 23876489 PMC3739524 47 Liu J. Liu Y. Shan C. Role of Mutational Reversions and Fitness Restoration in Zika Virus Spread to the Americas Nature Communications 2021 12 1 10.1038/s41467-020-20747-3 595 PMC7838395 33500409 48 Tsetsarkin K. A. Weaver S. C. Sequential Adaptive Mutations Enhance Efficient Vector Switching by Chikungunya Virus and Its Epidemic Emergence PLoS Pathogens 2011 7 12 10.1371/journal.ppat.1002412 2-s2.0-84855289560 e1002412 PMC3234230 22174678 49 Chen Z. Li G. Situ J. Redeveloping Antigen Detection Kits for the Diagnosis of Rat Hepatitis E Virus Journal of Clinical Microbiology 2023 61 12 10.1128/jcm.00710-23 e0071023 PMC10729709 38038482 50 Johne R. Plenge-Bonig A. Hess M. Ulrich R. G. Reetz J. Schielke A. Detection of a Novel Hepatitis E-Like Virus in Faeces of Wild Rats Using a Nested Broad-Spectrum RT-PCR Journal of General Virology 2010 91 3 750 758 10.1099/vir.0.016584-0 2-s2.0-76849108451 19889929 51 Rodriguez C. Marchand S. Sessa A. Cappy P. Pawlotsky J.-M. Orthohepevirus C Hepatitis, an Underdiagnosed Disease? Journal of Hepatology 2023 79 1 e39 e41 10.1016/j.jhep.2023.02.008 36806365 Figure 1  Rocahepevirus Rocahepevirus Figure 2 Clinical course for patient 09689 following heart transplantation. Magenta circles highlight the timeline of events and corresponding LFT results in 2019. Blue bar indicates the duration of trimethoprim/sulfamethoxazole and acyclovir administration, and the purple bar indicates itraconazole/simvastatin and ceftriaxone taken as an in-patient. Red arrows depict increases in liver function tests (pink intervals in LFT graphs indicate normal ranges; Table 1 Figure 3 Taxonomic classification of the Rocahepevirus Rocahepevirus Rocahepevirus ratti Figure 4 Principal component analysis (PCA) for ORF1-3 of Rocahepevirus ratti Rocahepevirus Table 1 The following table shows abnormal liver function test results before and after admission. Liver function test Reference range June 23, July 9, August 6, September 2, September 10, September 22, September 25, October 1, October 21, November 2, 2019 March 3, 2020 August 3, 2020 December 14, 2020 July 13, 2021 TB 0–1.2 mg/dL 0.81 1.11 0.74 0.78 0.7 0.87 0.54 0.61 0.91 1.22 a 0.54 0.97 1.17 0.62 DB 0–0.3 mg/dL 0.52 a 0.79 a 0.39 a 0.36 a 0.3 0.42 a 0.28 0.19 0.42 a 1.01 a 0.12 0.55 a 0.79 a 0.36 a AST 5–40 U/L 29 30 46 a 69 a 69 a 278 a 449 a 156 a 40 43 a 86 a 214 a 195 a 54 a ALT 5–41 U/L 21 58 a 82 a 80 a 74 a 125 a 263 a 222 a 36 36 62 a 125 a 77 a 75 a ALP 40–129 IU/L 129 148 a 248 a 204 a 237 a 184 a 301 a 366 a 252 a 303 a 127 139 a 155 a 122 Alb 3.2–4.5 g/dL — 2.9 a 3.9 3.9 3.7 3.3 3 a 3.8 3.5 3.3 3.9 3.6 3 a 3.9 Glo 2.0–3.5 g/dL — 2.4 2.8 2.7 2.8 2.7 2.5 2.6 3.1 3.5 2.9 3.3 3.4 3.1 Mgmt — Baseline: day of transplant — — D/C acyclovir, cotrimoxazole — D/C — — — — — — — — Abbreviations: Alb, albumin; ALP, alkaline phosphatase; ALT, alanine transaminase; AST, aspartate transaminase; DB, direct bilirubin; Glo, globulin; TB, total bilirubin.  a ",
  "metadata": {
    "Title of this paper": "Orthohepevirus C Hepatitis, an Underdiagnosed Disease?",
    "Journal it was published in:": "Transboundary and Emerging Diseases",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488310/"
  }
}