{
  "title": "Paper_1078",
  "abstract": "pmc Diagnostics (Basel) Diagnostics (Basel) 2841 diagno diagnostics Diagnostics 2075-4418 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468805 PMC12468805.1 12468805 12468805 41008741 10.3390/diagnostics15182369 diagnostics-15-02369 1 Review Monitoring the Biological Impact and Therapeutic Potential of Intermittent Fasting in Oncology: Assessing Strategies and Clinical Translational Challenges https://orcid.org/0009-0000-4900-9549 Bendykowska Maria 1 * https://orcid.org/0000-0002-4325-8971 Gromadzka Grażyna 2 * 1 2 * marysiia.bendykowska@gmail.com gragrom@gmx.com 18 9 2025 9 2025 15 18 497628 2369 13 6 2025 21 7 2025 14 8 2025 18 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background: Objective: Results: Conclusions: intermittent fasting oncology biomarkers immunophenotyping autophagy metabolic reprogramming oxidative stress gut microbiome 18F-FDG PET diagnostics precision This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Malignant tumors remain one of the leading causes of death worldwide, despite significant advances in oncological therapies such as targeted therapy, immunotherapy, and personalized chemotherapy regimens. The effectiveness of treatment is still often limited by the biological complexity of tumors, the resistance of cancer cells to treatment, and the systemic toxicity of therapies to normal tissues. In this context, the importance of supportive interventions that can improve treatment outcomes and the quality of life of patients is growing. Global cancer statistics 2024: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries [ 1 IF includes a range of dietary patterns based on cyclical caloric restriction—from short-term, single fasting (8–24 h) [ 2 3 4 Figure 1 The mechanisms of action of IF are multifaceted and include modifications in glucose–insulin metabolism, a reduction in insulin-like growth factor 1 (IGF-1) levels, activation of autophagy, and regulation of inflammatory and immune responses. These molecular changes not only inhibit cancer cell proliferation but also contribute to the phenomenon of differential stress resistance (DSR). DSR refers to the selective protection of healthy cells and increased vulnerability of cancer cells under conditions of nutrient deprivation, enhancing the efficacy and safety of chemotherapy [ 5 6 2. Materials and Methods The aim of this study is to review biomarkers that can be used to monitor the safety of IF and can help assess the impact of IF on cancer treatment. Particular attention is paid to metabolic biomarkers (such as IGF-1, glucose, insulin) and immunological biomarkers (inflammatory cytokines, CRP (C-reactive protein)). Biomarkers useful in assessing the impact of IF on the severity of oxidative stress, autophagy, and the gut microbiome are also presented. This study aimed to assess the clinical usefulness of IF as a complementary treatment for oncological treatment, identify optimal methods for monitoring patients’ condition during IF, and assess the effectiveness of IF. It also identifies directions for further research on the integration of dietary strategies with modern oncology. A search for relevant articles was conducted in PubMed/Medline, Science Direct, Scopus, Willy Online Library, and Google Scholar, combining free-text and MeSH terms using a wide range of synonyms and related terms, including “intermittent fasting”; “oncology”; “biomarkers”; “immunophenotyping”; “autophagy”; “metabolic repro-gramming”; “gut microbiome”; “18F-FDG PET”; “diagnostics”; “monitoring”; “in-flammation”; “oxidative stress”; “precision medicine”, and others, as well as their combinations. Search criteria also included original research articles and review studies in humans or animal models related to cancer. This research included articles published up to May 2025. 3. Intermittent Fasting and Oncology 3.1. The Idea of Intermittent Fasting in Oncology IF is a dietary strategy involving scheduled periods of reduced or eliminated caloric intake, interspersed with normal feeding intervals [ 2 3 7 3 8 3.2. Molecular Mechanisms of Intermittent Fasting IF elicits complex cellular adaptations that enhance insulin sensitivity and reduce circulating levels of glucose and IGF-1 [ 3 8 8 9 10 A well-characterized anticancer mechanism of IF is DSR, wherein healthy cells enter a quiescent, cytoprotective state marked by activation of DNA repair and antioxidant pathways, while cancer cells—metabolically inflexible—remain vulnerable to chemotherapy-induced cytotoxicity [ 5 11 12 13 3.3. Potential IF Impact on Cancer Therapy Tolerance and Efficacy In addition to the cytostatic effects, IF may reduce the toxicity associated with anticancer therapies. Clinical observations and early-phase trials have demonstrated that short-term fasting—typically lasting 24 to 72 h prior to chemotherapy—can alleviate treatment-related side effects, including fatigue, nausea, mucositis, neutropenia, and cardiotoxicity [ 14 15 16 4 14 15 16 16 Beyond metabolic and inflammatory modulation, IF also appears to influence the tumor immune microenvironment. Preclinical studies indicate that fasting enhances the infiltration of cytotoxic CD8 + 12 13 17 Together, these findings suggest that IF may not only mitigate the adverse effects of standard oncologic treatments but also improve their therapeutic efficacy by modulating both systemic metabolism and the tumor immune landscape. 3.4. Summary of Exisiting Clinical Evidence Although most available data are derived from preclinical studies, several well-designed clinical trials have begun to explore the application of IF in oncology. The most compelling results to date have been observed in studies on breast cancer, where IF protocols and fasting-mimicking diets (FMDs) have been associated with improved treatment tolerability and modulation of the tumor microenvironment through immunometabolic reprogramming. In the multicenter randomized DIRECT phase II trial, patients with breast cancer receiving neoadjuvant chemotherapy alongside an FMD experienced significantly reduced toxicity and improved treatment tolerance compared to controls [ 15 14 16 Parallel advances are emerging in colorectal cancer. Preliminary studies suggest that IF may modulate the composition of the gut microbiota; however, human data remain limited to small observational studies. Preclinical models have shown that IF can enrich beneficial microbial populations associated with antitumor immunity and reduce microbial drivers of inflammation. These changes were accompanied by a decrease in tumor-associated macrophages and MDSCs, which are commonly implicated in immune evasion and tumor progression. Furthermore, IF promoted metabolic reprogramming in B cells, enhancing their capacity for antigen presentation and supporting a more robust antitumor immune response [ 18 19 19 20 21 In prostate cancer, preclinical data suggest that IF mitigates age-related prostatic hyperplasia in animal models through activation of autophagic pathways and reduction of oxidative stress. These findings support the hypothesis that IF may regulate prostatic cell proliferation and inflammation through autophagy modulation [ 22 In liver cancer, a study investigating Ramadan fasting revealed activation of metabolic signaling pathways, reduced systemic inflammation, and modulation of liver-resident immune cell activity, suggesting that even religious forms of fasting may exert protective immunometabolic effects within the hepatic tumor microenvironment [ 23 Equally promising are findings in pancreatic cancer, a particularly aggressive malignancy. A preclinical study by Antunes et al. (2018) demonstrated that IF enhanced the uptake of a chemotherapeutic agent by increasing expression of a specific transporter protein, leading to a reduction in tumor volume by more than 40%, thus illustrating a synergistic effect between metabolic intervention and chemotherapy [ 10 In summary, these findings highlight the growing interest in IF as a low-cost, biologically active intervention with the potential to support oncologic outcomes across multiple tumor types. By modulating both systemic metabolism and the local tumor microenvironment, IF may offer therapeutic benefits beyond those observed in breast cancer, with emerging evidence suggesting promise in colorectal, prostate, liver, and pancreatic malignancies. 3.5. Potential Risks and Safety Considerations Despite its potential, IF carries certain risks, particularly in malnourished, cachectic, or frail patients. Prolonged caloric restriction may exacerbate sarcopenia and impair immune function. Patients with severe hepatic dysfunction, uncontrolled diabetes, or cancer-related cachexia require strict supervision due to potential metabolic instability. This vulnerability stems from the need for adequate metabolic flexibility during fasting, especially with regard to gluconeogenesis and ketogenesis, and from the risk of dangerous fluctuations in blood glucose levels, including hypoglycemia and ketoacidosis [ 24 Fasting is also contraindicated during pregnancy, when both maternal and fetal metabolic demands are increased and continuous nutrient intake is essential for proper development. It is likewise unsuitable for individuals with a history of eating disorders or those with a body mass index below 18.5, due to the heightened risk of nutritional deterioration or relapse of disordered eating behaviors [ 8 25 3.6. Need for Diagnostic Tools to Monitor IF Response To ensure IF’s implementation is safe and effective, it must be monitored using appropriate monitoring biomarkers. There is a growing interest in tracking metabolic, inflammatory, and immunological responses through biomarkers such as IGF-1, CRP, IL-6, LC3, and Beclin-1, as well as assessing changes in gut microbiota composition or immune cell subsets using flow cytometry [ 26 27 28 29 30 31 3.7. Benefits of Using Variable Tools in Monitoring Intermittent Fasting The introduction of variable tools to monitor the effects of IF in oncological therapy brings a range of practical and clinical benefits. These tools not only allow for the assessment of the effectiveness of metabolic intervention but also increase the safety of the treatment by enabling better customization to the individual needs of the patient. The use of inflammatory parameters, such as IL-6, tumor necrosis factor alpha (TNF-α), and CRP, allows for a simple and rapid evaluation of whether IF effectively reduces chronic inflammation—a factor known to be involved in the initiation and progression of cancers [ 32 Equally important are metabolic tests, including the measurement of glucose, insulin, IGF-1, and insulin-like growth factor binding protein 3 (IGFBP-3) levels. A reduction in insulin axis activity and an increase in the concentration of IGF-binding proteins may indicate metabolic adaptation of the body, leading to the so-called DSR. This phenomenon supports the protection of healthy cells from chemotherapy toxicity while simultaneously increasing the sensitivity of cancer cells to treatment [ 4 5 PET and MRI imaging provide non-invasive information about morphological and functional changes within the tumor. A reduction in 18F-FDG uptake (PET) following IF may indicate decreased metabolic activity of cancer cells, while perfusion and necrotic changes observed in MRI can reflect an effective tumor response to therapy supported by metabolic intervention [ 30 31 Immunological tests, such as flow cytometry and cytokine measurements (Enzyme-Linked Immunosorbent Assay (ELISA), Luminex), allow assessment of immune system activation in response to IF [ 17 27 + 33 34 3.8. Monitoring Framework Theory A structured monitoring framework is essential for the safe and effective integration of IF into oncology. This framework must begin with a clear definition of monitoring objectives, which can be broadly categorized into: (i) Monitoring Basic Biological Effects The aim is to investigate the mechanistic underpinnings of IF, such as: modulation of insulin/IGF-1 signaling, reduction in oxidative stress, activation of autophagy and stress resistance pathways, immune system reprogramming, assessment of changes in the gut microbiome. This type of monitoring is primarily conducted in the preclinical or early translational setting and often relies on high-resolution, research-based technologies, including: single-cell RNA sequencing (scRNA-seq)—to examine cell-specific transcriptional responses, proteomics and metabolomics—to profile systemic biochemical changes, circulating tumor DNA (ctDNA)—to monitor early molecular dynamics. While these tools offer invaluable insight into IF’s mechanisms of action, their complexity, cost, and turnaround time currently limit their routine clinical application. (ii) Monitoring Clinical Treatment Response The second objective is to assess whether IF contributes to clinical benefits or safety risks, such as: improved response to chemotherapy or immunotherapy, reduced treatment-related toxicities, stabilization or regression of tumor burden, preservation of nutritional and functional status. This requires clinically applicable tools that are validated, accessible, and interpretable in real time, including: CRP and IL-6—systemic inflammation markers, fasting glucose, insulin, and ketone levels—metabolic status indicators, albumin and prealbumin—nutritional status markers, complete blood count (CBC)—hematologic safety, PET/ computed tomography (CT) imaging—to monitor changes in tumor metabolic activity and response. Importantly, the integration of both monitoring layers—mechanistic insight and clinical applicability—enables a more translationally relevant and patient-centered approach to IF research and implementation. 4. Monitoring the Effectiveness of Intermittent Fasting 4.1. Monitoring Basic Biological Effects 4.1.1. Modulation of Insulin/IGF-1 Signaling One of the principal metabolic pathways modulated by IF is the insulin/IGF-1 axis. This signaling cascade plays a central role in the regulation of cellular growth, proliferation, and survival and is frequently dysregulated in various malignancies. Elevated circulating levels of insulin and IGF-1 have been associated with increased tumorigenesis in several types of cancer, including breast, prostate, and colorectal cancers [ 35 36 IF has been shown to reduce circulating concentrations of insulin and IGF-1, thereby attenuating activation of the downstream PI3K/Akt/mTOR pathway, which is critically implicated in oncogenic processes [ 9 8 Modulation of this pathway can be monitored through measurement of fasting serum insulin, IGF-1, and IGFBP-3 levels, as well as by evaluating insulin resistance indices, such as the homeostatic model assessment for insulin resistance (HOMA-IR). In preclinical models, short-term fasting has led to reductions in IGF-1 levels of up to 50% within 48–72 h [ 37 14 Accordingly, biomarkers related to insulin/IGF-1 signaling may serve not only as indicators of IF efficacy but also as potential tools for treatment stratification and personalization. 4.1.2. Reduction in Oxidative Stress Oxidative stress, defined as an imbalance between the production of reactive oxygen species (ROS) and the capacity of antioxidant defense mechanisms, represents a critical factor in cancer initiation and progression. Malignant cells frequently exhibit elevated ROS levels, which contribute to DNA damage, genomic instability, and the promotion of angiogenesis. However, excessive oxidative stress may also render cancer cells susceptible to redox-modulating therapeutic strategies. IF has been associated with a reduction in oxidative stress, partly through the enhancement of mitochondrial function and the upregulation of endogenous antioxidant defenses, including superoxide dismutase and catalase. Simultaneously, IF appears to suppress pro-oxidant pathways, thereby promoting a more favorable redox balance. These effects are thought to be mediated by metabolic sensors and stress-response regulators such as AMP-activated protein kinase and nuclear factor erythroid 2-related factor 2 (Nrf2 or NFE2L2), which together facilitate cellular adaptation to metabolic challenges [ 38 To assess these effects, studies frequently utilize biomarkers of oxidative damage and antioxidant capacity. Commonly measured indicators include (1) circulating levels of parameters of oxidative damage to various cellular structures: (i) plasma prostaglandin F2α 8-epimer (8-iso-PGF2α) as a strong marker of oxidative damage to cell membranes; (ii) plasma 3-nitrotyrosine, as a marker of the oxidative modification of proteins; (iii) saliva 8-hydroxy-2′deoxyguanosine (8-OHdG), a product of oxidative DNA damage; (2) activity of small-molecule (e.g., glutathione, GSH) and large-molecule enzymatic antioxidants (for example, catalase (Cat), manganese-dependent superoxide dismutase (MnSOD), or glutathione peroxidase (GPx)) in peripheral blood cells; as well as (3) total antioxidant capacity (TAC). Across multiple investigations, IF protocols have been consistently associated with reductions in these markers, reflecting a systemic decrease in oxidative stress [ 38 Notably, IF may exert a dual effect: conferring protection to healthy tissues by attenuating oxidative damage while concurrently increasing oxidative pressure within cancer cells—a condition that may sensitize them to therapeutic interventions such as chemotherapy or radiotherapy. Accordingly, monitoring oxidative stress dynamics during IF may provide mechanistic insights and support the optimization of individualized oncologic treatment strategies. 4.1.3. Analysis of Activation of Autophagy and Stress Resistance Pathways Autophagy, a tightly regulated process of cellular component degradation, plays a critical role in maintaining cellular homeostasis and conferring resistance to stress. In oncology, autophagy exhibits a dual role: while it may promote tumor cell survival under stress conditions, excessive activation can lead to tumor cell death. Its role in carcinogenesis is context-dependent and varies according to the stage of tumor development [ 39 40 41 In the oncological setting, autophagy activation induced by IF may act synergistically with anticancer therapies, particularly chemotherapy and immunotherapy. IF also promotes autophagy through inhibition of the mTOR pathway and activation of AMP-activated protein kinase. In a study by Alirezaei et al. (2010), a 24 h fast led to increased levels of LC3, a widely recognized marker of autophagy activation, in murine neurons [ 42 43 Enhanced autophagy has been shown to increase the efficacy of chemotherapy and to promote immunogenic cell death in malignant cells [ 44 43 Nevertheless, clinical application of LC3 as a biomarker remains limited. Tumor biopsies rarely allow for standardized quantification of LC3 due to restricted tissue accessibility and variability. Moreover, the relationship between LC3-II levels in peripheral blood and intratumoral autophagic activity has not been conclusively established, limiting its utility in routine clinical settings [ 45 The interpretation of autophagy biomarkers such as LC3 and Beclin-1 presents additional challenges. For example, elevated LC3 levels may reflect either enhanced autophagy or impaired autophagic flux. Beclin-1 expression also varies across tumor types and conditions, which constrains its generalizability as a biomarker in cancer patients undergoing IF [ 41 43 Assessment of autophagy typically involves immunoblotting for markers such as LC3, Beclin-1, and p62 (Sequestosome-1), confocal microscopy for autophagosome visualization, and flow cytometry using fluorescent dyes such as Cyto-ID. Recently, in vivo imaging techniques employing fluorescent probes and two-photon microscopy have been developed to monitor autophagy dynamics in real time [ 46 4.1.4. Immune System Reprogramming IF influences numerous components of the immune system, affecting both innate and adaptive responses, thereby modulating the potential effectiveness of anticancer therapies. Preclinical studies have demonstrated activation of cytotoxic CD8 + + 12 17 47 In clinical settings, assessing the impact of IF on the immune system requires the use of advanced monitoring biomarkers. The most used techniques include flow cytometry—for quantitative analysis of T lymphocyte subpopulations (CD4 + + 27 48 49 50 27 48 49 In the future, immunological biomarkers may become an integral part of personalized oncology therapy involving IF. Monitoring these biomarkers before, during, and after treatment could not only provide information on the biological efficacy of the intervention but also help predict treatment response and risk of complications. 4.1.5. Assessing MDSC Dynamics in Response to Intermittent Fasting Given the emerging role of IF in modulating immune responses in cancer, immunophenotyping of peripheral blood cells has gained relevance as a translational monitoring tool. MDSCs, known for their immunosuppressive activity and tumor-promoting functions, represent a particularly relevant immune cell population affected by metabolic interventions. Flow cytometry-based identification and quantification of MDSC subpopulations provides a feasible and informative strategy for evaluating the immunomodulatory effects of IF in both preclinical and early clinical settings [ 48 A recommended flow cytometry panel to assess monocytic and granulocytic MDSCs in humans should include the following markers: CD33 + + − CD11b, CD14, CD15—to differentiate monocytic (M-MDSC) from granulocytic (PMN-MDSC; Polymorphonuclear MDSCs) subsets, lineage exclusion markers (e.g., CD3, CD19, CD56)—to improve specificity by gating out lymphoid populations, viability dye—to ensure accurate discrimination of live cells. This panel enables the identification of: M-MDSCs: CD11b + + − − PMN-MDSCs: CD11b + + − − Longitudinal analysis of circulating MDSCs before and after IF cycles may help evaluate immunological shifts associated with fasting regimens and predict treatment responsiveness, particularly in patients receiving immunotherapy. Importantly, MDSC monitoring can be implemented using peripheral blood mononuclear cells (PBMCs) and standardized gating strategies, making it suitable for early-phase clinical trials and mechanistic studies. Further integration of functional assays (e.g., arginase activity, ROS production) and cytokine profiling (e.g., IL-6, granulocyte-macrophage colony-stimulating factor [GM-CSF]) may complement the phenotypic characterization of MDSC activity and provide a more comprehensive picture of IF-induced immune modulation. Emerging preclinical and early clinical studies support the relevance of MDSC monitoring in the context of IF in oncology: Preclinical evidence (murine 4T1/4T07 breast cancer models) demonstrates that IF reduces splenic accumulation of granulocytic MDSCs (CD11b + + − + 18 Clinical pilot data from fasting-mimicking diet trials in cancer patients (e.g., breast and prostate cancer, phase I–II) report decreased circulating levels of MDSC-related cytokines (IL-6, chemokine (C-C motif) ligand 2 [CCL2], granulocyte colony-stimulating factor [G-CSF]), suggesting indirect modulation of MDSC expansion [ 17 These findings support the utility of incorporating MDSC profiling into IF studies using flow cytometry panels tailored to detect both monocytic and granulocytic subsets in translational settings. A brief summary of the preclinical evidence regarding IF-related MDSC modulation is presented in Table 1 4.1.6. Assessment of Changes in the Gut Microbiome The gut microbiota plays a crucial role in regulating immunity, metabolism, and response to anticancer therapy. Increasing evidence indicates that its composition can influence the efficacy of immunotherapy and modulate chronic inflammation that promotes tumorigenesis. Altered timing of nutrient intake—and thus circadian rhythm of digestion—affects gut bacterial activity and the production of beneficial metabolites, such as short-chain fatty acids like butyrate, which maintain intestinal epithelial integrity and suppress pro-inflammatory signaling pathways (e.g., NF-κB—Nuclear Factor kappa-light-chain-enhancer of activated B cells) [ 20 Akkermansia muciniphila Lactobacillus 20 Ruminococcaceae 29 20 34 4.2. Monitoring Clinical Treatment Response 4.2.1. Systemic Inflammation Markers Chronic inflammation is a characteristic feature of many cancers and plays a crucial role in carcinogenesis, tumor progression, and metastasis. Pro-inflammatory cytokines, such as IL-6, tumor necrosis factor-alpha (TNF-α), and CRP, serve not only as biomarkers of inflammation but also actively contribute to promoting a tumor-supportive microenvironment [ 51 However, not all studies confirm a definitive effect of IF on inflammatory markers. A systematic review conducted by Cienfuegos et al. (2023) indicates that the effects of IF on IL-6 and TNF-α levels are inconclusive, highlighting the need for further research in this area [ 52 Measurement methods typically include enzyme-linked immunosorbent assay (ELISA) techniques for quantitative analysis of cytokines in blood serum, as well as multiplex technologies (e.g., Luminex), which allow simultaneous measurement of multiple inflammatory markers. Monitoring the dynamics of changes in these biomarker concentrations can serve as a tool to evaluate the effectiveness of fasting in the immunomodulatory and anticancer context. Despite their widespread use, inflammatory biomarkers such as CRP, IL-6, and TNF-α suffer from limited specificity. These markers can be elevated due to various non-malignant conditions, including infections or autoimmune disorders, which reduce their diagnostic accuracy in oncology. In addition, many cytokines have a short half-life, making them highly sensitive to the timing of blood collection. Without standardized sampling times, fluctuations due to circadian rhythms or treatment-related stress may confound results. Moreover, these markers show significant inter-individual variability, making longitudinal tracking challenging [ 53 54 4.2.2. Metabolic Studies and Lipid Profile Metabolic disorders such as hyperinsulinemia, insulin resistance, and dyslipidemia are frequently observed not only as lifestyle-related conditions but also among cancer patients, where they are associated with poorer prognosis. IF positively influences metabolic parameters by reducing blood glucose and insulin levels, enhancing insulin sensitivity, and lowering circulating concentrations of IGF-1 [ 55 Sutton et al. (2018) reported improvements in HOMA-IR as well as reductions in fasting insulin and triglyceride levels in patients with insulin resistance without concomitant weight loss [ 3 2 Monitoring of metabolic changes typically includes fasting glucose measurements, oral glucose tolerance tests (OGTTs), glycated hemoglobin (HbA1c), and a comprehensive lipid panel (LDL, HDL, triglycerides, and total cholesterol). In the oncological context, concurrent assessment of IGF-1 and its primary binding protein IGFBP-1 provides additional insight into the activity of the IGF axis—a key regulator of carcinogenesis [ 37 The IGF axis plays a critical role in regulating cellular growth, differentiation, and survival. Its excessive activation promotes cancer cell proliferation, inhibits apoptosis, and increases the risk of malignant transformation—particularly in hormone-dependent tumors such as breast, prostate, and colorectal cancers [ 56 57 IF has been shown to modulate this signaling pathway by decreasing circulating IGF-1 levels, leading to downregulation of the PI3K/AKT/mTOR pathway, a central driver of tumor growth. Simultaneously, IF increases the levels of IGFBP-1, which binds IGF-1 and reduces its bioavailability, thereby attenuating pro-proliferative signaling [ 58 59 In human studies, adherence to an FMD for five days per month over three consecutive cycles resulted in a significant reduction in IGF-1 levels. These changes were associated with decreased inflammatory markers and improved metabolic parameters [ 37 Despite their utility, metabolic markers such as glucose, insulin, and IGF-1 are highly sensitive to external factors, including food intake, physical activity, circadian rhythms, and psychological stress. Moreover, the lack of standardization in IGF-1 assays complicates cross-study comparisons. Short-term fluctuations in these biomarkers may also fail to capture long-term metabolic remodeling, limiting their interpretability in clinical and research settings [ 60 4.2.3. Albumin and Prealbumin—Nutritional Status Markers Albumin and prealbumin are among the most commonly used laboratory indicators of nutritional status, which is particularly important in cancer patients undergoing meta-bolic interventions such as IF. Albumin, synthesized in the liver, has a relatively long half-life (around 21 days) and is generally considered a marker of chronic malnutrition. In contrast, prealbumin—also known as transthyretin—with a much shorter half-life (around 2 days), is more sensitive to acute changes in nutritional status. In several clinical studies assessing IF or FMD in oncology, albumin and prealbumin were monitored as indicators of nutritional safety. For example, Vernieri et al. (2022) re-ported that patients undergoing FMD did not exhibit significant reductions in albumin levels, suggesting metabolic tolerance and safety of short-term fasting [ 17 15 Thus, monitoring these markers serves a dual purpose: as markers of potential mal-nutrition risk in overly restrictive IF protocols, and as tools for assessing patient tolerance and adaptation to metabolic interventions. 4.2.4. Complete Blood Count—Hematologic Safety Complete blood count (CBC) is a routine and essential test used to evaluate hematologic safety in cancer patients, particularly when introducing dietary or metabolic interventions. It includes evaluation of white blood cells (WBCs), red blood cells (RBCs), hemoglobin, hematocrit, platelets, and indices such as mean corpuscular volume (MCV) and red cell distribution width (RDW). In the context of IF, particular attention is paid to WBC counts—especially neutrophils and platelets, as these parameters can indicate immunosuppression or treatment-related toxicity. Studies have explored the hematologic effects of IF. Safdie et al. (2009) reported that short-term fasting in patients undergoing chemotherapy may reduce myelosuppression and help preserve hematopoietic function. These findings were supported by subsequent research suggesting that IF may induce a DSR response, in which healthy hematopoietic cells enter a protective metabolic state, reducing susceptibility to chemotherapy-induced damage [ 4 However, in patients with preexisting cytopenia or those receiving intensive myelosuppressive therapy, IF protocols should be implemented with caution. Regular CBC monitoring is crucial to ensure safety and detect any decline in hematologic parameters [ 4 4.2.5. Imaging Using PET and MRI IF modulates several key biological processes in cancer cells, including energy metabolism, glucose uptake, angiogenesis, and proliferative signaling pathways. These effects create opportunities for evaluating IF-induced changes using advanced imaging modalities. Particularly relevant are positron emission tomography (PET) with the radiotracer 18F-FDG and MRI incorporating functional sequences that assess the tumor microenvironment [ 26 30 18F-FDG PET enables the assessment of tumor metabolic activity by quantifying glucose uptake. Due to the Warburg effect, cancer cells demonstrate elevated glucose consumption and overexpression of glucose transporters, such as glucose transporter type 1 (GLUT1). In the study by Weng et al. (2020), short-term fasting was shown to downregulate the expression of GLUT1, mTOR, and hypoxia-inducible factor 1-alpha (HIF-1α), leading to decreased FDG uptake in tumor cells. MicroPET/CT imaging confirmed a significant reduction in standardized uptake value (SUV) in mice with colorectal cancer following dietary restriction, indicating suppressed glycolytic activity and suggesting a favorable therapeutic effect of IF [ 26 MRI, especially diffusion-weighted imaging (DWI) and dynamic contrast-enhanced MRI (DCE-MRI), provides detailed insights into tumor morphology and microenvironmental features, including necrosis, hypoxia, and vascular permeability. These modalities enable the evaluation of IF-induced effects by detecting alterations in tumor perfusion or tissue response to reduced energy availability [ 30 61 Thus, imaging techniques such as PET and MRI, when performed before and after IF interventions, may serve as objective tools to assess the efficacy of adjuvant therapies aimed at modulating tumor metabolism. Despite their diagnostic utility, both PET and MRI have notable limitations. PET with 18F-FDG may yield false-positive results due to elevated glucose uptake in non-malignant processes such as inflammation or infection. Furthermore, its sensitivity varies by tumor type, potentially underestimating lesions with low glycolytic activity. Advanced MRI techniques such as DWI and DCE-MRI require cross-platform standardization and are susceptible to motion artifacts and operator-dependent variability. Additionally, both PET and MRI are resource-intensive and may not be universally accessible in routine clinical practice [ 26 30 A comparative overview of monitoring tools used to evaluate the effects of intermittent fasting in oncology is presented in Table 2 5. Clinical Decision Pathways To ensure patient safety and optimize therapeutic outcomes, IF regimens in oncology must be guided by dynamic clinical monitoring and decision-making pathways. Specific biomarker changes may necessitate a temporary pause, dose adjustment, or discontinuation of IF protocols. A clinical decision algorithm integrating key metabolic, hematological, and nutritional parameters is presented in Figure 2 Key triggers for intervention include: Severe hypoglycemia (e.g., blood glucose < 60 mg/dL): immediate IF discontinuation and nutritional intervention. Electrolyte imbalances (e.g., sodium < 130 or >150 mmol/L; potassium < 3.0 or >5.5 mmol/L): temporary IF pause; correction of electrolyte status; re-evaluation before resumption. Excessive weight loss or malnutrition (e.g., >5% body weight loss in <2 weeks; albumin < 3.0 g/dL): nutritional support, potential IF protocol modification. Elevated inflammatory markers (e.g., CRP > 3× baseline): consider treatment-related toxicity or infection; IF pause until clinical resolution. Cytopenias (e.g., absolute neutrophil count [ANC] < 1000/μL, platelets < 50,000/μL): assessment of bone marrow function and therapy impact; IF pause until recovery. Patient-reported symptoms (e.g., dizziness, syncope, fatigue): symptom-driven IF interruption; individualized reassessment. The algorithm promotes a personalized and responsive approach, incorporating clinical judgment, patient preferences, and evolving evidence. It underscores the importance of a multidisciplinary team, including oncologists, dietitians, and clinical researchers, in safely integrating IF into cancer care. 6. Technical Limitations Despite promising findings regarding the potential role of IF as an adjunct to oncological therapies, several technical limitations and challenges must be acknowledged when interpreting results and considering clinical implementation. First, methodological limitations may affect the accuracy of assessing IF-related effects. For instance, 16S rRNA gene sequencing, commonly used to analyze gut microbiota composition, lacks the resolution to distinguish functional capabilities of bacterial strains, thereby limiting comprehensive understanding of the microbiological mechanisms underpinning IF-induced effects. While metagenomic and metatranscriptomic approaches offer greater functional insight, they remain costly, data-intensive, and are not yet widely standardized for clinical use [ 52 Furthermore, the correlation between false-positive rates in 18F-FDG PET imaging and tumor type remains insufficiently characterized. Non-malignant processes such as inflammation, infection, and tissue repair can lead to increased glucose uptake and thus contribute to diagnostic ambiguity. This complicates the interpretation of PET scans in the context of IF, where metabolic shifts may occur both in cancerous and non-cancerous tissues [ 3 53 Another significant limitation is the heterogeneity of IF protocols employed across studies. Variations in fasting duration, caloric restriction intensity, and feeding window (ranging from time-restricted feeding of 8–24 h to periodic fasting over several days) may result in diverse biological responses, impeding comparability and the establishment of standardized clinical recommendations [ 2 25 Finally, the lack of validated, standardized monitoring tools and biomarkers hampers the routine clinical integration of IF. Although advanced imaging modalities such as PET and MRI, as well as metabolic and immunological biomarker profiling, hold promise for monitoring treatment response and safety, these approaches require further validation in large-scale clinical trials [ 53 54 For these reasons, both researchers and clinicians should interpret current evidence with caution. Future efforts should focus on the standardization of IF protocols, development of functional microbiome assays, and validation of dynamic biomarkers capable of capturing IF-induced metabolic, immunological, and oncological changes in a reliable and reproducible manner. 7. Summary IF represents a promising adjunctive strategy in oncological treatment, modulating a range of critical biological mechanisms—including glucose metabolism, immune function, inflammatory processes, and autophagy. In the context of cancer therapy, IF has demonstrated potential not only in limiting tumor growth and proliferation but also in reducing the toxicity associated with anticancer treatments, as evidenced by preclinical studies and preliminary clinical trials. Potential benefits, risks, and applications of IF in oncology are presented in Table 3 The implementation of advanced monitoring tools—such as assays for inflammatory and metabolic markers, immunological profiling, microbiome analysis, and functional imaging—facilitates precise and dynamic assessment of IF’s effects on cancer progression. These technologies enable both the objective evaluation of therapeutic efficacy and the adaptation of fasting protocols to an individual patient’s biological response. From a clinical standpoint, IF may enhance treatment tolerance, mitigate adverse effects, support the efficacy of immunotherapy, and improve overall quality of life. Emerging evidence also highlights its positive influence on patients’ subjective well-being, an important aspect of psychological support during cancer care. A comparative summary of IF’s potential benefits and risks in oncology is presented in Table 3 Importantly, the practical implementation of IF in oncological settings requires careful integration with personalized nutritional counseling, continuous medical supervision, and biomarker-driven monitoring. A structured monitoring framework—incorporating dynamic parameters such as cytokine levels, immune profiles, metabolic indicators, and advanced imaging—forms the basis for real-time, adaptive modulation of therapy guided by biological feedback. This approach, combining mechanistic insights with clinically actionable biomarkers, is crucial for the safe and effective clinical integration of IF. Despite encouraging preliminary results, the routine clinical application of IF still necessitates validation through large-scale, multicenter, randomized controlled trials with standardized protocols and rigorous safety assessments. Further research aimed at optimizing fasting regimens and combining them with specific therapeutic modalities will be essential for incorporating IF into evidence-based, personalized oncology. Ultimately, the integration of IF with modern diagnostic tools and anticancer therapies may become a key component of comprehensive, patient-centered cancer treatment. Acknowledgments While preparing this work, the authors used ChatGPT (GPT-4, OpenAI, https://chat.openai.com/ Disclaimer/Publisher’s Note: Author Contributions Conceptualization, M.B. and G.G.; methodology, M.B. and G.G.; formal analysis, M.B. and G.G.; investigation, M.B. and G.G.; resources, M.B. and G.G.; data curation, M.B. and G.G.; writing—original draft preparation, M.B. and G.G.; writing—review and editing, M.B. and G.G.; visualization, M.B. and G.G.; supervision, G.G.; project administration, M.B. and G.G.; All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement Not applicable. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: 18F-FDG PET 18F-fluorodeoxyglucose positron emission tomography ANC absolute neutrophil count CBC Complete blood count CCL2 chemokine (C-C motif) ligand 2 CRP C-reactive protein CTLA-4 cytotoxic T-lymphocyte antigen 4 DSR differential stress resistance DWI diffusion-weighted imaging ELISA Enzyme-Linked Immunosorbent Assay FMD fasting-mimicking diets G-CSF granulocyte colony-stimulating factor GLUT1 glucose transporter type 1 HDL high-density lipoprotein HLA-DR − Human Leukocyte Antigen—DR isotype/low HOMA-IR homeostatic model assessment for insulin resistance IF Intermittent fasting IFN-γ interferon gamma IGF-1 insulin-like growth factor 1 IGFBP-3 Insulin-like Growth Factor Binding Protein 3 IL-6 interleukin-6 LAG3 lymphocyte activation gene-3 LC3-II microtubule-associated protein 1 light chain 3 LDL low-density lipoprotein MCV Mean Corpuscular Volume MDSCs myeloid-derived suppressor cells MRI magnetic resonance imaging NK natural killer (cells) Nrf2 nuclear factor erythroid 2-related factor 2 OGTT oral glucose tolerance tests PD-1 programmed cell death protein 1 PMN-MDSC Polymorphonuclear MDSCs RBC red blood cells RDW red cell distribution width ROS reactive oxygen species SCFAs short-chain fatty acids TNF-α tumor necrosis factor alpha WBC white blood cells References 1. Siegel R.L. Miller K.D. Wagle N.S. Jemal A. Cancer Statistics, 2024 CA Cancer J. Clin. 2024 74 71 113 10.3322/caac.21820 38230766 2. Tinsley G.M. La Bounty P.M. Effects of Intermittent Fasting on Body Composition and Clinical Health Markers in Humans Nutr. Rev. 2015 73 661 674 10.1093/nutrit/nuv041 26374764 3. Sutton E.F. Beyl R. Early K.S. Cefalu W.T. Ravussin E. Peterson C.M. Early Time-Restricted Feeding Improves Insulin Sensitivity, Blood Pressure, and Oxidative Stress Even without Weight Loss in Men with Prediabetes Cell Metab. 2018 27 1212 1221.e3 10.1016/j.cmet.2018.04.010 29754952 PMC5990470 4. Safdie F.M. Dorff T. Quinn D. Fontana L. Wei M. Lee C. Cohen P. Longo V.D. Fasting and Cancer Treatment in Humans: A Case Series Report Aging 2009 1 988 1007 10.18632/aging.100114 20157582 PMC2815756 5. Raffaghello L. Lee C. Safdie F.M. Wei M. Madia F. Bianchi G. Longo V.D. Starvation-Dependent Differential Stress Resistance Protects Normal but Not Cancer Cells against High-Dose Chemotherapy Proc. Natl. Acad. Sci. USA 2008 105 8215 8220 10.1073/pnas.0708100105 18378900 PMC2448817 6. Aktas A. Thomas S. Barrett M. Sui J. Nutritional Interventions in Advanced Cancer: A Scoping Review Am. J. Hosp. Palliat. Med. 2025 10499091251335249 10.1177/10499091251335249 40275738 7. Fatima G. Mehdi A.A. Fedacko J. Hadi N. Fasting as Cancer Treatment: Myth or Breakthrough in Oncology Cureus 2025 17 e43671 10.7759/cureus.81395 40296920 PMC12035504 8. Longo V.D. Panda S. Fasting, Circadian Rhythms, and Time-Restricted Feeding in Healthy Lifespan Cell Metab. 2016 23 1048 1059 10.1016/j.cmet.2016.06.001 27304506 PMC5388543 9. Lee C. Raffaghello L. Brandhorst S. Safdie F.M. Bianchi G. Martin-Montalvo A. Pistoia V. Wei M. Hwang S. Merlino A. Fasting Cycles Retard Growth of Tumours and Sensitize a Range of Cancer Cell Types to Chemotherapy Sci. Transl. Med. 2012 4 124ra27 10.1126/scitranslmed.3003293 PMC3608686 22323820 10. Antunes F. Erustes A.G. Costa A.J. Nascimento A.C. Bincoletto C. Ureshino R.P. Pereira G.J.S. Smaili S.S. Autophagy and Intermittent Fasting: The Connection for Cancer Therapy? Clinics 2018 73 (Suppl. S1) e814s 10.6061/clinics/2018/e814s 30540126 PMC6257056 11. Bahrami A. Haghighi S. Moghani M.M. Khodakarim N. Hejazi E. Fasting mimicking diet during neo-adjuvant chemotherapy in breast cancer patients: A randomized controlled trial study Front. Nutr. 2024 11 1483707 10.3389/fnut.2024.1483707 39703333 PMC11656309 12. Di Biase S. Lee C. Brandhorst S. Manes B. Buono R. Cheng C.W. Cacciottolo M. Martin-Montalvo A. de Cabo R. Wei M. Fasting-Mimicking Diet Reduces HO-1 to Enhance T Cell-Mediated Tumour Cytotoxicity Cancer Cell 2016 30 136 146 10.1016/j.ccell.2016.06.005 27411588 PMC5388544 13. Kalam F. James D.L. Li Y.R. Coleman M.F. Kiesel V.A. Cespedes Feliciano E.M. Hursting S.D. Sears D.D. Kleckner A.S. Intermittent Fasting Interventions to Leverage Metabolic and Circadian Mechanisms for Cancer Treatment and Supportive Care Outcomes J. Natl. Cancer Inst. Monogr. 2023 61 84 103 10.1093/jncimonographs/lgad008 37139971 PMC10157769 14. Dorff T.B. Groshen S. Garcia A. Shah M. Tsao-Wei D. Pham H. Cheng C.-W. Brandhorst S. Cohen P. Wei M. Safety and feasibility of fasting in combination with platinum-based chemotherapy BMC Cancer 2016 16 360 10.1186/s12885-016-2370-6 27282289 PMC4901417 15. de Groot S. Lugtenberg R.T. Cohen D. Welters M.J.P. Ehsan I. Vreeswijk M.P.G. Smit V.T.H.B.M. de Graaf H. Heijns J.B. Portielje J.E.A. Fasting mimicking diet as an adjunct to neoadjuvant chemotherapy for breast cancer in the multicentre randomized phase 2 DIRECT trial Nat. Commun. 2020 11 3083 10.1038/s41467-020-16138-3 32576828 PMC7311547 16. de Groot S. Pijl H. van der Hoeven J.J.M. Kroep J.R. Effects of Short-Term Fasting on Cancer Treatment J. Exp. Clin. Cancer Res. 2020 39 8 10.1186/s13046-019-1189-9 31113478 PMC6530042 17. Vernieri C. Fucà G. Ligorio F. Huber V. Vingiani A. Iannelli F. Raimondi A. Rinchai D. Frigè G. Belfiore A. Fasting-mimicking diet is safe and reshapes metabolism and antitumour immunity in patients with cancer Cancer Discov. 2022 12 90 107 10.1158/2159-8290.CD-21-0030 34789537 PMC9762338 18. Fu C. Lu Y. Zhang Y. Yu M. Ma S. Lyu S. Intermittent fasting suppressed splenic CD205+ G-MDSC accumulation in a murine breast cancer model by attenuating cell trafficking and inducing apoptosis Food Sci. Nutr. 2021 9 5517 5526 10.1002/fsn3.2510 34646521 PMC8498071 19. Zhong Z. Zhang H. Nan K. Zhong J. Wu Q. Lu L. Yue Y. Zhang Z. Guo M. Wang Z. Fasting-Mimicking Diet Drives Antitumour Immunity against Colorectal Cancer by Reducing IgA-Producing Cells Cancer Res. 2023 83 3529 3543 10.1158/0008-5472.CAN-23-0323 37602826 PMC10618736 20. Luo M. Wang Q. Sun Y. Zhang J. Li Y. Chen L. Liu X. Liu J. Zhang Y. Li X. Fasting-mimicking diet remodels gut microbiota and suppresses colorectal cancer progression NPJ Biofilms Microbiomes 2024 10 53 10.1038/s41522-024-00520-w 38918380 PMC11199600 21. Oliveira M.L. Biggers A. Oddo V.M. Naylor K.B. Chen Z. Hamm A. Pezley L. Bernabé B.P. Gabel K. Sharp L.K. Design of a remote time-restricted eating and mindfulness intervention to reduce risk factors associated with early-onset colorectal cancer development among young adults Nutrients 2024 16 504 10.3390/nu16040504 38398828 PMC10893350 22. Gamal El-Tahawy N.F. Ahmed Rifaai R. Intermittent Fasting Protects Against Age-Induced Rat Benign Prostatic Hyperplasia via Preservation of Prostatic Histomorphology, Modification of Oxidative Stress, and Beclin-1/P62 Pathway Microsc. Microanal. 2023 29 1267 1276 10.1093/micmic/ozad035 37749675 23. Minciuna I. van Kleef L.A. Stefanescu H. Procopet B. Is Fasting Good When One Is at Risk of Liver Cancer? Cancers 2022 14 5084 10.3390/cancers14205084 36291868 PMC9600146 24. Wilhelmi de Toledo F. Grundler F. Sirtori C.R. Ruscica M. Unravelling the Health Effects of Fasting: A Long Road from Obesity Treatment to Healthy Life Span Increase and Improved Cognition Ann. Med. 2020 52 147 161 10.1080/07853890.2020.1770849 32519900 PMC7877980 25. de Cabo R. Mattson M.P. Effects of Intermittent Fasting on Health, Aging, and Disease N. Engl. J. Med. 2019 381 2541 2551 10.1056/NEJMra1905136 31881139 26. Weng M. Chen W. Chen X. Lu H. Sun Z. Yu Q. Sun P. Xu Y. Zhu M. Jiang N. Fasting Inhibits Aerobic Glycolysis and Proliferation in Colorectal Cancer via the Fdft1-Mediated AKT/mTOR/HIF1α Pathway Suppression Nat. Commun. 2020 11 1869 10.1038/s41467-020-15795-8 32313017 PMC7170903 27. Maecker H.T. McCoy J.P. Nussenblatt R. Standardizing Immunophenotyping for the Human Immunology Project Nat. Rev. Immunol. 2012 12 191 200 10.1038/nri3158 22343568 PMC3409649 28. Chen J. Su R. He Y. Chen J. Intermittent fasting inhibits the development of colorectal cancer in APC Min Front. Microbiol. 2025 16 1563224 10.3389/fmicb.2025.1563224 40510674 PMC12158919 29. Gopalakrishnan V. Spencer C.N. Nezi L. Reuben A. Andrews M.C. Karpinets T.V. Prieto P.A. Vicente D. Hoffman K. Wei S.C. Gut Microbiome Modulates Response to Anti–PD-1 Immunotherapy in Melanoma Patients Science 2018 359 97 103 10.1126/science.aan4236 29097493 PMC5827966 30. Yang Y.F. Li C.H. Cai H.Y. Lin B.S. Kim C.H. Chen H.C. Application of Metabolic Reprogramming to Cancer Imaging and Diagnosis Int. J. Mol. Sci. 2022 23 15831 10.3390/ijms232415831 36555470 PMC9782057 31. Just N. Improving tumour heterogeneity MRI assessment with histograms Br. J. Cancer 2014 111 2205 2213 10.1038/bjc.2014.512 25268373 PMC4264439 32. Wunderle C. Martin E. Wittig A. Tribolet P. Lutz T.A. Köster-Hegmann C. Stanga Z. Mueller B. Schuetz P. Comparison of the inflammatory biomarkers IL-6, TNF-α, and CRP to predict the effect of nutritional therapy on mortality in medical patients at risk of malnutrition: A secondary analysis of the EFFORT randomized clinical trial J. Inflamm. 2025 22 16 10.1186/s12950-025-00442-0 40275239 PMC12023447 33. Zalfa C. Paust S. Natural Killer Cell Interactions With Myeloid Derived Suppressor Cells in the Tumor Microenvironment and Implications for Cancer Immunotherapy Front. Immunol. 2021 12 633205 10.3389/fimmu.2021.633205 34025641 PMC8133367 34. Maifeld A. Bartolomaeus H. Löber U. Avery E.G. Steckhan N. Markó L. Wilck N. Hamad I. Šušnjar U. Mähler A. Fasting Alters the Gut Microbiome Reducing Blood Pressure and Body Weight in Metabolic Syndrome Patients Nat. Commun. 2021 12 1970 10.1038/s41467-021-22097-0 33785752 PMC8010079 35. Pollak M. The insulin and insulin-like growth factor receptor family in neoplasia: An update Nat. Rev. Cancer 2012 12 159 169 10.1038/nrc3215 22337149 36. Giovannucci E. Harlan D.M. Archer M.C. Bergenstal R.M. Gapstur S.M. Habel L.A. Pollak M. Regensteiner J.G. Yee D. Diabetes and cancer: A consensus report Diabetes Care 2010 33 1674 1685 10.2337/dc10-0666 20587728 PMC2890380 37. Brandhorst S. Choi I.Y. Wei M. Longo V.D. A Periodic Diet that Mimics Fasting Promotes Multi-System Regeneration, Enhanced Cognitive Performance, and Healthspan Cell Metab. 2015 22 86 99 10.1016/j.cmet.2015.05.012 26094889 PMC4509734 38. Wilhelmi de Toledo F. Grundler F. Goutzourelas N. Tekos F. Vassi E. Mesnage R. Kouretas D. Influence of Long-Term Fasting on Blood Redox Status in Humans Antioxidants. 2020 9 496 10.3390/antiox9060496 32517172 PMC7346198 39. Jia H. Wei J. Zheng W. Zhang L. Wang Q. Liu M. The Dual Role of Autophagy in Cancer Stem Cells: Implications for Tumour Progression and Therapy Resistance J. Transl. Med. 2025 23 583 10.1186/s12967-025-06595-z 40414839 PMC12105148 40. Mahri S. Villa R. Shiau Y.P. Tang M. Racacho K.J. Nanomedicine Approaches for Autophagy Modulation in Cancer Therapy Small Methods 2025 6 2400607 10.1002/smsc.202400607 PMC12168626 40529859 41. Lee J. Cheong H. The Role of A20 in Cancer: Friend or Foe? Cells 2025 14 544 10.3390/cells14070544 40214497 PMC11988600 42. Alirezaei M. Kemball C.C. Flynn C.T. Wood M.R. Whitton J.L. Kiosses W.B. Short-Term Fasting Induces Profound Neuronal Autophagy Autophagy 2010 6 702 710 10.4161/auto.6.6.12376 20534972 PMC3106288 43. Madeo F. Zimmermann A. Maiuri M.C. Kroemer G. Essential Role for Autophagy in Life Span Extension J. Clin. Investig. 2015 125 85 93 10.1172/JCI73946 25654554 PMC4382258 44. Pietrocola F. Pol J. Vacchelli E. Rao S. Enot D.P. Baracco E.E. Levesque S. Castoldi F. Jacquelot N. Yamazaki T. Caloric Restriction Mimetics Enhance Anticancer Immunosurveillance Cancer Cell 2017 32 147 160.e3 10.1016/j.ccell.2016.05.016 PMC5715805 27411589 45. Bortnik S. Gorski S.M. Clinical Applications of Autophagy Proteins in Cancer: From Potential Targets to Biomarkers Int. J. Mol. Sci. 2017 18 1496 10.3390/ijms18071496 28696368 PMC5535986 46. Klionsky D.J. Abdel-Aziz A.K. Abdelfatah S. Abdellatif M. Abdoli A. Abel S. Abeliovich H. Abildgaard M.H. Abudu Y.P. Acevedo-Arozena A. Guidelines for the Use and Interpretation of Assays for Monitoring Autophagy (4th Edition) Autophagy 2021 17 1 382 10.1080/15548627.2020.1797280 33634751 PMC7996087 47. Udumula M.P. Singh H. Rashid F. Poisson L. Tiwari N. Dimitrova I. Hijaz M. Gogoi R. Swenor M. Munkarah A. Intermittent Fasting Induced Ketogenesis Inhibits Mouse Epithelial Ovarian Cancer by Promoting Antitumour T Cell Response iScience 2023 26 107839 10.1016/j.isci.2023.107839 37822507 PMC10562806 48. Cossarizza A. Chang H.-D. Radbruch A. Akdis M. Andrä I. Annunziato F. Ballesteros J. Barnaba V. Battistini L. Bauer W. Guidelines for the Use of Flow Cytometry and Cell Sorting in Immunological Studies (Second Edition) Eur. J. Immunol. 2019 49 1457 1973 10.1002/eji.201970107 31633216 PMC7350392 49. Alter G. Malenfant J.M. Altfeld M. CD107a as a Functional Marker for the Identification of Natural Killer Cell Activity J. Immunol. Methods 2004 294 15 22 10.1016/j.jim.2004.08.008 15604012 50. Leng S.X. McElhaney J.E. Walston J.D. Xie D. Fedarko N.S. Kuchel G.A. ELISA and Multiplex Technologies for Cytokine Measurement in Inflammation and Aging Research J. Gerontol. A Biol. Sci. Med. Sci. 2008 63 879 884 10.1093/gerona/63.8.879 18772478 PMC2562869 51. Grivennikov S.I. Greten F.R. Karin M. Immunity, Inflammation, and Cancer Cell 2010 140 883 899 10.1016/j.cell.2010.01.025 20303878 PMC2866629 52. Cienfuegos S. Gabel K. Kalam F. Ezpeleta M. Lin S. Varady K.A. Effects of Intermittent Fasting and Caloric Restriction on Inflammatory Biomarkers: A Systematic Review and Meta-Analysis of Randomized Controlled Trials Obes. Rev. 2023 24 e13838 10.1111/obr.13838 39289905 53. Scheer F.A.J.L. Hilton M.F. Mantzoros C.S. Shea S.A. Endogenous Circadian Regulation of Pro-Inflammatory Cytokines and Chemokines in the Presence of Bacterial Lipopolysaccharide in Humans Brain Behav. Immun. 2014 38 40 48 10.1016/j.bbi.2014.11.003 PMC4430446 25452149 54. Pepys M.B. Hirschfield G.M. C-Reactive Protein: A Critical Update J. Clin. Investig. 2003 111 1805 1812 10.1172/JCI200318921 12813013 PMC161431 55. Nencioni A. Caffa I. Cortellino S. Longo V.D. Fasting and Cancer: Molecular Mechanisms and Clinical Application Nat. Rev. Cancer 2018 18 707 719 10.1038/s41568-018-0061-0 30327499 PMC6938162 56. Pollak M. Insulin and Insulin-Like Growth Factor Signalling in Neoplasia Nat. Rev. Cancer 2008 8 915 928 10.1038/nrc2536 19029956 57. Renehan A.G. Zwahlen M. Minder C. O’Dwyer S.T. Shalet S.M. Egger M. Insulin-Like Growth Factor (IGF)-I, IGF Binding Protein-3, and Cancer Risk: Systematic Review and Meta-Regression Analysis Lancet 2004 363 1346 1353 10.1016/S0140-6736(04)16044-3 15110491 58. Zhao X. Yang J. Huang R. Guo M. Zhou Y. Xu L. The role and its mechanism of intermittent fasting in tumors: Friend or foe? Cancer Biol. Med. 2021 18 63 73 10.20892/j.issn.2095-3941.2020.0250 33628585 PMC7877171 59. Frystyk J. Delhanty P.J.D. Skjærbæk C. Baxter R.C. Changes in the circulating IGF system during short-term fasting and refeeding in rats Am. J. Physiol. Endocrinol. Metab. 1999 277 E245 E252 10.1152/ajpendo.1999.277.2.E245 10444419 60. Clemmons D.R. on behalf of the conference participants. Consensus Statement on the Standardization and Evaluation of Growth Hormone and Insulin-Like Growth Factor Assays Clin. Chem. 2011 57 555 559 10.1373/clinchem.2010.150631 21285256 61. Liu Y. Zhou Q. Song S. Tang S. Integrating Metabolic Reprogramming and Metabolic Imaging to Predict Breast Cancer Therapeutic Responses Trends Endocrinol. Metab. 2021 32 762 775 10.1016/j.tem.2021.07.001 34340886 Figure 1 Schematic representation of intermittent fasting dietary patterns. Figure 2 Clinical decision flowchart for managing abnormal biomarker values during intermittent fasting in oncology patients. diagnostics-15-02369-t001_Table 1 Table 1 Preclinical evidence: IF/ FMD and MDSC modulation. Model/Study MDSC Effect of IF 4T1/4T07 murine breast cancer + IF ↓ Splenic CD205 + FMD/IF in murine 4T1 model ↓ Tumor MDSCs, ↑ T cell Human FMD cancer patients ↓ Circulating cytokines (IL-6, CCL2, G-CSF) that mobilize MDSCs CCL2, chemokine (C-C motif) ligand; CXCR4, C-X-C chemokine receptor type; FMD, Fasting-Mimicking Diets; IF, G-CSF, Granulocyte colony-stimulating factor; IL-6, interleukin-6; Intermittent Fasting; MDSC, Myeloid-derived suppressor cells; PBMC, peripheral blood mononuclear cells; ↑ indicates downregulation, ↓ indicates upregulation. diagnostics-15-02369-t002_Table 2 Table 2 Comparative overview of selected monitoring tools used to evaluate the effects of intermittent fasting in oncology. Method Technique Benefit Limitations  Inflammatory markers (IL-6, CRP, TNF-α ) ELISA, Luminex Assessment of inflammation and tumor microenvironment, ELISA: single analyte per sample, time consuming, requires larger sample volume  Metabolic profile (glucose, insulin, IGF-1, IGFBP-3) OGTT, HOMA-IR, Evaluation of glucose–insulin homeostasis and IGF-1 axis Requires fasting conditions, drug interference  Autophagy assessment (LC3, Beclin-1) Western blot, flow cytometry, confocal microscopy Insight into cancer cell Complex interpretation in cancer context  Gut microbiome analysis 16S rRNA sequencing, Influence on immune response and metabolism Environmental variability, need for bioinformatics  Immunological tests (CD8+, NK, MDSC) Flow cytometry, cytotoxicity assays Evaluation of antitumor immune activity High complexity and cost  Imaging (PET, MRI) PET-CT (18F-FDG), Assessment of metabolic activity and tumor morphology PET: MRI: DWI: Expensive, needs advanced equipment, risk of false positives PET: MRI: DWI: In summary: IL-6—Interleukin-6, CRP—C-reactive Protein, TNF-α—Tumor Necrosis Factor alpha, ELISA—Enzyme-Linked Immunosorbent Assay, IGF-1—Insulin-like Growth Factor 1, IGFBP-3—Insulin-like Growth Factor Binding Protein 3, OGTT—Oral Glucose Tolerance Test, HOMA-IR—Homeostasis Model Assessment of Insulin Resistance, LC3—Microtubule-Associated Protein 1 Light Chain 3, CD8 + diagnostics-15-02369-t003_Table 3 Table 3 Potential benefits, risks and applications of IF in oncology—summary. Area Potential Benefits of IF Possible Risks/Limitations Research Status  Supportive therapy Reduction in chemotherapy-induced side effects Risk of malnutrition, particularly in cachectic patients Preclinical and early-phase clinical studies  Metabolic impact Lower glucose and insulin levels; Risk of hypoglycemia in diabetic patients Moderate-quality evidence  Immuno-modulation Potential activation of autophagy; Limited data in immunosuppressed individuals Mostly animal studies;  Microbiota modulation Altered gut microbiome composition; improved intestinal barrier High interindividual variability Preliminary human data  Inflammation reduction Decreased CRP, TNF-α, IL-6 Requires long-term monitoring and validation Promising early-stage  Antitumor potential Reduced tumor cell proliferation Lack of validation in large-scale human trials Predominantly preclinical data  Cancer prevention Reduction in metabolic risk factors Requires prolonged follow-up Observational evidence; IGF-1—Insulin-like Growth Factor 1, CRP—C-reactive Protein, TNF-α—Tumor Necrosis Factor alpha, IL-6—Interleukin 6, RCTs—Randomized Controlled Trials. ",
  "metadata": {
    "Title of this paper": "Integrating Metabolic Reprogramming and Metabolic Imaging to Predict Breast Cancer Therapeutic Responses",
    "Journal it was published in:": "Diagnostics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468805/"
  }
}