{
  "title": "Paper_848",
  "abstract": "pmc Pharmaceuticals (Basel) Pharmaceuticals (Basel) 2102 pharmaceuticals pharmaceuticals Pharmaceuticals 1424-8247 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472463 PMC12472463.1 12472463 12472463 41011279 10.3390/ph18091412 pharmaceuticals-18-01412 1 Review Biosynthesized Silver Nanoparticles and Their Antidiabetic Potential https://orcid.org/0000-0001-6754-1635 González-Garibay Angélica Sofía https://orcid.org/0000-0002-8476-3368 Torres-González Omar Ricardo Sánchez-Hernández Iván Moisés https://orcid.org/0000-0003-4783-841X Padilla-Camberos Eduardo * Pereira Goreti Academic Editor Medical and Pharmaceutical Biotechnology Unit, Center for Research and Assistance in Technology and Design of the State of Jalisco, A.C. (CIATEJ). Av. Normalistas No. 800 Col. Colinas de la Normal, Guadalajara C.P. 44270, Jalisco, Mexico * epadilla@ciatej.mx 19 9 2025 9 2025 18 9 497460 1412 31 7 2025 12 9 2025 15 9 2025 19 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives Methods Results Conclusions green synthesis metallic nanoparticles diabetes hypoglycemic Consejo Nacional de Humanidades, Ciencia y Tecnología (CONAHCYT/SECIHTI) 3097257 This research was also supported by a postdoctoral fellowship No. 3097257 from Consejo Nacional de Humanidades, Ciencia y Tecnología (CONAHCYT/SECIHTI), to Angélica Sofía González Garibay (CVU 298099). This study received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Diabetes mellitus (DM) is a group of metabolic disorders of carbohydrate metabolism in which glucose is both underutilized as an energy source and overproduced due to inappropriate gluconeogenesis and glycogenolysis, resulting in hyperglycemia [ 1 2 1 3 According to the International Diabetes Federation (IDF), the current global prevalence of DM among adults aged 20–79 years is estimated at 11.1%, affecting approximately 588.7 million people in 2024. According to estimates, this figure is projected to rise to 13% by 2050, impacting around 852.5 million people. The IDF recently estimated that the total global healthcare expenditure attributable to diabetes among adults aged 20–79 years was USD 1,015 billion in 2024, with projections indicating an increase to USD 1,045 billion by 2050. Noticeably, approximately 90% of the prevalence of DM corresponds to people with T2D [ 3 T2D is a disorder characterized by an impaired glucose homeostasis due to a dysregulation of carbohydrate, lipid, and protein metabolism. T2D is caused by a combination of genetic and environmental factors. However, impaired insulin secretion, insulin resistance, or a combination of both is considered the core pathophysiological defect. A T2D diagnosis is based on measurements of fasting plasma glucose, 2 h plasma glucose after an oral glucose tolerance test, and glycosylated hemoglobin (HbA1c) [ 4 5 6 7 Prolonged and untreated DM can lead to serious complications on the cardiovascular system, kidneys and eyes, some of which are life-threatening [ 5 7 8 9 10 11 12 The current therapeutics for the management of type 2 diabetes (T2D) include medications prescribed either in the presence or absence of exogenous insulin. Based on their mechanisms of action, these agents are broadly classified into four major classes: (a) insulin sensitizers, such as biguanides and thiazolidinediones; (b) insulin secretagogues, including sulfonylureas and glinides; (c) α-glucosidase inhibitors, such as acarbose and miglitol, which delay carbohydrate absorption; and (d) other agents, such as sodium–glucose co-transporter-2 (SGLT2) inhibitors and bile acid sequestrants. Some of these drugs carry the risk of side effects, including hypoglycemia, weight gain, and cardiovascular complications. However, some new drugs have been associated with weight loss [ 2 13 14 15 In addition, one disadvantage of the current oral treatments of T2D is related to their low bioavailability and the immediate release of the drug into the bloodstream. In this context, nanotechnology, including different nanosystems and nanomaterials, is also applied for drug delivery, diagnostics, and tissue repair [ 15 16 17 Different parts of plants contain bioactive compounds, such as flavonoids and alkaloids, that can be used for diabetes treatment. Various techniques can be applied for their extraction. Their mechanisms of action involve improving glucose metabolism, exerting a hypolipidemic effect, enhancing the pancreatic effect, providing antioxidative benefits, managing diabetes-related complications, and exhibiting insulin-like activity [ 18 19 Various approaches to the synthesis of metallic nanoparticles are available. These reactions have common steps: reduction, nucleation, growth, coarsening, and/or agglomeration. One widely used method involves reducing metal salts in an aqueous or organic solvent [ 20 21 22 Recent studies have explored the potential application of AgNPs in the management of endocrine disorders such as DM, a prevalent metabolic disorder affecting millions worldwide. Given the global impact of DM, there is significant scientific interest in developing innovative strategies for its effective control [ 3 23 An overview of existing research was conducted in PubMed in April 2025 using the search term “antidiabetic + activity + AgNPs”. Relevant articles published in English were selected and reviewed, focusing on the utilization of biosynthesized AgNPs using plants in in vitro and in vivo studies. Information regarding the methods used to evaluate the antidiabetic effects of AgNPs, the plant sources employed, the nanoparticles’ characteristics, the concentrations tested, and the corresponding results was extracted from the collected data. In this review, the current state of research regarding the potential use of AgNPs for diabetes management and treatment is presented, highlighting recent findings and discussing future perspectives. 2. Biosynthesis of AgNPs Nanotechnology deals with the design, fabrication, and application of small structures or small-sized materials. The size of nanoparticles spans from subnanometers to several hundred nanometers, where one nanometer is one billionth of a meter (1 × 10 −9 24 25 The characteristics of nanoparticles, including size, shape, and the orientation of surface functional groups, are highly relevant. However, one of their most defining features is their high surface area-to-volume ratio, which facilitates their infiltration into biological tissues and fluids. This property enables processes such as endocytosis, distribution, retention, and elimination within biological systems [ 26 Metallic nanoparticles exist in nature, and several historical objects, such as the pigments used by the Mayans in Chichen Itzá have been shown to contain iron and chromium nanoparticles [ 27 28 29 The synthesis of nanoparticles can be carried out using physical, chemical, and biological methods. The main disadvantage of physical and chemical methods is that they have a high cost, both in economic and environmental terms, because they involve the use of dangerous or toxic substances [ 30 31 32 33 34 21 22 35 17 36 37 38 Table 1 Figure 1 The synthesis of AgNPs can be influenced by different parameters, such as temperature, pH, concentration of reaction components, reducing or stabilizing agents, and the molar ratio of the surfactant/stabilizer and precursor [ 20 + 0 39 Although nanoparticles can be synthesized from different metals, AgNPs represent a clear example of the multiple applications that these materials can have, since they have been used in clothing, the food industry, electronics, biosensing, environmental remediation, medical healthcare, and consumer products [ 40 pharmaceuticals-18-01412-t001_Table 1 Table 1 Examples of biomaterials for the biosynthesis of silver nanoparticles. Biomaterial Silver Nanoparticle Size Reference  Plants  Scientific name   Leaves  Theobroma Cacao Linneu 10.3 nm [ 41 Fruit  Aegle marmelos 159–181 nm [ 42 Bark Heritiera fomes Sonneratia apetala 20–30 nm [ 43 Root  Coleus forskohlii 5–35 nm [ 44 Peel  Stenocereus queretaroensis 98.9 nm [ 45  Microorganisms  Bacteria  Bacillus cereus 5–7.06 nm [ 46 Fungi  Aspergillus sydowii 1–24 nm [ 47 Algae Asterarcys sp. 35–52 nm [ 48  Biomolecules  Enzymes Nitrate reductase from Fusarium oxysporum 50 nm [ 49 Vitamins Vitamin C 26.5 nm [ 50 Proteins Bovine serum albumin, lysozyme, among others Non determined [ 51 Phytochemicals Naringenin 10–21 nm [ 52  Animals  Marine invertebrates  Marphysa moribidii 40.19 nm average [ 53 Insects Mang mao 40–60 nm [ 37 3. Characterization of AgNPs The characterization of biosynthesized AgNPs is carried out using different methodologies, such as spectrophotometry; the surface plasmon resonance of silver ions has been detected at wavelengths of 400–460 nanometers [ 54 55 54 56 57 58 57 59 4. Metabolism of AgNPs Nanoparticles, ranging in size from 1 to 100 nm, have a high surface area-to-volume ratio, making them highly reactive and capable of penetrating body tissues and fluids. Their size and surface properties play a key role in endocytosis, distribution, accumulation within biological systems, and eventual elimination [ 26 60 The main applications of AgNPs in the biomedical area include therapeutic applications such as antioxidants, diagnosis, biomolecular detection, and controlled drug release, among others [ 61 62 In vitro studies have demonstrated that the dose, size, and coating of AgNPs affect their cellular uptake; meanwhile, in vivo distribution studies have reported silver accumulation and toxicity to both local and distant organs [ 63 Accumulation occurs in the liver, kidneys, spleen, brain, lungs, and testicles. Nanoparticles can persist in the body for several weeks after the end of oral exposure, particularly in the brain and testicles [ 64 5. Toxicology of AgNPs Regarding the potential toxicological risks of nanoparticles, the increasing biomedical and commercial applications of AgNPs have raised concerns about their interactions with the environment and human health [ 65 57 Recently, an in vitro study provided a first attempt to calculate the human effect factors (HEF) value for nanoparticles, including AgNPs, which can be used to establish their impact category in a life cycle assessment. The non-carcinogenic HEF (case/kg intake) for AgNPs was 5.9 × 10 −1 −3 −2 65 66 67 68 6. Mechanisms of Action of AgNPs in Type 2 Diabetes Mellitus T2D risk factors include a complex combination of genetic, metabolic, and environmental factors; the main modifiable risk factors are obesity, low physical activity, and an unhealthy diet. The pathophysiological changes are characterized by β-cell dysfunction, insulin resistance, and chronic inflammation leading to hyperglycemia [ 4 69 Overconsumption of food leads to obesity and is associated with gluco-lipotoxicity; it also stimulates insulin secretion and the production of reactive oxygen species, which in turn leads to an abnormal generation of inflammatory molecules. This pro-inflammatory environment causes insulin resistance in muscle, liver, and adipose tissue; as a consequence, β-cells continue the overproduction of insulin to control hyperglycemia until dysfunction of the pancreas occurs. However, other processes and behavioral risks are involved, including aging, resistance and/or deficiency of incretin hormones such as GLP-1 and gastric inhibitory polypeptide (GIP), hypersecretion of islet amyloid polypeptide, smoking, and sleep habits [ 4 69 69 70 On the other hand, sustained hyperglycemia induces the formation of advanced glycation end-products (AGEs), which worsen oxidative stress and non-enzymatic glycation in proteins such as hemoglobin [ 69 71 72 73 Table 2 The antidiabetic activity of AgNPs has been primarily evaluated in murine models, commonly induced by alloxan or streptozotocin, both of which are well known for damaging the pancreas and inducing diabetes ( Table 3 An effective strategy for lowering elevated blood glucose levels is enzyme inhibition. α-amylase hydrolyzes starch and releases maltose and a range of branched-oligosaccharides that are further hydrolyzed by α-glucosidase into absorbable monosaccharides such as glucose. Extensive research has focused on identifying compounds that target these enzymes to regulate blood sugar levels [ 117 118 119 118 119 117 Table 4 73 74 75 80 99 72 103 Leucosidea sericea 50 120 Berberis lyceum 103 Cleome viscosa 85 After ingestion of a meal, insulin is released and the secretion of incretin hormones, such as glucagon-like peptide-1 (GLP-1) and gastric inhibitory polypeptide (GIP), is increased. GLP-1 and GIP are gut-derived hormones that enhance insulin secretion, suppress glucagon release, and delay gastric emptying. These incretin hormones play a critical role in modulating glucose metabolism and reducing blood glucose levels [ 151 152 83 151 One approach to treating diabetic patients involves stimulating insulin secretion using thiazolidinedione drugs. Another strategy targets glucagon and related molecules, as glucagon promotes glucose production. These mechanisms have been investigated using AgNPs in in vitro models with pancreatic and liver hepatic cell lines [ 87 In vitro studies have employed glucose dialysis retardation assays and glucose adsorption capacity to evaluate the potential of bioactive compounds in modulating glucose absorption. The glucose dialysis retardation assay suggests that certain compounds may delay glucose absorption in the intestine and prevent postprandial hyperglycemia [ 74 89 153 Tyrosine protein phosphatase non-receptor type 1 (PTP1B; also known as protein tyrosine phosphatase 1B) downregulates insulin signaling through changes to insulin receptor activity. Although the physiological activity of PTP1B depends on cell type, PTP1B inhibition can improve insulin sensitivity and exert benefits on DM [ 58 154 Oxidative stress has been associated with T2D and is defined as a condition characterized by elevated levels of reactive oxygen and nitrogen species, together with reduced antioxidant levels. This imbalance disrupts normal cellular processes, as the high electron reactivity of these species enables their interactions with biomolecules such as lipids, proteins, and nucleic acids. Reactive species may originate from exogenous or endogenous sources, with the mitochondrial electron transport chain—particularly under nutrient overload—being a major endogenous contributor [ 155 75 Some studies have evaluated the antidiabetic effect of AgNPs not only via amylase or glucosidase inhibition, but also by measuring their radical scavenging activity using the DPPH (1,1-diphenyl-2-picrylhydrazyl) or ABTS 2,2-azino-bis (3-ethylbenz-thiazoline-6-sulfonic acid) assays [ 75 123 120 125 Rosa indica 132 137 121 143 156 The production of AGEs is associated with the pathogenic mechanisms underlying T2D, as well as the development of diabetic complications and other chronic diseases. AGEs can be assessed through inhibition assays targeting vesperlysine-like and pentosidine-like AGEs, which are naturally fluorescent and cross-linked [ 95 129 Recently, one study employed in silico molecular docking approaches to evaluate interactions between silver atoms and proteins such as α-amylase, α-glucosidase, insulin, and glucagon, demonstrating that silver atoms can interact with the amino acid residues of these proteins, since the binding energy resulted in <0 kcal/mol [ 87 Regarding animal models, various doses and particle sizes of AgNPs have been evaluated. Sizes as small as 9 nm [ 110 104 115 Momordica charantia 111 115 111 116 109 110 Rumex hymenosepalus 110 80 96 102 108 80 96 108 Consistent with in vitro findings on size, smaller AgNPs in animal models appear to exert more efficient antidiabetic effects. This was demonstrated with AgNPs biosynthesized from R. hymenosepalus 110 Lawsonia inermis 112 Eysenhardtia polystachya 93 Table 5 Figure 2 7. Current Challenges in the Treatment of Type 2 Diabetes Mellitus Some studies have shown that weight loss can produce a remission of T2D, defined as no longer meeting the diagnostic criteria for T2D. Both diet and a physically active lifestyle are the cornerstones of remission, and it is worth mentioning that long-term maintenance of weight loss is challenging [ 157 Dietary restrictions are commonly prescribed to improve metabolic control in T2D. National and international guidelines for nutritional and lifestyle recommendations are available. Some recommendations focus on the consumption of low glycemic index foods to improve hyperglycemia [ 153 158 159 157 DM is a major public health epidemic despite recent advances in both pharmaceutical and technological treatment options [ 9 160 161 161 8. Study Limitations Doses of AgNPs are reported using various units, and not all studies provide IC 50 9. Conclusions This review provides an extensive overview of the antidiabetic effects of AgNPs, with particular emphasis on differentiating findings from in vitro and animal studies. Such distinctions are essential for interpreting current evidence and guiding future research toward clinical translation. Most studies have focused on the enzyme inhibitory activity of AgNPs; however, a smaller number have examined glucose uptake in cells, the expression of relevant genes, and the non-enzymatic glycosylation of proteins. In addition, a few other types of studies have also been reported, although they remain limited. The biosynthesis of AgNPs employs bioactive compounds from plants instead of hazardous chemicals, making it an environmentally friendly green synthesis method. Plant extracts are the most common biomaterial for AgNP biosynthesis. Optimization of the biosynthesis conditions is highly recommended to enhance the efficiency and reproducibility of AgNP production. However, safety concerns must still be addressed given the increasing utilization of AgNPs; this, in turn, requires further investigation into their toxicological effects. Most of the antidiabetic screening found in this review was performed in vitro using cellular and enzymatic assays and a few animal models. In addition, the shape and size of AgNPs may influence their antidiabetic efficacy and should therefore be considered in future investigations. T2D remains a major public health challenge despite recent advances in nanobiomedicine. The antidiabetic potential of AgNPs is increasingly supported by evidence from both in vitro and in vivo studies, suggesting their promise in the development of nanoparticle-based therapies. Nevertheless, further investigations are required, particularly regarding pharmacological properties, biocompatibility, and cytotoxicity. Additionally, although several mechanisms of action have been proposed, the precise mode of action in the altered processes in T2D remains unclear. Such studies are essential to optimize dosage, stability, and safety, thereby enabling the design of clinical trials and advancing the potential commercialization (i.e., scaling up the biosynthesis process, regulatory alignment) of AgNP-based antidiabetic agents. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, E.P.-C. and A.S.G.-G.; Literature review, A.S.G.-G., I.M.S.-H., O.R.T.-G. and E.P.-C.; Drafting the article, A.S.G.-G.; Review and editing: I.M.S.-H. and O.R.T.-G.; Critical revision for relevant intellectual content, E.P.-C.; Final approval of the version to be published, A.S.G.-G., O.R.T.-G., I.M.S.-H. and E.P.-C. All authors have read and agreed to the published version of the manuscript. Conflicts of Interest The authors declare no conflicts of interest. References 1. American Diabetes Association Professional Practice Committee Diagnosis and Classification of Diabetes: Standards of Care in Diabetes—2024 Diabetes Care 2024 47 S20 S42 10.2337/dc24-S002 38078589 PMC10725812 2. Singh A. Shadangi S. Gupta P.K. Rana S. Type 2 Diabetes Mellitus: A Comprehensive Review of Pathophysiology, Comorbidities, and Emerging Therapies Compr. Physiol. 2025 15 e70003 10.1002/cph4.70003 39980164 3. International Diabetes Federation Diabetes Atlas 11th ed. International Diabetes Federation Brussels, Belgium 2025 4. DeFronzo R.A. Ferrannini E. Groop L. Henry R.R. Herman W.H. Holst J.J. Hu F.B. Kahn C.R. Raz I. Shulman G.I. Type 2 Diabetes Mellitus Nat. Rev. Dis. Primers 2015 1 15019 10.1038/nrdp.2015.19 27189025 5. Zimmet P. Alberti K.G. Magliano D.J. Bennett P.H. Diabetes Mellitus Statistics on Prevalence and Mortality: Facts and Fallacies Nat. Rev. Endocrinol. 2016 12 616 622 10.1038/nrendo.2016.105 27388988 6. Bergman M. Abdul-Ghani M. DeFronzo R.A. Manco M. Sesti G. Fiorentino T.V. Ceriello A. Rhee M. Phillips L.S. Chung S. Review of Methods for Detecting Glycemic Disorders Diabetes Res. Clin. Pract. 2020 165 108233 10.1016/j.diabres.2020.108233 32497744 PMC7977482 7. Alam S. Hasan M.K. Neaz S. Hussain N. Hossain M.F. Rahman T. Diabetes Mellitus: Insights from Epidemiology, Biochemistry, Risk Factors, Diagnosis, Complications and Comprehensive Management Diabetology 2021 2 36 50 10.3390/diabetology2020004 8. Hou Y. Xiang J. Wang B. Duan S. Song R. Zhou W. Tan S. He B. Pathogenesis and comprehensive treatment strategies of sarcopenia in elderly patients with type 2 diabetes mellitus Front. Endocrinol. 2024 8 1263650 10.3389/fendo.2023.1263650 PMC10801049 38260146 9. Hallberg S.J. Gershuni V.M. Athinarayanan S.J. Reversing Type 2 Diabetes: A Narrative Review of the Evidence Nutrients 2019 11 766 10.3390/nu11040766 31323831 PMC6683030 10. Zhang Y. Yang Y. Huang Q. Zhang Q. Li M. Wu Y. The Effectiveness of Lifestyle Interventions for Diabetes Remission on Patients with Type 2 Diabetes Mellitus: A Systematic Review and Meta-Analysis Worldviews Evid. Based Nurs. 2023 20 64 78 10.1111/wvn.12608 36480153 11. Tripathi P. Kathrikolly T.R. Lifestyle Intervention for Diabetes Remission: A Paradigm Shift in Diabetes Care and Management Curr. Diabetes Rev. 2023 20 45 49 10.2174/0115733998272795231109034141 38093443 12. Cartagena M.V. Tort-Nasarre G. Arnaldo E.R. Barriers and Facilitators for Physical Activity in Adults with Type 2 Diabetes Mellitus: A Scoping Review Int. J. Environ. Res. Public. Health 2021 18 5359 10.3390/ijerph18105359 34069859 PMC8157366 13. Chaudhury A. Duvoor C. Reddy Dendi V.S. Kraleti S. Chada A. Ravilla R. Marco A. Shekhawat N.S. Montales M.T. Kuriakose K. Clinical Review of Antidiabetic Drugs: Implications for Type 2 Diabetes Mellitus Management Front. Endocrinol. 2017 8 6 10.3389/fendo.2017.00006 28167928 PMC5256065 14. Mahgoub M.O. Ali I.I. Adeghate J.O. Tekes K. Kalász H. Adeghate E.A. An Update on the Molecular and Cellular Basis of Pharmacotherapy in Type 2 Diabetes Mellitus Int. J. Mol. Sci. 2023 24 9328 10.3390/ijms24119328 37298274 PMC10253663 15. Simos Y.V. Spyrou K. Patila M. Karouta N. Stamatis H. Gournis D. Dounousi E. Peschos D. Trends of Nanotechnology in Type 2 Diabetes Mellitus Treatment Asian J. Pharm. Sci. 2021 16 62 76 10.1016/j.ajps.2020.05.001 33613730 PMC7878460 16. Wickramasinghe A.S.D. Kalansuriya P. Attanayake A.P. Nanoformulation of Plant-Based Natural Products for Type 2 Diabetes Mellitus: From Formulation Design to Therapeutic Applications Curr. Ther. Res. Clin. Exp. 2022 96 100672 10.1016/j.curtheres.2022.100672 35586563 PMC9108891 17. Mohammed A.A. Alqahtani A.A. Ahmed M.M. Application of Green Synthesized Silver Nanoparticles in Burn Therapy: A Review Pharmazie 2024 79 42 48 10.1691/ph.2024.3045 38872274 18. Chan C.H. Ngoh G.C. Yusoff R. A Brief Review on Anti Diabetic Plants: Global Distribution, Active Ingredients, Extraction Techniques and Acting Mechanisms Pharmacogn. Rev. 2012 6 22 28 10.4103/0973-7847.95854 22654401 PMC3358964 19. Arumugam G. Manjula P. Paari N. A Review: Anti Diabetic Medicinal Plants Used for Diabetes Mellitus J. Acute Dis. 2013 2 196 200 10.1016/S2221-6189(13)60126-2 20. Adeyemi J.O. Oriola A.O. Onwudiwe D.C. Oyedeji A.O. Plant Extracts Mediated Metal-Based Nanoparticles: Synthesis and Biological Applications Biomolecules 2022 12 627 10.3390/biom12050627 35625555 PMC9138950 21. Mittal A.K. Chisti Y. Banerjee U.C. Synthesis of Metallic Nanoparticles Using Plant Extracts Biotechnol. Adv. 2013 31 346 356 10.1016/j.biotechadv.2013.01.003 23318667 22. Marinescu L. Ficai D. Oprea O. Marin A. Ficai A. Andronescu E. Holban A.M. Optimized Synthesis Approaches of Metal Nanoparticles with Antimicrobial Applications J. Nanomater. 2020 2020 6651207 10.1155/2020/6651207 23. Addissouky T. Ali M. El Sayed I.E.T. Wang Y. Revolutionary Innovations in Diabetes Research: From Biomarkers to Genomic Medicine Iran. J. Diabetes Obes. 2023 15 228 242 10.18502/ijdo.v15i4.14556 24. Cao G. Ying W. Nanostructures and Nanomaterials. Synthesis, Properties, and Applications 2nd ed. Imperial College Press Singapore 2011 978-981-4340-57-1 25. Malik S. Muhammad K. Waheed Y. Nanotechnology: A Revolution in Modern Industry Molecules 2023 28 661 10.3390/molecules28020661 36677717 PMC9865684 26. Yan Y. Cai H. Yang M. The Application of Nanotechnology for the Diagnosis and Treatment of Endocrine Disorders: A Review of Current Trends, Toxicology and Future Perspective Int. J. Nanomed. 2024 19 9921 9942 10.2147/IJN.S477835 PMC11439355 39345911 27. José-Yacamán M. Rendón L. Arenas J. Carmen M. Puche S. Maya Blue Paint: An Ancient Nanostructured Material Science 1996 273 223 225 10.1126/science.273.5272.223 8662502 28. Turner P. History of Photography. Metal Nano Particles Synthesis Characterization and Applications, Colloidal Gold History of photography Hamlyn London, UK 1987 29. Kiranmai M. Biological and Non-Biological Synthesis of Metallic Nanoparticles: Scope for Current Pharmaceutical Research Indian J. Pharm. Sci. 2017 79 501 512 10.4172/pharmaceutical-sciences 30. Bhattacharya R. Mukherjee P. Biological Properties of “Naked” Metal Nanoparticles Adv. Drug Deliv. Rev. 2008 60 1289 1306 10.1016/j.addr.2008.03.013 18501989 31. Ali Z.A. Yahya R. Sekaran S.D. Puteh R. Green Synthesis of Silver Nanoparticles Using Apple Extract and Its Antibacterial Properties Adv. Mater. Sci. Eng. 2016 2016 4102196 10.1155/2016/4102196 32. Narayanan K.B. Sakthivel N. Coriander Leaf Mediated Biosynthesis of Gold Nanoparticles Mater. Lett. 2008 62 4588 4590 10.1016/j.matlet.2008.08.044 33. Saifuddin N. Wong C.W. Yasumira A.A.N. Rapid Biosynthesis of Silver Nanoparticles Using Culture Supernatant of Bacteria with Microwave Irradiation J. Chem. 2009 6 61 70 10.1155/2009/734264 34. Bhakya S. Muthukrishnan S. Sukumaran M. Muthukumar M. Biogenic Synthesis of Silver Nanoparticles and Their Antioxidant and Antibacterial Activity Appl. Nanosci. 2016 6 755 766 10.1007/s13204-015-0473-z 35. Ahmed S. Ahmad M. Swami B.L. Ikram S. A Review on Plants Extract Mediated Synthesis of Silver Nanoparticles for Antimicrobial Applications: A Green Expertise J. Adv. Res. 2016 7 17 28 10.1016/j.jare.2015.02.007 26843966 PMC4703479 36. Majeed S. Danish M. Zakariya N.A. Hashim R. Ansari M.T. Alkahtani S. Hasnain M.S. In Vitro Evaluation of Antibacterial, Antioxidant, and Antidiabetic Activities and Glucose Uptake through 2-NBDG by Hep-2 Liver Cancer Cells Treated with Green Synthesized Silver Nanoparticles Oxid. Med. Cell Longev. 2022 2022 1646687 10.1155/2022/1646687 35620573 PMC9129982 37. Jakinala P. Lingampally N. Hameeda B. Sayyed R.Z. Yahya Khan M. Elsayed E.A. Enshasy H. El Silver Nanoparticles from Insect Wing Extract: Biosynthesis and Evaluation for Antioxidant and Antimicrobial Potential PLoS ONE 2021 16 e0241729 10.1371/journal.pone.0241729 33735177 PMC7971846 38. George I.E. Cherian T. Ragavendran C. Mohanraju R. Dailah H.G. Hassani R. Alhazmi H.A. Khalid A. Mohan S. One-Pot Green Synthesis of Silver Nanoparticles Using Brittle Star Ophiocoma scolopendrina Heliyon 2023 9 e14538 10.1016/j.heliyon.2023.e14538 36967974 PMC10031480 39. Saifuddin N.N. Matussin S.N. Fariduddin Q. Khan M.M. Potentials of Roots, Stems, Leaves, Flowers, Fruits, and Seeds Extract for the Synthesis of Silver Nanoparticles Bioprocess. Biosyst. Eng. 2024 47 1119 1137 10.1007/s00449-024-03044-x 38904717 40. Ahamed M. AlSalhi M.S. Siddiqui M.K.J. Silver Nanoparticle Applications and Human Health Clin. Chim. Acta 2010 411 1841 1848 10.1016/j.cca.2010.08.016 20719239 41. Herrera-Marín P. Fernández L. Pilaquinga F.F. Debut A. Rodríguez A. Espinoza-Montero P. Green Synthesis of Silver Nanoparticles Using Aqueous Extract of the Leaves of Fine Aroma Cocoa Theobroma cacao linneu Electrochim. Acta 2023 447 142122 10.1016/j.electacta.2023.142122 42. Devi M. Devi S. Sharma V. Rana N. Bhatia R.K. Bhatt A.K. Green Synthesis of Silver Nanoparticles Using Methanolic Fruit Extract of Aegle marmelos J. Tradit. Complement. Med. 2020 10 158 165 10.1016/j.jtcme.2019.04.007 32257879 PMC7109472 43. Thatoi P. Kerry R.G. Gouda S. Das G. Pramanik K. Thatoi H. Patra J.K. Photo-Mediated Green Synthesis of Silver and Zinc Oxide Nanoparticles Using Aqueous Extracts of Two Mangrove Plant Species, Heritiera fomes Sonneratia apetala J. Photochem. Photobiol. B 2016 163 311 318 10.1016/j.jphotobiol.2016.07.029 27611454 44. Dhayalan M. Denison M.I.J. Ayyar M. Gandhi N.N. Krishnan K. Abdulhadi B. Biogenic Synthesis, Characterization of Gold and Silver Nanoparticles from Coleus forskohlii J. Photochem. Photobiol. B 2018 183 251 257 10.1016/j.jphotobiol.2018.04.042 29734113 45. Padilla-Camberos E. Sanchez-Hernandez I.M. Torres-Gonzalez O.R. Ramirez-Rodriguez P. Diaz E. Wille H. Flores-Fernandez J.M. Biosynthesis of Silver Nanoparticles Using Stenocereus queretaroensis Materials 2021 14 4543 10.3390/ma14164543 34443066 PMC8399051 46. Ibrahim S. Ahmad Z. Manzoor M.Z. Mujahid M. Faheem Z. Adnan A. Optimization for Biogenic Microbial Synthesis of Silver Nanoparticles through Response Surface Methodology, Characterization, Their Antimicrobial, Antioxidant, and Catalytic Potential Sci. Rep. 2021 11 770 10.1038/s41598-020-80805-0 33436966 PMC7804320 47. Wang D. Xue B. Wang L. Zhang Y. Liu L. Zhou Y. Fungus-Mediated Green Synthesis of Nano-Silver Using Aspergillus sydowii Sci. Rep. 2021 11 10356 10.1038/s41598-021-89854-5 33990673 PMC8121924 48. Choudhary S. Kumawat G. Khandelwal M. Khangarot R.K. Saharan V. Nigam S. Harish Phyco-Synthesis of Silver Nanoparticles by Environmentally Safe Approach and Their Applications Sci. Rep. 2024 14 9568 10.1038/s41598-024-60195-3 38671168 PMC11053078 49. Gholami-Shabani M. Akbarzadeh A. Norouzian D. Amini A. Gholami-Shabani Z. Imani A. Chiani M. Riazi G. Shams-Ghahfarokhi M. Razzaghi-Abyaneh M. Antimicrobial Activity and Physical Characterization of Silver Nanoparticles Green Synthesized Using Nitrate Reductase from Fusarium oxysporum Appl. Biochem. Biotechnol. 2014 172 4084 4098 10.1007/s12010-014-0809-2 24610039 50. Hassan (El-Moushy) R.M. Novel Green Synthesis of Cluster AgNPs by Reduction of Silver (I) by Vitamin C in Presence of Alginate Surfactant Powder in Aqueous Media: Characteristics and Applications Environ. Nanotechnol. Monit. Manag. 2024 22 100971 10.1016/j.enmm.2024.100971 51. Chakraborty I. Feliu N. Roy S. Dawson K. Parak W.J. Protein-Mediated Shape Control of Silver Nanoparticles Bioconjug Chem. 2018 29 1261 1265 10.1021/acs.bioconjchem.8b00034 29461809 52. Sathianathan N. Thazhenandayipurath V.V. Mukundan A.V. Raj A. Latha V. Krishnankutty R.E. Chellappanpillai S. One-Pot Synthesis and Characterization of Naringenin-Capped Silver Nanoparticles with Enhanced Biological Activities Appl. Biochem. Biotechnol. 2025 197 3780 3799 10.1007/s12010-025-05181-9 40009336 53. Rosman N.S.R. Harun N.A. Idris I. Ismail W.I.W. Eco-Friendly Silver Nanoparticles (AgNPs) Fabricated by Green Synthesis Using the Crude Extract of Marine Polychaete, Marphysa moribidii Heliyon 2020 6 e05462 10.1016/j.heliyon.2020.e05462 33241146 PMC7672297 54. Behravan M. Hossein Panahi A. Naghizadeh A. Ziaee M. Mahdavi R. Mirzapour A. Facile Green Synthesis of Silver Nanoparticles Using Berberis vulgaris Int. J. Biol. Macromol. 2019 124 148 154 10.1016/j.ijbiomac.2018.11.101 30447360 55. Mikhailov O.V. Mikhailova E.O. Elemental Silver Nanoparticles: Biosynthesis and Bio Applications Materials 2019 12 3177 10.3390/ma12193177 31569794 PMC6803994 56. Alaqad K. Saleh T.A. Gold and Silver Nanoparticles: Synthesis Methods, Characterization Routes and Applications towards Drugs J. Environ. Anal. Toxicol. 2016 6 4 10.4172/2161-0525.1000384 57. Paul S. Sarkar I. Sarkar N. Bose A. Chakraborty M. Chakraborty A. Mukherjee S. Silver Nanoparticles in Diabetes Mellitus: Therapeutic Potential and Mechanistic Insights Bull. Natl. Res. Cent. 2024 48 33 10.1186/s42269-024-01182-6 58. Akhter M.S. Rahman M.A. Ripon R.K. Mubarak M. Akter M. Mahbub S. Al Mamun F. Sikder M.T. A Systematic Review on Green Synthesis of Silver Nanoparticles Using Plants Extract and Their Bio-Medical Applications Heliyon 2024 10 e29766 10.1016/j.heliyon.2024.e29766 38828360 PMC11140609 59. Parmar N. Singla N. Amin S. Kohli K. Study of Cosurfactant Effect on Nanoemulsifying Area and Development of Lercanidipine Loaded (SNEDDS) Self Nanoemulsifying Drug Delivery System Colloids Surf. B Biointerfaces 2011 86 327 338 10.1016/j.colsurfb.2011.04.016 21550214 60. Zhang Y.N. Poon W. Tavares A.J. McGilvray I.D. Chan W.C.W. Nanoparticle–Liver Interactions: Cellular Uptake and Hepatobiliary Elimination J. Control. Release 2016 240 332 348 10.1016/j.jconrel.2016.01.020 26774224 61. Mashwani Z.U.R. Khan T. Khan M.A. Nadhman A. Synthesis in Plants and Plant Extracts of Silver Nanoparticles with Potent Antimicrobial Properties: Current Status and Future Prospects Appl. Microbiol. Biotechnol. 2015 99 9923 9934 10.1007/s00253-015-6987-1 26392135 62. Niraimathi K.L. Sudha V. Lavanya R. Brindha P. Biosynthesis of Silver Nanoparticles Using Alternanthera sessilis Colloids Surf. B Biointerfaces 2013 102 288 291 10.1016/j.colsurfb.2012.08.041 23006568 63. Ferdous Z. Nemmar A. Health Impact of Silver Nanoparticles: A Review of the Biodistribution and Toxicity Following Various Routes of Exposure Int. J. Mol. Sci. 2020 21 2375 10.3390/ijms21072375 32235542 PMC7177798 64. Mercier-Bonin M. Despax B. Raynaud P. Houdeau E. Thomas M. Mucus and Microbiota as Emerging Players in Gut Nanotoxicology: The Example of Dietary Silver and Titanium Dioxide Nanoparticles Crit. Rev. Food Sci. Nutr. 2018 58 1023 1032 10.1080/10408398.2016.1243088 27740849 65. Salieri B. Kaiser J.P. Rösslein M. Nowack B. Hischier R. Wick P. Relative Potency Factor Approach Enables the Use of in Vitro Information for Estimation of Human Effect Factors for Nanoparticle Toxicity in Life-Cycle Impact Assessment Nanotoxicology 2020 14 275 286 10.1080/17435390.2019.1710872 31928272 66. Soon Kim Y. Yong Song M. Duck Park J. Seuk Song K. Ryol Ryu H. Hyun Chung Y. Kyung Chang H. Hyun Lee J. Hui Oh K. Kelman B.J. Subchronic Oral Toxicity of Silver Nanoparticles Part. Fibre Toxicol. 2010 7 20 10.1186/1743-8977-7-20 20691052 PMC2928176 67. Zhang X.F. Shen W. Gurunathan S. Silver Nanoparticle-Mediated Cellular Responses in Various Cell Lines: An in Vitro Model Int. J. Mol. Sci. 2016 17 1603 10.3390/ijms17101603 27669221 PMC5085636 68. Panzarini E. Mariano S. Carata E. Mura F. Rossi M. Dini L. Intracellular Transport of Silver and Gold Nanoparticles and Biological Responses: An Update Int. J. Mol. Sci. 2018 19 1305 10.3390/ijms19051305 29702561 PMC5983807 69. Galicia-Garcia U. Benito-Vicente A. Jebari S. Larrea-Sebal A. Siddiqi H. Uribe K.B. Ostolaza H. Martín C. Pathophysiology of Type 2 Diabetes Mellitus Int. J. Mol. Sci. 2020 21 6275 10.3390/ijms21176275 32872570 PMC7503727 70. Adeshirlarijaney A. Gewirtz A.T. Considering Gut Microbiota in Treatment of Type 2 Diabetes Mellitus Gut Microbes 2020 11 253 264 10.1080/19490976.2020.1717719 32005089 PMC7524291 71. Zhang P. Li T. Wu X. Nice E.C. Huang C. Zhang Y. Oxidative Stress and Diabetes: Antioxidative Strategies Front. Med. 2020 14 583 600 10.1007/s11684-019-0729-1 32248333 72. Shah M. Nawaz S. Jan H. Uddin N. Ali A. Anjum S. Giglioli-Guivarc’h N. Hano C. Abbasi B.H. Synthesis of Bio-Mediated Silver Nanoparticles from Silybum marianum Mater. Sci. Eng. C 2020 112 110889 10.1016/j.msec.2020.110889 32409047 73. Kurra H. Velidandi A. Sarvepalli M. Pabbathi N.P.P. Godishala V. Aqueous Cymbopogon citratus Nanomaterials 2025 15 328 10.3390/nano15050328 40072131 PMC11901631 74. Abideen S. Vijaya Sankar M. In-Vitro Screening of Antidiabetic and Antimicrobial Activity against Green Synthesized AgNO3 Using Seaweeds J. Nanomed. Nanotechnol. 2015 10 2157 7439 10.4172/2157-7439.s6-001 75. Chinnasamy G. Chandrasekharan S. Bhatnagar S. Biosynthesis of Silver Nanoparticles from Melia azedarach: Int. J. Nanomed. 2019 14 9823 9836 10.2147/IJN.S231340 PMC6913292 31849471 76. Das G. Patra J.K. Debnath T. Ansari A. Shin H.S. Investigation of Antioxidant, Antibacterial, Antidiabetic, and Cytotoxicity Potential of Silver Nanoparticles Synthesized Using the Outer Peel Extract of Ananas comosus PLoS ONE 2019 14 e0220950 10.1371/journal.pone.0220950 31404086 PMC6690543 77. Saratale G.D. Saratale R.G. Benelli G. Kumar G. Pugazhendhi A. Kim D.S. Shin H.S. Anti-Diabetic Potential of Silver Nanoparticles Synthesized with Argyreia nervosa J. Clust. Sci. 2017 28 1709 1727 10.1007/s10876-017-1179-z 78. Saratale R.G. Saratale G.D. Ahn S. Shin H.S. Grape Pomace Extracted Tannin for Green Synthesis of Silver Nanoparticles: Assessment of Their Antidiabetic, Antioxidant Potential and Antimicrobial Activity Polymers 2021 13 4355 10.3390/polym13244355 34960905 PMC8703727 79. Anandachockalingam A. Shanmugam R. Ryntathiang I. Dharmalingam Jothinathan M.K. Green Synthesis of Silver Nanoparticles Using Zingiber officinale Ocimum gratissimum Cureus 2024 16 e58098 10.7759/cureus.58098 38741855 PMC11088973 80. Khan H.A. Ghufran M. Shams S. Jamal A. Khan A. Abdullah Awan Z.A. Khan M.I. Green Synthesis of Silver Nanoparticles from Plant Fagonia cretica Front. Pharmacol. 2023 14 1194809 10.3389/fphar.2023.1194809 37936909 PMC10625996 81. Ahmed F. Sairam S. Urooj A. In Vitro Hypoglycemic Effects of Selected Dietary Fiber Sources J. Food Sci. Technol. 2011 48 285 289 10.1007/s13197-010-0153-7 23572748 PMC3551159 82. Khaleel Basha S. Govindaraju K. Manikandan R. Ahn J.S. Bae E.Y. Singaravelu G. Phytochemical Mediated Gold Nanoparticles and Their PTP 1B Inhibitory Activity Colloids Surf. B Biointerfaces 2010 75 405 409 10.1016/j.colsurfb.2009.09.008 19815393 83. Govindappa M. Hemashekhar B. Arthikala M.K. Ravishankar Rai V. Ramachandra Y.L. Characterization, Antibacterial, Antioxidant, Antidiabetic, Anti-Inflammatory and Antityrosinase Activity of Green Synthesized Silver Nanoparticles Using Calophyllum tomentosum Results Phys. 2018 9 400 408 10.1016/j.rinp.2018.02.049 84. Seneviratne C. Narayanan R. Liu W. Dain J.A. The in Vitro Inhibition Effect of 2 nm Gold Nanoparticles on Non-Enzymatic Glycation of Human Serum Albumin Biochem. Biophys. Res. Commun. 2012 422 447 454 10.1016/j.bbrc.2012.05.014 22579685 85. Yarrappagaari S. Gutha R. Narayanaswamy L. Thopireddy L. Benne L. Mohiyuddin S.S. Vijayakumar V. Saddala R.R. Eco-Friendly Synthesis of Silver Nanoparticles from the Whole Plant of Cleome viscosa Saudi J. Biol. Sci. 2020 27 3601 3614 10.1016/j.sjbs.2020.07.034 33304171 PMC7715480 86. Ashraf J.M. Ansari M.A. Fatma S. Abdullah S.M.S. Iqbal J. Madkhali A. Hamali A.H. Ahmad S. Jerah A. Echeverria V. Inhibiting Effect of Zinc Oxide Nanoparticles on Advanced Glycation Products and Oxidative Modifications: A Potential Tool to Counteract Oxidative Stress in Neurodegenerative Diseases Mol. Neurobiol. 2018 55 7438 7452 10.1007/s12035-018-0935-x 29423819 87. Jini D. Sharmila S. Anitha A. Pandian M. Rajapaksha R.M.H. In Vitro and in Silico Studies of Silver Nanoparticles (AgNPs) from Allium sativum Sci. Rep. 2022 12 22109 10.1038/s41598-022-24818-x 36543812 PMC9772310 88. Rehman G. Umar M. Shah N. Hamayun M. Ali A. Khan W. Khan A. Ahmad S. Alrefaei A.F. Almutairi M.H. Green Synthesis and Characterization of Silver Nanoparticles Using Azadirachta indica Pharmaceuticals 2023 16 1677 10.3390/ph16121677 38139804 PMC10748007 89. Bhinge S.D. Bhutkar M.A. Randive D.S. Wadkar G.H. Hasabe T.S. In Vitro Hypoglycemic Effects of Unripe and Ripe Fruits of Musa sapientum Braz. J. Pharm. Sci. 2017 53 e00159 10.1590/s2175-97902017000400159 90. Johnson E.C. Ebong S.S. Ejinwa G. Eseyin O.A. Comparative Assessment of Antidiabetic Properties of Aqueous Extract and Its Silver Nanoparticles from Vernonia amygdalina Niger. J. Pharm. Appl. Sci. Res. 2024 13 2971 7388 10.60787/nijophasr-v13-i1-542 91. Bhardwaj M. Yadav P. Yadav M. Chahal J. Dalal S. Kataria S.K. Phytochemical Screening and Antidiabetic Efficacy of Balanites aegyptiaca ACS Omega 2024 9 22660 22676 10.1021/acsomega.4c00327 38826529 PMC11137711 92. Sengani M. Bavithra V. Banerjee M. Choudhury A.A. Chakraborty S. Ramasubbu K. Rajeswari V.D. Al Obaid S. Alharbi S.A. Subramani B. Evaluation of the Anti-Diabetic Effect of Biogenic Silver Nanoparticles and Intervention in PPARγ Gene Regulation Environ. Res. 2022 215 114408 10.1016/j.envres.2022.114408 36154863 93. Garcia-Campoy A.H. Perez-Gutierrez R.M. Manriquez-Alvirde G. Muñiz-Ramirez A. Protection of Silver Nanoparticles Using Eysenhardtia polystachya Int. J. Nanomed. 2018 13 2601 2612 10.2147/IJN.S163714 PMC5936013 29750032 94. Chaudhari M.G. Joshi B.B. Mistry K.N. In Vitro Anti-diabetic and Anti-inflammatory Activity of Stem Bark of Bauhinia purpurea Bull. Pharm. Med. Sci. (BOPAMS) 2013 1 139 150 95. Perrone A. Giovino A. Benny J. Martinelli F. Advanced Glycation End Products (AGEs): Biochemistry, Signaling, Analytical Methods, and Epigenetic Effects Oxid. Med. Cell Longev. 2020 2020 3818196 10.1155/2020/3818196 32256950 PMC7104326 96. Tahir H. Rashid F. Ali S. Summer M. Afzal M. Synthesis, Characterization, Phytochemistry, and Therapeutic Potential of Azadirachta indica Conjugated Silver Nanoparticles: A Comprehensive Study on Antidiabetic and Antioxidant Properties Biol. Trace Elem. Res. 2024 203 2170 2185 10.1007/s12011-024-04293-3 38985237 97. Wahab M. Bhatti A. John P. Citation: Evaluation of Antidiabetic Activity of Biogenic Silver Nanoparticles Using Thymus serpyllum on Streptozotocin-Induced Diabetic BALB/c Mice Polymers 2022 14 3138 10.3390/polym14153138 35956652 PMC9370869 98. Shah A.H. Khan A. Khan N. Jannat S. Alarjan K.M. Elshikh M.S. Afareen A. Hameed H. Synergistic Phytochemical and Nanotechnological Exploration of Melia azedarach With Silver Nitrate: Elucidating Multifaceted Antimicrobial, Antioxidant, Antidiabetic, and Insecticidal Potentials Microsc. Res. Tech. 2025 88 542 554 10.1002/jemt.24721 39479799 99. Saratale R.G. Shin H.S. Kumar G. Benelli G. Kim D.-S. Saratale G.D. Exploiting Antidiabetic Activity of Silver Nanoparticles Synthesized Using Punica granatum Leaves and Anticancer Potential against Human Liver Cancer Cells (HepG2) Artif. Cells Nanomed. Biotechnol. 2018 46 211 222 10.1080/21691401.2017.1337031 28612655 100. Das G. Patra J.K. Basavegowda N. Vishnuprasad C.N. Shin H.S. Comparative Study on Antidiabetic, Cytotoxicity, Antioxidant and Antibacterial Properties of Biosynthesized Silver Nanoparticles Using Outer Peels of Two Varieties of Ipomoea batatas Int. J. Nanomed. 2019 14 4741 4754 10.2147/IJN.S210517 PMC6620772 31456635 101. Dugganaboyana G.K. Kumar Mukunda C. Jain A. Kantharaju R.M. Nithya R.R. Ninganna D. Ahalliya R.M. Shati A.A. Alfaifi M.Y. Elbehairi S.E.I. Environmentally Benign Silver Bio-Nanomaterials as Potent Antioxidant, Antibacterial, and Antidiabetic Agents: Green Synthesis Using Salacia oblonga Root Extract Front. Chem. 2023 11 1114109 10.3389/fchem.2023.1114109 36817178 PMC9935694 102. Ullah S. Shah S.W.A. Qureshi M.T. Hussain Z. Ullah I. Kalsoom U.E. Rahim F. Rahman S.S.U. Sultana N. Khan M.K. Antidiabetic and Hypolipidemic Potential of Green AgNPs against Diabetic Mice. ACS Appl Bio Mater. 2021 4 3433 3442 10.1021/acsabm.1c00005 35014427 103. Mughal T.A. Ali S. Mumtaz S. Summer M. Saleem M.Z. Hassan A. Hameed M.U. Evaluating the Biological (Antidiabetic) Potential of TEM, FTIR, XRD, and UV-Spectra Observed Berberis lyceum Conjugated Silver Nanoparticles Microsc. Res. Tech. 2024 87 1286 1305 10.1002/jemt.24509 38351883 104. Iqbal R. Asghar A. Habib A. Ali S. Zahra S. Hussain M.I. Ahsan A.B. Liang Y. Therapeutic Potential of Green Synthesized Silver Nanoparticles for Promoting Wound-Healing Process in Diabetic Mice Biol. Trace Elem. Res. 2024 202 5545 5555 10.1007/s12011-024-04094-8 38351346 105. Sengottaiyan A. Aravinthan A. Sudhakar C. Selvam K. Srinivasan P. Govarthanan M. Manoharan K. Selvankumar T. Synthesis and Characterization of Solanum nigrum-Mediated Silver Nanoparticles and Its Protective Effect on Alloxan-Induced Diabetic Rats J. Nanostructure Chem. 2016 6 41 48 10.1007/s40097-015-0178-6 106. Mahmoudi F. Mahmoudi F. Gollo K.H. Amini M.M. Biosynthesis of Novel Silver Nanoparticles Using Eryngium thyrsoideum boiss Extract and Comparison of Their Antidiabetic Activity with Chemical Synthesized Silver Nanoparticles in Diabetic Rats Biol. Trace Elem. Res. 2021 199 1967 1978 10.1007/s12011-020-02315-4 32749577 107. Ul Haq M.N. Shah G.M. Gul A. Foudah A.I. Alqarni M.H. Yusufoglu H.S. Hussain M. Alkreathy H.M. Ullah I. Khan A.M. Biogenic Synthesis of Silver Nanoparticles Using Phagnalon niveum Nanomaterials 2022 12 830 10.3390/nano12050830 35269321 PMC8912534 108. Rahman A. Rehman G. Shah N. Hamayun M. Ali S. Ali A. Shah S.k. Khan W. Shah M.I.A. Alrefaei A.F. Biosynthesis and Characterization of Silver Nanoparticles Using Tribulus terrestris Molecules 2023 28 4203 10.3390/molecules28104203 37241943 PMC10224066 109. Hosen E. Rahman A. Rahman S. Akash S. Khalekuzzaman Alsahli A.A. Bourhia M. Nafidi H.A. Islam A. Zaman R. Synthesis of Silver Nanoparticles Using Camellia sinensis Leaf Extract: Promising Particles for the Treatment of Cancer and Diabetes Chem. Biodivers. 2024 21 e202301661 10.1002/cbdv.202301661 38359057 110. Virgen-Ortiz A. Limón-Miranda S. Soto-Covarrubias M.A. Apolinar-Iribe A. Rodríguez-León E. Iñiguez-Palomares R. Biocompatible silver nanoparticles synthesized using Rumex hymenosepalus Dig. J. Nanomater. Biostruct 2015 10 927 933 111. Shanker K. Naradala J. Mohan G.K. Kumar G.S. Pravallika P.L. A Sub-Acute Oral Toxicity Analysis and Comparative: In Vivo Anti-Diabetic Activity of Zinc Oxide, Cerium Oxide, Silver Nanoparticles, and Momordica charantia RSC Adv. 2017 7 37158 37167 10.1039/C7RA05693A 112. Kalakotla S. Jayarambabu N. Mohan G.K. Mydin R.B.S.M.N. Gupta V.R. A Novel Pharmacological Approach of Herbal Mediated Cerium Oxide and Silver Nanoparticles with Improved Biomedical Activity in Comparison with Lawsonia inermis Colloids Surf. B Biointerfaces 2019 174 199 206 10.1016/j.colsurfb.2018.11.014 30465994 113. Nagaraja S. Ahmed S.S. Bharathi D.R. Goudanavar P. Rupesh K.M. Fattepur S. Meravanige G. Shariff A. Shiroorkar P.N. Habeebuddin M. Green Synthesis and Characterization of Silver Nanoparticles of Psidium guajava Leaf Extract and Evaluation for Its Antidiabetic Activity Molecules 2022 27 4336 10.3390/molecules27144336 35889209 PMC9319605 114. Khodeer D.M. Nasr A.M. Swidan S.A. Shabayek S. Khinkar R.M. Aldurdunji M.M. Ramadan M.A. Badr J.M. Characterization, Antibacterial, Antioxidant, Antidiabetic, and Anti-Inflammatory Activities of Green Synthesized Silver Nanoparticles Using Phragmanthera austroarabica A. G. Mill and J. A. Nyberg Extract Front. Microbiol. 2023 13 1078061 10.3389/fmicb.2022.1078061 36687608 PMC9849905 115. Pirabbasi E. Zangeneh M.M. Zangeneh A. Moradi R. Kalantar M. Chemical Characterization and Effect of Ziziphora clinopodioides Green-Synthesized Silver Nanoparticles on Cytotoxicity, Antioxidant, and Antidiabetic Activities in Streptozotocin-Induced Hepatotoxicity in Wistar Diabetic Male Rats Food Sci. Nutr. 2024 12 3443 3451 10.1002/fsn3.4008 38726408 PMC11077192 116. Ma Y. Bao M. Peng Y. Gao J. Bao J. Eco-Friendly Nanoparticles Synthesized from Salvia sclarea Ethanol Extract Protect against STZ-Induced Diabetic Nephropathy in Rats via Antioxidant, Anti-Inflammatory, and Apoptosis Mechanisms J. Oleo Sci. 2024 73 1057 1067 10.5650/jos.ess24056 39019617 117. Li X. Bai Y. Jin Z. Svensson B. Food-Derived Non-Phenolic α-Amylase and α-Glucosidase Inhibitors for Controlling Starch Digestion Rate and Guiding Diabetes-Friendly Recipes LWT 2022 153 112455 10.1016/j.lwt.2021.112455 118. Smith D.L. Orlandella R.M. Allison D.B. Norian L.A. Diabetes Medications as Potential Calorie Restriction Mimetics—A Focus on the Alpha-Glucosidase Inhibitor Acarbose Geroscience 2021 43 1123 1133 10.1007/s11357-020-00278-x 33006707 PMC8190416 119. Khan F. Shah A.A. Kumar A. Akhtar S. In Silico Investigation against Inhibitors of Alpha-Amylase Using Structure-Based Screening, Molecular Docking, and Molecular Simulations Studies Cell Biochem. Biophys. 2024 82 2873 2888 10.1007/s12013-024-01403-9 38982021 120. Badeggi U.M. Badmus J.A. Botha S.S. Ismail E. Marnewick J.L. Africa C.W.J. Hussein A.A. Biosynthesis, Characterization, and Biological Activities of Procyanidin Capped Silver Nanoparticles J. Funct. Biomater. 2020 11 66 10.3390/jfb11030066 32961705 PMC7564108 121. Malapermal V. Botha I. Krishna S.B.N. Mbatha J.N. Enhancing Antidiabetic and Antimicrobial Performance of Ocimum basilicum Ocimum sanctum Saudi J. Biol. Sci. 2017 24 1294 1305 10.1016/j.sjbs.2015.06.026 28855825 PMC5562380 122. Patra J.K. Shin H.S. Das G. Characterization and Evaluation of Multiple Biological Activities of Silver Nanoparticles Fabricated from Dragon Tongue Bean Outer Peel Extract Int. J. Nanomed. 2021 16 977 987 10.2147/IJN.S290037 PMC7886385 33603363 123. Patra J.K. Das G. Shin H.S. Facile Green Biosynthesis of Silver Nanoparticles Using Pisum sativum Int. J. Nanomed. 2019 14 6679 6690 10.2147/IJN.S212614 PMC6707436 31695363 124. Das G. Shin H.S. Patra J.K. Comparative Assessment of Antioxidant, Anti-Diabetic and Cytotoxic Effects of Three Peel/ Shelle Food Waste Extract-Mediated Silver Nanoparticles Int. J. Nanomed. 2020 15 9075 9088 10.2147/IJN.S277625 33235452 PMC7680163 125. Das G. Patra J.K. Shin H.S. Biosynthesis, and Potential Effect of Fern Mediated Biocompatible Silver Nanoparticles by Cytotoxicity, Antidiabetic, Antioxidant and Antibacterial, Studies Mater. Sci. Eng. C 2020 114 111011 10.1016/j.msec.2020.111011 32993988 126. Sati S.C. Kour G. Bartwal A.S. Sati M.D. Biosynthesis of Metal Nanoparticles from Leaves of Ficus Palmata and Evaluation of Their Anti-Inflammatory and Anti-Diabetic Activities Biochemistry 2020 59 3019 3025 10.1021/acs.biochem.0c00388 32794692 127. Badmus J.A. Oyemomi S.A. Adedosu O.T. Yekeen T.A. Azeez M.A. Adebayo E.A. Lateef A. Badeggi U.M. Botha S. Hussein A.A. Photo-Assisted Bio-Fabrication of Silver Nanoparticles Using Annona muricata Leaf Extract: Exploring the Antioxidant, Anti-Diabetic, Antimicrobial, and Cytotoxic Activities Heliyon 2020 6 e05413 10.1016/j.heliyon.2020.e05413 33195844 PMC7644911 128. Antonysamy Johnson M.A. Shibila T. Amutha S. Menezes I.R.A. Da Costa J.G.M. Sampaio N.F.L. Coutinho H.D.M. Synthesis of Silver Nanoparticles Using Odontosoria chinensis Pharmaceuticals 2020 13 66 10.3390/ph13040066 32295048 PMC7243107 129. Anjum S. Khan A.K. Qamar A. Fatima N. Drouet S. Renouard S. Blondeau J.P. Abbasi B.H. Hano C. Light Tailoring: Impact of UV-C Irradiation on Biosynthesis, Physiognomies, and Clinical Activities of Morus macroura-Mediated Monometallic (Ag and ZnO) and Bimetallic (Ag and ZnO) Nanoparticles Int. J. Mol. Sci. 2021 22 11294 10.3390/ijms222011294 34681952 PMC8540622 130. Das G. Shin H.S. Patra J.K. Multitherapeutic Efficacy of Curly Kale Extract Fabricated Biogenic Silver Nanoparticles Int. J. Nanomed. 2022 17 1125 1137 10.2147/IJN.S308478 PMC8934171 35313460 131. Das G. Shin H.S. Patra J.K. Key Health Benefits of Korean ueong Dry Root Extract Combined Silver Nanoparticles Int. J. Nanomed. 2022 17 4261 4275 10.2147/ijn.s357343 PMC9484570 36134204 132. Balu S.K. Andra S. Damiri F. Sivaramalingam A. Sudandaradoss M.V. Kumarasamy K. Bhakthavachalam K. Ali F. Kundu M.K. Rahman M.H. Size-Dependent Antibacterial, Antidiabetic, and Toxicity of Silver Nanoparticles Synthesized Using Solvent Extraction of Rosa indica Petals Pharmaceuticals 2022 15 689 10.3390/ph15060689 35745609 PMC9230948 133. Zubair M. Azeem M. Mumtaz R. Younas M. Adrees M. Zubair E. Khalid A. Hafeez F. Rizwan M. Ali S. Green Synthesis and Characterization of Silver Nanoparticles from Acacia nilotica Environ. Pollut. 2022 304 119249 10.1016/j.envpol.2022.119249 35390420 134. Chirumamilla P. Dharavath S.B. Taduri S. Eco-Friendly Green Synthesis of Silver Nanoparticles from Leaf Extract of Solanum khasianum: Optical Properties and Biological Applications Appl. Biochem. Biotechnol. 2023 195 353 368 10.1007/s12010-022-04156-4 36083433 135. Essghaier B. Hannachi H. Nouir R. Mottola F. Rocco L. Green Synthesis and Characterization of Novel Silver Nanoparticles Using Achillea maritima Nanomaterials 2023 13 1964 10.3390/nano13131964 37446480 PMC10343889 136. Essghaier B. Dridi R. Mottola F. Rocco L. Zid M.F. Hannachi H. Biosynthesis and Characterization of Silver Nanoparticles from the Extremophile Plant Aeonium haworthii Nanomaterials 2023 13 100 10.3390/nano13010100 36616010 PMC9823831 137. Sumra A.A. Zain M. Saleem T. Yasin G. Azhar M.F. Zaman Q.U. Budhram-Mahadeo V. Ali H.M. Biogenic Synthesis, Characterization, and In Vitro Biological Evaluation of Silver Nanoparticles Using Cleome brachycarpa Plants 2023 12 1578 10.3390/plants12071578 37050205 PMC10097212 138. Yousefzadeh-Valendeh S. Fattahi M. Asghari B. Alizadeh Z. Dandelion Flower-Fabricated Ag Nanoparticles versus Synthetic Ones with Characterization and Determination of Photocatalytic, Antioxidant, Antibacterial, and α-Glucosidase Inhibitory Activities Sci. Rep. 2023 13 15444 10.1038/s41598-023-42756-0 37723218 PMC10507034 139. Dilipan E. Sivaperumal P. Kamala K. Ramachandran M. Vivekanandhan P. Green Synthesis of Silver Nanoparticles Using Seagrass Cymodocea serrulata Biotechnol. Appl. Biochem. 2023 70 1346 1356 10.1002/bab.2444 36724497 140. Paramasivam D. Balasubramanian B. Suresh R. Kumaravelu J. Vellingiri M.M. Liu W.C. Meyyazhagan A. Alanazi A.M. Rengasamy K.R.R. Arumugam V.A. One-Pot Synthesis of Silver Nanoparticles Derived from Aqueous Leaf Extract of Ageratum conyzoides Antibiotics 2023 12 688 10.3390/antibiotics12040688 37107050 PMC10135330 141. Kiani B.H. Arshad I. Najeeb S. Okla M.K. Almanaa T.N. Al-Qahtani W.H. Abdel-Maksoud M.A. Evaluation of Biogenic Silver Nanoparticles Synthesized from Vegetable Waste Int. J. Nanomed. 2023 18 6527 6544 10.2147/IJN.S432252 PMC10642390 37965280 142. Nagime P.V. Singh S. Shaikh N.M. Gomare K.S. Chitme H. Abdel-Wahab B.A. Alqahtany Y.S. Khateeb M.M. Habeeb M.S. Bakir M.B. Biogenic Fabrication of Silver Nanoparticles Using Calotropis procera Materials 2023 16 4058 10.3390/ma16114058 37297192 PMC10254777 143. Khan Z.U.R. Assad N. Naeem-ul-Hassan M. Sher M. Alatawi S. Alatawi M.S. Omran A.M.E. Jame R.M.A. Adnan M. Khan M.N. Aconitum lycoctonum BMC Chem. 2023 17 128 10.1186/s13065-023-01047-5 37770921 PMC10540474 144. Rani P. Kumar N. Perinmbam K. Devanesan S. AlSalhi M.S. Asemi N. Nicoletti M. Synthesis of Silver Nanoparticles by Leaf Extract of Cucumis melo Molecules 2023 28 4995 10.3390/molecules28134995 37446657 PMC10343578 145. Ejaz U. Afzal M. Mazhar M. Riaz M. Ahmed N. Rizg W.Y. Alahmadi A.A. Badr M.Y. Mushtaq R.Y. Yean C.Y. Characterization, Synthesis, and Biological Activities of Silver Nanoparticles Produced via Green Synthesis Method Using Thymus vulgaris Aqueous Extract Int. J. Nanomed. 2024 19 453 469 10.2147/IJN.S446017 38250190 PMC10799646 146. Das P. Ashraf G.J. Baishya T. Dua T.K. Paul P. Nandi G. Dutta A. Limbu D. Kumar A. Adhikari M.D. Formulation of Silver Nanoparticles Using Duabanga grandiflora Bioprocess. Biosyst. Eng. 2024 47 1139 1150 10.1007/s00449-024-02975-9 38421395 147. Geremew A. Gonzalles J. Peace E. Woldesenbet S. Reeves S. Brooks N. Carson L. Green Synthesis of Novel Silver Nanoparticles Using Salvia blepharophylla Salvia greggii Int. J. Mol. Sci. 2024 25 904 10.3390/ijms25020904 38255978 PMC10815671 148. Arya A. Chahar D. Bhakuni K. Vandana Kumar S. Venkatesu P. Green Synthesis of Silver Nanoparticles Using Drymaria cordata and Their Biocompatibility with Hemoglobin: A Therapeutic Potential Approach ACS Appl. Bio Mater. 2024 7 977 989 10.1021/acsabm.3c00974 38198244 149. Naveed M. Mahmood S. Aziz T. Azeem A. Rajpoot Z. Rehman S.U. Al-Asmari F. Alahmari A.S. Saleh O. Sameeh M.Y. Green-Synthesis of Silver Nanoparticles AgNPs from Podocarpus macrophyllus Sci. Rep. 2024 14 25489 10.1038/s41598-024-75820-4 39461989 PMC11513944 150. Sasikala M. Mohan S. Karuppaiah A. Karthick V. Ragul P.A. Nagarajan A. NanoFlora: Unveiling the Therapeutic Potential of Ipomoea aquatica Nanoparticles J. Genet. Eng. Biotechnol. 2025 23 100470 10.1016/j.jgeb.2025.100470 40074444 PMC11915003 151. Hussain H. Abbas G. Green I.R. Ali I. Dipeptidyl Peptidase IV Inhibitors as a Potential Target for Diabetes: Patent Review (2015–2018) Expert Opin. Ther. Pat. 2019 29 535 553 10.1080/13543776.2019.1632290 31203700 152. Shao D.W. Zhao L.J. Sun J.F. Synthesis and Clinical Application of Representative Small-Molecule Dipeptidyl Peptidase-4 (DPP-4) Inhibitors for the Treatment of Type 2 Diabetes Mellitus (T2DM) Eur. J. Med. Chem. 2024 272 116464 10.1016/j.ejmech.2024.116464 38704940 153. Peres M. Costa H.S. Silva M.A. Albuquerque T.G. The Health Effects of Low Glycemic Index and Low Glycemic Load Interventions on Prediabetes and Type 2 Diabetes Mellitus: A Literature Review of RCTs Nutrients 2023 15 5060 10.3390/nu15245060 38140319 PMC10746079 154. Coronell-Tovar A. Pardo J.P. Rodríguez-Romero A. Sosa-Peinado A. Vásquez-Bochm L. Cano-Sánchez P. Álvarez-Añorve L.I. González-Andrade M. Protein Tyrosine Phosphatase 1B (PTP1B) Function, Structure, and Inhibition Strategies to Develop Antidiabetic Drugs FEBS Lett. 2024 598 1811 1838 10.1002/1873-3468.14901 38724486 155. Singh A. Kukreti R. Saso L. Kukreti S. Mechanistic Insight into Oxidative Stress-Triggered Signaling Pathways and Type 2 Diabetes Molecules 2022 27 950 10.3390/molecules27030950 35164215 PMC8840622 156. Warren F.J. Zhang B. Waltzer G. Gidley M.J. Dhital S. The Interplay of α-Amylase and Amyloglucosidase Activities on the Digestion of Starch in in Vitro Enzymic Systems Carbohydr. Polym. 2015 117 192 200 10.1016/j.carbpol.2014.09.043 25498625 157. Magkos F. Hjorth M.F. Astrup A. Diet and Exercise in the Prevention and Treatment of Type 2 Diabetes Mellitus Nat. Rev. Endocrinol. 2020 16 545 555 10.1038/s41574-020-0381-5 32690918 158. Petroni M.L. Brodosi L. Marchignoli F. Sasdelli A.S. Caraceni P. Marchesini G. Ravaioli F. Nutrition in Patients with Type 2 Diabetes: Present Knowledge and Remaining Challenges Nutrients 2021 13 2748 10.3390/nu13082748 34444908 PMC8401663 159. Kuryłowicz A. Koźniewski K. Anti-Inflammatory Strategies Targeting Metaflammation in Type 2 Diabetes Molecules 2020 25 2224 10.3390/molecules25092224 32397353 PMC7249034 160. Khanna I. Drug Discovery in Pharmaceutical Industry: Productivity Challenges and Trends Drug Discov. Today 2012 17 1088 1102 10.1016/j.drudis.2012.05.007 22627006 161. Berdigaliyev N. Aljofan M. An Overview of Drug Discovery and Development Future Med. Chem. 2020 12 939 947 10.4155/fmc-2019-0307 32270704 Figure 1 Biosynthesis and characterization of AgNPs. Figure 2 Proposed mechanisms of action of AgNPs in diabetes mellitus. AGEs: Advanced glycation end products; DPP-4: Dipeptidyl peptidase 4; AMPK: AMP-activated protein kinase; IRS1: Insulin receptor substrate 1; PPARγ: Peroxisome proliferator-activated receptor gamma; TNF-α: Tumor necrosis factor-alpha; IL-1β: Interleukin-1 beta; PKC-β: Protein kinase C-beta. pharmaceuticals-18-01412-t002_Table 2 Table 2 In vitro methods to evaluate the antidiabetic activity of AgNPs. Methods Fundamentals Reference Inhibition of α-glucosidase or α-amylase Enzymes involved in carbohydrate metabolism; their inhibition prevents the increase in blood glucose. [ 74 75 76 77 78 79 80 Glucose dialysis retardation index (GDRI) A dialysis membrane is used, resembling the human intestine, where an amount of glucose is placed with the test compound, and its ability to release the glucose to an external solution is measured. [ 74 Glucose adsorption capacity It is a colorimetric assay which evaluates the ability of a compound to bind glucose under incubation conditions at 37 °C for 6 h. [ 81 Tyrosine phosphatase 1B inhibitory assay (PTP1B) This enzyme is a negative regulator of the insulin signaling pathway. [ 82 Dipeptidyl peptidase 4 (DPP-4) inhibition assay Inhibition of this enzyme regulates the function of incretins, which in turn stimulate insulin production. [ 83 Non-enzymatic glycosylation of hemoglobin High values of glycated hemoglobin have been associated with nephropathy, retinopathy and cardiovascular disease in DM. [ 84 85 Advanced glycation end-products These molecules are a product of hyperglycemia and are involved in the complications of DM. [ 86 Glucose uptake in muscle cells L6 cells (myoblasts of rat skeletal muscle) are the model skeletal cells to study the mechanisms of glucose uptake by muscle cells. [ 87 Glucose uptake in liver cancer cells Hep-2 liver cancer cells [ 33 Glucose uptake in yeast cells Glucose uptake in yeast cells depends on its diffusion through the membrane, so an increase is favorable. [ 88 89 90 Hepatic glucose production HepG2 hepatic cells can release glucose through gluconeogenesis and glycogenolysis [ 87 Insulin secretion Insulin secretion by MIN6 pancreatic cells [ 87 88 89 90 91 Expression of the Peroxisome proliferator-activated receptor gamma (PPARγ) PPARγ enhances insulin sensitivity. PPARγ expression has been evaluated in RINm5F insulinoma cells [ 92 Peroxide-induced pancreatic INS-1 cell damage H 2 2 [ 93 Assay of non-enzymatic glycosylation of hemoglobin (HbA1c) Hemoglobin reacts non-enzymatically with glucose through a process known as glycation, resulting in the formation of glycated hemoglobin (HbA1c). [ 85 94 Vesperlysine-like advanced glycation end products (AGEs) and pentosidine-like AGEs inhibition assays AGEs accumulation is associated with hyperglycemia and the pathogenic mechanisms underlying T2D [ 95 1,1-diphenyl-2-picrylhydrazyl (DPPH) scavenging activity * DPPH is a well-known free radical; its reduction would show effective scavenging activity. [ 76 83 96 97 98 2,2-azino-bis (3-ethylbenz-thiazoline- ABTS is a free radical; its reduction would show effective scavenging activity. [ 76 78 80 99 100 Ferric reducing antioxidant power assay (FRAP) * Evaluation of the ability to reduce ferric ions (Fe 3+) 2+ [ 72 Total reducing power assay (TRP) or reducing power test * Calculation of the reduction power utilizing potassium ferricyanide [ 72 73 100 Nitrite/nitrate oxide (NOx) assay * Evaluation of the potential of nitric oxide radical scavenging [ 100 Total antioxidant capacity (TAC) * Reduction of molybdenum [ 72 Hydroxyl radical scavenging assay (HRSA) * Scavenging of hydroxyl radicals [ 101 * The antioxidant properties of silver nanoparticles were studied along with the antidiabetic effect. pharmaceuticals-18-01412-t003_Table 3 Table 3 Animal models to evaluate the antidiabetic activity of AgNPs. In Vivo Strain/Drug Dose Fundamentals Reference Diabetic mice induced with alloxan Swiss albino mice/single i.p. injection of alloxan 150 mg/kg; Albino mice/ single i.p. injection 35 mg/kg; Albino mice/single i.p. injection 180 mg/kg. Intraperitoneal application of alloxan in mice causes hyperglycemia and induces diabetes. [ 96 102 103 104 Diabetic rats induced with alloxan Wistar albino rats/ single i.p. injection of alloxan 200 mg/kg; Wistar rats/ single i.p. injection 150 mg/kg. Alloxan injection damages rat pancreas and induces diabetes. [ 105 106 107 Diabetic mice induced with streptozotocin (STZ) BALB/c mice/ single i.p. injection of STZ 45 or 50 mg/kg; BALB/c mice with high-fat diet and two doses of STZ 100 mg/kg; Swiss albino mice/single i.p. injection of STZ 65 mg/kg. Streptozotocin injection damages mouse pancreas and induces diabetes. [ 80 88 97 108 109 Diabetic rats induced with streptozotocin Wistar rats/single i.p. injection of streptozotocin dose (40, 50, 55 or 60 mg/kg); A high-fat diet during 7 weeks followed by an i.p. low dose of streptozotocin (30 mg/kg). Streptozotocin injection damages rat pancreas and induces diabetes. [ 110 111 112 113 114 115 116 Zebra fish Immersion of adult zebrafish ( Danio rerio) Immersion in a glucose solution resulted in a sustained hyperglycemic state. [ 93 pharmaceuticals-18-01412-t004_Table 4 Table 4 In vitro antidiabetic effects of AgNPs biosynthesized with plants. Plant Nanoparticle Size In Vitro Method Concentration Results Reference Gracelliaria edulis syringodium isoetifolium 71 and 110 nm α-amylase inhibition Four concentrations ranging from 100 to 400 μg/mL Gracillaria Edulis Gracillaria Edulis [ 74 Ocimum basilicum Ocimum sanctum Size range of 17.0 ± 8.94 nm for O. basilicum O. sanctum O. sanctum O. basilicum α-amylase and α-glucosidase inhibition α-amylase assay: 3 mg/mL The AgNPs derived from O. sanctum O. basilicum [ 121  Punica granatum Particle size ranging from approximately 35 to 60 nm. Average size 48 nm α-Amylase and α-glucosidase inhibition. 20–100 μg/mL AgNPs inhibited α-amylase and α-glucosidase (IC 50 50 50 [ 99  Melia azedarach 14–20 nm. α-Amylase and α-glucosidase inhibition 200 and 400 μg/mL AgNPs (400 μg/mL) demonstrated high antidiabetic efficacy as measured by α-amylase [ 75 Ananas comosus Not specified α-glucosidase inhibition Enzyme inhibition: 0.008–1.000 μg/mL (10 μg/mL serially diluted) AgNPs at concentrations of 0.063, 0.125, 0.250, 0.500, and 1.000 μg/mL showed a 100% α-glucosidase inhibition [ 76 Ipomoea batatas Not specified α-glucosidase inhibition 0.25–1.00 μg/mL α-glucosidase inhibition: Korean red skin AgNPs: IC 50 50 [ 100  Phaseolus vulgaris 78.02 nm α-glucosidase inhibition 1, 5, and 10 µg/mL Glucosidase inhibition IC 50 [ 122 Pisum sativum 10–25 nm α-glucosidase inhibition 1.0–10 µg/mL α-glucosidase (95.29% inhibition at 10 µg/mL and IC 50 [ 123 P. americana, Beta vulgaris Arachis hypogaea Not specified α-glucosidase inhibition 1.0–5.0 µg/mL AgNPs of Arachis hypogaea 50 [ 124 Equisetum arvense 170.5 nm α-glucosidase inhibition 0.5–2.5 µg/mL α-glucosidase inhibition ranged from 20 to 95.77%. The IC 50 [ 125  Leucosidea sericea 7.8, 2.9, and 3.3 nm α-Amylase and α-glucosidase inhibition 2.5–200 µg/mL AgNPs made with total extract and two different extract fractions. AgNPs exhibited α-amylase inhibition range: IC 50 50 [ 120  Silybum marianum 18.12 and 13.20 nm α-Amylase and α-glucosidase inhibition ABTS, FRAP, DPPH, TAC, TRP Not specified AgNPs from plant and seeds α-amylase inhibition: 25.36% and 26.78%, respectively [ 72  Ficus palmata 9.26 nm α-Amylase and α-glucosidase inhibition 10.0–90.0 µg/mL α-amylase inhibition IC 50 50 [ 126  Annona muricata 86.78 nm α-Amylase and α-glucosidase inhibition Not specified AgNPs displayed strong activities against α-amylase 50 50 50 50 [ 127  Cleome viscosa 5–50 nm α-Amylase and α-glucosidase inhibition 2 2 20.0–100.0 µg/mL One type of the AgNPs synthesized exhibited IC 50 50 [ 85 Odontosoria chinensis 22.3–48.2 nm α-amylase inhibition 50, 100, 150, 200 and 250 µL/mL 21.53–51.85% of α-amylase inhibition [ 128 Heritiera fomes Sonneratia apetala 20–30 nm and 70–100 nm α-amylase inhibition 100–500 µg/mL 280.39 and 273.48 μg/mL for AgNPs from bark and leaf extracts, respectively [ 43  Vitis vinifera 20–35 nm α-amylase and α-glucosidase inhibition 20, 40, 60, 80, and 100 µg/mL Inhibition of α-amylase (IC 50 50 50 50 [ 78  Morus macroura 22.93 nm α-amylase and α-glucosidase inhibition Not specified α-amylase inhibition 67.77 ± 3.29% and α-glucosidase inhibition 35.83 ± 2.40%. [ 129  Zinger officinale Not reported α-amylase and α-glucosidase inhibition 10 to 50 µg/mL At the highest concentration, the α-amylase inhibitory assay and the β-glucosidase inhibitory assay showed approximately 78% and 80% inhibition. [ 79  Allium sativum 10–30 nm α-amylase and α-glucosidase inhibition 20 to 100 µg/mL AgNPs inhibited significally higher α-amylase and α-glucosidase compared to control acarbose. 50 50 [ 87  Brassica oleracea 276.35 nm α-glucosidase inhibition 1.0–5.0 μg/mL At 2.5 μg/mL AgNPs displayed 80.44% inhibition [ 130  Korean Ueong 170.3 nm α-glucosidase inhibition 1.0–100.0 μg/mL α-glucosidase with a maximum inhibition value of 95.41% at 5.0 µg/mL and more than 86% inhibition at 2.5 µg/mL and the estimated IC 50 [ 131 Rosa indica 18, 12, α-amylase and α-glucosidase inhibition 10, 25, 50, 75, and 100 µg/mL) IC 50 [ 132  Kigelia africana 25–35 nm PPARγ expression (semiquantitative Real Time-PCR) in RINm5F insulinoma cells 25 and 50 µg/mL AgNPs upregulated PPARγ expression [ 92  A. nilotica 20–50 nm α-glucosidase inhibition 50 and 250 µg/mL Silver nitrate at 0.1 M and 3 mM were used to synthesize AgNPs, α-glucosidase inhibition range: [ 133  Fagonia cretica 20 to 50 nm α-amylase, α-glucosidase inhibition 62–1000 µg/mL α-amylase inhibition 51.10 to 83.53%. [ 80  Solanum khasianum 15.96 nm α-amylase inhibition 50–250 μg/mL Maximum [ 134  Achillea maritima subsp. Marítima 14.13 to 21.26 nm α-amylase, α-glucosidase inhibition 20–120 μg/mL α-amylase IC 50 50 50 [ 135  Aeonium haworthii 35–55 nm α-amylase inhibition 20–120 μg/mL α-amylase inhibition IC 50 50 [ 136  Cleome brachycarpa 20 to 80 nm α-amylase inhibition 0.3–1.5 μg/mL Higher α-amylase inhibition than control acarbose [ 137  Azadirachta indica 34.43 nm Glucose uptake by yeast 10, 20, 40, 80, 100 μg/mL AgNPs showed the highest activity (75.0%) glucose uptake by yeast. [ 88  Taraxacum officinale 45–55 nm α-glucosidase inhibition 100, 300, and 600 μg/mL α-glucosidase enzyme inhibitory effect (88.37%) in comparison with controls C-AgNPs1 (61.7%) and C-AgNPs2 (50.5%). [ 138 Cymodocea serrulata 60 and 69 nm α-amylase, α-glucosidase inhibition 25–125 μg/mL AgNPs exhibited α-amylase and α-glucosidase inhibition 2 2 [ 139  Ageratum conyzoides 30–90 nm α-amylase inhibition 3.12–100 μg/mL α-amylase inhibition: IC 50 2 2 [ 140 Solanum tuberosum Coriander sativum 65 nm for potato peels extract and 70 nm for coriander stems extract α-amylase inhibition Not specified AgNPs from potato peel extracts inhibited more than positive control (86.72 ± 0.19%). [ 141  Salacia oblonga 99.8 nm α-amylase inhibition 20–100 μg/mL EC 50 50 [ 101  Calotropis procera 23.8 nm α-amylase inhibition Not specified α-amylase inhibitory activity higher (36.33%) than that of metformin (1.44%) [ 142  Aconitum lycoctonum L. (Ranunculaceae) 67 nm α-amylase inhibition 10–30 mg/mL The highest concentration achieved 59.12% inhibition. [ 143 Cucumis melo 66.7–92.3 α-amylase and α-glucosidase inhibition 20–100 μg/mL AgNPs showed the highest inhibition activity on both enzymes at the 100 µg/mL concentration [ 144  Thymus Vulgaris 44.6 nm α-amylase inhibition 250–1000 μg/mL Inhibitory activity was observed from 50.67% to 82.57%. [ 145  Duabanga grandiflora 99.72 nm α-amylase inhibition 10–1000 α-Amylase inhibitory activity: IC 50 [ 146 Salvia blepharophylla Salvia greggii 52.4 and 62.5 nm α-amylase inhibition 20–100 α-amylase inhibition of Salvia blepharophylla Salvia greggii AgNPs [ 147  Drymaria cordata 5–100 nm α-amylase and α-glucosidase inhibition 25–1000 α-amylase inhibition: 68.92 ± 0.16%; D. cordata [ 148  B. aegyptiaca 10.352 nm Glucose Uptake Assay in C2C12 cells 6.25–100 Glucose increase uptake: 156.00% compared to control. [ 91  Podocarpus macrophyllus 13 nm α-amylase inhibition 200–1000 μg/mL α-amylase inhibition [ 149  Ipomoea aquatica 36.27 nm α-amylase inhibition Not specified α-amylase inhibition = 78.55%. [ 150  Cymbopogon citratus 135.41 α-amylase and α-glucosidase inhibition 10–50 μg/mL α-amylase inhibition IC 50 50 [ 73  Melia azedarac 20–30 nm α-amylase inhibition Not specified α-amylase inhibition: 80.33%. [ 98  Berberis lyceum 11.02 nm α-amylase and α-glucosidase inhibition 50–250 μg/mL α-amylase inhibition: 78 ± 0.38% [ 103 pharmaceuticals-18-01412-t005_Table 5 Table 5 Antidiabetic effects of AgNPs biosynthesized in animal models. Origin Nanoparticle Size Animal Model (Species, Strain, Sex, Age, Weight) Dose and Time of AgNPs Results Reference  Eysenhardtia polystachya 10–12 nm Glucose-induced diabetic zebrafish. 5 and 10 μg/mL. Diminution of hyperglycemia improved hyperlipidemia. [ 93  E. phyllantus 30, 45, and 65 nm Albino mice, 60 days old 150 and 300 mM for 15 days. A significant decrease in the glucose level and significant recovery in the liver and kidney. [ 102  Cucumis sativus 27–97 nm Adult albino mice, 4 and 6 weeks, weight approximately 25 g. A 5% ointment: Nanoparticles ointment treated mice showed significant wound contraction at day 15 as compared to control. [ 104  Azadirachta indica Not reported Mature male Swiss albino mice, weight: 30–35 g; average age 8 weeks. AgNPs 100 mg/kg; Improvement in the body weight and blood glucose level. [ 96  Berberis lyceum 11.02 nm Diabetic induced by alloxan, Swiss albino mice weighing 38.6 ± 3.0 g. Average age: 8 weeks 200 mg/kg. AgNPs decreased in blood glucose. [ 103  Phagnalon niveum 12 to 28 nm. Average: 21 nm. 8-week-old Wistar rats weighing 140–150 g. 10 mg/kg A significant reduction in blood glucose levels and an increase in [ 107  Solanum nigrum 4–25 nm Male Wistar albino rats aged more AgNPs 10 mg/kg Reduced the blood glucose level over the period of treatment. Improved the dyslipidemic [ 105  Eryngium thyrsoideum Boiss 10 and 56 nm Male Wistar rats weighing 180–200 g. Alloxan induced diabetes 2.5 mg/kg for 14 consecutive days. Silver nanoparticles decreased significantly [ 106  Camellia sinensis 15.954 nm Male Swiss albino mice (20–25 g) 100 mg/kg/ AgNPs reduced blood glucose, total cholesterol, [ 109  Fagonia cretica 29.39 nm Male Balb/C albino mice that were 6 weeks old and weighed 200 mg/kg body weight. Significant weight gain and a decrease in all biochemical markers (blood glucose, pancreas panel, liver function panel, renal function panel, and lipid profile). [ 80  Azadirachta indica 34.43 nm Adult BALB/C mice weighing 25–30 g and 5 weeks old. 10–40 mg/kg A significant decrease in blood glucose level. Diabetic mice treated with different doses of AI-AgNPs revealed regeneration of islet cells in pancreas. [ 88  Thymus serpyllum Average: 42 nm 4-week-old male BALB/c mice. Mice were fed a high-fat diet and low doses of streptozotocin 5 and 10 mg per kg of body weight for 28 days. A 10 mg/kg dose increases the expression of AMP-activated protein kinase (AMPK) and insulin receptor substrate 1 (IRS1), enhancing glucose uptake in cells. [ 97  Tribulus terrestris 22 nm 5-week-old BALB/C mice, weight: 25–30 g. 10, 20, 30, or 40 mg/kg for 30 days. Treated groups displayed histological improvements in pancreas and liver, also blood glucose levels dropped in a dose-dependent manner. [ 108  Momordica charantia Less than 100 nm Male Wistar rats, weighing between 180 and 200 g. Diabetes induction with a single intraperitoneal dose of streptozotocin. 800, 1000, and 2000 mg/kg for 14 weeks. AgNPs showed potent [ 111  Psidium guajava 52.12–65.02 nm Both sexes of 160–200 g Wistar. 200 and 400 mg/kg for 21 days. Decrease in the blood glucose level, preventing subsequent weight loss and ameliorating lipid profile [ 113  Phragmanthera austroarabica 13 nm Male Wistar rats 130 and 170 g. 200 mg/kg/day, p.o. AgNPs decreased insulin, serum glucose, leptin, and Homeostatic Model Assessment of Insulin Resistance (HOMA-IR). [ 114  Salvia Sclarea Average size range 40 ± 5 nm Adult male Wistar rats with weights between 100 and 150 10 mg/kg/day, intraperitoneal. AgNPs led to a significant rise in glutathione, superoxide dismutase, glutathione peroxidase, [ 116  Ziziphora clinopodioides Below 100 nm Streptozotocin-induced Wistar diabetic male rats 50–400 μg/kg AgNPs reduced the fasting blood glucose levels compared to the diabetic group. [ 115  Rumex hymenosepalus 9 ± 3 nm Streptozotocin-induced 150 μg/kg. Treatment during 9 days with AgNPs decreased 50% the blood glucose in diabetic rats. The glucose tolerance test showed that in diabetic rats treated with AgNPs, there was a minimal increase in blood glucose. [ 110  Lawsonia inermis 14.9 nm Male Wistar rats, weighing between 180 and 200 g 200 mg/kg. Potent hypoglycemic activity compared to the extract group [ 112 ",
  "metadata": {
    "Title of this paper": "An Overview of Drug Discovery and Development",
    "Journal it was published in:": "Pharmaceuticals",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472463/"
  }
}