{
  "title": "Paper_941",
  "abstract": "pmc J Clin Med J Clin Med 2745 jclinmed jcm Journal of Clinical Medicine 2077-0383 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470864 PMC12470864.1 12470864 12470864 41010722 10.3390/jcm14186518 jcm-14-06518 1 Article Bidirectional Neoadjuvant Chemotherapy for Patients with Gastric Cancer and Synchronous Peritoneal Metastases (GCPMs): Results of a Western Phase II Study Biacchi Daniele Writing – review & editing 1 https://orcid.org/0000-0001-6414-7835 Angrisani Marco Writing – original draft 1 2 * Picone Vincenzo Methodology Supervision 3 Scuto Daniele Data curation Supervision 1 Gallotti Maria Gloria Methodology Data curation 1 https://orcid.org/0000-0001-8317-2323 Accarpio Fabio Data curation Supervision Investigation 1 https://orcid.org/0000-0002-6983-8624 Iafrate Franco Supervision 3 Masci Giorgio Supervision Resources Data curation 3 Iannone Immacolata Data curation Resources 1 Spagnoli Alessandra Formal analysis Methodology 4 Sammartino Paolo Writing – review & editing Conceptualization Project administration Supervision 1 Saito Shin Academic Editor 1 immacolata.iannone@uniroma1.it 2 3 4 * marco.angrisani3@gmail.com 16 9 2025 9 2025 14 18 497642 6518 05 8 2025 01 9 2025 12 9 2025 16 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background: Methods: 2 2 2 2 2 Results: 2 Conclusions: gastric cancer peritoneal surface malignancies cytoreductive surgery peritoneal metastases hyperthermic intraperitoneal chemotherapy pressurized intraperitoneal aerosol chemotherapy Sapienza University of Rome RG12117A807F5D8 This research received funding from Sapienza University of Rome under grant number no. RG12117A807F5D8. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Gastric cancer (GC) remains a significant clinical challenge, ranking fifth in terms of both incidence and mortality worldwide [ 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 17 21 22 23 24 25 26 27 2. Materials and Methods 2.1. Patient Eligibility and Study Design This study was designed as a single-center, phase II study. Patients considered for the study were those with GC according to the last AJCC classification [ 28 The eligibility criteria included (1) histologically proven GC with synchronous PMs diagnosed by laparoscopy in patients not undergoing previous therapeutic interventions; (2) aged between 18 and 70 years; (3) performance status (Eastern Cooperative Oncology Group) of 0–1; (4) Peritoneal Cancer Index (PCI) < 13 at staging laparoscopy (29); (5) adequate cardiac, renal (serum creatinine level within the upper limit of the normal), hepatic (total serum bilirubin level < 2.0 mg/dL and serum transaminases < 100 UI) and bone marrow function (leukocyte count 3000–12.000/mm 3 3 As shown in Figure 1 29 2.2. Treatment Schedule: Bidirectional Chemotherapy (NIPS) All patients received bidirectional chemotherapy in the Medical Oncological Department and a series of 3-week cycles of NIPS was performed. Capecitabine was administered orally (1000 mg/m 2 2 Figure 2 2.3. Surgical Procedure After four weeks from the last NIPS cycle, patients considered resectable according to the CT scan and restaging laparoscopy, and who fulfilled the inclusion and exclusion criteria for the study, underwent surgery. The cytoreduction procedures included, after intraoperative PCI evaluation at the beginning of surgery, in every patient total gastrectomy with D2 lymphadenectomy along with excision any way of target structures of peritoneal spread, such as the greater and lesser omentum, cecal appendix, round and falciform ligament of the liver, and, in postmenopausal patients, bilateral adnexectomy. Each cytoreduction procedure included peritonectomy procedures and visceral resections according to the extent of the disease, with the goal of obtaining a completeness of cytoreduction (CC) score of CC 0/CC1 [ 30 2 2.4. Evaluation of Outcomes The primary endpoints of this study were the conversion surgery rate and treatment-related adverse effects in all patients enrolled in the study. After each cycle of treatment, physical examination, laboratory analysis (adequate cardiac, renal, hepatic and bone marrow function) and chest radiography were performed. Drug-induced toxicity was graded according to the National Cancer Institute Common Terminology Criteria for Averse Events (CTCAE version 4.0) [ 31 32 33 34 2.5. Statistical Analysis Patient characteristics were described using the median and interquartile range (IQR) for continuous variables, and as absolute frequencies and percentages for categorical variables. Overall survival (OS) was defined as the time from the date of enrollment to death from any cause. Patients without an OS event were censored at the date they were last known to be alive. Progression-free survival (PFS) was defined as the time from the date of enrollment to the first documented disease recurrence or death from any cause. Patients without a PFS event were censored at the date of their last disease assessment. The PFS and OS probabilities were estidespmated using the non-parametric Kaplan–Meier method and presented graphically. A p 3. Results During the study period (January 2018–December 2024), 293 patients affected by peritoneal metastases from gastric cancer were evaluated in our center. A total of 94 patients were affected by metachronous peritoneal metastases after a previous gastrectomy for cancer, 91 had synchronous GCPMs but with disease extension beyond the eligibility criteria for this study, while 41 patients with synchronous GCPMs, and although they met the criteria for inclusion in the study, they had already started systemic chemotherapy at the time of evaluation. Considering also 38 patients with synchronous GCPMs suitable for immune or target therapy, and excluding 4 patients who refused to participate, 25 patients were finally enrolled in the study ( Figure 3 Patient characteristics are presented in Table 1 Figure 1 Treatment was generally well tolerated, and all the NIPS-related adverse events were classified as grade < 3 according to the Common Terminology Criteria for Adverse Events (CTCAE). No intraperitoneal infections or chemoport-related complications were observed. At the end of the neoadjuvant treatment and after restaging, 13 patients (52%) underwent surgery: 12 after three cycles of NIPS and 1 after six cycles. The remaining 12 patients (48%) showing disease progression during treatment occurring after a median of four NIPS cycles, left the study toward palliative procedures or best supportive care. Disease progression involved both the peritoneum and liver in five cases, the liver alone in three cases, the peritoneum alone in two cases, the mediastinum in one case, and both the mediastinum and liver in one additional patient. The median follow-up was 33.9 months (range: 5.21–83.51 months). The median overall survival (OS) for the entire cohort was 17.3 months, while the median progression-free survival (PFS) was 13.3 months ( Figure 4 Conversion surgery was performed in 13 patients (52%) who underwent cytoreductive surgery (CRS) combined with hyperthermic intraperitoneal chemotherapy (HIPEC) using cisplatin (100 mg/m 2 35 Figure 5 Cytoreductive surgery was performed according to the peritonectomy procedures proposed by PH Sugarbaker [ 36 Table 2 In all the resected cases, the pathological response to neoadjuvant chemotherapy was classified as PRGS grade 2, characterized by fibrosis and necrosis predominating over residual tumor tissue ( Figure 6 A reduction in PCI was observed only in patients who underwent surgery (n = 13), with a decrease from a median of 12 [IQR(7–12)] at baseline to 6 [IQR (4.5–10)] after NIPS. No reliable post-treatment PCI assessment was possible in the 12 patients who progressed and did not undergo surgical exploration. All the patients who underwent surgery also received three additional cycles of adjuvant NIPS with the same regimen used in the neoadjuvant phase. At the time of the last follow-up, 6 of the 13 resected patients were alive and disease-free, 1 patient was alive with peritoneal recurrence, and 6 patients had died. Among the deceased patients, three died due to isolated peritoneal recurrence, one due to combined peritoneal and hepatic recurrence, one due to central nervous system recurrence, and one due to pleural and mediastinal relapse. Among the patients who underwent surgery, the median overall survival (OS) was 26 months and the median progression-free survival (PFS) was 20 months ( Figure 7 4. Discussion The results we obtained are similar to those recently reported in the literature, both in terms of the oncologic outcomes and in the percentage of patients converted to radical surgery following bidirectional treatment for synchronous GCPMs [ 22 37 38 39 40 41 42 43 44 45 46 47 48 26 27 49 50 51 52 3 17 53 54 46 43 46 55 56 57 58 59 60 45 61 61 62 63 64 65 66 67 68 64 46 56 45 46 54 69 70 In our view, standardizing the use of this technique as part of a curative strategy is advisable, particularly as an adjunct to conventional systemic therapy. A relevant example is the failure of the GASTRIPEC-1 trial [ 71 Our study has some limitations, including the small sample size and lack of a control arm treated with systemic chemotherapy alone, which precludes direct comparison. No formal power calculation was performed. This reflects our role as a surgical referral center for peritoneal metastases, where many patients (41 in our series) were recruited after having already initiated systemic therapy. Furthermore, patients eligible for targeted or immunotherapies (e.g., HER2-positive, MSI-H/dMMR, or high PD-L1 CPS) were intentionally excluded by the protocol, as the expected outcomes of these modern treatments appear superior to those achievable with an approach that, in Western practice, remains investigational. Notably, 38 such patients were screened but not enrolled. Lastly, the long accrual period (2018–2024) may have introduced temporal heterogeneity into the diagnostic work-up, perioperative management, and access to locoregional strategies, potentially confounding both the conversion rates and survival outcomes. Nonetheless, in a context of scarce prospective Western data, our experience provides valuable clinical insight and lays the groundwork for future multicenter trials. Looking ahead, it will be essential to integrate the bidirectional approach with novel targeted agents (e.g., anti-FGFR2b, Claudin 18.2), immunotherapy, or maintenance strategies to extend the indications to patients without current molecular targets. Additional developments include the use of predictive response systems (PRGS score, cytologic conversion, imaging criteria) and optimization of minimally invasive cytoreductive and HIPEC techniques, which are already under investigation in advanced centers. 5. Conclusions This study highlights the potential benefits of neoadjuvant intraperitoneal treatment in Western patients, supporting its role beyond the Eastern context, where it is already a standard of care. Our findings suggest that NIPS is a safe, well-tolerated, and effective strategy, achieving high rates of conversion surgery comparable to those reported in Eastern countries. Given these promising results, bidirectional chemotherapy should be considered in the preoperative setting for highly selected Western patients with gastric cancer and peritoneal metastases. Future studies should focus on refining multimodal approaches, optimizing patient selection, and integrating novel therapies to further improve survival outcomes. Acknowledgments We thank the organizing committee of the 13th International PSOGI Congress (Venice, 4–6 October 2023) for the opportunity to present the primary results of our study. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, D.B., M.A. and P.S.; methodology, D.B., M.A., P.S., F.I. and V.P.; software, A.S.; validation and formal analysis, A.S.; investigation, F.A., D.S., M.G.G., I.I. and G.M.; resources and data curation, F.A., D.S., M.G.G. and G.M.; writing—original draft preparation, D.B., M.A. and P.S.; writing—review and editing, P.S.; visualization, M.A.; supervision, D.B., M.A. and P.S.; project administration and funding acquisition, D.B. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement This study was carried out in accordance with the Declaration of Helsinki and was approved by the Department of Surgery, Sapienza University of Rome Institutional Review Board. Phase I study approved on 11-10-2017 (approval code: RP21/2017). Phase II study approved on 11-1-2023 (approval code: A03/23). Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Data Availability Statement The data presented in this study are available on request from the corresponding author. The data are not publicly available due to privacy issues. Conflicts of Interest The authors declare no conflicts of interest. References 1. Bray F. Laversanne M. Sung H. Ferlay J. Siegel R.L. Soerjomataram I. Jemal A. Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J. Clin. 2024 74 229 263 10.3322/caac.21834 38572751 2. Bencivenga M. Simbolo M. Ciaparrone C. Vicentini C. Torroni L. Piredda M.L. Sacco M. Alloggio M. Castelli C. Tomezzoli A. Poorly cohesive gastric cancers showing the transcriptomic hallmarks of epithelial-mesenchymal transition behave aggressively Ann. Surg. 2022 276 822 829 10.1097/SLA.0000000000005648 35930005 3. Koemans W.J. Lurvink R.J. Grootscholten C. Verhoeven R.H.A. de Hingh I.H. van Sandick J.W. Synchronous peritoneal metastases of gastric cancer origin: Incidence, treatment and survival of a nationwide Dutch cohort Gastric Cancer 2021 24 800 809 10.1007/s10120-021-01160-1 33495964 4. Bergquist J.R. Leiting J.L. Habermann E.B. Cleary S.P. Kendrick M.L. Smoot R.L. Nagorney D.M. Truty M.J. Grotz T.E. Early-onset gastric cancer is a distinct disease with worrisome trends and oncogenic features Surgery 2019 166 547 555 10.1016/j.surg.2019.04.036 31331685 5. Anderson W.F. Rabkin C.S. Turner N. Fraumeni J.F. Jr. Rosenberg P.S. Camargo M.C. The changing face of noncardia gastric cancer incidence among US non-Hispanic whites J. Natl. Cancer Inst. 2018 110 608 615 10.1093/jnci/djx262 29361173 PMC6005150 6. Park K. Shin C.M. Kim N. Won S. Song C.-H. Ohn J.H. Lee S. Park J.H. Yie G.-E. Kang S.J. rs762855 single nucleotide polymorphism modulates the risk for diffuse-type gastric cancer in females: A genome-wide association study in the Korean population Gastric Cancer 2025 28 145 159 10.1007/s10120-024-01575-6 39862296 PMC11842433 7. Ikoma N. Blum M. Chiang Y.-J. Estrella J.S. Roy-Chowdhuri S. Fournier K. Mansfield P. Ajani J.A. Badgwell B.D. Yield of staging laparoscopy and lavage cytology for radiologically occult peritoneal carcinomatosis of gastric cancer Ann. Surg. Oncol. 2016 23 4332 4337 10.1245/s10434-016-5409-7 27384751 8. Pereira M.A. Ramos M. Faraj S.F. Clinicopathological and prognostic features of Epstein-Barr virus infection, microsatellite instability, and PD-L1 expression in gastric cancer J. Surg. Oncol. 2018 117 829 839 10.1002/jso.25022 29534305 9. Rijken A. Lurvink R.J. Luyer M.D.P. Nieuwenhuijzen G.A.P. van Erning F.N. van Sandick J.W. de Hingh I.H.J.T. The burden of peritoneal metastases from gastric cancer: A systematic review on the incidence, risk factors and survival J. Clin. Med. 2021 10 4882 10.3390/jcm10214882 34768402 PMC8584453 10. Ajani J.A. D’aMico T.A. Bentrem D.J. Chao J. Cooke D. Corvera C. Das P. Enzinger P.C. Enzler T. Fanta P. Gastric Cancer, version 2.2022, NCCN clinical practice Guidelines in oncology J. Natl. Compr. Cancer Netw. 2022 20 167 192 10.6004/jnccn.2022.0008 35130500 11. Lordick F. Carneiro F. Cascinu S. Fleitas T. Haustermans K. Piessen G. Vogel A. Smyth E. Gastric cancer: ESMO Clinical Practice Guideline for diagnosis, treatment and follow-up Ann. Oncol. 2022 33 1005 1020 10.1016/j.annonc.2022.07.004 35914639 12. Gül S. Alberto M. Annika K. Pratschke J. Rau B. Emerging treatment modalities for gastric cancer with macroscopic peritoneal metastases: A systematic review J. Surg. Oncol. 2024 130 1364 1377 10.1002/jso.27987 39658832 13. Van Der Speeten K. Stuart O.A. Sugarbaker PHPharmacology of perioperative intraperitoneal and intravenous chemotherapy in patients with peritoneal surface malignancy Surg. Oncol. Clin. N. Am. 2012 21 577 597 10.1016/j.soc.2012.07.013 23021717 14. Dedrick R.L. Theoretical and experimental bases of intraperitoneal chemotherapy Semin. Oncol. 1985 12 (Suppl. S4) 1 6 4048968 15. Koga S. Hamazoe R. Maeta M. Shimizu N. Murakami A. Wakatsuki T. Prophylactic therapy for peritoneal recurrence of gastric cancer by continuous hyperthermic peritoneal perfusion with mitomycin C Cancer 1988 61 232 237 10.1002/1097-0142(19880115)61:2&#x0003c;232::AID-CNCR2820610205&#x0003e;3.0.CO;2-U 3121165 16. Fujimoto S. Shrestha R.D. Kokubun M. Ohta M. Takahashi M. Kobayashi K. Kiuchi S. Okui K. Miyoshi T. Arimizu N. Intraperitoneal hyperthermic perfusion combined with surgery effective for gastric cancer patients with peritoneal seeding Ann. Surg. 1988 208 36 41 10.1097/00000658-198807000-00005 3133994 PMC1493580 17. Boshier P.R. Tekkis N. Baggaley A. Robb H.D. Lafaurie G. Simkens G. Nilsson M. Hanna G.B. Petty R. Outcomes of intraperitoneal chemotherapy for the treatment of gastric cancer with peritoneal metastasis: A comprehensive systematic review and meta-analysis Eur. J. Surg. Oncol. 2025 51 109499 10.1016/j.ejso.2024.109499 39644811 18. Yonemura Y. Bandou E. Sawa T. Yoshimitsu Y. Endou Y. Sasaki T. Sugarbaker P. Neoadjuvant treatment of gastric cancer with peritoneal dissemination Eur. J. Surg. Oncol. 2006 32 661 665 10.1016/j.ejso.2006.03.007 16621433 19. White M.G. Badgwell B.D. Laparoscopic heated intraperitoneal chemotherapy in the treatment of carcinomatosis of gastric adenocarcinoma origin J. Clin. Med. 2021 10 4757 10.3390/jcm10204757 34682880 PMC8539356 20. Chia D.K.A. So J.B.Y. Recent advances in intra-peritoneal chemotherapy for gastric cancer J. Gastric Cancer 2020 20 115 126 10.5230/jgc.2020.20.e15 32595996 PMC7311211 21. Tiwari A. Merath K. Arora S.P. Kitano M. Court C.M. Parikh A. Role of locoregional therapy in gastric cancer with peritoneal metastasis Surg. Oncol. Insight 2024 3 100065 10.1016/j.soi.2024.100056 22. Ishigami H. Fujiwara Y. Fukushima R. Nashimoto A. Yabusaki H. Imano M. Imamoto H. Kodera Y. Uenosono Y. Amagai K. Phase III trial comparing intraperitoneal and intravenous paclitaxel plus S-1 versus cisplatin plus S-1 in patients with gastric cancer with peritoneal metastasis: PHOENIX-GC trial J. Clin. Oncol. 2018 36 1922 1929 10.1200/JCO.2018.77.8613 29746229 23. Li Y. Lin H. Huang K. Zhao J. Efficacy of conversion surgery after neoadjuvant intraperitoneal-systemic chemotherapy in treating peritoneal metastasis of gastric cancer J. BUON 2021 26 211 217 33721454 24. Bin Y. Lan D. Bao W. Yang H. Zhou S. Huang F. Wang M. Peng Z. SOX combined with intraperitoneal perfusion of docetaxel compared with DOS regimen in the first-line therapy for advanced gastric cancer with malignant ascites: A prospective observation Trials 2022 23 687 10.1186/s13063-022-06143-w 35279214 PMC8917651 25. Lu S. Yang Z.-Y. Yan C. Liu W.-T. Ni Z.-T. Yao X.-X. Hua Z.-C. Feng R.-H. Zheng Y.-N. Wang Z.-Q. A phase III trial of neoadjuvant intraperitoneal and systemic chemotherapy for gastric cancer with peritoneal metastasis Future Oncol. 2022 18 1175 1183 10.2217/fon-2021-1414 35114800 26. Morgagni P. Bencivenga M. Carneiro F. Cascinu S. Derks S. Di Bartolomeo M. Donohoe C. Eveno C. Gisbertz S. Grimminger P. International consensus on the management of metastatic gastric cancer: Step by step in the foggy landscape: Bertinoro Workshop, November 2022 Gastric Cancer 2024 27 649 671 10.1007/s10120-024-01479-5 38634954 PMC11193703 27. Kitai T. Yamanaka K. Conversion surgery for gastric cancer with PM J. Surg. Oncol. 2024 130 1306 1315 10.1002/jso.27794 39155703 28. Amin M.B. Greene F.L. Edge S.B. Compton C.C. Gershenwald J.E. Brookland R.K. Meyer L. Gress D.M. Byrd D.R. Winchester D.P. The Eighth Edition AJCC Cancer Staging Manual: Continuing to build a bridge from a population-based to a more ‘personalized’ approach to cancer staging CA Cancer J. Clin. 2017 67 93 99 10.3322/caac.21388 28094848 29. Emoto S. Ishigami H. Hidemura A. Yamaguchi H. Yamashita H. Kitayama J. Watanabe T. Complications and management of an implanted intraperitoneal access port system for intraperitoneal chemotherapy for gastric cancer with peritoneal metastasis Jpn. J. Clin. Oncol. 2012 42 1013 1019 10.1093/jjco/hys129 22872745 30. Jacquet P. Sugarbaker P.H. Clinical research methodologies in diagnosis and staging of patients with peritoneal carcinomatosis Cancer Treat. Res. 1996 82 359 374 8849962 10.1007/978-1-4613-1247-5_23 31. National Cancer Institute Common Terminology Criteria for Adverse Events (CTCAE) Version 4.0 NIH Publication No. 09-7473 U.S. Department of Health and Human Services Washington, DC, USA National Institutes of Health Bethesda, MD, USA National Cancer Institute Bethesda, MD, USA 2009 32. Eisenhauer E.A. Therasse P. Bogaerts J. Schwartz L.H. Sargent D. Ford R. Dancey J. Arbuck S. Gwyther S. Mooney M. New response evaluation criteria in solid tumours: Revised RECIST guideline (version 1.1) Eur. J. Cancer 2009 45 228 247 10.1016/j.ejca.2008.10.026 19097774 33. Dindo D. Demartines N. Clavien P.-A. Classification of surgical complications: A new proposal with evaluation in a cohort of 6336 patients and results of a survey Ann. Surg. 2004 240 205 213 10.1097/01.sla.0000133083.54934.ae 15273542 PMC1360123 34. Solass W. Sempoux C. Detlefsen S. Carr N.J. Bibeau F. Peritoneal sampling and histological assessment of therapeutic response in peritoneal metastasis: Proposal of the Peritoneal Regression Grading Score (PRGS) Pleura Peritoneum 2016 1 99 107 10.1515/pp-2016-0011 30911613 PMC6328069 35. Japanese Gastric Cancer Association Japanese Gastric Cancer Treatment Guidelines 2021 (6th edition) Gastric Cancer 2023 26 1 25 10.1007/s10120-022-01331-8 36342574 PMC9813208 36. Deraco M. Glehen O. Helm C.W. Sugarbaker P.H. Cytoreductive Surgery & Perioperative Chemotherapy for Peri-toneal Surface Malignancy: Textbook and Video Atlas Cine-Med Publishing, Inc. Woodbury, CT, USA 2012 978-0984617159 37. Ishigami H. Kitayama J. Kaisaki S. Kato M. Yamaguchi H. Otani K. Kamei T. Nagawa H. Gastrectomy in combination with S-1, intravenous, and intraperitoneal paclitaxel: A novel multidisciplinary treatment strategy for gastric cancer with peritoneal metastasis J. Clin. Oncol. 2010 28 e14527 10.1200/jco.2010.28.15_suppl.e14527 38. Fujiwara Y. Takiguchi S. Nakajima K. Miyata H. Yamasaki M. Kurokawa Y. Mori M. Doki Y. Intraperitoneal docetaxel combined with S-1 for advanced gastric cancer with peritoneal dissemination J. Surg. Oncol. 2012 105 38 42 10.1002/jso.22057 21882194 39. Society for the Study of Peritoneal Carcinomatosis in Gastric Cancer Fushida S. Kinoshita J. Kaji M. Hirono Y. Goda F. Yagi Y. Oyama K. Sudo Y. Watanabe Y. Phase I/II study of intraperitoneal docetaxel plus S-1 for the gastric cancer patients with peritoneal carcinomatosis Cancer Chemother. Pharmacol. 2013 71 1265 1272 10.1007/s00280-013-2122-0 23423490 PMC3636429 40. Yamaguchi H. Kitayama J. Ishigami H. Emoto S. Yamashita H. Watanabe T. A phase 2 trial of intravenous and intraperitoneal paclitaxel combined with S-1 for treatment of gastric cancer with macroscopic peritoneal metastasis Cancer 2013 119 3354 3358 10.1002/cncr.28204 23798046 41. Fujiwara Y. Ishigami H. Miwa H. Tanaka T. Kodera Y. Imamoto H. Imano M. Fukushima R. Hidemura A. Ueda S. Phase II study of intraperitoneal paclitaxel plus S-1/oxaliplatin for gastric cancer with peritoneal metastasis: SOX+IP PTX trial J. Clin. Oncol. 2016 34 4040 10.1200/JCO.2016.34.15_suppl.4040 42. Fukushima R. Ishigami H. Miwa H. Imano M. Kobayashi D. Tsuji Y. Hidemura A. Kusumoto T. Omori T. Yabusaki H. Phase II study of intraperitoneal docetaxel plus capecitabine/cisplatin for gastric cancer with peritoneal metastasis: XP+IP DOC trial J. Clin. Oncol. 2017 35 4039 10.1200/JCO.2017.35.15_suppl.4039 43. Cho H. Ryu M.-H. Kim K.-P. Ryoo B.-Y. Park S.R. Kim B.S. Lee I.-S. Kim H.-S. Yoo M.-W. Yook J.H. Phase I/II study of a combination of capecitabine, cisplatin, and intraperitoneal docetaxel (XP ID) in advanced gastric cancer patients with peritoneal metastasis Gastric Cancer 2017 20 970 977 10.1007/s10120-017-0710-0 28303362 44. Shinkai M. Imano M. Chiba Y. Hiraki Y. Kato H. Iwama M. Shiraishi O. Yasuda A. Tsubaki M. Nishida S. Intraperitoneal and systemic chemotherapy for patients with gastric cancer with peritoneal metastasis: A phase II trial Anticancer Res. 2018 38 5975 5981 10.21873/anticanres.12945 30275228 45. Yonemura Y. Prabhu A. Sako S. Ishibashi H. Mizumoto A. Takao N. Ichinose M. Motoi S. Liu Y. Nishihara K. Long term survival after cytoreductive surgery combined with perioperative chemotherapy in gastric cancer patients with peritoneal metastasis Cancers 2020 12 116 10.3390/cancers12010116 31906405 PMC7016959 46. Saito S. Yamaguchi H. Ohzawa H. Miyato H. Kanamaru R. Kurashina K. Hosoya Y. Lefor A.K. Sata N. Kitayama J. Intraperitoneal administration of paclitaxel combined with S-1 plus oxaliplatin as induction therapy for patients with advanced gastric cancer with peritoneal metastases Ann. Surg. Oncol. 2021 28 3863 3870 10.1245/s10434-020-09388-4 33270170 PMC8184712 47. Fujitani K. Yang H.-K. Mizusawa J. Kim Y.-W. Terashima M. Han S.-U. Iwasaki Y. Hyung W.J. Takagane A. Park D.J. Gastrectomy plus chemotherapy versus chemotherapy alone for advanced gastric cancer with a single non-curable factor (REGATTA): A phase 3, randomised controlled trial Lancet Oncol. 2016 17 309 318 10.1016/S1470-2045(15)00553-7 26822397 48. Yoshida K. Yamaguchi K. Okumura N. Tanahashi T. Kodera Y. Is conversion therapy possible in stage IV gastric cancer: The proposal of new biological categories of classification Gastric Cancer 2016 19 329 338 10.1007/s10120-015-0575-z 26643880 PMC4824831 49. Yoshida K. Yasufuku I. Terashima M. Rha S.Y. Bae J.M. Li G. Katai H. Watanabe M. Seto Y. Noh S.H. International retrospective cohort study of conversion therapy for stage IV Gastric Cancer 1 (CONVO-GC-1) Ann. Gastroenterol. Surg. 2022 6 227 240 10.1002/ags3.12515 35261948 PMC8889854 50. Janjigian Y.Y. Werner D. Pauligk C. Steinmetz K. Kelsen D.P. Jäger E. Altmannsberger H.-M. Robinson E. Tafe L.J. Tang L.H. Prognosis of metastatic gastric and gastroesophageal junction cancer by HER2 status: A European and USA International collaborative analysis Ann. Oncol. 2012 23 2656 2662 10.1093/annonc/mds104 22689179 51. Cancer Genome Atlas Research Network Comprehensive molecular characterization of gastric adenocarcinoma Nature 2014 513 202 209 10.1038/nature13480 25079317 PMC4170219 52. Liu X. Choi M.G. Kim K. Kim K.-M. Kim S.T. Park S.H. Cristescu R. Peter S. Lee J. High PD-L1 expression in gastric cancer (GC) patients and correlation with molecular features Pathol. Res. Pract. 2020 216 152881 10.1016/j.prp.2020.152881 32089413 53. Yonemura Y. A new bidirectional intraperitoneal and systemic induction chemotherapy (BISIC) for the peritoneal metastasis from gastric cancer in neoadjuvant setting Integr. Cancer Sci. Ther. 2014 1 26 29 10.15761/ICST.1000106 54. Casella F. Bencivenga M. Rosati R. Fumagalli U.R. Marrelli D. Pacelli F. Macrì A. Donini A. Torroni L. Pavarana M. Pressurized intraperitoneal aerosol chemotherapy (PIPAC) in multimodal therapy for patients with oligometastatic peritoneal gastric cancer: A randomized multicenter phase III trial PIPAC VEROne Pleura Peritoneum 2022 7 135 141 10.1515/pp-2022-0111 36159218 PMC9467896 55. Chia D.K.A. Sundar R. Kim G. Ang J.J. Lum J.H.Y. Nga M.E. Goh G.H. Seet J.E. Chee C.E. Tan H.L. Outcomes of a phase II study of intraperitoneal paclitaxel plus systemic capecitabine and oxaliplatin (XELOX) for gastric cancer with peritoneal metastases Ann. Surg. Oncol. 2022 29 8597 8605 10.1245/s10434-022-11998-z 36070113 56. Kang S.H. Min S.-H. Kim J.W. Lee E. Park S.W. Lee S. Oh H.J. Park Y.S. Lee Y.J. Ahn S.-H. Safety and efficacy of intraperitoneal paclitaxel plus intravenous fluorouracil, leucovorin, and oxaliplatin (FOLFOX) for gastric cancer with peritoneal metastasis Ann. Surg. Oncol. 2022 29 5084 5091 10.1245/s10434-022-11582-5 35322307 57. Masuda T. Kuramoto M. Shimada S. Ikeshima S. Yamamoto K. Nakamura K. Yoshimatsu S. Urata M. Baba H. The effect of extensive intraoperative peritoneal lavage therapy (EIPL) on stage III B + C and cytology-positive gastric cancer patients Int. J. Clin. Oncol. 2016 21 289 294 10.1007/s10147-015-0892-6 26296529 58. Shim H.-J. Kim H.-J. Lee S.H. Bae W.-K. Hwang E.-C. Cho S.-H. Chung I.-J. Bang H.-J. Hwang J.E. Observational study of peritoneal washing cytology-positive gastric cancer without gross peritoneal metastasis in patients who underwent radical D2 gastrectomy Sci. Rep. 2020 10 9549 10.1038/s41598-020-66637-y 32533084 PMC7293245 59. Yamaguchi T. Takashima A. Nagashima K. Makuuchi R. Aizawa M. Ohashi M. Tashiro K. Yamada T. Kinoshita T. Hata H. Efficacy of postoperative chemotherapy after resection that leaves no macroscopically visible disease of gastric cancer with positive peritoneal lavage cytology (CY1) or localized peritoneum metastasis (P1a): A multicenter retrospective study Ann. Surg. Oncol. 2020 27 284 292 10.1245/s10434-019-07697-x 31535301 60. Marano L. Marrelli D. Sammartino P. Biacchi D. Graziosi L. Marino E. Coccolini F. Fugazzola P. Valle M. Federici O. Cytoreductive surgery and hyperthermic intraperitoneal chemotherapy for gastric cancer with synchronous peritoneal metastases: Multicenter study of ‘Italian Peritoneal Surface Malignancies Oncoteam-S.I.C.O.’ Ann. Surg. Oncol. 2021 28 9060 9070 10.1245/s10434-021-10157-0 34057569 PMC8590997 61. Butensky S.D. Bansal V.V. Su D.G. Waheed M.T. Nikiforchin A. Gomez-Mayorga J.L. Olecki E. Radomski S.N. Sun B. Turaga K.K. Consensus guideline for the management of gastric cancer with synchronous peritoneal metastases Ann. Surg. Oncol. 2025 Online ahead of print 10.1245/s10434-025-17361-2 40560499 62. Ajani J.A. D’aMico T.A. Bentrem D.J. Corvera C.U. Das P. Enzinger P.C. Enzler T. Gerdes H. Gibson M.K. Grierson P. Gastric Cancer, version 2.2025, NCCN Clinical Practice Guidelines in Oncology J. Natl. Compr. Canc. Netw. 2025 23 169 191 10.6004/jnccn.2025.0022 40341199 63. Smyth E.C. Verheij M. Allum W. Cunningham D. Cervantes A. Arnold D. Gastric cancer: ESMO Clinical Practice Guidelines for diagnosis, treatment and follow-up Ann. Oncol. 2016 27 v38 v49 10.1093/annonc/mdw350 27664260 64. Bonnot P.E. A Lintis A. Mercier F. Benzerdjeb N. Passot G. Pocard M. Meunier B. Bereder J.M. Abboud K. Marchal F. Prognosis of poorly cohesive gastric cancer after complete cytoreductive surgery with or without hyperthermic intraperitoneal chemotherapy (CYTO-CHIP study) Br. J. Surg. 2021 108 1225 1235 10.1093/bjs/znab200 34498666 65. Manzanedo I. Pereira F. Caro C.R. Pérez-Viejo E. Serrano Á. Calvo A.G. Regueira F.M. Casado-Adam Á. Cascales-Campos P.A. Arteaga X. Cytoreductive surgery and hyperthermic intraperitoneal chemotherapy (HIPEC) for gastric cancer with peritoneal carcinomatosis: Multicenter study of Spanish group of peritoneal oncologic surgery (GECOP) Ann. Surg. Oncol. 2019 26 2615 2621 10.1245/s10434-019-07450-4 31115852 66. Coccolini F. Catena F. Glehen O. Yonemura Y. Sugarbaker P. Piso P. Montori G. Ansaloni L. Complete versus incomplete cytoreduction in peritoneal carcinosis from gastric cancer, with consideration to PCI cut-off. Systematic review and meta-analysis Eur. J. Surg. Oncol. 2015 41 911 919 10.1016/j.ejso.2015.03.231 25936764 67. Glehen O. Gilly F.N. Arvieux C. Cotte E. Boutitie F. Mansvelt B. Bereder J.M. Lorimier G. Quenet F. de Chirurgie A.F. Peritoneal carcinomatosis from gastric cancer: A multi-institutional study of 159 patients treated by cytoreductive surgery combined with perioperative intraperitoneal chemotherapy Ann. Surg. Oncol. 2010 17 2370 2377 10.1245/s10434-010-1039-7 20336386 68. Mariani A. Zaanan A. Glehen O. Karoui M. Outcomes of a phase II study of intraperitoneal paclitaxel plus systemic capecitabine and oxaliplatin (XELOX) for gastric cancer with peritoneal metastases Ann. Surg. Oncol. 2023 30 816 817 10.1245/s10434-022-12837-x 36383333 69. Di Giorgio A. Schena C.A. El Halabieh M.A. Abatini C. Vita E. Strippoli A. Inzani F. Rodolfino E. Romanò B. Pacelli F. Systemic chemotherapy and pressurized intraperitoneal aerosol chemotherapy (PIPAC): A bidirectional approach for gastric cancer peritoneal metastasis Surg. Oncol. 2020 34 270 275 10.1016/j.suronc.2020.05.006 32891341 70. Tidadini F. Abba J. Quesada J.-L. Baudrant M. Bonne A. Foote A. Faucheron J.-L. Glehen O. Villeneuve L. Arvieux C. Effect of pressurized intraperitoneal aerosol chemotherapy on the survival rate of patients with peritoneal carcinomatosis of gastric origin J. Gastrointest. Cancer 2022 53 971 979 10.1007/s12029-021-00698-8 34677795 71. Rau B. Lang H. Koenigsrainer A. Gockel I. Rau H.-G. Seeliger H. Lerchenmueller C. Reim D. Wahba R. Angele M. Effect of hyperthermic intraperitoneal chemotherapy on cytoreductive surgery in gastric cancer with synchronous peritoneal metastases: The phase III GASTRIPEC-I trial J. Clin. Oncol. 2024 42 146 156 10.1200/JCO.22.02867 37906724 PMC10824373 Figure 1 Algorithm followed in the study. PMs, peritoneal metastases; PCI, Peritoneal Cancer Index; CT scan, computed tomography; PIPAC, pressurized intraperitoneal aerosol chemotherapy, normothermic intraperitoneal and systemic chemotherapy; CRS, cytoreductive surgery; HIPEC, hyperthermic intraperitoneal chemotherapy. Figure 2 Schematic illustration of one course of bidirectional systemic and intraperitoneal chemotherapy for peritoneal metastasis from gastric cancer. IV, intravenous; OS, oral; IP, intraperitoneal. Figure 3 CONSORT flow diagram of patient screening and enrollment. Figure 4 Kaplan–Meier curves showing overall survival ( a b Figure 5 Surgical field showing extended D2 lymphadenectomy performed according to the Japanese Gastric Cancer Treatment Guidelines (6th edition). Figure 6 Histological response in a resected peritoneal lesion from a patient undergoing CRS and HIPEC. H&E staining ( a b c Figure 7 Kaplan–Meier curves showing overall survival a progression-free survival b jcm-14-06518-t001_Table 1 Table 1 Demographic, clinical and histological characteristics of the patients included.  All Patients CRS + HIPEC  N° 25 N° 13  Age: Median (IQR) 55 (44–63) 60 (55–63)  Gender (%)   Male 13 (52%) 7 (53.8%) Female 12 (48%) 6 (46.2%)  PCI pre-NIPS: (IQR) 12 (7–12) 9 (6–12)  Histotype (%)   Diffuse 22 (88%) 12 (92.3%) Intestinal 3 (12%) 1 (7.7%)  ECOG (%)   0 16 (64.0) 8 (61.5) 1 9 (36.0) 5 (38.5)  Cycles of NIPS (%)   3 21 (84%) 12 (92.3%) >3 4 (16%) 1 (7.7%)  Adverse Event Toxicity Grade < 3 (%)   Abdominal pain 2 (8%) - Vomiting 2 (8%) - Diarrhea 3(12%) - Constipation 4 (16%) - Fatigue 8 (32%) -  PCI post-NIPS (IQR) NA 6 (4–10)  Adjuvant Chemotherapy (%) - 13 (100%) CRS: cytoreductive surgery; HIPEC: hyperthermic intraperitoneal chemotherapy; PCI: Peritoneal Cancer Index; NIPS: normothermic intraperitoneal and systemic chemotherapy; ECOG: Eastern Cooperative Oncology Group Performance Status. jcm-14-06518-t002_Table 2 Table 2 Results of conversion surgery. Variables Number of Patients N° 13  D2 + Total gastrectomy 13 (100%)  pT  pT4a 11 (84.6%) pT4b 2 (15.4%)  pN  pN0 5 (38.4%) pN1 2 (15.4%) pN2 3 (23.1%) pN3 3 (23.1%)  * Peritonectomy procedures  Anterior parietal 7 (NA) Pelvic 6 NA) Omental bursa 2 NA) Left upper quadrant 1 (NA)  Visceral resection  Small bowel 3 (23.1%) Splenectomy 3 (23.1%) Uterus 2 (15.4%) Large bowel 2 (15.4%)  Clavien–Dindo Complication  II 2 (15.4%) IIIB 2 (15.4%)  Completeness of Cytoreduction  CC 0 10 (72.9%) CC1 3 (23.1%)  PRGS - 1 - 2 13 (100%) 3 - 4 - PRGS: Peritoneal Regression Grading Score; * The total number exceeds 13 because some patients underwent multiple peritonectomy procedures. ",
  "metadata": {
    "Title of this paper": "Effect of hyperthermic intraperitoneal chemotherapy on cytoreductive surgery in gastric cancer with synchronous peritoneal metastases: The phase III GASTRIPEC-I trial",
    "Journal it was published in:": "Journal of Clinical Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470864/"
  }
}