{
  "title": "Paper_1124",
  "abstract": "pmc Curr Issues Mol Biol Curr Issues Mol Biol 4181 cimb cimb Current Issues in Molecular Biology 1467-3037 1467-3045 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468269 PMC12468269.1 12468269 12468269 41020833 10.3390/cimb47090711 cimb-47-00711 1 Review Smart Red Blood Cell Carriers: A Nanotechnological Approach to Cancer Drug Delivery https://orcid.org/0000-0002-1439-3920 Tsamesidis Ioannis 1 * † Dryllis Georgios 2 * † Fortis Sotirios P. 2 https://orcid.org/0009-0002-9292-9222 Sphicas Andreas 2 Konstantinidou Vasiliki 1 https://orcid.org/0000-0002-2101-4546 Chatzidimitriou Maria 1 Mitka Stella 1 https://orcid.org/0000-0001-8785-7522 Trapali Maria 2 Skepastianos Petros 1 https://orcid.org/0000-0003-3915-1829 Kriebardis Anastasios G. 2 Pessach Ilias 1 Huang Ru Chih C. Academic Editor 1 themikonstantinidou@yahoo.gr mchatzid952@gmail.com mitkast@hotmail.com pskep@otenet.gr iliaspessach1980@gmail.com 2 sfortis@uniwa.gr andreas.sphicas@gmail.com ymaria@uniwa.gr akrieb@uniwa.gr * itsamesidis@auth.gr gdryllis@uniwa.gr † These authors contributed equally to this work. 01 9 2025 9 2025 47 9 497442 711 25 7 2025 23 8 2025 27 8 2025 01 09 2025 27 09 2025 30 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ The efficient and targeted delivery of pharmaceutical substances remains a major challenge in modern therapeutics. Traditional drug delivery systems often suffer from limited bioavailability, rapid clearance, and off-target effects. Red blood cells (erythrocytes), due to their long circulation time, biocompatibility, and immune-evasive properties, have emerged as promising carriers in the development of novel nanotechnology-based drug delivery platforms.A comprehensive literature review was conducted, analyzing recent studies on erythrocyte membrane-coated nanoparticles, their interactions with loaded therapeutic agents, and their performance in vitro and in vivo. Special focus was given to applications in chemotherapy, photodynamic therapy (PDT), photothermal therapy (PTT), and immunotherapy. Erythrocyte-based nanocarriers demonstrated improved circulation times, reduced immune clearance, and enhanced targeting capabilities compared to traditional nanoparticles. Encapsulation of nanoparticles within erythrocyte membranes preserved the functional integrity of the carrier while minimizing systemic toxicity. However, challenges such as membrane stability, hemocompatibility, and the potential for nanoparticle-induced hemoglobin dysfunction were identified as areas requiring further research. In conclusion, erythrocyte membrane-coated nanoparticles represent a unique and promising strategy for drug delivery, combining the natural advantages of red blood cells with the versatility of nanotechnology. erythrocytes nanoparticles drug delivery systems cancer therapy This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Cancer remains one of the leading causes of death worldwide, affecting millions of lives across all nations regardless of economic status, age, or gender [ 1 2 3 4 5 6 7 8 3 9 10 11 12 Modern medicine has developed numerous methods of drug delivery for treating diseases of all kinds, including cancer [ 13 14 15 16 17 In more details, a lot of attempts to use nanoparticles as pharmacological carriers in chemotherapy was performed, considering that the most common therapeutic strategies in oncology present several limitations [ 18 19 20 21 This review explores the emerging field of using erythrocytes (red blood cells) as carriers for nanoparticle-based drug delivery systems, particularly in the context of anticancer therapies. It highlights the advantages of loading nanoparticles into erythrocytes, aiming to improve the pharmacokinetic properties and reduce the immunogenicity of therapeutic agents. Special attention is given to the effects of nanoparticles on red blood cell hemocompatibility, their interactions with erythrocyte membranes, and the subsequent impact on membrane proteins and cell morphology. Further sections delve into how nanoparticle integration may alter key physiological functions of erythrocytes, such as oxygen transport and antioxidant defense mechanisms. The review also examines innovative strategies, including the development of biomimetic and camouflaged nanoparticles using red cell membranes, to enhance circulation time and targeting efficiency. Finally, it discusses the potential of these erythrocyte-based systems to advance anticancer therapies by improving drug delivery specificity and minimizing systemic side effects. 2. Methods A comprehensive literature search was conducted across the databases PubMed, Scopus, and Google Scholar. The primary keywords guiding the search were “nanoparticles” and “erythrocytes.” The search strategy was subsequently refined to focus on studies investigating nanoparticles loading into red blood cells, the interactions between nanoparticles and erythrocyte membranes, and the development of biomimetic nanoparticles utilizing erythrocyte components. To capture a broader range of relevant studies, additional search combinations were employed, including “nanoparticles AND erythrocytes,” “nanoparticle encapsulation AND red blood cells,” “red blood cell membrane AND drug delivery,” “erythrocyte-based nanoparticles AND anticancer therapy,” and “biomimetic nanoparticles AND circulation time.” Only articles published in English were considered. The period for data collection and interpretation spanned from June 2024 to March 2025. 3. Results 3.1. Nanotechnology and Nanoparticles Nanotechnology is the science, engineering, and technology conducted at the nanoscale typically between 1 and 100 nanometers where unique physical and chemical phenomena enable novel applications across diverse fields such as chemistry, physics, biology, medicine, engineering, and electronics [ 22 23 −9 24 25 26 27 28 29 30 3.2. Advantages of Loading Erythrocytes with Nanoparticles Zhang et al. focused on the encapsulation of overloaded nanoparticles within erythrocytes through their cell membranes. This approach appears highly promising, as erythrocytes offer several critical advantages over individual nanoparticles due to their unique physicochemical properties [ 31 Figure 1 Figure 1 32 33 34 3.3. Hemocompatibility of Nanoparticles Hemocompatibility refers to the compatibility of a material or device with blood and its components, encompassing the ability of the material to perform its intended function without inducing adverse effects such as thrombosis, hemolysis, inflammation, or immune reactions [ 35 36 37 35 38 38 39 Once the hemocompatibility of red blood cells (RBCs) is ensured, the subsequent step involves the incorporation of nanoparticles into or within the RBC membranes. This strategy aims to harness the biocompatibility, long circulation time, and immune-evasive properties of RBCs to enhance the therapeutic efficacy and systemic stability of the nanoparticle-based delivery systems [ 40 41 Numerous studies have focused on identifying the functionality of nanoparticle use when they are encapsulated within or attached to RBC membranes [ 35 42 43 44 45 42 46 47 3.4. Interaction with Erythrocyte Membranes and Laboratory Techniques to Identify the Modifications The study of interaction between nanoparticles and red cell membranes is of utmost importance for the design of an appropriate drug delivery system using erythrocyte membrane as camouflage [ 48 49 50 51 52 53 When nanoparticles are embedded within erythrocyte membranes, the integration process involves specific physicochemical interactions between the nanoparticle surface and the lipid bilayer components of the membrane. These interactions can occur via hydrophobic forces, electrostatic interactions, van der Waals forces, or covalent modifications, depending on the surface functionalization of the nanoparticles. The incorporation is typically achieved through methods such as co-extrusion, sonication, or hypotonic dialysis, which temporarily disrupt the membrane to facilitate nanoparticle entry, followed by membrane resealing to restore integrity [ 54 To evaluate the interaction between nanoparticles and erythrocytes, a range of advanced imaging and analytical techniques are employed. The relative spatial localization of nanoparticles in relation to erythrocyte membranes can be effectively visualized using laser scanning microscopy (LSM) and transmission electron microscopy (TEM) [ 55 56 In detail, the location of nanoparticles into erythrocytes can be visualized by laser scanning electron microscopy (LSM) and transmission electron microscopy (TEM) that mainly focuses on location information of nanoparticles compared to erythrocytes. Other methods widely used in research are atomic force microscopy (AFM), Raman spectroscopy, and confocal fluorescence microscopy. As regards the simulation of the molecular forces developing, it seems that electrostatic action, hydrophobic force, Coulomb attraction as well as the unique characteristics of nanoparticles play important roles in their interaction with erythrocyte membranes. Also, NMR (Nuclear Magnetic Resonance) technology, the self-diffusion coefficients of fullerene molecules (a nanomaterial that has wide use in biomedical research and especially in drug delivery), is linked to the lateral diffusion coefficients of erythrocyte membrane lipids via hydrogen bonds, which means that derivatives of fullerene molecules can be absorbed by erythrocytes and either bind to their membrane or enter interior [ 57 55 60 24 60 24 −3 60 24 58 59 However, a detailed review of the interactions between RBCs and various nanoparticles loaded with active pharmaceutical ingredients reveals that, in many cases, the survival of the carrier cells is compromised. This is often due to alterations in their basic morphology or changes in the expression of surface molecules and receptors [ 60 61 62 63 3.5. Clinical Application in Anticancer Therapy Erythrocyte membrane-camouflaged anticancer nanoparticle delivery systems have demonstrated versatility across multiple therapeutic modalities beyond traditional chemotherapy for the treatment of neoplasms and solid tumors [ 64 65 Figure 2 66 67 68 69 70 71 4. Discussion Nanoparticle-based drug delivery strategies have demonstrated exceptional efficacy in the targeted and site-specific release of therapeutic agents. Table 1 This can be attributed to their distinctive ability to provide insights about NPs physical, chemical, and biological properties, which enable precise delivery, enhanced bioavailability, and reduced systemic toxicity. In oncology, nanodevices are extensively employed to transport chemotherapeutic agents directly to tumor cells and microenvironments, thereby improving therapeutic outcomes and minimizing off-target effects [ 72 Figure 2 73 74 75 76 77 77 76 78 cimb-47-00711-t001_Table 1 Table 1 Summary of research articles and review summarizing the results and the final applications of different drug carrier types. Nanoparticle Composition (Drug Carrier Type) Production Method Results Final Application References Polystyrene nanoparticles Physical adsorption onto erythrocyte surface Prolonged circulation time depending on NP size; RBC morphology largely maintained Long circulating drug delivery system [ 31 Polymer–protein conjugate carriers PEG-coated liposomes Improved solubility; reduced solvent-associated toxicity; enhanced tumor penetration Clinically approved for metastatic breast cancer, pancreatic cancer [ 32 Biodegradable polymeric nanoparticles (e.g., PLGA core) coated with natural erythrocyte membrane Top-down biomimetic coating: hypotonic lysis of RBCs, continously → membrane vesicle preparation and then→ fusion (e.g., extrusion) onto polymeric nanoparticle Significantly prolonged circulation half-life in mice; high retention at 72 h post-injection compared with PEGylated control particles Long-circulating drug delivery platform that evades immune clearance and improves systemic retention [ 60 Polymer–drug conjugates Covalent conjugation: Attaching drugs or proteins to polymers through stable covalent bonds. Enhanced solubility and stability: conjugation improves the solubility and stability of poorly water-soluble drugs and proteins. Cancer therapy: polymer–drug conjugates are utilized for targeted chemotherapy, reducing systemic toxicity. [ 75 Cell membrane coated nanoparticles Extrusion Immune evasion; prolonged circulation Targeted cancer therapy [ 70 Erythrocyte-inspired functional materials (e.g., RBC membrane-coated nanoparticles, erythrocyte-mimicking carriers) Biomimetic engineering approaches: coating synthetic nanoparticles with RBC membranes, constructing erythrocyte-mimetic systems Prolonged circulation time, immune evasion, improved biocompatibility, targeted drug delivery Drug delivery, biosensing, detoxification, and other biomedical applications [ 68 5. Conclusions This paper has reviewed the benefits of using erythrocyte membranes as a template for constructing nanoparticle–drug complexes, highlighting their advantages compared to other delivery techniques. One of the most actively researched applications of this approach is in oncology, where nanoparticles encapsulated in erythrocyte membranes may offer a more favorable prognosis compared to conventional chemotherapy. Further optimization of these methods could pave the way for effective treatments or even radical interventions in the fight against malignant tumors. In conclusion, biomimetic nanoparticles based on red blood cell properties represent a “smart” unique and innovative strategy for drug delivery. With continued refinement and in-depth study of their structure, assembly, and safety profiles, they hold great promise for treating a wide range of diseases more safely and effectively. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, I.T., I.P., G.D., S.P.F. and A.G.K.; methodology, I.T., I.P., G.D., S.P.F. and A.G.K.; software, I.T., G.D. and S.P.F.; validation, A.S., V.K., M.C., S.M., M.T. and P.S.; formal analysis A.S., V.K., M.C., S.M., M.T. and P.S.; investigation, A.S., V.K., M.C., S.M., M.T. and P.S.; resources, I.T., I.P., G.D., S.P.F. and A.G.K.; data curation, I.T., I.P., G.D., S.P.F. and A.G.K.; writing—original draft preparation, I.T., G.D. and A.S.; writing—review and editing I.T., I.P., G.D., S.P.F. and A.G.K.; visualization, I.T., G.D., S.P.F., A.S., V.K., M.C., S.M., P.S., A.G.K. and I.P.; supervision I.P. and G.D.; project administration, I.P. and G.D. All authors have read and agreed to the published version of the manuscript. Data Availability Statement Data is contained within the article. Conflicts of Interest The authors declare no conflicts of interest. References 1. Wu Z. Xia F. Lin R. Global Burden of Cancer and Associated Risk Factors in 204 Countries and Territories, 1980–2021: A Systematic Analysis for the GBD 2021 J. Hematol. Oncol. 2024 17 119 10.1186/s13045-024-01640-8 39614359 PMC11607901 2. Brown J.S. Amend S.R. Austin R.H. Gatenby R.A. Hammarlund E.U. Pienta K.J. Updating the Definition of Cancer Mol. Cancer Res. 2023 21 1142 1147 10.1158/1541-7786.MCR-23-0411 37409952 PMC10618731 3. Cooper G.M. The Development and Causes of Cancer The Cell: A Molecular Approach 2nd ed. Sinauer Associates Inc. Sunderland, MA, USA 2000 743 Available online: http://www.ncbi.nlm.nih.gov/books/NBK9963/ (accessed on 15 May 2025) 4. Popovich J.R. Sarcoma StatPearls [Internet] StatPearls Publishing Treasure Island, FL, USA 2025 5. De Voeght A. Jaspers A. Beguin Y. Baron F. De Prijck B. Overview of the General Management of Acute Leukemia for Adults Rev. Med. Liege 2021 76 470 475 34080382 6. Perincheri S. Tumor Microenvironment of Lymphomas and Plasma Cell Neoplasms: Broad Overview and Impact on Evaluation for Immune Based Therapies Front. Oncol. 2021 11 719140 10.3389/fonc.2021.719140 34956859 PMC8692247 7. Tadman M. Roberts D. Central Nervous System Cancer Oxford Handbook of Cancer Nursing Oxford Academic Oxford, UK 2007 331 342 10.1093/med/9780198569244.003.0025 8. Chun Y.K. Neuroendocrine Tumors of the Female Reproductive Tract: A Literature Review J. Pathol. Transl. Med. 2015 49 450 461 10.4132/jptm.2015.09.20 26459408 PMC4696532 9. Bamodu O.A. Chung C.-C. Cancer Care Disparities: Overcoming Barriers to Cancer Control in Low- and Middle-Income Countries JCO Glob. Oncol. 2024 10 e2300439 10.1200/GO.23.00439 39173080 10. Chow A.Y. Cell Cycle Control by Oncogenes and Tumor Suppressors: Driving the Transformation of Normal Cells into Cancerous Cells Nat. Educ. 2010 3 7 11. Parsa N. Environmental Factors Inducing Human Cancers Iran. J. Public Health 2012 41 1 PMC3521879 23304670 12. Martin T.A. Ye L. Sanders A.J. Lane J. Jiang W.G. Cancer Invasion and Metastasis: Molecular and Cellular Perspective Madame Curie Bioscience Database [Internet] Landes Bioscience Austin, TX, USA 2000 45 55 13. Ezike T.C. Okpala U.S. Onoja U.L. Nwike C.P. Ezeako E.C. Okpara O.J. Okoroafor C.C. Eze S.C. Kalu O.L. Odoh E.C. Advances in Drug Delivery Systems, Challenges and Future Directions Heliyon 2023 9 e17488 10.1016/j.heliyon.2023.e17488 37416680 PMC10320272 14. Adepu S. Ramakrishna S. Controlled Drug Delivery Systems: Current Status and Future Directions Molecules 2021 26 5905 10.3390/molecules26195905 34641447 PMC8512302 15. Zhou Y. Tao L. Qiu J. Xu J. Yang X. Zhang Y. Tian X. Guan X. Cen X. Zhao Y. Tumor Biomarkers for Diagnosis, Prognosis and Targeted Therapy Signal Transduct. Target. Ther. 2024 9 132 10.1038/s41392-024-01823-2 38763973 PMC11102923 16. Wang S. Liu Y. Feng Y. Zhang J. Swinnen J. Li Y. Ni Y. A Review on Curability of Cancers: More Efforts for Novel Therapeutic Options Are Needed Cancers 2019 11 1782 10.3390/cancers11111782 31766180 PMC6896199 17. Alexis F. Pridgen E. Molnar L.K. Farokhzad O.C. Factors Affecting the Clearance and Biodistribution of Polymeric Nanoparticles Mol. Pharm. 2008 5 505 515 10.1021/mp800051m 18672949 PMC2663893 18. Gavas S. Quazi S. Karpiński T.M. Nanoparticles for Cancer Therapy: Current Progress and Challenges Nanoscale Res. Lett. 2021 16 173 10.1186/s11671-021-03628-6 34866166 PMC8645667 19. Barros S.M. Whitaker S.K. Sukthankar P. Avila L.A. Gudlur S. Warner M. Beltrão E.I.C. Tomich J.M. A Review of Solute Encapsulating Nanoparticles Used as Delivery Systems with Emphasis on Branched Amphipathic Peptide Capsules Arch. Biochem. Biophys. 2016 596 22 42 10.1016/j.abb.2016.02.027 26926258 PMC4841695 20. Suk J.S. Xu Q. Kim N. Hanes J. Ensign L.M. PEGylation as a Strategy for Improving Nanoparticle-Based Drug and Gene Delivery Adv. Drug Deliv. Rev. 2016 99 28 51 10.1016/j.addr.2015.09.012 26456916 PMC4798869 21. Estanqueiro M. Amaral M.H. Conceição J. Sousa Lobo J.M. Nanotechnological Carriers for Cancer Chemotherapy: The State of the Art Colloids Surf. B Biointerfaces 2015 126 631 648 10.1016/j.colsurfb.2014.12.041 25591851 22. Bayda S. Adeel M. Tuccinardi T. Cordani M. Rizzolio F. The History of Nanoscience and Nanotechnology: From Chemical-Physical Applications to Nanomedicine Molecules 2020 25 112 10.3390/molecules25010112 31892180 PMC6982820 23. Barjesteh T. Mansur S. Bao Y. Inorganic Nanoparticle-Loaded Exosomes for Biomedical Applications Molecules 2021 26 1135 10.3390/molecules26041135 33672706 PMC7924372 24. Mitchell M.J. Billingsley M.M. Haley R.M. Wechsler M.E. Peppas N.A. Langer R. Engineering Precision Nanoparticles for Drug Delivery Nat. Rev. Drug Discov. 2021 20 101 124 10.1038/s41573-020-0090-8 33277608 PMC7717100 25. Khan I. Saeed K. Khan I. Nanoparticles: Properties, Applications and Toxicities Arab. J. Chem. 2017 12 908 931 10.1016/j.arabjc.2017.05.011 26. Aschner M. Nanoparticles: Transport across the Olfactory Epithelium and Application to the Assessment of Brain Function in Health and Disease Prog. Brain Res. 2009 180 141 152 10.1016/S0079-6123(08)80008-8 20302833 27. Joudeh N. Linke D. Nanoparticle Classification, Physicochemical Properties, Characterization, and Applications: A Comprehensive Review for Biologists J. Nanobiotechnol. 2022 20 262 10.1186/s12951-022-01477-8 PMC9171489 35672712 28. Kiio T.M. Park S. Physical Properties of Nanoparticles Do Matter J. Pharm. Investig. 2021 51 35 51 10.1007/s40005-020-00504-w 29. Altammar K.A. A Review on Nanoparticles: Characteristics, Synthesis, Applications, and Challenges Front. Microbiol. 2023 14 1155622 10.3389/fmicb.2023.1155622 37180257 PMC10168541 30. Singh V. Yadav S.S. Chauhan V. Shukla S. Vishnolia K.K. Applications of Nanoparticles in Various Fields Diagn. Appl. Health Intell. Surveill. Syst. 2021 2021 221 236 10.4018/978-1-7998-6527-8.ch011 31. Zhang S. Fu Q. Zhang Y. Pan J. Zhang L. Zhang Z. Liu Z. Surface Loading of Nanoparticles on Engineered or Natural Erythrocytes for Prolonged Circulation Time: Strategies and Applications Acta Pharmacol. Sin. 2021 42 1040 1054 10.1038/s41401-020-00606-z 33772141 PMC8208981 32. Pérez-Herrero E. Fernández-Medarde A. Advanced Targeted Therapies in Cancer: Drug Nanocarriers, the Future of Chemotherapy Eur. J. Pharm. Biopharm. 2015 93 52 79 10.1016/j.ejpb.2015.03.018 25813885 33. Liu Y. Luo J. Chen X. Liu W. Chen T. Cell Membrane Coating Technology: A Promising Strategy for Biomedical Applications Nano-Micro Lett. 2019 11 100 10.1007/s40820-019-0330-9 PMC7770915 34138027 34. Shen H. Ouyang Y. Zhang L. Li J. Wang S. Blood Cell Membrane-Coated Nanomaterials as a Versatile Biomimetic Nanoplatform for Antitumor Applications Nanomaterials 2024 14 1757 10.3390/nano14211757 39513837 PMC11548044 35. Fortis S.P. Batrinou A. Georgatzakou H.T. Tsamesidis I. Albanidis G. Papageorgiou E.G. Stamoulis K. Gkiliopoulos D. Pouroutzidou G.K. Theocharidou A. Effect of Silica-Based Mesoporous Nanomaterials on Human Blood Cells Chem. Biol. Interact. 2024 387 110784 10.1016/j.cbi.2023.110784 37939894 36. Weber M. Steinle H. Golombek S. Hann L. Schlensak C. Wendel H.P. Avci-Adali M. Blood-Contacting Biomaterials: In Vitro Evaluation of the Hemocompatibility Front. Bioeng. Biotechnol. 2018 6 99 10.3389/fbioe.2018.00099 30062094 PMC6054932 37. Bhatt A. Nair R.P. Rashmi R. Raju R. Geeverghese R. Lekshmi P. Product Evaluation: Blood Compatibility Studies Biomed. Prod. Mater. Eval. Stand. Ethics 2022 13 435 459 10.1016/B978-0-12-823966-7.00022-0 38. Luu C.H. Nguyen N.T. Ta H.T. Unravelling Surface Modification Strategies for Preventing Medical Device-Induced Thrombosis Adv. Healthc. Mater. 2024 13 2301039 10.1002/adhm.202301039 37725037 PMC11468451 39. Al-Zyoud W. Haddadin D. Hasan S.A. Jaradat H. Kanoun O. Biocompatibility Testing for Implants: A Novel Tool for Selection and Characterization Materials 2023 16 6881 10.3390/ma16216881 37959478 PMC10647244 40. Desai N. Tambe V. Pofali P. Vora L.K. Cell Membrane-Coated Nanoparticles: A New Frontier in Immunomodulation Adv. NanoBiomed Res. 2024 4 2400012 10.1002/anbr.202400012 41. De Harpe K.M. Kondiah P.P.D. Choonara Y.E. Marimuthu T. Toit L.C. Pillay V. The Hemocompatibility of Nanoparticles: A Review of Cell-Nanoparticle Interactions and Hemostasis Cells 2019 8 1209 10.3390/cells8101209 31591302 PMC6829615 42. Tsamesidis I. Pouroutzidou G.K. Lymperaki E. Kazeli K. Lioutas C.B. Christodoulou E. Perio P. Reybier K. Pantaleo A. Kontonasaki E. Effect of Ion Doping in Silica-Based Nanoparticles on the Hemolytic and Oxidative Activity in Contact with Human Erythrocytes Chem. Biol. Interact. 2020 318 108974 10.1016/j.cbi.2020.108974 32032594 43. Ioannou M.E. Pouroutzidou G.K. Chatzimentor I. Tsamesidis I. Florini N. Tsiaoussis I. Lymperaki E. Komninou P. Kontonasaki E. Synthesis and Characterization of Cerium Oxide Nanoparticles: Effect of Cerium Precursor to Gelatin Ratio Appl. Sci. 2023 13 2676 10.3390/app13042676 44. Yedgar S. Barshtein G. Gural A. Hemolytic Activity of Nanoparticles as a Marker of Their Hemocompatibility Micromachines 2022 13 2091 10.3390/mi13122091 36557391 PMC9783501 45. Chen M. Leng Y. He C. Li X. Zhao L. Qu Y. Wu Y. Red Blood Cells: A Potential Delivery System J. Nanobiotechnol. 2023 21 288 10.1186/s12951-023-02060-5 PMC10464085 37608283 46. Tsamesidis I. Kazeli K. Lymperaki E. Pouroutzidou G.K. Oikonomou I.M. Komninou P. Zachariadis G. Reybier K. Pantaleo A. Kontonasaki E. Effect of Sintering Temperature of Bioactive Glass Nanoceramics on the Hemolytic Activity and Oxidative Stress Biomarkers in Erythrocytes Cell. Mol. Bioeng. 2020 13 201 218 10.1007/s12195-020-00614-3 32426058 PMC7225217 47. Akhter M.H. Khalilullah H. Gupta M. Alfaleh M.A. Alhakamy N.A. Riadi Y. Md S. Impact of Protein Corona on the Biological Identity of Nanomedicine: Understanding the Fate of Nanomaterials in the Biological Milieu Biomedicines 2021 9 496 10.3390/biomedicines9101496 34680613 PMC8533425 48. Xia Q. Zhang Y. Li Z. Hou X. Feng N. Red Blood Cell Membrane-Camouflaged Nanoparticles: A Novel Drug Delivery System for Antitumor Application Acta Pharm. Sin. B 2019 9 675 689 10.1016/j.apsb.2019.01.011 31384529 PMC6663920 49. Mohandas N. Gallagher P.G. Red Cell Membrane: Past, Present, and Future Blood 2008 112 3939 3948 10.1182/blood-2008-07-161166 18988878 PMC2582001 50. Nazemidashtarjandi S. Vahedi A. Farnoud A.M. Lipid Chemical Structure Modulates the Disruptive Effects of Nanomaterials on Membrane Models Langmuir 2020 36 4923 4932 10.1021/acs.langmuir.0c00295 32312045 PMC8725912 51. Walter S. Structure of the Plasma Membrane: An Electron-Microscope Study Circulation 1962 26 1066 1069 13984234 10.1161/01.cir.26.5.1066 52. Chang S.H. Low P.S. Regulation of the Glycophorin C-Protein 4.1 Membrane-to-Skeleton Bridge and Evaluation of Its Contribution to Erythrocyte Membrane Stability J. Biol. Chem. 2001 276 22223 22230 10.1074/jbc.M100604200 11294862 53. Kodippili G.C. Spector J. Hale J. Giger K. Hughes M.R. McNagny K.M. Birkenmeier C. Peters L. Ritchie K. Low P.S. Analysis of the Mobilities of Band 3 Populations Associated with Ankyrin Protein and Junctional Complexes in Intact Murine Erythrocytes J. Biol. Chem. 2012 287 4129 4138 10.1074/jbc.M111.294439 22147703 PMC3281732 54. Midya J. Auth T. Gompper G. Membrane-Mediated Interactions Between Nonspherical Elastic Particles ACS Nano 2023 17 1935 1945 10.1021/acsnano.2c05801 36669092 PMC9933614 55. Tian Y. Tian Z. Dong Y. Wang X. Zhan L. Current Advances in Nanomaterials Affecting Morphology, Structure, and Function of Erythrocytes RSC Adv. 2021 11 6958 6971 10.1039/D0RA10124A 35423203 PMC8695043 56. Handschuh-Wang S. Wang T. Zhou X. Recent Advances in Hybrid Measurement Methods Based on Atomic Force Microscopy and Surface Sensitive Measurement Techniques RSC Adv. 2017 7 47464 47499 10.1039/C7RA08515J 57. Blanco E. Shen H. Ferrari M. Principles of Nanoparticle Design for Overcoming Biological Barriers to Drug Delivery Nanomater. Neoplasms 2015 33 941 951 10.1038/nbt.3330 PMC4978509 26348965 58. Djayanti K. Maharjan P. Cho K.H. Jeong S. Kim M.S. Shin M.C. Min K.A. Mesoporous Silica Nanoparticles as a Potential Nanoplatform: Therapeutic Applications and Considerations Int. J. Mol. Sci. 2023 24 6349 10.3390/ijms24076349 37047329 PMC10094416 59. Gao W. Zhang L. Coating Nanoparticles with Cell Membranes for Targeted Drug Delivery J. Drug Target. 2015 23 619 626 10.3109/1061186X.2015.1052074 26453159 60. Hu C.M.J. Zhang L. Aryal S. Cheung C. Fang R.H. Zhang L. Erythrocyte Membrane-Camouflaged Polymeric Nanoparticles as a Biomimetic Delivery Platform Proc. Natl. Acad. Sci. USA 2011 108 10980 10985 10.1073/pnas.1106634108 21690347 PMC3131364 61. Zhai Y. Su J. Ran W. Zhang P. Yin Q. Zhang Z. Yu H. Li Y. Preparation and Application of Cell Membrane-Camouflaged Nanoparticles for Cancer Therapy Theranostics 2017 7 2575 2592 10.7150/thno.20118 28819448 PMC5558554 62. Nguyen P.H.D. Jayasinghe M.K. Le A.H. Peng B. Le M.T.N. Advances in Drug Delivery Systems Based on Red Blood Cells and Their Membrane-Derived Nanoparticles ACS Nano 2023 17 5187 5210 10.1021/acsnano.2c11965 36896898 63. Vincy A. Mazumder S. Amrita Banerjee I. Hwang K.C. Vankayala R. Recent Progress in Red Blood Cells-Derived Particles as Novel Bioinspired Drug Delivery Systems: Challenges and Strategies for Clinical Translation Front. Chem. 2022 10 905256 10.3389/fchem.2022.905256 35572105 PMC9092017 64. Kou Q. Huang Y. Su Y. Lu L. Li X. Jiang H. Huang R. Li J. Nie X. Erythrocyte Membrane-Camouflaged DNA-Functionalized Upconversion Nanoparticles for Tumor-Targeted Chemotherapy and Immunotherapy Nanoscale 2023 15 9457 9476 10.1039/D3NR00542A 37161583 65. Rodrigues C.F. Correia I.J. Moreira A.F. Red Blood Cell Membrane-Camouflaged Gold-Core Silica Shell Nanorods for Cancer Drug Delivery and Photothermal Therapy Int. J. Pharm. 2024 655 124007 10.1016/j.ijpharm.2024.124007 38493844 66. Hou K. Zhang Y. Bao M. Xin C. Wei Z. Lin G. Wang Z. A Multifunctional Magnetic Red Blood Cell-Mimetic Micromotor for Drug Delivery and Image-Guided Therapy ACS Appl. Mater. Interfaces 2022 14 3825 3837 10.1021/acsami.1c21331 35025195 67. Zhao X. Wu G. Tao X. Dong D. Liu J. Targeted Mitochondrial Therapy for Pancreatic Cancer Transl. Oncol. 2025 54 102340 10.1016/j.tranon.2025.102340 40048984 PMC11928980 68. Luo Z. Sun L. Bian F. Wang Y. Yu Y. Gu Z. Zhao Y. Erythrocyte-Inspired Functional Materials for Biomedical Applications Adv. Sci. 2023 10 2206150 10.1002/advs.202206150 PMC9951328 36581585 69. Li Z. Lan J. Wu Y. Ding Y. Zhang T. Homotypic Cell Membrane-Camouflaged Biomimetic PLGA Nanoparticle Loading Triptolide for the Treatment of Hepatocellular Carcinoma Drug Deliv. 2024 31 2354687 10.1080/10717544.2024.2354687 38823413 PMC11146252 70. Beh C.Y. Prajnamitra R.P. Chen L.L. Hsieh P.C.H. Advances in Biomimetic Nanoparticles for Targeted Cancer Therapy and Diagnosis Molecules 2021 26 5052 10.3390/molecules26165052 34443638 PMC8401254 71. Li Y. Raza F. Liu Y. Wei Y. Rong R. Zheng M. Yuan W. Su J. Qiu M. Li Y. Clinical Progress and Advanced Research of Red Blood Cells Based Drug Delivery System Biomaterials 2021 279 121202 10.1016/j.biomaterials.2021.121202 34749072 72. Samir A. Elgamal B.M. Gabr H. Sabaawy H.E. Nanotechnology Applications in Hematological Malignancies Oncol. Rep. 2015 34 1097 1105 10.3892/or.2015.4100 26134389 PMC4530900 73. Shan X. Gong X. Li J. Wen J. Li Y. Zhang Z. Current Approaches of Nanomedicines in the Market and Various Stage of Clinical Translation Acta Pharm. Sin. B 2022 12 3028 3048 10.1016/j.apsb.2022.02.025 35865096 PMC9293719 74. Mehta M. Bui T.A. Yang X. Aksoy Y. Goldys E.M. Deng W. Lipid-Based Nanoparticles for Drug/Gene Delivery: An Overview of the Production Techniques and Difficulties Encountered in Their Industrial Development ACS Mater. Au 2023 3 600 619 10.1021/acsmaterialsau.3c00032 38089666 PMC10636777 75. Guo H. Mi P. Polymer–Drug and Polymer–Protein Conjugated Nanocarriers: Design, Drug Delivery, Imaging, Therapy, and Clinical Applications Wiley Interdiscip. Rev. Nanomed. Nanobiotechnol. 2024 16 e1988 10.1002/wnan.1988 39109479 76. Deivayanai V.C. Thamarai P. Karishma S. Saravanan A. Yaashikaa P.R. Vickram A.S. Hemavathy R.V. Kumar R.R. Rishikesavan S. Shruthi S. A Comprehensive Review on Advances in Nanoparticle-Mediated Cancer Therapeutics: Current Research and Future Perspectives Cancer Pathog. Ther. 2024 3 293 308 10.1016/j.cpt.2024.11.002 40697517 PMC12277815 77. Glassman P.M. Muzykantov V.R. Pharmacokinetic and Pharmacodynamic Properties of Drug Delivery Systems J. Pharmacol. Exp. Ther. 2019 370 570 580 10.1124/jpet.119.257113 30837281 PMC6806371 78. Aljabali A.A. Obeid M.A. Bashatwah R.M. Serrano-Aroca Á. Mishra V. Mishra Y. El-Tanani M. Hromić-Jahjefendić A. Kapoor D.N. Goyal R. Nanomaterials and Their Impact on the Immune System Int. J. Mol. Sci. 2023 24 2008 10.3390/ijms24032008 36768330 PMC9917130 Figure 1 Benefits from the use of nanoparticles that have been loaded with therapeutic agents and incorporated into RBCs, compared to conventional drug delivery methods. Created in BioRender. Fortis, S. (2025) https://BioRender.com/0645avy Figure 2 Applications of inorganic nanoparticles (INPs) in the diagnosis and treatment of cancer through photodynamic therapy, photothermal therapy, and drug delivery. Created in BioRender. Fortis, S. (2025) https://BioRender.com/0645avy ",
  "metadata": {
    "Title of this paper": "Nanomaterials and Their Impact on the Immune System",
    "Journal it was published in:": "Current Issues in Molecular Biology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468269/"
  }
}