{
  "title": "Paper_1071",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471236 PMC12471236.1 12471236 12471236 41009789 10.3390/ijms26189227 ijms-26-09227 1 Article Inhibition of HCN Channels Enhances Oxidative Stress and Autophagy of NRK-52E Cells Under NH 4 López-González Zinaeli 1 Escobar Laura I. 1 * León-Aparicio Daniel 1 https://orcid.org/0009-0007-8554-9076 Mejía-Peralta Abirán Fernando 1 Padilla-Flores Teresa 1 https://orcid.org/0000-0003-0768-3556 Larre Isabel 1 Salvador Carolina 1 https://orcid.org/0000-0001-8264-0412 Medina-Campos Omar Noel 2 https://orcid.org/0000-0001-6628-4411 Pedraza-Chaverri José 2 de la Fuente-Granada Marisol 3 Fromm Michael Academic Editor 1 zlopez@facmed.unam.mx dleon@facmed.unam.mx 2 pedraza@unam.mx 3 mdelafuente@iibiomedicas.unam.mx * laurae@unam.mx 21 9 2025 9 2025 26 18 497349 9227 23 7 2025 16 9 2025 19 9 2025 21 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ The hyperpolarization-activated cyclic nucleotide-gated (HCN) channels in the kidney participate in reabsorbing potassium (K + 4 + 4 4 4 4 4 2 2 4 Hyperpolarization-activated cyclic nucleotide-gated cation (HCN) channels autophagy oxidative stress ZD7288 HCN3 lysosomal channel HCN3 mitochondrial channel CONACYT A1-S-8731 CBF 2023-2024-190 UNAM-DGAPA-PAPIIT IN204123 This research received funding from CONACYT A1-S-8731 (L.I.E.), CBF 2023-2024-190 (J.P.-C.), and UNAM-DGAPA-PAPIIT IN204123 (L.I.E.). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The lungs and kidneys keep arterial pH within a narrow range of 7.35 to 7.46. The kidney regulates plasma bicarbonate concentration by excreting hydrogen ions as ammonium (NH 3 4 + 1 2 3 The proximal tubule in the kidney is responsible for reabsorbing most of the sodium and bicarbonate in the body, spending a high amount of ATP to facilitate the transcellular movement of various nutrients such as amino acids, glucose, and important anions such as phosphate and citrate, among other electrolytes. For this reason, this first segment of the nephron contains the highest number of mitochondria and performs their selective degradation by autophagy (mitophagy). Maintenance of mitochondrial homeostasis is vital for kidney function. Mitophagy acts as a quality control process in which impaired mitochondria are enclosed within autophagosomes and autolysosomes for degradation, allowing cells to cope with stressful conditions such as oxidative stress caused by metabolic acidosis [ 4 5 During acidosis mitochondria reduce their oxidative phosphorylation and Ca 2+ 5 6 7 8 9 9 10 The hyperpolarization-activated and cyclic nucleotide-gated (HCN) cation channels are activated at hyperpolarizing voltages of −60 to −100 mV [ 11 12 + 4 + 13 14 15 16 17 Block of HCN channels with ivabradine (Iva) or its analog ZD7288, shows cardio-, neuro-, and/or renal protective effects. Iva reduces oxidative injury and endothelial dysfunction in cardiac ischemia [ 18 19 20 21 22 In this work we aimed to evaluate the role of mitoHCN3 and lysoHCN3 channels in autophagy, mROS production, and Δψm through their inhibition with ZD7288 in cultured rat proximal tubule cells (NRK-52E) exposed to NH 4 2. Results 2.1. NH 4 Extracellular acidosis was established with NH 4 Figure 1 Figure S1 4 Figure 1 2.2. NH 4 The N-terminal truncated HCN3 isoform (65 kDa) predominates in mitochondria of NRK-52E cells ( Figure 2 16 4 Figure 2 4 Figure 3 2.3. Time-Dependent Effect of ZD7288 on Mitophagy Beclin1, LC3BII, p62, and Parkin were quantified under CQ or NH 4 Figure 4 4 4 4 Figure 4 To corroborate the effect of ZD7288 on autophagy, a comparative assay with wortmannin (WT) and rapamycin (RA) was performed. As expected, NH 4 4 Figure 5 2.4. ZD7288 and/or NH 4 ZD7288 (1.0 ± 0.02 vs. 1.64 ± 0.07) or NH 4 Figure 6 H 2 2 Figure 7 Figure 7 2 2 Figure 7 2 2 Figure 7 4 2 2 2.5. Mitophagy Stimulated by ZD7288 in NH 4 Since moderate levels of mROS and mitochondrial depolarization can trigger mitophagy [ 23 Figure 8 24 We evaluated the effect of ZD7288 on Δψm in basal and NH 4 Figure 9 Figure S1 4 Figure 9 4 3. Discussion Metabolic acidosis (MA) alters mitochondrial metabolism of the proximal tubule because of increased glutamine catabolism [ 25 2+ 6 4 5 Hereditary distal renal tubular acidosis (dRTA) consists of impairment of apical H + - 3 − 4 + 1 26 27 Blockade of HCN channels develop cardio-, neuro-, and reno-protective effects by increasing autophagy or reducing cellular apoptosis [ 28 15 17 4 In the kidney glutamine is converted to the buffer NH 4 + 3 4 29 30 31 4 32 33 34 35 36 17 Incubation with 30 mM NH 4 2 37 2 4 Renal hypertrophy developed in acidosis has been associated with increased NH 4 38 4 39 40 As we previously found in the kidney and the heart mitochondria, we detected mostly the N-terminal truncated HCN3 isoform (65 kDa) in mitochondria of NRK-52E cells, generated by the N-terminal proteolysis at the residues Ala162–Ile163 [ 41 4 41 14 Previously, we identified lysoHCN3 channels in proximal tubule cells and its up-regulation in acidotic rats [ 17 4 Autophagy inhibitors such as chloroquine (CQ), bafilomycin A1, pepstatin A, and E64d are commonly used to study autophagy [ 42 4 43 4 4 5 4 44 Our findings demonstrate that ZD7288-induced autophagy in NH 4 4 4 + 39 40 39 43 19 21 ZD7288 plus NH 4 19 Previously, we observed that HCN3 overexpression in HEK293 did not change the respiratory control index but instead decreased mitochondrial ATP production, most likely because of mitophagy [ 15 Figure S2 ZD7288 increased mROS levels without developing apoptosis. In this context, the relationship between mROS production and mitoK channels has been documented in cancer. Blockade of the mitoKv1.3 channel increased ROS levels, triggering apoptosis in glioblastoma and melanoma cells [ 45 46 47 2+ + 48 49 Our results confirm the strong dependence of mROS generation on Δψm [ 50 51 52 53 mitoK channels exposed to ROS produced within the mitochondria can affect their functioning and/or expression [ 54 4 2 2 55 56 14 Mitochondrial overload with ROS and/or Ca 2+ 57 + 15 16 23 51 Mitochondrial depolarization caused by ZD7288 under basal conditions was insufficient to provoke apoptosis or necrosis, showing that NRK-52E cells could efficiently counteract ZD7288-induced oxidative stress. In this regard, it has been reported that ZD7288 reduces cell death in hippocampal neurons caused by ischemia–reperfusion injury by decreasing the levels of the pro-apoptotic proteins AIF, p53, Bax, and Caspase-3 [ 22 In conclusion, our results provide evidence of the participation of mitoHCN3 and lysoHCN3 channels in the control of mitochondrial oxidative stress and autophagy by NH 4 4. Materials and Methods 4.1. Cell Cultures and Experimental Treatments NRK-52E cells were cultured in high-glucose Dulbecco’s modified Eagle’s medium (DMEM; Gibco, 31600-091, Waltham, MA, USA) supplemented with 10% fetal bovine serum (FBS; Gibco, 26140-079, Waltham, MA, USA) and penicillin (1000 U/mL)/streptomycin (1 mg/mL; Biowest, L0022, Nuaille, France) and maintained in an incubator at 37 °C with a 5% atmosphere of CO 2 4 3 2 2 3 4.2. Mitochondria Enrichment NRK-52E cells seeded in 15 cm Petri dishes at the end of the treatments were rinsed with cold phosphate-buffered saline (PBS), harvested with 2 mL of PBS, and centrifuged at 600× g g g g 4 2 7 3 4 4.3. Western Blots Proteins were separated by sodium dodecyl sulfate-polyacrylamide gel electrophoresis (SDS–PAGE) and electrotransferred to a polyvinylidene fluoride (PVDF) membrane. Membrane was blocked with 5% fat-free milk in Tris-buffered saline supplemented with 0.1% Tween 20 (TBS-T) for 1–2 h at room temperature. Primary antibodies were incubated with the membrane for 18 h at 4 °C: anti-HCN3 (1:400 dilution; C-terminal epitope, Alomone, APC-057, Jerusalem, Israel), anti-Beclin1 (1:1000 dilution, Santa Cruz Biotechnology, sc-48341, Dallas, TX, USA), anti-LC3B (1:250 dilution, Santa Cruz Biotechnology, sc-271625, Dallas, TX, USA), anti-p62 (1:500 dilution, Abnova, H00008878-M01, Neihu District, Taipei City, Taiwán), anti-Parkin (1:300 dilution, Santa Cruz Biotechnology, sc-32282, Dallas, TX, USA), and anti-malondialdehyde (1:500 dilution, Abcam, Ab27642, Waltham, MA, USA). As loading and cell fractionation controls, anti-β-actin (1:1000 dilution, Santa Cruz Biotechnology, sc-47778, Dallas, TX, USA) and anti-VDAC1 (1:3000 dilution, Abcam, Ab34726, Waltham, MA, USA) were used. Secondary antibodies were conjugated to horseradish peroxidase (IgG-HRP, Jackson ImmunoResearch, West Grove, PA, USA) for 1 h at room temperature. Proteins were detected by enhanced chemiluminescence (Clarity Western ECL substrate kit, Bio-Rad, Hercules, CA, USA), and images were obtained with a photo documenter (Analytik Jena, UVP ChemStudio, Upland, CA, USA). 4.4. Immunofluorescence Assays NRK-52E cells were incubated with LysoTracker Red DND-99 [75 nM] for 2 h, a selective lysosome dye (Invitrogen, L7528, Eugene, Oregon USA) and, subsequently, the excess was washed with PBS. The cells were then fixed with 4% paraformaldehyde (10 min), permeabilized with 0.1% Triton X-100 (10 min), and blocked with 2% bovine serum albumin in PBS (1 h). The cells were incubated with rabbit anti-HCN3 (1:100 dilution, Alomone Labs, APC-057, Jerusalem, Israel) overnight at 4 °C, followed by the secondary anti-rabbit IgG antibody coupled to Alexa Fluor 488 (1:500 dilution, 1 h at room temperature, Abcam, Waltham, MA, USA). After washing with Tween 0.5% in PBS, a mounting medium (Vectashield, Vector laboratories, H1000, Newark, CA, USA) was added to the slides. The images were acquired by confocal microscopy (Zeiss LSM 880, Oberkochen, Germany), objective 63x, and analyzed with Fiji ImageJ software v2.7.0. 4.5. Measurement of mROS and Δψm NRK-52E cells were seeded on 96-well plates at a density of 15,000 cells/well. At the end of the treatments, the cells were rinsed with PBS, and the mROS level was measured by incubating the cells with 5 mM MitoSox (excitation: 510 nm, emission: 580 nm; Invitrogen, M36008 2 4.6. Statistical Analysis Ordinary one-way ANOVA and unpaired Student’s t Acknowledgments We thank María Fernanda López Hernández for performing the assays of the Supplementary Figure Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/ijms26189227/s1 Author Contributions Conception and design: Z.L.-G. and L.I.E.; Writing—original draft preparation: Z.L.-G. and L.I.E.; Manuscript review and editing: Z.L.-G., L.I.E., D.L.-A., A.F.M.-P., J.P.-C.and O.N.M.-C.; Experiments: Z.L.-G., D.L.-A., A.F.M.-P., T.P.-F., I.L., C.S., O.N.M.-C. and M.d.l.F.-G.; Data analysis: Z.L.-G., D.L.-A. and M.d.l.F.-G.; Interpretation of data: Z.L.-G., L.I.E. and A.F.M.-P.; Funding acquisition: L.I.E.; Supervision: L.I.E. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement All data generated or analyzed during this study are included in this published article. Conflicts of Interest We declare that all authors have approved the manuscript for publication and that there is no financial support or relationship that may pose a conflict of interest. References 1. Escobar L. Mejía N. Gil H. Santos F. Distal Renal Tubular Acidosis: A Hereditary Disease with an Inadequate Urinary H + Nefrologia 2013 33 289 296 10.3265/NEFROLOGIA.PRE2012.OCT.11592 23640117 2. Wesson D.E. Buysse J.M. Bushinsky D.A. Mechanisms of Metabolic Acidosis-Induced Kidney Injury in Chronic Kidney Disease J. Am. Soc. Nephrol. 2020 31 469 482 10.1681/ASN.2019070677 31988269 PMC7062220 3. Curthoys N.P. Moe O.W. Proximal Tubule Function and Response to Acidosis Clin. J. Am. Soc. Nephrol. 2014 9 1627 1638 10.2215/CJN.10391012 23908456 PMC4152816 4. Curthoys N.P. Role of Mitochondrial Glutaminase in Rat Renal Glutamine Metabolism J. Nutr. 2001 131 2491S 2495S 10.1093/jn/131.9.2491S 11533299 5. Namba T. Takabatake Y. Kimura T. Takahashi A. Yamamoto T. Matsuda J. Kitamura H. Niimura F. Matsusaka T. Iwatani H. Autophagic Clearance of Mitochondria in the Kidney Copes with Metabolic Acidosis J. Am. Soc. Nephrol. 2014 25 2254 2266 10.1681/ASN.2013090986 24700866 PMC4178439 6. Bento L.M.A. Fagian M.M. Vercesi A.E. Gontijo J.A.R. Effects of NH4Cl-Induced Systemic Metabolic Acidosis on Kidney Mitochondrial Coupling and Calcium Transport in Rats Nephrol. Dial. Transplant. 2007 22 2817 2823 10.1093/ndt/gfm306 17556421 7. Hajam Y.A. Rani R. Ganie S.Y. Sheikh T.A. Javaid D. Qadri S.S. Pramodh S. Alsulimani A. Alkhanani M.F. Harakeh S. Oxidative Stress in Human Pathology and Aging: Molecular Mechanisms and Perspectives Cells 2022 11 552 10.3390/cells11030552 35159361 PMC8833991 8. Togliatto G. Lombardo G. Brizzi M.F. The Future Challenge of Reactive Oxygen Species (ROS) in Hypertension: From Bench to Bed Side Int. J. Mol. Sci. 2017 18 1988 10.3390/ijms18091988 28914782 PMC5618637 9. Song S.B. Jang S.Y. Kang H.T. Wei B. Jeoun U.W. Yoon G.S. Hwang E.S. Modulation of Mitochondrial Membrane Potential and ROS Generation by Nicotinamide in a Manner Independent of SIRT1 and Mitophagy Mol. Cells 2017 40 503 514 10.14348/molcells.2017.0081 28736426 PMC5547220 10. Heher P. Ganassi M. Weidinger A. Engquist E.N. Pruller J. Nguyen T.H. Tassin A. Declèves A.E. Mamchaoui K. Banerji C.R.S. Interplay between Mitochondrial Reactive Oxygen Species, Oxidative Stress and Hypoxic Adaptation in Facioscapulohumeral Muscular Dystrophy: Metabolic Stress as Potential Therapeutic Target Redox Biol. 2022 51 102251 10.1016/j.redox.2022.102251 35248827 PMC8899416 11. Michels G. Brandt M.C. Zagidullin N. Khan I.F. Larbig R. Van Aaken S. Wippermann J. Hoppe U.C. Corrigendum to: Direct Evidence for Calcium Conductance of Hyperpolarization-Activated Cyclic Nucleotide-Gated Channels and Human Native If at Physiological Calcium Concentrations Cardiovasc. Res. 2008 78 466 475 Erratum in Cardiovasc. Res. 2012 95 10.1093/cvr/cvs235 18252758 12. Wollmuth L.P. Hille B. Ionic Selectivity of Ih Channels of Rod Photoreceptors in Tiger Salamanders J. Gen. Physiol. 1992 100 749 765 10.1085/jgp.100.5.749 1282144 PMC2229118 13. Carrisoza-Gaytán R. Rangel C. Salvador C. Saldaña-Meyer R. Escalona C. Satlin L.M. Liu W. Zavilowitz B. Trujillo J. Bobadilla N.A. The Hyperpolarization-Activated Cyclic Nucleotide-Gated HCN2 Channel Transports Ammonium in the Distal Nephron Kidney Int. 2011 80 832 840 10.1038/ki.2011.230 21796099 PMC3752342 14. López-González Z. Ayala-Aguilera C. Martinez-Morales F. Galicia-Cruz O. Salvador-Hernández C. Pedraza-Chaverri J. Medeiros M. Hernández A.M. Escobar L.I. Immunolocalization of Hyperpolarization-Activated Cationic HCN1 and HCN3 Channels in the Rat Nephron: Regulation of HCN3 by Potassium Diets Histochem. Cell Biol. 2016 145 25 40 10.1007/s00418-015-1375-6 26515056 15. León-Aparicio D. Salvador C. Aparicio-Trejo O.E. Briones-Herrera A. Pedraza-Chaverri J. Vaca L. Sampieri A. Padilla-Flores T. López-González Z. León-Contreras J.C. Novel Potassium Channels in Kidney Mitochondria: The Hyperpolarization-Activated and Cyclic Nucleotide-Gated HCN Channels Int. J. Mol. Sci. 2019 20 4995 10.3390/ijms20204995 31601020 PMC6834191 16. Padilla-Flores T. López-González Z. Vaca L. Aparicio-Trejo O.E. Briones-Herrera A. Riveros-Rosas H. Pedraza-Chaverri J. León-Aparicio D. Salvador C. Sampieri A. “Funny” Channels in Cardiac Mitochondria Modulate Membrane Potential and Oxygen Consumption Biochem. Biophys. Res. Commun. 2020 524 1030 1036 10.1016/j.bbrc.2020.02.033 32063359 17. López-González Z. Padilla-Flores T. León-Aparicio D. Gutiérrez-Vásquez E. Salvador C. León-Contreras J.C. Hernández-Pando R. Escobar L.I. Metabolic Acidosis and Hyperkalemia Differentially Regulate Cation HCN3 Channel in the Rat Nephron J. Mol. Histol. 2020 51 701 716 10.1007/s10735-020-09916-2 33070272 18. Custodis F. Reil J.-C. Laufs U. Böhm M. Heart Rate: A Global Target for Cardiovascular Disease and Therapy along the Cardiovascular Disease Continuum J. Cardiol. 2013 62 183 187 10.1016/j.jjcc.2013.02.018 23806547 19. Dai Y. Chen Y. Wei G. Zha L. Li X. Ivabradine Protects Rats against Myocardial Infarction through Reinforcing Autophagy via Inhibiting PI3K/AKT/MTOR/P70S6K Pathway Bioengineered 2021 12 1826 1837 10.1080/21655979.2021.1925008 33975512 PMC8806854 20. Beytur A. Binbay M. Sarihan M.E. Parlakpinar H. Polat A. Gunaydin M.O. Acet A. Dose-Dependent Protective Effect of Ivabradine against Ischemia-Reperfusion-Induced Renal Injury in Rats Kidney Blood Press. Res. 2012 35 114 119 10.1159/000330501 22056748 21. Chen C. Liu L. Shu Y.Q. Jing P. Lu Y. Zhang X.X. Zong X.G. Guo L.J. Li C.J. Blockade of HCN2 Channels Provides Neuroprotection Against Ischemic Injury via Accelerating Autophagic Degradation in Hippocampal Neurons Neurosci. Bull. 2020 36 875 894 10.1007/s12264-020-00513-7 32519067 PMC7410947 22. He Z. Liu J. Zeng X.L. Fan J.H. Wang K. Chen Y. Li Z.C. Zhao B. Inhibition of Hyperpolarization-Activated Cyclic Nucleotide-Gated Cation Channel Attenuates Cerebral Ischemia Reperfusion-Induced Impairment of Learning and Memory by Regulating Apoptotic Pathway Metab. Brain Dis. 2023 38 2751 2763 10.1007/s11011-023-01306-3 37857792 23. Wang Y. Nartiss Y. Steipe B. McQuibban G.A. Kim P.K. ROS-Induced Mitochondrial Depolarization Initiates PARK2/PARKIN-Dependent Mitochondrial Degradation by Autophagy Autophagy 2012 8 1462 1476 10.4161/auto.21211 22889933 24. Jain A. Lamark T. Sjøttem E. Larsen K.B. Awuh J.A. Øvervatn A. McMahon M. Hayes J.D. Johansen T. P62/SQSTM1 Is a Target Gene for Transcription Factor NRF2 and Creates a Positive Feedback Loop by Inducing Antioxidant Response Element-Driven Gene Transcription J. Biol. Chem. 2010 285 22576 10.1074/jbc.M110.118976 20452972 PMC2903417 25. Freund D.M. Prenni J.E. Curthoys N.P. Proteomic Profiling of the Mitochondrial Inner Membrane of Rat Renal Proximal Convoluted Tubules Proteomics 2013 13 2495 2499 10.1002/pmic.201200558 23780708 PMC3826448 26. Escobar L.I. Simian C. Treard C. Hayek D. Salvador C. Guerra N. Matos M. Medeiros M. Enciso S. Camargo M.D. Mutations in ATP6V1B1 and ATP6V0A4 Genes Cause Recessive Distal Renal Tubular Acidosis in Mexican Families Mol. Genet. Genomic. Med. 2016 4 303 311 10.1002/mgg3.205 27247958 PMC4867564 27. Ikeuchi M. Inoue M. Miyahara H. Sebastian W.A. Miyazaki S. Takeno T. Kiyota K. Yano S. Shiraishi H. Shimizu N. A PH Imbalance Is Linked to Autophagic Dysregulation of Inner Ear Hair Cells in Atp6v1ba-Deficient Zebrafish Biochem. Biophys. Res. Commun. 2024 699 149551 10.1016/j.bbrc.2024.149551 38277730 28. Sobhy A. Saleh L.A. Shoukry A.A. Impact of Ivabradine on Renal Function in Septic Patient with Early Renal Impairment Ain-Shams J. Anesthesiol. 2021 13 45 10.1186/s42077-021-00162-6 29. Correia-Oliveira C.R. Lopes-Silva J.P. Bertuzzi R. McConell G.K. Bishop D.J. Lima-Silva A.E. Kiss M.A.P.D.M. Acidosis, but Not Alkalosis, Affects Anaerobic Metabolism and Performance in a 4-Km Time Trial Med. Sci. Sports Exerc. 2017 49 1899 1910 10.1249/MSS.0000000000001295 28398947 30. Mathew J.T. Bio L.L. Injectable Ammonium Chloride Used Enterally for the Treatment of Persistent Metabolic Alkalosis in Three Pediatric Patients J. Pediatr. Pharmacol. Ther. 2012 17 98 103 10.5863/1551-6776-17.1.98 23118664 PMC3428195 31. Purkerson J.M. Everett C.A. Schwartz G.J. Ammonium Chloride-Induced Acidosis Exacerbates Cystitis and Pyelonephritis Caused by Uropathogenic E. coli Physiol. Rep. 2022 10 e15471 10.14814/phy2.15471 36151614 PMC9508385 32. Nagaraja T.N. Brookes N. Intracellular Acidification Induced by Passive and Active Transport of Ammonium Ions in Astrocytes Am. J. Physiol. Cell Physiol. 1998 274 e15471 10.1152/ajpcell.1998.274.4.C883 9575784 33. Kohmoto O. Spitzer K.W. Movsesian M.A. Barry W.H. Effects of Intracellular Acidosis on [Ca 2+ 2+ Circ. Res. 1990 66 622 632 10.1161/01.RES.66.3.622 2306801 34. Nakanishi T. Gu H. Seguchi M. Cragoe E.J. Momma K. HCO3(-)-Dependent Intracellular PH Regulation in the Premature Myocardium Circ. Res. 1992 71 1314 1323 10.1161/01.RES.71.6.1314 1423929 35. Titz S. Hormuzdi S. Lewen A. Monyer H. Misgeld U. Intracellular Acidification in Neurons Induced by Ammonium Depends on KCC2 Function Eur. J. Neurosci. 2006 23 454 464 10.1111/j.1460-9568.2005.04583.x 16420452 36. von Recklinghausen I.R. Kinne R.K.H. Jans A.W.H. Ammonium Chloride-Induced Acidification in Renal TALH SVE.1 Cells Monitored by 31P-NMR Biochim. Biophys. Acta (BBA)—Mol. Cell Res. 1992 1136 129 135 10.1016/0167-4889(92)90247-9 1504097 37. Bidani A. Crandall E.D. DuBose T.D. Analysis of the Determinants of Renal Cortical PCO2 Am. J. Physiol. Renal. Physiol. 1984 16 F466 F474 10.1152/ajprenal.1984.247.3.F466 6433722 38. Kurtz I. Role of Ammonia in the Induction of Renal Hypertrophy Am. J. Kidney Dis. 1991 17 650 653 10.1016/S0272-6386(12)80343-X 2042642 39. Uwada J. Nakazawa H. Kiyoi T. Yazawa T. Muramatsu I. Masuoka T. PIKFYVE Inhibition Induces Endosome- and Lysosome-Derived Vacuole Enlargement via Ammonium Accumulation J. Cell. Sci. 2025 138 jcs262236 10.1242/jcs.262236 39588583 40. Ling H. Vamvakas S. Gekle M. Schaefer L. Teschner M. Schaefer R.M. Heidland A. Role of Lysosomal Cathepsin Activities in Cell Hypertrophy Induced by NH4Cl in Cultured Renal Proximal Tubule Cells J. Am. Soc. Nephrol. 1996 7 73 80 10.1681/ASN.V7173 8808112 41. Calejo A.I. Reverendo M. Silva V.S. Pereira P.M. Santos M.A.S. Zorec R. Gonçalves P.P. Differences in the Expression Pattern of HCN Isoforms among Mammalian Tissues: Sources and Implications Mol. Biol. Rep. 2014 41 297 307 10.1007/s11033-013-2862-2 24234751 42. Yoshii S.R. Mizushima N. Autophagy Machinery in the Context of Mammalian Mitophagy Biochim. Biophys. Acta (BBA)—Mol. Cell Res. 2015 1853 2797 2801 10.1016/j.bbamcr.2015.01.013 25634658 43. Xiong J. Luu T.T.T. Venkatachalam K. Du G. Zhu M.X. Glutamine Produces Ammonium to Tune Lysosomal PH and Regulate Lysosomal Function Cells 2023 12 80 10.3390/cells12010080 PMC9819001 36611873 44. Feng L. Liao H. Liu J. Xu C. Zhong K. Zhu H. Guo S. Guo Y. Han L. Li H. Inhibition of PI3K/Akt/MTOR Pathway by Ammonium Chloride Induced Apoptosis and Autophagy in MAC-T Cell Res. Vet. Sci. 2021 136 622 630 10.1016/j.rvsc.2021.01.020 33930632 45. Leanza L. Henry B. Sassi N. Zoratti M. Chandy K.G. Gulbins E. Szabò I. Inhibitors of Mitochondrial Kv1.3 Channels Induce Bax/Bak-Independent Death of Cancer Cells EMBO Mol. Med. 2012 4 577 593 10.1002/emmm.201200235 22496117 PMC3407946 46. Venturini E. Leanza L. Azzolini M. Kadow S. Mattarei A. Weller M. Tabatabai G. Edwards M.J. Zoratti M. Paradisi C. Targeting the Potassium Channel Kv1.3 Kills Glioblastoma Cells Neurosignals 2017 25 26 38 10.1159/000480643 28869943 47. Kulawiak B. Żochowska M. Bednarczyk P. Galuba A. Stroud D.A. Szewczyk A. Loss of the Large Conductance Calcium-Activated Potassium Channel Causes an Increase in Mitochondrial Reactive Oxygen Species in Glioblastoma Cells Pflugers Arch. 2023 475 1045 1060 10.1007/s00424-023-02833-9 37401985 PMC10409681 48. Gross D. Bischof H. Maier S. Sporbeck K. Birkenfeld A.L. Malli R. Ruth P. Proikas-Cezanne T. Lukowski R. IKCa Channels Control Breast Cancer Metabolism Including AMPK-Driven Autophagy Cell Death Dis. 2022 13 902 10.1038/s41419-022-05329-z 36302750 PMC9613901 49. Huang C. Yi H. Shi Y. Cao Q. Shi Y. Cheng D. Braet F. Chen X.M. Pollock C.A. KCa3.1 Mediates Dysregulation of Mitochondrial Quality Control in Diabetic Kidney Disease Front. Cell Dev. Biol. 2021 9 573814 10.3389/fcell.2021.573814 33681190 PMC7933228 50. Pyatrikas D.V. Fedoseeva I.V. Varakina N.N. Rusaleva T.M. Stepanov A.V. Fedyaeva A.V. Borovskii G.B. Rikhvanov E.G. Relation between Cell Death Progression, Reactive Oxygen Species Production and Mitochondrial Membrane Potential in Fermenting Saccharomyces Cerevisiae Cells under Heat-Shock Conditions FEMS Microbiol. Lett. 2015 362 fnv082 10.1093/femsle/fnv082 25991811 51. Suski J. Lebiedzinska M. Bonora M. Pinton P. Duszynski J. Wieckowski M.R. Relation Between Mitochondrial Membrane Potential and ROS Formation Methods Mol. Biol. 2018 1782 357 381 10.1007/978-1-4939-7831-1_22 29851012 52. Cadenas S. Mitochondrial Uncoupling, ROS Generation and Cardioprotection Biochim. Biophys. Acta (BBA)—Bioenerg. 2018 1859 940 950 10.1016/j.bbabio.2018.05.019 29859845 53. Korshunov S.S. Skulachev V.P. Starkov A.A. High Protonic Potential Actuates a Mechanism of Production of Reactive Oxygen Species in Mitochondria FEBS Lett. 1997 416 15 18 10.1016/S0014-5793(97)01159-9 9369223 54. Lewandowska J. Kalenik B. Wrzosek A. Szewczyk A. Redox Regulation of Mitochondrial Potassium Channels Activity Antioxidants 2024 13 434 10.3390/antiox13040434 38671882 PMC11047711 55. Oyewole A.O. Birch-Machin M.A. Mitochondria-Targeted Antioxidants FASEB J. 2015 29 4766 4771 10.1096/fj.15-275404 26253366 56. Guillery O. Malka F. Landes T. Guillou E. Blackstone C. Lombès A. Lombès L. Belenguer P. Arnoult D. Rojo M. Metalloprotease-Mediated OPA1 Processing Is Modulated by the Mitochondrial Membrane Potential Biol. Cell 2008 100 315 325 10.1042/BC20070110 18076378 57. Venditti P. Di Meo S. The Role of Reactive Oxygen Species in the Life Cycle of the Mitochondrion Int. J. Mol. Sci. 2020 21 2173 10.3390/ijms21062173 32245255 PMC7139706 Figure 1 NH 4 A 4 4 B n p p p p # # p Figure 2 Identification of mitoHCN3 in NRK-52E cells and its regulation by chloroquine (CQ) and NH 4 4 p Figure 3 NH 4 A 4 B n p p Figure 4 Effect of ZD7288 on mitophagy with chloroquine (CQ) or NH 4 A B n # # p ## p ### p p p p p δ t δ p Figure 5 Effect of ZD7288 (ZD), Wortmannin (WT), and Rapamycin (RA) on autophagy. ( A 4 B n # # p ## p ### p #### p p p Figure 6 NH 4 A 4 B n p p Figure 7 mitoHCN3 is up-regulated by H 2 2 A 2 2 n B C n D n t δ p δ δ p Figure 8 ZD7288-induced autophagy in acidosis is mediated by a ROS-independent pathway. ( A 4 B p p p Figure 9 ZD7288-induced autophagy in acidosis is mediated by a Δψm-independent pathway. ( A B n # ### p #### p p ",
  "metadata": {
    "Title of this paper": "The Role of Reactive Oxygen Species in the Life Cycle of the Mitochondrion",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471236/"
  }
}