{
  "title": "Paper_891",
  "abstract": "pmc Discov Oncol Discov Oncol 4139 discon Discover Oncology 2730-6011 Springer PMC12474845 PMC12474845.1 12474845 12474845 41003892 10.1007/s12672-025-03491-2 3491 1 Research Disulfidptosis OXSM serves as a potential prognostic biomarker and correlates with immune infiltrates in glioma Zhu Jinchao 1 2 Ke Yao 2 Fan Yijuan 3 Lin Qingyuan 1 2 Zhu Weiyao 2 Guo Wenhuan wenhuan1130@sina.com 2 Nie Shengdong nsd4647@163.com 1 1 https://ror.org/00ay9v204 grid.267139.8 0000 0000 9188 055X School of Health Science and Engineering, University of Shanghai for Science and Technology, 2 https://ror.org/0220qvk04 grid.16821.3c 0000 0004 0368 8293 Department of Pathology, Shanghai Ninth People’s Hospital, Shanghai Jiao Tong University School of Medicine, 3 26 9 2025 12 2025 16 478248 1734 10 1 2025 23 8 2025 26 09 2025 28 09 2025 28 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Glioma, a common primary brain tumor arising from glial cells, presents significant therapeutic challenges due to its diverse and complex biological behavior. While disulfidptosis has recently emerged as a novel form of cell death, the role of disulfidptosis-related genes (DRGs) in glioma and their relationship with the tumor immune microenvironment remains poorly understood. Methods We analyzed DRGs expression patterns in glioma samples and their correlation with patient survival using data from TCGA, GEO, and CGGA databases. We employed ROC curve analysis to evaluate the diagnostic potential of individual DRGs and identify hub genes. We investigated the relationship between hub gene expression and immune cell infiltration through immune infiltration analysis. Additionally, we conducted drug sensitivity analysis and molecular docking to explore associations between hub gene expression and drug responsiveness. Finally, we validated DRGs expression in glioma samples using RT-PCR and tissue microarrays. Results Among the ten DRGs examined, six genes (OXSM, SLC3A2, RPN1, NDUFS1, GYS1, and LRPPRC) showed significant differential expression in glioma tissues, while four (NCKAP1, NDUFA11, NUBPL, and SLC7A11) did not. Survival analysis revealed that elevated expression of OXSM, RPN1, GYS1, SLC3A2, and NDUFA11 correlated with poor patient outcomes. ROC analysis of both TCGA test and GEO validation sets identified OXSM as a hub gene, with AUC values exceeding 0.88. CGGA database analysis demonstrated higher OXSM expression in GBM compared to LGG, with peak expression in WHO grade IV tumors, significantly correlating with reduced overall survival ( p Conclusion Our study identifies OXSM as a key DRG hub gene in glioma, with elevated expression strongly correlating with poor patient prognosis. The observed relationship between OXSM expression and immune cell infiltration suggests its potential role in modulating the glioma microenvironment. These findings advance our understanding of glioma’s molecular mechanisms and may inform the development of novel therapeutic strategies. Supplementary Information The online version contains supplementary material available at 10.1007/s12672-025-03491-2. Keywords Disulfidptosis Glioma Tumor immune microenvironment Immune cell infiltration Drug sensitivity Key Specialties in Baoshan District of Shanghai BSZK-2023-BZ10 Fan Yijuan https://doi.org/10.13039/501100001809 National Natural Science Foundation of China Grant No. 81830052 Nie Shengdong Natural Science Foundation of Shanghai Grant No. 20ZR1438300 Nie Shengdong https://doi.org/10.13039/501100015377 Shanghai Key Laboratory of Molecular Imaging Grant No. 18DZ2260400 Nie Shengdong pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Science+Business Media LLC, part of Springer Nature 2025 Introduction Gliomas represent the most prevalent malignant tumors of the central nervous system [ 1 2 3 5 6 7 8 9 Despite these advances, while most molecular markers strongly correlate with glioma prognosis, they have not translated into substantial improvements in patient survival. Current GBM treatment protocols rely on maximal safe surgical resection followed by concurrent chemoradiotherapy [ 10 11 12 Disulfidptosis represents a recently discovered form of programmed cell death that offers a promising avenue for understanding cancer progression. First described by Liu et al. [ 13 14 15 16 While the function and role of disulfidptosis in other tumor types have been partially elucidated, its role and mechanism in glioma remain unclear. Specifically, the potential of OXSM (3-oxoacyl-ACP synthase, mitochondrial), a key gene associated with disulfidptosis, represents a novel and largely uncharted research territory in glioma. Previous studies have touched upon OXSM in other contexts, but its comprehensive investigation in glioma is unprecedented. Wang et al. [ 17 In light of these challenges and opportunities, our study aims to comprehensively investigate the expression patterns of OXSM in glioma using multiple public databases (TCGA, CGGA, and GEO). Evaluate the prognostic significance of OXSM in glioma patients. Analyze the relationship between OXSM expression and immune cell infiltration in the tumor microenvironment. Explore potential therapeutic implications of OXSM in glioma treatment.By leveraging advanced bioinformatic analyses and experimental approaches, we seek to uncover the potential role of OXSM in glioma progression. Provide insights into its mechanisms of action. Investigate its potential as a diagnostic and prognostic biomarker. Explore novel therapeutic strategies targeting OXSM. Furthermore, we analyzed the relationship between OXSM expression and immune cell infiltration in the tumor microenvironment to elucidate potential mechanisms by which OXSM may regulate the glioma immune microenvironment. Through these investigations, we aim to provide new insights and evidence for understanding glioma’s molecular mechanisms and developing novel therapeutic targets. Our research addresses a critical gap in current understanding, offering a fresh perspective on targeting glioma through the lens of disulfidptosis-related gene mechanisms. By focusing on OXSM, we aim to provide new insights that could potentially transform our approach to glioma treatment and personalized medicine. Materials and methods Data acquisition and preprocessing We collected ten disulfidptosis-related genes (DRGs) from published literature [ 18 https://portal.gdc.cancer.gov/ https://portal.gdc.cancer.gov http://www.cgga.org.cn/ https://www.ncbi.nlm.nih.gov/geo/ Expression, prognosis, and ROC curve analysis of DRGs in glioma To investigate the expression patterns of DRGs in glioma, we employed the R packages “limma” and “ggplot2” to analyze the expression of DRGs in glioma tissues versus normal tissues. Differences between two groups were compared using the Wilcoxon rank-sum test (Mann-Whitney U test), a non-parametric statistical method that assesses whether the distribution of a continuous variable differs significantly between two independent groups. This approach is particularly robust when the data do not follow a normal distribution, allowing for a comparison of median values and overall distribution patterns without assuming parametric conditions. Survival analysis was conducted using the R “survival” package to assess overall survival in glioma patients based on DRG expression levels. Compare the difference in survival time between two groups of patients using a log rank test. Patients were categorized into high and low expression groups, and differences in survival times between these groups were compared. To evaluate the diagnostic performance of hub DRGs in glioma patients, we used the R packages “glmnet” and “pROC” to compute receiver operating characteristic (ROC) curves and calculate the area under the curve (AUC) scores for each key gene. Genes with AUC scores exceeding 0.88 in both the test and validation sets were identified as key genes, suggesting their potential utility as biomarkers for glioma diagnosis. Biological function analysis To investigate the biological functions associated with hub gene in gliomas, we conducted GO, KEGG, and GSEA enrichment analyses. GO analysis was utilized to identify biological processes (BP), cellular components (CC), and molecular functions (MF) significantly associated with hub gene expression. KEGG enrichment analysis aimed to identify potential biological pathways involved in hub gene expression in gliomas. GSEA enabled the evaluation of the enrichment degree of predefined gene sets in a specific biological state. This study assessed whether gene sets associated with high or low hub gene expression were enriched in specific functional sets or pathways (e.g., KEGG pathways). This helps reveal key biological processes or pathways that might be impacted by OXSM gene expression changes in gliomas. Immune infiltration and immune checkpoint gene correlation analysis Utilizing the immune cell infiltration estimation algorithm CIBERSORT, we assessed the infiltration levels of various types of immune cells in glioma samples with different hub gene expression levels. We employed the Wilcoxon rank-sum test to determine whether significant differences existed in immune cell infiltration levels between high and low gene expression groups. Spearman correlation analysis was utilized to calculate the correlation between gene expression and immune cell abundance. Additionally, the Wilcoxon rank-sum test was applied to compare differences in tumor microenvironment (TME) scores between high and low gene expression groups. Furthermore, Pearson correlation analysis was performed to evaluate the expression correlation between target genes and immune checkpoint genes, aiming to assess the potential collaborative mechanism in promoting glioma progression. Clinical features and nomogram model construction To investigate the correlation between core genes and clinical characteristics of glioma, we employed chi-square analysis to examine the associations between key genes and clinical features, including age, gender, grade, IDH mutation, 1p19q codeletion, and histopathological parameters. Concurrently, we developed a prognostic prediction model using a Nomogram that incorporates core gene expression levels and potential clinical variables. The Cox proportional hazards regression model was utilized to assess the impact of multiple clinical variables on survival time. Based on these factors, we constructed a Nomogram to provide individualized survival predictions. The model’s accuracy was evaluated using calibration curves, ensuring a comprehensive and personalized approach to prognostic assessment in glioma patients. Single-cell analysis The Tumor Immune Single Cell Hub2 (TISCH2, http://tisch.comp-genomics.org Drug sensitivity analysis and molecular docking We assessed drug sensitivity by evaluating the relationship between core gene expression levels and glioma tissue responses to various anticancer drugs. Using the Wilcoxon rank-sum test (Mann-Whitney U test), we compared the differences in drug sensitivity (IC50) between high and low gene expression groups. Additionally, we employed computer-aided design software to perform molecular docking experiments, aiming to explore the potential interactions between key proteins and drugs, thus providing insights into the potential mechanisms of drug sensitivity and therapeutic efficacy. Real-time quantitative PCR (qPCR) The expression of OXSM was verified by PCR in glioma cell lines U87 MG and U251. The U87 MG cell line, a glioblastoma cell line of unknown origin, was provided by the First Affiliated Hospital of Third Military Medical University. The U251 cell line was purchased from Shanghai Zhuo Bao Biotechnology Center, and the HMC3 cell line was obtained from Wuhan Procell Life Science & Technology Co., Ltd. All cell lines were authenticated using STR profiling. The following primers were used for OXSM: OXSM-F: 5′-GTGCAGCCTGAGGAGATATCC-3′, OXSM-R: 5′-TTTCAGCAGCATCTCCCAATG-3′. GAPDH-F: CAGCCTCAAGATCATCAGCAAT, GAPDH-R: AGTCCTTCCACGATACCAAAGT. Tissue microarray and immunohistochemistry Glioma tissue samples provided by the Renhe Hospital, Baoshan District, Shanghai. Antibodies were purchased from Abcam and diluted at a concentration of 1:200. Immunohistochemical validation was performed using Roche’s immunohistochemistry instrument ULTRA. Tissue microarrays were sectioned, dewaxed, and incubated with primary and secondary antibodies, followed by dehydration and sealing, and then observed under a microscope. Immunohistochemical scoring was conducted by three independent pathologists from the Department of Pathology. Specifically, the intensity of positive cytoplasmic staining was graded on a scale of 0–3 (0, no staining; 1, light brown; 2, medium brown; 3, dark brown). The percentage of positively stained cells was scored as 1 (1–25%), 2 (26–50%), 3 (51–75%), or 4 (76–100%). The OXSM antibody was purchased from Abcam. Using the GSE253080 https://depmap.org/portal/ The study involving glioma patients was reviewed and approved by the Ethics Committee of Renhe Hospital in Baoshan District, Shanghai (KY2023-04). The informed consent requirement was waived by the Ethics Committee of Renhe Hospital. Statistical analysis In this study, we employed multiple statistical methods to ensure the rigor of our data analysis. Specifically, we utilized Wilcoxon rank-sum test (Mann-Whitney U test) to compare the significant differences between two groups for continuous variables; log-rank test for survival analysis to assess the significance of survival curves; chi-square test to analyze associations between categorical variables; Cox proportional hazards regression model for multivariate survival analysis; Spearman and Pearson correlation analyses to evaluate non-parametric and linear relationships, respectively; and receiver operating characteristic (ROC) curve analysis to assess diagnostic performance. All statistical analyses were performed using R statistical software (version 4.4.1), with a significance level of P Result Expression and prognosis of DRGs in glioma Upon analyzing glioma and corresponding non-tumor brain tissue samples from the TCGA database, we found that OXSM, SLC3A2, RPN1, and GYS1 were significantly overexpressed in glioma tissues compared to non-tumor brain tissues ( p 1 p 1 1 2 2 3 GSE50161 4 5 p 5 5  Fig. 1 Expression of 10 DRGs in Glioma. A D E F G J  Fig. 2 Prognostic Impact of 10 DRGs on Glioma Patients. A D E J  Fig. 3 ROC Curves of DRGs in the TCGA Test Set. A B C J  Fig. 4 ROC Curves of DRGs in the GSE50161 A B J  Fig. 5 Correlation between OXSM Expression and Survival in Glioma Patients. A p B C D Biological function enrichment analysis To explore the biological functions of OXSM in gliomas, we analyzed OXSM-associated genes with a Log fold change filter value of 2 and an FDR of 0.01. The results are displayed in Fig. 6 6 6 6  Fig. 6 Biological Functions Associated with OXSM. A B C D Immune infiltration and immune checkpoint gene correlation analysis To explore the correlation between OXSM expression in gliomas and the tumor immune microenvironment, the results demonstrated that low OXSM expression was significantly associated with the Stromal Score. There was no significant correlation with the Immune Score and ESTIMATE Score, yet this does not negate its relationship with the tumor immune microenvironment (Fig. 7 7 7 R 7  Fig. 7 Correlation of OXSM Expression with Immunity. A B C D p Single-cell analysis To investigate the distribution of OXSM expression levels across different cell types in glioma, we utilized public databases to conduct single-cell analysis. Initially, dimensionality reduction and clustering analysis (t-SNE) were performed, revealing 20 distinct clusters (Fig. 8 8 8 8  Fig. 8 Single-Cell Sequencing Analysis. A B C D E F Clinical features and nomogram model analysis Previous analyses indicated that high OXSM expression correlates with shorter survival periods in glioma patients. Therefore, we examined the correlation between OXSM expression and clinical characteristics using data from the CGGA database. Univariate analysis revealed that high OXSM expression was significantly and positively correlated with PRS type, histology, grade, radiotherapy, chemotherapy, and age, while it was negatively correlated with IDH mutation and 1p19q co-deletion (Fig. 9 9 1 9 9 9 9  Fig. 9 Correlation Between OXSM Expression and Various Clinical Variables. A B p C p D p E p F p G H Drug sensitivity analysis The primary treatment for gliomas involves surgery combined with radiotherapy and chemotherapy; however, pharmacotherapy remains largely ineffective. To investigate the resistance relationship between OXSM expression and drugs, we conducted a drug sensitivity analysis and discovered that high OXSM expression shows increased sensitivity to drugs such as β-catenin, ATP, 5-Fluorouracil, and ATPase (Fig. 10 19 10 10  Fig. 10 A G H I  Table 1 Multivariate analysis of the correlation between OXSM expression and clinical features ID HR HR.95 L HR.95 H pvalue OXSM 1.36 1.16 1.58 0.0001 PRS_type 2.00 1.70 2.35 6.27e-17 Histology 0.67 0.43 1.05 0.08 Grade 2.71 1.98 3.71 3.72 e-10 Gender 1.08 0.89 1.31 0.41 Age 1.21 0.99 1.48 0.053 Radio 0.81 0.62 1.07 0.14 Chemo 0.67 0.53 0.86 0.0015 IDH_mutation 0.56 0.44 0.70 1.27 e-06 1p19q_codeletion 0.38 0.27 0.53 1.62 e-08 Immunohistochemistry and PCR validation of OXSM expression in glioma To validate the expression of the hub gene OXSM in glioma, immunohistochemical analysis of glioma tissue microarrays revealed that OXSM expression was significantly higher in WHO grade IV tumors (Fig. 11 11  Fig. 11 Expression of OXSM in gliomas. A B C Discussion Glioma represents the most common primary malignant neoplasm worldwide, with glioblastoma being the most prevalent and aggressive brain tumor [ 20 21 22 23 Disulfidptosis has emerged as a novel form of programmed cell death that has garnered significant attention in recent years. This cell death mechanism, initially discovered by Liu et al. [ 13 24 25 26 Li et al. further revealed in cervical cancer research that disulfidptosis-related long non-coding RNAs (lncRNAs) can serve as independent prognostic markers, providing new evidence for developing personalized treatment strategies [ 27 28 29 Through systematic analysis of the expression profiles and prognostic value of DRGs in glioma, this study identified several differentially expressed key genes. Among them, OXSM, SLC3A2, RPN1, and GYS1 showed significant upregulation in glioma tissues ( p p 17 The functional enrichment analysis highlighted OXSM’s involvement in critical pathways, including Neuroactive ligand-receptor interaction, Systemic lupus erythematosus-related pathways and Glutamatergic synapse, these pathways suggest that OXSM may modulate the immune microenvironment through complex molecular interactions. This finding aligns with Wang et al.‘s research, which demonstrated that metabolic reprogramming in glioma is closely linked to immune escape [ 30 31 32 33 34 Heatmap and Nomogram model analyses revealed that OXSM expression correlates with multiple clinical characteristics and can be used to predict survival probability in glioma patients, facilitating personalized prognostic assessment and treatment decision-making. At the single-cell level, we observed significant heterogeneity in OXSM expression across different cell types. This cellular heterogeneity may explain the differential therapeutic responses in glioma. Similarly, single-cell sequencing studies by Yeo et al. demonstrated that glioma cell heterogeneity is closely associated with patient prognosis and treatment response [ 35 OXSM has shown great potential in clinical Implications and diagnosis, OXSM demonstrated exceptional diagnostic accuracy with AUC values exceeding 0.88 in TCGA and GSE50161 Several limitations exist in this study. First, additional clinical samples are needed to validate the expression patterns of OXSM. Second, the precise molecular mechanisms by which OXSM regulates glioma progression require further investigation. Although molecular docking shows a good affinity between drugs and OXSM, there are certain limitations that need to be further validated in vitro and clinical trials. We acknowledge that our current study is primarily in silico, with limited in vitro validation. The experimental validations mentioned, including further exploration of OXSM’s interaction with immune checkpoint inhibitors and the development of OXSM-targeted therapeutic agents, represent future research directions rather than completed aspects of this work. Future studies should focus on expanding these preliminary findings through comprehensive in vitro and in vivo experiments to fully elucidate OXSM’s role in glioma progression and its potential as a therapeutic target. Moreover, the therapeutic potential of combining OXSM with immune checkpoint inhibitors warrants further exploration. In conclusion, this study provides the first systematic characterization of the ferroptosis-related gene OXSM in glioma, including its expression patterns and prognostic implications. OXSM may influence glioma progression by modulating the tumor immune microenvironment, offering a novel therapeutic target for personalized glioma treatment. Future studies should focus on exploring the potential applications of OXSM in glioma immunotherapy and developing OXSM-targeted therapeutic agents. Conclusion OXSM emerges as a pivotal molecular player in glioma progression. Its multifaceted role in modulating the tumor immune microenvironment offers unprecedented insights into potential personalized treatment strategies. Future research should focus on developing OXSM-targeted therapeutic agents, exploring combinations with immunotherapies and investigating its potential in overcoming treatment resistance. The study provides the first systematic characterization of OXSM in glioma, offering a novel perspective for personalized treatment approaches and potentially transforming our understanding of glioma management. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Jinchao Zhu, Yao Ke and Yijuan Fan have contributed equally to this work. Acknowledgements Thank you for the academic support provided by the HIPLOT PRO ( https://hiplot.com.cn/cloud-tool/drawing-tool/list Author contributions Shengdong Nie and Wenhuan Guo designed this study and directed the research group in all aspects, including planning, execution, and analysis of the study. Jinchao Zhu drafted the manuscript. Yao Ke, Qingyuan Lin and Yijuan Fan collected the data. Jinchao Zhu and Weiyao Zhu provided the statistical software, performed the data analysis. All authors read and approved the final manuscript. Funding This study has received funding by the National Natural Science Foundation of China (Grant No. 81830052), the Natural Science Foundation of Shanghai (Grant No. 20ZR1438300), Shanghai Key Laboratory of Molecular Imaging (Grant No. 18DZ2260400), Key Specialties in Baoshan District of Shanghai, China (BSZK-2023-BZ10). Data availability The datasets generated and/or analyzed during the current study are available in the TCGA repository ([https://portal.gdc.cancer.gov/] (https:/portal.gdc.cancer.gov)) and GEO repository ([https://www.ncbi.nlm.nih.gov/geo/] (https:/www.ncbi.nlm.nih.gov/geo)). Declarations Ethics approval and consent to participate The study involving glioma patients was reviewed and approved by the Ethics Committee of Renhe Hospital in Baoshan District, Shanghai (KY2023-04). The informed consent requirement was waived by the Ethics Committee of Renhe Hospital. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Lin Q Zhu J Zhu W Prognostic value and drug sensitivity of F–box and leucine–rich repeat protein 6 in glioma Oncol Lett 2024 28 1 320 10.3892/ol.2024.14453 38807668 PMC11130608 Lin Q, Zhu J, Zhu W, et al. Prognostic value and drug sensitivity of F–box and leucine–rich repeat protein 6 in glioma. Oncol Lett. 2024;28(1):320. 10.3892/ol.2024.14453. 38807668 10.3892/ol.2024.14453 PMC11130608 2. Louis DN Ohgaki H Wiestler OD The 2007 WHO classification of tumours of the central nervous system Acta Neuropathol 2007 114 2 97 109 10.1007/s00401-007-0243-4 17618441 PMC1929165 Louis DN, Ohgaki H, Wiestler OD, et al. The 2007 WHO classification of tumours of the central nervous system. Acta Neuropathol. 2007;114(2):97–109. 10.1007/s00401-007-0243-4. 17618441 10.1007/s00401-007-0243-4 PMC1929165 3. Ostrom QT Patil N Cioffi G CBTRUS statistical report: primary brain and other central nervous system tumors diagnosed in the united States in 2013–2017 Neuro Oncol 2020 22 12 Suppl 2 iv1 96 10.1093/neuonc/noaa200 33123732 PMC7596247 Ostrom QT, Patil N, Cioffi G, et al. CBTRUS statistical report: primary brain and other central nervous system tumors diagnosed in the united States in 2013–2017. Neuro Oncol. 2020;22(12 Suppl 2):iv1–96. 10.1093/neuonc/noaa200. 33123732 10.1093/neuonc/noaa200 PMC7596247 4. Ostrom QT Cioffi G Waite K CBTRUS statistical report: primary brain and other central nervous system tumors diagnosed in the united States in 2014–2018 Neuro Oncol 2021 23 12 Suppl 2 iii1 105 10.1093/neuonc/noab200 34608945 PMC8491279 Ostrom QT, Cioffi G, Waite K, et al. CBTRUS statistical report: primary brain and other central nervous system tumors diagnosed in the united States in 2014–2018. Neuro Oncol. 2021;23(12 Suppl 2):iii1–105. 10.1093/neuonc/noab200. 34608945 10.1093/neuonc/noab200 PMC8491279 5. Ostrom QT Price M Neff C CBTRUS statistical report: primary brain and other central nervous system tumors diagnosed in the united States in 2015–2019 Neuro Oncol 2022 24 Suppl 5 v1 95 10.1093/neuonc/noac202 36196752 PMC9533228 Ostrom QT, Price M, Neff C, et al. CBTRUS statistical report: primary brain and other central nervous system tumors diagnosed in the united States in 2015–2019. Neuro Oncol. 2022;24(Suppl 5):v1–95. 10.1093/neuonc/noac202. 36196752 10.1093/neuonc/noac202 PMC9533228 6. Hegi ME Diserens AC Gorlia T MGMT gene Silencing and benefit from Temozolomide in glioblastoma N Engl J Med 2005 352 10 997 1003 10.1056/NEJMoa043331 15758010 Hegi ME, Diserens AC, Gorlia T, et al. MGMT gene Silencing and benefit from Temozolomide in glioblastoma. N Engl J Med. 2005;352(10):997–1003. 10.1056/NEJMoa043331. 15758010 10.1056/NEJMoa043331 7. Wick W Hartmann C Engel C NOA-04 randomized phase III trial of sequential radiochemotherapy of anaplastic glioma with procarbazine, lomustine, and vincristine or Temozolomide J Clin Oncol 2009 27 35 5874 80 10.1200/jco.2009.23.6497 19901110 Wick W, Hartmann C, Engel C, et al. NOA-04 randomized phase III trial of sequential radiochemotherapy of anaplastic glioma with procarbazine, lomustine, and vincristine or Temozolomide. J Clin Oncol. 2009;27(35):5874–80. 10.1200/jco.2009.23.6497. 19901110 10.1200/JCO.2009.23.6497 8. Molinaro AM Hervey-Jumper S Morshed RA Association of maximal extent of resection of Contrast-Enhanced and Non-Contrast-Enhanced tumor with survival within molecular subgroups of patients with newly diagnosed glioblastoma JAMA Oncol 2020 6 4 495 503 10.1001/jamaoncol.2019.6143 32027343 PMC7042822 Molinaro AM, Hervey-Jumper S, Morshed RA, et al. Association of maximal extent of resection of Contrast-Enhanced and Non-Contrast-Enhanced tumor with survival within molecular subgroups of patients with newly diagnosed glioblastoma. JAMA Oncol. 2020;6(4):495–503. 10.1001/jamaoncol.2019.6143. 32027343 10.1001/jamaoncol.2019.6143 PMC7042822 9. Cairncross JG Ueki K Zlatescu MC Specific genetic predictors of chemotherapeutic response and survival in patients with anaplastic oligodendrogliomas J Natl Cancer Inst 1998 90 19 1473 9 10.1093/jnci/90.19.1473 9776413 Cairncross JG, Ueki K, Zlatescu MC, et al. Specific genetic predictors of chemotherapeutic response and survival in patients with anaplastic oligodendrogliomas. J Natl Cancer Inst. 1998;90(19):1473–9. 10.1093/jnci/90.19.1473. 9776413 10.1093/jnci/90.19.1473 10. Weller M van den Bent M Preusser M EANO guidelines on the diagnosis and treatment of diffuse gliomas of adulthood Nat Rev Clin Oncol 2021 18 3 170 86 10.1038/s41571-020-00447-z 33293629 PMC7904519 Weller M, van den Bent M, Preusser M, et al. EANO guidelines on the diagnosis and treatment of diffuse gliomas of adulthood. Nat Rev Clin Oncol. 2021;18(3):170–86. 10.1038/s41571-020-00447-z. 33293629 10.1038/s41571-020-00447-z PMC7904519 11. Redman JM Gibney gt,atkins MB advances in immunotherapy for melanoma BMC Med 2016 14 20 10.1186/s12916-016-0571-0 26850630 PMC4744430 Redman JM. Gibney gt,atkins MB advances in immunotherapy for melanoma. BMC Med. 2016;14:20. 10.1186/s12916-016-0571-0. 26850630 10.1186/s12916-016-0571-0 PMC4744430 12. Reck M Remon J Hellmann MD First-Line immunotherapy for Non-Small-Cell lung cancer J Clin Oncol 2022 40 6 586 97 10.1200/jco.21.01497 34985920 Reck M, Remon J. Hellmann MD First-Line immunotherapy for Non-Small-Cell lung cancer. J Clin Oncol. 2022;40(6):586–97. 10.1200/jco.21.01497. 34985920 10.1200/JCO.21.01497 13. Liu X Nie L Zhang Y Actin cytoskeleton vulnerability to disulfide stress mediates Disulfidptosis Nat Cell Biol 2023 25 3 404 14 10.1038/s41556-023-01091-2 36747082 PMC10027392 Liu X, Nie L, Zhang Y, et al. Actin cytoskeleton vulnerability to disulfide stress mediates Disulfidptosis. Nat Cell Biol. 2023;25(3):404–14. 10.1038/s41556-023-01091-2. 36747082 10.1038/s41556-023-01091-2 PMC10027392 14. Qi C Ma J Sun J The role of molecular subtypes and immune infiltration characteristics based on disulfidptosis-associated genes in lung adenocarcinoma Aging 2023 15 11 5075 95 10.18632/aging.204782 37315289 PMC10292876 Qi C, Ma J, Sun J, et al. The role of molecular subtypes and immune infiltration characteristics based on disulfidptosis-associated genes in lung adenocarcinoma. Aging. 2023;15(11):5075–95. 10.18632/aging.204782. 37315289 10.18632/aging.204782 PMC10292876 15. Hu G Yao H Wei Z A bioinformatics approach to identify a disulfidptosis-related gene signature for prognostic implication in colon adenocarcinoma Sci Rep 2023 13 1 12403 10.1038/s41598-023-39563-y 37524774 PMC10390519 Hu G, Yao H, Wei Z, et al. A bioinformatics approach to identify a disulfidptosis-related gene signature for prognostic implication in colon adenocarcinoma. Sci Rep. 2023;13(1):12403. 10.1038/s41598-023-39563-y. 37524774 10.1038/s41598-023-39563-y PMC10390519 16. Wang Z Du X Lian W A novel disulfidptosis-associated expression pattern in breast cancer based on machine learning Front Genet 2023 14 1193944doi 10.3389/fgene.2023.1193944 37456667 PMC10343428 Wang Z, Du X, Lian W, et al. A novel disulfidptosis-associated expression pattern in breast cancer based on machine learning. Front Genet. 2023;14:1193944doi. 10.3389/fgene.2023.1193944. 37456667 10.3389/fgene.2023.1193944 PMC10343428 17. Wang WY Lu WCR Expression of hsa-miR-338-3p contributes to the development of glioma cells by targeting mitochondrial 3-Oxoacyl-ACP synthase (OXSM) in glioblastoma (GBM) Onco Targets Ther 2020 13 9513 23 10.2147/ott.S262873 33061435 PMC7522303 Wang WY, Lu WCR. Expression of hsa-miR-338-3p contributes to the development of glioma cells by targeting mitochondrial 3-Oxoacyl-ACP synthase (OXSM) in glioblastoma (GBM). Onco Targets Ther. 2020;13:9513–23. 10.2147/ott.S262873. 33061435 10.2147/OTT.S262873 PMC7522303 18. Wang K Yu J Xu Q Disulfidptosis-related long non-coding RNA signature predicts the prognosis, tumor microenvironment, immunotherapy, and antitumor drug options in colon adenocarcinoma Apoptosis 2024 29 11–12 2074 90 10.1007/s10495-024-02011-x 39115621 PMC11550253 Wang K, Yu J, Xu Q, et al. Disulfidptosis-related long non-coding RNA signature predicts the prognosis, tumor microenvironment, immunotherapy, and antitumor drug options in colon adenocarcinoma. Apoptosis. 2024;29(11–12):2074–90. 10.1007/s10495-024-02011-x. 39115621 10.1007/s10495-024-02011-x PMC11550253 19. Jiang J Briedé JJ,Jennen DG Increased mitochondrial ROS formation by acetaminophen in human hepatic cells is associated with gene expression changes suggesting disruption of the mitochondrial electron transport chain Toxicol Lett 2015 234 2 139 50 10.1016/j.toxlet.2015.02.012 25704631 Jiang J, Briedé JJ,Jennen DG, et al. Increased mitochondrial ROS formation by acetaminophen in human hepatic cells is associated with gene expression changes suggesting disruption of the mitochondrial electron transport chain. Toxicol Lett. 2015;234(2):139–50. 10.1016/j.toxlet.2015.02.012. 25704631 10.1016/j.toxlet.2015.02.012 20. Yasinjan F Xing Y Geng H Immunotherapy: a promising approach for glioma treatment Front Immunol 2023 14 1255611doi 10.3389/fimmu.2023.1255611 37744349 PMC10512462 Yasinjan F, Xing Y, Geng H, et al. Immunotherapy: a promising approach for glioma treatment. Front Immunol. 2023;14:1255611doi. 10.3389/fimmu.2023.1255611. 37744349 10.3389/fimmu.2023.1255611 PMC10512462 21. Chen R Smith-Cohn M Cohen AL Glioma subclassifications and their clinical significance Neurotherapeutics 2017 14 2 284 97 10.1007/s13311-017-0519-x 28281173 PMC5398991 Chen R, Smith-Cohn M, Cohen AL, et al. Glioma subclassifications and their clinical significance. Neurotherapeutics. 2017;14(2):284–97. 10.1007/s13311-017-0519-x. 28281173 10.1007/s13311-017-0519-x PMC5398991 22. Wang X Sun Q Liu T Single-cell multi-omics sequencing uncovers region-specific plasticity of glioblastoma for complementary therapeutic targeting Sci Adv 2024 10 47 eadn4306 10.1126/sciadv.adn4306 39576855 PMC11584018 Wang X, Sun Q, Liu T, et al. Single-cell multi-omics sequencing uncovers region-specific plasticity of glioblastoma for complementary therapeutic targeting. Sci Adv. 2024;10(47):eadn4306. 10.1126/sciadv.adn4306. 39576855 10.1126/sciadv.adn4306 PMC11584018 23. Liu J Cao S Imbach KJ Multi-scale signaling and tumor evolution in high-grade gliomas Cancer Cell 2024 42 7 1217 e123819 10.1016/j.ccell.2024.06.004 38981438 PMC11337243 Liu J, Cao S, Imbach KJ, et al. Multi-scale signaling and tumor evolution in high-grade gliomas. Cancer Cell. 2024;42(7):1217–e123819. 10.1016/j.ccell.2024.06.004. 38981438 10.1016/j.ccell.2024.06.004 PMC11337243 24. Zhao S Wang L Ding W Crosstalk of disulfidptosis-related subtypes, establishment of a prognostic signature and immune infiltration characteristics in bladder cancer based on a machine learning survival framework Front Endocrinol (Lausanne) 2023 14 1180404doi 10.3389/fendo.2023.1180404 37152941 PMC10154596 Zhao S, Wang L, Ding W, et al. Crosstalk of disulfidptosis-related subtypes, establishment of a prognostic signature and immune infiltration characteristics in bladder cancer based on a machine learning survival framework. Front Endocrinol (Lausanne). 2023;14:1180404doi. 10.3389/fendo.2023.1180404. 37152941 10.3389/fendo.2023.1180404 PMC10154596 25. Chen H Yang W Li Y Leveraging a disulfidptosis-based signature to improve the survival and drug sensitivity of bladder cancer patients Front Immunol 2023 14 1198878 10.3389/fimmu.2023.1198878 37325625 PMC10266281 Chen H, Yang W, Li Y, et al. Leveraging a disulfidptosis-based signature to improve the survival and drug sensitivity of bladder cancer patients. Front Immunol. 2023;14:1198878. 10.3389/fimmu.2023.1198878. 37325625 10.3389/fimmu.2023.1198878 PMC10266281 26. Wang T Guo K Zhang D Disulfidptosis classification of hepatocellular carcinoma reveals correlation with clinical prognosis and immune profile Int Immunopharmacol 2023 120 110368doi 10.1016/j.intimp.2023.110368 37247499 Wang T, Guo K, Zhang D, et al. Disulfidptosis classification of hepatocellular carcinoma reveals correlation with clinical prognosis and immune profile. Int Immunopharmacol. 2023;120:110368doi. 10.1016/j.intimp.2023.110368. 37247499 10.1016/j.intimp.2023.110368 27. Liu L Liu J Lyu Q Disulfidptosis-associated LncRNAs index predicts prognosis and chemotherapy drugs sensitivity in cervical cancer Sci Rep 2023 13 1 12470 10.1038/s41598-023-39669-3 37528124 PMC10394072 Liu L, Liu J, Lyu Q, et al. Disulfidptosis-associated LncRNAs index predicts prognosis and chemotherapy drugs sensitivity in cervical cancer. Sci Rep. 2023;13(1):12470. 10.1038/s41598-023-39669-3. 37528124 10.1038/s41598-023-39669-3 PMC10394072 28. Wang X Yang J Yang F The disulfidptosis-related signature predicts prognosis and immune features in glioma patients Sci Rep 2023 13 1 17988 10.1038/s41598-023-45295-w 37864127 PMC10589205 Wang X, Yang J, Yang F, et al. The disulfidptosis-related signature predicts prognosis and immune features in glioma patients. Sci Rep. 2023;13(1):17988. 10.1038/s41598-023-45295-w. 37864127 10.1038/s41598-023-45295-w PMC10589205 29. Li P Wang S Wan H Construction of disulfidptosis-based immune response prediction model with artificial intelligence and validation of the pivotal grouping oncogene c-MET in regulating T cell exhaustion Front Immunol 2024 15 1258475doi 10.3389/fimmu.2024.1258475 38352883 PMC10862485 Li P, Wang S, Wan H, et al. Construction of disulfidptosis-based immune response prediction model with artificial intelligence and validation of the pivotal grouping oncogene c-MET in regulating T cell exhaustion. Front Immunol. 2024;15:1258475doi. 10.3389/fimmu.2024.1258475. 38352883 10.3389/fimmu.2024.1258475 PMC10862485 30. Wang S, Huang T, Wu Q, et al. Lactate reprograms glioblastoma immunity through CBX3-regulated histone lactylation. J Clin Invest. 2024;134(22). 10.1172/jci176851. 10.1172/JCI176851 PMC11563687 39545414 31. Friedman-DeLuca M Karagiannis GS Condeelis JS Macrophages in tumor cell migration and metastasis Front Immunol 2024 15 1494462doi 10.3389/fimmu.2024.1494462 39555068 PMC11563815 Friedman-DeLuca M, Karagiannis GS, Condeelis JS, et al. Macrophages in tumor cell migration and metastasis. Front Immunol. 2024;15:1494462doi. 10.3389/fimmu.2024.1494462. 39555068 10.3389/fimmu.2024.1494462 PMC11563815 32. Jazwinska DE Kulawiec dg,zervantonakis IK Cancer-mesothelial and cancer-macrophage interactions in the ovarian cancer microenvironment Am J Physiol Cell Physiol 2023 325 3 C721 30 10.1152/ajpcell.00461.2022 37545408 PMC10635648 Jazwinska DE. Kulawiec dg,zervantonakis IK Cancer-mesothelial and cancer-macrophage interactions in the ovarian cancer microenvironment. Am J Physiol Cell Physiol. 2023;325(3):C721–30. 10.1152/ajpcell.00461.2022. 37545408 10.1152/ajpcell.00461.2022 PMC10635648 33. Kricha A Bouchmaa N Ben Mkaddem S Glioblastoma-associated macrophages: A key target in overcoming glioblastoma therapeutic resistance Cytokine Growth Factor Rev 2024 80 97 108 10.1016/j.cytogfr.2024.10.009 39510901 Kricha A, Bouchmaa N, Ben Mkaddem S, et al. Glioblastoma-associated macrophages: A key target in overcoming glioblastoma therapeutic resistance. Cytokine Growth Factor Rev. 2024;80:97–108. 10.1016/j.cytogfr.2024.10.009. 39510901 10.1016/j.cytogfr.2024.10.009 34. Nixon BG Kuo F Ji L Tumor-associated macrophages expressing the transcription factor IRF8 promote T cell exhaustion in cancer Immunity 2022 55 11 2044 e20585 10.1016/j.immuni.2022.10.002 36288724 PMC9649891 Nixon BG, Kuo F, Ji L, et al. Tumor-associated macrophages expressing the transcription factor IRF8 promote T cell exhaustion in cancer. Immunity. 2022;55(11):2044–e20585. 10.1016/j.immuni.2022.10.002. 36288724 10.1016/j.immuni.2022.10.002 PMC9649891 35. Yeo AT Rawal S Delcuze B Single-cell RNA sequencing reveals evolution of immune landscape during glioblastoma progression Nat Immunol 2022 23 6 971 84 10.1038/s41590-022-01215-0 35624211 PMC9174057 Yeo AT, Rawal S, Delcuze B, et al. Single-cell RNA sequencing reveals evolution of immune landscape during glioblastoma progression. Nat Immunol. 2022;23(6):971–84. 10.1038/s41590-022-01215-0. 35624211 10.1038/s41590-022-01215-0 PMC9174057 ",
  "metadata": {
    "Title of this paper": "Single-cell RNA sequencing reveals evolution of immune landscape during glioblastoma progression",
    "Journal it was published in:": "Discover Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474845/"
  }
}