{
  "title": "Paper_183",
  "abstract": "pmc Am J Clin Nutr Am J Clin Nutr 673 ajcn The American Journal of Clinical Nutrition 0002-9165 1938-3207 American Society for Nutrition PMC12489343 PMC12489343.1 12489343 12489343 40449891 10.1016/j.ajcnut.2025.05.028 S0002-9165(25)00316-8 1 Original Research Article Duration and intensity of lactation and maternal risk of subsequent incident coronary artery disease and stroke—a prospective cohort study Christensen Sophie Hilario 1 2 Aarestrup Julie 1 Rasmussen Kathleen M 3 Baker Jennifer L 1 Pedersen Dorthe C 1 Bjerregaard Lise G lise.geisler.bjerregaard@regionh.dk 1 ⁎ 1 2 3 ⁎ lise.geisler.bjerregaard@regionh.dk 8 2025 29 5 2025 122 2 496109 433 440 6 12 2024 21 5 2025 27 5 2025 29 05 2025 03 10 2025 03 10 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). Background Although lactation may reduce maternal risk of breast cancer, other potential long-term health benefits of lactation for mothers are largely unknown. Objectives We examined whether the durations of predominant and any lactation were associated with maternal risks of coronary artery disease (CAD) and stroke. Methods In this prospective cohort study, we followed up 6857 mothers from the Copenhagen Perinatal Cohort who gave birth during 1959–1961 at median age 24 y (IQR, 20–30 y). Durations of predominant and any lactation were assessed at the infant’s 1-y examination. Diagnoses of CAD ( n n n n Results Durations of predominant and any lactation were inversely associated with risk of CAD, but not with stroke, when using lactation as a continuous variable. In categorical analyses, mothers who lactated for >4 months had 41% (HR: 0.59; 95% CI: 0.46, 0.75) and 34% (HR: 0.66; 95% CI: 0.48, 0.92) lower risk of CAD and stroke, respectively, at ages 45–70 y, compared with mothers who lactated ≤0.5 months. After adjustment for demographic, metabolic, and reproductive risk factors during pregnancy, these associations attenuated (HR: 0.78; 95% CI: 0.60, 1.01 for CAD; HR: 0.90; 95% CI: 0.64, 1.27 for stroke). No associations were observed with CAD or stroke diagnosed after age 70 y. Conclusions Limited evidence exists for an association between lactation and maternal risk of stroke. Longer durations of lactation are associated with lower risks of maternal CAD diagnosed before age 70 y. Adjustment for risk factors attenuate the associations, which suggests these factors may partly confound the benefits of lactation on maternal risks of CAD. Keywords cohort study epidemiology coronary artery disease lactation stroke pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Abbreviations CAD coronary artery disease CPC Copenhagen Perinatal Cohort CVD cardiovascular disease HR hazard ratio ICD International Classification of Diseases IS ischemic stroke PPBMI prepregnancy BMI Introduction Pregnancy is associated with several metabolic changes in the mother, including increased visceral fat, insulin resistance, and circulating lipid concentrations [ 1 1 1 2 2 [2] [3] [4] 5 5 The few studies available on the duration of lactation and incident coronary artery disease (CAD) found inverse associations [ [6] [7] [8] [9] [10] [11] [12] [13] 7 10 11 14 15 If lactation reduces maternal cardiovascular disease risk, interventions to promote and prolong lactation may be a viable way to support maternal health. Therefore, we used a Danish cohort with very short recall on lactation intensity and duration to examine whether different durations of predominant and any lactation were associated with maternal risk of incident CAD and stroke, respectively, while accounting for the influence of demographics, metabolic risk during pregnancy, pregnancy complications, and reproductive history. In addition, we performed a negative control outcome analysis in the fathers to assess the potential role of residual or unmeasured confounding. Methods Cohort The Copenhagen Perinatal Cohort (CPC) consists of 9125 which, is almost all individuals who were born at the National University Hospital from September 21, 1959, to December 21, 1961 [ [16] [17] [18] 16 17 Lactation The durations of predominant and any breastfeeding (in days, weeks, and/or months) were assessed at the infant’s 1-y examination by a physician who recorded when the mother partly discontinued feeding the infant breast milk (defining the duration of predominant lactation) and when breastfeeding ceased (defining duration of any lactation) [ 17 Covariates In this study, socioeconomic position of the home at the 1-y examination was scored based on primary income-earner of the household’s occupation, education, how the wage was earned, and the character of the living accommodation. We then divided socioeconomic position into low (0–6 points), middle (7–10 points), and high (11–20 points). In addition to socioeconomic position, we considered the primary income-earner’s education (special needs education, grade school, high school, college), marital status at birth (yes/no), maternal age at delivery (y), prepregnancy BMI (PPBMI, kg/m 2 17 Follow-up and case ascertainment Using the unique personal identification number assigned to all Danish residents since 1968, information on vital status, the number of live births, and identification of the father was obtained through linkage to the Danish Civil Registration System [ 19 20 Supplemental Table 1 Among the mothers of the 9125 children in the CPC, we excluded those with an invalid identification number ( Figure 1 FIGURE 1 Flow chart of the study population. CAD, coronary artery disease. FIGURE 1 According to Danish law, ethical approval is not required for purely questionnaire and register-based studies unless they involve human biological material. Thus, this study is exempt for ethical approval. Instead, it is covered by approval from the Danish Data Protection Agency (P-2019-832) that supervises data security and proper use of data in research where individuals are not contacted. Statistical analysis Key characteristics (percentages or median and IQR) are presented for the participants overall and by categories of duration of lactation. The median duration of follow-up was calculated using the reverse Kaplan–Meier method [ 21 Age was used as the underlying timescale. We treated the durations of predominant and any lactation as continuous variables (in months). Moreover, any lactation was divided into 5 groups (≤0.5, >0.5–1, >1–2, >2–4, and >4 mo) reflecting the duration of lactation in this population. The reference group was women who lactated ≤0.5 mo. Potential confounding factors were selected a priori based on established associations and/or plausible biological relationships. Directed acyclic graphs were used to identify which factors to adjust for based on the assumed associations ( Supplemental Figures 1 and 2 1 2 3 The proportion of missing data was <5% for most putative confounders but was 10% for PPBMI, 17% for socioeconomic position, and 19% for gestational age. Thus, multiple imputations of duration of lactation and the potential confounders were performed using chained equations with 40 imputations as implemented in Stata through the “mi” command based on all covariates, lactation, and the outcomes [ 22 Potential effect modification of the association between lactation and risk of CVD outcomes by socioeconomic position and the number of live births given after the index birth, respectively, was examined by introducing interaction terms in the Cox model and examining their significance using Wald tests. We found no indication of interactions with these 2 factors (all P To assess potential residual or unmeasured confounding that may create a spurious association between lactation and CVD risk in the mother, risk of CVD outcomes in the fathers was used as a negative control outcome [ 23 Supplemental Figure 3 In a sensitivity analysis, we assessed whether exposure to more reproductive cycles (for which we do not have information on lactation) than the one related to the index pregnancy influences the associations. We did this by investigating the association between lactation and risk of CVD outcomes in mothers with 1 child. In these women we had information on the lifetime history of lactation. All analyses were conducted in Stata version 17.0 [ 22 Results Approximately 24% of mothers lactated for ≤0.5 mo, 15% for >0.5–1 mo, 20% for >1–2 mo, 22% for >2–4 mo, and 21% for >4 mo. Mothers who lactated for ≤0.5 mo, compared with mothers who lactated longer, were more often from homes of lower socioeconomic position, more often having prepregnancy overweight or obesity, and more often had been diagnosed with diabetes during pregnancy ( Table 1 17 TABLE 1 Characteristics of the study population by duration of lactation 1 TABLE 1 Characteristic Data available (n) Total Duration of any lactation (mo) ≤0.5 >0.5–1 >1–2 >2–4 >4 N in group 6041 1363 885 1185 1352 1256 Socioeconomic position 2 5701 Low 1308 (22.9) 351 (29.5) 228 (27.9) 263 (24.3) 256 (20.4) 155 (13.0) Medium 2425 (42.5) 541 (45.5) 390 (47.7) 476 (44.0) 534 (42.6) 424 (35.6) High 1968 (34.5) 298 (25.0) 199 (24.4) 342 (31.6) 464 (37.0) 613 (51.4) Primary income-earner of the household’s education 5643 Special need education 70 (1.2) 21 (1.8) 14 (1.8) 11 (1.0) 9 (0.7) 6 (0.5) Grade school 3710 (65.7) 854 (74.6) 608 (76.1) 747 (69.5) 795 (64.6) 606 (52.2) High school 1238 (21.9) 214 (18.7) 136 (17.0) 216 (20.1) 301 (24.5) 309 (26.6) College 625 (11.1) 56 (4.9) 41 (5.1) 101 (9.4) 125 (10.2) 241 (20.7) Marital status: married 6776 4343 (64.1) 828 (61.8) 508 (58.0) 696 (59.5) 869 (65.2) 997 (79.8) Age at delivery (y), median (IQR) 6856 24 (20–30) 24 (20–31) 23 (19–28) 23 (19–29) 24 (20–30) 27 (22–32) PPBMI (kg/m 2 6155 21.4 (19.8–23.1) 21.5 (19.9–23.6) 21.4 (19.7–23.1) 21.2 (19.7–22.9) 21.2 (19.8–22.9) 21.4 (19.8–23.0) PPBMI (kg/m 2 6155 <18.5 538 (8.7) 122 (10.2) 78 (9.9) 106 (9.7) 106 (8.7) 66 (5.7) ≥18.5 and <25 4943 (80.3) 890 (74.3) 633 (80.4) 887 (81.5) 989 (80.8) 975 (84.4) ≥25 and <30 583 (9.5) 153 (12.8) 64 (8.1) 87 (8.0) 115(9.4) 102 (8.8) ≥30 91 (1.5) 33 (2.8) 12 (1.5) 9 (0.8) 14 (1.1) 12 (1.0) Smoking during the third trimester (cigarettes/d) 6759 None 3337 (49.4) 607 (45.3) 388 (44.3) 542 (46.2) 643 (48.2) 784 (63.4) <3 daily 486 (7.2) 87 (6.5) 65 (7.4) 90 (7.7) 95 (7.1) 86 (7.0) 3–10 daily 2005 (29.7) 406 (30.3) 271 (30.9) 356 (30.4) 434 (32.5) 288 (23.3) >10 daily 931 (13.8) 239 (17.8) 152 (17.4) 184 (15.7) 163 (12.2) 79 (6.4) Gestational weight gain (kg) 4085 <6 288 (7.1) 70 (9.1) 37 (7.0) 44 (6.0) 51 (6.1) 47 (6.2) 6–8 662 (16.2) 152 (19.8) 90 (17.1) 110 (14.9) 134 (16.1) 95 (12.5) 9–10 728 (17.8) 140 (18.2) 97 (18.4) 144 (19.5) 155 (18.6) 122 (16.1) 11–12 741 (18.1) 115 (15.0) 84 (15.9) 125 (16.9) 156 (18.8) 166 (21.8) 13–15 866 (21.29 134 (17.4) 103 (19.5) 167 (22.6) 170 (20.4) 188 (24.7) ≥16 800 (19.6) 157 (20.4) 116 (22.0) 149 (20.2) 166 (20.0) 142 (18.7) Maternal diabetes during pregnancy: yes 6856 61 (0.99) 24 (1.8) 6 (0.7) 5 (0.4) — 3 — 3 Pre-eclampsia: yes 6823 277 (4.1) 61 (4.5) 36 (4.1) 40 (3.4) 54 (4.0) 61 (4.9) Gestational hypertension: yes 6780 1258 (18.6) 235 (17.6) 149 (17.1) 216 (18.4) 257 (19.1) 268 (21.5) Parity, median (IQR) 6857 1.0 (1.0–2.0) 1 (1–2) 1 (1–2) 1 (1–2) 1 (1–2) 1 (1–2) Gestational age 5563 <36 wk 388 (7.0) 138 (12.7) 37 (5.3) 60 (6.3) 68 (6.2) 44 (4.2) 36–37 wk 594 (10.7) 149 (13.7) 70 (10.0) 80 (8.4) 118 (10.8) 104 (9.9) >37 wk 4581 (82.39 803 (73.7) 595 (84.8) 815 (85.3) 908 (83.0) 905 (85.9) Birth weight (kg), median (IQR) 6733 3.25 (2.9–3.6) 3.15 (2.65. 3.55) 3.25 (2.95. 3.6) 3.25 (2.95. 3.6) 3.3 (2.95. 3.6) 3.35 (3. 3.7) Sex of the child: boys 6857 3477 (50.7) 716 (52.5) 438 (49.5) 608 (51.3) 687 (50.8) 628 (50.0) Duration of predominant lactation (mo) 5980 1.4 (0.5–3.0) 0.2 (0.2–0.2) 0.8 (0.7–1.0) 1.5 (1.0–2.0) 3.0 (2.0–3.0) 4.5 (3.0–6.0) Abbreviation: PPBMI, prepregnancy BMI. 1 The table provides the number of participants with information available and n 2 Points for socioeconomic position were given according to occupation of the primary income-earner of the household, the way in which the primary income-earner earn his/her wages, the training of the primary income-earner and the character of the living accommodation (0–5 point per indicator) [ 17 3 These numbers cannot be shown according to data protection rules set by the national statistics service (Denmark Statistics) due to low numbers in one of the categories. In the unadjusted analyses, the durations of predominant and any lactation were associated with a 7% reduced risk of CAD diagnosed between ages 45 and 70 y (HR: 0.93; 95% CI: 0.89, 0.98; HR: 0.93; 95% CI: 0.90, 0.96, per each additional month of predominant and any lactation). The associations attenuated after adjustment for social, metabolic, and reproductive factors, but the association between the duration of any lactation and CAD was significant even in the fully adjusted analysis (HR: 0.97; 95% CI: 0.93, 1.00 per each additional month of lactation; P Table 2 TABLE 2 Associations between duration of predominant and any lactation and risk of CAD and stroke at ages 45–70 y in 6857 mothers and at ages >70 years in 4495 mothers 1 TABLE 2 Age at risk (y) Exposure CAD, HR (95% CI), n Stroke, HR (95% CI), n IS, HR (95% CI), n Unadjusted Fully adjusted 2 Unadjusted Fully adjusted 2 Unadjusted Fully adjusted 2 45–70 Predominant lactation Per mo 0.93 (0.89, 0.98) 0.97 (0.93, 1.02) 0.98 (0.92, 1.04) 1.02 (0.96, 1.08) 1.00 (0.95, 1.06) 1.05 (0.99, 1.12) Any lactation Per mo 0.93 (0.90, 0.96) 0.97 (0.93, 1.00) 3 0.97 (0.94, 1.01) 1.01 (0.97, 1.05) 0.99 (0.95, 1.03) 1.03 (0.99, 1.07) >70 Predominant lactation Per mo 1.00 (0.97, 1.03) 1.00 (0.95, 1.05) 1.01 (0.96, 1.06) 1.02 (0.97, 1.07) 1.00 (0.96, 1.06) 1.01 (0.96, 1.06) Any lactation Per mo 0.98 (0.94, 1.03) 1.01 (0.98, 1.04) 0.98 (0.95, 1.01) 0.99 (0.96, 1.02) 0.98 (0.95, 1.01) 0.98 (0.95, 1.02) Abbreviations: CAD, coronary artery disease; HR, hazard ratio; IS, ischemic stroke. 1 HRs and 95% CIs were estimated by Cox proportional hazards regression analyses. 2 The estimates were adjusted for socioeconomic positions (low, medium, and high), maternal age (years), prepregnancy BMI (kg/m 2 3 P When dividing the duration of any lactation into categories, mothers who lactated >2–4 mo had an unadjusted HR of 0.73 (95% CI: 0.58, 0.92), and mothers who lactated >4 mo had an HR of 0.59 (95% CI: 0.46, 0.75) for risk of CAD diagnosed at ages 45–70 ys compared with mothers who lactated ≤0.5 mo ( Figure 2 Supplemental Table 2 Figure 2 Supplemental Table 2 FIGURE 2 Associations between the duration of any lactation and risk of coronary artery disease (A) and stroke (B) at ages 45–70 y in mothers. The shown hazard ratios and 95% CIs were estimated by Cox proportional hazards regression analyses. The estimates are adjusted for socioeconomic position, maternal age, prepregnancy BMI (PPBMI), maternal smoking and diabetes during pregnancy, pre-eclampsia, gestational hypertension, parity, gestational age, and birth weight. The error bars represent the 95% CIs. FIGURE 2 We found no associations between predominant or any lactation and any of the outcomes diagnosed >70 y of age. The estimates for CAD were close to 1 in all analyses ( Table 2 Supplemental Figure 4 Supplemental Table 3 Using CVD outcomes in the fathers as negative controls, the duration of lactation was not associated with any of the outcomes ( Supplemental Table 4 Supplemental Table 5 Supplemental Table 5 Discussion In this cohort, we found an inverse association between the duration of any lactation and maternal risk of CAD at ages 45–70 y. The associations attenuated after adjustment for well-known risk factors, including social background and pregnancy-related factors. This indicates that these factors partly explain the associations. Moreover, the benefit of lactation was no longer evident after the age of 70 y. We found limited evidence of an association between lactation and maternal risk of stroke. The duration of lactation was not associated with paternal CVD outcomes in the negative control analysis, suggesting that there is limited unmeasured or residual confounding of the observed inverse association between lactation and CAD risk in the mother. When analyzing the duration of lactation continuously, we found that each additional month of any lactation was associated with a 3% lower risk of CAD at ages 45–70 y. In comparison, a meta-analysis from 2022 based on 6 large studies reported a slightly weaker association [ 24 24 24 24 It may be speculated that the duration of predominant lactation would have a stronger association with CVD outcomes than the duration of any lactation. This is because any lactation combines all intensities of lactation, whereas predominant lactation has a systematically higher intensity than this. However, the associations were of similar strength for predominant and any lactation. Thus, it may be speculated that the associations of lactation behavior with disease risk are independent of lactation intensity. Importantly, the durations of any and predominant lactation were relatively similar in our study. Most other studies did not have information on the intensity of lactation. Only 1 other Danish study had this information available. However, a direct comparison is challenging as the intensity of lactation was only examined in combination with the duration of partial lactation (the duration of any lactation minus the duration of full lactation) and not compared with no lactation [ 11 A strength of our study is the long follow-up period, which allowed us to investigate the associations between the duration of lactation and CAD and stroke in both middle and older ages. We found no associations with CVD diagnosed after the age of 70 y, indicating that the protective association of lactation with CVD wanes over time. This finding may be explained by the longer time period from lactation to the outcome during which other CVD risk factors become more prevalent and more important. These findings are in accord with those from other studies [ 3 6 25 3 25 6 24 Several previous studies were conducted in settings where women of higher socioeconomic position lactated for longer durations [ 3 9 15 25 3 9 6 8 10 15 25 Possible pathophysiologic mechanisms for our findings include hormonal responses related to reproduction and lactation. For instance, oxytocin, which is released during lactation, improves glucose tolerance and lowers blood pressure [ 26 2 3 27 28 27 Compared with other studies on the duration of lactation and maternal risk of CVD outcomes, one of the major strengths of our study is that the data on the duration of lactation were collected shortly after cessation, limiting the potential for misclassification associated with recall of duration of lactation. Except for 1 study [ 11 29 24 Another strength of this study is the nearly complete follow-up through national registers. Attrition in our study resulted mainly from infant mortality and missing identification numbers. Mothers with a complicated birth may be overrepresented in the CPC. Thus, some selection into the cohort may have occurred. Pregnancy complications are associated with increased risks of CVD outcomes [ 30 31 Unlike most other studies that used self-reported information on the outcome, we used objectively assessed information on CAD and stroke. The coverage of the Danish National Patient Register is high, with virtually every event recorded [ 20 32 Our study also has limitations. Although lactation was encouraged during the study period [ 33 34 35 36 37 In conclusion, we found that longer lactation following 1 singleton pregnancy was associated with a lower risk of maternal CAD. This association was no longer evident after 70 y of age. We found limited evidence of an association between lactation and maternal risk of stroke. The adjustment for demographics, metabolic risk during pregnancy, and reproductive history weakened the associations, suggesting that these factors may partly explain the CVD benefits of lactation on maternal risk of CAD and stroke. Nonetheless, our findings indicate that longer durations of lactation are associated with reduced risks of later CAD. Author contributions The authors’ responsibilities were as follows – LGB, SHC: designed the research; JLB, LGB: provided the databases; LGB: conducted the analyses; DCP, JA, JLB, KMR: contributed to the specification of the analyses; LGB, SHC: wrote the manuscript; LGB: had primary responsibility for the final content; and all authors: critically read and edited the manuscript and approved the final manuscript. Data availability The data used in this study are based on a combination of data with personal identification numbers from the Copenhagen Perinatal Cohort, hosted by the Center for Clinical Research and Prevention, and data from national health registers. According to Danish law, this information cannot be made publicly available. Access to the subset of data included in this study requires the submission of a project application to the corresponding author, Lise G. Bjerregaard, and approval by the data steering committee. Funding This work was supported by grants awarded to LGB from the Danish Heart Foundation Novo Nordisk Foundation Conflict of interest KMR is a member of the Editorial Board of the American Journal of Clinical Nutrition References 1 Facca T.A. Mastroianni-Kirsztajn G. Sabino A.R.P. Passos M.T. Dos Santos L.F. Famá E.A.B. Pregnancy as an early stress test for cardiovascular and kidney disease diagnosis Pregnancy Hypertens 12 2018 169 173 29198741 10.1016/j.preghy.2017.11.008 2 Stuebe A.M. Rich-Edwards J.W. The reset hypothesis: lactation and maternal metabolism Am. J. Perinatol 26 2009 81 88 19031350 10.1055/s-0028-1103034 PMC3006166 3 Schwarz E.B. Ray R.M. Stuebe A.M. Allison M.A. Ness R.B. Freiberg M.S. Duration of lactation and risk factors for maternal cardiovascular disease Obstet. Gynecol. 113 2009 974 982 19384111 10.1097/01.AOG.0000346884.67796.ca PMC2714700 4 Aune D. Norat T. Romundstad P. Vatten L.J. Breastfeeding and the maternal risk of type 2 diabetes: a systematic review and dose-response meta-analysis of cohort studies Nutr. Metab. Cardiovasc. Dis. 24 2014 107 115 24439841 10.1016/j.numecd.2013.10.028 5 Victora C.G. Bahl R. Barros A.J. Franca G.V. Horton S. Krasevec J. Breastfeeding in the 21st century: epidemiology, mechanisms, and lifelong effect Lancet. 387 2016 475 490 26869575 10.1016/S0140-6736(15)01024-7 6 Stuebe A.M. Michels K.B. Willett W.C. Manson J.E. Rexrode K. Rich-Edwards J.W. Duration of lactation and incidence of myocardial infarction in middle to late adulthood Am. J. Obstet. Gynecol. 200 2009 138.e1 e8 10.1016/j.ajog.2008.10.001 PMC2684022 19110223 7 Gallagher L.G. Davis L.B. Ray R.M. Psaty B.M. Gao D.L. Checkoway H. Reproductive history and mortality from cardiovascular disease among women textile workers in Shanghai, China Int. J. Epidemiol. 40 2011 1510 1518 22158661 10.1093/ije/dyr134 PMC3235022 8 Peters S.A. van der Schouw Y.T. Wood A.M. Sweeting M.J. Moons K.G. Weiderpass E. Parity, breastfeeding and risk of coronary heart disease: a pan-European case-cohort study Eur. J. Prev. Cardiol. 23 2016 1755 1765 27378766 10.1177/2047487316658571 PMC6217919 9 Parikh N.I. Jeppson R.P. Berger J.S. Eaton C.B. Kroenke C.H. LeBlanc E.S. Reproductive risk factors and coronary heart disease in the Women’s Health Initiative observational study Circulation 133 2016 2149 2158 27143682 10.1161/CIRCULATIONAHA.115.017854 PMC4889516 10 Peters S.A.E. Yang L. Guo Y. Chen Y. Bian Z. Du J. Breastfeeding and the risk of maternal cardiovascular disease: a prospective study of 300 000 Chinese women J. Am. Heart Assoc. 6 2017 e006081 10.1161/JAHA.117.006081 PMC5669201 28637778 11 Kirkegaard H. Bliddal M. Stovring H. Rasmussen K.M. Gunderson E.P. Kober L. Breastfeeding and later maternal risk of hypertension and cardiovascular disease—the role of overall and abdominal obesity Prev. Med. 114 2018 140 148 29953898 10.1016/j.ypmed.2018.06.014 12 Otsuki S. Saito E. Sawada N. Abe S.K. Hidaka A. Yamaji T. Female reproductive factors and risk of all-cause and cause-specific mortality among women: the Japan Public Health Center-based Prospective Study (JPHC study) Ann. Epidemiol. 28 2018 597 604.e6 29960824 10.1016/j.annepidem.2018.06.001 13 Rajaei S. Rigdon J. Crowe S. Tremmel J. Tsai S. Assimes T.L. Breastfeeding duration and the risk of coronary artery disease J. Womens Health (Larchmt). 28 2019 30 36 30523760 10.1089/jwh.2018.6970 PMC6422010 14 Merritt M.A. Riboli E. Murphy N. Kadi M. Tjønneland A. Olsen A. Reproductive factors and risk of mortality in the European Prospective Investigation into Cancer and Nutrition; a cohort study BMC Med 13 2015 252 26515238 10.1186/s12916-015-0484-3 PMC4627614 15 Jacobson L.T. Hade E.M. Collins T.C. Margolis K.L. Waring M.E. Van Horn L.V. Breastfeeding history and risk of stroke among parous postmenopausal women in the Women’s Health Initiative J. Am. Heart Assoc. 7 2018 e008739 10.1161/JAHA.118.008739 PMC6201437 30371157 16 Willumsen A. Environmental factors in congenital malformations: a prospective study of 9006 human pregnancies 1970 F.A.D.L.’s Forlag Copenhagen 17 Zachau-Christiansen B. Ross E.M. Babies: human development during the first year 1975 John Wiley & Sons London 18 Bjerregaard L.G. Rasmussen K.M. Michaelsen K.F. Skytthe A. Mortensen E.L. Baker J.L. Effects of body size and change in body size from infancy through childhood on body mass index in adulthood Int. J. Obes (Lond). 38 2014 1305 1311 24942870 10.1038/ijo.2014.108 19 Pedersen C.B. The Danish Civil Registration System Scand. J. Public Health. 39 2011 22 25 21775345 10.1177/1403494810387965 20 Andersen T.F. Madsen M. Jørgensen J. Mellemkjær L. Olsen J.H. The Danish National Hospital Register. A valuable source of data for modern health sciences Dan. Med. Bull. 46 1999 263 268 10421985 21 Schemper M. Smith T.L. A note on quantifying follow-up in studies of failure time, Control Clin. Trials. 17 1996 343 346 10.1016/0197-2456(96)00075-x 8889347 22 StataCorp Stata statistical software: release 17 2021 StataCorp LLC College Station, TX 23 Lipsitch M. Tchetgen E. Cohen T. Negative controls: a tool for detecting confounding and bias in observational studies Epidemiology 21 2010 383 388 20335814 10.1097/EDE.0b013e3181d61eeb PMC3053408 24 Tschiderer L. Seekircher L. Kunutsor S.K. Peters S.A.E. O’Keeffe L.M. Willeit P. Breastfeeding is associated with a reduced maternal cardiovascular risk: systematic review and meta-analysis involving data from 8 studies and 1 192 700 parous women J. Am. Heart Assoc. 11 2022 e022746 10.1161/JAHA.121.022746 PMC9238515 35014854 25 Natland Fagerhaug T. Forsmo S. Jacobsen G.W. Midthjell K. Andersen L.F. Ivar Lund Nilsen T. A prospective population-based cohort study of lactation and cardiovascular disease mortality: the HUNT study BMC Public Health 13 2013 1070 24219620 10.1186/1471-2458-13-1070 PMC3840666 26 Reiss A.B. Glass D.S. Lam E. Glass A.D. De Leon J. Kasselman L.J. Oxytocin: potential to mitigate cardiovascular risk Peptides 117 2019 170089 10.1016/j.peptides.2019.05.001 31112739 27 Ahn S. Corwin E.J. The association between breastfeeding, the stress response, inflammation, and postpartum depression during the postpartum period: prospective cohort study Int. J. Nurs. Stud. 52 2015 1582 1590 26143358 10.1016/j.ijnurstu.2015.05.017 PMC4540671 28 Mizuhata K. Taniguchi H. Shimada M. Hikita N. Morokuma S. Effects of breastfeeding on stress measured by saliva cortisol level and perceived stress Asian Pac. Isl. Nurs. J. 5 2020 128 138 33324730 10.31372/20200503.1100 PMC7733634 29 Natland S.T. Andersen L.F. Nilsen T.I.L. Forsmo S. Jacobsen G.W. Maternal recall of breastfeeding duration twenty years after delivery BMC Med. Res. Methodol. 12 2012 179 23176436 10.1186/1471-2288-12-179 PMC3568415 30 Roberts J.M. Hubel C.A. Pregnancy: a screening test for later life cardiovascular disease Womens Health Issues 20 2010 304 307 20800765 10.1016/j.whi.2010.05.004 31 Peters S.A.E. Regitz-Zagrosek V. Pregnancy and risk of cardiovascular disease: is the relationship due to childbearing or childrearing? Eur. Heart J. 38 2017 1448 1450 32 Sundboll J. Adelborg K. Munch T. Froslev T. Sorensen H.T. Botker H.E. Positive predictive value of cardiovascular diagnoses in the Danish National Patient Registry: a validation study BMJ Open 6 2016 e012832 10.1136/bmjopen-2016-012832 PMC5129042 27864249 33 Bjerregaard L.G. Wust M. Johansen T.S.D. Sørensen T.I.A. Dahl C.M. Baker J.L. Cohort profile: the Copenhagen Infant Health Nurse Records (CIHNR) cohort Int. J. Epidemiol. 52 2023 e340 e346 37403322 10.1093/ije/dyad096 34 Danish Health Authority Lille Ny Vejledning for Vordende Mødre [Little new guideline for mothers to be] 1960 Danish Health Authority Copenhagen 35 Biering-Sørensen F. Hilden J. Biering-Sørensen K. Breast-feeding in Copenhagen, 1938-1977. Data on more than 365,000 infants, Dan. Med Bull 27 1980 42 48 7398379 36 Vestermark V. Hogdall C.K. Plenov G. Birch M. Toftager-Larsen K. The duration of breast-feeding. A longitudinal prospective study in Denmark Scand. J. Soc. Med. 19 1991 105 109 1792513 10.1177/140349489101900205 37 Rosenkrands V. Juul S. Foldspang A. Gronenberg V. Amning [breastfeeding] 1982 FADL’s Forlag Copenhagen Appendix A Supplementary data The following is the Supplementary data to this article: multimedia component 1 multimedia component 1 Acknowledgments We thank the collection of the Copenhagen Perinatal Cohort data led by the late Drs Aage Willumsen and Bengt Zachau-Christiansen. Appendix A Supplementary data to this article can be found online at https://doi.org/10.1016/j.ajcnut.2025.05.028 ",
  "metadata": {
    "Title of this paper": "The duration of breast-feeding. A longitudinal prospective study in Denmark",
    "Journal it was published in:": "The American Journal of Clinical Nutrition",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489343/"
  }
}