{
  "title": "Paper_584",
  "abstract": "pmc Discov Oncol Discov Oncol 4139 discon Discover Oncology 2730-6011 Springer PMC12480286 PMC12480286.1 12480286 12480286 41021161 10.1007/s12672-025-03525-9 3525 1 Analysis Integrating single-cell and bulk RNA sequencing data establishes a cuproptosis-related gene predictive signature in breast cancer Peng Rongrong 1 2 Li Yu 1 Xu Bo boxu126@126.com 2 1 https://ror.org/03j4gka24 grid.508281.6 Department of Breast Surgery, PingXiang people’s hospital, 2 https://ror.org/05d5vvz89 grid.412601.0 0000 0004 1760 3828 Department of Breast Surgery, The First Affiliated Hospital, Jinan University, 29 9 2025 12 2025 16 478248 1775 13 5 2025 28 8 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Breast cancer (BRCA) remains the most common malignancy and the leading cause of cancer-related death among women worldwide. Recent studies have highlighted dysregulated copper homeostasis as a contributor to tumorigenesis, with cuproptosis—a copper-dependent form of regulated cell death—emerging as a potential therapeutic target. In this study, we systematically evaluated the prognostic significance of cuproptosis-related genes (CRGs) in BRCA by integrating multi-omics data from TCGA and GEO cohorts. Through weighted gene co-expression network analysis (WGCNA), we identified four key CRGs ( CCDC24 TMEM65 XPOT NUDCD1 Supplementary Information The online version contains supplementary material available at 10.1007/s12672-025-03525-9. Keywords BRCA Cuproptosis Prognostic signature TME Single-cell analysis Jiangxi Provincial Health Commission Youth Project 202510933 Xu Bo pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Science+Business Media LLC, part of Springer Nature 2025 Introduction Breast cancer (BRCA), a malignancy arising from ductal epithelial cells, remains the most frequently diagnosed cancer and the leading cause of cancer-related death among women worldwide, accounting for 24.5% of new cancer cases and 15.0% of cancer-related mortality in 2020 [ 1 Recent studies have highlighted the pivotal role of transition metal homeostasis in tumor biology, particularly the oncogenic potential of copper dysregulation. Copper is an essential trace element involved in mitochondrial respiration, redox balance, and iron metabolism. Under physiological conditions, its intracellular levels are tightly regulated; deviations have been implicated in a spectrum of pathologies including neurodegenerative and hematologic disorders [ 2 3 4 Genome-wide CRISPR-Cas9 screens have delineated a core molecular framework for cuproptosis regulation, identifying seven positive regulators (FDX1, LIAS, LIPT1, DLD, DLAT, PDHA1, and PDHB) and three suppressors (MTF1, GLS, and CDKN2A) [ 5 6 8 However, the functional relevance of cuproptosis-related genes (CRGs) in breast cancer progression remains largely unexplored. In particular, how CRG expression shapes tumor behavior, influences the tumor microenvironment (TME), and correlates with clinical outcomes has not been systematically investigated. Moreover, most existing studies rely on bulk transcriptomic data, which masks the heterogeneity of gene expression across different cell populations within the tumor. In contrast, single-cell RNA sequencing (scRNA-seq) enables high-resolution profiling of individual cell types, allowing for the dissection of cell-type-specific expression patterns and functional states. Integrating bulk and single-cell RNA-seq therefore offers complementary insights—capturing both overall transcriptomic trends and cellular-level specificity—thereby improving the mechanistic interpretation and clinical relevance of gene-based prognostic models [ 9 In this study, we present a comprehensive analysis of CRG dysregulation and prognostic relevance in BRCA by integrating multi-omics data from the TCGA and GEO cohorts. Through weighted gene co-expression network analysis (WGCNA) and machine learning-based prognostic modeling, we identify a four-gene signature ( CCDC24 TMEM65 XPOT NUDCD1 Materials and methods BRCA data source and preprocessing Gene expression and clinical data for breast cancer (BRCA) were obtained from The Cancer Genome Atlas (TCGA, https://cancergenome.nih.gov/ For external validation of the predictive model, we used the GSE20685 https://www.ncbi.nlm.nih.gov/geo The CRGs were selected for analysis based on previously published literature [ 3 10 http://www.cbioportal.org/datasets https://www.gsea-msigdb.org/gsea/msigdb/ Landscape of genetic expression and variation of CRGs in breast cancer To explore the expression landscape of CRGs in breast cancer, we first compared CRG expression between BRCA tumor samples and paired normal tissues using the Wilcoxon rank-sum test. Differences in gene expression across clinical subgroups were evaluated using the Wilcoxon rank-sum test for two-group comparisons and the Kruskal–Wallis test for comparisons involving more than two groups. Somatic mutation profiles of CRGs were visualized using the maftools package (version 2.16.0). Copy number variation (CNV) analysis was performed using Fisher’s exact test, and the results were visualized with the ggplot2 package (version 3.4.4). The chromosomal locations of CRGs were mapped using the RCircos package (version 1.2.2), generating a circos plot to illustrate their genomic distribution. Weighted gene co-expression network construction A weighted gene co-expression network was constructed using the WGCNA package (version 1.72-1) [ 11 The MEs of all modules were clustered using the average-linkage hierarchical clustering method, with a minimum module size set to 30 genes. Modules showing high similarity were subsequently merged to refine the co-expression network. Each ME represents the first principal component of the module and is used to describe its corresponding module and reflects the overall gene expression pattern within that module across samples. To explore associations between modules and clinical traits, Pearson correlation coefficients were calculated between MEs and clinical variables. Modules with significant correlations ( P 11 Functional enrichment analyses To investigate the biological functions and signaling pathways associated with the identified hub genes, we performed Gene Ontology (GO) annotation and Kyoto Encyclopedia of Genes and Genomes (KEGG) pathway enrichment analyses using the clusterProfiler package (version 4.10.0) [ 12 13 P Identification of hub genes To identify prognostic CRGs, we first performed univariate Cox proportional hazards regression analysis for overall survival (OS) using the survival package (version 3.5-7). Genes with P  \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ \\:Score = \\sum\\limits_{{i = 0}}^{n} {\\beta \\:i*\\chi \\:i} $$\\end{document} where βi i χi Predictive ability of the prognostic signature of CRGs After LASSO regression analysis, patients were stratified into high- and low-risk groups based on the median risk score derived from the selected prognostic CRGs. Kaplan–Meier (KM) survival analysis was conducted using the survival package (version 3.5-7) and survminer package (version 0.4.9) to evaluate differences in overall survival between the two groups. To further assess the prognostic independence of the CRG-based signature, univariate and multivariate Cox proportional hazards regression analyses were performed on clinical variables in both the training and validation cohorts using the coxph function from the survival package. A P Cuproptosis signature variation analysis and functional annotation Simple nucleotide variation (SNV) and copy number variation (CNV) analyses were conducted based on data from the training cohort. Using the maftools package (version 2.16.0), we compared mutation profiles between the high and low CRG signature groups using Fisher’s exact test. The results were visualized as waterfall plots. Genomic distribution of CNVs in relation to the CRG signature was displayed using the ggplot2 package (version 3.4.4). To explore potential functional differences between groups, gene set variation analysis (GSVA) was performed using the GSVA package (version 1.48.3). The HALLMARK gene set (msigdb.v7.4.symbols.gmt) was downloaded from the MSigDB database ( https://www.gsea-msigdb.org/gsea/index.jsp CRG signature tumor microenvironment infiltration characteristics The abundance of stromal and immune components within tumor samples was estimated using the ESTIMATE algorithm via the estimate package (version 1.0.13) in R. Stromal Score and Immune Score were estimated separately, and the ESTIMATE Score was derived by combining both. To further assess immune cell infiltration, we applied single-sample gene set enrichment analysis (ssGSEA), CIBERSORT, and xCell algorithms. The resulting immune infiltration scores were compared between high- and low-risk CRG signature groups. Differences were evaluated using the Wilcoxon rank-sum test, and the results were visualized with the ggplot2 package (version 3.4.4). Single-cell RNA-seq analysis to reveal the expression of key genes across different cell types To investigate the expression landscape of key genes within the TME of BRCA, we conducted a single-cell RNA sequencing (scRNA-seq) analysis using publicly available data from the GEO database ( GSE176078 14 Data preprocessing and analysis were performed using the Seurat package (version 4.3.0) in R. Quality control was applied to filter out low-quality cells based on the following criteria: (1) number of detected genes per cell > 200; (2) number of detected genes per cell < 5,000; (3) percentage of mitochondrial gene expression < 20%. Following quality control, gene expression values were normalized using the LogNormalize method, and highly variable genes were identified using the FindVariableFeatures function. Principal component analysis (PCA) was used for initial dimensionality reduction, and Uniform Manifold Approximation and Projection (UMAP) was subsequently applied for nonlinear dimensionality reduction and visualization. Cell clustering was performed using k-nearest neighbor (kNN) graph construction and Louvain clustering via the FindNeighbors and FindClusters (resolution = 0.8) functions in Seurat. Cell type composition was quantified by calculating the proportion of each cluster, and visualized using bar plots generated with ggplot2 (version 3.4.4). Expression patterns of selected key genes ( CCDC24 TMEM65 XPOT NUDCD1 Statistical analysis All statistical analyses were conducted using R software (version 4.2.2). Differences in gene expression between two groups were evaluated using the Wilcoxon rank-sum test while comparisons among more than two groups were assessed using the Kruskal–Wallis test. Kaplan–Meier survival curves were generated using the survival (version 3.5-7) and survminer (version 0.4.9) packages, and differences between groups were tested by the log-rank test. Univariate and multivariate prognostic analyses were performed using Cox proportional hazards regression models via the coxph function. For mutation comparisons, Fisher’s exact test was applied. Boxplots, bar charts, and other visualizations were generated using ggplot2 (version 3.4.4). A P * P ** P *** P **** P Results Differential expression and genetic alterations of CRGs in BRCA Analysis of 10 CRGs in 1,059 BRCA samples from the TCGA dataset revealed significant transcriptional dysregulation compared to 99 normal breast tissues ( P DLD LIAS PDHA1 FDX1 LIPT1 MTF1 GLS CDKN2A PDHB DLAT 1 BRCA is typically classified into four major molecular subtypes—Luminal A, Luminal B, HER2-enriched, and triple-negative breast cancer (TNBC)—based on immunohistochemical markers and gene expression profiling. TNBC, which accounts for approximately 15–20% of invasive breast cancers, is known for its pronounced molecular heterogeneity, aggressive clinical behavior, and increased risk of recurrence [ 15 To further explore the relationship between CRGs and BRCA subtypes, we stratified the TCGA cohort into TNBC and non-TNBC groups. Comparative expression analysis revealed that six CRGs ( DLD GLS PDHA1 FDX1 CDKN2A DLAT LIAS LIPT1 LIPT2 1 Genomic analysis further identified frequent CNVs and somatic mutations among CRGs (Fig. 1 1 MTF1 FDX1 DLAT PDHB  Fig. 1 Transcriptional and Genomic Landscape of CRGs in BRCA. (A) Differential expression of 10 CRGs between normal breast tissues ( n n n n n P * P ** P *** P **** P Network analysis identifies CRG-associated co-expression modules in BRCA To construct a robust gene co-expression network, we first conducted scale-free topology analysis to determine the optimal soft-thresholding power (β). As shown in Fig. 2 We then integrated CRG expression data with clinical traits to identify biologically and clinically relevant gene modules. Hierarchical clustering of analysis of MEs revealed distinct co-expression patterns, and highly similar modules were subsequently merged to refine network structure (Supplementary Fig. 2A). Correlations between MEs and clinical variables were evaluated using Pearson correlation analysis, highlighting several modules with significant trait associations (Supplementary Fig. 2B). In particular, the pink, yellow, and midnight blue modules exhibited strong correlations with CRG expression profiles (Fig. 2 To identify hub genes within CRG-associated modules, we applied stringent selection criteria: MM > 0.6 and GS > 0.4. A total of 108 candidate hub genes met both thresholds, indicating high intramodular connectivity and strong association with CRG-related phenotypes (Fig. 2  Fig. 2 Identification of Co-expression Modules Associated with Cuproptosis in BRCA. (A) Determination of the optimal soft-thresholding power (β) for network construction. The left panel shows the scale-free topology model fit, and the right panel shows mean connectivity at various β values; (B) Heatmap showing the correlations between module eigengenes (MEs) and clinical traits in the TCGA-BRCA cohort ( n P Construction of the prognostic signature based on CRGs in BRCA To develop a prognostic model, we utilized 108 CRGs identified from the WGCNA analysis as candidate predictors. Univariate Cox regression analysis revealed 23 genes significantly associated with overall survival ( P P CCDC24 CCT6A CDCA7 TMEM65 SLC7A5 CCNE1 To refine the model and reduce the risk of overfitting, we performed LASSO regression analysis, which identified four core prognostic genes: CCDC24 TMEM65 XPOT NUDCD1 3  \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ {\\text{Risk Score = ( - 0}}{\\text{.051 }} \\times {\\text{CCDC24) + }}\\left( {6.355 \\times 10^{{ - 5}} \\times {\\text{TMEM}}65} \\right) + \\left( {0.056 \\times {\\text{XPOT}}} \\right) + \\left( {0.115 \\times {\\text{NUDCD}}1} \\right). $$\\end{document} The negative coefficient for CCDC24 Predictive performance of the CRG-based prognostic signature To assess the clinical relevance of the CRG-derived rsk score, patients in both the TCGA-BRCA (training) and GEO ( GSE20685 3 We further evaluated the predictive accuracy of the signature using time-dependent receiver operating characteristic (ROC) curve analysis. In the training cohort, the model yielded area under the curve (AUC) values of 0.595, 0.619, and 0.597 for 1-year, 3-year, and 5-year overall survival predictions, respectively (Fig. 3 3 Expression profiling of the four signature genes revealed distinct patterns across risk groups. CCDC24, associated with a negative coefficient in the risk score model, was significantly upregulated in the low-risk group, consistent with its protective role. In contrast, TMEM65 XPOT NUDCD1 3  Fig. 3 Construction and Validation of a CRG-based Prognostic Model Using Machine Learning. (A) LASSO regression analysis of 23 prognosis-associated CRGs. The left panel shows the coefficient profiles, and the right panel presents the optimal penalty parameter (λ) selection based on 10-fold cross-validation using the minimum criteria; (B) LASSO-derived coefficients of the four genes included in the final prognostic model; (C) Kaplan–Meier survival analysis comparing high- and low-risk groups in the TCGA training cohort ( n GSE20685 n CCDC24 TMEM65 XPOT NUDCD1 Validation and functional characterization of the CRG-based prognostic signature To evaluate the independent prognostic value of CRG signature, univariate and multivariate Cox regression analyses were performed. The signature showed a trend toward statistical significance as an independent prognostic factor ( P 4 4 Stratified analyses uncovered notable associations between risk score and clinicopathological features. Patients aged younger than 60 years exhibited significantly higher risk scores than older individuals (Fig. 4 Functional enrichment analysis highlights divergent biological pathways across risk groups To explore the biological mechanisms associated with the prognostic signature, we conducted GO and KEGG enrichment analyses of the 108 CRG-associated genes (Supplementary Fig. 4A). In the GO analysis: (1) Biological Processes (BP): cGenes were predominantly associated with chromosomal segregation and organelle fission; (2) Cellular Components (CC): Significant enrichment was observed in condensed chromosomes and chromosomal regions; (3) Molecular Functions (MF): Genes were strongly linked to serine kinase activity and single-stranded DNA binding. KEGG pathway analysis identified cell cycle regulation and oocyte meiosis as the top enriched pathways (Supplementary Fig. 4A). In addition, GSVA revealed distinct metabolic signatures between risk groups (Supplementary Fig. 4B). The low-risk group showed enrichment in xenobiotic metabolism and adipogenesis, whereas the high-risk group was characterized by activation of spermatogenesis and mTORC1 signaling pathways. Furthermore, stratification by molecular subtype, immune phenotype, and TNBC status revealed significant differences between the high- and low-risk groups, underscoring the biological heterogeneity underlying the prognostic stratification. To further investigate the molecular characteristics associated with the CRG-based risk stratification, we performed functional and genomic profiling analyses. Somatic mutation analysis revealed distinct mutational landscapes between the high- and low-risk groups. TP53 PIK3CA TP53  Fig. 4 Evaluation of the Prognostic and Clinical Relevance of the CRG-Based Risk Score. (A) Forest plot showing the results of univariate Cox regression analysis for clinical variables and the CRG risk score in the TCGA-BRCA cohort (training cohort, n P P P P Immune microenvironment characteristics and therapeutic implications of the CRG-based risk signature To explore the relationship between CRGs and the tumor immune microenvironment in BRCA, we performed ssGSEA to estimate the infiltration levels of 28 immune cell types across high- and low-risk groups. This approach allowed us to assess how the CRG-derived risk signature may shape immune cell composition within the TME. In parallel, we applied the ESTIMATE algorithm to evaluate stromal content, immune infiltration, and overall tumor purity. Significant differences in TME features were observed between the risk groups (Fig. 5 Immune cell composition was further analyzed using the CIBERSORT algorithm, revealing distinct associations between risk scores and specific immune cell subsets (Fig. 5 + Association between CRG risk score and drug sensitivity To further investigate the clinical relevance of the CRG signature, we analyzed its association with drug response using estimated IC50 values across various compounds. High-risk patients demonstrated significantly reduced sensitivity to several agents, including AZD2014 and GNE-317, compared to their low-risk counterparts (Fig. 5 5 These findings support the potential utility of the CRG-based risk score not only as a prognostic marker but also as a predictive biomarker for therapeutic response, offering insights into drug resistance mechanisms and informing personalized treatment strategies in BRCA.  Fig. 5 TME Characteristics and Predicted Therapeutic Response Associated with the CRG Risk Score. (A) Comparison of ESTIMATE, Immune, and Stromal Scores between high- and low-risk groups, as calculated by the ESTIMATE algorithm; (B) ssGSEA-based analysis of 28 immune cell populations showing differential enrichment patterns across risk groups; (C) Drug sensitivity analysis identifying compounds for which high-risk patients showed significantly increased responsiveness; (D) Additional drug sensitivity analysis identifying compounds for which high-risk patients showed significantly reduced responsiveness. Statistical significance was assessed using Wilcoxon rank-sum test (for two-group comparisons). A P value < 0.05 was considered statistically significant. Statistical significance in figures was annotated as follows: * P P P P Single cell transcriptomic analysis reveals TME heterogeneity and cell type-specific expression of CRGs in BRCA To further characterize the TME of BRCA, we performed scRNA-seq analysis to investigate the distribution and expression patterns of CRGs across different cell types. UMAP-based dimensionality reduction revealed a heterogeneous cellular landscape within BRCA tissues, comprising malignant epithelial cells, T cells, fibroblasts, endothelial cells, and other stromal components (Fig. 6 6 Expression profiling of key CRGs ( CCDC24 TMEM65 XPOT NUDCD1 6 CCDC24 XPOT TMEM65 NUDCD1 6 Overall, these findings highlight the cellular and molecular heterogeneity of the BRCA TME and underscore the potential role of CRGs in shaping tumor-immune interactions. The distinct cell-type-specific expression of CRGs provides additional rationale for targeting cuproptosis pathways in precision therapy.  Fig. 6 Single-Cell Transcriptomic Profiling Reveals Cellular Heterogeneity and Differential Expression of CRGs in BRCA. (A) UMAP visualization of single-cell clusters, showing the distribution of major cell types within BRCA samples; (B) Proportional composition of identified cell types across the dataset; (C–F) Expression patterns of four CRGs ( CCDC24 XPOT TMEM65 NUDCD1 Discussion In this study, we comprehensively evaluated the prognostic relevance of CRGs in BRCA by integrating co-expression network construction, survival modeling, and immune landscape characterization. Using WGCNA, we identified key CRG-based modules and constructed a robust prognostic signature ( CCDC24 TMEM65 XPOT NUDCD1 Functional annotation of CRG-related modules revealed enrichment in pathways associated with chromosome segregation and cell cycle regulation, suggesting a link between cuproptosis activity and proliferative signaling in BRCA [ 16 Importantly, our model showed potential for predicting therapeutic response. Drug sensitivity analysis indicated that high-risk patients were less responsive to several agents, including AZD2014, GNE-317, and UMI-77, suggesting that CRG risk scores may help identify patients who require alternative or intensified treatment strategies. TME, comprising tumor cells and their surrounding stromal components including lymphocytes, tumor-infiltrating immune cells, and vascular systems, plays a crucial role in tumor progression and therapeutic resistance [ 17 18 + 19 While our integrative analysis provides novel insights, several limitations must be acknowledged. First, the study was based on retrospective data from publicly available cohorts (TCGA, n GSE20685 n 20 In summary, our findings highlight cuproptosis as a previously underappreciated regulatory process in BRCA, with implications for tumor progression, immune modulation, and therapeutic response. The CRG-based risk signature offers a promising tool for prognostic stratification and personalized treatment planning. Future studies should focus on functional validation of CRGs and clinical translation through prospective trials. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1. Supplementary fig. 1. Expression and genomic alterations of Cuproptosis-Related genes across clinical subgroups. (A) Boxplots showing differential expression of CRGs across PAM50 molecular subtypes (TCGA-BRCA cohort, n P P P P  Supplementary Material 2. Supplementary fig. 2. Construction of the weighted gene Co-expression network. (A) Gene clustering dendrogram based on topological overlap matrix (1 − TOM) dissimilarity. The color bands below the dendrogram indicate module assignment derived from dynamic tree cutting; (B) Scatter plot showing the correlation between gene significance and module membership (MM) in the yellow module; (C) Scatter plot showing the correlation between gene significance and module membership (MM) in the midnight blue module.  Supplementary Material 3. Supplementary fig. 3. Survival analysis and risk score distribution of prognostic CRG candidates. (A) Kaplan–Meier survival curves for the top 6 of 23 candidate CRGs significantly associated with overall survival in TCGA-BRCA cohort ( n n n  Supplementary Material 4. Supplementary fig. 4. Functional enrichment and somatic mutation landscape in Risk-Stratified groups. (A) Gene Ontology (GO) and Kyoto Encyclopedia of Genes and Genomes (KEGG) pathway enrichment analysis of 108 tumor differentiation–associated genes; (B) Waterfall plot showing the distribution and frequency of somatic mutations in the high- and low-risk groups.  Supplementary Material 5. Supplementary fig. 5. Landscape of TP53 mutations and tumor mutational burden in risk groups. (A) Frequency and distribution of TP53 mutations in the high-risk group (TCGA-BRCA cohort, n Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements Not applicable. Author contributions R.R.P. and Y.L. developed the concept and design of this study. R.R.P. and Y.L. analyzed and interpreted the data. R.R.P. and Y.L. wrote the manuscript. Y.L. designed and illustrated the figures. B.X. conducted a critical review of the manuscript and provided constructive feedback and suggestions for revisions. B.X. provided guidance and supervision throughout the writing process. Funding Jiangxi Provincial Health Commission Youth Project (202510933). Data availability This study utilizes publicly available datasets from The Cancer Genome Atlas (TCGA) and the Gene Expression Omnibus (GEO). As both databases consist of anonymized, de-identified patient data, patient involvement was not required, and informed consent was not necessary in compliance with the ethical guidelines governing the use of these resources. Declarations Ethics approval This study used publicly available data from The Cancer Genome Atlas (TCGA) and Gene Expression Omnibus (GEO) databases. Therefore, ethical approval was not required. Patient consent Not applicable. Consent to participate Not applicable. This study did not involve any human participants, animal experiments, or interventions requiring informed consent. Consent to publish Not applicable. No individual person’s data in any form (including images, videos, or personal details) is included in this article. Competing interests The authors declare no competing interests. References 1. Cao W Chen HD Yu YW Li N Chen WQ Changing profiles of cancer burden worldwide and in china: a secondary analysis of the global cancer statistics 2020 Chin Med J 2021 134 783 91 10.1097/cm9.0000000000001474 33734139 PMC8104205 Cao W, Chen HD, Yu YW, Li N, Chen WQ. Changing profiles of cancer burden worldwide and in china: a secondary analysis of the global cancer statistics 2020. Chin Med J. 2021;134:783–91. 10.1097/cm9.0000000000001474. 33734139 10.1097/CM9.0000000000001474 PMC8104205 2. Chen J The molecular mechanisms of copper metabolism and its roles in human diseases Pflug Arch: Eur J Physiol 2020 472 1415 29 10.1007/s00424-020-02412-2 32506322 Chen J, et al. The molecular mechanisms of copper metabolism and its roles in human diseases. Pflug Arch: Eur J Physiol. 2020;472:1415–29. 10.1007/s00424-020-02412-2. 10.1007/s00424-020-02412-2 32506322 3. Tsvetkov P Copper induces cell death by targeting lipoylated TCA cycle proteins Science 2022 375 1254 61 10.1126/science.abf0529 35298263 PMC9273333 Tsvetkov P, et al. Copper induces cell death by targeting lipoylated TCA cycle proteins. Science. 2022;375:1254–61. 10.1126/science.abf0529. 35298263 10.1126/science.abf0529 PMC9273333 4. Duan F Establishment and validation of prognostic nomograms based on serum copper level for patients with Early-Stage Triple-Negative breast cancer Front Cell Dev Biology 2021 9 770115 10.3389/fcell.2021.770115 PMC8657150 34901016 Duan F, et al. Establishment and validation of prognostic nomograms based on serum copper level for patients with Early-Stage Triple-Negative breast cancer. Front Cell Dev Biology. 2021;9:770115. 10.3389/fcell.2021.770115. 10.3389/fcell.2021.770115 PMC8657150 34901016 5. Cao S Role of Cuproptosis in Understanding diseases Hum Cell 2023 36 1244 52 10.1007/s13577-023-00914-6 37154876 PMC10165592 Cao S, et al. Role of Cuproptosis in Understanding diseases. Hum Cell. 2023;36:1244–52. 10.1007/s13577-023-00914-6. 37154876 10.1007/s13577-023-00914-6 PMC10165592 6. Bian Z, Fan R, Xie LA. Novel Cuproptosis-Related prognostic gene signature and validation of differential expression in clear cell renal cell carcinoma. Genes. 2022;13. 10.3390/genes13050851. 10.3390/genes13050851 PMC9141858 35627236 7. Han J, Hu Y, Liu S, Jiang J, Wang H. A newly established Cuproptosis-Associated long Non-Coding RNA signature for predicting prognosis and indicating immune microenvironment features in soft tissue sarcoma. J Oncol. 2022;2022(8489387). 10.1155/2022/8489387. 10.1155/2022/8489387 PMC9279026 35847354 8. Lv H, et al. Comprehensive analysis of Cuproptosis-Related genes in immune infiltration and prognosis in melanoma. Front Pharmacol. 2022;13. 10.3389/fphar.2022.930041. 10.3389/fphar.2022.930041 PMC9273972 35837286 9. Wang T Integrating bulk and single-cell RNA sequencing reveals cellular heterogeneity and immune infiltration in hepatocellular carcinoma Mol Oncol 2022 16 2195 213 10.1002/1878-0261.13190 35124891 PMC9168757 Wang T, et al. Integrating bulk and single-cell RNA sequencing reveals cellular heterogeneity and immune infiltration in hepatocellular carcinoma. Mol Oncol. 2022;16:2195–213. 10.1002/1878-0261.13190. 35124891 10.1002/1878-0261.13190 PMC9168757 10. Thorsson V The immune landscape of cancer Immunity 2018 48 812 e830814 10.1016/j.immuni.2018.03.023 29628290 PMC5982584 Thorsson V, et al. The immune landscape of cancer. Immunity. 2018;48:812–e830814. 10.1016/j.immuni.2018.03.023. 29628290 10.1016/j.immuni.2018.03.023 PMC5982584 11. Langfelder P, Horvath S. WGCNA: an R package for weighted correlation network analysis. BMC Bioinformatics. 2008;9. 10.1186/1471-2105-9-559. 10.1186/1471-2105-9-559 PMC2631488 19114008 12. Huang da W Sherman BT Lempicki RA Systematic and integrative analysis of large gene lists using DAVID bioinformatics resources Nat Protoc 2009 4 44 57 10.1038/nprot.2008.211 19131956 Huang da W, Sherman BT, Lempicki RA. Systematic and integrative analysis of large gene lists using DAVID bioinformatics resources. Nat Protoc. 2009;4:44–57. 10.1038/nprot.2008.211. 19131956 10.1038/nprot.2008.211 13. Yu G Wang LG Han Y He QY ClusterProfiler: an R package for comparing biological themes among gene clusters OMICS 2012 16 284 7 10.1089/omi.2011.0118 22455463 PMC3339379 Yu G, Wang LG, Han Y, He QY. ClusterProfiler: an R package for comparing biological themes among gene clusters. OMICS. 2012;16:284–7. 10.1089/omi.2011.0118. 22455463 10.1089/omi.2011.0118 PMC3339379 14. Wu SZ A single-cell and spatially resolved atlas of human breast cancers Nat Genet 2021 53 1334 47 10.1038/s41588-021-00911-1 34493872 PMC9044823 Wu SZ, et al. A single-cell and spatially resolved atlas of human breast cancers. Nat Genet. 2021;53:1334–47. 10.1038/s41588-021-00911-1. 34493872 10.1038/s41588-021-00911-1 PMC9044823 15. Cocco S, et al. Biomarkers in Triple-Negative breast cancer: State-of-the-Art and future perspectives. Int J Mol Sci. 2020;21. 10.3390/ijms21134579. 10.3390/ijms21134579 PMC7369987 32605126 16. Liao AQ Syntheses, crystal structures of copper (II)-based complexes of sulfonamide derivatives and their anticancer effects through the synergistic effect of anti-angiogenesis, anti-inflammation, pro-apoptosis and Cuproptosis Eur J Med Chem 2024 280 116954 10.1016/j.ejmech.2024.116954 39406115 Liao AQ, et al. Syntheses, crystal structures of copper (II)-based complexes of sulfonamide derivatives and their anticancer effects through the synergistic effect of anti-angiogenesis, anti-inflammation, pro-apoptosis and Cuproptosis. Eur J Med Chem. 2024;280:116954. 10.1016/j.ejmech.2024.116954. 39406115 10.1016/j.ejmech.2024.116954 17. Tang T, et al. Advantages of targeting the tumor immune microenvironment over blocking immune checkpoint in cancer immunotherapy. Signal Transduct Target Therapy. 2021;6. 10.1038/s41392-020-00449-4. 10.1038/s41392-020-00449-4 PMC7896069 33608497 18. Fathi M Identifying signatures of EV secretion in metastatic breast cancer through functional single-cell profiling iScience 2023 26 106482 10.1016/j.isci.2023.106482 37091228 PMC10119611 Fathi M, et al. Identifying signatures of EV secretion in metastatic breast cancer through functional single-cell profiling. iScience. 2023;26:106482. 10.1016/j.isci.2023.106482. 37091228 10.1016/j.isci.2023.106482 PMC10119611 19. Wang N Copper-Based composites nanoparticles improve Triple-Negative breast cancer treatment with induction of Apoptosis-Cuproptosis and immune activation Adv Healthc Mater 2024 13 e2401646 10.1002/adhm.202401646 39001628 Wang N, et al. Copper-Based composites nanoparticles improve Triple-Negative breast cancer treatment with induction of Apoptosis-Cuproptosis and immune activation. Adv Healthc Mater. 2024;13:e2401646. 10.1002/adhm.202401646. 39001628 10.1002/adhm.202401646 20. Liao Q p53 induces circFRMD4A to suppress cancer development through glycolytic reprogramming and Cuproptosis Mol Cell 2025 85 132 e149137 10.1016/j.molcel.2024.11.013 39637854 Liao Q, et al. p53 induces circFRMD4A to suppress cancer development through glycolytic reprogramming and Cuproptosis. Mol Cell. 2025;85:132–e149137. 10.1016/j.molcel.2024.11.013. 39637854 10.1016/j.molcel.2024.11.013 ",
  "metadata": {
    "Title of this paper": "p53 induces circFRMD4A to suppress cancer development through glycolytic reprogramming and Cuproptosis",
    "Journal it was published in:": "Discover Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12480286/"
  }
}