{
  "title": "Paper_853",
  "abstract": "pmc Hemasphere Hemasphere 3722 hemasphere HEM3 HemaSphere 2572-9241 Wiley PMC12475935 PMC12475935.1 12475935 12475935 41017961 10.1002/hem3.70200 HEM370200 1 Article Article Xq24/ IL13RA1 Marcelis Lukas  1  2 Allsop Ryan Nicolaas  3  4 Vanden Bempt Marlies  5  6  7  8 Debackere Koen  5  6  7  9 Renard Félicien  5  6  7  8 Tuveri Stefania https://orcid.org/0000-0003-4051-4295  7 Dierickx Daan https://orcid.org/0000-0002-8917-022X  9 Janiszewski Adrian  3  4 Balaton Bradley Philip  3  4 Vets Johanna  1  2 Dewaele Barbara  7 Michaux Lucienne  7 Vandenberghe Peter  7  9 Cools Jan https://orcid.org/0000-0001-6626-5843  6  7 Vermeesch Joris Robert  7 Tousseyn Thomas  1  2 Pasque Vincent  3  4 Wlodarska Iwona https://orcid.org/0000-0001-7455-4135  7 iwona.wlodarska@uzleuven.be   1 Translational Cell and Tissue Research KU Leuven Leuven Belgium   2 Department of Pathology University Hospitals Leuven Leuven Belgium   3 Department of Development and Regeneration Leuven Stem Cell Institute Leuven Belgium   4 Institute for Single‐Cell Omics (LISCO) KU Leuven Leuven Belgium   5 Department of Oncology KU Leuven Leuven Belgium   6 VIB‐KU Center for Cancer Biology Leuven Belgium   7 Centre for Human Genetics KU Leuven Leuven Belgium   8 Leuvens Kanker Instituut KU Leuven–UZ Leuven Leuven Belgium   9 Department of Hematology University Hospitals Leuven Leuven Belgium * Correspondence: iwona.wlodarska@uzleuven.be 27 9 2025 9 2025 9 9 496041 10.1002/hem3.v9.9 e70200 29 5 2025 27 12 2024 07 7 2025 27 09 2025 28 09 2025 29 09 2025 © 2025 The Author(s). HemaSphere https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by-nc-nd/4.0/ Abstract Female‐biased incidence in primary mediastinal large B‐cell lymphoma (PMBCL) is enigmatic and points to a potential contribution of the X chromosome in this disease. To elucidate the postulated involvement of X‐linked factor(s), we profiled the X chromosome in 48 diagnostic PMBCLs of male (21) and female (27) origin. Molecular cytogenetic analysis detected copy number gain of X/Xq in all male patients and 59.3% (16/27) of female patients. The remaining female cases revealed either a cytogenetically cryptic copy‐neutral loss of heterozygosity (CNLOH) of X/Xq (14.8%) or germline XX (25.9%). Remarkably, RNAseq data of 28 cases indicated a nonrandom involvement of transcriptionally active X homolog in gain/CNLOH, validated by h IL13RA1 IL13RA1 IL13RA1 IL13RA1 IL13RA1  pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date September 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:27.09.2025 INTRODUCTION Primary mediastinal large B‐cell lymphoma (PMBCL) is a rare aggressive neoplasm predominantly affecting young women.  1  2  3  4 JAK2‐CD274‐PDCD1LG2 HIST1H1C REL TRAF2 MHC SOCS1 B2M ITPKB, STAT6, NFKBIE GNA13  3  4  5  6 Sex disparities observed in PMBCL are very intriguing and enigmatic. While lymphoma, like the majority of human cancers, is more prevalent in males than females,  7  8  9  10  11  12  13 XIST  14 XIST  15  10  14  16  17  18  19 The commonly observed sex disparities in cancer, particularly the higher cancer risk observed among males, are attracting the growing interest of scientists.  20  21  22  23  24  25  26  27  25 ATRX CNKSR2 DDX3X KDM5C KDM6A MAGEC3  3  4  28  4 In this study, we performed a comprehensive analysis of X‐linked aberrations in PMBCL, resulting in the identification of pervasive primary genetic defects of the X chromosome that target IL13RA1 MATERIAL AND METHODS Study material Patients with the histopathological diagnosis of PMBCL were retrospectively selected from the clinical database according to the availability of diagnostic biopsy material, DNA and/or archival cytogenetic pellets, and clinical follow‐up data. Pretreatment specimens were retrieved from the tumor banks of our institution. Constitutional DNA from peripheral blood was available for eight cases. The study cohort comprises 48 cases, including 21 male and 27 female gender. The cases were reviewed by two hematopathologists (L.M. and T.T.) for definite classification in accordance with both the recent World Health Organization (WHO) classification of hematolymphoid tumors  1  29  30 Relevant clinical characteristics of the selected patients are summarized in Table 1  31  32 S56035 Table 1 Clinical characteristics of the primary mediastinal large B‐cell lymphoma cohort. Clinical characteristics Data  n Female 27 (56.2) Male 21 (43.8) Age at diagnosis Median (range) years Female 34 (12–76) Male 33 (14–53) Stage  n I/II 34 (70.8%) III/IV 13 (27.1) NA 1 (2.1) Mediastinal involvement  n Yes 47 (97.9) No 1 (2.1) First‐line treatment  n CHOP 2 (4.2) R‐CHOP 15 (31.2) Combined modality a 24 (50.0) Other 6 (12.5) NA 1 (2.1) Response  n Durable complete 32 (66.7) Remission after first line 11 (22.9) Relapsed/refractory disease 4 (8.3) NA 1 (2.1) Abbreviations: CHOP, cyclophosphamide, hydroxydaunorubicin, oncovin, prednisone; NA, not available; R‐CHOP, rituximab‐CHOP.  a Combination of chemotherapy and radiotherapy. John Wiley & Sons, Ltd. Methods Applied methods, including conventional and molecular cytogenetics, RNA‐fluorescence in situ hybridization (FISH), IHC, next‐generation sequencing, and in vitro functional studies are described in Supporting Information S12 RESULTS Male PMBCL patients show gains of X/Xq This project started with the identification of a novel t(X;14)(p11.4;q32.33) associated with a supernumerary der(X) in three male PMBCL (M‐PMBCL) patients (Table 2 1A 1 IGH GPR34  33 1B–D BCOR 1E,F 1 MID1IPA IGH Table 2 Relevant characteristics of male primary mediastinal large B‐cell lymphoma. Genetic features a Case no. Age Applied techniques X chromosome profile Known gains RNAseq X/A ratio IHC for IL13RA1 t(X;14)‐positive 1 34 CCG, FISH t(X;14)(p11.4;q32), +der(X)t(X;14)(p11.4;q32) 9p24 A NA 2 53 CCG, FISH, aCGH t(X;14)(p11.4;q32), +der(X)t(X;14)(p11.4;q32) 9p24 NA + 3 34 CCG, FISH t(X;14)(p11.4;q32), +der(X)t(X;14)(p11.4;q32) 9p24 NA + t(X;14)‐negative 4 43 SNPa, b X,+Xq10q28 2p16, 9p24 A + 5 18 SNPa, b X,+X 9p24 A − 6 29 SNPa, b X,+X 9p24 A + 7 45 SNPa, b X,+X 2p16, 9p24 A + 8 14 SNPa, b X,+X 2p16 A + 9 41 SNPa, b X,+X 2p16, 9p24 A NA 10 31 SNPa, b X,+X 9p24 A + 11 30 SNPa, b X,+X 2p16, 9p24 A + 12 44 SNPa, b X,+X 9p24 A − 13 40 UPS X,amp(Xq22.1q27.3) 9p24 NA + 14 25 CCG, FISH X,+X NA NA + 15 32 CCG, FISH X,+X 9p24 NA NA 16 34 CCG, FISH X,+X 9p24 NA NA 17 26 FISH CEPX x2, Xp11.4 ×2 NA NA + 18 29 FISH CEPX x2, Xp11.4 ×2 9p24 NA + 19 23 FISH CEPX x2, Xp11.4 ×2 9p24 NA NA 20 37 FISH CEPX x2, Xp11.4 ×2 NA NA NA 21 30 FISH CEPX x2, Xp11.4 ×2 NA NA NA Abbreviations: A, analyzed; aCGH, array‐based comparative genomic hybridization; ccfDNA, circulating cell‐free DNA; CCG, conventional cytogenetics; CEPX, chromosome X centromeric probe; FISH, fluorescence in situ hybridization; IHC, immunohistochemistry; M, male; NA, not analyzed; SNPa, single‐nucleotide polymorphism array; UPS, ultralow pass sequencing of ccfDNA; X/A, X‐to‐autosome expression ratio.  a The reported genetic aberrations were found in 20%–60% of karyotyped metaphase cells and/or 12%–53% of interphase cells analyzed by interphase FISH.  b Genome‐wide SNPa profiles have been previously described.  6 John Wiley & Sons, Ltd. Figure 1  Genetic mapping of t(X;14)(p11.4;q32.33) performed in three cases of male primary mediastinal large B‐cell lymphoma. (A) (B–E) (B) (C) (D) (E) 1 (F) IGH BCOR The intriguing duplication of der(X) in all three M‐PMBCL cases with t(X;14)(p11.4;q32.33) prompted us to examine the genetic profile of the X chromosome in 18 well‐documented M‐PMBCL cases (Table 2 2 2A,B 2A,B  34 Figure 2  Examples of chromosome X imbalances detected by single‐nucleotide polymorphism (SNP) array (left panel) and fluorescence in situ hybridization (FISH)/cytogenetics (right panel) in two M‐PMBCLs (A,B), four F‐PMBCLs (C–F), and two cell lines (G,H). (A) (B) (D) (C) (E) Chromosome X aberrations are common in female PMBCL patients To determine the frequency of X‐related CN alterations in female patients, in the next step, we performed iFISH (Supporting Information S1: Table 1 3  6  6 alias 2C–F 1  35  36 2H Table 3 Relevant characteristics of female primary mediastinal large B‐cell lymphoma (PMBCL). Case no. Age Genetic features a RNAseq X/A ratio IHC for IL13RA1 Applied techniques X chromosome profile Known gains 1. XX 22 34 SNPa, b XX 2p16 A + 23 35 SNPa, b XX 9p24 A − 24 41 SNPa, b X,del(X)(p22.31p22.2) ‐ A + 25 48 SNPa, b XX 9p24 A − 26 27 SNPa, b XX ‐ NA + 27 20 SNPa, b X, del(X)(q23q26.3)sc 9p24 NA + 28 37 SNPa, b XX 9p24 A + 2. CNLOHX 29 41 SNPa b X,CNLOHX 9p24 NA + 30 12 SNPa b X,CNLOHX 9p24 A + 31 76 SNPa b X,CNLOHX 2p16, 9p24 A + 32 16 SNPa b X,CNLOHXp22.33q26.3,+Xq26.3q28 ‐ A + 3. Whole or partial gain of X 33 29 SNPa b X,CNLOHXp11.1p22.33, del(X)(q11.2q21.1),+Xq21.1q28 2p16, 9p24 A + 34 40 SNPa b X,CNLOHXp22.1p22.33, +Xp22.1q28,+Xq22.1q26.3 2p16, 9p24 NA + 35 25 SNPa b XX,+Xp22.33p22.2,+Xp22.2p11.4, +Xp11.4q28 2p16 A + 36 35 CCG, SNPa b X,i(Xq),+i(Xq) (del(X)(p11.1p22.33), +Xq11.2q28,+Xq11.2q28,+Xq11.2q28) 9p24 A − 37 45 SNPa b X,del(X)(p22.13p22.33), +Xp22.13q28,+Xq21.1q28 2p16, 9p24 A + 38 40 UPS, SNPa b XX,+X ‐ A + 39 32 SNPa b XX,+X 2p16, 9p24 A + 40 45 SNPa b XX,+X 2p16, 9p24 NA + 41 29 SNPa b XX,+X 2p16, 9p24 A + 42 37 SNPa b XX,+X 9p24 A − 43 32 SNPa b XX,+X 2p16, 9p24 A + 44 20 SNPa b XX,+X 9p24 A + 45 27 CCG, FISH XX,+X 9p24 NA NA 46 31 CCG, FISH XX,+X 9p24 NA NA 47 30 UPS XX,+X 9p24 NA NA 48 37 CCG, FISH XX,+X(14%)/sl,+t(X;7)(q26;p11)(86%) ‐ NA + PMBCL‐derived cell lines 49 Karpas 1106P ‐ SNPa b XX,+X,+Xq11.1q21.1 2p16, 9p24 NA − 50 U2940 ‐ SNPa b X,del(X)(p11.2p22.33), CNLOHXq11.2q13.1, del(X)(q13.1q21.3) hmz, CNLOHXq21.3q28 ‐ NA − Abbreviations: A, analyzed; ccfDNA, circulating cell‐free DNA; CCG, conventional cytogenetics; CNLOHX, copy‐neutral loss of heterozygoisity of chromosome X; F, female; FISH, fluorescence in situ hybridization; IHC, immunohistochemistry; NA, not analyzed; SNPa, single‐nucleotide polymorphism array; UPS, ultralow pass sequencing of ccfDNA; X/A, X‐to‐autosomes expression ratio.  a The reported genetic aberrations were found in 25%–47% of karyotyped metaphase cells and/or 15%–62% of interphase cells analyzed by interphase FISH.  b Genome‐wide SNPa profiles have been previously described.  6 John Wiley & Sons, Ltd. Figure 3A 3B Figure 3  Mapping of the smallest region of copy number gain/copy‐neutral loss of heterozygosity (CNLOH) of Xq. (A) (B) Common gain of an active X chromosome in PMBCL To determine whether X chromosome imbalances in PMBCL are random (affect both Xa and Xi) or nonrandom (affect only Xa or Xi), we sought to determine the activation status of the involved X chromosome in available PMBCL cases. Twenty‐eight tumor samples (10 M‐PMBCL and 18 F‐PMBCL) and eight control (not malignant) lymph node samples (four of male and four of female origin) were subjected to bulk RNA sequencing. For analysis, the samples were divided into four groups according to sex and X‐linked chromosomal aberrations: (1) M‐PMBCL,+X/Xq (Cases 1, 4–12), (2) F‐PMBCL,+X/Xq (Cases 33, 35–39, and 41–44), (3) F‐PMBCL,CNLOHX (Cases 30–32), and (4) F‐PMBCL,XX (Cases 22–25, 28). The ratio of average X‐linked gene expression to average autosomal gene expression (X‐to‐autosome expression ratio)  37 2 4A Figure 4  Activated status of X chromosomes in primary mediastinal large B‐cell lymphoma (PMBCL). (A) t (B) To validate the data, RNA‐FISH analysis with h HDAC8 HUWE1 4B 2A 2B h h h h h h h h h 3 2H Gain of an active X chromosome in PMBCL is associated with IL13RA1 Given that X‐linked gene expression is increased in the majority of PMBCL samples, we sought to investigate which X‐linked genes within the smallest region of gain/CNLOH (Xq22.1q27.3/99.5‐142.5 Mb) were deregulated in PMBCL cases. Of the 817 protein‐coding genes in this ~43 Mb region, only a minority were dysregulated across the PMBCL subgroups (Figure 5A–F 3A 3B 2 IL13RA1 NKRF  38  39  40  41  42  43  44 IL13RA1  45  46 NKRF  43  44 IL13RA1 5E IL13RA1 5F Figure 5  Expression analysis of genes located in the smallest region of gain/copy‐neutral loss of heterozygosity (CNLOH) of Xq. (A) (B) (C) (D) (E) (F) U q (G)–(J) (G) (H) (I) (J) Common expression of IL13RA1 in PMBCL The level of IL13RA1 protein expression in PMBCL was examined by IHC. IL13RA1 serum ( PA528309 5  47 2 3 5G–J  48 Frequent mutations in components of the IL4‐IL13 signaling pathway To investigate protein‐coding alterations in PMBCL, whole‐exome sequencing (WES) analysis was performed in 19 PMBCL cases, including 8 tumor/normal tissue paired cases (nos 5, 8, 10, 11, 22, 25, 42, and 43). Both cell lines were subjected to whole‐genome sequencing (WGS).  6  6 6A 6B SOCS1 STAT6 IL4 IL13RA1 STAT6 SOCS1 IL13RA1 SOCS1 SOCS1 STAT6 IL4R/IL13RA1  3 IL13RA1  5 6C  49  5 4A  5 STAT6 IL4A SOCS1 IL13RA1 4B Figure 6  Mutation and functional analysis of components of the IL4–IL13 signaling pathway. (A) (B) (C)  5  49 (D) (E) (F) (G) (H) (I) (J) (K) (L) (M) IL13RA1 expression confers cytokine‐independent growth To functionally examine the oncogenic capacities of IL13RA1 overexpression, we used the murine IL3‐dependent pro‐B cell line Ba/F3, a popular model system developed for assessing the transforming potency of kinase oncogenes.  50 Il13ra1 Il13ra2 Il4ra 6D IL13RA1 6E 6F,G 6H  3  4  5 6I,J https://depmap.org 6K 6L,M DISCUSSION PMBCL is one of the rare nonreproductive system tumors preferentially affecting females (F:M/2:1). To gain insight into mechanisms driving sex‐biased incidence in PMBCL and potential X‐linked factors contributing to this phenomenon, we analyzed genetic profiles of the X chromosome in a series of diagnostic male (21) and female (27) PMBCL cases, as recommended.  51  52  53  54  55 7 IL13RA1  38  39  40  41  42 IL13RA1 7B  17 IL13RA1 IL13RA1  56  57  58  15  59  60 h 4B  61 IL4R 6A  3 Figure 7  Pathogenic events in primary mediastinal large B‐cell lymphoma (PMBCL). (A) (B) IL13RA1 IL13RA1 IL13RA1 (C) It is worth emphasizing that a distinctive expression of IL13RA1  45  46  45 IL13RA1 PDL2 SNFT  62 IL13RA1 IL13RA1  38  39  40  63  64  65 Functional studies of IL13RA1 conducted on Ba/F3, a murine IL‐3‐dependent pro‐B cell line, showed that overexpressed IL13RA1 can transform these cells and induce their IL3‐independent growth by activation of the downstream JAK‐STAT cascade. Transforming potential of IL13RA1 was stronger under stimulation with IL13, but once transformed, the cells did not need IL13 supplementation for growth. Importantly, the transformed Ba/F3 cells were sensitive to JAK‐STAT inhibition. The choice of a murine but not human model is a serious limitation of this work, but the demonstration of a transforming potential of IL13RA1 on already transformed/engineered human cells is challenging. Despite these limitations, our study provides new insight into molecular mechanisms underlying the constitutive activation of the oncogenic JAK‐STAT signaling pathway in PMBCL. Until now, this process was exclusively associated with somatic mutations in the involved genes and 9p24 ( JAK2/JMJD2C  3  4  64  65 IL13RA1 1 IL13RA1  5 6B,C It is worth noting that NSCHL is also featured by an enhanced expression of IL13RA1 (Figure 5J IL13RA1  48  65  46  48  66  67  62  1  68 Genetic mechanisms contributing to the sex disparity in PMBCL are summarized in Figure 7 IL13RA1 7C  69  70  71  72  73  74  75  76  77  78  79  80 To summarize, our study provides a completely new view on the role of the X chromosome in the pathogenesis of PMBCL. We showed that all PMBCL cases, regardless of gender, are hallmarked by genetic or likely epigenetic Xq24 defects resulting in increased gene dosage/expression of IL13RA1  11  81  82 AUTHOR CONTRIBUTIONS  Lukas Marcelis Ryan Nicolaas Allsop Marlies Vanden Bempt Koen Debackere Félicien Renard Stefania Tuveri Daan Dierickx Adrian Janiszewski Bradley Philip Balaton Johanna Vets Barbara Dewaele Lucienne Michaux Peter Vandenberghe Jan Cools Joris Robert Vermeesch Thomas Tousseyn Vincent Pasque Iwona Wlodarska CONFLICT OF INTEREST STATEMENT J. C. is an Editor at HemaSphere FUNDING KU Leuven Research Fund (C14/21/119); the FWO and F.R.S.‐FNRS (G0I7822N); Fonds Wetenschappelijk Onderzoek (11L0722N, 1263323N, 1S74420N, G0B4420N, and G0C9320N); and Stichting Tegen Kanker. Supporting information Supporting Information. Supporting Information. Supporting Information. Supporting Information. Supporting Information. Supporting Information. Supporting Information. Supporting Information. Supporting Information. Supporting Information. Supporting Information. Supporting Information. ACKNOWLEDGMENTS The authors would like to thank Ursula Pluys, Kathleen Doms, Kim Rummens, Julie Vanderheydt, and Anne Renmans for their excellent technical assistance. Dedicated to Chris De Wolf‐Peeters. DATA AVAILABILITY STATEMENT SNPa, WGS, and WES data are deposited in GEO ( https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE184212 https://www.ebi.ac.uk/ena/browser/view/PRJEB50976 REFERENCES 1 WHO . Classification of Haematolymphoid tumours 11 5th ed International Agency for Research on Cancer 2022 2 Perera J Huang H The development and function of thymic B cells Cell Mol Life Sci 2015 72 14 2657 2663 10.1007/s00018-015-1895-1 25837998 PMC4480206 3 Mottok A Hung SS Chavez EA Integrative genomic analysis identifies key pathogenic mechanisms in primary mediastinal large B‐cell lymphoma Blood 2019 134 10 802 813 10.1182/blood.2019001126 31292115 4 Chapuy B Stewart C Dunford AJ Genomic analyses of PMBL reveal new drivers and mechanisms of sensitivity to PD‐1 blockade Blood 2019 134 26 2369 2382 10.1182/blood.2019002067 31697821 PMC6933293 5 Noerenberg D Briest F Hennch C Genetic characterization of primary mediastinal B‐cell lymphoma: pathogenesis and patient outcomes J Clin Oncol 2024 42 4 452 466 10.1200/JCO.23.01053 38055913 6 Tuveri S Debackere K Marcelis L Primary mediastinal large B‐cell lymphoma is characterized by large‐scale copy‐neutral loss of heterozygosity Genes Chromosom Cancer 2022 61 10 603 615 10.1002/gcc.23069 35611992 7 Thandra KC Barsouk A Saginala K Padala SA Barsouk A Rawla P Epidemiology of non‐Hodgkin's lymphoma Med Sci (Basel) 2021 9 1 5 10.3390/medsci9010005 33573146 PMC7930980 8 Ross MT Grafham DV Coffey AJ The DNA sequence of the human X chromosome Nature 2005 434 7031 325 337 10.1038/nature03440 15772651 PMC2665286 9 Liu R Kain M Wang L Inactivation of X‐linked tumor suppressor genes in human cancer Future Oncol 2012 8 4 463 481 10.2217/fon.12.26 22515449 PMC4369797 10 Balaton BP Dixon‐Mcdougall T Peeters SB Brown CJ The eXceptional nature of the X chromosome Hum Mol Gen 2018 27 R2 R242 R249 10.1093/hmg/ddy148 29701779 PMC6061837 11 Spatz A Borg C Feunteun J X‐chromosome genetics and human cancer Nat Rev Cancer 2004 4 8 617 629 10.1038/nrc1413 15286741 12 Lyon MF Gene action in the X‐chromosome of the mouse ( Mus musculus Nature 1961 190 4773 372 373 10.1038/190372a0 13764598 13 Payer B Lee JT X chromosome dosage compensation: how mammals keep the balance Annu Rev Genet 2008 42 733 772 10.1146/annurev.genet.42.110807.091711 18729722 14 Peeters SB Posynick BJ Brown CJ Out of the silence: insights into how genes escape X‐chromosome inactivation Epigenomes 2023 7 4 29 10.3390/epigenomes7040029 38131901 PMC10742877 15 Moore KL Barr ML The sex chromatin in human malignant tissues Br J Cancer 1957 11 3 384 390 10.1038/bjc.1957.45 13499787 PMC2073881 16 Sudbrak R X chromosome‐specific cDNA arrays: identification of genes that escape from X‐inactivation and other applications Hum Mol Gen 2001 10 1 77 83 10.1093/hmg/10.1.77 11136717 17 Cotton AM Ge B Light N Adoue V Pastinen T Brown CJ Analysis of expressed SNPs identifies variable extents of expression from the human inactive X chromosome Genome Biol 2013 14 11 R122 10.1186/gb-2013-14-11-r122 24176135 PMC4053723 18 Panda A Zylicz JJ Pasque V New Insights into X‐chromosome reactivation during reprogramming to pluripotency Cells 2020 9 12 2706 10.3390/cells9122706 33348832 PMC7766869 19 Wang J Syrett CM Kramer MC Basu A Atchison ML Anguera MC Unusual maintenance of X chromosome inactivation predisposes female lymphocytes for increased expression from the inactive X Proc Natl Acad Sci 2016 113 14 E2029 E2038 10.1073/pnas.1520113113 27001848 PMC4833277 20 Edgren G Liang L Adami HO Chang ET Enigmatic sex disparities in cancer incidence Eur J Epidemiol 2012 27 3 187 196 10.1007/s10654-011-9647-5 22212865 21 Zhu Y Shao X Wang X Liu L Liang H Sex disparities in cancer Cancer Lett 2019 466 35 38 10.1016/j.canlet.2019.08.017 31541696 22 Haupt S Caramia F Herschtal A Identification of cancer sex‐disparity in the functional integrity of p53 and its X chromosome network Nat Commun 2019 10 1 5385 10.1038/s41467-019-13266-3 31772231 PMC6879765 23 Rubin JB Lagas JS Broestl L Sex differences in cancer mechanisms Biol Sex Differ 2020 11 1 17 10.1186/s13293-020-00291-x 32295632 PMC7161126 24 Dong M Cioffi G Wang J Sex differences in cancer incidence and survival: a pan‐cancer analysis Cancer Epidemiol Biomarkers Prevent 2020 29 7 1389 1397 10.1158/1055-9965.EPI-20-0036 32349967 25 Dunford A Weinstock DM Savova V Tumor‐suppressor genes that escape from X‐inactivation contribute to cancer sex bias Nature Genet 2017 49 1 10 16 10.1038/ng.3726 27869828 PMC5206905 26 Haupt S Caramia F Klein SL Rubin JB Haupt Y Sex disparities matter in cancer development and therapy Nat Rev Cancer 2021 21 6 393 407 10.1038/s41568-021-00348-y 33879867 PMC8284191 27 Sadagopan A Nasim IT Li J Achom M Zhang CZ Viswanathan SR Somatic XIST activation and features of X chromosome inactivation in male human cancers Cell Syst 2022 13 11 932 944 10.1016/j.cels.2022.10.002 36356577 28 Wessendorf S Barth TFE Viardot A Further delineation of chromosomal consensus regions in primary mediastinal B‐cell lymphomas: an analysis of 37 tumor samples using high‐resolution genomic profiling (array‐CGH) Leukemia 2007 21 12 2463 2469 10.1038/sj.leu.2404919 17728785 29 Campo E Jaffe ES Cook JR The International Consensus Classification of Mature Lymphoid Neoplasms: a report from the Clinical Advisory Committee Blood 2022 140 11 1229 1253 10.1182/blood.2022019016 35653592 PMC9479027 30 Yuan J Wright G Rosenwald A Identification of primary mediastinal large B‐cell lymphoma at nonmediastinal sites by gene expression profiling Am J Surg Pathol 2015 39 10 1322 1330 10.1097/PAS.0000000000000473 26135560 PMC7742851 31 Nacheva E Dyer M Metivier C B‐cell non‐Hodgkin's lymphoma cell line (Karpas 1106) with complex translocation involving 18q21.3 but lacking BCL2 rearrangement and expression Blood 1994 84 10 3422 3428 10.1182/blood.V84.10.3422.3422 7949096 32 Sambade C Berglund M Lagercrantz S U‐2940, a human B‐cell line derived from a diffuse large cell lymphoma sequential to Hodgkin lymphoma Int J Cancer 2006 118 3 555 563 10.1002/ijc.21417 16106419 33 Baens M Finalet Ferreiro J Tousseyn T t(X;14)(p11.4;q32.33) is recurrent in marginal zone lymphoma and up‐regulates GPR34 Haematologica 2012 97 2 184 188 10.3324/haematol.2011.052639 22058210 PMC3269475 34 Lenaerts L Brison N Maggen C Comprehensive genome‐wide analysis of routine non‐invasive test data allows cancer prediction: a single‐center retrospective analysis of over 85,000 pregnancies EClinicalMedicine 2021 35 100856 10.1016/j.eclinm.2021.100856 34036251 PMC8138727 35 Drexler HG Ehrentraut S Nagel S Eberth S MacLeod RAF Malignant hematopoietic cell lines: In vitro models for the study of primary mediastinal B‐cell lymphomas Leuk Res 2015 39 1 18 29 10.1016/j.leukres.2014.11.002 25480038 36 Dai H Ehrentraut S Nagel S Genomic landscape of primary mediastinal B‐cell lymphoma cell lines PLoS One 2015 10 11 e0139663 10.1371/journal.pone.0139663 26599546 PMC4657880 37 Nguyen DK Disteche CM Dosage compensation of the active X chromosome in mammals Nat Genet 2006 38 1 47 53 10.1038/ng1705 16341221 38 Jensen PL The interleukin 13 receptor complex Stem Cells 2000 18 1 61 62 10.1634/stemcells.18-1-61 10661573 39 Junttila IS Tuning the cytokine responses: an update on interleukin (IL)‐4 and IL‐13 receptor complexes Front Immunol 2018 9 9 888 10.3389/fimmu.2018.00888 29930549 PMC6001902 40 Jiang H Harris MB Rothman P IL‐4/IL‐13 signaling beyond JAK/STAT J Allergy Clin Immunol 2000 105 6 Pt 1 1063 1070 10.1067/mai.2000.107604 10856136 41 Formentini A Braun P Fricke H Link KH Henne‐Bruns D Kornmann M Expression of interleukin‐4 and interleukin‐13 and their receptors in colorectal cancer Int J Colorectal Dis 2012 27 10 1369 1376 10.1007/s00384-012-1456-0 22441356 42 Zhang Y Zhu K Wang X Zhao Y Shi J Liu Z Roles of IL‐4, IL‐13, and their receptors in lung cancer J Interferon Cytokine Res 2024 44 9 399 407 10.1089/jir.2024.0008 38516928 43 Nourbakhsh M Kalble S Dorrie A Hauser H Resch K Kracht M The NF‐kappa b repressing factor is involved in basal repression and interleukin (IL)‐1‐induced activation of IL‐8 transcription by binding to a conserved NF‐kappa b‐flanking sequence element J Biol Chem 2001 276 6 4501 4508 10.1074/jbc.M007532200 11071890 44 Li Y Zu L Wu H MiR‐192/NKRF axis confers lung cancer cell chemoresistance to cisplatin via the NF‐κB pathway Thorac Cancer 2022 13 3 430 441 10.1111/1759-7714.14278 34953057 PMC8807278 45 Rosenwald A Wright G Leroy K Molecular diagnosis of primary mediastinal B cell lymphoma identifies a clinically favorable subgroup of diffuse large B cell lymphoma related to Hodgkin lymphoma J Exp Med 2003 198 6 851 862 10.1084/jem.20031074 12975453 PMC2194208 46 Savage KJ The molecular signature of mediastinal large B‐cell lymphoma differs from that of other diffuse large B‐cell lymphomas and shares features with classical Hodgkin lymphoma Blood 2003 102 12 3871 3879 10.1182/blood-2003-06-1841 12933571 47 Poudrier J Graber P Herren S A novel monoclonal antibody, C41, reveals IL‐13Rα1 expression by murine germinal center B cells and follicular dendritic cells Eur J Immunol 2000 30 11 3157 3164 10.1002/1521-4141(200011)30:11&#x0003c;3157::AID-IMMU3157&#x0003e;3.0.CO;2-H 11093130 48 Skinnider BF Interleukin 13 and interleukin 13 receptor are frequently expressed by Hodgkin and Reed‐Sternberg cells of Hodgkin lymphoma Blood 2001 97 1 250 255 10.1182/blood.v97.1.250 11133768 49 Cheng J Novati G Pan J Accurate proteome‐wide missense variant effect prediction with AlphaMissense Science 2023 381 eadg7492 10.1126/science.adg7492 37733863 50 Warmuth M Kim S Gu X Xia G Adrián F Ba/F3 cells and their use in kinase drug discovery Curr Opin Oncol 2007 19 1 55 60 10.1097/CCO.0b013e328011a25f 17133113 51 Özdemir BC Richters A Espinosa da Silva C Berner AM Cancer researchers' perceptions of the importance of the sex of cell lines, animals, and human samples for cancer biology research iScience 2023 26 4 106212 10.1016/j.isci.2023.106212 37153448 PMC10156586 52 Joos S Otano‐Joos M Ziegler S Primary mediastinal (thymic) B‐cell lymphoma is characterized by gains of chromosomal material including 9p and amplification of the REL gene Blood 1996 87 4 1571 1578 10.1182/blood.V87.4.1571.bloodjournal8741571 8608249 53 Bentz M Barth TFE Brüderlein S Gain of chromosome arm 9p is characteristic of primary mediastinal B‐cell lymphoma (MBL): comprehensive molecular cytogenetic analysis and presentation of a novel MBL cell line Genes Chromosom Cancer 2001 30 4 393 401 doi:10.1002/1098-2264(2001) 11241792 10.1002/1098-2264(2001)9999:9999<::aid-gcc1105>3.0.co;2-i 54 Palanisamy N Abou‐Elella AA Chaganti SR Similar patterns of genomic alterations characterize primary mediastinal large‐B‐cell lymphoma and diffuse large‐B‐cell lymphoma Genes Chromosom Cancer 2002 33 2 114 122 10.1002/gcc.10016 11793437 55 Kimm LR DeLeeuw RJ Savage KJ Frequent occurrence of deletions in primary mediastinal B‐cell lymphoma Genes Chromosom Cancer 2007 46 12 1090 1097 10.1002/gcc.20495 17823928 56 Balaton BP Cotton AM Brown CJ Derivation of consensus inactivation status for X‐linked genes from genome‐wide studies Biol Sex Differ 2015 6 1 35 10.1186/s13293-015-0053-7 26719789 PMC4696107 57 Carrel L Brown CJ When the Lyon(ized chromosome) roars: ongoing expression from an inactive X chromosome Philos Trans R Soc Lond B Biol Sci 2017 372 1733 20160355 10.1098/rstb.2016.0355 28947654 PMC5627157 58 Wainer Katsir K Linial M Human genes escaping X‐inactivation revealed by single cell expression data BMC Genomics 2019 20 1 201 10.1186/s12864-019-5507-6 30871455 PMC6419355 59 Hagen SH Henseling F Hennesen J Heterogeneous escape from X chromosome inactivation results in sex differences in type I IFN responses at the single human pDC level Cell Rep 2020 33 10 108485 10.1016/j.celrep.2020.108485 33296655 PMC7833293 60 Balaton BP Brown CJ Contribution of genetic and epigenetic changes to escape from X‐chromosome inactivation Epigenet Chromatin 2021 14 1 30 10.1186/s13072-021-00404-9 PMC8244145 34187555 61 Silva A Almeida ARM Cachucho A Overexpression of wild‐type IL‐7Rα promotes T‐cell acute lymphoblastic leukemia/lymphoma Blood 2021 138 12 1040 1052 10.1182/blood.2024024693 33970999 PMC8462360 62 Calvo KR Traverse‐Glehen A Pittaluga S Jaffe ES Molecular profiling provides evidence of primary mediastinal large B‐cell lymphoma as a distinct entity related to classic Hodgkin lymphoma: implications for mediastinal gray zone lymphomas as an intermediate form of B‐cell lymphoma Adv Anat Pathol 2004 11 5 227 238 10.1097/01.pap.0000138144.11635.f8 15322489 63 Guiter C Dusanter‐Fourt I Copie‐Bergman C Constitutive STAT6 activation in primary mediastinal large B‐cell lymphoma Blood 2004 104 2 543 549 10.1182/blood-2003-10-3545 15044251 64 Rui L Emre NCT Kruhlak MJ Cooperative epigenetic modulation by cancer amplicon genes Cancer Cell 2010 18 6 590 605 10.1016/j.ccr.2010.11.013 21156283 PMC3049192 65 Viganò E Gunawardana J Mottok A Somatic IL4R mutations in primary mediastinal large B‐cell lymphoma lead to constitutive JAK‐STAT signaling activation Blood 2018 131 18 2036 2046 10.1182/blood-2017-09-808907 29467182 66 Ohshima K Akaiwa M Umeshita R Suzumiya J Izuhara K Kikuchi M Interleukin‐13 and interleukin‐13 receptor in Hodgkin's disease: possible autocrine mechanism and involvement in fibrosis Histopathology 2001 38 4 368 375 10.1046/j.1365-2559.2001.01083.x 11318902 67 Green MR Monti S Rodig SJ Integrative analysis reveals selective 9p24.1 amplification, increased PD‐1 ligand expression, and further induction via JAK2 in nodular sclerosing Hodgkin lymphoma and primary mediastinal large B‐cell lymphoma Blood 2010 116 17 3268 3277 10.1182/blood-2010-05-282780 20628145 PMC2995356 68 Buedts L Wlodarska I Finalet‐Ferreiro J The landscape of copy number variations in classical Hodgkin lymphoma: a joint KU Leuven and LYSA study on cell‐free DNA Blood Adv 2021 5 7 1991 2002 10.1182/bloodadvances.2020003039 33843986 PMC8045498 69 Sirchia SM Ramoscelli L Grati FR Loss of the inactive X chromosome and replication of the active X in BRCA1 Cancer Res 2005 65 6 2139 2146 10.1158/0008-5472.CAN-04-3465 15781624 70 Pageau GJ Hall LL Ganesan S Livingston DM Lawrence JB The disappearing Barr body in breast and ovarian cancers Nat Rev Cancer 2007 7 8 628 633 10.1038/nrc2172 17611545 71 Caramia F Speed TP Shen H Haupt Y Haupt S Establishing the link between X‐chromosome aberrations and TP53 status, with breast cancer patient outcomes Cells 2023 12 18 2245 10.3390/cells12182245 37759468 PMC10526523 72 Richardson AL Wang ZC De Nicolo A X chromosomal abnormalities in basal‐like human breast cancer Cancer Cell 2006 9 2 121 132 10.1016/j.ccr.2006.01.013 16473279 73 Sirchia SM Tabano S Monti L Misbehaviour of XIST RNA in breast cancer cells PLoS One 2009 4 5 e5559 10.1371/journal.pone.0005559 19440381 PMC2679222 74 Garje R Elhag D Yasin HA Acharya L Vaena D Dahmoush L Comprehensive review of chromophobe renal cell carcinoma Crit Rev Oncol Hematol 2021 160 103287 10.1016/j.critrevonc.2021.103287 33753250 75 Achom M Sadagopan A Bao C bioRxiv 10.1101/2023.08.04.552029 PMC11455617 39168126 76 Di Oto E Monti V Cucchi MC Masetti R Varga Z Foschini MP X chromosome gain in male breast cancer Hum Pathol 2015 46 12 1908 1912 10.1016/j.humpath.2015.08.008 26475094 77 Kawakami T Zhang C Taniguchi T Characterization of loss‐of‐inactive X in Klinefelter syndrome and female‐derived cancer cells Oncogene 2004 23 36 6163 6169 10.1038/sj.onc.1207808 15195139 78 Syrett CM Anguera MC When the balance is broken: X‐linked gene dosage from two X chromosomes and female‐biased autoimmunity J Leukoc Biol 2019 106 4 919 932 10.1002/JLB.6RI0319-094R 31125996 PMC7206452 79 Mousavi MJ Mahmoudi M Ghotloo S Escape from X chromosome inactivation and female bias of autoimmune diseases Mol Med 2020 26 1 127 10.1186/s10020-020-00256-1 33297945 PMC7727198 80 Youness A Miquel CH Guéry JC Escape from X chromosome inactivation and the female predominance in autoimmune diseases Int J Mol Sci 2021 22 3 1114 10.3390/ijms22031114 33498655 PMC7865432 81 Suzuki A Leland P Joshi BH Puri RK Targeting of IL‐4 and IL‐13 receptors for cancer therapy Cytokine 2015 75 1 79 88 10.1016/j.cyto.2015.05.026 26088753 82 Bernstein ZJ Shenoy A Chen A Heller NM Spangler JB Engineering the IL‐4/IL‐13 axis for targeted immune modulation Immunol Rev 2023 320 1 29 57 10.1111/imr.13230 37283511 ",
  "metadata": {
    "Title of this paper": "Engineering the IL‐4/IL‐13 axis for targeted immune modulation",
    "Journal it was published in:": "HemaSphere",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12475935/"
  }
}