{
  "title": "Paper_19",
  "abstract": "pmc Invest Radiol Invest Radiol 2035 lwwopen RLI Investigative Radiology 0020-9996 1536-0210 pmc-is-collection-domain yes pmc-collection-title Lippincott Open Access PMC12490344 PMC12490344.1 12490344 12490344 40574249 10.1097/RLI.0000000000001208 IR-D-25-00088 1 3 Review Articles Gadolinium Deposition in Bone Tissues After Contrast-enhanced Magnetic Resonance Imaging A Comprehensive Review https://orcid.org/0000-0002-4551-422X Fretellier Nathalie PhD nathalie.fretellier@guerbet-group.com Idée Jean-Marc PharmD jeanmarcidee@gmail.com Rasschaert Marlène PhD marlene.rasschaert@guerbet.com Factor Cécile PhD cecile.factor@guerbet.com Van der Molen Aart J. MD a.j.van_der_molen@lumc.nl GUERBET, Research Division, Roissy CDG, France (F.N., I.J-M., R.M., F.C.); Contrast Media Safety Research Group, Department of Radiology C-2S, Leiden University Medical Center, Leiden, The Netherlands (V.d.M.A.J.) Correspondence to: Nathalie Fretellier, PhD, GUERBET, Research Division, BP 57400, Roissy CDG 95943, France. E-mail: nathalie.fretellier@guerbet.com 11 2025 12 8 2025 60 11 498189 722 744 31 1 2025 18 4 2025 02 10 2025 03 10 2025 03 10 2025 Copyright © 2025 The Author(s). Published by Wolters Kluwer Health, Inc. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution-Non Commercial-No Derivatives License 4.0 (CCBY-NC-ND) Over the past 15 years, significant advancements have been made in understanding the pharmacology and toxicology of gadolinium-based contrast agents (GBCAs), widely used in magnetic resonance imaging (MRI). This review focuses on the fate of gadolinium cation (Gd 3+ 3+ 3+ Key Words: contrast media gadolinium bone adverse drug effect pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes OPEN-ACCESS TRUE KEY POINTS  Review of the complex interactions between Gd and bone matrix components, such as hydroxyapatite, collagen, and proteoglycans. Investigation of the potential interaction of Gd with bone remodelling processes. Magnetic resonance imaging (MRI) has revolutionized medical diagnosis, providing detailed images of the body’s internal structures. A key component in enhancing the quality of these images is the use of contrast agents. Among these, gadolinium-based contrast agents (GBCAs) have become indispensable due to their effectiveness in improving the visibility of tissues and organs. Basically, GBCAs are complexes containing the lanthanide element gadolinium (Gd), chelated to a carrier ligand. The stability of the Gd-ligand form is governed by 2 interdependent fundamental concepts: (a) the thermodynamic stability (which describes the strength of the link between Gd and its ligand) and (b) the kinetic stability (which defines the inertness of the Gd complex toward dechelation and is estimated by measuring the rate of its dissociation into free Gd and free ligand). 1 2 5 Contrary to the concepts that prevailed for a long time after the launch of GBCAs, animal studies demonstrated the prolonged presence of Gd, regardless of the speciation (ie, the different chemical forms of Gd present), in many tissues, including the bone, after single or repeated intravenous (IV) administration of these molecules. They also showed that this retention was substantially greater with linear GBCAs than macrocyclic ones. 6 13 10 11 14 16 The biodistribution of GBCAs has been the subject of studies that have challenged the classical concept that GBCAs are exclusively extracellular water markers and totally eliminated via the kidneys, except for molecules with a more lipophilic feature (gadobenate, gadoxetate), which are also excreted, in part, via the bile. 17 18 21 The purpose of this literature review is to identify and discuss the potential interaction of GBCAs with bone tissue, including the possible clinical consequences. BONE TISSUE Bone Structure Overall, the adult human skeleton is composed of cortical bone and trabecular (cancellous) bone (Figs. 1 2 2 23 25 26 26 FIGURE 1 Structure of a long bone. Illustration built from the free PowerPoint image bank Servier Medical Art: http://smart.servier.fr/servier-medical-art FIGURE 2 Cortical and trabecular structure of bone in humans (A) and rodents (D) and remodelling (B, C). (A) In humans, the outer bone layer has primary lamellar bone, which is later replaced by osteonal (Haversian) bone. Blood vessels running across the bone are called Volkmann’s canals. (B) Osteonal bone remodeling with osteoclasts removing old bone and osteoblasts filling the space with new bone, forming a small canal and a new osteon. (C) Surface bone remodeling (including trabecular and endocortical remodelling, which are common to all species) where osteoclasts remove old bone, and osteoblasts replace it with new bone. Reversal cells line the bone surface between these activities. (D) Rodent cortical bone is thinner and lacks osteons. It has lamellar bone near the outer surface and immature woven bone near the growth plate. Volkmann's canals run across the bone. Remodelling happens on endocortical and trabecular surfaces, not within the cortex. Reproduced with permission from Koh et al. 22 The mineralized connective tissue of cortical bone associates four categories of cells: osteoblasts, flat and quiescent bone lining cells, osteocytes (the vast majority of total bone cells), and osteoclasts. 27 28 Typically, the extracellular matrix of bone tissue is composed of 5% to 10% water, 50% to 70% inorganic material including bioapatite (ie, an alkaline carbonate-containing hydroxyapatite (HAP) [Ca 10 4 6 2 29 30 30 32 30 32 Bone marrow is classically regarded as a single compartment. The basic structure of bone marrow is of 2 types: red and yellow. Red bone marrow represents the major tissue for haematopoiesis (ie, the formation of blood cellular components) and is thus in charge of the production of erythrocytes, granulocytes, monocytes, platelets, and dendritic cells. 33 34 It is worth mentioning that there is no lymphatic drainage system in the bone marrow. 35 Bones are richly supplied with blood vessels and receive 5% to 10% of cardiac output. 36 37 Bone tissue hypoxia is usually accompanied by acidosis. Bone cells are highly sensitive to acidosis, which inhibits the mineral deposition by osteoblasts and activates osteoclast-induced matrix resorption. These effects favor the availability of hydroxyl ions from HAP in solution, where they buffer excess protons associated with hypoxia. 38 Cartilage 39 Bone Remodelling Bone remodelling (Figs. 2 40 41 27 27 42 2+ 27 43 In the absence of disease, the median duration of the remodelling cycle of cortical bone is 120 days, while it is about 200 days in trabecular bone in the human species. 44 45 46 Alternatively, new bone formation can occur through modelling, which does not require prior bone resorption, unlike remodelling. 47 48 In contrast, bone remodelling in rats is faster due to their smaller size and higher metabolic rate, often completing within a few weeks. 22 49 A common criticism against rodent models for bone research is the suggestion that their bones are continually growing. 22 The differences in bone remodelling between humans and rats reflect their distinct physiological and mechanical needs. This means that rodents have no requirement for the complex remodelling processes developed in larger mammalian skeletons, including humans. PRESENCE OF Gd IN THE BONE OF GBCA-TREATED PATIENTS OR IN ANIMAL MODELS Table 1 54 80 TABLE 1 Studies Investigating GBCA Uptake in the Bone Matrix by Gd Concentration Measurement Species References GBCA(s) tested Dosing scheme Duration of follow-up Bone Technique Range of [Gd] Main results Human Gibby et al 50 Gadodiamide Single adm. of 0.1 mmol/kg Between 3 and 8 d Femoral head ICP-AES 7.50 nmol/g Gadodiamide: 2.5× more [Gd] than gadoteridol Gadoteridol 2.96 nmol/g White et al 51 Gadodiamide Single adm. of 0.1 mmol/kg ~ 4-5 d after adm. Femoral head ICP-MS 11.26 nmol/g (4.26-17.68) Gadodiamide: ~4× higher [Gd] than gadoteridol Gadoteridol 3.03 nmol/g (1.27-6.87) Darrah et al 52 Gadodiamide NA Up to 8 y Femoral head ICP-MS Osteoarthritis patients: Trabecular Cortical Trabecular: Cortical Gd retained up to 8 y Murata et al 53 Gadobenate 1-11 adm. IV (total dose of 5-126 mL) Up to ~4 mo Cortical bone from rib ICP-MS 15.14 nmol/g [Gd] in bone ~23× [Gd] in brain (no comparison of GBCAs due to the low number of patients/GBCA) Gadoxetate 8.27 nmol/g Gadobutrol 33.58 nmol/g Gadoteridol 0.60-10.30 nmol/g Lord et al 54 Gadobutrol 0.1 or 0.2 mmol/kg IV 5 y after adm Tibia In vivo x-ray fluorescence (XRF) 7.7 * Feasibility of the non-invasive XRF technique. Gd retained in bone after 1 single injection. Turyanskaya et al 55 NA NA 8 mo after adm. Transiliac crest Micro synchrotron radiation (SR)-XRF NA Structures prone to Gd accumulation: cement lines and vascular pore walls. Kobayashi et al 56 Gadobenate Single or multiple IV adm. 14-471 d after last adm. Rib ICP-MS 0.64 nmol Gd/g/mmol GBCA (0.16-1.57) [Gd] in bone 4.4-fold higher for gadobenate group vs. gadoteridol Gadoteridol 0.15 nmol/g/mmol GBCA (0.02-2.48) Mice (adult, healthy) Wedeking and Tweedle 6 153 Single adm. of 0.20-0.26 mmol/kg IV Up 28 d Femur Gamma counting 0.014 (day 1)-1.9 (5 min) %ID/g-tissue Dissociation of gadopentetate but not gadoterate suggested. 153 0.0010 (day 28)-1.9 (5 min) %ID/g-tissue 153 0.83 (day 14)-1.61 (day 7) %ID/g-tissue Tweedle et al 7 153 0.48 mmol/kg IV Up to 14 d Femur Gamma counting NA At longer residence times, linear GBCAs have more Gd sequestered in bone than macrocyclic GBCAs, and no difference between the 2 macrocyclic GBCAs Gadodiamide 0.050 (day 7)-2.3 (5 min) %ID/g-tissue Gadoteridol (<0.003 from day 7) 0.030 (day 1)-2.6 (5min) %ID/g-tissue Gadopentetate 0.014 (day 7)-2.1 (5 min) %ID/g-tissue Gadoterate (<0.004 day 14) 0.028 (day 7)-2.7%ID/tissue Di Gregorio et al 57 Gadoteridol Cumulated 1.2 mmol/kg IV (single or repeated adm. of 0.1 mmol/kg/adm), Various protocols 21 d or 3 mo after last adm. NA ICP-MS 0.40 nmol/g of dry tissue Long-term retention (3 mo) in bone with both GBCAs, with [Gd] for gadodiamide>gadoteridol Gadodiamide 13.80 nmol/g of dry tissue (11.45 * * Davies et al 58 Gadodiamide Single adm. of 0.6 mmol/kg IV Up to 20 wk Femur ICP-MS 12.73 (day 1)-81.69 (week 10) nmol/g No Gd washout in the femur observed between 1 day and 20 wk Nakamura et al 59 Gadodiamide Single adm. at different dose levels (0.165-3.308 mmol/kg IV for GBCA—0.033-0.165 mmol/kg IV for Gd(NO 3 3 7 d after adm. NA ICP-OES  At 0.165 nmol/kg At 1.654 nmol/kg [Gd]: Gd nitrate >gadodiamide>gadobutrol 7 d after single adm Gadobutrol  At 0.033 nmol/kg At 0.165 nmol/kg Gd nitrate  At 0.165 nmol/kg At 3.308 nmol/kg Rat (adult, healthy) Tweedle et al 7 153 Single adm. of 0.1 mmol/kg IV Up to 14 d Femur Gamma counting NA At longer residence times, linear GBCAs at more Gd sequestered in bone than macrocyclic GBCAs and no difference between macrocyclic GBCAs. Gadodiamide 0.033 (day 14)-0.041 (day 7) % ID/g-tissue Gadoteridol (<0.003 from day 7) 0.008 (day 1) % ID/g-tissue Gadopentetate 0.007 (day 14)-0.010 (day 1) % ID/g-tissue Gadoterate 0.005 (day 14)-0.013 (day 1) % ID/g-tissue Sieber et al 60 Gadodiamide Total of 20 adm. with cumulative dose of 50 mmol/kg IV: 5 daily IV/week, 4 wk, 2.5 mmol/kg/adm 5 d after last adm. Femur ICP-AES 580 * [Gd] gadodiamide>all other GBCAs. Gadoversetamide 365 * Gadopentetate 215 * Gadobenate 110 * Gadobutrol 55 * Gadoterate 48 * Steger-Hartmann et 8 Gadopentetate 15x IV daily admin. 0.5 mmol/kg 56-93 wk after adm. NA ICP-MS 16 * * High [Gd], no decrease even ~2 y after last admin Lohrke et al 61 Gadodiamide 20×2.5 mmol Gd/kg/adm. 8 wk after last adm. Femur ICP-MS 625 * [Gd] gadodiamide>gadopentetate>macrocyclic GBCAs Gadopentetate 250 * Gadoteridol 38 * Gadobutrol 39 * Bussi et al 62 Gadobutrol Total of 20 adm: 4 daily IV/week, 5 wk, 0.6 mmol/kg 28 d of recovery Femur ICP-MS 8.60 nmol/g [Gd] gadobutrol>gadoteridol>gadoterate but in the same range of [Gd] Gadoteridol 7.48 nmol/g Gadoterate 5.69 nmol/g Bussi et al 63 Gadoteridol Total of 20 adm.: 0.6 mmol/kg IV, 4× week, 5 wk. 28 d of recovery Femur ICP-MS 8.48 nmol/g [Gd] gadobutrol >all other macrocyclic GBCAs Gadobutrol 16.1 nmol/g Gadoterate (Dotarem®) 6.28 nmol/g Gadoterate (Clariscan®) 9.44 nmol/g Ringler et al 64 Gadodiamide 1-2 µmol and 0.2-0.4 mmol by intra-articular admin. 3 d after adm. Joint (J) ICP-MS J: High dose High dose Low dose Higher [Gd] in joint tissue and bone marrow with gadodiamide vs. gadobutrol Gadobutrol J: High dose Low dose High dose Low dose Schlatt et al 16 Gadodiamide 2.4 mmol/kg IV x 1/week, for 5 wk (cumulative dose of 12 mmol/kg) Sacrifice 1 mo after last adm. Femur [diaphysis (ie, cortical bone) and bone marrow] HILIC-ICP-MS 171 nmol/g (128-218) Higher Gd concentration with linear GBCA with different biodistribution behavior between both classes: Macrocyclic GBCAs: [Gd] cortical bone = [Gd] bone marrow Gadoterate 9.3 nmol/g (4.4-14.6) Gadobenate 51.6 nmol/g (41.7-76.7) Gadoteridol 4.4 nmol/g (3.4-6.4) Gadobutrol 6.5 nmol/g (4.0-10.0) Funke et al 15 Gadobutrol 2.4 mmol/kg IV x 1/week, for 5 wk (cumulative dose of 12 mmol/kg) Sacrifice 1, 3, and 12 mo after last adm. Femur LA-ICP-MS 6.5-17 nmol/g: (M)17 / (F)12 at M1 [Gd] gadodiamide = 10 × [Gd] gadobutrol Gadodiamide 97-200 nmol/g: (M)200 / (F)130 at M1 Rat (adult, renal failure) Haylor et al 9 Gadodiamide Single admin. 2.5 mmol/g IV 28 d after adm. Femur ICP-MS  Sham GFR <40% : GFR <20% [Gd] positively correlated to [SCr] at 28 d after adm. Fretellier et al 14 Gadodiamide 5 daily IV admin., 1 wk, 2.5 mmol/kg/adm (cumulative dose of 12.5 mmol/kg) 5 d after last adm. Femur epiphysis ICP-MS 353.1 nmol/g Dissociation of gadodiamide and release of soluble Gd species, no effect measured with gadoterate Non-formulated gadodiamide 631.4 nmol/g Gadoterate 98.8 nmol/g Fretellier et al 65 Gadodiamide 5 daily IV admin., 1 wk, 2.5 mmol/kg/adm. (cumulative dose of 12.5 mmol/kg) 3 wk after last adm. Femur epiphysis ICP-MS 225 * Gadodiamide [Gd]>other groups 25 d after 1st adm. Gadobenate 60 * Gadobutrol 40 * Gadoterate 35 * Haylor et al 66 Gadodiamide 5 daily IV admin., 1 wk, 2.5 mmol/kg/adm (cumulative dose of 12.5 mmol/kg) 4 wk after adm. NA ICP-MS 450 * Gadodiamide [Gd]>[Gd] gadoterate 28 d after 1st adm. Gadoterate 50 * Fretellier et al 10 Gadodiamide 5 daily IV admin., 1 wk, 2.5 mmol/kg (cumulative dose of 12.5 mmol/kg) 3 wk after adm. Femur epiphysis ICP-MS 220 * Gadopentetate and gadodiamide [Gd]>other GBCA [Gd] 25 d after 1st adm. Gadopentetate 110 * * Gadobenate 34 * * Gadobutrol 34 * * Gadoterate 25 * * Fretellier et al 67 Gadodiamide 5×2.5 mmol/kg in 1 wk (cumulative dose of 12.5 mmol/kg) 4 wk after adm. Femur epiphysis ICP-MS 306.3 nmol/g (235 * * Gadodiamide [Gd]>all other GBCAs 28 d after 1st adm. Gadopiclenol 69.6 nmol/g (38 * * Gadobutrol 50.3 nmol/g (38 * * Gadoterate 56.3 nmol/g (28 * * Mouse (adult, renal failure) Kartamihardja et al 68 GdCl 3 GBCA: 5×5 mmol/kg IV/week, for 4 wk, GdCl 3 3 or 45 d Femur ICP-MS  Control * Kidney failure * Gadodiamide [Gd]>gadoterate [Gd] Gadodiamide  Control Control Kidney failure Kidney failure Gadoterate  Control Control Kidney failure Rat (adult, ovariectomized, osteoporotic) Wáng et al 69 Gadodiamide 17.5 mmol/kg IV cumulated over 5 d 10 wk after adm. Femur ICP-MS 117 * * * Gadodiamide [Gd]>[Gd] gadoterate Gadoterate 4 * * * Rat (adult, with sepsis) Damme et al 70 Gadobenate Single adm. of 0.2 mmol/kg in normal or rats induced with sepsis Up to 6 wk Femur ICP-MS LPS: 1.61 (week 6)-2.51 (24 h) nmol/g Control Transient higher Gd retention in bone in rats with sepsis compared with controls Rat (juvenile) Fretellier et al 71 Gadodiamide 5×2.5 mmol/kg IV between PND 4 and 18 1 wk after last adm. Femur ICP-MS Study 1: 50 * * * Study 2 * * * Gadodiamide [Gd])>[Gd] gadoterate at PND 25 Gadoterate  Study 1 * * * Study 2 * * * Giorgi et al 72 Gadoterate Single adm at PND10 (A, D) or 6 adm (B, C) from PND10 to 30 24-48 h (B, D) or 60 d (A, C) after last adm. Femur ICP-MS  At 0.6 mmol/kg : At 1.25 mmol/kg injected At 2.5 mmol/kg Quantifiable Gd in bone immediately after adm. but [Gd] < LOQ at the end of the 60-day treatment-free period. Bussi et al 73 Gadobenate Single adm at PND10 (A, D) or 6 adm (B, C) from PND10 to 30 24-48 h (B, D) or 60 d (A, C) after last adm. Femur ICP-MS  At 0.6 mmol/kg : At 1.25 mmol/kg At 2.50 mmol/kg : Gd present in all tested groups. Fretellier et al 74 Gadodiamide 20×0.6 mmol/kg IV 11-12 wk after adm. Femur [diapysis (ie, cortical); epiphysis (ie, trabecular); bone marrow] ICP-MS Adult: BM Cortical bone Trabecular bone BM Cortical bone Trabecular bone [Gd] gadodiamide>gadoterate. Gadoterate Adult: BM Cortical bone Trabecular bone BM Cortical bone Trabecular bone Juvenile mouse (after in utero exposure) Erdene et al 75 Gadodiamide 2.0 mmol/kg IV to pregnant mothers, from GD16 to GD19. Postnatal day (PND) 28 NA ICP-MS  Maternal Nonpregnant Pup Gadodiamide [Gd]>gadoterate [Gd] Gadoterate  Maternal Nonpregnant Pup Juvenile nonhuman primate (after in utero exposure) Oh et al 76 Gadoteridol Single adm. of 0.1 mmol/kg on GD128 or 129 19-45 h after adm. Femur or calvarium ICP-MS  Control : Tissue [Gd] levels in fetuses <<< dams Prola-Netto et al 77 Gadoteridol 2×0.1 mmol/kg, on GD85 and 135 For 7 mo after delivery Articular head of the femur ICP-MS  Control -5 -5 -5 -5 Gd cleared from tissues 7 mo after delivery, except in liver and bone where Gd is measurable. But extremely low levels observed in femur (2.5×10-5%ID injected dose/g) Juvenile nonhuman primate Smieja et al 78 Gadodiamide 8×0.3 or 0.9 mmol/kg 1 or 12 mo Femur (with or without knee joint) ICP-MS  At 0.3 mmol/kg At 0.9 mmol/kg Gadodiamide [Gd]>gadobenate [Gd]>gadobutrol [Gd] Gadobenate  At 0.3 mmol/kg At 0.9 mmol/kg Gadobutrol  At 0.3 mmol/kg At 0.9 mmol/kg Sheep (adult) Richter et al 79 Gadobutrol, Gadoteridol, Gadoterate, Gadodiamide and Gadobenate Single adm. of 0.1 mmol/kg 10 wk Femur heads and shafts LA-ICP-MS 0 * * Both linear GBCAs resulted in considerably higher Gd concentration than macrocyclic GBCAs. No difference between macrocyclic GBCAs. Rabbit (adult) Zhang et al 80 Gadobutrol 5×0.3 or 0.9 mmol/kg per week for 4 wk 4 wk Cortical tibial MRI (3D UTE-QSM) NA Linear correlation between Gd in cortical bone and QSM value, suggesting the feasibility of 3D UTE-Cones-QSM as a sensitive noninvasive assessment of Gd deposition in cortical bone  * Estimation of values based on the graphical representation of data. Adm indicates administration; BM, bone marrow; (F), female; Gd, gadolinium; [Gd], concentration of elemental Gd; GD, gestation day; GFR, glomerular filtration rate; HILIC, hydrophylic interaction liquid chromatography; ICP-AES, inductive coupled plasma atomic emission spectroscopy; ICP-MS, inductively coupled plasma mass spectroscopy; ICP-OES, inductively coupled plasma optical emission spectroscopy; J, joint; LA-ICP-MS, laser ablation inductively coupled plasma mass spectroscopy; LOQ, limit of quantification; LPS, lipopolysaccharide; M, month; (M), male; NA: information not available; PND, postnatal day; [SCr], serum creatinine level; XRF: x-ray fluorescence. Based on the available data (Table 1 52 52 52 54 51 56 15 16 61 66 74 75 78 62 63 It has been demonstrated that there is almost no washout for all GBCAs, 8 15 58 78 8 In most nonclinical data, the Gd concentrations found in femoral diaphysis (ie, mainly cortical bone) and femoral epiphysis (ie, mainly trabecular bone) are generally similar, although there is a tendency to observe higher concentrations in epiphysis (ie, trabecular bone). 74 52 15 3 55 79 FIGURE 3 Spatial Gd distribution in rat femur. Comparison of elemental imaging in the femur of a male gadodiamide-treated rats (A) 1 month (M1), (B) 3 months (M3), and (C) 12 months (M12) after the injection. Each panel depicts an overlay of calcium (blue), iron (green), and gadolinium distribution (red). Co-localizations are visualized of gadolinium and calcium (magenta), gadolinium and iron (yellow), and all 3 elements (white). Reproduced with permission from Funke et al. 15 The form of Gd present in bone will be discussed in the dedicated section “gadolinium speciation in bone” hereafter. GADOLINIUM UPTAKE IN BONE MARROW A recent post hoc analysis 81 81 82 Significant toxicological consequences may arise if GBCAs infiltrate the bone marrow and locally release dissociated gadolinium. The International Commission on Radiological Protection (ICRP) constructed a generic biokinetics model to estimate the behaviour of the Lanthanides (Ln 3+ 83 3+ 83 3+ Table 2 TABLE 2 Distribution of Gadolinium in the Bone Compartments (Mineral Bone vs. Bone Marrow) After GBCA Administration Age Species GBCA tested Elemental [Gd] References Adults Rat 14 BM>cortical (up to 24 h after single adm.) Nakamura et al 84 Rat 14 BM>cortical (up to 3 d after single adm.) Kindberg et al 85 Rat Gadodiamide Linear GBCAs>macrocyclic GBCAs (1 mo after last adm.; repetead adm) Schlatt et al 16 Rat Gadodiamide [Gd] gadodiamide = 10 × [Gd] gadobutrol (up to 12 mo after adm.; repeated adm.) Funke et al 15 Rat Gadodiamide Gadodiamide>>gadoterate (11-12 wk after last adm.; repeated adm) Fretellier et al 74 Sheep Gadobutrol, Gadoteridol, Gadoterate, Gadodiamide, Gadobenate Gd deposits restricted to distinct bone and cartilage compartments, such as in bone linings, cement lines, and bone cartilage junctions. (10 wk after single adm.) Richter et al 79 Juveniles Rat Gadodiamide Gadodiamide>>gadoterate (11-12 wk after last adm; repeated adm.) Fretellier et al 74 Adm. indicates administration; BM, bone marrow. Two nonclinical studies compared linear and macrocyclic GBCAs in terms of Gd concentrations in cortical bone and red bone marrow of adult rats, 1 month 16 3 74 4 3 16 4 74 86 74 16 15 TABLE 3 Total Gd Concentration and Percentage of Intact GBCA Measured 1 Month Postinjection Period, in the Cortical Femur and Bone Marrow of Rats Injected With 12 mmol Gd/kg Over 5 Weeks 16 Studied matrix Cortical bone (diaphysis) Bone marrow GBCA Total Gd concentration (nmol/g) % Intact GBCA (%) Total Gd concentration (nmol/g) % Intact GBCA (%) Gadoterate 9.3±4.4 7.7±5.1% 9.5±4.0 15.3±4.7% Gadodiamide 171±34 < LOQ 30.3±8.0 <LOQ Gadobenate 51.6±13.1 2.2±0.6% 19.5±5.8 <LOQ Gadobutrol 6.5±2.6 26.7±8.8% 6.6±2.9 4.8±1.4% Gadoteridol 4.4±1.2 28.7% 3.5±1.5 <LOQ FIGURE 4 Role of age on total Gd concentration in different femur structures. Assessment ∼3 months after repeated administration (20×0.6 mmol/kg/adm) of gadodiamide or gadoterate in adult or juvenile rats (from Fretellier et al 74 Otherwise, a species-related effect cannot be ruled out. For example, in a recent study performed in adult sheep, no substantial Gd were detected in the bone marrow of epiphysis and diaphysis 10 weeks after a single administration, regardless the GBCA structure (linear or macrocyclic). 79 79 The presence of Gd in the bone marrow also raises the important question of possible bone marrow toxicity when a GBCA is administered. It can be assumed that soluble species of dissociated Gd are a priori more toxic than insoluble or chelated Gd. Regulatory preclinical studies, performed before clinical trials during the development of GBCAs, as with any drug, systematically include the performance of myelograms. Some signs of moderate bone marrow toxicity (eg, decrease in the myeloblast and neutrophilic myelocyte counts) have been reported with linear GBCAs in toxicological nonclinical studies at high dose levels (28×1.25 mmol/kg/adm. in monkeys 87 88 A causal link between the administration of linear GBCAs and the occurrence of a scleroderma-like fibrosing systemic disorder, called nephrogenic systemic fibrosis (NSF) was established in 2006 in severe or end-stage renal failure patients. 89 90 + 91 92 74 AGE AND GADOLINIUM BONE CAPTURE After birth, the development of bone undergoes significant changes, transitioning from a composition primarily of spongy bone and cartilage to a more hardened structure. Initially, the foetal skeleton is predominantly composed of hyaline cartilage, which provides a flexible framework. This cartilage is gradually replaced by bone through a process known as endochondral ossification. During this process, the cartilage is resorbed and replaced by spongy bone, which is later remodelled into compact bone. This transformation is crucial for the bone to gain strength and support the growing body. The remodelling process continues throughout childhood and adolescence, driven by the activity of osteoblasts and osteoclasts, which balance bone formation and resorption. Growth hormone and other systemic factors play a vital role in promoting bone growth and mineralization, ensuring that bones become denser and stronger over time. 93 94 A nonclinical study 74 4 74 74 83 25 95 Alternatively, this result may reflect an affinity of certain bone marrow cell lines for Gd in juvenile rats compared with adults. Currently, there is no reason for selecting one of these hypotheses over the other. The bone marrow of juvenile rats differs from that of adult rats in its higher proliferative capacity of myeloid progenitor cells. 96 97 74 Last, it must be underlined that, as shown in numerous studies performed in adult animals (summarized in Table 1 10 14 16 60 65 67 69 71 75 PHARMACOKINETIC MODELLING OF GBCA/Gd ACCESS TO THE BONE TISSUE Classically, the pharmacokinetics of GBCAs, after IV administration, is modelled as a 2-compartment model 98 5 100 101 99m 153 102 104 104 1/2 1/2 104 105 FIGURE 5 Scheme for 3-compartment pharmacokinetic model (adapted from Ki 99 Subsequently, post hoc analyses of animal and, for the first time, of human data, evidenced the existence of 3 phases, one of distribution, one of elimination, and a third one of long-lasting residual excretion from a so-called “deep compartment“ 86 5 Interestingly, elimination from the “deep compartment” was ∼5 times faster with the macrocyclic GBCA gadoterate than with the linear agents gadodiamide, gadoxetate disodium, and Dy-EOB-DTPA. 86 31 86 104 105 31 86 104 105 86 7 85 101 GADOLINIUM SPECIATION IN BONE Chemically, GBCAs are chelates, therefore, the Gd metal is not covalently bound to the ligand moiety. Their chemistry is based on the following thermodynamic equilibrium between the Gd metal, the L ligand, and the chelate (or complex) GdL ( Equation 1 (Equation 1) [ Gd 3 + ] + [ L ] ↔ [ GdL ] . By applying the law of mass action, the K therm (Equation 2) K therm = [ GdL ] / [ Gd 3 + ] × [ L ] . It implies that the greater the K therm K cond 1 17 86 R 2 K therm K therm K therm 106 Furthermore, other mechanisms, rather than dissociation and not related to the stability of the GBCA, could also come into play to explain bone tropism, for example, a specific interaction of the GBCA molecule with certain bone components. For a long time, it was not possible to distinguish dissociated Gd from Gd still chelated and retained in the bone, as Gd extraction protocols described from Gd speciation in soft tissue, such as brain, are not efficient with an acceptable yield for bone samples. Recently, an innovative combined mild dissolution/recomplexation strategy 16 5- 3 16 3 The bone is the only matrix in which macrocyclic GBCAs have been reported to store Gd in the form of species other than intact GBCA, likely originating from a transchelation process, 16 BEHAVIOR OF GBCA/Gd DURING BONE TURNOVER Funke et al's work 14 3 107 Gadolinium released in vivo after dissociation of GBCA may be found in the form of soluble or insoluble species. It may be speculated that bone remodelling interferes with GBCA dissociation (eg, by favoring it) or, conversely, that GBCA dissociation may disturb the physiological bone remodelling process. Indeed, it can be hypothesized that insoluble Gd species are taken up by osteal macrophages or osteoclasts. However, to the best of our knowledge, such a finding has never been reported to date. An active transport of protons over the ruffled border membrane of osteoclasts favors the dissolution of the bone organic phase. 108 16 52 1 109 110 111 52 16 Unfortunately, studies about GBCAs uptake and behavior in diseased bone are very rare. Darrah et al 52 52 In one nonclinical study, the possibility that osteoporosis may impact Gd retention in tissues was investigated in gadodiamide-treated ovariectomized rats. No difference was found regarding the elemental Gd concentration in the femur, liver, and skin. 69 Paget disease of bone is a localized disorder of the skeleton (notably the pelvis, the lumbar spine, the long bones, and the skull) characterized by abnormal and excessive bone remodelling leading to skeletal deformities which evolve over time and are mostly visible in the skull and lower extremities. Pain is common and often caused by osteoarthritis. In localized osteolytic areas, the lesion progressively becomes osteosclerotic. Histologically, Paget disease of bone is associated with an increase in osteoclast and osteoblast numbers, and a highly vascular fibrocellular marrow replaces the hematopoietic bone marrow. 112 113 However, there is no specific data on the fate Gd or GBCA in areas of high bone turnover, but resorption will be increased, especially in para-trabecular or endosteal areas. MRI of uncomplicated Paget disease is often normal. 114 POTENTIAL SITES FOR GADOLINIUM BINDING IN BONE MATRIX Assuming that GBCAs gradually dissociate when sequestered in the bone “deep compartment,” it is necessary to determine the component(s) of the bone matrix with which the transchelation process can take place. Several bone components can be involved and are reviewed below. The body reserves of phosphorus are overwhelmingly located in bone (85%) as hydroxyapatite crystals. 115 4 116 4 4 117 4 It can also be assumed that processes requiring other metals, such as zinc and iron, are involved in the bone uptake of GBCA. Turyanskaya et al 55 79 15 117 118 Collagen Collagens form the fibrous component of the extracellular matrix in the animal kingdom. One of the essential functions of these proteins is to give tissues mechanical resistance to stretching. Collagen fibril, the main form of collagen, consists of self-assembled collagen molecules, the latter forming triple helices of α-polypeptide chains (tropocollagen), linked together by hydrogen bonds between hydroxylysine and hydroxyproline and by covalent bonds as well. The collagen superfamily comprises 28 members. 119 120 The organic extracellular matrix of bones is mainly composed of collagens of types I (~90% of the total collagen amount), III, and V. 30 26 The binding of lanthanides to collagen fibrils and their interaction with the collagen polymerization process have been known for a long time. 121 3+ 122 3+ 2+ 123 A recent study showed that the macrocyclic GBCAs have a similar weak affinity for type I collagen. However, a simulation analysis led to slight differences regarding the maximum adsorbed amount of GBCA at 48 hours, which decreased in this order: gadoterate meglumine (0.6%)>gadobutrol (0.5%)>gadoteridol (0.4%). 124 P 63 125 124 Hydroxyapatite HAP, a major inorganic component of the bone matrix, is, by far, the main mineral constituent of bones (about 50% of the dry weight 126 127 128 129 The affinity of metal ions for the bone matrix in general is well known, and this is particularly true for the alkaline earth metals (beryllium, magnesium, calcium, strontium, barium, and radium) and the lanthanides as well, the chemical elements family to which gadolinium belongs. 31 130 2+ 4 3– – 2+ 2+ 3+ 131 2+ 132 133 One study performed in rabbits involved Gd-DOTP 5− 5− 134 However, in a study in rats with chronic renal failure, repeated oral administration (for 12 weeks) of lanthanum carbonate (2 g/kg/d) led at most to the substitution of only one calcium atom out of 2000 in the HAP of the bone. 135 136 Luminescence studies indicated that Gd added during HAP synthesis by precipitation does not replace Ca 2+ 3+ 137 131 Interestingly, a single intravenous administration of GdCl 3 138 139 Taken together, these arguments are in favor of the incorporation of dissociated Gd into the HAP crystal lattice by cationic exchange with Ca 2+ 31 128 Proteoglycans In addition to HAP, the bone matrix contains important targets capable of capturing dissociated Gd cation following the GBCA absorption in the bone and the subsequent dechelation. For instance, negatively charged proteoglycans, consisting of GAG covalently attached to the core proteins, are particularly present in the bone extracellular matrix where they influence the morphogenesis, notably by favoring and fine-regulating collagen fibrillogenesis. 140 141 142 143 2+ 3+ 2+ 143 144 Heparan sulphate proteoglycans (HSPG) consist of a core protein carrying heparan sulphate (HS) GAG. HSPG are distributed on the cell surface and in the extracellular matrix. There are 3 types of HSPG, based on their core protein structure: the transmembrane type syndecans, the glycosylphosphatidylinositol-anchored glypicans, and secreted extracellular matrix types, including perlecan, agrin, and type XVIII collagen. 145 145 In addition to HSPG, the GAG moieties found in bone proteoglycans include keratan sulphate, chondroitin sulphate, hyaluronic acid, and dermatan sulphate. 30 (Equation 3) [ Proteoglycan ] + [ Gd ] ↔ [ Proteoglycan − Gd ] . However, as mentioned elsewhere, 144 Putative Role of ASARM Peptide in GBCA Dissociation Acidic serine aspartate-rich MEPE (matrix extracellular phosphoglycoprotein)-associated motif (ASARM) is a key feature of the above-mentioned SIBLING family of non-collagenous proteins from the bone matrix. After cleavage, the SIBLING proteins release the negatively charged ASARM peptide (2.3 kDa). ASARM peptide, which binds HAP with high affinity, has pleiotropic effects, which are still poorly understood and sometimes controversial. These include potent inhibition of mineralization (minhibins), phosphate regulation, soft tissue calcification, osteoclastogenesis, and osteocyte-mediated mechano-transduction. However, these effects are not limited to the skeleton since ASARM peptide are also involved in glucose and insulin metabolism. 146 147 2+ 146 146 148 Ferritin Ferritin (~474 kDa) is an intracellular cytosolic iron storage protein composed of 24 subunits. It plays a key role in the metabolism of iron, allowing its intestinal absorption to be regulated according to the metabolic needs. It thus has iron storage properties. Serum ferritin levels are an indirect marker of the total amount of iron stored in the body. Ferritin is expressed in most tissues, notably the central nervous system, bone marrow, spleen, liver, kidney, lung, and adipocytes. 149 150 151 3+ 3+ T 1 T 2 T 2 * 152 1 81 82 153 It should be underlined that the above-mentioned potential targets for dissociated Gd in the bone matrix are not self-excluding, and therefore several may bind the lanthanide, according to a “nonspecific” effect driven by local concentrations of the species and environmental conditions. Although sequestered Gd may be retained in the bone matrix for a very long time period, 52 83 TOXICOLOGICAL CONSEQUENCES The long-term presence of Gd, including in a dechelated form coming from injected GBCAs, in the bone matrix can be considered a source of concern. To date, after more than 30 years of hindsight, there is no evidence of any toxicological consequences on the bone tissue or its metabolism in preclinical or clinical studies. Conversely, several studies have shown that certain metals or rare earth elements, 154 2+ 155 156 157 158 159 160 161 164 161 162 163 163 164 On the contrary, other metals have a negative impact on bone cellular processes and metabolism. 165 2+ 166 2+ 166 Reasoning by similarity, we may suggest that Gd sequestration in the bone will affect the bone quality and could induce clinically relevant disorders, similar to other trace metals. A recent in vitro study 167 3+ 31 168 Recently, another study has investigated the effect of a GBCA on bone growth, but using an original regeneration model in zebrafish. 169 The authors suggest that Gd-induced changes in bone thickness might be related to its competition with calcium, which could influence parathyroid hormone regulation and phosphate balance. They also mention that other metals, like magnesium, have been shown to increase bone thickness through various mechanisms, which might apply to Gd as well. However, the relevance of extrapolating the zebrafish caudal fins model to the human situation is questionable. In fact, zebrafishes were exposed to Gd through their gills rather than by intravenous injection, and it is difficult to compare the dose used with the human equivalent one. Similarly, it seems difficult to compare the Gd intake per fish with concentrations of Gd that might be found in bone. It would be interesting to compare different categories of GBCAs and also dissociated Gd. Last, this study is perhaps more relevant to the risk associated with Gd release into the environment and the impact it can have on aquatic organisms. This is another area of concern that needs to be studied more in depth. CONCLUSION This review underscores the significant findings regarding Gd retention in bone tissues following the use of GBCAs. The evidence indicates that Gd can persist in bone for extended periods, with higher retention observed for linear GBCAs compared with macrocyclic ones. The prolonged presence of Gd in bone, particularly in chemical species other than the initially injected GBCA species, raises concerns about potential long-term toxicological effects, although no clinical consequences on bone physiology have been reported to date. The review highlights the complex interactions between Gd and bone matrix components, such as hydroxyapatite, collagen, and proteoglycans, which may facilitate Gd retention. In addition, the potential for Gd to interfere with bone remodelling processes and cellular functions, as suggested by in vitro studies and in comparison with those found with other REEs, warrants further investigation. Given the widespread use of GBCAs, it is crucial to continue research on the long-term effects of Gd retention in bone. Future studies should focus on understanding the mechanisms of Gd deposition and its impact on bone health, particularly in cases of underlying bone pathology or in patients undergoing bone growth. ACKNOWLEDGMENTS The authors thank the reviewers from Guerbet for their valuable feedback on the manuscript, with special thanks to Yukantha Kalaranjan for her assistance in the revision process. Conflicts of interest and sources of funding: N.F., C.F., and M.R. are employees of Guerbet. J.M.I. acted as an external consultant for Guerbet. For the remaining authors, none were declared. REFERENCES 1 Port M Idée J-M Medina C Efficiency, thermodynamic and kinetic stability of marketed gadolinium chelates and their possible clinical consequences: a critical review Biometals 2008 21 469 490 18344005 10.1007/s10534-008-9135-x 2 Frenzel T Lengsfeld P Schirmer H Stability of gadolinium-based magnetic resonance imaging contrast agents in human serum at 37 degrees C Invest Radiol 2008 43 817 828 19002053 10.1097/RLI.0b013e3181852171 3 Robic C Port M Rousseaux O Physicochemical and pharmacokinetic profiles of gadopiclenol: a new macrocyclic gadolinium chelate with high T1 relaxivity Invest Radiol 2019 54 475 484 30973459 10.1097/RLI.0000000000000563 PMC6661244 4 Maimouni I Henoumont C De Goltstein M-C Gadopiclenol: a q = 2 gadolinium-based MRI contrast agent combining high stability and efficacy Invest Radiol 2025 60 234 243 39724578 10.1097/RLI.0000000000001121 PMC11801443 5 Schmitt-Willich H Stability of linear and macrocyclic gadolinium based contrast agents Br J Radiol 2007 80 581 582 author reply 584-585 17704318 10.1259/bjr/17326033 6 Wedeking P Tweedle M Comparison of the biodistribution of 153Gd-labeled Gd(DTPA)2-, Gd(DOTA)-, and Gd(acetate)n in mice Int J Rad Appl Instrum B 1988 15 395 402 3255735 10.1016/0883-2897(88)90009-8 7 Tweedle MF Wedeking P Kumar K Biodistribution of radiolabeled, formulated gadopentetate, gadoteridol, gadoterate, and gadodiamide in mice and rats Invest Radiol 1995 30 372 380 7490190 10.1097/00004424-199506000-00008 8 Steger-Hartmann T Hofmeister R Ernst R A review of preclinical safety data for magnevist (gadopentetate dimeglumine) in the context of nephrogenic systemic fibrosis Invest Radiol 2010 45 520 528 20644486 10.1097/RLI.0b013e3181e960c9 9 Haylor J Dencausse A Vickers M Nephrogenic gadolinium biodistribution and skin cellularity following a single injection of Omniscan in the rat Invest Radiol 2010 45 507 512 20697223 10.1097/RLI.0b013e3181eb51f2 10 Fretellier N Bouzian N Parmentier N Nephrogenic systemic fibrosis-like effects of magnetic resonance imaging contrast agents in rats with adenine-induced renal failure Toxicol Sci 2013 131 259 270 22977165 10.1093/toxsci/kfs274 11 Robert P Fingerhut S Factor C One-year retention of gadolinium in the brain: comparison of gadodiamide and gadoterate meglumine in a rodent model Radiology 2018 288 424 433 29786486 10.1148/radiol.2018172746 12 Jost G Frenzel T Boyken J Long-term excretion of gadolinium-based contrast agents: linear versus macrocyclic agents in an experimental rat model Radiology 2019 290 340 348 30422091 10.1148/radiol.2018180135 13 Le Fur M Moon BF Zhou IY Gadolinium-based contrast agent biodistribution and speciation in rats Radiology 2023 309 e230984 37874235 10.1148/radiol.230984 PMC10623187 14 Fretellier N Idée J-M Dencausse A Comparative in vivo dissociation of gadolinium chelates in renally impaired rats: a relaxometry study Invest Radiol 2011 46 292 300 21263333 10.1097/RLI.0b013e3182056ccf 15 Funke SKI Factor C Rasschaert M Elemental imaging of long-term gadolinium retention in rodent femur Radiology 2023 306 e213107 36194115 10.1148/radiol.213107 16 Schlatt L Köhrer A Factor C Mild dissolution/recomplexation strategy for speciation analysis of gadolinium from MR contrast agents in bone tissues by means of HPLC-ICP-MS Anal Chem 2021 93 11398 11405 34387072 10.1021/acs.analchem.1c01100 17 Idée J-M Port M Robic C Role of thermodynamic and kinetic parameters in gadolinium chelate stability J Magn Reson Imaging 2009 30 1249 1258 19938037 10.1002/jmri.21967 18 Jost G Frenzel T Lohrke J Penetration and distribution of gadolinium-based contrast agents into the cerebrospinal fluid in healthy rats: a potential pathway of entry into the brain tissue Eur Radiol 2017 27 2877 2885 27832312 10.1007/s00330-016-4654-2 PMC5486780 19 Taoka T Jost G Frenzel T Impact of the glymphatic system on the kinetic and distribution of gadodiamide in the rat brain: observations by dynamic MRI and effect of circadian rhythm on tissue gadolinium concentrations Invest Radiol 2018 53 529 534 29652699 10.1097/RLI.0000000000000473 20 Deike-Hofmann K Reuter J Haase R Glymphatic pathway of gadolinium-based contrast agents through the brain: overlooked and misinterpreted Invest Radiol 2019 54 229 237 30480554 10.1097/RLI.0000000000000533 21 Rasschaert M Weller RO Schroeder JA Retention of gadolinium in brain parenchyma: pathways for speciation, access, and distribution. A critical review J Magn Reson Imaging 2020 52 1293 1305 32246802 10.1002/jmri.27124 PMC7687192 22 Koh NYY Miszkiewicz JJ Fac ML Preclinical rodent models for human bone disease, including a focus on cortical bone Endocr Rev 2024 45 493 520 38315213 10.1210/endrev/bnae004 PMC11244217 23 Jowsey J Studies of Haversian systems in man and some animals J Anat 1966 100 857 864 4961449 PMC1270831 24 Bagi CM Berryman E Moalli MR Comparative bone anatomy of commonly used laboratory animals: implications for drug discovery Comp Med 2011 61 76 85 21819685 PMC3060425 25 Zoetis T Tassinari MS Bagi C Species comparison of postnatal bone growth and development Birth Defects Res B Dev Reprod Toxicol 2003 68 86 110 12866701 10.1002/bdrb.10012 26 Clarke B Normal bone anatomy and physiology Clin J Am Soc Nephrol 2008 3 Suppl 3 S131 S139 18988698 10.2215/CJN.04151206 PMC3152283 27 Florencio-Silva R Sasso GR da S Biology of bone tissue: structure, function, and factors that influence bone cells Biomed Res Int 2015 2015 421746 26247020 10.1155/2015/421746 PMC4515490 28 Sinder BP Pettit AR McCauley LK Macrophages: their emerging roles in bone J Bone Miner Res 2015 30 2140 2149 26531055 10.1002/jbmr.2735 PMC4876707 29 Young MF Bone matrix proteins: their function, regulation, and relationship to osteoporosis Osteoporos Int 2003 14 S35 S42 12730768 10.1007/s00198-002-1342-7 30 Lin X Patil S Gao Y-G The bone extracellular matrix in bone formation and regeneration Front Pharmacol 2020 11 757 32528290 10.3389/fphar.2020.00757 PMC7264100 31 Vidaud C Bourgeois D Meyer D Bone as target organ for metals: the case of f-elements Chem Res Toxicol 2012 25 1161 1175 22458510 10.1021/tx300064m 32 Li Z Pasteris JD Chemistry of bone mineral, based on the hypermineralized rostrum of the beaked whale Mesoplodon densirostris Am Mineral 2014 99 645 653 25484370 10.2138/am.2014.4571 PMC4251810 33 Willard-Mack CL Elmore SA Hall WC Nonproliferative and proliferative lesions of the rat and mouse hematolymphoid system Toxicol Pathol 2019 47 665 783 31526133 10.1177/0192623319867053 PMC6752743 34 Goodsitt MM Hoover P Veldee MS The composition of bone marrow for a dual-energy quantitative computed tomography technique. A cadaver and computer simulation study Invest Radiol 1994 29 695 704 7960616 10.1097/00004424-199407000-00006 35 Munka V Gregor A Lymphatics and bone marrow Folia Morphol (Praha) 1965 13 404 412 5842805 36 Marenzana M Arnett TR The key role of the blood supply to bone Bone Res 2013 1 203 215 26273504 10.4248/BR201303001 PMC4472103 37 Travlos GS Normal structure, function, and histology of the bone marrow Toxicol Pathol 2006 34 548 565 17067943 10.1080/01926230600939856 38 Brandao-Burch A Utting JC Orriss IR Acidosis inhibits bone formation by osteoblasts in vitro by preventing mineralization Calcif Tissue Int 2005 77 167 174 16075362 10.1007/s00223-004-0285-8 39 Paxton S Peckham M Knibbs A. The Leeds Histology Guide. 2003. Accessed January 2, 2025. https://www.histology.leeds.ac.uk/bone/cartilage.php 40 Raggatt LJ Partridge NC Cellular and molecular mechanisms of bone remodeling J Biol Chem 2010 285 25103 25108 20501658 10.1074/jbc.R109.041087 PMC2919071 41 Udagawa N Takahashi N Akatsu T Origin of osteoclasts: mature monocytes and macrophages are capable of differentiating into osteoclasts under a suitable microenvironment prepared by bone marrow-derived stromal cells Proc Natl Acad Sci U S A 1990 87 7260 7264 2169622 10.1073/pnas.87.18.7260 PMC54723 42 Hadjidakis DJ Androulakis II Bone remodeling Ann N Y Acad Sci 2006 1092 385 396 17308163 10.1196/annals.1365.035 43 Siddiqui JA Partridge NC Physiological bone remodeling: systemic regulation and growth factor involvement Physiology (Bethesda) 2016 31 233 245 27053737 10.1152/physiol.00061.2014 PMC6734079 44 Eriksen EF Cellular mechanisms of bone remodeling Rev Endocr Metab Disord 2010 11 219 227 21188536 10.1007/s11154-010-9153-1 PMC3028072 45 Hart N Newton R Tan J Biological basis of bone strength: anatomy, physiology and measurement J Musculoskelet Neuronal Interact 2020 20 347 371 32877972 PMC7493450 46 Manolagas SC Birth and death of bone cells: basic regulatory mechanisms and implications for the pathogenesis and treatment of osteoporosis Endocr Rev 2000 21 115 137 10782361 10.1210/edrv.21.2.0395 47 Jee WSS Tian XY Setterberg RB Cancellous bone minimodeling-based formation: a Frost, Takahashi legacy J Musculoskelet Neuronal Interact 2007 7 232 239 17947806 48 Frost HM Skeletal structural adaptations to mechanical usage (SATMU): 4. Mechanical influences on intact fibrous tissues Anat Rec 1990 226 433 439 2184697 10.1002/ar.1092260405 49 Erben RG Trabecular and endocortical bone surfaces in the rat: modeling or remodeling? Anat Rec 1996 246 39 46 8876822 10.1002/(SICI)1097-0185(199609)246:1<39::AID-AR5>3.0.CO;2-A 50 Gibby WA Gibby KA Gibby WA Comparison of Gd DTPA-BMA (Omniscan) versus Gd HP-DO3A (ProHance) retention in human bone tissue by inductively coupled plasma atomic emission spectroscopy Invest Radiol 2004 39 138 142 15076005 10.1097/01.rli.0000112789.57341.01 51 White GW Gibby WA Tweedle MF Comparison of Gd(DTPA-BMA) (Omniscan) versus Gd(HP-DO3A) (ProHance) relative to gadolinium retention in human bone tissue by inductively coupled plasma mass spectroscopy Invest Radiol 2006 41 272 278 16481910 10.1097/01.rli.0000186569.32408.95 52 Darrah TH Prutsman-Pfeiffer JJ Poreda RJ Incorporation of excess gadolinium into human bone from medical contrast agents Metallomics 2009 1 479 488 21305156 10.1039/b905145g 53 Murata N Gonzalez-Cuyar LF Murata K Macrocyclic and other non-group 1 gadolinium contrast agents deposit low levels of gadolinium in brain and bone tissue: preliminary results from 9 patients with normal renal function Invest Radiol 2016 51 447 453 26863577 10.1097/RLI.0000000000000252 54 Lord ML Chettle DR Gräfe JL Observed deposition of gadolinium in bone using a new noninvasive in vivo biomedical device: results of a small pilot feasibility study Radiology 2018 287 96 103 29237148 10.1148/radiol.2017171161 55 Turyanskaya A Rauwolf M Pichler V Detection and imaging of gadolinium accumulation in human bone tissue by micro- and submicro-XRF Sci Rep 2020 10 6301 32286449 10.1038/s41598-020-63325-9 PMC7156386 56 Kobayashi M Levendovszky SR Hippe DS Comparison of human tissue gadolinium retention and elimination between gadoteridol and gadobenate Radiology 2021 300 559 569 34128720 10.1148/radiol.2021204320 57 Di Gregorio E Iani R Ferrauto G Gd accumulation in tissues of healthy mice upon repeated administrations of gadodiamide and gadoteridol J Trace Elem Med Biol 2018 48 239 245 29773187 10.1016/j.jtemb.2018.04.018 58 Davies J Marino M Smith APL Repeat and single dose administration of gadodiamide to rats to investigate concentration and location of gadolinium and the cell ultrastructure Sci Rep 2021 11 13950 34230532 10.1038/s41598-021-93147-2 PMC8260729 59 Nakamura R Takanezawa Y Ohshiro Y Effects of chemical forms of gadolinium on the spleen in mice after single intravenous administration Biochem Biophys Rep 2022 29 101217 35128083 10.1016/j.bbrep.2022.101217 PMC8808065 60 Sieber MA Lengsfeld P Frenzel T Preclinical investigation to compare different gadolinium-based contrast agents regarding their propensity to release gadolinium in vivo and to trigger nephrogenic systemic fibrosis-like lesions Eur Radiol 2008 18 2164 2173 18545998 10.1007/s00330-008-0977-y 61 Lohrke J Frisk A-L Frenzel T Histology and gadolinium distribution in the rodent brain after the administration of cumulative high doses of linear and macrocyclic gadolinium-based contrast agents Invest Radiol 2017 52 324 333 28323657 10.1097/RLI.0000000000000344 PMC5417580 62 Bussi S Coppo A Botteron C Differences in gadolinium retention after repeated injections of macrocyclic MR contrast agents to rats J Magn Reson Imaging 2018 47 746 752 28730643 10.1002/jmri.25822 PMC5836870 63 Bussi S Coppo A Celeste R Macrocyclic MR contrast agents: evaluation of multiple-organ gadolinium retention in healthy rats Insights Imaging 2020 11 11 32020385 10.1186/s13244-019-0824-5 PMC7000570 64 Ringler MD Rhodes NG Ayers-Ringler JR Gadolinium retention within multiple rat organs after intra-articular administration of gadolinium-based contrast agents Skeletal Radiol 2021 50 1419 1425 33404669 10.1007/s00256-020-03695-3 PMC8119273 65 Fretellier N Idée J Bruneval P Hyperphosphataemia sensitizes renally impaired rats to the profibrotic effects of gadodiamide Br J Pharmacol 2012 165 1151 1162 21740412 10.1111/j.1476-5381.2011.01585.x PMC3346252 66 Haylor J Schroeder J Wagner B Skin gadolinium following use of MR contrast agents in a rat model of nephrogenic systemic fibrosis Radiology 2012 263 107 116 22344402 10.1148/radiol.12110881 67 Fretellier N Rasschaert M Bocanegra J Safety and gadolinium distribution of the new high-relaxivity gadolinium chelate gadopiclenol in a rat model of severe renal failure Invest Radiol 2021 56 826 836 34091462 10.1097/RLI.0000000000000793 68 Kartamihardja AAP Nakajima T Kameo S Impact of impaired renal function on gadolinium retention after administration of gadolinium-based contrast agents in a mouse model Invest Radiol 2016 51 655 660 27299580 10.1097/RLI.0000000000000295 69 Wáng Y-XJ Schroeder J Siegmund H Total gadolinium tissue deposition and skin structural findings following the administration of structurally different gadolinium chelates in healthy and ovariectomized female rats Quant Imaging Med Surg 2015 5 534 545 26435917 10.3978/j.issn.2223-4292.2015.05.03 PMC4559982 70 Damme NM Fernandez DP Wang L-M Analysis of retention of gadolinium by brain, bone, and blood following linear gadolinium-based contrast agent administration in rats with experimental sepsis Magn Reson Med 2020 83 1930 1939 31677194 10.1002/mrm.28060 71 Fretellier N Maazouz M Luseau A Safety profiles of gadolinium chelates in juvenile rats differ according to the risk of dissociation Reprod Toxicol 2014 50 171 179 25462783 10.1016/j.reprotox.2014.10.024 72 Giorgi H Ammerman J Briffaux J-P Non-clinical safety assessment of gadoterate meglumine (Dotarem(®)) in neonatal and juvenile rats Regul Toxicol Pharmacol 2015 73 960 970 26382613 10.1016/j.yrtph.2015.09.018 73 Bussi S Penard L Bonafè R Non-clinical assessment of safety and gadolinium deposition after cumulative administration of gadobenate dimeglumine (MultiHance®) to neonatal and juvenile rats Regul Toxicol Pharmacol 2018 92 268 277 29278694 10.1016/j.yrtph.2017.12.016 74 Fretellier N Granottier A Rasschaert M Does age interfere with gadolinium toxicity and presence in brain and bone tissues?: A comparative gadoterate versus gadodiamide study in juvenile and adult rats Invest Radiol 2019 54 61 71 30394964 10.1097/RLI.0000000000000517 PMC6310471 75 Erdene K Nakajima T Kameo S Organ retention of gadolinium in mother and pup mice: effect of pregnancy and type of gadolinium-based contrast agents Jpn J Radiol 2017 35 568 573 28730467 10.1007/s11604-017-0667-2 76 Oh KY Roberts VHJ Schabel MC Gadolinium chelate contrast material in pregnancy: fetal biodistribution in the nonhuman primate Radiology 2015 276 110 118 25763829 10.1148/radiol.15141488 PMC4485748 77 Prola-Netto J Woods M Roberts VHJ Gadolinium chelate safety in pregnancy: barely detectable gadolinium levels in the juvenile nonhuman primate after in utero exposure Radiology 2018 286 122 128 28873045 10.1148/radiol.2017162534 PMC5749591 78 Smieja D Czupalla O Günther C Evaluation of gadolinium-based contrast agents in juvenile non-human primates including behavioral evaluations such as learning and memory Birth Defects Research 2025 117 e12470 10.1002/bdr2.2470 40237208 79 Richter H Verlemann C Jeibmann A Elemental bioimaging of sheep bone and articular cartilage after single application of gadolinium-based contrast agents Invest Radiol 2024 59 287 292 37747456 10.1097/RLI.0000000000001020 PMC11882188 80 Zhang X Zhou B Chen Y Evaluation of gadolinium deposition in cortical bone using three-dimensional ultrashort echo time quantitative susceptibility mapping: a preliminary study NMR Biomed 2024 37 e5035 37721094 10.1002/nbm.5035 PMC10726698 81 Bageac D DeBevits JJ Munbodh R MRI demonstration of gadolinium deposition in bone after monthly triple-dose gadopentetate dimeglumine and correlation with frequency of hypophosphatemia Clin Imaging 2021 70 136 141 33161342 10.1016/j.clinimag.2020.07.022 82 Chen D Wolansky I Imitola J Monthly triple-dose gadolinium administration: potential associations with leukopenia, hypophosphatemia, and bone marrow T1 hyperintensity J Int Med Res 2022 50 3000605221076977 35118901 10.1177/03000605221076977 PMC8819769 83 Taylor DM Leggett RW A generic biokinetic model for predicting the behaviour of the lanthanide elements in the human body Radiat Prot Dosimetry 2003 105 193 198 14526955 10.1093/oxfordjournals.rpd.a006222 84 Nakamura S Ohashi R Esumi T Pharmacokinetics of meglumine gadoterate (EK-5504): blood concentration, distribution, metabolism and excretion in rats and dogs Shinryo To Shinyaku 1996 33 S159 S173 85 Kindberg GM Uran S Friisk G The fate of Gd and chelate following intravenous injection of gadodiamide in rats Eur Radiol 2010 20 1636 1643 20157815 10.1007/s00330-010-1716-8 PMC2882048 86 Lancelot E Revisiting the pharmacokinetic profiles of gadolinium-based contrast agents: differences in long-term biodistribution and excretion Invest Radiol 2016 51 691 700 27175546 10.1097/RLI.0000000000000280 87 Harpur ES Worah D Hals PA Preclinical safety assessment and pharmacokinetics of gadodiamide injection, a new magnetic resonance imaging contrast agent Invest Radiol 1993 28 S28 S43 10.1097/00004424-199303001-00004 8486501 88 Katsutani N Sagami F Tirone P General toxicity study of gadobenate dimeglumine formulation (E7155)(4): 4-week repeated dose intravenous toxicity study followed by 4-week recovery period in dogs J Toxicol Sci 1999 24 41 60 10637779 10.2131/jts.24.supplementi_41 89 Grobner T Gadolinium—a specific trigger for the development of nephrogenic fibrosing dermopathy and nephrogenic systemic fibrosis? Nephrol Dial Transplant 2006 21 1104 1108 16431890 10.1093/ndt/gfk062 90 Marckmann P Skov L Rossen K Nephrogenic systemic fibrosis: suspected causative role of gadodiamide used for contrast-enhanced magnetic resonance imaging J Am Soc Nephrol 2006 17 2359 2362 16885403 10.1681/ASN.2006060601 91 Wagner B Tan C Barnes JL Nephrogenic systemic fibrosis: evidence for oxidative stress and bone marrow-derived fibrocytes in skin, liver, and heart lesions using a 5/6 nephrectomy rodent model Am J Pathol 2012 181 1941 1952 23041060 10.1016/j.ajpath.2012.08.026 92 Drel VR Tan C Barnes JL Centrality of bone marrow in the severity of gadolinium-based contrast-induced systemic fibrosis FASEB J 2016 30 3026 3038 27221979 10.1096/fj.201500188R PMC5001515 93 Teti A Bone development: overview of bone cells and signaling Curr Osteoporos Rep 2011 9 264 273 21948208 10.1007/s11914-011-0078-8 94 Bashir A ul Ain Q Bashir N Bone development and growth. 2024. Accessed January 3, 2025. http://www.intechopen.com/online-first/1183333 95 Horton JA Bariteau JT Loomis RM Ontogeny of skeletal maturation in the juvenile rat Anat Rec (Hoboken) 2008 291 283 292 18228587 10.1002/ar.20650 96 Xiao Y Zijl S Wang L Identification of the common origins of osteoclasts, macrophages, and dendritic cells in human hematopoiesis Stem Cell Reports 2015 4 984 994 26004632 10.1016/j.stemcr.2015.04.012 PMC4471835 97 Parker GA Picut CA Swanson C Histologic features of postnatal development of immune system organs in the Sprague-Dawley Rat Toxicol Pathol 2015 43 794 815 25883109 10.1177/0192623315578720 98 Aime S Caravan P Biodistribution of gadolinium-based contrast agents, including gadolinium deposition J Magn Reson Imaging 2009 30 1259 1267 19938038 10.1002/jmri.21969 PMC2822463 99 Ki S A semi-compartmental model describing the pharmacokinetic-pharmacodynamic relationship Anesth Pain Med (Seoul) 2020 15 1 7 33329783 10.17085/apm.2020.15.1.1 PMC7713860 100 Edginton AN Theil F-P Schmitt W Whole body physiologically-based pharmacokinetic models: their use in clinical drug development Expert Opin Drug Metab Toxicol 2008 4 1143 1152 18721109 10.1517/17425255.4.9.1143 101 Wedeking P Eaton S Covell DG Pharmacokinetic analysis of blood distribution of intravenously administered 153Gd-labeled Gd(DTPA)2- and 99mTc(DTPA) in rats Magn Reson Imaging 1990 8 567 575 2082126 10.1016/0730-725x(90)90133-m 102 Byrd BL Watson EE Cloutier RJ Effect of stable scandium on the long-term whole body retention of intravenously administered 46Sc citrate in the rat Health Phys 1975 29 375 379 1193857 10.1097/00004032-197509000-00001 103 Lachine EE Noujaim AA Ediss C Toxicity, tissue distribution and excretion of 46ScCl3 and 46Sc-EDTA in mice Int J Appl Radiat Isot 1976 27 373 377 821864 10.1016/0020-708x(76)90091-0 104 Hiraki T Ando A Mori H [Whole-body retention studies of 167Tm-citrate.—Estimation of radiation dose to human from 167Tm-citrate—(author’s transl)] Radioisotopes 1978 27 85 89 417386 10.3769/radioisotopes.27.2_85 105 Hirano S Suzuki KT Exposure, metabolism, and toxicity of rare earths and related compounds Environ Health Perspect 1996 104 85 95 8722113 10.1289/ehp.96104s185 PMC1469566 106 Do QN Lenkinski RE Tircso G How the chemical properties of GBCAs influence their safety profiles in vivo Molecules 2021 27 58 35011290 10.3390/molecules27010058 PMC8746842 107 Baron R Tross R Vignery A Evidence of sequential remodeling in rat trabecular bone: morphology, dynamic histomorphometry, and changes during skeletal maturation Anat Rec 1984 208 137 145 6711834 10.1002/ar.1092080114 108 Blair HC Teitelbaum SL Ghiselli R Osteoclastic bone resorption by a polarized vacuolar proton pump Science 1989 245 855 857 2528207 10.1126/science.2528207 109 Teitelbaum SL Bone resorption by osteoclasts Science 2000 289 1504 1508 10968780 10.1126/science.289.5484.1504 110 Arnett TR Extracellular pH regulates bone cell function J Nutr 2008 138 415S 418S 18203913 10.1093/jn/138.2.415S 111 Gasser JA Hulter HN Imboden P Effect of chronic metabolic acidosis on bone density and bone architecture in vivo in rats Am J Physiol Renal Physiol 2014 306 F517 F524 24352505 10.1152/ajprenal.00494.2013 112 Singer FR Paget’s disease of bone In: Feingold KR, Anawalt B, Blackman MR, et al, eds Endotext South Dartmouth, MA MDText.com Inc. 2000 Accessed January 2, 2025. http://www.ncbi.nlm.nih.gov/books/NBK279033/ 113 Kurihara N Zhou H Reddy SV Experimental models of Paget’s disease J Bone Miner Res 2006 21 P55 P57 17229020 10.1359/jbmr.06s210 114 Vande Berg BC Malghem J Lecouvet FE Magnetic resonance appearance of uncomplicated Paget’s disease of bone Semin Musculoskelet Radiol 2001 5 69 77 11371337 10.1055/s-2001-12919 115 García Martín A Varsavsky M Cortés Berdonces M Phosphate disorders and clinical management of hypophosphatemia and hyperphosphatemia Endocrinol Diabetes Nutr (Engl Ed) 2020 67 205 215 31501071 10.1016/j.endinu.2019.06.004 116 Robic C Catoen S De Goltstein M-C The role of phosphate on Omniscan(®) dechelation: an in vitro relaxivity study at pH 7 Biometals 2011 24 759 768 21390525 10.1007/s10534-011-9422-9 117 Idée J-M Fretellier N Robic C The role of gadolinium chelates in the mechanism of nephrogenic systemic fibrosis: a critical update Crit Rev Toxicol 2014 44 895 913 25257840 10.3109/10408444.2014.955568 118 Evans CH Biochemistry of the Lanthanides Boston, MA Springer US 1990 Accessed January 2, 2025. http://link.springer.com/10.1007/978-1-4684-8748-0 119 Ricard-Blum S The collagen family Cold Spring Harb Perspect Biol 2011 3 a004978 21421911 10.1101/cshperspect.a004978 PMC3003457 120 Pang X Lin L Tang B Unraveling the role of calcium ions in the mechanical properties of individual collagen fibrils Sci Rep 2017 7 46042 28378770 10.1038/srep46042 PMC5380965 121 Evans CH Drouven BJ The promotion of collagen polymerization by lanthanide and calcium ions Biochem J 1983 213 751 758 6615457 10.1042/bj2130751 PMC1152192 122 Drouven BJ Evans CH Collagen fibrillogenesis in the presence of lanthanides J Biol Chem 1986 261 11792 11797 3745166 123 Stratta P Canavese C Aime S Gadolinium-enhanced magnetic resonance imaging, renal failure and nephrogenic systemic fibrosis/nephrogenic fibrosing dermopathy Curr Med Chem 2008 15 1229 1235 18473815 10.2174/092986708784310396 124 Guidolin N Travagin F Giovenzana GB Interaction of macrocyclic gadolinium-based MR contrast agents with Type I collagen. Equilibrium and kinetic studies Dalton Trans 2020 49 14863 14870 33073806 10.1039/d0dt03314f 125 Somnin C Chamieh J Leclercq L Study of interactions between gadolinium-based contrast agents and collagen by taylor dispersion analysis and frontal analysis continuous capillary electrophoresis Pharmaceuticals (Basel) 2024 17 1633 39770475 10.3390/ph17121633 PMC11728588 126 Junqueira LCU Carneiro J Basic Histology: Text & Atlas McGraw-Hill 2005 127 Weaver CM Peacock M Calcium Adv Nutr 2019 10 546 548 30915443 10.1093/advances/nmy086 PMC6520034 128 Abraham JL Thakral C Skov L Dermal inorganic gadolinium concentrations: evidence for in vivo transmetallation and long-term persistence in nephrogenic systemic fibrosis Br J Dermatol 2008 158 273 280 18067485 10.1111/j.1365-2133.2007.08335.x 129 Runge VM Dechelation (transmetalation): consequences and safety concerns with the linear gadolinium-based contrast agents, in view of recent health care rulings by the EMA (Europe), FDA (United States), and PMDA (Japan) Invest Radiol 2018 53 571 578 30130320 10.1097/RLI.0000000000000507 130 Weekes DM Orvig C Harnessing the bone-seeking ability of Ca(II)-like metal ions in the treatment of metastatic cancer and resorption disorders Chem Soc Rev 2016 45 2024 2031 26853513 10.1039/c5cs00712g 131 Cawthray JF Creagh AL Haynes CA Ion exchange in hydroxyapatite with lanthanides Inorg Chem 2015 54 1440 1445 25594577 10.1021/ic502425e 132 Liu Y Tang Y Tian Y Gadolinium-doped hydroxyapatite nanorods as T1 contrast agents and drug carriers for breast cancer therapy ACS Appl Nano Mater 2019 2 1194 1201 133 Kubícek V Rudovský J Kotek J A bisphosphonate monoamide analogue of DOTA: a potential agent for bone targeting J Am Chem Soc 2005 127 16477 16485 16305234 10.1021/ja054905u 134 Alves FC Donato P Sherry AD Silencing of phosphonate-gadolinium magnetic resonance imaging contrast by hydroxyapatite binding Invest Radiol 2003 38 750 760 14627892 10.1097/01.rli.0000084891.15996.0f 135 Behets GJ Verberckmoes SC Oste L Localization of lanthanum in bone of chronic renal failure rats after oral dosing with lanthanum carbonate Kidney Int 2005 67 1830 1836 15840030 10.1111/j.1523-1755.2005.00281.x 136 Bronner F Slepchenko BM Pennick M A model of the kinetics of lanthanum in human bone, using data collected during the clinical development of the phosphate binder lanthanum carbonate Clin Pharmacokinet 2008 47 543 552 18611063 10.2165/00003088-200847080-00004 137 Mayer I Layani JD Givan A La ions in precipitated hydroxyapatites J Inorg Biochem 1999 73 221 226 10376345 10.1016/s0162-0134(99)00019-7 138 Spencer AJ Wilson SA Batchelor J Gadolinium chloride toxicity in the rat Toxicol Pathol 1997 25 245 255 9210255 10.1177/019262339702500301 139 Rees J Spencer A Wilson S Time course of stomach mineralization, plasma, and urinary changes after a single intravenous administration of gadolinium(III) chloride in the male rat Toxicol Pathol 1997 25 582 589 9437802 10.1177/019262339702500607 140 Lamoureux F Baud’huin M Duplomb L Proteoglycans: key partners in bone cell biology Bioessays 2007 29 758 771 17621645 10.1002/bies.20612 141 Rabenstein DL Robert JM Peng J Multinuclear magnetic resonance studies of the interaction of inorganic cations with heparin Carbohydr Res 1995 278 239 256 8590444 10.1016/0008-6215(95)00263-4 142 Rej RN Holme KR Perlin AS Marked stereoselectivity in the binding of copper ions by heparin. Contrasts with the binding of gadolinium and calcium ions Carbohydr Res 1990 207 143 152 2076515 10.1016/0008-6215(90)84044-u 143 Taupitz M Stolzenburg N Ebert M Gadolinium-containing magnetic resonance contrast media: investigation on the possible transchelation of Gd 3+ Contrast Media Mol Imaging 2013 8 108 116 23281283 10.1002/cmmi.1500 144 Werner P Taupitz M Schröder L An NMR relaxometry approach for quantitative investigation of the transchelation of gadolinium ions from GBCAs to a competing macromolecular chelator Sci Rep 2021 11 21731 34741037 10.1038/s41598-021-00974-4 PMC8571392 145 De Pasquale V Pavone LM Heparan sulfate proteoglycans: the sweet side of development turns sour in mucopolysaccharidoses Biochim Biophys Acta Mol Basis Dis 2019 1865 165539 31465828 10.1016/j.bbadis.2019.165539 146 Rowe PSN Regulation of bone-renal mineral and energy metabolism: the PHEX, FGF23, DMP1, MEPE ASARM pathway Crit Rev Eukaryot Gene Expr 2012 22 61 86 22339660 10.1615/critreveukargeneexpr.v22.i1.50 PMC3362997 147 Minamizaki T Yoshiko Y The bioactive acidic serine- and aspartate-rich motif peptide Curr Protein Pept Sci 2015 16 196 202 25693768 10.2174/1389203716666150206122839 148 Rowe PSN Zelenchuk LV Laurence JS Do ASARM peptides play a role in nephrogenic systemic fibrosis? Am J Physiol Renal Physiol 2015 309 F764 F769 26336161 10.1152/ajprenal.00201.2015 PMC4628947 149 Kell DB Pretorius E Serum ferritin is an important inflammatory disease marker, as it is mainly a leakage product from damaged cells Metallomics 2014 6 748 773 24549403 10.1039/c3mt00347g 150 Nelson R Chawla M Connolly P Ferritin as an index of bone marrow iron stores South Med J 1978 71 1482 1484 725624 10.1097/00007611-197812000-00011 151 Rocha LA Barreto DV Barreto FC Serum ferritin level remains a reliable marker of bone marrow iron stores evaluated by histomorphometry in hemodialysis patients Clin J Am Soc Nephrol 2009 4 105 109 18842949 10.2215/CJN.01630408 PMC2615700 152 Neburkova J Rulseh AM Chang SLY Formation of gadolinium-ferritin from clinical magnetic resonance contrast agents Nanoscale Adv 2020 2 5567 5571 36133872 10.1039/c9na00567f PMC9417687 153 Strzeminska I Factor C Robert P Speciation analysis of gadolinium in the water-insoluble rat brain fraction after administration of gadolinium-based contrast agents Invest Radiol 2021 56 535 544 33813574 10.1097/RLI.0000000000000774 154 Huang J Zhang T-L Xu S-J Effects of lanthanum on composition, crystal size, and lattice structure of femur bone mineral of Wistar rats Calcif Tissue Int 2006 78 241 247 16604282 10.1007/s00223-005-0294-2 155 Wang X Yuan L Huang J Lanthanum enhances in vitro osteoblast differentiation via pertussis toxin-sensitive gi protein and ERK signaling pathway J Cell Biochem 2008 105 1307 1315 18810761 10.1002/jcb.21932 156 Jiang C Shang J Li Z Lanthanum chloride attenuates osteoclast formation and function via the downregulation of Rankl-iInduced Nf-κb and Nfatc1 activities J Cell Physiol 2016 231 142 151 26060084 10.1002/jcp.25065 157 Che Y Bing C Akhtar J Lanthanum carbonate prevents accelerated medial calcification in uremic rats: role of osteoclast-like activity J Transl Med 2013 11 308 24330832 10.1186/1479-5876-11-308 PMC3878800 158 Hutchison AJ Wilson RJ Garafola S Lanthanum carbonate: safety data after 10 years Nephrology (Carlton) 2016 21 987 994 27479781 10.1111/nep.12864 PMC5129531 159 Weekes DM Cawthray JF Rieder M La(iii) biodistribution profiles from intravenous and oral dosing of two lanthanum complexes, La(dpp)3 and La(XT), and evaluation as treatments for bone resorption disorders Metallomics 2017 9 902 909 28561856 10.1039/c7mt00133a 160 Barta CA Sachs-Barrable K Jia J Lanthanide containing compounds for therapeutic care in bone resorption disorders Dalton Trans 2007 43 5019 5030 10.1039/b705123a 17992287 161 Liao F Peng X-Y Yang F Gadolinium-doped mesoporous calcium silicate/chitosan scaffolds enhanced bone regeneration ability Mater Sci Eng C Mater Biol Appl 2019 104 109999 31499945 10.1016/j.msec.2019.109999 162 Zhu D-Y Lu B Yin J-H Gadolinium-doped bioglass scaffolds promote osteogenic differentiation of hBMSC via the Akt/GSK3β pathway and facilitate bone repair in vivo Int J Nanomedicine 2019 14 1085 1100 30804672 10.2147/IJN.S193576 PMC6375113 163 Zhao P-P Hu H-R Liu J-Y Gadolinium phosphate/chitosan scaffolds promote new bone regeneration via Smad/Runx2 pathway Chem Eng J 2019 359 1120 1129 164 Zhao P-P Ge Y-W Liu X-L Ordered arrangement of hydrated GdPO4 nanorods in magnetic chitosan matrix promotes tumor photothermal therapy and bone regeneration against breast cancer bone metastases Chem Eng J 2020 381 122694 165 Rodríguez J Mandalunis PM A review of metal exposure and its effects on bone health J Toxicol 2018 2018 4854152 30675155 10.1155/2018/4854152 PMC6323513 166 Carmouche JJ Puzas JE Zhang X Lead exposure inhibits fracture healing and is associated with increased chondrogenesis, delay in cartilage mineralization, and a decrease in osteoprogenitor frequency Environ Health Perspect 2005 113 749 755 15929899 10.1289/ehp.7596 PMC1257601 167 Strunz F Stähli C Heverhagen JT Gadolinium-based contrast agents and free gadolinium inhibit differentiation and activity of bone cell lineages Invest Radiol 2024 59 495 503 38117137 10.1097/RLI.0000000000001049 168 Milgram S Carrière M Thiebault C Cytotoxic and phenotypic effects of uranium and lead on osteoblastic cells are highly dependent on metal speciation Toxicology 2008 250 62 69 18606205 10.1016/j.tox.2008.06.003 169 Tang R Chen Y He N Effect of gadopentetate dimeglumine on bone growth in zebrafish caudal fins Toxicol Lett 2023 374 11 18 36496117 10.1016/j.toxlet.2022.12.001 ",
  "metadata": {
    "Title of this paper": "Effect of gadopentetate dimeglumine on bone growth in zebrafish caudal fins",
    "Journal it was published in:": "Investigative Radiology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490344/"
  }
}