{
  "title": "Paper_711",
  "abstract": "pmc Urol Case Rep Urol Case Rep 2867 ucr Urology Case Reports 2214-4420 Elsevier PMC12478267 PMC12478267.1 12478267 12478267 41030241 10.1016/j.eucr.2025.103212 S2214-4420(25)00283-9 103212 1 Oncology Paratesticular myxofibrosarcoma in an adult male: A rare case in an unusual anatomical site Seman Yacob Sheiferawe emjactha@gmail.com a ⁎ Abera Michael Teklehaimanot michael.thaimanot@aau.edu.et th.miki8441@gmail.com b Tema Habtamu Tieka habtamutema@gmail.com c Abdo Isa Salo isaabdo@gmail.com d Abrar Fadil Nuredin fadil.nuredin@aau.edu.et d Gebreselassie Hamlet Asfaw hamlet.asfaw.md@gmail.com e a b c d e ⁎ emjactha@gmail.com 11 2025 15 9 2025 63 496277 103212 26 7 2025 11 9 2025 14 9 2025 15 09 2025 30 09 2025 01 10 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Myxofibrosarcoma is a rare malignant soft tissue tumor, most commonly affecting the extremities of elderly individuals. Paratesticular involvement is extremely uncommon and often presents a diagnostic challenge. We present the case of a male patient who presented with a painless, progressively enlarging right-sided scrotal swelling of 4 years’ duration. Clinical examination revealed a large scrotal mass with a non-palpable right testicle. Imaging and histopathological evaluation confirmed the diagnosis of paratesticular myxofibrosarcoma. We will mainly discuss the clinical presentation, imaging findings, and pathological features of this rare tumor. Keywords Myxofibrosarcoma Paratesticular tumor Scrotal mass Magnetic resonance imaging pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction Myxofibrosarcoma (MFS) is a rare but distinct malignant tumor classified under soft tissue sarcomas. 1 , 2 3 , 4 1 , 4 Most of MFS tumors arise in the extremities, particularly in the lower limbs, which account for approximately 77 % of cases. 4 3 , 4 4 1 2 3 4 Clinically, MFS commonly presents as a painless, slow-growing soft tissue mass, often discovered incidentally or due to gradual enlargement. 1 , 4 1 2 3 4 3 Surgical resection is, currently, the primary therapy for localized paratesticular myxo fibrosarcoma. 5 2 Case presentation A 54-year-old male presented to a urologic referral clinic The mass gradually increased in size interfering with clothing and ambulation prompting him to seek care. He also reported a decreased frequency of sexual activity due to the mass. The patient had no relevant past medical or surgical comorbidity. On clinical examination, the patient had stable vital signs with an Eastern Cooperative Oncology Group performance status of 0. A large, non-tender scrotal mass of soft to firm consistency was noted. The right testis was not palpable, while the left scrotal was normally positioned and palpable. There was no inguinal lymphadenopathy or overlying skin change ( Fig. 1 Fig. 1 Pre-operative pictures of the scrotal lesion in supine (A) and standing (B) positions. Fig. 1 Baseline laboratory investigations, including complete blood count, renal and liver function tests, and serum electrolytes, were within normal limits. Scrotal ultrasonography showed a large heterogeneous mass with no clear demarcation of the right testis, and the patient underwent further evaluation with pelvic magnetic resonance imaging (MRI). Axial pelvic MRI in T2 ( Fig. 2 Fig. 2 Fig. 2 Fig. 2 Fig. 3 Fig. 3 Fig. 2 Axial Pelvic MRI in T2 (A, B), T1 (C, D), T2 coronal (E), and T2 sagittal (F) sequences: They show a large (24cm × 20cm x 14cm- CCxAPxTR) heterogeneous infiltrative right hemi-scrotal mass (blue arrowheads in A-D). The lesion shows predominantly hyperintense signal on T2 and hypointense signal on T1. The right and left testes (red arrowheads in A-D) are splayed peripherally but have a sharp border against the mass. The epididymis is not separately seen. The coronal (E) and sagittal (F) T2 images show the scrotal skin thickening to a better advantage. Fig. 2 Fig. 3 Axial T1 C+ pelvic MRI: The lesion shows significant enhancement especially in its more proximal part (A) compared to its distal part (B). Fig. 3 Afterwards, surgical excision was performed. Intraoperatively, the scrotal skin was edematous. A firm, fibrous, well-vascularized mass was identified filling the entire right hemi-scrotum without invasion of the testis or cord structures. The mass was dissected from the scrotal wall and removed with overlying skin. Redundant skin was also generously excised. The right spermatic cord was identified and followed up to the testis, and it was preserved ( Fig. 4 The patient was seen at the follow-up clinic 1 week and 3 months after the surgery, and he reported to be recovering well with no urinary or sexual dysfunction. Fig. 4 Post-operative pictures of the resected mass lesion are seen (A) and (B). The mass had areas of necrosis and hemorrhage with multinodular growth pattern on gross examination. Fig. 4 3 Histopathology Hematoxylin and Eosin Staining ( Fig. 5 Fig. 5 Hematoxylin and Eosin Stains in x10 (A, B) and x40 (C) powers: Hypocellular and hypercellular areas composed of spindle to stellate cells admixed with elongated, curvilinear blood vessels in a myxoid background consistent with MFS. Fig. 5 4 Discussion Due to the absence of characteristic radiological or biochemical markers, MFS remains challenging to diagnose preoperatively. 1 , 4 1 1 , 2 1 6 Regarding scrotal imaging, in general, ultrasonography is adequate and often can be used as a standalone imaging modality in the majority of the cases. 5 It also helps in better delineation of the origin of intrascrotal tumors (testicular or extratesticular) and the relationship of the tumor to adjacent structures. where the tumor has unusually large size 6 , 7 The MRI features of sarcomatous tumors are not specific and are shared by leiomyosarcoma, fibroma, and adenomatoid tumors. These lesions usually have a low-intensity signal on the T1 sequence and a high signal intensity on the T2 sequence. 5 , 7 5 , 7 There is limited literature addressing the roles of radiotherapy and chemotherapy in MFS, and neither modality has shown consistent efficacy in improving survival outcomes. 3 , 6 2 2 Given the rarity of MFS, especially in uncommon locations, robust survival data are lacking, and standardized therapeutic strategies for metastatic disease have not been established. 3 1 , 3 , 4 Informed patient consent Informed consent was obtained from the patient for anonymized patient information to be published in this article. CRediT authorship contribution statement Yacob Sheiferawe Seman: Michael Teklehaimanot Abera: Habtamu Tieka Tema: Isa Salo Abdo: Fadil Nuredin Abrar: Hamlet Asfaw Gebreselassie: Funding source None. Declaration of competing interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. References 1 Roland C.L. Wang W.L. Lazar A.J. Torres K.E. Myxofibrosarcoma Surg Oncol Clin N Am 25 4 2016 Oct 775 788 10.1016/j.soc.2016.05.008 Epub 2016 Jul 30. PMID: 27591498 27591498 2 Elias A. Ryan L. Sulkes A. Collins J. Aisner J. Antman K.H. Response to mesna, doxorubicin, ifosfamide, and dacarbazine in 108 patients with metastatic or unresectable sarcoma and no prior chemotherapy J Clin Oncol 7 9 1989 Sep 1208 1216 10.1200/JCO.1989.7.9.1208 PMID: 2504890 2504890 3 Merck C. Angervall L. Kindblom L.G. Odén A. Myxofibrosarcoma. A malignant soft tissue tumor of fibroblastic-histiocytic origin. A clinicopathologic and prognostic study of 110 cases using multivariate analysis Acta Pathol Microbiol Immunol Scand Suppl 282 1983 1 40 PMID: 6444190 6444190 4 Russo P. Brady M.S. Conlon K. Adult urological sarcoma J Urol 147 4 1992 Apr 1032 1036 10.1016/s0022-5347(17)37456-6 discussion 1036-7 PMID: 1552580 1552580 5 Respati E. Prapiska F.F. Sihombing B. Warli S.M. Hartati L. Adelaidey A.N. First reported case of adult paratesticular myxofibrosarcoma in Indonesia: case report and literature review Int J Surg Case Rep 93 2022 Apr 106849 10.1016/j.ijscr.2022.106849 Epub 2022 Feb 25. PMID: 35286976; PMCID: PMC8921302. rad PMC8921302 35286976 6 Sanfilippo R. Miceli R. Grosso F. Myxofibrosarcoma: prognostic factors and survival in a series of patients treated at a single institution Ann Surg Oncol 18 3 2011 Mar 720 725 10.1245/s10434-010-1341-4 Epub 2010 Sep 28. PMID: 20878245 20878245 7 Kaya M. Wada T. Nagoya S. MRI and histological evaluation of the infiltrative growth pattern of myxofibrosarcoma Skelet Radiol 37 12 2008 Dec 1085 1090 10.1007/s00256-008-0542-4 Epub 2008 Jul 16. PMID: 18629459 18629459 Abbreviations  MFS Myxofibrosarcoma MRI Magnetic resonance imaging NCCN National Comprehensive Cancer Network MAID Mesna, Doxorubicin, Ifosfamide, Dacarbazine ",
  "metadata": {
    "Title of this paper": "MRI and histological evaluation of the infiltrative growth pattern of myxofibrosarcoma",
    "Journal it was published in:": "Urology Case Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478267/"
  }
}