{
  "title": "Paper_233",
  "abstract": "pmc Int J Mol Med Int J Mol Med 1936 ijmm IJMM International Journal of Molecular Medicine 1107-3756 1791-244X Spandidos Publications PMC12488213 PMC12488213.1 12488213 12488213 40999954 10.3892/ijmm.2025.5645 ijmm-56-06-05645 1 Review Obesity in reproduction: Mechanisms from fertilization to post-uterine development (Review) Pavlović Nikola 1 Križanac Marinela 2 Kumrić Marko 1 3 Vukojević Katarina 4 5 6 Rušić Doris 7 Božić Joško 1 3  1  2  3  4  5  6  7 Correspondence to: Professor Joško Božić, Department of Pathophysiology, School of Medicine, University of Split, Soltanska 2, 21000 Split, Croatia, E-mail: josko.bozic@mefst.hr 12 2025 24 9 2025 56 6 497464 204 08 7 2025 29 8 2025 24 09 2025 02 10 2025 02 10 2025 Copyright: © 2025 Pavlović et al. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution-NonCommercial-NoDerivs License Obesity, a global health concern defined by excessive adiposity and persistent metabolic imbalance, has far-reaching implications that extend beyond standard metabolic and cardiovascular comorbidities. While the association between obesity and reproductive dysfunction is well-established, the precise molecular mechanisms underlying these associations remain incompletely understood, particularly as regards the distinction between obesity-specific effects and those mediated by dietary components or metabolic syndrome. The present review integrates currently available knowledge on the mechanisms through which obesity impairs reproductive function in both sexes, from gametogenesis to postnatal development. In males, obesity drives testicular inflammation, disrupts spermatogenesis, impairs sperm motility and DNA integrity, and alters key signaling pathways, with oxidative stress and metabolic endotoxemia as central mediators. In females, obesity induces ovarian dysfunction, alters steroidogenesis, compromises oocyte quality and disrupts follicular environments, leading to reduced fertility and adverse pregnancy outcomes. However, the relative contribution of obesity-induced inflammation vs. direct lipotoxic effects remains poorly characterized in both sexes. The present review further examines the impact of parental obesity on fertilization capacity, placental function and in utero Key words obesity reproduction fertility development in utero post-uterine dietary effects No funding was received. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Obesity, defined by an excessive accumulation of body fat resulting from chronic nutrient overconsumption, has become a significant global public health issue, not only due to its high prevalence, but also due to its associated comorbidities and the resulting disruption of adipocyte-immune cell interactions within adipose tissue ( 1 2 3 Obesity profoundly affects multiple organ systems through mechanisms involving oxidative stress, inflammation and metabolic dysregulation ( 4 5 6 10 11 12 13 14 15 Moreover, obesity-induced chronic low-grade inflammation, mediated by adipose tissue macrophages and cytokines, exacerbates oxidative damage and disrupts metabolic homeostasis. These interconnected processes underlie the pathogenesis of metabolic syndrome, increasing cardiovascular risk and organ dysfunction. Thus, oxidative stress is a central mediator linking obesity to multisystemic metabolic disturbances ( 4 16 17 Despite extensive research into the metabolic and cardiovascular complications of obesity, its effects on the reproductive system, particularly at the molecular and cellular levels, have received comparatively less attention. Recent evidence underscores that obesity profoundly disrupts reproductive health in both males and females, impairing gametogenesis, hormonal balance, fertilization, and subsequent embryonic and postnatal development ( 16 18 19 5 20 23 18 24 25 26 Despite these insights, a comprehensive review that synthesizes currently available knowledge on the mechanisms through which obesity affects the reproductive system from fertilization through post-uterine development remains lacking, at least to the best of our knowledge. The present review thus aimed to fill this gap by providing an integrative overview of the molecular mechanisms by which obesity impairs reproductive function, focusing on oxidative stress and its downstream effects at each stage, from gamete quality and fertilization to embryonic development and postnatal outcomes. By elucidating these pathways, it is hoped that the present review will inform future research and clinical strategies to mitigate the reproductive and developmental consequences of obesity. 2. Obesity as a driver of testicular inflammation The male reproductive tract consists of multiple organs, including the testes, epididymis and prostate gland, which collectively enable sperm development and androgen production ( 27 28 29 31 32 33 Obesity may compromise both sperm development and the blood-testis barrier through systemic inflammation, although exact pathways involved remain unclear. The present comprehensive overview discusses the complex association between obesity, particularly the accumulation of excess fatty acids and sugar, and signaling pathways involved in testicular development, as well as sperm maturation, motility, morphology and DNA integrity. Diet-induced obesity and its impact on testicular function and hormonal regulation Research utilizing high-fat diet (HFD) models to induce obesity has revealed significant effects of obesity on testicular function. A previous study which was performed as early as 2001 demonstrated that HFD-induced obesity increased the weight of the ventral prostate in Sprague-Dawley rats ( 34 35 36 36 2 36 et al 37 Diet-induced reproductive dysfunction in males While studies above focused on long-term HFD feeding, which induces obesity, the study by Falvo et al 38 38 39 Obesity, characterized by the excess accumulation of free fatty acids and glucose in blood and cells, is known to elevate ROS production ( 40 41 41 Another study examined the obesity-related increase in intestinal permeability, which allows the passage of intestinal bacteria into the circulation, known as metabolic endotoxemia (ME) ( 42 42 et al 43 et al 44 The impact of obesity on the male reproductive system has been observed from another perspective through the use of high-sugar mouse models, thereby mimicking metabolic syndrome (MetS). The key finding of the study by Rahali et al 45 BAX BCL2 CYP)11A1 CYP17A1 46 Table I On the other hand, the relation of obesity to testicular cancer (TC) appears to be heterogeneous. For instance, tentative evidence of an inverse association between body mass index (BMI) and testicular germ-cell tumors (TGCT) was provided in a previous meta-analysis ( 47 48 et al 49 50 51 et al 52 While several studies have assessed the impact of obesity on testicular tissue and sperm, only a small number of studies have examined the potential for reversing its effects. A recent study claimed that micronutrient-based antioxidant intervention, containing added folate, vitamin B6, choline, betaine and zinc in rats can ameliorate the effects of a HFD on testicular tissue ( 53 Nrf2 NFκB-p65 (IL)-6 IL-10 Tnfa 53 et al 54 54 54 Myrtus communis 55 56 56 In summary, data unequivocally suggest that excessive fat and sugar intake exert disruptive effects on all aspects of male reproduction, including sperm maturation, mitochondrial structure and function, oxidative stress levels, and sperm motility in both humans and rodent obesity models. However, several reports claim that normal testicular function can be restored through physical exercise and therapeutic intervention. Metabolic syndrome: Molecular pathways linking MetS to male infertility MetS is characterized by a group of conditions, including insulin resistance, dyslipidemia, hypertension and chronic low-grade inflammation. Beyond obesity alone, MetS exerts significant detrimental effects on male fertility. Insulin resistance disrupts insulin signaling pathways that are critical for testosterone biosynthesis in Leydig cells. This leads to hypogonadism and decreased support for spermatogenesis ( 66 67 66 67 Metabolic syndrome also alters adipokine profiles. Elevated leptin (hyperleptinemia) and reduced adiponectin levels negatively affect the hypothalamic-pituitary-gonadal axis. This impairment further decreases testosterone production and spermatogenesis ( 68 66 3. Obesity as a driver of ovarian dysfunction and female reproductive impairment Located within the pelvis and supported by ligaments, the female reproductive system consists of internal organs (the ovaries, fallopian tubes, uterus, cervix and vagina), as well as external genitalia ( 69 70 70 71 72 Obesity has been proven to have marked effect on female reproduction; it has been reported that obesity promotes lipid accumulation and morphological changes across the uterus, ovary and oviduct, with increased NF-κB and MAPK signaling ( 73 et al 74 The present comprehensive overview discusses the mechanistic links between obesity, particularly the accumulation of excess fatty acids and glucose, and the disruption of signaling pathways in ovarian folliculogenesis, steroidogenesis and oocyte quality. Metabolic stress and follicular development disruption induced by a high-fat diet A pivotal study from 2014 demonstrated that progressive obesity in female mice altered ovarian steroidogenic enzymes and inflammatory pathways, with NF-κB signaling elevated by 12 weeks of age and STAR protein levels reduced by 50% after 24 weeks of exposure to a HFD ( 75 CYP11A1 CYP19A1 75 76 77 Lipotoxicity, oxidative stress, and mitochondrial dysfunction in ovarian cells Exposure to a HFD induces lipotoxic stress in ovarian cells, disrupting the follicular microenvironment and compromising oocyte developmental competence. Wu et al 78 et al 79 Ppargc1a 79 Interventional studies have highlighted potential therapeutic strategies. Choi et al 80 et al 81 Hk2 Pfkfb3 81 Hormonal imbalance, inflammation and fertility outcomes in obese females Recent evidence suggests that HFD-induced oxidative stress disrupts the ovarian microenvironment by impairing oocyte mitochondrial function, thereby accelerating follicular atresia through ROS-mediated DNA damage ( 82 83 82 2 84 Studies on animals have demonstrated that female rodents fed a HFD exhibit reduced ovarian antioxidant enzyme activity, resulting in oocyte mitochondrial dysfunction. This oxidative damage disrupts ATP production and induces lipid peroxidation in granulosa cells, impairing follicular development. Studies on humans corroborate these findings, demonstrating elevated ROS levels in the follicular fluid of obese women undergoing fertility treatments, which are associated with reduced oocyte maturation rates and embryo quality ( 85 87 The inflammatory milieu in obesity further exacerbates redox imbalance through adipose-derived cytokines, such as TNF-α and IL-6, which activate signaling pathways promoting granulosa cell apoptosis ( 87 87 88 Fig. 1 Epidemiological research has reported that women with obesity have a 2.7-fold increased risk of infertility and a 25-37% higher risk of miscarriage compared to women of normal weight ( 89 90 91 Table II Apart from the physiological impact on the uterus and ovaries, obesity increases the risk of developing endometrial cancer, which can be decreased through weight loss by recruiting protective immune cell types to the endometrium ( 92 93 Weight loss through lifestyle modifications, pharmacological intervention, or bariatric surgery has been shown to improve menstrual regularity, reduce androgen levels, enhance ovulation and increase spontaneous pregnancy rates in obese women. These improvements underscore the importance of addressing obesity as a modifiable risk factor to restore reproductive potential ( 94 95 In summary, substantial evidence suggests that the excessive consumption of fats and sugars has a detrimental effect on various aspects of female reproductive health. This includes ovarian folliculogenesis, steroid hormone production, oxidative balance and oocyte quality. These disruptions are consistently observed in both human studies and animal models of obesity, emphasizing the significant effects of metabolic dysregulation on female fertility. Recent research suggests that lifestyle changes, such as moderate-intensity exercise and targeted therapeutic interventions like antioxidant supplementation, may help reduce these harmful effects and restore normal ovarian function. These findings highlight the importance of comprehensive strategies to address obesity-related reproductive dysfunction in women. 4. Fertilization capacity as an indicator of metabolic health Placental development and physiology. Fertilization is initiated when a sperm penetrates the zona pellucida of an egg, forming a zygote. This process requires viable gametes, accurate sperm transport, capacitation, hyperactivation, acrosome reaction and membrane fusion ( 99 104 104 106 Initial connections between obesity and fertilization emerged through the introduction and development of in vitro 100 107 108 109 Molecular and cellular mechanisms linking obesity to impaired fertilization From a molecular perspective, obesity impairs sperm function. HFD-fed male mice demonstrate reduced sperm-oocyte binding ability, indicating impaired sperm recognition ( 43 110 et al 111 111 112 in vitro 113 114 39 Dnmt 115 By contrast, an intergenerational murine model combining regular chow with a high-energy supplement indicated that an overweight status was associated with higher ovulation rates and the increased development of fertilized oocytes, although embryo quality was poor ( 113 116 5. Dependence of in utero Impact of maternal obesity on placental function and fetal organ development. The placenta is an essential organ for normal in utero 117 in utero 118 The placenta itself is affected by maternal obesity, with its effects being observable through changes in placental morphology, metabolism, inflammation, oxidative state, endothelial function and altered angiogenesis ( 119 120 121 121 121 122 123 124 To assess the impact of placental and endometrial changes identified in the aforementioned studies on fetal development, several studies were conducted. Ford et al 125 125 122 The muscular system has also been found to be affected by maternal obesity and exposure to excessive glucocorticoids ( 126 127 128 129 IRS2 PIK3CB SREBP1c 130 Notably, the results of a study performed on baboon fetuses of obese baboon mothers who consumed a high-sugar, HFD during pregnancy demonstrated that the fetuses developed a fatty liver along with significant metabolic disruption in the liver ( 131 131 132 Several studies have provided evidence of maternal obesity-related impairment of kidney development ( 133 134 et al 133 in utero 134 et al 135 Epigenetic and molecular mechanisms linking maternal obesity to long-term offspring health Emerging evidence also highlights the disruption of fetal oocyte development by maternal obesity. The recent stud by Tang et al 136 Stra8 Sycp3 136 Currently, there is limited research available investigating whether maternal or paternal obesity directly contributes to the occurrence of chromosomal abnormalities in offspring, highlighting a significant gap in understanding the parental origins of such genetic risks. A previous study on obesity has brought epigenetic mechanisms, including DNA methylation, histone modifications and miRNAs into focus during pregnancy as a significant indicator of disease susceptibility in later stages of human life ( 137 in utero 138 There is no doubt that parental obesity is a critical indicator of impaired fetal development. The current findings are summarized in Fig. 2 6. Obesity and offspring Research and mechanisms linking parental obesity to offspring health. The association between maternal or paternal obesity and health outcomes of the offspring has emerged as a critical area of research over the past several decades. In the early 90s, research focused on the outcomes of pregnancy. For instance, a previous study in 1990 reported that the perinatal mortality rate increased from 37 to 121 per 1,000 in obese women, indicating that even since then, it was proven that obese women were more likely to undergo premature labor with a negative outcome ( 139 140 141 Recent studies have focused on the signaling pathways involved in the effects of maternal obesity on the offspring. The study by Moeckli et al 142 142 143 144 145 Sertorio et al 146 146 146 147 Epigenetic, cognitive and metabolic impacts of parental obesity Notably, a subsequent study of methylation profiles of genome-wide CpG sites in blood samples from a pediatric longitudinal cohort revealed the influence of the weight of mothers on the methylome of offspring ( 148 148 149 149 150 151 Conversely, paternal obesity has been shown to have a significant effect on the cognitive functions of offspring in murine models. The underlying mechanism involves sperm-derived methylation of the brain-derived neurotrophic factor (BDNF) gene promoter, which disrupts BDNF/tyrosine receptor kinase B signaling ( 132 152 153 154 154 155 156 157 158 159 Effects of maternal obesity on breast milk composition and infant development In addition to gamete-related influences, maternal obesity has been found to affect postnatal development through alterations in breast milk composition. Its normal composition includes macronutrients such as lactose, fats and proteins, as well as micronutrients, immune modulatory proteins (such as immunoglobulins and cytokines), growth factors, vitamins and a diverse microbiota ( 160 161 As demonstrated in a previous study, maternal obesity appears to significantly alter the composition of breast milk, particularly the lipid profile. Obese women display increased breast milk fat and caloric content from foremilk to hindmilk, with the average milk caloric value being 11% greater ( 162 163 et al 164 164 et al 164 165 165 166 166 167 167 Other components of human milk, named human milk oligosaccharides (HMOs), which serve as a source of energy for commensal intestinal microorganisms, have been studied in the context of obesity. These complex carbohydrates, unique to human milk, have been studied in a research project involving Mexican women ( 168 169 Bifidobacteria 169 An overwhelming body of evidence suggests that maternal obesity, as well as other metabolic disorders such as diabetes, is the leading cause of divergent offspring development. However, paternal obesity has become a focus of research due to the emerging evidence of sperm-transmitted epigenetic changes that have a significant effect on offspring. 7. Current controversies and unresolved debates Despite notable advances made in the understanding of the association between obesity and reproductive health, fundamental gaps and critical controversies remain that limit the ability of researchers to develop effective therapeutic interventions. A major ongoing challenge is to disentangle the direct effects of obesity itself from those attributable to dietary components, metabolic syndrome, and associated comorbidities. While a number of experimental models induce obesity using high-fat or high-sugar diets, the independent contributions of excess adiposity vs. specific nutritional factors on reproductive dysfunction have not yet been fully clarified. Molecular pathways, such as oxidative stress, chronic inflammation and epigenetic modifications potentially mediate these distinct influences; however, these require rigorous investigations using carefully controlled experimental designs that isolate obesity from dietary variables ( Fig. 3 The direct effects of metabolism on gametes, fertilization and offspring health are incompletely understood. New evidence indicates that parental obesity alters DNA methylation, histone marks and non-coding RNA profiles in germ cells, potentially transmitting metabolic risks across generations. However, it remains controversial whether these epigenetic changes are causally linked to unfavorable reproductive outcomes or represent biomarkers for broader metabolic dysregulation. The relative contributions of maternal and paternal obesity to programming the development and disease susceptibility of offspring are also not yet clear. The intrauterine microenvironment, a crucial factor for fetal development and long-term health, remains an under-researched, yet therapeutically promising area. A comprehensive characterization of the effects of obesity on uterine physiology, including pH, oxygenation, immune cell populations and molecular signaling networks is required. Cutting-edge technologies, such as single-cell RNA sequencing, spatial transcriptomics and metabolomics provide opportunities to map the molecular landscape of the obese reproductive tract with unprecedented resolution. Another area of debate concerns the reversibility and treatment of obesity-induced reproductive impairments. Although preclinical studies have shown promise for antioxidant therapy, pharmacological agents and lifestyle interventions, including exercise and food modification, further research is required to confirm their effectiveness and durability across a range of human populations. Identifying precise molecular targets amenable to therapeutic modulation remains an urgent priority to translate mechanistic findings into clinical applications. Key signaling pathways, including insulin/IGF signaling, AMPK, mTOR and inflammatory mediators, appear to be differentially regulated in obesity, affecting gametogenesis, steroidogenesis and embryo development. A more in-depthy understanding of their crosstalk, as well as the roles of epigenetic regulators and non-coding RNAs, will be critical for developing personalized interventions. To address these controversies and gaps, further research is required to integrate sophisticated molecular approaches with longitudinal cohort studies and experimentally rigorous models. Longitudinal tracking of metabolic and reproductive changes will clarify temporal relationships and causal mechanisms. Ultimately, this integrated effort is essential to improve diagnostic precision, guide the development of targeted interventions and optimize reproductive outcomes, thereby advancing clinical care and enhancing multigenerational health. 8. Conclusions The present comprehensive review indicates that obesity exerts profound and multifaceted effects on reproductive health through complex molecular mechanisms that remain incompletely understood. While substantial progress has been made in documenting obesity-reproduction associations, the field now requires a fundamental shift toward mechanistic investigations that can guide therapeutic development. The available evidence clearly demonstrates that obesity affects reproductive function through multiple pathways, including oxidative stress, chronic inflammation, hormonal disruption and epigenetic modifications. However, critical gaps remain in the understanding of the relative importance of these mechanisms, their temporal associations and their therapeutic targetability. The distinction between obesity-specific effects and those attributable to dietary factors or metabolic syndrome is a particularly important area that requires systematic investigation. The identification of specific molecular pathways, such as mitochondrial dysfunction, inflammatory signaling and epigenetic modifications, provides a foundation for developing targeted interventions. However, the translation of these mechanistic insights into effective clinical therapies requires substantial additional research, including well-designed clinical trials with mechanistic endpoints. Future research is warranted to prioritize mechanistic studies that can distinguish reversible from irreversible changes in obesity-induced reproductive dysfunction, identify specific therapeutic targets, and develop personalized interventions based on individual metabolic and reproductive profiles. Only through such systematic, mechanistic investigation can we hope to develop effective strategies for preventing and treating obesity-induced reproductive dysfunction. The integration of advanced molecular techniques with carefully designed clinical studies offers unprecedented opportunities to understand and address the reproductive consequences of obesity. This represents both a scientific challenge and a clinical imperative, given the global prevalence of obesity and its impact on reproductive health across generations. Acknowledgements Not applicable. Availability of data and materials Not applicable. Authors' contributions NP, MKr, MKu, KV and JB conceptualized the study. NP and MKr were involved in the literature search. NP, MKr, KV, DR and JB were involved in verifying the accuracy of the data extracted from the literature. NP, MKr, MKu, KV, DR and JB were involved in the writing and preparation of the original draft of the manuscript, and in the writing, reviewing and editing of the manuscript. NP and MKr were involved in the preparation of the figures. KV and JB supervised the study. JB was involved in project administration. All authors have read and approved the final manuscript. Data authentication is not applicable. Ethics approval and consent to participate Not applicable. Patient consent for publication Not applicable. Competing interests The authors declare that they have no competing interests. Abbreviations ADF alternate-day fasting AR androgen receptor ART assisted reproductive technology BDNF brain-derived neurotrophic factor BMI body mass index CR caloric restriction CRISP4 cysteine-rich secretory protein 4 DDE dichlorodiphenyldichloroethylene GPR54 G protein-coupled receptor 54 GPX glutathione peroxidase HFD high-fat diet HMOs human milk oligosaccharides IGF insulin-like growth factor IVF in vitro LH luteinizing hormone MAPKs mitogen-activated protein kinases ME metabolic endotoxemia NRF2 nuclear factor erythroid 2-related factor 2 OB obesogenic PCOS polycystic ovary syndrome PORs poor ovarian responders ROS reactive oxygen species SAT subcutaneous adipose tissue SIRT1 sirtuin 1 SOD superoxide dismutase TC testicular cancer TGCT testicular germ-cell tumor TRF time-restricted feeding VAT visceral adipose tissue References 1 Aida XMU Ivan TV Juan G JR Adipose tissue immunometabolism: unveiling the intersection of metabolic and immune regulation Rev Invest Clin 76 65 79 2024 38718804 10.24875/RIC.23000231 2 Puljiz Z Kumric M Vrdoljak J Martinovic D Ticinovic Kurir T Krnic MO Urlic H Puljiz Z Zucko J Dumanic P Obesity, gut microbiota, and metabolome: From pathophysiology to nutritional interventions Nutrients 15 2236 2023 10.3390/nu15102236 37242119 PMC10223302 3 Gallo G Desideri G Savoia C Update on obesity and cardiovascular risk: From pathophysiology to clinical management Nutrients 16 2781 2024 10.3390/nu16162781 39203917 PMC11356794 4 Furukawa S Fujita T Shimabukuro M Iwaki M Yamada Y Nakajima Y Nakayama O Makishima M Matsuda M Shimomura I Increased oxidative stress in obesity and its impact on metabolic syndrome J Clin Invest 114 1752 1761 2004 10.1172/JCI21625 15599400 PMC535065 5 Gregor MF Hotamisligil GS Inflammatory mechanisms in obesity Annu Rev Immunol 29 415 445 2011 10.1146/annurev-immunol-031210-101322 21219177 6 White U Adipose tissue expansion in obesity, health, and disease Front Cell Dev Biol 11 1188844 2023 10.3389/fcell.2023.1188844 37181756 PMC10169629 7 Virtue S Vidal-Puig A Adipose tissue expandability, lipotoxicity and the metabolic syndrome-an allostatic perspective Biochim Biophys Acta 1801 338 349 2010 10.1016/j.bbalip.2009.12.006 20056169 8 Fabbrini E Sullivan S Klein S Obesity and nonalcoholic fatty liver disease: Biochemical, metabolic, and clinical implications Hepatology 51 679 689 2010 10.1002/hep.23280 20041406 PMC3575093 9 Palacios-Marin I Serra D Jimenez-Chillarón J Herrero L Todorčević M Adipose tissue dynamics: Cellular and lipid turnover in health and disease Nutrients 15 3968 2023 10.3390/nu15183968 37764752 PMC10535304 10 Pessayre D Fromenty B NASH: A mitochondrial disease J Hepatol 42 928 940 2005 10.1016/j.jhep.2005.03.004 15885365 11 Ramachandran A Jaeschke H Oxidative stress and acute hepatic injury Curr Opin Toxicol 7 17 21 2018 10.1016/j.cotox.2017.10.011 29399645 PMC5793911 12 Allameh A Niayesh-Mehr R Aliarab A Sebastiani G Pantopoulos K Oxidative stress in liver pathophysiology and disease Antioxidants 12 1653 2023 10.3390/antiox12091653 37759956 PMC10525124 13 Goodpaster BH He J Watkins S Kelley DE Skeletal muscle lipid content and insulin resistance: Evidence for a paradox in endurance-trained athletes J Clin Endocrinol Metab 86 5755 5761 2001 10.1210/jcem.86.12.8075 11739435 14 Akhmedov D Berdeaux R The effects of obesity on skeletal muscle regeneration Front Physiol 4 371 2013 10.3389/fphys.2013.00371 24381559 PMC3865699 15 Thaler JP Yi CX Schur EA Guyenet SJ Hwang BH Dietrich MO Zhao X Sarruf DA Izgur V Maravilla KR Obesity is associated with hypothalamic injury in rodents and humans J Clin Invest 122 153 162 2012 10.1172/JCI59660 22201683 PMC3248304 16 Lumeng CN Bodzin JL Saltiel AR Obesity induces a phenotypic switch in adipose tissue macrophage polarization J Clin Invest 117 175 184 2007 10.1172/JCI29881 17200717 PMC1716210 17 Xu H Barnes GT Yang Q Tan G Yang D Chou CJ Sole J Nichols A Ross JS Tartaglia LA Chen H Chronic inflammation in fat plays a crucial role in the development of obesity-related insulin resistance J Clin Invest 112 1821 1830 2003 10.1172/JCI200319451 14679177 PMC296998 18 Broughton DE Moley KH Obesity and female infertility: Potential mediators of obesity's impact Fertil Steril 107 840 847 2017 10.1016/j.fertnstert.2017.01.017 28292619 19 Agarwal A Mulgund A Hamada A Chyatte MR A unique view on male infertility around the globe Reprod Biol Endocrinol 13 37 2015 10.1186/s12958-015-0032-1 25928197 PMC4424520 20 Yu X Xu J Song B Zhu R Liu J Liu YF Ma YJ The role of epigenetics in women's reproductive health: The impact of environmental factors Front Endocrinol (Lausanne) 15 1399757 2024 10.3389/fendo.2024.1399757 39345884 PMC11427273 21 Cecchino GN Seli E Alves da Motta EL García-Velasco JA The role of mitochondrial activity in female fertility and assisted reproductive technologies: Overview and current insights Reprod Biomed Online 36 686 697 2018 10.1016/j.rbmo.2018.02.007 29598846 22 Pasquali R Vicennati V Cacciari M Pagotto U The hypothalamic-pituitary-adrenal axis activity in obesity and the metabolic syndrome Ann N Y Acad Sci 1083 111 128 2006 10.1196/annals.1367.009 17148736 23 Agarwal A Gupta S Sharma RK Role of oxidative stress in female reproduction Reprod Biol Endocrinol 3 28 2005 10.1186/1477-7827-3-28 16018814 PMC1215514 24 Soubry A Epigenetic inheritance and evolution: A paternal perspective on dietary influences Prog Biophys Mol Biol 118 79 85 2015 10.1016/j.pbiomolbio.2015.02.008 25769497 25 MacDonald AA Herbison GP Showell M Farquhar CM The impact of body mass index on semen parameters and reproductive hormones in human males: A systematic review with meta-analysis Hum Reprod Update 16 293 311 2009 10.1093/humupd/dmp047 19889752 26 Catalano PM Shankar K Obesity and pregnancy: Mechanisms of short term and long term adverse consequences for mother and child BMJ 356 j1 2017 10.1136/bmj.j1 28179267 PMC6888512 27 Stevens A Lowe J Chapter 16: Male reproductive system Human Histology 3rd edition Elsevier-Health Sciences Division 327 343 2025 28 Cheng CY Mruk DD The blood-testis barrier and its implications for male contraception Pharmacol Rev 64 16 64 2012 10.1124/pr.110.002790 22039149 PMC3250082 29 Griswold MD Spermatogenesis: The commitment to meiosis Physiol Rev 96 1 17 2016 10.1152/physrev.00013.2015 26537427 PMC4698398 30 Oduwole OO Peltoketo H Huhtaniemi IT Role of follicle-stimulating hormone in spermatogenesis Front Endocrinol (Lausanne) 9 763 2018 10.3389/fendo.2018.00763 30619093 PMC6302021 31 Naamneh Elzenaty R du Toit T Flück CE Basics of androgen synthesis and action Best Pract Res Clin Endocrinol Metab 36 101665 2022 10.1016/j.beem.2022.101665 35595638 32 Johnson L Thompson DL Jr Varner DD Role of Sertoli cell number and function on regulation of spermatogenesis Anim Reprod Sci 105 23 51 2008 10.1016/j.anireprosci.2007.11.029 18242891 33 Griswold MD The central role of Sertoli cells in spermatogenesis Semin Cell Dev Biol 9 411 416 1998 10.1006/scdb.1998.0203 9813187 34 Cai X Haleem R Oram S Cyriac J Jiang F Grayhack JT Kozlowski JM Wang Z High fat diet increases the weight of rat ventral prostate Prostate 49 1 8 2001 10.1002/pros.1112 11550205 35 Migliaccio V Sica R Scudiero R Simoniello P Putti R Lionetti L Physiological adaptation to simultaneous chronic exposure to high-fat diet and dichlorodipheniletylhene (DDE) in wistar rat testis Cells 8 443 2019 10.3390/cells8050443 31083466 PMC6562479 36 Feng J Xu R Li Y Zhou Q Song G Deng Y Yan Y The effect of high-fat diet and exercise on KISS-1/GPR54 expression in testis of growing rats Nutr Metab (Lond) 18 1 2021 10.1186/s12986-020-00517-0 33407658 PMC7788936 37 Ma J Bi J Sun B Li H Li Y Wang S Zinc improves semen parameters in high-fat diet-induced male rats by regulating the expression of LncRNA in testis tissue Biol Trace Elem Res 201 4793 4805 2023 10.1007/s12011-022-03550-7 36600170 38 Falvo S Minucci S Santillo A Senese R Chieffi Baccari G Venditti M A short-term high-fat diet alters rat testicular activity and blood-testis barrier integrity through the SIRT1/NRF2/MAPKs signaling pathways Front Endocrinol (Lausanne) 14 1274035 2023 10.3389/fendo.2023.1274035 38027181 PMC10643185 39 Merino O Sánchez R Gregorio MB Sampaio F Risopatrón J Effect of high-fat and vitamin D deficient diet on rat sperm quality and fertility Theriogenology 125 6 11 2019 10.1016/j.theriogenology.2018.09.030 30368129 40 Krizanac M Mass Sanchez PB Weiskirchen R Asimakopoulos A A scoping review on lipocalin-2 and its role in non-alcoholic steatohepatitis and hepatocellular carcinoma Int J Mol Sci 22 2865 2021 10.3390/ijms22062865 33799862 PMC8000927 41 Jing J Peng Y Fan W Han S Peng Q Xue C Qin X Liu Y Ding Z Obesity-induced oxidative stress and mitochondrial dysfunction negatively affect sperm quality FEBS Open Bio 13 763 778 2023 10.1002/2211-5463.13589 36866962 PMC10068321 42 Pearce KL Hill A Tremellen KP Obesity related metabolic endotoxemia is associated with oxidative stress and impaired sperm DNA integrity Basic Clin Androl 29 6 2019 10.1186/s12610-019-0087-5 31114691 PMC6513521 43 Bakos HW Mitchell M Setchell BP Lane M The effect of paternal diet-induced obesity on sperm function and fertilization in a mouse model Int J Androl 34 5 Pt 1 402 410 2011 10.1111/j.1365-2605.2010.01092.x 20649934 44 Han J Zhao C Guo H Liu T Li Y Qi Y Deussing JM Zhang Y Tan J Han H Ma X Obesity induces male mice infertility via oxidative stress, apoptosis, and glycolysis Reproduction 166 27 36 2023 10.1530/REP-23-0097 37140983 45 Rahali D Dallagi Y Hupkens E Veegh G Mc Entee K Asmi ME El Fazaa S El Golli N Spermatogenesis and steroidogenesis disruption in a model of metabolic syndrome rats Arch Physiol Biochem 129 222 232 2023 10.1080/13813455.2020.1812665 32886530 46 Saez Lancellotti TE Boarelli PV Monclus MA Cabrillana ME Clementi MA Espínola LS Cid Barría JL Vincenti AE Santi AG Fornés MW Hypercholesterolemia impaired sperm functionality in rabbits PLoS One 5 e13457 2010 10.1371/journal.pone.0013457 20976152 PMC2956674 47 Lerro CC McGlynn KA Cook MB A systematic review and meta-analysis of the relationship between body size and testicular cancer Br J Cancer 103 1467 1474 2010 10.1038/sj.bjc.6605934 20978513 PMC2990613 48 Bjørge T Tretli S Lie AK Engeland A The impact of height and body mass index on the risk of testicular cancer in 600,000 Norwegian men Cancer Causes Control 17 983 987 2006 16841265 10.1007/s10552-006-0032-8 49 Dieckmann KP Hartmann JT Classen J Diederichs M Pichlmeier U Is increased body mass index associated with the incidence of testicular germ cell cancer? J Cancer Res Clin Oncol 135 731 738 2009 10.1007/s00432-008-0504-1 19002497 PMC12160164 50 Garner MJ Birkett NJ Johnson KC Shatenstein B Ghadirian P Krewski D Canadian Cancer Registries Epidemiology Research Group Dietary risk factors for testicular carcinoma Int J Cancer 106 934 941 2003 10.1002/ijc.11327 12918073 51 Gür Özcan SG Erkan M Baralı D Erkan A The importance of body fat composition evaluated by computed tomography and its prognostic significance in patients with testicular cancer Istanb Med J 26 37 41 2025 10.4274/imj.galenos.2025.85353 52 Puri D Riviere P Meagher M Morgan K Nelson T Yuen K Pandit K Yodkhunnatham N Taylor J Herchenhorn D Metabolic syndrome among testicular cancer survivors: Long-term follow-up of the veterans affairs health system Cancer Med 14 e70858 2025 10.1002/cam4.70858 40256970 PMC12010195 53 Billah MM Khatiwada S Lecomte V Morris MJ Maloney CA Ameliorating high-fat diet-induced sperm and testicular oxidative damage by micronutrient-based antioxidant intervention in rats Eur J Nutr 61 3741 3753 2022 10.1007/s00394-022-02917-9 35708759 PMC9464124 54 Suleiman JB Mohamed M Abu Bakar AB Zakaria Z Othman ZA Nna VU Therapeutic effects of bee bread on obesity-induced testicular-derived oxidative stress, inflammation, and apoptosis in high-fat diet obese rat model Antioxidants (Basel) 11 255 2022 10.3390/antiox11020255 35204140 PMC8868291 55 Tüfek NH Yahyazadeh A Altunkaynak BZ Protective effect of indole-3-carbinol on testis of a high fat diet induced obesity Biotech Histochem 98 1 12 2023 10.1080/10520295.2022.2073612 35703014 56 Lin T Zhang S Zhou Y Wu L Liu X Huang H Small RNA perspective of physical exercise-related improvement of male reproductive dysfunction due to obesity Front Endocrinol (Lausanne) 13 1038449 2022 10.3389/fendo.2022.1038449 36531465 PMC9756842 57 Li Y Liu L Wang B Xiong J Li Q Wang J Chen D Impairment of reproductive function in a male rat model of non-alcoholic fatty liver disease and beneficial effect of N-3 fatty acid supplementation Toxicol Lett 222 224 232 2013 10.1016/j.toxlet.2013.05.644 23747427 58 Komninos D Ramos L van der Heijden GW Morrison MC Kleemann R van Herwaarden AE Kiliaan AJ Arnoldussen IAC High fat diet-induced obesity prolongs critical stages of the spermatogenic cycle in a Ldlr-/-.Leiden mouse model Sci Rep 12 430 2022 10.1038/s41598-021-04069-y 35017550 PMC8752771 59 Ahangarpour A Oroojan AA Khorsandi L Arzani G Afshari G Effects of betulinic acid on the male reproductive system of a streptozotocin-nicotinamide-induced diabetic mouse model World J Mens Health 34 209 216 2016 10.5534/wjmh.2016.34.3.209 28053951 PMC5209562 60 Ruiz-Valderrama L Mendoza-Sánchez JE Rodríguez-Tobón E Arrieta-Cruz I González-Márquez H Salame-Méndez PA Tarragó-Castellanos R Cortés-Barberena E Rodríguez-Tobón A Arenas-Ríos E High-fat diets disturb rat epididymal sperm maturation Int J Mol Sci 26 1850 2025 10.3390/ijms26051850 40076475 PMC11899043 61 Zhang W Tian Z Qi X Chen P Yang Q Guan Q Ye J Yu C Switching from high-fat diet to normal diet ameliorate BTB integrity and improve fertility potential in obese male mice Sci Rep 13 14152 2023 10.1038/s41598-023-41291-2 37644200 PMC10465505 62 Kobori T Iwabu M Okada-Iwabu M Ohuchi N Kikuchi A Yamauchi N Kadowaki T Yamauchi T Kasuga M Decreased AdipoR1 signaling and its implications for obesity-induced male infertility Sci Rep 14 5701 2024 10.1038/s41598-024-56290-0 38459078 PMC10923778 63 Yi X Gao H Chen D Tang D Huang W Li T Ma T Chang B Effects of obesity and exercise on testicular leptin signal transduction and testosterone biosynthesis in male mice Am J Physiol Regul Integr Comp Physiol 312 R501 R510 2017 10.1152/ajpregu.00405.2016 28100475 64 El-Shehawi AM El-Shazly S Ahmed M Alkafafy M Sayed S Farouk S Alotaibi SS Elseehy MM Transcriptome analysis of testis from HFD-induced obese rats (Rattus norvigicus) indicated predisposition for male infertility Int J Mol Sci 21 6493 2020 10.3390/ijms21186493 32899471 PMC7554891 65 Carvalho MG Silva KM Aristizabal VHV Ortiz PEO Paranzini CS Melchert A Amaro JL Souza FF Effects of obesity and diabetes on sperm cell proteomics in rats J Proteome Res 20 2628 2642 2021 10.1021/acs.jproteome.0c01044 33705140 66 Lotti F Marchiani S Corona G Maggi M Metabolic syndrome and reproduction Int J Mol Sci 22 1988 2021 10.3390/ijms22041988 33671459 PMC7922007 67 Salvio G Ciarloni A Cutini M Delli Muti N Finocchi F Perrone M Rossi S Balercia G Metabolic syndrome and male fertility: Beyond heart consequences of a complex cardiometabolic endocrinopathy Int J Mol Sci 23 5497 2022 10.3390/ijms23105497 35628307 PMC9143238 68 Service CA Puri D Al Azzawi S Hsieh TC Patel DP The impact of obesity and metabolic health on male fertility: A systematic review Fertil Steril 120 1098 1111 2023 10.1016/j.fertnstert.2023.10.017 37839720 69 Ford C An overview of the female reproductive system Br J Nurs 32 420 426 2023 10.12968/bjon.2023.32.9.420 37173086 70 Rosner J Samardzic T Sarao MS Physiology, female reproduction StatPearls (Internet) StatPearls Publishing Treasure Island, FL 2025 30725817 71 Bukovsky A Svetlikova M Caudle MR Oogenesis in cultures derived from adult human ovaries Reprod Biol Endocrinol 3 17 2005 10.1186/1477-7827-3-17 15871747 PMC1131924 72 Hanuman S Pande G Nune M Current status and challenges in uterine myometrial tissue engineering Bioengineered 14 2251847 2023 10.1080/21655979.2023.2251847 37665570 PMC10478746 73 Gao X Li Y Ma Z Jing J Zhang Z Liu Y Ding Z Obesity induces morphological and functional changes in female reproductive system through increases in NF-κB and MAPK signaling in mice Reprod Biol Endocrinol 19 148 2021 10.1186/s12958-021-00833-x 34560886 PMC8462000 74 St-Germain LE Castellana B Baltayeva J Beristain AG Maternal obesity and the uterine immune cell landscape: The shaping role of inflammation Int J Mol Sci 21 3776 2020 10.3390/ijms21113776 32471078 PMC7312391 75 Nteeba J Ganesan S Keating AF Progressive obesity alters ovarian folliculogenesis with impacts on pro-inflammatory and steroidogenic signaling in female mice Biol Reprod 91 86 2014 10.1095/biolreprod.114.121343 25143355 PMC4435031 76 Tasaki H Munakata Y Arai S Murakami S Kuwayama T Iwata H The effect of high glucose concentration on the quality of oocytes derived from different growth stages of follicles J Mamm Ova Res 32 41 48 2015 10.1274/jmor.32.41 77 Skaznik-Wikiel ME Swindle DC Allshouse AA Polotsky AJ McManaman JL High-fat diet causes subfertility and compromised ovarian function independent of obesity in mice Biol Reprod 94 108 2016 10.1095/biolreprod.115.137414 27030045 PMC4939738 78 Wu LL Dunning KR Yang X Russell DL Lane M Norman RJ Robker RL High-fat diet causes lipotoxicity responses in cumulus-oocyte complexes and decreased fertilization rates Endocrinology 151 5438 5445 2010 10.1210/en.2010-0551 20861227 79 Zhu Q Li F Wang H Wang X Xiang Y Ding H Wu H Xu C Weng L Cai J Single-cell RNA sequencing reveals the effects of high-fat diet on oocyte and early embryo development in female mice Reprod Biol Endocrinol 22 105 2024 10.1186/s12958-024-01279-7 39164729 PMC11334609 80 Choi HG Kim JK Kwak DH Cho JR Kim JY Kim BJ Jung KY Choi BK Shin MK Choo YK Effects of high molecular weight water-soluble chitosan on in vitro fertilization and ovulation in mice fed a high-fat diet Arch Pharm Res 25 178 183 2002 10.1007/BF02976560 12009032 81 Morimoto A Rose RD Smith KM Dinh DT Umehara T Winstanley YE Shibahara H Russell DL Robker RL Granulosa cell metabolism at ovulation correlates with oocyte competence and is disrupted by obesity and aging Hum Reprod 39 2053 2066 2024 10.1093/humrep/deae154 39013118 PMC11373349 82 Di Berardino C Barceviciute U Camerano Spelta Rapini C Peserico A Capacchietti G Bernabò N Russo V Gatta V Konstantinidou F Donato M Barboni B High-fat diet-negative impact on female fertility: From mechanisms to protective actions of antioxidant matrices Front Nutr 11 1415455 2024 10.3389/fnut.2024.1415455 38915855 PMC11194403 83 Yong W Wang J Leng Y Li L Wang H Role of obesity in female reproduction Int J Med Sci 20 366 375 2023 10.7150/ijms.80189 36860674 PMC9969507 84 Gitsi E Livadas S Argyrakopoulou G Nutritional and exercise interventions to improve conception in women suffering from obesity and distinct nosological entities Front Endocrinol (Lausanne) 15 1426542 2024 10.3389/fendo.2024.1426542 39006367 PMC11239444 85 Rakic D Joksimovic Jovic J Jakovljevic V Zivkovic V Nikolic M Sretenovic J Nikolic M Jovic N Bicanin Ilic M Arsenijevic P High fat diet exaggerate metabolic and reproductive PCOS features by promoting oxidative stress: An improved EV model in rats Medicina (Kaunas) 59 1104 2023 10.3390/medicina59061104 37374308 PMC10301084 86 Mirseyyed SF Zavareh S Nasiri M Hashemi-Moghaddam H An experimental study on the oxidative status and inflammatory levels of a rat model of polycystic ovary syndrome induced by letrozole and a new high-fat diet Int J Fertil Steril 18 45 53 2023 38041459 10.22074/IJFS.2023.1972296.1391 PMC10692749 87 Zheng L Yang L Guo Z Yao N Zhang S Pu P Obesity and its impact on female reproductive health: Unraveling the connections Front Endocrinol (Lausanne) 14 1326546 2024 10.3389/fendo.2023.1326546 38264286 PMC10803652 88 Heng N Zhu H Talukder AK Zhao S Obesity and oxidative stress: Implications for female fertility Anim Res One Health 2 377 399 2024 10.1002/aro2.82 89 Dağ ZÖ Dilbaz B Impact of obesity on infertility in women J Turk Ger Gynecol Assoc 16 111 117 2015 10.5152/jtgga.2015.15232 26097395 PMC4456969 90 Sam S Obesity and polycystic ovary syndrome Obes Manag 3 69 73 2007 10.1089/obe.2007.0019 20436797 PMC2861983 91 Barber TM Hanson P Weickert MO Franks S Obesity and polycystic ovary syndrome: Implications for pathogenesis and novel management strategies Clin Med Insights Reprod Health 13 1179558119874042 2019 10.1177/1179558119874042 31523137 PMC6734597 92 Naqvi A MacKintosh ML Derbyshire AE Tsakiroglou AM Walker TDJ McVey RJ Bolton J Fergie M Bagley S Ashton G The impact of obesity and bariatric surgery on the immune microenvironment of the endometrium Int J Obes (Lond) 46 605 612 2022 10.1038/s41366-021-01027-6 34857870 PMC8872994 93 Nagashima M Miwa N Hirasawa H Katagiri Y Takamatsu K Morita M Genome-wide DNA methylation analysis in obese women predicts an epigenetic signature for future endometrial cancer Sci Rep 9 6469 2019 10.1038/s41598-019-42840-4 31015518 PMC6478742 94 Sim KA Partridge SR Sainsbury A Does weight loss in overweight or obese women improve fertility treatment outcomes? A systematic review Obes Rev 15 839 850 2014 10.1111/obr.12217 25132280 95 Pettigrew R Hamilton-Fairley D Obesity and female reproductive function Br Med Bull 53 341 358 1997 10.1093/oxfordjournals.bmb.a011617 9246840 96 Zhu Y Luo M Bai X Li J Nie P Li B Luo P SS-31: A mitochondria-targeting peptide, ameliorates kidney disease Oxid Med Cell Longev 2022 1295509 2022 10.1155/2022/1295509 35707274 PMC9192202 97 Igosheva N Abramov AY Poston L Eckert JJ Fleming TP Duchen MR McConnell J Maternal diet-induced obesity alters mitochondrial activity and redox status in mouse oocytes and zygotes PLoS One 5 e10074 2010 10.1371/journal.pone.0010074 20404917 PMC2852405 98 Legro RS Arslanian SA Ehrmann DA Hoeger KM Murad MH Pasquali R Welt CK Endocrine Society Diagnosis and treatment of polycystic ovary syndrome: An Endocrine Society clinical practice guideline J Clin Endocrinol Metab 98 4565 4592 2013 10.1210/jc.2013-2350 24151290 PMC5399492 99 Okabe M The cell biology of mammalian fertilization Development 140 4471 4479 2013 10.1242/dev.090613 24194470 100 Marquard KL Stephens SM Jungheim ES Ratts VS Odem RR Lanzendorf S Moley KH Polycystic ovary syndrome and maternal obesity affect oocyte size in in vitro fertilization/intracytoplasmic sperm injection cycles Fertil Steril 95 2146 2149 2149.e1 2011 10.1016/j.fertnstert.2010.10.026 21071018 PMC3684964 101 Martín-Hidalgo D Solar-Málaga S González-Fernández L Zamorano J García-Marín LJ Bragado MJ The compound YK 3-237 promotes pig sperm capacitation-related events Vet Res Commun 48 773 786 2024 10.1007/s11259-023-10243-6 37906355 PMC10998788 102 Trebichalská Z Holubcová Z Perfect date-the review of current research into molecular bases of mammalian fertilization J Assist Reprod Genet 37 243 256 2020 10.1007/s10815-019-01679-4 31909446 PMC7056734 103 Delgado-Bermúdez A Yeste M Bonet S Pinart E Physiological role of potassium channels in mammalian germ cell differentiation, maturation, and capacitation Andrology 13 184 201 2025 In Italian 10.1111/andr.13606 38436215 PMC11815548 104 Aldana A Carneiro J Martínez-Mekler G Darszon A Discrete dynamic model of the mammalian sperm acrosome reaction: the influence of acrosomal pH and physiological heterogeneity Front Physiol 12 682790 2021 10.3389/fphys.2021.682790 34349664 PMC8328089 105 Hafez ESE Goff L Hafez B Mammalian fertilization, IVF, ICSI: Physiological/molecular parameters, clinical application Arch Androl 50 69 88 2004 10.1080/aan.50.2.69.88 15002414 106 Kwon WS Rahman MS Pang MG Diagnosis and prognosis of male infertility in mammal: The focusing of tyrosine phosphorylation and phosphotyrosine proteins J Proteome Res 13 4505 4517 2014 10.1021/pr500524p 25223855 107 Schatten H Sun QY Prather R The impact of mitochondrial function/dysfunction on IVF and new treatment possibilities for infertility Reprod Biol Endocrinol 12 111 2014 10.1186/1477-7827-12-111 25421171 PMC4297407 108 Vural F Vural B Çakıroğlu Y The role of overweight and obesity in in vitro fertilization outcomes of poor ovarian responders BioMed Res Int 2015 781543 2015 10.1155/2015/781543 26106614 PMC4461701 109 Schon SB Yang K Schindler R Jiang L Neff LM Seeley RJ Marsh EE Obesity-related alterations in protein expression in human follicular fluid from women undergoing in vitro fertilization F S Sci 3 331 339 2022 36096447 10.1016/j.xfss.2022.09.002 110 Bunay J Gallardo LM Torres-Fuentes JL Aguirre-Arias MV Orellana R Sepúlveda N Moreno RD A decrease of docosahexaenoic acid in testes of mice fed a high-fat diet is associated with impaired sperm acrosome reaction and fertility Asian J Androl 23 306 313 2021 10.4103/aja.aja_76_20 33269725 PMC8152421 111 Cooray A Kim JH Chae MR Lee S Lee KP Perspectives on potential fatty acid modulations of motility associated human sperm ion channels Int J Mol Sci 23 3718 2022 10.3390/ijms23073718 35409078 PMC8998313 112 Borges BC Garcia-Galiano D da Silveira Cruz-Machado S Han X Gavrilina GB Saunders TL Auchus RJ Hammoud SS Smith GD Elias CF Obesity-induced infertility in male mice is associated with disruption of Crisp4 expression and sperm fertilization capacity Endocrinology 158 2930 2943 2017 10.1210/en.2017-00295 28911169 PMC5659670 113 Krizanac M Mass Sanchez PB Weiskirchen R Schröder SK Overview of the expression patterns and roles of Lipocalin 2 in the reproductive system Front Endocrinol (Lausanne) 15 1365602 2024 10.3389/fendo.2024.1365602 38645429 PMC11026566 114 Seekford ZK Davis DB Dickson MJ Melo Gonçlaves L Burato S Holton MP Gordon J Pohler KG Cliff Lamb G Pringle TD Bulls fed a high-gain diet decrease blastocyst formation after in vitro fertilization Reproduction 166 149 159 2023 10.1530/REP-23-0006 37252840 115 Bozdemir N Kablan T Altintas MO Sukur G Cinar O Uysal F Altered DNA methylation and Dnmt expression in obese uterus may cause implantation failure J Mol Histol 55 427 436 2024 10.1007/s10735-024-10212-6 38850446 116 Fabian D Kubandová-Babeľová J Kšiňanová M Waczulíková I Fabianová K Koppel J Overweight and fertility: What we can learn from an intergenerational mouse obesity model Int J Environ Res Public Health 19 7918 2022 10.3390/ijerph19137918 35805577 PMC9266121 117 Gude NM Roberts CT Kalionis B King RG Growth and function of the normal human placenta Thromb Res 114 397 407 2004 10.1016/j.thromres.2004.06.038 15507270 118 Roberts KA Riley SC Reynolds RM Barr S Evans M Statham A Hor K Jabbour HN Norman JE Denison FC Placental structure and inflammation in pregnancies associated with obesity Placenta 32 247 254 2011 10.1016/j.placenta.2010.12.023 21232790 119 Amabebe E Ikumi N Pillay K Matjila M Anumba DOC Maternal obesity-related placental dysfunction: From peri-conception to late gestation Placenta Reprod Med 2 9 2023 10.54844/prm.2023.0361 120 Louwen F Kreis NN Ritter A Yuan J Maternal obesity and placental function: Impaired maternal-fetal axis Arch Gynecol Obstet 309 2279 2288 2024 10.1007/s00404-024-07462-w 38494514 PMC11147848 121 Stuart TJ O'Neill K Condon D Sasson I Sen P Xia Y Simmons RA Diet-induced obesity alters the maternal metabolome and early placenta transcriptome and decreases placenta vascularity in the mouse Biol Reprod 98 795 809 2018 10.1093/biolre/ioy010 29360948 PMC6454478 122 Castellana B Perdu S Kim Y Chan K Atif J Marziali M Beristain AG Maternal obesity alters uterine NK activity through a functional KIR2DL1/S1 imbalance Immunol Cell Biol 96 805 819 2018 10.1111/imcb.12041 29569748 123 Perdu S Castellana B Kim Y Chan K DeLuca L Beristain AG Maternal obesity drives functional alterations in uterine NK cells JCI Insight 1 e85560 2016 10.1172/jci.insight.85560 27699222 PMC5033901 124 Wilson MR Skalski H Reske JJ Wegener M Adams M Hostetter G Hoffmann HM Bernard JJ Bae-Jump VL Teixeira JM Chandler RL Obesity alters the mouse endometrial transcriptome in a cell context-dependent manner Reprod Biol Endocrinol 20 163 2022 10.1186/s12958-022-01030-0 36424602 PMC9686036 125 Ford SP Zhang L Zhu M Miller MM Smith DT Hess BW Moss GE Nathanielsz PW Nijland MJ Maternal obesity accelerates fetal pancreatic β-cell but not alpha-cell development in sheep: Prenatal consequences Am J Physiol Regul Integr Comp Physiol 297 R835 R843 2009 10.1152/ajpregu.00072.2009 19605766 PMC2739779 126 Liu Y Ding Q Guo W Life course impact of glucocorticoids during pregnancy on muscle development and function Front Anim Sci 2 788930 2021 10.3389/fanim.2021.788930 36325303 PMC9624510 127 Sahoo T del Gaudio D German JR Shinawi M Peters SU Person RE Garnica A Cheung SW Beaudet AL Prader-Willi phenotype caused by paternal deficiency for the HBII-85 C/D box small nucleolar RNA cluster Nat Genet 40 719 721 2008 10.1038/ng.158 18500341 PMC2705197 128 Fowden AL Forhead AJ Glucocorticoids as regulatory signals during intrauterine development Exp Physiol 100 1477 1487 2015 10.1113/EP085212 26040783 129 Gohir W Kennedy KM Wallace JG Saoi M Bellissimo CJ Britz-McKibbin P Petrik JJ Surette MG Sloboda DM High-fat diet intake modulates maternal intestinal adaptations to pregnancy and results in placental hypoxia, as well as altered fetal gut barrier proteins and immune markers J Physiol 597 3029 3051 2019 10.1113/JP277353 31081119 130 George G Draycott SAV Muir R Clifford B Elmes MJ Langley-Evans SC Exposure to maternal obesity during suckling outweighs in utero exposure in programming for post-weaning adiposity and insulin resistance in rats Sci Rep 9 10134 2019 10.1038/s41598-019-46518-9 31300679 PMC6626015 131 Puppala S Li C Glenn JP Saxena R Gawrieh S Quinn A Palarczyk J Dick EJ Jr Nathanielsz PW Cox LA Primate fetal hepatic responses to maternal obesity: Epigenetic signalling pathways and lipid accumulation J Physiol 596 5823 5837 2018 10.1113/JP275422 29516496 PMC6265567 132 Meakin AS Nathanielsz PW Li C Clifton VL Wiese MD Morrison JL Maternal obesity impacts fetal liver androgen signalling in a sex-specific manner Life Sci 337 122344 2024 10.1016/j.lfs.2023.122344 38081408 133 Zhou P Guan H Guo Y Zhu L Liu X Maternal high-fat diet programs renal peroxisomes and activates NLRP3 inflammasome-mediated pyroptosis in the rat fetus J Inflamm Res 14 5095 5110 2021 10.2147/JIR.S329972 34675590 PMC8502058 134 Lee YQ Lumbers ER Oldmeadow C Collins CE Johnson V Keogh L Sutherland K Gordon A Smith R Rae KM Pringle KG The relationship between maternal adiposity during pregnancy and fetal kidney development and kidney function in infants: The Gomeroi gaaynggal study Physiol Rep 7 e14227 2019 10.14814/phy2.14227 31515958 PMC6742895 135 Tain YL Chan JY Hsu CN Maternal fructose intake affects transcriptome changes and programmed hypertension in offspring in later life Nutrients 8 757 2016 10.3390/nu8120757 27897982 PMC5188412 136 Tang S Wu H Chen Q Tang T Li J An H Zhu S Han L Sun H Ge J Maternal obesity induces the meiotic defects and epigenetic alterations during fetal oocyte development Adv Sci (Weinh) 11 e2309184 2024 10.1002/advs.202309184 38868907 PMC11321662 137 Şanlı E Kabaran S Maternal obesity, maternal overnutrition and fetal programming: Effects of epigenetic mechanisms on the development of metabolic disorders Curr Genomics 20 419 427 2019 10.2174/1389202920666191030092225 32476999 PMC7235386 138 Liu S Hua L Mo X Lei B Zhang R Zhou S Jiang X Fang Z Feng B Che L Comparative impact of alternate-day fasting and time-restricted feeding on placental function and fetal development in maternal obesity Nutrients 17 25 2024 10.3390/nu17010025 39796458 PMC11723168 139 Naeye RL Maternal body weight and pregnancy outcome Am J Clin Nutr 52 273 279 1990 10.1093/ajcn/52.2.273 2375293 140 Metzger BE Silverman BL Freinkel N Dooley SL Ogata ES Green OC Amniotic fluid insulin concentration as a predictor of obesity Arch Dis Child 65 10 Spec No 1050 1052 1990 10.1136/adc.65.10_Spec_No.1050 2241225 PMC1590256 141 Boney CM Verma A Tucker R Vohr BR Metabolic syndrome in childhood: Association with birth weight, maternal obesity, and gestational diabetes mellitus Pediatrics 115 e290 e296 2005 10.1542/peds.2004-1808 15741354 142 Moeckli B Delaune V Prados J Tihy M Peloso A Oldani G Delmi T Slits F Gex Q Rubbia-Brandt L Impact of maternal obesity on liver disease in the offspring: A comprehensive transcriptomic analysis and confirmation of results in a murine model Biomedicines 10 294 2022 10.3390/biomedicines10020294 35203502 PMC8869223 143 Furigo IC Dearden L Mechanisms mediating the impact of maternal obesity on offspring hypothalamic development and later function Front Endocrinol (Lausanne) 13 1078955 2022 10.3389/fendo.2022.1078955 36619540 PMC9813846 144 Zhang J Li S Luo X Zhang C Emerging role of hypothalamus in the metabolic regulation in the offspring of maternal obesity Front Nutr 10 1094616 2023 10.3389/fnut.2023.1094616 36819678 PMC9928869 145 Dow C Lorthe E Bernard JY Galera C Marchand-Martin L Tafflet M Ancel PY Charles MA Heude B Maternal prepregnancy obesity and offspring intelligence quotient at 5 years: A multicohort analysis Paediatr Perinat Epidemiol 39 162 174 2025 10.1111/ppe.13157 39777691 PMC11866737 146 Sertorio MN César H de Souza EA Mennitti LV Santamarina AB De Souza Mesquita LM Jucá A Casagrande BP Estadella D Aguiar O Jr Pisani LP Parental high-fat high-sugar diet intake programming inflammatory and oxidative parameters of reproductive health in male offspring Front Cell Dev Biol 10 867127 2022 10.3389/fcell.2022.867127 35832794 PMC9271829 147 Santillán JAG Mezo-González CE Gourdel M Croyal M Bolaños-Jiménez F Diet-induced obesity in the rat impairs sphingolipid metabolism in the brain and this metabolic dysfunction is transmitted to the offspring via both the maternal and the paternal lineage J Neurochem 169 e16307 2025 10.1111/jnc.16307 39831759 148 Alba-Linares JJ Pérez RF Tejedor JR Bastante-Rodríguez D Ponce F Carbonell NG Zafra RG Fernández AF Fraga MF Lurbe E Maternal obesity and gestational diabetes reprogram the methylome of offspring beyond birth by inducing epigenetic signatures in metabolic and developmental pathways Cardiovasc Diabetol 22 44 2023 10.1186/s12933-023-01774-y 36870961 PMC9985842 149 Zheng Y Wang W Huo Y Gui Y Maternal obesity and kawasaki disease-like vasculitis: A new perspective on cardiovascular injury and inflammatory response in offspring male mice Nutrients 15 3823 2023 10.3390/nu15173823 37686855 PMC10490206 150 Shiadeh SMJ Goretta F Svedin P Jansson T Mallard C Ardalan M Long-term impact of maternal obesity on the gliovascular unit and ephrin signaling in the hippocampus of adult offspring J Neuroinflammation 21 39 2024 10.1186/s12974-024-03030-w 38308309 PMC10837922 151 Nelson BN Friedman JE Developmental programming of the fetal immune system by maternal western-style diet: Mechanisms and implications for disease pathways in the offspring Int J Mol Sci 25 5951 2024 10.3390/ijms25115951 38892139 PMC11172957 152 Xiong YW Zhu HL Zhang J Geng H Tan LL Zheng XM Li H Fan LL Wang XR Zhang XD Multigenerational paternal obesity enhances the susceptibility to male subfertility in offspring via Wt1 N6-methyladenosine modification Nat Commun 15 1353 2024 10.1038/s41467-024-45675-4 38355624 PMC10866985 153 Billah MM Khatiwada S Morris MJ Maloney CA Effects of paternal overnutrition and interventions on future generations Int J Obes (Lond) 46 901 917 2022 10.1038/s41366-021-01042-7 35022547 PMC9050512 154 Wu HY Cheng Y Jin LY Zhou Y Pang HY Zhu H Yan CC Yan YS Yu JE Sheng JZ Huang HF Paternal obesity impairs hepatic gluconeogenesis of offspring by altering Igf2/H19 DNA methylation Mol Cell Endocrinol 529 111264 2021 10.1016/j.mce.2021.111264 33811969 155 Shi Y Li W Yu X Zhao Y Zhu D Song Y Zhao Z Gu Y Wei B Li L Paternal obesity-induced H3K27me3 elevation leads to MANF-mediated transgenerational metabolic dysfunction in female offspring Adv Sci (Weinh) 12 e2415956 2025 10.1002/advs.202415956 40041941 PMC12021121 156 Tahiri I Llana SR Fos-Domènech J Milà-Guash M Toledo M Haddad-Tóvolli R Claret M Obri A Paternal obesity induces changes in sperm chromatin accessibility and has a mild effect on offspring metabolic health Heliyon 10 e34043 2024 10.1016/j.heliyon.2024.e34043 39100496 PMC11296027 157 Anuradha R Srinivas M Satyavani M Suresh K Muralidhar MN Rajender Rao K Preconceptional paternal caloric restriction of high-fat diet-induced obesity in Wistar rats dysregulates the metabolism of their offspring via AMPK/SIRT1 pathway Lipids Health Dis 23 174 2024 10.1186/s12944-024-02161-6 38851752 PMC11162063 158 Achkar ME Atieh O Ghadban C Awad T Ghadban E Grandjean V Yarkiner Z Raad G Khalife MF Preconceptional paternal obesity may increase the risk of congenital urogenital anomalies in offspring: A case-control study Andrology 13 45 54 2025 10.1111/andr.13673 38837622 PMC11635552 159 Jevtovic F Claiborne A Biagioni EM Collier DN DeVente JE Mouro S Kaneko-Tarui T O-Tierney-Ginn PF Goodyear LJ Houmard JA Paternal obesity decreases infant MSC mitochondrial functional capacity Am J Physiol Endocrinol Metab 327 E441 E448 2024 10.1152/ajpendo.00239.2024 39140975 PMC11482215 160 Ballard O Morrow AL Human milk composition: Nutrients and bioactive factors Pediatr Clin North Am 60 49 74 2013 10.1016/j.pcl.2012.10.002 23178060 PMC3586783 161 Froń A Orczyk-Pawiłowicz M Understanding the immunological quality of breast milk in maternal overweight and obesity Nutrients 15 5016 2023 10.3390/nu15245016 38140275 PMC10746120 162 Ross MG Coca KP Rocha ACL Camargo BTS de Castro LS Horta BL Desai M Composition of breast milk in women with obesity J Clin Med 13 6947 2024 10.3390/jcm13226947 39598091 PMC11594640 163 Ross MG Kavasery MP Cervantes MK Han G Horta B Coca KP Costa SO Desai M High-fat, high-calorie breast milk in women with overweight or obesity and its association with maternal serum insulin concentration and triglycerides levels Children (Basel) 11 141 2024 38397253 10.3390/children11020141 PMC10887191 164 Enstad S Cheema S Thomas R Fichorova RN Martin CR O'Tierney-Ginn P Wagner CL Sen S The impact of maternal obesity and breast milk inflammation on developmental programming of infant growth Eur J Clin Nutr 75 180 188 2021 10.1038/s41430-020-00720-5 32814855 PMC7855210 165 Huang LL Yang F Xiong F Association of leptin, adiponectin, and ghrelin in breast milk with the growth of infants with exclusive breastfeeding Zhongguo Dang Dai Er Ke Za Zhi 20 91 96 2018 In Chinese 29429454 10.7499/j.issn.1008-8830.2018.02.002 PMC7389239 166 Tekin Guler T Koc N Kara Uzun A Fisunoglu M The association of pre-pregnancy BMI on leptin, ghrelin, adiponectin and insulin-like growth factor-1 in breast milk: A case-control study Br J Nutr 127 1675 1681 2022 10.1017/S0007114521002932 34348809 PMC9201832 167 Zamanillo R Sánchez J Serra F Palou A Breast milk supply of microrna associated with leptin and adiponectin is affected by maternal overweight/obesity and influences infancy BMI Nutrients 11 2589 2019 10.3390/nu11112589 31661820 PMC6893542 168 Urrutia-Baca VH Gutiérrez-Uribe JA Ramos-Parra PA Domínguez-Uscanga A Rodriguez-Gutierrez NA Chavez-Caraza KL Martinez-Cano I Padilla-Garza AS Ruiz-Villarreal EG Espiricueta-Candelaria F Chuck-Hernández C Exploring the impact of maternal factors and dietary habits on human milk oligosaccharide composition in early breastfeeding among Mexican women Sci Rep 14 14685 2024 10.1038/s41598-024-63787-1 38918476 PMC11199484 169 Garcia-Mantrana I Collado MC Obesity and overweight: Impact on maternal and milk microbiome and their role for infant health and nutrition Mol Nutr Food Res 60 1865 1875 2016 10.1002/mnfr.201501018 27159888 Figure 1 Schematic illustration of the effects of obesity on male and female reproductive systems. On the left panel, male obesity is proven to have a significant impact on the development of normal sperm, thereby causing reduced motility sperm and atypical sperm production. On the right panel, female obesity is proven to cause altered ovarian morphology and increased cytoplasmic lipid accumulation in oocytes. Further effects of obesity in both female and male reproductive system physiology and development are indicated as a downward-looking arrow (decrease) and an upward-looking arrow (increase). NS, normal sperm; RMS, reduced motility sperm; atypical sperm; ILCA, increased cytoplasmic lipid accumulation; BTB, blood-testis barrier; KISS-1, KiSS-1 metastasis suppressor; GPR54, G protein-coupled receptor 54; AR, androgen receptor; SIRT1, sirtuin 1; NRF2, nuclear factor erythroid 2-related factor 2; MMP, mitochondrial membrane potential; ATP, adenosine triphosphate; StAR, steroidogenic acute regulatory protein; CYP11A1, cytochrome P450 family 11 subfamily A member 1; GPX, glutathione peroxidase; SOD, superoxide dismutase; ROS, reactive oxygen species; CASP3, caspase 3; BAX, BCL2-associated X protein; IL-6, interleukin-6; TNF-α, tumor necrosis factor-alpha; MAPK, mitogen-activated protein kinase; 8-OHdG, 8-hydroxy-2'-deoxyguanosine; PCOS, polycystic ovary syndrome; ICLA, in vitro Figure 2 Schematic illustration of the mechanistic pathways by which maternal obesity influences fetal development via placental alterations. On the left panel, maternal obesity is associated with increased circulating levels of pro-inflammatory cytokines (IL-6, TNF-α), FFAs and glucose. Apart from the increase in pro-inflammatory markers, altered placental morphology, impaired angiogenesis, and increased oxidative stress can also be observed. Importantly, deregulated placental signaling pathways, including Wnt, ERK, and TLR2, as well as the activation of NF-κB, collectively disrupt placental function. On the right panel, these placental changes adversely impact multiple fetal organ system development processes. The fetal liver exhibits lipid accumulation and impaired TCA cycle activity. The pancreas shows enlargement and accelerated BC development. The kidney exhibits a reduced size and a decreased number of peroxisomes. The brain is affected through altered hypothalamic and hippocampal development. In addition, epigenetic modifications, such as altered methylation patterns, which may program long-term disease susceptibility, are caused by parental obesity. Fetal muscle is shown to have an increased risk of atrophy and predisposition to cardiovascular disease. Together, these pathways underscore the multifaceted effects of maternal obesity on in utero Figure 3 Schematic illustration of the unresolved distinction between dietary components and obesity effects on reproductive mechanisms. On the left panel, major dietary components, including fat, sugar, protein, vitamins and supplementation, are shown as potential direct influencers on reproductive health. On the right panel, obesity-related factors, including adiposity, inflammation, and metabolic syndrome, are depicted as established contributors to reproductive dysfunction. However, it remains unclear which reproductive mechanisms are affected explicitly by dietary factors alone and which are driven by obesity itself, resulting in an unexplained mechanistic overlap. Therefore, distinct mechanisms of either diet or obesity on reproductive parameters such as gamete quality, hormonal imbalance, oxidative stress, and epigenetic effects remain to be elucidated. To distinguish the dietary impact from obesity's impact on reproduction, three approaches can be proposed: murine models of obesity caused by gene manipulation without dietary interventions (obesity's impact); short-term special diet feeding (impact of dietary components without causing obesity); long-term special diet feeding (obesity's impact). ST, short-term; LT, long-term; HFD, high-fat diet. Table I Effects of obesity on the human and rodent male reproductive systems. Model Treatment Effect (Refs.) Sprague-Dawley rats 16-week HFD ↓ Testosterone synthesis ( 57 Ldlr −/− 24-week HFD + BA administration ↑ Plasma leptin abnormal testosterone levels aberrant ITO ( 58 Rats with STz-NA-induced diabetes HFD until 12 weeks of age ↓ Epididymal sperm motility ( 59 Wistar rats 4-week HFD ↓ Epididymal sperm maturationas ( 60 C57BL/6 mice 8-week HFD + diet reversal disrupted testicular BTB integrity ( 61 C57Bl/6 mice AdipoR1 KO mice Akita mice 28-week HFD (C57Bl/6) and standard chow (AdipoR1 KO, Akita) ↓ Sperm count, motility fertilizing ability and AdipoR1 ( 62 C57BL/6J mice 10-week HFD + exercise ↓ LEP-JAK-STAT pathway ( 63 Wistar rats 16-week HFD ↓ Male fertility, fertilization, cell adhesion genes ( 64 Wistar rats 38-week hyperglycidic diet 15 Proteins with differential abundance ( 65 Ldlr −/− Table II Effects of obesity on the human and rodent female reproductive systems. Model Treatment/intervention Effect (Refs.) CBA mice 4-week HFD Lipid accumulation in COCs ( 78 C57BL/6 mice Single-cell RNA-seq + HFD ↓ Ppargc1a ( 96 B6C3F1 mice 4-week HFD + WSC ↓ Ovarian lipid droplets (40%) restored ovulation via AMPK activation ( 80 C57BL/6J mice HFD + aged cohorts ↓ Granulosa cell Hk2/Pfkfb3 ( 60 Women (clinical) Obesity (BMI ≥30) ↓ Follicular fluid quality ( 78 C57BL/6J mice Maternal HFD (preconception) Altered mitochondrial membrane potential (↓ΔΨm) in oocytes/zygotes ( 97 Women (PCOS) Obesity ↓ Menstrual regularity ( 98 HFD, high-fat diet; COCs, cumulus-oocyte complexes; ROS, reactive oxygen species; ER, endoplasmic reticulum; scRNA-seq, single-cell RNA sequencing; Ppargc1a Hk2 Pfkfb3 ",
  "metadata": {
    "Title of this paper": "Obesity and overweight: Impact on maternal and milk microbiome and their role for infant health and nutrition",
    "Journal it was published in:": "International Journal of Molecular Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488213/"
  }
}