{
  "title": "Paper_290",
  "abstract": "pmc J Transl Med J Transl Med 214 transmed Journal of Translational Medicine 1479-5876 BMC PMC12486671 PMC12486671.1 12486671 12486671 41029680 10.1186/s12967-025-07077-y 7077 1 Review Extracellular vesicles for targeted drug delivery: advances in surface modification strategies and therapeutic applications Hu Minghui 1 Han Yuxin 1 Zhang Xin 1 Tian Shengqian 1 Shang Zhenghui 2 Yuan Zhixiang 1 He Lili 21900048@swun.edu.cn 1 1 https://ror.org/04gaexw88 grid.412723.1 0000 0004 0604 889X Southwest Minzu University, 2 https://ror.org/04cr34a11 grid.508285.2 0000 0004 1757 7463 Yichang Central People’s Hospital, 30 9 2025 2025 23 478331 1028 7 3 2025 31 8 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Extracellular vesicles (EVs) refer to a heterogeneous group of cell-derived membrane structures originating from endosomes or plasma membranes. EVs can be used as excellent medication carriers due to their characteristic as natural carriers for bioactive substances. They can be employed for intercellular communication to transport bioactive lipids, proteins, RNAs, DNA, and peptide segments for releasing into the extracellular surroundings. This paper discusses the biological characteristics of EVs, current methodologies for their isolation and purification, with particular emphasis on emerging strategies for EVs surface engineering. The methods for surface modification can be categorized into two approaches: pre-isolation and post-isolation. Pre-isolation methods involve genetic manipulation or metabolic engineering of the source cells to alter the EVs surface, while post-isolation methods entail physical or chemical modifications after EVs have been isolated. Based on the modification methods mentioned above, we present how these modified EVs can be utilized to treat specific diseases, including brain disorders, tumors, and liver conditions. Keywords Extracellular vesicles Biocarrier materials Surface modification Targeted delivery Medical and Health Research Foundation from the Science and Technology Department of Yichang A24-2-030 Hu Minghui Fundamental Research Funds for the Central Universities of Southwest Minzu University ZYN2025117 Hu Minghui pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Extracellular vesicles (EVs), which originate from endosomes or plasma membranes, constitute a heterogeneous group of cell-derived membrane structures. Many researchers have expressed an interest in it due to its strong biocompatibility, high transport capacity, and modifiable surfaces. Different from the initial consideration of EVs as waste products of cellular metabolism to release and maintain intracellular homeostasis, EVs have been recently exploited as a suitable natural material for potential medication and gene carriers. According to the previous research, it is demonstrated that EVs can act as intercellular communication mediators. Based on the biogenesis processes and diameter, EVs are divided into four types, including microvesicles, apoptotic bodies, exosomes, and oncosomes [ 1 2 3 4 Moreover, EVs have emerged as a key strategy to enhance their targeting efficiency and therapeutic potential. This approach is mainly categorized into pre-isolation modification (via genetic engineering, metabolic engineering, or direct manipulation of parent cell membranes) and post-isolation modification (through physical fusion or chemical conjugation), enabling precise regulation of EVs to adapt to specific biological tasks [ 5 6 7 8 This review comprehensively summarizes the biological characteristics of EVs, conducts a critical evaluation of isolation and purification methods, and focuses on exploring surface functionalization strategies. By integrating these insights, this review highlights the therapeutic potential of modified EVs as targeted delivery systems, while pointing out the current limitations and challenges that must be overcome to realize their full clinical application in precision medicine. Biology of EVs This section focuses on the biological characteristics of EVs, including the formation mechanisms of their four types of origins, the compositional features of lipid bilayers, nucleic acids, and proteins, as well as the physiological functions, serving as biomarkers, signaling mediators, and regulators of cell migration. The earliest research on EVs started from 1940, followed by multiple further studies that revealed the existence of EVs during the 1960s-1970s. In 1983, two influential papers from the labs of Johnstone and Stahl defined exosomes as key players in cellular transport. Using the reticulocyte maturation as a model, a novel intracellular sorting and secretion pathway was uncovered and known as the exosome pathway [ 9 Interest in EVs has surged since James E. Rothman, Randy W. Schekman, and Thomas C. Südhof were awarded the Nobel Prize in Physiology or Medicine in 2013 for their discoveries concerning the machinery regulating vesicle traffic. As a result, the foundational research and translational applications of EVs have proceeded rapidly, but their physiological roles are still not well understood. In early research, EVs were considered as waste products produced by cellular metabolism, which were released to maintain the stability of the intracellular environment [ 10 11 The biological characteristics of EVs are highly related to their research history, which initially was regarded as \"metabolic waste\" but has currently changed to \"intercellular communication carriers\". These breakthroughs in research understanding have promoted in-depth exploration of their origins and classification, where the four types of EV origins and their formation mechanisms are significantly important to understand. Biological origin of EVs The origin and classification of EVs include the formation processes and size characteristics of each type, playing an effective role in revealing the diversity of their biological origins. Based on the origin and diameter of EVs, they can be divided into four groups, including microvesicles (MVs), apoptotic bodies, exosomes, and oncosomes [ 1 2 12 13 14 Exosomes (30–150 nm in diameter), which are generated and degraded in the cytoplasm, derive their biological components primarily from the Golgi apparatus and plasma membrane. Firstly, cells form endocytic vesicles in the lipid raft by endocytosis, causing early endosomes to grow intracellularly. Cells gradually evolve into late endosomes when sections of the limiting membrane invaginate and sprout into the compartment’s lumen, forming intraluminal vesicles (ILVs) containing proteins and nucleic acids from their parent cells. And when enough ILVs are formed in endosomes, it is converted to multivesicular bodies (MVBs) [ 15 16 1 17 Fig. 1 a b In 2008, Janus Rak’s research team originally introduced the concept of oncosome, which is used to characterize EVs in brain tumors that release and express EGFRvIII (a mutant type of receptor) from glioma cells [ 18 12 19 EVs can originate from various cells, ranging from single-cell prokaryotes to complex multicellular eukaryotes. In higher organisms, EVs can be found in various body fluids, including blood, saliva, urine, breast milk, and semen [ 20 Structure and composition of EVs The structure and composition of EVs fully includes their membrane structural features, size and density characteristics, as well as the specific composition of proteins, nucleic acids, and lipids, which all highly illuminate the intrinsic relationship between structure and function. EVs have the same structure as monolayers as cells. The diameter of EVs can vary between 30 nm and 1 mm, depending on the analytical technique used, due to the presence of membrane proteins and extended sugar chains on their surface. In addition to measurement parameters, EVs with identical biological origins can vary in size. Vasily S. Chernyshev et al. isolated hydrated and dehydrated exosomes from the serum of a pancreatic cancer patient and a healthy control to determine their sizes and forms. Their findings demonstrated that hydrated exosomes are mostly spherical nanoparticles with significantly larger hydrodynamic radius than their geometric size. They discovered that the drying method affects the shape and size of desiccated exosomes [ 21 22 23 24 Proteins in EVs are not only involved in their biogenesis and function, but also highly related to endosomal pathways. For example, the endosomal sorting complex required for transport (ESCRT) components are abundant in vesicle sections, such as ALG-2-interacting protein X (ALIX) and tumor susceptibility gene 101 (TSG101) [ 25 26 27 28 EVs have emerged as pivotal mediators of intercellular communication, with accumulating evidence demonstrating their ability to encapsulate and transport a diverse array of genetic materials, thereby influencing physiological and pathological processes across various biological systems. In 2006, scientists originally discovered that EVs can transfer RNA between cells and tissues [ 29 30 33 34 27 35 36 1 The lipid components of EVs have garnered substantial research attention, as they not only contribute to the structural integrity of these vesicles but also play pivotal roles in mediating intercellular recognition and signaling cascades. Generally, the EVs’ lipid composition, which includes phosphatidylcholine, phosphatidylserine, phosphatidylethanolamine, phosphatidic acid, cholesterol, ceramide, sphingomyelin, and glycosphingolipid, is identical to that of the source cells. In comparison to source cells, the content of phosphatidylcholine and diacylglycerol in EVs’ lipid composition decreased [ 37 38 Physiological functions of EVs The core physiological functions of EVs reveal the important role of EVs in physiological and pathological processes. These key features include acting as disease biomarkers, intercellular signaling mediators, and regulators of cell migration and invasion. EVs have a wide range of physiological functions. After reviewing a large amount of literature, this paper summarizes the following key aspects: biomarkers, signaling, cell migration, and invasion. Among patients with cerebral malaria (CM) brain lesions, the EVs work as biomarkers where a significant association between microvesicle (MV) levels and the emergence of neurological syndromes is shown, as well as the normalization of these levels at follow-up, indicating that MVs as a biomarker of illness severity and have potential value [ 39 40 42 Signaling: Because EVs contain proteins and nucleic acids, they have a high message-carrying capability, similar to classic single-molecule messengers like hormones, growth factors, and cytokines. Furthermore, EVs may transport more information [ 43 44 46 In vivo, EVs have been demonstrated to facilitate cell migration. For example, exosome secretion is essential for directional and efficient cell migration, and it accelerates migration by delivering the extracellular matrix (ECM) to facilitate adhesion formation [ 47 48 The systematic analysis of the biological characteristics of EVs provides a theoretical basis for subsequent research on their isolation, purification, and surface modification. Based on the above foundations, the EV isolation and purification technologies also play an important role in obtaining high-quality EVs for subsequent applications. Isolation and purification of EVs Because of their physiological features, EVs are particularly valuable for clinical applications. However, the lack of consistency in the EVs isolation procedure presents a substantial hurdle to bringing EVs into clinical practice. This article discusses several established isolation methods, including ultracentrifugation, immunoaffinity isolation, size-based isolation, and microfluidics-based techniques. These aim to clarify the principles, characteristics, and applicable scenarios of each method and provide a reference for the efficient isolation of EVs. Ultracentrifugation-based isolation techniques Ultracentrifugation is a widely used technique for EV isolation, mainly including differential ultracentrifugation and density gradient ultracentrifugation. The former, as the first method for exosome separation and the gold standard in the field, achieves separation based on differences in density and size of EVs. The latter further purifies EVs by creating a density gradient environment. This section elaborates on the operational procedures, key parameters, and respective limitations of these two methods. Differential ultracentrifugation and density gradient ultracentrifugation are two ultracentrifugation procedures. The first approach for separating exosomes was differential ultracentrifugation, which is now considered the gold standard in the field. This approach differentiates exosomes from other EVs based on their density and size. Ultracentrifugation typically involves a centrifugal force of 100,000 to 120,000 × g [ 49 50 51 49 52 Despite being a straightforward and classic approach, differential ultracentrifugation has significant limitations, including being time-consuming, requiring substantial sample volumes, and often failing to achieve complete separation of EVs from contaminating components. Although density gradient ultracentrifugation can improve purity, it is limited by a relatively small loading capacity. Consequently, researchers have developed alternative EV isolation techniques based on different principles. And the size-based separation methods have gained most attention due to their relative operational simplicity and speed, as will be discussed in the following section. Size-based isolation techniques One of the most common size-based exosome separation strategies is ultrafiltration, which works by separating suspended particles or polymers based on membrane pores. Exosomes can be isolated based on their size employing membrane filters with specific molecular weight or size exclusion limits [ 53 54 55 A commercial exosome isolation kit is available to extract RNA and isolate exosomes from cell-free materials such as urine, serum, cerebrospinal fluid, and cell culture media. Essentially, a syringe is filled with two membranes (200 nm and 20 nm), the 200 nm filter at the top and the 20 nm filter below. To protect the membrane from clogging, the sample is routinely pre-treated with low-speed centrifugation to remove cells, cellular debris, and proteinase K. After pretreatment, the sample is put through a syringe, where the bigger vesicles remain above the first filter, the smaller vesicles remain between the two filters, and the smallest vesicles are forced through and discarded [ 56 The first step in sequential filtration is dead-end (normal) filtering, which removes floating cells and large amounts of cellular detritus using a 100 nm membrane filter while allowing large, flexible components to pass through. Next, the filtrate is subjected to tangential flow filtration using 500 kDa molecular weight cut-off (MWCO) hollow fibers, after which the concentrated retentate is allowed to percolate to remove additional impurities. And then, a 100 nm track filter is utilized to filter the sample. Finally, mass spectrometry is utilized to confirm the connected proteins, and the morphology is examined using an electron microscope [ 57 58 Size exclusion chromatography (SEC) is another approach for isolating exosomes depending on their size. The column in the SEC is packed with a porous stationary phase. As the sample enters the column, samples with a small hydrodynamic radius flow through, whereas components with a large hydrodynamic radius—such as exosomes—are retained. For example, in the cryo-electron microscopy analysis, SEC eliminated most of the extra soluble plasma proteins while maintaining the EVs’ features, such as vesicle shape and contents [ 8 59 60 61 Size-based separation techniques offer advantages in speed and equipment requirements, there are some limitations to each method. The pressure involved in ultrafiltration can deform or rupture larger vesicles, while methods like sequential filtration require iterative processing to remove impurities. In contrast, immunoaffinity capture technology based on antigen–antibody specific interactions enables targeted isolation of EVs from specific sources and significantly enhances purity. Therefore, it has become another major category of EV isolation methods, which will be detailed below. Immunoaffinity capture-based techniques The immunoaffinity-based Capture Technique is a method of capturing exosomes that takes advantage of the immunoaffinity of antigens on the surface of EVs and their antibodies, as well as specific interactions between the receptor and the ligand. These ligands include identified extracellular vesicle markers like CD9, CD63, CD81, and EpCAM (CD26). Plates, magnetic beads, resins, and microfluidic devices can all contain specific target antigens. The immunoaffinity-based capture technology has the distinct benefit of allowing the isolation of exosomes from a specific source. Although the immunoaffinity approach can produce significantly more pure EVs, the yield is lower [ 55 56 62 The enzyme-linked immunosorbent assay (ELISA) involves immobilizing an antibody to the target antigen on the surface of a microplate. The exosome sample is adhered to the well, immobilized with the antibody. As a result of the antibody-antigen interaction, EVs containing the target antigen remain attached to the plate, and the unattached exosomes and other substances are washed away. The immobilized exosomes may then be identified using an absorbent tag-containing secondary antibody. Junwoo Lee et al. used a paper-based enzyme-linked immunoassay to assess the selective capture capacity of a SARBI p-ELISA with and without CD63 capture antibody. The assay preparation time was reduced while maintaining good sensitivity and linearity [ 63 In magneto-immunoprecipitation, antibodies against the target antigen adhere to the surface of magnetic beads coated with streptavidin affinity and then heated with the EVs to be separated. This approach has the benefit of increased separation efficiency due to the larger surface area provided by the beads for EVs capture. EVs were extracted from acute myeloid leukemia (AML) patient plasma using magnetic microbeads coated with CD34 antibodies. The separated EVs maintained their biological activity in inducing immunosuppression and displayed characteristic exosome shape [ 64 65 Even though immunoaffinity capture technology holds an important position in EV isolation due to its specificity, its low yield limits the application in large-scale sample processing. In contrast, precipitation methods induce EV aggregation from solution by adding precipitating agents, which offers operational simplicity without the requirement for specialized equipment. And the suitability for large-volume samples also provides distinct advantages in clinical sample handling. Exosome precipitation EVs can be isolated by precipitation treatments such as polyethylene glycol (PEG) precipitation, lectin-induced agglutination, protamine precipitation, and organic solvent acetone precipitation. When PEG, which is highly hydrophilic and has a great ability to \"lock in\" water, is added to a solution, EVs precipitate from it. After centrifugation, the vesicles are used for subsequent analysis [ 54 49 66 Lectins are proteins that specifically attach to carbohydrate moieties in other particles. When the lectins connect to the carbohydrates on the surface of EVs, they alter their solubility and cause them to precipitate. Typically, ultracentrifugation is performed to remove any residual components, such as cellular debris. The sample is then incubated overnight before being centrifuged to precipitate the EVs. Agglomeration produced by lectin is a low-cost and simple approach for extracting EVs from urine. Incubation with lectin at a final concentration of 2 mg/ml can cause the production of vesicular aggregates in urine [ 67 In contrast, microfluidic technology has emerged as a research hotspot by enabling efficient, integrated EV isolation through precise manipulation of their physicochemical properties, as we detail in the following sections. Microfluidic-based isolation techniques This section focuses on microfluidic isolation techniques, which achieve EV separation through capture, filtration, magnetic selection, acoustic-fluid separation, and electrophoresis by leveraging the physicochemical properties of EVs (e.g., size, density, and surface antigens) via functionalized microfluidic chips. It introduces the design of functionalized chips, their operational principles, and application cases, while elaborating on their advantages in efficient and integrated EV isolation. Microfluidics, which has developed rapidly over the last few decades, has numerous applications in optics, information technology, chemical synthesis, and bioanalysis [ 68 70 71 72 The major way for separating EVs using microfluidic isolation techniques is to run materials through functionalized microfluidic chips that perform various activities such as capture, filtering, magnetic selection, acoustic-liquid, and electrophoretic separation. EVs collection in microfluidic devices requires channel modification, which necessitates the selection of the appropriate antibody.\"ExoChio\" is an anti-CD63 functionalized microfluidic chip that captures EVs [ 73 74 75 Through the surface functionalization mentioned above, EVs are endowed with enhanced targeting ability and drug-loading capacity, laying a solid foundation for their practical application as drug delivery systems. The modified EVs can carry various therapeutic agents, such as proteins, nucleic acids, and chemotherapeutic drugs, and deliver them precisely to lesion sites. The following section specifically introduces the applications of modified EVs in drug delivery. Surface functionalization approaches for EVs This section elaborates on surface functionalization strategies for EVs, which are categorized into pre-isolation modification and post-isolation modification. It introduces the principles, operational procedures, and characteristics of various modification methods, revealing how surface modification optimizes the drug delivery performance of EVs. Surface engineering for EVs can serve a variety of objectives, including the introduction of targeted moieties. Surface modification of EVs can aid in the production of more tailored vaccines, hence improving vaccine safety during the development process. Furthermore, the vesicles can be fluorescently tagged utilizing EVs surface modification [ 11 76 Before-separation modification Genetic engineering, metabolic engineering, and direct parent cell membrane engineering can all be utilized to functionalize EVs’ surfaces before isolation. It elaborates on the molecular mechanisms, specific operations, and advantages/disadvantages of each method, revealing their core roles in regulating EV surface properties. Genetic engineering Among all cell manipulation technologies, genetic engineering is the most complete approach to EVs modification [ 77 2 78 79 Fig. 2 Schematic diagram of functionalization strategies for EVs. Before separation, we can use ( a b c d f g h i e j k l In all of the examples above, nucleic acids activate or regulate gene expression in target cells. Another strategy is to promote transgenic expression in mother cells, which then allows EVs to perform a specific role. Rabies virus glycoprotein (RVG) or muscle-specific peptide (MSP)-targeting peptides are expressed in dendritic cells, which results in the same expression in the EVs released by the cells [ 80 to the kidney, a receptor organ that expresses acetylcholine, and EVs/miR29 intervention increased muscle cross-sectional area while decreasing unilateral ureteral obstruction (UUO)-induced elevation of TRIM63/MuRF1 and FBXO32/atrogin-1 [ 81 81 81 11 82 All of the aforementioned genetic engineering confers targeting properties on EVs, and genetic engineering also permits EVs to exhibit particular pharmacological activity. TRAIL expression can cause apoptosis in cancer cells in MSCs. EV-delivered TRAIL is more effective in inducing apoptosis in cancer cells than recombinant TRAIL [ 83 Metabolic engineering Metabolic methods can be used to modify EVs’ parental cells. Metabolic engineering is an alternative to genetic engineering. Unlike genetic engineering, which involves direct manipulation of the genome, metabolic engineering utilizes endogenous synthesis and modification processes, particularly through the use of azide chemicals, to partially functionalize the EV’s surface, increasing the EV’s chemical composition and function (Fig. 2 84 84 84 Direct parent cell membrane engineering In addition to the two approaches outlined above, the EV’s membrane can be modified directly by changing the mother cell’s membrane. By fusing liposomes to the cell membrane in exchange for membrane components, the EVs are subsequently released carrying such liposomes as well. This approach can be utilized to deliver nitrogen-derivative compound liposomes to the parent cell, and hence to the EVs, resulting in EVs containing azide compounds [ 84 2 Pre-separation modification relies on engineering source cells, which enables stable modification of EVs but has limited flexibility due to restrictions from cell types and genetic backgrounds. In contrast, post-separation modification directly processes purified EVs, which is applicable to EVs from various sources and allows the introduction of diverse functional molecules as needed. The following section details the specific methods and characteristics of post-separation modification. Post-separation modification This section focuses on post-separation modification strategies for EVs, which are widely applicable to various molecules or ligands, and are primarily classified into physical and chemical modifications. It systematically elaborates on the operational principles, functionalization effects, and potential limitations of these two categories of methods, particularly an emphasis on their unique advantages in rapidly endowing EVs with new functionalities. Physical modification Physical methods of modification differ from the previously mentioned biological methods and the upcoming discussion on chemical methods in their simplicity and lack of requirement for additional reagents or cellular systems. The extrusion process in physical methods can also help EVs to remain uniform in size [ 85 2 2 85 2 86 87 88 89 In addition to fusion liposomes, EVs can be modified using surface adsorption. Surface adsorption mainly utilizes specific features on the surface of EVs, such as protein or lipid head genes or negative surface charge of EVs [ 11 2 90 91 Chemical modification EVs have an amine- or carboxyl-terminal phospholipids phospholipid or transmembrane protein on their surface, which can be functionalized with a variety of groups. Click chemistry, an important and relatively new approach in the medicinal chemistry toolbox, is employed here. Click chemistry has the following advantages: simple synthesis, high yield, wide range, and easy product isolation [ 92 2 2 2 85 Huixia Di et al. used a hydrophobic insertion approach to functionalize EVs by partially incorporating maleimide (Mal) moieties into their surfaces while maintaining the EVs’ structural integrity and bioactivity. Three biomedical applications were implemented using the mal-installed EVs: (i) in situ Raman detection of the surface components of EVs by conjugating them with gold nanoparticles (AuNPs); (ii) fast enrichment by magnetic particles (MPs) for high-efficiency EVs isolation; and (iii) labeling with a fluorescent dye to monitor the EVs-mediated cellular communication [ 93 Copper-catalyzed Azide-alkyne cycloaddition is one of the click chemistry approaches. This method allows EVs to become azide-capable. For example, Tyson Smyth et al. used EDC/NHS coupling to couple terminal alkynes to EVs, and the amine groups on the EVs proteins were crosslinked to 4-pentanoic acid via carbodiimide activation, followed by azide-functionalized fluorescent dyes attached via copper-catalyzed azide-alkyne cycloaddition (CuAAC). This technique can generate triazole bonds and is an efficient click reaction due to the Cu catalyst’s fast acceleration. The fluorescence of azide-fluoro545 can be used to assess functionalization levels [ 94 84 84 After functional modification endows EVs with specific targeting properties, their actual therapeutic efficacy as drug carriers needs to be validated in disease models. The next section demonstrates the in vitro/in vivo delivery efficiency and therapeutic mechanisms of modified EVs by loading three types of cargoes, including proteins, nucleic acids, and chemotherapeutic drugs. Modified EVs for drug delivery Nanomaterial-based drug delivery systems provide numerous advantages in medical research, including superior loading capacity, high biocompatibility, high bioavailability, and adjustable pharmacokinetics. Despite all the attention surrounding nanomaterials, few medication delivery technologies have reached clinical use. EVs, which are naturally occurring biological nanoparticles, have the potential to make significant contributions in this area. A variety of modified EVs have been used in clinical trials, most of which are generated from tumors or mesenchymal stem cells (MSCs) [ 95 This section highlights the specific applications of modified EVs in drug delivery, encompassing protein delivery (e.g., ACE2 receptor decoys and monoclonal antibodies), nucleic acid delivery (such as miRNA and CRISPR-Cas systems), and chemotherapeutic agent delivery (including paclitaxel and doxorubicin). According to the animal study data, the strengths of EVs were strongly validated, especially in improving drug stability and traversing physiological barriers like the blood–brain barrier. Protein delivery The versatility of modified EVs as drug delivery carriers lies in their ability to carry various types of therapeutic agents, where the delivery of protein-based drugs represents a key application direction. Through surface modification, EVs can efficiently load protein molecules such as antibodies and receptor decoys, enabling targeted delivery and exerting specific therapeutic effects. The following section specifically elaborates on the application mechanisms and research examples of modified EVs in protein delivery. Modified EVs are capable of delivering monoclonal antibodies or antibody fragments for therapeutic applications. For example, modified EVs can establish contact between cancer cells and immune cells, promoting host anti-tumor immunity. This was confirmed by a study showing that monoclonal antibodies on the surface of EVs were reprogrammed to bind both CD63 on T cell surfaces and epidermal growth factor receptor (EGFR) on triple-negative breast cancer (TNBC) cells [ 96 3 97 98 Fig. 3 Schematic diagram of drug delivery by modified EVs. EVs can deliver proteins, nucleic acids, and chemotherapeutic drugs. Nucleic acid delivery: EVs can deliver gene drugs to cochlear and vestibular hair cells, restoring hearing in mice with hereditary deafness. Chemotherapeutic drug delivery: Using EVs loaded with doxorubicin and sorafenib, therapeutic efficacy was enhanced in a mouse model of orthotopic hepatocellular carcinoma, inducing apoptosis of hepatocellular carcinoma cells. Protein delivery: By reprogramming monoclonal antibodies on the surface of exosomes to simultaneously bind to CD63 on T cells and EGFR on the epidermis of TNBC cells, cancer cell apoptosis is induced Nucleic acid delivery This section elaborates on the application of modified EVs in nucleic acid delivery, including the loading and delivery mechanisms of mRNA, miRNA, siRNA, and CRISPR-Cas systems. Through research examples in models of genetic diseases and viral infections, it illustrates the advantages of modified EVs in improving the stability, targeting, and therapeutic effects of nucleic acid drugs, demonstrating their potential in gene therapy. EVs can be loaded with nucleic acid-based therapeutic agents such as messenger RNA (mRNA), miRNA, small-interfering (siRNA), and small nucleolar RNA (snoRNA) [ 99 100 101 102 103 3 104 105 Chemotherapeutic drug delivery This section discusses the application of modified EVs in chemotherapeutic drug delivery, with paclitaxel, doxorubicin, and other drugs as examples to elaborate on their loading methods, targeted delivery mechanisms, and therapeutic effects in tumor models. Research data shows that modified EVs can improve the stability, bioavailability, and lesion targeting of chemotherapeutic drugs, providing a new strategy for reducing chemotherapy side effects and enhancing efficacy. EVs can not only deliver protein and nucleic acid-based therapeutic medicines, but they may also carry chemotherapeutics. Matthew J Haney et al. loaded paclitaxel (PTX) and doxorubicin (Dox) into macrophage-derived EVs, which showed high anticancer efficacy in a mouse model of pulmonary metastases [ 106 107 107 3 108 109 110 The efficiency of modified EVs in drug delivery has demonstrated their great potential in disease treatment. Based on the pathological characteristics and target differences of various diseases, modified EVs can achieve precise therapy, significantly improving efficacy and reducing side effects. The following section discusses the application of modified EVs in the treatment of specific diseases such as brain disorders, tumors, and liver diseases. Targeted treatment with modified EVs The previously described genetic, physical, and chemical modifications to EVs equip them with various functions. These functional EVs could exhibit targeted efficacy for various illnesses, facilitating more efficient disease therapy (Fig. 4 Fig. 4 Schematic diagram of disease targeting by modified EVs. By modifying EVs genetically, metabolically, physically, and chemically to give them diverse functions, these functional EVs can more effectively cure diseases, including AD, TBI, schizophrenia, cancer, and liver disease Building on the specificity of functional modifications, this section elaborates on the therapeutic strategies of modified EVs in three major categories of diseases, including brain disorders, tumor therapy, and liver diseases. Modified EVs for brain therapy Among various diseases, brain disorders have long been a clinical challenge due to the difficulty of drug delivery caused by the blood–brain barrier (BBB). Modified EVs, with their natural biocompatibility and barrier-crossing ability, provide a new approach for the targeted treatment of brain disorders. The following section focuses on the application of modified EVs in brain disease treatment, including their mechanisms of crossing the BBB and therapeutic effects on different brain disorders. EVs regulate homeostasis in the body by communicating between neurons, glia, and vascular cells. They participate in synaptic activity [ 111 112 113 112 114 115 EVs and the blood–brain barrier The blood–brain barrier (BBB), which protects the brain and maintains the central nervous system’s (CNS) homeostasis, serves as one of the most sophisticated and selective barriers in the human body [ 116 117 118 119 120 121 122 123 125 5 Fig. 5 Schematic diagram of modified EVs crossing the BBB for treating brain diseases. αvβ3, α4β1on EVs recognize VCAM-1 and FN on BMECs, triggering adhesion. EVs then induce BMEC membrane invagination to form caveolae, which are internalized into caveosomes (dependent on caveolin-1 and dynamin GTPase) and finally released into the brain parenchyma via exocytosis. EVs subsequently bind to target cells via surface molecules and are internalized. For AD amelioration: EVs carry Aβ-degrading enzymes to reduce Aβ deposition, inhibit Tau phosphorylation via the AKT/GSK-3β pathway, regulate inflammatory factors (decrease TNF-α, IL-1β; increase IL-10), and suppress nitric oxide release from microglia. For TBI amelioration: EVs inhibit NLRP3 inflammasome and p38 MAPK pathway, reduce IL-1β/IL-18 release, suppress microglial polarization to M1 phenotype, and long-term improve cognitive and emotional functions post-TBI Some experiments have shown that EVs may facilitate protein transport across the barrier in vivo. EVs produced by erythrocytes can transfer α-synuclein to the BBB via cytosis [ 126 127 128 129 130 EVs and different brain diseases EVs are involved in treating brain disorders, such as stroke, Alzheimer’s disease (AD), traumatic brain injury, and schizophrenia [ 131 132 133 134 135 136 The core pathological mechanisms of Alzheimer’s disease (AD) are generally recognized to be closely linked to the abnormal aggregation of β-amyloid (Aβ) and hyperphosphorylation of Tau protein; thus, clearing Aβ and inhibiting pathological changes in Tau protein have emerged as potential therapeutic strategies [ 114 Specifically, EVs can act by directly targeting Aβ: EVs derived from mouse neuroblastoma cells can capture Aβ oligomers via their surface proteins, thereby neutralizing the disruption of Aβ on synaptic plasticity [ 115 125 5 116 5 137 5 117 Traumatic brain injury (TBI) is a complicated and devastating disorder. It causes many symptoms, including those affecting the body, cognition, senses, and emotions, due to a dynamic combination of tissue damage from the initial injury and the cellular and biochemical processes that occur secondary to the injury. EVs offer enormous potential in the diagnosis and treatment of TBI. They are important prospective biomarkers because they directly participate in the progression of TBI and the expression of its brain cell type-specific surface markers [ 138 139 140 Schizophrenia is a serious mental illness with a wide range of clinical symptoms. Accurate diagnosis and effective treatment of schizophrenia remain challenging due to the lack of reliable diagnostics [ 141 142 The targeted treatment of brain disorders has verified the delivery capability of modified EVs in complex physiological environments. Tumors, as another highly heterogeneous disease, require higher targeting and killing efficiency of drugs. By simulating intercellular communication in the tumor microenvironment, modified EVs can achieve precise targeting and effective killing of tumor cells. The following section elaborates on the strategies and mechanisms of modified EVs in tumor therapy. Modified EVs for tumor therapy This section elaborates on the application of modified EVs in tumor therapy, including inhibiting tumor growth and metastasis by delivering pro-apoptotic molecules, regulating the tumor microenvironment, and activating immune responses. Taking models of breast cancer and lung cancer as examples, it analyzes the effects of modified EVs in inducing tumor cell apoptosis and breaking immune tolerance, highlighting their potential in personalized tumor treatment. Tumor growth and metastasis mainly occur through intercellular communication. The tumor microenvironment can signal not only locally but also distantly to future metastatic sites, encouraging the establishment of a pre-metastatic niche (PMN) and allowing cancer cells to arrive and grow fast [ 143 144 145 146 5 83 147 Tumor-derived signaling molecules, such as cytokines, immunological checkpoint stimulators, and microvesicles, can induce immune tolerance, allowing tumor cells to escape from immunological detection and clearance [ 148 149 150 151 152 153 156 6 Fig. 6 Schematic diagram of modified EVs for tumor therapy. MSCs are derived from adipose tissue, bone marrow, and umbilical cord, and their EVs carry miR-23b. They are modified to produce MSCT-EVs, and surface-expressed TRAIL selectively induces apoptosis in cancer cells. Tumor-derived signaling molecules can induce immune tolerance, allowing tumor cells to avoid detection and killing. Thus, destroying this tolerance is the key to immunotherapy. Modified immature DCs loaded with tumor-derived or genetically manipulated, then mature DCs secrete EVs (DEX), which are stable and dominant. They are then transferred to the patients to induce specific T-cell responses against tumor cells, leading to apoptosis of the cancer cells In tumor therapy, the targeted delivery and immunomodulatory effects of modified EVs have been fully verified. The liver, as a metabolically active organ, faces challenges such as poor targeting and severe side effects in the treatment of its diseases. Modified EVs with their natural affinity for liver tissue provide a new direction for the precise treatment of liver diseases. The following section discusses the application mechanisms of engineered EVs in liver disease treatment. Engineered EVs for treating liver diseases This section discusses the application of engineered EVs in treating liver diseases, including alleviating liver fibrosis, inhibiting hepatocellular carcinoma cell proliferation, and regulating intrahepatic inflammation. Combined with animal model data, it will elaborate on the therapeutic effects of EVs by delivering anti-fibrotic factors and activating immune cells, which emphasizes their advantages in protecting liver function and improving treatment safety. EVs have also been the focus of extensive investigation in the field of hepatology. The liver has a high intrinsic regenerative capacity, and EVs have a specific affinity for liver tissue. Furthermore, EVs have shown potential in animal models for the treatment of hepatocellular carcinoma and liver damage, making the liver an ideal target for EVs-based therapeutics. EVs have been demonstrated to be closely associated with hepatic inflammation. [ 157 158 159 162 163 164 Liver fibrosis is caused by an excessive accumulation of extracellular matrix proteins, including collagen, and is present in the majority of chronic liver disorders [ 165 166 4 167 168 Hepatocellular carcinoma cells secrete EVs at higher rates than normal cells, and EVs from these cells promote metastasis. Anticancer medications cause hepatocellular carcinoma cells to produce more EVs, which activate natural killer cells, resulting in anti-tumor immunity [ 169 170 Limitations and challenges of EVs EVs show great potential in multiple fields such as disease diagnosis, drug delivery, and therapy. However, there are still several limitations and challenges that hinder their widespread application and in-depth research. The following sections specifically elaborate on the existing limitations and challenges of EVs. Limitations of separation and purification technology Although traditional separation techniques such as ultracentrifugation and SEC remain widely used, recent studies have revealed that their technical bottlenecks are increasingly prominent. These techniques generally suffer from issues including insufficient purity, large fluctuations in recovery efficiency, and poor batch-to-batch reproducibility, resulting in a dual dilemma of \"high background contamination and low effective output\" in exosomal proteomics research [ 171 173 Notably, recent studies have developed a multistage separation protocol that combines differential centrifugation with density gradient fractionation. This integrated approach enables simultaneous isolation of EVs from non-vesicular contaminants, significantly enhancing sample purity and experimental reproducibility. However, this protocol requires 72 h of continuous operation, which severely limits its application potential in high-throughput research scenarios [ 174 Ultracentrifugation itself has inherent limitations, where its separation process may coprecipitate non-EV components such as protein aggregates or lipoproteins, leading to reduced sample purity [ 175 51 6 176 177 178 Challenges in clinical application EVs exhibit great potential in disease diagnosis, targeted therapy, and drug delivery, owing to their inherent biological activity, targeting ability, and low immunogenicity. However, the translation from basic research to clinical application faces numerous limitations and challenges. Currently, most EV-related clinical trials are still in early stages, characterized by small sample sizes, short follow-up periods, and a lack of long-term safety and efficacy data, which hinder their clinical translation progress [ 179 180 Large-scale production and quality control represent core obstacles to the industrialization of EVs. Natural EVs have extremely low yields and are highly dependent on cell sources. While cell lines with high secretory activity, phenotypic stability, and biosafety (e.g., CHO cells, mesenchymal stem cells) are preferred, the surface proteome of their EVs differs significantly from that of natural cell-derived EVs. Furthermore, tumor cell-derived EVs may carry oncogenic factors (e.g., EGFRvIII mutant protein) [ 177 181 182 The targeting efficiency of EVs in delivery is constrained by their inherent biological properties. Insufficient tissue specificity of surface ligands results in poor penetration into diseased tissues. Even when targeting molecules are genetically engineered, significant non-target cell endocytosis persists. Recent studies have shown that chemical modification reduces CD47 expression in EVs by 40% and doubles their in vivo clearance rate. \"Don’t eat me\" signaling molecules, such as CD47 on EV surfaces, may be masked or destroyed during modification, leading to extensive phagocytosis by macrophages [ 183 Despite these challenges, the high biocompatibility and endogenous substance transport capacity of EVs provide a strong theoretical basis for their application in drug delivery. Critical challenges in EV therapeutics include establishing production standards, improving targeted delivery efficacy, and ensuring long-term safety. Overcoming these hurdles through the development of efficient, stable, and clinically viable exosome delivery systems promises transformative advances in human medicine. Conclusion Extracellular vesicles (EVs) have high potential to be employed as a bio-carrier material in drug delivery systems and have the potential to replace traditional biomaterials as therapeutic carriers for medications and genes. Surface modification of EVs will play a significant role in improving their delivery function, leading to various targeted delivery and biotherapeutic applications. Given these characteristics, the importance of EVs’ potential applications in medicine becomes apparent. Previous research has shown that EVs proteins, such as those seen in cancer cells, retain cargo that reveals information about the condition of the secreting cell as well as insights into the growth of the recipient cell. In addition to playing an important role in chemotherapy resistance, EVs-mediated cell-to-cell communication has emerged as a significant regulatory mechanism in cancer dissemination and carcinogenesis. However, due to limited analytical techniques available, the isolation and purification of EVs are not particularly mature, necessitating additional research and efforts from researchers in this field. EVs are emerging as promising biomarkers and valuable therapeutic targets, strongly linked to the advancement of precision medicine. Furthermore, they can be used as potential drug-delivery vehicles or cell-free vaccinations. Abbreviations EVs Extracellular vesicles MVs Microvesicles PM Plasma membrane ILVs Intraluminal vesicles MVB Multivesicular bodies DMVB Degradative MVB SMVB Secretory MVB ESCRT Endosomal sorting complex required for transport ALIX ALG-2-interacting protein X TSG101 Tumor susceptibility gene 101 CD Cluster of differentiation EGFR Epidermal growth factor receptor MHC Major histocompatibility complex LAMP1 Lysosomal-associated membrane protein 1 TfR Transferrin receptor ncRNA Non-coding RNA dsDNA Double-stranded DNA ssDNA Single-stranded DNA mtDNA Mitochondrial DNA CM Cerebral malaria MV Microvesicle ECM Extracellular matrix MWCO Molecular weight cut-off IDEM Immune-Derived Exosome Mimetics SEC Size exclusion chromatography ELVs Exosome-like vesicles FlFFF Flow field-flow fractionation ELISA Enzyme-linked immunosorbent assay AML Acute myeloid leukemia LOD Limit of detection PEG Polyethylene glycol PCR Polymerase chain reaction CTC Circulating tumor cells miRNAs MicroRNAs siRNA Small-interfering CPC Cardiac progenitor cell PDCD4 MiR-21 targets the gene Cell Death 4 RVG Rabies virus glycoprotein MSP Muscle-specific peptide UUO Unilateral ureteral obstruction AHA L-azidohomoalanine ManNAz N-azidoacetyl-D-mannosamine Mal Maleimide AuNPs Gold nanoparticles MPs Magnetic particles CuAAC Copper-catalyzed azide-alkyne cycloaddition DBCO Dibenzobicyclooctyne SPAAC Strain-promoted azide-alkyne click MSCs Mesenchymal stem cells TNBC Triple-negative breast cancer ACE2 Angiotensin-converting enzyme II SARS-CoV-2 Syndrome coronavirus 2 TACI Transmembrane activator and calcium modulator and cyclophilin ligand interactor APRIL A proliferation-inducing ligand SLE Systemic lupus erythematosus mRNA Messenger RNA sonRNA Small nucleolar RNA Exo-AAV Exosome-associated adeno-associated virus CRISPR Clustered regularly interspaced short palindromic repeats Cas CRISPR-associated nuclease PTX Paclitaxel Dox Doxorubicin RBC-EVs EVs from red blood cells SRF Sorafenib BBB Blood–brain barrier CNS Central nervous system BMEC Brain microvascular endothelial cell VCAM-1 Vascular cell adhesion molecule-1 FN Fibronectin AD Alzheimer’s disease Aβ Amyloid β peptide MSC Mesenchymal stem cell MSC-EVs Mesenchymal stem cell-derived EVs Exo-cur Exosomes derived from curcumin-treated (primed) cells ADEs Astrocyte-derived exosomes FTD Frontotemporal dementia TBI Traumatic brain injury PCP Phencyclidine PPI Prepulse inhibition PMN Pre-metastatic niche TRAIL TNF-related apoptosis-inducing ligand DCs Dendritic cells DEX DCs secrete EVs CXCL10 CXC motif ligand 10 TRAIL Tumour necrosis factor-related apoptosis-inducing ligand S1P Sphingosine 1-phosphate HSCs Hepatic stellate cells CCl 4 Carbon tetrachloride CCN2 Profibrogenic connective tissue growth factor Hsp Heat shock protein Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements This work was supported by the Fundamental Research Funds for the Central Universities of Southwest Minzu University (ZYN2025117); Medical and Health Research Foundation from the Science and Technology Department of Yichang (A24-2-030). Author contributions Minghui Hu: Writing–review & editing, Writing–original draft, Visualization, Methodology, Conceptualization. Yuxin Han: Writing–review & editing, Writing–original draft, Visualization. Xin Zhang: Writing–review & editing, Writing–original draft. Shengqian Tian: Writing–review & editing, Writing–original draft. Zhenghui Shang: Writing—review & editing, Resources, Methodology, Conceptualization. Zhixiang Yuan: Writing–review & editing, Supervision, Methodology, Conceptualization. Lili He: Writing–review & editing, Writing–original draft, Visualization, Supervision, Methodology, Conceptualization. Data availability No data was used for the research described in the article. Declarations Ethics approval and consent to participate Not applicable. Consent for publication All authors read and approved the final manuscript. Competing interests The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. References 1. Cocucci E Meldolesi J Ectosomes and exosomes: shedding the confusion between extracellular vesicles Trends Cell Biol 2015 25 364 372 10.1016/j.tcb.2015.01.004 25683921 Cocucci E, Meldolesi J. Ectosomes and exosomes: shedding the confusion between extracellular vesicles. Trends Cell Biol. 2015;25:364–72. 25683921 10.1016/j.tcb.2015.01.004 2. Mohamed AH Abaza T Youssef YA Rady M Fahmy SA Kamel R Hamdi N Efthimiado E Braoudaki M Youness RA Extracellular vesicles: from intracellular trafficking molecules to fully fortified delivery vehicles for cancer therapeutics Nanoscale Adv 2025 7 934 962 10.1039/D4NA00393D 39823046 PMC11733735 Mohamed AH, Abaza T, Youssef YA, Rady M, Fahmy SA, Kamel R, et al. Extracellular vesicles: from intracellular trafficking molecules to fully fortified delivery vehicles for cancer therapeutics. Nanoscale Adv. 2025;7:934–62. 39823046 10.1039/d4na00393d PMC11733735 3. Bebelman MP Smit MJ Pegtel DM Baglio SR Biogenesis and function of extracellular vesicles in cancer Pharmacol Ther 2018 188 1 11 10.1016/j.pharmthera.2018.02.013 29476772 Bebelman MP, Smit MJ, Pegtel DM, Baglio SR. Biogenesis and function of extracellular vesicles in cancer. Pharmacol Ther. 2018;188:1–11. 29476772 10.1016/j.pharmthera.2018.02.013 4. Royo F Cossío U Ruiz de Angulo A Llop J Falcon-Perez JM Modification of the glycosylation of extracellular vesicles alters their biodistribution in mice Nanoscale 2019 11 1531 1537 10.1039/C8NR03900C 30623961 Royo F, Cossío U, Ruiz de Angulo A, Llop J, Falcon-Perez JM. Modification of the glycosylation of extracellular vesicles alters their biodistribution in mice. Nanoscale. 2019;11:1531–7. 30623961 10.1039/c8nr03900c 5. Mohammadi AH Ghazvinian Z Bagheri F Harada M Baghaei K Modification of extracellular vesicle surfaces: an approach for targeted drug delivery BioDrugs 2023 37 353 374 10.1007/s40259-023-00595-5 37093521 Mohammadi AH, Ghazvinian Z, Bagheri F, Harada M, Baghaei K. Modification of extracellular vesicle surfaces: an approach for targeted drug delivery. BioDrugs. 2023;37:353–74. 37093521 10.1007/s40259-023-00595-5 6. Zhang X Zhang H Gu J Zhang J Shi H Qian H Wang D Xu W Pan J Santos HA Engineered extracellular vesicles for cancer therapy Adv Mater 2021 33 e2005709 10.1002/adma.202005709 33644908 Zhang X, Zhang H, Gu J, Zhang J, Shi H, Qian H, et al. Engineered extracellular vesicles for cancer therapy. Adv Mater. 2021;33:e2005709. 33644908 10.1002/adma.202005709 7. Gečys D Kazlauskas A Gečytė E Paužienė N Kulakauskienė D Lukminaitė I Jekabsone A Internalisation of RGD-engineered extracellular vesicles by glioblastoma cells Biology (Basel) 2022 10.3390/biology11101483 36290387 PMC9598886 Gečys D, Kazlauskas A, Gečytė E, Paužienė N, Kulakauskienė D, Lukminaitė I, et al. Internalisation of RGD-engineered extracellular vesicles by glioblastoma cells. Biology (Basel). 2022. 10.3390/biology11101483. 36290387 10.3390/biology11101483 PMC9598886 8. Monguió-Tortajada M Gálvez-Montón C Bayes-Genis A Roura S Borràs FE Extracellular vesicle isolation methods: rising impact of size-exclusion chromatography Cell Mol Life Sci 2019 76 2369 2382 10.1007/s00018-019-03071-y 30891621 PMC11105396 Monguió-Tortajada M, Gálvez-Montón C, Bayes-Genis A, Roura S, Borràs FE. Extracellular vesicle isolation methods: rising impact of size-exclusion chromatography. Cell Mol Life Sci. 2019;76:2369–82. 30891621 10.1007/s00018-019-03071-y PMC11105396 9. Couch Y Buzàs EI Di Vizio D Gho YS Harrison P Hill AF Lötvall J Raposo G Stahl PD Théry C A brief history of nearly EV-erything - the rise and rise of extracellular vesicles J Extracell Vesicles 2021 10 e12144 10.1002/jev2.12144 34919343 PMC8681215 Couch Y, Buzàs EI, Di Vizio D, Gho YS, Harrison P, Hill AF, et al. A brief history of nearly EV-erything - the rise and rise of extracellular vesicles. J Extracell Vesicles. 2021;10:e12144. 34919343 10.1002/jev2.12144 PMC8681215 10. Kalra H Drummen GP Mathivanan S Focus on extracellular vesicles: introducing the next small big thing Int J Mol Sci 2016 17 170 10.3390/ijms17020170 26861301 PMC4783904 Kalra H, Drummen GP, Mathivanan S. Focus on extracellular vesicles: introducing the next small big thing. Int J Mol Sci. 2016;17:170. 26861301 10.3390/ijms17020170 PMC4783904 11. Richter M Vader P Fuhrmann G Approaches to surface engineering of extracellular vesicles Adv Drug Deliv Rev 2021 173 416 426 10.1016/j.addr.2021.03.020 33831479 Richter M, Vader P, Fuhrmann G. Approaches to surface engineering of extracellular vesicles. Adv Drug Deliv Rev. 2021;173:416–26. 33831479 10.1016/j.addr.2021.03.020 12. Kumar MA Baba SK Sadida HQ Marzooqi SA Jerobin J Altemani FH Algehainy N Alanazi MA Abou-Samra AB Kumar R Extracellular vesicles as tools and targets in therapy for diseases Signal Transduct Target Ther 2024 9 27 10.1038/s41392-024-01735-1 38311623 PMC10838959 Kumar MA, Baba SK, Sadida HQ, Marzooqi SA, Jerobin J, Altemani FH, et al. Extracellular vesicles as tools and targets in therapy for diseases. Signal Transduct Target Ther. 2024;9:27. 38311623 10.1038/s41392-024-01735-1 PMC10838959 13. Meldolesi J Exosomes and ectosomes in intercellular communication Curr Biol 2018 28 R435 r444 10.1016/j.cub.2018.01.059 29689228 Meldolesi J. Exosomes and ectosomes in intercellular communication. Curr Biol. 2018;28:R435-r444. 29689228 10.1016/j.cub.2018.01.059 14. Xu X Lai Y Hua ZC 2019 Apoptosis and apoptotic body: disease message and therapeutic target potentials Biosci Rep 10.1042/BSR20180992 PMC6340950 30530866 Xu X, Lai Y, Hua ZC. Apoptosis and apoptotic body: disease message and therapeutic target potentials. 2019. Biosci Rep. 10.1042/BSR20180992. 10.1042/BSR20180992 PMC6340950 30530866 15. Mathieu M Martin-Jaular L Lavieu G Théry C Specificities of secretion and uptake of exosomes and other extracellular vesicles for cell-to-cell communication Nat Cell Biol 2019 21 9 17 10.1038/s41556-018-0250-9 30602770 Mathieu M, Martin-Jaular L, Lavieu G, Théry C. Specificities of secretion and uptake of exosomes and other extracellular vesicles for cell-to-cell communication. Nat Cell Biol. 2019;21:9–17. 30602770 10.1038/s41556-018-0250-9 16. Gong T Liu YT Fan J Exosomal mediators in sepsis and inflammatory organ injury: unraveling the role of exosomes in intercellular crosstalk and organ dysfunction Mil Med Res 2024 11 24 38644472 10.1186/s40779-024-00527-6 PMC11034107 Gong T, Liu YT, Fan J. Exosomal mediators in sepsis and inflammatory organ injury: unraveling the role of exosomes in intercellular crosstalk and organ dysfunction. Mil Med Res. 2024;11:24. 38644472 10.1186/s40779-024-00527-6 PMC11034107 17. Babst M MVB vesicle formation: ESCRT-dependent, ESCRT-independent and everything in between Curr Opin Cell Biol 2011 23 452 457 10.1016/j.ceb.2011.04.008 21570275 PMC3148405 Babst M. MVB vesicle formation: ESCRT-dependent, ESCRT-independent and everything in between. Curr Opin Cell Biol. 2011;23:452–7. 21570275 10.1016/j.ceb.2011.04.008 PMC3148405 18. Al-Nedawi K Meehan B Micallef J Lhotak V May L Guha A Rak J Intercellular transfer of the oncogenic receptor EGFRvIII by microvesicles derived from tumour cells Nat Cell Biol 2008 10 619 624 10.1038/ncb1725 18425114 Al-Nedawi K, Meehan B, Micallef J, Lhotak V, May L, Guha A, et al. Intercellular transfer of the oncogenic receptor EGFRvIII by microvesicles derived from tumour cells. Nat Cell Biol. 2008;10:619–24. 18425114 10.1038/ncb1725 19. O’Brien K Breyne K Ughetto S Laurent LC Breakefield XO RNA delivery by extracellular vesicles in mammalian cells and its applications Nat Rev Mol Cell Biol 2020 21 585 606 10.1038/s41580-020-0251-y 32457507 PMC7249041 O’Brien K, Breyne K, Ughetto S, Laurent LC, Breakefield XO. RNA delivery by extracellular vesicles in mammalian cells and its applications. Nat Rev Mol Cell Biol. 2020;21:585–606. 32457507 10.1038/s41580-020-0251-y PMC7249041 20. Li S The basic characteristics of extracellular vesicles and their potential application in bone sarcomas J Nanobiotechnology 2021 19 277 10.1186/s12951-021-01028-7 34535153 PMC8447529 Li S. The basic characteristics of extracellular vesicles and their potential application in bone sarcomas. J Nanobiotechnology. 2021;19:277. 34535153 10.1186/s12951-021-01028-7 PMC8447529 21. Chernyshev VS Rachamadugu R Tseng YH Belnap DM Jia Y Branch KJ Butterfield AE Pease LF 3rd Bernard PS Skliar M Size and shape characterization of hydrated and desiccated exosomes Anal Bioanal Chem 2015 407 3285 3301 10.1007/s00216-015-8535-3 25821114 Chernyshev VS, Rachamadugu R, Tseng YH, Belnap DM, Jia Y, Branch KJ, et al. Size and shape characterization of hydrated and desiccated exosomes. Anal Bioanal Chem. 2015;407:3285–301. 25821114 10.1007/s00216-015-8535-3 22. Arraud N Linares R Tan S Gounou C Pasquet JM Mornet S Brisson AR Extracellular vesicles from blood plasma: determination of their morphology, size, phenotype and concentration J Thromb Haemost 2014 12 614 627 10.1111/jth.12554 24618123 Arraud N, Linares R, Tan S, Gounou C, Pasquet JM, Mornet S, et al. Extracellular vesicles from blood plasma: determination of their morphology, size, phenotype and concentration. J Thromb Haemost. 2014;12:614–27. 24618123 10.1111/jth.12554 23. Brennan K Martin K FitzGerald SP O’Sullivan J Wu Y Blanco A Richardson C Mc Gee MM A comparison of methods for the isolation and separation of extracellular vesicles from protein and lipid particles in human serum Sci Rep 2020 10 1039 10.1038/s41598-020-57497-7 31974468 PMC6978318 Brennan K, Martin K, FitzGerald SP, O’Sullivan J, Wu Y, Blanco A, et al. A comparison of methods for the isolation and separation of extracellular vesicles from protein and lipid particles in human serum. Sci Rep. 2020;10:1039. 31974468 10.1038/s41598-020-57497-7 PMC6978318 24. de Jong OG Kooijmans SAA Murphy DE Jiang L Evers MJW Sluijter JPG Vader P Schiffelers RM Drug delivery with extracellular vesicles: from imagination to innovation Acc Chem Res 2019 52 1761 1770 10.1021/acs.accounts.9b00109 31181910 PMC6639984 de Jong OG, Kooijmans SAA, Murphy DE, Jiang L, Evers MJW, Sluijter JPG, et al. Drug delivery with extracellular vesicles: from imagination to innovation. Acc Chem Res. 2019;52:1761–70. 31181910 10.1021/acs.accounts.9b00109 PMC6639984 25. Yang C Xue Y Duan Y Mao C Wan M Extracellular vesicles and their engineering strategies, delivery systems, and biomedical applications J Control Release 2024 365 1089 1123 10.1016/j.jconrel.2023.11.057 38065416 Yang C, Xue Y, Duan Y, Mao C, Wan M. Extracellular vesicles and their engineering strategies, delivery systems, and biomedical applications. J Control Release. 2024;365:1089–123. 38065416 10.1016/j.jconrel.2023.11.057 26. Théry C Boussac M Véron P Ricciardi-Castagnoli P Raposo G Garin J Amigorena S Proteomic analysis of dendritic cell-derived exosomes: a secreted subcellular compartment distinct from apoptotic vesicles J Immunol 2001 166 7309 7318 10.4049/jimmunol.166.12.7309 11390481 Théry C, Boussac M, Véron P, Ricciardi-Castagnoli P, Raposo G, Garin J, et al. Proteomic analysis of dendritic cell-derived exosomes: a secreted subcellular compartment distinct from apoptotic vesicles. J Immunol. 2001;166:7309–18. 11390481 10.4049/jimmunol.166.12.7309 27. Rädler J Gupta D Zickler A Andaloussi SE Exploiting the biogenesis of extracellular vesicles for bioengineering and therapeutic cargo loading Mol Ther 2023 31 1231 1250 10.1016/j.ymthe.2023.02.013 36805147 PMC10188647 Rädler J, Gupta D, Zickler A, Andaloussi SE. Exploiting the biogenesis of extracellular vesicles for bioengineering and therapeutic cargo loading. Mol Ther. 2023;31:1231–50. 36805147 10.1016/j.ymthe.2023.02.013 PMC10188647 28. Ono K Sato J Suzuki H Sawada M Distribution of Signal Peptides in Microvesicles from Activated Macrophage Cells Int J Mol Sci 2023 24 15 12131 10.3390/ijms241512131 37569508 PMC10418841 Ono K, Sato J, Suzuki H, Sawada M. Distribution of Signal Peptides in Microvesicles from Activated Macrophage Cells. Int J Mol Sci. 2023;24(15):12131. 37569508 10.3390/ijms241512131 PMC10418841 29. Ratajczak J Miekus K Kucia M Zhang J Reca R Dvorak P Ratajczak MZ Embryonic stem cell-derived microvesicles reprogram hematopoietic progenitors: evidence for horizontal transfer of mRNA and protein delivery Leukemia 2006 20 847 856 10.1038/sj.leu.2404132 16453000 Ratajczak J, Miekus K, Kucia M, Zhang J, Reca R, Dvorak P, et al. Embryonic stem cell-derived microvesicles reprogram hematopoietic progenitors: evidence for horizontal transfer of mRNA and protein delivery. Leukemia. 2006;20:847–56. 16453000 10.1038/sj.leu.2404132 30. Crescitelli R Lässer C Szabó TG Kittel A Eldh M Dianzani I Buzás EI Lötvall J Distinct RNA profiles in subpopulations of extracellular vesicles: apoptotic bodies, microvesicles and exosomes J Extracell Vesicles 2013 10.3402/jev.v2i0.20677 24223256 PMC3823106 Crescitelli R, Lässer C, Szabó TG, Kittel A, Eldh M, Dianzani I, et al. Distinct RNA profiles in subpopulations of extracellular vesicles: apoptotic bodies, microvesicles and exosomes. J Extracell Vesicles. 2013. 10.3402/jev.v2i0.20677. 24223256 10.3402/jev.v2i0.20677 PMC3823106 31. Nolte-‘t Hoen EN Buermans HP Waasdorp M Stoorvogel W Wauben MH t Hoen PA Deep sequencing of RNA from immune cell-derived vesicles uncovers the selective incorporation of small non-coding RNA biotypes with potential regulatory functions Nucleic Acids Res 2012 40 9272 9285 10.1093/nar/gks658 22821563 PMC3467056 Nolte-‘t Hoen EN, Buermans HP, Waasdorp M, Stoorvogel W, Wauben MH, t Hoen PA. Deep sequencing of RNA from immune cell-derived vesicles uncovers the selective incorporation of small non-coding RNA biotypes with potential regulatory functions. Nucleic Acids Res. 2012;40:9272–85. 22821563 10.1093/nar/gks658 PMC3467056 32. Huang X Yuan T Tschannen M Sun Z Jacob H Du M Liang M Dittmar RL Liu Y Liang M Characterization of human plasma-derived exosomal RNAs by deep sequencing BMC Genomics 2013 14 319 10.1186/1471-2164-14-319 23663360 PMC3653748 Huang X, Yuan T, Tschannen M, Sun Z, Jacob H, Du M, et al. Characterization of human plasma-derived exosomal RNAs by deep sequencing. BMC Genomics. 2013;14:319. 23663360 10.1186/1471-2164-14-319 PMC3653748 33. Cheng L Sun X Scicluna BJ Coleman BM Hill AF Characterization and deep sequencing analysis of exosomal and non-exosomal miRNA in human urine Kidney Int 2014 86 433 444 10.1038/ki.2013.502 24352158 Cheng L, Sun X, Scicluna BJ, Coleman BM, Hill AF. Characterization and deep sequencing analysis of exosomal and non-exosomal miRNA in human urine. Kidney Int. 2014;86:433–44. 24352158 10.1038/ki.2013.502 34. Wang S Zhang K Tan S Xin J Yuan Q Xu H Xu X Liang Q Christiani DC Wang M Circular rnas in body fluids as cancer biomarkers: the new frontier of liquid biopsies Mol Cancer 2021 20 13 10.1186/s12943-020-01298-z 33430880 PMC7798340 Wang S, Zhang K, Tan S, Xin J, Yuan Q, Xu H, et al. Circular rnas in body fluids as cancer biomarkers: the new frontier of liquid biopsies. Mol Cancer. 2021;20:13. 33430880 10.1186/s12943-020-01298-z PMC7798340 35. Guescini M Genedani S Stocchi V Agnati LF Astrocytes and glioblastoma cells release exosomes carrying mtDNA J Neural Transm (Vienna) 2010 117 1 4 10.1007/s00702-009-0288-8 19680595 Guescini M, Genedani S, Stocchi V, Agnati LF. Astrocytes and glioblastoma cells release exosomes carrying mtDNA. J Neural Transm (Vienna). 2010;117:1–4. 19680595 10.1007/s00702-009-0288-8 36. Waldenström A Gennebäck N Hellman U Ronquist G Cardiomyocyte microvesicles contain DNA/RNA and convey biological messages to target cells PLoS ONE 2012 7 e34653 10.1371/journal.pone.0034653 22506041 PMC3323564 Waldenström A, Gennebäck N, Hellman U, Ronquist G. Cardiomyocyte microvesicles contain DNA/RNA and convey biological messages to target cells. PLoS ONE. 2012;7:e34653. 22506041 10.1371/journal.pone.0034653 PMC3323564 37. Laulagnier K Grand D Dujardin A Hamdi S Vincent-Schneider H Lankar D Salles JP Bonnerot C Perret B Record M PLD2 is enriched on exosomes and its activity is correlated to the release of exosomes FEBS Lett 2004 572 11 14 10.1016/j.febslet.2004.06.082 15304316 Laulagnier K, Grand D, Dujardin A, Hamdi S, Vincent-Schneider H, Lankar D, et al. PLD2 is enriched on exosomes and its activity is correlated to the release of exosomes. FEBS Lett. 2004;572:11–4. 15304316 10.1016/j.febslet.2004.06.082 38. Sharma R Huang X Brekken RA Schroit AJ Detection of phosphatidylserine-positive exosomes for the diagnosis of early-stage malignancies Br J Cancer 2017 117 545 552 10.1038/bjc.2017.183 28641308 PMC5558679 Sharma R, Huang X, Brekken RA, Schroit AJ. Detection of phosphatidylserine-positive exosomes for the diagnosis of early-stage malignancies. Br J Cancer. 2017;117:545–52. 28641308 10.1038/bjc.2017.183 PMC5558679 39. Combes V Taylor TE Juhan-Vague I Mège JL Mwenechanya J Tembo M Grau GE Molyneux ME Circulating endothelial microparticles in Malawian children with severe falciparum malaria complicated with coma JAMA 2004 291 2542 2544 15173142 10.1001/jama.291.21.2542-b Combes V, Taylor TE, Juhan-Vague I, Mège JL, Mwenechanya J, Tembo M, et al. Circulating endothelial microparticles in Malawian children with severe falciparum malaria complicated with coma. JAMA. 2004;291:2542–4. 15173142 10.1001/jama.291.21.2542-b 40. Minagar A Jy W Jimenez JJ Sheremata WA Mauro LM Mao WW Horstman LL Ahn YS Elevated plasma endothelial microparticles in multiple sclerosis Neurology 2001 56 1319 1324 10.1212/WNL.56.10.1319 11376181 Minagar A, Jy W, Jimenez JJ, Sheremata WA, Mauro LM, Mao WW, et al. Elevated plasma endothelial microparticles in multiple sclerosis. Neurology. 2001;56:1319–24. 11376181 10.1212/wnl.56.10.1319 41. Zinger A Latham SL Combes V Byrne S Barnett MH Hawke S Grau GE Plasma levels of endothelial and B-cell-derived microparticles are restored by fingolimod treatment in multiple sclerosis patients Mult Scler 2016 22 1883 1887 10.1177/1352458516636959 26931477 Zinger A, Latham SL, Combes V, Byrne S, Barnett MH, Hawke S, et al. Plasma levels of endothelial and B-cell-derived microparticles are restored by fingolimod treatment in multiple sclerosis patients. Mult Scler. 2016;22:1883–7. 26931477 10.1177/1352458516636959 42. Lee S Mankhong S Kang JH Extracellular vesicle as a source of Alzheimer’s biomarkers: opportunities and challenges Int J Mol Sci 2019 10.3390/ijms20071728 30965555 PMC6479979 Lee S, Mankhong S, Kang JH. Extracellular vesicle as a source of Alzheimer’s biomarkers: opportunities and challenges. Int J Mol Sci. 2019. 10.3390/ijms20071728. 30965555 10.3390/ijms20071728 PMC6479979 43. Belting M Wittrup A Nanotubes, exosomes, and nucleic acid-binding peptides provide novel mechanisms of intercellular communication in eukaryotic cells: implications in health and disease J Cell Biol 2008 183 1187 1191 10.1083/jcb.200810038 19103810 PMC2606965 Belting M, Wittrup A. Nanotubes, exosomes, and nucleic acid-binding peptides provide novel mechanisms of intercellular communication in eukaryotic cells: implications in health and disease. J Cell Biol. 2008;183:1187–91. 19103810 10.1083/jcb.200810038 PMC2606965 44. Arck PC Hecher K Fetomaternal immune cross-talk and its consequences for maternal and offspring’s health Nat Med 2013 19 548 556 10.1038/nm.3160 23652115 Arck PC, Hecher K. Fetomaternal immune cross-talk and its consequences for maternal and offspring’s health. Nat Med. 2013;19:548–56. 23652115 10.1038/nm.3160 45. Sabapatha A Gercel-Taylor C Taylor DD Specific isolation of placenta-derived exosomes from the circulation of pregnant women and their immunoregulatory consequences Am J Reprod Immunol 2006 56 345 355 10.1111/j.1600-0897.2006.00435.x 17076679 Sabapatha A, Gercel-Taylor C, Taylor DD. Specific isolation of placenta-derived exosomes from the circulation of pregnant women and their immunoregulatory consequences. Am J Reprod Immunol. 2006;56:345–55. 17076679 10.1111/j.1600-0897.2006.00435.x 46. Frängsmyr L Baranov V Nagaeva O Stendahl U Kjellberg L Mincheva-Nilsson L Cytoplasmic microvesicular form of Fas ligand in human early placenta: switching the tissue immune privilege hypothesis from cellular to vesicular level Mol Hum Reprod 2005 11 35 41 10.1093/molehr/gah129 15579659 Frängsmyr L, Baranov V, Nagaeva O, Stendahl U, Kjellberg L, Mincheva-Nilsson L. Cytoplasmic microvesicular form of Fas ligand in human early placenta: switching the tissue immune privilege hypothesis from cellular to vesicular level. Mol Hum Reprod. 2005;11:35–41. 15579659 10.1093/molehr/gah129 47. Sung BH Ketova T Hoshino D Zijlstra A Weaver AM Directional cell movement through tissues is controlled by exosome secretion Nat Commun 2015 6 7164 10.1038/ncomms8164 25968605 PMC4435734 Sung BH, Ketova T, Hoshino D, Zijlstra A, Weaver AM. Directional cell movement through tissues is controlled by exosome secretion. Nat Commun. 2015;6:7164. 25968605 10.1038/ncomms8164 PMC4435734 48. Zomer A Maynard C Verweij FJ Kamermans A Schäfer R Beerling E Schiffelers RM de Wit E Berenguer J Ellenbroek SIJ Cell 2015 161 1046 1057 10.1016/j.cell.2015.04.042 26000481 PMC4448148 Zomer A, Maynard C, Verweij FJ, Kamermans A, Schäfer R, Beerling E, et al. Cell. 2015;161:1046–57. 26000481 10.1016/j.cell.2015.04.042 PMC4448148 49. Li P Kaslan M Lee SH Yao J Gao Z Progress in exosome isolation techniques Theranostics 2017 7 789 804 10.7150/thno.18133 28255367 PMC5327650 Li P, Kaslan M, Lee SH, Yao J, Gao Z. Progress in exosome isolation techniques. Theranostics. 2017;7:789–804. 28255367 10.7150/thno.18133 PMC5327650 50. Zaborowski MP Balaj L Breakefield XO Lai CP Extracellular vesicles: composition, biological relevance, and methods of study Bioscience 2015 65 783 797 10.1093/biosci/biv084 26955082 PMC4776721 Zaborowski MP, Balaj L, Breakefield XO, Lai CP. Extracellular vesicles: composition, biological relevance, and methods of study. Bioscience. 2015;65:783–97. 26955082 10.1093/biosci/biv084 PMC4776721 51. D’Acunzo P Kim Y Ungania JM Pérez-González R Goulbourne CN Levy E Isolation of mitochondria-derived mitovesicles and subpopulations of microvesicles and exosomes from brain tissues Nat Protoc 2022 17 2517 2549 10.1038/s41596-022-00719-1 35962195 PMC9633367 D’Acunzo P, Kim Y, Ungania JM, Pérez-González R, Goulbourne CN, Levy E. Isolation of mitochondria-derived mitovesicles and subpopulations of microvesicles and exosomes from brain tissues. Nat Protoc. 2022;17:2517–49. 35962195 10.1038/s41596-022-00719-1 PMC9633367 52. Zhu L Sun HT Wang S Huang SL Zheng Y Wang CQ Hu BY Qin W Zou TT Fu Y Isolation and characterization of exosomes for cancer research J Hematol Oncol 2020 13 152 10.1186/s13045-020-00987-y 33168028 PMC7652679 Zhu L, Sun HT, Wang S, Huang SL, Zheng Y, Wang CQ, et al. Isolation and characterization of exosomes for cancer research. J Hematol Oncol. 2020;13:152. 33168028 10.1186/s13045-020-00987-y PMC7652679 53. Quintana JF Makepeace BL Babayan SA Ivens A Pfarr KM Blaxter M Debrah A Wanji S Ngangyung HF Bah GS Extracellular Onchocerca Parasit Vectors 2015 8 58 10.1186/s13071-015-0656-1 25623184 PMC4316651 Quintana JF, Makepeace BL, Babayan SA, Ivens A, Pfarr KM, Blaxter M, et al. Extracellular Onchocerca 25623184 10.1186/s13071-015-0656-1 PMC4316651 54. Zeringer E Barta T Li M Vlassov AV Strategies for isolation of exosomes Cold Spring Harb Protoc 2015 2015 319 323 10.1101/pdb.top074476 25834266 Zeringer E, Barta T, Li M, Vlassov AV. Strategies for isolation of exosomes. Cold Spring Harb Protoc. 2015;2015:319–23. 25834266 10.1101/pdb.top074476 55. Batrakova EV Kim MS Using exosomes, naturally-equipped nanocarriers, for drug delivery J Control Release 2015 219 396 405 10.1016/j.jconrel.2015.07.030 26241750 PMC4656109 Batrakova EV, Kim MS. Using exosomes, naturally-equipped nanocarriers, for drug delivery. J Control Release. 2015;219:396–405. 26241750 10.1016/j.jconrel.2015.07.030 PMC4656109 56. Doyle LM Wang MZ Overview of extracellular vesicles, their origin, composition, purpose, and methods for exosome isolation and analysis Cells 2019 8 727 10.3390/cells8070727 31311206 PMC6678302 Doyle LM, Wang MZ. Overview of extracellular vesicles, their origin, composition, purpose, and methods for exosome isolation and analysis. Cells. 2019;8:727. 31311206 10.3390/cells8070727 PMC6678302 57. Heinemann ML Ilmer M Silva LP Hawke DH Recio A Vorontsova MA Alt E Vykoukal J Benchtop isolation and characterization of functional exosomes by sequential filtration J Chromatogr A 2014 1371 125 135 10.1016/j.chroma.2014.10.026 25458527 Heinemann ML, Ilmer M, Silva LP, Hawke DH, Recio A, Vorontsova MA, et al. Benchtop isolation and characterization of functional exosomes by sequential filtration. J Chromatogr A. 2014;1371:125–35. 25458527 10.1016/j.chroma.2014.10.026 58. Pisano S Pierini I Gu J Gazze A Francis LW Gonzalez D Conlan RS Corradetti B Immune (Cell) derived exosome mimetics (IDEM) as a treatment for ovarian cancer Front Cell Dev Biol 2020 8 553576 10.3389/fcell.2020.553576 33042993 PMC7528637 Pisano S, Pierini I, Gu J, Gazze A, Francis LW, Gonzalez D, et al. Immune (Cell) derived exosome mimetics (IDEM) as a treatment for ovarian cancer. Front Cell Dev Biol. 2020;8:553576. 33042993 10.3389/fcell.2020.553576 PMC7528637 59. Stranska R Gysbrechts L Wouters J Vermeersch P Bloch K Dierickx D Andrei G Snoeck R Comparison of membrane affinity-based method with size-exclusion chromatography for isolation of exosome-like vesicles from human plasma J Transl Med 2018 16 1 10.1186/s12967-017-1374-6 29316942 PMC5761138 Stranska R, Gysbrechts L, Wouters J, Vermeersch P, Bloch K, Dierickx D, et al. Comparison of membrane affinity-based method with size-exclusion chromatography for isolation of exosome-like vesicles from human plasma. J Transl Med. 2018;16:1. 29316942 10.1186/s12967-017-1374-6 PMC5761138 60. Kang D Oh S Ahn SM Lee BH Moon MH Proteomic analysis of exosomes from human neural stem cells by flow field-flow fractionation and nanoflow liquid chromatography-tandem mass spectrometry J Proteome Res 2008 7 3475 3480 10.1021/pr800225z 18570454 Kang D, Oh S, Ahn SM, Lee BH, Moon MH. Proteomic analysis of exosomes from human neural stem cells by flow field-flow fractionation and nanoflow liquid chromatography-tandem mass spectrometry. J Proteome Res. 2008;7:3475–80. 18570454 10.1021/pr800225z 61. Yang D Zhang W Zhang H Zhang F Chen L Ma L Larcher LM Chen S Liu N Zhao Q Progress, opportunity, and perspective on exosome isolation - efforts for efficient exosome-based theranostics Theranostics 2020 10 3684 3707 10.7150/thno.41580 32206116 PMC7069071 Yang D, Zhang W, Zhang H, Zhang F, Chen L, Ma L, et al. Progress, opportunity, and perspective on exosome isolation - efforts for efficient exosome-based theranostics. Theranostics. 2020;10:3684–707. 32206116 10.7150/thno.41580 PMC7069071 62. Ruivo CF Adem B Silva M Melo SA The biology of cancer exosomes: insights and new perspectives Cancer Res 2017 77 6480 6488 10.1158/0008-5472.CAN-17-0994 29162616 Ruivo CF, Adem B, Silva M, Melo SA. The biology of cancer exosomes: insights and new perspectives. Cancer Res. 2017;77:6480–8. 29162616 10.1158/0008-5472.CAN-17-0994 63. Lee J Kim H Heo Y Yoo YK Han SI Kim C Hur D Kim H Kang JY Lee JH Enhanced paper-based ELISA for simultaneous EVs/exosome isolation and detection using streptavidin agarose-based immobilization Analyst 2019 145 157 164 10.1039/C9AN01140D 31723951 Lee J, Kim H, Heo Y, Yoo YK, Han SI, Kim C, et al. Enhanced paper-based ELISA for simultaneous EVs/exosome isolation and detection using streptavidin agarose-based immobilization. Analyst. 2019;145:157–64. 31723951 10.1039/c9an01140d 64. Hong CS Muller L Boyiadzis M Whiteside TL Isolation and characterization of CD34+ blast-derived exosomes in acute myeloid leukemia PLoS ONE 2014 9 e103310 10.1371/journal.pone.0103310 25093329 PMC4122364 Hong CS, Muller L, Boyiadzis M, Whiteside TL. Isolation and characterization of CD34+ blast-derived exosomes in acute myeloid leukemia. PLoS ONE. 2014;9:e103310. 25093329 10.1371/journal.pone.0103310 PMC4122364 65. Liu C Xu X Li B Situ B Pan W Hu Y An T Yao S Zheng L Single-exosome-counting immunoassays for cancer diagnostics Nano Lett 2018 18 4226 4232 10.1021/acs.nanolett.8b01184 29888919 Liu C, Xu X, Li B, Situ B, Pan W, Hu Y, et al. Single-exosome-counting immunoassays for cancer diagnostics. Nano Lett. 2018;18:4226–32. 29888919 10.1021/acs.nanolett.8b01184 66. Konoshenko MY Lekchnov EA Vlassov AV Laktionov PP Isolation of Extracellular Vesicles: General Methodologies and Latest Trends Biomed Res Int 2018 2018 8545347 10.1155/2018/8545347 29662902 PMC5831698 Konoshenko MY, Lekchnov EA, Vlassov AV, Laktionov PP. Isolation of Extracellular Vesicles: General Methodologies and Latest Trends. Biomed Res Int. 2018;2018:8545347. 29662902 10.1155/2018/8545347 PMC5831698 67. Samsonov R Shtam T Burdakov V Glotov A Tsyrlina E Berstein L Nosov A Evtushenko V Filatov M Malek A Lectin-induced agglutination method of urinary exosomes isolation followed by mi-RNA analysis: Application for prostate cancer diagnostic Prostate 2016 76 68 79 10.1002/pros.23101 26417675 Samsonov R, Shtam T, Burdakov V, Glotov A, Tsyrlina E, Berstein L, et al. Lectin-induced agglutination method of urinary exosomes isolation followed by mi-RNA analysis: Application for prostate cancer diagnostic. Prostate. 2016;76:68–79. 26417675 10.1002/pros.23101 68. McDonald JC Duffy DC Anderson JR Chiu DT Wu H Schueller OJ Whitesides GM Fabrication of microfluidic systems in poly(dimethylsiloxane) Electrophoresis 2000 21 27 40 10.1002/(SICI)1522-2683(20000101)21:1&#x0003c;27::AID-ELPS27&#x0003e;3.0.CO;2-C 10634468 McDonald JC, Duffy DC, Anderson JR, Chiu DT, Wu H, Schueller OJ, et al. Fabrication of microfluidic systems in poly(dimethylsiloxane). Electrophoresis. 2000;21:27–40. 10634468 10.1002/(SICI)1522-2683(20000101)21:1<27::AID-ELPS27>3.0.CO;2-C 69. Kim H Min KI Inoue K Im do J, Kim DP, Yoshida J: Submillisecond organic synthesis: Outpacing Fries rearrangement through microfluidic rapid mixing Science 2016 352 691 694 10.1126/science.aaf1389 27151864 Kim H, Min KI, Inoue K. Im do J, Kim DP, Yoshida J: Submillisecond organic synthesis: Outpacing Fries rearrangement through microfluidic rapid mixing. Science. 2016;352:691–4. 27151864 10.1126/science.aaf1389 70. Li P Stratton ZS Dao M Ritz J Huang TJ Probing circulating tumor cells in microfluidics Lab Chip 2013 13 602 609 10.1039/c2lc90148j 23306378 PMC3990734 Li P, Stratton ZS, Dao M, Ritz J, Huang TJ. Probing circulating tumor cells in microfluidics. Lab Chip. 2013;13:602–9. 23306378 10.1039/c2lc90148j PMC3990734 71. Neethirajan S Kobayashi I Nakajima M Wu D Nandagopal S Lin F Microfluidics for food, agriculture and biosystems industries Lab Chip 2011 11 1574 1586 10.1039/c0lc00230e 21431239 Neethirajan S, Kobayashi I, Nakajima M, Wu D, Nandagopal S, Lin F. Microfluidics for food, agriculture and biosystems industries. Lab Chip. 2011;11:1574–86. 21431239 10.1039/c0lc00230e 72. Lin S Yu Z Chen D Wang Z Miao J Li Q Zhang D Song J Cui D Progress in microfluidics-based exosome separation and detection technologies for diagnostic applications Small 2020 16 e1903916 10.1002/smll.201903916 31663295 Lin S, Yu Z, Chen D, Wang Z, Miao J, Li Q, et al. Progress in microfluidics-based exosome separation and detection technologies for diagnostic applications. Small. 2020;16:e1903916. 31663295 10.1002/smll.201903916 73. Chen C Skog J Hsu CH Lessard RT Balaj L Wurdinger T Carter BS Breakefield XO Toner M Irimia D Microfluidic isolation and transcriptome analysis of serum microvesicles Lab Chip 2010 10 505 511 10.1039/B916199F 20126692 PMC3136803 Chen C, Skog J, Hsu CH, Lessard RT, Balaj L, Wurdinger T, et al. Microfluidic isolation and transcriptome analysis of serum microvesicles. Lab Chip. 2010;10:505–11. 20126692 10.1039/b916199f PMC3136803 74. Davies RT Kim J Jang SC Choi EJ Gho YS Park J Microfluidic filtration system to isolate extracellular vesicles from blood Lab Chip 2012 12 5202 5210 10.1039/c2lc41006k 23111789 Davies RT, Kim J, Jang SC, Choi EJ, Gho YS, Park J. Microfluidic filtration system to isolate extracellular vesicles from blood. Lab Chip. 2012;12:5202–10. 23111789 10.1039/c2lc41006k 75. Zhao Z Yang Y Zeng Y He M A microfluidic exosearch chip for multiplexed exosome detection towards blood-based ovarian cancer diagnosis Lab Chip 2016 16 489 496 10.1039/C5LC01117E 26645590 PMC4729647 Zhao Z, Yang Y, Zeng Y, He M. A microfluidic exosearch chip for multiplexed exosome detection towards blood-based ovarian cancer diagnosis. Lab Chip. 2016;16:489–96. 26645590 10.1039/c5lc01117e PMC4729647 76. Ramasubramanian L Kumar P Wang A Engineering Extracellular Vesicles as Nanotherapeutics for Regenerative Medicine Biomolecules 2019 10 1 48 10.3390/biom10010048 31905611 PMC7023093 Ramasubramanian L, Kumar P, Wang A. Engineering Extracellular Vesicles as Nanotherapeutics for Regenerative Medicine. Biomolecules. 2019;10(1):48. 31905611 10.3390/biom10010048 PMC7023093 77. Armstrong JP Holme MN Stevens MM Re-engineering extracellular vesicles as smart nanoscale therapeutics ACS Nano 2017 11 69 83 10.1021/acsnano.6b07607 28068069 PMC5604727 Armstrong JP, Holme MN, Stevens MM. Re-engineering extracellular vesicles as smart nanoscale therapeutics. ACS Nano. 2017;11:69–83. 28068069 10.1021/acsnano.6b07607 PMC5604727 78. Momen-Heravi F Bala S Bukong T Szabo G Exosome-mediated delivery of functionally active miRNA-155 inhibitor to macrophages Nanomedicine 2014 10 1517 1527 10.1016/j.nano.2014.03.014 24685946 PMC4180003 Momen-Heravi F, Bala S, Bukong T, Szabo G. Exosome-mediated delivery of functionally active miRNA-155 inhibitor to macrophages. Nanomedicine. 2014;10:1517–27. 24685946 10.1016/j.nano.2014.03.014 PMC4180003 79. Xiao J Pan Y Li XH Yang XY Feng YL Tan HH Jiang L Feng J Yu XY Cardiac progenitor cell-derived exosomes prevent cardiomyocytes apoptosis through exosomal miR-21 by targeting PDCD4 Cell Death Dis 2016 7 e2277 10.1038/cddis.2016.181 27336721 PMC5143405 Xiao J, Pan Y, Li XH, Yang XY, Feng YL, Tan HH, et al. Cardiac progenitor cell-derived exosomes prevent cardiomyocytes apoptosis through exosomal miR-21 by targeting PDCD4. Cell Death Dis. 2016;7:e2277. 27336721 10.1038/cddis.2016.181 PMC5143405 80. Alvarez-Erviti L Seow Y Yin H Betts C Lakhal S Wood MJ Delivery of siRNA to the mouse brain by systemic injection of targeted exosomes Nat Biotechnol 2011 29 341 345 10.1038/nbt.1807 21423189 Alvarez-Erviti L, Seow Y, Yin H, Betts C, Lakhal S, Wood MJ. Delivery of siRNA to the mouse brain by systemic injection of targeted exosomes. Nat Biotechnol. 2011;29:341–5. 21423189 10.1038/nbt.1807 81. Wang H Wang B Zhang A Hassounah F Seow Y Wood M Ma F Klein JD Price SR Wang XH Exosome-mediated miR-29 transfer reduces muscle atrophy and kidney fibrosis in mice Mol Ther 2019 27 571 583 10.1016/j.ymthe.2019.01.008 30711446 PMC6403486 Wang H, Wang B, Zhang A, Hassounah F, Seow Y, Wood M, et al. Exosome-mediated miR-29 transfer reduces muscle atrophy and kidney fibrosis in mice. Mol Ther. 2019;27:571–83. 30711446 10.1016/j.ymthe.2019.01.008 PMC6403486 82. Vella LJ Behren A Coleman B Greening DW Hill AF Cebon J Intercellular resistance to BRAF inhibition can be mediated by extracellular vesicle-associated PDGFRβ Neoplasia 2017 19 932 940 10.1016/j.neo.2017.07.002 28963969 PMC5678363 Vella LJ, Behren A, Coleman B, Greening DW, Hill AF, Cebon J. Intercellular resistance to BRAF inhibition can be mediated by extracellular vesicle-associated PDGFRβ. Neoplasia. 2017;19:932–40. 28963969 10.1016/j.neo.2017.07.002 PMC5678363 83. Yuan Z Kolluri KK Gowers KH Janes SM Trail delivery by MSC-derived extracellular vesicles is an effective anticancer therapy J Extracell Vesicles 2017 6 1265291 10.1080/20013078.2017.1265291 28326166 PMC5328331 Yuan Z, Kolluri KK, Gowers KH, Janes SM. Trail delivery by MSC-derived extracellular vesicles is an effective anticancer therapy. J Extracell Vesicles. 2017;6:1265291. 28326166 10.1080/20013078.2017.1265291 PMC5328331 84. Wang M Altinoglu S Takeda YS Xu Q Integrating protein engineering and bioorthogonal click conjugation for extracellular vesicle modulation and intracellular delivery PLoS ONE 2015 10 e0141860 10.1371/journal.pone.0141860 26529317 PMC4631329 Wang M, Altinoglu S, Takeda YS, Xu Q. Integrating protein engineering and bioorthogonal click conjugation for extracellular vesicle modulation and intracellular delivery. PLoS ONE. 2015;10:e0141860. 26529317 10.1371/journal.pone.0141860 PMC4631329 85. Rayamajhi S Aryal S Surface functionalization strategies of extracellular vesicles J Mater Chem B 2020 8 4552 4569 10.1039/D0TB00744G 32377649 Rayamajhi S, Aryal S. Surface functionalization strategies of extracellular vesicles. J Mater Chem B. 2020;8:4552–69. 32377649 10.1039/d0tb00744g 86. Piffoux M Silva AKA Wilhelm C Gazeau F Tareste D Modification of extracellular vesicles by fusion with liposomes for the design of personalized biogenic drug delivery systems ACS Nano 2018 12 6830 6842 10.1021/acsnano.8b02053 29975503 Piffoux M, Silva AKA, Wilhelm C, Gazeau F, Tareste D. Modification of extracellular vesicles by fusion with liposomes for the design of personalized biogenic drug delivery systems. ACS Nano. 2018;12:6830–42. 29975503 10.1021/acsnano.8b02053 87. Sato YT Umezaki K Sawada S Mukai SA Sasaki Y Harada N Shiku H Akiyoshi K Engineering hybrid exosomes by membrane fusion with liposomes Sci Rep 2016 6 21933 10.1038/srep21933 26911358 PMC4766490 Sato YT, Umezaki K, Sawada S, Mukai SA, Sasaki Y, Harada N, et al. Engineering hybrid exosomes by membrane fusion with liposomes. Sci Rep. 2016;6:21933. 26911358 10.1038/srep21933 PMC4766490 88. Cao E Chen Y Cui Z Foster PR Effect of freezing and thawing rates on denaturation of proteins in aqueous solutions Biotechnol Bioeng 2003 82 684 690 10.1002/bit.10612 12673768 Cao E, Chen Y, Cui Z, Foster PR. Effect of freezing and thawing rates on denaturation of proteins in aqueous solutions. Biotechnol Bioeng. 2003;82:684–90. 12673768 10.1002/bit.10612 89. Fan J Lee CS Kim S Chen C Aghaloo T Lee M Generation of small RNA-modulated exosome mimetics for bone regeneration ACS Nano 2020 14 11973 11984 10.1021/acsnano.0c05122 32897692 PMC7530137 Fan J, Lee CS, Kim S, Chen C, Aghaloo T, Lee M. Generation of small RNA-modulated exosome mimetics for bone regeneration. ACS Nano. 2020;14:11973–84. 32897692 10.1021/acsnano.0c05122 PMC7530137 90. Tamura R Uemoto S Tabata Y Augmented liver targeting of exosomes by surface modification with cationized pullulan Acta Biomater 2017 57 274 284 10.1016/j.actbio.2017.05.013 28483695 Tamura R, Uemoto S, Tabata Y. Augmented liver targeting of exosomes by surface modification with cationized pullulan. Acta Biomater. 2017;57:274–84. 28483695 10.1016/j.actbio.2017.05.013 91. Gao X Ran N Dong X Zuo B Yang R Zhou Q Moulton HM Seow Y Yin H Anchor peptide captures, targets, and loads exosomes of diverse origins for diagnostics and therapy Sci Transl Med 2018 10.1126/scitranslmed.aat0195 29875202 Gao X, Ran N, Dong X, Zuo B, Yang R, Zhou Q, et al. Anchor peptide captures, targets, and loads exosomes of diverse origins for diagnostics and therapy. Sci Transl Med. 2018. 10.1126/scitranslmed.aat0195. 29875202 10.1126/scitranslmed.aat0195 92. Angeli A Supuran CT Click chemistry approaches for developing carbonic anhydrase inhibitors and their applications J Enzyme Inhib Med Chem 2023 38 2166503 10.1080/14756366.2023.2166503 36637011 PMC9848362 Angeli A, Supuran CT. Click chemistry approaches for developing carbonic anhydrase inhibitors and their applications. J Enzyme Inhib Med Chem. 2023;38:2166503. 36637011 10.1080/14756366.2023.2166503 PMC9848362 93. Di H Zeng E Zhang P Liu X Zhang C Yang J Liu D General approach to engineering extracellular vesicles for biomedical analysis Anal Chem 2019 91 12752 12759 10.1021/acs.analchem.9b02268 31529961 Di H, Zeng E, Zhang P, Liu X, Zhang C, Yang J, et al. General approach to engineering extracellular vesicles for biomedical analysis. Anal Chem. 2019;91:12752–9. 31529961 10.1021/acs.analchem.9b02268 94. Smyth T Petrova K Payton NM Persaud I Redzic JS Graner MW Smith-Jones P Anchordoquy TJ Surface functionalization of exosomes using click chemistry Bioconjug Chem 2014 25 1777 1784 10.1021/bc500291r 25220352 PMC4198107 Smyth T, Petrova K, Payton NM, Persaud I, Redzic JS, Graner MW, et al. Surface functionalization of exosomes using click chemistry. Bioconjug Chem. 2014;25:1777–84. 25220352 10.1021/bc500291r PMC4198107 95. Cully M Exosome-based candidates move into the clinic Nat Rev Drug Discov 2021 20 6 7 10.1038/d41573-020-00220-y 33311580 Cully M. Exosome-based candidates move into the clinic. Nat Rev Drug Discov. 2021;20:6–7. 33311580 10.1038/d41573-020-00220-y 96. Cheng Q Shi X Han M Smbatyan G Lenz HJ Zhang Y Reprogramming exosomes as nanoscale controllers of cellular immunity J Am Chem Soc 2018 140 16413 16417 10.1021/jacs.8b10047 30452238 PMC6469991 Cheng Q, Shi X, Han M, Smbatyan G, Lenz HJ, Zhang Y. Reprogramming exosomes as nanoscale controllers of cellular immunity. J Am Chem Soc. 2018;140:16413–7. 30452238 10.1021/jacs.8b10047 PMC6469991 97. Rao L Xia S Xu W Tian R Yu G Gu C Pan P Meng QF Cai X Qu D Decoy nanoparticles protect against COVID-19 by concurrently adsorbing viruses and inflammatory cytokines Proc Natl Acad Sci USA 2020 117 27141 27147 10.1073/pnas.2014352117 33024017 PMC7959535 Rao L, Xia S, Xu W, Tian R, Yu G, Gu C, et al. Decoy nanoparticles protect against COVID-19 by concurrently adsorbing viruses and inflammatory cytokines. Proc Natl Acad Sci USA. 2020;117:27141–7. 33024017 10.1073/pnas.2014352117 PMC7959535 98. Cai M Tian F Han J Wang L Hu S Dong P Qiao W Zhang H Wang Y Chen H Genetically engineered extracellular vesicles expressing decoy protein TACI provide a therapeutic effect in systemic lupus erythematosus mouse model J Control Release 2025 384 113886 10.1016/j.jconrel.2025.113886 40425096 Cai M, Tian F, Han J, Wang L, Hu S, Dong P, et al. Genetically engineered extracellular vesicles expressing decoy protein TACI provide a therapeutic effect in systemic lupus erythematosus mouse model. J Control Release. 2025;384:113886. 40425096 10.1016/j.jconrel.2025.113886 99. Jiang L Vader P Schiffelers RM Extracellular vesicles for nucleic acid delivery: progress and prospects for safe RNA-based gene therapy Gene Ther 2017 24 157 166 10.1038/gt.2017.8 28140387 Jiang L, Vader P, Schiffelers RM. Extracellular vesicles for nucleic acid delivery: progress and prospects for safe RNA-based gene therapy. Gene Ther. 2017;24:157–66. 28140387 10.1038/gt.2017.8 100. Dowdy SF Overcoming cellular barriers for RNA therapeutics Nat Biotechnol 2017 35 222 229 10.1038/nbt.3802 28244992 Dowdy SF. Overcoming cellular barriers for RNA therapeutics. Nat Biotechnol. 2017;35:222–9. 28244992 10.1038/nbt.3802 101. Kulkarni JA Cullis PR van der Meel R Lipid nanoparticles enabling gene therapies: from concepts to clinical utility Nucleic Acid Ther 2018 28 146 157 10.1089/nat.2018.0721 29683383 Kulkarni JA, Cullis PR, van der Meel R. Lipid nanoparticles enabling gene therapies: from concepts to clinical utility. Nucleic Acid Ther. 2018;28:146–57. 29683383 10.1089/nat.2018.0721 102. Wadman M Public needs to prep for vaccine side effects Science 2020 370 1022 10.1126/science.370.6520.1022 33243869 Wadman M. Public needs to prep for vaccine side effects. Science. 2020;370:1022. 33243869 10.1126/science.370.6520.1022 103. György B Sage C Indzhykulian AA Scheffer DI Brisson AR Tan S Wu X Volak A Mu D Tamvakologos PI Rescue of hearing by gene delivery to inner-ear hair cells using exosome-associated AAV Mol Ther 2017 25 379 391 10.1016/j.ymthe.2016.12.010 28082074 PMC5368844 György B, Sage C, Indzhykulian AA, Scheffer DI, Brisson AR, Tan S, et al. Rescue of hearing by gene delivery to inner-ear hair cells using exosome-associated AAV. Mol Ther. 2017;25:379–91. 28082074 10.1016/j.ymthe.2016.12.010 PMC5368844 104. Wassmer SJ Carvalho LS György B Vandenberghe LH Maguire CA Exosome-associated AAV2 vector mediates robust gene delivery into the murine retina upon intravitreal injection Sci Rep 2017 7 45329 10.1038/srep45329 28361998 PMC5374486 Wassmer SJ, Carvalho LS, György B, Vandenberghe LH, Maguire CA. Exosome-associated AAV2 vector mediates robust gene delivery into the murine retina upon intravitreal injection. Sci Rep. 2017;7:45329. 28361998 10.1038/srep45329 PMC5374486 105. Chen R Huang H Liu H Xi J Ning J Zeng W Shen C Zhang T Yu G Xu Q Friend or Foe? Evidence Indicates Endogenous Exosomes Can Deliver Functional gRNA and Cas9 Protein Small 2019 15 e1902686 10.1002/smll.201902686 31271518 Chen R, Huang H, Liu H, Xi J, Ning J, Zeng W, et al. Friend or Foe? Evidence Indicates Endogenous Exosomes Can Deliver Functional gRNA and Cas9 Protein. Small. 2019;15:e1902686. 31271518 10.1002/smll.201902686 106. Haney MJ Zhao Y Jin YS Li SM Bago JR Klyachko NL Kabanov AV Batrakova EV Macrophage-derived extracellular vesicles as drug delivery systems for triple negative breast cancer (TNBC) therapy J Neuroimmune Pharmacol 2020 15 487 500 10.1007/s11481-019-09884-9 31722094 Haney MJ, Zhao Y, Jin YS, Li SM, Bago JR, Klyachko NL, et al. Macrophage-derived extracellular vesicles as drug delivery systems for triple negative breast cancer (TNBC) therapy. J Neuroimmune Pharmacol. 2020;15:487–500. 31722094 10.1007/s11481-019-09884-9 107. Zhang G Huang X Xiu H Sun Y Chen J Cheng G Song Z Peng Y Shen Y Wang J Cai Z Extracellular vesicles: natural liver-accumulating drug delivery vehicles for the treatment of liver diseases J Extracell Vesicles 2020 10 e12030 10.1002/jev2.12030 33335695 PMC7726052 Zhang G, Huang X, Xiu H, Sun Y, Chen J, Cheng G, et al. Extracellular vesicles: natural liver-accumulating drug delivery vehicles for the treatment of liver diseases. J Extracell Vesicles. 2020;10:e12030. 33335695 10.1002/jev2.12030 PMC7726052 108. Walker S Busatto S Pham A Tian M Suh A Carson K Quintero A Lafrence M Malik H Santana MX Wolfram J Extracellular vesicle-based drug delivery systems for cancer treatment Theranostics 2019 9 8001 8017 10.7150/thno.37097 31754377 PMC6857056 Walker S, Busatto S, Pham A, Tian M, Suh A, Carson K, et al. Extracellular vesicle-based drug delivery systems for cancer treatment. Theranostics. 2019;9:8001–17. 31754377 10.7150/thno.37097 PMC6857056 109. Tian T Zhang HX He CP Fan S Zhu YL Qi C Huang NP Xiao ZD Lu ZH Tannous BA Gao J Surface functionalized exosomes as targeted drug delivery vehicles for cerebral ischemia therapy Biomaterials 2018 150 137 149 10.1016/j.biomaterials.2017.10.012 29040874 Tian T, Zhang HX, He CP, Fan S, Zhu YL, Qi C, et al. Surface functionalized exosomes as targeted drug delivery vehicles for cerebral ischemia therapy. Biomaterials. 2018;150:137–49. 29040874 10.1016/j.biomaterials.2017.10.012 110. Xu W Wang K Wang K Zhao Y Yang Z Li X Key magnetized exosomes for effective targeted delivery of Doxorubicin against Breast Cancer Cell Types in Mice model Int J Nanomedicine 2024 19 10711 10724 10.2147/IJN.S479306 39464677 PMC11512768 Xu W, Wang K, Wang K, Zhao Y, Yang Z, Li X. Key magnetized exosomes for effective targeted delivery of Doxorubicin against Breast Cancer Cell Types in Mice model. Int J Nanomedicine. 2024;19:10711–24. 39464677 10.2147/IJN.S479306 PMC11512768 111. Antonucci F Turola E Riganti L Caleo M Gabrielli M Perrotta C Novellino L Clementi E Giussani P Viani P Microvesicles released from microglia stimulate synaptic activity via enhanced sphingolipid metabolism EMBO J 2012 31 1231 1240 10.1038/emboj.2011.489 22246184 PMC3297996 Antonucci F, Turola E, Riganti L, Caleo M, Gabrielli M, Perrotta C, et al. Microvesicles released from microglia stimulate synaptic activity via enhanced sphingolipid metabolism. EMBO J. 2012;31:1231–40. 22246184 10.1038/emboj.2011.489 PMC3297996 112. Rajendran L Honsho M Zahn TR Keller P Geiger KD Verkade P Simons K Alzheimer’s disease beta-amyloid peptides are released in association with exosomes Proc Natl Acad Sci U S A 2006 103 11172 11177 10.1073/pnas.0603838103 16837572 PMC1544060 Rajendran L, Honsho M, Zahn TR, Keller P, Geiger KD, Verkade P, et al. Alzheimer’s disease beta-amyloid peptides are released in association with exosomes. Proc Natl Acad Sci U S A. 2006;103:11172–7. 16837572 10.1073/pnas.0603838103 PMC1544060 113. Xu B Zhang Y Du XF Li J Zi HX Bu JW Yan Y Han H Du JL Neurons secrete miR-132-containing exosomes to regulate brain vascular integrity Cell Res 2017 27 882 897 10.1038/cr.2017.62 28429770 PMC5518987 Xu B, Zhang Y, Du XF, Li J, Zi HX, Bu JW, et al. Neurons secrete miR-132-containing exosomes to regulate brain vascular integrity. Cell Res. 2017;27:882–97. 28429770 10.1038/cr.2017.62 PMC5518987 114. Webb RL Kaiser EE Jurgielewicz BJ Spellicy S Scoville SL Thompson TA Swetenburg RL Hess DC West FD Stice SL Human neural stem cell extracellular vesicles improve recovery in a porcine model of ischemic stroke Stroke 2018 49 1248 1256 10.1161/STROKEAHA.117.020353 29650593 PMC5916046 Webb RL, Kaiser EE, Jurgielewicz BJ, Spellicy S, Scoville SL, Thompson TA, et al. Human neural stem cell extracellular vesicles improve recovery in a porcine model of ischemic stroke. Stroke. 2018;49:1248–56. 29650593 10.1161/STROKEAHA.117.020353 PMC5916046 115. Xin H Li Y Cui Y Yang JJ Zhang ZG Chopp M Systemic administration of exosomes released from mesenchymal stromal cells promote functional recovery and neurovascular plasticity after stroke in rats J Cereb Blood Flow Metab 2013 33 1711 1715 10.1038/jcbfm.2013.152 23963371 PMC3824189 Xin H, Li Y, Cui Y, Yang JJ, Zhang ZG, Chopp M. Systemic administration of exosomes released from mesenchymal stromal cells promote functional recovery and neurovascular plasticity after stroke in rats. J Cereb Blood Flow Metab. 2013;33:1711–5. 23963371 10.1038/jcbfm.2013.152 PMC3824189 116. Saint-Pol J Gosselet F Duban-Deweer S Pottiez G Karamanos Y Targeting and Crossing the Blood-Brain Barrier with Extracellular Vesicles Cells 2020 9 4 851 10.3390/cells9040851 32244730 PMC7226770 Saint-Pol J, Gosselet F, Duban-Deweer S, Pottiez G, Karamanos Y. Targeting and Crossing the Blood-Brain Barrier with Extracellular Vesicles. Cells. 2020;9(4):851. 32244730 10.3390/cells9040851 PMC7226770 117. Wang Y Zhang F Xiong N Xu H Chai S Wang H Wang J Zhao H Jiang X Fu P Xiang W Remodelling and treatment of the blood-brain barrier in glioma Cancer Manag Res 2021 13 4217 4232 10.2147/CMAR.S288720 34079374 PMC8166259 Wang Y, Zhang F, Xiong N, Xu H, Chai S, Wang H, et al. Remodelling and treatment of the blood-brain barrier in glioma. Cancer Manag Res. 2021;13:4217–32. 34079374 10.2147/CMAR.S288720 PMC8166259 118. Morad G Carman CV Hagedorn EJ Perlin JR Zon LI Mustafaoglu N Park TE Ingber DE Daisy CC Moses MA Tumor-derived extracellular vesicles breach the intact Blood-Brain Barrier via transcytosis ACS Nano 2019 13 13853 13865 10.1021/acsnano.9b04397 31479239 PMC7169949 Morad G, Carman CV, Hagedorn EJ, Perlin JR, Zon LI, Mustafaoglu N, et al. Tumor-derived extracellular vesicles breach the intact Blood-Brain Barrier via transcytosis. ACS Nano. 2019;13:13853–65. 31479239 10.1021/acsnano.9b04397 PMC7169949 119. Altei WF Pachane BC Dos Santos PK Ribeiro LNM Sung BH Weaver AM Selistre-de-Araújo HS Inhibition of αvβ3 integrin impairs adhesion and uptake of tumor-derived small extracellular vesicles Cell Commun Signal 2020 18 158 10.1186/s12964-020-00630-w 32988382 PMC7520983 Altei WF, Pachane BC, Dos Santos PK, Ribeiro LNM, Sung BH, Weaver AM, et al. Inhibition of αvβ3 integrin impairs adhesion and uptake of tumor-derived small extracellular vesicles. Cell Commun Signal. 2020;18:158. 32988382 10.1186/s12964-020-00630-w PMC7520983 120. Lou HY Yan HP Yang LG Fan JH Cho WC Xiao ZH Li SJ Integrin α4β1/VCAM-1 interaction evokes dynamic cell aggregation between immune cells and human lung microvascular endothelial cells at infectious hemolysis Front Pharmacol 2021 12 653143 10.3389/fphar.2021.653143 33959020 PMC8093802 Lou HY, Yan HP, Yang LG, Fan JH, Cho WC, Xiao ZH, et al. Integrin α4β1/VCAM-1 interaction evokes dynamic cell aggregation between immune cells and human lung microvascular endothelial cells at infectious hemolysis. Front Pharmacol. 2021;12:653143. 33959020 10.3389/fphar.2021.653143 PMC8093802 121. Ramos-Zaldívar HM Polakovicova I Salas-Huenuleo E Corvalán AH Kogan MJ Yefi CP Andia ME Extracellular vesicles through the blood-brain barrier: a review Fluids Barriers CNS 2022 19 60 10.1186/s12987-022-00359-3 35879759 PMC9310691 Ramos-Zaldívar HM, Polakovicova I, Salas-Huenuleo E, Corvalán AH, Kogan MJ, Yefi CP, et al. Extracellular vesicles through the blood-brain barrier: a review. Fluids Barriers CNS. 2022;19:60. 35879759 10.1186/s12987-022-00359-3 PMC9310691 122. Ni K Wang C Carnino JM Jin Y The evolving role of Caveolin-1: a critical regulator of extracellular vesicles Med Sci 2020 10.3390/medsci8040046 PMC7712126 33158117 Ni K, Wang C, Carnino JM, Jin Y. The evolving role of Caveolin-1: a critical regulator of extracellular vesicles. Med Sci. 2020. 10.3390/medsci8040046. 10.3390/medsci8040046 PMC7712126 33158117 123. Gabrielli M Prada I Joshi P Falcicchia C D’Arrigo G Rutigliano G Battocchio E Zenatelli R Tozzi F Radeghieri A Microglial large extracellular vesicles propagate early synaptic dysfunction in Alzheimer’s disease Brain 2022 145 2849 2868 10.1093/brain/awac083 35254410 PMC9420022 Gabrielli M, Prada I, Joshi P, Falcicchia C, D’Arrigo G, Rutigliano G, et al. Microglial large extracellular vesicles propagate early synaptic dysfunction in Alzheimer’s disease. Brain. 2022;145:2849–68. 35254410 10.1093/brain/awac083 PMC9420022 124. Tian J Han Z Song D Peng Y Xiong M Chen Z Duan S Zhang L Engineered exosome for drug delivery: recent development and clinical applications Int J Nanomedicine 2023 18 7923 7940 10.2147/IJN.S444582 38152837 PMC10752020 Tian J, Han Z, Song D, Peng Y, Xiong M, Chen Z, et al. Engineered exosome for drug delivery: recent development and clinical applications. Int J Nanomedicine. 2023;18:7923–40. 38152837 10.2147/IJN.S444582 PMC10752020 125. Yin T Liu Y Ji W Zhuang J Chen X Gong B Chu J Liang W Gao J Yin Y Engineered mesenchymal stem cell-derived extracellular vesicles: a state-of-the-art multifunctional weapon against Alzheimer’s disease Theranostics 2023 13 1264 1285 10.7150/thno.81860 36923533 PMC10008732 Yin T, Liu Y, Ji W, Zhuang J, Chen X, Gong B, et al. Engineered mesenchymal stem cell-derived extracellular vesicles: a state-of-the-art multifunctional weapon against Alzheimer’s disease. Theranostics. 2023;13:1264–85. 36923533 10.7150/thno.81860 PMC10008732 126. Matsumoto J Stewart T Sheng L Li N Bullock K Song N Shi M Banks WA Zhang J Transmission of α-synuclein-containing erythrocyte-derived extracellular vesicles across the blood-brain barrier via adsorptive mediated transcytosis: another mechanism for initiation and progression of Parkinson’s disease? Acta Neuropathol Commun 2017 5 71 10.1186/s40478-017-0470-4 28903781 PMC5598000 Matsumoto J, Stewart T, Sheng L, Li N, Bullock K, Song N, et al. Transmission of α-synuclein-containing erythrocyte-derived extracellular vesicles across the blood-brain barrier via adsorptive mediated transcytosis: another mechanism for initiation and progression of Parkinson’s disease? Acta Neuropathol Commun. 2017;5:71. 28903781 10.1186/s40478-017-0470-4 PMC5598000 127. Dickens AM Tovar YRLB Yoo SW Trout AL Bae M Kanmogne M Megra B Williams DW Witwer KW Gacias M Astrocyte-shed extracellular vesicles regulate the peripheral leukocyte response to inflammatory brain lesions Sci Signal 2017 10 473 7696 10.1126/scisignal.aai7696 PMC5590230 28377412 Dickens AM, Tovar YRLB, Yoo SW, Trout AL, Bae M, Kanmogne M, et al. Astrocyte-shed extracellular vesicles regulate the peripheral leukocyte response to inflammatory brain lesions. Sci Signal. 2017;10(473):7696. 10.1126/scisignal.aai7696 PMC5590230 28377412 128. Ridder K Keller S Dams M Rupp AK Schlaudraff J Del Turco D Starmann J Macas J Karpova D Devraj K Extracellular vesicle-mediated transfer of genetic information between the hematopoietic system and the brain in response to inflammation PLoS Biol 2014 12 e1001874 10.1371/journal.pbio.1001874 24893313 PMC4043485 Ridder K, Keller S, Dams M, Rupp AK, Schlaudraff J, Del Turco D, et al. Extracellular vesicle-mediated transfer of genetic information between the hematopoietic system and the brain in response to inflammation. PLoS Biol. 2014;12:e1001874. 24893313 10.1371/journal.pbio.1001874 PMC4043485 129. Haqqani AS Delaney CE Tremblay TL Sodja C Sandhu JK Stanimirovic DB Method for isolation and molecular characterization of extracellular microvesicles released from brain endothelial cells Fluids Barriers CNS 2013 10 4 10.1186/2045-8118-10-4 23305214 PMC3560214 Haqqani AS, Delaney CE, Tremblay TL, Sodja C, Sandhu JK, Stanimirovic DB. Method for isolation and molecular characterization of extracellular microvesicles released from brain endothelial cells. Fluids Barriers CNS. 2013;10:4. 23305214 10.1186/2045-8118-10-4 PMC3560214 130. András IE Toborek M Extracellular vesicles of the blood-brain barrier Tissue Barriers 2016 4 e1131804 10.1080/21688370.2015.1131804 27141419 PMC4836554 András IE, Toborek M. Extracellular vesicles of the blood-brain barrier. Tissue Barriers. 2016;4:e1131804. 27141419 10.1080/21688370.2015.1131804 PMC4836554 131. Xin H Li Y Buller B Katakowski M Zhang Y Wang X Shang X Zhang ZG Chopp M Exosome-mediated transfer of miR-133b from multipotent mesenchymal stromal cells to neural cells contributes to neurite outgrowth Stem Cells 2012 30 1556 1564 10.1002/stem.1129 22605481 PMC3495063 Xin H, Li Y, Buller B, Katakowski M, Zhang Y, Wang X, et al. Exosome-mediated transfer of miR-133b from multipotent mesenchymal stromal cells to neural cells contributes to neurite outgrowth. Stem Cells. 2012;30:1556–64. 22605481 10.1002/stem.1129 PMC3495063 132. Zhang Y Chopp M Meng Y Katakowski M Xin H Mahmood A Xiong Y Effect of exosomes derived from multipluripotent mesenchymal stromal cells on functional recovery and neurovascular plasticity in rats after traumatic brain injury J Neurosurg 2015 122 856 867 10.3171/2014.11.JNS14770 25594326 PMC4382456 Zhang Y, Chopp M, Meng Y, Katakowski M, Xin H, Mahmood A, et al. Effect of exosomes derived from multipluripotent mesenchymal stromal cells on functional recovery and neurovascular plasticity in rats after traumatic brain injury. J Neurosurg. 2015;122:856–67. 25594326 10.3171/2014.11.JNS14770 PMC4382456 133. Hurn PD Subramanian S Parker SM Afentoulis ME Kaler LJ Vandenbark AA Offner H T- and B-cell-deficient mice with experimental stroke have reduced lesion size and inflammation J Cereb Blood Flow Metab 2007 27 1798 1805 10.1038/sj.jcbfm.9600482 17392692 PMC2592689 Hurn PD, Subramanian S, Parker SM, Afentoulis ME, Kaler LJ, Vandenbark AA, et al. T- and B-cell-deficient mice with experimental stroke have reduced lesion size and inflammation. J Cereb Blood Flow Metab. 2007;27:1798–805. 17392692 10.1038/sj.jcbfm.9600482 PMC2592689 134. Zheng X Zhang L Kuang Y Venkataramani V Jin F Hein K Zafeiriou MP Lenz C Moebius W Kilic E Extracellular vesicles derived from neural progenitor cells–a preclinical evaluation for stroke treatment in mice Transl Stroke Res 2021 12 185 203 10.1007/s12975-020-00814-z 32361827 PMC7803677 Zheng X, Zhang L, Kuang Y, Venkataramani V, Jin F, Hein K, et al. Extracellular vesicles derived from neural progenitor cells–a preclinical evaluation for stroke treatment in mice. Transl Stroke Res. 2021;12:185–203. 32361827 10.1007/s12975-020-00814-z PMC7803677 135. Webb RL Kaiser EE Scoville SL Thompson TA Fatima S Pandya C Sriram K Swetenburg RL Vaibhav K Arbab AS Human neural stem cell extracellular vesicles improve tissue and functional recovery in the murine thromboembolic stroke model Transl Stroke Res 2018 9 530 539 10.1007/s12975-017-0599-2 29285679 PMC6132936 Webb RL, Kaiser EE, Scoville SL, Thompson TA, Fatima S, Pandya C, et al. Human neural stem cell extracellular vesicles improve tissue and functional recovery in the murine thromboembolic stroke model. Transl Stroke Res. 2018;9:530–9. 29285679 10.1007/s12975-017-0599-2 PMC6132936 136. Hira K Ueno Y Tanaka R Miyamoto N Yamashiro K Inaba T Urabe T Okano H Hattori N Astrocyte-derived exosomes treated with a semaphorin 3A inhibitor enhance stroke recovery via prostaglandin D(2) synthase Stroke 2018 49 2483 2494 10.1161/STROKEAHA.118.021272 30355116 Hira K, Ueno Y, Tanaka R, Miyamoto N, Yamashiro K, Inaba T, et al. Astrocyte-derived exosomes treated with a semaphorin 3A inhibitor enhance stroke recovery via prostaglandin D(2) synthase. Stroke. 2018;49:2483–94. 30355116 10.1161/STROKEAHA.118.021272 137. Salehpour A Karimi Z Ghasemi Zadeh M Afshar M Kameli A Mooseli F Zare M Afshar A Therapeutic potential of mesenchymal stem cell-derived exosomes and miRNAs in neuronal regeneration and rejuvenation in neurological disorders: a mini review Front Cell Neurosci 2024 18 1427525 10.3389/fncel.2024.1427525 39429946 PMC11486650 Salehpour A, Karimi Z, Ghasemi Zadeh M, Afshar M, Kameli A, Mooseli F, et al. Therapeutic potential of mesenchymal stem cell-derived exosomes and miRNAs in neuronal regeneration and rejuvenation in neurological disorders: a mini review. Front Cell Neurosci. 2024;18:1427525. 39429946 10.3389/fncel.2024.1427525 PMC11486650 138. Gribnau A van Zuylen ML Coles JP Plummer MP Hermanns H Hermanides J Cerebral glucose metabolism following TBI: changes in plasma glucose, glucose transport and alternative pathways of glycolysis-a translational narrative review Int J Mol Sci 2024 10.3390/ijms25052513 38473761 PMC10931358 Gribnau A, van Zuylen ML, Coles JP, Plummer MP, Hermanns H, Hermanides J. Cerebral glucose metabolism following TBI: changes in plasma glucose, glucose transport and alternative pathways of glycolysis-a translational narrative review. Int J Mol Sci. 2024. 10.3390/ijms25052513. 38473761 10.3390/ijms25052513 PMC10931358 139. Xiong Y Mahmood A Chopp M Emerging potential of exosomes for treatment of traumatic brain injury Neural Regen Res 2017 12 19 22 10.4103/1673-5374.198966 28250732 PMC5319225 Xiong Y, Mahmood A, Chopp M. Emerging potential of exosomes for treatment of traumatic brain injury. Neural Regen Res. 2017;12:19–22. 28250732 10.4103/1673-5374.198966 PMC5319225 140. Kodali M Madhu LN Reger RL Milutinovic B Upadhya R Gonzalez JJ Attaluri S Shuai B Gitai DLG Rao S Intranasally administered human MSC-derived extracellular vesicles inhibit NLRP3-p38/MAPK signaling after TBI and prevent chronic brain dysfunction Brain Behav Immun 2023 108 118 134 10.1016/j.bbi.2022.11.014 36427808 PMC9974012 Kodali M, Madhu LN, Reger RL, Milutinovic B, Upadhya R, Gonzalez JJ, et al. Intranasally administered human MSC-derived extracellular vesicles inhibit NLRP3-p38/MAPK signaling after TBI and prevent chronic brain dysfunction. Brain Behav Immun. 2023;108:118–34. 36427808 10.1016/j.bbi.2022.11.014 PMC9974012 141. Tomasik J Rahmoune H Guest PC Bahn S Neuroimmune biomarkers in schizophrenia Schizophr Res 2016 176 3 13 10.1016/j.schres.2014.07.025 25124519 Tomasik J, Rahmoune H, Guest PC, Bahn S. Neuroimmune biomarkers in schizophrenia. Schizophr Res. 2016;176:3–13. 25124519 10.1016/j.schres.2014.07.025 142. Tsivion-Visbord H Perets N Sofer T Bikovski L Goldshmit Y Ruban A Offen D Mesenchymal stem cells derived extracellular vesicles improve behavioral and biochemical deficits in a phencyclidine model of schizophrenia Transl Psychiatry 2020 10 305 10.1038/s41398-020-00988-y 32873780 PMC7463024 Tsivion-Visbord H, Perets N, Sofer T, Bikovski L, Goldshmit Y, Ruban A, et al. Mesenchymal stem cells derived extracellular vesicles improve behavioral and biochemical deficits in a phencyclidine model of schizophrenia. Transl Psychiatry. 2020;10:305. 32873780 10.1038/s41398-020-00988-y PMC7463024 143. Peinado H Zhang H Matei IR Costa-Silva B Hoshino A Rodrigues G Psaila B Kaplan RN Bromberg JF Kang Y Pre-metastatic niches: organ-specific homes for metastases Nat Rev Cancer 2017 17 302 317 10.1038/nrc.2017.6 28303905 Peinado H, Zhang H, Matei IR, Costa-Silva B, Hoshino A, Rodrigues G, et al. Pre-metastatic niches: organ-specific homes for metastases. Nat Rev Cancer. 2017;17:302–17. 28303905 10.1038/nrc.2017.6 144. Milane L Singh A Mattheolabakis G Suresh M Amiji MM Exosome mediated communication within the tumor microenvironment J Control Release 2015 219 278 294 10.1016/j.jconrel.2015.06.029 26143224 Milane L, Singh A, Mattheolabakis G, Suresh M, Amiji MM. Exosome mediated communication within the tumor microenvironment. J Control Release. 2015;219:278–94. 26143224 10.1016/j.jconrel.2015.06.029 145. Liu Q Peng F Chen J The Role of Exosomal MicroRNAs in the Tumor Microenvironment of Breast Cancer Int J Mol Sci 2019 20 16 3884 10.3390/ijms20163884 31395836 PMC6719057 Liu Q, Peng F, Chen J. The Role of Exosomal MicroRNAs in the Tumor Microenvironment of Breast Cancer. Int J Mol Sci. 2019;20(16):3884. 31395836 10.3390/ijms20163884 PMC6719057 146. Ono M Kosaka N Tominaga N Yoshioka Y Takeshita F Takahashi RU Yoshida M Tsuda H Tamura K Ochiya T Exosomes from bone marrow mesenchymal stem cells contain a microrna that promotes dormancy in metastatic breast cancer cells Sci Signal 2014 7 ra63 10.1126/scisignal.2005231 24985346 Ono M, Kosaka N, Tominaga N, Yoshioka Y, Takeshita F, Takahashi RU, et al. Exosomes from bone marrow mesenchymal stem cells contain a microrna that promotes dormancy in metastatic breast cancer cells. Sci Signal. 2014;7:ra63. 24985346 10.1126/scisignal.2005231 147. Saari H Lázaro-Ibáñez E Viitala T Vuorimaa-Laukkanen E Siljander P Yliperttula M Microvesicle- and exosome-mediated drug delivery enhances the cytotoxicity of Paclitaxel in autologous prostate cancer cells J Control Release 2015 220 727 737 10.1016/j.jconrel.2015.09.031 26390807 Saari H, Lázaro-Ibáñez E, Viitala T, Vuorimaa-Laukkanen E, Siljander P, Yliperttula M. Microvesicle- and exosome-mediated drug delivery enhances the cytotoxicity of Paclitaxel in autologous prostate cancer cells. J Control Release. 2015;220:727–37. 26390807 10.1016/j.jconrel.2015.09.031 148. Jensen-Jarolim E Bax HJ Bianchini R Crescioli S Daniels-Wells TR Dombrowicz D Fiebiger E Gould HJ Irshad S Janda J Allergooncology: opposite outcomes of immune tolerance in allergy and cancer Allergy 2018 73 328 340 10.1111/all.13311 28921585 PMC6038916 Jensen-Jarolim E, Bax HJ, Bianchini R, Crescioli S, Daniels-Wells TR, Dombrowicz D, et al. Allergooncology: opposite outcomes of immune tolerance in allergy and cancer. Allergy. 2018;73:328–40. 28921585 10.1111/all.13311 PMC6038916 149. Markov O Oshchepkova A Mironova N Immunotherapy based on dendritic cell-targeted/-derived extracellular vesicles-a novel strategy for enhancement of the anti-tumor immune response Front Pharmacol 2019 10 1152 10.3389/fphar.2019.01152 31680949 PMC6798004 Markov O, Oshchepkova A, Mironova N. Immunotherapy based on dendritic cell-targeted/-derived extracellular vesicles-a novel strategy for enhancement of the anti-tumor immune response. Front Pharmacol. 2019;10:1152. 31680949 10.3389/fphar.2019.01152 PMC6798004 150. Butterfield LH Dendritic cells in cancer immunotherapy clinical trials: are we making progress? Front Immunol 2013 4 454 10.3389/fimmu.2013.00454 24379816 PMC3861778 Butterfield LH. Dendritic cells in cancer immunotherapy clinical trials: are we making progress? Front Immunol. 2013;4:454. 24379816 10.3389/fimmu.2013.00454 PMC3861778 151. Santos PM Butterfield LH Dendritic cell-based cancer vaccines J Immunol 2018 200 443 449 10.4049/jimmunol.1701024 29311386 PMC5880540 Santos PM, Butterfield LH. Dendritic cell-based cancer vaccines. J Immunol. 2018;200:443–9. 29311386 10.4049/jimmunol.1701024 PMC5880540 152. Pitt JM André F Amigorena S Soria JC Eggermont A Kroemer G Zitvogel L Dendritic cell-derived exosomes for cancer therapy J Clin Invest 2016 126 1224 1232 10.1172/JCI81137 27035813 PMC4811123 Pitt JM, André F, Amigorena S, Soria JC, Eggermont A, Kroemer G, et al. Dendritic cell-derived exosomes for cancer therapy. J Clin Invest. 2016;126:1224–32. 27035813 10.1172/JCI81137 PMC4811123 153. Le Pecq JB Dexosomes as a therapeutic cancer vaccine: from bench to bedside Blood Cells Mol Dis 2005 35 129 135 10.1016/j.bcmd.2005.06.003 16024263 Le Pecq JB. Dexosomes as a therapeutic cancer vaccine: from bench to bedside. Blood Cells Mol Dis. 2005;35:129–35. 16024263 10.1016/j.bcmd.2005.06.003 154. Besse B Charrier M Lapierre V Dansin E Lantz O Planchard D Le Chevalier T Livartoski A Barlesi F Laplanche A Dendritic cell-derived exosomes as maintenance immunotherapy after first line chemotherapy in NSCLC Oncoimmunology 2016 5 e1071008 10.1080/2162402X.2015.1071008 27141373 PMC4839329 Besse B, Charrier M, Lapierre V, Dansin E, Lantz O, Planchard D, et al. Dendritic cell-derived exosomes as maintenance immunotherapy after first line chemotherapy in NSCLC. Oncoimmunology. 2016;5:e1071008. 27141373 10.1080/2162402X.2015.1071008 PMC4839329 155. Morse MA Garst J Osada T Khan S Hobeika A Clay TM Valente N Shreeniwas R Sutton MA Delcayre A A phase I study of dexosome immunotherapy in patients with advanced non-small cell lung cancer J Transl Med 2005 3 9 10.1186/1479-5876-3-9 15723705 PMC551593 Morse MA, Garst J, Osada T, Khan S, Hobeika A, Clay TM, et al. A phase I study of dexosome immunotherapy in patients with advanced non-small cell lung cancer. J Transl Med. 2005;3:9. 15723705 10.1186/1479-5876-3-9 PMC551593 156. Escudier B Dorval T Chaput N André F Caby MP Novault S Flament C Leboulaire C Borg C Amigorena S Vaccination of metastatic melanoma patients with autologous dendritic cell (DC) derived-exosomes: results of thefirst phase I clinical trial J Transl Med 2005 3 10 10.1186/1479-5876-3-10 15740633 PMC554765 Escudier B, Dorval T, Chaput N, André F, Caby MP, Novault S, et al. Vaccination of metastatic melanoma patients with autologous dendritic cell (DC) derived-exosomes: results of thefirst phase I clinical trial. J Transl Med. 2005;3:10. 15740633 10.1186/1479-5876-3-10 PMC554765 157. Szabo G Bala S Micrornas in liver disease Nat Rev Gastroenterol Hepatol 2013 10 542 552 10.1038/nrgastro.2013.87 23689081 PMC4091636 Szabo G, Bala S. Micrornas in liver disease. Nat Rev Gastroenterol Hepatol. 2013;10:542–52. 23689081 10.1038/nrgastro.2013.87 PMC4091636 158. Balaphas A Meyer J Sadoul R Morel P Gonelle-Gispert C Bühler LH Extracellular vesicles: future diagnostic and therapeutic tools for liver disease and regeneration Liver Int 2019 39 1801 1817 10.1111/liv.14189 31286675 Balaphas A, Meyer J, Sadoul R, Morel P, Gonelle-Gispert C, Bühler LH. Extracellular vesicles: future diagnostic and therapeutic tools for liver disease and regeneration. Liver Int. 2019;39:1801–17. 31286675 10.1111/liv.14189 159. Kim SH Kim G Han DH Lee M Kim I Kim B Kim KH Song YM Yoo JE Wang HJ Ezetimibe ameliorates steatohepatitis via AMP activated protein kinase-TFEB-mediated activation of autophagy and NLRP3 inflammasome inhibition Autophagy 2017 13 1767 1781 10.1080/15548627.2017.1356977 28933629 PMC5640190 Kim SH, Kim G, Han DH, Lee M, Kim I, Kim B, et al. Ezetimibe ameliorates steatohepatitis via AMP activated protein kinase-TFEB-mediated activation of autophagy and NLRP3 inflammasome inhibition. Autophagy. 2017;13:1767–81. 28933629 10.1080/15548627.2017.1356977 PMC5640190 160. Hirsova P Ibrahim SH Krishnan A Verma VK Bronk SF Werneburg NW Charlton MR Shah VH Malhi H Gores GJ Lipid-induced signaling causes release of inflammatory extracellular vesicles from hepatocytes Gastroenterology 2016 150 956 967 10.1053/j.gastro.2015.12.037 26764184 PMC4808464 Hirsova P, Ibrahim SH, Krishnan A, Verma VK, Bronk SF, Werneburg NW, et al. Lipid-induced signaling causes release of inflammatory extracellular vesicles from hepatocytes. Gastroenterology. 2016;150:956–67. 26764184 10.1053/j.gastro.2015.12.037 PMC4808464 161. Cannito S Morello E Bocca C Foglia B Benetti E Novo E Chiazza F Rogazzo M Fantozzi R Povero D Microvesicles released from fat-laden cells promote activation of hepatocellular NLRP3 inflammasome: a pro-inflammatory link between lipotoxicity and non-alcoholic steatohepatitis PLoS ONE 2017 12 e0172575 10.1371/journal.pone.0172575 28249038 PMC5331985 Cannito S, Morello E, Bocca C, Foglia B, Benetti E, Novo E, et al. Microvesicles released from fat-laden cells promote activation of hepatocellular NLRP3 inflammasome: a pro-inflammatory link between lipotoxicity and non-alcoholic steatohepatitis. PLoS ONE. 2017;12:e0172575. 28249038 10.1371/journal.pone.0172575 PMC5331985 162. Liao CY Song MJ Gao Y Mauer AS Revzin A Malhi H Hepatocyte-derived lipotoxic extracellular vesicle sphingosine 1-phosphate induces macrophage chemotaxis Front Immunol 2018 9 2980 10.3389/fimmu.2018.02980 30619336 PMC6305739 Liao CY, Song MJ, Gao Y, Mauer AS, Revzin A, Malhi H. Hepatocyte-derived lipotoxic extracellular vesicle sphingosine 1-phosphate induces macrophage chemotaxis. Front Immunol. 2018;9:2980. 30619336 10.3389/fimmu.2018.02980 PMC6305739 163. Momen-Heravi F Bala S Kodys K Szabo G Exosomes derived from alcohol-treated hepatocytes horizontally transfer liver specific miRNA-122 and sensitize monocytes to LPS Sci Rep 2015 5 9991 10.1038/srep09991 25973575 PMC4650752 Momen-Heravi F, Bala S, Kodys K, Szabo G. Exosomes derived from alcohol-treated hepatocytes horizontally transfer liver specific miRNA-122 and sensitize monocytes to LPS. Sci Rep. 2015;5:9991. 25973575 10.1038/srep09991 PMC4650752 164. Verma VK Li H Wang R Hirsova P Mushref M Liu Y Cao S Contreras PC Malhi H Kamath PS Alcohol stimulates macrophage activation through caspase-dependent hepatocyte derived release of CD40L containing extracellular vesicles J Hepatol 2016 64 651 660 10.1016/j.jhep.2015.11.020 26632633 PMC4761285 Verma VK, Li H, Wang R, Hirsova P, Mushref M, Liu Y, et al. Alcohol stimulates macrophage activation through caspase-dependent hepatocyte derived release of CD40L containing extracellular vesicles. J Hepatol. 2016;64:651–60. 26632633 10.1016/j.jhep.2015.11.020 PMC4761285 165. Bataller R Brenner DA Liver fibrosis J Clin Invest 2005 115 209 218 10.1172/JCI24282 15690074 PMC546435 Bataller R, Brenner DA. Liver fibrosis. J Clin Invest. 2005;115:209–18. 15690074 10.1172/JCI24282 PMC546435 166. Povero D Panera N Eguchi A Johnson CD Papouchado BG de Araujo HL Pinatel EM Alisi A Nobili V Feldstein AE Lipid-induced hepatocyte-derived extracellular vesicles regulate hepatic stellate cell via microRNAs targeting PPAR-γ Cell Mol Gastroenterol Hepatol 2015 1 646 663.e644 10.1016/j.jcmgh.2015.07.007 26783552 PMC4714359 Povero D, Panera N, Eguchi A, Johnson CD, Papouchado BG, de Araujo HL, et al. Lipid-induced hepatocyte-derived extracellular vesicles regulate hepatic stellate cell via microRNAs targeting PPAR-γ. Cell Mol Gastroenterol Hepatol. 2015;1:646-663.e644. 26783552 10.1016/j.jcmgh.2015.07.007 PMC4714359 167. Charrier A Chen R Chen L Kemper S Hattori T Takigawa M Brigstock DR Exosomes mediate intercellular transfer of pro-fibrogenic connective tissue growth factor (CCN2) between hepatic stellate cells, the principal fibrotic cells in the liver Surgery 2014 156 548 555 10.1016/j.surg.2014.04.014 24882759 PMC4150742 Charrier A, Chen R, Chen L, Kemper S, Hattori T, Takigawa M, et al. Exosomes mediate intercellular transfer of pro-fibrogenic connective tissue growth factor (CCN2) between hepatic stellate cells, the principal fibrotic cells in the liver. Surgery. 2014;156:548–55. 24882759 10.1016/j.surg.2014.04.014 PMC4150742 168. Rautou PE Vion AC Luyendyk JP Mackman N Circulating microparticle tissue factor activity is increased in patients with cirrhosis Hepatology 2014 60 1793 1795 10.1002/hep.27033 24470301 PMC4603384 Rautou PE, Vion AC, Luyendyk JP, Mackman N. Circulating microparticle tissue factor activity is increased in patients with cirrhosis. Hepatology. 2014;60:1793–5. 24470301 10.1002/hep.27033 PMC4603384 169. Kogure T Lin WL Yan IK Braconi C Patel T Intercellular nanovesicle-mediated microRNA transfer: a mechanism of environmental modulation of hepatocellular cancer cell growth Hepatology 2011 54 1237 1248 10.1002/hep.24504 21721029 PMC3310362 Kogure T, Lin WL, Yan IK, Braconi C, Patel T. Intercellular nanovesicle-mediated microRNA transfer: a mechanism of environmental modulation of hepatocellular cancer cell growth. Hepatology. 2011;54:1237–48. 21721029 10.1002/hep.24504 PMC3310362 170. Lv LH Wan YL Lin Y Zhang W Yang M Li GL Lin HM Shang CZ Chen YJ Min J Anticancer drugs cause release of exosomes with heat shock proteins from human hepatocellular carcinoma cells that elicit effective natural killer cell antitumor responses in vitro J Biol Chem 2012 287 15874 15885 10.1074/jbc.M112.340588 22396543 PMC3346092 Lv LH, Wan YL, Lin Y, Zhang W, Yang M, Li GL, et al. Anticancer drugs cause release of exosomes with heat shock proteins from human hepatocellular carcinoma cells that elicit effective natural killer cell antitumor responses in vitro. J Biol Chem. 2012;287:15874–85. 22396543 10.1074/jbc.M112.340588 PMC3346092 171. Jia Y Yu L Ma T Xu W Qian H Sun Y Shi H Small extracellular vesicles isolation and separation: current techniques, pending questions and clinical applications Theranostics 2022 12 6548 6575 10.7150/thno.74305 36185597 PMC9516236 Jia Y, Yu L, Ma T, Xu W, Qian H, Sun Y, et al. Small extracellular vesicles isolation and separation: current techniques, pending questions and clinical applications. Theranostics. 2022;12:6548–75. 36185597 10.7150/thno.74305 PMC9516236 172. Zheng X Ai H Qian K Li G Zhang S Zou Y Lei C Fu W Hu S Small extracellular vesicles purification and scale-up Front Immunol 2024 15 1344681 10.3389/fimmu.2024.1344681 38469310 PMC10925713 Zheng X, Ai H, Qian K, Li G, Zhang S, Zou Y, et al. Small extracellular vesicles purification and scale-up. Front Immunol. 2024;15:1344681. 38469310 10.3389/fimmu.2024.1344681 PMC10925713 173. Chen J Li P Zhang T Xu Z Huang X Wang R Du L Review on strategies and technologies for exosome isolation and purification Front Bioeng Biotechnol 2021 9 811971 10.3389/fbioe.2021.811971 35071216 PMC8766409 Chen J, Li P, Zhang T, Xu Z, Huang X, Wang R, et al. Review on strategies and technologies for exosome isolation and purification. Front Bioeng Biotechnol. 2021;9:811971. 35071216 10.3389/fbioe.2021.811971 PMC8766409 174. Zhang Q Jeppesen DK Higginbotham JN Franklin JL Coffey RJ Comprehensive isolation of extracellular vesicles and nanoparticles Nat Protoc 2023 18 1462 1487 10.1038/s41596-023-00811-0 36914899 PMC10445291 Zhang Q, Jeppesen DK, Higginbotham JN, Franklin JL, Coffey RJ. Comprehensive isolation of extracellular vesicles and nanoparticles. Nat Protoc. 2023;18:1462–87. 36914899 10.1038/s41596-023-00811-0 PMC10445291 175. Soares M Pinto MM Nobre RJ de Almeida LP da Graça Rasteiro M Almeida-Santos T Ramalho-Santos J Sousa AP Isolation of extracellular vesicles from human follicular fluid: size-exclusion chromatography versus ultracentrifugation Biomolecules 2023 10.3390/biom13020278 36830647 PMC9953485 Soares M, Pinto MM, Nobre RJ, de Almeida LP, da Graça Rasteiro M, Almeida-Santos T, et al. Isolation of extracellular vesicles from human follicular fluid: size-exclusion chromatography versus ultracentrifugation. Biomolecules. 2023. 10.3390/biom13020278. 36830647 10.3390/biom13020278 PMC9953485 176. Xu Z Foster JB Lashley R Wang X Muhleman AJ Masters CE Lin CG Comparison of the protein composition of isolated extracellular vesicles from mouse brain and dissociated brain cell culture medium PLoS ONE 2024 19 e0309716 10.1371/journal.pone.0309716 39531446 PMC11556680 Xu Z, Foster JB, Lashley R, Wang X, Muhleman AJ, Masters CE, et al. Comparison of the protein composition of isolated extracellular vesicles from mouse brain and dissociated brain cell culture medium. PLoS ONE. 2024;19:e0309716. 39531446 10.1371/journal.pone.0309716 PMC11556680 177. Yang M Guo J Fang L Chen Z Liu Y Sun Z Pang X Peng Y Quality and efficiency assessment of five extracellular vesicle isolation methods using the resistive pulse sensing strategy Anal Methods 2024 16 5536 5544 10.1039/D4AY01158A 39046449 Yang M, Guo J, Fang L, Chen Z, Liu Y, Sun Z, et al. Quality and efficiency assessment of five extracellular vesicle isolation methods using the resistive pulse sensing strategy. Anal Methods. 2024;16:5536–44. 39046449 10.1039/d4ay01158a 178. Wang Z Zhou X Kong Q He H Sun J Qiu W Zhang L Yang M Extracellular vesicle preparation and analysis: a state-of-the-art review Adv Sci (Weinh) 2024 11 e2401069 10.1002/advs.202401069 38874129 PMC11321646 Wang Z, Zhou X, Kong Q, He H, Sun J, Qiu W, et al. Extracellular vesicle preparation and analysis: a state-of-the-art review. Adv Sci (Weinh). 2024;11:e2401069. 38874129 10.1002/advs.202401069 PMC11321646 179. Amondarain M Gallego I Puras G Saenz-Del-Burgo L Luzzani C Pedraz JL The role of microfluidics and 3D-bioprinting in the future of exosome therapy Trends Biotechnol 2023 41 1343 1359 10.1016/j.tibtech.2023.05.006 37302911 Amondarain M, Gallego I, Puras G, Saenz-Del-Burgo L, Luzzani C, Pedraz JL. The role of microfluidics and 3D-bioprinting in the future of exosome therapy. Trends Biotechnol. 2023;41:1343–59. 37302911 10.1016/j.tibtech.2023.05.006 180. Tan M Ge Y Wang X Wang Y Liu Y He F Teng H Extracellular vesicles (EVs) in tumor diagnosis and therapy Technol Cancer Res Treat 2023 22 15330338231171463 10.1177/15330338231171463 37122245 PMC10134167 Tan M, Ge Y, Wang X, Wang Y, Liu Y, He F, et al. Extracellular vesicles (EVs) in tumor diagnosis and therapy. Technol Cancer Res Treat. 2023;22:15330338231171464. 37122245 10.1177/15330338231171463 PMC10134167 181. Jimenez L Barman B Jung YJ Cocozza L Krystofiak E Saffold C Vickers KC Wilson JT Dawson TR Weaver AM Culture conditions greatly impact the levels of vesicular and extravesicular Ago2 and RNA in extracellular vesicle preparations J Extracell Vesicles 2023 12 e12366 10.1002/jev2.12366 37885043 PMC10603024 Jimenez L, Barman B, Jung YJ, Cocozza L, Krystofiak E, Saffold C, et al. Culture conditions greatly impact the levels of vesicular and extravesicular Ago2 and RNA in extracellular vesicle preparations. J Extracell Vesicles. 2023;12:e12366. 37885043 10.1002/jev2.12366 PMC10603024 182. Tertel T Dittrich R Arsène P Jensen A Giebel B EV products obtained from iPSC-derived MSCs show batch-to-batch variations in their ability to modulate allogeneic immune responses in vitro Front Cell Dev Biol 2023 11 1282860 10.3389/fcell.2023.1282860 37965578 PMC10642442 Tertel T, Dittrich R, Arsène P, Jensen A, Giebel B. EV products obtained from iPSC-derived MSCs show batch-to-batch variations in their ability to modulate allogeneic immune responses in vitro. Front Cell Dev Biol. 2023;11:1282860. 37965578 10.3389/fcell.2023.1282860 PMC10642442 183. Li Y Wu Y Federzoni EA Wang X Dharmawan A Hu X Wang H Hawley RJ Stevens S Sykes M Yang YG CD47 cross-dressing by extracellular vesicles expressing CD47 inhibits phagocytosis without transmitting cell death signals Elife 2022 10.7554/eLife.73677 36454036 PMC9714967 Li Y, Wu Y, Federzoni EA, Wang X, Dharmawan A, Hu X, et al. CD47 cross-dressing by extracellular vesicles expressing CD47 inhibits phagocytosis without transmitting cell death signals. Elife. 2022. 10.7554/eLife.73677. 36454036 10.7554/eLife.73677 PMC9714967 ",
  "metadata": {
    "Title of this paper": "CD47 cross-dressing by extracellular vesicles expressing CD47 inhibits phagocytosis without transmitting cell death signals",
    "Journal it was published in:": "Journal of Translational Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486671/"
  }
}