{
  "title": "Paper_130",
  "abstract": "pmc Biol Sport Biol Sport 2295 biolsport JBS Biology of Sport 0860-021X 2083-1862 Institute of Sport PMC12490320 PMC12490320.1 12490320 12490320 10.5114/biolsport.2025.152112 56284 1 Original Paper Are decorin gene variants associated with anterior cruciate ligament rupture susceptibility? Łosińska Kinga 1 Rzeszutko-Bełzowska Agata 2 Ficek Krzysztof 3 September Alison V. 4 1 2 3 4 Corresponding author: Kinga Łosińska kinga.losinska@awf.gda.pl ORCID: 16 7 2025 10 2025 42 4 498187 333 343 23 2 2025 02 6 2025 12 6 2025 12 6 2025 16 07 2025 03 10 2025 03 10 2025 Copyright © Institute of Sport – National Research Instutite 2025 https://creativecommons.org/licenses/by/4.0/ This is an Open Access article distributed under the terms of the Creative Commons CC BY License, This license enables reusers to distribute, remix, adapt, and build upon the material in any medium or format, so long as attribution is given to the creator. The license allows for commercial use. This study aimed to investigate whether two DCN gene single nucleotide polymorphisms (SNPs), rs13312816 (T > A) and rs516115 (A > G), are associated with the risk and severity of anterior cruciate ligament (ACL) injury. A total of 296 physically active, unrelated Caucasian males participated: 160 with noncontact ACL injuries and 136 healthy controls. Genotyping was conducted using TaqMan assays. Logistic regression and haplotype-based analyses were performed, adjusting for age and body mass. The minor A allele of rs13312816 was significantly more frequent in ACL cases than in controls (8.54% vs. 2.94%, P = 0.0047; OR = 3.08, 95% CI: 1.33–7.98). Individuals with the A/T genotype had higher odds of injury compared to T/T carriers (P adj adj adj adj adj adj adj DCN Case-control study Polymorphism ACL rupture ACL injury pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes INTRODUCTION Anterior cruciate ligament (ACL) injuries represent a significant clinical and economic burden due to their high prevalence among athletes and the general population, as well as their long-term consequences, which include joint instability, post-traumatic osteoarthritis, and a decreased quality of life [ 1 5 6 7 The pathophysiology of ACL injuries is multifactorial, with both environmental and genetic factors playing a significant role in injury susceptibility [ 8 9 9 10 DCN 11 14 It has been hypothesised that decorin protein binds to collagen fibers and hereby regulates fibril formation, and potentially impacts ligament strength and its ability to withstand mechanical forces. Genetic variations in this key gene may, therefore, contribute to differences in ACL injury risk among individuals. Previous research have identified single nucleotide polymorphisms (SNPs) in the DCN 15 16 11 In this study, we aimed to investigate the association between the two DCN MATERIALS AND METHODS Participants A total of 296 physically active, unrelated, self-reported Caucasian participants were recruited for this case–control genetic association study between the 2017 and 2024. These participants consisted of 160 (male) individuals with ACL injuries (ACLS – ACL strain, ACLRP – ACL partial rupture, ACLRC – ACL rupture complete) and 136 (male) apparently healthy participants without any history of ACL injuries (CON group). All 296 participants from the ACL injury group sustained their injury through non-contact mechanisms. The participants were soccer players from the Polish 1 st nd Ethics committee The study was approved by the Gdańsk University of Physical Education Ethics Committee (Uchwała nr 1/2024) and written informed consent was obtained from each participant according to the declaration of Helsinki. Genetic Analyses Genomic DNA was extracted from the buccal cells collected from each participants using a GenElute Mammalian Genomic DNA Miniprep Kit (Sigma, Steinheim, Germany) in accordance with the manufacturer’s guidance. Genotyping was conducted in duplicate using TaqMan® Pre-Designed SNP Genotyping Assays (Applied Biosystems, Waltham, MA, USA) on a CFX96 Touch Real-Time PCR Detection System (BIO-RAD, Feldkirchen, Germany) according to the producer’s recommendations. To differentiate the rs13312816 T > A and rs516115 A > G DCN Statistical analysis The association between the two DCN NM_001920.3 Both the primary and secondary analyses involved a single-locus analysis and a haplotype-based analysis. The single-locus analysis was conducted using the R SNPassoc package (version 2.1-0), applying five different genetic models: codominant, dominant, recessive, overdominant, and log-additive. These models were constructed to evaluate the effect of the minor allele on ACL injury outcomes in different ways: the codominant model assesses the effects of having one or two copies of the minor allele compared to having none, the dominant model assumes that having one or two copies of the minor allele is equivalent and compares it to having no copies, the recessive model tests whether the effect is only observed in individuals with two copies of the minor allele, the overdominant model evaluates whether heterozygotes (one copy of each allele) have a different risk compared to both homozygotes and the log-additive model assumes that each additional copy of the minor allele linearly increases the risk. In these models, the minor allele was assumed to be the risk factor. Odds ratios (OR) with 95% confidence intervals (CI) were calculated for each SNP under each genetic model. In all analyses, adjustments were made for potential confounding variables, specifically age and body mass. The haplotype-based analysis was conducted using the R haplo. stats library (version 1.9.7). Haplotypes were inferred using the expectation-maximization (EM) algorithm, which accounted for phase uncertainty in the haplotype reconstruction. The association between haplotypes and ACL injury outcomes was then assessed using a generalized linear model (GLM) framework, which incorporated the uncertainty from haplotype inference ( haplo.glm Comparisons of demographic variables between cases and controls were performed using Wilcoxon test for continuous variables and Fisher’s exact test for categorical variables. A P-value < 0.05 was considered statistically significant across all analyses. RESULTS Characteristics of the cases and controls are presented in Table 1 Table 1 TABLE 1 Group characteristics Characteristic Controls, N = 136 1 Cases, N = 160 1 P 2 Age (years) 27 (4) 36 (7) < 0.001 Height (cm) 178 (7) 178 (6) 0.284 Missing 0 1 Body mass (kg) 73 (16) 78 (10) < 0.001 Missing 0 1   rs13312816 0.004 AT 8 / 136 (5.9%) 27 / 158 (17%) TT 128 / 136 (94%) 131 / 158 (83%) Missing 0 2   rs516115 0.118 AA 85 / 136 (63%) 82 / 159 (52%) AG 40 / 136 (29%) 65 / 159 (41%) GG 11 / 136 (8.1%) 12 / 159 (7.5%) Missing 0 1   ACLF NA No NA 101 / 160 (63%) Yes NA 59 / 160 (37%)   ACLS NA No NA 31 / 160 (19%) Yes NA 129 / 160 (81%)   ACLRP NA No NA 120 / 160 (75%) Yes NA 40 / 160 (25%)   ACLRC NA No NA 141 / 160 (88%) Yes NA 19 / 160 (12%) 1 n / N (%) for categorical variables, mean (SD) for continuous variables, 2 Wilcoxon rank sum test; Fisher’s exact test, ACLF – ACL full rupture, ACLS – ACL strain, ACLRP – ACL partial rupture, ACLRC – ACL rupture complete, ACL – anterior cruciate ligament, NA – not applicable The allelic distribution for SNPs rs13312816 T > A and rs516115 A > G between ACL cases and controls is summarized in Table 2 TABLE 2 The allele frequency distributions for DCN DCN SNP Control (%) Cases (%) Pooled (%) P 1 rs13312816 n 272 316 588 0.0047 3.08 (1.33–7.98) A 8 (2.94) 27 (8.54) 35 (5.95) T 264 (97.06) 289 (91.46) 553 (94.05) HWE P 2 1.0 0.605 0.610  rs516115 n 272 318 590 0.157 1.31 (0.89–1.95) G 62 (22.79) 89 (27.99) 151 (25.59) A 210 (77.21) 229 (72.01) 439 (74.41) HWE P 2 0.084 1.0 0.284 1 P-value for comparison between controls and cases, with odds ratio (OR) and 95% confidence interval (CI), 2 HWE P-value for genotype frequencies compared to the expected theoretical distribution. The minor A allele for rs13312816 T > A, was significantly more common in cases (8.54%) compared to controls (2.94%), with a pooled frequency of 5.95% (P = 0.0047, OR = 3.08; 95% CI: 1.33–7.98). Although the G allele of rs516115 A > G was more frequent in cases (27.99%) compared to controls (22.79%), this difference did not reach statistical significance (P = 0.157). No statistically significant deviations for HWE were noted for either of the SNPs (P > 0.05) ( Table 2 Table 3 Table 4 Table 3 The genotype distributions for rs13312816 T > A between the control and case groups under a codominant model Model Controls (%) Cases (%) OR (95% CI) P Padj Codominant n=136 n=158 T/T 128 (94.1) 131 (82.9) 1.0 0.0023 0.008 A/T 8 (5.9) 27 (17.1) 3.3 (1.44–7.53) Padj – model including age and body mass, The analysis presented in the table focuses solely on a codominant model due to the absence of individuals homozygous for the A allele (A/A genotype). Table 4 Association of rs516115 A > G genotypes with case-control status under 5 different genetic models Model Controls (%) Cases (%) OR (95% CI) P Padj Codominant A/A 85 (62.5) 82 (51.6) 1.00 0.116 0.281 A/G 40 (29.4) 65 (40.9) 1.68 (1.02–2.77) G/G 11 (8.1) 12 (7.5) 1.13 (0.47–2.71)  Dominant A/A 85 (62.5) 82 (51.6) 1.00 0.059 0.359 A/G-G/G 51 (37.5) 77 (48.4) 1.57 (0.98–2.49)  Recessive A/A-A/G 125 (91.9) 147 (92.5) 1.00 0.863 0.352 G/G 11 (8.1) 12 (7.5) 0.93 (0.40–2.18)  Overdominant A/A-G/G 96 (70.6) 94 (59.1) 1.00 0.040 0.141 A/G 40 (29.4) 65 (40.9) 1.66 (1.02–2.70)  log-Additive 0,1,2 136 (46.1) 159 (53.9) 1.30 (0.90–1.87) 0.161 0.751 Padj – model including age and body mass rs13312816 T > A and rs516115 A > G inferred haplotype analyses showed that the TA haplotype was the most prevalent (74.4%) while the AG haplotype was relative rare (< 6.0%) in the study participants. It was interesting to note that the AA haplotype was absent. A regression model using DCN Table 5 Table 5 The inferred DCN Term Coef. SE P Padj (Intercept) 0.044 0.15 0.7712 < 0.0001 [A;G] 1.19 0.425 0.0047 0.0095 [T;G] -0.02 0.2155 0.927 0.340 Padj age and body mass adjusted Evaluating the potential relationship between the two DCN SNPs on injury severity In addition to the case-control comparison, we conducted a secondary analysis focusing on the case group only, evaluating the relationship between the two SNPs and ACL injury-related variables. The distribution of ACL injury-related outcomes within the case cohort is summarized in Table 1 Table 6 Table 6 The evaluation of the rs13312816 T > A genotype distribution frequencies with single and multiple ACL injury related outcomes Outcome Model 0 (%) 1 (%) OR (95% CI) P Padj ACLF COD T/T 90 (89.1) 41 (71.9) 1.00 0.007 0.010 (0 – Single, 1 – Multiple) A/T 11 (10.9) 16 (28.1) 3.19 (1.36–7.48)  ACLS COD T/T 27 (90.0) 104 (81.2) 1.00 0.227 0.205 (0 – No, 1 – Yes) A/T 3 (10.0) 24 (18.8) 2.08 (0.58–7.42)  ACLRP COD T/T 97 (81.5) 34 (87.2) 1.00 0.403 0.354 (0 – No, 1 – Yes) A/T 22 (18.5) 5 (12.8) 0.65 (0.23–1.85)  ACLRC COD T/T 114 (82.0) 17 (89.5) 1.00 0.393 0.400 (0 – No, 1 – Yes) A/T 25 (18.0) 2 (10.5) 0.54 (0.12–2.47) ACLF ACL injury frequency – single vs multiple, ACLS ACL strain, ACLRRP – ACL partial rupture, ACLRC ACL complete rupture, COD – codominant model, Padj – adjusted for age and body mass For rs13312816 T > A, only the codominant model was analyzed due to the absence of A/A homozygotes in the study population. A significant association was observed only for the ACLF outcome (single versus The results of the single-locus association analysis of rs516115 A > G with ACL injury-related outcomes are presented in Table 7 versus Table 7 The evaluation of the rs516115 A > G genotype distribution frequencies with ACL injury related outcomes Outcome Model 0 (%) 1 (%) OR (95% CI) P Padj ACLF (0 – Single, 1 – Multiple) COD A/A 68 (67.3) 14 (24.1) 1.00 < 0.0001 < 0.0001 A/G 29 (28.7) 36 (62.1) 6.03 (2.83–12.83) G/G 4 (4.0) 8 (13.8) 9.71 (2.57–36.77)  DOM A/A 68 (67.3) 14 (24.1) 1.00 < 0.0001 < 0.0001 A/G-G/G 33 (32.7) 44 (75.9) 6.48 (3.12–13.45)  REC A/A-A/G 97 (96.0) 50 (86.2) 1.00 0.027 0.060 G/G 4 (4.0) 8 (13.8) 3.88 (1.11–13.51)  HET A/A-G/G 72 (71.3) 22 (37.9) 1.00 < 0.0001 < 0.0001 A/G 29 (28.7) 36 (62.1) 4.06 (2.05–8.05)  ADD 0,1,2 101 (63.5) 58 (36.5) 4.24 (2.33–7.71) < 0.0001 < 0.0001  ACLS (0 – No, 1 – Yes) COD A/A 17 (54.8) 65 (50.8) 1.00 0.536 0.564 A/G 13 (41.9) 52 (40.6) 1.05 (0.47–2.35) G/G 1 (3.2) 11 (8.6) 2.88 (0.35–23.84)  DOM A/A 17 (54.8) 65 (50.8) 1.00 0.685 0.576 A/G-G/G 14 (45.2) 63 (49.2) 1.18 (0.54–2.59)  REC A/A-A/G 30 (96.8) 117 (91.4) 1.00 0.267 0.303 G/G 1 (3.2) 11 (8.6) 2.82 (0.35–22.69)  HET A/A-G/G 18 (58.1) 76 (59.4) 1.00 0.894 0.960 A/G 13 (41.9) 52 (40.6) 0.95 (0.43–2.10)  ADD 0,1,2 31 (19.5) 128 (80.5) 1.28 (0.67–2.44) 0.450 0.392  ACLRP (0 – No, 1 – Yes) COD A/A 58 (48.3) 24 (61.5) 1.00 0.163 0.336 A/G 54 (45.0) 11 (28.2) 0.49 (0.22–1.10) G/G 8 (6.7) 4 (10.3) 1.21 (0.33–4.39)  DOM A/A 58 (48.3) 24 (61.5) 1.00 0.150 0.218 A/G-G/G 62 (51.7) 15 (38.5) 0.58 (0.28–1.22)  REC A/A-A/G 112 (93.3) 35 (89.7) 1.00 0.475 0.737 G/G 8 (6.7) 4 (10.3) 1.60 (0.45–5.63)  HET A/A-G/G 66 (55.0) 28 (71.8) 1.00 0.060 0.140 A/G 54 (45.0) 11 (28.2) 0.48 (0.22–1.05)  ADD 0,1,2 120 (75.5) 39 (24.5) 0.78 (0.43–1.41) 0.403 0.426  ACLRC (0 – No, 1 – Yes) COD A/A 72 (51.4) 10 (52.6) 1.00 0.480 0.222 A/G 56 (40.0) 9 (47.4) 1.16 (0.44–3.04) G/G 12 (8.6) 0 (0.0) 0.00 (0.00)  DOM A/A 72 (51.4) 10 (52.6) 1.00 0.922 0.908 A/G-G/G 68 (48.6) 9 (47.4) 0.95 (0.37–2.49)  REC A/A-A/G 128 (91.4) 19 (100.0) 1.00 0.363 0.086 G/G 12 (8.6) 0 (0.0) 0.00 (0.00)  HET A/A-G/G 84 (60.0) 10 (52.6) 1.00 0.542 0.566 A/G 56 (40.0) 9 (47.4) 1.35 (0.52–3.53)  ADD 0,1,2 140 (88.1) 19 (11.9) 0.77 (0.35–1.72) 0.480 0.521 ACLF ACL injury frequency – single vs multiple, ACLS ACL strain, ACLRRP – ACL partial rupture, ACLRC ACL complete rupture; COD – codominant model, DOM – dominant model, REC – recessive model, HET – over-dominant heterozygote model, ADD – logadditive model, Padj – P value adjusted for age and body mass Specifically, in the analysis of ACLF, a significant association was observed between the A/G and G/G genotypes in the codominant model compared to the reference A/A genotype. The A/G genotype was significantly more frequent in cases (62.1%) than controls (28.7%), with an OR of 6.03 (95% CI: 2.83–12.83, P < 0.0001, Padj < 0.0001). Similarly, the G/G genotype also showed a higher prevalence in cases (13.8%) compared to controls (4.0%), with an OR of 9.71 (95% CI: 2.57–36.77, P < 0.0001, Padj < 0.0001). In the dominant model (A/G-G/G vs. A/A), the combined A/G-G/G genotypes were significantly associated with ACLF, yielding an OR of 6.48 (95% CI: 3.12–13.45, P < 0.0001, Padj < 0.0001). The recessive model also demonstrated a significant association with an OR of 3.88 (95% CI: 1.11–13.51, P = 0.027, Padj = 0.060). For the overdominant model (HET), the A/G genotype was more prevalent in cases (62.1%) compared to controls (28.7%), showing an OR of 4.06 (95% CI: 2.05–8.05, P < 0.0001, Padj < 0.0001). The log-additive model further supported this finding with an OR of 4.24 (95% CI: 2.33–7.71, P < 0.0001, Padj < 0.0001). In the haplotype-based analysis ( Table 8 Table 8 The DCN Outcome Term coef. SE P Padj ACLF (Intercept) -1.43 0.27 < 0.0001 0.0098 [A;G] 1.21 0.47 0.010 0.0099 [T;G] 1.57 0.36 < 0.0001 < 0.0001  ACLS (Intercept) 1.32 0.26 < 0.0001 0.781 [A;G] 0.68 0.65 0.292 0.271 [T;G] 0.02 0.42 0.9593 0.878  ACLRP (Intercept) -0.97 0.24 < 0.0001 0.016 [A;G] -0.38 0.53 0.478 0.463 [T;G] -0.19 0.39 0.627 0.649  ACLRC (Intercept) -1.89 0.32 < 0.0001 0.960 [A;G] -0.62 0.78 0.430 0.425 [T;G] -0.08 0.51 0.881 0.874 ACLF ACL injury frequency – single vs multiple, ACLS ACL strain, ACLRRP – ACL partial rupture, ACLRC ACL complete rupture, Padj – adjusted for age and body mass, coef. – regression coefficient, SE – standard error The [A;G] haplotype reflected a significant association with an odds ratio equivalent to a coef = 1.21 (SE = 0.47, P = 0.01, Padj = 0.0099). Additionally, the [T;G] haplotype demonstrated an even stronger association, with a coef = 1.57 (SE = 0.36, P < 0.0001, Padj < 0.0001). For the other ACL injury-related outcomes, no significant associations were identified. In the analysis of ACLS, neither [A;G] (P = 0.292, Padj = 0.271) nor [T;G] (P = 0.9593, Padj = 0.878) showed any significant association with the outcome. Similarly, for ACLRP and ACLRC, no significant associations were found for [A;G] or [T;G] (Padj > 0.05 for all models). Figure 1 DCN FIG. 1 Odds ratios with 95% confidence intervals from the regression models. DISCUSSION Our study found that individuals who had inherited the A allele of DCN 17 17 DCN DCN 18 DCN DCN The haplotype analyses did however implicate a genomic interval spanning both the DCN NM_001920.3 DCN 19 16 DCN BGN DCN ACAN 20 BGN Our study’s focus on DCN 21 IL1B IL6 DCN BGN DCN DCN 11 DCN, COL5A1 BGN DCN DCN 16 It becomes evident that decorin plays an essential, phase-specific role in tendon and ligament integrity by modulating collagen fibril organization, influencing ECM remodeling, and working in tandem with other proteoglycans like biglycan. In Abbah et al. [ 22 DCN IL-10 22 DCN 23 DCN 24 DCN 25 26 This study investigated the role of decorin ( DCN 27 28 DCN 29 30 31 10 17 In conclusion, this study provides evidence that specific polymorphisms in the DCN DCN DCN DCN CONCLUSIONS We found significant differences in the genotype and allele frequencies between ACL cases and controls for rs13312816 T > A, with the A/T genotype showing a notably higher prevalence in cases, particularly in individuals with multiple ACL injuries. The association between the A/T genotype and increased incidence of injury highlights the potential importance of this genetic variation in predisposition to anterior cruciate ligament injuries. On the other hand, the rs516115 A > G SNP did not exhibit significant associations with ACL injury, although a trend was observed for its involvement in ACL injury outcomes, such as ACL strain and partial rupture. Additionally, haplotype analysis revealed that the [A;G] haplotype is associated with a higher risk of ACL injury, emphasizing the importance of considering multiple SNPs together rather than severally. These findings highlight the role of genetic variations in influencing injury risk, suggesting that SNPs in the DCN Acknowledgements „Co-financed by the Minister of Science under the “Regional Excellence Initiative” program” Author Contributions According to the definition given by the International Committee of Medical Journal Editors (ICMJE), the authors listed qualify for authorship based on making one or more substantial contributions to the intellectual content of the manuscript. Conceptualisation: KŁ. Ethics: KŁ. Funding acquisition: KŁ. Methodology: KŁ, ARB. Data collection: KŁ, ARB, KF. Data analysis: KŁ. Data interpretation: KŁ. Writing— original draft preparation: Kł. Writing—review and editing: AVS. All authorshave read and agreed to the published version of the manuscript. Conflict of interest The authors declare no conflicts of interest that are directly relevantto the content of this article. REFERENCES 1 Collings TJ Diamond LE Barrett RS Timmins RG Hickey JT DU Moulin WS et al Strength and Biomechanical Risk Factors for Noncontact ACL Injury in Elite Female Footballers: A Prospective Study Med Sci Sports Exerc 2022 54 8 1242 51 35320148 10.1249/MSS.0000000000002908 2 Montalvo AM Schneider DK Yut L Webster KE Beynnon B Kocher MS et al “What’s my risk of sustaining an ACL injury while playing sports?” A systematic review with meta-analysis Br J Sports Med 2019 53 16 1003 12 29514822 10.1136/bjsports-2016-096274 PMC6561829 3 Freedman KB Glasgow MT Glasgow SG Bernstein J Anterior cruciate ligament injury and reconstruction among university students Clin Orthop 1998 356 208 12 10.1097/00003086-199811000-00028 9917686 4 Escamilla-Galindo VL Felipe JL Alonso-Callejo A Van-der-Horst R Torre-Combarros A de la Minafra P et al Return-to-play criteria based on infrared thermography during anterior cruciate ligament rehabilitation in football players Biol Sport 2024 42 2 161 7 40182730 10.5114/biolsport.2025.144295 PMC11963140 5 Niederer D Keller M Petersen W Mengis N Eberle C Guenther D et al Late-stage rehabilitation effects do not differ between quadriceps and hamstring tendon autograft after anterior cruciate ligament reconstruction: a multicentre propensity score-matched case-control intervention trial Biol Sport 2024 42 2 135 49 40182721 10.5114/biolsport.2025.142647 PMC11963125 6 Straub RK Powers CM Biomechanical predictors of primary ACL injury: A scoping review of prospective studies Gait Posture 2025 116 22 9 39603181 10.1016/j.gaitpost.2024.11.013 7 Ghorbani M Nouri H Heydarian M Mottaghitalab M Zarei H Lower limbs kinematic analysis during a jump landing task in soccer players with unilateral anterior cruciate ligament reconstruction BMC Sports Sci Med Rehabil 2024 16 1 221 39456100 10.1186/s13102-024-01012-2 PMC11515238 8 Siegel L Vandenakker-Albanese C Siegel D Anterior cruciate ligament injuries: anatomy, physiology, biomechanics, and management Clin J Sport Med Off J Can Acad Sport Med 2012 22 4 349 55 10.1097/JSM.0b013e3182580cd0 22695402 9 Astur DC Novaretti JV Cohen M Genetic and molecular factors and anterior cruciate ligament injuries: current concepts J ISAKOS 2017 2 3 123 6 10 Sun Z Cięszczyk P Humińska-Lisowska K Michałowska-Sawczyn M Yue S Genetic Determinants of the Anterior Cruciate Ligament Rupture in Sport: An Up-to-Date Systematic Review J Hum Kinet 2023 88 105 17 10.5114/jhk/163073 PMC10407318 37559763 11 Willard K Mannion S Saunders CJ Collins M September AV The interaction of polymorphisms in extracellular matrix genes and underlying miRNA motifs that modulate susceptibility to anterior cruciate ligament rupture J Sci Med Sport 2018 21 1 22 8 28927971 10.1016/j.jsams.2017.08.017 12 Darrieutort-Laffite C Weiss SN Nuss CA Newton JB Eekhoff JD Soslowsky LJ Decorin Knockdown Improves Aged Tendon Healing by Enhancing Recovery of Viscoelastic Properties, While Biglycan May Not Ann Biomed Eng 2025 53 3 622 33 39612017 10.1007/s10439-024-03612-y PMC11836163 13 Sun Z Bojarczuk A Cieszczyk P The COL27A1 and COL11A1 gene variants are not associated with the susceptibility to anterior cruciate ligament rupture in Polish athletes Balt J Health Phys Act [Internet] 2023 15 3 14 Lulińska E Żelazny J Lulińska A Grzywacz E Stroińska-Pluta A Sawczuk M et al Genetic variants and anterior cruciate ligament rupture – Elastin proteins gene and fibromodulin gene polymorphisms Balt J Health Phys Act [Internet] 2023 15 2 15 Kelemen LE Couch FJ Ahmed S Dunning AM Pharoah PD Easton DF et al Genetic variation in stromal proteins decorin and lumican with breast cancer: investigations in two case-control studies Breast Cancer Res 2008 10 6 R98 19036156 10.1186/bcr2201 PMC2656894 16 Mannion S Mtintsilana A Posthumus M van der merwe W Hobbs H Collins M et al Genes encoding proteoglycans are associated with the risk of anterior cruciate ligament ruptures Br J Sports Med 2014 48 10.1136/bjsports-2013-093201 24552666 17 Candela V Longo UG Berton A Salvatore G Forriol F de Sire A et al Genome-Wide Association Screens for Anterior Cruciate Ligament Tears J Clin Med 2024 13 8 2330 38673603 10.3390/jcm13082330 PMC11050965 18 Kaynak M Nijman F van Meurs J Reijman M Meuffels DE Genetic Variants and Anterior Cruciate Ligament Rupture: A Systematic Review Sports Med Auckl NZ 2017 47 8 1637 50 10.1007/s40279-017-0678-2 PMC5507974 28102489 19 Juneja SC Veillette C Defects in tendon, ligament, and enthesis in response to genetic alterations in key proteoglycans and glycoproteins: a review Arthritis 2013 2013 154812 24324885 10.1155/2013/154812 PMC3842050 20 Cięszczyk P Willard K Gronek P Zmijewski P Trybek G Gronek J et al Are genes encoding proteoglycans really associated with the risk of anterior cruciate ligament rupture? Biol Sport 2017 34 2 97 103 28566802 10.5114/biolsport.2017.64582 PMC5424448 21 Suijkerbuijk MAM Ponzetti M Rahim M Posthumus M Häger CK Stattin E et al Functional polymorphisms within the inflammatory pathway regulate expression of extracellular matrix components in a genetic risk dependent model for anterior cruciate ligament injuries J Sci Med Sport 2019 22 11 1219 25 31395468 10.1016/j.jsams.2019.07.012 22 Abbah SA Thomas D Browne S O’Brien T Pandit A Zeugolis DI Co-transfection of decorin and interleukin-10 modulates pro-fibrotic extracellular matrix gene expression in human tenocyte culture Sci Rep 2016 6 1 20922 26860065 10.1038/srep20922 PMC4748261 23 Beach ZM Dekhne MS Rodriguez AB Weiss SN Adams TH Adams SM et al Decorin knockdown is beneficial for aged tendons in the presence of biglycan expression Matrix Biol Plus 2022 15 100114 35818471 10.1016/j.mbplus.2022.100114 PMC9270257 24 Strocchi R De Pasquale V Facchini A Raspanti M Zaffagnini S Marcacci M Age-related changes in human anterior cruciate ligament (ACL) collagen fibrils Ital J Anat Embryol Arch Ital Anat Ed Embriologia 1996 101 4 213 20 9203869 25 Leahy TP Chenna SS Soslowsky LJ Dyment NA Focal adhesion kinase regulates tendon cell mechanoresponse and physiological tendon development FASEB J Off Publ Fed Am Soc Exp Biol 2024 38 17 e70050 10.1096/fj.202400151R PMC11522781 39259535 26 Dunkman AA Buckley MR Mienaltowski MJ Adams SM Thomas SJ Satchell L et al The tendon injury response is influenced by decorin and biglycan Ann Biomed Eng 2014 42 3 619 30 24072490 10.1007/s10439-013-0915-2 PMC3943488 27 Pechanec MY Boyd TN Baar K Mienaltowski MJ Adding exogenous biglycan or decorin improves tendon formation for equine peritenon and tendon proper cells in vitro BMC Musculoskelet Disord 2020 21 1 627 32967653 10.1186/s12891-020-03650-2 PMC7513506 28 Lu P Zhang GR Cai YZ Heng BC Ren H Wang LL et al Lentiviral-encoded shRNA silencing of proteoglycan decorin enhances tendon repair and regeneration within a rat model Cell Transplant 2013 22 9 1507 17 23295185 10.3727/096368912X661292 29 Gubbiotti MA Vallet SD Ricard-Blum S Iozzo RV Decorin interacting network: A comprehensive analysis of decorinbinding partners and their versatile functions Matrix Biol J Int Soc Matrix Biol 2016 55 7 10.1016/j.matbio.2016.09.009 PMC6938589 27693454 30 Haslauer CM Proffen BL Johnson VM Murray MM Expression of modulators of extracellular matrix structure after anterior cruciate ligament injury Wound Repair Regen Off Publ Wound Heal Soc Eur Tissue Repair Soc 2014 22 1 103 10 10.1111/wrr.12130 PMC3888089 24393158 31 Smith HC Vacek P Johnson RJ Slauterbeck JR Hashemi J Shultz S et al Risk factors for anterior cruciate ligament injury: a review of the literature-part 2: hormonal, genetic, cognitive function, previous injury, and extrinsic risk factors Sports Health 2012 4 2 155 61 23016083 10.1177/1941738111428282 PMC3435909 ",
  "metadata": {
    "Title of this paper": "Risk factors for anterior cruciate ligament injury: a review of the literature-part 2: hormonal, genetic, cognitive function, previous injury, and extrinsic risk factors",
    "Journal it was published in:": "Biology of Sport",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490320/"
  }
}