{
  "title": "Paper_954",
  "abstract": "pmc Toxics Toxics 3287 toxics toxics Toxics 2305-6304 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473512 PMC12473512.1 12473512 12473512 41012357 10.3390/toxics13090736 toxics-13-00736 1 Article Methamphetamine Exposure Induces Neuronal Programmed Necrosis by Permeabilizing Mitochondria via the RIPK1–RIPK3–MLKL Axis https://orcid.org/0009-0009-4364-7131 Zhou Peng Methodology Writing – original draft 1 2 † Xuan Jiankang Software 1 † Xu Weixiao Formal analysis 1 † An Di Data curation 1 Meng Sining Validation 1 Zhang Hongchao Investigation 3 Hu Miaoyang Investigation 4 Hui Wanqingyang 5 Wang Yifei Visualization 1 Cheng Jie Resources 3 Xiong Jianping Supervision 3 Wang Jun Writing – review & editing Funding acquisition 3 5 * Chen Xufeng Writing – review & editing Funding acquisition 1 * Caudle Michael Academic Editor 1 pengzhou@stu.njmu.edu.cn wangyifeivia@outlook.com 2 3 4 5 * wangjun@njmu.edu.cn cxfyx@njmu.edu.cn † These authors contributed equally to this work. 30 8 2025 9 2025 13 9 497672 736 29 7 2025 24 8 2025 27 8 2025 30 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Methamphetamine (Meth), a psychostimulant drug of the amphetamine type, is widely abused and highly neurotoxic. Meth exposure leads to neuronal necroptosis, and the mitochondrial dysfunction may be involved. However, the underlying mechanisms remain poorly understood. Here, we found that Meth significantly elicited the formation of the RIPK1–RIPK3–MLKL necrosome complex. Intriguingly, the activated MLKL (p-MLKL) translocated to the mitochondrial membrane and displayed pore-forming activity, manifesting as the penetration of MLKL in the cell membranes of the mitochondria, which caused decreased mitochondrial membrane potential, ATP generation, and mitochondrial DNA (mtDNA) and increased mitochondrial ROS (mtROS) generation, which finalized neuronal necroptosis. Notably, MLKL activation and translocation seem to depend on the RIPK1–RIPK3 axis since these adverse effects can be substantially ameliorated by disruption of the necrosome complex formation by the necroptotic inhibitor 1 (Nec-1), which also markedly impeded the MLKL mitochondrial membrane translocation. Finally, to delineate the effects of pore formation-associated ROS generation, specific blockage of mtROS retarded the Meth-induced neuronal necroptosis. In conclusion, our study reveals for the first time that MLKL mitochondrial membrane translocation may be involved in Meth-induced neuronal necroptosis. Therefore, impeding MLKL translocation might provide a novel therapeutic strategy for Meth-induced neurotoxicity. Meth Mitochondrial dysfunction neuronal necroptosis RIPK1–RIPK3–MLKL axis National Natural Science Foundation of China 82472240 82473664 Major Projects of Natural Science Foundation in Jiangsu Higher Education Institutions of China 22KJA330001 Young and Middle-aged Academic Leaders of “Blue Project” 2022-29 This study was supported by the National Natural Science Foundation of China (82472240, 82473664), the Major Projects of Natural Science Foundation in Jiangsu Higher Education Institutions of China (22KJA330001), and the Young and Middle-aged Academic Leaders of “Blue Project” in Jiangsu Province (2022-29). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Methamphetamine (Meth), an amphetamine-type psychostimulant abused globally, presents a significant public health concern [ 1 2 3 4 5 6 7 8 9 10 11 12 13 14 Necrosis was previously considered a form of non-programmed cell death, distinct from apoptosis regulated by caspase cascade reactions [ 15 16 8 7 During the process of necroptosis, receptor-interacting protein kinase 1 (RIPK1) plays a crucial initiating role. It interacts with receptor-interacting protein kinase 3 (RIPK3) through its kinase domain, leading to the phosphorylation of RIPK3, then promotes the formation of the RIPK1–RIPK3 protein complex, serving as a platform to stimulate the phosphorylation of mixed-lineage kinase domain-like protein (MLKL). The phosphorylated MLKL (p-MLKL) undergoes a conformational change, promoting its oligomerization, with a high affinity for lipid bilayers and a tendency to insert into the membrane to form pores, causing membrane rupture [ 17 18 Historically, mitochondria have been regarded as key effectors of necroptotic signals, as mitochondrial swelling and damage have been observed in tumor necrosis factor (TNF)-induced RIPK3-mediated cell death [ 19 20 21 22 23 24 25 26 27 28 29 30 31 In macrophages and fibroblasts, mitochondria-derived reactive oxygen species (mtROS) contribute to necroptosis via multiple mechanisms, including promoting RIPK1 autophosphorylation and necroptotic signaling. RIPK3 interacts with MLKL-dependent mitochondrial pyruvate dehydrogenase complexes, stimulating oxidative phosphorylation and mtROS production to promote necroptosis [ 32 33 Noteworthily, previous studies have mainly focused on the role of MLKL in the plasma membrane, given the structural similarities between the plasma and mitochondrial membranes. In the present study, MLKL was selected as a key investigative target based on its well-characterized function as the terminal executor of necroptosis, where it mediates membrane disruption through its pore-forming capability in the plasma membrane, particularly in mitochondrial membranes in the context of Meth-induced neurotoxicity. Therefore, the present work extends a novel insight to existing knowledge on Meth’s neurotoxic mechanisms, by the translocation of MLKL to the mitochondrial membrane, contributing to mitochondrial dysfunction and neuronal necroptosis. Additionally, the pharmacological inhibition of RIPK1 and mtROS was exploited to verify the deteriorated effects of RIPK1–RIPK3 signaling in mitochondrial damage, and the mitochondria-derived neuronal necroptosis mediated by Meth was discussed as well. 2. Materials and Methods 2.1. Reagents Meth (National Institutes for Food and Drug Control, China) was dissolved in sterile saline (0.9% NaCl) to generate a concentration gradient (0, 100, 300, 600, 900 μM). Necrostatin-1 (Nec-1; HY-15760, MedChemExpress, Beijing, China) was prepared as a 10 mM stock in DMSO and diluted to working concentrations (20 μM) with solvent controls containing ≤ 0.1% DMSO. MitoTEMPO (mtT; ab144644, Abcam, Boston, MA, USA) was dissolved in ultrapure water (50 mM stock) and used at 5 μM, with matched water controls. All treatments were administered after neuronal maturation (about 10 days). 2.2. Primary Cortical Cell Culture The primary cortical cells were cultured as in our previous report [ 5 2 2.3. Hoechst 33342/Propidium Iodide (PI) Dual Staining PI-positive cells were considered dead as PI uptake indicates the loss of cell membrane integrity. For morphological analysis, neurons were incubated with PI (ST1569, Beyotime, Shanghai, China) at a concentration of 2 μg/mL in the culture medium for 15 min at 37 °C. Following incubation, unbound PI was not removed by washing to maintain staining integrity during observation. Fluorescence images were then acquired using a fluorescence microscope (Carl Zeiss LSM900, Jena, Germany) with excitation at 535 nm and emission detection at 617 nm. 2.4. Lactate Dehydrogenase (LDH) Detection LDH release was quantified using a commercial LDH Cytotoxicity Assay Kit (C0019S, Beyotime, Shanghai, China) to assess cellular injury. Briefly, neurons were treated with Meth according to experimental groupings. Following treatment, culture supernatants were collected via centrifugation and transferred to a fresh 96-well plate (100 μL/well). LDH detection working solution (10 μL) was added to each supernatant-containing well, followed by incubation at 37 °C for 20 min to facilitate the enzymatic reaction. Absorbance was measured at 450 nm by a microplate reader. LDH concentrations were determined by normalizing sample absorbance values against a concurrently generated standard curve. 2.5. Mitochondrial Membrane Potential Detection Neurons were washed with PBS and incubated in the JC-1 staining buffer (5×) (C2005S, Beyotime, Shanghai, China) for 15 min at 37 °C. After washing with PBS, cells were subjected to confocal laser scanning microscopy (Carl Zeiss LSM900, Jena, Germany). 2.6. MitoROS Production Assay MitoROS production in neurons was assessed using the MitoSOX Red reagent (M36009, Thermo, Waltham, MA, USA). Staining with 2 μM MitoSOX reagent was performed in live primary neurons for 10 min at 37 °C. The fluorescence was examined using laser scanning microscopy (Carl Zeiss LSM900, Jena, Germany), and pictures were randomly captured for each group. The mean fluorescence intensity of these pixels was calculated using ImageJ (Version 1.53, NIH, USA). 2.7. Quantitative RT-PCR Total RNA was extracted from cell lysates using TRIzol (343,903, Thermo, Waltham, MA, USA) reagent according to the manufacturer’s instructions. A NanoDrop spectrophotometer (NanoDrop 2000, Thermo, Waltham, MA, USA) was used to determine the quantified total RNA. Relative mRNA levels were detected using SYBR Green Supermix (11201ES08, Yeasen Biotech Co., Ltd., Shanghai, China). Changes in fluorescence were monitored on a LightCycler 480 (Roche). GAPDH was used as the internal control. The sequences of the primers used for RT-PCR are listed ( Supplemental Table S1 2.8. mtDNA Copy Number The residual aqueous layer on the intermediate layer was removed according to the RNA isolation protocol (Accurate Biology, China), and the samples were mixed by adding 0.3 mL of anhydrous ethanol for every 1 mL of TRIzol (343,903, Thermo, Waltham, MA, USA) as initially done, with repeated inversion. The samples were then centrifuged at 2000× g g 34 35 2.9. ATP Detection Cellular ATP content was quantified using a commercial firefly-luciferase-based ATP assay kit (ATPlite, S0027; Beyotime, Shanghai, China) following manufacturer protocols. Briefly, cells were lysed on ice for 30 min using ice-cold lysis buffer provided with the kit. Lysates were centrifuged (12,000× g 2.10. Western Blot Assay As described previously [ 5 2.11. Immunofluorescence Analysis The neurons were incubated with the diluted MitoTracker (Invitrogen, Carlsbad, CA, USA) at 37 °C for 15 min, after washing, fixed with ice Methanol for 15 min, and permeabilized with 0.1% Triton X-100. Non-specific binding was blocked by incubation in 10% goat serum at room temperature for 1 h. Samples were then incubated with the following primary antibodies: p-MLKL (ab196436, Abcam, Boston, MA, USA); MLKL (ab184718, Abcam, Boston, MA, USA); RIPK3 (sc-374639, Santa Cruz, CA, USA) overnight at 4 °C, and then washed with PBS. Signals were developed with Alexa fluorescence antibodies ( P11047 L21416 2.12. Quantitative Analysis Data are presented as mean ± standard deviation. Data were analyzed using the Student’s t p 3. Results 3.1. Methamphetamine Induces Necroptosis in Primary Neurons To assay the Meth-induced necroptosis in primary neurons, PI staining and LDH assay were applied. As expected, Meth treatment elicited a striking plasma membrane rupture and cellular content leakage. To address the specific toxic effects of Meth, the dose- and time-dependent responses were investigated. It showed that, after Meth exposure, the number of PI-positive cells significantly increased with the peak response at 900 μM. In parallel, this dosage elicited a significant increase in LDH release ( Figure 1 50 36 37 Figure 1 Figure 1 Figure 1 Supplementary Figure S1 MLKL, a terminal-known obligate effector in necroptosis, plays a key role in the formation of transmembrane pores and the leakage of cell contents [ 38 Figure 1 Figure 1 3.2. Methamphetamine Induces Mitochondrial Dysfunction To investigate how Meth induces neuronal necroptosis, mitochondrial integrity and membrane potential were examined. Using the mitochondrial transmembrane potential-sensitive probe JC-1 and the mitochondrial superoxide indicator MitoSOX, striking alterations in mitochondrial morphology were observed via confocal laser scanning microscopy (LSM900). Specifically, Meth treatment induced a dramatic shift from predominantly rod-shaped/linear mitochondria in control neurons to fragmented, rounded organelles ( Figure 2 Figure 2 Figure 2 Figure 2 Figure 2 Figure 2 3.3. The RIPK1–RIPK3 Axis Is Involved in Meth-Induced Mitochondrial Damage To gain more mechanistic insight into the neuronal necroptosis of Meth, the roles of the RIPK1–RIPK3 axis were explored. Therefore, Nec-1, one inhibitor for blockage of RIPK1–RIPK3 interaction, was applied ( Figure 3 Figure 3 Figure 3 Figure 3 Figure 3 3.4. MLKL Activation and Mitochondrial Membrane Translocation After Meth Treatment Having investigated the combination of the critical roles of the RIPK1–RIPK3 axis in neuronal necroptosis and the MMP decrease in Meth-induced neuronal cells, we then moved to the downstream effector protein MLKL, which is known for forming pores in the plasma membrane which impairs membrane integrity [ 17 Figure 4 Figure 4 3.5. Mitochondrial ROS Amplifies Neuronal Necroptosis Induced by Meth Since the aforementioned Meth induced the penetration of the activated MLKL in the mitochondrial membrane, we then assessed the association between the impairment of the membranal integrity and ROS generation. Previous research demonstrated that mitochondrial ROS contributes to initiating neuronal necroptosis, leading to the activation of necrosome formation. To investigate whether the Meth-induced neuronal necroptosis ascribes to the mitochondrial ROS, MitoTEMPO, a mitochondrial ROS scavenger, was applied. As expected, Meth treatment resulted in an increase in PI-positive cells ( Figure 5 Figure 5 Figure 5 Figure 5 4. Discussion In the present study, we first demonstrated that the RIPK1–RIPK3–MLKL axis is involved in Meth-induced neuronal necroptosis via an unrecognized MLKL translocation to the mitochondrial membrane which penetrated into the membrane of the mitochondria, which led to mtROS increase and decreases in MMP, ATP production, and mtDNA in neuronal cells. Thus, targeting MLKL might provide a novel intervention strategy for Meth-induced neuronal death. The nervous system is one of the most critical targets of Meth. Meth abusers are at increased risk of developing memory impairment, depression, Parkinson’s disease, Alzheimer’s disease, and other neuropsychiatric and cognitive disorders associated with neuronal damage [ 39 40 41 42 43 44 Our data suggested that Meth treatment leads to an increase in TNF-α, RIPK1, RIPK3, and MLKL expression, a elevated percentage of PI-positive cells as quantified by flow cytometry ( Supplementary Figure S2 Mitochondria have long been regarded as the primary regulators of regulated cell death (RCD) [ 29 45 46 47 48 49 50 + Recent studies have shown that p-MLKL translocates to mitochondria and induces a microtubule-dependent release of mitochondrial DNA (mtDNA), which is ascribed to the mitochondrial “membrane leak”, while suppression of MLKL formation restricts this process [ 51 25 52 53 Interestingly, the MLKL–mtROS signaling seems to form a positive feedback loop since the mitochondrial ROS inhibitors also ameliorated mitochondrial dysfunction and the active MLKL-associated necroptosis. The reason for this is unknown; we suspect that mitochondrial ROS contribute to necroptosis by facilitating RIPK1 phosphorylation, culminating in its activation and subsequent necroptosis [ 54 55 56 32 57 58 59 60 However, the current study also has some potential limitations. First, we can not rule out the effects of Gasdermin-D in Meth-induced mitochondrial membrane impairments since its similar characteristics of “hole-making” in the membrane, and more research is needed in future work. Second, although we used pharmacological inhibition of the RIPK1–RIPK3–MLKL axis, there still may be the possibility of off-target effects for RIPK1–RIPK3; therefore, the siRNA assay will be performed in future work to specifically knockdown RIPK1, RIPK3, and MLKL and illustrate the roles of the RIPK1–RIPK3–MLKL axis in Meth-induced neurotoxicity. For clinical treatment, the therapeutic potential of targeting MLKL is significant. Small molecule inhibitors that specifically block MLKL translocation to the mitochondrial membrane could be developed. However, the specificity of these inhibitors needs to be carefully evaluated to avoid off-target and side effects. In summary, our data reveal an unrecognized Meth-induced neuronal necroptosis via RIPK1–RIPK3-mediated MLKL translocation to the mitochondrial membrane ( Figure 6 5. Conclusions Meth induces necroptosis in primary neuronal cells via mitochondrial dysfunction, especially the “hole-making” characteristic of MLKL in the mitochondrial membrane; therefore, targeting the RIPK1–RIPK3–MLKL axis may provide novel therapeutic ways for mitigating Meth-induced neuronal death. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/toxics13090736/s1 Figure S1 Figure S2 p p p p Author Contributions P.Z., J.X. (Jiankang Xuan), and W.X.: methodology, formal analysis, data curation, and writing—original draft; D.A., S.M., and Y.W.: software, validation, and visualization; H.Z., M.H., and W.H.: investigation; J.C. and J.X. (Jianping Xiong): resources and supervision; J.W. and X.C.: funding acquisition and writing—review and editing. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Institutional Review Board Statement: The animal study protocol was approved by the Ethics Committee of Animal Care and Experimentation of Europe and the Institutional Animal Care and Use Committee (IACUC) of Nanjing Medical University (approval no. 2302024). Informed Consent Statement Not applicable. Data Availability Statement The datasets used and/or analyzed during the current study are available from the corresponding author or on reasonable request. Conflicts of Interest The authors declare that they have no conflicts of interest. References 1. Chacho N.M. Adams E. Stairs D.J. Enrichment-induced differences in methamphetamine drug discrimination in male rats Pharmacol. Biochem. Behav. 2019 179 80 88 10.1016/j.pbb.2019.02.008 30794848 2. Zhang K. Chen L. Yang J. Liu J. Li J. Liu Y. Li X. Chen L. Hsu C. Zeng J. Gut microbiota-derived short-chain fatty acids ameliorate methamphetamine-induced depression- and anxiety-like behaviors in a Sigmar-1 receptor-dependent manner Acta Pharm. Sin. B 2023 13 4801 4822 10.1016/j.apsb.2023.09.010 38045052 PMC10692394 3. Jayanthi S. Daiwile A.P. Cadet J.L. Neurotoxicity of methamphetamine: Main effects and mechanisms Exp. Neurol. 2021 344 113795 10.1016/j.expneurol.2021.113795 34186102 PMC8338805 4. Kevil C.G. Goeders N.E. Woolard M.D. Bhuiyan M.S. Dominic P. Kolluru G.K. Arnold C.L. Traylor J.G. Orr A.W. Methamphetamine Use and Cardiovascular Disease Arterioscler. Thromb. Vasc. Biol. 2019 39 1739 1746 10.1161/ATVBAHA.119.312461 31433698 PMC6709697 5. Wang X. Hu M. Chen J. Lou X. Zhang H. Li M. Cheng J. Ma T. Xiong J. Gao R. Key roles of autophagosome/endosome maturation mediated by Syntaxin17 in methamphetamine-induced neuronal damage in mice Mol. Med. 2024 30 4 10.1186/s10020-023-00765-9 38172666 PMC10765725 6. Xu H. Zhu Y. Chen X. Yang T. Wang X. Song X. Xie X. Hu M. Jiang L. Cheng J. Mystery of methamphetamine-induced autophagosome accumulation in hippocampal neurons: Loss of syntaxin 17 in defects of dynein-dynactin driving and autophagosome-late endosome/lysosome fusion Arch. Toxicol. 2021 95 3263 3284 10.1007/s00204-021-03131-y 34374793 7. Zhao X. Lu J. Chen X. Gao Z. Zhang C. Chen C. Qiao D. Wang H. Methamphetamine exposure induces neuronal programmed necrosis by activating the receptor-interacting protein kinase 3-related signalling pathway FASEB J. 2021 35 e21561 10.1096/fj.202100188R 33864423 8. Guo L.M. Wang Z. Li S.P. Wang M. Yan W.T. Liu F.X. Wang C.D. Zhang X.D. Chen D. Yan J. RIP3/MLKL-mediated neuronal necroptosis induced by methamphetamine at 39 °C Neural Regen. Res. 2020 15 865 874 10.4103/1673-5374.268902 31719251 PMC6990769 9. Wang Y. Ma H. Huang J. Yao Z. Yu J. Zhang W. Zhang L. Wang Z. Zhuang C. Discovery of bardoxolone derivatives as novel orally active necroptosis inhibitors Eur. J. Med. Chem. 2021 212 113030 10.1016/j.ejmech.2020.113030 33248849 10. Zhang S. Tang M.-B. Luo H.-Y. Shi C.-H. Xu Y.-M. Necroptosis in neurodegenerative diseases: A potential therapeutic target Cell Death Dis. 2017 8 e2905 10.1038/cddis.2017.286 28661482 PMC5520937 11. Yuan J. Amin P. Ofengeim D. Necroptosis and RIPK1-mediated neuroinflammation in CNS diseases Nat. Rev. Neurosci. 2019 20 19 33 10.1038/s41583-018-0093-1 30467385 PMC6342007 12. Thadathil N. Nicklas E.H. Mohammed S. Lewis T.L. Jr. Richardson A. Deepa S.S. Necroptosis increases with age in the brain and contributes to age-related neuroinflammation Geroscience 2021 43 2345 2361 10.1007/s11357-021-00448-5 34515928 PMC8599532 13. Dong Y. Yu H. Li X. Bian K. Zheng Y. Dai M. Feng X. Sun Y. He Y. Yu B. Hyperphosphorylated tau mediates neuronal death by inducing necroptosis and inflammation in Alzheimer’s disease J. Neuroinflamm. 2022 19 205 10.1186/s12974-022-02567-y PMC9377071 35971179 14. Oñate M. Catenaccio A. Salvadores N. Saquel C. Martinez A. Moreno-Gonzalez I. Gamez N. Soto P. Soto C. Hetz C. The necroptosis machinery mediates axonal degeneration in a model of Parkinson disease Cell Death Differ. 2020 27 1169 1185 10.1038/s41418-019-0408-4 31591470 PMC7205895 15. Galluzzi L. Kroemer G. Necroptosis: A specialized pathway of programmed necrosis Cell 2008 135 1161 1163 10.1016/j.cell.2008.12.004 19109884 16. Bertheloot D. Latz E. Franklin B.S. Necroptosis, pyroptosis and apoptosis: An intricate game of cell death Cell. Mol. Immunol. 2021 18 1106 1121 10.1038/s41423-020-00630-3 33785842 PMC8008022 17. Yang C. He X. Wang H. Lin Z. Hou W. Lu Y. Hu S. Li M. Single-Molecule Monitoring of Membrane Association of the Necroptosis Executioner MLKL with Discernible Anchoring and Insertion Dynamics Nano Lett. 2023 23 4770 4777 10.1021/acs.nanolett.2c05062 37191260 18. Wu Z. Henning L. Steinhäuser C. Bedner P. Targeting necroptosis protects against astrocyte death and hippocampal sclerosis in experimental temporal lobe epilepsy J. Physiol. 2025 Online ahead of print 10.1113/JP287565 40629542 19. He S. Wang L. Miao L. Wang T. Du F. Zhao L. Wang X. Receptor interacting protein kinase-3 determines cellular necrotic response to TNF-α Cell 2009 137 1100 1111 10.1016/j.cell.2009.05.021 19524512 20. Petrie E.J. Sandow J.J. Jacobsen A.V. Smith B.J. Griffin M.D.W. Lucet I.S. Dai W. Young S.N. Tanzer M.C. Wardak A. Conformational switching of the pseudokinase domain promotes human MLKL tetramerization and cell death by necroptosis Nat. Commun. 2018 9 2422 10.1038/s41467-018-04714-7 29930286 PMC6013482 21. Iwata R. Casimir P. Erkol E. Boubakar L. Planque M. Gallego López I.M. Ditkowska M. Gaspariunaite V. Beckers S. Remans D. Mitochondria metabolism sets the species-specific tempo of neuronal development Science 2023 379 eabn4705 10.1126/science.abn4705 36705539 22. Pfanner N. Warscheid B. Wiedemann N. Mitochondrial proteins: From biogenesis to functional networks Nat. Rev. Mol. Cell Biol. 2019 20 267 284 10.1038/s41580-018-0092-0 30626975 PMC6684368 23. Mehta M.M. Weinberg S.E. Chandel N.S. Mitochondrial control of immunity: Beyond ATP Nat. Rev. Immunol. 2017 17 608 620 10.1038/nri.2017.66 28669986 24. Miao R. Jiang C. Chang W.Y. Zhang H. An J. Ho F. Chen P. Zhang H. Junqueira C. Amgalan D. Gasdermin D permeabilization of mitochondrial inner and outer membranes accelerates and enhances pyroptosis Immunity 2023 56 2523 2541.e8 10.1016/j.immuni.2023.10.004 37924812 PMC10872579 25. Deragon M.A. McCaig W.D. Truong P.V. Metz K.R. Carron K.A. Hughes K.J. Knapp A.R. Dougherty M.J. LaRocca T.J. Mitochondrial Trafficking of MLKL, Bak/Bax, and Drp1 Is Mediated by RIP1 and ROS which Leads to Decreased Mitochondrial Membrane Integrity during the Hyperglycemic Shift to Necroptosis Int. J. Mol. Sci. 2023 24 8609 10.3390/ijms24108609 37239951 PMC10218403 26. Parameyong A. Charngkaew K. Govitrapong P. Chetsawang B. Melatonin attenuates methamphetamine-induced disturbances in mitochondrial dynamics and degeneration in neuroblastoma SH-SY5Y cells J. Pineal Res. 2013 55 313 323 10.1111/jpi.12078 23889188 27. Teodorof-Diedrich C. Spector S.A. Human Immunodeficiency Virus Type 1 and Methamphetamine-Mediated Mitochondrial Damage and Neuronal Degeneration in Human Neurons J. Virol. 2020 94 e00924-20 10.1128/JVI.00924-20 32796068 PMC7527047 28. Brown J.M. Quinton M.S. Yamamoto B.K. Methamphetamine-induced inhibition of mitochondrial complex II: Roles of glutamate and peroxynitrite J. Neurochem. 2005 95 429 436 10.1111/j.1471-4159.2005.03379.x 16086684 29. Park J.H. Seo Y.H. Jang J.H. Jeong C.H. Lee S. Park B. Asiatic acid attenuates methamphetamine-induced neuroinflammation and neurotoxicity through blocking of NF-kB/STAT3/ERK and mitochondria-mediated apoptosis pathway J. Neuroinflamm. 2017 14 240 10.1186/s12974-017-1009-0 PMC5725763 29228978 30. Hosseini M.J. Arabiyan A. Mobassem S. Ghavimi H. Metformin attenuates depressive-like behaviour of methamphetamine withdrawal in mice: A mechanistic approach World J. Biol. Psychiatry 2023 24 209 222 10.1080/15622975.2022.2086294 35673936 31. Polvat T. Prasertporn T. Na Nakorn P. Pannengpetch S. Suwanjang W. Panmanee J. Ngampramuan S. Cornish J.L. Chetsawang B. Proteomic Analysis Reveals the Neurotoxic Effects of Chronic Methamphetamine Self-Administration-Induced Cognitive Impairments and the Role of Melatonin-Enhanced Restorative Process during Methamphetamine Withdrawal J. Proteome Res. 2023 22 3348 3359 10.1021/acs.jproteome.3c00502 37676068 PMC10563163 32. Yang Z. Wang Y. Zhang Y. He X. Zhong C.Q. Ni H. Chen X. Liang Y. Wu J. Zhao S. RIP3 targets pyruvate dehydrogenase complex to increase aerobic respiration in TNF-induced necroptosis Nat. Cell Biol. 2018 20 186 197 10.1038/s41556-017-0022-y 29358703 33. Irrinki K.M. Mallilankaraman K. Thapa R.J. Chandramoorthy H.C. Smith F.J. Jog N.R. Gandhirajan R.K. Kelsen S.G. Houser S.R. May M.J. Requirement of FADD, NEMO, and BAX/BAK for aberrant mitochondrial function in tumor necrosis factor alpha-induced necrosis Mol. Cell Biol. 2011 31 3745 3758 10.1128/MCB.05303-11 21746883 PMC3165716 34. Chomczynski P. Sacchi N. The single-step method of RNA isolation by acid guanidinium thiocyanate–phenol–chloroform extraction: Twenty-something years on Nature Protoc. 2006 1 581 585 10.1038/nprot.2006.83 17406285 35. Chieffi Baccari G. Falvo S. Di Fiore M.M. Cioffi F. Giacco A. Santillo A. High-fat diet affects autophagy and mitochondrial compartment in rat Harderian gland J. Exp. Zool. A Ecol. Integr. Physiol. 2022 337 1025 1038 10.1002/jez.2646 35927786 36. Liu Y. Wen D. Gao J. Xie B. Yu H. Shen Q. Zhang J. Jing W. Cong B. Ma C. Methamphetamine induces GSDME-dependent cell death in hippocampal neuronal cells through the endoplasmic reticulum stress pathway Brain Res. Bull. 2020 162 73 83 10.1016/j.brainresbull.2020.06.005 32544512 37. Coelho-Santos V. Gonçalves J. Fontes-Ribeiro C. Silva A.P. Prevention of methamphetamine-induced microglial cell death by TNF-α and IL-6 through activation of the JAK-STAT pathway J. Neuroinflamm. 2012 9 103 10.1186/1742-2094-9-103 PMC3391183 22642790 38. Zhan C. Huang M. Yang X. Hou J. MLKL: Functions beyond serving as the Executioner of Necroptosis Theranostics 2021 11 4759 4769 10.7150/thno.54072 33754026 PMC7978304 39. Chen Y. Zhang J. Sun Y. The relationship between childhood abuse and depression in a sample of Chinese people who use methamphetamine Int. J. Clin. Health Psychol. 2019 19 181 188 10.1016/j.ijchp.2019.06.003 31516496 PMC6732768 40. Huang E. Huang H. Guan T. Liu C. Qu D. Xu Y. Yang J. Yan L. Xiong Y. Liang T. Involvement of C/EBPβ-related signaling pathway in methamphetamine-induced neuronal autophagy and apoptosis Toxicol. Lett. 2019 312 11 21 10.1016/j.toxlet.2019.05.003 31059759 41. Wang X. Hu M. Wu W. Lou X. Gao R. Ma T. Dheen S.T. Cheng J. Xiong J. Chen X. Indole derivatives ameliorated the methamphetamine-induced depression and anxiety via aryl hydrocarbon receptor along “microbiota-brain” axis Gut Microbes 2025 17 2470386 10.1080/19490976.2025.2470386 39996473 PMC11864316 42. Cadet J.L. Jayanthi S. Deng X. Methamphetamine-induced neuronal apoptosis involves the activation of multiple death pathways. Review Neurotox. Res. 2005 8 199 206 10.1007/BF03033973 16371314 43. Cadet J.L. Krasnova I.N. Jayanthi S. Lyles J. Neurotoxicity of substituted amphetamines: Molecular and cellular mechanisms Neurotox. Res. 2007 11 183 202 10.1007/BF03033567 17449459 44. Cai D. Huang E. Luo B. Yang Y. Zhang F. Liu C. Lin Z. Xie W.B. Wang H. Nupr1/Chop signal axis is involved in mitochondrion-related endothelial cell apoptosis induced by methamphetamine Cell Death Dis. 2016 7 e2161 10.1038/cddis.2016.67 27031958 PMC4823965 45. Bonora M. Giorgi C. Pinton P. Molecular mechanisms and consequences of mitochondrial permeability transition Nat. Rev. Mol. Cell Biol. 2022 23 266 285 10.1038/s41580-021-00433-y 34880425 46. Galluzzi L. Yamazaki T. Kroemer G. Linking cellular stress responses to systemic homeostasis Nat. Rev. Mol. Cell Biol. 2018 19 731 745 10.1038/s41580-018-0068-0 30305710 47. Xu C. Wu J. Wu Y. Ren Z. Yao Y. Chen G. Fang E.F. Noh J.H. Liu Y.U. Wei L. TNF-α-dependent neuronal necroptosis regulated in Alzheimer’s disease by coordination of RIPK1-p62 complex with autophagic UVRAG Theranostics 2021 11 9452 9469 10.7150/thno.62376 34646380 PMC8490500 48. Apaijai N. Jinawong K. Singhanat K. Jaiwongkam T. Kerdphoo S. Chattipakorn S.C. Chattipakorn N. Necrostatin-1 reduces cardiac and mitochondrial dysfunction in prediabetic rats J. Endocrinol. 2021 251 27 39 10.1530/JOE-21-0134 34265741 49. Majdi A. Aoudjehane L. Ratziu V. Islam T. Afonso M.B. Conti F. Mestiri T. Lagouge M. Foufelle F. Ballenghien F. Inhibition of receptor-interacting protein kinase 1 improves experimental non-alcoholic fatty liver disease J. Hepatol. 2020 72 627 635 10.1016/j.jhep.2019.11.008 31760070 50. Ouyang Y. Wen L. Armstrong J.A. Chvanov M. Latawiec D. Cai W. Awais M. Mukherjee R. Huang W. Gough P.J. Protective Effects of Necrostatin-1 in Acute Pancreatitis: Partial Involvement of Receptor Interacting Protein Kinase 1 Cells 2021 10 1035 10.3390/cells10051035 33925729 PMC8145347 51. Baik J.Y. Liu Z. Jiao D. Kwon H.-J. Yan J. Kadigamuwa C. Choe M. Lake R. Kruhlak M. Tandon M. ZBP1 not RIPK1 mediates tumor necroptosis in breast cancer Nat. Commun. 2021 12 2666 10.1038/s41467-021-23004-3 33976222 PMC8113527 52. Jayanthi S. Deng X. Bordelon M. McCoy M.T. Cadet J.L. Methamphetamine causes differential regulation of pro-death and anti-death Bcl-2 genes in the mouse neocortex FASEB J. 2001 15 1745 1752 10.1096/fj.01-0025com 11481222 53. Liu S. Perez P. Sun X. Chen K. Fatirkhorani R. Mammadova J. Wang Z. MLKL polymerization-induced lysosomal membrane permeabilization promotes necroptosis Cell Death Differ. 2024 31 40 52 10.1038/s41418-023-01237-7 37996483 PMC10782024 54. Permpoonputtana K. Govitrapong P. The anti-inflammatory effect of melatonin on methamphetamine-induced proinflammatory mediators in human neuroblastoma dopamine SH-SY5Y cell lines Neurotox. Res. 2013 23 189 199 10.1007/s12640-012-9350-7 22903344 55. Schenk B. Fulda S. Reactive oxygen species regulate Smac mimetic/TNFα-induced necroptotic signaling and cell death Oncogene 2015 34 5796 5806 10.1038/onc.2015.35 25867066 56. Zhang Y. Su S.S. Zhao S. Yang Z. Zhong C.Q. Chen X. Cai Q. Yang Z.H. Huang D. Wu R. RIP1 autophosphorylation is promoted by mitochondrial ROS and is essential for RIP3 recruitment into necrosome Nat. Commun. 2017 8 14329 10.1038/ncomms14329 28176780 PMC5309790 57. An D. Zhang C. Zhou P. Wang Y. Meng S. Chen Y. Xu W. Xuan J. Xiong J. Cheng J. Cleaving PINK1 or PGAM5? Involvement of PARL in Methamphetamine-Induced Excessive Mitophagy and Neuronal Necroptosis CNS Neurosci. Ther. 2025 31 e70293 10.1111/cns.70293 40013375 PMC11865887 58. Lian C.Y. Xia W.H. Sun M.C. Wan X.M. Zhou X.L. Wang L. Cadmium targeting MLKL-Drp1 axis to trigger mitochondrial oxidative stress contributes to necroinflammation in rat kidney J. Adv. Res. 2025 Online ahead of print 10.1016/j.jare.2025.05.055 40460938 59. Robichaux D.J. Harata M. Murphy E. Karch J. Mitochondrial permeability transition pore-dependent necrosis J. Mol. Cell. Cardiol. 2023 174 47 55 10.1016/j.yjmcc.2022.11.003 36410526 PMC9868081 60. Weindel C.G. Martinez E.L. Zhao X. Mabry C.J. Bell S.L. Vail K.J. Coleman A.K. VanPortfliet J.J. Zhao B. Wagner A.R. Mitochondrial ROS promotes susceptibility to infection via gasdermin D-mediated necroptosis Cell 2022 185 3214 3231.e23 10.1016/j.cell.2022.06.038 35907404 PMC9531054 Figure 1 Neuronal necroptosis induced by Meth. ( A B C D E F G H I M I J K L M p p p p Figure 2 Meth induces mitochondrial defects in primary cortical neurons. ( A B C B C D E F G H G H I J I J p p Figure 3 Effects of RIPK1–RIPK3 axis in Meth-induced neuronal necroptosis. ( A B C D H I L p p p p Figure 4 p-MLKL translocated to mitochondrial membrane driven by Meth. ( A B C D E F p p p Figure 5 Meth-induced mtROS facilitated neuronal necroptosis. ( A B C D E F G p p p Figure 6 A schematic depicting the role of the MLKL in Meth-induced neuronal necroptosis. With the stimulation of Meth, RIPK1 forms form a complex with RIPK3, leading to phosphorylation of RIPK3 and activating MLKL, leading to mitochondrial membrane permeability, mtDNA and ATP decrease, mitochondrial ROS generation, and finally neuronal necroptosis. ",
  "metadata": {
    "Title of this paper": "Mitochondrial ROS promotes susceptibility to infection via gasdermin D-mediated necroptosis",
    "Journal it was published in:": "Toxics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473512/"
  }
}