{
  "title": "Paper_1024",
  "abstract": "pmc Nutrients Nutrients 1692 nutrients nutrients Nutrients 2072-6643 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472238 PMC12472238.1 12472238 12472238 41010489 10.3390/nu17182963 nutrients-17-02963 1 Article Influence of Adherence to the Mediterranean Diet on Vascular Health and Healthy Aging in Women: Assessment Using CAVI https://orcid.org/0000-0003-0311-898X Llamas-Ramos Inés Conceptualization Investigation Writing – review & editing 1 2 3 4 † https://orcid.org/0000-0002-5606-261X Llamas-Ramos Rocío Conceptualization Methodology Writing – original draft 1 2 3 † https://orcid.org/0000-0001-9446-0259 Rodríguez María Cortés Formal analysis 2 5 6 * https://orcid.org/0000-0003-3667-7155 Rodríguez-Sánchez Emiliano Methodology Data curation 2 3 7 8 9 https://orcid.org/0000-0003-0133-6123 Gómez-Marcos Manuel A. 2 3 7 8 9 * Gómez-Sánchez Marta 3 10 ‡ https://orcid.org/0000-0001-8663-9339 Gómez-Sánchez Leticia 3 11 ‡ Sun Chengwen Academic Editor 1 inesllamas@usal.es rociollamas@usal.es 2 emiliano@usal.es 3 martagmzsnchz@gmail.com leticiagmzsnchz@gmail.com 4 5 6 7 8 9 10 11 * mariacortes@usal.es magomez@usal.es † These authors contributed equally to this work. ‡ These authors also contributed equally to this work. 16 9 2025 9 2025 17 18 497660 2963 18 8 2025 11 9 2025 12 9 2025 16 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background: Objective: Methods: Results: p p p p Conclusions: vascular aging arterial stiffness CAVI mediterranean diet cardiovascular risk lifestyle Regional Health Agency of the Castilla y León GRS 1193/B/15 Carlos III Health Institute (ISCIII) of the Ministry of Science and Innovation RD21/0016/0010 Next Generation EU, Recovery and Resilience Mechanism (RRM) PI21/00454 Castilla y León government research program INT/M/02/17 INT/M/04/15 biomedical research institute of Salamanca (IBSAL) IBI21/00001 Carlos III Health Institute INT22/00007 This study was funded by the Regional Health Agency of the Castilla y León government through research projects (GRS 1193/B/15), by the Carlos III Health Institute (ISCIII) of the Ministry of Science and Innovation, by project RD21/0016/0010 of the research network RICAPPS (Red de Investigación en Cronicidad, Atención Primaria y Promoción de la Salud) and by the research project PI21/00454 financed by the Next Generation EU, Recovery and Resilience Mechanism (RRM). Human resources were also obtained through the Castilla y León government research program (INT/M/02/17 and INT/M/04/15), from the biomedical research institute of Salamanca (IBSAL) (IBI21/00001) and the Carlos III Health Institute (INT22/00007). None played any role in the study design, data analysis, reporting of results, or the decision to submit the manuscript for publication. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Aging brings with it a series of physiological changes linked to the passage of time [ 1 2 3 Vascular aging is characterized by a progressive increase in arterial stiffness, a phenomenon closely related to the development of cardiovascular diseases [ 4 5 6 7 8 8 On the other hand, some recent studies have pointed out that a low-carbohydrate diet, with moderate fat intake and high protein intake, can significantly contribute to weight loss in postmenopausal women, thus promoting better overall health and preventing chronic diseases [ 9 10 11 10 12 The MD has been shown to have cardioprotective effects such as improved lipid profile, vascular function, and blood pressure, as well as reduced oxidative stress and inflammatory biomarkers that can generate antioxidant and antiatherosclerotic effects [ 13 14 15 16 15 2. Materials and Methods 2.1. Study Design Cross-sectional study grouping women participating in the EVA [ 17 18 19 NCT02623894 NCT02016014 NCT01428934 2.2. Study Population Women aged between 35 and 75 years old participated in the three studies conducted in primary care centers: EVA [ 17 18 19 Figure 1 2.3. Ethical Considerations The three studies included in this manuscript were approved by the relevant ethics committee under registration numbers PI15/01039 and PI20/10569 for the EVA study; PI10/02043 for the MARK study; and PI83/06/2018 for the EVIDENT study. The standards established in the Declaration of Helsinki and the guidelines established by the WHO for the development of observational studies were followed. All participants were informed and signed an informed consent form when they agreed to participate. In addition, the standards established in Organic Law 3/2018, of 5 December, on the Protection of Personal Data and guaranteeing rights, and Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016, on Data Protection (GDPR) for data confidentiality were followed. 2.4. Variables and Measuring Instruments 2.4.1. Vascular Aging Vascular aging was classified into healthy aging (HVA), normal aging (NVA), and early aging (EVA) based on the cut-off points established by the EVA Group for women estimated using CAVI [ 20 21 22 23 24 Figure 2 2.4.2. Arterial Stiffness The measurement of CAVI was performed with the VaSera VS-1500 device (Fukuda Denshi Co., Ltd., Tokyo, Japan) [ 25 25 2.4.3. Mediterranean Diet The MEDAS questionnaire used in the PREDIMED study was selected to assess the MD. This 14-item questionnaire has been validated in the Spanish population [ 26 26 2.4.4. Descriptives As published in the protocols of the included studies [ 17 18 19 The tests were performed between 8:00 and 9:00 a.m. after a 12 h fast and were processed in reference laboratories. Blood pressure values ≥ 140/90 mmHg or taking antihypertensive drugs were considered a diagnosis of hypertension; having fasting plasma glucose values ≥ 126 mg/dL or HbA1c ≥ 6.5% or taking hypoglycemic agents was considered a diagnosis of type 2 diabetes mellitus; having fasting total cholesterol values ≥ 240 mg/dL, low-density lipoprotein cholesterol (LDL-C) ≥ 160 mg/dL, high-density lipoprotein cholesterol (HDL-C) ≤ 40 mg/dL in men and ≤50 mg/dL in women, or triglycerides ≥ 150 mg/dL, or taking lipid-lowering drugs was considered a diagnosis of dyslipidemia. A BMI ≥ 30 kg/m 2 17 18 19 2.5. Statistical Analysis Continuous variables are presented as mean ± standard deviation (SD), while categorical variables are reported as absolute frequencies and percentages. To compare baseline characteristics between age groups and according to the degree of vascular aging (HVA, NVA and AVA), analysis of variance (ANOVA) was used for continuous variables and the chi-square test (χ 2 Likewise, a multinomial logistic regression analysis was used to analyze the association between MD adherence (independent variable) and vascular aging status (dependent variable with three categories: HVA, NVA, and AVA), using the HVA group as a reference. The model was adjusted for age, sex, and use of antihypertensive, hypoglycemic, and lipid-lowering drugs. SPSS Statistics for Windows, version 28.0 (IBM Corp., Armonk, NY, USA) was used. A p 3. Results 3.1. Baseline Characteristics The study sample included a total of 1468 women. Significant differences were observed between age groups in almost all variables analyzed ( p p With regard to conventional cardiovascular risk factors, a progressive increase in systolic blood pressure was found with age, from 102.73 ± 2.31 mmHg in the 30–40 age group to 135.91 ± 1.24 mmHg in the 70–80 age group ( p p p Table 1 3.2. Characteristics of the Subjects Included with and Without Healthy Vascular Aging Women were classified into healthy vascular aging (HVA, n = 254), normal aging (NVA, n = 746), and early vascular aging (EVA, n = 468). We found a better score for MD adherence in the HVA group (6.34 ± 0.12) compared to the EVA group (5.72 ± 0.09) ( p p In terms of cardiovascular risk factors, the EVA group had significantly higher systolic (133.54 ± 0.94 mmHg) and diastolic (81.84 ± 0.50 mmHg) blood pressure readings compared to the other groups ( p p Table 2 p Table 2 3.3. Association Between CAVI and MD Overall and by Sex Multinomial Logistic Regression Figure 3 p p 4. Discussion In the present study, a significant association was identified between greater adherence to the MD and lower arterial stiffness, as measured by the CAVI, supporting its protective role in the context of vascular aging in the female population. Our results indicate that greater adherence to the MD is associated with a significantly higher probability of presenting with HVA. This finding is consistent with previous research that has documented the beneficial effects of dietary patterns characterized by high consumption of plant-based foods, unsaturated fats, and antioxidant compounds on improving endothelial function and preserving arterial elasticity [ 14 27 28 It is important to note that vascular aging differs between the sexes. In women, arterial stiffening and endothelial dysfunction can accelerate not only with advancing age and during the menopausal transition, but also in the context of specific conditions such as polycystic ovary syndrome or adverse pregnancy outcomes, which significantly increase the risk of developing cardiovascular disease [ 29 30 31 32 33 34 35 25 36 25 36 The association between MD and arterial stiffness observed in this study is consistent with multiple epidemiological studies and clinical trials that have shown improved endothelial function, reduced inflammatory markers, and a protective effect on vascular integrity with adherence to DM [ 37 38 39 40 41 42 43 44 One thing to keep in mind is that in this study, the HVA group, although with a lower prevalence of comorbidities such as diabetes or dyslipidemia, had higher BMI and obesity values, which should be taken into account when implementing treatment strategies. This finding was corroborated in studies such as that by Hauner et al. [ 45 45 Another paradoxical finding of our study was that, although women in the HVA group showed higher mean MD adherence scores, a greater proportion of women in the EVA group were classified as having high adherence. This discrepancy may be explained by differences in the distribution of adherence scores across groups. In particular, women with EVA may be more likely to adopt substantial dietary changes after becoming aware of their higher cardiovascular risk, which could increase the proportion surpassing the “high adherence” threshold despite lower overall scores. Additionally, the reliance on self-reported dietary questionnaires could have introduced recall or reporting bias, particularly among participants with greater health concerns, potentially contributing to this finding. Future longitudinal studies with objective dietary assessment methods are needed to clarify whether this pattern reflects true behavioral change or methodological limitations. Among the strengths of the present study are the use of the CAVI as a standardized and reproducible measure of arterial stiffness, as well as the large sample size and the inclusion of a population with a wide age range. Nevertheless, some important limitations should be acknowledged. First, the cross-sectional design precludes establishing any causal inference; therefore, the associations observed should be interpreted as correlations rather than cause–effect relationships. Second, adherence to the MD was assessed using self-reported dietary questionnaires, which are inherently prone to recall and reporting bias, and may not fully capture actual dietary intake. These limitations should be considered when interpreting our findings, and future longitudinal studies with objective dietary assessment methods are warranted to confirm these results. 5. Conclusions The results of this study show that greater adherence to the MD is associated with a healthier vascular aging profile, characterized by lower central and peripheral arterial stiffness as assessed by the CAVI. These findings reinforce the protective role of this dietary pattern in preventing age-related vascular deterioration, beyond conventional risk factors such as hypertension, dyslipidemia, or diabetes mellitus. The implementation of nutritional intervention strategies based on the MD could effectively contribute to promoting healthy cardiovascular aging and reducing the risk of chronic diseases in the general population. However, longitudinal studies are needed to confirm the causal direction of this association and determine the long-term impact of sustained adherence to this dietary pattern on vascular health. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, I.L.-R., R.L.-R. and M.A.G.-M.; methodology, I.L.-R., R.L.-R., M.A.G.-M. and E.R.-S.; formal analysis, M.C.R. and M.A.G.-M. Investigation, I.L.-R., R.L.-R., L.G.-S., M.G.-S., M.G.-S. and L.G.-S.; data curation, M.A.G.-M. and E.R.-S., writing—original draft preparation, I.L.-R., and R.L.-R., M.G.-S. and L.G.-S. writing—review and editing, project administration, I.L.-R., R.L.-R. and M.A.G.-M.; funding acquisition, M.A.G.-M. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement All personnel involved in this study were trained before the study began. This study was approved by the ethics committee of the Salamanca Health Area Drug Research Ethics Committee (CEIm PI 15/01039, 4 May 2015). Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Data Availability Statement The data supporting the findings of this study are available on ZENODO under the DOI: https://doi.org/10.5281/zenodo.12166167 Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: ANOVA Analysis of Variance BMI Body Mass Index CAVI Cardio-Ankle Vascular Index DBP Diastolic blood pressure EVA Accelerated Vascular Aging HDL-C High-density Lipoprotein Cholesterol HVA Healthy Vascular Aging LDL-C Low-density Lipoprotein Cholesterol MD Mediterranean diet NVA Normal Vascular Aging PCOS Polycystic Ovary Syndrome SBP Systolic Blood Pressure References 1. Martínez-Rodríguez A. Cuestas-Calero B.J. Martínez-Olcina M. Marcos-Pardo P.J. Benefits of Adding an Aquatic Resistance Interval Training to a Nutritional Education on Body Composition, Body Image Perception and Adherence to the Mediterranean Diet in Older Women Nutrients 2021 13 2712 10.3390/nu13082712 34444872 PMC8400619 2. Vogel B. Acevedo M. Appelman Y. Merz C.N.B. Chieffo A. Figtree G.A. Guerrero M. Kunadian V. Lam C.S.P. Maas A.H.E.M. The Lancet women and cardiovascular disease Commission: Reducing the global burden by 2030 Lancet 2021 397 2385 2438 10.1016/S0140-6736(21)00684-X 34010613 3. Colpani V. Baena C.P. Jaspers L. van Dijk G.M. Farajzadegan Z. Dhana K. Tielemans M.J. Voortman T. Freak-Poli R. Veloso G.G.V. Lifestyle factors, cardiovascular disease and all-cause mortality in middle-aged and elderly women: A systematic review and meta-analysis Eur. J. Epidemiol. 2018 33 831 845 10.1007/s10654-018-0374-z 29524110 4. Alonso-Domínguez R. Sánchez-Aguadero N. Patino-Alonso M.C. Agudo-Conde C. de Cabo-Laso Á. Gómez-Sánchez M. Gómez-Sánchez L. Rodríguez-Sánchez E. García-Ortiz L. Gómez-Marcos M.A. Association between measurements of arterial stiffness and target organ damage in a general Spanish population Ann. Med. 2021 53 345 356 10.1080/07853890.2021.1881812 33533280 PMC7877984 5. Maier J.A. Andrés V. Castiglioni S. Giudici A. Lau E.S. Nemcsik J. Seta F. Zaninotto P. Catalano M. Hamburg N.M. Aging and Vascular Disease: A Multidisciplinary Overview J. Clin. Med. 2023 12 5512 10.3390/jcm12175512 37685580 PMC10488447 6. Panda P. Verma H.K. Lakkakula S. Merchant N. Kadir F. Rahman S. Jeffree M.S. Lakkakula B.V.K.S. Rao P.V. Biomarkers of Oxidative Stress Tethered to Cardiovascular Diseases Oxidative Med. Cell. Longev. 2022 2022 9154295 10.1155/2022/9154295 PMC9249518 35783193 7. Jebari-Benslaiman S. Galicia-García U. Larrea-Sebal A. Olaetxea J.R. Alloza I. Vandenbroeck K. Benito-Vicente A. Martín C. Pathophysiology of Atherosclerosis Int. J. Mol. Sci. 2022 23 3346 10.3390/ijms23063346 35328769 PMC8954705 8. Giani A. Micciolo R. Zoico E. Mazzali G. Zamboni M. Fantin F. Cardio-Ankle Vascular Index and Aging: Differences between CAVI and CAVI0 J. Clin. Med. 2023 12 6726 10.3390/jcm12216726 37959192 PMC10647579 9. Silva T.R. Oppermann K. Reis F.M. Spritzer P.M. Nutrition in Menopausal Women: A Narrative Review Nutrients 2021 13 2149 10.3390/nu13072149 34201460 PMC8308420 10. Martínez-González M.A. Gea A. Ruiz-Canela M. The Mediterranean Diet and Cardiovascular Health Circ. Res. 2019 124 779 798 10.1161/CIRCRESAHA.118.313348 30817261 11. Menotti A. Puddu P.E. Kromhout D. Kafatos A. Tolonen H. Coronary heart disease mortality trends during 50 years as explained by risk factor changes: The European cohorts of the Seven Countries Study Eur. J. Prev. Cardiol. 2020 27 988 998 10.1177/2047487318821250 30614262 12. Poorolajal J. Mohammadi Y. Fattahi-Darghlou M. Almasi-Moghadam F. The association between major gastrointestinal cancers and red and processed meat and fish consumption: A systematic review and meta-analysis of the observational studies PLoS ONE 2024 19 e0305994 10.1371/journal.pone.0305994 38924054 PMC11207151 13. Tuttolomondo A. Simonetta I. Daidone M. Mogavero A. Ortello A. Pinto A. Metabolic and Vascular Effect of the Mediterranean Diet Int. J. Mol. Sci. 2019 20 4716 10.3390/ijms20194716 31547615 PMC6801699 14. Richardson L.A. Izuora K. Basu A. Mediterranean Diet and Its Association with Cardiovascular Disease Risk Factors: A Scoping Review Int. J. Environ. Res. Public Health 2022 19 12762 10.3390/ijerph191912762 36232062 PMC9566634 15. Mehta L.S. Velarde G.P. Lewey J. Sharma G. Navas-Acien A. Fretts A.M. Magwood G.S. Yang E. Blumenthal R.S. Brown R.-M. Cardiovascular Disease Risk Factors in Women: The Impact of Race and Ethnicity: A Scientific Statement From the American Heart Association Circulation 2023 147 1471 1487 10.1161/CIR.0000000000001139 37035919 PMC11196122 16. Guan C. Zahid S. Minhas A.S. Ouyang P. Vaught A. Baker V.L. Michos E.D. Polycystic ovary syndrome: A “risk-enhancing” factor for cardiovascular disease Fertil. Steril. 2022 117 924 935 10.1016/j.fertnstert.2022.03.009 35512976 17. Gomez-Marcos M.A. Martinez-Salgado C. Gonzalez-Sarmiento R. Hernandez-Rivas J.M. Sanchez-Fernandez P.L. Recio-Rodriguez J.I. Rodriguez-Sanchez E. García-Ortiz L. Association between different risk factors and vascular accelerated ageing (EVA study): Study protocol for a cross-sectional, descriptive observational study BMJ Open 2016 6 e011031 10.1136/bmjopen-2016-011031 27267107 PMC4908886 18. Martí R. Parramon D. García-Ortiz L. Rigo F. Gómez-Marcos M.A. Sempere I. García-Regalado N. Recio-Rodriguez J.I. Agudo-Conde C. Feuerbach N. Improving interMediAte Risk management. MARK study BMC Cardiovasc. Disord. 2011 11 61 10.1186/1471-2261-11-61 21992621 PMC3207912 19. Recio-Rodríguez J.I. Martín-Cantera C. González-Viejo N. Gómez-Arranz A. Arietaleanizbeascoa M.S. Schmolling-Guinovart Y. Maderuelo-Fernandez J.A. Pérez-Arechaederra D. Rodriguez-Sanchez E. Gómez-Marcos M.A. Effectiveness of a smartphone application for improving healthy lifestyles, a randomized clinical trial (EVIDENT II): Study protocol BMC Public Health 2014 14 254 10.1186/1471-2458-14-254 24628961 PMC4003852 20. Gómez-Sánchez M. Patino-Alonso M.C. Gómez-Sánchez L. Recio-Rodríguez J.I. Rodríguez-Sánchez E. Maderuelo-Fernández J.A. García-Ortiz L. Gómez-Marcos M.A. Reference values of arterial stiffness parameters and their association with cardiovascular risk factors in the Spanish population. The EVA Study Rev. Española Cardiol. 2020 73 43 52 10.1016/j.recesp.2019.04.006 31521574 21. Ji H. Teliewubai J. Lu Y. Xiong J. Yu S. Chi C. Li J. Blacher J. Zhang Y. Xu Y. Vascular aging and preclinical target organ damage in community-dwelling elderly J. Hypertens. 2018 36 1391 1398 10.1097/HJH.0000000000001692 29389744 22. Niiranen T.J. Lyass A. Larson M.G. Hamburg N.M. Benjamin E.J. Mitchell G.F. Vasan R.S. Prevalence, Correlates, and Prognosis of Healthy Vascular Aging in a Western Community-Dwelling Cohort Hypertension 2017 70 267 274 10.1161/HYPERTENSIONAHA.117.09026 28559398 PMC5509504 23. Nilsson P.M. Laurent S. Cunha P.G. Olsen M.H. Rietzschel E. Franco O.H. Ryliškytė L. Strazhesko I. Vlachopoulos C. Chen C.-H. Characteristics of healthy vascular ageing in pooled population-based cohort studies J. Hypertens. 2018 36 2340 2349 10.1097/HJH.0000000000001824 30063641 PMC6528679 24. Gomez-Sanchez M. Gomez-Sanchez L. Patino-Alonso M.C. Cunha P.G. Recio-Rodriguez J.I. Alonso-Dominguez R. Sanchez-Aguadero N. Rodriguez-Sanchez E. Maderuelo-Fernandez J.A. Garcia-Ortiz L. Vascular aging and its relationship with lifestyles and other risk factors in the general Spanish population: Early Vascular Ageing Study J. Hypertens. 2020 38 1110 1122 10.1097/HJH.0000000000002373 32371801 25. Namekata T. Suzuki K. Ishizuka N. Shirai K. Establishing baseline criteria of cardio-ankle vascular index as a new indicator of arteriosclerosis: A cross-sectional study BMC Cardiovasc. Disord. 2011 11 51 10.1186/1471-2261-11-51 21831311 PMC3166915 26. Schröder H. Fitó M. Estruch R. Martínez-González M.A. Corella D. Salas-Salvadó J. Lamuela-Raventós R. Ros E. Salaverría I. Fiol M. A Short Screener Is Valid for Assessing Mediterranean Diet Adherence Among Older Spanish Men and Women J. Nutr. 2011 141 1140 1145 10.3945/jn.110.135566 21508208 27. Estruch R. Ros E. Salas-Salvadó J. Covas M.-I. Corella D. Arós F. Gómez-Gracia E. Ruiz-Gutiérrez V. Fiol M. Lapetra J. Primary Prevention of Cardiovascular Disease with a Mediterranean Diet Supplemented with Extra-Virgin Olive Oil or Nuts N. Engl. J. Med. 2018 378 e34 10.1056/NEJMoa1800389 29897866 28. Theodoridis X. Chourdakis M. Papaemmanouil A. Chaloulakou S. Georgakou A.V. Chatzis G. Triantafyllou A. The Effect of Diet on Vascular Aging: A Narrative Review of the Available Literature Life 2024 14 267 10.3390/life14020267 38398776 PMC10890697 29. Laporte M.A.L. Coutinho T. Vascular Aging in Women Can. J. Cardiol. 2024 40 1493 1495 10.1016/j.cjca.2024.01.036 38325763 30. O’Neill S.M. Travers C.M. Otahal P. Khoo S.K. Sharman J.E. Menopause and accelerated aortic stiffness Maturitas 2024 180 107900 10.1016/j.maturitas.2023.107900 38101308 31. Vallée A. Menopause and arterial stiffness index: Insights from the women’s UK Biobank cohort Maturitas 2025 198 108608 10.1016/j.maturitas.2025.108608 40413990 32. Gavilán-Carrera B. Aguilera-Fernández V. Amaro-Gahete F.J. Rosales-Castillo A. Soriano-Maldonado A. Vargas-Hitos J.A. Association of the Mediterranean diet with arterial stiffness, inflammation, and medication use in women with systemic lupus erythematosus: An exploratory study J. Nutr. Biochem. 2024 134 109759 10.1016/j.jnutbio.2024.109759 39276943 33. Gil-Gutiérrez R. Medina-Martínez I. Quesada-Caballero M. de la Hera-Fernández F.J. Zamora-Pasadas M. Cantarero-Villanueva I. Albendín-García L. Parola V. Rueda-Medina B. Correa-Rodríguez M. EFINUTRILES Study: Integrative Extra Virgin Olive Oil and Multimodal Lifestyle Interventions for Cardiovascular Health and SLE Management Nutrients 2025 17 1076 10.3390/nu17061076 40292522 PMC11944431 34. Sakamoto A. Nakamura Y. Kagiyama N. Sato E. Fujita W. Kaneko T. Minamino T. Low Arterial Stiffness by Pulse Wave Analysis and Aortic Diseases Circ. Rep. 2025 7 481 485 10.1253/circrep.CR-25-0043 40497129 PMC12148350 35. Hersant J. Kruger R. Bianchini E. Königstein K. Sinha M.D. Hidvégi E.V. Kodithuwakku V. Mill J.G. Diaz A. Zócalo Y. Measuring early vascular aging in youth: An expert consensus document from the Youth Vascular Consortium J. Hypertens. 2025 10.1097/HJH.0000000000004039 40366131 36. Shirai K. Analysis of vascular function using the cardio–ankle vascular index (CAVI) Hypertens. Res. 2011 34 684 685 10.1038/hr.2011.40 21642994 37. Pagidipati N.J. Taub P.R. Ostfeld R.J. Kirkpatrick C.F. Dietary patterns to promote cardiometabolic health Nat. Rev. Cardiol. 2025 22 38 46 10.1038/s41569-024-01061-7 39020052 38. Seth C. Schmid V. Mueller S. Haykowsky M. Foulkes S.J. Halle M. Wernhart S. Diabetes, obesity, and cardiovascular disease—What is the impact of lifestyle modification? Herz 2025 50 240 245 10.1007/s00059-025-05309-x 40085207 39. Rodríguez Núñez S. Rubín-García M. Martín-Sánchez V. Álvarez-Álvarez L. Molina A.J. Mediterranean Diet, Obesity-Related Metabolic Cardiovascular Disorders, and Environmental Sustainability: A Systematic Review Nutrients 2025 17 2005 10.3390/nu17122005 40573116 PMC12195730 40. Estruch R. Anti-inflammatory effects of the Mediterranean diet: The experience of the PREDIMED study Proc. Nutr. Soc. 2010 69 333 340 10.1017/S0029665110001539 20515519 41. Guasch-Ferré M. Hu F.B. Martínez-González M.A. Fitó M. Bulló M. Estruch R. Ros E. Corella D. Recondo J. Gómez-Gracia E. Olive oil intake and risk of cardiovascular disease and mortality in the PREDIMED Study BMC Med. 2014 12 78 10.1186/1741-7015-12-78 24886626 PMC4030221 42. Frank G. Pala B. Gualtieri P. Tocci G. La Placa G. Di Renzo L. Adherence to Mediterranean Diet and Implications for Cardiovascular Risk Prevention Nutrients 2025 17 1991 10.3390/nu17121991 40573102 PMC12196460 43. Fujie S. Horii N. Kajimoto H. Yamazaki H. Inoue K. Iemitsu K. Uchida M. Arimitsu T. Shinohara Y. Sanada K. Impact of resistance training and chicken intake on vascular and muscle health in elderly women J. Cachexia Sarcopenia Muscle 2025 16 10.1002/jcsm.13572 PMC11670164 39569460 44. Zupo R. Castellana F. Lisco G. Corbo F. Crupi P. Sardone R. Catino F. Perna S. Gesualdo L. Lozupone M. The Effect of a Mediterranean Diet on Arterial Stiffness: A Systematic Review Nutrients 2025 17 1192 10.3390/nu17071192 40218950 PMC11990623 45. Hauner D. Günther J. Schederecker F. Donik L. Meyer D. Hermsdörfer J. Friedl T.W. Rack B. Beckmann M.W. Janni W. Effect of a comprehensive lifestyle intervention program on body weight and health behavior in women with breast cancer: Results from a randomized controlled trial Clin. Nutr. 2024 43 1937 1951 10.1016/j.clnu.2024.07.002 39024773 Figure 1 Distribution of subjects included according to study of origin. Figure 2 Proportion of subjects with HVA, NVA, and EVA overall. HVA: healthy vascular aging, NVA: normal vascular aging, EVA: early vascular aging. Figure 3 Association of CAVI and MD. Multinomial logistic regression. HVA: healthy vascular aging; NVA: normal vascular aging; EVA: early vascular aging; CAVI: Cardio-Ankle Vascular Index; MD: Mediterranean Diet. nutrients-17-02963-t001_Table 1 Table 1 General characteristics of the subjects included.  Total 30–40 40–50 50–60 60–70 70–80 p Mediterranean Diet        MD (total score) 6.03 ± 1.98 6.74 ± 0.24 6.36 ± 0.17 5.89 ± 0.09 5.87 ± 0.08 6.27 ± 0.13 <0.001 Adherence to MD, n (%) 880 (59.9) 31 (44.9) 73 (51.0) 265 (61.1) 377 (64.7) 134 (56.1) 0.001 Conventional risk factors        Age, (years) 60.09 ± 9.71 35.97 ± 0.30 45.89 ± 0.21 55.51 ± 0.12 64.57 ± 0.10 72.93 ± 0.16 <0.001 SBP, (mmHg) 128.72 ± 20.55 102.73 ± 2.31 117.96 ± 1.60 127.93 ± 0.92 131.07 ± 0.79 135.91 ± 1.24 <0.001 DBP, (mmHg) 79.64 ± 10.84 68.86 ± 1.25 76.23 ± 0.87 82.23 ± 0.50 80.51 ± 0.43 77.98 ± 0.67 <0.001 Hypertension, n (%) 1309 (89.2) 68 (98.6) 134 (93.7) 383 (88.2) 516 (88.5) 208 (87.0) 0.025 Antihypertensive drugs, n (%) 654 (44.6) 1 (1.4) 22 (15.4) 175 (40.3) 291 (49.9) 165 (69.0) <0.001 Total cholesterol, (mg/dL) 220.54 ± 42.47 182.13 ± 4.94 203.10 ± 3.43 226.35 ± 1.97 226.02 ± 1.70 218.16 ± 2.66 <0.001 LDL cholesterol, (mg/dL) 132.53 ± 35.94 102.74 ± 4.28 122.60 ± 2.94 138.77 ± 1.70 135.61 ± 1.45 128.14 ± 2.27 <0.001 HDL cholesterol, (mg/dL) 57.27 ± 15.77 61.98 ± 1.91 57.16 ± 1.32 56.87 ± 0.76 56.65 ± 0.65 58.20 ± 1.01 0.09 Triglycerides, (mg/dL) 122.63 ± 68.62 76.61 ± 8.18 101.79 ± 5.65 132.05 ± 3.24 125.33 ± 2.80 124.55 ± 4.36 <0.001 Dyslipidemia, n (%) 1076 (73.3) 19 (17.5) 71 (49.7) 317 (73.0) 477 (81.8) 192 (80.3) <0.001 Lipid–lowering drugs. n (%) 429 (29.2) 1 (1.4) 13 (9.1) 98 (22.6) 207 (35.5) 110 (46.9) <0.001 FPG, (mg/dL) 100.24 ± 32.30 83.80 ± 3.82 85.64 ± 2.65 102.15 ± 1.53 103.40 ± 1.32 102.58 ± 2.05 <0.001 HbA1c 5.93 ± 1.07 5.26 ± 0.13 5.39 ± 0.09 5.98 ± 0.05 6.07 ± 0.04 6.01 ± 0.07 <0.001 Diabetes mellitus, n (%) 306 (20.8) 2 (2.9) 5 (3.5) 92 (21.2) 147 (25.2) 60 (25.1) <0.001 Hypoglycemic drugs, n (%) 234 (15.9) 2 (2.9) 4 (2.8) 66 (15.2) 107 (18.4) 55 (23.0) <0.001 Weight, kg 70.20 ± 13.31 63.91 ± 1.59 70.46 ± 1.10 71.31 ± 0.63 71.03 ± 0.55 67.81 ± 0.85 <0.001 Height, cm 157.11 ± 6.67 162.10 ± 0.76 161.25 ± 0.53 158.24 ± 0.30 155.82 ± 0.26 154.29 ± 0.41 <0.001 BMI, (kg/m 2 28.47 ± 5.30 24.35 ± 0.63 27.11 ± 0.43 28.49 ± 0.25 29.27 ± 0.21 28.48 ± 0.34 <0.001 WC, cm 94.33 ± 12.90 82.84 ± 1.51 90.61 ± 1.06 93.61 ± 0.60 96.48 ± 0.52 95.91 ± 0.81 <0.001 Obesity, n (%) 495 (33.7) 9 (13.0) 38 (26.6) 152 (35.0) 213 (36.5) 83 (34.7) 0.001 Arterial stiffness        CAVI, m/second 8.37 ± 1.24 6.58 ± 0.12 7.18 ± 0.09 8.10 ± 0.05 8.70 ± 0.04 9.29 ± 0.07 <0.001 Values are means ± standard deviations for continuous data and number and proportions for categorical data. MD: Mediterranean Diet; SBP: systolic blood pressure; DBP: diastolic blood pressure; LDL: low–density lipoprotein; HDL: high–density lipoprotein; FPG: fasting plasma glucose; HbA1c: glycosylated hemoglobin; BMI: body mass index; WC: Waist circumference. p nutrients-17-02963-t002_Table 2 Table 2 ( a b ( a   HVA (n = 254)  NVA (n = 746)  EVA (n = 468)  p Mediterranean Diet     MD (total score) 6.34 ± 0.12 6.12 ± 0.07 5.72 ± 0.09 <0.001 Adherence to MD, n (%) 138 (34.3) 419 (56.2) 323 (69.0) <0.001 Conventional risk factors     Age, (years) 58.67 ± 0.61 60.39 ± 0.36 60.38 ± 0.45 0.038 SBP, (mmHg) 124.81 ± 1.27 127.02 ± 0.74 133.54 ± 0.94 <0.001 DBP, (mmHg) 78.43 ± 0.67 78.67 ± 0.39 81.84 ± 0.50 <0.001 Hypertension, n (%) 236 (92.9) 672 (90.1) 401 (85.7) <0.006 Antihypertensive drugs, n (%) 112 (44.1) 325 (43.6) 217 (46.4) 0.625 Total cholesterol, (mg/dL) 217.47 ± 2.66 218.39 ± 1.55 225.65 ± 1.96 0.007 LDL cholesterol, (mg/dL) 131.33 ± 2.27 131.50 ± 1.32 134.84 ± 1.67 0.246 HDL cholesterol, (mg/dL) 57.85 ± 0.99 57.43 ± 0.58 56.70 ± 0.73 0.598 Triglycerides, (mg/dL) 116.89 ± 4.30 120.62 ± 2.51 128.96 ± 3.17 <0.041 Dyslipidemia, n (%) 165 (65.0) 536 (71.8) 375 (80.1) <0.001 Lipid–lowering drugs. n (%) 61 (24.0) 220 (29.5) 148 (31.6) 0.097 FPG, (mg/dL) 88.54 ± 2.00 100.10 ± 1.16 106.79 ± 1.47 <0.001 HbA1c 5.47 ± 0.07 5.94 ± 0.04 6.16 ± 0.05 <0.001 Diabetes mellitus, n (%) 0 (0.0) 172 (23.1) 134 (28.6) <0.001 Hypoglycemic drugs, n (%) 0 (0.0) 133 (17.8) 101 (21.6) <0.001 Weight, kg 73.85 ± 0.83 70.05 ± 0.48 68.45 ± 0.61 <0.001 Height, cm 156.68 ± 0.42 154.86 ± 0.24 157.75 ± 0.31 <0.004 BMI, (kg/m 2 30.08 ± 0.33 28.53 ± 0.19 27.52 ± 0.24 <0.001 WC, cm 95.49 ± 0.81 94.22 ± 0.47 93.87 ± 0.60 0.262 Obesity, n (%) 11 (43.7) 259 (34.7) 125 (26.7) <0.001 Arterial stiffness     CAVI, m/second 6.95 ± 0.06 8.19 ± 0.03 9.44 ± 0.04 <0.001 ( b   HVA vs. NVA  HVA vs. EVA  NVA vs. EVA  Mediterranean Diet     Total cholesterol, (mg/dL) 0.767 0.013 0.004  Triglycerides, (mg/dL) 0.454 0.024 0.039  FPG, (mg/dL) <0.001 <0.001 <0.001  HbA1c <0.001 <0.001 <0.001  Values are means ± standard deviations for continuous data and number and proportions for categorical data. MD: Mediterranean Diet; SBP: systolic blood pressure; DBP: diastolic blood pressure; LDL: low–density lipoprotein; HDL: high–density lipoprotein; FPG: fasting plasma glucose; HbA1c: glycosylated hemoglobin; BMI: body mass index; WC: Waist circumference; HVA: healthy vascular aging; NVA: normal vascular aging; EVA: early vascular aging; p ",
  "metadata": {
    "Title of this paper": "Effect of a comprehensive lifestyle intervention program on body weight and health behavior in women with breast cancer: Results from a randomized controlled trial",
    "Journal it was published in:": "Nutrients",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472238/"
  }
}