{
  "title": "Paper_887",
  "abstract": "pmc Commun Biol Commun Biol 3495 commbiol Communications Biology 2399-3642 Nature Publishing Group PMC12474904 PMC12474904.1 12474904 12474904 41006804 10.1038/s42003-025-08752-y 8752 1 Article Multi-omics data reveal the origin of cardiac myxoma Liu Shengzhong 1 http://orcid.org/0000-0002-8717-1552 Zhang Wanfeng 2 Sun Huajun 1 Zheng Chenqing 3 Huang Keli 1 Fan Chengming 4 Lai Rensheng 5 http://orcid.org/0000-0002-6964-7131 Yin Mingzhu 6 Lan Jie 2 http://orcid.org/0000-0001-8431-4266 Wu Xiushan xiushanwu2003@aliyun.com 7 8 Ran Longke longkeran@aliyun.com 9 http://orcid.org/0000-0001-5580-5605 Li Xiaoping lixiaoping0119@163.com 1 10 11 1 https://ror.org/04qr3zq92 grid.54549.39 0000 0004 0369 4060 Department of Cardiovascular Surgery, Sichuan Provincial People’s Hospital, School of Medicine, University of Electronic Science and Technology of China, 2 https://ror.org/017z00e58 grid.203458.8 0000 0000 8653 0555 Department of Bioinformatics, College of Artificial Intelligence Medicine, Chongqing Medical University, 3 https://ror.org/01hcefx46 grid.440218.b 0000 0004 1759 7210 Guangdong Provincial Clinical Research Center for Geriatrics, Shenzhen Clinical Research Center for Geriatrics, Shenzhen People’s Hospital, 4 https://ror.org/00f1zfq44 grid.216417.7 0000 0001 0379 7164 Department of Cardiovascular Surgery, the Second Xiangya Hospital, Central South University, 5 https://ror.org/023rhb549 grid.190737.b 0000 0001 0154 0904 Medical Pathology Center (MPC), Cancer Early Detection and Treatment Center (CEDTC) Chongqing University Three Gorges Hospital, Chongqing University, 6 https://ror.org/023rhb549 grid.190737.b 0000 0001 0154 0904 Clinical Research Center (CRC), Medical Pathology Center (MPC), Cancer Early Detection and Treatment Center (CEDTC) and Translational Medicine Research Center (TMRC), Chongqing University Three Gorges Hospital, Chongqing University, 7 https://ror.org/053w1zy07 grid.411427.5 0000 0001 0089 3695 The Center for Heart Development, Hunan Normal University, 8 https://ror.org/00swtqp09 grid.484195.5 Guangdong Provincial Key Laboratory of Pathogenesis, Targeted Prevention and Treatment of Heart Disease, 9 https://ror.org/033vnzz93 grid.452206.7 0000 0004 1758 417X College of Artificial Intelligence Medicine, Department of Oncology, The First Affiliated Hospital of Chongqing Medical University, 10 https://ror.org/04qr3zq92 grid.54549.39 0000 0004 0369 4060 Ultrasound in Cardiac Electrophysiology and Biomechanics Key Laboratory of Sichuan Province, Sichuan Provincial People’s Hospital, University of Electronic Science and Technology of China, 11 https://ror.org/04qr3zq92 grid.54549.39 0000 0004 0369 4060 Sichuan Provincial Key Laboratory for Human Disease Gene Study and the Center for Medical Genetics, Department of Cardiology, Sichuan Academy of Medical Sciences and Sichuan Provincial People’s Hospital, University of Electronic Science and Technology of China, 26 9 2025 2025 8 478257 1373 1 11 2024 20 8 2025 26 09 2025 28 09 2025 29 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Cardiac myxoma, the most common primary heart tumor, remains poorly understood at the molecular level. Here, we combined single-nucleus RNA sequencing, third-generation transcriptomics, and untargeted metabolomics to dissect its origin and pathology. Single-cell analyses demonstrate an endothelial origin driven by aberrant endothelial-to-mesenchymal transition (EndMT), with pseudotime and RNA-velocity tracing a continuum from endothelial-like to mesenchymal-like and metabolically active states. We identify two distinct myxoma subtypes: Subtype 1, marked by MAPK/WNT/EGFR pathway activation, and Subtype 2, characterized by ribosomal and oxidative phosphorylation signatures alongside immune-evasive programs. Third-generation data highlight extracellular matrix remodeling and endothelial signaling, while metabolomics reveal dysregulated purine, nicotinic acid, and nicotinamide metabolism. Notably, MET–PTK2 signaling emerges as a potential driver of tumor initiation and progression. These integrated findings define the cellular architecture and metabolic adaptations of cardiac myxoma and lay the foundation for future interventions. The effect of zingerone on postmenopausal osteoporosis, as modelled in mouse, was assessed The authors combine single-cell transcriptomics and bulk metabolomics to investigate cardiac myxoma. They identify Subtype 1 marked by MAPK/WNT/EGFR pathway activation and Subtype 2, characterized by ribosomal and oxidative phosphorylation signatures Subject terms Cardiology Cancer https://doi.org/10.13039/100012546 Chongqing Postdoctoral Science Foundation CSTB2023NSCQ‑BHX0114 Li Xiaoping pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Cardiac myxomas are the most common primary benign heart tumors, usually located in the left atrium 1 2 3 4 5 7 Recurrence in atrial myxoma cases is rare (1–3%) 4 4 A key challenge in understanding cardiac myxomas lies in determining their precise cellular origins and developmental mechanisms. Despite extensive research, these origins remain unclear, limiting progress in developing effective non-surgical treatments. Clarifying the cellular and molecular foundations of myxomas is essential for developing molecular targeted therapies that could offer alternatives to surgery. Traditional methods, such as immunohistochemistry, electron microscopy, and tissue culture, have provided inconsistent and sometimes contradictory findings regarding the cellular origins of myxomas 8 12 8 9 10 8 10 10 12 10 12 13 Our study integrates single-cell nuclear sequencing, third-generation transcriptomics, and metabolomics to provide deep insights into cardiac myxoma. This analysis elucidated the endothelial origins of these tumors and mapped their developmental processes, emphasizing the key roles of endothelial-to-mesenchymal transition (EndMT) and extracellular matrix remodeling in tumor progression. Furthermore, our research uncovered intricate cellular interactions within the tumor microenvironment and highlighted critical metabolic pathways, such as purine, niacin, and nicotinamide metabolism, involved in tumor pathogenesis. These insights are crucial for developing targeted therapies for specific tumor subpopulations. This approach offers valuable insights that may contribute to the development of personalized treatment options, potentially improving clinical management and patient outcomes for cardiac myxoma. Results Single-cell transcriptomic atlas of cardiac myxoma and myocardium In this study, the patients ranged in age from 30 to 76 years, including nine females and eight males. The volume of the myxomas varied between 1.88 and 99.49 cm 3 1 1 1A Fig. 1 Single-cell transcriptomic of cardiac myxoma. A B C D E F Table 1 The key clinical characteristics of the patients ID Sampels Age Gender Size (cm) NYHA BNP (pg/mL, 0–100) CKMB (ng/ml, 0–6.6) MYO (ng/ml, 0–140.1) hsTnI (ng/L, 0–34.2) P1 N, T 76 Female 1.6*1.5 2 <10 0.3 39.4 2.6 P2 stalk/body 48 Female 5.5*2.8 3 345.9 0.4 23.9 18.6 P3 N, T 33 Female 5.1*3 3 3.6 24.5 2345.9 P4 N, T 60 Female 5*3.1 150.8 52.5 185 4209.5 P5 N, T 57 Female 4.9*3.4 3 0.5 25.9 4.6 P6 T 65 Male 7.5*3.4 4 480.2 43.1 364.3 4782 Note: Single-cell/nucleus RNA sequencing (sc/snRNA-seq) was performed on eight cardiac myxoma samples from six patients, along with five matched cardiac tissue samples and two normal heart tissue samples. To investigate the spatiotemporal heterogeneity of cardiac myxomas, we collected samples from the stalk and main body of the tumor in the same patient: P2 (P2T1, stalk; P2T2, main body). After filtering out low-quality cells, the final dataset comprised 99,248 single cells, with a median of 1445 genes detected per cell. The number of cells per sample ranged from 2849 to 13,423 (Fig. 1B, C 1D, E S2 1C S2 1F 1F Furthermore, we compared snRNA and scRNA sequencing results. The results showed no significant differences in the number of cells detected or the number of genes between the two methods (Fig. S1A, B S1D–H S2A–C S2C, D S2C, D The characteristics of copy number variants (CNV) To further characterize cardiac myxoma cells, we conducted a comprehensive analysis of copy number variations (CNVs) within these tumors. Based on CNV profiles, cells were classified as either normal or tumor cells (Fig. 2A S3 2B, C S3 2A, B S3 2D Fig. 2 Copy number variation (CNV) in cardiac myxoma cells. A B C D E F Additionally, we observed abnormal activation of the MET_ACTIVATES_PTK2_SIGNALING and ECM_PROTEOGLYCANS pathways in most tumor subclones (Fig. 2E Furthermore, CNV analysis across all tumor samples indicated that shared CNVs between different tumors are extremely rare (Fig. 2F). High-frequency CNVs included deletions on chromosome 19 (p13.3–p13.11, q13.12–q13.43, q13.2–q13.43) and amplifications on chromosome 1 (p36.33–p21.2, p33–p21.1) and chromosome 9 (p24.3–q21.33, p24.3–q21.32) (Fig. 2 14 16 The characterization and cell lineages of cardiac myxoma Next, we focused on characterizing the transcriptomes of myxoma cells defined by genes significantly overexpressed within these tumor cells. We first evaluated the expression levels of previously reported myxoma-related markers at the single-cell level. Among these, SOX5, SOX6, GATA4, and CDH11 demonstrated high specificity, while PDGFRA, CD44, TGFBR2, NFATC2, and MMP2 exhibited lower specificity (Fig. S4A S4A B S2 Our analysis revealed that genes associated with cardiac myxoma were significantly enriched in biological processes essential for epithelial cell proliferation and migration, as well as those involved in vascular development, MAPK signaling, WNT signaling, and cell adhesion (Fig. S4C 3A 17 Fig. 3 The characterization and cell lineages of cardiac myxoma. A B C D E F Specifically, EndMT contributes to the remodeling of the extracellular matrix (ECM), enhancing collagen deposition, which is consistent with the mucoid characteristics of cardiac myxoma 18 19 18 20 S4D S3 3B 3B Based on the expression of specific endothelial cell markers, we characterized myxoma cells as negative for von Willebrand factor (VWF) and kinase insert domain receptor (KDR or VEGFR2), yet positive for endoglin (ENG) and platelet/endothelial cell adhesion molecule 1 (PECAM1 or CD31) (Fig. 3C 3D S5A To further delineate the characteristics of myxoma cells, we conducted a comparative transcriptomic analysis between myxoma cells and endothelial/fibroblast cells in cardiac myxoma samples. Our findings revealed that tumor-associated signature molecules were significantly overexpressed in myxoma cells relative to endothelial and fibroblast cells, underscoring the unique tumorigenic properties of myxoma cells (Fig. S5B S5C S5D S5E To further elucidate the relationship between endothelial and myxoma cells, endothelial cells were stratified into three distinct subtypes (Fig. S6A S6C S6B S4 S6D 6B S4 6B S4 Next, we reconstructed developmental trajectories for endothelial and myxoma cells using pseudotime analysis, which suggested a direct lineage transition from endothelial cells into myxoma clusters (Fig. 3E S7 3F S8 S9 Finally, pathway enrichment analysis uncovered a stage-dependent phenotypic shift. Early-stage myxoma cells (P2T1, tumor pedicle) were enriched for vascular endothelial–related pathways, including vasoconstriction and circulatory system processes (Fig. S 2E, F 2C The heterogeneity and dynamic development of Myxoma cells To uncover the distinct cellular states within myxoma tumors and identify the key transition events and signaling pathways that drive their evolution from origin to more advanced stages, we extracted tumor cells to construct pseudo-temporal developmental trajectories. We classified myxoma cells into three distinct states based on their developmental trajectories (Fig. 4A S10 4B 4E 4 4F 4G Fig. 4 Dynamic progression of cardiac myxoma cells. A B D E G The subtypes of cardiac myxoma In clinical settings, cardiac myxomas are categorized into two main gross anatomical types: a solid and smooth mass type, and a soft and friable gelatinous type, each associated with distinct clinical presentations 21 21 5A GSE265921 S11B, C Fig. 5 Identification of myxoma subtypes. A B C D E F G Subtype 1 was defined by strong upregulation of oncogenic drivers—PVT1, CCND3, MLLT10, SETBP1, and BCAS3 (Fig. 5 S5 5C 5B, D, F, G S 5 S11A The tumor microenvironment of cardiac myxoma To gain a comprehensive understanding of the immune microenvironment in cardiac myxoma, we analyzed primary immune cells, particularly T cells and macrophages, in both myxoma and normal tissue samples. The analysis revealed that the predominant macrophage subtypes in myxoma were M2 macrophages (CD163, MRC1, IL2RA) and monocytes (CSF3R, FCN1, CD14), with a significant increase in their absolute numbers within myxoma tissues (Fig. 6A–E 6F–J Fig. 6 Immune microenvironment landscape of cardiac myxoma. A B C D E F G H I J The cell–cell interaction between myxoma and tumor microenvironment cells To elucidate the intricate interactions among different cell types within the tumor microenvironment, we conducted an extensive analysis of intercellular communication. Results showed significant interactions between mucinous tumor cells and other cellular components, including macrophages, endothelial cells, fibroblasts, cardiomyocytes, T cells, and B cells. Our findings uncover a complex molecular network that plays a critical role in the activation of signaling pathways, including endothelial cell migration, TGF-β, Notch, G-protein-coupled signaling, and inflammatory chemokine signaling (Fig. 7A, B 7B 7B, C Fig. 7 The cell–cell interaction between myxoma and tumor microenvironment cells. . ( A B C D We also discovered that interactions between ADGRG6 and COL4A1, COL4A2, and LAMA2 (Fig. 7B, C 7B, C 7B, C 7C Within the patient’s immune microenvironment, we observed frequent communication between mucinous tumor cells, macrophages, and T cells. This interaction is characterized by the activation of chemokine signaling pathways, such as the CXCL12-CXCR4 axis (Fig. 7B, D 7B, D Integrative Third-Generation Transcriptomics and Untargeted Metabolomics Reveal Unique Signatures of Cardiac Myxoma We employed third-generation integrated transcriptomic and untargeted metabolomic sequencing to further delineate the molecular landscape of cardiac myxoma, thereby unveiling its unique molecular characteristics. In alignment with single-cell sequencing data, our differential gene expression analysis revealed significant overexpression of CDH11, TIMP1/3, PECAM1, MMP2, and PED1A in myxomas (Fig. 8A S12A 8A S12A S12B 8B S12C Fig. 8 Characteristics of myxoma based on third-generation transcriptomics and Metabolomics. . ( A B C D E F G H Next, we investigated the distinct metabolic signatures of myxomas, revealing that the metabolic characteristics of myxoma tissues are significantly different from those of normal cardiac tissues, indicative of unique biological processes. Our comprehensive analysis identified 1,268 high-quality metabolites; among these, 210 were significantly upregulated, while 132 were significantly downregulated in myxoma tissues (Figure S12D 8C Purine metabolism, critical for nucleic acid synthesis, is central to DNA and RNA production. Enhanced purine metabolism can lead to increased cell proliferation and resistance to apoptotic signals. Conversely, disruptions in arginine metabolism can impair immune cell functions, potentially enabling tumors to evade immune surveillance. Proline, crucial for collagen synthesis, also plays a role in cellular stress responses. The elevated metabolism of nicotinate and nicotinamide, precursors of NAD + , aids in meeting increased energy demands and combating oxidative stress. Additionally, the histidine metabolic pathway generates bioactive molecules such as nitric oxide (NO), which may facilitate tumor proliferation, invasiveness, and immune evasion by stimulating angiogenesis and modifying immune responses through the upregulation of enzymes like nitric oxide synthase (NOS). These biological processes contribute to the development of myxoma. In addition, we evaluated metabolic pathways at the single cell transcriptomic level, focusing on myxoma cells. Our analysis revealed pronounced expression of genes associated with purine metabolism (Fig. 8D–F 8G-H Discussion Our study is the first to comprehensively analyze cardiac myxomas using multi-omics integration, including single-nucleus RNA sequencing (snRNA-seq), third-generation transcriptomics, and metabolomics. This approach has provided valuable insights into the transcriptional landscape, cellular heterogeneity, and dynamic developmental processes of cardiac myxomas, shedding light on aspects of their biology that were previously obscured by less sensitive techniques, and offering a precious dataset for understanding this rare disease. Research into cardiac myxomas has faced significant challenges, particularly in unraveling their origins and developmental mechanisms. Despite extensive investigations, the exact origins of these tumors remain elusive 8 12 Accumulating evidence increasingly supports the hypothesis that cardiac myxomas arise from embryonic endocardial endothelial cells. Morphological analyses reveal that cardiac myxomas exhibit a strong resemblance to endothelial cells, particularly in their vascular-like structures 17 22 23 17 22 23 17 22 23 Further supporting this hypothesis, myxoma cells also express markers associated with endothelial-to-mesenchymal transition (EMT), such as Sox9 and alpha-smooth muscle actin (α-SMA) 24 26 24 26 24 25 Some studies have reported the expression of cardiomyocyte-specific transcription factors like Nkx2.5 and GATA-4 in myxoma cells 13 24 Taken together, the body of evidence strongly favors the hypothesis that cardiac myxomas originate from embryonic endothelial cells that have retained their differentiation potential and exhibit characteristics of arrested endothelial-to-mesenchymal transition 13 27 24 Our single-cell data analysis provides compelling evidence for the endothelial origin of cardiac myxomas, demonstrated by the enrichment of endothelial-related biological processes and validated through immunohistochemical analysis. Additionally, analysis of myxoma samples from different developmental stages in the same patient provides direct evidence of a phenotypic transition from endothelial to mesenchymal characteristics, from early (tumor pedicle) to late (tumor body) stages. Such phenotypic plasticity is likely crucial for tumor progression, consistent with previous studies reporting both endothelial-like and mesenchymal-like states in cardiac myxomas 28 Our research emphasizes the role of EndMT as a key driver of phenotypic transition in cardiac myxomas, offering deeper insights into tumor progression and identifying new opportunities for therapeutic intervention. EndMT is a fundamental biological process in which endothelial cells acquire mesenchymal and invasive properties, contributing to embryonic development, wound healing, and the pathogenesis of various diseases, including fibrosis and cancer 27 29 30 29 28 31 Our findings indicate that endothelial cells in cardiac myxomas undergo a transformation marked by the loss of endothelial markers such as VWF and KDR and the acquisition of mesenchymal markers like ENG and CD31. The expression of mesenchymal-associated genes such as MECOM and WWTR1 further supports this phenotypic shift, which promotes extracellular matrix deposition, a hallmark of myxoma structure. Interestingly, ENG and CD31, typically associated with endothelial lineage, remain expressed even as cells acquire mesenchymal characteristics, suggesting a partial or incomplete transition. This partial EndMT state may endow tumor cells with unique properties, including enhanced migration, resistance to apoptosis, and altered intercellular interactions. Sustained activation of signaling pathways such as TGF-β, Notch, and Wnt/β-catenin further supports the role of EndMT in myxoma progression. TGF-β is well known for its role in inducing EndMT, promoting cell proliferation, differentiation, and extracellular matrix production, which are all observed in myxoma cells 32 34 35 36 37 38 Our results echo findings from other cancer studies, such as those by Zhang et al. in breast cancer 32 Pseudotime analysis has revealed the dynamic evolution of cellular states in cardiac myxomas, transitioning from predominantly endothelial-mesenchymal characteristics to those with higher metabolic activity. This transition outlines the progression pathways of myxomas, offering insights into the functional heterogeneity of myxoma cells at various developmental stages and enhancing our understanding of tumor progression. By elucidating these processes, our study provides essential insights into the complex biology of cardiac myxomas and highlights multiple potential points for therapeutic intervention. Notably, in each tumor sample, we observed a consistent, dominant CNV signature across all myxoma cells, supporting clonal expansion from a single transformed precursor. This finding implies that endothelial cells harboring specific DNA events (e.g., copy-number alterations) undergo endothelial-to-mesenchymal transition (EnMT) to generate the bulk mesenchymal-like myxoma population. Other mesenchymal cell types are exceedingly rare, whereas a small fibroblast-annotated subset shares comparable CNV scores with the endothelial- and tumor-derived cells, indicating a limited EnMT-derived fibroblast transition within the tumor. Furthermore, our integrated single-cell and third-generation transcriptomic analyses revealed robust activation of the MET–PTK2 signaling axis in the majority of tumor subclones, accompanied by significant alterations in upstream and downstream effectors. In particular, we detected a marked upregulation of hepatocyte growth factor (HGF), a critical ligand that engages MET to initiate oncogenic signaling cascades, thereby driving myxoma onset and progression 27 Furthermore, MET activation exhibited substantial cross-talk with other signaling pathways, including EGFR (epidermal growth factor receptor) and VEGFR (vascular endothelial growth factor receptor). This cross-activation, detected in both single-cell and third-generation transcriptomic analyses, adds to signaling complexity and contributes to resistance against therapies targeting single receptors. Once activated, MET phosphorylates and activates PTK2 (focal adhesion kinase), a non-receptor tyrosine kinase crucial for focal adhesion dynamics, which are essential for cell adhesion, migration, and survival—all key processes in myxoma development and progression 29 PTK2 activation leads to cytoskeletal reorganization, promoting focal adhesion turnover and actin filament remodeling, ultimately enhancing cell motility and enabling tumor invasion into surrounding tissues. Our data also showed activation of the downstream PI3K/AKT pathway, indicating potential interactions between PTK2 and these downstream effectors that promote cell survival and proliferation, thereby supporting tumor growth and inhibiting apoptosis. We also detected alterations in another key downstream effector, the MAPK/ERK signaling pathway, which plays a role in cell proliferation and tumorigenesis. Through this pathway, MET activation promotes cancer cell growth and differentiation, facilitating tumor progression. Additionally, PTK2 activates Rho GTPases, such as Rac1 and RhoA, which regulate cell shape and motility, further enhancing cancer cell migration potential. Collectively, these findings suggest that MET activation of the PTK2 pathway plays a central role in cardiac myxoma development by driving its initiation and progression through multiple downstream signaling changes. The MET–PTK2 signaling axis significantly enhances cell motility, enabling tumor cells to invade the extracellular matrix (ECM). This axis is also associated with epithelial-to-mesenchymal transition (EMT), which aligns with the phenotypic changes observed in myxomas, where endothelial cells acquire mesenchymal characteristics, thereby promoting migratory and invasive properties. Activation of the PI3K/AKT and MAPK/ERK pathways further supports cancer cell survival and proliferation, even under adverse conditions, providing a growth advantage. Moreover, MET activation influences angiogenesis by upregulating pro-angiogenic factors, consistent with the high expression of vascular-related molecules detected in myxomas, thereby enhancing the supply of nutrients and oxygen to the tumor and further supporting its growth and invasive potential. In conclusion, the activation of the MET–PTK2 signaling pathway is central to the initiation and progression of cardiac myxomas. It drives phenotypic plasticity, promotes EMT, enhances motility, and supports survival and angiogenesis. These findings highlight the MET–PTK2 axis as a promising target for therapeutic intervention to combat cardiac myxoma progression. Future strategies targeting MET, PTK2, and their downstream effectors may offer promising avenues for limiting tumor growth, particularly in inoperable cardiac myxomas, and improving patient outcomes. Cardiac myxomas have two main gross anatomical types: a solid and smooth mass type, and a soft and friable gelatinous type. Shimono et al. discovered that the clinical presentation is related to the tumor’s gross appearance 21 21 21 The extensive interactions among cells within the myxoma microenvironment reveal its complexity. Frequent interactions between tumor cells and endothelial, fibroblastic, and immune cells demonstrate the collaborative roles of various cell types in tumor development. Notably, ADGRG6 is involved in tissue development and maintenance 39 40 41 42 43 44 45 46 47 50 Third-generation transcriptomic sequencing results have validated and extended the findings of single-cell RNA sequencing at the molecular and pathway levels, with significant activation of collagen and vascular-related processes indicating their critical roles in myxoma progression. Overall, these results enhance our understanding of the molecular mechanisms of myxomas and provide a solid foundation for future research. Metabolomic analysis has revealed significant metabolic differences between cardiac myxomas and normal tissues, particularly in pathways like purine metabolism and niacin and nicotinamide metabolism. Enhanced purine metabolism may promote tumor cell proliferation and anti-apoptotic capabilities 51 52 53 55 In conclusion, this study offers a comprehensive exploration of the transcriptional and metabolic landscape of cardiac myxomas, providing valuable insights that pave the way for future clinical research and therapeutic innovations. Our findings highlight the critical role of the EndMT process, metabolic pathways, and MET-PTK2 signaling axis in the pathogenesis of cardiac myxomas, suggesting that these elements could serve as key targets for intervention. Future investigations should aim to validate the clinical utility of these biomarkers and pathways, with particular emphasis on developing novel prevention and treatment strategies for cardiac myxomas. Moreover, expanding this line of research to examine the involvement of these pathways in other tumor types may reveal broader therapeutic opportunities, potentially leading to new directions in cancer treatment. Methods Samples collection Due to the rarity of cardiac myxoma, we were only able to collect six qualified myxoma specimens and seven normal endocardial control tissues for single-cell/single-nucleus RNA sequencing. Additionally, 20 samples (10 myxomas and 10 normals) were subjected to third-generation transcriptome sequencing, and a further 20 samples (10 myxomas and 10 normals) were analyzed by non-targeted metabolomics. All specimens were obtained from Sichuan Provincial People’s Hospital, with pathological confirmation of cardiac myxoma and informed consent from all patients. This study was approved by the Medical Ethics Committee of Sichuan Provincial People’s Hospital. All ethical regulations relevant to human research participants were followed. To further validate and extend our observations, we downloaded the publicly available single-cell RNA-seq dataset GSE265921 56 Single-cell/nucleus sequencing For single-cell and single-nucleus RNA sequencing, a total of 15 samples (8 cardiac myxomas and 7 normal endocardial tissues) were processed. Tissue samples were first mechanically dissociated to create a single-cell suspension, which was then filtered through a 40-μm cell strainer. For single-nucleus sequencing, the filtered cells were subjected to a lysis buffer to isolate nuclei, which were then stained with DAPI and sorted using fluorescence-activated cell sorting (FACS). For single-cell sequencing, intact cells were used directly. Both single cells and nuclei were loaded onto a microfluidic chip for RNA sequencing using the 10× Genomics Chromium platform. In this step, cells/nuclei were encapsulated with barcoded gel beads in emulsion (GEMs), where reverse transcription occurred to generate barcoded cDNA. The cDNA was amplified, and sequencing libraries were constructed by adding sequencing adapters and indices. The resulting libraries were quantified, quality-checked, and sequenced on an Illumina platform, ensuring comprehensive transcriptomic profiling of cardiac myxoma and normal endocardial tissue at the single-cell and single-nucleus levels. Preprocessing of single-cell/nucleus sequencing data The raw single-cell RNA sequencing data generated from the 10x Genomics Chromium platform were processed using the Cell Ranger software (version 7.1). First, the cellranger mkfastq command was used to demultiplex the raw base call (BCL) files into FASTQ files, corresponding to each sample. These FASTQ files were then processed using the cellranger count pipeline, which performs alignment, filtering, barcode counting, and UMI counting. The reference genome for human (GRCh38) was used for alignment. During this step, Cell Ranger aligned the reads to the reference genome using the STAR aligner, filtered out low-quality reads and cells, and counted unique molecular identifiers (UMIs) associated with each gene. The output of this process included a gene-barcode matrix, which indicates the expression level of each gene in each cell, as well as quality control metrics such as the number of genes detected per cell, total UMI counts, and percentage of mitochondrial reads. All Cell Ranger parameters were used at their default/recommended settings. The processed single-cell and single-nucleus RNA sequencing data were analyzed using the Scanpy57 package (version 1.10.0) in Python (Version 3.9.12). Initially, we calculated the proportions of mitochondrial, ribosomal, and hemoglobin genes for each cell. Cells with more than 20% mitochondrial or ribosomal gene expression were filtered out, as these cells are likely in an apoptotic state. Similarly, cells with more than 20% hemoglobin gene expression were identified as erythrocytes and excluded. Additionally, cells with expression profiles deviating by more than 5 median absolute deviations from the median were identified as aberrant and excluded from the analysis. To correct for ambient RNA contamination, we utilized SoupX 57 58 Normalization, integration, dimensionality reduction, and clustering of scRNA/snRNA-seq data Cells that passed quality control were selected for further analysis. Background-corrected raw UMI count matrices were processed in Scanpy 59 60 61 62 Enrichment analysis The clusterProfiler package 63 p CNV analysis The R package SCEVAN 64 Pseudotime analysis To perform pseudotime analysis, we utilized the Monocle2 65 For trajectory visualization, we used the plot_cell_trajectory function, coloring cells by pseudotime, state, or gene expression levels. To identify genes with significant changes along the pseudotime, we conducted a differential gene expression analysis using the differentialGeneTest function, focusing on genes with a q-value < 0.01. The dynamic expression of these genes across the pseudotime trajectory was further explored using plot_genes_in_pseudotime. All Monocle2 functions were executed with their default parameters as recommended by the package authors. Next, we inferred RNA velocity. First, we ran the velocyto run command on the Cell Ranger–aligned BAM files—providing the matching barcodes file, repeat-mask GTF, and reference gene annotations—to generate spliced and unspliced count matrices. The resulting loom files were loaded into Python using Scanpy (v1.10.0) and scVelo (v0.2.4). After inspecting spliced/unspliced ratios for quality control, we used the function scv.pp.filter_and_normalize to normalize and filter the data (parameters: min_shared_counts = 20, n_top_genes = 2000). We then used the function sc.pp.neighbors to construct a neighborhood graph on the Harmony-corrected embedding (use_rep = “X_harmony”, n_neighbors = 30) and the function scv.pp.moments to compute second-order moments (n_pcs = 30, n_neighbors = 30). Finally, we estimated velocities by applying the function scv.tl.velocity (mode = “stochastic”), built the velocity graph with the function scv.tl.velocity_graph, and visualized streamlines over the UMAP embedding using the function scv.pl.velocity_embedding_stream. All functions were executed with their recommended default settings to ensure reproducibility. Immunohistochemistry Formalin-fixed, paraffin-embedded cardiac myxoma sections (4 µm) were deparaffinized in xylene and rehydrated through graded ethanol. Antigen retrieval was performed in a pressure cooker using 0.01 M sodium citrate buffer (pH 6.0) for 15 min. Endogenous peroxidase activity was quenched with 3% hydrogen peroxide for 10 min, and nonspecific binding was blocked with 5% normal goat serum for 30 min at room temperature. Sections were incubated overnight at 4 °C with primary antibodies against eight markers—PECAM1 (CD31), CD34, Desmin, α-SMA, SOX9, S100, NES200, and PGP9.5—each at dilutions of 1:100–1:500. After washing, slides were incubated with biotinylated secondary antibodies and the VECTASTAIN ABC reagent, and antigen–antibody complexes were visualized using 3,3′-diaminobenzidine (DAB). Finally, sections were counterstained with hematoxylin, dehydrated, and mounted. All antibody dilutions, incubation times, and detection steps were performed according to the manufacturers’ instructions. Cellphone We used CellPhoneDB 66 p Third-generation transcriptome sequencing For third-generation transcriptome sequencing, RNA was extracted from the samples following a standard protocol to ensure high integrity for subsequent analysis. The extracted RNA was then subjected to long-read sequencing using the PacBio platform 67 After sequencing, raw reads were processed using the PacBio SMRT Analysis software 67 68 69 The expression data were normalized using the TPM (Transcripts Per Million) method to account for differences in sequencing depth and gene length, ensuring comparability across samples. Differential gene expression analysis was performed using the limma package 70 p 71 Non-targeted metabolomics sequencing For non-targeted metabolomics sequencing, metabolites were extracted from the samples using a standardized protocol involving solvent extraction, typically with a mixture of methanol and water. The extracted metabolites were subsequently analyzed using high-resolution liquid chromatography–mass spectrometry (LC–MS) 72 After data acquisition, raw mass spectrometry data were preprocessed using software tools such as XCMS 73 74 m z 75 Normalization of the metabolite data was performed to account for variations in sample preparation and instrument performance, typically using total ion current (TIC) normalization. The normalized data were then log-transformed to stabilize variance across samples. Differential metabolite analysis was conducted using statistical methods such as limma 70 p 76 Statistics and reproducibility Data from single‑nucleus RNA sequencing, third‑generation transcriptomics, and targeted sequencing were processed using established analytical workflows, with statistical methods detailed in the Methods section. Reproducibility was validated using an independent external cohort and multiple independent datasets. Reporting summary Further information on research design is available in the Nature Portfolio Reporting Summary Supplementary information  Supplementary Information Reporting Summary Transparent Peer Review file Supplementary Tables S1–S5 Publisher’s note These authors contributed equally: Shengzhong Liu, Wanfeng Zhang, Huajun Sun, Chenqing Zheng. Supplementary information The online version contains Supplementary Material available at 10.1038/s42003-025-08752-y. Acknowledgements We acknowledge support from the Natural Science Foundation of Chongqing (CSTC) Postdoctoral Science Foundation Project [Grant No. CSTB2023NSCQ‑BHX0114]. Author contributions Shengzhong Liu, Wanfeng Zhang, Huajun Sun, Chenqing Zheng, Xiushan Wu, Longke Ran, and Xiaoping Li conceived and designed the study. Wanfeng Zhang performed data analysis and drafted the manuscript with assistance from Keli Huang, Chengming Fan, Rensheng Lai, Mingzhu Yin, and Jie Lan. Shengzhong Liu and Huajun Sun collected samples and performed immunohistochemistry. All authors reviewed and approved the final manuscript. Peer review Peer review information Communications Biology Data availability Raw single-nucleus RNA-seq reads have been deposited in the NCBI Sequence Read Archive under BioProject PRJNA1302661. Processed count matrices and associated metadata are available in the Gene Expression Omnibus under accession GSE305759 Code availability All analysis scripts used in this study are available on Zenodo at 10.5281/zenodo.16615279 77 Competing interests The authors declare no competing interests. References 1. Majano-Lainez RA Cardiac tumors: a current clinical and pathological perspective[J] Crit. Rev. ™ Oncogenesis 1997 8 293 303 10.1615/CritRevOncog.v8.i4.10 9622051 Majano-Lainez, R. A. Cardiac tumors: a current clinical and pathological perspective[J]. Crit. Rev. ™ Oncogenesis 8 9622051 10.1615/critrevoncog.v8.i4.10 2. Leja MJ Shah DJ Reardon MJ Primary cardiac tumors Tex. heart Inst. J. 2011 38 261 21720466 PMC3113129 Leja, M. J., Shah, D. J. & Reardon, M. J. Primary cardiac tumors. Tex. heart Inst. J. 38 21720466 PMC3113129 3. MacGowan S Atrial myxoma: national incidence, diagnosis and surgical management Ir. J. Med. Sci. 1993 162 223 226 10.1007/BF02945200 8407260 MacGowan, S. et al. Atrial myxoma: national incidence, diagnosis and surgical management. Ir. J. Med. Sci. 162 8407260 10.1007/BF02945200 4. Reynen K Cardiac myxomas N. Engl. J. Med. 1995 333 1610 1617 10.1056/NEJM199512143332407 7477198 Reynen, K. Cardiac myxomas. N. Engl. J. Med. 333 7477198 10.1056/NEJM199512143332407 5. Garatti A Surgical excision of cardiac myxomas: twenty years experience at a single institution Ann. Thorac. Surg. 2012 93 825 831 10.1016/j.athoracsur.2011.11.009 22296980 Garatti, A. et al. Surgical excision of cardiac myxomas: twenty years experience at a single institution. Ann. Thorac. Surg. 93 22296980 10.1016/j.athoracsur.2011.11.009 6. Piazza N Primary cardiac tumours: eighteen years of surgical experience on 21 patients Can. J. Cardiol. 2004 20 1443 1448 15614339 Piazza, N. et al. Primary cardiac tumours: eighteen years of surgical experience on 21 patients. Can. J. Cardiol. 20 15614339 7. Kuroczyński W Cardiac myxomas: short-and long-term follow-up Cardiol. J. 2009 16 447 454 19753524 Kuroczyński, W. et al. Cardiac myxomas: short-and long-term follow-up. Cardiol. J. 16 19753524 8. Burke AP Virmani R Cardiac myxoma: a clinicopathologic study Am. J. Clin. Pathol. 1993 100 671 680 10.1093/ajcp/100.6.671 8249916 Burke, A. P. & Virmani, R. Cardiac myxoma: a clinicopathologic study. Am. J. Clin. Pathol. 100 8249916 10.1093/ajcp/100.6.671 9. Tanimura A Cardiac myxoma: morphologic, histochemical, and tissue culture studies Hum. Pathol. 1988 19 316 322 10.1016/S0046-8177(88)80525-2 3126128 Tanimura, A. et al. Cardiac myxoma: morphologic, histochemical, and tissue culture studies. Hum. Pathol. 19 3126128 10.1016/s0046-8177(88)80525-2 10. Deshpande A Phenotypic characterization of cellular components of cardiac myxoma: a light microscopy and immunohistochemistry study Hum. Pathol. 1996 27 1056 1059 10.1016/S0046-8177(96)90283-X 8892590 Deshpande, A. et al. Phenotypic characterization of cellular components of cardiac myxoma: a light microscopy and immunohistochemistry study. Hum. Pathol. 27 8892590 10.1016/s0046-8177(96)90283-x 11. Govoni E Ultrastructural and immunohistochemical contribution to the histogenesis of human cardiac myxoma Ultrastruct. Pathol. 1988 12 221 233 10.3109/01913128809058220 3363683 Govoni, E. et al. Ultrastructural and immunohistochemical contribution to the histogenesis of human cardiac myxoma. Ultrastruct. Pathol. 12 3363683 10.3109/01913128809058220 12. Pucci A Histopathologic and clinical characterization of cardiac myxoma: review of 53 cases from a single institution Am. Heart J. 2000 140 134 138 10.1067/mhj.2000.107176 10874274 Pucci, A. et al. Histopathologic and clinical characterization of cardiac myxoma: review of 53 cases from a single institution. Am. Heart J. 140 10874274 10.1067/mhj.2000.107176 13. Kodama H Cardiomyogenic differentiation in cardiac myxoma expressing lineage-specific transcription factors Am. J. Pathol. 2002 161 381 389 10.1016/S0002-9440(10)64193-4 12163362 PMC1850740 Kodama, H. et al. Cardiomyogenic differentiation in cardiac myxoma expressing lineage-specific transcription factors. Am. J. Pathol. 161 12163362 10.1016/S0002-9440(10)64193-4 PMC1850740 14. Casey M Identification of a novel genetic locus for familial cardiac myxomas and Carney complex Circulation 1998 98 2560 2566 10.1161/01.CIR.98.23.2560 9843463 Casey, M. et al. Identification of a novel genetic locus for familial cardiac myxomas and Carney complex. Circulation 98 9843463 10.1161/01.cir.98.23.2560 15. Dijkhuizen No cytogenetic evidence for involvement of gene (s) at 2p16 in sporadic cardiac myxomas: cytogenetic changes in ten sporadic cardiac myxomas Cancer Genet. Cytogenetics 2001 126 162 165 10.1016/S0165-4608(00)00402-7 11376810 Dijkhuizen et al. No cytogenetic evidence for involvement of gene (s) at 2p16 in sporadic cardiac myxomas: cytogenetic changes in ten sporadic cardiac myxomas. Cancer Genet. Cytogenetics 126 11376810 10.1016/s0165-4608(00)00402-7 16. Amano J Cardiac myxoma: its origin and tumor characteristics Ann. Thorac. Cardiovasc. Surg. 2003 9 215 221 13129418 Amano, J. et al. Cardiac myxoma: its origin and tumor characteristics. Ann. Thorac. Cardiovasc. Surg. 9 13129418 17. Torres JMV Cardiac myxoma: review and update of contemporary immunohistochemical markers and molecular pathology Adv. Anat. Pathol. 2020 27 380 384 10.1097/PAP.0000000000000275 32732585 Torres, J. M. V. et al. Cardiac myxoma: review and update of contemporary immunohistochemical markers and molecular pathology. Adv. Anat. Pathol. 27 32732585 10.1097/PAP.0000000000000275 18. Loire R Tabib A Histopathologic study of cardiac myxoma. Apropos of 80 surgical cases Arch. Anat. Cytol. Pathol. 1991 39 5 13 2059074 Loire, R. & Tabib, A. Histopathologic study of cardiac myxoma. Apropos of 80 surgical cases. Arch. Anat. Cytol. Pathol. 39 2059074 19. Ghosh AK Molecular basis of cardiac endothelial-to-mesenchymal transition (EndMT): differential expression of microRNAs during EndMT Cell. Signal. 2012 24 1031 1036 10.1016/j.cellsig.2011.12.024 22245495 PMC3298765 Ghosh, A. K. et al. Molecular basis of cardiac endothelial-to-mesenchymal transition (EndMT): differential expression of microRNAs during EndMT. Cell. Signal. 24 22245495 10.1016/j.cellsig.2011.12.024 PMC3298765 20. Spirito R Extracardiac myxoma: an unusual right ventricular epicardial location J. Thorac. Cardiovasc. Surg. 1997 114 672 674 10.1016/S0022-5223(97)70059-X 9338655 Spirito, R. et al. Extracardiac myxoma: an unusual right ventricular epicardial location. J. Thorac. Cardiovasc. Surg. 114 9338655 10.1016/s0022-5223(97)70059-x 21. Shimono T Left atrial myxomas: using gross anatomic tumor types to determine clinical features and coronary angiographic findings Chest 1995 107 674 679 10.1378/chest.107.3.674 7874936 Shimono, T. et al. Left atrial myxomas: using gross anatomic tumor types to determine clinical features and coronary angiographic findings. Chest 107 7874936 10.1378/chest.107.3.674 22. Di Vito A Mignogna C Donato G The mysterious pathways of cardiac myxomas: a review of histogenesis, pathogenesis and pathology Histopathology 2015 66 321 332 10.1111/his.12531 25297937 Di Vito, A., Mignogna, C. & Donato, G. The mysterious pathways of cardiac myxomas: a review of histogenesis, pathogenesis and pathology. Histopathology 66 25297937 10.1111/his.12531 23. Di Vito A Histogenesis of cardiac myxoma: the potential role of the cardiac neural crest Ital. J. Anat. Embryol. 2016 121 176 Di Vito, A. et al. Histogenesis of cardiac myxoma: the potential role of the cardiac neural crest. Ital. J. Anat. Embryol. 121 24. Orlandi A Cardiac myxoma cells exhibit embryonic endocardial stem cell features J. Pathol. 2006 209 231 239 10.1002/path.1959 16508920 Orlandi, A. et al. Cardiac myxoma cells exhibit embryonic endocardial stem cell features. J. Pathol. 209 16508920 10.1002/path.1959 25. Singh A Endothelial-to-mesenchymal transition in cardiovascular pathophysiology Int. J. Mol. Sci. 2024 25 6180 10.3390/ijms25116180 38892367 PMC11173124 Singh, A. et al. Endothelial-to-mesenchymal transition in cardiovascular pathophysiology. Int. J. Mol. Sci. 25 38892367 10.3390/ijms25116180 PMC11173124 26. Lu C-C Developmental pathways and endothelial to mesenchymal transition in canine myxomatous mitral valve disease Vet. J. 2015 206 377 384 10.1016/j.tvjl.2015.08.011 26586213 Lu, C.-C. et al. Developmental pathways and endothelial to mesenchymal transition in canine myxomatous mitral valve disease. Vet. J. 206 26586213 10.1016/j.tvjl.2015.08.011 27. Pacheco-Velázquez SC Heart myxoma develops oncogenic and metastatic phenotype J. Cancer Res. Clin. Oncol. 2019 145 1283 1295 10.1007/s00432-019-02897-0 30900156 PMC11810171 Pacheco-Velázquez, S. C. et al. Heart myxoma develops oncogenic and metastatic phenotype. J. Cancer Res. Clin. Oncol. 145 30900156 10.1007/s00432-019-02897-0 PMC11810171 28. Liu X Resolving the heterogeneous tumour microenvironment in cardiac myxoma through single-cell and spatial transcriptomics Clin. Transl. Med. 2024 14 e1581 10.1002/ctm2.1581 38318640 PMC10844892 Liu, X. et al. Resolving the heterogeneous tumour microenvironment in cardiac myxoma through single-cell and spatial transcriptomics. Clin. Transl. Med. 14 38318640 10.1002/ctm2.1581 PMC10844892 29. Ciszewski WM Cytoskeleton reorganization in EndMT—the role in cancer and fibrotic diseases Int. J. Mol. Sci. 2021 22 11607 10.3390/ijms222111607 34769036 PMC8583721 Ciszewski, W. M. et al. Cytoskeleton reorganization in EndMT—the role in cancer and fibrotic diseases. Int. J. Mol. Sci. 22 34769036 10.3390/ijms222111607 PMC8583721 30. Gasparics Á When the endothelium scores an own goal: endothelial cells actively augment metastatic extravasation through endothelial-mesenchymal transition Am. J. Physiol. 2016 310 H1055 H1063 10.1152/ajpheart.00042.2016 26993222 Gasparics, Á et al. When the endothelium scores an own goal: endothelial cells actively augment metastatic extravasation through endothelial-mesenchymal transition. Am. J. Physiol. 310 10.1152/ajpheart.00042.2016 26993222 31. Hong L EndMT: a promising and controversial field Eur. J. Cell Biol. 2018 97 493 500 10.1016/j.ejcb.2018.07.005 30082099 Hong, L. et al. EndMT: a promising and controversial field. Eur. J. Cell Biol. 97 30082099 10.1016/j.ejcb.2018.07.005 32. Li Z-X TGF- β Front. Oncol. 2022 12 1051148 10.3389/fonc.2022.1051148 36465358 PMC9709251 Li, Z.-X. et al. TGF- β Front. Oncol. 12 36465358 10.3389/fonc.2022.1051148 PMC9709251 33. Watabe, T. et al. Roles of TGF- β Seminars in Cancer Biology 10.1016/j.semcancer.2023.04.007 37068553 34. Xiao L Tumor endothelial cells with distinct patterns of TGF-β-driven endothelial-to-mesenchymal transition Cancer Res. 2015 75 1244 1254 10.1158/0008-5472.CAN-14-1616 25634211 PMC4383705 Xiao, L., et al. Tumor endothelial cells with distinct patterns of TGF-β-driven endothelial-to-mesenchymal transition. Cancer Res. 75 25634211 10.1158/0008-5472.CAN-14-1616 PMC4383705 35. Chimento A Notch signaling in breast tumor microenvironment as mediator of drug resistance Int. J. Mol. Sci. 2022 23 6296 10.3390/ijms23116296 35682974 PMC9181656 Chimento, A. et al. Notch signaling in breast tumor microenvironment as mediator of drug resistance. Int. J. Mol. Sci. 23 35682974 10.3390/ijms23116296 PMC9181656 36. Akil A Notch signaling in vascular endothelial cells, angiogenesis, and tumor progression: an update and prospective[J] Front. Cell Dev. Biol. 2021 9 642352 10.3389/fcell.2021.642352 33681228 PMC7928398 Akil, A. et al. Notch signaling in vascular endothelial cells, angiogenesis, and tumor progression: an update and prospective[J]. Front. Cell Dev. Biol. 9 33681228 10.3389/fcell.2021.642352 PMC7928398 37. Hiremath IS The multidimensional role of the Wnt/β-catenin signaling pathway in human malignancies J. Cell. Physiol. 2022 237 199 238 10.1002/jcp.30561 34431086 Hiremath, I. S. et al. The multidimensional role of the Wnt/β-catenin signaling pathway in human malignancies. J. Cell. Physiol. 237 34431086 10.1002/jcp.30561 38. He, K. & Gan, W.-J. Wnt/β-catenin signaling pathway in the development and progression of colorectal cancer. Cancer Manag. Res. 15 10.2147/CMAR.S411168 PMC10224676 37250384 39. Wilde C Collagen VI is a Gi-biased ligand of the adhesion GPCR GPR126/ADGRG6 Cells 2023 12 1551 10.3390/cells12111551 37296671 PMC10252604 Wilde, C. et al. Collagen VI is a Gi-biased ligand of the adhesion GPCR GPR126/ADGRG6. Cells 12 37296671 10.3390/cells12111551 PMC10252604 40. Wang S Tumour cell-derived WNT5B modulates in vitro lymphangiogenesis via induction of partial endothelial-mesenchymal transition of lymphatic endothelial cells Oncogene 2017 36 1503 1515 10.1038/onc.2016.317 27593938 Wang, S. et al. Tumour cell-derived WNT5B modulates in vitro lymphangiogenesis via induction of partial endothelial-mesenchymal transition of lymphatic endothelial cells. Oncogene 36 27593938 10.1038/onc.2016.317 41. Perkins, et al. WNT5B in cellular signaling pathways. Seminars in Cell & Developmental Biology 10.1016/j.semcdb.2021.09.019 34635443 42. Ray, A. T. et al. FGF signaling regulates development by processes beyond canonical pathways. Genes Dev. 34 10.1101/gad.342956.120 PMC7706708 33184218 43. Xu Y Fibroblast growth factor receptor 2 promotes the proliferation, migration, and invasion of ectopic stromal cells via activation of the extracellular-signal-regulated kinase signaling pathway in endometriosis Bioengineered 2022 13 8360 8371 10.1080/21655979.2022.2054207 35311468 PMC9161834 Xu, Y. et al. Fibroblast growth factor receptor 2 promotes the proliferation, migration, and invasion of ectopic stromal cells via activation of the extracellular-signal-regulated kinase signaling pathway in endometriosis. Bioengineered 13 35311468 10.1080/21655979.2022.2054207 PMC9161834 44. Kealy, D. J. et al. Blood immune profiles reveal a CXCR3/CCR5 axis of dysregulation in early sepsis. J. Leukoc. Biol 117 10.1093/jleuko/qiae204 39312202 45. Shi A Synergistic short-term and long-term effects of TGF-β1 and 3 on collagen production in differentiating myoblasts Biochem. Biophys. Res. Commun. 2021 547 176 182 10.1016/j.bbrc.2021.02.007 33618224 Shi, A., et al. Synergistic short-term and long-term effects of TGF-β1 and 3 on collagen production in differentiating myoblasts. Biochem. Biophys. Res. Commun. 547 33618224 10.1016/j.bbrc.2021.02.007 46. Chen Q Sustained induction of collagen synthesis by TGF-β requires regulated intramembrane proteolysis of CREB3L1 PloS ONE 2014 9 e108528 10.1371/journal.pone.0108528 25310401 PMC4195586 Chen, Q., et al. Sustained induction of collagen synthesis by TGF-β requires regulated intramembrane proteolysis of CREB3L1. PloS ONE 9 25310401 10.1371/journal.pone.0108528 PMC4195586 47. Etich J PECAM1+/Sca1+/CD38+ vascular cells transform into myofibroblast-like cells in skin wound repair PLoS ONe 2013 8 e53262 10.1371/journal.pone.0053262 23308177 PMC3537615 Etich, J. et al. PECAM1+/Sca1+/CD38+ vascular cells transform into myofibroblast-like cells in skin wound repair. PLoS ONe 8 23308177 10.1371/journal.pone.0053262 PMC3537615 48. Shishkova D Spontaneous endothelial-to-mesenchymal transition in human primary umbilical vein endothelial cells Complex Issues Cardiovasc. Dis. 2022 11 97 114 Shishkova, D. et al. Spontaneous endothelial-to-mesenchymal transition in human primary umbilical vein endothelial cells. Complex Issues Cardiovasc. Dis. 11 49. Singh, B. et al. Elucidating the crosstalk between endothelial-to-mesenchymal transition (EndoMT) and endothelial autophagy in the pathogenesis of atherosclerosis. Vasc. Pharmacol. 10.1016/j.vph.2024.107368 PMC11303600 38548093 50. Xie Y Endothelial-to-mesenchymal transition in human idiopathic dilated cardiomyopathy Mol. Med. Rep. 2018 17 961 969 29115553 10.3892/mmr.2017.8013 PMC5780177 Xie, Y. et al. Endothelial-to-mesenchymal transition in human idiopathic dilated cardiomyopathy. Mol. Med. Rep. 17 29115553 10.3892/mmr.2017.8013 PMC5780177 51. Camici M Purine-metabolising enzymes and apoptosis in cancer Cancers 2019 11 1354 10.3390/cancers11091354 31547393 PMC6769685 Camici, M. et al. Purine-metabolising enzymes and apoptosis in cancer. Cancers 11 31547393 10.3390/cancers11091354 PMC6769685 52. Jacobsen SJ Synergistic activity of purine metabolism inhibitors in cultured human tumor cells Cancer Lett. 1987 35 97 104 10.1016/0304-3835(87)90061-9 3567890 Jacobsen, S. J. et al. Synergistic activity of purine metabolism inhibitors in cultured human tumor cells. Cancer Lett. 35 3567890 10.1016/0304-3835(87)90061-9 53. Mistry RJ Nicotinamide N-methyltransferase expression in SH-SY5Y human neuroblastoma cells decreases oxidative stress J. Biochem. Mol. Toxicol. 2020 34 e22439 10.1002/jbt.22439 31909875 Mistry, R. J. et al. Nicotinamide N-methyltransferase expression in SH-SY5Y human neuroblastoma cells decreases oxidative stress. J. Biochem. Mol. Toxicol. 34 31909875 10.1002/jbt.22439 54. Gerdes, B. Mechanism of Action of Nicotinamide Phosphoribosyltransferase Mediated Signaling in Oxidative Stress 55. Moreno-Sánchez R Energy metabolism in tumor cells FEBS J. 2007 274 1393 1418 10.1111/j.1742-4658.2007.05686.x 17302740 Moreno-Sánchez, R. et al. Energy metabolism in tumor cells. FEBS J. 274 17302740 10.1111/j.1742-4658.2007.05686.x 56. Jiang Z Revealing the crucial roles of suppressive immune microenvironment in cardiac myxoma progression Signal Transduct. Target. Ther. 2024 9 193 10.1038/s41392-024-01912-2 39090109 PMC11294589 Jiang, Z. et al. Revealing the crucial roles of suppressive immune microenvironment in cardiac myxoma progression. Signal Transduct. Target. Ther. 9 39090109 10.1038/s41392-024-01912-2 PMC11294589 57. Young MD Behjati S SoupX removes ambient RNA contamination from droplet-based single-cell RNA sequencing data Gigascience 2020 9 giaa151 10.1093/gigascience/giaa151 33367645 PMC7763177 Young, M. D. & Behjati, S. SoupX removes ambient RNA contamination from droplet-based single-cell RNA sequencing data. Gigascience 9 33367645 10.1093/gigascience/giaa151 PMC7763177 58. Germain P-L Doublet identification in single-cell sequencing data using scDblFinder F1000Research 2021 10 979 10.12688/f1000research.73600.1 35814628 PMC9204188 Germain, P.-L. et al. Doublet identification in single-cell sequencing data using scDblFinder. F1000Research 10 35814628 10.12688/f1000research.73600.1 PMC9204188 59. Wolf FA Angerer P Theis FJ SCANPY: large-scale single-cell gene expression data analysis Genome Biol. 2018 19 1 5 10.1186/s13059-017-1382-0 29409532 PMC5802054 Wolf, F. A., Angerer, P. & Theis, F. J. SCANPY: large-scale single-cell gene expression data analysis. Genome Biol. 19 29409532 10.1186/s13059-017-1382-0 PMC5802054 60. Korsunsky I Fast, sensitive and accurate integration of single-cell data with Harmony Nat. Methods 2019 16 1289 1296 10.1038/s41592-019-0619-0 31740819 PMC6884693 Korsunsky, I. et al. Fast, sensitive and accurate integration of single-cell data with Harmony. Nat. Methods 16 31740819 10.1038/s41592-019-0619-0 PMC6884693 61. Zhang X CellMarker: a manually curated resource of cell markers in human and mouse Nucleic Acids Res. 2019 47 D721 D728 10.1093/nar/gky900 30289549 PMC6323899 Zhang, X. et al. CellMarker: a manually curated resource of cell markers in human and mouse. Nucleic Acids Res. 47 30289549 10.1093/nar/gky900 PMC6323899 62. Cao Y Wang X Peng G SCSA: a cell type annotation tool for single-cell RNA-seq data Front. Genet. 2020 11 490 10.3389/fgene.2020.00490 32477414 PMC7235421 Cao, Y., Wang, X. & Peng, G. SCSA: a cell type annotation tool for single-cell RNA-seq data. Front. Genet. 11 32477414 10.3389/fgene.2020.00490 PMC7235421 63. Yu G clusterProfiler: an R package for comparing biological themes among gene clusters Omics 2012 16 284 287 10.1089/omi.2011.0118 22455463 PMC3339379 Yu, G. et al. clusterProfiler: an R package for comparing biological themes among gene clusters. Omics 16 22455463 10.1089/omi.2011.0118 PMC3339379 64. De Falco A A variational algorithm to detect the clonal copy number substructure of tumors from scRNA-seq data Nat. Commun. 2023 14 1074 10.1038/s41467-023-36790-9 36841879 PMC9968345 De Falco, A. et al. A variational algorithm to detect the clonal copy number substructure of tumors from scRNA-seq data. Nat. Commun. 14 36841879 10.1038/s41467-023-36790-9 PMC9968345 65. Trapnell, C., Cacchiarelli, D. & Qiu, X. Monocle: cell counting, differential expression, and trajectory analysis for single-cell RNA-Seq experiments. Bioconductor https://www.bioconductor.org/packages/release/bioc/html/monocle.html 66. Troulé, K. et al. CellPhoneDB v5: inferring cell–cell communication from single-cell multiomics data. Nat. Protoc. 20 10.1038/s41596-024-01137-1 40133495 67. Rhoads A Au KF PacBio sequencing and its applications Genomics Proteom. Bioinforma. 2015 13 278 289 10.1016/j.gpb.2015.08.002 PMC4678779 26542840 Rhoads, A. & Au, K. F. PacBio sequencing and its applications. Genomics Proteom. Bioinforma. 13 10.1016/j.gpb.2015.08.002 PMC4678779 26542840 68. Li H Minimap2: pairwise alignment for nucleotide sequences Bioinformatics 2018 34 3094 3100 10.1093/bioinformatics/bty191 29750242 PMC6137996 Li, H. Minimap2: pairwise alignment for nucleotide sequences. Bioinformatics 34 29750242 10.1093/bioinformatics/bty191 PMC6137996 69. Pertea M StringTie enables improved reconstruction of a transcriptome from RNA-seq reads Nat. Biotechnol. 2015 33 290 295 10.1038/nbt.3122 25690850 PMC4643835 Pertea, M. et al. StringTie enables improved reconstruction of a transcriptome from RNA-seq reads. Nat. Biotechnol. 33 25690850 10.1038/nbt.3122 PMC4643835 70. Ritchie ME limma powers differential expression analyses for RNA-sequencing and microarray studies Nucleic Acids Res. 2015 43 e47 e47 10.1093/nar/gkv007 25605792 PMC4402510 Ritchie, M. E. et al. limma powers differential expression analyses for RNA-sequencing and microarray studies. Nucleic Acids Res. 43 25605792 10.1093/nar/gkv007 PMC4402510 71. Haas, B. J. et al. STAR-Fusion: fast and accurate fusion transcript detection from RNA-Seq. BioRx iv 72. Lu X LC–MS-based metabonomics analysis J. Chromatogr. B 2008 866 64 76 10.1016/j.jchromb.2007.10.022 17983864 Lu, X. et al. LC–MS-based metabonomics analysis. J. Chromatogr. B 866 10.1016/j.jchromb.2007.10.022 17983864 73. Smith CA XCMS: processing mass spectrometry data for metabolite profiling using nonlinear peak alignment, matching, and identification Anal. Chem. 2006 78 779 787 10.1021/ac051437y 16448051 Smith, C. A. et al. XCMS: processing mass spectrometry data for metabolite profiling using nonlinear peak alignment, matching, and identification. Anal. Chem. 78 16448051 10.1021/ac051437y 74. Pluskal T MZmine 2: modular framework for processing, visualizing, and analyzing mass spectrometry-based molecular profile data BMC Bioinforma. 2010 11 1 11 10.1186/1471-2105-11-395 PMC2918584 20650010 Pluskal, T. et al. MZmine 2: modular framework for processing, visualizing, and analyzing mass spectrometry-based molecular profile data. BMC Bioinforma. 11 10.1186/1471-2105-11-395 PMC2918584 20650010 75. Wishart DS HMDB 5.0: the human metabolome database for 2022 Nucleic Acids Res. 2022 50 D622 D631 10.1093/nar/gkab1062 34986597 PMC8728138 Wishart, D. S. et al. HMDB 5.0: the human metabolome database for 2022. Nucleic Acids Res. 50 34986597 10.1093/nar/gkab1062 PMC8728138 76. Xia J Wishart DS Using MetaboAnalyst 3.0 for comprehensive metabolomics data analysis Curr. Protoc. Bioinforma. 2016 55 14 10 10.1002/cpbi.11 27603023 Xia, J. & Wishart, D. S. Using MetaboAnalyst 3.0 for comprehensive metabolomics data analysis. Curr. Protoc. Bioinforma. 55 10.1002/cpbi.11 27603023 77. Liu, S. et al. Multi-omics data reveal the origin of cardiac myxoma [Data set]. Zenodo ",
  "metadata": {
    "Title of this paper": "Using MetaboAnalyst 3.0 for comprehensive metabolomics data analysis",
    "Journal it was published in:": "Communications Biology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474904/"
  }
}