{
  "title": "Paper_9",
  "abstract": "pmc Asian J Urol Asian J Urol 3358 ajur Asian Journal of Urology 2214-3882 2214-3890 Second Military Medical University PMC12490683 PMC12490683.1 12490683 12490683 10.1016/j.ajur.2024.09.009 S2214-3882(25)00005-0 1 Original Article Optimized graph neural network-multilayer perceptron fusion classifier for metastatic prostate cancer detection in Western and Asian populations Han Fengxian a b 1 Fan Xiaohui a b 1 Long Pengwei c 1 Zhang Wenhui d Li Qiting a Li Yingxuan b Guo Xingpeng b Luo Yinran b Wen Rongqi b Wang Sheng b Zhang Shan b Li Yizhuo e Wang Yan wy_smmu@163.com d ⁎ Gao Xu gaoxu.changhai@foxmail.com d ⁎ Li Jing ljing@smmu.edu.cn a b ⁎ a b c d e ⁎ wy_smmu@163.com gaoxu.changhai@foxmail.com ljing@smmu.edu.cn 1 These authors contributed equally to this work. 7 2025 28 1 2025 12 3 498204 327 337 28 6 2024 6 9 2024 28 01 2025 03 10 2025 03 10 2025 © 2025 Editorial Office of Asian Journal of Urology. Publishing services by Elsevier B.Vé. 2025 Editorial Office of Asian Journal of Urology https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Objective Prostate cancer (PCa) exhibits significant genomic differences between Western and Asian populations. This study aimed to design a predictive model applicable across diverse populations while selecting a limited set of genes suitable for clinical implementation. Methods We utilized an integrated dataset of 1360 whole-exome and whole-genome sequences from Chinese and Western PCa cohorts to develop and evaluate the model. External validation was conducted using an independent cohort of patients. A graph neural network architecture, termed the pathway-aware multi-layered hierarchical network-Western and Asian (P-NETwa), was developed and trained on combined genomic profiles from Chinese and Western cohorts. The model employed a multilayer perceptron (MLP) to identify key signature genes from multi-omics data, enabling precise prediction of PCa metastasis. Results The model achieved an accuracy of 0.87 and an F1-score of 0.85 on Western population datasets. The application of integrated Chinese and Western population data improved the accuracy to 0.88, achieving an F1-score of 0.75. The analysis identified 18 signature genes implicated in PCa progression, including established markers ( AR TP53 MUC16, MUC4, ASB12 Conclusion The P-NETwa-MLP model integrates a query system that allows for efficient retrieval of prediction outcomes and associated genomic signatures via sample ID, enhancing its potential for seamless integration into clinical workflows. Keywords Prostate cancer Machine learning Multilayer perceptron Graph neural network pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction Prostate cancer (PCa) is one of the most common cancers in men worldwide, with the highest incidence and second-highest mortality rates [ 1 2 3 [4] [5] [6] 7 8 9 10 11 12 Numerous genomic signatures have emerged to discern primary from metastatic adenocarcinomas, including well-established ones like OncotypeDx, Prolaris, and Decipher [ 13 14 15 16 17 18 19 20 21 22 23 24 25 26 The Reactome pathway database has been leveraged to construct graphs for developing graph neural networks (GNNs), aiming to model gene alterations and their effects on cell growth in yeast (DCell) and to predict the response of cancer cell lines to various therapies (DrugCell) [ 27 28 [28] [29] [30] FOXA1 FOXA1 We proposed to integrate the interpretability of GNNs with the efficient feature processing capabilities of a multilayer perceptron (MLP). GNNs have been demonstrated to be effective in dealing with graph-structured data by learning node and graph representations while considering node relationships [ 32 33 34 Based upon this hypothesis, we adopted a hybrid system called P-NETwa-MLP, which combines the GNN and MLP. In addition to the initial dataset, which comprised 1360 patients from four Western datasets, we incorporated the two largest Asian datasets. This expansion allowed us to evolve the original P-NET model into the P-NET-Western and Asian (P-NETwa), catering to a more diverse ethnic background. Subsequently, we conducted a benchmark comparison between P-NET and P-NETwa, revealing that the latter achieved superior classification accuracy (0.89) compared to the prototype P-NET. Secondly, in addition to utilizing whole-genome sequencing data, we explored the effectiveness of widely used commercially available panels for accurate predictions. A comprehensive analysis of each feature's performance was conducted, leading to the identification of an optimal combination of genomic features through a systematic refinement process. These selected features were subsequently transferred from the upstream P-NETwa to the downstream-enhanced MLP classifier. Experimental outcomes substantiated that the proposed P-NETwa-MLP achieved notable classification accuracy. Finally, we developed a clinician-friendly web application, which streamlined the process by allowing clinicians to upload sequencing data. The application integrates a pre-trained P-NETwa-MLP model, enabling real-time prediction of primary and metastatic outcomes. Furthermore, this web application incorporates a querying function, facilitating users in inputting sample ID information to precisely retrieve the corresponding predictive results, along with relevant genomic and epigenomic alterations for each specific patient. 2 Materials and methods 2.1 Data source and processing A total of 26 PCa datasets were downloaded from the cBioPortal data portal ( https://www.cbioportal.org/ 30 35 Fig. 1 Supplementary Table 1 Figure 1 Study overview. (A) Flow diagram of the data collection process; (B) Number of primary and metastatic samples in each dataset: TCGA (Abeshouse et al. [ 31 37 38 39 7 29 30 35 Figure 1 Only non-synonymous mutations were retained. Non-synonymous mutations were defined based on variant classifications provided by cBioPortal labels, including Nonsense Mutation, Missense Mutation, Nonstop Mutation, Frameshift Del, Frameshift Ins, In Frame Del and In Frame Ins, Splice Site, and Translation Start Site. A total of 9575 genes, shared across different studies were kept for further analysis ( Fig. 1 36 Fig. 1 2.2 Benchmark and development of P-NETwa To ensure the reproducibility of P-NET, we set the parameters and utilized the same datasets (M/DFCI) as described by Armenia et al. [ 37 31 38 29 35 30 Fig. 1 39 7 2.3 Fusion of P-NETwa and MLP The first layer of P-NETwa establishes connections with subsequent layers through a one-to-one mapping. In this configuration, each node in the succeeding layers is individually linked to three nodes in the input layer, representing mutation, copy number amplification, and copy number deletion. This design reduces the number of weights in the first layer compared to a fully connected network, and the specialized connectivity pattern in the matrix enhances training efficiency. The second layer strictly adheres to gene pathway relationships outlined in Reactome pathways. Connection patterns are encoded by a masking matrix, denoted as M. When multiplied by the weight matrix W, this matrix eliminates all connections not present in the Reactome pathway dataset. The same computational approach is applied to subsequent layers to regulate inter-layer connections, ensuring an accurate representation of genuine parent-child relationships existing in the Reactome dataset. The P-NETwa design was conducted as previously described. In summary, the model employs a biologically informed, parsimonious architecture with constraints on nodes and edges. Each node represents a biological entity, while edges denote known relationships. Utilizing Reactome pathway datasets, P-NET structures a layered network comprising five pathway layers, one gene layer, and one for features. The network design encodes meaning via a meticulously crafted hierarchy connecting features, genes, and pathways. The relative contributions of each input were weighted via DeepLIFT [ 40 i.e. Fig. 2 Figure 2 Structure of the machine learning model. The figure illustrates the integrated structure of the machine learning model, comprising two main components: P-NETwa and MLP. There are initial data preprocessing steps, which involve combining mutated and CNV genes, followed by merging based on the gene type. The processed data are then fed into P-NETwa, where candidate feature genes are extracted from the output. Subsequently, these features enter the training phase of MLP to generate the final prediction result. In the figure, “g” represents genes; “s” denotes samples; “mut” indicates mutations; “del” signifies deletions; “amp” refers to amplifications; “0, −1, and 1” means GISTIC predicted copy number states (−1=deletion; 0=normal; 1=amplification); “a×3 neurons” means that input layer processes a genes (count of genes) with three features each (mutation, CNV, and expression). P-NETwa, pathway-aware multi-layered hierarchical network-Western and Asian; MLP, multilayer perceptron; CNV, copy number variant. Figure 2 During the forward propagation process, the input data underwent linear and nonlinear transformations through fully connected layers and the Sigmoid x h (1) h = σ ( W h x + b h ) . W h b h σ Sigmoid Subsequently, another fully connected layer performed the final linear transformation to obtain the model's output y ˆ (2) y ˆ = W o h + b o . W o b o To optimize the model's parameters, we chose the Adam optimizer and set the learning rate to 0.001. The training process involved iterating 300 epochs. In each training epoch, the model's output was computed through forward propagation. Then, we applied the softmax p (3) p = softmax ( y ˆ ) . We used the cross-entropy loss function as the objective function to measure the difference between the model's output and the true labels of the training data. The cross-entropy loss L (4) L = − 1 N ∑ i = 1 N [ y i log ( p i ) + ( 1 − y i ) log ( 1 − p i ) ] , N y i i p i softmax log e 2.4 Model evaluation metrics We evaluated our models based on six key metrics: accuracy, precision, recall, F1-score, area under the precision-recall curve, and area under the curve (AUC). 2.5 Web application design In order to allow clinicians to interact with the prediction algorithms and interpret their outputs, a graphical user interface was developed using the PyWebIO Python library. This interface allows users to upload variant call format files sourced from various genome sequencing platforms, subsequently executing predictions utilizing the P-NETwa-MLP model. The delineated workflow encompasses user interactions in key steps: 1) the selection of sequencing information for an individual patient for upload to the data warehouse; 2) execution of calculations through the pre-trained model; and 3) visualization of the results obtained from the prediction model. 2.6 Availability of data and materials P-NETwa-MLP is available on the GitHub repository ( https://github.com/Jing-s-Lab/PNETwa-MLP Supplementary Table 1 3 Results 3.1 Cohort characteristics This study curated six publicly available datasets and incorporated two in-house datasets, comprising a total of 1475 samples (1204 from Western populations and 271 from Asian populations). 3.2 Benchmark and development of P-NETwa P-NET is an innovative biologically informed model that leverages molecular data, specifically focusing on mutation status and copy number, to predict the overall survival of patients with PCa [ 28 Table 1 Table 1 30 Fig. 3 Table 2 vs. Fig. 3 RB1, MUC16, CTSE, CD55, MUC4, ARHGEF2, RBBP5, PPP1CA, AHSG, KIF4B, RPS27 CTSK Fig. 3 Table 1 Validation and consistency across datasets of P-NET. Table 1 Dataset Recall Precision AUC AUPRC F1-score Accuracy Original P-NET 0.76 0.75 0.93 0.88 0.76 0.84 Replication of P-NET 0.78 0.73 0.93 0.89 0.75 0.83 P-NET performance using the CPGEA dataset 0.056 0.071 0.56 0.15 0.062 0.86 P-NET, pathway-aware multi-layered hierarchical network; P-NETwa, P-NET-Western and Asian; CPGEA, Chinese Prostate Cancer Genome and Epigenome Atlas; AUC, area under the curve; AUPRC, area under the precision-recall curve. Figure 3 Comparison between P-NET and P-NETwa. (A) Distribution of top 10 genes based on replicated P-NET outcomes within the M/DFCI [ 37 30 Figure 3 Table 2 Performance comparison between P-NET and P-NETwa. Table 2 Dataset Recall Precision AUC AUPRC F1-score Accuracy Replication of P-NET 0.78 0.73 0.93 0.89 0.75 0.83 P-NETwa 0.71 0.89 0.90 0.83 0.79 0.89 P-NET, pathway-aware multi-layered hierarchical network; P-NETwa, P-NET-Western and Asian; AUC, area under the curve; AUPRC, area under the precision-recall curve. 3.3 Fusion of P-NETwa and MLP P-NET and P-NETwa have demonstrated their robustness in handling vast amounts of genome-wide sequencing data. However, they require genetic variant information at the whole exome or even whole genome level, which poses a challenge for implementation in real-world clinical settings. It would be highly significant if accurate tumor prediction could be achieved using a limited number of genes, such as the gene panel data commonly used in clinical settings. Therefore, the DeepLIFT attribution scores for each gene were utilized to identify a set of candidate feature genes for MLP training. The MLP model was trained with varying numbers of candidate feature genes, and optimal overall performance was observed in terms of AUC and F1-score on both the test set and external validation dataset when the number of genes was set to 18 ( Fig. 4 Table 3 Table 3 Fig. 4 i.e. AR PTEN TP53 MUC4 RB1 RBBP5 CD55 ARHGEF9 ASB12 CTSE FGF2 RNF213 MUC16 UBE2W PKP1 PPP1CA ARHGAP21 COL1A2 PTEN Fig. 5 AR Fig. 5 TP53 Fig. 5 [41] [42] [43] FGF2 Fig. 5 COL1A2 Fig. 5 44 45 Fig. 5 Supplementary Figure 1A PKP1 CD55 RBBP5 CTSE Supplementary Figure 1B MDM4 28 ARHGEF9 ASB12 AR 46 MUC16 ARHGAP21 Supplementary Figure 1C COL1A2 PKP1 ASB12 Supplementary Figure 1D Figure 4 MLP performance and PCa metastasis prediction validation. (A) The effect of different numbers of candidate feature genes on MLP performance; (B) ROC curves representing the performance of the MLP on both the testing and external validation sets, using a set of 18 feature genes as input; (C and D) Confusion matrices corresponding to the ROC curves for the testing set (C) and external validation set (D). MLP, multilayer perceptron; PCa, prostate cancer; AUC, area under the curve; ROC, receiver operating characteristic. Figure 4 Table 3 Performance of P-NETwa and P-NETwa-MLP on test set and external validation set. Table 3 Dataset Recall Precision AUC AUPRC F1-score Accuracy P-NETwa 0.71 0.89 0.90 0.83 0.79 0.89 P-NETwa-MLP (test) 0.64 0.89 0.89 0.81 0.75 0.88 P-NETwa-MLP (external validation) 0.84 0.85 0.90 0.90 0.85 0.87 P-NET, pathway-aware multi-layered hierarchical network; P-NETwa, P-NET-Western and Asian; MLP, multilayer perceptron. Figure 5 Genomic alterations and their contributions to PCa metastasis predictions. (A–C) DeepLIFT attribution scores for genomic alterations contributing to PCa metastasis, grouped into deletions (A), mutations (B), and amplifications (C) (attribution scores are numerically displayed and color-coded, with positive values [>0] indicating a promotive role and negative values [<0] suggesting an inhibitory role in metastatic progression; the dataset annotations above each panel indicate the number of primary and metastatic samples, providing context on dataset composition; the central heatmap for each alteration type shows the proportions of variant genes across datasets, with underlined genes highlighting significant contributors to the model predictions driven by the corresponding genomic alteration; the right-side heatmap depicts the DeepLIFT attribution values for feature genes, emphasizing their individual contributions to metastatic prediction); (D) Correlation analysis of 54 features derived from 18 genes included in the model, encompassing deletions, mutations, and amplifications (significant correlations [ p 29 38 7 37 30 39 35 31 Figure 5 3.4 Web application results To enhance user convenience, we have designed and implemented a user-friendly web application on the PyWebIO platform, which integrates with our P-NETwa-MLP model. This interface allows users to import individual patient gene information into the model through a straightforward process of uploading local files, such as variant call format files ( Supplementary Figure 2A Supplementary Figure 2C Supplementary Figure 2D 3.5 Clinical implementation We have completed the setup of a new model, and understanding how to apply it in a clinical setting is crucial for its translational significance. In clinical practice, metastasis is often predicted based on elevations in serum prostate-specific antigen (PSA) prior to detection by imaging. Patients with metastatic PCa and low PSA levels account for less than 1% of the total PCa patient population [ 47 Supplementary Tables 2 and 3 Supplementary Figure 2 4 Discussion To help identify patients at risk of early metastasis, it is necessary to identify certain unfavorable characteristics associated with the occurrence of metastasis upon diagnosis. Moreover, such a model may guide follow-up or aggressive treatment strategies for patients without overt metastasis but possessing unfavorable characteristics. ANNs can be utilized for the analysis of comprehensive omics data, employing a hierarchical architecture of layers to conduct convolution operations and extract features at different levels. This enables the prediction of clinical endpoints through the discernment of intricate patterns and features in the data [ [48] [49] [50] 32 51 AR PTEN TP53 RB1 52 53 7 8 52 54 PKP1 CD55 RBBP5 CTSE ARHGEF9 ASB12 AR MUC4 55 56 57 FGF2 COL1A2 Nonetheless, certain limitations must be acknowledged. First, the sample size of the Asian dataset is constrained. Although our internal datasets represent China's largest collections, acquiring genome-wide alteration data beyond these datasets remains challenging. Second, in comparison to Western datasets, the Asian dataset lacks a sufficient number of metastatic cases. Western institutions and consortia, such as SU2C [ 29 5 Conclusion In this study, we developed P-NETwa-MLP, a hybrid deep learning model that integrates GNNs and an MLP to distinguish between primary and metastatic PCa. By incorporating large-scale genomic data from both Western and Asian populations, P-NETwa-MLP achieved improved generalizability and classification accuracy compared to the original PNET model. Through DeepLIFT attribution analysis, we identified 18 key genomic features that contribute most to metastasis prediction, forming a clinically applicable gene panel—P-NETwa-Panel. The model demonstrated robust performance across internal and external datasets, with high accuracy and F1-scores. Notably, we developed a user-friendly web application that enables clinicians to upload genomic data and receive real-time, interpretable predictions of metastatic risk. Application of the model to PCa patients with atypical PSA levels further highlighted its clinical utility. In summary, P-NETwa-MLP offers a scalable, interpretable, and accurate tool for PCa metastasis prediction across diverse populations. This study lays the foundation for integrating biologically informed artificial intelligence into precision oncology workflows. Future efforts will focus on expanding omics data layers and prospective clinical validation. Author contributions Study concept and design Data acquisition Data analysis Drafting of manuscript Critical revision of the manuscript Conflicts of interest The authors declare no conflict of interest. References 1 Siegel R.L. Miller K.D. Wagle N.S. Jemal A. Cancer statistics, 2023 CA Cancer J Clin 73 2023 17 48 36633525 10.3322/caac.21763 2 Sung H. Ferlay J. Siegel R.L. Laversanne M. Soerjomataram I. Jemal A. Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA A Cancer J Clin 71 2021 209 249 10.3322/caac.21660 33538338 3 Liu D. Kuai Y. Zhu R. Zhou C. Tao Y. Han W. Prognosis of prostate cancer and bone metastasis pattern of patients: a SEER-based study and a local hospital based study from China Sci Rep 10 2020 9104 10.1038/s41598-020-64073-6 32499554 PMC7272631 4 Gundem G. Van Loo P. Kremeyer B. Alexandrov L.B. Tubio J.M.C. Papaemmanuil E. The evolutionary history of lethal metastatic prostate cancer Nature 520 2015 353 357 25830880 10.1038/nature14347 PMC4413032 5 Quigley D.A. Dang H.X. Zhao S.G. Lloyd P. Aggarwal R. Alumkal J.J. Genomic hallmarks and structural variation in metastatic prostate cancer Cell 175 2018 889 10.1016/j.cell.2018.10.019 30340047 6 Martinez-Jimenez F. Movasati A. Brunner S.R. Nguyen L. Priestley P. Cuppen E. Pan-cancer whole-genome comparison of primary and metastatic solid tumours Nature 618 2023 333 341 37165194 10.1038/s41586-023-06054-z PMC10247378 7 Grasso C.S. Wu Y.M. Robinson D.R. Cao X. Dhanasekaran S.M. Khan A.P. The mutational landscape of lethal castration-resistant prostate cancer Nature 487 2012 239 243 22722839 10.1038/nature11125 PMC3396711 8 Robbins C.M. Tembe W.A. Baker A. Sinari S. Moses T.Y. Beckstrom-Sternberg S. Copy number and targeted mutational analysis reveals novel somatic events in metastatic prostate tumors Genome Res 21 2011 47 55 21147910 10.1101/gr.107961.110 PMC3012925 9 Beltran H. Prandi D. Mosquera J.M. Benelli M. Puca L. Cyrta J. Divergent clonal evolution of castration-resistant neuroendocrine prostate cancer Nat Med 22 2016 298 305 26855148 10.1038/nm.4045 PMC4777652 10 Ge R. Wang Z. Montironi R. Jiang Z. Cheng M. Santoni M. Epigenetic modulations and lineage plasticity in advanced prostate cancer Ann Oncol 31 2020 470 479 32139297 10.1016/j.annonc.2020.02.002 11 Tomlins S.A. Rhodes D.R. Perner S. Dhanasekaran S.M. Mehra R. Sun X. Recurrent fusion of TMPRSS2 and ETS transcription factor genes in prostate cancer Science 310 2005 644 648 16254181 10.1126/science.1117679 12 Sinha A. Huang V. Livingstone J. Wang J. Fox N.S. Kurganovs N. The proteogenomic landscape of curable prostate cancer Cancer Cell 35 2019 414 427 10.1016/j.ccell.2019.02.005 30889379 PMC6511374 13 San Francisco I.F. Rojas P.A. Bravo J.C. Diaz J. Ebel L. Urrutia S. Can we predict prostate cancer metastasis based on biomarkers? Where are we now? Int J Mol Sci 24 2023 12508 10.3390/ijms241512508 PMC10420177 37569883 14 Buus R. Sestak I. Kronenwett R. Denkert C. Dubsky P. Krappmann K. Comparison of EndoPredict and EPclin with oncotype DX recurrence score for prediction of risk of distant recurrence after endocrine therapy J Natl Cancer Inst 108 2016 djw149 10.1093/jnci/djw149 PMC5241904 27400969 15 Sommariva S. Tarricone R. Lazzeri M. Ricciardi W. Montorsi F. Prognostic value of the cell cycle progression score in patients with prostate cancer: a systematic review and meta-analysis Eur Urol 69 2016 107 115 25481455 10.1016/j.eururo.2014.11.038 16 Spratt D.E. Yousefi K. Deheshi S. Ross A.E. Den R.B. Schaeffer E.M. Individual patient-level meta-analysis of the performance of the decipher genomic classifier in high-risk men after prostatectomy to predict development of metastatic disease J Clin Oncol 35 2017 1991 1998 28358655 10.1200/JCO.2016.70.2811 PMC6530581 17 Taylor B.S. Schultz N. Hieronymus H. Gopalan A. Xiao Y. Carver B.S. Integrative genomic profiling of human prostate cancer Cancer Cell 18 2010 11 22 20579941 10.1016/j.ccr.2010.05.026 PMC3198787 18 Abida W. Cyrta J. Heller G. Prandi D. Armenia J. Coleman I. Genomic correlates of clinical outcome in advanced prostate cancer Proc Natl Acad Sci U S A 116 2019 11428 11436 31061129 10.1073/pnas.1902651116 PMC6561293 19 Kuruc F. Binder H. Hess M. Stratified neural networks in a time-to-event setting Brief Bioinform 23 2022 bbab392 10.1093/bib/bbab392 34585236 20 Tran K.A. Kondrashova O. Bradley A. Williams E.D. Pearson J.V. Waddell N. Deep learning in cancer diagnosis, prognosis and treatment selection Genome Med 13 2021 152 10.1186/s13073-021-00968-x 34579788 PMC8477474 21 Yao Y. Lv Y. Tong L. Liang Y. Xi S. Ji B. ICSDA: a multi-modal deep learning model to predict breast cancer recurrence and metastasis risk by integrating pathological, clinical and gene expression data Brief Bioinform 23 2022 bbac448 10.1093/bib/bbac448 36242564 22 Li R. Zhu J. Zhong W.D. Jia Z. Comprehensive evaluation of machine learning models and gene expression signatures for prostate cancer prognosis using large population cohorts Cancer Res 82 2022 1832 1843 35358302 10.1158/0008-5472.CAN-21-3074 23 Ogunleye A.Z. Piyawajanusorn C. Gonçalves A. Ghislat G. Ballester P.J. Interpretable machine learning models to predict the resistance of breast cancer patients to doxorubicin from their microRNA profiles Adv Sci 9 2022 e2201501 10.1002/advs.202201501 PMC9403644 35785523 24 Klein E.A. Richards D. Cohn A. Tummala M. Lapham R. Cosgrove D. Clinical validation of a targeted methylation-based multi-cancer early detection test using an independent validation set Ann Oncol 32 2021 1167 1177 34176681 10.1016/j.annonc.2021.05.806 25 Liu B. Liu Y. Pan X. Li M. Yang S. Li S. DNA methylation markers for pan-cancer prediction by deep learning Genes 10 2019 778 10.3390/genes10100778 31590287 PMC6826785 26 Ras G. Xie N. Van Gerven M. Doran D. Explainable deep learning: a field guide for the uninitiated J Artif Intell Res 73 2022 329 396 27 Kuenzi B.M. Park J. Fong S.H. Sanchez K.S. Lee J. Kreisberg J.F. Predicting drug response and synergy using a deep learning model of human cancer cells Cancer Cell 38 2020 672 684 10.1016/j.ccell.2020.09.014 33096023 PMC7737474 28 Elmarakeby H.A. Hwang J. Arafeh R. Crowdis J. Gang S. Liu D. Biologically informed deep neural network for prostate cancer discovery Nature 598 2021 348 352 34552244 10.1038/s41586-021-03922-4 PMC8514339 29 Robinson D. Van Allen Eliezer M. Wu Y.M. Schultz N. Lonigro Robert J. Mosquera J.M. Integrative clinical genomics of advanced prostate cancer Cell 161 2015 1215 1228 26000489 10.1016/j.cell.2015.05.001 PMC4484602 30 Li J. Xu C. Lee H.J. Ren S. Zi X. Zhang Z. A genomic and epigenomic atlas of prostate cancer in Asian populations Nature 580 2020 93 99 32238934 10.1038/s41586-020-2135-x 31 Abeshouse A. Ahn J. Akbani R. Ally A. Amin S. Andry Christopher D. The molecular taxonomy of primary prostate cancer Cell 163 2015 1011 1025 26544944 10.1016/j.cell.2015.10.025 PMC4695400 32 Sanchez-Lengeling B. Reif E. Pearce A. Wiltschko A.B. A gentle introduction to graph neural networks Distill 6 2021 e33 10.1016/j.neunet.2020.06.006 33 Tolstikhin I.O. Houlsby N. Kolesnikov A. Beyer L. Zhai X. Unterthiner T. Mlp-mixer: an all-mlp architecture for vision Adv Neural Inf Process Syst 34 2021 24261 24272 34 Melas-Kyriazi L. Do you even need attention? A stack of feed-forward layers does surprisingly well on ImageNet 2021 10.48550/arXiv.2105.02723 arXiv preprint arXiv:2105.02723 35 Ren S. Wei G. Liu D. Wang L. Hou Y. Zhu S. Whole-genome and transcriptome sequencing of prostate cancer identify new genetic alterations driving disease progression Eur Urol 73 2018 322 339 28927585 10.1016/j.eururo.2017.08.027 36 Mermel C.H. Schumacher S.E. Hill B. Meyerson M.L. Beroukhim R. Getz G. GISTIC2.0 facilitates sensitive and confident localization of the targets of focal somatic copy-number alteration in human cancers Genome Biol 12 2011 R41 10.1186/gb-2011-12-4-r41 21527027 PMC3218867 37 Armenia J. Wankowicz S.A.M. Liu D. Gao J. Kundra R. Reznik E. The long tail of oncogenic drivers in prostate cancer Nat Genet 50 2018 645 651 29610475 10.1038/s41588-018-0078-z PMC6107367 38 Kumar A. Coleman I. Morrissey C. Zhang X. True L.D. Gulati R. Substantial interindividual and limited intraindividual genomic diversity among tumors from men with metastatic prostate cancer Nat Med 22 2016 369 378 26928463 10.1038/nm.4053 PMC5045679 39 Baca S.C. Prandi D. Lawrence M.S. Mosquera J.M. Romanel A. Drier Y. Punctuated evolution of prostate cancer genomes Cell 153 2013 666 677 23622249 10.1016/j.cell.2013.03.021 PMC3690918 40 Lawhern V.J. Solon A.J. Waytowich N.R. Gordon S.M. Hung C.P. Lance B.J. EEGNet: a compact convolutional neural network for EEG-based brain-computer interfaces J Neural Eng 15 2018 056013 10.1088/1741-2552/aace8c 29932424 41 Jamaspishvili T. Berman D.M. Ross A.E. Scher H.I. De Marzo A.M. Squire J.A. Clinical implications of PTEN loss in prostate cancer Nat Rev Urol 15 2018 222 234 29460925 10.1038/nrurol.2018.9 PMC7472658 42 Gelmann E.P. Molecular biology of the androgen receptor J Clin Oncol 20 2002 3001 3015 12089231 10.1200/JCO.2002.10.018 43 Ecke T.H. Schlechte H.H. Schiemenz K. Sachs M.D. Lenk S.V. Rudolph B.D. TP53 Anticancer Res 30 2010 1579 1586 20592345 44 Pecqueux C. Arslan A. Heller M. Falkenstein M. Kaczorowski A. Tolstov Y. FGF-2 is a driving force for chromosomal instability and a stromal factor associated with adverse clinico-pathological features in prostate cancer Urol Oncol 36 2018 365.e15 365.e26 10.1016/j.urolonc.2018.05.020 29887238 45 Benesty J. Chen J. Huang Y. Cohen I. Pearson correlation coefficient Noise reduction in speech processing. Springer topics in signal processing 2009 Springer Berlin, Heidelberg 37 38 46 Steele C.D. Abbasi A. Islam S.M.A. Bowes A.L. Khandekar A. Haase K. Signatures of copy number alterations in human cancer Nature 606 2022 984 991 35705804 10.1038/s41586-022-04738-6 PMC9242861 47 Fauzan A. Djatisoesanto W. Diagnosis of high-grade prostate cancer in patients with unexpectedly low prostate specific antigen levels: a rare case series Bali Med J 12 2023 1718 1723 48 Devlin J. Chang M.W. Lee K. Toutanova K. Bert: pre-training of deep bidirectional transformers for language understanding 2018 10.18653/v1/N19-1423 arXiv preprint arXiv:1810.04805 49 Krizhevsky A. Sutskever I. Hinton G.E. Imagenet classification with deep convolutional neural networks Commun ACM 60 2017 84 90 50 Vaswani A. Shazeer N. Parmar N. Uszkoreit J. Jones L. Gomez A.N. Attention is all you need 2017 10.48550/arXiv.1706.03762 arXiv preprint arXiv:1706.03762 51 Lundberg S.M. Lee S.I. A Unified Approach to Interpreting Model Predictions 2017 10.48550/arXiv.1705.07874 arXiv preprint arXiv:1705.07874 52 Robinson D. Van Allen E.M. Wu Y.M. Schultz N. Lonigro R.J. Mosquera J.M. Integrative clinical genomics of advanced prostate cancer Cell 161 2015 1215 1228 26000489 10.1016/j.cell.2015.05.001 PMC4484602 53 Mateo J. Seed G. Bertan C. Rescigno P. Dolling D. Figueiredo I. Genomics of lethal prostate cancer at diagnosis and castration resistance J Clin Invest 130 2020 1743 1751 31874108 10.1172/JCI132031 PMC7108902 54 Zack T.I. Schumacher S.E. Carter S.L. Cherniack A.D. Saksena G. Tabak B. Pan-cancer patterns of somatic copy number alteration Nat Genet 45 2013 1134 1140 24071852 10.1038/ng.2760 PMC3966983 55 Zhang S. Zhang H.S. Reuter V.E. Slovin S.F. Scher H.I. Livingston P.O. Expression of potential target antigens for immunotherapy on primary and metastatic prostate cancers Clin Cancer Res 4 1998 295 302 9516914 56 Balagué C. Gambús G. Carrato C. Porchet N. Aubert J.P. Kim Y.S. Altered expression of MUC2, MUC4 MUC5 Gastroenterology 106 1994 1054 1061 8143972 10.1016/0016-5085(94)90767-6 57 Lazarini M. Traina F. Machado-Neto J.A. Barcellos K.S. Moreira Y.B. Brandão M.M. ARHGAP21 is a RhoGAP for RhoA and RhoC with a role in proliferation and migration of prostate adenocarcinoma cells Biochim Biophys Acta 1832 2013 365 374 23200924 10.1016/j.bbadis.2012.11.010 Appendix A Supplementary data The following are the Supplementary data to this article: Multimedia component 1 Multimedia component 1 Multimedia component 2 Multimedia component 2 Multimedia component 3 Multimedia component 3 Multimedia component 4 Multimedia component 4 Acknowledgements We thank Prof. Qi Liu from the School of Life Sciences and Technology, Tongji University, Shanghai, China, for his technical assistance at P-NETwa-MLP. This work was supported by the National Key R&D Program of China 2022YFA1305700 National Natural Science Foundation of China 82272793 Peer review under responsibility of Tongji University. Appendix A Supplementary data to this article can be found online at https://doi.org/10.1016/j.ajur.2024.09.009 ",
  "metadata": {
    "Title of this paper": "ARHGAP21 is a RhoGAP for RhoA and RhoC with a role in proliferation and migration of prostate adenocarcinoma cells",
    "Journal it was published in:": "Asian Journal of Urology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490683/"
  }
}