{
  "title": "Paper_439",
  "abstract": "pmc Open Vet J Open Vet J 2846 openvetj Open Veterinary Journal 2226-4485 2218-6050 Faculty of Veterinary Medicine, University of Tripoli PMC12483385 PMC12483385.1 12483385 12483385 41036001 10.5455/OVJ.2025.v15.i8.14 OpenVetJ-15-8-3514 1 Research Article Effects of feeding regimen and dietary supplementation with Spirulina platensis on Coturnix Japonica Saeed Samera Tawfeek Mostafa Abou-Kassem Diaa Mahrose Khalid  * Animal and Poultry Production Department, Faculty of Technology and Development, Zagazig University, Zagazig, Egypt * ostrichkhalid@zu.edu.eg 2025 31 8 2025 15 8 498022 3514 3526 01 6 2025 04 7 2025 07 7 2025 01 01 2025 01 10 2025 02 10 2025 2025 https://creativecommons.org/licenses/by-nc/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License ( http://creativecommons.org/licenses/by-nc/4.0/ Background: Quail ( Coturnix coturnix Japonica Aim: This study examined the growth performance of Japanese quail as influenced by feeding regimens and dietary supplementation with Spirulina platensis Methods: A total of 324 Japanese quail chicks [1-week old; initial body weight (BW): 34.5 g] were haphazardly divided into 12 groups (27 birds/group), with each group had three replicates (nine chicks/each), involving four feeding regimens [ ad libitum Results: BW at marketing and BW gain at different ages were influenced by the feeding regimen. Birds that consumed 85REQ16 showed the lowest feed consumption (FC) at 1–3 weeks of age. During 4–6 and 1–6 weeks of age, quails fed on 85REQ and those fed on 85REQ16 consumed less feed. Quails of 85REQ16 exhibited the highest carcass, dressing, and giblet weights. Dressing and giblet weight differed due to the interaction between feeding regimen and dietary SP. Blood biochemicals were impacted by the feeding regimen, except for glucose concentration. Total protein, albumin, and globulin levels were low in 85REQ-fed quails. Quails fed a 1% SP-supplemented diet showed the lowest level of cholesterol and the greatest level of total antioxidant capacity. Most of the blood biochemicals studied fluctuated because of the interaction between the feeding regimen and dietary SP. The Lactobacillus Lactobacillus Enterococcus Salmonella Staphylococcus Conclusion: In conclusion, quail could be kept under a feed regimen of 85REQ16, with dietary supplementation of SP for healthier growth performance. Feed restriction Growth Microbial count Japanese quail Spirulina platensis pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Quail ( Coturnix coturnix Japonica Farghly et al., Mahrose et al., Attia et al. Abd El-Ghany, 2019 Abd El-Ghany, 2019 Mahrose et al. 2019b Mahrose et al. Abd El-Ghany, 2019 Mahrose et al. The principle of feed restriction regimens in poultry breeds chiefly proposes reducing extra energy spending, which commonly occurs when feeding is supplied ad libitum Hertamawati et al. Mahrose et al. Grieser et al. Dixon et al. Mahrose et al. Soomro et al. Seaweeds have been used in poultry to improve the immune condition of poultry, to reduce microbial capacity in the digestive tract, and to improve the quality of poultry eggs ( Wang et al. Michalak and Mahrose, 2020 Spirulina platensis Park et al. Ekizoglu et al. Michalak and Mahrose, 2020 Tufarelli et al. Mahrose and Michalak, 2022 Ismail et al. Michalak and Mahrose, 2020 Hassan et al. Ismail et al. Hassan et al. Feed restriction regimens for an extended interval could cause significant stress on poultry species. Seaweeds have been reported to alleviate stress and augment the bird’s immunity ( Mahrose and Michalak, 2022 Coturnix coturnix Japonica Materials and Methods Birds and their experimental design This study was executed at the Animal and Poultry Production Department, Faculty of Technology and Development, Zagazig University, Zagazig, Egypt. At 1 week of age, 324 Japanese quail chicks [initial body weight (BW): 34.5 g] were haphazardly divided into 12 treatment groups (27 birds/ group), and each group had three replicates (nine chicks each). Each replicate was retained in one pen (35×50×50 cm). A 4×3 factorial arrangement was applied involving four feeding regimens ADLIB, feeding on 85% of the requirements (85REQ), ADLIB within 16 hours/day (ADLIB16), and 85REQ within 16 hours/day (85REQ16) and three levels of dietary SP supplementation (0.0%, 0.5%, and 1.0%). The nutritional levels of SP in the current investigation were implemented as suggested by Park et al. Hassan et al. Preparation of SP Three strains of SP Hoballah et al. The selected cyanobacterium SP from the National Research Center (NRC, Cairo, Egypt) was commercially grown for 25 days by the company El-Nabarawy (El-Farafra Oasis, Al-Wadi Al-Jadid governorate) that has raceway ponds (2 m width × 20 m length × 0.6 m depth) with paddle wheel as a stirring system with a speed of 40 rpm, an algal separating unit (GEA Westfalia centrifugal Separator: GEA Mechanical Equipment Canada, Inc.), and finally an algal drying unit that was local hot air (60°C) shelved drying pox. A modified medium containing commercial-grade chemicals was used to grow the alga under study ( Hoballah et al. Arumugam et al. −1 −1 −1 −1 −1 −1 −1 −1 Diet and its management The basal experimental diet was planned to include the nutrient requirements of growing Japanese quails as suggested by NRC (1994) Table 1 Measurements BW and FC on a repeat of foundation were weighed to the closest gram at 1, 3, and 6 weeks of age, and then the mean BW gain and FCR (FCR; g feed/g gain) were processed throughout 1–3, 4–6, and 1–6 weeks of age. Dead quails were recognizable daily from 1 to 6 weeks of age. At 6 weeks of age, 72 males were randomly chosen (6 birds/ group; 2 birds/replicate) and randomly selected, having average BW about the quail group mean, fasted overnight, weighed, and slaughtered. The abdominal cavity was opened, and the edible organs (gizzard, liver, and heart) were removed and weighed in grams to the nearest three decimal points, proportionate to the live BW. The whole eviscerated carcasses were individually weighed, and the dressing percentage or carcass yield was recorded. Table 1. Composition and analysis of the experimental diet. Ingredients % Yellow corn 52.70 Soy bean meal (44%) 38.20 Corn-gluten (60%) 4.30 Cotton seed oil 1.60 Di-calcium phosphate 1.60 Limestone 0.90 Nacl 0.30 Premix * 0.30 L-lysine 0.03 D-L methionine 0.07 Analyzed composition ** Crude protein% 24.12 Metabolisable energy (Kcal/kg) 2910.11 Calcium % 0.85 Available phosphorus (%) 0.46 Lysine % 1.31 Methionine % 0.50 Methionine + digestible cystine (%) 0.82 * Growth vitamin and mineral premix, each 3 kg consists of: Vit A 12,000, 000 IU; Vit D3, 2,000, 000 IU; Vit. E. 10g; Vit k3 2 g; Vit B1, 1,000 mg; Vit B2, 49g; Vit B6, 105 g; Vit B12, 10 mg; Pantothenic acid, 10 g; Niacin, 20 g, Folic acid, 1,000 mg; Biotin, 50 g; Choline chloride, 500 mg, Fe, 30 g; Mn, 40 g; Cu, 3 g; Co, 200 mg; Si, 100 mg and Zn, 45 g. ** Analyzed according to AOAC (2006). Biochemicals in blood plasma Blood samples were collected at 6 weeks of age during slaughter to measure blood biochemicals. Plasma total protein, albumin, glucose, creatinine, urea-N, triglycerides (TGs), and cholesterol were measured colorimetrically using commercial kits (bought from Bio-diagnostic, Giza, Egypt) according to the manufacturer’s instructions. Plasma transaminase enzymes [alanine transaminase (ALT) and aspartate transaminase (AST)] activities were determined by colorimetric methods according to Diamond Bio-diagnostic, Giza, Egypt. Total protein, albumin, ALT and AST, and immunuglobulin M (IgM; ug/ml) values were assessed using biodiagnostic commercial kits [Biodiagnostic Company (Giza, Egypt) (Batch No: ALT (cat#AL1032), AST (cat#AS1062)] according to the manufacturers’ guidelines, as found by Hassan et al www.spectrum-diagnostics.com Hassan et al Heterophil (H)/lymphocyte (L) ratio (H/L ratio) analysis and heterophils and lymphocyte ratios were calculated using a drop of blood on the slide and distributed by another slide at an angle of 45° without pressure. The smear was then pigmented with Giemsa stain for 15 min and washed with distilled water after drying. The numbers were read as heterophils and lymphocytes under a microscope at ×100 (put a drop of oil on the slide). The H/L ratio was calculated by dividing the number of H by L ( Thiam et al. Cecal microbiota analysis For microbiological analysis, cecal contents were collected from two quails per replicate directly after slaughtering. A 1 g sample from the cecum was sterilized, and microbial analysis was conducted to determine the presence of Lactobacillus Enterococcus Salmonella Staphylococcus, Sieuwerts et al. Statistical examination The data were analyzed as a factorial arrangement 4×3 (4 programs of feed regimens × 3 levels of SP), according to Snedecor and Cochran (1982) SAS (1998) Y ijk i j ij ijk Where Y ijk i j = ij ijk Duncan, 1955 P Ethical approval All trial practices were conducted according to the rules of the Ethical Committee of the Faculty of Technology and Development, Zagazig University (ZU-IACUC/2/F/151/2024), Egypt. Results BW and BW gain of growing quails were significantly ( p Table 2 p Table 3 Tables 2 3 Table 2. Live BW and BW gain of Japanese quail chicks during 1–weeks as affected by feeding regimen, dietary SP supplementation, and their interactions. Items Body weight, g (weeks) BWG, g/bird/day 1 3 6 1–3 4–6 1–6 Feeding regimen ADLIB 34.79 139.81 a 225.63 a 7.50 a 4.09 b 5.45 a 85REQ 34.82 121.19 c 211.21 c 6.17 c 4.29 b 5.04 b ADLIB16 34.57 130.00 b 222.25 ab 6.82 b 4.39 b 5.36 a 85REQ16 33.99 112.85 d 214.62 bc 5.63 d 4.85 a 5.16 ab SEM 0.35 1.91 3.54 0.14 0.14 0.09 p 0.33 0.001 0.03 0.001 0.006 0.028 SP % SP 0.0 34.72 125.87 217.03 6.51 4.34 5.21 SP 0.5 34.31 125.27 219.66 6.49 4.49 5.29 SP 1.0 34.59 126.75 218.59 6.58 4.37 5.26 SEM 0.30 1.66 3.06 0.12 0.12 0.08 p 0.61 0.82 0.83 0.86 0.65 0.77 Interaction (FR×SP): ADLIB SP 0.0 34.67 134.85 217.07 7.15 3.92 5.21 SP 0.5 34.44 141.11 230.29 7.61 4.25 5.59 SP 1.0 35.26 143.48 229.52 7.73 4.09 5.55 85REQ SP 0.0 35.11 126.11 216.04 6.49 4.28 5.17 SP 0.5 34.63 116.63 207.11 5.85 4.31 4.92 SP 1.0 34.70 120.81 210.48 6.15 4.27 5.02 ADLIB16 SP 0.0 35.26 127.85 222.19 6.61 4.49 5.34 SP 0.5 34.33 131.04 226.37 6.91 4.54 5.49 SP 1.0 34.11 131.11 218.19 6.93 4.15 5.26 85REQ16 SP 0.0 33.85 114.66 212.81 5.77 4.67 5.11 SP 0.5 33.81 112.29 214.85 5.61 4.88 5.17 SP 1.0 34.29 111.59 216.19 5.52 4.98 5.19 SEM 0.60 3.31 6.13 0.24 0.24 0.17 p 0.83 0.25 0.59 0.25 0.87 0.62 abc p ad libitum ad libitum Spirulina platensis Spirulina platensis Spirulina platensis Spirulina platensis Regarding carcass traits, birds fed 85REQ16 exhibited the highest (p ) Table 4 Table 4 p As presented in Table 5 p Table 5 p Table 3. Feed consumption and FCR of Japanese quail chicks during 1–6 weeks as affected by feeding regimen, dietary SP supplementation, and their interactions. Items Feed consumption (g/day/bird) FCR, weeks (g feed/g gain) 1–3 4–6 1–6 1–3 4–6 1–6 Feeding regimen ADLIB 19.00 a 18.90 a 26.08 a 1.60 c 4.65 a 4.36 a 85REQ 15.69 b 15.28 b 22.58 b 1.64 b 3.58 b 4.25 b ADLIB16 18.88 a 19.14 a 26.18 a 1.61 c 4.39 a 4.37 a 85REQ16 15.19 c 15.35 b 22.43 b 1.67 a 3.20 b 4.21 b SEM 0.11 0.11 0.07 0.007 0.13 0.03 p 0.001 0.001 0.001 0.001 0.001 0.001 SP % SP 0.0 17.22 17.27 24.39 1.63 4.03 4.29 SP 0.5 17.09 17.24 24.32 1.64 3.87 4.30 SP 1.0 17.25 16.99 24.23 1.62 3.97 4.28 SEM 0.09 0.09 0.06 0.006 0.12 0.02 p 0.47 0.09 0.22 0.09 0.63 0.83 Interaction (FR×SP) ADLIB SP 0.0 19.02 19.12 26.22 1.61 4.92 4.38 SP 0.5 18.93 19.06 26.15 1.60 4.52 4.35 SP 1.0 19.06 18.51 25.88 1.59 4.53 4.34 85REQ SP 0.0 15.76 15.35 22.66 1.65 3.59 4.24 SP 0.5 15.69 15.16 22.52 1.64 3.52 4.27 SP 1.0 15.60 15.32 22.58 1.63 3.63 4.22 ADLIB16 SP 0.0 18.74 19.27 26.20 1.62 4.32 4.37 SP 0.5 19.06 19.06 26.21 1.60 4.22 4.36 SP 1.0 18.83 19.07 26.12 1.60 4.64 4.36 85REQ16 SP 0.0 15.36 15.34 22.49 1.66 3.28 4.20 SP 0.5 14.70 15.66 22.42 1.70 3.22 4.23 SP 1.0 15.51 15.03 22.36 1.64 3.09 4.21 SEM 0.17 0.19 0.19 0.12 0.013 0.23 p 0.62 0.12 0.32 0.86 0.28 0.78 abc P ad libitum ad libitum Spirulina platensis Spirulina platensis Spirulina platensis Spirulina platensis The feeding regimen did not affect the total microbial count, Enterococcus Salmonella, Staphylococcus Lactobacillus Table 6 Table 6 Lactobacillus Enterococcus p Salmonella Staphylococcus Table 6 Table 7 Discussion This contemporary study examined the growth performance of Japanese quail as influenced by feeding regimens and SP supplementation. Feed restriction regimens can enhance growth and decrease feed consumption ( Soomro et al. Aziz and Masoud, 2021 Farghly and Makled, 2015 Grieser et al. Grieser et al. Rajat (2013) Grieser et al. Karu et al. Alvarenga et al. Evans et al. Maoka, 2011 Michalak and Mahrose, 2020 Curabay et al. Abdel-Daim et al. Shokri et al. Table 4. Carcass characteristics of growing Japanese quail as affected by feeding regimen, SP supplementation, and their interactions at 6 weeks of age. Items BWPS Carcass weight Carcass % Giblets weight Giblets % Dressing weight Dressing % Feeding regimen ADLIB 205.33 bc 153 ab 74.39 7.67 b 3.75 160.67 ab 78.14 85REQ 201.78 b 148.89 b 73.75 8.29 ab 4.12 157.18 b 77.87 ADLIB16 221 ab 163.33 ab 73.97 8.67 ab 3.94 172. ab 77.91 85REQ16 226.44 a 165.89 a 73.49 9.74 a 4.33 175.63 a 77.82 SEM 6.05 5.00 0.77 0.48 0.24 5.03 0.80 p 0.02 0.07 0.86 0.04 0.41 0.04 0.99 SP % SP 0.0 206.67 152.50 73.84 8.11 3.96 160.61 77.79 SP 0.5 218.75 163.83 74.82 8.50 3.92 172.33 78.74 SP 1.0 215.50 157 73.04 9.17 4.23 166.17 77.27 SEM 5.24 4.33 0.67 0.42 0.21 4.35 0.70 p 0.26 0.19 0.19 0.21 0.53 0.18 0.34 Interaction (FR×SP): ADLIB SP 0.0 192.67 142.67 73.77 3.69 1.05 77.46 7.00 SP 0.5 211.67 153.67 72.64 3.48 0.95 76.12 7.33 SP 1.0 211.67 162.67 76.76 4.09 0.95 80.85 8.67 85REQ SP 0.0 196.67 146.67 74.55 4.33 1.02 78.88 8.53 SP 0.5 214.00 158.33 73.94 4.09 0.95 78.03 8.67 SP 1.0 194.67 141.67 72.74 3.95 1.03 76.69 7.67 ADLIB16 SP 0.0 233.67 166.33 71.16 3.57 0.86 74.73 8.33 SP 0.5 217.33 166 76.39 4.32 0.92 80.71 9.33 SP 1.0 212 157.67 74.36 3.94 0.94 78.30 8.33 85REQ16 SP 0.0 203.67 154.33 75.86 4.23 0.94 80.10 8.57 SP 0.5 232 177.33 76.31 3.79 0.87 80.10 8.67 SP 1.0 243.67 166 68.30 4.95 0.82 73.25 12 SEM 10.49 8.67 1.39 0.83 1.34 8.71 p 0.12 0.52 0.001 0.11 0.001 0.54 Means differ in each classification with different significance ( p ad libitum ad libitum Spirulina platensis Spirulina platensis Spirulina platensis Spirulina platensis Table 5. Blood biochemicals of Japanese quail as affected by feeding regimen, SP supplementation, and their interactions, at 6 weeks of age. Items Liver and kidney functions Lipid profile Glucose Mg/dl TP g/dl ALB g/dl Glob g/dl ALT U/L AST U/L Urea-N mg/dl Creat mg/dl Chol mg/dl TG mg/dl IgM ug/ml TAC Mm/l H/L ratio  Feeding regimen  ADLIB 271.55 a 3.50 a 1.07 bc 2.43 a 8.75 a 322.88 a 1.37 a 0.48 a 207.44 a 90.33 c 99.23 c 1.60 d 0.53 a  85REQ 247.71 ab 3.09 b 1.02 c 2.06 b 8.35 a 318.44 a 1.32 b 0.42 c 167.66 b 77.66 c 126.22 a 1.78 c 0.50 b  ADLIB16 248.62 ab 3.54 a 1.12 ab 2.42 a 8.58 a 320.22 a 1.37 a 0.46 b 164.88 b 126.33 b 128 a 1.97 b 0.47 c  85REQ16 234.50 b 3.67 a 1.16 a 2.51 a 6.96 b 291 b 1.36 a 0.42 c 216.55 a 162.22 a 109.77 b 2.18 a 0.47 c  SEM 11.54 0.08 0.02 0.07 0.46 7.56 0.01 0.009 4.56 10.17 1.81 0.02 0.005  p-value 0.18 0. 001 0.001 0.004 0.04 0.02 0.01 0.001 0.001 0.001 0.001 0.001 0.001  SP %  SP 0.0 265.42 a 3.56 a 1.11 ab 2.45 a 8.29 312.25 ab 1.36 0.45 187.25 ab 115.75 113.48 1.84 b 0.49  SP 0.5 255.16 ab 3.26 b 1.05 b 2.20 b 8.43 323.91a 1.34 0.45 197.75 a 102.91 116.01 1.87 b 0.50  SP 1.0 231.20 b 3.54 a 1.12 a 2.41 a 7.77 303.25 b 1.37 0.43 182.41 b 123.75 117.92 1.94 a 0.49  SEM 9.99 0.06 0.018 0.06 0.40 6.55 0.009 0.007 3.95 8.81 1.57 0.02 0.004  p-value 0.06 0.01 0.03 0.01 0.48 0.10 0.18 0.29 0.03 0.26 0.15 0.001 0.50  Interaction (FR×SP):  ADLIB  SP 0.0 253.70 3.81 1.07 2.74 7.86 318.00 1.35 0.49 201.00 86.00 92.60 1.54 0.55  SP 0.5 277.66 3.23 1.06 2.17 8.66 325.00 1.38 0.49 223.33 89.00 100.40 1.60 0.53  SP 1.0 283.30 3.46 1.08 2.38 9.73 325.66 1.40 0.47 198.00 96.00 104.70 1.66 0.50  85REQ  SP 0.0 240.40 2.74 0.96 1.77 8.50 309.00 1.34 0.45 190.33 88.00 118.00 1.73 0.50  SP 0.5 273.06 3.31 1.05 2.25 8.33 331.00 1.30 0.42 164.00 82.66 121.00 1.76 0.52  SP 1.0 229.66 3.22 1.05 2.17 8.23 315.33 1.34 0.41 148.66 62.33 139.66 1.86 0.49  ADLIB16  SP 0.0 293.43 4.17 1.30 2.87 8.46 314.66 1.40 0.45 139.00 162.66 132.00 1.90 0.47  SP 0.5 245.13 3.15 1.01 2.14 9.70 332.66 1.32 0.46 162.66 90.33 131.66 1.98 0.45  SP 1.0 207.30 3.31 1.06 2.25 7.60 313.33 1.39 0.46 193.00 126.00 120.33 2.02 0.49  85REQ16  SP 0.0 274.166 3.51 1.08 2.42 8.33 307.33 1.35 0.42 218.66 126.33 111.33 2.18 0.44  SP 0.5 224.80 3.34 1.09 2.25 7.03 307.00 1.38 0.42 241.00 149.66 111.00 2.15 0.49  SP 1.0 204.53 4.16 1.31 2.85 5.53 258.66 1.34 0.41 190.00 210.66 107.00 2.22 0.47  SEM 19.98 0.14 0.12 0.12 0.12 13.100 13.10 0.02 7.90 17.61 3.13 0.04 0.008  p-value 0.08 0.001 0.001 .001 0.14 0.34 0.03 0.86 0.001 0.01 0.002 0.71 0.003 abc p ad libitum ad libitum Spirulina platensis Spirulina platensis Spirulina platensis Spirulina platensis Table 6. Cecal microbial count of growing Japanese quail as affected by feeding regimen, SP supplementation, and their interactions at 6 weeks of age. Items Total bacterial count  Lactobacillus  Enterococcus  Salmonella  Staphylococcus Feeding regimen ADLIB 8.13 b 5.17 c 5.65 4.81 4.68 85REQ 8.55 a 5.23 bc 6.01 4.77 4.74 ADLIB16 8.41 ab 5.67 a 5.87 4.70 4.60 85REQ16 8.43 ab 5.46 ab 5.70 4.65 4.59 SEM 0.13 0.09 0.14 0.05 0.08 p 0.16 0.001 0.26 0.19 0.48 SP % SP 0.0 8.23 4.51 c 5.14 c 5.64 a 5.70 a SP 0.5 8.36 5.43 b 5.84 b 4.71 b 4.68 b SP 1.0 8.55 6.20 a 6.45 a 3.85 c 3.58 c SEM 0.11 0.07 0.12 0.05 0.07 p 0.15 0.001 0.001 0.001 0.001 Interaction (FS×SW): ADLIB SP 0.0 8.01 4.12 5.11 5.63 5.70 SP 0.5 8.11 5.29 5.66 4.83 4.78 SP 1.0 8.26 6.11 6.18 3.96 3.58 85REQ SP 0.0 8.36 4.29 5.55 5.81 5.87 SP 0.5 8.50 5.38 5.83 4.75 4.72 SP 1.0 8.79 6.00 6.66 3.76 3.63 ADLIB16 SP 0.0 8.32 4.88 5.14 5.61 5.66 SP 0.5 8.41 5.68 6.00 4.66 4.56 SP 1.0 8.52 6.44 6.48 3.84 3.59 85REQ16 SP 0.0 8.24 4.76 4.77 5.53 5.55 SP 0.5 8.42 5.38 5.86 4.59 4.67 SP 1.0 8.64 6.23 6.46 3.85 3.56 SEM 0.22 0.15 0.24 0.09 0.13 p 0.99 0.49 0.67 0.45 0.88 abc p 85REQ = feeding on 85% of the requirements; 85REQ16 = feeding on 85% of the requirements within 16 hours/day; ADLIB = ad libitum ad libitum Spirulina platensis Spirulina platensis Spirulina platensis Spirulina platensis. Feed restriction regimens can decrease the carcass weight of Japanese quail ( Ocak and Erener, 2005 Abbas et al. Tůmová et al. Ekizoglu et al. Marareni et al. Subakir et al. Sargassum polycystum Ekizoglu et al. Mariey et al. Jamil et al. Table 7. Economic efficiency (%) of growing Japanese quail as affected by feeding regimen, SP supplementation, and their interactions. Items Feeding regimen ADLIB 85REQ ADLIB16 85REQ16 SP % SP 0.0 SP 0.5 SP 0.1 SP 0.0 SP 0.5 SP 0.1 SP 0.0 SP 0.5 SP 0.1 SP 0.0 SP 0.5 SP 0.1 Final No. of quails 27 27 27 27 27 27 27 27 27 27 27 27 Total feed consumed (Kg) 21.779 21.736 21.454 18.411 18.278 18.334 21.759 21.764 21.683 18.256 18.186 18.135 Price of 1kg feed ($) 0.8 0.8 0.8 0.8 0.8 0.8 0.8 0.8 0.8 0.8 0.8 0.8 Cost of feed ($) 17.42 17.88 17.16 14.72 14.62 14.66 17.40 17.41 17.34 14.60 14.54 14.51 Cost of supply ($) 0 4.52 8.93 0 3.81 7.64 0 4.53 9.03 0 3.78 7.54 Fixed cost ($) 0.16 0.16 0.16 0.16 0.16 0.16 0.16 0.16 0.16 0.16 0.16 0.16 Total cost ($) 17.58 22.56 26.25 14.88 18.59 22.46 17.56 22.1 26.53 14.76 18.48 22.21 Price/ quail ($) 1.25 1.25 1.25 1.25 1.25 1.25 1.25 1.25 1.25 1.25 1.25 1.25 Total price of quails ($) 33.75 33.75 33.75 33.75 33.75 33.75 33.75 33.75 33.75 33.75 33.75 33.75 Net return ($) 16.16 11.66 7.48 18.85 15.15 11.27 16.17 11.63 7.20 18.97 15.24 11.53 Economic efficiency (%) 91.92 51.68 28.50 126.68 81.50 50.18 92.08 52.62 27.14 128.52 82.47 51.91 85REQ: feeding on 85% of the requirements; 85REQ16: feeding on 85% of the requirements within 16 hours/day; ADLIB: ad libitum ad libitum Spirulina platensis Spirulina platensis Spirulina platensis Spirulina platensis Biochemical measurement of blood indicates metabolism in poultry species ( Tůmová et al. Vijayalingam et al. Scholtz et al. Agina et al. Tůmová et al. Abd et al. Abd et al. Abd El-Hack et al. Ekizoglu et al. Vijayalingam et al. Lee et al. Gross and Siegel, 1983 Thiam et al. Salmonella The microflora in the digestive tract plays a substantial role in gut health ( Balamuralikrishnan et al. Shafiei et al. Tyl et al. Lactobacillus Balamuralikrishnan et al. Lactobacillus Lactobacillus Park et al. Abdel-Wahab et al. Park et al. Jeong and Kim, 2014 Lactobacillus Salmonella Abdel-Wahab et al. The authors added that the antimicrobial efficacy of SP may be due to some of its constituents, for example, palmitoleic acid, c-linolenic acid, and lauric acid. The outstanding prebiotic properties of SP have an inspiring impact on the growth of Lactobacillus Chauhan (2008) Spirulina L. acidophilus Bhowmik et al. Taha (2008) in vivo Lactobacillus Janczyk et al. Kang et al. The contemporary report revealed that dietary supplementation of SP0.0 to growing quails reared under 85REQ16 or 85REQ enhanced their net returns. However, economic efficiency assessments were lower owing to SP at greater levels (0.5% and 1%) and the upper price of SP. Hassan et al. Hassan et al. Conclusion Based on the current findings, quail could be kept under a feed restriction regimen of feeding on 85% of the requirements within 16 hours/day, with dietary supplementation of SP for healthier growth performance. Authors’ contributions All authors contributed equally. Conflict of interest The authors have no conflicts of interest to declare. Funding This study was supported by the Science, Technology & Innovation Funding Authority (STDF), Egypt, under grant 48365 Data availability The data supporting this study’s findings are available from the corresponding author upon reasonable request. References Abbas Y. Sahota A.W. Akram M. Mehmood S. Hussain J. Younus M. Awais M.M. Sial A.R. Effect of different feed restriction regimes on growth performance and economic efficiency of Japanese quails J. Anim. Plant Sci 2015 25 4 966 970 Abd S.K. Al-Khateeb F.S. Abdulbaki T.M. Effect of quantitative feed restriction on some physiological parameters of Japanese quails Kufa J. Vet. Med. Sci 2015 6 2 33 48 Abedin R.M.A. Taha H.M. Antibacterial and antifungal activity of cyanobacteria and green microalgae Evaluation of medium components by Plackett-Burman design for antimicrobial activity of Spirulina platensis. Glob. J. Biotechnol. Biochem 2008 3 22 31 Abdel-Daim M.M. Abuzead S.M. Halawa S.M. Protective role of Spirulina platensis against acute deltamethrin-induced toxicity in rats PLoS One 2013 8 e72991 24039839 10.1371/journal.pone.0072991 PMC3767669 Abd El-Ghany W.A. A comprehensive review on the common emerging diseases in quails J. World Poult. Res 2019 9 160 174 Abd El-Hack M.E. Majrashi K.A. Fakiha K.G. Roshdy M. Kamal M. Saleh R.M. Khafaga A.K. Othman S.I. Rudayni H.A. Allam A.A. Moustafa M. Isaias G. Alagawany M. Effects of varying dietary microalgae levels on performance, egg quality, fertility, and blood biochemical parameters of laying Japanese quails (Coturnix coturnix Japonica) Poult. Sci 2024 103 103454 https://doi:10.1016/j.psj.2024.103454. 38340659 10.1016/j.psj.2024.103454 PMC10869901 Abdel-Wahab A.A. Elnesr S.S. Ahmad E.A.M. Abdel-Kader I.A. Effect of dietary supplementation of Spirulina platensis powder on performance, some serum biochemistry, digestive enzymes, microbial content, antioxidant parameters and immune responses of growing Japanese quail Anim. Biotechnol 2023 34 4869 4877 https://doi:10.1080/10495398.2023.2200462. 37067444 10.1080/10495398.2023.2200462 Agina O.A. Ezema W.S. Iwuoha E.M. The haematology and serum biochemistry profile of adult Japanese quail (Coturnix coturnix Japonica) Not. Sci. Biol 2017 9 67 72 https://doi:10.15835/nsb919928. Alvarenga R.R. Rodrigues P.B. Cantarelli V. Zangeronimo M.G. Da Silva Junior J.W. Da Silva L.R. Dos Santos L.M. Pereira L.J. Energy values and chemical composition of Spirulina (Spirulina platensis) evaluated with broilers Braz. J. Anim. Sci 2011 40 992 996 AOAC Association of official analyical chemists official methods of analysis 2006 18th Washington, D.C. AOAC Arumugam M. Agarwal A. Arya M.C. Ahmed Z. Influence of nitrogen sources on biomass productivity of microalgae Scenedesmus bijugatus Bioresource Technol 2013 131 246 249 10.1016/j.biortech.2012.12.159 23353039 Attia A.I. Mahrose K.M. Ismail I.E. Abou-Kasem D.E. Response of growing Japanese quail raised under two stocking densities to dietary protein and energy levels Egypt J. Anim. Prod 2012 49 159 167 Aziz E.K. Masoud S.R. The effect of feeding frequency and amount on performance, behavior and physiological responses of broilers J. Appl. Vet. Sci 2021 6 76 85 Balamuralikrishnan B. Shanmugam S. Park S. Recharla N. Koo J.S. Andretta I. Kim I.H. Supplemental impact of marine red seaweed (Halymenia palmata) on the growth performance, total tract nutrient digestibility, blood profiles, intestine histomorphology, meat quality, fecal gas emission, and microbial counts in broilers Animals 2021 11 1244 https://doi:10.3390/ani11051244. 33925270 10.3390/ani11051244 PMC8146337 Bhowmik D. Dubey J. Mehra S. Probiotic efficiency of Spirulina platensis—stimulating growth of lactic acid bacteria World J. Dairy Food Sci 2009 6 546 549 Curabay B. Sevim B. Cufadar Y. Ayasan T. Effects of adding Spirulina platensis to laying hen rations on performance, egg quality, and some blood parameters J. Hellenic Vet. Med. Soc 2021 72 2945 2952 Dixon L.M. Dunn I.C. Brocklehurst S. Baker L. Boswell T. Caughey S.D. Reid A. Sandilands V. Wilson P.W. D’Eath R.B. The effects of feed restriction, time of day, and time since feeding on behavioral and physiological indicators of hunger in broiler breeder hens Poult. Sci 2022 101 101838 35378348 10.1016/j.psj.2022.101838 PMC8983422 Duncan D.B. Multiple range and multiple F test Biometrics 1955 11 1 42 Ekizoglu H. Ülger İ. Kaliber M. Ayasan T. Effects of spirulina (Algae) supplementation to Japanese quail (Coturnix coturnix Japonica) diets on growth performance and carcass traits India. J. Anim. Sci 2020 90 923 927 Evans A.M. Smith D.L. Moritz J.S. Effects of algae incorporation into broiler starter diet formulations on nutrient digestibility and 3 to 21 d bird performance J. Appl. Poult. Res 2015 24 206 214 Farghly M. Mahrose K. Abougabal M. Taboosha M. Ali R. Early heat acclimation during incubation improves Japanese quail performance under summer conditions Vet. Res. Comm 2022 46 93 100 10.1007/s11259-021-09832-0 34537913 Farghly M. Mahrose K. Abou-Kassem D. Pre and post hatch performance of different Japanese quail egg colors incubated under Photostimulation Asian J. Poult. Sci 2015 9 19 30 Farghly M.F.A. Makled M.N. Application of intermittent feeding and flash lighting regimens in broiler chickens management Egypt. J. Nutr. Feeds 2015 18 261 276 Grieser D.O. Marcato S.M. Ferreira M.F.Z. de Oliveira-Bruxel T.M. Zancanela V. Ferreira M.S. Stanquevis C.E. Finco E.M. Productive performance, body chemical composition, and deposition of 42-day-old quail for meat subjected to quantitative dietary restriction Ciências Agrárias, Londrina 2017 38 855 866 Grieser D.O. Marcato S.M. Furlan A.C. Zancanela V. Ton A.P.S. Batista E. Perine T.P. Pozza P.C. Sakomura N.C. Comparison of growth curve parameters of organs and body components in meat- (Coturnix coturnix Coturnix) and laying-type (Coturnix coturnix Japonica) quail show interactions between gender and genotype Br. Poult. Sci 2015 56 6 14 25490970 10.1080/00071668.2014.988602 Gross W.B. Siegel H.S. Evaluation of the heterophil/lymphocyte ratio as a measure of stress in chickens Avian Dis 1983 27 4 972 979 6360120 Hassan F.A. Mahrose K.M. Basyony M.M. Effects of grape seed extract as a natural antioxidant on growth performance, carcass characteristics and antioxidant status of rabbits during heat stress, Arch Anim. Nutr 2016 70 141 154 https://doi:10.1080/1745039X.2016.1139609. 10.1080/1745039X.2016.1139609 26829476 Hassan F. Mobarez S. Mohamed M. Attia Y. Mekawy A. Mahrose K. Zinc and/or selenium enriched spirulina as antioxidants in growing rabbit diets to alleviate the deleterious impacts of heat stress during summer season Animals 2021 11 756 https://doi:10.3390/ani11030756. 33801803 10.3390/ani11030756 PMC8001169 Hassan R.I. Refaie M.S. El-Shoukary R.D. Rehan I.F. Zigo F. Karaffová V. Amer H.Y. Effect of dietary microalgae (Spirulina platensis) on growth performance, ingestive behavior, hemato-biochemical parameters, and economic efficiency of Fayoumi broilers Life 2022 12 1892 https://doi:10.3390/life12111892. 36431027 10.3390/life12111892 PMC9694510 Hertamawati R.T. Suyadi Soedjarwo E. Sjofjan O. Reproductive performance of Japanese quail hens (Coturnix coturnix Japonica) fed with feed restriction regimes during growth period Agric. Sci. Digest 2019 39 163 166 Hoballah E. Attallah A.G. Abd-El-Aal S.K. Genetic diversity of some new local strains of cyanobacteria isolated from Wadi El -Natrun, Egypt Int. J. Acad. Res 2012 4 314 326 Ismail F. Sherif K. Rizk Y. Hassan M. Mekawy A. Mahrose K. Dietary supplementation of spirulina and canthaxanthin boosts laying performance, lipid profile in blood and egg yolk, hatchability, and semen quality of chickens J. Anim. Physiol. Anim. Nutr 2023 107 650 658 10.1111/jpn.13729 35534942 Jamil A.B.M.R. Akanda M.R. Rahman M.M. Hossain M.A. Islam M.S. Prebiotic competence of spirulina on the production performance of broiler chickens J. Adv. Vet. Anim. Res 2015 2 304 309 Janczyk P. Halle B. Souffrant W.B. Microbial community composition of the crop and ceca contents of laying hens fed diets supplemented with Chlorella vulgaris Poult. Sci 2009 88 2324 2332 19834082 10.3382/ps.2009-00250 Jeong J.S. Kim I.H. Effect of Bacillus subtilis C-3102 spores as a probiotic feed supplement on growth performance, noxious gas emission, and intestinal microflora in broilers Poult. Sci 2014 93 3097 3103 25260523 10.3382/ps.2014-04086 Kang H.K. Salim H.M. Akter N. Kim D.W. Kim J.H. Bang H.T. Kim M.J. Na J.C. Hwangbo J. Choi H.C. Suh O.S. Effect of various forms of dietary Chlorella supplementation on growth performance, immune characteristics, and intestinal microflora population of broiler chickens J. Appl. Poult. Res 2013 22 100 108 Karu P. Selvan S.T. Gopi H. Manobhavan M. Effect of macroalgae supplementation on growth performance of Japanese quails Int. J. Curr. Microbiol. App. Sci 2018 7 1039 1041 Kaushik P. Chauhan A. In vitro antibacterial activity of laboratory grown culture of Spirulina platensis Ind. J. Microbiol 2008 48 348 352 10.1007/s12088-008-0043-0 PMC3476771 23100733 Lee C. Kim J.H. Kil D.Y. Comparison of stress biomarkers in laying hens raised under a long-term multiple stress condition Poult. Sci 2022 101 6 101868 https://doi:10.1016/j.psj.2022.101868. 35477135 10.1016/j.psj.2022.101868 PMC9058573 Mahrose K.M. Abol-Ela S. Amin R.M. Abou-Kassem D.E. Restricted feeding could enhance feed conversion ratio and egg quality of laying Japanese quail kept under different stocking densities Anim. Biotechnol 2022 33 141 149 32844728 10.1080/10495398.2020.1810059 Mahrose K.M. Abd El-Hack M.E. Amer S.A. Influences of dietary crude protein and stocking density on growth performance and body measurements of ostrich chicks An. Acad. Bras. Cienc 2019a 91 e20180479 30994768 10.1590/0001-3765201920180479 Mahrose K.M. Alagawany M. Abd El-Hack M.E. Mahgoub S.A. Attia F.A.M. Influences of stocking density and dietary probiotic supplementation on growing Japanese quail performance An. Acad. Bras. Cienc 2019b 91 e20180616 31038540 10.1590/0001-3765201920180616 Mahrose K.M. Michalak I. Rao A.R. Ravishankar G.A. Seaweeds for animal feed, current status, challenges, and opportunities In Sustainable global resources of seaweeds 2022 1 Cham, Switzerland Springer 357 359 Mahrose K.M. Michalak I. Farghly M. Elokil A. Zhang R. Ayaşan T. Mekawy A. Fazlani S. Role of clay in detoxification of aflatoxin B1 in growing Japanese quail with reference to gender Vet. Res. Comm 2021 45 363 371 10.1007/s11259-021-09817-z 34374005 Mariey Y.A. Samak H.R. Abou-Khashba H.A. Sayed M.A.M. Abou-Zeid A.E. Effect of using Spirulina platensis algae as feed additives for poultry diets: 2-productive performance of broiler Egypt. Poult. Sci. J 2014 34 245 58 Marareni M. Mhlongo G. Mnisi C.M. The effect of incorporating dietary green seaweed (Ulva sp.) on growth performance, blood parameters, and carcass and meat quality characteristics of Jumbo quail Heliyon 2023 9 e19603 37809481 10.1016/j.heliyon.2023.e19603 PMC10558836 Michalak I. Mahrose K.M. Seaweeds, intact and processed, as a valuable component of poultry feed J. Mar. Sci. Eng 2020 8 620 https://doi:10.3390/jmse8080620. Maoka T. Carotenoids in marine animals Mar. Drugs 2011 9 278 293 https://doi:10.3390/md9020278. 21566799 10.3390/md9020278 PMC3093257 National Research Council (NRC) Nutrient requirements of poultry 1994 9th Washington, D.C., USA National Academy of Science Ocak N. Erener G. The effects of restricted feeding and feed form on growth, carcass characteristics and days to first egg of Japanese quail (Coturnix coturnix japonica) Asian-Aust. J. Anim. Sci 2005 18 1479 1484 Park J.H. Lee S.I. Kim I.H. Effect of dietary Spirulina (Arthrospira) platensis on the growth performance, antioxidant enzyme activity, nutrient digestibility, cecal microflora, excreta noxious gas emission, and breast meat quality of broiler chickens Poult. Sci 2018 97 2451 2459 29672750 10.3382/ps/pey093 Rajat B. Effects of feed restriction on compensatory growth period, nutrient digestibility and economics of Japanese quails (Coturnix coturnix japonica) Int. Multidiscip. Res. J 2013 3 4 7 SAS Institute SAS user’s guide: version 9.1 1998 Cary SAS Institute Inc Scholtz N. Halle I. Flachowsky G. Sauerwein H. Serum chemistry reference values in adult Japanese quail (Coturnix coturnix japonica) including sex-related differences Poult. Sci 2009 88 1186 1190 19439629 10.3382/ps.2008-00546 Shafiei A. Khavarinezhad S. Javandel F. Nosrati M. Seidavi A. Diarra S.S. Effects of duration of early feed withdrawal and re-feeding on growth, carcass traits, plasma constituents and intestinal microflora of broiler chickens J. Appl. Anim. Res 2018 46 1358 1362 Shokri H. Khosravi A. Taghavi M. Efficacy of Spirulina platensis on immune functions in cancer mice with systemic candidiasis J. Mycol. Res 2014 1 7 13 Sieuwerts S. De Bok F.A. Mols E. De Vos W.M. van Hylckama Vlieg J.E.T.A. Simple and fast method for determining colony forming units Lett. Appl. Microbiol 2008 47 275 278 18778376 10.1111/j.1472-765X.2008.02417.x Snedecor G.W. Cochran W.G. Statistical methods 1982 6th Ames, IA, USA Lowa State University Press Soomro R.N. Abd El‐Hack M.E. Shah S.S. Taha A.E. Alagawany M. Swelum A.A. Hussein E.O. Ba‐Aawdh H.A. Saadeldin I. El‐Edel M.A. Tufarelli V. Impact of restricting feed and probiotic supplementation on growth performance, mortality and carcass traits of meat‐type quails Anim. Sci. J 2019 90 1388 1395 31464048 10.1111/asj.13290 Subakir F.N.M. Ishak N.I. Samah A.N. Aziz K.A.A. Zaharudin N. The effects of seaweed-based pellet binders on growth performance, feed efficiency and carcass characteristics in broilers Anim. Feed Sci. Technol 2021 272 114786 https://doi:10.1016/j.anifeedsci.2020.114786. Thiam M. Wang Q. Sánchez A.B. Zhang J. Ding J. Wang H. Zhang Q. Zhang N. Wang J. Li Q. Wen J. Zhao G. Heterophil/Lymphocyte ratio level modulates Salmonella resistance, cecal microbiota composition and functional capacity in infected chicken Front. Immunol 2022 13 816689 https://doi:10.3389/fimmu.2022.816689. 35493492 10.3389/fimmu.2022.816689 PMC9047862 Tufarelli V. Baghban-Kanani P. Azimi-Youvalari S. Hosseintabar-Ghasemabad B. Slozhenkina M. Gorlov I. Seidavi A. Ayaşan T. Laudadio V. Effects of Horsetail (Equisetum arvense) and spirulina (Spirulina platensis) dietary supplementation on laying hens productivity and oxidative status Animals, 2021 11 335 https://doi:10.3390/ani11020335. 33525736 10.3390/ani11020335 PMC7911488 Tůmová E. Chodová D. Härtlová H. Fučiková A. Ketta M. Effect of feeding regime on the performance and blood parameters of male and female broiler chickens S. Afr. J. Anim. Sci 2019 49 244 252 Tyl J. Tůmová E. Chodova D. The effect of feed restriction and housing system on performance, organ proportion and microbiota Czech J. Anim. Sci 2024 69 68 74 Vijayalingam T.A. Rajesh N.V. Vairamuthu S. Boopathy Raja M. Sudeep Kumar N.K. Effect of dietary supplementation of seaweeds on growth and blood profiles of TANUVAS Aseel chicken J. Hellenic Vet. Med. Soc 2023 74 6085 6092 https://doi:10.12681/jhvms.30812. Wang S. Hui J.Y. Hua W.L. Hua Z.F. Ting L.Y. Enteromorphaprolifera supplemental level: effects on laying performance, egg quality, immune function and microflora in feces of laying hens Chinese J. Anim. Nutr 2013 25 1346 1352 ",
  "metadata": {
    "Title of this paper": "Enteromorphaprolifera supplemental level: effects on laying performance, egg quality, immune function and microflora in feces of laying hens",
    "Journal it was published in:": "Open Veterinary Journal",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483385/"
  }
}