{
  "title": "Paper_1155",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469642 PMC12469642.1 12469642 12469642 41009596 10.3390/ijms26189032 ijms-26-09032 1 Article Transcriptional Consequences of MeCP2 Knockdown and Overexpression in Mouse Primary Cortical Neurons https://orcid.org/0000-0001-9569-118X Rezapour Mostafa 1 * https://orcid.org/0009-0004-0997-8133 Bowser Joshua 2 Richardson Christine 2 https://orcid.org/0000-0002-2421-8229 Gurcan Metin Nafi 3 Churnosov Mikhail I. Academic Editor 1 2 c.richardson@charlotte.edu 3 * mostafa.rezapour@advocatehealth.org 17 9 2025 9 2025 26 18 497349 9032 04 9 2025 12 9 2025 14 9 2025 17 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Rett syndrome (RTT) and MECP2 duplication syndrome, a subtype of autism spectrum disorder (ASD), are neurodevelopmental disorders caused by MeCP2 loss and gain of function, respectively. While MeCP2 is known to regulate transcription through its interaction with methylated DNA and chromatin-associated factors such as topoisomerase IIβ (TOP2β), the downstream transcriptional consequences of MeCP2 dosage imbalance remain partially characterized. Here, we present a transcriptome-centered analysis of mouse primary cortical neurons subjected to MeCP2 knockdown (KD) or overexpression (OE), which model RTT and ASD-like conditions in parallel. Using a robust computational pipeline integrating generalized linear models with quasi-likelihood F-tests and Magnitude–Altitude Scoring (GLMQL-MAS), we identified differentially expressed genes (DEGs) in KD and OE relative to wild-type (WT) neurons. This study represents a computational analysis of secondary transcriptomic data aimed at nominating candidate genes for future experimental validation. Gene Ontology enrichment revealed both shared and condition-specific biological processes, with KD uniquely affecting neurodevelopmental and stress-response pathways, and OE perturbing extracellular matrix, calcium signaling, and neuroinflammatory processes. To prioritize robust and disease-relevant targets, we applied Cross-MAS and further filtered DEGs by correlation with MeCP2 expression and regulation directional consistency. This yielded 16 high-confidence dosage-sensitive genes that were capable of classifying WT, KD, and OE samples with 100% accuracy using PCA and logistic regression. Among these, RTT-associated candidates such as Plcb1, Gpr161, Mknk2, Rgcc, and Abhd6 were linked to disrupted synaptic signaling and neurogenesis, while ASD-associated genes, including Aim2, Mcm6, Pcdhb9, and Cbs, implicated neuroinflammation and metabolic stress. These findings establish a compact and mechanistically informative set of MeCP2-responsive genes, which enhance our understanding of transcriptional dysregulation in RTT and ASD and nominate molecular markers for future functional validation and therapeutic exploration. MeCP2 Rett syndrome autism spectrum disorder neurodevelopmental disorder differential expression analysis RNA-seq biomarker discovery GLMQL-MAS Cross-MAS mouse cortical neurons National Library of Medicine R25 LM014214 This work was supported by grant R25 LM014214 (PIs: Gurcan, Weaver, Movaghar) from the National Library of Medicine. The content is solely the responsibility of the authors and does not necessarily represent the official views of the National Institutes of Health or the National Library of Medicine. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Rett syndrome (RTT) is a severe neurodevelopmental disorder predominantly caused by mutations in the X-linked Methyl-CpG binding protein 2 (MeCP2) gene [ 1 2 3 3 4 4 TOP2β is a type II topoisomerase that facilitates transcription by resolving DNA supercoiling and inducing transient double-stranded breaks (DSBs), particularly in long genes [ 5 6 7 4 Although MeCP2 has traditionally been viewed as a transcriptional repressor, findings indicate that it also modulates gene expression in more complex and context-dependent ways [ 8 9 3 4 10 2 11 3 12 While MeCP2 deficiency causes RTT, MeCP2 overexpression leads to MECP2 duplication syndrome, a condition characterized by autism spectrum disorder (ASD)-like features, intellectual disability, and motor abnormalities [ 13 14 Recent work by Nettles et al. [ 4 4 In contrast to the study by Nettles et al. [ 4 15 16 17 The central aim of this study is to identify protein-coding genes that are transcriptionally associated with MeCP2 and exhibit dosage-sensitive expression in opposite directions, downregulated in KD and upregulated in OE, making them strong candidates for capturing the distinct molecular signatures underlying RTT and ASD. We hypothesize that a distinct subset of genes will respond to MeCP2 dosage in a directionally consistent and disease-relevant manner. To this end, differentially expressed genes (DEGs) under KD and OE conditions, relative to the wild type (WT), are identified using the generalized linear model with quasi-likelihood F-tests and Magnitude–Altitude Score (GLMQL-MAS) [ 18 19 20 21 22 23 p 24 25 To isolate genes most specifically associated with each perturbation, Cross-MAS [ 21 Further prioritization is achieved by filtering for genes that exhibit strong Spearman correlation [ 26 27 28 29 Finally, functional characterization using g:Profiler [ 30 While the mechanistic effects of MeCP2 dosage have been explored, a critical gap remains in identifying transcriptional markers that could serve as molecular surrogates for MeCP2 dysfunction in clinical settings. Collectively, this study establishes an integrative transcriptomic framework to identify MeCP2-associated, dosage-sensitive genes that are statistically robust, biologically relevant, and potentially translational. By jointly analyzing MeCP2 KD and OE conditions, representing RTT and ASD phenotypes, respectively, the study advances current understanding of how MeCP2 dosage imbalances alter neuronal gene expression and nominates condition-specific markers for RTT and ASD. In this study, we aim not only to elucidate the transcriptomic consequences of MeCP2 imbalance, but also to identify candidate genes that could inform diagnostic or therapeutic strategies in RTT and MECP2 duplication syndrome. 2. Results To investigate the impact of MeCP2 dosage alterations on gene expression, we compared transcriptomes from KD and OE neuronal conditions against WT controls using GLMQL-MAS [ 18 19 20 21 22 p 24 25 Figure 1 Figure 1 Figure 1 Figure 1 To gain insight into the biological functions perturbed by MeCP2 dosage alterations, we performed GO enrichment analysis on all significantly differentially expressed genes from both KD and OE conditions. Using the top 20 enriched GO terms (ranked by −log10( p Figure 2 In contrast, distinct sets of GO terms were uniquely enriched in each condition. For MeCP2 KD, uniquely enriched terms included cell population proliferation, tube development, response to stress, and regulation of multicellular organismal processes, thus indicating disruption of growth and communication pathways. For MeCP2 OE, the unique enrichment profile involved terms such as extracellular matrix, collagen trimer, calcium ion binding, and cellular response to toxic substances, thus implicating processes linked to structural remodeling and stress response. To delineate the gene expression changes that are uniquely associated with either MeCP2 KD or OE, as well as those common to both conditions, we applied the Cross-MAS algorithm [ 21 p Figure 3 Figure 3 To further refine the list of MeCP2-associated genes, we conducted correlation-based prioritization of candidates previously identified as uniquely up- or downregulated in MeCP2 KD or OE conditions (asterisk-labeled in Figure 3 Figure 4 Figure 4 Note that since our goal was to identify representative signatures for KD and OE, we needed to define directionality with respect to MeCP2 levels. While the opposite pattern (genes upregulated in KD and downregulated in OE) could also reflect dosage sensitivity, we focused on this direction of regulation to isolate genes whose expression positively tracks with MeCP2 dosage, thus enhancing interpretability and biological coherence. To visualize how these dosage-sensitive genes relate to MeCP2 expression more precisely, we plotted logFC against Spearman correlation values separately for KD ( Figure 4 Figure 4 Figure 4 Figure 4 To evaluate the discriminatory power of the selected genes, we applied dimensionality reduction using PCA followed by classification using logistic regression. These genes were identified through an integrative pipeline involving GLMQL-MAS, Cross-MAS, correlation analysis, and logFC-directional agreement. The final set of selected genes includes Pcdhb9, Gpr161, Slfn9, Gpalpp1, Mcm6, Zfp760, Abhd6, Pcdhb3, Plcb1, Cav1, Rgcc, Mknk2, Cbs, Sugct, Aim2, and Ptpn3. Figure 5 Figure 5 Using all protein-coding genes ( Figure 5 Figure 5 Using the 16 selected genes, we next performed functional enrichment analysis to determine whether these dosage-sensitive genes are involved in biological processes relevant to RTT. Enrichment was conducted using g:Profiler [ 30 Figure 6 Figure 6 Figure 6 3. Discussion The robust transcriptional changes observed following MeCP2 knockdown and overexpression ( Figure 1 Our GO enrichment analysis ( Figure 2 16 31 It is important to note, however, that MeCP2 loss of function is not restricted to RTT; it is also implicated in a wider spectrum of MeCP2-related disorders (MeCP2-pathies), which include intellectual disability and ASD-like features [ 2 MeCP2 OE, which has been implicated in ASD-like phenotypes, including in MECP2 duplication syndrome [ 17 32 33 34 35 The intersection and correlation analyses ( Figure 3 Figure 4 Pdgfb encodes platelet-derived growth factor subunit B (PDGFB), a key growth factor involved in processes such as cell proliferation, angiogenesis, and tissue repair [ 36 37 38 Nptx1 encodes neuronal pentraxin 1 (NP1), which plays a key role in synaptic remodeling and activity-dependent plasticity [ 39 40 12 41 Osgin1 (oxidative stress-induced growth inhibitor 1) is involved in the regulation of autophagy, apoptosis, and ferroptosis in response to oxidative stress [ 42 31 43 44 Mknk2 encodes MAP kinase-interacting serine/threonine-protein kinase 2 (MNK2), which plays a regulatory role in mRNA translation by phosphorylating eukaryotic initiation factor 4E (eIF4E) [ 45 46 47 48 49 Rgcc is involved in controlling progression through the G1/S and G2/M phases of the cell cycle [ 50 51 Gpr161 encodes a G protein-coupled receptor that modulates the Hedgehog signaling pathway, which is important for proper neural tube patterning and central nervous system development [ 52 52 53 54 Plcb1 encodes phospholipase C beta 1 (PLCB1), a key enzyme in phosphoinositide signaling that regulates intracellular calcium levels, neuronal excitability, and synaptic plasticity [ 55 56 57 In contrast to the RTT-associated genes described above, several genes identified in the MeCP2 OE condition are linked to ASD-related mechanisms. AIM2 is part of an inflammasome complex that activates caspase-1 and induces pro-inflammatory cytokines like IL-1β and IL-18. Studies in children with ASD demonstrate elevated AIM2 inflammasome activation and increased IL-1β/IL-18 levels compared to controls [ 58 59 60 61 These findings confirm that the transcriptional response to MeCP2 imbalance involves genes with functions directly tied to synaptic regulation, calcium signaling, oxidative stress response, and neurodevelopmental patterning. By specifically analyzing downregulated genes in the knockdown condition, we identified candidate molecular signatures linked to RTT-related mechanisms. Conversely, the upregulated genes under MeCP2 overexpression highlight pathways associated with ASD, including neuroinflammation and structural remodeling. The consistent dosage-sensitive behavior of these genes, combined with their correlation to MeCP2 levels and their established roles in neuronal development and disease, positions them as promising molecular markers for MeCP2-driven dysfunction and potential targets for future mechanistic and therapeutic investigations in both RTT and ASD contexts. To evaluate whether the selected genes could function as effective classifiers of MeCP2 dosage states, we applied PCA, followed by logistic regression, using the 16 prioritized genes identified through GLMQL-MAS, Cross-MAS, correlation analysis, and directionality filtering. As shown in Figure 5 Figure 5 Figure 5 Figure 5 To further characterize the biological relevance of these 16 genes, we performed separate functional enrichment analyses for those downregulated in KD and upregulated in OE ( Figure 6 62 58 63 64 4. Materials and Methods 4.1. Dataset Description The RNA-seq data analyzed in this study were obtained from Nettles et al. [ 4 GSE246463 Neurons were cultured in vitro for 12 days (DIV12), with lentiviral transduction performed on DIV3 to induce either MeCP2 knockdown (KD) or MeCP2 overexpression (OE). Control samples were transduced with a non-targeting virus. Each experimental group included both technical and biological replicates, with neuronal dissection and transduction performed independently across days for biological replication. Total RNA was extracted using the RNeasy Mini Kit (Qiagen) and subjected to rRNA depletion. RNA libraries were constructed using the NEBNext Ultra Directional RNA Library Prep Kit and sequenced on an Illumina NextSeq 500 platform, which produced single-end 75 bp reads with typical yields of 20–40 million reads per sample. This RNA-seq dataset was generated as part of a broader investigation into MeCP2 interactions with topoisomerase IIβ (TOP2β). However, for the present study, only the transcriptomic data were used to assess gene expression changes under MeCP2 KD and OE conditions relative to wild-type (WT) neurons. 4.2. Statistical Methods To identify differentially expressed genes (DEGs) under altered MeCP2 dosage conditions, we employed the GLMQL-MAS framework [ 18 19 20 21 22 65 66 67 68 69 RNA-seq count data were first normalized using the Trimmed Mean of M-values (TMM) normalization [ 70 Genes were defined as significantly differentially expressed if they met both of the following criteria: (1) BH-adjusted p 24 25 (1) M A S l = | l o g 2 ( FC l ) | M | l o g 10 ( p l B H ) | A , FC l p l B H p l M A To systematically distinguish between condition-specific and shared transcriptional changes, we further applied Cross-MAS, a ranking-based algorithm designed to identify genes with consistently strong MAS scores across multiple comparisons [ 21 p To refine the high-confidence DEGs identified by GLMQL-MAS and Cross-MAS, we applied an additional prioritization step based on correlation with MeCP2 expression and directionality of regulation. Specifically, we calculated Spearman correlation coefficients [ 26 To further enrich for biologically consistent and potentially direct MeCP2-responsive genes, we filtered for directionality agreement: genes that were downregulated in KD (logFC < 0) and upregulated in OE (logFC > 0). This criterion ensures that selected genes display expression patterns coherent with MeCP2 dosage, decreasing when MeCP2 is depleted and increasing when it is overexpressed. By intersecting correlation-based filtering with directionality agreement, we identified a compact set of dosage-sensitive genes whose transcriptional responses not only met statistical thresholds and ranking criteria but also aligned with the expected MeCP2-driven regulatory behavior. These genes were subsequently evaluated for their discriminative power and biological relevance using principal component analysis, classification modeling, and functional enrichment. Specifically, principal component analysis (PCA) [ 27 4.3. Gene Ontology (GO) Analysis To interpret the functional implications of the DEGs and selected genes, we performed Gene Ontology (GO) analysis using the g:Profiler web server [ 30 For each condition, gene symbols from the sets of significantly upregulated and downregulated genes were extracted and submitted as input queries to GProfiler, specifying the mouse genome (organism = “mmusculus”). Enrichment was performed against the GO database, including the biological process, cellular component, and molecular function categories. Only GO terms identified as statistically significant according to g:Profiler’s internal multiple testing correction procedure were retained for analysis. All enrichment procedures were conducted at the gene level, using GProfiler’s default statistical model and annotation framework, without applying a custom background gene set. 5. Conclusions This study presents a comprehensive transcriptome-centered investigation of MeCP2 dosage imbalance in neurons by analyzing both knockdown (KD) and overexpression (OE) conditions relative to wild type (WT). Using an integrative computational framework combining GLMQL-MAS, Cross-MAS, correlation analysis, and directionality filtering, we identified a compact set of 16 protein-coding genes that exhibit robust, directionally consistent, and MeCP2-correlated expression changes. These genes effectively distinguish KD, OE, and WT states with 100% classification accuracy in our dataset, thus highlighting their potential as dosage-sensitive transcriptional signatures. Future in vivo validation will be necessary to confirm their robustness and generalizability. Functional enrichment analysis revealed that genes downregulated in KD, modeling MeCP2 loss of function and RTT, were significantly enriched in biological processes related to synaptic connectivity, neuronal development, and retrograde trans-synaptic signaling. Among these, Plcb1, Gpr161, Mknk2, Rgcc, Ptpn3, Cav1, and Abhd6 emerged as key RTT-associated candidates. These genes are linked to disrupted calcium signaling, cell cycle regulation, and impaired synaptic plasticity, features consistent with RTT pathophysiology. In contrast, OE-specific genes, associated with MeCP2 gain of function and ASD, were enriched in pathways related to neuroinflammation, extracellular matrix remodeling, and metabolic stress. Notable ASD-related candidates include Aim2, Mcm6, Pcdhb9, Slfn9, Sugct, and Cbs, which implicate inflammasome activation, mitochondrial dysfunction, and structural signaling abnormalities, hallmarks of MECP2 duplication syndrome and broader ASD pathology. Together, these findings demonstrate that MeCP2 loss and gain produce non-redundant transcriptional outcomes that reflect distinct disease etiologies. The identified gene set provides mechanistic insight into the differential molecular consequences of MeCP2 dosage perturbation and nominates candidates for future functional studies. This work represents a computational analysis of secondary transcriptomic data, designed to prioritize candidate genes for experimental follow-up and translational exploration. While these results are encouraging, they should be viewed as preliminary until validated in vivo, and their translational potential for diagnostic marker development or therapeutic targeting in RTT, ASD, and related MeCP2-pathies will require further confirmation. Limitations of Study and Future Work Although this study presents a robust transcriptome-centered framework for identifying MeCP2 dosage-sensitive genes, two limitations should be acknowledged. First, the analysis was based entirely on a single in vitro RNA-seq dataset derived from cultured mouse cortical neurons, which may not fully capture the complexity and cellular diversity of the in vivo brain environment. This constraint could limit the generalizability of the findings to broader neurodevelopmental contexts. We recognize that experimental validation, particularly in in vivo models or additional in vitro systems, would significantly strengthen the biological interpretation of our findings. However, the present study is designed as a hypothesis-generating investigation based on transcriptomic data and not as a validation study. Future research will aim to pursue these validations through targeted follow-up experiments. Second, to the best of our knowledge, there are no other publicly available datasets that provide MeCP2 knockdown and overexpression transcriptomes under matched experimental conditions, thus preventing direct validation of the identified gene signatures in independent systems. Future work should aim to replicate these findings using in vivo models and include diverse brain regions and developmental stages, which would better capture the full spectrum of MeCP2 function. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, M.R., J.B., C.R. and M.N.G.; software, M.R.; validation, M.R., J.B., C.R. and M.N.G.; formal analysis, M.R., J.B., C.R. and M.N.G.; investigation, M.R., J.B., C.R. and M.N.G.; resources, M.N.G.; data curation, M.R.; writing—original draft preparation, M.R., J.B., C.R. and M.N.G.; writing—review and editing: M.R., J.B., C.R. and M.N.G.; supervision, M.R., J.B. and M.N.G.; funding acquisition, M.N.G. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement The RNA-seq dataset analyzed in this study was originally published by Nettles et al. [ 4 GSE246463 Conflicts of Interest The authors declare no conflicts of interest. References 1. Yasui D.H. Xu H. Dunaway K.W. LaSalle J.M. Jin L.-W. Maezawa I. MeCP2 modulates gene expression pathways in astrocytes Mol. Autism 2013 4 3 10.1186/2040-2392-4-3 23351786 PMC3561260 2. Lombardi L.M. Baker S.A. Zoghbi H.Y. MECP2 disorders: From the clinic to mice and back J. Clin. Investig. 2015 125 2914 2923 10.1172/JCI78167 26237041 PMC4563741 3. Kinde B. Wu D.Y. Greenberg M.E. Gabel H.W. DNA methylation in the gene body influences MeCP2-mediated gene repression Proc. Natl. Acad. Sci. USA 2016 113 15114 15119 10.1073/pnas.1618737114 27965390 PMC5206576 4. Nettles S.A. Ikeuchi Y. Lefton K.B. Abbasi L. Erickson A. Agwu C. Papouin T. Bonni A. Gabel H.W. MeCP2 represses the activity of topoisomerase IIβ in long neuronal genes Cell Rep. 2023 42 113538 10.1016/j.celrep.2023.113538 38096051 PMC10844882 5. Papapietro O. Nejentsev S. Topoisomerase 2β and DNA topology during B cell development Front. Immunol. 2022 13 982870 10.3389/fimmu.2022.982870 36045673 PMC9423374 6. Nur-E-Kamal A. Meiners S. Ahmed I. Azarova A. Lin C.-P. Lyu Y.L. Liu L.F. Role of DNA topoisomerase IIβ in neurite outgrowth Brain Res. 2007 1154 50 60 10.1016/j.brainres.2007.04.029 17493591 7. Khazeem M.M. Casement J.W. Schlossmacher G. Kenneth N.S. Sumbung N.K. Chan J.Y.T. McGow J.F. Cowell I.G. Austin C.A. TOP2B Is Required to Maintain the Adrenergic Neural Phenotype and for ATRA-Induced Differentiation of SH-SY5Y Neuroblastoma Cells Mol. Neurobiol. 2022 59 5987 6008 10.1007/s12035-022-02949-6 35831557 PMC9463316 8. Horvath P.M. Monteggia L.M. MeCP2 as an Activator of Gene Expression Trends Neurosci. 2018 41 72 74 10.1016/j.tins.2017.11.005 29405930 PMC5909705 9. Chahrour M. Jung S.Y. Shaw C. Zhou X. Wong S.T.C. Qin J. Zoghbi H.Y. MeCP2, a Key Contributor to Neurological Disease, Activates and Represses Transcription Science 2008 320 1224 1229 10.1126/science.1153252 18511691 PMC2443785 10. Clemens A.W. Wu D.Y. Moore J.R. Christian D.L. Zhao G. Gabel H.W. MeCP2 Represses Enhancers through Chromosome Topology-Associated DNA Methylation Mol. Cell 2020 77 279 293.e8 10.1016/j.molcel.2019.10.033 31784360 PMC6980697 11. Riedmann C. Fondufe-Mittendorf Y.N. Comparative analysis of linker histone H1, MeCP2, and HMGD1 on nucleosome stability and target site accessibility Sci. Rep. 2016 6 33186 10.1038/srep33186 27624769 PMC5021983 12. Gulmez Karaca K. Brito D.V.C. Oliveira A.M.M. MeCP2: A Critical Regulator of Chromatin in Neurodevelopment and Adult Brain Function Int. J. Mol. Sci. 2019 20 4577 10.3390/ijms20184577 31527487 PMC6769791 13. Ramocki M.B. Tavyev Y.J. Peters S.U. The MECP2 duplication syndrome Am. J. Med. Genet. A 2010 152A 1079 1088 10.1002/ajmg.a.33184 20425814 PMC2861792 14. Ramocki M.B. Peters S.U. Tavyev Y.J. Zhang F. Carvalho C.M. Schaaf C.P. Richman R. Fang P. Glaze D.G. Lupski J.R. Autism and other neuropsychiatric symptoms are prevalent in individuals with MeCP2 duplication syndrome Ann. Neurol. 2009 66 771 782 10.1002/ana.21715 20035514 PMC2801873 15. Guy J. Hendrich B. Holmes M. Martin J.E. Bird A. A mouse Mecp2-null mutation causes neurological symptoms that mimic Rett syndrome Nat. Genet. 2001 27 322 326 10.1038/85899 11242117 16. Zhou Z. Hong E.J. Cohen S. Zhao W.-N. Ho H.-Y.H. Schmidt L. Chen W.G. Lin Y. Savner E. Griffith E.C. Brain-Specific Phosphorylation of MeCP2 Regulates Activity-Dependent Bdnf Transcription, Dendritic Growth, and Spine Maturation Neuron 2006 52 255 269 10.1016/j.neuron.2006.09.037 17046689 PMC3962021 17. Peters S.U. Hundley R.J. Wilson A.K. Warren Z. Vehorn A. Carvalho C.M. Lupski J.R. Ramocki M.B. The Behavioral Phenotype in MECP2 Autism Res. 2012 6 42 50 10.1002/aur.1262 23169761 PMC3578988 18. Rezapour M. Walker S.J. Ornelles D.A. McNutt P.M. Atala A. Gurcan M.N. Analysis of gene expression dynamics and differential expression in viral infections using generalized linear models and quasi-likelihood methods Front. Microbiol. 2024 15 1342328 10.3389/fmicb.2024.1342328 38655085 PMC11037428 19. Rezapour M. Walker S.J. Ornelles D.A. Niazi M.K.K. McNutt P.M. Atala A. Gurcan M.N. A comparative analysis of RNA-Seq and NanoString technologies in deciphering viral infection response in upper airway lung organoids Front. Genet. 2024 15 1327984 10.3389/fgene.2024.1327984 38957806 PMC11217172 20. Rezapour M. Wesolowski R. Gurcan M.N. Identifying Key Genes Involved in Axillary Lymph Node Metastasis in Breast Cancer Using Advanced RNA-Seq Analysis: A Methodological Approach with GLMQL and MAS Int. J. Mol. Sci. 2024 25 7306 10.3390/ijms25137306 39000413 PMC11242629 21. Rezapour M. Narayanan A. Gurcan M.N. Machine Learning Analysis of RNA-Seq Data Identifies Key Gene Signatures and Pathways in Mpox Virus-Induced Gastrointestinal Complications Using Colon Organoid Models Int. J. Mol. Sci. 2024 25 11142 10.3390/ijms252011142 39456924 PMC11508207 22. Rezapour M. Murphy S.V. Ornelles D.A. McNutt P.M. Atala A. Tracing the evolutionary pathway of SARS-CoV-2 through RNA sequencing analysis Sci. Rep. 2025 15 23961 10.1038/s41598-025-09911-1 40615624 PMC12227573 23. Ashburner M. Ball C.A. Blake J.A. Botstein D. Butler H. Cherry J.M. Davis A.P. Dolinski K. Dwight S.S. Eppig J.T. Gene ontology: Tool for the unification of biology. The Gene Ontology Consortium Nat. Genet. 2000 25 25 29 10.1038/75556 10802651 PMC3037419 24. Benjamini Y. Heller R. Yekutieli D. Selective inference in complex research Philos. Trans. R. Soc. A Math. Phys. Eng. Sci. 2009 367 4255 4271 10.1098/rsta.2009.0127 PMC3263782 19805444 25. Benjamini Y. Hochberg Y. Controlling the False Discovery Rate: A Practical and Powerful Approach to Multiple Testing J. R. Stat. Soc. Ser. B Methodol. 1995 57 289 300 10.1111/j.2517-6161.1995.tb02031.x 26. de Winter J.C.F. Gosling S.D. Potter J. Comparing the Pearson and Spearman correlation coefficients across distributions and sample sizes: A tutorial using simulations and empirical data Psychol. Methods 2016 21 273 290 10.1037/met0000079 27213982 27. Abdi H. Williams L.J. Principal component analysis WIREs Comp. Stat. 2010 2 433 459 10.1002/wics.101 28. Kleinbaum D.G. Klein M. Pryor E.R. Logistic Regression Logistic Regression: A Self-Learning Text 3rd ed. Gail M. Krickeberg K. Samet J.M. Tsiatis A. Wong W. Statistics for Biology and Health; Springer New York, NY, USA 2010 29. Christodoulou E. Ma J. Collins G.S. Steyerberg E.W. Verbakel J.Y. Van Calster B. A systematic review shows no performance benefit of machine learning over logistic regression for clinical prediction models J. Clin. Epidemiol. 2019 110 12 22 10.1016/j.jclinepi.2019.02.004 30763612 30. Raudvere U. Kolberg L. Kuzmin I. Arak T. Adler P. Peterson H. Vilo J. g:Profiler: A web server for functional enrichment analysis and conversions of gene lists (2019 update) Nucleic Acids Res. 2019 47 W191 W198 10.1093/nar/gkz369 31066453 PMC6602461 31. Filosa S. Pecorelli A. D’ESposito M. Valacchi G. Hajek J. Exploring the possible link between MeCP2 and oxidative stress in Rett syndrome Free Radic. Biol. Med. 2015 88 81 90 10.1016/j.freeradbiomed.2015.04.019 25960047 32. Splawski I. Timothy K.W. Sharpe L.M. Decher N. Kumar P. Bloise R. Napolitano C. Schwartz P.J. Joseph R.M. Condouris K. CaV1.2 Calcium Channel Dysfunction Causes a Multisystem Disorder Including Arrhythmia and Autism Cell 2004 119 19 31 10.1016/j.cell.2004.09.011 15454078 33. Pinggera A. Lieb A. Benedetti B. Lampert M. Monteleone S. Liedl K.R. Tuluc P. Striessnig J. CACNA1D De Novo Mutations in Autism Spectrum Disorders Activate Cav1.3 L-Type Calcium Channels Biol. Psychiatry 2015 77 816 822 10.1016/j.biopsych.2014.11.020 25620733 PMC4401440 34. Rose S. Melnyk S. Pavliv O. Bai S. Nick T.G. Frye R.E. James S.J. Evidence of oxidative damage and inflammation associated with low glutathione redox status in the autism brain Transl. Psychiatry 2012 2 e134 10.1038/tp.2012.61 22781167 PMC3410618 35. Kaur I. Behl T. Aleya L. Rahman H. Kumar A. Arora S. Akter R. Role of metallic pollutants in neurodegeneration: Effects of aluminum, lead, mercury, and arsenic in mediating brain impairment events and autism spectrum disorder Environ. Sci. Pollut. Res. 2021 e28 8989 9001 10.1007/s11356-020-12255-0 33447979 36. Heldin C.-H. Westermark B. Mechanism of Action and In Vivo Role of Platelet-Derived Growth Factor Physiol. Rev. 1999 79 1283 1316 10.1152/physrev.1999.79.4.1283 10508235 37. Andrae J. Gallini R. Betsholtz C. Role of platelet-derived growth factors in physiology and medicine Genes Dev. 2008 22 1276 1312 10.1101/gad.1653708 18483217 PMC2732412 38. Sil S. Periyasamy P. Thangaraj A. Chivero E.T. Buch S. PDGF/PDGFR axis in the neural systems Mol. Asp. Med. 2018 62 63 74 10.1016/j.mam.2018.01.006 PMC6003857 29409855 39. Coutelier M. Jacoupy M. Janer A. Renaud F. Auger N. Saripella G.-V. Ancien F. Pucci F. Rooman M. Gilis D. NPTX1 Brain 2021 145 1519 1534 10.1093/brain/awab407 34788392 40. O’bRien R.J. Xu D. Petralia R.S. Steward O. Huganir R.L. Worley P. Synaptic Clustering of AMPA Receptors by the Extracellular Immediate-Early Gene Product Narp Neuron 1999 23 309 323 10.1016/S0896-6273(00)80782-5 10399937 41. Kovács R.Á. Vadászi H. Bulyáki É. Török G. Tóth V. Mátyás D. Kun J. Hunyadi-Gulyás É. Fedor F.Z. Csincsi Á. Identification of Neuronal Pentraxins as Synaptic Binding Partners of C1q and the Involvement of NP1 in Synaptic Pruning in Adult Mice Front. Immunol. 2021 11 599771 10.3389/fimmu.2020.599771 33628204 PMC7897678 42. Jia Y. Zhang X. Cai Y. Yu H. Cao G. Dai E. Kang R. Tang D. Hu N. Han L. OSGIN1 promotes ferroptosis resistance by directly enhancing GCLM activity Biochem. Biophys. Res. Commun. 2024 740 151015 10.1016/j.bbrc.2024.151015 39571229 43. Yamashita N. Uchiyama M. Yamagata R. Hwang G.-W. Methylmercury Induces Apoptosis in Mouse C17.2 Neural Stem Cells through the Induction of OSGIN1 Expression by NRF2 Int. J. Mol. Sci. 2024 25 3886 10.3390/ijms25073886 38612696 PMC11011283 44. De Felice C. Signorini C. Leoncini S. Pecorelli A. Durand T. Valacchi G. Ciccoli L. Hayek J. The role of oxidative stress in Rett syndrome: An overview Ann. N. Y. Acad. Sci. 2012 1259 121 135 10.1111/j.1749-6632.2012.06611.x 22758644 45. Vogelgesang S. Niebert S. Renner U. Möbius W. Hülsmann S. Manzke T. Niebert M. Analysis of the Serotonergic System in a Mouse Model of Rett Syndrome Reveals Unusual Upregulation of Serotonin Receptor 5b Front. Mol. Neurosci. 2017 10 61 10.3389/fnmol.2017.00061 28337123 PMC5340760 46. Mogilevsky M. Shimshon O. Kumar S. Mogilevsky A. Keshet E. Yavin E. Heyd F. Karni R. Modulation of MKNK2 Nucleic Acids Res. 2018 46 11396 11404 10.1093/nar/gky921 30329087 PMC6265459 47. Maimon A. Mogilevsky M. Shilo A. Golan-Gerstl R. Obiedat A. Ben-Hur V. Lebenthal-Loinger I. Stein I. Reich R. Beenstock J. Mnk2 Alternative Splicing Modulates the p38-MAPK Pathway and Impacts Ras-Induced Transformation Cell Rep. 2014 7 501 513 10.1016/j.celrep.2014.03.041 24726367 48. Scheper M. Sørensen F.N.F. Ruffolo G. Gaeta A. Lissner L.J. Anink J.J. Korshunova I. Jansen F.E. Riney K. van Hecke W. Impaired GABAergic regulation and developmental immaturity in interneurons derived from the medial ganglionic eminence in the tuberous sclerosis complex Acta Neuropathol. 2024 147 80 10.1007/s00401-024-02737-7 38714540 PMC11076412 49. Amorim I.S. Lach G. Gkogkas C.G. The Role of the Eukaryotic Translation Initiation Factor 4E (eIF4E) in Neuropsychiatric Disorders Front. Genet. 2018 9 561 10.3389/fgene.2018.00561 30532767 PMC6265315 50. Counts S.E. Mufson E.J. Regulator of Cell Cycle (RGCC) Expression during the Progression of Alzheimer’s Disease Cell Transplant. 2017 26 693 702 10.3727/096368916X694184 27938491 PMC5661221 51. Xu R. Shang C. Zhao J. Han Y. Liu J. Chen K. Shi W. Knockdown of response gene to complement 32 (RGC32) induces apoptosis and inhibits cell growth, migration, and invasion in human lung cancer cells Mol. Cell. Biochem. 2014 394 109 118 10.1007/s11010-014-2086-3 24833469 52. Hoppe N. Harrison S. Hwang S.-H. Chen Z. Karelina M. Deshpande I. Suomivuori C.-M. Palicharla V.R. Berry S.P. Tschaikner P. GPR161 structure uncovers the redundant role of sterol-regulated ciliary cAMP signaling in the Hedgehog pathway Nat. Struct. Mol. Biol. 2024 31 667 677 10.1038/s41594-024-01223-8 38326651 PMC11221913 53. Patel S.S. Tomar S. Sharma D. Mahindroo N. Udayabanu M. Targeting sonic hedgehog signaling in neurological disorders Neurosci. Biobehav. Rev. 2017 74 76 97 10.1016/j.neubiorev.2017.01.008 28088536 54. Gulino A. Di Marcotullio L. Ferretti E. De Smaele E. Screpanti I. Hedgehog signaling pathway in neural development and disease Psychoneuroendocrinology 2007 32 S52 S56 10.1016/j.psyneuen.2007.03.017 17619088 55. Lyon A.M. Tesmer J.J. Structural Insights into Phospholipase C-β Function Mol. Pharmacol. 2013 84 488 500 10.1124/mol.113.087403 23880553 PMC3781385 56. She W. Quairiaux C. Albright M.J. Wang Y. Sanchez D.E. Chang P. Welker E. Lu H. Roles of mGluR5 in synaptic function and plasticity of the mouse thalamocortical pathway Eur. J. Neurosci. 2009 29 1379 1396 10.1111/j.1460-9568.2009.06696.x 19519626 PMC2714552 57. Calfa G. Li W. Rutherford J.M. Pozzo-Miller L. Excitation/inhibition imbalance and impaired synaptic inhibition in hippocampal area CA3 of Mecp2 Hippocampus 2014 25 159 168 10.1002/hipo.22360 25209930 PMC4300269 58. Saresella M. Piancone F. Marventano I. Zoppis M. Hernis A. Zanette M. Trabattoni D. Chiappedi M. Ghezzo A. Canevini M.P. Multiple inflammasome complexes are activated in autistic spectrum disorders Brain Behav. Immun. 2016 57 125 133 10.1016/j.bbi.2016.03.009 26979869 59. Mo W. Liu J. Zhang Z. Yu H. Yang A. Qu F. Hu P. Liu Z. Hu F. A study of single nucleotide polymorphisms in CD157, AIM2 and JARID2 genes in Han Chinese children with autism spectrum disorder Nord. J. Psychiatry 2017 72 179 183 10.1080/08039488.2017.1410570 29216786 60. Smits D.J. Schot R. Popescu C.A. Dias K.-R. Ades L. Briere L.C. Sweetser D.A. Kushima I. Aleksic B. Khan S. De novo MCM6 variants in neurodevelopmental disorders: A recognizable phenotype related to zinc binding residues Hum. Genet. 2023 142 949 964 10.1007/s00439-023-02569-7 37198333 PMC10329600 61. Simons Foundation Autism Research Initiative MCM6 Gene—SFARI Gene 2023 Available online: https://gene.sfari.org/database/human-gene/MCM6 (accessed on 2 July 2025) 62. Castillo P.E. Younts T.J. Chávez A.E. Hashimotodani Y. Endocannabinoid Signaling and Synaptic Function Neuron 2012 76 70 81 10.1016/j.neuron.2012.09.020 23040807 PMC3517813 63. Mohammed M.E.S. Jehan H.S. Eman G.B. Sara A.E. Maha S.Z. Nora N.E. Association of Cystathionine Beta Synthase Gene Polymorphism With Cognitive Disorders in Autistic Children J. Innov. Pharm. Biol. Sci. 2017 4 20 24 64. Rossignol D.A. Frye R.E. Mitochondrial dysfunction in autism spectrum disorders: A systematic review and meta-analysis Mol. Psychiatry 2012 17 290 314 10.1038/mp.2010.136 21263444 PMC3285768 65. Nelder J.A. Wedderburn R.W.M. Generalized Linear Models J. R. Stat. Soc. Ser. A 1972 135 370 384 10.2307/2344614 66. Wedderburn R.W.M. Quasi-Likelihood Functions, Generalized Linear Models, and the Gauss-Newton Method Biometrika 1974 61 439 10.2307/2334725 67. Rezapour M. Walker S.J. Ornelles D.A. Niazi M.K.K. McNutt P.M. Atala A. Gurcan M.N. Choi Y.H. Exploring the host response in infected lung organoids using NanoString technology: A statistical analysis of gene expression data PLoS ONE 2024 19 e0308849 10.1371/journal.pone.0308849 39591472 PMC11594423 68. Rezapour M. Niazi M.K.K. Lu H. Narayanan A. Gurcan M.N. Machine learning-based analysis of Ebola virus’ impact on gene expression in nonhuman primates Front. Artif. Intell. 2024 7 1405332 10.3389/frai.2024.1405332 39282474 PMC11392916 69. Law C.W. Chen Y. Shi W. Smyth G.K. Voom: Precision weights unlock linear model analysis tools for RNA-seq read counts Genome Biol. 2014 15 R29 10.1186/gb-2014-15-2-r29 24485249 PMC4053721 70. Robinson M.D. Oshlack A. A scaling normalization method for differential expression analysis of RNA-seq data Genome Biol. 2010 11 R25 10.1186/gb-2010-11-3-r25 20196867 PMC2864565 Figure 1 Transcriptomic changes in neurons following MeCP2 knockdown (KD) and overexpression (OE) relative to wild type (WT). ( a b c d p Figure 2 GO enrichment analysis of significant genes from MeCP2 KD and OE conditions. Each dot represents a GO term enriched among the top 20 most significant terms per condition, sized by intersection size (number of associated genes) and colored by −log10( p Figure 3 Identification of unique and shared differentially expressed genes (DEGs) in MeCP2 KD and OE conditions using Cross-MAS. ( a p b p Figure 4 Prioritization of dosage-sensitive MeCP2-associated genes based on correlation and expression directionality. ( a Figure 3 b a p c d c Figure 5 Discriminative power of Cross-MAS-selected genes for classifying MeCP2 dosage states. ( a b Figure 4 c d Figure 6 Functional enrichment of dosage-sensitive MeCP2-associated genes. Bar plot showing the top enriched BP terms identified using g:Profiler based on the 16 genes selected through GLMQL-MAS, Cross-MAS, correlation analysis, and logFC agreement. ( a b ",
  "metadata": {
    "Title of this paper": "A scaling normalization method for differential expression analysis of RNA-seq data",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469642/"
  }
}