{
  "title": "Paper_1224",
  "abstract": "pmc Cancers (Basel) Cancers (Basel) 2105 cancers cancers Cancers 2072-6694 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468702 PMC12468702.1 12468702 12468702 41008846 10.3390/cancers17183002 cancers-17-03002 1 Article Derivation of Genetically Defined Murine Hepatoblastoma Cell Lines with Angiogenic Potential Chen Keyao Methodology Validation Formal analysis Investigation Data curation Writing – review & editing Visualization 1 2 https://orcid.org/0009-0005-1479-6489 Toksoz Ahmet Validation Investigation 1 3 Henchy Colin Methodology Investigation 1 4 Knapp Jessica Methodology Investigation 1 4 Lu Jie Investigation 1 https://orcid.org/0000-0001-6214-9167 Ranganathan Sarangarajan Formal analysis Investigation 5 https://orcid.org/0000-0003-2551-3243 Wang Huabo Conceptualization Methodology Validation Formal analysis Investigation Data curation Writing – review & editing Visualization Supervision 1 * † https://orcid.org/0000-0001-9666-8205 Prochownik Edward V. Conceptualization Methodology Validation Formal analysis Resources Writing – original draft Writing – review & editing Supervision Project administration Funding acquisition 1 6 7 8 * † Kappler Roland Academic Editor 1 keyaoc24@outlook.com toksozac@pitt.edu cmh259@pitt.edu jhk51@pitt.edu jie.lu@chp.edu 2 3 4 5 sarangarajan.ranganathan@cchmc.org 6 7 8 * huw14@pitt.edu prochownikev@upmc.edu † These authors contributed equally to this work. 14 9 2025 9 2025 17 18 497140 3002 24 7 2025 29 8 2025 10 9 2025 14 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Simple Summary Hepatoblastoma (HB), the most common childhood liver cancer, often shows aberrant expression and/or mutations of the β-catenin (B), YAP (Y) and/or NRF2 (N) transcription factors and can be modeled in mouse livers by overexpressing combinations of these (e.g., BY, BN, YN and BYN). Because very few human or murine HB cell lines exist, genetically defined murine HB cell lines would be a significant advance. We describe here the generation of cell lines from primary BN and YN tumors. Unexpectedly, one BN line shows a remarkable ability to trans-differentiate into endothelial cells and can accelerate in vivo tumorigenesis and angiogenesis. These and previously derived BY and BYN lines have similar sensitivities to four drugs used to treat HB. Our generic approach for cell line derivation should allow for the generation of additional lines driven by less common drivers. A collection of such genetically defined and well-characterized cell lines will facilitate studies that are impractical to perform in vivo. Abstract Background/Objectives Cdkn2a Methods Cdkn2a Results: Conclusions β-catenin hepatocellular carcinoma Hippo NRF2 p16 INK4A p19 ARF Wnt YAP Rally Foundation 22IN42 Alex’s Lemonade Stand Foundation 1419786 University of Pittsburgh Center for Research Computing NIH S10OD028483 Funding for this research was in part provided by the UPMC Children’s Hospital of Pittsburgh Research Advisory Committee, the UPMC Children’s Hospital of Pittsburgh Foundation, an Independent Investigator Award from the Rally Foundation (no. 22IN42), and an Innovation Grant from Alex’s Lemonade Stand Foundation (no. 1419786). This research was also supported in part by the University of Pittsburgh Center for Research Computing through the resources provided. Specifically, this work used the HTC cluster, which is supported by NIH award number S10OD028483. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Hepatoblastoma (HB), the most common pediatric liver cancer, arises almost exclusively in children less than 4 years of age and is classified into several distinct histopathologic subtypes [ 1 2 3 4 CTNNB1 NRF2 5 6 7 8 9 10 11 12 9 10 11 9 13 14 15 16 17 18 9 13 14 15 CDKN2A INK4A ARF ARF 19 20 21 22 23 24 25 26 Mouse models of HB have demonstrated that patient-derived and nuclear-localized mutations of β-catenin, such as the 90 amino acid in-frame deletion Δ90 (hereafter B) and the NRF2 missense mutation L30P (N), as well as a nuclear-localized S127A missense mutation of YAP (Y), can induce HBs when expressed in the liver in any pair-wise combination (BY, NY and BN) and that the triple combination (BYN) generates particularly aggressive tumors [ 10 12 15 27 10 12 15 27 11 11 26 Few established human HB cell lines currently exist, and even fewer are readily available; moreover, some, such as HepG2, originate from atypical patients and/or possess unusual molecular features that are not representative of the vast majority of human tumors [ 28 29 MYC MYC 30 31 32 Myc 10 27 26 Having failed to generate immortalized cell lines from any of the above B-, Y- and/or N-driven HB types in over 30 prior attempts, we recently succeeded in efficiently deriving eight BY and three BYN murine HB cell lines [ 26 Cdkn2a 26 INK4A ARF 26 33 26 26 We now describe the derivation and characterization of five additional immortalized HB cell lines originating from the more slowly growing BN and YN primary tumor types [ 26 Cdkn2a 19 20 21 22 23 24 25 26 c 2. Materials and Methods 2.1. Animal Care and Husbandry FVB/N and nu/nu mice (Jackson Labs, Inc., Bar Harbor, ME, USA) were housed in micro-isolator cages in a pathogen-free facility at UPMC Children’s Hospital of Pittsburgh and provided ad libitum with standard animal chow and water. All care, diets and procedures were performed in accordance with the Public Health Service Policy on Humane Care and Use of Laboratory Animal Research Guide for Care and Use of Laboratory Animals. All experimental details have been previously described and were approved by the University of Pittsburgh’s Institutional Animal Care and Use Committee (IACUC) [ 26 2.2. Plasmids, Plasmid DNA Purification, Hydrodynamic Tail Vein Injections (HDTVIs) and Transfections Sleeping Beauty (SB) vectors encoding a patient-derived 90 amino acid in-frame deletion (Δ90) of β-catenin (B), a patient-derived missense mutation (L30P) of NRF2 (N) and a missense mutation (S127A) of the Hippo pathway terminal TF YAP (Y) have been previously described and their pair-wise and triple oncogenic potentials have been demonstrated [ 11 12 15 27 27 26 INK4A ARF 27 To readily monitor the acquisition of endothelial cell (EC)-like properties, some cell lines were transfected in vitro with 2 μg of a previously described vector encoding EGFP under the control of the EC-specific Tie2/Tek promoter (Tie2-EGFP) [ 34 2.3. Establishment of Immortalized BN and YN Cell Lines Immortalized cell lines were derived as described previously for BY and BYN cell lines [ 26 Cdkn2a Cell line transfections were performed with purified plasmid DNAs using Lipofectamine-3000 according to the directions of the vendor (Thermo Fisher, Inc., Pittsburgh, PA, USA). Control cell lines were established with the appropriate “empty” vectors. 2.4. Growth Curves 2000 viable tumor cells were seeded into individual wells of 12-well plates and maintained under standard growth conditions as previously described [ 26 2.5. Tumorigenicity of Immortalized YN and BN Cell Lines YN or BN cell monolayers were trypsinized, washed twice in PBS and re-suspended in PBS at a concentration of 5 × 10 6 2.6. Tumor Histology and Confocal Microscopy Subcutaneous and lung tumors were excised, immediately fixed in PBS-4% paraformaldehyde and then processed for H&E staining at the UPMC Children’s Hospital of Pittsburgh Core Histology Facility using standard procedures [ 12 26 2.7. Tumor Cell Responses to Hypoxia The effects of hypoxia on tumor cells were tested in 2 different ways. First, logarithmically growing tumor cells were trypsinized, re-suspended at a concentration of ~10 6 2 2 26 34 2 2 2.8. Isolation of EGFP+ Cells Monolayer cultures of BN cell lines stably transfected with Tie2-EGFP in early log-phase growth were exposed to 1% oxygen for 48 h as described above. Cells expressing the highest levels of EGFP were then isolated by fluorescence-activated cell sorting using a Becton-Dickinson FACSAria III instrument (Franklin Lakes, NJ, USA) and then further expanded under normoxic conditions. 2.9. SDS-PAGE and Immunoblotting Livers, tumors and cells were washed in PBS, snap-frozen in liquid nitrogen and stored at −80 °C until being further processed and analyzed as described previously [ 26 12 26 27 26 27 INK4A Ab211542 ARF 2.10. Cdkn2a Exon 2 Amplicon Sequencing Briefly, DNA was extracted from cell lines harboring Cdkn2a Cdkn2a 26 Cdkn2a 2.11. RNAseq and Bioinformatics Studies Total RNAs were isolated as previously described using RNeasy columns (Qiagen, Inc., Germantown, MD, USA). Only samples with RIN values >8.0 were processed further. Library preparation and sequencing were performed at the Pittsburgh Liver Research Center’s Core Sequencing laboratory ( https://livercenter.pitt.edu/gsbc/#Sequencing 26 p 2.12. Drug Sensitivity Studies Monolayer cultures were trypsinized and 3 × 10 3 35 36 37 2.13. Statistical Analyses R software v4.4.0 (R Foundation for Statistical Computing, Vienna, Austria) and GraphPad Prism v9.00 (Dotmatics, Inc., Boston, MA, USA) were used for statistical analyses. The ComplexHeatmap package was utilized for heatmap visualizations. The number of samples per group (n) for each experiment is indicated either in the figure legend or within the figure itself. Two-tailed, unpaired t 3. Results 3.1. Efficient Generation of BN and YN Cell Lines To derive immortalized cell lines from primary BN and YN HBs, we relied upon a previously used strategy that permitted the generation of 11 BY and BYN cell lines with 100% efficiency [ 26 12 26 Cdkn2a 26 Cdkn2a INK4A ARF ARF 24 25 26 38 26 33 Cdkn2a Figure 1 11 Cdkn2a Figure 1 11 Figure 1 As reported for BY and BYN tumors harboring Cdkn2a 26 Figure 1 26 INK4A ARF, Figure 1 3.2. BN and YN Cell Lines Express Recurrent Truncated and/or Fused p16 INK4A ARF Our previous deep sequencing of BY and BYN HBs revealed a large number of unique p16 INK4A ARF Cdkn2a 26 INK4A ARF Figure 2 Supplementary File S1 INK4A ARF INK4A ARF ARF INK4A Figure 2 More so than in BY and BYN cell lines, the Cdkn2a-derived Figure 2 26 Cdkn2a 26 To examine the latter possibility, we relied upon six previously described p16 INK4A ARF Figure 2 26 INK4A ARF Figure 2 Figure 2 26 INK4A Figure 2 26 33 INK4A INK4A Figure 2 The mutants BY2-2β and BY3-1β, as well as BY1-1β and BY2-1β, encoded proteins of similar sizes that could not be resolved. To identify which, if any, of these were selectively lost or retained in BN1 cells, we performed individual transfections with the empty pSBbi vector and one encoding each of the above four fusion proteins and selected these in puromycin for 21 days before repeating anti-V5 immunoblots. These results showed that BY3-1β and BY1-1β were selectively retained, whereas BY2-1β and BY2-2β were lost ( Figure 2 Figure 2 INK4A ARF 3.3. Most YN and BN Cell Lines Retain Tumorigenic Potential To determine whether BN and YN cell lines retain their oncogenic behaviors following in vitro establishment, we injected them subcutaneously (subQ) into the same FVB strain of immunocompetent mice from which they originated. Similarly to what we observed for 10 of the original 11 BY and BYN tumor cells [ 26 Figure 1 11 Figure 3 Figure S1 Figure 3 Figure S2 3.4. BN and YN Cell Lines Form Spheroids and Acquire Endothelial Cell-like Properties in Response to Hypoxia BY and BYN cells were previously shown to form anchorage-independent tumor spheroids that, in response to internal hypoxia, variably upregulated the expression of an EGFP reporter under the control of the endothelial cell (EC)-specific Tie2/Tek promoter [ 26 34 34 39 40 41 42 26 To examine this in BN and YN cell lines, and to allow direct comparisons with our previous results, we first showed that all monolayer cell lines, regardless of their origin, responded similarly to staining with the hypoxia-detecting dye IT-Green after exposure to a 1% O 2 Figure 4 Figure 4 None of the above cell lines expressed Tie2-EGFP when maintained as monolayer cultures under normoxic conditions ( Figure 4 Figure 4 To determine how long monolayer cultures of BN1-Tie2-EGFP cells retained EGFP expression, EGFP+ cells were isolated by fluorescence-activated cell sorting (FACS) following a 2-day exposure to 1% oxygen, expanded under normoxic conditions and evaluated periodically by fluorescence microscopy and flow cytometry. EGFP expression was retained for an extended period of time, with ~40% of cells remaining positive after one month and ~20% remaining positive after ~2 months ( Figure 4 Figure 4 34 43 44 Figure 4 To determine whether any of the above-described Tie2-EGFP-transfected cell lines retained tumorigenic behaviors and could express EGFP in vivo, as we previously showed for BY1 cells [ 26 Figure 4 Figure 4 Figure 4 Figure 4 3.5. BN Tumors and Cell Lines Activate Unique Populations of EC-Specific Transcripts Tie2-EGFP activation and in vitro tube formation by BN1 cells in response to hypoxia ( Figure 4 Tie2/Tek Figure 5 Figure 5 Supplementary File S2 Supplementary File S3 45 46 Figure 5 47 48 To examine the acquisition of EC-like gene expression profiles by tumor cells under more controlled conditions, we exposed unsorted, normoxic monolayer cultures of BN1-Tie2-EGFP cells (“UN”) to hypoxia (1% O 2 Figure 6 Figure 6 Figure 6 Figure 4 Figure 6 Consistent with the idea that SN and SH cells originated from hepatocytes rather than an obscure population of ECs was the fact that they still expressed nearly 200 hepatocyte-specific genes, 10–15% of which were upregulated ( Figure 6 Figure 6 49 Figure 5 Figure 6 To determine whether the dysregulation of the above 1853 EC-specific genes occurred in other tumors, we first examined their expression in highly undifferentiated murine HCCs that were generated in a rapid and reversible manner by the doxycycline-mediated induction of a human MYC 30 32 Figure 5 MYC Figure 6 MYC MYC 30 32 MYC 47 48 We next examined the expression of the above EC-specific transcripts in various matched normal human tissues and tumors from The Cancer Genome Atlas. In the former samples, we determined that, as in the case of murine livers ( Figure 5 45 46 50 51 52 Figure 6 Figure 6 Figure 6 Figure 6 3.6. Y Suppresses EC Differentiation Speculating that BN cells more readily acquire EC-like properties because Y suppresses EC differentiation [ 53 54 Figure 4 Figure 7 Figure 7 high Figure 7 55 56 3.7. HB Cell Lines Have Similar Chemotherapeutic Drug Sensitivities Current drug-based treatments for HB tend to be quite similar, even though a number of studies suggest that certain molecular signatures predict chemotherapeutic responses and long-term survival [ 2 5 31 57 58 59 60 61 62 63 64 65 66 Figure 8 Cdkn2a 4. Discussion Histologic, biochemical and molecular differences among HBs have allowed for various classification systems that are intended to identify tumors with favorable or unfavorable survival [ 2 5 9 20 22 47 48 57 58 59 60 5 9 58 60 67 68 The relatively small number of oncogenic drivers associated with HB classifies it as the least complex of human cancers [ 3 4 31 69 70 CTNNB1 NRF2 CDKN2A 6 9 15 25 59 70 71 Cdkn2a 6 12 15 47 48 9 11 12 25 31 57 58 69 26 29 In the current work, we derived and characterized immortalized cell lines from primary BN and YN HBs [ 11 INK4A ARF 24 26 INK4A ARF Figure 2 26 INK4A ARF Cdkn2a Figure 2 Supplementary File S1 Figure 2 In addition to their tendency to recur, the most common p16 INK4A ARF Figure 2 INK4A ARF 9 11 A major rate-limiting determinant of a tumor’s growth, and in some cases an indicator of its aggressiveness, is the degree to which it establishes an independent vasculature to supply oxygen and nutrients and dispose of waste products [ 72 73 34 40 41 42 74 75 76 77 78 Figure 4 Figure 4 79 80 Figure 5 Figure 5 11 81 82 83 Figure 5 47 48 69 It is of interest that in no cases did the EC-specific gene expression signatures of different tumor groups or their cell lines resemble one another; nor did they precisely reflect those of normal livers, in which LSECs comprise 15–20% of the organ’s mass ( Figure 5 Figure 6 45 46 Figure 1 Importantly, the EC-like transcriptional profiles of our murine HBs and cells were not only distinct from one another but did not recapitulate any known EC subtype ( Figure 5 Figure 6 46 50 51 52 26 Figure 1 Figure 4 Differences in EC-specific gene expression were also noted between multiple human cancer types and the normal tissues from which they originated ( Figure 6 Figure 6 84 85 Figure 7 86 87 A potential explanation for why BN cells were particularly predisposed to EC-like trans-differentiation was suggested by the fact that they are the only ones that do not express Y. Indeed, the enforced overexpression of Y in BN cells markedly inhibited Tie2-driven EGFP expression and downregulated the expression of endogenous YAP ( Figure 7 78 88 13 53 54 55 56 74 78 82 88 Figure 5 12 13 27 47 48 69 89 34 39 41 42 77 90 91 A surprising finding from our studies was that BN1 cells exposed to hypoxia did not appear to retain their EC-like properties during in vivo tumorigenesis despite contributing extensively to growth and neo-vascularization ( Figure 4 Figure 4 Figure 4 Although HB tends to respond well to chemotherapy and is associated with an overall long-term-survival/cure rate exceeding 70%, some tumors show poor responses to standard drug regimens or recur, in which case they are almost universally chemo-refractory [ 5 9 31 57 58 60 70 7 57 59 60 69 70 65 66 92 93 94 10 12 27 Figure 8 5 57 58 69 70 CDKN2A INK4A ARF 23 24 25 26 Finally, despite the advantages of the above cell lines and those we have previously described [ 26 95 INK4A ARF Figure 2 29 96 5. Conclusions The work presented here and elsewhere [ 26 6 29 Acknowledgments We thank Jianhua Luo and Silvia Liu of the Pittsburgh Liver Research Center’s Genomics and Systems Biology Core for their assistance with RNAseq. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/cancers17183002/s1 Figure 5 Figure 6 Figure 5 Figure 6 Figure 6 Author Contributions Conceptualization, E.V.P. and H.W.; methodology, K.C., C.H., J.K., H.W., and E.V.P.; validation, K.C., A.T., H.W., and E.V.P.; formal analysis, K.C., S.R., H.W., and E.V.P.; investigation, K.C., A.T., C.H., J.K., J.L., S.R., and H.W.; resources, E.V.P.; data curation, K.C., and H.W.; writing—original draft preparation, E.V.P.; writing—review and editing, E.V.P., K.C., and H.W.; visualization, K.C., and H.W.; supervision, H.W., and E.V.P.; project administration, E.V.P.; funding acquisition, E.V.P. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The animal study protocol was approved by the Institutional Review Board (or Ethics Committee) of The University of Pittsburgh (protocol code 23083650, approved 16 August 2023). Informed Consent Statement Not applicable. Data Availability Statement RNAseq data have been deposited in the NCBI Gene Expression Omnibus (GEO) under accession number GSE302803 and can be accessed at: https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE302803 https://www.cancer.gov/tcga Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: B A mutant of human β-catenin (Δ90) BN HBs induced by overexpression of B and N BY HBs induced by overexpression of B and Y BYN HBs induced by overexpression of B, Y and N EC Endothelial cell EGFP Enhanced green fluorescent protein GSEA Gene set enrichment analysis HB Hepatoblastoma HCC Hepatocellular carcinoma HDTVI Hydrodynamic tail vein injection LESC Liver sinusoidal endothelial cells N A mutant of NRF2 (N L30P NY HBs induced by overexpression of N and Y SB Sleeping Beauty plasmid vector TF Transcription factor TS Tumor suppressor WT Wild-type Y A mutant of YAP (Y S127A References 1. Cho S.J. Ranganathan S. Alaggio R. Maibach R. Tanaka Y. Inoue T. Leuschner I. de Krijger R. Vokuhl C. Krailo M. Consensus Classification of Pediatric Hepatocellular Tumors: A Report from the Children’s Hepatic Tumors International Collaboration (Chic) Pediatr. Blood Cancer 2023 70 e30505 10.1002/pbc.30505 37384428 2. Ranganathan S. Lopez-Terrada D. Alaggio R. Hepatoblastoma and Pediatric Hepatocellular Carcinoma: An Update Pediatr. Dev. Pathol. 2020 23 79 95 10.1177/1093526619875228 31554479 3. Grobner S.N. Worst B.C. Weischenfeldt J. Buchhalter I. Kleinheinz K. Rudneva V.A. Johann P.D. Balasubramanian G.P. Segura-Wang M. Brabetz S. The Landscape of Genomic Alterations across Childhood Cancers Nature 2018 555 321 327 10.1038/nature25480 29489754 4. Ma X. Liu Y. Liu Y. Alexandrov L.B. Edmonson M.N. Gawad C. Zhou X. Li Y. Rusch M.C. Easton J. Pan-Cancer Genome and Transcriptome Analyses of 1699 Paediatric Leukaemias and Solid Tumours Nature 2018 555 371 376 10.1038/nature25795 29489755 PMC5854542 5. Calvisi D.F. Solinas A. Hepatoblastoma: Current Knowledge and Promises from Preclinical Studies Transl. Gastroenterol. Hepatol. 2020 5 42 10.21037/tgh.2019.12.03 32632393 PMC7063515 6. Comerford S.A. Hinnant E.A. Chen Y. Bansal H. Klapproth S. Rakheja D. Finegold M.J. Lopez-Terrada D. O’Donnell K.A. Tomlinson G.E. Hepatoblastoma Modeling in Mice Places Nrf2 within a Cancer Field Established by Mutant Beta-Catenin JCI Insight 2016 1 e88549 10.1172/jci.insight.88549 27734029 PMC5053152 7. Johnston M.E. Timchenko N. Molecular Signatures of Aggressive Pediatric Liver Cancer Arch. Stem Cell Ther. 2021 2 1 34447970 PMC8386353 8. Sumazin P. Peters T.L. Sarabia S.F. Kim H.R. Urbicain M. Hollingsworth E.F. Alvarez K.R. Perez C.R. Pozza A. Najaf Panah M.J. Hepatoblastomas with carcinoma features represent a biological spectrum of aggressive neoplasms in children and young adults J. Hepatol. 2022 77 1026 1037 10.1016/j.jhep.2022.04.035 35577029 PMC9524481 9. Prochownik E.V. Reconciling the Biological and Transcriptional Variability of Hepatoblastoma with Its Mutational Uniformity Cancers 2021 13 1996 10.3390/cancers13091996 33919162 PMC8122429 10. Wang H. Stevens T. Lu J. Airik M. Airik R. Prochownik E.V. Disruption of Multiple Overlapping Functions Following Stepwise Inactivation of the Extended Myc Network Cells 2022 11 4087 10.3390/cells11244087 36552851 PMC9777503 11. Wang H. Lu J. Mandel J.A. Zhang W. Schwalbe M. Gorka J. Liu Y. Marburger B. Wang J. Ranganathan S. Patient-Derived Mutant Forms of Nfe2l2/Nrf2 Drive Aggressive Murine Hepatoblastomas Cell. Mol. Gastroenterol. Hepatol. 2021 12 199 228 10.1016/j.jcmgh.2021.02.004 33618031 PMC8102178 12. Zhang W. Meyfeldt J. Wang H. Kulkarni S. Lu J. Mandel J.A. Marburger B. Liu Y. Gorka J.E. Ranganathan S. Beta-Catenin Mutations as Determinants of Hepatoblastoma Phenotypes in Mice J. Biol. Chem. 2019 294 17524 17542 10.1074/jbc.RA119.009979 31597698 PMC6873193 13. Gong W. Han Z. Fang F. Chen L. Yap Expression Is Closely Related to Tumor Angiogenesis and Poor Prognosis in Hepatoblastoma Fetal Pediatr. Pathol. 2022 41 929 939 10.1080/15513815.2021.2020384 34978260 14. Li H. Wolfe A. Septer S. Edwards G. Zhong X. Abdulkarim A.B. Ranganathan S. Apte U. Deregulation of Hippo Kinase Signalling in Human Hepatic Malignancies Liver Int. 2012 32 38 47 10.1111/j.1478-3231.2011.02646.x 22098159 PMC4175712 15. Tao J. Calvisi D.F. Ranganathan S. Cigliano A. Zhou L. Singh S. Jiang L. Fan B. Terracciano L. Armeanu-Ebinger S. Activation of Beta-Catenin and Yap1 in Human Hepatoblastoma and Induction of Hepatocarcinogenesis in Mice Gastroenterology 2014 147 690 701 10.1053/j.gastro.2014.05.004 24837480 PMC4143445 16. Baroja I. Kyriakidis N.C. Halder G. Moya I.M. Expected and Unexpected Effects after Systemic Inhibition of Hippo Transcriptional Output in Cancer Nat. Commun. 2024 15 2700 10.1038/s41467-024-46531-1 38538573 PMC10973481 17. Mo J.S. Yu F.X. Gong R. Brown J.H. Guan K.L. Regulation of the Hippo-Yap Pathway by Protease-Activated Receptors (Pars) Genes Dev. 2012 26 2138 2143 10.1101/gad.197582.112 22972936 PMC3465735 18. Yu F.X. Zhao B. Panupinthu N. Jewell J.L. Lian I. Wang L.H. Zhao J. Yuan H. Tumaneng K. Li H. Regulation of the Hippo-Yap Pathway by G-Protein-Coupled Receptor Signaling Cell 2012 150 780 791 10.1016/j.cell.2012.06.037 22863277 PMC3433174 19. Bringold F. Serrano M. Tumor Suppressors and Oncogenes in Cellular Senescence Exp. Gerontol. 2000 35 317 329 10.1016/S0531-5565(00)00083-8 10832053 20. Fu Y. Frances R. Monge C. Desterke C. Marchio A. Pineau P. Chang-Marchand Y. Mata-Garrido J. Metabolic and Epigenetic Mechanisms in Hepatoblastoma: Insights into Tumor Biology and Therapeutic Targets Genes 2024 15 1358 10.3390/genes15111358 39596558 PMC11593527 21. Harada K. Toyooka S. Maitra A. Maruyama R. Toyooka K.O. Timmons C.F. Tomlinson G.E. Mastrangelo D. Hay R.J. Minna J.D. Aberrant Promoter Methylation and Silencing of the Rassf1a Oncogene 2002 21 4345 4349 10.1038/sj.onc.1205446 12082624 22. Honda S. Miyagi H. Suzuki H. Minato M. Haruta M. Kaneko Y. Hatanaka K.C. Hiyama E. Kamijo T. Okada T. RASSF1A Methylation Indicates a Poor Prognosis in Hepatoblastoma Patients Pediatr. Surg. Int. 2013 29 1147 1152 10.1007/s00383-013-3371-z 23989600 23. Iolascon A. Giordani L. Moretti A. Basso G. Borriello A. Della Ragione F. Analysis of Cdkn2a, Cdkn2b, Cdkn2c, and Cyclin Ds Gene Status in Hepatoblastoma Hepatology 1998 27 989 995 10.1002/hep.510270414 9537438 24. Sharpless N.E. Sherr C.J. Forging a Signature of in Vivo Senescence Nat. Rev. Cancer 2015 15 397 408 10.1038/nrc3960 26105537 25. Shim Y.H. Park H.J. Choi M.S. Kim J.S. Kim H. Kim J.J. Jang J.J. Yu E. Hypermethylation of the P16 Mod. Pathol. 2003 16 430 436 10.1097/01.MP.0000066799.99032.A7 12748249 26. Wang H. Lu J. Chen K. Ma B. Henchy C. Knapp J. Ranganathan S. Prochownik E.V. Efficient Derivation of Immortalized, Isogenic Cell Lines from Genetically Defined Murine Hepatoblastomas Biochem. Biophys. Res. Commun. 2025 780 152478 10.1016/j.bbrc.2025.152478 40819569 27. Wang H. Lu J. Edmunds L.R. Kulkarni S. Dolezal J. Tao J. Ranganathan S. Jackson L. Fromherz M. Beer-Stolz D. Coordinated Activities of Multiple Myc-Dependent and Myc-Independent Biosynthetic Pathways in Hepatoblastoma J. Biol. Chem. 2016 291 26241 26251 10.1074/jbc.M116.754218 27738108 PMC5159488 28. Arzumanian V.A. Kiseleva O.I. Poverennaya E.V. The Curious Case of the Hepg2 Cell Line: 40 Years of Expertise Int. J. Mol. Sci. 2021 22 13135 10.3390/ijms222313135 34884942 PMC8658661 29. Rikhi R.R. Spady K.K. Hoffman R.I. Bateman M.S. Bateman M. Howard L.E. Hepatoblastoma: A Need for Cell Lines and Tissue Banks to Develop Targeted Drug Therapies Front. Pediatr. 2016 4 22 10.3389/fped.2016.00022 27047905 PMC4800278 30. Dolezal J.M. Wang H. Kulkarni S. Jackson L. Lu J. Ranganathan S. Goetzman E.S. Bharathi S.S. Beezhold K. Byersdorfer C.A. Sequential Adaptive Changes in a C-Myc-Driven Model of Hepatocellular Carcinoma J. Biol. Chem. 2017 292 10068 10086 10.1074/jbc.M117.782052 28432125 PMC5473214 31. Fang J. Singh S. Cheng C. Natarajan S. Sheppard H. Abu-Zaid A. Durbin A.D. Lee H.W. Wu Q. Steele J. Genome-Wide Mapping of Cancer Dependency Genes and Genetic Modifiers of Chemotherapy in High-Risk Hepatoblastoma Nat. Commun. 2023 14 4003 10.1038/s41467-023-39717-6 37414763 PMC10326052 32. Shachaf C.M. Kopelman A.M. Arvanitis C. Karlsson A. Beer S. Mandl S. Bachmann M.H. Borowsky A.D. Ruebner B. Cardiff R.D. Myc Inactivation Uncovers Pluripotent Differentiation and Tumour Dormancy in Hepatocellular Cancer Nature 2004 431 1112 1117 10.1038/nature03043 15475948 33. Kulkarni S. Dolezal J.M. Wang H. Jackson L. Lu J. Frodey B.P. Dosunmu-Ogunbi A. Li Y. Fromherz M. Kang A. Ribosomopathy-Like Properties of Murine and Human Cancers PLoS ONE 2017 12 e0182705 10.1371/journal.pone.0182705 28820908 PMC5562309 34. Elster J.D. McGuire T.F. Lu J. Prochownik E.V. Rapid in Vitro Derivation of Endothelium Directly from Human Cancer Cells PLoS ONE 2013 8 e77675 10.1371/journal.pone.0077675 24130897 PMC3793940 35. Wang H. Chauhan J. Hu A. Pendleton K. Yap J.L. Sabato P.E. Jones J.W. Perri M. Yu J. Cione E. Disruption of Myc-Max Heterodimerization with Improved Cell-Penetrating Analogs of the Small Molecule 10074-G5 Oncotarget 2013 4 936 947 10.18632/oncotarget.1108 23801058 PMC3757250 36. Wang H. Hammoudeh D.I. Follis A.V. Reese B.E. Lazo J.S. Metallo S.J. Prochownik E.V. Improved Low Molecular Weight Myc-Max Inhibitors Mol. Cancer Ther. 2007 6 2399 2408 10.1158/1535-7163.MCT-07-0005 17876039 37. Wang H. Teriete P. Hu A. Raveendra-Panickar D. Pendelton K. Lazo J.S. Eiseman J. Holien T. Misund K. Oliynyk G. Direct Inhibition of C-Myc-Max Heterodimers by Celastrol and Celastrol-Inspired Triterpenoids Oncotarget 2015 6 32380 32395 10.18632/oncotarget.6116 26474287 PMC4741700 38. Collins C.J. Sedivy J.M. Involvement of the Ink4a/Arf Aging Cell 2003 2 145 150 10.1046/j.1474-9728.2003.00048.x 12882406 39. McGuire T.F. Sajithlal G.B. Lu J. Nicholls R.D. Prochownik E.V. In Vivo Evolution of Tumor-Derived Endothelial Cells PLoS ONE 2012 7 e37138 10.1371/journal.pone.0037138 22623986 PMC3356387 40. Mei X. Chen Y.S. Chen F.R. Xi S.Y. Chen Z.P. Glioblastoma Stem Cell Differentiation into Endothelial Cells Evidenced through Live-Cell Imaging Neuro Oncol. 2017 19 1109 1118 10.1093/neuonc/nox016 28340100 PMC5570159 41. Soda Y. Marumoto T. Friedmann-Morvinski D. Soda M. Liu F. Michiue H. Pastorino S. Yang M. Hoffman R.M. Kesari S. Transdifferentiation of Glioblastoma Cells into Vascular Endothelial Cells Proc. Natl. Acad. Sci. USA 2011 108 4274 4280 10.1073/pnas.1016030108 21262804 PMC3060261 42. Zhao C. Gomez G.A. Zhao Y. Yang Y. Cao D. Lu J. Yang H. Lin S. Etv2 Mediates Endothelial Transdifferentiation of Glioblastoma Signal Transduct. Target. Ther. 2018 3 4 10.1038/s41392-018-0007-8 29527330 PMC5837107 43. Francescone R.A. 3rd Faibish M. Shao R. A Matrigel-Based Tube Formation Assay to Assess the Vasculogenic Activity of Tumor Cells J. Vis. Exp. 2011 55 3040 10.3791/3040 PMC3230200 21931289 44. Protocol: Endothelial Cell Tube Formation Assay Available online: https://www.corning.com/catalog/cls/documents/protocols/protocol_DL_030_Endothelial_Cell_Tube_Formation_Assay.pdf (accessed on 12 May 2025) 45. Li Z.W. Ruan B. Yang P.J. Liu J.J. Song P. Duan J.L. Wang L. Oit3, a Promising Hallmark Gene for Targeting Liver Sinusoidal Endothelial Cells Signal Transduct. Target. Ther. 2023 8 344 10.1038/s41392-023-01621-2 37696816 PMC10495338 46. Velliou R.I. Legaki A.I. Nikolakopoulou P. Vlachogiannis N.I. Chatzigeorgiou A. Liver Endothelial Cells in Nafld and Transition to Nash and Hcc Cell. Mol. Life Sci. 2023 80 314 10.1007/s00018-023-04966-7 37798474 PMC11072568 47. Carrillo-Reixach J. Torrens L. Simon-Coma M. Royo L. Domingo-Sabat M. Abril-Fornaguera J. Akers N. Sala M. Ragull S. Arnal M. Epigenetic Footprint Enables Molecular Risk Stratification of Hepatoblastoma with Clinical Implications J. Hepatol. 2020 73 328 341 10.1016/j.jhep.2020.03.025 32240714 PMC12452110 48. Hooks K.B. Audoux J. Fazli H. Lesjean S. Ernault T. Dugot-Senant N. Leste-Lasserre T. Hagedorn M. Rousseau B. Danet C. New Insights into Diagnosis and Therapeutic Options for Proliferative Hepatoblastoma Hepatology 2018 68 89 102 10.1002/hep.29672 29152775 49. Miyajima A. Tanaka M. Itoh T. Stem/Progenitor Cells in Liver Development, Homeostasis, Regeneration, and Reprogramming Cell Stem Cell 2014 14 561 574 10.1016/j.stem.2014.04.010 24792114 50. Gunawardana H. Romero T. Yao N. Heidt S. Mulder A. Elashoff D.A. Valenzuela N.M. Tissue-Specific Endothelial Cell Heterogeneity Contributes to Unequal Inflammatory Responses Sci. Rep. 2021 11 1949 10.1038/s41598-020-80102-w 33479269 PMC7820348 51. Cleuren A.C.A. van der Ent M.A. Jiang H. Hunker K.L. Yee A. Siemieniak D.R. Molema G. Aird W.C. Ganesh S.K. Ginsburg D. The in Vivo Endothelial Cell Translatome Is Highly Heterogeneous across Vascular Beds Proc. Natl. Acad. Sci. USA 2019 116 23618 23624 10.1073/pnas.1912409116 31712416 PMC6876253 52. Ribatti D. Nico B. Vacca A. Roncali L. Dammacco F. Endothelial Cell Heterogeneity and Organ Specificity J. Hematother. Stem Cell Res. 2002 11 81 90 10.1089/152581602753448559 11847005 53. Lv Y. Kim K. Sheng Y. Cho J. Qian Z. Zhao Y.Y. Hu G. Pan D. Malik A.B. Hu G. Yap Controls Endothelial Activation and Vascular Inflammation through Traf6 Circ. Res. 2018 123 43 56 10.1161/CIRCRESAHA.118.313143 29794022 PMC6014930 54. Quan Y. Shan X. Hu M. Jin P. Ma J. Fan J. Yang J. Zhang H. Fan X. Gong Y. Yap Inhibition Promotes Endothelial Cell Differentiation from Pluripotent Stem Cell through Ec Master Transcription Factor Fli1 J. Mol. Cell. Cardiol. 2022 163 81 96 10.1016/j.yjmcc.2021.10.004 34666000 55. Pocaterra A. Romani P. Dupont S. Yap/Taz Functions and Their Regulation at a Glance J. Cell Sci. 2020 133 jcs230425 10.1242/jcs.230425 31996398 56. Zhao B. Li L. Tumaneng K. Wang C.Y. Guan K.L. A Coordinated Phosphorylation by Lats and Ck1 Regulates Yap Stability through Scf(Beta-Trcp) Genes Dev. 2010 24 72 85 10.1101/gad.1843810 20048001 PMC2802193 57. Allan B.J. Parikh P.P. Diaz S. Perez E.A. Neville H.L. Sola J.E. Predictors of Survival and Incidence of Hepatoblastoma in the Paediatric Population HPB 2013 15 741 746 10.1111/hpb.12112 23600968 PMC3791112 58. Czauderna P. Lopez-Terrada D. Hiyama E. Haberle B. Malogolowkin M.H. Meyers R.L. Hepatoblastoma State of the Art: Pathology, Genetics, Risk Stratification, and Chemotherapy Curr. Opin. Pediatr. 2014 26 19 28 10.1097/MOP.0000000000000046 24322718 59. Song H. Bucher S. Rosenberg K. Tsui M. Burhan D. Hoffman D. Cho S.J. Rangaswami A. Breese M. Leung S. Single-Cell Analysis of Hepatoblastoma Identifies Tumor Signatures That Predict Chemotherapy Susceptibility Using Patient-Specific Tumor Spheroids Nat. Commun. 2022 13 4878 10.1038/s41467-022-32473-z 36008377 PMC9411569 60. Wu P.V. Rangaswami A. Current Approaches in Hepatoblastoma-New Biological Insights to Inform Therapy Curr. Oncol. Rep. 2022 24 1209 1218 10.1007/s11912-022-01230-2 35438389 61. Brown P. Treatment of Infant Leukemias: Challenge and Promise Hematol. Am. Soc. Hematol. Educ. Program. 2013 2013 596 600 10.1182/asheducation-2013.1.596 24319237 PMC4729208 62. Catalanotti F. Cheng D.T. Shoushtari A.N. Johnson D.B. Panageas K.S. Momtaz P. Higham C. Won H.H. Harding J.J. Merghoub T. PTEN Loss-of-Function Alterations Are Associated with Intrinsic Resistance to Braf Inhibitors in Metastatic Melanoma JCO Precis. Oncol. 2017 1 1 15 10.1200/PO.16.00054 PMC7446400 32913971 63. Czarnecka A.M. Bartnik E. Fiedorowicz M. Rutkowski P. Targeted Therapy in Melanoma and Mechanisms of Resistance Int. J. Mol. Sci. 2020 21 4576 10.3390/ijms21134576 32605090 PMC7369697 64. Filippi-Chiela E.C. Vargas J.E. Bueno E.S.M.M. Thome M.P. Lenz G. Vincristine Promotes Differential Levels of Apoptosis, Mitotic Catastrophe, and Senescence Depending on the Genetic Background of Glioblastoma Cells Toxicol. Vitr. 2022 85 105472 10.1016/j.tiv.2022.105472 36116745 65. Malone E.R. Oliva M. Sabatini P.J.B. Stockley T.L. Siu L.L. Molecular Profiling for Precision Cancer Therapies Genome Med. 2020 12 8 10.1186/s13073-019-0703-1 31937368 PMC6961404 66. Pleasance E. Bohm A. Williamson L.M. Nelson J.M.T. Shen Y. Bonakdar M. Titmuss E. Csizmok V. Wee K. Hosseinzadeh S. Whole-Genome and Transcriptome Analysis Enhances Precision Cancer Treatment Options Ann. Oncol. 2022 33 939 949 10.1016/j.annonc.2022.05.522 35691590 67. Langer T. Grabow D. Steinmann D. Wormann B. Calaminus G. Late Effects and Long-Term Follow-up after Cancer in Childhood Oncol. Res. Treat. 2017 40 746 750 10.1159/000484936 29183026 68. Signorelli C. Wakefield C.E. McLoone J.K. Johnston K.A. Mertens A.C. Osborn M. Cohn R.J. Group A.S.S. Childhood Cancer Survivors’ Reported Late Effects, Motivations for Seeking Survivorship Care, and Patterns of Attendance Oncologist 2023 28 e276 e286 10.1093/oncolo/oyad004 36944156 PMC10166180 69. Nagae G. Yamamoto S. Fujita M. Fujita T. Nonaka A. Umeda T. Fukuda S. Tatsuno K. Maejima K. Hayashi A. Genetic and Epigenetic Basis of Hepatoblastoma Diversity Nat. Commun. 2021 12 5423 10.1038/s41467-021-25430-9 34538872 PMC8450290 70. Sumazin P. Chen Y. Trevino L.R. Sarabia S.F. Hampton O.A. Patel K. Mistretta T.A. Zorman B. Thompson P. Heczey A. Genomic Analysis of Hepatoblastoma Identifies Distinct Molecular and Prognostic Subgroups Hepatology 2017 65 104 121 10.1002/hep.28888 27775819 71. Eichenmuller M. Trippel F. Kreuder M. Beck A. Schwarzmayr T. Haberle B. Cairo S. Leuschner I. von Schweinitz D. Strom T.M. The Genomic Landscape of Hepatoblastoma and Their Progenies with Hcc-Like Features J. Hepatol. 2014 61 1312 1320 10.1016/j.jhep.2014.08.009 25135868 72. Bielenberg D.R. Zetter B.R. The Contribution of Angiogenesis to the Process of Metastasis Cancer J. 2015 21 267 273 10.1097/PPO.0000000000000138 26222078 PMC4670555 73. Lugano R. Ramachandran M. Dimberg A. Tumor Angiogenesis: Causes, Consequences, Challenges and Opportunities Cell. Mol. Life Sci. 2020 77 1745 1770 10.1007/s00018-019-03351-7 31690961 PMC7190605 74. Azad T. Ghahremani M. Yang X. The Role of Yap and Taz in Angiogenesis and Vascular Mimicry Cells 2019 8 407 10.3390/cells8050407 31052445 PMC6562567 75. Liu Z. Qi L. Li Y. Zhao X. Sun B. Vegfr2 Regulates Endothelial Differentiation of Colon Cancer Cells BMC Cancer 2017 17 593 10.1186/s12885-017-3578-9 28854900 PMC5577671 76. Luo Q. Wang J. Zhao W. Peng Z. Liu X. Li B. Zhang H. Shan B. Zhang C. Duan C. Vasculogenic Mimicry in Carcinogenesis and Clinical Applications J. Hematol. Oncol. 2020 13 19 10.1186/s13045-020-00858-6 32169087 PMC7071697 77. Sajithlal G.B. McGuire T.F. Lu J. Beer-Stolz D. Prochownik E.V. Endothelial-Like Cells Derived Directly from Human Tumor Xenografts Int. J. Cancer 2010 127 2268 2278 10.1002/ijc.25251 20162569 78. Wei X. Chen Y. Jiang X. Peng M. Liu Y. Mo Y. Ren D. Hua Y. Yu B. Zhou Y. Mechanisms of Vasculogenic Mimicry in Hypoxic Tumor Microenvironments Mol. Cancer 2021 20 7 10.1186/s12943-020-01288-1 33397409 PMC7784348 79. Arnaoutova I. Kleinman H.K. In Vitro Angiogenesis: Endothelial Cell Tube Formation on Gelled Basement Membrane Extract Nat. Protoc. 2010 5 628 635 10.1038/nprot.2010.6 20224563 80. DeCicco-Skinner K.L. Henry G.H. Cataisson C. Tabib T. Gwilliam J.C. Watson N.J. Bullwinkle E.M. Falkenburg L. O’Neill R.C. Morin A. Endothelial Cell Tube Formation Assay for the in Vitro Study of Angiogenesis J. Vis. Exp. 2014 91 e51312 10.3791/51312 PMC4540586 25225985 81. Corada M. Nyqvist D. Orsenigo F. Caprini A. Giampietro C. Taketo M.M. Iruela-Arispe M.L. Adams R.H. Dejana E. The Wnt/Beta-Catenin Pathway Modulates Vascular Remodeling and Specification by Upregulating Dll4/Notch Signaling Dev. Cell 2010 18 938 949 10.1016/j.devcel.2010.05.006 20627076 PMC8127076 82. Hooglugt A. van der Stoel M.M. Boon R.A. Huveneers S. Endothelial Yap/Taz Signaling in Angiogenesis and Tumor Vasculature Front. Oncol. 2020 10 612802 10.3389/fonc.2020.612802 33614496 PMC7890025 83. McSweeney S.R. Warabi E. Siow R.C. Nrf2 as an Endothelial Mechanosensitive Transcription Factor: Going with the Flow Hypertension 2016 67 20 29 10.1161/HYPERTENSIONAHA.115.06146 26597822 84. Leon S.P. Folkerth R.D. Black P.M. Microvessel Density Is a Prognostic Indicator for Patients with Astroglial Brain Tumors Cancer 1996 77 362 372 10.1002/(SICI)1097-0142(19960115)77:2&#x0003c;362::AID-CNCR20&#x0003e;3.0.CO;2-Z 8625246 85. Li Y. Ma X. Zhang J. Liu X. Liu L. Prognostic Value of Microvessel Density in Hepatocellular Carcinoma Patients: A Meta-Analysis Int. J. Biol. Markers 2014 29 e279 e287 10.5301/jbm.5000087 24803279 86. Zhang B. Niu W. Dong H.Y. Liu M.L. Luo Y. Li Z.C. Hypoxia Induces Endothelial-Mesenchymal Transition in Pulmonary Vascular Remodeling Int. J. Mol. Med. 2018 42 270 278 10.3892/ijmm.2018.3584 29568878 PMC5979824 87. Zhang J. Liu Q. Fang Z. Hu X. Huang F. Tang L. Zhou S. Hypoxia Induces the Proliferation of Endothelial Progenitor Cells Via Upregulation of Apelin/Aplnr/Mapk Signaling Mol. Med. Rep. 2016 13 1801 1806 10.3892/mmr.2015.4691 26676468 88. Moroishi T. Park H.W. Qin B. Chen Q. Meng Z. Plouffe S.W. Taniguchi K. Yu F.X. Karin M. Pan D. A Yap/Taz-Induced Feedback Mechanism Regulates Hippo Pathway Homeostasis Genes Dev. 2015 29 1271 1284 10.1101/gad.262816.115 26109050 PMC4495398 89. Min Q. Molina L. Li J. Adebayo Michael A.O. Russell J.O. Preziosi M.E. Singh S. Poddar M. Matz-Soja M. Ranganathan S. Beta-Catenin and Yes-Associated Protein 1 Cooperate in Hepatoblastoma Pathogenesis Am. J. Pathol. 2019 189 1091 1104 10.1016/j.ajpath.2019.02.002 30794807 PMC6521893 90. Chen H.F. Wu K.J. Endothelial Transdifferentiation of Tumor Cells Triggered by the Twist1-Jagged1-Klf4 Axis: Relationship between Cancer Stemness and Angiogenesis Stem Cells Int. 2016 2016 6439864 10.1155/2016/6439864 26823670 PMC4707371 91. Li X. Karras P. Torres R. Rambow F. van den Oord J. Marine J.C. Kos L. Disseminated Melanoma Cells Transdifferentiate into Endothelial Cells in Intravascular Niches at Metastatic Sites Cell Rep. 2020 31 107765 10.1016/j.celrep.2020.107765 32553158 92. Schwendenwein A. Megyesfalvi Z. Barany N. Valko Z. Bugyik E. Lang C. Ferencz B. Paku S. Lantos A. Fillinger J. Molecular Profiles of Small Cell Lung Cancer Subtypes: Therapeutic Implications Mol. Ther. Oncolytics 2021 20 470 483 10.1016/j.omto.2021.02.004 33718595 PMC7917449 93. Singh M.P. Rai S. Pandey A. Singh N.K. Srivastava S. Molecular Subtypes of Colorectal Cancer: An Emerging Therapeutic Opportunity for Personalized Medicine Genes Dis. 2021 8 133 145 10.1016/j.gendis.2019.10.013 33997160 PMC8099693 94. Yin L. Duan J.J. Bian X.W. Yu S.C. Triple-Negative Breast Cancer Molecular Subtyping and Treatment Progress Breast Cancer Res. 2020 22 61 10.1186/s13058-020-01296-5 32517735 PMC7285581 95. Zhong W. Myers J.S. Wang F. Wang K. Lucas J. Rosfjord E. Lucas J. Hooper A.T. Yang S. Lemon L.A. Comparison of the Molecular and Cellular Phenotypes of Common Mouse Syngeneic Models with Human Tumors BMC Genomics. 2020 21 2 10.1186/s12864-019-6344-3 31898484 PMC6941261 96. Strom S.C. Davila J. Grompe M. Chimeric Mice with Humanized Liver: Tools for the Study of Drug Metabolism, Excretion, and Toxicity Methods Mol. Biol. 2010 640 491 509 20645070 10.1007/978-1-60761-688-7_27 PMC3136240 Figure 1 Properties of BN and YN HBs and their progeny immortalized cell lines. ( A 26 26 B A 11 26 C 26 D INK4A ARF INK4A ARF Figure 2 YN and BN cell lines express small, unique subsets of p16 INK4A ARF A Cdkn2a Cdkn2a B Supplementary File S1 B INK4A ARF Cdkn2a INK4A ARF 26 C INK4A ARF 26 D E INK4A ARF C D INK4A F E E G Supplementary File S6 Figure 3 Histologies of BN and YN tumor cell lines following subQ or “pseudo-metastatic” growth in lungs. ( A Supplementary Figure S1 B Supplementary Figure S2 Figure 4 HB cell lines are variably susceptible to EC-like differentiation in response to hypoxia. ( A 2 B C D E F E G E H 2 6 I H J H I p p Figure 5 Murine and human HBs upregulate the expression of EC-specific transcripts. ( A 11 12 27 B A C D 47 48 Figure 6 Gene expression profiling of BN1-Tie2-EGFP+ cells reveals widespread EC-specific gene expression within a more undifferentiated sub-population of hepatocytes. ( A 2 B A C Supplementary File S4 D E Supplementary File S5 F 49 G Figure 5 C G Supplementary File S2 H Figure 5 30 32 MYC I Figure 5 J I K L K p Figure 7 Exogenous Y overexpression suppresses Tie2-EGFP. ( A B A C high B Supplementary File S6 Figure 8 Murine HB cell lines display similar sensitivities to commonly employed therapeutic agents. ( A B A ",
  "metadata": {
    "Title of this paper": "Chimeric Mice with Humanized Liver: Tools for the Study of Drug Metabolism, Excretion, and Toxicity",
    "Journal it was published in:": "Cancers",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468702/"
  }
}