{
  "title": "Paper_857",
  "abstract": "pmc J Int Med Res J Int Med Res 3252 jimr IMR The Journal of International Medical Research 0300-0605 1473-2300 SAGE Publications PMC12475650 PMC12475650.1 12475650 12475650 41005765 10.1177/03000605251379519 10.1177_03000605251379519 1 Preclinical Study Expression analysis of NOD-like receptor protein 3 and interleukin-18 in basal cell carcinoma: A case–control study Mehrabi Zahra 1 Rahimi Zohreh 1 2 Mohammadi Parisa 3 Jalilian Nazanin 1 Haghnazari Lida 1 Salari Farhad 4 5 https://orcid.org/0000-0002-1974-6860 Asadi Soheila 1 5  1 48464 Kermanshah University of Medical Sciences  2 48464 Research Institute for Health Technology, Kermanshah University of Medical Sciences  3 48464 Kermanshah University of Medical Sciences  4  5 Soheila Asadi, Faculty of Medicine, Kermanshah University of Medical Sciences, Sorkheh-Ligeh Blvd, P.O. Postal code/P.O. Box: 67145-1673, Kermanshah, Iran. Email: Sohila.asadi75@yahoo.com 9 2025 26 9 2025 53 9 496213 03000605251379519 11 6 2025 30 8 2025 26 09 2025 28 09 2025 28 09 2025 © The Author(s) 2025 2025 SAGE Publications https://creativecommons.org/licenses/by-nc/4.0/ Creative Commons Non Commercial CC BY-NC: This article is distributed under the terms of the Creative Commons Attribution-NonCommercial 4.0 License ( https://creativecommons.org/licenses/by-nc/4.0/ https://us.sagepub.com/en-us/nam/open-access-at-sage Objective This study aimed to investigate the expression of the inflammasome-related molecules NOD-like receptor protein 3 and interleukin-18 in basal cell carcinoma tissues and to evaluate their potential as diagnostic biomarkers. Methods In this observational case–control study, tumor tissues and adjacent noncancerous tissue samples from 25 patients with basal cell carcinoma were analyzed. We quantified NOD-like receptor protein 3 and interleukin-18 expression at the mRNA and protein levels using quantitative real-time polymerase chain reaction and western blotting, respectively. The diagnostic performance of these molecules was assessed using receiver operating characteristic curve analysis. Results Our results revealed that both NOD-like receptor protein 3 and interleukin-18 were significantly upregulated in basal cell carcinoma tissues compared with adjacent noncancerous tissue samples at the mRNA and protein levels (p < 0.05). Receiver operating characteristic curve analysis demonstrated strong diagnostic performance, with an area under the curve of 0.931 for NOD-like receptor protein 3 (95% confidence interval: 0.845–1.00) and 0.860 for interleukin-18 (95% confidence interval: 0.739–0.980). Conclusions The marked upregulation of NOD-like receptor protein 3 and interleukin-18 suggests their involvement in the inflammatory tumor microenvironment and positions them as promising candidate biomarkers for basal cell carcinoma detection. Although these findings may suggest their relevance as future therapeutic targets, this role requires substantial validation through functional assays and in larger, more diverse study populations. Basal cell carcinoma NOD-like receptor protein 3 interleukin-18 biomarker skin cancer therapeutic targets pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes typesetter ts2 Introduction Basal cell carcinoma (BCC) is the most common type of skin cancer, representing approximately 80% of nonmelanoma skin cancers globally. Although BCC seldom metastasizes, its capacity for local invasion can result in considerable morbidity, especially in sun-exposed regions of the skin. Despite the growing volume of literature on BCC worldwide, there remains a significant deficiency in our comprehension of its underlying mechanisms, which hinders the advancement of more effective diagnostic and therapeutic strategies.  1 According to recent research, chronic inflammation plays a crucial role in forming the tumor microenvironment, impacting not only the development and spread of tumors but also their capacity to elude immune surveillance. 2 5 6 9 10 11 IL18, triggered downstream of NLRP3, has multifaceted roles in cancer—occasionally facilitating antitumor immune responses, while at other times, exacerbating inflammation that promotes tumor proliferation.  7 Precise diagnosis and prognosis in dermatopathology depend significantly on the identification and validation of reliable molecular biomarkers. The expression profiles of NLRP3 and IL18 in BCC tissues may provide significant insights into the inflammatory pathways associated with BCC and act as possible diagnostic indicators. This study evaluated the expression of NLRP3 and IL18 at the mRNA and protein levels in BCC tissues and adjacent nonmalignant tissues. Our objective is to elucidate the functions of these inflammasome components in the pathophysiology of BCC and to investigate their potential as diagnostic or therapeutic targets. Methods Twenty-five fresh-frozen tissue samples with BCC and 25 adjacent noncancerous tissue samples were procured from the Iranian Tumor Bank at Tehran University of Medical Sciences, Iran. This case-control study was approved by the Ethics Committee of Kermanshah University of Medical Sciences (IR.KUMS.MED.REC.1401.302; approval date: 29 January 2023). All procedures were conducted in accordance with the principles of the Declaration of Helsinki (1975) and its latest amendment (2024). The samples were procured from patients with BCC according to inclusion criteria (patients with BCC) and exclusion criteria (patients who underwent chemotherapy, radiation, or antiinflammatory medications). Informed consent in writing was acquired from all tissue donors. The diagnosis of BCC in malignant tissue samples (case group) was confirmed by a specialist pathologist. Additionally, a total of 25 adjacent noncancerous tissue samples were utilized as the control group, which was corroborated by pathological investigation and classified as noncancerous tissues. All tissue samples were maintained as fresh-frozen specimens until subsequent examination. In this investigation, we employed distinct numbering systems for the case and control groups; therefore, the investigators performing quantitative real-time polymerase chain reaction (qRT-PCR) and western blotting were not blinded to group allocation. All case and control samples were analyzed in a single qRT-PCR run for each gene, thereby minimizing the potential for bias. RNA extraction, cDNA synthesis, and qRT-PCR Fresh-frozen tissue samples were pulverized using liquid nitrogen. Subsequently, total RNA was extracted using the RNX Plus reagent (Sinaclone, Iran) in accordance with the manufacturer's guidelines. The subsequent stage involved assessing the purity and integrity of total RNA using a Nanodrop spectrophotometer (Thermo Fisher Scientific) and 1% Tris-acetate ethylenediaminetetraacetic acid-agarose gel electrophoresis. Complementary DNA (cDNA) was produced from 2 µg of total RNA utilizing the Pars Tous cDNA synthesis Kit (Iran). The qRT-PCR was performed utilizing the Amplicon SYBR Green PCR Kit (Denmark) on a Roche Real-Time Cycler (Germany). The qRT-PCR experiment for each sample was performed in duplicate. The primer sequences employed in the current study are presented in Table 1 Table 1. Primers and related sequences used in present study. Gene symbol Forward Reverse Reference NLRP3 CCATCGGCAAGACCAAGA ACAGGCTCAGAATGCTCATC   18 IL18 GCATCAACTTTGTGGCAAT CCGATTTCCTTGGTCAAT   19 β-actin CATGTACGTTGCTATCCAGGC CTCCTTAATGTCACGCACGAT   20 Western blotting for NLRP3 and IL18 For western blotting assay, in the first step, total protein from fresh-frozen tissue samples were extracted. The tissue samples were homogenized in liquid nitrogen, and then tissue homogenates were incubated with 700 µL of radioimmunoprecipitation assay buffer containing protease inhibitor cocktail (Kiazist, Iran) for 15 minutes at 4°C. Subsequently, the tubes were centrifuged at 5000 rpm for 40 minutes at 4°C. Finally, the supernatant was collected and stored at −70°C. The total protein level was measured using BCA Kit (Kiazist, Iran). For the western blotting assay, 40 µg of total protein from each sample were separated using sodium dodecyl sulfate-polyacrylamide gel electrophoresis, following which the proteins were transferred to polyvinylidene fluoride (PVDF) membranes. Thereafter, the membranes were incubated with 5% nonfat skim milk powder (Sigma, Burlington, Massachusetts, USA) for 2 hours. Subsequent to the blocking procedure, the PVDF membranes were rinsed twice with tris-buffered saline with tween-20 (TBST) buffer and once with TBS buffer, each for a duration of 10 minutes. After the washing phase, the membranes were incubated overnight with the following primary antibodies: anti-NLRP3 (ab263899, Abcam; 1:1000), anti-IL18 (ab243091, Abcam; 1:1000), and anti-β-actin (ab8227, Abcam; 1:2500). The membranes were washed twice with TBST and once with TBS buffer, followed by a 2-hour incubation with horseradish peroxidase–conjugated goat antirabbit secondary antibody (ab6721, Abcam; 1:10,000). Ultimately, following three separate washes with TBST and TBS, the protein bands were detected with BioRad ECL choose western blotting detection reagent (BioRad, Hercules, California, USA). β-actin was utilized as an internal control, and Image J software was employed for densitometric analysis. The western blotting experiment was performed only once for each sample. Statistical analysis Data analysis was done using IBM Corp.'s SPSS version 16. Statistical significance was established at p < 0.05, and data were presented as mean ± SEM. The Kolmogorov-Smirnov test was employed to assess the normality of the data distribution. The independent t NLRP3 IL18 Results Demographics and clinicopathological data The demographic and clinical characteristics of the participants are delineated in Tables 2 3 Table 2. Demographic characteristics of participants. Characteristic Categorization N Sex Female 11 Male 14 Alcohol Nondrinker 23 Social drinker 2 Smoking Nonsmoker 18 Smoker 3 Ex-smoker 2 Unknown 2 Table 3. Clinicopathological information of participants. Characteristic Categorization N Tumor diameter (mm) 1–30 11 31–60 4 61–90 4 91–120 2 Missing 4 Tumor depth (mm) 1–10 9 11–20 3 >20 1 Missing 12 Histology Basal cell carcinoma NOS 22 Basal cell carcinoma infiltrating 1 Basal cell carcinoma mixed histology 2 Histology grade Grade I (well differentiated) 21 Grade III (high-poor differentiated) 4 Bone invasion Yes 2 No 13 Perineural invasion Yes 7 No 18 TNM Stage 0 4 Stage I 5 Stage II 8 Stage III 8 NOS: not otherwise specified; TNM: tumor, node, metastasis. NLRP3 and IL18 gene expression The qRT-PCR study demonstrated that NLRP3 Figure 1(a) IL18 Figure 1(b) Figure 1. The mRNA expression of NLRP3 IL18 NLRP3 and IL18 protein expression Western blot examination indicated that NLRP3 protein levels were markedly increased in tumor tissues relative to adjacent noncancerous tissues (p = 0.017; Figure 2(b) Figure 2(c) Figure 2. The protein expression of NLRP3 and in tumor tissue samples and adjacent noncancerous tissue samples of patients with BCC. The band of NLRP3, IL18, and β-actin (a), the band intensity of NLRP3 (b) and IL18 (c) in tumor tissue samples and adjacent noncancerous tissue samples of patients with BCC. The data are presented as mean ± SEM. p value <0.05 was considered as significant. BCC: basal cell carcinoma; IL18: interleukin-18; NLRP3: NOD-like receptor protein 3. Association of NLRP3 and IL18 genes expression with clinicopathological characteristics Table 4 NLRP3 Table 4 NLRP3 Table 5 IL18 Table 4. The association between NLRP3 Expression of NLRP3 p value * Parameter Number Low expression (%) High expression (%) Histology grade >0.999 I 21 16 (76.19) 3 (75) III 4 5 (23.81) 1 (25) Bone invasion 0.528 Yes 2 2 (100) 9 (69.23) No 13 0 (0) 4 (30.77) Perineural invasion >0.999 Yes 7 6 (75) 13 (76.47) No 18 2 (25) 4 (23.53) * Because of small sample numbers, Fisher's test p values were considered. Table 5. The association between IL18 Parameter Expression of IL18 p value * Number Low expression (%) High expression (%) Histology grade 0.548 I 21 16 (76.19) 2 (50) III 4 5 (23.81) 2 (50) Bone invasion 0.528 Yes 2 2 (100) 9 (69.23) No 13 0 (0) 4 (30.77) Perineural invasion >0.999 Yes 7 6 (75) 13 (76.47) No 18 2 (25) 4 (23.53) * Because of small sample numbers, Fisher's test p values were considered. ROC curve analysis We conducted ROC curve analysis to evaluate the diagnostic significance of NLRP3 IL18 NLRP3 Figure 3(a) IL18 Figure 3(b) Figure 3. The ROC curve analysis for NLRP3 (a) and IL18 (b) genes expression as potential tumor markers. ROC: receiver operating characteristic; IL18: interleukin-18; NLRP3: NOD-like receptor protein 3. Discussion The notable increase of NLRP3 and IL18 gene expression in BCC tissues underscores the possible significance of inflammatory signaling in the pathogenesis of this prevalent skin cancer. NLRP3, a pivotal modulator of innate immunity, facilitates the maturation of proinflammatory cytokines by caspase-1 activation, resulting in the secretion of IL1β and IL18, all of which have been demonstrated to affect tumor-associated inflammation. 6 11  9 Our observation of significant upregulation of NLRP3 IL18  12  13 6 13  11  14  15 Our findings concerning IL18 correspond to prior research that has documented its overexpression in squamous cell carcinoma and melanoma, where IL18 is believed to facilitate the formation of a proinflammatory tumor microenvironment.  9 16 17 Our data illustrate the concurrent upregulation of NLRP3 and IL18 in BCC tissues, contributing to the literature indicating that these molecules may synergistically influence the inflammatory environment of malignancies. These discoveries not only corroborate findings from associated skin malignancies but also offer novel insights into the specific roles of NLRP3 and IL18 in BCC. Our analysis presents various novel contributions in comparison to prior investigations. Initially, we concurrently evaluated the mRNA and protein expression levels of NLRP3 and IL18 in matched BCC and adjacent noncancerous tissues, offering a more thorough understanding of their role in tumor biology. Secondly, to our knowledge, this is the first publication investigating IL18 expression in human BCC tissues. Third, we employed ROC curve analysis to assess the diagnostic efficacy of these markers, introducing a quantitative aspect that has not been previously investigated in this context. These features establish our findings as a significant preliminary step in comprehending the diagnostic and possibly therapeutic significance of inflammasome-related chemicals in BCC. To investigate the clinical significance of our findings, we analyzed the correlation between the expression levels of NLRP3 and IL18 and clinicopathological features, including histological grade, bone invasion, and perineural invasion. Our findings indicated no significant association between gene expression levels and the specified parameters. This may result from the study's small sample size, and we advise that future research reassess these correlations in bigger cohorts. Although this study provides insightful information, a number of limitations should be noted. The limited sample size (n = 25) constrains the generalizability of our results and may diminish statistical power, especially in identifying nuanced changes in expression or clinical associations. Conversely, most of the BCCs were categorized as NOS, and their subtypes remained ambiguous, despite the confirmation of BCC through pathological evaluation. Despite the statistically significant changes in NLRP3 and IL18 gene expression between tumor and adjacent normal tissues, bigger multicenter investigations are required to validate these findings and enhance their therapeutic significance. Moreover, functional tests, including gene knockdown and caspase-1 inhibition, were excluded from this study. Consequently, a conclusive causal relationship between inflammasome activation and tumor growth cannot be demonstrated. Prior research has demonstrated that NLRP3 activation can affect tumor behavior by regulating immune responses and cytokine signaling, 6 11 In conclusion, this study demonstrates that NLRP3 and IL18 (at the mRNA and protein levels) are significantly upregulated in BCC tissues when compared with adjacent noncancerous tissue samples. The strong diagnostic performance observed in our ROC analysis highlights the potential of these inflammasome-related molecules as promising biomarkers for BCC detection. From a translational perspective, these findings provide a solid foundation for further research into their roles as both diagnostic tools and potential therapeutic targets. It is suggested that future research evaluates these expression patterns in larger and more diverse study populations, ideally across multiple clinical centers. Such studies could also include functional assays to causally link NLRP3 and IL18 activity to BCC pathogenesis. Furthermore, determining the prognostic and predictive significance of these markers requires longitudinal data that correlate their expression levels with key clinical outcomes, including tumor recurrence and response to therapy. Ultimately, this line of research will be essential to determine whether modulation of these inflammatory pathways could provide a novel therapeutic avenue for the management of BCC. Acknowledgments The present article was extracted from MSc dissertation of the first author at Kermanshah University of Medical Sciences that the authors would like to appreciate this center and Deputy for Research and Technology, Kermanshah University of Medical Sciences. ORCID iD: https://orcid.org/0000-0002-1974-6860 Author contributions Zahra Mehrabi: Conceptualization, Methodology, Investigation, Writing—Original Draft, Writing—Review & Editing; Zohreh Rahimi: Data Curation, Supervision, Writing—Review & Editing; Parisa Mohammadi: Methodology, Writing—Original Draft, Writing—Review & Editing; Nazanin Jalilian: Investigation, Data Curation; Lida Haghnazari: Formal Analysis, Visualization, Writing—Review & Editing; Farhad Salari: Investigation, Validation; Soheila Asadi: Supervision, Project Administration, Writing—Review & Editing. Consent to participate Written informed consent was obtained from all participants. Data availability The datasets generated and/or analyzed during the current study are available from the corresponding author upon reasonable request. Declaration of conflicting interest The authors declare that there are no conflicts of interest. Ethical considerations This study was approved by the Research Ethics Committee of Kermanshah University of Medical Sciences (ethics approval number: IR.KUMS.MED.REC.1401.302). Funding This research was supported by Deputy for Research and Technology, Kermanshah University of Medical Sciences, 4020217 (29 January 2023). References 1 Baba PUF Hassan AU Khurshid J et al Basal cell carcinoma: diagnosis, management and prevention Jmp 2024 5 153 170 2 Neagu M Constantin C Caruntu C et al Inflammation: a key process in skin tumorigenesis Oncol Lett 2019 17 4068 4084 30944600 10.3892/ol.2018.9735 PMC6444305 3 Ciążyńska M Olejniczak-Staruch I Sobolewska-Sztychny D et al Ultraviolet radiation and chronic inflammation-molecules and mechanisms involved in skin carcinogenesis: a narrative review Life (Basel) 2021 11 326 33917793 10.3390/life11040326 PMC8068112 4 Jabłońska-Trypuć A. The role of the microbiome in inflammation and carcinogenesis Front Biosci (Elite Ed) 2023 15 28 38163940 10.31083/j.fbe1504028 5 Li NY Zhang W Haensel D et al Basal-to-inflammatory transition and tumor resistance via crosstalk with a pro-inflammatory stromal niche Nat Commun 2024 15 8134 39289380 10.1038/s41467-024-52394-3 PMC11408617 6 Sharma BR Kanneganti T-D. NLRP3 inflammasome in cancer and metabolic diseases Nat Immunol 2021 22 550 559 33707781 10.1038/s41590-021-00886-5 PMC8132572 7 Kantono M Guo B. Inflammasomes and cancer: the dynamic role of the inflammasome in tumor development Front Immunol 2017 8 1132 28955343 10.3389/fimmu.2017.01132 PMC5600922 8 Wang M Chen X Zhang Y. Biological functions of gasdermins in cancer: from molecular mechanisms to therapeutic potential Front Cell Dev Biol 2021 9 638710 33634141 10.3389/fcell.2021.638710 PMC7901903 9 Rex DAB Agarwal N Prasad TSK et al A comprehensive pathway map of IL-18-mediated signalling J Cell Commun Signal 2020 14 257 266 31863285 10.1007/s12079-019-00544-4 PMC7272533 10 Chen S Xu X Liu Y et al Inter-relationships of galectin-3 and NLR family pyrin domain containing 3 inflammasomes with oral lichen planus: a preliminary cross-sectional in vitro study BMC Oral Health 2024 24 14 38172822 10.1186/s12903-023-03780-8 PMC10765663 11 Ju M Bi J Wei Q et al Pan-cancer analysis of NLRP3 inflammasome with potential implications in prognosis and immunotherapy in human cancer Brief Bioinform 2021 22 bbaa345 33212483 10.1093/bib/bbaa345 PMC8294515 12 Ahmad I Muneer KM Chang ME et al Ultraviolet radiation-induced downregulation of SERCA2 mediates activation of NLRP3 inflammasome in basal cell carcinoma Photochem Photobiol 2017 93 1025 1033 28120514 10.1111/php.12725 13 Okamoto M Liu W Luo Y et al Constitutively active inflammasome in human melanoma cells mediating autoinflammation via caspase-1 processing and secretion of interleukin-1beta J Biol Chem 2010 285 6477 6488 20038581 10.1074/jbc.M109.064907 PMC2825443 14 Allen IC TeKippe EM Woodford RM et al The NLRP3 inflammasome functions as a negative regulator of tumorigenesis during colitis-associated cancer J Exp Med 2010 207 1045 1056 20385749 10.1084/jem.20100050 PMC2867287 15 Wei Q Mu K Li T et al Deregulation of the NLRP3 inflammasome in hepatic parenchymal cells during liver cancer progression Lab Invest 2014 94 52 62 24166187 10.1038/labinvest.2013.126 16 Fabbi M Carbotti G Ferrini S. Context-dependent role of IL-18 in cancer biology and counter-regulation by IL-18BP J Leukoc Biol 2015 97 665 675 25548255 10.1189/jlb.5RU0714-360RR 17 Dupaul-Chicoine J Arabzadeh A Dagenais M et al The Nlrp3 inflammasome suppresses colorectal cancer metastatic growth in the liver by promoting natural killer cell tumoricidal activity Immunity 2015 43 751 763 26384545 10.1016/j.immuni.2015.08.013 18 Feng X Luo Q Zhang H et al The role of NLRP3 inflammasome in 5-fluorouracil resistance of oral squamous cell carcinoma J Exp Clin Cancer Res 2017 36 1 14 28637493 10.1186/s13046-017-0553-x PMC5479028 19 Chen J Liu F Lee SA et al Detection of IL-18 and IL-1β protein and mRNA in human oral epithelial cells induced by Campylobacter concisus strains Biochem Biophys Res Commun 2019 518 44 49 31400853 10.1016/j.bbrc.2019.08.006 20 Huang Y Jiang T Chen J et al Effects of kartogenin on the attenuated nucleus pulposus cell degeneration of intervertebral discs induced by interleukin-1β and tumor necrosis factor-α Int J Mol Med 2018 41 749 756 29207013 10.3892/ijmm.2017.3283 PMC5752177 ",
  "metadata": {
    "Title of this paper": "Effects of kartogenin on the attenuated nucleus pulposus cell degeneration of intervertebral discs induced by interleukin-1β and tumor necrosis factor-α",
    "Journal it was published in:": "The Journal of International Medical Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12475650/"
  }
}