{
  "title": "Paper_524",
  "abstract": "pmc J Immunother Cancer J Immunother Cancer 2348 jimmthercanc jitc Journal for Immunotherapy of Cancer 2051-1426 BMJ Publishing Group PMC12481463 PMC12481463.1 12481463 12481463 41022529 10.1136/jitc-2025-012521 jitc-2025-012521 1 Original Research Basic and Translational Cancer Immunology 1506 Antagonism of estrogen-related receptor-α inhibits mitochondrial oxidative phosphorylation and reduces M2 macrophage infiltration in endometrial cancer https://orcid.org/0000-0002-8633-2422 Ma Jincheng 1 2 0 https://orcid.org/0000-0001-8242-914X Mao Xiaodan 1 3 * 0 https://orcid.org/0000-0002-2740-2929 Ren Yuan 1 3 0 https://orcid.org/0000-0003-2157-0574 Lin Xite 1 3 Wu Qibin 1 4 Zhang Maotong 1 3 https://orcid.org/0000-0002-8754-9105 Ye Jingxuan 1 3 Xu Shuxia 5 Su Pingping 6 Chen Gang 7 https://orcid.org/0000-0003-2469-1638 Sun Chaoyang 7 Mustea Alexander 8 https://orcid.org/0000-0002-5072-6091 Sun Pengming 1 3 4 1 Fujian Clinical Research Center for Gynecological Oncology Fujian Maternity and Child Health Hospital, College of Clinical Medicine for Obstetrics & Gynecology and Pediatrics, Fujian Medical University Fuzhou Fujian China 2 Department of Gynecology Qingdao Hospital, University of Health and Rehabilitation Sciences（Qingdao Municipal Hospital） Qingdao Shandong China 3 Laboratory of Gynecologic Oncology Fujian Maternity and Child Health Hospital, College of Clinical Medicine for Obstetrics & Gynecology and Pediatrics, Fujian Medical University Fuzhou Fujian China 4 Department of Gynecology Fujian Maternity and Child Health Hospital, College of Clinical Medicine for Obstetrics & Gynecology and Pediatrics, Fujian Medical University Fuzhou Fujian China 5 Department of Pathology Fujian Maternity and Child Health Hospital, College of Clinical Medicine for Obstetrics & Gynecology and Pediatrics, Fujian Medical University Fuzhou Fujian China 6 Department of Obstetrics and Gynecology Women and Children's Hospital, School of Medicine, Xiamen University Xiamen China 7 Department of Obstetrics and Gynecology Tongji Hospital, Tongji Medical College, Huazhong University of Science and Technology Wuhan China 8 Department of Gynaecology and Gynaecological Oncology University Hospital Bonn Bonn NRW Germany Supplemental material This content has been supplied by the author(s). It has not been vetted by BMJ Publishing Group Limited (BMJ) and may not have been peer-reviewed. Any opinions or recommendations discussed are solely those of the author(s) and are not endorsed by BMJ. BMJ disclaims all liability and responsibility arising from any reliance placed on the content. Where the content includes any translated material, BMJ does not warrant the accuracy and reliability of the translations (including but not limited to local regulations, clinical guidelines, terminology, drug names and drug dosages), and is not responsible for any error and/or omissions arising from translation and adaptation or otherwise. Supplement: https://doi.org/10.1136/jitc-2025-012521 No, there are no competing interests. Professor Pengming Sun; sunfemy@hotmail.com Dr Xiaodan Mao; maodan1985@yeah.net JM, XM and YR are joint first authors. 2025 29 9 2025 13 9 496161 e012521 13 5 2025 09 9 2025 29 09 2025 01 10 2025 01 10 2025 Copyright © Author(s) (or their employer(s)) 2025. Re-use permitted under CC BY-NC. No commercial re-use. See rights and permissions. Published by BMJ Group. 2025 https://creativecommons.org/licenses/by-nc/4.0/ This is an open access article distributed in accordance with the Creative Commons Attribution Non Commercial (CC BY-NC 4.0) license, which permits others to distribute, remix, adapt, build upon this work non-commercially, and license their derivative works on different terms, provided the original work is properly cited, appropriate credit is given, any changes made indicated, and the use is non-commercial. See http://creativecommons.org/licenses/by-nc/4.0/ Abstract Objective Endometrial cancer (EC) is a female malignancy closely linked to metabolic dysregulation. Most patients with EC exhibit poor responses to immunotherapy, underscoring the need to identify novel therapeutic targets at the intersection of metabolism and immune regulation. Methods In vitro: integrated proteomics, CUT&Tag (cleavage under targets and tag mentation) sequencing, dual-luciferase reporter assays, lipidomic profiling, and macrophage-tumor co-culture systems collectively demonstrated estrogen-related receptor (ERR) α’s dual metabolic-immunomodulatory role in KLE and HEC-1A human cell lines. Patient-derived organoids were used to validate the therapeutic efficacy of ERRα targeting. In vivo, the KLE cell xenograft model was used to evaluate tumorigenicity and therapeutic efficacy in mice. In humans, a retrospective cohort of 166 patients with EC was analyzed by immunohistochemistry (IHC) to quantify ERRα expression and macrophage infiltration, establishing clinical correlations and therapeutic implications. Spatial analysis of M2 macrophages in EC progression was performed using multiplex IHC. Results In EC cells, ERRα transcriptionally upregulates protein tyrosine phosphatase mitochondrial 1 through direct promoter binding (-624 to −609 bp). This interaction promotes cardiolipin biosynthesis, thereby stabilizing mitochondrial inner membrane ultrastructure, enhancing oxidative phosphorylation activity, and elevating reactive oxygen species (ROS) levels. Subsequently, ROS activates the NF-κB signaling axis, inducing CCL2 secretion to recruit M2 macrophages into the tumor microenvironment. Importantly, combined inhibition of ERRα (using XCT790) and CCL2 (using carlumab) significantly enhanced antitumor efficacy in EC. Additionally, ERRα expression in EC tissues may serve as a clinical indicator for disease evaluation. Conclusions This study uncovers a pivotal role of the ERRα metabolic axis in reshaping the EC immune microenvironment, providing the mechanistic evidence linking mitochondrial lipid metabolism to macrophage-driven immunosuppression. Our findings establish a theoretical foundation for developing combination therapies targeting metabolic-immune crosstalk, offering a strategy to overcome immunotherapy resistance in EC. Macrophage Mitochondria Cytokine http://dx.doi.org/10.13039/501100001809 National Natural Science Foundation of China 82203739 the Startup Fund for Scientific Research 2022QH2045 Joint Funds for the Innovation of Science and Technology 2020Y9160 2021Y9157 http://dx.doi.org/10.13039/501100012166 National Key Research and Development Program of China 2022YFC2704303 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes WHAT IS ALREADY KNOWN ON THIS TOPIC WHAT THIS STUDY ADDS We presently demonstrate that protein tyrosine phosphatase mitochondrial 1 activation in EC is directly regulated by ERRα, which binds to its promoter (−624 to –609 bp) to drive transcription. This induces cardiolipin-dependent mitochondrial reprogramming, stabilizes mitochondrial inner membrane ultrastructure, enhances oxidative phosphorylation, and increases reactive oxygen species. The resulting metabolic transformation activates NF-κB/CCL2 signaling, recruits tumor-promoting M2 macrophages, and establishes an immunosuppressive microenvironment. Critically, our findings identify ERRα and CCL2 as synergistic therapeutic targets in EC, as validated by the enhanced efficacy of combined XCT790/carlumab inhibition. HOW THIS STUDY MIGHT AFFECT RESEARCH, PRACTICE OR POLICY This study uncovers the role of ERRα in linking mitochondrial lipid metabolism to macrophage-driven immunosuppression. It paves the way for new targeted antitumor metabolism and immunotherapy, which will be beneficial for the patients with EC. Introduction The overall incidence of endometrial cancer (EC) has increased by 132% over the past three decades, with a trend towards younger age at diagnosis. 1 2 3 4 5 6 7 8 9 10 11 8 10 12 13 Recently, ERRα was found to be directly associated with tumor metabolism and immunity. 14 14 et al 15 16 17 Macrophages and lymphocytes account for a large proportion of immune cells in EC, with M2 macrophages being predominant. 15 18 19 21 22 Materials and methods Cell lines and cell culture Human KLE (American Type Culture Collection, Maryland, USA), HEC-1A (National Collection of Authenticated Cell Cultures, Shanghai, China) and THP-1 (National Collection of Authenticated Cell Cultures, Shanghai, China) cells were cultured in DMEM/F12 or McCoy’s 5A medium, both of which contained 1% penicillin-streptomycin (#15140122; Gibco) and 10% fetal bovine serum (FBS) (#10091148; Gibco, New Zealand), at 37°C in a moist atmosphere (5% CO 2 Xenograft model Female BALB/c nude mice (aged 4–5 weeks) were purchased from Zhejiang Weitong Lihua Experimental Animal Technology (Charles River). The ovERRα, siERRα, ovPTPMT1, siPTPMT1, and normal control (NC) KLE cells were generated via lentiviral transduction and subsequently injected into nude mice to establish a KLE cell line-derived xenograft (CDX) model for analyzing subcutaneous tumor formation. For the treatment group, the KLE cell line was transplanted into the forelimb armpit of female BALB/c mice. The mice were injected intraperitoneally with physiological saline, carlumab (20 mg/kg), XCT790 (4 mg/kg) or carlumab (20 mg/kg) + XCT790 (4 mg/kg). The tumor size was measured every 3 days, and the tumor volume was calculated using the following formula: tumor volume=(length×width 2 Participants and specimens This retrospective study included 218 patients who underwent an initial hysterectomy for EC with immunohistochemical pathology at Fujian Provincial Maternity and Children’s Hospital from 2013 to 2018. The exclusion criteria were as follows: patients who were receiving chemotherapy, radiotherapy or immunotherapy before surgery (n=31); patients with other malignant tumors (n=11); and patients without sufficient cancerous tissue to obtain a pathological wax-embedded mass (n=10). After applying these criteria, 166 patients were ultimately included in this study. Pathological and clinical data were obtained from the hospital. Additionally, we enrolled six female donors who provided peripheral venous blood for establishing in vitro peripheral blood mononuclear cell (PBMC) and EC tumor cell co-culture systems to perform transwell migration assays. This study was approved by the Ethics Committee of Fujian Maternal and Child Health Hospital (No. 2023KY117). Bioinformatics data analysis ESRRA, CD11b, CD68, CD80, CD86, CD115, and CD163 expression levels and clinical information for the EC cohort were obtained from the UCSC Xena database and The Cancer Genome Atlas (TCGA) database ( https://portal.gdc.cancer.gov/ 23 https://www.cancer.gov/ccg/research/genome-sequencing/tcga ELISA assay CCL2, fractalkine, and eotaxin levels in ECC culture supernatant from different groups were measured using ELISA kits (RK00052, RK10110, RK10020, ABclonal, Wuhan, China) following the manufacturer’s instructions. Three independent experiments were conducted, each with three technical replicates. Use the same method to detect the levels of CCL2 in the serum of mice in different groups (RK00381, ABclonal, Wuhan, China). Each group contained five mice, with three technical replicates conducted per mouse. Macrophage chemotaxis assay THP-1 cells were seeded in the upper chamber of a 6-well transwell culture chamber with an 8 µm pore size. Culture medium containing 100 ng/mL phorbol ester (Phorbol-12-myristate-13-acetate, PMA) was added and incubated with the cells for 24 hours to induce the production of M0 macrophages. In parallel, peripheral blood (20 mL) was collected from six healthy adult female donors into anticoagulant tubes, respectively. PBMCs were isolated according to the SepMate protocol, counted, and seeded in 6-well plates at a density of 4×10⁶ cells/well. Following overnight incubation, the supernatant was discarded and replaced with Roswell Park Memorial Institute (RPMI)-1640 medium containing 10% FBS and 20 ng/mL Macrophage Colony Stimulating Factor (M-CSF) to induce monocyte-to-macrophage differentiation. Medium was refreshed every 3 days. After 6 days of culture, adherent cells were confirmed as M0 macrophages. Two source-derived M0 macrophages were subsequently cultured in medium supplemented with lipopolysaccharide (100 ng/mL) and interferon gamma (20 ng/mL) for 48 hours to induce M1 polarization. M0-type macrophages were cultured in medium supplemented with interleukin-4 (20 ng/mL) and interleukin-13 (20 ng/mL) for 48 hours to induce M2 polarization. The upper chamber of a new 6-well plate was filled with macrophages (#3428, Corning, New York, USA). ECCs were seeded in the lower chamber and cultured in a 37°C cell culture incubator for 24 hours. During drug treatment, the ECCs were treated with 5 mM N-acetyl-L-cysteine or 5 µg/mL carlumab for 24 hours. The transwell chamber was removed, and the cells in the upper chamber were gently removed with a cotton swab. Then, the cells that had migrated were fixed with 4% paraformaldehyde for 20–30 min. The cells were washed three times with phosphate-buffered saline (PBS), stained with 0.1% crystal violet for 5–10 min, then rinsed three times with PBS. After complete drying in air, five fields of view were selected for observation, and the cells were counted under a microscope (Olympus, Tokyo, Japan). Three independent experiments were conducted. Cytokine array Supernatants from ECCs cultured under different experimental conditions (KLE -NC -ovERRα -ovPTPMT1 -NC -ovERRα -ovPTPMT1 Intracellular reactive oxygen species detection Intracellular reactive oxygen species (ROS) formation was assessed using a DCFDA/H2DCFDA Cellular ROS Assay Kit (ab113851; Abcam, USA) according to the manufacturer’s instructions. The fluorescence intensity in cells (KLE -NC -ovERRα -siERRα -ovPTPMT1 -siPTPMT1 -NC -ovERRα -siERRα -ovPTPMT1 -siPTPMT1 Mitochondrial cardiolipin assay 10-N-nonyl acridine orange (45 µM) was added to the ECCs, which were incubated for 15 min at 37°C. Cells were washed two times with 10 mM Tris/HCl (pH=7). The red fluorescence of 10-N-nonyl acridine orange bound to the ECCs was measured at 640 nm. High-magnification images (1,000×) were captured using a laser scanning confocal microscope, and the fluorescence intensity was analyzed by ImageJ. For each experimental group, five fields of view were randomly selected and analyzed across three independent experiments. Lipidomic Liquid chromatography (LC)-mass spectrometry analyses were performed using a high-performance LC system (Series 1260; Agilent Technologies, USA) coupled with a triple quadrupole mass spectrometer (Agilent 6460; Agilent Technologies, USA). ECC lines (KLE -NC -ovERRα -ovPTPMT1 -NC -ovERRα -ovPTPMT1 -NC -ovERRα -ovPTPMT1 -NC -ovERRα -ovPTPMT1 Tandem mass tag labeling proteomics The total proteins were extracted from KLE cells treated with or without 10 µM XCT790 for 24 hours and evaluated via sodium dodecyl sulfate-polyacrylamide gel electrophoresis and staining. Briefly, the cells were first lysed. Sequencing-grade modified trypsin (Promega, Madison, Wisconsin, USA) was used to digest the proteins, and the resulting peptide mixture was labeled with a TMT kit (Thermo Fisher Scientific, USA). After desalination, high-pH HPLC was used for separation. The protein fractions were subsequently analyzed via online electrospray tandem mass spectrometry. Differentially expressed proteins were selected according to the fold changes and p values. Western blotting Standard techniques were used for protein quantification, separation, transfer, and blotting of lysates from KLE and HEC-1A cells. Primary antibodies against the following proteins were used: ERRα (1:500, ab76228, Abcam, London, UK), PTPMT1 (1:500; 11493–1-AP, Proteintech, Wuhan, China), CCL2 (1:500, ab214819, Abcam, London, UK), NF-κB1 p50 (1:1000, 12540S, CST, USA), NF-κB1 p65 (1:1000, 8242S, CST, USA) and GAPDH (1:2000; YM3029, AB_2692314, Immunoway, USA). GAPDH served as a loading control. The gray value analysis was performed using ImageJ, and GraphPad Prism was used for statistical analysis and graphing. Three independent experiments were conducted. Reverse transcription-quantitative polymerase chain reaction (RT-qPCR) ECCs (KLE and HEC-1A) were collected after gene expression regulation or drug treatment (specific grouping is described in the Results section). Cells were lysed directly in a culture dish for RNA extraction. After thorough vortexing, the lysates were centrifuged and the supernatant was transferred to a new tube. Then, 0.25 mL of chloroform was added to each 1 mL of RNA extraction mixture. Following centrifugation, the upper aqueous phase was transferred to a fresh tube. The RNA was precipitated with isopropyl alcohol. The RNA was washed with 75% ethanol. First-strand complementary DNA was synthesized using PCR Master Mix (#A2791, Promega, Madison, USA). PCR amplification was performed using Eastep QPCR Master Mix (#LS2062; Promega, Madison, USA). Relative gene expression was calculated using the 2 −ΔΔCt Cell Mito Stress Test The oxygen consumption rate was determined using a Seahorse XF Cell Mito Stress Test Kit (#103015–100; Agilent Technologies, USA). Two cell lines (KLE and HEC-1A) after gene expression regulation (KLE -NC -ovERRα -siERRα -ovPTPMT1 -siPTPMT1 -ovERRα+ siPTPMT1 -NC -ovERRα -siERRα -ovPTPMT1 -siPTPMT1 -ovERRα+ siPTPMT1 ∧ 2 Transmission electron microscopy Cell pellets (HEC-1A -NC -ovERRα -siERRα -ovPTPMT1 -siPTPMT1 Luciferase reporter assays Using the UCSC database, we found that ESRRA can bind to the promoter region of PTPMT1 and transcribe it. The JASPAR database ( https://jaspar.genereg.net/analysis Cleavage under targets and tag mentation, library preparation, sequencing and data analysis CUT&Tag (cleavage under targets and tag mentation) (N259-YH01; Novoprotein, Jiangsu, China) assays were performed using the standard technique. Briefly, the cells were bound to concanavalin A-coated magnetic beads, and the cell membranes were permeabilized with digitonin. The enzyme pA-Tn5 transposase precisely binds to the DNA sequence near the target protein under antibody guidance and results in factor-targeted tag mentation. The DNA sequence was tagmented, with adapters added simultaneously at both ends, which were enriched by PCR to form sequencing-ready libraries. After PCR, the libraries were purified with AMPure beads, and the library quality was assessed on an Agilent Bioanalyzer 2100 system. After sequencing and QC, the reads were mapped to the reference genome. ChIPseeker was used to retrieve the nearest genes around the peak and annotate the genomic region of the peak. ChIPseeker was used to identify genes related to the peak. Immunohistochemical staining For the population-based studies, endometrial cancer tissues from 166 patients were analyzed. For in vivo experiments, tumor tissues were collected across experimental cohorts (including gene regulation and drug treatment groups; n=5 mice/group), as detailed in the Results section. Mice were euthanized when statistically significant differences in tumor volume were observed, and tumor tissues were collected for analysis. Immunohistochemical staining was performed according to standard procedures with the following primary antibodies: rabbit polyclonal anti-ERRα (1:100; #ab137489; Abcam, London, UK), anti-PTPMT1 (1:100; 11493–1-AP; Proteintech, Wuhan, China), anti-CCL2 (1:50; ab283927; Abcam, London, UK), anti-CD115 (1:100; 25949–1-AP; Proteintech, Wuhan, China) and anti-CD163 (1:50; ab182422; Abcam, London, UK). Three low-magnification images (100×) were randomly selected under the microscope. The scores for strong staining, moderate staining, weak staining, and negative staining were 3, 2, 1 and 0, respectively, according to the degree of positive staining. The proportion of stained cells was divided into 76%–100%, 51%–75%, 26%–50%, and 0–25%, and the corresponding scores were 4, 3, 2 and 1 points, respectively. The product of the intensity and percentage of positively stained cells was used to calculate the immunohistochemical score for each sample. The samples were divided into four groups based on their immunoreactive scores: 0, negative (−); 1–4, weakly positive (+); 5–8, positive (++); and 9–12, strongly positive (+++). For immune cells, five high-magnification images (400×) were selected and counted under a microscope. Multiplex immunohistochemistry Multiplex immunohistochemistry (mIHC) was performed on 4 μm thick formalin-fixed, paraffin-embedded tumor tissue sections using a tyramide signal amplification (TSA)-based 6-color fluorescence system (abs50015-100T, Absin Bioscience, Shanghai). Following deparaffinization in xylene and rehydration through graded ethanol series, heat-induced epitope retrieval was conducted in citrate buffer (pH 6.0) at 90°C for 15 min using microwave irradiation (20% power). The staining procedure involved sequential cycles of primary antibody incubation (30 min at room temperature), Horseradish Peroxidase (HRP)-conjugated secondary antibody treatment (abs50015-02, Absin Bioscience; 10 min), and tyramide-fluorophore conjugate development (10 min), with microwave-based antibody stripping between each cycle. Antibody/fluorophore combinations included rabbit polyclonal anti-ERRα (#ab137489; Abcam, London, UK) with TSA 780, anti-PTPMT1 (11493–1-AP; Proteintech, Wuhan, China) with TSA 480, anti-CCL2 (ab283927; Abcam, London, UK) with TSA 570, anti-CD115 (25949–1-AP; Proteintech, Wuhan, China) with TSA 620 and anti-CD163 (ab182422; Abcam, London, UK) with TSA 520. Finally, nuclei were counterstained with DAPI (abs47047616, Absin Bioscience) and slides were mounted with anti-fade medium. Whole slide images were acquired using a Pannoramic MIDI II digital slide scanner (3DHISTECH) and analyzed with Indica HALO platform for quantitative assessment of fluorescence intensity and cellular localization. Organoids Fresh tumor tissues from three patients with EC were obtained surgically, rinsed thoroughly with Dulbecco's Phosphate-Buffered Saline (DPBS) containing antibiotics, minced extensively using sterile surgical scissors, and transferred to a 15 mL conical tube containing tissue digestion solution (Dulbecco's Modified Eagle Medium (DMEM) basal medium supplemented with collagenase, dispase, and 10 µM Y-27632). The mixture was digested with gentle agitation at 37°C until no obvious tissue pellets remained. Digestion was terminated by adding DMEM supplemented with 5% FBS. The solution was filtered through a 100 µm cell strainer to remove debris, centrifuged at 200×g for 5 min at 4°C, and the supernatant was discarded. Cell pellets were gently resuspended in organoid culture medium, mixed with Matrigel at a 1:3 (v/v) ratio, and seeded in pre-warmed 24-well plates. The plates were incubated at 37°C with 5% CO₂ for 15–30 min to allow Matrigel polymerization. After polymerization, 400 µL of organoid culture medium was added to each well for continuous culture. The medium was changed every 3–4 days, and organoid growth was regularly observed and recorded. Three independent experiments were conducted per patient, each experiment with three technical replicates. Statistics and reproducibility SPSS V.23.0 software (IBM SPSS, Armonk, New York, USA), ImageJ, and FlowJo were used for statistical analyses, and GraphPad Prism 8 and R were used to create graphs. The statistical tests used for the results presented in each figure are indicated in the figure legend. All samples represent biological replicates, and the number is mentioned in the corresponding figure legend. The experiments were repeated independently with similar results to demonstrate reproducibility. No statistical method was used to predetermine the sample size. No data were excluded from the analyses. The experiments were not randomized. The investigators were not blinded to the group allocation during the experiments or outcome assessments. Results ERRα promotes M2 macrophage infiltration and is associated with poor prognosis in patients with EC Our previous studies revealed that ERRα is strongly associated with EC progression, 4 14 Online supplemental figure 1 24 25 figure 1A–D figure 1E–F figure 1G figure 1H–I figure 1J figure 1K–P online supplemental figure 1B online supplemental figure 2A-B figure 1Q–T figure 1U–V figure 1U–V figure 1Q–T figure 1W–Y Figure 1 ERRα promotes M2 macrophage infiltration and correlates with poor prognosis in EC. ( A–B C–D E–F G H–J K–P Q–R S–T U–V W X–Y PTPMT1 is the target gene of ERRα and is required for promoting M2 chemotaxis Quantitative proteomic analysis was conducted in KLE ECCs to explore how ERRα regulates M2 macrophage infiltration. The following criteria were applied: a p value<0.1 with fold change (FC)>1.3 for upregulated proteins and FC<0.7 for downregulated proteins. A total of 14 differentially expressed proteins were identified, including 5 upregulated (DDRGK1, TXNDC12, IFRD1, RSRC2, and APLP2), and 9 downregulated proteins (MRPS2, UCK2, PTPMT1, NUCB1, KIF20A, PPL, HMGCS1, ACSS2, and S100A6). A previous study has shown that ERRα is involved in multiple mitochondrial metabolic pathways. 5 7 figure 2A figure 2B–F figure 2G–H figure 2I–J figure 2K–L figure 2M–N Figure 2 ERRα regulates PTPMT1 to drive M2 macrophage chemotaxis. ( A B–C D–F G–H I–J K L M–N The ERRα-PTPMT1 axis activates mitochondrial OXPHOS and recruits M2 macrophages in an ROS-dependent manner To explore the pathways involved in ERRα/PTPMT1-mediated M2 macrophage chemotaxis, we identified the top 150 ESRRA-associated or PTPMT1-associated genes through Spearman correlations analysis of combined RNA sequencing and ChIP-seq datasets. Subsequent KEGG pathway analysis using the signature search (ARCHS4) database revealed OXPHOS as the top comprehensive score pathway (excluding disease pathways) for both genes ( figure 3A–B figure 3C–F figure 3C–F figure 3G‒P figure 3Q‒R Figure 3 The ERRα-PTPMT1 axis promotes M2 macrophage recruitment via ROS-dependent mitochondrial OXPHOS activation. ( A–B C–F -NC -NC G–L -NC -NC M–P -NC -NC Q–R ERRα-mediated increase in CL levels is partially dependent on PTPMT1 Next, to investigate the regulatory effect of ERRα on CL levels — 26 -NC -ovERRα -ovPTPMT1 -NC -ovERRα -ovPTPMT1 figure 4A figure 4B -ovERRα -ovPTPMT1 figure 4C–D -ovERRα -ovPTPMT1 figure 4E–F figure 4G 27 figure 4H figure 4I Figure 4 The ERRα-PTPMT1 axis affects the CL levels and mitochondrial structure. ( A B -NC -NC C–F -NC -NC G H -NC -NC I J–L M CL-specific 10-N-nonyl acridine orange staining and laser confocal microscopy revealed that ECCs overexpressing either ERRα (ovERRα) or PTPMT1 (ovPTPMT1) exhibited significantly enhanced CL fluorescence intensity, while those with ERRα or PTPMT1 knockdown (siERRα and siPTPMT1) showed markedly reduced CL fluorescence intensity. Additionally, we observed that while CL fluorescence intensity in the ovERRα+siPTPMT1 group remained significantly higher than in the NC group, it was significantly reduced compared with the ovERRα-only group ( figure 4J– In addition to affecting mitochondrial function, changes in CL levels also affect mitochondrial morphology. 26 figure 4M 26 ROS production mediated by the ERRα-PTPMT1 axis promotes CCL2 secretion via the NF-κB pathway To further investigate the mechanism by which ERRα/PTPMT1 signaling regulates macrophage chemotaxis, we performed cytokine microarray assays on ovERRα, ovPTPMT1 and control (NC) ECCs in both KLE and HEC-1A ECC lines. We found that three kinds of cytokines (fractalkine, eotaxin, and CCL2) were significantly increased in both the ovERRα and ovPTPMT1 groups compared with the NC group ( figure 5A–B figure 5C–D figure 5E–F online supplemental figure 2C figure 5G–H Figure 5 Reactive oxygen species promote CCL2 secretion via the NF-κB pathway. ( A B C–D E–F G–H I–L M–N O–T Additionally, previous studies have shown that ROS regulate cellular CCL2 secretion through the NF-κB pathway. 28 figure 5I–L figure 5M‒N figure 5O–T Combination of carlumab and XCT790 inhibits tumor growth and progression We previously constructed a KLE CDX model in tumor-bearing mice. 29 -ovERRα -siERRα -ovPTPMT1 -siPTPMT1 -ovERRα -ovPTPMT1 -siERRα -siPTPMT1 figure 6A–B figure 6C–G -ovERRα -ovPTPMT1 online supplemental figure 3A -NC figure 6H–I figure 6J–N online supplemental figure 3B figure 6O Figure 6 Combined treatment with carlumab and XCT790 suppresses tumor growth and progression. ( A–B -NC C–G H–I -NC J–N O -NC P Q R–S To better mimic in vivo conditions, a three-dimensional organ-like model (EC-derived organoids) was established to evaluate drug efficacy. EC organoids were treated with carlumab (80 µg/mL), XCT790 (20 µM), or a combination of both (80 µg/mL carlumab+20 µMXCT790). Morphological analysis revealed that treatment with carlumab or XCT790 alone significantly reduced organoid size (shrinkage) compared with the untreated control group. In contrast, the carlumab+XCT790 combination not only induced shrinkage but also led to further morphological changes, including apoptosis and hollow vesicle formation ( figure 6P figure 6Q figure 6R,S Clinical association of ERRα-PTPMT1-M2 macrophage signaling with the progression of EC in patients A total of 166 patients with EC were included in the analysis. Detailed clinical information of the EC cohort is presented in online supplemental tables 1,2 online supplemental tables 1 and 2 figure 7A figure 7B–F online supplemental table 1 figure 7G–K figure 7L–O figure 7P online supplemental figure 3C figure 7Q 2 2 2 2 2 online supplemental figure 3D-H online supplemental figure 3I-J figure 7R–T Figure 7 ERRα-PTPMT1 expression and M2 macrophages in clinical patients with EC. ( A B–F 2 G–K 2 L M–O P Q R–T Discussion Tumors alter their energy metabolism to meet increasing bioenergetic demands and maintain proliferation. 30 31 32 33 14 ERRα is involved in mitochondrial OXPHOS as a transcription factor. 34 et al 4 35 27 36 38 39 et al 40 41 28 42 43 44 CCL2 plays a role in tumor development by recruiting TAMs and can be used as a therapeutic target. Preclinical animal studies using CCL2-neutralizing antibodies or C-C motif chemokine receptor 2 (CCR2) inhibitors targeting the CCL2-CCR2 axis have shown that these agents effectively inhibit tumor growth and metastasis in patients with malignant tumors such as breast cancer, 45 46 47 48 49 29 50 14 Moreover, the lipidomic analysis revealed that CL and PG levels were significantly increased in ovERRα ECCs and ovPTPMT1 ECCs. Coincidentally, the increased CL levels in ovERRα or ovPTPMT1 ECCs mainly consisted of saturated fatty acids. CLs are important lipids that constitute the inner membrane of mitochondria, 51 52 One limitation of this study is that data from clinical patients were obtained from Fujian Maternal and Child Health Hospital. The sample size was limited, which may have led to bias in the results. For example, CA125, Ki67, estrogen receptor (ER) and progesterone receptor (PR) are known as routine indices for EC; however, their efficacy in predicting outcomes is limited in the clinic. The regulatory mechanism of the molecular pathway has not been elucidated. In this study, only a tumor-centric CCL2 analysis was performed, and macrophages were not analyzed for CCR2 or other relevant receptors, nor was macrophage activity assessed. Clinical trials of carlumab, a specific antibody for CCL2, have shown non-significant therapeutic effects and a rebound increase in CCL2 levels after the drug is stopped, and much more work is needed before XCT790 can be used in combination with carlumab for clinical treatment. In summary, we employed high-throughput assays, including proteomics, lipidomics and cytokine arrays, to show that ERRα functions as a bridge between EC metabolism and immunity in a PTPMT1-dependent manner. We elucidated the mechanism by which ERRα-PTPMT1 signaling promotes CL synthesis to improve the structure of the inner mitochondrial membrane, leading to OXPHOS activation and ROS production through the NF-κB pathway and a subsequent increase in CCL2 secretion. These results pave the way for the development of new treatments targeting tumor metabolism and immunotherapy, which will be beneficial for the treatment of patients with EC. Supplementary material 10.1136/jitc-2025-012521 online supplemental figure 1 10.1136/jitc-2025-012521 online supplemental figure 2 10.1136/jitc-2025-012521 online supplemental figure 3 10.1136/jitc-2025-012521 online supplemental table 1 10.1136/jitc-2025-012521 online supplemental file 1 Funding: Provenance and peer review: Patient consent for publication: Ethics approval: Data availability free text: References 1 Crosbie EJ Kitson SJ McAlpine JN et al Endometrial cancer Lancet 2022 399 1412 28 10.1016/S0140-6736(22)00323-3 35397864 2 Lu KH Broaddus RR Endometrial Cancer N Engl J Med 2020 383 2053 64 10.1056/NEJMra1514010 33207095 3 Gao M Sun P Wang J et al Expression of estrogen receptor-related receptor isoforms and clinical significance in endometrial adenocarcinoma Int J Gynecol Cancer 2006 16 827 33 10.1111/j.1525-1438.2006.00527.x 16681769 4 Mao X Lei H Yi T et al Lipid reprogramming induced by the TFEB-ERRα axis enhanced membrane fluidity to promote EC progression J Exp Clin Cancer Res 2022 41 28 10.1186/s13046-021-02211-2 35045880 PMC8767755 5 Li M Yu Y Xue K et al Genistein mitigates senescence of bone marrow mesenchymal stem cells via ERRα-mediated mitochondrial biogenesis and mitophagy in ovariectomized rats Redox Biol 2023 61 102649 10.1016/j.redox.2023.102649 36871183 PMC9995482 6 Ren M Phoon CKL Schlame M Metabolism and function of mitochondrial cardiolipin Prog Lipid Res 2014 55 1 16 10.1016/j.plipres.2014.04.001 24769127 7 Yu W-M Liu X Shen J et al Metabolic regulation by the mitochondrial phosphatase PTPMT1 is required for hematopoietic stem cell differentiation Cell Stem Cell 2013 12 62 74 10.1016/j.stem.2012.11.022 23290137 PMC3632072 8 Du J-X Luo Y-H Zhang S-J et al Splicing factor SRSF1 promotes breast cancer progression via oncogenic splice switching of PTPMT1 J Exp Clin Cancer Res 2021 40 171 10.1186/s13046-021-01978-8 33992102 PMC8122567 9 Wang Y Lei J Zhang S et al 4EBP1 senses extracellular glucose deprivation and initiates cell death signaling in lung cancer Cell Death Dis 2022 13 1075 10.1038/s41419-022-05466-5 36575176 PMC9794714 10 Bao MH-R Yang C Tse AP-W et al Genome-wide CRISPR-Cas9 knockout library screening identified PTPMT1 in cardiolipin synthesis is crucial to survival in hypoxia in liver cancer Cell Rep 2021 34 108676 10.1016/j.celrep.2020.108676 33503428 11 Huang X-D Xiao F-J Guo Y-T et al Protein tyrosine phosphatase 1 protects human pancreatic cancer from erastin-induced ferroptosis Asian J Surg 2022 45 2214 23 10.1016/j.asjsur.2021.11.048 35000852 12 Griveau A Devailly G Eberst L et al The PLA2R1-JAK2 pathway upregulates ERRα and its mitochondrial program to exert tumor-suppressive action Oncogene 2016 35 5033 42 10.1038/onc.2016.43 27041564 13 Feng Z Zhang X Zhou J et al An in vitro-transcribed circular RNA targets the mitochondrial inner membrane cardiolipin to ablate EIF4G2 + + Nat Cancer 2024 5 30 46 10.1038/s43018-023-00650-8 37845485 14 Sahu A Wang X Munson P et al Discovery of Targets for Immune-Metabolic Antitumor Drugs Identifies Estrogen-Related Receptor Alpha Cancer Discov 2023 13 672 701 10.1158/2159-8290.CD-22-0244 36745048 PMC9975674 15 Ren X Liang J Zhang Y et al Single-cell transcriptomic analysis highlights origin and pathological process of human endometrioid endometrial carcinoma Nat Commun 2022 13 6300 10.1038/s41467-022-33982-7 36273006 PMC9588071 16 Ren F Wang L Wang Y et al Single-cell transcriptome profiles the heterogeneity of tumor cells and microenvironments for different pathological endometrial cancer and identifies specific sensitive drugs Cell Death Dis 2024 15 571 10.1038/s41419-024-06960-8 39112478 PMC11306564 17 Mirza MR Chase DM Slomovitz BM et al Dostarlimab for Primary Advanced or Recurrent Endometrial Cancer N Engl J Med 2023 388 2145 58 10.1056/NEJMoa2216334 36972026 18 Cassetta L Pollard JW A timeline of tumour-associated macrophage biology Nat Rev Cancer 2023 23 238 57 10.1038/s41568-022-00547-1 36792751 19 Espinosa I José Carnicer M Catasus L et al Myometrial invasion and lymph node metastasis in endometrioid carcinomas: tumor-associated macrophages, microvessel density, and HIF1A have a crucial role Am J Surg Pathol 2010 34 1708 14 10.1097/PAS.0b013e3181f32168 20962622 20 Jing X Peng J Dou Y et al Macrophage ERα promoted invasion of endometrial cancer cell by mTOR/KIF5B-mediated epithelial to mesenchymal transition Immunol Cell Biol 2019 97 563 76 10.1111/imcb.12245 30779215 21 Kübler K Ayub TH Weber SK et al Prognostic significance of tumor-associated macrophages in endometrial adenocarcinoma Gynecol Oncol 2014 135 176 83 10.1016/j.ygyno.2014.08.028 25173585 22 Yuk J-M Kim TS Kim SY et al Orphan Nuclear Receptor ERRα Controls Macrophage Metabolic Signaling and A20 Expression to Negatively Regulate TLR-Induced Inflammation Immunity 2015 43 80 91 10.1016/j.immuni.2015.07.003 26200012 23 The Cancer Genome Atlas Research Network Erratum: Integrated genomic characterization of endometrial carcinoma Nature New Biol 2013 500 242 10.1038/nature12325 PMC3704730 23636398 24 Murray PJ Macrophage Polarization Annu Rev Physiol 2017 79 541 66 10.1146/annurev-physiol-022516-034339 27813830 25 Gentek R Molawi K Sieweke MH Tissue macrophage identity and self-renewal Immunol Rev 2014 262 56 73 10.1111/imr.12224 25319327 26 Kameoka S Adachi Y Okamoto K et al Phosphatidic Acid and Cardiolipin Coordinate Mitochondrial Dynamics Trends Cell Biol 2018 28 67 76 10.1016/j.tcb.2017.08.011 28911913 PMC5742555 27 Chen Z Zhu S Wang H et al PTPMT1 Is Required for Embryonic Cardiac Cardiolipin Biosynthesis to Regulate Mitochondrial Morphogenesis and Heart Development Circulation 2021 144 403 6 10.1161/CIRCULATIONAHA.121.054768 34339306 PMC8340985 28 Asehnoune K Strassheim D Mitra S et al Involvement of reactive oxygen species in Toll-like receptor 4-dependent activation of NF-kappa B J Immunol 2004 172 2522 9 10.4049/jimmunol.172.4.2522 14764725 29 Su P Mao X Ma J et al ERRα promotes glycolytic metabolism and targets the NLRP3/caspase-1/GSDMD pathway to regulate pyroptosis in endometrial cancer J Exp Clin Cancer Res 2023 42 274 10.1186/s13046-023-02834-7 37864196 PMC10588109 30 Hanahan D Weinberg RA Hallmarks of cancer: the next generation Cell 2011 144 646 74 10.1016/j.cell.2011.02.013 21376230 31 Biswas SK Metabolic Reprogramming of Immune Cells in Cancer Progression Immunity 2015 43 435 49 10.1016/j.immuni.2015.09.001 26377897 32 Kuntz EM Baquero P Michie AM et al Targeting mitochondrial oxidative phosphorylation eradicates therapy-resistant chronic myeloid leukemia stem cells Nat Med 2017 23 1234 40 10.1038/nm.4399 28920959 PMC5657469 33 Kim SH Li M Trousil S et al Phenformin Inhibits Myeloid-Derived Suppressor Cells and Enhances the Anti-Tumor Activity of PD-1 Blockade in Melanoma J Invest Dermatol 2017 137 1740 8 10.1016/j.jid.2017.03.033 28433543 34 Victorino VJ Barroso WA Assunção AKM et al PGC-1β regulates HER2-overexpressing breast cancer cells proliferation by metabolic and redox pathways Tumour Biol 2016 37 6035 44 10.1007/s13277-015-4449-0 26602383 35 Houtkooper RH Vaz FM Cardiolipin, the heart of mitochondrial metabolism Cell Mol Life Sci 2008 65 2493 506 10.1007/s00018-008-8030-5 18425414 PMC11131844 36 Wei C Yang C Wang S et al Crosstalk between cancer cells and tumor associated macrophages is required for mesenchymal circulating tumor cell-mediated colorectal cancer metastasis Mol Cancer 2019 18 64 10.1186/s12943-019-0976-4 30927925 PMC6441214 37 Tsaur I Rutz J Makarević J et al CCL2 promotes integrin-mediated adhesion of prostate cancer cells in vitro World J Urol 2015 33 1051 6 10.1007/s00345-014-1389-z 25179012 38 Kitamura T Qian B-Z Soong D et al CCL2-induced chemokine cascade promotes breast cancer metastasis by enhancing retention of metastasis-associated macrophages J Exp Med 2015 212 1043 59 10.1084/jem.20141836 26056232 PMC4493415 39 Wang L Zheng W Zhang S et al Expression of monocyte chemotactic protein-1 in human endometrial cancer cells and the effect of treatment with tamoxifen or buserelin J Int Med Res 2006 34 284 90 10.1177/147323000603400307 16866022 40 Peña CG Nakada Y Saatcioglu HD et al LKB1 loss promotes endometrial cancer progression via CCL2-dependent macrophage recruitment J Clin Invest 2015 125 4063 76 10.1172/JCI82152 26413869 PMC4639978 41 Obr AE Kumar S Chang Y-J et al Insulin-like growth factor receptor signaling in breast tumor epithelium protects cells from endoplasmic reticulum stress and regulates the tumor microenvironment Breast Cancer Res 2018 20 138 10.1186/s13058-018-1063-2 30458886 PMC6245538 42 Méndez-Samperio P Pérez A Alba L Reactive oxygen species-activated p38/ERK 1/2 MAPK signaling pathway in the Mycobacterium bovis bacillus Calmette Guérin (BCG)-induced CCL2 secretion in human monocytic cell line THP-1 Arch Med Res 2010 41 579 85 10.1016/j.arcmed.2010.10.009 21199725 43 Singh S Anshita D Ravichandiran V MCP-1: Function, regulation, and involvement in disease Int Immunopharmacol 2021 101 107598 10.1016/j.intimp.2021.107598 34233864 PMC8135227 44 Ueno T Toi M Saji H et al Significance of macrophage chemoattractant protein-1 in macrophage recruitment, angiogenesis, and survival in human breast cancer Clin Cancer Res 2000 6 3282 9 10955814 45 Qian B-Z Li J Zhang H et al CCL2 recruits inflammatory monocytes to facilitate breast-tumour metastasis Nature New Biol 2011 475 222 5 10.1038/nature10138 PMC3208506 21654748 46 Bonapace L Coissieux M-M Wyckoff J et al Cessation of CCL2 inhibition accelerates breast cancer metastasis by promoting angiogenesis Nature New Biol 2014 515 130 3 10.1038/nature13862 25337873 47 Loberg RD Ying C Craig M et al CCL2 as an Important Mediator of Prostate Cancer Growth In Vivo through the Regulation of Macrophage Infiltration Neoplasia 2007 9 556 62 10.1593/neo.07307 17710158 PMC1939930 48 Li X Yao W Yuan Y et al Targeting of tumour-infiltrating macrophages via CCL2/CCR2 signalling as a therapeutic strategy against hepatocellular carcinoma Gut 2017 66 157 67 10.1136/gutjnl-2015-310514 26452628 49 Zhao L Lim SY Gordon-Weeks AN et al Recruitment of a myeloid cell subset (CD11b/Gr1 mid) via CCL2/CCR2 promotes the development of colorectal cancer liver metastasis Hepatology 2013 57 829 39 10.1002/hep.26094 23081697 50 Mao X Dong B Gao M et al Dual targeting of estrogen receptor α and estrogen-related receptor α: a novel endocrine therapy for endometrial cancer Onco Targets Ther 2019 12 6757 67 10.2147/OTT.S216146 31686835 PMC6709363 51 Falabella M Vernon HJ Hanna MG et al Cardiolipin, Mitochondria, and Neurological Disease Trends in Endocrinology & Metabolism 2021 32 224 37 10.1016/j.tem.2021.01.006 33640250 PMC8277580 52 Arellano H Nardello-Rataj V Szunerits S et al Saturated long chain fatty acids as possible natural alternative antibacterial agents: Opportunities and challenges Adv Colloid Interface Sci 2023 318 102952 10.1016/j.cis.2023.102952 37392663 Data availability statement Data are available upon reasonable request. ",
  "metadata": {
    "Title of this paper": "Saturated long chain fatty acids as possible natural alternative antibacterial agents: Opportunities and challenges",
    "Journal it was published in:": "Journal for Immunotherapy of Cancer",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481463/"
  }
}