{
  "title": "Paper_272",
  "abstract": "pmc BMC Public Health BMC Public Health 63 bmcph BMC Public Health 1471-2458 BMC PMC12487278 PMC12487278.1 12487278 12487278 41029598 10.1186/s12889-025-23875-x 23875 1 Systematic Review News media coverage of the U.S. social safety net: themes and gaps from a scoping review Gollust Sarah E. sgollust@umn.edu 1 Nelson Quin Mudry 1 Crane Carson 1 Murad Yusra 1 E. Tait Margaret 2 1 https://ror.org/017zqws13 grid.17635.36 0000000419368657 Division of Health Policy and Management, University of Minnesota School of Public Health, 2 https://ror.org/03y71xh61 grid.267065.0 0000 0000 9609 8938 Department of Health Studies, University of Richmond, 30 9 2025 2025 25 478168 3163 13 5 2024 4 7 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Background The social safety net, the set of policies and programs designed to improve the quality of life of individuals facing periodic or persistent financial hardship, is critical to improving population health. Despite strong evidence of its importance, policy investments in the social safety net in the United States continue to face political obstacles. One important contributor to the political dynamics of issues is public opinion, which can be shaped – for better or worse – by the news media. By reporting on, interpreting, and contextualizing policy issues, the news media play a key role in shaping public understanding of social issues. Eligibility criteria In this scoping review, we summarize cross-disciplinary literature that examined news media coverage of social safety net issues ( N Results We find that news coverage often focuses on individual stories and infrequently connects to broader, systemic issues, missing the opportunity to garner public support for the social safety net. Across studies, authors seldom note the implications of their work for journalistic practice nor for health equity. Conclusions Future work should examine how population health research evidence can be shared with journalists and news producers for more comprehensive media attention to the safety net within the context of the constraints news producers face. Supplementary Information The online version contains supplementary material available at 10.1186/s12889-025-23875-x. Keywords News media Social safety net Poverty Health insurance Housing Welfare Paid family and medical leave Early childhood education http://dx.doi.org/10.13039/100000867 Robert Wood Johnson Foundation 79754 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Background Decades of research confirm the importance of the social determinants of health – including resources like income, housing, and early education – in shaping the distribution of population health in the United States [ 1 2 3 Research in population health has long suggested that the social safety net is a critical set of supports that can improve health and well-being in individuals and communities (e.g., [ 2 4 5 6 7 One important factor that contributes to the political dynamics of policy investments in the social safety net is public opinion, how the public views the policy problems, solutions, and the target populations affected by those problems. The ways the news media frame these issues can be an important influence on public perceptions and thus offer insight into the political dynamics of efforts to promote further investment into the safety net. However, empirical research on news media coverage of social issues tends to focus only on single issues, and the research is published in diverse disciplinary channels. Such fragmented dissemination of evidence limits our ability to draw conclusions about aggregate themes of news media coverage across multiple social safety net topics. When published research has diverse study designs across many topical areas, scoping reviews can be helpful to organize the evidence and characterize the extent and range of existing research [ 8 News media influence on policy The news media can influence the public’s perceptions of policy matters through two mechanisms: agenda-setting and framing. Agenda-setting refers to the process that determines which of many societal issues are those the public considers important at a given point in time. When the media devote more attention to certain issues over others, the public thinks those issues are more important [ 9 10 11 12 Framing refers to the “interpretive packages” that journalists use in presenting social issues to the public [ 13 14 15 16 16 17 Another important contribution of the news media to public perceptions of social policy issues is through the news media’s framing of social groups affected. Whether within news story text that describes which groups could benefit or be harmed, or in the images that accompany stories in print or on TV, the media contribute to the mental images that people carry about those affected by social issues [ 18 19 20 21 22 23 24 Importance of the social safety net for population health This scoping review concerns six domains of the social safety net: poverty, welfare, and social security disability insurance (SSDI); health insurance; food assistance, hunger, and nutrition; housing and homelessness; paid leave; and early childhood care and education (ECE). While a complete review of the health consequences of each of these domains is beyond the scope of this article, evidence exists that supports the contention that policy investment in each of these domains could advance overall population health and reduce health inequity [ 2 25 26 27 Study objectives When previous studies have characterized news media coverage of the social policy topics that comprise the safety net, the studies are often point-in-time assessments of a particular event (e.g., the passage of the Affordable Care Act (the ACA); a change to SNAP benefits) rather than assessments over time, and they usually examine a single policy issue. Similarly, researchers working within a particular policy space (e.g., education researchers, public health researchers) usually focus only on single domains, but the social safety net spans multiple policy arenas. A more complete understanding of the political dynamics of the U.S. social safety net thus requires assessment of media coverage across multiple issues and over time. This gap is best suited for a scoping review. Specifically, the goal of this review is to synthesize findings from past research and respond to the following questions: How has the U.S. news media communicated about a set of policies that comprise the social safety net? To what extent has the news media presented the equity implications of these social policy areas, or the concept that certain populations have and continue to face systemic and structural issues that prevent them from opportunities (e.g., improved health or better housing)? Methods We relied on frameworks for conducting scoping reviews to guide this study [ 8 28 29 8 quality 28 30 https://osf.io/uce8s/ Keyword searches Keyword searches were implemented at three time points to retrieve relevant English language articles from Google Scholar and Scopus databases: in the summer of 2020, and then refreshed in the summer of 2021 and fall of 2022 to identify newly published work. Scopus includes journals, conference proceedings, and books curated by editors. Google Scholar identifies a broader selection of literature, including non-peer-reviewed reports [ 31 Abstract review and inclusion criteria One author (MT) completed an initial screen of abstracts to assess their inclusion based on whether they had a substantive focus on media and social safety net policy. The author reviewed the first 10 pages of results ( n n Full text articles for the remaining 83 abstracts were retrieved and reviewed by a team of 4 trained research assistants. Additional exclusions were applied at this stage (see Fig. 1 Fig. 1 Flow diagram for scoping review. Figure note: Flow diagram based on PRISMA guidelines; [ 30 Data collection We created and implemented an instrument (Appendix Table 2) that trained team members used to collect data from each of the included articles, with the following fields of data collected: year of publication; number and discipline of authors; study design (i.e., qualitative, quantitative, or mixed methods); type of content analysis (i.e. human coding or machine-based); time period of included data; type of media analyzed; geography represented; main topic; whether or not the article focused on COVID-19; and the research questions assessed. During this full-text review ( n The instrument also included prompts to describe the key findings and implications for policy or practice. Research assistants independently completed these qualitative fields based on the content of the article. A separate field (“Based on your perspective as an analyst, what are the implications of this research?”) surfaced team members’ own interpretive insights. Analysis Simple descriptive statistics (frequencies) were calculated for all categorical data fields collected. For the qualitative fields, two study authors were assigned to each safety net topic and reviewed the qualitative output from the instrument. Each pair wrote up an analytic memo summarizing the key themes within a particular topic; these memos were then further synthesized as qualitative findings presented below. Results Description of studies on news media coverage of the U.S. social safety net Articles ( N JAMA, American Journal of Public Health Public Opinion Quarterly, Political Behavior Mass Communication and Society Newspaper Research Journal, Food Studies, Journal of Aging & Social Policy While study publication dates ranged from 1990 to 2022, the studies reported on news coverage published from 1960–2020, with most of the studies covering 1993–2019 (Appendix Table 3). The majority (60%) relied on mixed methods, applying quantitative content analysis but with at least some qualitative interpretation (Table 1 Table 1 Descriptive summary of included articles ( N Variable N (%) Study design Mixed 24 (60.0) Quantitative only 11 (27.5) Qualitative only 5 (12.5) Type of content analysis Human coding 35 (87.5) Both human and machine coding 4 (10.0) Machine coding 1 (2.5) Type of media Print or online 30 (75.0) TV news 7 (17.5) Magazines 5 (12.5) Other 1 (2.5) Social media 0 Entertainment media 0 Geography of media examined U.S. national 32 (80.0) Less than national/local 14 (17.5) Comparative: U.S. to another country 1 (2.5) Main topic Poverty/welfare/SSDI 14 (35.0) Health insurance/Medicaid 12 (30.0) Food assistance/hunger/nutrition 4 (10.0) Other social policy, inequality 4 (10.0) Housing/homelessness 3 (7.5) Paid leave/family leave 2 (5.0) Early childhood education 1 (2.5) Research addresses COVID-19 No 39 (97.5) Yes 1 (2.5) Numbers do not add up to 100% because many variables were “check all that apply” for any given article The most common topic represented was poverty or welfare (14 studies), followed by health insurance (12 studies). Far fewer studies focused on food assistance, other social inequality, housing, paid leave, or early childhood education. Thematic findings by safety net topic area In the content that follows, we detail the years of data and type of media analyzed across articles; key themes (Table 2 Table 2 Thematic assessment of key findings by topic area Topic ( N Time range and policy topics covered Key qualitative themes about news media content of the topic Author and year of included articles Full article details in appendix 3 Poverty/welfare ( n 1990–2017 • Pre-welfare reform • Welfare reform • Post-welfare reform Episodic versus contextual framing Target population framing, stereotypes, misperceptions, deservingness • Iyengar, S. (1990) [ 32 • Gilens, M. (1996) [ 33 • Clawson, R. and Trice, R. (2000) [ 34 • Lawrence, R. (2000) [ 35 • Schram, S.F., and Soss, J. (2001) [ 36 • Yoo, G.J. (2002) [ 37 • Luther, C., Kennedy, D., & Coomb-Orme, T. (2005) [ 38 • Dyck, J. And Hussey, L. (2008) [ 39 • Kelly, M. (2010) [ 40 • Brown, H. (2013) [ 41 • Rose, M., and Baumgartner, F.M. (2013) [ 42 • van Doorn, B. (2015) [ 43 • El-Burki, I., Porpora, D., & Reynolds, R. (2016) [ 44 • Epp, D.A. and Jennings, J.T. (2020) [ 45 Health insurance, Medicaid ( n 1996–2022 • Clinton health reform • Affordable Care Act/Obamacare • Medicaid Politicized coverage over substantive Politician sources dominate Use of values in framing (e.g., personal responsibility, compassion) Limited attention to health equity • Dorfman, L., Schauffler, H., Wilkerson, J., & Feinson, J. (1996) [ 46 • Huebner, J., Fan, D., & Finnegan, Jr., J. (1997) [ 47 • Brodie, M., Altman, D., Brady, L., & Heberling, L. (2002) [ 48 • Hopper, J. (2015) [ 49 • Kim, S–H, Tanner, A., Foster, C., & Kim, S. (2015) [ 50 • Gollust, S., Baum, L., Niederdeppe, J., Barry, C., & Fowler, E. (2017) [ 51 • Kim, S., Tanner, A., Kim, S., Foster, C., Oh, S., & Chang, J. (2017) [ 52 • Viladrich, A. (2019) [ 53 • Biswas, M. & Kim, N. (2020) [ 54 • Gollust, S., Fowler, E., & Niederdeppe, J. (2020) [ 55 • Rozier, M. & Singer, P. (2021) [ 56 • Jahng, M. & Littau, J. (2022) [ 57 Food assistance/hunger ( n 2012–2022 • SNAP • School lunches Framing matters (i.e., for introducing stigma, cueing systems thinking) Sources and political ideology shape frames in coverage Differing perspectives on the role of government in food assistance • Tolley, N. & Ibrahim, J. (2012) [ 69 • Chrisinger, B., Kinsey, E., Pavlick, E., Callison-Burch, C. (2020) [ 58 • Spruance, L., McConkie, M., Patten, E., & Goates, M. (2021) [ 70 • Mejia, P., Mahmood, H., Perez-Sanz, S., Garcia, K., & Dorfman, L. (2022) [ 59 Other social policy ( n 2002–2017 • Children’s issues • Rising healthcare costs • Racial and ethnic health disparities Framing matters for solutions Contextual information is not provided in mainstream media • Kunkel, D., Smith, S., Suding, P., & Biely, E. (2002) [ 60 • Cabrera Rasmussen, A. (2014) [ 71 • Kim, B., Lowrey, W., Buzzelli, N., & Heath, W. (2021) [ 61 • Biswas, M. & Kim, N.Y. (2022) [ 62 Housing and homelessness ( n 2010–2021 • Root causes of homelessness • Policy responses to homelessness • Structural solutions (e.g., affordable housing) Construction of homelessness as social versus individual problem Emphasis on philanthropic solutions versus structural Limited use of health sources • Best, R. (2010) [ 63 • Nixon, L., Schaff, K., Meija, P., Marvel, D., & Dorfman, L. (2019) [ 64 • Borum Chattoo, C., Young, L., Conrad, D., & Coskuntuncel, A. (2021) [ 65 Paid leave ( n 2012–2019 • Maternity leave • Paid leave, broadly Limited health equity appeals, more of a focus on gender equity • Grandy, K. (2016) [ 66 • Tait, M., Bogucki, C., Baum, L., Franklin Fowler, E., Niederdeppe, J., and Gollust, S. (2021) [ 67 Early childhood education ( n 2000 & 2003 • General (no specific policy) Superficial versus substantive coverage, neglecting full scope of benefits of ECE • McAdams, K. & Henry, T. (2006) [ 68 Poverty/welfare/SSDI Articles on this topic were published between 1990 and 2021 and included analysis of media coverage from the pre-welfare reform period (before the 1990s), the welfare reform efforts of the 1990s under the Clinton Administration (Temporary Aid to Needy Families, or TANF), and issues following this reform. Studies included content from local and national print or online newspapers and TV news. Studies also reviewed content from magazines [ 33 35 39 43 35 39 44 Many articles build on Iyengar’s work (1990) to consider whether poverty was framed as an individual or structural issue, as well as the implications for how target populations are presented [ 34 42 38 Gilens’ [ 33 33 34 38 40 41 44 37 37 36 No articles included any explicit reference to income supports and health, indicating the absence of health equity frames. In their conclusion, Clawson and Trice [ 34 45 Health insurance/Medicaid Articles within this topic were published from 1996 to 2022, covered specific policies or the topic more broadly [ 48 46 47 49 51 54 55 57 53 56 One similarity was consideration of the sources included in coverage and the resulting expertise amplified or diminished by media. Politicians were often quoted, as were interest groups such as insurers, while advocacy groups, researchers, or those representing consumers were cited less often [ 47 51 Studies revealed a Limited news media emphasis on the substance of health insurance policy, both in the 1990 s [ 48 51 54 49 51 57 55 Other studies identified the frames used by news media in stories about health care costs, health insurance, and Medicaid. One common theme was using values-based framing, such as frames of compassion and cost control used in coverage of health care for undocumented immigrants [ 53 52 50 56 Authors emphasized the medium-specific constraints of reporting on health insurance policy, such as local TV news coverage having difficulty capturing depth or equity implications [ 55 46 51 54 Food assistance, hunger, and nutrition Articles categorized in this topic area were published between 2012 to 2022 and covered the Supplemental Nutrition Assistance Program (SNAP) and school lunches. While the four articles rarely provided specific recommendations for journalists, each emphasized that media coverage of food assistance, hunger, and food security influence the public and policymaking. For example, the language used to describe programs related to food assistance have the potential to cue the need for structural change (e.g., policy as solution) or stigmatization (e.g., programs are rampant with fraud). Authors also identified differences in frames depending on the political ideology espoused by the groups speaking about or producing content. Liberal-leaning messaging is more likely to focus on the broader issues related to hunger and food insecurity, such as poverty [ 58 69 58 70 This topic area included the single article that focused on COVID-19 [ 59 59 Other social policy/inequality Articles categorized in this topic area range in publication date from 2002 to 2022 and covered topics related to children’s issues [ 60 62 71 61 62 71 61 Each of the articles noted that mainstream media sources, compared to ethnic or other alternative media, limit coverage of contextual information, whether about children’s issues [ 60 71 60 71 71 Housing/homelessness The three studies on housing and homelessness were published between 2010 to 2021, tackling issues surrounding the root causes of homelessness, policy responses to homelessness, and framing of structural considerations (e.g., affordable housing and gentrification). All studies analyzed print news content, though they differed in geographic focus: one focused on Northern California [ 64 63 65 63 From an equity perspective, news coverage that focuses on homelessness at the individual level is more likely to either dismiss racial equity or invoke racist stereotypes. Although race is rarely explicitly mentioned in news stories about housing-related public policy, race and ethnicity are often invoked in coverage of encampments, substance use, sweeps, violence, and health issues [ 64 65 65 Similar to the other topic areas, framing of homelessness and housing issues in the media also varied based on the actors who shape news narratives. For example, advocacy organizations pushing for social change often sponsor news articles that frame homelessness as a social problem, while articles triggered by research studies focus on “general-level causes and solutions,” and include more statistical evidence [ 63 64 63 63 64 News media framing of housing insecurity and homelessness in the U.S. generally fails to sufficiently discuss the intersections of different structural causes. In one analysis, nearly 9 in 10 news stories about housing insecurity focused exclusively on either homelessness, gentrification or affordable housing, leaving the relationships between these issues unaddressed [ 65 63 65 64 Paid family leave Only two articles focused on paid leave. In one, researchers analyzed local television news coverage of paid leave in the United States during 2018 and 2019 [ 67 66 Tait et al. [ 67 66 Each article detailed disparities in access to paid leave and the economic and social consequences of this disparity. The article by Tait et al. [ 67 Early childhood education and care (ECE) Only a single publication on news coverage of ECE was included. In a 2006 report, a team of researchers analyzed coverage of early childhood education (defined here as pre-kindergarten) from 23 major daily newspapers in the U.S., with the goal of exploring themes of typical coverage, as well as how newsroom standards and practices affect coverage [ 68 60 Discussion This is the first study to comprehensively examine how the U.S. news media has covered the social safety net, a set of policies and programs that address the social determinants of health, spanning 60 years of news. While the range of social problems and policies encompassed was diverse, there was significant cross-issue consistency that is useful for understanding the political dynamics. This analysis also illuminates gaps in the research literature as well as opportunities to better promote a population health lens in news reporting on these issues. Considered comprehensively, the body of literature described tensions around journalists’ depictions of these issues in an episodic and individualistic manner versus more systemic attributions of the problems, rooted in history, power, and social structures. While much of the news coverage focused on the individual-level, over time, more news coverage reported on systemic issues, although there was great variability across news outlet type and the sources that contributed those systemic perspectives. Social safety net programs – from housing supports to food programs – are often presented in the news as solutions to individual issues; the structural nature of these issues (e.g., racism, poverty) was less often discussed. Furthermore, other than in news articles about health insurance and/or racial disparities in health, considered on aggregate, neither the news articles themselves, nor the researchers studying these issues, made explicit references to health. This lack of attention to health among studies of domains that are highly relevant to the social determinants of health (such as housing, income supports, and food/hunger) indicates a persistent lack of population health expertise reaching reporters or editors who construct the news. Likewise, across all but a small selection of the sample, we observed a notable absence of health equity frames, both explicit and implicit (i.e., acknowledging systemic causes of racial health disparities). As a consequence, articles about the social safety net may obscure the structural barriers which disproportionately expose marginalized populations to health risks, reinforcing racist and stigmatizing stereotypes and dampening support for equity-oriented policy solutions. Articles lacking broad justifications for intervening and funding the social safety net – such as how it might affect health, longevity, or wellbeing of different marginalized populations – combined with a common focus on individualizing episodes and exemplars – together might contribute to some of the stasis in U.S. policy action on these issues. This scoping review also uncovered important implications related to the body of scholarship. First, the research is published in a huge range of journals across many disciplines, meaning that scholars studying news media or the social construction of social or health issues may not be familiar with extant work – even if highly relevant – as it may be published in journals with which author teams are not familiar. For instance, a sociologist may be familiar with the journal Social Problems JAMA 16 72 73 74 75 76 This scoping review has Limitations. First, our searches ended in the fall of 2022, so no studies published since then were included. In addition, we found most of the studies identified were older—with a plurality covering the 1990 s and early 2000s. By definition, this means that the studies did not address more recent media phenomena: such as increasing fragmentation of news, selection of news outlets based on partisan predispositions, declining trust in media institutions that was accelerated following the COVID-19 pandemic, the rise in digital news and social media, and use of generative AI technologies for content [ 77 Conclusions and implications for journalists Despite these studies offering rigorous analysis of journalistic practice, to our surprise, studies rarely considered the constraints that news producers face or provided explicit recommendations for journalists themselves. This suggests that journalists are not often considered the audiences of the research, with rare exceptions (e.g., [ 46 64 78 79 Supplementary information  Supplementary Material 1. Abbreviations SNAP Supplemental Nutrition Assistance Program SSDI Social Security Disability Income ACA The Affordable Care Act (more formally, the Patient Protection and Affordable Care Act) TANF Temporary Assistance for Needy Families ECE Early childhood education Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements We wish to acknowledge Christopher Prokosch, for his assistance with initial data collection and study conceptualization. We are grateful to the entire Collaborative on Media & Messaging for Health and Social Policy team. Authors’ contributions SG and MT conceptualized the study design and method. MT led the data collection process. All authors analyzed and interpreted data, contributed to the draft manuscript and revisions, and approved the submitted version. Funding This research was supported by the Robert Wood Johnson Foundation (grant no. 79754).The views expressed here do not necessarily reflect the views of the Robert Wood Johnson Foundation. Data availability The datasets used and/or analyzed during the current study are available from the corresponding author on reasonable request. Declarations Ethics approval and consent to participate Not applicable. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Braveman P Egerter S Williams DR The social determinants of health: coming of age Annu Rev Public Health 2010 32 381 398 10.1146/annurev-publhealth-031210-101218 21091195 Braveman P, Egerter S, Williams DR. The social determinants of health: coming of age. Annu Rev Public Health. 2010;32:381–98. 10.1146/annurev-publhealth-031210-101218 21091195 2. House JS Beyond obamacare: life, death, and social policy 2015 New York Russell Sage Foundation House JS. Beyond obamacare: life, death, and social policy. New York: Russell Sage Foundation; 2015. 3. Macartney S, Ghertner R. Participation in the U.S. social safety net: multiple programs, 2019. ASPE Office of the Assistant Secretary for Planning and Evaluation Research Brief; 2023. Available at: https://aspe.hhs.gov/reports/multiple-programs-2019 4. Domestic Policy Council. Office of Science and Technology Policy. The U.S. Playbook to Address Social Determinants of Health. 2023. Retrieved from: https://www.whitehouse.gov/wp-content/uploads/2023/11/SDOH-Playbook-3.pdf 5. Lobosco K, Luhby T. Here’s what’s in the bipartisan infrastructure package. CNN; 2021. Retrieved from https://www.cnn.com/2021/07/28/politics/infrastructure-bill-explained/index.html 6. Grogan CM Park S The politics of Medicaid: most Americans are connected to the program, support its expansion, and do not view it as stigmatizing Milbank Q 2017 95 4 749 782 10.1111/1468-0009.12298 29226447 PMC5723715 Grogan CM, Park S. The politics of Medicaid: most Americans are connected to the program, support its expansion, and do not view it as stigmatizing. Milbank Q. 2017;95(4):749–82. 29226447 10.1111/1468-0009.12298 PMC5723715 7. Linke Young C. New CBO estimates show 2025 reconciliation bill would have impacts similar in magnitude to 2017 ACA repeal bills. Brookings; 2025. https://www.brookings.edu/articles/new-cbo-estimates-show-2025-reconciliation-bill-would-have-impacts-similar-in-magnitude-to-2017-aca-repeal-bills/ 8. Levac D Colquhoun H O’Brien KK Scoping studies: advancing the methodology Implement Sci 2010 5 1 9 10.1186/1748-5908-5-69 20854677 PMC2954944 Levac D, Colquhoun H, O’Brien KK. Scoping studies: advancing the methodology. Implement Sci. 2010;5:1–9. 20854677 10.1186/1748-5908-5-69 PMC2954944 9. Iyengar S Kinder D News that matters 1987 Chicago University of Chicago Press Iyengar S, Kinder D. News that matters. Chicago: University of Chicago Press; 1987. 10. McCombs M Shaw D The agenda setting function of the mass media Public Opin Q 1972 36 176 187 10.1086/267990 McCombs M, Shaw D. The agenda setting function of the mass media. Public Opin Q. 1972;36:176–87. 11. Pribble JM Goldstein KM Fowler EF Greenberg MJ Noel SK Howell JD Medical news for the public to use? What’s on local TV news Am J Manag Care 2006 12 3 170 176 16524349 Pribble JM, Goldstein KM, Fowler EF, Greenberg MJ, Noel SK, Howell JD. Medical news for the public to use? What’s on local TV news. Am J Manag Care. 2006;12(3):170–6. 16524349 12. Armstrong E Carpenter D Hojnacki M Whose deaths matter? Mortality, advocacy, and attention to disease in the mass media J Health Polit Policy Law 2006 31 4 729 772 10.1215/03616878-2006-002 16971544 Armstrong E, Carpenter D, Hojnacki M. Whose deaths matter? Mortality, advocacy, and attention to disease in the mass media. J Health Polit Policy Law. 2006;31(4):729–72. 16971544 10.1215/03616878-2006-002 13. Gamson W Modigliani A Media discourse and public opinion on nuclear power: a constructionist approach Am J Sociol 1989 95 1 1 37 10.1086/229213 Gamson W, Modigliani A. Media discourse and public opinion on nuclear power: a constructionist approach. Am J Sociol. 1989;95(1):1–37. 14. Entman R Framing: toward clarification of a fractured paradigm J Commun 1993 34 4 51 58 10.1111/j.1460-2466.1993.tb01304.x Entman R. Framing: toward clarification of a fractured paradigm. J Commun. 1993;34(4):51–8. 15. Dorfman L Wallack L Woodruff K More than a message: framing public health advocacy to change corporate practices Health Educ Behav 2005 32 3 320 336 10.1177/1090198105275046 15851542 Dorfman L, Wallack L, Woodruff K. More than a message: framing public health advocacy to change corporate practices. Health Educ Behav. 2005;32(3):320–36. 15851542 10.1177/1090198105275046 16. Iyengar S Is anyone responsible? 1991 Chicago University of Chicago Press Iyengar S. Is anyone responsible? Chicago: University of Chicago Press; 1991. 17. Weiner B Perry RP Magnusson RP An attributional analysis of reactions to stigmas J Pers Soc Psychol 1988 55 5 738 746 10.1037/0022-3514.55.5.738 2974883 Weiner B, Perry RP, Magnusson RP. An attributional analysis of reactions to stigmas. J Pers Soc Psychol. 1988;55(5):738–46. 2974883 10.1037//0022-3514.55.5.738 18. Gollust SE Eboh I Barry CL Picturing obesity: analyzing the social epidemiology of obesity conveyed through US news media images Soc Sci Med 2012 74 10 1544 1551 10.1016/j.socscimed.2012.01.021 22445762 Gollust SE, Eboh I, Barry CL. Picturing obesity: analyzing the social epidemiology of obesity conveyed through US news media images. Soc Sci Med. 2012;74(10):1544–51. 22445762 10.1016/j.socscimed.2012.01.021 19. Morone J Mechanic D Rogut L Colby D Knickman J Morality, politics, and health policy Policy challenges in modern health care 2005 New Brunswick Rutgers University Press 13 25 Morone J. Morality, politics, and health policy. In: Mechanic D, Rogut L, Colby D, Knickman J, editors. Policy challenges in modern health care. New Brunswick: Rutgers University Press; 2005. p. 13–25. 20. Nelson TE Kinder DR Issue frames and group-centrism in American public opinion J Polit 1996 58 4 1055 1078 10.2307/2960149 Nelson TE, Kinder DR. Issue frames and group-centrism in American public opinion. J Polit. 1996;58(4):1055–78. 21. Gilens M Why Americans hate welfare: race, media, and the politics of antipoverty policy 1999 Chicago University of Chicago Press Gilens M. Why Americans hate welfare: race, media, and the politics of antipoverty policy. Chicago: University of Chicago Press; 1999. 22. Smith RA Language of the lost: an explication of stigma communication Commun Theory 2007 17 4 462 485 10.1111/j.1468-2885.2007.00307.x Smith RA. Language of the lost: an explication of stigma communication. Commun Theory. 2007;17(4):462–85. 23. Dsouza VS Rajkhowa P Mallya BR Raksha DS Mrinalini V Cauvery K A sentiment and content analysis of tweets on monkeypox stigma among the LGBTQ+ community: a cue to risk communication plan Dialogues Health 2023 2 100095 10.1016/j.dialog.2022.100095 36573228 PMC9767808 Dsouza VS, Rajkhowa P, Mallya BR, Raksha DS, Mrinalini V, Cauvery K, et al. A sentiment and content analysis of tweets on monkeypox stigma among the LGBTQ+ community: a cue to risk communication plan. Dialogues Health. 2023;2:100095. 36573228 10.1016/j.dialog.2022.100095 PMC9767808 24. Li Y Twersky S Ignace K Zhao M Purandare R Bennett-Jones B Weaver SR Constructing and communicating COVID-19 stigma on Twitter: a content analysis of tweets during the early stage of the COVID-19 outbreak Int J Environ Res Public Health 2020 17 18 6847 10.3390/ijerph17186847 32961702 PMC7557581 Li Y, Twersky S, Ignace K, Zhao M, Purandare R, Bennett-Jones B, Weaver SR. Constructing and communicating COVID-19 stigma on Twitter: a content analysis of tweets during the early stage of the COVID-19 outbreak. Int J Environ Res Public Health. 2020;17(18):6847. 32961702 10.3390/ijerph17186847 PMC7557581 25. Boudreaux MH Golberstein E McAlpine DD The long-term impacts of Medicaid exposure in early childhood: evidence from the program’s origin J Health Econ 2016 45 161 175 10.1016/j.jhealeco.2015.11.001 26763123 PMC4785872 Boudreaux MH, Golberstein E, McAlpine DD. The long-term impacts of Medicaid exposure in early childhood: evidence from the program’s origin. J Health Econ. 2016;45:161–75. 26763123 10.1016/j.jhealeco.2015.11.001 PMC4785872 26. Bailey MJ, Hoynes HW, Rossin-Slater M, Walker R. Is the social safety net a long-term investment? Large-scale evidence from the food stamps program. NBER Working Paper 26942. 2020. Retrieved from http://www.nber.org/papers/w26942 10.1093/restud/rdad063 PMC11395512 39281422 27. Topazian RJ Hatton CR Barry CL Levine AS McGinty EE Public support for U.S. social safety net policies throughout the COVID-19 pandemic Prev Med 2022 154 106873 10.1016/j.ypmed.2021.106873 34762967 PMC8620405 Topazian RJ, Hatton CR, Barry CL, Levine AS, McGinty EE. Public support for U.S. social safety net policies throughout the COVID-19 pandemic. Prev Med. 2022;154:106873. 34762967 10.1016/j.ypmed.2021.106873 PMC8620405 28. Arksey H O’Malley L Scoping studies: towards a methodological framework Int J Soc Res Methodol 2005 8 1 19 32 10.1080/1364557032000119616 Arksey H, O’Malley L. Scoping studies: towards a methodological framework. Int J Soc Res Methodol. 2005;8(1):19–32. 29. Rumrill PD Fitzgerald SM Merchant WR Using scoping literature reviews as a means of understanding and interpreting existing literature Work 2010 35 3 399 404 20364059 10.3233/WOR-2010-0998 Rumrill PD, Fitzgerald SM, Merchant WR. Using scoping literature reviews as a means of understanding and interpreting existing literature. Work. 2010;35(3):399–404. 20364059 10.3233/WOR-2010-0998 30. Page MJ McKenzie JE Bossuyt PM Boutron I Hoffmann TC Mulrow CD The PRISMA 2020 statement: an updated guideline for reporting systematic reviews BMJ 2021 372 n71 10.1136/bmj.n71 33782057 PMC8005924 Page MJ, McKenzie JE, Bossuyt PM, Boutron I, Hoffmann TC, Mulrow CD, et al. The PRISMA 2020 statement: an updated guideline for reporting systematic reviews. BMJ. 2021;372: n71. 10.1136/bmj.n71. 33782057 10.1136/bmj.n71 PMC8005924 31. Martin-Martin A, Orduna-Malea E, Thelwall M, Delgado-Lopez-Cozar E. Google Scholar, Web of Science, and Scopus: which is best for me? 2019. Retrieved from https://blogs.lse.ac.uk/impactofsocialsciences/2019/12/03/google-scholar-web-of-science-and-scopus-which-is-best-for-me/ 10.1007/s11192-020-03690-4 PMC7505221 32981987 32. Iyengar S Framing responsibility for political issues: the case of poverty Polit Behav 1990 12 19 40 10.1007/BF00992330 Iyengar S. Framing responsibility for political issues: the case of poverty. Polit Behav. 1990;12:19–40. 33. Gilens M Race and poverty in America: public misperceptions and the American news media Public Opin Q 1996 60 4 515 541 10.1086/297771 Gilens M. Race and poverty in America: public misperceptions and the American news media. Public Opin Q. 1996;60(4):515–41. 34. Clawson RA Trice R Poverty as we know it: media portrayals of the poor Public Opin Q 2000 64 1 53 64 10.1086/316759 10810075 Clawson RA, Trice R. Poverty as we know it: media portrayals of the poor. Public Opin Q. 2000;64(1):53–64. 10810075 10.1086/316759 35. Lawrence RG Game-framing the issues: tracking the strategy frame in public policy news Polit Commun 2000 17 2 93 114 10.1080/105846000198422 Lawrence RG. Game-framing the issues: tracking the strategy frame in public policy news. Polit Commun. 2000;17(2):93–114. 36. Schram SF Soss J Success stories: welfare reform, policy discourse, and the politics of research Ann Am Acad Polit Soc Sci 2001 577 1 49 65 10.1177/000271620157700105 Schram SF, Soss J. Success stories: welfare reform, policy discourse, and the politics of research. Ann Am Acad Polit Soc Sci. 2001;577(1):49–65. 37. Yoo GJ Constructing deservingness: federal welfare reform, supplemental security income, and elderly immigrants J Aging Soc Policy 2002 13 4 17 34 10.1300/J031v13n04_02 12418380 Yoo GJ. Constructing deservingness: federal welfare reform, supplemental security income, and elderly immigrants. J Aging Soc Policy. 2002;13(4):17–34. 10.1300/j031v13n04_02 12418380 38. Luther CA, Kennedy DA, Combs-Orme T. Intertwining of poverty, gender, and race: a critical analysis of welfare news coverage from 1993–2000. In: Race, gender & class. 2005. p. 10–33. 39. Dyck JJ Hussey LS The end of welfare as we know it? Durable attitudes in a changing information environment Public Opin Q 2008 72 4 589 618 10.1093/poq/nfn053 Dyck JJ, Hussey LS. The end of welfare as we know it? Durable attitudes in a changing information environment. Public Opin Q. 2008;72(4):589–618. 40. Kelly M Regulating the reproduction and mothering of poor women: the controlling image of the welfare mother in television news coverage of welfare reform J Poverty 2010 14 1 76 96 10.1080/10875540903489447 Kelly M. Regulating the reproduction and mothering of poor women: the controlling image of the welfare mother in television news coverage of welfare reform. J Poverty. 2010;14(1):76–96. 41. Brown H The new racial politics of welfare: ethno-racial diversity, immigration, and welfare discourse variation Soc Serv Rev 2013 87 3 586 612 10.1086/673171 Brown H. The new racial politics of welfare: ethno-racial diversity, immigration, and welfare discourse variation. Soc Serv Rev. 2013;87(3):586–612. 42. Rose M Baumgartner FR Framing the poor: media coverage and US poverty policy, 1960–2008 Policy Stud J 2013 41 1 22 53 10.1111/psj.12001 Rose M, Baumgartner FR. Framing the poor: media coverage and US poverty policy, 1960–2008. Policy Stud J. 2013;41(1):22–53. 43. Van Doorn BW Pre-and post-welfare reform media portrayals of poverty in the United States: the continuing importance of race and ethnicity Polit Policy 2015 43 1 142 162 10.1111/polp.12107 Van Doorn BW. Pre-and post-welfare reform media portrayals of poverty in the United States: the continuing importance of race and ethnicity. Polit Policy. 2015;43(1):142–62. 44. El-Burki IJ Porpora DV Reynolds RR When race matters: What newspaper opinion pieces say about race and poverty Int J Commun 2016 10 17 El-Burki IJ, Porpora DV, Reynolds RR. When race matters: What newspaper opinion pieces say about race and poverty. Int J Commun. 2016;10:17. 45. Epp DA Jennings JT Inequality, media frames, and public support for welfare Public Opin Q 2020 84 3 629 653 10.1093/poq/nfaa043 Epp DA, Jennings JT. Inequality, media frames, and public support for welfare. Public Opin Q. 2020;84(3):629–53. 46. Dorfman L Schauffler HH Wilkerson J Feinson J Local television news coverage of President Clinton’s introduction of the Health Security Act JAMA 1996 275 15 1201 1205 10.1001/jama.1996.03530390067038 8609691 Dorfman L, Schauffler HH, Wilkerson J, Feinson J. Local television news coverage of President Clinton’s introduction of the Health Security Act. JAMA. 1996;275(15):1201–5. 8609691 47. Huebner J Fan DP Finnegan J “Death of a thousand cuts”: the impact of media coverage on public opinion about Clinton’s Health Security Act J Health Commun 1997 2 4 253 270 10.1080/108107397127581 Huebner J, Fan DP, Finnegan J. “Death of a thousand cuts”: the impact of media coverage on public opinion about Clinton’s Health Security Act. J Health Commun. 1997;2(4):253–70. 48. Brodie M, Altman D, Brady L, Heberling L. A study of media coverage of health policy 1997–2000. Columbia J Rev. 2002;1. 49. Hopper J Obamacare, the news media, and the politics of 21st-century presidential communication Int J Commun 2015 9 25 Hopper J. Obamacare, the news media, and the politics of 21st-century presidential communication. Int J Commun. 2015;9:25. 50. Kim S-H Tanner AH Foster CB Kim SY Talking about health care: news framing of who is responsible for rising health care costs in the United States J Health Commun 2015 20 2 123 133 10.1080/10810730.2014.914604 25116304 Kim S-H, Tanner AH, Foster CB, Kim SY. Talking about health care: news framing of who is responsible for rising health care costs in the United States. J Health Commun. 2015;20(2):123–33. 25116304 10.1080/10810730.2014.914604 51. Gollust SE, Baum LM, Niederdeppe J, Barry CL, Fowler EF. Local television news coverage of the affordable care act: emphasizing politics over consumer information. Am J Public Health. 2017;107(5):687–93 . 10.2105/AJPH.2017.303659 PMC5388939 28207336 52. Kim SH Tanner AH Kim SY Foster C Oh SH Chang JH News focuses on individuals for rising health care costs Newsp Res J 2017 38 3 293 305 10.1177/0739532917722975 Kim SH, Tanner AH, Kim SY, Foster C, Oh SH, Chang JH. News focuses on individuals for rising health care costs. Newsp Res J. 2017;38(3):293–305. 53. Viladrich A “We cannot let them die”: undocumented immigrants and media framing of health deservingness in the United States Qual Health Res 2019 29 10 1447 1460 10.1177/1049732319830426 30907224 Viladrich A. “We cannot let them die”: undocumented immigrants and media framing of health deservingness in the United States. Qual Health Res. 2019;29(10):1447–60. 30907224 10.1177/1049732319830426 54. Biswas M Kim NY African American online newspapers’ coverage of policy debate on the affordable care act in 2017 Newsp Res J 2020 41 3 349 367 10.1177/0739532920950046 Biswas M, Kim NY. African American online newspapers’ coverage of policy debate on the affordable care act in 2017. Newsp Res J. 2020;41(3):349–67. 55. Gollust SE Fowler EF Niederdeppe J Ten years of messaging about the Affordable Care Act in advertising and news media: lessons for policy and politics J Health Polit Policy Law 2020 45 5 711 728 10.1215/03616878-8543210 32589219 Gollust SE, Fowler EF, Niederdeppe J. Ten years of messaging about the Affordable Care Act in advertising and news media: lessons for policy and politics. J Health Polit Policy Law. 2020;45(5):711–28. 32589219 10.1215/03616878-8543210 56. Rozier MD Singer PM The good and evil of health policy: Medicaid expansion, Republican governors, and moral intuitions AJOB Empir Bioeth 2021 12 3 145 154 10.1080/23294515.2020.1863506 33355525 Rozier MD, Singer PM. The good and evil of health policy: Medicaid expansion, Republican governors, and moral intuitions. AJOB Empir Bioeth. 2021;12(3):145–54. 33355525 10.1080/23294515.2020.1863506 57. Jahng MR Littau J From political to personal: tracking the use of exemplars in newspaper coverage of the Affordable Care Act J Pract 2022 16 1 200 217 Jahng MR, Littau J. From political to personal: tracking the use of exemplars in newspaper coverage of the Affordable Care Act. J Pract. 2022;16(1):200–17. 58. Chrisinger BW Kinsey EW Pavlick E Callison-Burch C Snap judgments into the digital age: reporting on food stamps varies significantly with time, publication type, and political leaning PLoS ONE 2020 15 2 e0229180 10.1371/journal.pone.0229180 32084181 PMC7034891 Chrisinger BW, Kinsey EW, Pavlick E, Callison-Burch C. Snap judgments into the digital age: reporting on food stamps varies significantly with time, publication type, and political leaning. PLoS ONE. 2020;15(2):e0229180. 32084181 10.1371/journal.pone.0229180 PMC7034891 59. Mejia P Mahmood H Perez-Sanz SB Garcia K Dorfman L “People like us”: news coverage of food assistance during the COVID-19 pandemic Health Equity 2022 6 1 367 374 10.1089/heq.2022.0001 35651356 PMC9148658 Mejia P, Mahmood H, Perez-Sanz SB, Garcia K, Dorfman L. “People like us”: news coverage of food assistance during the COVID-19 pandemic. Health Equity. 2022;6(1):367–74. 35651356 10.1089/heq.2022.0001 PMC9148658 60. Kunkel D, Smith S, Suding P, Biely E. Coverage in context: how thoroughly the news media report five key children’s issues. College Park: Casey Journalism Center on Children and Families, Phillip Merrill College of Journalism; 2002. 61. Kim B Lowrey W Buzzelli N Heath W News organizations and social cohesion in small, large, and global-local communities Mass Commun Soc 2021 24 3 418 440 10.1080/15205436.2020.1839103 Kim B, Lowrey W, Buzzelli N, Heath W. News organizations and social cohesion in small, large, and global-local communities. Mass Commun Soc. 2021;24(3):418–40. 62. Biswas M, Kim NY. Racial Inequalities in Baltimore City and its reflection in diverse news media coverage after the 2015 unrest around Freddie Gray’s death. Soc Dev Issues. 2022;44(1). 10.3998/sdi.2815. 63. Best R Situation or social problem: the influence of events on media coverage of homelessness Soc Probl 2010 57 1 74 91 10.1525/sp.2010.57.1.74 Best R. Situation or social problem: the influence of events on media coverage of homelessness. Soc Probl. 2010;57(1):74–91. 64. Nixon L, Schaff K, Mejia P, Marvel D, Dorfman L. Equity and health in housing coverage. Berkeley Media Studies Group report; 2019. Available at https://www.bmsg.org/wp-content/uploads/2019/05/bmsg_housing_casa_analysis2019.pdf 65. Borum Chattoo CB Young L Conrad D Coskuntuncel A “The rent is too damn high”: news portrayals of housing security and homelessness in the United States Mass Commun Soc 2021 24 4 553 575 10.1080/15205436.2021.1881126 Borum Chattoo CB, Young L, Conrad D, Coskuntuncel A. “The rent is too damn high”: news portrayals of housing security and homelessness in the United States. Mass Commun Soc. 2021;24(4):553–75. 66. Grandy K Marissa’s choice: media coverage of Yahoo CEO Marissa Mayer Kadın/Woman 2000 J Womens Stud 2016 17 2 109 132 10.33831/jws.v17i2.213 Grandy K. Marissa’s choice: media coverage of Yahoo CEO Marissa Mayer. Kadın/Woman 2000 J Womens Stud. 2016;17(2):109–32. 67. Tait M Bogucki C Baum L Fowler EF Niederdeppe J Gollust S Paid family leave on local television news in the United States: setting the agenda for policy reform SSM Popul Health 2021 14 100821 10.1016/j.ssmph.2021.100821 34095428 PMC8164082 Tait M, Bogucki C, Baum L, Fowler EF, Niederdeppe J, Gollust S. Paid family leave on local television news in the United States: setting the agenda for policy reform. SSM Popul Health. 2021;14:100821. 34095428 10.1016/j.ssmph.2021.100821 PMC8164082 68. McAdams KC Henry T An analysis of US newspaper coverage. Of early childhood education 2006 New York Hechinger Institute on Education and the Media McAdams KC, Henry T. An analysis of US newspaper coverage. Of early childhood education. New York: Hechinger Institute on Education and the Media; 2006. 69. Tolley NM Ibrahim JK What’s in a name? Policy implications of an evolving definition of food security Food Stud Interdiscip J 2013 2 3 61 77 10.18848/2160-1933/CGP/v02i03/40553 Tolley NM, Ibrahim JK. What’s in a name? Policy implications of an evolving definition of food security. Food Stud Interdiscip J. 2013;2(3):61–77. 70. Spruance LA McConkie M Patten E Goates MC A thematic analysis of unpaid school meals in the news media J Hunger Environ Nutr 2022 17 6 850 859 10.1080/19320248.2021.1971590 Spruance LA, McConkie M, Patten E, Goates MC. A thematic analysis of unpaid school meals in the news media. J Hunger Environ Nutr. 2022;17(6):850–9. 71. Rasmussen AC Causes and solutions: mainstream and black press framing of racial and ethnic health disparities Howard J Commun 2014 25 3 257 280 10.1080/10646175.2014.922910 Rasmussen AC. Causes and solutions: mainstream and black press framing of racial and ethnic health disparities. Howard J Commun. 2014;25(3):257–80. 72. Pew. News platform fact sheet (news media trends). 2023. https://www.pewresearch.org/journalism/fact-sheet/news-platform-fact-sheet/ 73. Shearer E, Liedke J, Matsa KE, Lipka M, Kurkowitz M. Podcasts as a source of news and information. 2023. Retrieved from https://www.pewresearch.org/journalism/2023/04/18/podcasts-as-a-source-of-news-and-information/ 74. Hamel L, Lopes L, Kirzinger A, Sparks G, Stokes M, Brodie M. KFF COVID-19 vaccine monitor: media and misinformation. 2021. Retrieved from https://www.kff.org/coronavirus-covid-19/poll-finding/kff-covid-19-vaccine-monitor-media-and-misinformation/ 75. Gollust SE, Gansen C, Fowler EF, Moore S, Nagler RH. Polarized perspectives on health equity: results from a nationally representative survey on US public perceptions of COVID-19 disparities in 2023. J Health Polit Policy Law. 2024;49(3):403–27. 10.1215/03616878-11066304 PMC11846683 37987174 76. Ren J Dong H Popovic A Sabnis G Nickerson J Digital platforms in the news industry: how social media platforms impact traditional media news viewership Eur J Inf Syst 2024 33 1 1 18 10.1080/0960085X.2022.2103046 Ren J, Dong H, Popovic A, Sabnis G, Nickerson J. Digital platforms in the news industry: how social media platforms impact traditional media news viewership. Eur J Inf Syst. 2024;33(1):1–18. 77. Newman N, Cherubini F. Journalism, media, and technology trends and predictions 2025. Reuters Institute for the Study of Journalism. University of Oxford; 2025. Available at: https://ora.ox.ac.uk/objects/uuid:098bb61b-e8fa-40ad-8059-fd6cfa4db898/files/spz50gz513 78. Towe VL May LW Huang W Martin LT Carman K Miller CE Chandra A Drivers of differential views of health equity in the US: is the US ready to make progress? Results from the 2018 National Survey of Health Attitudes BMC Public Health 2021 21 1 12 10.1186/s12889-021-10179-z 33478438 PMC7817761 Towe VL, May LW, Huang W, Martin LT, Carman K, Miller CE, Chandra A. Drivers of differential views of health equity in the US: is the US ready to make progress? Results from the 2018 National Survey of Health Attitudes. BMC Public Health. 2021;21:1–12. 33478438 10.1186/s12889-021-10179-z PMC7817761 79. Maares P Hanusch F Exploring the boundaries of journalism: Instagram micro-bloggers in the twilight zone of lifestyle journalism Journalism 2020 21 2 262 278 10.1177/1464884918801400 Maares P, Hanusch F. Exploring the boundaries of journalism: Instagram micro-bloggers in the twilight zone of lifestyle journalism. Journalism. 2020;21(2):262–78. ",
  "metadata": {
    "Title of this paper": "Exploring the boundaries of journalism: Instagram micro-bloggers in the twilight zone of lifestyle journalism",
    "Journal it was published in:": "BMC Public Health",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487278/"
  }
}