{
  "title": "Paper_975",
  "abstract": "pmc Pathogens Pathogens 2622 pathogens pathogens Pathogens 2076-0817 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473010 PMC12473010.1 12473010 12473010 41011846 10.3390/pathogens14090946 pathogens-14-00946 1 Review Long-Term Breastfeeding: Protective Effects Against Triple-Negative Breast Cancer and the Role of the Breast Microbiota Sierra-Roca Julia 1 https://orcid.org/0000-0002-8927-6614 Climent Joan 2 3 * Fernández-Murga María Leonor Academic Editor Llombart-Cussac Antonio Academic Editor 1 m.j.sierraroca@hotmail.com 2 3 * joan.climentbataller@uchceu.es 18 9 2025 9 2025 14 9 497659 946 01 8 2025 13 9 2025 15 9 2025 18 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Long-term breastfeeding is a modifiable, protective factor against breast cancer, particularly triple-negative breast cancer (TNBC), a highly aggressive subtype with limited therapeutic options. Recent findings suggest that the protective effects of breastfeeding are mediated not only through hormonal regulation and epithelial differentiation but also via the modulation of the breast microbiota. This review examines epidemiological data on the association between breastfeeding duration and TNBC risk reduction, highlights the composition and functions of breast microbiota in health and disease, and discusses how dysbiosis may contribute to carcinogenesis. By examining the microbiome’s role in maintaining breast health, we emphasize how breastfeeding contributes to a natural defense system against TNBC, offering a unique perspective on the intersection of maternal health, microbiology, and cancer prevention. Breastfeeding not only provides maternal and infant benefits but also emerges as a biological strategy that promotes cancer resistance through its influence on the breast microbiota. Integrating epidemiological, microbiological, and mechanistic evidence suggests that future research deliberately combining these domains will be essential to clarify causal pathways and translate findings into prevention and intervention strategies against TNBC. breastfeeding triple-negative breast cancer TNBC microbiota breast cancer prevention dysbiosis lactation probiotics tumor microenvironment ECMOR Chair and Cancer Care Javea Charity This work has been supported by the ECMOR Chair and Cancer Care Javea Charity. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Breastfeeding is a natural and highly beneficial process that supports the health and well-being of both mothers and their infants. For infants, breastfeeding provides optimal nutrition, enhances immune development, and fosters the establishment of a healthy gut microbiome, which has long-term implications for immune and metabolic health [ 1 2 For mothers, lactation accelerates postpartum recovery, including faster uterine involution and reduced postpartum bleeding, and helps support return to pre-pregnancy weight and emotional well-being. Long-term breastfeeding is associated with reduced risks of ovarian and endometrial cancers and has been linked to a lower incidence of type 2 diabetes and cardiovascular disease [ 3 4 5 Notably, a growing body of evidence supports a protective role for breastfeeding against breast cancer, especially the aggressive triple-negative subtype (TNBC), which lacks expression of estrogen receptor (ER), progesterone receptor (PR), and human epidermal growth factor receptor 2 (HER2). As a clinically challenging subtype, TNBC presents limited targeted treatment options and a poorer prognosis than other breast cancer subtypes [ 6 7 TNBC is more frequently diagnosed in younger, premenopausal women and is particularly prevalent among women of African descent [ 8 9 10 In parallel, there is growing interest in the human breast microbiota, an ecosystem of bacteria residing in the mammary glands and milk, and its possible roles in tissue homeostasis and disease development [ 10 10 11 12 13 Emerging research has identified distinct bacterial profiles in both milk and mammary tissue, with direct breastfeeding associated with beneficial taxa like Lactobacillus Bifidobacterium Streptococcus 14 15 Enterobacteriaceae Pseudomonas 10 15 16 17 18 Additionally, studies in murine models have shown that abrupt involution, mimicking early weaning or non-breastfeeding, induces local inflammation, signal transducer and activator of transcription 3 (STAT3) activation, ductal hyperplasia, and expansion of luminal progenitor cells, which are thought to be the origin of basal-like and triple-negative tumors [ 18 19 18 19 This review explores the intersection between long-term breastfeeding, breast microbiota, and TNBC risk. We synthesize findings from epidemiological studies, murine models, microbiome analyses, and immune profiling to propose an integrative framework whereby breastfeeding shapes a favorable immune and microbial microenvironment that reduces TNBC risk. By articulating the biological and public health relevance of this axis, we aim to highlight novel pathways for cancer prevention and identify opportunities for clinical and translational research. 2. Epidemiological Evidence Linking Breastfeeding and TNBC Risk A substantial body of epidemiological evidence supports the protective role of long-term breastfeeding in reducing the risk of TNBC [ 4 8 20 5 21 7 The specificity of this association becomes more apparent when comparing reproductive risk profiles across subtypes. While parity is generally protective of luminal subtypes, several studies have shown that multiparity without breastfeeding increases the risk of TNBC, potentially due to abrupt post-pregnancy involution and inflammation [ 22 23 24 In a population-based study, Chehayeb et al. [ 6 25 25 26 27 6 24 Importantly, breastfeeding appears to be protective even in high-risk groups. For instance, Islami et al. reported that among breast cancer susceptibility gene 1 (BRCA1) mutation carriers, who are predisposed to triple-negative and basal-like tumors, long-term breastfeeding was associated with a reduced risk of breast cancer overall, with the most substantial reductions observed in basal-like subtypes [ 28 29 19 30 19 31 Additional studies have highlighted the duration-dependent nature of this protective effect [ 32 33 34 22 24 35 24 In summary, breastfeeding is a modifiable, cost-effective behavior that significantly reduces TNBC risk. Its protective effects are consistent across racial and genetic backgrounds and particularly important for mitigating the impact of multiparity and promoting equitable cancer prevention. These findings support the inclusion of breastfeeding history in breast cancer risk models and call for public health strategies targeting disparities in breastfeeding access and education. 3. Breast Microbiota: Composition and Function in Health The human breast is home to a diverse and dynamic microbial community that plays a critical role in local immune regulation, epithelial homeostasis, and potentially cancer prevention [ 10 18 36 16 18 37 38 39 11 16 40 41 11 16 10 40 41 3.1. Composition of Breast Microbiota Culture-independent sequencing technologies have consistently revealed a core microbiome in healthy breast tissue and milk, composed predominantly of Staphylococcus Streptococcus Corynebacterium Propionibacterium Lactobacillus Bifidobacterium 10 18 41 42 14 15 42 Breastfeeding status is a major determinant of microbial diversity and composition. Direct breastfeeding has been associated with a higher abundance of beneficial genera such as Veillonella Lactobacillus Bifidobacterium 17 43 44 Enterobacteriaceae Pseudomonas Stenotrophomonas 17 43 45 16 40 41 16 Supplementary Table S1 Recent studies suggest these microbial differences may have biological consequences. The “Anna Karenina principle” (AKP) has been proposed to explain increased microbial heterogeneity in breast disease, showing that breast cancer is associated with less variation in rare taxa (anti-AKP effect), contrasting the greater stochasticity seen in mastitis [ 46 Fusobacteriota Peptoniphilus Atopobium 45 Bacillus thermoamylovorans 47 Current deep sequencing and microbial profiling studies have confirmed the dominance of Proteobacteria Firmicutes Acetobacteraceae Lactobacillaceae Xanthomonadaceae 42 48 49 Acetobacter aceti Liquorilactobacillus paracasei Lactobacillus Xanthomonas 10 42 48 49 Ralstonia Escherichia coli 10 11 12 13 42 50 Figure 1 12 47 50 51 In non-lactating women, particularly those who are postmenopausal or nulliparous, breast tissue exhibits distinct microbial profiles characterized by reduced microbial diversity and increased prevalence of pro-inflammatory and potentially pathogenic taxa such as Escherichia coli Staphylococcus aureus Bacillus 10 18 52 53 E. coli Staphylococcus epidermidis 10 50 52 Streptococcus pyogenes 54 55 10 53 56 3.2. Functions of the Breast Microbiota Beyond compositional characteristics, the functional roles of breast microbiota are critical for maintaining mammary gland homeostasis and may contribute to protection against triple-negative breast cancer (TNBC). Beneficial commensals, particularly Lactobacillus Bifidobacterium 18 48 57 58 59 60 61 p21 60 61 62 63 64 18 47 47 48 58 Recent integrative analyses have revealed that microbial abundance in normal breast tissue correlates with host gene expression signatures, particularly immune and metabolic pathways. In a large-scale profiling of 403 healthy breast tissue samples and adjacent normal tissues from breast cancer patients, Lactobacillus vini Lactobacillus paracasei Acetobacter aceti Xanthomonas IL2 IFNG CXCL10 FASN ACACA CDH1 OCLN 48 52 53 Ralstonia 48 49 Ralstonia Lactobacillus Bifidobacterium 48 65 66 52 53 66 66 Microbial signals significantly shape immune responses in the mammary gland. Exposure to commensal bacteria such as Lactobacillus Figure 2 10 12 18 19 18 19 54 67 Lactobacillus helveticus Lactobacillus acidophilus 68 69 The tumor microenvironment is increasingly recognized as being shaped by the presence and activity of intratumoral bacteria. Recent evidence from Gerbec et al. demonstrated that Bacillus thermoamylovorans 47 B. thermoamylovorans 47 B. thermoamylovorans B. subterraneus B. thermoamylovorans 47 Overall, the breast microbiota represents a key regulator of tissue homeostasis and immune tone in the mammary gland. Its composition and activity are shaped by lactation, which serves not only to feed the infant but also to reinforce a beneficial microbial-immune axis in the mother. Disruption of this axis, through abrupt weaning, formula feeding, or antibiotic exposure, may contribute to the development of a pro-tumorigenic environment in the breast. Understanding these mechanisms may inform future interventions, including microbiota-based therapies, precision probiotic supplementation, or microbial biomarkers for early cancer detection. 4. Long-Term Breastfeeding and Breast Cancer Risk Reduction A growing body of epidemiological evidence supports the association between long-term breastfeeding and a reduced risk of breast cancer, particularly for the TNBC subtype ( Table 1 4 6 7 19 21 26 28 34 70 71 26 26 34 Building upon the epidemiological findings in Section 2 24 Moreover, lack of breastfeeding leads to abrupt involution, characterized by a pro-inflammatory environment, enhanced collagen remodeling, and dysregulated tissue architecture. Epidemiological studies support these mechanistic findings, showing that women who did not breastfeed or underwent abrupt weaning are at increased risk of basal-like/TNBC [ 19 Section 3.1 19 In parallel, exosomal microRNAs (miRNAs) present in breast milk have been implicated in the epigenetic regulation of mammary epithelial cells. Specifically, milk-derived miR-29 and miR-148a target DNA methyltransferase DNMT3a/b, and DNMT1, respectively, thereby modulating DNA methylation patterns relevant to lactation and cellular differentiation [ 72 72 73 The hormonal and metabolic shifts during lactation also have protective effects. Prolonged lactation reduces circulating levels of estrogen and prolactin, hormones known to stimulate breast tissue proliferation [ 74 75 In summary, long-term breastfeeding is a powerful, modifiable protective factor against breast cancer and particularly TNBC. Its effects appear to span biological pathways including epithelial differentiation, immune regulation, hormone suppression, and epigenetic remodeling. Addressing disparities in breastfeeding rates, through education, policy changes, and community support, could reduce TNBC incidence and improve maternal health outcomes across populations. 5. Integrative Mechanisms Linking Breastfeeding, Microbiota, and TNBC Protection Building upon the compositional insights of the breast microbiota, growing evidence suggests that breastfeeding shapes a dynamic immuno-metabolic environment that may protect against TNBC through several interconnected biological pathways. These include hormone modulation, microbial-mediated epigenetic changes, and long-term immune imprinting [ 6 76 A novel aspect gaining attention is the intergenerational influence of breastfeeding-mediated microbial transfer. Colonization of the infant gut with maternally derived bacteria such as Bifidobacterium breve Lactobacillus rhamnosus 16 20 77 Recent studies also highlight how microbial signatures differ across breast cancer subtypes ( Figure 3 Ralstonia Lactobacillus Bifidobacterium 47 48 49 Section 3.2 78 79 80 54 66 81 The potential of breastfeeding to shift the breast microbiota away from tumor-promoting profiles, either directly through microbial exposure or indirectly through structural, immune, and hormonal changes, offers a compelling integrative model of TNBC prevention [ 9 22 33 16 34 Finally, understanding how breast microbiota evolves throughout pregnancy, lactation, and involution remains a key research priority. Longitudinal studies tracking these microbial and immuno-hormonal dynamics in high-risk women could elucidate critical windows for intervention. Identifying microbial markers that predict TNBC risk, or that reflect early carcinogenic changes, may also inform future diagnostic and preventive strategies. Figure 4 Figure 2 Figure 3 Figure 4 Supplementary Table S1 6. Therapeutic and Preventive Implications Advancements in our understanding of how breastfeeding and breast microbiota influence the risk of TNBC are opening promising avenues for innovative prevention and treatment strategies. Given the lack of hormone or HER2 targets in TNBC, these microbiota-centered approaches may serve as crucial adjuncts to conventional treatments. One area of growing interest is the targeted modulation of the breast and gut microbiome. Preclinical research has demonstrated that enriching beneficial microbial taxa, such as Lactobacillus Bifidobacterium Alistipes Ruminococcus + 69 82 83 84 Bacillus thermoamylovorans 47 Diet and probiotics have also emerged as powerful tools in this context. Probiotic strains including L. plantarum L. casei L. acidophilus L. rhamnosus 69 82 83 84 NCT03290651 NCT04362826 13 85 86 80 87 88 Beyond therapeutic benefit, breastfeeding itself plays a critical preventive role through microbial transmission. Human milk is a key vehicle for transferring beneficial bacteria such as Bifidobacterium breve Lactobacillus rhamnosus 59 Microbiome profiling may also offer predictive and prognostic insights in oncology. Characterizing gut and breast microbiota before and after treatment could help stratify patients by likely response to chemotherapy, endocrine therapy, or immunotherapy [ 88 89 Lactobacillus johnsonii 90 Looking ahead, next-generation tools such as bacteriotherapy (the administration of live beneficial bacteria) and microbiota-derived bioactive peptides, like colicins and defensins, are being investigated for their ability to directly modulate immune responses and suppress tumor growth in preclinical systems [ 68 Research priorities moving forward include longitudinal studies to monitor shifts in the breast microbiota across pregnancy, lactation, and involution, especially in high-risk populations. There is also a need to develop precision synbiotics designed to increase SCFA-producing and anti-inflammatory taxa while suppressing β-glucuronidase–expressing microbes implicated in local estrogen reactivation. Finally, incorporating microbiota-supportive strategies into public health and breastfeeding promotion efforts could not only reduce TNBC disparities but also broadly improve maternal and child health outcomes. Together, these microbiota-centered strategies underscore the therapeutic potential of targeting the microbial-immune interface in breast cancer, particularly for TNBC, where conventional options remain limited. Harnessing the power of the microbiome, through breastfeeding, diet, and therapeutic modulation, may offer transformative opportunities for cancer prevention and patient care. 7. Future Perspectives and Directions Although long-term breastfeeding has been consistently associated with reduced risk of triple-negative breast cancer (TNBC), many critical questions remain regarding the biological mechanisms and the role of microbiota in mediating this effect. While previous works have separately demonstrated that breastfeeding protects against TNBC, that breast tissue harbors a microbiome, and that lactation shapes microbial and immune environments, our review is, to our knowledge, the first to bring these strands together. We specifically propose that the protective effect of breastfeeding may be mediated, at least in part, through its influence on breast microbiota, thereby linking epidemiological observations to mechanistic evidence. This integrative perspective highlights a novel research frontier. To advance the field, prospective longitudinal studies are urgently needed. Such studies should track breastfeeding duration, involution patterns (gradual vs. abrupt), and microbiota composition across diverse populations, ideally beginning during pregnancy and extending through weaning and postpartum. These designs will help clarify temporal dynamics and establish causal links. The development of microbiota-based biomarkers represents another promising avenue. Microbial signatures derived from breast tissue, milk, or even stool samples could complement genetic and clinical risk factors for TNBC, enabling earlier detection or refined risk stratification, especially among BRCA1 carriers or women with strong family histories. Parallel efforts should focus on microbiome-targeted interventions. Preclinical evidence suggests that probiotics, prebiotics, synbiotics, and dietary modulation can enrich beneficial taxa and reduce pro-inflammatory signaling. Translating these findings into clinical prevention strategies for at-risk women will require carefully designed, culturally sensitive, and ethically sound trials. At the mechanistic level, multi-omics integration will be crucial to understanding how microbial metabolites, immune signaling, and host epigenetic regulation interact to modulate TNBC risk. Combining genomics, transcriptomics, epigenomics, metabolomics, and microbiota profiling will enable the identification of causal pathways and potential therapeutic targets. Finally, public health initiatives remain central. Supporting breastfeeding through inclusive, equitable, and culturally sensitive policies is a natural and cost-effective intervention with intergenerational benefits. Embedding microbiome science into oncology, maternal care, and prevention programs could amplify these gains, particularly in populations disproportionately affected by TNBC. Together, these future directions underscore the need for integrative, translational, and population-based research. Such approaches will move the field from descriptive associations to actionable strategies that combine maternal care, microbial science, and oncology for the prevention of TNBC. 8. Conclusions This review highlights the multifactorial role of long-term breastfeeding in reducing the risk of TNBC. Beyond hormonal regulation and epithelial remodeling, breastfeeding actively shapes the breast microbiota, influencing local immunity, inflammation, and tissue homeostasis in ways that appear protective against carcinogenesis. Breastfeeding should be recognized not only as maternal care but also as a biological strategy that promotes cancer resistance, microbial balance, and immune resilience. By linking epidemiological evidence, mechanistic insights, and microbiota research, this review underscores the novelty of integrating these perspectives and the promise they hold for TNBC prevention. Looking forward, future work that deliberately combines these three domains, breastfeeding behaviors, breast and milk microbiota composition, and molecular mechanisms of carcinogenesis, will be essential to establish causality and to translate these insights into clinical and public health strategies. Such integrative approaches may ultimately yield microbiota-informed biomarkers, prevention tools, and therapeutic targets that complement breastfeeding as a natural and cost-effective means of reducing TNBC risk. Acknowledgments We would like to express our heartfelt thanks to Cancer Care Javea, a charitable organization established in 1998 and based in Javea, Spain, for their unwavering support. Their contribution, both financial, through dedicated fundraising efforts, and personal, through the compassionate work of their volunteers and members, has been instrumental in supporting local individuals and families affected by cancer, as well as in advancing research and awareness efforts such as this one. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/pathogens14090946/s1 Author Contributions Conceptualization, J.S.-R. and J.C.; resources, J.C.; writing—original draft preparation, J.S.-R. and J.C.; writing—review and editing, J.S.-R. and J.C.; visualization, J.S.-R. and J.C.; supervision, J.C.; project administration, J.S.-R. and J.C.; funding acquisition, J.C. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement No new data were created or analyzed in this study. Conflicts of Interest The authors declare no conflict of interest. References 1. Walker T.C. Keene S.D. Patel R.M. Early feeding factors associated with exclusive versus partial human milk feeding in neonates receiving intensive care J. Perinatol. 2014 34 606 610 10.1038/jp.2014.63 24743134 PMC4117706 2. Modak A. Ronghe V. Gomase K.P. The Psychological Benefits of Breastfeeding: Fostering Maternal Well-Being and Child Development Cureus 2023 15 e46730 10.7759/cureus.46730 38021634 PMC10631302 3. Li D.P. Du C. Zhang Z.M. Li G.X. Yu Z.F. Wang X. Li P.F. Cheng C. Liu Y.P. Zhao Y.S. Breastfeeding and ovarian cancer risk: A systematic review and meta-analysis of 40 epidemiological studies Asian Pac. J. Cancer Prev. 2014 15 4829 4837 10.7314/APJCP.2014.15.12.4829 24998548 4. Masi A.C. Stewart C.J. Role of breastfeeding in disease prevention Microb. Biotechnol. 2024 17 e14520 10.1111/1751-7915.14520 38946112 PMC11214977 5. Tschiderer L. Seekircher L. Kunutsor S.K. Peters S.A.E. O’Keeffe L.M. Willeit P. Breastfeeding Is Associated with a Reduced Maternal Cardiovascular Risk: Systematic Review and Meta-Analysis Involving Data from 8 Studies and 1,192,700 Parous Women J. Am. Heart Assoc. 2022 11 e022746 10.1161/JAHA.121.022746 35014854 PMC9238515 6. Chehayeb R.J. Odzer N. Albany R.A. Ferrucci L. Sarpong D. Perez-Escamilla R. Lewis J.B. Phipps A.I. Meisner A. Pusztai L. Breastfeeding attributable fraction of triple negative breast cancer in the US npj Breast Cancer 2025 11 40 10.1038/s41523-025-00755-6 40328734 PMC12055980 7. Mao X. Omeogu C. Karanth S. Joshi A. Meernik C. Wilson L. Clark A. Deveaux A. He C. Johnson T. Association of reproductive risk factors and breast cancer molecular subtypes: A systematic review and meta-analysis BMC Cancer 2023 23 644 10.1186/s12885-023-11049-0 37430191 PMC10334550 8. Dietze E.C. Sistrunk C. Miranda-Carboni G. O’Regan R. Seewaldt V.L. Triple-negative breast cancer in African-American women: Disparities versus biology Nat. Rev. Cancer 2015 15 248 254 10.1038/nrc3896 25673085 PMC5470637 9. Giaquinto A.N. Sung H. Newman L.A. Freedman R.A. Smith R.A. Star J. Jemal A. Siegel R.L. Breast cancer statistics 2024 CA Cancer J. Clin. 2024 74 477 495 10.3322/caac.21863 39352042 10. Urbaniak C. Gloor G.B. Brackstone M. Scott L. Tangney M. Reid G. The Microbiota of Breast Tissue and Its Association with Breast Cancer Appl. Environ. Microbiol. 2016 82 5039 5048 10.1128/AEM.01235-16 27342554 PMC4968547 11. Li M. Xue Y. Lu H. Bai J. Cui L. Ning Y. Yuan Q. Jia X. Wang S. Relationship between infant gastrointestinal microorganisms and maternal microbiome within 6 months of delivery Microbiol. Spectr. 2024 12 e0360823 10.1128/spectrum.03608-23 39172626 PMC11448430 12. Liu Y. Ning H. Li Y. Li Y. Ma J. The microbiota in breast cancer: Dysbiosis, microbial metabolites, and therapeutic implications Am. J. Cancer Res. 2025 15 1384 1409 10.62347/ZJCF2843 40371158 PMC12070087 13. Devoy C. Flores Bueso Y. Tangney M. Understanding and harnessing triple-negative breast cancer-related microbiota in oncology Front. Oncol. 2022 12 1020121 10.3389/fonc.2022.1020121 36505861 PMC9730816 14. Li Y. Ren L. Wang Y. Li J. Zhou Q. Peng C. Li Y. Cheng R. He F. Shen X. The Effect of Breast Milk Microbiota on the Composition of Infant Gut Microbiota: A Cohort Study Nutrients 2022 14 5397 10.3390/nu14245397 36558556 PMC9781472 15. Alemu B.K. Azeze G.G. Wu L. Lau S.L. Wang C.C. Wang Y. Effects of maternal probiotic supplementation on breast milk microbiome and infant gut microbiome and health: A systematic review and meta-analysis of randomized controlled trials Am. J. Obstet. Gynecol. MFM 2023 5 101148 10.1016/j.ajogmf.2023.101148 37660760 16. Moossavi S. Sepehri S. Robertson B. Bode L. Goruk S. Field C.J. Lix L.M. de Souza R.J. Becker A.B. Mandhane P.J. Composition and Variation of the Human Milk Microbiota Are Influenced by Maternal and Early-Life Factors Cell Host Microbe 2019 25 324 335.e4 10.1016/j.chom.2019.01.011 30763539 17. Dombrowska-Pali A. Wiktorczyk-Kapischke N. Chrustek A. Olszewska-Słonina D. Gospodarek-Komkowska E. Socha M.W. Human Milk Microbiome—A Review of Scientific Reports Nutrients 2024 16 1420 10.3390/nu16101420 38794658 PMC11124344 18. Laborda-Illanes A. Sanchez-Alcoholado L. Dominguez-Recio M.E. Jimenez-Rodriguez B. Lavado R. Comino-Méndez I. Alba E. Queipo-Ortuño M.I. Breast and Gut Microbiota Action Mechanisms in Breast Cancer Pathogenesis and Treatment Cancers 2020 12 2465 10.3390/cancers12092465 32878124 PMC7565530 19. Basree M.M. Shinde N. Koivisto C. Cuitino M. Kladney R. Zhang J. Stephens J. Palettas M. Zhang A. Kim H.K. Abrupt involution induces inflammation, estrogenic signaling, and hyperplasia linking lack of breastfeeding with increased risk of breast cancer Breast Cancer Res. 2019 21 80 10.1186/s13058-019-1163-7 31315645 PMC6637535 20. Ma H. Ursin G. Xu X. Lee E. Togawa K. Duan L. Lu Y. Malone K.E. Marchbanks P.A. McDonald J.A. Reproductive factors and the risk of triple-negative breast cancer in white women and African-American women: A pooled analysis Breast Cancer Res. 2017 19 6 10.1186/s13058-016-0799-9 28086982 PMC5237290 21. Kumar N. Ehsan S. Banerjee S. Fernandez Perez C. Lhuilier I. Neuner J. Friebel-Klingner T. Fayanju O.M. Nair B. Niinuma S.A. The unique risk factor profile of triple-negative breast cancer: A comprehensive meta-analysis J. Natl. Cancer Inst. 2024 116 1210 1219 10.1093/jnci/djae056 38445713 PMC11308168 22. Palmer J.R. Boggs D.A. Wise L.A. Ambrosone C.B. Adams-Campbell L.L. Rosenberg L. Parity and lactation in relation to estrogen receptor negative breast cancer in African American women Cancer Epidemiol. Biomarkers Prev. 2011 20 1883 1891 10.1158/1055-9965.EPI-11-0465 21846820 PMC3179178 23. Ogony J.W. Radisky D.C. Ruddy K.J. Goodison S. Wickland D.P. Egan K.M. Knutson K.L. Asmann Y.W. Sherman M.E. Immune Responses and Risk of Triple-negative Breast Cancer: Implications for Higher Rates among African American Women Cancer Prev. Res. 2020 13 901 910 10.1158/1940-6207.CAPR-19-0562 32753376 PMC9576802 24. Palmer J.R. Viscidi E. Troester M.A. Hong C.C. Schedin P. Bethea T.N. Bandera E.V. Borges V. McKinnon C. Haiman C.A. Parity, lactation, and breast cancer subtypes in African American women: Results from the AMBER Consortium J. Natl. Cancer Inst. 2014 106 dju237 10.1093/jnci/dju237 25224496 PMC4271113 25. Carey L.A. Perou C.M. Livasy C.A. Dressler L.G. Cowan D. Conway K. Karaca G. Troester M.A. Tse C.K. Edmiston S. Race, breast cancer subtypes, and survival in the Carolina Breast Cancer Study JAMA 2006 295 2492 2502 10.1001/jama.295.21.2492 16757721 26. John E.M. Hines L.M. Phipps A.I. Koo J. Longacre T.A. Ingles S.A. Baumgartner K.B. Slattery M.L. Wu A.H. Reproductive history, breast-feeding and risk of triple negative breast cancer: The Breast Cancer Etiology in Minorities (BEM) study Int. J. Cancer 2018 142 2273 2285 10.1002/ijc.31258 29330856 PMC5893409 27. Millikan R.C. Newman B. Tse C.K. Moorman P.G. Conway K. Dressler L.G. Smith L.V. Labbok M.H. Geradts J. Bensen J.T. Epidemiology of basal-like breast cancer Breast Cancer Res. Treat. 2008 109 123 139 10.1007/s10549-007-9632-6 17578664 PMC2443103 28. Islami F. Liu Y. Jemal A. Zhou J. Weiderpass E. Colditz G. Boffetta P. Weiss M. Breastfeeding and breast cancer risk by receptor status—A systematic review and meta-analysis Ann. Oncol. 2015 26 2398 2407 10.1093/annonc/mdv379 26504151 PMC4855244 29. Kotsopoulos J. Lubinski J. Salmena L. Lynch H.T. Kim-Sing C. Foulkes W.D. Ghadirian P. Neuhausen S.L. Demsky R. Tung N. Hereditary Breast Cancer Clinical Study Group. Breastfeeding and the risk of breast cancer in BRCA1 and BRCA2 mutation carriers Breast Cancer Res. 2012 14 R42 10.1186/bcr3138 22405187 PMC3446376 30. Lim E. Vaillant F. Wu D. Forrest N.C. Pal B. Hart A.H. Asselin-Labat M.L. Gyorki D.E. Ward T. Partanen A. Aberrant luminal progenitors as the candidate target population for basal tumor development in BRCA1 mutation carriers Nat. Med. 2009 15 907 913 10.1038/nm.2000 19648928 31. Lyons T.R. O’Brien J. Borges V.F. Conklin M.W. Keely P.J. Eliceiri K.W. Marusyk A. Tan A.C. Schedin P. Postpartum mammary gland involution drives progression of ductal carcinoma in situ through collagen and COX-2 Nat. Med. 2011 17 1109 1115 10.1038/nm.2416 21822285 PMC3888478 32. Jordan I. Hebestreit A. Swai B. Krawinkel M.B. Breast cancer risk among women with long-standing lactation and reproductive parameters at low risk level: A case-control study in Northern Tanzania Breast Cancer Res. Treat. 2013 142 133 141 10.1007/s10549-010-1255-7 21104009 33. Stordal B. Breastfeeding reduces the risk of breast cancer: A call for action in high-income countries with low rates of breastfeeding Cancer Med. 2023 12 4616 4625 10.1002/cam4.5288 36164270 PMC9972148 34. ElShamy W.M. The protective effect of longer duration of breastfeeding against pregnancy-associated triple negative breast cancer Oncotarget 2016 7 53941 53950 10.18632/oncotarget.9690 27248476 PMC5288234 35. Collaborative Group on Hormonal Factors in Breast Cancer Breast cancer and breastfeeding: Collaborative reanalysis of individual data from 47 epidemiological studies in 30 countries, including 50302 women with breast cancer and 96973 women without the disease Lancet 2002 360 187 195 10.1016/S0140-6736(02)09454-0 12133652 36. Urbaniak C. Reid G. The potential influence of the microbiota and probiotics on women during long spaceflights Womens Health 2016 12 193 198 10.2217/whe.15.101 26901697 PMC5375044 37. Togo A. Dufour J.C. Lagier J.C. Dubourg G. Raoult D. Million M. Repertoire of human breast and milk microbiota: A systematic review Future Microbiol. 2019 14 623 641 10.2217/fmb-2018-0317 31025880 38. Vélez-Ixta J.M. Juárez-Castelán C.J. Ramírez-Sánchez D. Lázaro-Pérez N.D.S. Castro-Arellano J.J. Romero-Maldonado S. Rico-Arzate E. Hoyo-Vadillo C. Salgado-Mancilla M. Gómez-Cruz C.Y. Post Natal Microbial and Metabolite Transmission: The Path from Mother to Infant Nutrients 2024 16 1990 10.3390/nu16131990 38999737 PMC11243545 39. Rodríguez J.M. The origin of human milk bacteria: Is there a bacterial entero-mammary pathway during late pregnancy and lactation? Adv. Nutr. 2014 5 779 784 10.3945/an.114.007229 25398740 PMC4224214 40. Moossavi S. Azad M.B. Origins of human milk microbiota: New evidence and arising questions Gut Microbes 2020 12 1667722 10.1080/19490976.2019.1667722 31684806 PMC7524145 41. McGuire M.K. McGuire M.A. Human milk: Mother nature’s prototypical probiotic food? Adv. Nutr. 2015 6 112 123 10.3945/an.114.007435 25593150 PMC4288270 42. Rad S.K. Yeo K.K.L. Wu F. Li R. Nourmohammadi S. Tomita Y. Price T.J. Ingman W.V. Townsend A.R. Smith E. A Systematic Review and Meta-Analysis of 16S rRNA and Cancer Microbiome Atlas Datasets to Characterize Microbiota Signatures in Normal Breast, Mastitis, and Breast Cancer Microorganisms 2025 13 467 10.3390/microorganisms13020467 40005832 PMC11858161 43. Pannaraj P.S. Li F. Cerini C. Bender J.M. Yang S. Rollie A. Adisetiyo H. Zabih S. Lincez P.J. Bittinger K. Association Between Breast Milk Bacterial Communities and Establishment and Development of the Infant Gut Microbiome JAMA Pediatr. 2017 171 647 654 10.1001/jamapediatrics.2017.0378 28492938 PMC5710346 44. Williams J.E. Price W.J. Shafii B. Yahvah K.M. Bode L. McGuire M.A. McGuire M.K. Relationships Among Microbial Communities, Maternal Cells, Oligosaccharides, and Macronutrients in Human Milk J. Hum. Lact. 2017 33 540 551 10.1177/0890334417709433 28609134 45. Wen Q. Wang S. Fu S. Zhou X. Min Y. Lang J. Chen M. Intratumoral microbiota composition in women’s cancers: A systematic review and meta-analysis Front. Oncol. 2025 15 1544786 10.3389/fonc.2025.1544786 40575164 PMC12197917 46. Li W. Yang J. Investigating the Anna Karenina principle of the breast microbiome BMC Microbiol. 2025 25 81 10.1186/s12866-024-03738-y 39979818 PMC11841003 47. Gerbec Z.J. Serapio-Palacios A. Metcalfe-Roach A. Krekhno Z. Bar-Yoseph H. Woodward S.E. Pena-Díaz J. Nemirovsky O. Awrey S. Moreno S.H. Identification of intratumoral bacteria that enhance breast tumor metastasis mBio 2025 16 e0359524 10.1128/mbio.03595-24 39932300 PMC11898647 48. German R. Marino N. Hemmerich C. Podicheti R. Rusch D.B. Stiemsma L.T. Gao H. Xuei X. Rockey P. Storniolo A.M. Exploring breast tissue microbial composition and the association with breast cancer risk factors Breast Cancer Res. 2023 25 82 10.1186/s13058-023-01677-6 37430354 PMC10332106 49. Smith A. Pierre J.F. Makowski L. Tolley E. Lyn-Cook B. Lu L. Vidal G. Starlard-Davenport A. Distinct microbial communities that differ by race, stage, or breast-tumor subtype in breast tissues of non-Hispanic Black and non-Hispanic White women Sci. Rep. 2019 9 11940 10.1038/s41598-019-48348-1 31420578 PMC6697683 50. Actis S. Cazzaniga M. Bounous V.E. D’Alonzo M. Rosso R. Accomasso F. Minella C. Biglia N. Emerging evidence on the role of breast microbiota on the development of breast cancer in high-risk patients Carcinogenesis 2023 44 718 725 10.1093/carcin/bgad071 37793149 51. Hoskinson C. Zheng K. Gabel J. Kump A. German R. Podicheti R. Marino N. Stiemsma L.T. Composition and Functional Potential of the Human Mammary Microbiota Prior to and Following Breast Tumor Diagnosis mSystems 2022 7 e0148921 10.1128/msystems.01489-21 35642922 PMC9239270 52. Urbaniak C. Cummins J. Brackstone M. Macklaim J.M. Gloor G.B. Baban C.K. Scott L. O’Hanlon D.M. Burton J.P. Francis K.P. Microbiota of human breast tissue Appl. Environ. Microbiol. 2014 80 3007 3014 10.1128/AEM.00242-14 24610844 PMC4018903 53. Hieken T.J. Chen J. Hoskin T.L. Walther-Antonio M. Johnson S. Ramaker S. Xiao J. Radisky D.C. Knutson K.L. Kalari K.R. The Microbiome of Aseptically Collected Human Breast Tissue in Benign and Malignant Disease Sci. Rep. 2016 6 30751 10.1038/srep30751 27485780 PMC4971513 54. Banerjee S. Tian T. Wei Z. Shih N. Feldman M.D. Peck K.N. DeMichele A.M. Alwine J.C. Robertson E.S. Distinct Microbial Signatures Associated with Different Breast Cancer Types Front. Microbiol. 2018 9 951 10.3389/fmicb.2018.00951 29867857 PMC5962706 55. Fuhrman B.J. Feigelson H.S. Flores R. Gail M.H. Xu X. Ravel J. Goedert J.J. Associations of the fecal microbiome with urinary estrogens and estrogen metabolites in postmenopausal women J. Clin. Endocrinol. Metab. 2014 99 4632 4640 10.1210/jc.2014-2222 25211668 PMC4255131 56. Fernández-Murga M.L. Gil-Ortiz F. Serrano-García L. Llombart-Cussac A. A New Paradigm in the Relationship between Gut Microbiota and Breast Cancer: β-glucuronidase Enzyme Identified as Potential Therapeutic Target Pathogens 2023 12 1086 10.3390/pathogens12091086 37764894 PMC10535898 57. Wu S. Luo G. Jiang F. Jia W. Li J. Huang T. Zhang X. Mao Y. Su S. Han W. Early life bifidobacterial mother-infant transmission: Greater contribution from the infant gut to human milk revealed by microbiomic and culture-based methods mSystems 2025 10 e0048025 10.1128/msystems.00480-25 40558046 PMC12282193 58. Ait Zenati F. Baldi S. Di Gloria L. Djoudi F. Bertorello S. Ramazzotti M. Niccolai E. Amedei A. Compositional and Functional Disparities in the Breast Oncobiome Between Patients Living in Urban or Rural Areas Genes 2025 16 806 10.3390/genes16070806 40725462 PMC12295151 59. Samarra A. Alcañiz A.J. Martínez-Costa C. Marina A. Comas I. Segata N. Quijada N.M. Collado M.C. Breastfeeding and early Bifidobacterium Nat. Commun. 2025 16 6099 10.1038/s41467-025-61154-w 40603287 PMC12222458 60. Rodrigues M.F. Carvalho É. Pezzuto P. Rumjanek F.D. Amoêdo N.D. Reciprocal modulation of histone deacetylase inhibitors sodium butyrate and trichostatin A on the energy metabolism of breast cancer cells J. Cell. Biochem. 2015 116 797 808 10.1002/jcb.25036 25510910 61. González-Bosch C. Zunszain P.A. Mann G.E. Control of Redox Homeostasis by Short-Chain Fatty Acids: Implications for the Prevention and Treatment of Breast Cancer Pathogens 2023 12 486 10.3390/pathogens12030486 36986408 PMC10058806 62. Smith A. Cao X. Gu Q. Kubi Amos-Abanyie E. Tolley E.A. Vidal G. Lyn-Cook B. Starlard-Davenport A. Characterization of the Metabolome of Breast Tissues from Non-Hispanic Black and Non-Hispanic White Women Reveals Correlations between Microbial Dysbiosis and Enhanced Lipid Metabolism Pathways in Triple-Negative Breast Tumors Cancers 2022 14 4075 10.3390/cancers14174075 36077608 PMC9454857 63. Zhang L. Huang S. Yuan Y. Butyrate inhibits the malignant biological behaviors of breast cancer cells by facilitating cuproptosis-associated gene expression J. Cancer Res. Clin. Oncol. 2024 150 287 10.1007/s00432-024-05807-1 38833016 PMC11150186 64. Guo Y. Dong W. Sun D. Zhao X. Huang Z. Liu C. Sheng Y. Bacterial metabolites: Effects on the development of breast cancer and therapeutic efficacy (Review) Oncol. Lett. 2025 29 210 10.3892/ol.2025.14956 40070782 PMC11894516 65. Kovács T. Mikó E. Ujlaki G. Sári Z. Bai P. The Microbiome as a Component of the Tumor Microenvironment Adv. Exp. Med. Biol. 2020 1225 137 153 10.1007/978-3-030-35727-6_10 32030653 66. Tzeng A. Sangwan N. Jia M. Liu C.C. Keslar K.S. Downs-Kelly E. Fairchild R.L. Al-Hilli Z. Grobmyer S.R. Eng C. Human breast microbiome correlates with prognostic features and immunological signatures in breast cancer Genome Med. 2021 13 60 10.1186/s13073-021-00874-2 33863341 PMC8052771 67. Meng S. Chen B. Yang J. Wang J. Zhu D. Meng Q. Zhang L. Study of Microbiomes in Aseptically Collected Samples of Human Breast Tissue Using Needle Biopsy and the Potential Role of in situ Tissue Microbiomes for Promoting Malignancy Front. Oncol. 2018 8 318 10.3389/fonc.2018.00318 30175072 PMC6107834 68. de Moreno de LeBlanc A. Matar C. Thériault C. Perdigón G. Effects of milk fermented by Lactobacillus helveticus Immunobiology 2005 210 349 358 10.1016/j.imbio.2005.05.024 16164041 69. Yazdi M.H. Soltan Dallal M.M. Hassan Z.M. Holakuyee M. Agha Amiri S. Abolhassani M. Mahdavi M. Oral administration of Lactobacillus acidophilus Br. J. Nutr. 2010 104 227 232 10.1017/S0007114510000516 20193099 70. Sribenja S. Maguire O. Attwood K. Buas M.F. Palmer J.R. Ambrosone C.B. Higgins M.J. Deletion of Foxa1 Am. J. Cancer Res. 2021 11 3263 3270 34249460 PMC8263678 71. Chowdhury R. Sinha B. Sankar M.J. Taneja S. Bhandari N. Rollins N. Bahl R. Martines J. Breastfeeding and maternal health outcomes: A systematic review and meta-analysis Acta Paediatr. 2015 104 96 113 10.1111/apa.13102 26172878 PMC4670483 72. Bian Y. Lei Y. Wang C. Wang J. Wang L. Liu L. Liu L. Gao X. Li Q. Epigenetic Regulation of miR-29s Affects the Lactation Activity of Dairy Cow Mammary Epithelial Cells J. Cell Physiol. 2015 230 2152 2163 10.1002/jcp.24944 25656908 73. Qin W. Tsukasaki Y. Dasgupta S. Mukhopadhyay N. Ikebe M. Sauter E.R. Exosomes in Human Breast Milk Promote EMT Clin. Cancer Res. 2016 22 4517 4524 10.1158/1078-0432.CCR-16-0135 27060153 74. Al-Shami K. Awadi S. Khamees A. Alsheikh A.M. Al-Sharif S. Ala’ Bereshy R. Al-Eitan S.F. Banikhaled S.H. Al-Qudimat A.R. Al-Zoubi R.M. Estrogens and the risk of breast cancer: A narrative review of literature Heliyon 2023 9 e20224 10.1016/j.heliyon.2023.e20224 37809638 PMC10559995 75. Rubinstein M.M. Brown K.A. Iyengar N.M. Targeting obesity-related dysfunction in hormonally driven cancers Br. J. Cancer 2021 125 495 509 10.1038/s41416-021-01393-y 33911195 PMC8368182 76. Mir R. Albarqi S.A. Albalawi W. Alatwi H.E. Alatawy M. Bedaiwi R.I. Almotairi R. Husain E. Zubair M. Alanazi G. Emerging Role of Gut Microbiota in Breast Cancer Development and Its Implications in Treatment Metabolites 2024 14 683 10.3390/metabo14120683 39728464 PMC11676198 77. Filippou C. Themistocleous S.C. Marangos G. Panayiotou Y. Fyrilla M. Kousparou C.A. Pana Z.D. Tsioutis C. Johnson E.O. Yiallouris A. Microbial Therapy and Breast Cancer Management: Exploring Mechanisms, Clinical Efficacy, and Integration within the One Health Approach Int. J. Mol. Sci. 2024 25 1110 10.3390/ijms25021110 38256183 PMC10816061 78. Zhou Y. Han W. Feng Y. Wang Y. Sun T. Xu J. Microbial metabolites affect tumor progression, immunity and therapy prediction by reshaping the tumor microenvironment (Review) Int. J. Oncol. 2024 65 73 10.3892/ijo.2024.5661 38847233 PMC11173369 79. Mohseni A.H. Taghinezhad-S S. Casolaro V. Lv Z. Li D. Potential links between the microbiota and T cell immunity determine the tumor cell fate Cell Death Dis. 2023 14 154 10.1038/s41419-023-05560-2 36828830 PMC9958015 80. Zhao L.-Y. Mei J.-X. Yu G. Lei L. Zhang W.-H. Liu K. Chen X.-L. Kołat D. Yang K. Hu J.-K. Role of the gut microbiota in anticancer therapy: From molecular mechanisms to clinical applications Sig. Transduct. Target Ther. 2023 8 201 10.1038/s41392-023-01406-7 PMC10183032 37179402 81. Jiang Y. Li Y. Nutrition Intervention and Microbiome Modulation in the Management of Breast Cancer Nutrients 2024 16 2644 10.3390/nu16162644 39203781 PMC11356826 82. Lakritz J.R. Poutahidis T. Levkovich T. Varian B.J. Ibrahim Y.M. Chatzigiagkos A. Mirabal S. Alm E.J. Erdman S.E. Beneficial bacteria stimulate host immune cells to counteract dietary and genetic predisposition to mammary cancer in mice Int. J. Cancer 2014 135 529 540 10.1002/ijc.28702 24382758 PMC4131439 83. Kassayová M. Bobrov N. Strojný L. Kisková T. Mikeš J. Demečková V. Orendáš P. Bojková B. Péč M. Kubatka P. Preventive effects of probiotic bacteria Lactobacillus plantarum Anticancer Res. 2014 34 4969 4975 25202079 84. Imani Fooladi A.A. Yazdi M.H. Pourmand M.R. Mirshafiey A. Hassan Z.M. Azizi T. Mahdavi M. Soltan Dallal M.M. Th1 Cytokine Production Induced by Lactobacillus acidophilus Jundishapur. J. Microbiol. 2015 8 e17354 10.5812/jjm.8(4)2015.17354 26034546 PMC4449865 85. Study to Investigate Efficacy of a Novel Probiotic on the Bacteriome and Mycobiome of Breast Cancer Available online: https://clinicaltrials.gov/study/NCT04362826 (accessed on 5 July 2025) 86. Wu H. Ganguly S. Tollefsbol T.O. Modulating Microbiota as a New Strategy for Breast Cancer Prevention and Treatment Microorganisms 2022 10 1727 10.3390/microorganisms10091727 36144329 PMC9503838 87. Pellegrini M. Ippolito M. Monge T. Violi R. Cappello P. Ferrocino I. Cocolin L.S. De Francesco A. Bo S. Finocchiaro C. Gut microbiota composition after diet and probiotics in overweight breast cancer survivors: A randomized open-label pilot intervention trial Nutrition 2020 74 110749 10.1016/j.nut.2020.110749 32234652 88. Shively C.A. Register T.C. Appt S.E. Clarkson T.B. Uberseder B. Clear K.Y.J. Wilson A.S. Chiba A. Tooze J.A. Cook K.L. Consumption of Mediterranean versus Western Diet Leads to Distinct Mammary Gland Microbiome Populations Cell Rep. 2018 25 47 56.e3 10.1016/j.celrep.2018.08.078 30282037 PMC6338220 89. Karin M. Jobin C. Balkwill F. Chemotherapy, immunity and microbiota—A new triumvirate? Nat. Med. 2014 20 126 127 10.1038/nm.3473 24504404 PMC4339017 90. Huang M. Zhang Y. Chen Z. Yu X. Luo S. Peng X. Li X. Gut microbiota reshapes the TNBC immune microenvironment: Emerging immunotherapeutic strategies Pharmacol. Res. 2025 215 107726 10.1016/j.phrs.2025.107726 40184763 Figure 1 A Venn diagram illustrates the intersection of bacterial taxa between healthy and tumor-associated breast tissue microbiota. This diagram compares the breast microbiota identified in healthy tissue and tumor tissue from breast cancer patients, with the overlapping area representing bacterial genera and families found in both. Healthy tissue microbiota includes genera such as Lactobacillus Streptococcus Bifidobacterium Methylobacterium Sphingomonas Prevotella Propionibacterium Staphylococcus Escherichia Bacillus Ralstonia Atopobium Paenibacillus Pseudomonas Corynebacterium Propionibacterium Ralstonia Streptococcus Lactobacillus Figure 2 Protective and promotive mechanisms of the breast microbiota in TNBC. Beneficial taxa such as Lactobacillus Bifidobacterium Ralstonia Staphylococcus aureus Bacillus 18 47 52 Figure 3 Microbiota’s Influence on Breast Cancer Subtypes. This figure illustrates the contrasting roles of the tumor microbiota in TNBC versus Luminal or HER2-positive breast cancers. Left Side (TNBC): Dysbiotic microbiota, characterized by a predominance of pathogenic species, drives an inflammatory environment. This leads to tumor progression, enhanced metastatic potential, and a less favorable prognosis. This side is associated with factors like the absence of breastfeeding, which influences the microbial balance in a way that favors these harmful organisms. Right Side (Luminal or HER2-positive Breast Cancer): This tumor type is associated with a more immunotolerant microbiota. This microbial community does not promote the same level of chronic inflammation or metabolic dysregulation as seen in TNBC, leading to a different tumor progression pathway. The figure’s central point of comparison highlights how specific microbial compositions can tilt the balance toward either protection or progression, emphasizing the distinct mechanisms at play in different breast cancer subtypes. Figure 4 Integrative model linking breastfeeding, microbiota, and TNBC protection. This conceptual framework illustrates how breastfeeding practices shape the breast and milk microbiota, influencing host immune, inflammatory, and metabolic pathways that ultimately affect TNBC risk. Prolonged breastfeeding promotes the enrichment of beneficial taxa such as Lactobacillus Bifidobacterium Ralstonia Bacillus Staphylococcus Escherichia coli pathogens-14-00946-t001_Table 1 Table 1 Epidemiological evidence linking breastfeeding duration with breast cancer risk, with emphasis on triple-negative breast cancer (TNBC). This table summarizes major cohort, case–control, and pooled analyses evaluating the association between breastfeeding and breast cancer risk across different populations and subtypes. The studies consistently show that prolonged breastfeeding reduces the risk of TNBC and basal-like tumors, mitigates the parity-associated increase in ER-negative disease, and provides additional protection in BRCA1 carriers. Experimental models further support the notion that abrupt involution, mimicking a lack of breastfeeding, induces inflammatory and progenitor cell changes that may predispose individuals to TNBC. (Abbreviations: AA, African-American; AF, attributable fraction; BF, breastfeeding; PAF, population attributable fraction; WHR, waist-to-hip ratio; ER, estrogen receptor; PR, progesterone receptor; HER2, human epidermal growth factor receptor 2; BRCA, breast cancer susceptibility gene; CI, confidence interval; OR, odds ratio; HR, hazard ratio). Study (Year) [Ref.] Design/Population Exposure Metric Outcome/Subtype Effect Size (95% CI) Collaborative Group, Lancet (2002) [ 35 Collaborative re-analysis, 47 studies (30 countries) Per 12 months of breastfeeding (lifetime) All breast cancer RR↓ 4.3% (95% CI 2.9–5.8; p p Islami et al., Ann. Oncol. (2015) [ 28 Systematic review & meta-analysis (27 studies; 36,881 cases) Ever vs. never breastfeeding (parous women) TNBC OR 0.78 (0.66–0.91) Ma, et al., Breast Cancer Res. (2017) [ 20 Pooled analysis of 3 population-based case-control studies ≥1 year vs. never (parous) TNBC OR 0.69 (0.50–0.96) John, et al., BEM Study, Int. J. Cancer (2018) [ 26 Multiethnic case-control (<50 y focus) ≥24 mo vs. 0 mo (parous, <50 y) TNBC OR 0.52 (0.26–1.04) (borderline) Kotsopoulos, et al., Cancer Res. (2012) [ 29 Case-control, BRCA carriers ≥1 y vs. <1 y; ≥2 y BRCA1-associated BC OR 0.68 (0.52–0.91); ≥2 y: OR 0.51 (0.35–0.74) Chehayeb, et al., NPJ Breast Cancer (2025) [ 6 Population-level modelling (US) Attributable fraction estimate TNBC AF: ~15% (Black) & ~12% (White) potentially avoidable with BF support AMBER Consortium (Palmer, et al., 2014, JNCI) [ 24 Multi-study consortium of African-American women Parity × breastfeeding (ever/never; by number of births) ER- and TNBC Parous vs. nulliparous: OR 1.33 (1.11–1.59) for ER-; among never-breastfed, ≥4 y vs. 1 birth OR 1.68 (1.15–2.44); breastfeeding attenuated the parity-associated ER- risk Black Women’s Health Study (Palmer, et al., 2011, CEBP) [ 22 Prospective cohort (AA women) Parity; breastfeeding (ever/never) ER-/PR- 3+ vs. 0 births: HR 1.48 (0.98–1.84) for ER-/PR-; among women who had breastfed, high parity was no longer associated with increased ER-/PR- incidence Carolina Breast Cancer Study (Millikan et al., 2008, BCRT) [ 27 Population-based case-control Never vs. ever breastfeeding; central adiposity (WHR) Basal-like (≈TNBC) Joint PAF ≈53% For Basal-Like from Never breastfeeding + elevated WHR; up to 68% preventable in younger AA women with breastfeeding promotion & adiposity reduction Pregnancy-associated TNBC (ElShamy, 2016, Oncotarget) [ 34 Narrative synthesis + experiment Breastfeeding duration Pregnancy-associated TNBC Summarizes evidence that longer lactation lowers risk; cites does-response for overall BC (~4.3% lower RR per 12 months BF) ",
  "metadata": {
    "Title of this paper": "Gut microbiota reshapes the TNBC immune microenvironment: Emerging immunotherapeutic strategies",
    "Journal it was published in:": "Pathogens",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473010/"
  }
}