{
  "title": "Paper_542",
  "abstract": "pmc J Vet Intern Med J Vet Intern Med 2684 jvim JVIM Journal of Veterinary Internal Medicine 0891-6640 1939-1676 Wiley PMC12481043 PMC12481043.1 12481043 12481043 41024717 10.1111/jvim.70214 JVIM70214 JVIM-25-156.R4 1 Standard Article STANDARD ARTICLE Food & Fiber Animal Nutrition Complementary Muscle Metabolomics and Proteomics of Muscle in Cows With Post‐Calving Ketosis Tang Tao  1 Zhou Jing  1 Shao Jiahao  1 Wang Meigui  1 Xia Siqi  1 Sun Wenqiang  2 Jia Xianbo  2 Wang Jie  2 Lai Songjia https://orcid.org/0000-0003-2830-2425  2 laisj5794@sicau.edu.cn   1 College of Animal Science and Technology Sichuan Agricultural University Chengdu Sichuan China   2 Farm Animal Genetic Resources Exploration and Innovation Key Laboratory of Sichuan Province Sichuan Agricultural University Chengdu Sichuan China * Correspondence: laisj5794@sicau.edu.cn 30 9 2025 Nov-Dec 2025 39 6 497492 10.1111/jvim.v39.6 e70214 02 8 2025 31 3 2025 13 8 2025 30 09 2025 01 10 2025 01 10 2025 © 2025 The Author(s). Journal of Veterinary Internal Medicine https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ ABSTRACT Background The muscle tissue of dairy cows is a site of β‐hydroxybutyrate (BHBA) metabolism. The mechanisms underlying the changes in proteins and metabolites in the muscle tissue of cows with ketosis remain unclear. Objectives To elucidate the metabolic and physiological molecular adaptation mechanisms in the muscle tissue of cows with ketosis through metabolomics and proteomics. Animals Six cows diagnosed with ketosis (CK, BHBA ≥ 2.4 mM) and six apparently healthy cows with BHBA < 1 mM (Con), all 1 week postpartum. Methods Prospective cohort observational study. The content of BHBA in whole blood was detected by WST‐1 and TNN methods. HE staining was used to observe the physiological changes in the muscle tissue of cows with ketosis. Metabolomic analysis, proteomic analysis, and WB experiments were employed to identify differential metabolites and proteins. Results The 685 metabolites and 356 proteins were identified to be differentially expressed in the CK group. In the muscle tissue of cows with ketosis, significant changes were observed in processes such as oxidative phosphorylation, PPAR signaling pathway, TCA cycle, amino acid degradation, and fatty acid oxidation. At the protein level, SDHA, SDHB, QCR6, QCR7, and IDH2 were significantly downregulated, while metabolites such as pyruvate were downregulated and BHBA was upregulated. Conclusions and Clinical Importance The TCA cycle and mitochondrial respiratory chain in the muscle tissue of cows with ketosis might be impaired. These results provide valuable insights into the metabolic mechanisms of muscle tissue in cows with ketosis. ketosis cow metabolomics proteomics skeletal muscle Sichuan Innovation Team of National Modern Agricultural Industry Technology System SCCXTD‐2025‐13 Sichuan Key Research and Development Project on Innovative Breeding Materials, Methods, and New Breeds of High‐Quality Cattle 2021YFYZ0001 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date November/December 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:30.09.2025  T. Tang J. Zhou J. Shao Complementary Muscle Metabolomics and Proteomics of Muscle in Cows With Post‐Calving Ketosis Journal of Veterinary Internal Medicine 39 6 2025 e70214 10.1111/jvim.70214 41024717  Funding: Abbreviations BHBA β‐hydroxybutyrate BP biological process CC cellular component CK clinical ketosis Con healthy controls DMP differently produced metabolites DSP differentially synthesized proteins KEGG Kyoto Encyclopedia of Genes and Genomes MF molecular function NEB negative energy balance NEFA non‐esterified fatty acids ROS reactive oxygen species 1 Introduction After calving, due to the imbalance between energy intake and expenditure, dairy cows enter a state of negative energy balance (NEB) [ 1 2 3 4 5 6 7 8 Metabolomics technology is a powerful tool for elucidating the causes of diseases, determining disease diagnosis, and detecting and monitoring biomarkers [ 9 10 11 12 13 14 The combined analysis of these two methods is essential for enhancing our understanding of cellular signaling networks, revealing the intricate dynamics of protein‐metabolite interactions across different cellular states, and improving our diagnostic capabilities as well as molecular insights into potential disease mechanisms. In this study, we hypothesize that the metabolomic and proteomic profiles of muscle tissue from cows diagnosed with clinical ketosis will differ from those of healthy controls. By employing liquid chromatography‐mass spectrometry (LC/MS) based metabolomics and proteomics approaches, we aim to gain a comprehensive understanding of the metabolic patterns in the muscle tissues of cows with ketosis, while also providing preliminary insights into the metabolic mechanisms related to BHBA. Through the integration of metabolomics and proteomics data, we can identify key regulatory factors associated with BHBA metabolism in the muscle tissues of ketosis cows and construct critical protein‐metabolite networks. 2 Materials and Methods 2.1 Experimental Animals and Muscle Tissue Samples The Institutional Animal Care and Use Committee of the College of Animal Science and Technology, Sichuan Agricultural University, China, approved all experimental procedures using cows in our study (Certification No. SYXK2019‐187) The experiment was conducted at a modern dairy farm in Mianyang, Sichuan Province. We selected 70 cows that were all in their third lactation and had due dates within ±7 days, ensuring they had similar body condition scores (Table S1 The experimental cows were raised in the same environment, with identical food, straw used as bedding, free access to fresh water, and consistent management practices. During the dry period, TMR was fed twice a day at 11:00 and 19:00. After calving, TMR was fed three times daily at 06:00, 14:00, and 23:00. The composition and ingredients of the feed are detailed in the study by Wu [ 15 Significantly, the cows diagnosed with ketosis received prompt treatment immediately after the collection of blood and muscle tissue samples. The clinical symptoms observed in the cows included in this study were generally mild, with only a few individuals presenting with abomasal displacement. The primary treatment protocol consisted of oral administration of propylene glycol and glucose solution twice daily, in the morning and evening. For cows with abomasal displacement, intravenous glucose infusion was administered in addition to oral glucose supplementation, along with appropriate vitamin and mineral support as necessary. During the subsequent days, blood BHBA concentrations were continuously monitored, and clinical observations were performed to evaluate the progression of recovery. 2.2 Detection of BHBA WST HE The laboratory conducted further testing on the whole blood samples selected by TNN using the β‐hydroxybutyrate (β‐HB) content measurement kit (Solarbio, Beijing, bc 16 Muscle tissue samples underwent dehydration, clearing, paraffin embedding, and sectioning, followed by the hematoxylin and eosin stain (H&E) method. Histopathological changes were examined under a microscope (OLYMPUS, Japan, BX53F), allowing for a comprehensive analysis of the entire tissue section. The cross‐sectional area of muscle fibers in the CK and Con groups (six images per group, 200×) muscle tissue images obtained through the microscopic imaging system was analyzed using Image J (v 1.53, Bethesda, MD, USA). 2.3 Liquid Chromatography‐Mass Spectrometry Metabolomics Analysis The extraction of metabolites, The LC–MS analysis was performed using the Ultim3000 high‐performance liquid chromatography system coupled with the Orbitrap Exploris 480 high‐resolution mass spectrometer (Thermo, USA), and data preprocessing and annotation were similar to previous studies [ 17 18 https://www.ncbi.nlm.nih.gov/Structure/cdd/wrpsb.cgi N https://www.mzcloud.org https://www.mzvault.org https://www.chemspider.com 2.4 Liquid Chromatography‐Mass Spectrometry Proteomics Analysis The process begins with the extraction and digestion of the sample proteins. To the sample, 300 μL of 8 M urea and a protease inhibitor were added. The mixture was centrifuged at 14,000 g 2.5 Western Blot Analysis The protein samples used in western blotting are identical to those employed in proteomics analysis. Boil the protein samples at 99°C for 10 min. Then, separate 35 μg of total protein per sample by SDS‐PAGE and transfer them to a PVDF membrane (0.22 μm, Merck Millipore) using the wet transfer method (400 mA, 60 min). Incubate gently at room temperature for 2 h in Tris‐buffered saline with Tween (TBST; 150 mM NaCl, 50 mM Tris, pH 8.8, 0.1% Tween 20) containing 5.0% NON‐Fat powdered milk (Sangon, Shanghai, JC28BA0010). After washing the membrane three times with TBST, incubate it at 4°C for 12 h in PBS containing the primary antibody. The specific details of the primary antibody are provided in Table S2 2.6 Data Processing, Bioinformatics, and Statistical Analysis The metabolomics analysis process was similar to previous studies [ 19 p Padj p t p t p p p p 3 Results 3.1 Determination of BHBA HE The concentration of BHBA in the serum of postpartum cows was measured using a handheld TNN device, and the cows were grouped according to BHBA concentrations. Cows with a serum BHBA concentration ≥ 2.40 mM were classified into the CK ( n n 1A p 1B 1C p < 1D FIGURE 1 Experimental design and determination of BHAB concentration and HE staining of muscle tissue (200×). (A) Experimental design and sample collection. (B) The concentration of BHBA was determined by WST‐1 (the numbers in the bar chart represent the mean ± SD). (C) Muscle tissue was stained with HE (200×). (D) Muscle fiber cross‐sectional area statistics ( n 3.2 Metabolite Profiles Protein of Muscle Samples and Data Analysis Based on the Orbitrap LC–MS platform, a qualitative and quantitative analysis of metabolites was conducted on a total of 12 samples from the Con and CK groups. This report presents the metabolites detected under default conditions, with a total of 1342 peaks identified, of which 1252 metabolites were annotated (Table S3 S4 2A,B R 2 Y 2C 2D FIGURE 2 Quality control of proteomic and metabolomics data. (A) Principal component analysis (PCA) of metabolites in the Con and CK groups in the metabolomics. (B) PCA of proteins in the Con and CK groups in the proteomics. (C) OPLS‐DA analysis in the metabolomics. (D) Distribution of relative standard deviation (RSD) for Con and CK groups in proteomics. 3.3 Differential Metabolite and Pathway Analysis Under the criteria of FC > 1, VIP ≥ 1.0, and p S5 3A 3B 3C FIGURE 3 Analysis of differential metabolites in metabolomics: Con versus CK. (A) Volcano plot of differential metabolites between Con and CK under default mode ( n p x 3.4 Differential Protein and Pathway Analysis Under the criteria of FC > 1 and p S6 4A 4B p 4C 1 4D 5 FIGURE 4 Differential protein and pathway analysis. (A) Volcano plot of differential protein between Con and CK ( n p TABLE 1 Important differential synthesis proteins in muscle tissue of ketosis dairy cows ( n  a Gene name Protein Accession log2FC Trend  b  p  c APOH Apolipoprotein H A0A140T843 −0.806 − < 0.01 SDHB Succinate Dehydrogenase Complex Subunit B A0A3Q1LZ07 −0.410 − < 0.01 HAGH Hydroxyacyl‐CoA dehydrogenase A0A3Q1ND53 −0.423 − < 0.01 ALDH7A1 Aldehyde Dehydrogenase 7 Family Member A1 A0A3S5ZP98 −0.427 − < 0.01 ATP5F1B ATP Synthase F1 Subunit Beta A0A452DII8 0.692 + 0.001 GPD1 Glycerol‐3‐Phosphate Dehydrogenase 1 A0A452DJJ3 −0.550 − < 0.01 SLC25A4 Solute Carrier Family 25 Member 4 A0A4W2BY60 1.161 + < 0.01 SUCLG1 Succinate‐CoA Ligase Glycosylated Subunit 1 A0A4W2CBS2 1.048 + < 0.01 UGP2 UDP‐Glucose Pyrophosphorylase 2 A0A4W2CCV6 0.735 + 0.001 PRDX6 Peroxiredoxin 6 A0A4W2CJ87 0.318 + < 0.01 FABP5 Fatty Acid Binding Protein 5 A0A4W2CPJ9 0.570 + 0.002 NDUFA5 NADH: ubiquinone oxidoreductase subunit A5 A0A4W2CSL0 0.891 + 0.009 CRAT Carnitine O‐acetyltransferase A0A4W2CU46 0.777 + 0.024 TNNT1 Troponin T, Skeletal Muscle A0A4W2D1S0 0.466 + 0.022 TIMM13 Translocase of Inner Mitochondrial Membrane 13 A0A4W2D6S0 2.264 + < 0.01 SQSTM1 Sequestosome 1 A0A4W2DDV1 2.149 + < 0.01 ACADM Acyl‐CoA Dehydrogenase, Medium‐Chain A0A4W2DHN1 0.400 + 0.025 SOD3 Superoxide Dismutase 3 A0A4W2DIK2 1.074 + < 0.01 BIN1 Bridging Integrator 1 A0A4W2DPC0 0.333 + < 0.01 ST13 Suppressor of Tumorigenicity 13 A0A4W2DUJ5 0.241 + < 0.01 ETFA Electron Transfer Flavoprotein Alpha Subunit A0A4W2DX30 0.272 + 0.016 COQ9 Coenzyme Q9 A0A4W2E053 1.216 + < 0.01 CKMT2 Creatine Kinase, Mitochondrial 2 A0A4W2E2M7 0.407 + 0.029 MAP2K6 Mitogen‐Activated Protein Kinase Kinase 6 A0A4W2E5A9 0.896 + 0.019 ME1 Malic Enzyme 1 A0A4W2E9T3 0.701 + 0.022 IDH3A Isocitrate Dehydrogenase 3 Alpha A0A4W2EG40 1.616 + < 0.01 NDUFS3 NADH:ubiquinone oxidoreductase Fe‐S protein 3 A0A4W2EKS6 −0.404 − < 0.01 HADH Hydroxyacyl‐CoA Dehydrogenase A0A4W2F1T0 −1.065 − 0.019 GLOD4 Glutamate Oxidase Domain Containing 4 A0A4W2FXR4 0.559 + < 0.01 MYH4 Myosin Heavy Chain 4 A0A4W2G576 −1.578 − < 0.01 DLST Dihydrolipoamide S‐succinyltransferase A0A4W2GWM3 0.702 + < 0.01 FDX2 Ferredoxin 2 A0A4W2H1Z0 0.517 + < 0.01 FABP3 Fatty Acid Binding Protein 3 A0A4W2HP58 0.972 + < 0.01 DHRS11 Dehydrogenase/Reductase 11 A0A4W2I5W2 0.551 + 0.003 TUFM Mitochondrial Elongation Factor Tu A0A4W2I843 0.642 + 0.025 ATP2A1 Calcium ATPase 2A A0A4W2IA03 0.807 + 0.023 OPTN Optineurin A0A4W2IAY1 3.535 + < 0.01 FAHD1 Fumarylacetoacetate Hydrolase Domain Containing 1 A0A4W2INI1 0.580 + 0.025 FABP4 Fatty Acid Binding Protein 4 F1MHQ4 2.295 + 0.001 MYH7 Myosin Heavy Chain 7 F1MM07 −1.025 − < 0.01 SDHA Succinate Dehydrogenase Complex Subunit A G5E6M7 −1.141 − < 0.01 COX5A Cytochrome c Oxidase Subunit 5A P00426 0.805 + 0.008 NDUFV2 NADH Dehydrogenase (Ubiquinone) Fe‐S Protein 2) P04394 0.524 + 0.009 IDH2 Isocitrate Dehydrogenase 2 Q04467 −0.338 − 0.047 MDH1 Malate Dehydrogenase 1 Q3T145 0.317 + 0.029 MDH2 Malate Dehydrogenase 2 Q32LG3 0.337 + 0.005 PRDX1 Peroxiredoxin 1 Q5E947 0.359 + 0.016 Abbreviation: log2FC, log2(fold change).  a The table only shows the differentially synthesized proteins in significant pathways from the Kyoto Encyclopedia of Genes and Genomes (KEGG) database.  b + and −: abundance increased and decreased in the CK group, respectively.  c  p t FIGURE 5 The expression pattern of differential proteins in the muscle tissue of periparturient ketosis dairy cows ( n 3.5 Integrating Metabolomics and Proteomics Analyses Using the KEGG Mapper tool, the DSP and DPM were mapped to the significantly altered KEGG pathways [ 20 6 7 FIGURE 6 Integrating metabolomics and proteomics analyses. (A) Schematic diagram of the effects of different proteins and metabolites in muscle biopsies of cows with ketosis after calving on amino acid (AA), carbohydrate metabolism and energy metabolism. Schematic diagrams of the peroxisome proliferator‐activated receptor (PPAR) signaling pathway (B) and fatty acid oxidation (C). Please note that this is a hypothetical relationship based on current data. The green rectangles surround the proteins. Red arrows indicate upregulation in the CK group, while blue arrows indicate downregulation. The black dashed boxes represent metabolic processes, and black arrows indicate reaction processes. For specific protein names, refer to Table 1 FIGURE 7 Effects of different proteins and metabolites in muscle biopsies of cows with ketosis after calving on oxidative phosphorylation. Red arrows indicate upregulation in the CK group, while blue arrows indicate downregulation. The black dashed boxes represent metabolic processes. Orange arrows indicate reaction processes. Black arrows show the direction of electron transfer, and blue arrows indicate the direction of H + 1 4 Discussion This study conducted metabolomics and proteomics sequencing on the muscle tissue of ketosis cows within 1 week after calving, along with HE staining. Omics found that proteins such as SDHA, SDHB, QCR6, QCR7, and IDH2 were significantly downregulated, while metabolites like pyruvate were downregulated and BHBA, arachidonic acid, and others were upregulated. Additionally, combined with the HE staining results, it suggested that muscle tissue in ketosis cows might be damaged, the TCA cycle and mitochondrial respiratory chain might be impaired, and the oxidative stress state might be elevated. 4.1 Skeletal Muscle Injury of CK During the transition period, the imbalance between energy demand and energy intake in cows can lead to NEB. Additionally, the demand for glucose and metabolizable energy postpartum is higher than that before calving [ 21 22 23 2 24 25 In skeletal muscle, different muscle fiber types perform distinct biological functions. Type I muscle fibers have higher activities of GPX, SOD, CAT, and other enzymes, which enable them to resist reactive oxygen species (ROS) produced by the body [ 26 27 4.2 Carbohydrate Metabolism in the Muscle Tissue of CK Isocitrate dehydrogenase (IDH) catalyzes the oxidative decarboxylation of isocitrate, producing α‐ketoglutarate and CO 2 28 29 + 30 31 32 Eukaryotic protein Fumarate acyl‐coenzyme A hydrolase domain‐containing protein 1 (FAHD1) plays a crucial role in regulating the integration of the tricarboxylic acid cycle as a mitochondrial oxaloacetate decarboxylase (ODx) [ 33 34 35 In this study, the levels of upstream metabolites related to the TCA cycle, such as L‐glutamate, proline, lysine, and threonine, increased, which might be associated with the impairment of the TCA cycle. Additionally, in the muscle fibers of cows with postpartum ketosis, the TCA cycle is inhibited, suggesting disrupted energy metabolism, increased oxidative stress, and excessive production of BHBA. However, due to the limited sample size and sampling constraints (such as the absence of pre‐calving muscle samples), it can only be speculated that ROS damage exists in the muscle tissue of cows with ketosis, and further experiments are needed to verify this. 4.3 Lipid Metabolism The PPAR signaling pathway is an important metabolic regulatory pathway that primarily participates in physiological processes such as lipid metabolism, glucose metabolism, and inflammatory responses. PPARα is primarily expressed in the liver, heart, and skeletal muscle, regulating the oxidation and metabolism of fatty acids, playing a crucial role in energy metabolism [ 36 37 38 3 4 5 39 40 41 FABPs are a family of intracellular lipid chaperones that coordinate intracellular lipid responses by binding and redistributing intracellular fatty acids [ 42 43 4.4  OXPHOS Although the mobilization of lipids and proteins can provide substrates for energy generation to temporarily meet the energy demands during lactation, this process might simultaneously produce some ROS. ROS (superoxide [O 2− 2 2 44 45 2− 46 2 2 47 The results of this study found that NUDFs3, NDUFV2, and NDUFA5, components of mitochondrial complex I in the electron transport chain, were upregulated in the CK. Mitochondrial complex I is a key entry point of the electron transport chain, accepting electron donors NADH generated from the TCA cycle, and then oxidizing them to initiate electron transfer [ 48 49 50 5 Conclusions Omics data suggest that the impaired TCA cycle function in the muscle tissue of ketosis cows might be one of the reasons for the inability to meet the energy demands of ketosis cows. Although the total pyruvate content decreased, fatty acid oxidation and the production of pyruvate from oxaloacetate might further increase the BHBA content in muscle tissue through the synthesis of ketone bodies. In addition, the mobilization of fatty acids, increased carbohydrate metabolism, and impaired function of complexes II and III in the mitochondrial respiratory chain suggest an elevated oxidative state in muscle tissue; however, further experiments are needed to confirm. These data analyze the physiological metabolic mechanisms of muscle tissue in cows with ketosis from the perspectives of proteomics and metabolomics, providing preliminary insights into the metabolic mechanisms of BHBA in muscle. This offers a theoretical basis for understanding the specific processes in muscle tissue during this period and encourages consideration of how to reduce the incidence of ketosis in cows by examining the catabolism of BHBA in muscle. Disclosure Authors declare no off‐label use of antimicrobials. Ethics Statement A l Conflicts of Interest The authors declare no conflicts of interest. Supporting information  Table S1:  Table S2:  Table S3: n  Table S4: n P t  Table S5: n Padj is the P  Table S6: n Acknowledgments The mass spectrometry proteomics data have been deposited to the ProteomeXchange Consortium ( https://proteomecentral.proteomexchange.org https://www.metabolomicsworkbench.org References 1 A. W. Bell Regulation of Organic Nutrient Metabolism During Transition From Late Pregnancy to Early Lactation Journal of Animal Science 73 9 1995 2804 2819 8582872 10.2527/1995.7392804x 2 A. A. Adewuyi E. Gruys F. J. C. M. Van Eerdenburg Non Esterified Fatty Acids (NEFA) in Dairy Cattle. A Review Veterinary Quarterly 27 3 2005 117 126 16238111 10.1080/01652176.2005.9695192 3 J. C. Newman E. V. Ketone Ketone Bodies as Signaling Metabolites Trends in Endocrinology and Metabolism: TEM 25 1 2014 42 52 24140022 10.1016/j.tem.2013.09.002 PMC4176946 4 T. F. Duffield K. D. Lissemore B. W. Mcbride K. E. Leslie Impact of Hyperketonemia in Early Lactation Dairy Cows on Health and Production Journal of Dairy Science 92 2 2009 571 580 19164667 10.3168/jds.2008-1507 5 J. A. Mcart D. V. Nydam G. R. Oetzel Epidemiology of Subclinical Ketosis in Early Lactation Dairy Cattle Journal of Dairy Science 95 9 2012 5056 5066 22916909 10.3168/jds.2012-5443 6 J. M. Cainzos C. Andreu‐Vazquez M. Guadagnini A. Rijpert‐Duvivier T. Duffield A Systematic Review of the Cost of Ketosis in Dairy Cattle Journal of Dairy Science 105 7 2022 6175 6195 35534272 10.3168/jds.2021-21539 7 D. Raboisson M. Mounié E. Khenifar E. Maigné The Economic Impact of Subclinical Ketosis at the Farm Level: Tackling the Challenge of Over‐Estimation due to Multiple Interactions Preventive Veterinary Medicine 122 4 2015 417 425 26276398 10.1016/j.prevetmed.2015.07.010 8 C. Loiklung P. Sukon C. Thamrongyoswittayakul Global Prevalence of Subclinical Ketosis in Dairy Cows: A Systematic Review and Meta‐Analysis Research in Veterinary Science 144 2022 66 76 35077992 10.1016/j.rvsc.2022.01.003 9 C. Guo D. Sun X. Wang S. Mao A Combined Metabolomic and Proteomic Study Revealed the Difference in Metabolite and Protein Expression Profiles in Ruminal Tissue From Goats Fed Hay or High‐Grain Diets Frontiers in Physiology 10 2019 66 30800073 10.3389/fphys.2019.00066 PMC6375843 10 U. K. Sundekilde N. A. Poulsen L. B. Larsen H. C. Bertram Nuclear Magnetic Resonance Metabonomics Reveals Strong Association Between Milk Metabolites and Somatic Cell Count in Bovine Milk Journal of Dairy Science 96 1 2013 290 299 23182357 10.3168/jds.2012-5819 11 Z. L. Wu S. Y. Chen S. Hu X. Jia J. Wang S.‐J. Lai Metabolomic and Proteomic Profiles Associated With Ketosis in Dairy Cows Frontiers in Genetics 11 2020 551587 33391334 10.3389/fgene.2020.551587 PMC7772412 12 B. He Z. Huang C. Huang E. C. Nice Clinical Applications of Plasma Proteomics and Peptidomics: Towards Precision Medicine Proteomics. Clinical Applications 16 6 2022 e2100097 35490333 10.1002/prca.202100097 13 C. Xu Z. Wang Comparative Proteomic Analysis of Livers From Ketotic Cows Veterinary Research Communications 32 3 2008 263 273 18080212 10.1007/s11259-007-9028-4 14 Q. Xu X. Li L. Ma Adipose Tissue Proteomic Analysis in Ketotic or Healthy Holstein Cows in Early Lactation Journal of Animal Science 97 7 2019 2837 2849 31267132 10.1093/jas/skz132 PMC6606492 15 Y. Ma S. Feng X. Wang Exploration of Exosomal microRNA Expression Profiles in Pigeon ‘Milk’ During the Lactation Period BMC Genomics 19 1 2018 828 30458711 10.1186/s12864-018-5201-0 PMC6245878 16 X. Gao L. Jian L. Zhang Perilipin 5 Protects the Mitochondrial Oxidative Functions and Improves the Alcoholic Liver Injury in Mice Liver International 44 2 2024 357 369 37933091 10.1111/liv.15775 17 W. B. Dunn D. Broadhurst P. Begley Procedures for Large‐Scale Metabolic Profiling of Serum and Plasma Using Gas Chromatography and Liquid Chromatography Coupled to Mass Spectrometry Nature Protocols 6 7 2011 1060 1083 21720319 10.1038/nprot.2011.335 18 J. Wang T. Zhang X. Shen Serum Metabolomics for Early Diagnosis of Esophageal Squamous Cell Carcinoma by UHPLC‐QTOF/MS Metabolomics 12 7 2016 1 10 19 J. Zhang H. T. Shi Y. C. Wang Carbohydrate and Amino Acid Metabolism and Oxidative Status in Holstein Heifers Precision‐Fed Diets With Different Forage to Concentrate Ratios Animal 14 11 2020 2315 2325 32602427 10.1017/S1751731120001287 20 M. Kanehisa M. Furumichi M. Tanabe Y. Sato K. Morishima KEGG: New Perspectives on Genomes, Pathways, Diseases and Drugs Nucleic Acids Research 45 1 2017 D353 D361 27899662 10.1093/nar/gkw1092 PMC5210567 21 J. K. Drackley T. R. Overton G. N. Douglas Adaptations of Glucose and Long‐Chain Fatty Acid Metabolism in Liver of Dairy Cows During the Periparturient Period Journal of Dairy Science 84 2001 E100 E112 22 A. T. Van Knegsel H. Brand J. Dijkstra Dietary Energy Source in Dairy Cows in Early Lactation: Energy Partitioning and Milk Composition Journal of Dairy Science 90 3 2007 1467 1476 17297120 10.3168/jds.S0022-0302(07)71632-6 23 L. Doepel H. Lapierre J. J. Kennelly Peripartum Performance and Metabolism of Dairy Cows in Response to Prepartum Energy and Protein Intake Journal of Dairy Science 85 9 2002 2315 2334 12362465 10.3168/jds.S0022-0302(02)74312-9 24 G. Højfeldt T. Sorenson A. Gonzales M. Kjaer J. L. Andersen A. L. Mackey Fusion of Myofibre Branches is a Physiological Feature of Healthy Human Skeletal Muscle Regeneration Skeletal Muscle 13 1 2023 13 37573332 10.1186/s13395-023-00322-2 PMC10422711 25 T. A. Järvinen T. L. Järvinen M. Kääriäinen H. Kalimo M. Järvinen Muscle Injuries: Biology and Treatment American Journal of Sports Medicine 33 5 2005 745 764 15851777 10.1177/0363546505274714 26 S. K. Powers D. Criswell J. Lawler Influence of Exercise and Fiber Type on Antioxidant Enzyme Activity in Rat Skeletal Muscle American Journal of Physiology 266 2 1994 R375 R380 8141392 10.1152/ajpregu.1994.266.2.R375 27 J. O. Marx M. C. Olsson L. Larsson Scaling of Skeletal Muscle Shortening Velocity in Mammals Representing a 100,000‐Fold Difference in Body Size European Journal of Physiology 452 2 2006 222 230 16333661 10.1007/s00424-005-0017-6 28 F. J. Corpas J. B. Barroso L. M. Sandalio J. M. Palma J. A. Lupiánez L. A. del Rıo Peroxisomal NADP‐Dependent Isocitrate Dehydrogenase. Characterization and Activity Regulation During Natural Senescence Plant Physiology 121 3 1999 921 928 10557241 10.1104/pp.121.3.921 PMC59455 29 J. G. Mccormack R. M. Denton The Effects of Calcium Ions and Adenine Nucleotides on the Activity of Pig Heart 2‐Oxoglutarate Dehydrogenase Complex Biochemical Journal 180 3 1979 533 544 39549 10.1042/bj1800533 PMC1161091 30 J. A. Ronchi T. R. Figueira F. G. Ravagnani H. C. F. Oliveira A. E. Vercesi R. F. Castilho A Spontaneous Mutation in the Nicotinamide Nucleotide Transhydrogenase Gene of C57BL/6J Mice Results in Mitochondrial Redox Abnormalities Free Radical Biology & Medicine 63 2013 446 456 23747984 10.1016/j.freeradbiomed.2013.05.049 31 B. Glancy R. S. Balaban Protein Composition and Function of Red and White Skeletal Muscle Mitochondria American Journal of Physiology‐Cell Physiology 300 6 2011 C1280 C1290 21289287 10.1152/ajpcell.00496.2010 PMC3118618 32 P. Rustin A. Rötig Inborn Errors of Complex II—Unusual Human Mitochondrial Diseases Biochimica et Biophysica Acta 1553 1 2002 117 122 11803021 10.1016/s0005-2728(01)00228-6 33 H. Pircher S. Von Grafenstein T. Diener Identification of FAH Domain‐Containing Protein 1 (FAHD1) as Oxaloacetate Decarboxylase Journal of Biological Chemistry 290 11 2015 6755 6762 25575590 10.1074/jbc.M114.609305 PMC4358102 34 M. Wang C. Zhou L. Yu Upregulation of MDH1 Acetylation by HDAC6 Inhibition Protects Against Oxidative Stress‐Derived Neuronal Apoptosis Following Intracerebral Hemorrhage Cellular and Molecular Life Sciences 79 7 2022 356 35678904 10.1007/s00018-022-04341-y PMC11073123 35 E. Y. Kim W. K. Kim H. J. Kang Acetylation of Malate Dehydrogenase 1 Promotes Adipogenic Differentiation via Activating Its Enzymatic Activity Journal of Lipid Research 53 9 2012 1864 1876 22693256 10.1194/jlr.M026567 PMC3413227 36 A. Z. Mirza I. Althagafi H. Shamshad Role of PPAR Receptor in Different Diseases and Their Ligands: Physiological Importance and Clinical Implications European Journal of Medicinal Chemistry 166 2019 502 513 30739829 10.1016/j.ejmech.2019.01.067 37 F. Hong S. Pan Y. Guo P. Xu Y. Zhai PPARs as Nuclear Receptors for Nutrient and Energy Metabolism Molecules 24 14 2019 2545 31336903 10.3390/molecules24142545 PMC6680900 38 H. Shi J. Zhang S. Li Effects of a Wide Range of Dietary Forage‐To‐Concentrate Ratios on Nutrient Utilization and Hepatic Transcriptional Profiles in Limit‐Fed Holstein Heifers BMC Genomics 19 1 2018 148 29454312 10.1186/s12864-018-4529-9 PMC5816523 39 J. Zhang N. Gaowa Y. Wang Complementary Hepatic Metabolomics and Proteomics Reveal the Adaptive Mechanisms of Dairy Cows to the Transition Period Journal of Dairy Science 106 3 2023 2071 2088 36567250 10.3168/jds.2022-22224 40 Y. Jiang J. Liu H. Liu miR‐381‐3p Inhibits Intramuscular Fat Deposition Through Targeting FABP3 by ceRNA Regulatory Network Biology 11 10 2022 1497 36290402 10.3390/biology11101497 PMC9598794 41 A. S. Bhale K. Venkataraman Leveraging Knowledge of HDLs Major Protein ApoA1: Structure, Function, Mutations, and Potential Therapeutics Biomedicine & Pharmacotherapy 154 2022 113634 36063649 10.1016/j.biopha.2022.113634 42 C. M. Scifres B. Chen D. M. Nelson Y. Sadovsky Fatty Acid Binding Protein 4 Regulates Intracellular Lipid Accumulation in Human Trophoblasts Journal of Clinical Endocrinology and Metabolism 96 7 2011 E1083 E1091 21525163 10.1210/jc.2010-2084 PMC3135200 43 N. L. Bertschi O. Steck F. Luther PPAR‐γ Regulates the Effector Function of Human T Helper 9 Cells by Promoting Glycolysis Nature Communications 14 1 2023 2471 10.1038/s41467-023-38233-x PMC10148883 37120582 44 P. F. Surai I. Kochish V. I. Fisinin I. I. Kochish D. T. Juniper Revisiting Oxidative Stress and the Use of Organic Selenium in Dairy Cow Nutrition Animals 9 7 2019 462 31331084 10.3390/ani9070462 PMC6680431 45 G. A. Contreras L. M. Sordillo Lipid Mobilization and Inflammatory Responses During the Transition Period of Dairy Cows Comparative Immunology, Microbiology and Infectious Diseases 34 3 2011 281 289 21316109 10.1016/j.cimid.2011.01.004 46 I. N. Zelko T. J. Mariani R. J. Folz Superoxide Dismutase Multigene Family: A Comparison of the CuZn‐SOD (SOD1), Mn‐SOD (SOD2), and EC‐SOD (SOD3) Gene Structures, Evolution, and Expression Free Radical Biology and Medicine 33 3 2002 337 349 12126755 10.1016/s0891-5849(02)00905-x 47 A. Moretton S. Kourtis A. Gañez Zapater A Metabolic Map of the DNA Damage Response Identifies PRDX1 in the Control of Nuclear ROS Scavenging and Aspartate Availability Molecular Systems Biology 19 7 2023 e11267 37259925 10.15252/msb.202211267 PMC10333845 48 H. Pelicano W. Lu Y. Zhou Mitochondrial Dysfunction and Reactive Oxygen Species Imbalance Promote Breast Cancer Cell Motility Through a CXCL14‐Mediated Mechanism Cancer Research 69 6 2009 2375 2383 19276362 10.1158/0008-5472.CAN-08-3359 PMC2760349 49 R. D. Guzy B. Sharma E. Bell N. S. Chandel P. T. Schumacker Loss of the SdhB, but Not the SdhA, Subunit of Complex II Triggers Reactive Oxygen Species‐Dependent Hypoxia‐Inducible Factor Activation and Tumorigenesis Molecular and Cellular Biology 28 2 2008 718 731 17967865 10.1128/MCB.01338-07 PMC2223429 50 L. Zeng Y. Huang J. Tan QCR7 Affects the Virulence of Candida Albicans and the Uptake of Multiple Carbon Sources Present in Different Host Niches Frontiers in Cellular and Infection Microbiology 13 2023 1136698 36923588 10.3389/fcimb.2023.1136698 PMC10009220 ",
  "metadata": {
    "Title of this paper": "QCR7 Affects the Virulence of Candida Albicans and the Uptake of Multiple Carbon Sources Present in Different Host Niches",
    "Journal it was published in:": "Journal of Veterinary Internal Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481043/"
  }
}