{
  "title": "Paper_1068",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471265 PMC12471265.1 12471265 12471265 41009685 10.3390/ijms26189101 ijms-26-09101 1 Article Integrated miRNA-mRNA Analyses of Triple-Negative Breast Cancer in Black and White Patients with or Without Obesity Hossain Fokhrul Conceptualization Investigation Writing – original draft Writing – review & editing 1 * † https://orcid.org/0000-0001-9199-1855 Gonzalez-Ramirez Martha I. 2 † Garai Jone Methodology Resources 3 https://orcid.org/0000-0002-7846-2948 Polania-Villanueva Diana 3 Li Li Methodology Resources 3 Nafees Farzeen Writing – review & editing 4 Manirujjaman Md Writing – review & editing 1 https://orcid.org/0000-0003-0150-8650 Liu Bolin Writing – review & editing 5 Majumder Samarpan Writing – review & editing 1 https://orcid.org/0000-0003-3663-5027 Wu Xiao-Cheng 6 Hicks Chindo Methodology Writing – review & editing 1 https://orcid.org/0000-0003-3894-9206 Del Valle Luis Methodology 7 Danos Denise 5 https://orcid.org/0000-0001-6457-8029 Ochoa Augusto 5 https://orcid.org/0000-0002-5853-7287 Miele Lucio Funding acquisition 1 https://orcid.org/0000-0002-5961-6761 Zabaleta Jovanny Conceptualization Methodology Software Formal analysis Resources Data curation Writing – original draft Writing – review & editing Visualization 5 * Valentini Virginia Academic Editor 1 mmanir@lsuhsc.edu smaju1@lsuhsc.edu chick3@lsuhsc.edu lmiele@lsuhsc.edu 2 mgonzalezramirez@tulane.edu 3 jgarai@lsuhsc.edu dpolan@lsuhsc.edu lli@lsuhsc.edu 4 fnafees@uno.edu 5 bliu2@lsuhsc.edu ddanos@lsuhsc.edu aochoa@lsuhsc.edu 6 xwu@lsuhsc.edu 7 ldelva@lsuhsc.edu * fhossa@lsuhsc.edu jzabal@lsuhsc.edu † These authors contributed equally to this work. 18 9 2025 9 2025 26 18 497349 9101 31 8 2025 07 9 2025 09 9 2025 18 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Triple-negative breast cancer (TNBC) is an aggressive, heterogeneous subtype of breast cancer. miRNAs play an essential role in TNBC pathogenesis and prognosis. Obesity is linked with an increased risk for several cancers, including breast cancer. Obesity is also related to the dysregulation of miRNA expression in adipose tissues. However, there is limited knowledge about race- and obesity-specific differential miRNA expression in TNBC. We performed miRNA sequencing of 48 samples (24 tumor and 24 adjacent non-tumor tissues) and RNA sequencing of 24 tumors samples from Black (AA) and White (EA) TNBC patients with or without obesity. We identified 55 miRNAs exclusively associated with tumors in obese EA patients and 33 miRNAs in obese AA patients, each capable of distinguishing tumor tissues from obese from lean individuals within their respective racial groups. In EA, we detected 41 significant miRNA–mRNA correlations. Notably, miR-181b-5p and miR-877-5p acted as negative regulators of tumor-suppressor genes (e.g., HEY2 MCL2 HAND2 RAB10 DR1 PTBP3 NCBP1 CLCN4 PLCB1 CDC25B AEBP2 ERBB4 KRAS ESR1 ESR2 RAB10 TNRC6C NCAN ERBB4 PLCB1 SERPINE1 breast cancer TNBC African American microRNA (miRNA) miRNA-seq mRNA-seq NIH P20 P20CA233374 Tulane University School of Medicine Translational Genomics Core (TGC) COBRE P20GM121288-06 This project was funded by the NIH P20 grant (PIs: Dr. A.O. and Dr. L.M. P20CA233374). M.I.G.-R. is partially supported by a scholarship from Tulane University School of Medicine. J.Z. received funding through the Translational Genomics Core (TGC), which is partially funded by COBRE grant number P20GM121288-06 (John West, PI). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Triple-negative breast cancer (TNBC) is a subtype of breast tumor that represents nearly 10–20% of all invasive breast cancers (BCs) and is characterized by deficient expression of the estrogen receptor (ER), progesterone (PR), and the human epidermal growth factor receptor 2 locus (HER2−) [ 1 2 3 4 5 6 7 8 9 10 11 miRNAs are a class of conserved, non-coding RNAs that regulate gene expression post-transcriptionally, affecting over 60% of human genes [ 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 Obesity is associated with an increased risk for several types of cancer, including breast cancer [ 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 48 49 Obesity profoundly alters mRNA expression in TNBC, driving tumorigenesis via multiple molecular pathways. Inflammatory mediators, particularly cytokine signaling components and TNF-pathway genes, are consistently upregulated in obese patients [ 50 51 52 50 51 52 In this pilot study, we aimed to determine the differential miRNA expression of Black and White TNBC patients with normal weight and obesity compared to their tumor-free adjacent control tissues. Additionally, using bioinformatics analysis, we sought to identify mRNA targets of significant differentially expressed miRNA in obese Black and White TNBC patients. 2. Results 2.1. Demographics of Patients Included Samples were randomly selected to establish a balance between race and obesity status. The average age among all cases was 61.4 years, with no significant difference in age distribution between AA and EA cases (mean age 65 vs. 57.7 years; p p Table 1 2.2. miRNA Expression Profiles in AA and EA TNBC Patients with or Without Obesity We performed miRNA sequencing in 48 FFPE breast tissue samples from women diagnosed with TNBC (24 tumor and 24 adjacent non-tumor tissues). We first performed differential expression analysis (DEA) between tumor and adjacent non-tumor tissues in each racial group (AA and EA), independent of the weight status. The DEA shows 124 and 109 differentially expressed (DE) miRNAs in EA and AA, respectively ( Figure 1 Figure 2 Figure S1 Figure 1 Figure 1 Figure 1 Figure 1 The analysis in AA patients, based on obesity status, identified 72 DE miRNAs between tumor and adjacent non-tumor samples, with a perfect separation in two clusters in the heatmap ( Figure 2 Figure 2 Figure 2 Figure 2 2.3. miRNAs Uniquely Associated with Tumor Tissues in Obese Patients by Racial Group To identify the DE miRNAs specifically associated with tumor tissues in obese patients across racial groups, we conducted a comparative analysis between obese and lean patients within each group. Among EA women, comparison of DE miRNAs in obese patients ( n n Figure 3 n n Figure 3 Figure 3 Figure 3 Figure 3 Figure 3 Figure 3 Figure 3 Figure 3 Figure 3 Table S1A,B 2.4. Identification of Differentially Expressed Genes (DEGs) and Correlation with miRNA Expression With the goal of identifying the transcriptome landscape of tumor tissues of women with obesity (using lean women as reference), we found 499 DEGs in obese AA patients ( p p Table S2 Figure 4 We performed a post hoc statistical power analysis using the Bioconductor RNASeqPower version 1.48.0 [ 53 Table S6 p Table S3 Figure 4 The integration of differential expression and pairwise correlation analyses, supported by TargetScan-predicted miRNA–mRNA interactions, revealed core regulatory networks in obese TNBC patients ( Figure 5 Figure 5 Figure 5 We focused on the subset of miRNA–mRNA interactions exhibiting inverse correlations (i.e., negative Spearman’s rank correlation coefficients), as these are most indicative of potential regulatory effects. Among the 41 interactions identified in the EA group, 24 showed inverse correlations in obese versus lean TNBC patients. Notably, miR-181b-5p and miR-877-5p were overexpressed in obese patients and demonstrated strong negative correlations with multiple underexpressed target genes. Specifically, miR-181b-5p was inversely correlated with seven genes ( HEY2 CRYBG3 ABI3BP KLHL29 MCL1 PRICKLE2 HAND2 HAND2 SORBS3 ZBTB20 Figure 5 GSPT1 SEC61A2 ANKRD13C RAB10 TRIP12 RAB1A DR1 PTBP3 ZC3H15 NCBP1 PHTF2 RSF1 SLC39A10 GOLM1 Figure 5 On the other hand, among the 28 interactions identified in the AA group, 17 exhibited inverse correlations in obese versus lean TNBC patients. Notably, ten miRNAs were overexpressed in obese patients and demonstrated significant negative correlations with multiple underexpressed target genes, consistent with a direct post-transcriptional repression mechanism. Specifically, miR-195-5p was inversely correlated with STK33 CLCN4 CDC25B RASSF8 BIRC3 AEBP2 ADAM22 SERPINE1 ZFP69B Figure 5 Dashed arrows from miRNAs to genes indicate a possible direct interaction mechanism based on the observed positive fold change in the miRNAs and negative fold change in the genes. Conversely, dashed inhibition arrows from genes to miRNAs suggest a possible indirect interaction mechanism based on the observed negative fold change in the miRNAs and positive fold change in the genes. 2.5. Pathways Enrichment Analysis To investigate the functional relevance of DEGs with significant miRNA correlations, we conducted pathway enrichment analysis using Reactome v92, https://reactome.org p ESR1 ESR2 KRAS NCBP1 TNRC6C RAB1A RAB10 HEY2 MCL1 GSPT1 NCAN Figure 6 Table S4 p ADAM22 ERBB4 PLCB1 ROBO2 SERPINE1 p HER2 HER4 Figure 6 Table S5 2.6. TCGA External Validation Validation of four candidate miRNAs in the TCGA-BRCA cohort (all breast cancer subtypes) confirmed consistent expression patterns with our dataset. Specifically, miR-181b and miR-877 were overexpressed in tumors from both EA and AA women compared with normal tissues, consistent with our findings in obese versus lean EA women ( Figure 7 p p Figure 7 Figure 7 p p 3. Discussion We applied a robust and stringent strategy to identify miRNAs exclusively related to obesity in tumor tissues of AA and EA diagnosed with TNBC. In EA, most of the miRNA–mRNA significative correlated interactions were related to miR-181b-5p, miR-877-5p, miR-204-5p, and miR-143-3p. miR-204-5p functions as a tumor suppressor in breast cancer by inhibiting critical processes such as angiogenesis, invasion, migration, and metastasis. This miRNA was underexpressed almost three times in obese EA tumor samples compared to adjacent non-tumor tissues. This suggests that its targets, such as SH3BP5 NBEA ZBTB20 ESR2 ESR1 54 55 IGF2 TIMP3 56 LIMK1 MYBL2 57 In AA, the miR-195-5p, miR-130a-3p, miR-424-5p, miR-148a-3p, miR-199a-3p, miR-199b-3p, miR-301a-3p, miR-30a-5p, miR-374a-5p, miR-376a-3p, and miR-454-3p, in addition to showing significant miRNA–mRNA correlated interactions, also presented inverse fold-change values, suggesting a likely direct or indirect regulatory process. miR-195-5p was significantly overexpressed, while STK33 CCNE1 58 STK33 59 STK33 GADD45A FOSL1 PLCB1 GADD45A 60 PLCB1 + 61 CDC25B RASSF8 AEBP2 62 AEBP2 AEBP2 AEBP2 63 64 65 66 47 67 47 68 69 70 71 The observed disparity in the number of significantly correlated miRNA–mRNA interactions between AA and EA patients with TNBC and obesity is a notable finding. It suggests significant implications for treatment and prognosis in AA patients, who have historically received less research attention compared to patients of European ancestry. Limited representation in clinical studies may be one of the reasons AA patients experience worse outcomes despite having a lower incidence of the disease [ 72 73 In TNBC tumors of AA patients with obesity, seventeen miRNAs, seven of which (miR-195-5p, miR-130a-3p, miR-130a-5p, miR-424-5p, miR-148a-3p, miR-374-5p, and miR-30a-5p) potentially downregulated two or more genes (e.g., CLCN4 PLCB1 CDC25B AEBP2 ERBB4 n n ESR1 ES32 ERBB4 In AA patients, the predominant enriched pathways center on aberrant ERBB2/ERBB4 signaling: GRB2- and SHC1-mediated activation of ERBB2 and ERBB4, PI3K events downstream of both receptors, and constitutive signaling by ERBB2 kinase-domain and transmembrane/junctional mutants. These overlap with cancer-specific ERBB2 and nuclear ERBB4 programs, as well as the downregulation of ERBB2/ERBB4 signaling. Additional modules include regulation of SLIT-ROBO expression and LGI–ADAM interactions, all pointing to dysregulated ERBB family-driven oncogenic signaling. The AA group showed enrichment in ERBB2/ERBB4 signaling pathways (e.g., GRB2, PTK6, PI3K events), despite the TNBC context. These were linked to the receptor-mediated proliferation and regulation of cell motility. Additionally, AA-specific pathways included cytoskeletal remodeling and invasion-related signals (e.g., ROBO2 SERPINE1 PLCB1 61 PLCB1 74 SERPINE1 75 In obese EA patients, enriched pathways were dominated by extra-nuclear estrogen signaling (e.g., ESR1 ESR2 HEY2 MCL1 76 77 78 79 We acknowledge that the small sample size of this may limit the statistical power to detect significant genetic associations, and the findings might not fully generalize to larger populations. While we applied False Discovery Rate (FDR) correction to account for multiple testing, no variants remained significant after adjustment, which is expected in studies with limited sample sizes. For this reason, we report unadjusted p This pilot study is the first to elucidate unique miRNA and mRNA signatures, and their correlations, capable of distinguishing TNBC tumors from obese versus non-obese patients across African American and Caucasian ancestral backgrounds. For this reason, despite extensive efforts, we were unable to identify a publicly available dataset that includes both BMI and racial/ancestral information along with matched transcriptomic data for both miRNAs and mRNAs. As a result, we could not validate our obesity- and race-specific miRNA markers in an independent cohort. Although datasets like TCGA and METABRIC are rich in molecular and survival data, they lack key variables essential to our selection strategy and biological interpretation, specifically BMI data in the case of TCGA and miRNA expression profiles in the case of METABRIC. We acknowledge that this as a limitation; however, it also underscores the novelty and relevance of our study, as it addresses a critical gap in existing resources by integrating obesity and race into the molecular characterization of TNBC for the first time. Future studies incorporating multi-omic data with detailed clinical annotations, including BMI, are needed to build upon these findings and assess their prognostic significance. One limitation of our pilot study is that race was self-reported and that BMI, while widely used, does not account for body fat distribution or composition—factors that may vary across populations and influence disease biology. To minimize variability and enhance the identification of obesity-related molecular changes, we restricted our analysis to patients with BMI ≥ 30, where metabolic alterations are more consistently observed. This approach strengthened the biological significance of our results, despite the known limitations of BMI and self-reported race. The miRNA selection strategy is straightforward and rigorous, ensuring that, at each filtering step, we removed miRNAs that could confound interpretation by comparing against appropriate control groups. This approach allowed us to identify miRNAs uniquely associated with obesity-driven TNBC within each race. We then evaluated the correlations between the normalized expression levels of these miRNAs and mRNAs, focusing only on pairs with predicted interactions based on TargetScan, adding a layer of functional relevance. Enrichment analysis of the correlated mRNA targets revealed two distinct biological profiles: immune and inflammatory pathways in AA patients, and metabolic and hormone-related pathways in EA patients. This integrative approach enhances molecular specificity and reveals race-dependent mechanisms through which obesity may influence TNBC biology. 4. Materials and Methods 4.1. Samples Selection and Study Design This study was conducted on FFPE tissues acquired and de-identified by the Louisiana Tumor Registry (LTR) after approval by the Institutional Review Board (IRB) at the LSUHSC School of Medicine, which deemed the study as “Exempt”. Figure S1 n n Table 1 4.2. RNA Extraction and Library Preparation All RNA work, including extraction, library preparation, sequencing, and analysis was performed at the Translational Genomics Core (TGC), LSUHSC-New Orleans. Total RNA was extracted from FFPE tissue samples using the truXTRAC FFPE total DNA/RNA (column) kit (Covaris, Woburn, Massachusetts, USA). Directions from the manufacturer were followed, with minor modifications. Briefly, tissue sections of 20 μm were first deparaffinized using xylene substitute (Sigma-Aldrich, St.Louis, USA), followed by two ethanol washes, and were air-dried for 20 min at 37 °C. After deparaffinization, tissues were resuspended in lysis buffer containing proteinase K and lysed using the Covaris M220 focused ultrasonicator (Covaris, Woburn, Massachusetts, USA), following the recommended settings by the manufacturer, followed by incubation at 56 °C for 30 min. The RNA-containing supernatant was then de-crosslinked at 80 °C for 20 min and purified using the RNA purification columns, as indicated by the manufacturer’s instructions. A treatment with DNaseI (QIAGEN, Germantown, MD, USA) was included. RNA was eluted in 30 μl of water. RNA quantification was performed using the Qubit RNA HS Assay kit (Invitrogen, Carlsbad, CA, USA). Small RNA libraries were generated from 100 ng of total RNA using the QIAseq miRNA library kit and QIAseq miRNA 96 Index IL kit (QIAGEN, Germantown, MD, USA) and according to the manufacturer’s instructions. Briefly, specifically modified adapters were first sequentially ligated to the −3′ and −5′ ends of the RNA, followed by reverse transcription with unique molecular index (UMI) assignment. The cDNA was then amplified using 16 cycles of PCR with a universal forward primer and indexed reverse primers. mRNA libraries were prepared from tumor samples only, using Illumina’s TruSeq RNA exome library preparation kit (Illumina, San Diego, CA, USA) and according to manufacturer’s instructions, with the following modifications [ 80 4.3. Sequencing Data Processing miRNA FASTQ files generated with the NextSeq500 instrument were uploaded to GeneGlobe Data Analysis Center of Qiagen ® https://geneglobe.qiagen.com/analyze/ http://www.mirbase.org/ ® p GSE279780 The mRNA samples used in the present work are part of a larger analysis from our laboratory ( n GSE268851 p 4.4. Strategy for miRNA Selection To identify miRNAs uniquely associated with tumor tissues in obese patients across racial groups, we implemented a multistep differential expression (DE) filtering strategy ( Figure 3 Figure 3 4.5. Correlation Analysis To explore the regulatory relationships between differentially expressed miRNAs and mRNAs in tumor tissues from obese patients, we performed Spearman rank correlation analysis stratified by ancestry group using Partek Genomics Suite v7.0. Putative miRNA–mRNA interactions were informed by TargetScan v8. Correlations with p 81 4.6. Pathway Enrichment Analysis and External Validation in TCGA To investigate the potential biological functions of the DEGs with significant miRNA associations, we conducted Reactome Pathway Enrichment Analysis (Reactome v92; https://reactome.org p http://ualcan.path.uab.edu 5. Conclusions Our work highlights the relationship between specific sets of miRNAs, mRNAs, and their correlation, with TNBC in AA and EA individuals in the context of obesity. We identified a robust list of differentially expressed miRNA in tumors of AA and EA TNBC patients with or without obesity, supported by correlation analysis with mRNAs differentially expressed in the same tumor samples and by pathway enrichment analysis. Further analyses are warranted to identify and validate the relevant biomarkers of race and obesity. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/ijms26189101/s1 Author Contributions Conceptualization, F.H. and J.Z.; methodology, J.G., D.P.-V., D.D., C.H., L.L., M.I.G.-R. and J.Z.; analysis, M.I.G.-R. and J.Z.; data curation, J.Z.; writing—original draft preparation, F.H., M.I.G.-R., J.Z., F.N., S.M., M.M. and B.L.; TNBC patient’s tissue procurement, X.-C.W.; histopathology processing, L.D.V.; funding acquisition, L.M. and A.O. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement This study was conducted on FFPE tissues acquired and de-identified by the Louisiana Tumor Registry after approval by the Institutional Review Committee at the LSUHSC School of Medicine, which deeded the study as “Exempt”. Data Availability Statement The data generated in this study are available at the Gene Expression Omnibus under accession number GSE279780 GSE268851 Conflicts of Interest The authors declare no conflicts of interest. The founders had no role in the design of the study; in the collection, analysis, or interpretation of data; in the writing of the manuscript; or in the decision to publish the results. Abbreviations White/EA European American Black/AA African American DE Differentially Expressed DEA Differential Expression Analysis miRNAs microRNAs FFPE Formalin-fixed paraffin-embedded TNBC Triple Negative Breast Cancer BC Breast Cancer FDR False discovery rate TGC Translational Genomics Core References 1. de Ruijter T.C. Veeck J. de Hoon J.P.J. van Engeland M. Tjan-Heijnen V.C. Characteristics of triple-negative breast cancer J. Cancer Res. Clin. Oncol. 2010 137 183 192 10.1007/s00432-010-0957-x 21069385 PMC3018596 2. Garrido-Castro A.C. Lin N.U. Polyak K. Insights into Molecular Classifications of Triple-Negative Breast Cancer: Improving Patient Selection for Treatment Cancer Discov. 2019 9 176 198 10.1158/2159-8290.CD-18-1177 30679171 PMC6387871 3. Lehmann B.D. Bauer J.A. Chen X. Sanders M.E. Chakravarthy A.B. Shyr Y. Pietenpol J.A. Identification of human triple-negative breast cancer subtypes and preclinical models for selection of targeted therapies J. Clin. Investig. 2011 121 2750 2767 10.1172/JCI45014 21633166 PMC3127435 4. Lehmann B.D. Pietenpol J.A. Clinical implications of molecular heterogeneity in triple negative breast cancer Breast 2015 24 S36 S40 10.1016/j.breast.2015.07.009 26253813 PMC4641762 5. Rakha E.A. El-Sayed M.E. Green A.R. Lee A.H.S. Robertson J.F. Ellis I.O. Prognostic markers in triple-negative breast cancer Cancer 2006 109 25 32 10.1002/cncr.22381 17146782 6. Zong Y. Pegram M. Research advances and new challenges in overcoming triple-negative breast cancer Cancer Drug Resist. 2021 4 517 542 10.20517/cdr.2021.04 34888495 PMC8654168 7. Elsamany S. Abdullah S. Triple-negative breast cancer: Future prospects in diagnosis and management Med Oncol. 2014 31 1 7 10.1007/s12032-013-0834-y 24390419 8. Bauer K.R. Brown M. Cress R.D. Parise C.A. Caggiano V. Descriptive analysis of estrogen receptor (ER)-negative, progesterone receptor (PR)-negative, and HER2-negative invasive breast cancer, the so-called triple-negative phenotype: A population-based study from the California cancer Registry Cancer 2007 109 1721 1728 10.1002/cncr.22618 17387718 9. Al-Mahmood S. Sapiezynski J. Garbuzenko O.B. Minko T. Metastatic and triple-negative breast cancer: Challenges and treatment options Drug Deliv. Transl. Res. 2018 8 1483 1507 10.1007/s13346-018-0551-3 29978332 PMC6133085 10. Plasilova M.L. Hayse B. Killelea B.K. Horowitz N.R. Chagpar A.B. Lannin D.R. Features of triple-negative breast cancer Medicine 2016 95 e4614 10.1097/MD.0000000000004614 27583878 PMC5008562 11. Mitchell P.S. Parkin R.K. Kroh E.M. Fritz B.R. Wyman S.K. Pogosova-Agadjanyan E.L. Peterson A. Noteboom J. O’Briant K.C. Allen A. Circulating microRNAs as stable blood-based markers for cancer detection Proc. Natl. Acad. Sci. USA 2008 105 10513 10518 10.1073/pnas.0804549105 18663219 PMC2492472 12. Liu W. Impact of tiny miRNAs on cancers World J. Gastroenterol. 2007 13 497 502 10.3748/wjg.v13.i4.497 17278213 PMC4065969 13. Bartel D.P. MicroRNAs: Genomics, Biogenesis, Mechanism, and Function Cell 2004 116 281 297 10.1016/S0092-8674(04)00045-5 14744438 14. Lewis B.P. Burge C.B. Bartel D.P. Conserved Seed Pairing, Often Flanked by Adenosines, Indicates that Thousands of Human Genes are MicroRNA Targets Cell 2005 120 15 20 10.1016/j.cell.2004.12.035 15652477 15. Friedman R.C. Farh K.K.-H. Burge C.B. Bartel D.P. Most mammalian mRNAs are conserved targets of microRNAs Genome Res. 2009 19 92 105 10.1101/gr.082701.108 18955434 PMC2612969 16. Shu J. e Silva B.V.R. Gao T. Xu Z. Cui J. Dynamic and Modularized MicroRNA Regulation and Its Implication in Human Cancers Sci. Rep. 2017 7 13356 10.1038/s41598-017-13470-5 29042600 PMC5645395 17. Singh G. Storey K.B. MicroRNA Cues from Nature: A Roadmap to Decipher and Combat Challenges in Human Health and Disease? Cells 2021 10 3374 10.3390/cells10123374 34943882 PMC8699674 18. Ye X.-M. Zhu H.-Y. Bai W.-D. Wang T. Wang L. Chen Y. Yang A.-G. Jia L.-T. Epigenetic silencing of miR-375 induces trastuzumab resistance in HER2-positive breast cancer by targeting IGF1R BMC Cancer 2014 14 134 10.1186/1471-2407-14-134 24571711 PMC3974046 19. Koleckova M. Janikova M. Kolar Z. MicroRNAs in triple-negative breast cancer Neoplasma 2018 65 1 13 10.4149/neo_2018_170115N36 29322783 20. van Schooneveld E. Wildiers H. Vergote I. Vermeulen P.B. Dirix L.Y. Van Laere S.J. Dysregulation of microRNAs in breast cancer and their potential role as prognostic and predictive biomarkers in patient management Breast Cancer Res. 2015 17 21 10.1186/s13058-015-0526-y 25849621 PMC4332424 21. Tang J. Ahmad A. Sarkar F.H. The Role of MicroRNAs in Breast Cancer Migration, Invasion and Metastasis Int. J. Mol. Sci. 2012 13 13414 13437 10.3390/ijms131013414 23202960 PMC3497334 22. Ventura A. Jacks T. MicroRNAs and Cancer: Short RNAs Go a Long Way Cell 2009 136 586 591 10.1016/j.cell.2009.02.005 19239879 PMC3910108 23. Han J. Lim W. You D. Jeong Y. Kim S. Lee J.E. Shin T.H. Lee G. Park S. Chemoresistance in the Human Triple-Negative Breast Cancer Cell Line MDA-MB-231 Induced by Doxorubicin Gradient Is Associated with Epigenetic Alterations in Histone Deacetylase J. Oncol. 2019 2019 1 12 10.1155/2019/1345026 PMC6582875 31275376 24. Sabit H. Cevik E. Tombuloglu H. Abdel-Ghany S. Tombuloglu G. Esteller M. Triple negative breast cancer in the era of miRNA Crit. Rev. Oncol. 2021 157 103196 10.1016/j.critrevonc.2020.103196 33307198 25. Xiao Y. Li Y. Tao H. Humphries B. Li A. Jiang Y. Yang C. Luo R. Wang Z. Integrin α5 down-regulation by miR-205 suppresses triple negative breast cancer stemness and metastasis by inhibiting the Src/Vav2/Rac1 pathway Cancer Lett. 2018 433 199 209 10.1016/j.canlet.2018.06.037 29964204 26. Xu J. Wu K.-J. Jia Q.-J. Ding X.-F. Roles of miRNA and IncRNA in triple-negative breast cancer J. Zhejiang Univ. B 2020 21 673 689 10.1631/jzus.B1900709 PMC7519626 32893525 27. Volovat S.R. Hordila I. Hordila D.-A. Mirestean C.C. Miron O.T. Lungulescu C. Scripcariu D.V. Stolniceanu C.R. Konsoulova-Kirova A.A. Grigorescu C. MiRNA and LncRNA as Potential Biomarkers in Triple-Negative Breast Cancer: A Review Front. Oncol. 2020 10 526850 10.3389/fonc.2020.526850 33330019 PMC7716774 28. Bhaskaran K. Douglas I. Forbes H. dos-Santos-Silva I. Leon D.A. Smeeth L. Body-mass index and risk of 22 specific cancers: A population-based cohort study of 5.24 million UK adults Lancet 2014 384 755 765 10.1016/S0140-6736(14)60892-8 25129328 PMC4151483 29. Price A.J. Allen N.E. Appleby P.N. Crowe F.L. Travis R.C. Tipper S.J. Overvad K. Grønbæk H. Tjønneland A. Johnsen N.F. Insulin-like Growth Factor-I Concentration and Risk of Prostate Cancer: Results from the European Prospective Investigation into Cancer and Nutrition Cancer Epidemiol. Biomark. Prev. 2012 21 1531 1541 10.1158/1055-9965.EPI-12-0481-T PMC5749609 22761305 30. Renehan A.G. Tyson M. Egger M. Heller R.F. Zwahlen M. Body-mass index and incidence of cancer: A systematic review and meta-analysis of prospective observational studies Lancet 2008 371 569 578 10.1016/S0140-6736(08)60269-X 18280327 31. Poggio F. Blondeaux E. Tagliamento M. Perachino M. Nardin S. Conte B. Giuliano M. Arpino G. De Laurentiis M. Gravina A. Efficacy of adjuvant chemotherapy schedules for breast cancer according to body mass index: Results from the phase III GIM2 trial ESMO Open 2024 9 103650 10.1016/j.esmoop.2024.103650 39121814 PMC11362642 32. Arner E. Mejhert N. Kulyté A. Balwierz P.J. Pachkov M. Cormont M. Lorente-Cebrián S. Ehrlund A. Laurencikiene J. Hedén P. Adipose Tissue MicroRNAs as Regulators of CCL2 Production in Human Obesity Diabetes 2012 61 1986 1993 10.2337/db11-1508 22688341 PMC3402332 33. Chuang T.-Y. Wu H.-L. Chen C.-C. Gamboa G.M. Layman L.C. Diamond M.P. Azziz R. Chen Y.-H. MicroRNA-223 Expression Is Upregulated in Insulin Resistant Human Adipose Tissue J. Diabetes Res. 2015 2015 1 8 10.1155/2015/943659 PMC4530273 26273679 34. Ishida M. Shimabukuro M. Yagi S. Nishimoto S. Kozuka C. Fukuda D. Soeki T. Masuzaki H. Tsutsui M. Sata M. MicroRNA-378 Regulates Adiponectin Expression in Adipose Tissue: A New Plausible Mechanism PLoS ONE 2014 9 e111537 10.1371/journal.pone.0111537 25379946 PMC4224402 35. Meerson A. Traurig M. Ossowski V. Fleming J.M. Mullins M. Baier L.J. Human adipose microRNA-221 is upregulated in obesity and affects fat metabolism downstream of leptin and TNF-α Diabetologia 2013 56 1971 1979 10.1007/s00125-013-2950-9 23756832 PMC3737431 36. Ortega F.J. Moreno-Navarrete J.M. Pardo G. Sabater M. Hummel M. Ferrer A. Rodriguez-Hermosa J.I. Ruiz B. Ricart W. Peral B. MiRNA Expression Profile of Human Subcutaneous Adipose and during Adipocyte Differentiation PLoS ONE 2010 5 e9022 10.1371/journal.pone.0009022 20126310 PMC2814866 37. Ibarra P.E. García-Solís P. Solís-Sáinz J.C. Cruz-Hernández A. Expression of miRNA in obesity and insulin resistance: A review Endokrynol. Polska 2021 72 73 80 10.5603/EP.a2021.0002 33749820 38. Telonis A.G. Rigoutsos I. Race Disparities in the Contribution of miRNA Isoforms and tRNA-Derived Fragments to Triple-Negative Breast Cancer Cancer Res. 2018 78 1140 1154 10.1158/0008-5472.CAN-17-1947 29229607 PMC5935570 39. Wei J.-J. Linking altered microRNA expression to racial disparities in uterine serous carcinoma Gynecol. Oncol. 2021 163 446 447 10.1016/j.ygyno.2021.11.002 34836615 PMC9206511 40. Nam E.J. Yoon H. Kim S.W. Kim H. Kim Y.T. Kim J.H. Kim J.W. Kim S. MicroRNA Expression Profiles in Serous Ovarian Carcinoma Clin. Cancer Res. 2008 14 2690 2695 10.1158/1078-0432.CCR-07-1731 18451233 41. Ghafouri-Fard S. Shirvani-Farsani Z. Branicki W. Taheri M. MicroRNA Signature in Renal Cell Carcinoma Front. Oncol. 2020 10 10.3389/fonc.2020.596359 33330087 PMC7734191 42. Heidari Z. Mohammadpour-Gharehbagh A. Eskandari M. Harati-Sadegh M. Salimi S. Genetic polymorphisms of miRNA let7a-2 pri-mir-34b/c J. Cell. Biochem. 2018 120 8640 8647 10.1002/jcb.28152 30552691 43. Magee R.G. Telonis A.G. Loher P. Londin E. Rigoutsos I. Profiles of miRNA Isoforms and tRNA Fragments in Prostate Cancer Sci. Rep. 2018 8 1 13 10.1038/s41598-018-22488-2 29593348 PMC5871839 44. Podany E.L. Foffano L. Gerratana L. Medford A.J. Clifton K. Tapiavala S. Velimirovic M. Lipsyc-Sharf M. Reduzzi C. Bubie A. Racial Differences in ctDNA Profiles, Targeted Therapy Use, and Outcomes in Metastatic Breast Cancer JAMA Netw. Open 2025 8 e2461899 10.1001/jamanetworkopen.2024.61899 40009379 PMC11866032 45. Piasecka D. Braun M. Kordek R. Sadej R. Romanska H. MicroRNAs in regulation of triple-negative breast cancer progression J. Cancer Res. Clin. Oncol. 2018 144 1401 1411 10.1007/s00432-018-2689-2 29923083 PMC6061037 46. Lü L. Mao X. Shi P. He B. Xu K. Zhang S. Wang J. MicroRNAs in the prognosis of triple-negative breast cancer Medicine 2017 96 e7085 10.1097/MD.0000000000007085 28562579 PMC5459744 47. Santana T.A.B.d.S. Passamai L.d.O. de Miranda F.S. Borin T.F. Borges G.F. Luiz W.B. Campos L.C.G. The Role of miRNAs in the Prognosis of Triple-Negative Breast Cancer: A Systematic Review and Meta-Analysis Diagnostics 2022 13 127 10.3390/diagnostics13010127 36611419 PMC9818368 48. Zhu H. Dai M. Chen X. Chen X. Qin S. Dai S. Integrated analysis of the potential roles of miRNA-mRNA networks in triple negative breast cancer Mol. Med. Rep. 2017 16 1139 1146 10.3892/mmr.2017.6750 28627677 PMC5561991 49. Cascione L. Gasparini P. Lovat F. Carasi S. Pulvirenti A. Ferro A. Alder H. He G. Vecchione A. Croce C.M. Integrated MicroRNA and mRNA Signatures Associated with Survival in Triple Negative Breast Cancer PLoS ONE 2013 8 e55910 10.1371/journal.pone.0055910 23405235 PMC3566108 50. Li G. Zhang H. Cao K. Zhai Z. Wang Z. Yang L. Han J. Transcriptome of visceral adipose tissue identifies an inflammation-related ceRNA network that regulates obesity Mol. Cell. Biochem. 2022 477 1095 1106 10.1007/s11010-022-04362-y 35064875 51. Gong Y. Ji P. Wu H.-L. He L.-H. Jin M.-L. Hu X. Jiang Y.-Z. Shao Z. Integrated analysis reveals the impact of obesity on triple-negative breast cancer Proceedings of the San Antonio Breast Cancer Symposium (SABCS) San Antonio, TX, USA 5–9 December 2023 Available online: https://aacrjournals.org/cancerres/article/84/9_Supplement/PO1-14-06/744131/Abstract-PO1-14-06 (accessed on 21 April 2025) 52. Supplitt S. Karpinski P. Sasiadek M. Laczmanski L. Kujawa D. Matkowski R. Kasprzak P. Abrahamowska M. Maciejczyk A. Iwaneczko E. The analysis of transcriptomic signature of TNBC—Searching for the potential RNA-based predictive biomarkers to determine the chemotherapy sensitivity J. Appl. Genet. 2024 66 171 182 Correction in J. Appl. Genet. 2025 66 http://doi.org/10.1007/s13353-024-00902-y 10.1007/s13353-024-00876-x 38722458 PMC11761126 53. Hart S.N. Therneau T.M. Zhang Y. Poland G.A. Kocher J.-P. Calculating Sample Size Estimates for RNA Sequencing Data J. Comput. Biol. 2013 20 970 978 10.1089/cmb.2012.0283 23961961 PMC3842884 54. Fröman G. Acevedo F. Lundahl P. Hjertén S. The glucose transport activity of human erythrocyte membranes. Reconstitution in phospholipid liposomes and fractionation by molecular sieve and ion exchange chromatography Biochim. Biophys. Acta (BBA) Biomembr. 1980 600 489 501 10.1016/0005-2736(80)90451-4 7407124 55. Zhao S. Pan T. Deng J. Cao L. Vicencio J.M. Liu J. Zhou G. Ng T. Zhang J. Exosomal transfer of miR-181b-5p confers senescence-mediated doxorubicin resistance via modulating BCLAF1 in breast cancer Br. J. Cancer 2022 128 665 677 10.1038/s41416-022-02077-x 36522479 PMC9938221 56. Moro J. Grinpelc A. Farré P.L. Duca R.B. Lacunza E. Graña K.D. Scalise G.D. Dalton G.N. Massillo C. Piccioni F. miR-877-5p as a Potential Link between Triple-Negative Breast Cancer Development and Metabolic Syndrome Int. J. Mol. Sci. 2023 24 16758 10.3390/ijms242316758 38069080 PMC10706566 57. Li D. Hu J. Song H. Xu H. Wu C. Zhao B. Xie D. Wu T. Zhao J. Fang L. miR-143-3p targeting LIM domain kinase 1 suppresses the progression of triple-negative breast cancer cells Am. J. Transl. Res. 2017 9 2276 2285 28559978 PMC5446510 58. Luo Q. Wei C. Li X. Li J. Chen L. Huang Y. Song H. Li D. Fang L. MicroRNA-195-5p is a potential diagnostic and therapeutic target for breast cancer Oncol. Rep. 2014 31 1096 1102 10.3892/or.2014.2971 24402230 PMC3926672 59. Azoitei N. Hoffmann C.M. Ellegast J.M. Ball C.R. Obermayer K. Gößele U. Koch B. Faber K. Genze F. Schrader M. Targeting of KRAS mutant tumors by HSP90 inhibitors involves degradation of STK33 J. Exp. Med. 2012 209 697 711 10.1084/jem.20111910 22451720 PMC3328372 60. Liu J. Jiang G. Mao P. Zhang J. Zhang L. Liu L. Wang J. Owusu L. Ren B. Tang Y. Down-regulation of GADD45A enhances chemosensitivity in melanoma Sci. Rep. 2018 8 1 11 10.1038/s41598-018-22484-6 29515153 PMC5841426 61. Shu Y. Lan J. Luo H. Fu H. Xiao X. Yang L. FOS-Mediated PLCB1 Induces Radioresistance and Weakens the Antitumor Effects of CD8 + Mol. Carcinog. 2024 64 162 175 10.1002/mc.23834 39451071 62. Deevy O. Bracken A.P. PRC2 functions in development and congenital disorders Development 2019 146 dev181354 10.1242/dev.181354 31575610 PMC6803372 63. Zhang X. Cong L. Xu D. Leng Q. Shi M. Zhou Y. AC092127.1-miR-451a-AE binding protein 2 Signaling Facilitates Malignant Properties of Breast Cancer J. Breast Cancer 2021 24 389 401 10.4048/jbc.2021.24.e37 34352938 PMC8410618 64. Ho J.C.-W. Chen J. Cheuk I.W.-Y. Siu M.-T. Shin V.Y. Kwong A. MicroRNA-199a-3p promotes drug sensitivity in triple negative breast cancer by down-regulation of BRCA1 Am. J. Transl. Res. 2022 14 2021 2036 35422914 PMC8991114 65. Shi C. Zhang M. Tong M. Yang L. Pang L. Chen L. Xu G. Chi X. Hong Q. Ni Y. miR-148a is Associated with Obesity and Modulates Adipocyte Differentiation of Mesenchymal Stem Cells through Wnt Signaling Sci. Rep. 2015 5 srep09930 10.1038/srep09930 PMC4441322 26001136 66. Wu A. Chen Y. Liu Y. Lai Y. Liu D. miR-199b-5p inhibits triple negative breast cancer cell proliferation, migration and invasion by targeting DDR1 Oncol. Lett. 2018 16 4889 4896 10.3892/ol.2018.9255 30250555 PMC6144876 67. Villagrán-Silva F. Loren P. Sandoval C. Lanas F. Salazar L.A. Circulating microRNAs as Potential Biomarkers of Overweight and Obesity in Adults: A Narrative Review Genes 2025 16 349 10.3390/genes16030349 40149500 PMC11942292 68. Yin J. Chen D. Luo K. Lu M. Gu Y. Zeng S. Chen X. Song Y. Zhang Z. Zheng G. Cip2a/miR-301a feedback loop promotes cell proliferation and invasion of triple-negative breast cancer J. Cancer 2019 10 5964 5974 10.7150/jca.35704 31762806 PMC6856592 69. Yu H. Li H. Qian H. Jiao X. Zhu X. Jiang X. Dai G. Huang J. Upregulation of miR-301a correlates with poor prognosis in triple-negative breast cancer Med Oncol. 2014 31 283 10.1007/s12032-014-0283-2 25311065 70. Li Q. Liu J. Meng X. Pang R. Li J. MicroRNA-454 may function as an oncogene via targeting AKT in triple negative breast cancer J. Biol. Res. 2017 24 1 10 10.1186/s40709-017-0067-x PMC5541748 28795052 71. Zhang L. Chen Y. Wang H. Zheng X. Li C. Han Z. miR-376a inhibits breast cancer cell progression by targeting neuropilin-1 NR OncoTargets Ther. 2018 11 5293 5302 10.2147/OTT.S173416 PMC6124787 30214235 72. MacCuaig W.M. Thomas A. Claros-Sorto J.C. Gomez-Gutierrez J.G. Alexander A.C. Wellberg E.A. Grizzle W.E. McNally L.R. Differential expression of microRNA between triple negative breast cancer patients of African American and European American descent Biotech. Histochem. 2022 97 1 10 10.1080/10520295.2021.2005147 34979848 PMC9047185 73. Zhu Q. Balasubramanian A. Asirvatham J.R. Chatterjee M. Piyarathna B. Kaur J. Mohamed N. Wu L. Wang S. Pourfarrokh N. Integrative spatial omics reveals distinct tumor-promoting multicellular niches and immunosuppressive mechanisms in Black American and White American patients with TNBC bioRxiv 2025 10.1038/s41467-025-61034-3 40675986 PMC12271405 74. Ribeiro R. Monteiro C. Catalán V. Hu P. Cunha V. Rodríguez A. Gómez-Ambrosi J. Fraga A. Príncipe P. Lobato C. Obesity and prostate cancer: Gene expression signature of human periprostatic adipose tissue BMC Med. 2012 10 108 10.1186/1741-7015-10-108 23009291 PMC3523039 75. Su Y.-H. Wu Y.-Z. Ann D.K. Chen J.L.-Y. Kuo C.-Y. Obesity promotes radioresistance through SERPINE1-mediated aggressiveness and DNA repair of triple-negative breast cancer Cell Death Dis. 2023 14 1 13 10.1038/s41419-023-05576-8 36681663 PMC9867751 76. Son J. Lee J.-H. Kim H.-N. Ha H. Lee Z.H. cAMP-response-element-binding protein positively regulates breast cancer metastasis and subsequent bone destruction Biochem. Biophys. Res. Commun. 2010 398 309 314 10.1016/j.bbrc.2010.06.087 20599715 77. Si W. Xu X. Wan L. Lv F. Wei W. Xu X. Li W. Huang D. Zhang L. Li F. RUNX2 facilitates aggressiveness and chemoresistance of triple negative breast cancer cells via activating MMP1 Front. Oncol. 2022 12 996080 10.3389/fonc.2022.996080 36483054 PMC9724742 78. Tang A.H. Hoefer R.A. Guye M.L. Bear H.D. Persistent EGFR/K-RAS/SIAH pathway activation drives chemo-resistance and early tumor relapse in triple-negative breast cancer Cancer Drug Resist. 2022 5 691 702 10.20517/cdr.2022.31 36176751 PMC9511813 79. Loi S. Dushyanthen S. Beavis P.A. Salgado R. Denkert C. Savas P. Combs S. Rimm D.L. Giltnane J.M. Estrada M.V. RAS/MAPK Activation Is Associated with Reduced Tumor-Infiltrating Lymphocytes in Triple-Negative Breast Cancer: Therapeutic Cooperation Between MEK and PD-1/PD-L1 Immune Checkpoint Inhibitors Clin. Cancer Res. 2016 22 1499 1509 Correction in Clin. Cancer Res. 2019 25 http://doi.org/10.1158/1078-0432.CCR-18-4264 10.1158/1078-0432.CCR-15-1125 26515496 PMC4794351 80. Wen J.S.Y. Tatevossian R. Li Y. Ellison D.W. Wu G. Zhang J. Easton J.B. Optimization of library and enrichment procedures for RNASeq using RNA from formalin fixed paraffin embedded tissue Proceedings of the AACR Annual Meeting Washington, DC, USA 1–5 April 2017 Available online: https://aacrjournals.org/cancerres/article/77/13_Supplement/5352/621118/Abstract-5352-Optimization-of-library-and (accessed on 21 April 2025) 81. Shannon P. Markiel A. Ozier O. Baliga N.S. Wang J.T. Ramage D. Amin N. Schwikowski B. Ideker T. Cytoscape: A software environment for integrated models of Biomolecular Interaction Networks Genome Res. 2003 13 2498 2504 10.1101/gr.1239303 14597658 PMC403769 Figure 1 Analysis of differentially expressed (DE) miRNA in tissue samples from European American (EA) patients with triple negative breast cancer (TNBC). ( A B C D E Figure 2 Analysis of differentially expressed (DE) miRNA in tissue samples from African American (AA) patients with triple negative breast cancer (TNBC). ( A B C D E Figure 3 Differentially expressed (DE) miRNAs related to TNBC and obesity in European American (EA) and African American (AA) women. ( A B C D E F G H Figure 4 Heatmaps of Differentially Expressed Genes (DEGs) in obese vs. lean patients with triple negative breast cancer (TNBC) by ancestry group. ( A B C D Figure 5 miRNA–mRNA interaction network in obese relative to lean patients in European American (EA) and African American (AA) women. ( A B Figure 6 Reactome pathway enrichment analysis for mRNA targets of differentially expressed miRNAs. The top 20 significantly enriched Reactome pathways for correlated mRNA targets of differentially expressed miRNAs in European American (EA) ( A B p Figure 7 Validation of expression and survival analysis of miRNAs associated with obesity using the TCGA-BRCA database. miR-181b-2 [in European American (EA)] and miR-454 [in African American (AA)] were significantly associated with differential survival in different ethnic groups. Both miRNAs show a significant increase in their expression in tumor tissues, as compared to normal (control) tissues. The expression of the other two miRNAs showed increased (miR-877 in EA) and reduced expression in tumor tissues (miR-195 in AA), but did not show association with survival. ijms-26-09101-t001_Table 1 Table 1 Demographic characteristics of participating patients.  All AA EA p All, n 24 (100.0) 12 (100.0) 12 (100.0)  Age at diagnosis in years, mean (std) 61.4 (13.0) 65.0 (14.0) 57.7 (10.8) 0.1474 # BMI at diagnosis, n    1 Lean 12 (50.0) 6 (50.0) 6 (50.0)  Obese 12 (50.0) 6 (50.0) 6 (50.0)  Tumor stage (SEER), n    1 Localized 5 (20.8) 3 (25.0) 2 (16.7)  Regional 18 (75.0) 9 (75.0) 9 (75.0)  Distant 1 (4.2) 0 (0.0) 1 (8.3)  Abbreviations: BMI = body mass index, SEER = Surveillance, Epidemiology, and End Results program; # Student’s t ",
  "metadata": {
    "Title of this paper": "Cytoscape: A software environment for integrated models of Biomolecular Interaction Networks",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471265/"
  }
}