{
  "title": "Paper_309",
  "abstract": "pmc SSM Popul Health SSM Popul Health 3383 ssmph SSM - Population Health 2352-8273 Elsevier PMC12486174 PMC12486174.1 12486174 12486174 41041516 10.1016/j.ssmph.2025.101853 S2352-8273(25)00107-7 101853 1 Regular Article The intergenerational transmission from adult Children's education to parents' health in China: Nonlinearity and mechanisms He Huan freda_hehuan@163.com ⁎ 1 Peng Lanxi 1 Li Xuanhan School of Public Administration, Southwestern University of Finance and Economics, Chengdu, China ⁎ freda_hehuan@163.com 1 These authors contributed equally to this study and should be considered co-first authors. 9 2025 19 8 2025 31 490811 101853 6 5 2025 27 6 2025 16 8 2025 19 08 2025 02 10 2025 03 10 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Current studies suggest the intergenerational transmission of educational advantages is bidirectional over the life course. However, results from causal analysis studies do not consistently support the beneficial effect of adult children's education on aging parents' health. The conflicting evidence indicates a complex relationship, which may be nonlinear or only prominent in certain settings or explained by specific pathways, but remains unexplored. Using the 2016 and 2018 China Family Panel Studies data and instrumental variable estimation, we examine the effect of adult children's education on parents' health and systematically explore its heterogeneity and underlying mechanisms. Our study finds that adult children's education significantly improves parents' health in middle and older ages using instrumental variables estimation with two-stage least squares (IV/2SLS), but the effect may be nonlinear. The beneficial intergenerational transfer of health may slightly weaken when adult children's educational attainment exceeds the middle school education level. The effect of adult children's education on parents' health may be more notable in less developed regions and among younger parents and parents living with or less educated than their adult children. The mechanism analyses results suggest that adult children's education may enhance parents' health through both stress-based pathways (i.e., family economic hardship) and resource-based pathways (i.e., emotional support from children, housework support from parents, and improving parents' access to the resources), but not via the analyzed health habits. Our findings suggest that promoting children's education may improve parents' health over the life course, especially at least graduating from middle school. Our findings imply that prioritizing basic education policy in less developed regions, and providing buffers for economic stressors or enhancing daily intergenerational interactions within families are important for healthy aging in developing societies. Highlights • Improved adult children’s education enhances their aging parents’ health, including mental, physical, and cognitive health. • The health benefits for parents may be nonlinear and diminish when adult children’s education extends beyond middle school. • This positive intergenerational transfer may be more notable in less developed regions with lower social security levels. • Resource-based and stress-based mechanisms can explain this intergenerational health advantage from offspring to parents. Keywords Intergenerational transmission Middle-aged and older people Education Health pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction Education plays a crucial role in determining an individual's health, not only benefiting one's health ( Cutler & Lleras-Muney, 2006 Ma, 2019 Balaj et al., 2021 Gutierrez et al., 2024 Lee, 2018 De Neve & Harling, 2017 Furstenberg, 2019 Wainwright & Marandet, 2010 Elder, 2003 Silverstein & Bengtson, 1994 Lundborg & Majlesi, 2018 Potente et al., 2023 One aspect of the complexity may come from the potential nonlinear relationship between adult children's education and parents' health, which is understudied. As children gain higher degrees, the additional increase in the beneficial effect of education on their parents' health may decline. Previous studies already demonstrated that the education effect on one's own health might not be strictly linear due to diminishing returns ( Cutler & Lleras-Muney, 2006 Liu et al., 2018 1.1 Heterogeneous effect The heterogeneous effect of adult children's education on parents' health in different settings may also complicate the study results. Some studies have discussed that the differences in regional socioeconomic development conditions may explain the inconsistent results from developed and developing countries. First, in developed countries, the social security system was launched in the 1880s and grew massively after World War II, while it debuted relatively late in developing countries ( Dethier, 2009 Leung, 2003 Dethier, 2009 Yip et al., 2019 Zhao et al., 2025 Zhao et al., 2025 Chen & Liu, 2009 Potente et al., 2023 Cai et al., 2012 Giles et al., 2010 Pei & Cong, 2020 In addition to the regional socioeconomic development level, parents' and children's characteristics contributing to the heterogeneous effects of adult children's education on parents' health are neither sufficiently discussed. Previous studies primarily focused on children's and parents' demographic characteristics (e.g., gender of parents and adult children) ( Friedman & Mare, 2014 Jiang, 2019 Liu, Ma, & Smith, 2022 Cutler & Lleras-Muney, 2006 Lauderdale, 2001 Liu, 2021 Thoma et al., 2021 Wang, 2024 Goldman & Cornwell, 2018 Cameron & Cobb-Clark, 2008 Meng et al., 2023 1.2 Potential pathways The underlying mechanisms of the positive effect of adult children's education on parents' health are also not fully explored. Previous studies have mainly focused on the potential paths through financial support, emotional support, health behaviors, and access to resources according to the Social Determinants of Health (SDOH) framework ( Braveman et al., 2011 Marmot et al., 2012 Ma, 2019 Ma & Wen, 2016 Umberson, 1992 Friedman & Mare, 2014 Liu, 2021 Ma, 2019 Marmot et al., 2012 Wang, 2024 Although a series of potential mechanisms linking adult children's education to parents' health has been discussed before, some key potential paths are understudied. First, previous studies mainly focus on resource-based mechanisms but rarely test stress-based mechanisms. Parents of adult children with lower levels of education may be more likely to face some stressors, such as excessive debt or expenditure and family economic hardship ( Conger et al., 1994 Zhang et al., 2020 Seol et al., 2021 Ma & Wen, 2016 Hämäläinen & Tanskanen, 2021 Huo et al., 2019 Adjei & Brand, 2018 Chu et al., 2023 Lei et al., 2023 Papp-Zipernovszky et al., 2021 1.3 The present study Understanding how adult children's education would improve parents' health is important in identifying critical family-level resources and processes for preventing or slowing middle-aged and older parents' health decline. In this study, applying the date of compulsory education being universalized in each county as an IV for adult children's education, we employed instrumental variables estimation with two-stage least squares (IV/2SLS) to examine the causal effect of adult children's education on their parents' multidimensional health using two waves of nationally representative survey data in China. Additionally, we verified whether there is an inflection point in the causal effect of adult children's education on their parents' health. Guided by the SDOH framework and previous literature, we conducted a series of heterogeneity and subgroup analyses to display how the above intergenerational transfer of health varies by the extent of provincial socioeconomic development and children's and parents' characteristics. Finally, we further examined the mediating roles of family economic hardship, family support (financial and emotional support), parents' health behaviors (physical activities, tobacco use, and alcohol drinking), and parents' access to resources (access to the Internet and access to a good living environment). 2 Methods 2.1 Data and sample This study utilizes data from the China Family Panel Studies (CFPS) project, a nationwide survey conducted by the Institute of Social Science Survey at Peking University. The CFPS project began in 2010 and has since been conducted every two years, resulting in six waves of data. Because of the relatively high proportion of young parents in the previous survey and the COVID-19 outbreak in 2019, the latest two waves of data before COVID-19, collected in 2016 and 2018, were included for analysis. Furthermore, participants with surviving middle-aged or elderly parents aged 45 years and above and living adult children aged 18 years and above were included in the analytical sample. Observations with missingness of dependent, independent, or control variables were excluded. Finally, the main analyses contain 10,412 pairs of parents and children. 2.2 Measures 2.2.1 Children's education Adult children's education is measured by years of schooling, i.e., years the highest-educated adult children take to obtain their highest degree in standard academic duration. A family may have multiple surviving children aged 18 years and older, while the highest level of education of all living children is mostly strongly associated with parents' health than lowest-educated children and the children living closest to their parents ( Zimmer et al., 2007 Kemptner et al., 2011 Ma, 2019 2.2.2 Instrumental variables for children's education We use the date of compulsory education being universalized in each county as an IV. China enacted the “Nine-Year Compulsory Education Law” in 1986, providing primary and middle school education with no tuition or miscellaneous fees for school-age children and teenagers nationwide ( Ming, 1986 Sun, 2022 Fang et al., 2023 2.2.3 Parents’ health The multidimensional parents' health is measured by three aspects of health: mental health, physical function, and cognitive function. Mental health is measured by an 8-item version of the Center for Epidemiological Studies Depression Scale (CES-D8) for parents’ self-reported depressive symptoms. CES-D8 is one of the most widely used self-evaluation scales to measure depressive symptoms in many large-scale surveys ( Alvarez-Galvez & Rojas-Garcia, 2019 Zhou et al., 2022 Parents’ physical function is indicated by the instrumental ability of daily living (IADL). IADL measures the level at which respondents can perform basic daily tasks independently, which has been widely used in previous studies ( Li & Zhou, 2021 Takele et al., 2024 Ferrucci et al., 1998 Lawton & Brody, 1969 WHO, 1980 We measure parents' subjective memory through the item “How many major things can you remember that happened to you in a week?” in the CFPS survey. Responses to this question were rated on a 5-point scale, which equals 1 = everything, 2 = most of them, 3 = half of them, 4 = a few, and 5 = a little. According to the responses, parents' reporting that they can remember only a little or a few things indicates that parents may have memory impairment, while reporting remembering most major things or everything means parents may have a good memory ( Yuan, Gong, & Han, 2020 Xu et al., 2022 2.2.4 Characteristics of parents, adult children, and families We accounted for an array of individual and family characteristics as control variables. Adult children's and parents' characteristics include their age, gender (1 = male, 0 = female), marriage status (1 = married/cohabitation, 0 = unmarried), parental reports of whether the highest-educated children live with parents at the time, parents' education years, whether the parent is less educated than the indicated adult child (1 = yes, 0 = no), percentage of parents who had any chronic diseases over the past 6 months and parents' medical cost over the past 12 months (10,000 Yuan). Families' characteristics include the number of family members (including non-immediate family members with blood/marriage/adoption relationships who live at home for three months and immediate family) and annual household income per capita (10,000 Yuan). This study further examines partial parents' and adult children's characteristics, including parents' and adult children's demographic characteristics, parents' socioeconomic status, and adult children's living arrangements, as moderators in exploring the heterogeneity. The parents' and adult children's demographic characteristics considered in this study are whether parents live in urban areas and parents' and adult children's gender. Parents' socioeconomic status is indicated by whether parents graduated from middle school or above and whether the parents are less educated than their adult children. Education is one of the indicators to assess socioeconomic status, and education may affect other indicators of socioeconomic status (e.g., income and occupation) ( Oreopoulos & Salvanes, 2011 Yang & Gao, 2018 2.2.5 Characteristics of regions This study also examines the heterogeneous effect of adult children's education on their parents' health at different levels of provincial socioeconomic development. The regional socioeconomic development level considered in this study reflects regional economic development and social security level. Social security involves aspects such as unemployment insurance, the pension system, and the medical system, aiming to cover people's old age, unemployment, health, and other risks ( Dethier, 2009 Bradley et al., 2011 ILO, 2021 National Bureau of Statistics of China, 2019 National Bureau of Statistics of China, 2017 2.2.6 Family economic hardship The first potential pathway we examine in this study is via family economic hardship. Family economic hardship is measured by the family debt-to-asset ratio and family expenditure-to-income ratio, following previous studies ( Liu et al., 2021 Zhang et al., 2020 2.2.7 Family support Family support, another potential pathway, includes financial and emotional support. It is worth noting that CFPS only inquired of respondents aged 60 and above about the frequency of family support received from their children. Financial support refers to financial support from adult children to their parents. The amount of financial support from child to parent is measured by the answer to “How much money does your adult child give you each month on average?” and the reported amount of money given by the most educated adult children. Emotional support contains three variables: the relationship between parents and their adult children, the frequency of remote contact between parents and their adult children, and the frequency of meetings between parents and their adult children. First, we use a 5-point scale ranging from “not close” (1 point) to “very close” (5 points) to measure the relationship between parents and their adult children. Second, we measure the frequency of remote contact and meetings between parents and their adult children using a 7-point scale ranging from never to almost every day. Remote contact in this study means communicating with parents by phone, text, letter, or email. 2.2.8 Health behaviors We use two sets of variables to detect the mediating role of health behaviors: physical activities and substance use, which are common indicators of health behavior ( Noble et al., 2015 Steptoe et al., 1996 2.2.9 Access to resources Access to resources includes access to the Internet and a good living environment. First, we use “whether parents can access the Internet” to indicate the parents’ ability to access information through the Internet. In detail, for the item “Do you use a mobile device to access the Internet, such as a mobile phone or tablet?”, the answer “yes” is coded as 1, indicating the respondent can access the Internet to gain health information, and the answer “no” is coded as 0. Second, we use a set of dummy variables to measure whether parents can access clean water and clean fuels from the survey item asking individuals about their cooking water and fuel usage. If individuals mainly use tap or pure water (filtered tap water) for cooking, we define it as having access to clean water. If individuals mainly use gas, electricity, or solar energy for cooking, we code them as having access to clean fuels. 2.3 Statistical analyses To explore the effect of adult children's education on their parents' health, the IV/2SLS regression models with fixed effects are used. The regression model is specified as follows: (1) p a r e n t s ′ h e a l t h i j = α 0 + β 1 a d u l t c h i l d r e n ′ s e d u c t a i o n i j + β 2 X i j + ω i j + ε i j (2) a d u l t c h i l d r e n ′ s e d u c t a i o n i j = α 0 + γ 1 I V i j + γ 2 X i j + ω i j + ε i j X i j i i j I V i j ω i j ε i j Nonlinear relationships are often tested by three methods: 1) transforming the continuous independent variable into a discrete one and identifying each category of values' effect ( Zhao et al., 2022 Anand et al., 2018 Li et al., 2022 Lynch, 2003 Kemptner et al., 2011 Ma, 2019 The heterogeneous effect of adult children's education on parents' health among parents' birth cohorts is examined by grouped regression analyses. Because this study only contains two waves of survey data, the birth cohort grouping can be representative of the age grouping to some extent. For the heterogeneous effect among other moderators, we add the interaction term between adult child education and each moderator (level of provincial socioeconomic development, and parents' and adult children's characteristics) to explore the heterogeneity in the relationship between adult children's educational attainment and their parents' health status. All the interaction terms are tested one by one. As for the mechanisms analysis, firstly, we explore which potential pathways can be affected by adult children's schooling years. Secondly, after identifying which key mediating variables are affected by adult children's education, we apply a causal inference approach to directly examine the hypothesized pathways from adult children's education to their parents' health through these key intermediate variables ( Emsley & Liu, 2013 Valeri & VanderWeele, 2013 3 Results 3.1 Summary statistics of characteristics of parents, adult children, and family Table 1 Table 1 Characteristics of samples. Table 1 Mean/% SD Characteristics of the highest-educated adult children Education years of the child 12.04 3.60 Age of the child 30.62 7.39 Male child (%) 63.82 Unmarried child (%) 41.53 Living with parents (%) 52.87 Characteristics of parents Urban parent (%) a 47.68 Age of parent 56.47 8.18 Male parent (%) 47.87 Education years of parent 6.29 4.57 Parents graduated from middle school or above (%) 17.41 Less educated than the indicated adult child (%) 95.55 Unmarried parent (%) 9.02 Had any chronic diseases over the past 6 months (%) 28.64 Medical cost over the past 12 months (1000 Yuan) 3.26 9.48 Characteristics of families Number of family members 4.35 1.96 Annual household income per capita (10,000 Yuan) 2.30 4.66 Characteristics of regions Provincial GDP above or equal to the national average (%) 38.99 Provincial social security expenditure level above or equal to the national average (%) 41.74 Provincial social health expenditure level above or equal to the national average (%) 34.18 County-level GDP per capita (10,000 Yuan) b 4.45 4.05 Characteristics of parents' health status Depression score (CES_D8) 13.89 4.24 IADL score 6.73 0.93 Subjective memory score 1.98 0.83 Notes a Number of observations of urban parents is 10,375. b Number of observations of county-level GDP per capita is 7607. Table 1 3.2 Relationships between children's education and parents' health The OLS and IV/2SLS estimates in Table 2 p < p < p < Chen & Hamori, 2009 Ishimaru, 2024 Table 2 Effects of the highest-educated adult children's education on their parents' health. Table 2 Depression score (CES_D8) IADL score Subjective memory score OLS IV OLS IV OLS IV Adult children’s education years -0.074∗∗∗ -0.538∗∗∗ 0.018∗∗∗ 0.159∗∗∗ 0.011∗∗∗ 0.051∗ (0.014) (0.136) (0.004) (0.034) (0.003) (0.025) Characteristics of the highest-educated adult children Age of the child -0.027∗ -0.053∗∗∗ -0.001 0.007 0.005 0.007∗∗ (0.013) (0.015) (0.004) (0.004) (0.003) (0.003) Male child 0.229∗∗ -0.113 0.019 0.123∗∗∗ -0.009 0.020 (0.084) (0.134) (0.023) (0.032) (0.020) (0.025) Living with parents -0.369∗∗∗ -0.473∗∗∗ -0.029 0.002 0.030 0.039∗ (0.088) (0.098) (0.021) (0.022) (0.019) (0.018) Unmarried child -0.481∗∗∗ -0.714∗∗∗ 0.021 0.092∗∗ -0.018 0.002 (0.101) (0.124) (0.026) (0.031) (0.022) (0.023) Characteristics of parents Age of parent 0.062∗ 0.101∗∗ -0.013 -0.024∗∗ -0.028∗∗∗ -0.031∗∗∗ (0.030) (0.034) (0.008) (0.008) (0.006) (0.006) Male parent -0.827∗∗∗ -1.103∗∗∗ 0.013 0.096∗∗∗ 0.117∗∗∗ 0.141∗∗∗ (0.083) (0.118) (0.020) (0.028) (0.017) (0.022) Education years of parent -0.105∗∗∗ 0.032 0.011∗∗∗ -0.031∗∗ 0.037∗∗∗ 0.026∗∗∗ (0.011) (0.041) (0.003) (0.010) (0.002) (0.008) Less educated than the indicated child 0.053 2.461∗∗∗ 0.009 -0.722∗∗∗ -0.010 -0.218 (0.207) (0.736) (0.064) (0.188) (0.044) (0.135) Unmarried parent -1.707∗∗∗ -1.339∗∗∗ 0.053 -0.059 -0.018 -0.050 (0.170) (0.211) (0.047) (0.050) (0.033) (0.035) Had any chronic diseases over the past 6 months 1.430∗∗∗ 1.471∗∗∗ -0.097∗∗∗ -0.110∗∗∗ -0.071∗∗∗ -0.074∗∗∗ (0.093) (0.099) (0.024) (0.024) (0.018) (0.018) Medical cost over the past 12 months (1,000 Yuan) 0.032∗∗∗ 0.033∗∗∗ -0.016∗∗∗ -0.016∗∗∗ -0.001 -0.001 (0.005) (0.006) (0.002) (0.002) (0.001) (0.001) Characteristics of families Number of family members -0.061∗ -0.131∗∗∗ 0.003 0.025∗∗ -0.007 -0.001 (0.025) (0.034) (0.006) (0.008) (0.005) (0.006) Annual household income per capita(10,000 Yuan) -0.033∗∗ -0.004 0.004∗ -0.005 0.010∗∗∗ 0.007∗∗∗ (0.012) (0.012) (0.002) (0.003) (0.002) (0.002) Province fixed effect Yes Yes Yes Yes Yes Yes Survey year fixed effect Yes Yes Yes Yes Yes Yes Parents’ cohort fixed effect Yes Yes Yes Yes Yes Yes p <0.001 <0.001 <0.001 F- 119.397 119.397 119.397 Notes: † p < p < p < p < 3.3 Non-linearity effect of adult children's education on parents' health We further explore the nonlinear causal effect of adult children's education on parents' health. The results in Fig. 1 Fig. 1 Differences in effects of adult children's education on their parents' health over adult children's education thresholds. Notes: The error bar illustrates the 90 % confidence intervals for the estimated coefficients. Thresholds are defined by whether the education of the highest educated child equals to or exceeds these education levels, if adult children's educational attainment equals to or exceeds the threshold, the threshold dummy variable is coded as 1; otherwise, it is coded as 0. Coefficients are interaction terms between adult children's education years and the threshold dummy variables, indicating how much the intergenerational health effect of adult children's education would change when children's education is equal to or above the threshold versus below the threshold. Fig. 1 3.4 Results for heterogeneity and subgroup analyses To gain a deeper understanding of how adult children's education affects the health of their middle-aged or elderly parents, we perform its heterogeneity for various levels of demographic characteristics, socioeconomic status, and living arrangements of both parents and adult children. We also present the results of the under-identification test and weak identification test for IV. Parents' and adult children's demographic characteristics include whether parents live in urban areas, parents' age, parents' gender, and adult children's gender. Parents' socioeconomic status indicates parents' education and the parent-child education gap. First, Fig. 2 Fig. 2 Estimated effects of adult children's education on their parents' health by different parents' birth cohort group. Notes: The graph illustrates the subgroup regression coefficient and their 90 % confidence interval estimates for parents of different birth cohorts. Fig. 2 Moreover, as shown in panel A of Table 3 p < p < Table 3 Heterogeneous effects by parents and the highest-educated adult children's characteristics and provincial socioeconomic development conditions. Table 3 Depression score (CES_D8) IADL score Subjective memory score OLS IV OLS IV OLS IV Panel A. By parents' and adult children's characteristics Adult children's education years × 0.001 −0.101 −0.016∗∗ −0.046 0.005 −0.006 (0.024) (0.155) (0.006) (0.036) (0.005) (0.028) Adult children's education years × 0.006 0.033 −0.013∗ −0.035 −0.012∗∗ −0.004 (0.022) (0.110) (0.006) (0.028) (0.004) (0.020) Urban: Adult children's education years × 0.026 0.130 −0.008 −0.062 −0.004 0.056 (0.036) (0.237) (0.007) (0.047) (0.007) (0.040) Rural: Adult children's education years × −0.002 −0.090 −0.016 a 0.016 −0.014∗ −0.029 (0.030) (0.179) (0.009) (0.049) (0.006) (0.033) Adult children's education years × 0.045 −0.376 −0.048∗ 0.008 −0.029∗ −0.023 (0.063) (0.367) (0.019) (0.090) (0.013) (0.070) Urban: Adult children's education years × 0.151 0.837 −0.013 0.161 −0.008 −0.208 (0.097) (1.198) (0.019) (0.175) (0.019) (0.214) Rural: Adult children's education years × −0.064 −1.161 a −0.078∗∗ 0.072 −0.049∗∗ 0.076 (0.087) (0.644) (0.029) (0.172) (0.018) (0.116) Adult children's education years × −0.072 a 0.263 −0.001 0.181 0.009 0.083 (0.040) (0.375) (0.008) (0.119) (0.008) (0.078) Adult children's education years × −0.003 −0.565∗ 0.040∗∗∗ 0.129∗ −0.019 0.019 (0.054) (0.258) (0.010) (0.064) (0.010) (0.058) Adult children's education years × 0.007 −0.097 0.026∗∗∗ 0.077∗∗ −0.002 −0.043 (0.022) (0.114) (0.006) (0.027) (0.004) (0.025) Panel B. Characteristics of regions Adult children's education years × 0.001 0.228 a 0.001 0.033 0.009∗ 0.025 (0.024) (0.120) (0.006) (0.034) (0.005) (0.023) Adult children's education years × −0.021 0.960∗∗ 0.023∗∗∗ −0.110 −0.009 a −0.077 a (0.023) (0.307) (0.006) (0.067) (0.004) (0.045) Adult children's education years × −0.013 0.447∗ 0.006 −0.154∗∗ −0.017∗∗∗ −0.116∗∗∗ (0.023) (0.190) (0.006) (0.051) (0.004) (0.035) Notes: Province, survey year, and parents' birth cohort fixed effects are added in all the regressions. All regressions also include control variables of adult children's characteristics (education years of the highest educated child, age of the highest educated child, indicators for males, whether the highest educated children live with their parents and marital status), control variables of parents' characteristics (age and indicators for male, highest educational attainment, whether the parents are worse educated than their adult children, marital status, whether had any chronic diseases in the past 6 months and medical cost) and control variables of families' characteristics (number of family members and annual household income per capita). a p < p < p < p < This study also explores the heterogeneity at the level of provincial socioeconomic development. For provincial GDP, the results in panel B of Table 3 p < p < p < 3.5 Results for mechanism analyses The IV/2SLS estimation results for the indirect effect of adult children's education on their parents' health are reported in Table 4 Table 5 Table 6 Table 7 TableA6 Table 4 Table 5 p < p < p < p < Table 7 p < Tables A2-5 Table 4 IV/2SLS estimation for the effect of the highest-educated adult children's education on family economic hardship. Table 4 Family debt-to-asset ratio Family expenditure-to-income ratio Adult children's education years −0.026∗∗ −0.034∗ (0.008) (0.015) Province fixed effect Yes Yes Survey year fixed effect Yes Yes Parents' birth cohort Yes Yes p <0.001 <0.001 F 118.199 113.870 Number of Observations 10,013 10,022 Notes: Regression coefficients are given in the table. Standard errors are in parentheses. All regressions also include control variables of adult children's characteristics (age of the highest educated child, indicators for male, whether the highest educated children live with their parents and marital status), control variables of parents' characteristics (age and indicators for male, highest educational attainment, whether the parents are worse educated than their adult children, marital status, whether had any chronic diseases in the past 6 months and medical cost) and control variables of families' characteristics (number of family members and annual household income per capita). ∗ p < p < Table 5 IV/2SLS estimation for the effect of the highest-educated adult children's education on family support. Table 5 Family financial support Family emotional support Amount of financial support from the child Child-parent closeness Child-parent remote contact frequency Child-parent meeting frequency Adult children's education years −0.001 −0.031 0.176∗ 0.261∗∗∗ (0.023) (0.026) (0.069) (0.073) Province fixed effect Yes Yes Yes Yes Survey year fixed effect Yes Yes Yes Yes Parents' birth cohort Yes Yes Yes Yes p <0.001 <0.001 <0.001 <0.001 F 80.535 90.413 90.603 90.001 Number of Observations 2504 3355 3352 3353 Notes: Regression coefficients are given in the table. Standard errors are in parentheses. Family support is only applied to participants aged 60 and above at the time of data collection. All regressions also include control variables of adult children's characteristics (age of the highest educated child, indicators for male, whether the highest educated children live with their parents and marital status), control variables of parents' characteristics (age and indicators for male, highest educational attainment, whether the parents are worse educated than their adult children, marital status, whether had any chronic diseases in the past 6 months and medical cost) and control variables of families' characteristics (number of family members and annual household income per capita). ∗∗ p < p < Table 6 IV/2SLS estimation for the effect of the highest-educated adult children's education on their parents' health behaviors. Table 6 Hours parents exercised in the last week Average hours parents spent on housework per day Whether parents drank three times or more a week last month Whether parents smoked last month Adult children's education years 0.411 0.317∗ 0.007 0.005 (0.277) (0.154) (0.010) (0.011) Province fixed effect Yes Yes Yes Yes Survey year fixed effect Yes Yes Yes Yes Parents' birth cohort Yes Yes Yes Yes p <0.001 <0.001 <0.001 <0.001 F 120.922 25.174 119.397 119.397 Number of Observations 10,396 2721 10,412 10,412 Notes: Regression coefficients are given in the table. Standard errors are in parentheses. All regressions also include control variables of adult children's characteristics (age of the highest educated child, indicators for male, whether the highest educated children live with their parents and marital status), control variables of parents' characteristics (age and indicators for male, highest educational attainment, whether the parents are worse educated than their adult children, marital status, whether had any chronic diseases in the past 6 months and medical cost) and control variables of families' characteristics (number of family members and annual household income per capita). ∗p < .05. Table 7 IV/2SLS estimation for the effect of the highest-educated adult children's education on their parents' access to resources. Table 7 Whether parents can access the Internet Whether parents can access clean water Whether parents can access clean fuels Adult children's education years 0.046∗∗∗ 0.052∗∗∗ 0.180∗∗∗ (0.012) (0.016) (0.023) Province fixed effect Yes Yes Yes Survey year fixed effect Yes Yes Yes Parents' birth cohort Yes Yes Yes p <0.001 <0.001 <0.001 F 119.397 119.397 118.593 Number of Observations 10,412 10,412 10,409 Notes: All regressions also include control variables of adult children's characteristics (age of the highest educated child, indicators for male, whether the highest educated children live with their parents and marital status), control variables of parents' characteristics (age and indicators for male, highest educational attainment, whether the parents are worse educated than their adult children, marital status, whether had any chronic diseases in the past 6 months and medical cost) and control variables of families' characteristics (number of family members and annual household income per capita). ∗∗∗ p < We draw on VanderWeele's mediation analysis of causal inference to further directly verify the indirect effects of adult children's education on their parents' health through the paths that are influenced by adult children's education. Table A6 3.6 Robustness checks The following robustness checks are conducted to address potential analytical issues. Firstly, socioeconomic status and other unobserved characteristics of the counties where the parent lives may affect the parent's current health status and the time counties achieved the goal of universalizing compulsory education, thus violating the exclusion restriction assumption in IV estimation. Therefore, following Oster's (2019) Table A7 Table A8 Table A7 and A8 Table 2 Secondly, this study selects the highest-educated adult children aged over 18 in the family as the representative adult children sample, which may also generate substantial bias in the IV/2SLS regressions due to its focus on a single specific child. To address this issue, we conduct several robustness checks using alternative independent variables or subsamples: 1) controlling siblings' average education years and using all adult children's average education years (Panels A and B in Table A9 Table A9 Table A9 Table A9 Table A9 Table A9 Table A9 Thirdly, the independent variable in the study can be used as an ordered categorical variable as well. The categorical variable of adult children's education can be indicated by educational attainment. Parents' subjective memory scores can be used as an ordered three-point categorical variable, indicating whether their memory is good, average, or poor. Following Roodman's (2011) Table 2 Table A10 Table 2 4 Discussion This study found a significant positive effect of adult children's education on middle-aged and elderly parents' health in China, and the effect may be nonlinear. In addition, we found heterogeneous effects of adult children's education on their parents' health over different regional socioeconomic conditions, individual socioeconomics, and living arrangements. Examining mechanisms based on resources and stressors, we found intergenerational transmission may be explained by parents' family economic hardship, adult children providing emotional support to their parents, their parents doing housework, and their parents' access to resources for health maintenance. This study indicates that adult children's education can improve parents' health with a possible threshold effect. Our study is consistent with previous studies from developing countries, including China, which found that adult children's education can relieve parents' depression levels ( Ma, 2019 Pai et al., 2021 Yahirun et al., 2016 2017 Cutler & Lleras-Muney, 2006 Liu et al., 2018 Our heterogeneous results over regional socioeconomic development levels may contribute to resolving conflicting results from developing and developed countries. As reviewed before, studies in developing countries, such as China, widely observe the health advantages transmitted from adult children's education to their parents, which is not supported by recent studies in developed countries, such as England and Switzerland. Our heterogeneous analyses of different regions in one country confirm the hypotheses that regional socioeconomic development may be a condition for adult children's education to improve their parents' health. Compared with developed areas, the inadequate social welfare and social security systems in developing areas leave a larger proportion of parents largely dependent on their children's resources to increase their health status ( Chen & Liu, 2009 Pei & Cong, 2020 Different characteristics of parents and their adult children may also explain the varied effects of adult children's education on parents' health. First, we found that the effect may not vary depending on whether parents live in urban or rural areas. This differs from the results of provincial socioeconomic development, indicating that rural-urban disparity within a region may be narrower compared to regional disparity, or rural-urban migration is more prevalent within a region in China. The regional economic and social development remains unbalanced when comparing East and West China, as well as South and North China, while the urban-rural disparity within the same region is narrowing ( Deng et al., 2022 Jiang, 2022 Kenneth, 2006 Liu et al., 2022 Liu et al., 2022 Second, unlike other Chinese studies that reported no significant age group differences ( Liu, 2021 Third, our findings suggest that the intergenerational transmission of adult children's education to parents health do not vary on all demographics and socioeconomics variables, but those related to parents' health needs and adult children's ability to provide resources. The effect of adult children's education on their parents' health may not differ by parents' gender ( Jiang, 2019 Silverstein et al., 2006 Friedman & Mare, 2014 Song et al., 2012 Lundborg & Majlesi, 2018 Sabater et al., 2020 Goldman & Cornwell, 2018 Liu, 2021 Wang, 2024 Living arrangement is another important social condition to explain whether the effect of adult children's education on parents' health would vary. Adult children's education may have greater health effects on their parents for those living together with adult children than those living apart. This may be because long-term intimate contact caused by living with parents improves the opportunities for adult children and parents to interact and improves the chances that adult children and their parents help each other, and their education may easily benefit their parents' health ( Caputo & Cagney, 2023 Teerawichitchainan et al., 2015 Langenberger et al., 2025 Wang, 2022 Zimmer, 2008 We find that the positive effect of adult children's education on their parents' health is more likely to be exerted through family economic hardship, family emotional support, housework support, and access to resources. Firstly, we provide new evidence that parents of highly educated adult children often face lower potential expenditure and debt risks, which may reduce family economic stress, thus making parents healthier ( Conger et al., 1994 Zhang et al., 2020 Ma & Wen, 2016 Ellwardt et al., 2015 Zahodne et al., 2019 Adjei & Brand, 2018 Wang, 2024 Torres et al., 2022 Solomon-Moore et al., 2017 Unlike previous studies, we quantified the extent to which various pathways explain intergenerational transmission from adult children's education to parents' health. We find that child-parent remote contact frequency from family emotional support and proper housework from health behavior explain the largest proportions of the positive adult children's education effects on parents' health outcomes (11.8 % and 10.2 %, respectively), while the expenditure-to-income ratio from family economic hardship explains the least proportion (2.8 %). Overall, these intermediate variables can partially explain the effects of adult children's education on parents' health, which is similar to other pathways reported in studies focusing on health outcomes (1 %–25 %) ( Hvidtfeldt et al., 2013 Kim & VanderWeele, 2019 Ohrnberger et al., 2017 This study has its limitations. First, for the main analyses, this study only includes parents aged 45 years or above from recent surveys in China. For the mechanism analyses of family support, this study only reported the results for the elderly but not middle-aged parents, because the questionnaires related to family support were only for respondents aged 60 and above. The results in this study may not be directly generalized to other developed countries or younger parents. Second, some mechanism analyses in this study may suffer from bidirectional causation issues, like other similar studies. For instance, healthier parents may be more capable of doing physical activities, while weaker parents receive more frequent support from children ( Yuan, Gong, & Han, 2020 In summary, this study further verifies the benefits of adult children's education to their parents' health improvement in China. We resolve the conflicts in the literature and provide a more coherent explanation for the complex relationship between adult children's education and their parents' health by systematically conducting nonlinear effect estimations and exploring the heterogeneity and mechanisms. Our findings suggest that education beyond a certain level has a weaker effect on enhancing intergenerational transmission. Education policies may be tailored based on socioeconomic development: less developed regions need to improve coverage and quality of preschool and basic education, while developed regions need to target children of low family socioeconomic status. Family policies that focus on facilitating multi-generational cohabitation and improving child-parent interactions may help address the social challenge of population aging. Health interventions for the middle-aged and elderly could emphasize the role of strategies that buffer economic stress or can be easily adhered to in daily life settings. Our findings have important implications for policymakers, professionals, and families in seeking strategies for healthy aging and health equity across generations. CRediT authorship contribution statement Huan He: Lanxi Peng: Xuanhan Li: Ethics statement This is a secondary data analysis of publicly available, de-identified data; The database used in this study, CFPS, was reviewed and approved by the Institutional Review Board (IRB) of the Biomedical Ethics Committee of Peking University (IRB00001052-14010). Declaration of interest The authors declared no potential conflicts of interest concerning the study, authorship, and publication of the present paper. References Adjei N.K. Brand T. Investigating the associations between productive housework activities, sleep hours and self-reported health among elderly men and women in western industrialised countries BMC Public Health 18 1 2018 110 10.1186/s12889-017-4979-z 29320997 PMC5763579 Alvarez-Galvez J. Rojas-Garcia A. Measuring the impact of multiple discrimination on depression in Europe BMC Public Health 19 1 2019 435 10.1186/s12889-019-6714-4 31023286 PMC6485073 Anand P. Esposito L. Villaseñor A. Depression and economic status: Evidence for non-linear patterns in women from Mexico Journal of Mental Health 27 6 2018 529 551 10.1080/09638237.2018.1521918 30457031 Balaj M. York H.W. Sripada K. Besnier E. Vonen H.D. Aravkin A. Friedman J. Griswold M. Jensen M.R. Mohammad T. Mullany E.C. Solhaug S. Sorensen R. Stonkute D. Tallaksen A. Whisnant J. Zheng P. Gakidou E. Eikemo T.A. Parental education and inequalities in child mortality: A global systematic review and meta-analysis The Lancet 398 10300 2021 608 620 10.1016/S0140-6736(21)00534-1 PMC8363948 34119000 Bradley E.H. Elkins B.R. Herrin J. Elbel B. Health and social services expenditures: Associations with health outcomes BMJ Quality and Safety 20 10 2011 826 831 10.1136/bmjqs.2010.048363 21447501 Braveman P. Egerter S. Williams D.R. The social determinants of health: Coming of age Annual Review of Public Health 32 1 2011 381 398 10.1146/annurev-publhealth-031210-101218 21091195 Cai F. Giles J. O'Keefe P. Wang D. The elderly and old age support in rural China 2012 World Bank Publications Cameron L.A. Cobb-Clark D. Do coresidency and financial transfers from the children reduce the need for elderly parents to works in developing countries? Journal of Population Economics 21 4 2008 1007 1033 10.1007/s00148-006-0105-8 Caputo J. Cagney K.A. Under different roofs? Coresidence with adult children and parents' mental health across race and ethnicity over two decades Demography 60 2 2023 461 492 10.1215/00703370-10571923 36794767 PMC10566343 Chen G. Hamori S. Economic returns to schooling in urban China: OLS and the instrumental variables approach China Economic Review 20 2 2009 143 152 10.1016/j.chieco.2009.01.003 Chen F. Liu G. Population aging in China International Handbook of Population Aging 2009 157 172 10.1007/978-1-4020-8356-3_8 Chu L. Gong X. Lay J.C. Zhang F. Fung H.H. Kwok T. The perks of doing housework: Longitudinal associations with survival and underlying mechanisms BMC Geriatrics 23 1 2023 355 10.1186/s12877-023-04039-1 37280557 PMC10242587 Conger R.D. Ge X. Elder G.H. Lorenz F.O. Simons R.L. Economic stress, coercive family process, and developmental problems of adolescents Child Development 65 2 1994 541 10.2307/1131401 8013239 Cutler D.M. Lleras-Muney A. Education and health: Evaluating theories and Evidence 2006 National Bureau of Economic Research 10.3386/w12352 De Neve J.-W. Harling G. Offspring schooling associated with increased parental survival in rural KwaZulu-Natal, South Africa Social Science & Medicine 176 2017 149 157 10.1016/j.socscimed.2017.01.015 28153751 PMC5322823 Deng X. Liang L. Wu F. Wang Z. He S. A review of the balance of regional development in China from the perspective of development geography Journal of Geographical Sciences 32 1 2022 3 22 10.1007/s11442-021-1930-0 Dethier J.-J. Social security: What can developing countries learn from developed countries? Braun J.V. Hill R.E. Lorch R.P. The poorest and hungry: Assessments, analyses, and actions 2009 International Food Policy Research Institute 287 298 https://www.oda-alc.org/documentos/1341450042.pdf Elder G.H. Johnson M.K. Crosnoe R. The emergence and development of life course theory Mortimer J.T. Shanahan M.J. Handbook of the life course 2003 Springer US 3 19 10.1007/978-0-306-48247-2_1 Ellwardt L. Van Tilburg T.G. Aartsen M.J. The mix matters: Complex personal networks relate to higher cognitive functioning in old age Social Science & Medicine 125 2015 107 115 10.1016/j.socscimed.2014.05.007 24840784 Emsley R. Liu H. Stata module to perform causal mediation analysis using parametric regression models 2013 Statistical Software Components https://ideas.repec.org/c/boc/bocode/s457581.html Fang H. Liu C. Zhou L.-A. Window dressing in the public sector: Evidence from China's compulsory education promotion program Journal of Public Economics 222 2023 104878 10.1016/j.jpubeco.2023.104878 Ferrucci L. Guralnik J.M. Cecchi F. Marchionni N. Salani B. Kasper J. Celli R. Giardini S. Heikkinen E. Jylha M. Baroni A. Constant hierarchic patterns of physical functioning across seven populations in five countries The Gerontologist 38 3 1998 286 294 10.1093/geront/38.3.286 9640848 Friedman E.M. Mare R.D. The schooling of offspring and the survival of parents Demography 51 4 2014 1271 1293 10.1007/s13524-014-0303-z 24917296 Furstenberg F.F. Family change in global perspective: How and why family systems change Family Relations 68 3 2019 326 341 10.1111/fare.12361 34305222 PMC8298013 Giles J. Wang D. Zhao C. Can China's rural elderly count on support from adult children? Implications of rural-to-urban migration Journal of Population Ageing 3 3–4 2010 183 204 10.1007/s12062-011-9036-6 Goldman A.W. Cornwell B. Social disadvantage and instability in older adults' ties to their adult children Journal of Marriage and Family 80 5 2018 1314 1332 10.1111/jomf.12503 30524144 PMC6276798 Gutierrez S. Courtin E. Glymour M.M. Torres J.M. Does schooling attained by adult children affect parents' psychosocial well-being in later life? Using Mexico's 1993 compulsory schooling law as a quasi-experiment SSM - Population Health 25 2024 101616 10.1016/j.ssmph.2024.101616 PMC10905038 38434444 Hämäläinen H. Tanskanen A.O. ‘Sandwich generation’: Generational transfers towards adult children and elderly parents Journal of Family Studies 27 3 2021 336 355 10.1080/13229400.2019.1586562 Huo M. Graham J.L. Kim K. Birditt K.S. Fingerman K.L. Aging parents' daily support exchanges with adult children suffering problems The Journals of Gerontology: Series B 74 3 2019 449 459 10.1093/geronb/gbx079 PMC6377028 28633505 Hvidtfeldt U.A. Lange T. Andersen I. Diderichsen F. Keiding N. Prescott E. Sørensen T.I.A. Tjønneland A. Rod N.H. Educational differences in postmenopausal breast cancer–quantifying indirect effects through health behaviors, body mass index and reproductive patterns PLoS One 8 10 2013 e78690 10.1371/journal.pone.0078690 PMC3812044 24205296 International Labour Organization World social protection report 2020-22: Social protection at the crossroads—In pursuit of a better future 2021 International Labour Office Ishimaru S. Empirical decomposition of the IV-OLS gap with heterogeneous and nonlinear effects The Review of Economics and Statistics 106 2 2024 505 520 10.1162/rest_a_01169 Jiang N. Adult children's education and later-life health of parents in China: The intergenerational effects of human capital investment Social Indicators Research 145 1 2019 257 278 10.1007/s11205-019-02109-9 Jiang C. Li J. Liu J. Does urbanization affect the gap between urban and rural areas? Evidence from China Socio-Economic Planning Sciences 82 2022 101271 Kemptner D. Jürges H. Reinhold S. Changes in compulsory schooling and the causal effect of education on health: Evidence from Germany Journal of Health Economics 30 2 2011 340 354 10.1016/j.jhealeco.2011.01.004 21306780 Kenneth Keng C.W. China's unbalanced economic growth Journal of Contemporary China 15 46 2006 183 214 10.1080/10670560500394342 Kim E.S. VanderWeele T.J. Mediators of the association between religious service attendance and mortality American Journal of Epidemiology 188 1 2019 96 101 10.1093/aje/kwy211 30265277 PMC6321798 Langenberger B. Siegel M. Busse R. Vogt V. Health economic evaluation of a medication safety intervention in elderly care: Identifying causal effects in a multi-center quasi-experimental study design BMC Health Services Research 25 1 2025 773 10.1186/s12913-025-12898-0 40448133 PMC12124031 Lauderdale D.S. Education and survival: Birth cohort, period, and age effects Demography 38 4 2001 551 561 10.1353/dem.2001.0035 11723951 Lawton M.P. Brody E.M. Assessment of older people: Self-maintaining and instrumental activities of daily living The Gerontologist 9 3 Part 1 1969 179 186 10.1093/geront/9.3_Part_1.179 5349366 Lee Y. Adult children's educational attainment and the cognitive trajectories of older parents in South Korea Social Science & Medicine 209 2018 76 85 10.1016/j.socscimed.2018.05.026 29803071 Lei L. Yu D. Zhou Y. Better educated children, better internet-connected elderly parents Research Policy 52 4 2023 104743 10.1016/j.respol.2023.104743 Leung J.C. Social security reforms in China: Issues and prospects International Journal of Social Welfare 12 2 2003 73 85 Li D. Xiao H. Ma S. Zhang J. Health benefits of air quality improvement: Empirical research based on medical insurance reimbursement data Frontiers in Public Health 10 2022 855457 10.3389/fpubh.2022.855457 PMC8927649 35309228 Li J. Zhou X. Internet use and Chinese older adults' subjective well-being (SWB): The role of parent-child contact and relationship Computers in Human Behavior 119 2021 106725 10.1016/j.chb.2021.106725 Liu Z. Children's education and parental health: Evidence from China American Journal of Health Economics 7 1 2021 95 130 10.1086/711704 Liu Y. Ma Y. Smith J.P. Adult children's education and older parents' chronic illnesses in aging China Demography 59 2 2022 535 562 10.1215/00703370-9766973 35179200 Liu S.-Y. Wu P.-C. Huang T.-Y. Nonlinear causality between education and health: The role of human development index Applied Research in Quality of Life 13 3 2018 761 777 10.1007/s11482-017-9557-0 Liu X. Xu J. Song B. Dynamics and causes of China's regional development inequality: From the perspective of east-west and north-south inequality Review of Industrial Economics 2 2022 152 167 Liu P. Zhou L. Tian Y. Nie W. Association between household debt and depressive mood among Chinese residents Public Health 194 2021 202 207 10.1016/j.puhe.2021.03.015 33962097 Lundborg P. Majlesi K. Intergenerational transmission of human capital: Is it a one-way street? Journal of Health Economics 57 2018 206 220 10.1016/j.jhealeco.2017.12.001 29289810 Lynch S.M. Cohort and life-course patterns in the relationship between education and health: A hierarchical approach Demography 40 2 2003 309 331 10.1353/dem.2003.0016 12846134 Ma M. Does children's education matter for parents' health and cognition? Evidence from China Journal of Health Economics 66 2019 222 240 10.1016/j.jhealeco.2019.06.004 31265950 Ma S. Wen F. Who coresides with parents? An analysis based on sibling comparative advantage Demography 53 3 2016 623 647 10.1007/s13524-016-0468-8 27089881 Marmot M. Allen J. Bell R. Bloomer E. Goldblatt P. WHO European review of social determinants of health and the health divide The Lancet 380 9846 2012 1011 1029 10.1016/S0140-6736(12)61228-8 22964159 Meng S. Pan F. Wu F. Intergenerational financial support for homeownership and co-residence in Chinese cities Cities 137 2023 104310 10.1016/j.cities.2023.104310 Ming C.K. China's recent education reform: The beginning of an overhaul Comparative Education 22 3 1986 255 269 10.1080/0305006860220306 National Bureau of Statistics of China China statistical yearbook 2016 2017 Chinese Statistics Press http://www.stats.gov.cn/tjsj/ndsj/2017/indexch.htm National Bureau of Statistics of China China statistical yearbook 2019 2019 China Statistics Press https://www.stats.gov.cn/sj/ndsj/2019/indexch.htm Noble N. Paul C. Turon H. Oldmeadow C. Which modifiable health risk behaviours are related? A systematic review of the clustering of smoking, nutrition, alcohol and physical activity (‘SNAP’) health risk factors Preventive Medicine 81 2015 16 41 10.1016/j.ypmed.2015.07.003 26190368 Ohrnberger J. Fichera E. Sutton M. The relationship between physical and mental health: A mediation analysis Social Science & Medicine 195 2017 42 49 10.1016/j.socscimed.2017.11.008 29132081 Oreopoulos P. Salvanes K.G. Priceless: The nonpecuniary benefits of schooling The Journal of Economic Perspectives 25 1 2011 159 184 10.1257/jep.25.1.159 Oster E. Unobservable selection and coefficient stability: Theory and evidence Journal of Business & Economic Statistics 37 2 2019 187 204 10.1080/07350015.2016.1227711 Pai M. Lu W. Xue B. Adult children's education and trajectories of episodic memory among older parents in the United States of America Ageing and Society 2021 1 27 10.1017/S0144686X21000775 Papp-Zipernovszky O. Horváth M.D. Schulz P.J. Csabai M. Generation gaps in digital health literacy and their impact on health information seeking behavior and health empowerment in Hungary Frontiers in Public Health 9 2021 https://www.frontiersin.org/articles/10.3389/fpubh.2021.635943 10.3389/fpubh.2021.635943 PMC8158579 34055714 Pei Y. Cong Z. Children's education and their financial transfers to ageing parents in rural China: Mothers and fathers' strategic advantages in enforcing reciprocity Ageing and Society 40 4 2020 896 920 10.1017/S0144686X18001496 Potente C. Präg P. Monden C.W.S. Does children's education improve parental health and longevity? Causal evidence from Great Britain Journal of Health and Social Behavior 64 1 2023 21 38 10.1177/00221465221143089 36705015 PMC10009472 Roodman D. Fitting fully observed recursive mixed-process models with cmp STATA Journal 11 2 2011 159 206 10.1177/1536867X1101100202 Sabater A. Graham E. Marshall A. Does having highly educated adult children reduce mortality risks for parents with low educational attainment in Europe? Ageing and Society 40 12 2020 2635 2670 10.1017/S0144686X19000795 Seol J. Park I. Kokudo C. Zhang S. Suzuki C. Yajima K. Satoh M. Tokuyama K. Okura T. Distinct effects of low-intensity physical activity in the evening on sleep quality in older women: A comparison of exercise and housework Experimental Gerontology 143 2021 111165 10.1016/j.exger.2020.111165 33232794 Silverstein M. Bengtson V.L. Does intergenerational social support influence the psychological well-being of older parents? The contingencies of declining health and widowhood Social Science & Medicine 38 7 1994 943 957 10.1016/0277-9536(94)90427-8 8202743 Silverstein M. Gans D. Yang F.M. Intergenerational support to aging parents: The role of norms and needs Journal of Family Issues 27 8 2006 1068 1084 10.1177/0192513X06288120 Solomon-Moore E. Sebire S.J. Thompson J.L. Zahra J. Lawlor D.A. Jago R. Are parents' motivations to exercise and intention to engage in regular family-based activity associated with both adult and child physical activity? BMJ Open Sport — Exercise Medicine 2 1 2017 e000137 10.1136/bmjsem-2016-000137 PMC5569264 28879025 Song L. Li S. Feldman M.W. Out-migration of young adults and gender division of intergenerational support in rural China Research on Aging 34 4 2012 399 424 10.1177/0164027511436321 29353946 PMC5772779 Steptoe A. Wardle J. Pollard T.M. Canaan L. Davies G.J. Stress, social support and health-related behavior: A study of smoking, alcohol consumption and physical exercise Journal of Psychosomatic Research 41 2 1996 171 180 10.1016/0022-3999(96)00095-5 8887830 Sun M. Nine year compulsory education policy in China: Development of the nine-year compulsory education policy International Journal of Curriculum Development and Learning Measurement 3 1 2022 1 11 10.4018/IJCDLM.315580 Takele M.D. Eriku G.A. Merawie D.M. Zinabu F.S. Fentanew M. Belay G.J. Kibret A.K. Functional disability and its associated factors among community- dweller older adults living in Gondar Town, Ethiopia: A community-based cross-sectional study BMC Public Health 24 1 2024 647 10.1186/s12889-024-18110-y 38424543 PMC10905928 Teerawichitchainan B. Pothisiri W. Long G.T. How do living arrangements and intergenerational support matter for psychological health of elderly parents? Evidence from Myanmar, Vietnam, and Thailand Social Science & Medicine 136–137 2015 106 116 10.1016/j.socscimed.2015.05.019 25993521 Thoma B. Sudharsanan N. Karlsson O. Joe W. Subramanian S.V. De Neve J.-W. Children's education and parental old-age health: Evidence from a population-based, nationally representative study in India Population Studies 75 1 2021 51 66 10.1080/00324728.2020.1775873 32672098 Torres J.M. Yang Y. Rudolph K.E. Courtin E. Increased adult child schooling and older parents' health behaviors in Europe: A quasi-experimental study SSM - Population Health 19 2022 101162 10.1016/j.ssmph.2022.101162 PMC9287559 35855968 Umberson D. Relationships between adult children and their parents: Psychological consequences for both generations Journal of Marriage and Family 54 3 1992 664 674 10.2307/353252 Valeri L. VanderWeele T.J. Mediation analysis allowing for exposure–mediator interactions and causal interpretation: Theoretical assumptions and implementation with SAS and SPSS macros Psychological Methods 18 2 2013 137 150 10.1037/a0031034 23379553 PMC3659198 Wainwright E. Marandet E. Parents in higher education: Impacts of university learning on the self and the family Educational Review 62 4 2010 449 465 10.1080/00131911.2010.487643 Wang F.Y. Causal inference between the health status and living arrangements of elderly people in China Social Indicators Research 159 3 2022 1155 1178 10.1007/s11205-021-02792-7 Wang Y. Can adult children's education prevent parental health decline in the short term and long term? Evidence from rural China Journal of Biosocial Science 56 1 2024 155 181 10.1017/S0021932023000111 37309644 World Health Organization International classification of impairments, disabilities, and handicaps: A manual of classification relating to the consequences of disease Published in accordance with resolution WHA29. 35 of the Twenty-ninth World Health Assembly, May 1976 1980 Xu H. Liu J. Zhang Z. Li L. Sandwiched grandparents and biological health risks in China Journal of Health and Social Behavior 63 3 2022 410 427 10.1177/00221465211069895 35012397 Yahirun J.J. Sheehan C.M. Hayward M.D. Adult children's education and parents' functional limitations in Mexico Research on Aging 38 3 2016 322 345 10.1177/0164027515620240 26966254 PMC4880485 Yahirun J.J. Sheehan C.M. Hayward M.D. Adult children's education and changes to parents' physical health in Mexico Social Science & Medicine 181 2017 93 101 10.1016/j.socscimed.2017.03.034 28384483 PMC5600815 Yang J. Gao M. The impact of education expansion on wage inequality Applied Economics 50 12 2018 1309 1323 10.1080/00036846.2017.1361008 Yip W. Fu H. Chen A.T. Zhai T. Jian W. Xu R. Pan J. Hu M. Zhou Z. Chen Q. Mao W. Sun Q. Chen W. 10 years of health-care reform in China: Progress and gaps in Universal Health coverage The Lancet 394 10204 2019 1192 1204 10.1016/S0140-6736(19)32136-1 31571602 Yuan W. Gong S. Han Y. How does rising housing price affect the health of middle-aged and elderly people? The complementary mediators of social status seeking and competitive saving motive PLoS One 15 12 2020 e0243982 10.1371/journal.pone.0243982 PMC7737984 33320920 Yuan S. Yao H. Larsson S.C. Associations of cigarette smoking with psychiatric disorders: Evidence from a two-sample Mendelian randomization study Scientific Reports 10 1 2020 10.1038/s41598-020-70458-4 PMC7427799 32796876 Zahodne L.B. Ajrouch K.J. Sharifian N. Antonucci T.C. Social relations and age-related change in memory Psychology and Aging 34 6 2019 751 765 10.1037/pag0000369 31180697 PMC6710103 Zhang X. Krishnakumar A. Narine L. Family economic hardship and child outcomes: Test of family stress model in the Chinese context Journal of Family Psychology 34 8 2020 960 968 10.1037/fam0000670 32406732 Zhao L. Sun Y. Cao R. Wu X. Huang T. Peng W. Non-linear association between composite dietary antioxidant index and depression Frontiers in Public Health 10 2022 10.3389/fpubh.2022.988727 PMC9609418 36311643 Zhao J. Zhang Y. Han M. Equity and efficiency of social security systems in China and Europe: An empirical comparison based on key indicators Social Security Studies 1 2025 63 76 (in Chinese) Zhou T. Li R. Shi Y. Tian G. Yan Y. The associations between sleep duration, cognitive function, and depressive symptoms: An analysis of Chinese adolescents from China family panel studies Journal of Affective Disorders 319 2022 252 259 10.1016/j.jad.2022.09.051 36155231 Zimmer Z. Health and living arrangement transitions among China's oldest-old Yi Z. Poston D.L. Vlosky D.A. Gu D. Healthy longevity in China: Demographic, socioeconomic, and psychological dimensions 2008 Springer Netherlands 215 234 10.1007/978-1-4020-6752-5_13 Zimmer Z. Martin L.G. Ofstedal M.B. Chuang Y.-L. Education of adult children and mortality of their elderly parents in Taiwan Demography 44 2 2007 289 305 10.1353/dem.2007.0020 17583306 Appendix A Supplementary data The following is the Supplementary data to this article: Multimedia component 1 Multimedia component 1 Data availability Data can be obtained by applying on the CFPS official website. Acknowledgements The authors thank Dr Yiru Wang and Dr Zeyuan Chen for their helpful comments on this manuscript, and Yifan Pan for the support in language refinement. We thank the CFPS team for sharing the survey data. A University-Coordinated Pre-Research Project (No. 021210005003020007 Southwestern University of Finance and Economics Appendix A Supplementary data to this article can be found online at https://doi.org/10.1016/j.ssmph.2025.101853 ",
  "metadata": {
    "Title of this paper": "Education of adult children and mortality of their elderly parents in Taiwan",
    "Journal it was published in:": "SSM - Population Health",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486174/"
  }
}