{
  "title": "Paper_590",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12480079 PMC12480079.1 12480079 12480079 41022981 10.1038/s41598-025-16124-z 16124 1 Article MIEN1 Ranade Payal 1 Trivedi Rucha 1 Sierra-Díaz Diana Carolina 2 Laissue Paul 3 Vishwanatha Jamboor K. jamboor.vishwanatha@unthsc.edu 1 1 https://ror.org/05msxaq47 grid.266871.c 0000 0000 9765 6057 Department of Microbiology, Immunology and Genetics, University of North Texas Health Science Center, 2 https://ror.org/0108mwc04 grid.412191.e 0000 0001 2205 5940 Center for Research in Genetics and Genomics (CIGGUR), Institute of Translational Medicine (IMT), School of Medicine and Health Sciences, Universidad del Rosario, 3 29 9 2025 2025 15 478255 33353 4 4 2025 13 8 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Colorectal cancer (CRC) is a leading cause of cancer-associated mortality worldwide. Although early-stage CRC is responsive to surgical resection, advanced metastatic disease poses formidable treatment obstacles, triggering an alarming decline in the survival rates of patients. Hence, studying the mechanisms underlying CRC progression and identifying novel therapeutic targets are critical for early diagnosis and treatment. The migration and invasion enhancer 1 (MIEN1) protein plays a pivotal role in tumor invasion and migration across various cancer types. In CRC, the predominant upregulation of MIEN1 in cancerous tissues is closely associated with invasive behavior; however, the precise mechanism driving the metastasis remains unexplored. In this study, we investigate the role of MIEN1 in CRC by generating a CRISPR-Cas9 mediated promoter knockout in HT29 CRC cell-line. The effects of MIEN Subject terms Colorectal cancer Cancer https://doi.org/10.13039/501100008793 Universidad del Rosario CS/ABN062/GENIUROS 018-019 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Colorectal cancer (CRC) is the third most common cancer diagnosed globally and is one of the leading causes of cancer-associated mortality. Its progression is classified into four stages, with stages 3 and 4 being marked by an increased rate of malignancy 1 2 Metastasis begins with the migration and invasion of cancer cells from the original tumor site to a distant organ. This process involves complex interactions between the signaling pathways and various proteins. Migration and invasion enhancer 1 (MIEN1) is an important protein involved in this process. Previously the protein was referred to by other names, such as C17orf37 and C35. The gene for this protein is located on chromosome 17q12 positioned between ERBB2 GRB7 MIEN1 3 5 6 In this study, we elucidated the role of MIEN1 in CRC by employing promoter knockout studies to harness its potential for therapeutic intervention. Using the highly tumorigenic HT29-human colorectal carcinoma cell line, we generated a stable MIEN1 Results CRISPR-Cas9–mediated MIEN1 ERBB2 MIEN1 GRB7 ERBB2 ERBB2/HER2 1 7 5 8 ERBB2 Fig. 1 MIEN1 A MIEN 1 B MIEN1 C MIEN1 GAPDH D MIEN1 E p Deletion of the minimal promoter region of 856 base pairs (bp) upstream of the ATG start codon (+ 1 position) (Fig. S1) for MIEN1 1 MIEN1 Reverse transcriptase polymerase chain reaction (RT-PCR) in both HT29 cell variants, showed minimal MIEN1 GAPDH 1 1 To verify whether MIEN1 1 1 ERBB2 GRB7 1 Collectively, these results confirmed the establishment of a stable MIEN1 ERBB2 GRB7 MIEN1 To understand the alterations in gene expression patterns following the knockout of MIEN1 2 P 2 Fig. 2 HT29 mRNA sequencing and enrichment analysis. ( A B MIEN1 MIEN1 C D MIEN1 P E Using ingenuity pathway analysis (IPA; Qiagen), we identified the key pathways and biological processes affected by MIEN1 2 IPA also highlighted a range of biological processes affected by MIEN 2 2 MIEN1 Overall, IPA analysis emphasized that the knockout of MIEN1 MIEN1 Gene ontology enrichment analysis indicated that MIEN1 3 4 3 3 3 3 Fig. 3 Effect of MIEN1 A C B D E F When examining the phalloidin staining pattern along the cell edges, we observed that phalloidin intensity increased exponentially, maintaining a steady level within a specific distance range. This indicated increased intensity, specifically in the lamellipodium region, tapering off on either side of the WT cells (Figs. 3 3 Phosphorylation of essential actin cytoskeleton proteins FAK and cofilin is altered owing to the absence of MIEN1 To validate actin cytoskeleton impairment in HT29 KO cells, we examined the key actin cytoskeleton proteins—FAK and cofilin, specifically their phosphorylated forms, pFAK-Y397 and pCofilin-S3 by immunofluorescent staining and immunoblotting. In WT cells, pFAK-Y397 was localized to the cellular edges where lamellipodium ruffles were evident, whereas in HT29 KO cells, pFAK was present within the stress fibers in the cell body (Fig. 4 MIEN1 MIEN1 4 MIEN1 MIEN1 4 Fig. 4 MIEN1 A B C D E F p p p Cofilin, an actin-depolymerizing protein, is inactivated upon phosphorylation at the serine residue in the third position. Staining for pCofilin-S3 showed a higher intensity in HT29 KO cells than in WT cells (Fig. 4 4 4 Collectively, our data provides evidence of impaired actin cytoskeleton dynamics, which are critical for cell motility machinery (lamellipodia and filopodia), in the absence of MIEN1 protein. These results emphasize the importance of MIEN1 in CRC cell migration. MIEN1 We performed various functional assays to validate the observed changes in the actin cytoskeleton. Cell–cell adhesion was evaluated using the hanging-drop experiment. HT29 KO cells formed single spheroids within 24 h of incubation. In contrast, HT29 WT cells required more than 72 h to form a single spheroid, along with multiple smaller cell aggregates. By day 4, HT29 KO cells formed elliptical spheroids with a distinct border and a denser core, whereas HT29 WT cells struggled to create a singular spheroid with clear boundaries (Fig. 5 MIEN1 Fig. 5 Migratory and invasive potential of HT29 cells is reduced upon MIEN1 A B C p p p p To further investigate the effect of MIEN1 5 We also examined the impact of MIEN 5 Collectively, these findings suggest that MIEN1 knockout increases cell–cell adhesion, severely limiting the migration and invasion capabilities of HT29 cells. Discussion MIEN1 5 MIEN1 4 5 MIEN1 Previous studies have emphasized the significance of the MIEN1 7 MIEN 8 MIEN1 MIEN1 ERBB2 GRB7 . MIEN1 MIEN1 ERBB2 9 MIEN1 MIEN1 Subsequent transcriptomic analysis revealed significant alterations in the gene expression patterns following MIEN MIEN1 MIEN1 Rearrangement of the actin cytoskeleton is closely associated with cancer cell migration and invasion. A previous study by Dasgupta et al . 4 . MIEN1 3 MIEN1 3 4 4 10 11 12 MIEN1 MIEN1 13 MIEN1 In conclusion, our findings highlight the crucial role of MIEN1 in regulating the migration and invasion potential of CRC cells by influencing actin cytoskeleton dynamics. Further investigation of the compensatory signaling pathways, and validating the functional role of MIEN1 in vivo would enhance our understanding of CRC metastasis and facilitate the development of novel treatment strategies for CRC. Materials and methods Cell culture HT29 cells were obtained from the ATCC (Manassas, VA, USA) (Cat. no. HTB-38). The cells were maintained at 37 °C in a 5% CO 2 CRISPR-Cas9 MIEN1 HT29 WT cells were cultured and electroporated with a DNA mixture of plasmids expressing C1486_MIEN1_5′gRNA- 1, C1486_MIEN1_3′gRNA-1, and the cas9 RT-PCR Total RNA was extracted using the TRIzol reagent (Invitrogen, Carlsbad, CA, USA). Superscript-III First Strand Synthesis kit (Invitrogen) was used for complementary DNA (cDNA) synthesis using 1 µg of total RNA, following the manufacturer’s protocol. PCR was performed to amplify the cDNA using Taq DNA polymerase and specific primers for the target genes. The PCR cycling conditions were as follows: 95 °C for 15 min, followed by 32 cycles at 95 °C for 30 s, annealing at 54 °C for 1 min, extension at 72 °C for 45 s, and held at 4 °C. PCR products were analyzed by agarose gel electrophoresis on a 1.2% agarose gel stained with ethidium bromide. Gel images were captured using a gel documentation system. Antibodies and reagents The rabbit anti- p-cofilin Ser 3 (cat #3311, 1:1000), rabbit anti-cofilin (cat #5175, 1:1000), rabbit anti-HER2/ErbB2 (29D8) (cat #2165, 1:1000), were procured from Cell Signaling Technologies (Danvers, MA, USA). Purchased from Invitrogen (Waltham, MA, USA) were the rabbit anti-p-FAK (cat # 700255, 1:1000), were the rabbit anti-FAK (cat # AH00502, 1:1000). Abclonal (Woburn, MA, USA) provided rabbit anti-GRB7 (cat # A5690, 1:1000). Mouse anti-MIEN1 (cat #H00084299-M02, 1:5000) was from Abnova. Rabbit anti-HSC70 ( cat # ADI-SPA-816, 1:1000) was provided by Enzo Life Sciences (Farmingdale, NY, USA). Invitrogen (Waltham, MA, USA) provided the Alexa Fluor anti Rabbit 488 antibody (cat # A11034, 1:1000), Phalloidin 594 (cat # A12381, 1:1000), and DAPI (cat # 62248, 1:1000). Immunoblotting analysis Proteins were extracted from cells using a radioimmunoprecipitation assay buffer (Thermo Scientific) supplemented with protease inhibitors (Millipore Sigma) and phosphatase inhibitors (Millipore Sigma), and then quantified using the BCA Protein Assay Kit (Thermo Scientific). Equal amounts of protein were loaded onto 4–12% precast SDS-PAGE gels (Invitrogen), and the samples were electrotransferred to a nitrocellulose membrane (Invitrogen) at a constant voltage of 25 V. The blots were then blocked with 5% bovine serum albumin (Thermo Scientific) and incubated with the respective primary antibodies at 4 °C for 8–10 h, followed by incubation with the respective secondary antibodies tagged with horseradish peroxidase. Protein bands were visualized using the Alpha Innotech Chemiluminescent Detection System and the iBright CL1500 Imaging System (Thermo Scientific). RNA sequencing Library construction and sequencing RNA sequencing libraries were prepared using the Illumina Stranded mRNA Library Prep kits (Cat. no. 20040534), following the manufacturer’s instructions. Briefly, 1 µg of total RNA was used as the starting material. Poly(A)-tailed RNA was purified using poly(T) oligo beads included in the kit. The resulting RNA samples were then fragmented and converted into double-stranded DNA for sequencing. Individual libraries were uniquely indexed using Illumina RNA UD Indexes (Cat. no. 20040555) and pooled at an equimolar ratio. The pooled libraries were sequenced on an Illumina NextSeq 550 sequencing system to obtain 75-bp paired-end reads. Raw sequence reads were deposited in the Sequence Read Archive with the reference ID PRJNA1218296 in GenBank. RNA sequencing was performed using the Genomics Core at the UNT Health Science Center. Read mapping and gene expression analysis The quality of the raw FASTQ files was evaluated using the Galaxy web-based platform. Subsequently, adaptor trimming was performed using Trim Galore software. The trimmed files were merged into one file for R1 and R2 using text manipulation by concatenating the datasets from tail to head. The merged FASTQ files were then aligned to the human genome build GRCh38-Ensembl using HiSat2. Mapped BAM files were run using feature counts to obtain gene counts, which were then run using DEseq2 to identify differentially expressed genes. Gene ontology and gene set enrichment analysis Gene ontology analysis was performed using QIAGEN’s IPA software with features such as network analysis, upstream regulator analysis, pathway analysis, and canonical pathway analysis, with a P-value cut-off set to 0.05. Wound-healing assay 3 × 10 5 2 2 https://imagej.net/ij/ Transwell invasion assay Boyden chambers with a transwell membrane of 8-μm pore size (Corning, NY, USA) were seeded with 3 × 10 5 2 Hanging-drop assay A total of 2 × 10 5 Immunofluorescence staining The cells were seeded on 22-mm coverslips, fixed in 4% paraformaldehyde (Thermo Scientific) for 15 min at room temperature, and permeabilized with 0.1% Triton X-100 (Sigma) for 15 min at room temperature. Blocking was performed using 5% goat serum (Invitrogen) for 1 h at room temperature, followed by overnight incubation at 4 °C with the respective primary antibodies. After primary incubation, the cells were rinsed three times with 1 × PBS containing Tween 20 and subsequently incubated with the respective secondary antibodies for 1 h at room temperature. Next, the cells were incubated with 4’,6-diamidino-2-phenylindole for 10 min at room temperature, followed by mounting on slides using a mounting medium (Invitrogen). Images were acquired using an Inverted Zeiss LSM 880 Airyscan confocal microscope. Statistical analysis The statistical analysis of all the data was done with GraphPad Prism 10 (La Jolla, CA, USA). Every experimental result was obtained from a minimum of three separate experiments. One-way ANOVA or t-tests, as required for the experiment, were used to evaluate statistical significance. A statistically significant result was defined with reference to P Supplementary Information  Supplementary Information. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Supplementary Information The online version contains supplementary material available at 10.1038/s41598-025-16124-z. Acknowledgements We acknowledge the UNTHSC Genomics and Microscopy Core for their support with RNA sequencing and immunofluorescence imaging. We extend our appreciation to Dr. T. Kwon at the UNTHSC Genomics Core for his assistance with RNA sequencing, and to Mr. Kishor Kunwar at the HSC Microscopy Core for his training and support with immunofluorescence imaging. We sincerely thank Dr. Amit Kumar Tripathi for his scientific advice. Author contributions P.R. designed the study, performed the experiments and data analysis, and wrote the manuscript. D.C.S.D and P.L.  generated the knockout cell line. R.T.   assisted in experiments and contributed to the manuscript writing. J.K.V. conceptualized and supervised the study and acquired funding. All authors have edited and revised the manuscript and approved the final version. Funding This work was supported by awards from the National Institute of Health under awards R01CA220273, U54MD006882 and S21MD012472 and from the Cancer Prevention and Tesesrch Institute of Texas award number RP210046 to Dr. Jamboor K. Vishwanatha. The MIEN1 knockout cells were generated through an award from Universidad del Rosario (Grant: CS/ABN062/GENIUROS 018–019). Data availability The datasets generated and/or analyzed during the current study are available in the Sequence Read Archive (SRA) data repository, under accession number PRJNA1218296. Further inquiries can be forwarded to the corresponding author. Declarations Competing interests The authors declare no competing interests. References 1. Amin MB Greene FL Edge SB Compton CC Gershenwald JE Brookland RK The eighth edition ajcc cancer staging manual: Continuing to build a bridge from a population-based to a more “personalized” approach to cancer staging CA Cancer J. Clin. 2017 67 93 99 28094848 10.3322/caac.21388 Amin, M. B. et al. The eighth edition ajcc cancer staging manual: Continuing to build a bridge from a population-based to a more “personalized” approach to cancer staging. CA Cancer J. Clin. 67 28094848 10.3322/caac.21388 2. Cappell MS Pathophysiology, clinical presentation, and management of colon cancer Gastroenterol. Clin. North Am. 2008 37 1 24 10.1016/j.gtc.2007.12.002 18313537 Cappell, M. S. Pathophysiology, clinical presentation, and management of colon cancer. Gastroenterol. Clin. North Am. 37 18313537 10.1016/j.gtc.2007.12.002 3. Kpetemey M Chaudhary P Van Treuren T Vishwanatha JK MIEN1 drives breast tumor cell migration by regulating cytoskeletal-focal adhesion dynamics Oncotarget 2016 7 54913 54924 10.18632/oncotarget.10798 27462783 PMC5342390 Kpetemey, M., Chaudhary, P., Van Treuren, T. & Vishwanatha, J. K. MIEN1 drives breast tumor cell migration by regulating cytoskeletal-focal adhesion dynamics. Oncotarget 7 27462783 10.18632/oncotarget.10798 PMC5342390 4. Dasgupta S Cushman I Kpetemey M Casey PJ Vishwanatha JK Prenylated C17orf37 induces filopodia formation to promote cell migration and metastasis J. Biol Chem. 2011 286 25935 25946 10.1074/jbc.M111.254599 21628459 PMC3138290 Dasgupta, S., Cushman, I., Kpetemey, M., Casey, P. J. & Vishwanatha, J. K. Prenylated C17orf37 induces filopodia formation to promote cell migration and metastasis. J. Biol Chem. 286 21628459 10.1074/jbc.M111.254599 PMC3138290 5. Dasgupta S Wasson LM Rauniyar N Prokai L Borejdo J Vishwanatha JK Novel gene C17orf37 in 17q12 amplicon promotes migration and invasion of prostate cancer cells Oncogene 2009 28 2860 2872 10.1038/onc.2009.145 19503095 PMC2726905 Dasgupta, S. et al. Novel gene C17orf37 in 17q12 amplicon promotes migration and invasion of prostate cancer cells. Oncogene 28 19503095 10.1038/onc.2009.145 PMC2726905 6. Dong X Huang Y Kong L Li J Kou J Yin L C35 is overexpressed in colorectal cancer and is associated tumor invasion and metastasis Biosci Trends. 2015 9 117 121 10.5582/bst.2015.01057 26173296 Dong, X. et al. C35 is overexpressed in colorectal cancer and is associated tumor invasion and metastasis. Biosci Trends. 9 26173296 10.5582/bst.2015.01057 7. Evans EE Henn AD Jonason A Paris MJ Schiffhauer LM Borrello MA C35 (C17orf37) is a novel tumor biomarker abundantly expressed in breast cancer Mol. Cancer Ther. 2006 5 2919 2930 10.1158/1535-7163.MCT-06-0389 17121940 Evans, E. E. et al. C35 (C17orf37) is a novel tumor biomarker abundantly expressed in breast cancer. Mol. Cancer Ther. 5 17121940 10.1158/1535-7163.MCT-06-0389 8. Rajendiran S Gibbs LD Van Treuren T Klinkebiel DL Vishwanatha JK MIEN1 is tightly regulated by SINE Alu methylation in its promoter Oncotarget 2016 7 65307 65319 10.18632/oncotarget.11675 27589566 PMC5323157 Rajendiran, S., Gibbs, L. D., Van Treuren, T., Klinkebiel, D. L. & Vishwanatha, J. K. MIEN1 is tightly regulated by SINE Alu methylation in its promoter. Oncotarget 7 27589566 10.18632/oncotarget.11675 PMC5323157 9. Van Treuren T Vishwanatha JK CRISPR deletion of MIEN1 in breast cancer cells PLoS ONE 2018 13 e0204976 10.1371/journal.pone.0204976 30286132 PMC6171864 Van Treuren, T. & Vishwanatha, J. K. CRISPR deletion of MIEN1 in breast cancer cells. PLoS ONE 13 30286132 10.1371/journal.pone.0204976 PMC6171864 10. Sylow L Tyrosine 397 phosphorylation is critical for FAK-promoted Rac1 activation and invasive properties in oral squamous cell carcinoma cells Lab Invest. 2016 96 1026 10.1038/labinvest.2016.58 27562306 Sylow, L. Tyrosine 397 phosphorylation is critical for FAK-promoted Rac1 activation and invasive properties in oral squamous cell carcinoma cells. Lab Invest. 96 27562306 10.1038/labinvest.2016.58 11. Schober M Raghavan S Nikolova M Polak L Pasolli HA Beggs HE Focal adhesion kinase modulates tension signaling to control actin and focal adhesion dynamics J Cell Biol. 2007 176 667 680 10.1083/jcb.200608010 17325207 PMC2064024 Schober, M. et al. Focal adhesion kinase modulates tension signaling to control actin and focal adhesion dynamics. J Cell Biol. 176 17325207 10.1083/jcb.200608010 PMC2064024 12. Magalhaes YT Boell VK Cardella GD Forti FL Downregulation of the Rho GTPase pathway abrogates resistance to ionizing radiation in wild-type p53 glioblastoma by suppressing DNA repair mechanisms Cell Death Dis. 2023 14 283 10.1038/s41419-023-05812-1 37085490 PMC10121706 Magalhaes, Y. T., Boell, V. K., Cardella, G. D. & Forti, F. L. Downregulation of the Rho GTPase pathway abrogates resistance to ionizing radiation in wild-type p53 glioblastoma by suppressing DNA repair mechanisms. Cell Death Dis. 14 37085490 10.1038/s41419-023-05812-1 PMC10121706 13. Amit K., Tripathi Priyanka P., Desai Antariksh, Tyagi Jana B., Lampe Yogesh, Srivastava Michael, Donkor Harlan P., Jones Sergei V., Dzyuba Eric, Crossley Noelle S., Williams Jamboor K., Vishwanatha. Short peptides based on the conserved regions of MIEN1 protein exhibit anticancer activity by targeting the MIEN1 signaling pathway. Journal of Biological Chemistry 300 10.1016/j.jbc.2024.105680 PMC10878790 38272230 ",
  "metadata": {
    "Title of this paper": "Downregulation of the Rho GTPase pathway abrogates resistance to ionizing radiation in wild-type p53 glioblastoma by suppressing DNA repair mechanisms",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12480079/"
  }
}