{
  "title": "Paper_405",
  "abstract": "pmc Front Pharmacol Front Pharmacol 1524 frontpharmacol Front. Pharmacol. Frontiers in Pharmacology 1663-9812 Frontiers Media SA PMC12484142 PMC12484142.1 12484142 12484142 41041638 10.3389/fphar.2025.1637958 1637958 1 Pharmacology Original Research Clinical development prospects of siRNA drugs for tumor therapy: analysis of clinical trial registration data from 2004 to 2024 Wang et al. 10.3389/fphar.2025.1637958 Wang Cai-E. * Zhen Delong Yang Lukui Li Guifang  The First Affiliated Hospital, and College of Clinical Medicine of Henan University of Science and Technology Luoyang China  Edited by: Gil Alberto Batista Gonçalves  Reviewed by: Penke Vijaya Babu  Jyoti Singh *Correspondence: Cai-E. Wang, wangcaie@haust.edu.cn 17 9 2025 2025 16 480654 1637958 30 5 2025 08 9 2025 17 09 2025 02 10 2025 03 10 2025 Copyright © 2025 Wang, Zhen, Yang and Li. 2025 Wang, Zhen, Yang and Li https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Background This study systematically compares clinical trial patterns of siRNA drugs in oncology and non-oncology, aiming to inform optimized R&D strategies for oncology. Methods Trial phases, sponsor countries, biomarkers, and targets were analyzed for global siRNA trials (2004–2024). Results Non-oncology trial dominated (90% of 424 trials), peaking in 2021 (64 trials), and yielded 6 approved drugs for metabolic/genetic diseases. Key non-oncology targets included PCSK9 and HBV. Oncology trials initiated later, primarily focusing on phase I/II studies (60% phase I), targeting solid tumors (40%) and CSF2-related therapies (40%). Clinical trial activity in China commenced in 2019, demonstrating acceleration in 2023, yet overall trial volume remains lower than global benchmarks. Cross-target analysis has pinpointed PTGS2 and TGFB1 as shared targets, indicating the possibility for combination therapy. Conclusion Overcoming technical challenges (e.g., targeted delivery) and exploiting multi-target synergies are critical to expanding siRNAs applications in oncology. Success in non-oncology settings demonstrates the translational potential of siRNA technology, however, oncology requires tailored strategies to address complex tumor biology and delivery barriers. siRNA clinical trials cancer therapy drug delivery systems therapeutic targets The author(s) declare that financial support was received for the research and/or publication of this article. The First Affiliated Hospital of Henan University of Science and Technology National Clinical Key Specialty Construction of Oncology 2023 Open Joint Fund Project (ZLKFJJ20230512). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Translational Pharmacology 1 Introduction Small interfering RNA (siRNA) comprises double-stranded RNA fragments of 19–23 base pairs. These fragments can be conjugated to carrier systems for tissue-specific delivery, enabling targeted gene silencing in pathogenic tissues. As biomedical research advances, siRNA has emerged as a revolutionary gene therapy approach, garnering significant attention ( Hannon, 2002 Castanotto and Rossi, 2009 Dorsett and Tuschl, 2004 Dorsett and Tuschl, 2004 Alshaer et al., 2021 In 1998, Andrew Fire and Craig Mello identified the gene-silencing effect of double-stranded RNA in nematode Caenorhabditis elegans Fire et al., 1998 This study comprehensively analyzes the progress of clinical research on siRNAs, and the results showed that global siRNA drug R&D shows significant field differentiation: non-oncology field dominates (over 90% of clinical projects), with six approved drugs for metabolic/genetic disorders targeting key pathways including PCSK9 and HBV. In contrast, oncology R&D is still at an early stage (60% of phase I), with solid tumors as the main indications (40%), homogeneous targets (CSF2 40%) and a high trial termination rate (28%). (40%), target homogenization (40% for CSF2) and a high trial termination rate of 28%. Studies have further identified common targets in multiple tumors such as PTGS2/TGFB1, which suggesting the potential for combination therapy. Although China’s growth rate has increased in recent years, it still lags behind the international level. Based on the characteristics of siRNA technology, there is a need to breakthrough the bottleneck of targeted delivery and other technologies to expand the application of tumor therapy. 2 Methods We selected Citeline Pharma Intelligence as our primary data source, which is a comprehensive and up-to-date database of global clinical trial information. To ensure data accuracy, we cross-referenced records with ClinicalTrials.gov Figure 1 FIGURE 1 Screening flowchart. Flowchart depicting the analysis process of clinical trials from Citeline Pharma. Starting with 517 trials, 49 without a clear start time and 40 in uncertain areas were excluded, leaving 424 analyzed. Categories include the trend of trials over time, treatment fields, drug targets, and biomarkers. Further analysis covers trial phases, tumor types, targets, and crossover maps, concluding with clinical trial status and changes in host country for 97 projects. 3 Results 3.1 Temporal trends and field-specific dynamics An analysis of marketed siRNA drugs revealed a predominance of non-oncology-targeted therapeutics, with six currently approved: inclisiran, vutrisiran, patisiran, lumasiran, givosiran, and nedosiran. These drugs address various conditions, such as familial heterozygous hypercholesterolemia, primary type 1 hyperuricemia, acute hepatic porphyria, and hereditary transthyretin-mediated amyloidosis in adult patients. Detailed information is provided in Table 1 TABLE 1 Summary of marketed non-tumor-oriented siRNA drugs. Drugs Company Trade names Targets Approved countries Approved date Indications First approved country Inclisiran Novartis Leqvio PCSK9 FDA/EMA 2020/12/11 Heterozygous familial hypercholesterolemia EMA Vutrisiran Alnylam Amvuttra GalNAc FDA/EMA/PMDA 2022/6/14 Transthyretin-mediated amyloidosis FDA Patisiran Alnylam Onpattro TTR A FDA/EMA/PMDA 2018/8/10 Hereditary transthyretin-mediated amyloidosis with polyneuropathy FDA Lumasiran Alnylam Oxlumo Glycolate oxidase FDA/EMA 2020/11/23 Primary hyperoxaluria type1 FDA Givosiran Alnylam Givlaari ALAS1 FDA/EMA/PMDA 2019/11/21 Acute hepatic porphyria FDA Nedosiran Novo Nordisk Rivfloza LDHA FDA 2023/9/29 Primary hyperoxaluria type1 FDA Concurrently, a broader spectrum of non-oncology-targeted siRNA drugs are undergoing clinical trials for diverse indications including hepatitis B (HBV) and haemophilia. Table 2 Egli and Manoharan, 2023 Amrite et al., 2023 TABLE 2 Summary of non-tumor-directed siRNA drugs in the investigational phase. Drugs Company Drug targets Indications Latest research published ARO-HSD Arrowhead Pharmaceuticals HSD17B13 NASH 2022 ACR-520 Arrowhead Pharmaceuticals cccDNA CHB 2022 ALN-RSV01 Alynlam RSV RSV infection 2024 BMS-986263 BioMimetics Sympathies HSP47 Advanced hepatic fibrosis 2023 Fitusiran Sanofi and Alnylam Pharmaceuticals Antithrombin Haemophilia 2024 JNJ-73763989 Janssen Pharmaceuticals GalNAc HBV 2024 Lepodisiran Eli Lilly Lp(a)mRNA Increased lipoprotein A 2024 Olpasiran Amgen Lp(a)mRNA Increased lipoprotein A 2024 Zerlasiran (SLN360) Silence Apolipoprotein Increased lipoprotein A 2024 SLN124 Silence GalNAc Hereditary Haemochromatosis Type1 2023 Siran-027 Siran VEGFR-1 Choroidal neovascularization 2010 Teprasiran Quark Pharmaceuticals p53 Acute kidney injury in high-risk patients undergoing cardiac suroerv 2021 TRK-250 Toray Industries TGF-β1 Idiopathic Pulmonary Fibrosis 2023 Plozasiran Arrowhead Pharmaceuticals APOC3 Hypertriglyceridemia 2024 PF-04523655 Quark Pharmaceuticals RTP801 Diabetic 2012 We analysed 424 clinical trials of siRNA drugs initiated worldwide between 2004 and 2024. Overall, the number of trials demonstrated an upward trend, accelerating markedly after 2013 and peaking in 2021 (64). Among these oncology-targeted siRNA drugs development commenced later with fewer aggregate trails, it exhibited parallel growth patterns with notable peaks in 2014 and 2023. The development trajectory closely mirrors that of all siRNA drugs, with minor fluctuations. In comparison with the clinical trials of oncology-targeted siRNA drugs, the number of trial projects for siRNA drugs in other fields is notably higher, accounting for 90.63% of the total clinical trials in 2021 ( Figure 2A FIGURE 2 Highlights temporal/regional trends, phase disparities, and oncology vs. non-oncology dynamics. Global trends in siRNA clinical trials (2004–2024): Field-specific growth (A,B) (C) (D) P (E) P (F) A six-panel data visualization showing trends in clinical trials and research publications. Panel A: Stacked area chart showing oncology and all fields' research trends from 2004 to 2024, with oncology increasing slightly. Panel B: Similar stacked area chart for global and China-specific data, showing significant growth primarily in global research. Panel C: Pie chart depicting distribution of clinical trial phases, with Phase I being the largest. Panel D: Another pie chart showing a different distribution, with Phase I still dominant. Panel E: Stacked bar chart comparing regional percentages of research from 2004-2016 and 2017-2024, with Asia showing growth. Panel F: Stacked bar chart on clinical trial phases across the same periods, with Phase I/II showing an increase. Since the start of clinical trials of siRNA drugs in China in 2019, the number of projects will remain at a low level until 2022, and the number of related trials started to show an increasing trend in 2023. Although the research in this field started later than the international advanced level, the existing project size is limited and there is a gap in the overall development, the research process has always maintained a stable upward trend ( Figure 2B From the characteristics analysis of the distribution of clinical trial stages, phase I and II trials dominate both oncology and non-oncology fields, with phase I clinical trials in oncology being particularly prominent, accounting for 60% of the total. Due to the advantages of a larger project base and earlier implementation time, the clinical research design of non-oncology has the characteristics of a refined exploration of transitional phases such as phase I/II and phase II/III. In contrast, oncology clinical trials are at an early stage of development and the research staging model has not yet formed a complete system at this stage ( Figures 2C,D This study analyzed two time periods: 2004–2016 and 2017–2024. In terms of individual sponsoring countries, North America conducted more clinical trial projects than Europe and Asia during both time periods. From 2004 to 2016 to 2017–2024, the number of oncology clinical trial projects decreased across regions, though the distribution ratio of trial numbers across regions did not change significantly ( P P Figures 2E,F 3.2 Biomarker prioritization and field-specific target landscapes  Figure 3E Figure 3F FIGURE 3 Emphasizes biomarker adoption, trial outcomes, and target/indication clustering. Indications and targets (A–D) (E) (F) Chart with six panels. A: Bar chart showing the prevalence of specific diseases, with solid tumors being the highest. B: Bar chart highlighting the prevalence of various health conditions, focusing on cardiovascular issues. C: Bar chart detailing the occurrence of specific biomarkers, with CSF2 being most common. D: Bar chart listing target biomarkers, led by PCSK9. E: Pie chart showing that 71% of exploration target biomarkers were set. F: Pie chart depicting project statuses, with 50% completed. We analyzed the reasons for trial termination in the oncology field (n = 19). Business decisions accounted for the majority of cases (36.8%), followed by trials planned but never initiated (21.1%), lack of efficacy (15.8%), safety/adverse effects (10.5%), and poor enrollment rates (5.3%). Analysis of trial outcomes (n = 34) revealed primary endpoint achievement in 47.1% of completed trials. Unknown and indeterminate outcomes accounted for 50.0% and 2.9% of cases respectively, with no observed instances of primary endpoint failure. See Table 3 TABLE 3 Reasons for termination and outcome distribution of clinical trials of siRNA drugs for tumors. Reasons for trial termination (n = 19) Percentage (frequency) Business decision (Pipeline reprioritization; Drug strategy shift) 36.8% (7) Planned but never initiated 21.1% (4) Lack of efficacy 15.8% (3) Safety/adverse effects 10.5% (2) Unknown 10.5% (2) Poor enrollment 5.3% (1) Trial outcome (n = 34) Percentage (frequency) Outcome unknown 50.0% (17) Positive outcome/primary endpoints met 47.1% (16) Outcome indeterminate 2.9% (1) Negative outcome/primary endpoints not met 0% Therapeutic area analysis revealed cardiovascular, infectious, autoimmune, endocrine and central nervous system diseases as the top five indications for siRNA clinical trial. This trend is evidenced by approved and pipeline agents (e.g., inclisiran, BMS-986263, lepodisiran, etc.) primarily targeting infectious diseases (e.g., hepatitis B) and metabolic disease (e.g., diabetes) in Tables 1 2 An integrated analysis of Tables 1 2 Our analysis of clinical trials for oncology-targeted siRNA drugs revealed that solid tumors constituted the largest proportion of indications, followed by ovarian cancer and non-Hodgkin’s lymphoma. This finding aligns with the information presented in Figures 2C,D Figure 3A Analysis of siRNA drug frequency by target revealed that in the non-oncology domain, the three most prevalent targets were PCSK9 (14.98%), HBV (14.63%), and TTR (5.92%). In oncology projects, the top three targets were colony stimulating factor 2 (CSF2) (40%), programmed cell death 1 (PDCD1) (11.43%), and Cbl protooncogene B (CBL) (11.43%) ( Figures 3C,D 3.3 Intertumoral target heterogeneity and common pathways across cancers Tumors can harbour multiple distinct molecular targets, and it is common for different tumor types to share certain targets. Solid tumors exhibit multiple targets, including EPH receptor A2 (EPHA2), forkhead box P3 (FOXP3), ribonucleotide reductase regulatory subunit M2 (RRM2), stathmin 1 (STMN1), kinesin family member 11 (KIF11), and microRNA 11b. Pancreatic tumors specifically feature three targets: pancreatic and duodenal homeobox 1 (PDX1), KRAS protooncogene GTPase (KRAS), and tumor necrosis factor (TNF). Several cancer types, including basal cell carcinoma, hepatocellular carcinoma, non-small cell lung cancer, cutaneous squamous cell carcinoma, and solid tumors, share two common targets: prostaglandin-endoperoxide synthase 2 (PTGS2) and transforming growth factor beta 1 (TGFB1). Additionally, CSF2 serves as a shared target among colorectal cancer, breast cancer, Ewing’s sarcoma, melanoma, ovarian cancer, soft tissue sarcoma, and solid tumors. Non-Hodgkin’s lymphoma and solid tumors share two targets: signal transducer and activator of transcription 3 (STAT3) and BCL2 apoptosis regulator (BCL2). A detailed overview is shown in Figure 4 FIGURE 4 Indication-target relationship of siRNA therapeutics clinical trials for tumors. A table and bar chart with intersecting sets related to various cancer types and genes. The table categorizes genes linked to 15 cancer types, identified with letters A to M. The bar chart shows intersection sizes, with the largest being 8 for category A. Descriptions below define abbreviations, such as B for Breast and L for Liver. 4 Discussion Between 2004 and 2016 and 2017∼2024, the number of siRNA drug clinical trial projects increased from 123 to 301. The total number of projects in the latter eight-years period was 2.4 times greater than in the initial twelve-year span. This rise indicates that siRNA therapeutics has become an increasingly prominent area of development. Since 2016, researchers have employed advanced chemical modifications and targeted delivery systems to address the challenges of siRNA instability and susceptibility to degradation by RNA enzymes in vivo Parmar et al., 2016 Dong et al., 2019 Mainini and Eccles, 2020 Jorge et al., 2020 Gupta et al., 2021 Khvorova and Watts, 2017 Wu et al., 2016 Guo et al., 2024 MacEwan et al., 2010 Wang et al., 2017 Kara et al., 2022 Trajanoska et al., 2023 Liu et al., 2023 Kara et al., 2022 Wu et al., 2022 Ray et al., 2020 Adams et al., 2023 From 2017 to 2024, there was a structural shift in tumor siRNA clinical trials ( P This study reveals three major challenges facing the development of tumor-specific siRNA through an in-depth analysis of the reasons for and outcomes of clinical trials involving it. First, capital-sensitive advancement mechanisms: 36.8% of trials were terminated due to adjustments in commercial strategies, reflecting capital’s cautious assessment of the potential for translation, especially compared to the six drugs already on the market in non-tumor fields (This is consistent with our inference about the contents of Figures 2E,F Table 1 Figure 2D This early-stage predominance—particularly acute in oncology where only 9.4% of trials reach Phase III—demands a comprehensive approach during siRNA drug design, emphasizing optimal delivery strategies and a thorough understanding of pharmacokinetics, pharmacodynamics, and active metabolites. Compared to conventional drugs, small nucleic acid drugs face efficiency challenges due to the need to traverse the cytosol membrane to target mRNA in the cytoplasm or nucleus ( Zhang et al., 2021 Gao et al., 2009 Schenk et al., 2008 Godinho et al., 2022 Biscans et al., 2019 Rajappa et al., 2010 Tang and Khvorova, 2024 Setten et al., 2019 Adams et al., 2018 K et al., 2019 K et al., 2019 El Moukhtari et al., 2023 El Moukhtari et al., 2023 As a cutting-edge strategy for tumor-targeted therapies, siRNA drugs show significant development potential in the field of tumor microenvironment regulation. Research data indicate that CSF2 (granulocyte-macrophage colony-stimulating factor, GM-CSF) has emerged as the most actively pursued target for siRNA drug development ( Figure 2F Becher et al., 2016 Li et al., 2020 Greter et al., 2012 Li et al., 2020 Ji et al., 2023 Anderson et al., 2023 Activation of IL-6/STAT3, a classic signaling pathway in tumor cells, begins when IL-6 binds to IL-6Rα and gp130 receptor subunits on the membrane surface to form a complex that triggers phosphorylation of JAK kinase and ultimately activation of STAT3 ( Hirano, 2021 Hillmer et al., 2016 Zou et al., 2020 Mohan et al., 2022 NCT06098651 The RING-type E3 ubiquitin ligase activity of Cbl-b, an important member of the Cbl junction protein family, makes it a key negative regulator of lymphocyte and natural killer cell (NK cell) activation ( Augustin et al., 2023 in vitro NCT03087591 Notably, STP707/STP705, the core product of the pipeline developed by SUNON PHARMACEUTICAL, adopts a dual-target silencing strategy. By concurrently silencing TGF-β1 and COX-2 gene expression, it achieves synergistic multi-pathway regulation. At present, STP707 has been approved by the U.S. FDA for IND, and the approved indications cover the three major areas of cholangiocarcinoma, non-melanoma skin tumors and pathological scarring. The related multi-center clinical trials are currently advancing ( NCT05037149 5 Conclusion This study statistically analyzed 424 siRNA drug clinical trials, focusing on oncology therapeutics across trial volume, indications, targets, and status. Analysis reveals oncology siRNA drugs remain in early-stage R&D, with limited trial numbers and development constrained by tumor penetration barriers and delivery challenges. Nevertheless, siRNA drugs constitute an essential frontier in cancer therapy due to abbreviated development cycles and precise targeting. We propose this work as a strategic reference for optimizing siRNA-tumor adaptive drug design, overcoming target innovation deficits (e.g., CSF2 homogeneity) and delivery limitations, thereby accelerating clinical translation of this drug class. We are grateful to all the authors who participated in the study for their sharing of the language, writing, and proofreading of the article. Data availability statement The data analyzed in this study is subject to the following licenses/restrictions: none. Requests to access these datasets should be directed to zhendelong0@163.com Ethics statement The studies involving humans were approved by The Ethics Committee of the First Affiliated Hospital of Henan University of Science and Technology. The studies were conducted in accordance with the local legislation and institutional requirements. Written informed consent for participation was not required from the participants or the participants’ legal guardians/next of kin in accordance with the national legislation and institutional requirements. Author contributions C-EW: Writing – review and editing, Writing – original draft, Methodology. DZ: Writing – original draft, Visualization, Data curation. LY: Data curation, Software, Writing – original draft. GL: Writing – review and editing, Project administration, Resources. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References Adams D. Gonzalez-Duarte A. O’Riordan W. D. Yang C. C. Ueda M. Kristen A. V. 2018 Patisiran, an RNAi therapeutic, for hereditary transthyretin amyloidosis N. Engl. J. Med. 379 1 11 21 10.1056/NEJMoa1716153 29972753 Adams D. Tournev I. L. Taylor M. S. Coelho T. Planté-Bordeneuve V. Berk J. L. 2023 Efficacy and safety of vutrisiran for patients with hereditary transthyretin-mediated amyloidosis with polyneuropathy: a randomized clinical trial Amyloid 30 1 1 9 10.1080/13506129.2022.2091985 35875890 Alshaer W. Zureigat H. Al Karaki A. Al-Kadash A. Gharaibeh L. Hatmal M. M. 2021 siRNA: mechanism of action, challenges, and therapeutic approaches Eur. J. Pharmacol. 905 174178 10.1016/j.ejphar.2021.174178 34044011 Amrite A. Fuentes E. Marbury T. C. Zhang S. 2023 Safety, pharmacokinetics, and exposure–response modeling of nedosiran in participants with severe chronic kidney disease Clin. Pharmacol. Drug Dev. 12 12 1164 1177 10.1002/cpdd.1320 37605486 Anderson P. Ghisoli M. Crompton B. D. Klega K. S. Wexler L. H. Slotkin E. K. 2023 Pilot study of recurrent ewing’s sarcoma management with vigil/temozolomide/irinotecan and assessment of circulating tumor (ct) DNA Clin. Cancer Res. 29 9 1689 1697 10.1158/1078-0432.CCR-22-2292 36780200 PMC10150239 Augustin R. C. Bao R. Luke J. J. 2023 Targeting Cbl-b in cancer immunotherapy J. Immunother. Cancer 11 2 e006007 10.1136/jitc-2022-006007 36750253 PMC9906388 Becher B. Tugues S. Greter M. 2016 GM-CSF: from growth factor to central mediator of tissue inflammation Immunity 45 5 963 973 10.1016/j.immuni.2016.10.026 27851925 Biscans A. Coles A. Haraszti R. Echeverria D. Hassler M. Osborn M. 2019 Diverse lipid conjugates for functional extra-hepatic siRNA delivery in vivo Nucleic Acids Res. 47 3 1082 1096 10.1093/nar/gky1239 30544191 PMC6379722 Castanotto D. Rossi J. J. 2009 The promises and pitfalls of RNA-interference-based therapeutics Nature 457 7228 426 433 10.1038/nature07758 19158789 PMC2702667 Dong Y. Siegwart D. J. Anderson D. G. 2019 Strategies, design, and chemistry in siRNA delivery systems Adv. Drug Deliv. Rev. 144 133 147 10.1016/j.addr.2019.05.004 31102606 PMC6745264 Dorsett Y. Tuschl T. 2004 siRNAs: applications in functional genomics and potential as therapeutics Nat. Rev. Drug Discov. 3 4 318 329 10.1038/nrd1345 15060527 Egli M. Manoharan M. 2023 Chemistry, structure and function of approved oligonucleotide therapeutics Nucleic Acids Res. 51 6 2529 2573 10.1093/nar/gkad067 36881759 PMC10085713 El Moukhtari S. H. Garbayo E. Amundarain A. Pascual-Gil S. Carrasco-León A. Prosper F. 2023 Lipid nanoparticles for siRNA delivery in cancer treatment J. Control. Release 361 130 146 10.1016/j.jconrel.2023.07.054 37532145 Fire A. Xu S. Montgomery M. K. Kostas S. A. Driver S. E. Mello C. C. 1998 Potent and specific genetic interference by double-stranded RNA in Caenorhabditis elegans Nature 391 6669 806 811 10.1038/35888 9486653 Gao S. Dagnaes-Hansen F. Nielsen E. J. B. Wengel J. Besenbacher F. Howard K. A. 2009 The effect of chemical modification and nanoparticle formulation on stability and biodistribution of siRNA in mice Mol. Ther. 17 7 1225 1233 10.1038/mt.2009.91 19401674 PMC2835214 Godinho BMDC Knox E. G. Hildebrand S. Gilbert J. W. Echeverria D. Kennedy Z. 2022 PK-modifying anchors significantly alter clearance kinetics, tissue distribution, and efficacy of therapeutics siRNAs Mol. Ther. Nucleic Acids 29 116 132 10.1016/j.omtn.2022.06.005 35795486 PMC9240963 Greter M. Helft J. Chow A. Hashimoto D. Mortha A. Agudo-Cantero J. 2012 GM-CSF controls nonlymphoid tissue dendritic cell homeostasis but is dispensable for the differentiation of inflammatory dendritic cells Immunity 36 6 1031 1046 10.1016/j.immuni.2012.03.027 22749353 PMC3498051 Guo S. Zhang M. Huang Y. 2024 Three ‘E’ challenges for siRNA drug development Trends Mol. Med. 30 1 13 24 10.1016/j.molmed.2023.10.005 37951790 Gupta A. Andresen J. L. Manan R. S. Langer R. 2021 Nucleic acid delivery for therapeutic applications Adv. Drug Deliv. Rev. 178 113834 10.1016/j.addr.2021.113834 34492233 Hannon G. J. 2002 RNA interference Nature 418 6894 244 251 10.1038/418244a 12110901 Hillmer E. J. Zhang H. Li H. S. Watowich S. S. 2016 STAT3 signaling in immunity Cytokine Growth Factor Rev. 31 1 15 10.1016/j.cytogfr.2016.05.001 27185365 PMC5050093 Hirano T. 2021 IL-6 in inflammation, autoimmunity and cancer Int. Immunol. 33 3 127 148 10.1093/intimm/dxaa078 33337480 PMC7799025 Ji R. Wu C. Yao J. Xu J. Lin J. Gu H. 2023 IGF2BP2-meidated m6A modification of CSF2 reprograms MSC to promote gastric cancer progression Cell Death Dis. 14 10 693 10.1038/s41419-023-06163-7 37865637 PMC10590395 Jorge A. Pais A. Vitorino C. 2020 Targeted siRNA delivery using lipid nanoparticles Methods Mol. Biol. 2059 259 283 10.1007/978-1-4939-9798-5_14 31435927 Kim B. Park J. Sailor M. J. 2019 Rekindling RNAi therapy: materials design requirements for in vivo Adv. Mater. 31 49 e1903637 10.1002/adma.201903637 31566258 PMC6891135 Kara G. Calin G. A. Ozpolat B. 2022 RNAi-based therapeutics and tumor targeted delivery in cancer Adv. Drug Deliv. Rev. 182 114113 10.1016/j.addr.2022.114113 35063535 Khvorova A. Watts J. K. 2017 The chemical evolution of oligonucleotide therapies of clinical utility Nat. Biotechnol. 35 3 238 248 10.1038/nbt.3765 28244990 PMC5517098 Li Y. Zhai P. Zheng Y. Zhang J. Kellum J. A. Peng Z. 2020 Csf2 attenuated sepsis-induced acute kidney injury by promoting alternative macrophage transition Front. Immunol. 11 1415 10.3389/fimmu.2020.01415 32733471 PMC7358306 Liu S. Dharanipragada P. Lomeli S. H. Wang Y. Zhang X. Yang Z. 2023 Multi-organ landscape of therapy-resistant melanoma Nat. Med. 29 5 1123 1134 10.1038/s41591-023-02304-9 37106167 PMC10202813 MacEwan S. R. Callahan D. J. Chilkoti A. 2010 Stimulus-responsive macromolecules and nanoparticles for cancer drug delivery Nanomedicine 5 5 793 806 10.2217/nnm.10.50 20662649 PMC2963449 Mainini F. Eccles M. R. 2020 Lipid and polymer-based nanoparticle siRNA delivery systems for cancer therapy Molecules 25 11 2692 10.3390/molecules25112692 32532030 PMC7321291 Mohan C. D. Rangappa S. Preetham H. D. Chandra N. S. Gupta V. K. Basappa S. 2022 Targeting STAT3 signaling pathway in cancer by agents derived from mother nature Semin. Cancer Biol. 80 157 182 10.1016/j.semcancer.2020.03.016 32325172 Parmar R. Willoughby J. L. S. Liu J. Foster D. J. Brigham B. Theile C. S. 2016 5′‐(E)‐Vinylphosphonate: a stable phosphate mimic can improve the RNAi activity of siRNA–GalNAc conjugates ChemBioChem. 17 11 985 989 10.1002/cbic.201600130 27121751 Rajappa M. Saxena P. Kaur J. 2010 Ocular angiogenesis: mechanisms and recent advances in therapy Advances in clinical chemistry Academic Press Inc. 103 121 20521443 Ray K. K. Wright R. S. Kallend D. Koenig W. Leiter L. A. Raal F. J. 2020 Two phase 3 trials of inclisiran in patients with elevated LDL cholesterol N. Engl. J. Med. 382 16 1507 1519 10.1056/NEJMoa1912387 32187462 Schenk S. Schoenhals G. J. de Souza G. Mann M. 2008 A high confidence, manually validated human blood plasma protein reference set BMC Med. Genomics 1 1 41 10.1186/1755-8794-1-41 18793429 PMC2563020 Setten R. L. Rossi J. J. Han S. ping 2019 The current state and future directions of RNAi-based therapeutics Nat. Rev. Drug Discov. 18 6 421 446 10.1038/s41573-019-0017-4 30846871 Tang Q. Khvorova A. 2024 RNAi-based drug design: considerations and future directions Nat. Rev. Drug Discov. 23 5 341 364 10.1038/s41573-024-00912-9 38570694 PMC11144061 Trajanoska K. Bhérer C. Taliun D. Zhou S. Richards J. B. Mooser V. 2023 From target discovery to clinical drug development with human genetics Nature 620 7975 737 745 10.1038/s41586-023-06388-8 37612393 Wang T. Shigdar S. Shamaileh H. A. Gantier M. P. Yin W. Xiang D. 2017 Challenges and opportunities for siRNA-based cancer treatment Cancer Lett. 387 77 83 10.1016/j.canlet.2016.03.045 27045474 Wu D. Han H. Xing Z. Zhang J. Li L. Shi W. 2016 Ideal and reality: barricade in the delivery of small interfering RNA for cancer therapy Curr. Pharm. Biotechnol. 17 3 237 247 10.2174/1389201017666151029110710 26511977 Wu T. Cooper S. A. Shah V. H. 2022 Omics and AI advance biomarker discovery for liver disease Nat. Med. 28 6 1131 1132 10.1038/s41591-022-01853-9 35710988 Zhang M. M. Bahal R. Rasmussen T. P. Manautou J. E. Zhong X. bo 2021 The growth of siRNA-based therapeutics: updated clinical studies Biochem. Pharmacol. 189 114432 10.1016/j.bcp.2021.114432 33513339 PMC8187268 Zou S. Tong Q. Liu B. Huang W. Tian Y. Fu X. 2020 Targeting STAT3 in cancer immunotherapy Mol. Cancer 19 1 145 10.1186/s12943-020-01258-7 32972405 PMC7513516 ",
  "metadata": {
    "Title of this paper": "Targeting STAT3 in cancer immunotherapy",
    "Journal it was published in:": "Frontiers in Pharmacology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484142/"
  }
}