{
  "title": "Paper_996",
  "abstract": "pmc Nutrients Nutrients 1692 nutrients nutrients Nutrients 2072-6643 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472729 PMC12472729.1 12472729 12472729 41010452 10.3390/nu17182926 nutrients-17-02926 1 Article Vitamin D Genetics Beyond Serum 25(OH)D: VDR FokI https://orcid.org/0009-0007-4267-2250 Larysz Dariusz Conceptualization Methodology Validation Formal analysis Investigation Resources Data curation Writing – original draft Writing – review & editing Visualization Project administration 1 https://orcid.org/0009-0004-7841-821X Recław Remigiusz Conceptualization Formal analysis Writing – original draft Writing – review & editing Investigation Resources Project administration 2 3 https://orcid.org/0000-0002-7137-1429 Suchanecka Aleksandra Methodology 2 https://orcid.org/0009-0001-6011-9383 Dziurawiec Wojciech Validation Methodology 1 https://orcid.org/0009-0001-7091-6829 Tkacz Rafał Validation 1 https://orcid.org/0000-0001-6564-2141 Strońska-Pluta Aleksandra Writing – review & editing 2 https://orcid.org/0000-0003-4254-5466 Chmielowiec Krzysztof Software Visualization Formal analysis 4 https://orcid.org/0000-0002-2633-520X Grzywacz Anna Conceptualization Funding acquisition Supervision Writing – review & editing Writing – original draft 2 3 * https://orcid.org/0000-0003-3285-5313 Chmielowiec Jolanta Writing – review & editing 4 Barker Tyler Academic Editor 1 dariuszlarysz@hotmail.com wojciechdziurawiec@hotmail.com robert.tkacz@hotmail.com 2 remigiusz.reclaw@pum.edu.pl aleksandra.suchanecka@pum.edu.pl aleksandra.stronska@pum.edu.pl 3 4 chmiele@vp.pl chmiele1@o2.pl * grzywacz.anna.m@gmail.com 11 9 2025 9 2025 17 18 497660 2926 18 8 2025 04 9 2025 11 9 2025 11 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background: Vitamin D receptor (VDR) polymorphisms may influence immune regulation and musculoskeletal health, but their perioperative role is not well understood. This study investigated the rs2228570 ( FokI p p p p p p p vitamin D receptor ( VDR rs2228570 FokI orthopedic surgery blood biochemical markers quality of life The research obtained no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Vitamin D is a secosteroid hormone essential for calcium–phosphate balance, skeletal integrity, and immune regulation [ 1 2 2 3 3 VDR 3 1 2 The VDR 4 5 6 VDR 7 VDR FokI VDR 8 9 8 9 10 11 12 The present study aimed to investigate the association between the rs2228570 FokI VDR VDR 11 13 14 15 VDR 16 By integrating genetic, biochemical, and patient-reported outcomes, this study offers a multidimensional perspective on the potential role of the VDR 17 18 19 In orthopedic perioperative care, low-grade inflammation and hematologic dynamics are central to recovery trajectories and complication risk. Because rs2228570 ( FokI 2. Materials and Methods 2.1. Participants A total of 500 individuals participated in the study. The study group comprised 300 patients undergoing orthopedic surgery (men: n = 113, 37.7%; women: n = 187, 62.3%), while the control group included 200 healthy individuals with no history of musculoskeletal disorders or prior orthopedic interventions (men: n = 61, 30.5%; women: n = 138, 69.5%). The mean age of the orthopedic patients was 66.7 years, whereas the mean age in the control group was 30.7 years. Although there was a substantial age difference between groups, age was included as a covariate in the multiple regression models to control for its potential confounding effect. The orthopedic patient group included individuals scheduled for elective procedures such as hip or knee arthroplasty, fracture fixation, or corrective osteotomy. Patients were recruited from the Orthopedics Department of the 109th Military Hospital with Polyclinic in Szczecin, Poland, and met the inclusion criteria of being over 18 years of age, having no active malignancy, infectious, or autoimmune disease, and providing written informed consent to participate. The control group consisted primarily of local community members, as well as university medical staff and students, with a similar sex distribution but differing in age due to the clinical nature of the study group. 2.2. Measures Biochemical blood parameters were assessed in all participants and included: white blood cell count (WBC, ×10 9 9 9 9 9 9 9 3 3 Body mass index (BMI, kg/m 2 Health-related quality of life was assessed using the Short Form Health Survey (SF-36), a validated 36-item questionnaire covering eight domains: physical functioning, role limitations due to physical health, bodily pain, general health, vitality, social functioning, role limitations due to emotional problems, and mental health. 2.3. Genotyping Genomic DNA was isolated from peripheral venous blood using standard procedures. The extraction was performed according to the manufacturer’s protocol (ROCHE, Basel, Switzerland) and in compliance with the company’s quality control standards. The selection of reagents, primers, and probes was based on the specifications provided in the ROCHE real-time PCR methodology for single nucleotide polymorphism (SNP) detection. The rs2228570 FokI VDR 2.4. Statistics The concordance between genotype frequency distribution and Hardy–Weinberg equilibrium (HWE) was tested using the HWE software ( https://wpcalc.com/en/equilibrium-hardy-weinberg/ t FokI FokI FokI p 3. Results The genotype frequency distribution in the orthopedic patient group was consistent with the expectations of Hardy–Weinberg equilibrium (HWE). A similar adherence to HWE was observed in the control group ( Table 1 There was no statistically significant difference in the distribution of rs2228570 FokI 2 p FokI 2 p Table 2 No statistically significant differences were observed in the frequency of the rs2228570 FokI 2 p 2 p 2 p 2 p Table 3 The general characteristics of the orthopedic surgery patient group, including age, BMI, blood biochemical parameters, and the SF-36 quality of life questionnaire scores, are presented in Table 4 nutrients-17-02926-t004_Table 4 Table 4 Descriptive statistics of biochemical parameters and SF-36 quality of life questionnaire scores in orthopedic surgery patients.  M (SD)/[Q1:Q3] * Minimum Maximum Age 66.70 (10.08) 27.00 87.00 Body mass index (BMI) 29.17 (4.97) 17.93 48.42 White blood cells (WBC, ×10 9 6.99 (1.96) 2.40 14.76 Lymphocytes (LYM, ×10 9 1.71 (0.56) 0.60 4.42 Neutrophils (NEU, ×10 9 4.58 (1.69) 1.13 12.44 Monocytes (MONO, ×10 9 0.52 (0.17) 0.05 1.23 Eosinophils (EOS, ×10 9 0.12 [0.05:0.17] * 0.00 0.73 Basophils (BASO, ×10 9 0.04 [0.02:0.05] * 0.00 0.10 Hemoglobin (HGB, g/dL) 13.82 (1.44) 9.10 17.90 Hematocrit (HCT, %) 41.24 (4.38) 14.70 52.80 Mean corpuscular volume (MCV, fL) 90.59 (5.16) 76.50 120.30 Mean corpuscular hemoglobin (MCH, pg) 30.19 (2.16) 20.80 41.00 Mean corpuscular hemoglobin 33.36 (0.98) 28.40 36.60 Platelet count (PLT, ×10 9 257.27 (73.33) 12.00 717.00 Platelet distribution width (PDW, %) 13.35 [10.90:13.50] * 8.70 36.9 Mean platelet volume (MPV, fL) 11.53 [9.80:11.10] * 8.60 14.7 Plateletcrit (PCT, %) 0.43 [0.22:0.31] * 0.09 00.68 C-reactive protein (CRP, mg/L) 7.72 [0.99:4.49] * 0.05 211.55 25-hydroxyvitamin D3 (ng/mL) 32.70 [20.40:40.70] * 0.35 122.00 Glycated hemoglobin (HbA1c, %) 5.88 [5.38:6.00] * 4.72 9.85 Creatinine (µmol/L) 79.78 [64.00:86.00] * 46.00 282.00 SF-36 quality of life score 96.05 (10.19) 54.00 122.00 M—arithmetic mean; SD—standard deviation; Q1—lower quartile; Q3—upper quartile; *—variables do not follow a normal distribution according to the Kolmogorov–Smirnov test. Table 5 p p p p p p p p p p p nutrients-17-02926-t005_Table 5 Table 5 Comparison of biochemical parameters and SF-36 quality of life questionnaire scores between male and female orthopedic surgery patients. Sex Men = 113 Women = 187 Student’s t p M (SD)/[Q1:Q3] * M (SD)/[Q1:Q3] * U Test *  Age 66.12 (9.80) 67.05 (10.26) −0.7732 0.44000 BMI 29.94 (4.92) 28.71 (4.95) 2.0890 0.03755 # WBC 7.22 (1.89) 6.86 (1.99) 1.5475 0.12280 LYM 1.73 (0.55) 1.70 (0.57) 0.4509 0.65236 NEU 4.72 (1.63) 4.50 (1.73) 1.1197 0.26376 MONO 0.57 (0.17) 0.49 (0.16) 3.8819 0.00013 # EOS 0.13 [0.06:0.18] 0.12 [0.04:0.16] 1.4669 * 0.14238 BASO 0.04 [0.02:0.05] 0.04 [0.03:0.05] 0.8131 * 0.41613 HGB 14.51 (1.54) 13.40 (1.21) 6.9779 0.00001 # HCT % 43.06 (4.22) 40.14 (4.10) 5.9125 0.00001 # MCV 91.45 (5.23) 90.07 (5.07) 2.2665 0.02414 # MCH 30.81 (2.00) 29.82 (2.17) 3.9513 0.00010 # MCHC 33.69 (0.93) 33.16 (0.96) 4.6862 0.00000 # PLT 239.97 (60.83) 267.73 (78.26) −3.2261 0.00139 # PDW 14.76 [10.70:13.40] 12.50 [11.10:13.50] −0.7325 * 0.46384 MPV 10.35 [9.70:11.10] 12.24 [9.80:11.10] −1.0091 * 0.31291 PCT 0.54 [0.21:0.28] 0.36 [0.23:0.33] 3.7999 * 0.00014 # CRP 7.50 [0.85:4.09] 7.85 [1.07:4.83] −1.0276 * 0.30411 25 (OH) D3 28.96 [19.10:34.40] 34.96 [22.40:42.90] −3.2759 * 0.00105 # HbA1c 5.82 [5.36:6.03] 5.92 [5.38:5.94] 0.4746 * 0.63505 Creatinine 90.02 [72.00:99.50] 73.60 [61.00:82.00] 6.5621 * 0.00001 # SF-36 97.35 (10.52) 95.26 (9.93) 1.7282 0.08500 M—arithmetic mean; SD—standard deviation; Q1—lower quartile; Q3—upper quartile; *—variables do not follow a normal distribution according to the Kolmogorov–Smirnov test; Student’s t p Abbreviations 3 3 Table 6 FokI A higher white blood cell count was associated with the rs2228570 FokI p FokI p p p p FokI p p FokI p FokI p p FokI p p p FokI p FokI p p A lower basophil count was associated with older age (ß = –0.0002; p FokI p p p p FokI p p nutrients-17-02926-t006_Table 6 Table 6 Multiple regression model for biochemical parameters and SF-36 quality of life questionnaire scores (dependent variables). Independent variables include the rs2228570 FokI β ( p Reference p rs2228570 C/C p rs2228570 T/T p Age p BMI p WBC 6.34 (4.36:8.33) p 0.52 (0.02:1.02) p 0.17 (−0.45:0.79) p −0.01 (−0.03:0.01) p 0.04 (−0.01:0.08) p LYM 1.94 (1.39:2.49) p 0.26 (0.12:0.40) p −0.01 (−0.18:0.16) p −0.01 (−0.02:−0.004) p 0.01 (0.001:0.03) p NEU 3.93 (2.20: 5.65) p 0.25 (−0.19: 0.68) p 0.23 (−0.30:0.77) p 0.001 (−0.02: 0.02) p 0.02 (−0.02: 0.05) p MONO 0.29 (0.12:0.46) p 0.005 (−0.04:0.05) p −0.02 (−0.07:0.03) p 0.0005 (−0.001: 0.002) p 0.006 (0.003:0.01) p EOS 0.03 (−0.07: 0.13) p −0.005 (−0.03: 0.02) p −0.03 (−0.06: 0.004) p 0.0001 (−0.001: 0.001) p 0.003 (0.001: 0.005) p BASO 0.04 (0.02: 0.06) p −0.001 (−0.005: 0.003) p 0.004 (−0.001: 0.01) p −0.0002 (−0.0004: −0.00003) p 0.0003 (−0.00005: 0.0007) p HGB 14.02 (12.58: 15.45) p 0.57 (0.21: 0.94) p 0.39 (−0.05: 0.84) p −0.02 (−0.03: −0.004) p 0.03 (−0.003: 0.06) p HCT % 38.94 (34.60: 43.27) p 1.42 (0.33: 2.52) p 1.45 (0.10: 2.80) p −0.04 (−0.09: 0.008) p 0.15 (0.05: 0.24) p MCV 88.48 (83.26: 93.69) p −0.33 (−1.65: 0.99) p −1.63 (−3.26: −0.007) p 0.05 (−0.005: 0.11) p −0.04 (−0.15: 0.08) p MCH 30.22 (28.03: 32.41) p 0.05 (−0.51: 0.60) p −0.58 (−1.26: 0.10) p 0.01 (−0.01: 0.04) p −0.02 (−0.07: 0.03) p MCHC 34.19 (33.19: 35.19) p 0.12 (−0.13: 0.37) p −0.11 (−0.42: 0.20) p −0.01 (−0.01: 0.003) p −0.01 (−0.03: 0.01) p PLT 327.26 (253.06: 401.45) p −6.51 (−25.25: 12.23) p 9.04 (−14.07: 32.16) p −0.94 (−1.76: −0.11) p −0.23 (−1.91: 1.44) p PDW 11.43 (−6.34: 29.21) p 0.48 (−4.01: 4.97) p 5.50 (−0.04: 11.04) p −0.09 (−0.28: 0.11) p 0.23 (−0.17: 0.63) p MPV 15.50 (−3.50: 34.50) p 3.54 (−1.25: 8.34) p −0.24 (−6.16: 5.67) p −0.05 (−0.26: 0.16) p −0.05 (−0.48: 0.38) p PCT 2.14 (0.52: 3.75) p 0.002 (−0.41: 0.41) p 0.03 (−0.47: 0.54) p −0.02 (−0.04: −0.002) p −0.01 (−0.05: 0.02) p CRP 8.00 (−15.24: 31.25) p 0.40 (−5.47: 6.27) p 10.90 (3.66: 18.14) p 0.06 (−0.19: 0.32) p −0.22 (−0.75: 0.30) p 25 (OH) D 3 24.57 (7.79: 41.35) p −4.12 (−8.36: 0.12) p 1.71 (−3.51: 6.94) p 0.35 (0.16: 0.54) p −0.49 (−0.87: −0.11) p HbA1c 4.10 (2.58: 5.62) p −0.05 (−0.43: 0.34) p −0.26 (−0.73: 0.21) p 0.01 (−0.004: 0.02) p 0.03 (−0.0008: 0.07) p Creatinine 20.97 (−4.99: 46.93) p 0.56 (−5.99: 7.12) p −6.99 (15.08: 1.10) p 0.58 (0.29: 0.87) p 0.72 (0.14: 1.31) p SF-36 99.46 (89.44: 109.49) p 1.35 (−1.18: 3.89) p 6.31 (3.19: 9.43) p −0.15 (−0.26: −0.04) p 0.17 (−0.05: 0.40) p Reference—indicating the reference category in the regression model; β—regression coefficient; CI—confidence interval (−95% CI; +95% CI); p p Abbreviations 3 3 4. Discussion The present study shows that, while rs2228570 ( FokI 9 p 9 p p p p p p p p 3 p 20 Mechanistically, rs2228570 shifts the translation start site of VDR 10 17 VDR 1 2 VDR 10 17 3 1 2 The analysis of health-related quality of life (SF-36) reveals an intriguing paradox. The statistically significant association of the TT genotype with higher SF-36 scores, despite being linked to a higher level of an inflammatory marker (CRP), suggests that our current understanding of the FokI 21 13 17 22 23 24 VDR 11 17 19 25 Clinically, the magnitude of the TT–CRP difference (≈11 mg/L) is potentially meaningful for perioperative risk profiling, and the fact that signals are detectable in first-line tests (complete blood count, CRP) favors translational applicability. Key covariates (age, BMI) demonstrated systematic associations with several endpoints, underscoring the importance of covariate control and the possibility of residual confounding despite adjustment [ 26 2 3 VDR 11 17 27 3 28 29 30 This study has several limitations. Heterogeneity in surgical indications, preoperative status, and other unmeasured factors may have influenced inflammatory readouts, and residual confounding cannot be excluded despite adjustment for age, BMI, and comorbidities. Additional determinants of vitamin D biology—such as seasonality, supplementation, and vitamin D-binding protein may have influenced genotype–ligand associations [ 13 25 31 32 33 34 2 3 VDR By integrating genetic, biochemical, and patient-reported outcomes, our study underscores both the potential and the challenges of translating vitamin D biology into personalized perioperative care, in line with the broader controversies highlighted in the current debate on vitamin D. Clinically, our findings suggest that VDR rs2228570 genotyping could complement routine laboratory tests such as CRP and complete blood count in perioperative care [ 35 5. Conclusions Our study shows that the VDR VDR Disclaimer/Publisher’s Note: Author Contributions Conceptualization, D.L., R.R. and A.G.; methodology, D.L., W.D. and A.S.; software, K.C.; validation, D.L., R.T. and W.D.; formal analysis, D.L., K.C. and R.R.; investigation, D.L. and R.R.; resources, D.L. and R.R.; data curation, D.L.; writing—original draft preparation, D.L., R.R. and A.G.; writing—review and editing, D.L., R.R., A.G., J.C. and A.S.-P.; visualization, K.C. and D.L.; supervision, A.G.; project administration, D.L. and R.R.; funding acquisition, A.G. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was conducted according to the guidelines of the Bioethics Committee of the Pomeranian Medical University in Szczecin (permit number: KB-006/16/2022) approved on 13 April 2022. Informed Consent Statement All participants gave written informed consent before joining the study. Data Availability Statement The data presented in this study are available on request from the corresponding author. The data are not publicly available due to privacy concerns. Conflicts of Interest The authors declare no conflicts of interest. References 1. Charoenngam N. Holick M.F. Immunologic Effects of Vitamin D on Human Health and Disease Nutrients 2020 12 2097 10.3390/nu12072097 32679784 PMC7400911 2. Khammissa R.A.G. Fourie J. Dheda K. Feller L. Raubenheimer E.J. Lemmer J. Altini M. The Biological Activities of Vitamin D and Its Receptor in Relation to Calcium and Bone Homeostasis, Cancer, Immune and Cardiovascular Systems, Skin Biology, and Oral Health Biomed Res. Int. 2018 2018 9276380 10.1155/2018/9276380 29951549 PMC5987305 3. Jeon S.M. Shin E. Exploring vitamin D metabolism and function in cancer Exp. Mol. Med. 2018 50 165 10.1038/s12276-018-0038-9 29657326 PMC5938036 4. Miyamoto K. Kesterson R.A. Yamamoto H. Taketani Y. Nishiwaki E. Tatsumi S. Inoue Y. Morita K. Takeda E. Pike J.W. Structural Organization of the Human Vitamin D Receptor Chromosomal Gene and Its Promoter Mol. Endocrinol. 1997 11 1165 1179 10.1210/mend.11.8.9951 9212063 5. Ensembl Genome Browser VDR Gene (ENSG00000111424) Available online: https://www.ensembl.org/id/ENSG00000111424 (accessed on 14 August 2025) 6. UCSC Genome Browser VDR Gene Details (hg38) Available online: https://genome.ucsc.edu/cgi-bin/hgGene?db=hg38&hgg_gene=VDR&hgg_type=knownGene (accessed on 14 August 2025) 7. Usategui-Martín R. De Luis-Román D.-A. Fernández-Gómez J.M. Ruiz-Mambrilla M. Pérez-Castrillón J.-L. Vitamin D Receptor (VDR) Gene Polymorphisms Modify the Response to Vitamin D Supplementation: A Systematic Review and Meta-Analysis Nutrients 2022 14 360 10.3390/nu14020360 35057541 PMC8780067 8. Agliardi C. Guerini F.R. Bolognesi E. Zanzottera M. Clerici M. VDR Gene Single Nucleotide Polymorphisms and Autoimmunity: A Narrative Review Biology 2023 12 916 10.3390/biology12070916 37508347 PMC10376382 9. Gross C. Krishnan A.V. Malloy P.J. Eccleshall T.R. Zhao X.-Y. Feldman D. The Vitamin D Receptor Gene Start Codon Polymorphism: A Functional Analysis of FokI Variants J. Bone Miner. Res. 1998 13 1691 1699 10.1359/jbmr.1998.13.11.1691 9797477 10. Alimirah F. Peng X. Murillo G. Mehta R.G. Functional Significance of Vitamin D Receptor FokI Polymorphism in Human Breast Cancer Cells PLoS ONE 2011 6 e16024 10.1371/journal.pone.0016024 21283672 PMC3025916 11. Van Etten E. Verlinden L. Giulietti A. Ramos-Lopez E. Branisteanu D.D. Ferreira G.B. Overbergh L. Verstuyf A. Bouillon R. Badenhoop K. The Vitamin D Receptor Gene FokI Polymorphism: Functional Consequences in Immune Cells Eur. J. Immunol. 2007 37 395 405 10.1002/eji.200636043 17274004 12. Apaydın M. Beysel S. Eyerci N. Genc H. Yildiz B.O. Aydin O. A VDR Gene FokI Polymorphism Is Associated with Gestational Diabetes Mellitus in Turkish Women BMC Med. Genet. 2019 20 82 10.1186/s12881-019-0820-0 31096931 PMC6524275 13. Menezes-Junior L. Sabião T.S. Moura S.S. Batista A.P. de Menezes M.C. Carraro J.C.C. Machado-Coelho G.L.L. Meireles A.L. The role of interaction between vitamin D and VDR FokI gene polymorphism (rs2228570) in sleep quality of adults Sci. Rep. 2024 14 8141 10.1038/s41598-024-58561-2 38584183 PMC10999418 14. Techapatiphandee M. Tammachote N. Tammachote R. Wongkularb A. Yanatatsaneejit P. VDR and TNFSF11 polymorphisms are associated with osteoporosis in Thai patients Biomed. Rep. 2018 9 350 356 10.3892/br.2018.1137 30233789 PMC6142033 15. Reis C. Guerra K.C.C. Barbosa M.C. Ferreira F.F. de Lima D.C. Segato R.A.B. de Almeida A.C.P. Matsumoto M.A.N. Filho F.B. de Menezes M.A.H. Impact of FokI (rs2228570) and BglI (rs739837) polymorphisms in VDR gene on permanent tooth eruption: A cross-sectional study J. Oral Biol. Craniofac. Res. 2024 14 700 705 10.1016/j.jobcr.2024.09.012 39399142 PMC11470262 16. Moura S.S. Menezes-Junior L. Sabião T.S. de Menezes M.C. Machado-Coelho G.L.L. Carraro J.C.C. Meireles A.L. Vitamin D deficiency and VDR gene polymorphism FokI (rs2228570) are associated with diabetes mellitus in adults: COVID-inconfidentes study Diabetol. Metab. Syndr. 2024 16 118 10.1186/s13098-024-01328-6 38812030 PMC11137993 17. Liu K. Han B. Meng H. Hou J. Influence of rs2228570 on Transcriptional Activation by the Vitamin D Receptor in Human Gingival Fibroblasts and Periodontal Ligament Cells J. Periodontol. 2017 88 915 925 10.1902/jop.2017.170030 28492361 18. Zong Q. Ni D. Li L. Shi Y. Association of rs2228570 polymorphism of vitamin D receptor gene with degenerative disc disease: A meta-analysis involving 2947 subjects Int. J. Clin. Exp. Med. 2015 8 22108 22116 26885185 PMC4729971 19. Ilieș R. Aioanei C. Halmágyi S. Catană A. Lukacs I. Tőkés R.-E. Rotar I. Pop I. Influence of Vitamin D Receptor Polymorphism rs2228570 on Pathological Scarring Exp. Ther. Med. 2022 23 345 10.3892/etm.2022.11264 35401803 PMC8987945 20. Płudowski P. Kos-Kudła B. Walczak M. Fal A. Zozulińska-Ziółkiewicz D. Sieroszewski P. Peregud-Pogorzelski J. Lauterbach R. Targowski T. Lewiński A. Guidelines for Preventing and Treating Vitamin D Deficiency: A 2023 Update in Poland Nutrients 2023 15 695 10.3390/nu15030695 36771403 PMC9920487 21. Glocke M. Lang F. Schaeffeler E. Lang T. Schwab M. Lang U. Impact of Vitamin D Receptor VDR rs2228570 Polymorphism in Oldest Old Kidney Blood Press. Res. 2013 37 311 322 10.1159/000350159 24060611 22. Kempinska-Podhorodecka A. Adamowicz M. Chmielarz M. Janik M.K. Milkiewicz P. Milkiewicz M. Vitamin-D Receptor-Gene Polymorphisms Affect Quality of Life in Patients with Autoimmune Liver Diseases Nutrients 2020 12 2244 10.3390/nu12082244 32727130 PMC7469002 23. Agliardi C. Guerini F. Zanzottera M. Bolognesi E. Meloni M. Riboldazzi G. Zangaglia R. Sturchio A. Casali C. Lorenzo C. The VDR FokI (rs2228570) polymorphism is involved in Parkinson’s disease J. Neurol. Sci. 2021 428 117606 10.1016/j.jns.2021.117606 34365149 24. Hu W. Wang L. Chen B. Wang X. Vitamin D receptor rs2228570 polymorphism and Parkinson’s disease risk in a Chinese population Neurosci. Lett. 2019 717 134722 10.1016/j.neulet.2019.134722 31877334 25. Uehara S. Hirai K. Shirai T. Otaki H. Akamatsu T. Itoh K. Vitamin D Receptor rs2228570 Gene Polymorphism Is Associated with Asthma Severity and Exacerbations Biol. Pharm. Bull. 2025 48 86 92 10.1248/bpb.b24-00684 39894560 26. Alzaim M. Ansari M. Al-Masri A. Khattak M. Alamro A. Alghamdi A. Alenad A. Alokail M. Al-attas O. Al-Zahrani A. Association of VDR gene variant rs2228570-FokI with gestational diabetes mellitus susceptibility in Arab women Heliyon 2024 10 e32048 10.1016/j.heliyon.2024.e32048 38882352 PMC11177144 27. Ozdogan S. Yaltırık C. Yilmaz S.G. Koçak A. Isbir T. Association of rs2228570 Polymorphism of Vitamin D Receptor Gene with Lumbar Degenerative Disc Disease Turk. Neurosurg. 2019 29 159 163 10.5137/1019-5149.JTN.22275-17.2 29569696 28. Radwan R.A. Elsalakawy W. Abdelaziz D.M. Abdelrazek D.M. Radwan S.M. BsmI, ApaI and FokI Variants of Vitamin D Receptor Gene Polymorphism as Predictors of Response to Treatment in Immune Thrombocytopenia Patients Mol. Cell. Biochem. 2024 480 1919 1929 10.1007/s11010-024-05100-2 39312029 29. Shaikh P. Nakashidze I. Vitamin D Levels and VDR rs2228570 Genetic Variant in Autoimmune Thyroiditis Sanamed 2023 18 217 222 10.5937/sanamed0-46407 30. Fiaz H. Khan A.R. Abbas S. Bilal A. Khan H. Hussain M. Awan F. Association of vitamin D receptor polymorphisms with cardiometabolic conditions in Pakistani population Int. J. Vitam. Nutr. Res. 2022 94 45 53 10.1024/0300-9831/a000772 36520094 31. Zhu A. Kuznia S. Boakye D. Schöttker B. Brenner H. Vitamin D-Binding Protein, Bioavailable, and Free 25(OH)D, and Mortality: A Systematic Review and Meta-Analysis Nutrients 2022 14 3894 10.3390/nu14193894 36235547 PMC9571577 32. Heo J.E. Shin J.Y. Park S.J. Park S.E. Park J. Kim Y.J. Song J. Kim S.H. Oh B. Kim Y.J. Total, Bioavailable, and Free 25-Hydroxyvitamin D and Their Association with Bone Parameters in Korean Children PLoS ONE 2021 16 e0258585 10.1371/journal.pone.0258585 34648586 PMC8516284 33. Zhu A. Kuznia S. Niedermaier T. Holleczek B. Schöttker B. Brenner H. Vitamin D–Binding Protein, Total, “Nonbioavailable,” Bioavailable, and Free 25-Hydroxyvitamin D, and Mortality in a Large Population-Based Cohort of Older Adults J. Intern. Med. 2022 292 463 476 10.1111/joim.13494 35373871 34. Jorde R. Grimnes G. Hutchinson M.S. Kubiak J. Figenschau Y. Svartberg J. The Role of Free 25-Hydroxyvitamin D in the Association between Vitamin D and Mortality: The Tromsø Study Front. Endocrinol. 2019 10 79 10.3389/fendo.2019.00079 35. Bašić J. Vojinović J. Jevtović-Stoimenov T. Despotović M. Sušić G. Lazarević D. Milošević V. Cvetković M. Pavlović D. Vitamin D receptor gene polymorphism influences lipid profile in patients with juvenile idiopathic arthritis Clin. Rheumatol. 2018 38 117 124 10.1007/s10067-018-4264-2 30128913 nutrients-17-02926-t001_Table 1 Table 1 Hardy–Weinberg equilibrium analysis for orthopedic surgery patients and the control group, calculated with bias-adjusted HWE software. rs2228570 FokI Observed (Expected) Allele Freq χ 2 p Patients undergoing CC 97 (99.2) p (C) = 0.57 0.2671; p CT 151 (146.6) TT 52 (54.2) Control; CC 61 (62.2) p (C) = 0.56 0.1108; p CT 101 (98.7) TT 38 (39.2) p 2 nutrients-17-02926-t002_Table 2 Table 2 Comparison of the rs2228570 FokI  Patients Undergoing Control; χ 2 p CC—n (%) 97 (32.33%) 61 (30.50%) 0.3134; p CT—n (%) 151 (50.33%) 101 (50.50%) TT—n (%) 52 (17.33%) 38 (19.00%) C—n (%) 345 (57.5%) 223 (55.75%) 0.2995; p T—n (%) 255 (42.5%) 177 (44.25%) p 2 nutrients-17-02926-t003_Table 3 Table 3 Comparison of the rs2228570 FokI Sex M = 113 K = 187 χ 2 p CC N (%) 40 (35.40%) 57 (30.48%) 0.9645; p CT N (%) 53 (46.90%) 98 (52.41%) TT N (%) 20 (17.70%) 32 (17.11%)  Smoking status  Yes = 31  No = 269 1.6151; p CC N (%) 12 (38.71%) 85 (31.60%) CT N (%) 16 (51.61%) 135 (50.19%) TT N (%) 3 (9.68%) 49 (18.22%)  Hypertension  Yes = 197  No = 103 2.7394: p CC N (%) 66 (33.50%) 31 (30.10%) CT N (%) 102 (51.78%) 49 (47.57%) TT N (%) 29 (14.72%) 23 (22.33%)  Diabetes mellitus  Yes = 59  No = 241 0.2426; p CC N (%) 20 (33.90%) 77 (31.95%) CT N (%) 30 (50.85%) 121 (50.21%) TT N (%) 9 (15.25%) 43 (17.84%) ",
  "metadata": {
    "Title of this paper": "Vitamin D receptor gene polymorphism influences lipid profile in patients with juvenile idiopathic arthritis",
    "Journal it was published in:": "Nutrients",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472729/"
  }
}