{
  "title": "Paper_958",
  "abstract": "pmc Pharmaceutics Pharmaceutics 2103 pharmamdpi pharmaceutics Pharmaceutics 1999-4923 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473349 PMC12473349.1 12473349 12473349 41012537 10.3390/pharmaceutics17091201 pharmaceutics-17-01201 1 Article Pancreatic Cancer-Targeting Cascade Nanoamplifier Enables Self-Replenishing H 2 2 https://orcid.org/0009-0008-6144-0743 Yu Jiaqi Software Resources Data curation Writing – original draft 1 † Feng Lishuai Conceptualization Software Writing – original draft 1 † Tang Yunpeng Validation Formal analysis Resources 1 Yu Nianhui Methodology Validation Visualization 1 Lin Jianning Formal analysis Investigation Data curation 1 Ji Yuan Conceptualization Methodology Project administration 2 * Li Hui Conceptualization Methodology Writing – review & editing Supervision Funding acquisition 1 * Vandamme Thierry Academic Editor Chytil Petr Academic Editor 1 yujiaqi1997@alumni.sjtu.edu.cn fls1991@sjtu.edu.cn maya_xka@sjtu.edu.cn ynh19971007@alumni.sjtu.edu.cn linjn2220@sjtu.edu.cn 2 * ji.yuan@zs-hospital.sh.cn drlihui@sjtu.edu.cn † These authors contributed equally to this work. 16 9 2025 9 2025 17 9 497664 1201 13 7 2025 29 7 2025 02 9 2025 16 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives: 2 2 Methods: 2 2 2 2 v 3 Results: 2 2 2 2 Conclusions: 2 2 pancreatic cancer chemodynamic therapy manganese dioxide hydrogen peroxide autophagy National Natural Science Foundation of China 82471975 81871324 Shanghai Jiao Tong University Affiliated Sixth People’s Hospital This research was funded by the National Natural Science Foundation of China (No. 82471975, 81871324). The APC was funded by Shanghai Jiao Tong University Affiliated Sixth People’s Hospital. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Pancreatic cancer is one of the most aggressive and lethal malignancies, characterized by an insidious onset, rapid progression, and extremely poor prognosis, with a 5-year survival rate of less than 5% [ 1 2 Chemodynamic therapy (CDT) has emerged as a promising strategy, leveraging hallmark features of the TME, such as acidic pH, hypoxia, abnormal vasculature, and elevated levels of hydrogen peroxide (H 2 2 3 4 5 6 7 8 9 2 2 10 11 12 13 14 15 16 17 2 2 Herein, we designed a cascade nanoamplifier-targeting pancreatic cancer to enhance the therapeutic efficacy of CDT. This multifunctional nanoamplifier, termed H-MnO 2 Scheme 1 2 2+ 2 18 19 20 2 2 2 2+ 2 2 2 2 21 22 23 24 25 26 27 v 3 28 29 30 31 32 To initiate the cascade, the H-MnO 2 2 2. Materials and Methods 2.1. Materials Chloroquine (CQ) was purchased from Sigma-Aldrich (St. Louis, MO, USA). The bifunctional cyclic peptide iRGD was obtained from MedChemExpress (Monmouth Junction, NJ, USA). Glucose (Glu), glucose oxidase (GOX), 2,2′-azino-bis(3-ethylbenzothiazoline-6-sulfonic acid) diammonium salt (ABTS), horse-radish peroxidase (HRP), and methylene blue (MB) were all sourced from Sigma-Aldrich (St. Louis, MO, USA), unless otherwise stated. Additionally, methylene blue (MB) was supplied by Shanghai Macklin Biochemical Co., Ltd. (Shanghai, China). Cell culture medium and fetal bovine serum (FBS) were procured from Gibco (Waltham, MA, USA), whereas trypsin and penicillin–streptomycin solution were acquired from Yeasen Bio-technology Co., Ltd. (Shanghai, China). Dihydroethidium (DHE) and p62 antibody were purchased from Beyotime Biotechnology (Shanghai, China). High-glucose Dulbecco’s Modified Eagle Medium (DMEM) base medium was obtained from Hyclone (Logan, UT, USA). Fluorescent labeling dyes Cy7 and Cy5 were obtained from Bioss (Beijing, China). Human pancreatic cancer cell line (PANC-1) was obtained from the Cell Bank of the Chinese Academy of Sciences (Shanghai, China). Female Balb/c nude mice were purchased from Shanghai SLAC Laboratory Animal Co., Ltd. (Shanghai, China). Transmission electron microscope (Tecnai G2 20, ThermoFisher Scientific, Waltham, MA, USA) and field emission transmission electron microscope (Tecnai G2 F20 S-Twin, ThermoFisher Scientific, Waltham, MA, USA) were employed for internal structural characterization, while a field emission scanning electron microscope (Ultra 55, Carl Zeiss, Oberkochen, Germany) was used to observe surface morphology. Fourier-transform infrared spectrometer (Nicolet 6700, ThermoFisher Scientific, Waltham, MA, USA), X-ray diffractometer (Bruker D8, Bruker, Billerica, MA, USA), ultraviolet–visible spectrophotometer (UV-2600, Shimadzu, Kyoto, Japan), X-ray photoelectron spectrometer (PHI 5300, Physical Electronics, Chanhassen, MN, USA), and inductively coupled plasma optical emission spectrometer (iCAP 7400, ThermoFisher Scientific, Waltham, MA, USA) were used for physicochemical analysis. A nanoparticle size and zeta potential analyzer (Zetasizer Nano ZS90, Malvern Panalytical, Malvern, Worcestershire, UK) and an automated surface area and porosity analyzer (AUTOSORB-IQ, Quantachrome Instruments [now Anton Paar QuantaTec], Boynton Beach, FL, USA) were applied to evaluate colloidal stability and pore structures. A headspace residual oxygen analyzer (OXY-1STDZ, PreSens, Regensburg, Germany) was used to monitor oxygen generation. Confocal laser scanning microscope (Olympus, Tokyo, Japan) and inverted microscope (Nikon, Tokyo, Japan) were employed for cellular imaging, while a Western blot electrophoresis system (Bio-Rad, Hercules, CA, USA) and protein band imaging system (Bio-Rad, Hercules, CA, USA) were used for protein expression analysis. A small animal in vivo imaging system (LB983, Berthold Technologies, Bad Wildbad, Germany) was utilized to monitor nanoparticle biodistribution in mice. Additional supporting equipment included an ultrasonic cleaner (Ningbo Qingzhi Biotechnology Co., Ltd., Ningbo, China), a high-speed centrifuge (Xiangyi, Hunan, China), a freeze dryer (Ningbo Qingzhi Biotechnology Co., Ltd., Ningbo, China), a thermostatic water bath (HWS-12, Yiheng, Shanghai, China), an ultraclean workbench (Shanghai Yuejin Medical Equipment Co., Ltd., Shanghai, China), and a single-channel syringe pump (LSP01-2A, Longer Pump, Baoding, China). 2.2. Methodology 2.2.1. Construction and Characterization of H-MnO 2 Initially, SiO 2 2 Next, the as-prepared SiO 2 4 2 2 The product was then dispersed in mL of 1 M Na 2 3 2 2 33 34 The internal structure and elemental distribution of H-MnO 2 SiO 2 2 2 2 2 2 Different concentrations of GOX (750 μg/mL) and CQ (500 μg/mL) in DMSO were added to 20 mL of H-MnO 2 2 Next, 5 mL of polyacrylic acid (PAA) aqueous solution (10 mg/mL) was added to 10 mL of H-MnO 2 2 Then, 5 mg of 1-ethyl-3-(3-dimethylaminopropyl)carbodiimide (EDC) and 3.5 mg of 4-dimethylaminopyridine (DMAP) were added, and the mixture was reacted in the dark at 300 rpm for 2 h to activate the carboxyl groups. After centrifugation at 13,000 rpm for 10 min, 10 mL of iRGD solution (1 mg/mL) was added and stirred in the dark for 24 h. The product was collected by centrifugation at 13,000 rpm for 10 min and washed three times with deionized water to obtain H-MnO 2 35 36 37 Finally, the synthesized manganese-based CDT amplifier, H-MnO 2 2.2.2. Detection of O 2 2 2 2+ 2 The oxygen-generating capacity of H-MnO 2 2 2 2 2 2 2 For H 2 2 2 2+ 2 2+ For ·OH generation analysis, 1 mL of each group solution was mixed with 1 mL of glucose solution (10 μg/mL), 25 μL of NaHCO 3 The release profiles of Mn 2+ 2 2 2 2 2 2 2 2+ 2.2.3. Therapeutic Study of H-MnO 2 The cytotoxicity of H-MnO 2 2 PANC-1 cells were then seeded into 96-well plates at a density of 1 × 10 5 2 2 2 2 2 After incubation, the medium was removed, and 100 μL of fresh medium and 100 μL of MTT solution (1 mg/mL) were added to each well. The cells were incubated for another 4 h. The absorbance at 490 nm was measured using a microplate reader to quantify MTT reduction, reflecting cellular metabolic activity. Additionally, to evaluate the tumoricidal activity of H-MnO 2 2 2 2 2 2 In 10 mL of H-MnO 2 2 2 2 2 PANC-1 cells were seeded into confocal culture dishes at a density of 3 × 10 5 2 PANC-1 cells were seeded into 24-well plates at a density of 5 × 10 4 2 2 2 2 For intracellular ROS detection, a separate set of fixed cells from each group was incubated with DHE for 10 min, followed by washing three times with PBS. The cells were then imaged using confocal microscopy to assess intracellular ROS levels. For total cellular protein extraction, 200 μL of radioimmunoprecipitation assay (RIPA) lysis buffer was added to each tube of treated cells, followed by pipetting approximately 200 times to ensure thorough lysis. The lysates were centrifuged at 12,000 rpm for 10 min at 4 °C. The supernatants were collected and stored at –80 °C for subsequent Western Blot analysis. 2.2.4. Imaging and Therapeutic Evaluation of H-MnO 2 Healthy female nude mice (6 weeks old) were intravenously injected via the tail vein with H-MnO 2 To evaluate therapeutic efficacy, we employed a subcutaneous PANC-1 pancreatic tumor model by injecting PANC-1 cells into the right forelimb of BALB/c nude mice. For in vivo imaging, 100 μL of H-MnO 2 2 Once tumors reached approximately 100 mm 3 n 2 2 2 2 At the end of four weeks, the surviving mice were sacrificed. Major organs, including the heart, liver, spleen, lungs, kidneys, as well as the tumors, were harvested. The collected tissues were subjected to H&E staining, terminal deoxynucleotidyl transferase dUTP nick end labeling (TUNEL) staining, and immunohistochemical analysis of CD68, MCP-1, MPO, and TGF-β in pancreatic tumor tissues. For all quantitative experiments, unless otherwise specified, each experiment was independently repeated three times ( n 2.3. Statistical Analysis All experiments were conducted independently at least three times to ensure reproducibility and reliability. Data were analyzed using GraphPad Prism software version 9.0 (GraphPad Software, Inc., San Diego, CA, USA). Statistical analysis was performed using one-way or two-way ANOVA, followed by appropriate multiple comparison tests, depending on the experimental design. The significance level is set as the probability of * p p p p 3. Results 3.1. Construction and Characterization of the Cascade Nanoamplifier The cascade nanoamplifier was synthesized by first preparing monodisperse SiO 2 2 2 4 2 2 2 Figure S1A–D Figure S1E–G 2 2 2 2 Figure S1H 2 2 2 2 2 Figure S1I 2 Figure S1J Figure S1K 2 Figure S1L 1 2 3 2 Figure S1M Figure S1N 2 In subsequent steps, the multifunctional H-MnO 2 Figure 1 2 Figure S2A,B 2 2 Comprehensive characterization confirmed successful assembly of the nanoplatform. FTIR spectra exhibited clear changes in surface functional groups at each stage of modification ( Figure 1 2 Figure 1 Figure 1 Figure S2C–F 2 38 Figure 1 3.2. TME-Induced Shell Collapse and Enhanced Fenton Reaction of the Cascade Nanoamplifier (Solution Level) To investigate the TME-responsiveness of the system, we simulated the pancreatic TME (pH 6.5, ~100 μM H 2 2 39 40 41 2 2 2 2 2 Figure 2 Based on these findings, we further evaluated the release behavior of Mn 2+ 2 2 2 2 2 Figure S3A 2+ 2 2+ 2 2 2 2 Figure 2 2 2 2 Figure S3B,C To address the TME-hypoxic limitation of GOX-mediated H 2 2 2 2 2 2 Figure 2 2 2 2 To assess the catalytic performance of the cascade nanoamplifier in generating H 2 2 2 2 Figure 2 2 2 2 2 2 2 2 Building on this finding, we further investigated the system’s ability to produce hydroxyl radicals (∙OH) under simulated TME conditions. Methylene blue (MB), a classical ∙OH-sensitive probe, was used to monitor ∙OH generation. Hydroxylation of MB by ∙OH leads to a decrease in its characteristic absorbance at 664 nm. As shown in Figure 2 2 2 Figure 2 Collectively, these results demonstrated that the cascade nanoamplifier can effectively disintegrate in the pancreatic TME and significantly enhance the Fenton reaction at the solution-level. These results inspired to further study of its performance at the cellular-level. 3.3. Pancreatic Cancer Cell-Specific Cascade Nanoamplifier Enhances CDT (Cellular Level) The above solution-phase studies demonstrated that the manganese-based CDT nanoamplifier H-MnO 2 2 2 2 2 To validate these effects at the cellular level, we investigated the in vitro performance of H-MnO 2 2 2 Figure 3 2 2 To assess cellular uptake, the nanoparticles were labeled with Cy5 (10 μg/mL) and incubated with PANC-1 cells for 1, 2, and 3 h. Nuclear staining with DAPI was performed to visualize internalization ( Figure 3 We next evaluated intracellular H 2 2 Figure 3 2 2 2 2 2 To examine the role of CQ in inhibiting autophagy, we analyzed the accumulation of P62, an autophagy substrate protein that accumulates when autophagic flux is blocked. Immunofluorescence staining and Western blotting of P62 ( Figure 3 42 Finally, we systematically evaluated the overall cytotoxic efficacy of the nanoplatform using the CCK-8 assay ( Figure 3 2 2 2 2 2 2 3.4. Cascade Nanoamplifier-Enhanced CDT for Pancreatic Cancer in Animal Models (In Vivo Level) Encouraged by the promising in vitro results, we further investigated the tumor-targeting capability and therapeutic efficacy of H-MnO 2 2 Figure S4 2 We further investigated the tumor-targeting capacity and therapeutic efficacy of H-MnO 2 2 Figure 4 2 To evaluate therapeutic efficacy, we randomly assigned PANC-1 subcutaneous model mice of pancreatic tumors to five treatment groups ( n 2 2 2 2 Figure 4 2 2 2 2 2 2 2 2 2 2 2 2 Figure 4 Throughout the treatment period, no significant changes in body weight were observed across the groups. At the conclusion of the 28-day study, surviving animals were sacrificed, and their tumors and major organs (heart, liver, spleen, lung, and kidney) were collected for histological examination, histological analysis of tumor tissues via H&E and TUNEL staining revealed clear differences across groups. In the control and H-MnO 2 2 2 2 Figure 4 Figure 4 2 2 2 2 Figure S5 2 4. Conclusions Pancreatic cancer remains one of the most challenging malignancies due to the lack of effective therapeutic options, underscoring the urgent need for innovative strategies. We developed a TME-responsive CDT nanoamplifier—H-MnO 2 2 2 2 2 2+ 2 Acknowledgments During the preparation of this manuscript, the authors used gpt4o for the purposes of generating text. The authors have reviewed and edited the output and take full responsibility for the content of this publication. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/pharmaceutics17091201/s1 2 2 2 2 Author Contributions Conceptualization, H.L., J.Y. and Y.J.; methodology, J.Y., L.F. and Y.T.; validation, N.Y.; formal analysis, J.Y., N.Y. and H.L.; investigation, Y.T. and J.L.; resources, J.Y. and Y.T.; data curation, N.Y.; writing—original draft preparation, J.Y., L.F. and N.Y.; writing—review and editing, H.L. and Y.J.; supervision, H.L.; project administration, H.L. and Y.J.; funding acquisition, H.L. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The animal study protocol was approved by the Institutional Animal Ethics Committee of Shanghai Jiao Tong University Affiliated Sixth People’s Hospital (Approval No. 2024-0460, 27 February 2024). Informed Consent Statement Not applicable. Data Availability Statement The original contributions presented in this study are included in this article/ Supplementary Material Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: GOX glucose oxidase CQ chloroquine TME tumor microenvironment CDT chemodynamic therapy GSH glutathione PEI polyethyleneimine ROS reactive oxygen species BPEI branched polyethyleneimine References 1. Siegel R.L. Miller K.D. Wagle N.S. Jemal A. Cancer statistics CA A Cancer J. Clin. 2023 73 17 48 36633525 10.3322/caac.21763 2. Ho W.J. Jaffee E.M. Zheng L. The tumour microenvironment in pancreatic cancer—Clinical challenges and opportunities Nat. Rev. Clin. Oncol. 2020 17 527 540 10.1038/s41571-020-0363-5 32398706 PMC7442729 3. Tang Z. Zhao P. Wang H. Liu Y. Bu W. Biomedicine meets Fenton chemistry Chem. Rev. 2021 121 1981 2019 10.1021/acs.chemrev.0c00977 33492935 4. Nie R. Jia Q. Li Y. Tumor Microenvironment Activated Vanadium−Doped Carbon Dots for Fluorescence Imaging and Chemodynamic Therapy Crystals 2023 13 652 10.3390/cryst13040652 5. Ma Y. Yan C. Guo Z. Tan G. Niu D. Li Y. Zhu W.H. Spatio-Temporally Reporting Dose-Dependent Chemotherapy via Uniting Dual-Modal MRI/NIR Imaging Angew. Chem. Int. Ed. 2020 59 21143 21150 10.1002/anie.202009380 32729980 6. Shi L. Zhang P. Liu X. Li Y. Wu W. Gao X. Liu B. An activity-based photosensitizer to reverse hypoxia and oxidative resistance for tumor photodynamic eradication Adv. Mater. 2022 34 2206659 10.1002/adma.202206659 36106613 7. Xie W. Zhang G. Guo Z. Lu J. Ye J. Xu W. Gao X. Yue K. Wei Y. Zhao L. Ultra-sensitive iron-doped Palladium nanocrystals with enhanced hydroxyl radical generation for chemo-/chemodynamic Nanotherapy Adv. Funct. Mater. 2022 32 2107518 10.1002/adfm.202107518 8. Ding Y. Xu H. Xu C. Tong Z. Zhang S. Bai Y. Chen Y. Xu Q. Zhou L. Ding H. A nanomedicine fabricated from gold nanoparticles-decorated metal–organic framework for cascade chemo/chemodynamic cancer therapy Adv. Sci. 2020 7 2001060 10.1002/advs.202001060 PMC7507500 32995124 9. Cheng B. Li D. Li C. Zhuang Z. Wang P. Liu G. The Application of Biomedicine in Chemodynamic Therapy: From Material Design to Improved Strategies Bioengineering 2023 10 925 10.3390/bioengineering10080925 37627810 PMC10451538 10. Zhang H. Chen Y. Hua W. Gu W. Zhuang H. Li H. Jiang X. Mao Y. Liu Y. Jin D. Heterostructures with built-in electric fields for long-lasting chemodynamic therapy Angew. Chem. Int. Ed. 2023 62 e202300356 10.1002/anie.202300356 36780170 11. Zhao P. Li H. Bu W. A forward vision for chemodynamic therapy: Issues and opportunities Angew. Chem. Int. Ed. 2023 62 e202210415 10.1002/anie.202210415 36650984 12. Dirersa W.B. Kan T.C. Chang J. Getachew G. Ochirbat S. Kizhepat S. Wibrianto A. Rasal A. Chen H. Ghule A.V. Engineering H 2 2 ACS Appl. Mater. 2024 16 24172 24190 10.1021/acsami.3c18888 PMC11103653 38688027 13. Yu P. Li X. Cheng G. Zhang X. Wu D. Chang J. Wang S. Hydrogen peroxide-generating nanomedicine for enhanced chemodynamic therapy Chin. Chem. Lett. 2021 32 2127 2138 10.1016/j.cclet.2021.02.015 14. Yang B. Ding L. Yao H. Chen Y. Shi J. A Metal-Organic Framework (MOF) Fenton Nanoagent-Enabled Nanocatalytic Cancer Therapy in Synergy with Autophagy Inhibition Adv. Master 2020 32 e1907152 10.1002/adma.201907152 32053261 15. Jiao Y. Wang H. Wang H. Xie Y. Shang Y. Wu Y. Guo X. Yu S. Li N. Ding B. A DNA origami–based enzymatic cascade nanoreactor for chemodynamic cancer therapy and activation of antitumor immunity Sci. Adv. 2025 11 eadr9196 10.1126/sciadv.adr9196 39772676 PMC11708878 16. Huang P. Gao W. Fu C. Wang M. Li Y. Chu B. He A. Li Y. Deng X. Zhang Y. Clinical functional proteomics of intercellular signalling in pancreatic cancer Nature 2025 637 726 735 10.1038/s41586-024-08225-y 39537929 PMC12091016 17. Elahi-Gedwillo K.Y. Carlson M. Zettervall J. Provenzano P.P. Antifibrotic therapy disrupts stromal barriers and modulates the immune landscape in pancreatic ductal adenocarcinoma Cancer Res. 2019 79 372 386 10.1158/0008-5472.CAN-18-1334 30401713 PMC6335156 18. Wang J. Liu Y.X. Li X.L. Chen H.Y. Xu J.J. Core–shell plasmonic nanomaterials toward: Dual-mode imaging analysis of glutathione and enhanced chemodynamic therapy Anal. Chem. 2021 93 10317 10325 10.1021/acs.analchem.1c01858 34270215 19. Meng Y. Huang J. Ding J. Yan B. Li Y. Gao X. Zhou W. Poly-thymine DNA templated MnO2 biomineralization as a high-affinity anchoring enabling tumor targeting delivery J. Colloid. Interface Sci. 2023 637 441 452 10.1016/j.jcis.2023.01.089 36716668 20. Jin W. Chen Z. Wang Y. Li J. Li J. Pei Y. Pei Z. Nano metal-photosensitizer based on Aza-BODIPY-Cu complex for CDT-enhanced dual phototherapy Chin. Chem. Lett. 2024 3 109328 10.1016/j.cclet.2023.109328 21. Feng L. Xie R. Wang C. Gai S. He F. Yang D. Yang P. Lin J. Magnetic Targeting, Tumor Microenvironment-Responsive Intelligent Nanocatalysts for Enhanced Tumor Ablation Angew. Chem. Int. Ed. 2018 12 11000 11012 10.1021/acsnano.8b05042 30339353 22. Sang Y. Cao F. Li W. Zhang L. You Y. Deng Q. Dong K. Ren J. Qu X. Bioinspired Construction of a Nanozyme-Based H 2 2 J. Am. Chem. Soc. 2020 142 5177 5183 10.1021/jacs.9b12873 32100536 23. Ren H. Bai Y. Liu Z. Ma C. Tao X. Wang Q. Lian H. Li X. A multifunctional cascade gas-nanoreactor with MnO 2 Acta Biomater. 2024 190 501 517 10.1016/j.actbio.2024.11.004 39521315 24. Wang L. Shi R. Wang S. Duan Y. Wang Z. Zheng P. Sun X. Chen X. Ji G. Shen Y. ADSL promotes autophagy and tumor growth through fumarate-mediated Beclin1 dimethylation Nat. Chem. Biol. 2020 21 894 905 10.1038/s41589-024-01825-9 39881212 25. Dong K. Xu Y. Tang Y. Li Q. Photoactivated Self-Assembled Nanomicelles Integrating Mitophagy Inhibition to Enhance Pyroptosis for Cancer Immunotherapy Adv. Funct. Mater. 2025 2504384 10.1002/adfm.202504384 26. Mauthe M. Orhon I. Rocchi C. Zhou X. Luhr M. Hijlkema K.-J. Coppes R.P. Engedal N. Mari M. Reggiori F. Chloroquine inhibits autophagic flux by decreasing autophagosome-lysosome fusion Autophagy 2018 14 1435 1455 10.1080/15548627.2018.1474314 29940786 PMC6103682 27. Li N. Zhang X. Chen J. Gao S. Wang L. Zhao Y. Perturbation of Autophagy by a Beclin 1-Targeting Stapled Peptide Induces Mitochondria Stress and Inhibits Proliferation of Pancreatic Cancer Cells Cancers 2023 15 953 10.3390/cancers15030953 36765914 PMC9913477 28. Cho H.J. Park S.J. Lee Y.S. Kim S. Theranostic iRGD peptide containing cisplatin prodrug: Dual-cargo tumor penetration for improved imaging and therapy J. Control. Release 2019 300 73 80 10.1016/j.jconrel.2019.02.043 30831135 29. de Mendoza T.H. Mose E.S. Botta G.P. Braun G.B. Kotamraju V.R. French R.P. Suzuki K. Miyamura N. Teesalu T. Ruoslahti E. Tumor-penetrating therapy for β5 integrin-rich pancreas cancer Nat. Commun. 2021 12 1541 10.1038/s41467-021-21858-1 33750829 PMC7943581 30. Li X. Zhong H. Zheng S. Mu J. Yu N. Guo S. Tumor-penetrating iRGD facilitates penetration of poly(floxuridine-ketal)-based nanomedicine for enhanced pancreatic cancer therapy J. Control. Release 2024 369 444 457 10.1016/j.jconrel.2024.04.004 38575076 31. Pan Y. Xue Q. Yang Y. Shi T. Wang H. Song X. Luo Y. Liu W. Ren S. Cai Y. Glycoengineering-based anti-PD-1-iRGD peptide conjugate boosts antitumor efficacy through T cell engagement Cell Rep. Med. 2024 5 101590 10.1016/j.xcrm.2024.101590 38843844 PMC11228665 32. Chen B. Liu X. Li Y. Shan T. Bai L. Li C. Wang Y. iRGD tumor-penetrating peptide-modified nano-delivery system based on a marine sulfated polysaccharide for enhanced anti-tumor efficiency against breast cancer Int. J. Nanomed. 2022 17 617 633 10.2147/IJN.S343902 PMC8842734 35173433 33. Bai X. Meng F. Wang X. He L. Fan C. Tian L. Zhang Y. Pan J. Wu Q. Hao X. Photodynamic gel-bombs enhance tumor penetration and downstream synergistic therapies Signal Transduct. Target. Ther. 2025 10 94 10.1038/s41392-025-02186-y 40102383 PMC11920195 34. Fu L.H. Hu Y.R. Qi C. He T. Jiang S. Jiang C. He J. Qu J. Lin J. Huang P. Biodegradable Manganese-Doped Calcium Phosphate Nanotheranostics for Traceable Cascade Reaction-Enhanced Anti-Tumor Therapy Angew. Chem. Int. Ed. 2019 13 13985 13994 10.1021/acsnano.9b05836 31833366 35. Wang W. Yao S.Y. Luo J. Ding C. Huang Q. Yang Y. Shi Z. Lin J. Pan Y.C. Zeng X. Author Correction: Engineered hypoxia-responsive albumin nanoparticles mediating mitophagy regulation for cancer therapy Nat. Commun. 2025 16 2066 10.1038/s41467-025-57018-y 40021636 PMC11871054 36. Chen X. Jia F. Li Y. Deng Y. Huang Y. Liu W. Jin Q. Ji J. Nitric oxide-induced stromal depletion for improved nanoparticle penetration in pancreatic cancer treatment Biomaterials 2020 246 119999 10.1016/j.biomaterials.2020.119999 32247201 37. Forest V. Cottier M. Pourchez J. Electrostatic interactions favor the binding of positive nanoparticles on cells: A reductive theory Nano Today 2015 10 677 680 10.1016/j.nantod.2015.07.002 38. Shao L. Li Y. Huang F. Wang X. Lu J. Jia F. Pan Z. Cui X. Ge G. Deng X. Complementary autophagy inhibition and glucose metabolism with rattle-structured polydopamine@ mesoporous silica nanoparticles for augmented low-temperature photothermal therapy and in vivo photoacoustic imaging Theranostics 2020 10 7273 7286 10.7150/thno.44668 32641992 PMC7330850 39. Ding J. Xie Y. Liu Z. Zhang Z. Ni B. Yan J. Zhou T. Hao J. Hypoxic and Acidic Tumor Microenvironment-Driven AVL9 Promotes Chemoresistance of Pancreatic Ductal Adenocarcinoma via the AVL9-IκBα-SKP1 Complex Gastroenterology 2025 168 539 555.e5 10.1053/j.gastro.2024.10.042 39566663 40. Zhang S. You H. Fan H. Chen Y. Song H. Zhao Z. Chen Q. Wang Y. Tian Z. Wu Y. Transcytosis-Triggering Nanoparticles for Overcoming Stromal Barriers and Reversing Immunosuppression in Pancreatic Cancer Combinatorial Therapy Nano Lett. 2025 25 2949 2959 10.1021/acs.nanolett.4c06372 39914891 41. Chu Z. Yang J. Zheng W. Sun J. Wang W. Qian H. Recent advances on modulation of H 2 2 Coord. Chem. Rev. 2023 481 19 10.1016/j.ccr.2023.215049 42. Horos R. Büscher M. Kleinendorst R. Alleaume A.M. Tarafder A.K. Schwarzl T. Dziuba D. Tischer C. Zielonka E.M. Adak A. The Small Non-coding Vault RNA1-1 Acts as a Riboregulator of Autophagy Cell 2019 176 1054 1067.e12 10.1016/j.cell.2019.01.030 30773316 Figures and Scheme pharmaceutics-17-01201-sch001_Scheme 1 Scheme 1 Schematic illustration of the construction of H-MnO 2 2+ 2 2 2 2+ Figure 1 Construction and physicochemical characterization of H-MnO 2 A 2 B 2 2 2 2 2 C D 2 −1 −1 −1 −1 2 E 2 Figure 2 Solution-level evaluation of H-MnO 2 A 2 2 2 2 B 2 2 2 2 2 2 C 2 2 2 2 D E 2 Figure 3 Cellular-level evaluation of H-MnO 2 A 2 2 2 2 B 2 C D E F G p p p Figure 4 In vivo targeting and therapeutic efficacy of H-MnO 2 A 2 n B C D E D E p p p 2 2 2 2 F G ",
  "metadata": {
    "Title of this paper": "The Small Non-coding Vault RNA1-1 Acts as a Riboregulator of Autophagy",
    "Journal it was published in:": "Pharmaceutics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473349/"
  }
}