{
  "title": "Paper_1105",
  "abstract": "pmc J Clin Med J Clin Med 2745 jclinmed jcm Journal of Clinical Medicine 2077-0383 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470296 PMC12470296.1 12470296 12470296 41010705 10.3390/jcm14186501 jcm-14-06501 1 Review Artificial Intelligence and Digital Tools Across the Hepato-Pancreato-Biliary Surgical Pathway: A Systematic Review https://orcid.org/0009-0002-9242-8145 Efstathiou Andreas 1 * https://orcid.org/0000-0002-5375-0097 Charitaki Evgenia 1 Triantopoulou Charikleia 2 https://orcid.org/0000-0001-9498-7763 Delis Spiros 1 Caballero-Mateos Antonio M. Academic Editor 1 jenny_charitaki@hotmail.com spirosgdelis@gmail.com 2 ctriantopoulou@gmail.com * f-stathiou@hotmail.com 15 9 2025 9 2025 14 18 497642 6501 01 8 2025 29 8 2025 10 9 2025 15 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background: Methods: Results: Conclusions: hepatopancreatobiliary surgery artificial intelligence augmented reality image-guided surgery robotic surgery machine learning surgical planning intraoperative navigation predictive analytics deep learning systematic review This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Hepato-pancreato-biliary (HPB) diseases such as hepatocellular carcinoma, pancreatic ductal adenocarcinoma, cholangiocarcinoma, and complex benign conditions often require high-stakes surgical intervention. Surgical resection remains the cornerstone of curative treatment for many of these diseases, but HPB operations are among the most challenging in abdominal surgery due to intricate anatomy, critical vasculature, and narrow margins for error. Even in experienced centers, outcomes like negative resection margins, complication rates, and long-term survival are closely tied to the quality of preoperative imaging, the surgeon’s planning, and real-time intraoperative judgment [ 1 2 Artificial intelligence (AI) has rapidly advanced in medicine and offers powerful tools to address some of these needs. AI—particularly machine learning (ML) and deep learning algorithms—excels at detecting patterns in complex data, often surpassing human performance in tasks like image recognition. In the domain of medical imaging, AI applications have grown exponentially; a recent bibliometric analysis identified 2552 publications on AI in HPB surgery from 2014 to 2024, with “diagnosis” and “CT” (computed tomography) among the most frequent keywords [ 3 4 5 6 7 8 9 Early results specific to HPB surgery are encouraging. For instance, multiple studies have shown that ML models can predict postoperative pancreatic fistula more accurately than traditional surgeon-calculated scores [ 10 11 12 13 14 15 16 17 18 Despite growing interest and a proliferation of pilot studies, there remains a gap before these innovations are widely adopted in clinical practice. Most AI tools in HPB surgery are still in the developmental or experimental stage, tested on retrospective datasets or small case series. Validation in prospective clinical trials is needed for regulatory approval and to build clinical confidence. Surgeons must also be able to trust and seamlessly interact with these systems during real operations. Additionally, issues of integration (how to incorporate AI outputs into surgical workflows), regulation, and ethics (such as liability and transparency of AI decision-making) need to be addressed. Given the rapid pace of new data, a timely systematic review is warranted to synthesize the current evidence, evaluate study quality, and guide clinicians and researchers on future directions of AI in HPB surgery. Herein, we present a comprehensive systematic review of AI and digital tools in HPB surgery, adhering to PRISMA 2020 guidelines, and discuss the clinical advances and challenges in this emerging field. The aim of this study is to synthesize and appraise HPB relevant AI digital tools used across the perioperative spectrum (diagnostics, planning, intraoperative guidance, and predictive analysis), focusing on performance, quality, and readiness for integration in clinical everyday practice. This review advances the prior literature by providing an end-to-end synthesis across the entire HPB surgical pathway (preoperative imaging/planning, intraoperative AR/MR and computer-vision guidance, postoperative risk prediction) updated through June 2025; we (i) include intraoperative CV/MR alongside imaging and predictive analytics; (ii) apply study-appropriate appraisal (PROBAST, QUADAS-2) with quantitative bias/validation summaries; (iii) map evidence by study design and readiness; and (iv) translate findings into practical implementation guidance. In contrast to prior HPB AI surveys or AR-only reviews, we excluded purely radiology-only studies without surgical relevance, emphasized external validation/readiness, and integrated ethics/implementation aspects specific to surgical workflows. 2. Materials and Methods 2.1. Protocol and Registration This systematic review was performed in accordance with the PRISMA 2020 guidelines. The review protocol (objectives, search strategy, inclusion criteria, and analysis methods) was formulated prior to commencing study selection. The protocol was not registered in PROSPERO or other public databases given the rapid update cycle and heterogeneous technology scope; however, all methods followed PRISMA recommendations for transparent reporting [ 19 Supplementary Table S1 2.2. Eligibility Criteria Inclusion: English-language human studies evaluating AI/digital tools (ML/DL, radiomics, AR/MR, computer vision, navigation/3D planning) within an HPB surgical context—imaging interpretation, preoperative planning/simulation, intraoperative guidance, or outcome prediction. Any empirical design (retrospective/prospective observational, feasibility/pilot, RCT). Exclusion: conference abstracts without full data; editorials/commentaries; animal/phantom-only work without clinical translation; purely diagnostic radiology studies with no surgical context. 2.3. Information Sources and Search Strategy A comprehensive literature search was conducted in four databases: PubMed, Embase, Web of Science, and Scopus. We also searched engineering and specialty databases—IEEE Xplore and ACM Digital Library—for relevant technical papers on surgical navigation or AR that might not be indexed in the medical databases. Additionally, the Cochrane Library was searched for any pertinent systematic reviews. The search was first performed in May 2025 and updated in June 2025 to capture newly published studies. The search strategy combined keywords and controlled vocabulary terms related to two domains: (1) HPB surgery (e.g., “hepato-pancreato-biliary” OR “HPB” OR “liver surgery” OR “hepatectomy” OR “pancreatic surgery” OR “Whipple” OR “bile duct surgery”, etc.) and (2) Artificial Intelligence/Digital Tools (e.g., “artificial intelligence” OR “machine learning” OR “deep learning” OR “neural network” OR “radiomics” OR “augmented reality” OR “mixed reality” OR “surgical navigation” OR “image-guided surgery” OR “3D reconstruction” OR “robotic surgery” OR “decision support” OR “predictive model”, etc.). These were combined with Boolean operators AND/OR. A sample PubMed query was: ((“hepato-pancreato-biliary” OR HPB OR hepatobiliary OR pancreatic OR pancreatoduodenectomy OR hepatectomy OR “liver resection” OR “pancreatic resection”) AND (“artificial intelligence” OR “machine learning” OR “deep learning” OR radiomics OR “augmented reality” OR “mixed reality” OR “image-guided” OR navigation OR “3D planning” OR “3D reconstruction” OR robotic OR “decision support” OR “predictive model”)) AND 2018:2023[dp] AND english[lang]. Similar queries were adapted for the other databases. We also hand-searched reference lists of relevant articles and conference proceedings to ensure completeness. No date restrictions were imposed initially, but practically most retrieved studies were from the last decade given the nascent nature of AI in surgery. 2.4. Study Selection All identified records were imported into a reference manager, and duplicates were removed. Two reviewers independently screened titles and abstracts for relevance. Studies deemed potentially eligible or unclear were retrieved in full text. The same two reviewers then independently evaluated full-text articles against the inclusion criteria. Any disagreements were resolved by discussion and consensus, involving a third reviewer if needed. A PRISMA 2020 flow diagram ( Figure 1 2.5. Data Extraction Two reviewers independently extracted data using a standardized form. From each included study, we collected the author, year, study design (retrospective, prospective, etc.), sample size and population (e.g., number of patients or images, disease focus like HCC or PDAC), type of AI or digital tool (including details of algorithms or platforms), the application domain (imaging diagnosis, risk prediction, planning, intraoperative guidance, etc.), and key outcomes or findings. For prediction model studies, we noted performance metrics like AUC, sensitivity, specificity, etc. For AR/navigation tools, we noted qualitative and quantitative outcomes such as registration error, time saved, or user feedback on usefulness. Any additional notable findings (e.g., technical challenges) were also recorded. The two extractors compared their results and resolved discrepancies by consensus. 2.6. Risk of Bias Assessment We assessed methodological quality and risk of bias using appropriate tools for each study design. For prediction model studies (e.g., algorithms to predict postoperative complications or recurrence), we used the Prediction Model Risk of Bias Assessment Tool (PROBAST) [ 20 21 2.7. Data Synthesis Given heterogeneity of interventions and outcome metrics, a meta-analysis was not feasible. We therefore conducted a narrative synthesis with descriptive subgroup analyses by major application domains of AI/ digital tools in HPB surgery. We grouped results into categories corresponding to stages of surgical care: Preoperative Imaging and Diagnosis Risk Prediction (outcomes) Surgical Planning and Simulation Intraoperative Guidance and Navigation Surgical Video Analysis/Robotics Within each category, we summarize the performance of AI tools and any reported impact on clinical decision-making or patient outcomes. Where appropriate, we compare AI tool performance to conventional standards (e.g., AI vs. human radiologist, or vs. existing risk scores). All analyses are descriptive; no pooled summary measures were calculated due to diverse data. Instead, we highlight trends, such as areas where multiple studies consistently show benefit versus areas of conflicting or limited evidence. 3. Results 3.1. Study Selection and Characteristics The database search yielded 1046 unique records. After title/abstract screening, 112 articles remained for full-text review. Of these, 38 studies met our inclusion criteria and were included in the qualitative synthesis. The PRISMA flow diagram ( Figure 1 Figure 2 Figure 3 Figure 4 No clear indication of reporting bias was identified qualitatively; however, potential publication bias favoring positive outcomes could not be entirely ruled out. Moreover, the certainty of evidence across included studies was moderate to low due to predominantly retrospective designs, lack of external validation, and small sample sizes, limiting the generalizability of findings. We also tabulated key characteristics of representative primary studies from our set ( Table 1 Table 1 Figure 4 Supplementary Table S2 3.2. Preoperative AI and 3D Planning (Imaging and Diagnosis) Several studies applied AI to interpret preoperative imaging for HPB diseases—such as ultrasound, computed tomography (CT), and MRI—with the aim of improving diagnostic accuracy. Machine learning for tumor detection and characterization: In liver imaging, AI algorithms (often CNNs) have shown high accuracy in identifying liver tumors and classifying lesion types. For example, one study combined radiomics features with a CNN to differentiate hepatocellular carcinoma (HCC) from liver metastases on ultrasound images, achieving AUC ~0.85–0.90 [ 4 22 28 Beyond simply detecting lesions, AI has been used to predict tumor biology or staging from preoperative scans. For instance, radiomic models analyzing preoperative CT have shown ability to predict early HCC recurrence after resection better than conventional clinical staging, by identifying subtle textural features associated with tumor aggressiveness [ 30 31 Some digital tools also bridge into intraoperative imaging enhancement. For example, an experimental system used an AI algorithm to register real-time intraoperative ultrasound with preoperative CT images [ 32 4 In parallel, advanced 3D imaging and visualization tools are augmenting preoperative planning. Automated 3D reconstruction: Several studies highlighted the use of AI to perform 3D reconstructions of liver and pancreatic anatomy from CT/MRI scans. This includes segmenting the liver into anatomical units and delineating tumors, vessels, and ducts [ 33 34 35 36 37 Augmented and mixed reality for planning: In addition to screen-based 3D models, some teams have explored using augmented reality (AR) or mixed reality to aid preoperative planning. For instance, holographic visualization of patient anatomy via AR headsets has been tested as a planning tool. In a pilot study for pancreatic tumor resection using mixed reality, surgeons could visualize major arteries and veins holographically in 3D prior to surgery, which reportedly improved their confidence in dissection around those structures (though quantitative outcomes were not yet measured) [ 38 39 These technologies blur the line between preoperative planning and intraoperative guidance, as the same AR models can potentially be brought into the OR (see below). 3.3. Predictive Analytics (AI for Risk and Outcome Prediction) Another major application of AI in HPB surgery is prediction of operative risk and postoperative outcomes. These AI-driven predictive analytics models use preoperative or intraoperative data to forecast complications and aid in risk stratification and clinical decision-making. Postoperative complication risk models: A prototypical example is predicting postoperative pancreatic fistula (POPF), one of the most common and feared complications after pancreatic resection. Traditional risk scores (like the Fistula Risk Score, FRS) use a few surgeon-assessed variables and have moderate accuracy (AUC often ~0.6) [ 40 24 41 42 43 44 Outcome prediction and decision support: Beyond immediate complications, AI has been used to predict oncologic outcomes like cancer recurrence or long-term survival. Models integrating tumor genomic data, radiologic features, and patient comorbidities have shown promise in forecasting which patients are likely to have early recurrence after resection, which could influence adjuvant therapy decisions. For example, one radiomics study could predict early recurrence of HCC from preoperative imaging and lab data, raising the prospect of tailoring follow-up intensity for high-risk patients [ 45 46 In summary, AI-based predictive models in HPB surgery show clear potential to enhance risk assessment, but their clinical integration is still in early phases. Surgeons could use such models to better inform patients of risks, optimize perioperative planning (e.g., allocate ICU beds for high-risk cases), or select patients for certain interventions. Importantly, any AI risk estimate must be interpreted in context—these tools should assist, not replace, clinician judgment. Most models need prospective validation; as one study pointed out, it will be critical to test AI risk predictions in real-time and see if acting on them actually improves patient outcomes. Moreover, issues of bias and generalizability exist: many models were trained on single-institution data and may not perform as well elsewhere (some risk factors might be center-specific). The push for external validation and eventual randomized trials (e.g., using AI risk tools versus standard care) is ongoing [ 47 3.4. Intraoperative AR and Navigation One of the most visually compelling applications of these technologies is augmented reality (AR) for intraoperative guidance. AR in surgery involves overlaying digital information (such as anatomical models, tumor locations, or navigation markers) onto the surgeon’s field of view in real time, effectively providing a “surgical GPS.” This can be implemented via specialized goggles or head-mounted displays (like the Microsoft HoloLens), or by overlaying on laparoscopic/robotic camera feeds on a monitor [ 26 AR for open and minimally invasive surgery: Several pilot studies in our review implemented AR during liver or pancreatic resections. The common workflow is as follows: a 3D model of the patient’s anatomy (from preoperative imaging) is created and then registered to the patient on the operating table. Registration often uses surface landmarks or fiducial markers so that the virtual model aligns correctly with the real organ. For example, in an AR-guided liver surgery study, a CT-based 3D model of the liver (with tumor and vessels) was projected onto the live laparoscopic camera view [ 48 26 49 Technical feasibility and accuracy: The feasibility of AR has been demonstrated in small case series. A recent study reported using an AR overlay in three cases of robotic liver resection. The AR model was displayed in the surgeon’s console view, showing tumor and vasculature projections during the robotic hepatectomies. Surgeons found it helped localize lesions and plan transections. However, a noted limitation was the need for improved registration accuracy—misalignment of the virtual overlay by even a few millimeters could erode trust in the system. Organ deformation is a major issue: in soft tissues like the liver, once surgery begins and the organ is mobilized or resected partially, it changes shape, making static preoperative overlays increasingly inaccurate [ 26 50 51 Navigation and workflow: Despite these challenges, AR clearly adds value as a navigation aid. For example, AR has been used to guide the placement of trocars (ports) in minimally invasive HPB surgery by projecting an optimal port map onto the patient’s abdomen [ 26 52 52 53 Current evidence for AR’s benefits is still low-level (case series and simulation studies), but almost all reports indicate it is technically achievable and subjectively improves the surgeon’s situational awareness. Quantitative outcome improvements (like reduced positive margin rates or operative time) have yet to be robustly demonstrated. There is also a learning curve and significant setup required (segmentation, calibration in the OR). A 2021 review noted that AR in HPB surgery is “far from standardized” due to high complexity and cost [ 23 54 3.5. Robotics and AI Augmentation (Computer Vision in Surgery) Another frontier is the use of AI-driven computer vision to analyze surgical video in real time, particularly in minimally invasive surgery. HPB procedures like laparoscopic cholecystectomy, liver resection, or pancreaticoduodenectomy generate rich video data from the endoscopic camera. By applying computer vision algorithms (usually deep learning models), this video stream can be analyzed to identify structures, surgical phases, or impending dangers, and then provide feedback or alerts to the operating surgeon [ 55 56 57 Automatic landmark and safety identification: A prominent example is objective recognition of the critical view of safety (CVS) during laparoscopic cholecystectomy. CVS is a method to ensure the cystic duct and artery are clearly identified before cutting, to prevent common bile duct injuries. Achieving CVS is typically a subjective assessment by the surgeon. One included study developed an AI system to automatically detect when CVS had been attained. They trained a deep CNN on ~23,000 laparoscopic cholecystectomy video frames, labeled for presence or absence of key CVS criteria. The best model achieved ~83% accuracy in determining if CVS was achieved, operating at ~6 frames per second (nearly real-time). Such a system could potentially alert a surgeon if they have not yet adequately exposed critical structures [ 23 58 Beyond CVS, computer vision has been used to detect other anatomical landmarks in real time. Algorithms have been trained, for instance, to recognize the cystic duct, cystic artery, and common bile duct, or specific liver segments in the laparoscopic view. Early results are promising: a recent review reported that such AI systems can detect landmarks with reasonable sensitivity, though challenges remain when the view is obscured by bleeding or fat [ 59 Real-time hazard detection: Another cutting-edge application is automatic detection of intraoperative bleeding and other hazards. In complex HPB surgeries, bleeding from small vessels can sometimes go unnoticed for critical seconds if the surgeon’s focus is elsewhere. One innovative study designed a hazard detection system using the YOLOv5 deep learning model to identify bleeding in endoscopic video and immediately display alerts via an AR headset. The system distinguished true bleeding from look-alike events (such as spilled irrigating fluid) with high accuracy, highlighting the bleed with a bounding box on the surgeon’s display in real time. Essentially, this is an AI-driven early warning system—a digital “co-pilot” that never blinks, constantly scanning the operative field for hazards. In testing across recorded procedures, the system successfully alerted surgeons to bleeding events that were at times outside the central field of view or at the periphery. Such technology could reduce response time to hemorrhage, potentially improving patient safety in major liver or pancreatic resections where even a brief delay in controlling bleeding can have serious consequences [ 27 Robotic surgery integration: In robotic surgery, integration of AI is also advancing. The da Vinci surgical system already allows some digital interfacing—for example, the TileProTM feature can display auxiliary imaging (like preoperative scans or ultrasound) side-by-side with the operative view [ 60 61 Perhaps the most futuristic concept is partially or fully autonomous robotic actions. In experimental settings outside HPB, AI has been used to automate certain surgical subtasks. For example, a research group demonstrated an autonomous laparoscopic intestinal anastomosis where an AI-guided robot performed suturing in an animal model [ 62 63 3.6. Postoperative Video Analytics A concrete benefit of these advances, already being realized, is in operative documentation and analysis. AI can automatically segment surgical video post hoc into key phases (induction, dissection, resection, anastomosis, closure, etc. This can aid in efficient review of surgeries, training (surgeons can get a summary of where time was spent in each phase), and even research correlating technique with outcomes. For instance, if an adverse event occurs, AI- analyzed video might pinpoint that a certain landmark was not identified or a wrong plane was entered, offering insights for quality improvement [ 64 65 In summary, computer vision in HPB surgery is enabling a new level of intraoperative awareness. By recognizing anatomy, guiding the surgeon through critical steps (like confirming CVS), and flagging dangers, these AI systems act as an intelligent assistive layer over the surgical procedure. While still early-stage, evidence suggests such tools are feasible and can perform near expert-level in narrow tasks (e.g., identifying a specific landmark or bleeding source) [ 56 66 67 68 69 4. Discussion This systematic review reveals that the integration of AI and digital tools into HPB surgery is no longer theoretical—numerous proof-of-concept studies and early clinical evaluations have been conducted across the surgical pathway. Figure 5 4.1. Key Findings and Current Evidence AI systems show their strongest evidence in diagnostic imaging and risk prediction. Deep learning models can detect small liver lesions, predict recurrence, and identify pancreatic cancer with high accuracy, often matching or surpassing expert performance [ 70 71 72 73 In surgical planning, AI-driven 3D reconstructions improve anatomical understanding, with one RCT showing reduced operative time and blood loss. Intraoperatively, AR and computer-vision platforms enhance visualization and safety, recognizing landmarks like the critical view of safety, detecting bleeding in real time, and effectively improving the surgeon’s sensory and decision environment in real time [ 37 74 However, most studies remain retrospective or pilot projects, with few randomized trials and limited patient outcome data. Evidence is strong for imaging accuracy but only preliminary for intraoperative applications, where sample sizes are small and heterogeneity is high. 4.2. Evidence Quality and Bias Many included studies had methodological limitations. Common issues were small sample sizes, retrospective designs, single-center data, and lack of external validation—all of which raise the risk of bias. Using PROBAST [ 20 In terms of evidence grading, applying GRADE criteria is tricky for such heterogeneous literature. Imaging/diagnostics—moderate (consistent internal accuracy, limited external validation); predictive analytics—low-to-moderate; planning/3D and AR/MR—low; intraoperative computer vision—low. Broadly, evidence for AI in imaging diagnosis could be considered moderate to high in certain niches (for instance, AI for detecting liver tumors has been reproduced in several settings, lending confidence to generalizability). On the other hand, evidence for AR and intraoperative AI is low to moderate—mostly limited to feasibility studies or small series without definitive proof of outcome benefit. No large trials or meta-analyses exist yet. This indicates we are at an early evidence level for intraoperative guidance tools. Crucially, randomized controlled trials (RCTs) or other high-quality prospective studies are needed. We acknowledge RCTs are challenging in surgical technology research, but for AI, we may need creative trial designs, e.g., cluster-RCTs where certain centers adopt the AI tool and others use standard care or stepped-wedge designs as AI tools become available. Without such evidence, widespread adoption will lag, and clinicians will remain uncertain about true benefit. Encouragingly, some trials are underway—e.g., an international trial on AI-based coaching during cholecystectomy (using an AI to guide trainees) showed improved safety for trainees [ 75 4.3. Safety, Ethical and Considerations Integrating AI into surgery raises questions of responsibility, transparency, and equity. Surgeons remain accountable for decisions, but liability may blur if AI guidance proves misleading. Most current systems lack interpretability, underscoring the need for explainable AI and robust validation. Data privacy and cybersecurity are critical as models rely on large surgical video and imaging datasets. Algorithmic bias is another risk: tools trained on narrow populations may underperform in diverse settings, widening disparities. Patient communication is essential—disclosure that AI or AR tools are used builds trust and respects autonomy. Training and education must balance reliance on digital tools with fundamental surgical skills, due to a potential risk that future trainees become too dependent on navigation aids [ 76 77 78 79 80 4.4. Costs and Implementation AR/MR platforms, high-end workstations, and robotic integrations entail non-trivial acquisition and maintenance costs. Potential offsets include reduced operative time, lower blood loss, or fewer re-interventions when planning/guidance are effective; however, formal cost-effectiveness studies in HPB are scarce. Prospective evaluations with embedded economic endpoints are needed to inform adoption [ 81 4.5. Clinical Guidance for Surgeons From the current evidence, several practical lessons emerge: Preoperative planning: Use available 3D reconstructions and consider AI-based volumetry or segmentation where accessible, especially in complex resections. Intraoperative AR/Navigation: Treat AR overlays as adjuncts, not replacements, and verify with standard techniques. Early adoption should include fallback strategies. Robotic platforms: Maximize built-in digital features; integrate emerging AI modules cautiously and maintain oversight of semi-autonomous functions. AI decision support: Apply predictive models as aids, not determinants; combine outputs with clinical judgment and document their use. Team training: Ensure all OR staff understand the purpose and limits of digital tools, with contingency plans in place. Ongoing education: Surgeons should remain updated on AI principles and evolving guidelines to critically evaluate and responsibly deploy new technologies. Patient communication: Transparently explain when digital or AI tools support surgical planning or procedures and obtain informed consent for experimental systems. By following these techniques, surgeons can responsibly embrace technology while maintaining high standards of care. The goal is to become “digitally augmented surgeons”—using all available tools to benefit patients but remaining the captain of the ship. 4.6. Strengths and Limitations of This Review This review is one of the first comprehensive systematic reviews focusing specifically on AI in HPB surgery (as opposed to AI in surgery generally, or AI in radiology alone). By combining disparate study types under one umbrella, we provide HPB clinicians with a panoramic perspective of how AI might impact every step of the surgical process. A strength of our review is this breadth: contrary to current reviews that examine each aspect individually, readers can appreciate the continuum from preoperative AI diagnostics to intraoperative guidance and even postoperative analytics, all in the HPB context. We also included the most recent studies (through mid-2025), capturing very up-to-date advances such as AR-guided pancreatic surgery and AI-enhanced fluorescence imaging that were not covered in earlier reviews. We applied a robust multi-database search and used independent dual screening, which reduces the chance that we missed major relevant articles. Additionally, we assessed risk of bias and discuss evidence quality, adding a critical lens to interpret the findings responsibly rather than simply hyping technology. On the flip side, by covering such breadth, our review sacrifices some depth in each subdomain. Each of the areas (e.g., radiomics for HCC, or AR for liver surgery) could warrant its own in-depth review or meta-analysis. We aimed for a balanced discussion relevant to clinical readers rather than data scientists, which means some technical details (like specific algorithm architectures or training techniques) are glossed over. Another limitation is the heterogeneity of the included studies, which precluded meta-analysis. We could not quantitatively synthesize effects, so our conclusions are qualitative and potentially subject to our interpretation bias. We also did not systematically examine cost-effectiveness—an important consideration for adopting these technologies. Currently, many tools are prototypes and cost data are scarce, but as tools mature, formal cost–benefit analyses will be needed (e.g., is an expensive AR system justified by a reduction in complications?). Some limitations temper our findings such as 89% of studies were retrospective, risking selection bias, only 5/38 tools were externally validated, raising questions about scalability and ethical frameworks for AI-assisted surgery (e.g., informed consent protocols) remain undefined. Out of 38 studies, 62% had high risk of bias in analysis (PROBAST), primarily due to inadequate validation. Furthermore, our search focused on the published literature; we might have missed very recent conference abstracts or industry research not in the public domain. However, by updating through mid-2025 and scanning references of relevant articles, we believe we captured the major developments. We also acknowledge that our review can become outdated quickly given the rapid evolution of AI—this is an inherent limitation when covering a fast-moving field. Our work is a “snapshot” up to mid-2025; readers should stay alert to new studies emerging literally every month. Despite these limitations, we have tried to provide a comprehensive and up-to-date synthesis, with critical appraisal, to guide both surgeons interested in adopting new technologies and researchers aiming to identify gaps for future study. 5. Future Directions The trajectory of AI in HPB surgery is clearly toward more integrated and intelligent systems. We anticipate that various AI components—imaging analysis, risk prediction, navigation, and vision assistance—will converge into unified platforms. For example, one can imagine an “HPB Surgery AI Suite” where a patient’s data are processed end-to-end: preoperatively, the system analyzes imaging and predicts potential difficulties; intraoperatively, it provides AR overlays and safety alerts; postoperatively, it analyzes surgical video to produce an operative report and even recommends improvements for the surgeon’s technique. Achieving this vision will require collaboration between surgeons, computer scientists, and industry engineers. Priority areas for robotic–AI integration include real-time instrument tracking, safety-critical alerts such as vessel proximity, and standardized API frameworks for interoperability. Integrating histopathology and molecular data with imaging/radiomics and clinical variables could also potentially improve prognostication and treatment selection; future multicenter datasets should explicitly include harmonized pathology inputs. Data sharing and large datasets will be fundamental. As mentioned, many current models are limited by training data volume and diversity. Initiatives to create multi-institutional databases of annotated surgical videos (with proper anonymization and consent) are in progress and should be supported [ 82 83 Large Language Models (LLMs), such as ChatGPT-4, LLaMA, Mistral, and similar, represent another frontier that might intersect with HPB surgery. While LLMs are not directly performing surgical tasks, they could serve supporting roles in aggregating and delivering knowledge. For instance, an LLM-based assistant might be queried in real time for advice on an unusual intraoperative finding (“What are the management options if I encounter tumor thrombus in the portal vein?”), and it could rapidly provide synthesized knowledge from guidelines or literature. A recent editorial discussed how LLMs demonstrate potential in clinical documentation automation, complex data analysis, and real-time decision support in HPB surgery, but also highlighted challenges like AI “hallucinations” (confidently generating false information) and the need for oversight [ 84 Another area is integrating precision medicine into surgical AI. As precision oncology advances, surgery will not remain an isolated discipline. We foresee AI enabling integration of genomic and molecular data into surgical decision-making. For example, if a patient’s tumor genomics suggest indolent disease, perhaps a limited resection or ablation could suffice versus an aggressive surgery. Conversely, high-risk biology might prompt a more extensive resection or multi-modal approach. Some groundwork for such “radiogenomic” models exists already [ 85 Usability and workflow integration: Future tools must be user-centric. One reason some technologies fail to gain traction is poor usability. Surgeons are busy and will not adopt something that significantly slows them down or is overly complex [ 86 Validation and certification: Before routine clinical use, rigorous validation is needed. We anticipate more prospective trials in the next 5–10 years. Perhaps certain AI tools will undergo phase I/II style trials (assessing safety and feasibility, then efficacy). Regulatory bodies might stipulate that surgical AI meet specific performance benchmarks (for example, ≥95% sensitivity for critical structure detection). There may also be a role for simulation in validation—e.g., testing AI on recorded surgeries to see how often it would have prevented an adverse event or given false alarms. A kind of “digital twin” of clinical trials can be run on retrospective data to justify prospective testing. Post-market surveillance will also be crucial: AI systems might require periodic re-validation to ensure they perform as expected as data drift over time. Education and training: The surgeon of the future needs to be adept with technology. Surgical residency programs may incorporate formal training on digital tools—for instance, sessions on how to interpret AI outputs, use AR goggles, or troubleshoot a robot’s AI feature. Just as surgical simulation is now part of training, we might see AI-assisted simulators where residents operate with an “AI mentor” that provides feedback. However, caution is warranted that reliance on AI does not diminish the development of fundamental surgical skills and judgment. Training curricula will have to emphasize AI as a support tool and ensure trainees can perform without it as well. Interestingly, AI might also personalize training—analyzing a trainee’s performance over cases and identifying specific areas to improve (e.g., speed of attaining CVS or economy of motion in suturing). Interdisciplinary collaboration: We predict increasing collaboration between surgeons and data scientists. Some hospitals now have “clinical AI” teams that pair clinicians with AI developers to solve problems. In HPB surgery, surgeons should actively contribute to the development process: for example, by helping label data (what is important to identify in a video), defining clinical requirements (what accuracy would make a tool useful), and piloting prototypes. This co-development will ensure the final products truly meet clinical needs rather than being tech demos. The role of surgeon–data scientist is even emerging—clinicians who gain expertise in AI and drive projects from within. Regulations and guidelines: The surgical community may develop its own guidelines for AI use, analogous to how societies issue guidelines on new technology adoption. We might see position statements on “Safe Use of Augmented Reality in Surgery” or “Standards for Reporting Surgical AI Studies” (some of which are already being discussed). As noted, the FUTURE-AI consortium has published principles for trustworthy AI in healthcare. Expect future guidelines to explicitly call for things like continuous monitoring of AI performance post-deployment and involving patients in decisions about AI use. Professional surgical bodies may also integrate AI topics into training curricula and certification (for example, mandates that surgeons demonstrate understanding of an AI tool before using it clinically). In conclusion of future directions, the coming decade will likely transform how HPB surgery is planned and performed. We will move from the current phase of isolated pilot studies to integrated systems that assist the surgeon at each step. Realizing this future requires careful work on many fronts: technical innovation, clinical validation, ethical oversight, and surgeon education. If done correctly, HPB surgeons of the future will operate with greater knowledge (thanks to AI analysis), greater precision (thanks to real-time guidance), and greater confidence (thanks to predictive analytics and automation of tedious tasks). The focus must remain on patient outcomes—technology for its own sake is not the goal, but rather a means to safer, more effective, and more personalized surgical care. 6. Conclusions AI across the HPB surgical pathway shows quite promising early results in risk prediction, planning, and intraoperative guidance. It is evident that before routine adoption, prospective, multicenter evaluations with external validation; standardized reporting; and economic assessment are needed as prerequisites. With continued refinement and careful implementation, these technologies could enhance precision, safety, and outcomes in HPB surgery. Acknowledgments The authors would like to thank our colleagues in the HPB surgery and biomedical engineering departments for their insightful discussions and support during this project. We are grateful to the Journal of Clinical Medicine Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/jcm14186501/s1 Author Contributions All authors contributed to the study conception, design, and execution. A.E. and E.C. performed the literature search and data extraction. C.T. and S.D. assessed risk of bias and quality. A.E. drafted the manuscript, and all authors critically reviewed and edited it. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement Every data extraction form and risk-of-bias table used in the upper manuscript are available from the authors upon reasonable request. No additional data or analytic code were generated. Conflicts of Interest The authors declare no conflicts of interest related to this work. Abbreviations HCC—hepatocellular carcinoma; PDAC—pancreatic ductal adenocarcinoma; AUC— area under curve; CNN—convolutional neural network; ML—machine learning; LC—laparoscopic cholecystectomy; CVS—critical view of safety; AR—augmented reality; MR—mixed reality; POPF—postoperative pancreatic fistula; HPB—hepato-pancreato-biliary. References 1. Agrawal H. Tanwar H. Gupta N. Revolutionizing hepatobiliary surgery: Impact of three-dimensional imaging and virtual surgical planning on precision, complications, and patient outcomes Artif. Intell. Gastroenterol. 2025 6 106746 10.35712/aig.v6.i1.106746 2. Zureikat A.H. Postlewait L.M. Liu Y. Gillespie T.W. Weber S.M. Abbott D.E. Ahmad S.A. Maithel S.K. Hogg M.E. Zenati M. A multi-institutional comparison of perioperative outcomes of robotic and open pancreaticoduodenectomy Ann. Surg. 2016 264 640 649 10.1097/SLA.0000000000001869 27433907 3. Zheng R.J. Li D.L. Lin H.M. Wang J.F. Luo Y.M. Tang Y. Li F. Hu Y. Su S. Bibliometrics of Artificial Intelligence Applications in Hepatobiliary Surgery from 2014 to 2024 World J. Gastrointest. Surg. 2025 17 104728 10.4240/wjgs.v17.i5.104728 40502490 PMC12149915 4. Bektaş M. Chia C.M. Burchell G.L. Daams F. Bonjer H.J. van der Peet D.L. Artificial intelligence-aided ultrasound imaging in hepatopancreatobiliary surgery: Where are we now? Surg. Endosc. 2024 38 4869 4879 10.1007/s00464-024-11130-0 39160306 PMC11362182 5. Chadebecq F. Vasconcelos F. Mazomenos E. Stoyanov D. Computer vision in the surgical operating room Visc. Med. 2020 36 456 462 10.1159/000511934 33447601 PMC7768144 6. Lan T. Liu S. Dai Y. Jin Y. Real-time image fusion and Apple Vision Pro in laparoscopic microwave ablation of hepatic hemangiomas npj Precis. Oncol. 2025 9 79 10.1038/s41698-025-00867-z 40113974 PMC11926265 7. Hanna M.G. Pantanowitz L. Dash R. Harrison J.H. Deebajah M. Pantanowitz J. Rashidi H.H. Future of Artificial Intelligence-Machine Learning Trends in Pathology and Medicine Mod. Pathol. 2025 38 100705 10.1016/j.modpat.2025.100705 39761872 8. Faiyazuddin M. Rahman S.J.Q. Anand G. Siddiqui R.K. Mehta R. Khatib M.N. Gaidhane S. Zahiruddin Q.S. Hussain A. Sah R. The Impact of Artificial Intelligence on Healthcare: A Comprehensive Review of Advancements in Diagnostics, Treatment, and Operational Efficiency Health Sci. Rep. 2025 8 e70312 10.1002/hsr2.70312 39763580 PMC11702416 9. Qadri S.F. Rong C. Ahmad M. Li J. Qadri S. Zareen S.S. Zhuang Z. Khan S. Lin H. Chan–Vese aided fuzzy C-means approach for whole breast and fibroglandular tissue segmentation: Preliminary application to real-world breast MRI Med. Phys. 2025 52 2950 2960 10.1002/mp.17660 39910814 PMC12082785 10. Lee W. Park H.J. Lee H.-J. Song K.B. Hwang D.W. Lee J.H. Lim K. Ko Y. Kim H.J. Kim K.W. Deep learning-based prediction of post-pancreaticoduodenectomy pancreatic fistula Scientific Reports 2024 14 5089 10.1038/s41598-024-51777-2 38429308 PMC10907568 11. Verma A. Balian J. Hadaya J. Premji A. Shimizu T. Donahue T. Benharash P. Machine Learning-based Prediction of Postoperative Pancreatic Fistula Following Pancreaticoduodenectomy Ann. Surg. 2024 280 325 331 10.1097/SLA.0000000000006123 37947154 12. Grover S. Gupta S. Automated diagnosis and classification of liver cancers using deep learning techniques: A systematic review Discov. Appl. Sci. 2024 6 508 10.1007/s42452-024-06218-0 13. Rawlani P. Ghosh N.K. Kumar A. Role of artificial intelligence in the characterization of indeterminate pancreatic head mass and its usefulness in preoperative diagnosis Artif. Intell. Gastroenterol. 2023 4 48 63 10.35712/aig.v4.i3.48 14. Cremades Pérez M. Espin Álvarez F. Pardo Aranda F. Navinés López J. Vidal Piñeiro L. Zarate Pinedo A. Piquera Hinojo A.M. Sentí Farrarons S. Cugat Andorra E. Augmented reality in hepatobiliary-pancreatic surgery: A technology at your fingertips Cir. Esp. 2023 101 312 318 10.1016/j.ciresp.2022.10.022 36781048 15. Roman J. Sengul I. Němec M. Sengul D. Penhaker M. Strakoš P. Vávra P. Hrubovčák J. Pelikán A. Augmented and mixed reality in liver surgery: A comprehensive narrative review of novel clinical implications on cohort studies Rev. Assoc. Méd. Bras. 2025 71 e20250315 10.1590/1806-9282.20250315 40638482 PMC12245099 16. Ntourakis D. Memeo R. Soler L. Marescaux J. Mutter D. Pessaux P. Augmented Reality Guidance for the Resection of Missing Colorectal Liver Metastases: An Initial Experience World J. Surg. 2016 40 419 426 10.1007/s00268-015-3229-8 26316112 17. Hua S. Gao J. Wang Z. Yeerkenbieke P. Li J. Wang J. He G. Jiang J. Lu Y. Yu Q. Automatic Bleeding Detection in Laparoscopic Surgery Based on a Faster Region-Based Convolutional Neural Network Ann. Transl. Med. 2022 10 546 10.21037/atm-22-1914 35722438 PMC9201197 18. Calomino N. Carbone L. Kelmendi E. Piccioni S.A. Poto G.E. Bagnacci G. Resca L. Guarracino A. Tripodi S. Barbato B. Western Experience of Hepatolithiasis: Clinical Insights from a Case Series in a Tertiary Center Medicina 2025 61 860 10.3390/medicina61050860 40428818 PMC12113244 19. Page M.J. McKenzie J.E. Bossuyt P.M. Boutron I. Hoffmann T.C. Mulrow C.D. Shamseer L. Tetzlaff J.M. Akl E.A. Brennan S.E. The PRISMA 2020 statement: An updated guideline for reporting systematic reviews BMJ 2021 372 n71 10.1136/bmj.n71 33782057 PMC8005924 20. Wolff R.F. Moons K.G.M. Riley R.D. Whiting P.F. Westwood M. Collins G.S. Reitsma J.B. Kleijnen J. Mallett S. PROBAST Group PROBAST: A Tool to Assess the Risk of Bias and Applicability of Prediction Model Studies Ann. Intern. Med. 2019 170 51 58 10.7326/M18-1376 30596875 21. Whiting P.F. Rutjes A.W.S. Westwood M.E. Mallett S. Deeks J.J. Reitsma J.B. Leeflang M.M.G. Sterne J.A.C. Bossuyt P.M.M. QUADAS-2 Group QUADAS-2: A Revised Tool for the Quality Assessment of Diagnostic Accuracy Studies Ann. Intern. Med. 2011 155 529 536 10.7326/0003-4819-155-8-201110180-00009 22007046 22. Tong T. Gu J. Xu D. Song L. Zhao Q. Cheng F. Yuan Z. Tian S. Yang X. Tian J. Deep learning radiomics based on contrast-enhanced ultrasound images for assisted diagnosis of pancreatic ductal adenocarcinoma and chronic pancreatitis BMC Med. 2022 20 74 10.1186/s12916-022-02258-8 35232446 PMC8889703 23. Kawamura M. Endo Y. Fujinaga A. Orimoto H. Amano S. Kawasaki T. Kawano Y. Masuda T. Hirashita T. Kimura M. Development of an Artificial Intelligence System for Real-Time Intraoperative Assessment of the Critical View of Safety in Laparoscopic Cholecystectomy Surg. Endosc. 2023 37 8755 8763 10.1007/s00464-023-10328-y 37567981 24. Müller P.C. Erdem S. Müller B.P. Künzli B. Gutschow C.A. Hackert T. Diener M.K. Artificial intelligence and image guidance in minimally invasive pancreatic surgery: Current status and future challenges Artif. Intell. Surg. 2025 5 170 181 10.20517/ais.2024.74 25. Wang X. Yang J. Zhou B. Tang L. Liang Y. Integrating mixed reality, augmented reality, and artificial intelligence in complex liver surgeries: Enhancing precision, safety, and outcomes iLiver 2025 4 100167 10.1016/j.iliver.2025.100167 40636458 PMC12209476 26. Giannone F. Felli E. Cherkaoui Z. Mascagni P. Pessaux P. Augmented Reality and Image-Guided Robotic Liver Surgery Cancers 2021 13 6268 10.3390/cancers13246268 34944887 PMC8699460 27. Rus G. Andras I. Vaida C. Crisan N. Gherman B. Radu C. Tucan P. Iakab S. Al Hajjar N. Pisla D. Artificial Intelligence-Based Hazard Detection in Robotic-Assisted Single-Incision Oncologic Surgery Cancers 2023 15 3387 10.3390/cancers15133387 37444497 PMC10340313 28. Pomohaci M.D. Grasu M.C. Băicoianu-Nițescu A. Enache R.M. Lupescu I.G. Systematic Review: AI Applications in Liver Imaging with a Focus on Segmentation and Detection Life 2025 15 258 10.3390/life15020258 40003667 PMC11856300 29. Cheng H. Xu H. Peng B. Huang X. Hu Y. Zheng C. Zhang Z. Illuminating the Future of Precision Cancer Surgery with Fluorescence Imaging and Artificial Intelligence Convergence npj Precis. Oncol. 2024 8 196 10.1038/s41698-024-00699-3 39251820 PMC11385925 30. Wen L. Weng S. Yan C. Ye R. Zhu Y. Zhou L. Gao L. Li Y. A Radiomics Nomogram for Preoperative Prediction of Early Recurrence of Small Hepatocellular Carcinoma After Surgical Resection or Radiofrequency Ablation Front. Oncol. 2021 11 657039 10.3389/fonc.2021.657039 34026632 PMC8139248 31. Bereska J.I. Janssen B.V. Nio C.Y. Kop M.P.M. Kazemier G. Busch O.R. Struik F. Marquering H.A. Stoker J. Besselink M.G. Artificial intelligence for assessment of vascular involvement and tumor resectability on CT in patients with pancreatic cancer Eur. Radiol. Exp. 2024 8 18 10.1186/s41747-023-00419-9 38342782 PMC10859357 32. Wang D. Azadvar S. Heiselman J. Jiang X. Miga M.I. Wang L. LIBR+: Improving intraoperative liver registration by learning the residual of biomechanics-based deformable registration arXiv 2024 2403.06901 33. Sethia K. Strakos P. Jaros M. Kubicek J. Roman J. Penhaker M. Riha L. Advances in liver, liver lesion, hepatic vasculature, and biliary segmentation: A comprehensive review of traditional and deep learning approaches Artif. Intell. Rev. 2025 58 299 10.1007/s10462-025-11310-x 34. Moglia A. Cavicchioli M. Mainardi L. Cerveri P. Deep Learning for Pancreas Segmentation on Computed Tomography: A Systematic Review Artif. Intell. Rev. 2025 58 220 10.1007/s10462-024-11050-4 35. Takamoto T. Ban D. Nara S. Mizui T. Nagashima D. Esaki M. Shimada K. Automated three-dimensional liver reconstruction with artificial intelligence for virtual hepatectomy J. Gastrointest. Surg. 2022 26 2119 2127 10.1007/s11605-022-05415-9 35941495 36. Kazami Y. Kaneko J. Keshwani D. Kitamura Y. Takahashi R. Mihara Y. Ichida A. Kawaguchi Y. Akamatsu N. Hasegawa K. Two-step Artificial Intelligence Algorithm for Liver Segmentation Automates Anatomic Virtual Hepatectomy J. Hepato-Biliary-Pancreat. Sci. 2023 30 1205 1217 10.1002/jhbp.1357 37747080 37. Li L. Cheng S. Li J. Yang J. Wang H. Dong B. Yin X. Shi H. Gao S. Gu F. Randomized Comparison of AI-Enhanced 3D Printing and Traditional Simulations in Hepatobiliary Surgery npj Digit. Med. 2025 8 293 10.1038/s41746-025-01571-9 40457016 PMC12130338 38. Javaheri H. Ghamarnejad O. Bade R. Lukowicz P. Karolus J. Stavrou G.A. Beyond the visible: Preliminary evaluation of the first wearable augmented reality assistance system for pancreatic surgery Int. J. Comput. Assist. Radiol. Surg. 2024 19 931 939 10.1007/s11548-024-03131-0 PMC11757645 38849631 39. Stott M. Kausar A. Can 3D visualisation and navigation techniques improve pancreatic surgery? A systematic review Artif. Intell. Surg. 2023 3 207 216 10.20517/ais.2022.42 40. Ryu Y. Shin S.H. Park D.J. Kim N. Heo J.S. Choi D.W. Han I.W. Validation of original and alternative fistula risk scores in postoperative pancreatic fistula J. Hepatobiliary Pancreat. Sci. 2019 26 354 359 10.1002/jhbp.638 31125494 PMC6771591 41. Wang J. Zheng T. Liao Y. Geng S. Li J. Zhang Z. Shang D. Liu C. Yu P. Huang Y. Machine Learning Prediction Model for Post-Hepatectomy Liver Failure in Hepatocellular Carcinoma: A Multicenter Study Front. Oncol. 2022 12 986867 10.3389/fonc.2022.986867 36408144 PMC9667038 42. Altaf A. Munir M.M. Khan M.M.M. Rashid Z. Khalil M. Guglielmi A. Ratti F. Aldrighetti L. Bauer T.W. Marques H.P. Machine Learning Based Prediction Model for Bile Leak Following Hepatectomy for Liver Cancer HPB 2025 27 489 501 10.1016/j.hpb.2024.12.015 39753458 43. Vaccaro M. Almaatouq A. Malone T. When combinations of humans and AI are useful: A systematic review and meta-analysis Nat. Hum. Behav. 2024 8 2293 2303 10.1038/s41562-024-02024-1 39468277 PMC11659167 44. Brennan M. Puri S. Ozrazgat-Baslanti T. Bhat R.R. Feng Z. Momcilovic P. Li X. Wang D. Zhe Wang D. Bihorac A. Comparing Clinical Judgment with MySurgeryRisk Algorithm for Preoperative Risk Assessment: A Pilot Usability Study Surgery 2019 165 1035 1045 10.1016/j.surg.2019.01.002 30792011 PMC6502657 45. Wang K.-D. Guan M.-J. Bao Z.-Y. Shi Z.-J. Tong H.-H. Xiao Z.-Q. Liang L. Liu J.-W. Shen G.-L. Radiomics analysis based on dynamic contrast-enhanced MRI for predicting early recurrence after hepatectomy in hepatocellular carcinoma patients Sci. Rep. 2025 15 22240 10.1038/s41598-025-02291-6 40595796 PMC12215142 46. Morales-Galicia A.E. Rincón-Sánchez M.N. Ramírez-Mejía M.M. Méndez-Sánchez N. Outcome prediction for cholangiocarcinoma prognosis: Embracing the machine learning era World J. Gastroenterol. 2025 31 106808 10.3748/wjg.v31.i21.106808 40538509 PMC12175846 47. Kenig N. Monton Echeverria J. Muntaner Vives A. Artificial intelligence in surgery: A systematic review of use and validation J. Clin. Med. 2024 13 7108 10.3390/jcm13237108 39685566 PMC11642125 48. Oh M.Y. Yoon K.C. Hyeon S. Jang T. Choi Y. Kim J. Kong H.-J. Chai Y.J. Navigating the Future of 3D Laparoscopic Liver Surgeries: Visualization of Internal Anatomy on Laparoscopic Images with Augmented Reality Surg. Laparosc. Endosc. Percutaneous Tech. 2024 34 459 465 10.1097/SLE.0000000000001307 38965779 49. Ramalhinho J. Yoo S. Dowrick T. Koo B. Somasundaram M. Gurusamy K. Hawkes D.J. Davidson B. Blandford A. Clarkson M.J. The value of augmented reality in surgery—A usability study on laparoscopic liver surgery Med. Image Anal. 2023 90 102943 10.1016/j.media.2023.102943 37703675 PMC10958137 50. Han Z. Dou Q. A Review on Organ Deformation Modeling Approaches for Reliable Surgical Navigation Using Augmented Reality Comput. Assist. Surg. 2024 29 2357164 10.1080/24699322.2024.2357164 39253945 51. Han Z. Zhou J. Pei J. Qin J. Fan Y. Dou Q. Towards Reliable AR-Guided Surgical Navigation: Interactive Deformation Modeling with Data-Driven Biomechanics and Prompts IEEE Trans. Med. Imaging 2025 in press 10.1109/TMI.2025.3577759 40489266 52. Ribeiro M. Espinel Y. Rabbani N. Pereira B. Bartoli A. Buc E. Augmented reality guided laparoscopic liver resection: A phantom study with intraparenchymal tumors J. Surg. Res. 2024 296 612 620 10.1016/j.jss.2023.12.014 38354617 53. Wierzbicki R. Pawłowicz M. Job J. Balawender R. Kostarczyk W. Stanuch M. Janc K. Skalski A. 3D mixed-reality visualization of medical imaging data as a supporting tool for innovative, minimally invasive surgery for gastrointestinal tumors and systemic treatment as a new path in personalized treatment of advanced cancer diseases J. Cancer Res. Clin. Oncol. 2022 148 237 243 10.1007/s00432-021-03680-w 34110490 PMC8752560 54. Wu X. Wang D. Xiang N. Pan M. Jia F. Yang J. Fang C. Augmented Reality-Assisted Navigation System Contributes to Better Intraoperative and Short-Time Outcomes of Laparoscopic Pancreaticoduodenectomy: A Retrospective Cohort Study Int. J. Surg. 2023 109 2598 2607 10.1097/JS9.0000000000000536 37338535 PMC10498855 55. Cheng K. You J. Wu S. Chen Z. Zhou Z. Guan J. Peng B. Wang X. Artificial Intelligence-Based Automated Laparoscopic Cholecystectomy Surgical Phase Recognition and Analysis Surg. Endosc. 2022 36 3160 3168 10.1007/s00464-021-08619-3 34231066 56. Tokuyasu T. Iwashita Y. Matsunobu Y. Kamiyama T. Ishikake M. Sakaguchi S. Ebe K. Tada K. Endo Y. Etoh T. Development of an Artificial Intelligence System Using Deep Learning to Indicate Anatomical Landmarks During Laparoscopic Cholecystectomy Surg. Endosc. 2021 35 1651 1658 10.1007/s00464-020-07548-x 32306111 PMC7940266 57. You J. Cai H. Wang Y. Bian A. Cheng K. Meng L. Wang X. Gao P. Chen S. Cai Y. Artificial intelligence automated surgical phases recognition in intraoperative videos of laparoscopic pancreatoduodenectomy Surg. Endosc. 2024 38 4894 4905 10.1007/s00464-024-10916-6 38958719 58. Laplante S. Namazi B. Kiani P. Hashimoto D.A. Alseidi A. Pasten M. Brunt L.M. Gill S. Davis B. Bloom M. Validation of an Artificial Intelligence Platform for the Guidance of Safe Laparoscopic Cholecystectomy Surg. Endosc. 2023 37 2260 2268 10.1007/s00464-022-09439-9 35918549 59. Kehagias D. Lampropoulos C. Bellou A. Kehagias I. Detection of anatomic landmarks during laparoscopic cholecystectomy with the use of artificial intelligence—A systematic review of the literature Updates Surg. 2025 77 1 17 10.1007/s13304-025-02227-9 40350500 60. Woo Y. Choi G.H. Min B.S. Hyung W.J. Novel application of simultaneous multi-image display during complex robotic abdominal procedures BMC Surg. 2014 14 13 10.1186/1471-2482-14-13 24628761 PMC4008309 61. Hashemi N. Mose M. Østergaard L.R. Bjerrum F. Hashemi M. Svendsen M.B.S. Friis M.L. Tolsgaard M.G. Rasmussen S. Video-based robotic surgical action recognition and skills assessment on porcine models using deep learning Surg. Endosc. 2025 39 1709 1719 10.1007/s00464-024-11486-3 39806176 PMC11870904 62. Saeidi H. Opfermann J.D. Kam M. Leonard S. Hsieh M.H. Kang J.U. Krieger A. Autonomous robotic laparoscopic surgery for intestinal anastomosis Sci. Robot. 2022 7 eabj2908 10.1126/scirobotics.abj2908 35080901 PMC8992572 63. Gruijthuijsen C. Garcia-Peraza-Herrera L.C. Borghesan G. Reynaerts D. Deprest J. Ourselin S. Vander Poorten E. Robotic endoscope control via autonomous instrument tracking Front. Robot. AI 2022 9 832208 10.3389/frobt.2022.832208 35480090 PMC9035496 64. Golany T. Aides A. Freedman D. Rabani N. Liu Y. Rivlin E. Corrado G.S. Matias Y. Khoury W. Kashtan H. Artificial intelligence for phase recognition in complex laparoscopic cholecystectomy Surg. Endosc. 2022 36 9215 9223 10.1007/s00464-022-09405-5 35941306 PMC9652206 65. Yang H.Y. Hong S.S. Yoon J. Park B. Yoon Y. Han D.H. Choi G.H. Choi M.-K. Kim S.H. Deep Learning-Based Surgical Phase Recognition in Laparoscopic Cholecystectomy Ann. Hepato-Biliary-Pancreat. Surg. 2024 28 466 473 10.14701/ahbps.24-091 PMC11599821 39069309 66. Mascagni P. Alapatt D. Garcia A. Okamoto N. Vardazaryan A. Costamagna G. Dallemagne B. Padoy N. Surgical Data Science for Safe Cholecystectomy: A Protocol for Segmentation of Hepatocystic Anatomy and Assessment of the Critical View of Safety arXiv 2021 2106.10916 67. Pei J. Zhou Z. Guo D. Li Z. Qin J. Du B. Heng P.-A. Synergistic Bleeding Region and Point Detection in Laparoscopic Surgical Videos arXiv 2025 2503.22174 68. Kamtam D.N. Shrager J.B. Malla S.D. Lin N. Cardona J.J. Kim J.J. Hu C. Deep learning approaches to surgical video segmentation and object detection: A scoping review arXiv 2025 2502.16459 10.1016/j.compbiomed.2025.110482 40460561 69. Kanani F. Zindel N. Mowbray N. Nesher E. Clinical outcomes, learning effectiveness, and patient-safety implications of AI-assisted HPB surgery for trainees: A systematic review and multiple meta-analyses Artif. Intell. Surg. 2025 5 387 417 10.20517/ais.2025.47 70. Romero F.P. Diler A. Bisson-Grégoire G. Turcotte S. Lapointe R. Vandenbroucke-Menu F. Tang A. Kadoury S. End-to-End Discriminative Deep Network for Liver Lesion Classification arXiv 2019 1901.09483 71. Huo Y. Cai J. Cheng C.-T. Raju A. Yan K. Landman B.A. Xiao J. Lu L. Liao C.-H. Harrison A.P. Harvesting, Detecting, and Characterizing Liver Lesions from Large-scale Multi-phase CT Data via Deep Dynamic Texture Learning arXiv 2020 2006.15691 72. Dumitrescu E.A. Ungureanu B.S. Cazacu I.M. Florescu L.M. Streba L. Croitoru V.M. Sur D. Croitoru A. Turcu-Stiolica A. Lungulescu C.V. Diagnostic Value of Artificial Intelligence-Assisted Endoscopic Ultrasound for Pancreatic Cancer: A Systematic Review and Meta-Analysis Diagnostics 2022 12 309 10.3390/diagnostics12020309 35204400 PMC8870917 73. Wang Q. Wang Z. Liu F. Wang Z. Ni Q. Chang H. Li B. Zhang Y. Chen X. Sun J. Machine Learning-Based Prediction of Postoperative Pancreatic Fistula after Laparoscopic Pancreaticoduodenectomy BMC Surg. 2025 25 191 10.1186/s12893-025-02935-4 40307833 PMC12045007 74. Wang P. Wang S. Luo P. Evaluation of the Effectiveness of Preoperative 3D Reconstruction Combined with Intraoperative Augmented Reality Fluorescence Guidance System in Laparoscopic Liver Surgery: A Retrospective Cohort Study BMC Surg. 2025 25 288 10.1186/s12893-025-02989-4 40616072 PMC12226913 75. Wu S. Tang M. Liu J. Qin D. Wang Y. Zhai S. Bi E. Li Y. Wang C. Xiong Y. Impact of an AI-based Laparoscopic Cholecystectomy Coaching Program on Surgical Performance: A Randomized Controlled Trial Int. J. Surg. 2024 110 7816 7823 10.1097/JS9.0000000000001798 38896869 PMC11634122 76. Li Z. Li F. Fu Q. Wang X. Liu H. Zhao Y. Ren W. Large language models and medical education: A paradigm shift in educator roles Smart Learn. Environ. 2024 11 26 10.1186/s40561-024-00313-w 77. U.S. Food and Drug Administration Artificial Intelligence and Machine Learning Software as a Medical Device (SaMD) Action Plan—Total Product Lifecycle (TPLC) Approach, Good Machine Learning Practice (GMLP), and Predetermined Change Control Plan (PCCP) Frameworks U.S. Food and Drug Administration Silver Spring, MD, USA 2025 78. U.S. Food and Drug Administration Artificial Intelligence-Enabled Device Software Functions: Lifecycle Management and Marketing Submission Recommendations Draft Guidance Released 6 January 2025 U.S. Food and Drug Administration Silver Spring, MD, USA 2025 79. Lekadir K. Frangi A.F. Porras A.R. Glocker B. Cintas C. Langlotz C.P. Weicken E. Asselbergs F.W. Prior F. Collins G.S. FUTURE-AI: International Consensus Guideline for Trustworthy and Deployable Artificial Intelligence in Healthcare BMJ 2025 388 e081554 10.1136/bmj-2024-081554 39909534 PMC11795397 80. Arjomandi Rad A. Vardanyan R. Athanasiou T. Maessen J. Sardari Nia P. The ethical considerations of integrating artificial intelligence into surgery: A review Interdiscip. Cardiovasc. Thorac. Surg. 2025 40 ivae192 10.1093/icvts/ivae192 39999009 PMC11904299 81. Gómez Bergin A.D. Craven M.P. Virtual, augmented, mixed, and extended reality interventions in healthcare: A systematic review of health economic evaluations and cost-effectiveness BMC Digit. Health 2023 1 53 10.1186/s44247-023-00054-9 82. Ye Z. Zhou R. Deng Z. Wang D. Zhu Y. Jin X. Zhang Q. Liu H. Li L. Xu Y. A Comprehensive Video Dataset for Surgical Laparoscopic Action Analysis Sci. Data 2025 12 862 10.1038/s41597-025-05093-7 40413211 PMC12103523 83. Wei J. Xiao Z. Sun D. Gong L. Yang Z. Liu Z. Wu J. Zhou J. Chen Y. Li Q. SurgBench: A Unified Large-Scale Benchmark for Surgical Video Analysis arXiv 2025 2506.07603 84. Chen G. Sha Y. Wang Z. Wang K. Chen L. The Role of Large Language Models (LLMs) in Hepato-Pancreato-Biliary Surgery: Opportunities and Challenges Cureus 2025 17 e85979 10.7759/cureus.85979 40666589 PMC12261375 85. Banerjee S. Wang D.S. Kim H.J. Sirlin C.B. Chan M.G. Korn R.L. Rutman A.M. Siripongsakun S. Lu D. Imanbayev G. A Computed Tomography Radiogenomic Biomarker Predicts Microvascular Invasion and Clinical Outcomes in Hepatocellular Carcinoma Hepatology 2015 62 792 800 10.1002/hep.27877 25930992 PMC4654334 86. Hashimoto D.A. Ward T.M. Meireles O.R. Rosman G. Meireles O.R. Alseidi A. Madani A. Pugh C.M. Jopling J. Trehan A. The Role of Artificial Intelligence in Surgery: A Review of Current and Future Applications JAMA Surg. 2022 157 368 376 Figure 1 A PRISMA 2020 flow diagram details the number of records identified, screened, excluded, and finally included. Figure 2 Publication trends (included studies per year). Figure 3 Geographic distribution (by first-author country). Figure 4 Study design distribution. Figure 5 Conceptual overview of AI tools across the surgical timeline in HPB surgery. The figure summarizes representative tools and functionalities categorized by phase: preoperative (e.g., 3D reconstruction, surgical planning), intraoperative (e.g., augmented reality navigation, bleeding detection), and postoperative (e.g., outcome prediction, ICU forecasting). Colors denote stage—orange = preoperative, blue = intraoperative, green = postoperative. Green horizontal arrow indicates the continuum and progression of clinical workflow; it is directional only and does not imply magnitude, effect size or superiority. Icons are schematic as boundaries between stages may overlap in practice. jcm-14-06501-t001_Table 1 Table 1 Representative peer-reviewed studies on AI and digital tools in HPB surgery. Study (Author, Year) AI Method or Tool Target Organ/Disease Focus Clinical Application Performance Metrics Study Type Bektas et al., 2024 [ 4 Radiomics + CNN on ultrasound imaging Liver (HCC tumors) Imaging diagnosis (tumor classification; recurrence prediction) AUC ~0.81–0.85 for early HCC recurrence (outperformed clinical risk factors); high accuracy distinguishing HCC vs. metastases Retrospective cohort study (imaging analysis) Tong et al., 2022 [ 22 Deep CNN (ResNet-50) on EUS images Pancreas (PDAC vs. chronic pancreatitis) Imaging diagnosis (tumor differentiation) AUC ≈ 0.95 for PDAC detection (vs. pancreatitis); demonstrated high diagnostic accuracy as decision support in borderline cases Retrospective diagnostic study (multi-center image dataset) Kawamura et al., 2023 [ 23 CNN-based video analysis for critical view of safety (CVS) identification Biliary (CVS during cholecystectomy) Intraoperative safety guidance (anatomic landmark confirmation) Real-time CVS recognition with ~83% overall accuracy; could alert surgeons to incomplete CVS, aiming to prevent bile duct injury Retrospective observational study (analysis of recorded LC videos) Müller et al., 2025 [ 24 Ensemble ML algorithms on clinical data Pancreas (postoperative fistula risk) Outcome risk prediction (complication risk stratification) AUC ~0.80 for clinically relevant POPF (vs. <0.60 with Fistula Risk Score); ML model significantly improved risk prediction Retrospective cohort study (model development & validation) Wang et al., 2025 [ 25 Mixed reality (Hololens) with 3D liver model overlay Liver (tumor cases) Surgical planning (preoperative simulation & education) Qualitative improvements in anatomical understanding and surgical strategy planning (holographic tumor visualization); no quantitative metrics reported Prospective case series (pilot implementation of MR planning) Giannone et al., 2021 [ 26 Augmented reality overlay in robotic surgery Liver (robotic hepatectomy for tumors) Intraoperative guidance (real-time image guidance) Feasible AR overlay of tumor and vasculature during surgery; improved lesion localization and transection planning (qualitative), though registration accuracy was a noted limitation Prospective pilot study (feasibility in 3 cases) Crisan et al., 2023 [ 27 YOLOv5 deep learning vision + AR display Intraoperative bleeding (multiple HPB procedures) Intraoperative hazard detection (real-time bleed alert) Detected surgical bleeding in real time with high accuracy (distinguished blood vs. irrigation fluid); demonstrated concept of automated hazard alerts via AR headset Experimental feasibility study (lab validation on recorded surgery videos) Pomohaci et al., 2025 [ 28 N/A (Systematic review of AI in imaging) Liver imaging (various pathologies) Imaging diagnosis (lesion detection & classification)—review N/A (Reviewed 329 studies: most focused on lesion classification; CT was the most common modality; highlighted lack of external validation in many studies) Systematic review (2018–2024 literature) Cheng et al., 2024 [ 29 Concept: HPB cancers (tumor margins) Intraoperative guidance (augmented fluorescence surgery) N/A (Conceptual proposal: AI can enhance fluorescence image quality and differentiate tumor vs. normal tissue signals, potentially improving margin detection and resection precision) Perspective article (conceptual review of emerging techniques) Abbreviations: HCC—hepatocellular carcinoma; PDAC—pancreatic ductal adenocarcinoma; AUC—area under curve; CNN—convolutional neural network; ML—machine learning; LC—laparoscopic cholecystectomy; CVS—critical view of safety; AR—augmented reality; MR—mixed reality; POPF—postoperative pancreatic fistula. ",
  "metadata": {
    "Title of this paper": "The Role of Artificial Intelligence in Surgery: A Review of Current and Future Applications",
    "Journal it was published in:": "Journal of Clinical Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470296/"
  }
}