{
  "title": "Paper_946",
  "abstract": "pmc Pharmaceutics Pharmaceutics 2103 pharmamdpi pharmaceutics Pharmaceutics 1999-4923 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473587 PMC12473587.1 12473587 12473587 41012528 10.3390/pharmaceutics17091192 pharmaceutics-17-01192 1 Review Recent Advances in Supramolecular Systems for Precision Medicine: Structural Design, Functional Integration, and Clinical Translation Challenges Ma Xiaomin 1 † Xiao Yazhe 2 † Li Shuyu 1 Du Jianghai 1 https://orcid.org/0000-0003-4094-8632 Wang Junjie 2 * https://orcid.org/0000-0002-3450-7614 Peng Xingzhou 1 * Soica Codruta Academic Editor Dehelean Cristina Adriana Academic Editor Ikeda Yasumasa Academic Editor Moacă Elena-Alina Academic Editor Trandafirescu Cristina Academic Editor 1 maxiaomin@hainanu.edu.cn lishuyu@hainanu.edu.cn dujianghai@hainanu.edu.cn 2 * wangjunjie@muhn.edu.cn pengxzh@hainanu.edu.cn † These authors contributed equally to this work. 13 9 2025 9 2025 17 9 497664 1192 01 7 2025 18 8 2025 05 9 2025 13 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Non-covalent and dynamic covalent interactions enable supramolecular systems to function as adaptive platforms in biomedical research, offering novel strategies for precision medicine applications. This review examines five-year developments in supramolecular applications across precision medical domains, including disease diagnosis, bioimaging, targeted drug delivery, tissue engineering, and gene therapy. The review begins by systematically categorizing supramolecular structures into dynamic covalent systems (e.g., disulfide bonds, boronate esters, and hydrazone bonds) and dynamic non-covalent systems (e.g., host–guest interactions, hydrogen-bond networks, metal coordination, and π–π stacking), highlighting current strategies employed to optimize their responsiveness, stability, and targeting efficiency. Representative case studies, such as cyclodextrin-based nanocarriers and metal–organic frameworks (MOFs), are thoroughly analyzed to illustrate how supramolecular systems can enhance precision in drug delivery and improve biocompatibility. Furthermore, this article critically discusses major challenges faced during clinical translation, encompassing structural instability, inadequate specificity of environmental responsiveness, pharmacokinetic and toxicity concerns, and difficulties in scalable manufacturing. Potential future directions to overcome these barriers are proposed, emphasizing biomimetic interface engineering and dynamic crosslinking strategies. Collectively, the continued evolution in structural optimization and functional integration within supramolecular systems holds great promise for achieving personalized diagnostic and therapeutic platforms, thereby accelerating their translation into clinical practice and profoundly shaping the future landscape of precision medicine. supramolecular systems precision medicine dynamic covalent bonds host–guest interactions targeted drug delivery bioimaging clinical translation biomimetic engineering stimuli-responsive materials personalized therapy Hainan Province Science and Technology Special Fund ZDYF2025SHFZ045 Hainan Provincial Natural Science Foundation of China 823RC472 Education Department of Hainan Province Hnky2024ZD-12 This research was funded by Hainan Province Science and Technology Special Fund, grant number: ZDYF2025SHFZ045, the Hainan Provincial Natural Science Foundation of China, grant number: 823RC472, and the Education Department of Hainan Province, grant number: Hnky2024ZD-12. And The APC was funded by the Hainan Province Science and Technology Special Fund, the Hainan Provincial Natural Science Foundation of China, and the Education Department of Hainan Province. We thank the Hainan University School of Biomedical Engineering for the support in data acquisition and the Analytical & Testing Center of Hainan University. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The foundational work in supramolecular chemistry, pioneered by Jean-Marie Lehn in the 1980s and recognized with the Nobel Prize, shifted the research paradigm from isolated molecular properties to functional systems governed by intermolecular interactions [ 1 −1 2 3 4 5 6 Conventional medical approaches face significant limitations in treating complex diseases, particularly cancers and chronic disorders. Challenges include systemic toxicity from non-specific chemotherapeutic agents, inefficient delivery of gene therapy vectors, and the inability of traditional tissue scaffolds to replicate the dynamic extracellular matrix (ECM) microenvironment [ 7 8 9 10 11 Supramolecular systems provide powerful impetus for precision medicine through their unique dynamic properties and molecular recognition capabilities. Relying on relatively weak non-covalent interactions, supramolecular assemblies exhibit high sensitivity to physiological triggers, including pH gradients, temperature fluctuations, light irradiation, and specific enzyme activation [ 12 13 14 15 A central challenge in precision medicine lies in achieving molecularly targeted recognition and regulation. Supramolecular systems address this through programmable non-covalent interactions—such as host–guest recognition, hydrogen-bond networks, and π–π stacking [ 4 16 17 14 18 19 20 21 22 Thus, supramolecular systems serve as pivotal bridges connecting fundamental molecular science with clinical biomedicine. Their dynamic adaptability, precise molecular recognition, and multifunctional integration are reshaping the theoretical foundations of drug delivery, diagnostics, and tissue regeneration, accelerating the realization of personalized precision medicine [ 23 24 Nevertheless, translating laboratory breakthroughs into clinical practice remains challenging. The clinical translation of supramolecular systems confronts substantial hurdles. Biocompatibility concerns persist, including potential bioaccumulation or toxicity of components (e.g., rare-earth elements, specific organic ligands) [ 25 26 27 28 This review focuses on the latest representative advances of supramolecular systems in driving precision medicine. The content will center on their structural design principles (dynamic covalent assemblies and non-covalent assemblies; see Figure 1 Table 1 29 30 31 14 32 33 2. Classification and Design Strategies for Supramolecular Systems Biomedical supramolecular systems require classification based on both functional roles and underlying interaction mechanisms. With the increasing integration of supramolecular chemistry and biomedical science, these systems can be broadly divided into two principal categories: dynamic covalent supramolecular systems and dynamic non-covalent supramolecular systems. Such classification encompasses bonding mechanisms (covalent versus non-covalent) alongside biomedical functional requirements, such as stimuli-responsiveness, targeting specificity, and biocompatibility. Within the dynamic non-covalent category, further subclassifications include host–guest complexes, hydrogen-bonding network systems, metal-coordinated assemblies, and π–π stacked architectures, collectively spanning the continuum from molecular design to clinical translation. Dynamic covalent systems are constructed via reversible covalent bonds (e.g., disulfide, boronate ester, and hydrazone linkages), which allow the formation of stimuli-responsive structures tailored to physiological conditions [ 77 78 79 Figure 2 80 81 2.1. Dynamic Covalent Supramolecular Systems Reversible covalent linkages enable dynamic systems to serve as degradable drug carriers and tissue engineering scaffolds. A representative example involves disulfide-based constructions, which are responsive to redox conditions. In such systems, thiol-containing molecules (e.g., cysteine or thiolated PEG) undergo disulfide bond cleavage or formation in response to environmental redox stimuli [ 34 35 36 Other representative systems include boronate ester and hydrazone linkages, which exhibit sensitivity to pH variations in physiological environments. Boronate esters (B–O–C bonds) hydrolyze under mildly acidic conditions (pH ≈ 6.5), making them particularly suitable for inflammation- or tumor-targeted applications [ 37 38 39 Despite the benefits of structural responsiveness and tunability, dynamic covalent systems face notable limitations. From a bond energy perspective, strong covalent linkages impart high systemic stability but require harsh triggers—such as elevated temperature or low pH—for bond cleavage, which exceed physiological tolerances and limit in vivo applicability. Conversely, weaker covalent bonds (e.g., acylhydrazones) are more responsive but prone to premature cleavage in circulation, leading to untimely drug release [ 40 41 42 2.2. Dynamic Non-Covalent Supramolecular Systems Dynamic non-covalent supramolecular systems have emerged as a central focus in biomedical supramolecular research, owing to their unique reliance on weak, reversible interactions such as hydrogen bonding, metal coordination, host–guest recognition, and π–π stacking, typically characterized by bond energies in the range of 4–21 kJ mol −1 81 4 5 18 2.2.1. Host–Guest Supramolecular Systems Host–guest recognition represents one of the fundamental principles of supramolecular chemistry, wherein selective binding is achieved between a host and a guest molecule through structural complementarity (in terms of size and geometry) and energy compatibility (via non-covalent interactions such as hydrogen bonding, hydrophobic effects, π–π stacking, and electrostatic forces) [ 11 12 11 Representative host molecules—including crown ethers, cyclodextrins [ 20 Figure 3 12 17 20 43 44 45 46 Host–guest recognition is also widely observed in biological systems. Antigen–antibody interactions involve complementarity between the Fab region of antibodies and specific epitopes through hydrogen-bonding networks and hydrophobic contacts; transcription factors insert α-helices into the major groove of DNA and achieve sequence specificity via hydrogen bonding (e.g., adenine-N 6 12 13 Despite their dynamic responsiveness and modularity, host–guest systems face limitations in targeted delivery and drug loading, necessitating further chemical optimization. For example, once introduced into the bloodstream, supramolecular nanoparticles rapidly adsorb serum proteins to form a “protein corona”, which can obscure targeting ligands or alter binding specificity. Additionally, the constrained cavity size and polarity of macrocyclic hosts impose inherent restrictions on the range and type of guest molecules that can be encapsulated. 2.2.2. Dynamic Systems Based on Hydrogen-Bonding Networks Hydrogen-bonding networks are generally classified into three types based on their structural complexity and interaction modes: (1) primary networks rely on single, reversible hydrogen bonds, offering directionality and dynamic reversibility; (2) dual cross-linked networks integrate multiple hydrogen bonding motifs or combine hydrogen bonds with other reversible interactions, such as covalent hybrids or metal coordination, to enhance structural stability and responsiveness; and (3) multivalent cross-linked networks involve cooperative interactions among multiple dynamic bonds, often including triple or quadruple hydrogen bonding arrays. These densely packed networks provide high binding affinity, mechanical robustness, and excellent self-healing capabilities, making them suitable for applications such as biomimetic scaffolds, supramolecular adhesives, and stimuli-responsive hydrogels [ 47 Primary hydrogen-bond networks are built upon electrostatic attractions between electronegative atoms (e.g., O, N, and F) and hydrogen atoms, resulting in dynamic or static interaction matrices. With interaction strengths ranging from 1 to 40 kJ mol −1 Figure 4 48 Dual cross-linked networks integrate hydrogen bonding with additional reversible interactions to achieve enhanced stability and environmental responsiveness. A representative system is carboxyl–amine hydrogen-bonded supramolecular assemblies, arising from electrostatic and orbital hybridization between carboxyl oxygen atoms and hydrogen donors in amino groups (–NH 2 77 78 Figure 4 49 50 51 Multivalent hydrogen-bonding networks are molecular architectures formed through directional hydrogen bonds between complementary donor and acceptor groups, establishing highly specific and reversible interactions that enhance binding affinity and structural stability, as demonstrated in quadruple hydrogen-bonding systems like ureido-pyrimidinone (UPy) dimer [ 81 Figure 4 52 53 Nonetheless, the application of hydrogen-bond-driven supramolecular systems is constrained by intrinsic limitations and physiological complexities [ 54 55 56 57 Building upon strategies to enhance system stability (e.g., dynamic covalent–hydrogen bond hybrids introduced in [ 58 58 47 59 2.2.3. Metal-Coordinated Supramolecular Systems Metal-coordinated supramolecular systems are dynamic functional assemblies formed through coordination interactions between metal ions and organic ligands ( Figure 5 22 13 Metal ions commonly employed in coordination assemblies can be broadly classified into three categories: transition metals, rare-earth metals, and main-group metals. Transition metals (e.g., Fe 2 3 2 2 25 60 2 3 60 2+ 61 2 62 Rare-earth metals (e.g., Gd 3+ 3+ 3+ 25 Main-group metals (e.g., Mg 2+ 2+ 3+ 2+ 2+ 63 Despite their promise, metal-coordinated supramolecular systems face several inherent challenges rooted in metal-specific properties and coordination chemistry. For transition metals, concerns include potential cytotoxicity from free metal ions (e.g., Pt 2+ 2+ 64 65 3+ 25 2+ 63 3. Current Research Progress 3.1. Applications of Supramolecular Systems in Disease Diagnosis In the field of bioimaging, supramolecular biomaterials have demonstrated unique advantages in visualizing biological processes at the molecular level. By incorporating imaging agents into their architectures, these systems can significantly enhance the contrast and resolution of various imaging modalities, including magnetic resonance imaging (MRI), fluorescence imaging, and positron emission tomography (PET) [ 46 82 83 A major clinical challenge remains the rapid clearance of imaging probes from pathological sites by the immune system, particularly the mononuclear phagocyte system (MPS), which compromises both retention time and imaging efficiency [ 84 85 Figure 6 84 84 86 Abnormal levels of biothiols such as cysteine, homocysteine, and glutathione have been implicated in the pathogenesis of various diseases, including Alzheimer’s disease, Parkinson’s disease, and HIV/AIDS. Given the critical roles of these thiol-containing species in cellular redox homeostasis, the development of real-time sensing platforms for monitoring intracellular biothiol concentrations is essential for elucidating their pathophysiological relevance [ 30 66 Two major classes of supramolecular bioorganic complexes have emerged for targeted bioimaging: protein–dye conjugates and protein-responsive nanomaterials [ 87 2 2 Figure 6 67 Figure 6 68 To achieve tumor-specific imaging, supramolecular MRI contrast agents have been designed to target overexpressed receptors on cancer cell surfaces, leveraging hydrogen bonding, π–π stacking, and hydrophobic interactions to promote accumulation at pathological sites [ 88 31 18 3.2. Applications of Supramolecular Systems in Therapeutic Strategies 3.2.1. Supramolecular Drug Delivery Systems In cancer therapy, imaging plays a critical role in delineating tumor location, size, morphology, and spatial relationships with surrounding tissues. When integrated with treatment protocols, it also enables real-time monitoring of drug release and activation kinetics [ 89 90 91 92 Cyclodextrins (CDs) represent a key class of supramolecular hosts widely employed in drug delivery owing to their favorable targeting capabilities, structural stability, and biocompatibility, making them highly suitable for clinical translation [ 93 94 95 Figure 7 14 Supramolecular coordination complexes represent structurally predictable and size-tunable self-assembled architectures, constructed through directional coordination between metal centers and organic ligands. Their intrinsic hydrophobicity and scalable cavity dimensions facilitate efficient drug encapsulation and transport [ 96 32 33 High-output nitric oxide (NO) generated by inducible nitric oxide synthase (iNOS) following inflammatory activation plays a critical role in the pathogenesis of various diseases, particularly septic shock [ 97 98 The integration of nanotechnology with photosensitizers in photodynamic therapy (PDT) has enabled precise tumor ablation while improving the spatial selectivity and reducing off-target toxicity of photosensitizing agents [ 99 100 Figure 7 15 Traditional irreversibly crosslinked hydrogels, while mechanically robust, lack the dynamic properties of the native extracellular matrix (ECM)—a feature essential for tissue regeneration [ 101 102 103 69 104 As the body’s largest organ, the skin is particularly susceptible to environmental insults, and severe wounds can substantially impair healing [ 105 106 89 70 Autologous chondrocyte implantation (ACI)—currently a standard treatment for cartilage degeneration—involves harvesting, expanding, and reimplanting patient-derived chondrocytes. However, ACI remains limited by prolonged recovery, extensive suturing, and potential cell leakage [ 107 108 Figure 7 71 Gastric ulcers are a very common gastrointestinal disease, and their primary pathogenesis is closely associated with oxidative imbalance caused by excessive production of reactive oxygen species (ROS) in the body [ 109 110 111 N O N N Figure 7 72 3.2.2. Applications of Supramolecular Systems in Antimicrobial Therapy Incorporating recognition moieties capable of selectively binding to specific polysaccharides or proteins on bacterial cell walls enables supramolecular systems to achieve targeted bacterial capture. For example, β-glucan and polysaccharide modifications on thermally reduced graphene oxide (TRGO) composites have been shown to enhance bacterial adsorption and aggregation. Upon laser irradiation, these assemblies facilitate infrared-triggered bactericidal effects. The supramolecular interactions introduced by β-glucan and polysaccharides further stabilize the system, improving bacterial binding and release performance [ 112 Host–guest interactions between Cucurbit[10]uril and porphyrin have also been exploited to construct water-soluble supramolecular porphyrins with selective antimicrobial activity. Wu and colleagues developed a bacteria-responsive photothermal therapy (PTT) platform in the near-infrared region, wherein π–π stacking and hydrophobic aggregation of porphyrin molecules were effectively suppressed by Cucurbit[10]uril, leading to improved photostability and enhanced photothermal conversion efficiency. Due to the matching redox potential between facultative anaerobic E. coli Figure 8 73 Although antimicrobial peptides (AMPs) are promising natural drugs that can effectively inhibit cervical cancer, their poor bioavailability, low tumor selectivity, and non-selective toxicity still hinder their further application in vivo. To effectively address these challenges, the Pan team developed a nanomedicine, CEC-OxbCD, which is an AMP oxidized in response to β-cyclodextrin, synthesized using a nano-self-assembly method, for the selective treatment of cervical cancer. Under the stimulation of tumor-derived reactive oxygen species (ROS), the nanodrug effectively dissociates, leading to the rapid, on-demand release of antimicrobial peptides with a 90% release rate. This supramolecular nanodrug enhances drug uptake by cells and improves drug accumulation efficiency at tumor sites. This phenomenon can be attributed to the enhanced hydrophilic stability of the supramolecular structure, thereby prolonging the circulation time in the bloodstream [ 74 Antimicrobial peptide (AMP)-based supramolecular hydrogels, such as those self-assembled from C8-G(IIKK) 2 2 2 2 Staphylococcus aureus 113 Compared to traditional hydrogels, 3D-printed hydrogels offer several notable advantages. Not only do they significantly reduce production time, but they also enable the creation of materials with more complex structures [ 114 115 116 117 75 Figure 8 3.2.3. Applications of Supramolecular Systems in Gene Therapy Gene therapy holds significant promise for the treatment of intractable diseases by enabling precise modulation of genomic or transcriptomic targets, including both coding and non-coding RNAs. To ensure the safe and efficient delivery of therapeutic nucleic acids such as DNA, miRNA mimics, siRNA, and mRNA, both viral and non-viral delivery systems have been extensively developed [ 118 76 Effective gene editing in vivo requires vectors capable of delivering editing tools to specific organs and tissues with high precision and minimal off-target effects [ 119 120 120 A major challenge in tissue engineering is the formation of functional vascular networks within scaffolds [ 121 122 Co-delivery strategies integrating potent chemotherapeutic agents with gene therapy have shown synergistic effects in tumor suppression. The hydrophobic cavity of γ-CD encapsulated PTX, while pDNA formed electrostatic complexes with the cationic polymer shell, yielding positively charged nanoparticles capable of targeted delivery to folate receptor-overexpressing cancer cells. This multifunctional co-delivery system offers a promising strategy for synergistic chemo–gene therapy [ 29 123 4. Challenges and Future Directions 4.1. Current Challenges Although supramolecular systems show great potential in the field of biomedical translation, they still face a series of fundamental challenges. Structurally, these systems rely on weak noncovalent interactions such as hydrogen bonds and hydrophobic interactions, making them extremely sensitive to fluctuations in temperature, pH, and ionic strength in physiological environments, and often lacking structural stability in vivo [ 28 124 9 In terms of biocompatibility, certain materials may produce cytotoxic degradation products (such as long-term retained cyclodextrin derivatives), and some synthetic units require biocompatible coating modifications to avoid immunogenicity [ 64 125 126 7 Another bottleneck in translational applications lies in large-scale production [ 27 4.2. Future Directions In the future, the research focus of supramolecular biomedicine will be centered on several key directions: first, developing multimodal environment-responsive carriers that can synergistically respond to tumor microenvironment characteristics (such as acidic pH, elevated reactive oxygen species, and overexpressed enzymes such as MMP-2) and exogenous stimuli (light, heat, and magnetism) to achieve integrated diagnosis and treatment [ 22 127 128 At the diagnostic level, supramolecular probes integrating fluorescent or MRI reporting groups hold promise for real-time tracking of in vivo therapeutic distribution [ 129 130 131 132 5. Conclusions Supramolecular systems, defined by their dynamic reversibility and stimuli-responsiveness mediated through non-covalent interactions, have emerged as a multidisciplinary research frontier with substantial implications for biomedicine. This review has delineated major supramolecular architectures—spanning dynamic covalent and non-covalent assemblies—alongside their underlying interaction mechanisms, structural design principles, and functional applications. Dynamic covalent systems, employing reversible linkages such as disulfide, boronate ester, and hydrazone bonds, enable targeted degradation and controlled drug release within the tumor microenvironment, offering innovative strategies for cancer therapy. Meanwhile, non-covalent systems leverage interactions such as hydrogen bonding and metal coordination to support adaptive, reversible behavior. Representative host–guest complexes—including cyclodextrins, cucurbiturils, and pillararenes—as well as mechanically interlocked molecules (e.g., rotaxanes), facilitate intelligent drug delivery and molecular sensing. Furthermore, dynamic hydrogen-bonded networks, metal–organic frameworks, and π–π stacked assemblies have demonstrated environmental responsiveness and multifunctionality, enabling applications in controlled drug release, antimicrobial treatment, and flexible biomedical devices. In diagnostics, supramolecular probes based on molecular recognition afford high sensitivity and selectivity for biomarker detection and imaging, improving the accuracy of early disease diagnosis. In therapeutic contexts, supramolecular nanocarriers, antimicrobial materials, and gene-delivery platforms leverage dynamic behavior to enhance efficacy, biocompatibility, and target specificity. Nonetheless, significant challenges remain. Issues such as structural instability, limited control over self-assembly, immunogenicity, suboptimal delivery efficiency, and difficulties in scalable production continue to impede clinical translation. To overcome these barriers, future research must focus on the design of intelligent, stimuli-responsive carriers (e.g., pH-, enzyme-, or light-triggered systems) and personalized therapeutic platforms that integrate gene-editing technologies and tailored delivery vehicles. The incorporation of biomimetic structures, multimodal imaging modalities, and AI-driven material design is expected to facilitate precise diagnostics and treatment. Concurrently, the development of biodegradable, self-healing, and eco-friendly materials will be critical to advancing supramolecular technologies toward sustainable and clinically translatable solutions. Acknowledgments Thanks to all the authors for their contributions to this article. Disclaimer/Publisher’s Note: Author Contributions Conceptualization: X.M., S.L., Y.X. and J.D.; writing—original draft preparation: X.M., S.L. and Y.X.; review and editing: X.P., J.W., X.M. and Y.X.; supervision: X.P. and J.W. All authors have read and agreed to the published version of the manuscript. Data Availability Statement Data will be made available on request. Conflicts of Interest The authors declare no conflicts of interest. References 1. Lehn J.-M. Supramolecular chemistry—Scope and perspectives molecules, supermolecules, and molecular devices (nobel lecture) Angew. Chem. Int. Ed. 1988 27 89 112 10.1002/anie.198800891 2. Lehn J.M. Cryptates: The chemistry of macropolycyclic inclusion complexes Acc. Chem. Res. 1978 11 49 57 10.1021/ar50122a001 3. Lehn J.-M. Supramolecular chemistry: Receptors, catalysts, and carriers Science 1985 227 849 856 10.1126/science.227.4689.849 17821215 4. Zhuang W.-R. Wang Y. Cui P.-F. Xing L. Lee J. Kim D. Jiang H.-L. Oh Y.-K. Applications of π–π stacking interactions in the design of drug-delivery systems J. Control Release 2019 294 311 326 10.1016/j.jconrel.2018.12.014 30550939 5. Dong R.J. Zhou Y.F. Huang X.H. Zhu X.Y. Lu Y.F. Shen J. Functional supramolecular polymers for biomedical applications Adv. Mater. 2015 27 498 526 10.1002/adma.201402975 25393728 6. Lundberg D.J. Brown C.M. Bobylev E.O. Oldenhuis N.J. Alfaraj Y.S. Zhao J. Kevlishvili I. Kulik H.J. Johnson J.A. Nested non-covalent interactions expand the functions of supramolecular polymer networks Nat. Commun. 2024 15 3951 10.1038/s41467-024-47666-x 38730254 PMC11087514 7. Thakor A.S. The third pillar of precision medicine—Precision delivery Medcomm 2025 6 e70200 10.1002/mco2.70200 40297244 PMC12035764 8. Chen Q. Sun P. Zhou J. Long T. Xiao A. Liu Z. Xu S. Lei W. Zhang R. Tian J. Renal tubular gsdme protects cisplatin nephrotoxicity by impeding ogt-stat3-s100a7a axis in male mice Nat. Commun. 2025 16 6807 10.1038/s41467-025-62071-8 40707439 PMC12289953 9. Lu P. Ruan D. Huang M. Tian M. Zhu K. Gan Z. Xiao Z. Harnessing the potential of hydrogels for advanced therapeutic applications: Current achievements and future directions Signal Transduct. Target. 2024 9 166 10.1038/s41392-024-01852-x PMC11214942 38945949 10. Liu L. Huang F. Liu J. Xiao M. Recent advances of supramolecular systems in precise cancer theranostics Supramol. Mater. 2025 4 100116 10.1016/j.supmat.2025.100116 11. Yang X. Yang C. Zhang S. Geng H. Zhu A.X. Bernards R. Qin W. Fan J. Wang C. Gao Q. Precision treatment in advanced hepatocellular carcinoma Cancer Cell 2024 42 180 197 10.1016/j.ccell.2024.01.007 38350421 12. Joseph K. De Waal B. Jansen S.A.H. Van Der Tol J.J.B. Vantomme G. Meijer E.W. Consequences of vibrational strong coupling on supramolecular polymerization of porphyrins J. Am. Chem. Soc. 2024 146 12130 12137 10.1021/jacs.4c02267 38642054 PMC11066862 13. Nuthanakanti A. Srivatsan S.G. Multi-stimuli responsive heterotypic hydrogels based on nucleolipids show selective dye adsorption Nanoscale Adv. 2020 2 4161 4171 10.1039/D0NA00509F 34286214 PMC7611312 14. Bai H. Wang J. Phan C.U. Chen Q. Hu X. Shao G. Zhou J. Lai L. Tang G. Cyclodextrin-based host-guest complexes loaded with regorafenib for colorectal cancer treatment Nat. Commun. 2021 12 759 10.1038/s41467-021-21071-0 33536421 PMC7858623 15. Li S. Zou Q. Li Y. Yuan C. Xing R. Yan X. Smart peptide-based supramolecular photodynamic metallo-nanodrugs designed by multicomponent coordination self-assembly J. Am. Chem. Soc. 2018 140 10794 10802 10.1021/jacs.8b04912 30102029 16. Lai J.-C. Li L. Wang D.-P. Zhang M.-H. Mo S.-R. Wang X. Zeng K.-Y. Li C.-H. Jiang Q. You X.-Z. A rigid and healable polymer cross-linked by weak but abundant zn(ii)-carboxylate interactions Nat. Commun. 2018 9 2725 10.1038/s41467-018-05285-3 30006515 PMC6045665 17. Yuan M. Chen T. Jin L. Zhang P. Xie L. Zhou S. Fan L. Wang L. Zhang C. Tang N. A carrier-free supramolecular nano-twin-drug for overcoming irinotecan-resistance and enhancing efficacy against colorectal cancer J. Nanobiotechnol. 2023 21 393 10.1186/s12951-023-02157-x 37898773 PMC10612220 18. D’orchymont F. Holland J.P. Supramolecular rotaxane-based multi-modal probes for cancer biomarker imaging Angew. Chem. Int. Ed. 2022 134 e202204072 10.1002/ange.202204072 PMC9400884 35532102 19. Ooi Y.J. Wen Y.T. Zhu J.L. Song X. Li J. Codelivery of doxorubicin and p53 Biomacromolecules 2024 25 2980 2989 10.1021/acs.biomac.4c00123 38587905 20. Narayanan G. Shen J. Matai I. Sachdev A. Boy R. Tonelli A.E. Cyclodextrin-based nanostructures Prog. Mater. Sci. 2022 124 100869 10.1016/j.pmatsci.2021.100869 21. Liu J. Wang Z. Cheng P. Zaworotko M.J. Chen Y. Zhang Z. Post-synthetic modifications of metal–organic cages Nat. Rev. Chem. 2022 6 339 356 10.1038/s41570-022-00380-y 37117929 22. Wu X. Wang C. Wang J. Feng Y. Zhu Y. Pan Y. Yuan Y. Chen C. Cao J. Lin J. Antiadhesive, antibacterial, and anti-inflammatory sandwich-structured zif8-containing gauze for enhanced wound healing Chem. Eng. J. 2024 491 152060 10.1016/j.cej.2024.152060 23. Karimi M. Eslami M. Sahandi-Zangabad P. Mirab F. Farajisafiloo N. Shafaei Z. Ghosh D. Bozorgomid M. Dashkhaneh F. Hamblin M.R. Ph-sensitive stimulus-responsive nanocarriers for targeted delivery of therapeutic agents WIREs Nanomed. Nanobiotechnol. 2016 8 696 716 10.1002/wnan.1389 26762467 PMC4945487 24. Dheeraj S. Chandana M. Rupa M. Soumya M. Chhaya A. Deep Shikha S. Insight into the recent developments of nanoparticles in treatment of cancer and neuro-degenerative disease: A review Curr. Top. Med. Chem. 2025 25 1 16 10.2174/0115680266347145250321085902 40211999 25. Leng J. Wang N. Chang X.L. Zhang X.P. Xu J. Yang Z.L. Qian K.L. Zheng Z.Q. Tao G.H. Jia X.D. Neodymium nitrate promotes the apoptosis of mouse liver cells via bcl2l1/caspase 3 pathway Toxicol. Mech. Methods 2025 18:16 3911 10.1080/15376516.2025.2501253 40331883 26. Oh J.Y. Kim H.S. Palanikumar L. Go E.M. Jana B. Park S.A. Kim H.Y. Kim K. Seo J.K. Kwak S.K. Cloaking nanoparticles with protein corona shield for targeted drug delivery Nat. Commun. 2018 9 4548 10.1038/s41467-018-06979-4 30382085 PMC6208370 27. Zheng Y. Baidya A. Annabi N. Molecular design of an ultra-strong tissue adhesive hydrogel with tunable multifunctionality Bioact. Mater. 2023 29 214 229 10.1016/j.bioactmat.2023.06.007 37520304 PMC10372327 28. Zhou Y. Wang X. Zhang D. Cui H. Tian X. Du W. Yang Z. Wan D. Qiu Z. Liu C. Precision-guided stealth missiles in biomedicine: Biological carrier-mediated nanomedicine hitchhiking strategy Adv. Sci. 2025 12 2504672 10.1002/advs.202504672 PMC12140387 40345158 29. Zhao F. Yin H. Li J. Supramolecular self-assembly forming a multifunctional synergistic system for targeted co-delivery of gene and drug Biomaterials 2014 35 1050 1062 10.1016/j.biomaterials.2013.10.044 24189097 30. Zhang Y. Wang X. Bai X. Li P. Su D. Zhang W. Zhang W. Tang B. Highly specific cys fluorescence probe for living mouse brain imaging via evading reaction with other biothiols Anal. Chem. 2019 91 8591 8594 10.1021/acs.analchem.9b01878 31140781 31. Lee H. Shahrivarkevishahi A. Lumata J.L. Luzuriaga M.A. Hagge L.M. Benjamin C.E. Brohlin O.R. Parish C.R. Firouzi H.R. Nielsen S.O. Supramolecular and biomacromolecular enhancement of metal-free magnetic resonance imaging contrast agents Chem. Sci. 2020 11 2045 2050 10.1039/C9SC05510J 32180926 PMC7053506 32. Li Y. Huang F. Stang P.J. Yin S. Supramolecular coordination complexes for synergistic cancer therapy Acc. Chem. Res. 2024 57 1174 1187 10.1021/acs.accounts.4c00031 38557015 33. António J.P.M. Gandioso A. Nemati F. Soliman N. Vinck R. Sun F. Robert C. Burckel P. Decaudin D. Thomas C.M. Polymeric encapsulation of a ruthenium(ii) polypyridyl complex: From synthesis to in vivo studies against high-grade epithelial ovarian cancer Chem. Sci. 2023 14 362 371 10.1039/D2SC05693C 36687351 PMC9811505 34. Zhang H. Liu T. Sun Y. Wang S. Wang W. Kuang Z. Duan M. Du T. Liu M. Wu L. Carbon-spaced tandem-disulfide bond bridge design addresses limitations of homodimer prodrug nanoassemblies: Enhancing both stability and activatability J. Am. Chem. Soc. 2024 146 22675 22688 10.1021/jacs.4c07312 39088029 35. Sun B. Luo C. Yu H. Zhang X. Chen Q. Yang W. Wang M. Kan Q. Zhang H. Wang Y. Disulfide bond-driven oxidation- and reduction-responsive prodrug nanoassemblies for cancer therapy Nano Lett. 2018 18 3643 3650 10.1021/acs.nanolett.8b00737 29726685 36. Ma W. Wang X. Zhang D. Mu X. Research progress of disulfide bond based tumor microenvironment targeted drug delivery system Int. J. Nanomed. 2024 19 7547 7566 10.2147/IJN.S471734 PMC11283832 39071505 37. Cho S. Hwang S.Y. Oh D.X. Park J. Recent progress in self-healing polymers and hydrogels based on reversible dynamic b–o bonds: Boronic/boronate esters, borax, and benzoxaborole J. Mater. Chem. A 2021 9 14630 14655 10.1039/D1TA02308J 38. Lee S.Y. Lee H. In I. Park S.Y. Ph/redox/photo responsive polymeric micelle via boronate ester and disulfide bonds with spiropyran-based photochromic polymer for cell imaging and anticancer drug delivery Eur. Polym. J. 2014 57 1 10 10.1016/j.eurpolymj.2014.04.020 39. Guo X. Shi C. Wang J. Di S. Zhou S. Ph-triggered intracellular release from actively targeting polymer micelles Biomaterials 2013 34 4544 4554 10.1016/j.biomaterials.2013.02.071 23510854 40. Shi Y. Pan X. Xu S. Zhu H. Zhao B. Sun Z. Dong R. Li N. Hou X. Yang X. Synthesis of the ph-sensitive nanoparticles based on the acylhydrazone bonds conjugated doxorubicin and studies on their in vivo anti-tumor effects Eur. J. Med. Chem. 2023 260 115715 10.1016/j.ejmech.2023.115715 37597438 41. Liu Y. Si L. Jiang Y. Jiang S. Zhang X. Li S. Chen J. Hu J. Design of ph-responsive nanomaterials based on the tumor microenvironment Int. J. Nanomed. 2025 20 705 721 10.2147/IJN.S504629 PMC11752822 39845771 42. Hai Y. Ye H. Li Z. Zou H. Lu H. You L. Light-induced formation/scission of c–n, c–o, and c–s bonds enables switchable stability/degradability in covalent systems J. Am. Chem. Soc. 2021 143 20368 20376 10.1021/jacs.1c09958 34797658 43. Angelova S. Nikolova V. Pereva S. Spassov T. Dudev T. A-cyclodextrin: How effectively can its hydrophobic cavity be hydrated? J. Phys. Chem. B 2017 121 9260 9267 10.1021/acs.jpcb.7b04501 28885027 44. Yan M. Zhou J. Pillararene-based supramolecular polymers for cancer therapy Molecules 2023 28 1470 10.3390/molecules28031470 36771136 PMC9919256 45. Xia L. Tian J. Yue T. Cao H. Chu J. Cai H. Zhang W. Pillar[5]arene-based acid-triggered supramolecular porphyrin photosensitizer for combating bacterial infections and biofilm dispersion Adv. Healthc. Mater. 2022 11 2102015 10.1002/adhm.202102015 34787954 46. Zhou J. Li J. Du X.W. Xu B. Supramolecular biofunctional materials Biomaterials 2017 129 1 27 10.1016/j.biomaterials.2017.03.014 28319779 PMC5470592 47. Ren Y. Dong X. Dynamic polymeric materials via hydrogen-bond cross-linking: Effect of multiple network topologies Prog. Polym. Sci. 2024 158 101890 10.1016/j.progpolymsci.2024.101890 48. Annabi N. Tamayol A. Uquillas J.A. Akbari M. Bertassoni L.E. Cha C. Camci-Unal G. Dokmeci M.R. Peppas N.A. Khademhosseini A. 25th anniversary article: Rational design and applications of hydrogels in regenerative medicine Adv. Mater. 2014 26 85 124 10.1002/adma.201303233 24741694 PMC3925010 49. Lin Z.-J. Mahammed S.A.R. Liu T.-F. Cao R. Multifunctional porous hydrogen-bonded organic frameworks: Current status and future perspectives ACS Cent. Sci. 2022 8 1589 1608 10.1021/acscentsci.2c01196 36589879 PMC9801510 50. Pan Y. Zeng F. Luan X. He G. Qin S. Lu Q. He B. Han X. Song Y. Polyamine-depleting hydrogen-bond organic frameworks unleash dendritic cell and t cell vigor for targeted crispr/cas-assisted cancer immunotherapy Adv. Mater. 2025 37 2411886 10.1002/adma.202411886 39972681 51. Wu J. Zeng F. Fan Z. Xuan S. Hua Z. Liu G. Hierarchical hydrogen bonds endow supramolecular polymers with high strength, toughness, and self-healing properties Adv. Funct. Mater. 2024 34 2410518 52. Song P. Wang H. High-performance polymeric materials through hydrogen-bond cross-linking Adv. Mater. 2020 32 1901244 10.1002/adma.201901244 31215093 53. Wang F. Yu X. Cao Z. Liu Y. Jiang X. Gu X. Synergic enhancement of hydrogel upon multi-level hydrogen bonds via macromolecular design for dual-mode electronic skin Chem. Eng. J. 2024 489 151249 54. Huang A. Yang H. Huang S. Chen G. Ouyang G. Hydrogen-bonded supramolecular crystal: A manual exoskeleton for bioentity Matter 2023 6 2635 2646 10.1016/j.matt.2023.06.002 55. Luo J. Wang J.-W. Zhang J.-H. Lai S. Zhong D.-C. Hydrogen-bonded organic frameworks: Design, structures and potential applications Crystengcomm 2018 20 5884 5898 10.1039/C8CE00655E 56. Rubio-Martinez M. Avci-Camur C. Thornton A.W. Imaz I. Maspoch D. Hill M.R. New synthetic routes towards mof production at scale Chem. Soc. Rev. 2017 46 3453 3480 10.1039/C7CS00109F 28530737 57. Yang J. Yang Y.-W. Metal–organic frameworks for biomedical applications Small 2020 16 1906846 10.1002/smll.201906846 32026590 58. Chen J. Gao Y. Shi L. Yu W. Sun Z. Zhou Y. Liu S. Mao H. Zhang D. Lu T. Phase-locked constructing dynamic supramolecular ionic conductive elastomers with superior toughness, autonomous self-healing and recyclability Nat. Commun. 2022 13 4868 10.1038/s41467-022-32517-4 35982044 PMC9388535 59. Wang R. Xu T. Yang Y. Zhang M. Xie R. Cheng Y. Zhang Y. Tough polyurethane hydrogels with a multiple hydrogen-bond interlocked bicontinuous phase structure prepared by in situ water-induced microphase separation Adv. Mater. 2025 37 2412083 10.1002/adma.202412083 39711479 60. Ranji-Burachaloo H. Gurr P.A. Dunstan D.E. Qiao G.G. Cancer treatment through nanoparticle-facilitated fenton reaction ACS Nano 2018 12 11819 11837 10.1021/acsnano.8b07635 30457834 61. Wang Z. Wang N. Cheng S.-C. Xu K. Deng Z. Chen S. Xu Z. Xie K. Tse M.-K. Shi P. Phorbiplatin, a highly potent pt(iv) antitumor prodrug that can be controllably activated by red light Chem 2019 5 3151 3165 10.1016/j.chempr.2019.08.021 62. Zhou T. Zhang G. Tan C. Liu Y. Wang X.-F. Concentration gradient-induced syntheses and crystal structures of two copper(ii) coordination polymer based on phthalic acid and 2,2′-bipyridine Molecules 2025 30 1953 10.3390/molecules30091953 40363760 PMC12074063 63. Mckinlay A.C. Morris R.E. Horcajada P. Férey G. Gref R. Couvreur P. Serre C. Biomofs: Metal–organic frameworks for biological and medical applications Angew. Chem. Int. Ed. 2010 49 6260 6266 10.1002/anie.201000048 20652915 64. Sukur S. Ranc V. Magnetic 2d transition-metal-based nanomaterials in biomedicine: Opportunities and challenges in cancer therapy Materials 2025 18 2570 40508567 10.3390/ma18112570 PMC12155818 65. Cao C. Wang X. Yang N. Song X. Dong X. Recent advances of cancer chemodynamic therapy based on fenton/fenton-like chemistry Chem. Sci. 2022 13 863 889 35211255 10.1039/d1sc05482a PMC8790788 66. Liu Z. Zhou W. Li J. Zhang H. Dai X. Liu Y. Liu Y. High-efficiency dynamic sensing of biothiols in cancer cells with a fluorescent β-cyclodextrin supramolecular assembly Chem. Sci. 2020 11 4791 4800 10.1039/D0SC00414F 34122936 PMC8159256 67. Chen J. Liang C. Song X. Yi X. Yang K. Feng L. Liu Z. Hybrid protein nano-reactors enable simultaneous increments of tumor oxygenation and iodine-131 delivery for enhanced radionuclide therapy Small 2019 15 e1903628 10.1002/smll.201903628 31577387 68. Zeng X. Xiao Y. Lin J. Li S. Zhou H. Nong J. Xu G. Wang H. Xu F. Wu J. Near-infrared ii dye-protein complex for biomedical imaging and imaging-guided photothermal therapy Adv. Healthc. Mater. 2018 7 1800589 10.1002/adhm.201800589 30051654 69. Zengin A. Hafeez S. Habibovic P. Baker M. Van Rijt S. Extracellular matrix mimetic supramolecular hydrogels reinforced with covalent crosslinked mesoporous silica nanoparticles J. Mater. Chem. B 2024 12 12577 12588 10.1039/d4tb00499j 39508381 70. Yu R. Yang Y. He J. Li M. Guo B. Novel supramolecular self-healing silk fibroin-based hydrogel via host–guest interaction as wound dressing to enhance wound healing Chem. Eng. J. 2021 417 128278 71. Sollenberger C.H. Qiu R. Sai H. Carrow J.K. Fyrner T. Gao Z. Palmer L.C. Stupp S.I. Boosting chondrocyte bioactivity with ultra-sulfated glycopeptide supramolecular polymers Acta Biomater. 2024 189 103 115 10.1016/j.actbio.2024.09.047 39362449 PMC12462270 72. Tang M.-D.Q. Tran N.B. Nguyen T.-H.T. Nguyen K.-U.H. Trinh N.-T. Van Vo T. Kobayashi M. Yoshitomi T. Nagasaki Y. Vong L.B. Development of oral ph-sensitive redox nanotherapeutics for gastric ulcer therapy J. Control Release 2024 375 758 766 10.1016/j.jconrel.2024.09.039 39326501 73. Wu D. Du X. Xue Q. Zhou J. Ping K. Cao Y. Liu S. Zhu Q. Supramolecular porphyrin photosensitizers based on host-guest recognition for in situ bacteria-responsive near-infrared photothermal therapy Adv. Healthc. Mater. 2024 13 e2401662 10.1002/adhm.202401662 39388515 74. Pan Y. Fan Z. Yu S. Xia L. Li J. Ros-responsive supramolecular antimicrobial peptides-based nanoprodrugs for cervical cancer therapy Colloid Surf. B. 2025 247 114411 10.1016/j.colsurfb.2024.114411 39613501 75. He X.-C. Chen X.-N. Liu Y.-H. Zhong X. Qiang L. Wang H.-Q. Wang F.-Z. Wang J.-S. Li C.-H. Zheng P.-F. A blue light 3d printable hydrogel with water absorption, antibacterial, and hemostatic properties for skin wound healing Chem. Eng. J. 2024 493 152439 10.1016/j.cej.2024.152439 76. Wang H. Feng Z. Xu B. Supramolecular assemblies of peptides or nucleopeptides for gene delivery Theranostics 2019 9 3213 3222 10.7150/thno.31854 31244950 PMC6567966 77. Ren X. Jiang H. Cao J. Wu J. Ge F. Biobased reversible acid-sensitive colorimetric fabric sensor based on natural polyphenols and amino acid Chem. Eng. J. 2025 520 166396 10.1016/j.cej.2025.166396 78. Nguyen M.T.N. Nguyen T.D. Han J.-H. Lee J.S. Synthesis of pdms chain structure with introduced dynamic covalent bonding for high-performance rehealable tactile sensor application Small Methods 2024 8 2400163 10.1002/smtd.202400163 38721965 79. Carden G.P. Martins M.L. Toleutay G. Ge S. Li B. Zhao S. Sokolov A.P. Critical role of free amine groups in the imine bonds exchange in dynamic covalent networks Macromolecules 2024 57 9920 10.1021/acs.macromol.4c02312 80. Liu H. Lu H.-H. Zhuang J. Thayumanavan S. Three-component dynamic covalent chemistry: From janus small molecules to functional polymers J. Am. Chem. Soc. 2021 143 20735 20746 10.1021/jacs.1c08574 34870962 81. Liu Y. Wang L. Zhao L. Zhang Y. Li Z.-T. Huang F. Multiple hydrogen bonding driven supramolecular architectures and their biomedical applications Chem. Soc. Rev. 2024 53 1592 1623 10.1039/D3CS00705G 38167687 82. Jiang S. Win K.Y. Liu S. Teng C.P. Zheng Y. Han M.Y. Surface-functionalized nanoparticles for biosensing and imaging-guided therapeutics Nanoscale 2013 5 3127 3148 10.1039/c3nr34005h 23478880 83. Maity S. Deb V.K. Mondal S. Chakraborty A. Pramanick K. Adhikari S. Leveraging supramolecular systems in biomedical breakthroughs Biofactors 2025 51 e70005 10.1002/biof.70005 39902766 84. Wu Q. Zhou Z. Xu L. Zhong H. Xiong B. Ren T. Li Z. Yuan L. Zhang X.B. Multivalent supramolecular fluorescent probes for accurate disease imaging Sci. Adv. 2024 10 eadp8719 10.1126/sciadv.adp8719 39423274 PMC11488570 85. Xu X.D. Lin B.B. Feng J. Wang Y. Cheng S.X. Zhang X.Z. Zhuo R.X. Biological glucose metabolism regulated peptide self-assembly as a simple visual biosensor for glucose detection Macromol. Rapid Commun. 2012 33 426 431 10.1002/marc.201100689 22318860 86. Chagri S. Ng D.Y.W. Weil T. Designing bioresponsive nanomaterials for intracellular self-assembly Nat. Rev. Chem. 2022 6 320 338 10.1038/s41570-022-00373-x 37117928 PMC8972907 87. Han J. Li H. Yoon J. Activated supramolecular nano-agents: From diagnosis to imaging-guided tumor treatment Nano Today 2022 43 101392 10.1016/j.nantod.2022.101392 88. Hong L. Li W. Li Y. Yin S. Nanoparticle-based drug delivery systems targeting cancer cell surfaces RSC Adv. 2023 13 21365 21382 10.1039/D3RA02969G 37465582 PMC10350659 89. Chen Q. Liu Z. Albumin carriers for cancer theranostics: A conventional platform with new promise Adv. Mater. 2016 28 10557 10566 10.1002/adma.201600038 27111654 90. Hazarika B. Singh V.P. Macrocyclic supramolecular biomaterials in anti-cancer therapeutics Chin. Chem. Lett. 2023 34 108220 10.1016/j.cclet.2023.108220 91. Chen Y. Huang F.H. Li Z.T. Liu Y. Controllable macrocyclic supramolecular assemblies in aqueous solution Sci. China Chem. 2018 61 979 992 10.1007/s11426-018-9337-4 92. Nanda J. Banerjee A. Β-amino acid containing proteolitically stable dipeptide based hydrogels: Encapsulation and sustained release of some important biomolecules at physiological ph and temperature Soft Matter 2012 8 3380 3386 10.1039/c2sm07168a 93. Wei X. Yu C.Y. Wei H. Application of cyclodextrin for cancer immunotherapy Molecules 2023 28 5610 10.3390/molecules28145610 37513483 PMC10384645 94. Abou-Elkacem L. Arns S. Brix G. Gremse F. Zopf D. Kiessling F. Lederle W. Regorafenib inhibits growth, angiogenesis, and metastasis in a highly aggressive, orthotopic colon cancer model Mol. Cancer Ther. 2013 12 1322 1331 10.1158/1535-7163.MCT-12-1162 23619301 95. Mir O. Brodowicz T. Italiano A. Wallet J. Blay J.Y. Bertucci F. Chevreau C. Piperno-Neumann S. Bompas E. Salas S. Safety and efficacy of regorafenib in patients with advanced soft tissue sarcoma (regosarc): A randomised, double-blind, placebo-controlled, phase 2 trial Lancet Oncol. 2016 17 1732 1742 10.1016/S1470-2045(16)30507-1 27751846 96. Datta S. Misra S.K. Saha M.L. Lahiri N. Louie J. Pan D. Stang P.J. Orthogonal self-assembly of an organoplatinum(ii) metallacycle and cucurbit[8]uril that delivers curcumin to cancer cells Proc. Natl. Acad. Sci. USA 2018 115 8087 8092 10.1073/pnas.1803800115 30038010 PMC6094119 97. Annane D. Bellissant E. Cavaillon J.M. Septic shock Lancet 2005 365 63 78 10.1016/S0140-6736(04)17667-8 15639681 98. Fricker S.P. Slade E. Powell N.A. Vaughan O.J. Henderson G.R. Murrer B.A. Megson I.L. Bisland S.K. Flitney F.W. Ruthenium complexes as nitric oxide scavengers: A potential therapeutic approach to nitric oxide-mediated diseases Br. J. Pharmacol. 1997 122 1441 1449 10.1038/sj.bjp.0701504 9421293 PMC1565067 99. He C. Duan X. Guo N. Chan C. Poon C. Weichselbaum R.R. Lin W. Core-shell nanoscale coordination polymers combine chemotherapy and photodynamic therapy to potentiate checkpoint blockade cancer immunotherapy Nat. Commun. 2016 7 12499 10.1038/ncomms12499 27530650 PMC4992065 100. Santamaria-Garcia V.J. Flores-Hernandez D.R. Contreras-Torres F.F. Cué-Sampedro R. Sánchez-Fernández J.A. Advances in the structural strategies of the self-assembly of photoresponsive supramolecular systems Int. J. Mol. Sci. 2022 23 7998 10.3390/ijms23147998 35887350 PMC9317886 101. Kouwer P.H. Koepf M. Le Sage V.A. Jaspers M. Van Buul A.M. Eksteen-Akeroyd Z.H. Woltinge T. Schwartz E. Kitto H.J. Hoogenboom R. Responsive biomimetic networks from polyisocyanopeptide hydrogels Nature 2013 493 651 655 10.1038/nature11839 23354048 102. Chan G. Mooney D.J. New materials for tissue engineering: Towards greater control over the biological response Trends Biotechnol. 2008 26 382 392 10.1016/j.tibtech.2008.03.011 18501452 103. Lutolf M.P. Hubbell J.A. Synthetic biomaterials as instructive extracellular microenvironments for morphogenesis in tissue engineering Nat. Biotechnol. 2005 23 47 55 10.1038/nbt1055 15637621 104. Rijns L. Baker M.B. Dankers P.Y.W. Using chemistry to recreate the complexity of the extracellular matrix: Guidelines for supramolecular hydrogel-cell interactions J. Am. Chem. Soc. 2024 146 17539 17558 10.1021/jacs.4c02980 38888174 PMC11229007 105. Deng Z. Wang H. Ma P.X. Guo B. Self-healing conductive hydrogels: Preparation, properties and applications Nanoscale 2020 12 1224 1246 10.1039/C9NR09283H 31859313 106. Chouhan D. Chakraborty B. Nandi S.K. Mandal B.B. Role of non-mulberry silk fibroin in deposition and regulation of extracellular matrix towards accelerated wound healing Acta Biomater. 2017 48 157 174 10.1016/j.actbio.2016.10.019 27746359 107. Gou G.H. Tseng F.J. Wang S.H. Chen P.J. Shyu J.F. Weng C.F. Pan R.Y. Autologous chondrocyte implantation versus microfracture in the knee: A meta-analysis and systematic review Arthroscopy 2020 36 289 303 10.1016/j.arthro.2019.06.033 31708355 108. Niethammer T.R. Loitzsch A. Horng A. Baur-Melnyk A. Bendiks M. Gülecyüz M.F. Müller P.E. Pietschmann M.F. Graft hypertrophy after third-generation autologous chondrocyte implantation has no correlation with reduced cartilage quality: Matched-pair analysis using t2-weighted mapping Am. J. Sports Med. 2018 46 2414 2421 10.1177/0363546518784593 30063401 109. Fagundes F.L. Pereira Q.C. Zarricueta M.L. Dos Santos R.D.C. Malvidin protects against and repairs peptic ulcers in mice by alleviating oxidative stress and inflammation Nutrients 2021 13 3312 10.3390/nu13103312 34684313 PMC8537945 110. Yeomans N. Lanas A. Labenz J. Van Zanten S.V. Van Rensburg C. Rácz I. Tchernev K. Karamanolis D. Roda E. Hawkey C. Efficacy of esomeprazole (20 mg once daily) for reducing the risk of gastroduodenal ulcers associated with continuous use of low-dose aspirin Off. J. Am. Coll. Gastroenterol.|ACG 2008 103 2465 2473 10.1111/j.1572-0241.2008.01995.x 18637091 111. Ünal A.T. Navruz F.Z. Korcan S.E. İnce S. Göçer E.U. Research on genotoxicity evaluation of the fungal alpha-amylase enzyme on drosophila melanogaster Biology 2025 14 219 10.3390/biology14030219 40136476 PMC11939532 112. Qi Z. Bharate P. Lai C.H. Ziem B. Böttcher C. Schulz A. Beckert F. Hatting B. Mülhaupt R. Seeberger P.H. Multivalency at interfaces: Supramolecular carbohydrate-functionalized graphene derivatives for bacterial capture, release, and disinfection Nano Lett. 2015 15 6051 6057 10.1021/acs.nanolett.5b02256 26237059 113. Liu Y. Gong H. Wang Z. Yuan C. Lu J. Yan X. Treatment of superbug infection through a membrane-disruption and immune-regulation cascade effect based on supramolecular peptide hydrogels Adv. Funct. Mater. 2023 33 2305726 10.1002/adfm.202305726 114. Hou C. Gu Y. Yuan W. Zhang W. Xiu X. Lin J. Gao Y. Liu P. Chen X. Song L. Application of microfluidic chips in the simulation of the urinary system microenvironment Mater. Today Bio 2023 19 100553 10.1016/j.mtbio.2023.100553 36747584 PMC9898763 115. Wu D. Zhao Z. Zhang Q. Qi H.J. Fang D. Mechanics of shape distortion of dlp 3d printed structures during uv post-curing Soft Matter 2019 15 6151 6159 10.1039/C9SM00725C 31317163 116. Zhang Y. Liu Y. Shu C. Shen Y. Li M. Ma N. Zhao J. 3d bioprinting of the airways and lungs for applications in tissue engineering and in vitro models J. Tissue Eng. 2024 15 20417314241309183 10.1177/20417314241309183 39712078 PMC11663278 117. Jounai N. Kobiyama K. Takeshita F. Intracellular inflammatory sensors for foreign invaders and substances of self-origin Self Nonself 2012 738 60 78 10.1007/978-1-4614-1680-7_5 22399374 118. Lee Y. Kim B. Lee D. Cheon S.Y. Lim S.G. Kim Y. Koo H. In vivo delivery systems for crispr genome editing: Viral and non-viral carriers Appl. Phys. Rev. 2025 12 021319 10.1063/5.0228874 119. Tümmler B. Pallenberg S.T. Dittrich A.-M. Graeber S.Y. Naehrlich L. Sommerburg O. Mall M.A. Progress of personalized medicine of cystic fibrosis in the times of efficient cftr modulators Mol. Cell. Pediatr. 2025 12 6 10.1186/s40348-025-00194-0 40320452 PMC12050259 120. Raguram A. Banskota S. Liu D.R. Therapeutic in vivo delivery of gene editing agents Cell 2022 185 2806 2827 10.1016/j.cell.2022.03.045 35798006 PMC9454337 121. Meng X. Xing Y. Li J. Deng C. Li Y. Ren X. Zhang D. Rebuilding the vascular network: In vivo and in vitro approaches Front. Cell Dev. Biol. 2021 9 639299 10.3389/fcell.2021.639299 33968926 PMC8097043 122. Howell D.W. Duran C.L. Tsai S.P. Bondos S.E. Bayless K.J. Functionalization of ultrabithorax materials with vascular endothelial growth factor enhances angiogenic activity Biomacromolecules 2016 17 3558 3569 10.1021/acs.biomac.6b01068 27715013 123. Xie Y. Zhou Y. Guo J. Zhang Z. Zhu Y. Goldys E.M. Deng W. Chen W. Illuminating gene delivery: Insights into the light-induced gene delivery systems with emphasis on mrna therapeutics Mater. Today 2025 88 959 978 10.1016/j.mattod.2025.06.034 124. Ma X. Zhao Y. He C. Zhou X. Qi H. Wang Y. Chen C. Wang D. Li J. Ke Y. Ordered packing of β-sheet nanofibrils into nanotubes: Multi-hierarchical assembly of designed short peptides Nano Lett. 2021 21 10199 10207 10.1021/acs.nanolett.1c02944 34870987 125. Yan Y. Kulsoom Sun Y. Li Y. Wang Z. Xue L. Wang F. Advancing cancer therapy: Nanomaterial-based encapsulation strategies for enhanced delivery and efficacy of curcumin Mater. Today Bio 2025 33 101963 10.1016/j.mtbio.2025.101963 40575656 PMC12198038 126. Ivanova A. Chalupska R. Louro A.F. Firth M. González-King Garibotti H. Hultin L. Kohl F. Lázaro-Ibáñez E. Lindgren J. Musa G. Barcoded hybrids of extracellular vesicles and lipid nanoparticles for multiplexed analysis of tissue distribution Adv. Sci. 2025 12 2407850 10.1002/advs.202407850 PMC11904941 39823165 127. Ferreira M. Carvalho V. Ribeiro J. Lima R.A. Teixeira S. Pinho D. Advances in microfluidic systems and numerical modeling in biomedical applications: A review Micromachines 2024 15 873 10.3390/mi15070873 39064385 PMC11279158 128. Zhu H. Mah Jian Qiang J. Wang C.G. Chan C.Y. Zhu Q. Ye E. Li Z. Loh X.J. Flexible polymeric patch based nanotherapeutics against non-cancer therapy Bioact. Mater. 2022 18 471 491 10.1016/j.bioactmat.2022.03.034 35415299 PMC8971585 129. Gostaviceanu A. Gavrilaş S. Copolovici L. Copolovici D.M. Graphene-oxide peptide-containing materials for biomedical applications Int. J. Mol. Sci. 2024 25 10174 10.3390/ijms251810174 39337659 PMC11432502 130. Pandey S. Yadav P. Liquid biopsy in cancer management: Integrating diagnostics and clinical applications Pract. Lab. Med. 2025 43 e00446 10.1016/j.plabm.2024.e00446 39839814 PMC11743551 131. Oliveira C.B.P. Gomes V. Ferreira P.M.T. Martins J.A. Jervis P.J. Peptide-based supramolecular hydrogels as drug delivery agents: Recent advances Gels 2022 8 706 10.3390/gels8110706 36354614 PMC9689023 132. Busiak R. Masek A. Węgier A. Rylski A. Accelerated aging of epoxy biocomposites filled with cellulose Materials 2022 15 3256 10.3390/ma15093256 35591590 PMC9104355 Figure 1 Structural classification and biomedical applications of supramolecular systems. Figure 2 Representative dynamic covalent motifs in supramolecular systems. Figure 3 Representative structures of host and guest components in supramolecular systems. Figure 4 Representative types of hydrogen-bond-assembled supramolecular systems. ( A B C D E F H Figure 5 Metal-coordinated supramolecular systems. ( A B C D E G Figure 6 ( A 84 B a 14 b 15 15 2 8 67 C 68 Figure 7 ( A 14 B a b c d e 15 C 71 D 72 Figure 8 ( A 73 B 75 pharmaceutics-17-01192-t001_Table 1 Table 1 Classification of supramolecular systems and their biomedical applications. Type of Supramolecular System Interaction Mechanism Representative Structures Biomedical Applications Challenges References Dynamic covalent supramolecules Reversible covalent bonds Disulfide bond, hydrazone bond, boronate ester bond Biodegradable drug carriers, tissue engineering scaffolds Short half-life, instability under physiological conditions [ 34 35 36 37 38 39 40 41 42 Host–guest supramolecular systems Macrocyclic hosts, mechanically interlocked molecules Crown ethers, cyclodextrins, pillararenes, rotaxanes Smart drug delivery, PDT/PTT, intracellular imaging Limited targeting efficiency, non-specific binding, biological compatibility [ 43 44 45 46 Hydrogen-bonding network systems Hydrogen bonding Amine–carboxyl, HOFs, multi-hydrogen-bond arrays Biomimetic scaffolds, drug delivery Susceptible to physiological interference, structural homogeneity issues [ 47 48 49 50 51 52 53 54 55 56 57 58 59 Metal-coordinated supramolecular systems Coordination between metals and ligands Ru 2+ 3+ Antibacterial materials, MRI contrast agents Potential metal toxicity, limited coordination stability [ 60 61 62 63 64 65 Host–guest supramolecular systems Interlocked molecules β-cyclodextrin Fluorescence imaging - [ 66 Covalent supramolecules Covalent bond Imine bond Fluorescence imaging, tumor treatment - [ 67 Covalent supramolecules Covalent bond Amide bonds PTT - [ 68 Host–guest supramolecular systems Interlocked molecules Cucurucide Contrast agent - [ 31 Host–guest supramolecular systems Interlocked molecules Rotane Fluorescent probes, imaging agents - [ 18 Host–guest supramolecular systems Interlocked molecules γ-cyclodextrin Drug delivery - [ 14 Metal-coordinated Coordination between metals and ligands Ruthenium-based complexes Drug delivery - [ 33 Metal-coordinated Coordination between metals and ligands Zinc ions Drug delivery, PDT - [ 15 Covalent supramolecules Covalent bond - Tissue engineering - [ 69 Host–guest supramolecular systems Interlocked molecules β-cyclodextrin Drug delivery - [ 70 Covalent supramolecules Covalent bond Disulfide bonds Tissue engineering - [ 71 Covalent supramolecules Covalent bond PEG Drug delivery - [ 72 Host–guest supramolecular systems Interlocked molecules Cucurucide PTT - [ 73 Host–guest supramolecular systems Interlocked molecules β-cyclodextrin Drug delivery–chemotherapy - [ 74 Covalent supramolecules Covalent bond Hydrogen bond Drug delivery–antibacterial therapy - [ 75 Host–guest supramolecular systems Covalent bond, interlocked molecules Disulfide bonds, paclitaxel, γ-cyclodextrin Drug delivery–gene therapy - [ 76 ",
  "metadata": {
    "Title of this paper": "Accelerated aging of epoxy biocomposites filled with cellulose",
    "Journal it was published in:": "Pharmaceutics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473587/"
  }
}