{
  "title": "Paper_926",
  "abstract": "pmc Vet Sci Vet Sci 3286 vetsciences vetsci Veterinary Sciences 2306-7381 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12474134 PMC12474134.1 12474134 12474134 41012789 10.3390/vetsci12090864 vetsci-12-00864 1 Article Antiviral Activity of Diltiazem HCl Against Pseudorabies Virus Infection In Vitro Zuo Mengting 1 † Xiang Decai 2 † Zhang Zhen-Xing 2 † Yang Xi 3 Duan Yuqing 3 Li Juan 4 Zeng Bangquan 5 Dong Lu 5 https://orcid.org/0000-0002-3747-1565 Wu Guoquan 2 Zhou Yi 1 * Tan Lei 3 * Duan Bofang 5 * Lekcharoensuk Porntippa Academic Editor Arunvipas Pipat Academic Editor Techangamsuwan Somporn Academic Editor 1 zuomengting@aliyun.com 2 askalm@163.com zhenxing978@163.com wuguoquan1982@163.com 3 yangxi20030204@163.com dyq202507@163.com 4 ynndlj@126.com 5 quanbangzeng123@163.com bbaoke95@163.com * lvtuzhouyi0408@163.com 523038@yangtzeu.edu.cn duanbofang@126.com † These authors contributed equally to this work. 05 9 2025 9 2025 12 9 497675 864 09 7 2025 31 8 2025 31 8 2025 05 09 2025 28 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Simple Summary Pseudorabies virus (PRV) infection causes substantial economic losses in the global swine industry. Moreover, PRV infections have also been documented in diverse mammalian species, including humans. In this study, we found that Diltiazem hydrochloride (DTZ) significantly inhibited PRV infection through specific interference with viral replication. Further experiments revealed that DTZ-mediated modulation of the calcium signaling pathway contributed to PRV infection. Overall, DTZ may be considered a potential therapeutic agent for the management of PRV infections. Abstract Pseudorabies virus (PRV) is a highly pathogenic agent that adversely impacts swine populations, leading to considerable economic losses within the Chinese pig industry. Furthermore, the potential for PRV to transmit across species from pigs to other hosts has attracted significant attention. In light of this, it is essential to identify efficacious antiviral agents for the treatment of PRV infection. In this study, we investigated the antiviral properties of Diltiazem HCl (DTZ) against PRV infection in susceptible cell lines. Our results demonstrated that DTZ significantly inhibited PRV infection in both PK15 and Vero cells. Moreover, this chemical compound exhibited antiviral activity against both variant and classical strains of PRV, as well as herpes simplex virus type 1 (HSV-1). Time-of-addition assays showed that DTZ exerted its inhibitory effect through specific interference with the virus replication process. Subsequent transcriptomic analysis via RNA sequencing indicated that the calcium signaling pathway might be involved in the antiviral properties of DTZ against PRV infection. Specifically, treatment with EGTA or calcium ion (Ca 2+ 2 pseudorabies virus diltiazem HCl antiviral activity viral replication phase RNA-seq Innovation Guidance and Technology oriented Enterprise Cultivation Plan Project Yunnan Province 202404BI090004 Science and Technology Research Project of Education Department of Hubei Province Q20231308 Scientific Research Foundation of Hunan Provincial Education Department 23B0871 Open Project of Yunnan Provincial Key Laboratory of Tropical and Subtropical Animal Viral Diseases 2025RW001 This research was funded by the Innovation Guidance and Technology oriented Enterprise Cultivation Plan Project Yunnan Province (No. 202404BI090004), the Open Project of Yunnan Provincial Key Laboratory of Tropical and Subtropical Animal Viral Diseases (2025RW001), the Science and Technology Research Project of Education Department of Hubei Province (No. Q20231308), and the Scientific Research Foundation of Hunan Provincial Education Department (No. 23B0871). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Pseudorabies virus (PRV), the causative agent of pseudorabies (PR), is a double-stranded linear DNA virus classified within the Alphaherpesvirinae Orthoherpesviridae 1 2 3 4 5 6 PRV has demonstrated widespread prevalence within swine populations and other susceptible species across diverse geographic regions, encompassing Asia (most notably China, Thailand, Japan, and Korea [ 2 7 8 9 10 11 12 13 14 15 16 2 6 2 Calcium ions (Ca 2+ 17 18 19 20 2+ 21 22 23 24 25 26 27 2+ This study examined the antiviral properties of DTZ against PRV infection in vitro. Our findings showed that DTZ treatment markedly suppressed PRV infection by interfering with viral replication. RNA sequencing analysis demonstrated that the calcium signaling pathway mediated DTZ’s antiviral activity against PRV. Collectively, our findings suggested that DTZ could be a viable antiviral agent for PRV infection. 2. Materials and Methods 2.1. Cells, Viruses, Chemicals, and Antibodies Vero cells (ATC, CCL-81) and PK-15 cells (ATCC, CCL-33) were cultured in DMEM supplemented with 10% FBS and 1% penicillin-streptomycin at 37 °C under 5% CO 2 28 29 The PRV gC protein antibody was acquired from Guangzhou Qianxun Biotechnology Co., Ltd. (Guangzhou, China). DTZ (illustrated in Figure 1 2+ 2.2. Cytotoxicity Assay Cells were seeded in a 96-well plate until reaching approximately 50% confluency, then incubated with DTZ (0, 3.125, 6.25, 12.5, 25.0, 50.0, 100.0, 200.0, and 300.0 μM) or EGTA (0, 1.0, 1.5, and 2.0 mM) at specified concentrations for 48 h. Cell viability was subsequently measured in each group using the CCK-8 method following the manufacturer’s protocol [ 28 2.3. Nucleic Isolation and Quantitative Real-Time PCR Assessment Genomic DNA was recovered from PRV-infected cells employing a DNA extraction kit (Takara, Dalian, China). The quantification of viral copies was performed via absolute quantification PCR (qPCR) with the recombinant plasmid pcUmT-PRV-gB and gB-specific primers, following the established protocols [ 28 For RNA analysis, we isolated total RNA genome using the SteadyPure Universal RNA Extraction Kit (Accurate Biotechnology, Changsha, China), and synthesized cDNA from 1.0 μg RNA with PrimerScript RT Master Mix (Accurate Biotechnology). Relative gene expression was assessed by RT-qPCR [ 29 Table 1 2.4. Virus Titration Vero cells were seeded in 96-well plates to achieve approximately 40% monolayer coverage. The cells were infected with ten-fold serial dilutions of viral supernatant. Cytopathic effects (CPE) were assessed and recorded at 72 h post-infection (hpi), with 50% tissue culture infectious dose (TCID 50 2.5. Indirect Immunofluorescent Assay (IFA) PRV-infected cells were fixed with 4% paraformaldehyde for 15 min and permeabilized using 0.1% Triton X-100 in PBS for 12 min at room temperature. Following a 2 h incubation at room temperature in PBS containing 3% BSA for blocking, the cells were incubated overnight at 4 °C with a monoclonal anti-PRV gC mouse antibody (1:2000). Following five PBS washes, the cells were exposed to an FITC-conjugated secondary antibody for one hour at room temperature under dark conditions. After five additional PBS washes, specific fluorescence signals were visualized by fluorescence microscopy. 2.6. Antiviral Activity Analysis PK15 and Vero cells were grown in 12-well plates until reaching 90% confluency. The cells then received a 2 h pretreatment with DTZ at concentrations of 0, 50, 100, and 200 μM. Subsequently, the cells were incubated with the PRV-HuN-LD strain (MOI = 0.1) for 2 h. After PBS washing, the cells were maintained in DMEM supplemented with 10% PBS and the respective DTZ concentrations. RT-qPCR and IFA analyses were performed on harvested cells at 24 hpi, while supernatants were collected for TCID 50 To further assess the antiviral properties of DTZ against additional variant and classical PRV strains, as well as an HSV-1 strain, we pretreated Vero cells for 2 h with DMEM containing 10% FBS and either 100 μM or 200 μM DTZ before infecting them with one of two additional PRV strains or with HSV-1. Following infection, cells were washed with PBS and cultured in DMEM containing 10% FBS and the respective DTZ concentrations for 24 h. Subsequently, we collected the supernatants for viral titer quantification and harvested the cells to measure viral gene mRNA expression levels. 2.7. Inhibitory Action Assay 2.7.1. Inactivation Assay An equal volume of PRV-HuN-LD viral solution (10 5 50 2.7.2. Pre-Treatment Assay Vero cells were grown in a 6-well plate until reaching 80% confluence. The cells were treated with DMEM containing 10% FBS, with or without 100 μM DTZ at room temperature for 2 h. Following PBS washing, the cells were infected with 10 5 50 2 2.7.3. Viral Attachment Assay Vero cells were cultured in a 6-well plate and reached approximately 80% confluence. After incubation with DMEM containing 10% FBS, with or with 100 μM DTZ, at 4 °C for 2 h, the cells were exposed to PRV-HuN-LD at varying MOIs (0.1, 1.0, and 10.0) under the same conditions to facilitate viral attachment. Following washes with pre-cooled PBS, total cellular DNA was extracted employing a DNA/RNA extraction kit (Takara, Dalian, China). Viral copy numbers were quantified by qPCR. 2.7.4. Viral Entry Assay Vero cells were cultured in a 6-well plate until they reached approximately 80% confluence. The cells were incubated with DMEM containing PRV-HuN-LD at MOI of 0.1, 1.0, and 10.0 for 2 h at 4 °C to allow viral attachment. After PBS washes, cells were treated with DMEM supplementary with 10% FBS, with or without 100 μM DTZ, for 2 h at 37 °C in a 5% CO 2 2.7.5. Virus Replication Assay Vero cells were cultured in 6-well plates until they reached approximately 80% confluence. The cells were then incubated with DMEM containing 10 5 50 2 50 2.7.6. Virus Release Assay Vero cells were cultured in a 6-well plate until they reached nearly 80% confluence. The cells were then incubated with DMEM containing 10 5 50 2 50 2.8. Assessment of the Effect of Intracellular Ca 2+ To assess the effect of intracellular Ca 2+ 2+ 5 50 2 2 2+ 50 In a separate experiment, Vero cells were pretreated with EGTA with or without CaCl 2 5 50 2 50 2.9. Experiment Design, cDNA Library Construction, and Sequence Date Analysis PK15 cells were grown in 6-well plates until reaching nearly 80% confluence. The cells were then challenged with PRV-HuN-LD (MOI = 0.1) for 2 h. After a PBS rinse, the cells were maintained in DMEM containing 10% FBS, with or without DTZ (100 μM), at 37 °C under 5% CO 2 29 2.10. Statistical Analysis Each experiment was performed in triplicate with independent replicates. The results were expressed as mean ± standard deviation. Data derived from different experimental groups were analyzed using two-tailed Student’s t p p p p 3. Results 3.1. Cytotoxicity of DTZ on Different Cell Lines The cytotoxicity of DTZ was evaluated in PK15 and Vero cells using a CCK-8 kit. As shown in Figure 1 50 3.2. DTZ Significantly Inhibits PRV-HuN-LD Infection in Both Vero and PK15 Cell Lines The antiviral efficacy of DTZ against PRV-HuN-LD strain was assessed in vitro. DTZ treatment substantially mitigated PRV-induced cytopathic effects in both PK15 and Vero cells ( Figure 2 Figure 2 Figure 2 50 Table 2 3.3. DTZ Inhibits PRV-HuN-LD Infection by Targeting Viral Replication Stage The antiviral efficacy of DTZ against PRV infection was evaluated by examining its effect at various treatment time points in Vero cells ( Figure 3 Figure 3 Figure 3 Figure 3 Figure 3 Figure 3 Figure 3 3.4. DTZ Exhibits Antiviral Efficacy Against PRV and HSV-1 To assess the antiviral property of DTZ against alphaherpesvirus infection in vitro, other strains, including two PRV strains and an HSV-1 strain, were utilized to further investigate the antiviral activity of DTZ in Vero cells. As shown in Figure 4 Figure 4 Figure 4 3.5. Transcription Analysis of PK15 Cells Infected with PRV Co-Treated with DTZ To examine the cellular pathways involved in the antiviral effects of DTZ against PRV infection, we conducted RNA sequencing analyses on PRV-infected PK15 cells treated with or without DTZ. The analysis revealed 1729 differentially expressed genes (DEGs) between PRV-infected and mock-infected groups, including 1444 up-regulated DEGs and 285 down-regulated DEGs. In contrast, DTZ-treated PRV-infected PK15 cells showed 2475 DEGs, comprising 954 up-regulated DEGs and 1521 down-regulated DEGs ( Figure 5 The Kyoto Encyclopedia of Genes and Genomes (KEGG) analysis indicated significant enrichment of DEGs between PRV-infected and DTZ-treated groups in cancer-related pathway, axon guidance, focal adhesion, proteoglycans in cancer, the PI3K-Akt signaling pathway and the MAPK signaling pathway ( Figure 5 19 20 Figure 5 Figure 5 3.6. Validation of Transcriptional Levels of DEGs Using RT-qPCR We next assessed the accuracy and reliability of RNA-Seq results by measuring transcriptional levels of pathway-associated genes via RT-qPCR. Key targets including antioxidative stress genes (COX3, ND2, and ND3), epithelial–mesenchymal transition signaling markers (EMILIN2, CLDN4, CAPG, COL17A1, and EMP1), calcium signaling pathway (CACNB2, ATP2B4, S100A6, and S100A10), and MAPK pathway regulators (KSR2, VEGFA, EREG, GADD45A, and DUSP4) were randomly selected for further analysis. As illustrated in Figure 6 3.7. Ca 2+ The aforementioned results demonstrated that the calcium signaling pathway mediated DTZ’s antiviral activity against PRV infection. As a calcium channel blocker, DTZ selectively inhibits calcium ion influx through L-type voltage-gated calcium channels in cardiac and vascular smooth muscle cells [ 30 2+ 2+ Figure 7 2+ Figure 7 2+ Figure 7 2 Figure 7 4. Discussion PRV has become a significant infectious disease that severely impacts Chinese pig industry. Its cross-species transmission capability from pigs to other mammals has raised significant public health concerns [ 16 31 32 33 DTZ, an FDA-approved pharmacological agent, functions as an L-type voltage-gated calcium channel blocker [ 34 35 36 37 21 37 38 26 27 The viral life cycle encompasses attachment, entry, replication, and release phases [ 1 26 27 Coronaviridae 39 2+ 40 41 RNA-Seq technology has become a standard tool for analyzing comprehensive transcriptional changes occurring in the host cells [ 42 43 44 45 46 47 48 2+ 26 27 It should be noted that this study has not fully elucidated the antiviral mechanisms of DTZ against PRV infection. Firstly, DTZ treatment significantly impedes viral replication, whether it directly interacts with viral proteins remains uncertain. Secondly, DTZ primarily targets the calcium voltage-gated channel subunit alpha 1C protein, which participates in PRRSV [ 26 27 18 In conclusion, our findings revealed that DTZ exerted a potent anti-PRV effect in vitro by arresting viral replication. Moreover, DTZ-mediated modulation of the calcium signaling pathway contributed to PRV infection. These findings indicated that DTZ could be a viable therapeutic option for the management of PRV. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, Y.Z., L.T. and B.D.; methodology, M.Z., D.X., Z.-X.Z. and X.Y.; software, X.Y., Y.D. and M.Z.; validation, L.T., Y.Z. and B.D.; formal analysis, M.Z., Z.-X.Z., D.X., J.L. and B.Z.; investigation, M.Z., Z.-X.Z. and D.X.; resources, B.Z., L.D., G.W. and Y.Z.; data curation, M.Z., Y.Z. and L.T.; writing—original draft preparation, M.Z., Y.Z. and L.T.; writing—review and editing, M.Z., Z.-X.Z., Y.Z. and L.T.; visualization, Y.Z., L.T. and B.D.; supervision, Y.Z., L.T. and B.D.; project administration, Y.Z., L.T. and B.D.; funding acquisition, M.Z., L.T. and B.D. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement All datasets in this study can be found in the article. Conflicts of Interest Author Juan Li was employed by Yunnan Sino-science Gene Technology Co., Ltd. The authors declare that they have no known competing financial interests or personal relationships. References 1. Tan L. Wang K. Bai P. Zhang S. Zuo M. Shu X. Wang A. Yao J. Host cellular factors involved in pseudorabies virus attachment and entry: A mini review Front. Vet. Sci. 2023 10 1314624 10.3389/fvets.2023.1314624 38089700 PMC10715396 2. Tan L. Yao J. Yang Y. Luo W. Yuan X. Yang L. Wang A. Current status and challenge of pseudorabies virus infection in China Virol. Sin. 2021 36 588 607 10.1007/s12250-020-00340-0 33616892 PMC7897889 3. Chen H. Fan J. Sun X. Xie R. Song W. Zhao Y. Yang T. Cao Y. Yu S. Wei C. Characterization of pseudorabies virus associated with severe respiratory and neuronal signs in old pigs Transbound. Emerg. Dis. 2023 2023 8855739 10.1155/2023/8855739 40303768 PMC12017139 4. Liu Q. Kuang Y. Li Y. Guo H. Zhou C. Guo S. Tan C. Wu B. Chen H. Wang X. The epidemiology and variation in pseudorabies virus: A continuing challenge to pigs and humans Viruses 2022 14 1463 10.3390/v14071463 35891443 PMC9325097 5. Liu Q. Wang X. Xie C. Ding S. Yang H. Guo S. Li J. Qin L. Ban F. Wang D. A novel human acute encephalitis caused by pseudorabies virus variant strain Clin. Infect. Dis. 2021 73 e3690 e3700 10.1093/cid/ciaa987 32667972 6. Wei L. Hu Y. Bai L. Xiao C. Liu Z. You Y. Wang K. Huang Y. Zhu J. Weng J. Design of the inhibitors for pseudorabies virus replication by reinforcement learning from HSV-1 DNA polymerase inhibitors ACS Omega 2025 10 3389 3397 10.1021/acsomega.4c06508 39926536 PMC11800043 7. Panyasing Y. Kedkovid R. Kittawornrat A. Ji J. Zimmerman J. Thanawongnuwech R. Detection of Aujeszky’s disease virus DNA and antibody in swine oral fluid specimens Transbound. Emerg. Dis. 2018 65 1828 1835 10.1111/tbed.12961 30015417 8. Mahmoud H.Y. Suzuki K. Tsuji T. Yokoyama M. Shimojima M. Maeda K. Pseudorabies virus infection in wild boars in Japan J. Vet. Med. Sci. 2011 73 1535 1537 10.1292/jvms.11-0191 21757858 9. Truong Q.L. Seo T.W. Yoon B.I. Kim H.C. Han J.H. Hahn T.W. Prevalence of swine viral and bacterial pathogens in rodents and stray cats captured around pig farms in Korea J. Vet. Med. Sci. 2013 75 1647 1650 10.1292/jvms.12-0568 23892461 PMC3942947 10. Papageorgiou K. Stoikou A. Papadopoulos D.K. Tsapouri-Kanoula E. Giantsis I.A. Papadopoulos D. Stamelou E. Sofia M. Billinis C. Karapetsiou C. Pseudorabies Virus Prevalence in Lung Samples of Hunted Wild Boars in Northwestern Greece Pathogens 2024 13 929 10.3390/pathogens13110929 39599482 PMC11597329 11. Ferrara G. Pagnini U. Parisi A. Amoroso M.G. Fusco G. Iovane G. Montagnaro S. A pseudorabies outbreak in hunting dogs in Campania region (Italy): A case presentation and epidemiological survey BMC Vet. Res. 2024 20 323 10.1186/s12917-024-04189-3 39026329 PMC11256590 12. Konjević D. Sučec I. Turk N. Barbić L. Prpić J. Krapinec K. Bujanić M. Jemeršić L. Keros T. Epidemiology of Aujeszky disease in wild boars ( Sus scrofa Vet. Res. Commun. 2023 47 631 639 10.1007/s11259-022-10017-6 36319813 13. Cano-Terriza D. Martínez R. Moreno A. Pérez-Marín J.E. Jiménez-Ruiz S. Paniagua J. Borge C. García-Bocanegra I. Survey of Aujeszky’s Disease Virus in Hunting Dogs from Spain Ecohealth 2019 16 351 355 10.1007/s10393-019-01426-2 31300937 14. Serena M.S. Cappuccio J. Fossaroli M. Williman M.M. Dibarbora M. Brizzio R. Metz G. Aspitia C. Perez A. Carpinetti B. Characterization of new strains of Pseudorabies virus in Argentina: Detection of interspecies transmission Open Vet. J. 2023 13 419 426 10.5455/OVJ.2023.v13.i4.3 37251267 PMC10219816 15. Kmetiuk L.B. Cassaro Villalobos E.M. do Carmo Custódio de Souza Hunold Lara M. Machado F.P. Lipinski L.C. Dos Santos A.P. de Barros Filho I.R. Serosurvey for Pseudorabies (Aujeszky’s Disease) in Free-Range Wild Boars ( Sus scrofa J. Wildl. Dis. 2020 56 959 961 10.7589/2019-10-262 32320342 16. He W. Auclert L.Z. Zhai X. Wong G. Zhang C. Zhu H. Xing G. Wang S. He W. Li K. Interspecies Transmission, Genetic Diversity, and Evolutionary Dynamics of Pseudorabies Virus J. Infect. Dis. 2019 219 1705 1715 10.1093/infdis/jiy731 30590733 17. Bagur R. Hajnóczky G. Intracellular Ca 2+ Mol. Cell 2017 66 780 788 10.1016/j.molcel.2017.05.028 28622523 PMC5657234 18. Berlansky S. Sallinger M. Grabmayr H. Humer C. Bernhard A. Fahrner M. Frischauf I. Calcium signals during SARS-CoV-2 infection: Assessing the potential of emerging therapies Cells 2022 11 253 10.3390/cells11020253 35053369 PMC8773957 19. Cheshenko N. Del Rosario B. Woda C. Marcellino D. Satlin L.M. Herold B.C. Herpes simplex virus triggers activation of calcium-signaling pathways J. Cell Biol. 2003 163 283 293 10.1083/jcb.200301084 14568989 PMC2173509 20. Doñate-Macián P. Jungfleisch J. Pérez-Vilaró G. Rubio-Moscardo F. Perálvarez-Marín A. Diez J. Valverde M.A. The TRPV4 channel links calcium influx to DDX3X activity and viral infectivity Nat. Commun. 2018 9 2307 10.1038/s41467-018-04776-7 29899501 PMC5998047 21. Chen X. Cao R. Zhong W. Host calcium channels and pumps in viral infections Cells 2019 9 94 10.3390/cells9010094 31905994 PMC7016755 22. Berridge M.J. Bootman M.D. Roderick H.L. Calcium signalling: Dynamics, homeostasis and remodelling Nat. Rev. Mol. Cell Biol. 2003 4 517 529 10.1038/nrm1155 12838335 23. Li H. Zhang L.K. Li S.F. Zhang S.F. Wan W.W. Zhang Y.L. Xin Q.L. Dai K. Hu Y.Y. Wang Z.B. Calcium channel blockers reduce severe fever with thrombocytopenia syndrome virus (SFTSV) related fatality Cell Res. 2019 29 739 753 10.1038/s41422-019-0214-z 31444469 PMC6796935 24. Fujioka Y. Nishide S. Ose T. Suzuki T. Kato I. Fukuhara H. Fujioka M. Horiuchi K. Satoh A.O. Nepal P. A sialylated voltage-dependent Ca 2+ Cell Host Microbe 2018 23 809 818 10.1016/j.chom.2018.04.015 29779930 25. Lavanya M. Cuevas C.D. Thomas M. Cherry S. Ross S.R. siRNA screen for genes that affect Junín virus entry uncovers voltage-gated calcium channels as a therapeutic target Sci. Transl. Med. 2013 5 204ra131 10.1126/scitranslmed.3006827 PMC4104171 24068738 26. Li L. Wang J. Chen L. Ren Q. Akhtar M.F. Liu W. Wang C. Cao S. Liu W. Zhao Q. Diltiazem HCl suppresses porcine reproductive and respiratory syndrome virus infection in susceptible cells and in swine Vet. Microbiol. 2024 292 110054 10.1016/j.vetmic.2024.110054 38507832 27. Bai D. Fang L. Xia S. Ke W. Wang J. Wu X. Fang P. Xiao S. Porcine deltacoronavirus (PDCoV) modulates calcium influx to favor viral replication Virology 2020 539 38 48 10.1016/j.virol.2019.10.011 31670218 PMC7112098 28. Xiong K. Tan L. Yi S. Wu Y. Hu Y. Wang A. Yang L. Low-concentration T-2 toxin attenuates pseudorabies virus replication in porcine kidney 15 cells Toxins 2022 14 121 10.3390/toxins14020121 35202147 PMC8876018 29. Tan L. Zhu P. Getu Z. Yang X. Zheng S. Duan Y. Wang J. Wang J. Zhou Y. Hu Y. Antiviral activity of nitazoxanide against pseudorabies virus infection in vitro Front. Vet. Sci. 2025 12 1623545 10.3389/fvets.2025.1623545 40589730 PMC12206632 30. Rosales C. Brown E.J. Calcium channel blockers nifedipine and diltiazem inhibit Ca 2+ J. Biol. Chem. 1992 267 1443 1448 10.1016/S0021-9258(18)45965-0 1730694 31. Zhao M. Chen J. Luo S. Zhang P. Chen J. Sun C. Ren Z. Huang Y. Zhang X. Xiang H. Epidemiological investigation, related factors, spatial-temporal cluster analysis of pseudorabies virus seroprevalence in Guangdong Province of China Front. Vet. Sci. 2025 12 1581043 10.3389/fvets.2025.1581043 40534778 PMC12174391 32. Sun Y. Shi M. Yang H. Zhang X. Zhang Y. Liu R. Li L. Li S. Zhou X. Li Y. Molecular epidemiology and genetic characteristics of pseudorabies virus between 2021 and 2023 in Henan Province of China J. Vet. Sci. 2025 26 e26 10.4142/jvs.24243 40183912 PMC11972943 33. Song C. Ye H. Zhang X. Zhang Y. Li Y. Yao J. Gao L. Wang S. Yu Y. Shu X. Isolation and characterization of Yunnan variants of the pseudorabies virus and their pathogenicity in rats Viruses 2024 16 233 10.3390/v16020233 38400009 PMC10891970 34. Chen Y.C. Wu C.T. Chen J.H. Tsai C.F. Wu C.Y. Chang P.C. Yeh W.L. Diltiazem inhibits breast cancer metastasis via mediating growth differentiation factor 15 and epithelial-mesenchymal transition Oncogenesis 2022 11 48 10.1038/s41389-022-00423-5 35963873 PMC9376069 35. Siegel J.D. Ko C.J. Diltiazem-associated photodistributed hyperpigmentation Yale J. Biol. Med. 2020 93 45 47 32226335 PMC7087047 36. McAuley B.J. Schroeder J.S. The use of diltiazem hydrochloride in cardiovascular disorders Pharmacotherapy 1982 2 121 133 10.1002/j.1875-9114.1982.tb04518.x 6763199 37. Dunn D.M. Munger J. Interplay between calcium and AMPK signaling in human cytomegalovirus infection Front. Cell Infect. Microbiol. 2020 10 384 10.3389/fcimb.2020.00384 32850483 PMC7403205 38. Qu Y. Wang S. Jiang H. Liao Y. Qiu X. Tan L. Song C. Nair V. Yang Z. Sun Y. Newcastle disease virus infection induces parthanatos in tumor cells via calcium waves PLoS Pathog. 2024 20 e1012737 10.1371/journal.ppat.1012737 39621796 PMC11637436 39. Wang X. Luo J. Wen Z. Shuai L. Wang C. Zhong G. He X. Cao H. Liu R. Ge J. Diltiazem inhibits SARS-CoV-2 cell attachment and internalization and decreases the viral infection in mouse lung PLoS Pathog. 2022 18 e1010343 10.1371/journal.ppat.1010343 35176124 PMC8890723 40. Zhu L. Huang L. Zhu Y. Ding X. Zhu G. Calcium signaling involved in bovine herpesvirus 1 replication in MDBK cells Acta Virol. 2017 64 487 491 10.4149/av_2017_412 29186967 41. Ding L. Jiang P. Xu X. Lu W. Yang C. Li L. Zhou P. Liu S. T-type calcium channels blockers inhibit HSV-2 infection at the late stage of genome replication Eur. J. Pharmacol. 2021 892 173782 10.1016/j.ejphar.2020.173782 33279521 42. Yu T. Xu B. Bao M. Gao Y. Zhang Q. Zhang X. Liu R. Identification of potential biomarkers and pathways associated with carotid atherosclerotic plaques in type 2 diabetes mellitus: A transcriptomics study Front. Endocrinol. 2022 13 981100 10.3389/fendo.2022.981100 PMC9523108 36187128 43. He B. Sun H. Bao M. Li H. He J. Tian G. Wang B. A cross-cohort computational framework to trace tumor tissue-of-origin based on RNA sequencing Sci. Rep. 2023 13 15356 10.1038/s41598-023-42465-8 37717102 PMC10505149 44. He B. Zhang Y. Zhou Z. Wang B. Liang Y. Lang J. Lin H. Bing P. Yu L. Sun D. A neural network framework for predicting the tissue-of-origin of 15 common cancer types based on RNA-seq data Front. Bioeng. Biotechnol. 2020 8 737 10.3389/fbioe.2020.00737 32850691 PMC7419649 45. Deng L. Min W. Guo S. Deng J. Wu X. Tong D. Yuan A. Yang Q. Interference of pseudorabies virus infection on functions of porcine granulosa cells via apoptosis modulated by MAPK signaling pathways Virol. J. 2024 24 25 10.1186/s12985-024-02289-y 38263223 PMC10807058 46. Xu L. Tao Q. Zhang Y. Lee F.-Q. Xu T. Deng L.-S. Jian Z.J. Zhao J. Lai S.Y. Zhou Y.C. The host cells suppress the proliferation of pseudorabies virus by regulating the PI3K/Akt/mTOR pathway Microbiol. Spectr. 2024 12 e0135124 10.1128/spectrum.01351-24 39436133 PMC11619243 47. Hu H. Hu Z. Zhang Y. Wan H. Yin Z. Li L. Liang X. Zhao X. Yin L. Ye G. Myricetin inhibits pseudorabies virus infection through direct inactivation and activating host antiviral defense Front. Microbiol. 2022 13 985108 10.3389/fmicb.2022.985108 36187970 PMC9520584 48. Yuan X. Wang H. Zhao Z. Li C. Wang X. Liu Y. Zhou Y. Zhu Z. Zhang Z. Paeonol inhibits the replication of bovine herpesvirus type 1 in vitro through regulating the PI3K/AKT pathway Curr. Microbiol. 2025 82 110 10.1007/s00284-025-04085-5 39894854 Figure 1 The molecular structure of DTZ and its cytotoxic effects on PK15 and Vero cells. ( A B C p p p Figure 2 Antiviral activity of DTZ against PRV infection in vitro. ( A B D 50 B C D p p Figure 3 Effects of DTZ on distinct stages of the PRV replication cycle in Vero cells. ( A B C F G D E p p Figure 4 DTZ impeded the infections by multiple alphaherpesvirus strains in vitro. After a 2 h pretreatment with 100 or 200 μM, cells were challenged with distinct virus strains. Paired supernatants and cell lysates were collected for viral titer quantification ( A B p p Figure 5 Transcriptomic insights into the mechanism of DTZ-mediated antiviral activity. ( A B A B C D C D E Figure 6 Validation of the mRNA expression levels of representative DEGs identified in the RNA-Seq data though RT-qPCR. Figure 7 Ca 2+ A D 2+ B C E F 2+ B,E E F G H I 2 H I p p p p vetsci-12-00864-t001_Table 1 Table 1 Oligonucleotide primers employed in this investigation. Gene Sequence (3′–5′) GenBank Accession Number q-PRV- gB GTCCGTGAAGCGGTTCGTGAT OP879616 q-PRV- gB CTCCATCATGAAGTGCGACGT q-HSV- gB GGACATCAAGGCGGAGAACA MH999849 q-HSV- gB TTCTCCTTGAAGACCACCGC q- GAPDH ACCACAGTCCATGCCATCAC OZ289217 q- GAPDH TCCACCACCCTGTTGCTGTA EMILIN2 CGCCAGGAACAAGAACTGGTG NC_010448 EMILIN2 GCACAGTTGTACTGAGCCTGA ND2 AATCCACAGCTCAGCAACCA MK688993 ND2 TTAGGCTTGTGATGACGGGT ND3 AACCCTAGCCTCCCTACTCG MK688993 ND3 GAGGCGTGCTGATCCTATGG SLC37A2 TGTGGTCAAGAGTCGTCTGC XM_021063086 SLC37A2 ATGCCGATAGCATAGGCCAC COX3 ACCACTTACCGGAGCCCTAT MK688993 COX3 ATGTGTGGTGGCCTTGGAAA COL17A1 TCCTTACCACCAAAAGGGGG XM_071611703 COL17A1 AACTGGAGGTGGAGGCATTG CLDN4 TGGATGATGAGAGCGCCAAG NM_001161637 CLDN4 GGGATTGTAGAAGTCGCGGA CAPG GACTCAGAGCTGCTAGCCTT AK238228 GAPG TGCTGTTTCCAGATCTCCTCC EMP1 EMP1 CATGCTGTTCGTTTGCACCA AK391109 CACNB2 GTCACCTGATGAGGAGTCTGC XM_021064820 CACNB2 AGTGTCAGACGAAGTGCTCC ATP2B4 CGAGATTGACCACGCAGAGA XM_021063199 ATP2B4 GCTCCCGTCTGGAATGTGTT SA100A6 ATGCCCTCTGGATCAGGCTA AY610306 SA100A6 GCCCCAATGGTGAGTTCCTT S100A10-qPCR-F AAAAGACCCTCTGGCTGTGG AC277996 S100A10-qPCR-R GCCCAGCGATTAGCGAAAAG vetsci-12-00864-t002_Table 2 Table 2 Antiviral activity of DTZ against PRV in vitro. Compound Cell Lines CC 50 IC 50 SI DTZ Vero 341.77 ± 10.80 25.53 ± 2.59 13.38 PK15 478.26 ± 12.27 39.28 ± 1.33 12.17 ",
  "metadata": {
    "Title of this paper": "Paeonol inhibits the replication of bovine herpesvirus type 1 in vitro through regulating the PI3K/AKT pathway",
    "Journal it was published in:": "Veterinary Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474134/"
  }
}