{
  "title": "Paper_1123",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470042 PMC12470042.1 12470042 12470042 41009575 10.3390/ijms26189008 ijms-26-09008 1 Review STINGing Cancer: Development, Clinical Application, and Targeted Delivery of STING Agonists https://orcid.org/0000-0002-5030-231X Nerdinger Yannick Gabriel 1 2 3 4 5 † https://orcid.org/0009-0006-7338-8503 Binder Amanda Katharina 1 2 3 4 5 † https://orcid.org/0000-0001-6119-2542 Bremm Franziska 1 2 3 4 5 https://orcid.org/0009-0002-9104-2195 Feuchter Niklas 1 2 3 4 5 https://orcid.org/0000-0001-8236-9298 Schaft Niels 1 2 3 4 5 https://orcid.org/0000-0002-3478-0741 Dörrie Jan 1 2 3 4 5 * Malvicini Mariana Academic Editor 1 yannick.nerdinger@fau.de amanda.binder@uk-erlangen.de franziska.bremm@uk-erlangen.de niklas.feuchter@uk-erlangen.de niels.schaft@uk-erlangen.de 2 3 4 5 * jan.doerrie@uk-erlangen.de † These authors contributed equally to this work. 16 9 2025 9 2025 26 18 497349 9008 14 8 2025 10 9 2025 12 9 2025 16 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ As cancer incidence continues to rise and conventional therapies remain of limited effectiveness, the search for novel and innovative cancer treatments is ongoing. In recent years, immunotherapies, including checkpoint inhibitors and cell-based approaches such as CAR-T cell therapy, have revolutionized the treatment of cancer. However, response rates even to well-established immunotherapies remain low in several types of cancer. Therefore, various novel immunomodulatory substances are currently under investigation, among them agonists of the intracellular signaling protein STING (STimulator of INterferon Genes). Activation of the STING signaling pathway can alter the cytokine profile within the tumor microenvironment (TME) and reshape the function of various immune cells. STING agonists have yielded promising results in preclinical studies, but this success has not yet been replicated in clinical trials. Consequently, STING agonists are optimized for greater potency and combined with nanotechnologies to enhance biodistribution and achieve sustained accumulation within the TME. This review summarizes a selection of STING agonists evaluated in clinical trials to date and discusses their effects on tumor-infiltration immune cells, especially macrophages. It highlights emerging candidates currently under investigation in preclinical studies, and explores nanotechnological approaches for their combinational use to enhance therapeutic efficacy. STING agonist small molecules nano therapy immunotherapy cancer therapy tumor microenvironment tumor-associated macrophages BMBF 01KT2305A This work was supported by funding from the BMBF in the context of the transnational joint research program ERA-NET TRANSCAN, Project TumorOUT, funding number 01KT2305A, to J.D. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Despite major advances in cancer immunotherapy through checkpoint inhibitors and CAR-T cell therapies in recent years, substantial challenges remain. Genetically engineered CAR-T cells revolutionized cancer therapy for blood cancer, but proved generally ineffective in solid tumors, primarily because access to the tumor tissue constitutes a major bottleneck for these cellular therapies. Furthermore, the immunosuppressive tumor microenvironment impairs the anti-tumoral function of both endogenous and genetically engineered immune cells. To address solid tumors, strategies involve the development of subcellular therapies that specifically target immune cells already residing within the tumor microenvironment (TME). Immune checkpoint inhibitors (ICI) that block inhibitory receptors on tumor-specific T cells require not only an immunogenic epitope repertoire on the cancer cells, but also T-cell infiltration into the tumor. Given the critical role of the immune cell composition within the TME in determining the therapeutic outcome of immunotherapies, the polarization of innate immune cells towards a pro-tumoral phenotype is promising strategy. Here, macrophages are of particular interest, as they are abundant within the TME and can exhibit both pro- and anti-tumoral polarization states, which remain plastic and reversible. One major driver of macrophage polarization is the STING (STimulator of INterferon Genes) signaling pathway. It has been shown that STING signaling in macrophages diminishes their suppressive functions and enhances their contribution to tumor clearance through pro-inflammatory effector activity [ 1 2. Macrophage Involvement in Tumor Elimination Since Mills et al. postulated the macrophage polarization dichotomy in 2000, macrophages have been broadly categorized into pro-inflammatory M1 and anti-inflammatory M2-LIKE states [ 2 3 3 4 5 6 Despite this conceptual advancement, the nomenclature remains inconsistent. While many researchers continue to rely on the M1/M2 classification, others advocate for more precise designation at least of in vitro-generated macrophages based on their activating stimuli—for example, M(IL-4), M(LPS), or M(IFNγ) [ 3 7 3 5 8 9 Taking all this into account, we use the terms M1-like M2-like The herein described M1-like macrophages can be induced by pathogens and antigen-experienced T cells as well as IFNγ, LPS, and GM-CSF. In their activated state, M1-like macrophages act cytotoxically and release reactive oxygen species (ROS) and nitric oxide (NO), as well as pro-inflammatory cytokines such as TNFα, IL-1β, IL-6, IL-12, and IL-18 [ 10 11 12 13 H H 2 14 15 16 17 18 19 20 21 22 23 Within the TME, macrophages constitute approximately 5% to 50% of immune cells and are predominantly polarized towards the M2-like phenotype, commonly referred to as tumor-associated macrophages (TAMs) [ 24 25 26 27 28 29 Since macrophage polarization depends on complex signaling programs, triggered by distinct stimuli and mediators, and research into macrophage plasticity still expands, it is becoming increasingly evident that macrophage differentiation is not terminal. Instead, additional stimulation can induce repolarization from one phenotype to another. Therefore, therapeutics that shift M2-like to M1-like macrophages may be a crucial factor in effective cancer elimination [ 30 3. STING Signaling Determines Macrophage Polarization One important mediator of macrophage polarization is the endoplasmic reticulum (ER)-associated signaling molecule STING, which is a sensor of cytosolic double stranded DNA (dsDNA) [ 1 31 Figure 1 32 33 34 35 34 36 37 38 39 40 41 42 Apart from the canonical IRF3 activation, STING can also induce activation of the transcription factor nuclear factor kappa B (NF-κB) through the IκB kinase (IKK), thus further enhancing the type 1 interferon response [ 43 Furthermore, STING signaling has been linked to the activation of the NLRP3 (NOD-like receptor family pyrin domain-containing-3) and AIM2 (absent in melanoma 2) inflammasomes [ 44 45 46 46 47 48 49 In conclusion, the STING signaling pathway initiates a unique transcriptional program in macrophages including the activation of NF-κB and IRF3, which lead to the production of pro-inflammatory cytokines. Hence, the STING pathway in macrophages is primarily associated with the polarization toward an M1-like phenotype. Indeed, intratumoral injection of cGAMP facilitates the recruitment and activation of classically activated macrophages in a STING dependent manner [ 50 38 51 52 4. Categories of STING Agonists The STING signaling pathway plays a crucial role in promoting a pro-inflammatory effector phenotype, not only in macrophages but also in various other immune cell subsets. This immune reprogramming has been shown to drive effective anti-tumor responses, contributing to tumor elimination. Building on these findings, numerous STING agonists have been developed to synthetically activate STING and induce a robust pro-inflammatory response ( Figure 2 53 54 In general, STING agonists can be divided into different subgroups including synthetic cyclic dinucleotides (CDNs), non-cyclic dinucleotides (non-CDNs), antibody drug conjugates (ADCs), and indirect STING agonists. Synthetic CDN STING agonists mimic natural CDN compounds like cGAMP and their engagement with STING. They were the first STING agonists to enter clinical investigation, with promising initial success. However, most CDNs are rapidly metabolized upon administration, leading to a reduced stability and a short serum half-life [ 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 4.1. STING Agonists in Clinical Trials for Cancer Therapy and Their Immunological Effects 4.1.1. IMSA101 A comprehensive summary of clinical investigations involving STING agonists is presented in Table 1 72 Table 2 Table 3 IMSA101 then progressed to phase 1 clinical evaluation as single agent and in combination with checkpoint inhibitors (NCT4020185). Tumor shrinkage was observed in all settings; however, a partial response to treatment was only seen in one of the 13 patients within the combinational cohort, none within the monotherapy cohort [ 73 NCT05846646 NCT05846659 74 NCT06026254 NCT06601296 4.1.2. ADU-S100 (MIW 815) Another synthetic CDN agonist currently in clinical research is ADU-S100 (also referred to as MIW 815 or ML-RR-S2-CDA). ADU-S100 was optimized for an increased affinity to human STING (hSTING) and higher activation efficacy [ 55 + 55 75 76 55 In mouse models of peritoneal carcinomatosis of colon cancer (PCCC), intraperitoneal injection of ADU-S100 was able to reprogram the suppressive TME into a highly inflammatory milieu. STING signaling in macrophages led to the upregulation of M1-associated markers on the cell surface, reprogramming them into a pro-inflammatory state. Immune remodeling in the TME has been linked to IFN-1 signaling as well as CD8 + 76 Two phase 1 clinical trials were initiated in 2016 to assess the therapeutic potential of ADU-S100 as monotherapy or in combination with checkpoint inhibitors ( NCT02675439 NCT03172936 57 77 78 4.1.3. SB 11285 SB 11285 is a synthetic CDN STING agonist, which can be administered not only intratumorally, but also systemically via intraperitoneal and intravenous routes [ 72 Preclinical studies in mice confirmed STING activation in several immune cells, including monocytes. SB 11285 demonstrated a favorable safety profile while inducing strong production of IFN-1, as well as other cytokines, chemokines, and interferon stimulated genes (ISGs). Importantly, inflammation remained localized within the TME not only after intratumoral injection [ 79 80 + + 81 In vitro studies confirmed the binding of SB 11285 to different human STING variants. Exposing human PBMCs, monocytes, and monocyte-derived dendritic cells (DCs) to SB 11285 resulted in the production of IFN-1, as well as other cytokines and chemokines [ 82 A phase 1a/b clinical trial evaluating SB 11285, either alone or in combination with the PD-L1 inhibitor Atezolizumab, in patients with advanced solid tumors completed its evaluation in July 2024 but the results were not yet published ( NCT04096638 4.1.4. TAK-676 (Dazostinag) TAK-676 (also known as Dazostinag) is another synthetic CDN STING agonist currently under clinical investigation. It has been optimized to achieve enhanced serum stability and tissue permeability, enabling intravenous administration for systemic delivery [ 83 84 85 Preclinical data confirmed the binding of TAK-676 to both human and murine STING. Enhanced recruitment of immune cells was observed in tumor tissue, as well as an increased abundance of NK cells and DCs in the lymph nodes. Treatment led to a robust anti-tumor response, characterized by pro-inflammatory mediators such as IFNα, IFNγ, CXCL10, TNFα, and IL-6 [ 83 84 85 NCT06062602 + 86 NCT04420884 NCT04879849 4.1.5. E7766 The novel STING agonist E7766 is based on a CDN but contains an additional molecular bridge between the purine-residues. Designed for enhanced stability, it can be administered both intratumorally and intravenously. High-affinity binding to murine and human STING across several genotypes has been confirmed in in vitro binding models [ 87 88 87 88 89 90 91 87 88 90 87 Another preclinical study utilized an ADC, linking E7766 to an antibody against prostate-specific membrane antigen (PSMA) to target PSMA-expressing prostate cancer cells, delivering the drug E7766 with high specificity to the tumor. The agonist was found to accumulate in high abundance in tumor tissues compared to lower levels in plasma. The treatment induced a robust anti-tumor response, as assessed by the production of pro-inflammatory cytokines and tumor shrinkage. STING pathway activity was confirmed by the production of IFNβ, CXCL10, TNFα, and IL-6. Furthermore, reprogramming of M2-like macrophages into the pro-inflammatory M1-like subtype was observed in the TME [ 92 Two phase 1 trials were initiated to investigate the clinical potential of E7766 as monotherapy in patients with solid tumors in February 2020 ( NCT04144140 NCT04109092 + 93 4.1.6. SYNB 1891 The bacterial vector STING agonist SYNB 1891 is a live strain of probiotic E. coli Nissle 94 62 Preclinical studies on mice confirmed that the vector proliferated within tumors, remained localized, and did not extravasate into the bloodstream. The production of CDA by the vector induced a dose-dependent increase in IFNβ, IFNγ, TNFα, IL-6, IL-1β, and GM-CSF expression. Apart from STING activation, SYNB 1891 also stimulated innate immune cells via pattern recognition receptors, further contributing to IFN-1 production. The agonist elicited a potent CD8 + 62 NCT04167137 61 95 4.1.7. ExoSTING (CDK-002) The nanocarrier exoSTING (or CD-002) is an engineered exosome displaying high quantities of the glycoprotein PTGFRN, which enables specific targeting of antigen presenting cells (APCs) [ 96 97 60 H 60 96 + 60 96 97 NCT04592484 + 98 99 4.1.8. ONM-501 Another STING agonist nanoparticle is ONM-501. The agonist uses the synthetic, pH-sensitive STING-activating polymer PC7A to encapsulate cGAMP. At physiological pH, the PC7A polymers form micelles, protecting the nanoparticle from degradation. Upon reaching the acidic TME, pH-induced dissociation of the micelle releases cGAMP from endocytosed nanoparticles, delivering the agonist cGAMP as well as the PC7A polymers to the target cells. Both cGAMP and PC7A polymers directly interact with STING and synergistically activate the protein. Additionally, the PC7A polymers stabilize STING molecules upon binding, slowing down their degradation and extending STING activity [ 100 101 102 Preclinical studies confirmed dose-dependent activation of both mouse and human STING after intratumoral injection. ONM-501 was shown to accumulate within the tumor and induce rapid, prolonged STING signaling in the targeted cells. This signaling led to the expression of pro-inflammatory cytokines, including high levels of IFNβ and CXCL10. Notably, no cytokine storm due to systemic cytokine release was observed in treated animals. ONM-501 elicited a potent, CD8 + 102 103 104 105 In preclinical studies involving the PC7A polymer alone, treatment resulted in an increase in M1-like macrophages, while the fraction of M2-like macrophages was reduced, suggesting a reprogramming of macrophages into a pro-inflammatory state [ 101 ONM-501 is currently being evaluated in a phase 1 clinical trial in patients with solid tumors or lymphomas, either as a monotherapy or in combination with the anti-PD-1 antibody Cemiplimab ( NCT06022029 100 4.2. STING Agonists and Their Effect on Macrophages in Preclinical Evaluations Beside the STING agonists described above that have already been investigated in clinical trials, there are several additional candidates currently undergoing preclinical evaluation. These have demonstrated a great impact on pro-inflammatory macrophage polarization as well as promising anti-tumor effects in preclinical mouse models and are reviewed in more detail in the following section. IACS-8803, also referred to as IMGS-203, is a CDN STING agonist, which effectively binds and activates both murine and human STING variants. Treatment with IACS-8803 induced tumor regression comparable to checkpoint inhibitor therapy and outperformed other CDN agonists like ADU-S100. IACS-8803 promoted increased infiltration of CD8 + + 106 107 108 109 110 The non-CDN agonist MSA-2 was developed for systemic administration and can be delivered via subcutaneous, oral, or intratumoral injection. In murine cancer models, MSA-2 exhibited high permeability and preferentially targeted and activated STING within the acidic TME. It potently induced STING signaling, leading to the production of the pro-inflammatory cytokines IFNβ, TNFα, and IL-6. Importantly, MSA-2 treatment promoted a shift within the TME towards inflammation. Treated tumors showed an increased presence of M1-like macrophages, CD8 + 111 112 Another non-CDN STING agonist, SR-717, has demonstrated great anti-tumor efficacy in preclinical studies. Mice treated with SR-717 exhibited a higher frequency of activated NK cells and CD8 + 113 114 115 5. Conclusions: STING Agonists Drive Pro-Inflammatory Reprogramming in the TME The reviewed STING agonists demonstrate the potential to induce STING-mediated immune responses for effective tumor clearance. By activating key immune cell populations within the tumor microenvironment, STING signaling helps to reshape the immune landscape toward a more pro-inflammatory and tumor-suppressive state [ 76 111 STING signaling has been shown to enhance the activation and recruitment of NK cells, CD8 + 72 76 79 83 87 + 106 116 60 106 116 76 106 1 117 76 92 101 72 80 118 Clinical and preclinical studies consistently report a strong STING-dependent induction of pro-inflammatory mediators such as IFNβ, CXCL-10, TNFα, and IL-6, followed by the expression of ISGs [ 62 81 83 92 + 55 72 119 62 83 Conversely, STING agonists also diminish the expression of immunosuppressive cytokines such as TGFβ and IL-10 [ 72 60 120 121 6. Limitations of STING as Therapeutic Target With the promising results of early agonists, the cGAS-STING pathway has become a major focus in cancer immunotherapy. Numerous STING agonists are currently in development, with emerging clinical data supporting their potential. However, to date, none have been granted approval for clinical use by the FDA or the EMA due to insufficient treatment responses observed in clinical trials. Early trials of CDN STING agonists have demonstrated poor serum stability, limited permeability, and consequently, low efficacy in patients. Challenges for STING agonist are manifold. First, STING agonists show a poor cell internalization since most STING agonists are negatively charged which limits their permeability across the negatively charged cell membrane [ 122 123 124 125 112 126 57 122 127 125 7. Recent Delivery Strategies for STING Agonists Compared to free STING agonists, engineered delivery systems allow for lower dosing while achieving superior anti-tumor immune responses [ 60 128 Dosta et al. developed an advanced nanoparticle (NP) formulation to enable a controlled release of STING agonist in the TME by covalently conjugating the CDNs to poly(beta)-amino-ester NPs via a cathepsin-sensitive linker. This linker is cleaved by endoproteases in the lysosomes, resulting in targeted release of the CDNs inside immune cells [ 129 130 co 131 Another delivery strategy are liposomes; here, Chen et al. engineered STING-activating liposomal vesicles delivering a STING agonist as esterase-sensitive pro-drug for enhanced pharmacokinetic properties [ 132 133 A distinct approach utilizes the natural biological features of extracellular vesicles (EVs) to encapsulate and efficiently deliver STING agonists. Jang et al. purified extracellular vesicles from the supernatant of HEK293 cells and loaded them with STING agonists. These exoSTING EVs were tested on human macrophages and showed a preferential activation of M2-like macrophages [ 60 Another strategy to extend the intratumoral release of STING agonists and to induce a sustained shift within the TME involved the use of hydrogels. Hydrogels are three-dimensional polymer matrixes that spontaneously self-assemble. Wang et al. conjugated the hydrophilic peptide moiety iRGD, that specifically targets cancer cells, to the hydrophobic cytostatic alkaloid camptothecin. This amphiphile conjugate self-assembled into supramolecular nanotubes. Via electrostatic complexation, the negatively charged STING agonist (c-di-AMP) condensed on the surface of the positively charged nanotubes. Under physiological conditions these nanotubes formed supramolecular hydrogels functioning as local reservoir of anti-cancer drugs [ 134 135 In conclusion, nanocarrier and conjugated STING agonists can overcome the challenges of first-generation agonists, but further optimization is still ongoing to improve targeting, bio distribution, and drug release mechanisms. Importantly, by selectively targeting both immune-suppressive myeloid cells and tumor cells, ADCs and nanocarrier-based STING agonists promote a localized pro-inflammatory shift within the TME. 8. Future Directions of STING Agonism in Cancer Therapy The development of novel STING agonists, along with the advancement of innovative delivery strategies represents a rapidly evolving field of research. Emerging clinical data have highlighted both the potential and the limitations of STING as therapeutic target. In this context, further characterization of STING agonists regarding their ability to activate STING in macrophages and drive their polarization toward the M1-like subtype is highly anticipated. This could provide valuable insights into the role of key mediators in establishing a robust anti-tumor immune response, as well as the broader interplay of immune cells following STING activation. Such findings may support the development of more refined STING agonists that selectively target specific immune cell populations, thereby reducing STING-induced toxicity. Encouraging progress has been made in the development of targeted STING agonists which promise, in combination with advances in effective delivery systems, solutions to current challenges, potentially enabling a safer and more effective treatment across a broader spectrum of tumors. The mechanism of STING agonists in combination with checkpoint inhibitors have been evaluated in various preclinical and clinical studies, revealing a synergistic effect that enhances anti-tumor responses [ 105 106 76 87 136 96 104 76 111 In summary, the data reviewed in this article suggest that STING agonists, both alone and as combination therapy with immune checkpoint inhibitors, hold great promise for reprogramming the tumor microenvironment by shifting the suppressive immune compartment towards a pro-inflammatory state. Acknowledgments We would like to thank Lars Nitschke (Division of Genetics, FAU Erlangen-Nürnberg, Erlangen, Germany) for the co-supervision of this theoretical work by Y.G.N. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, A.K.B., N.S. and J.D.; investigation, Y.G.N. and A.K.B.; writing—original draft preparation, Y.G.N. and A.K.B.; writing—review and editing, Y.G.N., A.K.B., F.B., N.F., N.S. and J.D.; visualization, Y.G.N. and A.K.B.; supervision, J.D. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement Not applicable. Conflicts of Interest The authors declare no conflicts of interest. References 1. Ohkuri T. Kosaka A. Nagato T. Kobayashi H. Effects of STING stimulation on macrophages: STING agonists polarize into “classically” or “alternatively” activated macrophages? Hum. Vaccines Immunother. 2018 14 285 287 10.1080/21645515.2017.1395995 PMC5806643 29064738 2. Mills C.D. Kincaid K. Alt J.M. Heilman M.J. Hill A.M. M-1/M-2 macrophages and the Th1/Th2 paradigm J. Immunol. 2000 164 6166 6173 10.4049/jimmunol.164.12.6166 28923981 3. Murray P.J. Allen J.E. Biswas S.K. Fisher E.A. Gilroy D.W. Goerdt S. Gordon S. Hamilton J.A. Ivashkiv L.B. Lawrence T. Macrophage activation and polarization: Nomenclature and experimental guidelines Immunity 2014 41 14 20 10.1016/j.immuni.2014.06.008 25035950 PMC4123412 4. Stout R.D. Jiang C. Matta B. Tietzel I. Watkins S.K. Suttles J. Macrophages sequentially change their functional phenotype in response to changes in microenvironmental influences J. Immunol. 2005 175 342 349 10.4049/jimmunol.175.1.342 15972667 5. Biswas S.K. Mantovani A. Macrophage plasticity and interaction with lymphocyte subsets: Cancer as a paradigm Nat. Immunol. 2010 11 889 896 10.1038/ni.1937 20856220 6. Martinez F.O. Gordon S. The M1 and M2 paradigm of macrophage activation: Time for reassessment F1000Prime Rep. 2014 6 13 10.12703/P6-13 24669294 PMC3944738 7. Nahrendorf M. Swirski F.K. Abandoning M1/M2 for a Network Model of Macrophage Function Circ. Res. 2016 119 414 417 10.1161/CIRCRESAHA.116.309194 27458196 PMC4965179 8. Paolicelli R.C. Sierra A. Stevens B. Tremblay M.E. Aguzzi A. Ajami B. Amit I. Audinat E. Bechmann I. Bennett M. Microglia states and nomenclature: A field at its crossroads Neuron 2022 110 3458 3483 10.1016/j.neuron.2022.10.020 36327895 PMC9999291 9. Strizova Z. Benesova I. Bartolini R. Novysedlak R. Cecrdlova E. Foley L.K. Striz I. M1/M2 macrophages and their overlaps-myth or reality? Clin. Sci. 2023 137 1067 1093 10.1042/CS20220531 PMC10407193 37530555 10. Bonnotte B. Larmonier N. Favre N. Fromentin A. Moutet M. Martin M. Gurbuxani S. Solary E. Chauffert B. Martin F. Identification of tumor-infiltrating macrophages as the killers of tumor cells after immunization in a rat model system J. Immunol. 2001 167 5077 5083 10.4049/jimmunol.167.9.5077 11673517 11. Mytar B. Siedlar M. Wołoszyn M. Ruggiero I. Pryjma J. Zembala M. Induction of reactive oxygen intermediates in human monocytes by tumour cells and their role in spontaneous monocyte cytotoxicity Br. J. Cancer 1999 79 737 743 10.1038/sj.bjc.6690118 10070862 PMC2362686 12. Stuehr D.J. Nathan C.F. Nitric oxide. A macrophage product responsible for cytostasis and respiratory inhibition in tumor target cells J. Exp. Med. 1989 169 1543 1555 10.1084/jem.169.5.1543 2497225 PMC2189318 13. Urban J.L. Shepard H.M. Rothstein J.L. Sugarman B.J. Schreiber H. Tumor necrosis factor: A potent effector molecule for tumor cell killing by activated macrophages Proc. Natl. Acad. Sci. USA 1986 83 5233 5237 10.1073/pnas.83.14.5233 3487788 PMC323925 14. Arango Duque G. Descoteaux A. Macrophage cytokines: Involvement in immunity and infectious diseases Front. Immunol. 2014 5 491 10.3389/fimmu.2014.00491 25339958 PMC4188125 15. Gordon S. Martinez F.O. Alternative activation of macrophages: Mechanism and functions Immunity 2010 32 593 604 10.1016/j.immuni.2010.05.007 20510870 16. Goerdt S. Orfanos C.E. Other functions, other genes: Alternative activation of antigen-presenting cells Immunity 1999 10 137 142 10.1016/S1074-7613(00)80014-X 10072066 17. Italiani P. Mazza E.M.C. Lucchesi D. Cifola I. Gemelli C. Grande A. Battaglia C. Bicciato S. Boraschi D. Transcriptomic profiling of the development of the inflammatory response in human monocytes in vitro PLoS ONE 2014 9 e87680 10.1371/journal.pone.0087680 24498352 PMC3912012 18. Stein M. Keshav S. Harris N. Gordon S. Interleukin 4 potently enhances murine macrophage mannose receptor activity: A marker of alternative immunologic macrophage activation J. Exp. Med. 1992 176 287 292 10.1084/jem.176.1.287 1613462 PMC2119288 19. Topoll H.H. Zwadlo G. Lange D.E. Sorg C. Phenotypic dynamics of macrophage subpopulations during human experimental gingivitis J. Periodontal Res. 1989 24 106 112 10.1111/j.1600-0765.1989.tb00864.x 2524575 20. Chang Z.L. Bonvini E. Varesio L. Holden H.T. Herberman R.B. Differential in vitro modulation of suppressor and antitumor functions of mouse macrophages by lymphokines and/or endotoxin Cell. Immunol. 1988 114 282 292 10.1016/0008-8749(88)90322-X 2839302 21. Lewis C.E. Pollard J.W. Distinct role of macrophages in different tumor microenvironments Cancer Res. 2006 66 605 612 10.1158/0008-5472.CAN-05-4005 16423985 22. Saha B. Das G. Vohra H. Ganguly N.K. Mishra G.C. Macrophage-T cell interaction in experimental mycobacterial infection. Selective regulation of co-stimulatory molecules on Mycobacterium-infected macrophages and its implication in the suppression of cell-mediated immune response Eur. J. Immunol. 1994 24 2618 2624 10.1002/eji.1830241108 7525297 23. Wu H. Xu J.-B. He Y.-L. Peng J.-J. Zhang X.-H. Chen C.-Q. Li W. Cai S.-R. Tumor-associated macrophages promote angiogenesis and lymphangiogenesis of gastric cancer J. Surg. Oncol. 2012 106 462 468 10.1002/jso.23110 22488237 24. Zuljan E. von der Emde B. Piwonski I. Pestana A. Klinghammer K. Mock A. Horak P. Heining C. Klauschen F. Pretzell I. A macrophage-predominant immunosuppressive microenvironment and therapeutic vulnerabilities in advanced salivary gland cancer Nat. Commun. 2025 16 5303 10.1038/s41467-025-60421-0 40506428 PMC12162891 25. Xu B. Sun H. Song X. Liu Q. Jin W. Mapping the Tumor Microenvironment in TNBC and Deep Exploration for M1 Macrophages-Associated Prognostic Genes Front. Immunol. 2022 13 923481 10.3389/fimmu.2022.923481 35844580 PMC9279655 26. Hughes R. Qian B.Z. Rowan C. Muthana M. Keklikoglou I. Olson O.C. Tazzyman S. Danson S. Addison C. Clemons M. Perivascular M2 Macrophages Stimulate Tumor Relapse after Chemotherapy Cancer Res. 2015 75 3479 3491 10.1158/0008-5472.CAN-14-3587 26269531 PMC5024531 27. Leblond M.M. Peres E.A. Helaine C. Gerault A.N. Moulin D. Anfray C. Divoux D. Petit E. Bernaudin M. Valable S. M2 macrophages are more resistant than M1 macrophages following radiation therapy in the context of glioblastoma Oncotarget 2017 8 72597 72612 10.18632/oncotarget.19994 29069812 PMC5641155 28. Xu M. Liu M. Du X. Li S. Li H. Li X. Li Y. Wang Y. Qin Z. Fu Y.X. Intratumoral Delivery of IL-21 Overcomes Anti-Her2/Neu Resistance through Shifting Tumor-Associated Macrophages from M2 to M1 Phenotype J. Immunol. 2015 194 4997 5006 10.4049/jimmunol.1402603 25876763 29. Yang C. He L. He P. Liu Y. Wang W. He Y. Du Y. Gao F. Increased drug resistance in breast cancer by tumor-associated macrophages through IL-10/STAT3/bcl-2 signaling pathway Med. Oncol. 2015 32 352 10.1007/s12032-014-0352-6 25572805 30. Porcheray F. Viaud S. Rimaniol A.-C. Léone C. Samah B. Dereuddre-Bosquet N. Dormont D. Gras G. Macrophage activation switching: An asset for the resolution of inflammation Clin. Exp. Immunol. 2005 142 481 489 10.1111/j.1365-2249.2005.02934.x 16297160 PMC1809537 31. Wang Q. Bergholz J.S. Ding L. Lin Z. Kabraji S.K. Hughes M.E. He X. Xie S. Jiang T. Wang W. STING agonism reprograms tumor-associated macrophages and overcomes resistance to PARP inhibition in BRCA1-deficient models of breast cancer Nat. Commun. 2022 13 3022 10.1038/s41467-022-30568-1 35641483 PMC9156717 32. Li X. Shu C. Yi G. Chaton C.T. Shelton C.L. Diao J. Zuo X. Kao C.C. Herr A.B. Li P. Cyclic GMP-AMP synthase is activated by double-stranded DNA-induced oligomerization Immunity 2013 39 1019 1031 10.1016/j.immuni.2013.10.019 24332030 PMC3886715 33. Zhang X. Wu J. Du F. Xu H. Sun L. Chen Z. Brautigam C.A. Zhang X. Chen Z.J. The cytosolic DNA sensor cGAS forms an oligomeric complex with DNA and undergoes switch-like conformational changes in the activation loop Cell Rep. 2014 6 421 430 10.1016/j.celrep.2014.01.003 24462292 PMC3969844 34. Ablasser A. Goldeck M. Cavlar T. Deimling T. Witte G. Röhl I. Hopfner K.-P. Ludwig J. Hornung V. cGAS produces a 2′-5′-linked cyclic dinucleotide second messenger that activates STING Nature 2013 498 380 384 10.1038/nature12306 23722158 PMC4143541 35. Gao P. Ascano M. Wu Y. Barchet W. Gaffney B.L. Zillinger T. Serganov A.A. Liu Y. Jones R.A. Hartmann G. Cyclic G(2′,5′)pA(3′,5′)p is the metazoan second messenger produced by DNA-activated cyclic GMP-AMP synthase Cell 2013 153 1094 1107 10.1016/j.cell.2013.04.046 23647843 PMC4382009 36. Jin L. Waterman P.M. Jonscher K.R. Short C.M. Reisdorph N.A. Cambier J.C. MPYS, a novel membrane tetraspanner, is associated with major histocompatibility complex class II and mediates transduction of apoptotic signals Mol. Cell. Biol. 2008 28 5014 5026 10.1128/MCB.00640-08 18559423 PMC2519703 37. Wu J. Sun L. Chen X. Du F. Shi H. Chen C. Chen Z.J. Cyclic GMP-AMP is an endogenous second messenger in innate immune signaling by cytosolic DNA Science 2013 339 826 830 10.1126/science.1229963 23258412 PMC3855410 38. Sun W. Li Y. Chen L. Chen H. You F. Zhou X. Zhou Y. Zhai Z. Chen D. Jiang Z. ERIS, an endoplasmic reticulum IFN stimulator, activates innate immune signaling through dimerization Proc. Natl. Acad. Sci. USA 2009 106 8653 8658 10.1073/pnas.0900850106 19433799 PMC2689030 39. Dobbs N. Burnaevskiy N. Chen D. Gonugunta V.K. Alto N.M. Yan N. STING Activation by Translocation from the ER Is Associated with Infection and Autoinflammatory Disease Cell Host Microbe 2015 18 157 168 10.1016/j.chom.2015.07.001 26235147 PMC4537353 40. Zhang C. Shang G. Gui X. Zhang X. Bai X.-C. Chen Z.J. Structural basis of STING binding with and phosphorylation by TBK1 Nature 2019 567 394 398 10.1038/s41586-019-1000-2 30842653 PMC6862768 41. Liu S. Cai X. Wu J. Cong Q. Chen X. Li T. Du F. Ren J. Wu Y.-T. Grishin N.V. Phosphorylation of innate immune adaptor proteins MAVS, STING, and TRIF induces IRF3 activation Science 2015 347 aaa2630 10.1126/science.aaa2630 25636800 42. Taniguchi T. Ogasawara K. Takaoka A. Tanaka N. IRF family of transcription factors as regulators of host defense Annu. Rev. Immunol. 2001 19 623 655 10.1146/annurev.immunol.19.1.623 11244049 43. Ishikawa H. Barber G.N. STING is an endoplasmic reticulum adaptor that facilitates innate immune signalling Nature 2008 455 674 678 10.1038/nature07317 18724357 PMC2804933 44. Liu F. Niu Q. Fan X. Liu C. Zhang J. Wei Z. Hou W. Kanneganti T.-D. Robb M.L. Kim J.H. Priming and Activation of Inflammasome by Canarypox Virus Vector ALVAC via the cGAS/IFI16-STING-Type I IFN Pathway and AIM2 Sensor J. Immunol. 2017 199 3293 3305 10.4049/jimmunol.1700698 28947539 PMC5679316 45. Man S.M. Karki R. Malireddi R.K.S. Neale G. Vogel P. Yamamoto M. Lamkanfi M. Kanneganti T.-D. The transcription factor IRF1 and guanylate-binding proteins target activation of the AIM2 inflammasome by Francisella infection Nat. Immunol. 2015 16 467 475 10.1038/ni.3118 25774715 PMC4406811 46. Sun Y. Hu H. Liu Z. Xu J. Gao Y. Zhan X. Zhou S. Zhong W. Wu D. Wang P. Macrophage STING signaling promotes NK cell to suppress colorectal cancer liver metastasis via 4-1BBL/4-1BB co-stimulation J. Immunother. Cancer 2023 3 e006481 10.1136/jitc-2022-006481 36927529 PMC10030919 47. Song X. Ma F. Herrup K. Accumulation of Cytoplasmic DNA Due to ATM Deficiency Activates the Microglial Viral Response System with Neurotoxic Consequences J. Neurosci. Off. J. Soc. Neurosci. 2019 39 6378 6394 10.1523/JNEUROSCI.0774-19.2019 31189575 PMC6687895 48. Coll R.C. Schroder K. Pelegrín P. NLRP3 and pyroptosis blockers for treating inflammatory diseases Trends Pharmacol. Sci. 2022 43 653 668 10.1016/j.tips.2022.04.003 35513901 49. Corrales L. Woo S.-R. Williams J.B. McWhirter S.M. Dubensky T.W. Gajewski T.F. Antagonism of the STING Pathway via Activation of the AIM2 Inflammasome by Intracellular DNA J. Immunol. 2016 196 3191 3198 10.4049/jimmunol.1502538 26927800 PMC4800192 50. Ohkuri T. Kosaka A. Ishibashi K. Kumai T. Hirata Y. Ohara K. Nagato T. Oikawa K. Aoki N. Harabuchi Y. Intratumoral administration of cGAMP transiently accumulates potent macrophages for anti-tumor immunity at a mouse tumor site Cancer Immunol. Immunother. CII 2017 66 705 716 10.1007/s00262-017-1975-1 28243692 PMC11028681 51. Ishikawa H. Ma Z. Barber G.N. STING regulates intracellular DNA-mediated, type I interferon-dependent innate immunity Nature 2009 461 788 792 10.1038/nature08476 19776740 PMC4664154 52. Li X.-D. Wu J. Gao D. Wang H. Sun L. Chen Z.J. Pivotal Roles of cGAS-cGAMP Signaling in Antiviral Defense and Immune Adjuvant Effects Science 2013 341 1390 1394 10.1126/science.1244040 23989956 PMC3863637 53. Kong X. Zuo H. Huang H.-D. Zhang Q. Chen J. He C. Hu Y. STING as an emerging therapeutic target for drug discovery: Perspectives from the global patent landscape J. Adv. Res. 2023 44 119 133 10.1016/j.jare.2022.05.006 35636721 PMC9936525 54. Le Naour J. Zitvogel L. Galluzzi L. Vacchelli E. Kroemer G. Trial watch: STING agonists in cancer therapy Oncoimmunology 2020 9 1777624 10.1080/2162402X.2020.1777624 32934881 PMC7466854 55. Corrales L. Glickman L.H. McWhirter S.M. Kanne D.B. Sivick K.E. Katibah G.E. Woo S.-R. Lemmens E. Banda T. Leong J.J. Direct Activation of STING in the Tumor Microenvironment Leads to Potent and Systemic Tumor Regression and Immunity Cell Rep. 2015 11 1018 1030 10.1016/j.celrep.2015.04.031 25959818 PMC4440852 56. Jenal U. Reinders A. Lori C. Cyclic di-GMP: Second messenger extraordinaire Nat. Rev. Microbiol. 2017 15 271 284 10.1038/nrmicro.2016.190 28163311 57. Meric-Bernstam F. Sandhu S.K. Hamid O. Spreafico A. Kasper S. Dummer R. Shimizu T. Steeghs N. Lewis N. Talluto C.C. Phase Ib study of MIW815 (ADU-S100) in combination with spartalizumab (PDR001) in patients (pts) with advanced/metastatic solid tumors or lymphomas J. Clin. Oncol. 2019 37 2507 10.1200/JCO.2019.37.15_suppl.2507 58. Alley S.C. Okeley N.M. Senter P.D. Antibody-drug conjugates: Targeted drug delivery for cancer Curr. Opin. Chem. Biol. 2010 14 529 537 10.1016/j.cbpa.2010.06.170 20643572 59. Chen X. Xu Z. Li T. Thakur A. Wen Y. Zhang K. Liu Y. Liang Q. Liu W. Qin J.-J. Nanomaterial-encapsulated STING agonists for immune modulation in cancer therapy Biomark. Res. 2024 12 2 10.1186/s40364-023-00551-z 38185685 PMC10773049 60. Jang S.C. Economides K.D. Moniz R.J. Sia C.L. Lewis N. McCoy C. Zi T. Zhang K. Harrison R.A. Lim J. ExoSTING, an extracellular vesicle loaded with STING agonists, promotes tumor immune surveillance Commun. Biol. 2021 4 497 10.1038/s42003-021-02004-5 33888863 PMC8062530 61. Janku F. Luke J.J. Brennan A. Riese R. Varterasian M. Armstrong M.B. Kuhn K.L. Sokolovska A. Strauss J.F. Abstract CT110: Intratumoral injection of SYNB1891, a synthetic biotic designed to activate the innate immune system, demonstrates target engagement in humans including intratumoral STING activation Cancer Res. 2021 81 CT110 10.1158/1538-7445.AM2021-CT110 62. Leventhal D.S. Sokolovska A. Li N. Plescia C. Kolodziej S.A. Gallant C.W. Christmas R. Gao J.-R. James M.J. Abin-Fuentes A. Immunotherapy with engineered bacteria by targeting the STING pathway for anti-tumor immunity Nat. Commun. 2020 11 2739 10.1038/s41467-020-16602-0 32483165 PMC7264239 63. Malli Cetinbas N. Monnell T. Soomer-James J. Shaw P. Lancaster K. Catcott K.C. Dolan M. Mosher R. Routhier C. Chin C.-N. Tumor cell-directed STING agonist antibody-drug conjugates induce type III interferons and anti-tumor innate immune responses Nat. Commun. 2024 15 5842 10.1038/s41467-024-49932-4 38992037 PMC11239908 64. Weiskopf K. Weissman I.L. Macrophages are critical effectors of antibody therapies for cancer mAbs 2015 7 303 310 10.1080/19420862.2015.1011450 25667985 PMC4622600 65. Liang B. Xing X. Storts H. Ye Z. Claybon H. Austin R. Ding R. Liu B. Wen H. Miles W.O. Antagonistic roles of cGAS/STING signaling in colorectal cancer chemotherapy Front. Oncol. 2024 14 1441935 10.3389/fonc.2024.1441935 39469633 PMC11513249 66. Lv M. Chen M. Zhang R. Zhang W. Wang C. Zhang Y. Wei X. Guan Y. Liu J. Feng K. Manganese is critical for antitumor immune responses via cGAS-STING and improves the efficacy of clinical immunotherapy Cell Res. 2020 30 966 979 10.1038/s41422-020-00395-4 32839553 PMC7785004 67. Makarova A.M. Iannello A. Rae C.S. King B. Besprozvannaya M. Faulhaber J. Skoble J. Thanos C.D. Glickman L.H. Abstract 5016: STACT-TREX1: A systemically-administered STING pathway agonist targets tumor-resident myeloid cells and induces adaptive anti-tumor immunity in multiple preclinical models Cancer Res. 2019 79 5016 10.1158/1538-7445.AM2019-5016 68. Onyedibe K.I. Wang M. Sintim H.O. ENPP1, an Old Enzyme with New Functions, and Small Molecule Inhibitors-A STING in the Tale of ENPP1 Molecules 2019 24 4192 10.3390/molecules24224192 31752288 PMC6891441 69. Rasmussen M. Alvik K. Kannen V. Olafsen N.E. Erlingsson L.A.M. Grimaldi G. Takaoka A. Grant D.M. Matthews J. Loss of PARP7 Increases Type I Interferon Signaling in EO771 Breast Cancer Cells and Prevents Mammary Tumor Growth by Increasing Antitumor Immunity Cancers 2023 15 3689 10.3390/cancers15143689 37509350 PMC10377955 70. Wang C. Guan Y. Lv M. Zhang R. Guo Z. Wei X. Du X. Yang J. Li T. Wan Y. Manganese Increases the Sensitivity of the cGAS-STING Pathway for Double-Stranded DNA and Is Required for the Host Defense against DNA Viruses Immunity 2018 48 675 687.e677 10.1016/j.immuni.2018.03.017 29653696 71. Wang J. Lu S.-F. Wan B. Ming S.-L. Li G.-L. Su B.-Q. Liu J.-Y. Wei Y.-S. Yang G.-Y. Chu B.-B. Maintenance of cyclic GMP-AMP homeostasis by ENPP1 is involved in pseudorabies virus infection Mol. Immunol. 2018 95 56 63 10.1016/j.molimm.2018.01.008 29407577 72. Uslu U. Sun L. Castelli S. Finck A.V. Assenmacher C.-A. Young R.M. Chen Z.J. June C.H. The STING agonist IMSA101 enhances chimeric antigen receptor T cell function by inducing IL-18 secretion Nat. Commun. 2024 15 3933 10.1038/s41467-024-47692-9 38730243 PMC11087554 73. Moser J.C. Alistar A. Cohen E. Garmey E. Kazmi S. Mooneyham T. Sun L. Yap T. Mahalingam D. 618 Phase 1 clinical trial evaluating the safety, biologic and anti-tumor activity of the novel STING agonist IMSA101 administered both as monotherapy and in combination with PD-(L)1 checkpoint inhibitors J. Immunother. Cancer 2023 11 A704 10.1136/jitc-2023-SITC2023.0618 74. Lee P. Malhotra J. Salsamendi J. Arbab M. Biswas T. Baschnagel A. Deek M.P. Garmey E.G. Hamstra D.A. Huynh M.A. Two phase 2A clinical trials to evaluate the safety and efficacy of IMSA101 in combination with radiotherapy and checkpoint inhibitors in oligometastatic and oligoprogressive solid tumor malignancies J. Clin. Oncol. 2024 42 TPS2685 10.1200/JCO.2024.42.16_suppl.TPS2685 75. Berger G. Knelson E.H. Jimenez-Macias J.L. Nowicki M.O. Han S. Panagioti E. Lizotte P.H. Adu-Berchie K. Stafford A. Dimitrakakis N. STING activation promotes robust immune response and NK cell–mediated tumor regression in glioblastoma models Proc. Natl. Acad. Sci. USA 2022 119 e2111003119 10.1073/pnas.2111003119 35787058 PMC9282249 76. Lee S.J. Yang H. Kim W.R. Lee Y.S. Lee W.S. Kong S.J. Lee H.J. Kim J.H. Cheon J. Kang B. STING activation normalizes the intraperitoneal vascular-immune microenvironment and suppresses peritoneal carcinomatosis of colon cancer J. Immunother. Cancer 2021 9 e002195 10.1136/jitc-2020-002195 34145029 PMC8215239 77. Meric-Bernstam F. Sweis R.F. Hodi F.S. Messersmith W.A. Andtbacka R.H.I. Ingham M. Lewis N. Chen X. Pelletier M. Chen X. Phase I Dose-Escalation Trial of MIW815 (ADU-S100), an Intratumoral STING Agonist, in Patients with Advanced/Metastatic Solid Tumors or Lymphomas Clin. Cancer Res. An. Off. J. Am. Assoc. Cancer Res. 2022 28 677 688 Erratum in Clin Cancer Res. 2023 29 https://doi.org/10.1158/1078-0432.CCR-23-1170 10.1158/1078-0432.CCR-21-1963 34716197 78. Ji N. Wang M. Tan C. Liposomal Delivery of MIW815 (ADU-S100) for Potentiated STING Activation Pharmaceutics 2023 15 638 10.3390/pharmaceutics15020638 36839960 PMC9966736 79. Challa S.V. Zhou S. Sheri A. Padmanabhan S. Meher G. Gimi R. Schmidt D. Cleary D. Afdhal N. Iyer R. Preclinical studies of SB 11285, a novel STING agonist for immuno-oncology J. Clin. Oncol. 2017 35 e14616 10.1200/JCO.2017.35.15_suppl.e14616 80. Challa S. Ramachandran B. Vijayakrishnan L. Weitzel D. Zhou S. Iyer K. Abstract B96: Pharmacodynamic studies of SB 11285, a systemically bioavailable STING agonist in orthotopic tumor models Cancer Immunol. Res. 2020 8 B96 10.1158/2326-6074.TUMIMM18-B96 81. Luke J. Janku F. Olszanski A. Leach K. Iyer R. Abbas A. 367 A phase 1/1b dose-escalation study of intravenously administered SB 11285 alone and in combination with atezolizumab in patients with advanced solid tumors J. Immunother. Cancer 2020 8 A224 10.1136/jitc-2020-sitc2020.0367 82. Zhou S. Challa S. Nair V. Meher G. Sheri A. Gimi R. Padmanabhan S. Cleary D. Suppiah L. Schmidt D. Abstract B87: Mechanistic insights into the antitumor activity of SB 11285—A novel STING agonist Cancer Immunol. Res. 2020 8 B87 10.1158/2326-6074.TUMIMM18-B87 83. Carideo Cunniff E. Sato Y. Mai D. Appleman V.A. Iwasaki S. Kolev V. Matsuda A. Shi J. Mochizuki M. Yoshikawa M. TAK-676: A Novel Stimulator of Interferon Genes (STING) Agonist Promoting Durable IFN-dependent Antitumor Immunity in Preclinical Studies Cancer Res. Commun. 2022 2 489 502 10.1158/2767-9764.CRC-21-0161 36923556 PMC10010323 84. Cooper B. Chmura S.J. Luke J.J. Shiao S.L. Basho R.K. Iams W.T. Page D.B. Li C. Gregory R.C. Shaw M.H. Abstract CT243: Phase 1 study of TAK-676 + pembrolizumab following radiation therapy in patients with advanced non-small-cell lung cancer (NSCLC), triple-negative breast cancer (TNBC), or squamous-cell carcinoma of the head and neck (SCCHN) Cancer Res. 2022 82 CT243 10.1158/1538-7445.AM2022-CT243 85. Cooper B.T. Chmura S.J. Luke J.J. Shiao S.L. Basho R.K. Iams W.T. Page D.B. Li C. Gregory R.C. Shaw M. TAK-676 in combination with pembrolizumab after radiation therapy in patients (pts) with advanced non–small cell lung cancer (NSCLC), triple-negative breast cancer (TNBC), or squamous-cell carcinoma of the head and neck (SCCHN): Phase 1 study design J. Clin. Oncol. 2022 40 TPS2698 10.1200/JCO.2022.40.16_suppl.TPS2698 86. Rajasekaran K. Ow T.J. Nathan C.-A. Tang A.L. Mehta V. Schiff B.A. Pang J. van Zante A. Turner A. Grenley M.O. Multiplexed trackable intratumor microdosing of the investigational STING agonist TAK-676 alone and in combination in the native tumor microenvironment of patients with head and neck cancer: A phase 0 trial J. Clin. Oncol. 2023 41 2579 10.1200/JCO.2023.41.16_suppl.2579 87. Huang K.-C. Chanda D. McGrath S. Dixit V. Zhang C. Wu J. Tendyke K. Yao H. Hukkanen R. Taylor N. Pharmacologic Activation of STING in the Bladder Induces Potent Antitumor Immunity in Non-Muscle Invasive Murine Bladder Cancer Mol. Cancer Ther. 2022 21 914 924 Erratum in Mol. Cancer Ther. 2023 22 https://doi.org/10.1158/1535-7163.mct-23-0121 10.1158/1535-7163.MCT-21-0780 35313332 88. Kim D.-S. Endo A. Fang F.G. Huang K.-C. Bao X. Choi H.-w. Majumder U. Shen Y.Y. Mathieu S. Zhu X. E7766, a Macrocycle-Bridged Stimulator of Interferon Genes (STING) Agonist with Potent Pan-Genotypic Activity ChemMedChem 2021 16 1740 1743 10.1002/cmdc.202100068 33522135 89. Endo A. Kim D.-S. Huang K.-C. Hao M.-H. Mathieu S. Choi H.-w. Majumder U. Zhu X. Shen Y. Sanders K. Abstract 4456: Discovery of E7766: A representative of a novel class of macrocycle-bridged STING agonists (MBSAs) with superior potency and pan-genotypic activity Cancer Res. 2019 79 4456 10.1158/1538-7445.AM2019-4456 90. Huang K.-C. Endo A. McGrath S. Chandra D. Wu J. Kim D.-S. Albu D. Ingersoll C. Tendyke K. Loiacono K. Abstract 3269: Discovery and characterization of E7766, a novel macrocycle-bridged STING agonist with pan-genotypic and potent antitumor activity through intravesical and intratumoral administration Cancer Res. 2019 79 3269 10.1158/1538-7445.AM2019-3269 91. Jiang R. Hart A. Burgess L. Kim D.-S. Lai W.G. Dixit V. Prediction of Transporter-Mediated Drug-Drug Interactions and Phenotyping of Hepatobiliary Transporters Involved in the Clearance of E7766, a Novel Macrocycle-Bridged Dinucleotide Drug Metab. Dispos. Biol. Fate Chem. 2021 49 265 275 10.1124/dmd.120.000125 33355210 92. Drozdowski B. Arai K. Kim D.-S. Phillips C. Jean-Toussaint R. Huang K.-C. Bao X. Kaburagi Y. Kuboi Y. Lim C. 1017 PSMA-E7766 ADC: Harnessing targeted delivery of STING agonists for anti-tumor activity in prostate cancer J. Immunother. Cancer 2024 12 (Suppl. 2) A1138 10.1136/jitc-2024-SITC2024.1017 93. Luke J.J. Pinato D.J. Juric D. LoRusso P. Hosein P.J. Desai A.M. Haddad R. de Miguel M. Cervantes A. Kim W.S. Phase I dose-escalation and pharmacodynamic study of STING agonist E7766 in advanced solid tumors J. Immunother. Cancer 2025 13 e010511 10.1136/jitc-2024-010511 39979069 PMC11842995 94. Thomlinson R.H. Gray L.H. The histological structure of some human lung cancers and the possible implications for radiotherapy Br. J. Cancer 1955 9 539 549 10.1038/bjc.1955.55 13304213 PMC2073776 95. Riese R. Luke J. Lewis K. Janku F. Piha-Paul S. Verschraegen C. Brennan A. Armstrong M. Varterasian M. Sokolovska A. 500 SYNB1891, a bacterium engineered to produce a STING agonist, demonstrates target engagement in humans following intratumoral injection J. Immunother. Cancer 2021 9 (Suppl. 2) A532 10.1136/jitc-2021-sitc2021.500 96. Jang S.C. Moniz R.J. Sia C.L. Harrison R.A. Houde D. Ross N. Xu K. Lewis N. Bourdeau R. McCoy C. Abstract 944: ExoSTING: An engineered exosome therapeutic that selectively delivers STING agonist to the tumor resident antigen-presenting cells resulting in improved tumor antigen-specific adaptive immune response Cancer Res. 2019 79 944 10.1158/1538-7445.AM2019-944 97. Kirwin K. Jang S.C. Sia C. Dooley K. Zi T. Zhang K. Liu Y. Economides K. Patel S. Sathyanaryanan S. 572 Combination therapy of exoSTING, exoIL-12 activates systemic anti-tumor immunity J. Immunother. Cancer 2021 9 (Suppl. 2) A601 10.1136/jitc-2021-SITC2021.572 98. Codiak Provides Platform-Validating Clinical Update and Data from Phase 1 Trials of exoSTING™ and exoIL-12™ Available online: https://www.biospace.com/codiak-provides-platform-validating-clinical-update-and-data-from-phase-1-trials-of-exosting-and-exoil-12 (accessed on 28 July 2025) 99. Codiak Reports Positive Initial Data for exoSTING™ Phase 1/2 Trial Indicating Tolerability, Immune Activation, and Evidence of Tumor Shrinkage in Injected and Non-Injected Tumors in the First Three Dose Escalation Cohorts Available online: https://www.biospace.com/codiak-reports-positive-initial-data-for-exosting-phase-1-2-trial-indicating-tolerability-immune-activation-and-evidence-of-tumor-shrinkage-in-injected-and-non-injected-tumors-in-the-first-three-dose-escalation-cohorts (accessed on 7 August 2025) 100. Foldi J. Piha-Paul S.A. Villaruz L.C. McArthur H.L. Olson M. Jonathan E. Ostrander B. Krishnan K. Luke J.J. A phase 1 dose-escalation and expansion study of an intratumorally administered dual STING agonist (ONM-501) alone and in combination with cemiplimab in patients with advanced solid tumors and lymphomas J. Clin. Oncol. 2024 42 TPS2693 10.1200/JCO.2024.42.16_suppl.TPS2693 101. Gao X. Lei G. Wang B. Deng Z. Karges J. Xiao H. Tan D. Encapsulation of Platinum Prodrugs into PC7A Polymeric Nanoparticles Combined with Immune Checkpoint Inhibitors for Therapeutically Enhanced Multimodal Chemotherapy and Immunotherapy by Activation of the STING Pathway Adv. Sci. 2023 10 e2205241 10.1002/advs.202205241 PMC9896041 36504435 102. Li S. Wang J. Wilhelm J. Su Q. Bharadwaj G. Miller J. Li W. Torres K. Han R. Zhao T. Abstract 4234: ONM-501: A polyvalent STING agonist for oncology immunotherapy Cancer Res. 2022 82 4234 10.1158/1538-7445.AM2022-4234 103. Chen Z. Huang G. Torres K. Stavros F. Ahmed A. Miller J. Zhao T. Gao J. Han R. Abstract LB245: ONM-501, a dual-activating polyvalent STING agonist, enhances tumor retention and demonstrates favorable preclinical safety profile Cancer Res. 2023 83 LB245 10.1158/1538-7445.AM2023-LB245 104. Chen Z. Miller J. Li W. Torres K. Su Q. Huang G. Saud O. Albaroodi Y. Morsch R. McElvaney T. 1155 ONM-501, a polyvalent STING agonist, exhibits anti-tumor efficacy with increased tumor T-cell infiltration in mice and is well tolerated in rats and non-human primates J. Immunother. Cancer 2022 10 (Suppl. 2) A1198 10.1136/jitc-2022-SITC2022.1155 105. Li S. Luo M. Wang Z. Feng Q. Wilhelm J. Wang X. Li W. Wang J. Su Q. Bharadwaj G. Abstract P049: ONM-501—A synthetic polyvalent STING agonist for cancer immunotherapy Cancer Immunol. Res. 2022 10 P049 10.1158/2326-6074.TUMIMM21-P049 106. Ager C.R. Di Francesco M.E. Jones P. Curran M.A. Abstract A050: Intratumoral delivery of a novel STING agonist synergizes with checkpoint blockade to regress multifocal pancreatic cancer Cancer Immunol. Res. 2019 7 A050 10.1158/2326-6074.CRICIMTEATIAACR18-A050 107. Huntoon K. Lee D. Lu Y. Jiang W. Curran M. Kim B.Y.S. 467 Stimulator of Interferon Genes Protein (STING) Agonist Incited Sustained Antitumor Immunity in Murine Models of Glioblastoma Neurosurgery 2023 69 98 10.1227/neu.0000000000002375_467 108. Lea S. Chen C.-H. Hartley G. Hsieh R.C.-E. Curran M. 763 Intratumoral delivery of high potency STING agonists modulates the immunosuppressive myeloid compartment and induces curative responses in checkpoint-refractory glioblastoma models J. Immunother. Cancer 2021 9 (Suppl. 2) A798 10.1136/jitc-2021-sitc2021.763 109. Lea S. Najem H. Chen C.-H. Wei J. William I. Tripathi S. Hurley L.A. Heimberger A. Curran M.A. 1018 Leveraging innate immune sensors to generate durable anti-glioma adaptive immune responses J. Immunother. Cancer 2024 12 (Suppl. 2) A1139 10.1136/jitc-2024-SITC2024.1018 110. Lea S. Wei J. Chen C.-H. William I. Curran M. 1115 A novel lioblastoma model resistant to both innate and adaptive immunotherapy J. Immunother. Cancer 2023 11 (Suppl. 1) A1228 10.1136/jitc-2023-SITC2023.1115 111. Li T. Zhang W. Niu M. Wu Y. Deng X. Zhou J. STING agonist inflames the cervical cancer immune microenvironment and overcomes anti-PD-1 therapy resistance Front. Immunol. 2024 15 1342647 10.3389/fimmu.2024.1342647 38550593 PMC10972971 112. Pan B.-S. Perera S.A. Piesvaux J.A. Presland J.P. Schroeder G.K. Cumming J.N. Trotter B.W. Altman M.D. Buevich A.V. Cash B. An orally available non-nucleotide STING agonist with antitumor activity Science 2020 369 10.1126/science.aba6098 32820094 113. Chin E.N. Yu C. Vartabedian V.F. Jia Y. Kumar M. Gamo A.M. Vernier W. Ali S.H. Kissai M. Lazar D.C. Antitumor activity of a systemic STING-activating non-nucleotide cGAMP mimetic Science 2020 369 993 999 10.1126/science.abb4255 32820126 114. Wang M. Huang X. Zhang C. Wan P. Xu T. Zhai X. Yao L. Preprint: HIF-PHI regulates the STING-TBK1-IRF3 signaling pathway and mediates macrophage polarization to alleviate renal interstitial fibrosis Res. Sq. 2024 10.21203/rs.3.rs-3933378/v1 115. Miao Z. Song X. Xu A. Yao C. Li P. Li Y. Yang T. Shen G. Targeted Delivery of STING Agonist via Albumin Nanoreactor Boosts Immunotherapeutic Efficacy against Aggressive Cancers Pharmaceutics 2024 16 1216 10.3390/pharmaceutics16091216 39339252 PMC11434985 116. Soomer-James J. Damelin M. Malli N. Abstract 4423: XMT-2056, a HER2-targeted STING agonist antibody-drug conjugate, exhibits ADCC function that synergizes with STING pathway activation and contributes to anti-tumor responses Cancer Res. 2023 83 4423 10.1158/1538-7445.AM2023-4423 117. Chen H. Sun H. You F. Sun W. Zhou X. Chen L. Yang J. Wang Y. Tang H. Guan Y. Activation of STAT6 by STING is critical for antiviral innate immunity Cell 2011 147 436 446 10.1016/j.cell.2011.09.022 22000020 118. Nie C. Ma T. Ye J. He M. Zhang T. Wei K. Jiang J. Chu X. A STING agonist-loaded bispecific nanobioconjugate modulates macrophage immune responses to enhance antitumor immunotherapy Chem. Eng. J. 2024 485 149901 10.1016/j.cej.2024.149901 119. Smith M. Chin D. Chan S. Mahady S. Campion L. Morgan C. Patel S. Chu G. Hughes A. Bignan G. Abstract 5567: In vivo administration of the STING agonist, JNJ-67544412, leads to complete regression of established murine subcutaneous tumors Cancer Res. 2020 80 5567 10.1158/1538-7445.AM2020-5567 120. Appleman V. Matsuda A. Ganno M. Lopez A.M. Rosentrater E. Christensen C. Merrigan S. Lee H.M. Lee M.Y. Dong L. 1153 Preclinical activity of C-C chemokine receptor 2 (CCR2)-targeted immune stimulating antibody conjugate (ISAC), motivating clinical testing of TAK-500 J. Immunother. Cancer 2022 10 A1196 10.1136/jitc-2022-SITC2022.1153 121. Schalper K.A. Matsuda A. Ganno-Sherwood M. Maldonado-Lopez A.E. Rosentrater E. Porciuncula A. Zhang D.M. Christensen C.L. Merrigan S.A. Hatten T. Abstract 1841: TAK-500 is a clinical stage immune-cell directed antibody drug conjugate (iADC) inducing STING activation in CCR2-expressing intratumor myeloid cells and favorable immunomodulation Cancer Res. 2023 83 1841 10.1158/1538-7445.AM2023-1841 122. Koshy S.T. Cheung A.S. Gu L. Graveline A.R. Mooney D.J. Liposomal Delivery Enhances Immune Activation by STING Agonists for Cancer Immunotherapy Adv. Biosyst. 2017 1 1600013 10.1002/adbi.201600013 30258983 PMC6152940 123. Martin G.R. Salazar Arcila C. Hallihan L.J. Scheidl-Yee T. Jirik F.R. Inducible generalized activation of hSTING-N154S expression in mice leads to lethal hypercytokinemia: A model for “cytokine storm” J. Leukoc. Biol. 2023 113 326 333 10.1093/jleuko/qiac019 36861228 124. Barber G.N. STING: Infection, inflammation and cancer Nat. Rev. Immunol. 2015 15 760 770 10.1038/nri3921 26603901 PMC5004891 125. Gehrcken L. Deben C. Smits E. Van Audenaerde J.R.M. STING Agonists and How to Reach Their Full Potential in Cancer Immunotherapy Adv. Sci. (Weinh) 2025 12 e2500296 10.1002/advs.202500296 40145387 PMC12061341 126. Shen A. Li X. Zhang Y. Ma J. Xiao R. Wang X. Song Z. Liu Z. Geng M. Zhang A. Structure-Activity relationship study of benzothiophene oxobutanoic acid analogues leading to novel stimulator of interferon gene (STING) agonists Eur. J. Med. Chem. 2022 241 114627 10.1016/j.ejmech.2022.114627 35963129 127. Li L. Yin Q. Kuss P. Maliga Z. Millán J.L. Wu H. Mitchison T.J. Hydrolysis of 2′3′-cGAMP by ENPP1 and design of nonhydrolyzable analogs Nat. Chem. Biol. 2014 10 1043 1048 10.1038/nchembio.1661 25344812 PMC4232468 128. Cheng N. Watkins-Schulz R. Junkins R.D. David C.N. Johnson B.M. Montgomery S.A. Peine K.J. Darr D.B. Yuan H. McKinnon K.P. A nanoparticle-incorporated STING activator enhances antitumor immunity in PD-L1-insensitive models of triple-negative breast cancer JCI Insight 2018 3 e120638 10.1172/jci.insight.120638 30429378 PMC6302949 129. Dosta P. Cryer A.M. Dion M.Z. Shiraishi T. Langston S.P. Lok D. Wang J. Harrison S. Hatten T. Ganno M.L. Investigation of the enhanced antitumour potency of STING agonist after conjugation to polymer nanoparticles Nat. Nanotechnol. 2023 18 1351 1363 10.1038/s41565-023-01447-7 37443252 130. Su T. Cheng F. Qi J. Zhang Y. Zhou S. Mei L. Fu S. Zhang F. Lin S. Zhu G. Responsive Multivesicular Polymeric Nanovaccines that Codeliver STING Agonists and Neoantigens for Combination Tumor Immunotherapy Adv. Sci. (Weinh) 2022 9 e2201895 10.1002/advs.202201895 35712773 PMC9376841 131. Lu X. Miao L. Gao W. Chen Z. McHugh K.J. Sun Y. Tochka Z. Tomasic S. Sadtler K. Hyacinthe A. Engineered PLGA microparticles for long-term, pulsatile release of STING agonist for cancer immunotherapy Sci. Transl. Med. 2020 12 eaaz6606 10.1126/scitranslmed.aaz6606 32801144 PMC9019818 132. Chen X. Meng F. Xu Y. Li T. Chen X. Wang H. Chemically programmed STING-activating nano-liposomal vesicles improve anticancer immunity Nat. Commun. 2023 14 4584 10.1038/s41467-023-40312-y 37524727 PMC10390568 133. Hussain Z. Gou S. Liu X. Li M. Zhang H. Ren S. Han R. Liu F. Zhou X. Qiu L. Enhancing tumor immunotherapy with smart nanoparticles for reprogramming macrophages and blocking the CD47/Sirpalpha pathway Mater. Today Bio 2025 32 101826 10.1016/j.mtbio.2025.101826 PMC12144523 40487182 134. Wang F. Su H. Xu D. Dai W. Zhang W. Wang Z. Anderson C.F. Zheng M. Oh R. Wan F. Tumour sensitization via the extended intratumoural release of a STING agonist and camptothecin from a self-assembled hydrogel Nat. Biomed. Eng. 2020 4 1090 1101 10.1038/s41551-020-0597-7 32778697 PMC8848303 135. Delitto D. Zabransky D.J. Chen F. Thompson E.D. Zimmerman J.W. Armstrong T.D. Leatherman J.M. Suri R. Lopez-Vidal T.Y. Huff A.L. Implantation of a neoantigen-targeted hydrogel vaccine prevents recurrence of pancreatic adenocarcinoma after incomplete resection Oncoimmunology 2021 10 2001159 10.1080/2162402X.2021.2001159 34777919 PMC8583296 136. Wang J. Falchook G. Nabhan S. Kulkarni M. Sandy P. Dosunmu O. Gardner H. Bendell J. Johnson M. 495 Trial of SNX281, a systemically delivered small molecule STING agonist, in solid tumors and lymphomas J. Immunother. Cancer 2021 9 (Suppl. 2) A527 10.1136/jitc-2021-SITC2021.495 Figure 1 Overview of the STING signaling pathway in macrophages. Double stranded DNA (dsDNA) from endogenous or exogenous sources enters the cytoplasm and is detected by cyclic GMP-AMP synthase (cGAS). Upon activation, cGAS dimerizes and synthesizes the second messenger, cyclic GMP-AMP (cGAMP), which binds to endoplasmic reticulum (ER)-associated STING. STING undergoes dimerization and translocates to ER-Golgi intermediate compartments, where it recruits TANK binding kinase 1 (TBK1). TBK1 phosphorylates both STING and itself, creating a scaffold for the recruitment of downstream signaling molecules. TBK1 subsequently phosphorylates and activates IκB kinase (IKK), which in turn phosphorylates IκB, leading to the activation of the transcription factor nuclear factor kappa B (NF-κB). Additionally, TBK1 phosphorylates interferon regulatory factor 3 (IRF3), promoting its dimerization. Both IRF3 and NF-κB then translocate into the nucleus, where they induce the expression of pro-inflammatory cytokines and type 1 interferons (IFN-1). Furthermore, TBK1 can induce the activation of the NLRP3 (NOD-like receptor family, pyrin domain-containing-3) and AIM2 (absent in melanoma-2) inflammasomes. Created in BioRender. Binder, A.K. (2025) https://BioRender.com/t7f2r0a Figure 2 Overview of STING agonists in preclinical and clinical (*) evaluations as cancer treatment. Activating agonists are coded in green, inhibitory agonists in orange. Indirect STING activators like TREX1 inhibitors, Oxaliplatin, ENPP1 inhibitors, Manganese (Mn 2+ https://BioRender.com/7y3180x ijms-26-09008-t001_Table 1 Table 1 STING agonists in clinical trials for cancer therapy. Agent 1 Route 2 Phase SAE in Clinical Trials 3 Type of 4 NTC Code Start Status/Completion 5  IMSA101 (GB492) Mono- IT 1/2a Asthenia (5%), Acute respiratory failure (2.5%), Sepsis (2.5%), Pneumonia (2.5%), Angina pectoris (2.4%), Hepatorenal syndrome (2.4%) Advanced solid tumors NCT 04020185 23.09.2019 Completed 15.09.2023 +PULSAR-ICI IT 2 NSCLC or renal cell carcinoma NCT 05846646 28.06.2023 Terminated 16.09.2024 +PULSAR-ICI IT 2 Solid tumors NCT 05846659 07.07.2023 Terminated 20.11.2024 +PULSAR IT 2 Renal cell carcinoma NCT 06601296 01.04.2025 Recruiting +ICI IT 1 Advanced solid tumors NCT 06026254 15.09.2023 Ongoing  ADU-S100 (MIW 815) Mono- IT 1 CRS (6.2%), Localized oedema (6.2%), Colitis (6.2%), Sepsis (6.2%), Acute kidney injury (6.2%), Pneumonia aspiration (6.2%) Advanced/ NCT 02675439 28.04.2016 Terminated 06.08.2020 +PDR001 IT 1 Solid tumors and lymphomas NCT 03172936 08.09.2017 Terminated 18.12.2020 +Pembrolizumab IT 2 Head and neck cancers NCT 03937141 28.08.2019 Terminated 10.06.2021  SB 11285 Mono- IV 1 n/a Advanced solid tumors NCT 04096638 23.09.2019 Completed 16.07.2024  TAK-676 (Dazo-stinag) Mono- IT Early 1 n/a SCCHN NCT 06062602 26.07.2021 Completed 15.11.2022 +Pembrolizumab after Radiotherapy IV 1 NSCLC, TNBC or SCCHN NCT 04879849 09.09.2021 Completed 30.04.2024 Mono- IV 1/2 Advanced/ NCT 04420884 22.07.2020 Recruiting  E7766 Mono- IT 1/1b Upper gastrointestinal hemorrhage (4.2%), Vomiting (4.2%), Localized oedema (4.2%), Cerebral venous sinus thrombosis (4.2%), Hypertension (4.2%), Hypotension (4.2%) Advanced solid NCT 04144140 24.02.2020 Terminated 26.07.2022 Mono- Intra-vesical 1/1b Non-muscle NCT 04109092 13.02.2020 Withdrawn 29.09.2022  SYNB1891 Mono- IV, IT 1 CRS (15.6%), Sepsis (3.1%), Tracheal hemorrhage (3.1%), Transient ischaemic attack (3.1%), Hypoxia (3.1%), Pulmonary embolism (3.1%) Advanced/ NCT 04167137 12.12.2019 Terminated 09.12.2021  CDK-002 (exo-STING) Mono- IT 1/2 Grade 2 CRS (8.7%), Grade 1 pyrexia (4.4%) Advanced/ NCT 04592484 15.09.2020 Completed 23.12.2022  ONM-501 Mono- IT 1 n/a Advanced solid tumors or lymphomas NCT 06022029 13.10.2023 Recruiting 1 2 3 4 5 ijms-26-09008-t002_Table 2 Table 2 STING agonist mediated effects on cellular composition within the TME.  CD8 + NK Cells M1-like M2-like DCs T H B Cells Tregs  IMSA101 (GB492) ↑ ↑ ↑ - - - - -  ADU-S100 (MIW 815) ↑ - ↑ ↓ ↑ - - -  SB 11285 ↑ ↑ ↑ - - - - ↓  TAK-676 (Dazostinag) ↑ ↑ ↑ - - - - -  E7766 ↑ ↑ ↑ ↓ ↑ - ↑ -  SYNB1891 ↑ - - - - -  -  CDK-002 (exoSTING) - - ↑ ↓ - ↑ - -  ONM-501 ↑ ↑ ↑ - - - - -  IACS-8803/ IMGS-203 ↑ ↑ ↑ ↓ ↑ - - -  MSA-2 ↑ ↑ ↑ - - - - -  SR-717 ↑ ↑ ↑ - - - - - ↑ and green shading: upregulation; ↓ and red shading: downregulation. ijms-26-09008-t003_Table 3 Table 3 STING agonist mediated effects on soluble components within the TME.  IFNα IFNβ IFNγ TNFα IL-6 IL-1β IL-18 CXCL10 GM-CSF TGFβ IL-10  IMSA101 (GB492) - - - - - - ↑ - - ↓ ↓  ADU-S100 (MIW 815)  ↑ ↑  ↑   ↑     SB 11285 ↑ ↑ - ↑ - - - - - - -  TAK-676 (Dazostinag) ↑ - ↑ ↑ ↑ - - ↑ - - -  E7766 - ↑ - ↑ ↑ - - ↑ - - -  SYNB1891 ↑ ↑ ↑ ↑ ↑ ↑ - - ↑ - -  CDK-002 (exoSTING) - ↑ - - - - - ↑ - - -  ONM-501 - ↑ - - - - - ↑ - - -  IACS-8803/ IMGS-203 - - - - ↑ - - - - ↓ -  MSA-2 - ↑ - ↑ ↑ - - ↑ - - -  SR-717 - ↑ - ↑ ↑ - - ↑ - - - ↑ and green shading: upregulation; ↓ and red shading: downregulation. ",
  "metadata": {
    "Title of this paper": "495 Trial of SNX281, a systemically delivered small molecule STING agonist, in solid tumors and lymphomas",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470042/"
  }
}