{
  "title": "Paper_682",
  "abstract": "pmc J Med Cases J Med Cases 4087 jmedcas Elmer Press Journal of Medical Cases 1923-4155 1923-4163 Elmer Press PMC12479074 PMC12479074.1 12479074 12479074 41030491 10.14740/jmc5163 1 Case Report Acute Hepatitis in a Patient Treated With Ribociclib for Metastatic Breast Carcinoma Ribociclib Induced Liver Injury Iguh Chika a b Bakhsh Iqra a Grujic Sava a a b chikaiguh12@gmail.com 9 2025 17 9 2025 16 9 497815 372 380 2 7 2025 5 9 2025 17 09 2025 30 09 2025 01 10 2025 Copyright 2025 Authors. 2025 https://creativecommons.org/licenses/by-nc/4.0/ This article is distributed under the terms of the Creative Commons Attribution Non-Commercial 4.0 International License, which permits unrestricted non-commercial use, distribution, and reproduction in any medium, provided the original work is properly cited. Ribociclib, a cyclin-dependent kinase 4/6 (CDK4/6) inhibitor, is widely used in the treatment of hormone receptor-positive (HR+), human epidermal growth factor receptor 2 (HER2)-negative metastatic breast cancer. Although hepatotoxicity is a recognized adverse effect, severe cases of ribociclib-induced liver injury with histologic confirmation of submassive hepatic necrosis remain rare. We describe a case of a postmenopausal woman with newly diagnosed stage IV HR+/HER2-negative invasive lobular carcinoma who developed acute hepatocellular injury 8 weeks after initiating ribociclib and anastrozole. The patient presented with fatigue, jaundice, and dark urine, and was found to have markedly elevated transaminases (alanine aminotransferase 1,825 U/L; aspartate aminotransferase 1,536 U/L) and hyperbilirubinemia. A thorough workup excluded viral, autoimmune, and obstructive hepatobiliary causes. Liver biopsy demonstrated confluent centrilobular necrosis without fibrosis or significant inflammation. Causality assessments yielded an R-factor of 20.73, a Roussel Uclaf Causality Assessment Method score of 10 (highly probable), and a Naranjo score of 7 (probable). Ribociclib was discontinued and intravenous N-acetylcysteine (NAC) initiated, leading to gradual normalization of liver enzymes. The patient was maintained on anastrozole alone, with no recurrence of liver injury and stable disease at 13-month follow-up. This case highlights the potential for ribociclib to induce severe hepatocellular injury with histologic evidence of submassive necrosis. Early recognition and structured causality assessment ensures patient safety. In patients with significant hepatotoxicity, discontinuation of ribociclib and non-rechallenge may be prudent. Furthermore, consideration of NAC in management is important in cases demonstrating persistent transaminitis despite ribociclib discontinuation. Ribociclib Drug-induced liver injury Hepatotoxicity Cyclin-dependent kinase 4 and 6 inhibitors Breast neoplasms Lobular carcinoma N-acetylcysteine Liver biopsy None to declare. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Ribociclib, a selective cyclin-dependent kinase 4/6 (CDK4/6) inhibitor, has emerged as a cornerstone therapy in the management of hormone receptor-positive (HR+), human epidermal growth factor receptor 2 (HER2)-negative metastatic breast cancer. By inhibiting the cyclin D-CDK4/6-Rb axis, ribociclib arrests tumor cell proliferation at the G1-to-S phase transition, significantly improving progression-free survival when combined with endocrine therapy, as demonstrated in the MONALEESA clinical trials [ 1 3 1 3 Among the CDK4/6 inhibitors, ribociclib carries a relatively higher risk of hepatic injury, with grade 3-4 alanine aminotransferase (ALT) elevations reported in up to 9.3% of patients and aspartate aminotransferase (AST) elevations in up to 6.5%, typically arising within the first three treatment cycles [ 1 3 We present a case of ribociclib-induced hepatocellular injury manifesting as acute hepatitis with histologically confirmed confluent centrilobular necrosis. This case contributes to the growing body of literature documenting severe hepatotoxicity associated with ribociclib and emphasizes the value of integrating structured causality assessment tools, such as the R-factor, Roussel Uclaf Causality Assessment Method (RUCAM) score, and Naranjo algorithm, with histopathologic correlation to support diagnosis and guide management. Case Report Clinical presentation, imaging, and pathologic workup A postmenopausal woman with a history of diabetes mellitus, hypothyroidism, hypertension, major depression, and osteoarthritis presented to our hospital in January 2024 following a fall, with complaints of acute onset dyspnea and 6 months of progressive left-sided rib pain which she initially attributed to musculoskeletal causes. Chest X-ray showed multiple rib fractures with deformities and bilateral lower lobe opacities. A computed tomography (CT) scan of the abdomen and pelvis ( Fig. 1a, b Figure 1 CT of the abdomen and pelvis. (a) Axial view demonstrating prominent osteolytic neoplastic lesions within the pelvis (arrows). (b) Coronal view demonstrating prominent osteolytic neoplastic lesions within the spine (arrows). CT: computed tomography. A right iliac bone biopsy was performed with histology demonstrating metastatic carcinoma ( Fig. 2a Fig. 2b Fig. 2c Fig. 2d Fig. 2e Fig. 2f Figure 2 Invasive lobular breast carcinoma. (a) Right iliac bone lesion showing metastatic carcinoma (asterisk) (H&E stain, original magnification, × 100). (b) Strong positive immunostaining for CK7 in the metastatic neoplastic cells (arrow) (immunohistochemistry, original magnification, × 200). (c) Focal positive immunostaining for GATA3 in the metastatic neoplastic cells (arrow) (immunohistochemistry, original magnification, × 200). (d) Focal positive immunostaining for mammaglobin in the metastatic neoplastic cells (arrow) (immunohistochemistry, original magnification, × 200). (e) Strong positive immunostaining for GCDFP-15 in the metastatic neoplastic cells (arrow) (immunohistochemistry, original magnification, × 200). (f) Breast mass biopsy showing invasive lobular carcinoma, grade 2 (arrow) (H&E stain, original magnification, × 400). H&E: hematoxylin and eosin. The patient was officially diagnosed with stage IV HR+, HER2-negative ILC with diffuse osseous metastases. Baseline liver function tests (LFTs) were within normal limits. She had no history of liver disease, alcohol use, or recent medication changes. Eastern Cooperative Oncology Group (ECOG) performance status was 1 at presentation. Treatment course and adverse effects Ribociclib (600 mg daily for 21 days followed by a 7-day drug holiday) combined with anastrozole (1 mg daily) was initiated approximately 2 weeks after diagnosis. Concurrent medications included insulin, losartan, amlodipine, and sertraline. Approximately 4 weeks into treatment, the patient was hospitalized for acute decompensated heart failure and significant bilateral lower extremity edema. Due to uncertainty of whether this exacerbation was attributed to ribociclib (given a known 12-15% risk of peripheral edema) versus another medication (such as amlodipine or anastrozole), the dose of ribociclib was reduced to 200 mg daily for 21 days, followed by 7 days off. Approximately 8 weeks into treatment, following two cycles of ribociclib, the patient developed progressive fatigue, jaundice, and dark urine. Laboratory evaluation revealed grade 3 transaminitis (ALT 1,825 U/L, AST 1,536 U/L), alkaline phosphatase (ALP) 278 U/L, total bilirubin 18.1 mg/dL, direct bilirubin 5.1 mg/dL, international normalized ratio (INR) 1.4, and albumin 2.1 g/dL ( Fig. 3 Fig. 3 Fig. 3 Figure 3 Course of liver enzyme and bilirubin elevation and declination in relation to ribociclib administration, discontinuation, and NAC treatment. NAC: N-acetylcysteine. Right upper quadrant ultrasound revealed hepatomegaly and a mildly echogenic liver with some areas of mild surface nodularity, suggestive of steatotic liver disease or fibrofatty cirrhosis. Comprehensive workup ruled out viral hepatitis (hepatitis A, B, C, E, cytomegalovirus (CMV), Epstein-Barr virus (EBV)) and autoimmune hepatitis. Imaging, including MRI and magnetic resonance cholangiopancreatography (MRCP), excluded biliary obstruction. Liver biopsy Liver biopsy revealed confluent zonal centrilobular hepatocyte necrosis without significant inflammatory infiltrate, favoring DILI ( Fig. 4a-c Fig. 4d Fig. 4e Figure 4 Liver biopsy histology. (a) Centrilobular confluent hepatocyte necrosis (asterisk) with mild lymphocytic portal and lobular inflammation (H&E stain, original magnification, × 100). (b) Higher magnification of extensive centrilobular confluent hepatocyte necrosis (arrow) (H&E stain, original magnification, × 200). (c) Individual necrosis (arrows highlighting apoptotic hepatocytes) (H&E stain, original magnification, × 400). (d) Trichrome special stain demonstrating collapsed reticulin fibers (arrows) due to hepatocyte necrosis, it is negative for fibrosis (special stain, original magnification, × 400). (e) Reticulin special stain demonstrating significant hepatic parenchyma collapse (special stain, original magnification, × 400). H&E: hematoxylin and eosin. Causality assessment Causality assessment tools were employed to support the diagnosis of ribociclib-induced liver injury. An R-factor of 20.73 indicated a hepatocellular pattern of liver injury (R ≥ 5) ( Table 1 Table 1 Table 1 Table 1 Causality Assessment Tools Applied to Ribociclib-Induced Liver Injury Assessment tool Purpose Input criteria Patient-specific results Interpretation Case relevance R-factor Classify type of liver injury (hepatocellular vs. cholestatic vs. mixed) R = (ALT ÷ ALT ULN) ÷ (ALP ÷ ALP ULN); ALT = 1,825 U/L (ULN = 40), ALP = 278 U/L (ULN = 120) R = (1,825/40) ÷ (278/120) = 20.73 Hepatocellular injury (R ≥ 5) Confirms hepatocellular pattern, consistent with biopsy findings RUCAM score Estimate likelihood of drug causality in DILI Temporal relationship, risk factors, exclusion of alternative causes, dechallenge, known hepatotoxicity, rechallenge Components (approx): +2 (onset); +3 (dechallenge); +2 (no alt causes); +2 (known hepatotoxin); +1 (female); Total: ∼ 10 Highly probable (≥ 9) Strongly supports ribociclib as cause of liver injury Naranjo algorithm General tool to estimate probability of ADR Includes timing, prior reports, dechallenge, rechallenge, alternative causes Components (approx): +2 (timing); +1 (dechallenge); +1 (prior reports); +2 (no alt cause); +1 (biopsy); Total: ∼ 7 Probable ADR (5 - 8) Supports ribociclib as likely cause of DILI ADR: adverse drug reaction; ALT: alanine aminotransferase; AST: aspartate aminotransferase; DILI: drug-induced liver injury; RUCAM: Roussel Uclaf Causality Assessment Method; ULN: upper limit of normal. Follow-up Given the severity of ribociclib-induced DILI, rechallenge with another CDK4/6 inhibitor was deemed unsafe. Instead, the patient’s treatment was continued with anastrozole monotherapy. Follow-up imaging demonstrated stable disease, and no further hepatic complications were reported. Regular monitoring of liver function and imaging is ongoing with no disease progression 13 months following diagnosis. Discussion In the present case, we report a postmenopausal woman with HR-positive/HER2-negative metastatic ILC who developed severe hepatocellular DILI 8 weeks after starting ribociclib with anastrozole. The case is notable for biopsy-confirmed submassive, zone-3-predominant confluent necrosis - an infrequently reported pattern in ribociclib hepatotoxicity - and for improvement in liver tests after intravenous N-acetylcysteine (NAC) despite initial worsening after drug withdrawal. Ribociclib, a selective CDK4/6 inhibitor, plays a pivotal role in managing HR-positive, HER2-negative advanced breast cancer by targeting the cyclin D-CDK4/6-Rb axis, halting tumor proliferation through inhibition of the G1-to-S phase cell cycle transition [ 4 5 6 7 1 3 8 10 11 12 In the current case, ALT/AST values peaked at 1,967/1,621 U/L, and liver biopsy demonstrated significant parenchymal confluent necrosis. At the time of writing, the current case represents one of very few reports showing submassive hepatocyte necrosis secondary to ribociclib. Schaeffer et al documented a similar pattern of injury in a 41-year-old female whose liver biopsy revealed 30% parenchymal necrosis, predominantly in zone III, along with moderate lymphohistiocytic inflammation and mild cholestasis [ 13 13 14 To substantiate attribution of DILI to ribociclib, we applied structured causality tools - R-factor, RUCAM, and Naranjo - in conjunction with histopathologic correlation. The RUCAM score, developed by Danan and Benichou in 1993, is the most widely validated and liver-specific tool for assessing DILI causality [ 15 15 16 17 18 19 The pathophysiology underlying ribociclib-induced hepatotoxicity is presumed to be multifaceted. One of the proposed mechanisms of ribociclib-induced liver injury is the formation of reactive metabolites during hepatic metabolism, which can cause oxidative stress and hepatocellular damage [ 20 20 13 21 22 23 23 Another factor that exacerbates hepatotoxicity is drug-drug interactions via cytochrome P450 3A4 (CYP3A4) metabolism. Since ribociclib is predominantly metabolized by CYP3A4, co-administration with CYP3A4 inhibitors (such as azole antifungals or macrolides) can significantly increase its plasma concentration, thereby exacerbating hepatotoxicity [ 24 25 6 7 Immune-mediated hepatic injury has also been implicated in ribociclib-associated hepatotoxicity. Some cases exhibit autoimmune-like features, such as the presence of antinuclear antibodies (ANA) and anti-mitochondrial antibodies [ 14 14 21 Effective management of ribociclib-DILI requires early detection, appropriate dose modifications, pharmacological interventions, and a multidisciplinary approach to minimize risks and optimize therapeutic outcomes. Baseline LFTs should be obtained before initiating treatment, with continued monitoring every 2 weeks during the first two cycles, monthly for the next two cycles, and then as clinically indicated [ 6 7 6 7 6 7 6 7 14 Pharmacological interventions can be considered in cases where liver enzyme elevations persist or when severe hepatotoxicity occurs. Corticosteroids, such as prednisone (0.5 - 1 mg/kg daily, tapered over 4 - 8 weeks), are often used for cases exhibiting autoimmune-like features or significant hepatic inflammation [ 14 21 26 14 Minimizing hepatotoxic risk also involves avoiding drug interactions and addressing underlying risk factors. As ribociclib is metabolized by the CYP3A4 enzyme, co-administration with known CYP3A4 inhibitors (e.g., ketoconazole, ritonavir) is particularly problematic, as they can increase drug accumulation and elevate toxicity risk [ 6 7 23 14 Additionally, rechallenge and switching to alternative CDK4/6 inhibitors may be considered. If liver enzyme elevations resolve, ribociclib may be reintroduced at a reduced dose (200 mg or 400 mg daily), with close monitoring to prevent recurrence [ 27 21 27 27 A multidisciplinary approach, ultimately, is essential for optimizing patient outcomes. Collaboration between oncologists, hepatologists, and pathologists is critical in effectively managing ribociclib-induced hepatotoxicity. Patient education also plays a pivotal role, as individuals should be advised to report symptoms of liver dysfunction, such as jaundice, dark urine, nausea, or fatigue, immediately. Furthermore, patients must be encouraged to adhere to routine LFT monitoring and follow recommended dose modifications to prevent severe hepatotoxicity [ 7 Conclusions Ribociclib-induced hepatotoxicity is a manageable but clinically significant adverse effect in individuals with HR-positive, HER2-negative metastatic breast cancer. Few reports, including the present case, show potential for submassive liver necrosis. Through routine monitoring, timely dose adjustments, pharmacological interventions, and individualized treatment strategies, the risk of liver toxicity can be minimized while maintaining therapeutic efficacy. For patients experiencing hepatotoxicity, treatment decisions should be tailored to the severity of liver enzyme elevations, with options including dose reduction, temporary discontinuation, or transitioning to an alternative CDK4/6 inhibitor. Furthermore, the addition of hepatoprotective agents such as corticosteroid therapy and NAC supplementation may be necessary in cases with persistent worsening of LFTs following ribociclib discontinuation. Learning points Ribociclib can cause severe hepatocellular DILI with zone-3 confluent necrosis. In grade 3-4 hepatocellular injury, permanent discontinuation and non-rechallenge may be prudent. Intravenous NAC may aid recovery when enzymes worsen after drug withdrawal. Close LFT monitoring in the first 2 - 3 cycles and review for CYP3A modulators/drug-drug interactions are critical. Structured causality (R-factor, RUCAM, Naranjo) plus biopsy improves diagnostic certainty and reporting consistency in DILI. None to declare. Conflict of Interest None to declare. Informed Consent This manuscript is considered de-identified per the HIPAA Privacy Rule, therefore not requiring the patient’s consent. Author Contributions All authors contributed to the final manuscript. CI wrote the main text under the supervision of SG. SG, CI, and IB were involved with final pathological diagnosis, pathologic descriptions, and manuscript revisions. Data Availability The authors declare that data supporting the findings of this study are available within the article. References 1 Hortobagyi GN Stemmer SM Burris HA Yap YS Sonke GS Paluch-Shimon S Campone M et al Updated results from MONALEESA-2, a phase III trial of first-line ribociclib plus letrozole versus placebo plus letrozole in hormone receptor-positive, HER2-negative advanced breast cancer Ann Oncol 2018 29 7 1541 1547 10.1093/annonc/mdy155 29718092 2 Slamon DJ Neven P Chia S Fasching PA De Laurentiis M Im SA Petrakova K et al Phase III randomized study of ribociclib and fulvestrant in hormone receptor-positive, human epidermal growth factor receptor 2-negative advanced breast cancer: MONALEESA-3 J Clin Oncol 2018 36 24 2465 2472 10.1200/JCO.2018.78.9909 29860922 3 Lu YS Im SA Colleoni M Franke F Bardia A Cardoso F Harbeck N et al Updated overall survival of ribociclib plus endocrine therapy versus endocrine therapy alone in pre- and perimenopausal patients with HR+/HER2- advanced breast cancer in MONALEESA-7: a phase III randomized clinical trial Clin Cancer Res 2022 28 5 851 859 10.1158/1078-0432.CCR-21-3032 34965945 PMC9377723 4 Hamilton E Infante JR Targeting CDK4/6 in patients with cancer Cancer Treat Rev 2016 45 129 138 10.1016/j.ctrv.2016.03.002 27017286 5 O'Leary B Finn RS Turner NC Treating cancer with selective CDK4/6 inhibitors Nat Rev Clin Oncol 2016 13 7 417 430 10.1038/nrclinonc.2016.26 27030077 6 Cazzaniga ME Danesi R Girmenia C Invernizzi P Elvevi A Uguccioni M Amaducci L et al Management of toxicities associated with targeted therapies for HR-positive metastatic breast cancer: a multidisciplinary approach is the key to success Breast Cancer Res Treat 2019 176 3 483 494 10.1007/s10549-019-05261-5 31065872 PMC6586706 7 Cazzaniga ME Ciaccio A Danesi R Duhoux FP Girmenia C Zaman K Lindman H et al Late onset toxicities associated with the use of CDK 4/6 inhibitors in hormone receptor positive (HR+), human epidermal growth factor receptor-2 negative (HER2-) metastatic breast cancer patients: a multidisciplinary, pan-EU position paper regarding their optimal management. The GIOCONDA project Front Oncol 2023 13 1247270 10.3389/fonc.2023.1247270 37954071 PMC10639170 8 Goetz MP Toi M Campone M Sohn J Paluch-Shimon S Huober J Park IH et al MONARCH 3: abemaciclib as initial therapy for advanced breast cancer J Clin Oncol 2017 35 32 3638 3646 10.1200/JCO.2017.75.6155 28968163 9 Finn RS Martin M Rugo HS Jones S Im SA Gelmon K Harbeck N et al Palbociclib and Letrozole in Advanced Breast Cancer N Engl J Med 2016 375 20 1925 1936 10.1056/NEJMoa1607303 27959613 10 Turner NC Slamon DJ Ro J Bondarenko I Im SA Masuda N Colleoni M et al Overall survival with palbociclib and fulvestrant in advanced breast cancer N Engl J Med 2018 379 20 1926 1936 10.1056/NEJMoa1810527 30345905 11 Buller W Pallan L Chu T Khoja L CDK4/6 inhibitors in metastatic breast cancer, a comparison of toxicity and efficacy across agents in a real-world dataset J Oncol Pharm Pract 2023 29 8 1825 1835 10.1177/10781552231163121 36945886 12 Abdel-Razeq H Sharaf B Khater S Baidoun HJ Bani Hani H Taqash A El Khatib O et al Clinical outcomes of patients treated with ribociclib in combination with aromatase inhibitors or fulvestrant for HR-positive, HER2-negative metastatic breast cancer, real-world data from a low-resourced country Immunotargets Ther 2024 13 501 512 10.2147/ITT.S479153 39364228 PMC11448467 13 Schaeffer S Lutz C Dobbie M Terracciano LM Matter M Vosbeck J Heim MH et al Ribociclib-induced liver injury: a case report Front Oncol 2023 13 1256783 10.3389/fonc.2023.1256783 38107071 PMC10722253 14 Meunier L De Martin E Delire B Jacot W Guiu S Zahhaf A Larrey D et al CDK4/6 inhibitor-induced liver injury: Clinical phenotypes and role of corticosteroid treatment JHEP Rep 2024 6 7 101098 10.1016/j.jhepr.2024.101098 38961854 PMC11220524 15 Danan G Benichou C Causality assessment of adverse reactions to drugs—I. A novel method based on the conclusions of international consensus meetings: application to drug-induced liver injuries J Clin Epidemiol 1993 46 11 1323 1330 10.1016/0895-4356(93)90101-6 8229110 16 Danan G Teschke R RUCAM in drug and herb induced liver injury: the update Int J Mol Sci 2015 17 1 10.3390/ijms17010014 26712744 PMC4730261 17 Kleiner DE Chalasani NP Lee WM Fontana RJ Bonkovsky HL Watkins PB Hayashi PH et al Hepatic histological findings in suspected drug-induced liver injury: systematic evaluation and clinical associations Hepatology 2014 59 2 661 670 10.1002/hep.26709 24037963 PMC3946736 18 Andrade RJ Lucena MI Fernandez MC Pelaez G Pachkoria K Garcia-Ruiz E Garcia-Munoz B et al Drug-induced liver injury: an analysis of 461 incidences submitted to the Spanish registry over a 10-year period Gastroenterology 2005 129 2 512 521 10.1016/j.gastro.2005.05.006 16083708 19 Naranjo CA Busto U Sellers EM Sandor P Ruiz I Roberts EA Janecek E et al A method for estimating the probability of adverse drug reactions Clin Pharmacol Ther 1981 30 2 239 245 10.1038/clpt.1981.154 7249508 20 Alsubi TA Attwa MW Bakheit AH Darwish HW Abuelizz HA Kadi AA Correction: In silico and in vitro metabolism of ribociclib: a mass spectrometric approach to bioactivation pathway elucidation and metabolite profiling RSC Adv 2020 10 40 23930 10.1039/d0ra90070b 35532509 PMC9055114 21 Finnsdottir S Sverrisdottir A Bjornsson ES Hepatotoxicity associated with ribociclib among breast cancer patients Acta Oncol 2021 60 2 195 198 10.1080/0284186X.2020.1853228 33272079 22 Sozer Karadagli S Gursoy P Liver toxicity with ribociclib in a patient with metastatic hormone receptor positive postmenopausal breast cancer J Oncol Pharm Pract 2024 30 2 404 407 10.1177/10781552231208390 37899576 23 She Y Guo Z Zhai Q Liu J Du Q Zhang Z CDK4/6 inhibitors in drug-induced liver injury: a pharmacovigilance study of the FAERS database and analysis of the drug-gene interaction network Front Pharmacol 2024 15 1378090 10.3389/fphar.2024.1378090 38633610 PMC11021785 24 Braal CL Jongbloed EM Wilting SM Mathijssen RHJ Koolen SLW Jager A Inhibiting CDK4/6 in Breast Cancer with Palbociclib, Ribociclib, and Abemaciclib: Similarities and Differences Drugs 2021 81 3 317 331 10.1007/s40265-020-01461-2 33369721 PMC7952354 25 Schlam I Smith DM Peer C Sissung T Schmidt KT Tan M Chitalia A et al Pharmacokinetics and pharmacogenomics of ribociclib in black patients with metastatic breast cancer the LEANORA study NPJ Breast Cancer 2024 10 1 84 10.1038/s41523-024-00692-w 39349477 PMC11442496 26 Hyppolite JJ Hilzenrat N Palbociclib-induced severe hepatitis: A case study and literature review Can Liver J 2021 4 4 433 437 10.3138/canlivj-2021-0015 35989889 PMC9235127 27 Farhat F Tarabaih M Kanj A Aoun M Kattan J Assi T Awada A Palbociclib safety and efficacy beyond Ribociclib-induced liver toxicity in metastatic hormone-receptors positive breast cancer patient Anticancer Drugs 2020 31 1 85 89 10.1097/CAD.0000000000000845 31609762 ",
  "metadata": {
    "Title of this paper": "Palbociclib safety and efficacy beyond Ribociclib-induced liver toxicity in metastatic hormone-receptors positive breast cancer patient",
    "Journal it was published in:": "Journal of Medical Cases",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479074/"
  }
}