{
  "title": "Paper_443",
  "abstract": "pmc Pediatr Discov Pediatr Discov 4746 peddisc PDI3 Pediatric Discovery 2835-558X 2835-5598 Wiley PMC12483300 PMC12483300.1 12483300 12483300 41036305 10.1002/pdi3.72 PDI372 1 Review Review Reproductive adverse events in patients with non‐Hodgkin lymphoma treated with chemotherapeutic regimens including cyclophosphamide, doxorubicin, vincristine, prednisone or CHOP with rituximab: A systematic review and meta‐analysis Han Rong  1  2  3  4 Zhao Jie  1  2  3  4 Yu Chengjun  1  2  3  4 Wang Ling  1  2  3  4 Chen Long  1  2  3  4 Hu Yang  1  2  3  4 Wu Shengde https://orcid.org/0000-0002-0083-561X  1  2  3  4  5  6 shengdewu@hospital.cqmu.edu.cn   1 Department of Urology Children's Hospital of Chongqing Medical University Chongqing China   2 Chongqing Key Laboratory of Structural BirthDefect and Reconstruction Chongqing China   3 National Clinical Research Center for Child Health and Disorders Chongqing China   4 Chongqing Key Laboratory of Pediatrics Chongqing Chongqing China   5 Ministry of Education Key Laboratory of Child Development and Disorders Chongqing China   6 China International Science and Technology Cooperation Base of Child Development and Critical Disorders Chongqing China * Correspondence shengdewu@hospital.cqmu.edu.cn 24 5 2024 9 2025 3 3 498018 10.1002/pdi3.v3.3 e72 15 11 2023 05 8 2023 03 1 2024 24 05 2024 01 10 2025 02 10 2025 © 2024 The Authors. Pediatric Discovery https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ Abstract The regimen of cyclophosphamide, doxorubicin, vincristine, and prednisone (CHOP) or CHOP with rituximab (R‐CHOP) is the first‐line treatment for non‐Hodgkin lymphoma (NHL). NHL patients treated with CHOP/R‐CHOP have a high risk of reproductive adverse events. The aim of this article was to evaluate the reproductive toxicity of regimens and make further suggestions on reproductive protection. We systematically searched with appropriate terms from January 1980 to June 2021 for observational studies in patients treated with CHOP/R‐CHOP, without any language restriction. We conducted meta‐analyses of one‐sample proportions of patients suffering reproductive adverse events after using CHOP/R‐CHOP. In addition, subgroup analyses were performed to determine the effect of sex. Nine articles involving 331 patients were included in the meta‐analysis, and the pooled proportion of reproductive adverse events was computed to be 22.3% (95% confidence interval [CI] 11.4%–33.2%; heterogeneity test Q τ 2 I 2 p Q τ 2 I 2 p Q τ 2 I 2 p The regimen of cyclophosphamide, doxorubicin, vincristine, and prednisone (CHOP) or CHOP with rituximab (R‐CHOP) is the first‐line treatment for non‐Hodgkin lymphoma (NHL). Nine articles involving 331 patients were included in the meta‐analysis, the pooled proportion of reproductive adverse events was 22.3% (95% CI 11.4%–33.2%; p antineoplastic combined chemotherapy protocols adverse effects antineoplastic combined chemotherapy protocols therapeutic use cyclophosphamide adverse effects humans reproduction tumor National Natural Science Foundation of China No.82071632 Innovation Program for Chongqing's Overseas Returnees cx2019030 Program for Youth Innovation in Future Medicine, Chongqing Medical University W0069 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date September 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:30.09.2025  Han R Zhao J Yu C Reproductive adverse events in patients with non‐Hodgkin lymphoma treated with chemotherapeutic regimens including cyclophosphamide, doxorubicin, vincristine, prednisone or CHOP with rituximab: a systematic review and meta‐analysis Pediatr Discov 2025 3 3 e72 10.1002/pdi3.72 1 INTRODUCTION The preferred chemotherapy treatment for non‐Hodgkin's lymphoma is CHOP  1  2  3  4  5  6  7 2 MATERIALS AND METHODS In this article, we performed a systematic review and meta‐analysis of articles on reproductive toxicity associated with CHOP/R‐CHOP, without any regional or language restriction. In the study, we included NHL patients aged >18 years who were treated with CHOP/R‐CHOP like regimen. We focused on the overall proportion of patients with reproductive adverse events following the use of CHOP/R‐CHOP and measured the proportion of the two subgroups according to sex. Based on the results, we propose a number of methods for reproductive protection. 3 SEARCH STRATEGY This systematic review is reported according to the Preferred Reporting Items for Systematic Reviews and Meta‐analyses Guidelines.  8 4 DATA ANALYSIS Study indicators including sample size, patient sex, length of follow‐up, median age, types of drugs, doses of the chemotherapeutic agents, cycles of interval, number of cycles and outcome data, were extracted from the reports as much as possible. If the literature was based on the same clinical trial, we selected one with longer follow‐up and more complete experimental data. 5 INFORMATION SOURCES AND SEARCH TERMS In this study, two independent researchers (RH and JZ) searched for relevant papers using PubMed, the Cochrane Library, and Embase. Articles were systematically searched from January 1, 1980 to June 2021 without language or publication‐type restrictions. In short, the search strategy contained the terms NHL, CHOP/R‐CHOP, gonadal toxicity and some relevant variants of these search terms. Title and abstract screening were conducted by two of us (RH and JZ) in accordance with the predefined criteria. If Hodgkin lymphoma patients and NHL patients were included in an article, we included only reproductive‐related outcomes in NHL patients. In addition, we invited an outstanding expert (Professor Wu) to evaluate the included articles and search for missed articles regarding gonadal effects and CHOP exposure to ensure that our analysis included all relevant studies. 6 INCLUSION AND EXCLUSION CRITERIA In this study, inclusion criteria for selection were: (1) NHL patients aged >18 years; (2) clinical studies or experiments involving regimens that included chemotherapy drugs of cyclophosphamide, adriamycin, vincristine and prednisone; (3) a median duration of remission longer than 2 years; (4) fertility outcomes including parenthood, semen quality, reproductive hormone function (egand. luteinizing hormone, follicle stimulating hormone, testosterone, estrogen), ovarian function, menopausal status and so on. Exclusion criteria for selection were: (1) patients with underlying gonad‐related diseases; (2) studies that include animal and gene; (3) reviews. In addition, the duplicated articles were removed from the list of studies. 7 STUDY SELECTION The literature search yielded a total of 2740 articles, from which we removed 254 duplicates (Figure 1  9  10  11  12  13  14  15  16  17 FIGURE 1 Flow diagram showing studies identified from the literature and their subsequent selection or omission for the meta‐analysis. (*: PubMed, the Cochrane Library, Embas). We were unable to obtain many randomized controlled trials (RCTs) in our searches. Because of the limitations of RCTs, interventions in cancer patients may cause homeopathic exacerbations, which refers to the concept of going beyond adverse effects and being specific to homeopathy. And the adverse effects of treatment are different from homeopathic exacerbations. In this study, we chose to include observational studies. 8 DATA EXTRACTION We carefully evaluated each selected paper and extracted some important information (first author of the study, date of publication, type of study, and study period) and study characteristics (length of follow‐up, sample size, type, and dosage of chemotherapeutic agents). We extracted the following indicators to represent the functional status of the reproductive system. For male patients, our follow‐up indicators were the patient's hormone level (FSH, LH, testosterone) and sperm‐related parameters (semen volume, sperm count, sperm motility). Similarly, blood hormone levels (FSH, LH, estradiol) and menstrual cycle, pregnancy or fertility were the representative indicators of the ovarian function of female patients. If these indicators are in the range of pathological significance, we consider that patients suffered reproductive adverse events. Most importantly, the number of total patients and patients with reproductive adverse events after treatment in the selected study was recorded for our systematic review and meta‐analysis (Table 1 2 TABLE 1 Summarized data of papers included in the meta‐analysis. Study Number of patients Proportion  a Reproductive adverse events Total Armitage 1984 12 20 60.00% Muller 1993 4 30 13.33% Pryzant 1993 30 58 51.72% Bokemeyer 1994 4 24 16.67% Dann 2005 1 13 7.69% Elis 2006 2 36 5.56% Meissner 2014 10 36 27.78% Meissner 2015 8 36 22.22% Pallotti 2021 6 78 7.69% Total 77 331 23.26%  a Proportion = (the number of patients with reproductive adverse events/the number of total patients) *100%. TABLE 2 Subgroup data of reproductive included in the meta‐analysis. Study Number of male patients Number of female patients Reproductive adverse events Total Reproductive adverse events Total Armitage 1984 7 13 5 7 Pryzant 1993 30 58 / / Muller 1993 3 19 3 19 Bokemeyer 1994 3 14 1 10 Dann 2005 / / 1 13 Elis 2006 / / 2 36 Meissner 2014 7 23 2 13 Meissner 2015 / / 8 36 Pallotti 2021 6 78 / / Total 56 205 22 124 9 RISK OF BIAS ASSESSMENT The methodological quality of the studies included was assessed using the quality assessment tool for observational studies developed by the Joanna Briggs Institute.  18 10 DATA ANALYSIS We calculated the overall proportion and the corresponding 95% confidence intervals (CIs) provided in the nine manuscripts that were appropriate for our target meta‐analysis. We performed two subgroup analyses for different sexes to evaluate the relationship between gonadal toxicity and sex. In subgroup analyses, we estimated the proportion (95% CI) of patients in different subgroups for reproductive adverse events and overall toxicity. A random‐effects model was used to assess differences in proportions between subgroups. Additionally, if the sample size was large enough, we assessed the effect of each variable on risk (relative risk [95% CI]) for variables such as treatment regimens, the dose of chemotherapeutics, and the number of treatment cycles. We calculated the heterogeneity of the studies using the Q I 2 τ 2  19 I 2 All statistical calculations were finished in Stata 15 by using the random‐effects model. 11 RESULTS According to Figure 2  10 Q τ 2 I 2 p FIGURE 2 Pooled proportion of patients with reproductive adverse events after treatment. From Figure 2  9  11 At the same time, we performed subgroup meta‐analysis of reproductive toxicity rates in male and female patients. According to Figure 3 Q τ 2 I 2 p 4 Q τ 2 I 2 p FIGURE 3 Pooled proportion of male patients with reproductive adverse events after treatment. FIGURE 4 Pooled proportion of female patients with reproductive adverse events after treatment. From the forest plot, the study Armitage 1984  9 12 DISCUSSION Overall, our meta‐analysis revealed that for chemotherapy regimens of CHOP/R‐CHOP, the pooled proportion of overall gonadal toxicity was higher (22.3%) than that of other toxicities. Clearly, we can conclude that the proportion of gonadal toxicity of CHOP/R‐CHOP is linked with the sex of the patients. It seems that both male and female patients have a high probability of reproductive adverse events. However, male patients are more likely to suffer from reproductive adverse events than female patients. In these studies, chemotherapy CHOP/R‐CHOP may be the main cause of gonadal toxicity. In this chemotherapy regimen, cyclophosphamide is the main contributor to this side effect of CHOP/R‐CHOP.  20  21  22  23  24  25  26  27  28 2  11 2 2 For women, cyclophosphamide shows a high damage risk to the ovary. It can interfere with cell division via cross‐linking of DNA and induce a decrease in mitochondrial transmembrane potential. As an alkylating agent, cyclophosphamide can inhibit the accumulation of cytochrome C and induce double‐stranded breaks in granulosa cells and oocytes.  21 Other drugs in CHOP/R‐CHOP can also influence reproductive function.  27  29  30  31 The effect of CHOP/R‐CHOP on reproductive function is a complex process of action that cannot be summarized by a single drug. Moreover, for different genders, the mechanism of action of various drugs is also different, and further study is needed to supplement our conclusions. We tried to obtain the most accurate data by selecting patients who were treated only with CHOP/R‐CHOP. However, physicians‐in‐charge cannot treat all patients with CHOP/R‐CHOP alone. Depending on the patient's condition and personal willingness, increasing the dose or type of chemotherapy drugs, being combined with radiotherapy, using targeted drugs, or performing hematopoietic stem cell transplantation are considered options for cancer treatment. These treatment options can lead to a higher probability of reproductive damage.  32  33  34  11 Meissner in 2015  16 In the table, the two studies, Armitage in 1984  9  11 Other treatment regimens, such as MACOP‐B (methotrexate, doxorubicin, cyclophosphamide, vincristine, prednisone, bleomycin)/VACOP‐B (cyclophosphamide, adriamycin, oncovin, bleomycin, etoposide, prednisone), CHOP‐B (cyclophosphamide, doxorubicin, vincristine, prednisone, bleomycin), and CHOEP (cyclophosphamide, doxorubicin, vincristine, prednisone, etoposide) all include cyclophosphamide, doxorubicin, vincristine and prednisone. While the dosages of these four drugs may differ from those in the CHOP regimen, they do not have a great influence on the result of gonadal toxicity. Drugs such as methotrexate, bleomycin, and etoposide included in these regimens may temporarily reduce sperm count. They can have additive effects when combined with highly gonadotoxic cyclophosphamide. Also, gonadotropin‐releasing hormone (GnRH) was included in some studies. In a sense, it can function as a preservation treatment at the gonads. For cancer patients treated with combination therapy, including NHL patients treated with CHOP/R‐CHOP, fertility preservation is an essential protective measure.  35  36  37  38  39  40 In this study, we examined the proportion of gonadal toxicity of CHOP/R‐CHOP and found a significant difference according to sex. Our study has several limitations. First, only 9 studies were included in this meta‐analysis. Although we have used the data we can gather, the sample size is relatively small, and we need more studies to confirm our results further. Second, the treatment of NHL is so complex that the combined treatment regimen may account for high heterogeneity, and we cannot evaluate the toxicity of CHOP/RCHOP alone. More prospective registries are necessary to support our study. Third, we did not compare the results of R‐CHOP/CHOP with those of other regimens, and if possible, we would also assess patients' reproductive function before treatment. 13 CONCLUSION Our results showed that NHL patients treated with CHOP/R‐CHOP are likely to suffer reproductive damage after treatment. At the same time, men are more likely to have adverse reproductive events than women. Therefore, the reproductive toxicity of chemotherapy should be considered in both the men and women of populations of childbearing age. In this study, we also make recommendations to protect reproductive function. Prior to treatment, it is important to assess the patient's reproductive function and perform fertility preservation, such as sperm banking and oocyte freezing, to be performed. Regular follow‐up and further methods, such as using GnRH, are also necessary after treatment. However, more studies and patients are needed to validate our results. AUTHOR CONTRIBUTIONS Rong Han and Shengde Wu conceived and designed the meta‐analysis. Rong Han and Jie Zhao independently searched the Pubmed, Cochrane Library, Embase and independently extracted the data. Rong Han led analysis and interpretation of data, drafted the manuscript and revised content based on feedback. Jie Zhao acted as second reviewer. Chengjun Yu and Jie Zhao assisted with the retrieval of the database and acquisition of data. Ling Wang, Long Chen, and Yang Hu assisted with the interpretation of data and provided critical revision of drafts. Shengde Wu assisted with the conception and design, interpretation of data, and critical revision of drafts. Shengde Wu acted as the corresponding author, provided funding support, assisted with interpretation of data, provided critical revision of drafts and acted as the third (mediating) reviewer. CONFLICT OF INTEREST STATEMENT Shengde Wu is a munber of Pediatric Discovery Editorial Board. To minimaze bias, he was excluded from all the dicision‐making related to the acceptance for publishing. The other authors declared that there are no financial or non‐financial conflicts of interest. ETHICS APPROVAL AND CONSENT TO PARTICIPATE Not applicable. CONSENT FOR PUBLICATION Not applicable. ACKNOWLEDGMENTS We would acknowledge the support of the Dept. of Urology of Children's Hospital of Chongqing Medical University. This work was supported by the National Natural Science Foundation of China (NO.82071632), the Innovation Program for Chongqing's Overseas Returnees (cx2019030), and the Program for Youth Innovation in Future Medicine, Chongqing Medical University (W0069). DATA AVAILABILITY STATEMENT All data generated or analyzed during this study are included in this published article and its supplementary information files. REFERENCES 1 Fisher RI Gaynor ER Dahlberg S Comparison of a standard regimen (CHOP) with three intensive chemotherapy regimens for advanced non‐Hodgkin's lymphoma N Engl J Med 1993 328 14 1002 1006 7680764 10.1056/NEJM199304083281404 2 Coiffier B Lepage E Briere J CHOP chemotherapy plus rituximab compared with CHOP alone in elderly patients with diffuse large‐B‐cell lymphoma N Engl J Med 2002 346 4 235 242 11807147 10.1056/NEJMoa011795 3 Miller KD Fidler‐Benaoudia M Keegan TH Hipp HS Jemal A Siegel RL Cancer statistics for adolescents and young adults, 2020 CA A Cancer J Clin 2020 70 6 443 459 10.3322/caac.21637 32940362 4 Schein PS Winokur SH Immunosuppressive and cytotoxic chemotherapy: long‐term complications Ann Intern Med 1975 82 1 84 95 67817 10.7326/0003-4819-82-1-84 5 Schilsky RL Lewis BJ Sherins RJ Young RC Gonadal dysfunction in patients receiving chemotherapy for cancer Ann Intern Med 1980 93 1 109 114 6994532 10.7326/0003-4819-93-1-109 6 Queirós V Azeiteiro UM Soares AMVM Freitas R The antineoplastic drugs cyclophosphamide and cisplatin in the aquatic environment ‐ review J Hazard Mater 2021 412 125028 33951853 10.1016/j.jhazmat.2020.125028 7 Moher D Liberati A Tetzlaff J Altman DG PRISMA Group Preferred reporting items for systematic reviews and meta‐analyses: the PRISMA statement BMJ 2009 339 jul21 1 b2535 19622551 10.1136/bmj.b2535 PMC2714657 8 Porritt K Gomersall J Lockwood C JBI's systematic reviews: study selection and critical appraisal Am J Nurs 2014 114 6 47 52 10.1097/01.NAJ.0000450430.97383.64 24869584 9 Armitage JO Fyfe MA Lewis J Long‐term remission durability and functional status of patients treated for diffuse histiocytic lymphoma with the CHOP regimen J Clin Oncol 1984 2 8 898 902 6379123 10.1200/JCO.1984.2.8.898 10 Müller U Stahel RA Gonadal function after MACOP‐B or VACOP‐B with or without dose intensification and ABMT in young patients with aggressive non‐Hodgkin's lymphoma Ann Oncol 1993 4 5 399 402 7688980 10.1093/oxfordjournals.annonc.a058519 11 Pryzant RM Meistrich ML Wilson G Brown B McLaughlin P Long‐term reduction in sperm count after chemotherapy with and without radiation therapy for non‐Hodgkin's lymphomas J Clin Oncol 1993 11 2 239 247 8426200 10.1200/JCO.1993.11.2.239 12 Bokemeyer C Schmoll HJ van Rhee J Kuczyk M Schuppert F Poliwoda H Long‐term gonadal toxicity after therapy for Hodgkin's and non‐Hodgkin's lymphoma Ann Hematol 1994 68 3 105 110 8167175 10.1007/BF01727413 13 Dann EJ Epelbaum R Avivi I Fertility and ovarian function are preserved in women treated with an intensified regimen of cyclophosphamide, adriamycin, vincristine and prednisone (Mega‐CHOP) for non‐Hodgkin lymphoma Hum Reprod 2005 20 8 2247 2249 15817583 10.1093/humrep/dei018 14 Elis A Tevet A Yerushalmi R Fertility status among women treated for aggressive non‐Hodgkin's lymphoma Leuk Lymphoma 2006 47 4 623 627 16690520 10.1080/10428190500353877 15 Meissner J Tichy D Dietrich S Parenthood in long‐term survivors after CHOP with or without etoposide treatment for aggressive lymphoma Br J Haematol 2014 166 4 612 615 24689462 10.1111/bjh.12877 16 Meissner J Tichy D Katzke V Long‐term ovarian function in women treated with CHOP or CHOP plus etoposide for aggressive lymphoma Ann Oncol 2015 26 8 1771 1776 25962442 10.1093/annonc/mdv227 17 Pallotti F Pelloni M Faja F Semen quality in non‐Hodgkin lymphoma survivors: a monocentric retrospective study Hum Reprod 2021 36 1 16 25 33257989 10.1093/humrep/deaa266 18 Pfreundschuh M Trümper L Osterborg A CHOP‐like chemotherapy plus rituximab versus CHOP‐like chemotherapy alone in young patients with good‐prognosis diffuse large‐B‐cell lymphoma: a randomised controlled trial by the MabThera International Trial (MInT) Group Lancet Oncol 2006 7 5 379 391 16648042 10.1016/S1470-2045(06)70664-7 19 Higgins JP Thompson SG Deeks JJ Altman DG Measuring inconsistency in meta‐analyses BMJ 2003 327 7414 557 560 12958120 10.1136/bmj.327.7414.557 PMC192859 20 Kim S Kim SW Han SJ Molecular mechanism and prevention strategy of chemotherapy‐ and radiotherapy‐induced ovarian damage Int J Mol Sci 2021 22 14 7484 34299104 10.3390/ijms22147484 PMC8305189 21 Potnuri AG Allakonda L Lahkar M Crocin attenuates cyclophosphamide induced testicular toxicity by preserving glutathione redox system Biomed Pharmacother 2018 101 174 180 29486335 10.1016/j.biopha.2018.02.068 22 Senturia YD Peckham CS Peckham MJ Children fathered by men treated for testicular cancer Lancet 1985 2 8458 766 769 2864495 10.1016/s0140-6736(85)90640-3 23 Dodds L Marrett LD Tomkins DJ Green B Sherman G Case‐control study of congenital anomalies in children of cancer patients Br Med J 1993 307 6897 164 168 8343744 10.1136/bmj.307.6897.164 PMC1678343 24 Blatt J Pregnancy outcome in long‐term survivors of childhood cancer Med Pediatr Oncol 1999 33 1 29 33 10401494 10.1002/(sici)1096-911x(199907)33:1<29::aid-mpo6>3.0.co;2-2 25 Byrne J Rasmussen SA Steinhorn SC Genetic disease in offspring of long‐term survivors of childhood and adolescent cancer Am J Hum Genet 1998 62 1 45 52 9443870 10.1086/301677 PMC1376803 26 Meistrich ML Byrne J Genetic disease in offspring of long‐term survivors of childhood and adolescent cancer treated with potentially mutagenic therapies Am J Hum Genet 2002 70 4 1069 1071 11885031 10.1086/339466 PMC379105 27 Meistrich ML Male gonadal toxicity Pediatr Blood Cancer 2009 53 2 261 266 19326418 10.1002/pbc.22004 PMC2737736 28 Green DM Liu W Kutteh WH Cumulative alkylating agent exposure and semen parameters in adult survivors of childhood cancer: a report from the St Jude Lifetime Cohort Study Lancet Oncol 2014 15 11 1215 1223 25239573 10.1016/S1470-2045(14)70408-5 PMC4192599 29 Grunewald S Jank A New systemic agents in dermatology with respect to fertility, pregnancy, and lactation J Dtsch Dermatol Ges 2015 13 4 277 290 25819232 10.1111/ddg.12596 30 Levy RA de Jesús GR de Jesús NR Klumb EM Critical review of the current recommendations for the treatment of systemic inflammatory rheumatic diseases during pregnancy and lactation Autoimmun Rev 2016 15 10 955 963 27490204 10.1016/j.autrev.2016.07.014 31 Østensen M Lockshin M Doria A Update on safety during pregnancy of biological agents and some immunosuppressive anti‐rheumatic drugs Rheumatol 2008 47 Suppl 3 iii28 iii31 10.1093/rheumatology/ken168 18504282 32 Sanders JE Hawley J Levy W Pregnancies following high‐dose cyclophosphamide with or without high‐dose busulfan or total‐body irradiation and bone marrow transplantation Blood 1996 87 7 3045 3052 8639928 33 Marci R Mallozzi M Di Benedetto L Radiations and female fertility Reprod Biol Endocrinol 2018 16 1 112 30553277 10.1186/s12958-018-0432-0 PMC6295315 34 Loren AW Mangu PB Beck LN Fertility preservation for patients with cancer: American Society of Clinical Oncology clinical practice guideline update J Clin Oncol 2013 31 19 2500 2510 23715580 10.1200/JCO.2013.49.2678 PMC5321083 35 Ginsberg JP Educational paper: the effect of cancer therapy on fertility, the assessment of fertility and fertility preservation options for pediatric patients Eur J Pediatr 2011 170 6 703 708 21127904 10.1007/s00431-010-1359-4 36 Bates GE Taub RN West H Fertility and cancer treatment JAMA Oncol 2016 2 2 284 26822339 10.1001/jamaoncol.2015.4143 37 Ginsberg JP Carlson CA Lin K An experimental protocol for fertility preservation in prepubertal boys recently diagnosed with cancer: a report of acceptability and safety Hum Reprod 2010 25 1 37 41 19861330 10.1093/humrep/dep371 PMC2794668 38 Carlson CA Kolon TF Mattei P Developing a hospital‐wide fertility preservation service for pediatric and young adult patients J Adolesc Health 2017 61 5 571 576 28917444 10.1016/j.jadohealth.2017.07.008 39 Depalo R Falagario D Masciandaro P Fertility preservation in males with cancer: 16‐year monocentric experience of sperm banking and post‐thaw reproductive outcomes Ther Adv Med Oncol 2016 8 6 412 420 27800030 10.1177/1758834016665078 PMC5066546 40 van der Kaaij MA van Echten‐Arends J Heutte N Cryopreservation, semen use and the likelihood of fatherhood in male Hodgkin lymphoma survivors: an EORTC‐GELA Lymphoma Group cohort study Hum Reprod 2014 29 3 525 533 24345581 10.1093/humrep/det430 ",
  "metadata": {
    "Title of this paper": "Cryopreservation, semen use and the likelihood of fatherhood in male Hodgkin lymphoma survivors: an EORTC‐GELA Lymphoma Group cohort study",
    "Journal it was published in:": "Pediatric Discovery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483300/"
  }
}