{
  "title": "Paper_285",
  "abstract": "pmc J Exp Clin Cancer Res J Exp Clin Cancer Res 618 jeccr Journal of Experimental & Clinical Cancer Research : CR 0392-9078 1756-9966 BMC PMC12486788 PMC12486788.1 12486788 12486788 41029387 10.1186/s13046-025-03515-3 3515 1 Research DUSP8 as a regulator of glioblastoma stem-like cell contribution to tumor vascularization Castellani Giorgia 1 Buccarelli Mariachiara 1 D’Alessandris Quintino Giorgio quintinogiorgio.dalessandris@unicatt.it 2 3 De Luca Gabriele 1 Ilari Ramona 1 Pedini Francesca 1 Martini Maurizio 4 Mollinari Cristiana 5 6 Tabolacci Claudio 1 7 Ricciardi Gabriele 8 9 Germanà Emanuela 8 Lulli Valentina 1 Boe Alessandra 10 Biffoni Mauro 1 Marziali Giovanna 1 Pallini Roberto 2 Ricci-Vitiani Lucia lucia.riccivitiani@iss.it 1 1 https://ror.org/02hssy432 grid.416651.1 0000 0000 9120 6856 Department of Oncology and Molecular Medicine, Istituto Superiore Di Sanità, 2 https://ror.org/00rg70c39 grid.411075.6 0000 0004 1760 4193 Department of Neurosurgery, Fondazione Policlinico Universitario A. Gemelli IRCCS, 3 https://ror.org/03h7r5v07 grid.8142.f 0000 0001 0941 3192 Institutes of Neuroscience, Neurosurgery Section, Catholic University School of Medicine, 4 5 https://ror.org/02hssy432 grid.416651.1 0000 0000 9120 6856 Department of Neuroscience, Istituto Superiore Di Sanita’, 6 https://ror.org/04zaypm56 grid.5326.2 0000 0001 1940 4177 Institute of Translational Pharmacology, National Research Council, 7 https://ror.org/02hssy432 grid.416651.1 0000 0000 9120 6856 Research Coordination and Support Service, Istituto Superiore Di Sanità, 8 https://ror.org/05ctdxz19 grid.10438.3e 0000 0001 2178 8421 Department of Biomedical, Dental, Morphological and Functional Imaging Sciences, University of Messina, 9 10 https://ror.org/02hssy432 grid.416651.1 0000 0000 9120 6856 Core Facilities, Istituto Superiore Di Sanità, 30 9 2025 2025 44 478191 269 10 6 2025 12 8 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ http://creativecommons.org/publicdomain/zero/1.0/ Glioblastomas (GBMs) are highly vascularized cancers. Transdifferentiation of GBM stem-like cells (GSCs) into GSC-derived endothelial cells (GdECs) contributes to GBM neovascularization. To dissect the molecular mechanisms and the signaling pathways underlying GSC contribution to tumor vascularization, we identified a three miRNA signature able to discriminate GSCs from GdECs by regulating different signaling pathways. DUSP8 resulted as the common target of the miRNA signature identified and is negatively regulated by miR-1825. DUSP8 is emerging as a critical negative regulator MAPKs pathway and is involved in cell oxidative stress response and apoptosis, as well as, in several diseases, including cancer. In GBM patients, DUSP8 and miR-1825 expression are inversely correlated and DUSP8 down-regulation is significantly associated with higher microvascular density and poor overall survival. Exploring the impact of DUSP8 in GSC transdifferentiation, we demonstrated that DUSP8 down-regulation interferes with MAPK pathway and affects soluble factor release. In vitro DUSP8 modulation experiments showed that DUSP8 enforced expression impairs GdEC ability to form tube-like structures. Gene expression variations induced by DUSP8 modulation affect transcripts associated with EMT pathway, confirming that DUSP8 shutdown and, therefore, the activation of MAPK pathway, is mandatory to GSC transdifferentiation. In vivo experiments demonstrated that both DUSP8 enforced expression and silencing dramatically affect gliomagenesis. Dissecting the molecular mechanisms underlying the contribution of GSCs to tumor angiogenesis might represent a chance to develop new and more efficient antiangiogenic therapeutic protocols for GBM treatment. Our findings provide a strong rationale to develop therapeutic strategies based on modulation of DUSP8 for GBM treatment. Supplementary Information The online version contains supplementary material available at 10.1186/s13046-025-03515-3. Keywords Glioblastoma Glioblastoma Stem-like cells Endothelial transdifferentiation MiR-1825 DUSP8 MAPKs https://doi.org/10.13039/501100003407 Ministero dell’Istruzione, dell’Università e della Ricerca PNC0000001 https://doi.org/10.13039/501100005010 Associazione Italiana per la Ricerca sul Cancro IG2021 n.26515 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Italian National Cancer Institute ‘Regina Elena’ 2025 Introduction Glioblastoma, IDH-wildtype (GBM) is the most aggressive primary malignant brain tumor in adults. Despite the aggressive therapeutic strategies including maximal resection followed by chemoradiotherapy and, in some cases, antiangiogenic agents [ 1 3 4 5 6 7 8 9 In this way, we have demonstrated that glioblastoma stem-like cells (GSCs), a subpopulation of tumor initiating stem-like cells capable of supporting malignant properties including initiation, growth, resistance to therapies and tumor recurrence [ 10 11 11 Through their ability to regulate many genes, microRNAs (miRNAs), a class of short non-coding RNAs, has been shown to control diverse oncogenic signaling pathways including GSC behavior, cell differentiation and angiogenesis [ 12 In the present study we identified a three miRNA signature that clearly distinguish GSCs cultivated in stem cell medium or differentiated in endothelial conditions and are able to regulate GSC-contribution to tumor vascularization through dual-specificity phosphatase 8 (DUSP8) modulation. DUSP8 is emerging as a critical negative regulator for Mitogen-activated protein kinase (MAPK) pathway and it is involved in cell oxidative stress response and cell apoptosis, as well as the development of various human diseases, including cancer [ 13 Methods Cell cultures GSCs were isolated from surgical samples of adult patients who underwent craniotomy at the Department of Neurosurgery, Fondazione Policlinico Universitario A. Gemelli IRCCS, Rome, upon approval by the local ethical committee (Prot. ID 2253 and 3782). Informed consent was obtained from the patients before surgery. Clinical features of GBM patients and tumors are shown in Supplementary Table S1. Information of GSC lines, HeLa and 293 T cells are described in the Supplementary Methods. Transdifferentiation of GSCs GSCs were cultured in endothelial conditions, as previously described [ 14 Flow cytometry Evaluation of the expression of endothelial markers was performed as previously described [ 14 RT-PCR Total RNA was isolated from cells using TRIzol reagent (Invitrogen by ThermoFisher Scientific). RNA was reverse transcribed by TaqMan MicroRNA Reverse Transcription Kit (Applied Biosystems™ by ThermoFisher Scientific, Waltham, MA, USA) and LunaScript® RT SuperMix Kit (New England Biolabs, Ipswich, MA, USA). Detailed information on RT-PCR for miRNAs and DUSP8 mRNA detection are available inSupplementary Methods. Automated capillary Western immunoassay (WES) Total protein lysates for WES were performed as previously described [ 15 Luciferase Reporter Assay Detailed information on luciferase reporter assay are described in Supplementary Methods. RNA Immunoprecipitation (RIP) RIP assay was performed by using the miRNA Target IP Kit (Active Motif, Carlsbad, CA, USA) according to manufacturer’s instruction. Detailed methods are available in Supplementary Methods. Drug cytotoxicity experiments For cytotoxicity experiments, GSCs were mechanically dissociated and plated in a 96-well plate, in triplicate, at a density of 2 × 10 4 4 14 Plasmid constructs and lentivirus infection For DUSP8 silencing and ectopic expression experiments, short hairpin (sh)-DUSP8-Green Fluorescent Protein (GFP) (TL313344) and DUSP8-GFP (RC208337) lentiviral vectors were purchased from OriGene Technologies (Rockville, MD, USA). Lentiviral particles were produced in 293 T at 70–80% confluency, using the calcium phosphate transfection protocol and infection was performed as previously reported [ 16 Analysis of conditioned medium by Luminex assay GSCs and GdECs were cultured as previously described. After 48 h of incubation under standard condition, cells were counted and conditioned media were collected and centrifuged to remove cell debris. Conditioned media were analyzed with a magnetic bead-based multiplex immunoassay on the Luminex platform as previously described [ 17 Microarrays and RNA-Sequencing analysis (RNA-Seq) To analyze miRNA expression, total RNA was prepared using Qiagen RNeasy Micro Kit (Qiagen, Hilden, Germany). 1 µg of RNA was labeled and hybridized to the Agilent-019118 array (Agilent Technologies, Santa Clara, CA, USA) following the manufacturer's instructions. RNA-Seq on transduced GSCs and GdECs was performed by Genomix4life (Laboratory of Molecular Medicine and Genomics, University of Salerno). See Supplementary Methods for detailed information. Tube formation assay Detailed information on tube formation assay are described in Supplementary Methods. Intracranial implantation of GSCs into immunocompromised mice Animal experiments were performed in accordance to relevant institutional and national regulations (Aut.n. 53/2023-PR, prot. D9997.150). NOD-SCID mice ( n 5 Immunofluorescence analysis of tumors in brain slices For information on immunofluorescence analysis see Supplementary Methods. Immunohistochemistry (IHC), microvessel density evaluation (MVD) and Combined in situ Hybridization/Immunohistochemistry (ISH/IHC) Detailed information on IHC, MVD and combined ISH/IHC are available in Supplementary Methods. GBM patient cohort For more information about the cohort included in the study see Supplementary Methods. Statistical analysis Detailed information of all the statistical analyses performed is described in Supplementary Methods. Results Three miRNA signature discriminates GSCs from GdECs by regulating different signaling pathways GSCs are directly involved in new vessel formation via their transdifferentiation into tumor-derived endothelial cells. As previously showed [ 14 18 In order to identify signaling pathways with potentially relevant functions in GdEC survival, we performed miRNA profiling of the three GSC lines, namely GSC#1, GSC#61 and GSC#83, either cultivated in stem cell medium (SCs) or in endothelial conditions (Endo). Hierarchical clustering of global miRNA expression pattern revealed two distinct clusters: the so-called\"SCs\"and the\"Endo\"clusters. The signature underlying SCs vs 1 1 Fig. 1 miRNA expression pattern analysis in patient-derived GSCs and GdECs. A B C Gene Set Enrichment Analysis (GSEA) of the three miRNA targets revealed a modulation of genes associated with pathways involved in different processes such as angiogenesis, hypoxia, reactive oxygen species (ROS) metabolism (Fig. 1 DUSP8 is the common target of the three miRNAs but is negatively regulated by miR-1825 in GSCs To confirm the implication of the three miRNAs in endothelial transdifferentiation of GSCs, we compared the expression of miR-1281, miR-1825 and miR-4516 in GSC lines cultured under normoxia, in stem cell medium, or under hypoxia, in endothelial conditions, two weeks after seeding. Particularly, we analyzed by RT-PCR, the three GSC lines used for the miRNA profiling (i.e. GSC#1, GSC#61 and GSC#83) and a larger panel of patient-derived GSCs, including two pairs of GSC lines derived from the same patient at primary (GSC#275, GSC#412) and secondary surgery (GSC#275 bis and GSC#486), confirming the up-regulation of miR-1281 and miR-1825 in endothelial condition (Fig. 2 Fig. 2 Validation of the up-regulation of the three miRNAs and of the down-regulation of DUSP8 in GdECs compared to GSCs. A n B left panel right panel n A list of the potential target mRNAs for miR-4516, miR-1281 and miR-1825 was obtained using miRBase ( http://mirbase.org/ 19 20 2 left In line with RT-PCR analysis results, DUSP8 protein levels decreased after endothelial transdifferentiation as well (Fig. 2 right Dual-luciferase reporter assays were performed to prove the direct binding between DUSP8 and miR-4516, miR-1281 and miR-1825 (Supplementary Fig.S2). The human DUSP8 3′-UTR contains four target sites for miR-1281, two for miR-1825 and three for miR-4516 (Supplementary Fig. S2A). To better verify the direct binding, we divided DUSP8 3′-UTR into two regions. Depending on the region we performed luciferase assays by transfecting 293 T cells with single hsa-miR-1281 or hsa-miR-4516 or both hsa-miRs (Supplementary Fig. S2B, left right To confirm the putative direct binding between miR-1825 and DUSP8 we performed RIP using a pan-Ago antibody to pulldown the endogenous DUSP8 associated to miRNA by using HeLa cells transiently transfected with hsa-miR-1825 mimic or scramble (Supplementary Fig. S2D). RT-PCR analysis on RNA recovered after RIP assay showed a fold-enrichment for DUSP8 between the hsa-miR-1825 mimic or scramble-transfected HeLa cells, confirming the ability of miR-1825 to negatively modulate DUSP8 expression by direct binding of DUSP8 mRNA.  DUSP8 and miR-1825 expression are inversely correlated and DUSP8 down-regulation is significantly associated with higher microvascular density and poor overall survival of GBM patients. To verify the correlation between DUSP8 and miR-1825 expression in GBM patients, we performed a combined in situ hybridization/immunohistochemistry (ISH/IHC) for miR-1825/DUSP8 on 8 GBM cases (4 with high and 4 with low expression of DUSP8). All cases analyzed showed an inverse relation between DUSP8 and miR-1825 (Fig. 3 3 lower panel Fig. 3 Study of miR-1825 and DUSP8 expression in GBM patients. A B p C blue line red line p Microvascular Density (MVD) analysis of GBMs ( n vs p 3 The mean OS of our cohort of IDH-wild type GBM patients ( n vs p p p p p p p Interestingly, Kaplan–Meier analysis of our cohort of GBM patients indicated that lower expression of DUSP8 significantly correlated with shorter OS ( p 3 p p Endothelial transdifferentiation-induced DUSP8 down-regulation interferes with MAPK pathway and affects soluble factor secretion The potential role of DUSP8 in GSC endothelial transdifferentiation could be mainly exerted by its dephosphorylation activity on phosphorylated serine, threonine, and tyrosine residues of the ERK, and, particularly, p38 and JNK substrates [ 21 22 4 Fig. 4 DUSP8 modulation interferes with MAPK pathway during transdifferentiation. A B C left right p t To verify whether interfering with MAPK pathway activation could impair GSC endothelial transdifferentiation, we tested in vitro the effects of a set of MAPK pathway inhibitors, already approved for clinical trials or for therapy, on GSC#1, matched primary and secondary surgery GSC#275 and GSC#275bis lines, and their GdEC counterpart, showing different phosphorylation status of MAPK pathway (Supplementary Fig. S4A). Particularly, we had chosen: ralimetinib (LY2228820), a selective inhibitor of α- and β-isoforms of p38-MAPK tested in phase I trial with radiotherapy plus concomitant TMZ in the treatment of newly diagnosed GBM [ 23 24 25 4 4 4 To deepen the lack of response to ulixertinib and trametinib, we evaluated pERK/ERK 48 h after ulixertinib treatment and we observed an increase of pERK/ERK ratio in both GSC#1 and GdEC#1 (Supplementary Fig. S5, left panel 26 Treatment for 48 h with trametinib efficiently inhibited ERK phosphorylation but, once again, this inhibition was able to interfere with GSC but not with GdEC growth confirming their less addiction to MEK/ERK pathway (Supplementary Fig. S5, right panel These results suggest that interfering with MAPK pathway through the p38 inhibitor ralimetinib impairs GSC transdifferentiation ability, underlying the role of MAPK pathway in this process. Moreover, it has been recently demonstrated ralimetinib ability to inhibit EGFR kinase activity in vitro acting as an ATP-competitive EGFR inhibitor [ 27 The relationship between GSCs and surrounding microenvironment is crucial for regulating self-renewal and angiogenesis in GBM [ 28 29 31 32 Modulation of DUSP8 expression affects endothelial transdifferentiation ability of GSCs To deeply investigate the role of DUSP8 in GSC transdifferentiation, we performed gene modulation experiments and evaluated the effects of DUSP8 ectopic expression or silencing on GSC transdifferentiation ability. To this end, we transduced GSC#1 by using a lentiviral vector carrying DUSP8 and GFP as reporter gene to obtain DUSP8 ectopic expression, or by using the most efficient sh-DUSP8-GFP lentiviral construct, out of four tested, to silence DUSP8 expression (Supplementary Fig. S7A-B). Noteworthy, DUSP8 ectopic expression impaired the ability of GdECs to form tube-like structures whereas, silencing did not, supporting the hypothesis of its involvement in endothelial transdifferentiation and angiogenesis-related features (Fig. 5 Fig. 5 DUSP8 modulation affects endothelial transdifferentiation ability of GSCs. A left right p t B left up bottom C p RNA-Seq analysis on DUSP8-GFP, sh-DUSP8-GFP and their relative GFP-control GSC#1 and GdEC#1 transduced cells showed that the differentially expressed genes (fold change > 1.5 and < −1.5) from RNA-Seq data analysis in the transduced GSC#1, were 224 (sh-DUSP8-GFP vs vs vs vs vs vs vs vs 5 33 vs vs 34 Furthermore, Luminex analysis in supernatants of DUSP8-GFP, sh-DUSP8-GFP and their relative GFP-control GSC#1 and GdEC#1 transduced cells revealed that DUSP8 modulation exerts opposite effects in a group of four secreted molecules, all implicated in the malignant behaviour of GBM. Particularly, in the GSC context, DUSP8 modulation exerts opposite effects on CX3CL1 and TNF RII secreted molecules, whereas, in GdECs, DUSP8 modulation affected the secretion of TIMP-1 and IL-4 soluble molecule in an opposite way (Fig. 5 Modulation of DUSP8 expression affects gliomagenesis in vivo Intracerebral injection of patient-derived GSCs generates highly infiltrative tumors that closely mimic the histology of malignant glioma [ 11 35 n 6 upper panel 6 + + + 6 Fig. 6 In vivo DUSP8 modulation inhibits tumor growth in NOD-SCID mouse brain. A upper and lower panel blue + B blue red + C blue red + + + + + + D blue red + + + + + − + + + − Analysis of tumor volumes in the striatum showed that mice injected with DUSP8-GFP- or sh-DUSP8-GFP-expressing GSC#1 cells harbored significantly smaller tumors than mice injected with GFP expressing GSC#1 cells (Fig. 6 upper panel 3 3 3 p vs p vs t At 16 weeks after grafting the volume of the brain invaded by tumor cells was 39.9 ± 1.2 mm 3 3 3 p vs p vs t 6 lower panel The reduction of tumor volume was confirmed by Ki67 labeling (Fig. 6 Staining for the vascular progenitor endothelial marker, CD34 [ 18 + + 6 Moreover, as expected GFAP staining (Fig. 6 + + + − Analysis of tumor cell proliferation, as assessed by Ki67 labeling index, showed that as compared with GFP expressing tumors, (42.7 ± 6.4, mean ± SD), those grafted with either DUSP8-GFP, sh-DUSP8-GFP GSC#1 cells showed a significantly reduced proliferation in sh-DUSP8-GFP tumors, (21.5 ± 4.1, mean ± SD) and even more reduced in DUSP8-GFP tumors (2.8 ± 1.3, mean ± SD) (Supplementary Fig. S9A-B). Moreover, MVD analysis of brain tumors showed that microvessel counts (using CD31 staining) in sh-DUSP8-GFP (0.051 ± 0.01, mean ± SD), were significantly higher respect to either GFP (0.067 ± 0.006, mean ± SD), and DUSP8-GFP tumors (0.00026 ± 0.00042, mean ± SD) (Supplementary Fig. S9C). Taken together, in vivo results confirm a crucial role for DUSP8 in GBM progression. Particularly, stable enforced expression of DUSP8 produces glial tumors with reduced infiltrating ability and very low frequency of proliferating cells and MVD, whereas, stable DUSP8 silencing gives raise to very small nodules of endothelial-like GFAP low/− Discussion The inverse correlation between DUSP8 and miR-1825 expression and the significant association of DUSP8 down-regulation to higher MVD and poor OS of GBM patients, suggested a crucial role for DUSP8 in the GSC-associated neovascularization process. To confirm this hypothesis, we evaluated the effects of DUSP8 modulation on the tumorigenic ability of GSCs in vitro and in vivo. As expected, the enforced expression of DUSP8 impairs the ability of GdECs to form tube-like structures, confirming that the shutdown of DUSP8 phosphatase activity is mandatory to both morphological and functional transdifferentiation of GSCs into GdECs. Moreover, DUSP8 restoration increased sensitivity of GdEC#1 to ralimetinib treatment whereas GdEC#1 sh-DUSP8-GFP showed a decreased sensitivity confirming the critical role of DUSP8 in determining sensitivity to cancer therapeutics [ 36 In the attempt to transpose the laboratory data to the clinical condition, we postulate that the stem-like fraction of tumor cells might differentiate towards the endothelial phenotype in tumor regions where the blood–brain-barrier is disrupted and a free passage of serum and of serum-related products occurs. Under such circumstances, the DUSP8 machinery is switched off, and the endothelial trans-differentiation of the GSCs sustains neovasculature. Gene expression variations induced by DUSP8 modulation in GdEC#1, identified a list of 17 genes whose expression was regulated in opposite way in DUSP8-GFP GdEC#1 vs 34 15 33 Analysis of supernatants revealed that DUSP8 modulation exerts opposite effects in the release of four key molecules implicated in GBM. In the GSC context, DUSP8 oppositely regulates CX3CL1 and TNF-RII secreted molecules, both related with disease severity [ 37 38 39 40 41 Altogether our data confirms a major role for DUSPs not only in the regulatory mechanisms of intracellular signaling pathways in a variety of biological processes but, additional functions that push to target DUSPs with potential therapeutic modalities. However, the complex and unique, yet contradictory, roles that DUSPs play in various cancers, exhibiting both tumor suppressor and tumor promoter activity in different cancers, require special caution. Most of the DUSPs that have thus far been implicated in brain cancers were identified in GBM. Lin and colleagues, showed that dexamethasone treatment inhibited MMP-2 mediated invasiveness of human malignant glioma cells through a DUSP1-dependent mechanism, implicating the tumor suppressor characteristics of DUSP1 [ 42 43 44 45 On the other hand, the development of pharmacological DUSP inhibitors for clinical use is currently in progress, many of which work by inducing the formation of ROS. By screening more than 300 compounds, we recently selected elesclomol to be effective on GSCs and on GdECs as well. In depth investigation of the molecular mechanisms underlying GSC and GdEC response to elesclomol, confirmed that this compound induces a strong increase in mitochondrial ROS in both GSCs and GdECs ultimately leading to a non-apoptotic copper-dependent cell death [ 14 Supplementary Information  Supplementary Material 1. Abbreviations CD133 Prominin 1 CD31 Platelet and endothelial cell adhesion molecule 1 CD34 CD34 molecule CSF Cerebrospinal fluid CX3CL1 Fractalkine CX3CR1 CX3C motif chemokine receptor 1 CXCL10 C-X-C motif chemokine ligand 10 DUSP Dual-specificity phosphatase ECM Extracellular matrix EMT Epithelial to mesenchymal transition ERK Extracellular signal-regulated kinase FDA Food and Drug Administration GBM Glioblastoma GdEC GSC-derived endothelial cell GFAP Glial fibrillary acidic protein GSC Glioblastoma stem-like cell GSEA Gene set enrichment analysis ICAM-1 Intercellular adhesion molecule 1 IDH Isocitrate dehydrogenase IFN-γ Interferon-γ IL-4 Interleukin-4 JNK C-Jun N-terminal kinase Ki67 Marker of proliferation Ki-67 MAPK Mitogen-activated protein kinases MGMT O-6-methylguanine-DNA methyltransferase MiRNA Microrna MMP Metalloproteinase MVD Microvascular density OS Overall survival p38 Mitogen-activated protein kinase p38 PFS Progression-free survival POSTN Periostin ROS Reactive oxygen species STC-1 Stanniocalcin-1 sTNF-R Soluble tumor necrosis factor receptor Tie2 TEK Receptor Tyrosine Kinase TIMP-1 Tissue inhibitor of metalloprotease-1 TME Tumor microenvironment TMZ Temozolomide TNF RII Tumor necrosis factor receptor II TNF-α Tumor necrosis factor-α VCAM-1 Vascular cell adhesion molecule 1 VEGF Vascular endothelial growth factor VEGFR/KDR Vascular endothelial growth factor receptor /kinase insert domain receptor VPs Vascular progenitor cells WHO World Health Organization Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Giorgia Castellani and Mariachiara Buccarelli these authors shared authorship. Giovanna Marziali, Roberto Pallini and Lucia Ricci-Vitiani these authors shared senior authorship. Authors’ contributions L.R.V. conceived and designed the study and wrote the manuscript; M.Bu. and G.C. took care of GSC cultures and carried out in vitro assays; Q.G.D'A. and G.D.L. performed brain xenografts; M.M., E.G. and G.R. performed ISH/IHC and data analysis of in vivo experiments; C.M. performed confocal and fluorescence microscopy analysis of brain xenograft sections; A.B. carried out cell sorting and flow cytometry analysis; C.T. analyzed conditioned medium by Luminex assay; F.P. performed automated capillary western immonoassays; V.L. and I.R. took care of molecular assays (RT-PCR, plasmid constructs, luciferase reporter assays, RIP); G.M., R.P. and M.Bi. contributed to the supervision of the study and critical revision of the manuscript. All the authors discussed the results, provided critical feedback and contributed to revise the manuscript. Funding This work was supported by Associazione Italiana per la Ricerca sul Cancro, AIRC (IG2021 n.26515) to LRV. This work has been partially conducted under the National Plan for Complementary Investments to the NRRP, project “D34H—Digital Driven Diagnostics, prognostics and therapeutics for sustainable Health care” (project code: PNC0000001), Spoke 3, funded by the Italian Ministry of University and Research. Data availability The datasets used and/or analyzed during the current study are available from the corresponding author upon reasonable request. Declarations Ethics approval and consent to participate This study was conducted in accordance with the principles of the Declaration of Helsinki. Ethical approval for this study was provided by the ethics committee of the Department of Neurosurgery, Fondazione Policlinico Universitario A. Gemelli IRCCS, Rome (Prot. ID 2253 and 3782). All the authors confirm that the maximal tumour size/burden was not exceeded that permitted by the ethics committee. All patient data were collected anonymously, and the study adhered to Good Clinical Practice guidelines. The report does not present identifying images or other personal or clinical details of the participants that compromise anonymity. Consent for publication All the authors reached an agreement to publish the study in this journal. Competing interests The authors declare no competing interests. References 1. Gilbert MR Dignam JJ Armstrong TS Wefel JS Blumenthal DT Vogelbaum MA A randomized trial of bevacizumab for newly diagnosed glioblastoma N Engl J Med 2014 370 8 699 708 10.1056/NEJMoa1308573 24552317 PMC4201043 Gilbert MR, Dignam JJ, Armstrong TS, Wefel JS, Blumenthal DT, Vogelbaum MA, et al. A randomized trial of bevacizumab for newly diagnosed glioblastoma. N Engl J Med. 2014;370(8):699–708. 24552317 10.1056/NEJMoa1308573 PMC4201043 2. Medikonda R Dunn G Rahman M Fecci P Lim M A review of glioblastoma immunotherapy J Neurooncol 2021 151 1 41 53 10.1007/s11060-020-03448-1 32253714 Medikonda R, Dunn G, Rahman M, Fecci P, Lim M. A review of glioblastoma immunotherapy. J Neurooncol. 2021;151(1):41–53. 32253714 10.1007/s11060-020-03448-1 3. Saran F Chinot OL Henriksson R Mason W Wick W Cloughesy T Bevacizumab, temozolomide, and radiotherapy for newly diagnosed glioblastoma: comprehensive safety results during and after first-line therapy Neuro Oncol 2016 18 7 991 1001 10.1093/neuonc/nov300 26809751 PMC4896538 Saran F, Chinot OL, Henriksson R, Mason W, Wick W, Cloughesy T, et al. Bevacizumab, temozolomide, and radiotherapy for newly diagnosed glioblastoma: comprehensive safety results during and after first-line therapy. Neuro Oncol. 2016;18(7):991–1001. 26809751 10.1093/neuonc/nov300 PMC4896538 4. Szopa W Burley TA Kramer-Marek G Kaspera W Diagnostic and Therapeutic Biomarkers in Glioblastoma: Current Status and Future Perspectives Biomed Res Int 2017 2017 8013575 10.1155/2017/8013575 28316990 PMC5337853 Szopa W, Burley TA, Kramer-Marek G, Kaspera W. Diagnostic and Therapeutic Biomarkers in Glioblastoma: Current Status and Future Perspectives. Biomed Res Int. 2017;2017:8013575. 28316990 10.1155/2017/8013575 PMC5337853 5. Ferrara N Gerber HP LeCouter J The biology of VEGF and its receptors Nat Med 2003 9 6 669 676 10.1038/nm0603-669 12778165 Ferrara N, Gerber HP, LeCouter J. The biology of VEGF and its receptors. Nat Med. 2003;9(6):669–76. 12778165 10.1038/nm0603-669 6. Liao D Johnson RS Hypoxia: a key regulator of angiogenesis in cancer Cancer Metastasis Rev 2007 26 2 281 290 10.1007/s10555-007-9066-y 17603752 Liao D, Johnson RS. Hypoxia: a key regulator of angiogenesis in cancer. Cancer Metastasis Rev. 2007;26(2):281–90. 17603752 10.1007/s10555-007-9066-y 7. Wick W Gorlia T Bendszus M Taphoorn M Sahm F Harting I Lomustine and bevacizumab in progressive glioblastoma N Engl J Med 2017 377 20 1954 1963 10.1056/NEJMoa1707358 29141164 Wick W, Gorlia T, Bendszus M, Taphoorn M, Sahm F, Harting I, et al. Lomustine and bevacizumab in progressive glioblastoma. N Engl J Med. 2017;377(20):1954–63. 29141164 10.1056/NEJMoa1707358 8. Ballato M Germana E Ricciardi G Giordano WG Tralongo P Buccarelli M Understanding neovascularization in glioblastoma: insights from the current literature Int J Mol Sci 2025 10.3390/ijms26062763 40141406 PMC11943220 Ballato M, Germana E, Ricciardi G, Giordano WG, Tralongo P, Buccarelli M, et al. Understanding neovascularization in glioblastoma: insights from the current literature. Int J Mol Sci. 2025. 10.3390/ijms26062763. 40141406 10.3390/ijms26062763 PMC11943220 9. Chen C He ZC Shi Y Zhou W Zhang X Xiao HL Microvascular fractal dimension predicts prognosis and response to chemotherapy in glioblastoma: an automatic image analysis study Lab Invest 2018 98 7 924 934 10.1038/s41374-018-0055-2 29765109 Chen C, He ZC, Shi Y, Zhou W, Zhang X, Xiao HL, et al. Microvascular fractal dimension predicts prognosis and response to chemotherapy in glioblastoma: an automatic image analysis study. Lab Invest. 2018;98(7):924–34. 29765109 10.1038/s41374-018-0055-2 10. Lathia JD Mack SC Mulkearns-Hubert EE Valentim CL Rich JN Cancer stem cells in glioblastoma Genes Dev 2015 29 12 1203 1217 10.1101/gad.261982.115 26109046 PMC4495393 Lathia JD, Mack SC, Mulkearns-Hubert EE, Valentim CL, Rich JN. Cancer stem cells in glioblastoma. Genes Dev. 2015;29(12):1203–17. 26109046 10.1101/gad.261982.115 PMC4495393 11. Ricci-Vitiani L Pallini R Biffoni M Todaro M Invernici G Cenci T Tumour vascularization via endothelial differentiation of glioblastoma stem-like cells Nature 2010 468 7325 824 828 10.1038/nature09557 21102434 Ricci-Vitiani L, Pallini R, Biffoni M, Todaro M, Invernici G, Cenci T, et al. Tumour vascularization via endothelial differentiation of glioblastoma stem-like cells. Nature. 2010;468(7325):824–8. 21102434 10.1038/nature09557 12. Shahzad U Krumholtz S Rutka JT Das S Noncoding RNAs in glioblastoma: emerging biological concepts and potential therapeutic implications Cancers (Basel) 2021 10.3390/cancers13071555 33800703 PMC8037102 Shahzad U, Krumholtz S, Rutka JT, Das S. Noncoding RNAs in glioblastoma: emerging biological concepts and potential therapeutic implications. Cancers (Basel). 2021. 10.3390/cancers13071555. 33800703 10.3390/cancers13071555 PMC8037102 13. Cao T Zhou Q Li F Wang M Zhang M Li X Dual-specific phosphatases-8: a new target for clinical disease intervention J Transl Med 2025 23 1 485 10.1186/s12967-025-06499-y 40301852 PMC12042392 Cao T, Zhou Q, Li F, Wang M, Zhang M, Li X, et al. Dual-specific phosphatases-8: a new target for clinical disease intervention. J Transl Med. 2025;23(1):485. 40301852 10.1186/s12967-025-06499-y PMC12042392 14. Buccarelli M D'Alessandris QG Matarrese P Mollinari C Signore M Cappannini A Elesclomol-induced increase of mitochondrial reactive oxygen species impairs glioblastoma stem-like cell survival and tumor growth J Exp Clin Cancer Res 2021 40 1 228 10.1186/s13046-021-02031-4 34253243 PMC8273992 Buccarelli M, D’Alessandris QG, Matarrese P, Mollinari C, Signore M, Cappannini A, et al. Elesclomol-induced increase of mitochondrial reactive oxygen species impairs glioblastoma stem-like cell survival and tumor growth. J Exp Clin Cancer Res. 2021;40(1):228. 34253243 10.1186/s13046-021-02031-4 PMC8273992 15. Castellani G Buccarelli M D'Alessandris QG Ilari R Cappannini A Pedini F Extracellular vesicles produced by irradiated endothelial or glioblastoma stem cells promote tumor growth and vascularization modulating tumor microenvironment Cancer Cell Int 2024 24 1 72 10.1186/s12935-024-03253-0 38347567 PMC10863174 Castellani G, Buccarelli M, D’Alessandris QG, Ilari R, Cappannini A, Pedini F, et al. Extracellular vesicles produced by irradiated endothelial or glioblastoma stem cells promote tumor growth and vascularization modulating tumor microenvironment. Cancer Cell Int. 2024;24(1):72. 38347567 10.1186/s12935-024-03253-0 PMC10863174 16. Ricci-Vitiani L Pedini F Mollinari C Condorelli G Bonci D Bez A Absence of caspase 8 and high expression of PED protect primitive neural cells from cell death J Exp Med 2004 200 10 1257 1266 10.1084/jem.20040921 15545353 PMC2211918 Ricci-Vitiani L, Pedini F, Mollinari C, Condorelli G, Bonci D, Bez A, et al. Absence of caspase 8 and high expression of PED protect primitive neural cells from cell death. J Exp Med. 2004;200(10):1257–66. 15545353 10.1084/jem.20040921 PMC2211918 17. Levati L Tabolacci C Facchiano A Facchiano F Alvino E Antonini Cappellini GC Circulating interleukin-8 and osteopontin are promising biomarkers of clinical outcomes in advanced melanoma patients treated with targeted therapy J Exp Clin Cancer Res 2024 43 1 226 10.1186/s13046-024-03151-3 39143551 PMC11325673 Levati L, Tabolacci C, Facchiano A, Facchiano F, Alvino E, Antonini Cappellini GC, et al. Circulating interleukin-8 and osteopontin are promising biomarkers of clinical outcomes in advanced melanoma patients treated with targeted therapy. J Exp Clin Cancer Res. 2024;43(1):226. 39143551 10.1186/s13046-024-03151-3 PMC11325673 18. Sidney LE Branch MJ Dunphy SE Dua HS Hopkinson A Concise review: evidence for CD34 as a common marker for diverse progenitors Stem Cells 2014 32 6 1380 1389 10.1002/stem.1661 24497003 PMC4260088 Sidney LE, Branch MJ, Dunphy SE, Dua HS, Hopkinson A. Concise review: evidence for CD34 as a common marker for diverse progenitors. Stem Cells. 2014;32(6):1380–9. 24497003 10.1002/stem.1661 PMC4260088 19. Kozomara A Birgaoanu M Griffiths-Jones S miRBase: from microrna sequences to function Nucleic Acids Res 2019 47 D1 D155 D162 10.1093/nar/gky1141 30423142 PMC6323917 Kozomara A, Birgaoanu M, Griffiths-Jones S. miRBase: from microrna sequences to function. Nucleic Acids Res. 2019;47(D1):D155–62. 30423142 10.1093/nar/gky1141 PMC6323917 20. Patterson KI Brummer T O'Brien PM Daly RJ Dual-specificity phosphatases: critical regulators with diverse cellular targets Biochem J 2009 418 3 475 489 10.1042/BJ20082234 19228121 Patterson KI, Brummer T, O’Brien PM, Daly RJ. Dual-specificity phosphatases: critical regulators with diverse cellular targets. Biochem J. 2009;418(3):475–89. 19228121 10.1042/bj20082234 21. Caunt CJ Keyse SM Dual-specificity MAP kinase phosphatases (MKPs): shaping the outcome of MAP kinase signalling FEBS J 2013 280 2 489 504 10.1111/j.1742-4658.2012.08716.x 22812510 PMC3594966 Caunt CJ, Keyse SM. Dual-specificity MAP kinase phosphatases (MKPs): shaping the outcome of MAP kinase signalling. FEBS J. 2013;280(2):489–504. 22812510 10.1111/j.1742-4658.2012.08716.x PMC3594966 22. Harding A Cortez-Toledo E Magner NL Beegle JR Coleal-Bergum DP Hao D Highly efficient differentiation of endothelial cells from pluripotent stem cells requires the MAPK and the PI3K pathways Stem Cells 2017 35 4 909 919 10.1002/stem.2577 28248004 Harding A, Cortez-Toledo E, Magner NL, Beegle JR, Coleal-Bergum DP, Hao D, et al. Highly efficient differentiation of endothelial cells from pluripotent stem cells requires the MAPK and the PI3K pathways. Stem Cells. 2017;35(4):909–19. 28248004 10.1002/stem.2577 23. Biau J Thivat E Chautard E Stefan D Boone M Chauffert B Phase 1 trial of ralimetinib (LY2228820) with radiotherapy plus concomitant temozolomide in the treatment of newly diagnosed glioblastoma Radiother Oncol 2021 154 227 234 10.1016/j.radonc.2020.09.036 32976869 Biau J, Thivat E, Chautard E, Stefan D, Boone M, Chauffert B, et al. Phase 1 trial of ralimetinib (LY2228820) with radiotherapy plus concomitant temozolomide in the treatment of newly diagnosed glioblastoma. Radiother Oncol. 2021;154:227–34. 32976869 10.1016/j.radonc.2020.09.036 24. Sigaud R Rosch L Gatzweiler C Benzel J von Soosten L Peterziel H The first-in-class ERK inhibitor ulixertinib shows promising activity in mitogen-activated protein kinase (MAPK)-driven pediatric low-grade glioma models Neuro Oncol 2023 25 3 566 579 10.1093/neuonc/noac183 35882450 PMC10013652 Sigaud R, Rosch L, Gatzweiler C, Benzel J, von Soosten L, Peterziel H, et al. The first-in-class ERK inhibitor ulixertinib shows promising activity in mitogen-activated protein kinase (MAPK)-driven pediatric low-grade glioma models. Neuro Oncol. 2023;25(3):566–79. 35882450 10.1093/neuonc/noac183 PMC10013652 25. Lalancette E Cantin E Routhier ME Mailloux C Bertrand MC Kiaei DS Impact of trametinib on the neuropsychological profile of NF1 patients J Neurooncol 2024 167 3 447 454 10.1007/s11060-024-04624-3 38443693 Lalancette E, Cantin E, Routhier ME, Mailloux C, Bertrand MC, Kiaei DS, et al. Impact of trametinib on the neuropsychological profile of NF1 patients. J Neurooncol. 2024;167(3):447–54. 38443693 10.1007/s11060-024-04624-3 26. Itoh M Tohda S Effects of ERK1/2 inhibitors on the growth of acute leukemia cells Anticancer Res 2024 44 12 5263 5270 10.21873/anticanres.17354 39626905 Itoh M, Tohda S. Effects of ERK1/2 inhibitors on the growth of acute leukemia cells. Anticancer Res. 2024;44(12):5263–70. 39626905 10.21873/anticanres.17354 27. Bhattacharjee D Bakar J Chitnis SP Sausville EL Ashtekar KD Mendelson BE Inhibition of a lower potency target drives the anticancer activity of a clinical p38 inhibitor Cell Chem Biol. 2023 30 10 1211 22 e5 10.1016/j.chembiol.2023.09.013 37827156 PMC10715717 Bhattacharjee D, Bakar J, Chitnis SP, Sausville EL, Ashtekar KD, Mendelson BE, et al. Inhibition of a lower potency target drives the anticancer activity of a clinical p38 inhibitor. Cell Chem Biol. 2023;30(10):1211-22 e5. 37827156 10.1016/j.chembiol.2023.09.013 PMC10715717 28. Lai Y Lu X Liao Y Ouyang P Wang H Zhang X Crosstalk between glioblastoma and tumor microenvironment drives proneural-mesenchymal transition through ligand-receptor interactions Genes Dis 2024 11 2 874 889 10.1016/j.gendis.2023.05.025 37692522 PMC10491977 Lai Y, Lu X, Liao Y, Ouyang P, Wang H, Zhang X, et al. Crosstalk between glioblastoma and tumor microenvironment drives proneural-mesenchymal transition through ligand-receptor interactions. Genes Dis. 2024;11(2):874–89. 37692522 10.1016/j.gendis.2023.05.025 PMC10491977 29. Nowacka A, Sniegocki M, Smuczynski W, Bozilow D, Ziolkowska E. Angiogenesis in Glioblastoma-Treatment Approaches. Cells. 2025;14(6):407. 10.3390/cells14060407 PMC11941181 40136656 30. Reardon DA Turner S Peters KB Desjardins A Gururangan S Sampson JH A review of VEGF/VEGFR-targeted therapeutics for recurrent glioblastoma J Natl Compr Canc Netw 2011 9 4 414 427 10.6004/jnccn.2011.0038 21464146 PMC3399727 Reardon DA, Turner S, Peters KB, Desjardins A, Gururangan S, Sampson JH, et al. A review of VEGF/VEGFR-targeted therapeutics for recurrent glioblastoma. J Natl Compr Canc Netw. 2011;9(4):414–27. 21464146 10.6004/jnccn.2011.0038 PMC3399727 31. Sovrea AS, Bosca B, Melincovici CS, Constantin AM, Crintea A, Marginean M, et al. Multiple Faces of the Glioblastoma Microenvironment. Int J Mol Sci. 2022;23(2):595. 10.3390/ijms23020595 PMC8775531 35054779 32. Sousa F Dhaliwal HK Gattacceca F Sarmento B Amiji MM Enhanced anti-angiogenic effects of bevacizumab in glioblastoma treatment upon intranasal administration in polymeric nanoparticles J Control Release 2019 309 37 47 10.1016/j.jconrel.2019.07.033 31344424 Sousa F, Dhaliwal HK, Gattacceca F, Sarmento B, Amiji MM. Enhanced anti-angiogenic effects of bevacizumab in glioblastoma treatment upon intranasal administration in polymeric nanoparticles. J Control Release. 2019;309:37–47. 31344424 10.1016/j.jconrel.2019.07.033 33. Duan C He B Wang Y Liu W Bao W Yu L Stanniocalcin-1 promotes temozolomide resistance of glioblastoma through regulation of MGMT Sci Rep 2024 14 1 20199 10.1038/s41598-024-68902-w 39215105 PMC11364827 Duan C, He B, Wang Y, Liu W, Bao W, Yu L, et al. Stanniocalcin-1 promotes temozolomide resistance of glioblastoma through regulation of MGMT. Sci Rep. 2024;14(1):20199. 39215105 10.1038/s41598-024-68902-w PMC11364827 34. Mustafa DA Dekker LJ Stingl C Kremer A Stoop M Sillevis Smitt PA A proteome comparison between physiological angiogenesis and angiogenesis in glioblastoma Mol Cell Proteomics 2012 11 6 M111008466 10.1074/mcp.M111.008466 PMC3433895 22278369 Mustafa DA, Dekker LJ, Stingl C, Kremer A, Stoop M, Sillevis Smitt PA, et al. A proteome comparison between physiological angiogenesis and angiogenesis in glioblastoma. Mol Cell Proteomics. 2012;11(6):M111008466. 10.1074/mcp.M111.008466 PMC3433895 22278369 35. Ricci-Vitiani L Pallini R Larocca LM Lombardi DG Signore M Pierconti F Mesenchymal differentiation of glioblastoma stem cells Cell Death Differ 2008 15 9 1491 1498 10.1038/cdd.2008.72 18497759 Ricci-Vitiani L, Pallini R, Larocca LM, Lombardi DG, Signore M, Pierconti F, et al. Mesenchymal differentiation of glioblastoma stem cells. Cell Death Differ. 2008;15(9):1491–8. 18497759 10.1038/cdd.2008.72 36. Zandi Z Kashani B Alishahi Z Pourbagheri-Sigaroodi A Esmaeili F Ghaffari SH Dual-specificity phosphatases: therapeutic targets in cancer therapy resistance J Cancer Res Clin Oncol 2022 148 1 57 70 10.1007/s00432-021-03874-2 34981193 PMC11800885 Zandi Z, Kashani B, Alishahi Z, Pourbagheri-Sigaroodi A, Esmaeili F, Ghaffari SH, et al. Dual-specificity phosphatases: therapeutic targets in cancer therapy resistance. J Cancer Res Clin Oncol. 2022;148(1):57–70. 34981193 10.1007/s00432-021-03874-2 PMC11800885 37. Erreni M Solinas G Brescia P Osti D Zunino F Colombo P Human glioblastoma tumours and neural cancer stem cells express the chemokine CX3CL1 and its receptor CX3CR1 Eur J Cancer 2010 46 18 3383 3392 10.1016/j.ejca.2010.07.022 20728344 Erreni M, Solinas G, Brescia P, Osti D, Zunino F, Colombo P, et al. Human glioblastoma tumours and neural cancer stem cells express the chemokine CX3CL1 and its receptor CX3CR1. Eur J Cancer. 2010;46(18):3383–92. 20728344 10.1016/j.ejca.2010.07.022 38. Ahluwalia MS Bou-Anak S Burgett ME Sarmey N Khosla D Dahiya S Correlation of higher levels of soluble TNF-R1 with a shorter survival, independent of age, in recurrent glioblastoma J Neurooncol 2017 131 3 449 458 10.1007/s11060-016-2319-2 27858267 PMC5352462 Ahluwalia MS, Bou-Anak S, Burgett ME, Sarmey N, Khosla D, Dahiya S, et al. Correlation of higher levels of soluble TNF-R1 with a shorter survival, independent of age, in recurrent glioblastoma. J Neurooncol. 2017;131(3):449–58. 27858267 10.1007/s11060-016-2319-2 PMC5352462 39. Luo CH Shi Y Liu YQ Liu Q Mao M Luo M High levels of TIMP1 are associated with increased extracellular matrix stiffness in isocitrate dehydrogenase 1-wild type gliomas Lab Invest 2022 102 12 1304 1313 10.1038/s41374-022-00825-4 35882906 Luo CH, Shi Y, Liu YQ, Liu Q, Mao M, Luo M, et al. High levels of TIMP1 are associated with increased extracellular matrix stiffness in isocitrate dehydrogenase 1-wild type gliomas. Lab Invest. 2022;102(12):1304–13. 35882906 10.1038/s41374-022-00825-4 40. Kim ES Choi YE Hwang SJ Han YH Park MJ Bae IH IL-4, a direct target of miR-340/429, is involved in radiation-induced aggressive tumor behavior in human carcinoma cells Oncotarget 2016 7 52 86836 86856 10.18632/oncotarget.13561 27895317 PMC5349958 Kim ES, Choi YE, Hwang SJ, Han YH, Park MJ, Bae IH. IL-4, a direct target of miR-340/429, is involved in radiation-induced aggressive tumor behavior in human carcinoma cells. Oncotarget. 2016;7(52):86836–56. 27895317 10.18632/oncotarget.13561 PMC5349958 41. Gaggianesi M Turdo A Chinnici A Lipari E Apuzzo T Benfante A IL4 primes the dynamics of breast cancer progression via DUSP4 inhibition Cancer Res 2017 77 12 3268 3279 10.1158/0008-5472.CAN-16-3126 28400477 Gaggianesi M, Turdo A, Chinnici A, Lipari E, Apuzzo T, Benfante A, et al. IL4 primes the dynamics of breast cancer progression via DUSP4 inhibition. Cancer Res. 2017;77(12):3268–79. 28400477 10.1158/0008-5472.CAN-16-3126 42. Lin YM Jan HJ Lee CC Tao HY Shih YL Wei HW Dexamethasone reduced invasiveness of human malignant glioblastoma cells through a MAPK phosphatase-1 (MKP-1) dependent mechanism Eur J Pharmacol 2008 593 1–3 1 9 10.1016/j.ejphar.2008.06.111 18652821 Lin YM, Jan HJ, Lee CC, Tao HY, Shih YL, Wei HW, et al. Dexamethasone reduced invasiveness of human malignant glioblastoma cells through a MAPK phosphatase-1 (MKP-1) dependent mechanism. Eur J Pharmacol. 2008;593(1–3):1–9. 18652821 10.1016/j.ejphar.2008.06.111 43. Waha A Felsberg J Hartmann W von dem Knesebeck A Mikeska T Joos S Epigenetic downregulation of mitogen-activated protein kinase phosphatase MKP-2 relieves its growth suppressive activity in glioma cells Cancer Res 2010 70 4 1689 1699 10.1158/0008-5472.CAN-09-3218 20124482 Waha A, Felsberg J, Hartmann W, von dem Knesebeck A, Mikeska T, Joos S, et al. Epigenetic downregulation of mitogen-activated protein kinase phosphatase MKP-2 relieves its growth suppressive activity in glioma cells. Cancer Res. 2010;70(4):1689–99. 20124482 10.1158/0008-5472.CAN-09-3218 44. Patterson KI Brummer T Daly RJ O'Brien PM DUSP26 negatively affects the proliferation of epithelial cells, an effect not mediated by dephosphorylation of MAPKs Biochim Biophys Acta 2010 1803 9 1003 1012 10.1016/j.bbamcr.2010.03.014 20347885 Patterson KI, Brummer T, Daly RJ, O’Brien PM. DUSP26 negatively affects the proliferation of epithelial cells, an effect not mediated by dephosphorylation of MAPKs. Biochim Biophys Acta. 2010;1803(9):1003–12. 20347885 10.1016/j.bbamcr.2010.03.014 45. Messina S Frati L Leonetti C Zuchegna C Di Zazzo E Calogero A Dual-specificity phosphatase DUSP6 has tumor-promoting properties in human glioblastomas Oncogene 2011 30 35 3813 3820 10.1038/onc.2011.99 21499306 Messina S, Frati L, Leonetti C, Zuchegna C, Di Zazzo E, Calogero A, et al. Dual-specificity phosphatase DUSP6 has tumor-promoting properties in human glioblastomas. Oncogene. 2011;30(35):3813–20. 21499306 10.1038/onc.2011.99 ",
  "metadata": {
    "Title of this paper": "Dual-specificity phosphatase DUSP6 has tumor-promoting properties in human glioblastomas",
    "Journal it was published in:": "Journal of Experimental & Clinical Cancer Research : CR",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486788/"
  }
}