{
  "title": "Paper_295",
  "abstract": "pmc BMC Pregnancy Childbirth BMC Pregnancy Childbirth 61 bmcpcnc BMC Pregnancy and Childbirth 1471-2393 BMC PMC12486569 PMC12486569.1 12486569 12486569 41029515 10.1186/s12884-025-08065-2 8065 1 Research Expression and clinical significance of miR-377-3p and cyclin G2 in preeclampsia patients Niu Sanqiang 1 2 Yu Kangjun 1 Wang Weili 1 Li Wan 1 Liu Ning 1 Zhou Ping byliuning2022@163.com 2 1 https://ror.org/03xb04968 grid.186775.a 0000 0000 9490 772X Department of Obstetrics and Gynecology, Bozhou Hospital of Anhui Medical University, 2 https://ror.org/03t1yn780 grid.412679.f 0000 0004 1771 3402 Department of Obstetrics and Gynecology, Reproductive Medicine Center, The First Affiliated Hospital of Anhui Medical University, 30 9 2025 2025 25 478341 957 9 5 2024 14 8 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background and objectives Numerous studies have demonstrated that differentially expressed microRNA (miRNA) play a crucial role in the pathophysiology of preeclampsia (PE). These miRNA are central to ongoing investigations into the pathogenesis of PE. This study aims to investigate the relationship between changes in miR-377-3p and cell cyclin G2 (CCNG2) expression and the clinical features of PE, as well as to further analyze the effect of miR-377-3p on CCNG2. Methods A total of 120 pregnant subjects were recruited, consisting of 70 PE cases and 50 healthy pregnancies. The expression levels of miR-377-3p and CCNG2 mRNA were detected through RT-qPCR, while the protein expression of CCNG2 was examined via Western blot. The Pearson test was employed to analyze the relationship between miR-377-3p and CCNG2 mRNA expression and clinical parameters related to PE. The effect of miR-377-3p on CCNG2 was verified using a dual-luciferase reporter assay. Results Compared with normal controls, miR-377-3p was significantly down-regulated in PE plasma and placental tissues, while CCNG2 was up-regulated ( P P P P P P Conclusion The low expression of miR-377-3p, alongside the high expression of CCNG2 in the peripheral plasma and placental tissues of PE patients, may be linked to the onset of the condition. These findings suggest that miR-377-3p may contribute to the development of PE by regulating the expression of CCNG2. Supplementary Information The online version contains supplementary material available at 10.1186/s12884-025-08065-2. Keywords Preeclampsia miR-377-3p CCNG2 Plasma Placental tissue This work was supported by the Natural Science Foundation of Anhui Medical University 2021xkj094 Niu Sanqiang pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Preeclampsia (PE) is a common multisystem disorder in pregnant women and is associated with some of the highest rates of maternal and fetal morbidity and mortality, affecting approximately 8 million people and resulting in the deaths of 70,000 pregnant women worldwide each year [ 1 2 3 An increasing body of research has demonstrated that differentially expressed miRNAs play a significant role in the pathophysiology of PE [ 4 5 6 7 8 10 11 CCNG2 (cyclin G2), a non-classical cell cycle protein, has been identified as a tumor suppressor in various cancers and may serve as a significant prognostic biomarker [ 12 13 14 15 In this study, we examined the expression levels of miR-377-3p and CCNG2 in the plasma and placental tissue of PE patients compared to normal pregnant women. Additionally, we analyzed the relationship between these expression levels and the clinical characteristics of women with PE, while exploring the roles of miR-377-3p and CCNG2 in the pathogenesis of PE. These findings aim to provide new insights into the underlying mechanisms and potential therapeutic strategies for PE. Materials and methods Study subjects This study selected a total of 70 pregnant women with PE, 40 with mild PE (mPE) and 30 with severe PE (sPE), who were hospitalized and delivered in The Affiliated Bozhou Hospital of Anhui Medical University from January 2023 to January 2024. Fifty women with normal pregnancy who gave birth at the same time were used as the control group. Inclusion criteria included: (1) a full-term singleton pregnancy; (2) absence of any family history of genetic diseases; (3) no history of congenital heart disease, chronic hypertension, or hepatitis; (4) no conditions that would cause an altered immune response, which includes nephritis, cancer, systemic lupus erythematosus, and connective tissue diseases; (5) absence of any endocrine disorders, such as gestational diabetes mellitus, pre-pregnancy diabetes mellitus, and thyroid disorders; (6) no use of antihypertensive medications or aspirin prior to participation in the study. Exclusion criteria included: (1)pregnant women with two or more pregnancies; (2)pregnant women of advanced maternal age; (3)pregnant women who have undergone assisted reproductive techniques (including artificial insemination and in vitro fertilization); (4) patients experiencing serious infections during pregnancy; (5) cases of fetal chromosomal abnormalities or developmental anomalies confirmed through routine obstetric examinations; (6) patients who are uncooperative with treatment or follow-up. The diagnostic criteria and classification of PE are the guidelines for the diagnosis and treatment of hypertensive disorders in pregnancy formulated by the Chinese Medical Association Obstetrics and Gynecology Branch in 2015. The research subjects gave informed consent and signed the informed consent form, and this study gained approval from the Medical Ethics Association of The Affiliated Bozhou Hospital of Anhui Medical University (reference number by20221103). Specimen collection and processing A total of 3 ml of peripheral venous blood was collected from the subjects when they were admitted to the hospital for delivery. The blood sample was placed in an EDTA anticoagulant tube and centrifuged at 3000 r/min for 10 min. 400 μl of the plasma was extracted, placed in an EP tube, and frozen at − 80 °C. Two pieces of placental tissue of 1 cm × 1 cm × 1 cm were collected in 30 min after the placenta was delivered (the placenta tissue was taken from the placenta near the attachment of the umbilical cord, avoiding the areas of calcification and bleeding) and then placed in AllProtect™ reagent tissue protection solution (Shanghai Biyuntian Company, Shanghai, China). Cell culture and transfection Human trophoblast HTR-8/SVneo culture and treatment: HTR-8/SVneo cells were cultured with RPMI 1640 containing 10% fetal bovine serum, penicillin 1 × 10 5 2 4 Quantitative reverse transcription PCR (RT-qPCR) to detect the expression of related genes Plasma, placental tissue and cells total RNA was extracted using the TRIzol method. OD value was examined using the nucleic acid protein analyzer, and OD260/OD280 was calculated to measure the concentration and purity of the RNA samples. 1 μg of total RNA was taken as the template, and RNA was reverse-transcribed into cDNA in accordance with the instructions of Bestar® one step RT-qPCR kit (SYBR Green) (Shanghai Xinghan Biotechnology, Shanghai, China; order number: DBI-2223). Agilent Stratagene fluorescence quantitative PCR instrument Mx3000P quantitative analysis. Table 1 −ΔΔCt Table 1 Primer sequences Gene Primer Sequence (5′-3′) Annealing (°C) miR-377-3p Forward primer ATCACACAAAGGCAACTTTTGT 58 Reverse primer GGTGCAGGGTCCGAGGTAT U6 Forward primer CTCGCTTCGGCAGCACA 59 Reverse primer AACGCTTCACGAATTTGCGT CCNG2 Forward primer AATGAAGGTACAGCCCAAGCA 60 Reverse primer GCTTTGACTTTCCAACACACC β-action Forward primer GAGGCACTCTTCCAGCCTTC 59 Reverse primer GGATGTCCACGTCACATTC Detection of CCNG2 protein expression by Western Blot After 24 h of culture for each group of cells after transfection, the culture medium was discarded and lysed using RIPA lysis solution.For placental tissues, they were cut up and added to RIPA lysis solution and ground to make them fully lysed.The lysates were centrifuged at low temperature and high speed (4 °C, 12,000 r/min, 15 min). Next, the supernatant was extracted as the total protein. Finally, protein concentration was determined using the BCA protein quantification kit (Thermo Scientific, USA; order number: 23227). The protein loading amount was 40 μg. After the processes of electrophoresis (10% SDS-PAGE gel), the protein was transferred (75 V, 90 min) and blocked with 5% normal calf serum, and the rabbit anti-CCNG2 was diluted with primary antibody dilution (Abcam, Cambridge, UK; order number: ab203314, dilution 1:2000). The rabbit anti-a-Tublin was diluted with primary antibody diluent (Thermo Fisher, MA, USA, order number: 62204, dilution 1:1000). The membrane was placed in the diluted primary antibody and shaken in a refrigerator at 4 °C overnight. The anti-rabbit secondary antibody was diluted with TBST solution (dilution: 1:3000). After the membrane was incubated for 2 h at ambient temperature, the membrane was washed three times with TBST solution for 10 min each time. It was prepared for development, the gray value was examined after the sample was collected with an automatic electrophoresis gel imaging analyzer (Chemi Imager 5500, Alpha Innotech, USA). Dual-luciferase reporter assay Bioinformatics software, including TargetScan8.0 ( https://www.targetscan.org/vert_ https://rnasysu.com/encori https://www.mirbase.org/ 4 Statistical analysis Statistical analysis and graphing were conducted using SPSS 26.0 and graphpad prism 9.4. Quantitative data were expressed as mean ± SD, the difference of quantitative data between the two groups were analyzed by homogeneity test of variances, and the independent sample Student’s t-test was used for comparison between the two groups. If variances were homogeneous, one-way analysis of variance (ANOVA) was employed for comparison among three groups, and Bonferroni method was used for pairwise comparison among groups. If the variances were not homogeneous, the approximate F test (Welch’s method) was adopted, and the Dunnett's T3 method was used for pairwise comparison between groups. Correlation analysis was conducted using Pearson linear correlation analysis. P Results Baseline characteristics of the research subjects No significant difference was identified in age, gravidity, parity, pre-pregnancy body mass index (BMI), and gestational week between the control group and the mPE group and the sPE group. The systolic blood pressure (SBP) and diastolic blood pressure (DBP) in the control group, mPE group and sPE group tended to increase, and there were statistically significant differences between the three groups. In terms of pregnancy outcomes, the neonatal birth weight of the sPE group were lower than those of the control group and mPE group, and the difference was statistically significant, as depicted in Table 2 Table 2 Comparison of general data of pregnant women in two groups Characteristics Control group (n = 50) mPE group (n = 40) sPE group (n = 30) F/F’ p Maternal age (year) 29.02 ± 2.92 29.00 ± 3.33 28.57 ± 2.99 0.231 0.794 Gravidity (times) 1.96 ± 0.83 1.90 ± 0.84 1.93 ± 0.69 0.063 0.939 Parity (times) 0.84 ± 0.65 0.88 ± 0.72 0.83 ± 0.69 0.056 0.945 Pre-BMI(kg/m 2 23.94 ± 2.19 23.87 ± 1.56 23.52 ± 1.64 0.504 0.606 SBP (mmHg) 115.98 ± 10.28 148.22 ± 8.49* 168.43 ± 6.39* # 355.800 < 0.001 DBP (mmHg) 77.48 ± 5.47 99.60 ± 5.93* 108.87 ± 9.55* # 227.600 < 0.001 GW at delivery (week) 37.96 ± 0.98 37.86 ± 0.63 37.60 ± 0.91 1.664 0.194 Birth weight (g) 3362.20 ± 270.46 2985.75 ± 286.99* 2515.50 ± 143.91* # 388.200 < 0.001 mPE, mild preeclampsia; sPE, severe preeclampsia; Pre-BMI, pre-pregnancy body mass index; GW, gestational week; SBP, systolic blood pressure; DBP, diastolic blood pressure * P # P MiR-377-3p and CCNG2 mRNA expression in plasma and placental tissue The expression of miR-377-3p and CCNG2 mRNA in plasma and placental tissues was measured using RT-qPCR. As shown in Fig. 1 P 1 C P 1 D P P Fig. 1 Expression of miR-377-3p and CCNG2 mRNA in plasma and placental tissue. A B C D P P CCNG2 protein expression in placental tissue Compared with the control group, the expression of CCNG2 protein in the placenta tissue of PE pregnant women was significantly up-regulated, and the difference achieved statistical significance (Fig. 2 Fig. 2 Western blot detection of CCNG2 protein expression level in two groups of placenta. A B P Correlation analysis of miR-377-3p and CCNG2 with clinical features and pregnancy outcomes The expression of miR-377-3p in plasma and placenta was negatively correlated with SBP and DBP, whereas it was positively correlated with neonatal birth weight ( P P 3 Table 3 Correlation of miR-377-3p and CCNG2 with clinical features and pregnancy outcomes Characteristics miR-377-3p expression in plasma CCNG2 mRNA expression in plasma miR-377-3p expression in placenta CCNG2 mRNA expression in placenta r P r P r P R value SBP − 0.539 < 0.001 0.452 < 0001 − 0.552 < 0.001 0.432 < 0.001 DBP − 0.380 0.001 0.256 0.033 − 0.311 0.008 0.341 0.004 Birth weight 0.639 < 0.001 − 0.532 < 0.001 0.553 < 0.001 − 0.636 < 0.001 mPE, mild preeclampsia; sPE, severe preeclampsia; Pre-BMI, pre-pregnancy body mass index; SBP, systolic blood pressure; DBP, diastolic blood pressure Correlation analysis of miR-377-3p and CCNG2 mRNA expression in PE Further analysis using the Pearson test revealed a negative correlation between miR-377-3p and CCNG2 mRNA expression in both plasma and placental tissues of patients with PE. As miR-377-3p expression decreased, CCNG2 expression increased, indicating an inverse relationship between the two (Fig. 3 Fig. 3 Correlation of miR-377-3p and CCNG2 expression in preeclampsia. A B Validation of miR-377-3p targeting CCNG2 gene Three major databases—TargetScan8.0 ( https://www.targetscan.org/vert_80/ https://rnasysu.com/encori https://www.mirbase.org/ 16 4 4 4 P P Fig. 4 CCNG2 is a potential target gene for miR-377-3p in HTR-8/SVneo cells. A B C D E P Discussion PE is a pregnancy-specific disorder that affects multiple systems [ 17 18 19 20 Current research on miR-377-3p primarily focuses on oncology, with numerous studies highlighting its critical role in regulating tumor cell proliferation and invasion [ 21 22 23 24 11 11 25 26 CCNG2 is a non-canonical cyclin, with family members including cyclin I and cyclin G1. Unlike other cyclins, CCNG2 expression is upregulated in cells undergoing cycle arrest or terminal differentiation [ 27 13 28 29 14 Despite the growing interest in CCNG2, there are no reports to date on the role of miR-377-3p in regulating CCNG2 in preeclampsia. In this study, we observed a significant negative correlation between miR-377-3p and CCNG2 expression in the peripheral plasma and placental tissues of PE patients. This suggests that the reduced levels of miR-377-3p in in vivo PE pathology may lead to the upregulation of CCNG2 through the negative regulation of miRNA-target genes, contributing to the pathogenesis of PE. We further validated that CCNG2 is a target gene of miR-377-3p in HTR8/SVneo cells using bioinformatics tools and a classical dual-luciferase reporter gene assay. Sun et al. showed that CCNG2 overexpression inhibits migration, invasion, and the formation of endothelial-like networks in HTR8/SVneo cells [ 11 In conclusion, our study demonstrated that miR-377-3p and CCNG2 were negatively correlated in plasma and placental tissue of PE patients, and expression of miR-377-3p and CCNG2 were correlated with blood pressure and neonatal birth weight. Additionally, dual-luciferase reporter assays confirmed that CCNG2 is a direct target gene of miR-377-3p in HTR8/SVneo cells. These findings suggest that miR-377-3p may play a role in the development of PE by regulating CCNG2 expression, providing new insights into the pathogenesis of PE. This present study has certain shortcomings, particularly the insufficient exploration of the roles of miR-377-3p and CCNG2 in the pathogenesis of PE through both cell and animal experiments, which will be the focus of future research. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1. Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements Not applicable. Author contributions SQN, PZ contributed to the study concepts and study design; KJY contributed to the literature research; WLW WL contributed to the experimental studies and data acquisition; PZ contributed to the manuscript preparation. All authors read and approved the final manuscript. Funding This work was supported by the Natural Science Foundation of Anhui Medical University [2021xkj094]. Data availability All the data generated or analyzed during this study are included in this published article. Further data is available from the corresponding author upon reasonable request. Declarations Ethics approval and consent to participate The experiments were authorized by the academic ethics committee of Bozhou Clinical College of Anhui Medical University. All procedures were strictly implemented by the code of ethics. All the subjects involved were fully informed of the objective of the study and signed informed consent before sampling. The study was in accordance with the relevant guidelines and regulation. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Yang Y Le Ray I Zhu J Zhang J Hua J Reilly M Preeclampsia prevalence, risk factors, and pregnancy outcomes in Sweden and China JAMA Netw Open 2021 4 5 e218401 10.1001/jamanetworkopen.2021.8401 33970258 PMC8111481 Yang Y, Le Ray I, Zhu J, Zhang J, Hua J, Reilly M. Preeclampsia prevalence, risk factors, and pregnancy outcomes in Sweden and China. JAMA Netw Open. 2021;4(5):e218401. 33970258 10.1001/jamanetworkopen.2021.8401 PMC8111481 2. Bakrania BA George EM Granger JP Animal models of preeclampsia: investigating pathophysiology and therapeutic targets Am J Obstet Gynecol 2022 226 2S S973 S987 10.1016/j.ajog.2020.10.025 33722383 PMC8141071 Bakrania BA, George EM, Granger JP. Animal models of preeclampsia: investigating pathophysiology and therapeutic targets. Am J Obstet Gynecol. 2022;226(2S):S973–87. 33722383 10.1016/j.ajog.2020.10.025 PMC8141071 3. Chourdakis E Oikonomou N Fouzas S Hahalis G Karatza AA Preeclampsia emerging as a risk factor of cardiovascular disease in women High Blood Press Cardiovasc Prev 2021 28 2 103 114 10.1007/s40292-020-00425-7 33660234 Chourdakis E, Oikonomou N, Fouzas S, Hahalis G, Karatza AA. Preeclampsia emerging as a risk factor of cardiovascular disease in women. High Blood Press Cardiovasc Prev. 2021;28(2):103–14. 33660234 10.1007/s40292-020-00425-7 4. Zhou S Li J Yang W Xue P Yin Y Wang Y Noninvasive preeclampsia prediction using plasma cell-free RNA signatures Am J Obstet Gynecol 2023 229 5 553.e1 553.e16 10.1016/j.ajog.2023.05.015 37211139 Zhou S, Li J, Yang W, Xue P, Yin Y, Wang Y, et al. Noninvasive preeclampsia prediction using plasma cell-free RNA signatures. Am J Obstet Gynecol. 2023;229(5):553.e1-553.e16. 37211139 10.1016/j.ajog.2023.05.015 5. Mirzakhani H Handy DE Lu Z Oppenheimer B Litonjua AA Loscalzo J Integration of circulating microRNAs and transcriptome signatures identifies early-pregnancy biomarkers of preeclampsia Clin Transl Med 2023 13 11 e1446 10.1002/ctm2.1446 37905457 PMC10616748 Mirzakhani H, Handy DE, Lu Z, Oppenheimer B, Litonjua AA, Loscalzo J, et al. Integration of circulating microRNAs and transcriptome signatures identifies early-pregnancy biomarkers of preeclampsia. Clin Transl Med. 2023;13(11):e1446. 37905457 10.1002/ctm2.1446 PMC10616748 6. Li Z Wang J Li D Chen H Meng T miR-372-3p promotes preeclampsia progression by regulating twist1 Exp Ther Med 2022 24 6 723 10.3892/etm.2022.11659 36686218 PMC9834874 Li Z, Wang J, Li D, Chen H, Meng T. miR-372-3p promotes preeclampsia progression by regulating twist1. Exp Ther Med. 2022;24(6):723. 36686218 10.3892/etm.2022.11659 PMC9834874 7. Liu H Wang X Mir Cell Cycle 2022 21 18 1945 1957 10.1080/15384101.2022.2075644 35613309 PMC9415623 Liu H, Wang X. Mir 35613309 10.1080/15384101.2022.2075644 PMC9415623 8. Su S Zhong L Huang S Deng L Pang L MiRNA-494 induces trophoblast senescence by targeting SIRT1 Hypertens Pregnancy 2023 42 1 2219774 10.1080/10641955.2023.2219774 37278055 Su S, Zhong L, Huang S, Deng L, Pang L. MiRNA-494 induces trophoblast senescence by targeting SIRT1. Hypertens Pregnancy. 2023;42(1):2219774. 37278055 10.1080/10641955.2023.2219774 9. Hu S Li J Tong M MicroRNA-144-3p may participate in the pathogenesis of preeclampsia by targeting Cox-2 Mol Med Rep 2019 19 6 4655 4662 31059003 10.3892/mmr.2019.10150 PMC6522833 Hu S, Li J, Tong M, et al. MicroRNA-144-3p may participate in the pathogenesis of preeclampsia by targeting Cox-2. Mol Med Rep. 2019;19(6):4655–62. 31059003 10.3892/mmr.2019.10150 PMC6522833 10. Sun B Jiang T Yong J Peng J Dong S Gu Y Mir-135b-5p targets ADAM12 to suppress invasion and accelerate trophoblast apoptosis in preeclampsia Placenta 2023 143 69 79 10.1016/j.placenta.2023.10.004 37864886 Sun B, Jiang T, Yong J, Peng J, Dong S, Gu Y, et al. Mir-135b-5p targets ADAM12 to suppress invasion and accelerate trophoblast apoptosis in preeclampsia. Placenta. 2023;143:69–79. 37864886 10.1016/j.placenta.2023.10.004 11. Zhu XM Han T Sargent IL Yin GW Yao YQ Differential expression profile of microRNAs in human placentas from preeclamptic pregnancies vs normal pregnancies Am J Obstet Gynecol 2009 200 6 661.e1 661.e6617 10.1016/j.ajog.2008.12.045 19285651 Zhu XM, Han T, Sargent IL, Yin GW, Yao YQ. Differential expression profile of microRNAs in human placentas from preeclamptic pregnancies vs normal pregnancies. Am J Obstet Gynecol. 2009;200(6):661.e1-661.e6617. 19285651 10.1016/j.ajog.2008.12.045 12. Sun GG Zhang J Hu WN CCNG2 expression is downregulated in colorectal carcinoma and its clinical significance Tumour Biol 2014 35 4 3339 3346 10.1007/s13277-013-1440-5 24307622 Sun GG, Zhang J, Hu WN. CCNG2 expression is downregulated in colorectal carcinoma and its clinical significance. Tumour Biol. 2014;35(4):3339–46. 24307622 10.1007/s13277-013-1440-5 13. Li WJ Liu GL Yu F Xiang XX Lu YF Xiao HZ CCNG2 suppressor biological effects on thyroid cancer cell through promotion of CDK2 degradation Asian Pac J Cancer Prev 2013 14 10 6165 6171 10.7314/APJCP.2013.14.10.6165 24289643 Li WJ, Liu GL, Yu F, Xiang XX, Lu YF, Xiao HZ, et al. CCNG2 suppressor biological effects on thyroid cancer cell through promotion of CDK2 degradation. Asian Pac J Cancer Prev. 2013;14(10):6165–71. 24289643 10.7314/apjcp.2013.14.10.6165 14. Sun M Gao J Meng T Liu S Chen H Liu Q Cyclin G2 upregulation impairs migration, invasion, and network formation through RNF123/Dvl2/JNK signaling in the trophoblast cell line HTR8/SVneo, a possible role in preeclampsia FASEB J 2021 35 2 e21169 10.1096/fj.202001559RR 33205477 Sun M, Gao J, Meng T, Liu S, Chen H, Liu Q, et al. Cyclin G2 upregulation impairs migration, invasion, and network formation through RNF123/Dvl2/JNK signaling in the trophoblast cell line HTR8/SVneo, a possible role in preeclampsia. FASEB J. 2021;35(2):e21169. 33205477 10.1096/fj.202001559RR 15. Qin WJ Wang WP Wang XB Zhang XT Du JD Mir-1290 targets CCNG2 to promote the metastasis of oral squamous cell carcinoma Eur Rev Med Pharmacol Sci 2019 23 23 10332 10342 31841213 10.26355/eurrev_201912_19671 Qin WJ, Wang WP, Wang XB, Zhang XT, Du JD. Mir-1290 targets CCNG2 to promote the metastasis of oral squamous cell carcinoma. Eur Rev Med Pharmacol Sci. 2019;23(23):10332–42. 31841213 10.26355/eurrev_201912_19671 16. Mayor-Lynn K Toloubeydokhti T Cruz AC Chegini N Expression profile of microRNAs and mRNAs in human placentas from pregnancies complicated by preeclampsia and preterm labor Reprod Sci 2011 18 1 46 56 10.1177/1933719110374115 21079238 PMC3343068 Mayor-Lynn K, Toloubeydokhti T, Cruz AC, Chegini N. Expression profile of microRNAs and mRNAs in human placentas from pregnancies complicated by preeclampsia and preterm labor. Reprod Sci. 2011;18(1):46–56. 21079238 10.1177/1933719110374115 PMC3343068 17. Burwick RM Rodriguez MH Angiogenic biomarkers in preeclampsia Obstet Gynecol 2024 143 4 515 523 10.1097/AOG.0000000000005532 38350106 Burwick RM, Rodriguez MH. Angiogenic biomarkers in preeclampsia. Obstet Gynecol. 2024;143(4):515–23. 38350106 10.1097/AOG.0000000000005532 18. Cirkovic A Stanisavljevic D Milin-Lazovic J Rajovic N Pavlovic V Milicevic O Preeclamptic women have disrupted placental microRNA expression at the time of preeclampsia diagnosis: meta-analysis Front Bioeng Biotechnol 2021 9 782845 10.3389/fbioe.2021.782845 35004644 PMC8740308 Cirkovic A, Stanisavljevic D, Milin-Lazovic J, Rajovic N, Pavlovic V, Milicevic O, et al. Preeclamptic women have disrupted placental microRNA expression at the time of preeclampsia diagnosis: meta-analysis. Front Bioeng Biotechnol. 2021;9:782845. 35004644 10.3389/fbioe.2021.782845 PMC8740308 19. Bao S Zhou T Yan C Bao J Yang F Chao S A blood-based miRNA signature for early non-invasive diagnosis of preeclampsia BMC Med 2022 20 1 303 10.1186/s12916-022-02495-x 36096786 PMC9469544 Bao S, Zhou T, Yan C, Bao J, Yang F, Chao S, et al. A blood-based miRNA signature for early non-invasive diagnosis of preeclampsia. BMC Med. 2022;20(1):303. 36096786 10.1186/s12916-022-02495-x PMC9469544 20. Yuan Y Wang X Sun Q Dai X Cai Y Microrna-16 is involved in the pathogenesis of pre-eclampsia via regulation of Notch2 J Cell Physiol 2020 235 5 4530 4544 10.1002/jcp.29330 31643078 Yuan Y, Wang X, Sun Q, Dai X, Cai Y. Microrna-16 is involved in the pathogenesis of pre-eclampsia via regulation of Notch2. J Cell Physiol. 2020;235(5):4530–44. 31643078 10.1002/jcp.29330 21. Hua J Wang X Ma L Li J Cao G Zhang S Circvapa promotes small cell lung cancer progression by modulating the miR-377-3p and miR-494-3p/IGF1R/AKT axis Mol Cancer 2022 21 1 123 10.1186/s12943-022-01595-9 35668527 PMC9172052 Hua J, Wang X, Ma L, Li J, Cao G, Zhang S, et al. Circvapa promotes small cell lung cancer progression by modulating the miR-377-3p and miR-494-3p/IGF1R/AKT axis. Mol Cancer. 2022;21(1):123. 35668527 10.1186/s12943-022-01595-9 PMC9172052 22. Wang R Ma Y Yu D Zhao J Ma P miR-377 functions as a tumor suppressor in human clear cell renal cell carcinoma by targeting ETS1 Biomed Pharmacother 2015 70 64 71 10.1016/j.biopha.2015.01.012 25776481 Wang R, Ma Y, Yu D, Zhao J, Ma P. miR-377 functions as a tumor suppressor in human clear cell renal cell carcinoma by targeting ETS1. Biomed Pharmacother. 2015;70:64–71. 25776481 10.1016/j.biopha.2015.01.012 23. Chang W Liu M Xu J Fu H Zhou B Yuan T Mir-377 inhibits the proliferation of pancreatic cancer by targeting Pim-3 Tumour Biol 2016 37 11 14813 14824 10.1007/s13277-016-5295-4 27638830 Chang W, Liu M, Xu J, Fu H, Zhou B, Yuan T, et al. Mir-377 inhibits the proliferation of pancreatic cancer by targeting Pim-3. Tumour Biol. 2016;37(11):14813–24. 27638830 10.1007/s13277-016-5295-4 24. Zhang J Zhao M Xue ZQ Liu Y Wang YX MiR-377 inhibited tumorous behaviors of non-small cell lung cancer through directly targeting CDK6 Eur Rev Med Pharmacol Sci 2016 20 21 4494 4499 27874949 Zhang J, Zhao M, Xue ZQ, Liu Y, Wang YX. MiR-377 inhibited tumorous behaviors of non-small cell lung cancer through directly targeting CDK6. Eur Rev Med Pharmacol Sci. 2016;20(21):4494–9. 27874949 25. Wang H Wei Z Li H MiR-377-3p inhibits atherosclerosis-associated vascular smooth muscle cell proliferation and migration via targeting neuropilin2 Biosci Rep 2020 40 6 BSR20193425 10.1042/BSR20193425 32373927 PMC7295640 Wang H, Wei Z, Li H, et al. MiR-377-3p inhibits atherosclerosis-associated vascular smooth muscle cell proliferation and migration via targeting neuropilin2. Biosci Rep. 2020;40(6):BSR20193425. 32373927 10.1042/BSR20193425 PMC7295640 26. Weiner E Feldstein O Tamayev L Grinstein E Barber E Bar J Schreiber L Placental histopathological lesions in correlation with neonatal outcome in preeclampsia with and without severe features Pregnancy Hypertens 2018 12 6 10 10.1016/j.preghy.2018.02.001 29674201 Weiner E, Feldstein O, Tamayev L, Grinstein E, Barber E, Bar J, Schreiber L, et al. Placental histopathological lesions in correlation with neonatal outcome in preeclampsia with and without severe features. Pregnancy Hypertens. 2018;12:6–10. 29674201 10.1016/j.preghy.2018.02.001 27. Sun GG Hu WN Cui DW Zhang J Decreased expression of CCNG2 is significantly linked to the malignant transformation of gastric carcinoma Tumour Biol 2014 35 3 2631 2639 10.1007/s13277-013-1346-2 24248541 Sun GG, Hu WN, Cui DW, Zhang J. Decreased expression of CCNG2 is significantly linked to the malignant transformation of gastric carcinoma. Tumour Biol. 2014;35(3):2631–9. 24248541 10.1007/s13277-013-1346-2 28. Chen JQ Liu CJ Wen HX Shi CL Zhang HS Li M Sun GG Changes in the expression of cyclin G2 in esophageal cancer cell and its significance Tumour Biol 2014 35 4 3355 3362 10.1007/s13277-013-1442-3 24297335 Chen JQ, Liu CJ, Wen HX, Shi CL, Zhang HS, Li M, Sun GG. Changes in the expression of cyclin G2 in esophageal cancer cell and its significance. Tumour Biol. 2014;35(4):3355–62. 24297335 10.1007/s13277-013-1442-3 29. Cui DW Cheng YJ Jing SW Sun GG Effect of cyclin G2 on proliferative ability of prostate cancer PC-3 cell Tumour Biol 2014 35 4 3017 3024 10.1007/s13277-013-1389-4 24293374 Cui DW, Cheng YJ, Jing SW, Sun GG. Effect of cyclin G2 on proliferative ability of prostate cancer PC-3 cell. Tumour Biol. 2014;35(4):3017–24. 24293374 10.1007/s13277-013-1389-4 ",
  "metadata": {
    "Title of this paper": "Effect of cyclin G2 on proliferative ability of prostate cancer PC-3 cell",
    "Journal it was published in:": "BMC Pregnancy and Childbirth",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486569/"
  }
}