{
  "title": "Paper_50",
  "abstract": "pmc Invest Ophthalmol Vis Sci Invest Ophthalmol Vis Sci 1229 iovs IOVS Investigative Ophthalmology & Visual Science 0146-0404 1552-5783 Association for Research in Vision and Ophthalmology PMC12489863 PMC12489863.1 12489863 12489863 41025872 10.1167/iovs.66.12.71 IOVS-24-42373 1 Biochemistry and Molecular Biology Biochemistry and Molecular Biology Exploring the Interplay Between Hyperthermia and Cytotoxic Drugs in Ocular Melanoma Cell Lines: Implications and Variability in Treatment Efficiency Hyperthermia and Chemotherapeutics in Ocular Melanoma Blersch Pascal-Raphael  1 Hoyer Torsten  1  2 Alexiou Christoph  2 Heindl Ludwig M.  5 Gostian Antoniu-Oreste  3  4 Lyer Stefan  1 1 2 3 4 5 * Pascal-raphael.blersch@uk-erlangen.de 30 9 2025 9 2025 66 12 496268 71 05 9 2025 03 2 2025 30 09 2025 03 10 2025 03 10 2025 Copyright 2025 The Authors 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This work is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License. Purpose Uveal and conjunctival melanomas are rare ocular malignancies that present significant diagnostic and therapeutic challenges. This study investigates the efficacy of combining hyperthermic treatments with chemotherapeutics, such as cisplatin, docetaxel, and mitoxantrone, to develop more effective therapies for specific melanoma subtypes, aiming to overcome the limitations of traditional approaches. Methods The study used hyperthermia by exposing melanoma cell lines to temperatures of 42°C, 45°C, and 47°C for 1 hour. Alongside hyperthermia, cytotoxic drugs were applied at different concentrations to assess their combined effects on cell proliferation and viability. Expression of heat shock proteins was evaluated by immunocytochemistry stainings and Western blots. Results Findings reveal that certain melanoma cell lines exhibited increased proliferation at 42°C without a significant decrease in cell confluence. Conversely, temperatures of 45°C and above significantly impaired cell viability. Comparative statistical analysis suggests synergistic effects when combining mild to elevated hyperthermia with cisplatin and mitoxantrone, and to some extent with docetaxel. Conclusions This study serves as preliminary work for the inclusion of superparamagnetic iron oxide nanoparticles functionalized with cytotoxic drugs, which may present a promising therapeutic strategy for treating ocular melanomas. Although further research is necessary, this approach has the potential to significantly advance the treatment landscape for these ocular malignancies, offering a targeted, effective, and minimally invasive option for patients. hyperthermia uvea conjunctiva cytotoxic drugs oncology pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Uveal and conjunctival melanomas, although rare, present significant diagnostic and therapeutic challenges. 1 2 – 4 4 – 6 7 , 8 4 , 6 9 10 11 The prevailing therapy for ocular melanoma has been surgical excision, supplemented by mild hyperthermic or radiotherapeutic techniques to enhance tumor response and minimize recurrence. The clinical application of hyperthermia is achieved through various methods, including local hyperthermia, regional hyperthermia, and whole body hyperthermia. 12 – 15 16 17 – 20 21 22 – 26 Previous studies by Blom et al., 27 28 29 30 – 32 33 – 35 Methods Materials Culture flasks (25 cm 2 2 Drugs and Other Substances CP (NeoCorp, Pawtucket, RI, USA; MT0083), DTX (Hikma, London, UK; AA0082), MTO (Hexal, Holzkirchen, Germany; MF0947), dimethyl sulfoxide (DMSO, Sigma-Aldrich), PBS (VWR International, Radnor, PA, USA), Ringer Solution (Fresenius Kabi Deutschland, Homburg, Germany; #B231552), normal goat serum (Abcam, Cambridge, UK; #ab7481), bovine serum albumin (Sigma-Aldrich #A9418), and Triton X-100 (Roth #3051.2). Antibodies HSF-1 (rb, Cell Signaling, Danvers, MA, USA; #4356), HSP60 (ms, Invitrogen, Waltham, MA, USA; #MA3-012), HSP70 (ms, Invitrogen, #MA3-006), HSP90 1 (rb, Cell Signaling #4874), GAPDH (ms, Invitrogen, #AM4300), horse anti-mouse-HRP (Cell Signaling, #7076), goat anti-rabbit-HRP (Invitrogen, #32460), goat anti-mouse-Alexa488 (Invitrogen, #A-28175), goat anti-rabbit-Alexa488 (Invitrogen, #A-11008), and phalloidin-iFluor594 (Abcam, #ab176757). Cells and Culture Conditions Four human melanoma cell lines from the ocular region were used. CRMM-1 and CRMM-2 are derived from recurrent nodular tumors of the conjunctiva. Histologically, the tumors were both predominantly epithelial. Both cell lines, previously established by Nareyeck et al. 11 9 4 Hyperthermic Treatment With the Addition of Cytotoxic Drugs We seeded 1.5 × 10 4 Tables 1 2 2 2 36 – 38 Table 1. Final Concentrations of Chemotherapeutics (nM) Chemotherapeutics Concentration (nM) CP 500 5 × 10 3 2.5 × 10 4 1 × 10 5 DTX 2.5 25 50 100 MTO 10 100 500 1 × 10 3 Table 2. Final Concentrations of Chemotherapeutics (ng/mL) Chemotherapeutics Concentration (ng/mL) CP 150 1.5 × 10 3 7.5 × 10 3 3 × 10 4 DTX 2.02 20.2 40.4 80.8 MTO 4.445 44.45 222.25 444.5 Cell Confluence Analysis Using the Live Cell Imaging System IncuCyte After application of the respective treatment the cell growth was observed up to 5 days by live cell imaging using IncuCyte. The proliferation rates were calculated using the formula: Proliferation rate = ln N t 2 N t 1 Δ t Nt 1 t 1 Nt 2 t 2 Δt t 1 t 2 Nt 1 Analysis of Synergistic Effects Using the Bliss Independence Model Interaction strength of two independent treatments (temperature and chemotherapeutics) was assessed using the Bliss independence model, 39 40 , 41 CI = E A + E B - E A E B E AB E A A E B B E AB Impedance-based Cell Confluence Analysis using xCELLigence To verify the findings observed from previous combination experiments an impedance-based technology by xCELLigence was used. For CRMM-1, CRMM-2, and 92.1 4 × 10 3 4 Analysis of Cell Viability and Cell Death Phenotype in Flow Cytometry To differentiate between each viability state (viable, necrotic, apoptotic) after treatment occurred, 8.3 × 10 4 Tables 1 2 2 42 Immunocytochemistry Staining of Cells After Hyperthermia Treatment Fluorescence imaging of treated cells was conducted on round glass coverslips on which the cells were seeded 24 hours before treating the cells with hyperthermic conditions. The coverslips were placed in a 12-well plate and 1.6 × 10 5 Table 3 2 Table 3. Antibodies and Dyes Method Target Dilution Immunofluorescence HSP60ms 1:100 HSP70ms 1:100 HSP90rb 1:100 HSF-1rb 1:250 Phalloidin-iFluor594 1:500 Goat anti-mouse-A488 1:10,000 Goat anti-rabbit-A488 1:500 Western blot HSP60ms 1:1,000 HSP70ms 1:1,000 HSP90rb 1:1000 HSF-1rb 1:1,000 GAPDHms 1:10,000 Horse anti-mouse HRP 1:10,000 Goat anti-rabbit HRP 1:500 Statistical Analyses Unless stated otherwise, data are presented as the mean ± SD from three independent experiments ( n P P P P SDS-PAGE and Western Blotting Washed and pelleted cells were lysed with 100 µL RIPA buffer and proteinase inhibitors for 15 minutes on ice after incubating the cells for 3 hours at 37°C subsequent to the initial hyperthermia treatment to allow sufficient expression time for the target proteins. Using a 27Gx3⁄4 needle the lysate was homogenized. After centrifugation at 700 relative centrifugation force for 5 minutes, the supernatant was transferred to a new Eppendorf tube. For storage the lysates were kept at −20°C. We loaded 35 µg of protein onto StainFree Gels (BioRad) per lane. Stain-free gels were used because normalization to housekeeping genes such as GAPDH and β-actin proved to be challenging. Given the hyperthermic treatment, expression levels of housekeeping genes changed drastically ( Supplementary Fig. S11 Supplementary Fig. S10 Table 3 Results This study investigated the effects of hyperthermia in combination with CP, DTX, and MTO. Primary results are presented for CRMM-1 and UPMM-3, representing conjunctival and uveal melanoma, respectively. Supporting data for CRMM-2 and 92.1 are included in the Supplementary Material. To establish a baseline for evaluating combinatorial effects, we first assessed the individual impact of hyperthermia and chemotherapeutic agents on cell confluence across all four ocular melanoma cell lines. These results aim to inform future development of SPION-based delivery systems functionalized with these or similar chemotherapeutics. Cellular responses were assessed using live-cell imaging ( Fig. 1 Fig. 5 Fig. 6 Figs. 7 8 9 10 Supplementary Fig. S9 Figure 1. Cell confluence percentages 120 hours after seeding, normalized to H 2 A D B E C F n P P P Monotherapy of Hyperthermia and Chemotherapeutics in Ocular Melanoma Cell Lines Figure 1 Supplementary Figure S1 P P P P P Under normothermic conditions (37°C), CP treatment elicited dose-dependent and cell line-specific responses. In CRMM-1 and CRMM-2, a dose of 0.5 µM had no effect, whereas 5 µM reduced confluence by 58% and 75% ( P P P DTX treatment effectively reduced confluence in CRMM-1 and CRMM-2 across all concentrations ( P P MTO demonstrated potent cytotoxicity ( P P P Together, these results reveal cell line-specific sensitivities to both hyperthermia and chemotherapeutic monotherapy. Conjunctival melanoma lines were consistently more responsive to both single treatment modalities than uveal lines, with UPMM-3 showing the greatest resistance. Combination Treatments and Bliss Interaction Interpretation Given the differential responses to hyperthermia and cytotoxic monotherapy, we next evaluated combination treatments across temperatures and drug concentrations. Interaction strength was assessed using the Bliss independence model, which assumes that the combined effect of two independently acting agents equals the product of their individual survival probabilities. The deviation from this expected value was expressed as a CI, with values of less than 0.96 indicating synergy, greater than 1.04 indicating antagonism, and values between 0.96 and 1.04 being considered additive. Because hyperthermia at 45°C and 47°C alone resulted in pronounced cytotoxicity and confluence reductions, additional effects of chemotherapeutics at these temperatures did not further enhance the outcome and are, therefore, not discussed in detail. The focus of the following results is on 42°C, where potential additive or synergistic effects were still discernible. Cisplatin In CRMM-1 and CRMM-2, combining CP with hyperthermia enhanced cytotoxicity in a temperature- and dose-dependent manner. In contrast with the minimal effects observed with monotherapies, the combination of mild hyperthermia and 0.5 µM CP showed a highly synergistic effect reducing the confluence by 41% in CRMM-1 (CI = 0.46) and 44% in CRMM-2 (CI = 0.73). Increasing the dose to 5 µM further reduced confluence to 86% and 92% in CRMM-1 and CRMM-2, respectively, with CI values of 0.78 and 0.89, remaining within the synergistic range. At higher concentrations, cytotoxic effects plateaued, and adding hyperthermia did not further improve confluence reductions. Statistical significance values for each CP concentration comparing CRMM-1 at 37°C and 42°C are provided in Table 4 Table 4. CRMM-1 Confluence Comparison: CP 37°C vs 42°C Sample Adjusted P 0.5 µM <0.001 5.0 µM <0.001 25.0 µM 0.54 100.0 µM 0.75 In UPMM-3, neither 0.5 µM CP nor mild hyperthermia at 42°C alone reduced confluence; however, their combination resulted in a minor 2% reduction with strong indicated synergy (CI = 0.14). Despite this fact, this reduction was not statistically significant in terms of overall confluence. At 5 µM, the combination reduced confluence by 23% (CI = 0.34). A concentration of 25 µM resulted in a 52% reduction in confluence, although this concentration was associated with an antagonistic interaction (CI = 1.30) and a statistically significant increase in confluence relative to 25 µM at 37°C ( P Table 5 Table 5. UPMM-3 Confluence Comparison: CP 37°C vs 42°C Sample Adjusted P 0.5 µM 0.42 5.0 µM 0.19 25.0 µM 0.042 100.0 µM 0.30 Docetaxel In CRMM-1, 2.5 nM DTX alone already reduced confluence by 86% at 37°C. Combining this concentration with 42°C did not enhance the effect, but rather reduced it to 78%, yielding a strong antagonistic CI of 1.14. Similarly, in CRMM-2, 2.5 nM at a temperature of 42°C resulted in only a 63% reduction compared with 85% under normothermic conditions (CI = 1.41). At higher concentrations (25–100 nM), cytotoxicity plateaued with confluence reductions of 93% to 97%, and CI values ranged from additive to mildly antagonistic (CI = 0.98–1.11). Statistical significance values for each DTX concentration comparing 37°C and 42°C in CRMM-1 are provided in Table 6 Table 6. CRMM-1 Confluence Comparison: DTX 37°C vs 42°C Sample Adjusted P 2.5 nM 0.15 25.0 nM 0.52 50.0 nM 0.46 100.0 nM 0.80 In UPMM-3, 2.5 nM DTX combined with 42°C reduced cell confluence by 59% (CI = 0.72), improving further at 25 nM (69%; CI = 0.85). At higher concentrations of 50 nM and 100 nM, reductions of 71% and 65% were observed, with corresponding CI values of 0.99 and 1.04. In 92.1, DTX was highly effective under normothermic conditions, and the addition of 42°C did not improve outcomes (CI = 1.00 at 2.5 nM, 0.99 at higher concentrations). Statistical significance values for each DTX concentration comparing 37°C and 42°C in UPMM-3 are provided in Table 7 Table 7. UPMM-3 Confluence Comparison: DTX 37°C vs 42°C Sample Adjusted P 2.5 nM 0.023 25.0 nM 0.16 50.0 nM 0.94 100.0 nM 0.47 Mitoxantrone In CRMM-1, combining 0.1 µM MTO with 42°C reduced confluence by 96% (CI = 0.95). At higher concentrations, confluence was reduced by 99%, with additive interaction profiles (CI = 0.96–0.99). In CRMM-2, 0.01 µM and 0.1 µM with 42°C resulted in 85% and 95% reductions (CI = 0.97 and 0.98, respectively). Statistical significance values for each MTO concentration comparing 37°C and 42°C in CRMM-1 are provided in Table 8 Table 8. CRMM-1 Confluence Comparison: MTO 37°C vs 42°C Sample Adjusted P 0.01 µM 0.10 0.10 µM 0.15 0.50 µM 0.63 1.00 µM 0.76 In UPMM-3, 0.01 µM MTO combined with 42°C reduced confluence by 35% (CI = 0.17). At 1 µM, confluence was reduced by 79% (CI = 0.68). Intermediate doses (0.1 and 0.5 µM) produced antagonistic to synergistic responses (CI = 0.90–1.18). In 92.1, MTO was highly effective as monotherapy, reducing confluence by 85% to 99%. Adding 42°C did not enhance the effect at most concentrations (CI = 1.01–1.06), although 0.5 µM with 42°C yielded mild synergy (97% reduction; CI = 0.95). Statistical significance values for each MTO concentration comparing 37°C and 42°C in UPMM-3 are provided in Table 9 Table 9. UPMM-3 Confluence Comparison: MTO 37°C vs 42°C Sample Adjusted P 0.01 µM 0.002 0.10 µM 0.20 0.50 µM 0.60 1.00 µM 0.004 The data obtained highlight consistent temperature- and dose-dependent effects across drugs and cell lines, with greater sensitivity observed in the conjunctival melanoma cell lines CRMM-1 and CRMM-2 compared with the uveal melanoma cell lines UPMM-3 and 92.1. However, when comparing statistics, uveal melanoma cell lines displayed more frequent synergy at low-dose and mild hyperthermia conditions, despite their lower baseline sensitivity. In general, hyperthermia at temperatures of 45°C and above were sufficient to reduce confluence in CRMM-1, CRMM-2, and 92.1. No synergistic benefit was observed from the inclusion of chemotherapeutics at any tested concentration. In contrast, UPMM-3 required temperatures exceeding 45°C to achieve comparable reductions in confluence. Nevertheless, given that viable cells remain after exposure to elevated temperatures, combinatory treatments should still be considered, to effectively diminish cell proliferation. Bliss CI heatmaps and graphs ( Figs. 2 3 Supplementary Figures S2 S3 Figure 2. Heatmap of Bliss CI values in CRMM-1 cells treated with CP ( A B C green red Figure 3. Heatmap of Bliss CI values in UPMM-3 cells treated with CP ( A B C red Impact of Treatment on the Proliferation Rate Using a complementary analytical approach on the live-cell imaging dataset, proliferation assessments expanded upon the confluence findings by capturing dynamic changes in growth recovery or arrest between 24 and 120 hours. Statistical significance was determined by multiple comparisons relative to the 37°C H 2 Figure 4 Supplementary Figure S4 Figure 4. Quantification of proliferation rate in CRMM-1 and UPMM-3 over 96  hours after treatment with CP ( A D B E C F 2 n P P P In CRMM-1, hyperthermia alone significantly inhibited proliferation only at elevated temperatures: 45°C caused a marked reduction, whereas 47°C resulted in complete growth arrest, leading to negative proliferation rates. CP at 0.5 µM did not significantly affect proliferation at 37°C, 42°C, or 45°C compared with hyperthermia alone. In contrast, concentrations of 5 to 100 µM significantly reduced proliferation ( P P P Proliferation trends in CRMM-2 generally followed those observed in CRMM-1, with some notable differences. Significant reductions occurred with 5 µM CP at 42°C ( P In UPMM-3, mild hyperthermia at 42°C increased proliferation significantly ( P In 92.1, 42°C resulted in a mild, nonsignificant increase in proliferation. This effect, however, was mirrored by low-dose CP (0.5 µM), whereas higher concentrations (5, 25, and 100 µM) significantly reduced proliferation rates ( P P P P These findings corroborate the confluence-based trends, reinforcing that hyperthermia-enhanced cytotoxicity is most effective in conjunctival melanoma models, whereas UPMM-3 displays heat-induced proliferative resilience at 42°C. Combinations with the tested cytotoxic agents mostly led to significantly lower proliferation rates, when low doses were combined with mild hyperthermia. Impact of Treatment on Cell Confluence Using Impedance-based Technology To validate the findings obtained from live-cell imaging, an impedance-based technology was used as an independent measure of treatment effects on cell confluence. This approach quantifies the electrical resistance generated by adherent cells growing on microelectrodes ( Fig. 5 Supplementary Fig. S5 Figure 5. Impedance-based measurement of CRMM-1 and UPMM-3 over 120 hours after different treatments under normothermic ( A C B D n Comparable results were obtained for both conjunctival melanoma cell lines. In CRMM-1 cells, only a minor reduction in confluence was observed in the 42°C H 2 In UPMM-3, impedance measurements plateaued around 96 hours, indicating full electrode coverage and limiting interpretation beyond this timepoint. As a result, the increase in confluence observed at 42°C in live-cell imaging could not be confirmed using this method, even though confluence levels at 96 hours were unchanged, when comparing both temperature groups. Despite this, the comparison of drug effects at 37°C and 42°C yielded similar trends, with a reduced confluence at 42°C across most conditions. Treatment-induced effects became apparent after 24 hours, which was not altered when combined with 42°C, suggesting that cytotoxic effects were initiated shortly after exposure. In the 92.1 cells, mild hyperthermia at 42°C led to a slight reduction in confluence compared with normothermic conditions. All tested drug concentrations were more effective at 42°C than at 37°C, as observed with previous findings. Notably, for CRMM-1, impedance analysis provided additional resolution on timing, revealing earlier divergence from controls when combined with 42°C, indicating accelerated onset of cytotoxic effects. Similar trends were observed in CRMM-2; however, an earlier divergent was not apparent. In UPMM-3, full electrode coverage limited long-term resolution, but early response patterns were consistent with the live-cell imaging data. In 92.1, impedance trends mirrored confluence data, showing moderate hyperthermia-induced enhancement of drug efficacy. Impact of Treatment on Cell Viability, Cell Death Phenotype, and Mitochondrial Membrane Potential To further evaluate cellular responses to the tested combination treatments, flow cytometry was used to assess the viability status and the intact mitochondrial membrane potential (Δψm) under normothermic and mild hyperthermic conditions. Viability was measured by Annexin V and PI co-staining ( Fig. 6 Supplementary Fig S6 Supplementary Fig. S7 Tables 10 11 12 13 Figure 6. Flow cytometric analysis of CRMM-1 and UPMM-3 cell viability after combination treatments at cytotoxic concentrations and 42°C for 1 hour. H 2 A D 2 Tables 10 12 P P P Table 10. CRMM-1 Viability Comparison: 37°C vs 42°C Sample Adjusted P Control 0.038 DMSO (3%) 0.40 CP (5 µM) <0.001 CP (25 µM) 0.34 DTX (25 nM) 0.80 MTO (100 nM) 0.13 Table 11. CRMM-1 Δψm Comparison: 37°C vs 42°C Sample Adjusted P Control 0.25 DMSO (3%) 0.19 CP (5 µM) <0.001 CP (25 µM) 0.067 DTX (25 nM) 0.56 MTO (100 nM) 0.86 Table 12. UPMM-3 Viability Comparison: 37°C vs 42°C Sample Adjusted P Control <0.001 DMSO (3%) 0.96 CP (5 µM) <0.001 CP (25 µM) 0.90 DTX (25 nM) 0.26 MTO (100 nM) 0.002 Table 13. UPMM-3 Δψm Comparison: 37°C vs 42°C Sample Adjusted P Control <0.001 DMSO (3%) 0.20 CP (5 µM) <0.001 CP (25 µM) 0.98 DTX (25 nM) 0.72 MTO (100 nM) 0.92 In CRMM-1, viability decreased significantly from 92% to 83% at 42°C ( P 2 Table 10 Table 11 Viability in CRMM-2, in contrast, declined significantly from 93% to 62% at 42°C ( P In UPMM-3, viability decreased from 88% to 67% at 42°C, yet the total cell count increased by approximately 10%, consistent with prior confluence data. This finding suggests that a subset of cells may retain or even increase proliferative capacity under mild thermal stress. In all treatment groups the necrotic cell fraction was significantly increased and total cell counts were reduced by up to approximately 80%, consistent with the confluence data. However, when comparing treatment effects between 37°C and 42°C, significant enhancements were only observed at 5 µM CP and 0.1 µM MTO ( Table 12 P Table 13 In 92.1, the viable cell fraction decreased slightly from 89% to 83% at 42°C, with a 20% drop in total cell count and a significant reduction in Δψm ( P P Taken together, flow cytometry revealed consistent decreases in viability across all cell lines, with uveal melanoma cell lines showing greater Δψm sensitivity, especially UPMM-3, toward mild hyperthermia and treatments. Although CRMM-1 and CRMM-2 showed 10% to 40% decreases in viability, UPMM-3 displayed reduced viability alongside increased cell numbers, highlighting its hyperthermia-associated proliferative phenotype. In 92.1, thermal treatment modestly impaired viability and significantly impacted mitochondrial integrity. Impact of Hyperthermia on HSP Expression To investigate the molecular effects of mild hyperthermia on the heat shock response, expression of HSP60, HSP70, and HSP90, along with their main upstream regulator heat shock factor 1 (HSF-1), were evaluated by ICC and Western blotting. Cells were exposed to 42°C for 1 hour and then incubated at 37°C for an additional 3 hours before fixation. Exemplary fluorescence images are presented in Figures 7 8 Figures 9 10 Supplementary Figure S8 Figure 7. Immunocytochemical staining of fixed CRMM-1 cells at 37°C and 42°C. Stained are nuclei (DAPI), F-actin (phalloidin-iFluor 594), and for ( A E B F C G D H A D E H B C F G A D E F Figure 8. Immunocytochemical staining of fixed UPMM-3 cells at 37°C and 42°C. Stained are nuclei (DAPI), F-actin (phalloidin-iFluor 594), and for ( A E B F C G D H A D E H B C F G A D E F Figure 9. ICC analysis of CRMM-1 cells 3 hours after a 1-hour exposure to 42°C. Cells were fixed with 4% PFA. ( A 2 B C D E n P P P Figure 10. ICC analysis of UPMM-3 cells 3 hours after a 1-hour exposure to 42°C. Cells were fixed with 4% PFA. ( A 2 B C D E n P P In CRMM-1, mild hyperthermia led to a significant increase in cell area (∼5%; P P P P P P CRMM-2 exhibited a comparable heat-induced increase in cell area (∼9%; P P P P In UPMM-3, mild hyperthermia did not significantly affect cell area. However, ICC revealed reduced nuclear HSF-1 expression ( P P P P These findings align with previous observations indicating that hyperthermia may attenuate treatment effects in UPMM-3 and suggest a divergent heat shock response compared with the tested conjunctival melanoma lines, especially when comparing HSF-1 and HSP90 expression levels. Western blotting performed using the BioRad Stain-Free technology for total protein normalization, corroborated ICC findings. Representative blots and a normalized comparative analysis of CRMM-1 and UPMM-3 are included in the supplementary material ( Supplementary Figs. S9 S11 Discussion Combination Treatments The present study underscores the potential of combining mild hyperthermia at 42°C with specific chemotherapeutics to improve treatment outcomes in ocular melanoma cell lines. Mild hyperthermia significantly enhanced the cytotoxic effect of CP at concentrations of 150 ng/mL and 7.5 µg/mL (0.5 µM and 25 µM), MTO at concentrations of 4.445 ng/mL and 444.5 ng/mL (0.01 µM and 1 µM), and to a lesser extent DTX at concentrations of 2.02 ng/mL and 20.2 ng/mL (2.5 nM and 25 nM), resulting in substantial reductions in cell confluence, cell count, and viability. These findings align with existing literature that identifies the 41°C to 43°C range as optimal for maximizing therapeutic effects while minimizing damage to healthy tissue in vivo. 43 , 44 45 46 – 48 The enhanced efficacy of CP under hyperthermic conditions aligns with existing literature demonstrating that alkylating agents and platinum compounds exhibit supra-additive effects when combined with mild hyperthermia. 49 , 50 43 , 51 , 52 Despite the success observed in conjunctival melanoma cell lines, the uveal melanoma cell lines UPMM-3 and, to some extent 92.1, exhibited distinct responses. At 42°C, no significant reductions in cell confluence or substantial increases in cell death were observed; in fact, UPMM-3 exhibited increased proliferation. Therefore, DTX’s status as a well-established antimitotic agent, hyperstabilizing microtubule structure by binding to the β-subunit of tubulin, its effect is still pronounced even at low concentrations of 2.5 nM. Translating these observations into in vivo models, however, will be challenging. Mild hyperthermia could transiently stimulate tumor cell proliferation, thereby enhancing the efficacy of proliferation-targeted chemotherapeutics; however, this approach may also increase the risk of metastasis. Temperatures of 45°C and 47°C were sufficient to markedly reduce confluence and viability across all cell lines examined. At these higher temperatures, the addition of cytotoxic agents did not result in further enhancements. However, viable cells were still present in some cases and exhibited renewed proliferation by the end of the 120-hour observation period, indicating that complete elimination of all cells was not consistently achieved with hyperthermia alone. This result emphasizes the necessity of combining hyperthermia with chemotherapeutics, particularly in vivo, where treatment-resistant cells may persist or uniform heating may be difficult to achieve across the entire tumor. Although synergistic effects were predominantly observed at mild hyperthermic temperatures, these findings underscore the significance of combinatorial strategies, even under high-temperature conditions. Importantly, the CIs calculated in this study must be interpreted cautiously, because derived synergistic interactions can be misleading when monotherapies yield minimal or negative effects. For example, the very low CI values of 0.46 in CRMM-1 when treated with 42°C and 0.5 µM CP or CI values of 0.14 to 0.34 in UPMM-3 when treated with 42°C and 0.5 or 5 µM CP suggest high synergistic interactions of both monotherapies. This, however, did not translate into meaningful reductions in cell confluence. Additionally, flow cytometry revealed greater ΔΨm loss in uveal melanoma cell lines after treatment at 42°C in comparison with the conjunctival melanoma cell lines. This finding suggests that targeting tumor metabolism, rather than relying solely on cytotoxic agents, may represent a promising therapeutic strategy for uveal melanomas. Given these findings, precise calibration of hyperthermic protocols is essential to maximize therapeutic benefits without unintended stimulation of tumor growth, as observed with UPMM-3. Subsequent studies should investigate the molecular mechanisms driving these divergent responses, focusing on HSPs, mitochondrial integrity, and commonly overexpressed oncogenes. The observed disparities in cell morphology after heat treatment further substantiate the inherent variations in heat tolerance. CRMM-1 and CRMM-2 cells exhibited a significant cell area expansion likely as a stress response, as suggested by Maiti et al., 53 54 Mechanisms Behind Enhanced Proliferation A potential mechanism that could explain the enhanced proliferation under mild hyperthermia involves the upregulation of stress-related molecules such as HSPs, particularly HSP70 and HSP90, which facilitate protein refolding and protect cells from apoptotic triggers. Increased HSP expression is a hallmark of cancer 55 – 57 58 – 60 61 – 63 Our study demonstrated that conjunctival and uveal melanoma cell lines exhibit distinct responses to heat exposure. In conjunctival melanoma, mild hyperthermia reduced HSP90 expression while increasing HSP70 levels. Conversely, uveal melanoma cells exhibited the opposite trend, with elevated HSP90 and reduced HSP70 after heat treatment. Three hours after mild hyperthermia, the majority of HSP70 was still found to be localized within nucleoli. 64 Supplementary Figure S9 28 29 65 The heat shock response is a major cellular stress relief pathway that has been conserved evolutionarily across various species. 66 – 68 69 , 70 71 , 72 73 – 75 76 , 77 27 27 78 78 79 80 This dynamic response to stress underscores the complex regulatory mechanisms at play, 15 , 81 , 82 73 , 81 , 83 82 84 , 85 43 , 86 87 – 90 55 91 Moreover, as demonstrated by van den Tempel et al., 92 , 93 92 , 93 Fig. 10 Supplementary Fig. S9 Hyperthermia and SPIONs: An Outlook This study demonstrates that combining hyperthermia with chemotherapy can improve the treatment of ocular melanoma, particularly in hard-to-reach areas. This approach can enhance drug efficacy, reduce the required dosage, and potentially assist in overcoming drug resistance. A promising strategy involves the use of SPIONs functionalized with chemotherapeutics for targeted therapy with minimal systemic toxicity. 94 – 96 97 , 98 98 Conclusions The present study demonstrates the potential of using mild hyperthermia (42°C) in combination with cytotoxic drugs, such as CP (0.5–25 µM), MTO (0.01 µM), and, to a lesser extent, DTX (2.5–25 nM), to treat ocular melanoma cell lines. Nonetheless, the variable responses observed across the various cell lines suggest that 42°C is not a universal optimal temperature, thereby emphasizing the necessity of precise calibration and the identification of reliable biomarkers. Temperatures of 45°C and above were highly effective in reducing cell confluence and viability, thereby limiting the added benefit of combination treatments. However, the presence of proliferating cells after exposure to high temperatures in some cases underscores the importance of considering combinatorial strategies to ensure complete therapeutic efficacy. Consequently, the integration of hyperthermia with SPIONs presents a promising approach for targeted therapy, facilitating safer and more precise hyperthermia conditions. SPIONs functionalized with chemotherapeutics or interference RNAs for targeted knockdowns have great potential for future cancer therapies. In vivo validation of these findings is essential to further elucidate the underlying mechanisms. Furthermore, given the stark expression differences between conjunctival and uveal melanoma cell lines, exploring the use of HSP and HSF inhibitors represents a compelling future research direction. Supplementary Material Supplement 1 Acknowledgments The authors thank Julia Band, Andrea Kerpes, and Bianca Nuss for their technical assistance with this study. Funded by Manfred Roth Foundation, Fürth, Germany; by the Forschungsstiftung Medizin am Universitätsklinikum Erlangen, Germany; by Hans Wormser, Herzogenaurach, Germany; and the Hightech Agenda Bavaria, Germany. Disclosure: P.-R. Blersch T. Hoyer C. Alexiou L.M. Heindl A.-O. Gostian S. Lyer References 1. Singh AD Turell ME Topham AK Uveal melanoma: trends in incidence, treatment, and survival Ophthalmology 2011 118 9 1881 1885 21704381 10.1016/j.ophtha.2011.01.040 2. Krantz BA Dave N Komatsubara KM Marr BP Carvajal RD Uveal melanoma: epidemiology, etiology, and treatment of primary disease Clin Ophthalmol 2017 11 279 289 28203054 10.2147/OPTH.S89591 PMC5298817 3. Bedikian AY Metastatic uveal melanoma therapy: current options Int Ophthalmol Clin 2006 46 1 151 166 16365561 10.1097/01.iio.0000195852.08453.de 4. Nareyeck G Zeschnigk M Bornfeld N Anastassiou G Novel cell lines derived by long-term culture of primary uveal melanomas Ophthalmologica 2009 223 3 196 201 19212147 10.1159/000201566 5. Abdel-Rahman MH Cebulla CM Verma V et al Monosomy 3 status of uveal melanoma metastases is associated with rapidly progressive tumors and short survival Exp Eye Res 2012 100 26 31 https://www.sciencedirect.com/science/article/pii/S0014483512001285 22569040 10.1016/j.exer.2012.04.010 PMC4294816 6. Griewank KG Yu X Khalili J et al Genetic and molecular characterization of uveal melanoma cell lines Pigment Cell Melanoma Res 2012 25 2 182 187 22236444 10.1111/j.1755-148X.2012.00971.x PMC3288394 7. Kalirai H Müller PL Jaehne D Coupland SE [Ocular melanomas: an update] Pathologe 2017 38 6 491 499 29038913 10.1007/s00292-017-0389-3 8. Jovanovic P Mihajlovic M Djordjevic-Jocic J et al Ocular melanoma: an overview of the current status Int J Clin Exp Pathol 2013 6 7 1230 1244 23826405 PMC3693189 9. De Waard-Siebinga I Blom DJ Griffioen M et al Establishment and characterization of an uveal-melanoma cell line Int J Cancer 1995 62 2 155 161 7622289 10.1002/ijc.2910620208 10. Jager MJ Magner JA Ksander BR Dubovy SR Uveal melanoma cell lines: where do they come from? (An American Ophthalmological Society Thesis) Trans Am Ophthalmol Soc 2016 114 T5 28018010 PMC5161001 11. Nareyeck G Wuestemeyer H von der Haar D Anastassiou G Establishment of two cell lines derived from conjunctival melanomas Exp Eye Res 2005 81 3 361 362 15993408 10.1016/j.exer.2005.04.018 12. American Cancer Society Hyperthermia to treat cancer 2016 https://www.cancer.org/cancer/managing-cancer/treatment-types/hyperthermia.html 13. Datta NR Ordóñez SG Gaipl US et al Local hyperthermia combined with radiotherapy and-/or chemotherapy: recent advances and promises for the future Cancer Treat Rev 2015 41 9 742 753 https://www.sciencedirect.com/science/article/pii/S0305737215001048 26051911 10.1016/j.ctrv.2015.05.009 14. American Cancer Society Detectar el cáncer de próstata temprano es una jugada crucial https://www.cancer.org/es.html 15. Zeng X-C Bhasin S Wu X et al Hsp70 dynamics in vivo: effect of heat shock and protein aggregation J Cell Sci 2004 117 21 4991 5000 15367583 10.1242/jcs.01373 16. Demtröder W Statische Magnetfelder Experimentalphysik Berlin, Heidelberg Springer 2013 17. Kaur P Aliru ML Chadha AS Asea A Krishnan S Hyperthermia using nanoparticles–promises and pitfalls Int J Hyperthermia 2016 32 1 76 88 26757879 10.3109/02656736.2015.1120889 PMC4955578 18. Dutz S Hergt R Magnetic nanoparticle heating and heat transfer on a microscale: basic principles, realities and physical limitations of hyperthermia for tumour therapy Int J Hyperthermia 2013 29 8 790 800 23968194 10.3109/02656736.2013.822993 19. Dutz S Kettering M Hilger I Müller R Zeisberger M Magnetic multicore nanoparticles for hyperthermia—influence of particle immobilization in tumour tissue on magnetic properties Nanotechnology 2011 22 26 265102 21576784 10.1088/0957-4484/22/26/265102 20. Jeun M Kim YJ Park KH et al Physical contribution of Néel and Brown relaxation to interpreting intracellular hyperthermia characteristics using superparamagnetic nanofluids J Nanosci Nanotechnol 2013 13 8 5719 5725 23882824 10.1166/jnn.2013.7524 21. Johannsen M Gneveckow U Taymoorian K et al Morbidity and quality of life during thermotherapy using magnetic nanoparticles in locally recurrent prostate cancer: results of a prospective phase I trial Int J Hyperthermia 2007 23 3 315 323 17523023 10.1080/02656730601175479 22. Vijayan V Sundaram A Vasukutty A et al Tumor-targeting cell membrane-coated nanorings for magnetic-hyperthermia-induced tumor ablation Biomater Sci 2023 11 21 7188 7202 37750339 10.1039/d3bm01141k PMC10595517 23. Cicha I Singh R Garlichs CD Alexiou C Nano-biomaterials for cardiovascular applications: clinical perspective J Control Release 2016 229 23 36 https://www.sciencedirect.com/science/article/pii/S0168365916301493 26988601 10.1016/j.jconrel.2016.03.015 24. Lugert S Unterweger H Mühlberger M et al Cellular effects of paclitaxel-loaded iron oxide nanoparticles on breast cancer using different 2D and 3D cell culture models Int J Nanomed 2019 14 161 180 https://www.tandfonline.com/doi/abs/10.2147/IJN.S187886 10.2147/IJN.S187886 PMC6306067 30613144 25. Kandasamy G Maity D Recent advances in superparamagnetic iron oxide nanoparticles (SPIONs) for in vitro and in vivo cancer nanotheranostics Int J Pharm 2015 496 2 191 218 https://www.sciencedirect.com/science/article/pii/S0378517315303252 26520409 10.1016/j.ijpharm.2015.10.058 26. Vangijzegem T Lecomte V Ternad I et al Superparamagnetic iron oxide nanoparticles (SPION): from fundamentals to state-of-the-art innovative applications for cancer therapy Pharmaceutics 2023 15 1 236 https://www.mdpi.com/1999-4923/15/1/236 36678868 10.3390/pharmaceutics15010236 PMC9861355 27. Blom DJ De Waard-Siebinga I Apte RS et al Effect of hyperthermia on expression of histocompatibility antigens and heat-shock protein molecules on three human ocular melanoma cell lines Melanoma Res 1997 7 2 103 109 9167175 10.1097/00008390-199704000-00003 28. Missotten GS Journée-de Korver JG de Wolff-Rouendaal D et al Heat shock protein expression in the eye and in uveal melanoma Invest Ophthalmol Vis Sci 2003 44 7 3059 3065 12824252 10.1167/iovs.02-1038 29. Coupland SE Vorum H Mandal N et al Proteomics of uveal melanomas suggests HSP-27 as a possible surrogate marker of chromosome 3 loss Invest Ophthalmol Vis Sci 2010 51 1 12 20 19643972 10.1167/iovs.09-3913 30. Drugbank-Online Cisplatin 2005 https://go.drugbank.com/drugs/DB00515 31. Drugbank-Online Docetaxel 2005 https://go.drugbank.com/drugs/DB01248 32. Drugbank-Online Mitoxantrone 2005 https://go.drugbank.com/drugs/DB01204 33. Wang BS Lumanglas AL Silva J et al Effect of hyperthermia on the sensitivity of human colon carcinoma cells to mitoxantrone Cancer Treat Rep 1987 71 9 831 836 3621216 34. Los G Van Vugt MJH Den Engelse L Pinedo HM Effects of temperature on the interaction of cisplatin and carboplatin with cellular DNA Biochem Pharmacol 1993 46 7 1229 1237 https://www.sciencedirect.com/science/article/pii/0006295293904729 8216374 10.1016/0006-2952(93)90472-9 35. Bradshaw-Pierce EL Eckhardt SG Gustafson DL A physiologically based pharmacokinetic model of docetaxel disposition: from mouse to man Clin Cancer Res 2007 13 9 2768 2776 17473210 10.1158/1078-0432.CCR-06-2362 36. Vondráček J Souček K Sheard MA et al Dimethyl sulfoxide potentiates death receptor-mediated apoptosis in the human myeloid leukemia U937 cell line through enhancement of mitochondrial membrane depolarization Leukemia Res 2006 30 1 81 89 https://www.sciencedirect.com/science/article/pii/S0145212605002080 15998540 10.1016/j.leukres.2005.05.016 37. Dludla PV Jack B Viraragavan A et al A dose-dependent effect of dimethyl sulfoxide on lipid content, cell viability and oxidative stress in 3T3-L1 adipocytes Toxicol Rep 2018 5 1014 1020 https://www.sciencedirect.com/science/article/pii/S2214750018301811 30364542 10.1016/j.toxrep.2018.10.002 PMC6197677 38. Nguyen TV Alfarsi A Nguyen HT et al Metabolic disruptions induced by low concentrations of DMSO in RTgill-W1 fish cells: the importance of solvent controls in in vitro studies Aquatic Toxicol 2025 283 107354 https://www.sciencedirect.com/science/article/pii/S0166445X25001195 10.1016/j.aquatox.2025.107354 40209297 39. Bliss CI The calculation of microbial assays Bacteriol Rev 1956 20 4 243 258 https://journals.asm.org/doi/abs/10.1128/br.20.4.243-258.1956 13403845 10.1128/br.20.4.243-258.1956 PMC180866 40. Liu Q Yin X Languino LR Altieri DC Evaluation of drug combination effect using a Bliss independence dose-response surface model Stat Biopharm Res 2018 10 2 112 122 30881603 10.1080/19466315.2018.1437071 PMC6415926 41. Duarte D Vale N Evaluation of synergism in drug combinations and reference models for future orientations in oncology Curr Res Pharmacol Drug Discov 2022 3 100110 https://www.sciencedirect.com/science/article/pii/S259025712200030X 35620200 10.1016/j.crphar.2022.100110 PMC9127325 42. Munoz LE Maueröder C Chaurio R et al Colourful death: six-parameter classification of cell death by flow cytometry–dead cells tell tales Autoimmunity 2013 46 5 336 341 23231469 10.3109/08916934.2012.755960 43. Wust P Hildebrandt B Sreenivasa G et al Hyperthermia in combined treatment of cancer Lancet Oncol 2002 3 8 487 497 12147435 10.1016/s1470-2045(02)00818-5 44. Chia BSH Ho SZ Tan HQ et al A review of the current clinical evidence for loco-regional moderate hyperthermia in the adjunct management of cancers Cancers (Basel) 2023 15 2 346 36672300 10.3390/cancers15020346 PMC9856725 45. Dewey WC Hopwood LE Sapareto SA Gerweck LE Cellular responses to combinations of hyperthermia and radiation Radiology 1977 123 2 463 474 322205 10.1148/123.2.463 46. Obara K Matsumoto N Okamoto M et al Insufficient radiofrequency ablation therapy may induce further malignant transformation of hepatocellular carcinoma Hepatol Int 2008 2 1 116 123 19669287 10.1007/s12072-007-9040-3 PMC2716878 47. Liu Z Dai H Jia G et al Insufficient radiofrequency ablation promotes human hepatoma SMMC7721 cell proliferation by stimulating vascular endothelial growth factor overexpression Oncol Lett 2015 9 4 1893 1896 25789063 10.3892/ol.2015.2966 PMC4356410 48. Zhang R Ma M Lin XH et al Extracellular matrix collagen I promotes the tumor progression of residual hepatocellular carcinoma after heat treatment BMC Cancer 2018 18 1 901 30227844 10.1186/s12885-018-4820-9 PMC6145107 49. Hildebrandt B Wust P Ahlers O et al The cellular and molecular basis of hyperthermia Crit Rev Oncol Hematol 2002 43 1 33 56 https://www.sciencedirect.com/science/article/pii/S1040842801001792 12098606 10.1016/s1040-8428(01)00179-2 50. Schopman EM Van Bree C Bakker PJM et al Hyperthermia-enhanced effectiveness of Mitoxantrone in an experimental rat tumour Int J Hyperthermia 1996 12 2 241 254 8926392 10.3109/02656739609022512 51. Muller M Chérel M Dupré PF et al The cytotoxic effect of combined hyperthermia and taxane chemotherapy on ovarian cancer cells: results of an in vitro study Eur Surg Res 2012 48 2 55 63 22205139 10.1159/000333393 52. Mohamed F Stuart OA Glehen O et al Docetaxel and hyperthermia: Factors that modify thermal enhancement J Surg Oncol 2004 88 1 14 20 https://onlinelibrary.wiley.com/doi/abs/10.1002/jso.20117 15384091 10.1002/jso.20117 53. Maiti S Bhattacharya K Wider D et al Hsf1 and the molecular chaperone Hsp90 support a “rewiring stress response” leading to an adaptive cell size increase in chronic stress Cambridge, UK eLife Sciences Publications 2023 10.7554/eLife.88658 PMC10703448 38059913 54. Mergener S Siveke JT Peña-Llopis S Monosomy 3 is linked to resistance to MEK inhibitors in uveal melanoma Int J Mol Sci 2021 22 13 6727 https://www.mdpi.com/1422-0067/22/13/6727 34201614 10.3390/ijms22136727 PMC8269285 55. Ciocca DR Calderwood SK Heat shock proteins in cancer: diagnostic, prognostic, predictive, and treatment implications Cell Stress Chaperones 2005 10 2 86 103 16038406 10.1379/CSC-99r.1 PMC1176476 56. Cornford PA Dodson AR Parsons KF et al Heat shock protein expression independently predicts clinical outcome in prostate cancer Cancer Research 2000 60 24 7099 7105 11156417 57. Wu J Liu T Rios Z et al Heat shock proteins and cancer Trends Pharmacol Sci 2017 38 3 226 256 28012700 10.1016/j.tips.2016.11.009 58. Garrido C Brunet M Didelot C et al Heat shock proteins 27 and 70: anti-apoptotic proteins with tumorigenic properties Cell Cycle 2006 5 22 2592 2601 17106261 10.4161/cc.5.22.3448 59. Saleh A Srinivasula SM Balkir L et al Negative regulation of the Apaf-1 apoptosome by Hsp70 Nat Cell Biol 2000 2 8 476 483 10934467 10.1038/35019510 60. Sabirzhanov B Stoica BA Hanscom M et al Over-expression of HSP70 attenuates caspase-dependent and caspase-independent pathways and inhibits neuronal apoptosis J Neurochem 2012 123 4 542 554 https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1471-4159.2012.07927.x 22909049 10.1111/j.1471-4159.2012.07927.x PMC3753080 61. Wan J Wu W Hyperthermia induced HIF-1a expression of lung cancer through AKT and ERK signaling pathways J Exp Clin Cancer Res 2016 35 1 119 27456341 10.1186/s13046-016-0399-7 PMC4960890 62. Li Z Deng J Sun J Ma Y Hyperthermia targeting the tumor microenvironment facilitates immune checkpoint inhibitors Front Immunol 2020 11 595207 https://www.frontiersin.org/journals/immunology/articles/10.3389/fimmu.2020.595207 33240283 10.3389/fimmu.2020.595207 PMC7680736 63. Dewhirst MW Vujaskovic Z Jones E Thrall D Re-setting the biologic rationale for thermal therapy Int J Hyperthermia 2005 21 8 779 790 16338861 10.1080/02656730500271668 64. Kotoglou P Kalaitzakis A Vezyraki P et al Hsp70 translocates to the nuclei and nucleoli, binds to XRCC1 and PARP-1, and protects HeLa cells from single-strand DNA breaks Cell Stress Chaperones 2009 14 4 391 406 19089598 10.1007/s12192-008-0093-6 PMC2728274 65. Jmor F Kalirai H Taktak A et al HSP-27 protein expression in uveal melanoma: correlation with predicted survival Acta Ophthalmol 2012 90 6 534 539 21114636 10.1111/j.1755-3768.2010.02038.x 66. Lemaux PG Herendeen SL Bloch PL Neidhardt FC Transient rates of synthesis of individual polypeptides in E. coli following temperature shifts Cell 1978 13 3 427 434 350413 10.1016/0092-8674(78)90317-3 67. Kelley PM Schlesinger MJ The effect of amino acid analogues and heat shock on gene expression in chicken embryo fibroblasts Cell 1978 15 4 1277 1286 569556 10.1016/0092-8674(78)90053-3 68. Lindquist S Craig EA The heat-shock proteins Annu Rev Genet 1988 22 631 677 2853609 10.1146/annurev.ge.22.120188.003215 69. Richter K Haslbeck M Buchner J The heat shock response: life on the verge of death Mol Cell 2010 40 2 253 266 20965420 10.1016/j.molcel.2010.10.006 70. Jolly C Morimoto RI Role of the heat shock response and molecular chaperones in oncogenesis and cell death J Natl Cancer Inst 2000 92 19 1564 1572 11018092 10.1093/jnci/92.19.1564 71. Morimoto RI Cells in stress: transcriptional activation of heat shock genes Science 1993 259 5100 1409 1410 8451637 10.1126/science.8451637 72. Trinklein ND Murray JI Hartman SJ et al The role of heat shock transcription factor 1 in the genome-wide regulation of the mammalian heat shock response Mol Biol Cell 2004 15 3 1254 1261 14668476 10.1091/mbc.E03-10-0738 PMC363119 73. Gumilar KE Chin Y Ibrahim IH et al Heat shock factor 1 inhibition: a novel anti-cancer strategy with promise for precision oncology Cancers (Basel) 2023 15 21 5167 37958341 10.3390/cancers15215167 PMC10649344 74. Prince TL Lang BJ Guerrero-Gimenez ME et al HSF1: primary factor in molecular chaperone expression and a major contributor to cancer morbidity Cells 2020 9 4 1046 https://www.mdpi.com/2073-4409/9/4/1046 32331382 10.3390/cells9041046 PMC7226471 75. Chen K Qian W Li J et al Loss of AMPK activation promotes the invasion and metastasis of pancreatic cancer through an HSF1-dependent pathway Molecular Oncology 2017 11 10 1475 1492 https://febs.onlinelibrary.wiley.com/doi/abs/10.1002/1878-0261.12116 28783244 10.1002/1878-0261.12116 PMC5623818 76. Voellmy R On mechanisms that control heat shock transcription factor activity in metazoan cells Cell Stress Chaperones 2004 9 2 122 133 15497499 10.1379/CSC-14R.1 PMC1065292 77. Feng N Feng H Wang S et al Structures of heat shock factor trimers bound to DNA iScience 2021 24 9 102951 34458700 10.1016/j.isci.2021.102951 PMC8379338 78. Jager MJ Hurks HM Levitskaya J Kiessling R HLA expression in uveal melanoma: there is no rule without some exception Human Immunol 2002 63 6 444 451 https://www.sciencedirect.com/science/article/pii/S0198885902003890 12039519 10.1016/s0198-8859(02)00389-0 79. Faby H Hillenkamp J Roider J Klettner A Hyperthermia-induced upregulation of vascular endothelial growth factor in retinal pigment epithelial cells is regulated by mitogen-activated protein kinases Graefe's Arch Clin Exp Ophthalmol 2014 252 11 1737 1745 25047875 10.1007/s00417-014-2750-z 80. Yang H Jager MJ Grossniklaus HE Bevacizumab Suppression of Establishment of Micrometastases in Experimental Ocular Melanoma Invest Ophthalmol Vis Sci 2010 51 6 2835 2842 20089875 10.1167/iovs.09-4755 PMC2874122 81. Du S Liu Y Yuan Y Wang Y et al Advances in the study of HSP70 inhibitors to enhance the sensitivity of tumor cells to radiotherapy Front Cell Dev Biol 2022 10 942828 36036010 10.3389/fcell.2022.942828 PMC9399644 82. Sekihara K Harashima N Tongu M et al Pifithrin-µ, an inhibitor of heat-shock protein 70, can increase the antitumor effects of hyperthermia against human prostate cancer cells PLoS One 2013 8 11 e78772 https://www.ncbi.nlm.nih.gov/pubmed/24244355 24244355 10.1371/journal.pone.0078772 PMC3828328 83. Park H-K Yoon NG Lee J-E et al Unleashing the full potential of Hsp90 inhibitors as cancer therapeutics through simultaneous inactivation of Hsp90, Grp94, and TRAP1 Exp Mol Med 2020 52 1 79 91 31956271 10.1038/s12276-019-0360-x PMC7000702 84. Kim JY Barua S Huang MY et al Heat Shock protein 70 (HSP70) induction: chaperonotherapy for neuroprotection after brain injury Cells 2020 9 9 2020 32887360 10.3390/cells9092020 PMC7563654 85. Rao DD Vorhies JS Senzer N Nemunaitis J siRNA vs. shRNA: similarities and differences Adv Drug Deliv Rev 2009 61 9 746 759 https://www.sciencedirect.com/science/article/pii/S0169409X09000969 19389436 10.1016/j.addr.2009.04.004 86. Kampinga HH Dikomey E Hyperthermic radiosensitization: mode of action and clinical relevance Int J Radiat Biol 2001 77 4 399 408 11304434 10.1080/09553000010024687 87. Pyza E Mak P Kramarz P Laskowski R Heat shock proteins (HSP70) as biomarkers in ecotoxicological studies . Ecotoxicol Environment Safety 1997 38 3 244 251 https://www.sciencedirect.com/science/article/pii/S0147651397915955 10.1006/eesa.1997.1595 9469876 88. Vidyasagar A Wilson NA Djamali A Heat shock protein 27 (HSP27): biomarker of disease and therapeutic target Fibrogenesis Tissue Repair 2012 5 1 7 22564335 10.1186/1755-1536-5-7 PMC3464729 89. Khalil AA Kabapy NF Deraz SF Smith C Heat shock proteins in oncology: diagnostic biomarkers or therapeutic targets? Biochim Biophys Acta (BBA) Rev Cancer 2011 1816 2 89 104 https://www.sciencedirect.com/science/article/pii/S0304419X11000229 10.1016/j.bbcan.2011.05.001 21605630 90. Mittal S Rajala MS Heat shock proteins as biomarkers of lung cancer Cancer Biol Ther 2020 21 6 477 485 32228356 10.1080/15384047.2020.1736482 PMC7515496 91. Faingold D Marshall JC Antecka E et al Immune expression and inhibition of heat shock protein 90 in uveal melanoma Clin Cancer Res 2008 14 3 847 855 18245548 10.1158/1078-0432.CCR-07-0926 92. van den Tempel N Laffeber C Odijk H et al The effect of thermal dose on hyperthermia-mediated inhibition of DNA repair through homologous recombination Oncotarget 2017 8 27 44593 44604 28574821 10.18632/oncotarget.17861 PMC5546504 93. van den Tempel N Zelensky AN Odijk H et al On the mechanism of hyperthermia-induced BRCA2 protein degradation Cancers (Basel) 2019 11 1 97 30650591 10.3390/cancers11010097 PMC6356811 94. Logghe T van Zwol E Immordino B et al Hyperthermia in combination with emerging targeted and immunotherapies as a new approach in cancer treatment Cancers 2024 16 3 505 https://www.mdpi.com/2072-6694/16/3/505 38339258 10.3390/cancers16030505 PMC10854776 95. Hayashi K Nakamura M Sakamoto W et al Superparamagnetic nanoparticle clusters for cancer theranostics combining magnetic resonance imaging and hyperthermia treatment Theranostics 2013 3 6 366 376 23781284 10.7150/thno.5860 PMC3677408 96. Ashfaq UA Riaz M Yasmeen E Yousaf MZ Recent advances in nanoparticle-based targeted drug-delivery systems against cancer and role of tumor microenvironment Crit Rev Ther Drug Carrier Syst 2017 34 4 317 253 https://www.dl.begellhouse.com/journals/3667c4ae6e8fd136,1b1108ac2e63ecbb,28214ea72821037d.html 29199588 10.1615/CritRevTherDrugCarrierSyst.2017017845 97. Jeon S Park BC Lim S et al Heat- generating iron oxide multigranule nanoclusters for enhancing hyperthermic efficacy in tumor treatment ACS Appl Mater Interfaces 2020 12 30 33483 33491 32614594 10.1021/acsami.0c07419 98. Pucci C Degl'Innocenti A Belenli Gümüş M Ciofani G Superparamagnetic iron oxide nanoparticles for magnetic hyperthermia: recent advancements, molecular effects, and future directions in the omics era Biomater Sci 2022 10 2103 2121 35316317 10.1039/d1bm01963e ",
  "metadata": {
    "Title of this paper": "Superparamagnetic iron oxide nanoparticles for magnetic hyperthermia: recent advancements, molecular effects, and future directions in the omics era",
    "Journal it was published in:": "Investigative Ophthalmology & Visual Science",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489863/"
  }
}