{
  "title": "Paper_817",
  "abstract": "pmc World J Gastrointest Surg 1325 worldjgastrosurg WJGS World Journal of Gastrointestinal Surgery 1948-9366 Baishideng Publishing Group Inc PMC12476778 PMC12476778.1 12476778 12476778 41024820 10.4240/wjgs.v17.i9.107301 jWJGS.v17.i9.eid107301 1 Retrospective Study Diagnostic significance of fluorine-18-fluorodeoxyglucose-positron emission tomography/computed tomography in differentiating Edmondson grade II and III hepatocellular carcinoma Niu XB et al 18 Niu Xiao-Bo Department of Nuclear Medicine, The First Affiliated Hospital of Zhengzhou University, Zhengzhou 450052, Henan Province, China Li Yan-Peng Department of Nuclear Medicine, The First Affiliated Hospital of Zhengzhou University, Zhengzhou 450052, Henan Province, China Chao Fang-Fang Department of Nuclear Medicine, The First Affiliated Hospital of Zhengzhou University, Zhengzhou 450052, Henan Province, China Mei Xiao-Li Department of Nuclear Medicine, The First Affiliated Hospital of Zhengzhou University, Zhengzhou 450052, Henan Province, China Han Xing-Min Department of Nuclear Medicine, The First Affiliated Hospital of Zhengzhou University, Zhengzhou 450052, Henan Province, China Wang Rui-Hua Department of Nuclear Medicine, The First Affiliated Hospital of Zhengzhou University, Zhengzhou 450052, Henan Province, China. wangruihua2004@126.com Author contributions: Niu XB conceived, designed the study, and analyzed the data; Li YP and Chao FF guided the study; Niu XB, Mei XL, Han XM, and Wang RH collected the clinical date. All authors drafted and revised the manuscript. Supported by National Natural Science Foundation of China, No. 82171983; and Henan Provincial Science and Technology Research Project, No. 242102311089. Corresponding author: Rui-Hua Wang, DM, Department of Nuclear Medicine, The First Affiliated Hospital of Zhengzhou University, No. 1 Jianshe East Road, Erqi District, Zhengzhou 450052, Henan Province, China. wangruihua2004@126.com 27 9 2025 27 9 2025 17 9 497733 107301 28 5 2025 30 6 2025 6 8 2025 27 09 2025 29 09 2025 30 09 2025 ©The Author(s) 2025. Published by Baishideng Publishing Group Inc. All rights reserved. 2025 https://creativecommons.org/licenses/by-nc/4.0/ This article is an open-access article that was selected by an in-house editor and fully peer-reviewed by external reviewers. It is distributed in accordance with the Creative Commons Attribution NonCommercial (CC BY-NC 4.0) license, which permits others to distribute, remix, adapt, build upon this work non-commercially, and license their derivative works on different terms, provided the original work is properly cited and the use is non-commercial. See: https://creativecommons.org/Licenses/by-nc/4.0/ BACKGROUND Preoperative prognosis assessment of hepatocellular carcinoma (HCC) is crucial, and pathologic grading is a key prognostic determinant that affects patient prognosis. Therefore, accurate determination of pathological grading before surgical intervention is crucial for optimizing treatment strategies and improving prognostic outcomes. AIM To investigate the distinguishing capability of fluorine-18-fluorodeoxyglucose-positron emission tomography/computed tomography ( 18 METHODS We retrospectively assessed the 18 max mean RESULTS Significant differences were observed in SUV max mean P < P = P < max P max max mean P < P CONCLUSION  18 max mean max 18 Hepatocellular carcinoma Fluorine-18-fluorodeoxyglucose Positron emission tomography-computed tomography Metabolic parameters Edmondson grading pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes  Core Tip: 18 18 18 18 INTRODUCTION Hepatocellular carcinoma (HCC), constituting approximately 90% of all primary liver malignancies, establishes itself as the predominant liver cancer type, with its continuously increasing global incidence[ 1 2 3 4 5 6 18 18 18 max 5 7 e.g. 8 9 10 vs vs 11 18 MATERIALS AND METHODS Study cohort This retrospective study enrolled 32 histologically verified solitary HCC cases from March 2021 to April 2023. The patients, who received 18 18 n n 12 Imaging apparatus and protocols A Siemens Biograph Truepoint 64 PET/CT system and a HM-20 medical cyclotron accelerator of the Sumitomo Group of Japan were used to acquire all PET/CT scans. Fasting for ≥ 6 hours was enforced before imaging, and blood glucose levels were strictly regulated at < 11.1 mmol/L. After ensuring that the patient was in a resting state, 18 via Image processing and quantitative analysis PET and CT datasets were co-registered and fused utilizing the Siemens Syngo TrueD workstation. Two highly experienced nuclear medicine physicians, blinded to clinical and pathological details, independently assessed the original and fused images to determine and localize tumor lesions. Using PET/CT images, the tumor margins were manually outlined to define a 3D volume of interest. Conventional metabolic metrics, such as the SUV max mean max max max max Statistical analysis Statistical Package for the Social Sciences version 26.0 was used for data analysis. The Shapiro-Wilk test was applied for data distribution normality assessment. Continuous variables following and deviating from normal distribution were reported as mean ± SD and median (interquartile range), respectively. Group comparisons were performed using independent samples t U P RESULTS Comparative analysis of metabolic parameters between Edmondson grade II and III HCC groups Statistically significant differences were determined between Edmondson grades II and III HCC groups for several metabolic parameters, including SUV max mean P 1 2 P P 1 Figure 1  Hepatocellular carcinoma in the right hepatic lobe, with an Edmondson grade of III (Case 1). Figure 2  Left hepatic lobe hepatocellular carcinoma, with an Edmondson grade of II (Case 2). Table 1 Comparative analysis of metabolic parameters between Edmondson grade II and III hepatocellular carcinoma groups, maximum tumor diameter (interquartile range)   Edmondson grade II ( n  Edmondson grade III ( n   Z   P SUV max 6.43 (4.36-7.73) 13.79 (9.04-17.99) 3.399 0.001 SUV mean 3.24 (2.83-4.145) 6.24 (3.99-6.83) 3.040 0.002 MTV 31.23 (18.91-120.52) 94.7 (41.9-280.0) 1.945 0.052 TLG 107.3 (54.94-384.825) 590.5 (208.9-1828.0) 2.776 0.006 TNR 2.18 (1.405-2.605) 4.76 (2.58-5.62) 2.964 0.003 TBR 3.18 (2.015-4.18) 6.27 (2.93-8.64) 2.663 0.008 Maximum tumor diameter (cm) 5.4 (4.15-7.05) 6.9 (4.8-11.3) 1.984 0.047 Ki67 expression percentage (mean ± SD) 26.76% ± 13.22% 52.3% ± 20.5% 3.356 0.001 SUV max mean Assessment of the discriminatory efficacy of each parameter in differentiating between Edmondson grade II and grade III HCC via ROC curve analysis Among the assessed parameters, SUV max P max 2 3 Figure 3  Receiver operating characteristic curves in differentiating Edmondson grade II and III hepatocellular carcinoma. max mean Table 2 Diagnostic performance of various parameters based on receiver operating characteristic curve analysis   Cutoff  AUC (95%CI)  Sensitivity (%)  Specificity (%)   P SUV max 10.95 0.853 (0.709-0.997) 66.7 100 0.001 SUV mean 4.32 0.816 (0.655-0.976) 73.3 88.2 0.002 TLG 248.1 0.788 (0.630-0.947) 71.5 76.5 0.006 TNR 2.53 0.808 (0.643-0.973) 80 76.5 0.003 TBR 4.46 0.776 (0.597-0.956) 70.2 82.4 0.008 SUV max mean Association between metabolic parameters and Ki67 expression levels A significant positive correlation was identified between Ki67 expression percentage and several metabolic parameters, including SUV max mean r s P r s P r s P r s P DISCUSSION HCC represents a prevalent gastrointestinal malignancy in clinical settings, which is associated with high recurrence, metastasis, and mortality[ 13 18 14 18 18 18 max 15 18 max mean P P et al 16 18 max max P max max max mean The Ki67 protein expression level is intricately related to tumor cell proliferative activity, differentiation, aggressiveness, and patient outcomes[ 17 18 et al 16 max max max mean P P 18 Our studies highlighted the clinical use of 18 18 18 18 18 19 Several limitations should be acknowledged in this study. The first limitation is the single-center design and modest cohort size. Second, pathological data for seven cases were obtained via 18 20 18 CONCLUSION The differentiation between Edmondson grade II and grade III HCC involved 18 max mean max max mean 18 18  Institutional review board statement:  Informed consent statement:  Conflict-of-interest statement:  Provenance and peer review:  Peer-review model:  Specialty type:  Country of origin:  Peer-review report’s classification  Scientific Quality:  Novelty:  Creativity or Innovation:  Scientific Significance:  P-Reviewer: S-Editor: L-Editor: P-Editor: 1 Rumgay H Arnold M Ferlay J Lesi O Cabasag CJ Vignat J Laversanne M McGlynn KA Soerjomataram I Global burden of primary liver cancer in 2020 and predictions to 2040 J Hepatol 2022 77 1598 1606 36208844 10.1016/j.jhep.2022.08.021 PMC9670241 2 Zhang N Yang X Piao M Xun Z Wang Y Ning C Zhang X Zhang L Wang Y Wang S Chao J Lu Z Yang X Wang H Zhao H Biomarkers and prognostic factors of PD-1/PD-L1 inhibitor-based therapy in patients with advanced hepatocellular carcinoma Biomark Res 2024 12 26 38355603 10.1186/s40364-023-00535-z PMC10865587 3 Mak LY Cruz-Ramón V Chinchilla-López P Torres HA LoConte NK Rice JP Foxhall LE Sturgis EM Merrill JK Bailey HH Méndez-Sánchez N Yuen MF Hwang JP Global Epidemiology, Prevention, and Management of Hepatocellular Carcinoma Am Soc Clin Oncol Educ Book 2018 38 262 279 30231359 10.1200/EDBK_200939 4 Lv J Yin H Mao W Shi H Investigating the value of pre-treatment (18)F-FDG PET/CT in predicting the pathological characteristic of hepatocellular carcinoma and recurrence after liver transplantation Abdom Radiol (NY) 2021 46 2490 2497 33386905 10.1007/s00261-020-02872-1 5 Zhang J Jiang S Li M Xue H Zhong X Li S Peng H Liang J Liu Z Rao S Chen H Cao Z Gong Y Chen G Zhang R Zhang L Head-to-head comparison of (18)F-FAPI and (18)F-FDG PET/CT in staging and therapeutic management of hepatocellular carcinoma Cancer Imaging 2023 23 106 37899452 10.1186/s40644-023-00626-y PMC10614420 6 Zhang ZY Cheng HY [Clinical application of positron emission tomography/computed tomography in hepatocellular carcinoma and related research advances] Linchuang Gandanbing Zazhi 2017 33 1365 1368 7 Sokmen BK Inan N 18 F-FDG PET/MRI of Primary Hepatic Malignancies: Differential Diagnosis and Histologic Grading Curr Med Imaging 2024 20 e080523216636 37157218 10.2174/1573405620666230508105758 8 Wu F Cao G Lu J Ye S Tang X Correlation between 18 F-FDG PET/CT metabolic parameters and microvascular invasion before liver transplantation in patients with hepatocellular carcinoma Nucl Med Commun 2024 45 1033 1038 39267532 10.1097/MNM.0000000000001897 PMC11537472 9 Jiang C Ma G Liu Q Song S The value of preoperative 18F-FDG PET metabolic and volumetric parameters in predicting microvascular invasion and postoperative recurrence of hepatocellular carcinoma Nucl Med Commun 2022 43 100 107 34456318 10.1097/MNM.0000000000001478 10 Remnant L Kochanova NY Reid C Cisneros-Soberanis F Earnshaw WC The intrinsically disorderly story of Ki-67 Open Biol 2021 11 210120 34375547 10.1098/rsob.210120 PMC8354752 11 Ning PG Gao F Hai JJ Wu MH Chen J Zhu SC Wang MY Shi DP [Prediction of pathological grading of hepatocellular carcinoma based on enhanced CT radiomics] Zhongguo Yixue Yingxiang Jishu 2020 36 1051 1056 12 Edmondson HA Steiner PE Primary carcinoma of the liver: a study of 100 cases among 48,900 necropsies Cancer 1954 7 462 503 13160935 10.1002/1097-0142(195405)7:3<462::aid-cncr2820070308>3.0.co;2-e 13 Palen A Grégoire E Chopinet S Borentain P Gerolami R Hardwigsen J Liver transplantation for hepatocellular carcinoma after down staging with sorafenib: a monocentric case-matched series J Gastrointestin Liver Dis 2020 29 120 121 32176754 10.15403/jgld-748 14 Wang XY Wang JD Shi PD [Relationship between maximum standardized uptake value of 18F-FDG PET/CT and clinicopathological features of hepatocellular carcinoma] Gandanyi Waike Zazhi 2019 31 144 148 15 Liu DJ Feng YL Yu FW Shi HY He XH Yuan JW Wen GH Huang KM [Comparative study of 18F-FDG PET and histopathology in hepatocellular carcinoma] Zhonghua Heyixue Zazhi 2008 28 307 310 16 Zhang YQ Li BL Yin W Chen SG Shi HC [Correlations between maximum standardized uptake value in 18F-FDG PET/CT and clinical pathological characteristics of moderately to poorly differentiated hepatocellular carcinoma] Zhongguo Linchuang Yixue 2018 25 31 34 17 Lashen AG Toss MS Ghannam SF Makhlouf S Green A Mongan NP Rakha E Expression, assessment and significance of Ki67 expression in breast cancer: an update J Clin Pathol 2023 76 357 364 36813558 10.1136/jcp-2022-208731 18 Kreipe H Harbeck N Christgen M Clinical validity and clinical utility of Ki67 in early breast cancer Ther Adv Med Oncol 2022 14 17588359221122725 36105888 10.1177/17588359221122725 PMC9465566 19 Chiu KWH Chiang CL Chan KSK Hui Y Ren J Wei X Ng KS Lee HFV Chia NH Cheung TT Chan S Chan AC Ng KCK Seto WKW Khong PL Kong FM Dual-tracer PET/CT in the management of hepatocellular carcinoma JHEP Rep 2024 6 101099 38974366 10.1016/j.jhepr.2024.101099 PMC11225831 20 Albano D Calabrò A Dondi F Bagnasco S Tucci A Bertagna F The role of baseline 2-[(18) F]-FDG-PET/CT metrics and radiomics features in predicting primary gastric lymphoma diagnosis Hematol Oncol 2024 42 e3266 38444261 10.1002/hon.3266 Data sharing statement No additional data are available. ",
  "metadata": {
    "Title of this paper": "The role of baseline 2-[(18) F]-FDG-PET/CT metrics and radiomics features in predicting primary gastric lymphoma diagnosis",
    "Journal it was published in:": "World Journal of Gastrointestinal Surgery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476778/"
  }
}