{
  "title": "Paper_413",
  "abstract": "Sci Total Environ Sci Total Environ 319 nihpa The Science of the total environment 0048-9697 1879-1026 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12483935 PMC12483935.1 12483935 12483935 NIHMS2113236 40440850 10.1016/j.scitotenv.2025.179724 NIHMS2113236 NIHPA2113236 1 Article An Approach to Uncover Significant Direct and Mediated Relationships in Multi-Dimensional New Approach Methods (NAMs) Data: A Case Study of Hazard Evaluation of Petroleum UVCBs Zhou Yi-Hui 1 2 * Gallins Paul J. 2 Rusyn Ivan 3 4 Wright Fred A. 1 2 3 * 1 2 3 4 * yihui_zhou@ncsu.edu fred_wright@ncsu.edu 10 7 2025 28 5 2025 985 498036 179724 179724 25 09 2025 01 10 2025 02 10 2025 02 10 2025 New Approach Methods (NAMs) encompass a wide range of data types; it is increasingly common to have highly multi-dimensional data (e.g., cellular, molecular and gene expression effects) on the same chemicals. In addition, chemical structure descriptors (for mono-constituent substances) or fractional composition (for complex substances) inform similarity hypotheses for read-across. Still, the utility of these multi-dimensional datasets for decision-making is difficult to ascertain. To address this challenge, we hypothesized that correlation and mediation analyses methods can be used to uncover significant and interpretable relationships in complex NAMs datasets. We used previously published data on 141 petroleum UVCBs (substances of unknown or variable composition, complex reaction products and biological materials) that included (i) characterization of the polycyclic aromatic compound (PAC) content, (ii) 42 bioactivity measurements from 12 human cell types, and (iii) transcriptomic data from 6 cell types. We explored the relationships among data types and determined how these data can be used for bioactivity-based prioritization. We found that PAC content was highly informative for bioactivity prediction, while the addition of transcriptomic data provided modest improvements. We then applied the statistical procedure of mediation analysis to uncover relationships among transcriptomics, PAC, and bioactivity. The strongest relationships appeared to be nearly completely mediated, and phenotypes with high transcriptomic mediation tended to have high correlation with PAC content. This study shows how a mediation analysis approach can be used to uncover relationships in multi-dimensional NAMs datasets and provides further insights into strategies for hazard prioritization using a combination of transcriptomic and bioactivity data. NAMs toxicity testing mediation dose-response pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "An Approach to Uncover Significant Direct and Mediated Relationships in Multi-Dimensional New Approach Methods (NAMs) Data: A Case Study of Hazard Evaluation of Petroleum UVCBs",
    "Journal it was published in:": "The Science of the total environment",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483935/"
  }
}