{
  "title": "Paper_114",
  "abstract": "pmc Bioinformatics Bioinformatics 716 bioinfo bioinformatics Bioinformatics 1367-4803 1367-4811 Oxford University Press PMC12490829 PMC12490829.1 12490829 12490829 40973685 10.1093/bioinformatics/btaf513 btaf513 1 Applications Note Bioimage Informatics AcademicSubjects/SCI01060 AXZ viewer: a web application to visualize unprocessed AFM-IR data https://orcid.org/0000-0002-6851-7247 Duverger Wouter Conceptualization Software Writing - original draft Writing - review & editing  Switch Laboratory, VIB-KU Leuven Center for Brain and Disease Research Belgium  Switch Laboratory, Department of Cellular and Molecular Medicine, KU Leuven Belgium https://orcid.org/0000-0001-8307-5435 Ramer Georg Conceptualization Funding acquisition Software Writing - review & editing  Institute of Chemical Technologies and Analytics, TU Wien Austria https://orcid.org/0000-0002-4030-1022 Louros Nikolaos Conceptualization Funding acquisition Supervision Writing - review & editing  Center for Alzheimer’s and Neurodegenerative Diseases, Peter O’Donnell Jr. Brain Institute, University of Texas Southwestern Medical Center United States  Department of Biophysics, University of Texas Southwestern Medical Center United States https://orcid.org/0000-0003-2020-0168 Schymkowitz Joost Conceptualization Funding acquisition Supervision Writing - review & editing  Switch Laboratory, VIB-KU Leuven Center for Brain and Disease Research Belgium  Switch Laboratory, Department of Cellular and Molecular Medicine, KU Leuven Belgium https://orcid.org/0000-0002-9189-7399 Rousseau Frederic Conceptualization Funding acquisition Supervision Writing - review & editing  Switch Laboratory, VIB-KU Leuven Center for Brain and Disease Research Belgium  Switch Laboratory, Department of Cellular and Molecular Medicine, KU Leuven Belgium Gao Xin Associate Editor Corresponding authors. Frederic Rousseau, Switch Laboratory, VIB-KU Leuven Center for Brain & Disease Research and Department of Cellular and Molecular Medicine, Herestraat 49 box 901, 3000 Leuven, Belgium. E-mail: frederic.rousseau@kuleuven.be joost.schymkowitz@kuleuven.be 10 2025 19 9 2025 41 10 498210 btaf513 10 1 2025 12 8 2025 09 9 2025 02 10 2025 19 09 2025 03 10 2025 03 10 2025 © The Author(s) 2025. Published by Oxford University Press. 2025 https://creativecommons.org/licenses/by/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution License ( https://creativecommons.org/licenses/by/4.0/ Abstract Motivation Atomic Force Microscopy-based Infrared spectroscopy (AFM-IR) is a novel and innovative method for label-free high-resolution structural biology. However, the nature of the data files generated by AFM-IR instruments precludes investigation by conventional open-source scientific image analysis software suites. As a result, reporting of AFM-IR datasets is not standardized and the data itself is difficult to audit. Results We have developed a web application that allows anyone to open, review, and audit raw AFM-IR data files easily and without deep knowledge of the method. It also exposes all metadata recorded by the microscope at the time of measurement. The web application is based on a Python package that supports custom data analyses within the scientific Python ecosystem. This tool provides an accessible, transparent solution for AFM-IR data review, with the potential to support reproducibility and standardization in AFM-IR research and encourage wider adoption of this innovative spectroscopy method. Availability and implementation The web app is hosted at https://anasys-python-tools-gui.streamlit.app https://github.com/wduverger/anasys-python-tools-gui https://github.com/GeorgRamer/anasys-python-tools Flanders Institute for Biotechnology 10.13039/501100004727 University of Leuven I011220N 1128822N pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction Infrared (IR) absorption spectroscopy is a workhorse in modern life sciences and beyond. It is a collection of physicochemical methods that probe the vibrational energy levels of chemical bonds between atoms and is therefore sensitive to the chemical composition and structural properties of molecules in a sample, such as protein conformation ( Bec et al. Poli et al. Dazzi and Prater 2017 In contrast to SNOM, where light scattered by the sample is interrogated to study its complex refraction coefficient, the AFM-IR readout is absorption-based and mechanical: the probe measures the thermal expansion of a sample upon absorption of the light from an infrared laser. Therefore, AFM-IR spectra conserve proportionality to well-known Fourier Transform Infrared (FTIR) spectra ( Dazzi et al. Ramer et al. Quaroni 2020 AFM-IR has found applications in the mapping of distributions of enzymes, lipids, or drug molecules in whole cells ( Pancani et al. Dos Santos et al. Deniset-Besseau et al. Liu et al. Perez-Guaita et al. Petay et al. Roman et al. Lipiec et al. Ruggeri et al. Waeytens et al. Tseng et al. Brütting et al. Lo et al. Yuan et al. Tseng et al. Dartois et al. The advanced nature of AFM-IR microscopy causes three problems. First, the data files generated by commercial microscopes (such as Bruker nanoIR instruments) are of a particular format that few programs can read. There are solutions, such as Gwyddion ( Nečas and Klapetek 2012 Toplak et al. Table 1 Table 1. Comparison between software suites. This paper Gwyddion Mountains Anasys Studio Quasar Open Source Yes Yes No No Yes Designed for nanoIR Yes Yes No No Yes Spectra Yes No Yes Yes No Images Yes Yes Yes Yes Yes Auditable data analysis Yes (Python) Yes, if using scripts Yes No Yes Can be used without installing Yes No, and involved (docker is easiest) No No, and only available on instrument No Automatic QC Yes No No No No Second, AFM-IR measurements are prone to a range of technical issues that can lead to artefacts if not addressed. Important considerations include: minimizing probe oscillations and absolute deflection to <±0.01 V from the setpoint, by using slow scanning speeds, maintaining the IR pulse frequency at the mechanical resonance modes of the sample-probe system via a properly configured phase-locked-loop (PLL), which tracks the phase difference between IR pulses and the oscillatory thermal expansion of the sample, accounting for the strong and wavelength-dependent absorption of mid-IR light by atmospheric water vapour, and avoiding sample scratching and melting. The third challenge, given the sensitivity of AFM-IR data to instrument settings and environmental factors, is to establish widely accepted data quality standards. This is challenging, but crucial for cross-study comparisons and reproducibility ( Burnham et al. Dos Santos et al. Duverger et al. Here, we publish a freely accessible web application for rapid visualization and quality assessment of raw AFM-IR data, even if further consensus in the field is essential to establish universal data quality and reporting criteria. The application is optimized for preliminary data review and does not support complex multivariate analyses directly within the web interface. Therefore, we also publish a Python library for further analysis of this data using the extensive ecosystem of scientific Python packages. 2 Availability and implementation The web application (version 1.0) is accessible at https://anasys-python-tools-gui.streamlit.app/ https://github.com/wduverger/anasys-python-tools-gui https://doi.org/10.6084/m9.figshare.27991898 The Python library at the foundation of the web app is pip-installable using “pip install anasyspythontools” and its source code is available at https://github.com/GeorgRamer/anasys-python-tools https://doi.org/10.5281/zenodo.14447283 It works by decompressing the .axz files generated by nanoIR systems (Bruker, Germany) and parsing the embedded XML document into a Python object containing all AFM and AFM-IR maps, optical images, and AFM-IR spectra with corresponding metadata. For ease of use, these data structures can be converted to xarray structures ( Hoyer and Hamman 2017 3 Features Upon accessing the web application, the user can easily upload their own data or choose to view an example file. This file is included in the application’s GitHub repository. The data was generated as in our previous work ( Duverger et al. The first view, Optical Images ( Fig. 1a Figure 1. Features of the web application. (a) Localization of maps (not shown) or spectra (dots) within optical reference images. This can aid future measurements on the same sample or provide important context. (b) A subset of metadata properties of IR maps that are easily accessible in the Map Overview page. Users can select which properties to show or hide. (c) AFM-IR quality control view of a set of simultaneously recorded maps, each with a specific colourmap for clarity. Each image is accompanied by a colourbar to interpret image values, as well as line profiles showing trace (blue) and retrace (orange) data, if both were recorded. Note that height maps and deflection maps are minimally processed (linear fit and setpoint subtraction, respectively), while line profiles still show the raw data. (d) Data quality control of AFM-IR spectra, with spatial reference on the left and all available, unprocessed data channels on the right. Spectrum 1 While the Map Overview screen can provide an overview of all maps collected during the experiment and their metadata ( Fig. 1b Fig. 1c Finally, the Spectra tab ( Fig. 1d The foundation of the graphical user interface is a pip-installable Python package parsing the data in nanoIR data files (with .axz extension) into numpy or xarray objects, allowing for advanced data analysis and visualization procedures leveraging the scientific Python ecosystem ( Ramer et al. Duverger et al. The primary function of the package, anasyspythontools.read(filepath), takes a file path to a .axz file as an argument and returns an object of type AnasysDoc. This object contains optical images, AFM-IR maps, and spectra as the dictionaries AnasysDoc.Images, AnasysDoc.HeightMaps, and AnasysDoc.RenderedSpectra respectively. Each dictionary contains objects that store both the experimental data (through the property SampleBase64), and metadata (through its other properties). These property names are chosen to match the underlying XML representation. Additionally, images, maps, and spectra can be converted to xarray objects using functions in anasyspythontools.export module. For usage examples, please refer to the Jupyter notebook located in the examples folder of the package’s GitHub repository. To ensure the usefulness of this application, we solicited community feedback from two independent research groups and performed benchmarking of its most critical components. Both research groups found this application to be a valuable addition to the field and suggested some minor enhancements, such as the possibility to export spectra as a CSV file, discussed above. The tool has already been integrated into internal workflows for rapid and interactive visualization of AFM-IR data, while away from the instrument. It also guides data analysis decisions, which are then performed using the associated Python library. In fact, similar quality assessments performed with this tool have appeared in the supplementary materials of previously published studies ( Duverger et al. Regarding the application’s performance, the included example file has a size of 26 MB. The application accepts files up to 200 MB, while the instrument’s measurement software prohibits files above 50 MB. On the example file, upload takes around 15 s, depending on the connection, and generating a full map QC report takes another 10 s. However, a caching system is in place to speed up subsequent page views. Because the cache is saved to Streamlit’s session state, it is user-specific and purged on disconnection. At this point, the bottleneck is the repeated downloading of the image data from the Streamlit servers to the local viewer. Users who need to view many files and wish a faster application can easily download and install the application locally, following the instructions provided in the GitHub repository. Finally, since the public version is hosted on Streamlit Cloud, it will be shut down after 24 h of inactivity. Booting it up takes around 40 s. 4 Discussion We report the development of a Python package to parse AFM-IR data files enabling advanced data analysis, and a web application for viewing their contents without the need for installation of any software. By providing accessible tools for data review, we aim to enable both experienced and new users to critically assess the quality of AFM-IR data. Our tool supports the broader adoption of open data practices, promoting the publication of raw data and code to facilitate reproducible research across the field. The web application intentionally has a limited scope, with the goal of making data visualization as easy and as fast as possible for users and non-users alike. Since data analysis is much more application-specific, we prefer to use the Python package, which can easily interface with the broad scientific ecosystem of Python libraries. As such, we foresee limited future expansions, except to improve compatibility with additional file formats, such as those generated by the newest line of commercially available nanoIR instruments (such as the IconIR series of instruments, by Bruker), or to maintain alignment with evolving data quality standards in the AFM-IR community. Acknowledgements We thank Cody Schindler for the initial development of anasys-python-tools, which we adapted and extended. LLMs were used for writing code and correcting text. Author contributions Wouter Duverger (Conceptualization [equal], Software [equal], Writing—original draft [equal], Writing—review & editing [equal]), Georg Ramer (Conceptualization [equal], Funding acquisition [equal], Software [equal], Writing—review & editing [equal]), Nikolaos Louros (Conceptualization [equal], Funding acquisition [equal], Supervision [equal], Writing—review & editing [equal]), Joost Schymkowitz (Conceptualization [equal], Funding acquisition [equal], Supervision [equal], Writing—review & editing [equal]), and Frederic Rousseau (Conceptualization [equal], Funding acquisition [equal], Supervision [equal], Writing—review & editing [equal]) Conflict of interest: None declared. Funding This work was supported by the Flanders Institute for Biotechnology (VIB); the University of Leuven (KU Leuven); the Fund for Scientific Research Flanders (FWO) [I011220N to F.R., 1128822N to W.D.]; the Thomas O. Hicks Scholarship in Medical Research [to N.L.]; and the European Commission’s Horizon 2020 project “TUMOR-LN-oC” [953234 to G.R.]. Data availability The data underlying this article are available in GitHub, at https://github.com/wduverger/anasys-python-tools-gui https://doi.org/10.6084/m9.figshare.27991898 References Bec KB Grabska J Huck CW. Biomolecular and bioanalytical applications of infrared spectroscopy—a review Anal Chim Acta 2020 1133 150 77 10.1016/j.aca.2020.04.015 32993867 Brütting C Dreier J Bonten C et al Sustainable immiscible polylactic acid (PLA) and poly(3-hydroxybutyrate-co-3-hydroxyvalerate) (PHBV) blends: crystallization and foaming behavior ACS Sustain Chem Eng 2023 11 6676 87 10.1021/acssuschemeng.3c00199 Burnham NA Lyu L Poulikakos L. Towards artefact-free AFM image presentation and interpretation J Microsc 2023 291 163 76 10.1111/jmi.13193 37209295 Dartois E Kebukawa Y Yabuta H et al Chemical composition of carbonaceous asteroid Ryugu from synchrotron spectroscopy in the mid- to far-infrared of Hayabusa2-returned samples Astronomy Astrophysics 2023 671 A2 10.1051/0004-6361/202244702 Dazzi A Glotin F Carminati R. Theory of infrared nanospectroscopy by photothermal induced resonance J Appl Phys 2010 107 124519 10.1063/1.3429214 Dazzi A Prater CB. AFM-IR: technology and applications in nanoscale infrared spectroscopy and chemical imaging Chem Rev 2017 117 5146 73 10.1021/acs.chemrev.6b00448 27958707 Deniset-Besseau A Coat R Moutel B et al Revealing lipid body formation and its subcellular reorganization in oleaginous microalgae using correlative optical microscopy and infrared nanospectroscopy Appl Spectrosc 2021 75 1538 47 10.1177/00037028211050659 34608808 Dos Santos VD Heydenreich A Derntl R et al Nanoscale infrared spectroscopy and chemometrics enable detection of intracellular protein distribution Anal Chem 2020 92 15719 25 10.1021/acs.analchem.0c02228 33259186 PMC7745202 Dos Santos VD Hondl A Ramos-Garcia N et al AFM-IR for nanoscale chemical characterization in life sciences: recent developments and future directions ACS Meas Sci Au 2023 3 301 14 10.1021/acsmeasuresciau.3c00010 37868358 PMC10588935 Duverger W Tsaka G Khodaparast L et al An end-to-end approach for single-cell infrared absorption spectroscopy of bacterial inclusion bodies: from AFM-IR measurement to data interpretation of large sample sets J Nanobiotechnol 2024 22 406 10.1186/s12951-024-02674-3 PMC11234752 38987828 Hoyer S Hamman J. xarray: N-D labeled arrays and datasets in Python J Open Res Softw 2017 5 10 10.5334/jors.148 Lipiec E Ruggeri FS Benadiba C et al Infrared nanospectroscopic mapping of a single metaphase chromosome Nucleic Acids Res 2019 47 e108 10.1093/nar/gkz630 31562528 PMC6765102 Liu Z Zeng H Xu K et al AFM-IR probing the influence of polarization on the expression of proteins within single macrophages J Mater Chem B 2021 9 2909 17 10.1039/D0TB02584D 33885646 Lo MKF Dazzi A Marcott CA et al Nanoscale chemical-mechanical characterization of nanoelectronic low-kDielectric/Cu interconnects ECS J Solid State Sci Technol 2016 5 P3018 24 10.1149/2.0041604jss Nečas D Klapetek P. Gwyddion: an open-source software for SPM data analysis Open Phys 2012 10 181 8 10.2478/s11534-011-0096-2 Pancani E Mathurin J Bilent S et al High‐resolution label‐free detection of biocompatible polymeric nanoparticles in cells Particle Particle Syst Characterization 2018 35 1700457 10.1002/ppsc.201700457 Perez-Guaita D Kochan K Batty M et al Multispectral atomic force microscopy-infrared nano-imaging of malaria infected red blood cells Anal Chem 2018 90 3140 8 10.1021/acs.analchem.7b04318 29327915 Petay M Cherfan M Bouderlique E et al Multiscale approach to provide a better physicochemical description of women breast microcalcifications Comptes Rendus Chimie 2022 25 553 76 10.5802/crchim.210 Poli T Chiantore O Giovagnoli A et al FTIR imaging investigation in MIR and in an enlarged MIR-NIR spectral range Anal Bioanal Chem 2012 402 2977 84 10.1007/s00216-012-5765-5 22327966 Quaroni L. Understanding and controlling spatial resolution, sensitivity, and surface selectivity in resonant-mode photothermal-induced resonance spectroscopy Anal Chem 2020 92 3544 54 10.1021/acs.analchem.9b03468 32023046 Ramer G Aksyuk VA Centrone A. Quantitative chemical analysis at the nanoscale using the photothermal induced resonance technique Anal Chem 2017 89 13524 31 10.1021/acs.analchem.7b03878 29165992 PMC5841475 Ramer G dos Santos ACV Zhang Y et al Image processing as basis for chemometrics in photothermal atomic force microscopy infrared imaging Adv Chem Microscopy Life Sci Transl Med 2023 12392 45 10.1117/12.2651424 Roman M Wrobel TP Panek A et al Nanoscale AFM-IR spectroscopic imaging of lipid heterogeneity and effect of irradiation in prostate cancer cells Nanotechnology 2019 30 425502 10.1088/1361-6528/ab31dd 31300624 Ruggeri FS Sneideris T Vendruscolo M et al Atomic force microscopy for single molecule characterisation of protein aggregation Arch Biochem Biophys 2019 664 134 48 10.1016/j.abb.2019.02.001 30742801 PMC6420408 Toplak M Read ST Sandt C et al Quasar: easy machine learning for biospectroscopy Cells 2021 10 2300 10.3390/cells10092300 34571947 PMC8466383 Tseng Y-H Fan Y-C Chang C-T et al Photoinduced alignment under solvent vapor annealing (PA-SVA): enhanced ordering and patterning in block copolymer films ACS Appl Polym Mater 2022 4 8536 42 10.1021/acsapm.2c01453 Waeytens J Mathurin J Deniset-Besseau A et al Probing amyloid fibril secondary structures by infrared nanospectroscopy: experimental and theoretical considerations Analyst 2021 146 132 45 10.1039/d0an01545h 33107501 Yuan Y Chae J Shao Y et al Photovoltaic switching mechanism in lateral structure hybrid perovskite solar cells Adv Energy Mater 2015 5 1500615 10.1002/aenm.201500615 ",
  "metadata": {
    "Title of this paper": "Photovoltaic switching mechanism in lateral structure hybrid perovskite solar cells",
    "Journal it was published in:": "Bioinformatics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490829/"
  }
}