{
  "title": "Paper_811",
  "abstract": "pmc J Kidney Cancer VHL J Kidney Cancer VHL 3165 jkcvhl JKCVHL Journal of Kidney Cancer and VHL 2203-5826 Codon Publications PMC12476826 PMC12476826.1 12476826 12476826 41024941 10.15586/jkc.v12i3.409 JKCVHL-12-047 1 Original Article Expression of Follicle-Stimulating Hormone Receptor in Von Hippel-Lindau Associated Tumors and Cysts: An Immunohistochemical Study Ghinea Nicolae 1 2 Frosch Maximilian 3 Couvelard Anne 4 Elezkurtaj Sefer 5 Rebours Vinciane 6 Camparo Philippe 7 Guillonneau Bertrand 8 Gizaw Christine Julia 9 Klingler Jan-Helge 9 1 2 3 4 5 6 7 8 9 Author for correspondence: nicolae.ghinea@inserm.fr Academic Editor: 24 9 2025 2025 12 3 492293 47 57 30 4 2025 03 9 2025 24 09 2025 29 09 2025 30 09 2025 Copyright: 2025 https://creativecommons.org/licenses/by/4.0/ License http://creativecommons.org/licenses/by/4.0 Von Hippel-Lindau (VHL) disease is a hereditary condition caused by mutations in the VHL ccRCC CNS-Hemangioblastoma Kidney Cancer panNET VHL pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Follicle-stimulating hormone (FSH), a central hormone of mammalian reproduction, is a glycoprotein produced in the anterior pituitary gland, and the classical target organs are the ovary and testis. FSH exerts its biological role by binding to FSH-receptor (FSHR). FSHR exists as four alternatively spliced isoforms of which three are cell surface membrane glycoproteins: FSHR1, FSHR2, and FSHR3, and a soluble binding protein, FSHR4 ( 1 2 3 FSHR1, the full length form of FSHR (mature glycoprotein protein of 678 amino acids, Mr=87 kDa), is a G-protein-coupled receptor. It possesses the distinctive pattern of seven transmembrane spanning domains and has a large extracellular domain responsible for the high-affinity binding of FSH. This extracellular domain is encoded by the first nine exons of FSHR 4 cyclase. In adult humans and animals, FSHR1 is mainly expressed in ovarian granulosa cells, testicular sertoli cells (SC), and minimally expressed on the endothelium lining the gonadal BV ( 5 6 7 5 8 14 5 15 16 17 FSHR3, a truncated isoform (exons 1–8), has an extracellular hormone-binding domain of 242 amino acids and behaves as a growth factor type 1 receptor that acts through calcium signaling and the MAPK/ERK pathway. It is predominant in ovarian surface epithelial cells and cancer cells. FSH/FSHR3-stem cell interaction is responsible for ovarian cancer cell proliferation ( 2 Von Hippel-Lindau (VHL) disease is a hereditary condition caused by mutations in the VHL 18 The idea to check FSHR1 expression in VHL-associated tumors originated during our earlier work ( 5 We conducted an immunohistochemical study to assess FSHR1-expression in VHL-associated tumors including ccRCC, CNS-hemangioblastoma, and panNET. Materials and Methods Tissue specimens The present study included 71 patients diagnosed with VHL-associated tumors (41 (58%) were women and 30 (42%) were men ( Table 1 2 Table 1: Patients’ characteristics. Tumor type Location Patients Females Males Number Age Number Age CNS-Hemangioblastoma Cerebellum 10 46(17-67) 14 48(21-58) Spinal cord 6 2(19-55) 6 9(19-50) Intradural/extramedular 3 56(25-73) 2 49(44-55) Brain stem 1 62 0 0 panNET Pancreas 12 5(8-55) 5 43(27-59) ccRCC Kidney 9 47(37-63) 33 37(34-55) * Median age Ethical approval The study was performed in accordance with the Declaration of Helsinki and received ethical approval from the Institutional Review Board (IRB) 00006477 of HUPNVS, Paris 7 University, AP-HP, Paris, France, and Research Ethics Committee at the University Freiburg Medical Center (approval number 10008/09). All patients and donors have given written informed consent to the operation and the use of samples for research. Antibodies The mouse anti-human FSHR antibody 323 was purified from a Hybridoma (American Type Culture Collection number CRL-2689) purchased in 2004. The mouse anti-hFSHR1 monoclonal antibody A02 (RRID: AB_3677298) was supplied by FSHR-Theranostics (Paris, France). FSHR1A02 recognizes an epitope present only in hFSHR1 and absent in hFSHR3, LHR, and TSHR. Goat-anti-mouse IgG-horseradish peroxidase (Sigma-Aldrich Catalog number A3673, RRID: AB_258426) and goat-anti-mouse IgG-Alexa 555 (Invitrogen, ThermoFisher Scientific Catalog Number A-21442; RRID: AB_2535845) were used as secondary antibodies in immunohistochemistry and in immunofluorescence microscopy, respectively. Chemicals Diaminobenzidine (DAB) was from Dako A/S, Glostrup, Denmark. Goat serum, 3-amino-9-ethylcarbazole (AEC), and hematoxylin Gill solution n°3 were purchased from Sigma-Aldrich, Saint-Quentin Fallavier, France. DAPI (4’, 6-diamidino-2-phenylidole) was from Invitrogen, ThermoFisher Scientific. Immunohistochemistry The present immunohistochemistry study was performed at Institut de Pathologie des Hauts-de-France, Amiens, France. Formaldehyde-fixed, paraffin-embedded (FFPE) sections (5 µm) were mounted on positively charged SuperFrost Ultra Plus/SuperFrost microscope slides (Thermo Scientific). Immunohistochemistry was implemented on the automated immuno-histochemical stainer (Leica Bond RX, Leica Biosystems). FFPE slides were deparaffinized within the staining instrument and immunostained according to the manufacturer’s guidelines. Antigen retrieval was performed by incubating slides at high temperature with 10 mM citrate buffer, pH = 6. Paraffin sections of human testis, VHL-associated tumors and cysts were immunolabeled with the mouse anti-hFSHR1 monoclonal A02 antibody (concentration: 0.2 µg/mL). Goat anti-mouse IgG (Fc-specific) coupled to horseradish peroxidase (Sigma, 1:200 dilution) was used as secondary antibody. As chromogen, we used 3-amino-9-ethylcarbazole (AEC) and 3,3’-diamino- benzidine (DAB). The hFSHR1 expression by blood microvessels and tumor cells has been analyzed on digital images from whole images of sections obtained by using the high-throughput “Lamina slide scanner” from Akoya Perkin Elmer, available in Cochin Institute, Paris. The virtual slides were observed with Case Viewer, a specific software downloadable free of charge from the internet. Immunofluorescence microscopy L-cells permanently expressing the hFSHR1 ( 19 EC50 determination of mouse anti-hFSHR1 monoclonal antibodies 323 and A02 In order to characterize and to check whether the mouse anti-hFSHR monoclonal antibody A02 retains specificity for hFSHR and whether it binds to this receptor with higher affinity than the parental FSHR323, a binding fluorescence-activated cell sorting (FACS) experiment using different antibody concentrations and hFSHR-L cells, WT-L-cells, and L-cells expressing hLHR was performed. The binding of the mouse anti-hFSHR monoclonal antibodies 323 and A02 to the cells was detected by using an anti-mouse IgG conjugated to APC (BD Bioscience). In situ hybridization To localize the mRNA encoding for hFSHR1 within the endothelial cells of BV nourishing the VHL-associated ccRCC tumors (paraffin-embedded tissues), we used a 45-mer cDNA antisense oligonucleotide (5’-AAT-CCA-GCC-CAT-CAC-CAT-GAT-ACT-GGC-AGC-ATG-GCG-GAG-CTG-CAC-3’) complementary to the 1441–1486 base pair region of the FSHR1 sequence ( 5 20 Results Expression of FSHR1 by cells in VHL-associated tumors: Antibodies’ validation The FSHR1-isoform shares structural similarities with other two glycoprotein hormone receptors, namely, hLHR and hTSHR. Therefore, highly specific antibodies should avoid cross-reactivity with these receptors. By using viral-like particles of hFSHR1, hTSHR, and hLHR generated by expression of hFSHR1 (aa16-695), hTSHR (aa21-764), and hLHR (aa27-699) in HEK293 cells, Möker et al 12 To examine the expression pattern of FSHR1 on paraffin-embedded VHL-associated tumors, we used a clone of the maturated monoclonal antibody FSHR323, the mouse anti-hFSHR1 monoclonal antibody A02. As illustrated in Figure 1 ) Figure 1: Immunohistochemical detection of FSHR1 in human testis and cultured L-cells permanently expressing the hFSHR1 receptor. (A) Immunohistochemical analysis was performed on paraffin-embedded sections of normal human testis tissue with the use of the anti-FSHR1 monoclonal antibody A02, followed by a secondary peroxidase-coupled antibody visualized with the use of the AEC red-brown peroxidase reaction product. Immunoreactivity was noticed in Sertoli cells (SC) of seminiferous tubules (ST). As expected, there was no signal for FSHR1 in spermatogonia (arrowheads), pachytene spermatocytes (PS), interstitial Leydig cells (LC), and in myoepithelial cells MC). Bar: 50 µm. (B) Immunofluorescence analysis performed on L-cells permanently expressing FSHR1, indicating cell surface expression of the receptor (arrowhead). The binding of the mouse anti-human FSHR1 monoclonal antibody A02 to FSHR1 was visualized with the use of the goat anti-mouse IgG-Alexa 555 (red fluorescence). Bar: 50 µm. (C) EC50 determination of FSHR323 and FSHR1A02 in hFSHR-L cells. The FSHR1A02 antibody retains specificity for hFSHR1 and binds to this receptor with higher affinity than the parental FSHR323. No binding was noted for an irrelevant mouse IgG2a antibody. FSHR1 expression in VHL-associated ccRCC and renal cysts The endothelial cells of BV expressed FSHR1 in 100% of VHL-patients with ccRCC ( Figure 2 Figure 2 ) Figure 2 In situ Figure 2 Figure 2 Table 2 Table 2: FSHR1 expression in VHL-associated tumors. Tumor type Location Patients with FSHRl expression in Blood Vessels m positive cases/n all cases (%) Tumor cells m positive cases/n all cases (%) CNS-Hemangioblastoma Cerebellum 24/24 (100) 23/24 (96) Spinal cord 12/12 (100) 12/12 (100) Brain stem 1/1 (100) 1/1 (100) lntradural 5/5 (100) 5/5 (100) panNET Pancreas 17/17 (100) 15/17 (88) ccRCC Kidney 12/12 (100) 0/12 (0) FSHR1 expression in VHL-associated CNS-hemangioblastoma CNS-hemangioblastoma is a benign highly vascular tumor. Immunohistochemical staining revealed that FSHR1 is uniformly expressed in BV through the tumor in 100% of the cases with CNS-hemangioblastoma ( Table 2 Figure 3 Figure 3 Figure 3 Figure 3 Figure 3 Figure 3 Figure 3 Figure 2: FSHR1 expressions in VHL-associated ccRCC tumors and renal cysts. (A,B) ccRCC and renal cysts, respectively. FSHR1 is detectable in blood vessel endothelial cells (arrows). By contrast, the epithelial cells are FSHR1-negative (arrowheads). (C) Normal kidney tissue with negative blood vessels for the FSHR1 (arrow). (D) In situ hybridization confirmation of the identity of the antigen recognized in tumor blood vessels (BV) by the FSHR1A02 antibody. FSHR1-mRNA was revealed with a biotinylated probe that was detected by a streptavidin–alkaline phosphatase conjugate, and visualized by the purple phosphatase-reaction product. The sections were counterstained with methyl green. Bars: 50 µm. Figure 3: FSHR1 expression in VHL-associated CNS-hemangioblastoma. Immunohistochemical analysis was performed on paraffin-embedded sections of hemangioblastoma tissues with the use of the FSHR1A02 antibody, followed by a secondary peroxidase-coupled antibody visualized with the use of the brown peroxidase-reaction product of DAB. Sections were also stained with hematoxylin. Strong signal for FSHR1 was detectable in the endothelial cells of tumor’s large blood vessels (asterisks) and capillaries (arrowheads) supplying the VHL-associated hemangioblastoma located in cerebellum (A), brain stem (C), spinal cord (E), and intradural/extramedular (G). Tumor stromal cells (arrows) were also stained for FSHR1, especially in hemangioblastoma located in cerebellum, brain stem, and spinal cord. No FSHR1 was detectable in the normal tissues at the periphery of hemangioblastoma tumors located in cerebellum (B), brain stem (D), spinal cord (F), and intradural/extramedular (H). Bars: 50 µm. FSHR1 expression in VHL-associated panNET FSHR1 also appears in BV endothelial cells lining the vasculature of 100% of VHL-patients with panNET. In these samples, FSHR1 was also detected in the tumor cells in 88% of the patients ( Figure 4 Table 2 Figure 4B Figure 4: FSHR1 expression in VHL-associated pancreatic neuroendocrine tumors. The blood vessels (asterisks) and epithelial tumor cells (arrowheads) are FSHR1-positive (A). Similar staining was noticed when the FSHR1A02 antibody was replaced by the parent FSHR323 antibody (A, inset). No staining for FSHR1 was noted for normal human pancreas tissue (B). Bars: 50 µm. Discussion FSHR has often been restricted to the reproductive system where its biological role was confined to gonads, ovarian granulosa cells, testicular SC, and BVBV supplying gonads. However, over the past decades, several studies from different laboratories reported the expression of FSH receptors in extra gonadal tissues mediating FSH activity there. Mariani et al 21 et al 22 et al 5 et al 9 Several laboratories tried to trace the complex signaling pathways connecting FSH/FSHR to its ectopic expressions in various pathologies including cancer biology. RT-PCR analysis did not always find FSHR transcripts, and some scientists believe that the solution should be found by further investigating the expression of FSHR1 and FSHR3 isoforms and their specific role in pathological angiogenesis and cancer cell proliferation, respectively. At the same time, they point out the need for antibodies of high specificity ( 2 Our recent findings in atherosclerosis reported FSHR1 expression in endothelial cells induced by oxidative stress generated by the accumulation of lipoproteins in the intima of large and medium arteries. In early stages of atherosclerosis, FSH/FSHR1 signaling, involved in the endothelial expression of VCAM1 upregulation, should have a positive role facilitating monocyte recruitment and diapedesis, a process beneficial for lipid clearance. In contrast, in later stages of the disease, FSHR1 expressed in macrophages has a negative role by driving VEGF secretion leading to angiogenesis and plaque instability ( 17 Previous studies have shown that FSHR1 activation by FSH in ovarian granulosa cells ( 23 24 25 Recent studies indicate that FSHR1 expression is influenced by TGF-beta1, a polypeptide factor involved in physiological ( 26 27 28 In this study, we show results from FSHR1 expression analysis in 71 samples of VHL-associated tumors representing ccRCC, panNET, and CNS-hemangioblastoma located in cerebellum, spinal cord, intradural/extramedullary, and brain stem. In each tumor analyzed, we detected FSHR1 expression by tumor endothelial cells throughout the tumor. A recent study confirms the presence of FSHR 29 The VHL-associated tumors are typically benign, except for the VHL-associated ccRCC. Their treatment depends on several factors including type, size, location of the tumors, as well as the patient’s overall health and preferences. Common treatment options include surgical removal of the tumor and radiation therapy ( 30 31 Beyond its diagnostic relevance, FSHR1 expression may also hold predictive value for therapeutic response in VHL-associated tumors. In our previous work ( 35 Taken together, our results indicate that FSHR1 is not a ubiquitous or random marker but a highly restricted receptor normally confined to reproductive tissues. Its ectopic expression in tumor endothelium has been demonstrated in multiple studies ( 5 15 36 Conclusion This study provides the first evidence of FSHR1 expression in tumor BV and cells, in VHL-associated tumors. Acknowledgements The authors are grateful for the excellent technical assistance of Blaise Robin, Christophe Pichon, and François Planeix. How to cite: Authors’ Contribution NG designed the research, conducted data analysis, interpreted the data, and wrote the main manuscript. MF, AC, SE, and PC reviewed the original slides and interpreted the data. BG, CG, and JHK critically revised the article. All authors approved the final article for submission. Conflict of Interest MF, AC, SE, VR, PC, BG, CG, and JHK declare that they have nothing to declare. NG is an inventor on US Patent 20210130481. Funding None. 1. Sairam MR Babu PS The tale of follitropin receptor diversity: A recipe for fine tuning gonadal responses? Molecular and Cellular Endocrinology 2007 260–262 163 171 10.1016/j.mce.2005.11.052 17081682 2. Bhartiya D Patel H An overview of FSH-FSHR biology and explaining the existing conundrums Journal of Ovarian Research 2012 14 1 144 10.1186/s13048-021-00880-3 PMC8557046 34717708 3. Haldar S Agrawal H Saha S Straughn AR Roy P Kakar SS Overview of follicle stimulating hormone and its receptors in reproduction and in stem cells and cancer cells International Journal of Biological Sciences 2022 18 2 675 692 10.7150/ijbs.63721 35002517 PMC8741861 4. Gromoll J Pekel E Nieschlag E The structure and organization of the human follicle-stimulating hormone receptor (FSHR) gene Genomics 1996 35 2 308 311 10.1006/geno.1996.0361 8661143 5. Radu A Pichon P Camparo P Antoine M Allory Y Couvelard A et al Expression of follicle-stimulating hormone receptor in tumor blood vessels New England Journal of Medicine 2010 363 17 1621 1630 10.1056/NEJMoa1001283 20961245 6. Vu Hai MT Lescop P Loosfelt H Ghinea N Receptor-mediated transcytosis of follicle-stimulating hormone through the rat testicular microvasculature Biology of the Cell 2004 96 2 133 144 10.1016/j.biolcel.2003.11.008 15050368 7. Stilley JAW Christensen DE Dahlem KB Guan R Santillan DA England SK et al FSH receptor (FSHR) expression in human extragonadal reproductive tissues and the developing placenta, and impact of its deletion on pregnancy in mice Biology of Reproduction 2014 91 3 74 10.1095/biolreprod.114.118562 25100706 PMC4435062 8. Siraj MA Pichon C Radu A Ghinea N Endothelial follicle stimulating hormone receptor in primary kidney cancer correlates with subsequent response to sunitinib Journal of Cellular and Molecular Medicine 2012 16 9 2010 2016 10.1111/j.1582-4934.2011.01495.x 22129368 PMC3822971 9. Renner M Goeppert B Siraj AM Radu A Penzel R Wardelmann E et al Follicle-stimulating hormone receptor expression in soft tissue sarcomas Histopathology 2013 63 1 29 35 10.1111/his.12135 23659266 10. Siraj A Desestret V Antoine M Fromont G Huerre M Sanson M et al Expression of follicle-stimulating hormone receptor by the vascular endothelium in tumor metastases BMC Cancer 2013 13 246 10.1186/1471-2407-13-246 23688201 PMC3663659 11. Planeix F Siraj MA Bidard FC Robin B Pichon C Sastre-Garau X et al Endothelial follicle-stimulating hormone receptor expression in invasive breast cancer and vascular remodeling at tumor periphery Journal of Experimental & Clinical Cancer Research 2015 34 1 12 10.1186/s13046-015-0128-7 25652007 PMC4321709 12. Möker N Peters S Rauchenberger R Ghinea N Kunz C Antibody selection for cancer target validation of FSH-receptor in immunohistochemical settings Antibiotics (Basel) 2017 6 4 15 10.3390/antib6040015 31548530 PMC6698838 13. Ghinea N Robin B Pichon C Leclere R Nicolas A Chnecker C et al Vasa nervorum angiogenesis in prostate cancer with perineural invasion Prostate 2019 79 6 640 646 10.1002/pros.23771 30663097 14. Cheung J Lokman NA Abraham RD Macpherson AM Lee E Grutzner F et al Reduced gonadotrophin receptor expression is associated with a more aggressive ovarian cancer phenotype International Journal of Molecular Sciences 2020 22 1 71 10.3390/ijms22010071 33374698 PMC7793521 15. Robin B Planeix F Sastre-Garou X Pichon C Kold Olesen T Gogusev J et al Follicle-stimulating hormone receptor expression in endometriotic lesions and the associated vasculature: An immunohistochemical study Reproductive Sciences 2016 23 7 885 891 10.1177/1933719115623647 26704526 16. Ponikwicka-Tyszko D Chrusciel M Stelmaszewska J Bernaczyk P Sztachelska M Sidorkiewicz P et al Functional expression of FSH receptor in endometriotic lesions The Journal of Clinical Endocrinology & Metabolism 2016 101 7 2905 2914 10.1210/jc.2016-1014 27224263 17. Ghinea N Liehn EA Grommes J Delattre DD Kold Olesen T Follicle-stimulating hormone receptor expression in advanced atherosclerotic plaques Scientific Reports 2024 14 1 10176 10.1038/s41598-024-60962-2 38702476 PMC11068877 18. Zagzag D Zhong H Scalzitti JM Laughner E Simons JW Semenza GL Expression of hypoxia-inducible factor 1alpha in brain tumors. Association with angiogenesis, invasion, and progression Cancer 2000 88 11 2606 2618 10.1002/1097-0142(20000601)88:11&#x0003c;2606::AID-CNCR25&#x0003e;3.0.CO;2-W 10861440 19. Vannier B Loosfelt H Meduri G Pichon C Milgrom E Anti-human FSH receptor antibodies: Immunochemical and immunocytochemical characterization of the receptor Biochemistry 1996 35 5 1358 1366 10.1021/bi952290f 8634264 20. Böckers TM Nieschlag E Kreutz MR Bergmann M Localization of follicle-stimulating hormone immunoreactivity and hormone receptor mRNA in testicular tissue of infertile men Cell and Tissue Research 1994 278 3 595 600 10.1007/BF00331379 7850869 21. Mariani S Salvatori L Basciani S Arizzi M Franco G Petrangeli E et al Expression and cellular localization of follicle-stimulating hormone receptor in normal human prostate, benign prostatic hyperplasia and prostate cancer Journal of Urology 2006 175 2072 7 10.1016/S0022-5347(06)00273-4 16697805 22. Ben-Josef E Yang SY Ji TH Bidart J-M Garde SV Chopra D et al Hormone-refractory prostate cancer cells express functional follicle-stimulating hormone receptor (FSHR) Journal of Urology 1999 161 970 6 10.1016/S0022-5347(01)61831-7 10022736 23. Alam H Weck J Maizels E Park Y Lee EJ Ashcroft M et al Role of the phosphatidylinositol-3-kinase and extracellular regulated kinase pathways in the induction of hypoxia-inducible factor (HIF)-1 activity and the HIF-1 target vascular endothelial growth factor in ovarian granulosa cells in response to follicle-stimulating hormone Endocrinology 2009 150 2 915 928 10.1210/en.2008-0850 18845636 PMC2646536 24. Galardo MN Gorga A Merlo JP Regueira M Pellizzari EH Cigorraga SB et al Participation of HIFs in the regulation of Sertoli cell lactate production Biochimie 2017 132 9 18 10.1016/j.biochi.2016.10.006 27750035 25. Kaelin Jr WG Von Hippel-Lindau disease: Insights into oxygen sensing, protein degradation, and cancer Journal of Clinical Investigation 2022 132 18 e162480 10.1172/JCI162480 36106637 PMC9479583 26. Du X Zhang LF Li XY Liu HL Li QF TGF-β signaling controls FSHR signaling-reduced ovarian granulosa cell apoptosis through the SMAD4/miR-143 axis Cell Death & Disease 2016 7 e2476 10.1038/cddis.2016.379 27882941 PMC5260897 27. Tzavlaki K Moustakas A TGF-beta signaling Biomolecules 2020 10 3 487 10.3390/biom10030487 32210029 PMC7175140 28. Tufail M Jiang C-H Li N Immune evasion in cancer: Mechanisms and cutting-edge therapeutic approaches Signal transduction Target Therapy 2025 10 227 10.1038/s41392-025-02280-1 PMC12311175 40739089 29. Ryu V Gumerova A Korkmaz F Kang SS Katsel P Miyashita S et al Brain atlas for glycoprotein hormone receptors at single-transcript level Elife 2022 11 e79612 10.7554/eLife.79612 36052994 PMC9473692 30. Klinger JH Gläsker S Bausch B Urbach H Krauss T Jilg CA et al Hemangioblastoma and von Hippel-Lindau disease: Genetic background, spectrum of disease, and neurosurgical treatment Child’s Nervous System 2020 36 10 2537 2552 10.1007/s00381-020-04712-5 PMC7575510 32507909 31. Glaesker S Shah MJ Hippchen B Neumann HPH,van Velthoven V Doppler-sonographically guided resection of central nervous system hemangioblastomas Operative Neurosurgery 2011 68 2 Suppl 267 275 10.1227/NEU.0b013e3182124677 21346656 32. Curry L Soleimani M Belzutifan: A novel therapeutic for the management of von Hippel-Lindau disease and beyond Future Oncology 2024 20 18 1251 1266 10.2217/fon-2023-0679 38639572 PMC11318713 33. Palavani LB Camerotte R Nogueira BV Ferreira MY Oliveira LB Mitre LP et al Innovative solutions? Belzutifan therapy for hemangioblastoma in Von Hippel-Lindau disease: A systematic review and single-arm meta-analysis Journal of Clinical Neuroscience 2024 128 110774 10.1016/j.jocn.2024.110774 39128437 34. Dogra R Vaishampayan U Hypoxia inducible factor-2α (HIF-2α) pathway inhibitors Journal of Kidney Cancer 2025 12 3 1 15 10.15586/jkcvhl.v12i3.413 PMC12228116 40620865 35. Siraj MA Pichon C Radu A Ghinea N Endothelial follicle stimulating hormone receptor in primary kidney cancer correlates with subsequent response to sunitinib Journal of Cellular and Molecular Medicine 2012 16 9 2010 2016 10.1111/j.1582-4934.2011.01495.x 22129368 PMC3822971 36. Ghinea N Vascular endothelial FSH-receptor, a target of interest for cancer therapy Endocrinology 2018 159 9 3268 3274 10.1210/en.2018-00466 30113652 ",
  "metadata": {
    "Title of this paper": "Vascular endothelial FSH-receptor, a target of interest for cancer therapy",
    "Journal it was published in:": "Journal of Kidney Cancer and VHL",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476826/"
  }
}