{
  "title": "Paper_1099",
  "abstract": "pmc J Clin Med J Clin Med 2745 jclinmed jcm Journal of Clinical Medicine 2077-0383 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470470 PMC12470470.1 12470470 12470470 41010641 10.3390/jcm14186437 jcm-14-06437 1 Systematic Review Electrocautery vs. Cold Cutting in Modified Radical Mastectomy: A Systematic Review and Meta-Analysis https://orcid.org/0009-0000-6722-9449 Cicio Dennis 1 Balta Alin Gheorghe 1 Homorozan Teodora Livia 1 Ciornei Vladimir 1 https://orcid.org/0000-0002-5482-6866 Russu Octav Marius 2 Benea Horea Rares 1 * Pavel Mihai 3 Scardina Lorenzo Academic Editor 1 cicio.dennis@elearn.umfcluj.ro balta.alin.gheorghe@elearn.umfcluj.ro homorozan.teodora.livia@elearn.umfcluj.ro ciornei_vladimir@elearn.umfcluj.ro 2 octav.russu@umfst.ro 3 pavel.mihai1@student.uoradea.ro * benea.horea@umfcluj.ro 12 9 2025 9 2025 14 18 497642 6437 04 8 2025 02 9 2025 10 9 2025 12 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background and Objectives: Materials and Methods: Results: p p p p p Conclusions: modified radical mastectomy blood loss electrocautery scalpel operative time breast cancer surgical technique infection This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Breast cancer is the most common cancer diagnosed in women globally. In 2022, there were an estimated 2.3 million new cases diagnosed and 670,000 deaths attributed to breast cancer [ 1 Breast surgeries were first described in the Edwin Smith Egyptian papyrus. A total of 48 cases of traumatic injuries and tumors were recorded in this historical document, in which the majority of the breast tumors were treated with simple cautery [ 2 Mastectomies are surgical procedures where all breast gland tissue is removed. Mastectomies are classified based on the quantity and type of tissue removed. For example, simple mastectomy consists of removing all the breast tissue, as well as adjacent skin and the nipple–areola complex. From here, multiple variations in the simple mastectomy evolved, beginning with radical mastectomy, which involves the simultaneous removal of the chest wall muscles and lymphadenectomy. Henceforth, more conservative variations evolved, such as modified radical mastectomy, skin-sparing mastectomy, and nipple-sparing mastectomy. Even though more conservative techniques are now more commonly used, modified radical mastectomies (MRMs) still remain an essential adjuvant therapy for certain benign and malignant breast neoplasms [ 3 Cold cutting refers to surgical instruments, usually a scalpel or scissors, or other tools used for cutting or incising tissue without using heat. A scalpel is an essential surgical tool used for incisions, dissections, and a variety of other procedures [ 4 Monopolar and bipolar electrocautery are types of electrosurgery that use electrical current to cut, ablate, dissect, or coagulate tissue. An electrosurgical unit consists of a generator and a handpiece with one or more electrodes [ 5 In bipolar electrocautery, both the active and return electrodes are located at the surgical site. The two tips of the forceps serve as both return and active electrode interchangeably, allowing only the tissue between the tips to be part of the circuit. Since one tip acts as the return electrode, a separate patient return electrode is not needed. This type of electrosurgery can operate in any environment, which is a significant advantage when coagulation is needed in a wet field. In monopolar electrocautery, the active electrode is used in the surgical site, and the return electrode is placed elsewhere on the patient’s body in order to safely remove current from the patient. The current flows from the active electrode to the return electrode, passing through the patient’s body and completing the circuit [ 6 Devices that use electricity were invented to more effectively reduce blood loss by maintaining hemostasis [ 7 One aspect that surgeons should remember when performing an MRM is thermal spread from the use of electrocautery, which increases the risk of flap necrosis, wound infection, and prolonged lymphatic drainage [ 8 During mastectomy, correct assessment of skin flap perfusion can prevent necrosis, which is a major contributor to infection, delayed healing, and postponed adjuvant therapy. Thus, the need arose for clinical and instrumental methods to determine skin flap perfusion after mastectomy. A 2017 review concluded that certain intraoperative techniques, namely handheld Doppler devices, laser Doppler, fluorescein angiography, and indocyanine green techniques, can be used successfully to detect skin areas that are at risk of necrosis [ 9 Of the last enumerated methods, laser-assisted indocyanine green dye angiography (ICG) is the most widely used and presents more advantages, particularly in high-risk patients [ 10 Seroma formation is the complication that occurs most frequently following mastectomy and axillary dissection. It entails the buildup of clear fluid in a tissue after an operation [ 11 12 A technique that started gaining traction is the tumescent technique or hidrodissection, which implies the dissection of breast tissue by injection of crystalloid fluids. It was demonstrated to have a lower overall complication rate and operative time [ 13 14 Various in-wound “additives” have been investigated. Microporous polysaccharide hemispheres (MPHs) have been proven to accelerate the clotting process, also leading to faster wound healing [ 15 16 The present meta-analysis aims to compare surgical techniques using a cold scalpel or scissors with electrocautery, focusing on their perioperative outcomes, in female oncological patients undergoing modified radical mastectomy. The current studies found in the literature have contradictory results; while some reports show improved intraoperative outcomes with electrocautery, these benefits are counterbalanced by increased postoperative complications noted in other studies. Thus emerges the need for a thorough study that evaluates perioperative outcomes of surgical techniques in modified radical mastectomy to decide which one performs better and leads to fewer complications [ 7 17 2. Materials and Methods 2.1. Search Strategy The PICO framework was applied to develop an effective search strategy and to guide research questions. P (Population): Female patients undergoing modified radical mastectomy. I (Intervention): Use of electrocautery (thermal cutting) for raising the flap in mastectomy. C (Comparison): Use of scalpel (cold cutting) for raising the flap in mastectomy. O (Outcome): Operative time, blood loss, postoperative drainage, seroma formation, surgical site infection, wound dehiscence, pain levels, duration of hospital stay, and risk of short-term and long-term complications. Following the establishment of the search strategy framework, we initiated the search process by searching on 5 databases (Epistemonikos, MEDLINE (PubMed), Embase, Web of Science, and Proquest). The search was conducted without time or language limitations. The last update to the search was made January 2025. The protocol for this systematic review and meta-analysis closely followed the guidelines of the Preferred Reporting Items for Systematic Reviews and Meta-Analysis statement (PRISMA) [ 18 Reference lists of cited studies were also examined (snowballing technique) to find other studies that met the inclusion criteria. Similar systematic reviews and meta-analyses were identified from abstract screening and thoroughly combed for relevant studies. Further, a crossref metadata search was used to find records with no DOI and other stray records not mentioned in the main databases. The terms used for the search combined “scalpel”, “knife”, “blade”, “scissor”, “electro”, “mastectomy”, and “breast” to find all the titles that met the inclusion criteria. The search strings for each individual database can be found in the PROSPERO protocol. 2.2. Selection Criteria All study designs of levels I to IV evidence were considered, randomized controlled trials (RCTs), controlled (non-randomized) clinical trials (CCTs), prospective and retrospective comparative cohort studies, case-control studies, and case series, with a focus on clinically adult patients undergoing modified radical mastectomy. Only published studies were selected, conducting a comparison of two techniques: cold cutting, which may include scalpel or scissor dissection, and electrocautery, represented by either monopolar or bipolar electrocautery. 2.2.1. Inclusion Criteria Studies prospectively met the following criteria: The population analyzed were adult patients (aged 18 or older); Undergoing modified radical mastectomy (pectoralis muscle sparing); Studies must compare electrocautery with cold cutting dissection in defined groups; Studies included must report at least one relevant outcome from the PICO framework; Use of human subjects. 2.2.2. Exclusion Criteria Studies of the following structure were excluded: Pre-print; Reviews; Case report; Animal studies; In vitro studies; Editorials. 2.3. Study Selection and Data Extraction Screening was performed at every level by three authors (D.C., T.H., and A.B.) in a blinded way to eliminate inter-observer bias and ensure complete and accurate article selection. The title and abstract of all identified studies were initially reviewed, followed by an in-depth analysis of each full text. For each level of screening, intra-class correlation (ICC) was calculated. ICC is represented in the Prisma flow chart ( Figure 1 ICC values less than 0.5 are indicative of poor reliability, values between 0.5 and 0.75 indicate moderate reliability, values between 0.75 and 0.9 indicate good reliability, and values greater than 0.90 indicate excellent reliability [ 34 Disagreements were settled by a fourth more experienced author (H.B.). Data Extraction Process Two authors (D.C. and A.B.) independently collected all relevant data present in the studies using a predefined spreadsheet in Microsoft Excel, 2019 version (Microsoft Corporation, Redmond, WA, USA). Where the data was not clearly reported, in order to not introduce bias through assumption, it was not extracted. Before the data analysis, the author (H.B.) verified the extracted data of each individual study, ensuring the validity of the results. 2.4. Quality Assessment (Risk of Bias and Level of Evidence) One author (D.C.), under the supervision of a second author (H.B.), conducted an unblinded risk of bias and quality assessment for each included study. Quality assessment was performed using the scoring protocol developed by the Oxford Centre for Evidence-Based Medicine to determine levels of evidence (LoE). The results are depicted in Table 1 Risk of Bias assessment was performed using both the RoB 2 tool [ 35 36 Figure 2 Figure 3 2.5. Statistical Analysis and Synthesis Methods The collected data was represented by the mean, median, standard deviation, and min–max range. Meta-analyses were conducted using IBM SPSS Statistics (Version 30) and Microsoft Excel. Continuous outcomes were calculated using unstandardized mean difference, with adjustments for unequal group variances, and represented as mean difference (MD) with 95% confidence interval (CI). For binary outcomes, Log odds ratio (logOR) with 95%CI was used to calculate and report effect sizes. All meta-analyses were performed using a random-effects model, with restricted maximum likelihood (REML) selected as the estimator. Two-tailed significance tests were applied for all pooled effect estimates. The graphical representation of statistically relevant results was made using forest plots generated in SPSS. Representation of statistically insignificant or considered secondary results was performed in tables as pooled, weighted means with corresponding pooled standard errors, as calculated in Excel. Where possible, statistical analysis was carried out. I2 estimate was computed to estimate heterogeneity between different study outcome groups. The following thresholds for heterogeneity were used [ 37 Subgroup analysis was performed where high heterogeneity was detected, or when study design suggested an impact on the outcomes reported. 2.6. Ethical Approval Ethical committee approval was not required for this study. 2.7. Meta-Analysis Registration This study was registered on the International Prospective Register of Systematic Reviews [ 38 3. Results 3.1. Search Strategy and Literature Selection The first combined search discovered 2158 articles, 846 of which were duplicates and were excluded. Title screening included 1312 articles, of which 1164 were eliminated due to not meeting the study’s inclusion criteria. The remaining 148 articles were included for abstract screening, of which 91 articles were excluded, and 11 articles were determined to be other systematic reviews on the topic and transferred to the cross-ref process. In total, 45 articles entered final full-text exclusion screening. All articles were meticulously analyzed by reading the full text and were excluded for the following reasons: 11 were excluded for lack of full text, 3 for editorial structure, 4 for no comparison between cold cutting and electrocautery, 5 for not analyzing modified radical mastectomy (focusing on other procedures), and 13 for other comparisons. No additional articles were identified through the reference lists. Two articles were identified through the cross-ref procedure, and one was excluded after reading the full-text as the procedure examined was not modified radical mastectomy. Five stray articles were included from the cross-ref metadata search. After the exclusion process, 15 articles were included in this systematic review ( Figure 1 A significant part of the included articles consisted of RCTs (level IB evidence), while two prospective cohort studies and one was a retrospective cohort study. 3.2. Study Characteristics A total of 1372 patients have been included, of which 730 underwent electrocautery and 642 cold cutting procedures ( Table 1 It is important to highlight that eight studies used electrocautery as a method of coagulation in the scalpel group. Nine studies opted to extract the drainage tube when the fluid decreased below 30 mL per 24 h; two studies did not document when the drain removal decision was made, while four studies removed the drain after the output dropped below 50 mL per 24 h. 3.3. Outcomes This systematic review synthesized findings from fifteen studies [ 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 Table 2 The secondary outcomes included in this meta-analysis were named as such because of the lack of studies reporting them, thus making their results less accurate. They included hospital stay, specimen weight, specimen volume, seroma volume, and flap area. Some of the outcomes did not report standard deviation, making statistical analysis impossible. The results are given in Table 3 No statistically significant differences were observed between the techniques for the following complications: hematoma, flap necrosis, and ecchymosis. The results are given in Table 4 The most reported outcomes were as follows: seroma risk, infection risk, blood loss, operative time, total volume drained, and duration of drain. 3.3.1. Seroma Risk Fourteen studies analyzed the risk of seroma formation, revealing a significant difference between the two groups, with LogOR = −0.90 (95% CI: −1.26 to −0.54). A p Figure 4 p 3.3.2. Infection Risk Seven studies evaluated the risk of infection, demonstrating no significant difference between the two groups, with LogOR = −0.46 (95% CI: −1.01 to 0.08), p Figure 5 p p 3.3.3. Total Volume Drained Total volume drained is defined as the amount of fluid removed from the surgical wound after the mastectomy procedure. Six studies analyzed the volume drained after surgery. Of these, Refs. [ 20 24 p Figure 6 p 3.3.4. Operation Time Seven studies evaluated operation time, with an MD = −13.14 (95% CI: −19.58 to −6.70), p p Figure 7 p 3.3.5. Blood Loss Blood loss estimation varied in several studies through gauze weight or suction volume. Five studies analyzed blood loss, showing that there is a significant difference between the two groups, with an MD = −171.60 (95% CI: −259.35 to −84.41), p Figure 8 p 3.3.6. Duration of Drainage The duration of drainage is calculated as the interval between installation and when the fluid volume collected is below the drain removal decision. Four studies analyzed the duration of drainage, showing a similarity between the two groups, with an MD = 0.4 (95% CI: −0.41 to 1.23), p 24 Figure 9 p 4. Discussion 4.1. Interpretation of Main Findings in Context When deciding on the usage of “traditional” instruments, surgeons can expect the following results: a lower seroma risk, no difference in total volume drained, or drainage duration. However, this comes at the cost of longer operative time and higher intraoperative blood loss. The analysis of the risk of infection, although not statistically significant, exposed a trend towards lower infection rates when opting for the “cold” technique, potentially due to less thermal injury [ 40 Our results align with the previous findings in the literature. For instance, on the subject of seroma risk, the meta-analysis by Oyewale et al. [ 41 Turner et al. [ 42 4.2. Heterogeneity and Measurement Challenges Difficulties in interpreting the results lie in the heterogeneity of the included studies, particularly within demographic outcome groups. Some can be attributed to different methods of measurement; for blood loss, direct measurement is practically impossible, leading to the use of varied indirect methods, such as swab weight or suction volume, introducing variability. Odionyeme et al.’s [ 23 Similarly, Keogh [ 20 4.3. Limitations Despite meaningful findings, several limitations must be acknowledged. Only one study [ 33 Secondly, the lack of significant findings across the hematoma, flap necrosis, and ecchymosis must be interpreted with caution. The small sample sizes and the limited number of studies reporting these complications likely contributed to the wide confidence intervals and reduced statistical power. High heterogeneity was encountered in the drainage output and drainage duration outcomes. After subgroup analysis based on drainage removal criteria, it remained similar and did not affect the conclusion. Such results are also found in the literature [ 43 Two studies [ 23 24 4.4. Future Research Directions Future studies should prioritize standardized definitions and outcome measures, particularly in operative time and blood loss estimation. Additionally, routine inclusion of PROMs, including validated scales such as the VAS (Visual Analogue Scale) for pain, would enhance the relevance of findings for both clinicians and patients. While clinical endpoints are important, future studies should incorporate patient-reported pain, satisfaction, and cosmetic outcomes to inform shared surgical decision-making. Moreover, the preliminary evidence on cytokine modulation through surgical technique represents an intriguing avenue that warrants deeper biochemical exploration with larger cohorts and standardized assays. 5. Conclusions Traditional (“cold”) surgical techniques in mastectomy are associated with reduced seroma formation and potentially lower infection rates. However, these benefits come at the cost of longer operative times and higher intraoperative blood loss compared to electrocautery. Thus, electrocautery should be employed in patients who benefit from the shorter operative time and lower blood loss, while patients in better clinical condition should benefit from cold cutting techniques. Further research that focuses on patient-reported outcomes and deeper investigation into inflammatory biomarkers (e.g., cytokines) may help shift the balance in surgical decision-making. Acknowledgments The authors acknowledge financial support for this systematic review from the “Iuliu Hațieganu” University of Medicine and Pharmacy, Cluj-Napoca. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, D.C.; methodology, D.C.; validation, H.R.B. and O.M.R.; formal analysis, D.C., A.G.B. and T.L.H.; data curation, D.C. and H.R.B.; writing—original draft preparation, D.C., A.G.B., T.L.H., V.C. and M.P.; writing—review and editing, D.C., H.R.B. and M.P.; visualization, D.C.; supervision, H.R.B. and O.M.R. All authors have read and agreed to the published version of the manuscript. Data Availability Statement The raw data supporting the conclusions of this article will be made available by the authors on request. Conflicts of Interest The authors declare no conflicts of interest. References 1. Breast Cancer Available online: https://www.who.int/news-room/fact-sheets/detail/breast-cancer (accessed on 24 July 2025) 2. Freeman M.D. Gopman J.M. Salzberg C.A. The evolution of mastectomy surgical technique: From mutilation to medicine Gland Surg. 2018 7 308 315 10.21037/gs.2017.09.07 29998080 PMC6006018 3. Goethals A. Menon G. Rose J. Mastectomy StatPearls StatPearls Publishing Treasure Island, FL, USA 2025 Available online: http://www.ncbi.nlm.nih.gov/books/NBK538212/ (accessed on 24 July 2025) 4. Chandra S. Podder I. Chatterjee M. Field L. Anatomy and Applications of the #15 Scalpel Blade and Its Variations J. Cutan. Aesthetic Surg. 2018 11 79 82 10.4103/jcas.jcas_70_16 PMC6128153 30210210 5. Definition of Electrosurgery—NCI Dictionary of Cancer Terms—NCI 2011 Available online: https://www.cancer.gov/publications/dictionaries/cancer-terms/def/electrosurgery (accessed on 3 August 2025) 6. Cordero I. Electrosurgical units—How they work and how to use them safely Community Eye Health 2015 28 15 16 26435589 PMC4579996 7. Ismail A. Abushouk A.I. Elmaraezy A. Menshawy A. Menshawy E. Ismail M. Samir E. Khaled A. Zakarya H. El-Tonoby A. Cutting electrocautery versus J. Surg. Res. 2017 220 147 163 10.1016/j.jss.2017.06.093 29180177 8. Sutton P.A. Awad S. Perkins A.C. Lobo D.N. Comparison of lateral thermal spread using monopolar and bipolar diathermy, the Harmonic Scalpel and the Ligasure Br. J. Surg. 2010 97 428 433 10.1002/bjs.6901 20101674 9. Robertson S.A. Jeevaratnam J.A. Agrawal A. Cutress R.I. Mastectomy skin flap necrosis: Challenges and solutions Breast Cancer Targets Ther. 2017 9 141 152 10.2147/BCTT.S81712 PMC5357072 28331365 10. Ganz J. Intraoperative Perfusion Techniques Can Accurately Predict Mastectomy Skin Flap Necrosis in Breast Reconstruction Plast. Reconstr. Surg. 2022 129 778e 788e 10.1097/PRS.0B013E31824A2AE8 22544108 11. Definition of Seroma—NCI Dictionary of Cancer Terms—NCI 2011 Available online: https://www.cancer.gov/publications/dictionaries/cancer-terms/def/seroma (accessed on 30 August 2025) 12. Toyserkani N.M. Jørgensen M.G. Haugaard K. Sørensen J.A. Seroma indicates increased risk of lymphedema following breast cancer treatment: A retrospective cohort study Breast Edinb. Scotl. 2017 32 102 104 10.1016/j.breast.2017.01.009 28129628 13. Bakillah E. Brooks A.D. Adekeye S. Switching to Tumescent Dissection in Mastectomy Breast J. 2025 2025 7634729 10.1155/tbj/7634729 39950031 PMC11824300 14. van Zeelst L.J. ten Wolde B. Plate J.D.J. Volders J.H. van Eekeren R.R.J.P. Doeksen A. Hoven-Gondrie M.L. Olieman A.F.T. van Riet Y.E.A. van der Velden A.P.S. The QUILT study: Quilting sutures in patients undergoing breast cancer surgery: A stepped wedge cluster randomized trial study BMC Cancer 2023 23 667 10.1186/s12885-023-11154-0 37460983 PMC10351105 15. Egeli T. Sevinç A.İ. Bora S. Yakut M.C. Cevizci T. Canda T. Şişman A.R. Microporous Polysaccharide Hemospheres and Seroma Formation After Mastectomy and Axillary Dissection in Rats Balk. Med. J. 2012 29 179 183 10.5152/balkanmedj.2012.005 PMC4115844 25206991 16. Sharma S. Arora J.K. Kumar R. Fibrin Glue Sealant: An Effective Modality to Mitigate Postoperative Seroma After Modified Radical Mastectomy Cureus 2022 14 e32789 10.7759/cureus.32789 36694535 PMC9857049 17. Lee B.J. Marks M. Smith D.P. Hodges-Savola C.A. Mischke J.M. Lewis R.D. Advanced Cutting Effect System versus Cold Steel Scalpel: Comparative Wound Healing and Scar Formation in Targeted Surgical Applications Plast. Reconstr. Surg. Glob. Open 2014 2 e234 10.1097/GOX.0000000000000208 25426351 PMC4236379 18. Page M.J. McKenzie J.E. Bossuyt P.M. Boutron I. Hoffmann T.C. Mulrow C.D. Shamseer L. Tetzlaff J.M. Akl E.A. Brennan S.E. The PRISMA 2020 statement: An updated guideline for reporting systematic reviews BMJ 2021 372 n71 10.1136/bmj.n71 33782057 PMC8005924 19. Kurtz S.B. Frost D.B. A comparison of two surgical techniques for performing mastectomy Eur. J. Surg. Oncol. J. 1995 21 143 145 10.1016/S0748-7983(95)90171-X 7720886 20. Keogh G.W. Doughty J.C. McArdle C.S.M. Cooke T.G. Seroma formation related to electrocautery in breast surgery: A prospective randomized trial Breast 1998 7 39 41 10.1016/S0960-9776(98)90050-9 21. Porter K.A. O’Connor S. Rimm E. Lopez M. Electrocautery as a factor in seroma formation following mastectomy Am. J. Surg. 1998 176 8 11 10.1016/S0002-9610(98)00093-2 9683123 22. Rodd C.D. Velchuru V.R. Holly-Archer F. Clark A. Pereira J.H. Randomized clinical trial comparing two mastectomy techniques World J. Surg. 2007 31 1164 1168 10.1007/s00268-007-9000-z 17417709 23. Özdoğan M. Yilmaz K.B. Özaslan C. Gürer A. Gülbahar Ö. Ersoy E. Scalpel Versus Electrocautery Dissections: The Effect on Wound Complications and Pro-Inflammatory Cytokine Levels in Wound Fluid Turk. J. Med. Sci. 2008 38 111 116 24. Yilmaz K.B. Dogan L. Nalbant H. Akinci M. Karaman N. Ozaslan C. Kulacoglu H. Comparing scalpel, electrocautery and ultrasonic dissector effects: The impact on wound complications and pro-inflammatory cytokine levels in wound fluid from mastectomy patients J. Breast Cancer 2011 14 58 63 10.4048/jbc.2011.14.1.58 21847396 PMC3148508 25. Anlar B. Karaman N. Dogan L. Ozaslan C. Atalay C. Altinok M. The effect of harmonic scalpel, electrocautery, and scalpel use on early wound complications after modified radical mastectomy Eur. Surg. 2013 45 286 290 10.1007/s10353-013-0231-y 26. Ali A.M.A. Seroma Formation After Mastectomy For Breast Cancer Egypt. J. Surg. 2014 33 60 65 10.21608/ejsur.2014.366646 27. Chavan R.N. Chikkala B. Mondal P. Sarkar D.K. Comparison Study Between Scalpel and Electrocautery, in Causation of Seroma After Modified Radical Mastectomy Indian J. Surg. 2017 79 423 426 10.1007/s12262-016-1501-2 29089702 PMC5653576 28. Sharma R. Singh N.R. Singh R. Comparative Study of Complications Following Electrocautery Dissection vs. Conventional Scalpel/Scissor Dissection in Modified Radical Mastectomy AMEIs Curr. Trends Diagn. Treat. 2018 2 98 101 10.5005/jp-journals-10055-0047 29. Zim H.Z. Hossain S.A. Alam A.B.M.K. Uddin S.S. Comparison between Scissors and Electrocautery in Seroma Formation Following Modified Radical Mastectomy (MRM) J. Surg. Sci. 2019 23 87 89 10.3329/jss.v23i2.46117 30. Aheer R. Bhangu G.S. Comparative study of complications using electrocautery versus conventional scissors for raising flap in modified radical mastectomy Int. Surg. J. 2023 10 244 248 10.18203/2349-2902.isj20230261 31. Bashir Z. Taimur M. Imran M. Shah I. Noor M. Ahmad B. Frequency of seroma formation after modified radical mastectomy. A comparison between electrocautery and scalpel dissection techniques Prof. Med. J. 2023 30 966 970 10.29309/TPMJ/2023.30.08.7524 32. Odionyeme U. Udo I. Irowa O. Ku U. Non-infective post-mastectomy complications: A comparison of outcomes of sharp and electrocautery dissection for modified radical mastectomy S. Asian J. Health Sci. 2024 1 69 76 10.25259/SAJHS_10_2023 33. Babar Y. Ullah R. Shah M. Khan A. Frequency of seroma formation after modified radical mastectomy. A comparison between electrocautery and scalpel dissection techniques J. Popul. Ther. Clin. Pharmacol. 2024 31 1321 1327 10.53555/jptcp.v31i1.4177 34. Koo T.K. Li M.Y. A Guideline of Selecting and Reporting Intraclass Correlation Coefficients for Reliability Research J. Chiropr. Med. 2016 15 155 163 10.1016/j.jcm.2016.02.012 27330520 PMC4913118 35. Sterne J.A.C. Savović J. Page M.J. Elbers R.G. Blencowe N.S. Boutron I. Cates C.J. Cheng H.-Y. Corbett M.S. Eldridge S.M. RoB 2: A revised tool for assessing risk of bias in randomised trials BMJ 2019 366 l4898 10.1136/bmj.l4898 31462531 36. Sterne J.A. Hernán M.A. Reeves B.C. Savović J. Berkman N.D. Viswanathan M. Henry D. Altman D.G. Ansari M.T. Boutron I. ROBINS-I: A tool for assessing risk of bias in non-randomised studies of interventions BMJ 2016 355 i4919 10.1136/bmj.i4919 27733354 PMC5062054 37. 9.5.2 Identifying and Measuring Heterogeneity Available online: https://handbook-5-1.cochrane.org/chapter_9/9_5_2_identifying_and_measuring_heterogeneity.htm (accessed on 24 July 2025) 38. Page M.J. Shamseer L. Tricco A.C. Registration of systematic reviews in PROSPERO: 30,000 records and counting Syst. Rev. 2018 7 32 10.1186/s13643-018-0699-4 29463298 PMC5819709 39. Kakos G.S. James A.G. The use of cautery in “bloodless” radical mastectomy Cancer 1970 26 666 668 10.1002/1097-0142(197009)26:3&#x0003c;666::AID-CNCR2820260327&#x0003e;3.0.CO;2-F 5458273 40. Soballe P.W. Nimbkar N.V. Hayward I. Nielsen T.B. Drucker W.R. Electric cautery lowers the contamination threshold for infection of laparotomies Am. J. Surg. 1998 175 263 266 10.1016/S0002-9610(98)00020-8 9568648 41. Oyewale S. Ariwoola A. Oyewale I. The effectiveness of different flap-raising techniques for mastectomy in reducing the rate of complications: A network meta-analysis BMC Surg. 2024 24 415 10.1186/s12893-024-02723-6 39716134 PMC11665085 42. Turner E. Benson J. Winters Z. Techniques in the Prevention and Management of Seromas After Breast Surgery Future Oncol. Lond. Engl. 2014 10 1049 1063 10.2217/fon.13.257 24941989 43. Clegg-Lamptey J.N.A. Dakubo J.C.B. Hodasi W.M. Comparison of four-day and ten-day post-mastectomy passive drainage in Accra, Ghana East Afr. Med. J. 2007 84 561 565 10.4314/eamj.v84i12.9592 18402307 Figure 1 Flowchart of the literature search [ 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 Figure 2 Risk of Bias criteria for randomized surgical studies [ 20 21 22 24 25 26 27 28 30 31 32 33 Figure 3 Risk of bias criteria for non-randomized surgical studies [ 19 23 29 Figure 4 Seroma risk forest plot [ 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 Figure 5 Infection risk forest plot [ 19 20 22 24 25 30 33 Figure 6 Total volume drained forest plot [ 20 23 24 28 30 32 Figure 7 Operation time forest plot [ 20 22 23 24 28 30 32 Figure 8 Blood loss forest plot [ 21 22 23 24 33 Figure 9 Duration of drainage forest plot [ 23 24 28 32 jcm-14-06437-t001_Table 1 Table 1 Study characteristics [ 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 Authors Year Design LoE Use of Additional Method of Coagulation in Scalpel Group Number of Patients AGE (yr) BMI Level of Lymph Node Harvest Drain Removal Decision Total CC EC C EC C EC Babar et al. [ 33 2024 RCT 1b N/R 240 120 120 53.1 ± 8.2 52.3 ± 7.5 27.1 ± 3.9 26.4 ± 4.2 N/R N/R Odionyeme et al. [ 32 2024 RCT 1b No electrocoagulation 46 23 23 45 ± 12.8 (25–73) 49.1 ± 11.4 (27–66) 25.6 ± 3.5 24.8 ± 2.6 I/II <30 mL/24 h Bashir et al. [ 31 2023 RCT 1b N/R 100 50 50 42.39 ± 8.3 (22–60) N/R N/R N/R N/R Aheer et al. [ 30 2023 RCT 1b N/R 60 30 30 N/R N/R N/R N/R N/R <30 mL/24 h Zim et al. [ 29 2019 prospective cohort 2b Electrocoagulation 90 35 55 52 53 (18.5–30) (18.5–30) I/II/III <30 mL/24 h Sharma et al. [ 28 2018 RCT 1b N/R 70 35 35 N/R N/R N/R N/R N/R <30 mL/24 h Chavan et al. [ 27 2017 RCT 1b Electrocautery 176 67 109 53 (40–65) 52(40–65) (18.5–30) (18.5–30) I/II/III <30 mL/24 h Ali et al. [ 26 2014 RCT 1b N/R 40 20 20 N/R N/R N/R N/R N/R <30 mL/24 h Anlar et al. [ 25 2013 RCT 1b Harmonic scalpel 81 40 41 51 (29–68) 52 (24–82) N/R N/R I/II <50 mL/24 h Yilmaz et al. [ 24 2011 RCT 1b Electrocoagulation 53 27 26 50.2 ± 9.3 48.5 ± 9.8 27.9 ± 0.88 28.1 ± 0.75 II/III <50 mL/24 h Özdogan et al. [ 23 2008 prospective cohort 2b Electrocoagulation 38 20 18 50.1 ± 2.32 50.2 ± 3.43 27.4 ± 0.98 26.11 ± 0.86 III <30 mL/24 h Rodd et al. [ 22 2007 RCT 1b Electrocoagulation 60 30 30 67.03 ± 8.69 69.6 ± 9.8 N/R N/R I <30 mL/24 h Porter et al. [ 21 1998 RCT 1b Electrocoagulation 80 38 42 63 ± 13 66 ± 14 26 ± 5 28 ± 9 N/R <30 mL/24 h Keogh et al. [ 20 1998 RCT 1b Electrocoagulation 42 21 21 60 (45–78) 60 (41–85) N/R N/R III <50 mL/24 h Kurtz et al. [ 19 1995 retrospective cohort 2b N/R 196 86 110 56.5 (30–80) 55.9 (29–89) N/R N/R III <50 mL/24 h Data presented as mean ± standard deviation (min–max); Abbreviations: LoE, Level of Evidence; NR, not reported; RCT, randomized controlled trial; CC, cold cutting; EC, electrocoagulation. jcm-14-06437-t002_Table 2 Table 2 Demographical outcomes of included studies. Demographics Electrocoagulation Cold Cutting Mean Difference ( p Age [ 19 20 21 22 25 27 29 30 31 38 39 55.7 ± 9.52 54.9 ± 9.42 0.07 0.48 BMI [ 19 21 22 30 31 26.7 ± 4.99 26.9 ± 3.69 −0.47 0.55 Stage of disease 0/I/II/III [ 19 20 22 25 27 30 39 18%/35%/27%/28% 13%/31%/33%/30% N/A N/A Number of collected lymph nodes [ 19 21 38 13.6 ± 7.01 14.4 ± 6.28 −0.62 0.23 Number of positive lymph nodes [ 19 21 2.5 ± 2.85 1.1 ± 2.45 2.27 0.31 follow-up period [ 25 26 27 28 30 31 53.8 48.1 N/A N/A % of hypertensive patients [ 22 30 31 30% 26% N/A N/A % of smokers [ 22 31 18% 16% N/A N/A % of diabetes [ 22 31 20% 20% N/A N/A Data presented as pooled weighted mean ± pooled standard deviation. Abbreviations: N/A not applicable jcm-14-06437-t003_Table 3 Table 3 Secondary outcomes of included studies. Outcome Electrocautery Cold Cutting Mean Difference ( p specimen weight (g) [ 20 23 38 604.5 ± 372.63 657.6 ± 425.193 −47.26 0.49 specimen volume (mL) [ 21 22 23 2324.1 ± 401.58 2083.7 ± 531.84 316.74 0.15 seroma volume (mL) [ 21 31 68.9 ± 18.89 51.5 ± 22.25 24.47 0.054 flap area (mm 2 22 23 493.7 460.8 N/A N/A hospital stay (days) [ 31 38 4.3 4.2 N/A N/A Data presented as pooled weighted mean ± pooled standard deviation (min–max). Abbreviations: N/A not applicable jcm-14-06437-t004_Table 4 Table 4 Secondary complications of included studies. Complication OR (Odds Ratio) 95% CI ( p Hematoma [ 20 22 23 30 39 1.17 0.38–3.5 0.77 Flap necrosis [ 22 23 26 28 1.56 0.67–3.62 0.29 Ecchymosis [ 22 23 0.7 0.34–1.47 0.35 ",
  "metadata": {
    "Title of this paper": "Comparison of four-day and ten-day post-mastectomy passive drainage in Accra, Ghana",
    "Journal it was published in:": "Journal of Clinical Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470470/"
  }
}