{
  "title": "Paper_389",
  "abstract": "pmc J Food Sci Technol J Food Sci Technol 1466 foodsci Journal of Food Science and Technology 0022-1155 0975-8402 Springer PMC12484499 PMC12484499.1 12484499 12484499 41041503 10.1007/s13197-025-06432-7 6432 1 Review Article Extraction of bioactive compounds from Garcinia mangostana Ortega Yurledys Torres 1 Quintana Somaris E. 1 http://orcid.org/0000-0003-4084-4948 García-Zapateiro Luis Alberto lgarciaz@unicartagena.edu.co 1 2 1 https://ror.org/0409zd934 grid.412885.2 0000 0004 0486 624X Research Group of Complex Fluid Engineering and Food Rheology, University of Cartagena, 2 https://ror.org/0409zd934 grid.412885.2 0000 0004 0486 624X Unit Operations Department. Faculty of Engineering, Complex Fluid Engineering and Food Rheology Research Group (IFCRA), University of Cartagena, 9 9 2025 11 2025 62 11 498042 2031 2042 16 9 2024 29 5 2025 26 7 2025 09 09 2025 02 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Garcinia mangostana . Keywords Biological activity Bioactive compounds Garcinia mangostana Extraction technology Xanthones http://dx.doi.org/10.13039/100007637 Departamento Administrativo de Ciencia, Tecnología e Innovación (COLCIENCIAS) 368-2019 García-Zapateiro Luis Alberto University of Cartagena Open Access funding provided by Colombia Consortium pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Association of Food Scientists & Technologists (India) 2025 Introduction Garcinia mangostana 2016 Clusiaceae Garcinia 2019a The mangosteen tree is a robust evergreen species, reaching heights ranging from 6 to 25 m. It is distinguished by its thick, leathery leaves that provide a lush canopy, contributing to the tree's vibrant appearance (Aizat et al. 2019b 2017 1 2022 2018 Fig. 1 a b https://sembramos.com.co/arbol-de-mangostino.html Garcinia mangostana 2020 2019b Notably, the majority of these beneficial compounds are found in the fruit's pericarp, the thick outer rind, which has been reported to exhibit antioxidant activity 20 times higher than that of the fruit’s edible flesh. In addition, the pericarp contains 10 times more phenolic compounds compared to the pulp, further enhancing its health benefits (Oh et al. 2020 Several studies have demonstrated that mangosteen possesses a variety of therapeutic properties, including antioxidant, anti-obesity, antihyperglycemic, antidiabetic, antimicrobial, hepatoprotective, cardioprotective, anti-inflammatory, anti-Alzheimer, and pro-apoptotic effects (Mello et al. 2021 In recent years, there has been a significant rise in interest regarding the extraction techniques used to isolate bioactive compounds from Garcinia mangostana 2017 2016 2017 This review aims to provide an up-to-date overview of the various extraction technologies for isolating bioactive compounds from mangosteen. In doing so, it underscores the critical importance of these compounds in biological activity and highlights the progress being made in refining extraction methods to support future applications in nutraceuticals, pharmaceuticals, and functional foods. Bioactive compounds and biological activities Garcinia mangostana . 2019b 2020 Xanthones, particularly α-mangostin, have been extensively studied due to their diverse pharmacological properties. These compounds exhibit potent antioxidant, anti-inflammatory, antimicrobial, and anticancer effects, making mangosteen a valuable natural product for medicinal and nutraceutical applications (Mahmudah et al. 2020 2021 Garcinia mangostana 2008 2014 2014 2016 2006 The chemical complexity of mangosteen and the high concentration of xanthones in the pericarp underscore the importance of optimizing extraction techniques to isolate these bioactive compounds. Emerging methods such as ultrasound-assisted extraction (UAE) and the use of natural deep eutectic solvents (NaDES) have been identified as sustainable and efficient alternatives to traditional solvent-based extraction processes. These advanced methods not only increase extraction efficiency but also reduce environmental impact, further enhancing the viability of mangosteen for industrial applications (Plaza et al. 2021 Table 1 2016 2012 Table 1 Main bioactive compounds of mangosteen [Garcinia mangostana L] [14; 15] Phenolic acids Flavonoids Tannins Xanthones Chlorogenic acid, vinyl acid protocatechin acid p-coumaric acid Ferulic acid, gallic acid, caffeic acid, hydroxybenzoic Epicatechin Porcatechin, cyanidin 3-sophoroside, cyanidin 3-glucoside, myricetin, rutin Quercetin Procyanidin α-mangostin ß-mangostin γ-mangostin Rubraxanthone 9-Hydroxycalabaxanthone Tetrahydroxyxanthone Garcixanthone A Garcixanthone B Garcixanthone C Euxanthone Garmoxanthone Mangostanazanthone III/VIII Mangostanaxanthone IV/VII Tovophylin A gartanin 8-Deoxygartanin Garcinone C Garcinone E Garcinone E Following α-mangostin, γ-mangostin is the second most abundant compound in the mangosteen pericarp, accounting for 17.6% of the xanthone content. γ-mangostin has also demonstrated significant biological activities, including anti-inflammatory and anti-tumor effects. Other bioactive compounds, making up the remaining 13.3%, include gartanin, 8-deoxygartanin, garcinone E, and 1,3,7-trihydroxy-2,8-di-(3-methylbut-2-enyl) xanthone (Wittenauer et al. 2012 2021 2021 Pericarp Garcinia mangostana 2019 2020 2019 2017 The bioactive content of mangosteen pericarp found higher levels of total phenols and flavonoids; Pusat et al. ( 2023 Garcinia mangostana 2012 Mangosteen pericarp is particularly noted for its high content of prenylated xanthones, which have shown a wide range of biological activities. These xanthones are potent antioxidants and possess anticancer, anti-inflammatory, and antiproliferative properties (Musso et al. 2018 2020 2017 2019 Other notable bioactive xanthones from mangosteen include garcinone E and gartanin. Garcinone E has shown promise in inhibiting ovarian cancer cells (Zhang et al. 2018 2008 2018 These findings underscore the therapeutic potential of mangosteen extracts in treating various health conditions and highlight the fruit's role as a valuable source of bioactive compounds. Seeds Garcinia mangostana 2016 2017 2019 Aril (pulp) The edible part of Garcinia mangostana 2021 Conversely, Zadernowski et al. ( 2009 In addition to phenolic acids, Vien et al. ( 2021 2006 Extraction technologies: current advances and techniques For many years, there has been significant interest in obtaining bioactive compounds from various plant sources, along with the development and application of extraction methods. Traditional extraction techniques such as maceration, Soxhlet extraction, and hydrodistillation have been widely used (Ortíz Aguilar et al. 2016 2016 To address these limitations, more advanced extraction technologies have been proposed and investigated. Techniques such as microwave-assisted extraction (MAE) (Rodsamran and Sothornvit 2019 2015 2018 2 3 Table 2 Advantages and disadvantages of extraction methods Extraction method Advantages Disadvantages Reference Solvent extraction Low cost, easy to implement, widely used Use of toxic solvents, low selectivity, chemical residues Azmir et al. ( 2013 Hot water extraction Safe, cost-effective, no organic solvents required Low efficiency for non-polar compounds, high temperature may degrade compounds Plaza and Turner ( 2015 Supercritical CO 2 High selectivity, no toxic residues, suitable for thermolabile compounds High cost, requires specialized equipment Yuvanatemiya et al. ( 2022 Ultrasound-assisted extraction Fast, efficient, enhances compound release May degrade sensitive compounds, requires constant energy input Chemat et al. ( 2017a Microwave-assisted extraction Fast, efficient, reduced solvent use High initial cost, risk of overheating Chemat et al. ( 2017a Pressurized liquid extraction [PLE] High efficiency, fast, reduced solvent use High cost, requires specialized equipment Mustafa and Turner ( 2011 Enzymatic extraction Selective, mild conditions, environmentally friendly Enzyme cost, longer processing time Puri et al. ( 2012 Table 3 Literature results on extraction of bioactive compounds from mangosteen Extraction method Compounds extracted Optimal conditions Yield References Solvent extraction Xanthones [α-mangostin, γ-mangostin] 70% ethanol, 60 °C, 2 h 85–90% xanthone recovery Zadernowski et al. ( 2009 Supercritical CO 2 Xanthones, polyphenols 40 °C, 300 bar, 2 h 95% xanthone recovery Yuvanatemiya et al. ( 2022 Ultrasound-assisted extraction Xanthones, flavonoids 50% ethanol, 40 °C, 30 min 92% xanthone recovery Chemat et al. ( 2017b Microwave-assisted extraction Xanthones, tannins Water, 100 °C, 10 min 88% xanthone recovery Chemat et al. ( 2017a Pressurized liquid extraction [PLE] Xanthones, polyphenols 50% ethanol, 100 °C, 20 min 94% xanthone recovery Mustafa and Turner ( 2011 ENZYMATIC Extraction Xanthones, polysaccharides Cellulase, 50 °C, pH 5, 4 h 80% xanthone recovery Puri et al. ( 2012 Conventional extraction technique Conventional extraction, commonly referred to as solid–liquid extraction [SLE], remains one of the most widely employed techniques for isolating bioactive compounds from various plant sources (Barba et al. 2016a 2022 2016a Maceration Maceration is a widely used extraction technique that operates at room temperature (Jha and Sit 2022 2018 Using the maceration technique, Pothitirat et al. (Pothitirat et al. 2010a 2011 Soxhlet extraction Soxhlet extraction is a standard technique often used as a benchmark for evaluating the efficiency of other solid–liquid extraction methods (Barba et al. 2016b 2022 According to Santong-aun et al. (Assawarachan et al. 2011 Further research by Yoswathana and Eshtiaghi ( 2015 2010b Hydrodistillation Hydrodistillation is one of the oldest and still widely used extraction techniques for isolating bioactive compounds and essential oils from plant materials and fruit waste (Jha and Sit 2022 In water distillation, plant materials are packed into a still, and water is added and brought to a boil. Alternatively, in direct steam distillation, hot steam is injected directly into the plant material. Both hot water and steam play crucial roles in facilitating the release of bioactive compounds from plant tissues (Azmir et al. 2013 2022 Garcinia mangostana Cinnamomum verum 2020 Eucalyptus globulus 2021 Mentha piperita 2006 Microwave assisted extraction (MAE) MAE is an advanced extraction technique that utilizes volumetric heating to efficiently extract desired compounds from natural sources (Ali et al. 2019 2015 2021 Garcinia mangostana 2019 Hibiscus sabdariffa 2018 Cinnamomum zeylanicum 2019 2019c 2017 Similarly, Hasan et al. ( 2016 Garcinia mangostana 2019 2022 Ultrasound (UAE) UAE is an emerging green technology with significant potential across various technological processes (Moreira et al. 2019 2017 2019 2012 2019 2020 Garcinia mangostana Garcinia mangostana Furthermore, Suryono et al. (Suryono et al. 2019 Supercritical fluid-assisted extraction [SFE] SFE is an advanced green technology that has continuously evolved to enhance the separation of bioactive compounds from natural materials. This technique utilizes supercritical fluids, which possess both liquid and gaseous properties when subjected to temperatures and pressures above their critical points. Due to their relatively low viscosities and high diffusivities, supercritical fluids can significantly improve diffusion and mass transfer, thereby reducing extraction times (Uwineza and Waśkiewicz 2020 Among the various supercritical fluids, supercritical carbon dioxide (CO 2 2013 2 2 ’ 2 2 2019 SFE technology offers a promising alternative for the extraction of α- and γ-mangostin from mangosteen peel. For example, in a study by Lee et al. ( 2019 2 2016 2 Enzymatic extraction of Garcinia mangostana Enzymatic extraction is an efficient and eco-friendly method employed to recover bioactive compounds from Garcinia mangostana 2024 2023 2006 2023 2023 2024 Conclusions Garcinia mangostana Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements This work is part of a research program “ Programa nacional de ciencia, tecnología e innovación en ciencias agropecuarias Author contributions Conceptualization , Funding Open Access funding provided by Colombia Consortium. Project 368-2019 code 110780864755. Data availability Not applicable. Code availability Not applicable. Declarations Conflicts of interest The authors declare no conflict of interest. Ethics approval Not applicable. Consent to participate Not applicable. Consent to publication Not applicable. References Abdul-Rahman A Goh HH Loke KK Noor NM Aizat WM RNA-seq analysis of mangosteen [ Garcinia mangostana Genom Data 2017 12 159 160 10.1016/j.gdata.2017.05.013 28560167 PMC5435573 Abdul-Rahman A, Goh HH, Loke KK, Noor NM, Aizat WM (2017) RNA-seq analysis of mangosteen [ Garcinia mangostana 28560167 10.1016/j.gdata.2017.05.013 PMC5435573 Aizat WM Ahmad-Hashim FH Syed Jaafar SN Valorization of mangosteen, “The Queen of Fruits”, and new advances in postharvest and in food and engineering applications: a review J Adv Res 2019 20 61 70 10.1016/j.jare.2019.05.005 31210985 PMC6562293 Aizat WM, Ahmad-Hashim FH, Syed Jaafar SN (2019a) Valorization of mangosteen, “The Queen of Fruits”, and new advances in postharvest and in food and engineering applications: a review. J Adv Res 20:61–70 31210985 10.1016/j.jare.2019.05.005 PMC6562293 Aizat WM Ahmad-Hashim FH Syed Jaafar SN Valorization of mangosteen, “The Queen of Fruits”, and new advances in postharvest and in food and engineering applications: a review J Adv Res 2019 20 61 70 10.1016/j.jare.2019.05.005 31210985 PMC6562293 Aizat WM, Ahmad-Hashim FH, Syed Jaafar SN (2019b) Valorization of mangosteen, “The Queen of Fruits”, and new advances in postharvest and in food and engineering applications: a review. J Adv Res 20:61–70 31210985 10.1016/j.jare.2019.05.005 PMC6562293 Aizat WM Jamil IN Ahmad-Hashim FH Noor NM Recent updates on metabolite composition and medicinal benefits of mangosteen plant PeerJ 2019 10.7717/peerj.6324 30755827 PMC6368837 Aizat WM, Jamil IN, Ahmad-Hashim FH, Noor NM (2019c) Recent updates on metabolite composition and medicinal benefits of mangosteen plant. PeerJ. 10.7717/peerj.6324 30755827 10.7717/peerj.6324 PMC6368837 Akao Y Nakagawa Y Iinuma M Nozawa Y Anti-cancer effects of xanthones from pericarps of mangosteen Int J Mol Sci 2008 9 355 370 10.3390/ijms9030355 19325754 PMC2635669 Akao Y, Nakagawa Y, Iinuma M, Nozawa Y (2008) Anti-cancer effects of xanthones from pericarps of mangosteen. Int J Mol Sci 9:355–370 19325754 10.3390/ijms9030355 PMC2635669 Ali A Chua BL Chow YH An insight into the extraction and fractionation technologies of the essential oils and bioactive compounds in Rosmarinus officinalis TrAC Trends Analyt Chem 2019 118 338 351 10.1016/j.trac.2019.05.040 Ali A, Chua BL, Chow YH (2019) An insight into the extraction and fractionation technologies of the essential oils and bioactive compounds in Rosmarinus officinalis Alizadeh Behbahani B Falah F Lavi Arab F Vasiee M Tabatabaee YF Chemical composition and antioxidant, antimicrobial, and antiproliferative activities of cinnamomum zeylanicum bark essential oil Evidence-Based Complement Alternat Medic 2020 2020 1 5190603 10.1155/2020/5190603 PMC7210559 32419807 Alizadeh Behbahani B, Falah F, Lavi Arab F, Vasiee M, Tabatabaee YF (2020) Chemical composition and antioxidant, antimicrobial, and antiproliferative activities of cinnamomum zeylanicum bark essential oil. Evidence-Based Complement Alternat Medic 2020(1):5190603. 10.1155/2020/5190603 10.1155/2020/5190603 PMC7210559 32419807 Almas I Innocent E Machumi F Kisinza W Chemical composition of essential oils from eucalyptus globulus and eucalyptus maculata grown in Tanzania Sci Afr 2021 1 12 e00758 Almas I, Innocent E, Machumi F, Kisinza W (2021) Chemical composition of essential oils from eucalyptus globulus and eucalyptus maculata grown in Tanzania. Sci Afr 1(12):e00758 Assawarachan R Noomhorm A Satong-Aun W Assawarachan R Noomhorm A The influence of drying temperature and extraction methods on α-mangostin in mangosteen pericarp J Food Sci Eng 2011 1 85 Assawarachan R, Noomhorm A, Satong-Aun W, Assawarachan R, Noomhorm A (2011) The influence of drying temperature and extraction methods on α-mangostin in mangosteen pericarp. J Food Sci Eng 1:85 Azmir J Zaidul ISM Rahman MM Sharif KM Mohamed A Sahena F Techniques for extraction of bioactive compounds from plant materials: a review J Food Eng 2013 117 4 426 436 10.1016/j.jfoodeng.2013.01.014 Azmir J, Zaidul ISM, Rahman MM, Sharif KM, Mohamed A, Sahena F et al (2013) Techniques for extraction of bioactive compounds from plant materials: a review. J Food Eng 117(4):426–436 Barba FJ Zhu Z Koubaa M Sant’Ana AS Orlien V Green alternative methods for the extraction of antioxidant bioactive compounds from winery wastes and by-products: a review Trends Food Sci Technol 2016 1 96 109 10.1016/j.tifs.2016.01.006 Barba FJ, Zhu Z, Koubaa M, Sant’Ana AS, Orlien V (2016) Green alternative methods for the extraction of antioxidant bioactive compounds from winery wastes and by-products: a review. Trends Food Sci Technol 1:96–109 Binti Zamarudin Z Bin Abdullah Sani MS Nordin NF Amid A Hashim AM Mangosteen [ Garcinia mangostana Halalsphere 2023 3 2 13 27 10.31436/hs.v3i2.74 Binti Zamarudin Z, Bin Abdullah Sani MS, Nordin NF, Amid A, Hashim AM (2023) Mangosteen [ Garcinia mangostana Capuzzo A Maffei ME Occhipinti A Supercritical fluid extraction of plant flavors and fragrances Molecules 2013 18 6 7194 10.3390/molecules18067194 23783457 PMC6270407 Capuzzo A, Maffei ME, Occhipinti A (2013) Supercritical fluid extraction of plant flavors and fragrances. Molecules 18(6):7194 23783457 10.3390/molecules18067194 PMC6270407 Chemat F Rombaut N Sicaire AG Meullemiestre A Fabiano-Tixier AS Abert-Vian M Ultrasound assisted extraction of food and natural products. Mechanisms, techniques, combinations, protocols and applications. A review Ultrason Sonochem 2017 34 540 560 10.1016/j.ultsonch.2016.06.035 27773280 Chemat F, Rombaut N, Sicaire AG, Meullemiestre A, Fabiano-Tixier AS, Abert-Vian M (2017a) Ultrasound assisted extraction of food and natural products. Mechanisms, techniques, combinations, protocols and applications. A review. Ultrason Sonochem 34:540–560. 10.1016/j.ultsonch.2016.06.035 27773280 10.1016/j.ultsonch.2016.06.035 Chemat F Rombaut N Sicaire AG Meullemiestre A Fabiano-Tixier AS Abert-Vian M Ultrasound assisted extraction of food and natural products. Mechanisms, techniques, combinations, protocols and applications. A review Ultrason Sonochem 2017 34 540 560 10.1016/j.ultsonch.2016.06.035 27773280 Chemat F, Rombaut N, Sicaire AG, Meullemiestre A, Fabiano-Tixier AS, Abert-Vian M (2017b) Ultrasound assisted extraction of food and natural products. Mechanisms, techniques, combinations, protocols and applications. A review. Ultrason Sonochem 34:540–560. 10.1016/j.ultsonch.2016.06.035 27773280 10.1016/j.ultsonch.2016.06.035 Cheok CY Chin NL Yusof YA Talib RA Law CL Optimization of total phenolic content extracted from Garcinia mangostana Ind Crops Prod 2012 40 1 247 253 10.1016/j.indcrop.2012.03.019 Cheok CY, Chin NL, Yusof YA, Talib RA, Law CL (2012) Optimization of total phenolic content extracted from Garcinia mangostana Chhouk K Quitain AT Gaspillo PAD Maridable JB Sasaki M Shimoyama Y Supercritical carbon dioxide-mediated hydrothermal extraction of bioactive compounds from Garcinia Mangostana J Supercrit Fluids 2016 1 110 167 175 10.1016/j.supflu.2015.11.016 Chhouk K, Quitain AT, Gaspillo PAD, Maridable JB, Sasaki M, Shimoyama Y et al (2016) Supercritical carbon dioxide-mediated hydrothermal extraction of bioactive compounds from Garcinia Mangostana Dahmoune F Nayak B Moussi K Remini H Madani K Optimization of microwave-assisted extraction of polyphenols from Myrtus communis Food Chem 2015 166 585 595 10.1016/j.foodchem.2014.06.066 25053097 Dahmoune F, Nayak B, Moussi K, Remini H, Madani K (2015) Optimization of microwave-assisted extraction of polyphenols from Myrtus communis 25053097 10.1016/j.foodchem.2014.06.066 de Mello RFA de Souza Pinheiro WB Benjamim JKF de Siqueira FC Chisté RC Santos AS A fast and efficient preparative method for separation and purification of main bioactive xanthones from the waste of Garcinia mangostana L by high-speed countercurrent chromatography Arabian J Chem 2021 14 8 103252 10.1016/j.arabjc.2021.103252 de Mello RFA, de Souza Pinheiro WB, Benjamim JKF, de Siqueira FC, Chisté RC, Santos AS (2021) A fast and efficient preparative method for separation and purification of main bioactive xanthones from the waste of Garcinia mangostana L by high-speed countercurrent chromatography. Arabian J Chem 14(8):103252 den Hartigh LJ Conjugated linoleic acid effects on cancer, obesity, and atherosclerosis: a review of pre-clinical and human trials with current perspectives Nutrients 2019 11 2 370 10.3390/nu11020370 30754681 PMC6413010 den Hartigh LJ (2019) Conjugated linoleic acid effects on cancer, obesity, and atherosclerosis: a review of pre-clinical and human trials with current perspectives. Nutrients 11(2):370 30754681 10.3390/nu11020370 PMC6413010 Ghasemzadeh A Jaafar HZE Rahmat A Swamy MK Optimization of microwave-assisted extraction of zerumbone from Zingiber zerumbet L rhizome and evaluation of antiproliferative activity of optimized extracts Chem Cent J 2017 11 1 5 10.1186/s13065-016-0235-3 28123448 PMC5216017 Ghasemzadeh A, Jaafar HZE, Rahmat A, Swamy MK (2017) Optimization of microwave-assisted extraction of zerumbone from Zingiber zerumbet L rhizome and evaluation of antiproliferative activity of optimized extracts. Chem Cent J 11(1):5 28123448 10.1186/s13065-016-0235-3 PMC5216017 Ghasemzadeh A Jaafar HZE Baghdadi A Tayebi-Meigooni A Alpha-mangostin-rich extracts from mangosteen pericarp: optimization of green extraction protocol and evaluation of biological activity Molecules 2018 23 8 1852 10.3390/molecules23081852 30044450 PMC6222712 Ghasemzadeh A, Jaafar HZE, Baghdadi A, Tayebi-Meigooni A (2018) Alpha-mangostin-rich extracts from mangosteen pericarp: optimization of green extraction protocol and evaluation of biological activity. Molecules 23(8):1852 30044450 10.3390/molecules23081852 PMC6222712 Guo M Wang X Lu X Wang H Brodelius PE α-Mangostin extraction from the native mangosteen ( Garcinia mangostana PLoS ONE 2016 11 9 e0161566 10.1371/journal.pone.0161566 27584012 PMC5008840 Guo M, Wang X, Lu X, Wang H, Brodelius PE (2016) α-Mangostin extraction from the native mangosteen ( Garcinia mangostana 27584012 10.1371/journal.pone.0161566 PMC5008840 Han MM Tangpromphan P Kaewchada A Jaree A Recovery and partial isolation of ⍺-mangostin from mangosteen pericarpsvia sequential extraction and precipitation PLoS ONE 2024 19 10 e0310453 10.1371/journal.pone.0310453 39453921 PMC11508469 Han MM, Tangpromphan P, Kaewchada A, Jaree A (2024) Recovery and partial isolation of ⍺-mangostin from mangosteen pericarpsvia sequential extraction and precipitation. PLoS ONE 19(10):e0310453 39453921 10.1371/journal.pone.0310453 PMC11508469 Hasan AEZ, Nashrianto H, Juhaeni RN, Artika IM. (2016) Optimization of conditions for flavonoids extraction from mangosteen [ Garcinia mangostana www.scholarsresearchlibrary.com Hiew CW Lee LJ Junus S Tan YN Chai TT Ee KY Optimization of microwave-assisted extraction and the effect of microencapsulation on mangosteen [ Garcinia mangostana Food Sci Technol 2021 42 e35521 10.1590/fst.35521 Hiew CW, Lee LJ, Junus S, Tan YN, Chai TT, Ee KY (2021) Optimization of microwave-assisted extraction and the effect of microencapsulation on mangosteen [ Garcinia mangostana Ibrahim MY Hashim NM Mariod AA Mohan S Abdulla MA Abdelwahab SI α-Mangostin from Garcinia mangostana Arab J Chem 2016 9 3 317 329 10.1016/j.arabjc.2014.02.011 Ibrahim MY, Hashim NM, Mariod AA, Mohan S, Abdulla MA, Abdelwahab SI et al (2016) α-Mangostin from Garcinia mangostana Jefferson RE Min D Corin K Wang JY Bowie JU Applications of single-molecule methods to membrane protein folding studies J Mol Biol 2018 430 4 424 10.1016/j.jmb.2017.05.021 28549924 PMC5700846 Jefferson RE, Min D, Corin K, Wang JY, Bowie JU (2018) Applications of single-molecule methods to membrane protein folding studies. J Mol Biol 430(4):424 28549924 10.1016/j.jmb.2017.05.021 PMC5700846 Jha AK Sit N Extraction of bioactive compounds from plant materials using combination of various novel methods: a review Trends Food Sci Technol 2022 119 Jan 1 579 591 10.1016/j.tifs.2021.11.019 Jha AK, Sit N (2022) Extraction of bioactive compounds from plant materials using combination of various novel methods: a review. Trends Food Sci Technol 119(Jan 1):579–591 Jung HA Su BN Keller WJ Mehta RG Kinghorn AD Antioxidant xanthones from the pericarp of Garcinia mangostana J Agric Food Chem 2006 54 6 2077 2082 10.1021/jf052649z 16536578 Jung HA, Su BN, Keller WJ, Mehta RG, Kinghorn AD (2006) Antioxidant xanthones from the pericarp of Garcinia mangostana 16536578 10.1021/jf052649z Kallel I Hadrich B Gargouri B Chaabane A Lassoued S Gdoura R Optimization of cinnamon (Cinnamomum zeylanicum Blume) essential oil extraction: evaluation of antioxidant and antiproliferative effects Evidence-Based Complement Alternat Medic 2019 2019 1 6498347 10.1155/2019/6498347 PMC6942840 31929818 Kallel I, Hadrich B, Gargouri B, Chaabane A, Lassoued S, Gdoura R et al (2019) Optimization of cinnamon (Cinnamomum zeylanicum Blume) essential oil extraction: evaluation of antioxidant and antiproliferative effects. Evidence-Based Complement Alternat Medic 2019(1):6498347. 10.1155/2019/6498347 10.1155/2019/6498347 PMC6942840 31929818 Kiso M Yamayoshi S Furusawa Y Imai M Kawaoka Y Treatment of highly pathogenic H7N9 virus-infected mice with baloxavir marboxil Viruses 2019 11 11 1066 10.3390/v11111066 31731678 PMC6893572 Kiso M, Yamayoshi S, Furusawa Y, Imai M, Kawaoka Y (2019) Treatment of highly pathogenic H7N9 virus-infected mice with baloxavir marboxil. Viruses 11(11):1066 31731678 10.3390/v11111066 PMC6893572 Kritsanawong S Innajak S Imoto M Watanapokasin R Antiproliferative and apoptosis induction of alpha-mangostin in T47D breast cancer cells Int J Oncol 2016 48 5 2155 2165 10.3892/ijo.2016.3399 26892433 Kritsanawong S, Innajak S, Imoto M, Watanapokasin R (2016) Antiproliferative and apoptosis induction of alpha-mangostin in T47D breast cancer cells. Int J Oncol 48(5):2155–2165 26892433 10.3892/ijo.2016.3399 Lee WJ Ng CC Ng JS Smith RL Kok SL Hee YY Supercritical carbon dioxide extraction of α-mangostin from mangosteen pericarp with virgin coconut oil as co-extractant and in-vitro bio-accessibility measurement Process Biochem 2019 1 87 213 220 10.1016/j.procbio.2019.09.009 Lee WJ, Ng CC, Ng JS, Smith RL, Kok SL, Hee YY et al (2019) Supercritical carbon dioxide extraction of α-mangostin from mangosteen pericarp with virgin coconut oil as co-extractant and in-vitro bio-accessibility measurement. Process Biochem 1(87):213–220 Li G Petiwala SM Nonn L Johnson JJ Inhibition of CHOP accentuates the apoptotic effect of α-mangostin from the mangosteen fruit (Garcinia mangostana) in 22Rv1 prostate cancer cells Biochem Biophys Res Commun 2014 453 1 75 80 10.1016/j.bbrc.2014.09.054 25261723 Li G, Petiwala SM, Nonn L, Johnson JJ (2014) Inhibition of CHOP accentuates the apoptotic effect of α-mangostin from the mangosteen fruit (Garcinia mangostana) in 22Rv1 prostate cancer cells. Biochem Biophys Res Commun 453(1):75–80 25261723 10.1016/j.bbrc.2014.09.054 Mahmudah R Adnyana IK Sukandar EY Pharmacological effects of Garcinia mangostana Res J Pharm Technol 2020 13 11 5471 5476 Mahmudah R, Adnyana IK, Sukandar EY (2020) Pharmacological effects of Garcinia mangostana Maulion RV. International journal of advanced research and publications microwave assisted extraction of pectin from mangosteen [ Garcinia Mangostana www.ijarp.org McKay DL Blumberg JB A review of the bioactivity and potential health benefits of peppermint tea [ Mentha piperita Phytotherapy Res 2006 20 8 619 633 10.1002/ptr.1936 16767798 McKay DL, Blumberg JB (2006) A review of the bioactivity and potential health benefits of peppermint tea [ Mentha piperita 10.1002/ptr.1936 16767798 Mohamed GA Al-Abd AM El-halawany AM Abdallah HM Ibrahim SRM New xanthones and cytotoxic constituents from Garcinia mangostana J Ethnopharmacol 2017 198 302 312 10.1016/j.jep.2017.01.030 28108382 Mohamed GA, Al-Abd AM, El-halawany AM, Abdallah HM, Ibrahim SRM (2017) New xanthones and cytotoxic constituents from Garcinia mangostana 28108382 10.1016/j.jep.2017.01.030 Mohammad NA Abang Zaidel DN Muhamad II Abdul Hamid M Yaakob H Mohd Jusoh YM Optimization of the antioxidant-rich xanthone extract from mangosteen [ Garcinia mangostana Heliyon 2019 5 10 e02571 10.1016/j.heliyon.2019.e02571 31667409 PMC6812211 Mohammad NA, Abang Zaidel DN, Muhamad II, Abdul Hamid M, Yaakob H, Mohd Jusoh YM (2019) Optimization of the antioxidant-rich xanthone extract from mangosteen [ Garcinia mangostana 31667409 10.1016/j.heliyon.2019.e02571 PMC6812211 Mohd Noor N Aizat WM Hussin K Rohani ER Seed characteristics and germination properties of four Garcinia [Clusiaceae] fruit species EDP Sci 2016 71 4 199 207 Mohd Noor N, Aizat WM, Hussin K, Rohani ER (2016) Seed characteristics and germination properties of four Garcinia [Clusiaceae] fruit species. EDP Sci 71(4):199–207 Moreira SA Alexandre EMC Pintado M Saraiva JA Effect of emergent non-thermal extraction technologies on bioactive individual compounds profile from different plant materials Food Res Int 2019 1 115 177 190 10.1016/j.foodres.2018.08.046 30599930 Moreira SA, Alexandre EMC, Pintado M, Saraiva JA (2019) Effect of emergent non-thermal extraction technologies on bioactive individual compounds profile from different plant materials. Food Res Int 1(115):177–190 10.1016/j.foodres.2018.08.046 30599930 Musso N Conte L Carloni B Campana C Chiusano MC Giusti M Low-salt intake suggestions in hypertensive patients do not jeopardize urinary iodine excretion Nutrients 2018 10 10 1548 10.3390/nu10101548 30347728 PMC6213341 Musso N, Conte L, Carloni B, Campana C, Chiusano MC, Giusti M (2018) Low-salt intake suggestions in hypertensive patients do not jeopardize urinary iodine excretion. Nutrients 10(10):1548 30347728 10.3390/nu10101548 PMC6213341 Mustafa A Turner C Pressurized liquid extraction as a green approach in food and herbal plants extraction: a review Anal Chim Acta 2011 703 1 8 18 10.1016/j.aca.2011.07.018 21843670 Mustafa A, Turner C (2011) Pressurized liquid extraction as a green approach in food and herbal plants extraction: a review. Anal Chim Acta 703(1):8–18 21843670 10.1016/j.aca.2011.07.018 Muzykiewicz A Zielonka-Brzezicka J Siemak J Klimowicz A Antioxidant activity and polyphenol content in extracts from various parts of fresh and frozen mangosteen Acta Sci Pol Technol Aliment 2020 19 3 261 270 32978909 10.17306/J.AFS.0788 Muzykiewicz A, Zielonka-Brzezicka J, Siemak J, Klimowicz A (2020) Antioxidant activity and polyphenol content in extracts from various parts of fresh and frozen mangosteen. Acta Sci Pol Technol Aliment 19(3):261–270 32978909 10.17306/J.AFS.0788 Naczk M Towsend M Zadernowski R Shahidi F Protein-binding and antioxidant potential of phenolics of mangosteen fruit [ Garcinia mangostana Food Chem 2011 128 2 292 298 10.1016/j.foodchem.2011.03.017 25212134 Naczk M, Towsend M, Zadernowski R, Shahidi F (2011) Protein-binding and antioxidant potential of phenolics of mangosteen fruit [ Garcinia mangostana 25212134 10.1016/j.foodchem.2011.03.017 Oh Y Do HTT Kim S Kim YM Chin YW Cho J Memory-enhancing effects of mangosteen pericarp water extract through antioxidative neuroprotection and anti-apoptotic action Antioxidants 2020 10 1 1 23 10.3390/antiox10010034 33396950 PMC7823671 Oh Y, Do HTT, Kim S, Kim YM, Chin YW, Cho J (2020) Memory-enhancing effects of mangosteen pericarp water extract through antioxidative neuroprotection and anti-apoptotic action. Antioxidants 10(1):1–23 33396950 10.3390/antiox10010034 PMC7823671 Oliver C Watson C Crowley E Gilroy M Page D Weber K Vitamin and mineral supplementation practices in preterm infants: a survey of australian and new zealand neonatal intensive and special care units Nutrients 2020 12 1 51 10.3390/nu12010051 PMC7019934 31878077 Oliver C, Watson C, Crowley E, Gilroy M, Page D, Weber K et al (2020) Vitamin and mineral supplementation practices in preterm infants: a survey of australian and new zealand neonatal intensive and special care units. Nutrients 12(1):51 10.3390/nu12010051 PMC7019934 31878077 Ortíz Aguilar J Marín Mahecha O León PA Suarez Rivero M Acuña Monsalve Y Zuluaga Domínguez CM Potencial antioxidante de los extractos obtenidos del pericarpio y la semilla del fruto de Garcinia mangostana Agron Colomb 2016 34 1 S709 S711 Ortíz Aguilar J, Marín Mahecha O, León PA, Suarez Rivero M, Acuña Monsalve Y, Zuluaga Domínguez CM et al (2016) Potencial antioxidante de los extractos obtenidos del pericarpio y la semilla del fruto de Garcinia mangostana Patil P Agrawal M Almelkar S Jeengar MK More A Alagarasu K In vitro and in vivo studies reveal α-Mangostin, a xanthonoid from Garcinia mangostana Virol J 2021 18 1 47 10.1186/s12985-021-01517-z 33639977 PMC7916311 Patil P, Agrawal M, Almelkar S, Jeengar MK, More A, Alagarasu K et al (2021) In vitro and in vivo studies reveal α-Mangostin, a xanthonoid from Garcinia mangostana 33639977 10.1186/s12985-021-01517-z PMC7916311 Pedraza-Chaverri J Cárdenas-Rodríguez N Orozco-Ibarra M Pérez-Rojas JM Medicinal properties of mangosteen ( Garcinia mangostana Food Chem Toxicol 2008 46 10 3227 3239 10.1016/j.fct.2008.07.024 18725264 Pedraza-Chaverri J, Cárdenas-Rodríguez N, Orozco-Ibarra M, Pérez-Rojas JM (2008) Medicinal properties of mangosteen ( Garcinia mangostana 18725264 10.1016/j.fct.2008.07.024 Pimentel-Moral S Borrás-Linares I Lozano-Sánchez J Arráez-Román D Martínez-Férez A Segura-Carretero A Microwave-assisted extraction for hibiscus sabdariffa bioactive compounds J Pharm Biomed Anal 2018 15 156 313 322 10.1016/j.jpba.2018.04.050 29734100 Pimentel-Moral S, Borrás-Linares I, Lozano-Sánchez J, Arráez-Román D, Martínez-Férez A, Segura-Carretero A (2018) Microwave-assisted extraction for hibiscus sabdariffa bioactive compounds. J Pharm Biomed Anal 15(156):313–322 10.1016/j.jpba.2018.04.050 29734100 Plaza M Turner C Pressurized hot water extraction of bioactives TrAC Trends Anal Chem 2015 71 Sep 1 39 54 10.1016/j.trac.2015.02.022 Plaza M, Turner C (2015) Pressurized hot water extraction of bioactives. TrAC Trends Anal Chem 71(Sep 1):39–54 Plaza M Domínguez-Rodríguez G Sahelices C Marina ML A sustainable approach for extracting non-extractable phenolic compounds from mangosteen peel using ultrasound-assisted extraction and natural deep eutectic solvents Appl Sci 2021 11 12 5625 10.3390/app11125625 Plaza M, Domínguez-Rodríguez G, Sahelices C, Marina ML (2021) A sustainable approach for extracting non-extractable phenolic compounds from mangosteen peel using ultrasound-assisted extraction and natural deep eutectic solvents. Appl Sci 11(12):5625 Pothitirat W Chomnawang MT Gritsanapan W Anti-acne-inducing bacterial activity of mangosteen fruit rind extracts Med Princ Pract 2010 19 4 281 286 10.1159/000312714 20516704 Pothitirat W, Chomnawang MT, Gritsanapan W (2010a) Anti-acne-inducing bacterial activity of mangosteen fruit rind extracts. Med Princ Pract 19(4):281–286 20516704 10.1159/000312714 Pothitirat W Chomnawang MT Supabphol R Gritsanapan W Free radical scavenging and anti-acne activities of mangosteen fruit rind extracts prepared by different extraction methods Pharm Biol 2010 48 2 182 186 10.3109/13880200903062671 20645837 Pothitirat W, Chomnawang MT, Supabphol R, Gritsanapan W (2010b) Free radical scavenging and anti-acne activities of mangosteen fruit rind extracts prepared by different extraction methods. Pharm Biol 48(2):182–186 20645837 10.3109/13880200903062671 Puri M Sharma D Barrow CJ Enzyme-assisted extraction of bioactives from plants Trends Biotechnol 2012 30 37 44 10.1016/j.tibtech.2011.06.014 21816495 Puri M, Sharma D, Barrow CJ (2012) Enzyme-assisted extraction of bioactives from plants. Trends Biotechnol 30:37–44 21816495 10.1016/j.tibtech.2011.06.014 Pusat P, Reduksi T, Bencana R, Bidang K, Pengembangan T, Alam S, et al. (2023) Tinjauan hasil-hasil penelitian tentang timbulan limbah b3 medis dan rumah tangga selama bencana pandemik Covid-19 researches review on generation of medical and municipal hazardous waste during covid-19 pandemic disaster. Vol. 4 Renard CMGC Extraction of bioactives from fruit and vegetables: state of the art and perspectives LWT 2018 1 93 390 395 10.1016/j.lwt.2018.03.063 Renard CMGC (2018) Extraction of bioactives from fruit and vegetables: state of the art and perspectives. LWT 1(93):390–395 Rodsamran P Sothornvit R Extraction of phenolic compounds from lime peel waste using ultrasonic-assisted and microwave-assisted extractions Food Biosci 2019 28 Apr 1 66 73 10.1016/j.fbio.2019.01.017 Rodsamran P, Sothornvit R (2019) Extraction of phenolic compounds from lime peel waste using ultrasonic-assisted and microwave-assisted extractions. Food Biosci 28(Apr 1):66–73 Saraswathy SUP Lalitha LCP Rahim S Gopinath C Haleema S SarojiniAmma S A review on synthetic and pharmacological potential of compounds isolated from Garcinia mangostana Phytomedicine plus. 2022 2 2 100253 10.1016/j.phyplu.2022.100253 Saraswathy SUP, Lalitha LCP, Rahim S, Gopinath C, Haleema S, SarojiniAmma S et al (2022) A review on synthetic and pharmacological potential of compounds isolated from Garcinia mangostana Suryono S, Hadiyanto H, Yasin M, Widyowati R, Muniroh M, Amalia A. (2019) Effect of frequency, temperature, and time of sonication on xanton content of mangosteen [ Garcinia mangostana https://ui.adsabs.harvard.edu/abs/2019E3SWC.12525006S/abstract Tan SSY Shanmugham M Chin YL An J Chua CK Ong ES Pressurized hot water extraction of mangosteen pericarp and its associated molecular signatures in endothelial cells Antioxidants 2023 12 11 1932 10.3390/antiox12111932 38001785 PMC10669822 Tan SSY, Shanmugham M, Chin YL, An J, Chua CK, Ong ES et al (2023) Pressurized hot water extraction of mangosteen pericarp and its associated molecular signatures in endothelial cells. Antioxidants 12(11):1932 38001785 10.3390/antiox12111932 PMC10669822 Tiwari BK Ultrasound: a clean, green extraction technology TrAC, Trends Anal Chem 2015 1 71 100 109 10.1016/j.trac.2015.04.013 Tiwari BK (2015) Ultrasound: a clean, green extraction technology. TrAC, Trends Anal Chem 1(71):100–109 Uwineza PA Waśkiewicz A Recent advances in supercritical fluid extraction of natural bioactive compounds from natural plant materials Molecules 2020 25 17 3847 10.3390/molecules25173847 32847101 PMC7504334 Uwineza PA, Waśkiewicz A (2020) Recent advances in supercritical fluid extraction of natural bioactive compounds from natural plant materials. Molecules 25(17):3847 32847101 10.3390/molecules25173847 PMC7504334 Vien LC Chinnappan S Mogana R Antioxidant activity of Garcinia mangostana Res J Pharm Technol 2021 14 8 4466 4470 10.52711/0974-360X.2021.00776 Vien LC, Chinnappan S, Mogana R (2021) Antioxidant activity of Garcinia mangostana Vinatoru M Mason TJ Calinescu I Ultrasonically assisted extraction [UAE] and microwave assisted extraction [MAE] of functional compounds from plant materials TrAC Trends Anal Chem 2017 97 1 159 178 10.1016/j.trac.2017.09.002 Vinatoru M, Mason TJ, Calinescu I (2017) Ultrasonically assisted extraction [UAE] and microwave assisted extraction [MAE] of functional compounds from plant materials. TrAC Trends Anal Chem 97(1):159–178 Wang A Li D Wang S Zhou F Li P Wang Y γ-Mangostin, a xanthone from mangosteen, attenuates oxidative injury in liver via NRF2 and SIRT1 induction J Funct Foods 2018 1 40 544 553 10.1016/j.jff.2017.11.047 Wang A, Li D, Wang S, Zhou F, Li P, Wang Y et al (2018) γ-Mangostin, a xanthone from mangosteen, attenuates oxidative injury in liver via NRF2 and SIRT1 induction. J Funct Foods 1(40):544–553 Weiss NH Peasant C Sullivan TP Intimate partner violence and HIV-risk behaviors: evaluating avoidant coping as a moderator AIDS Behav 2017 21 8 2233 2242 10.1007/s10461-016-1588-2 27778220 PMC5472532 Weiss NH, Peasant C, Sullivan TP (2017) Intimate partner violence and HIV-risk behaviors: evaluating avoidant coping as a moderator. AIDS Behav 21(8):2233–2242 27778220 10.1007/s10461-016-1588-2 PMC5472532 Williams H Downes E Development of a course on complex humanitarian emergencies: preparation for the impact of climate change J Nurs Scholarsh 2017 49 6 661 10.1111/jnu.12339 28960808 PMC5729744 Williams H, Downes E (2017) Development of a course on complex humanitarian emergencies: preparation for the impact of climate change. J Nurs Scholarsh 49(6):661 28960808 10.1111/jnu.12339 PMC5729744 Wittenauer J Falk S Schweiggert-Weisz U Carle R Characterisation and quantification of xanthones from the aril and pericarp of mangosteens ( Garcinia mangostana Food Chem 2012 134 1 445 452 10.1016/j.foodchem.2012.02.094 Wittenauer J, Falk S, Schweiggert-Weisz U, Carle R (2012) Characterisation and quantification of xanthones from the aril and pericarp of mangosteens ( Garcinia mangostana Yoswathana N Eshtiaghi MN Optimization of subcritical ethanol extraction for xanthone from mangosteen pericarp Int J Chem Eng Appl 2015 6 2 115 119 Yoswathana N, Eshtiaghi MN (2015) Optimization of subcritical ethanol extraction for xanthone from mangosteen pericarp. Int J Chem Eng Appl 6(2):115–119 Yuvanatemiya V Srean P Klangbud WK Venkatachalam K Wongsa J Parametthanuwat T A review of the influence of various extraction techniques and the biological effects of the xanthones from mangosteen [ Garcinia mangostana Molecules 2022 27 24 8775 10.3390/molecules27248775 36557908 PMC9782657 Yuvanatemiya V, Srean P, Klangbud WK, Venkatachalam K, Wongsa J, Parametthanuwat T et al (2022) A review of the influence of various extraction techniques and the biological effects of the xanthones from mangosteen [ Garcinia mangostana 36557908 10.3390/molecules27248775 PMC9782657 Zadernowski R Czaplicki S Naczk M Phenolic acid profiles of mangosteen fruits [ Garcinia mangostana Food Chem 2009 112 3 685 689 10.1016/j.foodchem.2008.06.030 Zadernowski R, Czaplicki S, Naczk M (2009) Phenolic acid profiles of mangosteen fruits [ Garcinia mangostana Zarena AS Sankar KU Phenolic acids, flavonoid profile and antioxidant activity in mangosteen ( Garcinia mangostana J Food Biochem 2012 36 5 627 633 10.1111/j.1745-4514.2011.00575.x Zarena AS, Sankar KU (2012) Phenolic acids, flavonoid profile and antioxidant activity in mangosteen ( Garcinia mangostana Zhang Y Kabba J Chang J Ji W Zhu S Yu J A school-based educational intervention for school-aged children and caregivers about rational use of antibiotics in urban areas of Shaanxi province: a study protocol for a randomized controlled research Int J Environ Res Public Health 2018 15 9 1912 10.3390/ijerph15091912 30720793 PMC6163849 Zhang Y, Kabba J, Chang J, Ji W, Zhu S, Yu J et al (2018) A school-based educational intervention for school-aged children and caregivers about rational use of antibiotics in urban areas of Shaanxi province: a study protocol for a randomized controlled research. Int J Environ Res Public Health 15(9):1912 30720793 10.3390/ijerph15091912 PMC6163849 Zhang L Cui X Han Y Park KS Gao X Zhang X Hypoxic drive caused type 3 neovascularization in a preclinical model of exudative age-related macular degeneration Hum Mol Genet 2019 28 20 3475 3485 10.1093/hmg/ddz159 31518400 PMC7275777 Zhang L, Cui X, Han Y, Park KS, Gao X, Zhang X et al (2019) Hypoxic drive caused type 3 neovascularization in a preclinical model of exudative age-related macular degeneration. Hum Mol Genet 28(20):3475–3485 31518400 10.1093/hmg/ddz159 PMC7275777 ",
  "metadata": {
    "Title of this paper": "Hypoxic drive caused type 3 neovascularization in a preclinical model of exudative age-related macular degeneration",
    "Journal it was published in:": "Journal of Food Science and Technology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484499/"
  }
}