{
  "title": "Paper_11",
  "abstract": "pmc World Allergy Organ J World Allergy Organ J 1903 waoj The World Allergy Organization Journal 1939-4551 World Allergy Organization PMC12490600 PMC12490600.1 12490600 12490600 10.1016/j.waojou.2025.101108 S1939-4551(25)00085-7 101108 1 Full Length Article LncRNA PELATON regulates Th2 cell differentiation by miR-10b-5p/GATA3 axis in allergic rhinitis ☆ Liu Zhen MD a b 1 Li Yumei PhD a b 1 Zhao Xiangkun MM b c Sun Qi MD a b Zhang Yu MD a b Wang Yaqi MM a b Fang Han MD a b Yang Yujuan MD yangyujuanyyj@163.com a b ⁎ Mou Yakui MD muykmd@126.com a b ⁎⁎ Song Xicheng MD drxchsong@163.com a b ⁎⁎⁎ a b c ⁎ yangyujuanyyj@163.com ⁎⁎ muykmd@126.com ⁎⁎⁎ drxchsong@163.com 1 Zhen Liu and Yumei Li should be considered joint first author. 9 2025 21 8 2025 18 9 495859 101108 9 4 2025 19 7 2025 30 7 2025 21 08 2025 03 10 2025 03 10 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). Background Long non-coding RNAs (lncRNAs) have been increasingly recognized as critical regulators in the pathogenesis of immunoinflammatory diseases. Nevertheless, their mechanistic contributions to Th2-driven allergic rhinitis (AR) remain unclear. This study investigated the immunomodulatory function of lncRNA PELATON in AR pathogenesis by exploring its regulatory effects on Th2 cell differentiation. Methods A total of 32 participants were enrolled, comprising 16 patients diagnosed with AR and 16 control subjects. The allergy levels of the participants were assessed using the skin prick test (SPT), and the levels of PELATON expression in PBMCs were detected by qPCR. Spearman's correlation analysis was used to calculate the correlation between the 2 variables. Changes in GATA3, IL-4, IL-5, and IL-13 expression were examined, as well as changes in Th2 cell differentiation resulting from the overexpression of PELATON and miR-10b-5p. Modulation of miR-10b-5p and GATA3 expression by PELATON was studied via transcriptome sequencing, dual-luciferase reporter assays, and in vitro Results LncRNA PELATON expression was elevated in patients with AR and showed a significant correlation with allergy levels. PELATON was enriched in CD4 + Conclusion LncRNA PELATON competitively binds to miR-10b-5p and promotes GATA3 expression, resulting in Th2 cell differentiation and activation in AR. Formation of the lncRNA PELATON/miR-10b-5p/GATA3 ceRNA network is a regulatory mechanism that offers new possibilities for finding therapeutic targets for AR. Keywords Allergic rhinitis RNA Long noncoding GATA3 transcription factor MicroRNAs Th2 cells pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Abbreviations AR allergic rhinitis lnc lncRNA GATA3 GATA binding protein 3 miR microRNA PBMCs peripheral blood mononuclear cells ceRNA competitive endogenous RNA UTRs untranslated regions SPT skin prick test WT wild-type MUT mutant Introduction Allergic rhinitis (AR) is an IgE-mediated nasal mucosal inflammation caused by allergens and presents with symptoms of rhinorrhea, sneezing, nasal congestion, and itching. AR affects 10–30% of adults globally, and approximately 40% of AR patients subsequently develop asthma, which imposes a substantial economic burden on society. 1 2 Accumulating evidence indicates that dysregulated differentiation of CD4 + 3 + 4 , 5 Long noncoding RNAs (lncRNAs) are RNA molecules exceeding 200 nucleotides in length. They can be categorized based on their relative positions to known neighboring \"protein-encoding\" exons. LncRNAs transcribed from regions between protein-encoding genes are known as long intergenic lncRNAs, whereas those transcribed from intronic regions are called intronic lncRNAs. 6 7 8 9 10 11 12 13 , 14 15 , 16 17 18 , 19 20 Although several studies have demonstrated the differential expression of lncRNAs and miRNAs in patients with AR, the precise regulatory mechanisms of lncRNAs in AR pathogenesis remain poorly understood. Therefore, a thorough investigation into the function of lncRNA in AR could assist in identifying biomarkers that aid in the diagnosis, treatment, and prediction of AR. This study examined the pivotal role played by PELATON in Th2 cell differentiation within AR and provides critical insights into the underlying mechanisms that drive the pathogenesis of allergic airway diseases. Materials and methods Patient inclusion and exclusion criteria This study enrolled a total of 32 participants, comprising 16 patients diagnosed with AR and 16 control subjects. All patients had a confirmed diagnosis of AR, as defined by the Chinese Guidelines for the Diagnosis and Treatment of Allergic Rhinitis. 21 Supplementary Table 1 Allergy detection The allergic sensitization of participants in this study was evaluated using the SPT, which is a highly sensitive and standardized method used for detecting IgE-mediated type I hypersensitivity and diagnosing AR. 22 , 23 24 Total Nasal Symptom Score Total Nasal Symptom Score (TNSS) is defined as the sum of individual symptom scores for rhinorrhea, nasal congestion, nasal pruritus, and sneezing, with each symptom rated on a 4-point scale ranging from 0 (none) to 3 (severe). PBMC and CD4 + Peripheral blood mononuclear cells (PBMCs) were isolated from freshly collected anticoagulated peripheral blood using a Ficoll density gradient centrifugation kit (Solarbio, China). Following isolation, the PBMCs were washed twice with phosphate-buffered saline (PBS). Subsequently, CD4 + + + Separation of the cell nucleus and cytoplasm and PELATON expression analysis Subcellular localization of PELATON was analyzed by performing nucleocytoplasmic fractionation assays. A PARIS™ Kit Protein and RNA Isolation System (Thermo Fisher Scientific, Waltham, MA, USA) was used to perform nuclear and cytoplasmic fractionation of Jurkat cells, which is an immortalized human T-lymphocyte cell line extensively utilized in biomedical research for investigating T-cell signaling pathways and the expression profiles of chemokine receptors. 25 Construction and transfection of PELATON overexpression lentivirus PBMCs and Jurkat cells were cultured for 24 h and then infected with an appropriate volume of control or PELATON overexpression lentivirus (constructed by Hanheng Biological Technology, MOI = 5), followed by the addition of 6 μg/mL polybrene. Purinomycin (1 μg/mL) was added to Jurkat cells at 48 h after infection to screen for stably transfected cell lines. Transcriptional small RNA sequencing and analysis To identify PELATON-regulated downstream genes, we performed transcriptome sequencing using PELATON-overexpressing Jurkat cells, with sequencing services provided by Applied Protein Technology (Shanghai, China). Total RNA was extracted from the samples using Trizol Reagent (Invitrogen Life Technologies, Carlsbad, CA, USA). Small RNA libraries were constructed using the NEBNext Multiplex Small RNA Library Prep Set for Illumina. The quantified libraries were combined and sequenced on Illumina platforms based on the optimal library concentration and necessary data. The detailed steps are mentioned in a previous publication by Arindrarto et al, 2021. 26 Differential expression of miRNAs and target gene prediction A differential expression analysis was conducted between the control group and the PELATON overexpression group by using the DESeq R package (version 1.8.3). The P P P The predicted target genes of the differentially expressed miRNAs were identified through a KEGG analysis ( https://www.kegg.jp/ Transfection of PELATON siRNA, miR-10b-5p inhibitors, and mimics Specific siRNAs for PELATON, as well as inhibitors and mimics for miR-10b-5p, were designed and produced by GenePharma (Shanghai, China). The sequences used were as follows: PELATON siRNA: 5’-CAAGUGCCCAGUAAACACUTT-3’; miR-10b-5p inhibitor: 5′-CACAAAUUCGGUUCUACAGGGUA-3’; miR-10b-5p mimics: sense-5′- UACCCUGUAGAACCGAAUUUGUG-3′, antisense-5′-CAAAUUCGGUUCUACAGGGUAUU-3’. SiRNAs, inhibitors, and mimics were transfected into PBMCs at 48h by using Lipofectamine 3000 (Thermo Fisher Scientific, USA), according to the manufacturer's instructions. RNA extraction and qPCR Changes in gene expression at the transcriptional level were quantified using qPCR. RNA was extracted from PBMC cells with SparkZol Reagent (SparkJade, China), according to the manufacturer's protocol. For lncRNA, reverse transcription into cDNA was carried out using a total-transcriptome cDNA Synthesis Kit (Applied Biological Materials, USA). Similarly, microRNAs were converted into cDNA by using a miRNA 1st Strand cDNA Synthesis Kit (Accurate Biotech, China), according to the provided guidelines. The 2 × SYBR Green QPCR Mix (With ROX) reagent (SparkJade, China) was used for performing qPCR, with GAPDH and U6 serving as the reference genes. Gene expression levels were quantified via the 2 −ΔΔCT Supplementary Table 3 Protein extraction and western blotting Changes in gene expression at the translational level were detected by western blotting. Total proteins were extracted from PBMC cells using RIPA lysis buffer (Solarbio, China). The protein samples were resolved via SDS-PAGE, and the protein bands were subsequently transferred onto PVDF membranes, which were blocked to prevent non-specific binding. Next, the membranes were incubated overnight at 4°C with primary antibodies that included rabbit anti-β-ACTIN, anti-GAPDH (1:1000, Affinity, Cincinnati, OH, USA), and anti-GATA3 (1:1000, Sino Biological, China); after which, the membranes were incubated with an HRP-conjugated goat anti-rabbit secondary antibody (1:1000, Affinity, USA) for 2 h at room temperature. Protein-antibody complexes were visualized using a hypersensitive chemiluminescent reagent (SparkJade, China). Protein expression levels were quantified using Image J software and normalized against those of GAPDH. Luciferase assay Dual-luciferase reporter assays were performed to verify the binding sites between PELATON, miR-10b-5p, and GATA3. PELATON was predicted to bind to miR-10b-5p via the 26–30 5′-GGTTC-3′ site. In turn, miR-10b-5p was predicted to bind to the GATA3-3′ UTR region at site 236–242 5′-ACAGGG-3'. In order to block miR-10b-5p binding to PELATON or the GATA3-3′ UTR, we mutated the binding sites from 5′-GGTTC-3′ to 5′-AACCG-3′ in PELATON, and from 5′-ACAGGG-3′ to 5′-GCGAAA-3′ in the GATA3-3′ UTR. Next, we constructed psiCHECK2 vector plasmids (Sangon Biotech, China) that contained the wild-type (WT) and mutant (MUT) PELATON and GATA3 3′UTR region, and designated them as PELATON-WT, GATA3-3′-UTR-WT, PELATON-MUT, and GATA3-3′-UTR-MUT. Plasmids were separately co-transfected into 293T cells along with miR-10b-5p mimics or mimic control (GenePharma, China) by using Lipofectamine 3000 for 48 h. Luciferase activity was measured using a Dual Luciferase Reporter Assay Kit (Vazyme, China). ELISA Inflammatory mediators in PBMCs were quantified by ELISA. The supernatant of the PBMC cell culture solutions was collected, and the concentrations of IL-4, IL-5, and IL-13 were detected using the ELISA kit (Jiyinmei Biotechnology, China), as per the manufacturer's instructions. Flow cytometric analysis Changes in Th2 cell proportions were analyzed by flow cytometry. PBMCs were incubated on ice with anti-human CD4-Percp-Cy5.5 (Thermo Fisher Scientific, USA) for 1 h in the dark. For intracellular GATA3 staining, cells were permeabilized using a permeabilization/fixation buffer (Thermo Fisher Scientific, USA) and then labeled with anti-human-GATA3-AF488 (Thermo Fisher Scientific, USA) for 1 h. The stained samples were analyzed using a FACSCalibur flow cytometer (BD Biosciences, San Jose, CA, USA), and data were processed with FlowJo_v10.8.1 (FlowJo software, USA). Gating strategy for sorting CD4 + + + + + Correlation analysis The correlation between PELATON expression levels in PBMCs and allergy levels, as well as TNSS, and the correlation between PELATON and miR-10b-5p expression levels were assessed using Spearman's correlation analysis. Statistical analysis All data were analyzed using GraphPad Prism 9.0 software (GraphPad Software, USA), and results are expressed as a mean value ± standard deviation. Gene expression (qRT-PCR) was quantified using the 2 −ΔΔCT t 27 P Results PELATON was highly expressed in AR PELATON expression was significantly increased in the peripheral blood of patients with AR when compared to healthy control subjects ( Fig. 1 Fig. 1 Supplementary Table 2 + + + + Fig. 1 Fig. 1 + Fig. 1 Expression of PELATON in AR. (a) Expression of PELATON in AR (n = 16) and control subjects (n = 16) was detected by qPCR. (b, c) Correlation analysis of the relative expression of PELATON with the corresponding allergy level and Total Nasal Symptom Score (TNSS) in all subjects by using the Spearman's rank correlation coefficient. The vertical coordinate is the relative expression level of PELATON and the horizontal coordinate is the corresponding allergy level or TNSS. N = 32. (d) Expression of PELATON in non-CD4 + + P Fig. 1 PELATON promoted the differentiation and activation of Th2 cells To explore the effect of PELATON on Th2 cell differentiation, we forced the overexpression and knockdown of PELATON in PBMCs, and then detected the expression levels of the Th2 cell-specific transcription factor GATA3 and the inflammatory factors IL-4, IL-5, and IL-13 in the PBMCs. Overexpression of PELATON in PBMCs ( Fig. 2 Fig. 2 Supplementary Fig. 2 Fig. 2 Fig. 2 Fig. 2 Supplementary Fig. 2 Fig. 2 + Fig. 2 Supplementary Fig. 1 + Fig. 2 Effect of PELATON on Th2 cell differentiation and activation. (a) The efficiency of PELATON overexpression was detected by qPCR. (b) The expression of GATA3 mRNA in the control and PELATON overexpression groups was detected by qPCR. (c, d) The expression of GATA3 protein in the control and PELATON overexpression groups was detected by western blotting; the relative expression of GATA3/ACTIN was analyzed using ImageJ software (n = 4). (e, f, g) The expression of IL-4, IL-5, and IL-13 in the control and PELATON overexpression groups were detected by ELISA (n = 4). (h) The efficiency of PELATON knockdown was detected by qPCR. (i) The expression of GATA3 mRNA in the control and PELATON knockdown groups was detected by qPCR. (j, k) Expression of GATA3 protein in the control and PELATON knockdown groups was detected by western blotting; the relative expression of GATA3/ACTIN was analyzed using ImageJ software. N = 4. (l, m, n) The expression of IL-4, IL-5, and IL-13 in the control and PELATON knockdown groups were detected by ELISA (n = 4). Flow cytometry was used to detect (o) the proportion of GATA3+Th2 cells in the CD4+T cell population of the control group, and (p) the proportion of GATA3+Th2 cells in the CD4+T cell population of the PELATON overexpression group. (q) A comparative analysis of the Th2 cell proportion in the control group and PELATON overexpression group was performed using FlowJo software (n = 4). ∗, P P P Fig. 2 MiR-10b-5p decreased the differentiation and activation of Th2 cells Previous studies reported that lncRNAs expressed in the cytoplasm often serve as molecular sponges for miRNAs that regulate gene expression. 28 , 29 Supplementary Table 4 Supplementary Table 5 Supplementary Table 6 Fig. 3 Fig. 3 Fig. 3 Effect of miR-10b-5p on Th2 cell differentiation and activation. (a) The regulatory relationship of 34 miRNAs and their 14 target mRNAs related to Th2 cell differentiation when PELATON was overexpressed in Jurkat cells. A qPCR-based analysis showed that: (b) MiR-10b-5p expression was significantly downregulated, and the expression of 2 other miRNAs was not significantly changed by PELATON overexpression, and (c) the expression of miR-10b-5p in AR (n = 16) and control subjects (n = 16). (d) Expression of GATA3 mRNA in the control and miR-10b-5p mimics groups, as detected by qPCR. (e) Expression of GATA3 protein in control versus miR-10b-5p mimic groups, as detected by western blotting. (f) The relative expression of GATA3/ACTIN was analyzed using ImageJ software (n = 4). (g) Expression of GATA3 mRNA in the control and miR-10b-5p inhibitor groups was detected by qPCR. (h) Expression of GATA3 protein in the control and miR-10b-5p inhibitor groups was detected by western blotting. (i) The relative expression of GATA3/ACTIN was analyzed using ImageJ software (n = 3). (j, k, l) Changes in the levels of IL-4, IL-5, and IL-13 in the cell supernatants of the control group versus the miR-10b-5p mimic groups, as detected by ELISA. (m, n) Proportion of GATA3 + + P P P Fig. 3 We then verified the expression and function of miR-10b-5p in regulating Th2 in AR. In patients with AR, PBMCs exhibited a significantly reduced expression of miR-10b-5p when compared to PBMCs from control subjects ( Fig. 3 Fig. 3 Supplementary Fig. 3 Fig. 3 Supplementary Fig. 3 Fig. 3 + Fig. 3 PELATON directly bound to miR-10b-5p to regulate GATA3 expression We next explored the association between PELATON and miR-10b-5p and found that miR-10b-5p expression decreased after PELATON was overexpressed and increased after PELATON knockdown ( Fig. 4 Fig. 4 Fig. 4 Fig. 4 p Fig. 4 Fig. 4 Binding of MiR-10b-5p to PELATON and GATA3-3′UTR. A qPCR-based analysis was performed of: (a) Expression of miR-10b-5p after PELATON overexpression or knockdown, and (b) Expression of PELATON after miR-10b-5p mimics or inhibitor treatment. (c) Relative luciferase activity of the PELATON WT/MUT and GATA3-3′UTR WT/MUT in the control and miR-10b-5p mimic groups (n = 5). ∗, P P P P Fig. 4 MiR-10b-5p modulated the regulation of Th2 cell activation by PELATON To investigate the role of miR-10b-5p in PELATON-mediated regulation of Th2 cell differentiation, we examined the expression levels of the Th2-specific transcription factor GATA3 and the Th2-associated cytokines (IL-4, IL-5, and IL-13) in PBMCs following miR-10b-5p and PELATON overexpression. When both miR-10b-5p and PELATON were overexpressed, the expression levels of GATA3 and the 3 cytokines were lower than those when PELATON alone was overexpressed; however, the levels were higher than those when miR-10b-5p alone was overexpressed ( Fig. 5 Fig. 5 MiR-10b-5p attenuated the effect of PELATON on Th2 differentiation and activation. (a) Expression of GATA3 in the control group, PELATON overexpression group, miR-10b-5p mimics group, and PELATON and miR-10b-5p co-overexpression group, as detected by qPCR (n = 5). (b, c, d) Expression of IL-4, IL-5, and IL-13 in cell culture supernatants of the control group, PELATON overexpression group, miR-10b-5p mimics group, and PELATON and miR-10b-5p co-overexpression group, as detected by ELISA (n = 3). ∗, P P P Fig. 5 Discussion Th2 cell differentiation plays a crucial role in AR progression, with the ectopic accumulation of Th2 cells in AR leading to the release of Th2 cytokines, such as IL-4, IL-5, and IL-13. 30 31 + 32 33 Previous studies have demonstrated that lncRNAs play a critical role in CD4 + 34 35 , 36 + FR215775 37 38 LncRNAs perform different functions based on their cellular localization. In the cytoplasm, lncRNAs modulate mRNAs by regulating miRNAs. This regulatory network influences diverse biological processes, such as cellular proliferation, differentiation, apoptosis, and activation, ultimately contributing to the development and progression of various diseases. 8 Emerging evidence highlights the pivotal regulatory roles played by miRNAs in AR. For example, miR-135a, miR-124-3p, and miR-182-5p were reported to reduce the instances of nasal rubbing and sneezing in AR mouse models. They also reduced the levels of GATA3 and Th2 inflammatory factors, which are key to restoring the Th1/Th2 imbalance in AR mice. 39 40 41 42 43 44 45 LncRNAs and miRNAs regulate signaling pathways in various cell types and thereby influence the stability of immune cells and the intensity of inflammation. In AR, lncRNAs act as ceRNAs by competitively binding to miRNAs via miRNA response elements, thereby regulating target gene expression. 46 47 48 49 Nevertheless, this study does have certain limitations. The generalizability of our findings is limited by the sample size, and the identified regulatory mechanism must be further verified in larger-scale studies. Transcriptome sequencing revealed that the expression levels of 51 miRNAs and 31 mRNAs were significantly altered following the overexpression of PELATON, indicating the intricate nature of how lncRNAs function. Furthermore, the number of genes potentially regulated by PELATON remains unverified, thereby necessitating further studies to elucidate the network's complexity. Although PELATON was found to regulate specific miRNAs (notably miR-10b-5p), its overall regulatory scope (particularly concerning nuclear functions and unverified target genes) remains uncharacterized. Additional research is warranted to investigate the multifaceted complexity of PELATON. In conclusion, our study demonstrates that lncRNA PELATON promotes Th2 differentiation in patients with AR by upregulating GATA3. Mechanistically, PELATON competes with miR-10b-5p to form a ceRNA network, thereby counteracting miR-10b-5p's suppression of Th2 inflammation. These findings reveal a novel lncRNA-mediated pathway involved in AR pathogenesis and suggest PELATON as a potential biomarker and therapeutic target for AR. While inhibition of PELATON or augmentation of miR-10b-5p represents a potential therapeutic strategy for AR, achieving precisely targeted delivery while avoiding off-target effects remains challenging. Current studies indicate that nanoliposomes or exosomes are biocompatible and have low immunogenicity, 50 51 Abbreviations AR, allergic rhinitis; lnc, lncRNA; GATA3, GATA binding protein 3; miR, microRNA; PBMCs, peripheral blood mononuclear cells; ceRNA, competitive endogenous RNA; UTRs, untranslated regions; SPT, skin prick test; WT, wild-type; MUT, mutant. Consent to participate Informed consent was obtained from all individual participants included in the study. Author contribution Zhen Liu: Yumei Li: Xiangkun Zhao Qi Sun Yu Zhang: Yaqi Wang: Han Fang: Yujuan Yang Yakui Mou: Xicheng Song: Ethics approval This study was approved by the Institution Ethics Committee of Yantai Yuhuangding Hospital (Approval No. No.2021-421). Our experiments were performed in accordance with the Declaration of Helsinki. Availability of data and materials The datasets generated during the current study are available in the GEO repository, GSE252412 https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE252412 Confirmation of unpublished work The manuscript is original, has not been published before, is not currently being considered for publication elsewhere. Declaration of Generative AI and AI-assisted technologies in the writing process Nothing to disclose. Funding This work was supported by National Natural Science Foundation of China，China (82071021, 82301281); Major Scientific and Technological Innovation Project of Shandong Province, China (2022CXGC020506); scholar project of Yantai’s “Double Hundreds Plan, China. Declaration of competing interest The authors have no relevant financial or non-financial interests to disclose. References 1 Bousquet J. Anto J.M. Bachert C. Allergic rhinitis Nat Rev Dis Primers 6 1 2020 95 10.1038/s41572-020-00227-0 33273461 2 Zhang Y. Lan F. Zhang L. Advances and highlights in allergic rhinitis Allergy 76 11 2021 3383 3389 10.1111/all.15044 34379805 3 Orban N.T. Jacobson M.R. Nouri-Aria K.T. Repetitive nasal allergen challenge in allergic rhinitis: priming and Th2-type inflammation but no evidence of remodelling Clin Exp Allergy 51 2 2021 329 338 10.1111/cea.13775 33141493 4 Das A. Ranganathan V. Umar D. Effector/memory CD4 T cells making either Th1 or Th2 cytokines commonly co-express T-bet and GATA-3 PLoS One 12 10 2017 e0185932 10.1371/journal.pone.0185932 PMC5663332 29088218 5 Muehling L.M. Lawrence M.G. Woodfolk J.A. Pathogenic CD4(+) T cells in patients with asthma J Allergy Clin Immunol 140 6 2017 1523 1540 10.1016/j.jaci.2017.02.025 28442213 PMC5651193 6 Su Y. Wu H. Pavlosky A. Regulatory non-coding RNA: new instruments in the orchestration of cell death Cell Death Dis 7 8 2016 e2333 10.1038/cddis.2016.210 PMC5108314 27512954 7 Zhuang J. Shen L. Yang L. TGFbeta1 promotes gemcitabine resistance through regulating the LncRNA-LET/NF90/miR-145 signaling Axis in bladder cancer Theranostics 7 12 2017 3053 3067 10.7150/thno.19542 28839463 PMC5566105 8 Bridges M.C. Daulagala A.C. Kourtidis A. LNCcation: lncRNA localization and function J Cell Biol 220 2 2021 10.1083/jcb.202009045 PMC7816648 33464299 9 Satpathy A.T. Chang H.Y. Long noncoding RNA in hematopoiesis and immunity Immunity 42 5 2015 792 804 10.1016/j.immuni.2015.05.004 25992856 10 Ma Z. Teng Y. Liu X. Identification and functional profiling of differentially expressed long non-coding RNAs in nasal mucosa with allergic rhinitis Tohoku J Exp Med 242 2 2017 143 150 10.1620/tjem.242.143 28626165 11 Yang Y. Wang D. Miao Y.R. lncRNASNP v3: an updated database for functional variants in long non-coding RNAs Nucleic Acids Res 51 D1 2023 D192 D198 10.1093/nar/gkac981 36350671 PMC9825536 12 Sun Z. Dang Q. Liu Z. LINC01272/miR-876/ITGB2 axis facilitates the metastasis of colorectal cancer via epithelial-mesenchymal transition J Cancer 12 13 2021 3909 3919 10.7150/jca.55666 34093798 PMC8176243 13 Ma X. Liu Y. Tian H. LINC01272 suppressed cell multiplication and induced apoptosis via regulating MiR-7-5p/CRLS1 Axis in lung cancer J Microbiol Biotechnol 31 7 2021 921 932 10.4014/jmb.2102.02010 34099597 PMC9705921 14 Hou L. He Q. Wang Y. Nicotine induces macrophage pyroptosis via LINC01272/miR-515/KLF6 axis Ecotoxicol Environ Saf 263 2023 115265 10.1016/j.ecoenv.2023.115265 37478567 15 Wang S. Hou Y. Chen W. KIF9-AS1, LINC01272 and DIO3OS lncRNAs as novel biomarkers for inflammatory bowel disease Mol Med Rep 17 2 2018 2195 2202 10.3892/mmr.2017.8118 29207070 PMC5783463 16 Haberman Y. BenShoshan M. Di Segni A. Long ncRNA landscape in the ileum of treatment-naive early-onset Crohn disease Inflamm Bowel Dis 24 2 2018 346 360 10.1093/ibd/izx013 29361088 PMC6231367 17 Yang Y. Zhang Y. Yang Y. Differential expression of long noncoding RNAs and their function-related mRNAs in the peripheral blood of allergic rhinitis patients Am J Rhinol Allergy 34 4 2020 508 518 10.1177/1945892420912164 32168998 18 Yu J. Zhang X. He R. LINC01234 accelerates the progression of breast cancer via the miR-525-5p/cold shock domain-containing E1 Axis Dis Markers 2022 2022 6899777 10.1155/2022/6899777 PMC9343190 35923244 19 Zhou M. Bian Z. Liu B. Long noncoding RNA MCM3AP-AS1 enhances cell proliferation and metastasis in colorectal cancer by regulating miR-193a-5p/SENP1 Cancer Med 10 7 2021 2470 2481 10.1002/cam4.3830 33686713 PMC7982620 20 Pan X.Y. Wang L. You H.M. Alternative activation of macrophages by prostacyclin synthase ameliorates alcohol induced liver injury Lab Invest 101 9 2021 1210 1224 10.1038/s41374-021-00531-7 34112940 PMC8367821 21 Subspecialty Group of Rhinology EBoCJoOH Neck S. Subspecialty Group of Rhinology SoOH Neck Surgery CMA [Chinese guideline for diagnosis and treatment of allergic rhinitis (2022, revision)] Zhonghua Er Bi Yan Hou Tou Jing Wai Ke Za Zhi 57 2 2022 106 129 10.3760/cma.j.cn115330-20211228-00828 35078291 22 Dai L. Liu J. Zhao Q. Investigation of allergic sensitizations in children with allergic rhinitis and/or asthma Front Pediatr 10 2022 842293 10.3389/fped.2022.842293 PMC8964996 35372139 23 Cheng L. Li H.B. Zhang Y.M. A nationwide survey of otolaryngologists' compliance with Chinese guidelines for diagnosis and treatment of allergic rhinitis World Allergy Organ J 14 6 2021 100552 10.1016/j.waojou.2021.100552 PMC8192728 34178240 24 Chen H. Li J. Cheng L. China consensus document on allergy diagnostics Allergy Asthma Immunol Res 13 2 2021 177 205 10.4168/aair.2021.13.2.177 33474855 PMC7840865 25 Abraham R.T. Weiss A. Jurkat T cells and development of the T-cell receptor signalling paradigm Nat Rev Immunol 4 4 2004 301 308 10.1038/nri1330 15057788 26 Arindrarto W. Borras D.M. de Groen R.A.L. Comprehensive diagnostics of acute myeloid leukemia by whole transcriptome RNA sequencing Leukemia 35 1 2021 47 61 10.1038/s41375-020-0762-8 32127641 PMC7787979 27 Lu Y.Y. Chung F.P. Chen Y.C. Distinctive electrophysiological characteristics of right ventricular out-flow tract cardiomyocytes J Cell Mol Med 18 8 2014 1540 1548 10.1111/jcmm.12329 24913286 PMC4190900 28 Salmena L. Poliseno L. Tay Y. A ceRNA hypothesis: the Rosetta Stone of a hidden RNA language? Cell 146 3 2011 353 358 10.1016/j.cell.2011.07.014 21802130 PMC3235919 29 Wang W. Min L. Qiu X. Biological function of long non-coding RNA (LncRNA) xist Front Cell Dev Biol 9 2021 645647 10.3389/fcell.2021.645647 PMC8222981 34178980 30 Piazza S. Fumagalli M. Martinelli G. Hydrolyzable tannins in the management of Th1, Th2 and Th17 inflammatory-related diseases Molecules 27 21 2022 10.3390/molecules27217593 PMC9655852 36364420 31 Brzustewicz E. Bryl E. The role of cytokines in the pathogenesis of rheumatoid arthritis--Practical and potential application of cytokines as biomarkers and targets of personalized therapy Cytokine 76 2 2015 527 536 10.1016/j.cyto.2015.08.260 26321413 32 Heijink I.H. Nawijn M.C. Hackett T.L. Airway epithelial barrier function regulates the pathogenesis of allergic asthma Clin Exp Allergy 44 5 2014 620 630 10.1111/cea.12296 24612268 33 Nguyen T.V. Piao C.H. Fan Y.J. Artemisia gmelinii extract alleviates allergic airway inflammation via balancing TH1/TH2 homeostasis and inhibiting mast cell degranulation Int J Mol Sci 23 23 2022 10.3390/ijms232315377 PMC9739372 36499702 34 Sun Y. Han J. Ma H. Aberrant expression of long non-coding RNA PVT1 in allergic rhinitis children: correlation with disease risk, symptoms, and Th1/Th2 imbalance J Clin Lab Anal 36 4 2022 e24281 10.1002/jcla.24281 PMC8993613 35274773 35 Wu X. Zhao S. Huang W. Aberrant expressions of circulating lncRNA NEAT1 and microRNA-125a are linked with Th2 cells and symptom severity in pediatric allergic rhinitis J Clin Lab Anal 36 3 2022 e24235 10.1002/jcla.24235 PMC8906029 35064698 36 Li X. Ye S. Lu Y. Long non-coding RNA NEAT1 overexpression associates with increased exacerbation risk, severity, and inflammation, as well as decreased lung function through the interaction with microRNA-124 in asthma J Clin Lab Anal 34 1 2020 e23023 10.1002/jcla.23023 PMC6977114 31876058 37 Ma Y. Shi L. Zhao K. Zheng C. lncRNA FR215775 regulates Th2 differentiation in murine allergic rhinitis J Immunol Res 2022 2022 7783481 10.1155/2022/7783481 PMC9214652 35755169 38 Li Y. Liu Z. Mou Y. LncRNA FAM239A modulates T helper cell responses via tyrosine phosphatase SHP2 in allergic rhinitis Allergol Int 2023 10.1016/j.alit.2022.12.004 36635146 39 Luo Y. Deng Y. Tao Z. Regulatory effect of microRNA-135a on the Th1/Th2 imbalance in a murine model of allergic rhinitis Exp Ther Med 8 4 2014 1105 1110 10.3892/etm.2014.1855 25187805 PMC4151666 40 Wang Z. Song Y. Jiang J. MicroRNA-182-5p attenuates asthmatic airway inflammation by targeting NOX4 Front Immunol 13 2022 853848 10.3389/fimmu.2022.853848 PMC9192947 35711428 41 Zhang S. Dong D. Zhang Y. miR-124-3p relieves allergic rhinitis by inhibiting dipeptidyl peptidase-4 Int Immunopharmacol 101 Pt B 2021 108279 10.1016/j.intimp.2021.108279 34715574 42 Zhang Y. Yang Y. Guo J. miR-146a enhances regulatory T-cell differentiation and function in allergic rhinitis by targeting STAT5b Allergy 77 2 2022 550 558 10.1111/all.15163 34716993 43 Ma Z. Lian H. Lin X. Li Y. LncRNA MIAT promotes allergic inflammation and symptoms by targeting MiR-10b-5p in allergic rhinitis mice Am J Rhinol Allergy 35 6 2021 781 789 10.1177/1945892421998143 34709954 44 Ramanujan S.A. Cravens E.N. Krishfield S.M. Estrogen-induced hsa-miR-10b-5p is elevated in T cells from patients with systemic lupus erythematosus and down-regulates serine/arginine-rich splicing factor 1 Arthritis Rheumatol 73 11 2021 2052 2058 10.1002/art.41787 33982889 PMC8568617 45 Chen L. Al-Mossawi M.H. Ridley A. miR-10b-5p is a novel Th17 regulator present in Th17 cells from ankylosing spondylitis Ann Rheum Dis 76 3 2017 620 625 10.1136/annrheumdis-2016-210175 28039186 46 Yang Y. Sun Q. Guo J. Identification of a lncRNA AC011511.5- mediated competitive endogenous RNA network involved in the pathogenesis of allergic rhinitis Front Genet 13 2022 811679 10.3389/fgene.2022.811679 PMC9194448 35711945 47 Yue L. Yin X. Hao F. Long noncoding RNA Linc00632 inhibits interleukin-13-induced inflammatory cytokine and mucus production in nasal epithelial cells J Innate Immun 12 1 2020 116 128 10.1159/000500420 31315126 PMC6959101 48 Wu X.H. Zhao S.J. Huang W.Q. Long non-coding RNA MALAT1 promotes Th2 differentiation by regulating microRNA-135b-5p/GATA-3 axis in children with allergic rhinitis Kaohsiung J Med Sci 38 10 2022 971 980 10.1002/kjm2.12587 36149748 PMC11896592 49 Chen Z. Ke X. Wang X. LncRNA JPX contributes to Treg/Th17 imbalance in allergic rhinitis via targeting the miR-378g/CCL5 axis Immunopharmacol Immunotoxicol 44 4 2022 519 524 10.1080/08923973.2022.2055566 35387544 50 Sun Y. Ye X. Cai M. Osteoblast-targeting-peptide modified nanoparticle for siRNA/microRNA delivery ACS Nano 10 6 2016 5759 5768 10.1021/acsnano.5b07828 27176123 51 Chen Y. Li Z. Chen X. Zhang S. Long non-coding RNAs: from disease code to drug role Acta Pharm Sin B 11 2 2021 340 354 10.1016/j.apsb.2020.10.001 33643816 PMC7893121 Appendix A Supplementary data The following are the Supplementary data to this article: figs1 figs1 figs2 figs2 figs3 figs3 Multimedia component 1 Multimedia component 1 Multimedia component 2 Multimedia component 2 Multimedia component 3 Multimedia component 3 Multimedia component 4 Multimedia component 4 Multimedia component 5 Multimedia component 5 Multimedia component 6 Multimedia component 6 ☆ Full list of author information is available at the end of the article. Appendix A Supplementary data to this article can be found online at https://doi.org/10.1016/j.waojou.2025.101108 ",
  "metadata": {
    "Title of this paper": "Long non-coding RNAs: from disease code to drug role",
    "Journal it was published in:": "The World Allergy Organization Journal",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490600/"
  }
}