{
  "title": "Paper_903",
  "abstract": "pmc Discov Oncol Discov Oncol 4139 discon Discover Oncology 2730-6011 Springer PMC12474771 PMC12474771.1 12474771 12474771 41003828 10.1007/s12672-025-03557-1 3557 1 Analysis Immunogenic cell death-related macrophage gene model for prognostic prediction in glioblastoma Mao Yiming 1 Li Ting 2 Lu Wenqiang 1 Li Chunhong chunhongli@glmc.edu.cn 3 4 Wu Changjiang fancysuxing@163.com 5 1 https://ror.org/0220qvk04 grid.16821.3c 0000 0004 0368 8293 Department of Thoracic Surgery, Suzhou Kowloon Hospital, Shanghai Jiao Tong University School of Medicine, 2 https://ror.org/0220qvk04 grid.16821.3c 0000 0004 0368 8293 Department of Medical Affairs, Suzhou Kowloon Hospital, Shanghai Jiao Tong University School of Medicine, 3 https://ror.org/000prga03 grid.443385.d 0000 0004 1798 9548 Central Laboratory, The Second Affiliated Hospital of Guilin Medical University, 4 https://ror.org/000prga03 grid.443385.d 0000 0004 1798 9548 Guangxi Health Commission Key Laboratory of Glucose and Lipid Metabolism Disorders, The Second Affiliated Hospital of Guilin Medical University, 5 https://ror.org/0220qvk04 grid.16821.3c 0000 0004 0368 8293 Department of Intensive Care Unit, Suzhou Kowloon Hospital, Shanghai Jiao Tong University School of Medicine, 26 9 2025 12 2025 16 478248 1714 11 7 2025 1 9 2025 26 09 2025 28 09 2025 28 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Glioblastoma (GBM) is an extremely aggressive and diverse type of brain tumor that is associated with a poor prognosis. Immunogenic cell death (ICD) is a particular form of cellular demise that is closely linked to antineoplastic immune responses. However, it is important to note that the function of ICD in GBM is not yet fully understood. Utilizing single-cell analysis, AddModuleScore, and weighted gene co-expression network analyses (WGCNA), ICD-related genes were identified at both the bulk transcriptome and single-cell levels. Based on these newly identified ICD-related genes, a novel signature for GBM was developed employing three machine learning methods: LASSO, XGBoost, and RandomForest. This prognostic model comprises four characteristic genes: G0S2, NEUROD1, SERPINE2, and LZTS1. The overall survival was significantly lower for the high-risk group compared to the low-risk group in the TCGA-GBM cohort ( P P P P Supplementary Information The online version contains supplementary material available at 10.1007/s12672-025-03557-1. Keywords Glioblastoma Immunogenic cell death Macrophage Tumor microenvironment Immunotherapy the New Clinical Diagnosis and Treatment Technologies of Suzhou SKYD2023032 Mao Yiming pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Science+Business Media LLC, part of Springer Nature 2025 Introduction Glioblastoma (GBM), known as the most aggressive type of primary brain cancer in adults, is distinguished by its rapid progression, high invasiveness, and poor prognosis [ 1 2 3 Immunogenic cell death (ICD) represents a specialized form of programmed cell death that plays a crucial role in prompting the body’s immune responses against tumors. This process is characterized by the release of damage-associated molecular patterns (DAMPs) and tumor antigens, which serve as signals to the immune system. By facilitating the recognition of dying tumor cells, ICD acts as an essential connector between the elimination of cancerous cells and the subsequent activation of anti-tumor immunity. As a result, understanding ICD is vital for advancing cancer therapies that aim to harness and enhance the immune system’s ability to combat tumors effectively [ 4 5 6 Machine learning algorithms and WGCNA have facilitated the identification of robust gene modules and prognostic biomarkers in cancer research [ 7 8 9 Materials and methods Bulk RNA sequencing data collection and processing The RNA-seq data from the TCGA-GBM cohort included samples from 168 patients and 5 normal tissues, with the associated clinical information sourced from TCGA database [ 10 11 12 Single‑cell rna‑seq analysis data collection and processing Single-cell RNA sequencing data from seventeen GBM patients was analyzed using the GSE235913 13 14 15 WGCNA analysis WGCNA analysis explored genes and modules associated with GBM patients. The “goodSamplesGenes” function filtered genes and samples, enabling secondary clustering and eliminating outliers. The “pickSoft” function transformed the correlation matrix into a neighbor-joining matrix to determine the soft threshold (β). A topological overlap matrix (TOM) and hierarchical clustering tree identified modules. Highly correlated modules significant to the study were evaluated through gene significance (GS) and module membership (MM) correlations, allowing extraction of relevant genes for further analysis. A Venn plot created using the “VennDiagram” R package illustrated common macrophage-related genes between the MEturquoise module and differentially expressed genes (DEGs). Univariate Cox regression analysis identified genes significantly linked to GBM prognosis, providing insights into biological mechanisms and therapeutic targets. Identification of hub genes by machine learning and model construction The common genes were analyzed using the LASSO logistic regression algorithm, implemented with the assistance of the “glmnet” package in R, to identify potential hub genes. A 10-fold cross-validation approach was employed to select the regularization parameter (λ), with “lambda.min” designated as the optimal λ value. Path diagrams alongside cross-validation curves were utilized to illustrate the regression coefficients. For hub gene screening, the random forest algorithm was applied using the “randomForest” package in R. Moreover, an XGBoost model was constructed through the “XGBoost” package in R software. The analysis focused on the intersection of key module genes identified by LASSO, XGBoost, and RandomForest to uncover the shared prognostic DEGs. To visualize the findings, a Venn diagram was created using the “VennDiagram” package in R software. A multivariate Cox analysis was done to find the most reliable features that can predict outcomes. The riskScore for each patient was calculated using this formula: riskScore = coefficient (gene 1) × expression (gene 1) + coefficient (gene 2) × expression (gene 2) + ⋯ + coefficient (gene n) × expression (gene n). To assess the prognostic risk model, survival curves across groups were compared using the Kaplan-Meier (KM) method and log-rank test within the TCGA-GBM, CGGA693, CGGA325, and CGGA301 cohorts. Following this, a nomogram was developed incorporating the risk score along with clinical factors such as age and gender specifically for the TCGA-GBM cohort. This nomogram aimed to tailor the survival probabilities for overall survival (OS) at 1, 3, and 5 years, utilizing the “rms” package in R. The predictive accuracy of the nomogram model was then evaluated through graphical assessment of calibration curves. Ultimately, the decision curve analysis (DCA) was employed to assess the clinical benefit for GBM patients. Construction and evaluation prognostic factors We conducted an analysis to compare gene expression variations among high-risk and low-risk groups across the TCGA-GBM, CGGA693, CGGA325, and CGGA301 cohorts. For this purpose, we employed the R package “pheatmap” to generate heatmaps illustrating the risk scores’ distribution, alongside clinically annotated information. To perform Kaplan-Meier survival analysis and Cox model testing, we utilized the R packages “Survival” and survminer, which also helped in visualizing the log-rank test results. In addition, we carried out both univariate and multivariate Cox regression analyses to assess the prognostic value of the risk score model, taking into account variables such as gender, age, and risk score. To conduct receiver operating characteristic (ROC) analyses, we applied the “timeROC” R package. The resultant ROC curves depict the nomogram’s predictive accuracy for overall survival (OS) at 1, 3, and 5 years across the four studied cohorts. We evaluated a range of clinical factors, such as age, gender, and risk score. GO and KEGG enrichment and pathway analyses The R package “clusterProfiler” performed gene set enrichment analysis (GSEA) to determine statistically significant differences in gene expression levels under specific conditions. A functional enrichment analysis using Gene Ontology (GO) and Kyoto Encyclopedia of Genes and Genomes (KEGG) examined the biological processes, functions, and pathways associated with these genes. Immunogenomic landscape analysis To evaluate the patterns of infiltration by immune and stromal cells, we performed an immunoscape analysis using the “IOBR” R package [ 16 17 18 19 20 21 22 23 24 25 Comparisons of chemotherapeutic drug sensitivity Significant differences were determined by analyzing the sensitivities to chemotherapy medications among different groups. Drug-sensitivity prediction was conducted using oncoPredict [ 26 Characterization of immunotherapy efficacy The Cancer Immunome Atlas (TCIA, https://tcia.at/ 21 http://tide.dfci.harvard.edu/ 27 28 29 Statistical analysis Tasks involving data analysis and visualization were executed utilizing version 4.3.2 of R statistical software. This software provides a wide range of tools and packages for such tasks. A p-value under 0.05 was considered to signify statistical significance. Results Single-cell analysis of cell types and Immunogenic cell death score in single cell atlas To explore the cellular composition and immune landscape in GBM patients, we conducted tSNE clustering analysis and cell type identification on 12 cells (Fig. 1 1 1 1  Fig. 1 Single-cell analysis of cell types and immunogenic cell death score in single cell atlas. A B C D E F WGCNA analysis and module genes identification To delve deeper into the molecular mechanisms related to macrophage-associated immunogenic cell death in GBM patients, we employed WGCNA to pinpoint crucial gene modules linked to macrophage activity (Fig. 2 p 2 2 2  Fig. 2 Weighted gene co-expression network analysis and module genes identification. A B C D E F G H Identification of core genes and construction of a prognostic nomogram We employed the LASSO regression model, XGBoost model, and RandomForest model to identify key genes (Fig. 3 3 P P P P 3 3 3 S1 P P  Fig. 3 Identification of core genes and construction of a prognostic nomogram. A B C D E F G H I J K L M O Validation of the prognostic nomogram for OS prediction To assess the predictive accuracy of prognostic model for 1-, 3-, and 5-year OS, ROC curves were generated for four cohorts: TCGA-GBM, CGGA693, CGGA325, and CGGA301. The area under the curve (AUC) was computed, revealing that the prognostic model demonstrated excellent accuracy in predicting 1-year, 3-year, and 5-year survival outcomes for GBM patients (Fig. 4 S1 4 4 4 4 p P P  Fig. 4 Validation of the prognostic nomogram for OS prediction. A B C D E H I J K L M P GO and KEGG enrichment and pathway analyses To elucidate the biological functions and signaling pathways associated with the gene model, we performed gene ontology (GO) and Kyoto encyclopedia of genes and genomes (KEGG) enrichment analyses on high- and low-risk groups (Figure S3A, B). The GO and KEGG enrichment analyses demonstrated that high-risk samples were significantly enriched in external encapsulating structure organization, collagen fibril organization, collagen metabolic process, epithelial mesenchymal transition, inflammatory response, and II6 Jak stat3 signaling (Figure S3C, D). In contrast, low-risk score groups were predominantly associated with nucleosome assembly, Spliceosomal Tri Snrnp complex assembly, protein DNA complex assembly, E2f targets, MYC targets V1, and G2m checkpoint (Figure S3E, F). These findings suggest indicate that the riskscore reflects distinct immune and metabolic states in GBM patients, providing mechanistic insights into its prognostic value. Identification of the immune landscape Our analysis revealed that the stromal score and ESTIMATE score of GBM samples in the low-risk group were significantly lower than those in the high-risk group. Conversely, the tumor purity of GBM samples in the low-risk cluster was significantly higher than that in the high-risk group (Fig. 5 5 5  Fig. 5 Identification of the immune landscape. A D E F G H I J K Immunotherapy efficacy Initially, we conducted a comparative analysis of TIDE scores, T cell dysfunction scores, T cell rejection scores, and micro cell instability analyses between the high- and low-risk groups to assess their potential in predicting responses to immunotherapy (Fig. 6 6 6 6 6 6  Fig. 6 Immunotherapy efficacy. A D E H I J K L Chemotherapeutic sensitivity prediction Recognizing chemotherapy as a principal modality in tumor treatment, we investigated the association between riskscores and clinical responses to chemotherapeutic agents by calculating the IC50. We assessed the differential responses to commonly utilized chemotherapy agents between high-risk and low-risk groups (Fig. 7 7 7  Fig. 7 Chemotherapeutic sensitivity prediction. A B C E F D G Discussion Our study presents a prognostic model comprising four genes (G0S2, NEUROD1, SERPINE2, LZTS1) that integrates cell-type specificity, gene co-expression networks, and machine learning to predict survival outcomes in GBM patients. The model is grounded in single-cell RNA sequencing data, which identified macrophages as the predominant cell type associated with immunogenic cell death scores, surpassing other immune and stromal cell populations. This observation is consistent with emerging evidence that macrophages serve as crucial intermediaries in ICD [ 30 31 7 32 33 The WGCNA analysis identified the turquoise module as the one most strongly correlated with macrophage signatures, thereby underscoring its significance in macrophage-driven immunogenic cell death pathways [ 34 35 36 G0S2 inhibits ATGL-dependent lipolysis and is a transcriptional target of retinoic acid signaling [ 37 38 39 40 The functional enrichment of high-risk group within immune response pathways highlights the model’s association with active immunogenic cell death and pro-inflammatory macrophage states [ 41 42 TME profiling has demonstrated that patients classified as high-risk exhibit elevated stromal and immune scores alongside reduced tumor purity, indicative of a densely infiltrated, macrophage-rich microenvironment. Subsequent ssGSEA analysis revealed increased infiltration of M1-like macrophages and dendritic cells within high-risk groups, contrasted with a rise in regulatory T cells (Tregs) and myeloid-derived suppressor cells (MDSCs)—a paradoxical pattern characteristic of “inflammatory but immunosuppressive” tumors [ 43 Analyses of the immune landscape have demonstrated that patients classified as high-risk exhibit elevated exclusion scores, which are indicative of a poor response to immune checkpoint therapy. In contrast, low-risk groups display reduced checkpoint expression. This observation is consistent with preclinical studies indicating that tumor microenvironments rich in macrophages frequently present exhausted T-cell states and resistance to anti-PD-1/L1 therapy [ 44 45 46 The nomogram, which integrates riskscore, age, and gender, offers personalized predictions for 1-, 3-, and 5-year survival rates. Calibration curves indicate a near-perfect concordance between predicted and observed outcomes. This tool addresses a significant unmet need in GBM, as existing clinical nomograms lack molecular specificity. The model’s robustness across the TCGA and CGGA datasets—encompassing diverse ethnic and genomic backgrounds—supports its generalizability, although validation through clinical trials remains essential. Drug sensitivity analysis revealed distinct responses to chemotherapy, with low-risk patients exhibiting greater sensitivity to standard-of-care agents such as temozolomide (IC50: high-risk > low-risk). This increased sensitivity is likely attributable to their enhanced metabolic pathways, which facilitate drug uptake or DNA damage response. In contrast, high-risk patients demonstrated a more favorable response to EPK 2440 (a PARP inhibitor) and BMS-536924 (a farnesyltransferase inhibitor), indicating the potential for targeted therapies in ICD-activated, ECM-modulated tumors [ 47 48 Limitations While our study contributes to the understanding of ICD-macrophage biology in GBM, several limitations require consideration: (1) the model is limited to protein-coding genes, thereby excluding non-coding RNAs that play a role in regulating macrophage polarization and ICD. (2) Owing to inadequate research funding, this study is unable to facilitate the research team in performing in vitro or in vivo experiments on the core genes within the model to elucidate the molecular mechanisms by which these core genes contribute to glioblastoma carcinogenesis. (3) The absence of adequate multi-center, large-scale glioma clinical cohort samples for cross-validation. (4) In the analysis of gender stratification, this prognostic model is unable to differentiate survival outcomes for females, potentially due to gender bias. Sex hormones may influence macrophage polarization, thereby affecting ICD pathway activation and model gene expression. Incorporating sex-specific transcriptomic data could enhance the model’s clinical applicability. (5) Ethical considerations are indispensable when translating this prognostic model into clinical practice. Future research will explore four complementary avenues of investigation. (1) Experimental validation: We will employ CRISPR-KO and pharmacological inhibition in patient-derived GBM organoids to verify the causal roles of G0S2, NEUROD1, SERPINE2, and LZTS1 in modulating immune infiltration and drug sensitivity. (2) Radiogenomics integration: We are collecting paired pre-operative MRI and RNA-seq data from newly diagnosed patients to construct a multimodal model that integrates radiomic features with our transcriptomic risk score, with the aim of predicting spatial heterogeneity of drug response in vivo. (3) Sex-stratified trials: Based on the observed male-specific prognostic effects, we will conduct an in-depth study on the gender stratification mechanism. (4) Real-world deployment: We will incorporate the nomogram within the hospital system and conduct a prospective registry study to monitor long-term clinical outcomes, model drift, and cost-effectiveness under routine-care conditions. Conclusion By elucidating the interaction between ICD and macrophage biology, this study establishes a robust prognostic model that surpasses traditional clinical parameters, providing insights into tumor microenvironment immunity and therapeutic vulnerabilities in GBM. The four-gene signature not only forecasts survival outcomes but also identifies actionable pathways—ranging from macrophage polarization to extracellular matrix remodeling—for targeted therapeutic interventions. As precision oncology advances towards multi-omics integration, such models are essential tools for customizing treatments to individual tumor-immune profiles. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Yiming Mao and Ting Li contributed equally to this work. Acknowledgements We thank Dr.Jianming Zeng (University of Macau), and all the members of his bioinformatics team, biotrainee, for generously sharing their experience and codes. Author contributions Li CH, Mao YM, and Wu CJ designed the study and supervised the completion, Mao YM, Li CH, Li T, Lu WQ and Wu CJ contributed to data collection and analysis, Mao YM, Li T, and Li CH, wrote the manuscript, Li CH, Mao YM, and Wu CJ reviewed the background and edited the manuscript. All the authors approved the final version of the manuscript. Funding This work was supported by the New Clinical Diagnosis and Treatment Technologies of Suzhou (SKYD2023032). Data availability The results shown here are in part based upon data generated by the TCGA Research Network: https:// www. cancer. gov/ tcga, the CGGA databases: https://www.cgga.org.cn/, UCSC XENA: https://xenabrowser.net/ and the GEO databases: https://www.ncbi.nlm.nih.gov/geo/. All the datasets could be downloaded directly from the indicated websites. The datasets used and analyzed during the current study are available from the corresponding author upon reasonable request. Declarations Ethics approval and consent to participate Not applicable. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Salvalaggio A Pini L Bertoldo A Glioblastoma and brain connectivity: the need for a paradigm shift Lancet Neurol 2024 23 7 740 8 10.1016/S1474-4422(24)00160-1 38876751 Salvalaggio A, Pini L, Bertoldo A, et al. Glioblastoma and brain connectivity: the need for a paradigm shift. Lancet Neurol. 2024;23(7):740–8. 38876751 10.1016/S1474-4422(24)00160-1 2. Le Rhun E Preusser M Roth P Molecular targeted therapy of glioblastoma Cancer Treat Rev 2019 80 101896 10.1016/j.ctrv.2019.101896 31541850 Le Rhun E, Preusser M, Roth P, et al. Molecular targeted therapy of glioblastoma. Cancer Treat Rev. 2019;80:101896. 31541850 10.1016/j.ctrv.2019.101896 3. Schaff LR Mellinghoff IK Glioblastoma and other primary brain malignancies in adults: a review JAMA 2023 329 7 574 87 10.1001/jama.2023.0023 36809318 PMC11445779 Schaff LR, Mellinghoff IK. Glioblastoma and other primary brain malignancies in adults: a review. JAMA. 2023;329(7):574–87. 36809318 10.1001/jama.2023.0023 PMC11445779 4. Galluzzi L Guilbaud E Schmidt D Targeting Immunogenic cell stress and death for cancer therapy Nat Rev Drug Discovery 2024 23 6 445 60 10.1038/s41573-024-00920-9 38622310 PMC11153000 Galluzzi L, Guilbaud E, Schmidt D, et al. Targeting Immunogenic cell stress and death for cancer therapy. Nat Rev Drug Discovery. 2024;23(6):445–60. 38622310 10.1038/s41573-024-00920-9 PMC11153000 5. Ren J, Xu B, Ren J et al. The importance of M1-and M2-Polarized macrophages in glioma and as potential treatment targets. Brain Sci 2023;13(9). 10.3390/brainsci13091269 PMC10526262 37759870 6. Xu X Zhang Y Liao C Impact of ferroptosis-related risk genes on macrophage M1/M2 polarization and prognosis in glioblastoma Front Cell Neurosci 2023 17 1294029 10.3389/fncel.2023.1294029 38283752 PMC10817728 Xu X, Zhang Y, Liao C, et al. Impact of ferroptosis-related risk genes on macrophage M1/M2 polarization and prognosis in glioblastoma. Front Cell Neurosci. 2023;17:1294029. 38283752 10.3389/fncel.2023.1294029 PMC10817728 7. Zhong W Xiong K Li S Macrophage polarization-related gene signature for risk stratification and prognosis of survival in gliomas J Cell Mol Med 2024 28 20 e70000 10.1111/jcmm.70000 39448550 PMC11502305 Zhong W, Xiong K, Li S, et al. Macrophage polarization-related gene signature for risk stratification and prognosis of survival in gliomas. J Cell Mol Med. 2024;28(20):e70000. 39448550 10.1111/jcmm.70000 PMC11502305 8. Gjorgjevski M, Hannen R, Carl B et al. Molecular profiling of the tumor microenvironment in glioblastoma patients: correlation of microglia/macrophage polarization state with metalloprotease expression profiles and survival. Biosci Rep 2019;39(6). 10.1042/BSR20182361 PMC6616040 31142630 9. Wei Y Zhou K Wang C Exosomal miR-142-3p from M1-polarized macrophages suppresses cell growth and immune escape in glioblastoma through regulating HMGB1-mediated PD-1/PD-L1 checkpoint J Neurochem 2025 169 1 e16224 10.1111/jnc.16224 39289038 Wei Y, Zhou K, Wang C, et al. Exosomal miR-142-3p from M1-polarized macrophages suppresses cell growth and immune escape in glioblastoma through regulating HMGB1-mediated PD-1/PD-L1 checkpoint. J Neurochem. 2025;169(1):e16224. 39289038 10.1111/jnc.16224 10. Wang Z Jensen MA Zenklusen JC A practical guide to The Cancer Genome Atlas (TCGA) Methods Mol Biol (Clifton, NJ) 2016 1418 111 141 10.1007/978-1-4939-3578-9_6 27008012 Wang Z, Jensen MA, Zenklusen JC. A practical guide to The Cancer Genome Atlas (TCGA). Methods Mol Biol (Clifton, NJ). 2016;1418:111–141. 10.1007/978-1-4939-3578-9_6 27008012 11. Zhao Z Zhang KN Wang Q Chinese glioma genome atlas (CGGA): a comprehensive resource with functional genomic data from Chinese glioma patients Genom Proteom Bioinform 2021 19 1 1 12 10.1016/j.gpb.2020.10.005 PMC8498921 33662628 Zhao Z, Zhang KN, Wang Q, et al. Chinese glioma genome atlas (CGGA): a comprehensive resource with functional genomic data from Chinese glioma patients. Genom Proteom Bioinform. 2021;19(1):1–12. 10.1016/j.gpb.2020.10.005 PMC8498921 33662628 12. Liu J Shi Y Zhang Y Multi-omics identification of an Immunogenic cell death-related signature for clear cell renal cell carcinoma in the context of 3P medicine and based on a 101-combination machine learning computational framework EPMA J 2023 14 2 275 305 10.1007/s13167-023-00327-3 37275552 PMC10236109 Liu J, Shi Y, Zhang Y. Multi-omics identification of an Immunogenic cell death-related signature for clear cell renal cell carcinoma in the context of 3P medicine and based on a 101-combination machine learning computational framework. EPMA J. 2023;14(2):275–305. 37275552 10.1007/s13167-023-00327-3 PMC10236109 13. Mei Y Wang X Zhang J Siglec-9 acts as an immune-checkpoint molecule on macrophages in glioblastoma, restricting T-cell priming and immunotherapy response Nat Cancer 2023 4 9 1273 91 10.1038/s43018-023-00598-9 37460871 Mei Y, Wang X, Zhang J, et al. Siglec-9 acts as an immune-checkpoint molecule on macrophages in glioblastoma, restricting T-cell priming and immunotherapy response. Nat Cancer. 2023;4(9):1273–91. 37460871 10.1038/s43018-023-00598-9 14. Stuart T Butler A Hoffman P Comprehensive integration of Single-Cell data Cell 2019 177 7 1888 e19021821 10.1016/j.cell.2019.05.031 31178118 PMC6687398 Stuart T, Butler A, Hoffman P, et al. Comprehensive integration of Single-Cell data. Cell. 2019;177(7):1888–e19021821. 31178118 10.1016/j.cell.2019.05.031 PMC6687398 15. Aran D Looney AP Liu L Reference-based analysis of lung single-cell sequencing reveals a transitional profibrotic macrophage Nat Immunol 2019 20 2 163 72 10.1038/s41590-018-0276-y 30643263 PMC6340744 Aran D, Looney AP, Liu L, et al. Reference-based analysis of lung single-cell sequencing reveals a transitional profibrotic macrophage. Nat Immunol. 2019;20(2):163–72. 30643263 10.1038/s41590-018-0276-y PMC6340744 16. Zeng D Ye Z Shen R IOBR: Multi-Omics Immuno-Oncology biological research to Decode tumor microenvironment and signatures Front Immunol 2021 12 687975 10.3389/fimmu.2021.687975 34276676 PMC8283787 Zeng D, Ye Z, Shen R, et al. IOBR: Multi-Omics Immuno-Oncology biological research to Decode tumor microenvironment and signatures. Front Immunol. 2021;12:687975. 34276676 10.3389/fimmu.2021.687975 PMC8283787 17. Becht E Giraldo NA Lacroix L Erratum to: Estimating the population abundance of tissue-infiltrating immune and stromal cell populations using gene expression Genome Biol 2016 17 1 249 10.1186/s13059-016-1113-y 27908289 PMC5134277 Becht E, Giraldo NA, Lacroix L, et al. Erratum to: Estimating the population abundance of tissue-infiltrating immune and stromal cell populations using gene expression. Genome Biol. 2016;17(1):249. 27908289 10.1186/s13059-016-1113-y PMC5134277 18. Racle J, de Jonge K, Baumgaertner P et al. Simultaneous enumeration of cancer and immune cell types from bulk tumor gene expression data. eLife 2017;6. 10.7554/eLife.26476 PMC5718706 29130882 19. Aran D Hu Z Butte AJ xCell: digitally portraying the tissue cellular heterogeneity landscape Genome Biol 2017 18 1 220 10.1186/s13059-017-1349-1 29141660 PMC5688663 Aran D, Hu Z, Butte AJ. xCell: digitally portraying the tissue cellular heterogeneity landscape. Genome Biol. 2017;18(1):220. 29141660 10.1186/s13059-017-1349-1 PMC5688663 20. Newman AM Liu CL Green MR Robust enumeration of cell subsets from tissue expression profiles Nat Methods 2015 12 5 453 7 10.1038/nmeth.3337 25822800 PMC4739640 Newman AM, Liu CL, Green MR, et al. Robust enumeration of cell subsets from tissue expression profiles. Nat Methods. 2015;12(5):453–7. 25822800 10.1038/nmeth.3337 PMC4739640 21. Charoentong P Finotello F Angelova M Pan-cancer Immunogenomic analyses reveal Genotype-Immunophenotype relationships and predictors of response to checkpoint Blockade Cell Rep 2017 18 1 248 62 10.1016/j.celrep.2016.12.019 28052254 Charoentong P, Finotello F, Angelova M, et al. Pan-cancer Immunogenomic analyses reveal Genotype-Immunophenotype relationships and predictors of response to checkpoint Blockade. Cell Rep. 2017;18(1):248–62. 28052254 10.1016/j.celrep.2016.12.019 22. Finotello F Mayer C Plattner C Molecular and Pharmacological modulators of the tumor immune contexture revealed by Deconvolution of RNA-seq data Genome Med 2019 11 1 34 10.1186/s13073-019-0638-6 31126321 PMC6534875 Finotello F, Mayer C, Plattner C, et al. Molecular and Pharmacological modulators of the tumor immune contexture revealed by Deconvolution of RNA-seq data. Genome Med. 2019;11(1):34. 31126321 10.1186/s13073-019-0638-6 PMC6534875 23. Yoshihara K Shahmoradgoli M Martínez E Inferring tumour purity and stromal and immune cell admixture from expression data Nat Commun 2013 4 2612 10.1038/ncomms3612 24113773 PMC3826632 Yoshihara K, Shahmoradgoli M, Martínez E, et al. Inferring tumour purity and stromal and immune cell admixture from expression data. Nat Commun. 2013;4:2612. 24113773 10.1038/ncomms3612 PMC3826632 24. Li B Severson E Pignon JC Comprehensive analyses of tumor immunity: implications for cancer immunotherapy Genome Biol 2016 17 1 174 10.1186/s13059-016-1028-7 27549193 PMC4993001 Li B, Severson E, Pignon JC, et al. Comprehensive analyses of tumor immunity: implications for cancer immunotherapy. Genome Biol. 2016;17(1):174. 27549193 10.1186/s13059-016-1028-7 PMC4993001 25. Barbie DA Tamayo P Boehm JS Systematic RNA interference reveals that oncogenic KRAS-driven cancers require TBK1 Nature 2009 462 7269 108 12 10.1038/nature08460 19847166 PMC2783335 Barbie DA, Tamayo P, Boehm JS, et al. Systematic RNA interference reveals that oncogenic KRAS-driven cancers require TBK1. Nature. 2009;462(7269):108–12. 19847166 10.1038/nature08460 PMC2783335 26. Maeser D, Gruener RF, Huang RSJB. OncoPredict: an R package for predicting in vivo or cancer patient drug response and biomarkers from cell line screening data. 2021; 22(6):bbab260. 10.1093/bib/bbab260 PMC8574972 34260682 27. Jiang P, Gu S, Pan D et al. Signatures of T cell dysfunction and exclusion predict cancer immunotherapy response. 2018;24(10):1550–8. 10.1038/s41591-018-0136-1 PMC6487502 30127393 28. Mariathasan S, Turley SJ, Nickles D et al. TGFβ attenuates tumour response to PD-L1 Blockade by contributing to exclusion of T cells. 2018;554(7693):544–8. 10.1038/nature25501 PMC6028240 29443960 29. Rosenberg JE, Hoffman-Censits J, Powles T et al. Atezolizumab in patients with locally advanced and metastatic urothelial carcinoma who have progressed following treatment with platinum-based chemotherapy: a single-arm, multicentre, phase 2 trial. 2016;387(10031):1909–20. 10.1016/S0140-6736(16)00561-4 PMC5480242 26952546 30. Montemurro N Pahwa B Tayal A Macrophages in recurrent glioblastoma as a prognostic factor in the synergistic system of the tumor microenvironment Neurol Int 2023 15 2 595 608 10.3390/neurolint15020037 37218976 PMC10204554 Montemurro N, Pahwa B, Tayal A, et al. Macrophages in recurrent glioblastoma as a prognostic factor in the synergistic system of the tumor microenvironment. Neurol Int. 2023;15(2):595–608. 37218976 10.3390/neurolint15020037 PMC10204554 31. Wu M, Shi Y, Zhu L et al. Macrophages in glioblastoma development and therapy: a double-edged sword. Life (Basel, Switzerland) 2022;12(8). 10.3390/life12081225 PMC9409650 36013403 32. Zong CC Single-cell RNA-seq study determines the ontogeny of macrophages in glioblastomas Genome Biol 2017 18 1 235 10.1186/s13059-017-1375-z 29262851 PMC5738720 Zong CC. Single-cell RNA-seq study determines the ontogeny of macrophages in glioblastomas. Genome Biol. 2017;18(1):235. 29262851 10.1186/s13059-017-1375-z PMC5738720 33. Vidyarthi A Agnihotri T Khan N Predominance of M2 macrophages in gliomas leads to the suppression of local and systemic immunity Cancer Immunol Immunotherapy: CII 2019 68 12 1995 2004 10.1007/s00262-019-02423-8 PMC11028103 31690954 Vidyarthi A, Agnihotri T, Khan N, et al. Predominance of M2 macrophages in gliomas leads to the suppression of local and systemic immunity. Cancer Immunol Immunotherapy: CII. 2019;68(12):1995–2004. 10.1007/s00262-019-02423-8 PMC11028103 31690954 34. Li C Pu B Gu L Identification of key modules and hub genes in glioblastoma multiforme based on co-expression network analysis FEBS Open Bio 2021 11 3 833 50 10.1002/2211-5463.13078 33423377 PMC7931238 Li C, Pu B, Gu L, et al. Identification of key modules and hub genes in glioblastoma multiforme based on co-expression network analysis. FEBS Open Bio. 2021;11(3):833–50. 33423377 10.1002/2211-5463.13078 PMC7931238 35. Cardona-Acevedo S, Londoño CW, Quiroz Fabra J et al. esearch trends on the role of big data in artificial intelligence: a bibliometric analysis. In: Al-Emran M, Shaalan K, editors. Recent innovations in artificial intelligence and smart applications. Cham: Springer International Publishing;2022. p.121–134. 36. Cardona-Acevedo S Agudelo-Ceballos E Arango-Botero D Applications of machine learning (ML) in the context of marketing: a bibliometric approach F1000Research 2025 14 92 10.12688/f1000research.160010.2 40125521 PMC11926528 Cardona-Acevedo S, Agudelo-Ceballos E, Arango-Botero D, et al. Applications of machine learning (ML) in the context of marketing: a bibliometric approach. F1000Research. 2025;14:92. 40125521 10.12688/f1000research.160010.2 PMC11926528 37. Heckmann BL Zhang X Xie X The G0/G1 switch gene 2 (G0S2): regulating metabolism and beyond Biochim Biophys Acta 2013 1831 2 276 81 10.1016/j.bbalip.2012.09.016 23032787 PMC3698047 Heckmann BL, Zhang X, Xie X, et al. The G0/G1 switch gene 2 (G0S2): regulating metabolism and beyond. Biochim Biophys Acta. 2013;1831(2):276–81. 23032787 10.1016/j.bbalip.2012.09.016 PMC3698047 38. Yim CY Bikorimana E Khan E G0S2 represses PI3K/mTOR signaling and increases sensitivity to PI3K/mTOR pathway inhibitors in breast cancer Cell Cycle (Georgetown Tex) 2017 16 21 2146 55 10.1080/15384101.2017.1371884 28910567 PMC5731418 Yim CY, Bikorimana E, Khan E, et al. G0S2 represses PI3K/mTOR signaling and increases sensitivity to PI3K/mTOR pathway inhibitors in breast cancer. Cell Cycle (Georgetown Tex). 2017;16(21):2146–55. 28910567 10.1080/15384101.2017.1371884 PMC5731418 39. Zhang J Wu Q Zhu L SERPINE2/PN-1 regulates the DNA damage response and radioresistance by activating ATM in lung cancer Cancer Lett 2022 524 268 83 10.1016/j.canlet.2021.10.001 34648881 Zhang J, Wu Q, Zhu L, et al. SERPINE2/PN-1 regulates the DNA damage response and radioresistance by activating ATM in lung cancer. Cancer Lett. 2022;524:268–83. 34648881 10.1016/j.canlet.2021.10.001 40. Pavlinkova G Smolik O NEUROD1: transcriptional and epigenetic regulator of human and mouse neuronal and endocrine cell lineage programs Front Cell Dev Biol 2024 12 1435546 10.3389/fcell.2024.1435546 39105169 PMC11298428 Pavlinkova G, Smolik O. NEUROD1: transcriptional and epigenetic regulator of human and mouse neuronal and endocrine cell lineage programs. Front Cell Dev Biol. 2024;12:1435546. 39105169 10.3389/fcell.2024.1435546 PMC11298428 41. Kvisten M Mikkelsen VE Stensjøen AL Microglia and macrophages in human glioblastomas: A morphological and immunohistochemical study Mol Clin Oncol 2019 11 1 31 6 31289674 10.3892/mco.2019.1856 PMC6535640 Kvisten M, Mikkelsen VE, Stensjøen AL, et al. Microglia and macrophages in human glioblastomas: A morphological and immunohistochemical study. Mol Clin Oncol. 2019;11(1):31–6. 31289674 10.3892/mco.2019.1856 PMC6535640 42. Loginova N Aniskin D Timashev P GBM immunotherapy: macrophage impacts Immunol Investig 2024 53 5 730 51 10.1080/08820139.2024.2337022 38634572 Loginova N, Aniskin D, Timashev P, et al. GBM immunotherapy: macrophage impacts. Immunol Investig. 2024;53(5):730–51. 38634572 10.1080/08820139.2024.2337022 43. Pombo Antunes AR Scheyltjens I Lodi F Single-cell profiling of myeloid cells in glioblastoma across species and disease stage reveals macrophage competition and specialization Nat Neurosci 2021 24 4 595 610 10.1038/s41593-020-00789-y 33782623 Pombo Antunes AR, Scheyltjens I, Lodi F, et al. Single-cell profiling of myeloid cells in glioblastoma across species and disease stage reveals macrophage competition and specialization. Nat Neurosci. 2021;24(4):595–610. 33782623 10.1038/s41593-020-00789-y 44. Chen AX Gartrell RD Zhao J Single-cell characterization of macrophages in glioblastoma reveals MARCO as a mesenchymal pro-tumor marker Genome Med 2021 13 1 88 10.1186/s13073-021-00906-x 34011400 PMC8136167 Chen AX, Gartrell RD, Zhao J, et al. Single-cell characterization of macrophages in glioblastoma reveals MARCO as a mesenchymal pro-tumor marker. Genome Med. 2021;13(1):88. 34011400 10.1186/s13073-021-00906-x PMC8136167 45. Pereira MB Barros LRC Bracco PA Transcriptional characterization of immunological infiltrates and their relation with glioblastoma patients overall survival Oncoimmunology 2018 7 6 e1431083 10.1080/2162402X.2018.1431083 29872555 PMC5980418 Pereira MB, Barros LRC, Bracco PA, et al. Transcriptional characterization of immunological infiltrates and their relation with glioblastoma patients overall survival. Oncoimmunology. 2018;7(6):e1431083. 29872555 10.1080/2162402X.2018.1431083 PMC5980418 46. Zhou Q Xue C Man J Correlation of tumor-associated macrophage infiltration in glioblastoma with magnetic resonance imaging characteristics: a retrospective cross-sectional study Quant Imaging Med Surg 2023 13 9 5958 73 10.21037/qims-23-126 37711787 PMC10498259 Zhou Q, Xue C, Man J, et al. Correlation of tumor-associated macrophage infiltration in glioblastoma with magnetic resonance imaging characteristics: a retrospective cross-sectional study. Quant Imaging Med Surg. 2023;13(9):5958–73. 37711787 10.21037/qims-23-126 PMC10498259 47. Caverzán MD, Beaugé L, Oliveda PM et al. Exploring Monocytes-Macrophages in immune microenvironment of glioblastoma for the design of novel therapeutic strategies. Brain Sci 2023;13(4). 10.3390/brainsci13040542 PMC10136702 37190507 48. Lin C Wang N Xu C Glioma-associated microglia/macrophages (GAMs) in glioblastoma: immune function in the tumor microenvironment and implications for immunotherapy Front Immunol 2023 14 1123853 10.3389/fimmu.2023.1123853 36969167 PMC10034134 Lin C, Wang N, Xu C. Glioma-associated microglia/macrophages (GAMs) in glioblastoma: immune function in the tumor microenvironment and implications for immunotherapy. Front Immunol. 2023;14:1123853. 36969167 10.3389/fimmu.2023.1123853 PMC10034134 ",
  "metadata": {
    "Title of this paper": "Glioma-associated microglia/macrophages (GAMs) in glioblastoma: immune function in the tumor microenvironment and implications for immunotherapy",
    "Journal it was published in:": "Discover Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474771/"
  }
}