{
  "title": "Paper_495",
  "abstract": "pmc J Cannabis Res J Cannabis Res 3989 jcannres Journal of Cannabis Research 2522-5782 BMC PMC12482008 PMC12482008.1 12482008 12482008 41024292 10.1186/s42238-025-00332-5 332 1 Review The effects of cannabidiol on nitric oxide synthases: a narrative review on therapeutic implications for inflammation and oxidative stress in health and disease Hooshmand Seyed Amin Alavi 1 Rameshrad Maryam 2 3 Sahebkar Amirhossein amir_saheb2000@yahoo.com sahebkara@mums.ac.ir 4 5 6 Iranshahi Mehrdad iranshahim@mums.ac.ir 1 1 https://ror.org/04sfka033 grid.411583.a 0000 0001 2198 6209 Biotechnology Research center, Pharmaceutical Technology Institute, Mashhad University of Medical Sciences, 2 https://ror.org/04sfka033 grid.411583.a 0000 0001 2198 6209 Department of Pharmacodynamics and Toxicology, School of Pharmacy, Mashhad University of Medical Sciences, 3 https://ror.org/04sfka033 grid.411583.a 0000 0001 2198 6209 Pharmaceutical Research Center, Mashhad University of Medical Sciences, 4 https://ror.org/0034me914 grid.412431.1 0000 0004 0444 045X Center for Global Health Research, Saveetha Medical College and Hospitals, Saveetha Institute of Medical and Technical Sciences, Saveetha University, 5 https://ror.org/04sfka033 grid.411583.a 0000 0001 2198 6209 Biotechnology Research Center, Pharmaceutical Technology Institute, School of Pharmacy, Mashhad University of Medical Sciences, 6 https://ror.org/04sfka033 grid.411583.a 0000 0001 2198 6209 Applied Biomedical Research Center, Basic Sciences Research Institute, Mashhad University of Medical Sciences, 29 9 2025 2025 7 478506 71 12 7 2025 10 9 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Cannabidiol (CBD), a non-psychoactive compound from Cannabis sativa Graphical abstract  Keywords Cannabidiol Nitric oxide synthase Nitric oxide Inflammation Oxidative stress Cardiovascular health Neuroprotection Cancer pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Board of Governors of the Colorado State University System, acting by and through Colorado State University-Pueblo 2025 Introduction One of the most prominent phytochemicals in C. sativa ® 1 2023 2010 2022 2019 2021 2020 2020 2021 2019 2022 2010  Table 1 Pharmacological properties of selected cannabinoids (FDA-approved / notable ) Inflammation and oxidative stress are central, interrelated processes in many acute and chronic disease states (Socco et al. 2017 2023 2013 2022 2009 2020 2023 2021 2021 2020 2024 2024 Emerging evidence suggests that CBD can modulate NOS expression and activity, decreasing pro-inflammatory iNOS while potentially preserving or enhancing protective eNOS function (Chen et al. 2023 This narrative review aims to fill this gap by critically synthesizing and evaluating current preclinical and clinical evidence on how CBD affects specific NOS isoforms and NO signaling. The central research question is: How does CBD’s modulation of NOS isoforms contribute to its therapeutic effects against inflammation and oxidative stress in various diseases? We will explore this question across cardiovascular, neurological, immune, metabolic, and oncological systems to provide a comprehensive understanding of the mechanism. Additionally, we will discuss the impact of CBD formulations, safety considerations, and emerging areas like epigenetic regulation to offer insights into the therapeutic potential of targeting the NOS pathway with CBD. Methodology A literature search was conducted using databases such as PubMed, Scopus, and Web of Science. The search included keywords such as “Cannabidiol,” “Cannabinoids,” “CBD,” “phytocannabinoid,” “Epidiolex,” “cannabidiolum,” “cannabinol,” “cannabinodiol,” and “eNOS,” “Endothelial NOS,” “Endothelial Nitric oxide synthase,” “iNOS,” “inducible NOS,” “inducible Nitric oxide synthase,” “nNOS,” and “neuronal NOS,” “Neuronal Nitric oxide synthase.” The literature search was limited to studies published in the last 20 years until August 2025. Studies that investigated the effects of CBD on NOS pathways in various conditions and disorders, including cardiovascular, neurological, metabolic disorders, cancers, and immune diseases, were included regardless of article type, such as reviews and original articles, with a priority given to clinical trials, in vitro studies, in vivo studies, and meta-analyses. On the other hand, studies that did not focus on CBD’s interaction with NOS, those lacking peer-reviewed status, and duplicate reports were excluded. Different type of cannabinoid and their signaling pathways It is crucial to understand that numerous cannabinoids, including Δ9-THC, influence pharmacological and physiological processes by interacting with the endogenous cannabinoid system. In contrast, certain cannabinoids, such as CBD, exhibit a low affinity for these receptors and operate outside the traditional endocannabinoid framework. Anandamide, recognized as the first identified endocannabinoid and referred to as N-arachidonoylethanolamine (AEA), is produced from membrane phospholipid precursors (Devane et al. 1992 2007 2017 1 1999 2015 2014  Fig. 1 Cannabinoid signaling pathways and their effects. Cannabinoids, whether derived from plants (phytocannabinoids), produced internally (endocannabinoids), or synthesized artificially (synthetic cannabinoids), primarily engage with G-protein-coupled receptors (GPCRs) like the CB1 and CB2 receptors, as well as GPR55. Additionally, they may activate transient receptor potential channels such as TRPV1. The resulting signaling pathways differ according to the specific receptor that is activated, leading to various physiological effects on pain perception, appetite regulation, mood alterations, and numerous other bodily functions Mechanisms and different type of NOS NO in mammals is produced by three discrete isoforms of NOS, each encoded by separate genes: inducible NOS (iNOS), neuronal NOS (nNOS), and endothelial NOS (eNOS) (Fig. 2 1998 3 − 2 − 2 2 − 3 − 2 − 2 2021 2021  Fig. 2 Signaling mechanisms of the three nitric oxide synthases. This activation results in the production of cyclic guanosine monophosphate (cGMP), which activates protein kinase G (PKG) and subsequently phosphorylates myosin light chain kinase (MLCK), culminating in smooth muscle relaxation. nNOS is primarily present in neurons at both sides of the synaptic cleft, where it plays a critical role in modulating neurotransmitter release through cGMP-dependent pathways. iNOS is expressed in various cells, including immune and epithelial cells, in response to proinflammatory cytokines or bacterial components. Once activated, iNOS produces significant amounts of NO over extended periods, which at elevated concentrations can exert cytotoxic effects on pathogens through multiple mechanisms, including the inhibition of essential enzymes involved in replication and cellular respiration (Pourbagher-Shahri et al. 2021 Signaling mechanisms of endocannabinoid in crosstalk with NO levels The endocannabinoid system (ECS), comprising cannabinoid receptors CB₁ and CB₂, endogenous ligands (anandamide and 2-AG), and metabolic enzymes (FAAH, MAGL) (Zou and Kumar 2018 CB₁ receptor activation demonstrates dual effects on NO synthesis. In the CNS, it suppresses neurotoxic iNOS expression in microglia and astrocytes by inhibiting Nuclear Factor kappa-light-chain-enhancer of activated B cells (NFκB) and glutamate excitotoxicity (Cabral et al. 2001 2006 2016 2006 2016 2006 2009 2010 Activation of CB2 receptors reduces inflammatory signaling by decreasing iNOS expression in central immune cells such as microglia and astrocytes (Gómez-Gálvez et al. 2016 2012 2016 2011 1994 The differential regulation of NOS isoforms by ECS signaling cascades reveals distinct mechanistic pathways. Both nNOS and eNOS isoforms are activated through CB₁ and CB₂ receptor-mediated stimulation of cAMP/PKA, PI3K, and PKC signaling pathways (Yen et al. 2011 2012 1994 2012 2016 2006 Notably, NO reciprocally modulates ECS function via S-nitrosylation of GPCRs (Kayki-Mutlu and Koch 2021 2022 2022 2018 2014 These intricate EC-NO interactions highlight therapeutic opportunities for neurodegenerative and cardiovascular disorders through receptor-specific modulation of NOS activity (Park et al. 2016 2006 2 3  Table 2 Selected experimental studies on CBD (and related cannabinoids) with NOS/NO-relevant outcomes Ref Model (in vitro / in vivo) Dose / regimen (as reported) Key NOS/NO-related outcome(s) Mechanistic link to NOS Stanley et al. 2015 Human aortic endothelial cells (in vitro) 10 µmol·L⁻¹, 10 min ↑ phospho-eNOS (Ser1177); Akt/ERK phosphorylation; endothelial-dependent vasorelaxation ex vivo CBD activates PI3K/Akt→eNOS signaling, increasing NO production and vasodilation. Baranowska-Kuczko et al. 2021 DOCA-salt and SHR rats (in vivo) 10 mg·kg⁻¹ daily ×2 weeks Improved endothelium-dependent vasodilation; effects blocked by L-NAME Functional evidence that CBD enhances NO-mediated vasorelaxation (NOS-dependent). Matouk et al. 2018 Diabetic rats; GPR18 activation (in vivo) abn-CBD, regimen as reported ↑ eNOS expression, ↑ NO and cGMP; improved cardiac function Cannabinoid/GPR18 activation restores eNOS/NO signaling → cardioprotection. Rajesh et al. 2007 Human coronary artery endothelial cells (in vitro, high-glucose) 4 µM ×48 h ↓ mitochondrial superoxide, ↓ NF-κB activation, ↓ iNOS, ↓ ICAM-1/VCAM-1 CBD prevents HG-induced iNOS upregulation and preserves endothelial integrity. Rodrigues et al. 2024 BV2 microglia (in vitro) 1 µM ×1 h (LPS model) Inhibition of NLRP3 inflammasome and ↓ iNOS, ↓ NO, ↓ IL-1β/TNF-α PPARγ/NLRP3 pathway links CBD to reduced microglial iNOS/NO production. Tanikawa et al. 2023 Neuropathic pain model (mouse, in vivo) 20 mg·kg⁻¹ i.p. ×21 days Antinociception mediated by NO and S-nitrosylation of KATP channels Shows a physiological role for NO in peripheral CBD effects. Jeong et al. 2019 CRC cell lines (in vitro, oxaliplatin resistance) 4 µM ×12 h ± oxaliplatin CBD suppressed eNOS phosphorylation and NO; induced ROS-mediated autophagy → restored chemosensitivity CBD targets eNOS/NO to overcome NO-dependent chemoresistance. Shi et al. 2023 Melanoma (B16-F10) in vitro / in vivo 2.5 µg·mL⁻¹ (cells) / 5 mg·kg⁻¹ i.p. ×7 d (mice) ↓ tumor growth; ↓ serum iNOS and inflammatory cytokines Antitumor and anti-inflammatory effects associated with lowered iNOS/NO. Callejas et al. 2018 Gastroschisis rat model (in vivo) 30 mg·kg⁻¹ daily ×3 days ↓ nitrite/nitrate; ↓ tissue iNOS expression Direct reduction of tissue nitrosative markers and iNOS. Fouad et al. 2012 Doxorubicin cardiotoxicity (rat, in vivo) 5 mg·kg⁻¹ daily i.p. ×4 weeks ↓ cardiac NO and iNOS; ↓ oxidative/nitrative stress; improved cardiac markers Chemoprotective effect via suppression of iNOS/NO and oxidative damage.  Table 3 Clinical / ex-vivo human evidence related to CBD and NO signaling Ref Type of evidence Key finding(s) Relevance to NOS/NO Stanley et al. 2015 Human arterial tissue (ex-vivo) CBD induced endothelium-dependent vasorelaxation (requires intact endothelium) Supports eNOS/NO involvement in CBD-mediated vasodilation in human vessels. — Clinical trials / human RCTs  Limited clinical trial data directly assessing CBD effects on NOS/NO in patients. Indicates a gap - mechanistic preclinical evidence is strong, but translation to humans needs targeted trials. The effects of cannabidiol on NOS in cardiovascular disorders NO is a critical signaling molecule in various organ systems, particularly within the cardiovascular system, where it plays multiple vital roles. While it was initially recognized primarily as a vasodilator promoting the relaxation of smooth muscle and thereby facilitating increased blood flow NO is now understood to influence numerous other cardiovascular functions, including endothelial and myocardial enhancement, as well as neuronal signaling (Roy et al. 2023 2016 Numerous studies have demonstrated that CBD exerts protective effects against cardiovascular disorders by modulating NOS activity and influencing NO levels, thereby impacting cardiac health and function (Naya et al. 2024 2012 2012 2013 2025 2013 2015 2015 2024 Mechanistic insights CBD appears to have a contextual effect on NO biology in cardiovascular disorders. It suppresses the pathological induction of iNOS and excessive NO/nitrosative stress in cases of inflammatory or ischemic injury. In models of endothelial dysfunction, CBD promotes or preserves physiological eNOS activity by mechanisms such as phosphorylation through Akt/ERK pathways and reducing inflammatory mediators that impair eNOS function. The anti-inflammatory and antioxidant properties of CBD, including inhibition of NF-κB and decreased proinflammatory cytokines, provide a mechanistic explanation for these actions. This suggests that CBD limits iNOS induction during inflammation and supports eNOS-dependent vasoprotection when the endothelium is intact or undergoing repair. Overall, current evidence indicates that CBD modulates NOS/NO in a context-dependent manner, suppressing harmful iNOS-driven NO in inflammatory or ischemic conditions while enhancing protective eNOS signaling in endothelial and vascular models. These effects are mediated through anti-inflammatory, antioxidant, and kinase-mediated signaling pathways. The effect of cannabidiol on NOS in neurological disorders Cannabidiol is increasingly recognized for its neuroprotective properties in various neurological disorders. Notably, one of its crucial mechanisms of action is the modulation of NOS, particularly eNOS and iNOS. This part integrates findings from several studies that evaluate the effects of CBD on NOS dynamics within the context of neuroprotection and inflammation in neurological disorders. Alzheimer’s disease CBD has been shown to have beneficial effects in Alzheimer’s models by reducing iNOS expression and NO release through NF-κB inhibition. It also enhances Nrf2 antioxidant pathways and modulates cytokines such as IL-10 (Hickey et al. 2024 2007 2023 ® 2013 Mechanistic insight CBD reduces Alzheimer’s-related neuroinflammation primarily by inhibiting NF-κB-driven iNOS expression and NO release while activating Nrf2 antioxidant responses and shifting cytokine balance (e.g., ↑IL-10, ↓IL-1β), thereby lowering oxidative stress and hippocampal inflammation (Hickey et al. 2024 2007 2025 ® 2023 2013 Huntington’s disease Cannabidiol and related cannabinoids protect the brain from oxidative damage by exerting antioxidant effects and providing neuroprotection through microglial CB₂ receptor activation (Tomaszewska-Zaremba et al. 2025 2011 2024 Mechanistic insight CBD and related cannabinoids provide neuroprotection by reducing oxidative stress and neuroinflammation through various NOS- and inflammasome-related pathways. CBD decreases iNOS expression and NO production, mitigates oxidative stress, and inhibits pro-inflammatory mediators (IL-1β, TNF-α) through NF-κB and PPARγ signaling, without the need for CB1/CB2 receptor activation (Sagredo et al. 2011 2024 Depressive disorders Wang et al. demonstrated that CBD reduced the expression of pro-inflammatory markers, including iNOS, TNF-α, and IL-1β mRNA, in the cortex and hippocampus of depressed mice. This reduction in neuroinflammation was associated with observed improvements in anxiety and cognition (Wang et al. 2021a b 2018 2024 2024 Mechanistic insight CBD downregulates iNOS, TNF-α, and IL-1β in cortical and hippocampal regions, improving anxiety and cognition (Choi et al. 2023 2024 2018 Neuroprotective effects CBD demonstrates strong neuroprotective effects by modulating NOS isoforms, particularly iNOS and nNOS, in various neurological disorders. Recent in vivo research on models of intraventricular hemorrhage (IVH), CBD reduces brain damage by suppressing iNOS-mediated oxidative stress and preserving blood-brain barrier integrity, thereby alleviating long-term cognitive deficits (Pozo et al. 2024 2008 2024 Moreover, in vitro research by Kim et al. shows that CBD counteracts NO’s inhibition of neurogenesis through CB1 receptor activation, while an NOS inhibitor (7-nitroindazole) enhances this process, confirming NO’s role in limiting brain repair In an in vivo autoimmune encephalomyelitis (EAE) model, which mimics multiple sclerosis, CBD was shown to reduce levels of iNOS and nitrotyrosine, indicating a reduction in oxidative stress and neuroinflammation (Giacoppo et al. 2015 2014 2014 CBD demonstrates strong neuroprotective effects by modulating NOS isoforms, particularly iNOS and nNOS, in various neurological disorders, including through suppression of oxidative stress and preservation of neuronal integrity across both in vivo and in vitro models. Suppression of neuroinflammation CBD effectively suppresses neuroinflammation by targeting iNOS and associated pathways. In vitro studies have shown that combining CBD with cannabigerol (CBG) inhibits iNOS, modulates NF-κB signaling, and increases anti-inflammatory cytokines (IL-10, IL-37), while synergistically activating the Nrf2 antioxidant pathway (Mammana et al. 2019 CBD-dihydroartemisinin conjugates (e.g., C3D) have been found to suppress LPS-induced NO production in microglia by inhibiting iNOS and IL-1β through NF-κB blockade, demonstrating superior efficacy compared to CBD alone in the recent in vitro investigation (Wang et al. 2021a b 2023 2021 Fleisher-Berkovich et al. have highlighted that CBD-rich cannabis cultivars consistently inhibit LPS-induced iNOS/NO in glial cells, underscoring the cultivar-specific efficacy in controlling neuroinflammation (Fleisher-Berkovich et al. 2024 CBD effectively suppresses neuroinflammation by targeting iNOS and associated pathways, such as NF-κB and NLRP3, leading to reduced NO production, cytokine modulation, and enhanced antioxidant responses. Recent evidence reinforces its multi-receptor mechanisms in microglial models. Potential in treating neuropathic pain CBD shows significant potential in treating neuropathic pain by selectively modulating NOS isoforms. Research indicates that nNOS plays a crucial role in CBD-induced analgesia. A key study found that peripheral pain relief by CBD and other analgesics, such as morphine, was eliminated by the nNOS inhibitor L-NPA in hyperalgesic rats, confirming nNOS-derived NO as an essential mediator. Inhibitors of eNOS or iNOS did not affect this outcome, emphasizing the specificity of nNOS (Romero et al. 2011 Additionally, a recent in vivo study by Almeida et al. demonstrated that the dose-dependent pain relief from systemic CBD in neuropathic pain involves the PI3Kγ/nNOS/NO signaling pathway, as selective nNOS inhibition reversed the analgesic effects. Importantly, inhibiting iNOS did not impact the effects of CBD, highlighting nNOS as the primary therapeutic target (Almeida et al. 2024 2007 The anti-inflammatory synergy of CBD was demonstrated in combination therapies. When combined with Morinda citrifolia extract (MCS-ext), CBD enhanced NO suppression in LPS-stimulated macrophages compared to CBD alone (in vitro), likely through NF-κB inhibition downstream of iNOS. This combination therapy preserved cell viability, indicating a safer therapeutic profile (Tanikawa et al. 2023 CBD has shown promise in treating neuropathic pain by selectively modulating NOS isoforms, particularly nNOS and eNOS, through pathways like PI3Kγ/NO/KATP. This allows for targeted analgesia with minimal impact on other isoforms. Additionally, CBD’s anti-inflammatory properties can be enhanced in combination therapies, such as with CBG or conjugates, to target iNOS and NF-κB pathways, suppressing NO and cytokines. This offers improved efficacy and safety for neuroinflammatory conditions. CBD regulation of NOS in cancer: chemoprotection and antitumor effects INOS plays a crucial role in the link between inflammation and cancer, as chronic overexpression of iNOS can lead to DNA damage and carcinogenesis through sustained NO production (Rao 2004 CBD has been shown to counteract this process by suppressing iNOS-mediated oxidative and nitrosative stress. For example, in cases of cisplatin-induced nephrotoxicity, an in vivo study by Pan et al., CBD has been found to reduce renal iNOS expression, peroxynitrite formation, and cell death, thereby preserving kidney function (Pan et al. 2009 2015 2024 2024 2024 In various cancers such as colorectal cancer (CRC) and prostate cancer, both in vitro and in vivo studies have shown that CBD triggers apoptosis by increasing reactive oxygen species (ROS) levels, leading to mitochondrial damage, endoplasmic reticulum (ER) stress, and activation of caspases. This process does not directly involve NOS but emphasizes the role of oxidative signaling as a crucial mechanism for CBD’s anti-tumor effects (Mashabela and Kappo 2024 2024 2024 CBD has been demonstrated to decrease aberrant crypt foci and tumor incidence, partly through antioxidant pathways that protect DNA and reduce proliferation. While CBD inhibited phospho-Akt, it did not alter iNOS or COX-2 overexpression in this context (Aviello et al. 2012 2012 2025 2019 2024 Novel delivery systems, such as effervescent CBD microneedles (Ef/CBD-SD@DMNs), have been developed to improve CBD efficacy. These microneedles have been shown to reduce serum iNOS and pro-inflammatory markers in melanoma in vitro/in vivo 2023 Mechanistic insights CBD reduces oxidative and nitrosative stress in tumors and protects organs by decreasing iNOS expression and NO/peroxynitrite formation (Pan et al. 2009 2015 2024 2024 2024 2024 2019 2024 2023 CBD has a dual-action role in cancer models. It offers chemoprotection by suppressing iNOS/eNOS-driven NO and peroxynitrite formation, reducing inflammation, and providing antitumor effects by promoting ROS accumulation, ER stress, apoptosis, autophagy, and anti-angiogenesis. These effects can restore chemosensitivity. Enhanced delivery systems, such as effervescent microneedles, can enhance these benefits. Overall, preclinical data suggest that CBD could be a valuable addition to cancer therapy and should be further investigated in clinical trials. Effect of cannabidiol on NOS in the immune system CBD exhibits a wide range of immunomodulatory effects, primarily through its interaction with various receptors and pathways involved in inflammatory processes. One of its significant mechanisms of action is the inhibition of iNOS expression, contributing to the attenuation of inflammation. Elevated iNOS levels are commonly found in various conditions characterized by chronic inflammation, such as autoimmune diseases, neurodegenerative disorders, and tissue injury which in this section are defined (Giacoppo et al. 2015 2024 2016 2022 2024 2025 The influence of phytocannabinoids on immune cells has been illustrated in Fig. 3 2024 2024 2024  Fig. 3 The impact of cannabinoids on immune cell function. The diverse impacts of endocannabinoids on immune cells are highlighted. In monocytes, CBD results in a reduction of IL-1β, COX-2, nitric oxide production, and iNOS activity. In macrophages, there is a noted shift from M1 to M2 polarization, accompanied by decreased levels of iNOS, IL-6, and TNF-α. Additionally, CBD enhances degranulation in mast cells. It also induces apoptosis in dendritic cells, which plays a role in immune regulation by increasing IL-10, TNF-α, and IL-6 levels. Furthermore, CBD promotes increased apoptosis in both B cells and T cells Immunoregulatory CBD’s immunoregulatory properties extend beyond direct effects on iNOS. For instance, in an in vitro study investigating LPS-stimulated macrophages, CBD was shown to downregulate various pro-inflammatory mediators, including TNF-α and IL-6, while concurrently diminishing iNOS expression. The combination of CBD with other natural compounds, such as moringin, exhibited enhanced effects on inflammation markers and further supported the anti-inflammatory potential of CBD (Rajan et al. 2016 Additionally, in vivo research indicated that CBD treatment was associated with reduced infiltration of T cells into the central nervous system following spinal cord injury. Specific immune markers linked to T cell activation, such as IL-23 and its receptor, were downregulated, suggesting that CBD influences the immune communication pathways vital for maintaining tissue homeostasis in the presence of injury or inflammation (Li et al. 2018 in vitro/in vivo 2022 2024 2024 CBD’s interaction with various cellular signaling pathways further elucidates its immunomodulatory effects. For instance, the selective activation of PPARγ by CBD contributes to its anti-inflammatory actions, aligning with observed reductions in iNOS and pro-inflammatory markers in multiple studies (Filippis et al. 2011 CBD has diverse effects on immune cells, including reducing inflammation by decreasing NO and cytokine levels in monocytes and macrophages, promoting degranulation in mast cells, inducing apoptosis in dendritic cells and lymphocytes, and modulating cytokine production in dendritic cells. Recent studies suggest that CBD has immunoregulatory and immunosuppressive properties by downregulating pro-inflammatory mediators, reducing T cell infiltration, and promoting neuroprotection through pathways like PPARγ. Modulatory effects on macrophage polarization and inflammatory response CBD has a complex effect on immune response in chronic conditions like MS, reducing M1 markers while having a minimal impact on M2 markers. It also has dual effects on TNF-α and iNOS (Mujahid et al. 2025 2024 2021 2021 2023 2024 Synthesizing these findings, CBD regulates macrophage polarization by reducing pro-inflammatory M1 phenotypes, affecting TNF-α secretion, and inhibiting NO production through eNOS/iNOS pathways. This demonstrates its complex immunomodulatory effects at different concentrations, making it a promising therapy for inflammatory conditions. The comprehensive analysis of CBD’s effects on macrophage polarization and inflammatory responses reveals its sophisticated role as an immunomodulator. This section explained CBD’s ability to modulate both M1 and M2 macrophage phenotypes while exhibiting complex interactions with inflammatory mediators such as TNF-α and iNOS. CBD’s dual capacity to influence intracellular TNF-α levels while reducing its secretion, coupled with its effects on NO production through eNOS modulation, highlights its potential as a therapeutic agent. The differential response observed at various concentrations, provides valuable insights for dosing considerations in clinical applications. Effect of cannabidiol on NOS in metabolic syndrome Metabolic syndrome encompasses a group of interrelated conditions, including obesity, dyslipidemia, insulin resistance, and hypertension, often leading to an increased risk of type 2 diabetes and cardiovascular disease (Patil et al. 2020 2019 2022 2017 2018 4  Fig. 4 Therapeutic effects of CBD in metabolic disorders. CBD demonstrates multiple beneficial effects across three conditions: (Zhou et al. 2023 2010 2022 NAFLD NO, produced by the eNOS enzyme, plays a dual role in liver pathology; while it can have protective effects, excessive NO production often exacerbates inflammatory processes. For instance, studies on NAFLD models show that eNOS dysfunction contributes to endothelial impairment and insulin resistance, worsening steatosis (Sheldon et al. 2015 2021 2024 2024 Cannabinoid’s anti-inflammatory role extends to the liver, where elevated iNOS levels and NO production contribute to liver damage often associated with conditions like NAFLD. A recent study by Gorelick et al. investigated the distinct effects of CBD and THC on NAFLD progression using a high-fat-cholesterol diet animal model. The findings revealed that CBD administration significantly improved glucose tolerance and downregulated key inflammatory markers, specifically TNFα and iNOS. Although CBD treatment did not substantially reduce hepatic steatosis, its marked influence on inflammatory pathways suggests promising therapeutic potential. The study demonstrated that THC exhibited comparatively weaker effects on inflammatory gene expression, indicating that the therapeutic benefits of cannabinoids extend beyond their interactions with canonical cannabinoid receptors (Gorelick et al. 2022 2020 More recently, Yang et al. ( 2024 2024 2025 Mechanistic insight In NAFLD, the balance of NO signaling plays a crucial role. eNOS-derived NO can be protective for the liver, but dysfunction of eNOS can lead to endothelial impairment, insulin resistance, and worsened fat accumulation in the liver (Sheldon et al. 2015 2021 2024 2024 2022 2020 2024 2025 In conclusion, current preclinical studies on CBD for NAFLD show conflicting results. Some studies suggest that CBD improves glucose tolerance and reduces inflammation by suppressing NOS, while others indicate pro-inflammatory effects from CBD-rich extracts. The outcomes seem to be influenced by the cannabinoid composition and targeting of CB1 receptors, highlighting the need for comparative mechanistic studies. Hypertension Hypertension, a condition characterized by persistently elevated blood pressure, is a major risk factor for cardiovascular diseases. Its pathophysiology involves a complex interplay of genetic, behavioral, and environmental factors, often leading to endothelial dysfunction, increased vascular resistance, and ultimately, various cardiovascular complications (Berenyiova et al. 2022 2018 2014 2022 2018 2014 2025 Recently, Baranowska-Kuczko et al. in 2021 2021 2025 2025 In vivo research by Matouk et al. in 2017 demonstrated that chronic activation of GPR18 with abnormal cannabidiol (abn-CBD) led to hypotension and improved cardiac function in rats. The mechanism involved an increase in eNOS expression and NO production, contributing to the observed reductions in blood pressure. Enhanced levels of cGMP were noted, supporting the involvement of NO as a signaling molecule in mediating vasodilation (Matouk et al. 2017 Moreover, Penumarti and Abdel-Rahman further elucidated the role of GPR18 in modulating NOS activity within the rostral ventrolateral medulla (RVLM), a critical area for blood pressure regulation. Activation of GPR18 increased nNOS phosphorylation and NO levels, leading to reduced oxidative stress and blood pressure. This underscores the potential for GPR18 as a novel target for hypertension therapy (Penumarti and Abdel-Rahman 2014 2018 2018 Mechanistic insight In hypertension, dysfunctional eNOS and excess oxidative inactivation reduce NO bioavailability, leading to endothelial dysfunction and increased vascular resistance (Berenyiova et al. 2022 2018 2014 2025 2021 2017 2018 2014 2025 2025 Cannabidiol demonstrates promising vasoprotective effects in hypertensive models, primarily through modulation of NOS enzymes. CBD enhances endothelial function and NO bioavailability, contributing to improved vascular reactivity and blood pressure regulation. Additionally, the activation of GPR18 may further amplify these effects through increased nNOS activity and reduced oxidative stress. Diabetes Diabetes is a multifaceted disease characterized by chronic hyperglycemia, leading to various complications, including cardiovascular disorders and cognitive impairments. The dysregulation of NO production due to altered NOS activity is a critical factor in the pathogenesis of these complications. Recent review report that CBD suppresses diabetes-driven iNOS/NO overproduction. Lee et al. ( 2024 2024 2007 2007 In other in vivo study, in middle-aged diabetic rats exposed to chronic cerebral hypoperfusion, CBD treatment improved cognitive performance and reduced neuroinflammation markers, including iNOS in the hippocampus (Santiago et al. 2019 2019 2018 2007 2019 Mechanistic insight CBD in diabetes restores NO homeostasis by suppressing pathological iNOS-derived NO and supporting protective eNOS signaling. This is achieved through the inhibition of NF-κB and adhesion molecule upregulation, reduction of mitochondrial ROS, preservation of endothelial barrier integrity, and activation of PI3K/Akt→eNOS pathways (Matouk et al. 2018 2024 2007 2019 2019 In conclusion, CBD shows therapeutic promise for diabetes complications by modulating NO pathways. Studies demonstrate its anti-inflammatory and antioxidant effects, ability to regulate NOS activity, and protection of endothelial function against high glucose-induced damage. CBD helps restore NO balance through multiple mechanisms, suggesting potential as a diabetes treatment, though more clinical research is needed. CBD formulations or delivery systems The formulation and route of administration significantly impact the pharmacokinetics, tissue distribution, and pharmacodynamic profile of CBD. Due to CBD’s high lipophilicity and extensive first-pass metabolism, various delivery platforms have been developed to enhance solubility, protect CBD from degradation, facilitate lymphatic uptake, and modulate systemic versus local exposure (Stella et al. 2021 2021 Human data demonstrate that SNEDDS/nanoemulsion approaches can significantly increase relative bioavailability compared to conventional oil drops, leading to faster absorption and higher peak concentrations of CBD and its active metabolite 7-OH-CBD (Hermush et al. 2025 2023 2021 2025 Formulation influences metabolite patterns and first-pass biotransformation, impacting efficacy and safety. Matching the delivery strategy to the disease and mechanism of action is crucial, with intranasal/parenteral or highly bioavailable oral nanoformulations suitable for rapid CNS indications, while transdermal/colloidal topical systems are ideal for localized inflammation. Future comparative studies should include formulation details, particle characteristics, pharmacokinetics, and tolerability to facilitate meaningful cross-study interpretation (Stella et al. 2021 2025 Overview of CBD safety concerns While CBD shows therapeutic potential, clinical trials and product labels have reported common adverse effects such as gastrointestinal symptoms, fatigue/somnolence, and appetite/weight changes, which are usually dose-related and can improve with dose adjustment (Zhou et al. 2023 2024 2023 2024 2023 2025 2023 Furthermore, research has revealed that primary CBD metabolites, particularly 7-OH-CBD and 7-COOH-CBD, can impact neural stem cells and potentially contribute to cytotoxicity or enzyme inhibition, leading to prolonged exposure (Latham et al. 2025 Epigenetic regulatory mechanisms While epigenetic studies on CBD are still emerging, it is important to consider its potential impact on inflammation, oxidative stress, and nitric oxide signaling. CBD has shown to modulate redox-sensitive transcription factors like Nrf2 and NF-κB, which are regulated by epigenetic mechanisms such as histone marks and DNA methylation in disease conditions (Atalay Ekiner et al. 2022 2017 Although the direct epigenetic effects of CBD on NOS or Nrf2 signaling have not been fully elucidated, the overlap between CBD’s redox and anti-inflammatory properties with epigenetically controlled pathways suggests a potential mechanistic connection. Future research should investigate whether CBD influences epigenetic regulators like histone-modifying enzymes, DNA methyltransferases, or microRNA networks in NOS and oxidative/inflammatory pathways. Exploring these epigenetic mechanisms could lead to new insights into CBD’s regulatory roles and deepen our understanding of its effects. Limitations This review summarizes preclinical and limited clinical data on CBD’s effects on NOSHowever, there are critical limitations that challenge the translation of these findings to clinical applications. Preclinical studies often use high CBD concentrations that exceed physiologically achievable levels in humans, raising doubts about clinical relevance. Clinical evidence on CBD’s effects on NOS isoforms and NO signaling is sparse and heterogeneous, limiting conclusions for human use. Mechanistic assumptions about CBD-NOS interactions may oversimplify the effects, which could be influenced by other pathways. CBD’s impact on NOS varies depending on cell type, tissue environment, and disease state, sometimes promoting pro-inflammatory signals. Publication bias and variability in study formulations make cross-study comparisons challenging. Understanding how in vitro findings relate to human exposures is crucial due to metabolic and tissue distribution differences between laboratory models and clinical settings. Future directions To advance the clinical utility of CBD, future research should focus on establishing pharmacokinetically relevant dose-exposure mapping and standardizing CBD preparations. Well-designed clinical trials are needed to assess CBD’s modulation of specific NOS isoforms in patients with cardiovascular and neuroinflammatory conditions. Biomarkers should be incorporated to establish mechanistic correlations between CBD exposure and biological effects. Research should identify the most promising NOS isoforms as therapeutic targets and explore dose optimization and combination therapies. Addressing publication bias and developing translational models will provide a more balanced assessment of CBD’s efficacy. Long-term safety monitoring in NOS-targeted trials is crucial. These efforts will bridge the gap between preclinical mechanisms and therapeutic applications. Conclusion and perspective In summary, the ongoing exploration of CBD’s interaction with NOS and its broader implications for human health underscores the need for rigorous scientific inquiry. As we continue to unravel its potential, the integration of cannabinoid-based therapies into mainstream medical practice could revolutionize approaches to treating chronic diseases characterized by inflammation and oxidative stress. Future research initiatives must aim to refine our understanding and expand the clinical applications of CBD, ultimately contributing to more effective and comprehensive healthcare solutions. This narrative review elucidates the modulatory effects of CBD on NOS and its therapeutic implications for managing inflammation and oxidative stress-related disorders. CBD selectively influences the expression and activity of iNOS and eNOS, thereby regulating NO production, which is essential for cardiovascular health, neuroprotection, and immune responses. The evidence presented highlights CBD’s potential to counteract oxidative stress and inflammation across various pathophysiological contexts, including cardiovascular diseases, neurological disorders, cancer, and metabolic syndromes. Additionally, the dysregulation of NOS isoforms is shown to contribute to the pathogenesis of these diseases, and CBD’s modulation of these pathways may alleviate endothelial dysfunction and improve vascular tone. Furthermore, this article emphasizes CBD’s diverse roles, including its antioxidant, anti-inflammatory, vasorelaxation, immune suppression, antinociceptive, neuroprotective, and cardioprotective effects. These findings suggest that CBD may serve as a promising cannabinoid-based therapeutic agent in treating chronic diseases associated with inflammation and oxidative stress. Overall, the review underscores the need for further research to explore the clinical applications of CBD and its mechanisms in various health scenarios, paving the way for evidence-based treatments that harness the therapeutic potential of cannabinoids. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements This study was partially supported by Mashhad University of Medical Sciences. Author contributions The authors confirm that no paper mill and artificial intelligence was used. Conceptualization: SAAH, MR, AS, MI; Writing-original draft: SAAH, MR; Writing-review & editing: AS, MI; Approval of the final version: all authors. Funding Not applicable. Data availability No datasets were generated or analysed during the current study. Declarations Competing interests The authors declare no competing interests. References Alonso C Satta V Hernández-Fisac I Fernández-Ruiz J Sagredo O Disease-modifying effects of cannabidiol, β-caryophyllene and their combination in Syn1-Cre/Scn1a(WT/A1783V) mice, a preclinical model of Dravet syndrome Neuropharmacology 2023 237 109602 10.1016/j.neuropharm.2023.109602 37290534 Alonso C, Satta V, Hernández-Fisac I, Fernández-Ruiz J, Sagredo O. Disease-modifying effects of cannabidiol, β-caryophyllene and their combination in Syn1-Cre/Scn1a(WT/A1783V) mice, a preclinical model of Dravet syndrome. Neuropharmacology. 2023;237:109602. 37290534 10.1016/j.neuropharm.2023.109602 Asgary S Kelishadi R Rafieian-Kopaei M Najafi S Najafi M Sahebkar A Investigation of the lipid-modifying and antiinflammatory effects of cornus Mas L. supplementation on dyslipidemic children and adolescents Pediatr Cardiol 2013 34 7 1729 35 10.1007/s00246-013-0693-5 23625305 Asgary S, Kelishadi R, Rafieian-Kopaei M, Najafi S, Najafi M, Sahebkar A. Investigation of the lipid-modifying and antiinflammatory effects of cornus Mas L. supplementation on dyslipidemic children and adolescents. Pediatr Cardiol. 2013;34(7):1729–35. 23625305 10.1007/s00246-013-0693-5 Assa-Glazer T Gorelick J Sela N Nyska A Bernstein N Madar Z Cannabis extracts affected metabolic syndrome parameters in mice fed High-Fat/Cholesterol diet Cannabis Cannabinoid Res 2020 5 3 202 14 10.1089/can.2020.0013 32923658 PMC7480733 Assa-Glazer T, Gorelick J, Sela N, Nyska A, Bernstein N, Madar Z. Cannabis extracts affected metabolic syndrome parameters in mice fed High-Fat/Cholesterol diet. Cannabis Cannabinoid Res. 2020;5(3):202–14. 32923658 10.1089/can.2020.0013 PMC7480733 Assadpour E, Rezaei A, Das SS, Krishna Rao BV, Singh SK, Kharazmi MS et al. Cannabidiol-loaded nanocarriers and their therapeutic applications. Pharmaceuticals (Basel). 2023;16(4). 10.3390/ph16040487 PMC10141492 37111244 Aswad M, Pechkovsky A, Ghanayiem N, Hamza H, Louria-Hayon I, High CBD. Extract (CBD-X) modulates inflammation and immune cell activity in rheumatoid arthritis. Front Immunol. 2025;Volume 16–2025. 10.3389/fimmu.2025.1599109 PMC12286807 40709173 Atalay Ekiner S Gęgotek A Skrzydlewska E The molecular activity of Cannabidiol in the regulation of Nrf2 system interacting with NF-κB pathway under oxidative stress Redox Biol 2022 57 102489 10.1016/j.redox.2022.102489 36198205 PMC9535304 Atalay Ekiner S, Gęgotek A, Skrzydlewska E. The molecular activity of Cannabidiol in the regulation of Nrf2 system interacting with NF-κB pathway under oxidative stress. Redox Biol. 2022;57:102489. 36198205 10.1016/j.redox.2022.102489 PMC9535304 Aviello G Romano B Borrelli F Capasso R Gallo L Piscitelli F Chemopreventive effect of the non-psychotropic phytocannabinoid Cannabidiol on experimental colon cancer J Mol Med 2012 90 8 925 34 10.1007/s00109-011-0856-x 22231745 Aviello G, Romano B, Borrelli F, Capasso R, Gallo L, Piscitelli F, et al. Chemopreventive effect of the non-psychotropic phytocannabinoid Cannabidiol on experimental colon cancer. J Mol Med. 2012;90(8):925–34. 22231745 10.1007/s00109-011-0856-x Banerjee S Saharan VA Banerjee D Ram V Kulhari H Pooja D A comprehensive update on cannabidiol, its formulations and drug delivery systems Phytochem Rev 2025 24 4 2723 57 10.1007/s11101-024-10001-9 Banerjee S, Saharan VA, Banerjee D, Ram V, Kulhari H, Pooja D, et al. A comprehensive update on cannabidiol, its formulations and drug delivery systems. Phytochem Rev. 2025;24(4):2723–57. Baranowska-Kuczko M, Kozłowska H, Kloza M, Kusaczuk M, Harasim-Symbor E, Biernacki M et al. Vasoprotective endothelial effects of chronic cannabidiol treatment and its influence on the endocannabinoid system in rats with primary and secondary hypertension. Pharmaceuticals (Basel). 2021;14(11). 10.3390/ph14111120 PMC8624681 34832902 Berenyiova A Balis P Kluknavsky M Bernatova I Cacanyiova S Puzserova A Age- and hypertension-related changes in NOS/NO/sGC-derived vasoactive control of rat thoracic aortae Oxidative Med Cell Longev 2022 2022 7742509 10.1155/2022/7742509 PMC8926472 35308173 Berenyiova A, Balis P, Kluknavsky M, Bernatova I, Cacanyiova S, Puzserova A. Age- and hypertension-related changes in NOS/NO/sGC-derived vasoactive control of rat thoracic aortae. Oxidative Med Cell Longev. 2022;2022:7742509. 10.1155/2022/7742509 PMC8926472 35308173 Bisogno T Berrendero F Ambrosino G Cebeira M Ramos J Fernandez-Ruiz J Brain regional distribution of endocannabinoids: implications for their biosynthesis and biological function Biochem Biophys Res Commun 1999 256 2 377 80 10.1006/bbrc.1999.0254 10079192 Bisogno T, Berrendero F, Ambrosino G, Cebeira M, Ramos J, Fernandez-Ruiz J, et al. Brain regional distribution of endocannabinoids: implications for their biosynthesis and biological function. Biochem Biophys Res Commun. 1999;256(2):377–80. 10079192 10.1006/bbrc.1999.0254 Bondonno CP Croft KD Hodgson JM Dietary nitrate, nitric oxide, and cardiovascular health Crit Rev Food Sci Nutr 2016 56 12 2036 52 10.1080/10408398.2013.811212 25976309 Bondonno CP, Croft KD, Hodgson JM. Dietary nitrate, nitric oxide, and cardiovascular health. Crit Rev Food Sci Nutr. 2016;56(12):2036–52. 25976309 10.1080/10408398.2013.811212 Cabral GA, Harmon KN, Carlisle SJ. Cannabinoid-mediated Inhibition of inducible nitric oxide production by rat microglial cells: evidence for CB 1 receptor participation. Drugs of abuse, and infectious diseases. Neuroimmune Circuits; 2001. pp. 207–14. 10.1007/0-306-47611-8_24 11727767 Callejas GH Figueira RL Gonçalves FLL Volpe FAP Zuardi AW Crippa JA Maternal administration of Cannabidiol promotes an anti-inflammatory effect on the intestinal wall in a Gastroschisis rat model Braz J Med Biol Res 2018 51 5 e7132 10.1590/1414-431x20177132 29561958 PMC5875904 Callejas GH, Figueira RL, Gonçalves FLL, Volpe FAP, Zuardi AW, Crippa JA, et al. Maternal administration of Cannabidiol promotes an anti-inflammatory effect on the intestinal wall in a Gastroschisis rat model. Braz J Med Biol Res. 2018;51(5):e7132. 29561958 10.1590/1414-431X20177132 PMC5875904 Casarejos MJ Perucho J Gomez A Muñoz MP Fernandez-Estevez M Sagredo O Natural cannabinoids improve dopamine neurotransmission and Tau and amyloid pathology in a mouse model of Tauopathy J Alzheimers Dis 2013 35 3 525 39 10.3233/JAD-130050 23478312 Casarejos MJ, Perucho J, Gomez A, Muñoz MP, Fernandez-Estevez M, Sagredo O, et al. Natural cannabinoids improve dopamine neurotransmission and Tau and amyloid pathology in a mouse model of Tauopathy. J Alzheimers Dis. 2013;35(3):525–39. 23478312 10.3233/JAD-130050 Castelli MP, Madeddu C, Casti A, Casu A, Casti P, Scherma M et al. ∆9-Tetrahydrocannabinol prevents methamphetamine-induced neurotoxicity. PLoS ONE. 2014;9(5). 10.1371/journal.pone.0098079 PMC4028295 24844285 Castillo A Tolón MR Fernández-Ruiz J Romero J Martinez-Orgado J The neuroprotective effect of Cannabidiol in an in vitro model of newborn hypoxic-ischemic brain damage in mice is mediated by CB2 and adenosine receptors Neurobiol Dis 2010 37 2 434 40 10.1016/j.nbd.2009.10.023 19900555 Castillo A, Tolón MR, Fernández-Ruiz J, Romero J, Martinez-Orgado J. The neuroprotective effect of Cannabidiol in an in vitro model of newborn hypoxic-ischemic brain damage in mice is mediated by CB2 and adenosine receptors. Neurobiol Dis. 2010;37(2):434–40. 19900555 10.1016/j.nbd.2009.10.023 Chan SH Chan JY Brain stem NOS and ROS in neural mechanisms of hypertension Antioxid Redox Signal 2014 20 1 146 63 10.1089/ars.2013.5230 23418728 Chan SH, Chan JY. Brain stem NOS and ROS in neural mechanisms of hypertension. Antioxid Redox Signal. 2014;20(1):146–63. 23418728 10.1089/ars.2013.5230 Chaoul N Palazzo S Cinquantasei A Aresta V De Chirico C Albanesi M Cannabidiol modulation of immune cell function: in vitro insights and therapeutic implications for atopic dermatitis Postepy Dermatol Alergol 2024 41 4 408 14 10.5114/ada.2024.142182 39290893 PMC11404104 Chaoul N, Palazzo S, Cinquantasei A, Aresta V, De Chirico C, Albanesi M. Cannabidiol modulation of immune cell function: in vitro insights and therapeutic implications for atopic dermatitis. Postepy Dermatol Alergol. 2024;41(4):408–14. 39290893 10.5114/ada.2024.142182 PMC11404104 Chen X, Su J, Wang R, Hao R, Fu C, Chen J et al. Structural optimization of cannabidiol as multifunctional cosmetic Raw materials. Antioxid (Basel). 2023;12(2). 10.3390/antiox12020314 PMC9952480 36829873 Choi K, Lee Y, Kim C. An In silico study for expanding the utility of cannabidiol in alzheimer’s disease therapeutic development. Int J Mol Sci. 2023;24(21). 10.3390/ijms242116013 PMC10648567 37959001 Costa B Trovato AE Comelli F Giagnoni G Colleoni M The non-psychoactive cannabis constituent Cannabidiol is an orally effective therapeutic agent in rat chronic inflammatory and neuropathic pain Eur J Pharmacol 2007 556 1–3 75 83 10.1016/j.ejphar.2006.11.006 17157290 Costa B, Trovato AE, Comelli F, Giagnoni G, Colleoni M. The non-psychoactive cannabis constituent Cannabidiol is an orally effective therapeutic agent in rat chronic inflammatory and neuropathic pain. Eur J Pharmacol. 2007;556(1–3):75–83. 17157290 10.1016/j.ejphar.2006.11.006 Cunningham RP Moore MP Dashek RJ Meers GM Takahashi T Sheldon RD Critical role for Hepatocyte-Specific eNOS in NAFLD and NASH Diabetes 2021 70 11 2476 91 10.2337/db20-1228 34380696 PMC8564406 Cunningham RP, Moore MP, Dashek RJ, Meers GM, Takahashi T, Sheldon RD, et al. Critical role for Hepatocyte-Specific eNOS in NAFLD and NASH. Diabetes. 2021;70(11):2476–91. 34380696 10.2337/db20-1228 PMC8564406 de Almeida DL Mendes Ferreira RC Fonseca FC Dias Machado DP Aguiar DD Guimaraes FS Cannabidiol induces systemic analgesia through activation of the PI3Kγ/nNOS/NO/KATP signaling pathway in neuropathic mice. A KATP channel S-nitrosylation-dependent mechanism Nitric Oxide Biol Chem 2024 146 1 9 10.1016/j.niox.2024.02.005 38428514 de Almeida DL, Mendes Ferreira RC, Fonseca FC, Dias Machado DP, Aguiar DD, Guimaraes FS, et al. Cannabidiol induces systemic analgesia through activation of the PI3Kγ/nNOS/NO/KATP signaling pathway in neuropathic mice. A KATP channel S-nitrosylation-dependent mechanism. Nitric Oxide Biol Chem. 2024;146:1–9. 10.1016/j.niox.2024.02.005 38428514 De Filippis D Esposito G Cirillo C Cipriano M De Winter BY Scuderi C Cannabidiol reduces intestinal inflammation through the control of neuroimmune axis PLoS ONE 2011 6 12 e28159 10.1371/journal.pone.0028159 22163000 PMC3232190 De Filippis D, Esposito G, Cirillo C, Cipriano M, De Winter BY, Scuderi C, et al. Cannabidiol reduces intestinal inflammation through the control of neuroimmune axis. PLoS ONE. 2011;6(12):e28159. 22163000 10.1371/journal.pone.0028159 PMC3232190 Degrave V Vega Joubert MB Filippa C Ingaramo P Torregiani L Caro YS Effects of five cannabis oils with different CBD: THC ratios and terpenes on hypertension, dyslipidemia, hepatic steatosis, oxidative stress, and CB1 receptor in an experimental model J Cannabis Res 2025 7 1 46 10.1186/s42238-025-00286-8 40660358 PMC12261622 Degrave V, Vega Joubert MB, Filippa C, Ingaramo P, Torregiani L, Caro YS, et al. Effects of five cannabis oils with different CBD: THC ratios and terpenes on hypertension, dyslipidemia, hepatic steatosis, oxidative stress, and CB1 receptor in an experimental model. J Cannabis Res. 2025;7(1):46. 40660358 10.1186/s42238-025-00286-8 PMC12261622 Devane WA Hanuš L Breuer A Pertwee RG Stevenson LA Griffin G Isolation and structure of a brain constituent that binds to the cannabinoid receptor Science 1992 258 5090 1946 9 10.1126/science.1470919 1470919 Devane WA, Hanuš L, Breuer A, Pertwee RG, Stevenson LA, Griffin G, et al. Isolation and structure of a brain constituent that binds to the cannabinoid receptor. Science. 1992;258(5090):1946–9. 1470919 10.1126/science.1470919 Di Giosia P, Stamerra CA, Giorgini P, Jamialahmadi T, Butler AE, Sahebkar A. The role of nutrition in inflammaging. Ageing Res Rev. 2022;77. 10.1016/j.arr.2022.101596 35219904 Di Marzo V Silvestri C Lifestyle and metabolic syndrome: contribution of the endocannabinoidome Nutrients 2019 11 8 1956 10.3390/nu11081956 31434293 PMC6722643 Di Marzo V, Silvestri C. Lifestyle and metabolic syndrome: contribution of the endocannabinoidome. Nutrients. 2019;11(8):1956. 31434293 10.3390/nu11081956 PMC6722643 Durmaz R Ozden H Kanbak G Aral E Arslan OC Kartkaya K The protective effect of dexanabinol (HU-211) on nitric oxide and cysteine protease-mediated neuronal death in focal cerebral ischemia Neurochem Res 2008 33 9 1683 91 10.1007/s11064-008-9605-0 18404379 Durmaz R, Ozden H, Kanbak G, Aral E, Arslan OC, Kartkaya K, et al. The protective effect of dexanabinol (HU-211) on nitric oxide and cysteine protease-mediated neuronal death in focal cerebral ischemia. Neurochem Res. 2008;33(9):1683–91. 18404379 10.1007/s11064-008-9605-0 Erhabor JO, Rademan S, Erukainure OL, Matsabisa MG. Aqueous Extracts of Cannabis sativa: cytotoxicity and effects on angiogenesis, oxidative stress and nitric oxide production. Proceedings of the National Academy of Sciences, India Section B: Biological Sciences. 2024;94(3):563 – 73. Esposito G De Filippis D Steardo L Scuderi C Savani C Cuomo V CB1 receptor selective activation inhibits β-amyloid-induced iNOS protein expression in C6 cells and subsequently blunts Tau protein hyperphosphorylation in co-cultured neurons Neurosci Lett 2006 404 3 342 6 10.1016/j.neulet.2006.06.012 16837132 Esposito G, De Filippis D, Steardo L, Scuderi C, Savani C, Cuomo V, et al. CB1 receptor selective activation inhibits β-amyloid-induced iNOS protein expression in C6 cells and subsequently blunts Tau protein hyperphosphorylation in co-cultured neurons. Neurosci Lett. 2006;404(3):342–6. 16837132 10.1016/j.neulet.2006.06.012 Esposito G Scuderi C Savani C Steardo L Jr De Filippis D Cottone P Cannabidiol in vivo blunts β-amyloid induced neuroinflammation by suppressing IL-1β and iNOS expression Br J Pharmacol 2007 151 8 1272 9 10.1038/sj.bjp.0707337 17592514 PMC2189818 Esposito G, Scuderi C, Savani C, Steardo L Jr, De Filippis D, Cottone P, et al. Cannabidiol in vivo blunts β-amyloid induced neuroinflammation by suppressing IL-1β and iNOS expression. Br J Pharmacol. 2007;151(8):1272–9. 17592514 10.1038/sj.bjp.0707337 PMC2189818 Fernández-López D Martínez-Orgado J Nuñez E Romero J Lorenzo P Moro MÁ Characterization of the neuroprotective effect of the cannabinoid agonist WIN-55212 in an in vitro model of hypoxic-ischemic brain damage in newborn rats Pediatr Res 2006 60 2 169 73 10.1203/01.pdr.0000228839.00122.6c 16864698 Fernández-López D, Martínez-Orgado J, Nuñez E, Romero J, Lorenzo P, Moro MÁ, et al. Characterization of the neuroprotective effect of the cannabinoid agonist WIN-55212 in an in vitro model of hypoxic-ischemic brain damage in newborn rats. Pediatr Res. 2006;60(2):169–73. 16864698 10.1203/01.pdr.0000228839.00122.6c Fleisher-Berkovich S Sharon N Ventura Y Feinshtein V Gorelick J Bernstein N Selected cannabis cultivars modulate glial activation: in vitro and in vivo studies J Cannabis Res 2024 6 1 25 10.1186/s42238-024-00232-0 38778343 PMC11110427 Fleisher-Berkovich S, Sharon N, Ventura Y, Feinshtein V, Gorelick J, Bernstein N, et al. Selected cannabis cultivars modulate glial activation: in vitro and in vivo studies. J Cannabis Res. 2024;6(1):25. 38778343 10.1186/s42238-024-00232-0 PMC11110427 Florian J, Salcedo P, Burkhart K, Shah A, Chekka LMS, Keshishi D et al. Cannabidiol and liver enzyme level elevations in healthy adults: A randomized clinical trial. JAMA Intern Med. 2025. 10.1001/jamainternmed.2025.2366 PMC12235532 40622698 Förstermann U Sessa WC Nitric oxide synthases: regulation and function Eur Heart J 2012 33 7 829 37 10.1093/eurheartj/ehr304 21890489 PMC3345541 Förstermann U, Sessa WC. Nitric oxide synthases: regulation and function. Eur Heart J. 2012;33(7):829–37. 21890489 10.1093/eurheartj/ehr304 PMC3345541 Förstermann U Closs EI Pollock JS Nakane M Schwarz P Gath I Nitric oxide synthase isozymes. Characterization, purification, molecular cloning, and functions Hypertension 1994 23 6pt2 1121 31 10.1161/01.HYP.23.6.1121 7515853 Förstermann U, Closs EI, Pollock JS, Nakane M, Schwarz P, Gath I, et al. Nitric oxide synthase isozymes. Characterization, purification, molecular cloning, and functions. Hypertension. 1994;23(6pt2):1121–31. 7515853 10.1161/01.hyp.23.6.1121 Fouad AA Al-Mulhim AS Jresat I Cannabidiol treatment ameliorates ischemia/reperfusion renal injury in rats Life Sci 2012 91 7–8 284 92 10.1016/j.lfs.2012.07.030 22877651 Fouad AA, Al-Mulhim AS, Jresat I. Cannabidiol treatment ameliorates ischemia/reperfusion renal injury in rats. Life Sci. 2012;91(7–8):284–92. 22877651 10.1016/j.lfs.2012.07.030 Fouad AA Albuali WH Al-Mulhim AS Jresat I Cardioprotective effect of Cannabidiol in rats exposed to doxorubicin toxicity Environ Toxicol Pharmacol 2013 36 2 347 57 10.1016/j.etap.2013.04.018 23721741 Fouad AA, Albuali WH, Al-Mulhim AS, Jresat I. Cardioprotective effect of Cannabidiol in rats exposed to doxorubicin toxicity. Environ Toxicol Pharmacol. 2013;36(2):347–57. 23721741 10.1016/j.etap.2013.04.018 Frodella CM, Liu L, Tan W, Pruett SB, Kaplan BLF. The mechanism by which Cannabidiol (CBD) suppresses TNF-α secretion involves inappropriate localization of TNF-α converting enzyme (TACE). Cell Immunol. 2024;397–8. 10.1016/j.cellimm.2024.104812 PMC10947891 38245915 García-Rivas G Lozano O Bernal-Ramírez J Silva-Platas C Salazar-Ramírez F Méndez-Fernández A Cannabidiol prevents heart failure dysfunction and remodeling through preservation of mitochondrial function and calcium handling JACC Basic Transl Sci 2025 10 6 800 21 10.1016/j.jacbts.2024.12.009 40562493 PMC12230462 García-Rivas G, Lozano O, Bernal-Ramírez J, Silva-Platas C, Salazar-Ramírez F, Méndez-Fernández A, et al. Cannabidiol prevents heart failure dysfunction and remodeling through preservation of mitochondrial function and calcium handling. JACC Basic Transl Sci. 2025;10(6):800–21. 40562493 10.1016/j.jacbts.2024.12.009 PMC12230462 Giacoppo S, Galuppo M, Pollastro F, Grassi G, Bramanti P, Mazzon E. A new formulation of cannabidiol in cream shows therapeutic effects in a mouse model of experimental autoimmune encephalomyelitis. DARU, Journal of Pharmaceutical Sciences. 2015;23(1). 10.1186/s40199-015-0131-8 PMC4618347 26489494 Gómez-Gálvez Y Palomo-Garo C Fernández-Ruiz J García C Potential of the cannabinoid CB2 receptor as a Pharmacological target against inflammation in parkinson’s disease Prog Neuropsychopharmacol Biol Psychiatry 2016 64 200 8 10.1016/j.pnpbp.2015.03.017 25863279 Gómez-Gálvez Y, Palomo-Garo C, Fernández-Ruiz J, García C. Potential of the cannabinoid CB2 receptor as a Pharmacological target against inflammation in parkinson’s disease. Prog Neuropsychopharmacol Biol Psychiatry. 2016;64:200–8. 25863279 10.1016/j.pnpbp.2015.03.017 González C Herradón E Abalo R Vera G Pérez-Nievas BG Leza JC Cannabinoid/agonist WIN 55,212‐2 reduces cardiac ischaemia–reperfusion injury in Zucker diabetic fatty rats: role of CB2 receptors and iNOS/eNOS Diab/Metab Res Rev 2011 27 4 331 40 10.1002/dmrr.1176 21309057 González C, Herradón E, Abalo R, Vera G, Pérez-Nievas BG, Leza JC, et al. Cannabinoid/agonist WIN 55,212‐2 reduces cardiac ischaemia–reperfusion injury in Zucker diabetic fatty rats: role of CB2 receptors and iNOS/eNOS. Diab/Metab Res Rev. 2011;27(4):331–40. 10.1002/dmrr.1176 21309057 Gorelick J Assa-Glazer T Zandani G Altberg A Sela N Nyska A THC and CBD affect metabolic syndrome parameters including Microbiome in mice fed high fat-cholesterol diet J Cannabis Res 2022 4 1 27 10.1186/s42238-022-00137-w 35644678 PMC9150295 Gorelick J, Assa-Glazer T, Zandani G, Altberg A, Sela N, Nyska A, et al. THC and CBD affect metabolic syndrome parameters including Microbiome in mice fed high fat-cholesterol diet. J Cannabis Res. 2022;4(1):27. 35644678 10.1186/s42238-022-00137-w PMC9150295 Gurgenci T Kijanka G Greer R Huggett G Good P Moniruzzaman M Exploring potential anti-inflammatory effects of medicinal cannabis Support Care Cancer 2023 31 11 629 37837446 10.1007/s00520-023-08069-8 PMC10576726 Gurgenci T, Kijanka G, Greer R, Huggett G, Good P, Moniruzzaman M, et al. Exploring potential anti-inflammatory effects of medicinal cannabis. Support Care Cancer. 2023;31(11):629. 37837446 10.1007/s00520-023-08069-8 PMC10576726 Hanlon EC Tasali E Leproult R Stuhr K Doncheck E De Wit H Circadian rhythm of Circulating levels of the endocannabinoid 2-arachidonoylglycerol J Clin Endocrinol Metabolism 2015 100 1 220 6 10.1210/jc.2014-3455 PMC5399498 25368979 Hanlon EC, Tasali E, Leproult R, Stuhr K, Doncheck E, De Wit H, et al. Circadian rhythm of Circulating levels of the endocannabinoid 2-arachidonoylglycerol. J Clin Endocrinol Metabolism. 2015;100(1):220–6. 10.1210/jc.2014-3455 PMC5399498 25368979 Hao E Mukhopadhyay P Cao Z Erdélyi K Holovac E Liaudet L Cannabidiol protects against Doxorubicin-Induced cardiomyopathy by modulating mitochondrial function and biogenesis Mol Med 2015 21 1 38 45 10.2119/molmed.2014.00261 25569804 PMC4461586 Hao E, Mukhopadhyay P, Cao Z, Erdélyi K, Holovac E, Liaudet L, et al. Cannabidiol protects against Doxorubicin-Induced cardiomyopathy by modulating mitochondrial function and biogenesis. Mol Med. 2015;21(1):38–45. 25569804 10.2119/molmed.2014.00261 PMC4461586 Hermush V Mizrahi N Brodezky T Ezra R Enhancing cannabinoid bioavailability: a crossover study comparing a novel self-nanoemulsifying drug delivery system and a commercial oil-based formulation J Cannabis Res 2025 7 1 35 10.1186/s42238-025-00294-8 40514741 PMC12166629 Hermush V, Mizrahi N, Brodezky T, Ezra R. Enhancing cannabinoid bioavailability: a crossover study comparing a novel self-nanoemulsifying drug delivery system and a commercial oil-based formulation. J Cannabis Res. 2025;7(1):35. 40514741 10.1186/s42238-025-00294-8 PMC12166629 Hickey JP Collins AE Nelson ML Chen H Kalisch BE Modulation of oxidative stress and neuroinflammation by Cannabidiol (CBD): promising targets for the treatment of alzheimer’s disease Curr Issues Mol Biol 2024 46 5 4379 402 10.3390/cimb46050266 38785534 PMC11120237 Hickey JP, Collins AE, Nelson ML, Chen H, Kalisch BE. Modulation of oxidative stress and neuroinflammation by Cannabidiol (CBD): promising targets for the treatment of alzheimer’s disease. Curr Issues Mol Biol. 2024;46(5):4379–402. 38785534 10.3390/cimb46050266 PMC11120237 Hurt KJ, Sezen SF, Lagoda GF, Musicki B, Rameau GA, Snyder SH et al. Cyclic AMP-dependent phosphorylation of neuronal nitric oxide synthase mediates penile erection. Proceedings of the National Academy of Sciences. 2012;109(41):16624-9. 10.1073/pnas.1213790109 PMC3478647 23012472 Iranshahi M Askari M Sahebkar A Hadjipavlou-Litina D Evaluation of antioxidant, anti-inflammatory and Lipoxygenase inhibitory activities of the prenylated coumarin umbelliprenin DARU J Pharm Sci 2009 17 2 99 103 Iranshahi M, Askari M, Sahebkar A, Hadjipavlou-Litina D. Evaluation of antioxidant, anti-inflammatory and Lipoxygenase inhibitory activities of the prenylated coumarin umbelliprenin. DARU J Pharm Sci. 2009;17(2):99–103. Jantas D Leśkiewicz M Regulska M Procner M Warszyński P Lasoń W Protective effects of Cannabidiol (CBD) against qxidative stress, but not Excitotoxic-Related neuronal cell Damage—An in vitro study Biomolecules 2024 14 5 564 10.3390/biom14050564 38785971 PMC11117811 Jantas D, Leśkiewicz M, Regulska M, Procner M, Warszyński P, Lasoń W. Protective effects of Cannabidiol (CBD) against qxidative stress, but not Excitotoxic-Related neuronal cell Damage—An in vitro study. Biomolecules. 2024;14(5):564. 38785971 10.3390/biom14050564 PMC11117811 Jeong S, Kim BG, Kim DY, Kim BR, Kim JL, Park SH et al. Cannabidiol overcomes oxaliplatin resistance by enhancing NOS3- and SOD2-Induced autophagy in human colorectal cancer cells. Cancers. 2019;11(6). 10.3390/cancers11060781 PMC6627455 31195721 Jin L Cao Y Zhang T Wang P Ji D Liu X Effects of ERK1/2 S-nitrosylation on ERK1/2 phosphorylation and cell survival in glioma cells Int J Mol Med 2018 41 3 1339 48 29286066 10.3892/ijmm.2017.3334 PMC5819938 Jin L, Cao Y, Zhang T, Wang P, Ji D, Liu X, et al. Effects of ERK1/2 S-nitrosylation on ERK1/2 phosphorylation and cell survival in glioma cells. Int J Mol Med. 2018;41(3):1339–48. 29286066 10.3892/ijmm.2017.3334 PMC5819938 Kashfi K Nitric oxide in cancer and beyond Biochem Pharmacol 2020 176 114006 10.1016/j.bcp.2020.114006 32360361 Kashfi K. Nitric oxide in cancer and beyond. Biochem Pharmacol. 2020;176:114006. 32360361 10.1016/j.bcp.2020.114006 Kayki-Mutlu G, Koch WJ. Nitric Oxide and S-Nitrosylation in Cardiac Regulation: G Protein-Coupled Receptor Kinase-2 and β-Arrestins as Targets. Int J Mol Sci. 2021;22(2):521. 10.3390/ijms22020521 10.3390/ijms22020521 PMC7825736 33430208 Khamseekaew J Duangjinda M Maneesai P Labjit C Rattanakanokchai S Rongpan S Cannabis sativa L. Leaf oil displays cardiovascular protective effects in hypertensive rats Int J Mol Sci 2025 26 5 1897 10.3390/ijms26051897 40076524 PMC11899380 Khamseekaew J, Duangjinda M, Maneesai P, Labjit C, Rattanakanokchai S, Rongpan S, et al. Cannabis sativa L. Leaf oil displays cardiovascular protective effects in hypertensive rats. Int J Mol Sci. 2025;26(5):1897. 40076524 10.3390/ijms26051897 PMC11899380 Kicman A Toczek M The effects of cannabidiol, a non-intoxicating compound of cannabis, on the cardiovascular system in health and disease Int J Mol Sci 2020 21 18 6740 10.3390/ijms21186740 32937917 PMC7554803 Kicman A, Toczek M. The effects of cannabidiol, a non-intoxicating compound of cannabis, on the cardiovascular system in health and disease. Int J Mol Sci. 2020;21(18):6740. 32937917 10.3390/ijms21186740 PMC7554803 Kim SH Won SJ Mao XO Ledent C Jin K Greenberg DA Role for neuronal nitric-oxide synthase in cannabinoid-induced neurogenesis J Pharmacol Exp Ther 2006 319 1 150 4 10.1124/jpet.106.107698 16831955 Kim SH, Won SJ, Mao XO, Ledent C, Jin K, Greenberg DA. Role for neuronal nitric-oxide synthase in cannabinoid-induced neurogenesis. J Pharmacol Exp Ther. 2006;319(1):150–4. 16831955 10.1124/jpet.106.107698 Kodali M Madhu LN Kolla VSV Attaluri S Huard C Somayaji Y FDA-approved Cannabidiol [Epidiolex [epidiolex®] Military Med Res 2024 11 1 61 10.1186/s40779-024-00563-2 PMC11340098 39169440 Kodali M, Madhu LN, Kolla VSV, Attaluri S, Huard C, Somayaji Y, et al. FDA-approved Cannabidiol [Epidiolex [epidiolex®] 10.1186/s40779-024-00563-2 PMC11340098 39169440 Król M Kepinska M Human nitric oxide Synthase—Its functions, polymorphisms, and inhibitors in the context of inflammation, diabetes and cardiovascular diseases Int J Mol Sci 2021 22 1 56 10.3390/ijms22010056 PMC7793075 33374571 Król M, Kepinska M. Human nitric oxide Synthase—Its functions, polymorphisms, and inhibitors in the context of inflammation, diabetes and cardiovascular diseases. Int J Mol Sci. 2021;22(1):56. 10.3390/ijms22010056 PMC7793075 33374571 Latham LE Gu Q Liu S Wang C Liu F The effects of Cannabidiol and its main metabolites on human neural stem cells Exp Biol Med (Maywood) 2025 250 10608 10.3389/ebm.2025.10608 40584168 PMC12203246 Latham LE, Gu Q, Liu S, Wang C, Liu F. The effects of Cannabidiol and its main metabolites on human neural stem cells. Exp Biol Med (Maywood). 2025;250:10608. 40584168 10.3389/ebm.2025.10608 PMC12203246 Ledo A Lourenço C Cadenas E Barbosa R Laranjinha J The bioactivity of neuronal-derived nitric oxide in aging and neurodegeneration: switching signaling to degeneration Free Radic Biol Med 2021 162 500 13 10.1016/j.freeradbiomed.2020.11.005 33186742 Ledo A, Lourenço C, Cadenas E, Barbosa R, Laranjinha J. The bioactivity of neuronal-derived nitric oxide in aging and neurodegeneration: switching signaling to degeneration. Free Radic Biol Med. 2021;162:500–13. 33186742 10.1016/j.freeradbiomed.2020.11.005 Lee S Lee Y Kim Y Kim H Rhyu H Yoon K Beneficial effects of Cannabidiol from cannabis Appl Biol Chem 2024 67 1 32 10.1186/s13765-024-00867-w Lee S, Lee Y, Kim Y, Kim H, Rhyu H, Yoon K, et al. Beneficial effects of Cannabidiol from cannabis. Appl Biol Chem. 2024;67(1):32. Li H Kong W Chambers CR Yu D Ganea D Tuma RF The non-psychoactive phytocannabinoid Cannabidiol (CBD) attenuates pro-inflammatory mediators, T cell infiltration, and thermal sensitivity following spinal cord injury in mice Cell Immunol 2018 329 1 9 10.1016/j.cellimm.2018.02.016 29784129 PMC6447028 Li H, Kong W, Chambers CR, Yu D, Ganea D, Tuma RF, et al. The non-psychoactive phytocannabinoid Cannabidiol (CBD) attenuates pro-inflammatory mediators, T cell infiltration, and thermal sensitivity following spinal cord injury in mice. Cell Immunol. 2018;329:1–9. 29784129 10.1016/j.cellimm.2018.02.016 PMC6447028 Li M Xu B Li X Li Y Qiu S Chen K Mitofusin 2 confers the suppression of microglial activation by cannabidiol: insights from in vitro and in vivo models Brain Behav Immun 2022 104 155 70 10.1016/j.bbi.2022.06.003 35688339 Li M, Xu B, Li X, Li Y, Qiu S, Chen K, et al. Mitofusin 2 confers the suppression of microglial activation by cannabidiol: insights from in vitro and in vivo models. Brain Behav Immun. 2022;104:155–70. 35688339 10.1016/j.bbi.2022.06.003 Liu Z Cannabidiol (CBD) and colorectal tumorigenesis: potential dual modulatory roles via the serotonergic pathway Curr Oncol 2025 32 7 375 10.3390/curroncol32070375 40710186 PMC12293229 Liu Z. Cannabidiol (CBD) and colorectal tumorigenesis: potential dual modulatory roles via the serotonergic pathway. Curr Oncol. 2025;32(7):375. 40710186 10.3390/curroncol32070375 PMC12293229 Liu B, Sun Y, Zhang H, Zhang H, Chang S, CHEN C et al. Nano-cannabidiol to orchestrate inflammatory homeostasis via macrophage metabolism reprogramming for targeted treatment atherosclerosis. Available at SSRN 4783451. 2024. Lo LA Christiansen A Eadie L Strickland JC Kim DD Boivin M Cannabidiol-associated hepatotoxicity: A systematic review and meta-analysis J Intern Med 2023 293 6 724 52 10.1111/joim.13627 36912195 Lo LA, Christiansen A, Eadie L, Strickland JC, Kim DD, Boivin M, et al. Cannabidiol-associated hepatotoxicity: A systematic review and meta-analysis. J Intern Med. 2023;293(6):724–52. 36912195 10.1111/joim.13627 Maccarrone M Metabolism of the endocannabinoid anandamide: open questions after 25 years Front Mol Neurosci 2017 10 166 10.3389/fnmol.2017.00166 28611591 PMC5447297 Maccarrone M. Metabolism of the endocannabinoid anandamide: open questions after 25 years. Front Mol Neurosci. 2017;10:166. 28611591 10.3389/fnmol.2017.00166 PMC5447297 Mahavadi S Nalli AD Kumar DP Hu W Kuemmerle JF Grider JR Cytokine-induced iNOS and ERK1/2 inhibit adenylyl cyclase type 5/6 activity and stimulate phosphodiesterase 4D5 activity in intestinal longitudinal smooth muscle Am J Physiology-Cell Physiol 2014 307 4 C402 11 10.1152/ajpcell.00123.2014 PMC4137135 24944202 Mahavadi S, Nalli AD, Kumar DP, Hu W, Kuemmerle JF, Grider JR, et al. Cytokine-induced iNOS and ERK1/2 inhibit adenylyl cyclase type 5/6 activity and stimulate phosphodiesterase 4D5 activity in intestinal longitudinal smooth muscle. Am J Physiology-Cell Physiol. 2014;307(4):C402–11. 10.1152/ajpcell.00123.2014 PMC4137135 24944202 Mammana S, Cavalli E, Gugliandolo A, Silvestro S, Pollastro F, Bramanti P, et al. Could the combination of two non-psychotropic cannabinoids counteract neuroinflammation? Effectiveness of Cannabidiol sssociated with Cannabigerol. Med (Kaunas). 2019;55(11). 10.3390/medicina55110747 PMC6915685 31752240 Maroso M Szabo GG Kim HK Alexander A Bui AD Lee S-H Cannabinoid control of learning and memory through HCN channels Neuron 2016 89 5 1059 73 10.1016/j.neuron.2016.01.023 26898775 PMC4777634 Maroso M, Szabo GG, Kim HK, Alexander A, Bui AD, Lee S-H, et al. Cannabinoid control of learning and memory through HCN channels. Neuron. 2016;89(5):1059–73. 26898775 10.1016/j.neuron.2016.01.023 PMC4777634 Mashabela MD, Kappo AP. Anti-cancer and anti-proliferative potential of cannabidiol: a cellular and molecular perspective. Int J Mol Sci. 2024;25(11). 10.3390/ijms25115659 PMC11171526 38891847 Matouk AI Taye A El-Moselhy MA Heeba GH Abdel-Rahman AA The effect of chronic activation of the novel endocannabinoid receptor GPR18 on myocardial function and blood pressure in conscious rats J Cardiovasc Pharmacol 2017 69 1 23 33 10.1097/FJC.0000000000000438 27676325 PMC5209303 Matouk AI, Taye A, El-Moselhy MA, Heeba GH, Abdel-Rahman AA. The effect of chronic activation of the novel endocannabinoid receptor GPR18 on myocardial function and blood pressure in conscious rats. J Cardiovasc Pharmacol. 2017;69(1):23–33. 27676325 10.1097/FJC.0000000000000438 PMC5209303 Matouk AI Taye A El-Moselhy MA Heeba GH Abdel-Rahman AA Abnormal Cannabidiol confers cardioprotection in diabetic rats independent of glycemic control Eur J Pharmacol 2018 820 256 64 10.1016/j.ejphar.2017.12.039 29274332 PMC5767137 Matouk AI, Taye A, El-Moselhy MA, Heeba GH, Abdel-Rahman AA. Abnormal Cannabidiol confers cardioprotection in diabetic rats independent of glycemic control. Eur J Pharmacol. 2018;820:256–64. 29274332 10.1016/j.ejphar.2017.12.039 PMC5767137 Morris G Walder K Berk M Carvalho AF Marx W Bortolasci CC Intertwined associations between oxidative and nitrosative stress and endocannabinoid system pathways: relevance for neuropsychiatric disorders Prog Neuropsychopharmacol Biol Psychiatry 2022 114 110481 10.1016/j.pnpbp.2021.110481 34826557 Morris G, Walder K, Berk M, Carvalho AF, Marx W, Bortolasci CC, et al. Intertwined associations between oxidative and nitrosative stress and endocannabinoid system pathways: relevance for neuropsychiatric disorders. Prog Neuropsychopharmacol Biol Psychiatry. 2022;114:110481. 34826557 10.1016/j.pnpbp.2021.110481 Mujahid K Rasheed MS Sabir A Nam J Ramzan T Ashraf W Cannabidiol as an immune modulator: A comprehensive review Saudi Pharm J 2025 33 3 11 10.1007/s44446-025-00005-7 40407987 PMC12102056 Mujahid K, Rasheed MS, Sabir A, Nam J, Ramzan T, Ashraf W, et al. Cannabidiol as an immune modulator: A comprehensive review. Saudi Pharm J. 2025;33(3):11. 40407987 10.1007/s44446-025-00005-7 PMC12102056 Murataeva N Straiker A Mackie K Parsing the players: 2-arachidonoylglycerol synthesis and degradation in the CNS Br J Pharmacol 2014 171 6 1379 91 10.1111/bph.12411 24102242 PMC3954479 Murataeva N, Straiker A, Mackie K. Parsing the players: 2-arachidonoylglycerol synthesis and degradation in the CNS. Br J Pharmacol. 2014;171(6):1379–91. 24102242 10.1111/bph.12411 PMC3954479 Naya NM Kelly J Hogwood A Abbate A Toldo S Therapeutic potential of Cannabidiol (CBD) in the treatment of cardiovascular diseases Expert Opin Investig Drugs 2024 33 7 699 712 10.1080/13543784.2024.2351513 38703078 Naya NM, Kelly J, Hogwood A, Abbate A, Toldo S. Therapeutic potential of Cannabidiol (CBD) in the treatment of cardiovascular diseases. Expert Opin Investig Drugs. 2024;33(7):699–712. 38703078 10.1080/13543784.2024.2351513 Oddi S Latini L Viscomi MT Bisicchia E Molinari M Maccarrone M Distinct regulation of nNOS and iNOS by CB 2 receptor in remote delayed neurodegeneration J Mol Med 2012 90 371 87 10.1007/s00109-011-0846-z 22198001 Oddi S, Latini L, Viscomi MT, Bisicchia E, Molinari M, Maccarrone M. Distinct regulation of nNOS and iNOS by CB 2 receptor in remote delayed neurodegeneration. J Mol Med. 2012;90:371–87. 22198001 10.1007/s00109-011-0846-z Opitz CA Rimmerman N Zhang Y Mead LE Yoder MC Ingram DA Production of the endocannabinoids Anandamide and 2-arachidonoylglycerol by endothelial progenitor cells FEBS Lett 2007 581 25 4927 31 10.1016/j.febslet.2007.09.032 17904123 PMC2072933 Opitz CA, Rimmerman N, Zhang Y, Mead LE, Yoder MC, Ingram DA, et al. Production of the endocannabinoids Anandamide and 2-arachidonoylglycerol by endothelial progenitor cells. FEBS Lett. 2007;581(25):4927–31. 17904123 10.1016/j.febslet.2007.09.032 PMC2072933 Pan H Mukhopadhyay P Rajesh M Patel V Mukhopadhyay B Gao B Cannabidiol attenuates cisplatin-induced nephrotoxicity by decreasing oxidative/nitrosative stress, inflammation, and cell death J Pharmacol Exp Ther 2009 328 3 708 14 10.1124/jpet.108.147181 19074681 PMC2682269 Pan H, Mukhopadhyay P, Rajesh M, Patel V, Mukhopadhyay B, Gao B, et al. Cannabidiol attenuates cisplatin-induced nephrotoxicity by decreasing oxidative/nitrosative stress, inflammation, and cell death. J Pharmacol Exp Ther. 2009;328(3):708–14. 19074681 10.1124/jpet.108.147181 PMC2682269 Park T Chen H Kevala K Lee J-W Kim H-Y N-Docosahexaenoylethanolamine ameliorates LPS-induced neuroinflammation via cAMP/PKA-dependent signaling J Neuroinflamm 2016 13 1 15 10.1186/s12974-016-0751-z PMC5096293 27809877 Park T, Chen H, Kevala K, Lee J-W, Kim H-Y. N-Docosahexaenoylethanolamine ameliorates LPS-induced neuroinflammation via cAMP/PKA-dependent signaling. J Neuroinflamm. 2016;13:1–15. 10.1186/s12974-016-0751-z PMC5096293 27809877 Patil AS Mahajan UB Agrawal YO Patil KR Patil CR Ojha S Plant-derived natural therapeutics targeting cannabinoid receptors in metabolic syndrome and its complications: A review Biomed Pharmacother 2020 132 110889 10.1016/j.biopha.2020.110889 33113429 Patil AS, Mahajan UB, Agrawal YO, Patil KR, Patil CR, Ojha S, et al. Plant-derived natural therapeutics targeting cannabinoid receptors in metabolic syndrome and its complications: A review. Biomed Pharmacother. 2020;132:110889. 33113429 10.1016/j.biopha.2020.110889 Penumarti A Abdel-Rahman AA Neuronal nitric oxide synthase-dependent elevation in adiponectin in the rostral ventrolateral medulla underlies g protein-coupled receptor 18-mediated hypotension in conscious rats J Pharmacol Exp Ther 2014 351 1 44 53 10.1124/jpet.114.216036 25100751 PMC4165025 Penumarti A, Abdel-Rahman AA. Neuronal nitric oxide synthase-dependent elevation in adiponectin in the rostral ventrolateral medulla underlies g protein-coupled receptor 18-mediated hypotension in conscious rats. J Pharmacol Exp Ther. 2014;351(1):44–53. 25100751 10.1124/jpet.114.216036 PMC4165025 Pongking T Thongpon P Intuyod K Klungsaeng S Thanan R Chaidee A Cannabidiol exhibits potent anti-cancer activity against gemcitabine-resistant cholangiocarcinoma via ER-stress induction in vitro and in vivo BMC Complement Med Ther 2024 24 1 325 10.1186/s12906-024-04610-2 39215312 PMC11365133 Pongking T, Thongpon P, Intuyod K, Klungsaeng S, Thanan R, Chaidee A, et al. Cannabidiol exhibits potent anti-cancer activity against gemcitabine-resistant cholangiocarcinoma via ER-stress induction in vitro and in vivo. BMC Complement Med Ther. 2024;24(1):325. 39215312 10.1186/s12906-024-04610-2 PMC11365133 Poudel B Bany BM Hales DB Cheatwood JL Effects of Cannabidiol (CBD) on Doxorubicin-Induced anxiety and Depression-like behaviors and mRNA expression of inflammatory markers in rats Brain Sci 2024 14 10 999 10.3390/brainsci14100999 39452013 PMC11505750 Poudel B, Bany BM, Hales DB, Cheatwood JL. Effects of Cannabidiol (CBD) on Doxorubicin-Induced anxiety and Depression-like behaviors and mRNA expression of inflammatory markers in rats. Brain Sci. 2024;14(10):999. 39452013 10.3390/brainsci14100999 PMC11505750 Pourbagher-Shahri AM, Farkhondeh T, Talebi M, Kopustinskiene DM, Samarghandian S, Bernatoniene J. An overview of no signaling pathways in aging. Molecules. 2021;26(15). 10.3390/molecules26154533 PMC8348219 34361685 Pozo AD, Hoz-Rivera MD, Romero A, Villa M, Martínez M, Silva L, et al. Cannabidiol reduces intraventricular hemorrhage brain damage, preserving myelination and preventing blood brain barrier dysfunction in immature rats. Neurotherapeutics. 2024;21(2). 10.1016/j.neurot.2024.e00326 PMC10963939 38301326 Rajan TS Giacoppo S Iori R De Nicola GR Grassi G Pollastro F Anti-inflammatory and antioxidant effects of a combination of Cannabidiol and Moringin in LPS-stimulated macrophages Fitoterapia 2016 112 104 15 10.1016/j.fitote.2016.05.008 27215129 Rajan TS, Giacoppo S, Iori R, De Nicola GR, Grassi G, Pollastro F, et al. Anti-inflammatory and antioxidant effects of a combination of Cannabidiol and Moringin in LPS-stimulated macrophages. Fitoterapia. 2016;112:104–15. 27215129 10.1016/j.fitote.2016.05.008 Rajesh M Mukhopadhyay P Bátkai S Haskó G Liaudet L Drel VR Cannabidiol attenuates high glucose-induced endothelial cell inflammatory response and barrier disruption Am J Physiol - Heart Circ Physiol 2007 293 1 H610 9 10.1152/ajpheart.00236.2007 17384130 PMC2228254 Rajesh M, Mukhopadhyay P, Bátkai S, Haskó G, Liaudet L, Drel VR, et al. Cannabidiol attenuates high glucose-induced endothelial cell inflammatory response and barrier disruption. Am J Physiol - Heart Circ Physiol. 2007;293(1):H610–9. 17384130 10.1152/ajpheart.00236.2007 PMC2228254 Rao CV Nitric oxide signaling in colon cancer chemoprevention Mutat Res 2004 555 1–2 107 19 10.1016/j.mrfmmm.2004.05.022 15476855 Rao CV. Nitric oxide signaling in colon cancer chemoprevention. Mutat Res. 2004;555(1–2):107–19. 15476855 10.1016/j.mrfmmm.2004.05.022 Rodrigues FDS Newton WR Tassinari ID da Cunha Xavier FH Marx A de Fraga LS Cannabidiol prevents LPS-induced inflammation by inhibiting the NLRP3 inflammasome and iNOS activity in BV2 microglia cells via CB2 receptors and PPARγ Neurochem Int 2024 177 105769 10.1016/j.neuint.2024.105769 38761855 Rodrigues FDS, Newton WR, Tassinari ID, da Cunha Xavier FH, Marx A, de Fraga LS, et al. Cannabidiol prevents LPS-induced inflammation by inhibiting the NLRP3 inflammasome and iNOS activity in BV2 microglia cells via CB2 receptors and PPARγ. Neurochem Int. 2024;177:105769. 38761855 10.1016/j.neuint.2024.105769 Romero TRL Resende LC Duarte IDG The neuronal NO synthase participation in the peripheral antinociception mechanism induced by several analgesic drugs Nitric Oxide 2011 25 4 431 5 10.1016/j.niox.2011.08.002 21875681 Romero TRL, Resende LC, Duarte IDG. The neuronal NO synthase participation in the peripheral antinociception mechanism induced by several analgesic drugs. Nitric Oxide. 2011;25(4):431–5. 21875681 10.1016/j.niox.2011.08.002 Rosselli M Keller R Dubey R Role of nitric oxide in the biology, physiology and pathophysiology of reproduction Hum Reprod Update 1998 4 1 3 24 10.1093/humupd/4.1.3 9622410 Rosselli M, Keller R, Dubey R. Role of nitric oxide in the biology, physiology and pathophysiology of reproduction. Hum Reprod Update. 1998;4(1):3–24. 9622410 10.1093/humupd/4.1.3 Roy R, Wilcox J, Webb AJ, O’Gallagher K. Dysfunctional and dysregulated nitric oxide synthases in cardiovascular disease: mechanisms and therapeutic potential. Int J Mol Sci. 2023;24(20). 10.3390/ijms242015200 PMC10607291 37894881 Rutkowska M Fereniec-Gołębiewska L Involvement of nitric oxide in the gastroprotective effect of ACEA, a selective cannabinoid CB1 receptor agonist, on aspirin-induced gastric ulceration Die Pharmazie-An Int J Pharm Sci 2009 64 9 595 7 19827302 Rutkowska M, Fereniec-Gołębiewska L. Involvement of nitric oxide in the gastroprotective effect of ACEA, a selective cannabinoid CB1 receptor agonist, on aspirin-induced gastric ulceration. Die Pharmazie-An Int J Pharm Sci. 2009;64(9):595–7. 19827302 Ryszkiewicz P Schlicker E Malinowska B Is inducible nitric oxide synthase (iNOS) promising as a new target against pulmonary hypertension?? Antioxidants 2025 14 4 377 10.3390/antiox14040377 40298665 PMC12024173 Ryszkiewicz P, Schlicker E, Malinowska B. Is inducible nitric oxide synthase (iNOS) promising as a new target against pulmonary hypertension?? Antioxidants. 2025;14(4):377. 40298665 10.3390/antiox14040377 PMC12024173 Saberi-Karimian M, Keshvari M, Ghayour-Mobarhan M, Salehizadeh L, Rahmani S, Behnam B et al. Effects of curcuminoids on inflammatory status in patients with non-alcoholic fatty liver disease: A randomized controlled trial. Complement Ther Med. 2020;49. 10.1016/j.ctim.2020.102322 32147075 Sagredo O Pazos MR Satta V Ramos JA Pertwee RG Fernández-Ruiz J Neuroprotective effects of phytocannabinoid-based medicines in experimental models of huntington’s disease J Neurosci Res 2011 89 9 1509 18 10.1002/jnr.22682 21674569 Sagredo O, Pazos MR, Satta V, Ramos JA, Pertwee RG, Fernández-Ruiz J. Neuroprotective effects of phytocannabinoid-based medicines in experimental models of huntington’s disease. J Neurosci Res. 2011;89(9):1509–18. 21674569 10.1002/jnr.22682 Saha RN Pahan K Regulation of inducible nitric oxide synthase gene in glial cells Antioxid Redox Signal 2006 8 5–6 929 47 10.1089/ars.2006.8.929 16771683 PMC1963415 Saha RN, Pahan K. Regulation of inducible nitric oxide synthase gene in glial cells. Antioxid Redox Signal. 2006;8(5–6):929–47. 16771683 10.1089/ars.2006.8.929 PMC1963415 Santiago AN Mori MA Guimarães FS Milani H Weffort de Oliveira RM Effects of Cannabidiol on diabetes outcomes and chronic cerebral hypoperfusion comorbidities in middle-aged rats Neurotox Res 2019 35 2 463 74 10.1007/s12640-018-9972-5 30430393 Santiago AN, Mori MA, Guimarães FS, Milani H, Weffort de Oliveira RM. Effects of Cannabidiol on diabetes outcomes and chronic cerebral hypoperfusion comorbidities in middle-aged rats. Neurotox Res. 2019;35(2):463–74. 30430393 10.1007/s12640-018-9972-5 Schmidt HH Walter U NO at work Cell 1994 78 6 919 25 10.1016/0092-8674(94)90267-4 7923361 Schmidt HH, Walter U. NO at work. Cell. 1994;78(6):919–25. 7923361 10.1016/0092-8674(94)90267-4 Shebaby W Saliba J Faour WH Ismail J El Hage M Daher CF In vivo and in vitro anti-inflammatory activity evaluation of Lebanese cannabis sativa L. Ssp. Indica (Lam) J Ethnopharmacol 2021 270 113743 10.1016/j.jep.2020.113743 33359187 Shebaby W, Saliba J, Faour WH, Ismail J, El Hage M, Daher CF, et al. In vivo and in vitro anti-inflammatory activity evaluation of Lebanese cannabis sativa L. Ssp. Indica (Lam). J Ethnopharmacol. 2021;270:113743. 33359187 10.1016/j.jep.2020.113743 Sheldon RD Padilla J Jenkins NT Laughlin MH Rector RS Chronic NOS Inhibition accelerates NAFLD progression in an obese rat model Am J Physiology-Gastrointestinal Liver Physiol 2015 308 6 G540 9 10.1152/ajpgi.00247.2014 PMC4360049 25573175 Sheldon RD, Padilla J, Jenkins NT, Laughlin MH, Rector RS. Chronic NOS Inhibition accelerates NAFLD progression in an obese rat model. Am J Physiology-Gastrointestinal Liver Physiol. 2015;308(6):G540–9. 10.1152/ajpgi.00247.2014 PMC4360049 25573175 Shi J, Ma Q, Su W, Liu C, Zhang H, Liu Y et al. Effervescent Cannabidiol solid dispersion-doped dissolving microneedles for boosted melanoma therapy via the TRPV1-NFATc1-ATF3 pathway and tumor microenvironment engineering. Biomaterials Res. 2023;27(1). 10.1186/s40824-023-00390-x PMC10193696 37198657 Snow WM Albensi BC Neuronal gene targets of NF-κB and their dysregulation in alzheimer’s disease Front Mol Neurosci 2016 9 118 10.3389/fnmol.2016.00118 27881951 PMC5101203 Snow WM, Albensi BC. Neuronal gene targets of NF-κB and their dysregulation in alzheimer’s disease. Front Mol Neurosci. 2016;9:118. 27881951 10.3389/fnmol.2016.00118 PMC5101203 Socco S Bovee RC Palczewski MB Hickok JR Thomas DD Epigenetics: the third pillar of nitric oxide signaling Pharmacol Res 2017 121 52 8 10.1016/j.phrs.2017.04.011 28428114 Socco S, Bovee RC, Palczewski MB, Hickok JR, Thomas DD. Epigenetics: the third pillar of nitric oxide signaling. Pharmacol Res. 2017;121:52–8. 28428114 10.1016/j.phrs.2017.04.011 Spencer S Neuhofer D Chioma VC Garcia-Keller C Schwartz DJ Allen N A model of ∆(9)-tetrahydrocannabinol self-administration and reinstatement that alters synaptic plasticity in nucleus accumbens Biol Psychiatry 2018 84 8 601 10 10.1016/j.biopsych.2018.04.016 29861097 PMC6162175 Spencer S, Neuhofer D, Chioma VC, Garcia-Keller C, Schwartz DJ, Allen N, et al. A model of ∆(9)-tetrahydrocannabinol self-administration and reinstatement that alters synaptic plasticity in nucleus accumbens. Biol Psychiatry. 2018;84(8):601–10. 29861097 10.1016/j.biopsych.2018.04.016 PMC6162175 Stanley CP Hind WH Tufarelli C O’Sullivan SE Cannabidiol causes endothelium-dependent vasorelaxation of human mesenteric arteries via CB1 activation Cardiovascular Res 2015 107 4 568 78 10.1093/cvr/cvv179 PMC4540144 26092099 Stanley CP, Hind WH, Tufarelli C, O’Sullivan SE. Cannabidiol causes endothelium-dependent vasorelaxation of human mesenteric arteries via CB1 activation. Cardiovascular Res. 2015;107(4):568–78. 10.1093/cvr/cvv179 PMC4540144 26092099 Stella B Baratta F Della Pepa C Arpicco S Gastaldi D Dosio F Cannabinoid formulations and delivery systems: current and future options to treat pain Drugs 2021 81 13 1513 57 10.1007/s40265-021-01579-x 34480749 PMC8417625 Stella B, Baratta F, Della Pepa C, Arpicco S, Gastaldi D, Dosio F. Cannabinoid formulations and delivery systems: current and future options to treat pain. Drugs. 2021;81(13):1513–57. 34480749 10.1007/s40265-021-01579-x PMC8417625 Tabatabaei K Moazzezi S Emamgholizadeh M Vaez H Baradaran B Shokouhi B Improved therapeutic efficacy of doxorubicin chemotherapy with Cannabidiol in 4T1 mice breast cancer model Cancer Med 2024 13 21 e70395 10.1002/cam4.70395 39503169 PMC11538943 Tabatabaei K, Moazzezi S, Emamgholizadeh M, Vaez H, Baradaran B, Shokouhi B. Improved therapeutic efficacy of doxorubicin chemotherapy with Cannabidiol in 4T1 mice breast cancer model. Cancer Med. 2024;13(21):e70395. 39503169 10.1002/cam4.70395 PMC11538943 Tanikawa T Kitamura M Hayashi Y Tomida N Uwaya A Isami F Anti-inflammatory effect of a combination of Cannabidiol and Morinda citrifolia extract on Lipopolysaccharide-stimulated RAW264 macrophages Vivo 2023 37 2 591 5 10.21873/invivo.13117 PMC10026682 36881078 Tanikawa T, Kitamura M, Hayashi Y, Tomida N, Uwaya A, Isami F, et al. Anti-inflammatory effect of a combination of Cannabidiol and Morinda citrifolia extract on Lipopolysaccharide-stimulated RAW264 macrophages. Vivo. 2023;37(2):591–5. 10.21873/invivo.13117 PMC10026682 36881078 Tao Y Li L Jiang B Feng Z Yang L Tang J Cannabinoid receptor-2 stimulation suppresses neuroinflammation by regulating microglial M1/M2 polarization through the cAMP/PKA pathway in an experimental GMH rat model Brain Behav Immun 2016 58 118 29 10.1016/j.bbi.2016.05.020 27261088 Tao Y, Li L, Jiang B, Feng Z, Yang L, Tang J, et al. Cannabinoid receptor-2 stimulation suppresses neuroinflammation by regulating microglial M1/M2 polarization through the cAMP/PKA pathway in an experimental GMH rat model. Brain Behav Immun. 2016;58:118–29. 27261088 10.1016/j.bbi.2016.05.020 Tepebaşı MY Aşcı H Özmen Ö Taner R Temel EN Garlı S Cannabidiol ameliorates lipopolysaccharide-induced cardiovascular toxicity by its antioxidant and anti-inflammatory activity via regulating IL-6, Hif1α, STAT3, eNOS pathway Mol Biol Rep 2024 51 1 825 10.1007/s11033-024-09772-3 39023749 Tepebaşı MY, Aşcı H, Özmen Ö, Taner R, Temel EN, Garlı S. Cannabidiol ameliorates lipopolysaccharide-induced cardiovascular toxicity by its antioxidant and anti-inflammatory activity via regulating IL-6, Hif1α, STAT3, eNOS pathway. Mol Biol Rep. 2024;51(1):825. 39023749 10.1007/s11033-024-09772-3 Tomaszewska-Zaremba D Gajewska A Misztal T Anti-Inflammatory effects of cannabinoids in therapy of neurodegenerative disorders and inflammatory diseases of the CNS Int J Mol Sci 2025 26 14 6570 10.3390/ijms26146570 40724820 PMC12294762 Tomaszewska-Zaremba D, Gajewska A, Misztal T. Anti-Inflammatory effects of cannabinoids in therapy of neurodegenerative disorders and inflammatory diseases of the CNS. Int J Mol Sci. 2025;26(14):6570. 40724820 10.3390/ijms26146570 PMC12294762 Tyryshkin A Gorgun FM Fattah EA Mazumdar T Pandit L Zeng S Src kinase-mediated phosphorylation stabilizes inducible nitric-oxide synthase in normal cells and cancer cells J Biol Chem 2010 285 1 784 92 10.1074/jbc.M109.055038 19875457 PMC2804227 Tyryshkin A, Gorgun FM, Fattah EA, Mazumdar T, Pandit L, Zeng S, et al. Src kinase-mediated phosphorylation stabilizes inducible nitric-oxide synthase in normal cells and cancer cells. J Biol Chem. 2010;285(1):784–92. 19875457 10.1074/jbc.M109.055038 PMC2804227 Vadizadeh A Salehcheh M Kalantar H Khorsandi L Rashno M Mahdavinia M Cannabidiol attenuates arsenic-induced nephrotoxicity via the NOX4 and NF-κB pathways in mice Res Pharm Sci 2024 19 4 447 58 10.4103/RPS.RPS_51_24 39399730 PMC11468165 Vadizadeh A, Salehcheh M, Kalantar H, Khorsandi L, Rashno M, Mahdavinia M. Cannabidiol attenuates arsenic-induced nephrotoxicity via the NOX4 and NF-κB pathways in mice. Res Pharm Sci. 2024;19(4):447–58. 39399730 10.4103/RPS.RPS_51_24 PMC11468165 Vass Z Shenker-Horváth K Bányai B Vető KN Török V Gém JB Investigating the role of cannabinoid type 1 receptors in vascular function and remodeling in a hypercholesterolemic mouse model with Low-Density Lipoprotein–Cannabinoid type 1 receptor double knockout animals Int J Mol Sci 2024 25 17 9537 10.3390/ijms25179537 39273484 PMC11395437 Vass Z, Shenker-Horváth K, Bányai B, Vető KN, Török V, Gém JB, et al. Investigating the role of cannabinoid type 1 receptors in vascular function and remodeling in a hypercholesterolemic mouse model with Low-Density Lipoprotein–Cannabinoid type 1 receptor double knockout animals. Int J Mol Sci. 2024;25(17):9537. 39273484 10.3390/ijms25179537 PMC11395437 Wang Y Xie Z Li C Wang Y Chen X Han J Effects of hemp seed oil and Cannabidiol on behavior and inflammation in depression model mice Sci Technol Food Ind 2021 42 9 327 33 Wang Y, Xie Z, Li C, Wang Y, Chen X, Han J. Effects of hemp seed oil and Cannabidiol on behavior and inflammation in depression model mice. Sci Technol Food Ind. 2021a;42(9):327–33. Wang F Li M Lin C Jin S Li H Lu Y Cannabidiol-dihydroartemisinin conjugates for ameliorating neuroinflammation with reduced cytotoxicity Bioorg Med Chem 2021 39 116131 10.1016/j.bmc.2021.116131 33852975 Wang F, Li M, Lin C, Jin S, Li H, Lu Y, et al. Cannabidiol-dihydroartemisinin conjugates for ameliorating neuroinflammation with reduced cytotoxicity. Bioorg Med Chem. 2021b;39:116131. 33852975 10.1016/j.bmc.2021.116131 Wang Y Ji X Wang X Sun M Li C Wu D The injectable hydrogel loading Cannabidiol to regulate macrophage polarization in vitro for the treatment of chronic enteritis J Appl Biomater Funct Mater 2024 22 22808000241289022 39385453 10.1177/22808000241289022 Wang Y, Ji X, Wang X, Sun M, Li C, Wu D. The injectable hydrogel loading Cannabidiol to regulate macrophage polarization in vitro for the treatment of chronic enteritis. J Appl Biomater Funct Mater. 2024;22:22808000241289022. 39385453 10.1177/22808000241289022 Wen Y, Wang Z, Zhang R, Zhu Y, Lin G, Li R et al. The antinociceptive activity and mechanism of action of cannabigerol. Biomed Pharmacotherapy. 2023;158. 10.1016/j.biopha.2022.114163 36916438 Yang H Park M Lee JH Kim B Moon CS Bae S New peripherally-restricted CB1 receptor antagonists, PMG-505-010 and – 013 ameliorate obesity-associated NAFLD and fibrosis Biomed Pharmacother 2024 180 117501 10.1016/j.biopha.2024.117501 39366030 Yang H, Park M, Lee JH, Kim B, Moon CS, Bae S, et al. New peripherally-restricted CB1 receptor antagonists, PMG-505-010 and – 013 ameliorate obesity-associated NAFLD and fibrosis. Biomed Pharmacother. 2024;180:117501. 39366030 10.1016/j.biopha.2024.117501 Yeisley DJ Arabiyat AS Hahn MS Cannabidiol-driven alterations to inflammatory protein landscape of lipopolysaccharide-activated macrophages in vitro May be mediated by autophagy and oxidative stress Cannabis Cannabinoid Res 2021 6 3 253 63 10.1089/can.2020.0109 33998893 PMC8217602 Yeisley DJ, Arabiyat AS, Hahn MS. Cannabidiol-driven alterations to inflammatory protein landscape of lipopolysaccharide-activated macrophages in vitro May be mediated by autophagy and oxidative stress. Cannabis Cannabinoid Res. 2021;6(3):253–63. 33998893 10.1089/can.2020.0109 PMC8217602 Yen DH Chen L-C Shen Y-C Chiu Y-C Ho I-C Lou Y-J Protein kinase A-dependent neuronal nitric oxide synthase activation mediates the enhancement of baroreflex response by adrenomedullin in the nucleus tractus solitarii of rats J Biomed Sci 2011 18 1 9 10.1186/1423-0127-18-32 21595896 PMC3115842 Yen DH, Chen L-C, Shen Y-C, Chiu Y-C, Ho I-C, Lou Y-J, et al. Protein kinase A-dependent neuronal nitric oxide synthase activation mediates the enhancement of baroreflex response by adrenomedullin in the nucleus tractus solitarii of rats. J Biomed Sci. 2011;18:1–9. 21595896 10.1186/1423-0127-18-32 PMC3115842 Zamanian MY Giménez-Llort L Nikbakhtzadeh M Kamiab Z Heidari M Bazmandegan G The therapeutic activities of metformin: focus on the Nrf2 signaling pathway and oxidative stress amelioration Curr Mol Pharmacol 2023 16 3 331 45 10.2174/1874467215666220620143655 35726417 Zamanian MY, Giménez-Llort L, Nikbakhtzadeh M, Kamiab Z, Heidari M, Bazmandegan G. The therapeutic activities of metformin: focus on the Nrf2 signaling pathway and oxidative stress amelioration. Curr Mol Pharmacol. 2023;16(3):331–45. 35726417 10.2174/1874467215666220620143655 Zhai Z Wang Z Wang L Chen S Ren H Wang D Relationship between inducible NOS single-nucleotide polymorphisms and hypertension in Han Chinese Herz 2018 43 5 461 5 10.1007/s00059-017-4591-0 28685250 Zhai Z, Wang Z, Wang L, Chen S, Ren H, Wang D. Relationship between inducible NOS single-nucleotide polymorphisms and hypertension in Han Chinese. Herz. 2018;43(5):461–5. 28685250 10.1007/s00059-017-4591-0 Zhou Q Du Z Qu K Shen Y Jiang Y Zhu H Adverse events of epidiolex: A real-world drug safety surveillance study based on the FDA adverse event reporting system (FAERS) database Asian J Psychiatry 2023 90 103828 10.1016/j.ajp.2023.103828 37949044 Zhou Q, Du Z, Qu K, Shen Y, Jiang Y, Zhu H, et al. Adverse events of epidiolex: A real-world drug safety surveillance study based on the FDA adverse event reporting system (FAERS) database. Asian J Psychiatry. 2023;90:103828. 10.1016/j.ajp.2023.103828 37949044 Zorrilla E Della Pietra A Russo AF Interplay between cannabinoids and the neuroimmune system in migraine J Headache Pain 2024 25 1 178 10.1186/s10194-024-01883-3 39407099 PMC11481476 Zorrilla E, Della Pietra A, Russo AF. Interplay between cannabinoids and the neuroimmune system in migraine. J Headache Pain. 2024;25(1):178. 39407099 10.1186/s10194-024-01883-3 PMC11481476 Zou S Kumar U Cannabinoid receptors and the endocannabinoid system: signaling and function in the central nervous system Int J Mol Sci 2018 19 3 833 10.3390/ijms19030833 29533978 PMC5877694 Zou S, Kumar U. Cannabinoid receptors and the endocannabinoid system: signaling and function in the central nervous system. Int J Mol Sci. 2018;19(3):833. 29533978 10.3390/ijms19030833 PMC5877694 ",
  "metadata": {
    "Title of this paper": "Cannabinoid receptors and the endocannabinoid system: signaling and function in the central nervous system",
    "Journal it was published in:": "Journal of Cannabis Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482008/"
  }
}