{
  "title": "Paper_88",
  "abstract": "pmc Virchows Arch Virchows Arch 365 springeropen Virchows Archiv 0945-6317 1432-2307 pmc-is-collection-domain yes pmc-collection-title Springer PMC12488782 PMC12488782.1 12488782 12488782 39810000 10.1007/s00428-024-04013-1 4013 1 Original Article Tumor-infiltrating plasma cells are a prognostic factor in penile squamous cell carcinoma Stenzel P. J. pstenzel@med.uni-frankfurt.de 1 2 Thomas A. 3 Schindeldecker M. 1 Macher-Goeppinger S. 1 Porubsky S. 1 Haferkamp A. 3 Tsaur I. 4 Roth W. 1 Tagscherer K. E. 1 1 https://ror.org/02cqe8q68 Institute of Pathology, University Medical Center Mainz, 2 https://ror.org/00q1fsf04 grid.410607.4 Dr. Senckenberg Institute of Pathology, University Medical Center Frankfurt, 3 https://ror.org/00q1fsf04 grid.410607.4 Department of Urology, University Medical Center Mainz, 4 https://ror.org/00pjgxh97 grid.411544.1 0000 0001 0196 8249 Department of Urology, University Hospital Tübingen, 14 1 2025 2025 487 3 498144 687 699 11 7 2024 11 12 2024 13 12 2024 14 01 2025 03 10 2025 03 10 2025 © The Author(s) 2024 2024 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Penile cancer (PeCa) is a rare disease with poor prognosis in the metastatic stage. Neither effective adjuvant nor palliative therapeutic options are available. Research efforts in this field have so far failed to establish robust predictors of survival. To identify prognostic targets in PeCa, the current project focused on characterizing the tumor microenvironment (TME). A study cohort of 93 men with PeCa was used for the construction of a tissue microarray and immunohistochemical staining for CD3, CD4, CD8, CD20, CD56, CD138, FoxP3, and PD-L1. The quantity and spatial distribution of tumor-infiltrating immune cells were analyzed using digital image analysis. PD-L1 staining of tumor and immune cells was manually scored (combined positivity score (CPS)). T cells, T helper cells, cytotoxic T cells (CTLs), and regulatory T cells were detected in > 90% of PeCa and B cells in 88%, plasma cells in 85%, and NK cells in 23%. Approximately 50% of the PeCa samples were PD-L1 positive. In the univariate survival analysis, high PD-L1 CPS, plasma cells, CTLs, and B cells were significantly associated with favorable overall survival (OS), and the latter two with adverse recurrence-free survival. In multivariate analysis, plasma cells remained a significant factor for favorable OS ( p Supplementary Information The online version contains supplementary material available at 10.1007/s00428-024-04013-1. Keywords Tumor microenvironment Tumor-infiltrating plasma cells Penile carcinoma Prognosis Immunotherapy Universitätsmedizin der Johannes Gutenberg-Universität Mainz (8974) Open Access funding enabled and organized by Projekt DEAL. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer-Verlag GmbH Germany, part of Springer Nature 2025 Introduction Penile cancer (PeCa) is a rare disease with 26,000 cases per year worldwide [ 1 2 3 4 4 Since PeCa is a disease with a low incidence, evidence for optimal treatment strategies in different therapy settings is limited, and there is an urgent need for novel treatment regimens as well as reliable predictive and prognostic parameters. HPV status is important for risk stratification since patients with HPV-associated tumors usually exhibit a better prognosis and might benefit from HPV vaccination in combination with immune checkpoint inhibitors (ICIs) [ 5 5 7 There are limited data on the impact of tumor-infiltrating immune cells and PD-L1 on the prognosis of patients with PeCa. Thus, the aim of this study was to analyze the content and spatial distribution of immune cells in the TME of the PeCa cohort of the University Medical Center Mainz, and to correlate the density of these cells with clinical outcomes and clinicopathological parameters. Methods and materials Study cohort The study cohort comprised 93 men with non-metastatic invasive squamous cell carcinoma of the penis who underwent surgical treatment at the Department of Urology of the University Medical Center of the Johannes Gutenberg University Mainz between 1996 and 2019, as previously described [ 6 7 8 6 7 6 7 Tissue microarray construction and immunohistochemistry All patients with available formalin-fixed paraffin-embedded PeCa tissue samples were included, and the tissue microarray (TMA) was constructed as previously described [ 6 EPR19759 Digital image analysis All slides were digitalized using a digital whole-slide scanner (Nanozoomer, Hamamatsu Photonics, Hamamatsu, Japan) and analyzed using the HALO® platform (Indica Labs, Corrales, NM, USA). Digital image analysis was performed as previously described [ 9 11 2 2 2 PD-L1 scoring PD-L1 expression was manually scored. The tumor proportion score (TPS) is the proportion of PD-L1 positive tumor cells to total tumor cells, the combined positivity score (CPS) is the proportion of PD-L1 positive tumor cells and associated immune cells to total tumor cells, and the immune cell score (IC) is the proportion of the area of positive immune cells to the total tumor area. Statistical analysis For dichotomization, the Charité Cutoff finder [ 12 6 7 Results Patient collective A total of 93 patients with PeCa with a mean age at diagnosis of 65.0 years were included in the study cohort (Table 1 1 Table 1 Patient cohort N % Cohort size 93 100 Age at diagnosis ≤ 65 years 44 47.3 > 65 years 49 52.7 Primary tumor surgery Circumcision 8 8.6 Tumor excision 4 4.3 Partial penectomy 55 59.1 Total penectomy 25 26.9 Missing 1 1.1 Histologic subtype Usual type 74 79.6 Basaloid 15 16.1 Missing 4 4.3 Tumor grading G1/G2 70 75.3 G3/G4 21 22.6 Missing 2 2.2 Tumor stage pT1 35 37.6 pT2 27 29.0 pT3 27 29.0 Missing 4 4.3 Lymph node metastasis N0/Nx 60 64.5 N1 7 7.5 N2 6 6.5 N3 9 9.7 Missing 11 11.8 Recurrence status No 78 83.9 Yes 15 16.1 Subsequent therapy None 67 72 CTX 16 17.2 Radiation 1 1.1 Unknown 6 6.5 CTX and radiation 2 2.2 Missing 1 1.1 HPV infection Negative 68 73.1 Positive 24 25.8 Missing 1 1.1 Tumor-dependent death No 81 87.1 Yes 12 12.9 N CTX Immunohistochemistry of tumor-infiltrating immune cells and PD-L1 Cytotoxic T cells (CTL) were present in all analyzed PeCa samples (91/91 analyzed tumors). Regulatory T cells (Tregs) were detected in 88 PeCa (88/93 analyzed tumors), T cells in 87 PeCa (87/89 analyzed tumors), T helper cells (Th cells) in 82 PeCa (82/89 analyzed tumors), B cells in 80 PeCa (80/91 analyzed tumors), plasma cells in 78 PeCa (78/92 analyzed tumors), and natural killer cells (NK cells) in 21 PeCa (21/92 analyzed tumors). In the spatial analysis, there were higher mean and median densities of all analyzed immune cell subtypes in the tumor-associated stroma than in the tumor parenchyma, except for NK cells. Approximately one-third of all analyzed PeCa samples were positive for PD-L1, as assessed by the TPS (31/90 analyzed tumors) or the IC (33/90 analyzed tumors). Approximately half of the tumors were PD-L1 positive using the CPS (48/90 analyzed tumors). The results are presented in Table 2 Table 2 PD-L1 scores and densities and distribution of immune cells in penile cancer Immune cells PD-L1 score/compartment Total N NA N Pos. cases N Min Median Max Mean STD TPS 90 3 31 (34.4) 0 0 80.0 5.4 13.5 PD-L1 CPS 90 3 48 (53.3) 0 0.5 90.0 6.5 14.0 IC 90 3 33 (36.7) 0 0 10.0 0.8 1.8 Total 88 5 87 (98.9) 0 729.758 4634.22 1036.7 1028.4 T cells Tumor 88 5 87 (98.9) 0 496.381 3398.86 788.25 791.64 (CD3) Stroma 88 5 87 (98.9) 0 1502.46 5033.41 1805.2 1400.6 Total 89 4 82 (92.1) 0 70.6173 4049.4 218.93 489.9 T helper cells Tumor 89 4 82 (92.1) 0 40.2607 1379.91 109.64 186.17 (CD4) Stroma 88 5 79 (89.8) 0 131.99 4849.17 448.86 744.71 Total 91 2 91 (100) 5.9 283.5 3221.4 505.7 620.7 CTL Tumor 90 3 90 (100) 5.1 146.6 3601.5 398.9 616.4 (CD8) Stroma 88 5 88 (100) 10.5 508.0 2964.4 750.2 727.2 Total 91 2 80 (87.9) 0 20.7 1144.8 107.5 214.2 B cells Tumor 93 2 65 (69.9) 0 2.4 619.4 38.4 116.9 (CD20) Stroma 89 4 73 (82.0) 0 58.9 3052.7 238.7 494.6 Total 92 1 21 (22.8) 0 0 323.2 11.7 47.9 NK cells Tumor 93 0 16 (17.2) 0 0 468.8 14.3 65.5 (CD56) Stroma 91 2 17 (18.7) 0 0 512.4 13.1 58.1 Total 92 1 78 (84.8) 0 24.3 1829.4 157.1 316.5 Plasma cells Tumor 91 2 25 (27.5) 0 0 208.4 4.3 22.5 (CD138) Stroma 87 6 73 (83.9) 0 112.3 5687.5 671.4 1112.1 Total 93 0 88 (94.6) 0 22.2 628.1 57.6 104.0 Treg Tumor 93 0 83 (89.2) 0 9.3 934.8 33.4 104.6 (FoxP3) Stroma 93 0 86 (92.5) 0 76.4 2155.3 199.2 324.8 N NA Pos Min Max STD PD-L1 CTL NK cells Treg TPS CPS IC Association of tumor-infiltrating immune cells and PD-L1 with clinicopathological parameters Patients who died from any cause had lower densities of CTL and tumor-infiltrating B cells (TIL-B) ( p p p p p p p p p p p p p p 3 Table 3 Association of tumor infiltrating immune cells with clinical parameters  N Mean ± STD N Mean Overall survival status Alive Deceased p PDL1 CPS 61 7.57 ± 14.1 26 4.75 ± 14.44 < 0.05 PDL1 IC 61 1.03 ± 2.1 26 0.15 ± 0.34 < 0.05 CD8 total 60 612.96 ± 712.79 28 310.04 ± 306.2 < 0.05 CD20 tumor 59 55.03 ± 142.32 29 7.47 ± 16.92 < 0.05 Disease relapse Absent  Present CD4 stroma 70 451.56 ± 744.92 13 797.5 ± 798.04 < 0.05 CD8 stroma 71 706.93 ± 693.24 14 1080.46 ± 866.32 < 0.05 Lymph node metastasis Absent  Present PDL1 CPS 55 7.95 ± 14.34 22 4.91 ± 15.49 < 0.05 PDL1 IC 55 1.11 ± 2.19 22 0.12 ± 0.28 < 0.05 Distant metastasis Absent  Present CD20 tumor 24 30.41 ± 119.98 4 0.38 ± 0.44 < 0.05 HPV Absent  Present PDL1 IC 66 0.7 ± 1.89 21 0.99 ± 1.53 < 0.05 CD4 total 63 233.56 ± 544.66 21 270.99 ± 344.21 < 0.05 CD4 tumor 63 87.14 ± 189.83 21 157 ± 172.9 < 0.05 CD56 tumor 67 12.61 ± 67.15 22 21.85 ± 67.29 < 0.05 CD56 total 67 8.78 ± 40 22 22.11 ± 68.95 < 0.05 Lichen sclerosus Absent  Present CD56 stroma 84 12.88 ± 60.05 4 28.39 ± 29.81 < 0.01 CD56 total 84 11.67 ± 49.88 5 18.91 ± 20.08 < 0.01 FoxP3 stroma 84 182.09 ± 323.5 5 446.8 ± 330.44 < 0.05 Balanoposthitis Absent  Present CD20 tumor 79 27.52 ± 85.28 9 143.22 ± 262.54 < 0.05 Adipositas Absent  Present CD20 total 75 100.97 ± 218.82 13 150.84 ± 210.25 < 0.05 CD20 tumor 75 23.79 ± 79.84 13 129.17 ± 229.51 < 0.05 FoxP3 tumor 76 20.28 ± 41.12 13 41.1 ± 60.98 < 0.05 Smoking Absent  Present CD56 stroma 65 18.37 ± 68.14 23 0.05 ± 0.22 < 0.05 CD56 total 66 16.23 ± 56.02 23 0.16 ± 0.76 < 0.05 FoxP3 stroma 66 235.55 ± 365.41 23 86.25 ± 133.87 < 0.01 FoxP3 total 66 58.99 ± 96.57 23 26.9 ± 45.25 < 0.05 Diabetes mellitus Absent  Present PDL1 TPS 70 6.73 ± 14.97 17 0.88 ± 2.64 < 0.05 CD3 total 68 1240.55 ± 1066.88 15 647.92 ± 525.95 < 0.05 N STD Survival analysis The patient cohort was dichotomized into PeCa with low and high immune cell infiltration, or PD-L1 expression (Fig. 1 1 2 2 2 p p p p p p 1 p p p p p p p p p 2 p p p p 1 p p 4 p 4 4 Fig. 1 Tumor-infiltrating immune cells and PD-L1 in penile cancer (PeCa). All samples of the patient cohort were immunohistochemically stained for PD-L1 expression, CD3 for detection of T cells, CD4 for T helper cells, CD8 for cytotoxic T cells, FoxP3 for regulatory T cells, CD20 for B cells, CD138 for plasma cells, and CD56 for natural killer cells. The patient cohort was then dichotomized into tumors with low or high immune cell infiltrate or PD-L1 score, respectively. Scale bar represents 500 µm Fig. 2 Survival curves of tumor infiltrating immune cells and PD-L1 combined positivity score (CPS) for patients with penile cancer. The densities of CD8 + cytotoxic T cells (CTL), CD20 + B cells, CD138 + plasma cells in the tumor microenvironment, and the PD-L1 CPS were quantified for every patient and dichotomized into low and high levels. The survival curves for A B Table 4 Multivariate survival analysis N OS N RFS N DSS HR CI (95%) p HR CI (95%) p HR CI (95%) p Tumor grading G3/G4 vs. G1/G2 18 vs. 58 0.8 0.3–2.2 0.7 17 vs. 58 2.2 0.5–9.9 0.3 18 vs. 61 0.5 0.1–2.4 0.4 Tumor stage T3 vs. T1/T2 25 vs. 51 0.3 0.1–1.2 0.1 24 vs. 51 0.3 0.1–1.8 0.2 25 vs. 54 0.2 0.03–1.8 0.2 Lymph node metastasis pres. vs. abs 22 vs. 54 5.8 1.8–18.3 0.003 22 vs. 53 1 0.2–4.9 0.9 22 vs. 57 7.6 1.8–31.5 0.005 PD-L1 CPS High vs. low 28 vs. 48 0.6 0.2–1.9 0.4 NA NA NA NA NA NA NA NA CD8 total High vs. low 36 vs. 40 0.7 0.2–1.9 0.4 32 vs. 43 2.7 0.6–12.3 0.2 NA NA NA NA CD20 total High vs. low 15 vs. 61 0.2 0.02–1.4 0.1 24 vs. 51 1.5 0.3–7.3 0.6 NA NA NA NA CD138 total High vs. low 63 vs. 13 0.3 0.1–0.95 0.04 NA NA NA NA NA NA NA NA CD20 tumor High vs. low NA NA NA NA NA NA NA NA 42 vs. 37 0.4 0.1–1.8 0.2 CD4 total High vs. low NA NA NA NA 35 vs. 40 3.9 0.7–21.9 0.1 NA NA NA NA OS RFS DSS HR N CI pres abs CPS NA Discussion The present study analyzed the prognostic impact of tumor-infiltrating immune cells and PD-L1 expression in patients with PeCa. To this end, tumor-infiltrating immune cells in the tumor parenchyma and associated stroma and PD-L1 status (TPS, CPS, IC) were quantified, and the results were correlated with patient survival and clinicopathological parameters. The main finding of this study was that high densities of plasma cells were associated with favorable OS (70% reduction in mortality risk) for patients with PeCa in the multivariate survival analysis (Table 4 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 Next to a high infiltration of plasma cells, high densities of CTL and TIL-B were also prognostic for favorable OS and in the case of TIL-B and CTL also for adverse RFS in the univariate analysis (Fig. 2 1 4 2 16 For further interpretation of the PD-L1 results, a literature search on PD-L1 analyses on PeCa was undertaken and revealed a heterogeneous landscape of methodologies, used PD-L1 antibodies, definitions of PD-L1 positivity and PD-L1 cutoffs [ 28 39 5 5 2 4 36 37 Table 5 Literature on PD-L1 in penile carcinoma 1st author Year of publication Number of patients Methodology PD-L1 antibody PD-L1 analysis PD-L1 cutoff PD-L1 positivity rate Survival PD-L1 prognostic value Udager [ 28 2016 37 WSI Merck (clone 5H1) Membranous staining of tumor cells, presence or absence of PD-L1 staining in TIL TPS > 5% TIL > 5% 62.20% CSS High PD-L1 significantly associated with adverse survival (univariate analysis) multivariate analysis not tested Deng [ 29 2017 116 WSI Cell Signaling (clone E1L3N) Membranous staining of tumors cells and TIL TPS > 5% TIL > 5% 53.4% tumor cells 57% TIL CSS High PD-L1 significantly associated with adverse survival (univariate analysis) multivariate analysis ns Cocks [ 30 2017 53 TMA Cell Signaling Any membranous positivity of tumor cells or immune cells TPS > 0% TIL > 0% 40% tumor cells 26% TIL OS, CSS ns Ottenhof [ 31 2018 213 WSI Cell Signaling Membranous staining of tumor cells and immune cells TPS > 1%, diffuse vs. marginal staining; TIL > 0% hrHPV − : 49.4% tumor cells, 72.2% TIL hrHPV + : 32.7% tumor cells, 65.4% TIL CSS High PD-L1 (diffuse) significantly associated with adverse survival (multivariate analysis) Davidson [ 32 2018 222 TMA Abcam (clone 28.8) Spring Biosciences (clone SP142) Specific membranous and cytoplasmic staining of tumor cells and TIL TPS and TIL 1 + : < 5%; 2 + : > 5- < 50%; 3 + : > 50% 28.8: 32.1% tumor cells, 64.2% TIL SP142: 7.3% tumor cells, 45% TIL CSS High PD-L1 significantly associated with adverse survival (multivariate analysis) DeBacco [ 33 2019 35 WSI Zeta Corporation (clone ZR3) Specific membranous and cytoplasmic staining of tumor cells TPS > 1% 51.40% OS ns Chu [ 34 2020 178 WSI Cell signaling Membranous staining of tumor cells and immune cells TPS > 1%, diffuse vs. marginal staining; TIL > 0% 67.4% tumor cells 54.8% TIL CSS High PD-L1 (diffuse) significantly associated with adverse survival (univariate analysis) multivariate analysis not tested Hu [ 35 2020 84 WSI Abcam H Score 118.79 69% CSS High PD-L1 significantly associated with adverse survival (univariate analysis) multivariate analysis ns Müller [ 36 2022 60 WSI Zeta Corporation TPS, CPS, IC 0; > 0–10; > 10 TPS 87% IC 83% OS ns Lobo [ 37 2023 134 WSI Cell signaling CPS < 1; 1–19; > 20 57% OS, CSS High PD-L1 significantly associated with adverse survival (univariate analysis) multivariate analysis not tested Sangkhamanon [ 38 2023 43 WSI Ventana (clone SP263) Membranous staining of tumor cells and immune cells TPS ≥ 25% or TIL > 1% and PD-L1 +  ≥ 25% or TIL = 1% and PD-L1 +  = 100% 18.60% OS ns Hrudka [ 39 2023 165 WSI Ventana TPS < 1%; 1–49%; ≥ 50% 68% OS, CSS ns Present study 93 TMA Abcam TPS, CPS, IC OS: TPS 1%, CPS 3, IC 1% CSS: TPS 0.5%, CPS 6, IC 1% RFS: TPS 2.5%, CPS 15, IC 0.3% TPS 34.4% CPS 53.3% IC 36.7% OS, CSS, RFS High PD-L1 positivity (CPS) significantly associated with better OS (univariate analysis) multivariate ns WSI TMA TPS TIL CPS IC hrHPV CSS OS RFS ns In this study, 25% of the patients were HPV-positive, and HPV infection was not a significant factor for patient outcomes. However, HPV-positive PeCa were associated with a significantly higher infiltration of NK cells and a significantly higher PD-L1 IC score than HPV-negative tumors (Table 3 40 40 41 1 3 3 42 43 3 The limitations of this study are its retrospective design, limited sample size, varying duration of FFPE tissue storage, and a bias in the analysis on the prognostic value for DSS through the low number of tumor-specific deaths in this study cohort. Conclusion In summary, in the current study, plasma cells provide superior information on the prognosis of patients with PeCa compared to standard prognostic factors, such as tumor stage or grade. These findings should be validated in further detail using larger patient cohorts. In general, research on the TME of PeCa should focus on plasma cells and TIL-B with respect to response prediction to immunotherapy. Supplementary Information Below is the link to the electronic supplementary material. Supplementary file1 (DOCX 30 KB) Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements We thank Silke Mitschke and Bonny Adami for their expert technical assistance. This project was supported by the Tissue Bank of the University Medical Center Mainz. Author contribution Conception and design: Stenzel, PJ; Thomas, A; Macher-Goeppinger, S; Porubsky, S; Haferkamp, A; Tsaur, I; Roth, W; Tagscherer, KE. Development of methodology: Stenzel, PJ; Macher-Goeppinger, S; Porubsky, S; Roth, W; Tagscherer, KE. Acquisition of data (provided animals, acquired and managed patients, provided facilities, etc.): Stenzel, PJ; Thomas, A; Haferkamp, A; Tsaur, I; Roth, W; Tagscherer, KE. Analysis and interpretation of data (e.g., statistical analysis, biostatistics, computational analysis): Stenzel, PJ; Schindeldecker, M; Tagscherer, KE. Writing, review, and/or revision of the manuscript: Stenzel, PJ; Thomas, A; Schindeldecker, M; Macher-Goeppinger, S; Porubsky, S; Haferkamp, A; Tsaur, I; Roth, W; Tagscherer, KE. Administrative, technical, or material support (i.e., reporting or organizing data, constructing databases): Stenzel, PJ; Thomas, A; Schindeldecker, M; Macher-Goeppinger, S; Porubsky, S; Haferkam, A; Tsaur, I; Roth, W; Tagscherer, KE. Study supervision: Tsaur, I; Roth, W; Tagscherer, KE. Funding Open Access funding enabled and organized by Projekt DEAL. Data availability All data generated or analyzed during this study are included in this article. Further enquiries can be directed to the corresponding author. Declarations Ethics approval This study protocol was approved by the ethics approval for the Tissue Biobank, University Medical Center Mainz (ethics approval: 837.360.16 (10679); date of approval: 2 October 2015). Conflict of interest The authors declare no competing interests. References 1. Chadha J, Chahoud J, Spiess PE (2022) An update on treatment of penile cancer. Ther Adv Med Oncol 14 10.1177/17588359221127254 PMC9511530 36172172 2. Giona S The epidemiology of penile cancer. In: Barber N, Ali A, editors Urologic Cancers [Internet] Brisbane (AU): Exon Publications; 2022 Sep 12 Chapter 11 36343135 3. Brouwer OR Albersen M Parnham A European Association of Urology-American Society of Clinical Oncology Collaborative Guideline on Penile Cancer: 2023 Update Eur Urol 2023 83 548 560 10.1016/j.eururo.2023.02.027 36906413 Brouwer OR, Albersen M, Parnham A et al (2023) European Association of Urology-American Society of Clinical Oncology Collaborative Guideline on Penile Cancer: 2023 Update. Eur Urol 83:548–560 36906413 10.1016/j.eururo.2023.02.027 4. White J Mason R Lawen T Therapeutic approaches to penile cancer: standards of care and recent developments Res Rep Urol 2023 15 165 174 37288454 10.2147/RRU.S387228 PMC10243351 White J, Mason R, Lawen T et al (2023) Therapeutic approaches to penile cancer: standards of care and recent developments. Res Rep Urol 15:165–174 37288454 10.2147/RRU.S387228 PMC10243351 5. Alencar AMJ Sonpavde G Emerging therapies in penile cancer Front Oncol 2022 12 910335 10.3389/fonc.2022.910335 35800050 PMC9253417 Alencar AMJ, Sonpavde G (2022) Emerging therapies in penile cancer. Front Oncol 12:910335 35800050 10.3389/fonc.2022.910335 PMC9253417 6. Thomas A Reetz S Stenzel P Assessment of PI3K/MTOR/AKT pathway elements to serve as biomarkers and therapeutic targets in penile cancer Cancers (Basel) 2021 13 2323 10.3390/cancers13102323 34066040 PMC8151654 Thomas A, Reetz S, Stenzel P et al (2021) Assessment of PI3K/MTOR/AKT pathway elements to serve as biomarkers and therapeutic targets in penile cancer. Cancers (Basel) 13:2323. 10.3390/cancers13102323 34066040 10.3390/cancers13102323 PMC8151654 7. Thomas A Slade KS Blaheta RA Value of c-MET and associated signaling elements for predicting outcomes and targeted therapy in penile cancer Cancers (Basel) 2022 14 1683 10.3390/cancers14071683 35406455 PMC8997038 Thomas A, Slade KS, Blaheta RA et al (2022) Value of c-MET and associated signaling elements for predicting outcomes and targeted therapy in penile cancer. Cancers (Basel) 14:1683. 10.3390/cancers14071683 35406455 10.3390/cancers14071683 PMC8997038 8. Brierley J, Gospodarowicz M, Wittekind C TNM classification of malignant tumours, 8th Edition 2017/2020 9. Stenzel PJ Schindeldecker M Seidmann L CD15 is a risk predictor and a novel target in clear cell renal cell carcinoma Pathobiology 2023 91 219 229 10.1159/000535201 37963432 PMC11151972 Stenzel PJ, Schindeldecker M, Seidmann L et al (2023) CD15 is a risk predictor and a novel target in clear cell renal cell carcinoma. Pathobiology 91:219–229. 10.1159/000535201 37963432 10.1159/000535201 PMC11151972 10. Stenzel PJ Hörner N Foersch S Nivolumab reduces PD1 expression and alters density and proliferation of tumor infiltrating immune cells in a tissue slice culture model of renal cell carcinoma Cancers (Basel) 2021 13 4511 10.3390/cancers13184511 34572738 PMC8471479 Stenzel PJ, Hörner N, Foersch S et al (2021) Nivolumab reduces PD1 expression and alters density and proliferation of tumor infiltrating immune cells in a tissue slice culture model of renal cell carcinoma. Cancers (Basel) 13:4511. 10.3390/cancers13184511 34572738 10.3390/cancers13184511 PMC8471479 11. Stenzel PJ Schindeldecker M Tagscherer KE Prognostic and predictive value of tumor-infiltrating leukocytes and of immune checkpoint molecules PD1 and PDL1 in clear cell renal cell carcinoma Transl Oncol 2020 13 336 345 10.1016/j.tranon.2019.11.002 31881506 PMC7031108 Stenzel PJ, Schindeldecker M, Tagscherer KE et al (2020) Prognostic and predictive value of tumor-infiltrating leukocytes and of immune checkpoint molecules PD1 and PDL1 in clear cell renal cell carcinoma. Transl Oncol 13:336–345. 10.1016/j.tranon.2019.11.002 31881506 10.1016/j.tranon.2019.11.002 PMC7031108 12. Budczies J Klauschen F Sinn BV Cutoff finder: a comprehensive and straightforward web application enabling rapid biomarker cutoff optimization PLoS ONE 2012 7 e51862 10.1371/journal.pone.0051862 23251644 PMC3522617 Budczies J, Klauschen F, Sinn BV et al (2012) Cutoff finder: a comprehensive and straightforward web application enabling rapid biomarker cutoff optimization. PLoS ONE 7:e51862. 10.1371/journal.pone.0051862 23251644 10.1371/journal.pone.0051862 PMC3522617 13. Delaloy C Schuh W Jäck HM Single-cell resolution of plasma cell fate programming in health and disease Eur J Immunol 2022 52 10 23 10.1002/eji.202149216 34694625 Delaloy C, Schuh W, Jäck HM et al (2022) Single-cell resolution of plasma cell fate programming in health and disease. Eur J Immunol 52:10–23 34694625 10.1002/eji.202149216 14. Laumont CM Banville AC Gilardi M Tumour-infiltrating B cells: immunological mechanisms, clinical impact and therapeutic opportunities Nat Rev Cancer 2022 22 414 430 10.1038/s41568-022-00466-1 35393541 PMC9678336 Laumont CM, Banville AC, Gilardi M et al (2022) Tumour-infiltrating B cells: immunological mechanisms, clinical impact and therapeutic opportunities. Nat Rev Cancer 22:414–430 35393541 10.1038/s41568-022-00466-1 PMC9678336 15. Wouters MCA Nelson BH Prognostic significance of tumor-infiltrating B cells and plasma cells in human cancer Clin Cancer Res 2018 24 6125 6135 10.1158/1078-0432.CCR-18-1481 30049748 Wouters MCA, Nelson BH (2018) Prognostic significance of tumor-infiltrating B cells and plasma cells in human cancer. Clin Cancer Res 24:6125–6135 30049748 10.1158/1078-0432.CCR-18-1481 16. Vassallo J Rodrigues AFF Campos AHJFM Pathologic and imunohistochemical characterization of tumoral inflammatory cell infiltrate in invasive penile squamous cell carcinomas: Fox-P3 expression is an independent predictor of recurrence Tumor Biology 2015 36 2509 2516 10.1007/s13277-014-2864-2 25557886 Vassallo J, Rodrigues AFF, Campos AHJFM et al (2015) Pathologic and imunohistochemical characterization of tumoral inflammatory cell infiltrate in invasive penile squamous cell carcinomas: Fox-P3 expression is an independent predictor of recurrence. Tumor Biology 36:2509–2516. 10.1007/s13277-014-2864-2 25557886 10.1007/s13277-014-2864-2 17. Zhang E, Ding C, Li S et al (2023) Roles and mechanisms of tumour-infiltrating B cells in human cancer: a new force in immunotherapy. Biomark Res 11 10.1186/s40364-023-00460-1 PMC9997025 36890557 18. Long F, Wang W, Li S et al (2023) The potential crosstalk between tumor and plasma cells and its association with clinical outcome and immunotherapy response in bladder cancer. J Transl Med 21. 10.1186/s12967-023-04151-1 10.1186/s12967-023-04151-1 PMC10155334 37138324 19. Rouvinov K, Mazor G, Kozlener E et al (2023) Cemiplimab as first line therapy in advanced penile squamous cell carcinoma: a real-world experience. J Pers Med 13. 10.3390/jpm13111623 10.3390/jpm13111623 PMC10672594 38003938 20. Apolo AB Nadal R Girardi DM Phase I study of cabozantinib and nivolumab alone or with ipilimumab for advanced or metastatic urothelial carcinoma and other genitourinary tumors J Clin Oncol 2020 38 3672 3684 10.1200/JCO.20 32915679 PMC7605393 Apolo AB, Nadal R, Girardi DM et al (2020) Phase I study of cabozantinib and nivolumab alone or with ipilimumab for advanced or metastatic urothelial carcinoma and other genitourinary tumors. J Clin Oncol 38:3672–3684. 10.1200/JCO.20 32915679 10.1200/JCO.20.01652 PMC7605393 21. Morris VK Jazaeri A Westin SN Phase II trial of MEDI0457 and durvalumab for patients with recurrent/metastatic human papillomavirus-associated cancers Oncologist 2023 28 618 623 10.1093/oncolo/oyad085 37104874 PMC10322132 Morris VK, Jazaeri A, Westin SN et al (2023) Phase II trial of MEDI0457 and durvalumab for patients with recurrent/metastatic human papillomavirus-associated cancers. Oncologist 28:618–623. 10.1093/oncolo/oyad085 37104874 10.1093/oncolo/oyad085 PMC10322132 22. De Vries HM Rafael TS Gil-Jimenez A Atezolizumab with or without radiotherapy for advanced squamous cell carcinoma of the penis (The PERICLES Study): a phase II trial J Clin Oncol 2023 41 4872 4880 10.1200/JCO.22.02894 37487169 De Vries HM, Rafael TS, Gil-Jimenez A et al (2023) Atezolizumab with or without radiotherapy for advanced squamous cell carcinoma of the penis (The PERICLES Study): a phase II trial. J Clin Oncol 41:4872–4880. 10.1200/JCO.22.02894 37487169 10.1200/JCO.22.02894 23. El Zarif T Nassar AH Pond GR Safety and efficacy of immune checkpoint inhibitors in advanced penile cancer: report from the Global Society of Rare Genitourinary Tumors J Natl Cancer Inst 2023 115 1605 1615 10.1093/jnci/djad155 37563779 PMC11032703 El Zarif T, Nassar AH, Pond GR et al (2023) Safety and efficacy of immune checkpoint inhibitors in advanced penile cancer: report from the Global Society of Rare Genitourinary Tumors. J Natl Cancer Inst 115:1605–1615. 10.1093/jnci/djad155 37563779 10.1093/jnci/djad155 PMC11032703 24. Necchi A Spiess PE Costa De Padua T Genomic profiles and clinical outcomes of penile squamous cell carcinoma with elevated tumor mutational burden JAMA Netw Open 2023 6 E2348002 10.1001/jamanetworkopen.2023.48002 38150257 PMC10753400 Necchi A, Spiess PE, Costa De Padua T et al (2023) Genomic profiles and clinical outcomes of penile squamous cell carcinoma with elevated tumor mutational burden. JAMA Netw Open 6:E2348002. 10.1001/jamanetworkopen.2023.48002 38150257 10.1001/jamanetworkopen.2023.48002 PMC10753400 25. Wei L Li Z Guo S Human papillomavirus infection affects treatment outcomes and the immune microenvironment in patients with advanced penile squamous cell carcinoma receiving programmed cell death protein 1 inhibitor–based combination therapy Cancer 2023 10.1002/cncr.35177 38157276 Wei L, Li Z, Guo S et al (2023) Human papillomavirus infection affects treatment outcomes and the immune microenvironment in patients with advanced penile squamous cell carcinoma receiving programmed cell death protein 1 inhibitor–based combination therapy. Cancer. 10.1002/cncr.35177 38157276 10.1002/cncr.35177 26. Fridman WH, Petitprez F, Meylan M et al (2021) B cells and cancer: to B or not to B? Journal of Experimental Medicine 218 10.1084/jem.20200851 PMC7754675 33601413 27. Schumacher TN Thommen DS Tertiary lymphoid structures in cancer Science 2022 1979 375 10.1126/science.abf9419 34990248 Schumacher TN, Thommen DS (2022) Tertiary lymphoid structures in cancer. Science 1979:375 10.1126/science.abf9419 34990248 28. Udager AM Liu TY Skala SL Frequent PD-L1 expression in primary and metastatic penile squamous cell carcinoma: potential opportunities for immunotherapeutic approaches Ann Oncol 2016 27 1706 1712 10.1093/annonc/mdw216 27217541 PMC4999561 Udager AM, Liu TY, Skala SL et al (2016) Frequent PD-L1 expression in primary and metastatic penile squamous cell carcinoma: potential opportunities for immunotherapeutic approaches. Ann Oncol 27:1706–1712. 10.1093/annonc/mdw216 27217541 10.1093/annonc/mdw216 PMC4999561 29. Deng C, Li Z, Guo S et al (2017) Tumor PD-L1 expression is correlated with increased TILs and poor prognosis in penile squamous cell carcinoma. Oncoimmunology 6. 10.1080/2162402X.2016.1269047 10.1080/2162402X.2016.1269047 PMC5353932 28344882 30. Cocks M Taheri D Ball MW Immune-checkpoint status in penile squamous cell carcinoma: a North American cohort Hum Pathol 2017 59 55 61 10.1016/j.humpath.2016.09.003 27663086 Cocks M, Taheri D, Ball MW et al (2017) Immune-checkpoint status in penile squamous cell carcinoma: a North American cohort. Hum Pathol 59:55–61. 10.1016/j.humpath.2016.09.003 27663086 10.1016/j.humpath.2016.09.003 31. Ottenhof SR, Djajadiningrat RS, Thygesen HH et al (2018) The prognostic value of immune factors in the tumor microenvironment of penile squamous cell carcinoma. Front Immunol 9. 10.3389/fimmu.2018.01253 10.3389/fimmu.2018.01253 PMC6004546 29942303 32. Davidsson S Carlsson J Giunchi F PD-L1 expression in men with penile cancer and its association with clinical outcomes Eur Urol Oncol 2019 2 214 221 10.1016/j.euo.2018.07.010 31017099 Davidsson S, Carlsson J, Giunchi F et al (2019) PD-L1 expression in men with penile cancer and its association with clinical outcomes. Eur Urol Oncol 2:214–221. 10.1016/j.euo.2018.07.010 31017099 10.1016/j.euo.2018.07.010 33. De Bacco MW Carvalhal GF MacGregor B PD-L1 and p16 expression in penile squamous cell carcinoma from an endemic region Clin Genitourin Cancer 2020 18 e254 e259 10.1016/j.clgc.2019.10.014 32139302 De Bacco MW, Carvalhal GF, MacGregor B et al (2020) PD-L1 and p16 expression in penile squamous cell carcinoma from an endemic region. Clin Genitourin Cancer 18:e254–e259. 10.1016/j.clgc.2019.10.014 32139302 10.1016/j.clgc.2019.10.014 34. Chu C Yao K Lu J Immunophenotypes based on the tumor immune microenvironment allow for unsupervised penile cancer patient stratification Cancers (Basel) 2020 12 1 17 10.3390/cancers12071796 PMC7407624 32635549 Chu C, Yao K, Lu J et al (2020) Immunophenotypes based on the tumor immune microenvironment allow for unsupervised penile cancer patient stratification. Cancers (Basel) 12:1–17. 10.3390/cancers12071796 10.3390/cancers12071796 PMC7407624 32635549 35. Hu J Li H He T A nomogram incorporating PD-L1, NLR, and clinicopathologic features to predict inguinal lymph node metastasis in penile squamous cell carcinoma Urol Oncol: Semin Original Investig 2020 38 641.e19 641.e29 10.1016/j.urolonc.2020.04.015 32389428 Hu J, Li H, He T et al (2020) A nomogram incorporating PD-L1, NLR, and clinicopathologic features to predict inguinal lymph node metastasis in penile squamous cell carcinoma. Urol Oncol: Semin Original Investig 38:641.e19-641.e29. 10.1016/j.urolonc.2020.04.015 10.1016/j.urolonc.2020.04.015 32389428 36. Müller T Demes M Lehn A The peri- and intratumoral immune cell infiltrate and PD-L1 status in invasive squamous cell carcinomas of the penis Clin Transl Oncol 2022 24 331 341 10.1007/s12094-021-02694-7 34449004 PMC8794908 Müller T, Demes M, Lehn A et al (2022) The peri- and intratumoral immune cell infiltrate and PD-L1 status in invasive squamous cell carcinomas of the penis. Clin Transl Oncol 24:331–341. 10.1007/s12094-021-02694-7 34449004 10.1007/s12094-021-02694-7 PMC8794908 37. Lobo A, Mishra SK, Jha S, et al (2024) Evaluation of programmed cell death ligand 1 expression in a contemporary cohort of penile squamous cell carcinoma and its correlation with clinicopathologic and survival parameters: a study of 134 patients. In: American Journal of Clinical Pathology. pp 49–59 10.1093/ajcp/aqad107 37639681 38. Sangkhamanon S, Kotano N, Sirithanaphol W, et al (2023) Programmed death-ligand 1 expression in tumor cells and tumor-infiltrating lymphocytes are associated with depth of tumor invasion in penile cancer. Biomed Rep 19:. 10.3892/br.2023.1627 10.3892/br.2023.1627 PMC10265570 37324166 39. Hrudka J Hojný J Prouzová Z High tumour mutational burden is associated with strong PD-L1 expression, HPV negativity, and worse survival in penile squamous cell carcinoma: an analysis of 165 cases Pathology 2024 56 357 366 10.1016/j.pathol.2023.10.010 38161143 Hrudka J, Hojný J, Prouzová Z et al (2024) High tumour mutational burden is associated with strong PD-L1 expression, HPV negativity, and worse survival in penile squamous cell carcinoma: an analysis of 165 cases. Pathology 56:357–366. 10.1016/j.pathol.2023.10.010 38161143 10.1016/j.pathol.2023.10.010 40. Lohneis P Boral S Kaufmann AM Human papilloma virus status of penile squamous cell carcinoma is associated with differences in tumour-infiltrating T lymphocytes Virchows Arch 2015 466 323 331 10.1007/s00428-014-1713-4 25544615 Lohneis P, Boral S, Kaufmann AM et al (2015) Human papilloma virus status of penile squamous cell carcinoma is associated with differences in tumour-infiltrating T lymphocytes. Virchows Arch 466:323–331. 10.1007/s00428-014-1713-4 25544615 10.1007/s00428-014-1713-4 41. Keller BA Pastukhova E Lo B Molecular pathogenesis of penile squamous cell carcinoma: current understanding and potential treatment implications Arch Pathol Lab Med 2023 147 722 734 10.5858/arpa.2021-0592-RA 36136297 Keller BA, Pastukhova E, Lo B et al (2023) Molecular pathogenesis of penile squamous cell carcinoma: current understanding and potential treatment implications. Arch Pathol Lab Med 147:722–734 36136297 10.5858/arpa.2021-0592-RA 42. Ringel AE Drijvers JM Baker GJ Obesity shapes metabolism in the tumor microenvironment to suppress anti-tumor immunity Cell 2020 183 1848 1866.e26 10.1016/j.cell.2020.11.009 33301708 PMC8064125 Ringel AE, Drijvers JM, Baker GJ et al (2020) Obesity shapes metabolism in the tumor microenvironment to suppress anti-tumor immunity. Cell 183:1848-1866.e26. 10.1016/j.cell.2020.11.009 33301708 10.1016/j.cell.2020.11.009 PMC8064125 43. Frasca D, Romero M, Diaz A, Blomberg BB (2023) Obesity accelerates age defects in B cells, and weight loss improves B cell function. Immunity and Ageing 20. 10.1186/s12979-023-00361-9 10.1186/s12979-023-00361-9 PMC10351107 37460937 ",
  "metadata": {
    "Title of this paper": "Obesity shapes metabolism in the tumor microenvironment to suppress anti-tumor immunity",
    "Journal it was published in:": "Virchows Archiv",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488782/"
  }
}