{
  "title": "Paper_797",
  "abstract": "pmc Biomed Res Int Biomed Res Int 2029 bmri BMRI BioMed Research International 2314-6133 2314-6141 Wiley PMC12409818 PMC12409818.1 12409818 12409818 41031256 10.1155/bmri/7538031 BMRI7538031 1 Research Article Article Exploring the Impact of miR‐34b‐5p on BRD4 Gene Expression in Triple‐Negative Breast Cancer Cells Ibrahim Mohannad Abdulameer https://orcid.org/0009-0006-9380-1107  1 Jalali Hanieh https://orcid.org/0000-0002-8133-8729  1 jalali@khu.ac.ir Azarnia Mahnaz https://orcid.org/0000-0001-5426-9302  1 Li Yuan liyuanpumc@gmail.com   1 Department of Animal Biology Faculty of Biological Sciences Kharazmi University Tehran Iran khu.ac.ir 28 8 2025 2025 2025 479482 7538031 28 7 2025 12 1 2025 31 7 2025 28 08 2025 30 09 2025 01 10 2025 Copyright © 2025 Mohannad Abdulameer Ibrahim et al. BioMed Research International published by John Wiley & Sons Ltd. 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ The miR‐34 family is recognized for its crucial role as tumor suppressors, particularly through its interactions with oncogenic regulators such as Tumor Protein 53 (TP53). Bromodomain‐containing Protein 4 (BRD4) functions as a transcriptional regulator that enhances the expression of oncogenes. In triple‐negative breast cancer (TNBC), BRD4 is often found to be overexpressed and linked to poor clinical outcomes. This study is aimed at exploring the impact of miR‐34b on the sensitivity of TNBC cells to BRD4 inhibition, which may also affect TP53 expression. miR‐34b‐5p mimics and scrambled oligonucleotides were transfected into TP53‐mutant MDA‐MB‐231 and nonmutant MCF‐7 cell lines. The expression levels of miR‐34b, TP53, and BRD4 genes, along with the migration rates and sensitivity to the BRD4‐specific inhibitor JQ1, were compared between the miR‐34b overexpressing cells. The results showed that miR‐34b overexpression led to increased TP53 expression in MDA‐MB‐231 cells, while a reduction was observed in MCF‐7 cells. Consequently, BRD4 expression was significantly elevated in MDA‐MB‐231 cells, resulting in resistance to JQ1. The increase in BRD4 expression also correlated with higher migration rates compared to MCF‐7 cells. In conclusion, miR‐34b may have an oncogenic role by promoting the expression of BRD4 in TNBC cells. This finding aligns with prior reports indicating a negative correlation between miR‐34b levels and survival rates in patients with TNBC. These insights may provide new perspectives on the role of miR‐34b in the development and progression of TNBC. Keywords apoptosis breast cancer bromodomain-containing proteins microRNA pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.2 mode:remove_FC converted:28.08.2025  Ibrahim Mohannad Abdulameer Jalali Hanieh Azarnia Mahnaz Exploring the Impact of miR‐34b‐5p on BRD4 Gene Expression in Triple‐Negative Breast Cancer Cells BioMed Research International 2025 7538031 2025 10.1155/bmri/7538031  Academic Editor: 1. Introduction The miR‐34 family, which comprises miR‐34a, miR‐34b, and miR‐34c, plays a significant role as tumor suppressors in cancer [ 1 β β 2 3 4 5 6 TNBC is a highly aggressive tumor that accounts for 10%–20% of breast cancer cases and lacks targeted treatments [ 7 8 9 10 11 12 Bromodomain‐containing Protein 4 (BRD4), a member of the bromodomain and extraterminal (BET) family, is involved in transcriptional regulation and cell cycle progression [ 13 14 15 2. Materials and Method 2.1. Ethics Statements This study was conducted in accordance with the research ethics code IR.KHU.REC.1403.001, which was approved by the Research Ethics Committee of Kharazmi University. 2.2. Cell Culture MDA‐MB‐231 and MCF‐7, human breast cancer cell lines, were purchased from the Pasteur Institute (Iran) and cultured in T75‐cm 2 2 2.3. Transfection of Cells With miR‐34b‐5p Mimics and Scrambled Oligonucleotides miR‐34b‐5p mimic with sequence 5 ′ ′ 1 1 Table 1 The specific quantities of reagents utilized for cell transfection.  Culture vessels  Cell (×10  6 )  miR-34b-5p mimic ( μ  Scrambled oligonucleotides ( μ  DNA-fectamine ( μ 6 well 1.2 3 3 10 12 well 0.30 1.6 1.6 4 24 well 0.14 0.8 0.8 2 96 well 0.01 0.2 0.2 0.5 2.4. Determining the Cell Viability Using 3‐(4,5‐Dimethylthiazol‐2‐yl)‐2,5‐Diphenyltetrazolium Bromide (MTT) Assay The viability of cells after transfection or treatment was assessed using the MTT assay. Briefly, 16 h after transfection, the transfection media were replaced with culture media, and the cells were incubated for 48 h. For JQ1 treatment, cells were seeded in each well of 96‐well plates and exposed to 1, 5, 10, and 15 μ μ μ 2.5. Determining the Expression of miR‐34b‐5p Post Cell Transfection The quantitative reverse transcription–polymerase chain reaction (qRT‐PCR) technique was employed to evaluate the expression levels of miR‐34b‐5p in the transfected cells, as well as nontransfected cells as endogenous control. Specifically, MDA‐MB‐231 and MCF‐7 cells were transfected as described earlier. Forty‐eight hours posttransfection, the cells were washed with RNase‐free PBS, and total cellular RNA was extracted using TRIzol reagent (Thermo Fisher Scientific, United States). The stem‐loop qPCR approach was used for the identification and quantification of miRNA in the transfected cells. Briefly, the stem‐loop probe “stem‐loop Seq” was used to specifically capture miR‐34b‐5p and perform reverse transcription with RevertAid reverse transcriptase (Thermo Fisher Scientific, United States). The qRT‐PCR was performed using SYBR Green PCR Master Mix (Thermo Fisher Scientific, United States), adhering to the manufacturer’s guidelines. The qRT‐PCR cycling conditions were as follows: 94°C for 30 s, 60°C for 30 s, and 72°C for 30 s, with a total of 40 cycles. The reactions were processed and analyzed using the Rotor‐Gene Q Real‐Time PCR System (QIAGEN, Germany). U6 was used as an internal reference gene, and miR‐34b expression levels in transfected cells were reported relative to those in nontransfected cells. The primer sequences for the target and reference genes are detailed in Table 2 Table 2 Sequence of primers in qRT‐PCR analysis.  Name  Sequences (5 ′ -3 ′ ) Stem‐loop Seq GTCGTATCCAGTGCAGGGTCCGAGGTATTCGCACTGGATACGACCAATCAG U6 snRNA‐F GTGCTCGCTTCGGCAGC U6 snRNA‐R TATCCAGTGCAGGGTCCGA miR‐34b‐5p‐F AAGCGACCTAGGCAGTGTCATT miR‐34b‐5p‐R GTCGTATCCAGTGCAGGGTCC BRD4‐F CGCTATGTCACCTCCTGTTTGC BRD4‐R ACTCTGAGGACGAGAAGCCCTT TP53‐F CCTCAGCATCTTATCCGAGTGG TP53‐R TGGATGGTGGTACAGTCAGAGC c‐MYC‐F CCTGGTGCTCCATGAGGAGAC c‐MYC‐R CAGACTCTGACCTTTTGCCAGG B 2 GACCACTTACGTTCATTGACTCC B 2 CAGGGTTTCATCATACAGCCAT 2.6. Examining the Expression of BRD4, TP53, and c‐MYC Genes Using Real‐Time PCR The qRT‐PCR technique will be used to assess the expression levels of the BRD4, TP53, and c‐MYC genes in the MDA‐MB‐231 cell line, as well as the MCF‐7 cell line, following the 48 h post‐transfection. Nontransfected cells were used as controls in all steps. Briefly, the total RNA was extracted from cells and converted to cDNA; then, the qRT‐PCR was performed according to the protocol described in Section 2.4 − ΔΔ 2 2 2.7. Annexin V Assay Apoptosis was assessed using an annexin V‐FITC apoptosis detection kit (MabTag, Germany). MDA‐MB‐231 and MCF‐7 cell lines were cultured in a 6‐well plate and allowed to incubate for 24 h before transfection or treatment. Following this incubation period, transfection or treatment was carried out as described. After 48 h, the cells were harvested via trypsinization and resuspended in 90 μ μ μ 2.8. Cell Migration Assay MDA‐MB‐231 and MCF‐7 cell lines transfected with miR‐34b were cultured in 24‐well plates. Subsequently, a sterile tip was used to apply pressure to the cell monolayer, creating a clear line. The cells were then washed three times with PBS to remove detached cells. Cell migration was monitored over 48‐h period, during which photographs of each well within a defined area were taken using a camera adapted for use with an inverted microscope. 2.9. Statistical Analysis All experiments were performed in triplicate or more. Statistical analyses were conducted using GraphPad Prism 9.5.1 (GraphPad Software Inc., La Jolla, California, United States). Two‐ or one‐way ANOVA with Tukey’s post hoc test was applied, considering p 3. Results 3.1. Expression of miR‐34b in Transfected Cells Analysis of the green fluorescent protein expression using flow cytometry revealed a transfection efficiency of over 90% (Figure 1a,b 1c Figure 1 Assessment of transfection efficiency and miR‐34b expression in transfected cells. (a) Representative image of green fluorescent emission from fluorescein oligonucleotide‐transfected cells. (b) Percentage of cells transfected with fluorescein oligonucleotide. (c) Expression level of miR‐34b in transfected cells. (a) (b) (c) 3.2. Cell Viability in miR‐34b‐Transfected Cells The results of the MTT assay and annexin analysis indicated that miR‐34b transfection led to a decrease in cell survival and an increase in cell death in both transfected cell lines. However, the reduction in cell population was significantly pronounced in the MCF‐7 line compared to the MDA‐MB‐231 line (Figure 2a 2b 2c 2d 2e Figure 2 Cell viability following miR‐34 transfection. (a) Percentage of viable cells 48 h posttransfection determined by MTT assay. (b) The percentage of viable and dead cells following miR‐34b transfection to MDA‐MB‐231 and MCF‐7 cells quantified using flow cytometry analysis. (c–e) Representative images of flow cytometry analysis showing Q1, necrotic; Q2, preapoptosis; Q3, late apoptosis; and Q4, live cells. (a) (b) (c) (d) (e) 3.3. Expression of BRD4, TP53, and c‐MYC Genes in miR‐34b‐Transfected Cells To examine the effects of miR‐34b sequence transfer on the expression of the TP53, BRD4, and c‐MYC genes, qRT‐PCR was performed. The results indicated that in the MDA‐MB‐231 cells, transfection led to a significant increase in the expression of both TP53 and BRD4 genes, while no change was observed in c‐MYC expression. In contrast, in the MCF‐7 cells, TP53 expression was relatively lowered, and there were no changes in the expression levels of BRD4 and c‐MYC (Figure 3 Figure 3 Gene expression following miR‐34b overexpression. Quantitative relative expression of BRD4, TP53, and c‐MYC genes in MDA‐MB‐231 and MCF‐7 cells 48 h after miR‐34b transfection. Data are presented as mean ± SD. ∗ p ∗∗ p ∗∗∗∗ p 3.4. Resistant to JQ1 Inhibitory Effect in miR‐34b‐Transfected Cells To determine the inhibitory dose of JQ1, an MTT toxicity assay was conducted, revealing that JQ1 effectively inhibited the growth of MDA‐MB‐231 cells within a concentration range of 1–15 μ 4a μ 4b,c 4d 4e 4f 4g 4h 4i Figure 4 Inhibitory function of JQ1 in miR‐34b‐transfected cells. (a) Determining the inhibitory concentration of JQ1 against MDA‐MB‐231 cells over a 24‐h period. (b, c) Comparison of BRD4 gene expression between miR‐34b‐transfected and nontransfected cells treated with JQ1. (d–g) Apoptosis rate in miR‐34b‐transfected and nontransfected cells treated with JQ1. (h, i) Comparison of the rate of viable and dead cells between miR‐34b‐transfected and nontransfected cells treated with JQ1. Data are presented as mean ± SD; different letters indicate significant difference at p (a) (b) (c) (d) (e) (f) (g) (h) (i) 3.5. Metastatic Function of miR‐34b‐Transfected Cells At 24 h posttransfection, miR‐34b significantly reduced cell migration in both cell lines. By 48 h, the inhibition of migration persisted in MCF‐7 cells; however, in MDA‐MB‐231 cells, this effect was lost as the scratch wound had fully healed. Notably, the combination of JQ1 and miR‐34b (Ago + JQ1) did not produce a greater inhibitory effect on migration of MDA‐MB‐231 cells compared to miR‐34b alone. In contrast, in MCF‐7 cells, this combination enhanced the migration inhibition. At 48 h, while JQ1 alone did not significantly affect migration compared to the control group in MCF‐7 cells, both the Ago + JQ1 and the miR‐34b groups showed a significant reduction in migration relative to the control group (Figure 5 Figure 5 Metastatic function of miR‐34b‐transfected cell. (a) Comparison of cell migration rates in MDA‐MB‐231 cells under various conditions, including miR‐34b transfection (Ago), JQ1 treatment, and the combination of both transfection and treatment (Ago + JQ1). (b) Comparison of cell migration rates in MCF‐7 cells under various conditions, including miR‐34b transfection (Ago), JQ1 treatment, and the combination of both transfection and treatment (Ago + JQ1). The lines represent the diameter of cell‐free areas measured on a micrometer scale (micrometer). Data are presented as mean ± SD. ∗ p ∗∗ p ∗∗∗ p ∗∗∗∗ p (a) (b) 4. Discussion In this study, we examined the role of miR‐34b in regulating BRD4 expression. Our findings revealed that in MDA‐MB‐231 cells, an increase in miR‐34b expression correlated with elevated BRD4 levels, leading to resistance against JQ1 treatment. Conversely, in the MCF‐7 cell line, while miR‐34b expression rose, BRD4 expression remained unaffected. These results can be understood from several perspectives. Members of the miR‐34 family are downstream targets of the transcription factor TP53, which directly binds to the 3 ′ 16 17 14 18 19 20 + + + 21 Bromodomain inhibitors including JQ1 represent a promising class of targeted therapies for breast cancer through disrupting the function of BET proteins (BRD2, BRD3, and BRD4) by preventing their binding to acetylated lysines on histones, leading to a transcriptional downregulation of key oncogenic genes driving tumor growth, cell survival, and metastasis [ 22 β 23 The results of the current study showed that JQ1 effectively inhibited BRD4 gene expression in both cell lines; however, no significant reduction was observed in BRD4 expression in MDA‐MB‐231 cells transfected with miR‐34b. Considering that BRD4 expression significantly increased in MDA‐MB‐231 cells following miR transfection, but remained unchanged in MCF‐7 cells, these findings suggest that JQ1 failed to reduce BRD4 expression in the transfected MDA cells. Given the crucial role of the BRD4 gene in cell migration, the effect of JQ1 on the migration rate of cells transfected with miR‐34b was evaluated. The results indicated that JQ1 exhibited a less inhibitory effect on migration in transfected MDA‐MB‐231 cells compared to transfected MCF‐7 cells, with transfected MCF‐7 cells showing almost no significant migration within 24 h. Meanwhile, treatment with JQ1 had no significant effect on inhibiting the migration of transfected MDA‐MB‐231 cells. This could be due to increased expression of BRD4 in transfected MDA‐MB‐231 cells. The inhibitory role of JQ1 on BRD4 causes it to act as a disconnecting agent on the BRD4/mutant TP53 axis and thus prevents the stimulating action of BRD4 on TP53, and this is how a previous study showed that JQ1 blocks BRD4’s ability to promote mutant TP53 gene expression. Consequently, treatment with JQ1 leads to decreases in mutant TP53 mRNA and protein levels. Along with cell proliferation, mutant TP53 increases the expression of EMT transcription factors such as Twist1 and Zeb1, thereby promoting metastasis [ 24 25 26 5. Conclusion The current study indicates that miR‐34b likely has distinct roles in regulating cellular processes based on BRD4 and TP53 status in breast cancer cells. While combining miR‐34b with JQ1, a BRD4 inhibitor, could present a therapeutic option for breast cancer patients, this approach warrants further investigation, particularly in the context of TNBC, where the oncogenic role of miR‐34b must be carefully considered. Disclosure All authors have read and agreed to the published version of the manuscript. Conflicts of Interest The authors declare no conflicts of interest. Author Contributions Conceptualization: M.A.I. and H.J.; methodology: M.A.I.; validation: M.A.I. and H.J.; formal analysis: M.A.I. and H.J.; investigation: M.A.I. and H.J.; resources: M.A.I.; data curation: H.J.; writing—original draft preparation: M.A.I. and H.J.; writing—review and editing: H.J.; supervision: H.J. and M.A.; project administration: H.J. Funding No funding was received for this manuscript. Acknowledgments The authors thank the Vice Chancellor for Research at Kharazmi University for supporting this project. Data Availability Statement Data are available upon request. 1 Fu J. Imani S. Wu M. Y. Wu R. C. MicroRNA-34 Family in Cancers: Role, Mechanism, and Therapeutic Potential Cancers 2023 15 10.3390/cancers15194723 PMC10571940 37835417 2 Zhang L. Liao Y. Tang L. MicroRNA-34 Family: A Potential Tumor Suppressor and Therapeutic Candidate in Cancer Journal of Experimental & Clinical Cancer Research 2019 38 10.1186/s13046-019-1059-5 PMC6360685 30717802 3 Hong D. S. Kang Y. K. Borad M. Sachdev J. Ejadi S. Lim H. Y. Brenner A. J. Park K. Lee J. L. Kim T. Y. Shin S. Phase 1 Study of MRX34, a Liposomal miR-34a Mimic, in Patients With Advanced Solid Tumours British Journal of Cancer 2020 122 1630 1637 10.1038/s41416-020-0802-1 32238921 PMC7251107 4 Imani S. Wu R. C. Fu J. MicroRNA-34 Family in Breast Cancer: From Research to Therapeutic Potential Journal of Cancer 2018 9 3765 3775 10.7150/jca.25576 30405848 PMC6216011 5 Svoboda M. Sana J. Redova M. Navratil J. Palacova M. Fabian P. Slaby O. Vyzula R. MiR-34b is Associated With Clinical Outcome in Triple-Negative Breast Cancer Patients Diagnostic Pathology 2012 7 10.1186/1746-1596-7-31 PMC3349474 22439831 6 Hiyoshi Y. Schetter A. J. Okayama H. Inamura K. Anami K. Nguyen G. H. Horikawa I. Hawkes J. E. Bowman E. D. Leung S. Y. Harris C. C. Increased MicroRNA-34b and -34c Predominantly Expressed in Stromal Tissues Is Associated With Poor Prognosis in Human Colon Cancer PLoS One 2015 10 e0124899 10.1371/journal.pone.0124899 25894979 PMC4404052 7 Zagami P. Carey L. A. Triple Negative Breast Cancer: Pitfalls and Progress Breast Cancer 2022 8 10.1038/s41523-022-00468-0 PMC9392735 35987766 8 Kennecke H. Yerushalmi R. Woods R. Cheang M. C. Voduc D. Speers C. H. Nielsen T. O. Gelmon K. Metastatic Behavior of Breast Cancer Subtypes Journal of Clinical Oncology 2010 28 3271 3277 10.1200/JCO.2009.25.9820 20498394 9 Shahbandi A. Nguyen H. D. Jackson J. G. TP53 Mutations and Outcomes in Breast Cancer: Reading Beyond the Headlines Trends in Cancer 2020 6 98 110 10.1016/j.trecan.2020.01.007 32061310 PMC7931175 10 Mitri Z. I. Abuhadra N. Goodyear S. M. Hobbs E. A. Kaempf A. Thompson A. M. Moulder S. L. Impact of TP53 Mutations in Triple Negative Breast Cancer Oncologia 2022 6 10.1038/s41698-022-00303-6 PMC9463132 36085319 11 Qayoom H. Haq B. U. Sofi S. Jan N. Jan A. Mir M. A. Targeting Mutant p53: a Key Player in Breast Cancer Pathogenesis and Beyond Cell Communication and Signaling 2024 22 10.1186/s12964-024-01863-9 PMC11466041 39390510 12 Canu V. Vaccarella S. Sacconi A. Pulito C. Goeman F. Pallocca M. Rutigliano D. Lev S. Strano S. Blandino G. Targeting of Mutant-p53 and MYC as a Novel Strategy to Inhibit Oncogenic SPAG5 Activity in Triple Negative Breast Cancer Cell Death & Disease 2024 15 10.1038/s41419-024-06987-x PMC11336084 39164278 13 Hu J. Pan D. Li G. Chen K. Hu X. Regulation of Programmed Cell Death by Brd4 Cell Death & Disease 2022 13 10.1038/s41419-022-05505-1 PMC9767942 36539410 14 Zhou J. X. Agborbesong E. Li L. X. Li X. Bromodomain Protein BRD4-Mediated Mutant p53 Transcription Promotes TNBC Progression International Journal of Molecular Sciences 2022 23 15163 10.3390/ijms232315163 36499487 PMC9738555 15 Pan W. Chai B. Li L. Lu Z. Ma Z. p53/MicroRNA-34 Axis in Cancer and Beyond Heliyon 2023 9 e15155 10.1016/j.heliyon.2023.e15155 37095919 PMC10121403 16 Capaccia C. Diverio S. Zampini D. Guelfi G. The Complex Interaction Between P53 and miRNAs Joins New Awareness in Physiological Stress Responses Cells 2022 11 10.3390/cells11101631 PMC9139524 35626668 17 Navarro F. Lieberman J. miR-34 and p53: New Insights Into a Complex Functional Relationship PLoS One 2015 10 e0132767 10.1371/journal.pone.0132767 26177460 PMC4503669 18 Available from: https://ualcan.path.uab.edu/cgi-bin/ualcan-res.pl 19 Dibra D. Moyer S. M. El-Naggar A. K. Qi Y. Su X. Lozano G. Triple-Negative Breast Tumors Are Dependent on Mutant p53 for Growth and Survival Proceedings of the National Academy of Sciences 2023 120 e2308807120 10.1073/pnas.2308807120 PMC10450424 37579145 20 Efe G. Dunbar K. J. Sugiura K. Cunningham K. Carcamo S. Karaiskos S. Tang Q. Cruz-Acuña R. Resnick-Silverman L. Peura J. Lu C. Hasson D. Klein-Szanto A. J. Taylor A. M. Manfredi J. J. Prives C. Rustgi A. K. p53 Gain-of-Function Mutation Induces Metastasis via BRD4-Dependent CSF-1 Expression Cancer Discovery 2023 13 2632 2651 10.1158/2159-8290.CD-23-0601 37676642 PMC10841313 21 Hossain M. M. Sultana A. Barua D. Islam M. N. Gupta A. Gupta S. Differential Expression, Function and Prognostic Value of miR-17–92 Cluster in ER-Positive and Triple-Negative Breast Cancer Cancer Treatment and Research Communications 2020 25 100224 10.1016/j.ctarc.2020.100224 33096318 22 Wang N. Wu R. Tang D. Kang R. The BET Family in Immunity and Disease Signal Transduction and Targeted Therapy 2021 6 10.1038/s41392-020-00384-4 PMC7813845 33462181 23 Lu L. Chen Z. Lin X. Tian L. Su Q. An P. Li W. Wu Y. du J. Shan H. Chiang C. M. Wang H. Inhibition of BRD4 Suppresses the Malignancy of Breast Cancer Cells via Regulation of Snail Cell Death and Differentiation 2020 27 255 268 10.1038/s41418-019-0353-2 31114028 PMC7205888 24 Parfenyev S. Singh A. Fedorova O. Daks A. Kulshreshtha R. Barlev N. A. Interplay Between p53 and Non-Coding RNAs in the Regulation of EMT in Breast Cancer Cell Death & Disease 2021 12 10.1038/s41419-020-03327-7 PMC7791039 33414456 25 Lee Y. M. Lee J. Y. Ho C. C. Hong Q. S. Yu S. L. Tzeng C. R. Yang P. C. Chen H. W. miRNA-34b as a Tumor Suppressor in Estrogen-Dependent Growth of Breast Cancer Cells Breast Cancer Research 2011 13 10.1186/bcr3059 PMC3326558 22113133 26 Andrieu G. Tran A. H. Strissel K. J. Denis G. V. BRD4 Regulates Breast Cancer Dissemination Through Jagged1/Notch1 Signaling Pathobiology 2016 76 6555 6567 10.1158/0008-5472.CAN-16-0559 PMC5290198 27651315 ",
  "metadata": {
    "Title of this paper": "BRD4 Regulates Breast Cancer Dissemination Through Jagged1/Notch1 Signaling",
    "Journal it was published in:": "BioMed Research International",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12409818/"
  }
}