{
  "title": "Paper_470",
  "abstract": "pmc Breast Cancer Res Breast Cancer Res 6 brcnres Breast Cancer Research : BCR 1465-5411 1465-542X BMC PMC12482611 PMC12482611.1 12482611 12482611 41024045 10.1186/s13058-025-02123-5 2123 1 Research Hsa-miR-155-5p expression in primary breast tissue may have the potential for prediction of breast cancer brain recurrence: results from the multi-institutional exploratory cohort study http://orcid.org/0000-0001-7435-1346 Koyama Yoichi peach@tokyo-med.ac.jp 1 https://orcid.org/0009-0006-2269-0411 Muguruma Masako 1 https://orcid.org/0000-0001-8935-0768 Horimoto Yoshiya 1 2 https://orcid.org/0000-0002-0135-5001 Narui Kazutaka 3 https://orcid.org/0000-0003-3006-0648 Yamada Akimitsu 4 https://orcid.org/0000-0002-5443-7078 Yamada Kimito 5 https://orcid.org/0000-0002-8083-5387 Yamamoto Shinya 6 https://orcid.org/0000-0003-0168-1250 Orihara Shunichiro 7 https://orcid.org/0000-0002-6638-783X Kaise Hiroshi 1 Kogure Akiko 8 Yoshioka Yusuke 8 https://orcid.org/0000-0002-0776-9918 Ochiya Takahiro tochiya@tokyo-med.ac.jp 8 https://orcid.org/0000-0003-3450-4533 Ishikawa Takashi tishik55@gmail.com 1 1 https://ror.org/012e6rh19 grid.412781.9 0000 0004 1775 2495 Department of Breast Surgical Oncology, Tokyo Medical University Hospital, 2 https://ror.org/01692sz90 grid.258269.2 0000 0004 1762 2738 Department of Breast Oncology, Juntendo University School of Medicine, 3 https://ror.org/03k95ve17 grid.413045.7 0000 0004 0467 212X Department of Breast and Thyroid Surgery, Yokohama City University Medical Center, 4 https://ror.org/0135d1r83 grid.268441.d 0000 0001 1033 6139 Department of Gastroenterological Surgery, Yokohama City University Graduate School of Medicine, 5 https://ror.org/00vpv1x26 grid.411909.4 0000 0004 0621 6603 Department of Breast Surgical Oncology, Tokyo Medical University Hachioji Medical Center, 6 https://ror.org/03na8p459 grid.410819.5 0000 0004 0621 5838 Department of Breast Surgery, Yokohama Rosai Hospital, 7 https://ror.org/00k5j5c86 grid.410793.8 0000 0001 0663 3325 Department of Health Data Science, Tokyo Medical University, 8 https://ror.org/00k5j5c86 grid.410793.8 0000 0001 0663 3325 Department of Molecular and Cellular Medicine, Institute of Medical Science, Tokyo Medical University, 29 9 2025 2025 27 478379 169 19 7 2025 6 9 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Despite the known incidence of brain metastases in breast cancer, no useful biomarker has been clinically established for breast cancer brain metastasis (BCBM). In the present study, we aimed to examine the expression of microRNAs (miRNAs) related to BCBM in formalin-fixed paraffin-embedded (FFPE) tissues to identify their usefulness as predictive biomarkers of breast cancer brain recurrence (BCBR). Methods Pairs of primary breast and metastatic site tissue samples were collected from 38 patients who experienced the first recurrence of metastasis to a single distant organ (brain/lungs/liver/bones = 11/12/9/6 patients) between January 2007 and December 2021 at five institutions in Japan. We evaluated the expression of 15 miRNAs in FFPE specimens of untreated breast and metastatic sites from the same patient using quantitative polymerase chain reaction. Results Analysis of the selected 15 miRNAs revealed that hsa-miR-155-5p exhibited significant BCBR-specific overexpression in untreated primary breast tissues ( p ρ ρ Conclusions Hsa-miR-155-5p expression in untreated primary breast tissue may be a valuable biomarker for predicting BCBR. A personalized escalation strategy is expected to be helpful in conquering brain metastases. Supplementary Information The online version contains supplementary material available at 10.1186/s13058-025-02123-5. Keywords MicroRNA Hsa-miR-155-5p Breast cancer Brain recurrence Formalin-fixed paraffin-embedded tissue Polymerase chain reaction https://doi.org/10.13039/100010795 Chugai Pharmaceutical CGPS20230417008 Ishikawa Takashi https://doi.org/10.13039/100018046 Nippon Kayaku NKCS20230403003 Ishikawa Takashi https://doi.org/10.13039/100009954 Taiho Pharmaceutical AS2023A000703337 Ishikawa Takashi https://doi.org/10.13039/501100004095 Kyowa Kirin KKCS20230412004 Ishikawa Takashi pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Background According to global cancer statistics, breast cancer is currently the most prevalent cancer and the leading cause of cancer-related deaths among women worldwide, as of 2022 [ 1 2 3 4 5 6 Breast cancer-specific graded prognostic assessment (GPA) predicts the median survival time after brain metastasis. The prognostic factors include age, Karnofsky Performance Status, molecular subtype, extracranial metastasis, and the number of brain metastases [ 7 MicroRNAs (miRNAs) are nucleic acids that are 20–25 bases long and are encoded in the genome. These short miRNAs are classified as functional non-coding RNAs that play important roles in regulating gene expression [ 8 9 10 11 12 Despite the known incidence of brain metastases in breast cancer, no useful biomarker has been clinically established for the early detection of brain metastasis. This presents a significant gap in current knowledge and clinical practice. To address this gap, in the present study, we focused on 15 previously identified miRNAs related to BCBM indexed in PubMed ® 13 22 Materials and methods Patient cohorts This is a multi-institutional exploratory cohort study. The study was approved by the Tokyo Medical University Ethics Committee (Approval Number T2022-0044) and the institutional review board of each participating institution. The requirement for informed consent was waived because of the retrospective nature of the study. Patients were allowed to view the research plan on their hospital websites and were offered the option to opt out of the study at any time. A flow diagram of this study is shown in Fig. 1 The inclusion criteria The exclusion criteria 23 23 Patients were eligible if they met the above criteria and were classified into four cohorts based on the first single distant recurrence organ (brain, lungs, liver, or bones). All patients had formalin-fixed paraffin-embedded (FFPE) tissues from the primary breast and metastatic sites (brain, lungs, liver, and bones) of the same patients. After enrollment, the biopsy or surgical specimens were stored in the pathology department of each institution.  Fig. 1 Flow diagram of the study. In this study, we enrolled 38 eligible early breast cancer patients with a single distant organ metastasis as an initial recurrence (11 brain, 12 lung, 9 liver, and 6 bone metastases) from five participating institutes in Japan. Total RNA containing miRNAs was extracted from formalin-fixed, paraffin-embedded tissue specimens, and cDNA was synthesized and subjected to real-time quantitative PCR. We examined the expression levels of 15 miRNAs in untreated primary breast and metastatic tissue specimens from the same patients Pathological assessment For this study, the pathological reports of all patients were reviewed retrospectively. Pathological reporting at different hospitals was performed uniformly based on the following criteria. The pathological staging of breast cancer was based on the World Health Organization classification. Nuclear grade was evaluated using the modified Bloom-Richardson histologic grading system [ 24 25 RNA extraction from FFPE specimens New FFPE specimens were obtained from pathological specimens that were previously collected and stored for treatment or diagnostic purposes at five institutes in Japan. In the present study, no personal information, such as name or age, was described for the pathological samples, and only the anonymized sample identification number was described. In each case, histopathological glass slides were microscopically reviewed to select the tumor block with preserved untreated primary breast cancer specimens with the highest occupied tumor tissue block. In cases of preoperative chemotherapy, biopsy specimens with the largest number of cancer-containing blocks were used. FFPE blocks with the largest cancer-containing areas were selected as metastatic site specimens. Slides with large necrotic areas were excluded from this study. Four sections of 10 μm thickness were cut from each selected block. Thin-cut conditions were based on the technical guidelines of TaqMan Advanced miRNA Assays (Thermo Fisher Scientific Inc. Waltham, MA USA). Total RNA was extracted using the miRNeasy FFPE kit (Qiagen, Hilden, Germany), following the manufacturer’s instructions. Finally, 26 µL of Nuclease-free Water was applied directly to a spin column to elute 24 µL of RNA, including miRNAs. The RNA concentration of FFPE samples was measured using an Agilent Bioanalyzer 2100 (Agilent RNA 6000 nano) (Agilent Technologies, Inc., Santa Clara, CA, USA). Additionally, the concentration, purity, and contamination were measured using a Nano Vue Plus instrument (GE Healthcare, Chicago, IL, USA). RT-qPCR with custom TaqMan™ MicroRNA Assays We focused on 15 BCBM-related miRNAs indexed in PubMed ® 1 13 22 For the Custom TaqMan™ MicroRNA Assays (TaqMan™ Special Plating #4398985, Applied Biosystems, Foster City, CA, USA), RNA was reverse transcribed using the TaqMan ® ® The final product was diluted with 0.1× TE buffer (pH 8.0; Nacalai Tesque, Inc., Kyoto, Japan) and stored at -80 °C until use in experiments. RT-qPCR was conducted using TaqMan ® 26 27  Table 1 Fifteen MicroRNA candidates for comprehensive PCR analysis and endogenous control microRNA Target gene Role in metastasis Validated human tissue References hsa-miR-7-5p KLF4 Inhibition of CSC self-renewal FFPE [ 13 hsa-miR-10b-5p HOXD10, RhoC, E-cadherin Metastasis-promoting transcription FFPE [ 14 hsa-miR-20b-5p PTEN Tumor suppressor FFPE [ 15 hsa-miR-130a-3p RAB5A/B(Ras), p53 Exibiting apotosis and inducing angiogenesis serum [ 16 hsa-miR-132-3p MET Decrease BBB property FFPE [ 17 hsa-miR-141-3p E-cadherin Promote metastatic colonization serum [ 18 hsa-miR-150-5p MET Decrease BBB property FFPE [ 17 hsa-miR-155-5p MET, VHL Regulating the function of BBB FFPE [ 17 hsa-miR-181c-5p PDPK1 BBB disruption, Extravasation serum [ 19 hsa-miR-194-5p MEF2C Promotion of passage through BBB FFPE [ 20 hsa-miR-199a-5p MET, Ezh2, p53, PTEN, BIM, Snail Enhance stem cell behavior and facilitate metastasis FFPE [ 17 hsa-miR-503-5p XIST, STAT3 Microenvironment modulation (microglia polarization) serum [ 21 hsa-miR-509-3-5p RhoC, TNFα Enhanced BBB permeability, BBB disruption FFPE [ 22 hsa-miR-576-3p PD-L1, CCND1 Microenvironment modulation serum [ 16 hsa-miR-802-5p MEF2C Promote cancer proliferation FFPE [ 20 hsa-miR16-5p (endogenous control) FEAT, CCND1, BCL2, RPS6KB1 Tumor suppressor FFPE [ 26 PCR FFPE CSC BBB RT-qPCR with TaqMan™ small RNA Assays In this case, cDNA was synthesized from 1 to 10 ng of small RNA-enriched total RNA using gene-specific primers and a TaqMan MicroRNA Reverse Transcription Kit, according to the TaqMan™ MicroRNA Assay protocol (publication number 4364031, Applied Biosystems). Real-time PCR was performed using the StepOne™ PCR system following the TaqMan™ MicroRNA Assay protocol. Reverse transcription and real-time PCR were performed using ipu-miR-155 (assay ID 467534_mat; Applied Biosystems). RNU44 (assay ID 001094; Applied Biosystems) was used as the reference gene. The threshold cycle data were determined using default threshold settings. All samples were normalized to RNU44, and the fold change was calculated using the ΔΔCT method [ 27 In situ hybridization In situ hybridization (ISH) was performed using an ISH Reagent Kit (Genostaff, Tokyo, Japan), following the manufacturer’s protocol. Tissue sections were deparaffinized, rehydrated, and fixed with 10% NBF at 37 °C. The cells were then treated with 0.2% HCl, Proteinase K, and heat-treated in phosphate-buffered saline (PBS). Hybridization was conducted using hsa-miR-155-5p (GeneGlobe ID YD00619862-BCG, Qiagen) and Scramble probes (GeneGlobe ID YD00699004-BCG, Qiagen) in G-Hybo-L at 40 °C for 16 h. After hybridization, the sections were washed with formamide-G and TBST. Blocking was performed using a G-Block, followed by incubation with an anti-DIG AP conjugate (Roche Diagnostics GmbH, Mannheim, Germany). Coloring reactions were performed using NBT/BCIP solution and washed with PBS. Counterstaining was performed using Kernechtrot stain, and the sections were mounted with G-mount and malinol. Imaging was performed using a NanoZoomer S210 digital slide scanner and the NDP.view2 Plus software (Hamamatsu Photonics, Shizuoka, Japan). Pathway investigation of breast cancer brain recurrence specific miRNAs After validating BCBR-specific miRNAs in primary breast tissue, we investigated the pathways of these miRNAs in “cancer” using the public database miRPathDB 2.0 ( https://mpd.bioinf.uni-sb.de/ Outcomes A comparison of the expression of 15 miRNAs among four cohorts To verify whether the 15 miRNAs were explicitly involved in BCBM and to determine whether there were differences among initial distant recurrence organs, we compared the relative expression levels and performed statistical analyses on the following: (i) untreated primary breast cancer specimens among cohort groups, (ii) metastatic site cancer specimens among cohort groups, and (iii) untreated primary breast cancer specimens and brain cancer specimens. In this case, the metastases considered in the analysis are metachronous. Prediction model of microRNA expression in primary breast tissue for BCBR To verify the usefulness of BCBR as a predictive factor, the correlation between miRNA expression in primary breast tissue and the onset of BCBR was explored. In this case, we also explored the use of clinical and pathological prognostic factors commonly used in breast cancer—including clinical disease stage and molecular subtypes—for BCBR prediction models. Correlation between the expression of 15 miRNAs expression and patients’ prognoses We evaluated distant metastasis free survival (DMFS) and post relapse survival (PRS) and explored their correlation with the expression of 15 miRNAs in cancer specimens from both primary breast as well as metastatic sites. In this case, the metastases considered in the analysis are metachronous. DMFS was defined as the time interval from surgery to the first documented distant breast cancer recurrence or death from any cause. The PRS was defined as the time interval from the diagnosis of distant recurrence to death from any cause or the last follow-up. Prognostic analysis was performed using clinical data obtained in October 2023. We also explored the correlation between two pairs of 15 miRNAs in specimens from the primary breast or metastatic sites. Statistical analysis All the analyses included data from patients who met the inclusion criteria. The baseline characteristics and clinical courses were collected retrospectively. The student’s t test and analysis of variance (ANOVA) was used to compare continuous variables. Pearson’s chi-squared test was used to compare categorical variables between the groups. We analyzed the comparison of the detected relative microRNA expression level from Custom TaqMan™ MicroRNA Assays using a Mann–Whitney U test and Kruskal–Wallis test. The Bonferroni method was used for multiple testing correction in the subgroup analyses. To analyze DMFS and PRS, we used the Kaplan–Meier method and compared the median values [95% CI] using the log-rank test. Their correlation with the expression of the 15 miRNAs was explored using Spearman’s rank correlation coefficient. We evaluated and compared the predictive performance of BCBR using a receiver operating characteristic (ROC) curve and the area under the ROC curve (AUC). The cutoff value was computed using the most prominent point on the ROC curve (Youden index = maximum [sensitivity − (1 − specificity)]). The 95% confidence interval for AUC was calculated using the DeLong method. All analyses were performed using the IBM SPSS Statistics version 29 (IBM Corp., Armonk, NY, USA). All tests were two-tailed, and a p Results Clinical and pathological features of patients in four cohorts During the study period, we identified 38 patients with eligible FFPE specimens (38 pairs of primary breast and metastatic site specimens from the same patients), 11, 12, 9, and 6 of whom had recurrences in the brain, lungs, liver, and bones. The baseline characteristics of the patients are summarized in Table 2 p  Table 2 Patient’s clinical and pathological background at baseline (Intention to treat; N Factors Intention to treat N Cohort1 n Cohort2 n Cohort3 n Cohort4 n p Age at EBC diagnosis - Median yr (95% CI) (range) 55 (49–63) (33–83) 48 (45–60) (40–74) 58 (41–68) (33–77) 54 (49–82) (34–83) 66 (46–76) (44–76) 0.463 (analysis of variance) Age at MBC diagnosis - Median yr (95% CI) (range) 59 (52–64) (37–85) 53 (46–61) (41–78) 62 (46–71) (37–79) 57 (52–83) (37–85) 69 (52–81) (49–81) 0.336 (analysis of variance) Menopausal status at EBC diagnosis - no.(%) Premenopausal 18 (47%) 6 (55%) 5 (42%) 5 (56%) 2 (33%) 0.777 Postmenopausal 20 (53%) 5 (45%) 7 (58%) 4 (44%) 4 (67%) (chi-squared test) Menopausal status at MBC diagnosis - no.(%) Premenopausal 15 (39%) 5 (45%) 5 (42%) 4 (44%) 1 (17%) 0.662 Postmenopausal 23 (61%) 6 (55%) 7 (58%) 5 (56%) 5 (83%) (chi-squared test) Histological type at EBC diagnosis - no.(%) Invasive ductal carcinoma 31 (82%) 10 (91%) 9 (75%) 8 (89%) 4 (67%) 0.534 Others 7 (18%) 1 (9%) 3 (25%) 1 (11%) 2 (33%) (chi-squared test) Molecular subtypes at EBC diagnosis - no.(%) Luminal 21 (55%) 2 (18%) 8 (67%) 6 (67%) 5 (83%) 0.27 Luminal-HER2 6 (16%) 3 (27%) 1 (8%) 2 (22%) 0 (0%) (chi-squared test) HER2 enriched 3 (8%) 2 (18%) 1 (8%) 0 (0%) 0 (0%) Triple negative 8 (21%) 4 (36%) 2 (17%) 1 (11%) 1 (17%) Estrogen Receptor status at EBC diagnosis - no.(%) Positive 27 (71%) 5 (45%) 9 (75%) 8 (89%) 5 (83%) 0.143 Negative 11 (39%) 6 (55%) 3 (25%) 1 (11%) 1 (17%) (chi-squared test) Progesterone Receptor status at EBC diagnosis - no.(%) Positive 18 (47%) 3 (27%) 6 (50%) 5 (56%) 4 (67%) 0.399 Negative 20 (53%) 8 (73%) 6 (50%) 4 (44%) 2 (33%) (chi-squared test) HER2 status at EBC diagnosis - no.(%) Positive(IHC;3 + or2+/ISH+ ) 9 (24%) 5 (45%) 2 (17%) 2 (22%) 0 (0%) 0.166 Negative 29 (76%) 6 (55%) 10 (83%) 7 (79%) 6 (100%) (chi-squared test) Clinical primary tumor classification of EBC - no.(%) T1 15 (39%) 3 (27%) 5 (42%) 4 (44%) 3 (50%) 0.399 T2 18 (47%) 4 (36%) 7 (58%) 5 (56%) 2 (33%) (chi-squared test) T3 4 (11%) 3 (27%) 0 (0%) 0 (0%) 1 (17%) T4 1 (3%) 1 (9%) 0 (0%) 0 (0%) 0 (0%) Clinical nodal involvement of EBC - no.(%) Positive (including micrometastasis) 19 (50%) 10 (91%) 3 (25%) 4 (44%) 2 (33%) 0.011 Negative 19 (50%) 1 (9%) 9 (75%) 5 (56%) 4 (67%) (chi-squared test) Overall clinical disease stage of EBC - no.(%) Stage I 11 (29%) 0 (0%) 4 (33%) 4 (44%) 3 (50%) 0.01 Stage II 18 (47%) 4 (36%) 7 (58%) 5 (56%) 2 (33%) (chi-squared test) Stage III 9 (24%) 7 (64%) 1 (8%) 0 (0%) 1 (17%) Pathological primary tumor classification of EBC - no.(%) ypT0/is 4 (11%) 4 (36%) 0 (0%) 0 (0%) 0 (0%) 0.154 T1 12 (32%) 3 (27%) 4 (33%) 3 (33%) 2 (33%) (chi-squared test) T2 18 (47%) 3 (27%) 6 (50%) 6 (67%) 3 (50%) T3 0 (0%) 0 (0%) 0 (0%) 0 (0%) 0 (0%) T4 4 (11%) 1 (9%) 2 (17%) 0 (0%) 1 (17%) Pathological nodal involvement of EBC - no.(%) Positive (including micrometastasis) 16 (42%) 4 (36%) 3 (25%) 6 (67%) 3 (50%) 0.265 Negative 22 (58%) 7 (64%) 9 (75%) 3 (33%) 3 (50%) (chi-squared test) Overall pathologial disease stage of EBC - no.(%) Stage 0 (ypT0/isN0) 4 (11%) 4 (36%) 0 (0%) 0 (0%) 0 (0%) 0.044 Stage I 7 (18%) 2 (18%) 3 (25%) 1 (11%) 1 (17%) (chi-squared test) Stage II 18 (47%) 2 (18%) 7 (58%) 7 (78%) 2 (33%) Stage III 9 (24%) 3 (27%) 2 (17%) 1 (11%) 3 (50%) Nuclear grade at EBC diagnosis - no.(%) Grade 1 9 (24%) 2 (18%) 3 (25%) 3 (33%) 1 (17%) 0.138 Grade 2 9 (24%) 1 (9%) 2 (17%) 4 (44%) 2 (33%) (chi-squared test) Grade 3 9 (24%) 2 (18%) 5 (42%) 2 (22%) 0 (0%) Not available 11 (29%) 6 (55%) 2 (17%) 0 (0%) 3 (50%) Ki67 status at EBC diagnosis - no.(%) Low (5% or less) 1 (3%) 0 (0%) 1 (8%) 0 (0%) 0 (0%) 0.385 Intermediate (6–29%) 10 (26%) 2 (18%) 6 (50%) 2 (22%) 0 (0%) (chi-squared test) High (30% or more) 16 (42%) 6 (55%) 3 (25%) 4 (44%) 3 (50%) Not available 11 (29%) 3 (27%) 2 (17%) 3 (33%) 3 (50%) Distant metastasis free survival (months) – median (95%CI) (range) 30.3 (21.4–39.2) (4.0-154.2) 13.2 (5.9–20.5) (4.0-154.2) 40.9 (19.3–62.5) (13.6–75.9) 32.0 (11.0–53.0) (5.9–50.1) 54.6 (12.2–97.0) (19.4–88.4) 0.194 (log-rank test) Post relapse survival (months) – median (95%CI) (range) 43.4 (33.5–53.3) (4.0-82.8) 24.0 (6.4–41.6) (4.0–81.0) 82.2 (26.7-137.7) (16.5–82.8) 38.4 (11.2–65.6) (6.0-72.1) 44.7 (29.8–59.6) (18.4–70.2) 0.001 (log-rank test) EBC MBC Relative expression of 15 miRNAs in primary breast tissue We performed RNA extraction and PCR on 11, 12, 9, and 6 (7, 1, 3, and 1 biopsy specimens, respectively) untreated primary breast cancer FFPE specimens from patients with recurrence in the brain, lungs, liver, or bones. We examined a box plot of the relative expression levels of 15 miRNAs in untreated primary breast cancer specimens from eligible patients in Supplementary Fig. 1. Three miRNAs (hsa-miR-141-3p, hsa-miR-150-5p, and hsa-miR-155-5p) showed a trend of overexpression compared to the others. Expression of the 15 miRNAs in primary breast specimens is shown in Fig. 2 p 2 2  Fig. 2 The box plots of 15 miRNA’s expression compared among initial distant recurrence organs in primary breast cancer specimens ( a b a b Relative expression of 15 miRNAs in tissue from metastatic sites We performed RNA extraction and PCR on 11, 12, 9, and 6 (0, 0, 9, and 2, respectively, of biopsy) specimens of brain, lung, liver, and bone FFPE tissues from 38 patients. A box plot showing the relative expression levels of 15 miRNAs in metastatic sites cancer specimens from eligible patients is presented in Supplementary Fig. 2. Three miRNAs, hsa-miR-141-3p, hsa-miR-150-5p, and hsa-miR-155-5p, showed a trend of overexpression compared to the others. The relative expression of the 15 miRNAs in metastatic site specimens is shown in Supplementary Fig. 3. Of the 15 miRNAs, hsa-miR-10b-5p ( p p Relative expression of 15 BCBM-related miRNAs in primary breast and brain tissues Subsequently, the relative expression of 15 miRNAs was compared between primary breast and brain tissue cancer specimens ( n 3 Fig. 3 The relative expression of 15 miRNAs (median ± 95% CI) in untreated primary breast and brain tissue cancer specimens from the same patients (n = 11) is shown. The pink and ivory boxes indicate primary breast and brain tissues, respectively. The Mann-Whitney U test was used to compare the levels of detected microRNA expression. No miRNAs were over-expressed in brain tissue. Six miRNAs, hsa-miR-10b-5p, hsa-miR-130a-3p, hsa-miR-150-5p, hsa-miR-155-5p, hsa-miR-199a-5p, and hsa-miR-503-5p, showed significantly higher expression in primary breast tissue than in brain tissue The correlation between hsa-miR-155-5p and other microRNAs, and their prediction models for BCBR We explored the correlation between the expression of hsa-miR-155-5p and other miRNAs in primary breast cancer specimens using the Spearman’s rank correlation coefficient among eligible patients (Fig. 4 ρ ρ The usefulness of these miRNAs as predictive factors for BCBR onset was also validated in Fig. 4 4 p p Furthermore, we investigated the pathways of these three miRNAs in “cancer” using the public database miRPathDB 2.0 ( https://mpd.bioinf.uni-sb.de/ )  Fig. 4 Scattered plots of miRNAs that were significantly related to the expression of hsa-miR-155-5p in primary breast cancer specimens, as well as receiver operating characteristic (ROC) curves for predicting breast cancer brain recurrence (BCBR) (Intention to treat; N a ρ ρ ρ b The correlation between the expression of 15 miRNAs and patient’s prognoses The correlation between the expression of the 15 miRNAs in primary breast cancer specimens and DMFS is shown in Supplementary Fig. 4. The median DMFS was 30.3 months (95% CI 21.4–39.2) (range: 4.0–154.2) for all patients. No specific miRNAs were significantly correlated with DMFS. The correlation between the expression of 15 miRNAs at metastatic sites cancer specimens and patient’s PRS is shown in Supplementary Fig. 5. The median PRS was 43.4 months (95% CI 33.5–53.3) (range: 4.0–82.8), and the median follow-up period was 74.7 months (95% CI 47.7–91.9) (range: 13.4–164.2) for all patients. As of October 2023, 16 patients (42%) were censored owing to a lack of death events and were excluded from the analysis. Ultimately, only one microRNA, hsa-miR-503-5p, showed a significant, moderate negative correlation with PRS ( ρ External validations for the expression of hsa-miR-155-5p in primary breast tissue For validation purposes, we obtained additional primary breast specimens from patients with brain-only recurrence ( n n 5 n n Furthermore, we explored the localization of hsa-miR-155-5p in primary breast tissue from one of the above patients with strong expression (molecular subtype: triple-negative; histological subtype: apocrine carcinoma) using ISH. We confirmed that hsa-miR-155-5p was uniformly stained in the nuclei and membranes of cancer cells. The stroma, including the fibroblasts, was stained weakly (Fig. 5  Fig. 5 Validation of hsa-miR-155-5p expression in primary breast tissue. a b a n n b Discussion This study aimed to investigate the expressions of 15 BCBM-related miRNAs in untreated primary breast tissues and their potential as predictive biomarkers for brain-only recurrence. We observed that only one miRNA, hsa-miR-155-5p, was significantly overexpressed in untreated primary breast specimens of patients with brain-only recurrence compared with other cohorts, despite the different distributions of molecular subtypes and clinical disease stage backgrounds. No difference in the expression levels of hsa-miR-155-5p was observed among the molecular subtypes in primary breast specimens of the brain cohort ( p N ρ p Research has suggested that hsa-miR-155-5p promotes cancer cell extravasation by regulating the function of the blood-brain barrier (BBB) through the targeting cell-to-cell complex molecules, such as annexin-2 and claudin-1, as well as focal adhesion components, including DOCK-1 and syntenin-1 [ 17 28 17 29 17 17 15 Eventually, our validated patients in the brain cohort consisted of those with a high tumor burden in terms of perioperative status and short DMFS. These miRNAs appeared to have already been over-secreted from primary breast cancer cells into the bloodstream. And they may have prepared to decrease BBB function, which would eventually make it easier for breast cancer cells to migrate to the brain and form metastatic nests. We believe that hsa-miR-155-5p, hsa-miR-150-5p, and hsa-miR-20b-5p play crucial roles in brain metastasis and warrant further investigation. Although miRNAs, including hsa-miR-155-5p, except hsa-miR-10b-5p and hsa-miR-199a-5p, did not demonstrate brain-specific expression compared to other distant organs, the overlap observed between primary breast tumors and their paired metastatic sites suggests that many miRNAs associated with metastasis are present in primary breast tumors. Our results showed significant under expression of two miRNAs (hsa-miR-10b-5p and hsa-miR-199a-5p) in brain tissue compared to that in visceral and bone tissue, despite their oncogenic roles [ 14 30 Regarding the correlation between the expression of the 15 miRNAs and prognosis, the expression of miRNAs in primary breast tissue and DMFS appeared to lack clinical significance. However, only one miRNA, hsa-miR-503-5p, showed a significant, moderately negative correlation with PRS. Serum hsa-miR-503-5p is highly expressed after BCBM and negatively correlated with relapse-free survival [ 21 The American Society of Clinical Oncology and National Comprehensive Cancer Network guidelines do not recommend radiological screening for the early detection of asymptomatic brain metastases in patients with breast cancer [ 31 32 33 34 This study had some limitations. First, discrepancies in the results from previous reports, e.g., differences in study design, internal control genes, and tissues or liquids, should be considered. Second, the present study lacked a substantial comparison of molecular subtypes and included a limited number of pairs. The subgroup analysis of hsa-miR-155-5p expression across molecular subtypes is underpowered due to small sample sizes. These subgroup analyses are exploratory and require confirmation in larger cohorts. Additionally, the extremely high BCBR predictive AUC of hsa-miR-155-5p may be an overestimation due to the small sample size. These findings are hypothesis-generating and require validation in a much larger, independent cohort. (iii) It has been previously observed that miRNA levels gradually decrease over time in long-archived FFPE blocks [ 35 In conclusion, overexpression of hsa-miR-155-5p in untreated primary breast tissue appears to be a possible biomarker for the prediction of BCBR. Further prospective analyses are required to elucidate the next steps for clinical application. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Figure 1. Relative expression of 15 miRNAs in primary breast cancer specimens among eligible patients (intention to treat; N p  Supplementary Figure 2. Relative expression of 15 miRNAs in cancer specimens from metastatic sites (brain/lungs/liver/bones) among eligible patients (Intention to treat; N p  Supplementary Figure 3. The box plots of 15 miRNA's expression compared among initial distant recurrence organs in metastatic sites cancer specimens.The expression of 15 microRNAs (median ± 95% CI) in specimens from metastatic sites is shown. Blue, red, green, and yellow boxes indicate the brain, lung, liver, and bone tissues, respectively. The Kruskal-Wallis test was used to compare detected relative microRNA expression levels among the four cohorts. Of the 15 miRNAs, hsa-miR-10b-5p and hsa-miR-199a-5p exhibited significant brain tissue-specific expressions in the brain, that is, they were under-expressed in brain tissue compared to visceral or bone tissue.  Supplementary Figure 4. Spearman rank correlation coefficients between expression of 15 miRNAs in primary breast cancer specimens (Intention to treat; N  Supplementary Figure 5. Spearman rank correlation coefficients between 15 miRNAs expression in metastatic sites cancer specimens (Intention to treat; N ρ  Supplementary Figure 6. Kaplan-Meier curve of post relapse survival according to relative hsa-miR-503-5p levels in metastatic sites cancer specimens. Kaplan-Meier curves of post relapse survival (PRS) according to relative hsa-miR-503-5p expression levels in metastatic sites cancer specimens are shown. In the data analysis in October 2023, 16 (42%) of the 38 patients were censored without a death event and were excluded from this analysis. We compared the prognosis of patients divided by relative hsa-miR-503-5p level (high (blue line) vs. low (red line)) using the Kaplan-Meier method ( n p  Supplementary Tables. Abbreviations ER Estrogen receptor PgR Progesterone receptor HER2 Human epidermal growth factor type 2 qPCR Quantitative polymerase chain reaction BCBR Breast cancer brain recurrence BCBM Breast cancer brain metastasis MBC Metastatic breast cancer EBC Early breast cancer DMFS Distant metastasis free survival PRS Post relapse survival 95%CI 95% confidence interval ROC Receiver operating characteristic AUC The area under the receiver operating characteristic curve Hsa Homo Sapiens RIN RNA integrity number cDNA Complementary DNA ISH In situ hybridization IHC Immunohistochemistry LCM Laser-capture microdissection GPA Graded prognostic assessment miR(s)/miRNA(s) MicroRNA(s) Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements The authors would like to thank Editage (www.editage.jp) for the English language editing. We would also like to thank the Medical Research Center of Tokyo Medical University for the use of the research equipment. Finally, we thank Genostaff Co., Ltd. (https://genostaff.com) for performing in situ hybridization. Author contributions YK, TO, and TI were responsible for the study concept, design, writing, data analysis, and interpretation. YK, TO, AK, and MM developed experiments. YK collected patient samples with the help of HK, KY, AY, KN, SY, and YH. YK performed PCR with the help of AK and MM. YK analyzed the sequencing data with the help of MM, SO, YY, and TO. All the authors have read and approved the final manuscript. Funding This research was financially supported by grants from the Department of Breast Surgical Oncology and the Department of Molecular and Cellular Medicine, Institute of Medical Science, Tokyo Medical University. This research was financially supported by a scholarship grant from Chugai Pharmaceutical Co., Ltd. (application number: CGPS20230417008 and CGPS20250401025), Nippon Kayaku Co. Ltd. (application number: NKCS20230403003), Taiho Pharmaceutical Co. Ltd. (application number: AS2023A000703337), and Kyowa Kirin Co. Ltd. (application number: KKCS20230412004). Data availability All data supporting this article are included in this manuscript. Declarations Ethics approval and consent to participate This study was approved by the Ethics Committee of Tokyo Medical University (Approval number; T2022-0044). All procedures involving human participants performed in this study were in accordance with the ethical standards of the institutional and/or national research committee and with the 1964 Helsinki Declaration and its later amendments or comparable ethical standards. Consent for publication Due to the retrospective nature of the study, the requirement for informed consent was waived. The opportunity to refuse participation in the study was guaranteed by disclosing information about the research through a public announcement. Competing interests The authors declare no competing interests. References 1. Bray F Laversanne M Sung H Ferlay H Siegel R Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2024 74 229 63 10.3322/caac.21834 38572751 Bray F, Laversanne M, Sung H, Ferlay H, Siegel R. Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. CA Cancer J Clin. 2024;74:229–63. 10.3322/caac.21834. 38572751 10.3322/caac.21834 2. Kennecke H Yerushalmi R Woods R Cheang MC Voduc D Speers CH Metastatic behavior of breast cancer subtypes J Clin Oncol 2010 28 3271 7 10.1200/JCO.2009.25.9820 20498394 Kennecke H, Yerushalmi R, Woods R, Cheang MC, Voduc D, Speers CH. Metastatic behavior of breast cancer subtypes. J Clin Oncol. 2010;28:3271–7. 10.1200/JCO.2009.25.9820. 20498394 10.1200/JCO.2009.25.9820 3. Bollig-Fischer A, Michelhaugh S, Ali-Fehmi R, Mittal S. The molecular genomics of metastatic brain tumours. OA Mol Oncol. 2013;1. 10.13172/2052-9635-1-1-759. https://www.oapublishinglondon.com/article/759# 10.13172/2052-9635-1-1-759 PMC4229688 25400938 4. Bailleux C Eberst L Bachelot T Treatment strategies for breast cancer brain metastases Br J Cancer 2021 124 142 55 10.1038/s41416-020-01175-y 33250512 PMC7782834 Bailleux C, Eberst L, Bachelot T. Treatment strategies for breast cancer brain metastases. Br J Cancer. 2021;124:142–55. 10.1038/s41416-020-01175-y. 33250512 10.1038/s41416-020-01175-y PMC7782834 5. Xiong Z Deng G Huang X Li X Xie X Wang J Bone metastasis pattern in initial metastatic breast cancer: a population-based study Cancer Manag Res 2018 10 287 95 10.2147/CMAR.S155524 29467583 PMC5811177 Xiong Z, Deng G, Huang X, Li X, Xie X, Wang J. Bone metastasis pattern in initial metastatic breast cancer: a population-based study. Cancer Manag Res. 2018;10:287–95. 10.2147/CMAR.S155524. 29467583 10.2147/CMAR.S155524 PMC5811177 6. Puri S Chaudhry A Bayable A Ganesh A Daher A Gadi VK Systemic treatment for brain metastasis and leptomeningeal disease in breast cancer patients Curr Oncol Rep 2023 25 1419 30 10.1007/s11912-023-01468-4 37924439 Puri S, Chaudhry A, Bayable A, Ganesh A, Daher A, Gadi VK. Systemic treatment for brain metastasis and leptomeningeal disease in breast cancer patients. Curr Oncol Rep. 2023;25:1419–30. 10.1007/s11912-023-01468-4. 37924439 10.1007/s11912-023-01468-4 7. Sperduto PW Mesko S Li J Cagney D Aizer A Lin NU Survival in patients with brain metastases: summary report on the updated Diagnosis-Specific graded prognostic assessment and definition of the eligibility quotient J Clin Oncol 2020 38 3773 84 10.1200/JCO.20.01255 32931399 PMC7655019 Sperduto PW, Mesko S, Li J, Cagney D, Aizer A, Lin NU. Survival in patients with brain metastases: summary report on the updated Diagnosis-Specific graded prognostic assessment and definition of the eligibility quotient. J Clin Oncol. 2020;38:3773–84. 10.1200/JCO.20.01255. 32931399 10.1200/JCO.20.01255 PMC7655019 8. Ambros V The functions of animal MicroRNAs Nature 2004 431 350 5 10.1038/nature02871 15372042 Ambros V. The functions of animal MicroRNAs. Nature. 2004;431:350–5. 10.1038/nature02871. 15372042 10.1038/nature02871 9. Lim LP Lau NC Garrett-Engele P Grimson A Schelter JM Castle J Microarray analysis shows that some MicroRNAs downregulate large numbers of target mRNAs Nature 2005 433 769 73 10.1038/nature03315 15685193 Lim LP, Lau NC, Garrett-Engele P, Grimson A, Schelter JM, Castle J. Microarray analysis shows that some MicroRNAs downregulate large numbers of target mRNAs. Nature. 2005;433:769–73. 10.1038/nature03315. 15685193 10.1038/nature03315 10. Kent OA Mendell JT A small piece in the cancer puzzle: MicroRNAs as tumor suppressors and oncogenes Oncogene 2006 25 6188 96 10.1038/sj.onc.1209913 17028598 Kent OA, Mendell JT. A small piece in the cancer puzzle: MicroRNAs as tumor suppressors and oncogenes. Oncogene. 2006;25:6188–96. 10.1038/sj.onc.1209913. 17028598 10.1038/sj.onc.1209913 11. Aggarwal T Wadhwa R Gupta R Paudel KR Collet T Chellappan DK MicroRNAs as biomarker for breast cancer Endocr Metab Immune Disord Drug Targets 2020 20 1597 610 10.2174/1871530320666200428113051 32342824 Aggarwal T, Wadhwa R, Gupta R, Paudel KR, Collet T, Chellappan DK. MicroRNAs as biomarker for breast cancer. Endocr Metab Immune Disord Drug Targets. 2020;20:1597–610. 10.2174/1871530320666200428113051. 32342824 10.2174/1871530320666200428113051 12. Fridrichova I Zmetakova I MicroRNAs contribute to breast cancer invasiveness Cells 2019 8 1361 10.3390/cells8111361 31683635 PMC6912645 Fridrichova I, Zmetakova I. MicroRNAs contribute to breast cancer invasiveness. Cells. 2019;8:1361. 10.3390/cells8111361. 31683635 10.3390/cells8111361 PMC6912645 13. Okuda H Xing F Pandey PR Sharma S Watabe M Pai SK miR-7 suppresses brain metastasis of breast cancer stem-like cells by modulating KLF4 Cancer Res 2013 73 1434 44 10.1158/0008-5472.CAN-12-2037 23384942 PMC3576138 Okuda H, Xing F, Pandey PR, Sharma S, Watabe M, Pai SK. miR-7 suppresses brain metastasis of breast cancer stem-like cells by modulating KLF4. Cancer Res. 2013;73:1434–44. 10.1158/0008-5472.CAN-12-2037. 23384942 10.1158/0008-5472.CAN-12-2037 PMC3576138 14. Ahmad A Sethi S Chen W Ali-Fehmi R Mittal S Sarkar FH Up-regulation of microRNA-10b is associated with the development of breast cancer brain metastasis Am J Transl Res 2014 6 384 90 25075255 PMC4113500 Ahmad A, Sethi S, Chen W, Ali-Fehmi R, Mittal S, Sarkar FH. Up-regulation of microRNA-10b is associated with the development of breast cancer brain metastasis. Am J Transl Res. 2014;6:384–90. eCollection 2014. 25075255 PMC4113500 15. Ahmad A Ginnebaugh KR Sethi S Chen W Ali R Mittal S miR-20b is up-regulated in brain metastases from primary breast cancers Oncotarget 2015 6 12188 95 10.18632/oncotarget.3664 25893380 PMC4494931 Ahmad A, Ginnebaugh KR, Sethi S, Chen W, Ali R, Mittal S. miR-20b is up-regulated in brain metastases from primary breast cancers. Oncotarget. 2015;6:12188–95. 10.18632/oncotarget.3664. 25893380 10.18632/oncotarget.3664 PMC4494931 16. Curtaz CJ Reifschläger L Strähle L Feldheim J Feldheim JJ Schmitt C Analysis of MicroRNAs in exosomes of breast cancer patients in search of molecular prognostic factors in brain metastases Int J Mol Sci 2022 23 3683 10.3390/ijms23073683 35409043 PMC8999078 Curtaz CJ, Reifschläger L, Strähle L, Feldheim J, Feldheim JJ, Schmitt C. Analysis of MicroRNAs in exosomes of breast cancer patients in search of molecular prognostic factors in brain metastases. Int J Mol Sci. 2022;23:3683. 10.3390/ijms23073683. 35409043 10.3390/ijms23073683 PMC8999078 17. Giannoudis A Clarke K Zakaria R Varešlija D Farahani M Rainbow L A novel panel of differentially-expressed MicroRNAs in breast cancer brain metastasis May predict patient survival Sci Rep 2019 9 18518 10.1038/s41598-019-55084-z 31811234 PMC6897960 Giannoudis A, Clarke K, Zakaria R, Varešlija D, Farahani M, Rainbow L. A novel panel of differentially-expressed MicroRNAs in breast cancer brain metastasis May predict patient survival. Sci Rep. 2019;9:18518. 10.1038/s41598-019-55084-z. 31811234 10.1038/s41598-019-55084-z PMC6897960 18. Debeb BG Lacerda L Anfossi S Diagaradjane P Chu K Bambhroliya A miR-141-Mediated regulation of brain metastasis from breast cancer J Natl Cancer Inst 2016 108 djw026 10.1093/jnci/djw026 27075851 PMC5017951 Debeb BG, Lacerda L, Anfossi S, Diagaradjane P, Chu K, Bambhroliya A. miR-141-Mediated regulation of brain metastasis from breast cancer. J Natl Cancer Inst. 2016;108:djw026. 10.1093/jnci/djw026. 27075851 10.1093/jnci/djw026 PMC5017951 19. Tominaga N Kosaka N Ono M Katsuda T Yoshioka Y Tamura K Brain metastatic cancer cells release microRNA-181c-containing extracellular vesicles capable of destructing blood-brain barrier Nat Commun 2015 6 6716 10.1038/ncomms7716 25828099 PMC4396394 Tominaga N, Kosaka N, Ono M, Katsuda T, Yoshioka Y, Tamura K. Brain metastatic cancer cells release microRNA-181c-containing extracellular vesicles capable of destructing blood-brain barrier. Nat Commun. 2015;6:6716. 10.1038/ncomms7716. 25828099 10.1038/ncomms7716 PMC4396394 20. Sereno M Haskó J Molnár K Medina SJ Reisz Z Malhó R Downregulation of Circulating MiR 802-5p and MiR 194-5p and upregulation of brain MEF2C along breast cancer brain metastasization Mol Oncol 2020 14 520 38 10.1002/1878-0261.12632 31930767 PMC7053247 Sereno M, Haskó J, Molnár K, Medina SJ, Reisz Z, Malhó R. Downregulation of Circulating MiR 802-5p and MiR 194-5p and upregulation of brain MEF2C along breast cancer brain metastasization. Mol Oncol. 2020;14:520–38. 10.1002/1878-0261.12632. 31930767 10.1002/1878-0261.12632 PMC7053247 21. Xing F Liu Y Wu SY Wu K Sharma S Mo YY Loss of XIST in breast cancer activates MSN-c-Met and reprograms microglia via Exosomal MiRNA to promote brain metastasis Cancer Res 2018 78 4316 30 10.1158/0008-5472.CAN-18-1102 30026327 PMC6072593 Xing F, Liu Y, Wu SY, Wu K, Sharma S, Mo YY. Loss of XIST in breast cancer activates MSN-c-Met and reprograms microglia via Exosomal MiRNA to promote brain metastasis. Cancer Res. 2018;78:4316–30. 10.1158/0008-5472.CAN-18-1102. 30026327 10.1158/0008-5472.CAN-18-1102 PMC6072593 22. Xing F Sharma S Liu Y Mo YY Wu K Zhang YY miR-509 suppresses brain metastasis of breast cancer cells by modulating RhoC and TNF-α Oncogene 2015 34 4890 900 10.1038/onc.2014.412 25659578 PMC4530094 Xing F, Sharma S, Liu Y, Mo YY, Wu K, Zhang YY. miR-509 suppresses brain metastasis of breast cancer cells by modulating RhoC and TNF-α. Oncogene. 2015;34:4890–900. 10.1038/onc.2014.412. 25659578 10.1038/onc.2014.412 PMC4530094 23. Cardoso F Paluch-Shimon S Schumacher-Wulf E Matos L Gelmon K Aapro MS 7th international consensus guidelines for the management of advanced breast cancer (ABC guidelines 6 and 7) Breast 2024 76 103756 10.1016/j.breast.2024.103756 38896983 PMC11231614 Cardoso F, Paluch-Shimon S, Schumacher-Wulf E, Matos L, Gelmon K, Aapro MS. 7th international consensus guidelines for the management of advanced breast cancer (ABC guidelines 6 and 7). Breast. 2024;76:103756. 10.1016/j.breast.2024.103756. et.al. 6. 38896983 10.1016/j.breast.2024.103756 PMC11231614 24. Robbins P Pinder S de Klerk N Dawkins H Harvey J Sterrett G Histological grading of breast carcinomas: a study of interobserver agreement Hum Pathol 1995 26 873 9 10.1016/0046-8177(95)90010-1 7635449 Robbins P, Pinder S, de Klerk N, Dawkins H, Harvey J, Sterrett G. Histological grading of breast carcinomas: a study of interobserver agreement. Hum Pathol. 1995;26:873–9. 10.1016/0046-8177(95)90010-1. 7635449 10.1016/0046-8177(95)90010-1 25. Nielsen TO Leung SCY Rimm DL Dodson A Acs B Badve S Assessment of Ki67 in breast cancer: updated recommendations from the international Ki67 in breast cancer working group J Natl Cancer Inst 2021 113 808 19 10.1093/jnci/djaa201 33369635 PMC8487652 Nielsen TO, Leung SCY, Rimm DL, Dodson A, Acs B, Badve S. Assessment of Ki67 in breast cancer: updated recommendations from the international Ki67 in breast cancer working group. J Natl Cancer Inst. 2021;113:808–19. 10.1093/jnci/djaa201. 33369635 10.1093/jnci/djaa201 PMC8487652 26. Rinnerthaler G Hackl H Gampenrieder SP Hamacher F Hufnagl C Hauser-Kronberger C miR-16-5p is a Stably-Expressed housekeeping MicroRNA in breast cancer tissues from primary tumors and from metastatic sites Int J Mol Sci 2016 17 156 10.3390/ijms17020156 26821018 PMC4783890 Rinnerthaler G, Hackl H, Gampenrieder SP, Hamacher F, Hufnagl C, Hauser-Kronberger C. miR-16-5p is a Stably-Expressed housekeeping MicroRNA in breast cancer tissues from primary tumors and from metastatic sites. Int J Mol Sci. 2016;17:156. 10.3390/ijms17020156. 26821018 10.3390/ijms17020156 PMC4783890 27. Schmittgen TD Livak KJ Analyzing real-time PCR data by the comparative C(T) method Nat Protoc 2008 3 1101 8 10.1038/nprot.2008.73 18546601 Schmittgen TD, Livak KJ. Analyzing real-time PCR data by the comparative C(T) method. Nat Protoc. 2008;3:1101–8. 10.1038/nprot.2008.73. 18546601 10.1038/nprot.2008.73 28. Lopez-Ramirez MA Wu D Pryce G Simpson JE Reijerkerk A King-Robson J MicroRNA-155 negatively affects blood–brain barrier function during neuroinflammation FASEB J 2014 28 2551 65 10.1096/fj.13-248880 24604078 Lopez-Ramirez MA, Wu D, Pryce G, Simpson JE, Reijerkerk A, King-Robson J, et al. MicroRNA-155 negatively affects blood–brain barrier function during neuroinflammation. FASEB J. 2014;28:2551–65. 10.1096/fj.13-248880. 24604078 10.1096/fj.13-248880 29. Gao S Wang Y Wang M Li Z Zhao Z Wang RX MicroRNA-155, induced by FOXP3 through transcriptional repression of BRCA1, is associated with tumor initiation in human breast cancer Oncotarget 2017 8 41451 64 10.18632/oncotarget.17816 28562349 PMC5522316 Gao S, Wang Y, Wang M, Li Z, Zhao Z, Wang RX. MicroRNA-155, induced by FOXP3 through transcriptional repression of BRCA1, is associated with tumor initiation in human breast cancer. Oncotarget. 2017;8:41451–64. 10.18632/oncotarget.17816. 28562349 10.18632/oncotarget.17816 PMC5522316 30. Zhou L Liu F Wang X Ouyang G The roles of MicroRNAs in the regulation of tumor metastasis Cell Biosci 2015 5 32 10.1186/s13578-015-0028-8 26146543 PMC4491246 Zhou L, Liu F, Wang X, Ouyang G. The roles of MicroRNAs in the regulation of tumor metastasis. Cell Biosci. 2015;5:32. 10.1186/s13578-015-0028-8. 26146543 10.1186/s13578-015-0028-8 PMC4491246 31. Ramakrishna N Anders CK Lin NU Morikawa A Temin S Chandarlapaty S Management of advanced human epidermal growth factor receptor 2-Positive breast cancer and brain metastases: ASCO guideline update J Clin Oncol 2022 40 2636 55 10.1200/JCO.22.00520 35640075 Ramakrishna N, Anders CK, Lin NU, Morikawa A, Temin S, Chandarlapaty S. Management of advanced human epidermal growth factor receptor 2-Positive breast cancer and brain metastases: ASCO guideline update. J Clin Oncol. 2022;40:2636–55. 10.1200/JCO.22.00520. 35640075 10.1200/JCO.22.00520 32. Gradishar WJ Moran MS Abraham J Abramson V Aft R Agnese D NCCN Guidelines ® J Natl Compr Canc Netw 2023 21 594 608 10.6004/jnccn.2023.0031 37308117 Gradishar WJ, Moran MS, Abraham J, Abramson V, Aft R, Agnese D. NCCN Guidelines ® 37308117 10.6004/jnccn.2023.0031 33. Harbeck N Ciruelos E Jerusalem G Müller V Niikura N Viale G Trastuzumab Deruxtecan in HER2-positive advanced breast cancer with or without brain metastases: a phase 3b/4 trial Nat Med 2024 30 3717 27 10.1038/s41591-024-03261-7 39271844 PMC11645283 Harbeck N, Ciruelos E, Jerusalem G, Müller V, Niikura N, Viale G. Trastuzumab Deruxtecan in HER2-positive advanced breast cancer with or without brain metastases: a phase 3b/4 trial. Nat Med. 2024;30:3717–27. 10.1038/s41591-024-03261-7. 39271844 10.1038/s41591-024-03261-7 PMC11645283 34. Lin NU Murthy RK Abramson V Anders C Bachelot T Bedard PL Tucatinib vs placebo, both in combination with trastuzumab and capecitabine, for previously treated ERBB2 (HER2)-Positive metastatic breast cancer in patients with brain metastases: updated exploratory analysis of the HER2CLIMB randomized clinical trial JAMA Oncol 2023 9 197 205 10.1001/jamaoncol.2022.5610 36454580 PMC9716438 Lin NU, Murthy RK, Abramson V, Anders C, Bachelot T, Bedard PL. Tucatinib vs placebo, both in combination with trastuzumab and capecitabine, for previously treated ERBB2 (HER2)-Positive metastatic breast cancer in patients with brain metastases: updated exploratory analysis of the HER2CLIMB randomized clinical trial. JAMA Oncol. 2023;9:197–205. 10.1001/jamaoncol.2022.5610. 36454580 10.1001/jamaoncol.2022.5610 PMC9716438 35. Peskoe SB Barber JR Zheng Q Meeker AK De Marzo AM Platz EA Differential long-term stability of MicroRNAs and RNU6B SnRNA in 12–20 year old archived formalin-fixed paraffin-embedded specimens BMC Cancer 2017 17 32 10.1186/s12885-016-3008-4 28061773 PMC5219687 Peskoe SB, Barber JR, Zheng Q, Meeker AK, De Marzo AM, Platz EA. Differential long-term stability of MicroRNAs and RNU6B SnRNA in 12–20 year old archived formalin-fixed paraffin-embedded specimens. BMC Cancer. 2017;17:32. 10.1186/s12885-016-3008-4. 28061773 10.1186/s12885-016-3008-4 PMC5219687 ",
  "metadata": {
    "Title of this paper": "Differential long-term stability of MicroRNAs and RNU6B SnRNA in 12–20 year old archived formalin-fixed paraffin-embedded specimens",
    "Journal it was published in:": "Breast Cancer Research : BCR",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482611/"
  }
}