{
  "title": "Paper_350",
  "abstract": "pmc Haematologica Haematologica 820 haematol HAEMA Haematologica 0390-6078 1592-8721 Ferrata Storti Foundation PMC12485302 PMC12485302.1 12485302 12485302 40336320 10.3324/haematol.2024.286794 1 Letter to the Editor Evaluation of SOX4 levels in multiple myeloma patients Lombardi Elisabetta  1 Kowal Kinga Eva  1 Almanza Gonzalo  2 Agostini Francesco  1 Da Ros Francesco  1 Valvasori Marco  1 Vicinanza Carla  1 Alzetta Daniel  3 Montante Barbara  3 Marangon Miriam  1 Crestani Silvia  3 Lamon Giuseppe  3 Rupolo Maurizio  3 Mazzucato Mario  1 Durante Cristina  1 Zanetti Maurizio  2 Michieli Mariagrazia  3 Contributions 1 Stem Cell Unit Italy 2 The Laboratory of Immunology University of California San Diego USA 3 Oncohematology and Cell Therapy Unit Italy E. LOMBARDI - elombardi@cro.it  Disclosures MZ is a cofounder of FutuRNA Pharmaceuticals, a company formed on intellectual property licensed from the University of California. 08 5 2025 01 10 2025 110 10 498052 2530 2534 19 11 2024 29 4 2025 08 05 2025 02 10 2025 02 10 2025 Copyright© 2025 Ferrata Storti Foundation https://creativecommons.org/licenses/by-nc/4.0/ This article is distributed under the terms of the Creative Commons Attribution Noncommercial License ( by-nc 4.0 Funding pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Multiple myeloma (MM) is a complex hematologic cancer in which many factors interplay to promote cancer progression. MM is characterized by clonal proliferation of malignant plasma cells within the bone marrow which, in most cases, leads to abnormal expansion of a monoclonal component. In several cases, MM is preceded by a monoclonal gammopathy of undetermined significance (MGUS) or by smoldering multiple myeloma (SMM). MGUS and SMM are asymptomatic conditions characterized by the presence of monoclonal cells. SMM can be distinguished from MGUS by a higher risk of progression to MM (10% vs 1 MM invariably relapses, even after the administration of new advanced therapeutic regimens ( https://seer.cancer. gov/statfacts/html/mulmy.html 2 3 2 3 Transcription factors, deregulating the expression of pivotal genes, 4 4 5 6 7 8 4 9 10 Figure 1. Constitutive expression of SOX4 in patients’ samples. + t P + post hoc P P SOX4 regulates the expression of membrane molecules that play a crucial role in tumor-niche interactions, such as CD56, a membrane glycoprotein expressed in neural tissues, natural killer cells and T lymphocytes. 11 12 13 13 et al 14 15 15 7 Online Supplementary Table S1 We evaluated basal SOX4 expression in CD138 + Figure 1A P Figure 1B Figure 2. SOX4 expression in biopsies from patients with treated multiple myeloma. post hoc P P t P Figure 3. Correlation between CD56 expression on the surface of plasma cells, SOX4 expression and inflammation state in bone marrow niche. t P P 2 P t P In T-MM samples, SOX4 expression was compared to tumor progression. SOX4 expression was high in samples from patients in clinical progression and, conversely, was low in samples from patients in clinical remission ( Figure 2A P Figure 2B 5 6 To assess the impact of inflammation on SOX4 and the adhesion molecule CD56, we treated MM cell lines with TGFβ1 (5 ng/mL). We found that, within 12 hours, TGFβ1 upregulated the transcription levels of both SOX4 and CD56 ( Figure 3A Figure 3B P Figure 3C data not shown Samples characterized by high expression of CD56 showed enhanced expression of TGFβ1 ( P 14 P Figure 3D 11 11 In conclusion, we report high levels of SOX4 in full-blown MM which persist and increase over time regardless of therapy, suggesting a possible diagnostic use of SOX4 as a marker of disease progression. Our data confirm that SOX4 expression is enhanced by TGFβ1, 7 9 8 8 per se Supplementary Material Supplementary Appendix  Acknowledgments Special thanks to Prof. Vincenzo Canzonieri and the Pathological Anatomy Unit of CRO-Aviano. Data-sharing statement Data are available on request to the corresponding author. References 1. Rajkumar SV Landgren O Mateos M-V Smoldering multiple myeloma Blood 2015 125 20 3069 3075 25838344 10.1182/blood-2014-09-568899 PMC4432003 2. Melaccio A Reale A Saltarella I Pathways of angiogenic and inflammatory cytokines in multiple myeloma: role in plasma cell clonal expansion and drug resistance J Clin Med 2022 11 21 6491 36362718 10.3390/jcm11216491 PMC9658666 3. García-Ortiz A Rodríguez-García Y Encinas J The role of tumor microenvironment in multiple myeloma development and progression Cancers (Basel) 2021 13 2 217 33435306 10.3390/cancers13020217 PMC7827690 4. Vervoort SJ van Boxtel R Coffer PJ The role of SRY-related HMG box transcription factor 4 (SOX4) in tumorigenesis and metastasis: friend or foe? Oncogene 2013 32 29 3397 3409 23246969 10.1038/onc.2012.506 5. Tiwari N Tiwari VK Waldmeier L Sox4 is a master regulator of epithelial-mesenchymal transition by controlling Ezh2 expression and epigenetic reprogramming Cancer Cell 2013 23 6 768 783 23764001 10.1016/j.ccr.2013.04.020 6. Hur W Rhim H Jung CK SOX4 overexpression regulates the p53-mediated apoptosis in hepatocellular carcinoma: clinical implication and functional analysis in vitro Carcinogenesis 2010 31 7 1298 1307 20400479 10.1093/carcin/bgq072 7. Lombardi E Almanza G Kowal K miR-335-laden B cell-derived extracellular vesicles promote SOX4-dependent apoptosis in human multiple myeloma cells J Pers Med 2021 11 12 1240 34945712 10.3390/jpm11121240 PMC8707697 8. Dong M Blobe GC Role of transforming growth factor-β in hematologic malignancies Blood 2006 107 12 4589 4596 16484590 10.1182/blood-2005-10-4169 PMC1895802 9. Peng X Liu G Peng H Chen A Zha L Wang Z. SOX4 contributes to TGF-β-induced epithelial–mesenchymal transition and stem cell characteristics of gastric cancer cells Genes Dis 2017 5 1 49 61 30258935 10.1016/j.gendis.2017.12.005 PMC6147107 10. Urashima M Ogata A Chauhan D Transforming growth factor-beta1: differential effects on multiple myeloma versus normal B cells Blood 1996 87 5 1928 1938 8634441 11. Lanier LL Testi R Bindl J Phillips JH Identity of Leu-19 (CD56) leukocyte differentiation antigen and neural cell adhesion molecule J Exp Med 1989 169 6 2233 2238 2471777 10.1084/jem.169.6.2233 PMC2189344 12. Geng C Zhou H Wang H Newly diagnosed multiple myeloma patients with CD56 expression benefit more from autologous stem cell transplantation BMC Cancer 2022 22 1 1349 36564753 10.1186/s12885-022-10382-0 PMC9783713 13. Ely SA Knowles DM Expression of CD56/neural cell adhesion molecule correlates with the presence of lytic bone lesions in multiple myeloma and distinguishes myeloma from monoclonal gammopathy of undetermined significance and lymphomas with plasmacytoid differentiation Am J Pathol 2002 160 4 1293 1299 11943714 10.1016/S0002-9440(10)62556-4 PMC1867213 14. Iqbal MS Otsuyama K Shamsasenjan K Asaoku H Kawano MM CD56 expression in human myeloma cells derived from the neurogenic gene expression: possible role of the SRY-HMG box gene, SOX4 Int J Hematol 2010 91 2 267 275 20049565 10.1007/s12185-009-0474-3 15. Göbel M Eisele L Möllmann M Progranulin is a novel independent predictor of disease progression and overall survival in chronic lymphocytic leukemia PLoS One 2013 8 8 e72107 24009671 10.1371/journal.pone.0072107 PMC3751910 ",
  "metadata": {
    "Title of this paper": "Progranulin is a novel independent predictor of disease progression and overall survival in chronic lymphocytic leukemia",
    "Journal it was published in:": "Haematologica",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485302/"
  }
}