{
  "title": "Paper_490",
  "abstract": "pmc Mol Med Mol Med 325 molmed Molecular Medicine 1076-1551 1528-3658 The Feinstein Institute for Medical Research PMC12482102 PMC12482102.1 12482102 12482102 41023804 10.1186/s10020-025-01363-7 1363 1 Research LncRNA CASC19 promotes pancreatic cancer progression by increasing PSPC1 protein stability and facilitating the oncogenic PSPC1/ β-Catenin pathway Mukherjee Moumita 1 2 Ghosh Swati 1 Maity Atanu 3 Ray Sukanta 4 Saha Hemabha 4 Bahadur Ranjit Prasad 3 5 Goswami Srikanta sg1@nibmg.ac.in 1 2 1 https://ror.org/057y6sk36 grid.410872.8 0000 0004 1774 5690 Biotechnology Research and Innovation Council, National Institute of Biomedical Genomics (BRIC-NIBMG), 2 https://ror.org/00nc5f834 grid.502122.6 0000 0004 1774 5631 Regional Centre for Biotechnology, 3 https://ror.org/03w5sq511 grid.429017.9 0000 0001 0153 2859 Bioinformatics Centre, Department of Bioscience and Biotechnology, Indian Institute of Technology Kharagpur, 4 https://ror.org/00ysvbp68 grid.414764.4 0000 0004 0507 4308 Institute of Post Graduate Medical Education & Research, 5 https://ror.org/03w5sq511 grid.429017.9 0000 0001 0153 2859 Computational Structural Biology Laboratory, Department of Bioscience and Biotechnology, Indian Institute of Technology Kharagpur, 29 9 2025 2025 31 478381 305 12 4 2025 27 8 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Background Pancreatic cancer, a highly lethal malignancy, is influenced by complex lncRNA-mediated gene expression. This study identified CASC19 as a significantly overexpressed lncRNA with high oncogenic potential in pancreatic cancer, aiming to uncover its molecular mechanism in tumor progression. Methods CASC19 expression was evaluated by qRT-PCR. Proliferation abilities of CASC19 were evaluated by MTT assay, cell cycle and apoptosis assay, upon CASC19 overexpression and knockdown. Whereas its metastatic potential was evaluated by wound healing, migration and invasion assay. The effect of CASC19 on cellular transcriptome was also examined by RNA sequencing after CASC19 overexpression and silencing. Subcellular localization of the lncRNA was examined by subcellular fractionation followed by qRT-PCR. To find out the molecular mechanism of lncRNA function, RNA-pull down, mass-spectrometry, immunoprecipitation, protein stability and ubiquitination assays were done. Results High CASC19 expression was found in pancreatic tumor tissues and multiple pancreatic cancer cell lines. In-vitro loss and gain-of-function experiments showed that CASC19 is an oncogenic lncRNA promoting proliferation and metastasis of pancreatic cancer, while inhibiting apoptosis. CASC19 was also found to regulate global transcriptome of pancreatic cancer cells, affecting pathways like TGF-β signaling pathway, β-Catenin-TCF complex assembly, etc. CASC19 was localized to nucleus of pancreatic cancer cells and was identified to interact with PSPC1, a metastatic reprogramming protein. The interaction results in prevention of ubiquitin-mediated degradation of PSPC1. Increased availability of PSPC1, in turn, potentiates nuclear retention of β-Catenin which ultimately triggers pancreatic cancer progression. Conclusion Our findings elaborate the mechanism of CASC19 mediated tumorigenesis in pancreatic cancer, highlighting the role of PSPC1 in the process. Targeting CASC19/PSPC1/β-Catenin axis could be a novel approach to impede the progression of the disease. Supplementary Information The online version contains supplementary material available at 10.1186/s10020-025-01363-7. Keywords Pancreatic cancer LncRNA CASC19 PSPC1 Βeta-catenin Metastasis Department of Biotechnology, Government of India BT/PR44771/MED/30/2415/2022 Goswami Srikanta Intramural Grant from BRIC-NIBMG 60105 Goswami Srikanta pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © The Feinstein Institute for Medical Research 2025 Introduction Pancreatic cancer is one of the most aggressive cancer types worldwide and it has been estimated to be the next leading cause of death due to malignancy after lung cancer by 2030 in the United States (Gordon-Dseagu et al. 2018 2021 2013 2020 2015 Massive explosion of global transcriptomic data has remodeled the mRNA-centric paradigm of transcriptome by the omnipresent noncoding RNAs, of which long noncoding RNAs (lncRNAs) are most noteworthy in terms of their tissue-specific expression pattern and redundant functionality. LncRNAs are > 200nt non-coding transcripts transcribed by RNA Polymerase-II and individual lncRNAs manifest distinct RNA elements as RNA sequences or structures, critical for their functioning (Jarroux et al. 2017 2018 2012 2016 Emerging evidence suggests a diverse mode of action for lncRNAs. One of their familiar functions is regulation of transcription through epigenetic amendment like histone modification and chromatin remodeling (Lee 2012 2015 2014 2017 While exploring the deregulated lncRNA profile in pancreatic cancer, we found a cardinal lncRNA, Cancer Susceptibility Candidate 19 (CASC19) which has been shown to be deregulated in several other cancer types such as gastric cancer, colorectal cancer, non-small cell lung carcinoma, cervical cancer and nasopharyngeal carcinoma (Liu et al. 2020 2021 2019 2019a b 2020 2023a b c 2019 NR_120364 2021 2016 2019 2015 Methods Patient samples Pancreatic tumor tissues ( n n Cell lines and cell culture conditions Human pancreatic cancer cell lines AsPc1, MiaPaCa2 and BxPc-3 were kindly provided by Dr. S. Senapati from BRIC-Institute of Life Sciences (Odisha, India). Panc-1 pancreatic cancer cell line was obtained from cell repository of BRIC-National Centre for Cell Science (NCCS) (Maharashtra, India). Human pancreatic normal ductal epithelial cell line hTERT-HPNE and another pancreatic cancer cell line CAPAN-2 were purchased from the American Type Culture Collection (ATCC) (Manassas, VA, USA). HPNE cell Line was grown in 75% DMEM with 25% Medium M3 Base (INCELL Corporation LLC, San Antonio, TX, USA), 5% FBS, 10 ng/ml human recombinant EGF, 5.5 mM d-glucose (1 g/L), and 750 ng/ml puromycin. BxPc-3 cell line was cultured in RPMI1640 medium (Gibco; Thermo Fisher Scientific, USA) with 10% FBS and 1% antibiotic-antimycotic solution, whereas the other pancreatic cancer cell lines were maintained in Dulbecco’s modified Eagle’s medium (DMEM) (Gibco; Thermo Fisher Scientific, USA) supplemented with 10% fetal bovine serum (FBS) and 1% antibiotic-antimycotic solution. All the cells were maintained in a 5% CO2 saturated humidified incubator at 37 °C and the cells were routinely monitored to verify the absence of mycoplasma contamination. Transient and stable transfections For CASC19 overexpression, the human full length CASC19 was cloned into mammalian expression vector pcDNA3.1(+). The vector pcDNA3.1 with the inserted sequence along with the empty vector were transiently transfected into pancreatic cancer cell MIAPaCa-2 using the transfection reagent Lipofectamine 3000 (Invitrogen, Carlsbad, CA, USA) according to manufacturer’s instruction. To generate CASC19 overexpressing stable cell line, transiently transfected MIAPaCa-2 cells were selected using 1.5 µg/mL of geneticin for 14 days. For knockdown, CASC19 DsiRNAs and a scramble DsiRNA (IDT, catalog no.: 51-01-14-03) were purchased from IDT (Integrated DNA Technologies, USA). PSPC1 siRNAs (used in 1:1 ratio) and its negative control siRNA (Qiagen, Cat No.: SI03650318) were purchased from Qiagen (QIAGEN, Valencia, CA). All the siRNA sequences are given in Supplementary Table-S1. All the transient transfections were performed for 48 h, and post-transfection gene expression levels were assessed by qRT-PCR. RNA isolation and quantitative real-time PCR Total RNA from the cell lines was extracted using QIAzol ® Immunoblotting Total protein from desired cell lines were isolated using RIPA buffer supplemented with protease inhibitors. Pierce BCA protein assay kit was used for protein concentration estimation according to the manufacturer’s protocol. SDS-PAGE gel was run for electrophoresis and proteins were then transferred to PVDF membrane (Merck Millipore). The proteins in the membrane were then blocked with 5% non-fat dry milk in TBST for 1.5 h. Then the PVDF membrane was washed and incubated overnight with primary antibody at 40 C. Next day, the membrane was re-incubated with secondary antibody for 1 h. The protein bands were detected by Clarity Western ECL Substrate (BioRad) and Image Lab software was used for the densitometric analysis. Refer to Supplementary Table-S3 for a list of the antibodies used in this research. MTT cell proliferation assay Post lncRNA overexpression and knockdown, cell proliferation was assessed by MTT (3-(4,5-dimethylthiazol-2-yl)−2,5-diphenyltetrazolium bromide) assay. Cells were seeded in 96-well plate at an initial density of 2 × 10 3 Cell cycle assay Stable and transiently transfected cells were counted and fixed with 75% ethanol overnight at −20 °C. Then the cells were washed with PBS and stained with Ribonuclease A added propidium iodide (20 µg/ml) staining solution at room temperature in dark for 30 min before analysis. The cell cycle distribution was examined through flow cytometry (BD-FACS-Aria™-Fusion Flow Cytometer, USA). Apoptosis assay For apoptosis assay, Annexin V-FITC Apoptosis kit (APOAF, sigma) was used following manufacturer’s instructions using BD-FACS-Aria™-Fusion Flow Cytometer (BD Biosciences, USA). With this flowcytometric dual staining method, the percentage of early and late apoptotic cells were determined in lncRNA overexpressing and knockdown cells. Wound healing assay For evaluation of two-dimensional cell migration, wound-healing assay was used. Cells were seeded in 6-well plates and cultured in 0.5% FBS media until 80–90% confluency. Then, the cell monolayer was scratched with a 200uL microtip and observed healing of the scratched area under microscope at 0 h, 24 h and 48 h time points. At least three fields were photographed for each plate and analyzed with ImageJ software. Trans-well migration and invasion assay For migration assay, transfected cells were harvested in 24-well trans-well plates with 8-µm pore inserts (Avantor Biosciences). Cell suspension containing 2 × 10 4 Subcellular fractionation Nucleo-cytoplasmic fractionation of the MIAPaCa-2 cell lines was done using the NE-PER Nuclear and Cytoplasmic Extraction kit (Thermo Fisher Scientific) according to the manufacturer’s protocol. To evaluate the target RNA expression, RNA was extracted from both the cytosolic and nuclear part and subjected to qRT-PCR. GAPDH and β-actin were used as cytoplasmic control and U6, GAPDH intron, MALAT1 and Lamin were used as nuclear control. RNA sequencing and analysis Total RNA was extracted using Trizol method from the lncRNA overexpressing and knockdown cell lines along with their respective control groups and total mRNA sequencing was done using Illumina NovaSeq 6000. Quality assessment was carried out using Agilent Bio-analyser 2100 with Agilent nano kit and library preparation was performed by TruSeq Stranded Total RNA Library prep kit. After the RNA sequencing, FastQ files were aligned to reference genome from NCBI using DRAGEN RNA aligner. The raw count matrix was generated from the quantification files using ‘txtimport’ tool. Log2 Fold change comparison between the groups was performed using ‘DESeq2’ and significantly expressed genes were selected with log2foldchange ≥ +/- 1.5 & p RNA pull down and mass-spectrometry (MS) assay Sense and antisense transcripts of CASC19 were transcribed in vitro using the TranscriptAid T7 High Yield Transcription Kit (Thermo Scientific). For the in vitro transcription, sense and antisense CASC19 were cloned in pcDNA 3.1 under the T7 promoter. The constructs were then linearized with the restriction enzyme at the 3’ end of the insert, gel purified and used as template for the transcription reaction. Pierce™ RNA 3’ End Desthiobiotinylation Kit was used for biotin labelling of the sense and antisense transcripts of CASC19. Biotinylated RNA probes were then purified and used for RNA pull down with Pierce Magnetic RNA-Protein Pull-Down Kit according to the manufacturer’s protocol (in accordance with the manufacturer’s instructions) using nuclear lysate of MIAPaCa-2 cell. Finally, eluted proteins associated with the transcripts were identified by mass spectrometry (MS) and western blot. Molecular docking The structure of the lncRNA CASC19 was modelled using trRosettaRNA webserver (Wang et al. 2023a b c 2017 2000 2017 2024 1995 2002 RNA immunoprecipitation (RIP) assay Cells were harvested in 10 cm culture dishes. Approximately 1 × 10 7 Co-immunoprecipitation (CO-IP) assay Cells were collected and lysed in 0.5mL IP lysis buffer with added proteinase inhibitor. The lysate was then precleared and incubated with desired primary antibody (anti-PSPC1 and anti- β catenin antibody) at 40 C overnight. Next the antibody-protein complex was incubated with A/G dynabeads (Thermo Scientific) and incubated on rotation for 4 h at 4 °C. The bead-protein-antibody complex was then washed and eluted using Laemmli buffer followed by western blot. Cycloheximide (CHX) Chase assay The cycloheximide chase assay was performed by treating the cells with translational inhibitor cycloheximide (CHX) (Sigma Aldrich) at a concentration of 50 μm for 0 h. 2 h, 4 h and 8 h. Total protein was collected from the cells at indicated time points and subjected to western blot after protein quantification. Half-life of protein was calculated in every group of cells from the densitometric analysis of the western bands. MG132 assay CASC19 overexpressing and knockdown cell lines along with their control lines were treated with MG132 (20 µmol/L) (Sigma Aldrich) and incubated for 4 h. Total cellular protein from each group was collected and PSPC1 protein expression was detected by densitometric analysis of the western blot images with ImageLab software. Ubiquitination assay Cells were treated with proteasome inhibitor MG132 at a concentration of 20 µmol/L for 4 h. Then the cells were collected and lysed with IP lysis buffer. The lysate was then immunoprecipitated with anti-PSPC1 antibody and anti-IgG antibody and the eluted protein was immunoblotted with anti-Ubiquitin antibody. Bio-informatic analysis GEPIA2 (Gene Expression Profiling Interactive Analysis 2) database was used to get the differentially expressed lncRNAs from TCGA pancreatic cancer RNA sequencing data (Tang et al. 2019 2013 2019 2012 Statistical analysis All the experiments were repeated at least three times. Values measured were presented as mean ± standard deviation and comparisons of the values between two groups were performed using Student’s paired t-test. p Results Elevated CASC19 expression was found to be associated with pancreatic cancer progression and reduced patient survival rates From our previous study, we have taken the list of differentially expressed lncRNAs (DElncRNAs) in pancreatic cancer. The study included microarray data of 11 pancreatic tumor tissue and 9 adjacent normal pancreatic tissue ( GSE143754 p 2020 p 2021 2019 2019a b 2020 2023a b c 2019 2021 2020  Fig. 1 CASC19 overexpression is correlated with advanced cancer and poor prognosis in pancreatic cancer. A B C n n p D E F Effect of CASC19 on pancreatic cancer cell proliferation, cell cycle and apoptosis Gene expression level of CASC19 was determined in several human pancreatic cancer cell lines (AsPc-1, BxPc-3, MIAPaCa-2, Panc-1 and CAPAN-2) and one normal human pancreatic ductal cell line (hTERT-HPNE) using qRT-PCR. CASC19 expression was found to be much higher in the pancreatic cancer cell lines than the normal pancreatic ductal cell line (Fig. 2A). Amongst these five pancreatic cancer cell lines, MIAPaCa-2 had the intermediate expression level of CASC19 and thus we chose the cell line for further investigations and cellular/functional assays. Therefore, we overexpressed and silenced CASC19 expression in the MIAPaCa-2 cell line by stable and transient transfection respectively and the CASC19 expression levels were verified using qRT-PCR in the transfected cells (Fig. 2B, C). This was followed by some cellular assays to determine the oncogenic effect of CASC19 on pancreatic cancer progression.  Fig. 2 CASC19 promotes proliferation and cell cycle progression and suppress apoptosis of pancreatic cancer cell. A B C . D E F G H I J . p The proliferation of pancreatic cancer cells was notably enhanced by CASC19 overexpression (Fig. 2D) and reduced by downregulation of CASC19, as measured by MTT assay (Fig. 2E). Cell cycle assay showed that CASC19 overexpression exhibited a prolonged S phase with a shorter G1 phase, thus promoting cell cycle whereas CASC19 knockdown aided cell cycle arrest (Fig. 2F and G). Flow cytometry-based apoptosis assay demonstrated that percentage of apoptotic cells was markedly diminished in CASC19 overexpressing cell lines compared to their vector control groups (Fig. 2H) and there was a significant elevation in number of cells undergoing apoptosis in CASC19 silenced MIAPaCa-2 cells (Fig. 2I). Consistent with these observations, it was also found that overexpression of CASC19 increased the protein expression of cell cycle markers CDC20, CDK1 and cyclin B1, whereas expression of these proteins decreased with silencing of CASC19, as evidenced by western blotting. Furthermore, CASC19 overexpression led to an increase in expression of anti-apoptotic protein Bcl-2 and a reduction in the expression of pro-apoptotic protein Bax. Similarly, protein expression of Bcl-2 decreased and Bax increased when CASC19 was silenced in pancreatic cancer cell line MIAPaCa-2 (Fig. 2J). These findings inferred that high CASC19 expression intensifies pancreatic cancer progression through modulating cell proliferation, cell cycle and apoptosis. CASC19 promotes pancreatic cancer cell migration Metastatic potential of a cancer cell is generally determined by the migratory and invasive properties of the cell, and we wanted to investigate whether changes in CASC19 expression could modulate the phenomenon. The wound-healing assay revealed that CASC19 overexpressing cells showed a significant increase in wound-closure rate than the control cells (Fig. 3A) and a decreased rate of wound-healing was seen in cells with the CASC19 knockdown, suggesting restricted motility (Fig. 3B). Transwell assay further confirmed that CACS19 overexpression led to an augmented migratory and invasive potential in pancreatic cancer cell line MIAPaCa-2. However, a reduced migration and invasion was seen in pancreatic cancer cell line with loss of expression of the CASC19 (Fig. 3C). Collectively, these findings suggest that elevated expression of CASC19 promote metastasis in pancreatic cancer cells. Considering the key role of the epithelial–mesenchymal transition (EMT) in metastasis, we investigated whether CASC19 could influence the process of EMT by analyzing the protein and mRNA levels of various EMT-related markers. As illustrated in Fig. 3D, overexpression of CASC19 led to an increase in the mesenchymal marker Vimentin, Snail, Slug, Claudin and ZEB1, while the expression of epithelial marker E-cadherin decreased. In support of this observation, expression of mesenchymal markers was decreased, and epithelial markers were found to be increased with CASC19 knockdown (Fig. 3D). RNA expression of the mesenchymal markers was also changed according to their protein expression upon CASC19 overexpression and knockdown (Fig. 3E). Overall, these findings demonstrate that elevated expression of CASC19 contributes to EMT and metastasis in pancreatic cancer cells.  Fig. 3 Alteration in CASC19 expression governs the migratory trait of cell in pancreatic cancer A B p C p D E . p CASC19 being a nuclear LncRNA modulates the global transcriptome in pancreatic cancer To gain insights into the molecular mechanism of the lncRNAs, determining their subcellular localization is very crucial (Carlevaro-Fita and Johnson 2019 p  Fig. 4 CASC19, a nuclear lncRNA, exerts a modulatory effect on the global transcriptome in pancreatic cancer. A B C D E CASC19 interacts with a nuclear protein PSPC1 and increases its stability Long noncoding RNAs exert their functions primarily by interacting with RNA binding proteins to regulate various cellular processes. Thus, to elucidate the mechanism of action of CASC19 and identify its interacting proteins, we performed an RNA pull down assay followed by mass-spectrometry. Sense and antisense transcripts of CASC19 were transcribed in-vitro, biotinylated and incubated with nuclear lysate of pancreatic cancer cell MIAPaCa-2 and the pulled protein extracts were then subjected to mass-spectrometry (Fig. 5A). A total of 53 proteins were found to be bound specifically to the sense CASC19 transcript (Supplementary Table-S7). In parallel, we used two bioinformatic tools, CatRapid’ and ‘beRBP’ to predict the interacting proteins for CASC19 and from there we predicted 307 (number of RNA Binding Domains Instances ≥ 3) (Supplementary Table-S8) and 144 CASC19 interacting proteins (Supplementary Table-S9) respectively. Additionally, we wanted to consider only The RBPs deregulated in pancreatic cancer and thus we have taken 186 deregulated RBPs in pancreatic cancer from our previous study (Mukherjee and Goswami 2021 2023  Fig. 5 CASC19 binds to PSPC1 and increases its stability in pancreatic cancer cells. A B C D E p F G p H I p J L Knockdown of PSPC1 partially recovered the oncogenic phenotypes influenced by CASC19 overexpression To further confirm that CASC19-induced oncogenic functions are mediating by PSPC1 in pancreatic cancer, we performed a rescue experiment in CASC19 overexpressing cells with siRNA against PSPC1. Western-blot assay of the rescue experiment showed that upregulated PSPC1 protein level induced by CASC19 overexpression was abolished by PSPC1 siRNA in pancreatic cancer cell MIAPaCa-2 (Fig. 6A). Outcome of MTT assay demonstrated that PSPC1 silencing could reverse the increased proliferation in pancreatic cancer cells caused by CASC19 overexpression (Fig. 6B). Moreover, elevated wound-healing, migration and invasion ability of cancer cells with CASC19 upregulation were significantly attenuated by PSPC1 siRNA in respect to control cells (Fig. 6C, D). Hence, it can be concluded that CASC19 induced tumorigenic traits are driven by PSPC1 protein.  Fig. 6 Oncogenic phenotypes induced by CASC19 overexpression rescued partly by PSPC1 knockdown. A B D p CASC19 drives pancreatic cancer progression by maintaining nuclear β-Catenin abundance through PSPC1 Literature suggests that PSPC1 interacts with β-Catenin and maintains the nuclear retention of β-Catenin to promote the transcription of EMT and metastasis-related genes via wnt-β-Catenin pathway in hepatocellular carcinoma (Lang et al. 2019 7  Fig. 7 CASC19-PSPC1-β Catenin axis promotes oncogenicity through nuclear retention of β Catenin. A B C p D Discussion Worldwide, pancreatic cancer is recognized as one of the most prevalent and lethal forms of gastrointestinal malignancies with a poor understanding of the mechanism underlying tumorigenesis and disease progression (Li et al. 2022 2017 2017 2022 2015 2016 2023a b c 2018 CASC19 has been the focus of many recent studies, revealing its aberrant expression and functional roles across multiple cancers (Liu et al. 2020 2021 2019 2019a b 2020 2023a b c 2019 There is a broad consensus that subcellular localization of lncRNAs is the primary determinant of their molecular activities (Carlevaro-Fita and Johnson 2019 2021 2019a b 2020 2024 2021 2017 2021 2016 2017 2024 2012 2021 2024 Subcellular distribution of lncRNAs largely determine their molecular interaction network for potential functional mechanism (Zhang et al. 2014 2021 2022 2023a b c 2023 Paraspeckle component protein PSPC1 is found to be upregulated in breast cancer, lung cancer, nasopharyngeal cancer and hepatocellular carcinoma along with pancreatic cancer (Zhan et al. 2023 2021 2022 2024 2022 2019 Despite the insights gained, there are certain limitations in our study. Firstly, we have not determined the specific site where CASC19 binds to PSPC1. Secondly, while our findings demonstrated the involvement of the ubiquitin-proteasome system in the regulation of PSPC1 by CASC19, the ligase involved in the ubiquitination of PSPC1 has not been identified. Also, the precise mechanism through which CASC19 restrains the ubiquitination of PSPC1 remains unexplored. Therefore, further research is needed to uncover the detailed molecular mechanisms of pancreatic carcinogenesis mediated by CASC19-PSPC1 axis. Conclusion To summarize, our results imply that CASC19 is an oncogenic lncRNA that promotes tumor proliferation, cell cycle, EMT and metastasis in pancreatic cancer with a reduction in apoptosis and is linked to poor prognosis in pancreatic cancer. CASC19 achieves its oncogenic effects by facilitating PSPC1 protein stability via reduction of its proteasome-dependent degradation and favouring nuclear sequestration of β-catenin. Accompanied with continued research, the novel CASC19/PSPC1/β-catenin axis holds promise as a potential and effective therapeutic target for advanced pancreatic cancer. Supplementary Information  Supplementary Material 1: Supplementary Figure-S1. Molecular docking structures of CASC19-PSPC1 interaction. A Predicted model of lncRNA CASC19. A total of 129 homologous sequences were used to cover the entire length of the lncRNA which consists of several stem and loop regions with a large part of the RNA forming stable tertiary structure. B Crystal structure of PSPC1 (PDB Id: 5IFN). Two monomers of the dimeric structure are shown in green and gray ribbons. The amino acids present at the dimeric interface are colored yellow and presented in sticks. C The structure of the CASC19-PSPC1 complexes along with dock score (HDOCK score) for docking using HDOCK. D The four best docked structure of CASC19-PSPC1 interaction from HADDOCK with their respective dock scores. E The 2D interaction diagram of the interaction between PSPC1 and CASC19. The hydrogen bonds between amino acids and nucleic acids are shown by green dotted lines. The residues and nucleotides marked by semi circles are involved in non-polar interaction  Supplementary Material 2: Supplementary Figure-S2. CASC19 overexpression decreases PSPC1 ubiquitination in normal pancreatic HPNE cell line. A  Supplementary Material 3: Supplementary Figure-S3. Co-immunoprecipitation β-catenin showing PSPC1-β Catenin interaction. Co-immunoprecipitation with anti-β-catenin antibody and immunoblotting for PSPC1 showing PSPC1-β Catenin interaction in pancreatic cancer cell line MIAPaCa-2  Supplementary Material 4: Supplementary Table-S1 A comprehensive list of primers employed in this study for q-PCR  Supplementary Material 5: Supplementary Table-S2 Information of the siRNAs used in this study for knockdown  Supplementary Material 6: Supplementary Table-S3 The details of the antibodies used in this study  Supplementary Material 7: Supplementary Table-S4 Common DEGs in pancreatic cancer from a microarray data and TCGA-RNA sequencing data  Supplementary Material 8: Supplementary Table-S5 Differentially expressed genes upon CASC19 overexpression in pancreatic cancer cell line MIAPaCa-2  Supplementary Material 9: Supplementary Table-S6 Differentially expressed genes upon CASC19 knockdown with siRNA in pancreatic cancer cell line MIAPaCa-2  Supplementary Material 10: Supplementary Table-S7 List of 53 RNA binding proteins obtained from RNA-pull down and mass-spectrometry that bound exclusively to sense strand of CASC19  Supplementary Material 11: Supplementary Table-S8 RNA binding proteins predicted to be bound to CASC19 as per CatRapid database  Supplementary Material 12: Supplementary Table-S9 RNA binding proteins predicted to be bound to CASC19 from beRBP database Abbreviations LncRNA Long non-coding ribonucleic acid ZEB1 Zinc Finger E-Box Binding Homeobox 1 TGF-β Transforming Growth Factor Beta CREB1 CAMP Responsive Element Binding Protein 1 Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements MM acknowledges University Grants Commission (UGC) (UGC-Ref. No.: 729/(CSIR-UGC NET DEC. 2018) and BRIC-NIBMG (RCB/NIBMG-PhD/2019/1010). We acknowledge Dr. Arvind Korwar from BRIC-NIBMG, Kalyani, India and Dr. Somsubhra Nath from Presidency University, Kolkata, India for their valuable suggestions and Core Genomics and Proteomics Facilities of BRIC-NIBMG for technical support. ‘GraphPad Prism’ and ‘Biorender’ tools were used for making graphical representation of the data and illustrative images respectively. Authors’ contributions MM carried out molecular, cellular and biochemical studies, along with sequence analysis, and also generated the manuscript draft. S.Ghosh carried out some of the biochemical and cellular studies and assisted in manuscript drafting. AM and RPB performed the molecular docking analysis. HS and SR helped in conceptualizing the project, recruited the study participants, performed clinical analysis. S.Goswami conceptualized, designed and supervised the study, acquired the fund and finalized the manuscript. All authors read and approved the final manuscript, conception and design or acquisition of data or analysis and interpretation of data. Funding The study has been supported by funding from Department of Biotechnology, Government of India (Grant no. BT/PR44771/MED/30/2415/2022) to Dr. Srikanta Goswami and also from intramural funding from BRIC-NIBMG to Dr. Srikanta Goswami. The funding body has approved the design of the study by Dr. Srikanta Goswami. However, it had no role in collection, analysis, and interpretation of data and in writing the manuscript. Data availability The data has been submitted to the Indian Biological Data Centre with the IBDC Study accession number INRP000259. Declarations Ethics approval and consent to participate The study has been approved by Institutional Ethics Committee of National Institute of Biomedical Genomics, Kalyani, West Bengal, India, Institute of Post Graduate Medical Education & Research, Kolkata, West Bengal, India Appropriate prior written informed consent from the study participants have been taken following the guidelines of the Ethics committees and in an approved format. We also do not intend to publish individual patient data in the form of images, videos, voice recordings etc. The study does not involve any animals. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References Agostini F Zanzoni A Klus P Marchese D Cirillo D Tartaglia GG CatRAPID omics: a web server for large-scale prediction of protein-RNA interactions Bioinformatics 2013 29 2928 30 10.1093/bioinformatics/btt495 23975767 PMC3810848 Agostini F, Zanzoni A, Klus P, Marchese D, Cirillo D, Tartaglia GG. CatRAPID omics: a web server for large-scale prediction of protein-RNA interactions. Bioinformatics. 2013;29:2928–30. 23975767 10.1093/bioinformatics/btt495 PMC3810848 Berman HM Westbrook J Feng Z Gilliland G Bhat TN Weissig H Shindyalov IN Bourne PE Protein Data Bank Nucleic Acids Res 2000 28 235 42 10.1093/nar/28.1.235 10592235 PMC102472 Berman HM, Westbrook J, Feng Z, Gilliland G, Bhat TN, Weissig H, et al. Protein Data Bank. Nucleic Acids Res. 2000;28:235–42. 10592235 10.1093/nar/28.1.235 PMC102472 Bhan A Soleimani M Mandal SS Long noncoding RNA and cancer: a new paradigm Cancer Res 2017 77 3965 81 10.1158/0008-5472.CAN-16-2634 28701486 PMC8330958 Bhan A, Soleimani M, Mandal SS. Long noncoding RNA and cancer: a new paradigm. Cancer Res. 2017;77:3965–81. 28701486 10.1158/0008-5472.CAN-16-2634 PMC8330958 Bridges MC Daulagala AC Kourtidis A LNCcation: LncRNA localization and function J Cell Biol 2021 10.1083/jcb.202009045 33464299 PMC7816648 Bridges MC, Daulagala AC, Kourtidis A. LNCcation: LncRNA localization and function. J Cell Biol. 2021. 10.1083/jcb.202009045. 33464299 10.1083/jcb.202009045 PMC7816648 Carlevaro-Fita J Johnson R Global positioning system: understanding long noncoding RNAs through subcellular localization Mol Cell 2019 73 869 83 10.1016/j.molcel.2019.02.008 30849394 Carlevaro-Fita J, Johnson R. Global positioning system: understanding long noncoding RNAs through subcellular localization. Mol Cell. 2019;73:869–83. 30849394 10.1016/j.molcel.2019.02.008 Cheng Y Jutooru I Chadalapaka G Corton JC Safe S The long non-coding RNA HOTTIP enhances pancreatic cancer cell proliferation, survival and migration Oncotarget 2015 6 10840 52 10.18632/oncotarget.3450 25912306 PMC4484423 Cheng Y, Jutooru I, Chadalapaka G, Corton JC, Safe S. The long non-coding RNA HOTTIP enhances pancreatic cancer cell proliferation, survival and migration. Oncotarget. 2015;6:10840–52. 25912306 10.18632/oncotarget.3450 PMC4484423 Chhatriya B Mukherjee M Ray S Saha B Lahiri S Halder S Ghosh I Khamrui S Das K Bhattacharjee S Mohapatra SK Goswami S Transcriptome analysis identifies putative multi-gene signature distinguishing benign and malignant pancreatic head mass J Transl Med 2020 18 420 10.1186/s12967-020-02597-1 33160365 PMC7648960 Chhatriya B, Mukherjee M, Ray S, Saha B, Lahiri S, Halder S, et al. Transcriptome analysis identifies putative multi-gene signature distinguishing benign and malignant pancreatic head mass. J Transl Med. 2020;18:420. 33160365 10.1186/s12967-020-02597-1 PMC7648960 Colak S Ten Dijke P Targeting TGF-beta signaling in cancer Trends Cancer 2017 3 56 71 10.1016/j.trecan.2016.11.008 28718426 Colak S, Ten Dijke P. Targeting TGF-beta signaling in cancer. Trends Cancer. 2017;3:56–71. 28718426 10.1016/j.trecan.2016.11.008 Das S Batra SK Pancreatic cancer metastasis: are we being pre-EMTed? Curr Pharm Des 2015 21 1249 55 10.2174/1381612821666141211115234 25506899 PMC4457289 Das S, Batra SK. Pancreatic cancer metastasis: are we being pre-EMTed? Curr Pharm Des. 2015;21:1249–55. 25506899 10.2174/1381612821666141211115234 PMC4457289 De Lano, W.L. (2002) The PyMOL Molecular Graphics System. Version 0.99rc6 Schrödinger, LLC, De Lano Scientific, San Carlos. Gordon-Dseagu VL Devesa SS Goggins M Stolzenberg-Solomon R Pancreatic cancer incidence trends: evidence from the surveillance, epidemiology and end results (SEER) population-based data Int J Epidemiol 2018 47 427 39 10.1093/ije/dyx232 29149259 PMC5913617 Gordon-Dseagu VL, Devesa SS, Goggins M, Stolzenberg-Solomon R. Pancreatic cancer incidence trends: evidence from the surveillance, epidemiology and end results (SEER) population-based data. Int J Epidemiol. 2018;47:427–39. 29149259 10.1093/ije/dyx232 PMC5913617 Gough N.R Xiang X Mishra L TGF-beta signaling in liver, pancreas, and Gastrointestinal diseases and cancer Gastroenterology 2021 161 434 52 10.1053/j.gastro.2021.04.064 33940008 PMC8841117 Gough N.R., Xiang X, Mishra L. TGF-beta signaling in liver, pancreas, and Gastrointestinal diseases and cancer. Gastroenterology. 2021;161:434–52. e415. 33940008 10.1053/j.gastro.2021.04.064 PMC8841117 Guttman M Rinn JL Modular regulatory principles of large non-coding RNAs Nature 2012 482 339 46 10.1038/nature10887 22337053 PMC4197003 Guttman M, Rinn JL. Modular regulatory principles of large non-coding RNAs. Nature. 2012;482:339–46. 22337053 10.1038/nature10887 PMC4197003 He H Zhang L Lin K Huang Z Zhou Y Lin S Su Y Pan J The prognosis value of PSPC1 expression in nasopharyngeal cancer Cancer Manag Res 2021 13 3281 91 10.2147/CMAR.S300567 33883941 PMC8053714 He H, Zhang L, Lin K, Huang Z, Zhou Y, Lin S, et al. The prognosis value of PSPC1 expression in nasopharyngeal cancer. Cancer Manag Res. 2021;13:3281–91. 33883941 10.2147/CMAR.S300567 PMC8053714 Honorato RV Trellet ME Jimenez-Garcia B Schaarschmidt JJ Giulini M Reys V Koukos PI Rodrigues J Karaca E van Zundert GCP Roel-Touris J van Noort CW Jandova Z Melquiond ASJ Bonvin A The HADDOCK2.4 web server for integrative modeling of biomolecular complexes Nat Protoc 2024 19 3219 41 10.1038/s41596-024-01011-0 38886530 Honorato RV, Trellet ME, Jimenez-Garcia B, Schaarschmidt JJ, Giulini M, Reys V, Koukos PI, Rodrigues J, Karaca E, van Zundert GCP, Roel-Touris J, van Noort CW, Jandova Z, Melquiond ASJ, Bonvin A. The HADDOCK2.4 web server for integrative modeling of biomolecular complexes. Nat Protoc. 2024;19:3219–41. 38886530 10.1038/s41596-024-01011-0 Huang H Li L Wen K Interactions between long non–coding RNAs and RNA–binding proteins in cancer (Review) Oncol Rep 2021 10.3892/or.2021.8207 34676873 PMC8548813 Huang H, Li L, Wen K. Interactions between long non–coding RNAs and RNA–binding proteins in cancer (Review). Oncol Rep. 2021. 10.3892/or.2021.8207. 34676873 10.3892/or.2021.8207 PMC8548813 Jarroux J Morillon A Pinskaya M History, discovery, and classification of LncRNAs Adv Exp Med Biol 2017 1008 1 46 10.1007/978-981-10-5203-3_1 28815535 Jarroux J, Morillon A, Pinskaya M. History, discovery, and classification of LncRNAs. Adv Exp Med Biol. 2017;1008:1–46. 28815535 10.1007/978-981-10-5203-3_1 Kopp F Mendell JT Functional classification and experimental dissection of long noncoding RNAs Cell 2018 172 393 407 10.1016/j.cell.2018.01.011 29373828 PMC5978744 Kopp F, Mendell JT. Functional classification and experimental dissection of long noncoding RNAs. Cell. 2018;172:393–407. 29373828 10.1016/j.cell.2018.01.011 PMC5978744 Lang YD Chen HY Ho CM Shih JH Hsu EC Shen R Lee YC Chen JW Wu CY Yeh HW Chen RH Jou YS PSPC1-interchanged interactions with PTK6 and beta-catenin synergize oncogenic subcellular translocations and tumor progression Nat Commun 2019 10 5716 10.1038/s41467-019-13665-6 31844057 PMC6914800 Lang YD, Chen HY, Ho CM, Shih JH, Hsu EC, Shen R, et al. PSPC1-interchanged interactions with PTK6 and beta-catenin synergize oncogenic subcellular translocations and tumor progression. Nat Commun. 2019;10:5716. 31844057 10.1038/s41467-019-13665-6 PMC6914800 Lee JT Epigenetic regulation by long noncoding RNAs Science 2012 338 1435 9 10.1126/science.1231776 23239728 Lee JT. Epigenetic regulation by long noncoding RNAs. Science. 2012;338:1435–9. 23239728 10.1126/science.1231776 Li J Hou S Ye Z Wang W Hu X Hang Q Significance Long Non-Coding RNAs in Pancreatic Cancer: Biologic Functions, Mechanisms, and Clinical Significance Cancers (Basel) 2022 10.3390/cancers14092115 35565245 PMC9100048 Li J, Hou S, Ye Z, Wang W, Hu X, Hang Q, et al. Long Non-Coding RNAs in Pancreatic Cancer: Biologic Functions, Mechanisms, and Clinical Significance. Cancers (Basel). 2022. 10.3390/cancers14092115. 35565245 10.3390/cancers14092115 PMC9100048 Li L Chen H Gao Y Wang YW Zhang GQ Pan SH Ji L Kong R Wang G Jia YH Bai XW Sun B Long noncoding RNA MALAT1 promotes aggressive pancreatic cancer proliferation and metastasis via the stimulation of autophagy Mol Cancer Ther 2016 15 2232 43 10.1158/1535-7163.MCT-16-0008 27371730 Li L, Chen H, Gao Y, Wang YW, Zhang GQ, Pan SH, et al. Long noncoding RNA MALAT1 promotes aggressive pancreatic cancer proliferation and metastasis via the stimulation of autophagy. Mol Cancer Ther. 2016;15:2232–43. 27371730 10.1158/1535-7163.MCT-16-0008 Li Z Gao B Hao S Tian W Chen Y Wang L Zhang X Luo D Knockdown of lncRNA-PANDAR suppresses the proliferation, cell cycle and promotes apoptosis in thyroid cancer cells EXCLI J 2017 16 354 62 28507479 10.17179/excli2017-113 PMC5427478 Li Z, Gao B, Hao S, Tian W, Chen Y, Wang L, et al. Knockdown of lncRNA-PANDAR suppresses the proliferation, cell cycle and promotes apoptosis in thyroid cancer cells. EXCLI J. 2017;16:354–62. 28507479 10.17179/excli2017-113 PMC5427478 Liu F Chen J Li K Li H Zhu Y Zhai Y Lu B Fan Y Liu Z Chen X Jia X Dong Z Liu K Ubiquitination and deubiquitination in cancer: from mechanisms to novel therapeutic approaches Mol Cancer 2024 23 148 10.1186/s12943-024-02046-3 39048965 PMC11270804 Liu F, Chen J, Li K, Li H, Zhu Y, Zhai Y, et al. Ubiquitination and deubiquitination in cancer: from mechanisms to novel therapeutic approaches. Mol Cancer. 2024;23:148. 39048965 10.1186/s12943-024-02046-3 PMC11270804 Liu H Zheng W Chen Q Zhou Y Pan Y Zhang J Bai Y Shao C LncRNA CASC19 contributes to radioresistance of nasopharyngeal carcinoma by promoting autophagy via AMPK-mTOR pathway Int J Mol Sci 2021 10.3390/ijms22031407 33573349 PMC7866785 Liu H, Zheng W, Chen Q, Zhou Y, Pan Y, Zhang J, et al. LncRNA CASC19 contributes to radioresistance of nasopharyngeal carcinoma by promoting autophagy via AMPK-mTOR pathway. Int J Mol Sci. 2021. 10.3390/ijms22031407. 33573349 10.3390/ijms22031407 PMC7866785 Liu YJ Guo RX Han LP Gu H Liu MZ Effect of CASC19 on proliferation, apoptosis and radiation sensitivity of cervical cancer cells by regulating miR-449b-5p expression Zhonghua Fu Chan Ke Za Zhi 2020 55 36 44 32074771 10.3760/cma.j.issn.0529-567X.2020.01.007 Liu YJ, Guo RX, Han LP, Gu H, Liu MZ. Effect of CASC19 on proliferation, apoptosis and radiation sensitivity of cervical cancer cells by regulating miR-449b-5p expression. Zhonghua Fu Chan Ke Za Zhi. 2020;55:36–44. 32074771 10.3760/cma.j.issn.0529-567X.2020.01.007 Lu T Wei GH Wang J Shen J LncRNA CASC19 contributed to the progression of pancreatic cancer through modulating miR-148b/E2F7 axis Eur Rev Med Pharmacol Sci 2020 24 10462 71 33155202 10.26355/eurrev_202010_23399 Lu T, Wei GH, Wang J, Shen J. LncRNA CASC19 contributed to the progression of pancreatic cancer through modulating miR-148b/E2F7 axis. Eur Rev Med Pharmacol Sci. 2020;24:10462–71. 33155202 10.26355/eurrev_202010_23399 Mohankumar K Shrestha R Safe S Nuclear receptor 4A1 (NR4A1) antagonists target paraspeckle component 1 (PSPC1) in cancer cells Mol Carcinog 2022 61 73 84 10.1002/mc.23362 34699643 PMC8665050 Mohankumar K, Shrestha R, Safe S. Nuclear receptor 4A1 (NR4A1) antagonists target paraspeckle component 1 (PSPC1) in cancer cells. Mol Carcinog. 2022;61:73–84. 34699643 10.1002/mc.23362 PMC8665050 Mukherjee M Goswami S Identification of key deregulated RNA-binding proteins in pancreatic cancer by meta-analysis and prediction of their role as modulators of oncogenesis Front Cell Dev Biol 2021 9 713852 10.3389/fcell.2021.713852 34912796 PMC8667787 Mukherjee M, Goswami S. Identification of key deregulated RNA-binding proteins in pancreatic cancer by meta-analysis and prediction of their role as modulators of oncogenesis. Front Cell Dev Biol. 2021;9:713852. 34912796 10.3389/fcell.2021.713852 PMC8667787 Nair SS Kumar R Chromatin remodeling in cancer: a gateway to regulate gene transcription Mol Oncol 2012 6 6 611 9 10.1016/j.molonc.2012.09.005 23127546 PMC3538127 Nair SS, Kumar R. Chromatin remodeling in cancer: a gateway to regulate gene transcription. Mol Oncol. 2012;6(6):611–9. 23127546 10.1016/j.molonc.2012.09.005 PMC3538127 Nazemalhosseini Mojarad E Kashfi SM Mirtalebi H Almasi S Chaleshi V Kishani Farahani R Tarban P Molaei M Zali MR P JKK Prognostic significance of nuclear beta-Catenin expression in patients with colorectal cancer from Iran Iran Red Crescent Med J 2015 17 e22324 10.5812/ircmj.22324v2 26421170 PMC4584109 Nazemalhosseini Mojarad E, Kashfi SM, Mirtalebi H, Almasi S, Chaleshi V, Kishani Farahani R, Tarban P, Molaei M, Zali MR, P JKK. Prognostic significance of nuclear beta-catenin expression in patients with colorectal cancer from Iran. Iran Red Crescent Med J. 2015;17:e22324. 26421170 10.5812/ircmj.22324v2 PMC4584109 Poruk KE Firpo MA Adler DG Mulvihill SJ Screening for pancreatic cancer: why, how, and who? Ann Surg 2013 257 17 26 10.1097/SLA.0b013e31825ffbfb 22895395 PMC4113008 Poruk KE, Firpo MA, Adler DG, Mulvihill SJ. Screening for pancreatic cancer: why, how, and who? Ann Surg. 2013;257:17–26. 22895395 10.1097/SLA.0b013e31825ffbfb PMC4113008 Qu CX Shi XC Zai LQ Bi H Yang Q Lncrna CASC19 promotes the proliferation, migration and invasion of non-small cell lung carcinoma via regulating miRNA-130b-3p Eur Rev Med Pharmacol Sci 2019 23 247 55 31389608 10.26355/eurrev_201908_18654 Qu CX, Shi XC, Zai LQ, Bi H, Yang Q. Lncrna CASC19 promotes the proliferation, migration and invasion of non-small cell lung carcinoma via regulating miRNA-130b-3p. Eur Rev Med Pharmacol Sci. 2019;23:247–55. 31389608 10.26355/eurrev_201908_18654 Schmitz SU Grote P Herrmann BG Mechanisms of long noncoding RNA function in development and disease Cell Mol Life Sci 2016 73 2491 509 10.1007/s00018-016-2174-5 27007508 PMC4894931 Schmitz SU, Grote P, Herrmann BG. Mechanisms of long noncoding RNA function in development and disease. Cell Mol Life Sci. 2016;73:2491–509. 27007508 10.1007/s00018-016-2174-5 PMC4894931 Shang S Hua F Hu ZW The regulation of beta-catenin activity and function in cancer: therapeutic opportunities Oncotarget 2017 8 33972 89 10.18632/oncotarget.15687 28430641 PMC5464927 Shang S, Hua F, Hu ZW. The regulation of beta-catenin activity and function in cancer: therapeutic opportunities. Oncotarget. 2017;8:33972–89. 28430641 10.18632/oncotarget.15687 PMC5464927 Siegel RL Miller KD Fuchs HE Jemal A Cancer Stat 2021 CA Cancer J Clin 2021 71 7 33 10.3322/caac.21654 33433946 Siegel RL, Miller KD, Fuchs HE, Jemal A. Cancer Stat 2021 CA Cancer J Clin. 2021;71:7–33. 10.3322/caac.21654 33433946 Song P Gao Z Bao Y Chen L Huang Y Liu Y Dong Q Wei X Wnt/beta-catenin signaling pathway in carcinogenesis and cancer therapy J Hematol Oncol 2024 17 46 10.1186/s13045-024-01563-4 38886806 PMC11184729 Song P, Gao Z, Bao Y, Chen L, Huang Y, Liu Y, Dong Q, Wei X. Wnt/beta-catenin signaling pathway in carcinogenesis and cancer therapy. J Hematol Oncol. 2024;17:46. 38886806 10.1186/s13045-024-01563-4 PMC11184729 Song Z Lin J Li Z Huang C The nuclear functions of long noncoding RNAs come into focus Non-coding RNA Res 2021 6 70 9 10.1016/j.ncrna.2021.03.002 PMC8053782 33898883 Song Z, Lin J, Li Z, Huang C. The nuclear functions of long noncoding RNAs come into focus. Non-coding RNA Res. 2021;6:70–9. 10.1016/j.ncrna.2021.03.002 PMC8053782 33898883 Syed V TGF-beta signaling in cancer J Cell Biochem 2016 117 1279 87 10.1002/jcb.25496 26774024 Syed V. TGF-beta signaling in cancer. J Cell Biochem. 2016;117:1279–87. 26774024 10.1002/jcb.25496 Takeiwa T Ikeda K Suzuki T Sato W Iino K Mitobe Y Kawabata H Horie K Inoue S PSPC1 is a potential prognostic marker for hormone-dependent breast cancer patients and modulates RNA processing of ESR1 and SCFD2 Sci Rep 2022 12 9495 10.1038/s41598-022-13601-7 35681031 PMC9184599 Takeiwa T, Ikeda K, Suzuki T, Sato W, Iino K, Mitobe Y, et al. PSPC1 is a potential prognostic marker for hormone-dependent breast cancer patients and modulates RNA processing of ESR1 and SCFD2. Sci Rep. 2022;12:9495. 35681031 10.1038/s41598-022-13601-7 PMC9184599 Tang Z Kang B Li C Chen T Zhang Z GEPIA2: an enhanced web server for large-scale expression profiling and interactive analysis Nucleic Acids Res 2019 47 W556 60 10.1093/nar/gkz430 31114875 PMC6602440 Tang Z, Kang B, Li C, Chen T, Zhang Z. GEPIA2: an enhanced web server for large-scale expression profiling and interactive analysis. Nucleic Acids Res. 2019;47:W556-60. 31114875 10.1093/nar/gkz430 PMC6602440 Tay Y Rinn J Pandolfi PP The multilayered complexity of CeRNA crosstalk and competition Nature 2014 505 344 52 10.1038/nature12986 24429633 PMC4113481 Tay Y, Rinn J, Pandolfi PP. The multilayered complexity of CeRNA crosstalk and competition. Nature. 2014;505:344–52. 24429633 10.1038/nature12986 PMC4113481 The RC Petrov AI Kay SJE Kalvari I Howe KL Gray KA Bruford EA Kersey PJ Cochrane G Finn RD Bateman A Kozomara A Griffiths-Jones S Frankish A Zwieb CW Lau BY Williams KP Chan PP Lowe TM Cannone JJ Gutell R Machnicka MA Bujnicki JM Yoshihama M Kenmochi N Chai B Cole JR Szymanski M Karlowski WM Wood V Huala E Berardini TZ Zhao Y Chen R Zhu W Paraskevopoulou MD Vlachos IS Hatzigeorgiou AG Ma L Zhang Z Puetz J Stadler PF McDonald D Basu S Fey P Engel SR Cherry JM Volders PJ Mestdagh P Wower J Clark MB Quek XC Dinger ME RNAcentral: a comprehensive database of non-coding RNA sequences Nucleic Acids Res 2017 45 D128 D134 10.1093/nar/gkw1008 27794554 PMC5210518 The RC, Petrov AI, Kay SJE, Kalvari I, Howe KL, Gray KA, et al. RNAcentral: a comprehensive database of non-coding RNA sequences. Nucleic Acids Res. 2017;45:D128–34. 27794554 10.1093/nar/gkw1008 PMC5210518 Wallace AC Laskowski RA Thornton JM LIGPLOT: a program to generate schematic diagrams of protein-ligand interactions Protein Eng 1995 8 127 34 10.1093/protein/8.2.127 7630882 Wallace AC, Laskowski RA, Thornton JM. LIGPLOT: a program to generate schematic diagrams of protein-ligand interactions. Protein Eng. 1995;8:127–34. 7630882 10.1093/protein/8.2.127 Wang H Ding Y Zhu Q Yu Z Wang Q Gong A Xu M LncRNA FAM83A-AS1 promotes epithelial-mesenchymal transition of pancreatic cancer cells via Hippo pathway Cell Cycle 2023 22 1514 27 10.1080/15384101.2023.2216507 37245082 PMC10281461 Wang H, Ding Y, Zhu Q, Yu Z, Wang Q, Gong A, et al. LncRNA FAM83A-AS1 promotes epithelial-mesenchymal transition of pancreatic cancer cells via Hippo pathway. Cell Cycle. 2023c;22:1514–27. 37245082 10.1080/15384101.2023.2216507 PMC10281461 Wang L Lin C Sun N Wang Q Ding X Sun Y Long non-coding RNA CASC19 facilitates non-small cell lung cancer cell proliferation and metastasis by targeting the miR-301b-3p/LDLR axis J Gene Med 2020 22 e3254 10.1002/jgm.3254 32677267 Wang L, Lin C, Sun N, Wang Q, Ding X, Sun Y. Long non-coding RNA CASC19 facilitates non-small cell lung cancer cell proliferation and metastasis by targeting the miR-301b-3p/LDLR axis. J Gene Med. 2020;22:e3254. 32677267 10.1002/jgm.3254 Wang S Qiao C Li J Liu S Li P Lncrna CASC19 promotes gastric cancer progression through preventing CREB1 protein ubiquitin/proteasome-dependent degradation Carcinogenesis 2023 44 209 20 10.1093/carcin/bgad001 36651836 Wang S, Qiao C, Li J, Liu S, Li P. Lncrna CASC19 promotes gastric cancer progression through preventing CREB1 protein ubiquitin/proteasome-dependent degradation. Carcinogenesis. 2023a;44:209–20. 36651836 10.1093/carcin/bgad001 Wang W Feng C Han R Wang Z Ye L Du Z Wei H Zhang F Peng Z Yang J TrRosettaRNA: automated prediction of RNA 3D structure with transformer network Nat Commun 2023 14 7266 10.1038/s41467-023-42528-4 37945552 PMC10636060 Wang W, Feng C, Han R, Wang Z, Ye L, Du Z, et al. TrRosettaRNA: automated prediction of RNA 3D structure with transformer network. Nat Commun. 2023b;14:7266. 37945552 10.1038/s41467-023-42528-4 PMC10636060 Wang WJ Guo CA Li R Xu ZP Yu JP Ye Y Zhao J Wang J Wang WA Zhang A Li HT Wang C Liu HB Long non-coding RNA CASC19 is associated with the progression and prognosis of advanced gastric cancer Aging 2019 11 5829 47 10.18632/aging.102190 31422382 PMC6710062 Wang WJ, Guo CA, Li R, Xu ZP, Yu JP, Ye Y, et al. Long non-coding RNA CASC19 is associated with the progression and prognosis of advanced gastric cancer. Aging. 2019a;11:5829–47. 31422382 10.18632/aging.102190 PMC6710062 Wang XD Lu J Lin YS Gao C Qi F Functional role of long non-coding RNA CASC19/miR-140-5p/CEMIP axis in colorectal cancer progression in vitro World J Gastroenterol 2019 25 1697 714 10.3748/wjg.v25.i14.1697 31011255 PMC6465939 Wang XD, Lu J, Lin YS, Gao C, Qi F. Functional role of long non-coding RNA CASC19/miR-140-5p/CEMIP axis in colorectal cancer progression in vitro. World J Gastroenterol. 2019b;25:1697–714. 31011255 10.3748/wjg.v25.i14.1697 PMC6465939 Wilson C Kanhere A 8q24.21 locus: a paradigm to link non-coding rnas, genome polymorphisms and cancer Int J Mol Sci 2021 10.3390/ijms22031094 33499210 PMC7865353 Wilson C, Kanhere A. 8q24.21 locus: a paradigm to link non-coding rnas, genome polymorphisms and cancer. Int J Mol Sci. 2021. 10.3390/ijms22031094. 33499210 10.3390/ijms22031094 PMC7865353 Yan Y Zhang D Zhou P Li B Huang SY HDOCK: a web server for protein-protein and protein-DNA/RNA docking based on a hybrid strategy Nucleic Acids Res 2017 45 W365 73 10.1093/nar/gkx407 28521030 PMC5793843 Yan Y, Zhang D, Zhou P, Li B, Huang SY. HDOCK: a web server for protein-protein and protein-DNA/RNA docking based on a hybrid strategy. Nucleic Acids Res. 2017;45:W365-73. 28521030 10.1093/nar/gkx407 PMC5793843 Yang J Ren B Yang G Wang H Chen G You L Zhang T Zhao Y The enhancement of glycolysis regulates pancreatic cancer metastasis Cell Mol Life Sci 2020 77 305 21 10.1007/s00018-019-03278-z 31432232 PMC11104916 Yang J, Ren B, Yang G, Wang H, Chen G, You L, et al. The enhancement of glycolysis regulates pancreatic cancer metastasis. Cell Mol Life Sci. 2020;77:305–21. 31432232 10.1007/s00018-019-03278-z PMC11104916 Yao ZT Yang YM Sun MM He Y Liao L Chen KS Li B New insights into the interplay between long non-coding RNAs and RNA-binding proteins in cancer Cancer Commun (Lond) 2022 42 117 40 10.1002/cac2.12254 35019235 PMC8822594 Yao ZT, Yang YM, Sun MM, He Y, Liao L, Chen KS, Li B. New insights into the interplay between long non-coding RNAs and RNA-binding proteins in cancer. Cancer Commun (Lond). 2022;42:117–40. 35019235 10.1002/cac2.12254 PMC8822594 Yoshimura H Matsuda Y Yamamoto M Michishita M Takahashi K Sasaki N Ishikawa N Aida J Takubo K Arai T Ishiwata T Reduced expression of the H19 long non-coding RNA inhibits pancreatic cancer metastasis Lab Invest 2018 98 814 24 10.1038/s41374-018-0048-1 29581580 Yoshimura H, Matsuda Y, Yamamoto M, Michishita M, Takahashi K, Sasaki N, et al. Reduced expression of the H19 long non-coding RNA inhibits pancreatic cancer metastasis. Lab Invest. 2018;98:814–24. 29581580 10.1038/s41374-018-0048-1 Yu G Wang LG Han Y He QY Clusterprofiler: an R package for comparing biological themes among gene clusters OMICS 2012 16 284 7 10.1089/omi.2011.0118 22455463 PMC3339379 Yu G, Wang LG, Han Y, He QY. Clusterprofiler: an R package for comparing biological themes among gene clusters. OMICS. 2012;16:284–7. 22455463 10.1089/omi.2011.0118 PMC3339379 Yu H Wang J Sheng Q Liu Q Shyr Y BeRBP: binding Estimation for human RNA-binding proteins Nucleic Acids Res 2019 47 e26 10.1093/nar/gky1294 30590704 PMC6411931 Yu H, Wang J, Sheng Q, Liu Q, Shyr Y. BeRBP: binding Estimation for human RNA-binding proteins. Nucleic Acids Res. 2019;47:e26. 30590704 10.1093/nar/gky1294 PMC6411931 Yuan J Zhu Z Zhang P Ashrafizadeh M Abd El-Aty AM Hacimuftuoglu A Linnebacher CS Linnebacher M Sethi G Gong P Zhang X SKP2 TRIM21 PSPC1 Cancer Lett 2024 587 216733 10.1016/j.canlet.2024.216733 38360141 Yuan J, Zhu Z, Zhang P, Ashrafizadeh M, Abd El-Aty AM, Hacimuftuoglu A, et al. SKP2 TRIM21 PSPC1 38360141 10.1016/j.canlet.2024.216733 Zhan T Cheng X Zhu Q Han Z Zhu K Tan J Liu M Chen W Chen X Chen X Tian X Huang X LncRNA LOC105369504 inhibits tumor proliferation and metastasis in colorectal cancer by regulating PSPC1 Cell Death Discov 2023 9 89 10.1038/s41420-023-01384-3 36894530 PMC9998613 Zhan T, Cheng X, Zhu Q, Han Z, Zhu K, Tan J, et al. LncRNA LOC105369504 inhibits tumor proliferation and metastasis in colorectal cancer by regulating PSPC1. Cell Death Discov. 2023;9:89. 36894530 10.1038/s41420-023-01384-3 PMC9998613 Zhang K Shi ZM Chang YN Hu ZM Qi HX Hong W The ways of action of long non-coding RNAs in cytoplasm and nucleus Gene 2014 547 1 9 10.1016/j.gene.2014.06.043 24967943 Zhang K, Shi ZM, Chang YN, Hu ZM, Qi HX, Hong W. The ways of action of long non-coding RNAs in cytoplasm and nucleus. Gene. 2014;547:1–9. 24967943 10.1016/j.gene.2014.06.043 Zhang LX Luo PQ Wei ZJ Xu AM Guo T Expression and significant roles of the long non-coding RNA CASC19/miR-491-5p/HMGA2 axis in the development of gastric cancer World J Gastrointest Oncol 2024 16 3559 84 10.4251/wjgo.v16.i8.3559 39171190 PMC11334029 Zhang LX, Luo PQ, Wei ZJ, Xu AM, Guo T. Expression and significant roles of the long non-coding RNA CASC19/miR-491-5p/HMGA2 axis in the development of gastric cancer. World J Gastrointest Oncol. 2024;16:3559–84. 39171190 10.4251/wjgo.v16.i8.3559 PMC11334029 Zhang M, Wang Z, Obazee O, Jia J, Childs EJ, Hoskins J, Figlioli G, Mocci E, Collins I, Chung CC, Hautman C. Three new pancreatic cancer susceptibility signals identified on chromosomes 1q32. 1, 5p15. 33 and 8q24. 21. Oncotarget. 2016;7(41):66328. 10.18632/oncotarget.11041 PMC5340084 27579533 Zhao J Li C Chen S Xu Y Liu F Overexpression of CASC19 indicates poor prognosis and facilitates proliferation, migration and invasion in colorectal cancer Transl Cancer Res 2019 8 1249 57 10.21037/tcr.2019.07.17 35116867 PMC8798793 Zhao J, Li C, Chen S, Xu Y, Liu F. Overexpression of CASC19 indicates poor prognosis and facilitates proliferation, migration and invasion in colorectal cancer. Transl Cancer Res. 2019;8:1249–57. 35116867 10.21037/tcr.2019.07.17 PMC8798793 Zhao S Allis CD Wang GG The language of chromatin modification in human cancers Nat Rev Cancer 2021 21 413 30 10.1038/s41568-021-00357-x 34002060 PMC10507815 Zhao S, Allis CD, Wang GG. The language of chromatin modification in human cancers. Nat Rev Cancer. 2021;21:413–30. 34002060 10.1038/s41568-021-00357-x PMC10507815 Zhou J Xu N Liu B Wang C He Z Lenahan C Tang W Zeng H Guo H LncRNA XLOC013218 promotes cell proliferation and TMZ resistance by targeting the PIK3R2-mediated PI3K/AKT pathway in glioma Cancer Sci 2022 113 2681 92 10.1111/cas.15387 35637600 PMC9357648 Zhou J, Xu N, Liu B, Wang C, He Z, Lenahan C, et al. LncRNA XLOC013218 promotes cell proliferation and TMZ resistance by targeting the PIK3R2-mediated PI3K/AKT pathway in glioma. Cancer Sci. 2022;113:2681–92. 35637600 10.1111/cas.15387 PMC9357648 ",
  "metadata": {
    "Title of this paper": "LncRNA XLOC013218 promotes cell proliferation and TMZ resistance by targeting the PIK3R2-mediated PI3K/AKT pathway in glioma",
    "Journal it was published in:": "Molecular Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482102/"
  }
}