{
  "title": "Paper_528",
  "abstract": "pmc Eur Cardiol Eur Cardiol 3427 eurcardrev ECR European Cardiology Review 1758-3756 1758-3764 Radcliffe Cardiology PMC12481373 PMC12481373.1 12481373 12481373 41036021 10.15420/ecr.2025.26 1 Cardio-Oncology Advances in Cardioprotection Strategies: Focusing on Breast Cancer and Beyond Through Novel Biomarkers and Pharmacological Approaches Tamburrini Giulia 1 de Cobos García Celia 2 López-Fernández Teresa 3 4 1. Cardiology Department, Policlinico Gemelli Rome, Italy 2. Oncology Department, La Paz University Hospital Madrid, Spain 3. Cardiology Department, La Paz University Hospital Madrid, Spain 4. Hospital La Paz Institute for Health Research Madrid, Spain Disclosure Correspondence giuliatamburrini@gmail.com 09 9 2025 2025 20 483048 e23 30 4 2025 04 7 2025 09 09 2025 01 10 2025 02 10 2025 Copyright © The Author(s), 2025. Published by Radcliffe Group Ltd. 2025 https://creativecommons.org/licenses/by-nc/4.0/ © The Author(s) 2025. This work is open access and is licensed under CC BY-NC 4.0. Users may copy, redistribute and make derivative works for non-commercial purposes, provided the original work is cited correctly. Recent improvements in cancer treatments have significantly improved patient survival rates, which has drawn attention to cardiovascular complications that may arise after using oncological therapies. These complications can seriously affect quality of life and long-term outcomes, sometimes leading to the need for modification or discontinuation of cancer treatment. This highlights the urgent need for effective cardioprotective strategies to prevent and mitigate clinical and subclinical cardiotoxicity, as well as reducing acute and chronic cardiac damage. In this review, we critically evaluate the cardiac biomarkers used in clinical practice for early detection and monitoring of cardiotoxicity, focusing on N-terminal pro-B-type natriuretic peptide and troponins due to their established predictive value. We also explore emerging biomarkers that may improve cardiovascular risk assessment in cancer patients. On the pharmacological front, β-blockers, angiotensin-converting enzyme inhibitors and sodium–glucose cotransporter 2 inhibitors show potential for mitigating cardiotoxicity, although evidence from randomised trials remains mixed. Non-pharmacological approaches are also discussed, and the aim is to integrate comprehensive cardiovascular prevention into oncology care. Keywords Breast cancer cardioprotection cardio-oncology chemotherapy-induced cardiotoxicity cardiac biomarkers heart failure pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Advances in cancer therapies have significantly increased long-term survival, highlighting the need to manage cardiovascular complications. Cardio-oncology focuses on preventing and treating heart disease related to cancer and its treatments. 1 2 The 2022 European Society of Cardiology (ESC) guidelines emphasise the importance of evaluating cardiotoxicity risk both before and during cancer therapy to inform treatment decisions and enable effective monitoring. As oncological therapies evolve, the demand for cardioprotective strategies increases, highlighting the need for continuous risk reassessment with each change in treatment regimen. 3 4 Cardiac imaging and biomarkers play a key role in identifying patients at high risk of cardiovascular complications before and during cancer therapy. Echocardiography remains the first-line imaging modality for screening, diagnosis and surveillance in oncology patients. Its 2D and Doppler techniques allow for the detection of structural and functional cardiac alterations, while 2D and 3D myocardial deformation imaging (also known as strain imaging) enhances sensitivity for identifying subclinical cancer therapy-related cardiac dysfunction (CTRCD). Among advanced imaging techniques, cardiac magnetic resonance (CMR) using cine steady-state free precession sequences provides detailed assessment of cardiac structure and function, including left and right ventricular ejection fraction. CMR is also capable of detecting subclinical CTRCD and alternative causes of abnormal global longitudinal strain (GLS) through strain imaging protocols. Coronary CT angiography (CCTA) and stress echocardiography or single photon emission computed tomography/positron emission tomography are valuable tools for identifying or ruling out exercise- or drug-induced ischaemia, which contributes to cardiovascular risk stratification before initiating chemotherapy. However, the current evidence in many areas is still limited to small studies and several centres are unable to follow guideline recommendations due to restricted access to advanced imaging techniques. 5 9 In this context, the appropriate use of biomarkers may serve as a particularly valuable tool for centres with limited access to imaging resources. This article focuses on biomarkers that are in use in clinical practice and offers guidance on their interpretation to support risk stratification and preventive strategies, especially regarding therapeutic approaches in cardio-oncology. Methods This narrative review included studies investigating the efficacy of biomarkers and pharmacological strategies for cardioprotection during cancer treatment. Focus was placed on studies evaluating early detection of cardiotoxicity and the monitoring of cardiac function in patients receiving potentially cardiotoxic therapies. We searched PubMed, Google Scholar and the Cochrane Library using the keywords cardioprotection, cardio-oncology, chemotherapy-induced cardiotoxicity, cardiac biomarkers and heart failure in cancer patients. Studies were primarily included if they were published within the last 5 years (a minority of studies may date back to earlier years), with preference given to original research and reviews addressing mechanisms of cardiotoxicity, risk stratification, early detection and preventive strategies. Studies not relevant to cardioprotective interventions or the use of biomarkers were excluded. Biomarkers in Cardio-oncology In the past two decades, the use of cardiac biomarkers has emerged as a key strategy for the early detection of subclinical cardiac injury. 10 11 There is growing interest in the use of these biomarkers to detect cardiac injury at a preclinical stage, to confirm damage or ventricular dysfunction when imaging is inconclusive, and to guide treatment decisions and cardioprotective strategies. 12 It is essential to emphasise that biomarkers should not be used in isolation, but rather as part of a comprehensive assessment that includes cardiac imaging, risk factors, clinical symptoms and the oncological context. Biomarkers in Use: Troponins and Natriuretic Peptides Traditional biomarkers such as N-terminal pro-B-type natriuretic peptide (NT-proBNP) and cardiac troponins (cTn) are fundamental in assessing myocardial function and injury and are already included in guidelines for risk stratification and monitoring of patients receiving cardiotoxic cancer therapies. 4 Cardiac troponins, including I (cTnl) and T (cTnT) isoforms, are considered the gold-standard biomarkers for detecting myocardial damage and cardiomyocyte necrosis. 13 14 15 Natriuretic peptides, including B-type natriuretic peptide (BNP) and NT-proBNP, are key biomarkers for monitoring myocardial stress and CTRCD. They are released by cardiomyocytes in response to wall stress and neurohormonal activation, including stimulation by norepinephrine and angiotensin II. NT-proBNP is effective for monitoring haemodynamic stress and is useful for identifying CTRCD and managing long-term heart failure. 16 21 Measuring cardiac biomarkers – troponins, BNP and NT-proBNP – before initiating cancer treatment is essential to establish a baseline and detect any pre-existing cardiac damage, particularly in patients with underlying cardiovascular disease. These baseline values are critical for interpreting changes during treatment and for effective surveillance of cardiotoxicity. Additionally, the timing and frequency of biomarker testing should be adapted to the specific cancer therapy being administered. 11 Importantly, an elevation in cardiac biomarkers must be interpreted within the broader clinical context and does not automatically warrant the discontinuation of oncological therapy. Instead, such findings should prompt collaboration between cardiologists and oncologists to assess the risks and benefits of continuing treatment and to determine whether more intensive monitoring or cardioprotective strategies are needed. 11 In the context of anthracycline therapy, troponins and natriuretic peptides (NPs) are valuable biomarkers for detecting both clinical and subclinical cardiotoxicity, demonstrating a strong negative predictive value. Troponins are particularly effective for early identification of myocardial injury, while NPs better reflect late-onset cardiotoxicity and heart failure. Elevated troponin levels during chemotherapy have been consistently associated with increased risk of CTRCD. 11 13 15 22 28 13 15 Elevated NT-proBNP before cancer treatment has also been linked to higher mortality risk (HR 1.54), with increases at 1-year follow-up after anthracycline or trastuzumab therapy correlating with a significant decline in LVEF. 21 29 30 Regarding trastuzumab therapy, cTnI predicted CTRCD in patients treated with both doxorubicin and trastuzumab. 24 16 31 16 31 32 In patients treated with trastuzumab, troponin assays have shown a 99% negative predictive value across multiple studies. For instance, Cardinale et al. found that 62% (total patients enrolled = 251) of troponin-positive patients developed cardiotoxicity compared to 5% of those with normal troponin, and troponin-positive patients had poorer responses to heart failure therapy and lower rates of LVEF recovery. 14 Troponin also plays a critical role in identifying myocarditis related to immune checkpoint inhibitors (ICIs). Most patients with ICI-induced myocarditis (94%) show elevated troponin levels, making it the main diagnostic biomarker in this setting. 33 34 In ICI-treated patients, NPs are mainly useful for detecting new-onset left ventricular dysfunction, which may result from ICI-induced myocarditis. However, NPs are elevated in only about two-thirds of myocarditis cases. More importantly, they are essential for diagnosing non-inflammatory left ventricular dysfunction, a recently recognised condition that presents with elevated NPs and normal troponin levels. This diagnosis requires clinical and imaging evidence of new left ventricular dysfunction in the absence of myocardial inflammation confirmed by cardiac imaging and/or biopsy. 34 Last, in patients receiving proteasome inhibitors such as carfilzomib, elevated baseline NP levels have been associated with a higher risk of cardiovascular complications. Monitoring NP levels in these patients may help identify those at greater risk and support improved surveillance and preventive strategies. 35 Emerging Circulating and Molecular Biomarkers In this context, microRNAs (miRs) – non-coding RNA sequences involved in the regulation of gene expression – have shown promise as novel biomarkers. Studies have demonstrated that miRNAs are associated with the early detection of chemotherapy-induced cardiac injury and correlate with different stages of the pathological process, including oxidative stress and cardiac fibrosis. Notably, they are considered potential risk markers for myocardial dysfunction in patients undergoing cancer treatment. However, it is important to emphasise their experimental status and acknowledge the need for further validation in larger studies and among several cohorts before they can be integrated into clinical practice. For example, miR-34a has been found to correlate with troponin levels (cTnT and cTnI) and may reflect early myocardial injury, although it does not correlate with LVEF. Other miRs, such as miR-1, miR-29 and miR-126, increase after anthracycline treatment, with some remaining elevated for months after therapy. MiR-130a, which correlates with TnI levels, suggests CTRCD independently of LVEF or NT-proBNP and represents a predictor of this condition. MiRs are implicated in various mechanisms, including oxidative stress, apoptosis, autophagy and fibrosis, all of which contribute to cardiac dysfunction. Altered expression of miR-130a in murine models has been shown to affect cardiac development, indicating its role in cardiomyopathies. Additionally, miR-130a has improved the predictive performance of risk models for CTRCD, helping to better identify patients at risk. 36 37 Newer biomarkers provide insight into myocardial stress and injury and act as potential predictors of cardiac dysfunction in patients undergoing cancer therapy. Soluble ST2 (sST2), a member of the interleukin-1 receptor family, reflects inflammation and mechanical stress and has been recognised for its prognostic value in conditions such as heart failure and coronary artery disease. However, despite it being suspected of being an early indicator of these conditions, recent studies have failed to show that baseline ST2 levels can predict cardiotoxic events. 38 39 Other novel biomarkers from the fields of genetics, proteomics and immunology have also been explored to predict cardiotoxicity based on their biological mechanisms. Research has identified genetic variants associated with increased susceptibility to cardiotoxicity, including those linked to dilated cardiomyopathy and polymorphisms related to cancer therapy-induced cardiac risk, such as HER2 polymorphisms. It has been suggested that an integrated risk prediction model combining clinical and genetic factors may be more effective in predicting anthracycline-induced CTRCD than models based on either component alone. 40 Cardioprotective Drugs in Cardio-oncology CTRCD is a relatively common and potentially serious side effect of conventional and targeted cancer therapies. Agents such as anthracyclines and trastuzumab, as well as various targeted therapies, can lead to cardiotoxic effects such as cardiac dysfunction, arterial hypertension, myocarditis or other manifestations, potentially requiring treatment modification or discontinuation. Randomised controlled trials have evaluated multiple strategies to prevent or mitigate these effects, including cardioprotective pharmacological interventions and surveillance techniques using imaging and biomarkers to identify high-risk patients. 41 43 This section reviews the current evidence on the effectiveness of cardioprotective strategies in reducing the cardiotoxic effects of conventional and targeted cancer therapies in adults. Neurohormonal Blockade The use of β-blockers, angiotensin-converting enzyme inhibitors (ACEi), angiotensin receptor blockers (ARB) and mineralocorticoid receptor antagonists is well-established for managing CTRCD. Although promising, current evidence does not yet support the routine use of ACEi or β-blockers in the field of cardio-protection; moreover, there are gaps in the evidence regarding their use to prevent CTRCD, and there are several ongoing randomised controlled trials (RCTs) that are assessing their efficacy in this setting. Neurohormonal activation, which occurs in response to myocardial injury, is associated with CTRCD. This provides a rationale for using neurohormonal antagonists to prevent or manage cancer therapy-induced heart failure. 41 In 2006, a landmark study by Cardinale et al. demonstrated the efficacy of the ACEi enalapril in preventing acute myocardial injury after high-dose chemotherapy. Enalapril was initiated 1 month after chemotherapy was completed in patients with acute myocardial damage indicated by elevated troponin levels. Results showed that the incidence of a >10% decrease in LVEF to below the normal threshold of <50% was significantly higher in untreated patients than in those treated with enalapril (43% versus 0%; p<0.001), highlighting the effectiveness of this intervention in preventing CTRCD. 44 However, subsequent trials testing ACEi, ARBs and β-blockers have yielded mixed results, with limited or no benefits on primary outcomes. Among ongoing studies, the PRADA trial is one of the most relevant ( Table 1 45 46 The CECCY trial investigated the role of carvedilol in preventing anthracycline-induced cardiotoxicity in patients with HER2-negative breast cancer. No significant differences in cardiotoxicity (defined as a ≥10% reduction in LVEF after 6 months) were observed between carvedilol and placebo groups. However, carvedilol was associated with a reduction in cTnI elevation during treatment, suggesting a protective effect against acute myocardial injury. At 2-year follow-up, no significant differences were seen in cardiotoxicity rates or cardiac function. 47 Table 1: Recent Randomised Controlled Trials on Cardioprotection in Patients Receiving Anthracycline Therapy Trial Intervention Design n Primary Endpoint and Follow-Up Key Secondary Endpoints and Limitations of the Study PRADA 2016, 2021 45 46 Metoprolol Candesartan Combination Placebo Randomised, placebo-controlled, double-blind, 2×2 factorial 130 Initially candesartan reduced LVEF decline, but no significant difference in LVEF was observed at extended follow-up Metoprolol temporarily reduced troponin increase, but the effect wasn’t sustained, reflecting the study’s limited power and short follow-up CECCY 2018 47 Carvedilol versus placebo Randomised, placebo-controlled, double-blind 200 No significant effect of carvedilol on preventing ≥10% LVEF reduction; long-term follow-up also showed no LVEF difference Carvedilol reduced cTnI rise early in the trial but results were limited by low cardiotoxicity rates, low dosing, short follow-up and lack of achievement of primary endpoint ICOS-ONE 2018, 2020 49 50 Enalapril prophylaxis versus troponin-guided initiation of therapy Randomised, open-label, multicentre 273 No significant difference in the incidence of CTRCD (≥10% LVEF drop to <50%) between groups. No new CTRCD cases were reported at 3-year follow-up No difference in troponin elevation was seen between groups; the study was limited by its small size, its exclusion of high-risk patients and incomplete follow-up SAFE 2021 48 Bisoprolol Enalapril Combination Placebo Randomised, placebo-controlled, double-blind 174 All active treatment arms (bisoprolol, enalapril and combination) showed less LVEF decline during treatment Bisoprolol and enalapril prevented worsening of peak GLS, however, the study was limited by its small sample size, short follow-up and restricted generalisability to non-metastatic patients SUCCOUR 2023 51 Imaging-guided surveillance: serial LVEF versus peak GLS measurements Randomised, open-label, multicentre 331 No significant difference in LVEF change at 1-year follow-up between the two monitoring strategies Neurohormonal therapy was used more in the GLS-guided group, indicating greater sensitivity to early cardiac dysfunction; however, the study had a limited duration, operator-dependent strain variability, few clinical events and selection bias due to restrictive criteria, limiting its generalisability  CTRCD = cancer therapy-related cardiac dysfunction; GLS = global longitudinal strain; LVEF = left ventricular ejection fraction. Preliminary results from the four-arm SAFE trial assessed the effects of bisoprolol, ramipril and their combination on anthracycline-induced subclinical cardiac injury ( Table 1 48 The ICOS-ONE study examined two cardioprotective approaches with enalapril in anthracycline-treated patients: administration before chemotherapy or only after troponin elevation ( Table 1 49 50 The SUCCOUR study compared two echocardiographic surveillance strategies – serial LVEF versus GLS measurements – in patients undergoing anthracycline therapy ( Table 1 51 Unlike anthracyclines, trastuzumab-induced cardiotoxicity is not associated with cardiomyocyte necrosis and tends to be at least partially reversible after treatment is discontinued. 41 The MANTICORE 101-Breast trial enrolled 99 patients with early-stage HER2-positive breast cancer, randomised to bisoprolol, perindopril or placebo during trastuzumab therapy ( Table 2 52 A Dutch study by Boekhout et al. ( Table 2 53 The SAFE-HEaRt and Scholar trials investigated cardioprotective strategies in HER2-positive breast cancer patients with mild left ventricular dysfunction undergoing trastuzumab therapy ( Table 3 54 55 The efficacy of sacubitril/valsartan as a preventive strategy for anthracycline-related cardiotoxicity is currently under investigation. The PRADA II trial is a multicentre, placebo-controlled RCT evaluating its cardioprotective effect in patients with early-stage breast cancer ( Table 4 Table 4 42 56 Table 2: Recent Randomised Controlled Trials Evaluating Cardioprotective Strategies During Trastuzumab Treatment Trial Intervention Design n Primary Endpoint Result Key Secondary Endpoint Results and Limitations of the Study Boekhout et al. 2016 53 Candesartan versus placebo Randomised, multicentre, placebo-controlled, double-blind; all participants had prior anthracycline exposure 210 No difference in the incidence of cardiotoxicity No significant differences in changes in LVEF, cTnT, or NT-proBNP were observed between treatment and placebo groups; the study had a limited sample size, short follow-up and showed no significant clinical benefits MANTICORE 101-Breast 2017 52 Bisoprolol Perindopril Placebo Randomised, placebo-controlled, double-blind; few participants previously received anthracyclines 99 No significant difference in change in LVEDV Both bisoprolol and perindopril attenuated LVEF decline; however, the study was single-centre, small, short-term, and based mainly on imaging, limiting its clinical applicability  cTn = cardiac troponin; LVEDV = left ventricular end-diastolic indexed volume; LVEF = left ventricular ejection fraction; NT-proBNP = N-terminal pro–B-type natriuretic peptide Table 3: Safety Trials Evaluating Trastuzumab in Patients with Reduced Left Ventricular Ejection Fraction Trial Intervention Trial Inclusion Criteria n Primary Endpoint Results Key Secondary Endpoint Results and Limitations of the Study SAFE-HEART 2019 54 Carvedilol and any angiotensin antagonists Patients with LVEF 40–49% prior to study participation 30 The majority of patients completed HER2-targeted therapy without major heart issues, including heart failure or arrhythmias Two patients developed symptomatic heart failure and one had a significant LVEF decline to 32% during therapy; the study was non-randomised, had a small sample size and lacked a control group, limiting the strength of its conclusions SCHOLAR 2019 55 ACE inhibitors and β-blockers Patients with LVEF 40–54% or those with an LVEF >54% with a decline of >15% from baseline 20 Cardiac dose-limiting toxicity (including cardiovascular death or heart failure with LVEF <40%) was assessed Two patients developed cardiac dose-limiting toxicity during the study; it was a phase I trial with a small sample size, no control group and limited follow-up.  LVEF = left ventricular ejection fraction Sodium-Glucose Cotransporter 2 Inhibitors (SGLT2i) SGLT2i are emerging as a promising option for cardiovascular protection, especially in oncology patients. A systematic review and meta-analysis involving nearly100,000 participants showed thatthese drugs significantly reduce hospitalisations for heart failure and all-cause mortality. 57 Available data suggest that SGLT2i may provide significant benefits to oncology patients with a lower number needed to treat compared to patients with diabetes alone. These data are derived from a meta-analysis of observational and retrospective studies rather than prospective ones and are therefore subject to potential confounding factors, such as sexspecific effects of SGLT2 inhibition, variations in its use based on socioeconomic status, concomitant heart failure therapies and cancer staging, which may influence a patient’s prognosis. 57 Ongoing trials, such as PROTECT ( NCT06341842 NCT06443645 57 Mineralocorticoid Receptor Antagonists and Statins Aldosterone, stimulated by angiotensin II, is a key factor in the fibrotic response to myocardial injury, providing a rationale for the cardioprotective use of mineralocorticoid receptor antagonists. However, evidence regarding the effectiveness of these drugs is mixed. In a Turkish study, spironolactone reduced the decline in LVEF and the rise in cTnI, but had no significant impact on diastolic function. 58 Observational studies suggest that statins may reduce cardiovascular risk, while other drugs such as colchicine and aspirin may help mitigate myocardial inflammation and fibrosis, though clinical evidence remains lacking. 59 Onco-specific Treatments From an oncological perspective, certain targeted treatments may help reduce the cardiotoxicity associated with cancer therapy. Dexrazoxane is an intracellular iron chelator whose mechanism is not fully understood but is believed to inhibit iron-mediated oxidative damage and the topoisomerase II-ß isoenzyme is implicated in anthracycline-induced cardiotoxicity. It is recommended that patients with adult breast cancer are treated with 300 mg/m² of doxorubicin 30 minutes before each anthracycline cycle, as it has been shown to delay and reduce treatment-related cardiac dysfunction. It is also recommended in adults receiving high cumulative anthracycline doses (>250–300 mg/m² of doxorubicin equivalent), as it protects against symptomatic and asymptomatic cardiac dysfunction without compromising the efficacy of anthracycline. However, switching to alternative regimens or using liposomal formulations is preferred for patients with advanced cancer who are expected to receive high anthracycline doses. Therefore, dexrazoxane is not routinely used in clinical practice. Table 4: Ongoing Trials Investigating Sacubitril/Valsartan for Prevention of Anthracycline-induced Cardiotoxicity Trial Intervention Trial Inclusion Criteria n Primary Endpoint Results Key Secondary Endpoint Results and Limitations of the Study PRADA II 2021 42 Sacubitril/valsartan versus placebo Early-stage breast cancer patients receiving anthracycline-based therapy NA Ongoing evaluation of the cardioprotective effects of sacubitril/valsartan No results yet as the study is still ongoing MAINSTREAM 2023 56 Sacubitril/valsartan Early-stage breast cancer patients receiving anthracycline and/or anti-HER2 therapy, excluding those with baseline LV dysfunction or prior anthracycline or chest radiotherapy NA Assessment of safety and efficacy in preventing anthracycline-related cardiotoxicity Exclusion criteria include those with prior cardiac issues, ensuring a focus on healthy patients receiving initial treatments Liposomal anthracyclines have demonstrated non-inferior anti-tumour efficacy and a reduced risk of treatment-induced cardiac dysfunction. They represent an alternative option for oncology patients at high risk of cardiotoxicity, such as older people, those who have had previous exposure to anthracycline or patients with cardiovascular risk factors. Liposomal anthracyclines have not shown superiority over conventional anthracyclines, prompting ongoing research into liposomal membrane modification with targeting ligands, such as antibodies, peptides or cellpenetrating enhancers, to improve drug delivery and efficacy. Current findings remain limited to preclinical studies. 3 60 66 Integration of Biomarkers and Drugs in Personalised Therapy The multi-hit model of heart failure, where multiple risk factors interact to provoke it, suggests that patients with pre-existing or subclinical cardiovascular disease have reduced cardiac reserve and tolerate less damage before developing overt CTRCD. Modifiable cardiovascular risk factors, including smoking, obesity, physical inactivity, hypertension and diabetes, increase the risk of CTRCD. Preventive interventions such as lifestyle modification and pharmacological treatments can improve cardiovascular health and mitigate this risk. A cardiology evaluation is therefore essential for oncological patients with established or high cardiovascular risk before initiating potentially cardiotoxic cancer therapies. 41 Cancer-related factors such as hypercoagulability, tumour invasion into the heart or vessels and high-output states can also contribute to cardiovascular risk. Additionally, cancer therapies, such as radiotherapy (especially targeting the heart or mediastinum), anthracyclines or target therapies can increase the likelihood of cardiac damage. Effective CTRCD management includes addressing modifiable risk factors and adjusting oncological therapy dosage or delivery methods. The use of cardioprotective drugs such as β-blockers, ACEi or ARBs is a useful strategy, although long-term benefits remain unclear. A risk-based cardioprotective approach, rather than universal administration, is considered most appropriate. Angiotensin antagonists and/or β-blockers may be recommended for patients with high cardiovascular risk profiles, such as having elevated troponin levels or high cumulative anthracycline doses. 67 Current guidelines promote integrating biomarkers and cardiovascular imaging to detect early forms of CTRCD in patients treated with anthracyclines and trastuzumab ( Figure 1 If cardiac function deteriorates during cancer treatment, initiating cardioprotective therapy should be prioritised and maintained throughout the course of oncological treatment. While the optimal duration of such therapy has not been fully established, it may be necessary to temporarily suspend oncological treatment to concentrate on heart failure management when clinical signs of heart failure emerge. Although sacubitril/valsartan shows promise, further RCTs are needed to confirm its effectiveness in CTRCD prevention. 3 41 Gaps in Research Risk stratification is essential for predicting and preventing cardiotoxicity and validated guidelines now incorporate biomarkers and cardiovascular imaging for early detection. However, the predictive value of certain biomarkers, such as genetic and molecular markers, is still poorly understood and not currently included in formal risk scores. 68 Other biomarkers, such as miRs, have been studied as promising tools for detecting drug-induced cardiotoxicity, but their clinical role requires further validation. Additional studies are also needed to confirm the benefits of using established biomarkers and to determine optimal blood sampling strategies. Primary prevention of CTRCD is crucial before treatment. Reducing drug dosage, particularly for dose-dependent therapies such as radiotherapy and anthracyclines, is highly effective in lowering risk. However, the effectiveness of cardioprotective drugs remains uncertain as clinical trials have shown no significant benefits so far. Ongoing trials are expected to provide clearer evidence. The benefits of cardioprotection may be underestimated in current trials due to under-representation of high-risk patients who might benefit the most. Figure 1: Practical Recommendations for Cardioprotection in Oncology Patients  *Use Heart Failure Association-International Cardio-oncology Society (HFA-ICOS) risk score to stratify cardiotoxicity risk and guide tailored surveillance before starting cancer therapy. †Cardiac biomarkers and echocardiography should be assessed in patients at risk, considering the clinical context and anticancer treatment. ‡Angiotensin-converting enzyme inhibitors, β-blockers and statins should be considered for primary prevention in high- or very high-risk patients, or in the presence of cardiac injury. §Clinical, laboratory and imaging monitoring should be tailored to the individual patient based on their cardiovascular risk, type and cumulative dose of anti-cancer therapy and guided by a cardio-oncology evaluation when appropriate. ACEi = angiotensin-converting enzyme inhibitors; ARB = angiotensin receptor blockers; CMR = cardiac MRI; cTn = cardiac troponin; GLS = global longitudinal strain; HFA-ICOS = Heart Failure Association-International Cardio-oncology Society; LVEF 3D = 3D left ventricular ejection fraction; TTE = transthoracic echocardiography. For anthracyclines, research into genetic testing to predict CTRCD is ongoing, and there is a need for novel cardioprotective agents targeting specific pathophysiological mechanisms. At present, genetic testing is not recommended as routine practice before anthracycline treatment, though its use may be supported in the future based on pharmacogenomics and cardiovascular biology. However, research into genetic susceptibility to anthracycline-induced cardiotoxicity is still preliminary and limited by small cohorts, preventing the identification of all relevant polymorphisms. Additionally, the predictive value of baseline cardiovascular biomarkers is not yet fully established. Recent studies, such as PRADA, have shown that mild, asymptomatic troponin elevations during cancer therapy do not always correlate with overt cardiotoxicity, challenging the systematic use of troponin as a stand-alone indicator. 69 For trastuzumab, further research is required to assess the predictive value of blood biomarkers in low-risk populations, particularly those treated with novel HER2-targeted agents or antibody-drug conjugates. Current cardiac biomarkers lack sufficient validation for risk stratification before anti-HER2 therapy and existing guidelines are inconsistent. Widespread biomarker screening remains controversial, as many patients resent with elevated troponin levels before treatment initiation. The HERA study found baseline cTnI and cTnT abnormalities in a significant proportion of patients, with elevated levels associated with greater LVEF decline during therapy. Moreover, polymorphisms in the ERbB2 In the context of immunotherapy, further evidence is needed to understand the role of troponin measurement in predicting cardiotoxicity and to evaluate the efficacy of cardioprotective strategies, which remain poorly defined. 5 Sex-specific considerations in cardiotoxicity risk remain an underexplored area in cardio-oncology research. Ensuring adequate representation of women in clinical trials involving cytotoxic therapies is crucial to better understand sex-related differences in susceptibility to cardiotoxic effects. Such data could inform the development of sex-specific dosing strategies, thereby optimising treatment efficacy while minimising adverse cardiovascular events in women with cancer. Enhanced inclusion of women in these studies may ultimately lead to more personalised and safer cardio-oncological care. Conclusion Cardio-oncology is an evolving field where advanced biomarkers and cardioprotective drugs are gaining prominence in managing treatment-induced cardiotoxicity. While traditional biomarkers such as cTn and NPs are useful for monitoring cardiac function, novel biomarkers, including genetic markers, miRs and other biochemical entities, offer potential for increasingly personalised risk stratification. However, their predictive validity is not yet fully confirmed, and further studies are required to validate their clinical utility in large patient cohorts. On the pharmacological front, β-blockers, ACEi and ARBs show potential in mitigating cardiotoxicity during cancer therapy, but their long-term effectiveness requires confirmation from larger trials. Although risk-based strategies for identifying patients who would benefit most from their use appear promising, RCTs have not yet supported biomarker- or imaging-guided interventions. This may be due to the limited effectiveness of neurohormonal antagonists in the absence of significant neurohormonal activation. These drugs are not designed to directly counteract oncological cardiotoxic mechanisms but rather to attenuate downstream effects of myocardial injury. Integrating pharmacogenomics and cardiovascular biology may enhance the personalised care of cancer patients who have a high risk of cardiac dysfunction, but further validation of biomarkers and therapies is needed to better prevent and manage cardiotoxicity. Clinical Perspective Cardiac troponins and natriuretic peptides are key biomarkers for the early detection and monitoring of cancer therapy-related cardiac dysfunction, which describes the full spectrum of heart failure and cardiac dysfunction associated with cancer treatment. Their use enables timely intervention before irreversible damage occurs. Novel markers like microRNAs and soluble ST2, which are potential risk markers for myocardial dysfunction in patients undergoing cancer treatment, show promise for improving risk prediction; however, current evidence is insufficient for their routine use, and further validation from trials is required. β-blockers, angiotensin-converting enzyme inhibitors and sodium–glucose cotransporter 2 inhibitors may help mitigate cancer therapy-related cardiac dysfunction, although trial results are mixed, necessitating personalised treatment. Combining biomarkers with advanced imaging techniques – such as echocardiography with global longitudinal strain and cardiac MRI – enhances risk stratification and supports tailored cardioprotective strategies, promoting personalised cardio-oncological care. 1. Michel L Schadendorf D Rassaf T Oncocardiology: new challenges, new opportunities. Herz 2020 45 619 25 10.1007/s00059-020-04951-x 32514587 PMC7278757 2. Meijers WC Maglione M Bakker SJL Heart failure stimulates tumor growth by circulating factors. Circulation 2018 138 678 91 10.1161/circulationaha.117.030816 29459363 3. Lyon AR López-Fernández T Couch LS 2022 ESC Guidelines on cardio-oncology developed in collaboration with the European Hematology Association (EHA), the European Society for Therapeutic Radiology and Oncology (ESTRO) and the International Cardio-Oncology Society (IC-OS): Developed by the task force on cardio-oncology of the European Society of Cardiology (ESC). Eur Heart J 2022 43 4229 361 10.1093/eurheartj/ehac244 36017568 4. Di Lisi D Madaudo C Alagna G The new HFA/ICOS risk assessment tool to identify patients with chronic myeloid leukaemia at high risk of cardiotoxicity. ESC Heart Fail 2022 9 1914 9 10.1002/ehf2.13897 35355425 PMC9065844 5. Raisi-Estabragh Z Murphy AC Ramalingam S Cardiovascular considerations before cancer therapy: gaps in evidence and JACC: CardioOncology expert panel recommendations. JACC CardioOncol 2024 6 631 54 10.1016/j.jaccao.2024.07.017 39479317 PMC11520216 6. Baldassarre LA Ganatra S Lopez-Mattei J Advances in multimodality imaging in cardio-oncology: JACC state-of-the-art review. J Am Coll Cardiol 2022 80 1560 78 10.1016/j.jacc.2022.08.743 36229093 7. Mousavi N Tan TC Ali M Echocardiographic parameters of left ventricular size and function as predictors of symptomatic heart failure in patients with a left ventricular ejection fraction of 50–59% treated with anthracyclines. Eur Heart J Cardiovasc Imaging 2015 16 977 84 10.1093/ehjci/jev113 25925220 8. Kang Y Assuncao BL Denduluri S Symptomatic heart failure in acute leukemia patients treated with anthracyclines. JACC CardioOncol 2019 1 208 17 10.1016/j.jaccao.2019.10.008 32905430 PMC7472996 9. Lambert J Lamacie M Thampinathan B Variability in echocardiography and MRI for detection of cancer therapy cardiotoxicity. Heart 2020 106 817 23 10.1136/heartjnl-2019-316297 32098808 10. Cardinale D Mills NL Mueller C Study Group on Biomarkers of the ESC Association for Acute CardioVascular Care. Cardiac biomarkers in the field of cardio-oncology. Eur Heart J Acute Cardiovasc Care 2022 11 e1 2 10.1093/ehjacc/zuac126 36215174 PMC9709630 11. Pudil R Mueller C Čelutkienė J Role of serum biomarkers in cancer patients receiving cardiotoxic cancer therapies: a position statement from the Cardio-Oncology Study Group of the Heart Failure Association and the Cardio-Oncology Council of the European Society of Cardiology. Eur J Heart Fail 2020 22 1966 83 10.1002/ejhf.2017 33006257 12. Ananthan K Lyon AR The role of biomarkers in cardiooncology. J Cardiovasc Transl Res 2020 13 431 50 10.1007/s12265-020-10042-3 32642841 PMC7360533 13. Cardinale D Sandri MT Martinoni A Left ventricular dysfunction predicted by early troponin I release after high-dose chemotherapy. J Am Coll Cardiol 2000 36 517 22 10.1016/s0735-1097(00)00748-8 10933366 14. Cardinale D Colombo A Torrisi R Trastuzumab-induced cardiotoxicity: clinical and prognostic implications of troponin I evaluation. J Clin Oncol 2010 28 3910 6 10.1200/jco.2009.27.3615 20679614 15. Cardinale D Sandri MT Colombo A Prognostic value of troponin I in cardiac risk stratification of cancer patients undergoing high-dose chemotherapy. Circulation 2004 109 2749 54 10.1161/01.cir.0000130926.51766.cc 15148277 16. Sawaya H Sebag IA Plana JC Assessment of echocardiography and biomarkers for the extended prediction of cardiotoxicity in patients treated with anthracyclines, taxanes, and trastuzumab. Circ Cardiovasc Imaging 2012 5 596 603 10.1161/CIRCIMAGING.112.973321 22744937 PMC3703313 17. Daugaard G Lassen U Bie P Natriuretic peptides in the monitoring of anthracycline induced reduction in left ventricular ejection fraction. Eur J Heart Fail 2005 7 87 93 10.1016/j.ejheart.2004.03.009 15642537 18. Zhang N Wang N Zhang Y Early detection of chemotherapy-induced cardiotoxicity in breast cancer patients: a comprehensive analysis using speckle tracking echocardiography. Front Cardiovasc Med 2024 11 1413827 10.3389/fcvm.2024.1413827 39346098 PMC11427351 19. Dodos F Halbsguth T Erdmann E Hoppe UC Usefulness of myocardial performance index and biochemical markers for early detection of anthracycline-induced cardiotoxicity in adults. Clin Res Cardiol 2008 97 318 26 10.1007/s00392-007-0633-6 18193371 20. De Iuliis F Salerno G Taglieri L Serum biomarkers evaluation to predict chemotherapy-induced cardiotoxicity in breast cancer patients. Tumour Biol 2016 37 3379 87 10.1007/s13277-015-4183-7 26449821 21. Sandri MT Salvatici M Cardinale D N-terminal pro-B-type natriuretic peptide after high-dose chemotherapy: a marker predictive of cardiac dysfunction? Clin Chem 2005 51 1405 10 10.1373/clinchem.2005.050153 15932966 22. Sawaya H Sebag IA Plana JC Early detection and prediction of cardiotoxicity in chemotherapy-treated patients. Am J Cardiol 2011 107 1375 80 10.1016/j.amjcard.2011.01.006 21371685 PMC3703314 23. Mavinkurve-Groothuis AMC Marcus KA Pourier M Myocardial 2D strain echocardiography and cardiac biomarkers in children during and shortly after anthracycline therapy for acute lymphoblastic leukaemia (ALL): a prospective study. Eur Heart J Cardiovasc Imaging 2013 14 562 9 10.1093/ehjci/jes217 23109647 24. Ky B Putt M Sawaya H Early increases in multiple biomarkers predict subsequent cardiotoxicity in patients with breast cancer treated with doxorubicin, taxanes, and trastuzumab. J Am Coll Cardiol 2014 63 809 16 10.1016/j.jacc.2013.10.061 24291281 PMC4286181 25. Kitayama H Kondo T Sugiyama J High-sensitive troponin T assay can predict anthracycline- and trastuzumab-induced cardiotoxicity in breast cancer patients. Breast Cancer 2017 24 774 82 10.1007/s12282-017-0778-8 28434150 26. Lipshultz SE Rifai N Sallan SE Predictive value of cardiac troponin T in pediatric patients at risk for myocardial injury. Circulation 1997 96 2641 8 10.1161/01.cir.96.8.2641 9355905 27. Auner HW Tinchon C Linkesch W Prolonged monitoring of troponin T for the detection of anthracycline cardiotoxicity in adults with hematological malignancies. Ann Hematol 2003 82 218 22 10.1007/s00277-003-0615-3 12679885 28. Sandri MT Cardinale D Zorzino L Minor increases in plasma troponin I predict decreased left ventricular ejection fraction after high-dose chemotherapy. Clin Chem 2003 49 248 52 10.1373/49.2.248 12560347 29. Pavo N Raderer M Hülsmann M Cardiovascular biomarkers in patients with cancer and their association with all-cause mortality. Heart 2015 101 1874 80 10.1136/heartjnl-2015-307848 26416836 30. Lenihan DJ Stevens PL Massey M The utility of point-of-care biomarkers to detect cardiotoxicity during anthracycline chemotherapy: a feasibility study. J Card Fail 2016 22 433 8 10.1016/j.cardfail.2016.04.003 27079675 31. Zardavas D Suter TM Van Veldhuisen DJ Role of troponins I and T and N-terminal prohormone of brain natriuretic peptide in monitoring cardiac safety of patients with early-stage human epidermal growth factor receptor 2-positive breast cancer receiving trastuzumab: a Herceptin adjuvant study cardiac marker substudy. J Clin Oncol 2017 35 878 84 10.1200/JCO.2015.65.7916 28199174 32. Cardinale D Biasillo G Cipolla CM Curing cancer, saving the heart: a challenge that cardioncology should not miss. Curr Cardiol Rep 2016 18 51 10.1007/s11886-016-0731-z 27108361 33. Bonaca MP Olenchock BA Salem JE Myocarditis in the setting of cancer therapeutics: proposed case definitions for emerging clinical syndromes in cardiooncology. Circulation 2019 140 80 91 10.1161/CIRCULATIONAHA.118.034497 31390169 PMC6779326 34. Mahmood SS Fradley MG Cohen JV Myocarditis in patients treated with immune checkpoint inhibitors. J Am Coll Cardiol 2018 71 1755 64 10.1016/j.jacc.2018.02.037 29567210 PMC6196725 35. Cornell RF Ky B Weiss BM Prospective study of cardiac events during proteasome inhibitor therapy for relapsed multiple myeloma. J Clin Oncol 2019 37 1946 55 10.1200/JCO.19.00231 31188726 PMC9798911 36. Lunardi M Al-Habbaa A Abdelshafy M Genetic and RNA-related molecular markers of trastuzumabchemotherapy-associated cardiotoxicity in HER2 positive breast cancer: a systematic review. BMC Cancer 2022 22 396 10.1186/s12885-022-09437-z 35413811 PMC9004047 37. Boen HM Cherubin M Franssen C Circulating microRNA as biomarkers of anthracycline-induced cardiotoxicity: JACC: CardioOncology state-of-the-art review. JACC CardioOncol 2024 6 183 99 10.1016/j.jaccao.2023.12.009 38774014 PMC11103047 38. Dean M Kim MJ Dimauro S Cardiac and noncardiac biomarkers in patients undergoing anthracycline chemotherapy – a prospective analysis. Cardiooncology 2023 9 23 10.1186/s40959-023-00174-1 37106424 PMC10133897 39. Van Boxtel W Bulten BF Mavinkurve-Groothuis AM New biomarkers for early detection of cardiotoxicity after treatment with docetaxel, doxorubicin and cyclophosphamide. Biomarkers 2015 20 143 8 10.3109/1354750X.2015.1040839 25980453 40. Armenian SH Ding Y Mills G Genetic susceptibility to anthracycline-related congestive heart failure in survivors of haematopoietic cell transplantation. Br J Haematol 2013 163 205 13 10.1111/bjh.12516 23927520 PMC3795883 41. Omland T Heck SL Gulati G The role of cardioprotection in cancer therapy cardiotoxicity: JACC: CardioOncology state-of-the-art review. JACC CardioOncol 2022 4 19 37 10.1016/j.jaccao.2022.01.101 35492815 PMC9040117 42. Mecinaj A Gulati G Heck SL Rationale and design of the PRevention of cArdiac Dysfunction during Adjuvant breast cancer therapy (PRADA II) trial: a randomized, placebo-controlled, multicenter trial. Cardiooncology 2021 7 33 10.1186/s40959-021-00115-w 34579775 PMC8474901 43. Hahn VS Zhang KW Sun L Heart failure with targeted cancer therapies: mechanisms and cardioprotection. Circ Res 2021 128 1576 93 10.1161/CIRCRESAHA.121.318223 33983833 PMC8765442 44. Cardinale D Colombo A Sandri MT Prevention of high-dose chemotherapy-induced cardiotoxicity in high-risk patients by angiotensin-converting enzyme inhibition. Circulation 2006 114 2474 81 10.1161/CIRCULATIONAHA.106.635144 17101852 45. Gulati G Heck SL Ree AH Prevention of cardiac dysfunction during adjuvant breast cancer therapy (PRADA): a 2 x 2 factorial, randomized, placebo-controlled, doubleblind clinical trial of candesartan and metoprolol. Eur Heart J 2016 37 1671 80 10.1093/eurheartj/ehw022 26903532 PMC4887703 46. Heck SL Mecinaj A Ree AH Prevention of cardiac dysfunction during adjuvant breast cancer therapy (PRADA): extended follow-up of a 2x2 factorial, randomized, placebo-controlled, double-blind clinical trial of candesartan and metoprolol. Circulation 2021 143 2431 40 10.1161/CIRCULATIONAHA.121.054698 33993702 PMC8212877 47. Avila MS Ayub-Ferreira SM de Barros Wanderley MR Jr Carvedilol for prevention of chemotherapy-related cardiotoxicity: the CECCY trial. J Am Coll Cardiol 2018 71 2281 90 10.1016/j.jacc.2018.02.049 29540327 48. Livi L Barletta G Martella F Cardioprotective strategy for patients with nonmetastatic breast cancer who are receiving an anthracycline-based chemotherapy: a randomized clinical trial. JAMA Oncol 2021 7 1544 9 10.1001/jamaoncol.2021.3395 34436523 PMC8391772 49. Cardinale D Ciceri F Latini R Anthracycline-induced cardiotoxicity: a multicenter randomised trial comparing two strategies for guiding prevention with enalapril: the International CardioOncology Society-one trial. Eur J Cancer 2018 94 126 37 10.1016/j.ejca.2018.02.005 29567630 50. Meessen JMTA Cardinale D Ciceri F Circulating biomarkers and cardiac function over 3 years after chemotherapy with anthracyclines: the ICOS-ONE trial. ESC Heart Fail 2020 7 1452 66 10.1002/ehf2.12695 32358917 PMC7373944 51. Negishi T Thavendiranathan P Penicka M Cardioprotection using strain-guided management of potentially cardiotoxic cancer therapy: 3-year results of the SUCCOUR trial. JACC Cardiovasc Imaging 2023 16 269 78 10.1016/j.jcmg.2022.10.010 36435732 52. Pituskin E Mackey JR Koshman S Multidisciplinary approach to novel therapies in cardio-oncology research (MANTICORE 101-breast): a randomized trial for the prevention of trastuzumab-associated cardiotoxicity. J Clin Oncol 2017 35 870 7 10.1200/JCO.2016.68.7830 27893331 53. Boekhout AH Gietema JA Milojkovic Kerklaan B Angiotensin II-receptor inhibition with candesartan to prevent trastuzumab-related cardiotoxic effects in patients with early breast cancer: a randomized clinical trial. JAMA Oncol 2016 2 1030 7 10.1001/jamaoncol.2016.1726 27348762 54. Lynce F Barac A Geng X Prospective evaluation of the cardiac safety of HER2-targeted therapies in patients with HER2-positive breast cancer and compromised heart function: the SAFE-HEaRt study. Breast Cancer Res Treat 2019 175 595 603 10.1007/s10549-019-05191-2 30852761 PMC6534513 55. Leong DP Cosman T Alhussein MM Safety of continuing trastuzumab despite mild cardiotoxicity: a Phase I trial. JACC CardioOncol 2019 1 1 10 10.1016/j.jaccao.2019.06.004 34396157 PMC8352338 56. Tajstra M Dyrbuś M Rutkowski T Sacubitril/valsartan for cardioprotection in breast cancer (MAINSTREAM): design and rationale of the randomized trial. ESC Heart Fail 2023 10 3174 83 10.1002/ehf2.14466 37449716 PMC10567668 57. Bhalraam U Veerni RB Paddock S Impact of sodiumglucose cotransporter-2 inhibitors on heart failure outcomes in cancer patients and survivors: a systematic review and meta-analysis. Eur J Prev Cardiol 2025 10.1093/eurjpc/zwaf026 epub ahead of press 40044419 58. Akpek M Ozdogru I Sahin O Protective effects of spironolactone against anthracycline-induced cardiomyopathy. Eur J Heart Fail 2015 17 81 9 10.1002/ejhf.196 25410653 59. Boulet J Peña J Hulten EA Statin use and risk of vascular events among cancer patients after radiotherapy to the thorax, head, and neck. J Am Heart Assoc 2019 8 e005996 10.1161/JAHA.117.005996 31213106 PMC6662340 60. Macedo AVS Hajjar LA Lyon AR Efficacy of dexrazoxane in preventing anthracycline cardiotoxicity in breast cancer. JACC CardioOncol 2019 1 68 79 10.1016/j.jaccao.2019.08.003 34396164 PMC8352186 61. de Baat EC Mulder RL Armenian S Dexrazoxane for preventing or reducing cardiotoxicity in adults and children with cancer receiving anthracyclines. Cochrane Database Syst Rev 2022 9 CD014638 10.1002/14651858.CD014638.pub2 36162822 PMC9512638 62. Chow EJ Aggarwal S Doody DR Dexrazoxane and long-term heart function in survivors of childhood cancer. J Clin Oncol 2023 41 2248 57 10.1200/JCO.22.02423 36669148 PMC10448941 63. de Baat EC van Dalen EC Mulder RL Primary cardioprotection with dexrazoxane in patients with childhood cancer who are expected to receive anthracyclines: recommendations from the International Late Effects of Childhood Cancer Guideline Harmonization Group. Lancet Child Adolesc Health 2022 6 885 94 10.1016/S2352-4642(22)00239-5 36174614 64. Brien ME Wigler N Inbar M Reduced cardiotoxicity and comparable efficacy in a phase III trial of pegylated liposomal doxorubicin HCl (CAELYX/Doxil) versus conventional doxorubicin for first-line treatment of metastatic breast cancer. Ann Oncol 2004 15 440 9 10.1093/annonc/mdh097 14998846 65. Aloss K Hamar P Recent preclinical and clinical progress in liposomal doxorubicin. Pharmaceutics 2023 15 893 10.3390/pharmaceutics15030893 36986754 PMC10054554 66. Rafiyath SM Rasul M Lee B Comparison of safety and toxicity of liposomal doxorubicin vs. conventional anthracyclines: a meta-analysis. Exp Hematol Oncol 2012 1 10 10.1186/2162-3619-1-10 23210520 PMC3514106 67. Curigliano G Lenihan D Fradley M Management of cardiac disease in cancer patients throughout oncological treatment: ESMO consensus recommendations. Ann Oncol 2020 31 171 90 10.1016/j.annonc.2019.10.023 31959335 PMC8019325 68. Lyon AR Dent S Stanway S Baseline cardiovascular risk assessment in cancer patients scheduled to receive cardiotoxic cancer therapies: a position statement and new risk assessment tools from the Cardio-Oncology Study Group of the Heart Failure Association of the European Society of Cardiology in collaboration with the International Cardio-Oncology Society. Eur J Heart Fail 2020 22 1945 60 10.1002/ejhf.1920 32463967 PMC8019326 69. Mecinaj A Gulati G Ree AH Impact of the ESC cardiooncology guidelines biomarker criteria on incidence of cancer therapy-related cardiac dysfunction. JACC CardioOncol 2024 6 83 95 10.1016/j.jaccao.2023.10.008 38510299 PMC10950440 ",
  "metadata": {
    "Title of this paper": "Impact of the ESC cardiooncology guidelines biomarker criteria on incidence of cancer therapy-related cardiac dysfunction.",
    "Journal it was published in:": "European Cardiology Review",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481373/"
  }
}