{
  "title": "Paper_747",
  "abstract": "pmc Cancer Med Cancer Med 1974 canmed CAM4 Cancer Medicine 2045-7634 Wiley PMC12477621 PMC12477621.1 12477621 12477621 41020376 10.1002/cam4.71217 CAM471217 CAM4-2025-02-0964.R1 1 Research Article Research Article  SIRT1 Liu Wenxuan  1 Li Xinyi  1 Deng Wenhong https://orcid.org/0000-0002-2921-2707  1  2 wenhongdeng@whu.edu.cn   1 Laboratory of General Surgery Renmin Hospital of Wuhan University Wuhan Hubei China   2 Department of General Surgery The Second Affiliated Hospital of Anhui Medical University Hefei China * Correspondence: wenhongdeng@whu.edu.cn 29 9 2025 10 2025 14 19 497574 10.1002/cam4.v14.19 e71217 24 8 2025 18 2 2025 28 8 2025 29 09 2025 30 09 2025 30 09 2025 © 2025 The Author(s). Cancer Medicine https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ ABSTRACT Objective This study aimed to investigate the expression levels of SIRT1 protein in gastric (GC), colon (CC), and rectal cancer (RC) tissues and patient plasma, analyze its correlation with clinicopathological features and prognosis, and preliminarily explore its relationship with the tumor immune microenvironment. Methods Plasma samples were collected from 198 gastrointestinal cancer patients (66 each of GC, CC, and RC) and 66 healthy volunteers. Additionally, cancerous and adjacent normal tissues were obtained from 45 of these patients (15 pairs for each cancer type). SIRT1 concentration in plasma was detected using Enzyme‐Linked Immunosorbent Assay (ELISA). SIRT1 protein expression in tissues was examined using Immunohistochemistry (IHC) and Western Blotting. Bioinformatic analysis was performed using TCGA and GEPIA databases. The correlation between SIRT1 and immune cell infiltration was analyzed via the TIMER database. Statistical analyses were conducted using SPSS software. Results Plasma SIRT1 concentration was significantly higher in the GC group compared to healthy controls ( p p p p p p p Conclusion SIRT1 expression in gastrointestinal tumors is tissue‐specific (upregulated in GC, downregulated in colorectal cancer). Its expression level is closely associated with malignant progression and patient prognosis, and it may be involved in the modulation of the tumor immune microenvironment. SIRT1 shows promise as a potential diagnostic biomarker and therapeutic target for gastrointestinal cancers. clinical significance colon cancer gastric cancer immunity rectal cancer SIRT1 National Natural Science Foundation of China (82172855, China) 10.13039/501100001809 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:29.09.2025  W. Liu X. Li W. Deng  SIRT1 Cancer Medicine 14 19 2025 e71217 10.1002/cam4.71217  Funding: 1 Introduction Gastrointestinal tumors, encompassing gastric, colon, and rectal cancers, represent some of the most prevalent malignant neoplasms of the digestive system [ 1 2 The gastrointestinal tumorigenesis and pathogenesis are intricate processes, governed by a plethora of distinct genes. Several researchers have concentrated on genes and their mechanisms linked to the development of gastrointestinal tumors in order to uncover potential medicines that target specific genes and can be tailored to individuals [ 3 4 5 SIRT1 has been shown to be a type III histone deacetylase (HDAC) that is dependent on nicotinamide adenine dinucleotide (NAD+) for its functioning, as revealed by recent research [ 6 7 8 9 10 11 12 13 14 To gain further insight into the presence of SIRT1 in gastrointestinal tumors, this study examined the distribution of SIRT1 in gastric cancer (GC), colon cancer (CC), and rectal cancer (RC) tissues and normal tissues, as well as in plasma of patients with gastric, colon, and rectal cancers and healthy populations. This was achieved through the use of immunohistochemistry and ELISA analyses, which enabled the analysis of SIRT1 expression levels and the association of clinicopathological factors. The findings may offer novel insights and avenues for further investigation into the pathology of gastrointestinal tumors. 2 Materials and Methods 2.1 Collection and Storage of Plasma and Tissue Samples From September 2021 to May 2024, plasma samples were collected from 198 patients with gastrointestinal tumors (66 each of gastric, colon, and rectal cancers) who underwent surgery and 66 healthy volunteers. Additionally, specimens of cancerous tissues were obtained from 45 of these patients (15 pairs of each of gastric, colon, and rectal cancers), as well as normal tissues. The samples were collected from the People's Hospital of Wuhan University (Wuhan, China). The blood samples were placed in vacuum blood collection tubes that contained ethylenediaminetetraacetic acid (EDTA) anticoagulant. The tubes were then refrigerated at a temperature of 4°C. Within 2 h of collection, all samples were centrifuged at 4°C and 1000 g for 15 min. Afterwards, the liquid above the sediment was moved to empty Eppendorf tubes and kept at a temperature of −80°C. All specimens consisted of recently harvested tumor tissue and paracancerous tissue, which refers to normal mucosal tissue located at least 5 cm away from the tumor edge. The samples were placed in EP tubes that had been treated with a solution of 0.1% diethyl pyrocarbonate (DEPC) in water. The following criteria were used to determine eligibility for inclusion in the study: (1) All patients were diagnosed with gastric, colon, or rectal cancer following histopathological examination and had no previous gastrointestinal surgery. (2) They received a complete laboratory examination and had complete clinical and pathological data. The following criteria must be met in order to be eligible for inclusion in the study: (1) Other malignant tumors or serious diseases of the gastrointestinal tract; (2) neoadjuvant chemotherapy in the last 3 months. 2.2 Enzyme‐Linked Immunosorbent Assay ( ELISA Prior to analysis, all reagents, working standards, and samples were kept at room temperature for at least 30 min. Firstly, the samples and standards of different concentrations were added to the corresponding wells at 100 μL per well, respectively, and 100 μL of universal diluent was added to the blank wells. Incubate for 60 min at 37°C. Next, the solution containing the antibody that has been modified with biotin is introduced, and the process of incubation is prolonged for a duration of 60 min. Afterwards, the plate was cleansed, with each well undergoing a 60‐min period of incubation with a wash water buffer. The liquid was fully extracted at each stage. The plate was washed an additional five times following the previously specified technique. Afterward, 90 μL of substrate (TMB) was introduced into each well. The plate was then covered with a membrane, and the contents were left to incubate for 15 min in the absence of light. Before adding 50 μL of termination solution to each well, promptly evaluate the optical density value of each well at 450 nm. 2.3 Immunohistochemistry Tumor and paracancerous tissues were collected from GC, CC, and RC patients in Renmin Hospital of Wuhan University, after we excluded samples without obvious tumor tissue. Fifteen pairs of each tumor type were collected to verify the differential expression of SIRT1. The expression of SIRT1 was assessed by immunohistochemistry (IHC). To enhance antigen retrieval, paraffin‐embedded tissue sections were deparaffinized and treated with citrate buffer at 100°C for 15 min. Following an overnight incubation at 4°C with the primary antibody (Proteintech, 13161‐1‐AP1:1000), the sections were individually and gently washed with a sufficient volume of PBS. Subsequently, they were treated with the suitable secondary antibody for 30 min at 37°C. The sections were stained with hematoxylin and restained with DAB following a second rinse in PBS. Immunohistochemical sections were examined using an Olympus BX63 microscope to assess the localization and intensity of staining. All slides were measured and photographed blindly using a light microscope. When taking pictures, make sure that the exposure time, aperture, and exposure conditions are the same for each picture by using a camera with manual controls that does not move any parts except for adjusting the focus and field of view. The AOD (integrated optical density/area) of the immunostained sections was measured quantitatively using the Image‐Pro Plus 6.0 software (Media Cybernetics Inc., Bethesda, USA). The median value was used to determine whether a group had high or low expression. 2.4 Western Blotting Total cellular proteins were extracted using RIPA lysis buffer (G2002, Servicebio, Wuhan, China) and the obtained proteins were quantified using the BCA method (G2026, Servicebio, Wuhan, China). Individual proteins were isolated from the mixture using SDS‐PAGE. The isolated proteins were then transferred onto nitrocellulose (NC) membranes (Millipore, Massachusetts, USA). The membranes were then treated with primary antibodies specific for SIRT1 (13161‐1‐AP, Proteintech) and GAPDH (60004‐1‐Ig, Proteintech) for 16 h at 4°C. The membranes were then washed with TBST to remove the proteins from the membrane. The membranes were then washed with TBST and incubated with fluorescent secondary antibodies for 1 h at room temperature. After washing the membranes with TBST, the membranes were scanned with an Odyssey instrument and analyzed to calculate the relative expression of each index. 2.5 Statistical Methods The data were analyzed utilizing the SPSS software (IBM SPSS Statistics, V21.0) and presented as the mean ± standard deviation. A paired samples t p 3 Results 3.1 A Comparison of the General Conditions of the Gastrointestinal Tumor Group and the Normal Control Group A cohort of 198 individuals diagnosed with gastrointestinal tumors and 66 healthy volunteers were enlisted to undergo plasma SIRT1 testing. The plasma SIRT1 expression was (4.96 ± 2.59) ng/mL in 66 patients with gastric cancer, 43 of whom were male and 23 of whom were female, and the age range was 34–76 (58.91 ± 9.78) years. Sixty‐six patients with colon cancer, aged 27–80 (57.96 ± 13.79) years, with plasma SIRT1 expression of (3.29 ± 1.43) ng/mL, consist of 39 males and 27 females. Plasma SIRT1 expression was 3.33 ± 1.35 ng/mL in 66 patients with rectal cancer, including 36 males and 30 females, aged 22–83 (59.50 ± 15.40) years. The healthy control group consisted of 34 females and 32 males, with ages ranging from 34 to 74 years old (mean age: 54.52 ± 9.65). The plasma SIRT1 expression was (4.14 ± 4.14) ng/mL, as indicated in Table S1 The plasma concentration of SIRT1 was significantly higher in the GC group [(4.96 ± 2.59) ng/mL vs. (4.14 ± 2.08) ng/mL, p p p 1 FIGURE 1 SIRT1 levels in plasma of GC, CC, and RC patients, ELISA analysis showed that serum SIRT1 levels were significantly higher in GC patients than in healthy controls and lower in CC and RC patients than in the healthy group. 3.2 Correlation Between SIRTI There was a statistically significant difference in the plasma levels of SIRT1 between male and female GC patients [(5.16 ± 2.58) ng/mL vs. (2.58 ± 2.64) ng/mL, p p p p p 1 TABLE 1 Association between SIRT1 expression and clinicopathological data of patients with gastric cancer. Variable Case SIRT1 (ng/mL)  p Age ≤ 60 years 36 5.02 ± 2.68 0.847 > 60 years 30 4.90 ± 2.52 Gender Male 43 5.16 ± 2.58 0.412 Female 23 2.58 ± 2.64 Differentiation Low 36 6.16 ± 2.47 0.000 Medium + high 30 3.53 ± 1.95 Depth of invasion Mucous membranes + muscle layer 35 4.28 ± 2.53 0.021 Whole layer 31 5.74 ± 2.47 TNM stage I + II 32 4.29 ± 2.64 0.025 III + IV 34 5.59 ± 2.42 Distant metastasis Yes 26 5.58 ± 2.58 0.120 No 40 4.56 ± 2.55 Lymph node metastasis Yes 36 5.26 ± 2.64 0.308 No 30 4.61 ± 2.53 The quantities of SIRT1 in the plasma of patients diagnosed with colon cancer exhibited a noteworthy distinction between the low and moderately differentiated groups, as well as the highly differentiated group [(2.48 ± 1.14) ng/mL vs. (3.69 ± 1.40) ng/mL, p p p p 2 TABLE 2 Association between SIRT1 expression and clinicopathological data of patients with colon cancer. Variable Case SIRT1 (ng/mL)  p Age ≤ 60 years 38 3.23 ± 1.46 0.710 > 60 years 28 3.37 ± 1.42 Gender Male 39 3.33 ± 1.40 0.781 Female 27 3.23 ± 1.51 Differentiation Low 22 2.48 ± 1.14 0.001 Medium + High 44 3.69 ± 1.40 Depth of invasion Mucous membranes + muscle layer 38 3.51 ± 1.54 0.148 Whole layer 28 2.99 ± 1.24 TNM stage I + II 30 3.80 ± 1.41 0.008 III + IV 36 2.87 ± 1.33 Distant metastasis Yes 29 2.78 ± 1.42 0.010 No 37 3.70 ± 1.33 Lymph node metastasis Yes 31 3.53 ± 1.44 0.203 No 35 3.08 ± 1.42 SIRT1 plasma concentration in rectal cancer patients was found to be lower in the low differentiation group [(2.84 ± 1.35) ng/mL vs. (3.69 ± 1.25) ng/mL, p p p p 3 TABLE 3 Association between SIRT1 expression and clinicopathological data of patients with rectal cancer. Varible Case SIRT1 (ng/mL)  p Age ≤ 60 years 31 3.34 ± 1.35 0.957 > 60 years 35 3.32 ± 1.38 Gender Male 36 3.02 ± 1.13 0.075 Female 30 3.61 ± 1.49 Differentiation Low 28 2.84 ± 1.35 0.011 Medium + high 38 3.69 ± 1.25 Depth of invasion Mucous membranes + muscle layer 39 3.41 ± 1.35 0.569 Whole layer 27 3.22 ± 1.38 TNM stage I + II 37 3.64 ± 1.42 0.036 III + IV 29 2.94 ± 1.17 Distant metastasis Yes 27 3.06 ± 1.28 0.180 No 39 3.52 ± 1.39 Lymph node metastasis Yes 25 2.67 ± 1.36 0.001 No 41 3.74 ± 1.19 3.3  SIRT1 We performed a comprehensive investigation of the levels of manifestation of SIRT1 in malignant tissues and normal samples obtained from the TCGA STAD, COAD, and READ datasets utilizing the GEPIA database. According to the findings, SIRT1 was shown to be increased in gastric cancer patients and decreased in colon and rectal cancer patients compared to normal samples, as depicted in Figure 2A p p p 2B,C S1 FIGURE 2 SIRT1 expression in human GC, CC, and RC patients and normal tissues. (A) Box plots comparing SIRT1 expression in GC, CC, and RC patients from TCGA database. (B) Immunohistochemical analyses of tumor tissues and normal tissues of GC, CC, and RC patients. (C) Immunohistochemical statistical plots. 3.4 Relationship Between SIRT1 It was determined whether or not there was a connection between the levels of SIRT1 expression and the prognosis of patients who were diagnosed with gastrointestinal malignancies via the course of an inquiry. It was found that in gastric cancer, higher SIRT1 expression levels were strongly linked to unfavorable overall survival (OS) in GC ( p 3A p 3B 3C p 3 FIGURE 3 Relationship between SIRT1 expression and survival. (A) Relationship between SIRT1 and OS, DSS in GC patients. (B) Relationship between SIRT1 and OS, DSS in CC patients. (C) Relationship between SIRT1 and OS, DSS in RC patients. 3.5 Correlation Between Plasma SIRT1 The data presented in Table 4 r p r p r p p r p 5 p r p r p 4 p 5 p r p r p p 6 TABLE 4 Correlation between serum SIRT1 and tumor markers in patients with gastric cancer. Variable  r  p CEA 0.255 0.039 CA125 0.260 0.035 CA199 0.177 0.155 CA724 0.268 0.030 SCC 0.210 0.091 AFP −0.036 0.775 AFU −0.149 0.233 ALT 0.034 0.786 AST −0.140 0.261 TABLE 5 Correlation between serum SIRT1 and tumor markers in patients with colon cancer. Variable  r  p CEA −0.251 0.042 CA125 −0.168 0.179 CA199 −0.342 0.005 CA724 −0.183 0.140 SCC 0.104 0.406 AFP 0.107 0.395 AFU 0.208 0.094 ALT −0.125 0.318 AST 0.056 0.654 TABLE 6 Correlation between serum SIRT1 and tumor markers in patients with rectal cancer. Variable  r  p CEA −0.250 0.043 CA125 −0.068 0.588 CA199 −0.365 0.003 CA724 −0.044 0.728 SCC 0.023 0.855 AFP −0.153 0.220 AFU 0.115 0.359 ALT −0.014 0.913 AST 0.008 0.949 3.6  SIRT1 Through the use of the TIMER database, we investigated the link between this gene and immune cell infiltration in order to discover the connection that exists between SIRT1 and the immunomodulation of gastrointestinal tumors. In cases of gastric cancer, there was a positive correlation between SIRT1 and CD4+ T cells ( r r r r r r r r r r r r 4 FIGURE 4 SIRT1 in tumor‐infiltrating immune cells. (a) Relationship between SIRT1 and gastric cancer CD4+ T cells. (b) Relationship between SIRT1 and gastric cancer CD8+ T cells. (c) Relationship between SIRT1 and gastric cancer macrophages. (d) Relationship between SIRT1 and gastric cancer neutrophils. (e) Relationship between SIRT1 and colon cancer CD4+ T cells. (f) Relationship between SIRT1 and colon cancer CD8+ T cells. (g) Relationship between SIRT1 and colon cancer macrophages. (h) Relationship between SIRT1 and colon cancer neutrophils. (i) Relationship between SIRT1 and rectal cancer CD4+ T cells. (j) Relationship between SIRT1 and rectal cancer CD8+ T cells. (k) Relationship between SIRT1 and rectal cancer macrophages. (l) Relationship between SIRT1 and rectal cancer neutrophils. 4 Discussion In our recent study, we investigated the high and low expression of SIRT1, a NAD+‐dependent histone deacetylase, also known as HDAC class III enzyme [ 6 p p p SIRT1 plays an important role in the regulation of cellular senescence, energy metabolism, and tumor growth [ 15 7 16 17 18 19 In this study, we conducted an extensive investigation into the role of SIRT1 in gastrointestinal cancers through immunohistochemistry and ELISA, alongside data from the TCGA and TIMER databases. IHC, performed on surgically resected tumor specimens, provides critical insights into tumor biology, including the degree of cellular differentiation, invasiveness, and potential prognostic markers. For example, the overexpression status of HER2 (human epidermal growth factor receptor 2) is an important predictor in the treatment of gastric cancer, and detecting the expression level of HER2 protein by IHC can guide clinicians in deciding whether or not to use targeted therapy against HER2 [ 20 21 22 The development of gastrointestinal tumors is strongly influenced by dietary habits, lifestyle factors, and geographical location [ 23 24 25 p p p p 26 Furthermore, elevated SIRT1 expression in gastric cancer showed a strong correlation with both OS and DSS ( p 27 p p 28 29 This also confirms why the expression of SIRT1 was relatively low in colorectal cancer in our study. ELISA protocols are easy to perform, take very little time to perform, and have high sensitivity and specificity for monitoring changes in the levels of tumor markers such as CEA (carcinoembryonic antigen) and CA19‐9 [ 30 While previous research has extensively explored the role of SIRT1 in gastric and colorectal cancers, our study offers novel insights by directly comparing SIRT1 expression across three major gastrointestinal cancers: gastric, colon, and rectal cancers. This comparative analysis is important as it provides a comprehensive understanding of how SIRT1 functions differently across various gastrointestinal tumor types. Moreover, our study goes beyond the simple characterization of SIRT1 expression levels, integrating multiple experimental techniques (immunohistochemistry, ELISA, Western blotting) and bioinformatic data from TCGA and TIMER to provide a robust and multi‐dimensional view of SIRT1's role. We also focus on the clinical implications of SIRT1 expression, demonstrating its potential as both a prognostic biomarker and therapeutic target in gastrointestinal cancers. Furthermore, by investigating the link between SIRT1 expression and immune cell infiltration in the tumor microenvironment, our study offers new insights into the immunological implications of SIRT1, an aspect that has not been fully explored in previous research. Overall, our findings contribute to a deeper understanding of SIRT1's role in gastrointestinal tumor progression and its potential as a target for future clinical interventions. However, our study faces inherent limitations. The clinical sample size is insufficient, and there is a scarcity of in vitro and in vivo experiments to substantiate our findings. The relationship between SIRT1 expression and cancer progression, as well as its underlying mechanisms, remains elusive. Moving forward, we aim to expand our clinical sample cohort to validate our clinical observations and explore potential mechanisms. Further investigation is warranted to establish the link between SIRT1 and cancer progression, facilitating the development of novel strategies for early detection and targeted treatment of gastrointestinal cancers. Author Contributions  Wenxuan Liu: Xinyi Li: Wenhong Deng: Ethics Statement Research has been performed in accordance with the Declaration of Helsinki. All methods were performed in accordance with the relevant guidelines and regulations. All patients provided their informed consent in writing preoperatively. Ethical approval for this study was obtained from the Clinical Research Ethics Committee of Wuhan University People's Hospital (No. WDRY2022‐K258). Consent Gastric, colorectal, and rectal cancer samples and normal tissues were obtained from Wuhan University People's Hospital. Conflicts of Interest The authors declare no conflicts of interest. Supporting information  Figure S1:  Table S1: Acknowledgments The authors have nothing to report. Data Availability Statement All of the data we used in this study were publicly available as described in the Section 2 References 1 K. D. Miller L. Nogueira T. Devasia Cancer Treatment and Survivorship Statistics, 2022 CA: A Cancer Journal for Clinicians 72 2022 409 436 10.3322/caac.21731 35736631 2 R. L. Siegel K. D. Miller A. Jemal Cancer Statistics, 2020 CA: A Cancer Journal for Clinicians 70 2020 7 30 10.3322/caac.21590 31912902 3 T. Bou Kheir E. Futoma‐Kazmierczak A. Jacobsen miR‐449 Inhibits Cell Proliferation and Is Down‐Regulated in Gastric Cancer Molecular Cancer 10 2011 29 10.1186/1476-4598-10-29 21418558 PMC3070685 4 C. Travelli F. M. Consonni S. Sangaletti Nicotinamide Phosphoribosyltransferase Acts as a Metabolic Gate for Mobilization of Myeloid‐Derived Suppressor Cells Cancer Research 79 2019 1938 1951 10.1158/0008-5472.Can-18-1544 30777853 5 H. Lee M. Song N. Shin Diagnostic significance of serum HMGB1 in colorectal carcinomas PLoS One 7 2012 e34318 10.1371/journal.pone.0034318 22496788 PMC3319566 6 M. Kaeberlein M. McVey L. Guarente The SIR2/3/4 Complex and SIR2 Alone Promote Longevity in  Saccharomyces cerevisiae Genes & Development 13 1999 2570 2580 10.1101/gad.13.19.2570 10521401 PMC317077 7 M. Fadri‐Moskwik K. N. Weiderhold A. Deeraksa Aurora B Is Regulated by Acetylation/Deacetylation During Mitosis in Prostate Cancer Cells FASEB Journal 26 2012 4057 4067 10.1096/fj.12-206656 22751009 PMC3448774 8 C. Feng X. Jin Y. Han Expression and Prognostic Analyses of ITGA3, ITGA5, and ITGA6 in Head and Neck Squamous Cell Carcinoma Medical Science Monitor 26 2020 e926800 10.12659/msm.926800 33099569 PMC7594586 9 C. A. Bradbury F. L. Khanim R. Hayden Histone Deacetylases in Acute Myeloid Leukaemia Show a Distinctive Pattern of Expression That Changes Selectively in Response to Deacetylase Inhibitors Leukemia 19 2005 1751 1759 10.1038/sj.leu.2403910 16121216 10 Y. Hida Y. Kubo K. Murao S. Arase Strong Expression of a Longevity‐Related Protein, SIRT1, in Bowen's Disease Archives of Dermatological Research 299 2007 103 106 10.1007/s00403-006-0725-6 17180656 11 H. Huang S. Wang H. Xia Lactate Enhances NMNAT1 Lactylation to Sustain Nuclear NAD(+) Salvage Pathway and Promote Survival of Pancreatic Adenocarcinoma Cells Under Glucose‐Deprived Conditions Cancer Letters 588 2024 216806 10.1016/j.canlet.2024.216806 38467179 12 X. W. Zhang L. Li M. Liao Thermal Proteome Profiling Strategy Identifies CNPY3 as a Cellular Target of Gambogic Acid for Inducing Prostate Cancer Pyroptosis Journal of Medicinal Chemistry 67 2024 10005 10011 10.1021/acs.jmedchem.4c00140 38511243 13 C. Philippe M. Jaud K. Féral Pivotal Role of the Endoplasmic Reticulum Stress‐Related XBP1s/miR‐22/SIRT1 Axis in Acute Myeloid Leukemia Apoptosis and Response to Chemotherapy Leukemia 38 2024 1764 1776 10.1038/s41375-024-02321-8 38909090 PMC11286524 14 I. M. M. van Leeuwen M. Higgins J. Campbell Correction: Modulation of p53 C‐Terminal Acetylation by Mdm2, p14 ARF Molecular Cancer Therapeutics 22 2023 1503 10.1158/1535-7163.Mct-23-0759 38037420 15 Q. J. Wu T. N. Zhang H. H. Chen The Sirtuin Family in Health and Disease Signal Transduction and Targeted Therapy 7 2022 402 10.1038/s41392-022-01257-8 36581622 PMC9797940 16 C. Feng W. Mao C. Yuan P. Dong Y. Liu Nicotine‐Induced CHRNA5 Activation Modulates CES1 Expression, Impacting Head and Neck Squamous Cell Carcinoma Recurrence and Metastasis via MEK/ERK Pathway Cell Death & Disease 15 2024 785 10.1038/s41419-024-07178-4 39472448 PMC11522702 17 M. C. Motta N. Divecha M. Lemieux Mammalian SIRT1 Represses Forkhead Transcription Factors Cell 116 2004 551 563 10.1016/s0092-8674(04)00126-6 14980222 18 Y. Ma H. Nie H. Chen NAD + + Current Medicinal Chemistry 22 2015 1239 1247 10.2174/0929867322666150209154420 25666794 19 L. Kriegl M. Vieth T. Kirchner A. Menssen Up‐Regulation of c‐MYC and SIRT1 Expression Correlates With Malignant Transformation in the Serrated Route to Colorectal Cancer Oncotarget 3 2012 1182 1193 10.18632/oncotarget.628 23045412 PMC3717960 20 J. Wang Y. Liu Q. Zhang Disitamab Vedotin, a HER2‐Directed Antibody‐Drug Conjugate, in Patients With HER2‐Overexpression and HER2‐Low Advanced Breast Cancer: A Phase I/Ib Study Cancer Communications 44 2024 833 851 10.1002/cac2.12577 38940019 PMC11260767 21 Y. Chen K. Jia X. Chong Implications of PD‐L1 Expression on the Immune Microenvironment in HER2‐Positive Gastric Cancer Molecular Cancer 23 2024 169 10.1186/s12943-024-02085-w 39164705 PMC11334343 22 T. W. Wang E. Chern C. W. Hsu K. C. Tseng H. M. Chao SIRT1‐Mediated Expression of CD24 and Epigenetic Suppression of Novel Tumor Suppressor miR‐1185‐1 Increases Colorectal Cancer Stemness Cancer Research 80 2020 5257 5269 10.1158/0008-5472.Can-19-3188 33046442 23 J. Boyer S. Sedik M. Egger Performance of the Clarus Aspergillus Galactomannan Enzyme Immunoassay Prototype for the Diagnosis of Invasive Pulmonary Aspergillosis in Serum Mycoses 67 2024 e13756 10.1111/myc.13756 38886163 24 Y. Yao L. Liu G. Guo Y. Zeng J. S. Ji Interaction of Sirtuin 1 (SIRT1) Candidate Longevity Gene and Particulate Matter (PM2.5) on All‐Cause Mortality: A Longitudinal Cohort Study in China Environmental Health 20 2021 25 10.1186/s12940-021-00718-x 33715628 PMC7958462 25 X. Yao G. Zhao H. Yang X. Hong L. Bie G. Liu Overexpression of High‐Mobility Group Box 1 Correlates With Tumor Progression and Poor Prognosis in Human Colorectal Carcinoma Journal of Cancer Research and Clinical Oncology 136 2010 677 684 10.1007/s00432-009-0706-1 19898867 PMC11917171 26 Y. Huang M. Shao X. Teng Inhibition of CD38 Enzymatic Activity Enhances CAR‐T Cell Immune‐Therapeutic Efficacy by Repressing Glycolytic Metabolism Cell Reports Medicine 5 2024 101400 10.1016/j.xcrm.2024.101400 38307031 PMC10897548 27 E. C. Smyth M. Nilsson H. I. Grabsch N. C. van Grieken F. Lordick Gastric Cancer Lancet 396 2020 635 648 10.1016/s0140-6736(20)31288-5 32861308 28 Q. L. Ou Y. L. Chang J. H. Liu Mapping the Intellectual Structure and Landscape of Colorectal Cancer Immunotherapy: A Bibliometric Analysis Human Vaccines & Immunotherapeutics 20 2024 2323861 10.1080/21645515.2024.2323861 38497584 PMC10950274 29 Y. Jiang Y. Wang G. Chen Nicotinamide Metabolism Face‐Off Between Macrophages and Fibroblasts Manipulates the Microenvironment in Gastric Cancer Cell Metabolism 36 2024 1806 1822.e11 10.1016/j.cmet.2024.05.013 38897198 30 B. L. Huang L. F. Wei Y. W. Lin Serum IGFBP‐1 as a Promising Diagnostic and Prognostic Biomarker for Colorectal Cancer Scientific Reports 14 2024 1839 10.1038/s41598-024-52220-2 38246959 PMC10800337 ",
  "metadata": {
    "Title of this paper": "Serum IGFBP‐1 as a Promising Diagnostic and Prognostic Biomarker for Colorectal Cancer",
    "Journal it was published in:": "Cancer Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477621/"
  }
}