{
  "title": "Paper_1036",
  "abstract": "pmc Metabolites Metabolites 2273 metabolites metabolites Metabolites 2218-1989 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472015 PMC12472015.1 12472015 12472015 41002979 10.3390/metabo15090595 metabolites-15-00595 1 Review Fatty Acid Profile and Desaturase Activity in Obesity: Roles, Mechanisms, and Clinical Relevance https://orcid.org/0000-0003-2771-0769 Banaszak Michalina 1 2 * https://orcid.org/0000-0002-9652-0785 Górna Ilona 1 https://orcid.org/0000-0001-8291-5439 Drzymała-Czyż Sławomira 1 Sztolsztener Klaudia Academic Editor Supruniuk Elzbieta Academic Editor 1 igorna@ump.edu.pl drzymala@ump.edu.pl 2 * michalina.banaszak@student.ump.edu.pl 08 9 2025 9 2025 15 9 497655 595 31 7 2025 03 9 2025 05 9 2025 08 09 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background: Obesity is a complex metabolic disease associated with several health complications, including insulin resistance, hypertension, and type 2 diabetes mellitus. Growing evidence indicates that fatty acid profiles and the activity of desaturating enzymes—stearoyl-CoA desaturase-1 (SCD1), delta-5 desaturase (D5D), and delta-6 desaturase (D6D)—are important factors in the pathophysiology of obesity. This review aims to summarise the current understanding of the alterations in lipid metabolism and desaturase activity in obesity, its complications, and potential therapeutic interventions. Methods: A literature review was performed using the PubMed, Scopus, and Web of Science databases. Systematic reviews, meta-analyses, clinical studies, cross-sectional studies, and animal studies that assessed fatty acid profiles and desaturase activity in the context of obesity were included. Results: Obesity is associated with significant changes in the profiles of saturated fatty acids (SFAs), monounsaturated fatty acids (MUFAs), and polyunsaturated fatty acids (PUFAs), as well as altered desaturase activity. Increased activity of SCD1 and D6D and decreased activity of D5D are observed even in childhood and correlate with metabolic risk markers. Genetic variation in genes encoding fatty acid desaturases, such as fatty acid desaturase 1 ( FADS1) FADS2) SCD1 excess body weight lipid profile MUFA PUFA SCD1 D5D D6D a large research grant from the statutory subsidy for young scientists—doctoral students of the PUMS doctoral school for the year 2024–2026 NMN0000113 This research was funded by a large research grant from the statutory subsidy for young scientists—doctoral students of the PUMS doctoral school for the year 2024–2026 (No. NMN0000113). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Obesity is a chronic metabolic disease characterised by excessive fat accumulation, which leads to numerous health complications and metabolic disorders. Currently, it is considered one of the most serious public health challenges. It is defined as a body mass index (BMI) greater than or equal to 30 kg/m 2 1 2 3 4 5 Fatty acids (FAs) are monocarboxylic acids belonging to lipids. They can be bound to other compounds and form, among others, triglycerides, phospholipids, or steroids, or exist in free form—free fatty acids (FFAs) [ 6 7 Table 1 Saturated fatty acids (SFAs) and monounsaturated fatty acids (MUFAs) are synthesised by living organisms. However, mammals, including humans, cannot naturally synthesise polyunsaturated fatty acids (PUFAs); therefore, they must be supplied externally. These acids are called essential fatty acids (EFAs) and include linoleic acid (LA; C18:2, n-6), α-linolenic acid (ALA; C18:3, n-3), arachidonic acid (AA; C20:4, n-6), eicosapentaenoic acid (EPA; C20:5, n-3), and docosahexaenoic acid (DHA; C22:6, n-3) [ 8 9 10 Figure 1 Desaturases are membrane enzymes belonging to the class of oxidoreductases that catalyse the introduction of a double bond into the carbon chain of FA, playing a key role in lipid metabolism [ 7 Figure 2 11 12 13 14 15 16 17 Many factors, including genes, diet, obesity, gender, and other environmental aspects, influence the FA profile and desaturase activity. Genetic variability and polymorphisms in the FADS1 FADS2 18 FADS1 19 20 21 FADS 22 FADS1 23 24 25 26 27 28 In obese individuals, FA desaturase activity is significantly altered compared to lean individuals, which translates into an unfavourable lipid profile and an increased risk of metabolic disorders [ 29 30 31 17 32 The aim of this literature review is to present the current state of knowledge on the role of desaturases in the regulation of FA metabolism and their participation in the pathophysiology of obesity. This study compiles and interprets data on the expression of desaturase genes; enzymatic activity; and changes in the profile of SFA, MUFA, and PUFA in the context of the development and course of obesity and its metabolic complications. Additionally, the potential importance of desaturase as a biomarker or therapeutic target in preventing and treating obesity is discussed. 2. Materials and Methods This narrative review is based on a search of major databases: PubMed, Scopus, and Web of Science. Systematic reviews, meta-analyses, clinical studies, cross-sectional studies, experimental studies in animal models, and in vitro studies that addressed fatty acid profiles and desaturase activity in the context of obesity were included. The literature search focused on studies that provided data on molecular mechanisms, genetic determinants, dietary interventions, and associations with metabolic disorders [ 33 3. Fatty Acid Profile and Desaturase Activity in Obesity More and more studies indicate that lipid metabolism is disrupted in early childhood, which may have serious health consequences in the future. Obese children have higher levels of SFA, some MUFA, n-6 PUFA, and lower levels of n-3 PUFA, particularly DHA [ 29 34 35 36 34 37 38 39 40 However, long-term studies (measured at ages 1, 5, 10, and 16 years) in children found no association between overall PUFA levels and changes in BMI adjusted for age and gender (BMIZ) over time. However, individual FAs demonstrated varying effects on body composition: ALA, docosapentaenoic acid (DPA), GLA, and D6D activity were positively correlated with total and trunk fat mass. The results indicate that EPA and D5D may have a protective effect, while GLA, DPA, and D6D may increase the risk of excessive fat accumulation and predispose to future abdominal obesity [ 41 37 As in children, adults exhibit increased levels of SFAs (e.g., palmitic acid and stearic acid); MUFAs (e.g., palmitoleic acid and sapienic acid); and n-6 PUFA, especially DGLA, SCD1, and D6D. However, n-3 PUFA, DHA, LA, and D5D levels are decreased [ 29 42 43 44 2 45 FA composition differs between organs and body regions, influencing metabolism. In obese South African women, the FA profile in erythrocytes and subcutaneous adipose tissue (SAT) correlated with insulin sensitivity and the visceral adipose tissue (VAT)/SAT ratio. Erythrocytes contained more saturated FA and less MUFA than SAT, which was associated with lower insulin sensitivity. Abdominal adipose tissue had lower levels of MUFA and SCD1 activity than gluteal adipose tissue. Higher MUFA and lower PUFA levels in SAT promoted better insulin sensitivity [ 46 47 48 49 Overweight individuals have significantly reduced levels of iso-branched FAs (iso-BCFA) compared to normal-weight individuals. Incubation of human visceral adipocytes with 14-methylpentadecanoic acid or 12-methyltetradecanoic acid revealed a reduction in the expression of genes associated with lipid metabolism ( SREBP1c SCD1 ELOVL4 ELOVL6 FADS2 FADS1 50 51 52 4. Molecular Mechanisms and Genetic Variability in Lipid Metabolism Genetic variation, particularly in the FADS1 FADS2 ELOVL2 Table 2 FADS1 FADS2 18 53 54 55 56 Single-nucleotide polymorphisms (SNPs) are particularly important in FADS1 FADS2 53 54 57 58 FADS1 58 FADS2 59 60 To assess the extent of endogenous PUFA synthesis, the FA profile was examined in patients with the FADS1 FADS1 FADS1 55 The concept of metabolically healthy obesity (MHO) is controversial, especially in popular science. This term refers to individuals with excess body weight who do not exhibit metabolic disorders typical of obesity, such as insulin resistance, dyslipidemia, or hypertension. Although MHO is sometimes interpreted as a “healthy” form of obesity, its use can be misleading and potentially harmful, falsely suggesting that obesity does not require treatment or intervention [ 61 62 61 63 64 Studies indicate that individuals with metabolic disorders (MUHO and MUHNO) are characterised by higher SCD1 and D6D activity and higher levels of SFA (e.g., palmitic acid) and n-6 PUFA (e.g., DGLA); lower D5D activity; and lower levels of n-6 and n-3 PUFA, such as LA, DHA, and EPA. The opposite situation is observed in individuals with normal metabolism (MHO and MHNO), who have higher DHA and EPA levels and D6D activity, and reduced SCD1 and D6D activity [ 65 66 67 65 66 67 Animal model experiments have provided interesting data on the function of the SCD1 enzyme in the context of energy metabolism and obesity. In a study in which the SCD1 68 SCD2 69 On the other hand, other studies conducted in the same animal model indicate that complete deletion of SCD1 SCD1 SCD1 SCD1 70 SCD1 71 5. Fatty Acid and Desaturase Activity Profile in Obesity-Associated Disorders and Diseases Obesity is often accompanied by numerous comorbidities, including metabolic syndrome, dyslipidemia, and cardiovascular disease, the development of which may be partially related to disturbances in FA metabolism and the activity of desaturation enzymes ( Table 3 3 29 72 73 74 In metabolic syndrome, increased levels of palmitic, palmitoleic, oleic, and GLA acids and decreased levels of LA are observed. This is accompanied by increased SCD1 and D6D activity and decreased D5D activity, which promotes lipogenesis and insulin resistance [ 67 75 FADS1/FADS2 6 42 Altered activity of lipid desaturases, particularly SCD1, D5D, and D6D, not only correlates with metabolic parameters and body composition but also influences the functioning of other organs and systems, including the adrenal axis, liver, adipose tissue, and tissues affected by inflammatory and neoplastic processes [ 74 75 76 77 78 79 80 81 82 83 84 85 76 FADS2 77 Another organ strongly responsive to lipid abnormalities and desaturase activity is the liver. Obese individuals with nonalcoholic steatohepatitis (NASH) were characterised by higher D6D and SCD1 activity and lower D5D activity compared to individuals with a normal liver. Furthermore, these individuals had increased mRNA expression of hepatic genes ( FADS1, FADS2 SCD 78 79 80 81 Desaturases may also play a role in the pathogenesis of inflammatory and cancer diseases. Gene therapy with FAT-1 82 FAT-1 83 82 83 In turn, excessive SCD1 activity may promote carcinogenesis. The FA profile and SCD1 activity were examined in postmenopausal women taking an antiestrogen (raloxifene) and/or the n-3 preparation Lovaza. After two years, Lovaza was shown to reduce the indices of SCD16 and SCD18. The decrease in SCD1 activity correlated with decreased breast density, but only in obese women (BMI ≥ 30) [ 84 85 metabolites-15-00595-t003_Table 3 Table 3 Summary of alterations in desaturase activity and fatty acid profile in obesity-related diseases. Marker/Fatty Acids Type 2 Diabetes Metabolic Syndrome Dyslipidemia Cardiovascular Disease NAFLD/NASH Cancer/Inflammatory Diseases SCD1 ↑ [ 74 ↑ [ 67 ↑ (assoc. with BMI, lipids) [ 42 ↑ [ 42 76 ↑ [ 78 ↑ (CRC, breast cancer) [ 84 85 D5D ↓ [ 72 73 ↓ [ 67 ↓ [ 75 ↓ [ 42 ↓ [ 78 — D6D ↑ [ 72 73 ↑ [ 67 ↑ [ 75 ↑ [ 42 ↑ [ 78 — ELOVL6 ↑ [ 74 — — — — —  FADS1/FADS2 — — — Gene polymorphisms → impaired PUFA synthesis [ 6 ↑ (hepatic FADS1/2 78 ↑ FADS2 77 SFA ↑ [ 72 ↑ palmitic acid [ 67 ↑ [ 75 ↑ [ 42 ↑ [ 79 80 81 — MUFA ↑ palmitoleic acid, oleic acid [ 67 ↑ [ 67 ↑ [ 75 ↑ palmitoleic acid [ 42 ↑ [ 79 80 81 — PUFA ↑ DGLA [ 72 ↑ GLA, ↓ LA [ 67 ↑ DGLA, ↓ LA [ 75 ↓ EPA, ↓ DHA [ 6 ↓ n-3 PUFA [ 79 80 81 n-6→n-3 protective via FAT-1 [ 82 83 Additional information ApoB mediates D5D benefits [ 73 Promotes insulin resistance [ 67 Worsened by Zn deficiency [ 75 EPA independent of adiposity, linked to ALT [ 42 Fat accumulation, oxidative stress [ 79 80 81 SCD1 inhibition ↓ breast density (Lovaza) [ 84 6. Effect of Dietary Interventions on Fatty Acid Profile and Desaturase Activity HFD significantly affects the FA profile and desaturase activity, contributing to the development of obesity and metabolic disorders. After 4 weeks of the HFD, mice increased the activity of D5D, D6D, and peroxisome proliferator-activated receptor α (PPAR-α) in the liver. Later, this was followed by a decrease in the expression of these enzymes, depletion of n-3 PUFAs, decrease in PPAR-α, impairment in FA oxidation, and development of hepatic steatosis. After 12–16 weeks, a decrease in n-3 PUFAs was also observed in the brain [ 86 87 88 89 90 88 91 92 n 43 In addition to HFD, diets rich in simple sugars can also lead to the development of metabolic disorders. A high-carbohydrate diet leads to increased synthesis of SFAs and MUFAs, mainly through the activation of de novo lipogenesis and desaturases, particularly SCD1 and D6D [ 93 94 95 Drosophila melanogaster 96 97 95 98 An alternative nutritional approach, increasingly being explored in clinical and experimental studies, is low-carbohydrate, high-fat (LCHF) diets, which may be effective in short-term weight loss and improve specific metabolic parameters. However, the type of fat is crucial—long-term, high consumption of SFAs can increase total cholesterol and LDL-C and consequently increase cardiovascular risk [ 99 100 101 Phytochemicals have a beneficial effect on the FA profile and desaturase activity, which may alleviate symptoms of metabolic syndrome and improve metabolic functions. One of these is L-carnitine, which plays an important role in the transport of FAs into mitochondria, where they are converted into energy. Rats receiving an HFD and L-carnitine for 8 weeks demonstrated reduced SCD1 activity, short-chain MUFA storage in tissues, and reduced LA and trans FA content stored in retroperitoneal fat [ 102 103 104 Berberine administration to obese NAFLD patients and ob/ob mice reduced hepatic triglyceride accumulation and decreased the expression of SCD1 and lipogenic genes in vivo and in vitro. Furthermore, it affected the phosphorylation of AMPK and SREBP-1c in HepG2 cells and mouse liver [ 105 C. elegans Firmicutes/Bacteroidetes Desulfobacterota 106 Physical activity is a key element of a healthy lifestyle. Physical exercise can modify FA composition and desaturase activity. Exercise in obese, previously sedentary women reduced DGLA and SCD1 content in erythrocytes while increasing D5D activity compared to controls. These changes correlated with lower leptin, TNFα, and hepatic steatosis [ 107 90 107 108 25 109 7. Effect of Bariatric Surgery on Fatty Acid Profile and Desaturase Activity FADS1/2 2 2 FADS1/2 110 Bariatric surgery significantly affects the FA profile and metabolism in serum and adipose tissue, which may reduce the risk of obesity-related diseases. In 122 patients (age 47.2 ± 8.7 years; baseline weight 128.9 ± 19.3 kg, after 1 year 98.9 ± 18.2 kg), a decrease in SFA and an increase in n-3 and n-6 PUFA in serum triglycerides were observed immediately after surgery, and an additional rise in MUFA levels was followed one year later. Interestingly, post-operative patients were instructed to consume 3 teaspoons of rapeseed oil and 6 teaspoons of rapeseed oil-based spreads daily, and fish 2–3 times a week, for at least 1–2 years after obesity surgery; therefore, the beneficial changes in the lipid profile were synergistic [ 111 111 112 113 4 114 115 116 In contrast, a study by Garla et al. [ 117 FADS1 Surgical treatment of obesity, although effective in weight loss, also carries metabolic consequences that are not always clearly beneficial. Changes in FA metabolism after surgery require further monitoring and adjustments to dietary care. 8. Conclusions Disturbances in FA metabolism and altered desaturase activity play a significant role in the pathophysiology of obesity and its accompanying metabolic disorders. Adverse changes in FA profile are observed already in early childhood, which may predispose to the development of insulin resistance, hypertension, and visceral fat accumulation later in life. Genetic variation may influence lipid metabolism and promote metabolic disorders, partially explaining distinct obesity phenotypes, including so-called metabolically healthy obesity. Lipid profile and desaturase activity may therefore constitute potential biomarkers of metabolic risk and targets for therapeutic interventions. Nutritional interventions—such as modifying n-3 and n-6 PUFA intake, adopting low-carbohydrate or high-fat diets, supplementing with phytochemicals, and bariatric surgery—affect FA profile and enzymatic activity. Individuals with gene polymorphisms such as FADS1 Figure 3 Understanding the interplay between FA profile, desaturase activity, and genetic factors could provide the basis for a more personalised approach to preventing and treating obesity and its complications. The broad spectrum of action of desaturating enzymes makes them the subject of intensive research in chronic noncommunicable diseases such as type 2 diabetes, cardiovascular disease, and cancer. Disclaimer/Publisher’s Note: Author Contributions Conceptualisation, M.B.; methodology, M.B.; writing—original draft preparation, M.B.; writing—review and editing, M.B., I.G. and S.D.-C.; supervision, I.G. and S.D.-C. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement Not applicable. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: AA arachidonic acid. ACOX1 acyl-CoA oxidase 1. ALA alpha-linolenic acid. ALT alanine aminotransferase. AMPK AMP-activated protein kinase. apoB apolipoprotein B. ASBT apical sodium-dependent bile acid transporter. AST aspartate aminotransferase. BCFAs branched-chain fatty acids. BMI body mass index. COX cyclooxygenase. CRC colorectal cancer. CPT1 carnitine palmitoyltransferase 1. CXCL1/KC chemokine CXCL1/KC. D5D delta-5 desaturase. D6D delta-6 desaturase. DHA docosahexaenoic acid. DGAT diacylglycerol acyltransferase. DGLA dihomo-gamma-linolenic acid. DIO2 iodothyronine deiodinase type 2. DPA docosapentaenoic acid. EET epoxyeicosatrienoic acid. EFA essential fatty acid. ELOVL elongase of very long-chain fatty acids. EPA eicosapentaenoic acid. FA fatty acid. FADS1 fatty acid desaturase 1. FADS2 fatty acid desaturase 2. FAS fatty acid synthase. GLA gamma-linolenic acid. GLP-1 glucagon-like peptide-1. HFD high-fat diet. HOMA-IR homeostatic model assessment of insulin resistance. IL-4, -6, -17, -33 interleukins. iKO intestinal knockout. iso-BCFAs iso-branched-chain fatty acids. LA linoleic acid. LDL-C low-density lipoprotein cholesterol. LCHF low-carbohydrate high-fat diet. LOX lipoxygenase. LT leukotriene. MUFAs monounsaturated fatty acids. mTOR mammalian target of rapamycin. NAFLD nonalcoholic fatty liver disease. NASH nonalcoholic steatohepatitis. OA osteoarthritis. PGC-1α peroxisome proliferator-activated receptor gamma coactivator 1-alpha. PG prostaglandin. PPARα, γ peroxisome proliferator-activated receptor alpha, gamma. PUFAs polyunsaturated fatty acids. PVAT perivascular adipose tissue. SCD1 stearoyl-CoA desaturase 1. SCFAs short-chain fatty acids. SDA stearidonic acid. SFAs saturated fatty acids. SI insulin sensitivity. SNP single nucleotide polymorphism. SREBP1c sterol regulatory element-binding protein 1c. THC tetrahydrocurcumin. TNFα tumour necrosis factor alpha. TXA thromboxane. UCP1 uncoupling protein 1. VAT/SAT visceral to subcutaneous adipose tissue ratio. VLCFAs very long-chain fatty acids. References 1. World Health Organization Obesity and Overweight 2024 Available online: https://www.who.int/news-room/fact-sheets/detail/obesity-and-overweight (accessed on 25 July 2025) 2. MedSci K.K.F. Schnecke V. Haase C.L. Harder-Lauridsen N.M. Rathor N. Sommer K. Morgen C.S. Weight Change and Risk of Obesity-Related Complications: A Retrospective Population-Based Cohort Study of a UK Primary Care Database Diabetes Obes. Metab. 2023 25 2669 2679 10.1111/dom.15154 37283064 3. Schetz M. De Jong A. Deane A.M. Druml W. Hemelaar P. Pelosi P. Pickkers P. Reintam-Blaser A. Roberts J. Sakr Y. Obesity in the Critically Ill: A Narrative Review Intensive Care Med. 2019 45 757 769 10.1007/s00134-019-05594-1 30888440 4. Wrzosek M. Zawadzka Z. Sawicka A. Bobrowska-Korczak B. Białek A. Impact of Fatty Acids on Obesity-Associated Diseases and Radical Weight Reduction Obes. Surg. 2021 32 428 440 10.1007/s11695-021-05789-w 34813039 PMC8794933 5. Silva Figueiredo P. Carla Inada A. Marcelino G. Maiara Lopes Cardozo C. de Cássia Freitas K. de Cássia Avellaneda Guimarães R. Pereira de Castro A. Aragão do Nascimento V. Aiko Hiane P. Fatty Acids Consumption: The Role Metabolic Aspects Involved in Obesity and Its Associated Disorders Nutrients 2017 9 1158 10.3390/nu9101158 29065507 PMC5691774 6. Chaaba R. Bouaziz A. Ben Amor A. Mnif W. Hammami M. Mehri S. Fatty Acid Profile and Genetic Variants of Proteins Involved in Fatty Acid Metabolism Could Be Considered as Disease Predictor Diagnostics 2023 13 979 10.3390/diagnostics13050979 36900123 PMC10001328 7. Cerone M. Smith T.K. Desaturases: Structural and Mechanistic Insights into the Biosynthesis of Unsaturated Fatty Acids Iubmb Life 2022 74 1036 1051 10.1002/iub.2671 36017969 PMC9825965 8. Dyall S.C. Balas L. Bazan N.G. Brenna J.T. Chiang N. da Costa Souza F. Dalli J. Durand T. Galano J.-M. Lein P.J. Polyunsaturated Fatty Acids and Fatty Acid-Derived Lipid Mediators: Recent Advances in the Understanding of Their Biosynthesis, Structures, and Functions Prog. Lipid Res. 2022 86 101165 10.1016/j.plipres.2022.101165 35508275 PMC9346631 9. Hayashi S. Satoh Y. Ogasawara Y. Dairi T. Recent Advances in Functional Analysis of Polyunsaturated Fatty Acid Synthases Curr. Opin. Chem. Biol. 2020 59 30 36 10.1016/j.cbpa.2020.04.015 32442859 10. Banaszak M. Dobrzyńska M. Kawka A. Górna I. Woźniak D. Przysławski J. Drzymała-Czyż S. Role of Omega-3 Fatty Acids Eicosapentaenoic (EPA) and Docosahexaenoic (DHA) as Modulatory and Anti-Inflammatory Agents in Noncommunicable Diet-Related Diseases—Reports from the Last 10 Years Clin. Nutr. ESPEN 2024 63 240 258 10.1016/j.clnesp.2024.06.053 38980796 11. Sun Q. Xing X. Wang H. Wan K. Fan R. Liu C. Wang Y. Wu W. Wang Y. Wang R. SCD1 Is the Critical Signaling Hub to Mediate Metabolic Diseases: Mechanism and the Development of Its Inhibitors Biomed. Pharmacother. 2023 170 115586 10.1016/j.biopha.2023.115586 38042113 12. ALJohani A.M. Syed D.N. Ntambi J.M. Insights into Stearoyl-CoA Desaturase-1 Regulation of Systemic Metabolism Trends Endocrinol. Metab. TEM 2017 28 831 842 10.1016/j.tem.2017.10.003 29089222 PMC5701860 13. Sowka A. Balatskyi V.V. Navrulin V.O. Ntambi J.M. Dobrzyn P. Stearoyl-CoA Desaturase 1 Regulates Metabolism and Inflammation in Mouse Perivascular Adipose Tissue in Response to a High-Fat Diet J. Cell. Physiol. 2025 240 e31510 10.1002/jcp.31510 39943782 14. Nakamura M.T. Nara T.Y. Structure, Function, and Dietary Regulation of Delta6, Delta5, and Delta9 Desaturases Annu. Rev. Nutr. 2004 24 345 376 10.1146/annurev.nutr.24.121803.063211 15189125 15. Guillou H. Zadravec D. Martin P.G.P. Jacobsson A. The Key Roles of Elongases and Desaturases in Mammalian Fatty Acid Metabolism: Insights from Transgenic Mice Prog. Lipid Res. 2010 49 186 199 10.1016/j.plipres.2009.12.002 20018209 16. Olga L. van Diepen J.A. Bobeldijk-Pastorova I. Gross G. Prentice P.M. Snowden S.G. Furse S. Kooistra T. Hughes I.A. Schoemaker M.H. Lipid Ratios Representing SCD1, FADS1, and FADS2 Activities as Candidate Biomarkers of Early Growth and Adiposity EBioMedicine 2021 63 103198 10.1016/j.ebiom.2020.103198 33421943 PMC7806876 17. Gromovsky A.D. Schugar R.C. Brown A.L. Helsley R.N. Burrows A.C. Ferguson D. Zhang R. Sansbury B.E. Lee R.G. Morton R.E. The Δ-5 Fatty Acid Desaturase FADS1 Impacts Metabolic Disease by Balancing Pro-Inflammatory and Pro-Resolving Lipid Mediators Arterioscler. Thromb. Vasc. Biol. 2018 38 218 231 10.1161/ATVBAHA.117.309660 29074585 PMC5746431 18. Merino D.M. Johnston H. Clarke S. Roke K. Nielsen D. Badawi A. El-Sohemy A. Ma D.W.L. Mutch D.M. Polymorphisms in FADS1 and FADS2 Alter Desaturase Activity in Young Caucasian and Asian Adults Mol. Genet. Metab. 2011 103 171 178 10.1016/j.ymgme.2011.02.012 21414826 19. Sergeant S. Hugenschmidt C.E. Rudock M.E. Ziegler J.T. Ivester P. Ainsworth H.C. Vaidya D. Case L.D. Langefeld C.D. Freedman B.I. Differences in Arachidonic Acid Levels and Fatty Acid Desaturase (FADS) Gene Variants in African Americans and European Americans with Diabetes or the Metabolic Syndrome Br. J. Nutr. 2012 107 547 555 10.1017/S0007114511003230 21733300 PMC3494092 20. Rifkin S.B. Shrubsole M.J. Cai Q. Smalley W.E. Ness R.M. Swift L.L. Milne G. Zheng W. Murff H.J. Differences in Erythrocyte Phospholipid Membrane Long-Chain Polyunsaturated Fatty Acids and the Prevalence of Fatty Acid Desaturase Genotype among African Americans and European Americans Prostaglandins Leukot. Essent. Fatty Acids 2021 164 102216 10.1016/j.plefa.2020.102216 33310680 21. Mathias R.A. Pani V. Chilton F.H. Genetic Variants in the FADS Gene: Implications for Dietary Recommendations for Fatty Acid Intake Curr. Nutr. Rep. 2014 3 139 148 10.1007/s13668-014-0079-1 24977108 PMC4070521 22. Abdelmagid S.A. Clarke S.E. Roke K. Nielsen D.E. Badawi A. El-Sohemy A. Mutch D.M. Ma D.W. Ethnicity, Sex, FADS Genetic Variation, and Hormonal Contraceptive Use Influence Delta-5- and Delta-6-Desaturase Indices and Plasma Docosahexaenoic Acid Concentration in Young Canadian Adults: A Cross-Sectional Study Nutr. Metab. 2015 12 14 10.1186/s12986-015-0010-9 PMC4410003 25914723 23. Blomquist S. Coletta D. Mandarino L.J. Hallmark B. Yang C. Rich S. Manichaikul A.W. Chilton F. Fatty Acid Desaturase Gene-Induced Omega-3 Deficiency in Amerindian-Ancestry Hispanic Populations FASEB J. 2020 34 1 10.1096/fasebj.2020.34.s1.06389 24. Vessby B. Gustafsson I.-B. Tengblad S. Berglund L. Indices of Fatty Acid Desaturase Activity in Healthy Human Subjects: Effects of Different Types of Dietary Fat Br. J. Nutr. 2013 110 871 879 10.1017/S0007114512005934 23414551 25. Warensjö E. Ohrvall M. Vessby B. Fatty Acid Composition and Estimated Desaturase Activities Are Associated with Obesity and Lifestyle Variables in Men and Women Nutr. Metab. Cardiovasc. Dis. NMCD 2006 16 128 136 10.1016/j.numecd.2005.06.001 16487913 26. Liu Y. Xia Y.-Y. Zhang T. Yang Y. Cannon R.D. Mansell T. Novakovic B. Saffery R. Han T.-L. Zhang H. Complex Interactions Between Circulating Fatty Acid Levels, Desaturase Activities, and the Risk of Gestational Diabetes Mellitus: A Prospective Cohort Study Front. Nutr. 2022 9 919357 10.3389/fnut.2022.919357 35898714 PMC9313599 27. Diffenderfer M.R. Rajapakse N. Pham E. He L. Dansinger M.L. Nelson J.R. Schaefer E.J. Plasma Fatty Acid Profiles: Relationships with Sex, Age, and State-Reported Heart Disease Mortality Rates in the United States J. Clin. Lipidol. 2022 16 184 197 10.1016/j.jacl.2021.12.005 35120898 28. Pararasa C. Ikwuobe J. Shigdar S. Boukouvalas A. Nabney I.T. Brown J.E. Devitt A. Bailey C.J. Bennett S.J. Griffiths H.R. Age-Associated Changes in Long-Chain Fatty Acid Profile during Healthy Aging Promote pro-Inflammatory Monocyte Polarization via PPARγ Aging Cell 2016 15 128 139 10.1111/acel.12416 26522807 PMC4717269 29. Fekete K. Györei E. Lohner S. Verduci E. Agostoni C. Decsi T. Long-Chain Polyunsaturated Fatty Acid Status in Obesity: A Systematic Review and Meta-Analysis Obes. Rev. Off. J. Int. Assoc. Study Obes. 2015 16 488 497 10.1111/obr.12280 25828602 30. Warensjö E. Risérus U. Gustafsson I.-B. Mohsen R. Cederholm T. Vessby B. Effects of Saturated and Unsaturated Fatty Acids on Estimated Desaturase Activities during a Controlled Dietary Intervention Nutr. Metab. Cardiovasc. Dis. 2008 18 683 690 10.1016/j.numecd.2007.11.002 18367385 31. Liew C.F. Groves C.J. Wiltshire S. Zeggini E. Frayling T.M. Owen K.R. Walker M. Hitman G.A. Levy J.C. O’rahilly S. Analysis of the Contribution to Type 2 Diabetes Susceptibility of Sequence Variation in the Gene Encoding Stearoyl-CoA Desaturase, a Key Regulator of Lipid and Carbohydrate Metabolism Diabetologia 2004 47 2168 2175 10.1007/s00125-004-1575-4 15662557 32. Mayneris-Perxachs J. Guerendiain M. Castellote A.I. Estruch R. Covas M.I. Fitó M. Salas-Salvadó J. Martínez-González M.A. Aros F. Lamuela-Raventós R.M. Plasma Fatty Acid Composition, Estimated Desaturase Activities, and Their Relation with the Metabolic Syndrome in a Population at High Risk of Cardiovascular Disease Clin. Nutr. 2014 33 90 97 10.1016/j.clnu.2013.03.001 23591154 33. Nowak J.K. Walkowiak J. Study Designs in Medical Research and Their Key Characteristics J. Med. Sci. 2023 92 e928 10.20883/medical.e928 34. Oleynik O.A. Samoilova I. Matveeva M.V. Podchinenova D.A. Shuliko L. Features of Fatty Acid Indices in the Assessment of Metabolic Disorders in Obese Adolescents Meditsinskiy Sov. Med. Counc. 2024 19 236 244 10.21518/ms2024-355 35. Bonafini S. Giontella A. Tagetti A. Bresadola I. Gaudino R. Cavarzere P. Ramaroli D.A. Branz L. Marcon D. Pietrobelli A. Fatty Acid Profile and Desaturase Activities in 7-10-Year-Old Children Attending Primary School in Verona South District: Association between Palmitoleic Acid, SCD-16, Indices of Adiposity, and Blood Pressure Int. J. Mol. Sci. 2020 21 3899 10.3390/ijms21113899 32486144 PMC7312303 36. Saito E. Okada T. Abe Y. Kuromori Y. Miyashita M. Iwata F. Hara M. Ayusawa M. Mugishima H. Kitamura Y. Docosahexaenoic Acid Content in Plasma Phospholipids and Desaturase Indices in Obese Children J. Atheroscler. Thromb. 2011 18 345 350 10.5551/jat.6270 21307609 37. Jauregibeitia I. Portune K.J. Rica I. Tueros I. Velasco O. Grau G. Trebolazabala N. Castaño L. Larocca A.V. Ferreri C. Fatty Acid Profile of Mature Red Blood Cell Membranes and Dietary Intake as a New Approach to Characterize Children with Overweight and Obesity Nutrients 2020 12 3446 10.3390/nu12113446 33182783 PMC7696547 38. Aristizabal J.C. González-Zapata L.I. Estrada-Restrepo A. Monsalve-Alvarez J. Restrepo-Mesa S.L. Gaitán D. Concentrations of Plasma Free Palmitoleic and Dihomo-Gamma Linoleic Fatty Acids Are Higher in Children with Abdominal Obesity Nutrients 2018 10 31 10.3390/nu10010031 29301242 PMC5793259 39. Hua M.-C. Su H.-M. Lai M.-W. Yao T.-C. Tsai M.-H. Liao S.-L. Lai S.-H. Huang J.-L. Palmitoleic and Dihomo-γ-Linolenic Acids Are Positively Associated With Abdominal Obesity and Increased Metabolic Risk in Children Front. Pediatr. 2021 9 628496 10.3389/fped.2021.628496 33898358 PMC8062925 40. Wolters M. Schlenz H. Börnhorst C. Risé P. Galli C. Moreno L.A. Pala V. Siani A. Veidebaum T. Tornaritis M. Desaturase Activity Is Associated With Weight Status and Metabolic Risk Markers in Young Children J. Clin. Endocrinol. Metab. 2015 100 3760 3769 10.1210/jc.2015-2693 26284759 41. Flannagan K. Gahagan S. Das A. Burrows R. Lozoff B. Villamor E. Serum Polyunsaturated Fatty Acids in Infancy Are Associated with Body Composition in Adolescence Pediatr. Obes. 2020 15 e12656 10.1111/ijpo.12656 32426929 42. Šarac I. Debeljak-Martačić J. Takić M. Stevanović V. Milešević J. Zeković M. Popović T. Jovanović J. Vidović N.K. Associations of Fatty Acids Composition and Estimated Desaturase Activities in Erythrocyte Phospholipids with Biochemical and Clinical Indicators of Cardiometabolic Risk in Non-Diabetic Serbian Women: The Role of Level of Adiposity Front. Nutr. 2023 10 1065578 10.3389/fnut.2023.1065578 37545582 PMC10397414 43. Alsharari Z.D. Risérus U. Leander K. Sjögren P. Carlsson A.C. Vikström M. Laguzzi F. Gigante B. Cederholm T. De Faire U. Serum Fatty Acids, Desaturase Activities and Abdominal Obesity—A Population-Based Study of 60-Year Old Men and Women PLoS ONE 2017 12 e0170684 10.1371/journal.pone.0170684 28125662 PMC5270324 44. Sansone A. Tolika E. Louka M. Sunda V. Deplano S. Melchiorre M. Anagnostopoulos D. Chatgilialoglu C. Formisano C. Di Micco R. Hexadecenoic Fatty Acid Isomers in Human Blood Lipids and Their Relevance for the Interpretation of Lipidomic Profiles PLoS ONE 2016 11 e0152378 10.1371/journal.pone.0152378 27045677 PMC4821613 45. Kang M. Lee A. Yoo H.J. Kim M. Kim M. Shin D.Y. Lee J.H. Association between Increased Visceral Fat Area and Alterations in Plasma Fatty Acid Profile in Overweight Subjects: A Cross-Sectional Study Lipids Health Dis. 2017 16 248 10.1186/s12944-017-0642-z 29258511 PMC5735636 46. Nankam P.A.N. van Jaarsveld P.J. Chorell E. Smidt M.C.F. Adams K. Blüher M. Olsson T. Mendham A.E. Goedecke J.H. Circulating and Adipose Tissue Fatty Acid Composition in Black South African Women with Obesity: A Cross-Sectional Study Nutrients 2020 12 1619 10.3390/nu12061619 32486525 PMC7352715 47. Garaulet M. Pérez-Llamas F. Pérez-Ayala M. Martínez P. de Medina F.S. Tebar F.J. Zamora S. Site-Specific Differences in the Fatty Acid Composition of Abdominal Adipose Tissue in an Obese Population from a Mediterranean Area: Relation with Dietary Fatty Acids, Plasma Lipid Profile, Serum Insulin, and Central Obesity Am. J. Clin. Nutr. 2001 74 585 591 10.1093/ajcn/74.5.585 11684525 48. Garaulet M. Hernández-Morante J.J. Luján J. Tebar F.J. Zamora S. Relationship between Fat Cell Size and Number and Fatty Acid Composition in Adipose Tissue from Different Fat Depots in Overweight/Obese Humans Int. J. Obes. 2006 30 899 905 10.1038/sj.ijo.0803219 16446749 49. Garaulet M. Hernandez-Morante J.J. Tebar F.J. Zamora S. Relation between Degree of Obesity and Site-Specific Adipose Tissue Fatty Acid Composition in a Mediterranean Population Nutr. Burbank Los Angel. Cty. Calif 2011 27 170 176 10.1016/j.nut.2010.01.004 20541362 50. Czumaj A. Śledziński T. Mika A. Branched-Chain Fatty Acids Alter the Expression of Genes Responsible for Lipid Synthesis and Inflammation in Human Adipose Cells Nutrients 2022 14 2310 10.3390/nu14112310 35684110 PMC9183013 51. Mika A. Stepnowski P. Kaska L. Proczko M. Wisniewski P. Sledzinski M. Sledzinski T. A Comprehensive Study of Serum Odd- and Branched-Chain Fatty Acids in Patients with Excess Weight Obes. Silver Spring Md. 2016 24 1669 1676 10.1002/oby.21560 27355152 52. Gozdzik P. Czumaj A. Śledziński T. Mika A. Branched-Chain Fatty Acids Affect the Expression of Fatty Acid Synthase and C-Reactive Protein Genes in the Hepatocyte Cell Line Biosci. Rep. 2023 43 BSR20230114 10.1042/BSR20230114 37850622 PMC10619197 53. Khamlaoui W. Mehri S. Hammami S. Hammouda S. Chraeif I. Elosua R. Hammami M. Association Between Genetic Variants in FADS1-FADS2 and ELOVL2 and Obesity, Lipid Traits, and Fatty Acids in Tunisian Population Clin. Appl. Thromb. Off. J. Int. Acad. Clin. Appl. Thromb. 2020 26 1076029620915286 10.1177/1076029620915286 PMC7427023 32584610 54. Muzsik A. Bajerska J. Jeleń H.H. Gaca A. Chmurzynska A. Associations between Fatty Acid Intake and Status, Desaturase Activities, and FADS Gene Polymorphism in Centrally Obese Postmenopausal Polish Women Nutrients 2018 10 1068 10.3390/nu10081068 30103441 PMC6115977 55. Reyes-Pérez S.D. González-Becerra K. Barrón-Cabrera E. Muñoz-Valle J.F. Armendáriz-Borunda J. Martínez-López E. FADS1 Genetic Variant and Omega-3 Supplementation Are Associated with Changes in Fatty Acid Composition in Red Blood Cells of Subjects with Obesity Nutrients 2024 16 3522 10.3390/nu16203522 39458515 PMC11509948 56. Metelcová T. Vaňková M. Zamrazilová H. Hovhannisyan M. Staňková B. Tvrzická E. Hill M. Hainer V. Včelák J. Kunešová M. FADS1 Gene Polymorphism(s) and Fatty Acid Composition of Serum Lipids in Adolescents Lipids 2021 56 499 508 10.1002/lipd.12317 34189740 57. Marklund M. Morris A.P. Mahajan A. Ingelsson E. Lindgren C.M. Lind L. Risérus U. Genome-Wide Association Studies of Estimated Fatty Acid Desaturase Activity in Serum and Adipose Tissue in Elderly Individuals: Associations with Insulin Sensitivity Nutrients 2018 10 1791 10.3390/nu10111791 30453627 PMC6266021 58. Jarullah H.H. Saleh E.S. Influence of Fatty Acid Desaturase Enzyme-1 Gene (FADS-1) Polymorphism on Serum Polyunsaturated Fatty Acids Levels, Desaturase Enzymes, Lipid Profile, and Glycemic Control Parameters in Newly Diagnosed Diabetic Mellitus Patients Int. J. Mol. Sci. 2025 26 4015 10.3390/ijms26094015 40362254 PMC12071304 59. Khodarahmi M. Javidzade P. Farhangi M.A. Hashemzehi A. Kahroba H. Interplay between Fatty Acid Desaturase2 (FADS2) Rs174583 Genetic Variant and Dietary Antioxidant Capacity: Cardio-Metabolic Risk Factors in Obese Individuals BMC Endocr. Disord. 2022 22 167 10.1186/s12902-022-01075-7 35773659 PMC9245241 60. Khodarahmi M. Nikniaz L. Abbasalizad Farhangi M. The Interaction Between Fatty Acid Desaturase-2 (FADS2) Rs174583 Genetic Variant and Dietary Quality Indices (DASH and MDS) Constructs Different Metabolic Phenotypes Among Obese Individuals Front. Nutr. 2021 8 669207 10.3389/fnut.2021.669207 34164423 PMC8215104 61. Blüher M. Metabolically Healthy Obesity Endocr. Rev. 2020 41 bnaa004 10.1210/endrev/bnaa004 32128581 PMC7098708 62. Schulze M.B. Stefan N. Metabolically Healthy Obesity: From Epidemiology and Mechanisms to Clinical Implications Nat. Rev. Endocrinol. 2024 20 633 646 10.1038/s41574-024-01008-5 38937638 63. Mongraw-Chaffin M. Foster M.C. Anderson C.A.M. Burke G.L. Haq N. Kalyani R.R. Ouyang P. Sibley C.T. Tracy R. Woodward M. Metabolically Healthy Obesity, Transition to Metabolic Syndrome, and Cardiovascular Risk J. Am. Coll. Cardiol. 2018 71 1857 1865 10.1016/j.jacc.2018.02.055 29699611 PMC6002856 64. Magkos F. Metabolically healthy obesity: What’s in a name? Am. J. Clin. Nutr. 2019 110 533 539 10.1093/ajcn/nqz133 31240297 65. Arsic A. Takic M. Kojadinovic M. Petrovic S. Paunovic M. Vucic V. Ristic Medic D. Metabolically Healthy Obesity: Is There a Link with Polyunsaturated Fatty Acid Intake and Status? Can. J. Physiol. Pharmacol. 2021 99 64 71 10.1139/cjpp-2020-0317 32822561 66. Svendsen K. Olsen T. Nordstrand Rusvik T.C. Ulven S.M. Holven K.B. Retterstøl K. Telle-Hansen V.H. Fatty Acid Profile and Estimated Desaturase Activities in Whole Blood Are Associated with Metabolic Health Lipids Health Dis. 2020 19 102 10.1186/s12944-020-01282-y 32438926 PMC7243306 67. Zhu Y. Vogelpohl F.A. Heiner-Fokkema M.R. Pranger I.G. Minović I. Navis G.J. Bakker S.J.L. Riphagen I.J. Plasma Phospholipid Fatty Acid Profile, Estimated Desaturase Activities and Prevalence of the Metabolic Syndrome in a General Population Cohort: A Cross-Sectional Study Nutr. Healthy Aging 2022 7 135 146 10.3233/NHA-220155 68. Burchat N. Vidola J. Pfreundschuh S. Sharma P. Rizzolo D. Guo G.L. Sampath H. Intestinal Stearoyl-CoA Desaturase-1 Regulates Energy Balance via Alterations in Bile Acid Homeostasis Cell. Mol. Gastroenterol. Hepatol. 2024 18 101403 10.1016/j.jcmgh.2024.101403 39278403 PMC11546130 69. O’Neill L.M. Phang Y.X. Matango M. Shamsuzzaman S. Guo C.-A. Nelson D.W. Yen C.-L.E. Ntambi J.M. Global Deficiency of Stearoyl-CoA Desaturase-2 Protects against Diet-Induced Adiposity Biochem. Biophys. Res. Commun. 2020 527 589 595 10.1016/j.bbrc.2020.04.077 32423819 PMC7310674 70. Flowers M.T. Ade L. Strable M.S. Ntambi J.M. Combined Deletion of SCD1 from Adipose Tissue and Liver Does Not Protect Mice from Obesity J. Lipid Res. 2012 53 1646 1653 10.1194/jlr.M027508 22669918 PMC3540837 71. Ntambi J.-N. Kalyesubula M. Cootway D. Lewis S.A. Phang Y.X. Liu Z. O’Neill L.M. Lefers L. Huff H. Miller J.R. Hepatic Stearoyl-CoA Desaturase-1 Deficiency Induces Fibrosis and Hepatocellular Carcinoma-Related Gene Activation under a High Carbohydrate Low Fat Diet Biochim. Biophys. Acta Mol. Cell Biol. Lipids 2024 1869 159538 10.1016/j.bbalip.2024.159538 39067685 PMC11323073 72. Saito M. Higa M. Suzuki T. Michishita M. Hijikata M. Yamashita K. Ikehara K. Ichijo T. 1983-P: Dihomo-Gamma-Linolenic Acid and Estimated Delta-5-Desaturase Activity Are Associated with Obesity and Metabolic Components in Type 2 Diabetic Patients Diabetes 2020 69 1983-P 10.2337/db20-1983-P 73. Lamantia V. Bissonnette S. Provost V. Devaux M. Cyr Y. Daneault C. Rosiers C.D. Faraj M. The Association of Polyunsaturated Fatty Acid δ-5-Desaturase Activity with Risk Factors for Type 2 Diabetes Is Dependent on Plasma ApoB-Lipoproteins in Overweight and Obese Adults J. Nutr. 2019 149 57 67 10.1093/jn/nxy238 30535058 PMC6351138 74. Yew Tan C. Virtue S. Murfitt S. Roberts L.D. Phua Y.H. Dale M. Griffin J.L. Tinahones F. Scherer P.E. Vidal-Puig A. Adipose Tissue Fatty Acid Chain Length and Mono-Unsaturation Increases with Obesity and Insulin Resistance Sci. Rep. 2015 5 18366 10.1038/srep18366 26679101 PMC4683622 75. Knez M. Pantovic A. Zekovic M. Pavlovic Z. Glibetic M. Zec M. Is There a Link between Zinc Intake and Status with Plasma Fatty Acid Profile and Desaturase Activities in Dyslipidemic Subjects? Nutrients 2019 12 93 10.3390/nu12010093 31905662 PMC7019783 76. Infante M. Armani A. Mammi C. Fabbri A. Caprio M. Impact of Adrenal Steroids on Regulation of Adipose Tissue Compr. Physiol. 2017 7 1425 1447 10.1002/j.2040-4603.2017.tb00777.x 28915330 77. Witt A. Mateska I. Palladini A. Sinha A. Wölk M. Harauma A. Bechmann N. Pamporaki C. Dahl A. Rothe M. Fatty Acid Desaturase 2 Determines the Lipidomic Landscape and Steroidogenic Function of the Adrenal Gland Sci. Adv. 2023 9 eadf6710 10.1126/sciadv.adf6710 37478183 PMC10361602 78. Walle P. Takkunen M. Männistö V. Vaittinen M. Lankinen M. Kärjä V. Käkelä P. Ågren J. Tiainen M. Schwab U. Fatty Acid Metabolism Is Altered in Non-Alcoholic Steatohepatitis Independent of Obesity Metabolism. 2016 65 655 666 10.1016/j.metabol.2016.01.011 27085774 79. Araya J. Rodrigo R. Pettinelli P. Araya A.V. Poniachik J. Videla L.A. Decreased Liver Fatty Acid Delta-6 and Delta-5 Desaturase Activity in Obese Patients Obes. Silver Spring Md. 2010 18 1460 1463 10.1038/oby.2009.379 19875987 80. López-Vicario C. González-Périz A. Rius B. Morán-Salvador E. García-Alonso V. Lozano J.J. Bataller R. Cofán M. Kang J.X. Arroyo V. Molecular Interplay between Δ5/Δ6 Desaturases and Long-Chain Fatty Acids in the Pathogenesis of Non-Alcoholic Steatohepatitis Gut 2014 63 344 355 10.1136/gutjnl-2012-303179 23492103 81. Chen J. Lu R.S. Diaz-Canestro C. Song E. Jia X. Liu Y. Wang C. Cheung C.K.Y. Panagiotou G. Xu A. Distinct Changes in Serum Metabolites and Lipid Species in the Onset and Progression of NAFLD in Obese Chinese Comput. Struct. Biotechnol. J. 2024 23 791 800 10.1016/j.csbj.2024.01.007 38318437 PMC10839226 82. Tang R. Harasymowicz N.S. Wu C.-L. Choi Y.-R. Lenz K. Oswald S.J. Guilak F. Gene Therapy for Fat-1 Prevents Obesity-Induced Metabolic Dysfunction, Cellular Senescence, and Osteoarthritis Proc. Natl. Acad. Sci. USA 2024 121 e2402954121 10.1073/pnas.2402954121 39401356 PMC11513907 83. Lu Y. Nie D. Witt W.T. Chen Q. Shen M. Xie H. Lai L. Dai Y. Zhang J. Expression of the Fat-1 Gene Diminishes Prostate Cancer Growth in Vivo through Enhancing Apoptosis and Inhibiting GSK-3 Beta Phosphorylation Mol. Cancer Ther. 2008 7 3203 3211 10.1158/1535-7163.MCT-08-0494 18852124 84. Manni A. Richie J.P. Schetter S.E. Calcagnotto A. Trushin N. Aliaga C. El-Bayoumy K. Stearoyl-CoA Desaturase-1, a Novel Target of Omega-3 Fatty Acids for Reducing Breast Cancer Risk in Obese Postmenopausal Women Eur. J. Clin. Nutr. 2017 71 762 765 10.1038/ejcn.2016.273 28145413 85. Scazzocchio B. Varì R. Silenzi A. Giammarioli S. Masotti A. Baldassarre A. Santangelo C. D’Archivio M. Giovannini C. Del Cornò M. Dietary Habits Affect Fatty Acid Composition of Visceral Adipose Tissue in Subjects with Colorectal Cancer or Obesity Eur. J. Nutr. 2020 59 1463 1472 10.1007/s00394-019-02003-7 31119400 86. Zúñiga-Hernández J. Farias C. Espinosa A. Mercado L. Dagnino-Subiabre A. Campo A.D. Illesca P. Videla L.A. Valenzuela R. Modulation of Δ5- and Δ6-Desaturases in the Brain-Liver Axis Nutrition 2025 131 112629 10.1016/j.nut.2024.112629 39642695 87. Liu T.-W. Heden T.D. Matthew Morris E. Fritsche K.L. Vieira-Potter V.J. Thyfault J.P. High-Fat Diet Alters Serum Fatty Acid Profiles in Obesity Prone Rats: Implications for In Vitro Studies Lipids 2015 50 997 1008 10.1007/s11745-015-4061-5 26318121 PMC4575265 88. Shen T. Oh Y. Jeong S. Cho S. Fiehn O. Youn J.H. High-Fat Feeding Alters Circulating Triglyceride Composition: Roles of FFA Desaturation and ω-3 Fatty Acid Availability Int. J. Mol. Sci. 2024 25 8810 10.3390/ijms25168810 39201497 PMC11354557 89. Mercado-López L. Muñoz Y. Farias C. Beyer M.P. Carrasco-Gutiérrez R. Caicedo-Paz A.V. Dagnino-Subiabre A. Espinosa A. Valenzuela R. High-Fat Diet in Perinatal Period Promotes Liver Steatosis and Low Desaturation Capacity of Polyunsaturated Fatty Acids in Dams: A Link with Anxiety-Like Behavior in Rats Nutrients 2025 17 1180 10.3390/nu17071180 40218938 PMC11990584 90. Rocha-Rodrigues S. Rodríguez A. Gonçalves I.O. Moreira A. Maciel E. Santos S. Domingues M.R. Frühbeck G. Ascensão A. Magalhães J. Impact of Physical Exercise on Visceral Adipose Tissue Fatty Acid Profile and Inflammation in Response to a High-Fat Diet Regimen Int. J. Biochem. Cell Biol. 2017 87 114 124 10.1016/j.biocel.2017.04.008 28438715 91. Valenzuela R. Echeverria F. Ortiz M. Rincón-Cervera M.Á. Espinosa A. Hernandez-Rodas M.C. Illesca P. Valenzuela A. Videla L.A. Hydroxytyrosol Prevents Reduction in Liver Activity of Δ-5 and Δ-6 Desaturases, Oxidative Stress, and Depletion in Long Chain Polyunsaturated Fatty Acid Content in Different Tissues of High-Fat Diet Fed Mice Lipids Health Dis. 2017 16 64 10.1186/s12944-017-0450-5 28395666 PMC5387240 92. Oh Y. Shen T. Jeong S. Cho S. Fiehn O. Youn J. 516-P: High-Fat Feeding Alters Circulating Triglyceride Profile by Decreasing SCD Activity and Depleting n-3 Fatty Acids Diabetes 2024 73 516-P 10.2337/db24-516-P 93. Vitale M. Masulli M. Rivellese A.A. Bonora E. Cappellini F. Nicolucci A. Squatrito S. Antenucci D. Barrea A. Bianchi C. Dietary Intake and Major Food Sources of Polyphenols in People with Type 2 Diabetes: The TOSCA.IT Study Eur. J. Nutr. 2018 57 679 688 10.1007/s00394-016-1355-1 28004268 94. Drąg J. Goździalska A. Knapik-Czajka M. Gawędzka A. Gawlik K. Jaśkiewicz J. Effect of High Carbohydrate Diet on Elongase and Desaturase Activity and Accompanying Gene Expression in Rat’s Liver Genes Nutr. 2017 12 2 10.1186/s12263-017-0551-9 28138346 PMC5264288 95. da Silva-Santi L.G. Antunes M.M. Caparroz-Assef S.M. Carbonera F. Masi L.N. Curi R. Visentainer J.V. Bazotte R.B. Liver Fatty Acid Composition and Inflammation in Mice Fed with High-Carbohydrate Diet or High-Fat Diet Nutrients 2016 8 682 10.3390/nu8110682 27801862 PMC5133070 96. Tuthill Ii B.F. Quaglia C.J. O’Hara E. Musselman L.P. Loss of Stearoyl-CoA Desaturase 1 Leads to Cardiac Dysfunction and Lipotoxicity J. Exp. Biol. 2021 224 jeb240432 10.1242/jeb.240432 34423827 PMC8502255 97. Bajahzer M.F. Bruun J.M. Rosqvist F. Marklund M. Richelsen B. Risérus U. Effects of Sugar-Sweetened Soda on Plasma Saturated and Monounsaturated Fatty Acids in Individuals with Obesity: A Randomized Study Front. Nutr. 2022 9 936828 10.3389/fnut.2022.936828 36118751 PMC9470948 98. Antunes M.M. Godoy G. de Almeida-Souza C.B. da Rocha B.A. da Silva-Santi L.G. Masi L.N. Carbonera F. Visentainer J.V. Curi R. Bazotte R.B. A High-Carbohydrate Diet Induces Greater Inflammation than a High-Fat Diet in Mouse Skeletal Muscle Braz. J. Med. Biol. Res. Rev. Bras. Pesqui. Medicas E Biol. 2020 53 e9039 10.1590/1414-431x20199039 PMC7025447 32077465 99. Chawla S. Tessarolo Silva F. Amaral Medeiros S. Mekary R.A. Radenkovic D. The Effect of Low-Fat and Low-Carbohydrate Diets on Weight Loss and Lipid Levels: A Systematic Review and Meta-Analysis Nutrients 2020 12 3774 10.3390/nu12123774 33317019 PMC7763365 100. Kim B.-Y. Effects of Low-Carbohydrate, High-Fat Diets on Weight Loss, Cardiovascular Health and Mortality Cardiovasc. Prev. Pharmacother. 2020 2 43 49 10.36011/cpp.2020.2.e7 101. Santamarina A.B. Moreira R.G. Mennitti L.V. Martins Ferreira Y.A. Jucá A. Prado C.M. Pisani L.P. Low-Carbohydrate Diet Enriched with Omega-3 and Omega-9 Fatty Acids Modulates Inflammation and Lipid Metabolism in the Liver and White Adipose Tissue of a Mouse Model of Obesity Nutr. Metab. Cardiovasc. Dis. NMCD 2025 35 103932 10.1016/j.numecd.2025.103932 40089393 102. Panchal S.K. Poudyal H. Ward L.C. Waanders J. Brown L. Modulation of Tissue Fatty Acids by L-Carnitine Attenuates Metabolic Syndrome in Diet-Induced Obese Rats Food Funct. 2015 6 2496 2506 10.1039/C5FO00480B 26190559 103. Hamedi-Kalajahi F. Zarezadeh M. Malekahmadi M. Jamilian P. Jamilian P. Molani-Gol R. Ostadrahimi A. The Effect of the L-Carnitine Supplementation on Obesity Indices: An Umbrella Meta-Analysis Int. J. Vitam. Nutr. Res. 2025 95 40033 10.31083/IJVNR40033 40298161 104. Luo L. Fang K. Dan X. Gu M. Crocin Ameliorates Hepatic Steatosis through Activation of AMPK Signaling in Db/Db Mice Lipids Health Dis. 2019 18 11 10.1186/s12944-018-0955-6 30621686 PMC6325828 105. Zhu X. Bian H. Wang L. Sun X. Xu X. Yan H. Xia M. Chang X. Lu Y. Li Y. Berberine Attenuates Nonalcoholic Hepatic Steatosis through the AMPK-SREBP-1c-SCD1 Pathway Free Radic. Biol. Med. 2019 141 192 204 10.1016/j.freeradbiomed.2019.06.019 31226399 106. Zhang S. Chen L. Wang Y. Tetrahydrocurcumin Ameliorates Metabolic Disorders Associated with Obesity by Regulating Gut Microbiota Homeostasis J. Nutr. Biochem. 2025 146 110034 10.1016/j.jnutbio.2025.110034 40683479 107. Nono Nankam P.A. Mendham A.E. van Jaarsveld P.J. Adams K. Fortuin-de Smidt M.C. Clamp L. Blüher M. Goedecke J.H. Exercise Training Alters Red Blood Cell Fatty Acid Desaturase Indices and Adipose Tissue Fatty Acid Profile in African Women with Obesity Obes. Silver Spring Md. 2020 28 1456 1466 10.1002/oby.22862 32627952 108. de Melo D.G. Anaruma C.P. da Cruz Rodrigues K.C. Pereira R.M. de Campos T.D.P. Canciglieri R.S. Ramos C.O. Cintra D.E. Ropelle E.R. da Silva A.S.R. Strength Training Alters the Tissue Fatty Acids Profile and Slightly Improves the Thermogenic Pathway in the Adipose Tissue of Obese Mice Sci. Rep. 2022 12 6913 10.1038/s41598-022-10688-w 35484170 PMC9050661 109. Corpeleijn E. Feskens E.J.M. Jansen E.H.J.M. Mensink M. Saris W.H.M. de Bruin T.W.A. Blaak E.E. Improvements in Glucose Tolerance and Insulin Sensitivity after Lifestyle Intervention Are Related to Changes in Serum Fatty Acid Profile and Desaturase Activities: The SLIM Study Diabetologia 2006 49 2392 2401 10.1007/s00125-006-0383-4 16896932 110. Vaittinen M. Walle P. Kuosmanen E. Männistö V. Käkelä P. Ågren J. Schwab U. Pihlajamäki J. FADS2 Genotype Regulates Delta-6 Desaturase Activity and Inflammation in Human Adipose Tissue J. Lipid Res. 2016 57 56 65 10.1194/jlr.M059113 26609056 PMC4689336 111. Walle P. Takkunen M. Männistö V. Vaittinen M. Käkelä P. Ågren J. Schwab U. Lindström J. Tuomilehto J. Uusitupa M. Alterations in Fatty Acid Metabolism in Response to Obesity Surgery Combined with Dietary Counseling Nutr. Diabetes 2017 7 e285 10.1038/nutd.2017.33 28869586 PMC5637104 112. Middleton A.-L.O. Byrne J.P. Calder P.C. The Influence of Bariatric (Metabolic) Surgery on Blood Polyunsaturated Fatty Acids: A Systematic Review Clin. Nutr. ESPEN 2022 48 121 140 10.1016/j.clnesp.2022.02.001 35331483 113. Manca C. Pintus S. Murru E. Fantola G. Vincis M. Batetta B. Moroni E. Carta G. Banni S. Fatty Acid Metabolism and Derived-Mediators Distinctive of PPAR-α Activation in Obese Subjects Post Bariatric Surgery Nutrients 2021 13 4340 10.3390/nu13124340 34959892 PMC8705357 114. Hierons S.J. Abbas K. Sobczak A.I.S. Cerone M. Smith T.K. Ajjan R.A. Stewart A.J. Changes in Plasma Free Fatty Acids in Obese Patients before and after Bariatric Surgery Highlight Alterations in Lipid Metabolism Sci. Rep. 2022 12 15337 10.1038/s41598-022-19657-9 36097032 PMC9468139 115. Berk K.A. Borgeraas H. Narverud I. Mulder M.T. Øyri L.K.L. Verhoeven A.J.M. Småstuen M.C. Bogsrud M.P. Omland T. Hertel J.K. Differential Effects of Bariatric Surgery and Lifestyle Interventions on Plasma Levels of Lp(a) and Fatty Acids Lipids Health Dis. 2022 21 145 10.1186/s12944-022-01756-1 36577984 PMC9795629 116. Kunešová M. Sedláčková B. Bradnová O. Tvrzická E. Staňková B. Šrámková P. DoleŽalová K. Kalousková P. Hlavatý P. Hill M. Fatty Acid Composition of Adipose Tissue Triglycerides in Obese Diabetic Women after Bariatric Surgery: A 2-Year Follow Up Physiol. Res. 2015 64 S155 S166 10.33549/physiolres.933132 26680476 117. Garla P. Sala P. Torrinhas R.S.M. Machado N.M. Fonseca D.C. da Silva M.M. Ravacci G.R. Belarmino G. Ishida R.K. Guarda I.F.M.S. Reduced Intestinal FADS1 Gene Expression and Plasma Omega-3 Fatty Acids Following Roux-En-Y Gastric Bypass Clin. Nutr. Edinb. Scotl. 2019 38 1280 1288 10.1016/j.clnu.2018.05.011 30459098 Figure 1 Scheme of PUFA biosynthesis. COX—cyclooxygenase, CYP—cytochrome P450, EET—epoxyeicosatrienoic acid, ELOVL—elongase of very long fatty acids, LOX—lipoxygenase, LT—leukotriene, n-3—omega-3 fatty acids, n-6—omega-6 fatty acids, n-7—omega-7 fatty acids, n-9—omega-9 fatty acids, PG—prostaglandin, SCD1—stearoyl-CoA desaturase-1, SFA—saturated fatty acids, TXA—thromboxane. Figure 2 The pathway of electron transfer in the desaturation of fatty acids by stearoyl-CoA desaturase 1 (SCD1). Figure 3 Fatty acid and desaturase profile in obesity with or without intervention. D5D—delta-5 desaturase, D6D—delta-6 desaturase, FADS2—fatty acid desaturase 2, iso-BCFA—iso-branched-chain fatty acids, MUFAs—monounsaturated fatty acids, PUFAs—polyunsaturated fatty acids, SCD1—stearoyl-coa desaturase 1, SCFAs—short-chain fatty acids, SFAs—saturated fatty acids, trans FAs—trans fatty acids. metabolites-15-00595-t001_Table 1 Table 1 Types of fatty acids. Classification Fatty Acid Type Characteristics/Examples Number of Double Bonds Saturated (SFA) No double bonds. Monounsaturated (MUFA) One double bond. Polyunsaturated (PUFA) Two or more double bonds. Carbon Chain Length Short (SCFA) ≤6 carbon atoms. Medium (MCFA) 6–12 carbon atoms. Long (LCFA) 13–21 carbon atoms. Very long (VLCFA) ≥22 carbon atoms. Double Bond Configuration  Cis The natural configuration of most unsaturated fatty acids.  Trans Rare in nature (formed, among other things, during the hydrogenation of fats). metabolites-15-00595-t002_Table 2 Table 2 Summary of genomic, transcriptomic, and proteomic markers related to lipid metabolism and their consequences. Level Marker/Gene/Enzyme Polymorphism or Change Observed Effect on Lipid Metabolism Potential Genomic  FADS1 rs174546, rs174537, rs174547 ↓ D5D activity; ↑ risk of insulin resistance, T2D, dyslipidemia  FADS2 rs174583 ↓ EPA, stearic acid; altered elongase activity Interaction with diet modifies cardiometabolic risk  ELOVL2 Variants not specified Altered elongation of PUFA Changes in n-3 and n-6 PUFA composition Transcriptomic  SCD1 Overexpression in obesity ↑ MUFA synthesis (palmitoleic acid) Lipogenesis, insulin resistance, obesity SCD1 Gene deletion in mice ↑ bile acids, ↑ TGR5 pathway activity ↑ energy expenditure, ↓ weight gain  SCD2 Gene deletion in mice ↑ thermogenesis Protection against diet-induced obesity Proteomic Δ6-desaturase (D6D) Activity increased in obesity ↑ GLA, DGLA Inflammation, higher cardiometabolic risk Δ5-desaturase (D5D) Activity decreased in obesity ↓ AA, Dyslipidemia, impaired insulin sensitivity Elongase Activity increased in obesity ↑ long-chain PUFA synthesis Altered FA profile linked to BMI and IR Clinical outcome FA profile (erythrocytes, plasma) ↑ n-6:n-3 ratio, Biomarker of metabolic health status Predicts MUHO vs. MHO phenotype ",
  "metadata": {
    "Title of this paper": "Reduced Intestinal FADS1 Gene Expression and Plasma Omega-3 Fatty Acids Following Roux-En-Y Gastric Bypass",
    "Journal it was published in:": "Metabolites",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472015/"
  }
}