{
  "title": "Paper_721",
  "abstract": "pmc Redox Biol Redox Biol 2171 redox Redox Biology 2213-2317 Elsevier PMC12478066 PMC12478066.1 12478066 12478066 40972158 10.1016/j.redox.2025.103856 S2213-2317(25)00369-6 103856 1 Research Paper Oxidatively damaged DNA in DNA repair-deficient and ethanol-exposed fetal brains induces gene dysregulation and mitochondrial dysfunction associated with neurodevelopmental disorders Cheng Ashley P. a b Dhavarasa Piriththiv d van Heeswyk Jana a Richards Sophia M. a b Li Xuan a Shapiro Aaron M. e f Wells Peter G. pg.wells@utoronto.ca a b c ⁎ a b c d e f ⁎ pg.wells@utoronto.ca 11 2025 02 9 2025 87 497696 103856 18 8 2025 1 9 2025 02 09 2025 30 09 2025 01 10 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Oxidatively damaged DNA caused by reactive oxygen species (ROS) in the fetal brain contributes to neurodevelopmental disorders (NDDs), but the mechanism is unclear. We investigated the impact of this DNA damage on the developing fetal brain using a DNA repair-deficient oxoguanine glycosylase 1 ( Ogg1 Ogg1 Ogg1 Graphical abstract Image 1 Highlights • Ogg1 • One prenatal ethanol (EtOH) exposure increased the above OGG1-dependent effects. • Altered mitochondrial bioenergetics in neurons were OGG1-and EtOH-dependent. • OGG1-and EtOH-dependent DEGs reflected postnatal disorders in learning and memory. • OGG1 effects imply epigenetic roles of DNA damage in neurodevelopmental disorders. Keywords Alcohol (ethanol, EtOH) Neurodevelopmental disorders DNA damage and repair Fetal alcohol spectrum disorders (FASD) Gene dysregulation Knockout (KO) mouse model Oxoguanine glycosylase 1 (OGG1) Reactive oxygen species (ROS) pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Abbreviations EtOH ethanol FASD fetal alcohol spectrum disorders KO knockout NOX NADPH oxidase OGG1 oxoguanine glycosylase 1 PBN phenylbutylnitrone ROS reactive oxygen species +/+ wild-type i.p. intraperitoneal 1 Introduction Oxidative DNA damage by reactive oxygen species (ROS) in the fetal brain has been linked to several neurodevelopmental disorders (NDDs), but the underlying mechanisms remain unclear [ 1 2 2 3 4 5 6 7 8 9 10 11 Enhanced levels of ROS are associated with neurodegenerative disorders later in life, such as Alzheimer's [ 12 13 14 15 16 17 18 19 4 20 in utero 21 22 [23] [24] [25] Oxidative damage to DNA, as distinct from damage to proteins and lipids, can initiate developmental disorders [ [26] [27] [28] [29] [30] [31] 4 [32] [33] [34] [35] [36] [37] 38 39 40 [3] [4] [5] [6] In utero 3 41 42 43 44 45 46 47 47 48 49 50 19 48 50 It is unclear how oxidatively damaged DNA causes NDDs, but the well-known mutational role of 8-oxoGua in carcinogenesis is an unlikely mechanism. Rather, emerging evidence has demonstrated that 8-oxoGua, and its recruitment of OGG1, play a role in gene expression by functioning as an epigenetic marker [ 51 52 Ogg1 48 53 Ogg1 54 51 [55] [56] [57] The goal of this study was to investigate the molecular mechanisms by which oxidatively damaged DNA contributes to NDDs. In the fetal brain, we modeled enhanced oxidatively damaged DNA by using a DNA repair-deficient Ogg1 Fig. 1 Ogg1 Fig. 2 Fig. 1 Prenatal EtOH dose optimization and oxidatively damaged DNA in the fetal brain in Ogg1 B ROS EtOH Ogg1 (C) Ogg1 WT GD (D) 8-oxoGua Ogg1- (E) DSBs Ogg1 Ogg1 Ogg1 Sal F Ogg1 Fig. 1 Fig. 2 Ogg1 Ogg1 (A) NDDs Ogg1 DEGs B Ogg1 C Ogg1 (D) Ogg1 E GO Ogg1 snoRNA Fig. 2 2 Materials and Methods 2.1 Animals and diet Heterozygous (+/-) Ogg1 39 Ogg1 Ogg1 Ogg1 Ogg1 Ogg1 Ogg1 Ogg1 2.2 Ogg1 Ear notches and fetal tail samples were used to identify the Ogg1 2.3 Treatment paradigm To obtain the prenatal saline- and EtOH-exposed fetal brain samples, Ogg1 Ogg1 Ogg1 48 An EtOH dose of 4 g/kg or 2 doses of 2.5 g/kg (4 h apart) were administered intraperitoneally (i.p.) to pregnant dams on gestational day ( GD via 19 26 58 59 60 59 Fig. 1 Fig. 1 2.4 Blood EtOH concentration measurement Ogg1 https://www.agilent.com/cs/library/applications/5991-7217EN.pdf 2.5 Histology Histological analyses were carried out to investigate gross morphological changes from prenatal EtOH exposure in the adult hippocampus. Following the behavioural studies, Ogg1 2.6 Measurement of the ROS-initiated DNA lesion 8-oxoGua by ELISA The formation of 8-oxoGua in whole fetal brain DNA was quantified using ELISA. Fetal brains exposed in utero 61 62 g g 8-Oxo-dGua was detected using an 8-OH-dGua Check ELISA kit (JaICA, KOG-HS10E, Shizuoka, Japan) according to the manufacturer's protocol. A 50 μg aliquot of DNA from each sample was digested into single nucleotides with nuclease P1 (6 U/sample, 1 h at 37 °C), and 15 μL of 200 mM sodium acetate, pH 5.2, was added to each sample to lower the pH. The pH was increased with 15 μL of Tris-HCL buffer (1 M, pH 7.4), and samples were incubated with calf intestinal alkaline phosphatase (6 U/sample, 1 h at 37 °C) to remove the phosphate group. The reactions were filtered and concentrated using Amicon Ultra filter units (YM-10, 10,000 MW cutoff, Millipore, Billerica, MA, USA) for 30 min to 1 h. A total of 6 fetal brains, balanced for sex, were used for each genotype and treatment group, except for the EtOH-exposed Ogg1 2.7 Comet assay DNA strand breaks (single- and double-strand breaks) were detected using single-cell gel electrophoresis (comet assay) with neutral conditions, as previously described [ 63 64 Ogg1 2 2 2.8 RNA extraction and microarray analysis On GD 17, dams were treated i.p. with 4 g/kg EtOH or saline, and whole fetal brains were collected 6 h later and snap frozen in liquid nitrogen. Three female biological replicates from each genotype and treatment from at least 3 different litters were analyzed. RNA isolation is outlined in the online Supplementary Materials. Microarray analysis (RNA labelling, hybridization, staining, scanning and background correction) was carried out by The Centre for Applied Genomics (Toronto, ON) using Affymetrix GeneChip Mouse 2.0 ST arrays. Details for analysis of the raw data are in the online Supplementary Materials. Raw data were analyzed using Transcriptome Analysis Console (Version 4.0.3.1.4, 2022, Thermo Fisher, Waltham, MA) with RMA normalization. Differential expression analysis was performed using Linear Models of Microarray Data (LIMMA) with the Benjamini-Hochberg procedure to control the false discovery rate (FDR) from multiple hypothesis testing. However, for the saline-exposed Ogg1 [65] [66] [67] mus musculus 2.9 Quantitative PCR (qPCR) qPCR was performed using a TaqMan Gene Expression Assay (Thermo Fisher Scientific). Reactions were set up in 20 μL volumes containing 10 μL of TaqMan Universal PCR Master Mix (Thermo Fisher Scientific, 4444557), 1 μL of TaqMan Gene Expression Assay mix (containing the primer and probe specific for the target gene: Acot10 Acot2 Gabra2 Slc18 2.10 Primary cell culture Primary cortical and hippocampal neuronal cell cultures were prepared from GD 17 mouse fetuses. Tissue isolation and cell culture details are outlined in the online Supplementary Materials. 2.11 Mitochondrial stress test Primary cortical and hippocampal cells were collected from GD 17 fetal brains and cultured in a 96-well Seahorse plate (Agilent, 103725-100, Santa Clara, CA) coated with laminin/poly- l 68 p FCCP 2.12 Behavioural testing Pregnant Ogg1 Fig. 1 Fig. 1 69 70 2.13 Puzzle box test The puzzle box test was performed on 8-week-old mice, with at least 3 litters tested for each group. The puzzle box test protocol has been previously described and was used here with minor modifications [ 71 2.14 Fear conditioning test Fear conditioning assessment of naive mice was determined at 10 weeks of age using progeny from at least 3 litters for each group. Mice were tested using a cued and contextual fear conditioning system (Ugo Basile, 46000), and video recordings were analyzed with ANYmaze software (V7.1, Stoelting Co.). The fear conditioning protocol is shown in Fig. 7 72 73 2.15 Passive avoidance test The passive avoidance test was performed on 9-week-old mice from at least 3 different litters. The apparatus was a rectangular box with a light chamber and a red cellophane chamber that appears dark to the mouse. The chambers were separated by a manual guillotine door. The apparatus floor was comprised of metal rods to deliver a foot shock. Testing details are outlined in the online Supplementary Materials. Data for days 1 and 2 for females and males are shown in Suppl. Fig. 3 2.16 Statistical analysis Statistical analysis was performed using GraphPad Prism 10 (Version 10.2.3, GraphPad Software Inc. San Diego, CA). The data are represented as the mean ± SD (standard deviation), as indicated in the figures. The sample numbers (n) are indicated in each figure and/or their legend. Data were analyzed using 2-way ANOVA with multiple comparisons assessed by post-hoc Tukey's tests, unless otherwise specified. Differences in means were considered statistically significant at p < 0.05. Significance levels are as follows: ∗p < 0.05, ∗∗p < 0.01, ∗∗∗p < 0.001, ∗∗∗∗p < 0.0001. 3 Results 3.1 Overview of EtOH dosing regimens for biochemical and behavioural studies A 4 g/kg dose of EtOH was administered intraperitoneally (i.p.) to pregnant dams on gestational day (GD) 17 (see the Methods and Materials for details and rationale). For biochemical studies, EtOH was administered primarily as a single 4 g/kg dose, which reproduces NDDs similar to human FASD in several mouse models [ 26 58 For the behavioural studies of NDDs, due to unexpected cannibalization of pups by some dams, and based in part upon the results of blood EtOH concentrations shown in Fig. 1 Fig. 1 3.2 Study design and optimization of EtOH exposure in the Ogg1 We studied the impact of ROS during brain development by exposing DNA repair-deficient, Ogg1 Ogg1 Fig. 1 Ogg1 Ogg1 Ogg1 Fig. 1 ± 74 Fig. 1 3.3 Increased oxidatively damaged DNA in Ogg1 8-oxoGua is the most prevalent ROS-initiated lesion, and it is widely used as a biomarker for oxidatively damaged DNA [ 75 Fig. 1 58 Ogg1 Ogg1 Ogg1 Ogg1 Ogg1 The formation of 8-oxoGua lesions can lead to both single and double DNA strand breaks [ 9 76 63 Fig. 1 DSBs Ogg1 Ogg1 Ogg1 Ogg1 Ogg1 Ogg1 Fig. 1 3.4 Gene dysregulation in the fetal brains of female Ogg1 In addition to causing mutations, 8-oxoGua can function as an epigenetic mark in regulatory elements in promoters, thereby regulating gene expression [ 51 Fig. 2 Fig. 2 Acot10 Acot2 Gabra2 Slc18 Suppl. Fig. 1 3.4.1 Physiological ROS levels Based upon the standard FDR correction, there were no statistically significant differences in gene expression in the saline-exposed Ogg1 Brca1 77 Suppl. Table 1 Ogg1 Fig. 2 Fig. 2 Fig. 2 3.4.2 EtOH-enhanced ROS levels Next, we characterized the impact of EtOH-enhanced levels of ROS formation and oxidatively damaged DNA on gene expression in the Ogg1 Ogg1 Fig. 3 Ogg1 Fig. 3 Ogg1 Suppl. Table 2 Ogg1 Fig. 3 78 79 Ogg1 Ogg1 Fig. 3 Ogg1 [78] [79] [80] Fig. 3 Ogg1 Fig. 3 Ogg1 Ogg1 FDR (A) Ogg1 (B) Ogg1 (C) Ogg1 (D) Ogg1 E) Ogg1 Ogg1 Ogg1 (F) GO Ogg1 Ogg1 Ogg1 Fig. 3 3.5 Long-term potentiation gene expression pathway is predominantly, if not exclusively, altered in Ogg1 Our aim here was to distinguish OGG1-dependent mechanisms from EtOH-dependent mechanisms causing altered gene expression. We identified genes that were dysregulated in both Ogg1 Fig. 4 Ogg1 Fig. 4 Ogg1 Suppl. Table 3 Ogg1 Ogg1 Ogg1 Fig. 4 (Arp-1), (Gr), (Pr), (Pit-1) Suppl. Table 3 Ogg1 Ogg1 Fig. 4 Ogg1 Fig. 4 Fig. 4 Ogg1 Ogg1 Suppl. Tables 4–6 Fig. 4 Bioinformatic analysis of Ogg1- and EtOH-dependent effects on gene expression in fetal brains (A) Ogg1 Ogg1 (B) TF Ogg1 Ogg1 (C) Ogg1 (D) Ogg1 (E) Fig. 4 3.6 Comparison of OGG1-dependent dysregulation of genes in fetal brains exposed to saline with brains exposed to EtOH Among the genes apparently dysregulated in saline-exposed Ogg1 Suppl. Table 7 3.7 Impaired mitochondrial metabolism in Ogg1 In addition to nuclear DNA, the 8-oxoGua lesion can accumulate in mitochondrial DNA (mtDNA), resulting in mitochondrial dysfunction [ 81 82 Ogg1 83 84 Ogg1 in vitro in vitro Fig. 5 Fig. 5 Fig. 5 Ogg1 (A) Ogg1 in vitro DIV Ogg1 (B) OCR (C) Ogg1 Ogg1 Ogg1 (D) Ogg1 E - Ogg1 F Ogg1 Ogg1 p Fig. 5 3.8 Mitochondrial dysfunction in saline-exposed Ogg1 Physiological levels of ROS altered mitochondrial metabolism parameters in Ogg1 Ogg1 Fig. 5 Ogg1 Fig. 5 Fig. 5 Suppl. Fig. 2 Ogg1 3.9 Mitochondrial dysfunction in Ogg1 EtOH exposure had a more pronounced impact than saline on the effect of Ogg1 Ogg1 Fig. 5 Ogg1 Ogg1 Fig. 5 Ogg1 Ogg1 Fig. 5 Ogg1 Ogg1 Fig. 5 The maximal respiration capacity was significantly diminished with EtOH exposure in both an OGG1-and EtOH-dependent manner ( Fig. 5 Ogg1 Fig. 5 Ogg1 Ogg1 Fig. 5 Ogg1 Ogg1 Fig. 5 Fig. 5 Fig. 5 Fig. 5 3.10 Sex-dependent effects of OGG1 deficiency and prenatal EtOH exposure on brain function To investigate whether brain function was affected by oxidatively damaged DNA caused by a single prenatal exposure on GD 17 to physiological (saline treatment) or drug-enhanced (EtOH, 2 × 2.5 g/kg, 4 h apart) levels of ROS formation, we compared the performance of Ogg1 4 19 62 3.10.1 Puzzle box test The puzzle box test assesses general cognition and executive function by evaluating the capacity of a mouse to solve progressively more challenging tasks and recall each learned skill after 2 min (short-term) and 24 h (long-term) [ 71 Fig. 6 Ogg1 Suppl. Table 8 Fig. 6 Sex-dependent differences in reduced long-term memory and problem solving following prenatal EtOH exposure in Ogg1 A B C Ogg1 Ogg1 Ogg1 Ogg1 Ogg1 Fig. 6 Problem solving PS Suppl. Table 8 Ogg1 Ogg1 - Fig. 6 Working memory ( ) – Ogg1 Fig. 6 Long-term memory (LTM) (24 h) – Ogg1 Suppl. Table 8 Ogg1 = Ogg1 Ogg1 Fig. 6 Ogg1 Ogg1 Fig. 6 In male progeny, 2-way ANOVA indicated the males had a significant main effect of Ogg1 Ogg1 ( Ogg1 Suppl. Table 8 Ogg1 Ogg1 Fig. 6 3.10.2 Fear conditioning We tested fear memory behaviour using contextual and conditioned stimulus cues, and measured the freezing time upon re-exposure, known as fear conditioning ( Fig. 7 68 Fig. 7 Ogg1 Ogg1 Ogg1 < Ogg1 Ogg1 Ogg1 Ogg1 Fig. 7 Female Ogg1 (A) (B) Ogg1 Ogg1 Fig. 7 3.10.3 Passive avoidance The passive avoidance test is similar to the fear conditioning test, but instead measures an avoidance response after conditioning [ 85 Fig. 8 Suppl. Fig. 3 Ogg1 Ogg1 Ogg1 Ogg1 Ogg1 Ogg1 Fig. 8 Sex-, OGG1- and EtOH-dependent learning and memory disorders in the passive avoidance test Ogg1 Ogg1 Ogg1 Fig. 8 4 Discussion and conclusions 4.1 Overview Although the molecular etiology of NDDs is not well characterized, oxidatively damaged DNA is likely involved in some of these and other developmental disorders [ 1 Ogg1 Ogg1 Ogg1 Ogg1 Ogg1 Ogg1 86 4.2 Epigenetic effects of oxidatively damaged DNA There are increasing reports documenting an epigenetic role of 8-oxoGua [ 48 51 54 57 87 54 Ogg1 53 Among the dysregulated genes, we found miRNA-9 (miR-9) Ogg1 miR-9 88 miR-9 89 Ogg1 Fig. 3 4 Ogg1 Fig. 4 Ogg1 Arp-1, Gr, Pr, and Pit-1 Suppl. Table 3 53 90 91 51 [92] [93] [94] 4.3 Cell fate At the global level, our gene ontology analysis did not reveal significant enrichment for pathways relating to cellular senescence, apoptosis and the determination of cellular fate. It is possible that such OGG1-dependent changes occur, but are restricted to specific brain regions and/or cell types, for which changes are obscured in the whole-brain analysis used in our study. In progeny exposed to EtOH, it also is possible that dysregulation of these pathways occurred outside of the time window surrounding the sampling time 6 h post-EtOH exposure. However, at the gene level, the transcription of apoptotic genes, including Trp53 Mdm2 Ogg1 Comp Mirlet7f-1 Trp53 Ogg1 95 Ogg1 96 4.4 Mitochondrial impact of oxidatively damaged DNA OGG1 protects the nuclear and mitochondrial DNA (mtDNA) from oxidative DNA damage [ 97 81 98 86 99 100 Ogg1 Fig. 5 Suppl. Fig. 2 101 Ogg1 Ogg1 Ogg1 Fig. 5 - 102 Ogg1 Ogg1 103 Mth1/Ogg1 82 4.5 Impact on behavioural disorders Oxidatively damaged DNA in the developing brain, particularly when unrepaired, is a key driver of NDD-like phenotypes, as evidenced herein. We investigated the impact of oxidatively damaged DNA on learning and memory using 3 different behavioural tests of cognition. Our previous work showed that EtOH-initiated DNA oxidation in Ogg1 18 Ogg1 104 Ogg1 105 4 Ogg1 50 in utero Several limitations should be considered when interpreting our findings. First, the microarray analysis tested 3 biological replicates, which is common. However, this small sample size may have limited the generalizability of the results and reduced our statistical power, particularly in the saline exposure group. A larger sample size may reveal more nuanced and significant effects of oxidatively damaged DNA on gene expression, particularly at physiological ROS levels approximated by saline treatment. Furthermore, the transcriptome analysis was conducted using whole fetal brains, which may obscure critical regional differences in gene expression across distinct brain regions. Additionally, to focus on mechanisms of NDD initiation, we analyzed gene expression on GD 17 at one early timepoint, corresponding to the peak of oxidatively damaged DNA 6 h after EtOH exposure, and our results may not reflect dynamic changes at later times. This study focused on the impact of oxidatively damaged DNA on gene expression and mitochondrial dysfunction in the fetal brain, and it would be worth knowing in our model whether cellular outcomes such as apoptosis, autophagy and cellular senescence are involved in OGG1-and EtOH-dependent mechanisms in NDDs. 4.6 Molecular basis of sex differences in NDDs Behavioural testing showed that enhanced oxidatively damaged DNA caused more severely disordered brain function in females than males. The determinants of this sex difference appear to be downstream of oxidatively damaged DNA, as there was no sex difference in DNA damage, at least as measured at the global rather than gene-specific level. This also suggests that upstream pathways of ROS formation and detoxification, and DNA repair, which altogether regulate the levels of oxidatively damaged DNA, cannot explain sex differences observed in some NDDs. 5 Conclusions The molecular mechanisms of NDDs are not well understood, but may involve ROS-initiated DNA damage in the fetal brain. We have shown, at the molecular level, that increases in the oxidative DNA lesions 8-oxoGua and DSBs in the fetal brain due to OGG1 deficiency (prenatal saline exposure in Ogg1 Ogg1 Ogg1 CRediT authorship contribution statement Ashley P. Cheng: Piriththiv Dhavarasa: Jana van Heeswyk: Sophia M. Richards: Xuan Li: Aaron M. Shapiro: Peter G. Wells: Funding This work was supported by grants from the Canadian Institutes of Health Research (PJT-156023) and a New Initiatives & Innovations Award from the University of Toronto Faculty of Pharmacy. APC received a scholarship from the University of Toronto Centre for Pharmaceutical Oncology. Declaration of competing interest None. References 1 Wells P.G. McCallum G.P. Chen C.S. Henderson J.T. Lee C.J. Perstin J. Preston T.J. Wiley M.J. Wong A.W. Oxidative stress in developmental origins of disease: teratogenesis, neurodevelopmental deficits, and cancer Toxicol. Sci. 108 2009 4 18 10.1093/toxsci/kfn263 19126598 2 Dickinson B.C. Chang C.J. Chemistry and biology of reactive oxygen species in signaling or stress responses Nat. Chem. Biol. 7 2011 504 511 10.1038/nchembio.607 21769097 PMC3390228 3 Dong J. Sulik K.K. Chen S.-y. The role of NOX enzymes in ethanol-induced oxidative stress and apoptosis in mouse embryos Toxicol. Lett. 193 2010 94 100 10.1016/j.toxlet.2009.12.012 20026259 PMC2822117 4 Drake D.M. Wells P.G. Novel mechanisms in alcohol neurodevelopmental disorders via BRCA1 depletion and BRCA1-dependent NADPH oxidase regulation Redox Biol. 48 2021 102148 10.1016/j.redox.2021.102148 PMC8577473 34736119 5 Parman T. Wells P.G. Embryonic prostaglandin H synthase-2 (PHS-2) expression and benzo[a]pyrene teratogenicity in PHS-2 knockout mice FASEB J. 16 2002 1001 1009 10.1096/fj.01-0140com 12087061 6 Kubow S. Wells P.G. In vitro bioactivation of phenytoin to a reactive free radical intermediate by prostaglandin synthetase, horseradish peroxidase, and thyroid peroxidase Mol. Pharmacol. 35 1989 504 511 2539558 7 Sokoloff L. Energetics of functional activation in neural tissues Neurochem. Res. 24 1999 321 329 10.1023/a:1022534709672 9972882 8 Abramov J.P. Tran A. Shapiro A.M. Wells P.G. Protective role of endogenous catalase in baseline and phenytoin-enhanced neurodevelopmental and behavioral deficits initiated in utero and in aged mice Reprod. Toxicol. 33 2012 361 373 10.1016/j.reprotox.2012.01.010 22342499 9 Miller L. Shapiro A.M. Wells P.G. Embryonic catalase protects against ethanol-initiated DNA oxidation and teratogenesis in acatalasemic and transgenic human catalase-expressing mice Toxicol. Sci. 134 2013 400 411 10.1093/toxsci/kft122 23733920 10 Winn L.M. Wells P.G. Maternal administration of superoxide dismutase and catalase in phenytoin teratogenicity Free Radic. Biol. Med. 26 1999 266 274 10.1016/S0891-5849(98)00193-2 9895216 11 Floyd R.A. Carney J.M. Free radical damage to protein and DNA: mechanisms involved and relevant observations on brain undergoing oxidative stress Ann. Neurol. 32 Suppl 1992 S22 S27 10.1002/ana.410320706 1510377 12 Zhao Y. Zhao B. Oxidative stress and the pathogenesis of alzheimer's disease Oxid. Med. Cell. Longev. 2013 2013 316523 10.1155/2013/316523 PMC3745981 23983897 13 Blesa J. Trigo-Damas I. Quiroga-Varela A. Jackson-Lewis V.R. Oxidative stress and Parkinson's disease Front. Neuroanat. 9 2015 91 26217195 10.3389/fnana.2015.00091 PMC4495335 14 Jeng W. Loniewska M.M. Wells P.G. Brain glucose-6-phosphate dehydrogenase protects against endogenous oxidative DNA damage and neurodegeneration in aged mice ACS Chem. Neurosci. 4 2013 1123 1132 10.1021/cn400079y 23672460 PMC3715834 15 Loniewska M.M. Gupta A. Bhatia S. MacKay-Clackett I. Jia Z. Wells P.G. DNA damage and synaptic and behavioural disorders in glucose-6-phosphate dehydrogenase-deficient mice Redox Biol. 28 2020 101332 10.1016/j.redox.2019.101332 PMC6812046 31581069 16 Heyer D.B. Meredith R.M. Environmental toxicology: sensitive periods of development and neurodevelopmental disorders Neurotoxicology 58 2017 23 41 10.1016/j.neuro.2016.10.017 27825840 17 Rock K.D. Patisaul H.B. Environmental mechanisms of neurodevelopmental toxicity Curr. Environ. Health Rep. 5 2018 145 157 10.1007/s40572-018-0185-0 29536388 PMC6377563 18 Miller-Pinsler L. Pinto D.J. Wells P.G. Oxidative DNA damage in the in utero initiation of postnatal neurodevelopmental deficits by normal fetal and ethanol-enhanced oxidative stress in oxoguanine glycosylase 1 knockout mice Free Radical Biol. Med. 78 2015 23 29 10.1016/j.freeradbiomed.2014.09.026 25311828 19 Drake D.M. Afsharian K. Or B. Shapiro A.M. Lai M.L. Miller L. Wells P.G. BRCA1 protein dose-dependent risk for embryonic oxidative DNA damage, embryopathies and neurodevelopmental disorders with and without ethanol exposure Redox Biol. 70 2024 103070 10.1016/j.redox.2024.103070 PMC10877410 38359745 20 Brocardo P.S. Gil-Mohapel J. Christie B.R. The role of oxidative stress in fetal alcohol spectrum disorders Brain Res. Rev. 67 2011 209 225 10.1016/j.brainresrev.2011.02.001 21315761 21 Liu X. Lin J. Zhang H. Khan N.U. Zhang J. Tang X. Cao X. Shen L. Oxidative stress in autism spectrum disorder-current progress of mechanisms and biomarkers Front. Psychiatr. 13 2022 813304 10.3389/fpsyt.2022.813304 PMC8921264 35299821 22 Morimoto M. Hashimoto T. Tsuda Y. Nakatsu T. Kitaoka T. Kyotani S. Assessment of oxidative stress in autism spectrum disorder using reactive oxygen metabolites and biological antioxidant potential PLoS One 15 2020 e0233550 10.1371/journal.pone.0233550 PMC7244111 32442231 23 Ceylan M.F. Sener S. Bayraktar A.C. Kavutcu M. Changes in oxidative stress and cellular immunity serum markers in attention-deficit/hyperactivity disorder Psychiatr. Clin. Neurosci. 66 2012 220 226 10.1111/j.1440-1819.2012.02330.x 22443244 24 Selek S. Savas H.A. Gergerlioglu H.S. Bulut M. Yilmaz H.R. Oxidative imbalance in adult attention deficit/hyperactivity disorder Biol. Psychol. 79 2008 256 259 10.1016/j.biopsycho.2008.06.005 18644422 25 Joseph N. Zhang-James Y. Perl A. Faraone S.V. Oxidative stress and ADHD:A meta-analysis J. Atten. Disord. 19 2015 915 924 10.1177/1087054713510354 24232168 PMC5293138 26 Bhatia S. Drake D.M. Miller L. Wells P.G. Oxidative stress and DNA damage in the mechanism of fetal alcohol spectrum disorders Birth defects research 111 2019 714 748 10.1002/bdr2.1509 31033255 27 Oztop D. Altun H. Baskol G. Ozsoy S. Oxidative stress in children with attention deficit hyperactivity disorder Clin. Biochem. 45 2012 745 748 10.1016/j.clinbiochem.2012.03.027 22497926 28 Chovanová Z. Muchová J. Sivonová M. Dvoráková M. Zitnanová I. Waczulíková I. Trebatická J. Skodácek I. Duracková Z. Effect of polyphenolic extract, pycnogenol, on the level of 8-oxoguanine in children suffering from attention deficit/hyperactivity disorder Free Radic. Res. 40 2006 1003 1010 10.1080/10715760600824902 17015282 29 Kurhan F. Alp H.H. Işık M. Atan Y.S. The evaluation of thiol/Disulfide homeostasis and oxidative DNA damage in patients with obsessive compulsive disorder Clin Psychopharmacol Neurosci 20 2022 240 247 10.9758/cpn.2022.20.2.240 35466095 PMC9048000 30 Carmeli E. Imam B. Bachar A. Merrick J. Inflammation and oxidative stress as biomarkers of premature aging in persons with intellectual disability Res. Dev. Disabil. 33 2012 369 375 10.1016/j.ridd.2011.10.002 22119683 31 Zitnanová I. Korytár P. Aruoma O.I. Sustrová M. Garaiová I. Muchová J. Kalnovicová T. Pueschel S. Duracková Z. Uric acid and allantoin levels in Down syndrome: antioxidant and oxidative stress mechanisms? Clin. Chim. Acta 341 2004 139 146 10.1016/j.cccn.2003.11.020 14967170 32 Wong A.W. McCallum G.P. Jeng W. Wells P.G. Oxoguanine glycosylase 1 protects against methamphetamine-enhanced fetal brain oxidative DNA damage and neurodevelopmental deficits J. Neurosci. 28 2008 9047 9054 10.1523/jneurosci.2557-08.2008 18768699 PMC6670872 33 Nicol C.J. Harrison M.L. Laposa R.R. Gimelshtein I.L. Wells P.G. A teratologic suppressor role for p53 in benzo[a]pyrene-treated transgenic p53-deficient mice Nat. Genet. 10 1995 181 187 10.1038/ng0695-181 7663513 34 Laposa R.R. Henderson J.T. Xu E. Wells P.G. Atm-null mice exhibit enhanced radiation-induced birth defects and a hybrid form of embryonic programmed cell death indicating a teratological suppressor function for ATM Faseb j 18 2004 896 898 10.1096/fj.03-0903fje 15033931 35 Bhuller Y. Wells P.G. A developmental role for ataxia-telangiectasia mutated in protecting the embryo from spontaneous and phenytoin-enhanced embryopathies in culture Toxicol. Sci. 93 2006 156 163 10.1093/toxsci/kfl045 16790486 36 Chen C.S. Squire J.A. Wells P.G. Reduced tumorigenesis in p53 knockout mice exposed in utero to low-dose vitamin E Cancer 115 2009 1563 1575 10.1002/cncr.24130 19195043 37 McCallum G.P. Wong A.W. Wells P.G. Cockayne syndrome B protects against methamphetamine-enhanced oxidative DNA damage in murine fetal brain and postnatal neurodevelopmental deficits Antioxidants Redox Signal. 14 2011 747 756 10.1089/ars.2009.2946 PMC3116650 20673160 38 Valavanidis A. Vlachogianni T. Fiotakis C. 8-hydroxy-2′ -deoxyguanosine (8-OHdG): a critical biomarker of oxidative stress and carcinogenesis Journal of Environmental Science and Health, Part C 27 2009 120 139 10.1080/10590500902885684 19412858 39 Klungland A. Rosewell I. Hollenbach S. Larsen E. Daly G. Epe B. Seeberg E. Lindahl T. Barnes D.E. Accumulation of premutagenic DNA lesions in mice defective in removal of oxidative base damage Proc. Natl. Acad. Sci. U. S. A. 96 1999 13300 13305 10.1073/pnas.96.23.13300 10557315 PMC23942 40 Ramsay R.R. Electron carriers and energy conservation in mitochondrial respiration ChemTexts 5 2019 9 41 Hill A.J. Drever N. Yin H. Tamayo E. Saade G. Bytautiene E. The role of NADPH oxidase in a mouse model of fetal alcohol syndrome Am. J. Obstet. Gynecol. 210 2014 466.e461 466.e465 10.1016/j.ajog.2013.12.019 PMC4011987 24334207 42 Wells P.G. Bhatia S. Drake D.M. Miller-Pinsler L. Fetal oxidative stress mechanisms of neurodevelopmental deficits and exacerbation by ethanol and methamphetamine Birth Defects Res C Embryo Today 108 2016 108 130 10.1002/bdrc.21134 27345013 43 David-Cordonnier M.H. Boiteux S. O'Neill P. Excision of 8-oxoguanine within clustered damage by the yeast OGG1 protein Nucleic Acids Res. 29 2001 1107 1113 10.1093/nar/29.5.1107 11222760 PMC29723 44 Fouquerel E. Barnes R.P. Uttam S. Watkins S.C. Bruchez M.P. Opresko P.L. Targeted and persistent 8-oxoguanine base damage at telomeres promotes telomere loss and crisis Mol. Cell 75 2019 117 130.e116 10.1016/j.molcel.2019.04.024 31101499 PMC6625854 45 Shackelford R.E. Kaufmann W.K. Paules R.S. Oxidative stress and cell cycle checkpoint function Free Radic. Biol. Med. 28 2000 1387 1404 10.1016/S0891-5849(00)00224-0 10924858 46 Tsuruya K. Furuichi M. Tominaga Y. Shinozaki M. Tokumoto M. Yoshimitsu T. Fukuda K. Kanai H. Hirakata H. Iida M. Nakabeppu Y. Accumulation of 8-oxoguanine in the cellular DNA and the alteration of the OGG1 expression during ischemia-reperfusion injury in the rat kidney DNA Repair 2 2003 211 229 10.1016/s1568-7864(02)00214-8 12531391 47 Niu Y. DesMarais T.L. Tong Z. Yao Y. Costa M. Oxidative stress alters global histone modification and DNA methylation Free Radic. Biol. Med. 82 2015 22 28 10.1016/j.freeradbiomed.2015.01.028 25656994 PMC4464695 48 Bhatia S. Bodenstein D. Cheng A.P. Wells P.G. Altered epigenetic marks and gene expression in fetal brain, and postnatal behavioural disorders, following prenatal exposure of Ogg1 knockout mice to saline or ethanol Cells 12 2023 2308 10.3390/cells12182308 37759530 PMC10527575 49 Lee C.J. Gonçalves L.L. Wells P.G. Resistance of CD-1 and Ogg1 DNA repair-deficient mice to thalidomide and hydrolysis product embryopathies in embryo culture Toxicol. Sci. 122 2011 146 156 10.1093/toxsci/kfr084 21505090 50 Miller-Pinsler L. Wells P.G. Deficient DNA repair exacerbates ethanol-initiated DNA oxidation and embryopathies in ogg1 knockout mice: gender risk and protection by a free radical spin trapping agent Arch. Toxicol. 90 2016 415 425 10.1007/s00204-014-1397-1 25354798 51 Hahm J.Y. Park J. Jang E.-S. Chi S.W. 8-Oxoguanine: from oxidative damage to epigenetic and epitranscriptional modification Exp. Mol. Med. 54 2022 1626 1642 10.1038/s12276-022-00822-z 36266447 PMC9636213 52 Gorini F. Scala G. Cooke M.S. Majello B. Amente S. Towards a comprehensive view of 8-oxo-7,8-dihydro-2'-deoxyguanosine: highlighting the intertwined roles of DNA damage and epigenetics in genomic instability DNA Repair 97 2021 103027 10.1016/j.dnarep.2020.103027 PMC7926032 33285475 53 Bjørge M.D. Hildrestrand G.A. Scheffler K. Suganthan R. Rolseth V. Kuśnierczyk A. Rowe A.D. Vågbø C.B. Vetlesen S. Eide L. Synergistic actions of Ogg1 and mutyh DNA glycosylases modulate anxiety-like behavior in mice Cell Rep. 13 2015 2671 2678 10.1016/j.celrep.2015.12.001 26711335 54 Pan L. Hao W. Xue Y. Wang K. Zheng X. Luo J. Ba X. Xiang Y. Qin X. Bergwik J. Tanner L. Egesten A. Brasier A.R. Boldogh I. 8-Oxoguanine targeted by 8-oxoguanine DNA glycosylase 1 (OGG1) is central to fibrogenic gene activation upon lung injury Nucleic Acids Res. 51 2023 1087 1102 10.1093/nar/gkac1241 36651270 PMC9943661 55 Pan L. Zhu B. Hao W. Zeng X. Vlahopoulos S.A. Hazra T.K. Hegde M.L. Radak Z. Bacsi A. Brasier A.R. Ba X. Boldogh I. Oxidized guanine base lesions function in 8-oxoguanine DNA glycosylase-1-mediated epigenetic regulation of nuclear factor κB-driven gene expression J. Biol. Chem. 291 2016 25553 25566 10.1074/jbc.M116.751453 27756845 PMC5207254 56 Pan L. Hao W. Zheng X. Zeng X. Ahmed Abbasi A. Boldogh I. Ba X. OGG1-DNA interactions facilitate NF-κB binding to DNA targets Sci. Rep. 7 2017 43297 10.1038/srep43297 PMC5339705 28266569 57 Ba X. Bacsi A. Luo J. Aguilera-Aguirre L. Zeng X. Radak Z. Brasier A.R. Boldogh I. 8-oxoguanine DNA glycosylase-1 augments proinflammatory gene expression by facilitating the recruitment of site-specific transcription factors J. Immunol. 192 2014 2384 2394 10.4049/jimmunol.1302472 24489103 PMC3943862 58 Afsharian K. Trinh V. Wells P.G. Oxidative DNA damage in fetal brains of Brca1 knockout mice following in utero ethanol exposure (Abstract) Birth Defects Research 114 9 2022 419 (No. P458) 59 Denny C.H. Acero C.S. Naimi T.S. Kim S.Y. Consumption of alcohol beverages and binge drinking among pregnant women aged 18-44 years - united States, 2015-2017 MMWR Morb. Mortal. Wkly. Rep. 68 2019 365 368 10.15585/mmwr.mm6816a1 31022164 PMC6483284 60 Pruett S. Tan W. Howell G.E. 3rd Nanduri B. Dosage scaling of alcohol in binge exposure models in mice: an empirical assessment of the relationship between dose, alcohol exposure, and peak blood concentrations in humans and mice Alcohol 89 2020 9 17 10.1016/j.alcohol.2020.03.011 32259574 PMC8221372 61 Ravanat J.L. Douki T. Duez P. Gremaud E. Herbert K. Hofer T. Lasserre L. Saint-Pierre C. Favier A. Cadet J. Cellular background level of 8-oxo-7,8-dihydro-2'-deoxyguanosine: an isotope based method to evaluate artefactual oxidation of DNA during its extraction and subsequent work-up Carcinogenesis 23 2002 1911 1918 10.1093/carcin/23.11.1911 12419840 62 Drake D.M. Shapiro A.M. Wells P.G. Hansen Jason M. Winn Louise M. Developmental Toxicology: Methods and Protocols 2019 Springer New York 313 328 63 Olive P.L. Banáth J.P. The comet assay: a method to measure DNA damage in individual cells Nat. Protoc. 1 2006 23 29 10.1038/nprot.2006.5 17406208 64 Møller P. Azqueta A. Boutet-Robinet E. Koppen G. Bonassi S. Milić M. Gajski G. Costa S. Teixeira J.P. Costa Pereira C. Dusinska M. Godschalk R. Brunborg G. Gutzkow K.B. Giovannelli L. Cooke M.S. Richling E. Laffon B. Valdiglesias V. Basaran N. Del Bo’ C. Zegura B. Novak M. Stopper H. Vodicka P. Vodenkova S. de Andrade V.M. Sramkova M. Gabelova A. Collins A. Langie S.A.S. Minimum Information for reporting on the Comet assay (MIRCA): recommendations for describing comet assay procedures and results Nat. Protoc. 15 2020 3817 3826 10.1038/s41596-020-0398-1 33106678 PMC7688437 65 Kolberg L. Raudvere U. Kuzmin I. Adler P. Vilo J. Peterson H. g Profiler—Interoperable web service for functional enrichment analysis and gene identifier mapping (2023 update) Nucleic Acids Res. 51 2023 W207 W212 10.1093/nar/gkad347 37144459 PMC10320099 66 Reimand J. Isserlin R. Voisin V. Kucera M. Tannus-Lopes C. Rostamianfar A. Wadi L. Meyer M. Wong J. Xu C. Merico D. Bader G.D. Pathway enrichment analysis and visualization of omics data using g:Profiler, GSEA, Cytoscape and EnrichmentMap Nat. Protoc. 14 2019 482 517 10.1038/s41596-018-0103-9 30664679 PMC6607905 67 Desagher S. Severac D. Lipkin A. Bernis C. Ritchie W. Le Digarcher A. Journot L. Genes regulated in neurons undergoing transcription-dependent apoptosis belong to signaling pathways rather than the apoptotic machinery J. Biol. Chem. 280 2005 5693 5702 10.1074/jbc.M408971200 15542599 68 Graeff F.G. Neuroanatomy and neurotransmitter regulation of defensive behaviors and related emotions in mammals Braz. J. Med. Biol. Res. 27 1994 811 829 7916235 69 Berridge C.W. Martin A.J. Hupalo S. Nicol S.E. Estrus cycle-dependent working memory effects of prefrontal cortex corticotropin-releasing factor neurotransmission Neuropsychopharmacology 47 2022 2016 2023 10.1038/s41386-022-01349-7 35618840 PMC9556710 70 Byers S.L. Wiles M.V. Dunn S.L. Taft R.A. Mouse estrous cycle identification tool and images PLoS One 7 2012 e35538 10.1371/journal.pone.0035538 PMC3325956 22514749 71 Ben Abdallah N.M.B. Fuss J. Trusel M. Galsworthy M.J. Bobsin K. Colacicco G. Deacon R.M.J. Riva M.A. Kellendonk C. Sprengel R. Lipp H.-P. Gass P. The puzzle box as a simple and efficient behavioral test for exploring impairments of general cognition and executive functions in mouse models of schizophrenia Exp. Neurol. 227 2011 42 52 10.1016/j.expneurol.2010.09.008 20851119 72 Wehner J.M. Radcliffe R.A. Cued and contextual fear conditioning in mice Current protocols in neuroscience 27 2004 10.1002/0471142301.ns0805cs27 8.5 C. 1-8.5 C. 14 18428608 73 Wong H. Hooper A.W. Kang H.R. Lee S.J. Zhao J. Sadhu C. Rawat S. Gray S.J. Hampson D.R. CNS-dominant human FMRP isoform rescues seizures, fear, and sleep abnormalities in Fmr1-KO mice JCI Insight 8 2023 10.1172/jci.insight.169650 PMC10393223 37288657 74 Berman R.F. Hannigan J.H. Effects of prenatal alcohol exposure on the hippocampus: spatial behavior, electrophysiology, and neuroanatomy Hippocampus 10 2000 94 110 10.1002/(SICI)1098-1063(2000)10:1&#x0003c;94::AID-HIPO11&#x0003e;3.0.CO;2-T 10706221 75 Sies H. Berndt C. Jones D.P. Oxidative stress Annu. Rev. Biochem. 86 2017 715 748 28441057 10.1146/annurev-biochem-061516-045037 76 Amente S. Di Palo G. Scala G. Castrignanò T. Gorini F. Cocozza S. Moresano A. Pucci P. Ma B. Stepanov I. Lania L. Pelicci P.G. Dellino G.I. Majello B. Genome-wide mapping of 8-oxo-7,8-dihydro-2′-deoxyguanosine reveals accumulation of oxidatively-generated damage at DNA replication origins within transcribed long genes of Mammalian cells Nucleic Acids Res. 47 2018 221 236 10.1093/nar/gky1152 PMC6326803 30462294 77 Afsharian K. Richards S.M. Wells P.G. DNA methylation inhibition mitigates brain transcriptional alterations caused by enhanced oxidative DNA damage Toxicol. Sci. 198 No 2024 3825 78 Mahnke A.H. Sideridis G.D. Salem N.A. Tseng A.M. Carter R.C. Dodge N.C. Rathod A.B. Molteno C.D. Meintjes E.M. Jacobson S.W. Miranda R.C. Jacobson J.L. Infant circulating MicroRNAs as biomarkers of effect in fetal alcohol spectrum disorders Sci. Rep. 11 2021 1429 10.1038/s41598-020-80734-y 33446819 PMC7809131 79 Balaraman S. Tingling J.D. Tsai P.C. Miranda R.C. Dysregulation of microRNA expression and function contributes to the etiology of fetal alcohol spectrum disorders Alcohol Research 35 2013 18 24 24313161 PMC3860419 80 Tseng A.M. Mahnke A.H. Wells A.B. Salem N.A. Allan A.M. Roberts V.H. Newman N. Walter N.A. Kroenke C.D. Grant K.A. Maternal circulating miRNAs that predict infant FASD outcomes influence placental maturation Life Sci. Alliance 2 2019 10.26508/lsa.201800252 PMC6399548 30833415 81 de Souza-Pinto N.C. Eide L. Hogue B.A. Thybo T. Stevnsner T. Seeberg E. Klungland A. Bohr V.A. Repair of 8-oxodeoxyguanosine lesions in mitochondrial DNA depends on the oxoguanine DNA glycosylase (OGG1) gene and 8-oxoguanine accumulates in the mitochondrial DNA of OGG1-defective mice Cancer Res. 61 2001 5378 5381 11454679 82 Leon J. Sakumi K. Castillo E. Sheng Z. Oka S. Nakabeppu Y. 8-Oxoguanine accumulation in mitochondrial DNA causes mitochondrial dysfunction and impairs neuritogenesis in cultured adult mouse cortical neurons under oxidative conditions Sci. Rep. 6 2016 22086 10.1038/srep22086 PMC4766534 26912170 83 Gu X. Ma Y. Liu Y. Wan Q. Measurement of mitochondrial respiration in adherent cells by Seahorse XF96 Cell Mito Stress Test STAR protocols 2 2021 100245 10.1016/j.xpro.2020.100245 PMC7797920 33458707 84 Dhavarasa P. Sack T. Cerrato C.P. Cheng A.P. Zhang Y.Y. Chen K. Kelley S.O. Mitochondrial probe for glutathione depletion reveals NME3 essentiality for mitochondrial redox response ACS Chem. Biol. 2024 10.1021/acschembio.4c00287 39133631 85 Ögren S.O. Stiedl O. Stolerman Ian P. Encyclopedia of Psychopharmacology 2010 Springer Berlin Heidelberg 960 967 86 Xavier J.M. Rodrigues C.M. Solá S. Mitochondria: major regulators of neural development Neuroscientist 22 2016 346 358 10.1177/1073858415585472 25948649 87 Pastukh V. Roberts J.T. Clark D.W. Bardwell G.C. Patel M. Al-Mehdi A.-B. Borchert G.M. Gillespie M.N. An oxidative DNA “damage” and repair mechanism localized in the VEGF promoter is important for hypoxia-induced VEGF mRNA expression Am. J. Physiol. Lung Cell. Mol. Physiol. 309 2015 L1367 L1375 10.1152/ajplung.00236.2015 26432868 PMC4669343 88 Radhakrishnan B. Alwin Prem Anand A. Role of miRNA-9 in brain development J. Exp. Neurosci. 10 2016 101 120 10.4137/jen.S32843 27721656 PMC5053108 89 Sathyan P. Golden H.B. Miranda R.C. Competing interactions between micro-RNAs determine neural progenitor survival and proliferation after ethanol exposure: evidence from an ex vivo model of the fetal cerebral cortical neuroepithelium J. Neurosci. 27 2007 8546 8557 10.1523/JNEUROSCI.1269-07.2007 17687032 PMC2915840 90 Ramon O. Sauvaigo S. Gasparutto D. Faure P. Favier A. Cadet J. Effects of 8-oxo-7, 8-dihydro-2′-deoxyguanosine on the binding of the transcription factor Sp1 to its cognate target DNA sequence (GC box) Free Radic. Res. 31 1999 217 229 10.1080/10715769900300781 10499779 91 Moore S.P. Toomire K.J. Strauss P.R. DNA modifications repaired by base excision repair are epigenetic DNA Repair 12 2013 1152 1158 10.1016/j.dnarep.2013.10.002 24216087 92 Maltseva D.V. Baykov A.A. Jeltsch A. Gromova E.S. Impact of 7,8-dihydro-8-oxoguanine on methylation of the CpG site by Dnmt3a Biochemistry 48 2009 1361 1368 10.1021/bi801947f 19161295 93 Nan X. Ng H.-H. Johnson C.A. Laherty C.D. Turner B.M. Eisenman R.N. Bird A. Transcriptional repression by the methyl-cpg-binding protein MeCP2 involves a histone deacetylase complex Nature 393 1998 386 389 10.1038/30764 9620804 94 Suzuki M. Yamada T. Kihara-Negishi F. Sakurai T. Oikawa T. Direct association between PU.1 and MeCP2 that recruits mSin3A-HDAC complex for PU.1-mediated transcriptional repression Oncogene 22 2003 8688 8698 10.1038/sj.onc.1207182 14647463 95 Dasgupta N. Arnold R. Equey A. Gandhi A. Adams P.D. The role of the dynamic epigenetic landscape in senescence: orchestrating SASP expression npj Aging 10 2024 48 10.1038/s41514-024-00172-2 39448585 PMC11502686 96 Bhatia S. Yan Y. Ly M. Wells P.G. Sex-and OGG1-dependent reversal of in utero ethanol-initiated changes in postnatal behaviour by neonatal treatment with the histone deacetylase inhibitor trichostatin A (TSA) in oxoguanine glycosylase 1 (Ogg1) knockout mice Toxicol. Lett. 356 2022 121 131 10.1016/j.toxlet.2021.12.010 34923047 97 Klungland A. Laerdahl J.K. Rognes T. Oxidative Damage to Nucleic Acids 2007 Springer 98 Iwata R. Casimir P. Erkol E. Boubakar L. Planque M. Gallego López I.M. Ditkowska M. Gaspariunaite V. Beckers S. Remans D. Vints K. Vandekeere A. Poovathingal S. Bird M. Vlaeminck I. Creemers E. Wierda K. Corthout N. Vermeersch P. Carpentier S. Davie K. Mazzone M. Gounko N.V. Aerts S. Ghesquière B. Fendt S.-M. Vanderhaeghen P. Mitochondria metabolism sets the species-specific tempo of neuronal development Science 379 2023 eabn4705 10.1126/science.abn4705 36705539 99 Darbinian N. Darbinyan A. Merabova N. Kassem M. Tatevosian G. Amini S. Goetzl L. Selzer M.E. In utero ethanol exposure induces mitochondrial DNA damage and inhibits mtDNA repair in developing brain Front. Neurosci. 17 2023 1214958 10.3389/fnins.2023.1214958 PMC10444992 37621718 100 Rossignol D.A. Frye R.E. Mitochondrial dysfunction in autism spectrum disorders: a systematic review and meta-analysis Mol. Psychiatr. 17 2012 290 314 10.1038/mp.2010.136 PMC3285768 21263444 101 Marchetti P. Fovez Q. Germain N. Khamari R. Kluza J. Mitochondrial spare respiratory capacity: mechanisms, regulation, and significance in non-transformed and cancer cells The Federal Accounting Standards Advisory Board Journal 34 2020 13106 13124 10.1096/fj.202000767R 32808332 102 Balaban R.S. Nemoto S. Finkel T. Mitochondria, oxidants, and aging Cell 120 2005 483 495 15734681 10.1016/j.cell.2005.02.001 103 Wang W. Esbensen Y. Kunke D. Suganthan R. Rachek L. Bjørås M. Eide L. Mitochondrial DNA damage level determines neural stem cell differentiation fate J. Neurosci. 31 2011 9746 10.1523/JNEUROSCI.0852-11.2011 21715639 PMC6623160 104 do Nascimento E.B. Dierschnabel A.L. de Macêdo Medeiros A. Suchecki D. Silva R.H. Ribeiro A.M. Memory impairment induced by different types of prolonged stress is dependent on the phase of the estrous cycle in female rats Horm. Behav. 115 2019 104563 10.1016/j.yhbeh.2019.104563 31377100 105 Drake D.M. Zhen D. Kerrebijn I. Or B. Gao S. Afsharian K. Tran J. Bhatia S. Cheng A. Wells P.G. Breast cancer 1 (BRCA1) protection in altered gene expression and neurodevelopmental disorders due to physiological and ethanol-enhanced reactive oxygen species formation Free Radic. Biol. Med. 208 2023 272 284 10.1016/j.freeradbiomed.2023.08.006 37541454 Appendix A Supplementary data The following is/are the supplementary data to this article. Multimedia component 1 Multimedia component 1 Data availability All data supporting the findings of this study are available within the paper, and gene lists from the microarray analysis are provided in the online Supplementary Materials. Acknowledgements We thank the Centre for Pharmaceutical Oncology at the Leslie Dan Faculty of Pharmacy for the use of its equipment. We also thank Dr. Andrew Elia at the Princess Margaret Cancer Centre Histology Core and Dr. Chao Lu at the Centre for Applied Genomics at the Hospital for Sick Children for their services. Appendix A Supplementary data to this article can be found online at https://doi.org/10.1016/j.redox.2025.103856 ",
  "metadata": {
    "Title of this paper": "Breast cancer 1 (BRCA1) protection in altered gene expression and neurodevelopmental disorders due to physiological and ethanol-enhanced reactive oxygen species formation",
    "Journal it was published in:": "Redox Biology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478066/"
  }
}