{
  "title": "Paper_374",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12484863 PMC12484863.1 12484863 12484863 41028147 10.1038/s41598-025-12412-w 12412 1 Article Metabolic profiles of squamous cell lung carcinoma and diagnostic model construction Kim Kyung Soo 1 Moon Seok Whan 1 Moon Mi Hyung 1 Kim Seung Joon 2 Kim Kwang Youl Kykim@inhauh.com 3 Jekarl Dong Wook bonokarl@catholic.ac.kr 4 5 1 https://ror.org/01fpnj063 grid.411947.e 0000 0004 0470 4224 Department of Thoracic and Cardiovascular Surgery, Seoul St. Mary’s Hospital, College of Medicine, The Catholic University of Korea, 2 https://ror.org/01fpnj063 grid.411947.e 0000 0004 0470 4224 Department of Pulmonology, Seoul St. Mary’s Hospital, College of Medicine, The Catholic University of Korea, 3 4 https://ror.org/01fpnj063 grid.411947.e 0000 0004 0470 4224 Department of Laboratory Medicine, Seoul St. Mary’s Hospital, College of Medicine, The Catholic University of Korea, 5 https://ror.org/01fpnj063 grid.411947.e 0000 0004 0470 4224 Research and Development Institute for In Vitro Diagnostic Medical Devices, College of Medicine, The Catholic University of Korea, 30 9 2025 2025 15 478255 34015 26 3 2024 16 7 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Cancer cells exhibit metabolic reprogramming to fulfill their increased demands for abnormal growth and proliferation. We studied metabolic profiles of squamous cell lung carcinoma (LUSC). Elevated arginine levels and reduced acylcarnitine C18:2, along with decreased phosphatidylcholine (PC) with acyl-alkyl residues C38:0 were associated with the diagnosis and prognosis of LUSC. Most of the PCs demonstrated a decrease, while lysophosphatidylcholines (LPC) exhibited an increase in LUSC patients. Network analysis unveiled that LPCs mediated PC and amino acids subgroup in LUSC compared to the control group. Analysis of public LUSC data confirmed associations between the expression levels of genes encoding enzymes involved in the biosynthesis pathways of arginine, proline ( ASL OTC PYCR2 CEPT1 CHPT1 LPCAT1 LCAT PLA2G16 PLB1 Supplementary Information The online version contains supplementary material available at 10.1038/s41598-025-12412-w. Keywords Metabolic profiles Lung squamous cell carcinoma Feature selection LASSO Mass spectormetry Subject terms Metabolomics Biomarkers Oncology Catholic Medical Center Research Foundation 2022 Kim Kyung Soo pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Lung carcinoma ranks as the second most prevalent malignancy, trailing behind breast cancer and followed by colorectal, prostate and stomach cancers in global statistics 1 1 2 3 The proliferation of cancerous cells necessitates diverse building blocks and metabolites to support their abnormal growth and rapid proliferation 4 5 6 7 8 9 PCs and LPCs are precursors in the formation of membrane lipids associated with plasma membrane remodeling in cancerous cells. PCs are synthesized from precursors of diacylglycerol and CDP-choline precursors, derived from phosphocholine, choline, and acetylcholine. Enzymatic reactions by phospholipase or lecithin-cholesterol acyltransferase (LCAT) lead to the separation of acyl or alkyl moieties from PC, resulting in the production of LPC 9 11 To investigate metabolomic characteristics specific to LUSC using peripheral blood samples, both healthy control and LUSC patient samples were analyzed. As metabolites are correlated in high degree, a feature selection method followed by a dimension reduction method was utilized to construct a diagnostic model. Additionally, to interpret the intricate nature of metabolites, network analysis was conducted for both healthy controls and LUSC patients, further stratified into early (EA) stages I and II, and advanced (ADV) stages III and IV for the LUSC patient groups. Results Metabolite concentrations Out of 188 initially measurable metabolites, 123 metabolites underwent analysis after exclusion of molecules that exhibited values either below the limit of detection, below the limit of quantitation, or exceeding the upper limit of quantification in 70% of the samples. Notably, a statistically significant difference in mean age was observed between the control group (66.7 year) and LUSC group (72.4 year). Additionally, sex-based disparity was noted in LUSC cohort, with a higher prevalence of male patients (87.7%) (Supplementary Table S1 The mean and standard deviation values for these metabolites in the healthy control group ( n n S3 S1 n n S4 S5 MetaboanalystR Further analysis was conducted using MetaboAnalystR, an R package synchronized with its website. Among the various functions in MetaboAnalystR, statistical analysis was performed. There are more than a dozen statistical functions, and among them, we selected the ones that best represent this study. A t-test with the false discovery rate (FDR) correction was applied to compare the concentrations of metabolites between normal controls and LUSC patients. A volcano plot wasused to summarize the metabolites. The Volcano plot shows the fold change of metabolites, comparing normal and LUSC groups, along with the p-value of fold changes. Enrichment analysis results are plotted to demonstrate the status of involved metabolic pathways. T-tests were employed and represented in a plot based on P 1 P 1  Fig. 1 Analysis results of metabolites by T-test ( A B C Enrichment analysis focusing on amino acids was depicted in a bar graph (Fig. 1 S6 S6 Feature selection Due to multicollinearity observed among the measured metabolites, a feature selection process employing seven distinct algorithms was utilized to identify variables (Fig. 2 1  Fig. 2 Variable selection using seven feature selection method and concentration of metabolites. Color of the bar indicates feature selection method and arginine was selected by 7 methods ( A B  Table 1 Dimension reduction of 123 to 5 variables using initial LASSO followed by post LASSO analysis. Variable Initial Post Low High P C10:1 -0.158 -0.188 -0.683 0.060 NS C18:2 -1.062 -1.356 -1.720 -0.076 0.032 Arg 0.002 0.002 0.001 0.003 0.0002 Glu 0.000319 0.0004516 0.000 0.001 NS Orn -0.001 Trp -0.0003089 Creatinine 0.001 Serotonin 0.203 0.199 0.010 0.329 0.036 PC.aa.C38.3 -0.002 -0.002 -0.006 0.003 NS PC.aa.C38.5 0.0003584 PC.aa.C38.6 0.002 0.002 0.000 0.007 0.047 PC.ae.C38.0 -0.025 -0.059 -0.197 -0.001 0.032 PC.ae.C42.5 0.205 0.281 -0.249 0.330 NS SM.OH.C22.1 -0.007 SM.OH.C24.1 -0.004 H1 0.00001388 0.0000157 0.000 0.000 NS Arg, arginine; Glu, glutamic acid; Orn, ornithine; Trp, tryptophan, PC, phosphatidylcholine; aa, acyl acyl bond; ae, acyl alkyl bond; SM, sphingomyelin; H, hexoses; LASSO, least absolute shrinkage and selection operator; CI, confidence interval; NS, not significant. Cox regression analysis of the selected variables showed that Arg was the only variable that showed statistical significance (hazard ratio of 0.8981, p alue 0.0355). As in survival analysis, high Arg concentration showed better survival. Survival analysis A 5- year overall survival analysis was conducted for all metabolites included in the feature selection process (Supplementary Figure S8). Conversely, metabolites not incorporated were also plotted separately (Supplementary Figure S9). Higher concentrations of amino acids and LysoPCs exhibited a trend towards favorable survival outcomes compared to lower concentrations, while elevated concentrations of PCs tended to correlate with unfavorable prognoses. AUROC and Cox regression analysis Among the 5 selected metabolites, Arg, C18.2, and PC.ae.C38.0 resulted in an AUROC (area under the receiver operator characteristics) (95% CI) of 0.911 (0.859–0.963), 0.997 (0.992-1.000), and 0.858 (0.802–0.912) (Supplementary Figure S10, Supplementary Table 5). Hazard ratios (95% CI) from the Cox regression analysis for these three metabolites were as follows: 1.060 (1.040–1.090); 0.860 (0.800–0.930); and 0.160 (0.090–0.280), respectively. Network analysis Construction of networks based on Spearman’s correlation matrix between control and LUSC groups, as well as between EA LUSC and ADV LUSC was performed (Supplementary Figure S11, S12). The network analysis revealed that the healthy normal group demonstrated higher network density, heterogeneity, centralization and average degree, whereas the LUSC group showed higher shortest path, assortativity and modularity (Table 2 3  Table 2 Network topologic parameters from selected cases ( n n n n n n Healthy n LUAD n Early n Advanced n Number of nodes, N 88 95 97 101 Number of edges, E 375 226 324 319 Clustering coefficient, < C 0.504 0.468 0.545 0.586 Network density 0.130 0.068 0.102 0.117 Network heterogeneity 0.724 0.571 0.715 0.547 Connected components 5 5 6 6 Network diameter 8 6 14 7 Network centralization 0.255 0.088 0.189 0.125 Shortest path 3.063 4.983 5.291 2.871 Average degree, < k 9.627 5.316 7.846 7.853 Assortativity 0.3970 0.4176 0.5565 0.5585 Modularity 0.3939 0.6421 0.5891 0.5901 Node with highest degree (hub) SM.C16.0 PC.ae.C36.3 lysoPC.a.C16.0 PC.ae.C34.2  Fig. 3 Network construction based on correlation matrix of metabolites of healthy control ( A B Public data analysis From the Xena browser, a dataset comprising 765 RNA-seq gene expression data from GDC TCGA LUSC was downloaded. Among these, 537 samples with associated survival data were selected for Kaplan-Meier analysis (Supplementary Figure S14, S15). Metabolite concentrations were interpolated within pathways. Notably, Arg, ornithine, glutamate, Pro, and 4-hydroxyproline were found to be elevated in this study, indicated by blue arrows (Fig. 4 ASL OTC PYCR2 4 4 CEPT1 CHPT1 LPCAT1 LCAT PLA2G16 PLB1 4 ASL LPCAT1  Fig. 4 Biosynthesis pathway and GDC TCGA LUSC data with overlaid study data. Arginine, proline biosynthesis pathway ( A B D C Discussion The analysis of the highly inter-correlated metabolome matrix necessitated feature extraction or feature selection methods and subsequent dimension reduction techniques 12 1 13 14 18 Decision tree-based algorithms (Random Forest, Gradient Boosting) and penalized regularization models (LASSO) ranked important features. This study utilized Adaboost, GAMboost, XGboost, Boruta, LASSO, Random Forest, SDWD algorithms for feature selection (Fig. 2 2 MetaboAnalystR offers feature extraction methods along with a volcano plot displaying scattered data points with fold change and p-value (Fig. 1 13 19 20 21 Concentrations of metabolites such as Arg, glutamate, glycine, phenylalanine, serine were found to be associated with tumor aggressiveness (Supplementary Figure S5 22 6 Network analysis is applicable to complex systems, offering a global perspective on variable interrelatedness 23 24 3 Reduced average degree and density may suggest a lack of coordination of metabolic pathways and a shift in the metabolome. Decreased metabolite heterogeneity implies a diminished diversity of metabolite functions, potentially serving as a source of energy or anabolic materials (Table 2 25 27 The TCGA data represent valuable resources for researchers, serving as crucial references or beacons for comparative analysis. The attached survival data addclinical significance and potential functionality to the obtained results 28 29 The limitation of this study is the relatively small sample size for subsequent machine learning analyses. Clinical data were unavailable, as the samples were de-identified. An observed age difference may have acted as a potential confounding factor.  A sex difference was also noted in the LUSC group, with a predominance of male patients (87.7%). However, this difference might reflect real- world LUSC incidence or increased prevalence within the smoking population (Supplementary Table S1 Conclusion The metabolic reprogramming was evident in LUSC patients, characterized by elevated levels of Arg and reduced level of acylcarnitine C18.2 and phosphatidylcholine (PC) with acyl alkyl residues C38:0 (PC.ae.C38.0), showing associations with both the diagnosis and prognosis of LUSC. A decreased network density, heterogeneity, average degree and centrality was observed in the LUSC and ADV LUSC networks. Further studies are required by recruiting additional metabolites to elucidate other metabolic pathways underlying LUSC. Methods Patients This study received approval from the Institutional Review Board of Seoul St. Mary’s Hospital and Eunpyeong St. Mary’s Hospital. Informed consent for researchers was waived, given that the samples were obtained after gaining informed consent from participants followed by anonymization procedures. The pool of 98 samples from healthy controls and 73 samples from LUSC patients was provided by the Sample Bank of Seoul St. Mary’s Hospital and Eunpyeong St. Mary’s Hospital, The Catholic University of Korea, Seoul, Korea, adhering to relevant regulations. All LUSC patients underwent surgical intervention, and pathology confirmation was conducted by the pathologists as a part of routine diagnostic protocols. Tissue samples from LUSC patients were categorized following the guidelines outlined in the World Health Organization of the American Joint Committee on Cancer Staging Manual 30 S1 Targeted metabolomic measurement Metabolite measurement was conducted using the AbsoluteIDQ p180 kit (Biocrates Life Science AG, Innsbruck, Austria), analyzed via mass spectrometry, employing isotope-labeled standards for quantification 31 32 S2 In brief, 10 µL of internal standard (amino acids, biogenic amines) followed by 10 µL of samples (calibrator, QC material, and patient samples) were added to the filter insert. This insert contained several internal standards related to glycerophospholipids, sphingomyelins, acylcarnitine and hexoses. This process was performed according to manufacturer’s instruction. The mixture was then dried with a nitrogen stream for 30 minutes. Subsequently, 50 µL of 5% phenyl isothiocyanate was added for derivatization of amino acids and biogenic amines. Following a 1 hour incubation, the molecules were extracted using 5mM ammonium acetate in 300 µL methanol. Half of the eluate was analyzed by LC-MS/MS, while the other half was analyzed by flow injection analysis MS/MS. For amino acids and biogenic amines, a Zorbax Eclipse XDBC 18 column (3 mm x 100 mm, 3.5 µM, Agilent Technologies, USA) was employed at a flow rate of 0.5 mL/min using a water and acetonitrile with 0.2% formic acid in the LC gradient conditions. The analysis of PCs, SM, LPCs, acylcarnitines and hexoses utilized a flow rate of 0.03 mL/min with an elution solvent in flow injection analysis gradient. Multiple reaction monitoring modes of the MS (API 4000, AB Sciex, Darmstadt, Germany) in positive electrospray ionization mode were used for quantification, while only hexoses were analyzed in negative mode 20 21 Data analysis Quantification involved the utilization of internal standards in conjunction with calibration curves. Following peak integration and concentration calculation using Analyst 1.5.1 software (AB Sciex, Darmstadt, Germany), the processed data were imported into the Biocrates MetIDQ software 31 31 Network analysis Network parameters were established in accordance with previously documented methodologies 23 24 N L k 25 27 27 33 34 Public data analysis For verification of the quantified metabolites, the LUSC ( n www.xenabrowser.net 28 29 n To illustrate the arginine (Arg), proline (Pro) metabolism pathway (hsa T30003 35 36 Statistical analysis Due to the observed correlation and multicollinearity among the measured variables, feature selection was performed using following algorithms available in the caret R package and others, including Adaboost, Boruta, gradient boosting for additive models in mboost (GAMboost), least absolute shrinkage and selection operator (LASSO), Random Forest, sparse distance weighted discrimination (SDWD), and extreme gradient boosting (XGBoost) 12 14 18 37 38 39 Survival analysis encompassing 5 year overall survival rates, where death from any cause was considered an event, was carried out utilizing the survival and survminer packages 40 41 Electronic supplementary material Below is the link to the electronic supplementary material.  Supplementary Material 1  Supplementary Material 2  Supplementary Material 3  Supplementary Material 4  Supplementary Material 5  Supplementary Material 6 Abbreviations LUSC Squamous cell lung carcinoma Arg arginine C18.2 Acylcarnitine C18:2, C18.2 PC Phosphatidylcholine PC.ae.C38.6 PC with acyl alkyl residues C38:6 LPC Lysophosphatidylcholines EA Early stage cancer ADV Advanced stage cancer TNM Tumor, Node, Metastasis stages LC Liquid chromatography MS Mass spectrometry TCGA The Cancer Genome Atlas Pro Proline GAMboost Gradient boosting for additive models in mboost LASSO Least absolute shrinkage and selection operator SDWD Sparse distance weighted discrimination XGboost Extreme gradient boosting PCA Principal component analysis PLS-DA Partial least squares discriminant analysis ROC Receiver operating characteristic Glu Glutamic acid ASL Argininosuccinate lyase OTC Ornithine transcarbamylase PYCR2 Pyrroline-5-carboylate reductase 2 CEPT1 Choline/Ethanolamine Phosphotransferase 1 CHPT1 Choline phosphotransferse 1 LPCAT1 1-acyl-sn-glycoerol-3-phosphate acyltrnsferase LCAT Lecithin-cholesterol acyltransferase PLA2G16 Phospholipase A and Acyltransferase 3 PLB1 Phospholipase B1 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Kwang Youl Kim and Dong Wook Jekarl contributed equally to this work. Acknowledgements We are grateful to the patients and healthy normal individuals for the banking of their samples. The specimens for this study were provided by Sample Bank from Seoul St. Mary’s Hospital and Eunpyeong St. Mary’s Hospital, The Catholic University of Korea, Seoul, Korea. Author contributions D.W.J. takes full responsibility of the content, data and the analysis result. D.W.J.: conceptualization, validation, investigation, data analysis, writing original draft, writing review and editing. K.K.S.: conceptualization, data analysis, writing original draft, writing review and editing, fund acquisition. S.W.M.: resources, supervision; M.H.M.: conceptualization, resources, data analysis; S.J.K.: resources, supervision; K.Y.K.: methodology, data curation, supervision. Data availability All the data generated or analyzed during this study are included in this published article and its supplementary information files. Declarations Competing interests The authors declare no competing interests. References 1. Sung H Global Cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J. Clin. 2021 71 209 249 33538338 10.3322/caac.21660 Sung, H. et al. Global Cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. CA Cancer J. Clin. 71 33538338 10.3322/caac.21660 2. Gridelli C Non-small-cell lung cancer Nat. Rev. Dis. Primers 2015 1 15009 10.1038/nrdp.2015.9 27188576 Gridelli, C. et al. Non-small-cell lung cancer. Nat. Rev. Dis. Primers 1 27188576 10.1038/nrdp.2015.9 3. Collisson EA Comprehensive molecular profiling of lung adenocarcinoma Nature 2014 511 543 550 10.1038/nature13385 25079552 PMC4231481 Collisson, E. A. et al. Comprehensive molecular profiling of lung adenocarcinoma. Nature 511 25079552 10.1038/nature13385 PMC4231481 4. Alvarado A Arce I Metabolic functions of the lung, disorders and associated pathologies J. Clin. Med. Res. 2016 8 689 700 10.14740/jocmr2668w 27635172 PMC5012236 Alvarado, A. & Arce, I. Metabolic functions of the lung, disorders and associated pathologies. J. Clin. Med. Res. 8 27635172 10.14740/jocmr2668w PMC5012236 5. DeBerardinis RJ Chandel NS Fundamentals of cancer metabolism Sci. Adv. 2016 2 e1600200 10.1126/sciadv.1600200 27386546 PMC4928883 DeBerardinis, R. J. & Chandel, N. S. Fundamentals of cancer metabolism. Sci. Adv. 2 27386546 10.1126/sciadv.1600200 PMC4928883 6. Hay N Reprogramming glucose metabolism in cancer: can it be exploited for cancer therapy? Nat. Rev. Cancer 2016 16 635 649 10.1038/nrc.2016.77 27634447 PMC5516800 Hay, N. Reprogramming glucose metabolism in cancer: Can it be exploited for cancer therapy? Nat. Rev. Cancer 16 27634447 10.1038/nrc.2016.77 PMC5516800 7. Lesko J Phospholipid dynamics in ex vivo lung cancer and normal lung explants Exp. Mol. Med. 2021 53 81 90 10.1038/s12276-020-00547-x 33408336 PMC8080582 Lesko, J. et al. Phospholipid dynamics in ex vivo lung cancer and normal lung explants. Exp. Mol. Med. 53 33408336 10.1038/s12276-020-00547-x PMC8080582 8. Lieu EL Nguyen T Rhyne S Kim J Amino acids in cancer Exp. Mol. Med. 2020 52 15 30 10.1038/s12276-020-0375-3 31980738 PMC7000687 Lieu, E. L., Nguyen, T., Rhyne, S. & Kim, J. Amino acids in cancer. Exp. Mol. Med. 52 31980738 10.1038/s12276-020-0375-3 PMC7000687 9. Wei, Z., Liu, X., Cheng, C., Yu, W. & Yi, P. Metabolism of amino acids in Cancer. Front Cell. Dev. Biol 8 10.3389/fcell.2020.603837 PMC7835483 33511116 10. Xiao M Functional significance of cholesterol metabolism in cancer: from threat to treatment Exp. Mol. Med. 2023 55 1982 1995 10.1038/s12276-023-01079-w 37653037 PMC10545798 Xiao, M. et al. Functional significance of cholesterol metabolism in cancer: From threat to treatment. Exp. Mol. Med. 55 37653037 10.1038/s12276-023-01079-w PMC10545798 11. Singh A Serum metabolic disturbances in lung Cancer investigated through an elaborative NMR-Based serum metabolomics approach ACS Omega 2022 7 5510 5520 10.1021/acsomega.1c06941 35187366 PMC8851899 Singh, A. et al. Serum metabolic disturbances in lung Cancer investigated through an elaborative NMR-Based serum metabolomics approach. ACS Omega 7 35187366 10.1021/acsomega.1c06941 PMC8851899 12. Kuhn M Building predictive models in R using the caret package J. Stat. Softw. 2008 28 1 26 10.18637/jss.v028.i05 Kuhn, M. Building predictive models in R using the caret package. J. Stat. Softw. 28 13. Chong J Xia J MetaboAnalystR: an R package for flexible and reproducible analysis of metabolomics data Bioinformatics 2018 34 4313 4314 10.1093/bioinformatics/bty528 29955821 PMC6289126 Chong, J. & Xia, J. MetaboAnalystR: an R package for flexible and reproducible analysis of metabolomics data. Bioinformatics 34 29955821 10.1093/bioinformatics/bty528 PMC6289126 14. Kursa MB Rudnicki WR Feature selection with the Boruta package J. Stat. Softw. 2010 36 1 13 10.18637/jss.v036.i11 Kursa, M. B. & Rudnicki, W. R. Feature selection with the Boruta package. J. Stat. Softw. 36 15. Lantz, B. PACKT,. Machine learning with R. (2019). 16. Terry Therneau, E. J. A. & Foundation, M. rpart: Recursive Partitioning and Regression Trees https://github.com/bethatkinson/rpart 17. Chen, T. C. G. XGBoost: A Scalable Tree Boosting System. arXiv 18. Wang B Zou H Sparse distance weighted discrimination J. Comput. Graph Stat. 2016 25 826 838 10.1080/10618600.2015.1049700 Wang, B. & Zou, H. Sparse distance weighted discrimination. J. Comput. Graph Stat. 25 19. Kuo, M. T., Chen, H. H. W., Feun, L. G. & Savaraj, N. Targeting the Proline-Glutamine-Asparagine-Arginine metabolic Axis in amino acid starvation Cancer therapy. Pharmaceuticals 14 10.3390/ph14010072 PMC7830038 33477430 20. Shestakova KM Targeted metabolomic profiling as a tool for diagnostics of patients with non-small-cell lung cancer Scic Rep. 2023 13 11072 10.1038/s41598-023-38140-7 PMC10329697 37422585 Shestakova, K. M. et al. Targeted metabolomic profiling as a tool for diagnostics of patients with non-small-cell lung cancer. Scic Rep. 13 10.1038/s41598-023-38140-7 PMC10329697 37422585 21. Saito RF Andrade LNS Bustos SO Chammas R Phosphatidylcholine-Derived lipid mediators: the crosstalk between Cancer cells and immune cells Front. Immunol. 2022 13 768606 10.3389/fimmu.2022.768606 35250970 PMC8889569 Saito, R. F., Andrade, L. N. S., Bustos, S. O. & Chammas, R. Phosphatidylcholine-Derived lipid mediators: The crosstalk between Cancer cells and immune cells. Front. Immunol. 13 35250970 10.3389/fimmu.2022.768606 PMC8889569 22. Barabási AL Oltvai ZN Network biology: Understanding the cell’s functional organization Nat. Rev. Genet. 2004 5 101 113 10.1038/nrg1272 14735121 Barabási, A. L. & Oltvai, Z. N. Network biology: Understanding the cell’s functional organization. Nat. Rev. Genet. 5 14735121 10.1038/nrg1272 23. Newman, M. Networks: an Introduction 24. Kim KS Immune gene expression networks in sepsis: A network biology approach PLoS One 2021 16 e0247669 10.1371/journal.pone.0247669 33667236 PMC7935325 Kim, K. S. et al. Immune gene expression networks in sepsis: A network biology approach. PLoS One 16 33667236 10.1371/journal.pone.0247669 PMC7935325 25. Kim KS Immune gene networks form lung cancer patients treated with immune checkpoint inhibitors Biomedicines 2024 12 628 10.3390/biomedicines12030628 38540240 PMC10968332 Kim, K. S. et al. Immune gene networks form lung cancer patients treated with immune checkpoint inhibitors. Biomedicines 12 38540240 10.3390/biomedicines12030628 PMC10968332 26. Pavlopoulos GA Using graph theory to analyze biological networks BioData Min. 2011 4 10 10.1186/1756-0381-4-10 21527005 PMC3101653 Pavlopoulos, G. A. et al. Using graph theory to analyze biological networks. BioData Min. 4 21527005 10.1186/1756-0381-4-10 PMC3101653 27. Doncheva NT Assenov Y Domingues FS Albrecht M Topological analysis and interactive visualization of biological networks and protein structures Nat. Protoc. 2012 7 670 685 10.1038/nprot.2012.004 22422314 Doncheva, N. T., Assenov, Y., Domingues, F. S. & Albrecht, M. Topological analysis and interactive visualization of biological networks and protein structures. Nat. Protoc. 7 22422314 10.1038/nprot.2012.004 28. Hammerman PS Comprehensive genomic characterization of squamous cell lung cancers Nature 2012 489 519 525 10.1038/nature11404 22960745 PMC3466113 Hammerman, P. S. et al. Comprehensive genomic characterization of squamous cell lung cancers. Nature 489 22960745 10.1038/nature11404 PMC3466113 29. Goldman MJ Visualizing and interpreting cancer genomics data via the Xena platform Nat. Biotechnol. 2020 38 675 678 10.1038/s41587-020-0546-8 32444850 PMC7386072 Goldman, M. J. et al. Visualizing and interpreting cancer genomics data via the Xena platform. Nat. Biotechnol. 38 32444850 10.1038/s41587-020-0546-8 PMC7386072 30. Edge SB Compton CC The American joint committee on cancer: the 7th edition of the AJCC Cancer staging manual and the future of TNM Ann. Surg. Oncol. 2010 17 1471 1474 10.1245/s10434-010-0985-4 20180029 Edge, S. B. & Compton, C. C. The American joint committee on cancer: The 7th edition of the AJCC Cancer staging manual and the future of TNM. Ann. Surg. Oncol. 17 20180029 10.1245/s10434-010-0985-4 31. Kim KS Metabolic profiles of lung adenocarcinoma via peripheral blood and diagnostic model construction Sci. Rep. 2023 13 7304 10.1038/s41598-023-34575-0 37147444 PMC10163250 Kim, K. S. et al. Metabolic profiles of lung adenocarcinoma via peripheral blood and diagnostic model construction. Sci. Rep. 13 37147444 10.1038/s41598-023-34575-0 PMC10163250 32. Qi S High-resolution metabolomic biomarkers for lung cancer diagnosis and prognosis Sci. Rep. 2021 11 11805 10.1038/s41598-021-91276-2 34083687 PMC8175557 Qi, S. et al. High-resolution metabolomic biomarkers for lung cancer diagnosis and prognosis. Sci. Rep. 11 34083687 10.1038/s41598-021-91276-2 PMC8175557 33. Shannon P Cytoscape: a software environment for integrated models of biomolecular interaction networks Genome Res. 2003 13 2498 2504 10.1101/gr.1239303 14597658 PMC403769 Shannon, P. et al. Cytoscape: a software environment for integrated models of biomolecular interaction networks. Genome Res. 13 14597658 10.1101/gr.1239303 PMC403769 34. Saito R A travel guide to cytoscape plugins Nat. Methods 2012 9 1069 1076 10.1038/nmeth.2212 23132118 PMC3649846 Saito, R. et al. A travel guide to cytoscape plugins. Nat. Methods 9 23132118 10.1038/nmeth.2212 PMC3649846 35. Kanehisa M Goto S KEGG: Kyoto encyclopedia of genes and genomes Nucleic Acids Res. 2000 28 27 30 10.1093/nar/28.1.27 10592173 PMC102409 Kanehisa, M. & Goto, S. KEGG: Kyoto encyclopedia of genes and genomes. Nucleic Acids Res. 28 10592173 10.1093/nar/28.1.27 PMC102409 36. Kanehisa M Furumichi M Sato Y Matsuura Y Ishiguro-Watanabe M KEGG:biologicl systems database as a model of the real world Nucleic Acids Res. 2025 53 D672 677 10.1093/nar/gkae909 39417505 PMC11701520 Kanehisa, M., Furumichi, M., Sato, Y., Matsuura, Y. & Ishiguro-Watanabe, M. KEGG:biologicl systems database as a model of the real world. Nucleic Acids Res. 53 39417505 10.1093/nar/gkae909 PMC11701520 37. Chernozhukov VH Spindler C High-Dimensional metrics R J. 2016 8 14 10.32614/RJ-2016-040 Chernozhukov, V. H. & Spindler, C. High-Dimensional metrics. R J. 8 38. Hastie, T. The Element of Statistical Learning 39. Moon, K. W. R Statistics and Graphs for Medical Papers 40. Alboukadel Kassambara, M. K. & Biecek, P. Scheipl Fabian. survminer: Drawing Survival Curves using ggplot2 https://cran.r-project.org/web/packages/survminer/index 41. Robin X pROC: an open-source package for R and S + to analyze and compare ROC curves BMC Bioinform. 2011 12 77 10.1186/1471-2105-12-77 PMC3068975 21414208 Robin, X. et al. pROC: An open-source package for R and S + to analyze and compare ROC curves. BMC Bioinform. 12 10.1186/1471-2105-12-77 PMC3068975 21414208 ",
  "metadata": {
    "Title of this paper": "pROC: an open-source package for R and S + to analyze and compare ROC curves",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484863/"
  }
}