{
  "title": "Paper_232",
  "abstract": "pmc Brain Pathol Brain Pathol 4024 brainpath BPA Brain Pathology 1015-6305 1750-3639 Wiley PMC12488260 PMC12488260.1 12488260 12488260 40588233 10.1111/bpa.70023 BPA70023 1 Research Article Research Article Multi‐pronged analysis of pediatric low‐grade glioma and ganglioglioma reveals a unique tumor microenvironment associated with BRAF TUMOR MICROENVIRONMENT IN PEDIATRIC LOW‐GRADE GLIOMA Zahedi et al. Zahedi Shadi https://orcid.org/0009-0006-9245-7252  1  2  3 Riemondy Kent  4 Liu Tian  1 Griesinger Andrea M.  1  2  3 Donson Andrew M.  1  2 Apfelbaum April A.  5  6 Fu Rui  4 Grandvallet Contreras Julian https://orcid.org/0000-0001-8021-070X  1 Crespo Michele  1  2 DeSisto John  1  2 Groat Madeline M.  1  2 Bratbak Emil  1  2 Green Adam  1  2 Hankinson Todd C. https://orcid.org/0000-0002-6288-9496  1  2  7 Handler Michael  2  7 Vibhakar Rajeev  1  2 Willard Nicholas  8 Foreman Nicholas K.  1  2  7 Phang Tzu  1 Mulcahy Levy Jean https://orcid.org/0000-0002-3022-4246  1  2  9 jean.mulcahylevy@cuanschutz.edu   1 Department of Pediatrics University of Colorado Anschutz Medical Campus Aurora Colorado USA   2 Department of Pediatrics Morgan Adams Foundation Pediatric Brain Tumor Research Program, Children's Hospital Colorado Aurora Colorado USA   3 Clinical Science Program, Graduate School, Anschutz Medical Campus University of Colorado Denver Colorado USA   4 RNA Bioscience Initiative, University of Colorado Anschutz Medical Campus Aurora Colorado USA   5 Department of Pediatric Oncology Broad Institute Dana‐Farber/Boston Children’s Cancer and Blood Disorders Center, Dana‐Farber Cancer/Boston Children's Cancer and Blood Disorders Center Boston Massachusetts USA   6 Department of Pediatrics, Harvard Medical School Broad Institute of MIT and Harvard Cambridge Massachusetts USA   7 Department of Neurosurgery University of Colorado Anschutz Medical Campus Aurora Colorado USA   8 Department of Pathology University of Colorado Anschutz Medical Campus Aurora Colorado USA   9 Department of Pharmacology University of Colorado Anschutz Medical Campus Aurora Colorado USA * Correspondence jean.mulcahylevy@cuanschutz.edu 30 6 2025 11 2025 35 6 498126 10.1111/bpa.v35.6 e70023 03 8 2024 28 5 2025 30 06 2025 02 10 2025 02 10 2025 © 2025 The Author(s). Brain Pathology https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ Multi-pronged analysis of pediatric low-grade glioma reveals a unique tumor microenvironment associated with BRAF alterations 10 4 2024 2024.04.05.588294 bioRxiv PMC11030246 38645202 Abstract Pediatric low‐grade gliomas (pLGG) comprise 35% of all brain tumors. Despite favorable survival, patients experience significant morbidity from disease and treatments. A deeper understanding of pLGG biology is essential to identify novel, more effective, and less toxic therapies. We utilized single‐cell RNA sequencing (scRNA‐seq), spatial transcriptomics, and cytokine analyses to characterize and understand tumor and immune cell heterogeneity of pilocytic astrocytoma (PA) and ganglioglioma (GG). scRNA‐seq revealed tumor and immune cells within the tumor microenvironment (TME). Tumor cell subsets include both progenitor and mature cell populations. Immune cells included myeloid and lymphocytic cells. There was a significant difference between the prevalence of two major myeloid subclusters between PA and GG. Bulk and single‐cell cytokine analyses evaluated the immune cell signaling cascade with distinct immune phenotypes among tumor samples. KIAA1549‐BRAF BRAF V600E A multi pronged analysis approach revealed distinct neoplastic populations in PA and GG. Non‐neoplastic populations in PA showed higher levels of immune mobilizing chemokines in PA compared to GG. chemokine ganglioglioma Pilocytic astrocytoma scRNA‐sequencing spatial transcriptomics Peter Barton Family Fund for Clinical and Translational Cancer Research at The Children's Hospital Colorado Foundation Alex's Lemonade Stand Foundation for Childhood Cancer 10.13039/100001445 Amazon Goes Gold for Kids with Cancer University of Colorado Cancer Center Support P30CA046934 NIH/NCATS Colorado CTSA UM1 TR004399 Olivia Caldwell Foundation the Morgan Adams Foundations pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date November 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:01.10.2025  Zahedi S Riemondy K Liu T Griesinger AM Donson AM Apfelbaum AA Multi‐pronged analysis of pediatric low‐grade glioma and ganglioglioma reveals a unique tumor microenvironment associated with BRAF Brain Pathology 2025 35 6 e70023 10.1111/bpa.70023 PMC12488260 40588233 1 INTRODUCTION Pediatric low‐grade gliomas (pLGG) are the most common type of pediatric brain tumors, accounting for approximately one third of all central nervous system (CNS) tumors [ 1 2 3 Harnessing the immune system to treat human cancer has transformed the field of oncology but has yet to significantly impact the pLGG population. Immunotherapies have shown promising results in several tumor types. However, efficacies of such treatments vary across tumors and patients [ 4 5 6 7 8 9 10 11 pLGG is thought of as a single pathway disease due to the uniform up‐regulation of the mitogen‐activated protein kinase (MAPK) pathway [ 12 BRAF V600E NF1 KIAA1549‐BRAF KIAA1549‐BRAF 12 12 Other pediatric low‐grade tumor types carry a BRAF V600E 12 BRAF V600E CDKN2A BRAF V600E 13 Whole genome and RNA sequencing (RNA‐seq) technologies have been used to study gene expression patterns in many tumors. These studies identified additional mutations in FGFR1 PTPN11 NTRK2 14 BRAF 15 16 Single cell RNA‐seq (scRNA‐seq) provides the opportunity to investigate gene expression profiles at the single cell level and can provide insight into the diversity of tumor infiltrating immune cells. One scRNA‐seq study of six PA A2B5+ glial progenitor patient samples found these cells had a differentiated, astrocyte‐like phenotype and a smaller number of cells with a proliferative, progenitor‐like phenotype [ 17 18 To attempt a broader understanding of PA and GG and the connected tumor microenvironment (TME) we investigated a panel of 23 patient samples using a multi‐pronged approach including scRNA seq, single cell and bulk cytokine analyses, and spatial transcriptomics (ST). Together, these data provide a clearer picture of a complex tumor heterogeneity between pLGG subtypes. 2 RESULTS 2.1 Patient sample characteristics Following informed consent, samples were obtained from pLGG and GG patients who underwent tumor resection during 2011–2019 (Figure 1A 1 n n n KIAA1544:BRAF n FGFR1 BRAF FGFR3:TACC3 MN1:PATZ1 FGFR3:TACC3 FIGURE 1 ScRNA‐seq analysis of pediatric low‐grade glioma reveals neoplastic and non‐neoplastic clusters. (A) Co‐mutation plot summarizing genomic alterations and clinical characteristics of 23 pLGG samples that underwent scRNA‐seq. Each column represents a patient's tumor and each row is a clinical, genomic, or other sample attribute. Different patient sample characteristics are shown by different colors. (B) Harmony aligned UMAP projection of single‐cell expression data of 23 pLGG samples colored by neoplastic and several non‐neoplastic (myeloid, T cell, B cell, Nt, proliferating) clusters. Cluster type abundance is indicated by %frequency in the legend. (C) Stacked bar charts show the contribution of each patient sample single cells to the neoplastic and non‐neoplastic clusters. Cell counts for each sample are normalized to 1 and are color‐coded according to the specific cluster. (D) Harmony aligned UMAP projection of neoplastic and non‐neoplastic clusters colored by tumor type. The number of samples and cellular abundance contributing to each tumor type is indicated in the legend. (E) Inference of CNV (inferCNV) profiles of neoplastic and non‐neoplastic PLGG single cells. CNV, copy number variants; GG, ganglioglioma; LGG, low‐grade glioma; mut, mutation; Nt, neutrophils; PA, pilocytic astrocytoma. 2.2  scRNA pLGG To determine the extent of cellular heterogeneity and complexity of pLGG, GG and their microenvironment, we performed scRNA‐seq on 23 primary patient samples (Figure 1 1B 1 1B, C 1B 1B 2 3 1C 4 Single cells were labeled by tumor type to assess the distribution of cells that comprise the different subtypes across major subclusters (Figure 1D 1D We used CNVs to distinguish tumor cells from other cells. The most notable CNV events included losses on chromosomes 1, 6, and 19 as well as gains on chromosomes 3, 5, 7, and 21 (Figure 1E 17 19 2.3 Neoplastic population consists of distinct subpopulations in PA GG To assess differences in cellular identity between PA and GG, neoplastic cells were separated from non‐neoplastic cells and re‐clustered using Harmony. We identified nine PA (cell # = 3531) and seven GG subclusters (cell # = 1519) (Figure 2A, B 2 20 2C, D FIGURE 2 Gene expression profiling of neoplastic populations demonstrate distinct subpopulations in PA and GG. Harmony aligned UMAP plots of (A) PA cells colored by nine identified subclusters and (B) GG cells colored by seven identified subclusters. Stacked barcharts show the contribution of each patient sample to various (C) PA and (D) GG subclusters. Cell counts for subcluster are normalized to 1. Heatmaps for the top significant differentially expressed genes in various (E) PA and (F) GG subclusters. Each row represents a gene and each column represents a neoplastic cluster. AC, astrocytes; OC, oligodendrocytes; OPC, oligodendrocyte progenitor cells; MAPKhi, high expression levels of MAPK genes; Glycolysis_hi, high expression levels of genes involved in glycolysis; Ribosome_hi, high expression levels of ribosomal genes. The most abundant PA subcluster resembled OC (OC‐like 1). These cells appear as differentiating oligodendrocytes (Supplementary Figure 5A PLP1 GPR17 BCAS1 PLP1 BCAS1 17 21 GPR17 22 6A 23 24 7 25 17 An OPC‐like population was the largest cell population in GG (Figure 2B 26 2E, F 8 In GG, there was also a small set of OC‐like cells resembling a more mature oligodendrocyte population differentially expressing mature OC‐related genes such as MBP and ERMN. Astrocyte (AC‐like 1–2) subpopulations were identified in both tumor types. Interestingly, all four AC‐like populations in PA and GG showed different gene expression patterns (Figure 2E, F 6A 5A 5B 5B 5 There were two sample‐specific clusters (UPN#1459 and UPN#1171). In GG, there were cell populations that we could not clearly define, one carrying high ribosomal genes (Ribosome_hi) and one with high levels of glycolytic activity (Glycolysis_hi). We also performed single‐cell RNA sequencing (RNAseq) gene set enrichment (GSEA) pathway analysis to compare the activity score of enriched pathways among different subclusters in PA and GG (Supplementary Figure 9 In summary, we observed several neoplastic subclusters in both PA and GG. Interestingly, some clusters identified having the same origin had different gene expression patterns. 2.4 Characterizing immune populations in PA GG To fully characterize immune subclusters, we separated the non‐neoplastic subclusters into myeloid and lymphoid lineages. Unsupervised clustering of each using Harmony revealed 10 myeloid lineage and eight lymphoid lineage subclusters (Figure 3A, B 3 CCL3 CCL4 CCL3 CCL4 MIF LDHA 10A 27 28 FIGURE 3 ScRNA‐seq analyses of immune cells in PA and GG. Harmony aligned UMAP plots of (A) myeloid and (B) T cell subclusters. Bargraphs comparing cell proportions in (C) myeloid and (D) T cell populations between PA and GG. Heatmaps for the top significant differentially expressed genes in various (E) myeloid and (F) T cell subclusters. Each row represents a gene and each column represents a non‐neoplastic cluster. DC, dendritic cells; GG, ganglioglioma; gdt, gamma delta T cells; NKT, natural killer T cells; NK, natural killer cells; Nt, neutrophils; PA, pilocytic astrocytoma; Treg, regulatory T cells. We compared the proportion of cells in myeloid subclusters between PA and GG samples (Figure 3C, D p p Unlike in the myeloid subclusters, there was no significant difference among T cell subclusters between PA and GG (Figure 3D 10B 3B 3E, F 11 Our data revealed several myeloid and T cell subclusters that contributed to PA and GG tumor microenvironments. Interestingly, a significant difference was seen between the prevalence of major myeloid subclusters in PA and GG. To gain a better understanding of this underlying difference, we decided to study the immune signals via which these cells communicate by analyzing their secreted cytokines. 2.5   KIAA BRAF BRAF V600E scRNA sequencing analysis of our immune populations led us to hypothesize that there would be differences in the cytokine signaling from myeloid cell populations between PAs and GGs and across BRAF mutational profiles. To investigate this, we performed a broad cytokine analysis utilizing two platforms to gain a better understanding of the function that each myeloid cell subpopulation has within pLGG. We performed bulk cytokine analysis on media collected from tumor and immune cells following a short culture and compared the secretion profile between BRAF KIAA‐1549:BRAF KIAA‐1549:BRAF BRAF V600E 4A, B 12 FIGURE 4 Bulk and single cell cytokine/chemokine analyses in PA and GG. Dot plots of detected cytokines/chemokines from bulk (A) myeloid (cytokines/chemokines with concentrations greater than 1000 pg/mL) and (B) tumor (all cytokines/chemokines) cells conditioned media in PA and GG. (C) Single cell polyfunctional heatmap displaying functional cytokines/chemokines of interest secreted across myeloid cells from samples PA and GG samples with different mutational status. The heatmap is color‐coded from light to dark, based on the frequency of the polyfunctional subsets. The rows of squares correspond to the two sample groups and the columns correspond to polyfunctional group of cytokines that was expressed in at least one of the sample groups. (D) Polyfunctional activity topography principle component analysis (PAT PCA) of particular functional groups across samples with different mutational status. Each color coded dot represented a single cell from one of our two sample groups. The size of the circles corresponds to the frequency of an individual polyfunctional group (large groups = large circles, small groups = small circles), and the cytokines labeled next to it represent the cytokines present in the functional group. The principle components are labeled according to their correlation with specific cytokines. PC1 and PC2 are a combination of dominant cytokines that drive the polyfunctionality of myeloid cells. (E) Polyfunctional strength index (PSI) computed for myeloid cells at the single cell level across two sample groups with different mutational statuses. To get a better understanding of the cytokine signaling in PA and GG myeloid cells, we performed single cell cytokine analyses. To distinguish distinct polyfunctional myeloid subsets and the heterogeneity within our patient samples, we utilized a polyfunctional heatmap (Figure 4C KIAA‐1549:BRAF BRAF V600E 4C KIAA‐1549:BRAF KIAA‐1549:BRAF BRAF V600E α β α β BRAF V600E To visualize distinct polyfunctional myeloid subsets and their complex landscape, we performed a modified PCA analysis called Polyfunctional Activation Topology Principle Component Analysis (PAT PCA). In the resulting scatter plot (Figure 4D α β KIAA‐1549: BRAF BRAF V600E KIAA‐1549: BRAF BRAF V600E Finally, to quantify the collective impact of polyfunctional cells (simultaneously secreting multiple cytokines at high intensity), we used a polyfunctional strength index (PSI). PSI is defined as the percentage of polyfunctional cells within a particular sample multiplied by the average signal intensity of the cytokines that are secreted from those cells. The PSI revealed that chemokines including MIP‐1 α β BRAF V600E 4E When you look at a CellChat analysis for the CCL pathway that incorporates MIP‐1 α β 13 13 Collectively, these data suggest a complex and distinct immune phenotype between KIAA1549‐BRAF BRAF V600E 2.6 Spatial transcriptomics ( ST PA GG Both scRNA‐seq and single cell cytokine assays revealed differences in immune cell infiltration and function between PA and GG. However, single cell techniques lack spatial orientation of cells within the TME. Therefore, we performed ST analysis in both PA and GG using the Visium platform (10X genomics). This analysis was performed on five PA (UPN#946, UPN#1056, UPN#1272, UPN#1330, UPN#1453) and three GG (UPN#1181, UPN#1491, UPN#1492) snap frozen surgical sections. All PA and GG harbored BRAF fusion or BRAF V600E alterations, respectively. ST data was processed and filtered resulting in (total number of spots =14,990 (10,477 spots per PA and 4513 per GG samples)) across all samples. Sample spots were clustered with batch correction using harmony resulting in five PA and three GG clusters across the eight samples (Figure 5A, B FIGURE 5 Cytokines/chemokines have a differential distribution within TME in PA and GG. UMAP clustering of spatial transcriptomic data colored by different subclusters in (A) PA and (B) GG. Each subcluster comprises of different neoplastic and non‐neoplastic cell types. Violin plots showing the expression levels of MIP‐1 α β α β Transcriptomic profiles from each spot cluster were examined using clustree analysis of ST cluster similarity and ontological analysis of ST marker genes. Different clustering resolutions were utilized for identifying cell types present in various regions of clusters. ST showed distinct regions within PA and GG tumors consisting of both immune and tumor cell populations (Figure 5A, B 4 5 α β 5C–F 14 13 3 DISCUSSION pLGG are a heterogeneous set of tumors with varying clinical behavior and varying responses to therapy. To help gain a deeper understanding of the heterogeneity of the tumor microenvironment and the potential role immune cells may play in pLGG, we used a three pronged approach with [ 1 2 21 Previous data evaluating small populations of PA and GG assessed the tumor types independently [ 17 18 18 Our scRNA‐seq analyses revealed several immune populations. The most notable observation was the identification of a large myeloid subpopulation in our overall pLGG dataset, comprising over 50% of cells. We identified several myeloid subclusters and observed a significant difference in two distinct subclusters (chemokine‐myeloid and microglia (comp+ P2RY12+)) between PA and GG. There were a significantly higher number of cells comprising the chemokine‐myeloid subcluster in PA compared to GG and a larger microglia (comp+ P2RY12+) subcluster in GG. The chemokine‐myeloid subcluster demonstrated an increased expression of genes responsible for the immune mobilizing chemokines MIP‐1 α β Our scRNA seq data suggested cytokine signaling may be important to the overall immune function of these tumors. To evaluate the potential cytokine differences and examine the level of immune activity in our PA and GG samples, we performed bulk and single cell cytokine analyses. We observed specific chemokines such as MIP‐1 α β α 29 30 KIAA1548‐BRAF BRAF V600E As with all studies, our analysis carries some limitations. Though four PA and GG samples (#1057, #1491, #1453, and #1455) contributed the most cells to the patient sample cohort of 23, two carry BRAF V600E, and two carry BRAF fusion mutations suggesting an equal representation of mutant subgroups. A larger sample size (especially for GG subtype) resulting in a higher number of cells could provide a clearer picture of the cellular identity of our immune and tumor subclusters. Additionally, future studies of lineage analyses will be needed for a deeper understanding of the identified subclusters. Additional future studies will also focus on how not only the genetic drives of tumors, but also how the location of tumors may influence these results. Finally, future additional pathway and functional analysis will be performed to better understand the downstream impact of elevated chemokines and cytokines in our PA fusion samples and to gain a broader understanding of the biology behind and affected by these processes. Despite some of these limitations, we believe our study has expanded the critically important genomic and functional understanding needed for the role immune cells may play in the TME in the context of pLGG. In a recent study, authors investigated TME in a wide array of pediatric brain tumors, including pLGG. They demonstrated the critical importance of TME characterization alongside the driver mutation and the tumor mutation burden in how individual tumors respond to immunotherapy [ 31 4 MATERIALS AND METHODS 4.1 Sex as a biological variable Our study examined male and female patient samples, and similar findings are reported for both sexes. 4.2 Patient sample acquisition and preparation Human pLGG samples ( n 1 32 4.3  ScRNA scRNA‐seq was performed on 23 pLGG patient samples. Prior to sequencing, samples were thawed in batches and flow sorted (Astrios EQ) to obtain viable single cells based on propidium iodide (PI) exclusion. With the study goal of performing scRNA‐seq on 2000 cells per sample, we utilized a Chromium Controller in combination with Chromium Single Cell V3 Chemistry Library Kits, Gel Bead & Multiplex Kit and Chip Kit (10X Genomics). Single cells were isolated into microfluidic droplets containing oligonucleotide‐covered gel beads that capture and barcode the transcripts. Transcripts were converted to cDNA, barcoded and sequenced on Illumina NovaSeq 6000 sequencer to obtain approximately 50,000 reads per cell. 4.4  scRNA Raw sequencing reads were processed into gene‐expression matrices using Alevin (salmon version 1.3.0) with the hg38 human reference genome. The resulting count matrices were further filtered in Seurat (v.4.0.3‐4.1.1) ( https://satijalab.org/seurat/ mitochondrial genes 20 21 32 33 34 35 36 Differential expression and marker gene identification was performed using findMarkers() from the scran package (v. 1.20.1), with the block argument set to each sample to control for differences in sample compositions in each cluster. The presence of copy number variants (CNVs) was identified using inferCNV. 4.5 Cytokine/chemokine analysis Single‐cell suspensions were thawed in batches and allowed to recover for 24 h in RPMI supplemented with 10% fetal bovine serum and 1% penicillin/streptavidin (R10), at 37°C and 5% CO 2 2 6 37 11 4.6 Spatial transcriptomic analysis Frozen samples ( n 4.7 Spatial transcriptomics data analysis Sequencing data were processed with Space Ranger (10x genomics, v1.2.1), followed by further analysis in R using the Seurat tool suite. Spots were filtered to ensure the number of genes detected between 50 and 15,000, and less than 50% of UMIs mapped to mitochondrial genes. After initial SCTransform normalization on each sample and principal component analysis on merged data, sample integration was performed with Harmony (v0.1.0) using 30 principal components. UMAP dimension reduction and shared nearest neighbor clustering were carried out on 30 principal components, and clustering results at different resolution settings were explored through Clustree (v0.4.3) visualizations. 4.8 Deconvolution Bulk tumor tissue analyzed via Affymetrix array ( n GSE232316 P 4.9 Cell–cell communication analysis Single‐cell RNA sequencing (RNAseq) cell–cell communication analysis was conducted using the “CellChat” R package [ 38 p 4.10 Functional enrichment analyses Pathway analysis was performed using Metascape (ref). Single‐cell RNA sequencing (RNAseq) Gene Set Enrichment (GSEA) pathway analysis using the Bioconductor “escape” package [ 39 40 4.11 Statistical analysis All statistical analyses were performed using R and Prism (GraphPad). For all tests, statistical significance was defined as P 4.12 Study approval Human samples were collected from surgeries at Children's Hospital Colorado with IRB approval (COM‐IRB 95‐500) (Supplementary Table 1 AUTHOR CONTRIBUTIONS SZ and JML designed the project; KR, TL, and RF performed bioinformatics analyses; SZ wrote the initial manuscript; SZ, AD, and AG prepared samples for analyses; AD and AG assisted with design and interpretation of spatial transcriptomic and cytokine analyses respectively; TH and MR provided samples; KR, TL, RF, SZ, AG, AD prepared and reviewed figures; JML, TF, JG, MC, JD, JR, MG, EB, AG, AD, RV, NW, NF, KR participated in data and manuscript review and edit. FUNDING INFORMATION This study was supported by grants from the Peter Barton Family Fund for Clinical and Translational Cancer Research at The Children's Hospital Colorado Foundation, Alex's Lemonade Stand Foundation, Amazon Goes Gold for Kids with Cancer, University of Colorado Cancer Center Support Grant (P30CA046934), NIH/NCATS Colorado CTSA Grant (UM1 TR004399), Olivia Caldwell Foundation, and the Morgan Adams Foundations. CONFLICT OF INTEREST STATEMENT The authors declare no competing interests. Supporting information  Data S1.  Data S2.  Supplementary Table 1.  Supplementary Table 2:  Supplementary Table 3:  Supplementary Table 4:  Supplementary Table 5:  Supplemental Table 6: ACKNOWLEDGEMENTS The Anschutz Medical Campus Genomics Core performed single cell RNA sequencing and spatial transcriptomic analysis. The authors appreciate the contribution of Erin Smith, HTL (ASCP) CM from the Histology Shared Resource of the University of Colorado Denver. DATA AVAILABILITY STATEMENT ScRNA‐seq and ST data have been deposited in the National Center for Biotechnology Information Gene Expression Omnibus (GEO) database and are publicly accessible through GEO SuperSeries accession number GSE232316 https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE232316 REFERENCES 1 Ostrom QT de Blank PM Kruchko C Petersen CM Liao P Finlay JL Alex's lemonade stand foundation infant and childhood primary brain and central nervous system tumors diagnosed in the United States in 2007‐2011 Neuro Oncol 2015 16 Suppl 10 Suppl 10 x1 x36 25542864 10.1093/neuonc/nou327 PMC4277295 2 Jones DTW Kieran MW Bouffet E Alexandrescu S Bandopadhayay P Bornhorst M Pediatric low‐grade gliomas: next biologically driven steps Neuro Oncol 2018 20 2 160 173 29016845 10.1093/neuonc/nox141 PMC5786244 3 Ryall S Zapotocky M Fukuoka K Nobre L Guerreiro Stucklin A Bennett J Integrated molecular and clinical analysis of 1,000 pediatric low‐grade gliomas Cancer Cell 2020 37 4 569 583.e5 32289278 10.1016/j.ccell.2020.03.011 PMC7169997 4 Sambi M Bagheri L Szewczuk MR Current challenges in cancer immunotherapy: multimodal approaches to improve efficacy and patient response rates J Oncol 2019 4508794 10.1155/2019/4508794 30941175 PMC6420990 5 Zhang Y Zhang Z The history and advances in cancer immunotherapy: understanding the characteristics of tumor‐infiltrating immune cells and their therapeutic implications Cell Mol Immunol 2020 17 8 807 821 32612154 10.1038/s41423-020-0488-6 PMC7395159 6 Sampson JH Gunn MD Fecci PE Ashley DM Brain immunology and immunotherapy in brain tumours Nat Rev Cancer 2020 20 1 12 25 31806885 10.1038/s41568-019-0224-7 PMC7327710 7 Chongsathidkiet P Jackson C Koyama S Loebel F Cui X Farber SH Sequestration of T cells in bone marrow in the setting of glioblastoma and other intracranial tumors Nat Med 2018 24 9 1459 1468 30104766 10.1038/s41591-018-0135-2 PMC6129206 8 Gajewski TF Schreiber H Fu YX Innate and adaptive immune cells in the tumor microenvironment Nat Immunol 2013 14 10 1014 1022 24048123 10.1038/ni.2703 PMC4118725 9 Quail DF Joyce JA The microenvironmental landscape of brain tumors Cancer Cell 2017 31 3 326 341 28292436 10.1016/j.ccell.2017.02.009 PMC5424263 10 Fecci PE Sampson JH The current state of immunotherapy for gliomas: an eye toward the future J Neurosurg 2019 131 3 657 666 31473668 10.3171/2019.5.JNS181762 11 Griesinger AM Birks DK Donson AM Amani V Hoffman LM Waziri A Characterization of distinct immunophenotypes across pediatric brain tumor types J Immunol 2013 191 9 4880 4888 24078694 10.4049/jimmunol.1301966 PMC3827919 12 Ryall S Tabori U Hawkins C Pediatric low‐grade glioma in the era of molecular diagnostics Acta Neuropathol Commun 2020 8 1 30 32164789 10.1186/s40478-020-00902-z PMC7066826 13 Nobre L Zapotocky M Ramaswamy V Ryall S Bennett J Alderete D Outcomes of BRAF V600E pediatric gliomas treated with targeted BRAF inhibition JCO Precis Oncol 2020 4 10.1200/PO.19.00298 PMC7446502 32923898 14 Tomic TT Olausson J Wilzen A Sabel M Truve K Sjogren H A new GTF2I‐BRAF fusion mediating MAPK pathway activation in pilocytic astrocytoma PLoS One 2017 12 4 e0175638 28448514 10.1371/journal.pone.0175638 PMC5407815 15 Lind KT Chatwin HV DeSisto J Coleman P Sanford B Donson AM Novel RAF fusions in pediatric low‐grade gliomas demonstrate MAPK pathway activation J Neuropathol Exp Neurol 2021 80 12 1099 1107 34850053 10.1093/jnen/nlab110 16 Packer RJ Pfister S Bouffet E Avery R Bandopadhayay P Bornhorst M Pediatric low‐grade gliomas: implications of the biologic era Neuro Oncol 2017 19 6 750 761 27683733 10.1093/neuonc/now209 PMC5464436 17 Reitman ZJ Paolella BR Bergthold G Pelton K Becker S Jones R Mitogenic and progenitor gene programmes in single pilocytic astrocytoma cells Nat Commun 2019 10 1 3731 31427603 10.1038/s41467-019-11493-2 PMC6700116 18 Regal JA Guerra Garcia ME Jain V Chandramohan V Ashley DM Gregory SG Ganglioglioma deep transcriptomics reveals primitive neuroectoderm neural precursor‐like population Acta Neuropathol Commun 2023 11 1 50 36966348 10.1186/s40478-023-01548-3 PMC10039537 19 Jones DT Ichimura K Liu L Pearson DM Plant K Collins VP Genomic analysis of pilocytic astrocytomas at 0.97 Mb resolution shows an increasing tendency toward chromosomal copy number change with age J Neuropathol Exp Neurol 2006 65 11 1049 1058 17086101 10.1097/01.jnen.0000240465.33628.87 PMC2761618 20 Fu R Gillen AE Sheridan RM Tian C Daya M Hao Y Clustifyr: an R package for automated single‐cell RNA sequencing cluster classification F1000Res 2020 9 223 32765839 10.12688/f1000research.22969.1 PMC7383722 21 Hao Y Hao S Andersen‐Nissen E Mauck WM 3rd Zheng S Butler A Integrated analysis of multimodal single‐cell data Cell 2021 184 13 3573 3587.e29 34062119 10.1016/j.cell.2021.04.048 PMC8238499 22 Lu C Dong L Zhou H Li Q Huang G Bai SJ G‐protein‐coupled receptor Gpr17 regulates oligodendrocyte differentiation in response to Lysolecithin‐induced demyelination Sci Rep 2018 8 1 4502 29540737 10.1038/s41598-018-22452-0 PMC5852120 23 van Noort JM Bsibsi M Gerritsen WH van der Valk P Bajramovic JJ Steinman L Alphab‐crystallin is a target for adaptive immune responses and a trigger of innate responses in preactive multiple sclerosis lesions J Neuropathol Exp Neurol 2010 69 7 694 703 20535035 10.1097/NEN.0b013e3181e4939c 24 Roa BB Garcia CA Lupski JR Charcot‐Marie‐tooth disease type 1A: molecular mechanisms of gene dosage and point mutation underlying a common inherited peripheral neuropathy Int J Neurol 1991 25‐26 97 107 11980069 25 Tasharrofi B Ghafouri‐Fard S Long non‐coding RNAs as regulators of the mitogen‐activated protein kinase (MAPK) pathway in cancer Klin Onkol 2018 31 2 95 102 29708351 10.14735/amko201895 26 Cheng A Jia W Kawahata I Fukunaga K A novel fatty acid‐binding protein 5 and 7 inhibitor ameliorates oligodendrocyte injury in multiple sclerosis mouse models EBioMedicine 2021 72 103582 34624687 10.1016/j.ebiom.2021.103582 PMC8502714 27 Guimaraes GR Maklouf GR Teixeira CE de Oliveira Santos L Tessarollo NG de Toledo NE Single‐cell resolution characterization of myeloid‐derived cell states with implication in cancer outcome Nat Commun 2024 15 1 5694 38972873 10.1038/s41467-024-49916-4 PMC11228020 28 Azizi E Carr AJ Plitas G Cornish AE Konopacki C Prabhakaran S Single‐cell map of diverse immune phenotypes in the breast tumor microenvironment Cell 2018 174 5 1293 1308.e36 29961579 10.1016/j.cell.2018.05.060 PMC6348010 29 Schaller TH Batich KA Suryadevara CM Desai R Sampson JH Chemokines as adjuvants for immunotherapy: implications for immune activation with CCL3 Expert Rev Clin Immunol 2017 13 11 1049 1060 28965431 10.1080/1744666X.2017.1384313 PMC6020048 30 Ogino H Taylor JW Nejo T Gibson D Watchmaker PB Okada K Randomized trial of neoadjuvant vaccination with tumor‐cell lysate induces T cell response in low‐grade gliomas J Clin Invest 2022 132 3 e151239 34882581 10.1172/JCI151239 PMC8803342 31 Levine AB Nobre L Das A Milos S Bianchi V Johnson M Immuno‐oncologic profiling of pediatric brain tumors reveals major clinical significance of the tumor immune microenvironment Nat Commun 2024 15 1 5790 38987542 10.1038/s41467-024-49595-1 PMC11237052 32 Gillen AE Riemondy KA Amani V Griesinger AM Gilani A Venkataraman S Single‐cell RNA sequencing of childhood Ependymoma reveals neoplastic cell subpopulations that impact molecular classification and etiology Cell Rep 2020 32 6 108023 32783945 10.1016/j.celrep.2020.108023 PMC7452755 33 Riemondy KA Venkataraman S Willard N Nellan A Sanford B Griesinger AM Neoplastic and immune single‐cell transcriptomics define subgroup‐specific intra‐tumoral heterogeneity of childhood medulloblastoma Neuro Oncol 2022 24 2 273 286 34077540 10.1093/neuonc/noab135 PMC8804892 34 Nowakowski TJ Bhaduri A Pollen AA Alvarado B Mostajo‐Radji MA Di Lullo E Spatiotemporal gene expression trajectories reveal developmental hierarchies of the human cortex Science 2017 358 6368 1318 1323 29217575 10.1126/science.aap8809 PMC5991609 35 Aldinger KA Thomson Z Phelps IG Haldipur P Deng M Timms AE Spatial and cell type transcriptional landscape of human cerebellar development Nat Neurosci 2021 24 8 1163 1175 34140698 10.1038/s41593-021-00872-y PMC8338761 36 Bakken TE Jorstad NL Hu Q Lake BB Tian W Kalmbach BE Comparative cellular analysis of motor cortex in human, marmoset and mouse Nature 2021 598 7879 111 119 34616062 10.1038/s41586-021-03465-8 PMC8494640 37 Griesinger AM Josephson RJ Donson AM Mulcahy Levy JM Amani V Birks DK Interleukin‐6/STAT3 pathway signaling drives an inflammatory phenotype in group a ependymoma Cancer Immunol Res 2015 3 10 1165 1174 25968456 10.1158/2326-6066.CIR-15-0061 PMC4596749 38 Jin S Guerrero‐Juarez CF Zhang L Chang I Ramos R Kuan CH Inference and analysis of cell‐cell communication using CellChat Nat Commun 2021 12 1 1088 33597522 10.1038/s41467-021-21246-9 PMC7889871 39 Borcherding N Vishwakarma A Voigt AP Bellizzi A Kaplan J Nepple K Mapping the immune environment in clear cell renal carcinoma by single‐cell genomics Commun Biol 2021 4 1 122 33504936 10.1038/s42003-020-01625-6 PMC7840906 40 Lun AT McCarthy DJ Marioni JC A step‐by‐step workflow for low‐level analysis of single‐cell RNA‐seq data with Bioconductor F1000Res 2016 5 2122 27909575 10.12688/f1000research.9501.1 PMC5112579 ",
  "metadata": {
    "Title of this paper": "A step‐by‐step workflow for low‐level analysis of single‐cell RNA‐seq data with Bioconductor",
    "Journal it was published in:": "Brain Pathology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488260/"
  }
}