{
  "title": "Paper_508",
  "abstract": "pmc Clin Epigenetics Clin Epigenetics 1699 clinepig Clinical Epigenetics 1868-7075 1868-7083 BMC PMC12481779 PMC12481779.1 12481779 12481779 41024270 10.1186/s13148-025-01978-x 1978 1 Review The OGG1 Ser326Cys polymorphism: molecular mechanisms of disease susceptibility and precision medicine applications Wang XueJian Li Bo Gao JingYa Wang Kun wangk696@qdu.edu.cn Yang SuMin SMinYangFY@126.com https://ror.org/021cj6z65 grid.410645.2 0000 0001 0455 0905 Department of Cardiovascular Surgery, Institute of Chronic Diseases, The Affiliated Hospital of Qingdao University, College of Medicine, Qingdao University, 29 9 2025 2025 17 478173 153 8 7 2025 7 9 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ DNA molecules are susceptible to reactive oxygen species (ROS) attack leading to oxidative damage, of which 8-oxoguanine (8-oxoG) is a core oxidative marker. OGG1 acts as a DNA repair enzyme and maintains genomic stability by specifically repairing 8-oxoG through the base excision repair (BER) pathway. The Ser326Cys polymorphism significantly reduces enzyme activity and potentially impacts phosphorylation-mediated subcellular localization dynamics and epigenetic regulatory networks, thereby potentially exacerbating genomic instability. In this review, we analyzed the association between the OGG1 Ser326Cys polymorphism and different diseases, such as risk, platinum-based chemotherapy sensitivity, and radiotherapy toxicity in cancer. In neurodegenerative disorders, the Cys326 type leads to the accumulation of 8-oxoG in neurons and accelerates CAG triplet repeat amplification. In metabolic disorders, its insufficient repair may trigger β-cell dysfunction, which increases the risk of type 2 diabetes mellitus. Finally, we integrated multiomics data and proposed a genotype-based precision intervention strategy to provide a theoretical basis for disease risk prediction, personalized therapy, and novel targeted drug development. Keywords OGG1 Ser326Cys 8-Oxoguanine Personalized therapy BER https://doi.org/10.13039/501100001809 National Natural Science Foundation of China 82370291 Wang Kun pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction DNA molecules are particularly sensitive to attack by reactive oxygen species (ROS) free radicals, which can lead to oxidative DNA damage, and among the many oxidative DNA damages, 8-oxoguanine (8-oxoG) is the most common as the final oxidation product, making 8-oxoG also an important DNA oxidation marker [ 1 2 3 It has been found that the Substitution of serine at 326 by cysteine may affect the enzymatic activity of OGG1 proteins and reduce the ability to repair 8-oxoG and DNA damages. The 8-oxoG repair activity of OGG1 containing Ser326 (C) is sevenfold higher than that of OGG1 containing Cys326 (G) [ 4 5 6 5 7 8 9 10 Polymorphisms of OGG1 gene are closely related to human diseases, and the study of OGG1 gene polymorphisms can lead to a better understanding of the mechanisms of diseases, thus providing new ideas and methods for the diagnosis, treatment as well as prevention of diseases. For example, the repair capacity caused by OGG1 gene polymorphism can be compensated by using OGG1 agonists [ 11 Structure and function of the OGG1 gene Although the role of polymorphisms in OGG1 in disease has received widespread attention, the molecular basis of its functional differences still needs to be systematically analyzed. hOGG1’s unique structural features and dynamic repair mechanisms provide key entry points for understanding the pathological effects caused by polymorphisms. hOGG1 is located in the 3p25 region of the chromosome and consists of eight exons, with the start codon (ATG) and the stop codon (TAG) sequences located in exons 1 and 7, respectively [ 2 12 2 13 14 Under normal physiological conditions, when binding to the target DNA, both of them have high activity and can repair damaged DNA through the mechanism of BER, which is as follows: OGG1 slides down the DNA double-stranded helix, and when it recognizes the 8-oxoG in the process of sliding, it will reduce the sliding speed, and then it will extend the amino acid probe and insert it into DNA double-stranded chain, so that the DNA backbone is twisted by nearly 70°. Under the force of this distortion, the damaged nucleotide is pushed out from the interior of the DNA helix. Then, the base pair is placed in the active site pocket of OGG1. This process is metaphorically described as “pinch, push, pull, and insert.” The Cys326 mutation may disrupt this kinetic process due to a phosphorylation disorder [ 15 16 1 Fig. 1 The effects of 8-oxoG and OGG1 on DNA repair. Oxidative stress causes DNA damage and 8-oxoG is the final oxidation product. Since 8-oxoG differs from normal guanine in that C8 contains oxygen rather than hydrogen and N7 is hydrogen rather than an electron pair, it leads to differences in replication, from C:8-OXOG to 8-OXOG:A to A:T. Upon recognition, OGG1 triggers a bend in the DNA that extrudes the damaged nucleotide from the inside of the DNA helix, and then puts a base pair in the pocket of the OGG1 active site. The base pair is then placed into the pocket of the OGG1 active site. OGG1 then cuts the base, which is repaired by APE1 to form a hydroxyl group, and subsequently restores the site to correct alignment by DNA polymerase and ligase Remarkably, the DNA repair protein OGG1 plays a dual function in maintaining genomic stability: It not only relies on its classical base excision activity, but also influences genomic stability through a dynamic epigenetic regulatory network. This repair-epigenetic coupling mechanism provides a novel perspective for understanding the pathogenic effects of polymorphisms [ 17 18 23 13 24 26 27 At the chromatin level, the repair efficacy of OGG1 is itself finely regulated by epigenetic modifications: Acetylation modifications such as histone H3K9ac and H4K16ac promote the proximity of OGG1 to the damage site by relaxing the chromatin structure, which can enhance the recognition efficiency of OGG1 for 8-oxoG. CDK4-mediated phosphorylation of Ser326 leads to an increase in its 8-oxoG resection activity, while c-Abl-mediated phosphorylation of Tyr122 limited its function through nucleoplasmic shuttling [ 28 29 30 Association of OGG1 gene polymorphisms with disease As mentioned earlier, the OGG1 Ser326Cys polymorphism results in a significant reduction in the 8-oxoG repair activity of the protein encoded by the Cys326 allele. The clinical significance of this defect in intrinsic DNA repair capacity lies in its strong gene–environment interaction with diverse environmental exposure factors. These environmental factors include both exogenous exposures (such as tobacco smoke dietary components [e.g., red meat, vegetables, alcohol], carcinogens, and therapeutic drugs [e.g., platinum-based chemotherapy]) and endogenous states. The OGG1 Ser326Cys polymorphism profoundly modulates individual susceptibility to and disease progression of multiple conditions: When exposed to synergistic risk factors, Cys326 carriers (especially homozygotes) exhibit significantly amplified risks of cancers (such as lung cancer, colorectal cancer, and breast cancer), neurodegenerative diseases (such as Huntington's disease), type 2 diabetes, cardiovascular disease, male infertility, and autoimmune diseases are significantly amplified; under specific treatment contexts (such as platinum-based chemotherapy), this polymorphism may also influence tumor cell sensitivity and treatment-related toxicity]. The following sections will systematically elucidate how the OGG1 Ser326Cys polymorphism shapes distinct clinical outcomes in specific diseases [ 5 8 10 31 37 1 Table 1 Meta-analysis of Ser326Cys cancer risk Cancer type Author, year Population Number of controls and cases OR (Cys/Cys vs. Ser/Ser) 95% CI heterogeneity Lung Lee et al. [ 38 Caucasian 4255/4892 1.12 0.85–1.47 I 2 P Asian 1514 /2120 1.18 1.01–1.38 I 2 P Zhou et al. [ 3 Caucasian 3475/5106 1.36 0.88–2.11 I 2 P Asian 5653 /5792 1.15 0.98–1.35 I 2 P CRC Pardini et al. [ 35 Caucasian 20/28 1.43 0.79–2.59 P Jacek et al. [ 39 Polish 13/20 0.939 0.586–1.505 P BC Suleeporn et al. [ 34 Asian 425/507 1.42 0.97–2.09 P Postmenopausal women 180/239 2.05 1.14–3.69 P UADT and GI Sambuddha Das et al. [ 6 Caucasian 4372/ 5427 1.40 0.97–2.03 I 2 P Asian 1161/ 1407 1.56 1.21–2.01 I 2 P BC Mittal et al. [ 4 North India 17/27 2.10 1.08–4.09 P Diabetes Daimon et al. [ 8 Japanese 90/894 1.41 1.03–1.92 P Das et al. [ 40 Asian 5/10 1.63 0.30–8.88 P CAG Corella et al. [ 32 Caucasian 23/279 3.31 1.68–6.53 0.001 Sterility Ji et al. [ 5 Chinese 123/255 1.73 1.23–2.44 P Cancer Lung cancer In a prospective study, reduced OGG1 enzyme activity was observed in peripheral blood mononuclear cells from lung cancer patients. mRNA levels of OGG1 interacted with the OGG1 Ser326Cys polymorphism and lung cancer risk. Specifically, in subjects with the Ser236 genotype, mRNA content levels were virtually unchanged, whereas in carriers of the Cys326 genotype, mRNA levels were significantly correlated with lung cancer risk, presumably due to amino acid substitutions that reduced the enzyme's repair capacity [ 37 37 2 41 42 3 43 Fig. 2 Expression of OGG1 gene polymorphism in different cancer. A B C Fig. 3 Bidirectional role of OGG1 polymorphisms in platinum-based chemotherapy. A B In normal cells, BER capacity elevates the risk of cancer progression, increases tissue radiosensitivity and may produce greater radiotoxicity [ 44 45 41 3 Breast cancer The oncogenic mechanism of OGG1 polymorphisms in lung cancer highlights the central role of defective oxidative repair. Similarly, in breast cancer, where estrogen metabolism is active, this repair defect synergistically amplifies with hormone-driven oxidative stress. Breast cancer, one of the most prevalent types of cancer in women worldwide and the second leading cause of cancer-related deaths [ 46 47 34 48 49 2 Triple-negative breast cancer (TNBC) characterized by negative expression of estrogen receptor (ER), progesterone receptor (PR), and human epidermal growth factor (HER-2) [ 50 47 51 52 53 Colorectal cancer The pathogenesis of colorectal cancer (CRC) is complex, involving multiple aspects of race, environmental factors, and interactions between genes and the environment [ 54 39 35 31 In terms of treatment, most patients are diagnosed with locally advanced disease, and multimodal therapy combining radiotherapy, chemotherapy, and surgery has become the standard of care for such patients. Especially for resectable tumors in the middle and lower third of the rectum, neoadjuvant radiotherapy or radiochemotherapy plus total mesenteric excision (TME) has become the standard of care [ 55 56 2 57 58 Liver cancer It has been found that the OGG1 Ser326Cys polymorphism is not strongly associated with some cancers. For example, in hepatocellular carcinoma, the Cys326 genotype in OGG1 Ser326Cys was found to have a high recurrence rate and a low survival rate. A significant dose effect on the risk of hepatocellular carcinoma in carriers of the Cys326 allele was shown by a case-control study in a Chinese population [ 24 2 28 Prostate cancer Further, prostate cancer (PC) is one of the leading causes of death in the West, and DNA repair defects increase the risk of oncogenic DNA damage events, playing a role in the age-related increase in PC risk [ 59 4 60 61 63 Neurodegenerative disease In addition to malignant tumors, the effects of OGG1 polymorphisms on genomic stability are also evident in terminally differentiated cells. Accumulated 8-oxoG damage in neurons triggers a vicious cycle of neurodegeneration due to reduced repair efficiency. Huntington's chorea (HD) is a progressive neurodegenerative disease that leads to cognitive impairment, choreiform movements, and death, usually occurring 15–20 years after the onset of symptoms. In normal populations, the number of CAG repeats remains below 35, whereas in patients with HD, the number of CAG repeats ranges from 35 to more than 100, resulting in amplification of polyglutamine fragments in the protein [ 64 65 36 4 65 Fig. 4 OGG1Ser326Cys association with neurodegenerative diseases and diabetes. A B C In other neurodegenerative diseases, such as Alzheimer's disease (AD), OGG1 also has an impact. Oxidative damage accumulates in the brain tissue of AD patients, which may contribute to an individual's susceptibility to disease or disease progression [ 66 67 67 68 Diabetes Diabetes is a chronic disease that occurs when the pancreas does not produce enough insulin or the body is unable to effectively utilize the insulin it produces [ 69 70 71 8 4 72 73 In general, when insulin resistance is increased, a compensatory increase in insulin secretion occurs at the same time to maintain plasma glucose levels within the normal range. In subjects genotyped Ser/Ser, insulin resistance is increased in gastrointestinal subjects assessed by HOMA-α and insulin secretion appears to increase as expected when assessed by HOMA-β. However, in subjects with genotype Ser/Cys + Cys/Cys, HOMA-β was decreased in GI subjects although HOMA-α was also increased [ 8 40 4 Cardiovascular disease Cardiovascular disease (CVD) is a term used to describe many heart diseases. It can refer to several conditions: coronary heart disease (CHD), peripheral arterial disease, cerebrovascular disease, rheumatic and congenital heart disease, and venous thromboembolism [ 74 75 76 32 77 32 Infertility Differences in Ser326 and Cys326 DNA repair activity also have implications for sperm quality. Infertility is a common reproductive disorder, with male factor accounting for 40–50% of all infertility cases [ 78 5 79 Autoimmune diseases Rheumatoid arthritis (RA) is a chronic autoimmune disease that can lead to deformities and severe disability due to irreversible damage to tendons, joints, and bones [ 80 81 82 Gene–environment Interactions The interaction between the OGG1 Ser326Cys polymorphism and environmental exposure significantly amplifies disease risk, and this effect is genotype-specific. Numerous studies have shown that individuals carrying the Cys allele with reduced repair activity (particularly Cys/Cys homozygotes) are more sensitive to oxidative damage induced by specific environmental factors, and their disease risk significantly increases upon exposure [ 5 At the level of carcinogen exposure, the Cys326/Cys326 genotype synergistically drives genomic instability with smoking: The Cys genotype reduces OGG1 repair function, while smoking induces ROS production, and the two synergistically lead to the accumulation of 8-OHdG. Studies have shown that among heavy smokers, the risk of infertility in individuals carrying the Cys allele (Ser/Cys + Cys/Cys) is 2.32 times higher than in the wild-type Ser/Ser genotype, significantly higher than in moderate smokers (1.75 times), suggesting that the higher the smoking dose, the stronger the harmful effects of the genotype [ 5 P 35 Dietary factors exhibit bidirectional regulatory effects: High red meat intake (> 500 g/week) increases CRC risk by 1.8-fold in European populations through heme iron-mediated colonic lumen·OH radical bursts [ 31 P P 32 10 Other important polymorphisms of the OGG1 gene Ser326Cys is currently the most extensively studied and relatively well-documented OGG1 gene locus. However, research indicates that the OGG1 gene exhibits widespread genetic variation. These variations are distributed across different functional regions of the gene, including the promoter region, intron region, and coding region, and may influence OGG1 function through various potential molecular mechanisms [ 80 83 84 2 Table 2 Other clinically relevant OGG1 gene variants Polymorphism Disease association Functional impact References 11657A/G CRC breast cancer 1. Patients with G allele (A/G + G/G) in stages 0 + I + II showed a 41% lower risk of CRC 2. Patients with high BMI: The risk of 11,657 A/G variant allele carriers (GA + GG) is increased [ 84 85 rs2072668 AD The GG genotype was less frequent in patients with Ki-67 positivity (a cell proliferation marker). This suggests that this genotype may be associated with lower tumor proliferation activity and better prognosis [ 86 A53T AD The binding ability of A53T protein to DNA substrates was reduced [ 67 A288V AD The activity of A288V protein lyase decreased rs159153(C-285 T) RA This locus is located in the gene promoter region and may have a weak effect on OGG1 expression [ 80 rs3219008(A5954G) RA The mechanism is that AG reduces OGG1, the ability to repair oxidized DNA damage, leading to the accumulation of 8-oxoG, which in turn exacerbates synovitis and joint damage by activating inflammatory signaling pathways (such as NF-κB), increasing RA susceptibility 7143A/G Breast cancer Obesity increases oxidative stress through adipose tissue estrogen synthesis and chronic inflammation; the 7143A/G mutation may affect OGG1 expression or function (although the function is unknown), and synergistically increase the risk with high BMI [ 84 rs2304277 ARC Ogg1-rs2304277 alone does not affect ARC risk, but when it cooperates with SNPs of other DNA repair genes (such as WRN), it may exacerbate oxidative damage in lens epithelial cells by weakening the overall DNA repair efficiency, and ultimately promote lens opacity and ARC occurrence [ 87 rs2072668 Breast cancer In young breast cancer patients under 48 years old, the frequency of GG genotype was significantly higher than in the control group. For estrogen receptor-negative (ER⁻) breast cancer patients, the GG genotype at rs2072668 showed a significantly elevated risk, likely due to its alteration of hOGG1's repair efficiency. This leads to the accumulation of oxidized DNA damage, thereby promoting tumor development [ 83 rs2075747 Breast cancer In young breast cancer patients aged ≤ 48 years and ER-negative breast cancer patients, both the GA genotype, AA genotype, and GA + AA genotype demonstrated protective effects. The mechanism involves rs2075747 indirectly regulating hOGG1 expression or function by influencing gene transcription, mRNA splicing, or stability. This enhances hOGG1's repair efficiency and reduces the accumulation of oxidative DNA damage Potential applications of OGG1 gene polymorphisms in disease prevention and treatment Prevention The OGG1 Ser326Cys polymorphism plays an important role in the onset and progression of various diseases [ 88 89 90 91 5 Fig. 5 Strategies of OGG1 gene polymorphism in disease prevention and treatment. OGG1 Ser326Cys gene polymorphism is a high-risk disease biomarker, and its pathogenicity, together with environmental exposures such as smoking and alcohol consumption and population genetic background, constitutes a multifactorial risk system. For patients with the Cys/Cys genotype, clinical preference can be given to antiangiogenic drugs or immune checkpoint inhibitors, followed by precision editing of the OGG1 gene or screening of chemo-sensitivity regulatory genes in combination with CRISPR technology and targeted sgRNA design. Single-cell sequencing can resolve the expression differences and functional heterogeneity of this polymorphism at the cellular level For example, using the median hOGG1 expression level (3.61) as a cutoff, patients were divided into a high-expression group (≥ 3.61) and a low-expression group (< 3.61): The 1-year, 2-year, and 3-year survival rates (87.91%, 70.33%, and 63.74%) in the low-expression group were significantly higher than those in the high-expression group (79.12%, 56.04%, and 43.96%, P 92 Given that OGG1 polymorphisms (particularly Ser326Cys) have been shown to have potential as cancer risk predictors and are not independent carcinogenic factors but rather amplify disease risk through significant interactive effects with specific environmental exposures (such as smoking, occupational pesticide/nicotine exposure). This makes it an ideal target for risk stratification and precision prevention. Identifying high-risk populations (such as smokers and those with specific occupational exposures) and conducting OGG1 genotyping is the first step in implementing precision strategies [ 93 P P 93 p 93 To more accurately identify individuals at highest risk due to gene–environment interactions, it is necessary to integrate OGG1 genotypes with other risk factors (such as ethnicity and age) to construct a comprehensive risk prediction model. For example, OGG1 polymorphisms (GG vs. CC genotypes) may simultaneously increase cancer risk in Asian (OR ≈ 1.56) and Caucasian populations (OR ≈ 1.40), but the strength of this effect varies by ethnicity; age itself is also a significant risk factor (OR 1.12, P P 6 5 Mature and reliable OGG1 gene polymorphism detection techniques (such as PCR-RFLP, gene sequencing) can accurately locate the polymorphic sites and provide a basis for identifying high-risk individuals [ 93 94 95 P 96 5 Treatment Based on the efficacy of the aforementioned biomarkers, targeted therapeutic strategies targeting OGG1 polymorphisms have become an inevitable choice. CRISPR technology provides a powerful tool for validating the functional mechanisms of OGG1 polymorphisms in preclinical models, thereby advancing our understanding of OGG1 polymorphisms and laying the groundwork for designing therapeutic interventions. By designing targeted sgRNA (small guide RNA) combined with homologous directed repair (HDR) templates, precise editing of the OGG1 Ser326Cys site can be achieved, confirming that Cys326 leads to reduced 8-oxoG repair efficiency and increased genomic instability [ 89 97 98 99 100 5 Based on the identification of therapeutic targets, integrating genotype information into clinical decision-making has become a key challenge. By constructing multiomics-driven models, precision treatment for patients can be achieved. Single-cell multiomics reveal expression differences and functional heterogeneity of OGG1 gene polymorphisms across different cell types. In lung cancer tissues, OGG1-Cys326 activates oxidative damage genes (HMOX1/NQO1) in lung cancer alveolar epithelial cells and promotes inflammation (NF-κB) in immune cell [ 101 102 103 89 104 105 5 Based on the aforementioned multiomics technology, the most suitable treatment methods are formulated for patients based on their genes, environment, and lifestyle. For patients carrying specific OGG1 gene polymorphisms, selecting appropriate drugs and dosages can effectively reduce the incidence of drug toxicity and side effects and improve the effectiveness of drug treatment. For example, OGG1 polymorphisms influence chemotherapy sensitivity. Platinum-based drugs (such as cisplatin and carboplatin) exert their antitumor effects by inducing interstrand crosslinks in DNA, which destabilize the DNA double helix, block replication, and inhibit transcription. Defects in OGG1 function may enhance tumor cell sensitivity to platinum-based drugs [ 106 Su et al. studied 610 patients with primary NSCLC (median age 60.3 years) and found that patients carrying the variant G allele (CG + GG genotype) had significantly poorer overall survival (OS) (unadjusted HR 1.57, 95% CI 1.05–2.35, P 103 P P 33 P P 33 Based on the aforementioned mechanisms and clinical evidence, the following precision intervention strategies targeting the OGG1 Ser326Cys polymorphism can be developed: For patients carrying the Cys allele: Due to their relatively weaker DNA repair capacity, they are more sensitive to DNA damage induced by platinum-based drugs and are expected to have a higher treatment response rate and longer PFS (such as longer PFS in the CC genotype in Yu's study), with a lower risk of gastrointestinal toxicity. Prioritize platinum-based combination chemotherapy regimens (such as cisplatin combined with pemetrexed). Given their higher sensitivity, consider appropriately reducing the dose of platinum-based drugs to maintain efficacy while further reducing the risk of cumulative toxicity. For patients with the CC genotype: Due to their stronger DNA repair capacity, they may have relatively lower sensitivity to platinum monotherapy, with shorter expected PFS (such as shorter PFS in the CG genotype in the Yu study), and may require more intensive treatment regimens to achieve optimal outcomes. To overcome their strong repair capacity, it may be necessary to increase the intensity of platinum-based drug doses (within tolerable limits). Additionally, consideration should be given to combining with other DNA-damaging agents with synergistic mechanisms of action, such as the antimetabolite gemcitabine (by inhibiting DNA synthesis and enhancing the formation of platinum-DNA adducts) or taxane agents (by stabilizing microtubules), to maximize DNA damage effects and improve efficacy [ 103 107 108 Within the framework of precision therapy based on the OGG1 genotype, implementing dynamic dose adjustment is a key strategy for optimizing efficacy and safety. This can be achieved by integrating pharmacogenomics models to precisely calculate individualized dosing regimens. The theoretical basis for this strategy stems from the significant amplification of functional differences in the OGG1 Ser326Cys polymorphism under specific tumor microenvironment stresses. For example, the antiangiogenic drug bevacizumab inhibits the VEGF signaling pathway, reducing tumor angiogenesis and leading to hypoxia in the tumor microenvironment. Hypoxia can induce oxidative stress, significantly increasing levels of ROS and NO [ 109 110 P 111 112 113 Dynamic dose adjustment based on OGG1 genotype is critical—pharmacogenomics models can be used to precisely calculate individualized dosing. Bevacizumab reduces tumor angiogenesis by inhibiting the VEGF pathway, leading to hypoxia in the tumor microenvironment and inducing oxidative stress, resulting in elevated ROS/NO levels [ 109 P 110 111 5 The integration of OGG1 gene polymorphism and environmental factors contributes to disease prevention and risk assessment. Oxidative DNA damage can be caused by ROS, and environmental factors such as smoking and environmental pollution may increase oxidative stress, which in turn affects the function of the OGG1 gene. Understanding the interactions between OGG1 gene polymorphisms and environmental factors can lead to early intervention and prevention in high-risk populations [ 6 Outlook and discussion The OGG1 Ser326Cys polymorphism and human diseases have multiple associations. It plays an important role in complex diseases such as cancer, neurodegenerative diseases, and diabetes by affecting dynamic repair mechanisms. This review integrates multiomics data with molecular mechanism studies to reveal the multidimensional role of this polymorphism in genomic stability and disease susceptibility, and explores its translational potential in precision medicine. Molecular mechanisms of OGG1 functional defects and disease susceptibility OGG1 forms the Ser326Cys polymorphism due to the frequent Substitution of Ser by Cys at position 1245 in exon 7. Its central pathological effect stems from significant differences in its enzymatic activity, leading to impaired repair kinetics, especially under oxidative stress, where its 8-oxoG excision activity is reduced by about sevenfold compared to the Ser326 type [ 4 14 Disease association: environmental interactions and racial heterogeneity Currently, there is no specific explanation for the difference in increasing cancer risk between Asian and Caucasian populations for OGG1 polymorphisms, which now tends to support that it is due to differences in dietary environment. However, the existing evidence is highly concentrated in Asian and Caucasian populations, and the conclusions may not apply to individuals of other ancestral backgrounds (such as those of African descent). In CRC, Cys326 type leads to 8-oxoG accumulation due to repair defects, driving chronic inflammation and malignant transformation. The risk of cancer is 1.56-fold higher in Asian populations with the GG genotype compared to the CC type, which may be associated with the interaction of genetic background and environmental exposures (smoking, red meat intake) [ 6 31 114 115 116 117 Of the various lifestyle factors, smoking may provide the strongest environment for the generation of oxygen free radicals. A series of studies have shown that smokers have increased oxidative DNA damage compared to non-smokers. There is a significant association in lung cancer, but the current findings suggest that oxygen radicals produced by tobacco smoke may be associated with colon carcinogenesis, although the role may be limited [ 31 118 There was a statistically significant interaction between OGG1 polymorphisms and dietary intake of vegetables, with a 54% reduction in lung cancer risk for every 50% increase in vegetable intake in Cys-only carriers, and no reduction in risk in Ser326 carriers. The same trend was seen for fruit intake in Ser or Ser326Cys. However, current research focuses on data and lacks a specific mechanism by which vegetables and fruits reduce the risk of disease. OGG1 as a therapeutic target: small-molecule activators Given the role of OGG1 functional defects (such as those associated with the Ser326Cys polymorphism) in the pathogenesis of various diseases, strategies to enhance its repair activity hold potential therapeutic value. In recent years, the discovery of small-molecule compounds that can specifically activate OGG1 has brought new hope to this field. These activators are designed to improve OGG1’s efficiency in recognizing and excising 8-oxoG. For example, Benitéz-Buelga et al. synthesized two small-molecule activators, TH12117 and TH10785, for use as organic catalysts. TH12117, as an organic catalyst, mimics the excised 8-oxoG, replacing the excised base and interacting with the same amino acid residue. It initiates a β-elimination event, releasing the Lys249 residue and enabling OGG1 to begin a new catalytic cycle [ 11 100 This discovery not only demonstrates the feasibility of pharmacologically regulating OGG1 activity but, more importantly, reveals a previously unknown pathway for enhancing DNA base excision repair [ 100 119 These findings support the use of small-molecule OGG1 activators as a potential strategy to compensate for reduced repair capacity caused by OGG1 gene polymorphisms, thereby potentially reducing the risk of related diseases or slowing their progression. Notably, small-molecule OGG1 activators enhanced the activity of the functionally impaired OGG1 Ser326Cys variant associated with Alzheimer’s disease and all-cause mortality [ 32 120 Although this field holds great promise, the development of OGG1 activators remains in its early stages. Future research must thoroughly explore their in vivo efficacy, specificity, long-term safety, and therapeutic effects in different genetic backgrounds (such as carriers of Ser326Cys or other OGG1 variants). In-depth investigation of these issues will determine the feasibility of translating such strategies into clinical interventions. Limitations of existing research and future directions There are several key limitations to current research: (1) Most epidemiologic studies have not controlled for epigenetic confounders (such as age of DNA methylation), (2) lack of validation in large-scale cohorts across ethnicities, with a serious dearth of data from African populations in particular, (3) uncertainty as to the role of OGG1 polymorphisms in disease progression and how they may specifically affect disease treatment. Future research needs to break through three key directions: (1) Analyze the genetic background of the Ser326Cys polymorphism in different ethnic populations. (2) Clarify the mapping of the polymorphism's regulation of disease phenotypes through DNA methylation, histone modification, and non-coding RNA networks. (3) Develop precise genotype-based interventional strategies, including the design of Cys326-type specific activators to restore the phosphorylation function, or the use of HDAC inhibitors to enhance the sensitivity of OGG1-deficient cells to chemotherapy. In addition, for autoimmune diseases and CVDs with few current studies, it provides a new perspective to expand the disease association spectrum. In conclusion, in-depth study of OGG1 gene polymorphisms, as a core node connecting genetic susceptibility, molecular repair mechanisms, and environmental exposure, will provide a solid scientific foundation for the integrated “prevention–diagnosis–treatment” strategy in precision medicine. Conclusion The Ser326Cys polymorphism in the OGG1 gene, a key genetic variant in the DNA oxidative damage repair pathway, systematically destabilizes the genome by decreasing 8-oxoG excision efficiency. At the molecular-functional level, this polymorphism not only directly impairs the 8-oxoG excision activity of OGG1, but also significantly affects its subcellular distribution dynamics-Ser326-type OGG1 is retained longer in the insoluble fraction of the nucleus and is more accurately localized to the nucleolus in the S phase through phosphorylation-mediated localization, whereas the Cys326 type has a reduced efficiency of repair site recruitment due to impaired phosphorylation [ 14 16 28 In terms of disease association, the Ser326Cys polymorphism is a key genetic regulatory hub for complex diseases such as cancer, neurodegenerative diseases, metabolic syndrome, and reproductive disorders through a multidimensional molecular mechanism that significantly affects the ability to repair oxidative damage, and exhibits significant disease susceptibility differences and racial heterogeneity. In the field of cancer, this polymorphism has become an important risk factor for various malignant tumors such as lung, breast, and CRC through the triple mechanism of “defective repair-accumulation of oxidative damage-epigenetic reprogramming”: In Asian populations, the risk of cancer is 1.56-fold higher in the GG homozygous genotype (Cys/Cys) compared with the CC wild-type (Ser/Ser), especially in gastrointestinal and upper respiratory tract cancers, the risk of the pure genotype model reaches 1.36-fold and 1.74-fold, respectively [ 6 39 45 In neurodegenerative diseases, defective OGG1 function accelerates the disease process through the mechanism of “oxidative damage-insufficient repair-repetitive sequence amplification.” In HD model, Cys326 type leads to the accumulation of 8-oxoG in neurons, which induces the somatic amplification of CAG repeat sequences, thus advancing the onset of the disease; in metabolic diseases Such as type 2 diabetes mellitus, due to the insufficient repair of oxidative stress in β-cells, the function of insulin secretion of Cys326 type is reduced by 25–30% compared with that of wild-type. The HOMA-IR insulin resistance index was significantly elevated, and the risk of disease was increased in those with homozygous genotypes [ 8 32 In the field of translational medicine, OGG1 polymorphisms have demonstrated dual potential as biomarkers: They can be used as early screening indicators for cancer, such as the positive correlation between GGG1 transcription levels and Cys allele dosage in peripheral blood mononuclear cells of lung cancer patients, and also predict chemotherapy resistance; for example, in NSCLC, patients with CG genotype have a median progression-free Survival of only 6 months, which is 3 months shorter than those with CC genotype [ 37 41 101 Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. XueJian Wang and Bo Li contributed equally to this work. Acknowledgements Bio Render Author contributions All authors provided direction and guidance throughout the preparation of this manuscript. XueJian Wang and Bo Li drafted the manuscript. Jingya Gao assisted in drafting the manuscript and design of ideas. “#” means that XueJian Wang and Bo Li contributed equally to this work. Sumin Yang and Kun Wang reviewed and made significant revisions to the manuscript. All authors have read and approved the final manuscript. Funding This work was supported by National Natural Science Foundation of China (82370291); Open Project Program of State Key Laboratory of Frigid Zone Cardiovascular Diseases (SKLFZCD), Harbin Medical University (HDHY2024007);.Qingdao Science and Technology Benefiting the People Demonstration Project (24-1-8-smjk-7-nsh); Major Basic Research Projects in Shandong Province (ZR2024ZD46), Taishan Scholar Distinguished Expert. Data availability No datasets were generated or analysed during the current study. Declarations Ethics approval and consent to participate Not applicable. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Hill JW Evans MK A novel R229Q OGG1 polymorphism results in a thermolabile enzyme that sensitizes KG-1 leukemia cells to DNA damaging agents Cancer Detect Prev 2007 31 237 243 10.1016/j.cdp.2007.05.001 17651912 PMC2699023 Hill JW, Evans MK. A novel R229Q OGG1 polymorphism results in a thermolabile enzyme that sensitizes KG-1 leukemia cells to DNA damaging agents. Cancer Detect Prev. 2007;31:237–43. 10.1016/j.cdp.2007.05.001. 17651912 10.1016/j.cdp.2007.05.001 PMC2699023 2. Zhong Y OGG1: an emerging multifunctional therapeutic target for the treatment of diseases caused by oxidative DNA damage Med Res Rev 2024 44 2825 2848 10.1002/med.22068 39119702 Zhong Y, et al. OGG1: an emerging multifunctional therapeutic target for the treatment of diseases caused by oxidative DNA damage. Med Res Rev. 2024;44:2825–48. 10.1002/med.22068. 39119702 10.1002/med.22068 3. Zhou P-T Li B Ji J Wang M-M Gao C-F A systematic review and meta-analysis of the association between OGG1 Ser326Cys polymorphism and cancers Med Oncol 2015 10.1007/s12032-014-0472-z 25588927 Zhou P-T, Li B, Ji J, Wang M-M, Gao C-F. A systematic review and meta-analysis of the association between OGG1 Ser326Cys polymorphism and cancers. Med Oncol. 2015. 10.1007/s12032-014-0472-z. 25588927 10.1007/s12032-014-0472-z 4. Mittal RD Mandal RK Gangwar R Base excision repair pathway genes polymorphism in prostate and bladder cancer risk in North Indian population Mech Ageing Dev 2012 133 127 132 10.1016/j.mad.2011.10.002 22019847 Mittal RD, Mandal RK, Gangwar R. Base excision repair pathway genes polymorphism in prostate and bladder cancer risk in North Indian population. Mech Ageing Dev. 2012;133:127–32. 10.1016/j.mad.2011.10.002. 22019847 10.1016/j.mad.2011.10.002 5. Ji G Yan L Liu W Qu J Gu A OGG1 Ser326Cys polymorphism interacts with cigarette smoking to increase oxidative DNA damage in human sperm and the risk of male infertility Toxicol Lett 2013 218 144 149 10.1016/j.toxlet.2013.01.017 23376476 Ji G, Yan L, Liu W, Qu J, Gu A. OGG1 Ser326Cys polymorphism interacts with cigarette smoking to increase oxidative DNA damage in human sperm and the risk of male infertility. Toxicol Lett. 2013;218:144–9. 10.1016/j.toxlet.2013.01.017. 23376476 10.1016/j.toxlet.2013.01.017 6. Das S Nath S Bhowmik A Ghosh SK Choudhury Y Association between OGG1 Ser326Cys polymorphism and risk of upper aero-digestive tract and gastrointestinal cancers: a meta-analysis Springerplus 2016 10.1186/s40064-016-1858-5 27026921 PMC4771670 Das S, Nath S, Bhowmik A, Ghosh SK, Choudhury Y. Association between OGG1 Ser326Cys polymorphism and risk of upper aero-digestive tract and gastrointestinal cancers: a meta-analysis. Springerplus. 2016. 10.1186/s40064-016-1858-5. 27026921 10.1186/s40064-016-1858-5 PMC4771670 7. Gotoh N Association between OGG1 S326C CC genotype and elevated relapse risk in acute myeloid leukemia Int J Hematol 2018 108 246 253 10.1007/s12185-018-2464-9 29737460 Gotoh N, et al. Association between OGG1 S326C CC genotype and elevated relapse risk in acute myeloid leukemia. Int J Hematol. 2018;108:246–53. 10.1007/s12185-018-2464-9. 29737460 10.1007/s12185-018-2464-9 8. Daimon M Association of the Ser326Cys polymorphism in the OGG1 Biochem Biophys Res Commun 2009 386 26 29 10.1016/j.bbrc.2009.05.119 19486888 Daimon M, et al. Association of the Ser326Cys polymorphism in the OGG1 19486888 10.1016/j.bbrc.2009.05.119 9. SØrensen M Interactions between theOGG1Ser326Cys polymorphism and intake of fruit and vegetables in relation to lung cancer Free Radic Res 2009 40 885 891 10.1080/10715760600733129 17015267 SØrensen M, et al. Interactions between theOGG1Ser326Cys polymorphism and intake of fruit and vegetables in relation to lung cancer. Free Radic Res. 2009;40:885–91. 10.1080/10715760600733129. 10.1080/10715760600733129 17015267 10. Takezaki T HOGG1 Ser326Cys polymorphism and modification by environmental factors of stomach cancer risk in Chinese Int J Cancer 2002 99 624 627 10.1002/ijc.10400 11992556 Takezaki T, et al. HOGG1 Ser326Cys polymorphism and modification by environmental factors of stomach cancer risk in Chinese. Int J Cancer. 2002;99:624–7. 10.1002/ijc.10400. 11992556 10.1002/ijc.10400 11. Benitéz-Buelga C Helleday T Michel M Synthetic switches of OGG1 control initiation of base excision repair and offer new treatment strategies Clin Transl Med 2022 10.1002/ctm2.1035 36037066 PMC9423131 Benitéz-Buelga C, Helleday T, Michel M. Synthetic switches of OGG1 control initiation of base excision repair and offer new treatment strategies. Clin Transl Med. 2022. 10.1002/ctm2.1035. 36037066 10.1002/ctm2.1035 PMC9423131 12. Boiteux S Radicella JP The human OGG1 gene: structure, functions, and its implication in the process of carcinogenesis Arch Biochem Biophys 2000 377 1 8 10.1006/abbi.2000.1773 10775435 Boiteux S, Radicella JP. The human OGG1 gene: structure, functions, and its implication in the process of carcinogenesis. Arch Biochem Biophys. 2000;377:1–8. 10.1006/abbi.2000.1773. 10775435 10.1006/abbi.2000.1773 13. Kershaw RM Hodges NJ Repair of oxidative DNA damage is delayed in the Ser326Cys polymorphic variant of the base excision repair protein OGG1 Mutagenesis 2012 27 501 510 10.1093/mutage/ges012 22451681 Kershaw RM, Hodges NJ. Repair of oxidative DNA damage is delayed in the Ser326Cys polymorphic variant of the base excision repair protein OGG1. Mutagenesis. 2012;27:501–10. 10.1093/mutage/ges012. 22451681 10.1093/mutage/ges012 14. Luna L Dynamic relocalization of hOGG1 during the cell cycle is disrupted in cells harbouring the hOGG1-Cys326 polymorphic variant Nucleic Acids Res 2005 33 1813 1824 10.1093/nar/gki325 15800211 PMC1072800 Luna L. Dynamic relocalization of hOGG1 during the cell cycle is disrupted in cells harbouring the hOGG1-Cys326 polymorphic variant. Nucleic Acids Res. 2005;33:1813–24. 10.1093/nar/gki325. 15800211 10.1093/nar/gki325 PMC1072800 15. David SS O'Shea VL Kundu S Base-excision repair of oxidative DNA damage Nature 2007 447 941 950 10.1038/nature05978 17581577 PMC2896554 David SS, O’Shea VL, Kundu S. Base-excision repair of oxidative DNA damage. Nature. 2007;447:941–50. 10.1038/nature05978. 17581577 10.1038/nature05978 PMC2896554 16. Svilar D Goellner EM Almeida KH Sobol RW Base excision repair and lesion-dependent subpathways for repair of oxidative DNA damage Antioxid Redox Signal 2011 14 2491 2507 10.1089/ars.2010.3466 20649466 PMC3096496 Svilar D, Goellner EM, Almeida KH, Sobol RW. Base excision repair and lesion-dependent subpathways for repair of oxidative DNA damage. Antioxid Redox Signal. 2011;14:2491–507. 10.1089/ars.2010.3466. 20649466 10.1089/ars.2010.3466 PMC3096496 17. Bhatia S Arslan E Rodriguez-Hernandez LD Bonin R Wells PG DNA damage and repair and epigenetic modification in the role of oxoguanine glycosylase 1 in brain development Toxicol Sci 2022 187 93 111 10.1093/toxsci/kfac003 35038743 Bhatia S, Arslan E, Rodriguez-Hernandez LD, Bonin R, Wells PG. DNA damage and repair and epigenetic modification in the role of oxoguanine glycosylase 1 in brain development. Toxicol Sci. 2022;187:93–111. 10.1093/toxsci/kfac003. 35038743 10.1093/toxsci/kfac003 18. Bickmore W DNA damage, homology-directed repair, and DNA methylation PLoS Genet 2007 10.1371/journal.pgen.0030110 PMC1913100 17616978 Bickmore W, et al. DNA damage, homology-directed repair, and DNA methylation. PLoS Genet. 2007. 10.1371/journal.pgen.0030110. 10.1371/journal.pgen.0030110 PMC1913100 17616978 19. Hervouet E Peixoto P Delage-Mourroux R Boyer-Guittaut M Cartron P-F Specific or not specific recruitment of DNMTs for DNA methylation, an epigenetic dilemma Clin Epigenet 2018 10.1186/s13148-018-0450-y PMC5807744 29449903 Hervouet E, Peixoto P, Delage-Mourroux R, Boyer-Guittaut M, Cartron P-F. Specific or not specific recruitment of DNMTs for DNA methylation, an epigenetic dilemma. Clin Epigenet. 2018. 10.1186/s13148-018-0450-y. 10.1186/s13148-018-0450-y PMC5807744 29449903 20. Pacaud R The DNMT1/PCNA/UHRF1 disruption induces tumorigenesis characterized by similar genetic and epigenetic signatures Sci Rep 2014 10.1038/srep04230 24637615 PMC3957150 Pacaud R, et al. The DNMT1/PCNA/UHRF1 disruption induces tumorigenesis characterized by similar genetic and epigenetic signatures. Sci Rep. 2014. 10.1038/srep04230. 24637615 10.1038/srep04230 PMC3957150 21. Wong KK DNMT1: a key drug target in triple-negative breast cancer Semin Cancer Biol 2021 72 198 213 10.1016/j.semcancer.2020.05.010 32461152 Wong KK. DNMT1: a key drug target in triple-negative breast cancer. Semin Cancer Biol. 2021;72:198–213. 10.1016/j.semcancer.2020.05.010. 32461152 10.1016/j.semcancer.2020.05.010 22. Mortusewicz O Schermelleh L Walter J Cardoso MC Leonhardt H Recruitment of DNA methyltransferase I to DNA repair sites Proc Natl Acad Sci 2005 10.1073/pnas.0501034102 15956212 PMC1157029 Mortusewicz* O, Schermelleh L, Walter*† J, Cardoso‡ MC, Leonhardt*‡§ H. Recruitment of DNA methyltransferase I to DNA repair sites. Proc Natl Acad Sci. 2005. 10.1073/pnas.0501034102. 15956212 10.1073/pnas.0501034102 PMC1157029 23. Ding N Mismatch repair proteins recruit DNA methyltransferase 1 to sites of oxidative DNA damage J Mol Cell Biol 2016 8 244 254 10.1093/jmcb/mjv050 26186941 PMC4937888 Ding N, et al. Mismatch repair proteins recruit DNA methyltransferase 1 to sites of oxidative DNA damage. J Mol Cell Biol. 2016;8:244–54. 10.1093/jmcb/mjv050. 26186941 10.1093/jmcb/mjv050 PMC4937888 24. Zou H Association between the OGG1 Ser326Cys polymorphism and cancer risk: evidence from 152 case-control studies J Cancer 2016 7 1273 1280 10.7150/jca.15035 27390603 PMC4934036 Zou H, et al. Association between the OGG1 Ser326Cys polymorphism and cancer risk: evidence from 152 case-control studies. J Cancer. 2016;7:1273–80. 10.7150/jca.15035. 27390603 10.7150/jca.15035 PMC4934036 25. Obtulowicz T Oxidative stress and 8-oxoguanine repair are enhanced in colon adenoma and carcinoma patients Mutagenesis 2010 25 463 471 10.1093/mutage/geq028 20534734 Obtulowicz T, et al. Oxidative stress and 8-oxoguanine repair are enhanced in colon adenoma and carcinoma patients. Mutagenesis. 2010;25:463–71. 10.1093/mutage/geq028. 20534734 10.1093/mutage/geq028 26. Hill JW Dimerization and opposite base-dependent catalytic impairment of polymorphic S326C OGG1 glycosylase Nucleic Acids Res 2006 34 1620 1632 10.1093/nar/gkl060 16549874 PMC1405821 Hill JW. Dimerization and opposite base-dependent catalytic impairment of polymorphic S326C OGG1 glycosylase. Nucleic Acids Res. 2006;34:1620–32. 10.1093/nar/gkl060. 16549874 10.1093/nar/gkl060 PMC1405821 27. Kasymov RD Excision of 8-oxoguanine from methylated CpG dinucleotides by human 8-oxoguanine DNA glycosylase FEBS Lett 2013 587 3129 3134 10.1016/j.febslet.2013.08.008 23954288 Kasymov RD, et al. Excision of 8-oxoguanine from methylated CpG dinucleotides by human 8-oxoguanine DNA glycosylase. FEBS Lett. 2013;587:3129–34. 10.1016/j.febslet.2013.08.008. 23954288 10.1016/j.febslet.2013.08.008 28. Hu J Phosphorylation of human oxoguanine DNA glycosylase (-OGG1) modulates its function Nucleic Acids Res 2005 33 3271 3282 10.1093/nar/gki636 15942030 PMC1143695 Hu J. Phosphorylation of human oxoguanine DNA glycosylase (-OGG1) modulates its function. Nucleic Acids Res. 2005;33:3271–82. 10.1093/nar/gki636. 15942030 10.1093/nar/gki636 PMC1143695 29. Castresana JS The association between OGG1 Ser326Cys polymorphism and lung cancer susceptibility: a meta-analysis of 27 studies PLoS ONE 2012 10.1371/journal.pone.0035970 22540013 PMC3335067 Castresana JS, et al. The association between OGG1 Ser326Cys polymorphism and lung cancer susceptibility: a meta-analysis of 27 studies. PLoS ONE. 2012. 10.1371/journal.pone.0035970. 22540013 10.1371/journal.pone.0035970 PMC3335067 30. Irifuku T Inhibition of H3K9 histone methyltransferase G9a attenuates renal fibrosis and retains klotho expression Kidney Int 2016 89 147 157 10.1038/ki.2015.291 26444031 Irifuku T, et al. Inhibition of H3K9 histone methyltransferase G9a attenuates renal fibrosis and retains klotho expression. Kidney Int. 2016;89:147–57. 10.1038/ki.2015.291. 26444031 10.1038/ki.2015.291 31. Kim JI Park YJ Kim KH Kim JI Song BJ Lee MS Kim CN Chang SH hOGG1 Ser326Cys polymorphism modifies the significance of the environmental risk factor for colon cancer World J Gastroenterol: WJG 2003 9 5 956 10.3748/wjg.v9.i5.956 12717837 PMC4611404 Kim JI, Park YJ, Kim KH, Kim JI, Song BJ, Lee MS, et al. hOGG1 Ser326Cys polymorphism modifies the significance of the environmental risk factor for colon cancer. World J Gastroenterol: WJG. 2003;9(5):956. 10.3748/wjg.v9.i5.956. 12717837 10.3748/wjg.v9.i5.956 PMC4611404 32. Corella D Effects of the Ser326Cys polymorphism in the DNA repair OGG1 gene on cancer, cardiovascular, and all-cause mortality in the PREDIMED study: modulation by diet J Acad Nutr Diet 2018 118 589 605 10.1016/j.jand.2017.09.025 29305130 Corella D, et al. Effects of the Ser326Cys polymorphism in the DNA repair OGG1 gene on cancer, cardiovascular, and all-cause mortality in the PREDIMED study: modulation by diet. J Acad Nutr Diet. 2018;118:589–605. 10.1016/j.jand.2017.09.025. 29305130 10.1016/j.jand.2017.09.025 33. Fossella F Randomized, multinational, phase III study of docetaxel plus platinum combinations versus vinorelbine plus cisplatin for advanced non-small-cell lung cancer: the TAX 326 study group J Clin Oncol 2003 21 3016 3024 10.1200/jco.2003.12.046 12837811 Fossella F, et al. Randomized, multinational, phase III study of docetaxel plus platinum combinations versus vinorelbine plus cisplatin for advanced non-small-cell lung cancer: the TAX 326 study group. J Clin Oncol. 2003;21:3016–24. 10.1200/jco.2003.12.046. 12837811 10.1200/JCO.2003.12.046 34. Sangrajrang S Polymorphisms in three base excision repair genes and breast cancer risk in Thai women Breast Cancer Res Treat 2007 111 279 288 10.1007/s10549-007-9773-7 17922186 Sangrajrang S, et al. Polymorphisms in three base excision repair genes and breast cancer risk in Thai women. Breast Cancer Res Treat. 2007;111:279–88. 10.1007/s10549-007-9773-7. 17922186 10.1007/s10549-007-9773-7 35. Pardini B DNA repair genetic polymorphisms and risk of colorectal cancer in the Czech Republic Mutat Res/Fundament Mol Mech Mutagene 2008 638 146 153 10.1016/j.mrfmmm.2007.09.008 17991492 Pardini B, et al. DNA repair genetic polymorphisms and risk of colorectal cancer in the Czech Republic. Mutat Res/Fundament Mol Mech Mutagene. 2008;638:146–53. 10.1016/j.mrfmmm.2007.09.008. 10.1016/j.mrfmmm.2007.09.008 17991492 36. Orr H A role for oxidized DNA precursors in Huntington's disease-like striatal neurodegeneration PLoS Genet 2008 10.1371/journal.pgen.1000266 PMC2580033 19023407 Orr H, et al. A role for oxidized DNA precursors in Huntington’s disease-like striatal neurodegeneration. PLoS Genet. 2008. 10.1371/journal.pgen.1000266. 10.1371/journal.pgen.1000266 PMC2580033 19023407 37. Hatt L OGG1 expression and OGG1 Ser326Cys polymorphism and risk of lung cancer in a prospective study Mutat Res/Fundament Mol Mech Mutagene 2008 639 45 54 10.1016/j.mrfmmm.2007.11.002 18155253 Hatt L, et al. OGG1 expression and OGG1 Ser326Cys polymorphism and risk of lung cancer in a prospective study. Mutat Res/Fundament Mol Mech Mutagene. 2008;639:45–54. 10.1016/j.mrfmmm.2007.11.002. 10.1016/j.mrfmmm.2007.11.002 18155253 38. Li H Hao X Zhang W Wei Q Chen K The hOGG1 ser326cys polymorphism and lung cancer risk: a meta-analysis Cancer Epidemiol Biomark Prev 2008 17 1739 1745 10.1158/1055-9965.Epi-08-0001 18628426 Li H, Hao X, Zhang W, Wei Q, Chen K. The hOGG1 ser326cys polymorphism and lung cancer risk: a meta-analysis. Cancer Epidemiol Biomark Prev. 2008;17:1739–45. 10.1158/1055-9965.Epi-08-0001. 10.1158/1055-9965.EPI-08-0001 18628426 39. Kabziński J Walczak A Dziki A Dziki Ł Mik M Majsterek I Impact of the Ser326Cys polymorphism of the OGG1 gene on the level of oxidative DNA damage in patients with colorectal cancer Pol J Surg 2018 10.5604/01.3001.0011.7486 29773766 Kabziński J, Walczak A, Dziki A, Dziki Ł, Mik M, Majsterek I. Impact of the Ser326Cys polymorphism of the OGG1 gene on the level of oxidative DNA damage in patients with colorectal cancer. Pol J Surg. 2018. 10.5604/01.3001.0011.7486. 10.5604/01.3001.0011.7486 29773766 40. Das S Purkayastha S Roy H Sinha A Choudhury Y Polymorphisms in DNA repair genes increase the risk for type 2 diabetes mellitus and hypertension Biomol Concepts 2018 9 80 93 10.1515/bmc-2018-0008 29886452 Das S, Purkayastha S, Roy H, Sinha A, Choudhury Y. Polymorphisms in DNA repair genes increase the risk for type 2 diabetes mellitus and hypertension. Biomol Concepts. 2018;9:80–93. 10.1515/bmc-2018-0008. 29886452 10.1515/bmc-2018-0008 41. Peng Y Association of DNA base excision repair genes (OGG1, APE1 and XRCC1) polymorphisms with outcome to platinum-based chemotherapy in advanced nonsmall-cell lung cancer patients Int J Cancer 2014 135 2687 2696 10.1002/ijc.28892 24729390 Peng Y, et al. Association of DNA base excision repair genes (OGG1, APE1 and XRCC1) polymorphisms with outcome to platinum-based chemotherapy in advanced nonsmall-cell lung cancer patients. Int J Cancer. 2014;135:2687–96. 10.1002/ijc.28892. 24729390 10.1002/ijc.28892 42. Zheng Y Deng Z Tang M Xiao D Cai P Impact of genetic factors on platinum-induced gastrointestinal toxicity Mutat Res-Rev Mutat Res 2020 10.1016/j.mrrev.2020.108324 33339576 Zheng Y, Deng Z, Tang M, Xiao D, Cai P. Impact of genetic factors on platinum-induced gastrointestinal toxicity. Mutat Res-Rev Mutat Res. 2020. 10.1016/j.mrrev.2020.108324. 33339576 10.1016/j.mrrev.2020.108324 43. Coate LE John T Tsao MS Shepherd FA Molecular predictive and prognostic markers in non-small-cell lung cancer Lancet Oncol 2009 10 10 1001 1010 10.1016/S1470-2045(09)70155-X 19796752 Coate LE, John T, Tsao MS, Shepherd FA. Molecular predictive and prognostic markers in non-small-cell lung cancer. Lancet Oncol. 2009;10(10):1001–10. 10.1016/S1470-2045(09)70155-X. 19796752 10.1016/S1470-2045(09)70155-X 44. Yin M Functional polymorphisms of base excision repair genes XRCC1 and APEX1 predict risk of radiation pneumonitis in patients with non-small cell lung cancer treated with definitive radiation therapy Int J Radiat Oncol Biol Phys 2011 81 e67 e73 10.1016/j.ijrobp.2010.11.079 21420246 PMC3136565 Yin M, et al. Functional polymorphisms of base excision repair genes XRCC1 and APEX1 predict risk of radiation pneumonitis in patients with non-small cell lung cancer treated with definitive radiation therapy. Int J Radiat Oncol Biol Phys. 2011;81:e67–73. 10.1016/j.ijrobp.2010.11.079. 21420246 10.1016/j.ijrobp.2010.11.079 PMC3136565 45. Rosell R Lord RV Taron M Reguart N DNA repair and cisplatin resistance in non-small-cell lung cancer Lung Cancer 2002 38 3 217 227 10.1016/s0169-5002(02)00224-6 12445742 Rosell R, Lord RV, Taron M, Reguart N. DNA repair and cisplatin resistance in non-small-cell lung cancer. Lung Cancer. 2002;38(3):217–27. 10.1016/s0169-5002(02)00224-6. 12445742 10.1016/s0169-5002(02)00224-6 46. Dumitrescu RG Cotarla IJJOC Understanding breast cancer risk-where do we stand in 2005? J Cell Mol Med 2005 9 1 208 221 10.1111/j.1582-4934.2005.tb00350.x 15784178 PMC6741339 Dumitrescu RG, Cotarla IJJOC. Understanding breast cancer risk-where do we stand in 2005? J Cell Mol Med. 2005;9(1):208–21. 10.1111/j.1582-4934.2005.tb00350.x. 15784178 10.1111/j.1582-4934.2005.tb00350.x PMC6741339 47. Chen X Two functional variations in 5′-UTR of hoGG1 gene associated with the risk of breast cancer in Chinese Breast Cancer Res Treat 2010 127 795 803 10.1007/s10549-010-1284-2 21153698 Chen X, et al. Two functional variations in 5′-UTR of hoGG1 gene associated with the risk of breast cancer in Chinese. Breast Cancer Res Treat. 2010;127:795–803. 10.1007/s10549-010-1284-2. 21153698 10.1007/s10549-010-1284-2 48. Peng Q Lu Y Lao X Chen Z Li R Sui J Qin X Li S Association between OGG1 Ser326Cys and APEX1 Asp148Glu polymorphisms and breast cancer risk: a meta-analysis Diagn Pathol 2014 10.1186/1746-1596-9-108 24893568 PMC4064811 Peng Q, Lu Y, Lao X, Chen Z, Li R, Sui J, et al. Association between OGG1 Ser326Cys and APEX1 Asp148Glu polymorphisms and breast cancer risk: a meta-analysis. Diagn Pathol. 2014. 10.1186/1746-1596-9-108. 24893568 10.1186/1746-1596-9-108 PMC4064811 49. Roy D Liehr JG Estrogen, DNA damage and mutations Mutat Res/Fundament Mol Mech Mutagene 1999 424 1–2 107 115 10.1016/s0027-5107(99)00012-3 10064854 Roy D, Liehr JG. Estrogen, DNA damage and mutations. Mutat Res/Fundament Mol Mech Mutagene. 1999;424(1–2):107–15. 10.1016/s0027-5107(99)00012-3. 10.1016/s0027-5107(99)00012-3 10064854 50. Leon-Ferre RA Goetz MP Advances in systemic therapies for triple negative breast cancer BMJ 2023 10.1136/bmj-2022-071674 37253507 Leon-Ferre RA, Goetz MP. Advances in systemic therapies for triple negative breast cancer. BMJ. 2023. 10.1136/bmj-2022-071674. 37253507 10.1136/bmj-2022-071674 51. Hoeijmakers JHJ Genome maintenance mechanisms for preventing cancer Nature 2001 411 366 374 10.1038/35077232 11357144 Hoeijmakers JHJ. Genome maintenance mechanisms for preventing cancer. Nature. 2001;411:366–74. 10.1038/35077232. 11357144 10.1038/35077232 52. Synowiec E Stefanska J Morawiec Z Blasiak J Wozniak K Association between DNA damage, DNA repair genes variability and clinical characteristics in breast cancer patients Mutat Res/Fundament Mol Mech Mutagene 2008 648 65 72 10.1016/j.mrfmmm.2008.09.014 18977234 Synowiec E, Stefanska J, Morawiec Z, Blasiak J, Wozniak K. Association between DNA damage, DNA repair genes variability and clinical characteristics in breast cancer patients. Mutat Res/Fundament Mol Mech Mutagene. 2008;648:65–72. 10.1016/j.mrfmmm.2008.09.014. 10.1016/j.mrfmmm.2008.09.014 18977234 53. Onat İ Blood and tissue levels of persistent organic pollutants and genetic susceptibility in patients with breast cancer Environ Toxicol Pharmacol 2024 10.1016/j.etap.2024.104433 38583790 Onat İ, et al. Blood and tissue levels of persistent organic pollutants and genetic susceptibility in patients with breast cancer. Environ Toxicol Pharmacol. 2024. 10.1016/j.etap.2024.104433. 38583790 10.1016/j.etap.2024.104433 54. Guo C-L Han F-F Wang H-Y Wang L Meta-analysis of the association between hOGG1 Ser326Cys polymorphism and risk of colorectal cancer based on case–control studies J Cancer Res Clin Oncol 2012 138 1443 1448 10.1007/s00432-012-1197-z 22526153 PMC11824162 Guo C-L, Han F-F, Wang H-Y, Wang L. Meta-analysis of the association between hOGG1 Ser326Cys polymorphism and risk of colorectal cancer based on case–control studies. J Cancer Res Clin Oncol. 2012;138:1443–8. 10.1007/s00432-012-1197-z. 22526153 10.1007/s00432-012-1197-z PMC11824162 55. Belluco C Long-term outcome of patients with complete pathologic response after neoadjuvant chemoradiation for cT3 rectal cancer: implications for local excision surgical strategies Ann Surg Oncol 2011 18 3686 3693 10.1245/s10434-011-1822-0 21691880 PMC3222828 Belluco C, et al. Long-term outcome of patients with complete pathologic response after neoadjuvant chemoradiation for cT3 rectal cancer: implications for local excision surgical strategies. Ann Surg Oncol. 2011;18:3686–93. 10.1245/s10434-011-1822-0. 21691880 10.1245/s10434-011-1822-0 PMC3222828 56. Leu M 8-oxoguanine DNA glycosylase (OGG1) Cys326 variant: increased risk for worse outcome of patients with locally advanced rectal cancer after multimodal therapy Cancers (Basel) 2021 13 2805 10.3390/cancers13112805 34199885 PMC8200071 Leu M, et al. 8-oxoguanine DNA glycosylase (OGG1) Cys326 variant: increased risk for worse outcome of patients with locally advanced rectal cancer after multimodal therapy. Cancers (Basel). 2021;13:2805. 10.3390/cancers13112805. 34199885 10.3390/cancers13112805 PMC8200071 57. Maimaitiaili A Prognostic value of pathological nodal burden after neoadjuvant chemotherapy in initially cN0-1 breast cancer patients: a dual-center, 10-year survival analysis Ther Adv Med Oncol 2024 10.1177/17588359241248318 38716480 PMC11075599 Maimaitiaili A, et al. Prognostic value of pathological nodal burden after neoadjuvant chemotherapy in initially cN0-1 breast cancer patients: a dual-center, 10-year survival analysis. Ther Adv Med Oncol. 2024. 10.1177/17588359241248318. 38716480 10.1177/17588359241248318 PMC11075599 58. Ren X Axillary response and outcome in breast cancer patients after neoadjuvant treatment: the role of radiotherapy in reducing recurrence in ypN0 patients with initially cN+ stage Front Oncol 2023 10.3389/fonc.2023.1093155 37077821 PMC10106717 Ren X, et al. Axillary response and outcome in breast cancer patients after neoadjuvant treatment: the role of radiotherapy in reducing recurrence in ypN0 patients with initially cN+ stage. Front Oncol. 2023. 10.3389/fonc.2023.1093155. 37077821 10.3389/fonc.2023.1093155 PMC10106717 59. Dhillon VS Yeoh E Fenech M DNA repair gene polymorphisms and prostate cancer risk in South Australia: results of a pilot study Urol Oncol Semin Orig Investig 2011 29 641 646 10.1016/j.urolonc.2009.08.013 19914098 Dhillon VS, Yeoh E, Fenech M. DNA repair gene polymorphisms and prostate cancer risk in South Australia: results of a pilot study. Urol Oncol Semin Orig Investig. 2011;29:641–6. 10.1016/j.urolonc.2009.08.013. 10.1016/j.urolonc.2009.08.013 19914098 60. Seo YR Fishel ML Amundson S Kelley MR Smith ML Implication of p53 in base excision DNA repair: in vivo evidence Oncogene 2002 21 5 731 737 10.1038/sj/onc/1205129 11850801 Seo YR, Fishel ML, Amundson S, Kelley MR, Smith ML. Implication of p53 in base excision DNA repair: in vivo evidence. Oncogene. 2002;21(5):731–7. 10.1038/sj/onc/1205129. 11850801 10.1038/sj.onc.1205129 61. Klein EA Selenium: epidemiology and basic science J Urol 2004 10.1097/01.ju.0000107837.66277.e9 14713754 Klein EA. Selenium: epidemiology and basic science. J Urol. 2004. 10.1097/01.ju.0000107837.66277.e9. 14713754 10.1097/01.ju.0000107837.66277.e9 62. Barqawi A Thompson IM Crawford ED Prostate cancer chemoprevention: an overview of United States trials J Urol 2004 10.1097/01.ju.0000108141.36320.59 14713745 Barqawi A, Thompson IM, Crawford ED. Prostate cancer chemoprevention: an overview of United States trials. J Urol. 2004. 10.1097/01.ju.0000108141.36320.59. 14713745 10.1097/01.ju.0000108141.36320.59 63. Trzeciak AR Cellular repair of oxidatively induced DNA base lesions is defective in prostate cancer cell lines, PC-3 and DU-145 Carcinogenesis 2004 25 1359 1370 10.1093/carcin/bgh144 15044326 Trzeciak AR. Cellular repair of oxidatively induced DNA base lesions is defective in prostate cancer cell lines, PC-3 and DU-145. Carcinogenesis. 2004;25:1359–70. 10.1093/carcin/bgh144. 15044326 10.1093/carcin/bgh144 64. Vassos E Panas M Kladi A Vassilopoulos D Effect of CAG repeat length on psychiatric disorders in Huntington’s disease J Psychiatr Res 2008 42 544 549 10.1016/j.jpsychires.2007.05.008 17610899 Vassos E, Panas M, Kladi A, Vassilopoulos D. Effect of CAG repeat length on psychiatric disorders in Huntington’s disease. J Psychiatr Res. 2008;42:544–9. 10.1016/j.jpsychires.2007.05.008. 17610899 10.1016/j.jpsychires.2007.05.008 65. Kovtun IV OGG1 initiates age-dependent CAG trinucleotide expansion in somatic cells Nature 2007 447 447 452 10.1038/nature05778 17450122 PMC2681094 Kovtun IV, et al. OGG1 initiates age-dependent CAG trinucleotide expansion in somatic cells. Nature. 2007;447:447–52. 10.1038/nature05778. 17450122 10.1038/nature05778 PMC2681094 66. Hensley K Hall N Subramaniam R Cole P Harris M Aksenov M Aksenova M Gabbita SP Wu JF Carney JM Lovell M Brain regional correspondence between Alzheimer's disease histopathology and biomarkers of protein oxidation J Neurochem 1995 65 5 2146 2156 10.1046/j.1471-4159.1995.65052146.x 7595501 Hensley K, Hall N, Subramaniam R, Cole P, Harris M, Aksenov M, et al. Brain regional correspondence between Alzheimer’s disease histopathology and biomarkers of protein oxidation. J Neurochem. 1995;65(5):2146–56. 10.1046/j.1471-4159.1995.65052146.x. 7595501 10.1046/j.1471-4159.1995.65052146.x 67. Jacob KD Alzheimer's disease-associated polymorphisms in human OGG1 alter catalytic activity and sensitize cells to DNA damage Free Radic Biol Med 2013 63 115 125 10.1016/j.freeradbiomed.2013.05.010 23684897 PMC3767440 Jacob KD, et al. Alzheimer’s disease-associated polymorphisms in human OGG1 alter catalytic activity and sensitize cells to DNA damage. Free Radic Biol Med. 2013;63:115–25. 10.1016/j.freeradbiomed.2013.05.010. 23684897 10.1016/j.freeradbiomed.2013.05.010 PMC3767440 68. Coppedè F The hOGG1 Ser326Cys polymorphism is not associated with sporadic Parkinson's disease Neurosci Lett 2010 473 248 251 10.1016/j.neulet.2010.02.059 20193742 Coppedè F, et al. The hOGG1 Ser326Cys polymorphism is not associated with sporadic Parkinson’s disease. Neurosci Lett. 2010;473:248–51. 10.1016/j.neulet.2010.02.059. 20193742 10.1016/j.neulet.2010.02.059 69. American Diabetes Association Diagnosis and classification of diabetes mellitus Diab Care 2011 34 S62 S69 10.2337/dc11-S062 PMC3006051 21193628 American Diabetes Association. Diagnosis and classification of diabetes mellitus. Diab Care. 2011;34:S62–9. 10.2337/dc11-S062. 10.2337/dc11-S062 PMC3006051 21193628 70. Zimmet P Alberti KGMM Shaw J Global and societal implications of the diabetes epidemic Nature 2001 10.1038/414782a 11742409 Zimmet P, Alberti KGMM, Shaw J. Global and societal implications of the diabetes epidemic. Nature. 2001. 10.1038/414782a. 11742409 10.1038/414782a 71. Shah S Iqbal M Karam J Salifu M McFarlane SI Oxidative stress, glucose metabolism, and the prevention of type 2 diabetes: pathophysiological insights Antioxid Redox Signal 2007 9 911 929 10.1089/ars.2007.1629 17508914 Shah S, Iqbal M, Karam J, Salifu M, McFarlane SI. Oxidative stress, glucose metabolism, and the prevention of type 2 diabetes: pathophysiological insights. Antioxid Redox Signal. 2007;9:911–29. 10.1089/ars.2007.1629. 17508914 10.1089/ars.2007.1629 72. Gönül N The role of GSTM1, GSTT1, GSTP1, and OGG1 polymorphisms in type 2 diabetes mellitus risk: a case–control study in a Turkish population Gene 2012 505 121 127 10.1016/j.gene.2012.05.025 22652274 Gönül N, et al. The role of GSTM1, GSTT1, GSTP1, and OGG1 polymorphisms in type 2 diabetes mellitus risk: a case–control study in a Turkish population. Gene. 2012;505:121–7. 10.1016/j.gene.2012.05.025. 22652274 10.1016/j.gene.2012.05.025 73. Wang C-L The hOGG1 Ser326Cys gene polymorphism is associated with decreased insulin sensitivity in subjects with normal glucose tolerance J Hum Genet 2005 51 124 128 10.1007/s10038-005-0335-8 16333523 Wang C-L, et al. The hOGG1 Ser326Cys gene polymorphism is associated with decreased insulin sensitivity in subjects with normal glucose tolerance. J Hum Genet. 2005;51:124–8. 10.1007/s10038-005-0335-8. 16333523 10.1007/s10038-005-0335-8 74. Alomair A Association between polymorphisms of the DNA repair genes RAD51 and OGG1 and risk of cardiovascular disease Mol Med Rep 2024 10.3892/mmr.2024.13177 38334141 PMC10865073 Alomair A, et al. Association between polymorphisms of the DNA repair genes RAD51 and OGG1 and risk of cardiovascular disease. Mol Med Rep. 2024. 10.3892/mmr.2024.13177. 38334141 10.3892/mmr.2024.13177 PMC10865073 75. De Flora S Izzotti A Mutagenesis and cardiovascular diseases Mutat Res/Fundament Mol Mechan Mutagene 2007 621 5 17 10.1016/j.mrfmmm.2006.12.008 17383689 De Flora S, Izzotti A. Mutagenesis and cardiovascular diseases. Mutat Res/Fundament Mol Mechan Mutagene. 2007;621:5–17. 10.1016/j.mrfmmm.2006.12.008. 10.1016/j.mrfmmm.2006.12.008 17383689 76. Botto N Rizza A Colombo MG Mazzone AM Manfredi S Masetti S Clerico A Biagini A Andreassi MG Evidence for DNA damage in patients with coronary artery disease Mutat Res/Genet Toxicol Environ Mutagene 2001 493 1–2 23 30 10.1016/S1383-5718(01)00162-0 11516712 Botto N, Rizza A, Colombo MG, Mazzone AM, Manfredi S, Masetti S, et al. Evidence for DNA damage in patients with coronary artery disease. Mutat Res/Genet Toxicol Environ Mutagene. 2001;493(1–2):23–30. 10.1016/S1383-5718(01)00162-0. 10.1016/s1383-5718(01)00162-0 11516712 77. Whitaker AM Schaich MA Smith MS Flynn TS Freudenthal BD Base excision repair of oxidative DNA damage: from mechanism to disease Front Biosci (Landmark Edit) 2017 22 1493 1522 10.2741/4555 PMC5567671 28199214 Whitaker AM, Schaich MA, Smith MS, Flynn TS, Freudenthal BD. Base excision repair of oxidative DNA damage: from mechanism to disease. Front Biosci (Landmark Edit). 2017;22:1493–522. 10.2741/4555. 10.2741/4555 PMC5567671 28199214 78. Brugh VM Lipshultz LI Male factor infertility Med Clin North Am 2004 88 367 385 10.1016/s0025-7125(03)00150-0 15049583 Brugh VM, Lipshultz LI. Male factor infertility. Med Clin North Am. 2004;88:367–85. 10.1016/s0025-7125(03)00150-0. 15049583 10.1016/S0025-7125(03)00150-0 79. Meseguer M The significance of sperm DNA oxidation in embryo development and reproductive outcome in an oocyte donation program: a new model to study a male infertility prognostic factor Fertil Steril 2008 89 1191 1199 10.1016/j.fertnstert.2007.05.005 17681311 Meseguer M, et al. The significance of sperm DNA oxidation in embryo development and reproductive outcome in an oocyte donation program: a new model to study a male infertility prognostic factor. Fertil Steril. 2008;89:1191–9. 10.1016/j.fertnstert.2007.05.005. 17681311 10.1016/j.fertnstert.2007.05.005 80. Chen S-Y Association of the C-285T and A5954G polymorphisms in the DNA repair gene OGG1 with the susceptibility of rheumatoid arthritis Rheumatol Int 2011 32 1165 1169 10.1007/s00296-010-1738-1 21253737 Chen S-Y, et al. Association of the C-285T and A5954G polymorphisms in the DNA repair gene OGG1 with the susceptibility of rheumatoid arthritis. Rheumatol Int. 2011;32:1165–9. 10.1007/s00296-010-1738-1. 21253737 10.1007/s00296-010-1738-1 81. Mohamed RH El-Shal AS El-Shahawy EE Abdel Galil SM Association of XRCC1 and OGG1 DNA repair gene polymorphisms with rheumatoid arthritis in Egyptian patients Gene 2016 578 112 116 10.1016/j.gene.2015.12.021 26692147 Mohamed RH, El-Shal AS, El-Shahawy EE, Abdel Galil SM. Association of XRCC1 and OGG1 DNA repair gene polymorphisms with rheumatoid arthritis in Egyptian patients. Gene. 2016;578:112–6. 10.1016/j.gene.2015.12.021. 26692147 10.1016/j.gene.2015.12.021 82. Hitchon CA El-Gabalawy HS Oxidation in rheumatoid arthritis Arthrit Res Ther 2004 10.1186/ar1447 PMC1064874 15535839 Hitchon CA, El-Gabalawy HS. Oxidation in rheumatoid arthritis. Arthrit Res Ther. 2004. 10.1186/ar1447. 10.1186/ar1447 PMC1064874 15535839 83. Alanazi M The hOGG1 Ser326Cys gene polymorphism and breast cancer risk in Saudi population Pathol Oncol Res 2016 23 525 535 10.1007/s12253-016-0146-6 27822728 Alanazi M, et al. The hOGG1 Ser326Cys gene polymorphism and breast cancer risk in Saudi population. Pathol Oncol Res. 2016;23:525–35. 10.1007/s12253-016-0146-6. 27822728 10.1007/s12253-016-0146-6 84. Rossner P OGG1Polymorphisms and breast cancer risk Cancer Epidemiol Biomark Prev 2006 15 811 815 10.1158/1055-9965.Epi-05-0659 16614128 Rossner P, et al. OGG1Polymorphisms and breast cancer risk. Cancer Epidemiol Biomark Prev. 2006;15:811–5. 10.1158/1055-9965.Epi-05-0659. 10.1158/1055-9965.EPI-05-0659 16614128 85. Lai C-Y Association between polymorphisms of APE1 and OGG1 and risk of colorectal cancer in Taiwan World J Gastroenterol 2016 22 3372 3380 10.3748/wjg.v22.i12.3372 27022219 PMC4806195 Lai C-Y, et al. Association between polymorphisms of APE1 and OGG1 and risk of colorectal cancer in Taiwan. World J Gastroenterol. 2016;22:3372–80. 10.3748/wjg.v22.i12.3372. 27022219 10.3748/wjg.v22.i12.3372 PMC4806195 86. Wang T Association of APEX1 and OGG1 gene polymorphisms with breast cancer risk among Han women in the Gansu Province of China BMC Med Genet 2018 10.1186/s12881-018-0578-9 29720094 PMC5930440 Wang T, et al. Association of APEX1 and OGG1 gene polymorphisms with breast cancer risk among Han women in the Gansu Province of China. BMC Med Genet. 2018. 10.1186/s12881-018-0578-9. 29720094 10.1186/s12881-018-0578-9 PMC5930440 87. Stieger K Allelic interaction effects of DNA damage and repair genes on the predisposition to age-related cataract PLoS ONE 2018 10.1371/journal.pone.0184478 29689049 PMC5915686 Stieger K, et al. Allelic interaction effects of DNA damage and repair genes on the predisposition to age-related cataract. PLoS ONE. 2018. 10.1371/journal.pone.0184478. 29689049 10.1371/journal.pone.0184478 PMC5915686 88. Bravard A Oxidation status of human OGG1-S326C polymorphic variant determines cellular DNA repair capacity Cancer Res 2009 69 3642 3649 10.1158/0008-5472.Can-08-3943 19351836 Bravard A, et al. Oxidation status of human OGG1-S326C polymorphic variant determines cellular DNA repair capacity. Cancer Res. 2009;69:3642–9. 10.1158/0008-5472.Can-08-3943. 19351836 10.1158/0008-5472.CAN-08-3943 89. Miglani K Kumar S Yadav A Aggarwal N Gupta R OGG1 DNA repair gene polymorphism as a biomarker of oxidative and genotoxic DNA damage Iran Biomed J 2021 25 47 53 10.29252/ibj.25.1.47 33129239 PMC7748119 Miglani K, Kumar S, Yadav A, Aggarwal N, Gupta R. OGG1 DNA repair gene polymorphism as a biomarker of oxidative and genotoxic DNA damage. Iran Biomed J. 2021;25:47–53. 10.29252/ibj.25.1.47. 33129239 10.29252/ibj.25.1.47 PMC7748119 90. Sanjari Moghaddam A HOGG1 gene polymorphism and breast cancer risk: a systematic review and meta-analysis study Breast J 2018 24 70 73 10.1111/tbj.12842 28608470 Sanjari Moghaddam A, et al. HOGG1 gene polymorphism and breast cancer risk: a systematic review and meta-analysis study. Breast J. 2018;24:70–3. 10.1111/tbj.12842. 28608470 10.1111/tbj.12842 91. Zhang Y Genetic polymorphisms in DNA repair genes OGG1, APE1, XRCC1, and XPD and the risk of age-related cataract Ophthalmology 2012 119 900 906 10.1016/j.ophtha.2011.11.004 22306120 Zhang Y, et al. Genetic polymorphisms in DNA repair genes OGG1, APE1, XRCC1, and XPD and the risk of age-related cataract. Ophthalmology. 2012;119:900–6. 10.1016/j.ophtha.2011.11.004. 22306120 10.1016/j.ophtha.2011.11.004 92. Wang J Wu P Correlation analysis of mRNA expression and prognosis of hOGG1 gene polymorphism in patients with non-small cell lung cancer Oncol Lett 2019 10.3892/ol.2019.10586 31402936 PMC6676738 Wang J, Wu P. Correlation analysis of mRNA expression and prognosis of hOGG1 gene polymorphism in patients with non-small cell lung cancer. Oncol Lett. 2019. 10.3892/ol.2019.10586. 31402936 10.3892/ol.2019.10586 PMC6676738 93. Kahl VFS Role of PON1, SOD2, OGG1, XRCC1, and XRCC4 polymorphisms on modulation of DNA damage in workers occupationally exposed to pesticides Ecotoxicol Environ Saf 2018 159 164 171 10.1016/j.ecoenv.2018.04.052 29747151 Kahl VFS, et al. Role of PON1, SOD2, OGG1, XRCC1, and XRCC4 polymorphisms on modulation of DNA damage in workers occupationally exposed to pesticides. Ecotoxicol Environ Saf. 2018;159:164–71. 10.1016/j.ecoenv.2018.04.052. 29747151 10.1016/j.ecoenv.2018.04.052 94. Chen LAN Elahi A Pow-Sang J Lazarus P Park J Association between polymorphism of human oxoguanine glycosylase 1 and risk of prostate cancer J Urol 2003 170 2471 2474 10.1097/01.ju.0000087498.23008.bb 14634453 Chen LAN, Elahi A, Pow-Sang J, Lazarus P, Park J. Association between polymorphism of human oxoguanine glycosylase 1 and risk of prostate cancer. J Urol. 2003;170:2471–4. 10.1097/01.ju.0000087498.23008.bb. 14634453 10.1097/01.ju.0000087498.23008.bb 95. Kabziński J Majsterek I Association of base excision repair pathway genes OGG1 XRCC1 MUTYH Int J Occup Med Environ Health 2022 35 625 633 10.13075/ijomeh.1896.01901 35770680 PMC10464724 Kabziński J, Majsterek I. Association of base excision repair pathway genes OGG1 XRCC1 MUTYH 35770680 10.13075/ijomeh.1896.01901 PMC10464724 96. Huan Z Li’na Z Biyun Q Effects of base excision repair pathway gene XRCC1 hOGG1 polymorphisms and smoking on the survival of lung cancer patients Chin J Clin Oncol 2012 10.3969/j.issn.1000-8179.2012.08.007 Huan Z, Li’na Z, Biyun Q. Effects of base excision repair pathway gene XRCC1 hOGG1 polymorphisms and smoking on the survival of lung cancer patients. Chin J Clin Oncol. 2012. 10.3969/j.issn.1000-8179.2012.08.007. 97. van den Boogaard ML Defects in 8-oxo-guanine repair pathway cause high frequency of C > A substitutions in neuroblastoma Proc Natl Acad Sci U S A 2021 10.1073/pnas.2007898118 34479993 PMC8433536 van den Boogaard ML, et al. Defects in 8-oxo-guanine repair pathway cause high frequency of C > A substitutions in neuroblastoma. Proc Natl Acad Sci U S A. 2021. 10.1073/pnas.2007898118. 34479993 10.1073/pnas.2007898118 PMC8433536 98. Tajai P An engineered cell line lacking OGG1 and MUTYH glycosylases implicates the accumulation of genomic 8-oxoguanine as the basis for paraquat mutagenicity Free Radic Biol Med 2018 116 64 72 10.1016/j.freeradbiomed.2017.12.035 29289706 PMC5902796 Tajai P, et al. An engineered cell line lacking OGG1 and MUTYH glycosylases implicates the accumulation of genomic 8-oxoguanine as the basis for paraquat mutagenicity. Free Radic Biol Med. 2018;116:64–72. 10.1016/j.freeradbiomed.2017.12.035. 29289706 10.1016/j.freeradbiomed.2017.12.035 PMC5902796 99. Li Y UDA-seq: universal droplet microfluidics-based combinatorial indexing for massive-scale multimodal single-cell sequencing Nat Methods 2025 10.1038/s41592-024-02586-y 39833568 PMC12165859 Li Y, et al. UDA-seq: universal droplet microfluidics-based combinatorial indexing for massive-scale multimodal single-cell sequencing. Nat Methods. 2025. 10.1038/s41592-024-02586-y. 39833568 10.1038/s41592-024-02586-y PMC12165859 100. Michel M Small-molecule activation of OGG1 increases oxidative DNA damage repair by gaining a new function Science 2022 376 1471 1476 10.1126/science.abf8980 35737787 Michel M, et al. Small-molecule activation of OGG1 increases oxidative DNA damage repair by gaining a new function. Science. 2022;376:1471–6. 10.1126/science.abf8980. 35737787 10.1126/science.abf8980 101. Hu Y scNanoATAC-seq: a long-read single-cell ATAC sequencing method to detect chromatin accessibility and genetic variants simultaneously within an individual cell Cell Res 2022 33 83 86 10.1038/s41422-022-00730-x 36220860 PMC9810643 Hu Y, et al. scNanoATAC-seq: a long-read single-cell ATAC sequencing method to detect chromatin accessibility and genetic variants simultaneously within an individual cell. Cell Res. 2022;33:83–6. 10.1038/s41422-022-00730-x. 36220860 10.1038/s41422-022-00730-x PMC9810643 102. Zhang JHM OGG1S326C variant frequent in human populations facilitates inflammatory responses due to its extended interaction with DNA substrate Proc Natl Acad Sci U S A 2025 10.1073/pnas.2426102122 40343995 PMC12088383 Zhang JHM. OGG1S326C variant frequent in human populations facilitates inflammatory responses due to its extended interaction with DNA substrate. Proc Natl Acad Sci U S A. 2025. 10.1073/pnas.2426102122. 40343995 10.1073/pnas.2426102122 PMC12088383 103. Su Y DNA repair gene polymorphisms in relation to non-small cell lung cancer survival Cell Physiol Biochem 2015 36 1419 1429 10.1159/000430307 26159902 Su Y, et al. DNA repair gene polymorphisms in relation to non-small cell lung cancer survival. Cell Physiol Biochem. 2015;36:1419–29. 10.1159/000430307. 26159902 10.1159/000430307 104. Simonelli V Genotype–phenotype analysis of S326C OGG1 polymorphism: a risk factor for oxidative pathologies Free Radic Biol Med 2013 63 401 409 10.1016/j.freeradbiomed.2013.05.031 23726996 Simonelli V, et al. Genotype–phenotype analysis of S326C OGG1 polymorphism: a risk factor for oxidative pathologies. Free Radic Biol Med. 2013;63:401–9. 10.1016/j.freeradbiomed.2013.05.031. 23726996 10.1016/j.freeradbiomed.2013.05.031 105. Sun F Single-cell omics: experimental workflow, data analyses and applications Sci China Life Sci 2024 68 5 102 10.1007/s11427-023-2561-0 39060615 Sun F, et al. Single-cell omics: experimental workflow, data analyses and applications. Sci China Life Sci. 2024;68:5–102. 10.1007/s11427-023-2561-0. 39060615 10.1007/s11427-023-2561-0 106. Marsh S Platinum pathway Pharmacogenet Genomics 2009 19 563 564 10.1097/FPC.0b013e32832e0ed7 19525887 PMC4153753 Marsh S, et al. Platinum pathway. Pharmacogenet Genomics. 2009;19:563–4. 10.1097/FPC.0b013e32832e0ed7. 19525887 10.1097/FPC.0b013e32832e0ed7 PMC4153753 107. Sullivan I Pharmacogenetics of the DNA repair pathways in advanced non-small cell lung cancer patients treated with platinum-based chemotherapy Cancer Lett 2014 353 160 166 10.1016/j.canlet.2014.07.023 25069034 Sullivan I, et al. Pharmacogenetics of the DNA repair pathways in advanced non-small cell lung cancer patients treated with platinum-based chemotherapy. Cancer Lett. 2014;353:160–6. 10.1016/j.canlet.2014.07.023. 25069034 10.1016/j.canlet.2014.07.023 108. Rigas JR Taxane-platinum combinations in advanced non-small cell lung cancer: a review Oncologist 2004 9 23 10.1634/theoncologist.9-suppl_2-16 15161987 Rigas JR. Taxane-platinum combinations in advanced non-small cell lung cancer: a review. Oncologist. 2004;9:23. 10.1634/theoncologist.9-suppl_2-16 15161987 109. Zhou C-H Efficacy and safety of different doses of bevacizumab combined with pemetrexed and platinum in first-line treatment of advanced NSCLC: a retrospective-real world study Front Pharmacol 2021 10.3389/fphar.2021.727102 34867332 PMC8635804 Zhou C-H, et al. Efficacy and safety of different doses of bevacizumab combined with pemetrexed and platinum in first-line treatment of advanced NSCLC: a retrospective-real world study. Front Pharmacol. 2021. 10.3389/fphar.2021.727102. 34867332 10.3389/fphar.2021.727102 PMC8635804 110. Bravard EMKPA hOGG1-Cys326 variant cells are hypersensitive to DNA repair inhibition by nitric oxide Carcinogenesis 2014 10.1093/carcin/bgu066 24632493 Bravard EMKPA. hOGG1-Cys326 variant cells are hypersensitive to DNA repair inhibition by nitric oxide. Carcinogenesis. 2014. 10.1093/carcin/bgu066. 24632493 10.1093/carcin/bgu066 111. Li M Dai N Wang D Zhong Z Distinct APE1 activities affect the regulation of VEGF transcription under hypoxic conditions Comput Struct Biotechnol J 2019 17 324 332 10.1016/j.csbj.2019.02.007 30906512 PMC6411614 Li M, Dai N, Wang D, Zhong Z. Distinct APE1 activities affect the regulation of VEGF transcription under hypoxic conditions. Comput Struct Biotechnol J. 2019;17:324–32. 10.1016/j.csbj.2019.02.007. 30906512 10.1016/j.csbj.2019.02.007 PMC6411614 112. Wang W The hOGG1 Ser326Cys polymorphism contributes to cancer susceptibility: evidence from 83 case-control studies Mutagenesis 2011 27 329 336 10.1093/mutage/ger083 22121210 Wang W, et al. The hOGG1 Ser326Cys polymorphism contributes to cancer susceptibility: evidence from 83 case-control studies. Mutagenesis. 2011;27:329–36. 10.1093/mutage/ger083. 22121210 10.1093/mutage/ger083 113. Zhong D Li G Long J Wu J Hu Y The hOGG1Ser326Cys polymorphism and increased lung cancer susceptibility in Caucasians: an updated meta-analysis Sci Rep 2012 10.1038/srep00548 22855704 PMC3409380 Zhong D, Li G, Long J, Wu J, Hu Y. The hOGG1Ser326Cys polymorphism and increased lung cancer susceptibility in Caucasians: an updated meta-analysis. Sci Rep. 2012. 10.1038/srep00548. 22855704 10.1038/srep00548 PMC3409380 114. Demeyer D Mertens B De Smet S Ulens M Mechanisms linking colorectal cancer to the consumption of (processed) red meat: a review Crit Rev Food Sci Nutr 2015 56 2747 2766 10.1080/10408398.2013.873886 25975275 Demeyer D, Mertens B, De Smet S, Ulens M. Mechanisms linking colorectal cancer to the consumption of (processed) red meat: a review. Crit Rev Food Sci Nutr. 2015;56:2747–66. 10.1080/10408398.2013.873886. 10.1080/10408398.2013.873886 25975275 115. Qi X Mechanism and intervention measures of iron side effects on the intestine Crit Rev Food Sci Nutr 2019 60 2113 2125 10.1080/10408398.2019.1630599 31232087 Qi X, et al. Mechanism and intervention measures of iron side effects on the intestine. Crit Rev Food Sci Nutr. 2019;60:2113–25. 10.1080/10408398.2019.1630599. 31232087 10.1080/10408398.2019.1630599 116. Bernstein H Bernstein C Bile acids as carcinogens in the colon and at other sites in the gastrointestinal system Exp Biol Med (Maywood) 2022 248 79 89 10.1177/15353702221131858 36408538 PMC9989147 Bernstein H, Bernstein C. Bile acids as carcinogens in the colon and at other sites in the gastrointestinal system. Exp Biol Med (Maywood). 2022;248:79–89. 10.1177/15353702221131858. 36408538 10.1177/15353702221131858 PMC9989147 117. Liu Y Secondary bile acids and tumorigenesis in colorectal cancer Front Oncol 2022 10.3389/fonc.2022.813745 35574393 PMC9097900 Liu Y, et al. Secondary bile acids and tumorigenesis in colorectal cancer. Front Oncol. 2022. 10.3389/fonc.2022.813745. 35574393 10.3389/fonc.2022.813745 PMC9097900 118. Hirano T Alcohol consumption and oxidative DNA damage Int J Environ Res Public Health 2011 8 2895 2906 10.3390/ijerph8072895 21845164 PMC3155335 Hirano T. Alcohol consumption and oxidative DNA damage. Int J Environ Res Public Health. 2011;8:2895–906. 10.3390/ijerph8072895. 21845164 10.3390/ijerph8072895 PMC3155335 119. Baptiste BA Enhanced mitochondrial DNA repair of the common disease-associated variant, Ser326Cys, of hOGG1 through small molecule intervention Free Radic Biol Med 2018 124 149 162 10.1016/j.freeradbiomed.2018.05.094 29879444 PMC6098717 Baptiste BA, et al. Enhanced mitochondrial DNA repair of the common disease-associated variant, Ser326Cys, of hOGG1 through small molecule intervention. Free Radic Biol Med. 2018;124:149–62. 10.1016/j.freeradbiomed.2018.05.094. 29879444 10.1016/j.freeradbiomed.2018.05.094 PMC6098717 120. Dinçer Y DNA repair gene OGG1 polymorphism and its relation with oxidative DNA damage in patients with Alzheimer’s disease Neurosci Lett 2019 10.1016/j.neulet.2019.134362 31299287 Dinçer Y, et al. DNA repair gene OGG1 polymorphism and its relation with oxidative DNA damage in patients with Alzheimer’s disease. Neurosci Lett. 2019. 10.1016/j.neulet.2019.134362. 31299287 10.1016/j.neulet.2019.134362 ",
  "metadata": {
    "Title of this paper": "DNA repair gene OGG1 polymorphism and its relation with oxidative DNA damage in patients with Alzheimer’s disease",
    "Journal it was published in:": "Clinical Epigenetics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481779/"
  }
}