{
  "title": "Paper_169",
  "abstract": "pmc ACS Omega ACS Omega 3686 acsomega ao ACS Omega 2470-1343 American Chemical Society http://pubs.acs.org/journal/acsodf PMC12489618 PMC12489618.1 12489618 12489618 10.1021/acsomega.5c01958 1 Article Three-Dimensional\nNumerical Simulation of 90 90 90 6362785 https://orcid.org/0000-0003-1306-9288 Gao Ziteng 7255697 https://orcid.org/0000-0003-2979-7300 Zhang Hu 7260885 Yu Ting 7260283 https://orcid.org/0000-0002-5012-1658 Qiao Lu 7537884 Liu Cunxiong  Radiochemical Research Institute China Institute of Atomic Energy Beijing 102413 China * zhanghu@cnncmail.cn 22 9 2025 30 9 2025 10 38 498176 43499 43509 03 3 2025 21 8 2025 09 9 2025 22 9 2025 22 09 2025 03 10 2025 03 10 2025 © 2025 The Authors. Published by American Chemical Society 2025 The Authors https://creativecommons.org/licenses/by-nc-nd/4.0/ This article is licensed under CC-BY-NC-ND 4.0  90 90 90 90 90 90 90 90 90 90 90 90 8 5 5 the National Natural Science Foundation of China. NA (U1867205) pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes document-id-old-9 ao5c01958 document-id-new-14 ao5c01958 production-flag-MathML-config-version 3 production-flag-journal-citation-display-style acs-titles production-flag-journal-date-display-style dates-used-rcd-rvd-acc document-id-alt-64 a0b26b3301bd7af66554bf5582e543024be4db0c75453190b3ec549b1c9507ac 1 Introduction  90 T 1/2 E βmax 90 90 90 90 90  90 90 90  90 89 2 3 90 90 90 90 90 90 235 235 90 90 90 1 S 90 r → Y 90 + e − + v e 90 90 90 90 90 90 90 6 90 Several methods exist to separate 90 90 90 90 90 90 90 90 90 90 90 The principle of CCE involves applying an\nelectric field while\nsimultaneously introducing a counter-directional fluid flow. The CCE technology has shown extensive\npotential in protein analysis,\nmetal ion separation, and complex bioinformatics analysis. For example,\nBalterms successfully separated and analyzed proteins in egg yolk\nyellow protein using CCE combined with mass spectrometry technology,\nfurther verifying the effectiveness of CCE in protein analysis. + + An electrophoresis device\nwas obtained using COMSOL Multiphysics\nto find suitable device parameters and separation environments and\nthe concentration distributions of Sr and Y ions in the countercurrent\nsimulation software. COMSOL is a powerful and flexible tool, which\nsupports custom equations and material properties, and specific physical\nfields can be selected for modeling.  2 Principle of Countercurrent\nElectrophoresis\nSeparation The main chamber includes a cylindrical separation\nchannel. Electrodes\nwere arranged at both ends of the channel, and a reverse flow field\nand an electric field were simultaneously applied. The electrophoretic\nvelocity obtained by ions in a unit electric field in the direction\nof migration is called the mobility or electromobility, denoted as\nμ em em 0 F E q E F f r v 2 F f = 6 π η r v = 6 π η r μ em 0 E 3 6 π η r μ em 0 E = q E 4 μ em 0 = q 6 π η r = z e 6 π η r = 2 3 ε η ζ 0 According to these relationships, in\nthe same solution environment,\nμ em r q em E,Sr –5 2 –1 –1 E,Y –5 2 –1 –1 v E E E v E,Sr v v E,Y Figure 1 Schematic diagram\nof ion separation with different mobilities by\nCCE. The flow rate of ion electromigration\ncan be expressed\nas 5 N e = ± E u i C i E u  i 2 –1 –1 C  i i 3 The relationship between the ion mobility and\ndiffusion coefficient\nis described by the Nernst–Einstein equation 6 D i = R T u i | z i | F D  i i z  i i F R T The transport of matter is determined by the combined action of\nconvection, electric field, and diffusion caused by concentration\ngradients and can be described by the Nernst–Planck equation\n( eq  7 N i = − D i d C i d x − D i z i F C i R T d Φ d x + C i v N  i i –2 –1 x v eq  − D i z i F C i R T d Φ d x = C i v E , i N  i C  i v  i i eq 8 C i L v i = − D i d C i d x + C i ( v E , i + v ) v E D  i 2 C  i 3  i 2 –1 –1 z  i D  i 9 D i = k T 6 π η R i k –23 2 –2 –1 R  i i The separation factor is an important index for determining\nthe\nseparation effect, and it can be calculated as follows: 10 separation\nfactor = C Y , i L C Sr , i L C Y , i 0 C Sr , i 0 = C Y , i L C Sr , i L C Sr , i 0 C Y , i 0 C Y, i C Y, i C Sr, i C Sr, i 3 Form of Species It is well-known that\nvarious metals and complex ions have different\ncomplex forms. Considering that the electromigration difference of\nSr 2+ 3+ 2+ 3+ 2+ 3+ 3.1 Acid Dissociation Constant and Complex Stability\nConstant  Table Table 90 90 1 Dissociation\nConstants of EDTA and\nCIT ligand log K log K EDTA log K H6L 2+ 0.90 log K H5L + 1.60 log K H4L 2.07 log K H3L – 2.75 log K H2L 2– 6.24 log K HL 3– 10.34 CIT log K H3L 3.09 log K H2L – 4.75 log K HL 2– 5.41 2 Species and Stability Constants of\nEDTA, CIT, and 90 90  RN–ORG species composition log K Sr(II) Sr–EDTA Sr(EDTA) 2– 1Sr 2+ 4– 10.3 Sr(HEDTA) − 1Sr 2+ 4– + 14.7 Sr–CIT Sr(CIT) − 1Sr 2+ 3– 4.24 Sr(CIT) 2 4– 1Sr 2+ 3– 4.84 Sr(HCIT) 1Sr 2+ 3– + 9.0 Sr(H 2 + 1Sr 2+ 3– + 12.46 Y(III) Y–EDTA Y(EDTA) − 1Y 3+ 4– 18.09 Y(HEDTA) 1Y 3+ 4– + 22.09 Y–CIT Y(CIT) 1Y 3+ 3– 3.6 Y(HCIT) + 1Y 3+ 3– + 7.81 Y(HCIT) 2 2+ 1Y 3+ 3– + 10.95 EDTA and Sr 2+ 2– − 3+ − 2+ − 2 4– 2 + 3+ + + 2 2 2+ 3.2 Analysis of the Form of\nSpecies Existence Using a dissociation constant and complexation\nstability constant\ndata, processed by the HySS2009 subroutine in the Hyperquad2013 program, M Figure 2 Evolution of the complexation form of EDTA,\nCIT, and 90 90  Figure − 2– − 2– Figure − − 2–  Figure 2 + 2 + − − Figure + 3.3 Summary of Species Behavior under Different\npH Conditions Three pH conditions (2, 4, and 7) were systematically\nselected to characterize species behavior, as summarized in Tables 3 Complexes with EDTA,\nSr and Y Species\nBehavior, Relative Separation Mass, and Charge at pH Values of 2,\n4, and 7 4 Complexes\nwith CIT, Sr and Y Species\nBehavior, Relative Separation Mass, and Charge at pH Values of 2,\n4, and 7 Electrophoretic separation\nefficiency was governed\nby species-specific\nelectric mobility, determined by charge-to-mass ratios. Comparative\nanalysis revealed that only Sr species exhibiting superior electric\nmobility to their Y counterparts were qualified for CCE applications.\nPrimary selection criteria focused on identifying Sr species with\nabsolute charge magnitudes higher than those of Y species (charge\npolarity disregarded). This rationale prioritized the investigation\nof EDTA-complexed systems at pH 2 and 7, along with CIT-complexed\nsystems at pH 7. 4 Construction of the Countercurrent\nElectrophoresis\nSeparation Model Modeling is an indispensable method in chemical\nand fluid dynamics\nresearch. Establishing a reasonable model involves identifying the\nprimary factors that affect the movement of objects.  4.1 Variable Parameter Settings Selected\nphysical parameters of the model at three different working conditions\n(with EDTA or CIT as the complexing agent) were listed in Table 3 –4 D  i –9 2 C Sr,0 C Sr,0 C Y,0 3 M Y,eff 5 Model of the Physical\nProperty Parameter\nValues average effective charge or average effective\nrelative molecular mass working condition 1 working condition 2 working condition 3 unit  z Sr,eff +2 –2 –1.06   z Y,eff 0 –1 0   M Sr,eff 90 378 282.78 g/mol  M Y,eff 379 378 279  4.2 Model Module Settings The main component\nof the separation chamber was a cylindrical separation channel with\nan inner diameter of 1–5 mm and a length ranging from 300 to\n500 mm ( Figure 90 90 3 (A) Simple schematic\nof the CCE device: ① narrow separation\nchannel, ② buffer area, ③ inlet and ④ outlet\nof the separation channel, ⑤ right and ⑥ left electrode\nchambers, ⑦ right and ⑧ left electrodes, and ⑨\ncation-exchange membrane. Model mesh comparison: (B) tetrahedral mesh\nand (C) hexahedral mesh. 5 Results\nand Discussion 5.1 Mesh Study The\nmodel mesh can directly\ndetermine the solution method of the model and affect the calculation\nof the problem, including the solution time, the amount of memory\nrequired to complete the calculations, the best interpolation method\nbetween the solution nodes, and the accuracy of the solution. In order\nto improve the accuracy of the solution, the hexahedral mesh modeling\nof the separation channel region was specially carried out in this\nstudy ( Figure Figure 5.2 Concentration\nDistribution of the Countercurrent\nElectrophoresis Device The concentration and separation factor\ndistributions are shown in Figure 4 Separation factor and ion concentration distribution of\nSr/Y species\nin the separation channel for working conditions (A) 1, (B) 2, and\n(C) 3 in 1000 V. (D) 90 90 In addition, the separation\nfactors under the three\nworking conditions\nwere calculated. Data normalization employed a constrained scaling\napproach 11 y ⁡ axis = min ( n × 10 m , α ) n m Figure 8 4 7 q eff M eff 5.3 Effect of the Temperature Temperature\ncontrol is crucial for improving the reproducibility of the experiments.\nThe heat source of the CCE device comes from Joule heating induced\nby the electric field. Condition 2 was chosen as a representative\nexample to compare the separation factors of the central axis of the\nseparation channel at different temperatures (20, 40, and 60 °C)\n( Figure 5 (A) Separation factor around the central axis of the separation\nchannel under 20, 40, and 60 °C. (B) Separation factor around\nthe central axis of the separation channel under 1000, 3000, and 5000\nV. (C) Separation factor around the central axis of the separation\nchannel under different initial strontium concentration conditions.\n(D) Fluctuation of the separation factor at the center point of the\ndevice outlet section over time for the three working conditions.\n(E) Schematic diagram of cooling water circulation and temperature\nmeasurement points (a, buffer area of the separation chamber; b, cooling\nwater inlet; and c, outlet). (F) Experimental results and model correction\nresults of the separation factor under three working conditions. 5.4 Effect of the Voltage Voltage is\na critical factor that affects the electromigration rate. Condition\n2 was selected as a representative example, and the separation factor\nof the central axis of the separation channel was compared under different\napplied voltages (1000, 3000, and 5000 V; Figure 5.5 Effect\nof the Initial Strontium Concentration The initial concentration\nof the Sr solution can also affect separation.\nWhen working condition 2 was taken as an example, under an electric\nfield of 1000 V, strontium solutions of 0.01, 0.016, 0.05, and 0.1\nmol/L were selected as variables. The separation factors around the\ncentral axis of the separation channel were compared at different\ninitial Sr concentrations. When we only increase the initial concentration\nof strontium, it will disrupt the balance between the electric field\nand fluid velocity, resulting in poor separation efficiency or even\nan inability to separate. Therefore, we need to provide an appropriate\nvoltage and flow rate, as shown in Table Figure 6 Voltage and Fluid Flow Rate Data for\nDifferent Initial Sr Concentrations initial Sr concentration (mol/L) voltage (V) flow velocity (m/s) 0.010 1000 0.0008 0.016 1000 0.0001 0.050 2000 0.0001 0.100 5000 0.0001 5.6 Stability Analysis of the Separation Device The system\nreached separation equilibrium after 15 s, and the stability\nof the CCE separation device was analyzed. The stability of the separation\nsystem was expressed by the change in the separation factor of the\ncenter point of the outlet section of the channel over time, as illustrated\nin Figure 5.7 Experimental Verification Non-radioactive\nstrontium nitrate (0.016 mol/L) and yttrium solutions (0.016/3.9 ×\n10 3 Table Figure 5 3 5 Figure 7 Voltage and Fluid\nFlow Rate Data for\nDifferent Initial Sr Concentrations voltage (V) current (A) heating power (W) buffer\ntemperature (°C) cooling water inlet\ntemperature (°C) cooling water outlet\ntemperature (°C) cooling power (W) 200 8.52 × 10 –3 1.70 20.0 17.8 18.0 150 400 17.02 × 10 –3 6.81 20.3 17.9 18.3 600 26.65 × 10 –3 15.99 20.4 18.0 18.6 800 34.18 × 10 –3 27.34 20.3 18.0 18.7 1000 47.79 × 10 –3 47.79 20.2 18.0 18.9 It can be seen that there is a certain similarity\nbetween the experimental\nresults and the simulation results. Similarly, the separation factor\nwas working condition 1 > working condition 3 > working condition\n2. This indicated that the simulation results have a certain correlation\nwith the actual experiment and have a certain degree of reliability.\nHowever, there are inevitably 2–3 orders of magnitude differences\nbetween experimental data and simulation results. This difference\nmay stem from some secondary factors overlooked in the simulation.\nTo get closer to the experimental results, electro-osmotic flow is\nintroduced into the model, which is discussed in section  Table 8 Summary of Separation Factors for\nExisting Sr/Y Separation Methods author and year separation method selectivity reference Skraba et al, 1978 ion-exchange method 1.0 × 10 6  Horwitz and Dietz, 1993 extraction chromatography 1.0 × 10 3  Pawlak et al., 2013 extraction chromatography 1.0 × 10 8  Pichestapong et al., 2016 extraction chromatography 1.0 × 10 4  Chu and Zou, 2018 extraction chromatography 1.2 × 10 5  Zhang et al., 2022 chromatographic separation 3.8 × 10 7  Zhang et al., 2023 ion-exchange method 1.3 × 10 4  Zhang et al., 2024 extraction\nseparation method 9.1 × 10 7  this paper, 2025 countercurrent electrophoresis 8.7 × 10 5  5.8 Model\nModification First, based on\nthe experimental results, we added a boundary condition: Laminar–wall\ncondition–electro-osmotic velocity, with an electro-osmotic\nmigration rate of 7 × 10 –8 2 –1 –1 5 3 5 Figure 6 Conclusion Current research on 90 90 90 90 90 (1) The complexation behaviors of EDTA\nand CIT with 90 90 (2) A predictive CCE model was established\nand refined through mesh quality optimization. Simulation results\ndemonstrated uniform distribution profiles and high separation efficiency\nacross all experimental conditions, with separation factors reaching\n9 × 10 8 4 7 6 5 3 5 5 3 5 (3) Device structure\ndesign is a pivotal\narea of focus for future research. Effective heat dissipation can\nbe achieved through the use of thermal conductive materials and cooling\nsystems, and the smooth flow of the flow field and the problem of\nbubble extraction can be addressed through rational device design.\nSimultaneously selecting appropriate ligands and constructing a two\nion structure with a significant difference in electromigration is\nalso of utmost importance. The paper is sponsored by the National Natural Science\nFoundation of China (U1867205). The authors declare no\ncompeting financial interest. Vimalnath K. V. Chakraborty S. Rajeswari A. Radiochemistry, pre-clinical\nstudies and first clinical investigation of 90 90 Nuclear Medicine &\nBiology 2015 42 5 455 464 10.1016/j.nucmedbio.2015.01.006 25659856 Washburn L. C.  90 Nucl.\nMed. Biol. 1986 13 4 453 456 10.1016/0883-2897(86)90024-3 3793501 Borchardt P. E. Indium-111 and Yttrium-90-labeling human monocolonal\nimmunoglobulin\ntargeting of human ovarian in mice Nucl. Med. 1998 39 1 476 484 9529295 Chinn P. C. Leonard J. E. Rosenberg J. Preclinical evaluation\nof 90 Int. J. Oncol. 1999 15 5 1017 1025 10.3892/ijo.15.5.1017 10536187 Sharkey R. M. Karacay H. Pretargeted versus directly targeted radioimmunotherapy\ncombined with antiCD20 antibody consolidation therapy of nonhodgkin\nlymphoma J. Nucl. Med. 2009 50 3 444 453 10.2967/jnumed.108.058602 19223402 Yin B. S. Li M. Q. Deng Q. M. Research progress of 90 Isotope 2009 22 3 187 192 Knapp F. F. Dash A. Radionuclide generator\nsystems represent convenient production systems to provide therapeutic\nradionuclides Radiopharmaceuticals for\nTherapy Knapp F. F. Springer New Delhi, India 2016 131 157 10.1007/978-81-322-2607-9_7 United States Pharmacopeia\n(USP) Yttrium Y-90 Ibritumomab Tiuxetan\nInjection USP North Bethesda, MD 2012 Kodina G. E. Korpusov G. V. Filyanin A. T. Production of high-purity 90 Radiochemistry 2002 44 1 62 66 10.1023/A:1014883403293 Kanapilly G. M. Newton G. J. A new method for\nthe separation of multicurie quantities\nof 90 90 Int.\nFission Prod Inhal Proj 1971 22 9 567 575 10.1016/0020-708X(71)90056-1 5125370 Chiarizia R. Horwitz E. P. Radiolytic stability\nof some recently developed ion\nexchange and extraction chromatographic resins containing diphosphonic\nacid groups Solvent Extr Exch 2000 18 1 109 132 10.1080/07366290008934675 Hamaguchi H. Isolating of carrier-free\nY from the radioactive Sr-Y system by electrodeposition Japan Analyst 1958 7 4 243 246 10.2116/bunsekikagaku.7.243 Li S. J. Wang H. Q. Zhao W. Y. Research\non Multi physics\nField Coupling Simulation Modeling Method Based on COMSOL Mechanical Engineering and Automation 2014 4 3 Ayan K. Ganar K. Deshpande S. Continuous counter-current\nelectrophoretic separation of oleosomes and proteins from oilseeds Food Hydrocolloids 2023 144 109053 10.1016/j.foodhyd.2023.109053 Tang C. Bondarenko M. P. Yaroshchuk A. Highly selective ion\nseparations based on counter-flow electromigration in nanoporous membranes J. Membr. Sci. 2021 638 119684 10.1016/j.memsci.2021.119684 Hirokawa T. Xia W. Kiso Y. Isotachophoretic separation of rare earth ions I. Separation\nbehaviour of yttrium and fourteen lanthanide ions forming complexes\nwith tartaric acid and α-hydroxyisobutyric acid Journal of Chromatography A 1995 689 1 149 156 10.1016/0021-9673(94)00872-7 Chiarizia R. Horwitz E. P. Radiolytic stability\nof some recently developed ion\nexchange and extraction chromatographic resins containing diphosphonic\nacid groups Solvent Extr Exch 2000 18 1 109 132 10.1080/07366290008934675 Gao Y. X. Lu Y. Miao L. X. Dynamic simulation of electromagnetic\nforce of high-frequency solenoid valve based on COMSOL_Suti physics Journal of Harbin Engineering University 2021 42 11 6 Luo G. A. Wang Y. M. Principles and Applications of Capillary Electrophoresis\n(Lecture 2) Principles and Applications of Capillary Electrophoresis Chromatography 1995 13 6 437 Sorensen H. Sorensen S. Bjergegaard C. Chromatography\nand Capillary Electrophoresis in Food Analysis Royal Society of Chemistry (RSC) London, U.K. 2007 10 10.1039/9781847550521 Kikunaga H. Yoshimura T. Kuribayashi T. Separation of Am (III),\nCm (III), and Cf (III) using capillary electrophoresis Proceedings in Radiochemistry 2011 1 1 167 171 10.1524/rcpr.2011.0031 Moshtarikhah S. Oppers N. A. W. De\nGroot M. T. Nernst–Planck\nmodeling of multicomponent ion transport in a Nafion membrane at high\ncurrent density J. Appl. Electrochem. 2017 47 51 62 10.1007/s10800-016-1017-2 Zhu Z. L. Liang X. M. Zhang R. H. Determination of the\ngeneration stability constants of calcium, magnesium ions and polyaspartic\nacid in solution by pH potentiometric titration Applied Chemistry 2006 4 366 369 Missana T. García-Gutiérrez M. Role of EDTA, citrate and phthalate\non Cs, Sr, Eu and U adsorption by smectite and evaluation by geochemical\nmodeling Appl. Geochem. 2023 159 105811 10.1016/j.apgeochem.2023.105811 Grimes T. S. Nash K. L. Acid dissociation\nconstants and rare earth stability\nconstants for DTPA J. Solution Chem. 2014 43 298 313 10.1007/s10953-014-0139-6 Bai Y. P. Liang Y. Zhang Z. COMSOL simulation\nexploration of\nviscous liquid falling ball experiment Physics\nand Engineering 2024 34 5 181 188 Sezgin B. Caglayan D. G. Devrim Y. Modeling and sensitivity\nanalysis of high temperature PEM fuel cells by using Comsol Multiphysics International Journal of Hydrogen Energy 2016 41 23 10001 10009 10.1016/j.ijhydene.2016.03.142 Pahlow S. Mayerhöfer T. van der Loh M. Interference-enhanced\nRaman spectroscopy as a promising tool for the detection of biomolecules\non Raman-compatible surfaces Anal. Chem. 2018 90 15 9025 9032 10.1021/acs.analchem.8b01234 29992805 Skraba W. J. Arino H. Kramer H. H. A new 90 90 International Journal\nof Applied Radiation and Isotopes 1978 29 2 91 96 10.1016/0020-708X(78)90029-7 Horwitz P. E. Dietz M. L. A Process for the\nSeparation and Purification of Yttrium-90 for Medical Applications Argonne National Laboratory (ANL) Argonne, IL 1993 Pawlak D. W. Parus J. L. Dziel T. Determination\nof 90 90 Talanta 2013 114 1 4 10.1016/j.talanta.2013.03.081 23953432 Pichestapong P. Sriwiang W. Injarean U. Separation of Yttrium-90\nfrom Strontium-90\nby extraction chromatography using combined Sr resin and RE resin Energy Procedia 2016 89 366 372 10.1016/j.egypro.2016.05.048 Chu T. W. Zou Y. A\nstrontium yttrium\nseparation resin and its preparation and application 201510993859.1 2018 Zhang J. S. Geng Z. S. Luo N. A strontium\n[∼ 90 90 202210608292.1 2022 Zhang S. Huang Q. Chen L. Efficient separation\nof strontium in different environments with novel acid-resistant silica-based\nion exchanger Sep. Purif. Technol. 2023 322 124347 10.1016/j.seppur.2023.124347 Zhang X. Tian G.\nX. Yang S.\nL. A method\nfor extracting and separating medical nuclide yttrium from strontium 202410908079.1 2024 Yang D. Y. Wang Y. Ionic concentration\neffects of electroosmotic flow and micro mixing\nin microchannels Applied Mathematics &\nMechanics 2015 36 9 1000-0887 ",
  "metadata": {
    "Title of this paper": "Ionic concentration\neffects of electroosmotic flow and micro mixing\nin microchannels",
    "Journal it was published in:": "ACS Omega",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489618/"
  }
}