{
  "title": "Paper_987",
  "abstract": "pmc Molecules Molecules 3416 molecules molecules Molecules 1420-3049 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472855 PMC12472855.1 12472855 12472855 41011679 10.3390/molecules30183787 molecules-30-03787 1 Article Determination of Selected Hydroxylated PAHs in Urine Samples of Individuals Consuming Grilled Marshmallows https://orcid.org/0000-0003-0916-9972 Szumska Magdalena Conceptualization Methodology Validation Formal analysis Investigation Data curation Writing – original draft Writing – review & editing Supervision Maciejczyk Maciej Methodology Formal analysis Investigation Data curation https://orcid.org/0000-0003-3017-0740 Janoszka Beata Conceptualization Methodology Validation Formal analysis Writing – review & editing Supervision * Damasiewicz-Bodzek Aleksandra Validation Visualization https://orcid.org/0000-0002-1947-9299 Nowak Agnieszka Writing – original draft Visualization https://orcid.org/0000-0003-1009-9027 Tyrpień-Golder Krystyna Conceptualization Investigation Writing – review & editing Supervision * Kataoka Hiroyuki Academic Editor Department of Chemistry, Faculty of Medical Sciences in Zabrze, Medical University of Silesia, 40-055 Katowice, Poland; mszumska@sum.edu.pl d201056@365.sum.edu.pl aleksandra.bodzek@sum.edu.pl agnieszkanowak@sum.edu.pl * bjanoszka@sum.edu.pl ktyrpien@sum.edu.pl 18 9 2025 9 2025 30 18 496804 3787 09 8 2025 08 9 2025 17 9 2025 18 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Marshmallows are confectioneries that are popular among children and teenagers around the world. Barbecues and the consumption of grilled marshmallows, especially by children, have become fashionable in many countries. Grilled marshmallows may contain carcinogenic polycyclic aromatic hydrocarbons (PAHs). Hydroxy-PAHs (OH-PAHs) concentration in the urine of volunteers after the consumption of grilled marshmallows, as biomarkers of exposure to PAHs, have been determined. A total of 24 participants consumed marshmallows grilled under similar conditions. Urine samples were collected before and after the consumption of grilled marshmallows. 1-hydroxypyrene and 9-hydroxyphenanthrene concentrations in urine samples were determined using the HPLC-FLD technique after enzymatic hydrolysis and isolation by solid-phase extraction (SPE). The average concentration of 1-hydroxypyrene was 0.21 ± 0.16 µg/g creatinine and of 9-hydroxypenanthrene was 2.78 ± 2.55 µg/g creatinine. The concentrations of OH-PAHs in the urine of volunteers eating colored grilled marshmallows were higher compared to the consumption of white ones. In the case of 9-hydroxyphenanthrene this difference was statistically significant p grilling marshmallows PAHs 1-hydroxypyrene 9-hydroxyphenanthrene chromatography urine Medical University of Silesia BNW-1-088/K/3/O BNW-1-065/K/4/I BNW-1-007/N/5/I This work was supported by the Medical University of Silesia, grant number BNW-1-088/K/3/O; BNW-1-065/K/4/I and BNW-1-007/N/5/I. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Marshmallows are confectionery products popular among children, teenagers, and adults all over the world. One of the fashionable ways to consume them is grilling over the bonfire or in the oven and even over a candle. Although they do not represent any beneficial nutritional value, marshmallows are generally safe for consumption. However, the grilling process may introduce certain changes in the product’s chemical composition, leading to the formation of potentially harmful compounds. Therefore, frequent consumption of grilled marshmallows may have adverse health effects and can constitute an additional source of exposure to dangerous compounds, including carcinogenic polycyclic aromatic hydrocarbons (PAHs) [ 1 In general PAHs exhibit genotoxicity, mutagenicity, and carcinogenicity, and they can also affect reproduction. According to the International Agency for Research on Cancer (IARC), many of these compounds are possibly carcinogenic (Group 2B), probably carcinogenic (IARC Group 2A), or even carcinogenic to humans (e.g., BaP) (Group 1) [ 2 3 4 In the human body, PAHs undergo complex transformations, leading to the formation of reactive metabolites such as epoxides and phenols. PAHs are also metabolized into other compounds, including numerous quinones [ 5 6 PAH metabolites, especially mono-hydroxy derivatives, may be excreted in the urine as free hydroxy-PAHs (OH-PAHs) and as glucuronide and/or sulfate conjugates. Mono-hydroxy derivatives are commonly used as biomarkers of human exposure to PAHs [ 7 8 9 10 11 12 13 14 Hydroxy-PAHs, as metabolites of PAHs, are markers of exposure to these xenobiotics from various sources. Studies confirm that their determination in urine can be used to assess PAH exposure from the diet, too [ 15 16 17 8 18 19 Since the relative content of pyrene compared to other PAHs is rather constant in environmental samples, and pyrene is a plentiful constituent of all PAH mixtures, 1-hydroxypyrene was and still is chosen for analysis and assessment of both occupational and environmental exposure to PAHs [ 7 Among other hydroxy-PAHs, phenanthrene metabolites are another group that is often studied [ 8 20 21 22 8 In general, hydroxy–PAHs seem to show higher biological activity compared to their parent PAHs because they can interact and form adducts with DNA [ 23 24 25 26 27 21 28 29 Even prenatal PAHs exposure may have a serious impact on the future health of a newborn. A growing body of toxicological research provides evidence of the neurotoxic effects of prenatal PAHs exposure. PAHs may harm the developing brain since they are able to transfer across the placenta, cross the blood–brain barrier, and accumulate in the brain [ 30 31 32 In presented study, we have focused mainly on diet-derived exposure to PAHs. We chose two hydroxy-PAH metabolites: 1-hydroxypyrene that can be feasibly identified at low levels and is reliable and well-established marker of exposure to PAHs; and one of the phenanthrene metabolites, namely 9-hydroxyphenantrene. The choice of phenanthrene metabolite was related to our previous findings concerning grilled marshmallows and their PAHs content. The concentration of phenanthrene determined in grilled marshmallows was the highest among all determined PAHs [ 1 33 The determination of hydroxy-PAHs present in biological and environmental samples at trace levels is most often performed using gas chromatography coupled with mass spectrometry (GC-MS) [ 34 35 36 37 8 16 37 38 39 40 35 41 42 43 44 The determination of OH-PAHs using any of the techniques mentioned above requires adequate preparation of the biological sample. Most often, such samples undergo enzymatic hydrolysis, followed by liquid or solid-phase extraction (SPE) [ 8 16 38 39 43 45 Marshmallows are treats that children enjoy eating during barbecue parties or around campfires. It seems important to know whether eating grilled marshmallows constitutes an additional source of PAHs exposure for humans. Therefore, the aim of our study was to determine the levels of two selected PAH metabolites, namely 9-hydroxyphenanthrene and 1-hydroxypyrene, in urine samples collected from individuals before and after the consumption of grilled marshmallows. The study group consisted mainly of children and, to a lesser extent, young adults. The measurements were performed using high-performance liquid chromatography with fluorescence detection. 2. Results and Discussion Food is one of the most important factors in human exposure to PAHs [ 46 47 48 49 1 50 51 3 40 52 Previous studies have confirmed that grilled marshmallows contain polycyclic aromatic hydrocarbons in concentrations of several ng/g [ 1 1 Studies performed by Motorykin et al. have demonstrated a positive association between ingested levels of phenanthrene and pyrene and the urinary levels of their metabolites, proving that metabolites of phenanthrene and pyrene can be reliable biomarkers of PAHs exposure [ 9 In our study each urine sample of the volunteers was analyzed according to the procedure described in Methods ( Section 3.7 Figure 1 Figure 1 Validation parameters of the determination procedure of 1-hydroxypyrene and 9-hydroxyphenanthrene are presented in Table 1 recovery  =  C 1  −  C 2 C  ×  100 % 1 2 41 41 8 53 Table 1 54 The limits of detection (LOD) were calculated based on the signal-to-noise ratio S/N = 3 for 10 µL injection of standard solution onto the column. They were determined to be 0.15 ng/mL for both 9-hydroxyphenanthrene and 1-hydroxypyrene. The limit of quantification (LOQ) was calculated as 3 × LOD [ 55 The lowest 9-hydroxyphenanthrene and 1-hydroxypyrene concentrations that could be determined in urine samples were 0.025 ng/mL of urine for the method of preparation, extraction, and HPLC-FLD determination described in Section 3.7 The intra-day precision (repeatability) of the method was calculated as relative standard deviation (RSD%) of data obtained on the same day (n = 5) for samples with concentrations 10 ng/mL, 25 ng/mL, 50 ng/mL, and 100 ng/mL (for 10 µL injection). These ranged from 0.3% (1-hydroxypyrene, 25 ng/mL) to 3.0% (1-hydroxypyrene, 10 ng/mL). The inter-day precision (intermediate precision) of the method was also calculated as RSD% over five days, and it ranged from 0.9% (9-hydroxyphenanthrene, 10 ng/mL) to 5.6% (1-hydroxypyrene, 10 ng/mL). The HPLC-FLD method allowed us to determine selected hydroxy PAHs with sufficient recovery and satisfactory repeatability. HPLC-FLD methods were often used by other authors for the determination of OH-PAHs in biological or environmental samples [ 41 42 42 43 44 OH-PAH concentrations in urine samples from volunteers who consumed grilled marshmallows were normalized for changes in an individual’s urine flow rate by creatinine concentration (µg/g creatinine). The creatinine concentration in these samples ranged from 44 mg/dL to 243 mg/dL. The concentrations of 1-hydroxypyrene and 9-hydroxyphenanthrene in these urine samples per g of creatinine were approximately 0.21 ± 0.16 µg/g and 2.78 ± 2.55 µg/g creatinine, respectively. The results obtained from testing urine samples collected before and after the consumption of grilled marshmallows indicate that the differences between the mean concentrations of 1-hydroxypyrene before and after the consumption of grilled marshmallows were statistically significant p Figure 2 The same applies to 9-hydroxyphenanthrene ( Figure 3 The mean concentrations of the determined hydroxy-PAHs in the urine of volunteers consuming white and colored grilled marshmallows are presented in Table 2 Similarly to our previous studies [ 1 p Phenanthrene and pyrene are among the PAHs most frequently found in different environments and in various food matrices [ 1 40 56 34 57 40 Most studies published to date have focused on the determination of 1-hydroxypyrene, as monohydroxylated PAH derivatives are most frequently the target of studies [ 8 58 Urine is the primary route of excretion of PAHs and their metabolites. Analyzing urinary 1-hydroxypyrene in pregnant women in Rochester, Lin et al. found that changes in concentration of this compound were related to household income, education level and distance of residence from means of transport that were the source of PAH emissions [ 59 40 In general, children and especially infants are extremely susceptible to adverse health consequences after exposure to toxic compounds like PAHs. Their metabolic and physiological defense functions are not fully developed. Enzymes such as cytochrome P450 taking part in the detoxification of xenobiotics are less efficacious in early life periods compared to adult life. Therefore, special attention to the health of children exposed to toxic substances is crucial [ 18 21 60 21 20 18 61 In our study, we did not analyze boys and girls separately due to the small investigation group. Fernández et al. noted that girls presented higher 9-hydroxyphenanthrene and 1-hydroxypyrene metabolites levels compared to boys of the same age group. Huang et al. noticed a similar tendency; however, the significance of the results seemed to depend on different statistical methods applied [ 21 60 20 When it comes to the distribution of PAHs from diet, data obtained by Lapole et al. in an animal study suggests that the highest pyrene concentration in plasma was found within the first 2 h after exposition to PAHs, and it fell rapidly. In case of phenanthrene, its concentration increased slightly during the first hour after oral intake and slowly decreased until 20 h. The excretion of its metabolites via urine was the highest after 8 h; however, they also were detected at significant levels during the period of 0 to 4 h [ 62 Studies using deuterium-labeled polycyclic aromatic hydrocarbons (PAHs), including phenanthrene and pyrene, administered orally in a single dose (0.02–0.04 mg/kg) to eight healthy adults showed that monohydroxylated PAHs were excreted in urine with half-life values ranging from 3.4 to 11.0 h [ 4 Figure 2 Figure 3 9 Examples of daily distributions of hydroxyl-PAHs concentrations determined in urine samples of volunteers consuming grilled marshmallows are presented in Figure 4 The concentration of OH-PAHs in urine might depend on the volume of drank beverages, the frequency of urination, as well as on the exposure to other sources of PAHs (place of residence related to air quality and food consumed) [ 3 52 Figure 4 7 39 52 Figure 5 7 39 52 63 64 65 66 67 68 69 70 71 Few studies have been published on the excretion rates of parent PAHs and OH-PAHs following oral exposure. In study by Motorykin at al., the metabolism and excretion rates of four parent PAHs and ten OH-PAHs after consuming smoked salmon were examined. The participants of the study consumed 50 g of traditionally smoked salmon with breakfast, and five urine samples were collected over the 24 h. OH-PAH concentrations initially increased. The concentrations of most parent PAHs and their metabolites returned to background levels 24 h after ingestion which was also observed in our study [ 9 The concentrations of metabolites excreted in urine undoubtedly depend on the type and the amount of food consumed. According to Li et al., the ingested barbecued chicken mass correlated with concentrations of 3- and 4-hydroxyphenanthrenes. Moreover, the various routes of exposure also influenced the half-life of investigated metabolites (from 4.4 to 29 h for metabolites of phenanthrene and 4.4 to 12 h for pyrene metabolites). The median concentration of 1-hydroxypyrene was higher than in our study (1.86 µg/g creatinine), which also confirms the influence of the type of food consumed. The observed OH-PAH levels reached maximum in less than 8.5 h among the participants who were eating grilled chicken, and the majority of the urinary OH-PAHs were excreted within 12 h after the exposure [ 17 Environmental factors were believed to be contributors to human aging and human health status. PAHs are ubiquitous in the environment, and humans are exposed to PAHs at background concentrations, particularly in more industrialized regions and larger metropolitan areas such as Upper Silesia in Poland; nevertheless, the need for dietary control in biomonitoring PAHs exposure is undoubtedly necessary [ 72 Reducing exposure to PAHs through the diet in the general population, especially vulnerable groups such as children, can be made by establishing appropriate regulations and biomonitoring [ 49 3. Materials and Methods 3.1. Chemicals and Reagents Sodium azide (analytical-reagent grade) for preserving urine samples, glacial acetic acid (analytical-reagent grade) to prepare acetate buffer, acetone (analytical-reagent grade), methanol (HPLC-grade), and natrium hydroxide (analytical-reagent grade) were from Avantor™ Performance Materials (Gliwice, Poland). Hydrochloric acid (37%, analytical grade) was delivered from Chemland (Katowice, Poland). Water was obtained from a water deionizer system Polwater DL-2 (Labopol-Polwater, Kraków, Poland). Helix pomatia 3.2. Hydroxy-PAHs Standards 1-hydroxypyrene (purity > 98%) and 9-hydroxyphenanthrene (purity > 98%) were purchased from Sigma Aldrich (St. Luis, MO, USA). The structures of these compounds are shown in Figure 6 3.3. Apparatus Solid-phase extraction (SPE) system (J.T. Baker, Gross Gerau, Germany) and SPE columns J.T.Baker ® OH-PAHs determination was conducted using a high-performance liquid chromatography (HPLC) system Ultimate 3000 TSL (Dionex Softron, Germering, Germany), consisting of a thermostated autosampler WPS-3000 TSL (Dionex Softron, Germering, Germany), a column compartment TCC-3200 (Dionex Softron, Germering, Germany) with a Hypersil Green PAH column (particle size 5 µm; 250 × 4.6 mm I.D; Thermo Scientific, Waltham, MA, USA), and a fluorescence detector (FLD) (Shimadzu RF-2000, Kyoto, Japan). Analysis monitoring and data collection were carried out using Chromeleon software (version 6.80 SP2 Build 2284; Dionex Softron, Germering, Germany). 3.4. Grilled Marshmallows The marshmallow grilling procedure was described in detail in our previous manuscript [ 1 3.5. Characteristics of Participants Consuming Grilled Marshmallows The study involved 24 people aged from 8 to 18 years, 12 boys and 12 girls. The average age of the study participants was 12.6 years. The volunteers who consumed white (16) and colored (8) marshmallows mainly lived in the Podkarpackie and Silesian provinces of Poland. They were not exposed to polycyclic aromatic hydrocarbons through ingestion or inhalation more than the other residents of these regions. The study was approved by the bioethics committee—approval number PCN/CBN/0052/KB1/18/22, dated 12 April 2022. Participants in the experiment were approximately 50 m away from the marshmallow grilling site (except for the griller). The experiment was conducted on a sunny, warm summer day, away from an urbanized area. In addition, participants were asked not to eat smoked, grilled, or roasted foods the day before the experiment. These restrictions were intended to limit the study participants’ exposure to PAHs from sources other than grilled marshmallows. 3.6. Urine Sampling All urine samples were collected from individuals consuming marshmallows during the same barbecue. After obtaining informed consent from the study participants or their parents, urine samples were collected before the consumption and after the consumption of grilled marshmallows. Urine samples from people just before eating grilled marshmallows were used as a control. Next, approximately 100 mL of urine was collected from each micturition, starting with the micturition about 2–3 h after consuming the marshmallows, then the sampling was made 6–8 and 12–14 h after the consumption. The last sampling was taken approximately within 24 h after consuming the marshmallows. A 24 h urine collection was not performed due to technical and logistical difficulties in its execution. Creatinine in urine was determined spectrophotometrically as picrate according to the Jaffé method [ 73 74 3.7. Analysis of Hydroxy-PAHs in Urine The analysis of selected hydroxy-PAHs was performed according to the sensitive method recommended by Jongeneelen et al. The pretreatment of samples was based on a scheme involving stages of enzymatic hydrolysis and SPE clean-up. The determination of metabolites was carried out according to our own modified method [ 41 3.7.1. Hydrolysis In order to release hydroxy-PAHs from the glucuronic and sulfuric acid complex, urine samples were treated with enzymes β-glucuronidase/arylsulfatase. First, 0.1 mol/L of hydrochloric acid was added to each 10 mL urine sample to obtain solutions of pH 5.5, followed by adding 10 mg of sodium azide. To the samples prepared in this way, 40 µL of enzyme (β-glucuronidase /arylsulfatase) and 2 mL of acetate buffer of 1 mol/L, pH = 4 were added. Next, the samples were incubated for 16 h at 37 °C, and after incubation the OH-PAHs were extracted using the SPE technique. 3.7.2. Solid-Phase Extraction of the Hydroxy-PAHs-Containing Fraction Extraction was carried out using C-18 500 mg/6 mL columns. Before applying the samples, the columns were conditioned by washing with 5 mL of methanol and 10 mL of deionized water. After applying the hydrolyzed urine samples, the columns were washed with 10 mL of deionized water and then dried. The analyzed compounds retained on the SPE bed were eluted with 5 mL of a mixture of methanol–acetone (1:1, v v 3.7.3. Determination of Hydroxy-PAHs by HPLC-FLD High-performance liquid chromatography with fluorescence detection was used to determine the concentrations of selected hydroxy-PAHs in the urine sample extracts. The injection volume of each extract was 10 µL. The chromatographic separations on the Hypersil Green PAH column were performed under gradient conditions by using methanol and water. The eluent flow rate was as follows: 80% MeOH and 20% water from 0.0 to 3.0 min, then increasing to 100% MeOH until 5.0 min, followed by a plateau (100% methanol) until 10.0 min. From 10.01 min to 13.0 min, the MeOH content decreased to 80%. The flow of eluents of this composition was maintained until 17.0 min of analysis. The flow rate of the mobile phase was 0.8 mL/min. The chromatographic column temperature was set to 40 °C. Under these separation conditions, retention times were as follows: 5.67 min for 9-hydroxyphenatrene and 8.1 min for 1-hydroxypyrene. The fluorescence detection was performed by the following excitation and emission (Ex/Em) wavelengths: 242/389 nm. These wavelengths were selected based on the literature data [ 13 41 Retention times were recorded for 9-hydroxyphenathrene and 1-hydroxypyrene standards. These values were compared with the retention times of compounds identified in extracts of urine samples in order to confirm the presence of OH-PAHs. Quantitative analysis of OH-PAHs was performed using the injection of 10 µL of standard mixture (in MeOH), on the basis of linear calibration plots recorded in the range of 0.5 ng/mL to 250 ng/mL for 9-hydroxyphenanthrene and 0.5 ng/mL to 100 ng/mL for 1-hydroxypyrene. Calibration graphs were constructed using the least-squares method for eight points of concentration. The calibration coefficients r 3.8. Statistical Analysis Statistical analysis was performed using the Statistica 13.3 software (TIBCO Software Inc., Palo Alto, CA, USA). The results were compiled using basic parameters of descriptive statistics. The compatibility of the variable with normal distribution was checked by Shapiro–Wilk test. The Wilcoxon signed-rank test was used to compare the concentration of both hydroxy-PAHs in urine before and after grilled marshmallow consumption. The Mann–Whitney test was used to compare the mean urine PAHs concentration between the group consuming white and colored marshmallows. A p 4. Conclusions The elaborated method of analysis of hydroxy-PAHs in urine samples proved to be an efficient analytical tool for the determination of biomarkers of PAHs exposure from grilled food. Our preliminary study indicated that even the consumption of small or moderate amounts of grilled marshmallows, white and colored, resulted in an increase in concentrations of analyzed 1-hydroxypyrene and 9-hydroxyphenanthrene, compared to the level of these compounds before the consumption. However, to elucidate the exact rates of PAHs exposure from grilled marshmallows, large-scale, long-term studies in conjunction with mechanistic studies are needed. Such studies would have to consider in more detail the effects of factors such as diet and environmental exposure, and assess dose–response relationships. The lack of knowledge regarding carcinogenic substance content in food constitutes a social problem, especially among young people who are beginning the process of developing eating habits for future health status. Grilled confectionery products can be a new, additional source of exposure to PAHs, which should be taken into consideration, primarily in children and the adolescent population. Acknowledgments The authors thank technical staff from the Department of Chemistry in Zabrze, Medical University of Silesia, Katowice, Poland. The authors would like to thank Felix Danso for his linguistic proofreading of this work. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, K.T.-G., B.J., M.S. and M.M.; methodology, M.S., B.J., and M.M.; validation B.J., M.S. and A.D.-B.; investigation, M.M., M.S., and K.T.-G.; data curation, M.S., M.M.; original draft preparation, M.S. and A.N.; visualization, A.D.-B. and A.N.; writing—review and editing, B.J., M.S. and K.T.-G.; supervision, M.S., B.J. and K.T.-G. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement This study was conducted in accordance with the Declaration of Helsinki and approved by the Ethics Committee of the Medical University of Silesia (PCN/CBN/0052/KB1/18/22; 12 April 2022) for studies involving humans. Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Data Availability Statement The raw data supporting the conclusions of this article will be made available by the authors on request. Conflicts of Interest The authors declare no conflicts of interest. References 1. Maciejczyk M. Janoszka B. Szumska M. Pastuszka B. Waligóra S. Damasiewicz-Bodzek A. Nowak A. Tyrpień-Golder K. Polycyclic Aromatic Hydrocarbons (PAHs) in Grilled Marshmallows Molecules 2024 29 3119 10.3390/molecules29133119 38999071 PMC11243050 2. International Agency for Research on Cancer (IARC) Agents Classified by the IARC Monographs, Volumes 1–139 Available online: https://monographs.iarc.who.int/agents-classified-by-the-iarc/ (accessed on 4 August 2025) 3. Nsonwu-Anyanwu A.C. Helal M. Khaled A. Elnemr A. Ejemot-Nwadiaro R.I. Usoro C.A.O. EL-Sikaily A. Urinary Biomonitoring and Cancer Risk Assessment of Polycyclic Aromatic Hydrocarbon Exposure in Relation to Water Intake in Calabar, Nigeria Expo. Health 2025 17 875 886 10.1007/s12403-025-00704-5 4. Choi J.W. Kim M. Song G. Kho Y. Choi K. Shin M.-Y. Kim S. Toxicokinetic Analyses of Naphthalene, Fluorene, Phenanthrene, and Pyrene in Humans after Single Oral Administration Sci. Total Environ. 2023 870 161899 10.1016/j.scitotenv.2023.161899 36716884 5. Monteiro V. Dias da Silva D. Martins M. Guedes de Pinho P. Pinto J. Metabolomics Perspectives of the Ecotoxicological Risks of Polycyclic Aromatic Hydrocarbons: A Scoping Review Environ. Res. 2024 249 118394 10.1016/j.envres.2024.118394 38307181 6. Shimada T. Xenobiotic-Metabolizing Enzymes Involved in Activation and Detoxification of Carcinogenic Polycyclic Aromatic Hydrocarbons Drug Metab. Pharmacokinet. 2006 21 257 276 10.2133/dmpk.21.257 16946553 7. Zając J. Gomółka E. Szot W. Urinary 1-Hydroxypyrene in Occupationally-Exposed and Non-Exposed Individuals in Silesia, Poland Ann. Agric. Environ. Med. 2018 25 625 629 10.26444/aaem/75940 30586979 8. Styszko K. Pamuła J. Pac A. Sochacka-Tatara E. Biomarkers for Polycyclic Aromatic Hydrocarbons in Human Excreta: Recent Advances in Analytical Techniques—A Review Environ. Geochem. Health 2023 45 7099 7113 10.1007/s10653-023-01699-1 37530922 PMC10517897 9. Motorykin O. Santiago-Delgado L. Rohlman D. Schrlau J.E. Harper B. Harris S. Harding A. Kile M.L. Massey Simonich S.L. Metabolism and Excretion Rates of Parent and Hydroxy-PAHs in Urine Collected after Consumption of Traditionally Smoked Salmon for Native American Volunteers Sci. Total Environ. 2015 514 170 177 10.1016/j.scitotenv.2015.01.083 25659315 PMC4361301 10. Li J. Zhu Y. Ji X. Huang D. Ge M. Wang W. Li J. Li M. Chen C. Zhao J. Oxidation of Polycyclic Aromatic Hydrocarbons (PAHs) Triggered by a Photochemical Synergistic Effect between High- and Low-Molecular-Weight PAHs Environ. Sci. Technol. 2024 58 17807 17816 10.1021/acs.est.4c08661 39347567 11. Atkinson R. Arey J. Atmospheric Chemistry of Gas-Phase Polycyclic Aromatic Hydrocarbons: Formation of Atmospheric Mutagens Environ. Health Perspect. 1994 102 117 126 10.1289/ehp.94102s4117 PMC1566940 7821285 12. Mallakin A. George Dixon D. Greenberg B.M. Pathway of Anthracene Modification under Simulated Solar Radiation Chemosphere 2000 40 1435 1441 10.1016/S0045-6535(99)00331-8 10789985 13. Barrado A.I. Garcia S. Castrillejo Y. Perez R.M. Hydroxy–PAH Levels in Atmospheric PM10 Aerosol Samples Correlated with Season, Physical Factors and Chemical Indicators of Pollution Atmos. Pollut. Res. 2012 3 81 87 10.5094/APR.2012.007 14. Ratelle M. Khoury C. Adlard B. Laird B. Polycyclic Aromatic Hydrocarbons (PAHs) Levels in Urine Samples Collected in a Subarctic Region of the Northwest Territories, Canada Environ. Res. 2020 182 109112 10.1016/j.envres.2020.109112 32069740 15. Du W. Jiang S. Lei Y. Wang J. Cui Z. Xiang P. Chang Z. Duan W. Shen G. Qin Y. Occurrence, Formation Mechanism, and Health Risk of Polycyclic Aromatic Hydrocarbons in Barbecued Food Ecotoxicol. Environ. Saf. 2025 293 118046 10.1016/j.ecoenv.2025.118046 40086033 16. Lou X.-Y. Wu P.-R. Guo Y. Urinary Metabolites of Polycyclic Aromatic Hydrocarbons in Pregnant Women and Their Association with a Biomarker of Oxidative Stress Environ. Sci. Pollut. Res. 2019 26 27281 27290 10.1007/s11356-019-05855-y 31325095 17. Li Z. Romanoff L. Bartell S. Pittman E.N. Trinidad D.A. McClean M. Webster T.F. Sjödin A. Excretion Profiles and Half-Lives of Ten Urinary Polycyclic Aromatic Hydrocarbon Metabolites after Dietary Exposure Chem. Res. Toxicol. 2012 25 1452 1461 10.1021/tx300108e 22663094 PMC4618384 18. Pérez-Maldonado I.N. Ochoa-Martínez Á.C. López-Ramírez M.L. Varela-Silva J.A. Urinary Levels of 1-Hydroxypyrene and Health Risk Assessment in Children Living in Mexican Communities with a High Risk of Contamination by Polycyclic Aromatic Hydrocarbons (PAHs) Int. J. Environ. Health Res. 2019 29 348 357 10.1080/09603123.2018.1549727 30468079 19. Montano L. Baldini G.M. Piscopo M. Liguori G. Lombardi R. Ricciardi M. Esposito G. Pinto G. Fontanarosa C. Spinelli M. Polycyclic Aromatic Hydrocarbons (PAHs) in the Environment: Occupational Exposure, Health Risks and Fertility Implications Toxics 2025 13 151 10.3390/toxics13030151 40137477 PMC11946043 20. Trask M. Rahman S.M. Kampouri M. Raqib R. Ekström E.-C. Kajantie E. Islam M.R. Krais A.M. Lindh C. Rahman A. Childhood Exposure to Polycyclic Aromatic Hydrocarbons (PAHs) and Cardiometabolic Indicators in Childhood and Adolescence: Findings from a Cohort Study in Rural Bangladesh Environ. Res. 2025 278 121653 10.1016/j.envres.2025.121653 40254235 21. Huang X. Deng X. Li W. Liu S. Chen Y. Yang B. Liu Q. Internal Exposure Levels of Polycyclic Aromatic Hydrocarbons in Children and Adolescents: A Systematic Review and Meta-Analysis Environ. Health Prev. Med. 2019 24 50 10.1186/s12199-019-0805-9 31351468 PMC6661086 22. Poursafa P. Amin M.M. Hajizadeh Y. Mansourian M. Pourzamani H. Ebrahim K. Sadeghian B. Kelishadi R. Association of Atmospheric Concentrations of Polycyclic Aromatic Hydrocarbons with Their Urinary Metabolites in Children and Adolescents Environ. Sci. Pollut. Res. 2017 24 17136 17144 10.1007/s11356-017-9315-8 28585013 23. Nakken C.L. Sørhus E. Holmelid B. Meier S. Mjøs S.A. Donald C.E. Transformative Knowledge of Polar Polycyclic Aromatic Hydrocarbons via High-Resolution Mass Spectrometry Sci. Total Environ. 2025 960 178349 10.1016/j.scitotenv.2024.178349 39787868 24. Ning X. Du N. Zhang X. Wang S. Zhi Y. Li Z. Ren Z. Ku T. Li G. Sang N. Metastatic Effects of Hydroxy-Polycyclic Aromatic Hydrocarbons on Liver Cancer Cells Mediated by Estrogen Receptor α Sci. Total Environ. 2024 952 175878 10.1016/j.scitotenv.2024.175878 39222821 25. Qigang N. Afra A. Ramírez-Coronel A.A. Turki Jalil A. Mohammadi M.J. Gatea M.A. Efriza Asban P. Mousavi S.K. Kanani P. The Effect of Polycyclic Aromatic Hydrocarbon Biomarkers on Cardiovascular Diseases Rev. Environ. Health 2024 39 841 851 10.1515/reveh-2023-0070 37775307 26. Wang X. Li A. Xu Q. The Association between Urinary Polycyclic Aromatic Hydrocarbons Metabolites and Type 2 Diabetes Mellitus Int. J. Environ. Res. Public Health 2022 19 7605 10.3390/ijerph19137605 35805265 PMC9265723 27. Zhang W. Sun Z. Zhang Q. Sun Z. Su Y. Song J. Wang B. Gao R. Preliminary Evidence for an Influence of Exposure to Polycyclic Aromatic Hydrocarbons on the Composition of the Gut Microbiota and Neurodevelopment in Three-Year-Old Healthy Children BMC Pediatr. 2021 21 86 10.1186/s12887-021-02539-w 33596845 PMC7888120 28. Liu C. Liu Q. Song S. Li W. Feng Y. Cong X. Ji Y. Li P. The Association between Internal Polycyclic Aromatic Hydrocarbons Exposure and Risk of Obesity—A Systematic Review with Meta-Analysis Chemosphere 2023 329 138669 10.1016/j.chemosphere.2023.138669 37059208 29. Rezaei Kalantary R. Jaffarzadeh N. Rezapour M. Hesami Arani M. Association between Exposure to Polycyclic Aromatic Hydrocarbons and Attention Deficit Hyperactivity Disorder in Children: A Systematic Review and Meta-Analysis Environ. Sci. Pollut. Res. 2020 27 11531 11540 10.1007/s11356-020-08134-3 32124297 30. Sun B. Wallace E.R. Ni Y. Loftus C.T. Szpiro A. Day D. Barrett E.S. Nguyen R.H.N. Kannan K. Robinson M. Prenatal Exposure to Polycyclic Aromatic Hydrocarbons and Cognition in Early Childhood Environ. Int. 2023 178 108009 10.1016/j.envint.2023.108009 37331181 PMC10519343 31. Li Z. Han Y. Li X. Xiong W. Cui T. Xi W. Jin S. Zhang X. Polycyclic Aromatic Hydrocarbons Exposure in Early Pregnancy on Child Neurodevelopment Environ. Pollut. 2025 366 125527 10.1016/j.envpol.2024.125527 39675657 32. Šrám R.J. Solanský I. Pastorková A. Velemínský M. Velemínský M. Hoňková K. Barošová H. Schmuczerová J. Urbancová K. Dvořáková D. Prenatal Exposure to Polycyclic Aromatic Hydrocarbons and Growth Parameters J. Appl. Biomed. 2024 22 12 22 10.32725/jab.2024.004 38505966 33. Li J. Zhu X. Yu K. Jiang H. Zhang Y. Wang B. Liu X. Deng S. Hu J. Deng Q. Exposure to Polycyclic Aromatic Hydrocarbons and Accelerated DNA Methylation Aging Environ. Health Perspect. 2018 126 10.1289/EHP2773 29906262 PMC6108582 34. Grova N. Monteau F. Le Bizec B. Feidt C. Andre F. Rychen G. Determination of Phenanthrene and Hydroxyphenanthrenes in Various Biological Matrices at Trace Levels Using Gas Chromatography-Mass Spectrometry J. Anal. Toxicol. 2005 29 175 181 10.1093/jat/29.3.175 15842760 35. Campo L. Rosella F. Fustinoni S. Development of a Gas Chromatography/Mass Spectrometry Method to Quantify Several Urinary Monohydroxy Metabolites of Polycyclic Aromatic Hydrocarbons in Occupationally Exposed Subjects J. Chromatogr. B 2008 875 531 540 10.1016/j.jchromb.2008.10.017 18952507 36. Dugheri S. Bonari A. Gentili M. Cappelli G. Pompilio I. Bossi C. Arcangeli G. Campagna M. Mucci N. High-Throughput Analysis of Selected Urinary Hydroxy Polycyclic Aromatic Hydrocarbons by an Innovative Automated Solid-Phase Microextraction Molecules 2018 23 1869 10.3390/molecules23081869 30050023 PMC6222761 37. Nowakowski M. Rykowska I. Wolski R. Andrzejewski P. Polycyclic Aromatic Hydrocarbons (PAHs) and Their Derivatives (O-PAHs, N-PAHs, OH-PAHs): Determination in Suspended Particulate Matter (SPM)—A Review Environ. Process. 2022 9 2 10.1007/s40710-021-00555-7 38. Zhu H. Martinez-Moral M.-P. Kannan K. Variability in Urinary Biomarkers of Human Exposure to Polycyclic Aromatic Hydrocarbons and Its Association with Oxidative Stress Environ. Int. 2021 156 106720 10.1016/j.envint.2021.106720 34166875 PMC8380707 39. Park N.-Y. Song G. Lee K. Kho Y. Levels of OH-PAHs and Markers of Oxidative Stress in Urine of Taxi Drivers and Controls Environ. Anal. Health Toxicol. 2024 39 e2024027 10.5620/eaht.2024027 39973073 PMC11852292 40. Oliveira M. Duarte S. Delerue-Matos C. Pena A. Morais S. Exposure of Nursing Mothers to Polycyclic Aromatic Hydrocarbons: Levels of Un-Metabolized and Metabolized Compounds in Breast Milk, Major Sources of Exposure and Infants’ Health Risks Environ. Pollut. 2020 266 115243 10.1016/j.envpol.2020.115243 32702605 41. Jongeneelen F.J. Anzion R.B.M. Henderson P.T. Determination of Hydroxylated Metabolites of Polycyclic Aromatic Hydrocarbons in Urine J. Chromatogr. B Biomed. Sci. Appl. 1987 413 227 232 10.1016/0378-4347(87)80230-X 3558672 42. Kishikawa N. Morita S. Wada M. Ohba Y. Nakashima K. Kuroda N. Determination of Hydroxylated Polycyclic Aromatic Hydrocarbons in Airborne Particulates by High-Performance Liquid Chromatography with Fluorescence Detection Anal. Sci. 2004 20 129 132 10.2116/analsci.20.129 14753270 43. Oliveira M. Slezakova K. Alves M.J. Fernandes A. Teixeira J.P. Delerue-Matos C. Pereira M.d.C. Morais S. Firefighters’ Exposure Biomonitoring: Impact of Firefighting Activities on Levels of Urinary Monohydroxyl Metabolites Int. J. Hyg. Environ. Health 2016 219 857 866 10.1016/j.ijheh.2016.07.011 27449739 44. Berger-Brito I. Machour N. Morin C. Portet-Koltalo F. Experimental Designs for Optimizing Multi-Residual Microwave-Assisted Extraction and Chromatographic Analysis of Oxygenated (Hydroxylated, Quinones) Metabolites of PAHs in Sediments Chromatographia 2018 81 1401 1412 10.1007/s10337-018-3584-3 45. Romanoff L.C. Li Z. Young K.J. Blakely N.C. Patterson D.G. Sandau C.D. Automated Solid-Phase Extraction Method for Measuring Urinary Polycyclic Aromatic Hydrocarbon Metabolites in Human Biomonitoring Using Isotope-Dilution Gas Chromatography High-Resolution Mass Spectrometry J. Chromatogr. B 2006 835 47 54 10.1016/j.jchromb.2006.03.004 16563884 46. Sampaio G.R. Guizellini G.M. da Silva S.A. de Almeida A.P. Pinaffi-Langley A.C.C. Rogero M.M. de Camargo A.C. Torres E.A.F.S. Polycyclic Aromatic Hydrocarbons in Foods: Biological Effects, Legislation, Occurrence, Analytical Methods, and Strategies to Reduce Their Formation Int. J. Mol. Sci. 2021 22 6010 10.3390/ijms22116010 34199457 PMC8199595 47. Sahin S. Ulusoy H.I. Alemdar S. Erdogan S. Agaoglu S. The Presence of Polycyclic Aromatic Hydrocarbons (PAHs) in Grilled Beef, Chicken and Fish by Considering Dietary Exposure and Risk Assessment Food Sci. Anim. Resour. 2020 40 675 688 10.5851/kosfa.2020.e43 32968721 PMC7492177 48. Nsonwu-Anyanwu A.C. Helal M. Khaked A. Eworo R. Usoro C.A.O. EL-Sikaily A. Polycyclic Aromatic Hydrocarbons Content of Food, Water and Vegetables and Associated Cancer Risk Assessment in Southern Nigeria PLoS ONE 2024 19 e0306418 10.1371/journal.pone.0306418 39042616 PMC11265677 49. Lu J. Zhang Y. Zhou H. Cai K. Xu B. A Review of Hazards in Meat Products: Multiple Pathways, Hazards and Mitigation of Polycyclic Aromatic Hydrocarbons Food Chem. 2024 445 138718 10.1016/j.foodchem.2024.138718 38364501 50. Ingenbleek L. Veyrand B. Adegboye A. Hossou S.E. Koné A.Z. Oyedele A.D. Kisito C.S.K.J. Dembélé Y.K. Eyangoh S. Verger P. Polycyclic Aromatic Hydrocarbons in Foods from the First Regional Total Diet Study in Sub-Saharan Africa: Contamination Profile and Occurrence Data Food Control. 2019 103 133 144 10.1016/j.foodcont.2019.04.006 51. Hamidi E.N. Hajeb P. Selamat J. Lee S.Y. Abdull Razis A.F. Bioaccessibility of Polycyclic Aromatic Hydrocarbons (PAHs) in Grilled Meat: The Effects of Meat Doneness and Fat Content Int. J. Environ. Res. Public Health 2022 19 736 10.3390/ijerph19020736 35055557 PMC8775937 52. Oliveira M. Slezakova K. Delerue-Matos C. Pereira M.C. Morais S. Children Environmental Exposure to Particulate Matter and Polycyclic Aromatic Hydrocarbons and Biomonitoring in School Environments: A Review on Indoor and Outdoor Exposure Levels, Major Sources and Health Impacts Environ. Int. 2019 124 180 204 10.1016/j.envint.2018.12.052 30654326 53. Ponsawansong P. Prapamontol T. Singkaew J. Li G. Pan X. Significantly Elevated Urinary OH-PAHs and Oxidative Damage Concentrations Attributable to PM2.5 Exposure: A Panel Study of Preaging Females in Chiang Mai, Thailand Nat. Life Sci. Commun. 2024 23 10.12982/NLSC.2024.015 54. The Commission of the European Communities 2002/657/EC: Commission Decision of 12 August 2002 Implementing Council Directive 96/23/EC Concerning the Performance of Analytical Methods and the Interpretation of Results (Text with EEA Relevance) (Notified Under Document Number C(2002) 3044) Available online: https://eur-lex.europa.eu/eli/dec/2002/657/oj/eng (accessed on 7 September 2025) 55. Konieczko P. Namieśnik J. Ocena i Kontrola Jakości Wyników Pomiarów Analitycznych Wydawnictwo Naukowe PWN Warszawa, Poland 2017 56. Zelinkova Z. Wenzl T. The Occurrence of 16 EPA PAHs in Food—A Review Polycycl. Aromat. Compd. 2015 35 248 284 10.1080/10406638.2014.918550 26681897 PMC4673601 57. EFSA Polycyclic Aromatic Hydrocarbons in Food—Scientific Opinion of the Panel on Contaminants in the Food Chain EFSA J. 2008 6 724 10.2903/j.efsa.2008.724 58. Jeng H.A. Pan C.-H. 1-Hydroxypyrene as a Biomarker for Environmental Health General Methods in Biomarker Research and Their Applications Springer Dordrecht, The Netherlands 2014 1 15 59. Lin Y. Craig E. Liu X. Ge Y. Brunner J. Wang X. Yang Z. Hopke P.K. Miller R.K. Barrett E.S. Urinary 1-Hydroxypyrene in Pregnant Women in a Northeastern U.S. City: Socioeconomic Disparity and Contributions from Air Pollution Sources J. Expo. Sci. Environ. Epidemiol. 2024 34 407 415 10.1038/s41370-023-00555-9 37161057 PMC11478045 60. Fernández S.F. Pardo O. Hernández C.S. Garlito B. Yusà V. Children’s Exposure to Polycyclic Aromatic Hydrocarbons in the Valencian Region (Spain): Urinary Levels, Predictors of Exposure and Risk Assessment Environ. Int. 2021 153 106535 10.1016/j.envint.2021.106535 33831740 61. Murawski A. Roth A. Schwedler G. Schmied-Tobies M.I.H. Rucic E. Pluym N. Scherer M. Scherer G. Conrad A. Kolossa-Gehring M. Polycyclic Aromatic Hydrocarbons (PAH) in Urine of Children and Adolescents in Germany—Human Biomonitoring Results of the German Environmental Survey 2014–2017 (GerES V) Int. J. Hyg. Environ. Health 2020 226 113491 10.1016/j.ijheh.2020.113491 32092491 62. Lapole D. Rychen G. Grova N. Monteau F. Le Bizec B. Feidt C. Milk and Urine Excretion of Polycyclic Aromatic Hydrocarbons and Their Hydroxylated Metabolites after a Single Oral Administration in Ruminants J. Dairy Sci. 2007 90 2624 2629 10.3168/jds.2006-806 17517702 63. Lao J.-Y. Xie S.-Y. Wu C.-C. Bao L.-J. Tao S. Zeng E.Y. Importance of Dermal Absorption of Polycyclic Aromatic Hydrocarbons Derived from Barbecue Fumes Environ. Sci. Technol. 2018 52 8330 8338 10.1021/acs.est.8b01689 29790336 64. Oliveira M. Capelas S. Delerue-Matos C. Morais S. Grill Workers Exposure to Polycyclic Aromatic Hydrocarbons: Levels and Excretion Profiles of the Urinary Biomarkers Int. J. Environ. Res. Public Health 2020 18 230 10.3390/ijerph18010230 33396787 PMC7796024 65. Nugent K. Dobbe L. Rahman R. Elmassry M. Paz P. Lung Morphology and Surfactant Function in Cardiogenic Pulmonary Edema: A Narrative Review J. Thorac. Dis. 2019 11 4031 4038 10.21037/jtd.2019.09.02 31656679 PMC6790471 66. Mortensen N.P. Hickey A.J. Targeting Inhaled Therapy beyond the Lungs Respiration 2014 88 353 364 10.1159/000367852 25277464 PMC9429966 67. Dong L. Zhuang X. Insights into Inhalation Drug Disposition: The Roles of Pulmonary Drug-Metabolizing Enzymes and Transporters Int. J. Mol. Sci. 2024 25 4671 10.3390/ijms25094671 38731891 PMC11083391 68. Lee D. Minko T. Nanotherapeutics for Nose-to-Brain Drug Delivery: An Approach to Bypass the Blood Brain Barrier Pharmaceutics 2021 13 2049 10.3390/pharmaceutics13122049 34959331 PMC8704573 69. Hanson L.R. Frey W.H. Intranasal Delivery Bypasses the Blood-Brain Barrier to Target Therapeutic Agents to the Central Nervous System and Treat Neurodegenerative Disease BMC Neurosci. 2008 9 S5 10.1186/1471-2202-9-S3-S5 19091002 PMC2604883 70. Zhang Y. Hu Q. Fu J. Li X. Mao H. Wang T. Influence of Exposure Pathways on Tissue Distribution and Health Impact of Polycyclic Aromatic Hydrocarbon Derivatives Environ. Health 2023 1 150 167 10.1021/envhealth.3c00060 PMC11503884 39473616 71. Badyda A.J. Rogula-Kozłowska W. Majewski G. Bralewska K. Widziewicz-Rzońca K. Piekarska B. Rogulski M. Bihałowicz J.S. Inhalation Risk to PAHs and BTEX during Barbecuing: The Role of Fuel/Food Type and Route of Exposure J. Hazard. Mater. 2022 440 129635 10.1016/j.jhazmat.2022.129635 36027742 72. Kozielska B. Rogula-Kozłowska W. Wielopierścieniowe Węglowodory Aromatyczne w Pyle Zawieszonym w Miastach Górnego Śląska Arch. Gospod. Odpad. I Ochr. Sr. 2014 16 75 84 73. Johns B.A. Broten T. Stranieri M.T. Holahan M.A. Cook J.J. Simple High-Performance Liquid Chromatographic Method to Analyze Serum Creatinine Has Several Advantages over the Jaffé Picric Acid Reaction as Demonstrated with a Cimetidine Dose Response in Rhesus Monkeys J. Chromatogr. B Biomed. Sci. Appl. 2001 759 343 348 10.1016/S0378-4347(01)00229-8 11499488 74. McEnroe R.J. Evaluation of Precision of Quantitative Measurement Procedures: Approved Guideline Clinical and Laboratory Standards Institute Wayne, PA, USA 2014 1562389688 Figure 1 HPLC-FLD chromatograms obtained for ( A B Figure 2 ( A B Figure 3 ( A B Figure 4 Examples of different concentration distributions of hydroxy-PAHs determined in urine samples collected before (sample collection no. 1) and after the consumption of grilled marshmallows (sample collection no. 2, 3, and 4). Figure 5 Distribution of hydroxy-PAH concentrations determined in urine samples collected from a person who grilled and then consumed white grilled marshmallows. Figure 6 Structure of 1-hydroxypyrene ( A B molecules-30-03787-t001_Table 1 Table 1 Basic parameters for validation of the OH-PAH determination method. Parameter 9-Hydroxyphenanthrene 1-Hydroxypyrene Calibration curve equation 1 y = 70.729x − 0.8354 y = 261.03x − 0.6396 Correlation coefficient [ r 0.9999 0.9996 LOD and LOQ [ng/mL] 2 0.15 and 0.50 0.15 and 0.50 LOQ [ng/mL urine] 0.025 0.025 Recovery % and (RSD%) 3   10 ng/mL urine n.d. 4 80.0 (5.1) 30 ng/mL urine 72.1 (4.1) 73.2 (3.7) 60 ng/mL urine 69.9 (2.5) 62.1 (1.0) 100 ng/mL urine 61.3 (2.5) n.d. 4 Intra-day and inter-day precision 3   10 ng/mL 1.3 and 0.9 3.0 and 5.6 25 ng/mL 1.0 and 1.3 0.3 and 4.3 50 ng/mL 0.5 and 1.2 1.1 and 4.1 100 ng/mL 0.6 and 1.2 0.4 and 1.8 1 2 3 4 molecules-30-03787-t002_Table 2 Table 2 Comparison of hydroxy-PAHs concentrations in urine samples from individuals who consumed grilled marshmallows without and with the division regarding type of marshmallows (colored and white).  Consumption of Grilled Marshmallows Compound Overall Consumption White and Colored Only Colored Only White 1-hydroxypyrene 0.21 ± 0.16 0.24 ± 0.20 0.19 ± 0.09 9-hydroxyphenanthrene 2.78 ± 2.55 3.07 ± 2.40 1 2.65 ± 2.30 1 1 p ",
  "metadata": {
    "Title of this paper": "Simple High-Performance Liquid Chromatographic Method to Analyze Serum Creatinine Has Several Advantages over the Jaffé Picric Acid Reaction as Demonstrated with a Cimetidine Dose Response in Rhesus Monkeys",
    "Journal it was published in:": "Molecules",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472855/"
  }
}