{
  "title": "Paper_1238",
  "abstract": "pmc Cancers (Basel) Cancers (Basel) 2105 cancers cancers Cancers 2072-6694 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468570 PMC12468570.1 12468570 12468570 41008830 10.3390/cancers17182987 cancers-17-02987 1 Article Exploring Physical Activity Levels, Barriers, and Education Sources in People with Cancer Undergoing Chemotherapy Cesnik Rebecca Conceptualization Methodology Validation Formal analysis Investigation Resources Data curation Writing – original draft Visualization 1 2 3 * https://orcid.org/0000-0002-1776-6200 Toohey Kellie Conceptualization Writing – review & editing Visualization Supervision 2 4 https://orcid.org/0000-0002-2047-7012 Freene Nicole Conceptualization Writing – review & editing Supervision 2 5 Semple Stuart Conceptualization Writing – review & editing Supervision 2 3 4 Bruera Eduardo Academic Editor 1 2 kellie.toohey@scu.edu.au nicole.freene@canberra.edu.au stuart.semple@canberra.edu.au 3 4 5 * rebecca.cesnik@canberra.edu.au 12 9 2025 9 2025 17 18 497140 2987 14 8 2025 09 9 2025 09 9 2025 12 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Simple Summary Physical activity during chemotherapy is important to improve side effects, survival rates, and treatment completion, yet most people do not reach physical activity guidelines. This study aimed to understand the physical activity levels, barriers, and education sources within the ACT, Australia. Understanding the reported barriers to physical activity—including side effects, motivation and time—and the desire for education offers opportunities to address gaps in services and ensure physical activity is integrated into chemotherapy care. Abstract Purpose: Physical activity (PA) during chemotherapy can lessen side effects, support treatment adherence, and improve overall outcomes, yet the barriers to PA in this population remain underexplored. This study assessed self-reported PA levels, barriers, and sources of PA education among adults with cancer undergoing chemotherapy. Methods: A cross-sectional survey was conducted among adult outpatients receiving chemotherapy in the ACT, Australia. The survey collected demographic information, PA levels using the modified Godin–Shephard Leisure Time Questionnaire, barriers to PA, and sources of PA education. Both quantitative and qualitative analyses were performed. Results: Of 111 participants (mean age 59.2), only 11.7% met ‘active’ PA status and 9.9% met resistance exercise guidelines. Barriers included fatigue, strength, pain, motivation, nausea, and lack of time. Notably, almost one-third received no PA education during chemotherapy, and nearly half wanted more. Education by accredited exercise physiologists increased resistance exercise participation. Conclusions: Few participants met PA recommendations during chemotherapy, with many reporting insufficient PA education and significant barriers. These findings highlight critical gaps in patient care and education. Addressing these through integrated, evidence-based PA programs and policy changes could enhance patient health, improve outcomes, and reduce disparities in supportive cancer care. exercise physical activity cancer barriers education Australian Government Research Training Program (RTP) Scholarship This research was supported by an Australian Government Research Training Program (RTP) Scholarship https://doi.org/10.82133/C42F-K220 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Cancer is a major cause of mortality and morbidity globally, with 14 million new cases diagnosed each year [ 1 2 3 4 4 3 3 5 3 6 7 8 9 10 11 Physical activity is defined as “any bodily movement…that requires energy expenditure”, whereas exercise is a subset of PA that is planned and repetitive [ 12 12 13 14 15 14 15 While the substantial benefits of PA during chemotherapy are well-documented—including improved physical and psychological outcomes—there remains a persistent and significant shortfall in PA participation among individuals undergoing chemotherapy [ 16 17 18 19 20 16 Therefore, the objective of this study was designed to fill this crucial void. Its primary aim is to assess self-reported PA levels in people undergoing chemotherapy, classifying respondents as ‘active’ or ‘insufficiently active’ according to established guidelines [ 12 13 14 15 2. Materials and Methods 2.1. Study Design A cross-sectional mixed methods questionnaire was distributed at all outpatient chemotherapy sites within Canberra, Australian Capital Territory (ACT), Australia over four weeks to capture various chemotherapy cycle lengths (November to December 2018). This time period ensured that most people attending the service had the opportunity to be approached while reducing the risk of duplicate invitations, which has implications for data integrity and participant and staff fatigue. Respondents were sourced from all chemotherapy centres across the region, which incorporates a population size of over 450,000 [ 21 The participants were invited to participate by independent nursing staff who were not involved in the study. Staff were requested not to encourage people to partake if they declined, but to document reasons for not participating. Potential participants were advised that involvement was voluntary and that staff had no connection to the study to reduce response bias. A Participant Information Sheet was provided, and the completion of the attached questionnaire followed this implied consent. Questionnaires were completed during chemotherapy sessions and placed in a sealed box by nurses. Participants self-reported their cancer type, which was subsequently classified using ICD-10-CM codes [ 22 2.2. Sample Size The sample size required to accurately represent the eligible patients attending the chemotherapy sites during the study period ( n 23 2.3. Survey The study utilised a validated questionnaire [ 24 19 25 26 27 28 28 28 28 Supplementary Table S1 Physical activity levels were assessed using a modified Godin–Shephard Leisure Time Questionnaire (GSLTQ) [ 29 29 24 30 31 In summary, this section describes a comprehensive approach to capturing both quantitative and qualitative aspects of PA among patients undergoing outpatient chemotherapy across a diverse regional sample. Aerobic PA levels were measured using the modified GSLTQ, collecting data on frequency (times per week) and average time per session, with frequency serving as the primary variable in subsequent analyses according to established GSLTQ methodology. Average PA minutes per week were also calculated to facilitate comparison with WHO guidelines. Resistance exercise was assessed by asking participants to report frequency (times per week), intensity, and the location of their activities, providing a nuanced understanding of resistance training behaviours within the cohort. This mixed-methods approach allowed for the robust comparison of PA patterns and associated variables, contributing valuable insight into the exercise behaviours of individuals receiving chemotherapy. 2.4. Data Analysis Descriptive analyses were completed to summarise survey data. Barriers and education sources were categorised as ‘yes’/‘no’ for each variable to allow for binary categorical analysis. Associations between resistance exercise or PA levels and variables were calculated using Pearson’s chi-squared tests of independence. Fisher’s exact test was used where cells had counts of less than five. A series of univariable binary logistic regression analyses were completed to identify possible relationships between variables and PA or resistance exercise categories. Bootstrapping analysis, with a repetition of 1000, was used to reduce variability given the non-normal distribution and small sample size. Firth’s logistic regression was used for predictors with quasi-separation. Where appropriate, statistical significance was set at p Qualitative data were collated in Microsoft Excel and inductively themed [ 32 The Strengthening the Reporting of Observational Studies in Epidemiology (STROBE) reporting guidelines were followed to ensure transparency and completeness in the presentation of methods and results throughout the study [ 33 3. Results A total of 111 surveys were collected during the study period. Participant demographics and survey responses are presented in Table 1 The GSLTQ classified 11.7% ( n n n Participants completed an average of 0.9 (SD ± 1.74) resistance exercise sessions in the last week. Twenty-three respondents (20.7%) reported completing 2–3 sessions; however only 9.9% ( n n 3.1. Barriers to Physical Activity Fatigue was the most frequently reported barrier, (72.1%, n n n n n n Table 2 p p Qualitative responses identified other barriers to PA, including peripheral neuropathy, the progression of disease, the cyclic nature of symptoms, and preferring social support when exercising ( Table 3 3.2. Education Sources Nurses were the most common source of PA education ( n n n n n Table 4 While 63.0% ( n n n p Several patients discussed education in their open-ended responses ( Table 3 4. Discussion This study provides valuable insights into the alarming trend of aerobic PA levels among people undergoing chemotherapy: namely, only 17% of those surveyed in this study were classified as “active”. These findings align with the existing literature, which consistently demonstrate low PA adherence across the cancer continuum [ 16 34 35 12 36 37 34 10 9 8 This study found that over 70% of respondents participated in no resistance exercise. Resistance exercise consistently results in statistically and clinically significant improvements in strength, function, fatigue, and quality of life during and after cancer treatment [ 15 38 39 39 39 39 40 The side effects of cancer and chemotherapy treatment were the greatest reported barrier to PA in this study. This is consistent with other studies for people undergoing chemotherapy [ 25 35 41 42 43 14 15 44 Cancer-related fatigue was the greatest singular barrier in this study and is widely recognised as the most prevalent and debilitating symptom experienced by individuals with cancer [ 5 26 27 45 5 46 5 14 14 Whilst time and other commitments are commonly reported as the main barriers to PA in adults worldwide [ 47 48 49 19 50 51 52 In this study, over 60% of participants reported that they were provided PA education from one or more sources. Despite this, almost half reported they would like more information about PA. This suggests that the current sources of education are ineffective to meet participants’ needs. This trend is similar to other studies of cancer survivors [ 53 35 27 54 52 55 54 56 57 56 57 55 18 58 59 52 52 58 59 52 59 The Clinical Oncology Society of Australia (COSA), recommends integrating exercise into standard cancer care, with all health professionals actively promoting PA as a crucial component of treatment [ 13 52 56 To align with recommendations and ensure optimal care, referral processes to AEPs or physiotherapists with cancer expertise should be streamlined or integrated within the current multidisciplinary team. This will ensure that people undergoing chemotherapy have access to evidence-based information, education, and support to safely engage in PA. In this study, AEPs were the only source of education that statistically increased the likelihood of participating in resistance exercise. PA interventions during treatment are more likely to be cost-effective if they are delivered by AEPs or physiotherapists compared to self-managed PA [ 60 This study provides a valuable insight into the reported PA levels, barriers, and educational sources for people undergoing chemotherapy and was the first to identify PA levels, barriers, and education sources during chemotherapy in Australia. Respondents were sourced from all chemotherapy centres across the region, which incorporates a population size of over 450,000 [ 21 There are some limitations to this study. Firstly, the expected sample size was not reached during the study period. The study was limited to a four-week timeframe, which may have constrained the sample size. This duration was chosen to capture a representative snapshot of patients while minimising duplicate recruitment and participant fatigue. It also reduced the resource burden on staff assisting with data collection, meaning that extending the time period to increase sample size was not appropriate. Despite this, the number of respondents was similar to that seen across the current literature [ 16 30 30 30 This study identifies several directions for future research. Understanding barriers and facilitators to PA in this population will help tailor effective services. Input from staff, carers, and patients is vital to adapt support to their needs. Future studies should explore the optimal timing, content, delivery, and format of PA education during chemotherapy. Further investigation is needed on how education from AEPs and barriers like time and strength influence participation in MVPA and resistance exercise. Clarifying the factors linking PA, education, and barriers will guide the development of services that maximise PA for people undergoing chemotherapy. Finally, studies with larger sample sizes that aim to identify changes in PA ranging from pre-diagnosis and pre-chemotherapy to post-treatment would be beneficial to gaining a full understanding of the impact that chemotherapy has on PA levels. 5. Conclusions This study reveals a critical gap in PA levels among individuals undergoing chemotherapy in Australia, with a substantial proportion of people engaging in no MVPA or resistance exercise. Alarmingly, nearly one-third of participants in this study reportedly received no PA education during their treatment. This highlights the need for improved services to promote PA and integrate exercise specialists such as AEPs into standard cancer care. All individuals undergoing chemotherapy can benefit from being physically active, and it is essential that they are offered this opportunity. Consistent and reliable individualised PA support is crucial for empowering patients to engage in safe and effective PA during their treatment, ultimately improving their quality of life and overall health outcomes. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/cancers17182987/s1 Author Contributions Conceptualization, R.C., K.T., N.F. and S.S.; data curation, R.C.; formal analysis, R.C.; investigation, R.C.; methodology, R.C.; resources, R.C.; supervision, K.T., N.F. and S.S.; validation, R.C.; visualization, R.C. and K.T.; writing—original draft, R.C.; writing—review & editing, K.T., N.F. and S.S. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement This study was performed in line with the principles of the Declaration of Helsinki. Approval was granted by ACT Health Human Research Ethics (26 September 2018/2018/LRE/177). Informed Consent Statement All participants received a participant information sheet prior to receiving the survey which included the intent to publish. Completion of the survey following this was taken as implied consent. Data Availability Statement The data presented in this study are available on request from the corresponding author due to ethic requirements. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: PA Physical Activity ACT Australian Capital Territory GSLTQ Godin Shephard Leisure Time Questionnaire I-CVI Individual-Content Validity Index ICD-10-CM International Classification of Diseases, Tenth Revision, Clinical Modification LSI Leisure Score Index MVPA Moderate-Vigorous Physical Activity OR Odds Ration S-CVI Scale-Content Validity Index WHO World Health Organisation References 1. McGuire S. World Cancer Report 2014 International Agency for Research on Cancer Geneva, Switzerland 2016 10.3945/an.116.012211 PMC4785485 26980827 2. Neugut A.I. Prigerson H.G. Curative, Life-Extending, and Palliative Chemotherapy: New Outcomes Need New Names Oncologist 2017 22 883 885 10.1634/theoncologist.2017-0041 28550031 PMC5553954 3. Cave J. Paschalis A. Huang C.Y. West M. Copson E. Jack S. Grocott M.P.W. A systematic review of the safety and efficacy of aerobic exercise during cytotoxic chemotherapy treatment Support. Care Cancer 2018 26 3337 3351 10.1007/s00520-018-4295-x 29936624 4. Courneya K.S. McKenzie D.C. Mackey J.R. Gelmon K. Friedenreich C.M. Yasui Y. Reid R.D. Cook D. Jespersen D. Proulx C. Effects of exercise dose and type during breast cancer chemotherapy: Multicenter randomized trial J. Natl. Cancer Inst. 2013 105 1821 1832 10.1093/jnci/djt297 24151326 5. Fabi A. Bhargava R. Fatigoni S. Guglielmo M. Horneber M. Roila F. Weis J. Jordan K. Ripamonti C.I. ESMO Guidelines Committee Cancer-related fatigue: ESMO Clinical Practice Guidelines for diagnosis and treatment Ann. Oncol. 2020 31 713 723 10.1016/j.annonc.2020.02.016 32173483 6. Amarelo A. da Mota M.C.C. Amarelo B.L.P. Ferreira M.C. Fernandes C.S. Effects of Physical Exercise on Chemotherapy-Induced Peripheral Neuropathy: A Systematic Review and Meta-Analysis Pain. Manag. Nurs. 2025 26 212 221 10.1016/j.pmn.2024.12.011 39855997 7. Desai R. Jain A. Long-term benefits of exercise interventions during chemotherapy in breast cancer: Insights from the optitrain trial calling for longitudinal studies Breast Cancer Res. Treat. 2025 210 249 250 10.1007/s10549-025-07638-1 39961970 8. Courneya K.S. Segal R.J. McKenzie D.C. Dong H. Gelmon K. Friedenreich C.M. Yasui Y. Reid R.D. Crawford J.J. Mackey J.R. Effects of exercise during adjuvant chemotherapy on breast cancer outcomes Med. Sci. Sports Exerc. 2014 46 1744 1751 10.1249/MSS.0000000000000297 24633595 9. Potiaumpai M. Schleicher E.A. Wang M. Campbell K.L. Sturgeon K. Schmitz K.H. Exercise during chemotherapy: Friend or foe? Cancer Med. 2023 12 10715 10724 10.1002/cam4.5831 37076972 PMC10225227 10. Mizrahi D. Lai J.K.L. Wareing H. Ren Y. Li T. Swain C.T.V. Smith D.P. Adams D. Martiniuk A. David M. Effect of exercise interventions on hospital length of stay and admissions during cancer treatment: A systematic review and meta-analysis Br. J. Sports Med. 2024 58 97 109 10.1136/bjsports-2023-107372 37989539 11. Yilmaz Kaya Z. Kizilirmak D. Havlucu Y. The effects of nutritional habits and physical activity on treatment response and survival in patients with lung cancer Support. Care Cancer 2025 33 349 10.1007/s00520-025-09409-6 40183973 PMC11971208 12. World Health Organisation Physical Activity Available online: https://www.who.int/news-room/fact-sheets/detail/physical-activity (accessed on 15 January 2024) 13. Cormie P. Atkinson M. Bucci L. Cust A. Eakin E. Hayes S. McCarthy S. Murnane A. Patchell S. Adams D. Clinical Oncology Society of Australia position statement on exercise in cancer care Med. J. Aust. 2018 209 184 187 10.5694/mja18.00199 29719196 14. Hayes S.C. Newton R.U. Spence R.R. Galvao D.A. The Exercise and Sports Science Australia position statement: Exercise medicine in cancer management J. Sci. Med. Sport 2019 22 1175 1199 10.1016/j.jsams.2019.05.003 31277921 15. Campbell K.L. Winters-Stone K.M. Wiskemann J. May A.M. Schwartz A.L. Courneya K.S. Zucker D.S. Matthews C.E. Ligibel J.A. Gerber L.H. Exercise Guidelines for Cancer Survivors: Consensus Statement from International Multidisciplinary Roundtable Med. Sci. Sports Exerc. 2019 51 2375 2390 10.1249/MSS.0000000000002116 31626055 PMC8576825 16. Cesnik R. Toohey K. Freene N. Kunstler B. Semple S. Physical Activity Levels in People with Cancer Undergoing Chemotherapy: A Systematic Review Semin. Oncol. Nurs. 2023 39 151435 10.1016/j.soncn.2023.151435 37127520 17. Kwan M.L. Sternfeld B. Ergas I.J. Timperi A.W. Roh J.M. Hong C.C. Quesenberry C.P. Kushi L.H. Change in physical activity during active treatment in a prospective study of breast cancer survivors Breast Cancer Res. Treat. 2012 131 679 690 10.1007/s10549-011-1788-4 21953007 PMC3273453 18. Romero-Elias M. Beltran-Carrillo V.J. Gonzalez-Cutre D. Jimenez-Loaisa A. Barriers to physical activity participation in colorectal cancer patients during chemotherapy treatment: A qualitative study Eur. J. Oncol. Nurs. 2020 46 101769 10.1016/j.ejon.2020.101769 32506009 19. Vassbakk-Brovold K. Antonsen A.J. Berntsen S. Kersten C. Fegran L. Experiences of Patients With Breast Cancer of Participating in a Lifestyle Intervention Study While Receiving Adjuvant Chemotherapy Cancer Nurs. 2018 41 218 225 10.1097/NCC.0000000000000476 28221215 20. Brouwer C.G. Tusscher M.R.T. de Roos B.M. Gootjes E.C. Buffart T.E. Versteeg K.S. Mast I.H. Streppel M.M. Werter I.M. May A.M. Experiences of patients with metastatic colorectal cancer participating in a supervised exercise intervention during chemotherapy Support. Care Cancer 2025 33 82 10.1007/s00520-024-09101-1 39779537 PMC11711133 21. ACT Government ACT Health Workforce Strategy 2023–2032 ACT Government Canberra, Australia 2023 22. Fritz A.G. International Classification of Diseases for Oncology: ICD-O World health organization Geneva, Switzerland 2000 23. Australian Bureau of Statistics Sample Size Calculator Available online: https://www.abs.gov.au/websitedbs/D3310114.nsf/home/Sample+Size+Calculator (accessed on 28 September 2018) 24. Amireault S. Godin G. Lacombe J. Sabiston C.M. Validation of the Godin-Shephard Leisure-Time Physical Activity Questionnaire classification coding system using accelerometer assessment among breast cancer survivors J. Cancer Surviv. 2015 9 532 540 10.1007/s11764-015-0430-6 25666749 25. Leak Bryant A. Walton A.L. Pergolotti M. Phillips B. Bailey C. Mayer D.K. Battaglini C. Perceived Benefits and Barriers to Exercise for Recently Treated Adults With Acute Leukemia Oncol. Nurs. Forum 2017 44 413 420 10.1188/17.ONF.413-420 28632248 PMC5835922 26. Clark M.M. Vickers K.S. Hathaway J.C. Smith M. Looker S.A. Petersen L.R. Pinto B.M. Rummans T.A. Loprinzi C.L. Physical Activity in Patients With Advanced-Stage Cancer Actively Receiving Chemotherapy J. Support. Oncol. 2007 5 487 493 18240671 27. Midtgaard J. Baadsgaard M.T. Moller T. Rasmussen B. Quist M. Andersen C. Rorth M. Adamsen L. Self-reported physical activity behaviour; exercise motivation and information among Danish adult cancer patients undergoing chemotherapy Eur. J. Oncol. Nurs. 2009 13 116 121 10.1016/j.ejon.2009.01.006 19230768 28. Zamanzadeh V. Ghahramanian A. Rassouli M. Abbaszadeh A. Alavi-Majd H. Nikanfar A.R. Design and Implementation Content Validity Study: Development of an instrument for measuring Patient-Centered Communication J. Caring Sci. 2015 4 165 178 10.15171/jcs.2015.017 26161370 PMC4484991 29. Godin G. The Godin-Shephard Leisure-Time Physical Activity Questionnaire Health Fit. J. Can. 2011 4 18 22 10.14288/hfjc.v4i1.82 30. Amireault S. Godin G. Lacombe J. Sabiston C.M. The use of the Godin-Shephard Leisure-Time Physical Activity Questionnaire in oncology research: A systematic review BMC Med. Res. Methodol. 2015 15 60 10.1186/s12874-015-0045-7 26264621 PMC4542103 31. Yang Y.J. An Overview of Current Physical Activity Recommendations in Primary Care Korean J. Fam. Med. 2019 40 135 142 10.4082/kjfm.19.0038 31122003 PMC6536904 32. Braun V. Clarke V. Using thematic analysis in psychology Qual. Res. Psychol. 2006 3 77 101 10.1191/1478088706qp063oa 33. Von Elm E. Altman D.G. Egger M. Pocock S.J. Gøtzsche P.C. Vandenbroucke J.P. Initiative S. The Strengthening the Reporting of Observational Studies in Epidemiology (STROBE) Statement: Guidelines for reporting observational studies Int. J. Surg. 2014 12 1495 1499 10.1016/j.ijsu.2014.07.013 25046131 34. Department of Health–Quality Health Quality of Life of Cancer Survivors in England: Report on a Pilot Survey Using Patient Reported Outcome Measures (PROMS) Department of Health–Quality Health London, UK 2012 35. Chan A. Ports K. Neo P. Ramalingam M.B. Lim A.T. Tan B. Hart N.H. Chan R.J. Loh K. Barriers and facilitators to exercise among adult cancer survivors in Singapore Support. Care Cancer 2022 30 4867 4878 10.1007/s00520-022-06893-y 35156143 PMC9046302 36. National Cancer Institute Cancer Trends Progress Report Available online: https://progressreport.cancer.gov. (accessed on 20 June 2024) 37. ACT Government 2021 ACT General Health Survey Statistical Report Available online: https://www.act.gov.au/open/epidemiology-publications/2021-act-general-health-survey-statistical-report#:~:text=Seven%20in%20ten%20(70.8%25),to%20only%2023.0%25%20of%20children (accessed on 2 September 2025) 38. Fairman C.M. Lonbro S. Cardaci T.D. VanderVeen B.N. Nilsen T.S. Murphy A.E. Muscle wasting in cancer: Opportunities and challenges for exercise in clinical cancer trials JCSM Rapid Commun. 2022 5 52 67 10.1002/rco2.56 36118249 PMC9481195 39. Sturgeon K.M. Mathis K.M. Rogers C.J. Schmitz K.H. Waning D.L. Cancer- and Chemotherapy-Induced Musculoskeletal Degradation JBMR Plus 2019 3 e10187 10.1002/jbm4.10187 30918923 PMC6419610 40. Papadopetraki A. Giannopoulos A. Maridaki M. Zagouri F. Droufakou S. Koutsilieris M. Philippou A. The Role of Exercise in Cancer-Related Sarcopenia and Sarcopenic Obesity Cancers 2023 15 5856 10.3390/cancers15245856 38136400 PMC10741686 41. Ingram C. Wessel J. Courneya K.S. Women’s perceptions of home-based exercise performed during adjuvant chemotherapy for breast cancer Eur. J. Oncol. Nurs. 2010 14 238 243 10.1016/j.ejon.2010.01.027 20236860 42. Husebo A.M. Karlsen B. Allan H. Soreide J.A. Bru E. Factors perceived to influence exercise adherence in women with breast cancer participating in an exercise programme during adjuvant chemotherapy: A focus group study J. Clin. Nurs. 2015 24 500 510 10.1111/jocn.12633 24890796 43. Temiz G. Durna Z. Evaluation of Quality of Life and Health Care Needs in Cancer Patients Receiving Chemotherapy J. Cancer Educ. 2020 35 796 807 10.1007/s13187-019-01533-2 31054110 44. Misiag W. Piszczyk A. Szymanska-Chabowska A. Chabowski M. Physical Activity and Cancer Care—A Review Cancers 2022 14 4154 10.3390/cancers14174154 36077690 PMC9454950 45. Liou Y.M. Lee H.L. Chien L.Y. Kao W.Y. Chiang C.C. Wang D.Y. Daily-life physical activity and related factors among patients with cancer receiving chemotherapy in Taiwan Cancer Nurs. 2011 34 443 452 10.1097/NCC.0b013e31820d4f05 21372695 46. Felser S. Gube M. Gruen J. Coutre P.I. Schulze S. Muegge L.O. Junghanss C. Ulbricht S. Association Between Cancer-Related Fatigue and Falls in Patients With Myeloproliferative Neoplasms: Results of a Multicenter Cross-Sectional Survey From the East German Study Group for Hematology and Oncology (OSHO #97) Integr. Cancer Ther. 2022 21 15347354221143064 10.1177/15347354221143064 36539979 PMC9791269 47. Australian Institute of Health and Welfare Physical Activity Available online: https://www.aihw.gov.au/reports/physical-activity/physical-activity (accessed on 18 February 2025) 48. Koh Y.S. Asharani P.V. Devi F. Roystonn K. Wang P. Vaingankar J.A. Abdin E. Sum C.F. Lee E.S. Muller-Riemenschneider F. A cross-sectional study on the perceived barriers to physical activity and their associations with domain-specific physical activity and sedentary behaviour BMC Public Health 2022 22 1051 10.1186/s12889-022-13431-2 35614402 PMC9132675 49. Hardcastle S.J. Maxwell-Smith C. Kamarova S. Lamb S. Millar L. Cohen P.A. Factors influencing non-participation in an exercise program and attitudes towards physical activity amongst cancer survivors Support. Care Cancer 2018 26 1289 1295 10.1007/s00520-017-3952-9 29090387 50. Cummins C. Kayes N.M. Reeve J. Smith G. MacLeod R. McPherson K.M. Navigating physical activity engagement following a diagnosis of cancer: A qualitative exploration Eur. J. Cancer Care 2017 26 e12608 10.1111/ecc.12608 27925326 51. Henriksson A. Arving C. Johansson B. Igelstrom H. Nordin K. Perceived barriers to and facilitators of being physically active during adjuvant cancer treatment Patient Educ. Couns. 2016 99 1220 1226 10.1016/j.pec.2016.01.019 26860549 52. Schmitz K.H. Campbell A.M. Stuiver M.M. Pinto B.M. Schwartz A.L. Morris G.S. Ligibel J.A. Cheville A. Galvao D.A. Alfano C.M. Exercise is medicine in oncology: Engaging clinicians to help patients move through cancer CA Cancer J. Clin. 2019 69 468 484 10.3322/caac.21579 31617590 PMC7896280 53. Avancini A. Pala V. Trestini I. Tregnago D. Mariani L. Sieri S. Krogh V. Boresta M. Milella M. Pilotto S. Exercise Levels and Preferences in Cancer Patients: A Cross-Sectional Study Int. J. Environ. Res. Public Health 2020 17 5351 10.3390/ijerph17155351 32722265 PMC7432474 54. van Veen M.R. Hoedjes M. Versteegen J.J. van de Meulengraaf-Wilhelm N. Kampman E. Beijer S. Improving Oncology Nurses’ Knowledge About Nutrition and Physical Activity for Cancer Survivors Oncol. Nurs. Forum 2017 44 488 496 10.1188/17.ONF.488-496 28632252 55. Cormie P. Bradford A. Guccione L. Martin P. Chiswell M. Doran C.M. Krishnasamy M. What patients with cancer require from their clinicians to enable uptake of exercise as part of cancer care: A mixed methods study J. Cancer Surviv. 2025 10.1007/s11764-025-01779-4 40128512 56. Alderman G. Semple S. Cesnik R. Toohey K. Health Care Professionals’ Knowledge and Attitudes Toward Physical Activity in Cancer Patients: A Systematic Review Semin. Oncol. Nurs. 2020 36 151070 10.1016/j.soncn.2020.151070 33010981 57. Nadler M. Bainbridge D. Tomasone J. Cheifetz O. Juergens R.A. Sussman J. Oncology care provider perspectives on exercise promotion in people with cancer: An examination of knowledge, practices, barriers, and facilitators Support. Care Cancer 2017 25 2297 2304 10.1007/s00520-017-3640-9 28258503 58. Dennett A.M. Harding K.E. Reed M.S. The challenge of timing: A qualitative study on clinician and patient perspectives about implementing exercise-based rehabilitation in an acute cancer treatment setting Support. Care Cancer 2020 28 6035 6043 10.1007/s00520-020-05436-7 32291598 59. Ijsbrandy C. van Harten W.H. Gerritsen W.R. Hermens R. Ottevanger P.B. Healthcare professionals’ perspectives of barriers and facilitators in implementing physical activity programmes delivered to cancer survivors in a shared-care model: A qualitative study Support. Care Cancer 2020 28 3429 3440 10.1007/s00520-019-05108-1 31792881 PMC7256088 60. Gubler-Gut B.E. Pohlmann J. Flatz A. Schwenkglenks M. Rohrmann S. Cost-effectiveness of physical activity interventions in cancer survivors of developed countries: A systematic review J. Cancer Surviv. 2021 15 961 975 10.1007/s11764-021-01002-0 33624172 PMC8521580 cancers-17-02987-t001_Table 1 Table 1 Participant details. Characteristic n Age (years) 59.2 (15.8) * Gender  Males 72 (64.9) Females 39 (35.1) Indigenous (Background)  Aboriginal 2 (1.8) Torres Strait Islander 0 (0.0) Neither 108 (97.3) No response 1 (0.9) Education Level  <Year 10 14 (12.6) Year 11/12 23 (20.7) Cert III/IV 19 (17.1) Diploma 11 (9.9) Bachelor’s degree 23 (20.7) Post graduate degree 13 (11.7) No response 6 (5.4) Relationship Status  In a relationship 68 (61.3) Not in a relationship 38 (34.2) No response 4 (3.6) Work Status  Not working 79 (71.2) Working hours:  <10 h/week 1 (0.9) 10–19 h/week 2 (1.8) 20–29 h/week 3 (2.7) 30–35 h/week 6 (5.4) Full-time (>35 h) 16 (14.4) No response 4 (3.6) Cancer Type  Lip, oral cavity & pharynx 1 (0.9) Digestive organs 30 (27.0) Respiratory system and intrathoracic organs 5 (4.5) Bone 1 (0.9) Skin 1 (0.9) Mesothelial and soft tissue 3 (2.7) Breast 25 (22.5) Female genital organs 7 (6.3) Male genital organs 4 (3.6) Urinary tract 1 (0.9) Blood and lymphatic system 9 (8.1) Other 1 (0.9) No answer 23 (20.7) Cancer Stage  Stage 1 4 (3.6) Stage 2 16 (14.4) Stage 3 17 (15.3) Stage 4 32 (28.9) No response 42 (37.9) PA levels (GSLTQ Category)  Insufficiently active 97 (87.4) Active 13 (11.7) No response 1 Resistance Exercise  No resistance exercise 80 (72.1) Any resistance exercise 31 (27.9) ≥2 times per week at moderate-vigorous intensity 11 (9.9) Self-reported decrease in activity levels  Yes 17 (15.3) No 81 (72.9) No response 13 (11.7) Self-reported decrease in strength, energy, or activities of daily living  Strongly agree 45 (40.5) Agree 40 (36.0) Unsure 9 (8.1) Disagree 8 (7.2) Strongly disagree 6 (5.4) No response 3 (2.7) I have received sufficient education about PA during my treatment  Strongly agree 15 (13.5) Agree 55 (49.5) Unsure 21 (18.9) Disagree 11 (9.9) Strongly disagree 7 (6.3) No response 2 (1.8) I would like more information about PA during treatment  Strongly agree 16 (14.4) Agree 38 (34.2) Unsure 27 (24.3) Disagree 24 (21.6) Strongly disagree 2 (1.8) No response 4 (3.6) I have been referred to an exercise specialist during my treatment  Exercise physiologist 11 (9.9) Physiotherapist 6 (5.4) Neither 87 (78.4) Unsure 5 (4.5) No response 2 (1.8) * Mean (±SD). cancers-17-02987-t002_Table 2 Table 2 Self-reported barriers to PA categorised by PA levels as per GSLTQ and resistance exercise. Barrier to PA Total ( n n ^ ‘Active’ ( n n ^ Any Resistance Exercise ( n n ^ Fatigue 80 (77.0) 7 (58.3) 22 (75.9) Strength 39 (37.5) 0 * a 9 (31.0) Pain 34 (32.7) 3 (25.0) 10 (34.5) Motivation 29 (27.9) 4 (33.3) 7 (24.1) Nausea 24 (23.1) 0 * (0.0) 5 (17.2) Lack of time 9 (8.7) 1 (8.3) 2 (6.9) Unsure what to do 9 (8.7) 3 * (25.0) 6 * b Access to services 7 (6.7) 1 (8.9) 2 (6.9) Don’t like exercise 5 (4.8) 0 (0.0) 1 (3.4) Confidence 5 (4.8) 0 (0.0) 2 (6.9) Told not to 4 (3.8) 0 (0.0) 0 (0.0) Family worried 3 (2.9) 0 (0.0) 0 (0.0) Don’t need to 1 (1.0) 0 (0.0) 0 (0.0) Other 17 (16.3) 3 (25.0) 6 (20.7) ^ p a p b p cancers-17-02987-t003_Table 3 Table 3 Inductive themes.  Theme Quote Barriers Side effects “Peripheral neuropathy restricts my hands and feet (feels like they’re covered in scales or feathers)” (Female, 66, bowel and liver cancer)   “Until recently went to the gym. Due to foot/leg problems had to give up as couldn’t drive. Am considering going to an exercise physiologist” (Female, 72, pancreatic cancer)  Prioritising other commitments “I try to be as active as possible. A poor prognosis has me spending more time with my family and less time at a gym” (Male, 57, pancreatic cancer)  Not told to “The only guidance on exercise is in the EVIQ patient info sheet which has on p7 “hand foot syndrome—avoid unnecessary walking, jogging or exercise” “ (Male, 65, bowel cancer)  Lack of social support “I find it easier to partake in appropriate exercise with someone else—I unfortunately spend most of my time alone” (Female, 70, cervical cancer) Facilitators History of PA “I have always been a fit/strong person who believed in strenuous exercise prior to treatment, which made it easy to continue. I believe I have remained relatively well and strong during treatment due to my exercise ethic.” (Female, 47, cancer type not reported)  Benefits of PA supports received “I am part of cancer rehab at UC. This program over 16/52 has been very beneficial. I want to keep going. It has helped my confidence” (Female, 71, breast cancer)   “I have been attending an ACT Health Program Living a Healthy Life with Chronic Conditions’ and find it has motivated me and given me strategies for exercising and dealing with my condition” (Female, 82, peritoneum cancer) Preferences Need for support “I would like to know as much as possible to strengthen myself and how to manage my exercise to gain the best possible outcome.” (Male, 48, pancreatic cancer)   “More information on types of exercise from a professional would be useful” (Male, 62, bowel cancer)  Desire to do more PA “I realise that I should be doing more and shall do light stuff. Most of my previous has been outdoors land care.” (Male, 78, cancer type not reported)   “I really miss my daily swim of 1 km and then an aqua aerobic class. Had to curtail this due to increased risk of catching something”. (Female, 69, cancer type not reported).  Would like integrated PA services “I think it would be valuable to integrate formal structured exercise into chemo program”. (Female, 56, uterine cancer)  I do enough PA “I walk every day and climb 4 flights of stairs twice weekly” (Male, 67, cancer type not reported)   “No concerns about the lack of resistance exercise at the moment as I have enough day to day (domestic) activities” (Male, 79, neuroendocrine cancer) cancers-17-02987-t004_Table 4 Table 4 Sources of PA education categorised by PA levels as per GSLTQ and resistance exercise. Sources of Education Total ( n n ^ ‘Active’ ( n n ^ Any Resistance Exercise ( n n ^ Exercise physiologist 14 (13.3) 1 (7.7) 8 * c Family member 7 (6.7) 2 (15.4) 2 (6.5) Friend 7 (6.7) 0 (0.0) 1 (3.2) GP 18 (17.1) 2 (15.4) 3 (9.7) Independent research 10 (9.5) 1 (7.7) 3 (9.7) Nurse 34 (32.4) 1 (7.7) 11 (35.5) Personal trainer 3 (2.9) 1 (7.7) 1 (3.2) Physiotherapist 10 (9.5) 0 (0) 3 (9.7) Social worker 2 (1.9) 1 (7.7) 1 (3.2) Specialist 22 (21.0) 0 (0) 8 (25.8) None 34 (32.4) 1 (7.7) 6 (19.4) ^ p c p ",
  "metadata": {
    "Title of this paper": "Cost-effectiveness of physical activity interventions in cancer survivors of developed countries: A systematic review",
    "Journal it was published in:": "Cancers",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468570/"
  }
}