{
  "title": "Paper_736",
  "abstract": "pmc Immunol Rev Immunol Rev 379 blackwellopen IMR Immunological Reviews 0105-2896 1600-065X pmc-is-collection-domain yes pmc-collection-title Wiley Open Access Collection PMC12477831 PMC12477831.1 12477831 12477831 41020546 10.1111/imr.70062 IMR70062 IMR-2025-052 1 Invited Review Invited Review From Lymphotoxin to Tertiary Lymphoid Structures and Beyond Ruddle Nancy H. https://orcid.org/0000-0002-0103-1461  1 nancy.ruddle@yale.edu   1 Department of Epidemiology of Microbial Diseases Yale School of Public Health New Haven Connecticut USA * Correspondence: nancy.ruddle@yale.edu 29 9 2025 10 2025 335 1 497748 10.1111/imr.v335.1 e70062 02 9 2025 12 9 2025 29 09 2025 30 09 2025 30 09 2025 © 2025 The Author(s). Immunological Reviews https://creativecommons.org/licenses/by-nc/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by-nc/4.0/ ABSTRACT Lymphoid organ development occurs in ontogeny in the absence of antigenic stimulation; inflammation occurs after some immunological insult. These subjects had originally been considered as separate fields of research. Inflammation is due to inflammatory mediators such as lymphotoxin (LT) and its close relative, tumor necrosis factor (TNF). The two fields converged with the realization that LT is also crucial for secondary lymphoid organ (SLO) development and that it induces chronic lymphoid infiltrates, called tertiary lymphoid organs (TLOs) or tertiary lymphoid structures (TLSs) that are remarkably like SLOs. TLSs, which were initially described in mice transgenic for the rat insulin promoter driving LT (RIPLT mice), occur in chronic inflammation in autoimmune diseases, atherosclerosis, graft rejection, microbial infection, aging, and cancer. The thesis presented here is that understanding SLO development, structure, and function is key to understanding TLSs. Key discoveries are presented which include the observations that LT's two forms, LTα3 and LTα1β2, signal through different receptors that induce both SLOs and TLSs. Similarities and differences between TLSs and SLOs are presented. Prospects for their inhibition in autoimmune diseases where they are detrimental, and induction in cancer, where they are beneficial, are presented. Challenges and future directions are discussed. autoimmunity cancer inflammation lymphoid organ development lymphotoxin tertiary lymphoid structure National Institutes of Health 10.13039/100000002 R21 HL098711 R01 CA16885 R01 DK57731 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:29.09.2025  N. H. Ruddle From Lymphotoxin to Tertiary Lymphoid Structures and Beyond Immunological Reviews 335 1 2025 e70062 10.1111/imr.70062 PMC12463167 40996881  Funding: 1 Introduction Before the 1990s, inflammation and lymphoid organs were rarely mentioned in the same sentence. Lymphotoxin (LT) and its close relative tumor necrosis factor (TNF) were considered as mediators of inflammation. The near simultaneous realization that LT is crucial for lymphoid organ development and that certain organized inflammatory infiltrates resemble lymphoid organs [ 1 1 2 3 4 5 6 7 7 1 TABLE 1 Some key events in LT, TLSs, and beyond. Event Year References LT described 1968 [ 8 9 TNF described 1975 [ 10 TNF gene cloned 1984 [ 11 LTα gene cloned 1984, 1985, 1987, 1988 [ 11 12 13 14 15 TNF gene cloned 1984 [ 11 LT name changed to TNFβ 1985 [ 16 Anti‐TNF, LT Ab inhibits EAE 1990, 1993 [ 17 18 LTβ described 1992 [ 19 LTβ gene cloned 1993 [ 20 LTαβ complex described 1993 [ 20 LTα knock out 1994 [ 21 LTαβ induces Hec6ST and PNAd 2003 [ 22 Cardiac rejection TLS 2005 [ 3 Memory in RIPLTα skin TLS 2007 [ 23 HEV reporter mice 2011 [ 24 TLS predictive of tumor survival 2011 [ 7 Lymphatic vessel reporter mice 2012 [ 25 AMY LT mouse‐salivary and lacrimal gland TLS 2020 [ 26 TLS predictive of response to ICB 2020 [ 27 28 29 AAV‐directed LIGHT induces TLSs in glioblastoma 2023 [ 30 Memory in RIPLTα kidney TLS 2024 [ 31 As noted above, the fascinating research fields of lymphoid organ development and TLSs progressed concurrently on parallel paths and then converged with the realization that key cytokines and chemokines were involved in both the developmental process of lymphoid organs and the postnatal inflammatory organization of TLSs. In this contribution, we review key discoveries in the two areas of study and the points at which they converge (Table 1 8 9 10 2 Early Roles of LT and TNF‐Mediators of Killing and Inflammation 2.1 Discovery In the 1960s, a key question in immunology was: how do cells carry out their functions, other than antibody production, in the immune system? Of particular interest was cellular immunity, which could be transferred from one individual to another by lymphocytes (now known as T cells). An in vivo manifestation of this activity was the delayed or tuberculin skin test that measured a phenomenon known as delayed type hypersensitivity (DTH). The interferons had been described, first by Isaacs and Lindenmann as molecules that cells produced in response to viral infection (Type I Interferon) [ 32 33 34 35 36 8 Methyl cholanthrene tumors undergo regression when the mice were treated with serum from mice that had been exposed to lipopolysaccharide and bacteria. The substance in the serum was termed tumor necrosis factor (TNF) and later shown to have similar activities to those of lymphotoxin. Eventually it was demonstrated that LT and TNF are highly homologous [ 11 37 17 18 16 38 12 13 14 15 19 20 20 39 In the early 1990s, it was still unclear what distinguished the then‐known two members of the LT/TNF family. TNF, as a factor produced by macrophages after bacterial infection, was clearly important in sepsis, but the in vitro activities of LT and TNF were virtually indistinguishable. Both kill L929 cells and induce adhesion molecules and chemokines through the TNF receptors via the NFκb pathway. The role of the factor that bound LTα was unknown, as no biologic activity had been described. Several investigators pursued these questions by genetically eliminating the genes for LTα, LTβ, or TNF or their receptors. Genetic manipulation by ectopic expression of the cytokines in transgenic mice provided supplementary and complementary data. The fascinating and surprising results of these investigations are addressed below. 3 LT's Role in Lymphoid Organ Development 3.1  LTα LTα −/− With David Chaplin's group we analyzed mice whose LTα gene was disrupted genetically by inserting a neomycin resistance gene. These mice were constructed to determine if the LT protein had a biologic role that differed from that of TNF. We discovered that LTα −/− 21 40 41 42 −/− −/− 43 −/− 44 45 As noted above, the realization that LTα forms a complex with a different protein (LTβ) encoded within the same gene region as LTα and TNF [ 20 −/− −/− 46 42 −/− 46 47 −/− 48 48 49 42 3.2 Lymph Node Structure and Function The elegant functioning of the adaptive immune system is abetted by the sequestration of antigen, antigen presenting cells, and lymphocytes in lymphoid organs which are highly organized and compartmentalized. Here we concentrate on LNs as prototypical SLOs (Figure 1 50 51 52 53 50 FIGURE 1 Schematic drawing of the major features of a lymph node. An additional T cell population, called stem‐like T cells, has also been observed in LNs in chronic viral infection [ 54 55 LN stromal cells include blood and lymphatic endothelial cells and an extensive heterogeneous population of fibroblast reticular cells (FRCs) in addition to those noted above that are components of conduits. Nine different nonendothelial stromal cell populations were identified by single cell RNA sequencing in murine peripheral LNs 15 days after virus immunization, revealing cells with distinct locations and functions [ 56 57 58 3.3 Mechanism of LT's Role in Lymphoid Organ Development LT regulates lymphoid organ development through production by an innate ILC3 lymphoid cell, the lymphoid tissue inducer cell (LTi), which interacts with a stromal lymphoid tissue organizer cell (LTo). The mouse LTi, LTαβ+ RORgt+CD3−CD4+IL7R+RANKL+α4β7+ cell, interacts with the LTo IL7‐producing cell, which is ICAM‐1+, VCAM+, MAdCAM‐1+, allowing it to bind to the LTi cell. The LTo expresses TNFR1 and LTβR and responds to LTαβ by producing lymphoid chemokines, including CXCL13. CXCL13 induces even more LTαβ from the LTi cells, which then induce CXCL13 from the LTo cells, a kind of perpetual motion machine. The individual requirements for RANK and RANKL and retinoic acid vary among the different SLOs [ 49 59 Lymphatic vessels are crucial for the development of LNs. The LN anlage begins to develop lymphatic vessels around day 9 in the mouse, though this time course depends on the location of the LN in the body. This lymphatic vessel then gives rise to the lymphatic vasculature in the LN, which includes afferent and efferent lymphatic vessels crucial for the entrance of antigen and antigen presenting cells and the efflux of lymphoid cells. LTα −/− −/−  Mycoplasma pulmonis −/− 60 61 62 63 64 CHST4 22 65 65 −/− In addition to its regulation of LVs and HEVs in development and the post‐natal period, LT plays a crucial role in the regulation of lymphoid chemokines at those times. Ngo and colleagues demonstrated that LTα is crucial for the expression of CCL19, CC19, and CXCL13 in the spleen [ 66 42 1 22 4  RIPLT LT TLSs SLOs Just before we discovered that LT played such a crucial role in lymphoid organ development, my laboratory and that of Richard Flavell, were interested in the mechanism of tissue damage in Type 1 diabetes (T1D). To investigate this subject, we made mice transgenic for LTα or TNF driven by the rat insulin promoter (RIP) that is expressed in beta cells in the pancreatic Islets of Langerhans. We hypothesized that either of these locally over expressed cytokines would kill the insulin‐producing beta cells resulting in a model of T1D. The RIP promoter drives LTα and TNF expression and induces islet inflammation in the pancreas [ 67 68 69 70 1 1 23 31 We termed these infiltrates tertiary lymphoid organs (TLOs). By the time we were deep into the study of RIPLTα mice, we were no longer surprised that LTα could stimulate ectopic lymphoid organs, given its recent discovery of its crucial role in LN development. This type of lymphoid accumulation is now called a TLS and is seen in many situations of chronic inflammation. An example of the compartmentalization of T and B cells in a typical TLS, a salivary gland infiltrate, is depicted in Figure 2 71 72 73 22 65 74 30 67 75 FIGURE 2 An inflamed salivary gland from an aged (15 months) C57BL/6 mouse with characteristics of Sjögren's syndrome, stained for CD3 (red) and B220 (green) demonstrating T and B cell compartmentalization reminiscent of a LN. Original magnification ×20. First appeared: Liao et al. PNAS 104:4577, 2007. 5 Summary of TLSs 5.1  TLSs TLSs occur in situations of chronic inflammation. Their occurrence in autoimmune diseases has been summarized in numerous reviews [ 2 5 6 4 7 76 77 25 71 72 7 1 3 22 78 5.2 Classification Considerable discussion is currently taking place regarding the “maturity” of TLSs with implications regarding their functionality. Different authors have defined characteristics of mature TLS in various ways. All definitions begin with disorganized clumps of cells, then compartmentalized T and B cells, and finally germinal centers. Although germinal centers are crucial for the antibody formation of TLSs, the T cell‐antigen presenting cell aspects of the TLSs should not be ignored, so that TLSs that exhibit prominent T‐DC interaction should not be considered irrelevant. Various authors emphasize the importance of individual elements, such as HEVs for their central role in acting as entrance points for naïve lymphocytes; others emphasize follicular dendritic cells as markers of germinal centers. Another issue concerns the minimum number of cells that should be considered to be a TLS. The consensus is 10, although a TLS may contain hundereds of cells. 5.3 Similarities Between SLOs TLSs TLSs and SLOs resemble each other regarding their cellular composition and arrangement and vascular components (Table 2 79 80 25 71 72 71 81 73 82 56 57 TABLE 2 Comparison of LNs and TLSs. Lymphoid organ LN TLS Cellular composition T (CD4+, CD8+, Treg, Tfh, CD+ stem‐like) B, DC, Macrophage, FDC, plasma cells, multiple stromal cell types including FRC, CAF T (CD4+, CD8+, Treg, Tfh, CD+ stem‐like) B, DC, Macrophage, FDC, plasma cells, multiple stromal cell types including FRC, CAF Germinal centers Yes Yes Lymphoid chemokines CCL19, CCL21, CXCL13, CXCL12 CCL19, CCL21, CXCL13, CXCL12 Compartmentalization Yes Yes HEVs PNAd and/or MAdCAM‐1 PNAd and/or MAdCAM‐11 Lymphatic vessels Yes Yes Conduits Yes Yes Ability to respond to antigen and memory Yes Yes Epitope spreading Yes Yes Tolerance Yes Yes Development time frame Before birth Postnatal Antigen dependence No Yes Cellular requirements for development Precise; controlled in time and space; LTi cells (RORgt+, LTαβ+, IL7+); LTo cells (LTβR+, IL7R+) More flexible; postnatal; LTi substitutes: CD4+, CD8+, B, NK, DCs?; LTo substitutes: stromal cells Defined location Yes: developmentally determined No: any organ or tissue undergoing chronic stimulation Plasticity Not particularly: Relatively static although changes occur in immunization Very: dependent on continual stimulation Encapsulation Yes; free standing No: embedded in tissue or organ; influenced by host tissue environment TLS function like LNs in that they act as sites of antigen presentation and maturation of the immune response and generation of tolerance. The presence of germinal centers and activation‐induced cytidine deaminase (AID), an enzyme expressed in germinal center B cells that mediates class switch recombination and somatic hypermutation, and naïve T and B cells and Tfh cells, as noted above, all suggest that TLS function like LNs in that they can respond to foreign antigen. There have been several reports that TLS do act in a similar way to LNs in their response to antigen. RIPLTα mice, which, as noted above, exhibit TLS in pancreas, kidney, and skin, produce IgM and IgG to sheep red blood cells after immunization, as noted by the presence of antigen‐specific plasma cells in infiltrates in the RIPLTα kidneys [ 1 23 31 31 Epitope or determinant spreading frequently occurs in autoimmune diseases, where the response to the initial inciting antigen spreads intra‐or extra‐molecularly to new antigens in the course of the disease [ 83 84 85 TLSs can also serve as a site of tolerance. In a model of murine lung adenocarcinoma, TLSs were apparent, but tumors were not destroyed. However, depletion of Tregs results in antigen presentation by TLS DCs and causes tumor destruction [ 86 5.4 Differences Between SLOs TLS 5.4.1 Developmental Regulation As noted above, SLOs develop in a precisely regulated time and place during ontogeny. During LN, spleen, and PP development, an antigen non‐specific CD3−CD4+ RORγt+ lymphoid tissue inducer cell (LTi) serves as a source of LTα and LTαβ and interacts with a stromal lymphoid tissue organizer cell (LTo). These events are initiated in embryogenesis, although additional differentiation occurs in the postnatal period in LN HEVs [ 61 42 87 88 3 89 74 90 30 91 FIGURE 3 Generation of a TLS with various components that can substitute for LTis and LTos. In addition to the genetic manipulations noted above, several cell types can substitute for LTi cells in the adult. T cells (especially CD4 Th1 and CD8 [ 92 93 94 95 96 LTos have not been explicitly identified in TLS, although presumably their functions are carried out by stromal cells in the various organs. There are several different stromal cells that replicate LTo functions in TLSs. These include cancer‐associated fibroblasts (CAFs) that, in at least one murine model, are dependent on TNF receptors [ 75 75 97 98 5.4.2 Plasticity 5.4.2.1  LNs LNs exist before any interaction with antigen and can undergo changes after antigenic challenge, and the structures remain after the antigen has been cleared. These changes and the return to baseline, which have been well documented in studies of draining LNs after immunization, include extensive cellular proliferation, lymphangiogenesis, and dramatic changes in HEVs. In the case of oxazolone skin sensitization, the PNAd+ LTβR hi lo 99 100 100 101 102 100 100 5.4.2.2  TLSs The very structure and existence of TLSs, in contrast to SLOs, is completely dependent on the continued presence of an inducing stimulus, and this is one of their essential chronicity characteristics. The stimulus that induced them must be maintained. Otherwise, the TLSs undergo profound changes, even dissolution and fibrosis once that stimulus is removed. The TLSs of T1D are examples of such plasticity. At early times in the NOD T1D‐prone mouse, the pancreas exhibits a disorganized lymphoid infiltrate and peri‐insulitis; later, classical insulitis and TLSs are present with HEVs, T and B cell compartmentalization [ 81 103 81 103 104 In a recent study of hepatocellular carcinoma, TLSs are present and associated with a positive response to neo‐adjuvant therapy with immune checkpoint blockade [ 105 105 5.4.3 Environmental Influences LNs and their HEVs and lymphatic vessels make up their own environment which is controlled as the lymphatic vessel contents enter the blood stream through the right and left subclavian veins. Similarly, the spleen is self‐contained and free standing with access to the environment only through its vasculature. The PPs are also self‐contained, although they are exposed to gut contents. On the other hand, TLSs, by their very nature, influence and are influenced by their environments. TLSs exert damaging effects on their host organs in autoimmunity. The effects mediated by their host environments differ by the different organs in which they reside. For example, the pancreatic microenvironment that hosts TLSs in T1D differs dramatically from the salivary gland in which the TLS resides in Sjögren's syndrome and differs from the meninges in MS. The host environmental differences include the stroma, which is essential for maintaining the TLS, hormones, which may negatively or positively influence cellular physiology, cytokines, access to blood and lymphatic vessels, and especially the nature of antigen presenting capacity including access to soluble and tissue bound antigens. The concept of the importance of the microenvironment in autoimmunity is illustrated in Figure 4 106 107 FIGURE 4 A schematic demonstrating the cross talk between a Sjögren's syndrome TLS and the host salivary gland tissue. The tumor and its micro‐environment (TME) [ 27 75 An additional aspect of TLS heterogeneity is their location, particularly in cancer. They can be found outside the tumor, adjacent to it, or embedded within it. Each of these locations consists of a particular microenvironment. The TLS outside the tumor likely affects the stroma, the peritumoral TLS likely affects the tumor and the stroma, and the intratumoral TLS affects the tumor (Figure 5 FIGURE 5 A schematic demonstrating the cross talk between TLSs and the tumor. Note the different locations of the TLSs with respect to the tumor, which influence the nature of the interactions. Although the TME is known to affect the tumor, less attention has been paid to its effect on the TLS. It is well known that tumors can edit their tumor antigens and downmodulate MHC Class I expression, rendering them invisible to CTLs in the TLS and less effective at clearance. On the other hand, the tumor stromal environment provides crucial components for the TLS as it provides cells that function as LTos to induce the development of additional TLS in the tumor. Cancer‐associated fibroblasts (CAFs) [ 108 6 Prospects for TLS Manipulation in Human Disease 6.1 Induction 6.1.1 Cytokines Given that TLSs, for the most part, are beneficial in cancer and predict positive responses to immune checkpoint blockade [ 27 28 29 26 22 96 109 110 111 90 112 Administration of TLS inducers either by transfection of tumor cells or injection of cytokines to the tumor locale results in TLS and improved survival [ 30 113 114 30 Salmonella typhimurim 115 109 6.1.2 Immune Check Point Blockade ( ICB TLSs are not only associated with enhanced response to ICB as noted above [ 27 28 29 116 117 75 118 119 Although ICB appears to directly induce TLSs, it can also induce changes in existing TLSs [ 105 120 27 28 29 76 121 6.2 Inhibition 6.2.1 Cytokine or Chemokine Inhibition Inhibiting TLS development would be useful in the prevention and treatment of autoimmune diseases and allograft rejection. One obvious method would be to block LTβ due to the importance of LTαβ in SLOs and TLSs. Inhibition of TLSs in a mouse model of Sjogren's disease was accomplished with the LTβ antagonist, LTβR‐Ig [ 122 123 124 122 125 6.2.2 Inhibition of Trafficking by FTY720 Activation of S1P receptors (particularly S1P1) is required for lymphocyte egress from LNs into lymphatic sinuses. FTY720 inhibits lymphocyte trafficking in LN and spleen [ 126 127 128 81 7 Challenges and Future Directions 7.1 Introduction Even though TLSs have been studied for more than 30 years, many questions remain, whose answers will allow clinical prognosis and insight into how to manipulate them for optimal efficacy in cancer and to ameliorate them in chronic organ rejection and autoimmunity. Remaining questions include: Where do they come from? What are the appropriate criteria for TLS? What are the best means of classification for prediction of responsiveness to, for example, immunotherapy? What non‐invasive methods can be used for their characterization and quantification? What are the signals that induce and maintain them? What are the roles of LVs and HEVs? Do “early” poorly organized aggregates naturally progress to “mature” TLSs with germinal centers? What regulates this progression? How to evaluate TLSs in 3 dimensions? Can we visualize the real‐time interactions and physical movements of different cell types in a TLS reacting to antigen? These questions can be addressed with new imaging approaches and analyses of TLSs in vitro. 7.2 Slide Analysis and Deep Learning Agreement on the criteria for TLS classification and quantification has been difficult to achieve. The goal is to develop rapid, sensitive tools that do not demand extensive resources and can be employed in the clinical setting. Imaging mass cytometry employing 39 markers in the analysis of TLS in cancers of the digestive tract and inflammatory bowel disease was used to narrow down the requirement for a multiplexed approach. The authors concluded that only 3 markers were needed to define the 3 stages of TLS in tumors—namely immature or lymphoid aggregates (CD20+), immature GCs (CD20+ CD21+), and mature germinal centers (CD20+, CD21+, CD23+) [ 129 130 131 7.3 In Vivo Imaging As noted above, questions concerning cellular interactions within a TLS can best be approached by obtaining 3‐dimensional images in real time when the immune response is occurring. Tools for such imaging include mice whose lymphatic vessels and HEVs express fluorescent markers [ 24 25 132 133 31 7.4 Organoids With SLO TLS Lymphoid organoids provide a promising tool for the identification of the essential elements of SLOs and TLSs. An additional goal would be their transfer in vivo to manipulate their activity in tumors. Several recent reviews have summarized the rapid progress in the field [ 134 135 136 137 138 139 140 8 Final Thoughts: The Yin and Yang of TLS In this review, I have provided a historical, personal view of the protectory of the field from the discovery of LT, through times of confusion and uncertainty with the discovery of TNF, to the understanding of the clear importance of LTα and LTαβ in secondary lymphoid organ development. The convergence of two fields of study, developmental biology and inflammation, derives from the discovery of TLSs with common mechanisms and functions. There is a “good cop, bad cop” aspect to TLSs, with their (most likely) original role in defense against microbial infections and cancer, and their detrimental role in autoimmunity and aging. Although SLOs and TLSs have many features in common, the somewhat more permissive requirements for TLS development provide avenues for their regulation (induction or inhibition) in cancer and autoimmunity. The fact that SLOs are relatively free standing compared to TLSs that are embedded in their host organs deserves further analysis in that the TLS both responds to and is acted on by its microenvironment. Exciting advances in in vivo imaging and lymphoid organoids point the way to critical basic science understanding of SLOs and TLSs and clinical applications. Conflicts of Interest The author declares no conflicts of interest. Acknowledgments Portions of this work were supported by NIH Institute of Health grants R01 CA16885, R01 DK57731, and R21 HL098711. I thank Yexin Yang for expert figure preparation. Data Availability Statement The data that support the findings of this study are available from the corresponding author upon reasonable request. References 1 A. Kratz A. Campos‐Neto M. S. Hanson N. H. Ruddle Chronic Inflammation Caused by Lymphotoxin is Lymphoid Neogenesis Journal of Experimental Medicine 183 4 1996 1461 1472 10.1084/jem.183.4.1461 8666904 PMC2192477 2 D. L. Drayton S. Liao R. H. Mounzer N. H. Ruddle Lymphoid Organ Development: From Ontogeny to Neogenesis Nature Immunology 7 4 2006 344 353 10.1038/ni1330 16550197 3 F. K. Baddoura I. W. Nasr B. Wrobel Q. Li N. H. Ruddle F. G. Lakkis Lymphoid Neogenesis in Murine Cardiac Allografts Undergoing Chronic Rejection American Journal of Transplantation 5 3 2005 510 516 10.1111/j.1600-6143.2004.00714.x 15707405 4 N. H. Ruddle Posttransplant Tertiary Lymphoid Organs Transplantation 108 2023 1090 1099 10.1097/TP.0000000000004812 37917987 PMC11042531 5 N. H. Shomer J. G. Fox A. E. Juedes N. H. Ruddle Helicobacter‐Induced Chronic Active Lymphoid Aggregates Have Characteristics of Tertiary Lymphoid Tissue Infection and Immunity 71 6 2003 3572 3577 10.1128/IAI.71.6.3572-3577.2003 12761142 PMC155770 6 C. D. Camell P. Gunther A. Lee Aging Induces an Nlrp3 Inflammasome‐Dependent Expansion of Adipose B Cells That Impairs Metabolic Homeostasis Cell Metabolism 30 6 2019 1024 1039.e6 10.1016/j.cmet.2019.10.006 31735593 PMC6944439 7 L. Martinet I. Garrido T. Filleron Human Solid Tumors Contain High Endothelial Venules: Association With T‐ and B‐Lymphocyte Infiltration and Favorable Prognosis in Breast Cancer Cancer Research 71 17 2011 5678 5687 10.1158/0008-5472.CAN-11-0431 21846823 8 G. A. Granger T. W. Williams Lymphocyte Cytotoxicity In Vitro: Activation and Release of a Cytotoxic Factor Nature 218 5148 1968 1253 1254 10.1038/2181253a0 5656652 9 N. H. Ruddle B. H. Waksman Cytotoxicity Mediated by Soluble Antigen and Lymphocytes in Delayed Hypersensitivity. 3. Analysis of Mechanism Journal of Experimental Medicine 128 6 1968 1267 1279 10.1084/jem.128.6.1267 5693925 PMC2138574 10 E. A. Carswell L. J. Old R. L. Kassel S. Green N. Fiore B. Williamson An Endotoxin‐Induced Serum Factor That Causes Necrosis of Tumors Proceedings of the National Academy of Sciences of the United States of America 72 9 1975 3666 3670 1103152 10.1073/pnas.72.9.3666 PMC433057 11 D. Pennica G. E. Nedwin J. S. Hayflick Human Tumour Necrosis Factor: Precursor Structure, Expression and Homology to Lymphotoxin Nature 312 5996 1984 724 729 10.1038/312724a0 6392892 12 P. W. Gray E. Chen C. B. Li W. L. Tang N. Ruddle The Murine Tumor Necrosis Factor‐Beta (Lymphotoxin) Gene Sequence Nucleic Acids Research 15 1987 3937 10.1093/nar/15.9.3937 3588316 PMC340811 13 G. E. Nedwin S. L. Naylor A. Y. Sakaguchi Human Lymphotoxin and Tumor Necrosis Factor Genes: Structure, Homology and Chromosomal Localization Nucleic Acids Research 13 17 1985 6361 6373 10.1093/nar/13.17.6361 2995927 PMC321958 14 T. Shirai N. Shimizu S. Shiojiri S. Horiguchi H. Ito Cloning and Expression in  Escherichia coli DNA 7 3 1988 193 201 10.1089/dna.1988.7.193 2836146 15 C. B. Li P. W. Gray P. F. Lin K. M. McGrath F. H. Ruddle N. H. Ruddle Cloning and Expression of Murine Lymphotoxin cDNA Journal of Immunology 138 12 1987 4496 4501 2884262 16 M. R. Shalaby B. B. Aggarwal E. Rinderknecht L. P. Svedersky B. S. Finkle M. A. Palladino Jr. Activation of Human Polymorphonuclear Neutrophil Functions by Interferon‐Gamma and Tumor Necrosis Factors Journal of Immunology 135 3 1985 2069 2073 3926894 17 N. H. Ruddle C. M. Bergman K. M. McGrath An Antibody to Lymphotoxin and Tumor Necrosis Factor Prevents Transfer of Experimental Allergic Encephalomyelitis Journal of Experimental Medicine 172 4 1990 1193 1200 10.1084/jem.172.4.1193 2212948 PMC2188622 18 L. Santambrogio G. M. Hochwald B. Saxena Studies on the Mechanisms by Which Transforming Growth Factor‐Beta (TGF‐Beta) Protects Against Allergic Encephalomyelitis. Antagonism Between TGF‐Beta and Tumor Necrosis Factor Journal of Immunology 151 2 1993 1116 1127 8335893 19 M. J. Androlewicz J. L. Browning C. F. Ware Lymphotoxin is Expressed as a Heteromeric Complex With a Distinct 33‐kDa Glycoprotein on the Surface of an Activated Human T Cell Hybridoma Journal of Biological Chemistry 267 4 1992 2542 2547 1733951 20 J. L. Browning A. Ngam‐ek P. Lawton Lymphotoxin Beta, a Novel Member of the TNF Family That Forms a Heteromeric Complex With Lymphotoxin on the Cell Surface Cell 72 6 1993 847 856 10.1016/0092-8674(93)90574-a 7916655 21 P. De Togni J. Goellner N. H. Ruddle Abnormal Development of Peripheral Lymphoid Organs in Mice Deficient in Lymphotoxin Science 264 1994 703 707 8171322 10.1126/science.8171322 22 D. L. Drayton X. Ying J. Lee W. Lesslauer N. H. Ruddle Ectopic LT Alpha Beta Directs Lymphoid Organ Neogenesis With Concomitant Expression of Peripheral Node Addressin and a HEV‐Restricted Sulfotransferase Journal of Experimental Medicine 197 9 2003 1153 1163 10.1084/jem.20021761 12732657 PMC2193975 23 I. W. Nasr M. Reel M. H. Oberbarnscheidt Tertiary Lymphoid Tissues Generate Effector and Memory T Cells That Lead to Allograft Rejection American Journal of Transplantation 7 5 2007 1071 1079 10.1111/j.1600-6143.2007.01756.x 17359505 24 K. L. Bentley S. Stranford S. Liao R. M. Mounzer F. H. Ruddle N. H. Ruddle High Endothelial Venule Reporter Mice to Probe Regulation of Lymph Node Vasculature Advances in Experimental Medicine and Biology 691 2011 35 44 10.1007/978-1-4419-6612-4_4 21153307 25 L. A. Truman K. L. Bentley E. C. Smith ProxTom Lymphatic Vessel Reporter Mice Reveal Prox1 Expression in the Adrenal Medulla, Megakaryocytes, and Platelets American Journal of Pathology 180 4 2012 1715 1725 10.1016/j.ajpath.2011.12.026 22310467 PMC3349900 26 L. A. Truman K. L. Bentley N. H. Ruddle Lymphotoxin Targeted to Salivary and Lacrimal Glands Induces Tertiary Lymphoid Organs and Cervical Lymphadenopathy and Reduces Tear Production European Journal of Immunology 50 3 2020 418 425 10.1002/eji.201948300 32012252 27 F. Petitprez A. de Reynies E. Z. Keung B Cells Are Associated With Survival and Immunotherapy Response in Sarcoma Nature 577 7791 2020 556 560 10.1038/s41586-019-1906-8 31942077 28 R. Cabrita M. Lauss A. Sanna Tertiary Lymphoid Structures Improve Immunotherapy and Survival in Melanoma Nature 577 7791 2020 561 565 10.1038/s41586-019-1914-8 31942071 29 B. A. Helmink S. M. Reddy J. Gao B Cells and Tertiary Lymphoid Structures Promote Immunotherapy Response Nature 577 7791 2020 549 555 10.1038/s41586-019-1922-8 31942075 PMC8762581 30 M. Ramachandran A. Vaccaro T. van de Walle Tailoring Vascular Phenotype Through AAV Therapy Promotes Anti‐Tumor Immunity in Glioma Cancer Cell 41 6 2023 1134 1151.e10 10.1016/j.ccell.2023.04.010 37172581 31 G. Zhang N. Feizi D. Zhao Lymphotoxin Beta Receptor and Tertiary Lymphoid Organs Shape Acute and Chronic Allograft Rejection JCI Insight 9 15 2024 e177555 10.1172/jci.insight.177555 38954463 PMC11383591 32 A. Isaacs J. Lindenmann Virus Interference. I. The Interferon Proceedings of the Royal Society of London ‐ Series B: Biological Sciences 147 927 1957 258 267 10.1098/rspb.1957.0048 13465720 33 E. F. Wheelock Interferon‐Like Virus‐Inhibitor Induced in Human Leukocytes by Phytohemagglutinin Science 149 3681 1965 310 311 10.1126/science.149.3681.310 17838106 34 B. R. Bloom B. Bennett Mechanism of a Reaction In Vitro Associated With Delayed‐Type Hypersensitivity Science 153 3731 1966 80 82 10.1126/science.153.3731.80 5938421 35 J. R. David Delayed Hypersensitivity In Vitro: Its Mediation by Cell‐Free Substances Formed by Lymphoid Cell‐Antigen Interaction Proceedings of the National Academy of Sciences of the United States of America 56 1 1966 72 77 10.1073/pnas.56.1.72 5229858 PMC285677 36 N. H. Ruddle B. H. Waksman Cytotoxic Effect of Lymphocyte‐Antigen Interaction in Delayed Hypersensitivity Science 157 3792 1967 1060 1062 10.1126/science.157.3792.1060 6036235 37 K. C. Sheehan N. H. Ruddle R. D. Schreiber Generation and Characterization of Hamster Monoclonal Antibodies That Neutralize Murine Tumor Necrosis Factors Journal of Immunology 142 11 1989 3884 3893 2469726 38 N. H. Ruddle A New Name for Lymphotoxin Journal of Immunology 136 6 1986 2335 2336 3485145 39 W. R. Force B. N. Walter C. Hession Mouse Lymphotoxin‐Beta Receptor. Molecular Genetics, Ligand Binding, and Expression Journal of Immunology 155 11 1995 5280 5288 7594541 40 T. A. Banks B. T. Rouse M. K. Kerley Lymphotoxin‐Alpha‐Deficient Mice. Effects on Secondary Lymphoid Organ Development and Humoral Immune Responsiveness Journal of Immunology 155 4 1995 1685 1693 7636227 41 E. M. Akirav Y. Xu N. H. Ruddle Resident B Cells Regulate Thymic Expression of Myelin Oligodendrocyte Glycoprotein Journal of Neuroimmunology 235 1–2 2011 33 39 10.1016/j.jneuroim.2011.03.013 21550671 PMC3157307 42 X. Ying K. Chan P. Shenoy M. Hill N. H. Ruddle Lymphotoxin Plays a Crucial Role in the Development and Function of Nasal‐Associated Lymphoid Tissue Through Regulation of Chemokines and Peripheral Node Addressin American Journal of Pathology 166 1 2005 135 146 10.1016/S0002-9440(10)62239-0 15632007 PMC1602284 43 B. Neumann A. Luz K. Pfeffer B. Holzmann Defective Peyer's Patch Organogenesis in Mice Lacking the 55‐kD Receptor for Tumor Necrosis Factor Journal of Experimental Medicine 184 1 1996 259 264 10.1084/jem.184.1.259 8691140 PMC2192684 44 M. Pasparakis L. Alexopoulou V. Episkopou G. Kollias Immune and Inflammatory Responses in TNF Alpha‐Deficient Mice: A Critical Requirement for TNF Alpha in the Formation of Primary B Cell Follicles, Follicular Dendritic Cell Networks and Germinal Centers, and in the Maturation of the Humoral Immune Response Journal of Experimental Medicine 184 4 1996 1397 1411 10.1084/jem.184.4.1397 8879212 PMC2192824 45 Y. Wang J. Wang Y. Sun Q. Wu Y. X. Fu Complementary Effects of TNF and Lymphotoxin on the Formation of Germinal Center and Follicular Dendritic Cells Journal of Immunology 166 1 2001 330 337 10.4049/jimmunol.166.1.330 11123309 46 P. A. Koni R. Sacca P. Lawton J. L. Browning N. H. Ruddle R. A. Flavell Distinct Roles in Lymphoid Organogenesis for Lymphotoxins Alpha and Beta Revealed in Lymphotoxin Beta‐Deficient Mice Immunity 6 4 1997 491 500 10.1016/s1074-7613(00)80292-7 9133428 47 K. A. Soderberg M. M. Linehan N. H. Ruddle A. Iwasaki MAdCAM‐1 Expressing Sacral Lymph Node in the Lymphotoxin Beta‐Deficient Mouse Provides a Site for Immune Generation Following Vaginal Herpes Simplex Virus‐2 Infection Journal of Immunology 173 3 2004 1908 1913 10.4049/jimmunol.173.3.1908 15265924 48 S. Scheu J. Alferink T. Potzel W. Barchet U. Kalinke K. Pfeffer Targeted Disruption of LIGHT Causes Defects in Costimulatory T Cell Activation and Reveals Cooperation With Lymphotoxin Beta in Mesenteric Lymph Node Genesis Journal of Experimental Medicine 195 12 2002 1613 1624 10.1084/jem.20020215 12070288 PMC2193565 49 N. H. Ruddle E. M. Akirav Secondary Lymphoid Organs: Responding to Genetic and Environmental Cues in Ontogeny and the Immune Response Journal of Immunology 183 4 2009 2205 2212 10.4049/jimmunol.0804324 PMC2766168 19661265 50 I. D. Kelch G. Bogle G. B. Sands A. R. J. Phillips I. J. LeGrice P. R. Dunbar High‐Resolution 3D Imaging and Topological Mapping of the Lymph Node Conduit System PLoS Biology 17 12 2019 e3000486 10.1371/journal.pbio.3000486 31856185 PMC6922347 51 J. E. Gretz C. C. Norbury A. O. Anderson A. E. Proudfoot S. Shaw Lymph‐Borne Chemokines and Other Low Molecular Weight Molecules Reach High Endothelial Venules via Specialized Conduits While a Functional Barrier Limits Access to the Lymphocyte Microenvironments in Lymph Node Cortex Journal of Experimental Medicine 192 10 2000 1425 1440 10.1084/jem.192.10.1425 11085745 PMC2193184 52 R. Roozendaal R. E. Mebius G. Kraal The Conduit System of the Lymph Node International Immunology 20 12 2008 1483 1487 10.1093/intimm/dxn110 18824503 53 M. Sixt N. Kanazawa M. Selg The Conduit System Transports Soluble Antigens From the Afferent Lymph to Resident Dendritic Cells in the T Cell Area of the Lymph Node Immunity 22 1 2005 19 29 10.1016/j.immuni.2004.11.013 15664156 54 D. T. Utzschneider M. Charmoy V. Chennupati T Cell Factor 1‐Expressing Memory‐Like CD8(+) T Cells Sustain the Immune Response to Chronic Viral Infections Immunity 45 2016 415 427 10.1016/j.immuni.2016.07.021 27533016 55 S. J. Im M. Hashimoto M. Y. Gerner Defining CD8+ T Cells That Provide the Proliferative Burst After PD‐1 Therapy Nature 537 7620 2016 417 421 10.1038/nature19330 27501248 PMC5297183 56 L. B. Rodda E. Lu M. L. Bennett Single‐Cell RNA Sequencing of Lymph Node Stromal Cells Reveals Niche‐Associated Heterogeneity Immunity 48 5 2018 1014 1028.e6 10.1016/j.immuni.2018.04.006 29752062 PMC5971117 57 C. Grasso J. E. G. Roet C. G. de Graca Identification and Mapping of Human Lymph Node Stromal Cell Subsets by Combining Single‐Cell RNA Sequencing With Spatial Transcriptomics European Journal of Immunology 55 6 2025 e51218 10.1002/eji.202451218 40498289 PMC12154172 58 D. Panocha J. E. G. Roet J. E. Kuipers C. M. de Winde R. E. Mebius Lymph Node Fibroblast‐Produced Extracellular Matrix Shapes Immune Function Trends in Immunology 46 3 2025 229 243 10.1016/j.it.2025.02.002 40023738 59 T. Cupedo N. K. Crellin N. Papazian Human Fetal Lymphoid Tissue‐Inducer Cells Are Interleukin 17‐Producing Precursors to RORC+ CD127+ Natural Killer‐Like Cells Nature Immunology 10 1 2009 66 74 10.1038/ni.1668 19029905 60 R. H. Mounzer O. S. Svendsen P. Baluk Lymphotoxin‐Alpha Contributes to Lymphangiogenesis Blood 116 12 2010 2173 2182 10.1182/blood-2009-12-256065 20566898 PMC2951858 61 R. E. Mebius P. R. Streeter S. Michie E. C. Butcher I. L. Weissman A Developmental Switch in Lymphocyte Homing Receptor and Endothelial Vascular Addressin Expression Regulates Lymphocyte Homing and Permits CD4+ CD3− Cells to Colonize Lymph Nodes Proceedings of the National Academy of Sciences of the United States of America 93 20 1996 11019 11024 10.1073/pnas.93.20.11019 8855301 PMC38276 62 S. Hemmerich A. Bistrup M. S. Singer Sulfation of L‐Selectin Ligands by an HEV‐Restricted Sulfotransferase Regulates Lymphocyte Homing to Lymph Nodes Immunity 15 2 2001 237 247 10.1016/s1074-7613(01)00188-1 11520459 63 A. Bistrup S. Bhakta J. K. Lee Sulfotransferases of Two Specificities Function in the Reconstitution of High Endothelial Cell Ligands for L‐Selectin Journal of Cell Biology 145 4 1999 899 910 10.1083/jcb.145.4.899 10330415 PMC2133194 64 N. Hiraoka B. Petryniak J. Nakayama A Novel, High Endothelial Venule‐Specific Sulfotransferase Expresses 6‐Sulfo Sialyl Lewis(x), an L‐Selectin Ligand Displayed by CD34 Immunity 11 1 1999 79 89 10.1016/s1074-7613(00)80083-7 10435581 65 D. L. Drayton G. Bonizzi X. Ying S. Liao M. Karin N. H. Ruddle I Kappa B Kinase Complex Alpha Kinase Activity Controls Chemokine and High Endothelial Venule Gene Expression in Lymph Nodes and Nasal‐Associated Lymphoid Tissue Journal of Immunology 173 10 2004 6161 6168 10.4049/jimmunol.173.10.6161 15528353 66 V. N. Ngo H. Korner M. D. Gunn Lymphotoxin Alpha/Beta and Tumor Necrosis Factor Are Required for Stromal Cell Expression of Homing Chemokines in B and T Cell Areas of the Spleen Journal of Experimental Medicine 189 2 1999 403 412 10.1084/jem.189.2.403 9892622 PMC2192983 67 D. E. Picarella A. Kratz C. B. Li N. H. Ruddle R. A. Flavell Transgenic Tumor Necrosis Factor (TNF)‐Alpha Production in Pancreatic Islets Leads to Insulitis, Not Diabetes. Distinct Patterns of Inflammation in TNF‐Alpha and TNF‐Beta Transgenic Mice Journal of Immunology 150 9 1993 4136 4150 7682590 68 D. Lo L. C. Burkly G. Widera Diabetes and Tolerance in Transgenic Mice Expressing Class II MHC Molecules in Pancreatic Beta Cells Cell 53 1 1988 159 168 10.1016/0092-8674(88)90497-7 2964908 69 A. Kratz “Lymphotoxin Transgenic Mice: An In Vivo System to Probe the Biologic Activity of a Cytokine 70 F. S. Wong I. Visintin L. Wen J. Granata R. Flavell C. A. Janeway The Role of Lymphocyte Subsets in Accelerated Diabetes in Nonobese Diabetic‐Rat Insulin Promoter‐B7‐1 (NOD‐RIP‐B7‐1) Mice Journal of Experimental Medicine 187 12 1998 1985 1993 10.1084/jem.187.12.1985 9625758 PMC2212360 71 S. Liao K. Bentley M. Lebrun W. Lesslauer F. H. Ruddle N. H. Ruddle Transgenic LacZ Under Control of Hec‐6st Regulatory Sequences Recapitulates Endogenous Gene Expression on High Endothelial Venules Proceedings of the National Academy of Sciences of the United States of America 104 11 2007 4577 4582 10.1073/pnas.0700334104 17360566 PMC1838643 72 N. H. Ruddle Lymphatic Vessels and Tertiary Lymphoid Organs Journal of Clinical Investigation 124 3 2014 953 959 10.1172/JCI71611 24590281 PMC3934190 73 S. Stranford N. H. Ruddle Follicular Dendritic Cells, Conduits, Lymphatic Vessels, and High Endothelial Venules in Tertiary Lymphoid Organs: Parallels With Lymph Node Stroma Frontiers in Immunology 3 2012 350 10.3389/fimmu.2012.00350 23230435 PMC3515885 74 R. Sacca C. A. Cuff W. Lesslauer N. H. Ruddle Differential Activities of Secreted Lymphotoxin‐alpha3 and Membrane Lymphotoxin‐alpha1beta2 in Lymphotoxin‐Induced Inflammation: Critical Role of TNF Receptor 1 Signaling Journal of Immunology 160 1 1998 485 491 9552007 75 A. B. Rodriguez J. D. Peske A. N. Woods Immune Mechanisms Orchestrate Tertiary Lymphoid Structures in Tumors via Cancer‐Associated Fibroblasts Cell Reports 36 3 2021 109422 10.1016/j.celrep.2021.109422 34289373 PMC8362934 76 N. H. Ruddle Tertiary Lymphoid Structures and Immunotherapy: Challenges and Opportunities Methods in Molecular Biology 2864 2025 299 312 10.1007/978-1-0716-4184-2_16 39527229 77 D. Kerjaschki H. M. Regele I. Moosberger Lymphatic Neoangiogenesis in Human Kidney Transplants Is Associated With Immunologically Active Lymphocytic Infiltrates Journal of the American Society of Nephrology 15 3 2004 603 612 10.1097/01.asn.0000113316.52371.2e 14978162 78 A. Bistrup D. Tsay P. Shenoy Detection of a Sulfotransferase (HEC‐GlcNAc6ST) in High Endothelial Venules of Lymph Nodes and in High Endothelial Venule‐Like Vessels Within Ectopic Lymphoid Aggregates: Relationship to the MECA‐79 Epitope American Journal of Pathology 164 5 2004 1635 1644 10.1016/S0002-9440(10)63722-4 15111310 PMC1615668 79 S. J. Im R. C. Obeng T. H. Nasti Characteristics and Anatomic Location of PD‐1(+)TCF1(+) Stem‐Like CD8 T Cells in Chronic Viral Infection and Cancer Proceedings of the National Academy of Sciences of the United States of America 120 41 2023 e2221985120 10.1073/pnas.2221985120 37782797 PMC10576122 80 Y. Sato A. Jain S. Ohtsuki Stem‐Like CD4(+) T Cells in Perivascular Tertiary Lymphoid Structures Sustain Autoimmune Vasculitis Science Translational Medicine 15 712 2023 eadh0380 10.1126/scitranslmed.adh0380 37672564 PMC11131576 81 C. Penaranda Q. Tang N. H. Ruddle J. A. Bluestone Prevention of Diabetes by FTY720‐Mediated Stabilization of Peri‐Islet Tertiary Lymphoid Organs Diabetes 59 6 2010 1461 1468 10.2337/db09-1129 20299465 PMC2874707 82 P. Hjelmstrom J. Fjell T. Nakagawa R. Sacca C. A. Cuff N. H. Ruddle Lymphoid Tissue Homing Chemokines Are Expressed in Chronic Inflammation American Journal of Pathology 156 4 2000 1133 1138 10.1016/S0002-9440(10)64981-4 10751336 PMC1876894 83 P. V. Lehmann T. Forsthuber A. Miller E. E. Sercarz Spreading of T‐Cell Autoimmunity to Cryptic Determinants of an Autoantigen Nature 358 6382 1992 155 157 10.1038/358155a0 1377368 84 E. J. McMahon S. L. Bailey C. V. Castenada H. Waldner S. D. Miller Epitope Spreading Initiates in the CNS in Two Mouse Models of Multiple Sclerosis Nature Medicine 11 3 2005 335 339 10.1038/nm1202 15735651 85 S. Kuerten A. Schickel C. Kerkloh Tertiary Lymphoid Organ Development Coincides With Determinant Spreading of the Myelin‐Specific T Cell Response Acta Neuropathologica 124 6 2012 861 873 10.1007/s00401-012-1023-3 22842876 86 N. S. Joshi E. H. Akama‐Garren Y. Lu Regulatory T Cells in Tumor‐Associated Tertiary Lymphoid Structures Suppress Anti‐Tumor T Cell Responses Immunity 43 3 2015 579 590 10.1016/j.immuni.2015.08.006 26341400 PMC4826619 87 M. Y. Kim F. M. McConnell F. M. Gaspal Function of CD4+CD3− Cells in Relation to B‐ and T‐Zone Stroma in Spleen Blood 109 4 2007 1602 1610 10.1182/blood-2006-04-018465 17018858 88 E. Scandella B. Bolinger E. Lattmann Restoration of Lymphoid Organ Integrity Through the Interaction of Lymphoid Tissue‐Inducer Cells With Stroma of the T Cell Zone Nature Immunology 9 6 2008 667 675 10.1038/ni.1605 18425132 89 M. Lochner C. Ohnmacht L. Presley Microbiota‐Induced Tertiary Lymphoid Tissues Aggravate Inflammatory Disease in the Absence of RORgamma t and LTi Cells Journal of Experimental Medicine 208 1 2011 125 134 10.1084/jem.20100052 21173107 PMC3023125 90 F. Barone S. Nayar J. Campos IL‐22 Regulates Lymphoid Chemokine Production and Assembly of Tertiary Lymphoid Organs Proceedings of the National Academy of Sciences of the United States of America 112 35 2015 11024 11029 10.1073/pnas.1503315112 26286991 PMC4568258 91 A. Vaccaro T. van de Walle M. Ramachandran M. Essand A. Dimberg Of Mice and Lymphoid Aggregates: Modeling Tertiary Lymphoid Structures in Cancer Frontiers in Immunology 14 2023 1275378 10.3389/fimmu.2023.1275378 37954592 PMC10639130 92 B. S. Conta M. B. Powell N. H. Ruddle Activation of Lyt‐1+ and Lyt‐2+ T Cell Cloned Lines: Stimulation of Proliferation, Lymphokine Production, and Self‐Destruction Journal of Immunology 134 4 1985 2185 2190 2579131 93 C. F. Ware P. D. Crowe M. H. Grayson M. J. Androlewicz J. L. Browning Expression of Surface Lymphotoxin and Tumor Necrosis Factor on Activated T, B, and Natural Killer Cells Journal of Immunology 149 12 1992 3881 3888 1281193 94 A. Jager V. Dardalhon R. A. Sobel E. Bettelli V. K. Kuchroo Th1, Th17, and Th9 Effector Cells Induce Experimental Autoimmune Encephalomyelitis With Different Pathological Phenotypes Journal of Immunology 183 11 2009 7169 7177 10.4049/jimmunol.0901906 PMC2921715 19890056 95 A. Peters L. A. Pitcher J. M. Sullivan Th17 Cells Induce Ectopic Lymphoid Follicles in Central Nervous System Tissue Inflammation Immunity 35 6 2011 986 996 10.1016/j.immuni.2011.10.015 22177922 PMC3422678 96 T. Marinkovic A. Garin Y. Yokota Interaction of Mature CD3+CD4+ T Cells With Dendritic Cells Triggers the Development of Tertiary Lymphoid Structures in the Thyroid Journal of Clinical Investigation 116 10 2006 2622 2632 10.1172/JCI28993 16998590 PMC1570377 97 R. Mattiuz J. Boumelha P. Hamon “Dendritic Cells Type 1 Control the Formation, Maintenance, and Function of Tertiary Lymphoid Structures in Cancer,” bioRxiv 10.1101/2024.12.27.628014 98 K. Kabashima T. A. Banks K. M. Ansel T. T. Lu C. F. Ware J. G. Cyster Intrinsic Lymphotoxin‐Beta Receptor Requirement for Homeostasis of Lymphoid Tissue Dendritic Cells Immunity 22 4 2005 439 450 10.1016/j.immuni.2005.02.007 15845449 99 S. Liao G. Cheng D. A. Conner Impaired Lymphatic Contraction Associated With Immunosuppression Proceedings of the National Academy of Sciences of the United States of America 108 46 2011 18784 18789 10.1073/pnas.1116152108 22065738 PMC3219138 100 S. Liao N. H. Ruddle Synchrony of High Endothelial Venules and Lymphatic Vessels Revealed by Immunization Journal of Immunology 177 5 2006 3369 3379 10.4049/jimmunol.177.5.3369 16920978 101 S. Liao P. Y. von der Weid Inflammation‐Induced Lymphangiogenesis and Lymphatic Dysfunction Angiogenesis 17 2 2014 325 334 10.1007/s10456-014-9416-7 24449090 PMC3981917 102 J. L. Browning N. Allaire A. Ngam‐Ek Lymphotoxin‐Beta Receptor Signaling Is Required for the Homeostatic Control of HEV Differentiation and Function Immunity 23 5 2005 539 550 10.1016/j.immuni.2005.10.002 16286021 103 E. Astorri M. Bombardieri S. Gabba M. Peakman P. Pozzilli C. Pitzalis Evolution of Ectopic Lymphoid Neogenesis and In Situ Autoantibody Production in Autoimmune Nonobese Diabetic Mice: Cellular and Molecular Characterization of Tertiary Lymphoid Structures in Pancreatic Islets Journal of Immunology 185 6 2010 3359 3368 10.4049/jimmunol.1001836 20713891 104 E. Korpos N. Kadri S. Loismann Identification and Characterisation of Tertiary Lymphoid Organs in Human Type 1 Diabetes Diabetologia 64 7 2021 1626 1641 10.1007/s00125-021-05453-z 33912981 PMC8187221 105 D. H. Shu W. J. Ho L. T. Kagohara Immunotherapy Response Induces Divergent Tertiary Lymphoid Structure Morphologies in Hepatocellular Carcinoma Nature Immunology 25 11 2024 2110 2123 10.1038/s41590-024-01992-w 39455893 PMC12042221 106 Y. F. Shang Y. Y. Shen M. C. Zhang Progress in Salivary Glands: Endocrine Glands With Immune Functions Frontiers in Endocrinology 14 2023 1061235 10.3389/fendo.2023.1061235 36817607 PMC9935576 107 T. Ieko H. Sasaki N. Maeda J. Fujiki H. Iwano H. Yokota Analysis of Corticosterone and Testosterone Synthesis in Rat Salivary Gland Homogenates Frontiers in Endocrinology 10 2019 479 10.3389/fendo.2019.00479 31379745 PMC6650613 108 D. Yang J. Liu H. Qian Q. Zhuang Cancer‐Associated Fibroblasts: From Basic Science to Anticancer Therapy Experimental & Molecular Medicine 55 7 2023 1322 1332 10.1038/s12276-023-01013-0 37394578 PMC10394065 109 K. Peng Y. X. Fu Y. Liang Engineering Cytokines for Tumor‐Targeting and Selective T Cell Activation Trends in Molecular Medicine 31 4 2025 373 387 10.1016/j.molmed.2025.01.010 39955218 110 G. C. Furtado M. E. Pacer G. Bongers TNFalpha‐Dependent Development of Lymphoid Tissue in the Absence of RORgammat(+) Lymphoid Tissue Inducer Cells Mucosal Immunology 7 3 2014 602 614 10.1038/mi.2013.79 24129162 PMC4264842 111 Y. Lee R. K. Chin P. Christiansen Recruitment and Activation of Naive T Cells in the Islets by Lymphotoxin Beta Receptor‐Dependent Tertiary Lymphoid Structure Immunity 25 3 2006 499 509 10.1016/j.immuni.2006.06.016 16934497 112 D. Schrama P. Thor Straten W. H. Fischer Targeting of Lymphotoxin‐Alpha to the Tumor Elicits an Efficient Immune Response Associated With Induction of Peripheral Lymphoid‐Like Tissue Immunity 14 2 2001 111 121 10.1016/s1074-7613(01)00094-2 11239444 113 J. G. Skeate M. E. Otsmaa R. Prins D. J. Fernandez D. M. Da Silva W. M. Kast TNFSF14: LIGHTing the Way for Effective Cancer Immunotherapy Frontiers in Immunology 11 2020 922 10.3389/fimmu.2020.00922 32499782 PMC7243824 114 A. Johansson‐Percival B. He Z. J. Li De Novo Induction of Intratumoral Lymphoid Structures and Vessel Normalization Enhances Immunotherapy in Resistant Tumors Nature Immunology 18 11 2017 1207 1217 10.1038/ni.3836 28892469 115 Z. Mi J. Chen Z. Zhang Synthetic Biology‐Driven Induction of Mature TLS Formation Enhances Antitumor Immunity in Colorectal Cancer Science Translational Medicine 17 803 2025 eado8395 10.1126/scitranslmed.ado8395 40531967 116 E. Allen A. Jabouille L. B. Rivera Combined Antiangiogenic and Anti‐PD‐L1 Therapy Stimulates Tumor Immunity Through HEV Formation Science Translational Medicine 9 385 2017 eaak9679 10.1126/scitranslmed.aak9679 28404866 PMC5554432 117 Y. Hua G. Vella F. Rambow Cancer Immunotherapies Transition Endothelial Cells Into HEVs That Generate TCF1(+) T Lymphocyte Niches Through a Feed‐Forward Loop Cancer Cell 40 12 2022 1600 1618.e10 10.1016/j.ccell.2022.11.002 36423635 PMC9899876 118 A. Bassez H. Vos L. Van Dyck A Single‐Cell Map of Intratumoral Changes During Anti‐PD1 Treatment of Patients With Breast Cancer Nature Medicine 27 5 2021 820 832 10.1038/s41591-021-01323-8 33958794 119 J. Nagasaki T. Inozume N. Sax PD‐1 Blockade Therapy Promotes Infiltration of Tumor‐Attacking Exhausted T Cell Clonotypes Cell Reports 38 5 2022 110331 10.1016/j.celrep.2022.110331 35108529 120 R. Vion M. Roulleaux‐Dugage R. Flippot Induction of Tertiary Lymphoid Structures in Tumor Microenvironment to Improve Anti‐Tumoral Immune Checkpoint Blockade Efficacy European Journal of Cancer 225 2025 115572 10.1016/j.ejca.2025.115572 40517527 121 N. Gutierrez‐Melo D. Baumjohann T Follicular Helper Cells in Cancer Trends in Cancer 9 4 2023 309 325 10.1016/j.trecan.2022.12.007 36642575 122 M. K. Gatumu K. Skarstein A. Papandile J. L. Browning R. A. Fava A. I. Bolstad Blockade of Lymphotoxin‐Beta Receptor Signaling Reduces Aspects of Sjogren's Syndrome in Salivary Glands of Non‐Obese Diabetic Mice Arthritis Research & Therapy 11 1 2009 R24 10.1186/ar2617 19222863 PMC2688257 123 G. Seleznik H. Seeger J. Bauer The Lymphotoxin Beta Receptor Is a Potential Therapeutic Target in Renal Inflammation Kidney International 89 1 2016 113 126 10.1038/ki.2015.280 26398497 124 E. W. St Clair A. N. Baer C. Wei Clinical Efficacy and Safety of Baminercept, a Lymphotoxin Beta Receptor Fusion Protein, in Primary Sjogren's Syndrome: Results From a Phase II Randomized, Double‐Blind, Placebo‐Controlled Trial Arthritis The Rheumatologist 70 9 2018 1470 1480 10.1002/art.40513 PMC6115299 29604186 125 Y. O. S. Nagase A. Furukawa T. Kanazawa “Tertiary Lymphoid Structure as a Therapeutic Target of Crohn's Disease: Modulation by TNFα Blockade,” bioRxiv 10.1101/20241123625032 126 V. Brinkmann D. Pinschewer K. Chiba L. Feng FTY720: A Novel Transplantation Drug That Modulates Lymphocyte Traffic Rather Than Activation Trends in Pharmacological Sciences 21 2 2000 49 52 10.1016/s0165-6147(99)01419-4 10664606 127 S. Mandala R. Hajdu J. Bergstrom Alteration of Lymphocyte Trafficking by Sphingosine‐1‐Phosphate Receptor Agonists Science 296 2002 346 349 10.1126/science.1070238 11923495 128 V. Brinkmann A. Billich T. Baumruker Fingolimod (FTY720): Discovery and Development of an Oral Drug to Treat Multiple Sclerosis Nature Reviews. Drug Discovery 9 11 2010 883 897 10.1038/nrd3248 21031003 129 M. Le Rochais P. Hemon D. Ben‐Guigui Deciphering the Maturation of Tertiary Lymphoid Structures in Cancer and Inflammatory Diseases of the Digestive Tract Using Imaging Mass Cytometry Frontiers in Immunology 14 2023 1147480 10.3389/fimmu.2023.1147480 37143660 PMC10151544 130 M. van Rijthoven S. Obahor F. Pagliarulo Multi‐Resolution Deep Learning Characterizes Tertiary Lymphoid Structures and Their Prognostic Relevance in Solid Tumors Communications Medicine 4 1 2024 5 10.1038/s43856-023-00421-7 38182879 PMC10770129 131 Z. Chen X. Wang Z. Jin Deep Learning on Tertiary Lymphoid Structures in Hematoxylin‐Eosin Predicts Cancer Prognosis and Immunotherapy Response NPJ Precision Oncology 8 1 2024 73 10.1038/s41698-024-00579-w 38519580 PMC10959936 132 N. H. Ruddle L. Truman K. Bentley N. Alonso‐Gonzalez Fluorescent Transgenic Reporter Mice Can Be Used for In Vivo Imaging of Lymphatic Vessels and High Endothelial Venules in a Sjögren's Model Abstract Journal of Immunology 188 1 2012 61.7 133 L. A. Truman N. A‐Gonzalez K. Bentley N. H. Ruddle Lymphatic Function in Head and Neck Inflammation Lymphatic Research and Biology 11 3 2013 187 192 24044758 10.1089/lrb.2013.0013 PMC3780307 134 A. Bogoslowski J. Ren C. Quintard J. M. Penninger Organoid Models of Lymphoid Tissues Organoids 4 2 2025 7 135 C. Domblides J. Rochefort C. Riffard Tumor‐Associated Tertiary Lymphoid Structures: From Basic and Clinical Knowledge to Therapeutic Manipulation Frontiers in Immunology 12 2021 698604 10.3389/fimmu.2021.698604 34276690 PMC8279885 136 X.‐H. Wang W.‐Y. Wang Z.‐J. Sun Immune Organoid for Cancer Immunotherapy Acta Pharmaceutica Sinica B 15 7 2025 3419 3435 40698131 10.1016/j.apsb.2025.04.031 PMC12278439 137 M. V. J. Braham R. S. van Binnendijk A. M. Buisman R. E. Mebius J. de Wit C. van Els A Synthetic Human 3D In Vitro Lymphoid Model Enhancing B‐Cell Survival and Functional Differentiation iscience 26 1 2023 105741 10.1016/j.isci.2022.105741 36590159 PMC9794978 138 A. I. Morrison J. E. Kuipers H. P. Roest Functional Organotypic Human Lymph Node Model With Native Immune Cells Benefits From Fibroblastic Reticular Cell Enrichment Scientific Reports 15 1 2025 12233 10.1038/s41598-025-95031-9 40210900 PMC11986095 139 N. Werschler C. Quintard S. Nguyen J. Penninger Engineering Next Generation Vascularized Organoids Atherosclerosis 398 2024 118529 10.1016/j.atherosclerosis.2024.118529 39304390 140 X. Wang X. Li J. Zhao Rapid Generation of hPSC‐Derived High Endothelial Venule Organoids With In Vivo Ectopic Lymphoid Tissue Capabilities Advanced Materials 36 2024 e2308760 10.1002/adma.202308760 38306610 PMC11009051 ",
  "metadata": {
    "Title of this paper": "Rapid Generation of hPSC‐Derived High Endothelial Venule Organoids With In Vivo Ectopic Lymphoid Tissue Capabilities",
    "Journal it was published in:": "Immunological Reviews",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477831/"
  }
}