{
  "title": "Paper_858",
  "abstract": "pmc Int J Cardiol Cardiovasc Risk Prev Int J Cardiol Cardiovasc Risk Prev 4111 ijccrp International Journal of Cardiology. Cardiovascular Risk and Prevention 2772-4875 Elsevier PMC12475582 PMC12475582.1 12475582 12475582 41019535 10.1016/j.ijcrp.2025.200510 S2772-4875(25)00148-5 200510 1 Research Paper Chronic emotional stress and mediating role of Interleukin-6 in the association with cardiometabolic disorders in a multiethnic middle-aged and older US population Hallab Asma a b c d ⁎ The Health and Aging Brain Study (HABS-HD) Study Team HABS-HD MPIs O'Bryant Sid E. Yaffe Kristine Toga Arthur Rissman Robert Johnsonthe Leigh HABS-HD Investigators Braskie Meredith King Kevin Hall James R. Petersen Melissa Palmer Raymond Barber Robert Shi Yonggang Zhang Fan Nandy Rajesh McColl Roderick Mason David Christian Bradley Phillips Nicole Large Stephanie Lee Joe Vardarajan Badri Mindt Monica Rivera Cheema Amrita Barnes Lisa Mapstone Mark Cohen Annie Kind Amy Okonkwo Ozioma Vintimilla Raul Zhou Zhengyang Donohue Michael Raman Rema Borzage Matthew Mielke Michelle Ances Beau Babulal Ganesh Llibre-Guerra Jorge Hill Carl Vig Rocky a b c d ⁎ 12 2025 06 9 2025 27 494798 200510 17 7 2025 22 8 2025 5 9 2025 06 09 2025 28 09 2025 29 09 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). Introduction Chronic emotional stress is a well-recognized risk factor for psychiatric and cardiometabolic disorders. The mediating role of low-grade inflammation in older, ethnically diverse populations has never been studied. Methods The multiethnic ≥50-year-old study population is a subset of the Health and Aging Brain Study: Health Disparities (HABS-HD) study. Adjusted logistic and linear regression were used to assess associations. Statistical mediation analysis with non-parametric bootstrapping of confidence intervals was used to determine the intermediate role of Interleukin-6 (IL-6). Results The study included 2173 participants (50–92 years). Black participants disclosed higher chronic stress levels than White and Hispanic participants. Having a chronic stress total score ≥ six points is associated with 53 % higher odds of disclosing concomitant cardiovascular disease (CVD) (adj.OR = 1.53 [1.10–2.53]), 31 % of Type-2 diabetes (T 2 p-value FDR 2 p-value FDR p-value FDR p-value FDR Conclusions The study highlights a further aspect of the pathophysiological mechanisms involved in the brain-body communication. While IL-6 partially explains statistical associations between chronic emotional stress and major cardiometabolic disorders, no causal effects can be inferred from this study owing to the cross-sectional design. Larger longitudinal studies are needed to better clarify the temporal relationship between the events and to build upon our findings. Highlights • Chronic emotional stress was particularly higher in Black participants compared to White and Hispanic controls. • High levels of chronic emotional stress were associated with increasing odds of concomitant cardiometabolic disorders. • Interleukin-6 was a significant statistical mediator in the association. Keywords Psychological distress Low-grade inflammation Brain-body interaction Ethnic disparity Aging Pro-inflammatory cytokines pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Handling editor: D Levy 1 Introduction Chronic emotional stress, first described by Hans Selye in 1956, is a long-lasting psychological distress that might be triggered by intrinsic or extrinsic factors destabilizing a state of homeostasis [ 1 2 2 1 3 4 5 6 7 8 9 7 10 11 12 13 14 15 Similar to mental health adversities, cardiovascular (exp. coronary artery disease, heart failure, arrythmias, hypertension, peripheral artery disease, valvular heart disease …) and metabolic disorders (exp. Type 2 diabetes mellitus (T 2 15 [16] [17] [18] 19 20 Several biological models have been explored to analyze the pathophysiology of the interaction between psychological adversities and cardiometabolic risk factors. In addition to socioeconomic insecurities, behavioral patterns, hormonal dysregulations, and cerebrovascular pathologies, systemic (and neuro-) inflammation has been demonstrated to be significantly associated with the genesis of mental [ 21 22 23 24 2 25 2 Individuals of advanced age are highly exposed to psychological adversities such as depression, anxiety, and emotional stress owing to various etiologies and triggers [ 26 26 27 28 29 30 7 The summation of all those unfavorable backgrounds makes studying chronic emotional stress in a multiethnic population of specific interest in order to better understand its association with cardiometabolic risk factors and the role of inflammation in this particular group. Very limited studies explored the association between psychological distress and cardiometabolic risk factors in older adults. Furthermore, most reports tend to be restricted to dominant ethnic groups and younger populations, mainly in industrialized societies, and there is an urgent need to understand and mitigate biases related to underestimating ethnic disparities in the published literature [ 31 The main aim of this study was to fill this gap by exploring the association between chronic emotional stress and cardiometabolic risk factors in a multiethnic population of middle-aged and older adults and evaluating the mediating role of systemic inflammation, particularly IL-6, in this association. 2 Methods The study was performed in compliance with the Strengthening the Reporting of Observational Studies in Epidemiology (STROBE) guidelines [ 32 2.1 Study population The study population is a subset of the Health and Aging Brain Study: Health Disparities (HABS-HD), a follow-up cohort of the Health and Aging Brain among Latino Elders (HABLE) study initiated in 2017 at the Institute for Translational Research (ITR) at the University of North Texas Health Science Center (UNTHSC), Fort Worth, Texas [ 33 34 33 The study is restricted to baseline data and cross-sectional analyses owing to a high loss of follow-up and a lower incidence of cardiometabolic disorders at the 24-month visit. The current study is based on a secondary analysis of de-identified data and was performed in compliance with the data use agreement. Ethical approval was obtained from the local institutional review board (North Texas Health Science Center Institutional Review Board). Procedures contributing to this work comply in total with the ethical standards of the relevant national and institutional committees on human experimentation and with the Helsinki Declaration 2.2 Chronic emotional stress Chronic emotional stress, dating over six months Supplementary Table 1 Chronic Stress Total score The use of the median value as a cutoff ensures that the chronic emotional distress was not only related to the own health issues. Depression and anxiety were included in the analysis as major predictors of psychological burdens and as intermediaries in the path between chronic emotional stress and the outcome of interest. A participant was diagnosed with depression: Anxiety 2.3 Cardiometabolic risk factors A major cardiometabolic risk factor and surrogate biomarker of the following cardiometabolic diseases is Body Mass Index (BMI) 2 Cardiometabolic diseases are reported as binary variables and defined in the study as follows. • Cardiovascular disease (CVD) • Type 2 Diabetes Mellitus (T 2 OR OR • Dyslipidemia OR OR OR OR • Arterial hypertension OR OR OR OR • Obesity 2.4 Systemic inflammation Systemic inflammation was evaluated through IL-6 levels. IL-6 was measured in the fasting blood serum using a highly sensitive technique and reported in pg/mL. Measurement details were reported in a previous methodological publication [ 34 2.5 Covariables Age (years), sex (“female” vs. “male”), educational level (years), ethnicity (self-reported ethnicity of “non-Hispanic white”, “Hispanic”, or “Black”), Tobacco smoking (binary), alcohol consumption (binary), no physical activity (four cases with missing values were attributed to this group), and BMI are considered strong predictors of cardiometabolic disorders and were adjusted for in the regression models. Age, education, and BMI had an almost normal distribution. Being of older age, female, less educated, and an ethnic minority is considered a risk factor for higher stress levels and consequent health adversities [ 35 36 2.6 Inclusion criteria Only non-duplicated cases with complete data on chronic emotional stress, BMI, and IL-6 values were included ( Fig. 1 Fig. 1 Inclusion criteria and characteristics of study participants. 1.a. 1.b. 1.c. 1.d. 1.e. Fig. 1 2.7 Statistical analysis The statistical analysis and data visualization were performed using RStudio version 2024.12.1. The normality of the distribution of variables was assessed using Q-Q plotting and Shapiro-Wilk test. Continuous variables were reported in medians with interquartile ranges (IQR), and count variables were reported as numbers with percentages (%). Chronic stress-related group comparison was performed using the Wilcoxon rank sum test for continuous variables and Pearson's Chi-squared ( X 2 X 2 p values The association between chronic emotional stress and biological biomarkers of cardiometabolic risks was evaluated using linear regression models. When indicated, restricted cubic splines were included in the models to test for non-linearity. The association between the exposure to chronic emotional stress as a binary independent variable (the median value as a cutoff) and concomitant cardiometabolic disorder as a binary dependent variable was assessed using logistic regression. The crude models were first reported with the corresponding odds ratios ( OR CI p value Mediation analysis was performed using a 1000-fold non-parametric bootstrapping method of 95 % CI, and the Average Causal Mediation Effects (ACME), Average Direct Effects (ADE), and total effect, as well as their corresponding 95 % CI p values Fig. 1 p FDR p p FDR values A sensitivity analysis was performed based on the total score of chronic emotional stress as a continuous independent variable. 3 Results 3.1 Study population The study included 2173 participants aged between 50 and 92 years and with a median age of 66 (59 - 72 years),. Among them, 955 (44 %) disclosed themselves as “white”, 943 (43 %) as “Hispanic”, and 275 (13 %) as “black”. Women represented 62 % of the study population. The median value of the chronic stress total score was six points [ 2 11 Based on this median value as a cutoff, two groups were differentiated. There were 1028 who had a total score under six points (lower chronic emotional stress) and 1145 with a total score equal to or over six points (higher chronic emotional stress). The group with higher chronic emotional stress was significantly younger (65 vs. 66 years, p value p value p value p value p value 2 p value p value p value More tobacco (7.2 % vs. 4.7 %, p value p value p value p value Table 1 Table 1 Characteristics of study population and chronic stress-based group comparison. Table 1 Demographical information Overall Chronic emotional stress Complete Total a Score < 6 a Score ≥ 6 a p-value b Age (years) 2173 66 (59, 72) , 66 (60, 72,) 65 (58,71,) <0.001 Sex (females) 2173 1343 (62 %) 590 (57 %) 753 (66 %) <0.001 Ethnicity 2173 0.039 White 955 (44 %) 450 (44 %) 505 (44 %) Hispanic 943 (43 %) 466 (45 %) 477 (42 %) Black 275 (13 %) 112 (11 %) 163 (14 %) Retired 2164 1229 (57 %) 583 (57 %) 646 (57 %) 0.8 Missing value 9 6 3 Education (years) 2173 14.0 (11.0, 16.0) 14.0 (9.0, 16.0) 14.0 (12.0, 16.0) 0.5 Psychological burdens Chronic stress total score (points) 2173 6 (2, 11,) 2 (0, 4) 11 (8, 15,) <0.001 Depression 2173 738 (34 %) 234 (23 %) 504 (44 %) <0.001 Anxiety 2173 376 (17 %) 106 (10 %) 270 (24 %) <0.001 Cardiometabolic risk factors Arterial hypertension 2173 1385 (64 %) 634 (62 %) 751 (66 %) 0.058 Type 2 diabetes mellitus 2173 537 (25 %) 232 (23 %) 305 (27 %) 0.028 Cardiovascular disorders 2173 166 (7.6 %) 66 (6.4 %) 100 (8.7 %) 0.043 Tobacco consumption 2173 130 (6.0 %) 48 (4.7 %) 82 (7.2 %) 0.014 Alcohol consumption 2173 16 (0.7 %) 3 (0.3 %) 13 (1.1 %) 0.022 No physical activity 2173 163 (7.5 %) 57 (5.5 %) 106 (9.3 %) 0.001 Obesity 2173 1007 (46 %) 434 (42 %) 573 (50 %) <0.001 Dyslipidemia 2173 1530 (70 %) 713 (69 %) 817 (71 %) 0.3 Physical examination BMI 2173 29 (26,33) 29 (26,33) 30 (26,34) <0.001 Systolic blood pressure (mmHg) 2153 135 (122, 149) 135 (122, 149) 134 (122, 149) >0.9 Missing value 20 6 14 Diastolic blood pressure (mmHg) 2153 82 (75,90) 82 (75,89) 83 (75, 90) 0.033 Missing value 20 6 14 Heart rate (bpm) 2165 68 (61,75) 67 (60,75) 69 (62,76) <0.001 Missing value 8 1 7 Blood measurements Triglycerides (mg/dL) 2145 112 (82, 157) 111 (81, 155) 113 (82, 158) 0.3 Missing value 28 12 16 Total Cholesterol (mg/dL) 2145 181 (154, 209) 181 (154, 206) 182 (155, 210) 0.2 Missing value 28 12 16 HDL-Cholesterol (mg/dL) 2145 52 (43,63) 52 (43,63) 52 (43,63) >0.9 Missing value 28 12 16 LDL-Cholesterol (mg/dL) 2119 102 (80, 127) 100 (80, 125) 103 (80, 128) 0.3 Missing value 54 28 26 HbA1c (%) 2144 5.60 (5.30, 6.10) 5.60 (5.30, 6.00) 5.60 (5.30, 6.10) 0.2 Missing value 29 14 15 Log-transformed IL-6 (pg/mL) 2173 −0.06 (−0.46, 0.35) −0.11 (−0.48, 0.30) −0.01 (−0.43, 0.39) 0.002 BMI HbA1c HDL IL-6 LDL a a b The comparison between different ethnic groups showed significantly higher chronic stress levels in Black participants compared to the White and Hispanic ones ( Fig. 1 There was a significant positive log-shaped association between chronic stress and odds of depression and anxiety ( p non-linear models Fig. 1 3.2 Chronic emotional stress and immunological and cardiometabolic biomarkers Higher scores in chronic stress tests were significantly associated with higher BMI, HbA1c, and IL-6 levels, as well as higher values of systolic and diastolic blood pressure and cardiac rate. The associations remained statistically significant after adjusting for age, sex, and ethnicity. Fig. 2 Fig. 2 Associations between chronic emotional stress and biomarkers of cardiometabolic disorders. 2.a. 2.b. 2.c. 2.d. 2.e. 2.f. Fig. 2 3.3 Emotional stress and cardiometabolic risks Having a chronic stress total score equal to or over six points is associated with 53 % higher odds of having concomitant CVD (adj. OR = 1.53 [1.10–2.53]), 31 % of T 2 Fig. 3 Table 2 Fig. 3 Associations between chronic emotional stress and different cardiometabolic disorders. 3.a. 3.b. Fig. 3 Table 2 Predictive value of chronic stress (binary) on concomitant cardiovascular disorders. Table 2 Predictors Cardiovascular Disease Type-2 Diabetes Mellitus Dyslipidemia Hypertension Obesity OR (95 % CI) p-value OR (95 % CI) p-value OR (95 % CI) p-value OR (95 % CI) p-value OR (95 % CI) p-value Crude Model Chronic stress (Binary) 1.39 (1.01–1.93) 0.042 1.25 (1.02–1.52) 0.028 1.10 (0.92–1.32) 0.3 1.18 (0.99–1.41) 0.058 1.37 (1.16–1.62) <0.001 Adjusted Model Chronic stress (Binary) 1.53 (1.10, 2.15) 0.012 1.31 (1.06, 1.62) 0.013 1.15 (0.95, 1.39) 0.14 1.23 (1.02, 1.49) 0.031 1.30 (1.09, 1.55) 0.003 Age (years) 1.05 (1.03, 1.08) <0.001 1.03 (1.02, 1.05) <0.001 1.01 (1.00, 1.02) 0.10 1.06 (1.05, 1.08) <0.001 0.98 (0.97, 0.99) <0.001 Sex 0.003 0.002 0.028 <0.001 0.3 Male – – – – – Female 0.60 (0.43, 0.84) 0.70 (0.57, 0.87) 0.80 (0.66, 0.98) 0.66 (0.54, 0.80) 1.09 (0.91, 1.31) Ethnicity 0.7 <0.001 0.014 <0.001 <0.001 White – – – – – Hispanic 0.84 (0.53, 1.32) 3.11 (2.30, 4.21) 1.32 (1.02, 1.72) 1.41 (1.09, 1.84) 1.29 (1.02, 1.65) Black 0.88 (0.50, 1.49) 2.17 (1.51, 3.10) 0.83 (0.62, 1.12) 3.18 (2.26, 4.53) 2.25 (1.69, 3.00) Education (years) 1.04 (0.99, 1.09) 0.11 0.94 (0.91, 0.96) <0.001 0.99 (0.96, 1.02) 0.4 0.97 (0.95, 1.00) 0.037 0.98 (0.96, 1.01) 0.13 Tobacco 0.91 (0.40, 1.83) 0.8 1.37 (0.91, 2.06) 0.13 0.86 (0.58, 1.28) 0.5 1.13 (0.76, 1.71) 0.5 0.81 (0.56, 1.16) 0.2 Alcohol 0.62 (0.03, 3.25) 0.6 1.12 (0.35, 3.32) 0.8 0.54 (0.19, 1.61) 0.3 1.17 (0.39, 4.35) 0.8 1.84 (0.66, 5.56) 0.2 No physical activity 1.43 (0.79, 2.45) 0.2 1.44 (1.00, 2.06) 0.053 1.32 (0.91, 1.94) 0.15 0.95 (0.66, 1.39) 0.8 1.79 (1.29, 2.51) <0.001 BMI 1.03 (1.00, 1.05) 0.062 1.07 (1.05, 1.09) <0.001 1.01 (0.99, 1.02) 0.4 1.10 (1.08, 1.12) <0.001 BMI: CI: OR: Adding an interaction term between the binary chronic stress score and ethnicity did not show significant results across the studied outcomes. In the sensitivity analysis, the increase of one point in the total score of chronic emotional stress was linearly associated with a rise of 5 % in the odds of CVD (adj. OR = 1.05 [1.03–1.07]), 2 % of diabetes (adj. OR = 1.02 [1.00–1.03]), 3 % of hypertension (adj. OR = 1.03 [1.01–1.04]), and 2 % of (adj. OR = 1.02 [1.01–1.03]), with no significant association with dyslipidemia ( Fig. 3 Table 3 Table 3 Predictive value of chronic stress total score (continuous) on concomitant cardiovascular disorders. Table 3 Predictors Cardiovascular Disease Type-2 Diabetes Mellitus Dyslipidemia Hypertension Obesity OR (95 % CI) p-value OR (95 % CI) p-value OR (95 % CI) p-value OR (95 % CI) p-value OR (95 % CI) p-value Crude Model Chronic stress total score (points) 1.04 (1.01–1.06) 0.002 1.01 (1.00–1.03) 0.051 1.00 (0.99–1.02) 0.5 1.02 (1.01–1.03) 0.002 1.03 (1.01–1.04) <0.001 Adjusted Model Chronic stress total score (points) 1.05 (1.03, 1.07) <0.001 1.02 (1.00, 1.03) 0.036 1.01 (0.99, 1.02) 0.2 1.03 (1.01, 1.04) <0.001 1.02 (1.01, 1.03) 0.001 Age (years) 1.06 (1.04, 1.08) <0.001 1.03 (1.02, 1.05) <0.001 1.01 (1.00, 1.02) 0.092 1.07 (1.05, 1.08) <0.001 0.98 (0.97, 0.99) 0.001 Sex 0.001 0.002 0.030 <0.001 0.4 Male – – – – – Female 0.58 (0.42, 0.81) 0.70 (0.57, 0.88) 0.80 (0.66, 0.98) 0.65 (0.53, 0.79) 1.09 (0.91, 1.30) Ethnicity 0.8 <0.001 0.013 <0.001 <0.001 White – – – – – Hispanic 0.87 (0.54, 1.36) 3.12 (2.31, 4.22) 1.32 (1.02, 1.73) 1.45 (1.11, 1.88) 1.31 (1.03, 1.66) Black 0.88 (0.50, 1.48) 2.17 (1.51, 3.10) 0.83 (0.61, 1.11) 3.17 (2.25, 4.52) 2.24 (1.68, 2.99) Education (years) 1.04 (0.99, 1.09) 0.092 0.94 (0.91, 0.97) <0.001 0.99 (0.96, 1.02) 0.5 0.97 (0.95, 1.00) 0.041 0.98 (0.96, 1.01) 0.14 Tobacco 0.86 (0.37, 1.73) 0.7 1.37 (0.90, 2.05) 0.14 0.86 (0.58, 1.28) 0.5 1.10 (0.74, 1.66) 0.6 0.79 (0.55, 1.15) 0.2 Alcohol 0.67 (0.04, 3.45) 0.7 1.19 (0.37, 3.51) 0.8 0.55 (0.20, 1.66) 0.3 1.19 (0.39, 4.43) 0.8 1.93 (0.70, 5.81) 0.2 No physical activity 1.33 (0.73, 2.29) 0.3 1.43 (0.99, 2.05) 0.059 1.31 (0.91, 1.94) 0.2 0.92 (0.63, 1.33) 0.6 1.75 (1.26, 2.46) <0.001 BMI 1.02 (1.00, 1.05) 0.090 1.07 (1.05, 1.09) <0.001 1.01 (0.99, 1.02) 0.4 1.10 (1.08, 1.12) <0.001 BMI: CI: OR: 3.4 Assessing relations between chronic stress, IL-6, and cardiometabolic disorders IL-6 mediated significantly 12 % [4 %–47 %] ( p-value FDR p-value FDR p-value FDR p-value FDR Fig. 4 Fig. 4 Mediation analysis of the effect of Interleukin-6 in the association between chronic emotional stress and different cardiometabolic disorders. 4.a. 4.b. Fig. 4 The sensitivity analysis using the continuous scores of chronic emotional stress as exposure showed comparable results ( Fig. 4 4 Discussion The study showed that high levels of chronic emotional stress had a strong predictive value for disclosing concomitant cardiometabolic disorders, mainly CVD, T 2 4.1 Chronic emotional stress and cardiovascular risk 4.1.1 Chronic emotional stress Chronic emotional stress can be triggered by several socioeconomic, behavioral, and physiological factors [ 37 38 38 39 37 The COVID-19 pandemic is the most recent example of a global health crisis impacting different health determinants [ 40 41 42 [43] [44] [45] [46] [47] 48 While the current study did not find a significant association between stress and dyslipidemia, a previous study showed that sleep and nighttime behavior disorders, another dimension of mental health burdens, are associated with higher triglycerides, but not cholesterol levels in middle-aged and older adults [ 49 4.1.2 Obesity Childhood adversities, traumatic life events, and life stress in early adulthood are significantly associated with higher BMI [ [50] [51] [52] 53 54 55 56 57 4.1.3 Type-2 diabetes mellitus The association between the onset and progression of T 2 58 58 2 59 2 60 2 2 61 4.1.4 Arterial hypertension Increased sympathetic activity is a well-described mechanism through which emotional stress causes hypertension and heart rate variability [ 62 63 64 65 66 In the current analysis, depression and anxiety were not adjusted for in the model in order to estimate the overall effect of chronic emotional stress. Depression and anxiety are “intermediates” (or mediators) and not confounders in the path between emotional stress and cardiometabolic disorders. Adjusting for at least one of them reduces the results to a partial effect and underestimates global effects and eventual interactions. 4.1.5 Cardiovascular diseases A study on a multiethnic population showed that work-related stress was a significant predictor of unfavorable cardiovascular health [ 67 68 68 69 70 The association between stress, depression, anxiety, and cardiovascular disorders is also mediated by health behavior and nutrition [ 71 72 73 4.2 Depression and anxiety Depression is significantly associated with cardiometabolic risks in different populations [ [74] [75] [76] 77 [78] [79] [80] 81 82 83 4.3 Role of ethnicity Belonging to a minoritarian ethnic group in any society is recognized to be an additional risk factor for health adversities, either owing to structural discrimination in health care coverage, higher exposure to risk factors, or a different physiological and genetic predisposition [ 28 30 31 84 85 4.4 Mediating role of low-grade inflammation A very limited number of studies explored the association between chronic stress, systemic pro-inflammatory cytokines, and cardiometabolic disorders [ 56 57 85 86 87 88 89 [90] [91] [92] 93 2 25 4.5 Perspectives and clinical implications The study highlights the association between chronic emotional stress and the odds of concomitant cardiometabolic disorders in a large multiethnic community-dwelling US adults. This aspect tends to be neglected in clinical studies, which rather focus on commonly assessed psychiatric diagnoses such as depression and anxiety. The study shows that being exposed to societal, domestic, or financial/occupational stress is associated with higher odds of health adversities in older populations, particularly ethnic minorities. Higher stress levels are linearly associated with higher BMI, blood pressure, heart rate, blood glucose dysregulation, and inflammation. These findings need to motivate further longitudinal studies, where both mental health support and interventions targeting cardiometabolic health are combined. Digital health tools might play an important role in mitigating the risks [ 94 95 4.6 Strengths The study included a high number of participants with complete data on relevant variables. Moreover, the diverse ethnic background of participants presents a major strength. By assessing the role of chronic stress, the study aims to highlight the importance of the psychosocial support of older populations, particularly members of socially marginalized groups. While this study focused on the role of chronic stress in predicting concomitant cardiometabolic diseases, which might be neglected and not investigated in medical examinations, it highlighted the statistical mediating effect of systemic inflammation in this association. The use of a non-parametric bootstrapping of 95 % CI following the percentile method is a further methodological strength of the current analyses. 4.7 Limitations The cross-sectional design is a major limitation of this study and does not allow for assessing causal effects. Chronic emotional stress was retrospectively reported by patients, which exposes the data to recall bias, and the exact duration of the stressful situation cannot be evaluated. Furthermore, the results have to be treated with caution since the studied cardiometabolic disorders and IL-6 levels were only reported at baseline, and no priorly documented information on their past evolution is available. Most cardiometabolic disorders were diagnosed based on self-disclosure, and no medical records were reviewed in this community-based cohort. While causal relationship assumptions cannot be fulfilled with certainty in the current study, owing to the imprecise chronological classification of events, the use of mediation analysis enables a better statistical understanding of the variations and interactions between variables. The study aimed to provide a preliminary theoretical framework for larger longitudinal clinical studies. In order to interpret this relationship in causal frameworks, further studies need to explore the effect of chronic emotional distress on healthy adults and quantify the prospective incident health adversities in later ages, while accounting for the role of low-grade inflammation as a potential mediator. 5 Conclusions Depression and anxiety are far beyond being the unique adversities to which older persons belonging to ethnic minorities are exposed, and chronic emotional stress has to be explored in risk groups. The association of these psychological burdens with cardiometabolic disorders needs to be prioritized in a multidisciplinary and culturally sensitive medical approach. This implies that mental health management needs to be integrated into the preventive and curative strategies of physical healthcare. Psychological burdens need to be acknowledged in people suffering from cardiometabolic disorders, and psychotherapeutic support needs to be part of long-term secondary and tertiary prevention programs. While the current cross-sectional study cannot assess causal relationships, it is important to mention that chronic emotional stress might play a relevant role in the onset and chronification of risks, and mediating inflammatory factors need to be explored and assessed in longitudinal causal frameworks to direct individualized therapeutic options. Ethical approval All procedures contributing to this work comply with the ethical standards of the relevant national and institutional committees on human experimentation and with the Helsinki Declaration Authorization for publication The principal investigator and data administrator of the HABS-HD study reviewed the manuscript for its compliance with DUA and authorized the submission and publication of the current version. Authorship AH has full access to all of the data and takes responsibility for the integrity of the data and the accuracy of the analysis, visualization, drafting, and editing of the manuscript. Credit author statement Asma Hallab: Conceptualization, Data curation, Formal analysis, Investigation, Methodology, Project administration, Supervision, Validation, Visualization, Writing – original draft, Writing – review & editing. Members of the HABS-HD are listed as a group author to acknowledge the collection and provision of the data used in this study, as well as the funding acquisition. Data availability Data, including the analytical code, can be acquired by qualified researchers after an official request ( asma.hallab@charite.de Data statement The data have not been previously presented orally or by poster at scientific meetings. Funding “Research reported on this publication was supported by the 10.13039/100000002 National Institutes of Health 10.13039/100000049 National Institute on Aging R01AG054073 R01AG058533 R01AG070862 P41EB015922 U19AG078109 10.13039/100000002 National Institutes of Health Declaration of competing interest The authors have no conflict of interest, neither financial nor non-financial. References 1 Selye H. The Stress of Life 1956 McGraw-Hill New York, NY, US 324 xvi xvi 2 Cannon W.B. Bodily Changes in Pain, Hunger, Fear and Rage: an Account of Recent Researches into the Function of Emotional Excitement 1915 D Appleton & Company New York, NY, US 311 xiii xiii 3 Prather A.A. Epel E.S. Arenander J. Broestl L. Garay B.I. Wang D. Longevity factor klotho and chronic psychological stress Transl. Psychiatry 5 6 2015 e585 10.1038/tp.2015.81 PMC4490291 26080320 4 Piao L. Zhao G. Zhu E. Inoue A. Shibata R. Lei Y. Chronic psychological stress accelerates vascular senescence and impairs ischemia-induced neovascularization: the role of dipeptidyl Peptidase-4/Glucagon-Like Peptide-1-Adiponectin axis J. Am. Heart Assoc. 6 10 2017 10.1161/JAHA.117.006421 PMC5721852 28963101 5 Qi G. Zhang P. Li T. Li M. Zhang Q. He F. NAc-VTA circuit underlies emotional stress-induced anxiety-like behavior in the three-chamber vicarious social defeat stress mouse model Nat. Commun. 13 1 2022 577 35102141 10.1038/s41467-022-28190-2 PMC8804001 6 Hu H. Yang X. He Y. Duan C. Sun N. Psychological stress induces depressive-like behavior associated with bone marrow-derived monocyte infiltration into the hippocampus independent of blood-brain barrier disruption J. Neuroinflammation 19 1 2022 208 36002834 10.1186/s12974-022-02569-w PMC9400267 7 Santomauro D.F. Vos T. Whiteford H.A. Chisholm D. Saxena S. Ferrari A.J. Service coverage for major depressive disorder: estimated rates of minimally adequate treatment for 204 countries and territories in 2021 Lancet Psychiatry 11 12 2024 1012 1021 39572105 10.1016/S2215-0366(24)00317-1 PMC11579305 8 Craske M.G. Stein M.B. Anxiety Lancet 388 10063 2016 3048 3059 27349358 10.1016/S0140-6736(16)30381-6 9 Penninx B.W.J.H. Pine D.S. Holmes E.A. Reif A. Anxiety disorders Lancet 397 10277 2021 914 927 33581801 10.1016/S0140-6736(21)00359-7 PMC9248771 10 Santomauro D.F. Mantilla Herrera A.M. Shadid J. Zheng P. Ashbaugh C. Pigott D.M. Global prevalence and burden of depressive and anxiety disorders in 204 countries and territories in 2020 due to the COVID-19 pandemic Lancet 398 10312 2021 1700 1712 34634250 10.1016/S0140-6736(21)02143-7 PMC8500697 11 Macpherson J.M. Gray S.R. Ip P. McCallum M. Hanlon P. Welsh P. Child maltreatment and incident mental disorders in middle and older ages: a retrospective UK biobank cohort study Lancet Reg. Health Eur. 11 2021 100224 10.1016/j.lanepe.2021.100224 PMC8642708 34917999 12 Madsen I.E.H. Nyberg S.T. Magnusson Hanson L.L. Ferrie J.E. Ahola K. Alfredsson L. Job strain as a risk factor for clinical depression: systematic review and meta-analysis with additional individual participant data Psychol. Med. 47 8 2017 1342 1356 28122650 10.1017/S003329171600355X PMC5471831 13 Mitchell A. Maheen H. Bowen K. Mental health impacts from repeated climate disasters: an Australian longitudinal analysis Lancet Reg. Health West. Pac. 47 2024 10.1016/j.lanwpc.2024.101087 PMC11145535 38831889 14 Mattei J. Tamez M. O'Neill J. Haneuse S. Mendoza S. Orozco J. Chronic diseases and associated risk factors among adults in Puerto Rico after hurricane maria JAMA Netw. Open 5 1 2022 e2139986 10.1001/jamanetworkopen.2021.39986 PMC8756309 35019984 15 Global incidence, prevalence, years lived with disability (YLDs), disability-adjusted life-years (DALYs), and healthy life expectancy (HALE) for 371 diseases and injuries in 204 countries and territories and 811 subnational locations, 1990-2021: a systematic analysis for the global burden of disease study 2021 Lancet 403 10440 2024 2133 2161 38642570 10.1016/S0140-6736(24)00757-8 PMC11122111 16 Walli-Attaei M. Rosengren A. Rangarajan S. Breet Y. Abdul-Razak S. Sharief W.A. Metabolic, behavioural, and psychosocial risk factors and cardiovascular disease in women compared with men in 21 high-income, middle-income, and low-income countries: an analysis of the PURE study Lancet 400 10355 2022 811 821 36088949 10.1016/S0140-6736(22)01441-6 17 Arias-de la Torre J. Ronaldson A. Prina M. Matcham F. Pinto Pereira S.M. Hatch S.L. Depressive symptoms during early adulthood and the development of physical multimorbidity in the UK: an observational cohort study Lancet Health Longev. 2 12 2021 e801 e810 10.1016/S2666-7568(21)00259-2 PMC8636278 34901908 18 Kang H.-J. Kim J.-W. Kim S.-W. Kim J.-T. Park M.-S. Kim M.-C. Association of life stressors and suicidal ideation with long-term outcomes in patients with acute coronary syndrome and stroke Gen. Hosp. Psychiatry 93 2025 32 39 39818126 10.1016/j.genhosppsych.2025.01.004 19 van Gennip A.C.E. Schram M.T. Köhler S. Kroon A.A. Koster A. Eussen S.J.P.M. Association of type 2 diabetes according to the number of risk factors within the recommended range with incidence of major depression and clinically relevant depressive symptoms: a prospective analysis Lancet Health Logn. 4 2 2023 e63 e71 10.1016/S2666-7568(22)00291-4 36738746 20 van Sloten T.T. Sedaghat S. Carnethon M.R. Launer L.J. Stehouwer C.D.A. Cerebral microvascular complications of type 2 diabetes: stroke, cognitive dysfunction, and depression Lancet Diabetes Endocrinol. 8 4 2020 325 336 32135131 10.1016/S2213-8587(19)30405-X PMC11044807 21 Meyer J.H. Cervenka S. Kim M.J. Kreisl W.C. Henter I.D. Innis R.B. Neuroinflammation in psychiatric disorders: PET imaging and promising new targets Lancet Psychiatry 7 12 2020 1064 1074 33098761 10.1016/S2215-0366(20)30255-8 PMC7893630 22 Setiawan E. Attwells S. Wilson A.A. Mizrahi R. Rusjan P.M. Miler L. Association of translocator protein total distribution volume with duration of untreated major depressive disorder: a cross-sectional study Lancet Psychiatry 5 4 2018 339 347 29496589 10.1016/S2215-0366(18)30048-8 23 Ridker P.M. Bhatt D.L. Pradhan A.D. Glynn R.J. MacFadyen J.G. Nissen S.E. Inflammation and cholesterol as predictors of cardiovascular events among patients receiving statin therapy: a collaborative analysis of three randomised trials Lancet 401 10384 2023 1293 1301 36893777 10.1016/S0140-6736(23)00215-5 24 Avogaro A. de Kreutzenberg S.V. Morieri M.L. Fadini G.P. Del Prato S. Glucose-lowering drugs with cardiovascular benefits as modifiers of critical elements of the human life history Lancet Diabetes Endocrinol. 10 12 2022 882 889 36182702 10.1016/S2213-8587(22)00247-9 25 Hallab A. Mediating role of Interleukin-6 in the predictive association of diabetes with hippocampus atrophy, Amyloid, Tau, and Neurofilament pathology at pre-clinical stages of diabetes-related cognitive impairment Brain Behav. Immun. Health 47 2025 101031 10.1016/j.bbih.2025.101031 PMC12216742 40606939 26 Wang Y. Liu M. Yang F. Chen H. Wang Y. Liu J. The associations of socioeconomic status, social activities, and loneliness with depressive symptoms in adults aged 50 years and older across 24 countries: findings from five prospective cohort studies Lancet Health Longev. 5 9 2024 100618 10.1016/j.lanhl.2024.07.001 39208829 27 Thapa S. Ahmed K.Y. Giri S. Anyasodor A.E. Huda M.M. Gibbs P. Population attributable fractions of depression and anxiety among Aboriginal and torres strait islander peoples: a population-based study Lancet Reg. Health West. Pac. 52 2024 101203 10.1016/j.lanwpc.2024.101203 PMC11458540 39381087 28 Agbonlahor O. DeJarnett N. Hart J.L. Bhatnagar A. McLeish A.C. Walker K.L. Racial/ethnic discrimination and cardiometabolic diseases: a systematic review J. Racial Ethn. Health Dispar. 11 2 2024 783 807 10.1007/s40615-023-01561-1 PMC10044132 36976513 29 Ramasawmy M. Khan N. Sunkersing D. Banerjee A. Understanding ethnic inequalities in the design and implementation of digital health interventions for cardiometabolic disease: a qualitative study Lancet 402 2023 S78 10.1016/S0140-6736(23)02130-X 37997123 30 Bailey Z.D. Krieger N. Agénor M. Graves J. Linos N. Bassett M.T. Structural racism and health inequities in the USA: evidence and interventions Lancet 389 10077 2017 1453 1463 28402827 10.1016/S0140-6736(17)30569-X 31 Reeves A. Elliott M.R. Lewis T.T. Karvonen-Gutierrez C.A. Herman W.H. Harlow S.D. Study selection bias and racial or ethnic disparities in estimated age at onset of cardiometabolic disease among midlife women in the US JAMA Netw. Open 5 11 2022 2240665-e 10.1001/jamanetworkopen.2022.40665 PMC9641536 36342714 32 von Elm E. Altman D.G. Egger M. Pocock S.J. Gøtzsche P.C. Vandenbroucke J.P. The strengthening the reporting of observational studies in epidemiology (STROBE) statement: guidelines for reporting observational studies Lancet 370 9596 2007 1453 1457 18064739 10.1016/S0140-6736(07)61602-X 33 Petersen M.E. Zhou Z. Hall J.R. Phillips N. Meeker K.L. Borzage M.T. Health and aging brain study-health disparities (HABS-HD) methods and partner characteristics Alzheimer's Dement. 11 3 2025 e70140 10.1002/trc2.70140 PMC12340423 40799724 34 O'Bryant S.E. Johnson L.A. Barber R.C. Braskie M.N. Christian B. Hall J.R. The health & aging brain among Latino elders (HABLE) study methods and participant characteristics Alzheimer's Dement. 13 1 2021 e12202 10.1002/dad2.12202 PMC8215806 34189247 35 Kraft P. Kraft B. Explaining socioeconomic disparities in health behaviours: a review of biopsychological pathways involving stress and inflammation Neurosci. Biobehav. Rev. 127 2021 689 708 34048858 10.1016/j.neubiorev.2021.05.019 36 Stringhini S. Carmeli C. Jokela M. Avendaño M. Muennig P. Guida F. Socioeconomic status and the 25 × 25 risk factors as determinants of premature mortality: a multicohort study and meta-analysis of 1·7 million men and women Lancet 389 10075 2017 1229 1237 28159391 10.1016/S0140-6736(16)32380-7 PMC5368415 37 Manigault A.W. Kuhlman K.R. Irwin M.R. Cole S.W. Ganz P.A. Crespi C.M. Vulnerability to inflammation-related depressive symptoms: moderation by stress in women with breast cancer Brain Behav. Immun. 94 2021 71 78 33705868 10.1016/j.bbi.2021.03.004 PMC8058308 38 da Silva J.C. Garcez A. Cibeira G.H. Theodoro H. Olinto M.T.A. Relationship of work-related stress with obesity among Brazilian female shift workers Public Health Nutr. 24 2 2021 260 266 33100264 10.1017/S1368980020004243 PMC10195539 39 Ervasti J. Pentti J. Nyberg S.T. Shipley M.J. Leineweber C. Sørensen J.K. Long working hours and risk of 50 health conditions and mortality outcomes: a multicohort study in four European countries Lancet Reg. Health Eur. 11 2021 100212 10.1016/j.lanepe.2021.100212 PMC8642716 34917998 40 Norful A.A. Rosenfeld A. Schroeder K. Travers J.L. Aliyu S. Primary drivers and psychological manifestations of stress in frontline healthcare workforce during the initial COVID-19 outbreak in the United States Gen. Hosp. Psychiatry 69 2021 20 26 33485091 10.1016/j.genhosppsych.2021.01.001 PMC7836752 41 Vasey M.J. Tai X.Y. Thorpe J. Jones G.D. Ashby S. Hallab A. The impact of COVID-19 on people with epilepsy: global results from the coronavirus and epilepsy study Epilepsia Open 9 5 2024 1931 1947 39225433 10.1002/epi4.13035 PMC11450608 42 Thorpe J. Ashby S. Hallab A. Ding D. Andraus M. Dugan P. Evaluating risk to people with epilepsy during the COVID-19 pandemic: preliminary findings from the COV-E study Epilepsy Behav. 115 2021 107658 10.1016/j.yebeh.2020.107658 PMC7698680 33341393 43 Wang S.D. Devjani S. Chillakanti M. Dunton G.F. Mason T.B. The COMET study: examining the effects of COVID-19-related perceived stress on Los Angeles mothers' dysregulated eating behaviors, child feeding practices, and body mass index Appetite 163 2021 105209 10.1016/j.appet.2021.105209 PMC9757544 33737212 44 Philippe K. Chabanet C. Issanchou S. Monnery-Patris S. Child eating behaviors, parental feeding practices and food shopping motivations during the COVID-19 lockdown in France: (how) did they change? Appetite 161 2021 105132 10.1016/j.appet.2021.105132 PMC7825985 33493611 45 Keenan G.S. Christiansen P. Owen L.J. Hardman C.A. The association between COVID-19 related food insecurity and weight promoting eating behaviours: the mediating role of distress and eating to cope Appetite 169 2022 105835 10.1016/j.appet.2021.105835 34871589 46 Cecchetto C. Aiello M. Gentili C. Ionta S. Osimo S.A. Increased emotional eating during COVID-19 associated with lockdown, psychological and social distress Appetite 160 2021 105122 10.1016/j.appet.2021.105122 PMC9755826 33453336 47 Sutin A.R. Stephan Y. Luchetti M. Aschwanden D. Strickhouser J.E. Lee J.H. BMI, weight discrimination, and the trajectory of distress and well-being across the coronavirus pandemic Obesity 29 1 2021 38 45 32975032 10.1002/oby.23048 48 Hallab A. Sen A. Epilepsy and psychogenic non-epileptic seizures in forcibly displaced people: a scoping review Seizure 92 2021 128 148 34509907 10.1016/j.seizure.2021.08.004 49 Hallab A. Sleep and nighttime behavior disorders in older adults: associations with hypercholesterolemia and hypertriglyceridemia at baseline, and a predictive analysis of incident cases at 12 months follow-up Lipids Health Dis. 23 1 2024 320 39342373 10.1186/s12944-024-02302-x PMC11439313 50 Gebreab S.Z. Vandeleur C.L. Rudaz D. Strippoli M.F. Gholam-Rezaee M. Castelao E. Psychosocial stress over the lifespan, psychological factors, and cardiometabolic risk in the community Psychosom. Med. 80 7 2018 628 639 29965943 10.1097/PSY.0000000000000621 51 Mehlig K. Nehmtallah T. Rosvall M. Hunsberger M. Rosengren A. Lissner L. Negative life events predict weight gain in a 13-year follow-up of an adult Swedish population J. Psychosom. Res. 132 2020 109973 10.1016/j.jpsychores.2020.109973 32146250 52 Tang L. Yin R. Xi X. Hu Q. Zhang F. Liu Q. Co-Development and bidirectional associations between psychological stress and obesity in school-aged children: a longitudinal study in China Psychosom. Med. 85 6 2023 517 526 37199419 10.1097/PSY.0000000000001212 53 Cedillo Y.E. Kelly T. Davis E. Durham L. Smith D.L. Jr. Kennedy R.E. Evaluation of food security status, psychological well-being, and stress on BMI and diet-related behaviors among a sample of college students Public Health 224 2023 32 40 37708714 10.1016/j.puhe.2023.08.015 54 Kidwell K.M. Reiter-Purtill J. Decker K. Howarth T. Doland F. Zeller M.H. Stress and eating responses in adolescent females predisposed to obesity: a pilot and feasibility study Appetite 179 2022 106308 10.1016/j.appet.2022.106308 36100044 55 Risica P.M. Nelson T. Kumanyika S.K. Camacho Orona K. Bove G. Odoms-Young A.M. Emotional eating predicts weight regain among black women in the SisterTalk intervention Obesity 29 1 2021 79 85 34494370 10.1002/oby.23045 PMC8672458 56 Sominsky L. O'Hely M. Drummond K. Cao S. Collier F. Dhar P. Pre-pregnancy obesity is associated with greater systemic inflammation and increased risk of antenatal depression Brain Behav. Immun. 113 2023 189 202 37437818 10.1016/j.bbi.2023.07.005 57 Finy M.S. Christian L.M. Pathways linking childhood abuse history and current socioeconomic status to inflammation during pregnancy Brain Behav. Immun. 74 2018 231 240 30217532 10.1016/j.bbi.2018.09.012 PMC6289854 58 Hackett R.A. Steptoe A. Type 2 diabetes mellitus and psychological stress - a modifiable risk factor Nat. Rev. Endocrinol. 13 9 2017 547 560 28664919 10.1038/nrendo.2017.64 59 Crump C. Sundquist J. Winkleby M.A. Sundquist K. Stress resilience and subsequent risk of type 2 diabetes in 1.5 million young men Diabetologia 59 4 2016 728 733 26758065 10.1007/s00125-015-3846-7 PMC4779396 60 Shin Y. Kim Y. Psychological stress accompanied by a low-variety diet is positively associated with type 2 diabetes in middle-aged adults Nutrients 12 9 2020 10.3390/nu12092612 PMC7551696 32867193 61 Wagner J.A. Bermudez-Millan A. Damio G. Segura-Perez S. Chhabra J. Vergara C. A randomized, controlled trial of a stress management intervention for latinos with type 2 diabetes delivered by community health workers: outcomes for psychological wellbeing, glycemic control, and cortisol Diabetes Res. Clin. Pract. 120 2016 162 170 27568646 10.1016/j.diabres.2016.07.022 PMC5037043 62 Fontes M.A.P. Marins F.R. Patel T.A. de Paula C.A. Dos Santos Machado L.R. de Sousa Lima É.B. Neurogenic background for emotional stress-associated hypertension Curr. Hypertens. Rep. 25 7 2023 107 116 37058193 10.1007/s11906-023-01235-7 PMC10103037 63 Orexin Carrive P. Stress and central cardiovascular control. A link with hypertension? Neurosci. Biobehav. Rev. 74 Pt B 2017 376 392 27477446 10.1016/j.neubiorev.2016.06.044 64 Palagini L. Bruno R.M. Cheng P. Mauri M. Taddei S. Ghiadoni L. Relationship between insomnia symptoms, perceived stress and coping strategies in subjects with arterial hypertension: psychological factors May play a modulating role Sleep Med. 19 2016 108 115 27198955 10.1016/j.sleep.2015.09.026 65 Spruill T.M. Butler M.J. Thomas S.J. Tajeu G.S. Kalinowski J. Castañeda S.F. Association between high perceived stress over time and incident hypertension in black adults: findings from the Jackson heart study J. Am. Heart Assoc. 8 21 2019 e012139 10.1161/JAHA.119.012139 PMC6898810 31615321 66 Langford A.T. Butler M. Booth J.N. Jin P. Bress A.P. Tanner R.M. Stress and depression are associated with life's simple 7 among African Americans with hypertension: findings from the Jackson heart study Am. J. Hypertens. 34 12 2021 1311 1321 34272853 10.1093/ajh/hpab116 PMC8643585 67 Ogunmoroti O. Osibogun O. Allen N.B. Okunrintemi V. Commodore-Mensah Y. Shah A.J. Work-related stress is associated with unfavorable cardiovascular health: the multi-ethnic study of atherosclerosis J. Am. Heart Assoc. 13 22 2024 e035824 10.1161/JAHA.124.035824 PMC11681396 39503282 68 Rodgers J. Cuevas A.G. Williams D.R. Kawachi I. Subramanian S.V. The relative contributions of behavioral, biological, and psychological risk factors in the association between psychosocial stress and all-cause mortality among middle- and older-aged adults in the USA Geroscience 43 2 2021 655 672 33511488 10.1007/s11357-020-00319-5 PMC8110664 69 Stewart R.A.H. Colquhoun D.M. Marschner S.L. Kirby A.C. Simes J. Nestel P.J. Persistent psychological distress and mortality in patients with stable coronary artery disease Heart 103 23 2017 1860 1866 28652315 10.1136/heartjnl-2016-311097 70 Spencer C. Reed R.G. Votruba-Drzal E. Gianaros P.J. Psychological stress and the longitudinal progression of subclinical atherosclerosis Health Psychol. 43 1 2024 58 66 37917469 10.1037/hea0001333 PMC10842302 71 Eisenberg K.N. Leiter E. May R.T. Reinfeld T. Zwas D.R. Psychosocial functioning, BMI, and nutritional behaviors in women at cardiovascular risk Front. Psychol. 11 2020 2135 32982873 10.3389/fpsyg.2020.02135 PMC7485341 72 Al Rifai M. Greenland P. Blaha M.J. Michos E.D. Nasir K. Miedema M.D. Factors of health in the protection against death and cardiovascular disease among adults with subclinical atherosclerosis Am. Heart J. 198 2018 180 188 29653643 10.1016/j.ahj.2017.10.026 PMC5901883 73 Li Y.N. Buys N. Ferguson S. Li Z.J. Sun J. Effectiveness of cognitive behavioral therapy-based interventions on health outcomes in patients with coronary heart disease: a meta-analysis World J. Psychiatr. 11 11 2021 1147 1166 34888180 10.5498/wjp.v11.i11.1147 PMC8613762 74 Cheng X. Ouyang F. Ma T. He L. Gong L. Yin J. The individual and joint associations of depression and sleep duration with cardiometabolic diseases and mortality: a prospective cohort study Atherosclerosis 361 2022 10 17 36252458 10.1016/j.atherosclerosis.2022.09.016 75 Geraets A.F.J. Schram M.T. Jansen J.F.A. Backes W.H. Schalkwijk C.G. Stehouwer C.D.A. The cardiometabolic depression subtype and its association with clinical characteristics: the Maastricht study J. Affect. Disord. 313 2022 110 117 35779670 10.1016/j.jad.2022.06.045 76 Qiao Y. Ding Y. Li G. Lu Y. Li S. Ke C. Role of depression in the development of cardiometabolic multimorbidity: findings from the UK biobank study J. Affect. Disord. 319 2022 260 266 36162655 10.1016/j.jad.2022.09.084 77 Honigberg M.C. Ye Y. Dattilo L. Sarma A.A. Scott N.S. Smoller J.W. Low depression frequency is associated with decreased risk of cardiometabolic disease Nat. Cardiovasc. Res. 1 2 2022 125 131 35991864 10.1038/s44161-021-00011-7 PMC9389944 78 Zhou X. Tao X.L. Zhang L. Yang Q.K. Li Z.J. Dai L. Association between cardiometabolic index and depression: National health and nutrition examination survey (NHANES) 2011-2014 J. Affect. Disord. 351 2024 939 947 38341157 10.1016/j.jad.2024.02.024 79 Cheng L. Wu Q. Wang S. Cardiometabolic index is associated with increased depression: a population-based study J. Affect. Disord. 348 2024 259 264 38171182 10.1016/j.jad.2023.12.073 80 Liu F. Meng Y. Wang R. Shen S. Li P. He F. Combined influence of depression symptoms and ratio of triglyceride to high-density lipoprotein cholesterol on cardiometabolic multimorbidity: findings from the China health and retirement longitudinal study 2011-2018 J. Affect. Disord. 360 2024 242 248 38821370 10.1016/j.jad.2024.05.159 81 Souama C. Lamers F. Milaneschi Y. Vinkers C.H. Defina S. Garvert L. Depression, cardiometabolic disease, and their co-occurrence after childhood maltreatment: an individual participant data meta-analysis including over 200,000 participants BMC Med. 21 1 2023 93 36907864 10.1186/s12916-023-02769-y PMC10010035 82 Vourdoumpa A. Paltoglou G. Manou M. Mantzou E. Kassari P. Papadopoulou M. Improvement in symptoms of depression and anxiety and cardiometabolic risk factors in children and adolescents with overweight and obesity following the implementation of a multidisciplinary personalized lifestyle intervention program Nutrients 16 21 2024 10.3390/nu16213710 PMC11547602 39519542 83 Repke H.E. Gulley L.D. Rice A.J. Gallagher-Teske J.H. Markos B. Sanchez N. Addressing anxiety and stress for healthier eating in teens (ASSET): a pilot randomized controlled trial protocol for reducing anxiety, disinhibited eating, excess weight gain, and cardiometabolic risk in adolescent girls Nutrients 14 20 2022 10.3390/nu14204246 PMC9607054 36296930 84 Dark T. Rust G. Sehres G. Harman J.S. Racial disparities in healthcare utilization among individuals with cardiometabolic risk factors and comorbid anxiety disorder J. Racial Ethn. Health Dispar. 7 6 2020 1234 1240 10.1007/s40615-020-00748-0 32277365 85 Saban K.L. Mathews H.L. Bryant F.B. Tell D. Joyce C. DeVon H.A. Perceived discrimination is associated with the inflammatory response to acute laboratory stress in women at risk for cardiovascular disease Brain Behav. Immun. 73 2018 625 632 30012518 10.1016/j.bbi.2018.07.010 PMC6129426 86 Albizzati E. Breccia M. Florio E. Cabasino C. Postogna F.M. Grassi R. Mecp2 knock-out astrocytes affect synaptogenesis by interleukin 6 dependent mechanisms iScience 27 3 2024 109296 10.1016/j.isci.2024.109296 PMC10926209 38469559 87 Galea I. The blood–brain barrier in systemic infection and inflammation Cell. Mol. Immunol. 18 11 2021 2489 2501 34594000 10.1038/s41423-021-00757-x PMC8481764 88 Kang S. Kishimoto T. Interplay between interleukin-6 signaling and the vascular endothelium in cytokine storms Exp. Mol. Med. 53 7 2021 1116 1123 34253862 10.1038/s12276-021-00649-0 PMC8273570 89 Del Giudice M. Gangestad S.W. Rethinking IL-6 and CRP: why they are more than inflammatory biomarkers, and why it matters Brain Behav. Immun. 70 2018 61 75 29499302 10.1016/j.bbi.2018.02.013 90 Lyra e Silva NM. Gonçalves R.A. Pascoal T.A. Lima-Filho R.A.S. Resende EdPF. Vieira E.L.M. Pro-inflammatory interleukin-6 signaling links cognitive impairments and peripheral metabolic alterations in Alzheimer's disease Transl. Psychiatry 11 1 2021 251 33911072 10.1038/s41398-021-01349-z PMC8080782 91 Donnelly N.A. Tsang R.S.M. Foley É.M. Fraser H. Hanson A.L. Khandaker G.M. Blood immuno-metabolic biomarker signatures of depression and affective symptoms in young adults Brain Behav. Immun. 128 2025 673 684 40374127 10.1016/j.bbi.2025.05.011 92 Ng A. Tam W.W. Zhang M.W. Ho C.S. Husain S.F. McIntyre R.S. IL-1β, IL-6, TNF- α and CRP in elderly patients with depression or alzheimer's disease: systematic review and meta-analysis Sci. Rep. 8 1 2018 12050 10.1038/s41598-018-30487-6 PMC6089986 30104698 93 Ridker P.M. From C-Reactive protein to Interleukin-6 to Interleukin-1 Circ. Res. 118 1 2016 145 156 26837745 10.1161/CIRCRESAHA.115.306656 PMC4793711 94 Şaylık F. Çınar T. Hayıroğlu M. Tekkeşin A. Digital health interventions in patient management following acute coronary syndrome: a meta-analysis of the literature Anatol. J. Cardiol. 27 1 2023 2 9 36680440 10.14744/AnatolJCardiol.2022.2254 PMC9893709 95 Hayıroğlu M. Çınar T. Cilli Hayıroğlu S. Şaylık F. Uzun M. Tekkeşin A. The role of smart devices and Mobile application on the change in peak VO(2) in patients with high cardiovascular risk: a sub-study of the LIGHT randomised clinical trial Acta Cardiol. 78 9 2023 1000 1005 37318090 10.1080/00015385.2023.2223005 Appendix A Supplementary data The following is the Supplementary data to this article: Multimedia component 1 Multimedia component 1 Appendix A Supplementary data to this article can be found online at https://doi.org/10.1016/j.ijcrp.2025.200510 ",
  "metadata": {
    "Title of this paper": "The role of smart devices and Mobile application on the change in peak VO(2) in patients with high cardiovascular risk: a sub-study of the LIGHT randomised clinical trial",
    "Journal it was published in:": "International Journal of Cardiology. Cardiovascular Risk and Prevention",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12475582/"
  }
}