{
  "title": "Paper_353",
  "abstract": "pmc Br J Surg Br J Surg 4464 brjsurg bjs The British Journal of Surgery 0007-1323 1365-2168 Oxford University Press PMC12485225 PMC12485225.1 12485225 12485225 40794622 10.1093/bjs/znaf151 znaf151 1 Randomized Clinical Trial AcademicSubjects/MED00910 Bjs/1 Bjs/8 Effectiveness of a patient decision aid for women considering post-mastectomy breast reconstruction: randomized controlled trial https://orcid.org/0000-0002-7533-4932 Jansen Britt A M  Department of Oncological Surgery, St. Antonius Hospital Utrecht The Netherlands  Department of Plastic, Reconstructive and Hand Surgery, St. Antonius Hospital Utrecht The Netherlands https://orcid.org/0009-0006-2914-5213 Henskens Isabelle J  Department of Oncological Surgery, St. Antonius Hospital Utrecht The Netherlands  Department of Plastic, Reconstructive and Hand Surgery, St. Antonius Hospital Utrecht The Netherlands Bargon Claudia A  Department of Oncological Surgery, St. Antonius Hospital Utrecht The Netherlands  Department of Plastic, Reconstructive and Hand Surgery, St. Antonius Hospital Utrecht The Netherlands Teunis Teun  Department of Plastic Surgery, University of Pittsburgh Medical Center Pittsburgh, Pennsylvania USA Braakenburg Assa  Department of Plastic, Reconstructive and Hand Surgery, St. Antonius Hospital Utrecht The Netherlands https://orcid.org/0000-0001-9628-5896 Young-Afat Danny A  Department of Plastic, Reconstructive and Hand Surgery, Amsterdam University Medical Center Amsterdam The Netherlands Verkooijen Helena M  Division of Imaging and Oncology, University Medical Centre Utrecht, Cancer Centre Utrecht The Netherlands  Utrecht University Utrecht The Netherlands Doeksen Annemiek  Department of Oncological Surgery, St. Antonius Hospital Utrecht The Netherlands Correspondence to: br.jansen@antoniusziekenhuis.nl 8 2025 05 8 2025 112 8 494229 znaf151 27 2 2025 04 5 2025 02 7 2025 05 08 2025 02 10 2025 02 10 2025 © The Author(s) 2025. Published by Oxford University Press on behalf of BJS Foundation Ltd. 2025 https://creativecommons.org/licenses/by/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution License ( https://creativecommons.org/licenses/by/4.0/ Abstract Background Post-mastectomy breast reconstruction (PMBR) improves quality of life, yet decisions regarding type and timing are complex, requiring careful consideration of risks, benefits, and personal preferences. Shared decision-making enhances satisfaction with reconstructive decisions, but some women experience difficulty participating effectively. This study evaluated the effectiveness of a PMBR-specific patient decision aid (pDA) compared with high-quality standard care. Methods In this single-centre RCT, women eligible for PMBR were assigned in a 1:1 ratio to either standard care alone (control) or standard care and a pDA (intervention). Questionnaires were completed at baseline, after reconstructive decision, and at 1-year post-surgery. The primary outcome was decisional conflict after the decision. Secondary outcomes included measures for the decision-making process, patient-reported, and surgical outcomes. Between-group differences were analysed using t d Results A total of 134 patients were enrolled (66 intervention, 68 control). Both groups reported consistently low decisional conflict (17 and 20 respectively). No significant differences were found in the primary (MD −2.8, 95% c.i., −8.4 to 2.8, Cohen’s d Conclusion In a population with access to high-quality multidisciplinary care, an online pDA for PMBR did not provide additional benefits over standard care. Both approaches effectively supported reconstructive decision-making, resulting in consistently low levels of decisional conflict. Trial registration number NL-OMON28003 (NTR), NL7939 (NTR-new) This RCT evaluated whether an online patient decision aid provided additional benefits over high-quality standard care in supporting post-mastectomy breast reconstruction decisions. Among 120 women, both the pDA and standard care groups reported consistently low decisional conflict, with no significant differences in outcomes regarding the decision-making process, patient-reported outcomes, or surgical outcomes. This study suggests that in settings with high-quality multidisciplinary care, a pDA does not offer added benefits, as both strategies effectively support shared decision-making. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Women undergoing mastectomy increasingly opt for post-mastectomy breast reconstruction (PMBR) to improve quality of life (QoL), body image, and psychosocial well-being 1–4 5 The decision-making process regarding type and timing of PMBR is complex, requiring careful consideration of surgical feasibility, logistical constraints, need and timing of (neo)adjuvant therapies, co-morbidities, body composition, and patient preferences 6 7 6–10 6 11 Patient decision aids (pDAs) support SDM by helping patients make informed choices that reflect their values, aiming to reduce decisional conflict while improving patient knowledge, satisfaction, and psychosocial well-being 11–14 An RCT was conducted to assess whether a pDA for PMBR reduces decisional conflict immediately after reconstructive decision compared to high-quality standard care. The secondary aim was to evaluate the impact of a pDA on the decision-making process, patient-reported outcomes (PROs), and surgical outcomes immediately after reconstructive decision and 1-year after surgery. Methods Design A single-centre, two-arm, parallel group RCT was conducted at a large community teaching hospital in the Netherlands, where six plastic surgeons performed immediate and delayed PMBR. Patients were invited to participate between October 2019 and June 2023 by their oncological surgeon or nurse. After providing informed consent, participants were randomly assigned to a 1:1 ratio to the intervention or control group. Block randomization, with six patients per block, was used, with a computer-generated sequence concealed until assignment. The allocation sequence was independently generated and managed by an investigator (J.K.), who was not involved in patient enrolment, assignment, or data analysis. The control group received standard care alone and the intervention group received standard care and access to the pDA. Blinding of patients, plastic surgeons, and researchers after assignment was not performed due to practical constraints. Questionnaires were administered to participants at T0—baseline, one week before their first consultation with the plastic surgeon, T1—immediately after reconstructive decision and T2—1-year post-surgery. The trial was registered in the International Clinical Trial Registry Platform (ICTRP; NL-OMON28003). The study adhered to the Declaration of Helsinki (version 2013) and the Medical Research Involving Human Subjects Act, followed CONSORT guidelines, and was approved by the Medical Research Ethics Committee (MEC-U reg. no. W19.176) 15 Participants Women who were 18 years or older, required unilateral or bilateral mastectomy due to invasive or in situ Intervention An online pDA for PMBR ( https://www.keuzehulp.info/front-page/keuzehulpen/borstreconstructie 16 17 18 The intervention group was granted access to this online pDA one week before their first consultation with a plastic surgeon and patients were instructed to complete it beforehand. Completion status was monitored and reminders were issued to participants whose pDA remained incomplete prior to their initial appointment. Standard care Both groups received high-quality multidisciplinary standard care. Prior to first consultation with the plastic surgeon, the oncological surgeon and/or nurse provided written information on the different types of PMBR, including pros, cons, potential complications as well as post-surgery guidelines and exercises through information leaflets. At the first consultation with the plastic surgeon, patients received a tailored verbal explanation, supplemented by photos and drawings of surgical PMBR options, and referral to a relevant website: BBewust (b-bewust.nl [in Dutch]) providing information and visual resources. When desired, additional consultations were scheduled with the plastic surgeon. Study measures Following enrolment, participants completed an online questionnaire to collect baseline characteristics and responses to validated scales, including the Dutch General Self-Efficacy Scale (GSES), Hospital Anxiety and Depression Scale (HADS), and the preoperative BREAST-Q module. Clinical data regarding (neo-)adjuvant non-surgical treatments were retrieved from electronic medical patient records. Outcomes domains included: (1) decision-making process, (2) PROs, and (3) surgical outcomes. The primary outcome was decisional conflict immediately after reconstructive decision (T1), assessed using the Decisional Conflict Scale (DCS) 19 20 21–23 PROs included symptoms of anxiety and depression, measured with the HADS; satisfaction with breast(s), psychological well-being, sexual well-being, and physical well-being of the chest, evaluated using the postoperative BREAST-Q module; body image and breast symptoms, measured using the EORTC-QLQ-BR23 questionnaire; and overall satisfaction with treatment using a study-specific questionnaire (0–10 scale). Surgical outcomes included the reconstructive choices (that is type and timing) and received breast surgeries, along with changes to surgical pathways (following initial reconstructive decisions). Data were collected through a study-specific questionnaire or obtained from electronic medical patient records when missing. A detailed overview of outcome measures and data collection is provided as Supplementary material Appendix I Table S1 Sample size Manne et al 24 Statistical methods Descriptive statistics were summarized as means with standard deviations for continuous variables and as counts with percentages for categorical variables. Between-group differences at each time point were evaluated using independent t Mean differences with 95% confidence intervals quantified outcomes, whereas effect sizes were determined by Cohen’s d 25 Results Patients Recruitment took place from August 2020 to May 2023, with follow-up completed in August 2024. Of 367 breast cancer patients assessed for eligibility, 213 were informed about the study. The main reasons for exclusion were choice of BCS, language barriers, and prior consultations with a plastic surgeon elsewhere. Informed consent was obtained from 134 participants, who completed the baseline questionnaire and were randomized to the intervention ( n n Fig. 1 Table S2 Fig. 1 CONSORT flow diagram Baseline demographics and clinical characteristics were comparable between the two groups, indicating successful randomization ( Table 1 Table 1 Baseline characteristics of women eligible for post-mastectomy breast reconstruction randomized to a patient decision aid (pDA) or standard care pDA Standard care ( n ( n  Patient characteristics Age at enrolment (years), mean(s.d.) 50 (11.1) 50 (11.3) BMI, median (i.q.r.) 24 (23, 29) 24 (22, 28)  Co-morbidities per patient 0 54 (81.8) 46 (67.6) 1 12 (18.2) 19 (27.9) 2 0 (0.0) 2 (2.9) 3 0 (0.0) 1 (1.5)  Preoperative cupsize A 10 (15.2) 13 (19.1) B 16 (24.2) 20 (29.4) C 20 (30.3) 19 (27.9) D 20 (30.3) 16 (23.5)  Smoking status Active smoker 7 (10.6) 2 (2.9) Former smoker 19 (28.8) 31 (45.6) Non-smoker 40 (60.6) 35 (51.5) Education (years), median (i.q.r.) 17 (15, 19) 17 (15, 20)  Marital status Married 37 (56.1) 32 (47.1) Living together, not married 17 (25.8) 18 (26.5) Partner, not living together 2 (3.0) 3 (4.4) No partner 7 (10.6) 13 (19.1) Widow 3 (4.5) 1 (1.5) Other 0 (0.0) 1 (1.5)  Employment status Employed 50 (76.9) 41 (60.3) Unemployed 6 (9.2) 8 (11.8) Retired 5 (7.7) 10 (14.7) Other 4 (6.2) 9 (13.2)  Baseline questionnaire scores GSES, mean(s.d.) 33 (3.6) 33 (4.5)  HADS, mean(s.d.) Anxiety 6.6 (4.1) 7.0 (4.0) Depression 3.8 (3.1) 3.9 (2.9)  BREAST-Q, mean(s.d.) Psychosocial well-being 66 (17) 69 (16) Sexual well-being 62 (18) 58 (14) Satisfaction with breasts 63 (18) 63 (19) Physical well-being: chest 79 (19) 79 (18)  Treatment characteristics  Chemotherapy Preoperative 23 (39.0) 20 (34.5) Postoperative 14 (23.7) 11 (19.0) Radiotherapy 24 (40.0) 19 (32.8)  Other received non-surgical treatment Endocrine and immunotherapy 5 (7.6) 6 (8.8) Endocrine therapy 28 (42.4) 18 (26.5) Immunotherapy 1 (1.5) 1 (1.5) None 32 (48.5) 43 (63.2) Values are presented as n Primary outcome Immediately after reconstructive decision, mean decisional conflict scores were 17 (s.d. 12) in the intervention group and 20 (s.d. 18) in the control group, without statically significant differences (mean difference (MD) = −2.8, 95% c.i., −8.4 to 2.8, P d Table 2 Table 2 Comparing decision-making and patient-reported outcomes after reconstructive decision and 1-year post-surgery in women eligible for post-mastectomy breast reconstruction randomized to a patient decision aid or standard care pDA Standard care  n Mean (s.d.)*  n Mean (s.d.)* MD (95% c.i.) Cohen’s d  P  Immediately after reconstructive decision DCS 61 17 (12) 59 20 (18) −2.8 (−8.4, 2.8) −0.18 0.319 SDM-Q-9 60 83 (27) 59 83 (27) −0.019 (−9.9, 9.8) 0.00 0.997 Patient-rated physician empathy (CARE) 61 38 (9.2) 59 37 (9.3) 1.1 (−2.3, 4.4) 0.12 0.527 Satisfaction with consultation(s) 61 9.6 (1.2) 59 9.5 (1.2) 0.15 (−0.3, 0.60) 0.13 0.487 Satisfaction with information 61 9.6 (1.1) 59 9.4 (1.2) 0.20 (−0.2, 0.60) 0.17 0.346 Duration of first consultation (minutes) 58 46 (15) 58 43 (15) 2.8 (−2.6, 8.2) 0.19 0.304 Number of consultations, n 61 59 0.310 1 43 (70) 45 (76) 2 17 (28) 11 (19) 3 1 (2) 3 (5) Anxiety (HADS) 61 5.7 (3.7) 59 6.3 (3.9) −0.60 (−2.0, 0.80) −0.16 0.386 Depression (HADS) 61 3.9 (3.2) 59 3.8 (3.3) 0.071 (−1.1, 1.2) 0.020 0.905  1-year post-surgery Decisional conflict (DCS) 51 20 (22) 50 25 (22) −4.9 (−14, 3.8) −0.22 0.262 Decisional regret (DRS) 51 16 (16) 50 16 (21) −0.51 (−7.9, 6.9) −0.030 0.890 Satisfaction with information 49 9.3 (1.6) 49 9.0 (1.4) 0.35 (−0.27, 0.96) 0.23 0.266 Satisfaction with plastic surgeon (BREAST-Q) 50 93(12) 50 89 (15) 4.4 (−0.91, 9.8) 0.33 0.103 Change in treating plastic surgeon, n 44 0 (0) 39 1 (2) ‡ 0.470 Anxiety (HADS) 50 5.1(3.9) 50 5.1(3.9) 0.06 (−1.5, 1.6) 0.02 0.938 Depression (HADS) 51 3 (3.6) 50 2.8 (3.2) 0.18 (−1.2, 1.5) 0.05 0.792 Satisfaction with breast(s) (BREAST-Q) 50 62 (14) 50 66 (20) −3.8 (−11, 3.0) −0.22 0.271 Psychosocial well-being (BREAST-Q) 50 68 (21) 50 69 (19) −1.1 (−9.0, 6.7) −0.06 0.778 Physical well-being: chest (BREAST-Q) 36 72 (22) 35 76 (17) −3.6 (−13, 5.8) −0.18 0.444 Sexual well-being (BREAST-Q) 49 55 (22) 48 53 (20) 2.0 (−6.5, 11) 0.10 0.635 Body image (EORTC-QLQ-BR23) 51 67 (24) 50 74 (26) −6.7 (−16, 3.1) −0.27 0.178 Breast symptoms (EORTC-QLQ-BR23) 51 70 (24) 50 78 (20) −7.9 (−17, 0.82) −0.36 0.075 Satisfaction with treatment 49 9.1 (1.9) 47 9.2 (1.1) −0.13 (−0.76, 0.50) −0.08 0.681 BREAST-Q = breast-questionnaire; CARE = consultation and relational empathy; DCS = decisional conflict scale; DRS = decisional regret scale; EORTC-QLQ-BR23 = European organization for research and treatment of cancer breast cancer-specific module; HADS = hospital anxiety and depression scale; pDA = patient decision aid; SDM-Q-9 = shared decision-making questionnaire. *Values are presented as mean(s.d.) unless otherwise indicated. †In patients who opted for reconstruction. ‡One patient wanted to consult a female plastic surgeon. Secondary outcomes Decision-making process Immediately after reconstructive decision, no significant differences were observed between groups in patients’ perceived involvement in SDM, patient-rated physician empathy or satisfaction with consultation and information, duration of the first consultation, or the number of consultations ( Table 2 At 1-year post-surgery, no significant differences were found in decisional conflict, decision regret, satisfaction with information, satisfaction with treatment, satisfaction with surgeon, or change in treating plastic surgeon ( Table 2 Patient-reported outcomes Immediately after reconstructive decision, no significant differences were found between groups regarding symptoms of anxiety and depression. At 1-year post-surgery, no significant differences were observed between intervention and control groups in symptoms of anxiety and depression, satisfaction with breast(s), psychological well-being, physical well-being of the chest, sexual well-being, body image, breast-related symptoms, or satisfaction with treatment ( Table 2 Surgical outcomes There were no significant differences in actual reconstructive choices, including the decision to undergo reconstruction, as well as the type and timing of the procedure ( Table 3 Table 3 Table 3 Comparing reconstructive choice, received breast surgery and changes in surgical pathways in women eligible for post-mastectomy breast reconstruction randomized to a patient decision aid or standard care pDA Standard care  P  Reconstructive choice  n  n 0.483  Immediate breast reconstruction 50 (82) 42 (71) Autologous 36 (59) 33 (56) Implant-based 12 (20) 9 (15) Combined 2 (3) 0 (0)  Delayed breast reconstruction 2 (3) 2 (3) Autologous 1 (2) 0 (0) Implant-based 1 (2) 2 (3)  No reconstruction 9 (15) 15 (25)  Received breast surgery  n  n 0.542  Immediate breast reconstruction 43 (84) 37 (74) Autologous 31 (61) 29 (58) Implant-based 10 (20) 8 (16) Combined technique 2 (4) 0 (0)  Delayed breast reconstruction 1 (2) 3 (6) Autologous 0 (0) 0 (0) Implant-based 1 (2) 3 (6)  No reconstruction 7 (14) 10 (20)  Change to surgical pathway  n  n 0.240 Yes 2 (4) 1 (2) No 48 (96) 49 (98) Reason for change  n  n = 1 Patient's preference changed after peer support 1 (50) 0 (0) Preferred reconstruction not an option this patient 1 (50) 1 (100) Values are presented as n Discussion In this RCT, the online pDA designed for women considering PMBR did not reduce decisional conflict. Both groups received high-quality standard care, resulting in consistently low levels of decisional conflict. No significant differences were observed immediately after reconstructive decision or 1-year post-surgery in any measure related to the decision-making process, PROs, or surgical outcomes. Results diverged from the broader evidence supporting the effectiveness of pDAs in facilitating decision-making. A meta-analysis of 209 studies across various clinical contexts found that pDAs increased patient participation in decision-making 26 11 27 28 Specifically for PMBR, a recent network meta-analysis of 14 RCTs showed that pDA users experienced significantly less decisional conflict and regret, alongside improved knowledge and satisfaction 29 versus versus In a study by Sherman et al 30 In this study, decisional conflict was low in both groups (that is ≤25), indicating that women were generally ready to implement a decision 19 31 The findings of this trial align with those of Ter Stege et al et al 32 33 et al 32 et al 33 versus et al 34 et al 35 Apart from patients, healthcare professionals may also benefit from offering pDAs. In a qualitative study, Sherman et al 36 26 37 A key strength of this study is its randomized controlled design and high response rates. However, a limitation is that one of the plastic surgeons was involved in creating and updating information for the pDA. Although the pDA was approved by all participating plastic and oncologic surgeons, this involvement may have influenced them to prime their standard of care regarding decisional support. Practical constraints prevented blinding of plastic surgeons to treatment allocation. No plastic surgeon-dependent differences were however found in exploratory analysis of the primary outcome regardless of treatment allocation (data not shown). Shared decision-making is indispensable to PMBR given the inherently complex and profoundly personal nature of choices involved. This RCT found that, within a setting of high-quality standard care, the addition of an online patient decision aid did not further reduce decisional conflict. Both approaches consistently achieved low levels of decisional conflict, suggesting they were equally effective in supporting informed decision-making. In an era focused on the continuous enhancement of patient engagement, these findings highlight that context matters: in well-resourced multidisciplinary settings, standard care alone can effectively provide decisional support regarding PMBR. Supplementary Material znaf151_Supplementary_Data Author contributions Britt Jansen (Formal analysis, Investigation, Visualization, Writing—original draft), Isabelle Juliette Henskens (Formal analysis, Visualization, Writing—original draft), Claudia Bargon (Conceptualization, Data curation, Methodology, Project administration, Writing—review & editing), Teun Teunis (Conceptualization, Methodology, Supervision, Writing—review & editing), Assa Braakenburg (Conceptualization, Methodology, Supervision, Writing—review & editing), Danny Young-Afat (Conceptualization, Methodology, Project administration, Supervision, Writing—review & editing), Helena Verkooijen (Conceptualization, Methodology, Supervision, Writing—review & editing), and Annemiek Doeksen (Conceptualization, Data curation, Methodology, Supervision, Writing—review & editing) Funding This research did not receive any specific grant from funding agencies in the public, commercial, or not-for-profit sectors. Disclosure The authors declare that they have no financial interest in the patient decision aid (pDA) referenced in this article. Dr T. Teunis developed the pDA, and the institution conducting the RCT did not pay usage fees. Supplementary material Supplementary material is available at BJS online Data availability Data are available on request from the corresponding author. References 1 Gopie JP ter Kuile MM Timman R Mureau MA Tibben A Impact of delayed implant and DIEP flap breast reconstruction on body image and sexual satisfaction: a prospective follow-up study Psychooncology 2014 23 100 107 23983109 10.1002/pon.3377 2 Bennett KG Qi J Kim HM Hamill JB Pusic AL Wilkins EG Comparison of 2-year complication rates among common techniques for postmastectomy breast reconstruction JAMA Surg 2018 153 901 908 29926077 10.1001/jamasurg.2018.1687 PMC6233788 3 Mannu GS Navi A Morgan A et al Sentinel lymph node biopsy before mastectomy and immediate breast reconstruction may predict post-mastectomy radiotherapy, reduce delayed complications and improve the choice of reconstruction Int J Surg 2012 10 259 264 22525383 10.1016/j.ijsu.2012.04.010 4 Fontes KP Veiga DF Naldoni AC Sabino-Neto M Ferreira LM Physical activity, functional ability, and quality of life after breast cancer surgery J Plast Reconstr Aesthet Surg 2019 72 394 400 30509735 10.1016/j.bjps.2018.10.029 5 Damen TH Timman R Kunst EH et al High satisfaction rates in women after DIEP flap breast reconstruction J Plast Reconstr Aesthet Surg 2010 63 93 100 19036662 10.1016/j.bjps.2008.08.019 6 Berlin NL Tandon VJ Hawley ST et al Feasibility and efficacy of decision aids to improve decision making for postmastectomy breast reconstruction: a systematic review and meta-analysis Med Decis Making 2019 39 5 20 30799692 10.1177/0272989X18803879 7 Metcalfe K Zhong T O'Neill AC et al Development and testing of a decision aid for women considering delayed breast reconstruction J Plast Reconstr Aesthet Surg 2018 71 318 326 28958567 10.1016/j.bjps.2017.08.027 8 Bieber C Nicolai J Gschwendtner K et al How does a shared decision-making (SDM) intervention for oncologists affect participation style and preference matching in patients with breast and colon cancer? J Cancer Educ 2018 33 708 715 27966192 10.1007/s13187-016-1146-7 PMC5949132 9 Shay LA Lafata JE Where is the evidence? A systematic review of shared decision making and patient outcomes Medical Decision Making 2015 35 114 131 25351843 10.1177/0272989X14551638 PMC4270851 10 Légaré F Adekpedjou R Stacey D et al Interventions for increasing the use of shared decision making by healthcare professionals Cochrane Database Syst Rev 2018 7 CD006732 30025154 10.1002/14651858.CD006732.pub4 PMC6513543 11 Waljee JF Rogers MAM Alderman AK Decision aids and breast cancer: do they influence choice for surgery and knowledge of treatment options? J Clin Oncol 2007 25 1067 1073 17369570 10.1200/JCO.2006.08.5472 12 Knops AM Legemate DA Goossens A Bossuyt PMM Ubbink DT Decision aids for patients facing a surgical treatment decision: a systematic review and meta-analysis Ann Surg 2013 257 860 866 23470574 10.1097/SLA.0b013e3182864fd6 13 Lam WW Chan M Or A Kwong A Suen D Fielding R Reducing treatment decision conflict difficulties in breast cancer surgery: a randomized controlled trial J Clin Oncol 2013 31 2879 2885 23835709 10.1200/JCO.2012.45.1856 14 Paraskeva N Guest E Lewis-Smith H Harcourt D Assessing the effectiveness of interventions to support patient decision making about breast reconstruction: a systematic review Breast 2018 40 97 105 29730304 10.1016/j.breast.2018.04.020 15 Schulz KF Altman DG Moher D CONSORT 2010 statement: updated guidelines for reporting parallel group randomised trials BMC Med 2010 8 18 20334633 10.1186/1741-7015-8-18 PMC2860339 16 The Ottawa Hospital Research Institute https://decisionaid.ohri.ca/odsf.html 17 Stichting Makkelijk Lezen. Stichting Makkelijk Lezen [Internet] https://www.stichtingmakkelijklezen.nl/ 18 Borstkanker Vereniging Nederland (Dutch Breast Cancer Association). https://www.borstkanker.nl/ 19 O'Connor AM. https://decisionaid.ohri.ca/docs/develop/User_Manuals/UM_Decisional_Conflict.pdf 20 Garvelink MM Boland L Klein K et al Decisional conflict scale use over 20 years: the anniversary review Med Decis Making 2019 39 301 314 31142194 10.1177/0272989X19851345 21 Mercer SW Maxwell M Heaney D Watt GC The consultation and relational empathy (CARE) measure: development and preliminary validation and reliability of an empathy-based consultation process measure Fam Pract 2004 21 699 705 15528286 10.1093/fampra/cmh621 22 Kriston L Scholl I Hölzel L Simon D Loh A Härter M The 9-item shared decision making questionnaire (SDM-Q-9). Development and psychometric properties in a primary care sample Patient Educ Couns 2010 80 94 99 19879711 10.1016/j.pec.2009.09.034 23 Brehaut JC O'Connor AM Wood TJ et al Validation of a decision regret scale Med Decis Making 2003 23 281 292 12926578 10.1177/0272989X03256005 24 Manne SL Topham N Kirstein L et al Attitudes and decisional conflict regarding breast reconstruction among breast cancer patients Cancer Nurs 2016 39 427 436 26780376 10.1097/NCC.0000000000000320 PMC4947023 25 Norman GR Sloan JA Wyrwich KW Interpretation of changes in health-related quality of life: the remarkable universality of half a standard deviation Med Care 2003 41 582 592 12719681 10.1097/01.MLR.0000062554.74615.4C 26 Stacey D Lewis KB Smith M et al Decision aids for people facing health treatment or screening decisions Cochrane Database Syst Rev 2024 1 Cd001431 38284415 10.1002/14651858.CD001431.pub6 PMC10823577 27 Wyld L Reed MWR Collins K et al Bridging the age gap in breast cancer: cluster randomized trial of two decision support interventions for older women with operable breast cancer on quality of life, survival, decision quality, and treatment choices Br J Surg 2021 108 499 510 33760077 10.1093/bjs/znab005 PMC10364907 28 Whelan T Levine M Willan A et al Effect of a decision aid on knowledge and treatment decision making for breast cancer surgery: a randomized trial JAMA 2004 292 435 441 15280341 10.1001/jama.292.4.435 29 Su Y Sun C-Y Chiu W-K Kang Y-N Chen C Patient decision aids for breast cancer reconstruction: a systematic review and network meta-analysis of randomized controlled trials Plast Reconstr Surg 2024 154 929 940 38232225 10.1097/PRS.0000000000011292 30 Sherman KA Shaw LE Winch CJ et al Reducing decisional conflict and enhancing satisfaction with information among women considering breast reconstruction following mastectomy: results from the BRECONDA randomized controlled trial Plast Reconstr Surg 2016 138 592e 602e 10.1097/PRS.0000000000002538 27673530 31 McCarney R Warner J Iliffe S van Haselen R Griffin M Fisher P The Hawthorne effect: a randomised, controlled trial BMC Med Res Methodol 2007 7 30 17608932 10.1186/1471-2288-7-30 PMC1936999 32 Ter Stege JA Woerdeman LAE Kieffer JM et al Efficacy of a decision aid in breast cancer patients considering immediate reconstruction: results of a randomized controlled trial Plast Reconstr Surg 2024 154 706 722 37815283 10.1097/PRS.0000000000011100 PMC11412569 33 Politi MC Lee CN Philpott-Streiff SE et al A randomized controlled trial evaluating the BREASTChoice tool for personalized decision support about breast reconstruction after mastectomy Ann Surg 2020 271 230 237 31305282 10.1097/SLA.0000000000003444 34 Wilkens SC Ring D Teunis T Lee SP Chen NC Decision aid for trapeziometacarpal arthritis: a randomized controlled trial J Hand Surg Am 2019 44 247.e241 247.e249 10.1016/j.jhsa.2018.06.004 30031600 35 Mardinger C Steve AK Webb C Sherman KA Temple-Oberle C Breast reconstruction decision aids decrease decisional conflict and improve decisional satisfaction: a randomized controlled trial Plast Reconstr Surg 2023 151 278 288 36696307 10.1097/PRS.0000000000009830 36 Sherman KA Shaw L-K Jørgensen L et al Qualitatively understanding patients’ and health professionals’ experiences of the BRECONDA breast reconstruction decision aid Psychooncology 2017 26 1618 1624 27957772 10.1002/pon.4346 37 Wennberg JE Practice variation: implications for our health care system Manag Care 2004 13 3 7 15493217 ",
  "metadata": {
    "Title of this paper": "Practice variation: implications for our health care system",
    "Journal it was published in:": "The British Journal of Surgery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485225/"
  }
}