{
  "title": "Paper_1045",
  "abstract": "pmc Mar Drugs Mar Drugs 590 mardrugs marinedrugs Marine Drugs 1660-3397 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471837 PMC12471837.1 12471837 12471837 41003307 10.3390/md23090338 marinedrugs-23-00338 1 Article Marine Algal Metabolites as Cellular Antioxidants: A Study of Caulerpin and Caulerpinic Acid in Saccharomyces cerevisiae https://orcid.org/0009-0002-0165-7920 Assalve Graziana Conceptualization Methodology Validation Formal analysis Investigation Data curation Writing – original draft Writing – review & editing 1 † https://orcid.org/0000-0001-7118-1994 Lunetti Paola Conceptualization Methodology Validation Formal analysis Investigation Data curation Writing – original draft Writing – review & editing 1 † Fai Annalisa Formal analysis Investigation 1 Terlizzi Antonio Writing – original draft Writing – review & editing 2 3 Zara Vincenzo Conceptualization Resources Writing – original draft Writing – review & editing Supervision 1 ‡ https://orcid.org/0000-0002-8251-9652 Ferramosca Alessandra Conceptualization Resources Writing – original draft Writing – review & editing Supervision 1 * ‡ Figueroa Felix Lopez Academic Editor Kim Se-Kwon Academic Editor 1 graziana.assalve@unisalento.it paola.lunetti@unisalento.it annalisa.fai@unisalento.it vincenzo.zara@unisalento.it 2 antonio.terlizzi@szn.it 3 * alessandra.ferramosca@unisalento.it † These authors contributed equally to this work. ‡ These authors contributed equally to this work. 25 8 2025 9 2025 23 9 497656 338 23 7 2025 02 8 2025 23 8 2025 25 08 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Oxidative stress caused by excessive reactive oxygen species (ROS) contributes to numerous chronic diseases. Marine green algae of the Caulerpa Saccharomyces cerevisiae 2 2 −1 −1 algal metabolites Caulerpa antioxidants oxidative stress S. cerevisiae Italian Ministry of University and Research CN_00000033 CUP F87G22000290001 CIB (Consorzio Interuniversitario per le Biotecnologie) MUR DM 581/22 This research was funded by the National Recovery and Resilience Plan (NRRP), Mission 4 Component 2 Investment 1.4—Call for tender No. 3138 of 16 December 2021, rectified by Decree n. 3175 of 18 December 2021 of Italian Ministry of University and Research funded by the European Union—NextGenerationEU. Project code CN_00000033, Concession Decree No. 1034 of 17 June 2022, adopted by the Italian Ministry of University and Research, CUP F87G22000290001, Project title “National Biodiversity Future Center—NBFC” and partially funded by MUR DM 581/22 to CIB (Consorzio Interuniversitario per le Biotecnologie). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction In recent years, marine macroalgae have garnered growing attention as promising sources of novel bioactive compounds with significant therapeutic potential. Among these, algal metabolites are of particular interest due to their remarkable structural diversity and biological specificity. Within this context, green algae of the genus Caulerpa These tropical marine algae, commonly known as “sea grapes,” are widely consumed across Southeast Asia and the Indo-Pacific, both as nutritious foods and as components of traditional medicine. In addition to their favorable nutritional profiles, characterized by high levels of carbohydrates, proteins, dietary fibers, and essential amino acids [ 1 2 Caulerpa 3 4 5 6 7 8 Members of the Caulerpa 9 Among the various biological activities exhibited by Caulerpa 10 11 12 13 14 15 16 17 Marine algae-derived antioxidants have shown considerable promise in mitigating oxidative damage at the cellular level, thus contributing to disease prevention and therapeutic intervention [ 9 18 Caulerpa 3 Among the most abundant metabolites in Caulerpa Figure 1 8 19 20 In silico 5 21 Interestingly, caulerpinic acid (CA) is a structurally related derivative of CAU that naturally co-occurs in Caulerpa Figure 1 Supporting the bioactive potential of both compounds, in vitro C. cylindracea 22 23 24 C. cylindracea 23 24 Despite promising evidence, the intracellular antioxidant effects of CAU and, especially, CA have not been systematically evaluated in eukaryotic models that enable detailed insights into redox regulation and stress response mechanisms. Yeast ( Saccharomyces cerevisiae 25 The present study investigates the antioxidant potential of CAU and CA in S. cerevisiae Caulerpa in vivo S. cerevisiae 2. Results 2.1. Effects of Marine-Derived Compounds on Yeast Cell Viability To assess yeast viability, S. cerevisiae 600 Figure 2 No cytotoxic effects were observed for either compound within the tested concentration range (1–50 µM), as yeast cells exhibited approximately 100% growth relative to the untreated control. Since cell proliferation was not affected, subsequent experiments aimed at evaluating antioxidant activity were conducted using the lowest concentration (1 µM) that resulted in maximal growth comparable to that of the control. 2.2. Antioxidant Properties of Marine-Derived Compounds Yeast cells grown under fermentative conditions showed reduced viability upon exposure to 2 mM of H 2 2 Figure 3 Treatment with 1 µM of CAU, CA, or resveratrol (RESV), a well-characterized natural antioxidant used as a positive control [ 26 2 2 Figure 3 Figure 3 Table 1 To comprehensively evaluate the antioxidant potential of CAU and CA, a series of complementary growth recovery assays were performed under oxidative stress conditions induced by 2 mM of H 2 2 In spot assays, yeast cultures pretreated with either CAU or CA exhibited markedly improved survival on glucose-supplemented SC plates containing H 2 2 2 2 Figure 4 To further validate these findings, the drug drop test was employed. Filter disks impregnated with H 2 2 2 2 2 2 Figure 4 Consistent results were obtained in CFU assays. Yeast cultures treated with CAU or CA and then plated on SC-glucose agar with H 2 2 Figure 4 In all assays, CAU and CA displayed a protective effect comparable to that of RESV. Taken together, these findings indicate that both compounds confer substantial protection against H 2 2 2.3. Reduction of Intracellular ROS and Oxidative Damage by Marine-Derived Compounds To explore the antioxidant mechanism of CAU and CA, intracellular ROS levels were measured using the H 2 27 2 2 Figure 5 in vivo Given their apparent scavenging activity, we next assessed whether CAU and CA could also mitigate the cellular damage typically induced by oxidative stress. Exposure to H 2 2 1 2 28 Consistent with elevated oxidative stress, H 2 2 Figure 5 Figure 5 2 2 Figure 5 Overall, these findings demonstrate that CAU and CA provide effective protection against H 2 2 2.4. Effect of Marine-Derived Compounds on the Enzymatic and Non-Enzymatic Defense Systems To investigate whether the antioxidant effects of CAU and CA involve endogenous antioxidant defenses, we analyzed the expression levels and enzymatic activities of catalase (Cat) and superoxide dismutase (Sod) in yeast under oxidative stress conditions ( Figure 6 29 30 31 32 33 Exposure to 2 mM of H 2 2 Figure 6 2 2 Figure 6 2 2 Figure 6 To evaluate the effects of the marine-derived compounds on non-enzymatic antioxidant systems [ 34 35 36 2 2 Figure 6 2 2 Figure 6 In parallel, H 2 2 2 2 Figure 6 Together, these findings indicate that CAU and CA enhance the intracellular antioxidant capacity by sustaining GSH levels and preventing the inactivation of GPx under oxidative stress. This dual effect likely contributes to the improved cell survival and reduced ROS accumulation observed in previous assays, underscoring the critical role of non-enzymatic antioxidant pathways in the protective action of these marine-derived compounds. 3. Discussion Oxidative stress, caused by excessive accumulation of ROS from both endogenous and exogenous sources, is a well-established contributor to cellular damage and plays a central role in the development of many chronic diseases such as cancer, cardiovascular and neurodegenerative disorders, diabetes, and aging [ 10 17 37 38 39 Marine algae are a valuable source of bioactive compounds, including phenolic acids, flavonoids, sterols, and indole alkaloids, which exhibit antioxidant, anti-inflammatory, antitumor, and metabolic regulatory effects [ 3 4 5 6 7 8 40 C. cylindracea 3 8 19 20 22 23 24 This study utilized the eukaryotic model organism S. cerevisiae 2 2 25 2 2 Initial toxicity assessments confirmed that CAU and CA did not adversely affect yeast viability within the tested concentration range, allowing further evaluation of their antioxidant effects. When exposed to sublethal H 2 2 The protective mechanism appears to involve direct ROS scavenging, likely related to the aromatic bisindole structure of these compounds. Intracellular ROS measurements revealed that pretreatment with CAU or CA maintained ROS at basal levels despite H 2 2 Beyond direct ROS neutralization, CAU and CA may modulate endogenous antioxidant defenses. In S. cerevisiae 41 Previous studies have shown that exposure to H 2 2 29 42 2 2 29 30 2 2 2 2 In contrast, intracellular GSH levels increased significantly in cultures pretreated with CAU, CA, or RESV compared to stressed cells without pretreatment, which maintained basal GSH levels. This suggests an induced enhancement of non-enzymatic antioxidant capacity by these compounds. Since GSH serves as a reducing cofactor for GPx, this may reflect a strategic shift in antioxidant defenses from Cat-dependent to GPx-mediated detoxification [ 36 GPx activity, known to be impaired by oxidative stress, possibly via post-translational modifications rather than GSH depletion, was preserved in pretreated cells at levels comparable to unstressed controls. This preservation likely contributes significantly to the improved cellular viability observed, as GPx activity is critical for survival during oxidative insult [ 43 In summary, CAU and CA exhibit cytoprotective effects through a dual mechanism: direct ROS scavenging via their bisindole structure and enhancement of non-enzymatic redox buffering through increased GSH levels and maintenance of GPx activity. These findings provide a mechanistic framework supporting the potential application of these marine-derived alkaloids as natural antioxidants to counteract oxidative stress-related cellular damage. 4. Materials and Methods 4.1. Purification and Alkaline Hydrolysis of CAU C. cylindracea 8 44 1 13 1 8 4.2. Yeast Strains and Growth Conditions The wild-type strain of S. cerevisiae his leu lys ura Yeast cells were grown at 30 °C either in YP medium (2% [ w v w v w v w/v Cells were pre-cultured overnight in YP medium supplemented with 2% ( w v w v 600 w v 45 4.3. Evaluation of S. cerevisiae Cells’ Sensitivity to Marine-Derived Compounds Exponentially growing wild-type cells were treated with varying concentrations (1–50 μM) of CAU and CA in SC liquid medium supplemented with glucose. After 24 h of incubation, cell growth was assessed by measuring OD 600 600 CFU assays were performed by spreading appropriate cell dilutions onto glucose-supplemented SC agar plates containing 1–50 μM of each compound. After 24 h of incubation, colonies were counted and cell viability was expressed as a percentage relative to the DMSO (CAS: 67-68-5) control, which was set at 100%. 4.4. Cellular Assays for the Evaluation of Antioxidant Activity Exponentially growing wild-type cells were treated with 1 μM of CAU or CA for 2 h, followed by exposure to 2 mM of H 2 2 600 46 For spot assays, cells were pretreated with the compounds for 2 h, serially diluted, and spotted onto glucose-supplemented SC agar plates with or without 2 mM H 2 2 For CFU assays, cells were treated as described above and plated in triplicate onto SC agar plates supplemented with 2 mM of H 2 2 For the drug drop test, cells were spread onto SC agar plates supplemented with glucose. Sterile filters were placed on the agar surface and spotted with the test compounds. After 1 h, 2 mM of H 2 2 2 2 47 In all experiments, RESV-treated cultures were included as a positive control. 4.5. Estimation of Intracellular Oxidation Exponentially growing wild-type cells were either directly exposed to 2 mM H 2 2 g ROS levels were assessed using H 2 2 2 g 2 34 4.6. Preparation of Yeast Cell–Free Extracts For the determination of protein carbonyl content, lipid peroxidation, GSH levels, and enzymatic activities, cell-free extracts were prepared from yeast cultures grown to the exponential phase. Cultures were pretreated with the tested compounds (1 µM) for 2 h, followed by exposure to 2 mM of H 2 2 g g 36 4.7. Measurement of Oxidative Damage Protein carbonyl content was detected in the cell-free extracts by using the OxyBlot TM 48 Lipid peroxidation was quantified by measuring thiobarbituric acid-reactive substances (TBARS), following the instructions of the Lipid Peroxidation (MDA) Assay Kit (Sigma-Aldrich, St. Louis, MO, USA). Briefly, 200 µL of cell-free extract were mixed with 600 µL of thiobarbituric acid (TBA) reagent (30% glacial acetic acid, CAS: 64-19-7; 1% TBA, CAS: 504-17-6). The addition of the reagent stopped lipid peroxidation and initiated the reaction. Samples were heated in a thermoblock at 95 °C for 1 h, then rapidly cooled on ice. Fluorescence was measured at an excitation/emission wavelength of 530/560 nm. Results were expressed as nanomoles of TBARS per milligram of protein. 4.8. Determination of Cat, Sod, and GPx Activity Cat activity was measured in cell-free extracts using the Catalase Assay Kit (Sigma-Aldrich, St. Louis, MO, USA), following the manufacturer’s protocol. Briefly, 10 µL of extract was incubated with 45 µM of H 2 2 2 2 Sod activity was determined in cell-free extracts using the Superoxide Dismutase Assay Kit (Sigma-Aldrich, St. Louis, MO, USA), following the manufacturer’s instructions. The assay is based on a colorimetric method in which superoxide anions, generated by xanthine oxidase (XO), react with a WST-1 dye to produce a water-soluble formazan dye. Sod competes with the dye for superoxide anions, thereby reducing the formation of the colored product. The absorbance at 440 nm (OD 440 GPx activity was measured using the Ransel kit (Randox Laboratories, UK), according to the manufacturer’s instructions. The millimolar extinction coefficient of nicotinamide adenine dinucleotide phosphate (NADPH) at 340 nm (6.22 mM −1 −1 Results are presented as the mean ± SD of experiments from three independent cultures ( n 4.9. Quantification of Intracellular GSH Levels GSH content was determined from cell-free extracts. Equal volumes of extract and ice-cold 2 M HClO 4 g 25 n 4.10. Gene Expression Analysis by Quantitative Real-Time PCR (qRT-PCR) Yeast cultures were grown to the exponential phase (OD 600 2 2 7 260/280 260/230 cDNA was synthesized from 1 μg of total RNA using the PrimeScript TM ® ® ® −ΔΔCt (target gene) (TAF10) treated (target gene) (TAF10) control 45 49 5. Conclusions This study demonstrates that the marine-derived metabolites CAU and CA exert potent intracellular antioxidant activity in S. cerevisiae Notably, their protective effects are not mediated by the activation of canonical antioxidant enzymes but rather by reinforcing non-enzymatic defenses. Specifically, CAU and CA enhance intracellular GSH levels and preserve GPx activity under oxidative conditions, sustaining redox homeostasis and cell viability. These findings provide mechanistic insight into the dual antioxidant action of these bisindole alkaloids and underscore their potential as lead compounds for the development of natural therapeutics targeting ROS-related pathologies. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, G.A., P.L. and A.F. (Alessandra Ferramosca) and V.Z.; methodology, G.A. and P.L.; validation, G.A. and P.L.; formal analysis, G.A., P.L. and A.F. (Annalisa Fai); investigation, G.A., P.L. and A.F. (Annalisa Fai); resources, A.F. (Alessandra Ferramosca) and V.Z.; data curation, G.A. and P.L.; writing—original draft preparation, G.A., P.L., A.T., V.Z. and A.F. (Alessandra Ferramosca); writing—review and editing, G.A., P.L., A.T., V.Z. and A.F. (Alessandra Ferramosca); supervision, A.F. (Alessandra Ferramosca) and V.Z. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Data Availability Statement The datasets generated and analyzed during this current study are available from the corresponding author upon reasonable request. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: BSA Bovine Serum Albumin CA Caulerpinic Acid Cat Catalase CAU Caulerpin CFU Colony-Forming Units DCF 2′,7′-dichlorofluorescein ddH2O double-distilled water DMSO Dimethyl sulfoxide DTNB 5,5′-dithiobis-(2-nitrobenzoic acid) GPx Glutathione Peroxidase GSH Glutathione H 2 2′,7′-dichlorofluorescein diacetate HRP Horseradish peroxidase MDA Malondialdehyde NADPH Nicotinamide adenine dinucleotide phosphate OD Optical Density PMSF Phenylmethylsulfonyl fluoride qRT-PCR Quantitative Real-Time PCR RESV Resveratrol ROS Reactive Oxygen Species SC Synthetic Complete SD Standard Deviation Sod Superoxide dismutase TBA Thiobarbituric acid TBARS Thiobarbituric acid-reactive substances TLC Thin-Layer Chromatography XO Xanthine Oxidase References 1. Alam Bhuiyan M.K. Qureshi S. Proximate Chemical Composition of Sea Grapes Caulerpa Racemosa (J. Agardh, 1873) Collected from a Sub-Tropical Coast Virol. Mycol. 2016 5 158 10.4172/2161-0517.1000158 2. Fernando I.P.S. Sanjeewa K.K.A. Samarakoon K.W. Lee W.W. Kim H.-S. Kim E.-A. Gunasekara U.K.D.S.S. Abeytunga D.T.U. Nanayakkara C. de Silva E.D. FTIR Characterization and Antioxidant Activity of Water Soluble Crude Polysaccharides of Sri Lankan Marine Algae Algae 2017 32 75 86 10.4490/algae.2017.32.12.1 3. Chew Y.L. Lim Y.Y. Omar M. Khoo K.S. Antioxidant Activity of Three Edible Seaweeds from Two Areas in South East Asia LWT—Food Sci. Technol. 2008 41 1067 1072 10.1016/j.lwt.2007.06.013 4. De Souza É.T. Pereira de Lira D. Cavalcanti de Queiroz A. Costa da Silva D.J. Bezerra de Aquino A. Campessato Mella E.A. Prates Lorenzo V. De Miranda G.E.C. De Araújo-Júnior J.X. De Oliveira Chaves M.C. The Antinociceptive and Anti-Inflammatory Activities of Caulerpin, a Bisindole Alkaloid Isolated from Seaweeds of the Genus Caulerpa Mar. Drugs 2009 7 689 704 10.3390/md7040689 20098607 PMC2810220 5. Dissanayake I.H. Bandaranayake U. Keerthirathna L.R. Manawadu C. Silva R.M. Mohamed B. Ali R. Peiris D.C. Integration of in Vitro and In-Silico Analysis of Caulerpa Racemosa against Antioxidant, Antidiabetic, and Anticancer Activities Sci. Rep. 2022 12 20848 10.1038/s41598-022-24021-y 36460661 PMC9718753 6. Sidrônio M.G.S. Freitas M.E.G. Magalhães D.W.A. Carvalho D.C.M. Gonçalves V.A.B. de Queiroz Oliveira A.C.M. Paulino G.C. Borges G.C. Ribeiro R.L. de Sousa N.F. Host-Mediated Antimicrobial Effects and NLRP3 Inflammasome Modulation by Caulerpin and Its Derivatives in Macrophage Models of Mycobacterial Infections Microorganisms 2025 13 561 10.3390/microorganisms13030561 40142455 PMC11944515 7. El Habitri N. Belkacemi L. Antidiabetic Effect of Oral Supplementation with Caulerpa Racemosa Powder Eur. J. Biol. Res. Res. Artic. Eur. J. Biol. Res. 2022 12 141 152 10.5281/zenodo.6560521 8. Ferramosca A. Conte A. Guerra F. Felline S. Rimoli M.G. Mollo E. Zara V. Terlizzi A. Metabolites from Invasive Pests Inhibit Mitochondrial Complex II: A Potential Strategy for the Treatment of Human Ovarian Carcinoma? Biochem. Biophys. Res. Commun. 2016 473 1133 1138 10.1016/j.bbrc.2016.04.028 27091429 9. Klein J. Verlaque M. The Caulerpa Racemosa Invasion: A Critical Review Mar. Pollut. Bull. 2008 56 205 225 10.1016/j.marpolbul.2007.09.043 18061625 10. Jomova K. Raptova R. Alomar S.Y. Alwasel S.H. Nepovimova E. Kuca K. Valko M. Reactive Oxygen Species, Toxicity, Oxidative Stress, and Antioxidants: Chronic Diseases and Aging Arch. Toxicol. 2023 97 2499 2574 10.1007/s00204-023-03562-9 37597078 PMC10475008 11. Ferramosca A. Pinto Provenzano S. Montagna D.D. Coppola L. Zara V. Oxidative Stress Negatively Affects Human Sperm Mitochondrial Respiration Urology 2013 82 78 83 10.1016/j.urology.2013.03.058 23806394 12. Darenskaya M.A. Kolesnikova L.I. Kolesnikov S.I. Oxidative Stress: Pathogenetic Role in Diabetes Mellitus and Its Complications and Therapeutic Approaches to Correction Bull. Exp. Biol. Med. 2021 171 179 189 10.1007/s10517-021-05191-7 34173093 PMC8233182 13. Shaito A. Aramouni K. Assaf R. Parenti A. Orekhov A. El Yazbi A. Pintus G. Eid A.H. Oxidative Stress-Induced Endothelial Dysfunction in Cardiovascular Diseases Front. Biosci.-Landmark 2022 27 105 10.31083/j.fbl2703105 35345337 14. Briyal S. Ranjan A.K. Gulati A. Oxidative Stress: A Target to Treat Alzheimer’s Disease and Stroke Neurochem. Int. 2023 165 105509 10.1016/j.neuint.2023.105509 36907516 15. Dai X. Hu Y. Jiang L. Lei L. Fu C. Wu S. Zhang X. Zhu L. Zhang F. Chen J. Decreased Oxidative Stress Response and Oxidant Detoxification of Skin during Aging Mech. Ageing Dev. 2023 216 111878 10.1016/j.mad.2023.111878 37827221 16. Zara V. Assalve G. Ferramosca A. Insights into the Malfunctioning of the Mitochondrial Citrate Carrier: Implications for Cell Pathology Biochim. Biophys. Acta (BBA)—Mol. Basis Dis. 2023 1869 166758 10.1016/j.bbadis.2023.166758 37209873 17. Jelic M.D. Mandic A.D. Maricic S.M. Srdjenovic B.U. Oxidative Stress and Its Role in Cancer J. Cancer Res. Ther. 2021 17 22 28 10.4103/jcrt.JCRT_862_16 33723127 18. Gunathilaka T.L. Samarakoon K. Ranasinghe P. Peiris L.D.C. Antidiabetic Potential of Marine Brown Algae—A Mini Review J. Diabetes Res. 2020 2020 1230218 10.1155/2020/1230218 32377517 PMC7197011 19. Mehra R. Bhushan S. Bast F. Singh S. Marine Macroalga Caulerpa: Role of Its Metabolites in Modulating Cancer Signaling Mol. Biol. Rep. 2019 46 3545 3555 10.1007/s11033-019-04743-5 30980271 20. dos Santos J.S.P. Silva D.K.C. da Silva Oliveira V. Junior S.S.S. dos Santos Rodrigues E. de Souza C.V.C. Martinez S.T. Santos-Filho O.A. Meira C.S. Soares M.B.P. The Alkaloid Caulerpin Exhibits Potent and Selective Anti-Inflammatory Activity Through Interaction with the Glucocorticoid Receptor Mar. Drugs 2025 23 232 10.3390/md23060232 40559641 PMC12194734 21. Ur Rehman N. Rafiq K. Khan A. Ahsan Halim S. Ali L. Al-Saady N. Hilal Al-Balushi A. Al-Busaidi H.K. Al-Harrasi A. α-Glucosidase Inhibition and Molecular Docking Studies of Natural Brominated Metabolites from Marine Macro Brown Alga Dictyopteris Hoytii Mar. Drugs 2019 17 666 10.3390/md17120666 31779132 PMC6949951 22. Stabili L. Fraschetti S. Acquaviva M. Cavallo R. De Pascali S. Fanizzi F. Gerardi C. Narracci M. Rizzo L. The Potential Exploitation of the Mediterranean Invasive Alga Caulerpa Cylindracea: Can the Invasion Be Transformed into a Gain? Mar. Drugs 2016 14 210 10.3390/md14110210 27854274 PMC5128753 23. Erol E. Orhan M.D. Avsar T. Akdemir A. Okudan E.S. Alim Toraman G.O. Topcu G. Anti-SARS-CoV-2 and Cytotoxic Activity of Two Marine Alkaloids from Green Alga Caulerpa cylindracea RSC Adv. 2022 12 29983 29990 10.1039/D2RA03358E 36321101 PMC9580487 24. Mert-Ozupek N. Calibasi-Kocal G. Olgun N. Basbinar Y. Cavas L. Ellidokuz H. An Efficient and Quick Analytical Method for the Quantification of an Algal Alkaloid Caulerpin Showed In-Vitro Anticancer Activity against Colorectal Cancer Mar. Drugs 2022 20 757 10.3390/md20120757 36547904 PMC9781365 25. Assalve G. Lunetti P. Zara V. Ferramosca A. In Vivo Antioxidant Activity of Common Dietary Flavonoids: Insights from the Yeast Model Saccharomyces cerevisiae Antioxidants 2024 13 1103 10.3390/antiox13091103 39334762 PMC11429029 26. Dani C. Bonatto D. Salvador M. Pereira M.D. Henriques J.A.P. Eleutherio E. Antioxidant Protection of Resveratrol and Catechin in Saccharomyces cerevisiae J. Agric. Food Chem. 2008 56 4268 4272 10.1021/jf800752s 18489120 27. Jakubowski W. Bartosz G. Estimation of Oxidative Stress in Saccharomyces Cerevisae with Fluorescent Probes Int. J. Biochem. Cell Biol. 1997 29 1297 1301 10.1016/S1357-2725(97)00056-3 9451827 28. Juan C.A. Pérez de la Lastra J.M. Plou F.J. Pérez-Lebeña E. The Chemistry of Reactive Oxygen Species (ROS) Revisited: Outlining Their Role in Biological Macromolecules (DNA, Lipids and Proteins) and Induced Pathologies Int. J. Mol. Sci. 2021 22 4642 10.3390/ijms22094642 33924958 PMC8125527 29. Bayliak M. Semchyshyn H. Lushchak V. Effect of Hydrogen Peroxide on Antioxidant Enzyme Activities in Saccharomyces cerevisiae Biochemistry 2006 71 1013 1020 10.1134/S0006297906090100 17009956 30. Martins D. English A.M. Catalase Activity Is Stimulated by H 2 2 2 2 Redox Biol. 2014 2 308 313 10.1016/j.redox.2013.12.019 24563848 PMC3926110 31. Luk E. Yang M. Jensen L.T. Bourbonnais Y. Culotta V.C. Manganese Activation of Superoxide Dismutase 2 in the Mitochondria of Saccharomyces cerevisiae J. Biol. Chem. 2005 280 22715 22720 10.1074/jbc.M504257200 15851472 32. Baron J.A. Chen J.S. Culotta V.C. Cu/Zn Superoxide Dismutase and the Proton ATPase Pma1p of Saccharomyces cerevisiae Biochem. Biophys. Res. Commun. 2015 462 251 256 10.1016/j.bbrc.2015.04.127 25956063 PMC4458189 33. Macierzyńska E. Grzelak A. Bartosz G. The Effect of Growth Medium on the Antioxidant Defense of Saccharomyces cerevisiae Cell Mol. Biol. Lett. 2007 12 448 456 10.2478/s11658-007-0017-y 17361365 PMC6275951 34. SJ S. Veerabhadrappa B. Subramaniyan S. Dyavaiah M. Astaxanthin Enhances the Longevity of Saccharomyces cerevisiae FEMS Yeast Res. 2018 19 foy113 10.1093/femsyr/foy113 30312390 35. Jamieson D.J. Oxidative Stress Responses of the Yeast Saccharomyces cerevisiae Yeast 1998 14 1511 1527 10.1002/(SICI)1097-0061(199812)14:16&#x0003c;1511::AID-YEA356&#x0003e;3.0.CO;2-S 9885153 36. Đorđević N.O. Todorović N. Novaković I.T. Pezo L.L. Pejin B. Maraš V. Tešević V.V. Pajović S.B. Antioxidant Activity of Selected Polyphenolics in Yeast Cells: The Case Study of Montenegrin Merlot Wine Molecules 2018 23 1971 10.3390/molecules23081971 30087228 PMC6222681 37. Zhang P. Li T. Wu X. Nice E.C. Huang C. Zhang Y. Oxidative Stress and Diabetes: Antioxidative Strategies Front. Med. 2020 14 583 600 10.1007/s11684-019-0729-1 32248333 38. Teleanu D.M. Niculescu A.-G. Lungu I.I. Radu C.I. Vladâcenco O. Roza E. Costăchescu B. Grumezescu A.M. Teleanu R.I. An Overview of Oxidative Stress, Neuroinflammation, and Neurodegenerative Diseases Int. J. Mol. Sci. 2022 23 5938 10.3390/ijms23115938 35682615 PMC9180653 39. Yi X. Zhu Q.-X. Wu X.-L. Tan T.-T. Jiang X.-J. Histone Methylation and Oxidative Stress in Cardiovascular Diseases Oxid. Med. Cell Longev. 2022 2022 6023710 10.1155/2022/6023710 35340204 PMC8942669 40. Matulja D. Vranješević F. Kolympadi Markovic M. Pavelić S.K. Marković D. Anticancer Activities of Marine-Derived Phenolic Compounds and Their Derivatives Molecules 2022 27 1449 10.3390/molecules27041449 35209235 PMC8879422 41. Koleva D.I. Petrova V.Y. Kujumdzieva A.V. Comparison of Enzymatic Antioxidant Defence Systems in Different Metabolic Types of Yeasts Can. J. Microbiol. 2008 54 957 963 10.1139/W08-093 18997852 42. Izawa S. Inoue Y. Kimura A. Importance of Catalase in the Adaptive Response to Hydrogen Peroxide: Analysis of Acatalasaemic Saccharomyces cerevisiae Biochem. J. 1996 320 61 67 10.1042/bj3200061 8947468 PMC1217898 43. Lingua M.S. Fabani M.P. Wunderlin D.A. Baroni M.V. In Vivo Antioxidant Activity of Grape, Pomace and Wine from Three Red Varieties Grown in Argentina: Its Relationship to Phenolic Profile J. Funct. Foods 2016 20 332 345 10.1016/j.jff.2015.10.034 44. Magliozzi L. Almada F. Robalo J. Mollo E. Polese G. Gonçalves E.J. Felline S. Terlizzi A. D’Aniello B. Cryptic effects of biological invasions: Reduction of the aggressive behaviour of a native fish under the influence of an “invasive” biomolecule PLoS ONE 2017 12 e0185620 10.1371/journal.pone.0185620 28961266 PMC5621679 45. Assalve G. Lunetti P. Zara V. Ferramosca A. Ctp1 and Yhm2: Two Mitochondrial Citrate Transporters to Support Metabolic Flexibility of Saccharomyces cerevisiae Int. J. Mol. Sci. 2024 25 1870 10.3390/ijms25031870 38339147 PMC10855732 46. Olivares-Marin I.K. González-Hernández J.C. Regalado-Gonzalez C. Madrigal-Perez L.A. Saccharomyces cerevisiae J. Vis. Exp. 2018 139 58192 10.3791/58192 PMC6235381 30320748 47. Magistrati M. Gilea A.I. Gerra M.C. Baruffini E. Dallabona C. Drug Drop Test: How to Quickly Identify Potential Therapeutic Compounds for Mitochondrial Diseases Using Yeast Saccharomyces cerevisiae Int. J. Mol. Sci. 2023 24 10696 10.3390/ijms241310696 37445873 PMC10341415 48. De Blasi G. Lunetti P. Zara V. Ferramosca A. Mitochondrial Citrate Transporters Ctp1-Yhm2 and Respiratory Chain: A Coordinated Functional Connection in Saccharomyces cerevisiae Int. J. Biol. Macromol. 2024 270 132364 10.1016/j.ijbiomac.2024.132364 38750837 49. Thomas P.B. Kaluç N. Aybastıer Ö. SLX5 Saccharomyces cerevisiae FEMS Microbiol. Lett. 2022 369 fnac077 10.1093/femsle/fnac077 35981831 Figure 1 ( a b Figure 2 Effects of marine-derived compounds on S. cerevisiae a 600 b c Figure 3 Effects of marine-derived compounds on S. cerevisiae a 2 2 2 2 600 b c a p Figure 4 Evaluation of the antioxidant effects of marine-derived compounds in S. cerevisiae 2 2 a b 2 2 c 5 2 2 2 2 d 2 2 e 2 2 f p p Figure 5 Evaluation of intracellular oxidative stress and damage markers in yeast cells. ( a 2 2 2 b 2 2 d c 2 2 n d p p Figure 6 Measurement of antioxidant enzymatic and non-enzymatic defense systems. ( a b 2 2 c d e f p marinedrugs-23-00338-t001_Table 1 Table 1 Growth rate and doubling time of S. cerevisiae 2 2   Growth Rate (h −1 Doubling Time (h) −H 2 2 DMSO 0.141 ± 0.004 4.91 +H 2 2 DMSO 0.044 ± 0.011 15.68 RESV 0.134 ± 0.005 5.16 CAU 0.129 ± 0.003 5.38 CA 0.137 ± 0.005 5.07 ",
  "metadata": {
    "Title of this paper": null,
    "Journal it was published in:": "Marine Drugs",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471837/"
  }
}