{
  "title": "Paper_485",
  "abstract": "pmc Radiol Case Rep Radiol Case Rep 2848 rcr Radiology Case Reports 1930-0433 Elsevier PMC12482299 PMC12482299.1 12482299 12482299 41035747 10.1016/j.radcr.2025.08.072 S1930-0433(25)00805-2 1 Case Report Veiled in Gynecomastia: A B3 breast lesion in a male patient with subsequent “upgrade” to invasive malignancy Hatrick Isobel MBBCh a b ⁎ Stafford Kirsten FRCR a Chhikara Ritu FRCPath a a b ⁎ 12 2025 20 9 2025 20 12 497236 6093 6098 22 5 2025 15 8 2025 23 8 2025 20 09 2025 01 10 2025 02 10 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). B3 breast lesions are a heterogeneous group with uncertain malignant potential. While female-specific guidelines often recommend vacuum-assisted excision (VAE) followed by surveillance, these strategies are less applicable in male patients. This case report highlights a male patient initially diagnosed with a B3 lesion—specifically atypical intraductal epithelial proliferation (AIDEP)—that was later “upgraded” to invasive carcinoma and ductal carcinoma in situ (DCIS) following surgical excision. The case illustrates the limitations of current protocols when applied to men and supports considering surgical excision as a first-line management strategy in high-risk B3 lesions. It also highlights the potential diagnostic value of mammography in high-risk males, particularly when ultrasound findings are inconclusive. Overall, this report emphasizes the need for male-specific, evidence-based guidelines to ensure timely and accurate diagnosis and treatment of B3 breast lesions in men. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Abbreviations AIDEP atypical intraductal epithelial proliferation ADH atypical ductal hyperplasia DCIS ductal carcinoma in situ FEA flat epithelial atypia HER-2 human epithelial growth factor receptor 2 LCIS lobular carcinoma in situ LN lobular neoplasia MDT multidisciplinary team ROR risk of recurrence RS radial scars US ultrasound VAB vacuum assisted biopsy VAE vacuum-assisted excision WLE wide local excision Introduction B3 lesions comprise of a small group of breast diseases with uncertain and differing malignant transformation potentials [ 1 2 [1] [2] [3] 4 5 We know that atypical intraductal epithelial proliferation (AIDEP) has one of the highest risks of “upgrade” on further tissue sampling and a high risk of malignant transformation [ 1 3 [5] [6] [7] Case presentation A 75-year-old man was referred to the breast clinic by his GP with a few weeks' history of a right breast lump. There was no associated nipple discharge or left breast changes. Relevant in his past medical history was a history of prostate cancer in 2008; whilst undergoing treatment he developed bilateral gynecomastia which was treated with radiotherapy. He also had atrial fibrillation and had previously had a non-ST elevation myocardial infarction and mumps. His current medication included metoprolol, allopurinol, rivaroxaban, simvastatin and lansoprazole. He was a non-smoker and consumed moderate volumes of alcohol. There was no family history of breast or ovarian cancer. On examination, he had bilateral gynecomastia with an indeterminate tender lump in the right breast. There was no axillary lymphadenopathy and abdominal and testicular examination where unremarkable. He was referred to the breast radiology department for an ultrasound which demonstrated mild bilateral gynecomastia. In the right breast there was a more focal region of hypoechogenicity measuring 23 mm which corresponded with the palpable lump on examination (Fig. 1) Fig. 2 Fig. 1 US image of the right nipple. White arrow indicates the ill-defined hypoechoic lesion under the right nipple. The lesion measures 23 mm with no internal vascularity. Fig 1 Fig. 2 US image with a white arrow demonstrating a 14 G core biopsy needle targeting the lesion. 3 samples were obtained. Fig 2 The core biopsy samples were then sent for histology which demonstrated AIDEP, a B3 lesion, with no invasive malignancy observed. After discussion at the breast MDT, the decision was made to perform a wide local excision as further methods of methods of obtaining more tissue, such as a VAE or VAB (vacuum assisted excision or vacuum assisted biopsy), were not considered in a male patient. He proceeded to surgery and a WLE (wide local excision) was performed. The histology from the specimen came back as containing an 11 mm grade 3 invasive mammary carcinoma amidst high grade solid and comedo DCIS. There was no lymphovascular invasion however the margins of the specimen were involved by the tumor. The tumor was oestrogen and progesterone receptor positive and HER2 negative ( Fig. 3 Fig. 3 Histopathology from the wide local excision. Left image: the arrow demonstrates DCIS with comedo necrosis centrally. Right image: the arrow demonstrates the area of invasive malignancy in the WLE sample. Fig 3 The case was then again discussed at the breast MDT and the decision was made to proceed with a completion mastectomy and a sentinel lymph node biopsy. An US of the axilla was also performed which demonstrated sonographically normal lymph nodes. He proceeded with a completion mastectomy and sentinel lymph node biopsy which showed 4 mm of residual grade 3 invasive mammary carcinoma adjacent to the previous WLE cavity, which was subsequently completely excised by at least 5 mm. 4 lymph nodes were sampled, all of which were free of any metastases. His overall staging was therefore pT1c N0. Genetic testing was performed which was negative for pathogenic mutations. In addition, Prosigna was performed on the specimen as per guidelines which came back as Luminal B type with a high risk of recurrence of 26% at 10 years and with a ROR (risk of recurrence) score of 76. In light of this, adjuvant chemotherapy was commenced consisting of 3 cycles of docetaxel and 3 cycles of epirubicin and cyclophosphamide as well as hormonal treatment and zoledronic acid. The surveillance plan decided on was a mammogram of the contralateral left breast for 5 years, as per guidance for women. The baseline left mammogram demonstrated gynecomastia (M2) however no focal mass lesion or calcification ( Fig. 4 Fig. 4 Baseline Cranial-Caudal (left image) and Medial Lateral Oblique (right image) mammograms of the contralateral (left) breast. The white arrows demonstrate the dense retroareolar fibroglandular tissue however no focal mass lesions or abnormal calcification. LT M2. Fig 4 Discussion The management of B3 lesions is complex and under constant debate for several reasons. Firstly, they comprise a heterogenous group of lesions either with or without atypia. A few examples include, atypical ductal hyperplasia (ADH), also referred to as AIDEP, flat epithelial atypia (FEA), lobular neoplasia (LN), including invasive lobular carcinoma in situ (LCIS), radial scars and papillary lesions [ 1 2 1 4 3 Many studies that have assessed the “upgrade” to malignancy rates of different B3 lesions after surgical excision and results suggest that AIDEP are considered B3 lesions with one of the highest rates of “upgrade” to malignancy on further tissue sampling [ 3 [5] [6] [7] 6 7 Another single institution study analyzed 192 B3 lesions initially diagnosed on primary tissue sampling that subsequently underwent surgical excision and demonstrated that the “upgrade” after further tissue sampling of AIDEP was as high as 28.6% compared to 0% for RS [ 3 5 Currently there is no uniform consensus for the management of these B3 lesions regarding whether these lesions should be treated with surgical excision or vacuum assisted excision (VAE). Guidelines recommended by AGO (Arbeitsgemeinschaft Gynäkologische Onkologie, German Gynaecogical Oncology Group) Task Force and The Second International Consensus Conference on B3 lesions, advice surgical excision as the first option to pursue after a B3 lesion is identified after a core biopsy [ 5 4 5 In June 2023, at the 3rd International consensus conference of B3 lesions, the majority of panellists recommended surgical excision after a diagnosis of ADH/AIDEP or Phyllodes tumors on core biopsy. For other B3 lesions VAE was recommended [ 8 9 In this case discussed above, as part of the current UK guidance, despite the AIDEP being identified on core biopsy, this patient would routinely have been managed with VAE if he had been a female. As a male, he proceeded to surgical excision which identified an 11 mm grade 3 invasive mammary carcinoma and DCIS. This case is an example of a AIDEP B3 lesion being “upgraded” on further tissue sampling. We know that male breast cancer is rare, accounting for 1%-2% of all breast cancers around the world [ 10 11 [11] [12] [13] 12 14 The diagnosis and management of male breast cancer is conferred by research in women [ 15 16 17 16 14 From our literature search, there are very few case reports on ADH/AIDEP in males and no documented examples of AIDEP in males with subsequent “upgrade” to invasive mammary carcinoma and DCIS. There is also no specific guidance on the management of B3 lesions in male patients specifically. Given the lack of breast tissue in men, a surgical excision was performed over the usual UK guidance of VAE in this case [ 5 This case highlights the caution that needs to be taken when assessing breast lumps in men, particularly with significant risk factors such as prior breast radiotherapy. The B3 lesion was “upgraded” to invasive mammary carcinoma with DCIS, which was not identified on the primary core biopsy. No mammographic imaging was performed prior to surgical excision. The case raises the question as to whether mammography should be considered in these patients in with significant risk factors – would the DCIS have been visible on mammogram? In addition, traditionally as per current UK practice, women with AIDEP/ADH on core biopsy would proceed to VAE, which was not possible in this case, hence surgical excision was advised. The literature reviewed in this case report suggests that in cases of AIDEP/ADH, given the high risk of “upgrade” to malignancy, surgical excision should be the first line management over VAE. Should we therefore be considering excision biopsy for all AIDEP/ADH cases in both men and women going forward? Conclusion Care needs to be taken when using US to assess unilateral breast lumps in men with significant risk factors to ensure that amidst the gynecomastia, there is not a discrete breast lesion. This case highlights a possible advantage of using 2 methods of imaging, US and mammography. Would mammography have detected calcification not visible on US resulting in a change of management? And finally, current UK guidance on the management of B3 lesions, regardless of their subtype, is for VAE. On reviewing the literature, the consensus appears to be that management of AIDEP/ADH, given their high risk of malignant “upgrade,” should be surgical excision. Patient consent Written informed consent was obtained from the patient for the publication of the radiological images included in this case report. The patient was informed about the nature and purpose of the publication, that the information would be made publicly available in a scientific journal, and that it could be accessible through search engines. The patient was also informed that the material cannot be withdrawn once published. The authors confirm that all identifiable information has been removed or anonymized. The images used are exclusively radiological and do not allow patient identification. The written consent is held by the authors in accordance with ethical requirements, but it cannot be provided to the journal. References 1 Bellini C. Cucchiari J. Di Naro F. De Benedetto D. Bicchieraj G. Franconeri A., et al. Breast lesions of uncertain malignant potential (B3) and the risk of breast cancer development: a long-term follow-up study Cancers 15 13 2023 3521 37444630 10.3390/cancers15133521 PMC10340484 2 Pinder S.E. Shaaban A. Deb R. Desai A. Gandhi A. Lee A.H.S. NHS Breast Screening multidisciplinary working group guidelines for the diagnosis and management of breast lesions of uncertain malignant potential on core biopsy (B3 lesions) Clin Radiol 73 8 2018 682 692 29773220 10.1016/j.crad.2018.04.004 3 Mohrmann S. Maier-Bode A. Dietzel F. Reinecke P. Krawczyk N. Kaleta T. Malignancy rate and Malignancy risk assessment in different lesions of uncertain malignant potential in the breast (B3 Lesions): an analysis of 192 cases from a single institution Breast Care 17 2 2021 159 165 35702494 10.1159/000517109 PMC9149469 4 Girardi V. Guaragni M. Ruzzenenti N. Palmieri F. Fogazzi G. Cozzi A. B3 Lesions at vacuum-assisted breast biopsy under ultrasound or mammography guidance: a single-center experience on 3634 consecutive biopsies Cancers 13 21 2021 5443 34771606 10.3390/cancers13215443 PMC8582448 5 Rubio I.T. Wyld L. Marotti L. Athanasiou A. Regitnig P. Catanuto G. European guidelines for the diagnosis, treatment and follow-up of breast lesions with uncertain malignant potential (B3 lesions) developed jointly by EUSOMA, EUSOBI, ESP (BWG) and ESSO European J Sur Oncol 50 1 2024 107292 10.1016/j.ejso.2023.107292 38061151 6 Dunne E.C. Quinn E.M. Stokes M. Barry J.M. Kell M. Flanagan F. Upgrade rates and outcomes of screen-detected atypical intraductal epithelial proliferation (AIDEP) diagnosed on core needle biopsy Breast Disease 40 3 2021 155 160 10.3233/BD-201031 33749633 7 Renshaw A.A. Gould E.W. Long term clinical follow-up of atypical ductal hyperplasia and lobular carcinoma in situ in breast core needle biopsies Pathol 48 1 2016 25 29 10.1016/j.pathol.2015.11.015 27020205 8 Elfgen C. Leo C. Kubik-Huch R.A. Muenst S. Schmidt N. Quinn C. Third International Consensus Conference on lesions of uncertain malignant potential in the breast (B3 lesions) Virchows Archiv: Int J Pathol 483 1 2023 5 20 10.1007/s00428-023-03566-x PMC10326140 37330436 9 Schiaffino S. Calabrese M. Melani E.F. Trimbolli R.M. Cozzi A. Carbonara L.A. Upgrade rate of percutaneously diagnosed pure Atypical ductal hyperplasia; systematic review and meta-analysis of 6458 lesions Radiol 294 1 2020 76 86 10.1148/radiol.2019190748 31660803 10 AlSharif S. Alshamrani K.M. Scaranelo A. Khoumais N Subahi A. Mesurolle B. Unusual male breast lesions J Clin Imag Sci 11 2021 21 10.25259/JCIS_43_20211 PMC8088480 33948337 11 Tian C. Alvarado R. Kim T. Slostad J. Male ductal carcinoma in situ: diagnosis and management of a rare disease in men BMJ Case Rep 17 3 2024 e256608–8 10.1136/bcr-2023-256608 PMC10952870 38499353 12 Zaesim A. Nguyen V. Scarborough C.S Pure low-grade DCIS in a male patient: a case report J Surg Case Rep 5 2018 1 3 10.1093/jscr/rjy109 PMC5960996 29876051 13 Chern J. Liao L. Baraldi R. Tinney E. Hendershott K. Germaine P. Case report: ductal carcinoma In situ in the male breast Case Report Radiol 2012 2012 532527 10.1155/2012/532527 PMC3463909 23056988 14 Woods R.W. Salkowski L.R. Elezaby M. Burnside E.S. Strigel R.M. Fowler A.M. Image-based screening for men at high risk for breast cancer: benefits and drawbacks Clinical Imaging. 60 1 2020 84 89 31864206 10.1016/j.clinimag.2019.11.005 PMC7242122 15 Shin K. Whitman G.J. Clinical indications for mammography in men and correlation with breast cancer Curr Probl Diagn Radiol 50 6 2020 292 798 10.1067/j.cpradiol.2020.11.001 33250296 16 Healy N.A. Parag Y. Wallis M.G. Tanner J. Kilburn-Toppin F. Outcomes of male patients attending the symptomatic breast unit: adherence to local and national imaging guidelines and effectiveness of clinical examination and imaging in detecting male breast cancer Clin Radiol 77 1 2021 Available from: https://www.sciencedirect.com/science/article/pii/S0009926021004736 10.1016/j.crad.2021.09.018 34716007 17 The Royal College of Radiologists. Guidance on screening and symptomatic breast imaging Fourth edition. 2019. Available from: https://www.rcr.ac.uk/media/0dkh5y5d/rcr-publications_guidance-on-screening-and-symptomatic-breast-imaging-fourth-edition_november-2019.pdf Competing Interests: The authors declare the following financial interests/personal relationships which may be considered as potential competing interests: Isobel Hatrick reports administrative support and writing assistance were provided by Frimley Park Hospital. Isobel Hatrick reports a relationship with Frimley Park Hospital that includes: employment. If there are other authors, they declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. ",
  "metadata": {
    "Title of this paper": "Outcomes of male patients attending the symptomatic breast unit: adherence to local and national imaging guidelines and effectiveness of clinical examination and imaging in detecting male breast cancer",
    "Journal it was published in:": "Radiology Case Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482299/"
  }
}