{
  "title": "Paper_137",
  "abstract": "pmc Cell Rep Med Cell Rep Med 3954 cellrepsmed Cell Reports Medicine 2666-3791 Elsevier PMC12490250 PMC12490250.1 12490250 12490250 40858107 10.1016/j.xcrm.2025.102310 S2666-3791(25)00383-0 102310 1 Article An age-related decrease in leptin contributes to CD8 + Wang Feixiang 1 2 10 Bao Rujuan 2 10 Xu Shuiyu 3 10 Li Wenyan 4 10 Huang Haiyan 3 10 Li Runchang 5 10 Ding Xinyu 2 Zhang Yuerong 2 Yu Xiaoyan 2 Han Qiaoqiao 2 Du Xian 2 Wan Jie 2 Li Song 2 Xiao Yichuan 6 Zhao Ren 3 Cui Xingang 4 Ye Youqiong youqiong.ye@shsmu.edu.cn 2 ∗ Sun Jiayuan xkyyjysun@163.com 5 ∗∗ Zheng Junke zhengjunke@shsmu.edu.cn 7 ∗∗∗ Chen Guo-Qiang chengq@shsmu.edu.cn 8 9 ∗∗∗∗ Zou Qiang qzou1984@sjtu.edu.cn 2 11 ∗∗∗∗∗ 1 2 3 4 5 6 7 8 9 ∗ youqiong.ye@shsmu.edu.cn ∗∗ xkyyjysun@163.com ∗∗∗ zhengjunke@shsmu.edu.cn ∗∗∗∗ chengq@shsmu.edu.cn ∗∗∗∗∗ qzou1984@sjtu.edu.cn 10 These authors contributed equally 11 Lead contact 16 9 2025 25 8 2025 6 9 498186 102310 15 1 2025 17 3 2025 28 7 2025 25 08 2025 03 10 2025 03 10 2025 © 2025 The Author(s) 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Summary T cell dysfunction with age underlies an increased incidence of cancer in elderly individuals; however, how T cell aging is triggered in the tumor microenvironment is unclear. Here, we show that an age-associated reduction in adipocyte-derived leptin contributes to the accumulation of tumor-infiltrating senescent CD8 + + + + + Graphical abstract Highlights • Intratumoral senescent CD8 + • Adipocyte-derived leptin levels decrease with age • Age-related changes in leptin contribute to intratumoral CD8 + • Leptin signaling prevents p38-dependent CD8 + The interplay between age-associated metabolic dysfunction and T cell aging in the tumor microenvironment (TME) remains unclear. Wang et al. reveal that an age-related decrease in adipocyte-derived leptin levels contributes to tumor-infiltrating CD8 + Keywords CD8 + aging antitumor immunity leptin T cell senescence pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Published: August 25, 2025 Introduction Aging is a major risk factor for various cancers, and patients aged 65 years or older represent up to 60% of newly diagnosed cancer patients. Aging results in remodeling of T cell immunity, causing poor clinical outcomes in patients with cancer. 1 2 3 , 4 1 The disruption of cellular and physiological integrity caused by the molecular hallmarks of aging drives age-associated T cell dysfunction. 1 1 5 , 6 , 7 , 8 9 , 10 , 11 12 , 13 In this study, we showed that an age-related decrease in leptin levels accelerates CD8 + + + + + Results Intratumoral senescent CD8 + To assess the significance of age-associated changes in CD8 + Table S1 14 , 15 , 16 , 17 , 18 , 19 , 20 , 21 , 22 , 23 , 24 , 25 , 26 , 27 , 28 , 29 + + Figure 1 + CDKN2A Figures 1 MAPK1 CDKN2A NCR3 CD244 KLRs + Figure S1 + Figure 1 + CDKN2A 30 + Figure S1 Table S2 + Figure S1 + 31 + + Figure S1 + + Figures 1 + + + + + + Figure S1 + + Figures S1 + + Figures S1 + CDKN2A Figure S1 + 32 , 33 , 34 , 35 + Figures S2 + Figure S3 Table S3 Tables S4 S5 + Figure S3 + + Figure 1 + Figures S3 + Figure S3 + Figure 1 Intratumoral senescent CD8 + (A) Uniform manifold approximation and projection (UMAP) of tumor-infiltrating CD8 + + n n (B and C) Violin plots of senescence score (B) and CDKN2A + (D) UMAP of top 10 frequent TCR clones (shown as red dots) in CD8 + (E) Pie charts showing the percentage of different TCR clone types in the non-senescent and senescent CD8 + (F) Inverse Simpson index representing the diversity of TCR repertoire in the non-senescent and senescent tumor-infiltrating CD8 + (G) Percentages of different TCR clone types in the non-senescent and senescent tumor-infiltrating CD8 + (H) Correlation between age and the percentage of p16 + + n n n Spearman’s correlation coefficient was performed (H). See also Figures S1–S3 Intratumoral senescent CD8 + We next analyzed the populations of intratumor CD8 + 36 + Figures 2 S4 + Figure 2 + Figure S4 Il6 Il1b Ccl2 Ccl5 + + Figure S4 − + + + Figure S4 + + + + Figure 2 + + Figure 2 + + + Figures 2 + + in vitro + Figure S4 + Figure S4 + + + Figure 2 + + Figure 2 Figure S4 + + Figure S4 + + Figure S4 + + + Figure S4 In vivo + Figure S4 + Figure 2 Intratumoral senescent CD8 + (A) UMAP of tumor-infiltrating CD8 + + (B and C) Violin plots of senescence score (B) and Cdkn2a + (D) Flow cytometric analysis of the percentage of p16 + + 5 6 5 n (E) Tumor growth curve of C57BL/6 mice after OT-I T cell transfer. 5 × 10 5 5 + n (F and G) Flow cytometric analysis of p16 + + + 257-264 n (H) Clusters of tumor-infiltrating CD8 + + 5 (I) Flow cytometric analysis of the percentage of p16 + + n Data are representative of three independent experiments and shown as the mean ± SEM. p p Figure S4 Aging results in a significant reduction in systemic leptin Age-related metabolic perturbations compromise the T cell response against cancer. 1 + Figure 3 Figure 3 Figure 3 in vitro + + Figure 3 + Figures S5 Figures S5 + Figures 3 + Figure 3 + Figure S5 Figures 3 S5 + + Figure S5 Figure 3 Aging results in a significant reduction in systemic leptin (A) Serum samples were collected for cytokine assay at day 7 after tumor injection from C57BL/6 WT mice injected subcutaneously (s.c.) with 5 × 10 5 (B) ELISA analysis of serum leptin from C57BL/6 WT mice injected s.c. with 5 × 10 5 n n (C) Flow cytometric analysis of the expression of p16 in tumor cell-polarized senescent CD8 + in vitro n + + (D and E) Gene ontology enrichment analysis of gene sets in tumor-infiltrating senescent CD8 + (F) Gene set enrichment analysis (GSEA) enrichment plot of indicated pathways in senescent CD8 + (G) ELISA analysis of serum leptin from patients with CRC ( n n n Data are representative of three independent experiments and shown as the mean ± SEM. p p p Figure S5 An age-associated decrease in leptin promotes CD8 + To verify the function of leptin signaling in CD8 + in vivo Lepr Lepr fl/fl Cd4 Lepr +/+ Cd4 Lepr fl/fl Cd4 Lepr +/+ Cd4 Lepr fl/fl Cd4 Figures 4 Lepr fl/fl Cd4 + + Figures 4 + + + Figure 4 + Figures 4 + + Figure 4 + + + Figure 4 + Figure 4 + Figure 4 Age-related decline in leptin promotes CD8 + (A and B) Tumor growth curve (A) and survival curve (B) of Lepr +/+ Cd4 Lepr fl/fl Cd4 5 n (C and D) Flow cytometric analysis of the expression of p16, the level of C 12 + Lepr +/+ Cd4 Lepr fl/fl Cd4 n (E and F) Tumor growth curve (E) and survival curve (F) of 20- to 24-month-old C57/BL6 mice injected s.c. with 5 × 10 5 n (G) Flow cytometric analysis of the expression of p16, the level of C 12 + n (H) Tumor growth curve of 20- to 24-month-old C57/BL6 mice s.c. injected with 2 × 10 5 n Data are representative of three independent experiments and shown as the mean ± SEM. p p p Leptin signaling prevents p38-dependent CD8 + To investigate how leptin signaling regulates CD8 + in vitro + + Figures 5 + Figure 5 + 37 Mapk14 Mapk14 fl/fl Cd4 + + in vitro Figure 5 + Figure 5 + Mapk14 +/+ Cd4 Mapk14 fl/fl Cd4 + + + Figures 5 Mapk14 fl/fl Cd4 + + + Figures 5 + Mapk14 fl/fl Cd4 Figure 5 + Figure 5 Leptin signaling prevents p38-dependent CD8 + (A) Gene ontology enrichment analysis of gene sets in tumor cell-polarized senescent GFP + + in vitro + in vitro (B) Gene set enrichment analysis (GSEA) enrichment plot of indicated pathways in tumor cell-polarized senescent GFP + + in vitro (C) Flow cytometric analysis of the level of p-p38 in tumor cell-polarized senescent GFP + + in vitro n (D) Flow cytometric analysis of the expression of p16 and the level of C 12 Mapk14 +/+ Cd4 Mapk14 fl/fl Cd4 + in vitro n (E) Tumor growth curve of Mapk14 +/+ Cd4 Mapk14 fl/fl Cd4 5 n (F) Flow cytometric analysis of the percentage of p16, the level of C 12 + Mapk14 +/+ Cd4 Mapk14 fl/fl Cd4 n (G) Tumor growth curve of Mapk14 +/+ Cd4 Mapk14 fl/fl Cd4 5 n Data are representative of three independent experiments and shown as the mean ± SEM. Two-tailed Student’s t test (C), one-way ANOVA (D and F), and two-way ANOVA (E and G) were performed. ∗ p p Adipocyte-derived leptin levels decrease with age Leptin is mainly produced by white adipose tissue (WAT). Interestingly, we observed a significant negative correlation between adipocyte-derived leptin levels and age ( Figure S6 38 LEPTIN Figures 6 + 39 Figures 6 + + Figures 6 S6 12 + Figure S6 Figure S6 + Figure 6 + Figures S6 Figure S7 Figures S7 + Figures 6 + Figures S7 + Figure S7 Figure S7 + Figure 6 + Figure 6 Adipocyte-derived leptin levels decrease with age (A) UMAP of indicated cell subsets from human white adipose tissues (WATs) in the database GSE176171 (B and C) UMAP plots (B) and statistical analysis (C) showing the transcriptional level of LEPTIN (D) ELISA analysis of serum leptin from young mice (3–4 months) at day 14 after eWAT surgical removal ( n (E) Tumor growth curve of tumor-bearing mice (3–4 months) injected with 5 × 10 5 n (F) Flow cytometric analysis of the expression of p16, the level of C 12 + n (G) Tumor growth curve of tumor-bearing mice (3–4 months) injected with 2 × 10 5 n (H) ELISA analysis of serum leptin from aged mice (20–24 months) at day 14 after orlistat treatment ( n (I) Tumor growth curve of control (Ctrl) and orlistat-treated 20- to 24-month-old mice injected with 2 × 10 5 n (J) Flow cytometric analysis of the percentage of p16, the level of C 12 + n (K) Tumor growth curve of Ctrl or orlistat-treated 20- to 24-month-old mice injected with 2 × 10 5 n Data are representative of three independent experiments and shown as the mean ± SEM. p p p Figures S6 S7 Intratumoral CD8 + To investigate the clinical relevance of these findings in humans, we further collected serum and cancer samples from patients with RCC, LC, and CRC. In RCC patients, the circulating leptin concentration was negatively correlated with age and the percentage of tumor-infiltrating senescent p16 + + Figures 7 Figures 7 + Figure 7 + + Figure 7 Figure 7 + + Figure 7 Intratumoral CD8 + (A) Plasma leptin concentration from RCC patients was determined by ELISA ( n (B and C) Correlation between plasma leptin and age (B) and the percentage of p16 + + n (D and E) Correlation between plasma leptin and age (D) and the percentage of p16 + + n (F) Plasma leptin concentration from CRC patients was determined by ELISA ( n (G and H) Correlation between plasma leptin and age (G) and the percentage of p16 + + n (I) Correlation between BMI and plasma leptin (left) and the percentage of p16 + + n (J) Correlation between BMI and plasma leptin (left) or the percentage of p16 + + n Spearman’s correlation coefficient was performed (B, C, D, E, and G–J). Pearson correlation R square (R 2 p Discussion In this study, our data demonstrated that an age-associated decrease in leptin promotes CD8 + + + + + + + Aging is associated with the accumulation of unique age-related T cell types in the periphery. 1 + – 40 , 41 1 + 42 + + + + + Targeting T cell senescence enhances antitumor immunity, 43 + + + + + + Recent studies have revealed that leptin signaling promotes T cell activation, proliferation, differentiation, and effector functions. 44 , 45 , 46 , 47 + − + 48 49 , 50 13 + + + + A previous study showed that pharmacological inhibition of fatty acid synthase (FASN) by orlistat significantly reduced tumor growth in Rag1 51 + + + + This study extends the understanding of the regulation of age-associated T cell dysfunction by age-related metabolic alterations. Our results suggest that moderate amounts of adipose tissue may be beneficial for supporting healthy leptin levels and maintaining CD8 + Limitations of the study Obesity is a well-known risk factor for cancer development and strongly associated with increased levels of leptin. In our study, we detected plasma leptin from 34 patients with RCC, 18 patients with CRC, and 14 patients with LC. However, there was only one RCC patient with obesity (BMI > 30). Due to the limited sample size, we excluded the data from the obese RCC patient. Our current findings only suggest that aging results in a significant reduction in systemic leptin in non-obese cancer patients. Additional studies in this area are required to clarify the interplay between elevated leptin levels and antitumor CD8 + Resource availability Lead contact Further information and requests for resources and reagents should be directed to and will be fulfilled by the lead contact, Qiang Zou ( qzou1984@sjtu.edu.cn Material availability This study did not generate new unique reagents. Data and code availability  • The raw bulk RNA-seq data of mouse CD8 + + + GSE302214 • This paper does not report original code. • Any additional information required to reanalyze the data reported in this paper is available from the lead contact Acknowledgments This study was supported by grants from the National Natural Science Foundation of China 82430054 82225020 32300752 Shanghai Science and Technology Commission 20JC1410100 National Key Research and Development Program of China 2020YFA0803603 2021YFA1301402 Author contributions F.W., R.B., S.X., W.L., H.H., and R.L. designed and performed the experiments, prepared the figures, and wrote the manuscript; X. Ding, Y.Z., X.Y., Q.H., X. Du, J.W., S.L., Y.X., R.Z., and X.C. contributed to the performance of the experiments; Y.Y., J.S., J.Z., G.-Q.C., and Q.Z. supervised the work and wrote the manuscript. Declaration of interests The authors declare no competing interests. STAR★Methods Key resources table  REAGENT or RESOURCE SOURCE IDENTIFIER Antibodies Anti-mouse CD8a (Clone 53-6.7) eBioscience Cat# 25-0081-82; AB_469584 Anti-mouse-IFN gamma (Clone XMG1.2) eBioscience Cat# 17-7311-82; AB_469504 Anti-mouse-TNF alpha (Clone MP6-XT22) eBioscience Cat# 12-7321-82; AB_466199 Anti-human CD103 (Clone Ber-ACT8) eBioscience Cat# 11-1037-41; AB_1659665 Anti-human CD39 (Clone eBioA1(A1)) eBioscience Cat# 17-0399-42; AB_1963578 Anti-human CD57 (Clone TB01(TBO1)) eBioscience Cat# 48-0577-42; AB_2016680 Anti-human CD314 (Clone 1D11) eBioscience Cat# 11-5878-42; AB_2572509 Anti-human CD28 (Clone CD28.2) eBioscience Cat# 11-0289-42; AB_10733610 Anti-mouse-CD3e (Clone 145-2C11) eBioscience Cat# 17-0031-83; AB_469316 Anti-mouse-Ki-67 (Clone SolA15) eBioscience Cat# 12-5698-82; AB_11150954 Anti-mouse CD366 (TIM3) (Clone RMT3-23) eBioscience Cat# 25-5870-82; AB_2573483 Anti-mouse 45 (Clone 30-F11) eBioscience Cat# 17-0451-82; AB_469392 Anti-mouse CD279 (PD-1) (Clone 29F.1A12) BioLegend Cat# 135213; AB_10689633 Anti-human CD8a (Clone RPA-T8) eBioscience Cat# 17-0088-42; AB_10669564 P16 INK4A (Clone D7C1M) Rabbit mAb Cell Signaling Technology Cat# 82548; AB_2799995 p-p38 (Thr180/Tyr182) (Clone 28B10) mAb Cell Signaling Technology Cat# 4552; AB_331303 Anti-CDKN2A/p16INK4a Abcam Cat# ab211542; AB_2891084 Goat anti-Rabbit IgG Second Antibody, Alexa FluorTM 488 Invitrogen Cat# A11034; AB_2541675 Anti-H2A.X Phospho (Ser 139) (Clone 2F3) BioLegend Cat# 613420; AB_2715785 Anti-GFP Abcam Cat# ab6556; AB_305564 Anti-mouse CD3e (Clone 145-2C11) ThermoFisher Cat# 16-0031-86; AB_468849 Anti-mouse CD28 (Clone 37.51) ThermoFisher Cat# 16-0281-86; AB_468923 InVivoMAb anti-mouse PD-1 (RMP1-14) Bio X cell Cat# BE0146; AB_10949053 InVivoMAb rat IgG2b isotype Control (2A3) Bio X cell Cat# BE0089; AB_1107769 InVivoMAb anti-mouse CD8α (2.43) Bio X cell Cat# BE0061; AB_1125541 InVivoMAb rat IgG2b isotype Control (LTF-2) Bio X cell Cat# BE0090; AB_1107780 Biological samples Human colorectal cancer (CRC) tissues Ruijin Hospital N/A Human colorectal cancer (CRC) patient-derived blood Ruijin Hospital N/A Human lung cancer (LC) tissues Shanghai Chest Hospital N/A Human lung cancer (LC) patient-derived blood Shanghai Chest Hospital N/A Human renal cell carcinoma (RCC) tissues Xinhua Hospital N/A Human renal cell carcinoma (RCC) patient-derived blood Xinhua Hospital N/A Human renal cell carcinoma (RCC) para-tumor tissues Xinhua Hospital N/A Chemicals, peptides, and recombinant proteins Phorbol 12-myristate 13-acetate (PMA) Sigma-Aldrich Cat# P8139 Ionomycin Sigma-Aldrich Cat# I3909 Monensin eBioscience Cat# 65-4505-51 Fixation/Permeabilization Concentrate eBioscience Cat# 00-5123-43 Fixation/Permeabilization Diluent eBioscience Cat# 00-5233-56 Permeabilization buffer 10× eBioscience Cat# 00-8333-56 Protease Inhibitor MedChem Express Cat# HY-K0010 Phosphatase Inhibitor MedChem Express Cat# HY-K0021 DNase I Roche Cat# 10104159001 Collagenase IV Sigma-Aldrich Cat# C5138 Collagenase VIII Sigma-Aldrich Cat# C2139 Percoll GE Healthcare Cat# 17-0891-09 Ficoll-Paque Plus GE Healthcare Cat# 17-1440-03 C 12 MedChem Express Cat# HY-126839 Bafilomycin A1 Selleck Cat# S1413 Dasatinib Selleck Cat# S1021 Quercetin Sigma Aldrich Cat# Q4951 Phosal 50 PG MedChem Express Cat# HY-Y1903 PEG-400 Sigma Aldrich Cat# 91893 Tween-80 Aladdin Cat# T104865 Leptin R&D Systems Cat# 498.OB Orlistat MedChem Express Cat# HY-B0218 Ovalbumin (257–264) chicken Sigma-Aldrich Cat# S7951 TRIzol Reagent Invitrogen Cat# 15596018 Recombinant Mouse IL-2 R&D systems Cat# 402-ML/CF BODIPY™ 493/503 Invitrogen Cat# D3922 BODIPY™ FL C 12 Invitrogen Cat# D3822 NBD cholesterol Invitrogen Cat# N1148 HLA-A∗02:01 CMV pp65 Tetramer-NLVPMVATV MBL Cat# TS-0010 HLA-A∗02:01 EBV LMP2 Tetramer-FLYALALLL MBL Cat# TS-M069 HLA-A∗02:01 Influenza M1 Tetramer-GILGFVFTL MBL Cat# TS-0012 HLA-A∗02:01 NY-ESO-1 (SLLMWITQC) MBL Cat# TS-M011 Hieff® qPCR SYBR Green Master Mix Yeasen Cat# 11201ES08 Critical commercial assays Mouse Leptin ELISA Kit Beyotime Cat# PL696 Human Leptin ELISA Kit Beyotime Cat# PL700 Proteome Profiler Mouse XL Cytokine Array Kit R&D Systems Cat# ARY028 CD8 MicroBeads Mouse Miltenyi Biotec Cat# 130-117-044 CD11c MicroBeads Mouse Miltenyi Biotec Cat# 130-125-835 Human CMV Detection Kit DAAN GENE Cat# DA0123 Human Telomere Detection Kit Biowing Applied Biotechnology Co.,Ltd Cat# TL50 Deposited data Bulk RNA-seq data of mouse CD8 + This paper GSA: CRA014097 scRNA-seq of mouse CD3 + This paper GSA: CRA014145 Paired scRNA-seq and scTCR-seq of CD8 + This paper GEO: GSE302214 scRNA-seq of human CD8 + Kim et al. 32 GEO: GSE131907 scRNA-seq of human CD8 + Lee et al. 33 GEO: GSE132465 scRNA-seq of human CD8 + Zhang et al. 34 GEO: GSE146771 scRNA-seq of human CD8 + Qi et al. 35 GSA: HRA000979 scRNA-seq of CD8 + Zhang et al. 36 https://singlecell.broadinstitute.org/single_cell/study/SCP1261 snRNA-seq of human white adipose tissues Emont et al. 38 GEO: GSE176171 Experimental models: Cell lines Mouse MC38 colon cancer cells Kerafast Cat# ENH204-FP; Mouse B16-F10 melanoma cells ATCC Cat# CRL-6475; Mouse LLC cancer cells Cell Bank of Chinese Acedemy of Sciences Seria no. TCM 7 Experimental models: Organisms/strains Mouse: CD4 The Jackson Laboratory Cat# JAX:022071; Mouse: Lepr GemPharmatech Strain NO.T052367 Mouse: Mapk14 Shanghai Model Organism Center NM-CKO-2102209 Mouse: Cdkn2a GemPharmatech Strain NO.T054505 Mouse: OT-I mice The Jackson Laboratory Cat# JAX:003831; Software and algorithms GraphPad Prism 8.0 GraphPad https://www.graphpad.com/ FlowJo (Version 10.0) FlowJo https://www.flowjo.com/ R v4.1.0 R Core Team https://www.r-project.org/ bcl2fastq2 (v2.20) Illumina https://support.illumina.com/sequencing/sequencing_software/bcl2fastq-conversion-software.html Other BD LSRFortessa X20 BD Bioscience N/A BD FACSAria III BD Bioscience N/A Experimental model and study participant details Human cancer and plasma samples Human colorectal cancer and plasma samples were obtained at Ruijin Hospital, Shanghai Jiao Tong University School of Medicine ( Tables S1 S2 Table S3 Tables S4 S5 Tables S1 S2 S3 S4 S5 Mice Lepr LoxP Lepr Cd4 Lepr +/+ Cd4 Lepr fl/fl Cd4 Mapk14 LoxP Mapk14 Cd4 Mapk14 +/+ Cd4 Mapk14 fl/fl Cd4 Cell lines and cell culture Murine colon cancer cells (MC38) and murine Lewis lung carcinoma (LLC) cells were cultured in Dulbecco’s Modified Eagle’s Medium (DMEM) medium supplemented with 10% fetal bovine plasma (FBS) and 1% penicillin-streptomycin (PS). Murine B16-F10 melanoma cells were cultured in RPMI 1640 supplemented with 10% FBS. All cells were grown at 37°C with 5% CO 2 Method details Flow cytometry For analysis of surface markers, isolated cells were stained with diluted surface antibodies for 30 min at 4°C in PBS plus 2% FBS. For intracellular analysis of cytokine secretion, tumor-infiltrating lymphocytes were stimulated with phorbol 12-myristate 13-acetate (PMA), ionomycin, and monensin for 4–6 h following intracellular cytokine staining. For analysis of p16, in vitro + Tumor models MC38 tumor cells, LLC tumor cells, and B16-F10 tumor cells were injected. Tumor size was calculated as the length times the width. Analysis of tumor size was done in a blinded fashion after tumor injection. Lethality was defined as tumor size reaching to 225 mm 2 Tumor-infiltrating lymphocyte (TIL) isolation Fresh tumor tissues from tumor-bearing mice were cut into 1–3 mm size pieces and digested for 30 min at 37°C in the cell culture incubator. The digestion medium contained 10% FBS, 0.2 mg/mL Collagenase IV (Sigma Aldrich), and 20 μg/mL DNase I (Roche). Digested tissues were filtered through a 100 μm cell strainer. After removing the supernatant, resuspend to homogenize the pellets with 4 mL 40% Percoll (GE Healthcare). Carefully and slowly layer 3 mL 70% Percoll under the 40% Percoll. Centrifuge at 2500 rpm for 20 min, acceleration 1, and deceleration 1 at room temperature. Tumor-infiltrating lymphocytes were enriched at the interface of the 40% Percoll and 70% Percoll. For human-derived tumor-infiltrating lymphocyte enrichment, the tumor tissue samples were cut into 1–3 mm size and incubated with 1 μM dithiothreitol in a 37°C shaker for 30 min. After incubation, tissues were cut into pieces and digested for 1 h at 37°C in the cell culture incubator. The digestion medium contained 10% FBS, 0.625 mg/mL Collagenase VIII (Sigma Aldrich), and 20 μg/mL DNase I. Digested tissues were filtered through a 100 μm cell strainer. After removing the supernatant, resuspend to homogenize the pellets with 4 mL cell culture medium and layer 3 mL Ficoll (GE Healthcare) under the medium. Centrifuge at 2500 rpm for 20 min, acceleration 1, and deceleration 1 at room temperature. Tumor-infiltrating lymphocytes were enriched at the interface of the medium and Ficoll. ELISA Leptin levels of mouse or human plasma were detected by Mouse/Human Leptin ELISA Kit from Beyotime. Fresh peripheral blood from mice or patients was left to stand for 2 h, and the upper layer of liquid was collected and centrifuged at 2000 rpm for 10 min at 4°C. Then the supernatant was collected as serum. Serums were used to detect the leptin level according to the manufacturer’s protocol. Proteome cytokine array Cytokines and chemokines of young or old mice plasma were detected by The Proteome Profiler Mouse XL Cytokine Array Kit according to the manufacturer’s instructions. The Proteome Profiler Mouse XL Cytokine Array Kit was purchased from R&D Systems. Induction of CD8 + in vitro CD8 + + + Measurement of SA-β-Gal activity by flow cytometry T cells or tumor-infiltrating lymphocytes were cultured in fresh 1640 complete medium supplemented with 0.1 mM Bafilomycin A1 (Selleck) at 37°C, 5% CO 2 12 12 12 Drug treatments For in vivo in vitro in vivo in vitro in vivo Surgical removal of epididymal adipose tissue depot (eWAT) All procedures were conducted under aseptic conditions. Mice were anesthetized and the abdominal hair was shaved. Bilateral eWAT was exposed by making a mid-ventral abdominal incision. Then eWAT was removed without damaging the surrounding nerves or vessels. Antibiotics were used to prevent incision infection. For the sham group, bilateral eWAT was exposed, pulled out, and put back into epididymis through the same abdominal incision. Telomere length detection assay The telomere length of CD8 + + MHC tetramer staining assay For analysis of antigen-specific CD8 + + + Induction of tumor cells and MDSCs senescence in vitro B16-F10 tumor cells were treated with 10 μM etoposide for 24 h. Two days after treatment, tumor cells were collected for further analysis. Bone marrow cells were harvested from C57BL/6 mice (6–8 weeks old), cultured with RPMI 1640 medium containing 40 ng/mL GM-CSF and 40 ng/mL IL-6 for 6 days. Afterward, MDSCs were suspended and coculture with B16-F10 tumor cells for 24 h. MDSCs were isolated for further analysis. Tumor-infiltrating CD8 + Dendritic cells were isolated from C57/BL6 mice by CD11c Microbead Kit (130-108-338, Miltenyi) and culture in PRMI 1640 medium containing 100 ng/mL LPS and 250 ng/mL OVA 257-264 + + + Uptake of fatty acids, cholesterol, neutral lipid content assay For measuring uptake of fatty acids or neutral lipid content, tumor-infiltrating CD8 + 12 + Antigen-specific CD8 + Tumor-infiltrating lymphocytes were isolated from tumor-bearing mice and stimulated with 250 ng/mL OVA 257-264 Bulk RNA-sequencing analysis Tumor cell-polarized senescent CD8 + + p Single-cell sequencing sample and library preparation Fresh CRC tissue was washed with ice-cold PBS, cut into small pieces, and incubated in 10 mL of PBS containing DTT (65 mM) (supplemented with 10% FBS) at 37°C with shaking for 15 min. After two incubations with PBS, EDTA and DTT were removed. Small pieces of tissue were minced and digested with 0.38 mg/mL collagenase VIII and 0.1 mg/mL DNase I in complete RPMI 1640 medium (containing 10% FBS, 100 U/mL penicillin, and 100 mg/mL streptomycin) for 1 h at 37°C. After digestion, the tube was shaken vigorously for 5 min. The cells were mechanically dissociated using a 21-gauge syringe. The cells were filtered through a 100 μm filter and pelleted, and washed twice with PBS. Freshly prepared cell suspensions were performed immediately according to the manufacturer’s protocol of 10 × Chromium 5′ v2 kit (10× Genomics, Pleasanton, CA) and 10× Chromium Single Cell V(D)J Reagent Kits v1.1. 4-6-month-old C57BL/6 mice were inoculated with MC38 tumor cells and followed by D + Q treatment. 21 days post-tumor injection, CD3 + scRNA-seq data analysis Raw reads of scRNA-seq were processed with the Cell Ranger v.6.0.1 and mapped to GRCh38 reference genome for human samples and GRCm39 reference genome for mouse samples to generate matrices of gene counts by cell barcodes. Gene-barcodes matrices were analyzed with the R package Seurat v.4.4.0. Cells with ≥200 genes and genes expressed in ≥3 cells were used in subsequent analysis. Illumina bcl2fastq2 Conversion Software v2.20 was used to convert sequencing data into FASTQ format. FastQC v0.11.9 was used for data quality control. CellRanger v6.0.1was used to process, align to mapped to GRCh38 reference genome for human samples and GRCm39 reference genome for mouse samples to generate matrices of gene counts by cell barcodes, and summarize unique molecular identifier (UMI) counts in feature-barcode matrices. The genes expressed in fewer than three cells were excluded. The cells with gene count over 7500 or fewer than 200 were filtered, as were cells that obtained more than 5% mitochondrial genes. Cells with ≥200 genes and genes expressed in ≥3 cells were used in subsequent analysis for human tumor tissues. A global-scaling method was applied to normalize the data matrix using the LogNormalize function in Seurat v4.4.0. A log-transformation normalized data matrix was employed for downstream analysis. The batch effect between groups is removed through the R package harmony v1.2.0. To identify T cell subpopulations, lineage markers such as Cd3g, Cd3d, and Cd3e are used to confirm whether a cell population consists of T cells. After removing contaminating cells, clustering and dimensionality reduction are performed again following the standard Seurat workflow to obtain T cell subsets for further analysis. Senescent clustering for CD8 + To obtain senescent cluster of CD8 + + Differential signature pathways between groups in single-cell data First, the average expression of genes within each gene signature across cells is calculated, followed by averaging these scores across specified cell groups. Next, the “FindAllMarkers\" function from the Seurat package is used to identify signature pathways that show differential expression between groups. Pathways with a log 2 p Gene set enrichment analysis between groups in single-cell data First, the average expression of genes within each gene signature across cells was calculated, followed by averaging these scores across specified cell groups. The ranked gene list was then subjected to Gene Set Enrichment Analysis (GSEA) using LEP-related gene sets, GO BP, and Hallmark gene sets from MsigDB. Additionally, GSEA was performed with the R package clusterProfiler v4.0.5, and the results were visualized using the enrichplot v1.12.3 package. Single-cell TCR sequencing data analysis TCR reads were aligned to the GRCh38 human reference genome and consensus TCR annotation was performed using cellranger vdj (10× Genomics, v6.0.1). For each sample, the output file filtered_contig_annotations.csv contained the TCRα or CDR3 nucleotide sequences per chain for downstream analysis. Diversity estimates were performed using the Hill number and D50 diversity index, and the top clone proportions were calculated using R package scRepertoire v1.11.0. Quantification and statistical analysis Prism software (version 8.0) and R software (4.1.0) were used for data analysis and representation. Tumor growth curves were analyzed by two-way ANOVA. Survival curves were analyzed by log rank (Mantel-Cox) test. One-way ANOVA and two-tailed unpaired Student’s tests were performed to calculate p p p p p References 1 Han S. Georgiev P. Ringel A.E. Sharpe A.H. Haigis M.C. Age-associated remodeling of T cell immunity and metabolism Cell Metab. 35 2023 36 55 10.1016/j.cmet.2022.11.005 36473467 PMC10799654 2 Mittelbrunn M. Kroemer G. Hallmarks of T cell aging Nat. Immunol. 22 2021 687 698 10.1038/s41590-021-00927-z 33986548 3 Schreiber R.D. Old L.J. Smyth M.J. Cancer immunoediting: integrating immunity's roles in cancer suppression and promotion Science 331 2011 1565 1570 10.1126/science.1203486 21436444 4 Waldman A.D. Fritz J.M. Lenardo M.J. A guide to cancer immunotherapy: from T cell basic science to clinical practice Nat. Rev. Immunol. 20 2020 651 668 10.1038/s41577-020-0306-5 32433532 PMC7238960 5 Fan H. Xia S. Xiang J. Li Y. Ross M.O. Lim S.A. Yang F. Tu J. Xie L. Dougherty U. Trans-vaccenic acid reprograms CD8(+) T cells and anti-tumour immunity Nature 623 2023 1034 1043 10.1038/s41586-023-06749-3 37993715 PMC10686835 6 Nava Lauson C.B. Tiberti S. Corsetto P.A. Conte F. Tyagi P. Machwirth M. Ebert S. Loffreda A. Scheller L. Sheta D. Linoleic acid potentiates CD8(+) T cell metabolic fitness and antitumor immunity Cell Metab. 35 2023 633 650.e9 10.1016/j.cmet.2023.02.013 36898381 7 Park J. Hsueh P.C. Li Z. Ho P.C. Microenvironment-driven metabolic adaptations guiding CD8(+) T cell anti-tumor immunity Immunity 56 2023 32 42 10.1016/j.immuni.2022.12.008 36630916 8 Turbitt W.J. Buchta Rosean C. Weber K.S. Norian L.A. Obesity and CD8 T cell metabolism: Implications for anti-tumor immunity and cancer immunotherapy outcomes Immunol. Rev. 295 2020 203 219 10.1111/imr.12849 32157710 PMC7416819 9 Miwa S. Kashyap S. Chini E. von Zglinicki T. Mitochondrial dysfunction in cell senescence and aging J. Clin. Investig. 132 2022 e158447 10.1172/JCI158447 PMC9246372 35775483 10 Moller S.H. Hsueh P.C. Yu Y.R. Zhang L. Ho P.C. Metabolic programs tailor T cell immunity in viral infection, cancer, and aging Cell Metab. 34 2022 378 395 10.1016/j.cmet.2022.02.003 35235773 11 Spinelli J.B. Haigis M.C. The multifaceted contributions of mitochondria to cellular metabolism Nat. Cell Biol. 20 2018 745 754 10.1038/s41556-018-0124-1 29950572 PMC6541229 12 Fane M. Weeraratna A.T. How the ageing microenvironment influences tumour progression Nat. Rev. Cancer 20 2020 89 106 10.1038/s41568-019-0222-9 31836838 PMC7377404 13 Zhang Y. Yu X. Bao R. Huang H. Gu C. Lv Q. Han Q. Du X. Zhao X.Y. Ye Y. Dietary fructose-mediated adipocyte metabolism drives antitumor CD8(+) T cell responses Cell Metab. 35 2023 2107 2118.e6 10.1016/j.cmet.2023.09.011 37863051 14 Fridman A.L. Tainsky M.A. Critical pathways in cellular senescence and immortalization revealed by gene expression profiling Oncogene 27 2008 5975 5987 10.1038/onc.2008.213 18711403 PMC3843241 15 Tacutu R. Craig T. Budovsky A. Wuttke D. Lehmann G. Taranukha D. Costa J. Fraifeld V.E. de Magalhães J.P. Human Ageing Genomic Resources: integrated databases and tools for the biology and genetics of ageing Nucleic Acids Res. 41 2013 D1027 D1033 10.1093/nar/gks1155 23193293 PMC3531213 16 Purcell M. Kruger A. Tainsky M.A. Gene expression profiling of replicative and induced senescence Cell Cycle 13 2014 3927 3937 10.4161/15384101.2014.973327 25483067 PMC4615143 17 Zhao M. Chen L. Qu H. CSGene: a literature-based database for cell senescence genes and its application to identify critical cell aging pathways and associated diseases Cell Death Dis. 7 2016 e2053 10.1038/cddis.2015.414 PMC4816187 26775705 18 Casella G. Munk R. Kim K.M. Piao Y. De S. Abdelmohsen K. Gorospe M. Transcriptome signature of cellular senescence Nucleic Acids Res. 47 2019 11476 10.1093/nar/gkz879 PMC6698740 31251810 19 Chatsirisupachai K. Palmer D. Ferreira S. de Magalhães J.P. A human tissue-specific transcriptomic analysis reveals a complex relationship between aging, cancer, and cellular senescence Aging Cell 18 2019 e13041 10.1111/acel.13041 PMC6826163 31560156 20 Hernandez-Segura A. Rubingh R. Demaria M. Identification of stable senescence-associated reference genes Aging Cell 18 2019 e12911 10.1111/acel.12911 PMC6413663 30710410 21 Avelar R.A. Ortega J.G. Tacutu R. Tyler E.J. Bennett D. Binetti P. Budovsky A. Chatsirisupachai K. Johnson E. Murray A. A multidimensional systems biology analysis of cellular senescence in aging and disease Genome Biol. 21 2020 91 10.1186/s13059-020-01990-9 PMC7333371 32264951 22 Jochems F. Thijssen B. De Conti G. Jansen R. Pogacar Z. Groot K. Wang L. Schepers A. Wang C. Jin H. The Cancer SENESCopedia: A delineation of cancer cell senescence Cell Rep. 36 2021 109441 10.1016/j.celrep.2021.109441 PMC8333195 34320349 23 Palmer D. Fabris F. Doherty A. Freitas A.A. de Magalhães J.P. Ageing transcriptome meta-analysis reveals similarities and differences between key mammalian tissues Aging 13 2021 3313 3341 10.18632/aging.202648 33611312 PMC7906136 24 Saul D. Kosinsky R.L. Atkinson E.J. Doolittle M.L. Zhang X. LeBrasseur N.K. Pignolo R.J. Robbins P.D. Niedernhofer L.J. Ikeno Y. A new gene set identifies senescent cells and predicts senescence-associated pathways across tissues Nat. Commun. 13 2022 4827 10.1038/s41467-022-32552-1 PMC9381717 35974106 25 Xu P. Wang M. Song W.M. Wang Q. Yuan G.C. Sudmant P.H. Zare H. Tu Z. Orr M.E. Zhang B. The landscape of human tissue and cell type specific expression and co-regulation of senescence genes Mol. Neurodegener. 17 2022 5 10.1186/s13024-021-00507-7 PMC8744330 35000600 26 Deng E.Z. Fleishman R.H. Xie Z. Marino G.B. Clarke D.J.B. Ma'ayan A. Computational screen to identify potential targets for immunotherapeutic identification and removal of senescence cells Aging Cell 22 2023 e13809 10.1111/acel.13809 PMC10265163 37082798 27 Ribeiro C. Farmer C.K. de Magalhães J.P. Freitas A.A. Predicting lifespan-extending chemical compounds for C. elegans with machine learning and biologically interpretable features Aging 15 2023 6073 6099 10.18632/aging.204866 37450404 PMC10373959 28 de Magalhaes J.P. Abidi Z. Dos Santos G.A. Avelar R.A. Barardo D. Chatsirisupachai K. Clark P. De-Souza E.A. Johnson E.J. Lopes I. Human Ageing Genomic Resources: updates on key databases in ageing research Nucleic Acids Res. 52 2024 D900 D908 10.1093/nar/gkad927 37933854 PMC10767973 29 Tao W. Yu Z. Han J.D.J. Single-cell senescence identification reveals senescence heterogeneity, trajectory, and modulators Cell Metab. 36 2024 1126 1143.e5 10.1016/j.cmet.2024.03.009 38604170 30 Azazmeh N. Assouline B. Winter E. Ruppo S. Nevo Y. Maly A. Meir K. Witkiewicz A.K. Cohen J. Rizou S.V. Chronic expression of p16(INK4a) in the epidermis induces Wnt-mediated hyperplasia and promotes tumor initiation Nat. Commun. 11 2020 2711 10.1038/s41467-020-16475-3 PMC7264228 32483135 31 Duhen T. Duhen R. Montler R. Moses J. Moudgil T. de Miranda N.F. Goodall C.P. Blair T.C. Fox B.A. McDermott J.E. Co-expression of CD39 and CD103 identifies tumor-reactive CD8 T cells in human solid tumors Nat. Commun. 9 2018 2724 10.1038/s41467-018-05072-0 PMC6045647 30006565 32 Kim N. Kim H.K. Lee K. Hong Y. Cho J.H. Choi J.W. Lee J.I. Suh Y.L. Ku B.M. Eum H.H. Single-cell RNA sequencing demonstrates the molecular and cellular reprogramming of metastatic lung adenocarcinoma Nat. Commun. 11 2020 2285 10.1038/s41467-020-16164-1 PMC7210975 32385277 33 Lee H.O. Hong Y. Etlioglu H.E. Cho Y.B. Pomella V. Van den Bosch B. Vanhecke J. Verbandt S. Hong H. Min J.W. Lineage-dependent gene expression programs influence the immune landscape of colorectal cancer Nat. Genet. 52 2020 594 603 10.1038/s41588-020-0636-z 32451460 34 Zhang L. Li Z. Skrzypczynska K.M. Fang Q. Zhang W. O'Brien S.A. He Y. Wang L. Zhang Q. Kim A. Single-Cell Analyses Inform Mechanisms of Myeloid-Targeted Therapies in Colon Cancer Cell 181 2020 442 459.e29 10.1016/j.cell.2020.03.048 32302573 35 Qi J. Sun H. Zhang Y. Wang Z. Xun Z. Li Z. Ding X. Bao R. Hong L. Jia W. Single-cell and spatial analysis reveal interaction of FAP(+) fibroblasts and SPP1(+) macrophages in colorectal cancer Nat. Commun. 13 2022 1742 10.1038/s41467-022-29366-6 PMC8976074 35365629 36 Zhang C. Lei L. Yang X. Ma K. Zheng H. Su Y. Jiao A. Wang X. Liu H. Zou Y. Single-cell sequencing reveals antitumor characteristics of intratumoral immune cells in old mice J. Immunother. Cancer 9 2021 e002809 10.1136/jitc-2021-002809 PMC8513495 34642245 37 Liu X. Hartman C.L. Li L. Albert C.J. Si F. Gao A. Huang L. Zhao Y. Lin W. Hsueh E.C. Reprogramming lipid metabolism prevents effector T cell senescence and enhances tumor immunotherapy Sci. Transl. Med. 13 2021 eaaz6314 10.1126/scitranslmed.aaz6314 PMC12040281 33790024 38 Emont M.P. Jacobs C. Essene A.L. Pant D. Tenen D. Colleluori G. Di Vincenzo A. Jørgensen A.M. Dashti H. Stefek A. A single-cell atlas of human and mouse white adipose tissue Nature 603 2022 926 933 10.1038/s41586-022-04518-2 35296864 PMC9504827 39 Xie P. Zhao C. Huang W. Yong T. Chung A.C.K. He K. Chen X. Cai Z. Prenatal exposure to ambient fine particulate matter induces dysregulations of lipid metabolism in adipose tissue in male offspring Sci. Total Environ. 657 2019 1389 1397 10.1016/j.scitotenv.2018.12.007 30677905 40 Chen X. Liu Q. Xiang A.P. CD8+CD28- T cells: not only age-related cells but a subset of regulatory T cells Cell. Mol. Immunol. 15 2018 734 736 10.1038/cmi.2017.153 29375130 PMC6141529 41 Strioga M. Pasukoniene V. Characiejus D. CD8+ CD28- and CD8+ CD57+ T cells and their role in health and disease Immunology 134 2011 17 32 10.1111/j.1365-2567.2011.03470.x 21711350 PMC3173691 42 Mogilenko D.A. Shpynov O. Andhey P.S. Arthur L. Swain A. Esaulova E. Brioschi S. Shchukina I. Kerndl M. Bambouskova M. Comprehensive Profiling of an Aging Immune System Reveals Clonal GZMK(+) CD8(+) T Cells as Conserved Hallmark of Inflammaging Immunity 54 2021 99 115.e12 10.1016/j.immuni.2020.11.005 33271118 43 Liu X. Si F. Bagley D. Ma F. Zhang Y. Tao Y. Shaw E. Peng G. Blockades of effector T cell senescence and exhaustion synergistically enhance antitumor immunity and immunotherapy J. Immunother. Cancer 10 2022 e005020 10.1136/jitc-2022-005020 PMC9535198 36192086 44 Abella V. Scotece M. Conde J. Pino J. Gonzalez-Gay M.A. Gómez-Reino J.J. Mera A. Lago F. Gómez R. Gualillo O. Leptin in the interplay of inflammation, metabolism and immune system disorders Nat. Rev. Rheumatol. 13 2017 100 109 10.1038/nrrheum.2016.209 28053336 45 Deng J. Chen Q. Chen Z. Liang K. Gao X. Wang X. Makota F.V. Ong H.S. Wan Y. Luo K. The metabolic hormone leptin promotes the function of T(FH) cells and supports vaccine responses Nat. Commun. 12 2021 3073 10.1038/s41467-021-23220-x PMC8144586 34031386 46 Gerriets V.A. Danzaki K. Kishton R.J. Eisner W. Nichols A.G. Saucillo D.C. Shinohara M.L. MacIver N.J. Leptin directly promotes T-cell glycolytic metabolism to drive effector T-cell differentiation in a mouse model of autoimmunity Eur. J. Immunol. 46 2016 1970 1983 10.1002/eji.201545861 27222115 PMC5154618 47 Reis B.S. Lee K. Fanok M.H. Mascaraque C. Amoury M. Cohn L.B. Rogoz A. Dallner O.S. Moraes-Vieira P.M. Domingos A.I. Mucida D. Leptin receptor signaling in T cells is required for Th17 differentiation J. Immunol. 194 2015 5253 5260 10.4049/jimmunol.1402996 25917102 PMC4433844 48 Chen J. Li J. Lim F.C. Wu Q. Douek D.C. Scott D.K. Ravussin E. Hsu H.C. Jazwinski S.M. Mountz J.D. Louisiana Healthy Aging Study Maintenance of naive CD8 T cells in nonagenarians by leptin, IGFBP3 and T3 Mech. Ageing Dev. 131 2010 29 37 10.1016/j.mad.2009.11.003 19941883 PMC2843505 49 Wang Z. Aguilar E.G. Luna J.I. Dunai C. Khuat L.T. Le C.T. Mirsoian A. Minnar C.M. Stoffel K.M. Sturgill I.R. Paradoxical effects of obesity on T cell function during tumor progression and PD-1 checkpoint blockade Nat. Med. 25 2019 141 151 10.1038/s41591-018-0221-5 30420753 PMC6324991 50 Zhang C. Yue C. Herrmann A. Song J. Egelston C. Wang T. Zhang Z. Li W. Lee H. Aftabizadeh M. STAT3 Activation-Induced Fatty Acid Oxidation in CD8(+) T Effector Cells Is Critical for Obesity-Promoted Breast Tumor Growth Cell Metab. 31 2020 148 161.e5 10.1016/j.cmet.2019.10.013 31761565 PMC6949402 51 Sounni N.E. Cimino J. Blacher S. Primac I. Truong A. Mazzucchelli G. Paye A. Calligaris D. Debois D. De Tullio P. Blocking lipid synthesis overcomes tumor regrowth and metastasis after antiangiogenic therapy withdrawal Cell Metab. 20 2014 280 294 10.1016/j.cmet.2014.05.022 25017943 Supplemental information  Document S1. Figures S1–S7 and Tables S1–S5 Document S2. Article plus supplemental information Supplemental information can be found online at https://doi.org/10.1016/j.xcrm.2025.102310 ",
  "metadata": {
    "Title of this paper": "Blocking lipid synthesis overcomes tumor regrowth and metastasis after antiangiogenic therapy withdrawal",
    "Journal it was published in:": "Cell Reports Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490250/"
  }
}