{
  "title": "Paper_865",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12475488 PMC12475488.1 12475488 12475488 41006337 10.1038/s41598-025-13997-y 13997 1 Article Development of a novel assay for antigen presentation measurement Li Mei 1 Sharma Falak Harshit 1 Chen Yi-Ling 2 Araneda Marco Esteban 1 Hammett Amy 1 Miller Derick 1 Pearce Lilly 1 Chen Kuan-Hui E. kuachen@ttu.edu 1 1 https://ror.org/0405mnx93 grid.264784.b 0000 0001 2186 7496 Department of Biological Sciences, Texas Tech University, 2 https://ror.org/00hfj7g70 0000 0004 6470 0890 Department of Electronic Engineering, National Kaohsiung University of Science and Technology, 26 9 2025 2025 15 478255 33168 21 1 2025 28 7 2025 26 09 2025 28 09 2025 28 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Accurate measurement of antigen presentation is essential for understanding immune responses to infections and tumors. However, current methods are cumbersome, time-consuming, and rely on known peptide sequences and antibodies, leading to unstable antigen presentation, antigen loss during processing and editing, and inconsistent results. We developed a novel, cost-effective method for examining antigen presentation using Click chemistry, which utilizes a bioorthogonal reaction between azides and alkynes/cyclooctenes. Antigens were pre-labeled with azides or alkynes to facilitate their uptake by antigen-presenting cells (APCs). Their presentation was subsequently detected using fluorophore-conjugated dibenzocyclooctyne or azide. The study involved three types of APCs, mouse macrophages (RAW264.7), mouse dendritic cells (DC2.4), and mouse primary bone marrow derived dendritic cells (BMDCs), and three categories of antigens: BSA, bacteria, and tumor antigens. Antigen presentation was measured and validated through multiple analytic techniques, including a fluorescent plate reader, flow cytometry, and ELISA. We showed efficient and stable presentation of antigens on the surface of all RAW264.7, DC2.4 and BMDCs. Antigens labeled using Click chemistry showed enhanced stability within the phagolysosomes of APCs. Notably, antigens labeled throughout the peptide sequence using azidohomoalanine (AHA) exhibited superior presentation on MHC class II compared to antigens labeled only at the N-terminus. Furthermore, this method preserved the natural antigen editing process, enabling the selection of high-affinity antigens for MHC presentation. This novel antigen presentation assay offers key advantages over existing methods, including faster processing, cost-effectiveness, stable antigen presentation, and reliable detection signals. When paired with mass spectrometry, it can identify stably presented tumor peptides, offering potential targets for immunotherapy development. Supplementary Information The online version contains supplementary material available at 10.1038/s41598-025-13997-y. Keywords Antigen presentation MHC I/II Click chemistry Phagocytosis Breast cancer Subject terms Biological techniques Biotechnology https://doi.org/10.13039/100000057 National Institute of General Medical Sciences R16GM153648 Chen Kuan-Hui E. National Cancer Institute R03CA293129 Chen Kuan-Hui E. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Cancer is a complex and multifactorial disease that arises from a combination of genetic, metabolic, endocrinological, and immunological abnormalities 1 2 3 4 6 7 8 9 T cells represent the primary immune cell population responsible for targeting and eliminating tumor cells. However, priming effector T cells to effectively attack tumors is a complex and tightly regulated process. Naïve T cells must first undergo activation, a process initiated by antigen-presenting cells (APCs). These APCs are critical intermediaries that “educate” naïve T cells by presenting tumor-derived antigens via major histocompatibility complex (MHC) molecules 10 Antigen presentation is essential for activating adaptive immunity and occurs via MHC class I and II pathways. MHC class I primarily presents endogenous antigens, such as viral or cytosolic proteins 11 11 12 13 13 14 15 16 17 18 However, measuring antigen presentation currently remains a significant challenge due to its labor-intensive and time-consuming nature. A typical approach requires the pre-definition of an antigen peptide sequence, followed by the use of highly specific antibodies to detect the surface presentation of that antigen on MHC molecules with flow cytometry or immunochemistry staining 19 23 24 Click Chemistry was first introduced by K. Barry Sharpless in 2001 25 26 27 28 29 1 1 1  Fig. 1 Chemical scheme outlining the click-chemistry use in this study and comparison of conventional and our novel antigen presentation assays. Click-chemistry is a reaction between azides and alkynes/cyclooctenes. Thus, tumor antigens labeled with DBCO or azide can be detected using fluorescent probes conjugated with azide or alkyne, respectively ( a b c d Using tumor antigens as an example, we propose labeling all tumor peptides with click molecules, either through N-terminally labeled DBCO (Fig. 1 1 In this study, we present a novel methodology for examining antigen presentation. Our approach overcomes the limitations of existing antigen presentation assays and offers greater practicality for analyzing heterogeneous antigens. Results Antigens modified with DBCO or AHA did not affect APC recognition or subsequent phagocytosis APCs primarily rely on pattern recognition receptors (PRRs) which detect conserved molecular structures known as pathogen-associated molecular patterns (PAMPs) and damage-associated molecular patterns (DAMPs), allowing APCs to identify and initiate innate immune responses and activate subsequent adaptive immune responses to invading pathogens or cellular damage. To evaluate whether DBCO- or AHA-modified antigens affect APC recognition, we performed phagocytosis assays using pHrodo dyes and RAW264.7. As seen in Fig. 2 2 2 2 2 1  Fig.2 Azido- and alkyne-labeled amino acids demonstrate stability within phagolysosomes. Triple immunofluorescence staining was performed to evaluate the phagocytosis of DBCO-labeled tumor antigens ( a b c p DBCO labeled antigens might be removed during the antigen editing process DBCO interacts with amines, leading to its attachment at the N-terminus of peptides. This raised concerns about the antigen presentation of N-terminally labeled peptides to MHC molecules, particularly MHC I, since the Ubiquitin–proteasome system removes terminal amino acids unless they are hydrophobic. To assess whether DBCO-conjugated antigens could lead to stable signals, we treated mouse RAW264.7 and mouse DC2.4 using three DBCO-labelled N-terminus proteins, including E. coli 3 3 3 3 3  Fig. 3 Antigen presentation of DBCO-conjugated antigens by APCs. Mouse macrophages ( a c d f coli p p Collectively, these findings suggest that the new antigen-presenting assay using DBCO conjugation may lack the sensitivity required to reliably detect surface antigen presentation, particularly for more heterogeneous antigens. AHA integration provided a more accurate detection of antigen presentation from heterogeneous samples Since DBCO conjugates exclusively to the N-terminus, which may be removed during antigen editing, we aimed to develop an alternative method that allows the incorporation of click chemistry molecules throughout the entire antigen peptide. AHA, an amino acid analog of methionine, contains a small azido moiety that can be incorporated into proteins during protein synthesis when fed to cultured cells. To evaluate whether AHA integration enhances antigen presentation, we cultured tumor cells in the presence of AHA and collected AHA-integrated tumor peptides for analysis. For comparison, we also included DBCO-conjugated tumor antigens. Theoretically, following the uptake, digestion, and processing of these antigens—within phagolysosomes for MHC II and the ER for MHC I—AHA integration should result in a higher proportion of tumor peptides retaining the azido moiety for click chemistry detection compared to DBCO-labeled tumor peptides. Figure 4 4 4 4  Fig. 4 Flow cytometry plots and graphs comparing the surface presentation of fluorescent DBCO- and AHA-labeled tumor antigens by APCs. ( a b c b c p p p In summary, these results strongly indicate that the AHA incorporation method enhances the efficiency of measuring antigen presentation by APCs. AHA-integrated antigens, but not DBCO-conjugated antigens, can be presented on the surface of APCs by both MHC I and MHC II Given the better antigen-presenting detection in APCs with AHA-containing tumor antigens, as shown in Fig. 4 5 5 5 5  Fig. 5 Extracellular DBCO- and AHA-labeled tumor antigens are predominantly presented on MHC class II, with notable cross-presentation on MHC class I. RAW264.7 ( a b c d p p p In summary, these findings indicate that thoroughly labeled tumor antigens enable consistent and stable measurement of antigen presentation. Moreover, while MHC class II presentation was predominant for these phagocytosed tumor antigens, a significant portion was also cross-presented via MHC class I. AHA-incorporated tumor antigens can also be presented by primary mouse bone marrow-derived dendritic cells To further validate our novel assay, we performed ex vivo experiments using bone marrow-derived dendritic cells (BMDCs). Bone marrow stem cells from C57Bl6 mice were differentiated into dendritic cells using GM-CSF and IL-4. Differentiation was confirmed by staining with CD1a and CD11c, established dendritic cell markers, with results showing over 95% of cells expressing both markers (Fig. 6 6 6  Fig. 6 Evaluation of AHA-incorporated tumor antigen presentation via MHC I and MHC II in primary dendritic cells derived from mouse bone marrow. ( a b c p Discussion Current methodologies to measure antigen presentation rely on pre-defined antigen sequences and antibodies specific to those antigens. Antigen presentation by MHC molecules, including both MHC I and MHC II, is highly selective 30 31 32 In this study, we introduce a novel assay based on click technology to effectively and reliably measure antigen presentation in RAW264.7, DC2.4 and BMDCs. Click chemistry is known as the reaction between alkyne/cyclooctyne and azide 28 33 34 In addition to DBCO as a protein labeling linker, azide can also be used as a protein linker reversely. AHA is modified with azido moiety, which can be detected by fluorescent or biotin-labeled DBCO/alkyne. Given that AHA is an analog of methionine, it can be incorporated into newly synthesized proteins by re-placing methionine during translation 35 37 To evaluate our assay, we utilize two types of antigen preparations: homogeneous antigenic peptides derived from BSA protein and heterogeneous protein mixtures derived from bacteria or tumor cells. BSA is commonly used as a model foreign antigen in immunological studies due to its simplicity, stability, and well-defined structure. Fumitaka Sato and colleagues showed that BSA is an effective antigen that is capable of increasing CD11c + 38 + 39 40 41 In addition to the antigen editing concern, another possible explanation that bacterial antigens derived from E. coli 42 44 + 45 Since terminal labeling with click chemistry molecules can potentially be removed during antigen editing and processing 46 Consistent with what is known by literature, we also observe that DC2.4 cells perform better DBCO/AHA-tumor antigen presentation than RAW264.7 cells. This can be explained by the fact that macrophages typically possess less efficient antigen presentation because of lower MHC II levels than dendritic cells and B cells 47 47 48 Antigens presented by different MHC molecules activate distinct subsets of T cells. Specifically, antigens presented via MHC I activate CD8 + + 49 50 51 52 This study also observed a significant level of cross-presentation of exogenous antigens by MHC I. Since MHC I presentation activates CD8 + + 53 54 55 As tumors progress, it has been reported that tumor cells may downregulate MHC I expression and reduce the expression of certain tumor antigens, enabling them to evade recognition by the immune system 56 58 Our developed assay leverages the advantages of “Click-chemistry” technology, which is fast, sensitive, non-toxic, nonradioactive, and time-efficient. In this study, we propose the use of AHA, a methionine analog, for antigen detection. Literature reports indicate that methionine is relatively rare in peptides, with an average frequency of approximately 2.3% 59 In conclusion, our novel assay system successfully detects antigen presentation on the surface of APCs. Moreover, the fully azido/DBCO-labeled proteins exhibit higher antigen presentation efficiency than the N-terminal azido/DBCO-labeled proteins. This study also addresses the limitations of current antigen presentation measurement by introducing a rapid and user-friendly examination system based on click chemistry. It allows for earlier and more precise detection of functional antigen presentation and potential immune responses. For example, the presentation of click chemistry–modified peptide vaccines can be detected within 1–3 days, offering a rapid means to assess vaccine efficacy—significantly faster than the conventional 21–28 day wait required for antibody titer measurements. As such, this assay holds promise for advancing both diagnostic and therapeutic strategies across a range of diseases, ultimately contributing to improved global health outcomes. Methods Cell culture Mouse dendritic cells (DC2.4) (SCC142, Sigma-Aldrich), mouse macrophages (RAW264.7) (91062702, Sigma-Aldrich), and triple-negative mouse breast cancer cells (EO771) (CRL-3461TM, ATCC) were cultured in a standard medium containing RPMI 1640 (Cat. #10-040-CV, Corning) supplemented with 10% fetal bovine serum (FBS, 10082-147, ThermoFisher Scientific) and 1% penicillin/streptomycin supplement (SV30010, Citiva). All cells were cultured at 37 °C in an incubator with 5% CO₂. The DC2.4 cells are derived from the C57BL/6 mouse strain, while the RAW264.7 cells originate from the BalbC/J strain. This study utilized both cell types not only as two distinct antigen-presenting cells (APCs) but also to represent antigen presentation across two different mouse genetic backgrounds. Mouse bone marrow cells from wild-type C57BL/6 mice were generously provided by a colleague at Texas Tech University (acknowledged accordingly), with collection performed under approved IACUC protocols at that institution. The cells were differentiated into dendritic cells by culturing them with 50 ng/mL GM-CSF (10787-940, VWR) and 50 ng/mL IL-4 (103622-832, VWR) for 7 days. The identity of the resulting dendritic cells was confirmed by the expression of CD11c-FITC (11-0114-82, ThermoFisher) and CD1a-PE (12-0019-4, ThermoFisher), both established markers of dendritic cells. Antigen preparations E. coli E. coli 4 C20039 E. coli PIA44297 BSA lyophilized powder (84-2251, Carolina Biological) was thoroughly dissolved in sterile ddH2O, and a 0.22-µm filter was used to filter out the non-dissolved deposits and potential contaminants in the sterile cabinet. Bradford Assay analyzed the dissolved BSA concentration. The same DBCO conjugation ratio (0.1 mg BSA: 4 × 10 4 Tumor antigens were prepared using two distinct methods. In the first method, EO771 cells were cultured until reaching 80–90% confluency. Tumor cell lysates were then collected for protein extraction using cell lysis buffer (87788, ThermoFisher Scientific). After extraction and quantification, tumor proteins were conjugated with DBCO at a ratio of 0.1 mg tumor protein to a specified concentration of DBCO (4 × 10 4 Measurement of phagocytosis To evaluate whether DBCO conjugation or AHA integration affects phagocytosis by macrophages, RAW264.7 were cultured on chamber slide (1 × 10 5 P35369 R37609 Measurement of surface antigen presentation using fluorescent microplate reader DC2.4 and RAW264.7 were cultured in 96-well microplates (1,000 cells/well) to assess the antigen-presenting capacity. Cells were exposed to three types of DBCO-conjugated antigens ( E. coli C10428 Examination of surface antigen presentation via MHC class I or class II using enzyme-linked immunosorbent assay (ELISA) While antigens acquired from phagocytosis are typically presented through MHC II, it has been shown that cross-presentation through MHC I also occurs 60 61 RAW264.7 were treated with DBCO- or AHA-containing tumor protein for 6 days. Cells were lysed using a lysis buffer, and cellular proteins were harvested for sandwich ELISA analysis. Anti-mouse MHC class I (for MHC I of macrophages from BalbC/J mice of H-2K d b Flow cytometry To compare fluorescent DBCO-/AHA-tumor antigen presentation by APCs, RAW264.7 and DC2.4 were seeded in 6-well plates (5 × 10 5 Statistical analysis The statistical significance was determined using a two-tailed paired Student’s t ± Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements We sincerely thank James Niagilo, a technician at Echo Company, for his valuable assistance with fluorescent microscopy instruction. We also extend our gratitude to Dr. Lisa Bono at Texas Tech University for her generosity in sharing fluorescent plate readers. Moreover, we sincerely appreciate Lauryn Evans from Texas Tech University for generously providing mouse bone marrow. Author contributions M.L. prepared the manuscript. KH.E.C reviewed and edited the manuscript. M.L. prepared Figs. 1, 2, 3, 4 and 5 and supplementary figure. F.H.S., A.H. and L.P. assisted in the preparation of figure 4. YL.C., M.E.A., and D.M. assisted in the preparation of figure 2 and supplementary figure. All authors reviewed the manuscript. Data availability The dataset supporting the conclusions of this article is available from the corresponding author. Declarations Competing interests The authors declare no competing interests. References 1. Shi C  Multifactorial Diseases of the Heart, Kidneys, Lungs, and Liver and Incident Cancer: Epidemiology and Shared Mechanisms Cancers (Basel) 2023 15 3 729 10.3390/cancers15030729 36765688 PMC9913123 Shi, C. et al. ultifactorial Diseases of the Heart, Kidneys, Lungs, and Liver and Incident Cancer: Epidemiology and Shared Mechanisms. Cancers (Basel) 15 36765688 10.3390/cancers15030729 PMC9913123 2. Wishart DS Is cancer a genetic disease or a metabolic disease? EBioMedicine 2015 2 6 478 479 10.1016/j.ebiom.2015.05.022 26288805 PMC4535307 Wishart, D. S. Is cancer a genetic disease or a metabolic disease? EBioMedicine 2 26288805 10.1016/j.ebiom.2015.05.022 PMC4535307 3. Hartmaier RJ Genomic analysis of 63,220 tumors reveals insights into tumor uniqueness and targeted cancer immunotherapy strategies Genome. Med. 2017 9 1 16 10.1186/s13073-017-0408-2 28231819 PMC5324279 Hartmaier, R. J. et al. Genomic analysis of 63,220 tumors reveals insights into tumor uniqueness and targeted cancer immunotherapy strategies. Genome. Med. 9 28231819 10.1186/s13073-017-0408-2 PMC5324279 4. Yang R Cui J Advances and applications of RNA vaccines in tumor treatment Mol. Cancer 2024 23 1 226 10.1186/s12943-024-02141-5 39385255 PMC11463124 Yang, R. & Cui, J. Advances and applications of RNA vaccines in tumor treatment. Mol. Cancer 23 39385255 10.1186/s12943-024-02141-5 PMC11463124 5. Trivedi V mRNA-based precision targeting of neoantigens and tumor-associated antigens in malignant brain tumors Genome. Med. 2024 16 1 17 10.1186/s13073-024-01281-z 38268001 PMC10809449 Trivedi, V. et al. mRNA-based precision targeting of neoantigens and tumor-associated antigens in malignant brain tumors. Genome. Med. 16 38268001 10.1186/s13073-024-01281-z PMC10809449 6. Wu DW Personalized neoantigen cancer vaccines: current progression, challenges and a bright future Clin. Experimental Med. 2024 24 1 229 10.1007/s10238-024-01436-7 PMC11427492 39325256 Wu, D. W. et al. Personalized neoantigen cancer vaccines: current progression, challenges and a bright future. Clin. Experimental Med. 24 10.1007/s10238-024-01436-7 PMC11427492 39325256 7. Lemoine J Ruella M Houot R Born to survive: how cancer cells resist CAR T cell therapy J. Hematol. Oncol. 2021 14 1 199 10.1186/s13045-021-01209-9 34809678 PMC8609883 Lemoine, J., Ruella, M. & Houot, R. Born to survive: how cancer cells resist CAR T cell therapy. J. Hematol. Oncol. 14 34809678 10.1186/s13045-021-01209-9 PMC8609883 8. Daniyan AF Brentjens RJ Hiding in plain sight: immune escape in the era of targeted T-cell-based immunotherapies Nat. Reviews Clin. Oncol. 2017 14 6 333 334 10.1038/nrclinonc.2017.49 PMC5536112 28397826 Daniyan, A. F. & Brentjens, R. J. Hiding in plain sight: immune escape in the era of targeted T-cell-based immunotherapies. Nat. Reviews Clin. Oncol. 14 10.1038/nrclinonc.2017.49 PMC5536112 28397826 9. Cai L Defective HLA class I antigen processing machinery in cancer Cancer Immunol. Immunother. 2018 67 6 999 1009 10.1007/s00262-018-2131-2 29487978 PMC8697037 Cai, L. et al. Defective HLA class I antigen processing machinery in cancer. Cancer Immunol. Immunother. 67 29487978 10.1007/s00262-018-2131-2 PMC8697037 10. Gaudino SJ Kumar P Cross-Talk Between Antigen Presenting Cells and T Cells Impacts Intestinal Homeostasis, Bacterial Infections, and Tumorigenesis 2019 Frontiers in Immunology 360 10.3389/fimmu.2019.00360 PMC6414782 30894857 Gaudino, S. J. & Kumar, P. Cross-talk between antigen presenting cells and T cells impacts intestinal homeostasis, bacterial infections, and tumorigenesis. Front Immunol. 10 10.3389/fimmu.2019.00360 PMC6414782 30894857 11. Hewitt EW The MHC class I antigen presentation pathway: strategies for viral immune evasion Immunology 2003 110 2 163 169 10.1046/j.1365-2567.2003.01738.x 14511229 PMC1783040 Hewitt, E. W. The MHC class I antigen presentation pathway: strategies for viral immune evasion. Immunology 110 14511229 10.1046/j.1365-2567.2003.01738.x PMC1783040 12. Sun Y CryoEM structure of an MHC-I/TAPBPR peptide-bound intermediate reveals the mechanism of antigen proofreading Proc. Natl. Acad. Sci. U S A 2025 122 2 e2416992122 10.1073/pnas.2416992122 39786927 PMC11745410 Sun, Y. et al. CryoEM structure of an MHC-I/TAPBPR peptide-bound intermediate reveals the mechanism of antigen proofreading. Proc. Natl. Acad. Sci. U S A 122 39786927 10.1073/pnas.2416992122 PMC11745410 13. Roche PA Furuta K The Ins and outs of MHC class II-mediated antigen processing and presentation Nat. Rev. Immunol. 2015 15 4 203 216 10.1038/nri3818 25720354 PMC6314495 Roche, P. A. & Furuta, K. The Ins and outs of MHC class II-mediated antigen processing and presentation. Nat. Rev. Immunol. 15 25720354 10.1038/nri3818 PMC6314495 14. Colbert JD Cruz FM Rock KL Cross-presentation of exogenous antigens on MHC I molecules Curr. Opin. Immunol. 2020 64 1 8 10.1016/j.coi.2019.12.005 31927332 PMC7343603 Colbert, J. D., Cruz, F. M. & Rock, K. L. Cross-presentation of exogenous antigens on MHC I molecules. Curr. Opin. Immunol. 64 31927332 10.1016/j.coi.2019.12.005 PMC7343603 15. Kovacsovics-Bankowski M Rock KL A phagosome-to-cytosol pathway for exogenous antigens presented on MHC class I molecules Science 1995 267 5195 243 246 10.1126/science.7809629 7809629 Kovacsovics-Bankowski, M. & Rock, K. L. A phagosome-to-cytosol pathway for exogenous antigens presented on MHC class I molecules. Science 267 7809629 10.1126/science.7809629 16. Shen L Important role of cathepsin S in generating peptides for TAP-independent MHC class I crosspresentation in vivo Immunity 2004 21 2 155 165 10.1016/j.immuni.2004.07.004 15308097 Shen, L. et al. Important role of cathepsin S in generating peptides for TAP-independent MHC class I crosspresentation in vivo. Immunity 21 15308097 10.1016/j.immuni.2004.07.004 17. Crotzer VL Blum JS Autophagy and its role in MHC-mediated antigen presentation J. Immunol. 2009 182 6 3335 3341 10.4049/jimmunol.0803458 19265109 PMC2730830 Crotzer, V. L. & Blum, J. S. Autophagy and its role in MHC-mediated antigen presentation. J. Immunol. 182 19265109 10.4049/jimmunol.0803458 PMC2730830 18. Li Y Efficient cross-presentation depends on autophagy in tumor cells Cancer Res. 2008 68 17 6889 6895 10.1158/0008-5472.CAN-08-0161 18757401 PMC2905686 Li, Y. et al. Efficient cross-presentation depends on autophagy in tumor cells. Cancer Res. 68 18757401 10.1158/0008-5472.CAN-08-0161 PMC2905686 19. Purcell AW Croft NP Tscharke DC Immunology by numbers: quantitation of antigen presentation completes the quantitative milieu of systems immunology! Curr. Opin. Immunol. 2016 40 88 95 10.1016/j.coi.2016.03.007 27060633 Purcell, A. W., Croft, N. P. & Tscharke, D. C. Immunology by numbers: quantitation of antigen presentation completes the quantitative milieu of systems immunology! Curr. Opin. Immunol. 40 27060633 10.1016/j.coi.2016.03.007 20. Shastri N Monitoring peptide processing for MHC class I molecules in the Endoplasmic reticulum Curr. Opin. Immunol. 2014 26 123 127 10.1016/j.coi.2013.11.006 24556408 PMC3932006 Shastri, N. et al. Monitoring peptide processing for MHC class I molecules in the Endoplasmic reticulum. Curr. Opin. Immunol. 26 24556408 10.1016/j.coi.2013.11.006 PMC3932006 21. Saric T An IFN-gamma-induced aminopeptidase in the ER, ERAP1, Trims precursors to MHC class I-presented peptides Nat. Immunol. 2002 3 12 1169 1176 10.1038/ni859 12436109 Saric, T. et al. An IFN-gamma-induced aminopeptidase in the ER, ERAP1, Trims precursors to MHC class I-presented peptides. Nat. Immunol. 3 12436109 10.1038/ni859 22. Hammer GE The aminopeptidase ERAAP shapes the peptide repertoire displayed by major histocompatibility complex class I molecules Nat. Immunol. 2006 7 1 103 112 10.1038/ni1286 16299505 Hammer, G. E. et al. The aminopeptidase ERAAP shapes the peptide repertoire displayed by major histocompatibility complex class I molecules. Nat. Immunol. 7 16299505 10.1038/ni1286 23. Serwold T ERAAP customizes peptides for MHC class I molecules in the Endoplasmic reticulum Nature 2002 419 6906 480 483 10.1038/nature01074 12368856 Serwold, T. et al. ERAAP customizes peptides for MHC class I molecules in the Endoplasmic reticulum. Nature 419 12368856 10.1038/nature01074 24. Jankowski W Peptides identified on monocyte-derived dendritic cells: a marker for clinical immunogenicity to FVIII products Blood Adv. 2019 3 9 1429 1440 10.1182/bloodadvances.2018030452 31053570 PMC6517663 Jankowski, W. et al. Peptides identified on monocyte-derived dendritic cells: a marker for clinical immunogenicity to FVIII products. Blood Adv. 3 31053570 10.1182/bloodadvances.2018030452 PMC6517663 25. Kolb HC Finn MG Sharpless KB Click chemistry: diverse chemical function from a few good reactions Angew Chem. Int. Ed. Engl. 2001 40 11 2004 2021 10.1002/1521-3773(20010601)40:11&#x0003c;2004::AID-ANIE2004&#x0003e;3.0.CO;2-5 11433435 Kolb, H. C., Finn, M. G. & Sharpless, K. B. Click chemistry: diverse chemical function from a few good reactions. Angew Chem. Int. Ed. Engl. 40 11433435 10.1002/1521-3773(20010601)40:11<2004::AID-ANIE2004>3.0.CO;2-5 26. Agard NJ Prescher JA Bertozzi CR A Strain-Promoted [3 + 2] Azide – Alkyne cycloaddition for covalent modification of biomolecules in living systems J. Am. Chem. Soc. 2004 126 46 15046 15047 10.1021/ja044996f 15547999 Agard, N. J., Prescher, J. A. & Bertozzi, C. R. A Strain-Promoted [3 + 2] Azide – Alkyne cycloaddition for covalent modification of biomolecules in living systems. J. Am. Chem. Soc. 126 15547999 10.1021/ja044996f 27. Baskin JM Bertozzi CR Bioorthogonal click chemistry: covalent labeling in living systems QSAR Comb. Sci. 2007 26 1211 1219 10.1002/qsar.200740086 Baskin, J. M. & Bertozzi, C. R. Bioorthogonal click chemistry: covalent labeling in living systems. QSAR Comb. Sci. 26 28. Mehak Clicking in harmony: exploring the bio-orthogonal overlap in click chemistry RSC Adv. 2024 14 11 7383 7413 10.1039/D4RA00494A 38433942 PMC10906366 Mehak et al. Clicking in harmony: exploring the bio-orthogonal overlap in click chemistry. RSC Adv. 14 38433942 10.1039/d4ra00494a PMC10906366 29. Zeglis BM Lewis JS Click here for better chemistry N Engl. J. Med. 2022 387 24 2291 2293 10.1056/NEJMcibr2213596 36449446 PMC10501737 Zeglis, B. M. & Lewis, J. S. Click here for better chemistry. N Engl. J. Med. 387 36449446 10.1056/NEJMcibr2213596 PMC10501737 30. Nesmiyanov PP Rezaei N Antigen presentation and major histocompatibility complex Encyclopedia of Infection and Immunity 2022 Elsevier 90 98 Nesmiyanov, P. P. & Rezaei, N. Antigen presentation and major histocompatibility complex. Encyclopedia of Infection and Immunity 1 31. Reynisson B Improved prediction of MHC II antigen presentation through integration and motif Deconvolution of mass spectrometry MHC eluted ligand data J. Proteome Res. 2020 19 6 2304 2315 10.1021/acs.jproteome.9b00874 32308001 Reynisson, B. et al. Improved prediction of MHC II antigen presentation through integration and motif Deconvolution of mass spectrometry MHC eluted ligand data. J. Proteome Res. 19 32308001 10.1021/acs.jproteome.9b00874 32. Wieczorek M Major histocompatibility complex (MHC) class I and MHC class II proteins: conformational plasticity in antigen presentation Front. Immunol. 2017 8 292 10.3389/fimmu.2017.00292 28367149 PMC5355494 Wieczorek, M. et al. Major histocompatibility complex (MHC) class I and MHC class II proteins: conformational plasticity in antigen presentation. Front. Immunol. 8 28367149 10.3389/fimmu.2017.00292 PMC5355494 33. Lee HJ Tethering growth factors to collagen surfaces using Copper-Free click chemistry: surface characterization and in vitro biological response ACS Appl. Mater. Interfaces 2017 9 28 23389 23399 10.1021/acsami.7b05262 28598594 Lee, H. J. et al. Tethering growth factors to collagen surfaces using Copper-Free click chemistry: surface characterization and in vitro biological response. ACS Appl. Mater. Interfaces 9 28598594 10.1021/acsami.7b05262 34. Greene CJ Macrophages disseminate pathogen associated molecular patterns through the direct extracellular release of the soluble content of their phagolysosomes Nat. Commun. 2022 13 1 3072 10.1038/s41467-022-30654-4 35654768 PMC9163141 Greene, C. J. et al. Macrophages disseminate pathogen associated molecular patterns through the direct extracellular release of the soluble content of their phagolysosomes. Nat. Commun. 13 35654768 10.1038/s41467-022-30654-4 PMC9163141 35. Tom Dieck S Metabolic labeling with noncanonical amino acids and visualization by chemoselective fluorescent tagging Curr. Protoc. Cell. Biol. 2012 56 1 7 11 10.1002/0471143030.cb0711s56 PMC3736104 22968844 Tom Dieck, S. et al. Metabolic labeling with noncanonical amino acids and visualization by chemoselective fluorescent tagging. Curr. Protoc. Cell. Biol. 56 10.1002/0471143030.cb0711s56 PMC3736104 22968844 36. Kiick KL Incorporation of Azides into Recombinant proteins for chemoselective modification by the Staudinger ligation Proc. Natl. Acad. Sci. U S A 2002 99 1 19 24 10.1073/pnas.012583299 11752401 PMC117506 Kiick, K. L. et al. Incorporation of Azides into Recombinant proteins for chemoselective modification by the Staudinger ligation. Proc. Natl. Acad. Sci. U S A 99 11752401 10.1073/pnas.012583299 PMC117506 37. Dieterich DC In situ visualization and dynamics of newly synthesized proteins in rat hippocampal neurons Nat. Neurosci. 2010 13 7 897 905 10.1038/nn.2580 20543841 PMC2920597 Dieterich, D. C. et al. In situ visualization and dynamics of newly synthesized proteins in rat hippocampal neurons. Nat. Neurosci. 13 20543841 10.1038/nn.2580 PMC2920597 38. Sato F Effect of BSA antigen sensitization during the acute phase of influenza A viral infection on CD11c + pulmonary antigen presenting cells Allergol. Int. 2009 58 3 445 454 10.2332/allergolint.08-OA-0081 19628980 Sato, F. et al. Effect of BSA antigen sensitization during the acute phase of influenza A viral infection on CD11c + pulmonary antigen presenting cells. Allergol. Int. 58 19628980 10.2332/allergolint.08-OA-0081 39. Chen W Supplemental fetal calf serum in T cell culture media expands bovine serum Albumin-Specific human CD4 + T cells Clin. Immunol. Immunotherapy 2022 8 1 11 10.24966/CIIT-8844/1000072 Chen, W. Supplemental fetal calf serum in T cell culture media expands bovine serum Albumin-Specific human CD4 + T cells. Clin. Immunol. Immunotherapy 8 40. Ohta M Nakashima I Kato N Adjuvant action of bacterial lipopolysaccharide in induction of delayed-type hypersensitivity to protein antigens. II. Relationships of intensity of the action to that of other immunological activities Immunobiology 1982 163 5 460 469 10.1016/S0171-2985(82)80060-0 6984417 Ohta, M., Nakashima, I. & Kato, N. Adjuvant action of bacterial lipopolysaccharide in induction of delayed-type hypersensitivity to protein antigens. II. Relationships of intensity of the action to that of other immunological activities. Immunobiology 163 6984417 10.1016/S0171-2985(82)80060-0 41. Weimershaus M Peptidases trimming MHC class I ligands Curr. Opin. Immunol. 2013 25 1 90 96 10.1016/j.coi.2012.10.001 23089230 Weimershaus, M. et al. Peptidases trimming MHC class I ligands. Curr. Opin. Immunol. 25 23089230 10.1016/j.coi.2012.10.001 42. Cheers C Zhan Y How do macrophages distinguish the living from the dead? Trends Microbiol. 1996 4 11 453 455 10.1016/0966-842X(96)10067-6 8950815 Cheers, C. & Zhan, Y. How do macrophages distinguish the living from the dead? Trends Microbiol. 4 8950815 10.1016/0966-842x(96)10067-6 43. Kawamura I Antigen provoking gamma interferon production in response to Mycobacterium Bovis BCG and functional difference in T-cell responses to this antigen between viable and killed BCG-immunized mice Infect. Immun. 1994 62 10 4396 4403 10.1128/iai.62.10.4396-4403.1994 7927701 PMC303122 Kawamura, I. et al. Antigen provoking gamma interferon production in response to Mycobacterium Bovis BCG and functional difference in T-cell responses to this antigen between viable and killed BCG-immunized mice. Infect. Immun. 62 7927701 10.1128/iai.62.10.4396-4403.1994 PMC303122 44. RAUH LW Measles immunization with killed virus vaccine: serum antibody titers and experience with exposure to measles epidemic Am. J. Dis. Child. 1965 109 3 232 237 10.1001/archpedi.1965.02090020234007 14246070 RAUH, L. W. Measles immunization with killed virus vaccine: serum antibody titers and experience with exposure to measles epidemic. Am. J. Dis. Child. 109 14246070 10.1001/archpedi.1965.02090020234007 45. Lauvau G Priming of memory but not effector CD8 T cells by a killed bacterial vaccine Science 2001 294 5547 1735 1739 10.1126/science.1064571 11721060 Lauvau, G. et al. Priming of memory but not effector CD8 T cells by a killed bacterial vaccine. Science 294 11721060 10.1126/science.1064571 46. Yang Y Yang X Verhelst SHL Comparative analysis of click chemistry mediated Activity-Based protein profiling in cell lysates Molecules 2013 18 10 12599 12608 10.3390/molecules181012599 24126377 PMC6270401 Yang, Y., Yang, X. & Verhelst, S. H. L. Comparative analysis of click chemistry mediated Activity-Based protein profiling in cell lysates. Molecules 18 24126377 10.3390/molecules181012599 PMC6270401 47. Trombetta ES Mellman I Cell biology of antigen processing in vitro and in vivo Annu. Rev. Immunol. 2005 23 975 1028 10.1146/annurev.immunol.22.012703.104538 15771591 Trombetta, E. S. & Mellman, I. Cell biology of antigen processing in vitro and in vivo. Annu. Rev. Immunol. 23 15771591 10.1146/annurev.immunol.22.012703.104538 48. Zepeda-Cervantes J Ramírez-Jarquín JO Vaca L Interaction between Virus-Like particles (VLPs) and pattern recognition receptors (PRRs) from dendritic cells (DCs): toward better engineering of VLPs Front. Immunol. 2020 11 1100 10.3389/fimmu.2020.01100 32582186 PMC7297083 Zepeda-Cervantes, J., Ramírez-Jarquín, J. O. & Vaca, L. Interaction between Virus-Like particles (VLPs) and pattern recognition receptors (PRRs) from dendritic cells (DCs): toward better engineering of VLPs. Front. Immunol. 11 32582186 10.3389/fimmu.2020.01100 PMC7297083 49. Lee-Chang C Lesniak MS Next-generation antigen-presenting cell immune therapeutics for gliomas J. Clin. Invest. 2023 10.1172/JCI163449 36719372 PMC9888388 Lee-Chang, C. & Lesniak, M. S. Next-generation antigen-presenting cell immune therapeutics for gliomas. J. Clin. Invest. 133 36719372 10.1172/JCI163449 PMC9888388 50. Stern LJ Wiley DC Antigenic peptide binding by class I and class II histocompatibility proteins Behring Inst. Mitt 1994 2 4 245 251 10.1016/s0969-2126(00)00026-5 8087551 Stern, L. J. & Wiley, D. C. Antigenic peptide binding by class I and class II histocompatibility proteins. Behring Inst. Mitt 2 7998902 51. Marshall JS An introduction to immunology and immunopathology Allergy Asthma Clin. Immunol. 2018 14 2 49 10.1186/s13223-018-0278-1 30263032 PMC6156898 Marshall, J. S. et al. An introduction to immunology and immunopathology. Allergy Asthma Clin. Immunol. 14 30263032 10.1186/s13223-018-0278-1 PMC6156898 52. Burgdorf S Distinct pathways of antigen uptake and intracellular routing in CD4 and CD8 T cell activation Science 2007 316 5824 612 616 10.1126/science.1137971 17463291 Burgdorf, S. et al. Distinct pathways of antigen uptake and intracellular routing in CD4 and CD8 T cell activation. Science 316 17463291 10.1126/science.1137971 53. Sengupta D Proteasomal degradation within endocytic organelles mediates antigen cross-presentation Embo J. 2019 38 16 e99266 10.15252/embj.201899266 31271236 PMC6694219 Sengupta, D. et al. Proteasomal degradation within endocytic organelles mediates antigen cross-presentation. Embo J. 38 31271236 10.15252/embj.201899266 PMC6694219 54. Grommé M Recycling MHC class I molecules and endosomal peptide loading Proc. Natl. Acad. Sci. U S A 1999 96 18 10326 10331 10.1073/pnas.96.18.10326 10468607 PMC17887 Grommé, M. et al. Recycling MHC class I molecules and endosomal peptide loading. Proc. Natl. Acad. Sci. U S A 96 10468607 10.1073/pnas.96.18.10326 PMC17887 55. Muntjewerff EM Meesters LD van den Bogaart G Antigen Cross-Presentation Macrophages Front. Immunol. 2020 11 1276 32733446 10.3389/fimmu.2020.01276 PMC7360722 Muntjewerff, E. M., Meesters, L. D. & van den Bogaart, G. Antigen cross-presentation macrophages. Front. Immunol. 11 32733446 10.3389/fimmu.2020.01276 PMC7360722 56. Cornel AM Mimpen IL Nierkens S MHC class I downregulation in cancer: underlying mechanisms and potential targets for cancer immunotherapy Cancers 2020 12 7 1760 10.3390/cancers12071760 32630675 PMC7409324 Cornel, A. M., Mimpen, I. L. & Nierkens, S. MHC class I downregulation in cancer: underlying mechanisms and potential targets for cancer immunotherapy. Cancers 12 32630675 10.3390/cancers12071760 PMC7409324 57. Dhatchinamoorthy K Colbert JD Rock KL Cancer immune evasion through loss of MHC class I antigen presentation Front. Immunol. 2021 12 636568 10.3389/fimmu.2021.636568 33767702 PMC7986854 Dhatchinamoorthy, K., Colbert, J. D. & Rock, K. L. Cancer immune evasion through loss of MHC class I antigen presentation. Front. Immunol. 12 33767702 10.3389/fimmu.2021.636568 PMC7986854 58. Caner A Immune escape mechanism of cancer Curr. Mol. Biology Rep. 2024 10 1 9 19 10.1007/s40610-023-00157-2 Caner, A. Immune escape mechanism of cancer. Curr. Mol. Biology Rep. 10 59. Bogatyreva NS Finkelstein AV Galzitskaya OV Trend of amino acid composition of proteins of different taxa J. Bioinform Comput. Biol. 2006 4 2 597 608 10.1142/S0219720006002016 16819805 Bogatyreva, N. S., Finkelstein, A. V. & Galzitskaya, O. V. Trend of amino acid composition of proteins of different taxa. J. Bioinform Comput. Biol. 4 16819805 10.1142/s0219720006002016 60. Joffre OP Cross-presentation by dendritic cells Nat. Rev. Immunol. 2012 12 8 557 569 10.1038/nri3254 22790179 Joffre, O. P. et al. Cross-presentation by dendritic cells. Nat. Rev. Immunol. 12 22790179 10.1038/nri3254 61. Wieczorek, M. et al. Major histocompatibility complex (MHC) class I and MHC class II proteins: conformational plasticity in antigen presentation. Front. Immunol. 8 10.3389/fimmu.2017.00292 PMC5355494 28367149 ",
  "metadata": {
    "Title of this paper": "Cross-presentation by dendritic cells",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12475488/"
  }
}