{
  "title": "Paper_681",
  "abstract": "pmc World J Oncol World J Oncol 1691 wjoncol Elmer Press World Journal of Oncology 1920-4531 1920-454X Elmer Press PMC12479076 PMC12479076.1 12479076 12479076 41030639 10.14740/wjon2640 1 Original Article Targeting the Phosphoinositide 3-Kinase/Protein Kinase B Pathway Suppresses Y-Box Binding Protein 1 Expression and Inhibits Colorectal Cancer Progression Targeting PI3K/AKT Lowers YBX1 in CRC Shan Hui a c Wang Yan a c Hu Siyu a Wang Yuting a Qin Rong a Zhang Niu a Tian Guangyu b d Qiu Zhiyuan a d a b c d 982987130@qq.com qzyjsu@sina.com 10 2025 17 9 2025 16 5 497814 487 501 9 7 2025 22 8 2025 17 09 2025 30 09 2025 01 10 2025 Copyright 2025 Authors. 2025 https://creativecommons.org/licenses/by-nc/4.0/ This article is distributed under the terms of the Creative Commons Attribution Non-Commercial 4.0 International License, which permits unrestricted non-commercial use, distribution, and reproduction in any medium, provided the original work is properly cited. Background Colorectal cancer (CRC) is one of the most prevalent and lethal malignancies worldwide, often characterized by the aberrant activation of multiple signaling pathways. Y-box binding protein 1 (YBX1), a multifunctional regulator of transcription and translation, has been identified as an oncogenic factor in various solid tumors. However, its expression profile and mechanistic role in CRC remain largely unclear. Methods In this study, integrative bioinformatic analyses were conducted on The Cancer Genome Atlas (TCGA) and Gene Expression Omnibus (GEO) datasets to assess YBX1 expression and its correlation with CRC progression. Functional assays, including cell proliferation and migration assays, were performed to investigate the role of YBX1 in CRC cells. The impact of YBX1 on the phosphoinositide 3-kinase/protein kinase B (PI3K/AKT) signaling pathway was evaluated, and the effects of the PI3K inhibitor buparlisib (BKM120) on YBX1-driven cellular phenotypes were also tested. Results YBX1 was found to be significantly upregulated in CRC tissues and was closely associated with the activation of the PI3K/AKT signaling pathway. YBX1 overexpression promoted CRC cell proliferation and migration, whereas knockdown of YBX1 inhibited these processes. Mechanistically, YBX1 was shown to enhance PI3K/AKT signaling activity, promoting malignant phenotypes in CRC. Treatment with BKM120 partially reversed these effects. Additionally, Gene Set Enrichment Analysis (GSEA) identified enrichment of reactive oxygen species (ROS)-related pathways in YBX1-high CRC samples. Conclusions This study highlights the oncogenic role of YBX1 in CRC and reveals a potential YBX1-PI3K/AKT regulatory axis that may serve as a promising therapeutic target. The findings suggest that targeting this axis could provide a novel strategy for CRC treatment, especially under hypoxic or microenvironmental stress conditions. Colorectal cancer YBX1 PI3K/AKT signaling pathway BKM120 Hypoxia This research was funded by “Liu Ge Yi Gong Cheng” of Jiangsu Province (grant no. LGY2017022), Social Development Foundation of Zhenjiang (SH2022055), Medical Research Project of Yangzhou Health Commission 2023 (2023-2-28), and Science Foundation of the Affiliated People’s Hospital of Jiangsu University (Y2019021-S). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Colorectal cancer (CRC) is the third most common malignancy worldwide and one of the leading causes of cancer-related mortality [ 1 2 3 Y-box binding protein 1 (YBX1) is a highly conserved nucleic acid-binding protein that plays dual roles in the regulation of transcription and translation. It plays a role in various essential biological processes, including DNA repair, mRNA splicing, and protein synthesis [ 4 5 6 7 8 9 In this study, we analyzed The Cancer Genome Atlas (TCGA) and Gene Expression Omnibus (GEO) datasets and found that YBX1 is significantly upregulated in CRC tissues and is closely associated with tumor differentiation grade [ 10 in vitro 11 Materials and Methods Data and resources The CRC-related transcriptomic data used in this study were obtained primarily from the GEO and TCGA database. Five public datasets, including GSE21815 GSE31905 GSE35279 GSE41657 GSE81558 For functional enrichment analysis, Gene Set Enrichment Analysis (GSEA) software was used to perform pathway enrichment analysis on differentially expressed genes in the TCGA samples of YBX1 high and low expression groups. Pathways potentially related to the function of YBX1 were identified, providing a reference for subsequent mechanistic studies. All the data and analysis tools used were publicly available and comply with the relevant usage guidelines. All experiments were conducted using established cell lines under standard laboratory conditions. The study did not involve human participants, identifiable personal data, or animal experimentation. Hence, ethical approval was not required, in accordance with institutional and journal policies. Cell culture and treatments This study used six cell lines, including five human CRC cell lines (Caco-2, HCT 116, HT-29, SW480, and SW620) and one mouse fibroblast cell line (L929). The Caco-2 cells were cultured in high-glucose Dulbecco’s Modified Eagle Medium (DMEM, Gibco) containing 20% fetal bovine serum (FBS, Gibco); HCT 116 and HT-29 cells were cultured in McCoy’s 5A medium (Gibco) with 10% FBS; SW480 and SW620 cells were cultured in high-glucose DMEM containing 10% FBS. L929 cells were cultured in high-glucose DMEM with 10% FBS. All cells were maintained in a 37 °C, 5% CO 2 For the drug treatment experiments, HCT 116, HT-29, SW480, and SW620 cells, as well as stable cell lines with interference or overexpression of YBX1, were treated with 300 µM cobalt chloride (CoCl 2 50 2 RNA isolation, reverse transcription, and quantitative real-time polymerase chain reaction (qRT-PCR) The CRC cell lines used in this study include Caco-2, HCT 116, HT-29, SW480, and SW620. Once the cells reached an appropriate density, total RNA was extracted using Trizol reagent (Takara Bio, Japan) according to the manufacturer’s instructions. The concentration and purity of the extracted RNA were measured using a NanoDrop 2000 spectrophotometer (Thermo Fisher Scientific, USA), and equal amounts of RNA were used to synthesize cDNA using the PrimeScript RT reagent kit (Takara, Japan). For qRT-PCR, 2× SYBR Green premix (Takara, Japan) was used, and reactions were performed on a 7500 Real-Time PCR system (Applied Biosystems, USA). The primer sequences for target genes are as follows: 18sRNA (forward: 5'-TGCGAGTACTCAACACCAACA-3', reverse: 5'-GCATATCTTCGGCCCACA-3'), YBX1 (forward: 5'-TAGACGCTATCCACGTCGTAG-3', reverse: 5'-ATCCCTCGTTCTTTTCCCCAC-3'), hypoxia-inducible factor 1-alpha (HIF-1α) (forward: 5'-GAACGTCGAAAAGAAAAGTCTCG-3', reverse: 5'-CCTTATCAAGATGCGAACTCACA-3'). In the experiment, 18S rRNA was used as an internal reference gene, and the relative gene expression levels were calculated using the 2 - Western blot assay Total protein was extracted from cells using RIPA lysis buffer (P0013B, Beyotime, Shanghai, China) containing protease and phosphatase inhibitors (ab201119, Abcam, Shanghai, China). The protein concentration was determined using a BCA protein assay kit (Pierce Biotechnology, USA) according to the manufacturer’s instructions. Equal amounts of protein were separated by SDS-PAGE and transferred to a nitrocellulose (NC) membrane (BioTrace™ NT, PALL). The membrane was blocked with 5% non-fat dry milk for 1 h at room temperature and then incubated with primary antibodies overnight at 4 °C. The primary antibodies used in this study include: YBX1 (1:10,000, Proteintech, 20339-1-AP), HIF-1α (1:1,000, Cell Signaling Technology, #36169), AKT (1:2,000, Proteintech, 10176-2-AP), p-AKT (Ser473) (1:2,000, Proteintech, 66444-1-Ig), and GAPDH (1:10,000, Proteintech, 10494-1-AP). The next day, the membrane was incubated with horseradish peroxidase (HRP)-conjugated secondary antibodies for 1 h at room temperature, and protein bands were detected using an ECL chemiluminescent reagent kit. Western blot densitometric analysis Western blot band intensities were quantified using ImageJ software (National Institutes of Health, Bethesda, MD, USA). For each blot, the intensity of the target protein bands (e.g., HIF-1α) was normalized to the corresponding GAPDH band to correct for loading variations. Relative expression levels were calculated by setting the control group to 1.0, and values from at least three independent experiments were averaged. The results are presented as mean ± standard deviation (SD). Statistical significance was determined using Student’s t Lentiviral transduction To overexpress YBX1, lentiviral vectors carrying the YBX1 gene were purchased from Heyuan Bio (Shanghai, China) HT-29 and SW480 cells were then infected with these vectors according to the manufacturer’s instructions. After infection, cells were selected with 10 µg/mL blasticidin for 2 weeks to establish stable YBX1 overexpressing cell lines. To knock down YBX1, lentiviral vectors carrying shRNA sequences targeting YBX1 were used to infect HCT 116 and SW620 cells. The specific shRNA sequences are as follows: shYBX1-1: 5'-CCAGTTCAAGGCAGTAAATAT-3'; shYBX1-2: 5'-AGCAGACCGTAACCATTATAG-3'; shYBX1-3: 5'-GACGGCAATGAAGAAGATAAA-3'. After infection, cells were selected with 5 µg/mL puromycin for 2 weeks to establish stable YBX1 knockdown cell lines. The efficiency of YBX1 overexpression or knockdown in each cell line was verified by qRT-PCR and Western blot. siRNA transfection YBX1 targeting siRNA and negative control siRNA were purchased from GenePharm (Shanghai, China) for transfection into HCT 116 and SW620 CRC cells. The transfection was performed according to the manufacturer’s instructions. Cells were collected 48 h after transfection for siRNA efficiency validation and subsequent experiments. The antisense sequences for the siRNAs used are as follows: siYBX1-1 (YBX1-Homo-524): 5'-UAUCCGUUCCUUACAUUGAAC-3'; siYBX1-2 (YBX1-Homo-620): 5'-CCUACACUGCGAAGGUACUUC-3'. Cell proliferation and colony formation assay Cell proliferation was assessed using the cell counting kit-8 (CCK-8) method. Cells (1 - 2 × 10 3 For colony formation assays, 1 × 10 3 Transwell migration assay The cell migration assay was performed using Transwell chambers with an 8-µm pore size (JET BOIFIL, Guangzhou, China). Cells (5 × 10 4 2 Immunofluorescence (IF) staining Bone marrow-derived macrophages (BMDMs) were isolated from C57BL/6 mice and differentiated. The cells were then seeded onto sterile coverslips and incubated in a 37 °C, 5% CO 2 After treatment, cells were washed twice with 1× PBS, fixed with 4% paraformaldehyde for 15 min, and permeabilized with 0.1% Triton X-100 at room temperature for 10 min. Non-specific binding sites were blocked with 5% bovine serum albumin (BSA) for 1 h, followed by overnight incubation with primary antibodies at 4 °C. Primary antibodies included anti-iNOS and anti-Arg-1 antibodies (both purchased from Abclonal), used to detect M1 and M2 macrophage polarization. On the following day, the cells were incubated with Alexa Fluor 488 goat anti-rabbit IgG (green) secondary antibody for 1 h at room temperature and stained with DAPI (blue) to label cell nuclei. Cytoskeletal structure was stained with fluorescein isothiocyanate (FITC)-labeled phalloidin (Biosharp, green). All images were captured using an inverted fluorescence microscope, and fluorescence signals were observed and quantified using ImageJ software. Quantification was performed on ≥ 5 random fields per condition from ≥ 3 independent biological replicates. For each field, mean fluorescence intensity (MFI) of induced nitric oxide synthase (iNOS) and Arg-1 was measured with identical regions of interest (ROIs) and local background subtraction in ImageJ; values were normalized within each experiment to the LPS + vehicle group (set to 1.0). Data are presented as mean ± SD and were analyzed by two-tailed Student’s t post hoc Live/dead cell staining assay To evaluate the toxicity of the PI3K/AKT pathway inhibitor BKM120 on normal cells, L929 mouse fibroblast cells underwent live/dead cell staining using Calcein-AM/PI dual staining. Cells were seeded in six-well plates at a density of 2 × 10 4 2 After treatment, the culture medium was discarded, and cells were washed twice with PBS. Aworking solution of Calcein-AM and propidium iodide (PI) working solution (Biosharp, China) was added according to the manufacturer’s instructions, after which the cells were incubated in the dark at room temperature for 15 min. After staining, the cells were observed under an inverted fluorescence microscope, and images were collected. Green fluorescence (Calcein-AM) represents live cells, and red fluorescence (PI) represents dead cells. Image analysis was performed using ImageJ software to quantify the proportion of dead cells in different treatment groups and evaluate the toxicity of BKM120 on L929 normal cells. Results YBX1 high expression in CRC and its association with the PI3K/AKT pathway To investigate the expression characteristics of YBX1 in CRC, we first conducted bioinformatics analyses using TCGA and GEO datasets, including GSE21815 GSE31905 GSE35279 GSE44076 Fig. 1c, e Figure 1 YBX1 high expression in CRC and its association with the PI3K/AKT pathway. (a) Schematic diagram showing the potential mechanism of YBX1 in CRC. (b) GSEA showing significant enrichment of the PI3K/AKT/mTOR signaling pathway in YBX1 high-expression samples. (c) GEO database analysis ( GSE21815 GSE31905 GSE35279 GSE44076 Survival analysis indicated that high YBX1 expression was closely associated with lower tumor differentiation grade and poorer overall prognosis ( Fig. 1d Fig. 1b Taken together, these findings collectively suggest that YBX1 is upregulated in CRC and may contribute to tumor progression via activation of the PI3K/AKT signaling pathway, thereby providing a mechanistic basis for further functional validation and therapeutic exploration. YBX1 regulates proliferation and colony formation of CRC cells To assess the functional role of YBX1, we initially examined its expression across five CRC cell lines ( Fig. 2a Supplementary Material 1A wjon.elmerpub.com Fig. 2b Supplementary Material 1B, C wjon.elmerpub.com Fig. 2c, d Fig. 2c, d Figure 2 YBX1 regulates CRC cell proliferation and colony formation. (a) Expression levels of YBX1 in five CRC cell lines. (b) Western blot verification of YBX1 knockdown in HCT 116 and SW620 cells and YBX1 overexpression in HT-29 and SW480 cells. (c) CCK-8 assays showing that YBX1 knockdown inhibits cell proliferation, while overexpression promotes cell proliferation. (d) Colony formation assays showing that YBX1 knockdown decreases colony formation ability, while overexpression enhances colony formation ability. CCK-8: cell counting kit-8; CRC: colorectal cancer; YBX1: Y-box binding protein 1. YBX1 promotes CRC cell migration Transwell migration assays further confirmed that YBX1 significantly enhanced CRC cell migration ability, suggesting that it plays a key role in promoting the malignant progression of colorectal cancer ( Fig. 3a, b Figure 3 YBX1 promotes CRC cell migration. (a) Transwell migration assay showing that YBX1 knockdown significantly reduces migration ability in HCT 116 and SW620 cells. (b) YBX1 overexpression significantly enhances migration ability in HT-29 and SW480 cells. CRC: colorectal cancer; YBX1: Y-box binding protein 1. YBX1 functional differences in different cellular contexts may be related to its phosphorylation status Overexpression of YBX1 in HT-29 cells may exhibit functional reversal due to multi-site phosphorylation, changing its structural state and resulting in a “dominant negative” phenotype. These findings underscore the importance of considering not only the total protein levels of YBX1 in targeted studies, but also its phosphorylation status and specific post-translational modification sites, which may critically influence its oncogenic potential. YBX1 regulates HIF-1α expression and participates in hypoxic response GSEA revealed that the HALLMARK_REACTIVE_OXYGEN_SPECIES_PATHWAY was significantly enriched in YBX1 high-expression samples in multiple GEO CRC cohorts ( GSE21815 GSE31905 GSE35279 GSE41657 Fig. 4a Figure 4 YBX1 regulates HIF-1α expression and participates in hypoxic response. (a) GSEA analysis showing significant enrichment of the ROS signaling pathway in YBX1 high-expression samples. (b) Effect of YBX1 knockdown on HIF-1α under normoxia and CoCl 2 To further explore the potential role of YBX1 in hypoxic responses, we established CRC cell models with YBX1 knockdown and overexpression, combined with CoCl 2 In SW620, YBX1 knockdown consistently reduced HIF-1α protein levels, and this reduction remained evident under hypoxia ( Fig. 4b2 Fig. 4b1 Fig. 4b, c Quantitative analysis confirmed these trends ( Supplementary Material 1D-F wjon.elmerpub.com RNA-seq suggests PI3K/AKT pathway may regulate YBX1 expression To further explore the upstream regulatory mechanisms of YBX1 expression, we performed RNA sequencing analysis on YBX1 knockdown and control groups. The results revealed that multiple tumor-associated pathways, including PI3K/AKT and MAPK, were significantly downregulated upon YBX1 knockdown, suggesting its involvement in coordinating key oncogenic networks. Several downstream key genes showed decreased expression in the YBX1 knockdown group, suggesting that this pathway might serve as an important upstream regulator of YBX1 expression ( Supplementary Materials 2 3 wjon.elmerpub.com PI3K inhibitor BKM120 downregulates YBX1 expression To verify the regulatory relationship between the PI3K/AKT pathway and YBX1 expression, we treated CRC cells with the PI3K inhibitor BKM120 for 24 h. The results showed that BKM120 significantly inhibited the phosphorylation level of AKT (p-AKT expression decreased), while the total AKT expression remained unchanged. Meanwhile, YBX1 protein expression also significantly decreased, suggesting that YBX1 expression is positively regulated by the PI3K/AKT pathway ( Fig. 5a-c Figure 5 BKM120 downregulates YBX1 expression and promotes M1 polarization of macrophages. (a) IC 50 50 Inhibition of PI3K/AKT pathway affects macrophage polarization To preliminarily explore the potential impact of PI3K/AKT/YBX1 pathway inhibition on the tumor-associated immune microenvironment, we further examined the effect of BKM120 on the polarization of BMDMs. BMDMs were exposed to different concentrations of BKM120 (0, 2, 5, and 8 µM) for 24 h, and immunofluorescence results showed that the expression of the M1 marker iNOS gradually increased, while the expression of the M2 marker Arg-1 decreased. These results indicate that PI3K/AKT signaling may influence macrophage polarization dynamics, and its inhibition promotes a pro-inflammatory M1 phenotype, which could enhance anti-tumor immunity in the CRC microenvironment ( Figs. 5d 6a Figure 6 BKM120 promotes M1 polarization of macrophages and toxicity assessment. (a) Immunofluorescence staining showing decreased Arg-1 expression in BMDMs after BKM120 treatment. These results suggest that PI3K/AKT pathway inhibition might promote macrophage polarization towards M1, improving the tumor immune microenvironment. (b) The results show that at the concentrations of the drug used, L929 cells exhibited good vitality, indicating that the concentration of BKM120 is safe. AKT: protein kinase B; BKM120: buparlisib; BMDMs: bone marrow-derived macrophages; PI3K: phosphoinositide 3-kinase. Toxicity of BKM120 on L929 cells To further evaluate the safety of BKM120 in CRC cell models, we conducted a toxicity experiment using L929 mouse fibroblasts. Cells were cultured with different concentrations of BKM120, and cell viability was assessed by live/dead staining (Calcein-AM/PI staining). The results showed that at the concentrations used, L929 cells exhibited good vitality ( Fig. 6b Discussion Increasing evidence suggests that in addition to genetic mutations, alterations in molecular regulatory networks play critical roles in driving CRC progression, therapy resistance, and immune evasion. Therefore, further elucidation of novel molecular mechanisms is essential for identifying new therapeutic strategies. YBX1 is a multifunctional nucleic acid-binding protein, but the expression patterns, functional roles, and upstream regulation of YBX1 in CRC are not fully understood. In this study, we revealed that YBX1 is significantly overexpressed in CRC tissues and correlates with poor prognosis. Functional experiments further demonstrated that YBX1 promotes CRC cell proliferation and migration, and is positively regulated by PI3K/AKT signaling ( Fig. 2 The PI3K/AKT signaling pathway is a core pathway that regulates cell growth, metabolism, survival, and migration. Persistent activation of this pathway has been observed in various malignancies [ 12 13 13 14 Increasing attention has been paid to the role of YBX1 in the hypoxic tumor microenvironment. Recent studies have shown that YBX1 promotes HIF-1α expression via PI3K/AKT signaling, thereby enhancing tumor adaptation to hypoxia [ 15 16 Fig. 7 Figure 7 Proposed schematic model of the PI3K/AKT-YBX1-HIF-1α regulatory axis driving hypoxic adaptation and CRC progression. AKT: protein kinase B; CRC: colorectal cancer; HIF-1α: hypoxia-inducible factor 1-alpha; PI3K: phosphoinositide 3-kinase; YBX1: Y-box binding protein 1. RNA sequencing and GSEA analysis indicated that the PI3K/AKT signaling pathway might be involved in the upstream regulation of YBX1 expression. After treating CRC cells with the PI3K inhibitor BKM120, we observed a significant reduction in p-AKT and YBX1 protein levels, confirming the positive regulation of YBX1 by the PI3K/AKT pathway [ 17 Fig. 6b 18 Notably, YBX1 overexpression in HT-29 cells suppressed proliferation and migration, contrasting with its typical oncogenic role in other CRC cell lines, suggesting a context-dependent regulatory mechanism. This phenomenon is different from its oncogenic effects in other cell lines. To address this discrepancy, we investigated the phosphorylation status of YBX1 and found that its overexpression in HT-29 cells was associated with significantly increased phosphorylation [ 19 Fig. 2b Previous studies have demonstrated that YBX1 phosphorylation at different sites can lead to different outcomes. For instance, phosphorylation at Ser102 [ 20 21 22 23 24 19 25 Table 1 26 Figs. 2d 3b Table 1 Impact of Different Phosphorylation Sites on YBX1 Functional Regulation Phosphorylation site Regulating kinase Functional direction Mechanism description Ser102 [ 20 22 Akt, RSK, mTOR Oncogenic Promotes YBX1 nuclear translocation, enhances its transcriptional activation ability, and regulates the expression of target genes such as EGFR and Snail. Ser165 [ 23 Unknown Tumor suppressive (speculated) May lead to inhibition of YBX1’s transcriptional activity; further verification is needed. Ser176 [ 19 CKI (indirect regulation, induced by IL-1β) Oncogenic Phosphorylation at Ser176 activates the NF-κB signaling pathway in CRC cells, promoting YBX1 nuclear translocation and transcriptional activation, an important regulatory point for its oncogenic function. Thr80 [ 24 Unknown Unclear May affect YBX1 stability and its RNA-binding ability. Multi-site phosphorylation [ 26 Multi-pathway activation Biphasic function Excessive phosphorylation may cause nuclear exclusion or non-functional aggregation, resulting in transcriptional inactivation or a “dominant negative” effect. AKT: protein kinase B; CKI: casein kinase I; CRC: colorectal cancer; EGFR: epidermal growth factor receptor; IL: interleukin; mTOR: mammalian target of rapamycin; NF-κB: nuclear factor-κB; RSK: ribosomal S6 kinase; Ser: serine; Thr: threonine; YBX1: Y-box binding protein 1. Table 1 Previous studies have highlighted the dual roles of YBX1 phosphorylation in tumor biology depending on the cellular context. Bai et al [ 27 28 The functional heterogeneity of YBX1 highlights the complexity of its regulation. While most CRC cell lines exhibit enhanced proliferation and migration when YBX1 is overexpressed, HT-29 cells display the opposite trend, which is likely due to differential phosphorylation patterns. These findings highlight the importance of cellular context and kinase activity in determining YBX1’s role, and suggest a potential mechanism for its dual functions in cancer progression. Further studies are needed to elucidate how specific phosphorylation signatures dictate YBX1’s switch between oncogenic and tumor-suppressive states [ 29 Thus, we speculate that overexpression of YBX1 in HT-29 cells may result in functional reversal due to high-level phosphorylation, which changes its structural state. This observation suggests that in studies targeting YBX1, attention should not only be paid to its total protein levels, but also to its phosphorylation status and specific modification sites. In addition to its role in regulating proliferation and migration through phosphorylation modifications, we also explored the involvement of YBX1 in hypoxic responses through the PI3K/AKT-HIF-1α axis. GSEA revealed that the HALLMARK_REACTIVE_OXYGEN_SPECIES_PATHWAY was significantly enriched in YBX1 high-expression samples in multiple GEO CRC cohorts ( GSE21815 GSE31905 GSE35279 GSE41657 Fig. 4a To further investigate this possibility, we established CRC cell models with YBX1 knockdown and overexpression, combined with CoCl 2 Fig. 4b Fig. 4c This phenomenon may be attributed to YBX1-mediated modulation of oxidative stress under hypoxic conditions, either through direct interaction with HIF-1α or through increased ROS accumulation, leading to the suppression of HIF-1α transcriptional activity [ 30 29 31 32 Although YBX1 is generally considered to promote HIF-1α expression, our results demonstrate that under specific hypoxic conditions, YBX1 may inhibit excessive accumulation of HIF-1α through a negative feedback mechanism. These findings highlight the complex and context-dependent regulatory roles of YBX1 in tumor hypoxic microenvironments. Moreover, considering that PI3K/AKT signaling is a well-known regulator of both hypoxic adaptation and HIF-1α expression, and that our previous experiments demonstrated PI3K/AKT-dependent regulation of YBX1 in CRC cells, it is reasonable to propose that PI3K/AKT activation promotes YBX1 upregulation, which in turn modulates HIF-1α dynamics under hypoxic conditions. Based on our findings, we propose a conceptual model ( Fig. 7 Beyond its role in hypoxia, YBX1 may also influence immune modulation [ 33 35 36 37 Although our study demonstrated that BKM120 treatment promotes M1 polarization of BMDMs, suggesting its potential role in modulating the tumor immune microenvironment, the specific mechanisms by which BKM120 influences immune cell subsets such as TAMs, Tregs, and MDSCs in CRC remain to be elucidated. Future studies should investigate whether BKM120, alone or in combination with immunotherapies, can effectively modulate these immune cells to enhance anti-tumor immunity in CRC. Supplementary Material Suppl 1 Effect of YBX1 expression on mRNA levels in CRC cells under normoxic and hypoxic conditions. Suppl 2 Heatmap of RNA-seq analysis. Suppl 3 Heatmap and volcano plot of RNA-seq analysis. The authors would like to thank Zhenjiang First People’s Hospital for their valuable support and assistance during this study. Conflict of Interest The authors declare no conflict of interest. Informed Consent Not applicable. Author Contributions Hui Shan: conceptualization, validation, writing - original draft, writing - review and editing; Yan Wang: conceptualization, writing - review and editing; Siyu Hu: data curation and visualization; Yuting Wang: formal analysis and software; Rong Qin: funding acquisition; Niu Zhang: investigation; Guangyu Tian: methodology, resources, and supervision; Zhiyuan Qiu: project administration, supervision, writing - review and editing. Data Availability The authors declare that data supporting the findings of this study are available within the article. Abbreviations AKT protein kinase B BKM120 buparlisib (PI3K inhibitor) BMDMs bone marrow-derived macrophages CCK-8 cell counting kit-8 CKI casein kinase I CRC colorectal cancer EGFR epidermal growth factor receptor GEO Gene Expression Omnibus GEPIA Gene Expression Profiling Interactive Analysis GSEA Gene Set Enrichment Analysis IARC International Agency for Research on Cancer MDSCs myeloid-derived suppressor cells PBS phosphate-buffered saline PI3K phosphoinositide 3-kinase qRT-PCR quantitative real-time polymerase chain reaction ROS reactive oxygen species Ser serine TCGA The Cancer Genome Atlas Thr threonine Tregs regulatory T cells YBX1 Y-box binding protein 1 References 1 Bray F Ferlay J Soerjomataram I Siegel RL Torre LA Jemal A Global cancer statistics 2018: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2018 68 6 394 424 10.3322/caac.21492 30207593 2 Siegel RL Miller KD Goding Sauer A Fedewa SA Butterly LF Anderson JC Cercek A et al Colorectal cancer statistics, 2020 CA Cancer J Clin 2020 70 3 145 164 10.3322/caac.21601 32133645 3 Sung H Ferlay J Siegel RL Laversanne M Soerjomataram I Jemal A Bray F Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2021 71 3 209 249 10.3322/caac.21660 33538338 4 Li H Zhang D Fu Q Wang S Wang Z Zhang X Chen X et al YBX1 as an oncogenic factor in T-cell acute lymphoblastic leukemia Blood Adv 2023 7 17 4874 4885 10.1182/bloodadvances.2022009648 37339496 PMC10469076 5 Xie Q Zhao S Liu W Cui Y Li F Li Z Guo T et al YBX1 Enhances Metastasis and Stemness by Transcriptionally Regulating MUC1 in Lung Adenocarcinoma Front Oncol 2021 11 702491 10.3389/fonc.2021.702491 34976785 PMC8714800 6 Krishnamoorthy HR Karuppasamy R Deciphering the prognostic landscape of triple-negative breast cancer: A focus on immune-related hub genes and therapeutic implications Biotechnol Appl Biochem 2025 72 3 825 845 10.1002/bab.2700 39587411 7 Tang T Yang T Xue H Liu X Yu J Liang C Li D et al Breast cancer stem cell-derived exosomal lnc-PDGFD induces fibroblast-niche formation and promotes lung metastasis Oncogene 2025 44 9 601 617 10.1038/s41388-024-03237-4 39633064 PMC11850284 8 Zhuo H Hou J Hong Z Yu S Peng H Zhang L Xie W et al TAGLN2 induces resistance signature ISGs by activating AKT-YBX1 signal with dual pathways and mediates the IFN-related DNA damage resistance in gastric cancer Cell Death Dis 2024 15 8 608 10.1038/s41419-024-07000-1 39168971 PMC11339399 9 Huang M Sun J Jiang Q Zhao X Huang H Lei M Jiang S et al CircKIAA0182-YBX1 axis: a key driver of lung cancer progression and chemoresistance Cancer Lett 2025 612 217494 10.1016/j.canlet.2025.217494 39862920 10 Li Z Lu W Yin F Huang A YBX1 as a prognostic biomarker and potential therapeutic target in hepatocellular carcinoma: a comprehensive investigation through bioinformatics analysis and in vitro study Transl Oncol 2024 45 101965 10.1016/j.tranon.2024.101965 38688048 PMC11070759 11 Hou P Chen F Yong H Lin T Li J Pan Y Jiang T et al PTBP3 contributes to colorectal cancer growth and metastasis via translational activation of HIF-1alpha J Exp Clin Cancer Res 2019 38 1 301 10.1186/s13046-019-1312-y 31291975 PMC6622005 12 Leiphrakpam PD Are C PI3K/Akt/mTOR signaling pathway as a target for colorectal cancer treatment Int J Mol Sci 2024 25 6 10.3390/ijms25063178 38542151 PMC10970097 13 Maharati A Moghbeli M PI3K/AKT signaling pathway as a critical regulator of epithelial-mesenchymal transition in colorectal tumor cells Cell Commun Signal 2023 21 1 201 10.1186/s12964-023-01225-x 37580737 PMC10424373 14 Sheng Z Luo S Huang L Deng YN Zhang N Luo Y Zhao X et al SENP1-mediated deSUMOylation of YBX1 promotes colorectal cancer development through the SENP1-YBX1-AKT signaling axis Oncogene 2025 44 19 1361 1374 10.1038/s41388-025-03302-6 39988696 PMC12052596 15 Semenza GL Targeting HIF-1 for cancer therapy Nat Rev Cancer 2003 3 10 721 732 10.1038/nrc1187 13130303 16 Zhao J Zhang P Wang X YBX1 promotes tumor progression via the PI3K/AKT signaling pathway in laryngeal squamous cell carcinoma Transl Cancer Res 2021 10 11 4859 4869 10.21037/tcr-21-2087 35116338 PMC8797748 17 Liu T Xie XL Zhou X Chen SX Wang YJ Shi LP Chen SJ et al Y-box binding protein 1 augments sorafenib resistance via the PI3K/Akt signaling pathway in hepatocellular carcinoma World J Gastroenterol 2021 27 28 4667 4686 10.3748/wjg.v27.i28.4667 34366628 PMC8326262 18 Vergadi E Ieronymaki E Lyroni K Vaporidi K Tsatsanis C Akt signaling pathway in macrophage activation and M1/M2 polarization J Immunol 2017 198 3 1006 1014 10.4049/jimmunol.1601515 28115590 19 Martin M Hua L Wang B Wei H Prabhu L Hartley AV Jiang G et al Novel serine 176 phosphorylation of YBX1 activates NF-kappaB in colon cancer J Biol Chem 2017 292 8 3433 3444 10.1074/jbc.M116.740258 28077578 PMC5336175 20 Evdokimova V Ruzanov P Anglesio MS Sorokin AV Ovchinnikov LP Buckley J Triche TJ et al Akt-mediated YB-1 phosphorylation activates translation of silent mRNA species Mol Cell Biol 2006 26 1 277 292 10.1128/MCB.26.1.277-292.2006 16354698 PMC1317623 21 Jiang D Qiu T Peng J Li S Tala, Ren W Yang C et al YB-1 is a positive regulator of KLF5 transcription factor in basal-like breast cancer Cell Death Differ 2022 29 6 1283 1295 10.1038/s41418-021-00920-x 35022570 PMC9177637 22 Sutherland BW Kucab J Wu J Lee C Cheang MC Yorida E Turbin D et al Akt phosphorylates the Y-box binding protein 1 at Ser102 located in the cold shock domain and affects the anchorage-independent growth of breast cancer cells Oncogene 2005 24 26 4281 4292 10.1038/sj.onc.1208590 15806160 23 Evdokimova V Tognon C Ng T Ruzanov P Melnyk N Fink D Sorokin A et al Translational activation of snail1 and other developmentally regulated transcription factors by YB-1 promotes an epithelial-mesenchymal transition Cancer Cell 2009 15 5 402 415 10.1016/j.ccr.2009.03.017 19411069 24 Lyabin DN Eliseeva IA Ovchinnikov LP YB-1 protein: functions and regulation Wiley Interdiscip Rev RNA 2014 5 1 95 110 10.1002/wrna.1200 24217978 25 Kretov DA Mordovkina DA Eliseeva IA Lyabin DN Polyakov DN Joshi V Desforges B et al Inhibition of transcription induces phosphorylation of YB-1 at Ser102 and its accumulation in the nucleus Cells 2019 9 1 10.3390/cells9010104 31906126 PMC7016903 26 Eliseeva IA Kim ER Guryanov SG Ovchinnikov LP Lyabin DN Y-box-binding protein 1 (YB-1) and its functions Biochemistry (Mosc) 2011 76 13 1402 1433 10.1134/S0006297911130049 22339596 27 Bai Y Gotz C Chincarini G Zhao Z Slaney C Boath J Furic L et al YBX1 integration of oncogenic PI3K/mTOR signalling regulates the fitness of malignant epithelial cells Nat Commun 2023 14 1 1591 10.1038/s41467-023-37161-0 36949044 PMC10033729 28 Sogorina EM Kim ER Sorokin AV Lyabin DN Ovchinnikov LP Mordovkina DA Eliseeva IA YB-1 phosphorylation at serine 209 inhibits its nuclear translocation Int J Mol Sci 2021 23 1 428 10.3390/ijms23010428 35008856 PMC8745666 29 El-Naggar AM Veinotte CJ Cheng H Grunewald TG Negri GL Somasekharan SP Corkery DP et al Translational activation of HIF1alpha by YB-1 promotes sarcoma metastasis Cancer Cell 2015 27 5 682 697 10.1016/j.ccell.2015.04.003 25965573 30 Liu C Du H Yu G Qi J Dong H Hu R Wang F et al Chronic stress stimulates protumor macrophage polarization to propel lung cancer progression Cancer Res 2025 85 13 2429 2447 10.1158/0008-5472.CAN-24-3481 40202818 31 Wu F Li D YB1 and its role in osteosarcoma: a review Front Oncol 2024 14 1452661 10.3389/fonc.2024.1452661 39497723 PMC11532169 32 Chen SP Zhu GQ Xing XX Wan JL Cai JL Du JX Song LN et al LncRNA USP2-AS1 Promotes Hepatocellular Carcinoma Growth by Enhancing YBX1-Mediated HIF1alpha Protein Translation Under Hypoxia Front Oncol 2022 12 882372 10.3389/fonc.2022.882372 35692750 PMC9174509 33 Cui R Luo Z Zhang X Yu X Yuan G Li X Xie F et al Targeting PI3K signaling to overcome tumor immunosuppression: synergistic strategies to enhance cancer vaccine efficacy Vaccines (Basel) 2025 13 3 10.3390/vaccines13030292 40266213 PMC11946485 34 Okkenhaug K Graupera M Vanhaesebroeck B Targeting PI3K in cancer: impact on tumor cells, their protective stroma, angiogenesis, and immunotherapy Cancer Discov 2016 6 10 1090 1105 10.1158/2159-8290.CD-16-0716 27655435 PMC5293166 35 Sai J Owens P Novitskiy SV Hawkins OE Vilgelm AE Yang J Sobolik T et al PI3K inhibition reduces mammary tumor growth and facilitates antitumor immunity and anti-PD1 responses Clin Cancer Res 2017 23 13 3371 3384 10.1158/1078-0432.CCR-16-2142 28003307 PMC5479746 36 Li Y Jin H Li Q Shi L Mao Y Zhao L The role of RNA methylation in tumor immunity and its potential in immunotherapy Mol Cancer 2024 23 1 130 10.1186/s12943-024-02041-8 38902779 PMC11188252 37 Xiang J Wang J Xiao H Huang C Wu C Zhang L Qian C et al Targeting tumor-associated macrophages in colon cancer: mechanisms and therapeutic strategies Front Immunol 2025 16 1573917 10.3389/fimmu.2025.1573917 40191202 PMC11968422 ",
  "metadata": {
    "Title of this paper": "Targeting tumor-associated macrophages in colon cancer: mechanisms and therapeutic strategies",
    "Journal it was published in:": "World Journal of Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479076/"
  }
}