{
  "title": "Paper_422",
  "abstract": "pmc Front Genet Front Genet 1681 frontgene Front. Genet. Frontiers in Genetics 1664-8021 Frontiers Media SA PMC12483874 PMC12483874.1 12483874 12483874 41040664 10.3389/fgene.2025.1658299 1658299 1 Genetics Original Research Panoramic analysis of the biological function and clinical value of SLC38A2 in human cancers: a study based on pan-cancer and single-cell analysis Liao et al. 10.3389/fgene.2025.1658299 Liao Mao  1  † Rao Yuqing  2  † Li Molan  3  † Guo Jiayang  4 Guo Kun  1 Li Kaiyue  4 Zheng Rui  4 Liu Yifan  4 Wang Qianyi  4 Wang Manni  4 Chen Duo  5 Zhang Meng  4 Wang Yongfeng  6 Zhao Yanzong  4 *  ‡ Li Sheng  6 *  ‡  1 The Second Hospital & Clinical Medical School Lanzhou University Lanzhou China  2 College of International Education Henan University of Technology Zhengzhou China  3 The First Hospital & Clinical Medical School Lanzhou University Lanzhou China  4 School of Stomatology Lanzhou University Lanzhou China  5 School of Life Science Lanzhou University Lanzhou China  6 The First People’s Hospital of Lanzhou City Lanzhou China  Edited by: Domenico Mallardo  Reviewed by: Fatemeh Maghool  Pei Shengbin *Correspondence: Yanzong Zhao, zhaoyz21@lzu.edu.cn doctorlisheng@163.com  ‡ ORCID: Yanzong Zhao, orcid.org/0009-0001-3650-6092 orcid.org/0009-0009-2283-734X  † These authors have contributed equally to this work and share first authorship 17 9 2025 2025 16 481198 1658299 03 7 2025 27 8 2025 17 09 2025 02 10 2025 03 10 2025 Copyright © 2025 Liao, Rao, Li, Guo, Guo, Li, Zheng, Liu, Wang, Wang, Chen, Zhang, Wang, Zhao and Li. 2025 Liao, Rao, Li, Guo, Guo, Li, Zheng, Liu, Wang, Wang, Chen, Zhang, Wang, Zhao and Li https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Background Glutamine metabolic reprogramming is a hallmark of tumor progression and is highly correlated with poor clinical outcomes. The excessive uptake of glutamine by tumor cells is a key factor contributing to widespread invasion, metastasis, and immune suppression. SLC38A2, an amino acid transporter widely expressed on the surface of tumor cells, has not been thoroughly studied regarding its function and prognostic significance in tumor progression. Our objective is to employ bioinformatics methods to conduct a comprehensive and in-depth analysis of SLC38A2 across various cancers, aiming to elucidate its role and prognostic value in tumor biology. Methods By comprehensively incorporating gene expression and clinical data from the TCGA tumor database, GTEx database, Human Protein Atlas, and GEO database, we analyzed the expression profile, mutations, and established prognostic models for SLC38A2 across various cancers. Additionally, we investigated the enrichment of SLC38A2 at the single-cell level in 12 types of cancer and analyzed its temporal expression patterns in different cell subgroups in breast and pancreatic cancer. We also studied the correlation between SLC38A2 and glutathione metabolism. Results Compared to normal tissues, SLC38A2 exhibits significant differential expression in 15 types of cancer and serves as a prognostic risk factor in BRCA (HR = 1.597, p p p p p Conclusion SLC38A2 shows widespread changes in expression patterns within tumor tissues, making it an effective diagnostic and prognostic biomarker. It is enriched in malignant cells and tumor-infiltrating stromal cells, while negatively correlated with the infiltration of many cells involved in anti-tumor immunity. Targeting SLC38A2 presents a viable therapeutic strategy by inhibiting glutamine competition and relieving immune suppression in the tumor microenvironment. Graphical Abstract  Diagram showing SLC38A2 expression analysis utilizing TCGA databases with five components: Immune Modeling, Single-cell Sequencing, Glutamine Metabolism, Expression Analysis, and Survival Analysis. Each component is linked by arrows to the central TCGA Databases, GEO, and HPA. cancer slc38a2 glutamine metabolic reprogramming single-cell prognosis Natural Science Foundation of Gansu Province 10.13039/501100004775 24JRRA1201 The author(s) declare that financial support was received for the research and/or publication of this article. This study was supported by the Natural Science Foundation of Gansu Province (25JRRA790), the Minsheng Science and Technology Special Social Development Project (2021-004-SF0-0079), the Lanzhou Health and Wellness Industry Research Project (A2024010), and the Hui-Chun Chin and Tsung-Dao Lee Chinese Undergraduate Research Endowment (LZU JZH-2732). Additionally, the authors express their gratitude to TISCH2, Xiantao Academic, TISIDB, and the cBioPortal websites and databases for their contributions to this research. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Cancer Genetics and Oncogenomics 1 Introduction Malignant tumors, also known as cancer, remain the leading non-communicable disease threatening human health. Although molecular targeted therapy and immunotherapy have brought paradigm shifts in cancer management, the heterogeneity factors within the tumor microenvironment (TME) challenge standardized treatment strategies and may render these methods ineffective ( Kaur et al., 2023 Liu et al., 2023 Bejarano et al., 2021 Zhu et al., 2022 Vitale et al., 2019 Li et al., 2021a Li and Zhang, 2016 Li and Zhang, 2024 Lieu et al., 2020 Keenan and Chi, 2015 Lieu et al., 2020 Gao et al., 2009 Tran et al., 2017 Dilshara et al., 2017 Faubert et al., 2014 Niu et al., 2021 Kennedy et al., 2020 Recent studies indicate that tumor cells competitively sequester glutamine from the TME, affecting the activity of other cells in the tumor stroma and thereby influencing anti-tumor immune responses ( Koppula et al., 2021 Wang et al., 2024 Leone et al., 2019 Fu et al., 2019 Figure 1C Menchini and Chaudhry, 2019 Broer et al., 2016 Guo et al., 2023 Huang et al., 2020 Zhu et al., 2023 FIGURE 1  (A) (B) (C) (D) (E) (F) (G) (H) (I) (J) Box plots and graphs illustrate expression levels of SLC38A2 across various cancers, comparing normal and tumor tissues. Heatmaps and protein structures highlight differential gene expression patterns. Microscopic images show tissue staining for lung, liver, breast, head and neck, pancreas, and colon tissues, with distinctions between normal and cancerous states. Therefore, we integrated tumor gene and protein expression data from the TCGA, GTEx, Human Protein Atlas (HPA), and GEO databases. And by the using of bioinformatics methods, we comprehensively analyzed these data to elucidate the biological functions of SLC38A2 across various cancer types and its associations with tumor immunity and clinical prognosis. 2 Materials and methods 2.1 Cancer names and abbreviations The cancer names and abbreviations involved in this study include Adrenocortical Carcinoma (ACC), Bladder Urothelial Carcinoma (BLCA), Breast Invasive Carcinoma (BRCA), Cervical Squamous Cell Carcinoma and Endocervical Adenocarcinoma (CESC), Cholangiocarcinoma (CHOL), Colon Adenocarcinoma (COAD), Lymphoid Neoplasm Diffuse Large B-cell Lymphoma (DLBC), Esophageal Carcinoma (ESCA), Glioblastoma Multiforme (GBM), Head and Neck Squamous Cell Carcinoma (HNSC), Kidney Chromophobe (KICH), Kidney Renal Clear Cell Carcinoma (KIRC), Kidney Renal Papillary Cell Carcinoma (KIRP), Acute Myeloid Leukemia (LAML), Brain Lower Grade Glioma (LGG), Liver Hepatocellular Carcinoma (LIHC), Lung Adenocarcinoma (LUAD), Lung Squamous Cell Carcinoma (LUSC), Mesothelioma (MESO), Non-Small Cell Lung Cancer (NSCLC), Ovarian Serous Cystadenocarcinoma (OV), Pancreatic Adenocarcinoma (PAAD), Pheochromocytoma and Paraganglioma (PCPG), Prostate Adenocarcinoma (PRAD), Rectum Adenocarcinoma (READ), Sarcoma (SARC), Skin Cutaneous Melanoma (SKCM), Stomach Adenocarcinoma (STAD), Testicular Germ Cell Tumors (TGCT), Thyroid Carcinoma (THCA), Thymoma (THYM), Uterine Corpus Endometrial Carcinoma (UCEC), Uterine Carcinosarcoma (UCS), and Uveal Melanoma (UVM). 2.2 Data and sample information The foundational data for this study were sourced from the TCGA and GTEx databases, comprising 15,901 normal or adjacent tissue samples and 10,201 tumor tissue samples. These include gene expression data for SLC38A2 and clinical data from patients. Additionally, single-cell sequencing data from the National Institutes of Health (NIH) were utilized, covering datasets GSE176078 GSE168652 GSE138709 GSE166555 GSE162631 GSE171306 GSE166635 GSE162025 GSE162708 GSE141445 For TCGA data, we downloaded and organized RNAseq data from 33 cancer projects processed by the STAR pipeline and extracted the data in TPM format. We discarded data without corresponding clinical information and converted it to log 2 2.3 Expression profile of SLC38A2 in 33 common types of cancer From the TCGA expression database, we used the R packages “ggplot2”, “stats”, and “car” for data visualization, and apply the Wilcoxon rank sum test for statistical analysis. 2.4 Analysis of single-cell expression profile of SLC38A2 The scRNA-seq data for single-cell analysis was derived from 12 datasets, and the expression matrix transformation and batch effect correction were completed as described earlier. Subsequently, the “Seurat” package was used for quality control. Specifically, genes expressed in at least three cells and cells with at least 200 genes expressed were extracted for data initialization. During the filtering stage, cells with gene counts between 200 and 7,500 were retained, and cells with mitochondrial gene proportions exceeding 20% were removed ( Zhang et al., 2024 2.5 Analysis of correlation between SLC38A2 and clinical outcomes For the forest plot of SLC38A2 across various cancers, select OS (Overall Survival), DSS (Disease-Specific Survival), and PFI (Progression-Free Interval) as outcome variables. Use the “survival” package to test the proportional hazards assumption and perform univariate Cox regression analysis. For multivariate Cox regression analysis, we use Overall Survival (OS) as the outcome variable. The default clinical indicators included are pathologic M stage, pathologic T stage, pathologic N stage, gender, and age. For cancer types without TNM staging, we use the WHO classification standards. The proportional hazards assumption is tested using the survival package, followed by multivariate Cox regression analysis. Variables meeting the set p-value threshold in the univariate analysis are included in the multivariate Cox model construction. Visualize the forest plot using the “ggplot2” package. For survival curves, use the “survminer” and “ggplot2” packages for visualization. 2.6 Correlation between SLC38A2 and TME To analyze the correlation between SLC38A2 expression and immune infiltration matrix data across 33 types of cancer in the TCGA database, the ssGSEA algorithm provided by the R package “GSVA” was utilized. This involved calculating immune infiltration using markers of 24 immune cell types. Additionally, the “estimate” package was used to compute stromal and immune scores. Visualization was performed using the “ggplot2” package. 2.7 Pseudotemporal analysis of SLC38A2 expression Based on previous cell annotation results, divide the single-cell data in BRCA and PAAD into three major cell groups: malignant cells, immune cells, and stromal cells for independent trajectory analysis. Use the R package “Monocle3” for pseudotemporal analysis, apply “learn graph” to learn cell development trajectories, and use “order cells” to set the root node based on biological markers. Use “graph test” to identify differentially expressed genes along the trajectory. 2.8 Weighted gene co-expression network analysis (WGCNA) We obtained 580 samples from the LUAD cohort (58 normal tissues and 522 tumor tissues) and 503 samples from the COAD cohort (41 normal tissues and 462 tumor tissues) for differential analysis based on the expression profiles of 947 metabolism-related genes. Significant differentially expressed genes were identified using the DESeq2 algorithm. In COAD, 518 out of 947 metabolism-related genes (54.7%) were differentially expressed between normal (41 samples) and colorectal cancer (462 samples) tissues, with 253 genes upregulated and 265 genes downregulated in tumors. In LUAD, 244 out of 947 metabolism-related genes (25.7%) were differentially expressed between normal (58 samples) and lung adenocarcinoma (522 samples) tissues, with 160 genes upregulated and 84 genes downregulated in tumors. Subsequently, WGCNA was performed on the 244 and 518 differentially expressed genes in the two cancers, respectively. A scale-free topology network was constructed based on the soft threshold power, and co-expression modules were identified using the dynamic tree cut algorithm. After calculating module eigengenes, their Pearson correlation with clinicopathological features (T stage, N stage, pathological stage, and overall survival) was assessed. The clusterProfiler was used for KEGG pathway enrichment analysis of key modules, analyzing the blue module in LUAD and the yellow module in COAD. Based on the tumor samples from both, we first performed molecular subtyping using consensus clustering (ConsensusClusterPlus R package), determining the optimal number of clusters k = 3 through cumulative distribution function (CDF) analysis. Differential expression analysis (DESeq2 R package) was then conducted for the three subtypes (C1/C2/C3), and Kaplan-Meier survival analysis (survival R package) was used to evaluate prognostic differences among subtypes. 2.9 Drug sensitivity analysis We collected the half-maximal inhibitory concentration (IC 50 50 50 2.10 Statistical analysis The Wilcoxon test was used to calculate expression differences between groups. Log-rank and COX regression were employed to examine the significance of survival curve differences between high and low SLC38A2 expression groups. Spearman correlation analysis was used to assess the correlation between SLC38A2 expression and the TME (including immune score, stromal score, and immune cell infiltration). All data were log-transformed. All p-values were adjusted for false discovery using the Benjamini–Hochberg procedure. Significant associations in analyses required an FDR-adjusted p-value (q-value) < 0.05, and a p-value of less than 0.05 was considered statistically significant. 3 Results 3.1 Panoramic expression profile of SLC38A2 in cancer The results of the unpaired sample differential analysis indicate that SLC38A2 exhibits differential expressions in 14 types of cancer tissues compared to adjacent non-cancerous tissues. Specifically, SLC38A2 is overexpressed in eight types of cancer which include BLCA ( p p p p p p p p p p p p p p Figure 1A p p p p p p p p p p Figure 1B Immunohistochemistry results indicate that SLC38A2 expression is significantly lower in LIHC and PAAD compared to normal liver and pancreatic tissues. In contrast, its expression is higher in COAD compared to normal colonic epithelium. Additionally, the expression of SLC38A2 in lung, breast, and oral epithelial tissues, as well as their corresponding cancers (LUAD, BRCA and HNSC) were also examined ( Figures 1E–J The mutation analysis results indicate that the main types of mutations for SLC38A2 in cancer are amplification, mutation, and deep deletion. The top three cancers with the highest probability of these mutations are BLCA, DLBC, and UCEC ( Figure 1D 3.2 SLC38A2 is an independent risk factor of cancer Using overall survival (OS) as the evaluation metric, SLC38A2 serves as a risk factor for BRCA (HR = 1.597, p p p p p Figure 2A p p p Figure 2B p p Figure 2C Figure 2D Supplementary Material 1 FIGURE 2  (A) (B) (C) (D) Four panels illustrate survival analysis related to SLC38A2. Panel A shows a forest plot for overall survival across different cancer types with hazard ratios and confidence intervals. Panel B presents a similar plot for disease-specific survival. Panel C depicts a forest plot for progress-free interval. Panel D contains Kaplan-Meier curves demonstrating survival probabilities over time for specific cancers, with hazard ratios and p-values indicated. 3.3 The correlation between SLC38A2 and immune microenvironment The analysis results from the Estimate algorithm indicate that the expression of SLC38A2 is positively correlated with stromal scores in most cancer types, including BRCA, COAD, ESCA, KIRC, LIHC, LUAD, OV, PAAD, PCPG, PRAD, READ, STAD, TGCT, THCA, and UCS. In contrast, for immune scores, SLC38A2 exhibits a negative correlation pattern in cancers such as BLCA, BRCA, CESC, HNSC, KIRC, KIRP, LGG, LUAD, LUSC, SARC, SKCM, TGCT, THYM, and UCEC ( Figure 3A FIGURE 3  (A) (B) (C) (D) p Four-panel image analyzing correlations between SLC38A2 and immune cells. Panel A shows a heatmap of correlations with StromalScore, ImmuneScore, and ESTIMATEScore across cancer types. Panel B displays a detailed correlation heatmap with various immune cells, highlighting significance at p < 0.05. Panel C presents box plots and scatter plots showing expression levels of SLC38A2 in different cancer types, correlating with specific immune cells. Panel D offers correlation bars for BRCA, LUAD, MESO, and PAAD cancer types with significance annotations. The analysis results from the ssGSEA algorithm indicate that the expression of SLC38A2 is generally negatively correlated with immune cells in most cancers. This includes aDCs, B cells, CD8 + Figure 3B p p p p p p p p p p p Figure 3D Additionally, we investigated the relationship between high and low expression of SLC38A2 and immune cell infiltration. In BRCA, the subgroup with high SLC38A2 expression corresponds to higher infiltration of T helper cells ( p p p p p p p p p p p Figure 3C 3.4 Expression of SLC38A2 in single-cell subpopulation By performing dimensionality reduction and clustering on high-throughput sequencing datasets from 12 types of cancer, we categorized the cells within the samples into the following subpopulations: Alveolar, B cells, Cholangiocytes, CD4 + + + Figures 4A,C FIGURE 4  (A) (B) (C) (D) (E) Multiple charts and graphs visualize data related to different cancer types, focusing on genetic expression and cellular interactions. Panel A shows proportion bar charts for several cancer types categorized by SLC38A2 expression levels. Panel B includes violin plots displaying expression signatures across cancer subtypes. Panel C offers scatter plots with cell-type mapping for various cancers. Panel D features a heatmap comparing gene expression in different cancers. Panel E presents three-dimensional scatter plots indicating cellular data distribution for different cancer types. Each panel provides distinct visual insights into cancer genomics and cell composition. We found that SLC38A2 is expressed across various cell lineages. Notably, there is a certain level of enrichment of SLC38A2 in tumor-associated stromal cells, such as epithelial cells, endothelial cells, and fibroblasts. In contrast, the expression of SLC38A2 is relatively low in immune-related cells ( Figures 4D,E Figure 4B 3.5 Assocaition between SLC38A2 and glutathione metabolism In BRCA, the expression of SLC38A2 is positively correlated with GSTT4, GGT1, GGLC, HPGDS, GSR, GSTT2, GSTK1, MGST2, RRM2B, and GSTT2B, while it is negatively correlated with G6PD, GPX1, IDH2, CHAC2, ODC1, PGD1, RRM2, SMS, CHAC1, GSTO1, and PRDX6 ( Figure 5A Figure 5B Figure 5C Figure 5D FIGURE 5  (A) (B) (C) (D) (E) Heatmaps and correlation matrices (panels A-D) show gene expression patterns across different conditions, with color gradients indicating Z-scores. Panel E features network diagrams for different cancer types (BRCA, LUAD, MESO, PAAD) illustrating gene interactions with varying correlation strengths. In BRCA and PAAD, we categorized cells into three main types that include malignant cells, stromal cells, and immune cells. We analyzed the expression patterns of SLC38A2 and genes involved in glutathione metabolism within these cell types. The results indicate that SLC38A2 is highly expressed in the later stages across most cell subtypes, including malignant and stromal cells in BRCA, as well as malignant, stromal, and immune cells in PAAD. It is worth mentioning that SLC38A2 shows early enrichment in the immune cell subtype of BRCA ( Figure 6 FIGURE 6  (A) (B) (C) (D) Multiple panels display data on malignant, stromal, and immune cells. Panels A and C show trajectory plots of cells colored by type, with dimensions represented by Components 1 and 2. Panels B and D feature corresponding heatmaps with gene expression levels, using a color gradient from blue to red. Clustered gene names are listed alongside each heatmap. 3.6 Glutamine metabolism in COAD and LUAD To further elucidate glutamine metabolism in pan-cancer and analyze its association with SLC38A2, we conducted further validation in COAD and LUAD. First, in COAD, we identified 518 differentially expressed genes out of 947 metabolic genes in the TCGA patient cohort, with 253 genes upregulated and 265 downregulated in tumors ( Figure 7A Figure 7B Figure 7D Figure 7C Figures 7E,F Figure 7G FIGURE 7  (A) (B) (C) (D) (E) (F) (G) A collage of six images displaying gene expression data analysis. A: Heatmap with color-coded gene expression for normal and tumor groups. B: Dendrogram with module color annotations. C: Bar chart of pathway enrichment analysis. D: Heatmap of module-trait relationships with correlation values. E: Consensus matrix heatmap for k=3. F: Line graph of consensus cumulative distribution function (CDF) plots. Panel G : The expression of SLC38A2 across different cluster subgroups. Similarly, in LUAD, we identified 244 differentially expressed metabolic genes and used WGCNA to cluster these genes into four gene modules ( Figures 8A,B Figure 8D Figure 8C Figures 8E–G Figure 8H FIGURE 8  (A) (B) (C) (D) (E) (F) (G) (H) This composite image contains several charts and graphs related to gene expression analysis. Panel A features a heatmap with color-coded normal and tumor groups. Panel B shows a gene dendrogram with module colors. Panel C presents a bar chart of pathway counts, emphasizing metabolic processes. Panel D displays a heatmap illustrating module-trait relationships. Panel E contains a consensus matrix heatmap for k equals 3. Panel F shows a cumulative distribution function (CDF) plot. Panel G presents a Kaplan-Meier survival curve with p-value annotation. Panel H includes three box plots comparing normal and tumor types. 3.7 Assocaition between SLC38A2 and immune checkpoint In BRCA, SLC38A2 expression is positively correlated with ADORA2A, CD160, CD274, CSF1R, HAVCR2, IL10, IL10RB, KDR, PDCD1LG2, TGFBR1, and VTCN1, and negatively correlated with IDO1, KIR2DL1, LAG3, LGALS9, and PDCD1. In LUAD, SLC38A2 expression is positively correlated with CD160, CD274, IL10, KDR, PDCD1LG2, and TGFBR1, and negatively correlated with LGALS9 and PDCD1. In MESO, the expression of SLC38A2 is positively correlated with CD160, IL10, KDR, TGFB1, and TGFBR1, and negatively correlated with LAG3 and LGALS9. And in PAAD, the expression of SLC38A2 is positively correlated with ADORA2A, BTLA, CD160, CD244, CD274, CD96, CSF1R, CTLA4, HAVCR2, IDO1, IL10, KDR, KIR2DL3, LAG3, PDCD1, PDCD1LG2, PVRL2, TGFB1, TGFBR1 and TIGIT ( Figure 5E 3.8 Signal pathways involving SLC38A2 in cancer The GO enrichment analysis indicates that SLC38A2 is primarily associated with the following pathways in cancer. These include cell surface receptor protein serine/threonine kinase signaling pathway, transforming growth factor beta receptor superfamily signaling pathway, regulation of cell-matrix adhesion, regulation of bone formation and development, regulation of monocyte chemotaxis, and transmembrane transport of amino acids ( Figure 9A FIGURE 9  (A) (B) (C) (D) The image contains four panels labeled A, B, C, and D with various scientific plots and charts. Panel A shows bubble plots related to gene sets for cancer types BRCA, LUAD, MESO, and PAAD. Panel B contains box plots comparing gene expression across age groups for different cancer types. Panel C features ROC curves for cancer types CESC, DLBC, KICH, and PAAD showing sensitivity versus specificity. Panel D includes ROC curves for multiple cancer types such as COAD, GBM, HNSC, LAML, and others, illustrating predictive modeling performance with AUC values. 3.9 SLC38A2-related cancer clinical features First, we evaluated the correlation between SLC38A2 expression and patient age. We found that SLC38A2 expression was higher in younger patients, especially in six types of cancer: ESCA, KIRC, PAAD, READ, TGCT, and THCA ( Figure 9B Figure 9C Figure 9D 3.10 Assocaition between SLC38A2 and drug sensitivity Results from the CTRP database indicate that the expression of SLC38A2 is significantly correlated with the sensitivity of 62 small-molecule compounds ( Figure 10A p Figure 10B Figure 10C Figure 10D FIGURE 10  (A) Supplementary Material 2 (B) Supplementary Material 3 (C) (D) Graphs showing correlations between drug sensitivity and gene expression. Panels A and B are volcano plots displaying correlation of various drugs with significant expressions. Panel C shows scatter plots depicting the relationship between SLC38A2 expression and IC50 values for four drugs: Dabrafenib, Vemurafenib, Pyrazoloacridine, and Selumetinib. Panel D contains box plots demonstrating IC50 values in relation to high and low expression levels of SLC38A2 for six drugs: 7-Hydroxystaurosporine, Colchicine, Dabrafenib, Everolimus, Rapamycin, and Selumetinib. Correlations and significance levels are marked on each graph. 4 Discussion SLC38A2 (SNAT2), also known as Sodium-Coupled Neutral Amino Acid Transporter 2, is a transmembrane protein encoded by the locus at chromosome 12q13.11. It is widely expressed and regulated in mammalian cells, utilizing the sodium ion concentration gradient across the cell membrane to co-transport sodium ions and amino acid substrates into the cell ( Franchi-Gazzola et al., 2006 Broer, 2014 Huang et al., 2020 Wise and Thompson, 2010 Wilmore and Shabert, 1998 in vitro Singer et al., 2018 Chang et al., 2015 Chen et al., 2023 In the abnormal glutamine metabolism of tumors, the upregulated expression of selective transporters plays a crucial role, as it is essential for enhanced uptake by tumor cells ( Bhutia et al., 2015 van Geldermalsen et al., 2016 Wu et al., 2018 Wang et al., 2013 Huang et al., 2020 Tambay et al., 2024 Nie and Cai, 2022 Morotti et al., 2021 To verify whether the expression of SLC38A2 is abnormal in cancer, we first conducted differential expression analysis across 33 common cancer types in the TCGA database. The analysis of non-paired samples revealed that the expression of SLC38A2 differs in 15 cancer types compared to their corresponding normal tissues, indicating altered expression in cancerous tissues. Furthermore, the immunohistochemistry slides further corroborated the differential expression results from the TCGA database. After determining that SLC38A2 exhibits altered expression in cancer, we analyzed whether this gene affects cancer prognosis. Given the established biological functions of SLC38A2, we hypothesized that it is a risk factor for cancer prognosis. In our study, SLC38A2 was identified as a risk factor in BRCA, LUAD, MESO, and PAAD, where its high expression is associated with poor prognosis and shorter survival, aligning with other research findings ( Morotti et al., 2021 Liu et al., 2022 Li et al., 2023a Morotti et al., 2019 Morotti et al., 2021 Morotti et al., 2019 Kang et al., 2020 Peng et al., 2022 To further elucidate the role of SLC38A2 in tumor immunity, we conducted a comprehensive analysis of its correlation with the pan-cancer immune landscape. We found that SLC38A2 is positively correlated with stromal scores and negatively correlated with immune scores across various cancers, supporting the notion that SLC38A2 is a key player in tumor stroma remodeling and immune suppression. Research by Mengling et al. demonstrated that SLC38A2 is involved in glutamine crosstalk between TAMs and tumor cells in the Scissor_C1 cell subgroup of lung adenocarcinoma, accompanied by CAFs enrichment and epithelial-mesenchymal transition (EMT) phenotype ( Li et al., 2023b It is worth northing that we found a significant positive correlation between SLC38A2 expression and the infiltration of T helper cells, Tcm cells, and Th2 cells. Th2 cells are a subset of CD4 + + Huang et al., 2021 + Wan et al., 2023 Fang et al., 2024 To further elucidate the association between SLC38A2, the TME, and tumor-associated cells, we utilized single-cell sequencing data analysis ( Li et al., 2023c Ding et al., 2024 Bertero et al., 2019 Li et al., 2021b Yan et al., 2018 Liu et al., 2022 Morotti et al., 2019 Gauthier-Coles et al., 2022 Broer et al., 2019 Finally, we validated whether SLC38A2 could serve as an effective prognostic and diagnostic biomarker. We found that SLC38A2 is expressed at higher levels in younger patients with certain cancers, potentially indicating increased risk. Additionally, diagnostic ROC and time-dependent AUC results demonstrate that SLC38A2 is indeed a reliable diagnostic marker in some cancers, further supporting its clinical application potential. Although many studies have confirmed that blocking glutamine metabolism pathways significantly inhibits tumor progression, research and targeted drugs specifically for SLC38A2 remain limited ( Wang et al., 2024 Li et al., 2023d Jin et al., 2023 5 Conclusion This study further confirms the role of the key transporter SLC38A2 in glutamine metabolism across various cancers, encompassing clinical aspects, the tumor microenvironment, immunity, and drug sensitivity. SLC38A2 is closely linked to glutamine metabolic mechanisms and serves as an effective prognostic and diagnostic marker associated with poor clinical outcomes. Its unique association with inhibitory immune cells and stromal cells makes it a potential target for intervening in the tumor microenvironment, warranting further in-depth research. Data availability statement Publicly available datasets were analyzed in this study. This data can be found here: https://www.ncbi.nlm.nih.gov/ Author contributions MaL: Writing – original draft, Data curation, Software. YR: Data curation, Validation, Writing – original draft, Formal Analysis, Visualization. MoL: Formal Analysis, Data curation, Writing – original draft, Visualization. JG: Writing – original draft, Data curation, Software. KG: Data curation, Methodology, Writing – original draft, Software. KL: Writing – original draft, Data curation, Software, Conceptualization. RZ: Software, Writing – original draft, Data curation, Methodology. YL: Methodology, Formal Analysis, Writing – original draft, Software. QW: Data curation, Methodology, Formal Analysis, Writing – original draft. MW: Writing – original draft, Visualization. DC: Writing – original draft, Formal Analysis, Visualization. MZ: Writing – original draft, Validation. YW: Writing – original draft, Software, Writing – review and editing. YZ: Writing – review and editing, Funding acquisition, Writing – original draft, Project administration. SL: Writing – review and editing, Project administration, Visualization, Funding acquisition, Writing – original draft. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fgene.2025.1658299/full#supplementary-material References Bejarano L. Jordao M. J. C. Joyce J. A. 2021 Therapeutic targeting of the tumor microenvironment Cancer Discov. 11 933 959 10.1158/2159-8290.cd-20-1808 33811125 Bertero T. Oldham W. M. Grasset E. M. Bourget I. Boulter E. Pisano S. 2019 Tumor-stroma mechanics coordinate amino acid availability to sustain tumor growth and malignancy Cell Metab. 29 124 140 10.1016/j.cmet.2018.09.012 30293773 PMC6432652 Bhutia Y. D. Babu E. Ramachandran S. Ganapathy V. 2015 Amino acid transporters in cancer and their relevance to “glutamine addiction”: novel targets for the design of a new class of anticancer drugs Cancer Res. 75 1782 1788 10.1158/0008-5472.CAN-14-3745 25855379 Broer S. 2014 The SLC38 family of sodium-amino acid co-transporters Pflugers Arch. 466 155 172 10.1007/s00424-013-1393-y 24193407 Broer A. Rahimi F. Broer S. 2016 Deletion of amino acid transporter ASCT2 (SLC1A5) reveals an essential role for transporters SNAT1 (SLC38A1) and SNAT2 (SLC38A2) to sustain glutaminolysis in cancer cells J. Biol. Chem. 291 13194 13205 10.1074/jbc.M115.700534 27129276 PMC4933233 Broer A. Gauthier-Coles G. Rahimi F. van Geldermalsen M. Dorsch D. Wegener A. 2019 Ablation of the ASCT2 (SLC1A5) gene encoding a neutral amino acid transporter reveals transporter plasticity and redundancy in cancer cells J. Biol. Chem. 294 4012 4026 10.1074/jbc.RA118.006378 30635397 PMC6422075 Chang C. H. Qiu J. O’Sullivan D. Buck M. D. Noguchi T. Curtis J. D. 2015 Metabolic competition in the tumor microenvironment is a driver of cancer progression Cell 162 1229 1241 10.1016/j.cell.2015.08.016 26321679 PMC4864363 Chen P. Han Y. Wang L. Zheng Y. Zhu Z. Zhao Y. 2023 Spatially resolved metabolomics combined with the 3D tumor-immune cell coculture spheroid highlights metabolic alterations during antitumor immune response Anal. Chem. 95 15153 15161 10.1021/acs.analchem.2c05734 37800909 Dilshara M. G. Jeong J. W. Prasad Tharanga Jayasooriya R. G. Neelaka Molagoda I. M. Lee S. Park S. R. 2017 Glutamine deprivation sensitizes human breast cancer MDA-MB-231 cells to TRIAL-mediated apoptosis Biochem. Biophys. Res. Commun. 485 440 445 10.1016/j.bbrc.2017.02.059 28202415 Ding P. Pei S. Qu Z. Yang Y. Liu Q. Kong X. 2024 Single-cell sequencing unveils mitophagy-related prognostic model for triple-negative breast cancer Front. Immunol. 15 1489444 10.3389/fimmu.2024.1489444 39559367 PMC11570810 Fang H. Dai W. Gu R. Zhang Y. Li J. Luo W. 2024 myCAF-derived exosomal PWAR6 accelerates CRC liver metastasis via altering glutamine availability and NK cell function in the tumor microenvironment J. Hematol. Oncol. 17 126 10.1186/s13045-024-01643-5 39696364 PMC11657131 Faubert B. Vincent E. E. Griss T. Samborska B. Izreig S. Svensson R. U. 2014 Loss of the tumor suppressor LKB1 promotes metabolic reprogramming of cancer cells via HIF-1α Proc. Natl. Acad. Sci. U. S. A. 111 2554 2559 10.1073/pnas.1312570111 24550282 PMC3932920 Franchi-Gazzola R. Dall’Asta V. Sala R. Visigalli R. Bevilacqua E. Gaccioli F. 2006 The role of the neutral amino acid transporter SNAT2 in cell volume regulation Acta Physiol. (Oxf) 187 273 283 10.1111/j.1748-1716.2006.01552.x 16734764 Fu Q. Xu L. Wang Y. Jiang Q. Liu Z. Zhang J. 2019 Tumor-associated macrophage-derived interleukin-23 interlinks kidney cancer glutamine addiction with immune evasion Eur. Urol. 75 752 763 10.1016/j.eururo.2018.09.030 30293904 Gao P. Tchernyshyov I. Chang T. C. Lee Y. S. Kita K. Ochi T. 2009 c-Myc suppression of miR-23a/b enhances mitochondrial glutaminase expression and glutamine metabolism Nature 458 762 765 10.1038/nature07823 19219026 PMC2729443 Gauthier-Coles G. Broer A. McLeod M. D. George A. J. Hannan R. D. Broer S. 2022 Identification and characterization of a novel SNAT2 (SLC38A2) inhibitor reveals synergy with glucose transport inhibition in cancer cells Front. Pharmacol. 13 963066 10.3389/fphar.2022.963066 36210829 PMC9532951 Guo C. You Z. Shi H. Sun Y. Du X. Palacios G. 2023 SLC38A2 and glutamine signalling in cDC1s dictate anti-tumour immunity Nature 620 200 208 10.1038/s41586-023-06299-8 37407815 PMC10396969 Huang M. S. Chang J. H. Lin W. C. Cheng Y. H. Li F. A. Suen C. S. 2020 SLC38A2 overexpression induces a cancer-like metabolic profile and cooperates with SLC1A5 in pan-cancer prognosis Chem. Asian J. 15 3861 3872 10.1002/asia.202001056 32996252 Huang H. Zhou P. Wei J. Long L. Shi H. Dhungana Y. 2021  In vivo Cell 184 1245 1261.e21 10.1016/j.cell.2021.02.021 33636132 PMC8101447 Jin J. Byun J. K. Choi Y. K. Park K. G. 2023 Targeting glutamine metabolism as a therapeutic strategy for cancer Exp. Mol. Med. 55 706 715 10.1038/s12276-023-00971-9 37009798 PMC10167356 Kang W. Zhang M. Wang Q. Gu D. Huang Z. Wang H. 2020 The SLC family are candidate diagnostic and prognostic biomarkers in clear cell renal cell carcinoma Biomed. Res. Int. 2020 1932948 10.1155/2020/1932948 32461965 PMC7212275 Kaur R. Bhardwaj A. Gupta S. 2023 Cancer treatment therapies: traditional to modern approaches to combat cancers Mol. Biol. Rep. 50 9663 9676 10.1007/s11033-023-08809-3 37828275 Keenan M. M. Chi J. T. 2015 Alternative fuels for cancer cells Cancer J. 21 49 55 10.1097/PPO.0000000000000104 25815843 PMC4380238 Kennedy L. Sandhu J. K. Harper M. E. Cuperlovic-Culf M. 2020 Role of glutathione in cancer: from mechanisms to therapies Biomolecules 10 1429 10.3390/biom10101429 33050144 PMC7600400 Koppula P. Zhuang L. Gan B. 2021 Cystine transporter SLC7A11/xCT in cancer: ferroptosis, nutrient dependency, and cancer therapy Protein Cell 12 599 620 10.1007/s13238-020-00789-5 33000412 PMC8310547 Leone R. D. Zhao L. Englert J. M. Sun I. M. Oh M. H. Sun I. H. 2019 Glutamine blockade induces divergent metabolic programs to overcome tumor immune evasion Science 366 1013 1021 10.1126/science.aav2588 31699883 PMC7023461 Li Z. Zhang H. 2016 Reprogramming of glucose, fatty acid and amino acid metabolism for cancer progression Cell Mol. Life Sci. 73 377 392 10.1007/s00018-015-2070-4 26499846 PMC11108301 Li X. Zhang H. S. 2024 Amino acid metabolism, redox balance and epigenetic regulation in cancer FEBS J. 291 412 429 10.1111/febs.16803 37129434 Li Z. Sun C. Qin Z. 2021a Metabolic reprogramming of cancer-associated fibroblasts and its effect on cancer cell reprogramming Theranostics 11 8322 8336 10.7150/thno.62378 34373744 PMC8343997 Li X. Zhu H. Sun W. Yang X. Nie Q. Fang X. 2021b Role of glutamine and its metabolite ammonia in crosstalk of cancer-associated fibroblasts and cancer cells Cancer Cell Int. 21 479 10.1186/s12935-021-02121-5 34503536 PMC8427881 Li L. Wang N. Wang J. Li J. 2023a Hsa_circRNA_001859 regulates pancreatic cancer progression and epithelial-mesenchymal transition through the miR-21-5p/SLC38A2 pathway Cancer Biomark. 37 39 52 10.3233/CBM-220229 37005877 PMC10200212 Li M. Zhou B. Zheng C. 2023b An integrated bioinformatic analysis of bulk and single-cell sequencing clarifies immune microenvironment and metabolic profiles of lung adenocarcinoma to predict immunotherapy efficacy Front. Cell Dev. Biol. 11 1163314 10.3389/fcell.2023.1163314 37091977 PMC10113470 Li Y. Cai H. Yang J. Xie X. Pei S. Wu Y. 2023c Decoding tumor heterogeneity in uveal melanoma: basement membrane genes as novel biomarkers and therapeutic targets revealed by multi-omics approaches for cancer immunotherapy Front. Pharmacol. 14 1264345 10.3389/fphar.2023.1264345 37822877 PMC10562578 Li S. Zeng H. Fan J. Wang F. Xu C. Li Y. 2023d Glutamine metabolism in breast cancer and possible therapeutic targets Biochem. Pharmacol. 210 115464 10.1016/j.bcp.2023.115464 36849062 Lieu E. L. Nguyen T. Rhyne S. Kim J. 2020 Amino acids in cancer Exp. Mol. Med. 52 15 30 10.1038/s12276-020-0375-3 31980738 PMC7000687 Liu T. Han C. Fang P. Ma Z. Wang X. Chen H. 2022 Cancer-associated fibroblast-specific lncRNA LINC01614 enhances glutamine uptake in lung adenocarcinoma J. Hematol. Oncol. 15 141 10.1186/s13045-022-01359-4 36209111 PMC9548164 Liu Z. Shi M. Ren Y. Xu H. Weng S. Ning W. 2023 Recent advances and applications of CRISPR-Cas9 in cancer immunotherapy Mol. Cancer 22 35 10.1186/s12943-023-01738-6 36797756 PMC9933290 Menchini R. J. Chaudhry F. A. 2019 Multifaceted regulation of the system A transporter Slc38a2 suggests nanoscale regulation of amino acid metabolism and cellular signaling Neuropharmacology 161 107789 10.1016/j.neuropharm.2019.107789 31574264 Morotti M. Bridges E. Valli A. Choudhry H. Sheldon H. Wigfield S. 2019 Hypoxia-induced switch in SNAT2/SLC38A2 regulation generates endocrine resistance in breast cancer Proc. Natl. Acad. Sci. U. S. A. 116 12452 12461 10.1073/pnas.1818521116 31152137 PMC6589752 Morotti M. Zois C. E. El-Ansari R. Craze M. L. Rakha E. A. Fan S. J. 2021 Increased expression of glutamine transporter SNAT2/SLC38A2 promotes glutamine dependence and oxidative stress resistance, and is associated with worse prognosis in triple-negative breast cancer Br. J. Cancer 124 494 505 10.1038/s41416-020-01113-y 33028955 PMC7852531 Nie K. Cai M. 2022 SNAT2/SLC38A2 confers the stemness of gastric cancer cells via regulating glutamine level Dig. Dis. Sci. 67 2948 2956 10.1007/s10620-021-07110-2 34173116 Niu B. Liao K. Zhou Y. Wen T. Quan G. Pan X. 2021 Application of glutathione depletion in cancer therapy: enhanced ROS-based therapy, ferroptosis, and chemotherapy Biomaterials 277 121110 10.1016/j.biomaterials.2021.121110 34482088 Peng L. Cao Z. Wang Q. Fang L. Yan S. Xia D. 2022 Screening of possible biomarkers and therapeutic targets in kidney renal clear cell carcinoma: evidence from bioinformatic analysis Front. Oncol. 12 963483 10.3389/fonc.2022.963483 36313709 PMC9606658 Singer K. Cheng W. C. Kreutz M. Ho P. C. Siska P. J. 2018 Immunometabolism in cancer at a glance Dis. Model Mech. 11 dmm034272 10.1242/dmm.034272 30076128 PMC6124550 Tambay V. Raymond V. A. Voisin L. Meloche S. Bilodeau M. 2024 Reprogramming of glutamine amino acid transporters expression and prognostic significance in hepatocellular carcinoma Int. J. Mol. Sci. 25 7558 10.3390/ijms25147558 39062801 PMC11277143 Tran T. Q. Lowman X. H. Reid M. A. Mendez-Dorantes C. Pan M. Yang Y. 2017 Tumor-associated mutant p53 promotes cancer cell survival upon glutamine deprivation through p21 induction Oncogene 36 1991 2001 10.1038/onc.2016.360 27721412 PMC5383530 van Geldermalsen M. Wang Q. Nagarajah R. Marshall A. D. Thoeng A. Gao D. 2016 ASCT2/SLC1A5 controls glutamine uptake and tumour growth in triple-negative basal-like breast cancer Oncogene 35 3201 3208 10.1038/onc.2015.381 26455325 PMC4914826 Vitale I. Manic G. Coussens L. M. Kroemer G. Galluzzi L. 2019 Macrophages and metabolism in the tumor microenvironment Cell Metab. 30 36 50 10.1016/j.cmet.2019.06.001 31269428 Wan Y. Chen M. Li X. Han X. Zhong L. Xiao F. 2023 Single-cell RNA sequencing reveals XBP1-SLC38A2 axis as a metabolic regulator in cytotoxic T lymphocytes in multiple myeloma Cancer Lett. 562 216171 10.1016/j.canlet.2023.216171 37054944 Wang J. Chen X. Su L. Li P. Liu B. Zhu Z. 2013 LAT-1 functions as a promotor in gastric cancer associated with clinicopathologic features Biomed. Pharmacother. 67 693 699 10.1016/j.biopha.2013.05.003 23809372 Wang B. Pei J. Xu S. Liu J. Yu J. 2024 A glutamine tug-of-war between cancer and immune cells: recent advances in unraveling the ongoing battle J. Exp. Clin. Cancer Res. 43 74 10.1186/s13046-024-02994-0 38459595 PMC10921613 Wilmore D. W. Shabert J. K. 1998 Role of glutamine in immunologic responses Nutrition 14 618 626 10.1016/s0899-9007(98)00009-4 9684266 Wise D. R. Thompson C. B. 2010 Glutamine addiction: a new therapeutic target in cancer Trends Biochem. Sci. 35 427 433 10.1016/j.tibs.2010.05.003 20570523 PMC2917518 Wu J. Li Z. Yang Z. Guo L. Zhang Y. Deng H. 2018 A glutamine-rich carrier efficiently delivers anti-CD47 siRNA driven by a “glutamine trap” to inhibit lung cancer cell growth Mol. Pharm. 15 3032 3045 10.1021/acs.molpharmaceut.8b00076 29939755 Yan W. Wu X. Zhou W. Fong M. Y. Cao M. Liu J. 2018 Cancer-cell-secreted exosomal miR-105 promotes tumour growth through the MYC-dependent metabolic reprogramming of stromal cells Nat. Cell Biol. 20 597 609 10.1038/s41556-018-0083-6 29662176 PMC5920728 Zhang P. Pei S. Zhou G. Zhang M. Zhang L. Zhang Z. 2024 Purine metabolism in lung adenocarcinoma: a single-cell analysis revealing prognostic and immunotherapeutic insights J. Cell Mol. Med. 28 e18284 10.1111/jcmm.18284 38597415 PMC11005461 Zhu L. Zhu X. Wu Y. 2022 Effects of glucose metabolism, lipid metabolism, and glutamine metabolism on tumor microenvironment and clinical implications Biomolecules 12 580 10.3390/biom12040580 35454171 PMC9028125 Zhu L. Wang Z. Han W. Xu A. 2023 Comprehensive analysis of the biological function and immune infiltration of SLC38A2 in gastric cancer BMC Gastroenterol. 23 74 10.1186/s12876-023-02689-4 36918802 PMC10015769 ",
  "metadata": {
    "Title of this paper": "Comprehensive analysis of the biological function and immune infiltration of SLC38A2 in gastric cancer",
    "Journal it was published in:": "Frontiers in Genetics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483874/"
  }
}