{
  "title": "Paper_997",
  "abstract": "pmc Pharmaceuticals (Basel) Pharmaceuticals (Basel) 2102 pharmaceuticals pharmaceuticals Pharmaceuticals 1424-8247 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472712 PMC12472712.1 12472712 12472712 41011243 10.3390/ph18091375 pharmaceuticals-18-01375 1 Article Design and Characterization of Thermosensitive Niosomes as Platforms for Daunorubicin Delivery https://orcid.org/0000-0002-6681-8150 Gugleva Viliana Methodology Investigation Writing – original draft 1 Ahchiyska Katerina Investigation 2 https://orcid.org/0009-0005-0322-0935 Drakalska-Sersemova Elena Investigation 3 https://orcid.org/0000-0001-5763-0730 Mihaylova Rositsa Investigation Writing – review & editing 4 https://orcid.org/0000-0002-7257-1107 Toncheva-Moncheva Natalia Investigation Writing – review & editing 5 Dimitrov Erik Investigation 5 Aleksandrov Krum Investigation 5 https://orcid.org/0000-0002-6994-868X Forys Aleksander Investigation Visualization 6 https://orcid.org/0000-0002-6131-4017 Trzebicka Barbara Investigation Writing – review & editing 6 https://orcid.org/0000-0001-8112-6761 Momekova Denitsa Conceptualization Methodology Writing – original draft Writing – review & editing Project administration Funding acquisition 2 * Fan Kelong Academic Editor Wu Fu-Gen Academic Editor 1 viliana.gugleva@mu-varna.bg 2 katerina.ahchiiska@gmail.com 3 elena.drakalska@ugd.edu.mk 4 rmihaylova@pharmfac.mu-sofia.bg 5 ntoncheva@polymer.bas.bg e_dimitrov@polymer.bas.bg k_aleksandrov@polymer.bas.bg 6 aforys@cmpw-pan.pl btrzebicka@cmpw-pan.pl * dmomekova@pharmfac.mu-sofia.bg 15 9 2025 9 2025 18 9 497460 1375 15 7 2025 09 8 2025 05 9 2025 15 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives: Methods Results 50 Conclusions antiproliferative activity carboxyfluorescein daunorubicin hydrochloride cancer niosomes thermosensitivity National Recovery and Resilience Plan of the Republic of Bulgaria BGRRP-2.004-0004-C01 This research was funded by the European Union’s Next Generation EU economic recovery package via the National Recovery and Resilience Plan of the Republic of Bulgaria, project № BGRRP-2.004-0004-C01. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction In the recent years, multifunctional or “smart” nanocarriers have attracted researchers’ attention due to the numerous beneficial characteristics they provide compared to conventional nanoscale drug delivery systems. The selected trigger/s allow for controlled and precise drug release at the desired site, which contributes to a superior therapeutic effect and reduced systemic toxicity. Stimuli-sensitive nanocarriers are often elaborated as drug delivery platforms in oncotherapeutics, as the altered tumor microenvironment (e.g., pH 5.5–6.5, mild hyperthermia at 40–42 °C, a higher glutathione concentration, or overexpression of certain enzymes) provides a variety of trigger mechanisms that can be exploited [ 1 2 Niosomes, non-ionic surfactant-based vesicles that are analogous to liposomes, have gained significant attention as carriers for anticancer drugs due to their biocompatibility, stability, and capacity for both hydrophilic and hydrophobic payloads [ 3 4 To overcome these limitations, the integration of stimuli-responsive features into niosomal systems has emerged as a promising approach. Thermosensitive niosomes, which respond to hyperthermic conditions (typically 40–42 °C), offer a spatiotemporally controllable mechanism for drug release by exploiting the elevated-temperature microenvironment of tumors or externally induced hyperthermia [ 5 5 ® 6 6 7 In this context, the present study explores the development of polymer-modified thermosensitive niosomes as a site-specific nanovesicular system for daunorubicin delivery. Thermosensitivity was achieved using copolymers newly synthesized for this purpose, namely DHP-PiPOX and DHP-PETEGA, which implies the novelty of our work, as currently there are no data in the literature from relevant studies. The designed niosomes integrate three key functional features: (i) thermal sensitivity, as a result of the low critical transition temperature of PIPOX or PETEGA blocks enabling temperature-triggered changes in niosomal membrane fluidity and permeability, which can facilitate controlled release of encapsulated drugs at mild hyperthermic tumor sites or inflamed tissues; (ii) hydrophilic poly(ethoxytriethylene glycol acrylate) or polyoxazoline form a stealth-like corona that reduces opsonization and prolongs circulation time; and (iii) encapsulation of daunorubicin for targeted chemotherapy. Regarding the selection of the active pharmaceutical ingredient (API) in our study, daunorubicin HCl was chosen as it is a broad-spectrum cytostatic agent of importance in the treatment of a number of neoplastic diseases [ 8 9 10 11 12 2 ® ® 13 14 15 16 ® 17 In this regard, the aim of the study is to develop and characterize thermosensitive niosomes that are capable of selectively releasing daunorubicin HCl in conditions of mild hyperthermia (42 °C) and to evaluate its antiproliferative activity against acute myelocyte leukemia-derived HL-60 cell lines. The controlled temperature-triggered drug release would contribute towards achieving a higher drug concentration, reduced systemic exposure, and an improved therapeutic effect. 2. Results and Discussion 2.1. Preparation and Characterization of Conventional and Copolymer-Modified Blank Niosomes—Preliminary Studies The objective of this study was to design temperature-sensitive niosomal nanovesicles for targeted daunorubicin release and delivery. These innovative nanocarriers can enhance the delivery of daunorubicin, a potent anticancer drug, directly to tumor cells, thereby minimizing systemic toxicity and side effects on healthy tissues. They offer a controlled release mechanism triggered by temperature changes, allowing precise drug accumulation at specific sites within the body. To this end, a series of Tw60:Sp60:Ch (3.5:3.5:3 mol:mol) niosomes modified with DHP-PiPOX or DHP-PETEGA copolymers were prepared via the TFH method to evaluate the influence of the type and concentration of the modified copolymer on the main physicochemical properties of the niosomes, in accordance with their specific temperature trigger ( Table 1 18 19 Although the formation of conventional niosomes based on non-ionic surfactant and cholesterol mixtures has been extensively studied, research on the preparation of stimuli-sensitive polymer-modified niosomes so far remains scarce in the literature. To the best of our knowledge, this is the first report on the preparation of temperature-sensitive niosomes by grafting temperature-responsive polymers such as PiPOX and PETEGA to their membranes. Consequently, it was necessary to confirm the formation of niosomes through cryo-TEM analysis. The obtained cryo-TEM images of non-sonicated plain and modified niosomes show the formation of well-defined spherical vesicles with intact membranes of approx. 5 nm thickness and an average size (based on observation of at least 100 particles per sample) varying in the range of 263 to 545 nm, depending on the type and concentration of copolymer used. Additionally, within the series of modified niosomes, the incorporation of the two hydrophobically modified polymers at concentrations up to 2.5 mol% did not compromise the niosomal bilayer structure. The images were dominated by unilamellar vesicles ( Figure 1 Similarly to cryo-TEM, the DLS analysis data of the obtained niosomes show sizes over 250 nm and a polydispersity index over 0.4, which are unfavorable characteristics in view of the potential systemic application of the developed niosomes. This necessitated, as the next stage of the optimization process, their treatment with ultrasound for 2 min (20 on/10 off s). The results are shown in Table 1 As evident from the obtained data, the inclusion of the polymers in a concentration up to 2.5 mol% determines the formation of homogeneous populations of nanocarriers with sizes between 100 and 133 nm at ambient temperature and a relatively low dispersity index of up to 0.36. The incorporation of the modifying polymers leads to a statistically significant ( p 20 The thermosensitivity of the niosomes was assessed by incubating the vesicles for 40 min at 40 °C, the recommended conditions for mild hyperthermia in cancer treatment [ 5 21 22 Table 2 21 6 23 pharmaceuticals-18-01375-t002_Table 2 Table 2 Cloud points and thermal (DSC) characterization of PIPOX and PETEGA. Sample Cloud Point (°C) T g c PiPOX [ 24 39 52 PETEGA [ 25 37 −57 c The successive stage of our study was to assess the acquired stimulus sensitivity of the vesicles by conducting a leakage assay. The fluorescent dye 5(6)-carboxyfluorescein, polar and non-permeable through the intact membranes, was loaded into niosomes at a concentration of 50 µM, at which concentration its fluorescence is self-quenching. Upon its leakage into the acceptor medium through pores or other imperfections in membrane integrity caused by polymer incorporation, the dye is diluted and begins to fluoresce. The results from the performed spectrofluorometric studies are presented in Figure 2 As the presented data show, modification of niosomes with the newly synthesized polymers led to the rapid release of the fluorescent dye within 40 min of incubation at 40 °C. The most pronounced effect was seen in formulations modified with the highest concentration (2.5 mol%) of both polymers, especially those modified with DHP-PIPOX, where almost 80% of the encapsulated carboxyfluorescein was released. Conversely, at ambient temperature, DHP-PIPOX exhibited a stabilizing effect on the membranes, particularly at 2.5 mol%, as evidenced by the lowest carboxyfluorescein leakage compared to the plain vesicles or their DHP-PETEGA-modified counterparts. An anomalous variation in this trend was observed for formulations modified with 1 mol% of both polymers (S3 and S6), where an increase in leakage of the fluorescent marker was observed at ambient temperature. One possible explanation is the initiation of conformational changes in the PIPOX and PETEGA chains above the niosomal membrane at this particular concentration, leading to the formation of transient pores or openings in the bilayers [ 26 On this ground, the next step in our study was the elaboration of temperature-sensitive niosomes for targeted delivery of daunorubicin. As an optimal formulation for this purpose, we chose ones based on a 2.5 mol% copolymer content. 2.2. Preparation and Characterization of Temperature-Sensitive Daunorubicin Hydrochloride-Loaded Niosomes Pilot experiments were conducted to establish a suitable and reproducible method for the optimal loading of daunorubicin.HCl into niosomes. These experiments used passive loading via the simple thin-film hydration method and active loading by generating a transmembrane ammonium gradient. Plain and 2.5 mol% Tw60:Sp60:Chol (3.5:3.5:3 mol:mol)-modified niosomes were used as carriers in all experiments. The vesicles were prepared as described in Section 3.2.1 Section 3.3.3 Table 3 As expected, passive loading did not result in efficient encapsulation. Less than 20% of the daunorubicin was encapsulated in the vesicles. However, after active loading via a transmembrane ammonium gradient, the encapsulation efficiency increased significantly to 71% ( Table 3 DLS analysis of the loaded vesicles revealed that encapsulation of daunorubicin hydrochloride into niosomes led to a significant increase in the vesicles’ size as compared to their empty counterparts ( Table 4 27 Table 4 2.3. In Vitro Daunorubicin Release A primary goal in the design of smart nanocarriers is to selectively accumulate the loaded drug in foci of malignant growth, while reducing systemic exposure. This can only be achieved if the nanovesicles effectively retain their cargo in circulation and release it upon accumulation in the tumor interstitium [ 28 In this regard, the release profiles of daunorubicin hydrochloride from the prepared niosomal formulations were studied by dialysis against a 50 mL phosphate-buffered saline (PBS) solution (pH 7.4), as a function of time and temperature at 25, 37, and 42 °C ( Figure 3 At ambient temperature, both unmodified and specially polymer-modified thermosensitive formulations exhibited a slow release rate, with around 10% of the encapsulated daunorubicin HCl released after 24 h (see Figure 3 Table 2 Daunorubicin release from the developed vesicles was also monitored at 42 °C after 40 min of incubation. These conditions were selected based on clinical protocols for mild hyperthermia treatment in cancer therapy [ 29 As the results show, under these conditions, the modified compositions release over 65% of the encapsulated cytostatic agent, whereas the unmodified niosomes release only 35%. This again demonstrates the temperature-sensitive properties of the elaborated copolymer-modified niosomes. Considering the release profiles at ambient temperature and under mild hyperthermia conditions, it can be concluded that the release of daunorubicin from the smart niosomes is likely controlled by a combination of diffusion and membrane destabilization processes. Temperature-dependent polymer-induced structural rearrangements may create transient pores or defects in the membrane, thereby enhancing drug diffusion. Therefore, the release mechanism is likely to be a combination of temperature-triggered membrane perturbation and passive diffusion of daunorubicin through the bilayer. 2.4. Storage Stability of Niosomes Due to the colloidal instability of nanovesicular carriers such as niosomes and liposomes, we sought to evaluate the storage stability of plain or copolymer-modified niosomes by tracking changes in particle size, size distribution, and encapsulated daunorubicin content over a 30-day period at 4 °C. Based on the results presented in Table 5 30 2.5. In Vitro Cytotoxicity Evaluation The cytotoxic effect of free or niosomal daunorubicin HCl was evaluated against HL-60 cells by a standard MTT assay. The data, presented as concentration–response curves (expressed as % of untreated control), are depicted in Figure 4 50 Table 6 The presented data clearly show that HL-60 cells are highly sensitive to daunorubicin hydrochloride (see Figure 4 50 Table 6 To verify that the higher cell suppression activity of the nanoformulated agent was not due to the inherent cytotoxicity of the carriers or the polymers themselves, normal mouse fibroblasts (CCL-1 cell line) were treated with empty niosomes (either plain or modified) as well as with aqueous solutions of the modifying copolymers at concentrations similar to those in the previous experiment. The concentration–effect curves are presented in Figure 5 The presented results clearly show that both temperature-sensitive polymers are practically devoid of cytotoxicity across the entire studied concentration range, while the empty vesicles exhibit only marginal cytotoxicity, as they do not cause more than a 25% reduction in cell viability, even at high concentrations [ 31 Thus, the observed higher cytotoxic effect of niosomal daunorubicin, together with its concomitant delayed release under physiological conditions, indicates unequivocally that besides the hydrophilic corona surrounding the membranes of polymer-modified vesicles, the latter are able to interact with tumor cells, allowing immediate contact with and penetration of the incorporated cytostatic by direct exchange and/or fusion with the membranes. Given the data from the in vitro release profiles of daunorubicin HCl, in the absence of interactions between the niosomes and the cells, the latter would be exposed to only 30–50% of the free cytostatic concentrations and, accordingly, their cytotoxic effects would be marginal. 3. Materials and Methods 3.1. Materials Daunorubicine hydrochloride, sorbitan monostearate (Span 60), polyoxyethylene sorbitan monostearate (Tween 60), cholesterol, 5(6)-carboxyfluorescein, and SpectraPor4 (cut off 12–14,000, regenerated cellulose) were purchased from Sigma-Aldrich (FOT, Sofia, Bulgaria), along with SnCl 4 ® https://www.atcc.org/ https://www.dsmz.de/ 3.2. Methods 3.2.1. Synthesis of Copolymers DHP-PiPOX and DHP-PETEGA were synthesized by conjugation of pre-synthesized poly(2-isopropyl-2-oxazoline) (PiPOX) or poly(ethoxytriethylene glycol acrylate) (PETEGA) to 1,3-dihexadecyl-propane-2-ol (DHP). The lipid-mimetic moiety (DHP, M w 32 4 4 −1 1 3 PiPOX with an average molar mass number (M n Đ n Đ 24 25 Table 2 3.2.2. Preparation of Empty and Daunorubicin-Loaded Niosomes Preparation of Empty and 5(6)-Carboxyfluorescein-Loaded Niosomes Empty conventional and copolymer-modified niosomes were prepared via the thin-film hydration method, followed by pulsatile sonication (⌀ = 2 mm, Bandelin Sonoplus HD2200, Berlin, Germany). The lipid film was formed by evaporation at 150 rpm of the chloroform solution of Span 60, Tween 60, and cholesterol (30 µmol/mL total mixture). In the case of modified vesicles, to the organic phase we also added the chloroform–methanolic solution of investigated copolymers (DHP-PiPOX or DHP-PETEGA) in concentration 0.5, 1, and 2.5 mol%. Afterward, the film was hydrated with deionized water at 50 °C for 60 min, or in case of the carboxyfluorescein-loaded niosomes, the thin lipid film was hydrated with carboxifluorescein solution (50 mM). The sonication step included 2 min of pulsatile sonication (20 s action/10 s pause) at 30% amplitude. As a subsequent step, gel filtration via Sephadex G50 columns was performed to exude the unentrapped carboxyfluorescein and to obtain final dispersions for successive analysis. Briefly, the niosomal suspensions were passed through a PD-10 column containing Sephadex G50, pre-equilibrated with water. As the niosomes were larger than the carboxifluorescein molecules, the niosomes were excluded from the gel matrix pores and eluted first, separating from the non-entrapped carboxifluorescein molecules. The purified niosomes were collected and used for further evaluation. Preparation of Daunorubicin Hydrochloride-Loaded Niosomes Daunorubicine HCl was loaded into niosomes by a remote loading procedure using the transmembrane ammonium gradient method. In brief, niosomes were prepared by hydrating the lipid film with an aqueous solution of ammonium sulfate (240 mM) and 1 mM EDTA in a round-bottomed flask at 60 °C, and the flask was rotated at 150 rpm (without vacuum). The prepared vesicles were sonicated as described above. Afterwards, the non-entrapped amount of ammonium sulfate was removed by gel filtration on PD-10 Sephadex G50 columns, pre-equilibrated with PBS buffer (pH 7.4); thus, the ammonium gradient was formed. Then aliquot part of the daunorubicin.HCl solution (4 mmol/mL) was added to an aliquot of the niosome suspension, and the resulting samples were incubated for 1 h at 50 °C. The non-entrapped drug was removed by gel filtration on Sephadex G50 columns, as described above. 3.3. Characterization of Niosomes 3.3.1. Morphology Images from cryogenic transmission electron microscopy (cryo-TEM) were acquired using a Tecnai F20 X TWIN microscope (FEI Company, Hillsboro, OR, USA) equipped with a field emission gun, operating at an acceleration voltage of 200 kV. The images were captured with a Gatan Rio 16 CMOS 4k camera (Gatan Inc., Pleasanton, CA, USA) and processed using Gatan Microscopy Suite (GMS) software (Gatan Inc., Pleasanton, CA, USA). Sample preparation involved vitrifying aqueous solutions on grids with holey carbon film (Quantifoil R 2/2; Quantifoil Micro Tools GmbH, Großlöbichau, Germany). Before use, the grids were treated for 15 s in oxygen plasma using a Femto plasma cleaner (Diener Electronic, Ebhausen, Germany). Cryo-samples were prepared by applying a droplet (3 μL) of the suspension onto the grid, blotting with filter paper, and immediately freezing in liquid ethane using an automated blotting device, the Vitrobot Mark IV (Thermo Fisher Scientific, Waltham, MA, USA). After preparation, the vitrified samples were stored in liquid nitrogen until they were loaded into a cryo-TEM holder Gatan 626 (Gatan Inc., Pleasanton, CA, USA) and examined in the TEM at −178 °C. 3.3.2. DLS Analysis The size, size distribution pattern, and zeta potential of the obtained nanocarriers were evaluated by a Zetasizer NanoZS (Malvern Instruments, Malvern, UK), operated with a 633 nm laser. The experiment was performed in triplicate at a scattering angle of 175 °C and at ambient (25 °C) and elevated (40 °C) temperatures for the conventional and copolymer-modified niosomes. The results are presented as mean values ± SD (n = 3). 3.3.3. Entrapment Efficacy (EE) The entrapment efficacy of daunorubicine HCl was determined by UV-VIS spectroscopy (λ = 494, r 2 (1) E E % = D n i o D t o t × 100 Dnio Dtot 3.4. Evaluation of Thermal Responsiveness of Niosomes To evaluate whether the incorporation of hydrophobically modified PiPOX and PETEGA copolymers can induce temperature-dependent triggered release, 100 μL of CF-loaded niosomes were diluted to 2 mL with PBS (pH 7.4) and the samples were incubated for 40 min at ambient temperature and at 42 °C in a thermostatic water bath. At the beginning and at the end of the incubation period, the fluorescence of the samples was measured at λemm = 520 nm and λex = 490 nm via a Hitachi 7000 fluorescence spectrophotometer. To determine the total intensity, niosomes were disrupted by adding 100 μL of 10% v v (2) CF leakage % = I n I t o t × 100 In Itot 3.5. In Vitro Daunorubicin Release The release experiments were performed by the dialysis method at three temperatures (25, 37, and 42 °C). In brief, a 1 mL niosomal suspension (corresponding to 1.4 mg/mL daunorubicin) or a 1 mL aqueous daunorubicin solution (at the same concentration) were placed in dialysis bags (SpecrtaPor, MWCO = 12–14 kDa, Sigma-Aldrich, Steinheim, Germany). The bags were immersed in 50 mL PBS in a thermostatic water bath. At predetermined time intervals, 2 mL of the acceptor phase was withdrawn for analysis and immediately replaced with 2 mL of fresh buffer. The absorbance of the samples was measured at 494 nm using a UV-Vis spectrophotometer, and the drug concentration was calculated according to a pre-built standard curve (linear in the range of 2 μg to 80 μg, correlation coefficient R 2 3.6. Stability Evaluation The storage stability of the optimal niosomal formulations was evaluated by storing the samples for 30 days at refrigerator temperature (4 ± 2 °C) and analyzing, from a comparative viewpoint, any alterations in their properties, such as their size, PDI, zeta potential, and EE values, at the beginning and the end of the tested period. 3.7. Assessment of Cytotoxicity of Daunorubicin-Loaded Conventional and Copolymer-Modified Thermoresponsive Niosomes 3.7.1. Cell Lines and Culture Conditions The in vitro antiproliferative effects of free or encapsulated daunorubicin hydrochloride were examined against the acute myelocyte leukemia-derived HL-60 cell line (German Collection of Microorganisms and Cell Cultures ( https://www.dsmz.de/ https://www.atcc.org/ 2 31 ® ® 3.7.2. MTT Colorimetric Assay The in vitro antiproliferative activity of daunorubicin in the niosomal formulations and free drug was assessed using an established method for evaluating cell viability, namely the Mosmann MTT dye reduction assay, with minor modifications [ 33 50 3.8. Statistical Analysis Statistical analysis was performed using Excel via one-way analysis of variance (ANOVA.) The value of p 4. Conclusions In this study, we successfully developed thermosensitive niosomal formulations, by incorporation of the temperature-sensitive copolymers DHP-PiPOX and DHP-PETEGA, for the targeted delivery of daunorubicin hydrochloride. The nanovesicles exhibited suitable physicochemical properties, specifically sizes and size distributions within the optimal range for systemic administration (below 200 nm) and low polydispersity indices. Notably, the niosomes demonstrated stability under physiological conditions, minimizing premature drug leakage. Importantly, they were capable of actively releasing daunorubicin in response to mild hyperthermia (42 °C), highlighting their potential for temperature-triggered drug delivery in cancer therapy. These findings support the further investigation of thermosensitive niosomes as promising carriers for controlled, site-specific delivery of chemotherapeutic agents. However, future investigations exploring in vivo performance and behavior in complex biological systems could provide additional insights into their potential as thermoresponsive drug delivery platforms with clinical relevance. Acknowledgments The bilateral project IC-PL/11/2024–2025 within the scientific cooperation agreement between the Bulgarian Academy of Sciences and the Polish Academy of Sciences is gratefully acknowledged. The authors also thank Stanislav Rangelov (Institute of Polymers, Bulgarian Academy of Sciences) for his conceptual input, critical review of the manuscript, and helpful comments during its preparation. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, D.M.; methodology, D.M. and V.G.; formal analysis, D.M., V.G. and R.M.; investigation, R.M., N.T.-M., E.D.-S., K.A. (Krum Aleksandrov), A.F., K.A. (Katerina Ahchiyska), E.D.; resources, D.M.; writing—original draft preparation, D.M. and V.G.; writing—review and editing, D.M., B.T. and N.T.-M.; visualization, R.M. and V.G.; supervision, D.M.; project administration, D.M.; funding acquisition, D.M. All authors have read and agreed to the published version of the manuscript. Please refer to the CRediT taxonomy for term explanations. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement The original contributions presented in this study are included in the article. Further inquiries can be directed to the corresponding author. Conflicts of Interest The authors declare no conflict of interest. Abbreviations The following abbreviations are used in this manuscript: DHP-PiPOX 1,3-dihexadecyl-propane-2-ol-poly(2-isopropyl-2-oxazoline DHP-PETEGA 1,3-dihexadecyl-propane-2-ol-poly(ethoxytriethylene glycol acrylate HL-60 acute myelocyte leukemia-derived cells CCL-1 normal mouse fibroblasts Cryo-TEM cryogenic transmission electron microscopy DLS dynamic light scattering MTT 3-(4,5-dimethylthiazol-2-yl)-2,5-diphenyltetrazolium bromide Tw60 polyoxyethylene sorbitan monostearate Sp60 sorbitan monostearate Ch cholesterol References 1. Aparajay P. Dev A. Functionalized niosomes as a smart delivery device in cancer and fungal infection Eur. J. Pharm. Sci. 2022 168 106052 10.1016/j.ejps.2021.106052 34740786 2. Du J. Lane L.A. Nie S. Stimuli-responsive nanoparticles for targeting the tumor microenvironment J. Control. Release 2015 219 205 214 10.1016/j.jconrel.2015.08.050 26341694 PMC4656063 3. Ge X. Wei M. He S. Yuan W.E. Advances of non-ionic surfactant vesicles (niosomes) and their application in drug delivery Pharmaceutics 2019 11 55 10.3390/pharmaceutics11020055 30700021 PMC6410054 4. Maeda H. Toward a full understanding of the EPR effect in primary and metastatic tumors as well as issues related to its heterogeneity Adv. Drug Deliv. Rev. 2015 91 3 6 10.1016/j.addr.2015.01.002 25579058 5. Mazzotta E. Tavano L. Muzzalupo R. Thermo-Sensitive Vesicles in Controlled Drug Delivery for Chemotherapy Pharmaceutics 2018 10 150 10.3390/pharmaceutics10030150 30189683 PMC6161155 6. Tavano L. Oliviero Rossi C. Picci N. Muzzalupo R. Spontaneous temperature-sensitive Pluronic( ® Int. J. Pharm. 2016 511 703 708 10.1016/j.ijpharm.2016.07.064 27484834 7. Hemati M. Haghiralsadat F. Jafary F. Moosavizadeh S. Moradi A. Targeting cell cycle protein in gastric cancer with CDC20siRNA and anticancer drugs (doxorubicin and quercetin) co-loaded cationic PEGylated nanoniosomes Int. J. Nanomed. 2019 14 6575 6585 10.2147/IJN.S211844 PMC6699499 31616144 8. Mattioli R. Ilari A. Colotti B. Mosca L. Fazi F. Colotti G. Doxorubicin and other anthracyclines in cancers: Activity, chemoresistance and its overcoming Mol. Aspects Med. 2023 93 101205 10.1016/j.mam.2023.101205 37515939 9. Bindusri C.H. Devi P.G. Chowdary Y.A. Veerendranadh Y.V. Statistical Study on Daunorubicin Int. J. Pharm. Sci. 2025 3 742 771 10.5281/zenodo.14631411 10. Callies S. De Alwis D.P. Mehta A. Burgess M. Aarons L. Population pharmacokinetic model for daunorubicin and daunorubicinol co-administered with zosuquidar.3HCl (LY335979) Cancer Chemother. Pharmacol. 2004 54 39 48 10.1007/s00280-004-0775-4 15045528 11. Schmoll H.-J. Höffken K. Possinger K. Kompendium Internistische Onkologie, Teil 1–2 Springer Berlin/Heidelberg, Germany 1996 10.1007/978-3-642-79214-4 12. Britle A.J. Anthracyclines and cardiotoxicity Clin. Oncol. (R. Coll. Radiol.) 2000 12 146 152 10.1053/clon.2000.9141 10942330 13. He Y. Zhang W. Xiao Q. Fan L. Huang D. Chen W. He W. Liposomes and liposome-like nanoparticles: From anti-fungal infection to the COVID-19 pandemic treatment Asian J. Pharm. Sci. 2022 17 817 837 10.1016/j.ajps.2022.11.002 36415834 PMC9671608 14. Balasubramaniam A. Kumar V.A. Pillai K.S. Formulation and in vivo evaluation of niosome-encapsulated daunorubicin hydrochloride Drug Dev. Ind. Pharm. 2002 28 1181 1193 10.1081/DDC-120015351 12476864 15. Liu F.R. Jin H. Wang Y. Chen C. Li M. Mao S.J. Wang Q. Li H. Anti-CD123 antibody-modified niosomes for targeted delivery of daunorubicin against acute myeloid leukemia Drug Deliv. 2017 24 882 890 10.1080/10717544.2017.1333170 28574300 PMC8244627 16. Alrbyawi H. Boddu S.H.S. Poudel I. Annaji M. Mita N. Arnold R.D. Tiwari A.K. Babu R.J. Cardiolipin for Enhanced Cellular Uptake and Cytotoxicity of Thermosensitive Liposome-Encapsulated Daunorubicin toward Breast Cancer Cell Lines Int. J. Mol. Sci. 2022 23 11763 10.3390/ijms231911763 36233061 PMC9569717 17. Yaramiri A. Asalh R.A. Asalh M.A. AlSawaftah N. Abuwatfa W.H. Husseini G.A. A Comprehensive Review of Smart Thermosensitive Nanocarriers for Precision Cancer Therapy Int. J. Mol. Sci. 2025 26 7322 10.3390/ijms26157322 40806454 PMC12347689 18. Gugleva V. Michailova V. Mihaylova R. Momekov G. Zaharieva M.M. Najdenski H. Petrov P. Rangelov S. Forys A. Trzebicka B. Formulation and evaluation of hybrid niosomal in situ gel for intravesical co-delivery of curcumin and gentamicin sulfate Pharmaceutics 2022 14 747 10.3390/pharmaceutics14040747 35456581 PMC9028379 19. Junyaprasert V.B. Singhsa P. Suksiriworapong J. Chantasart D. Physicochemical properties and skin permeation of Span 60/Tween 60 niosomes of ellagic acid Int. J. Pharm. 2012 423 303 311 10.1016/j.ijpharm.2011.11.032 22155414 20. Yeo L.K. Olusanya T.O.B. Chaw C.S. Elkordy A.A. Brief effect of a small hydrophobic drug (cinnarizine) on the physicochemical characterisation of niosomes produced by thin-film hydration and microfluidic methods Pharmaceutics 2018 10 185 10.3390/pharmaceutics10040185 30322124 PMC6321096 21. Xi L. Li C. Wang Y. Gong Y. Su F. Li S. Novel Thermosensitive Polymer-Modified Liposomes as Nano-Carrier of Hydrophobic Antitumor Drugs J. Pharm. Sci. 2020 109 2544 2552 10.1016/j.xphs.2020.05.006 32446661 22. Abuwatfa W.H. Awad N.S. Pitt W.G. Husseini G.A. Thermosensitive polymers and thermo-responsive liposomal drug delivery systems Polymers 2022 14 925 10.3390/polym14050925 35267747 PMC8912701 23. Damera D.P. Nag A. Tuning the phase transition temperature of hybrid Span60-L64 thermoresponsive niosomes: Insights from fluorescence and Raman spectroscopy J. Mol. Liq. 2021 340 117110 10.1016/j.molliq.2021.117110 24. Toncheva N. Tsvetanov C. Rangelov S. Trzebicka B. Dworak A. Hydroxyl end-functionalized poly(2-isopropyloxazoline)s used as nano-sized colloidal templates for preparation of hollow polymeric nanocapsules Polymer 2013 54 5166 5173 10.1016/j.polymer.2013.07.042 25. Toncheva-Moncheva N. Dimitrov P. Tsvetanov C. Trzebicka B. Dworak A. Rangelov S. Formation of mesoglobules in aqueous media from thermo-sensitive poly(ethoxytriethyleneglycol acrylate) Polym. Bull. 2011 67 1335 1346 10.1007/s00289-011-0545-5 26. Li M. Jiang S. Simon J. Paßlick D. Frey M.L. Wagner M. Mailänder V. Crespy D. Landfester K. Brush conformation of polyethylene glycol determines the stealth effect of nanocarriers in the low protein adsorption regime Nano Lett. 2021 21 1591 1598 10.1021/acs.nanolett.0c03756 33560851 PMC8023711 27. El-Far S.W. Abo El-Enin H.A. Abdou E.M. Nafea O.E. Abdelmonem R. Targeting colorectal cancer cells with niosome systems loaded with two anticancer drug models: Comparative in vitro and anticancer studies Pharmaceuticals 2022 15 816 10.3390/ph15070816 35890115 PMC9323826 28. Wang X. Li C. Wang Y. Chen H. Zhang X. Luo C. Zhou W. Li L. Teng L. Yu H. Smart drug delivery systems for precise cancer therapy Acta Pharm. Sin. B 2022 12 4098 4121 10.1016/j.apsb.2022.08.013 36386470 PMC9643298 29. Cheng Y. Weng S. Yu L. Zhu N. Yang M. Yuan Y. The role of hyperthermia in the multidisciplinary treatment of malignant tumors Integr. Cancer Ther. 2019 18 1534735419876345 10.1177/1534735419876345 31522574 PMC7242805 30. Ritwiset A. Krongsuk S. Johns J.R. Molecular structure and dynamical properties of niosome bilayers with and without cholesterol incorporation: A molecular dynamics simulation study Appl. Surf. Sci. 2016 380 23 31 10.1016/j.apsusc.2016.02.092 31. ISO 10993-5:2009 Biological Evaluation of Medical Devices—Part 5: Tests for In Vitro Cytotoxicity International Organization for Standardization Geneva, Switzerland 2017 32. Dmitrov E. Toncheva-Moncheva N. Bakardzhiev P. Forys A. Doumanov J. Mladenova K. Petrova S. Trzebicka B. Rangelov S. Nucleic acid-based supramolecular structures: Vesicular spherical nucleic acids from a non-phospholipid nucleolipid Nanoscale Adv. 2022 4 3793 3803 10.1039/D2NA00527A 36133345 PMC9470030 33. Konstantinov S.M. Eibl H. Berger M.R. BCR-ABL influences the antileukaemic efficacy of alkylphosphocholines Br. J. Haematol. 1999 107 365 374 10.1046/j.1365-2141.1999.01700.x 10583226 Figure 1 Cryo-TEM micrographs of plain ( a b c Figure 2 Carboxyfluorescin release from DHP-PiPOX-modified ( a b Figure 3 Daunorubicin HCl release from niosomes as a function of time at 25 °C and 37 °C ( a b Figure 4 Concentration–response curves evaluated by a standard MTT test after 72 h treatment of human acute myeloid leukemia (HL-60) cell line with varying concentrations of free or nanoformulated daunorubicin hydrochloride. Each data point represents a mean value ± SD (n = 8). Figure 5 Concentration–response curves established by the MTT dye reduction assay after 72 h of continuous exposure of mouse fibroblast cells (CCL-1) to varying concentrations of copolymer solutions or non-loaded plain and copolymer-modified vesicles. Each data point represents an average arithmetic value ± standard deviation of at least 8 independent experiments. pharmaceuticals-18-01375-t001_Table 1 Table 1 Physicochemical properties of ultrasound-treated plain (Tw60:Sp60:Ch 3.5:3.5:3 molar ratio) niosomes and their copolymer-modified counterparts. Sample Code Polymer D h PDI ± SD ζ-Potential   25 °C 40 °C 25 °C 40 °C 25 °C 40 °C S1 - 133 ± 1.7 142 ± 10.7 0.3 ± 0.09 0.46 ± 0.05 −11.2 ± 1.5 −11.0 ± 2.1 DHP-PiPOX-modified niosomes S2 0.5 100 ± 2.5 115 ± 9.5 0.24 ± 0.06 0.24 ± 0.02 −26.1 ± 0.07 −18.5 ± 0.5 S3 1 110 ± 6.9 126 ± 5.2 0.34 ± 0.08 0.27 ± 0.01 −44.1 ± 0.35 −42.2 ± 0.6 S4 2.5 112 ± 5.3 136 ± 8.5 0.24 ± 0.05 0.31 ± 0.09 −26.1 ± 0.01 −19.2 ± 1.4 DHP-PETEGA-modified niosomes S5 0.5 94 ± 8.5 76.2 ± 9.7 0.32± 0.05 0.19± 0.02 −12.8 ± 2.6 −12.5 ± 0.4 S6 1 100 ± 9.7 117 ± 15.6 0.28± 0.06 0.17 ± 0.2 −15.1 ± 0.23 −13.5 ± 0.35 S7 2.5 119 ± 7.6 163 ± 4.2 0.27 ± 0.02 0.17 ± 0.05 −12.5 ± 0.14 −10.2 ± 0.78 pharmaceuticals-18-01375-t003_Table 3 Table 3 Daunorubicin hydrochloride encapsulation efficacy of niosomes after passive and active drug loading. Sample Code Encapsulation Efficacy (%) Passive Loading Active Loading Tw60:Sp60:Ch:Dauno (sN1) 18.9 ± 3.4 71 ± 2.8 Tw60:Sp60:Ch:DHP-PIPOX:Dauno (sN4) 16.8 ± 6.2 68.6 ± 4.1 Tw60:Sp60:Ch:DHP-PETEGA:Dauno (sN7) 16.2 ± 4.3 66.5 ± 3.2 pharmaceuticals-18-01375-t004_Table 4 Table 4 Size, size distribution, and zeta potential of loaded plain and polymer-modified thermosensitive niosomes at 25 °C. Values represent means ± S.D. (n = 3). Composition Copolymer Dauno:Surfactants D h PDI ± SD ζ-Potential sN1 - 2:15 157 ± 2.3 0.29 ± 0.05 −10 ± 1.8 sN4 DHP-PiPOX 2:15 155 ± 5.9 0.25 ± 0.04 −22 ± 2.4 sN7 DHP-PETEGA 2:15 158 ± 4.8 0.29 ± 0.02 −11 ± 2.5 pharmaceuticals-18-01375-t005_Table 5 Table 5 Storage stability of optimal daunorubicin-loaded niosomes after one month of storage at 4 ± 2 °C. Sample Size (nm) PDI ζ Potential EE (%) (sN1) Initial 157 ± 2.2 0.29 ± 0.05 −10 ±1.8 71 ± 2.8 After 1 month storage 161 ± 2.2 0.31 ± 2.2 −10.8 ± 3.4 66 ± 1.6 (sN4) Initial 155 ± 5.9 0.25 ± 0.04 −22 ± 2.4 68.6 ± 4.1 After 1 month storage 151 ± 7.5 0.29 ± 0.04 −24 ± 3.8 66.7 ± 2.2 (sN7) Initial 158 ± 4.8 0.29 ± 0.02 −11 ± 2.5 66.5 ± 3.2 After 1 month storage 162 ± 5.4 0.32 ± 0.06 −10.9 ± 2.2 62.1 ± 4.2 pharmaceuticals-18-01375-t006_Table 6 Table 6 Equi-effective concentrations (IC 50 Sample HL-60 Free daunorubicin 12.14 ± 2.15 sN1 9.85 ± 3.01 sN4 6.91 ± 2.42 sN7 8.54 ± 1.18 ",
  "metadata": {
    "Title of this paper": "BCR-ABL influences the antileukaemic efficacy of alkylphosphocholines",
    "Journal it was published in:": "Pharmaceuticals",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472712/"
  }
}