{
  "title": "Paper_238",
  "abstract": "pmc Mol Cell Mol Cell 445 elsevierwt Molecular Cell 1097-2765 1097-4164 pmc-is-collection-domain yes pmc-collection-title Elsevier Sponsored Documents PMC12488066 PMC12488066.1 12488066 12488066 40780181 10.1016/j.molcel.2025.07.005 S1097-2765(25)00606-9 1 Article Chromatin-dependent motif syntax defines differentiation trajectories Durdu Sevi 1 Iskar Murat 1 Isbel Luke 1 2 3 Hoerner Leslie 1 Wirbelauer Christiane 1 Burger Lukas 1 4 Hess Daniel 1 Iesmantavicius Vytautas 1 Schübeler Dirk dirk@fmi.ch 1 5 6 ∗ 1 2 3 4 5 ∗ dirk@fmi.ch 6 Lead contact 07 8 2025 85 15 498048 2900 2918.e16 21 7 2024 27 3 2025 14 7 2025 07 08 2025 02 10 2025 03 10 2025 © 2025 The Author(s) 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Summary Transcription factors (TFs) recognizing DNA motifs within regulatory regions drive cell identity. Despite recent advances, their specificity remains incompletely understood. Here, we address this by contrasting two TFs, Neurogenin-2 (NGN2) and MyoD1, which recognize ubiquitous E-box motifs yet drive distinct cell fates toward neurons and muscles, respectively. Upon induction in mouse embryonic stem cells, we monitor binding across differentiation, employing an interpretable machine learning approach that integrates preexisting DNA accessibility. This reveals a chromatin-dependent motif syntax, delineating both common and factor-specific binding, validated by cellular and in vitro Graphical abstract Highlights • Chromatin context and motif grammar guide specific TF binding among many sites • Chromatin-dependent motif rules explain opportunistic, cooperative, and pioneer binding • Subtle motif variants direct gene activation via distinct TF complexes • Predictive models generalize across TFs and differentiation systems Durdu et al. crack the code of transcription-factor specificity by integrating chromatin context and motif syntax, validated by targeted assays. Focusing on NGN2 and MyoD1, they develop predictive models, distinguish functional binding from millions of potentials, and uncover generalizable rules explaining how transcription factors drive distinct cell fates. Keywords transcription factor specificity motif syntax motif variants pioneer factors chromatin accessibility gene regulation cell differentiation machine learning predictive models E-box pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf no pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Published: August 7, 2025 Introduction Eukaryotic transcription factors (TFs) play an important role in creating cell-type diversity in multicellular organisms, mediating selective activation of genomic regions. Unlike their prokaryotic counterparts, most eukaryotic TFs typically bind to DNA sequence motifs that are low in information content due to being short and degenerate, set against the backdrop of a vast genome. 1 2 , 3 , 4 5 6 7 , 8 Specific TF-binding patterns are prevalently described as “context-dependent,” shaped by two main mechanisms: direct recruitment via protein-protein interactions and indirect recruitment through chromatin made permissive by other TFs. 9 10 11 , 12 , 13 , 14 7 15 6 , 16 , 17 , 18 , 19 To gain further insights, we established homogeneous differentiation models in mouse embryonic stem cells (mESCs) through controlled induction of two bHLH TFs, NGN2 and MyoD1, driving generation of neurons and myocytes, respectively. This system enabled time-resolved analysis of genomic binding and downstream responses of two similar short-motif-recognizing TFs in relation to DNA sequence and chromatin state. By measuring their immediate genomic binding in a similar cellular state, we identified key determinants of chromatin engagement that shape their specific binding patterns among millions of potential sites. Using machine learning, we uncovered a chromatin-dependent motif syntax with strong predictive power underlined by preexisting DNA accessibility, motif variants, motif frequency, and relative positioning. NGN2 and MyoD1 open chromatin depending on single base-pair (bp) differences in their motifs, with patterns that can differ from their binding strength. Cellular and in vitro Results Controlled induction of NGN2 and MyoD1 in mESCs drives reproducible and synchronous differentiation To address how TFs with highly abundant and similar sequence motifs can distinctly guide specific lineages, we established a system in mESCs, allowing for the controlled induction of individual TFs. Specifically, we employed NGN2, which directs mESCs toward a neuronal lineage ( Figures S1 20 , 21 , 22 Figure 1 Figure 1 NGN2 and MyoD1 induces neurogenesis and myogenesis, respectively, when expressed in mESCs despite recognizing similar short DNA sequence motifs (A) Immunofluorescence images of mESCs prior and 2-days post-induction of NGN2 and MyoD1, resulting in distinct cell types. Nuclear marker Hoechst in magenta, neuronal marker TubIII, and myocyte marker α-actinin in green. Scale bar, 20 μm. The logos represent the E-box motif, de novo Figures S2 (B) Differentiation trajectories illustrated by principal-component analysis (PCA) of the transcriptomes for mESCs (blue), NGN2 (green), MyoD1 (purple), and noTF (gray) control induction. (C) Genome browser tracks of the Dll1 gene locus with E-box motifs (black bars) illustrating shared and factor-specific binding by NGN2 and MyoD1 at 6 h. For controlled induction, we engineered mESCs with the Tet-On system with single-locus insertion of the respective TFs ( STAR Methods 23 Figures S1 Figures 1 S1 Video S1 24 , 25 Figures 1 S1 Figures 1 S1  Video S1. Time-lapse imaging of mESCs differentiating into neurons and myocytes upon NGN2 and MyoD1 induction in contrast to mESCs without TF induction, related to Figure 1 Genomic engagement is a function of prior accessibility, motif frequency, and motif sequence To investigate genome-wide binding following induction, we profiled NGN2 using chromatin immunoprecipitation sequencing (ChIP-seq) at 6 h after induction ( Figure 1 Figures S1 S2 Figures S2 Figure S2 STAR Methods 26 , 27 Figures S2 The presence of these cognate-motif sequences alone, despite their high enrichment, does not account for specific binding patterns of NGN2 or MyoD1 as there are over a million NGN2 cognate motifs in the genome, leaving 99% unbound. We hypothesized that NGN2 and MyoD1 might preferentially bind sites within open chromatin. To explore this, we contrasted binding with genome-wide DNA accessibility prior to TF induction using DNase I hypersensitivity (DHS) mapping 28 Figures 2 Figure 2 Figure 2 Figure 2 Figures 2 Figure 2 DNA accessibility and cognate-motif occurrences are major factors underlying initial binding patterns (A) Density plot showing preexisting DNase-seq (DHS 0 h) and 6 h post-induction NGN2 ChIP-seq enrichments in all 1.3 million NGN2-motif-containing genomic regions (500 bp with minimum one non-overlapping cognate-motif, described in Figure S2 (B) Example cognate-motif sites for open-bound, closed-bound, open-unbound, and closed-unbound categories are visualized as genomic tracks of 0 h DNase-seq, NGN2 motifs, 6 h NGN2 ChIP-seq, and control GFP ChIP-seq. (C and D) Percentage of bound cognate-motif sites (enrichment > 1.5) grouped in bins according to their accessibility prior to induction, showing higher likelihood of binding (>50%) in open regions and low likelihood (<1%) in closed regions, indicating the impact of DNA accessibility. (E and F) Frequency of multiple motifs (gray: one, light-blue: two, and dark-blue: three or more cognate motifs) in consensus ChIP-seq peaks and rest of the cognate-motif sites in the genome, grouped in bins according to their accessibility prior to induction (e.g., accessibility < 6), showing closed-bound sites contain more multi-motifs. (G and H) Fitted line plots of average ChIP-seq enrichment versus DHS 0 h at single cognate-motif sites (residing in consensus ChIP-seq peaks and their matched backgrounds), grouped by the frequent central nucleotides of their E-box cognate motifs. The separation in the curves of motif variants at a given accessibility illustrates the difference in the likelihood to be bound. (I) Heatmap of combined NGN2 and MyoD1 peaks, split in three groups: strongly bound by both factors (N and M), exclusively bound by one factor (N or M), and preferentially bound by one of the two (N > M or M > N), visualizing DHS 0 h (red), NGN2 ChIP-seq (green), MyoD1 ChIP-seq (purple), and cognate-motif variants with TA, GA, GC, and GG central nucleotides (black). (J) Genomic regions with exclusive or overlapping NGN2 and MyoD1 binding, exemplifying the effect of chromatin accessibility and occurrence of cognate-motif variants (green: NGN2-preferred, pruple:MyoD1-preferred) present at the peak centers. Next, we asked whether the likelihood of binding relates to particular motif variants. To test this, we analyzed NGN2 and MyoD1 binding at genomic regions with single motif occurrences relative to initial DNA accessibility. While all motif variants, grouped by their central nucleotides, were comparably bound when residing in accessible chromatin, differences became apparent in less-accessible chromatin ( Figures 2 ( Figures 2 S2 ) Figure 2 We next addressed if other preexisting chromatin features, such as histone modifications, might predict binding. 12 , 29 Figures S2 If genomic binding of NGN2/MyoD1 depend on motif occurrence and DNA accessibility, then differential binding should occur in genomic sites that are initially closed but have higher frequency of NGN2’s and MyoD1’s individually preferred motifs. Conversely, similar binding should occur in regions with higher accessibility, or where different preferred motifs are adjacent to each other and thus bound by both. Contrasting bound regions among NGN2- and MyoD1-binding sites indeed illustrates a general overlap at highly accessible regions and distinct binding at sites with lower accessibility, which are enriched for factor-specific motif variants ( Figures 2 S2 Figures 2 S2 Figure S2 Although our analysis thus far identifies contributors to the distinct binding of NGN2 versus MyoD1, these components alone still fail to account for many genomic binding events, including those unbound motifs residing in accessible regions or with multiple motifs in proximity ( Figures 2 de novo CNNs identify a chromatin-dependent motif syntax that underlies TF binding Deep learning models, combined with interpretation tools, offer the most informative means of identifying de novo cis 30 , 31 , 32 , 33 , 34 , 35 , 36 , 37 , 38 Figure 3 STAR Methods 30 , 39 Figures S2 S3 Figure 3 Identification of a chromatin-dependent motif syntax using a CNN (A) Scheme of the applied CNN for predicting the primary 6 h binding of NGN2 and MyoD1, using DNA sequence and continuous 0 h DHS (DNase I) signal as input. (B) Contrasting frequency-based motif representation (PFM), informing about the frequency of the DNA bases in the enriched motifs versus contribution weight matrices (CWM), identified by the CNN model, and informing about the contribution of the DNA bases to the degree of binding enrichments. DNA sequences are represented with the letters A, C, G, T, and accessibility with the letter D. Differences in PFM and CWM highlight the binding strength contribution of flanking nucleotides and less frequent central nucleotides. The “D” profile indicates high contribution of accessibility directly overlapping with the E-box motif and lower contribution of the surrounding. ( n (C) Calculation of NGN2 and MyoD1’s relative affinities to E-box motif variants independent of the genomic sequence context at any given accessibility using the CNN model on synthetic sequences (average gained binding strength upon placing the same motif across various backgrounds with simulated accessibility). The predicted binding strengths across different 0 h accessibility are represented from blue to red. (D) Single-locus display of DNA sequence, 0 h accessibility profile and their deconvolved contribution scores for NGN2 6 h binding prediction, reporting on the features accounting for the binding strength. (E) Predicted NGN2 binding strength contribution of the flanking bases (5′-flanking in red, 3′ in green) for CAGATG motif. (F) Contribution of the flanking bases to the binding prediction of E-box motif variants (central nucleotides in blue, 3′-flanking nucleotides in green). (G) Comparison of pre-induction (0 h) MNase and DNase I digestion profiles at NGN2 cognate-motif sites residing in open chromatin, grouped as sites that will be bound or not bound by NGN2 upon 6 h induction. (H) DNA sequence motif (seqlet, identified by TF-MoDISco), containing two E-box motifs, that is informative for NGN2 binding prediction at bound sites residing in closed chromatin. (I) Fraction of NGN2 bound-closed sites with two NGN2 motifs at various base pair distances between motif centers. Inner: modeled NGN2 binding (AlphaFold3) on two 11-bp apart (highest binding potential) NGN2 motifs. To identify features influencing TF-binding predictions, 40 26 41 Figures 3 S3 6 , 42 in-silico STAR Methods 37 Figures 3 S3 Figures 3 Figures 2 Visual inspection of genomic tracks of contribution scores calculated for DNA sequence and accessibility illustrates that the CNN model assigns different degrees of importance to E-box motifs depending on sequence variations and their local accessibility ( Figures 3 S3 Figure 3 Figure 3 Although binding occurs more frequently in open chromatin, many accessible sites remain unbound ( Figures 2 Figures 3 S3 43 44 Figure 3 45 , 46 47 48 , 49 , 50 , 51 Figure S3 in vitro 43 Within less-accessible regions, the CNN model discerns a motif syntax of two E-box motifs, in line with higher motif occurrences, and provides further insights into their relative position ( Figures 2 S3 S3 in-silico 33 Figure S3 Figures S3 Figure S3 52 Figures 3 S3 53 54 Taken together a motif syntax composed of motif variants, their local frequency and the underlying chromatin state accounts for the ability of a genomic region to be bound by the tested TFs. Motif positions relative to phased nucleosomes further influence this likelihood within open chromatin, while at less-accessible regions, higher motif number with optimal inter-motif spacing is critical for binding ( Figure S3 The abilities of NGN2 and MyoD1 to open chromatin and activate genes differ depending on motif variant Following initial binding, we asked how NGN2 and MyoD1 subsequently impact chromatin and transcriptional activity by performing transposase-accessible chromatin sequencing (ATAC-seq) and ChIP-seq for lysine 27 acetylation of histone H3 (H3K27ac), and RNA polymerase II (RNA Pol II) 6 h after induction. For visualization, we employed dimensionality reduction of relevant genomic regions, that are either NGN2 or MyoD1 bound or show changes in accessibility at any time point ( Figure 4 Figure 4 Motif variant-specific chromatin and transcription responses (A) Uniform manifold approximation and projection (UMAP) of relevant genomic regions (represented as single points, positioned based on similarities in accessibility and TF binding) visualizing initial accessibility, TF ChIP-seq and fold-changes in ATAC-seq, H3K27ac, and RNA Pol II ChIP-seq, colored from blue to red. Bound regions with low initial accessibility or factor-specific binding are outlined with dashed lines. Curved lines highlight NGN2-specific (green), MyoD1-specific (purple), and overlapping (brown) binding. The changes highlight increased activity in closed-bound sites, though with variable degrees (e.g., for NGN2 factor-specific sites, binding strength is graded from left to right and chromatin opening from top to bottom). (B) Example genomic locus, showing regions with similar 0 h accessibility and 6 h NGN2 binding, yet gaining different degrees of activity. (C) Contrasting the binding and activity on the motif variants using CNN model predictions on synthetic sequences. Predicted 6 h binding, change in ATAC-seq and H3K27ac ChIP-seq upon NGN2 induction at NGN2 E-box motifs with TA, GA, and GC central nucleotides across all accessibility-ranges are shown as heatmap from blue to red. The outlined box highlights the differences between the binding strength and its impact on chromatin for CAGATG versus CATATG motifs (at DHS 0.3, representing low initial accessibility with high dynamic range for gain of activity upon binding). (D and E) Contrasting predicted binding and accessibility-change upon NGN2 or MyoD1 induction at CAGATG or CAGCTG motif (DHS 0.3) depending on the flanking bases. (F) A library of barcoded transcriptional reporters, inserted stably in a defined locus, designed to report the effect of NGN2 motif variations on gene expression upon NGN2 induction. GA: single GA motif, GA + 40 + GA: two GA motifs with 40 bp between them. GA + 20 + GA: two GA motifs with 20 bp between them. GA + GA + GA: three GA motifs. GA + NN: one GA motif and another motif with the indicated central nucleotide and 3′-flanking nucleotides. Values correspond to differences in gene expression between respective construct relative to a scrambled motif control at the same time point post NGN2 induction ( Figure S4 Table S5 In (C)–(F), central nucleotides in blue, 5′-flanking in red, 3′-flanking in green. At 6 h, NGN2- or MyoD1-bound sites that are initially closed displayed an overall increase in accessibility, H3K27ac, and RNA Pol II enrichment ( Figure 4 55 Figure 4 Figure 4 Figure 4 Figures 4 S4 Figures 4 S4 Figures 4 S4 Figure 4 To readily test whether these subtle single-base variations impact transcriptional output, we measured gene expression of over 20 barcoded reporter constructs, harboring different motif variations, inserted into the same genomic locus 23 , 56 Figures 4 S4 Figures S4 Single-base motif variations drive regulatory diversity via distinct TF combinations Many TFs can potentially engage with E-box motifs, such as bHLH and zinc-finger TF families. 4 , 57 , 58 Figures S5 3 , 59 Figures 5 S5 in vitro 60 Figure 5 Figure S5 Figure 5 Figure 3 Figure 5 Homodimer and heterodimer formation with other bHLH proteins increase the regulatory repertoire of NGN2 and MyoD1 (A) Mass spectrometric detection of proteins interacting with NGN2 (enrichment relative to GFP > 5 with −log10( p Table S8 (B) Scheme of DAP-seq to probe genomic DNA-binding preferences in vitro (C) Differential E-box k-mer enrichment analysis (using top 5,000 DAP-seq enriched peaks) among NGN2, MyoD1, and TCF homodimers and heterodimers. (D) Differential E-box k-mer enrichment analysis among NGN2-bound regions, grouped based on change in 6 h NGN2 binding upon decreasing TCF levels in comparison with control treatment. (KD: small interfering RNA (siRNA)-knockdown). (E) Images of 48 h NGN2-induced cells for inspection of cellular morphology (cytoplasmic GFP signal, segmented for axons, in green and cell bodies in blue) treated with control (non-targeting siRNA), Tcf3, Tcf4, and Tcf12 siRNA. Scale bar, 50 μm. To test this hypothesis experimentally in the cellular context, we tagged the Tcf3 allele and profiled its genomic binding in mESCs, which showed similar motif preferences to TCF homodimers ( Figures S5 Figures 5 S5 in vitro in vitro in vitro Figure S4 Figures 5 S5 Figures 4 S5 Together, this demonstrates that different activities at motif variants reflect binding by different sets of protein partners for both NGN2 and MyoD1 ( Figures S5 Newly activated TFs reshape the accessibility landscape, causing further divergence in NGN2- and MyoD1-binding patterns While NGN2 and MyoD1 binding is initially guided by chromatin, their binding subsequently modifies chromatin ( Figures 2 3 4 Figures 6 S6 Figures 6 S6 Figures 6 S6 Figure S6 Figures 6 S6 Figures S6 Figure 6 Reshaped accessibility landscape diverges NGN2 and MyoD1 genomic binding (A) UMAP of genomic regions (as in Figure 4 (B) ATAC-seq fold-changes upon 24 h NGN2 and MyoD1 induction, visualized on UMAP, show loss of accessibility at co-bound high DHS-0 h regions and gain in new, low DHS-0 h regions. Outlines indicate 24 h-gained NGN2-binding sites in green, 24 h-gained MyoD1-binding sites in purple, and sites that gain accessibility but not NGN2 binding in blue. (C) Differential motif enrichment analysis (JASPAR TF-catalog) for NGN2 and MyoD1, contrasting their 6 versus 24 h binding. Top-two-enriched unique motifs and top-enriched E-box motifs for each time point are visualized. Combined peaks of 6 and 24 h binding are binned according to changes in their binding enrichment between 6 and 24h ( Figures S6 (D) Genome browser tracks of NGN2 ChIP-seq, ATAC-seq, H3K27Ac ChIP-seq, RNA Pol II ChIP-seq, and RNA-seq at the Ebf3 locus. (E) NGN2 motif density around EBF motifs that are newly made accessible upon 24 h NGN2 induction, sub-grouped as NGN2 bound and not bound at 24 h (corresponding to the outlined regions in (B), green versus blue). (F) Metaplots showing ATAC-seq signal pre- and post-NGN2 induction at 24 h, grouped as in (E). Regions with an EBF motif (blue) show chromatin opening. Regions with an EBF motif as well as an NGN2 motif, within 100 bp, (green) gain new NGN2 binding and high accessibility. (G) Schematic summary of dynamic NGN2/MyoD1 binding through differentiation. We conclude that NGN2 and MyoD1 engagement to initially closed sites at 6 h activates expression of other TFs. These TFs subsequently change the chromatin landscape, creating accessibility that generates new opportunities for binding by NGN2 and MyoD1, further diverging the activity patterns in a lineage-specific fashion ( Figure 6 The CNN-derived, chromatin-dependent motif syntax is transferable and predicts TF-chromatin interactions in different cellular contexts Since the observed binding patterns for NGN2 and MyoD1 are dependent on the initial genomic accessibility, which itself reflects the activity of other TFs, we expect them to vary between cell types. If our predictive model for binding is generalizable, it should be transferable to different cell types as long as their starting accessibility is taken into account. We tested this hypothesis using available ChIP-seq and ATAC-seq datasets from a widely used myogenesis model, C2C12 cells, where MyoD1 can be induced by changing culture conditions, comparable to our dox-induction system ( Figures S7 61 , 62 , 63 Figures 7 S7 Figures 7 S3 S7 Figure7 The models, trained in mESCs, predict TF binding and activity in other cellular contexts (A) Heatmaps of MyoD1 ChIP-seq in mESCs (6 h) and C2C12 cells (24 h) upon induction, together with their pre-induction accessibility in mESCs (DNase-seq 0 h) and in C2C12 cells (ATAC-seq 0 h), visualized on combined MyoD1-binding sites. (B) Enriched TF-MoDISco E-box seqlets in MyoD1 bound sites in mESCs and C2C12 cells. (C) Venn diagram contrasting MyoD1 ChIP-seq peaks in mESCs and C2C12 cells illustrating low overlap among binding sites. (D) Schematic of CNN model transfer: model trained for TF binding in mESCs is applied to predict binding in other cell types (left). Correlations are shown between observed-MyoD1-binding in C2C12 cells and observed-MyoD1-binding in mESCs or predicted-MyoD1-binding in C2C12 cells by the model trained in mESCs (right). (E) Predicted NGN2 binding enrichments in all murine ENCODE cCREs (rows) depending on simulated initial DNA accessibility (columns), sorted based on NGN2 binding potential at low DHS (left). Top 5,000 tissue-specific cCREs with highest NGN2 binding potential at low DHS are contrasted with 2,000 randomly sampled tissue-specific cCREs from the bottom 50% of the left panel (middle). Accessibility (DNase-seq) of the cCREs, in top-enriched ENCODE tissue profiles and profiles closest to background (right). The comparison indicates that cCREs, with high NGN2 binding potential, gain activity in cerebellum and brain. Example cCREs proximal to the genes upregulated in mESCs upon NGN2 induction are labeled. (F) An example GWAS defined SNP (rs58130172) changing an E-box variant, in a tissue-specific human cCRE, active in brain. Scheme describes the SNP location at DISP3 gene and the effected sequence (top). Predicted NGN2 binding and activity change at the reference and alternative cCRE sequence depending on initial accessibility (bottom). (G) Measured effect of the rs58130172 SNP on DISP3 gene expression retrieved from eQTL data. These findings illustrate that chromatin binding can readily be explained by preexisting DNA accessibility and a composite motif syntax, which, in case of MyoD1 and NGN2, highlights distinct sequence specificities. Next, we applied our framework to a highly studied bHLH TF, Ascl1, for which, however, varying motif preferences, 17 , 58 , 64 , 65 6 , 66 , 67 , 68 in vitro Figures S8 69 , 70 Figures S8 At sites where NGN2 or MyoD1 open chromatin, our model predicts a motif syntax that is largely independent on existing accessibility. Therefore, genomic sequences bearing such syntax are expected to be bound in all cell types where the respective TF is expressed. To test this hypothesis, we analyzed a large set of cis 71 Figures 7 S7 Figure S7 72 , 73 Given its high predictive power, we wondered whether the CNN model could assist in interpreting sequence variants previously linked to gene expression variation as expression quantitative trait loci (eQTLs) 74 Figure 7 75 76 Figure 7 Figure 7 Taken together, the identified chromatin- and sequence-dependent motif syntax is transferrable to other contexts, providing predictive power and deepening our understanding of how TFs that recognize such short and abundant motifs achieve specific regulatory outcomes and drive cellular differentiation. Discussion Our findings illustrate how distinct DNA sequence syntax, chromatin accessibility, and interaction partners underlie both shared and TF-specific binding of two distinct lineage-driving TFs, NGN2, and MyoD1, despite their preference for seemingly similar low-complexity motifs. Building on previous studies that linked TF binding with chromatin features, 77 , 78 de novo 79 , 80 in vitro in vivo Consistent with prior observations and similar to most eukaryotic TFs, both NGN2 and MyoD1 preferentially bind regions of open chromatin but still depend on the presence of E-box motifs. Many such sites are shared between both TFs, reflecting their opportunistic binding to open chromatin, which is determined by a cell-type-specific accessibility landscape. Notably, many motifs residing in open chromatin remain unbound, yet binding can still be accurately predicted by the model, likely reflecting local nucleosome positioning. 47 in vivo in vitro 43 81 73 , 82 In contrast to this opportunistic and chromatin-sensitive binding, NGN2 and MyoD1 can bind and open initially inaccessible regions at specific sites, acting as “pioneer factors.” These rare events are confined to complex and similarly rare composite motifs enriched for TF-specific variants, helping reconcile conflicting reports on their chromatin sensitivity. 83 84 85 86 , 87 88 These findings identify and can potentially account for a broad spectrum of chromatin sensitivity of individual TFs, spanning opportunistic binding at low-complexity motifs and deterministic binding at rare composite motifs that shape lineage-driving programs. Despite this complexity, we define a roadmap for decoding and experimentally testing primary TF-binding behavior and regulatory impact supported by predictive models. 89 , 90 , 91 92 , 93 94 , 95 , 96 Limitations of the study While the inducible expression system in mESCs is effective and controllable, it has limitations in assessing the effects of potential variability in TF levels and the influence of other interaction partners present in different cell types. Furthermore, predicting the downstream changes after primary TF action remains challenging, as it requires accurately linking activity in regulatory elements to their target genes. Resource availability Lead contact Requests for information and resources should be directed to the lead contact, Dirk Schübeler ( dirk@fmi.ch Materials availability Cell lines and plasmids created in this study are available by contacting the lead contact Data and code availability  • Datasets generated in this study were deposited at GEO: GSE272555 https://www.ncbi.nlm.nih.gov/geo/ PXD054143 https://www.ebi.ac.uk/pride/ • The CNN models used in this study are deposited to Zenodo: 15089486 ( zenodo.org • Any additional information required to reanalyze the data reported in this paper is available from the lead contact Acknowledgments We acknowledge FMI Facilities for excellent technical support, especially Sebastian Smallwood (Genomics), Hubertus Kohler (FACS), Laurent Gelman (Microscopy), and Jan Seebacher (Proteomics). We acknowledge Michael Stadler for guidance on data analysis; Ralph Grand for discussions; and Luca Giorgetti, Lisa Baumgartner, Ana Petracovici, and Francesca Masoni for their feedback. This study was supported by the Novartis Research Foundation Swiss National Science Foundation 310030B_176394 EU Horizon 2020 ERC Advanced Grant 884664 EMBO Fellowship ALTF1101 NHMRC Fellowship APP1148380 MSCA Fellowship 748760 Christiane Nüsslein-Volhard stipend SAiGENCI Australian Government Sylvia and Charles Viertel Senior Medical Research Fellowship Author contributions S.D. and D.S. designed the study and wrote the manuscript with input from the co-authors. S.D. performed the experiments. S.D. and M.I. analyzed the data with input from L.B. M.I. established the deep learning tools and performed the predictions with input from S.D. L.I. established the DAP-seq protocol with input from S.D. L.H. assisted with cloning and cell line generation. C.W. generated HA36Tet3G parental cell line. V.I. and D.H. performed mass spectrometry for proteome and affinity purification, respectively. Declaration of interests The authors declare no competing interests. Declaration of generative AI and AI-assisted technologies in the writing process The authors utilized ChatGPT-4 selectively to revise the grammar and phrasing of specific sentences and take full responsibility for the content. STAR★Methods Key resources table  REAGENT or RESOURCE SOURCE IDENTIFIER Antibodies Rabbit polyclonal anti-Pol2 Santa Cruz Cat#sc899x; RRID:AB_632359 Rabbit polyclonal anti-H3K27ac Active Motif Cat#39133; RRID:AB_2561016 Rabbit monoclonal anti-V5 Invitrogen Cat#MA5-32053; RRID:AB_2809347 Rabbit monoclonal anti-Nanog Abcam Cat#ab214549; RRID:AB_3668944 Chicken polyclonal anti-BetaTubulin III Sigma-Aldrich Cat#AB9354; RRID:AB_570918 anti-a-Actinin Sigma-Aldrich Cat#A7811; RRID:AB_476766 Bacterial and virus strains Rosetta (DE3) competent cells Millipore Cat#70954 Chemicals, peptides, and recombinant proteins DMEM Gibco Cat #11965092 Fetal Bovine Serum Gibco Cat #A5256701 MEM NEAA Gibco Cat #11140050 Glutamax Gibco Cat #35050061 LIF Produced in-house N/A DMEM/-F12, Glutamax Gibco Cat#31331028 B27 without vitamin A Gibco Cat#12587010 N2 supplement Gibco Cat#17502048 Doxycycline Sigma-Aldrich Cat#D989 Ganciclovir Sigma-Aldrich Cat#G2536 Mouse Embryonic Stem Cell Nucleofector Kit Lonza Cat#VPH-1001 Lipofectamine RNAiMAX Thermo Fisher Scientific Cat#13778 GST tagged bHLH proteins for DAP-seq This study Table S3 Tn5 Produced in-house NA Alt-R CRISPR-Cas9 IDT Cat#1081058 Critical commercial assays NEBNext Ultra II DNA Library Prep Kit NEB Cat#E7645 TruSeq Stranded Total RNA Library Prep Kit Illumina Cat#20020613 Norgen Single Cell RNA Purification Kit Norgen Biotek Cat#51800 Nextera XT DNA Library Prep Kit Illumina Cat#FC-131 TMT 16plex isobaric labelling kit Thermo Fisher Scientific Cat#44520 Deposited data ChIP-seq, ATAC-seq, RNA-seq, DAP-seq This study GEO: GSE272555 Public NGS data used in this study GEO & ENCODE Table S2 Proteomics This study PRIDE: PXD054143 Tables S6 S8 S9 S10 Experimental models: Cell lines Mouse: mESC HA36 Baubec et al. 23 Table S4 Mouse: mESC HA36CB1 Baubec et al. 23 Table S4 Mouse: mESC HA36/PB-rtTA-TRE:NGN2 Kaluscha et al. 97 Table S4 Mouse: mESC TC-1 Lienert et al. 98 Table S4 Mouse: mESC DNMT-TKO Domcke et al. 28 Table S4 Mouse: mESC HA36Tet3G This study Table S4 Mouse: mESC HA36CB1Tet3G This study Table S4 Mouse: mESC HA36CB1Tet3G/TRE:GFP This study Table S4 Mouse: mESC HA36CB1Tet3G/TRE:NGN2-T2A-GFP This study Table S4 Mouse: mESC HA36CB1Tet3G/TRE:NGN2MUT-T2A-GFP This study Table S4 Mouse: mESC HA36CB1Tet3G/TRE:NGN2BHLH-T2A-GFP This study Table S4 Mouse: mESC HA36CB1Tet3G/TRE:MyoD1-T2A-GFP This study Table S4 Mouse: mESC HA36CB1Tet3G/TRE:NGN3-T2A-GFP This study Table S4 Mouse: mESC HA36CB1Tet3G/TRE:ASCL1-T2A-GFP This study Table S4 Mouse: mESC TC-1/TCF3-V5 This study Table S4 Oligonucleotides DAP-seq qPCR, Positive control forward primer: AAGCTTTTAGTGCTCCAGGC This study N/A DAP-seq qPCR, Positive control reverse primer: AAGCCTCTCATTGTGCCACG This study N/A DAP-seq qPCR, Background control forward primer: TCACACTTGTCTTCTGGTCTCAC This study N/A DAP-seq qPCR, Background control reverse primer: CAAGGTGACCTAGAAACTTGC This study N/A E-box expression reporter, RT primer: GTCTCGTGGGCTCGGAGATGT This study N/A E-box expression reporter, amplification forward primer: GCACCCTGTGGAACGGCAAC This study N/A E-box expression reporter, amplification reverse primer: GGGCTCGGAGATGTCCTAGG This study N/A Tcf3 V5 insertion ssODN, CCGGGCCTGGG This study N/A siRNAs (Tcf3 Entrez#21423, Tcf4 Entrez#21413, Tcf12 Entrez#21406, Ebf2 Entrez#13592, Ebf3 Entrez#13593) Horizon Discovery ON-TARGETplus siRNA SMARTpool Recombinant DNA pEF1a-Tet3G plasmid Clonetech Cat#631346 TRE: GFP This study Table S3 TRE:NGN2-T2A-GFP This study Table S3 TRE:NGN2MUT-T2A-GFP This study Table S3 TRE:NGN2BHLH-T2A-GFP This study Table S3 TRE:MYOD1-T2A-GFP This study Table S3 TRE:NGN3-T2A-GFP This study Table S3 TRE:ASCL1-T2A-GFP This study Table S3 CAGS:rtTA//TRE:NGN2-T2A-GFP This study Table S3 LacO:GST-Ngn2 This study Table S3 LacO:GST-Myod1 This study Table S3 LacO:GST-Ascl1 This study Table S3 LacO:GST-tev-Tcf3e12 (bHLH) This study Table S3 LacO:GST-tev-Tcf3e47 (bHLH) This study Table S3 LacO:GST-tev-Tcf4 (bHLH) This study Table S3 LacO:GST-tev-Tcf12 (bHLH) This study Table S3 E-BOX: NANOLUC-barcode This study Tables S3 S5 Software and algorithms Rbowtie2 Langmead and Salzberg 99 https://bowtie-bio.sourceforge.net/bowtie2/ v.2.5 R R Core Team 100 https://www.R-project.org/ v4.3.3 or higher MACS2 Zhang et al. 101 https://github.com/macs3-project/MACS/wiki/Install-macs2 v.2.1.3.3 R Bioconductor Gentleman et al. 102 https://www.bioconductor.org/ v1.10.0 DiffBind Stark and Brown 103 https://bioconductor.org/packages/release/bioc/html/DiffBind.html v.3.14.0 QuasR Gaidatzis et al. 104 https://bioconductor.org/packages/release/bioc/html/QuasR.html v.1.48 ImageJ/Fiji Schindelin et al. 105 https://fiji.sc/ v2.16.0 MaxQuant Tyanova et al. 106 https://www.maxquant.org/ v1.5.3.8 Sequest / Proteome Discoverer Thermo Cat#CSW0064770 Rsubread Liao et al. 107 https://bioconductor.org/packages/release/bioc/html/Rsubread.html v2.18.0 edgeR Robinson et al. 108 https://bioconductor.org/packages/release/bioc/html/edgeR.html v4.2.0 monaLisa Machlab et al. 26 https://bioconductor.org/packages/release/bioc/html/monaLisa.html v1.15 ClusterProfiler Wu et al. 109 https://bioconductor.org/packages/release/bioc/html/clusterProfiler.html v4.12.0 ChIPseeker Yu et al. 110 https://bioconductor.org/packages/release/bioc/html/ChIPseeker.html v1.40.0 HOMER Heinz et al. 27 http://homer.ucsd.edu/ v5 AlphaFold Abramson et al. 53 https://deepmind.com/research/alphafold v3 TensorFlow Abadi et al. 111 https://www.tensorflow.org/ v2.0.0 KerasR Arnold 112 https://cran.r-project.org/package=KerasR v2.2.5.0 DeepExplainer/SHAP Shrikumar et al., 39 113 114 https://shap.readthedocs.io/en/latest/generated/shap.DeepExplainer.html V0.46 TF-MoDISco Shrikumar et al. 41 https://github.com/kundajelab/tf-modisco V0.5 UMAP McInnes et al. 115 https://bioconductor.org/packages/release/bioc/html/umap.html v0.2.10.0 IGV Thorvaldsdóttir et al. 116 https://igv.org/ v2.11.3 limma Ritchie et al. 117 https://bioconductor.org/packages/release/bioc/html/limma.html v3.60.3 STAR aligner Dobin et al. 118 https://github.com/alexdobin/STAR v2.5.2b IDR Li et al. 119 https://bioconductor.org/packages/release/bioc/html/idr.html v1.3 GenomicRanges Lawrence et al. 120 https://bioconductor.org/packages/release/bioc/html/GenomicRanges.html v1.56.1 fgsea Korotkevich et al. 121 https://bioconductor.org/packages/release/bioc/html/fgsea.html v1.30.0 caret Kuhn et al. 122 https://cran.r-project.org/package=caret v6.0 ROCR Sing et al. 123 https://cran.r-project.org/package=ROCR v1.0 EnrichedHeatmap Gu et al. 124 https://bioconductor.org/packages/release/bioc/html/EnrichedHeatmap.html v1.34.0 Other MagneGST beads Promega Cat#V8611 Dynabeads Protein A Thermo Fisher Scientific Cat#10008D Dynabeads M-280 Streptavidin Thermo Fisher Scientific Cat#11205D Experimental model and study participant details Mouse embryonic stem cells mESCs (129-C57Bl/6 or 129S6/SvEvTac strain) were cultured as described previously. 125 Table S4 Mouse C2C12 cells C2C12 (C3H strain) cell maintenance and differentiation are carried out as documented in the Cell Growth Protocol and Differentiation Treatment for the C2C12 Cell Line from Wold Mouse ENCODE, 63 Method details Recombinase-mediated cassette exchange system mESCs containing a cassette for recombinase-mediated cassette exchange (RMCE) system (detailed in a prior study by Lienert et al. 98 Single-locus inserted inducible transcription factor expression To achieve stable, regulated, and inducible transcription factor expression with an epitope tagging suitable for effective chromatin immunoprecipitation, we engineered mESC cells utilizing the tetON3G (Clontech #631346) and RAMBIO systems. mESCs (129-C57Bl/6 strain) carrying a single stable RMCE acceptor cassette 23 23 HA36CB1Tet3G mESCs were recombined with individual L1-TRE-biotag-TF-T2A-GFP plasmids (where the tetracycline responsive element (TRE) promoter drives the expression of BioTag, a transcription factor (TF), T2A in-frame cleavage peptide, and GFP), listed in Table S3 Neuronal and myocyte differentiation Previously established HA36 mESCs containing random integration of the pTRE- Ngn2 97 97 20 Figures S1 For controlled TF induced differentiation with minimal change of the culture components, HA36/birA mESCs stably expressing rtTA and single locus inserted TRE driven TFs (followed by in frame cleavage signal and GFP) were treated with mESC media (as in Casey et al. 6 Figure S1 126 Light microscopy For immunofluorescence imaging, mESCs, seeded on poly-L-lysine-coated eight-well μ-Slides (Ibidi), were fixed with 4% formaldehyde in PBS for 15 min, washed with PBS, permeabilized in PBS with 1% bovine serum albumin (BSA) and 0.1% Triton X-100 for 30 minutes, then incubated overnight with primary antibody in PBS with 1% BSA and 0.1% Tween-20. Samples were washed with PBS with 0.1% Tween-20 and incubated with secondary antibody (unless primary antibody is directly coupled with a fluorophore) in PBS with 1% BSA and 0.1% Tween-20 for 1 hour at room temperature. Nuclei were counterstained with Hoechst 33342 (1:1000 dilution, Thermo Fisher Scientific #134406) in PBS incubated for 10 minutes and then washed with PBS. Cells were imaged with a Visitron Spinning Disk W1 microscope with a ×40 objective. Images were processed with Fiji/ImageJ 127 For inspection of cellular morphology upon NGN2 induction, cells were imaged with Bio-Rad ZOE Fluorescent Cell imager utilizing cytoplasmic GFP expression of the tre:ngn2-t2a-gfp cells. Images were processed with Fiji/ImageJ. 127 128 For live-cell imaging, mESCs were seeded on poly-L-lysine-coated eight-well μ-Slides (Ibidi). mESCs were induced with doxycycline (tre:ngn2-t2a-gfp and tre:myod1-t2a-gfp cell lines in induction media for imaging the cellular differentiation and tre:gfp cell line in FCS/LIF media for imaging the mESC maintenance). Samples were imaged with a Visitron Spinning Disk W1 microscope using a 488-nm laser and 20x air objective in 12-minute intervals while being kept at 37 °C and 7% CO2 in an incubation chamber. Time-lapse images were processed with ImageJ 105 Primary antibodies for immunofluorescence: anti-Nanog (1:100, abcam # EPR20694 Secondary antibodies for immunofluorescence: Alexa Fluor 568 anti-chicken (1:500, Invitrogen #A11041), Alexa Fluor 647 anti-mouse (1:500, Invitrogen #A21235), Alexa Fluor 488 anti-rabbit (1:500, Invitrogen #A11008) Chromatin immunoprecipitation sequencing Chromatin immunoprecipitation (ChIP) was carried out as previously described 129 BioTag ChIP was carried out as previously described in Baubec et al. 23 Antibodies for pull-down of the target proteins for ChIP-seq were anti-Pol2 antibody (Santa-Cruz #sc899x), anti-H3K27ac antibody (Active Motif #39133), anti-V5 antibody (Invitrogen #MA5-32053), anti-EBF2 antibody (R&D Systems #AF7006) and in case of biotin as a bait streptavidin (Thermo Fisher #11205D). Immunoprecipitated DNA was subjected to library preparation using NEBNext Ultra II DNA Library Prep Kit for Illumina and amplified with 12 cycles. Libraries were sequenced on an Illumina HiSeq (50 cycles) or NovaSeq (paired-end, 100 cycles). ChIP–seq datasets were aligned to mouse genome mm10 assembly using Bowtie2 aligner 99 104 Peak calling on TF ChIP-seq samples was performed with MACS2 101 P 130 131 To define consensus peak sets for NGN2 and MyoD1 binding at 6 hours, MACS2 peaks across three replicates were combined using R package DiffBind 103 , 132 133 104 119 12 To generate unified regions of interest for various analysis, peaks from different samples and treatments were pooled. Peaks with more than 70% overlap were merged and resized from the center using GenomicRanges 120 104 RNA sequencing For each sample, RNA from 50,000 cells was isolated using Norgen Single Cell RNA Purification Kit following the manufacturer’s instructions. Sequencing libraries were prepared using Illumina TruSeq Stranded Total RNA Library Preparation Kit except for Figures S2 Using STAR aligner 118 134 100 , 107 102 135 108 108 P 136 108 137 138 121 To uncover enriched motif variants associated with genes that are upregulated along the NGN2-induced gene-expression trajectory, we conducted a comprehensive analysis over multiple time-points (6, 12, and 24 hours). We identified genes exhibiting progressively increasing or decreasing expression by comparing their log2 fold-changes to those of mESCs at 0 hours, ensuring each sequential time-point demonstrated an equal or higher expression level than its predecessor. We utilized the clusterProfiler 109 139 Figure S4 110 26 P Figure S4 The differential gene-expression analysis for NGN2 (6h, 12h, 24h) and MyoD1 (6h, 24h) is available in Table S7 Sequencing assay for transposase-accessible chromatin Sequencing assay for transposase-accessible chromatin (ATAC-seq) was performed as previously described. 140 ATAC-seq reads were trimmed using cutadapt 141 99 101 P 131 130 Read counts at all ATAC-seq peaks were quantified using qCount function from QuasR package with default parameters. To ensure comparability across samples, we normalized these counts using the cyclicLoess method 142 , 143 117 108 Differential affinity purification sequencing DNA affinity purification sequencing (DAP-seq) protocol was adapted from Bartlett et al. 60 28 To produce transcription factor proteins, Pgex6.1 plasmid constructs ( Table S3 To pair and isolate the proteins, supernatants were mixed according to desired dimer pairs and incubated rotating for 10 minutes at room temperature. Five dilutions of the lysate mix were generated by adding lysis buffer (1x, 0.5x,0.25x, 0.13x, 0.06x). To bind the transcription factors on beads, 10 μl of MagneGST beads (Promega) per sample were washed with lysis buffer, added to the lysate mix dilutions and incubated rotating for 1 hour at room temperature. Supernatants were removed on the magnetic racks and the beads were washed with lysis buffer. Beads bound by TFs were resuspended in 100 μl lysis buffer and transferred to 96 well plates. Lysis buffer is replaced on the magnetic rack and the beads were resuspended in 80 μl PBS. To probe transcription factors for preferentially bound DNA fragments, PBS was replaced with 10 μg fragmented genomic DNA diluted in 80 μl PBS. Samples were incubated rotating horizontally at room temperature for 1 hour. During the following steps beads were handled with minimum physical disruption (i.e. letting the beads fall naturally within the buffer during washes without pipetting directly or shaking and not letting the beads dry). Supernatant was removed on the magnetic rack and the beads were washed five times with 200 μl of PBS with 0.005% NP40 (each wash for 2 minutes and on the magnet for 1 minute). For the final wash, the samples were transferred to new tubes and washed with PBS twice. To recover bound DNA, beads were resuspended in 30 μl of elution buffer with 2 μl 10 mg/ml proteinase K and incubated at 50°C for 3 hours. Beads were removed and DNA was purified with 2X AmpureXP beads, eluted in 30 μl elution buffer. To determine the protein dilution range that gives the highest specific DNA enrichment, samples were tested with qPCR using primers corresponding to a region in the Dll1 locus that contains multiple E-box motifs and a control region devoid of E-box motifs. Sample replicates were subjected to library preparation with 12 cycles of amplification (NEBNext Ultra II DNA Library Prep Kit, Illumina). Libraries were sequenced on Illumina HiSeq (50 cycles) or NovaSeq (paired-end, 100 cycles). Pull-down of fragmented genomic DNA with magneGST beads alone (without TFs) were used as a background enrichment control. Reads were mapped to mouse mm10 assembly with QuasR 104 26 Figure 5 P Figure S5 qPCR primers Positive control forward: AAGCTTTTAGTGCTCCAGGC Positive control reverse: AAGCCTCTCATTGTGCCACG Negative control forward: TCACACTTGTCTTCTGGTCTCAC Negative control reverse: CAAGGTGACCTAGAAACTTGC Stably inserted transcription reporters Plasmid constructs that contain LoxP flanking inserts composed of E-box motifs embedded in an in-vitro-derived background sequence (background sequence is as described in Grand et al. 130 Tables S3 S5 To generate mESCs with NGN2 induction system and an open RMCE site characterized for providing neutral background, Piggybac plasmid with TetON system carrying doxycycline inducible NGN2-T2A-GFP expression (CAGS:rtTA/TRE:NGN2-T2A-GFP/NeoR) was randomly integrated to TC-1 mESCs (background 129S6/SvEvTac, carrying an RMCE selection cassette 98 97 The expression reporter constructs were stably integrated to the mESCs via RMCE. After 10 days of Ganciclovir negative selection, cells were expanded for 2 days and induced with induction media to express NGN2. Genomic DNA was extracted via cell lysis followed by AMPURE XP beads with isopropanol. RNA was extracted using Norgen Single Cell RNA purification kit. Isolated RNA was reverse transcribed using Superscript IV reverse transcriptase with a specific primer targeting the downstream sequence of the barcodes. cDNA and genomic DNA were amplified with same primer pair for 8 cycles. The resulting DNA was subjected to Nextera XT DNA Library Preparation and sequenced with MiSeq Micro v2. Reads were mapped to the construct library using QuasR, where each construct has a specific barcode sequence. RNA and genomic DNA samples were scaled to normalize to the same total number of counts. Enrichments of barcodes in the RNA samples were calculated by dividing the RNA counts with the genomic DNA counts, representing the proportion of RNA counts per cell (as described in Hartl et al. 56 Figures 4 S4 Table S5 Reverse transcription primer: GTCTCGTGGGCTCGGAGATGT Amplification forward primer: GCACCCTGTGGAACGGCAAC Amplification reverse primer: GGGCTCGGAGATGTCCTAGG E-box motifs used: GACAGATGGT (referred as GA or GAg), GACAGATGTT (GAt), GACATATGGT (TA), GACAGCTGGT (GC), GACAGGTGGT (GG), GACAGATGCT (GAc), GCCAGATGGT (cGA) Generation of Tcf3-V5 TC-1 mESCs were modified with CRISPR to insert coding sequence of V5 tag to the C terminus of endogenous TCF3 gene just before the stop codon using IDT Alt-R CRISPR-Cas9 system. Custom guide RNA (cRNA and tracrRNA) and single stranded DNA oligo (ssODNs) for homologous recombination were synthesized by IDT. cRNA (Alt-R® CRISPR-Cas9 crRNA) and tracRNA (Alt-R® CRISPR-Cas9 tracrRNA #1072533) were annealed to obtain 100μM gRNA, by mixing one to one, heating 95°C for 5 minutes and cooling to room temperature. To assemble the active Cas9 complex, 1 μl of gRNA (100 pmol) and 0.8 μl Cas9 protein (50 pmol, Alt-R S.p. Cas9 Nuclease V3 #1081058) were mixed and incubated for 15 minutes at room temperature. 2 nmol electroporation enhancer (Alt-R Cas9 Electroporation Enhancer) and 2nmol ssODN (Alt-R HDR Donor Oligo) and 17 μl Lonza P3 primary cell nucleofection buffer were added to the mix. 60,000 mESCs were resuspended in this 20 μl of the mix and nucleofected using Amaxa 4D nucleofection system with CA-120 program (as described in Dewari et al. 144 Guide RNA seed: GTCCAACGAAGAAGCTGTGA ssODN: CCGGGCCTGGGTGAGGCCCACAACCCAGCCGGGCACCTGGGTAAGCCTATCCCTAACCCTCTCCTCGGTCTCGATTCTACGTGAG G TCACAGCTTCTTCGTTGGAC ∗ Genotyping primers: Forward: AGGAGGAGAAGGTGTCTGGC Reverse: AGCTGTTCAGTGCCACCCTC Protein affinity-purification mass spectrometry Protein affinity-purification mass spectrometry (IP-MS) was performed based on Ostapcuk et al. 145 Peptides were analysed by capillary liquid chromatography tandem mass spectrometry with an EASY-nLC 1000 using the two column set-up (Thermo Fisher Scientific). The peptides were loaded with 0.1% formic acid, 2% acetonitrile in H2O onto a peptide trap (Acclaim PepMap 100, 75μmx 2cm, C18, 3μm, 100Å) at a constant pressure of 800 bar. Peptides were separated, at a flow rate of 150 nl/min with a linear gradient of 2–6% buffer B in buffer A in 3 minutes followed by an linear increase from 6 to 22% in 40 minutes, 22-28% in 9 min, 28-36% in 8min, 36-80% in 1 min and the column was finally washed for 14 min at 80% B (Buffer A: 0.1% formic acid in water, buffer B: 0.1% formic acid in acetonitrile) on a 50μm x 15cm ES801 C18, 2μm, 100Å column mounted on an EASY-Spray™ source connected to a Orbitrap Fusion (Thermo Fisher Scientific). The data were acquired using 120000 resolution for the peptide measurements in the Orbitrap and a top T (3s) method with HCD fragmentation for each precursor and fragment measurement in the ion trap according the recommendation of the manufacturer (Thermo Fisher Scientific). Thermo RAW files were processed using MaxQuant 1.5.3.8 software (Max Planck Institute of Biochemistry) with Andromeda search engine with label-free quantification (protein and peptide FDR values set to 1% and 0.1% respectively) against the Mus musculus UniProt database v.2017_04 supplemented with common contaminating proteins. The combined intensities of peptides of proteins were imported into R and normalized between samples to the same total count of proteins. Protein counts were log2 transformed and TF pull-down samples were compared with GFP pull-downs. The significance estimates were calculated using the eBayes function in the limma R package. Adjusted P Figure 5 146 , 147 P Table S8 Figure S5 Table S9 Nuclear protein mass spectrometry Proteome quantification was done as described previously in Grand et al., 130 g Peptides (50μg) from each biological replicate were labelled using TMT 16plex isobaric labelling kit (Thermo Fisher Scientific). High-pH reversed-phase chromatography was employed using an Agilent 1100 HPLC system with an autosampler, a YMC Triart C18 0.5 x 250 mm column, and a fraction collector. The peptides were separated using the binary buffer system: high-pH Buffer A (20 mM ammonium formate in water, pH 10) and high-pH Buffer B (20 mM ammonium formate pH 10 in 90% acetonitrile) at a flow rate of 12 μL/minute. Samples were acidified with TFA. Peptides, reconstituted in 2% acetonitrile, 0.1% formic acid, were on-line separated on a C18 50 cm μPAC column using a EASYnLC-1000 system (Thermo) mounted on a Digital PicoView nanospray source (New Objective), connected to an Orbitrap Fusion Lumos mass spectrometer (Thermo). Peptide elution was achieved using a linear gradient of increasing concentration of acetonitrile in 0.1% formic acid at a flow rate of 500 nl/min. For MS data acquisition in a data-dependent mode, ions for survey MS1 scans were recorded in profile mode in the Orbitrap detector at a resolution of 120,000 in the range of 400-1400 m/z. MS2 HCD spectra were recorded in the in centroid mode, starting at 100 m/z at 50,000 resolution. MS2 fragment ion spectra were searched in Proteome Discoverer 148 149 150 151 117 , 152 Table S6 Oligonucleotide affinity-purification mass spectrometry Protein detection from nuclear extracts using DNA double stranded DNA oligomers (Oligonucleotide affinity purification) was performed as described previously in Grand et al. 153 153 g Q33211 Peptides were analyzed by capillary liquid chromatography tandem mass spectrometry with an EASY-nLC 1000 using the two-column set-up (Thermo Fisher Scientific). The peptides were loaded with 0.1% formic acid, 2% acetonitrile in H2O onto a peptide trap (Acclaim PepMap 100, 75um x 2cm, C18, 3um, 100Å). Peptides were separated, at a flow rate of 500 nl/min with a linear gradient of 3–6% buffer B in buffer A in 4 minutes followed by a linear increase from 6 to 22% in 55 minutes, 22-40% in 4 min, 40-80% in 1min and the column was finally washed for 10 min at 80% B (Buffer A: 0.1% formic acid in water, buffer B: 0.1% formic acid in acetonitrile) on a C18 50 cm μPAC column (Thermo Fisher Scientific) mounted on a Digital PicoView nanospray source (New Objective), connected to an Orbitrap Fusion Lumos mass spectrometer (Thermo Fisher Scientific). The data were acquired using 120000 resolution for the peptide measurements in the Orbitrap and a top T (3s) method with HCD fragmentation for each precursor and fragment measurement in the ion trap according to the recommendation of the manufacturer (Thermo Fisher Scientific). Thermo RAW files were processed using MaxQuant software 106 8 , 154 Figure S5 Figure S5 Table S10 siRNA treatments siRNAs targeting Tcf3 (Entrez Gene 21423), Tcf4 (Entrez Gene 21413), Tcf12 (Entrez Gene 21406), Ebf2 (Entrez Gene 13592), Ebf3 (Entrez Gene 13593) as well as non-targeting control pool were purchased from Horizon Discovery in ON-TARGETplus siRNA SMARTpool format. For testing TCF3-V5 cell line with immunofluorescence, 100,000 TCF3-V5 mESCs were seeded on Ibidi 8 well slide in FCS/LIF media containing Tcf3 siRNA or control siRNA together with RNAimax reagents (300 μl media, 34 μl Opti-MEM, 1 μl Lipofectamine and 1 μl of 4μM siRNA stock) following the manufacturer’s guidelines. 24 hours later, cells were subjected to immunofluorescence staining. For testing the effect of decrease on TCF proteins during neuronal differentiation, 100,000 tre:ngn2-t2a-gfp mESCs were seeded on 24 well plates in 300μl FCS/LIF media containing same amount of siRNA as described above for Tcf3, Tcf4, Tcf12, mix of Tcf3/4/12 and non-targeting siRNA. 24 hours later, cells were induced in induction media, containing the same amount of siRNA. 48 hours later, GFP expressing cells were imaged. For testing the impact of decreasing TCF protein levels on initial NGN2 engagement upon its expression in mESCs, 4 million tre:ngn2-t2a-gfp and the control tre:ngn2mutant-t2a-gfp mESCs were seeded on 10 cm plates in 11 ml FCS/LIF media with siRNAs (40μl of 4μM siRNA, 40 μl Lipofectamine, 1360 μl Opti-MEM) for Tcf3, Tcf4, Tcf12 and non-targeting siRNA control. After 24 hours, the media was replaced with induction media. 6 hours after induction, NGN2 ChIP-seq was performed. NGN2 ChIP enrichments were quantified in NGN2 6h consensus peaks. Log2 fold-changes of siRNA treated samples over non targeting siRNA control was calculated and the peaks were divided in 3 bins based on their change in NGN2 enrichment. Differential motif enrichment analysis was performed using monaLisa 26 Figure 5 For testing the impact of decreasing TCF protein levels on initial MyoD1 engagement upon its expression in mESCs, 4 million tre:myod1-t2a-gfp were seeded on 10 cm plates in 11 ml FCS/LIF media with either non-targeting siRNA control or siRNA mix of Tcf3, Tcf4 and Tcf12. After 24 hours, the media was replaced with induction media. 6 hours after induction, MyoD1 ChIP-seq was performed. MyoD1 ChIP enrichments were quantified in MyoD1 6h consensus peaks. Log2 fold-changes of siRNA treated samples over non targeting siRNA control was calculated and the peaks were divided in bins (equal elements per bin) based on their change in MyoD1 enrichment relative to non-targeting siRNA treatment. Differential motif enrichment analysis was performed using monaLisa 26 For testing the impact of decreasing EBF protein levels on secondary NGN2 engagement at 24 hours upon its expression in mESCs, 4 million tre:ngn2-t2a-gfp were seeded on 10 cm plates in 11 ml induction media with either non-targeting siRNA control or siRNA mix of Ebf2 and Ebf3. After 24 hours, NGN2 ChIP-seq was performed. NGN2 ChIP enrichments were quantified in NGN2 24h consensus peaks. Meta-profiles of NGN2 24h ChIP enrichments were plotted contrasting EBF2/3 siRNA treatment and non-targeting siRNA treatment at 24h gained NGN2 binding sites, grouped as sites with a bound EBF motif (Ebf2 24h ChIP enrichment>1.5) and similarly enriched sites without EBF binding (Ebf2 24h ChIP enrichment<0.5). Experimental design Experiments were replicated at least twice. No strategy for randomization was used. Study was not done blinded. Downstream data analysis Motifs for TF binding HOMER known-motif analysis using JASPAR motif database 155 , 156 27 130 157 Figure 1 STAR Methods 26 P Figures S2 To define all the potential binding sites for NGN2 or MyoD1, the positions of all the cognate motifs for the corresponding TF (exact match to one of the cognate-motif 10-mers, described above) in Mus Musculus mm10 genome assembly were identified. TF ChIP-seq enrichments and DNAse-seq signal (DHS) were counted at these cognate-motif sites (±250bp from the center of the motif). Motifs that are represented more than once due to closer distance to each other (less than 250 bp to another cognate-motif) were resolved by keeping the motif that covers all other nearby motifs within this 500 bp region. This set of genomic regions are referred as cognate-motif regions as potential binding sites for NGN2 or MyoD1 in the mouse genome ( Figures 2 Figures 2 For the analysis shown in Figures 2 Figures 2 Figure S2 Identifying key chromatin features for NGN2 binding prediction To identify potential critical factors impacting the initial binding by NGN2, we sought to determine whether any other chromatin features from mESCs in addition to the chromatin accessibility are crucial for predicting NGN2 genome-wide binding. To this end, we generated a training set using NGN2 6h TF-binding peaks (MACS2) together with the same size background sequences from randomly selected 500 bp genomic tiles. Chromatin features for these genomic regions were quantified using qCount function from QuasR, including chromatin accessibility measured by DNase-seq, average DNA methylation, active histone marks (H3K4me3, H3K4me2, H3K4me1, H3K27ac, H3K36me3), and repressive histone marks (H3K9me3, H3K9me2, H3K27me3) from undifferentiated mESCs (publicly available datasets 28 , 63 , 158 , 159 , 160 Table S2 161 162 122 122 CNN training and model interpretation Training of CNN models was performed using DNA sequences and DNaseI profiles at peak sites (i.e. TF binding sites) to predict the continuous values of ChIP-seq enrichment signal (log2 IP/GFP) for TF binding. Basset 30 34 163 112 111 164 28 165 The same CNN architecture was adapted to predict i) accessibility changes as measured by ATAC-seq, ii) fold-changes in H3K27ac, and iii) fold-changes in Pol II signal intensities at multiple time-points, specifically at 6 and 24 hours after TF induction. For NGN2 and MyoD1, and for each time-point (6h and 24h) separately, we assembled a peak space that included the corresponding TF binding sites, ATAC-seq peaks and the GFP controls. Fold-changes were calculated using cyclicLoess 142 , 143 117 The models were evaluated on the held-out test set (chromosomes 17-19) using Pearson correlation and precision-recall curve metrics (area under the Precision-Recall Curve) calculated with R ROCR 123 162 122 To interpret the CNN model, 40 39 113 , 114 41 33 37 157 157 Estimation of marginal effects of E-box motif variants on TF binding strength and chromatin activation potential using in-silico mutagenesis To isolate the impact of sequence features independent of the genomic sequence context and initial chromatin accessibility, affinity distillation approach was adapted from Alexandari et al. 37 In silico In silico motif interaction analysis was conducted using the detailed methodology of Avsec et al. 33 To complement DL-based in-silico motif interaction analysis, we systematically analyzed NGN2 motif pairs in the genome to investigate the impact of inter-motif distance on binding probability. Specifically, E-box motif pairs were extracted from the mouse reference genome, focusing on NGN2-enriched 10-mers of CAGATG, CAGCTG, and CATATG. To ensure a robust analysis, pairs containing more than two motifs within a 200 bp window were excluded. The analysis targeted initially low accessible sites (log2 DNase-I signal <6.5), retaining 185,326 NGN2 motifs with neighboring motifs closer than 200 bp (center-to-center). The bound fraction of motifs (IP/GFP ChIP enrichment bound>1.5, unbound<0.5) was quantified as a function of distance between motif pairs to study how varying distances between NGN2 motif pairs influence their binding probabilities ( Figure S3 Nucleosome positions versus cognate-motifs The observations on the contribution scores in the CNN model for NGN2 binding in open-chromatin regions indicate that the shape of the accessibility signal relative to the E-box may have an informative role in predicting the binding. Thus, we probed the underlying information that could help explain the presence of unbound strong motifs in open-chromatin regions. First, NGN2 ChIP enrichments (IP/GFP) on NGN2 cognate-motif sites (±250 bp) residing in mESC DHS>9 were quantified. Sites with enrichment above 1.5 and below 0.5 were taken as bound and unbound, respectively. MNase-seq and DNase-seq data in mESCs were quantified for these two groups centered on the NGN2 motifs using qProfile function from QuasR package with 41 bp sliding windows along (±500 bp) and no additional shifting of the reads, thus corresponding to the cut sites by these enzymes. Values of each region were normalized by median-centering and averaged across all regions. The resulting average MNase and DNase-seq shapes for these two groups were visualized as line plots in Figure 3 Impact of positioned nucleosomes on NGN2 and MyoD1 was further quantified using isolated CTCF binding sites in mESCs. 51 Structure modeling with AlphaFold3 The structure model predictions were performed using AlphaFold 3 53 https://alphafoldserver.com/ Dimensionality reduction with UMAP To integrate multiple measurements of the genome made in this study allowing visualization on the same set, we generated a combined peak set across experiments including i) ChIP-seq peaks of NGN2 and MyoD1 from 6h to 24h and ii) ATAC-seq peaks collected from mESCs and upon 6h and 24h NGN2 and MyoD1 induction. Genomic regions overlapping more than 70% were merged. Within these regions TF ChIP-seq (±250 bp), ATAC-seq (±500 bp) and histone marks (±1 kbp) were counted. ATAC-seq and histone mark counts were normalized with cyclicLoess 142 , 143 117 We then carried out dimensionality reduction on these genomic regions using Uniform Manifold Approximation and Projection (UMAP) technique 115 Differential motif enrichment on changing TF binding patterns To investigate the basis of change in NGN2 and MyoD1 binding patterns through differentiation, we conducted a motif enrichment analysis contrasting bound regions. For NGN2 and MyoD1 individually, 6h and 24h ChIP-seq peaks were pooled and peaks overlapping more than 70% were merged. ChIP-seq enrichments (IP/GFP) at 6h and 24 h inductions were calculated in the merged peak-set. 6h ChIP-seq enrichment values (log2 fold-changes over GFP control) were subtracted from 24h ChIP enrichments. Subsequently, the peaks were categorized into bins based on the magnitude of change in transcription factor enrichment between these two time-points. Differential motif enrichment analysis across these bins was performed with the monaLisa package using \"otherBins\" as the background and a minimum score of 10 matching to the JASPAR motif library. To refine the motif logos for visualization, motifs that were subsequences of each other or exhibited high similarity (based on the motifSimilarity score depending on the length of the motif) were consolidated with the motif logo displaying the highest differential enrichment at either time-point ( Figures S6 Figure 6 To investigate the relation between NGN2 binding and newly opened sites at EBF motifs, position of EBF motifs (JASPAR: MA0154.1/2/3 with matching score>10) overlapping with the newly opened regions (initial DHS<7 and 24h NGN2 vs 24h GFP ATAC-seq FC>0.5) upon NGN2 24h induction were identified. Distribution of NGN2 cognate-motifs centered around the EBF motifs were visualized as density plots for the two subgroups of these newly opened EBF sites: the ones that gained new NGN2 binding (NGN2 24h enrichment>1.5 and NGN2 6h enrichment<0.5) versus the ones that are not bound by NGN2 (both NGN2 24h and 6h enrichment<0.5). For these subgroups, ATAC-seq meta-profiles of these regions centered around EBF motifs (±1kb) were generated using qProfile function in QuasR with 21 bp sliding windows ( Figures 6 MyoD1 datasets from in vitro MyoD1 binding sites (ENCODE identifier: ENCFF628LCC) derived from in vitro differentiated myocyte cells originated from mouse C2C12 cells were obtained from the ENCODE 63 , 166 , 167 https://www.encodeproject.org/ 62 168 GSM4889011 GSM4889012 Enriched activity of the predicted NGN2/MyoD1 binding sites on ENCODE cCREs across tissues ENCODE candidate cis-Regulatory Elements (cCREs, n = 343,731) combined from all cell-types 63 169 http://genome.ucsc.edu 166 Table S2 Figures 7 7 Predicting regulatory potential of GWAS variant(s) using CNN models We systematically searched for genome-wide association study (GWAS) single-nucleotide polymorphisms (SNPs) to identify candidate E-box variants with potential regulatory effects on gene-expression. A comprehensive GWAS dataset ( P 170 74 171 , 172 74 Visualization of genomic enrichment signal using IGV and ComplexHeatmap Genome-wide coverage tracks (tdf) were generated with IGVtools 116 173 116 , 173 104 124 , 174 , 175 Figure 2 110 109 139 176 , 177 138 Figure S2 For the EnrichedHeatmap visualization in Figure S6 Figure 7 Figure S7 Quantification and statistical analysis All analyses were conducted in R unless otherwise indicated. 133 178 , 179 Table S1 STAR Methods References 1 Wunderlich Z. Mirny L.A. Different gene regulation strategies revealed by analysis of binding motifs Trends Genet. 25 2009 434 440 10.1016/J.TIG.2009.08.003 19815308 PMC3697852 2 Ephrussi A. Church G.M. Tonegawa S. Gilbert W. B lineage--specific interactions of an immunoglobulin enhancer with cellular factors in vivo Science 227 1985 134 140 10.1126/SCIENCE.3917574 3917574 3 Longo A. Guanga G.P. Rose R.B. Crystal structure of E47-NeuroD1/beta2 bHLH domain-DNA complex: heterodimer selectivity and DNA recognition Biochemistry 47 2008 218 229 10.1021/BI701527R 18069799 4 de Martin X. Sodaei R. Santpere G. Mechanisms of Binding Specificity among bHLH Transcription Factors Int. J. Mol. Sci. 22 2021 9150 10.3390/ijms22179150 PMC8431614 34502060 5 Guo J. Li T. Schipper J. Nilson K.A. Fordjour F.K. Cooper J.J. Gordân R. Price D.H. Sequence specificity incompletely defines the genome-wide occupancy of Myc Genome Biol. 15 2014 482 10.1186/S13059-014-0482-3 PMC4242493 25287278 6 Casey B.H. Kollipara R.K. Pozo K. Johnson J.E. Intrinsic DNA binding properties demonstrated for lineage-specifying basic helix-loop-helix transcription factors Genome Res. 28 2018 484 496 10.1101/gr.224360.117 29500235 PMC5880239 7 Slattery M. Zhou T. Yang L. Dantas Machado A.C. Gordân R. Rohs R. Absence of a simple code: How transcription factors read the genome Trends Biochem. Sci. 39 2014 381 399 10.1016/j.tibs.2014.07.002 25129887 PMC4149858 8 Lambert S.A. Jolma A. Campitelli L.F. Das P.K. Yin Y. Albu M. Chen X. Taipale J. Hughes T.R. Weirauch M.T. The Human Transcription Factors Cell 172 2018 650 665 10.1016/j.cell.2018.01.029 29425488 9 Srivastava D. Mahony S. Sequence and chromatin determinants of transcription factor binding and the establishment of cell type-specific binding patterns Biochim. Biophys. Acta Gene Regul. Mech. 1863 2020 194443 10.1016/j.bbagrm.2019.194443 PMC7166147 31639474 10 Sönmezer C. Kleinendorst R. Imanci D. Barzaghi G. Villacorta L. Schübeler D. Benes V. Molina N. Krebs A.R. Molecular Co-occupancy Identifies Transcription Factor Binding Cooperativity In Vivo Mol. Cell 81 2021 255 267.e6 10.1016/J.MOLCEL.2020.11.015 33290745 PMC7612519 11 Swinstead E.E. Miranda T.B. Paakinaho V. Baek S. Goldstein I. Hawkins M. Karpova T.S. Ball D. Mazza D. Lavis L.D. Steroid Receptors Reprogram FoxA1 Occupancy through Dynamic Chromatin Transitions Cell 165 2016 593 605 10.1016/J.CELL.2016.02.067 27062924 PMC4842147 12 Isbel L. Iskar M. Durdu S. Weiss J. Grand R.S. Hietter-Pfeiffer E. Kozicka Z. Michael A.K. Burger L. Thomä N.H. Readout of histone methylation by Trim24 locally restricts chromatin opening by p53 Nat. Struct. Mol. Biol. 30 2023 948 957 10.1038/S41594-023-01021-8 37386214 PMC10352137 13 Hansen J.L. Cohen B.A. A quantitative metric of pioneer activity reveals that HNF4A has stronger in vivo pioneer activity than FOXA1 Genome Biol. 23 2022 221 10.1186/S13059-022-02792-X PMC9575205 36253868 14 Isbel L. Grand R.S. Schübeler D. Generating specificity in genome regulation through transcription factor sensitivity to chromatin Nat. Rev. Genet. 23 2022 728 740 10.1038/S41576-022-00512-6 35831531 15 Kumar N. Tsai Y.H. Chen L. Zhou A. Banerjee K.K. Saxena M. Huang S. Toke N.H. Xing J. Shivdasani R.A. The lineage-specific transcription factor CDX2 navigates dynamic chromatin to control distinct stages of intestine development Development 146 2019 dev172189 10.1242/DEV.172189 PMC6432663 30745430 16 Saotome M. Poduval D.B. Grimm S.A. Nagornyuk A. Gunarathna S. Shimbo T. Wade P.A. Takaku M. Genomic transcription factor binding site selection is edited by the chromatin remodeling factor CHD4 Nucleic Acids Res. 52 2024 3607 3622 10.1093/nar/gkae025 38281186 PMC11039999 17 Aydin B. Kakumanu A. Rossillo M. Moreno-Estellés M. Garipler G. Ringstad N. Flames N. Mahony S. Mazzoni E.O. Proneural factors Ascl1 and Neurog2 contribute to neuronal subtype identities by establishing distinct chromatin landscapes Nat. Neurosci. 22 2019 897 908 10.1038/S41593-019-0399-Y 31086315 PMC6556771 18 Soufi A. Donahue G. Zaret K.S. Facilitators and impediments of the pluripotency reprogramming factors’ initial engagement with the genome Cell 151 2012 994 1004 10.1016/j.cell.2012.09.045 23159369 PMC3508134 19 Lee Q.Y. Mall M. Chanda S. Zhou B. Sharma K.S. Schaukowitch K. Adrian-Segarra J.M. Grieder S.D. Kareta M.S. Wapinski O.L. Pro-neuronal activity of Myod1 due to promiscuous binding to neuronal genes Nat. Cell Biol. 22 2020 401 411 10.1038/S41556-020-0490-3 32231311 20 Thoma E.C. Wischmeyer E. Offen N. Maurus K. Sirén A.L. Schartl M. Wagner T.U. Ectopic expression of neurogenin 2 alone is sufficient to induce differentiation of embryonic stem cells into mature neurons PLoS One 7 2012 e38651 10.1371/JOURNAL.PONE.0038651 PMC3374837 22719915 21 Weintraub H. Tapscott S.J. Davis R.L. Thayer M.J. Adam M.A. Lassar A.B. Miller A.D. Activation of muscle-specific genes in pigment, nerve, fat, liver, and fibroblast cell lines by forced expression of MyoD Proc. Natl. Acad. Sci. USA 86 1989 5434 5438 10.1073/PNAS.86.14.5434 2748593 PMC297637 22 Davis R.L. Weintraub H. Lassar A.B. Expression of a single transfected cDNA converts fibroblasts to myoblasts Cell 51 1987 987 1000 10.1016/0092-8674(87)90585-X 3690668 23 Baubec T. Ivánek R. Lienert F. Schübeler D. Methylation-dependent and -independent genomic targeting principles of the MBD protein family Cell 153 2013 480 492 10.1016/J.CELL.2013.03.011 23582333 24 Götz M. Huttner W.B. The cell biology of neurogenesis. Nat. Rev. Mol. Cell Biol. 6 2005 777 788 10.1038/nrm1739 16314867 25 Berkes C.A. Tapscott S.J. MyoD and the transcriptional control of myogenesis Semin. Cell Dev. Biol. 16 2005 585 595 10.1016/j.semcdb.2005.07.006 16099183 26 Machlab D. Burger L. Soneson C. Rijli F.M. Schübeler D. Stadler M.B. monaLisa: an R/Bioconductor package for identifying regulatory motifs Bioinformatics 38 2022 2624 2625 10.1093/BIOINFORMATICS/BTAC102 35199152 PMC9048699 27 Heinz S. Benner C. Spann N. Bertolino E. Lin Y.C. Laslo P. Cheng J.X. Murre C. Singh H. Glass C.K. Simple combinations of lineage-determining transcription factors prime cis-regulatory elements required for macrophage and B cell identities Mol. Cell 38 2010 576 589 10.1016/J.MOLCEL.2010.05.004 20513432 PMC2898526 28 Domcke S. Bardet A.F. Adrian Ginno P. Hartl D. Burger L. Schübeler D. Competition between DNA methylation and transcription factors determines binding of NRF1 Nature 528 2015 575 579 10.1038/nature16462 26675734 29 Xin B. Rohs R. Relationship between histone modifications and transcription factor binding is protein family specific Genome Res. 28 2018 321 333 10.1101/GR.220079.116 29326300 PMC5848611 30 Kelley D.R. Snoek J. Rinn J.L. Basset: learning the regulatory code of the accessible genome with deep convolutional neural networks Genome Res. 26 2016 990 999 10.1101/gr.200535.115 27197224 PMC4937568 31 Greenside P. Shimko T. Fordyce P. Kundaje A. Discovering epistatic feature interactions from neural network models of regulatory DNA sequences Bioinformatics 34 2018 i629 i637 10.1093/bioinformatics/bty575 30423062 PMC6129272 32 Kim D.S. Risca V.I. Reynolds D.L. Chappell J. Rubin A.J. Jung N. Donohue L.K.H. Lopez-Pajares V. Kathiria A. Shi M. The dynamic, combinatorial cis-regulatory lexicon of epidermal differentiation Nat. Genet. 53 2021 1564 1576 10.1038/s41588-021-00947-3 34650237 PMC8763320 33 Avsec Ž. Weilert M. Shrikumar A. Krueger S. Alexandari A. Dalal K. Fropf R. McAnany C. Gagneur J. Kundaje A. Base-resolution models of transcription-factor binding reveal soft motif syntax Nat. Genet. 53 2021 354 366 10.1038/s41588-021-00782-6 33603233 PMC8812996 34 de Almeida B.P. Reiter F. Pagani M. Stark A. DeepSTARR predicts enhancer activity from DNA sequence and enables the de novo design of synthetic enhancers Nat. Genet. 54 2022 613 624 10.1038/s41588-022-01048-5 35551305 35 Reiter F. de Almeida B.P. Stark A. Enhancers display constrained sequence flexibility and context-specific modulation of motif function Genome Res. 33 2023 346 358 10.1101/gr.277246.122 36941077 PMC10078294 36 Taskiran I.I. Spanier K.I. Dickmänken H. Kempynck N. Pančíková A. Ekşi E.C. Hulselmans G. Ismail J.N. Theunis K. Vandepoel R. Cell-type-directed design of synthetic enhancers Nature 626 2024 212 220 10.1038/s41586-023-06936-2 38086419 PMC10830415 37 Alexandari A.M. Horton C.A. Shrikumar A. Shah N. Li E. Weilert M. Pufall M.A. Zeitlinger J. Fordyce P.M. Kundaje A. De novo in vivo Preprint at bioRxiv 2023 10.1101/2023.05.11.540401 38 Dalal K. McAnany C. Weilert M. McKinney M.C. Krueger S. Zeitlinger J. Interpreting regulatory mechanisms of Hippo signaling through a deep learning sequence model Cell Genomics 5 2025 100821 10.1016/j.xgen.2025.100821 PMC12008814 40174587 39 Shrikumar A. Greenside P. Kundaje A. Learning Important Features Through Propagating Activation Differences Proceedings of the 34th International Conference on Machine Learning 70 2017 3145 3153 https://proceedings.mlr.press/v70/shrikumar17a.html 40 Novakovsky G. Dexter N. Libbrecht M.W. Wasserman W.W. Mostafavi S. Obtaining genetics insights from deep learning via explainable artificial intelligence Nat. Rev. Genet. 24 2023 125 137 10.1038/S41576-022-00532-2 36192604 41 Shrikumar A. Tian K. Avsec Ž. Shcherbina A. Banerjee A. Sharmin M. Nair S. Kundaje A. Technical Note on Transcription Factor Motif Discovery from Importance Scores (TF-MoDISco) version 0.5.6.5 Preprint at bioRxiv 2018 10.48550/arXiv.1811.00416 42 Fong A.P. Yao Z. Zhong J.W. Johnson N.M. Farr G.H. Maves L. Tapscott S.J. Conversion of MyoD to a neurogenic factor: binding site specificity determines lineage Cell Rep. 10 2015 1937 1946 10.1016/J.CELREP.2015.02.055 25801030 PMC4683018 43 Michael A.K. Stoos L. Crosby P. Eggers N. Nie X.Y. Makasheva K. Minnich M. Healy K.L. Weiss J. Kempf G. Cooperation between bHLH transcription factors and histones for DNA access Nature 619 2023 385 393 10.1038/s41586-023-06282-3 37407816 PMC10338342 44 Barisic D. Stadler M.B. Iurlaro M. Schübeler D. Mammalian ISWI and SWI/SNF selectively mediate binding of distinct transcription factors Nature 569 2019 136 140 10.1038/S41586-019-1115-5 30996347 PMC6522387 45 Kornberg R.D. Stryer L. Statistical distributions of nucleosomes: nonrandom locations by a stochastic mechanism Nucleic Acids Res. 16 1988 6677 6690 10.1093/NAR/16.14.6677 3399412 PMC338322 46 D’Oliveira Albanus R. Kyono Y. Hensley J. Varshney A. Orchard P. Kitzman J.O. Parker S.C.J. Chromatin information content landscapes inform transcription factor and DNA interactions Nat. Commun. 12 2021 1307 10.1038/S41467-021-21534-4 PMC7910283 33637709 47 Zhong J. Luo K. Winter P.S. Crawford G.E. Iversen E.S. Hartemink A.J. Mapping nucleosome positions using DNase-seq Genome Res. 26 2016 351 364 10.1101/GR.195602.115 26772197 PMC4772017 48 Fu Y. Sinha M. Peterson C.L. Weng Z. The insulator binding protein CTCF positions 20 nucleosomes around its binding sites across the human genome PLoS Genet. 4 2008 e1000138 10.1371/journal.pgen.1000138 PMC2453330 18654629 49 Stergachis A.B. Debo B.M. Haugen E. Churchman L.S. Stamatoyannopoulos J.A. Single-molecule regulatory architectures captured by chromatin fiber sequencing Science 368 2020 1449 1454 10.1126/science.aaz1646 32587015 50 Grand R.S. Pregnolato M. Baumgartner L. Hoerner L. Burger L. Schübeler D. Genome access is transcription factor-specific and defined by nucleosome position Mol. Cell 84 2024 3455 3468.e6 10.1016/j.molcel.2024.08.009 39208807 PMC11420395 51 Iurlaro M. Masoni F. Flyamer I.M. Wirbelauer C. Iskar M. Burger L. Giorgetti L. Schübeler D. Systematic assessment of ISWI subunits shows that NURF creates local accessibility for CTCF Nat. Genet. 56 2024 1203 1212 10.1038/s41588-024-01767-x 38816647 PMC11176080 52 Mirny L.A. Nucleosome-mediated cooperativity between transcription factors Proc. Natl. Acad. Sci. USA 107 2010 22534 22539 10.1073/pnas.0913805107 21149679 PMC3012490 53 Abramson J. Adler J. Dunger J. Evans R. Green T. Pritzel A. Ronneberger O. Willmore L. Ballard A.J. Bambrick J. Accurate structure prediction of biomolecular interactions with AlphaFold 3 Nature 630 2024 493 500 10.1038/S41586-024-07487-W 38718835 PMC11168924 54 Yu X. Lin J. Masuda T. Esumi N. Zack D.J. Qian J. Genome-wide prediction and characterization of interactions between transcription factors in Saccharomyces cerevisiae Nucleic Acids Res. 34 2006 917 927 10.1093/nar/gkj487 16464824 PMC1361616 55 Calo E. Wysocka J. Modification of enhancer chromatin: what, how, and why? Mol. Cell 49 2013 825 837 10.1016/J.MOLCEL.2013.01.038 23473601 PMC3857148 56 Hartl D. Krebs A.R. Grand R.S. Baubec T. Isbel L. Wirbelauer C. Burger L. Schübeler D. CG dinucleotides enhance promoter activity independent of DNA methylation Genome Res. 29 2019 554 563 10.1101/GR.241653.118 30709850 PMC6442381 57 Pan Y. van der Watt P.J. Kay S.A. E-box binding transcription factors in cancer Front. Oncol. 13 2023 1223208 10.3389/FONC.2023.1223208 PMC10437117 37601651 58 Rauluseviciute I. Riudavets-Puig R. Blanc-Mathieu R. Castro-Mondragon J.A. Ferenc K. Kumar V. Lemma R.B. Lucas J. Chèneby J. Baranasic D. JASPAR 2024: 20th anniversary of the open-access database of transcription factor binding profiles Nucleic Acids Res. 52 2024 D174 D182 10.1093/NAR/GKAD1059 37962376 PMC10767809 59 Jones S. An overview of the basic helix-loop-helix proteins Genome Biol. 5 2004 226 10.1186/GB-2004-5-6-226 PMC463060 15186484 60 Bartlett A. O’Malley R.C. Huang S.C. Galli M. Nery J.R. Gallavotti A. Ecker J.R. Mapping genome-wide transcription-factor binding sites using DAP-seq Nat. Protoc. 12 2017 1659 1672 10.1038/NPROT.2017.055 28726847 PMC5576341 61 Asp P. Blum R. Vethantham V. Parisi F. Micsinai M. Cheng J. Bowman C. Kluger Y. Dynlacht B.D. Genome-wide remodeling of the epigenetic landscape during myogenic differentiation Proc. Natl. Acad. Sci. USA 108 2011 E149 E158 10.1073/pnas.1102223108 21551099 PMC3107312 62 Esteves de Lima J. Bou Akar R. Machado L. Li Y. Drayton-Libotte B. Dilworth F.J. Relaix F. HIRA stabilizes skeletal muscle lineage identity Nat. Commun. 12 2021 3450 10.1038/S41467-021-23775-9 34103504 PMC8187366 63 De Souza N. The ENCODE project Nat. Methods 9 2012 1046 10.1038/nmeth.2238 23281567 64 Woods L.M. Ali F.R. Gomez R. Chernukhin I. Marcos D. Parkinson L.M. Tayoun A.N.A. Carroll J.S. Philpott A. Elevated ASCL1 activity creates de novo regulatory elements associated with neuronal differentiation BMC Genomics 23 2022 255 10.1186/s12864-022-08495-8 PMC8977041 35366798 65 Hammal F. De Langen P. Bergon A. Lopez F. Ballester B. ReMap 2022: A database of Human, Mouse, Drosophila and Arabidopsis regulatory regions from an integrative analysis of DNA-binding sequencing experiments Nucleic Acids Res. 50 2022 D316 D325 10.1093/nar/gkab996 34751401 PMC8728178 66 Koche R.P. Smith Z.D. Adli M. Gu H. Ku M. Gnirke A. Bernstein B.E. Meissner A. Reprogramming factor expression initiates widespread targeted chromatin remodeling Cell Stem Cell 8 2011 96 105 10.1016/j.stem.2010.12.001 21211784 PMC3220622 67 Păun O. Tan Y.X. Patel H. Strohbuecker S. Ghanate A. Cobolli-Gigli C. Llorian Sopena M.L. Gerontogianni L. Goldstone R. Ang S.L. Pioneer factor ASCL1 cooperates with the mSWI/SNF complex at distal regulatory elements to regulate human neural differentiation Genes Dev. 37 2023 218 242 10.1101/gad.350269.122 36931659 PMC10111863 68 Soufi A. Garcia M.F. Jaroszewicz A. Osman N. Pellegrini M. Zaret K.S. Pioneer transcription factors target partial DNA motifs on nucleosomes to initiate reprogramming Cell 161 2015 555 568 10.1016/j.cell.2015.03.017 25892221 PMC4409934 69 Gradwohl G. Dierich A. LeMeur M. Guillemot F. neurogenin3 is required for the development of the four endocrine cell lineages of the pancreas Proc. Natl. Acad. Sci. USA 97 2000 1607 1611 10.1073/pnas.97.4.1607 10677506 PMC26482 70 Akinci E. Banga A. Tungatt K. Segal J. Eberhard D. Dutton J.R. Slack J.M.W. Reprogramming of various cell types to a beta-like state by Pdx1, Ngn3 and MafA PLoS One 8 2013 e82424 10.1371/journal.pone.0082424 PMC3843737 24312421 71 Hitz B. Kagda M. Lam B. Litton C. Small C. Sloan C. Spragins E. Tanaka F. Whaling I. Gabdank I. Data navigation on the ENCODE portal Preprint at Research Square 2023 10.21203/rs.3.rs-3088639/v1 72 Grounds M.D. Garrett K.L. Beilharz M.W. The transcription of MyoD1 and myogenin genes in thymic cells in vivo Exp. Cell Res. 198 1992 357 361 10.1016/0014-4827(92)90391-K 1309507 73 Ragazzini R. Boeing S. Zanieri L. Green M. D’Agostino G. Bartolovic K. Agua-Doce A. Greco M. Watson S.A. Batsivari A. Defining the identity and the niches of epithelial stem cells with highly pleiotropic multilineage potency in the human thymus Dev. Cell 58 2023 2428 2446.e9 10.1016/J.DEVCEL.2023.08.017 37652013 PMC10957394 74 GTEx Consortium The GTEx Consortium atlas of genetic regulatory effects across human tissues Science 369 2020 1318 1330 10.1126/SCIENCE.AAZ1776 32913098 PMC7737656 75 Lee J.J. Wedow R. Okbay A. Kong E. Maghzian O. Zacher M. Nguyen-Viet T.A. Bowers P. Sidorenko J. Karlsson Linnér R. Gene discovery and polygenic prediction from a genome-wide association study of educational attainment in 1.1 million individuals Nat. Genet. 50 2018 1112 1121 10.1038/S41588-018-0147-3 30038396 PMC6393768 76 Konířová J. Oltová J. Corlett A. Kopycińska J. Kolář M. Bartůněk P. Zíková M. Modulated DISP3/PTCHD2 expression influences neural stem cell fate decisions Sci. Rep. 7 2017 41597 10.1038/SREP41597 PMC5278513 28134287 77 Cazares T.A. Rizvi F.W. Iyer B. Chen X. Kotliar M. Bejjani A.T. Wayman J.A. Donmez O. Wronowski B. Parameswaran S. maxATAC: Genome-scale transcription-factor binding prediction from ATAC-seq with deep neural networks PLoS Comput. Biol. 19 2023 e1010863 10.1371/journal.pcbi.1010863 PMC9917285 36719906 78 Keilwagen J. Posch S. Grau J. Accurate prediction of cell type-specific transcription factor binding Genome Biol. 20 2019 9 10.1186/s13059-018-1614-y PMC6327544 30630522 79 Srivastava D. Aydin B. Mazzoni E.O. Mahony S. An interpretable bimodal neural network characterizes the sequence and preexisting chromatin predictors of induced transcription factor binding Genome Biol. 22 2021 20 10.1186/s13059-020-02218-6 PMC7788824 33413545 80 Arora S. Yang J. Akiyama T. James D.Q. Morrissey A. Blanda T.R. Badjatia N. Lai W.K.M. Ko M.S.H. Pugh B.F. Joint sequence & chromatin neural networks characterize the differential abilities of Forkhead transcription factors to engage inaccessible chromatin Preprint at bioRxiv 2023 10.1101/2023.10.06.561228 81 Velasco S. Ibrahim M.M. Kakumanu A. Garipler G. Aydin B. Al-Sayegh M.A. Hirsekorn A. Abdul-Rahman F. Satija R. Ohler U. A Multi-step Transcriptional and Chromatin State Cascade Underlies Motor Neuron Programming from Embryonic Stem Cells Cell Stem Cell 20 2017 205 217.e8 10.1016/j.stem.2016.11.006 27939218 PMC5291817 82 Arntfield M.E. van der Kooy D. β-Cell evolution: How the pancreas borrowed from the brain: The shared toolbox of genes expressed by neural and pancreatic endocrine cells may reflect their evolutionary relationship Bioessays 33 2011 582 587 10.1002/BIES.201100015 21681773 83 Stoeber S. Godin H. Xu C. Bai L. Pioneer factors: nature or nurture? Crit. Rev. Biochem. Mol. Biol. 59 2024 139 153 10.1080/10409238.2024.2355885 38778580 PMC11444900 84 Pataskar A. Jung J. Smialowski P. Noack F. Calegari F. Straub T. Tiwari V.K. NeuroD1 reprograms chromatin and transcription factor landscapes to induce the neuronal program EMBO J. 35 2016 24 45 10.15252/embj.201591206 26516211 PMC4718003 85 Birkhoff J.C. Korporaal A.L. Brouwer R.W.W. Nowosad K. Milazzo C. Mouratidou L. van den Hout M.C.G.N. van IJcken W.F.J. Huylebroeck D. Conidi A. Zeb2 DNA-Binding Sites in Neuroprogenitor Cells Reveal Autoregulation and Affirm Neurodevelopmental Defects, Including in Mowat-Wilson Syndrome Genes 14 2023 629 10.3390/genes14030629 PMC10048071 36980900 86 Wang R. Bhatt A.B. Minden-Birkenmaier B.A. Travis O.K. Tiwari S. Jia H. Rosikiewicz W. Martinot O. Childs E. Loesch R. ZBTB18 restricts chromatin accessibility and prevents transcriptional adaptations that drive metastasis Sci. Adv. 9 2023 eabq3951 10.1126/sciadv.abq3951 PMC9821869 36608120 87 Lu C. Garipler G. Dai C. Roush T. Salome-Correa J. Martin A. Liscovitch-Brauer N. Mazzoni E.O. Sanjana N.E. Essential transcription factors for induced neuron differentiation Nat. Commun. 14 2023 8362 10.1038/s41467-023-43602-7 PMC10724217 38102126 88 Londhe P. Davie J.K. Sequential association of myogenic regulatory factors and E proteins at muscle-specific genes Skelet. Muscle 1 2011 14 10.1186/2044-5040-1-14 PMC3156637 21798092 89 Ching T. Himmelstein D.S. Beaulieu-Jones B.K. Kalinin A.A. Do B.T. Way G.P. Ferrero E. Agapow P.M. Zietz M. Hoffman M.M. Opportunities and obstacles for deep learning in biology and medicine J. R. Soc. Interface 15 2018 20170387 10.1098/rsif.2017.0387 PMC5938574 29618526 90 Eraslan G. Avsec Ž. Gagneur J. Theis F.J. Deep learning: new computational modelling techniques for genomics Nat. Rev. Genet. 20 2019 389 403 10.1038/s41576-019-0122-6 30971806 91 Xu Y. Liu X. Cao X. Huang C. Liu E. Qian S. Liu X. Wu Y. Dong F. Qiu C.-W. Artificial intelligence: A powerful paradigm for scientific research Innovation (Cambridge (Mass.)) 2 2021 100179 10.1016/j.xinn.2021.100179 PMC8633405 34877560 92 Wang H. Yang Y. Liu J. Qian L. Direct cell reprogramming: approaches, mechanisms and progress Nat. Rev. Mol. Cell Biol. 22 2021 410 424 10.1038/s41580-021-00335-z 33619373 PMC8161510 93 Bunne C. Roohani Y. Rosen Y. Gupta A. Zhang X. Roed M. Alexandrov T. AlQuraishi M. Brennan P. Burkhardt D.B. How to Build the Virtual Cell with Artificial Intelligence: Priorities and Opportunities Cell 187 2024 7045 7063 10.1016/j.cell.2024.11.015 39672099 PMC12148494 94 Avsec Ž. Agarwal V. Visentin D. Ledsam J.R. Grabska-Barwinska A. Taylor K.R. Assael Y. Jumper J. Kohli P. Kelley D.R. Effective gene expression prediction from sequence by integrating long-range interactions Nat. Methods 18 2021 1196 1203 10.1038/s41592-021-01252-x 34608324 PMC8490152 95 Barbadilla-Martínez L. Klaassen N. van Steensel B. de Ridder J. Predicting gene expression from DNA sequence using deep learning models Nat. Rev. Genet. 2025 1 15 10.1038/s41576-025-00841-2 40360798 96 Avsec Ž. Latysheva N. Cheng J. Novati G. Taylor K.R. Ward T. Bycroft C. Nicolaisen L. Arvaniti E. Pan J. AlphaGenome: advancing regulatory variant effect prediction with a unified DNA sequence model Preprint at bioRxiv 2025 10.1101/2025.06.25.661532 97 Kaluscha S. Domcke S. Wirbelauer C. Stadler M.B. Durdu S. Burger L. Schübeler D. Evidence that direct inhibition of transcription factor binding is the prevailing mode of gene and repeat repression by DNA methylation Nat. Genet. 54 2022 1895 1906 10.1038/S41588-022-01241-6 36471082 PMC9729108 98 Lienert F. Wirbelauer C. Som I. Dean A. Mohn F. Schübeler D. Identification of genetic elements that autonomously determine DNA methylation states Nat. Genet. 43 2011 1091 1097 10.1038/NG.946 21964573 99 Langmead B. Salzberg S.L. Fast gapped-read alignment with Bowtie 2 Nat. Methods 9 2012 357 359 10.1038/NMETH.1923 22388286 PMC3322381 100 Liao Y. Smyth G.K. Shi W. featureCounts: an efficient general purpose program for assigning sequence reads to genomic features Bioinformatics 30 2014 923 930 10.1093/BIOINFORMATICS/BTT656 24227677 101 Zhang Y. Liu T. Meyer C.A. Eeckhoute J. Johnson D.S. Bernstein B.E. Nusbaum C. Myers R.M. Brown M. Li W. Model-based analysis of ChIP-Seq (MACS) Genome Biol. 9 2008 R137 10.1186/GB-2008-9-9-R137 PMC2592715 18798982 102 Gentleman R.C. Carey V.J. Bates D.M. Bolstad B. Dettling M. Dudoit S. Ellis B. Gautier L. Ge Y. Gentry J. Bioconductor: open software development for computational biology and bioinformatics Genome Biol. 5 2004 R80 10.1186/GB-2004-5-10-R80 PMC545600 15461798 103 Stark R. Brown G. DiffBind: differential binding analysis of ChIP-Seq peak data R package 2011 https://bioconductor.statistik.tu-dortmund.de/packages/2.13/bioc/vignettes/DiffBind/inst/doc/DiffBind.pdf 104 Gaidatzis D. Lerch A. Hahne F. Stadler M.B. QuasR: quantification and annotation of short reads in R Bioinformatics 31 2015 1130 1132 10.1093/BIOINFORMATICS/BTU781 25417205 PMC4382904 105 Schneider C.A. Rasband W.S. Eliceiri K.W. NIH Image to ImageJ: 25 years of image analysis Nat. Methods 9 2012 671 675 10.1038/NMETH.2089 22930834 PMC5554542 106 Tyanova S. Temu T. Cox J. The MaxQuant computational platform for mass spectrometry-based shotgun proteomics Nat. Protoc. 11 2016 2301 2319 10.1038/NPROT.2016.136 27809316 107 Liao Y. Smyth G.K. Shi W. The R package Rsubread is easier, faster, cheaper and better for alignment and quantification of RNA sequencing reads Nucleic Acids Res. 47 2019 e47 10.1093/NAR/GKZ114 PMC6486549 30783653 108 Robinson M.D. McCarthy D.J. Smyth G.K. edgeR: a Bioconductor package for differential expression analysis of digital gene expression data Bioinformatics 26 2010 139 140 10.1093/BIOINFORMATICS/BTP616 19910308 PMC2796818 109 Wu T. Hu E. Xu S. Chen M. Guo P. Dai Z. Feng T. Zhou L. Tang W. Zhan L. clusterProfiler 4.0: A universal enrichment tool for interpreting omics data Innovation (Cambridge (Mass.)) 2 2021 100141 10.1016/J.XINN.2021.100141 PMC8454663 34557778 110 Yu G. Wang L.G. He Q.Y. ChIPseeker: an R/Bioconductor package for ChIP peak annotation, comparison and visualization Bioinformatics 31 2015 2382 2383 10.1093/BIOINFORMATICS/BTV145 25765347 111 Abadi M. Agarwal A. Barham P. Brevdo E. Chen Z. Citro C. Corrado G.S. Davis A. Dean J. Devin M. TensorFlow: Large-Scale Machine Learning on Heterogeneous Distributed Systems Preprint at arXiv 2016 10.48550/arXiv.1603.04467 112 Arnold T.B. kerasR: R Interface to the Keras Deep Learning Library J. Open Source Softw. 2 2017 296 10.21105/JOSS.00296 113 Lundberg S.M. Lee S.I. A Unified Approach to Interpreting Model Predictions Preprint at arXiv 2017 10.48550/arXiv.1705.07874 114 Lundberg S.M. Erion G. Chen H. DeGrave A. Prutkin J.M. Nair B. Katz R. Himmelfarb J. Bansal N. Lee S.I. From Local Explanations to Global Understanding with Explainable AI for Trees Nat. Mach. Intell. 2 2020 56 67 10.1038/S42256-019-0138-9 32607472 PMC7326367 115 McInnes L. Healy J. Melville J. UMAP: Uniform Manifold Approximation and Projection for Dimension Reduction Preprint at arXiv 2018 10.48550/arXiv.1802.03426 116 Thorvaldsdóttir H. Robinson J.T. Mesirov J.P. Integrative Genomics Viewer (IGV): high-performance genomics data visualization and exploration Brief. Bioinform. 14 2013 178 192 10.1093/BIB/BBS017 22517427 PMC3603213 117 Ritchie M.E. Phipson B. Wu D. Hu Y. Law C.W. Shi W. Smyth G.K. limma powers differential expression analyses for RNA-sequencing and microarray studies Nucleic Acids Res. 43 2015 e47 10.1093/NAR/GKV007 PMC4402510 25605792 118 Dobin A. Davis C.A. Schlesinger F. Drenkow J. Zaleski C. Jha S. Batut P. Chaisson M. Gingeras T.R. STAR: ultrafast universal RNA-seq aligner Bioinformatics 29 2013 15 21 10.1093/BIOINFORMATICS/BTS635 23104886 PMC3530905 119 Li Q. Brown J.B. Huang H. Bickel P.J. Measuring reproducibility of high-throughput experiments Ann. Appl. Stat. 5 2011 1752 1779 10.1214/11-AOAS466 120 Lawrence M. Huber W. Pagès H. Aboyoun P. Carlson M. Gentleman R. Morgan M.T. Carey V.J. Software for Computing and Annotating Genomic Ranges PLoS Comput. Biol. 9 2013 e1003118 10.1371/JOURNAL.PCBI.1003118 PMC3738458 23950696 121 Korotkevich G. Sukhov V. Budin N. Shpak B. Artyomov M.N. Sergushichev A. Fast gene set enrichment analysis Preprint at bioRxiv 2021 10.1101/060012 122 Kuhn M. Building Predictive Models in R Using the caret Package J. Stat. Softw. 28 2008 1 26 10.18637/JSS.V028.I05 123 Sing T. Sander O. Beerenwinkel N. Lengauer T. ROCR: visualizing classifier performance in R Bioinformatics 21 2005 3940 3941 10.1093/BIOINFORMATICS/BTI623 16096348 124 Gu Z. Eils R. Schlesner M. Ishaque N. EnrichedHeatmap: an R/Bioconductor package for comprehensive visualization of genomic signal associations BMC Genomics 19 2018 234 10.1186/S12864-018-4625-X PMC5885322 29618320 125 Mohn F. Weber M. Rebhan M. Roloff T.C. Richter J. Stadler M.B. Bibel M. Schübeler D. Lineage-specific polycomb targets and de novo DNA methylation define restriction and potential of neuronal progenitors Mol. Cell 30 2008 755 766 10.1016/J.MOLCEL.2008.05.007 18514006 126 Wilkinson G. Dennis D. Schuurmans C. Proneural genes in neocortical development Neuroscience 253 2013 256 273 10.1016/J.NEUROSCIENCE.2013.08.029 23999125 127 Schindelin J. Arganda-Carreras I. Frise E. Kaynig V. Longair M. Pietzsch T. Preibisch S. Rueden C. Saalfeld S. Schmid B. Fiji: an open-source platform for biological-image analysis Nat. Methods 9 2012 676 682 10.1038/NMETH.2019 22743772 PMC3855844 128 Sato Y. Nakajima S. Shiraga N. Atsumi H. Yoshida S. Koller T. Gerig G. Kikinis R. Three-dimensional multi-scale line filter for segmentation and visualization of curvilinear structures in medical images Med. Image Anal. 2 1998 143 168 10.1016/S1361-8415(98)80009-1 10646760 129 Weber M. Hellmann I. Stadler M.B. Ramos L. Pääbo S. Rebhan M. Schübeler D. Distribution, silencing potential and evolutionary impact of promoter DNA methylation in the human genome Nat. Genet. 39 2007 457 466 10.1038/ng1990 17334365 130 Grand R.S. Burger L. Gräwe C. Michael A.K. Isbel L. Hess D. Hoerner L. Iesmantavicius V. Durdu S. Pregnolato M. BANP opens chromatin and activates CpG-island-regulated genes Nature 596 2021 133 137 10.1038/S41586-021-03689-8 34234345 131 Amemiya H.M. Kundaje A. Boyle A.P. The ENCODE Blacklist: Identification of Problematic Regions of the Genome Sci. Rep. 9 2019 9354 10.1038/S41598-019-45839-Z PMC6597582 31249361 132 Ross-Innes C.S. Stark R. Teschendorff A.E. Holmes K.A. Ali H.R. Dunning M.J. Brown G.D. Gojis O. Ellis I.O. Green A.R. Differential oestrogen receptor binding is associated with clinical outcome in breast cancer Nature 481 2012 389 393 10.1038/NATURE10730 22217937 PMC3272464 133 R Core Team R: A language and environment for statistical computing R Foundation for Statistical Computing 2024 https://www.R-project.org/ 134 Li H. Handsaker B. Wysoker A. Fennell T. Ruan J. Homer N. Marth G. Abecasis G. Durbin R. 1000 Genome Project Data Processing Subgroup The Sequence Alignment/Map format and SAMtools Bioinformatics 25 2009 2078 2079 10.1093/BIOINFORMATICS/BTP352 19505943 PMC2723002 135 Frankish A. Diekhans M. Jungreis I. Lagarde J. Loveland J.E. Mudge J.M. Sisu C. Wright J.C. Armstrong J. Barnes I. GENCODE 2021 Nucleic Acids Res. 49 2021 D916 D923 10.1093/NAR/GKAA1087 33270111 PMC7778937 136 Benjamini Y. Hochberg Y. Controlling the False Discovery Rate: A Practical and Powerful Approach to Multiple Testing J. R. Stat. Soc. B 57 1995 289 300 10.1111/j.2517-6161.1995.tb02031.x 137 Subramanian A. Tamayo P. Mootha V.K. Mukherjee S. Ebert B.L. Gillette M.A. Paulovich A. Pomeroy S.L. Golub T.R. Lander E.S. Gene set enrichment analysis: a knowledge-based approach for interpreting genome-wide expression profiles Proc. Natl. Acad. Sci. USA 102 2005 15545 15550 10.1073/PNAS.0506580102 16199517 PMC1239896 138 Castanza A.S. Recla J.M. Eby D. Thorvaldsdóttir H. Bult C.J. Mesirov J.P. Extending support for mouse data in the Molecular Signatures Database (MSigDB) Nat. Methods 20 2023 1619 1620 10.1038/S41592-023-02014-7 37704782 PMC11397807 139 Aleksander S.A. Balhoff J. Carbon S. Cherry J.M. Drabkin H.J. Ebert D. Feuermann M. Gaudet P. Harris N.L. Gene Ontology Consortium The Gene Ontology knowledgebase in 2023 Genetics 224 2023 iyad031 10.1093/GENETICS/IYAD031 PMC10158837 36866529 140 Buenrostro J.D. Giresi P.G. Zaba L.C. Chang H.Y. Greenleaf W.J. Transposition of native chromatin for fast and sensitive epigenomic profiling of open chromatin, DNA-binding proteins and nucleosome position Nat. Methods 10 2013 1213 1218 10.1038/NMETH.2688 24097267 PMC3959825 141 Martin M. Cutadapt removes adapter sequences from high-throughput sequencing reads EMBnet J. 17 2011 10 12 10.14806/EJ.17.1.200 142 Ballman K.V. Grill D.E. Oberg A.L. Therneau T.M. Faster cyclic loess: normalizing RNA arrays via linear models Bioinformatics 20 2004 2778 2786 10.1093/BIOINFORMATICS/BTH327 15166021 143 Bolstad B.M. Irizarry R.A. Åstrand M. Speed T.P. A comparison of normalization methods for high density oligonucleotide array data based on variance and bias Bioinformatics 19 2003 185 193 10.1093/BIOINFORMATICS/19.2.185 12538238 144 Dewari P.S. Southgate B. McCarten K. Monogarov G. O’duibhir E. Quinn N. Tyrer A. Leitner M.C. Plumb C. Kalantzaki M. An efficient and scalable pipeline for epitope tagging in mammalian stem cells using Cas9 ribonucleoprotein Elife 7 2018 e35069 10.7554/eLife.35069 PMC5947990 29638216 145 Ostapcuk V. Mohn F. Carl S.H. Basters A. Hess D. Iesmantavicius V. Lampersberger L. Flemr M. Pandey A. Thomä N.H. Activity-dependent neuroprotective protein recruits HP1 and CHD4 to control lineage-specifying genes Nature 557 2018 739 743 10.1038/S41586-018-0153-8 29795351 146 Durinck S. Spellman P.T. Birney E. Huber W. Mapping identifiers for the integration of genomic datasets with the R/Bioconductor package biomaRt Nat. Protoc. 4 2009 1184 1191 10.1038/NPROT.2009.97 19617889 PMC3159387 147 Durinck S. Moreau Y. Kasprzyk A. Davis S. De Moor B. Brazma A. Huber W. BioMart and Bioconductor: a powerful link between biological databases and microarray data analysis Bioinformatics 21 2005 3439 3440 10.1093/BIOINFORMATICS/BTI525 16082012 148 Orsburn B.C. Proteome Discoverer-A Community Enhanced Data Processing Suite for Protein Informatics Proteomes 9 2021 15 10.3390/PROTEOMES9010015 PMC8006021 33806881 149 Eng J.K. McCormack A.L. Yates J.R. An approach to correlate tandem mass spectral data of peptides with amino acid sequences in a protein database J. Am. Soc. Mass Spectrom. 5 1994 976 989 10.1016/1044-0305(94)80016-2 24226387 150 Cox J. Mann M. MaxQuant enables high peptide identification rates, individualized p.p.b.-range mass accuracies and proteome-wide protein quantification Nat. Biotechnol. 26 2008 1367 1372 10.1038/NBT.1511 19029910 151 Soneson C. Iesmantavicius V. Hess D. Stadler M.B. Seebacher J. einprot: flexible, easy-to-use, reproducible workflows for statistical analysis of quantitative proteomics data J. Open Source Softw. 8 2023 5750 10.21105/JOSS.05750 152 Phipson B. Lee S. Majewski I.J. Alexander W.S. Smyth G.K. Robust hyperparameter estimation protects against hypervariable genes and improves power to detect differential expression Ann. Appl. Stat. 10 2016 946 963 10.1214/16-AOAS920 28367255 PMC5373812 153 Makowski M.M. Gräwe C. Foster B.M. Nguyen N.V. Bartke T. Vermeulen M. Global profiling of protein-DNA and protein-nucleosome binding affinities using quantitative mass spectrometry Nat. Commun. 9 2018 1653 10.1038/S41467-018-04084-0 PMC5916898 29695722 154 Hammelman J. Patel T. Closser M. Wichterle H. Gifford D. Ranking reprogramming factors for cell differentiation Nat. Methods 19 2022 812 822 10.1038/S41592-022-01522-2 35710610 PMC10460539 155 Sandelin A. Alkema W. Engström P. Wasserman W.W. Lenhard B. JASPAR: an open-access database for eukaryotic transcription factor binding profiles Nucleic Acids Res. 32 2004 D91 D94 10.1093/NAR/GKH012 14681366 PMC308747 156 Fornes O. Castro-Mondragon J.A. Khan A. Van Der Lee R. Zhang X. Richmond P.A. Modi B.P. Correard S. Gheorghe M. Baranašić D. JASPAR 2020: update of the open-access database of transcription factor binding profiles Nucleic Acids Res. 48 2020 D87 D92 10.1093/NAR/GKZ1001 31701148 PMC7145627 157 Wagih O. ggseqlogo: a versatile R package for drawing sequence logos Bioinformatics 33 2017 3645 3647 10.1093/BIOINFORMATICS/BTX469 29036507 158 Tippmann S.C. Ivanek R. Gaidatzis D. Schöler A. Hoerner L. Van Nimwegen E. Stadler P.F. Stadler M.B. Schübeler D. Chromatin measurements reveal contributions of synthesis and decay to steady-state mRNA levels Mol. Syst. Biol. 8 2012 593 10.1038/MSB.2012.23 PMC3421439 22806141 159 Stadler M.B. Murr R. Burger L. Ivanek R. Lienert F. Schöler A. van Nimwegen E. Wirbelauer C. Oakeley E.J. Gaidatzis D. DNA-binding factors shape the mouse methylome at distal regulatory regions Nature 480 2011 490 495 10.1038/NATURE10716 22170606 160 von Meyenn F. Iurlaro M. Habibi E. Liu N.Q. Salehzadeh-Yazdi A. Santos F. Petrini E. Milagre I. Yu M. Xie Z. Impairment of DNA Methylation Maintenance Is the Main Cause of Global Demethylation in Naive Embryonic Stem Cells Mol. Cell 62 2016 848 861 10.1016/J.MOLCEL.2016.04.025 27237052 PMC4914828 161 Wei T. Simko V. Levy M. Xie Y. Jin Y.J. Zemla J. Visualization of a Correlation Matrix R package “corrplot”. Statistician 56 2017 162 Breiman L. Random forests Mach. Learn. 45 2001 5 32 10.1023/A:1010933404324 163 Chollet, F. (2015). keras. GitHub. https://github.com/fchollet/keras 164 Kingma D.P. Ba J.L. Adam: A Method for Stochastic Optimization Preprint at arXiv 2014 10.48550/arXiv.1412.6980 165 Davis E.S. Mu W. Lee S. Dozmorov M.G. Love M.I. Phanstiel D.H. matchRanges: generating null hypothesis genomic ranges via covariate-matched sampling Bioinformatics 39 2023 btad197 10.1093/BIOINFORMATICS/BTAD197 PMC10168584 37084270 166 Sloan C.A. Chan E.T. Davidson J.M. Malladi V.S. Strattan J.S. Hitz B.C. Gabdank I. Narayanan A.K. Ho M. Lee B.T. ENCODE data at the ENCODE portal Nucleic Acids Res. 44 2016 D726 D732 10.1093/NAR/GKV1160 26527727 PMC4702836 167 Hitz B.C. Jin-Wook L. Jolanki O. Kagda M.S. Graham K. Sud P. Gabdank I. Strattan J.S. Sloan C.A. Dreszer T. The ENCODE Uniform Analysis Pipelines Preprint at bioRxiv 2023 10.1101/2023.04.04.535623 168 Clough E. Barrett T. Wilhite S.E. Ledoux P. Evangelista C. Kim I.F. Tomashevsky M. Marshall K.A. Phillippy K.H. Sherman P.M. NCBI GEO: archive for gene expression and epigenomics data sets: 23-year update Nucleic Acids Res. 52 2024 D138 D144 10.1093/NAR/GKAD965 37933855 PMC10767856 169 Karolchik D. Hinrichs A.S. Furey T.S. Roskin K.M. Sugnet C.W. Haussler D. Kent W.J. The UCSC Table Browser data retrieval tool Nucleic Acids Res. 32 2004 D493 D496 10.1093/NAR/GKH103 14681465 PMC308837 170 Sollis E. Mosaku A. Abid A. Buniello A. Cerezo M. Gil L. Groza T. Güneş O. Hall P. Hayhurst J. The NHGRI-EBI GWAS Catalog: knowledgebase and deposition resource Nucleic Acids Res. 51 2023 D977 D985 10.1093/NAR/GKAC1010 36350656 PMC9825413 171 Okbay A. Wu Y. Wang N. Jayashankar H. Bennett M. Nehzati S.M. Sidorenko J. Kweon H. Goldman G. Gjorgjieva T. Polygenic prediction of educational attainment within and between families from genome-wide association analyses in 3 million individuals Nat. Genet. 54 2022 437 449 10.1038/S41588-022-01016-Z 35361970 PMC9005349 172 Schoeler T. Speed D. Porcu E. Pirastu N. Pingault J.B. Kutalik Z. Participation bias in the UK Biobank distorts genetic associations and downstream analyses Nat. Hum. Behav. 7 2023 1216 1227 10.1038/S41562-023-01579-9 37106081 PMC10365993 173 Robinson J.T. Thorvaldsdóttir H. Winckler W. Guttman M. Lander E.S. Getz G. Mesirov J.P. Integrative genomics viewer Nat. Biotechnol. 29 2011 24 26 10.1038/NBT.1754 21221095 PMC3346182 174 Gu Z. Gu L. Eils R. Schlesner M. Brors B. circlize Implements and enhances circular visualization in R Bioinformatics 30 2014 2811 2812 10.1093/BIOINFORMATICS/BTU393 24930139 175 Gu Z. Eils R. Schlesner M. Complex heatmaps reveal patterns and correlations in multidimensional genomic data Bioinformatics 32 2016 2847 2849 10.1093/BIOINFORMATICS/BTW313 27207943 176 Liberzon A. Birger C. Thorvaldsdóttir H. Ghandi M. Mesirov J.P. Tamayo P. The Molecular Signatures Database (MSigDB) hallmark gene set collection Cell Syst. 1 2015 417 425 10.1016/J.CELS.2015.12.004 26771021 PMC4707969 177 Liberzon A. Subramanian A. Pinchback R. Thorvaldsdóttir H. Tamayo P. Mesirov J.P. Molecular signatures database (MSigDB) 3.0 Bioinformatics 27 2011 1739 1740 10.1093/BIOINFORMATICS/BTR260 21546393 PMC3106198 178 Carroll T.S. Liang Z. Salama R. Stark R. de Santiago I. Impact of artifact removal on ChIP quality metrics in ChIP-seq and ChIP-exo data Front. Genet. 5 2014 75 10.3389/fgene.2014.00075 PMC3989762 24782889 179 Okonechnikov K. Conesa A. García-Alcalde F. Qualimap 2: advanced multi-sample quality control for high-throughput sequencing data Bioinformatics 32 2016 292 294 10.1093/BIOINFORMATICS/BTV566 26428292 PMC4708105 Supplemental information  Document S1. Figures S1–S8 Table S1. QC analysis of high throughput sequencing samples of ChIP-seq, ATAC-seq, and DAP-seq, related to STAR Methods Table S2. List of public datasets used in the study, related to STAR Methods Table S3. List of plasmids and their open reading frame sequences constructed for this study, related to STAR Methods Table S4. List of mESC cell lines used in this study, related to STAR Methods Table S5. List of transcription reporter constructs, their regulatory sequences and measured expression values upon NGN2 induction, related to Figure 4 and STAR Methods Table S6. Gene list of differential nuclear protein abundance changes between mESCs, NGN2 and MyoD1 induced cells at 24 h, related to Figure 6 and STAR Methods Table S7. List of differential gene expression changes between GFP (noTF), NGN2, and MyoD1 induction at 6 and 24 h, related to Figure 1 and STAR Methods Table S8. List of NGN2 interacting proteins at 6 and 24 h detected in IP-MS, related to Figure 5 and STAR Methods Table S9. Comparison list of NGN2 and MyoD1 interacting proteins at 24 h detected in IP-MS together with their gene-expression levels up to 24-h differentiation, related to Figure 5 and STAR Methods Table S10. List of E-box interacting proteins (20 bp oligonucleotides with E-box variant sequences) upon 24-h NGN2 or MyoD1 induction, related to Figure 5 and STAR Methods Document S2. Article plus supplemental information Supplemental information can be found online at https://doi.org/10.1016/j.molcel.2025.07.005 ",
  "metadata": {
    "Title of this paper": "Qualimap 2: advanced multi-sample quality control for high-throughput sequencing data",
    "Journal it was published in:": "Molecular Cell",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488066/"
  }
}