{
  "title": "Paper_84",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12488903 PMC12488903.1 12488903 12488903 41034297 10.1038/s41598-025-15963-0 15963 1 Article Pulegone induced apoptotic and anti-proliferative potential in cervical cancer via P53, BAX and BCL2 Maqbool Tahir tahir.maqbool@imbb.uol.edu.pk 1 Hadi Faheem 2 Naz Sadia 3 Inamullah 1 Ashraf Muhammad Abdul Basit 4 Rafiq Muhammad 5 Rasool Rabia 6 Atif Muhammad 1 Altaf Awais 1 Muhammad Tahir 7 1 https://ror.org/051jrjw38 grid.440564.7 0000 0001 0415 4232 Centre of Research in Molecular Medicine, Institute of Molecular Biology and Biotechnology, The University of Lahore, 2 https://ror.org/002rc4w13 grid.412496.c 0000 0004 0636 6599 Faculty of Medicine and Allied Health Sciences, The Islamia University of Bahawalpur, 3 https://ror.org/051jrjw38 grid.440564.7 0000 0001 0415 4232 Department of Allied Health Science, The University of Lahore, 4 https://ror.org/04hbpw172 grid.415422.4 0000 0004 0607 131X Department of Physiology, Faisalabad Medical University Faisalabad, 5 https://ror.org/051jrjw38 grid.440564.7 0000 0001 0415 4232 Lahore School of Behavioral Sciences, The University of Lahore, 6 https://ror.org/051jrjw38 grid.440564.7 0000 0001 0415 4232 Department of Emerging Allied Health Technologies, The university of Lahore, 7 https://ror.org/03dkvy735 grid.260917.b 0000 0001 0728 151X Department of Anatomy and Cell Biology, New York Medical College, 1 10 2025 2025 15 478255 34217 19 7 2023 12 8 2025 01 10 2025 03 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Cervical cancer is ranked the fourth most ocervical cancerurring gynecologic malignancy and thus becomes a serious point of concern in the world of cancer. The morbidity and mortality of cervical cancer is still high despite advancements in its prevention and treatment. The anticancer effects of pulegone in conjunction with conventional chemotherapy provide a better therapeutic approach. The present study was designed to assess the implications of putative in vitro anti-proliferative effects of pulegone against cervical cancer. HeLa, VERO, CaSKi and SiHa cells were cultured in complete DMEM media. MTT assay was performed to evaluate cell viability. p53 and annexin V was evaluated through ELISA for apoptosis. Immunocytochemistry was performed to determine cell death. Total protein content was determined by using Western blotting. The cytotoxicity of HeLa cells was dramatically increased with pulegone at a dose of 10 µM with no cytotoxic effect on VERO cells at all doses. Pulegone-treated HeLa cells showed an increasing degree of Annexin V staining. After pulegone treatment, fluorescent Hoechst 33,342 staining showed that nuclei were fragmented and condensed, a typical apoptotic morphology. Immunocytochemistry of P53 showed an increased apoptosis in Pulegone-treated cells compared to control and Cisplatin. Protein expression of BAX was increased and BCL2 decreased in pulegone treated cells. The present study portrayed that pulegone has potential anti-proliferative activities against cervical cancer cell lines with no toxic effect on normal cells. Thus, pulegone can be used as a potent therapeutic option either alone or when co-administered with traditional chemotherapy in the treatment of cervical cancer. Keywords Cervical cancer Pulegone Anti-proliferative effects HeLa cells Subject terms Biotechnology Cancer Cell biology Molecular biology pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Cancer is caused by the uncontrolled proliferation of any cell in the body. There are over a hundred distinct forms of cancer, and their behavior and treatment response can vary substantially 1 2 3 4 5 6 7 8 Apoptosis, also known as programmed cell death, is a natural process that occurs in multicellular organisms to maintain tissue homeostasis by eliminating damaged, unnecessary or potentially harmful cells. It plays a vital role in normal development, tissue remodeling and removal of damaged cells. However, cancer cells often develop mechanisms to evade apoptosis, which leads to their uncontrolled growth and resistance to treatment (Diepstraten et al., 2022). Cancer cells may have genetic alterations or dysregulation of signaling pathways that interfere with the apoptotic process. Some common mechanisms by which cancer cells evade apoptosis include overexpression of anti-apoptotic proteins such as Bcl-2, Bcl-xL or Mcl-1, which prevent the activation of caspases and block the apoptotic pathway and loss of pro-apoptotic proteins such as p53, Bax or Bak, which are critical for initiating apoptosis (Choudhary et al., 2015). Medicinal plants include a wide range of biologically active chemicals from a variety of chemical families terpenes, saponinic glycosides, steroids, alkaloids, and flavonoids 9 10 11 12 13 Pulegone is a naturally ocervical cancerurring monoterpene obtained from the essential oils of a variety of plants, including Nepeta cataria Mentha piperita 14 Mentha Ziziphora taurica Mentha spicata Cyclotrichium niveum Micromeria cilicica 15 16 15 Materials and methods Culturing of HeLa and VERO cell lines CaSKi and SiHa HeLa and VERO CaSKi and SiHa cells were obtained from cell culture lab The University of Lahore, Lahore-Pakistan. Cells were cultured according to Maqbool T protocol 17 2 Treatment of hela, VERO, CaSKi and SiHa cells For treatment, 1 molar aqueous stock solution of pulegone (Sigma Aldrich CAS # 89-82-7) was prepared by dissolving 0.15233 g of pulegone (Molecular weight 152.33 g/mol) in 1 ml sterile water, further dilutions were prepared in DMEM. On the basis of treatment, cell cultures were divided into five groups in the case of MTT of HeLa and VERO, 1st untreated group (negative control, cells with DMEM) 2nd, 3rd, 4th treated group (0.1, 1 and 10 µM doses respectively) and 5th positive control (with cisplatin10 µM dose). While count & viability, apoptosis and western blotting treatment cell cultures were divided into three groups for HeLa cells i.e. untreated group (negative control, cells with DMEM), treatment group with maximum cytotoxicity 10 µM and positive control group (cisplatin with 10 µM dose). MTT assay MTT was performed according to Maqbool T protocol 17 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\% {\\text{ Cell viability}}\\,=\\,{\\text{Experimental }}\\left( {{\\text{OD57}}0} \\right)/{\\text{Control }}\\left( {{\\text{OD57}}0} \\right) \\times {\\text{1}}00$$\\end{document} Apoptosis via Annexin V HeLa cells were cultured in 6 well plates and treated. Apoptosis was performed according to kit manual briefly after 48 h of treatment, cells were centrifuged at 2000 rpm for 5 min supernatant discarded, pellet dissolved in annexin V & Dead Cell kit for 30 min (Cat Number: MCH100105) Hoechst 33,342 staining Cells were exposed to pulegone (10 µM) for 48 h and cells without treatment served as control. After treatment cells were fixed with 4% paraformaldehyde for 15 min and 0.1% Triton X-100 used to permibilize for 5 min, then stained with 10 µl Hoechst33342 for 15 min 18 Immunostaining Immunocytochemistry was performed according to technique followed by Maqbool T 17 Western blotting Western blot was performed according to Akhtar S 19 6 Statistics All the experiments were performed in triplicate. GraphPad Prism, Version 5.01 (GraphPad Software, San Diego, California, USA) URL https://www.graphpad.com/scientific-software/prism/ ImageJ software Version 1.53t The software is freely available at: https://imagej.nih.gov/ij/ p p p Results Cytotoxicity assay MTT assay was used to assess cytotoxicity of pulegone on the growth of HeLa (cancer) and VERO (normal) cells, which is a reliable method for measuring cell cytotoxicity dependent on substrate conversion to the chromogenic product by live cells. All the cells were treated with increasing concentration of pulegone (0.1, 1 and 10 µM) for 12, 24 and 48 h, respectively. Pulegone caused inhibition of cell viability in case of HeLa cells while there was not much difference in case of VERO cells at a time in a dose-dependent manner as shown in Fig. 1  Fig. 1 Effects of Pulegone on ( A B C D P P P Apoptosis via Annexin V For the investigation of the apoptotic effect of pulegone, HeLa cells were treated with 10 µM pulegone for 48 h in contrast with positive and negative control. The proportion of apoptotic cells was quantified by Annexin V staining. As shown in Fig. 2 2  Fig. 2 Effect of Pulegone on HeLa cells (cervical cancer) via cell apoptosis. Early apoptotic cells are shown in the lower-right quadrant of the scatter plot, and live cells are in the lower-left quadrant. Pulegone and cisplatin induced apoptosis measured by the Muse Annexin V and Dead Cell assay. Where ( A B C Hoechst staining It was also assessed the effect of pulegone on HeLa cell, apoptosis by fluorescent Hoechst 33,342 staining. The nuclei of control cells were regular in morphology, but some nuclei were fragmented and condensed after pulegone treatment, which was typical apoptotic morphology (Fig. 3  Fig. 3 is showing hoechest staining where ( A B C Immunocytochemistry Immunocytochemistry was performed to assess the level of apoptosis by using p53 antibody, a principal factor in apoptosis. Figure 4  Fig. 4 Expression of P53 in Normal, Pulegone and cisplatin treated Hela cells. Where A1-A3 showing Normal cancer cells with reduced P53 level. B1-B3 Hela cells treated with Pulegone higher expression of P53. C1-C3 HeLa cells treated with cisplatin also showed higher expression of Annexin-V. Where more level of P53 in Pulegone treatment group compared with positive control and untreated group. ( Western blotting Western blotting was performed by using controlled HeLa cells and cells treated with pulegone. BAX and BCL2 were detected in blot as shown in Fig. 5  Fig. 5 Figure is showing immunoblots (A1-3) and protein fold increase (B) graphs (A = untreated B = Pulegone treated) of HeLa cells containing negative control group and Pulegone treated group where A1 showing Beta-Actin which act as house-keeping protein at 45KDA, A2 showing BAX (increased level) apoptotic protein at 26KDA while A3 showing BCL2 (decreased level) anti-apoptotic protein at 20KDA. B is showing Protein Fold increase. Discussion Pulegone is a naturally cervical cancerurring monoterpene ketone found primarily in the essential oils of various plants, including peppermint and spearmint. Studies have shown that pulegone has multiple biological activities, including antibacterial, anti-inflammatory and anticancer effects 20 21 22 23 The present study showed that pulegone was proved to be a potent anticancer agent when tested against cervical carcinoma cells. HeLa, VERO, CaSKi and SiHa cells were treated with pulegone for cytotoxicity analysis via MTT assay. It is a cytotoxicity assay in which mitochondrial enzymes convert MTT reagent into formazan in live cells, if cells are dead in wells, then reduction of formazan cervical cancerous and hence absorbance is less noted 24 25 Several apoptotic markers were used to examine the apoptotic index, however; P53 was widely used marker to estimate the cellular apoptosis in different cancer cell lines 25 26 04 27 Conclusion The present study showed that pulegone has dramatic tumor suppressive and antiapoptotic effects, and induced anti-proliferative morphological changes in cervical cancer cell lines. Thus, pulegone can be used alone or in combination with the traditional therapeutic strategies like radiotherapy and chemotherapy in the treatment of cervical cancer. This curative approach cannot only minimize the adverse effects of conventional anticancer therapy by decreasing its dosage but also reduces the economic burden on the cancer patients. As pulegone has very little harmful effects as compared to routine anticancer medications so, it can be routinely prescribed by oncologists to cervical cancer patients after proper recommendation by drug regulatory authorities. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Author contributions T.M did MTT, apoptosis assay and wrote the manuscript F.H, S.N, I.U performed Hoechest staining, M.A.B.A, M.R, R.R performed Wester Blotting, M.A, A.A, M.T helped in MTT and proof read the manuscript. Data availability All the data has been incorporated within the manuscript. Declarations Competing interests The authors declare no competing interests. References 1. De Silva DD Medicinal mushrooms in supportive cancer therapies: an approach to anti-cancer effects and putative mechanisms of action Fungal Divers. 2012 55 1 35 10.1007/s13225-012-0151-3 De Silva, D. D. et al. Medicinal mushrooms in supportive cancer therapies: an approach to anti-cancer effects and putative mechanisms of action. Fungal Divers. 55 2. Siegel RL Cancer statistics, 2023 CA Cancer J. Clin. 2023 73 1 17 48 36633525 10.3322/caac.21763 Siegel, R. L. et al. Cancer statistics, 2023. CA Cancer J. Clin. 73 36633525 10.3322/caac.21763 3. Fowler, J. R., Maani, E. V. & Jack B.W. Cervical cancer. (2017). 4. Arbyn M Estimates of incidence and mortality of cervical cancer in 2018: a worldwide analysis Lancet Glob Health 2020 8 2 e191 e203 10.1016/S2214-109X(19)30482-6 31812369 PMC7025157 Arbyn, M. et al. Estimates of incidence and mortality of cervical cancer in 2018: a worldwide analysis. Lancet Glob Health 8 31812369 10.1016/S2214-109X(19)30482-6 PMC7025157 5. Di Fiore R RB1 in cancer: different mechanisms of RB1 inactivation and alterations of pRb pathway in tumorigenesis J. Cell. Physiol. 2013 228 8 1676 1687 10.1002/jcp.24329 23359405 Di Fiore, R. et al. RB1 in cancer: different mechanisms of RB1 inactivation and alterations of pRb pathway in tumorigenesis. J. Cell. Physiol. 228 23359405 10.1002/jcp.24329 6. Fowler, J. R. et al. Cervical Cancer (Nursing), in StatPearls [Internet] 7. Wild AT Re-irradiation with stereotactic body radiation therapy as a novel treatment option for isolated local recurrence of pancreatic cancer after multimodality therapy: experience from two institutions J. Gastrointest. Oncol. 2013 4 4 343 24294505 10.3978/j.issn.2078-6891.2013.044 PMC3819776 Wild, A. T. et al. Re-irradiation with stereotactic body radiation therapy as a novel treatment option for isolated local recurrence of pancreatic cancer after multimodality therapy: experience from two institutions. J. Gastrointest. Oncol. 4 24294505 10.3978/j.issn.2078-6891.2013.044 PMC3819776 8. Wani AK Fighting carcinogenesis with plant metabolites by weakening proliferative signaling and disabling replicative immortality networks of rapidly dividing and invading cancerous cells Curr. Drug Deliv 2023 20 4 371 386 10.2174/1567201819666220414085606 35422214 Wani, A. K. et al. Fighting carcinogenesis with plant metabolites by weakening proliferative signaling and disabling replicative immortality networks of rapidly dividing and invading cancerous cells. Curr. Drug Deliv 20 35422214 10.2174/1567201819666220414085606 9. Sousa DP Pharmacological activity of (R)-(+)-pulegone, a chemical constituent of essential oils Z. Naturforsch C J. Biosci. 2011 66 7–8 353 359 10.1515/znc-2011-7-806 21950159 Sousa, D. P. et al. Pharmacological activity of (R)-(+)-pulegone, a chemical constituent of essential oils. Z. Naturforsch C J. Biosci. 66 21950159 10.1515/znc-2011-7-806 10. Dhifi W Essential oils’ chemical characterization and investigation of some biological activities: A critical review Med. (Basel) 2016 3 4 25 10.3390/medicines3040025 PMC5456241 28930135 Dhifi, W. et al. Essential oils’ chemical characterization and investigation of some biological activities: A critical review. Med. (Basel) 3 10.3390/medicines3040025 PMC5456241 28930135 11. Zhao, Y., Wu, Y. & Wang, M. Bioactive substances of plant origin. In Handbook of food chemistry 12. Shukla S Mehta A Anticancer potential of medicinal plants and their phytochemicals: a review Brazilian J. Bot. 2015 38 199 210 10.1007/s40415-015-0135-0 Shukla, S. & Mehta, A. Anticancer potential of medicinal plants and their phytochemicals: a review. Brazilian J. Bot. 38 13. Koziol A An overview of the Pharmacological properties and potential applications of natural monoterpenes Mini Rev. Med. Chem. 2014 14 14 1156 1168 10.2174/1389557514666141127145820 25429661 Koziol, A. et al. An overview of the Pharmacological properties and potential applications of natural monoterpenes. Mini Rev. Med. Chem. 14 25429661 10.2174/1389557514666141127145820 14. Dehsheikh AB Monoterpenes: essential oil components with valuable features Mini Rev. Med. Chem. 2020 20 11 958 974 10.2174/1389557520666200122144703 31969098 Dehsheikh, A. B. et al. Monoterpenes: essential oil components with valuable features. Mini Rev. Med. Chem. 20 31969098 10.2174/1389557520666200122144703 15. Razzaq, M. A. et al. Pulegone Prevents Hypertension through Activation of Muscarinic Receptors and Cyclooxygenase Pathway in L-NAME-Induced Hypertensive Rats. Cardiovasc Ther. 10.1155/2023/8166840 PMC10195173 37214130 16. Roy A Pulegone exhibits Anti-inflammatory activities through the regulation of NF-κB and Nrf-2 signaling pathways in LPS-stimulated RAW 264.7 cells Nat. Prod. Sci. 2018 24 1 28 35 10.20307/nps.2018.24.1.28 Roy, A. et al. Pulegone exhibits Anti-inflammatory activities through the regulation of NF-κB and Nrf-2 signaling pathways in LPS-stimulated RAW 264.7 cells. Nat. Prod. Sci. 24 17. Maqbool T Synergistic effect of barbadensis miller and Marsdenia Condurango extracts induces apoptosis promotes oxidative stress by limiting proliferation of cervical cancer and liver cancer cells Asian Pac. J. Cancer Prev. 2021 22 3 843 10.31557/APJCP.2021.22.3.843 33773549 PMC8286677 Maqbool, T. et al. Synergistic effect of barbadensis miller and Marsdenia Condurango extracts induces apoptosis promotes oxidative stress by limiting proliferation of cervical cancer and liver cancer cells. Asian Pac. J. Cancer Prev. 22 33773549 10.31557/APJCP.2021.22.3.843 PMC8286677 18. Darzynkiewicz, Z., Huang, X. & Zhao, H. Analysis of cellular DNA content by flow cytometry. Curr Protoc Immunol. 10.1002/cpim.36 29091264 19. Akhtar S P53-mediated in vitro Inhibition of PhIP-induced oxidative damage by myricetin bulk and nano forms in healthy lymphocytes Arch. Toxicol. 2021 95 1853 1856 10.1007/s00204-021-03010-6 33625525 PMC8113169 Akhtar, S. et al. P53-mediated in vitro Inhibition of PhIP-induced oxidative damage by myricetin bulk and nano forms in healthy lymphocytes. Arch. Toxicol. 95 33625525 10.1007/s00204-021-03010-6 PMC8113169 20. Božović M Ragno R Calamintha Nepeta (L.) Savi and its main essential oil constituent pulegone: biological activities and chemistry Molecules 2017 22 2 290 10.3390/molecules22020290 28216606 PMC6155702 Božović, M. & Ragno, R. Calamintha Nepeta (L.) Savi and its main essential oil constituent pulegone: biological activities and chemistry. Molecules 22 28216606 10.3390/molecules22020290 PMC6155702 21. Mamadalieva R Chemical composition and in vitro biological activities of essential oil from allochrusa Gypsophiloides Food Ther. Health Care 2021 3 10 15 Mamadalieva, R. et al. Chemical composition and in vitro biological activities of essential oil from allochrusa Gypsophiloides. Food Ther. Health Care 3 22. Efferth T Willmar Schwabe award 2006: antiplasmodial and antitumor activity of artemisinin-from bench to bedside Planta Med. 2007 73 04 299 309 10.1055/s-2007-967138 17354163 Efferth, T. Willmar Schwabe award 2006: antiplasmodial and antitumor activity of artemisinin-from bench to bedside. Planta Med. 73 17354163 10.1055/s-2007-967138 23. Chitturi S Farrell GC Hepatology Herbal hepatotoxicity: an expanding but poorly defined problem J. Gastroenterol. Hepatol. 2000 15 10 1093 1099 10.1046/j.1440-1746.2000.02349.x 11106086 Chitturi, S., Farrell, G. C. & Hepatology Herbal hepatotoxicity: an expanding but poorly defined problem. J. Gastroenterol. Hepatol. 15 11106086 10.1046/j.1440-1746.2000.02349.x 24. Seidl K Zinkernagel AS The MTT assay is a rapid and reliable quantitative method to assess Staphylococcus aureus induced endothelial cell damage J. Microbiol. Methods 2013 92 3 307 309 10.1016/j.mimet.2012.12.018 23275136 Seidl, K. & Zinkernagel, A. S. The MTT assay is a rapid and reliable quantitative method to assess Staphylococcus aureus induced endothelial cell damage. J. Microbiol. Methods 92 23275136 10.1016/j.mimet.2012.12.018 25. Van Tonder A Joubert AM Cromarty AD Limitations of the 3-(4, 5-dimethylthiazol-2-yl)-2, 5-diphenyl-2H-tetrazolium bromide (MTT) assay when compared to three commonly used cell enumeration assays BMC Res. Notes 2015 8 1 10 25884200 10.1186/s13104-015-1000-8 PMC4349615 Van Tonder, A., Joubert, A. M. & Cromarty, A. D. Limitations of the 3-(4, 5-dimethylthiazol-2-yl)-2, 5-diphenyl-2H-tetrazolium bromide (MTT) assay when compared to three commonly used cell enumeration assays. BMC Res. Notes 8 25884200 10.1186/s13104-015-1000-8 PMC4349615 26. Ovadje P Evaluation of the efficacy & biochemical mechanism of cell death induction by Piper longum extract selectively in in-vitro and in-vivo models of human cancer cells PLoS One 2014 9 11 e113250 10.1371/journal.pone.0113250 25401766 PMC4234676 Ovadje, P. et al. Evaluation of the efficacy & biochemical mechanism of cell death induction by Piper longum extract selectively in in-vitro and in-vivo models of human cancer cells. PLoS One 9 25401766 10.1371/journal.pone.0113250 PMC4234676 27. Kandakatla N Ramakrishnan G Molecular Docking studies of designed benzamide derivatives as histone deacetylase2 inhibitors Int. J. Pharm. Pharm. Sci. 2014 6 324 328 Kandakatla, N. & Ramakrishnan, G. Molecular Docking studies of designed benzamide derivatives as histone deacetylase2 inhibitors. Int. J. Pharm. Pharm. Sci. 6 ",
  "metadata": {
    "Title of this paper": "Molecular Docking studies of designed benzamide derivatives as histone deacetylase2 inhibitors",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488903/"
  }
}