{
  "title": "Paper_618",
  "abstract": "Nan Fang Yi Ke Da Xue Xue Bao Nan Fang Yi Ke Da Xue Xue Bao 3701 jsouthmed nfykdxxb Journal of Southern Medical University 1673-4254 2663-0842 Editorial Department of Journal of Southern Medical University PMC12479279 PMC12479279.1 12479279 12479279 41022604 10.12122/j.issn.1673-4254.2025.09.14 1673-4254(2025)09-1946-13 1 Research Article 肉桂酸通过抑制TLR4减轻阿霉素诱导的小鼠心肌损伤铁死亡的发生 Cinnamic acid ameliorates doxorubicin-induced myocardial injury in mice by attenuating cardiomyocyte ferroptosis via 云 琦 YUN Qi 1 2 杜 若丽 DU Ruoli 3 4 贺 玉莹 HE Yuying 1 2 张 贻欣 ZHANG Yixin 5 王 佳慧 WANG Jiahui 3 4 叶 红伟 YE Hongwei 3 4 李 正红 LI Zhenghong 1 2 高 琴 GAO Qin 3 4  1 蚌埠医科大学，生命科学学院 安徽 蚌埠 233030  1 School of Life Sciences, Bengbu Medical University Bengbu 233030 China  2 蚌埠医科大学，安徽省神经再生技术与医用新材料工程研究中心 安徽 蚌埠 233030  2 Anhui Engineering Research Center for Neural Regeneration Technology and Medical New Materials, Bengbu Medical University Bengbu 233030 China  3 蚌埠医科大学，心脑血管疾病基础与临床重点实验室 安徽 蚌埠 233030  3 Key Laboratory of Basic and Clinical Cardiovascular and Cerebrovascular Diseases, Bengbu Medical University Bengbu 233030 China  4 蚌埠医科大学，生理学教研室 安徽 蚌埠 233030  4 Department of Physiology, Bengbu Medical University Bengbu 233030 China  5 蚌埠医科大学，临床医学院 安徽 蚌埠 233030  5 School of Clinical Medicine, Bengbu Medical University Bengbu 233030 China 余 诗诗 高 琴 bbmcgq@126.com  云 琦 yunqiyq1009@163.com 20 9 2025 45 9 497824 1946 1958 13 2 2025 20 09 2025 01 10 2025 01 10 2025 2025 版权所有©《南方医科大学学报》编辑部2021 Copyright ©2021 Journal of Southern Medical University. All rights reserved. 目的 基于网络药理学技术结合动物实验探讨肉桂酸（CA）改善阿霉素心肌损伤（DIC）的可能机制。 方法 采用网络药理学分析得到CA改善DIC的关键靶点，并通过分子对接进行验证。6~8周龄SPF级雄性C57BL/6J小鼠被随机分为5组（6只/组）：Sham组、阿霉素（DOX）组、CA（25 mg/kg）+DOX组、CA（50 mg/kg）+DOX组、CA（100 mg/kg）+DOX和铁死亡抑制剂（Ferrostatin-1 5 mg/kg）+DOX组。超声心动图和HE染色观察心肌组织病理变化；检测小鼠血清 CK-MB、LDH、MDA、IL-6、TNF-α和心肌ROS水平。蛋白免疫印迹检测心肌组织中TLR4及铁死亡通路相关蛋白表达水平。构建慢病毒介导的基因稳定敲低TLR4的小鼠心肌HL-1细胞株，细胞分为6组：阴性对照组（NC）；DOX模型组（DOX）；铁死亡诱导剂组（Erastin）；低表达组（si-TLR4组）；DOX+si-TLR4组；Erastin+si-TLR4组。CCK8测定细胞活力；荧光探针检测细胞ROS含量变化；免疫荧光检测GPX4蛋白的表达。 结果 通过网络药理学分析获得交集靶点28个，KEGG富集分析显示，CA可能通过Toll样受体信号通路作用于DIC。动物实验显示，与Sham组相比，DOX组超声心动图和HE 染色结果显示心脏损伤，血清CK-MB、LDH、MDA、炎症因子和心肌ROS水平升高（ P P P P P P P P P 结论 CA减轻小鼠DIC，其机制可能与抑制TLR4减轻铁死亡有关。 Objective To explore the mechanism of cinnamic acid (CA) for improving doxorubicin-induced myocardial injury (DIC) in mice. Methods Network pharmacology analysis was used to obtain the key targets of CA and DIC. Male C57BL/6J mice were randomized into Sham, DOX, CA (25, 50 and 100 mg/kg)+DOX, and CA+Ferrostatin-1+DOX groups, and their myocardial function and pathology were examined by echocardiography and HE staining. Serum levels of CK-MB, LDH, MDA, IL-6, TNF‑α and myocardial ROS level were detected, and the expression levels of TLR4 and ferroptosis pathway proteins in myocardial tissue were detected by Western blotting. Cultured murine cardiomyocytes (HL-1 cells) with or without transfection with a small interfering RNA targeting TLR4 (si-TLR4) were treated with DOX or Erastin, and the cellular ROS content was measured by DCFH-DA staining; the expression level of GPX4 was detected using immunofluorescence staining. Results Network pharmacology analysis suggested that CA may improve DIC through TLR4 signaling. DOX treatment caused obvious myocardial injury in mice, which showed significantly increased serum levels of CK-MB, LDH, MDA, IL-6, TNF-α and myocardial ROS level with decreased myocardial levels of SLC7A11 and GPX4 proteins and increased levels of TLR4 and PTGS2 proteins. All these changes in the mouse models were significantly alleviated by treatment with CA, and the mice receiving CA or ferrostatin-1 treatment exhibited increased myocardial expressions of SLC7A11 and GPX4 proteins and lowered expressions of TLR4 and PTGS2 proteins. In cultured HL-1 cells, treatment with DOX and Erastin both obviously increased intracellular ROS level and decreased cellular GPX4 expression level, and these changes were strongly attenuated by TLR4 interference. Conclusion CA, as a potent herbal monomer, can effectively alleviate DIC in mice by inhibiting TLR4-mediated ferroptosis. 肉桂酸 阿霉素心肌损伤 铁死亡 TLR4 网络药理学 cinnamic acid doxorubicin-induced myocardial injury ferroptosis Toll-like receptor 4 network pharmacology 国家级创新创业训练计划项目 202410367058 蚌埠医科大学研究生科研创新项目 Byycx23003 安徽省优秀科研创新团队项目 2022AH010083 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "肉桂酸通过抑制TLR4减轻阿霉素诱导的小鼠心肌损伤铁死亡的发生",
    "Journal it was published in:": "Journal of Southern Medical University",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479279/"
  }
}