{
  "title": "Paper_919",
  "abstract": "pmc Toxics Toxics 3287 toxics toxics Toxics 2305-6304 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12474327 PMC12474327.1 12474327 12474327 41012420 10.3390/toxics13090799 toxics-13-00799 1 Review A Review of Quantitative Structure–Activity Relationship (QSAR) Models to Predict Thyroid Hormone System Disruption by Chemical Substances https://orcid.org/0009-0001-8946-026X Evangelista Marco 1 2 * https://orcid.org/0000-0002-0041-556X Papa Ester 1 Devillers James Academic Editor 1 2 * mevangelista@uninsubria.it 19 9 2025 9 2025 13 9 497672 799 24 8 2025 15 9 2025 17 9 2025 19 09 2025 28 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Thyroid hormone (TH) system disruption by chemicals poses a significant concern due to the key role the TH system plays in essential body functions, including the metabolism, growth, and brain development. Animal-based testing methods are resource-demanding and raise ethical issues. Thus, there is a recognised need for new approach methodologies, such as quantitative structure–activity relationship (QSAR) models, to advance chemical hazard assessments. This review, covering the scientific literature from 2010 to 2024, aimed to map the current landscape of QSAR model development for predicting TH system disruption. The focus was placed on QSARs that address molecular initiating events within the adverse outcome pathway for TH system disruption. A total of thirty papers presenting eighty-six different QSARs were selected based on predefined criteria. A discussion on the endpoints and chemical classes modelled, data sources, modelling approaches, and the molecular descriptors selected, including their mechanistic interpretations, was provided. By serving as a “state-of-the-art” of the field, existing models and gaps were identified and highlighted. This review can be used to inform future research studies aimed at advancing the assessment of TH system disruption by chemicals without relying on animal-based testing, highlighting areas that require additional research. endocrine disruption thyroid hormone system disruption new approach methodologies QSAR MIE AOP molecular descriptors mechanistic interpretation applicability domain University of Insubria This research was funded by the PhD programme in Chemical and Environmental Sciences (DiSCA) at the University of Insubria; PhD scholarship awarded to Marco Evangelista. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The endocrine system is a network of glands and organs responsible for the proper production and homeostasis of hormones that control and regulate essential physiological processes, including growth, metabolism, and reproduction [ 1 2 1 2 1 3 4 4 5 6 In mammals, three major axes characterise the endocrine system: the hypothalamic–pituitary–gonadal (HPG) axis, the hypothalamic–pituitary–adrenal (HPA) axis, and the hypothalamic–pituitary–thyroid (HPT) axis [ 2 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 22 24 25 26 27 28 29 30 31 32 23 33 In the framework of the European Green Deal [ 34 35 36 37 38 https://eurion-cluster.eu/ 39 In previous years, the criteria for the determination of ED properties has been adopted under the main EU chemical regulations, such as Regulation (EU) No 528/2012 [ 40 41 42 43 36 37 44 7 23 45 46 47 33 48 47 47 Despite the growing need and interest to advance TH system disruption assessments using in silico and QSAR approaches, a comprehensive review on this topic is currently lacking. While valuable studies have been recently published [ 49 50 49 50 50 2. Materials and Methods Criteria of Inclusion and Exclusion and Literature Collection To meet the scope of this review, the following specific inclusion and exclusion criteria were predefined to collect relevant publications. (1) Original peer-reviewed research articles published from 2010 and up to 2024, where new QSAR models for predicting the potential TH system disruption by chemical substances were proposed. Original peer-reviewed research articles not proposing a new QSAR model (e.g., experimental studies, the application of unsupervised learning methods) were excluded. (2) Modelling efforts focused on predicting MIEs within AOPs for TH system disruption; the AOP network proposed by Noyes et al. was used as a reference [ 47 51 47 33 48 Section 3.5 The literature search was conducted using the Web of Science database, according to the inclusion and exclusion criteria. To obtain a more comprehensive collection of relevant publications, the literature search was conducted using both the full names and abbreviations of key biological targets (e.g., TTR, TPO) as keywords, rather than searching for each specific MIE (e.g., TTR binding, TPO inhibition) [ 47 48 51 The selection of relevant publications from this search followed two main phases. An initial screening of titles and abstracts was conducted to assess relevance based on the inclusion and exclusion criteria. If relevance could not be determined from this step, a full-text analysis was performed. 3. Results and Discussion The final list comprised thirty publications including eighty-six distinct QSAR models. A summary is reported in Table 1 Table S1 in the Supplementary Materials 3.1. Temporal Trend Figure 1 https://www.epa.gov/comptox-tools/toxicity-forecasting-toxcast https://tox21.gov/ 3.2. Modelled MIEs The selected QSAR models were developed for eleven different MIEs for TH system disruption, which represent only a subset of the over twenty described by Noyes et al. [ 47 As illustrated in Figure 2 7 31 47 As illustrated in Figure 3 51 119 As discussed in Section 3.1 104 33 48 149 150 47 3.3. Data Sources As detailed in Table 1 Figure 4 The data source reference(s) used to develop each QSAR are reported in Table 1 121 In contrast, primary and secondary data sources were used alone for the development of forty-six (53%) QSARs. The consistent use of primary and secondary data sources from the literature throughout the entire study period underscored their sustained importance. These models covered a stricter range of MIEs, such as TR and TH distributor proteins TTR, TBG, and albumin, underscoring limited data availability or utilisation for other MIEs. Whilst the majority of these QSARs were developed using data from in vitro experiments, Kowalska et al. [ 90 52 A key aspect across the studies was data transparency. The data sources and data used for model development were consistently made available, either directly within the publications or through adequately referenced sources. This commitment to data availability aligned with the FAIR (Findable, Accessible, Interoperable, Reusable) principles for data sharing [ 151 3.4. Chemical Classes The datasets used for QSARs training and validation included either structurally heterogenous chemicals or class-specific chemicals. Structurally heterogeneous datasets were used for approximately 67% of the QSARs. These datasets primarily consisted of organic chemicals, encompassing a mix of environmental pollutants, natural compounds, and, occasionally, drugs. The sizes of such datasets varied considerably, from 41 to 8682 compounds. About 83% of these QSARs were published within the last four years, reflecting the spreading availability of HTS data, as previously described. As illustrated in Figure 5 In contrast, only a limited number of chemical classes have been tested and modelled for TH system disruption, addressing a limited number of MIEs. These datasets primarily focused on environmental pollutants of known concern, including PCBs and their hydroxylated metabolites, PBDEs and their hydroxylated metabolites, PCNs, halogenated phenols and thiophenols, phenolic DBPs, PFAS (often referred to as PFCs), and PBBs and their hydroxylated metabolites. The sizes of these datasets were generally smaller compared with the structurally heterogeneous ones, ranging from 17 to 107 compounds. Furthermore, these data were exclusively generated within the same study or retrieved from the existing literature, hence were never extracted from databases. Notably, only TR and TH distributor proteins (i.e., TTR, TBG, and albumin) were modelled using these datasets, underscoring limited data availability or the utilisation of specific class data for other thyroid-related endpoints. It is also important to highlight that almost half of these QSARs were published within the last four years. This trend suggested that, despite the increasing availability of HTS data, the reliance on data published in the literature by independent research groups remained critically important. Although certain compounds, like bisphenol derivatives, phthalates, various pesticides, and constituents of personal care products have been experimentally identified as THSDCs [ 22 25 26 152 90 52 Section 3.3 Generally, the use of heterogeneous datasets can improve a model’s AD coverage and generalizability for large screening applications. In contrast, local QSARs, which are specifically designed for specific classes of compounds, are often preferred for their ability to more accurately capture subtle structural differences and specific structure–activity relationships. This can lead to (potentially) more reliable predictions within that defined chemical space. Therefore, the choice between using global or local QSAR models depends on the specific application purposes. Furthermore, the inherent complexity of heterogeneous data can hinder the mechanistic interpretation of molecular descriptors (see Section 3.8 3.5. Modelling Approaches A wide variety of modelling algorithms are available for QSAR model development. These range from traditional methodologies, such as MLR and LDA, to more complex machine learning methodologies, such as NN and SVM [ 46 153 As illustrated in Figure 6 Over two-thirds of the QSARs selected in this review (67%) were designed for classification, a preference largely driven by the nature of HTS data. Large-scale projects like ToxCast and Tox21 generate vast datasets, where the effect on a biological target by compounds is often reported with a simple categorical outcome, i.e., “active” or “inactive”. This format has consequently led to a shift in QSAR modelling for TH system disruption, favouring classification-based approaches over regression-based ones. RF was the most frequently used algorithm, followed by MLR and kNN. Overall, RF, kNN, and MLR were used to develop a total of fifty-eight different QSARs, corresponding to approximately 67% of the total models. It is important to highlight that a single study by Dracheva et al. [ 51 The majority of studies concentrated on a single, well-defined modelling strategy, while a few explored more comprehensive approaches, systematically exploring combinations of algorithms, descriptor types, or class-balancing techniques to achieve the best possible performance. While a comprehensive comparative analysis of the predictive models’ performances would be highly valuable, it fell outside the scope of this review, as it was hindered by the following two key reasons. Firstly, the distribution of available models was highly imbalanced. While MIEs like TTR and TR have been extensively studied with multiple QSARs, others have been addressed by a few, or even no, models. Secondly, cross-study comparisons of models’ performances can be performed only when the same dataset and data processing technique are used [ 154 155 All of the models for TPO inhibition were developed using structurally heterogenous datasets of chemicals (see Table 1 Figure 5 121 107 120 Regarding TR binding, Bai et al. [ 122 91 123 113 As for TPO, all of the models for TSHR inhibition were developed using datasets of structurally heterogenous chemicals. Xu and colleagues [ 106 2 2 95 Regarding TTR binding, Zhang et al. [ 87 137 Finally, de Lomana et al. [ 119 Although the use of diverse algorithms was evident ( Figure 6 156 Establishing a clear link between the algorithm type and a specific endpoint proved challenging, as most endpoints have been assessed by a few, or even no, QSARs. Regarding TTR and TR, the two most modelled endpoints, algorithms capable of handling linear relationships (e.g., MLR) and non-linear relationships (e.g., kNN) between independent and dependent variables were both utilised, with a slight preference for the second group. An additional methodological aspect observed across the studies was the application of class-balancing strategies. This is crucial to address class imbalance, where one class (e.g., inactive compounds) is much more common than another (e.g., active compounds) in a training dataset. This imbalance is frequently found in data from databases or generated through HTS and can cause a model to become biased toward the majority class, leading to a poor performance with the minority class. This is especially critical in hazard prediction, where mistakenly predicting a dangerous compound as safe is a far more serious error than the opposite. Several effective strategies exist and were observed in the reviewed studies. Sapounidou et al. [ 113 119 106 104 120 95 3.6. Validation Strategies Validation stands as a crucial step in QSAR model development, ensuring the appropriateness of goodness-of-fit, overall robustness, and predictive ability, thereby ultimately maximising the model’s reliability [ 157 158 159 157 158 160 157 158 161 All of the QSARs reviewed in this study underwent some form of internal and/or external validation. Internal validation was performed to evaluate the robustness of seventy-two QSARs, accounting for approximately 84% of the total. The most frequent internal validation strategy was the k k k k 162 k k 137 k 163 164 165 Table S1 93 121 121 93 166 167 168 169 170 171 171 157 168 53 90 133 144 87 91 172 Table S1 The diverse array of splitting strategies reflected the fact that there is not a single and widely considered ideal partitioning scheme. Instead, the choice depends on the specific dataset type, its size, and the modelling methodology employed in the study [ 168 3.7. Applicability Domains A single QSAR model cannot accurately predict the entire chemical universe [ 173 157 158 174 175 176 157 An alarming finding was that the AD was not explicitly defined for thirty-two QSARs, accounting for approximately 37% of the total models. Among these, it is worth highlighting the studies by Bai et al. [ 122 91 122 91 119 Despite its critical importance for ensuring the reliability of predictions for new chemicals, the AD was explicitly defined for fifty-four QSARs (see Table S1 Figure 7 The leverage approach was the most frequently used method, employed in approximately 44% of the QSAR models. This method was used either as a standalone technique [ 52 53 90 112 144 145 147 148 57 59 114 52 53 57 59 90 112 114 144 147 148 57 59 114 133 146 133 173 146 87 2 137 51 95 113 120 121 138 138 177 120 121 121 95 s A SAL 51 113 Overall, a critical finding was the pronounced lack of QSAR models associated with a clearly defined AD. A clear definition of the AD is fundamental to increase confidence in the reliability of QSAR predictions and to accurately assess the degree of extrapolations. Without a defined AD, QSAR models risk being applied incorrectly and outside their intended scope, which can lead to the misuse of the tool and, ultimately, unreliable predictions. 3.8. Molecular Descriptors: Mechanistic Interpretations and Feature Importance Molecular descriptors encode for numerical representations of molecular structures and serve as independent variables in QSAR models. Thousands of molecular descriptors have been developed, reflecting the varied complexity of chemical structural representation. Molecular descriptors range from simple molecular properties (e.g., molecular weight (MW)) to highly complex ones (e.g., quantum chemical descriptors) [ 178 179 Across the examined studies, an extensive range of molecular descriptors and software for their calculation was observed. The full list of software and molecular descriptors used for each model is provided in Table 2 The mechanistic interpretation of a QSAR model is critically important because it allows for the identification of the chemical properties or structural features that most significantly contribute to the predicted endpoint, enhancing the scientific credibility and acceptance of predictions [ 157 158 184 Mechanistic interpretation or the application of feature importance techniques was conducted for fifty-six QSARs selected in this review, accounting for approximately 65% of the total models. These approaches were applied across six specific MIEs: TTR, TR, TSHR, TPO, TBG, and albumin. The decision to conduct a straightforward mechanistic interpretation of selected molecular descriptors or to apply feature importance techniques was contingent upon various factors, including the type of modelling methodology employed, the chemical nature of the compounds modelled, and the specific types of molecular descriptors used. Relevant descriptors are influenced by the structural characteristics included in the dataset, which in turn depends on whether the dataset is composed of structurally heterogeneous chemicals or of compounds from a single chemical class. Interpreted QSARs for TTR binding were either based on heterogenous organic chemicals or specific chemical classes, including halogenated phenols and thiophenols, PFAS and/or PFCs, and PBDEs and their hydroxylated metabolites. A strong consensus on the fundamental molecular properties influencing TTR binding was revealed, although different descriptors were used to represent those properties, highlighting the fact that various computational methods can effectively encode the same critical structural information. The most significant and consistently identified structural features were aromatic rings, halogen atoms, and hydroxyl groups. Examples of descriptors encoding for these features were nArOH (number of aromatic hydroxyls) and nX (number of halogen atoms), which consistently showed a positive correlation with TTR binding affinity. These can be referred to as “structural alerts”, as their presence recalls the chemical structure of THs like T3 and T4. In addition, hydrophobicity was consistently recognised as a critical property driving TTR binding. Descriptors encoding for this property, such as logP and log DOW (pH = 7.40), were repeatedly selected in various QSARs. The hydrophobic nature of the TTR binding site for T4 justifies this observation [ 185 As seen for TTR, interpreted QSARs for TR binding predictions were either based on heterogenous organic chemicals or specific classes. These included PCBs and their hydroxylated metabolites, PBDEs, PCNs, and PFAS. Similarly to TTR, TR modelling was performed using a wide array of molecular descriptors, and mechanistic interpretations were either more general or detailed. The presence and quantity of halogen atoms were consistently identified as being critical for TR binding. This information was encoded in descriptors like X% (percentage of halogen atoms) and nBr or nCl (number of bromine or chlorine atoms, respectively), which showed a positive correlation with TR binding affinity. In addition, molecular polarity was identified as a relevant property. Descriptors like EEig03d and EEig06d (edge adjacency indices weighted by dipole moments) and μ and μ2 (dipole moments) were positively correlated with TR binding, indicating that an increase in polarity could enhance affinity to TR. For PFAS, an optimal chain length was identified as a key determinant of TR binding, showing a moderate to high probability of binding for longer chains. Hydrophobicity was another key property consistently identified as a positive contributor to TR binding. Finally, electronic descriptors were selected to encode for the ability of a compound to accept or donate electrons and form hydrogen bonds with TR. The interpretation of five QSARs for TPO inhibition by Seo et al. [ 107 120 121 120 121 Regarding TSHR, two QSARs by Liu et al. [ 95 106 106 Table 2 95 TBG binding was only modelled by Yang et al., who developed four QSARs based on data for PBBs, including their mono-hydroxylated and di-hydroxylated metabolites [ 52 93 Overall, although these findings provided valuable insights into the main structural features and properties that may cause TH system disruption, a drawback is the limited emphasis or, in some instances, the complete absence of mechanistic interpretations or the application of feature importance techniques. This may limit the confidence in QSAR models among both scientists and regulatory bodies. Therefore, considering the increasing demand for mechanistically informed NAMs to advance chemical hazard assessments, future research should prioritise and dedicate resources to improving the mechanistic understanding of QSAR models in order to promote wider acceptance and trust in these methodologies. Finally, this review showed the wide array of software and molecular descriptors used in QSAR studies for TH system disruption, underscoring the dynamic nature of the field. The diversity in approaches to descriptor calculation and selection indicates a lack of a single, standardised tool or method. Instead, the choice of software and methodology appeared to be driven by factors such as the expertise of researchers, tool accessibility, and prior experience with specific platforms. 3.9. Recent Advances: 2025 To keep this review up to date and to provide a picture of the field’s evolution, this section was included to provide a concise picture of the key models published between January and July 2025. Table 3 Table 4 Charest et al. [ 187 192 Section 3.8 186 189 191 193 194 188 193 193 4. Conclusions This review highlighted the growing yet still-evolving landscape of QSAR models addressing MIEs leading to TH system disruption by chemical substances. While significant progress has been made, particularly due to the increased availability of HTS data, the field remains fragmented and challenges persist. This review highlighted a preference for classification-based models to predict categorical outcomes, instead of continuous toxicity values, and that, despite the rise in complex machine learning methods, simpler algorithms continued to be employed to leverage their interpretability and promote broader adoption. This review revealed that modelling efforts were predominantly focused on key MIEs like TR and TTR, scarcely followed by TPO and TSHR. Critically, many other relevant MIEs, including the three deiodinases, NIS, TRHR, TBG, and albumin were significantly poorly addressed in QSAR research. A critical finding was the lack of QSAR modelling studies addressing MIEs related to DUOX, IYD, and pendrin inhibition, and those associated with cellular TH transport (specifically MCT8, MCT10, OATP1C1, OATP1A4, MDR1, and MRP2), highlighting critical areas for future investigations. Similarly, a limited number of chemical classes were addressed, leading to a very small number of local QSARs. Notably, while validation strategies were consistently employed, a critical finding was a frequent lack of explicitly defined ADs. Without clear AD definitions, QSARs risk being applied outside their scope, undermining decision-making confidence and leading to the incorrect use of QSARs. Furthermore, even though several types of molecular descriptors have been consistently identified as being relevant to model specific MIEs (e.g., TTR and TR), a limited emphasis on mechanistic interpretations was observed for many models, representing a critical drawback. However, the recent emergence of studies simultaneously covering multiple TH system-related endpoints demonstrated a growing awareness of the multifaceted nature of TH system disruption, offering a promising direction in aligning predictive modelling within AOP frameworks. The findings suggested a need for increased efforts in generating in vitro and in silico data for poorly addressed MIEs, broadening the chemical space of tested compounds, and ultimately developing new models. The successful application of integrated in silico approaches to generate activity data, such as molecular docking and dynamic simulations, has proven to be an effective strategy for developing QSARs when experimental data is limited or unavailable, presenting a valuable path forward for exploring multiple MIEs and for specific chemical classes. This would enable a more robust hazard assessment for entire groups of compounds. Future studies should prioritise the development of QSAR models with clearly defined ADs and enhanced mechanistic interpretability to increase the reliability and transparency of and confidence in their predictions, ultimately to promote their wider acceptance as effective NAMs for TH system disruption assessment. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/toxics13090799/s1 Author Contributions Conceptualization, M.E. and E.P.; formal analysis, M.E.; investigation, M.E.; data curation, M.E.; writing—original draft preparation, M.E. and E.P.; writing—review and editing, M.E. and E.P.; visualisation, M.E. and E.P.; supervision, E.P.; project administration, E.P. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement No new data were created or analysed in this study. The data supporting the findings of this study are included within the paper and Supplementary Materials Conflicts of Interest The authors declare no conflicts of interest. The funders had no role in the design of the study; in the collection, analyses, or interpretation of data; in the writing of the manuscript; or in the decision to publish the results. Abbreviations The following abbreviations are used in this manuscript: AD Applicability domain AdaB Adaptive Boosting AhR Aryl hydrocarbon receptor AOP Adverse outcome pathway ASNNs Associative neural networks BFR Brominated flame retardant BMC Biopartitioning micellar chromatography CAR Constitutive androstane receptor CART Classification and regression trees CP Conformal prediction DBP Phenolic disinfection byproduct DIO Iodothyronine deiodinase DIO1 Type 1 deiodinase DIO2 Type 2 deiodinase DIO3 Type 3 deiodinase DTC Decision Tree Classifier DUOX Dual oxidase EDC Endocrine-disrupting chemical EU European Union EURL ECVAM European Union Reference Laboratory for Alternatives to Animal Testing FAIR Findable, Accessible, Interoperable, Reusable FP Fingerprint HPA Hypothalamic–pituitary–adrenal HPG Hypothalamic–pituitary–gonadal HPT Hypothalamic–pituitary–thyroid HTS High-throughput screening IYD Iodotyrosine deiodinase kNN k-nearest neighbours LDA Linear discriminant analysis LMO Leave more out LOO Leave one out LR Logistic regression MCT Monocarboxylate transporter MCT10 Monocarboxylate transporter 10 MCT8 Monocarboxylate transporter 8 MDR1 Multidrug resistance protein 1 MIE Molecular initiating event MLR Multiple linear regression MRM Multiple regression model MRP2 Multidrug resistance-associated protein 2 MW Molecular weight NAMs New approach methodologies NIS Sodium iodide symporter NN Neural network OATP Organic anion transporter polypeptide OATP1A4 Organic anion transporter polypeptide 1A4 OATP1C1 Organic anion transporter polypeptide 1C1 OECD Organisation for Economic Co-operation and Development PBB Polybrominated biphenyl PBDE Polybrominated diphenyl ether PCA Principal component analysis PCB Polychlorinated biphenyl PCN Polychlorinated naphthalene PFAS Per- and polyfluoroalkyl substances PFC Poly- and perfluorinated compound PLR Partial logistic regression PLS Partial least squares PLS-DA Partial least squares discriminant analysis PPAR Peroxisome proliferator-activated receptor PS Prediction entropy PXR Pregnane X receptor QSAR Quantitative structure–activity relationship RF Random forest SHAP Shapley additive explanation SMOTEENN Synthetic minority over-sampling technique-edited nearest neighbours SVM Support vector machine T3 Triiodothyronine T4 Thyroxine TBG Thyroid-binding globulin TH Thyroid hormone THSDC Thyroid hormone system-disrupting chemical TPO Thyroperoxidase TR Thyroid hormone receptor TRHR Thyrotropin-releasing hormone receptor TSHR Thyroid-stimulating hormone receptor TTR Transthyretin XGB Extreme gradient boosting References 1. Gore A.C. La Merrill M.A. Patisaul H.B. Sargis R. Endocrine Disrupting Chemicals: Threats to Human Health. The Endocrine Society and IPEN 2024 Available online: https://ipen.org/sites/default/files/documents/edc_report-2024-final-compressed.pdf (accessed on 22 June 2025) 2. World Health Organization/International Programme on Chemical Safety (WHO/IPCS) Global Assessment on the State of the Science of Endocrine Disruptors World Health Organization Geneva, Switzerland 2002 3. Ahn C. Jeung E.-B. Endocrine-Disrupting Chemicals and Disease Endpoints Int. J. Mol. Sci. 2023 24 5342 10.3390/ijms24065342 36982431 PMC10049097 4. World Health Organization/International Programme on Chemical Safety (WHO/IPCS) State of the Science of Endocrine Disrupting Chemicals 2012 World Health Organization Geneva, Switzerland 2012 5. de Oliveira Santos A.D. do Nascimento M.T.L. de Freitas A.d.S. de Carvalho D.G. Bila D.M. Hauser-Davis R.A. Monteiro da Fonseca E. Baptista Neto J.A. The Evolution of Endocrine Disruptor Chemical Assessments Worldwide in the Last Three Decades Mar. Pollut. Bull. 2023 197 115727 10.1016/j.marpolbul.2023.115727 37918146 6. FAO Exposure to Endocrine Disrupting Chemicals—Changes from 2002 to 2024 Food Safety and Quality Series, No. 30 FAO Rome, Italy 2024 10.4060/cd3005en 7. Diamanti-Kandarakis E. Bourguignon J.-P. Giudice L.C. Hauser R. Prins G.S. Soto A.M. Zoeller R.T. Gore A.C. Endocrine-Disrupting Chemicals: An Endocrine Society Scientific Statement Endocr. Rev. 2009 30 293 342 10.1210/er.2009-0002 19502515 PMC2726844 8. Feldt-Rasmussen U. Effraimidis G. Klose M. The Hypothalamus-Pituitary-Thyroid (HPT)-Axis and Its Role in Physiology and Pathophysiology of Other Hypothalamus-Pituitary Functions Mol. Cell Endocrinol. 2021 525 111173 10.1016/j.mce.2021.111173 33549603 9. Fekete C. Lechan R.M. Central Regulation of Hypothalamic-Pituitary-Thyroid Axis Under Physiological and Pathophysiological Conditions Endocr. Rev. 2014 35 159 194 10.1210/er.2013-1087 24423980 PMC3963261 10. Sabatino L. Vassalle C. Thyroid Hormones and Metabolism Regulation: Which Role on Brown Adipose Tissue and Browning Process? Biomolecules 2025 15 361 10.3390/biom15030361 40149897 PMC11940499 11. Mullur R. Liu Y.-Y. Brent G.A. Thyroid Hormone Regulation of Metabolism Physiol. Rev. 2014 94 355 382 10.1152/physrev.00030.2013 24692351 PMC4044302 12. De Luca R. Davis P.J. Lin H.-Y. Gionfra F. Percario Z.A. Affabris E. Pedersen J.Z. Marchese C. Trivedi P. Anastasiadou E. Thyroid Hormones Interaction With Immune Response, Inflammation and Non-Thyroidal Illness Syndrome Front. Cell Dev. Biol. 2021 8 614030 10.3389/fcell.2020.614030 33553149 PMC7859329 13. Sawicka-Gutaj N. Zawalna N. Gut P. Ruchała M. Relationship between Thyroid Hormones and Central Nervous System Metabolism in Physiological and Pathological Conditions Pharmacol. Rep. 2022 74 847 858 10.1007/s43440-022-00377-w 35771431 14. Bassett J.H.D. Williams G.R. Role of Thyroid Hormones in Skeletal Development and Bone Maintenance Endocr. Rev. 2016 37 135 187 10.1210/er.2015-1106 26862888 PMC4823381 15. Silva J.F. Ocarino N.M. Serakides R. Thyroid Hormones and Female Reproduction Biol. Reprod. 2018 99 907 921 10.1093/biolre/ioy115 29767691 16. Yamakawa H. Kato T.S. Noh J.Y. Yuasa S. Kawamura A. Fukuda K. Aizawa Y. Thyroid Hormone Plays an Important Role in Cardiac Function: From Bench to Bedside Front. Physiol. 2021 12 606931 10.3389/fphys.2021.606931 34733168 PMC8558494 17. Brent G.A. Mechanisms of Thyroid Hormone Action J. Clin. Investig. 2012 122 3035 3043 10.1172/JCI60047 22945636 PMC3433956 18. Alcaide Martin A. Mayerl S. Local Thyroid Hormone Action in Brain Development Int. J. Mol. Sci. 2023 24 12352 10.3390/ijms241512352 37569727 PMC10418487 19. Giannocco G. Kizys M.M.L. Maciel R.M. de Souza J.S. Thyroid Hormone, Gene Expression, and Central Nervous System: Where We Are Semin. Cell Dev. Biol. 2021 114 47 56 10.1016/j.semcdb.2020.09.007 32980238 20. Adu-Gyamfi E.A. Wang Y.-X. Ding Y.-B. The Interplay between Thyroid Hormones and the Placenta: A Comprehensive Review Biol. Reprod. 2020 102 8 17 10.1093/biolre/ioz182 31494673 21. Moog N.K. Entringer S. Heim C. Wadhwa P.D. Kathmann N. Buss C. Influence of Maternal Thyroid Hormones during Gestation on Fetal Brain Development Neuroscience 2017 342 68 100 10.1016/j.neuroscience.2015.09.070 26434624 PMC4819012 22. Köhrle J. Frädrich C. Thyroid Hormone System Disrupting Chemicals Best Pract. Res. Clin. Endocrinol. Metab. 2021 35 101562 10.1016/j.beem.2021.101562 34274233 23. Kortenkamp A. Axelstad M. Baig A.H. Bergman Å. Bornehag C.-G. Cenijn P. Christiansen S. Demeneix B. Derakhshan A. Fini J.-B. Removing Critical Gaps in Chemical Test Methods by Developing New Assays for the Identification of Thyroid Hormone System-Disrupting Chemicals—The ATHENA Project Int. J. Mol. Sci. 2020 21 3123 10.3390/ijms21093123 32354186 PMC7247692 24. Oliveira K.J. Chiamolera M.I. Giannocco G. Pazos-Moura C.C. Ortiga-Carvalho T.M. Thyroid Function Disruptors: From Nature to Chemicals J. Mol. Endocrinol. 2019 62 R1 R19 10.1530/JME-18-0081 30006341 25. Calsolaro V. Pasqualetti G. Niccolai F. Caraccio N. Monzani F. Thyroid Disrupting Chemicals Int. J. Mol. Sci. 2017 18 2583 10.3390/ijms18122583 29194390 PMC5751186 26. Boas M. Feldt-Rasmussen U. Main K.M. Thyroid Effects of Endocrine Disrupting Chemicals Mol. Cell Endocrinol. 2012 355 240 248 10.1016/j.mce.2011.09.005 21939731 27. Salazar P. Villaseca P. Cisternas P. Inestrosa N.C. Neurodevelopmental Impact of the Offspring by Thyroid Hormone System-Disrupting Environmental Chemicals during Pregnancy Environ. Res. 2021 200 111345 10.1016/j.envres.2021.111345 34087190 28. Alsen M. Sinclair C. Cooke P. Ziadkhanpour K. Genden E. van Gerwen M. Endocrine Disrupting Chemicals and Thyroid Cancer: An Overview Toxics 2021 9 14 10.3390/toxics9010014 33477829 PMC7832870 29. Olanrewaju O.A. Asghar R. Makwana S. Yahya M. Kumar N. Khawar M.H. Ahmed A. Islam T. Kumari K. Shadmani S. Thyroid and Its Ripple Effect: Impact on Cardiac Structure, Function, and Outcomes Cureus 2024 16 e51574 10.7759/cureus.51574 38318568 PMC10840038 30. Brown E.D.L. Obeng-Gyasi B. Hall J.E. Shekhar S. The Thyroid Hormone Axis and Female Reproduction Int. J. Mol. Sci. 2023 24 9815 10.3390/ijms24129815 37372963 PMC10298303 31. Murk A.J. Rijntjes E. Blaauboer B.J. Clewell R. Crofton K.M. Dingemans M.M.L. David Furlow J. Kavlock R. Köhrle J. Opitz R. Mechanism-Based Testing Strategy Using in Vitro Approaches for Identification of Thyroid Hormone Disrupting Chemicals Toxicol. Vitr. 2013 27 1320 1346 10.1016/j.tiv.2013.02.012 23453986 32. Crofton K.M. Thyroid Disrupting Chemicals: Mechanisms and Mixtures Int. J. Androl. 2008 31 209 223 10.1111/j.1365-2605.2007.00857.x 18217984 33. Bernasconi C. Sampani S. Beronius A. Coecke S. Langezaal I. Pistollato F. Paini A. Muñoz A. Asturiol D. Kienzler A. Chemical Selection for the Thyroid Validation Study Coordinated by EURL ECVAM and Involving EU-NETVAL Laboratories ALTEX—Altern. Anim. Exp. 2025 10.14573/altex.2501152 40627843 34. European Commission The European Green Deal 2019 European Commission Brussels, Belgium 2019 35. European Commission Chemicals Strategy for Sustainability Towards a Toxic-Free Environment 2020 European Commission Brussels, Belgium 2020 36. Holmer M.L. Holmberg R.D. Despicht C. Bouftas N. Axelstad M. Beronius A. Zilliacus J. Van Duursen M. Svingen T. Assessment of Endocrine Disruptors in the European Union: Current Regulatory Framework, Use of New Approach Methodologies (NAMs) and Recommendations for Improvements Regul. Toxicol. Pharmacol. 2025 162 105883 10.1016/j.yrtph.2025.105883 40484110 37. Ramhøj L. Axelstad M. Baert Y. Cañas-Portilla A.I. Chalmel F. Dahmen L. De La Vieja A. Evrard B. Haigis A.-C. Hamers T. New Approach Methods to Improve Human Health Risk Assessment of Thyroid Hormone System Disruption–a PARC Project Front. Toxicol. 2023 5 1189303 10.3389/ftox.2023.1189303 37265663 PMC10229837 38. ECHA Key Areas of Regulatory Challenge 2025 Available online: https://echa.europa.eu/documents/10162/17228/key_areas_regulatory_challenge_2025_en.pdf/da33bf25-2b75-1fe9-c308-53043f9b9a28?t=1749466525527 (accessed on 22 June 2025) 39. OECD Introduction Revised Guidance Document 150 on Standardised Test Guidelines for Evaluating Chemicals for Endocrine Disruption OECD publishing Paris, France 2018 19 39 40. European Commission Commission Delegated Regulation (EU) 2017/2100 of 4 September 2017 Setting out Scientific Criteria for the Determination of Endocrine-Disrupting Properties Pursuant to Regulation (EU) No 528/2012 of the European Parliament and Council (Text with EEA Relevance) European Commission Brussels, Belgium 2017 41. European Commission Commission Regulation (EU) 2018/605 of 19 April 2018 Amending Annex II to Regulation (EC) No 1107/2009 by Setting out Scientific Criteria for the Determination of Endocrine Disrupting Properties (Text with EEA Relevance) European Commission Brussels, Belgium 2018 42. European Commission Commission Delegated Regulation (EU) 2023/707 of 19 December 2022 Amending Regulation (EC) No 1272/2008 as Regards Hazard Classes and Criteria for the Classification, Labelling and Packaging of Substances and Mixtures (Text with EEA Relevance) European Commission Brussels, Belgium 2022 43. Ankley G.T. Bennett R.S. Erickson R.J. Hoff D.J. Hornung M.W. Johnson R.D. Mount D.R. Nichols J.W. Russom C.L. Schmieder P.K. Adverse Outcome Pathways: A Conceptual Framework to Support Ecotoxicology Research and Risk Assessment Environ. Toxicol. Chem. 2010 29 730 741 10.1002/etc.34 20821501 44. Svingen T. Schwartz C.L. Rosenmai A.K. Ramhøj L. Johansson H.K.L. Hass U. Draskau M.K. Davidsen N. Christiansen S. Ballegaard A.-S.R. Using Alternative Test Methods to Predict Endocrine Disruption and Reproductive Adverse Outcomes: Do We Have Enough Knowledge? Environ. Pollut. 2022 304 119242 10.1016/j.envpol.2022.119242 35378198 45. Cronin M.T.D. Richarz A.-N. Relationship Between Adverse Outcome Pathways and Chemistry-Based In Silico Models to Predict Toxicity Appl. Vitr. Toxicol. 2017 3 286 297 10.1089/aivt.2017.0021 46. Muratov E.N. Bajorath J. Sheridan R.P. Tetko I.V. Filimonov D. Poroikov V. Oprea T.I. Baskin I.I. Varnek A. Roitberg A. QSAR without Borders Chem. Soc. Rev. 2020 49 3525 3564 10.1039/D0CS00098A 32356548 PMC8008490 47. Noyes P.D. Friedman K.P. Browne P. Haselman J.T. Gilbert M.E. Hornung M.W. Barone S. Crofton K.M. Laws S.C. Stoker T.E. Evaluating Chemicals for Thyroid Disruption: Opportunities and Challenges with in Vitro Testing and Adverse Outcome Pathway Approaches Environ. Health Perspect. 2019 127 095001 10.1289/EHP5297 31487205 PMC6791490 48. Bernasconi C. Langezaal I. Bartnicka J. Asturiol D. Bowe G. Coecke S. Kienzler A. Liska R. Milcamps A. Munoz-Pineiro M.A. Validation of a Battery of Mechanistic Methods Relevant for the Detection of Chemicals That Can Disrupt the Thyroid Hormone System Publications Office of the European Union Luxembourg 2023 49. Sellami A. Reau M. Montes M. Lagarde N. Review of in Silico Studies Dedicated to the Nuclear Receptor Family: Therapeutic Prospects and Toxicological Concerns Front. Endocrinol. 2022 13 986016 10.3389/fendo.2022.986016 PMC9513233 36176461 50. Vergauwen L. Bajard L. Tait S. Langezaal I. Sosnowska A. Roncaglioni A. Hessel E. van den Brand A.D. Haigis A.-C. Novák J. A 2024 Inventory of Test Methods Relevant to Thyroid Hormone System Disruption for Human Health and Environmental Regulatory Hazard Assessment Open Res. Eur. 2024 4 242 10.12688/openreseurope.18739.1 39931575 PMC11809485 51. Dracheva E. Norinder U. Rydén P. Engelhardt J. Weiss J.M. Andersson P.L. In Silico Identification of Potential Thyroid Hormone System Disruptors among Chemicals in Human Serum and Chemicals with a High Exposure Index Environ. Sci. Technol. 2022 56 8363 8372 10.1021/acs.est.1c07762 35561338 PMC9228062 52. Yang L. Sun P. Tao L. Zhao X. An in Silico Study on Human Carcinogenicity Mechanism of Polybrominated Biphenyls Exposure Chem.-Biol. Interact. 2024 397 111075 10.1016/j.cbi.2024.111075 38815667 53. Evangelista M. Chirico N. Papa E. In Silico Models for the Screening of Human Transthyretin Disruptors J. Hazard. Mater. 2024 480 136188 10.1016/j.jhazmat.2024.136188 39454338 54. Cao J. Lin Y. Guo L.-H. Zhang A.-Q. Wei Y. Yang Y. Structure-Based Investigation on the Binding Interaction of Hydroxylated Polybrominated Diphenyl Ethers with Thyroxine Transport Proteins Toxicology 2010 277 20 28 10.1016/j.tox.2010.08.012 20804816 55. Montaño M. Cocco E. Guignard C. Marsh G. Hoffmann L. Bergman Å. Gutleb A.C. Murk A.J. New Approaches to Assess the Transthyretin Binding Capacity of Bioactivated Thyroid Hormone Disruptors Toxicol. Sci. 2012 130 94 105 10.1093/toxsci/kfs228 22859314 56. Grimm F.A. Lehmler H.-J. He X. Robertson L.W. Duffel M.W. Sulfated Metabolites of Polychlorinated Biphenyls Are High-Affinity Ligands for the Thyroid Hormone Transport Protein Transthyretin Environ. Health Perspect. 2013 121 657 662 10.1289/ehp.1206198 23584369 PMC3672920 57. Yang X. Ou W. Xi Y. Chen J. Liu H. Emerging Polar Phenolic Disinfection Byproducts Are High-Affinity Human Transthyretin Disruptors: An in Vitro and in Silico Study Environ. Sci. Technol. 2019 53 7019 7028 10.1021/acs.est.9b00218 31117532 58. Xi Y. Yang X. Zhang H. Liu H. Watson P. Yang F. Binding Interactions of Halo-Benzoic Acids, Halo-Benzenesulfonic Acids and Halo-Phenylboronic Acids with Human Transthyretin Chemosphere 2020 242 125135 10.1016/j.chemosphere.2019.125135 31669991 59. Yang X. Ou W. Zhao S. Wang L. Chen J. Kusko R. Hong H. Liu H. Human Transthyretin Binding Affinity of Halogenated Thiophenols and Halogenated Phenols: An in Vitro and in Silico Study Chemosphere 2021 280 130627 10.1016/j.chemosphere.2021.130627 33964751 60. Rosenmai A.K. Winge S.B. Möller M. Lundqvist J. Wedebye E.B. Nikolov N.G. Lilith Johansson H.K. Vinggaard A.M. Organophosphate Ester Flame Retardants Have Antiandrogenic Potential and Affect Other Endocrine Related Endpoints in Vitro and in Silico Chemosphere 2021 263 127703 10.1016/j.chemosphere.2020.127703 32854002 61. Ren X.M. Guo L.-H. Assessment of the Binding of Hydroxylated Polybrominated Diphenyl Ethers to Thyroid Hormone Transport Proteins Using a Site-Specific Fluorescence Probe Environ. Sci. Technol. 2012 46 4633 4640 10.1021/es2046074 22482873 62. Ren X.-M. Qin W.-P. Cao L.-Y. Zhang J. Yang Y. Wan B. Guo L.-H. Binding Interactions of Perfluoroalkyl Substances with Thyroid Hormone Transport Proteins and Potential Toxicological Implications Toxicology 2016 366–367 32 42 10.1016/j.tox.2016.08.011 27528273 63. Ouyang X. Froment J. Leonards P.E.G. Christensen G. Tollefsen K.-E. de Boer J. Thomas K.V. Lamoree M.H. Miniaturization of a Transthyretin Binding Assay Using a Fluorescent Probe for High Throughput Screening of Thyroid Hormone Disruption in Environmental Samples Chemosphere 2017 171 722 728 10.1016/j.chemosphere.2016.12.119 28063299 64. Qin W.-P. Li C.-H. Guo L.-H. Ren X.-M. Zhang J.-Q. Binding and Activity of Polybrominated Diphenyl Ether Sulfates to Thyroid Hormone Transport Proteins and Nuclear Receptors Environ. Sci. Process. Impacts 2019 21 950 956 10.1039/C9EM00095J 31143904 65. Ren X.-M. Yao L. Xue Q. Shi J. Zhang Q. Wang P. Fu J. Zhang A. Qu G. Jiang G. Binding and Activity of Tetrabromobisphenol A Mono-Ether Structural Analogs to Thyroid Hormone Transport Proteins and Receptors Environ. Health Perspect. 2020 128 107008 10.1289/EHP6498 33095664 PMC7584160 66. Huang K. Wang X. Zhang H. Zeng L. Zhang X. Wang B. Zhou Y. Jing T. Structure-Directed Screening and Analysis of Thyroid-Disrupting Chemicals Targeting Transthyretin Based on Molecular Recognition and Chromatographic Separation Environ. Sci. Technol. 2020 54 5437 5445 10.1021/acs.est.9b05761 32252528 67. Hamers T. Kortenkamp A. Scholze M. Molenaar D. Cenijn P.H. Weiss J.M. Transthyretin-Binding Activity of Complex Mixtures Representing the Composition of Thyroid-Hormone Disrupting Contaminants in House Dust and Human Serum Environ. Health Perspect. 2020 128 017015 10.1289/EHP5911 32003587 PMC7015555 68. van den Berg K.J. Interaction of Chlorinated Phenols with Thyroxine Binding Sites of Human Transthyretin, Albumin and Thyroid Binding Globulin Chem. Biol. Interact. 1990 76 63 75 10.1016/0009-2797(90)90034-K 2393944 69. den Besten C. Vet J.J.R.M. Besselink H.T. Kiel G.S. van Berkel B.J.M. Beems R. van Bladeren P.J. The Liver, Kidney, and Thyroid Toxicity of Chlorinated Benzenes Toxicol. Appl. Pharmacol. 1991 111 69 81 10.1016/0041-008X(91)90135-2 1949037 70. Lans M.C. Klasson-Wehler E. Willemsen M. Meussen E. Safe S. Brouwer A. Structure-Dependent, Competitive Interaction of Hydroxy-Polychlorobiphenyls, -Dibenzo-p-Dioxins and -Dibenzofurans with Human Transthyretin Chem. Biol. Interact. 1993 88 7 21 10.1016/0009-2797(93)90081-9 8330325 71. Cheek A.O. Kow K. Chen J. McLachlan J.A. Potential Mechanisms of Thyroid Disruption in Humans: Interaction of Organochlorine Compounds with Thyroid Receptor, Transthyretin, and Thyroid-Binding Globulin Environ. Health Perspect. 1999 107 273 278 10.1289/ehp.99107273 PMC1566512 10090705 72. Meerts I.A.T.M. van Zanden J.J. Luijks E.A.C. van Leeuwen-Bol I. Marsh G. Jakobsson E. Bergman Å. Brouwer A. Potent Competitive Interactions of Some Brominated Flame Retardants and Related Compounds with Human Transthyretin in Vitro Toxicol. Sci. 2000 56 95 104 10.1093/toxsci/56.1.95 10869457 73. Sandau C.D. Meerts I.A.T.M. Letcher R.J. McAlees A.J. Chittim B. Brouwer A. Norstrom R.J. Identification of 4-Hydroxyheptachlorostyrene in Polar Bear Plasma and Its Binding Affinity to Transthyretin:  A Metabolite of Octachlorostyrene? Environ. Sci. Technol. 2000 34 3871 3877 10.1021/es001134f 74. Chauhan K.R. Kodavanti P.R.S. McKinney J.D. Assessing the Role of Ortho-Substitution on Polychlorinated Biphenyl Binding to Transthyretin, a Thyroxine Transport Protein Toxicol. Appl. Pharmacol. 2000 162 10 21 10.1006/taap.1999.8826 10631123 75. Legler J. Cenijn P.H. Malmberg T. Bergman A. Brouwer A. Determination of the Endocrine Disrupting Potency of Hydroxylated PCB’s and Flame Retardants with in Vitro Bioassays Organohalogen Compd. 2002 53 56 Available online: https://research.vu.nl/en/publications/determination-of-the-endocrine-disrupting-potency-of-hydroxylated (accessed on 16 April 2023) 76. Meerts I.A.T.M. Assink Y. Cenijn P.H. van den Berg J.H.J. Weijers B.M. Bergman Å. Koeman J.H. Brouwer A. Placental Transfer of a Hydroxylated Polychlorinated Biphenyl and Effects on Fetal and Maternal Thyroid Hormone Homeostasis in the Rat Toxicol. Sci. 2002 68 361 371 10.1093/toxsci/68.2.361 12151632 77. Maia F. Almeida M.d.R. Gales L. Kijjoa A. Pinto M.M.M. Saraiva M.J. Damas A.M. The Binding of Xanthone Derivatives to Transthyretin Biochem. Pharmacol. 2005 70 1861 1869 10.1016/j.bcp.2005.09.012 16236271 78. Hamers T. Kamstra J.H. Sonneveld E. Murk A.J. Kester M.H.A. Andersson P.L. Legler J. Brouwer A. In Vitro Profiling of the Endocrine-Disrupting Potency of Brominated Flame Retardants Toxicol. Sci. 2006 92 157 173 10.1093/toxsci/kfj187 16601080 79. Harju M. Hamers T. Kamstra J.H. Sonneveld E. Boon J.P. Tysklind M. Andersson P.L. Quantitative Structure–activity Relationship Modeling on in Vitro Endocrine Effects and Metabolic Stability Involving 26 Selected Brominated Flame Retardants Environ. Toxicol. Chem. 2007 26 816 826 10.1897/06-308R.1 17447568 80. Hamers T. Kamstra J.H. Sonneveld E. Murk A.J. Visser T.J. Van Velzen M.J.M. Brouwer A. Bergman Å. Biotransformation of Brominated Flame Retardants into Potentially Endocrine-Disrupting Metabolites, with Special Attention to 2,2′,4,4′-Tetrabromodiphenyl Ether (BDE-47) Mol. Nutr. Food Res. 2008 52 284 298 10.1002/mnfr.200700104 18161906 81. Gales L. Almeida M.R. Arsequell G. Valencia G. Saraiva M.J. Damas A.M. Iodination of Salicylic Acid Improves Its Binding to Transthyretin Biochim. Biophis. Acta 2008 1784 512 517 10.1016/j.bbapap.2007.11.014 18155178 82. Weiss J.M. Andersson P.L. Lamoree M.H. Leonards P.E.G. van Leeuwen S.P.J. Hamers T. Competitive Binding of Poly- and Perfluorinated Compounds to the Thyroid Hormone Transport Protein Transthyretin Toxicol. Sci. 2009 109 206 216 10.1093/toxsci/kfp055 19293372 83. Hamers T. Kamstra J.H. Cenijn P.H. Pencikova K. Palkova L. Simeckova P. Vondracek J. Andersson P.L. Stenberg M. Machala M. In Vitro Toxicity Profiling of Ultrapure Non–Dioxin-like Polychlorinated Biphenyl Congeners and Their Relative Toxic Contribution to PCB Mixtures in Humans Toxicol. Sci. 2011 121 88 100 10.1093/toxsci/kfr043 21357386 84. Simon E. Bytingsvik J. Jonker W. Leonards P.E.G. de Boer J. Jenssen B.M. Lie E. Aars J. Hamers T. Lamoree M.H. Blood Plasma Sample Preparation Method for the Assessment of Thyroid Hormone-Disrupting Potency in Effect-Directed Analysis Environ. Sci. Technol. 2011 45 7936 7944 10.1021/es2016389 21842831 85. Simon E. van Velzen M. Brandsma S.H. Lie E. Løken K. de Boer J. Bytingsvik J. Jenssen B.M. Aars J. Hamers T. Effect-Directed Analysis To Explore the Polar Bear Exposome: Identification of Thyroid Hormone Disrupting Compounds in Plasma Environ. Sci. Technol. 2013 47 8902 8912 10.1021/es401696u 23763488 86. Viluksela M. Heikkinen P. van der Ven L.T.M. Rendel F. Roos R. Esteban J. Korkalainen M. Lensu S. Miettinen H.M. Savolainen K. Toxicological Profile of Ultrapure 2,2′,3,4,4′,5,5′-Heptachlorbiphenyl (PCB 180) in Adult Rats PLoS ONE 2014 9 e104639 10.1371/journal.pone.0104639 25137063 PMC4138103 87. Zhang J. Kamstra J.H. Ghorbanzadeh M. Weiss J.M. Hamers T. Andersson P.L. In Silico Approach To Identify Potential Thyroid Hormone Disruptors among Currently Known Dust Contaminants and Their Metabolites Environ. Sci. Technol. 2015 49 10099 10107 10.1021/acs.est.5b01742 26207645 88. Weiss J.M. Andersson P.L. Zhang J. Simon E. Leonards P.E.G. Hamers T. Lamoree M.H. Tracing Thyroid Hormone-Disrupting Compounds: Database Compilation and Structure–activity Evaluation for an Effect-Directed Analysis of Sediment Anal. Bioanal. Chem. 2015 407 5625 5634 10.1007/s00216-015-8736-9 25986900 PMC4498237 89. Hill K.L. Mortensen Å.-K. Teclechiel D. Willmore W.G. Sylte I. Jenssen B.M. Letcher R.J. In Vitro and in Silico Competitive Binding of Brominated Polyphenyl Ether Contaminants with Human and Gull Thyroid Hormone Transport Proteins Environ. Sci. Technol. 2018 52 1533 1541 10.1021/acs.est.7b04617 29283575 90. Kowalska D. Sosnowska A. Bulawska N. Stępnik M. Besselink H. Behnisch P. Puzyn T. How the Structure of Per- and Polyfluoroalkyl Substances (PFAS) Influences Their Binding Potency to the Peroxisome Proliferator-Activated and Thyroid Hormone Receptors—An In Silico Screening Study Molecules 2023 28 479 10.3390/molecules28020479 36677537 PMC9866891 91. Akinola L.K. Uzairu A. Shallangwa G.A. Abechi S.E. Development of Binary Classification Models for Grouping Hydroxylated Polychlorinated Biphenyls into Active and Inactive Thyroid Hormone Receptor Agonists SAR QSAR Environ. Res. 2023 34 267 284 10.1080/1062936X.2023.2207039 37139950 92. Arulmozhiraja S. Shiraishi F. Okumura T. Iida M. Takigami H. Edmonds J.S. Morita M. Structural Requirements for the Interaction of 91 Hydroxylated Polychlorinated Biphenyls with Estrogen and Thyroid Hormone Receptors Toxicol. Sci. 2005 84 49 62 10.1093/toxsci/kfi063 15601674 93. Gallagher A. Kar S. Sepúlveda M.S. Computational Modeling of Human Serum Albumin Binding of Per- and Polyfluoroalkyl Substances Employing QSAR, Read-Across, and Docking Molecules 2023 28 5375 10.3390/molecules28145375 37513249 PMC10383382 94. Jackson T.W. Scheibly C.M. Polera M.E. Belcher S.M. Rapid Characterization of Human Serum Albumin Binding for Per- and Polyfluoroalkyl Substances Using Differential Scanning Fluorimetry Environ. Sci. Technol. 2021 55 12291 12301 10.1021/acs.est.1c01200 34495656 PMC8651256 95. Liu W. Wang Z. Chen J. Tang W. Wang H. Machine Learning Model for Screening Thyroid Stimulating Hormone Receptor Agonists Based on Updated Datasets and Improved Applicability Domain Metrics Chem. Res. Toxicol. 2023 36 947 958 10.1021/acs.chemrestox.3c00074 37209109 96. Neumann S. Huang W. Titus S. Krause G. Kleinau G. Alberobello A.T. Zheng W. Southall N.T. Inglese J. Austin C.P. Small-Molecule Agonists for the Thyrotropin Receptor Stimulate Thyroid Function in Human Thyrocytes and Mice Proc. Natl. Acad. Sci. USA 2009 106 12471 12476 10.1073/pnas.0904506106 19592511 PMC2708975 97. Jäschke H. Neumann S. Moore S. Thomas C.J. Colson A.-O. Costanzi S. Kleinau G. Jiang J.-K. Paschke R. Raaka B.M. A Low Molecular Weight Agonist Signals by Binding to the Transmembrane Domain of Thyroid-Stimulating Hormone Receptor (TSHR) and Luteinizing Hormone/Chorionic Gonadotropin Receptor (LHCGR) J. Biol. Chem. 2006 281 9841 9844 10.1074/jbc.C600014200 16488885 98. Titus S. Neumann S. Zheng W. Southall N. Michael S. Klumpp C. Yasgar A. Shinn P. Thomas C.J. Inglese J. Quantitative High-Throughput Screening Using a Live-Cell cAMP Assay Identifies Small-Molecule Agonists of the TSH Receptor SLAS Discov. 2008 13 120 127 10.1177/1087057107313786 PMC2653065 18216391 99. Huang R. Xia M. Sakamuru S. Zhao J. Shahane S.A. Attene-Ramos M. Zhao T. Austin C.P. Simeonov A. Modelling the Tox21 10 K Chemical Profiles for in Vivo Toxicity Prediction and Mechanism Characterization Nat. Commun. 2016 7 10425 10.1038/ncomms10425 26811972 PMC4777217 100. Huang R. Xia M. Sakamuru S. Zhao J. Lynch C. Zhao T. Zhu H. Austin C.P. Simeonov A. Expanding Biological Space Coverage Enhances the Prediction of Drug Adverse Effects in Human Using in Vitro Activity Profiles Sci. Rep. 2018 8 3783 10.1038/s41598-018-22046-w 29491351 PMC5830476 101. Olker J.H. Korte J.J. Denny J.S. Hartig P.C. Cardon M.C. Knutsen C.N. Kent P.M. Christensen J.P. Degitz S.J. Hornung M.W. Screening the ToxCast Phase 1, Phase 2, and E1k Chemical Libraries for Inhibitors of Iodothyronine Deiodinases Toxicol. Sci. 2019 168 430 442 10.1093/toxsci/kfy302 30561685 PMC6520049 102. Wang J. Hallinger D.R. Murr A.S. Buckalew A.R. Lougee R.R. Richard A.M. Laws S.C. Stoker T.E. High-Throughput Screening and Chemotype-Enrichment Analysis of ToxCast Phase II Chemicals Evaluated for Human Sodium-Iodide Symporter (NIS) Inhibition Environ. Int. 2019 126 377 386 10.1016/j.envint.2019.02.024 30826616 PMC9082575 103. Paul Friedman K. Watt E.D. Hornung M.W. Hedge J.M. Judson R.S. Crofton K.M. Houck K.A. Simmons S.O. Tiered High-Throughput Screening Approach to Identify Thyroperoxidase Inhibitors Within the ToxCast Phase I and II Chemical Libraries Toxicol. Sci. 2016 151 160 180 10.1093/toxsci/kfw034 26884060 PMC4914804 104. Gadaleta D. Spînu N. Roncaglioni A. Cronin M.T.D. Benfenati E. Prediction of the Neurotoxic Potential of Chemicals Based on Modelling of Molecular Initiating Events Upstream of the Adverse Outcome Pathways of (Developmental) Neurotoxicity Int. J. Mol. Sci. 2022 23 3053 10.3390/ijms23063053 35328472 PMC8954925 105. Gaulton A. Hersey A. Nowotka M. Bento A.P. Chambers J. Mendez D. Mutowo P. Atkinson F. Bellis L.J. Cibrián-Uhalte E. The ChEMBL Database in 2017 Nucleic Acids Res. 2017 45 D945 D954 10.1093/nar/gkw1074 27899562 PMC5210557 106. Xu X. Wang C. Gui B. Yuan X. Li C. Zhao Y. Martyniuk C.J. Su L. Application of Machine Learning to Predict the Inhibitory Activity of Organic Chemicals on Thyroid Stimulating Hormone Receptor Environ. Res. 2022 212 113175 10.1016/j.envres.2022.113175 35351457 107. Seo M. Lim C. Kwon H. In Silico Prediction Models for Thyroid Peroxidase Inhibitors and Their Application to Synthetic Flavors Food Sci. Biotechnol. 2022 31 483 495 10.1007/s10068-022-01041-y 35464247 PMC8994803 108. Carvalho D.P. Ferreira A.C.F. Coelho S.M. Moraes J.M. Camacho M.A.S. Rosenthal D. Thyroid Peroxidase Activity Is Inhibited by Amino Acids Braz. J. Med. Biol. Res. 2000 33 355 361 10.1590/S0100-879X2000000300015 10719389 109. Divi R.L. Doerge D.R. Inhibition of Thyroid Peroxidase by Dietary Flavonoids Chem. Res. Toxicol. 1996 9 16 23 10.1021/tx950076m 8924586 110. Habza-Kowalska E. Kaczor A.A. Żuk J. Matosiuk D. Gawlik-Dziki U. Thyroid Peroxidase Activity Is Inhibited by Phenolic Compounds—Impact of Interaction Molecules 2019 24 2766 10.3390/molecules24152766 31366075 PMC6696198 111. Lee J. Conversion of the Organic Breakdown Products of Glucosinolate to Thiocyanate Anions and Their Effects on Thyroid Hormone Production Ph.D. Thesis Seoul National University Seoul, Republic of Korea 2015 112. Li X. Gu W. Zhang B. Xin X. Kang Q. Yang M. Chen B. Li Y. Insights into Toxicity of Polychlorinated Naphthalenes to Multiple Human Endocrine Receptors: Mechanism and Health Risk Analysis Environ. Int. 2022 165 107291 10.1016/j.envint.2022.107291 35609500 113. Sapounidou M. Norinder U. Andersson P.L. Predicting Endocrine Disruption Using Conformal Prediction—A Prioritization Strategy to Identify Hazardous Chemicals with Confidence Chem. Res. Toxicol. 2023 36 53 65 10.1021/acs.chemrestox.2c00267 36534483 PMC9846826 114. Yang X. Ou W. Zhao S. Xi Y. Wang L. Liu H. Rapid Screening of Human Transthyretin Disruptors through a Tiered in Silico Approach ACS Sustain. Chem. Eng. 2021 9 5661 5672 10.1021/acssuschemeng.1c00680 115. Van den Berg K.J. van Raaij J.A.G.M. Bragt P.C. Notten W.R.F. Interactions of Halogenated Industrial Chemicals with Transthyretin and Effects on Thyroid Hormone Levels In Vivo Arch. Toxicol. 1991 65 15 19 10.1007/BF01973497 2043046 116. Marchesini G.R. Meulenberg E. Haasnoot W. Mizuguchi M. Irth H. Biosensor Recognition of Thyroid-Disrupting Chemicals Using Transport Proteins Anal. Chem. 2006 78 1107 1114 10.1021/ac051399i 16478101 117. Marchesini G.R. Meimaridou A. Haasnoot W. Meulenberg E. Albertus F. Mizuguchi M. Takeuchi M. Irth H. Murk A.J. Biosensor Discovery of Thyroxine Transport Disrupting Chemicals Toxicol. Appl. Pharmacol. 2008 232 150 160 10.1016/j.taap.2008.06.014 18647617 118. Purkey H.E. Palaninathan S.K. Kent K.C. Smith C. Safe S.H. Sacchettini J.C. Kelly J.W. Hydroxylated Polychlorinated Biphenyls Selectively Bind Transthyretin in Blood and Inhibit Amyloidogenesis: Rationalizing Rodent PCB Toxicity Chem. Biol. 2004 11 1719 1728 10.1016/j.chembiol.2004.10.009 15610856 119. Garcia de Lomana M. Weber A.G. Birk B. Landsiedel R. Achenbach J. Schleifer K.-J. Mathea M. Kirchmair J. In Silico Models to Predict the Perturbation of Molecular Initiating Events Related to Thyroid Hormone Homeostasis Chem. Res. Toxicol. 2021 34 396 411 10.1021/acs.chemrestox.0c00304 33185102 PMC7887800 120. Gadaleta D. d’Alessandro L. Marzo M. Benfenati E. Roncaglioni A. Quantitative Structure–activity Relationship Modeling of the Amplex Ultrared Assay to Predict Thyroperoxidase Inhibitory Activity Front. Pharmacol. 2021 12 713037 10.3389/fphar.2021.713037 34456728 PMC8387701 121. Rosenberg S.A. Watt E.D. Judson R.S. Simmons S.O. Paul Friedman K. Dybdahl M. Nikolov N.G. Wedebye E.B. QSAR Models for Thyroperoxidase Inhibition and Screening of U.S. and EU Chemical Inventories Comput. Toxicol. 2017 4 11 21 10.1016/j.comtox.2017.07.006 122. Bai X. Yan L. Ji C. Zhang Q. Dong X. Chen A. Zhao M. A Combination of Ternary Classification Models and Reporter Gene Assays for the Comprehensive Thyroid Hormone Disruption Profiles of 209 Polychlorinated Biphenyls Chemosphere 2018 210 312 319 10.1016/j.chemosphere.2018.07.023 30005353 123. Yan L. Zhang Q. Huang F. Nie W.-W. Hu C.-Q. Ying H.-Z. Dong X.-W. Zhao M.-R. Ternary Classification Models for Predicting Hormonal Activities of Chemicals via Nuclear Receptors Chem. Phys. Lett. 2018 706 360 366 10.1016/j.cplett.2018.06.022 124. Nakamura N. Matsubara K. Sanoh S. Ohta S. Uramaru N. Kitamura S. Yamaguchi M. Sugihara K. Fujimoto N. Cell Type-Dependent Agonist/Antagonist Activities of Polybrominated Diphenyl Ethers Toxicol. Lett. 2013 223 192 197 10.1016/j.toxlet.2013.09.007 24076165 125. Ren X.-M. Guo L.-H. Molecular Toxicology of Polybrominated Diphenyl Ethers: Nuclear Hormone Receptor Mediated Pathways Environ. Sci. Process. Impacts 2013 15 702 708 10.1039/c3em00023k 23467608 126. Amano I. Miyazaki W. Iwasaki T. Shimokawa N. Koibuchi N. The Effect of Hydroxylated Polychlorinated Biphenyl (OH-PCB) on Thyroid Hormone Receptor (TR)-Mediated Transcription through Native-Thyroid Hormone Response Element (TRE) Ind. Health 2010 48 115 118 10.2486/indhealth.48.115 20160415 127. Du G. Shen O. Sun H. Fei J. Lu C. Song L. Xia Y. Wang S. Wang X. Assessing Hormone Receptor Activities of Pyrethroid Insecticides and Their Metabolites in Reporter Gene Assays Toxicol. Sci. 2010 116 58 66 10.1093/toxsci/kfq120 20410157 128. Li J. Ma M. Wang Z. A Two-hybrid Yeast Assay to Quantify the Effects of Xenobiotics on Thyroid Hormone-mediated Gene Expression Environ. Toxicol. Chem. 2008 27 159 167 10.1897/07-054.1 18092857 129. Sun H. Shen O.-X. Wang X.-R. Zhou L. Zhen S. Chen X. Anti-Thyroid Hormone Activity of Bisphenol A, Tetrabromobisphenol A and Tetrachlorobisphenol A in an Improved Reporter Gene Assay Toxicol. Vitr. 2009 23 950 954 10.1016/j.tiv.2009.05.004 19457453 130. Hu W. Liu H. Sun H. Shen O. Wang X. Lam M.H.W. Giesy J.P. Zhang X. Yu H. Endocrine Effects of Methoxylated Brominated Diphenyl Ethers in Three in Vitro Models Mar. Pollut. Bull. 2011 62 2356 2361 10.1016/j.marpolbul.2011.08.037 21930287 131. Liu H. Hu W. Sun H. Shen O. Wang X. Lam M.H.W. Giesy J.P. Zhang X. Yu H. In Vitro Profiling of Endocrine Disrupting Potency of 2,2′,4,4′-Tetrabromodiphenyl Ether (BDE47) and Related Hydroxylated Analogs (HO-PBDEs) Mar. Pollut. Bull. 2011 63 287 296 10.1016/j.marpolbul.2011.04.019 21737105 132. Kojima H. Takeuchi S. Uramaru N. Sugihara K. Yoshida T. Kitamura S. Nuclear Hormone Receptor Activity of Polybrominated Diphenyl Ethers and Their Hydroxylated and Methoxylated Metabolites in Transactivation Assays Using Chinese Hamster Ovary Cells Environ. Health Perspect. 2009 117 1210 1218 10.1289/ehp.0900753 19672399 PMC2721863 133. Kar S. Sepúlveda M.S. Roy K. Leszczynski J. Endocrine-Disrupting Activity of per- and Polyfluoroalkyl Substances: Exploring Combined Approaches of Ligand and Structure Based Modeling Chemosphere 2017 184 514 523 10.1016/j.chemosphere.2017.06.024 28622647 134. Dix D.J. Houck K.A. Martin M.T. Richard A.M. Setzer R.W. Kavlock R.J. The ToxCast Program for Prioritizing Toxicity Testing of Environmental Chemicals Toxicol. Sci. 2007 95 5 12 10.1093/toxsci/kfl103 16963515 135. Richard A.M. Judson R.S. Houck K.A. Grulke C.M. Volarath P. Thillainadarajah I. Yang C. Rathman J. Martin M.T. Wambaugh J.F. ToxCast Chemical Landscape: Paving the Road to 21st Century Toxicology Chem. Res. Toxicol. 2016 29 1225 1251 10.1021/acs.chemrestox.6b00135 27367298 136. EDSP21 Work Plan. The Incorporation of In Silico Models and In Vitro High Throughput Assays in the Endocrine Disruptor Screening Program (EDSP) for Prioritization and Screening 2011 Available online: https://www.epa.gov/sites/default/files/2015-07/documents/edsp21_work_plan_summary_overview_final.pdf (accessed on 13 March 2017) 137. Rybacka A. Rudén C. Tetko I.V. Andersson P.L. Identifying Potential Endocrine Disruptors among Industrial Chemicals and Their Metabolites—Development and Evaluation of in Silico Tools Chemosphere 2015 139 372 378 10.1016/j.chemosphere.2015.07.036 26210185 138. Toropova A.P. Toropov A.A. Benfenati E. CORAL: Prediction of Binding Affinity and Efficacy of Thyroid Hormone Receptor Ligands Eur. J. Med. Chem. 2015 101 452 461 10.1016/j.ejmech.2015.07.012 26188619 139. Politi R. Rusyn I. Tropsha A. Prediction of Binding Affinity and Efficacy of Thyroid Hormone Receptor Ligands Using QSAR and Structure-Based Modeling Methods Toxicol. Appl. Pharmacol. 2014 280 177 189 10.1016/j.taap.2014.07.009 25058446 PMC4814443 140. Gaulton A. Bellis L.J. Bento A.P. Chambers J. Davies M. Hersey A. Light Y. McGlinchey S. Michalovich D. Al-Lazikani B. ChEMBL: A Large-Scale Bioactivity Database for Drug Discovery Nucleic Acids Res. 2012 40 D1100 D1107 10.1093/nar/gkr777 21948594 PMC3245175 141. Arnold L.A. Kosinski A. Estébanez-Perpiñá E. Guy R.K. Inhibitors of the Interaction of a Thyroid Hormone Receptor and Coactivators:  Preliminary Structure−Activity Relationships J. Med. Chem. 2007 50 5269 5280 10.1021/jm070556y 17918822 PMC2536611 142. Hwang J.Y. Arnold L.A. Zhu F. Kosinski A. Mangano T.J. Setola V. Roth B.L. Guy R.K. Improvement of Pharmacological Properties of Irreversible Thyroid Receptor Coactivator Binding Inhibitors J. Med. Chem. 2009 52 3892 3901 10.1021/jm9002704 19469546 PMC2753520 143. Hwang J.Y. Attia R.R. Zhu F. Yang L. Lemoff A. Jeffries C. Connelly M.C. Guy R.K. Synthesis and Evaluation of Sulfonylnitrophenylthiazoles (SNPTs) as Thyroid Hormone Receptor–Coactivator Interaction Inhibitors J. Med. Chem. 2012 55 2301 2310 10.1021/jm201546m 22324546 PMC3308170 144. Papa E. Kovarich S. Gramatica P. QSAR Prediction of the Competitive Interaction of Emerging Halogenated Pollutants with Human Transthyretin SAR QSAR Environ. Res. 2013 24 333 349 10.1080/1062936X.2013.773374 23710908 145. Kovarich S. Papa E. Li J. Gramatica P. QSAR Classification Models for the Screening of the Endocrine-Disrupting Activity of Perfluorinated Compounds SAR QSAR Environ. Res. 2012 23 207 220 10.1080/1062936X.2012.657235 22352429 146. Kovarich S. Papa E. Gramatica P. QSAR Classification Models for the Prediction of Endocrine Disrupting Activity of Brominated Flame Retardants J. Hazard. Mater. 2011 190 106 112 10.1016/j.jhazmat.2011.03.008 21454014 147. Papa E. Kovarich S. Gramatica P. QSAR Modeling and Prediction of the Endocrine-Disrupting Potencies of Brominated Flame Retardants Chem. Res. Toxicol. 2010 23 946 954 10.1021/tx1000392 20408563 148. Li F. Xie Q. Li X. Li N. Chi P. Chen J. Wang Z. Hao C. Hormone Activity of Hydroxylated Polybrominated Diphenyl Ethers on Human Thyroid Receptor-β: In Vitro and In Silico Investigations Environ. Health Perspect. 2010 118 602 606 10.1289/ehp.0901457 20439171 PMC2866673 149. OECD New Scoping Document on In Vitro and Ex Vivo Assays for the Identification of Modulators of Thyroid Hormone Signalling OECD Publishing Paris, France 2014 150. OECD Thyroid in Vitro Methods: Assessment Reports by the Thyroid Disruption Methods Expert Group: Reports Assessing the Validation Status of Assays from the EU-NETVAL Activities OECD Series on Testing and Assessment, No. 403 OECD Publishing Paris, France 2024 151. Wilkinson M.D. Dumontier M. Aalbersberg I.J. Appleton G. Axton M. Baak A. Blomberg N. Boiten J.-W. da Silva Santos L.B. Bourne P.E. The FAIR Guiding Principles for Scientific Data Management and Stewardship Sci. Data 2016 3 160018 10.1038/sdata.2016.18 26978244 PMC4792175 152. Gilbert M.E. O’Shaughnessy K.L. Axelstad M. Regulation of Thyroid-Disrupting Chemicals to Protect the Developing Brain Endocrinology 2020 161 bqaa106 10.1210/endocr/bqaa106 32615585 PMC8650774 153. Pirhadi S. Shiri F. Ghasemi J.B. Multivariate Statistical Analysis Methods in QSAR RSC Adv. 2015 5 104635 104665 10.1039/c5ra10729f 154. Schür C. Gasser L. Perez-Cruz F. Schirmer K. Baity-Jesi M. A Benchmark Dataset for Machine Learning in Ecotoxicology Sci. Data 2023 10 718 10.1038/s41597-023-02612-2 37853023 PMC10584858 155. Schür C. Schirmer K. Baity-Jesi M. On the Comparability between Studies in Predictive Ecotoxicology Comput. Toxicol. 2025 35 100367 10.1016/j.comtox.2025.100367 156. Wassenaar P.N.H. Minnema J. Vriend J. Peijnenburg W.J.G.M. Pennings J.L.A. Kienhuis A. The Role of Trust in the Use of Artificial Intelligence for Chemical Risk Assessment Regul. Toxicol. Pharmacol. 2024 148 105589 10.1016/j.yrtph.2024.105589 38403009 157. OECD Guidance Document on the Validation of (Quantitative) Structure–activity Relationship [(Q)SAR] Models OECD Publishing Paris, France 2014 158. OECD (Q)SAR Assessment Framework: Guidance for the Regulatory Assessment of (Quantitative) Structure Activity Relationship Models and Predictions OECD Series on Testing and Assessment, No. 386 OECD Publishing Paris, France 2023 159. Tropsha A. Best Practices for QSAR Model Development, Validation, and Exploitation Mol. Inform. 2010 29 476 488 10.1002/minf.201000061 27463326 160. Golbraikh A. Tropsha A. Beware of q 2 J. Mol. Graph. Model. 2002 20 269 276 10.1016/S1093-3263(01)00123-1 11858635 161. Golbraikh A. Tropsha A. Predictive QSAR Modeling Based on Diversity Sampling of Experimental Datasets for the Training and Test Set Selection Mol. Divers. 2000 5 231 243 10.1023/A:1021372108686 12549674 162. Hastie T. Tibshirani R. Friedman J. The Elements of Statistical Learning: Data Mining, Inference, and Prediction 2nd ed. Springer New York, NY, USA 2009 163. Todeschini R. Consonni V. Maiocchi A. The K Correlation Index: Theory Development and Its Application in Chemometrics Chemometr. Intell. Lab. 1999 46 13 29 10.1016/S0169-7439(98)00124-5 164. Tropsha A. Gramatica P. Gombar V.K. The Importance of Being Earnest: Validation Is the Absolute Essential for Successful Application and Interpretation of QSPR Models QSAR Comb. Sci. 2003 22 69 77 10.1002/qsar.200390007 165. Wehrens R. Putter H. Buydens L.M.C. The Bootstrap: A Tutorial Chemom. Intell. Lab. Syst. 2000 54 35 52 10.1016/S0169-7439(00)00102-7 166. Ambure P. Gajewicz-Skretna A. Cordeiro M.N.D.S. Roy K. New Workflow for QSAR Model Development from Small Data Sets: Small Dataset Curator and Small Dataset Modeler. Integration of Data Curation, Exhaustive Double Cross-Validation, and a Set of Optimal Model Selection Techniques J. Chem. Inf. Model. 2019 59 4070 4076 10.1021/acs.jcim.9b00476 31525295 167. Raste S. Singh R. Vaughan J. Nair V.N. Quantifying Inherent Randomness in Machine Learning Algorithms arXiv 2022 2206.12353 168. Li J. Zhao T. Yang Q. Du S. Xu L. A Review of Quantitative Structure–activity Relationship: The Development and Current Status of Data Sets, Molecular Descriptors and Mathematical Models Chemom. Intell. Lab. Syst. 2025 256 105278 10.1016/j.chemolab.2024.105278 169. Khan A.A. Balanced Split: A New Train-Test Data Splitting Strategy for Imbalanced Datasets arXiv 2022 10.48550/arXiv.2212.11116 2212.11116 170. An C. Park Y.W. Ahn S.S. Han K. Kim H. Lee S.-K. Radiomics Machine Learning Study with a Small Sample Size: Single Random Training-Test Set Split May Lead to Unreliable Results PLoS ONE 2021 16 e0256152 10.1371/journal.pone.0256152 34383858 PMC8360533 171. Golbraikh A. Shen M. Xiao Z. Xiao Y.-D. Lee K.-H. Tropsha A. Rational Selection of Training and Test Sets for the Development of Validated QSAR Models J. Comput. Aided Mol. Des. 2003 17 241 253 10.1023/A:1025386326946 13677490 172. Kennard R.W. Stone L.A. Computer Aided Design of Experiments Technometrics 1969 11 137 148 10.1080/00401706.1969.10490666 173. Roy K. Kar S. Ambure P. On a Simple Approach for Determining Applicability Domain of QSAR Models Chemom. Intell. Lab. Syst. 2015 145 22 29 10.1016/j.chemolab.2015.04.013 174. Netzeva T.I. Worth A.P. Aldenberg T. Benigni R. Cronin M.T.D. Gramatica P. Jaworska J.S. Kahn S. Klopman G. Marchant C.A. Current Status of Methods for Defining the Applicability Domain of (Quantitative) Structure–activity Relationships: The Report and Recommendations of ECVAM Workshop 52 Altern. Lab. Anim. 2005 33 155 173 10.1177/026119290503300209 16180989 175. Sahigara F. Mansouri K. Ballabio D. Mauri A. Consonni V. Todeschini R. Comparison of Different Approaches to Define the Applicability Domain of QSAR Models Molecules 2012 17 4791 4810 10.3390/molecules17054791 22534664 PMC6268288 176. Klingspohn W. Mathea M. ter Laak A. Heinrich N. Baumann K. Efficiency of Different Measures for Defining the Applicability Domain of Classification Models J. Cheminform. 2017 9 44 10.1186/s13321-017-0230-2 29086213 PMC5543028 177. Toropova A.P. Toropov A.A. Rallo R. Leszczynska D. Leszczynski J. Optimal Descriptor as a Translator of Eclectic Data into Prediction of Cytotoxicity for Metal Oxide Nanoparticles under Different Conditions Ecotoxicol. Environ. Saf. 2015 112 39 45 10.1016/j.ecoenv.2014.10.003 25463851 178. Todeschini R. Consonni V. Molecular Descriptors for Chemoinformatics John Wiley & Sons, Ltd. Hoboken, NJ, USA 2009 978-3-527-62876-6 179. Vasilev B. Atanasova M. A (Comprehensive) Review of the Application of Quantitative Structure–Activity Relationship (QSAR) in the Prediction of New Compounds with Anti-Breast Cancer Activity Appl. Sci. 2025 15 1206 10.3390/app15031206 180. Yap C.W. PaDEL-Descriptor: An Open Source Software to Calculate Molecular Descriptors and Fingerprints J. Comput. Chem. 2011 32 1466 1474 10.1002/jcc.21707 21425294 181. Todeschini R. Consonni V. Handbook of Molecular Descriptors WILEY-VCH Weinheim, Germany 2000 182. Mauri A. alvaDesc: A Tool to Calculate and Analyze Molecular Descriptors and Fingerprints Ecotoxicological QSARs Roy K. Springer New York, NY, USA 2020 801 820 978-1-07-160150-1 183. Mauri A. Bertola M. Alvascience: A New Software Suite for the QSAR Workflow Applied to the Blood–Brain Barrier Permeability Int. J. Mol. Sci. 2022 23 12882 10.3390/ijms232112882 36361669 PMC9655980 184. Matveieva M. Polishchuk P. Benchmarks for Interpretation of QSAR Models J. Cheminform. 2021 13 41 10.1186/s13321-021-00519-x 34039411 PMC8157407 185. Gião T. Saavedra J. Cotrina E. Quintana J. Llop J. Arsequell G. Cardoso I. Undiscovered Roles for Transthyretin: From a Transporter Protein to a New Therapeutic Target for Alzheimer’s Disease Int. J. Mol. Sci. 2020 21 2075 10.3390/ijms21062075 32197355 PMC7139926 186. Janicka M. Sztanke M. Sztanke K. Biomimetic Chromatography/QSAR Investigations in Modeling Properties Influencing the Biological Efficacy of Phenoxyacetic Acid-Derived Congeners Molecules 2025 30 688 10.3390/molecules30030688 39942792 PMC11819946 187. Charest N. Sinclair G. Eytcheson S.A. Chang D.T. Martin T.M. Lowe C.N. Paul Friedman K. Williams A.J. Combined In Vitro and In Silico Workflow to Deliver Robust, Transparent, and Contextually Rigorous Models of Bioactivity J. Chem. Inf. Model. 2025 65 4426 4441 10.1021/acs.jcim.5c00713 40273369 188. Eytcheson S.A. Zosel A.D. Olker J.H. Hornung M.W. Degitz S.J. Screening the ToxCast Chemical Libraries for Binding to Transthyretin Chem. Res. Toxicol. 2024 37 1670 1681 10.1021/acs.chemrestox.4c00215 39258767 189. Evangelista M. Chirico N. Papa E. New QSAR Models to Predict Human Transthyretin Disruption by Per- and Polyfluoroalkyl Substances (PFAS): Development and Application Toxics 2025 13 590 10.3390/toxics13070590 40711034 PMC12300718 190. Degitz S.J. Olker J.H. Denny J.S. Degoey P.P. Hartig P.C. Cardon M.C. Eytcheson S.A. Haselman J.T. Mayasich S.A. Hornung M.W. In Vitro Screening of per Toxicol. Vitr. 2024 95 105762 10.1016/j.tiv.2023.105762 38072180 PMC11081714 191. Sosnowska A. Mudlaff M. Mombelli E. Behnisch P. Zdybel S. Besselink H. Kuckelkorn J. Bulawska N. Kepka K. Kowalska D. Identification of New PFAS for Severe Interference with Thyroid Hormone Transport: A Combined in Vitro/Silico Approach J. Hazard. Mater. 2025 491 137949 10.1016/j.jhazmat.2025.137949 40120279 192. Mansouri K. Grulke C.M. Judson R.S. Williams A.J. OPERA Models for Predicting Physicochemical Properties and Environmental Fate Endpoints J. Cheminform. 2018 10 10 10.1186/s13321-018-0263-1 29520515 PMC5843579 193. Cirino T. Pinto L. Iwan M. Dougha A. Lučić B. Kraljević A. Navoyan Z. Tevosyan A. Yeghiazaryan H. Khondkaryan L. Consensus Modeling Strategies for Predicting Transthyretin Binding Affinity from Tox24 Challenge Data Chem. Res. Toxicol. 2025 38 1061 1071 10.1021/acs.chemrestox.5c00018 40371923 PMC12175157 194. Tetko I.V. Tox24 Challenge Chem. Res. Toxicol. 2024 37 825 826 10.1021/acs.chemrestox.4c00192 38769907 Figure 1 Annual distribution of QSAR models (yellow bars) and papers (purple bars). Figure 2 Count of QSAR models developed for each MIE. Figure 3 Annual distribution of QSAR models, categorised by MIE. Figure 4 Count of QSAR models based on data source type, categorised by MIE. Figure 5 Count of QSAR models based on structurally heterogenous or class-specific datasets, categorised by MIE. Figure 6 Count of QSAR models based on the modelling algorithm, categorised by MIE. Figure 7 Types of AD definitions used in the selected QSAR models (and count). toxics-13-00799-t001_Table 1 Table 1 Summary and main characteristics of selected QSARs. C: classification-based; R: regression-based; Primary: data generated as part of the same study; Secondary: data collected from the existing literature; ToxCast database: Toxicity Forecaster (ToxCast) database ( https://www.epa.gov/comptox-tools/toxicity-forecasting-toxcast https://tox21.gov/ Model ID Ref. Year MIE Algorithm C or R Chemical Class Data Source Data Source Literature Reference(s) ID_1 [ 52 2024 TBG MLR R PBBs Primary [ 52 ID_2 [ 52 2024 TBG MLR R PBBs and OH-PBBs Primary [ 52 ID_3 [ 52 2024 TBG MLR R PBBs and 2OH-PBBs Primary [ 52 ID_4 [ 52 2024 TBG MLR R PBBs, OH-PBBs, and 2OH-PBBs Primary [ 52 ID_5 [ 53 2024 TTR MLR R Heterogeneous Secondary [ 54 55 56 57 58 59 60 ID_6 [ 53 2024 TTR MLR R Heterogeneous Secondary [ 61 62 63 64 65 66 67 ID_7 [ 53 2024 TTR MLR R Heterogeneous Secondary [ 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 ID_8 [ 90 2023 TR α MLR R PFAS Primary [ 90 ID_9 [ 90 2023 TR β MLR R PFAS Primary [ 90 ID_10 [ 91 2023 TR n.s. LDA C OH-PCBs Secondary [ 92 ID_11 [ 91 2023 TR n.s. LR C OH-PCBs Secondary [ 92 ID_12 [ 93 2023 Albumin PLS R PFAS Secondary [ 94 ID_13 [ 93 2023 Albumin LDA C PFAS Secondary [ 94 ID_14 [ 93 2023 Albumin MLR R PFAS Secondary [ 94 ID_15 [ 95 2023 TSHR RF C Heterogeneous Tox21 database and secondary [ 96 97 98 ID_16 [ 51 2022 TTR RF C Heterogeneous Secondary [ 87 ID_17 [ 51 2022 TR β RF C Heterogeneous Tox21 database * [ 99 100 ID_18 [ 51 2022 TR β RF C Heterogeneous Tox21 database * [ 99 100 ID_19 [ 51 2022 TSHR RF C Heterogeneous Tox21 database * [ 99 100 ID_20 [ 51 2022 TSHR RF C Heterogeneous Tox21 database * [ 99 100 ID_21 [ 51 2022 TRHR RF C Heterogeneous Tox21 database * [ 99 100 ID_22 [ 51 2022 DIO1 RF C Heterogeneous ToxCast database ** [ 101 ID_23 [ 51 2022 DIO2 RF C Heterogeneous ToxCast database ** [ 101 ID_24 [ 51 2022 DIO3 RF C Heterogeneous ToxCast database ** [ 101 ID_25 [ 51 2022 NIS RF C Heterogeneous ToxCast database ** [ 102 ID_26 [ 51 2022 TPO RF C Heterogeneous ToxCast database ** [ 103 ID_27 [ 104 2022 TTR RF C Heterogeneous ChEMBL database *** [ 105 ID_28 [ 104 2022 TR α RF C Heterogeneous ChEMBL database *** [ 105 ID_29 [ 104 2022 TR β RF C Heterogeneous ChEMBL database *** [ 105 ID_30 [ 104 2022 NIS RF C Heterogeneous ChEMBL database *** [ 105 ID_31 [ 106 2022 TSHR RF C Heterogeneous Tox21 database  https://tripod.nih.gov/tox21/assays/ ID_32 [ 106 2022 TSHR RF C Heterogeneous Tox21 database  https://tripod.nih.gov/tox21/assays/ ID_33 [ 106 2022 TSHR XGB C Heterogeneous Tox21 database  https://tripod.nih.gov/tox21/assays/ ID_34 [ 106 2022 TSHR LR C Heterogeneous Tox21 database  https://tripod.nih.gov/tox21/assays/ ID_35 [ 106 2022 TSHR XGB R Heterogeneous Tox21 database  https://tripod.nih.gov/tox21/assays/ ID_36 [ 107 2022 TPO XGB C Heterogeneous ToxCast database and secondary ** [ 103 108 109 110 111 ID_37 [ 107 2022 TPO Hard Voting C Heterogeneous ToxCast database and secondary ** [ 103 108 109 110 111 ID_38 [ 107 2022 TPO Soft Voting C Heterogeneous ToxCast database and secondary ** [ 103 108 109 110 111 ID_39 [ 112 2022 TR β MLR R PCNs Primary [ 112 ID_40 [ 113 2023 TR β RF C Heterogeneous Tox21 database National Center for Biotechnology Information. PubChem Database. Source = 824, AID = 743067, https://pubchem.ncbi.nlm.nih.gov/bioassay/743067 ID_41 [ 59 2021 TTR MLR R Halogenated phenols and thiophenols Primary and Secondary [ 57 59 ID_42 [ 114 2021 TTR kNN C Heterogeneous Secondary [ 54 55 56 57 58 59 61 62 64 68 70 71 72 73 75 78 79 80 81 82 83 84 85 86 87 88 89 115 116 117 118 ID_43 [ 114 2021 TTR kNN C Heterogeneous Secondary [ 54 55 56 57 58 59 61 62 64 68 70 71 72 73 75 78 79 80 81 82 83 84 85 86 87 88 89 115 116 117 118 ID_44 [ 114 2021 TTR kNN C Heterogeneous Secondary [ 54 55 56 57 58 59 61 62 64 68 70 71 72 73 75 78 79 80 81 82 83 84 85 86 87 88 89 115 116 117 118 ID_45 [ 114 2021 TTR kNN C Heterogeneous Secondary [ 54 55 56 57 58 59 61 62 64 68 70 71 72 73 75 78 79 80 81 82 83 84 85 86 87 88 89 115 116 117 118 ID_46 [ 114 2021 TTR kNN C Heterogeneous Secondary [ 54 55 56 57 58 59 61 62 64 68 70 71 72 73 75 78 79 80 81 82 83 84 85 86 87 88 89 115 116 117 118 ID_47 [ 114 2021 TTR MLR R Heterogeneous Secondary [ 61 70 71 72 73 75 78 79 80 81 82 83 84 85 86 87 88 ID_48 [ 114 2021 TTR MLR R Heterogeneous Secondary [ 57 58 59 ID_49 [ 114 2021 TTR kNN R Heterogeneous Secondary [ 61 70 71 72 73 75 78 79 80 81 82 83 84 85 86 87 88 ID_50 [ 114 2021 TTR kNN R Heterogeneous Secondary [ 57 58 59 ID_51 [ 119 2021 TR n.s. RF C Heterogeneous ToxCast database Cited as ToxCast and Tox21 Summary Files for invitroDBv3.2, U.S. EPA, Washington, DC. ID_52 [ 119 2021 TSHR RF C Heterogeneous ToxCast database Cited as ToxCast and Tox21 Summary Files for invitroDBv3.2, U.S. EPA, Washington, DC. ID_53 [ 119 2021 TSHR NN C Heterogeneous ToxCast database Cited as ToxCast and Tox21 Summary Files for invitroDBv3.2, U.S. EPA, Washington, DC. ID_54 [ 119 2021 TPO XGB C Heterogeneous ToxCast database ** Cited as ToxCast and Tox21 Summary Files for invitroDBv3.2, U.S. EPA, Washington, DC. and [ 103 ID_55 [ 119 2021 TRHR SVM C Heterogeneous ToxCast database Cited as ToxCast and Tox21 Summary Files for invitroDBv3.2, U.S. EPA, Washington, DC. ID_56 [ 119 2021 DIO1 SVM C Heterogeneous ToxCast database ** Cited as ToxCast and Tox21 Summary Files for invitroDBv3.2, U.S. EPA, Washington, DC. and [ 101 ID_57 [ 119 2021 DIO2 SVM C Heterogeneous ToxCast database ** [ 101 ID_58 [ 119 2021 DIO3 NN C Heterogeneous ToxCast database ** [ 101 ID_59 [ 119 2021 NIS LR C Heterogeneous ToxCast database ** Cited as ToxCast and Tox21 Summary Files for invitroDBv3.2, U.S. EPA, Washington, DC. and [ 102 ID_60 [ 120 2021 TPO kNN C Heterogeneous ToxCast database ** [ 103 121 ID_61 [ 120 2021 TPO RF C Heterogeneous ToxCast database ** [ 103 121 ID_62 [ 57 2019 TTR MLR R Phenolic DBPs Primary [ 57 ID_63 [ 122 2018 TR β SVM C PCBs Primary [ 122 ID_64 [ 122 2018 TR β LDA C PCBs Primary [ 122 ID_65 [ 123 2018 TR n.s. SVM C PCBs and PBDEs Secondary [ 124 125 126 127 128 129 130 131 132 ID_66 [ 133 2017 TTR LDA C PFCs Secondary [ 82 ID_67 [ 133 2017 TTR MLR R PFCs Secondary [ 82 ID_68 [ 121 2017 TPO PLR C Heterogeneous ToxCast database ** [ 103 134 135 136 ID_69 [ 121 2017 TPO PLR C Heterogeneous ToxCast database ** [ 103 134 135 136 ID_70 [ 87 2015 TTR kNN C Heterogeneous Secondary [ 88 ID_71 [ 137 2015 TTR ASNN C Heterogeneous Secondary [ 88 ID_72 [ 138 2015 TR β Monte Carlo R Heterogeneous Secondary [ 139 ID_73 [ 138 2015 TR β Monte Carlo R Heterogeneous Secondary [ 139 ID_74 [ 138 2015 TR β Monte Carlo R Heterogeneous Secondary [ 139 ID_75 [ 139 2014 TR β RF R Heterogeneous ChEMBL database *** [ 140 ID_76 [ 139 2014 TR β RF R Heterogeneous Secondary [ 141 142 143 ID_77 [ 139 2014 TR β RF C Heterogeneous ChEMBL database *** [ 140 ID_78 [ 144 2013 TTR kNN C PFCs and BFRs Secondary [ 78 80 82 ID_79 [ 144 2013 TTR MLR R PFCs and BFRs Secondary [ 78 80 82 ID_80 [ 145 2012 TTR kNN C PFCs Secondary [ 82 ID_81 [ 145 2012 TTR kNN C PFCs Secondary [ 82 ID_82 [ 145 2012 TTR kNN C PFCs Secondary [ 82 ID_83 [ 145 2012 TTR kNN C PFCs Secondary [ 82 ID_84 [ 146 2011 TTR kNN C BFRs Secondary [ 78 80 ID_85 [ 147 2010 TTR MLR R BFRs Secondary [ 78 80 ID_86 [ 148 2010 TR β PLS R OH-PBDEs Primary [ 148 * Tox21 served as a data source but it was cited as [ 99 100 101 102 103 134 135 136 105 140 toxics-13-00799-t002_Table 2 Table 2 Summary of the molecular descriptors selected by each QSAR, grouped by MIE. MIE Ref. Model ID Chemical Class Descriptors Software TTR [ 53 ID_5 Heterogeneous AATSC1c; PubchemFP381; ATSC2s; nX PaDEL [ 180 ID_6 Heterogeneous naasC; SpMin4_Bhs; VE3_Dzs PaDEL [ 180 ID_7 Heterogeneous PubchemFP590; SpMax1_Bhe; PubchemFP18; GATS5c; AATSC1e; AATS4v PaDEL [ 180 [ 51 ID_16 Heterogeneous Calculation of 119 RDKit chemical descriptors RDKit: Open-source cheminformatics. http://www.rdkit.org [ 104 ID_27 Heterogeneous Calculation of extended fingerprints with a KNIME implementation of the CDK toolkit CDK toolkit: https://cdk.github.io/ [ 59 ID_41 Halogenated phenols and thiophenols logDOW(pH = 7.40); ω adj adj Marvin Sketch 15.6.29.0, 2015: ChemAxon, http://www.chemaxon.com http://gsgrid.codeplex.com [ 114 ID_42 Heterogeneous V sadj adj adj Marvin Sketch 15.6.29.0, 2015: ChemAxon, http://www.chemaxon.com http://gsgrid.codeplex.com ID_43 Heterogeneous V sadj adj Marvin Sketch 15.6.29.0, 2015: ChemAxon, http://www.chemaxon.com http://gsgrid.codeplex.com ID_44 Heterogeneous V sadj Marvin Sketch 15.6.29.0, 2015: ChemAxon, http://www.chemaxon.com http://gsgrid.codeplex.com ID_45 Heterogeneous nArOH; V sadj adj Marvin Sketch 15.6.29.0, 2015: ChemAxon, http://www.chemaxon.com http://gsgrid.codeplex.com ID_46 Heterogeneous V sadj Marvin Sketch 15.6.29.0, 2015: ChemAxon, http://www.chemaxon.com http://gsgrid.codeplex.com ID_47 Heterogeneous C-040; nCq; H-050; O-058; Πadj; O-056 Marvin Sketch 15.6.29.0, 2015: ChemAxon, http://www.chemaxon.com http://gsgrid.codeplex.com ID_48 Heterogeneous log DOW(pH = 7.40); nArOH; O-057; nArNO2 Marvin Sketch 15.6.29.0, 2015: ChemAxon, http://www.chemaxon.com http://gsgrid.codeplex.com ID_49 Heterogeneous E HOMO-adj adj Marvin Sketch 15.6.29.0, 2015: ChemAxon, http://www.chemaxon.com http://gsgrid.codeplex.com ID_50 Heterogeneous log DOW(pH = 7.40); nArOH Marvin Sketch 15.6.29.0, 2015: ChemAxon, http://www.chemaxon.com http://gsgrid.codeplex.com [ 57 ID_62 Phenolic DBPs log D; dipole adj Marvin Sketch 15.6.29.0, 2015: ChemAxon, http://www.chemaxon.com [ 133 ID_66 PFCs Me; nCsp2; H-050 DRAGON Version 6.0, 2011, http://www.talete.mi.it/ ID_67 PFCs IC3; ∑β’ S DRAGON Version 6.0, 2011, http://www.talete.mi.it/ [ 87 ID_70 Heterogeneous Based on the following 14 molecular descriptors: TPSA; a_don; a_nOH; nX; PEOE_VSA_FNEG; PEOE_RPC-; density; PEOE_RPC+; diameter; PEOE_PC+; vsa_hyd; KierFlex; logP(o/w); opr_brigid Molecular Operating Environment (MOE), 2013.08; Chemical Computing Group Inc.: Montreal, QC, Canada, 2015 [ 137 ID_71 Heterogeneous nArOH; nHDon; nCb-; nCRX3; nCH2RX; ALogPS_logP; nArOR; nCrq; nCq; nCp; nCs; nCbH DRAGON version 6 [ 181 [ 144 ID_78 PFCs and BFRs nArOH; F03(Br..Br); HATS6m DRAGON Version 5.5 for Windows, Talete srl, Milan, Italy, 2007 ID_79 PFCs and BFRs R5u; F07[C-O]; nArOH DRAGON Version 5.5 for Windows, Talete srl, Milan, Italy, 2007 [ 145 ID_80 PFCs AMW; HATS6m DRAGON Version 5.5 for Windows, Talete srl, Milan, Italy, 2007 ID_81 PFCs nH; HATS6m DRAGON Version 5.5 for Windows, Talete srl, Milan, Italy, 2007 ID_82 PFCs nH; F06[C-O] DRAGON Version 5.5 for Windows, Talete srl, Milan, Italy, 2007 ID_83 PFCs T(F..F); HATS6m DRAGON Version 5.5 for Windows, Talete srl, Milan, Italy, 2007 [ 146 ID_84 BFRs DISPe; nArOH DRAGON Version 5.5 for Windows, Talete srl, Milan, Italy, 2008 [ 147 ID_85 BFRs qpmax; MATS6v DRAGON Version 5.5 for Windows, Talete srl, Milan, Italy TR α [ 90 ID_8 PFAS X%; ICR AlvaDesc [ 182 [ 104 ID_28 Heterogeneous Calculation of extended fingerprints with a KNIME implementation of the CDK toolkit CDK toolkit: https://cdk.github.io/ TR β [ 90 ID_9 PFAS X%; TPC AlvaDesc [ 182 [ 51 ID_17 Heterogeneous Calculation of 119 RDKit chemical descriptors RDKit: Open-source cheminformatics. http://www.rdkit.org ID_18 Heterogeneous Calculation of 119 RDKit chemical descriptors RDKit: Open-source cheminformatics. http://www.rdkit.org [ 104 ID_29 Heterogeneous Calculation of extended fingerprints with a KNIME implementation of the CDK toolkit CDK toolkit: https://cdk.github.io/ [ 112 ID_39 PCNs E LUMO xx yy yz + ow Cl o Gaussian 09 software. [ 113 ID_40 Heterogeneous Use of RDKit descriptors RDKit: Open-source cheminformatics. http://www.rdkit.org [ 122 ID_63 PCBs logK ow EPI Suite, version 4.1 (US EPA, 2012); DRAGON ID_64 PCBs logK ow EPI Suite, version 4.1 (US EPA, 2012); DRAGON [ 138 ID_72 Heterogeneous Molecular optimal descriptor DCW(3, 10) CORAL software: http://www.insilico.eu/coral ID_73 Heterogeneous Molecular optimal descriptor DCW(1, 3) CORAL software: http://www.insilico.eu/coral ID_74 Heterogeneous Molecular optimal descriptor DCW(3, 4) CORAL software: http://www.insilico.eu/coral [ 139 ID_75 Heterogeneous Thirty-five most statistically significant descriptors were identified: F04[N-Cl]; EEig03d; F06[C-Cl]; EEig08r; GATS7e; nArOH; EEig07r; EEig05d; EEig06d; TPSA(Tot); GGI1; BEHp4; SPI; C-026; ESpm01d; nCb-; Hy; GATS8v; T(O..O); BLTA96; IVDE; MATS1e; Ms; GATS6e; MATS6m; MATS5m; MATS2e; MATS1p; MATS8v; MATS6e; MATS8p; X4Av; X2Av; X0Av; Jhetp Dragon software (version 5.4; Talete s.r.l., Milan, Italy) ID_76 Heterogeneous Twenty-seven most statistically significant descriptors were identified: F08[C-Cl]; T(N..Cl); C-006; EEig06d; SEigm; ATS3m; ATS4m; BEHm6; T(O..Cl); ATS5m; ATS7m; BEHm7; Uindex; EEig04d; BELe3; EEig08d; HVcpx; PHI; BELm3; GGI8; BIC5; BEHml; JGI6; JGI7; BELml; GATS3p; VEA2 Dragon software (version 5.4; Talete s.r.l., Milan, Italy) ID_77 Heterogeneous Thirty most statistically significant descriptors were identified: B05[O-O]; EEig03d; nArOH; GGI7; EEig05d; PW2; F04[C-N]; C-026; ESpm01d; AAC; GATS8p; Hy; PCR; GATS8v; F05[O-O]; O-057; MATS5v; IVDE; MATS1e; Ms; MATS5p; ARR; MATS5m; PHI; MATS8v; GATS1e; MATS8p; RBF; Jhetp; X1A Dragon software (version 5.4; Talete s.r.l., Milan, Italy) [ 148 ID_86 OH-PBDEs nBr; logKow; I A LUMO 2 EPI Suite, version 4.0 (U.S. Environmental Protection Agency 2009); Gaussian 03 programs; DRAGON [ 181 TR n.s. [ 91 ID_10 OH-PCBs RDF35u; RDF55u; RDF85u; RDF65v PaDEL [ 180 ID_11 OH-PCBs RDF35u; RDF55u; RDF85u; RDF65v PaDEL [ 180 [ 119 ID_51 Heterogeneous Calculation of count-based Morgan fingerprints with a radius of 2 bonds and a length of 2048 bits, and of all 119 one-dimensional and two-dimensional RDKit chemical descriptors RDKit: Open-source cheminformatics. http://www.rdkit.org [ 123 ID_65 PCBs; PBDEs DELS; MAXDN; Mor31v; Ms; RDF040e; BER DRAGON 5.5 for Windows, Talete srl, Milan, Italy, 2008 TSHR [ 106 ID_31 Heterogeneous Thirty-nine descriptors were used, here sorted by their weight in descending order (top seven descriptors were used to build Model ID_32.): Sw < 0.1 mg/mL probability; LogSw; LogD(pH = 7.4); LogL; S; R2; E; LogS(pH = 7.4); logP; Solubility class; AAB/LogP; McGowan Volume; MW; Pi2; LogS(pH = 7.4)-; L; V; Sw < 1 mg/mL probability; No Of H Donors; Acid_pKa; LogSwLo; Sw > 10 mg/mL probability; Abraham’s Alfa; NoOfRotBonds; A; Bo; 0Form; B; Form+; No Of H Acceptors; LogSwHi; Rel_pKa_ac; Base_pKa; Abraham’s BetaH; Ertl TPSA; Form-; Rule of 5; Rel_pKa_bs; Form± KOWWIN program (EPI Suite version 4.1.1, https://www.epa.gov/tsca-screening-tools/epi-suitetm-estimation-program-interface ID_32  Sw < 0.1 mg/mL probability; LogSw; LogD(pH = 7.4); LogL; S; R2; E KOWWIN program (EPI Suite version 4.1.1, https://www.epa.gov/tsca-screening-tools/epi-suitetm-estimation-program-interface ID_33  The use of thirty-nine descriptors was reported in the study KOWWIN program (EPI Suite version 4.1.1, https://www.epa.gov/tsca-screening-tools/epi-suitetm-estimation-program-interface ID_34  LogS, LogP, E KOWWIN program (EPI Suite version 4.1.1, https://www.epa.gov/tsca-screening-tools/epi-suitetm-estimation-program-interface ID_35  Forty-one descriptors were used, here sorted by their weight in descending order: Base_pKa; V; Abraham’s Alfa; 0Form; AAB/LogP; CDocker Energy; NoOfRotBonds; S; LogSwLo; LogSwHi; CDocker Interaction Energy; Rel_pKa_bs; R2; E; LogD(pH = 7.4); LogS(pH = 7.4)-; Sw < 0.1 mg/mL probability; A; Sw > 10 mg/mL probability; Ertl TPSA; MW; logP; LogSw; Pi2; Abraham’s BetaH; Solubility class; B; LogL; Sw < 1 mg/mL probability; L; Acid_pKa; Rel_pKa_ac; No Of H Acceptors; Bo; No Of H Donors; McGowan Volume; LogS(pH = 7.4); Form+; Form-; Form±; Rule of 5 KOWWIN program (EPI Suite version 4.1.1, https://www.epa.gov/tsca-screening-tools/epi-suitetm-estimation-program-interface [ 51 ID_19 Heterogeneous Calculation of 119 RDKit chemical descriptors RDKit: Open-source cheminformatics. http://www.rdkit.org ID_20 Heterogeneous Calculation of 119 RDKit chemical descriptors RDKit: Open-source cheminformatics. http://www.rdkit.org [ 119 ID_52 Heterogeneous Calculation of count-based Morgan fingerprints with a radius of 2 bonds and a length of 2048 bits, and of all 119 one-dimensional and two-dimensional RDKit chemical descriptors RDKit: Open-source cheminformatics. http://www.rdkit.org ID_53 Heterogeneous Calculation of count-based Morgan fingerprints with a radius of 2 bonds and a length of 2048 bits, and of all 119 one-dimensional and two-dimensional RDKit chemical descriptors RDKit: Open-source cheminformatics. http://www.rdkit.org [ 95 ID_15 Heterogeneous Top twenty FPs with positive SHAP (Shapley additive explanation) values: PubchemFP12, PubchemFP259, PubchemFP257, PubchemFP256, PubchemFP628, PubchemFP185, PubchemFP258, PubchemFP2, PubchemFP143, PubchemFP146, PubchemFP656, PubchemFP633, PubchemFP150, PubchemFP464, PubchemFP442, PubchemFP607, PubchemFP613, PubchemFP549, PubchemFP153, PubchemFP418 PaDEL [ 180 TPO [ 51 ID_26 Heterogeneous Calculation of 119 RDKit chemical descriptors RDKit: Open-source cheminformatics. http://www.rdkit.org [ 107 ID_36 Heterogeneous Use of Atom Pair Count (APC) fingerprints PaDEL [ 180 ID_37 Heterogeneous Use of Atom Pair Count (APC) fingerprints PaDEL [ 180 ID_38 Heterogeneous Use of Atom Pair Count (APC) fingerprints PaDEL [ 180 [ 119 ID_54 Heterogeneous Calculation of count-based Morgan fingerprints with a radius of 2 bonds and a length of 2048 bits, and of all 119 one-dimensional and two-dimensional RDKit chemical descriptors RDKit: Open-source cheminformatics. http://www.rdkit.org [ 120 ID_60 Heterogeneous The top twenty ranked descriptors identified in the kNN model: GATS1e; NArOH; CATS2D_02_DL; MATS1e; MATS1s; C-026; CATS2D_03_DL; B10 [C-C]; MATS1m; ‘SpMax2_Bh(s); MATS1p; nCb-; NX; Uc; ‘P_VSA_i_1’; SpMAD_B(v); NCbH; GATS1s; MLOGP; Eta_C_A’ DRAGON v7.0.8., 2017: https://chm.kode-solutions.net/products_dragon.php ID_61 Heterogeneous Based on 160 molecular descriptors DRAGON v7.0.8., 2017: https://chm.kode-solutions.net/products_dragon.php [ 121 ID_68 Heterogeneous Based on scaffolds and structural features Leadscope Predictive Data Miner (LPDM), Leadscope, Inc., (2016): http://www.leadscope.com/ ID_69 Heterogeneous The top ten most common structural features linked to active compounds: benzene, 1,3-dihydroxy-; Scaffold 288; benzene, 1-alkyl-,4-amino(NH2)-; benzene, 1,2-dihydroxy-; Scaffold 297; alcohol, alkenyl-; Scaffold 576; benzene, 1-alkoxy-,4-hydroxy-; Scaffold 306; Scaffold 574. Leadscope Predictive Data Miner (LPDM), Leadscope, Inc., (2016): http://www.leadscope.com/ TBG [ 52 ID_1 PBBs Molecular Weight (MW); Critical temperature (CT); Critical pressure (CP); Topological diameter (TD) PaDEL [ 180 ID_2 PBBs and OH-PBBs Quadrupole moment Q yy yy − PaDEL [ 180 ID_3 PBBs and 2OH-PBBs q − PaDEL [ 180 ID_4 PBBs, OH-PBBs, and 2OH-PBBs q − PaDEL [ 180 NIS [ 51 ID_25 Heterogeneous Calculation of 119 RDKit chemical descriptors RDKit: Open-source cheminformatics. http://www.rdkit.org [ 104 ID_30 Heterogeneous Calculation of extended fingerprints with a KNIME implementation of the CDK toolkit CDK toolkit: https://cdk.github.io/ [ 119 ID_59 Heterogeneous Calculation of count-based Morgan fingerprints with a radius of 2 bonds and a length of 2048 bits, and of all 119 one-dimensional and two-dimensional RDKit chemical descriptors RDKit: Open-source cheminformatics. http://www.rdkit.org Albumin [ 93 ID_12 PFAS PDI; GATS8v; MATS8m; QED AlvaDesc 2.0.16 [ 183 ID_13 PFAS Eig12_AEA(bo); DECC; X4A AlvaDesc 2.0.16 [ 183 ID_14 PFAS QED; PDI; GATS8v; MATS8m AlvaDesc 2.0.16 [ 183 DIO1 [ 51 ID_22 Heterogeneous Calculation of 119 RDKit chemical descriptors RDKit: Open-source cheminformatics. http://www.rdkit.org [ 119 ID_56 Heterogeneous Calculation of count-based Morgan fingerprints with a radius of 2 bonds and a length of 2048 bits, and of all 119 one-dimensional and two-dimensional RDKit chemical descriptors RDKit: Open-source cheminformatics. http://www.rdkit.org DIO2 [ 51 ID_23 Heterogeneous Calculation of 119 RDKit chemical descriptors RDKit: Open-source cheminformatics. http://www.rdkit.org [ 119 ID_57 Heterogeneous Calculation of count-based Morgan fingerprints with a radius of 2 bonds and a length of 2048 bits, and of all 119 one-dimensional and two-dimensional RDKit chemical descriptors RDKit: Open-source cheminformatics. http://www.rdkit.org DIO3 [ 51 ID_24 Heterogeneous Calculation of 119 RDKit chemical descriptors RDKit: Open-source cheminformatics. http://www.rdkit.org [ 119 ID_58 Heterogeneous Calculation of count-based Morgan fingerprints with a radius of 2 bonds and a length of 2048 bits, and of all 119 one-dimensional and two-dimensional RDKit chemical descriptors RDKit: Open-source cheminformatics. http://www.rdkit.org TRHR [ 51 ID_21 Heterogeneous Calculation of 119 RDKit chemical descriptors RDKit: Open-source cheminformatics. http://www.rdkit.org [ 119 ID_55 Heterogeneous Calculation of count-based Morgan fingerprints with a radius of 2 bonds and a length of 2048 bits, and of all 119 one-dimensional and two-dimensional RDKit chemical descriptors RDKit: Open-source cheminformatics. http://www.rdkit.org toxics-13-00799-t003_Table 3 Table 3 Summary and main characteristics of relevant QSARs published from January to July 2025. C: classification-based; R: regression-based; Primary: data generated as part of the same study; Secondary: data collected from the existing literature. Model ID Reference Year MIE Algorithm C or R Chemical Class Data Source Data Source Literature Reference(s) ID_2025_1 [ 186 2025 Albumin MLR R Phenoxyacetic acid-derived congeners Primary [ 186 ID_2025_2 [ 187 2025 TTR RF C Heterogenous Secondary [ 188 ID_2025_3 [ 189 2025 TTR LDA C PFAS Secondary [ 190 ID_2025_4 [ 189 2025 TTR MLR R PFAS Secondary [ 190 ID_2025_5 [ 191 2025 TTR DTC C PFAS Primary [ 191 ID_2025_6 [ 191 2025 TTR MLR R PFAS Primary [ 191 toxics-13-00799-t004_Table 4 Table 4 Summary of relevant QSARs published from January to July 2025 and selected molecular descriptors, grouped by MIE. MIE Ref. Model ID Chemical class Descriptors Software TTR [ 187 ID_2025_2 Heterogenous Thirty-one descriptors sorted by permutation importance: CrippenLogP; ATSC3c; ATSC5c; C1SP3; ETA_BetaP_s; naAromAtom; ZMIC1; ATSC4m; ZMIC5; ATSC4c; hmin; hmax; ATSC2m; ATSC5m; ETA_Beta_ns_d; ATSC0m; VE1_DzZ; C1SP2; ZMIC2; ATSC1m; nHBAcc; ZMIC3; ATSC3m; ATSC2c; ETA_dAlpha_A; ETA_Shape_Y; ATSC0c; maxdssC; ZMIC4; nHBDon; ATSC1c PaDEL descriptors from OPERA software v2.9 [ 192 [ 189 ID_2025_3 PFAS GATS3e; ATSC6p; GATS8m; MIC2 PaDEL [ 180 [ 189 ID_2025_4 PFAS piPC5; GGI9; AATSC0e PaDEL [ 180 [ 191 ID_2025_5 PFAS SM4_D; GATS3m AlvaDesc [ 182 [ 191 ID_2025_6 PFAS AMW; GATS7p; B10[F-F] AlvaDesc [ 182 Albumin [ 186 ID_2025_1 Phenoxyacetic acid-derived congeners logkBMC; α; sum of HBD and HBA ACD/Percepta software, version 1994–2012 (ACD/Labs, Advanced Chemistry Development, Inc., Toronto, ON, Canada) ",
  "metadata": {
    "Title of this paper": "Tox24 Challenge",
    "Journal it was published in:": "Toxics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474327/"
  }
}