{
  "title": "Paper_434",
  "abstract": "pmc J Clin Invest J Clin Invest 120 jcinvest J Clin Invest The Journal of Clinical Investigation 0021-9738 1558-8238 American Society for Clinical Investigation PMC12483559 PMC12483559.1 12483559 12483559 41031883 10.1172/JCI188349 188349 1 Review Series Gut complement system: a new frontier in microbiota-host communication and intestinal homeostasis Tian Xianbin tianx@wustl.edu 1 Zhang Lan 1 Qian Xinyang x.qian@wustl.edu 1 Peng Yangqing pyangqing@email.wustl.edu 1 2 Chen Fengyixin c.fengyixin@wustl.edu 1 2 Bengtson Sarah bengtson@wustl.edu 1 2 Wang Zhiqing zhiqing@wustl.edu 1 Wu Meng mengwu@wustl.edu 1 1 2 Address correspondence to: Meng Wu, Department of Molecular Microbiology, Washington University School of Medicine, MSC-8230-16-09, 660 S. Euclid Avenue, St. Louis, Missouri 63110, USA. Email: mengwu@wustl.edu 1 10 2025 1 10 2025 135 19 498024 e188349 01 10 2025 01 10 2025 02 10 2025 © 2025 Tian et al. 2025 Tian et al. https://creativecommons.org/licenses/by/4.0/ This work is licensed under the Creative Commons Attribution 4.0 International License. To view a copy of this license, visit http://creativecommons.org/licenses/by/4.0/ This article is available online at https://www.jci.org/articles/view/188349 The gut microbiota plays a crucial role in maintaining intestinal homeostasis and influencing various aspects of host physiology, including immune function. Recent advances have highlighted the emerging importance of the complement system, particularly the C3 protein, as a key player in microbiota-host interactions. Traditionally known for its role in innate immunity, the complement system is now recognized for its interactions with microbial communities within the gut, where it promotes immune tolerance and protects against enteric infections. This Review explores the gut complement system as a possibly novel frontier in microbiota-host communication and examines its role in shaping microbial diversity, modulating inflammatory responses, and contributing to intestinal health. We discuss the dynamic interplay between microbiota-derived signals and complement activation, with a focus on the C3 protein and its effect on both the gut microbiome and host immune responses. Furthermore, we highlight the therapeutic potential of targeting complement pathways to restore microbial balance and treat diseases such as inflammatory bowel disease and colorectal cancer. By elucidating the functions of the gut complement system, we offer insights into its potential as a target for microbiota-based interventions aimed at restoring intestinal homeostasis and preventing disease. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction The gastrointestinal tract is the body’s most immunologically active and microbially dense environment, and it demands finely tuned mechanisms to maintain homeostasis and defend against pathogens. The complement system, which has been classically recognized as a sentinel of the innate immune response, is increasingly being appreciated for its nuanced roles within the local environment. Complement components are not confined to systemic circulation but can be locally produced and activated at mucosal sites, including the gastrointestinal tract. Within this unique niche, the gut complement system orchestrates a delicate balance among microbial surveillance, barrier integrity, and immune modulation, positioning it as a critical yet underexplored mediator of microbiota-host crosstalk. In this Review, we discuss recent advances in our understanding of local complement production with a focus on the gut mucosa, while drawing comparisons to complement activity at other mucosal sites. Local biosynthesis and unique adaptations of intestinal complement The systemic complement system comprises over fifty soluble proteins, most of which are synthesized by hepatocytes in the liver ( 1 2 3 6 7 8 9 10 Among complement components, C3 has received particular attention for its role in the intestine because of its central role in the complement system. C3 production has been detected as early as 11 weeks of gestation in human fetal colon cultures ( 11 12 13 14 15 15 These observations have largely been limited to in vitro, ex vivo, or inflammatory models, and the cellular sources of C3 under homeostatic conditions in the gut remained poorly defined. Our recent work, utilizing flow cytometry and single-cell RNA sequencing (scRNA-Seq) in C3-tdTomato reporter mice, demonstrated that epithelial cells, myeloid populations, and stromal cells all express C3 in the colon during homeostasis ( 16 In addition to C3, IEC lines have been shown to produce other early complement components such as C4 and factor B ( 13 14 14 + 17 18 Complement proteins, particularly C3, have also been detected directly in the intestinal lumen. C3 was identified in luminal aspirates from patients with small intestinal infections ( 18 19 16 Functionally, C3b deposition on mucosa-associated bacteria has been demonstrated during DSS-induced colitis ( 15 16 Citrobacter rodentium E. coli 16 Interestingly, complement-mediated defense in the gut can also be influenced by other sources. For example, Xu et al. demonstrated that complement proteins in maternal milk can suppress Gram-positive bacteria like Staphylococcus lentus 20 10 16 10 21 22 Table 1 Collectively, the intestinal complement system displays unique adaptations ( Figure 1 23 These distinct features underscore the evolutionary balance the host has achieved between immune defense and tolerance. Continued investigation is essential to unravel the precise molecular pathways by which the gut complement system interfaces with the microbiota, maintains homeostasis, and contributes to disease pathogenesis. Complement receptor expression in the intestine Complement receptors are typically categorized into two primary groups: anaphylatoxin receptors and opsonin receptors. Anaphylatoxin receptors include C3a receptor (C3aR), C5a receptor 1 (C5aR1/CD88), and C5a receptor 2 (C5aR2), while opsonin receptors include CR1 (CD35), CR2 (CD21), CR3 (CD11b/CD18), CR4 (CD11c/CD18), and CRIg (complement receptor of the immunoglobulin superfamily, also known as V-set and immunoglobulin domain-containing 4 [VSIG4]) ( 24 Table 2 25 27 + + 27 28 27 29 30 15 + 31 In contrast to the widespread expression of C3aR in the LP, C5aR1 expression is more restricted, appearing predominantly on LP macrophages in reporter mice ( 26 25 32 + 33 15 34 35 36 37 The opsonin receptors are broadly expressed on immune cells, including neutrophils (CR1, CR3, CR4), macrophages (CR1, CR3, CR4, CRIg), DCs (CR1, CR3, CR4, CRIg), B cells (CR1, CR2, CR4), and T cells (CR1) ( 24 38 39 + 39 + 40 41 + 42 42 Complement regulatory proteins in the gut The expression patterns of complement regulatory proteins (CRPs), including CD55 (decay-accelerating factor [DAF]), CD46 (membrane cofactor protein [MCP]), and CD59 (protectin), have been extensively characterized in both normal and diseased gastrointestinal tissues through immunohistochemical analysis of human tissue samples ( 43 45 Table 3 Under normal conditions, CD55 exhibits restricted apical expression in the small intestinal crypt epithelium but is absent from other regions of the small intestine as well as from the gastric and colonic segments in these samples. However, CD55 expression is significantly upregulated in inflamed tissues, such as those in CD, ulcerative colitis (UC), and celiac disease ( 43 46 44 47 14 48 51 48 49 52 53 CD59 exhibits weak apical expression in gastric pit and small intestinal villus/crypt epithelia but is strongly expressed in the normal colon. During inflammation, CD59 expression increases in the stomach and small intestine but remains unchanged or reduced in the colons of patients with UC and CD ( 43 54 44 45 55 55 CD46 is constitutively expressed basolaterally across the gut epithelium, with stable expression levels during inflammation ( 43 44 45 51 E coli 56 Current knowledge regarding CRPs in the gut relies largely on human biopsies and cell lines. To better understand their functional roles and causal relationships, advanced models such as organoids and animal studies are needed. Collectively, the distinct spatial and disease-specific expression patterns of CD55, CD59, and CD46 underscore their specialized roles in gut immunity and pathology ( 57 Interactions between the complement system and enteric pathogens Although numerous studies have examined the interplay between the complement system and enteric pathogens, much of the existing research has been conducted under in vitro conditions or with a focus on systemic infection. Local interactions between the complement system and pathogens in the gut remain underexplored. Here, we summarize studies that examine these local interactions and explore how enteric pathogens defend themselves against the complement system. Listeria monocytogenes L monocytogenes 58 L monocytogenes 59 61 62 Shigella flexneri Salmonella enterica Salmonella 63 E coli wzy 64 wzy C. rodentium E coli 65 C rodentium 66 C rodentium 67 16 68 C rodentium 16 C rodentium 16 C rodentium 16 It remains challenging to distinguish between local and systemic complement contributions during gut infection, especially under inflammatory conditions. Systemic complement influx can limit pathogen dissemination, as demonstrated by IL-22–driven C3 production during Clostridioides difficile 69 Candida albicans 70 Enteric parasites have also evolved mechanisms to circumvent complement-mediated defense in the gut. MBL deficiency has been associated with increased cryptosporidiosis in immunocompromised individuals and young children ( 71 72 Cryptosporidium parvum 73 Giardia intestinalis 74 75 The local complement pathway also plays an important role in enteric viral infections. Certain echovirus serotypes (6, 7, 11, 12, 20, and 21) and enterovirus 70 exploit the complement regulator CD55 as a receptor for attachment and infection ( 76 77 78 80 81 82 83 84 85 88 89 90 91 These findings underscore the complex relationship between the complement system and pathogens in the gut, highlighting both the protective and evasion mechanisms employed by various microbial agents. Further studies examining local complement activity in vivo are essential for a comprehensive understanding of this dynamic interaction. Gut complement, microbiota, and chronic inflammatory diseases The complex role of the complement system in the development and progression of chronic inflammatory diseases of the gut, such as inflammatory bowel disease (IBD), has long been recognized. This complexity stems from complement’s capacity to both maintain and disrupt intestinal homeostasis. On one hand, complement supports tissue repair and homeostasis by clearing pathogens and damaged cells. On the other hand, excessive or dysregulated complement activation can trigger inflammation and drive tissue injury. Substantial evidence points to both systemic and local complement dysregulation as a contributor in IBD. Patients with IBD exhibit elevated C3 synthesis rates compared with individuals acting as healthy controls, and patients with CD exhibit higher C3 production and serum levels than patients with UC ( 92 93 94 95 19 Additionally, deposition of IgG1, C3b, and the MAC on the intestinal epithelium in patients with UC indicates classical pathway involvement ( 96 97 IECs are known to be an important source of C3 in IBD ( 15 98 99 Our recent work suggests that the microbiota can regulate C3 levels in the gut ( 16 Faecalibacterium prausnitzii Roseburia E. coli Ruminococcus gnavus 100 101 Although associations between microbiota composition and IBD pathogenesis are increasingly recognized, the underlying causal relationships and the potential involvement of the complement system are not yet fully elucidated. Gut complement and microbiota in CRC CRC is the third most commonly diagnosed cancer worldwide and the second leading cause of cancer-related mortality ( 102 103 104 Serum levels of the anaphylatoxin C3a are increased in patients with CRC and decline following tumor resection, suggesting its potential utility as a biomarker ( 105 107 108 109 110 111 + 112 113 114 115 The microbiota-dependent production of C3 by intestinal cells and the minimal presence of C5 under homeostatic conditions in the gut ( 16 116 Fusobacterium nucleatum Solobacterium moorei Porphyromonas asaccharolytica Parvimonas micra Peptostreptococcus stomatis P anaerobius Prevotella intermedia 117 118 Although the MAC can directly lyse tumor cells by disrupting membrane integrity ( 119 44 107 120 121 121 122 123 103 124 125 Future perspectives Collectively, our emerging understanding of gut complement biology positions this ancient immune pathway as a critical mediator of intestinal homeostasis and disease. Its dual capacity to shape microbiota-host interactions and regulate barrier function underscores the complement system’s unique role in maintaining the health of the gut ecosystem. However, when dysregulated, complement can become a potent driver of chronic inflammatory diseases, metabolic disorders, and malignancies. As research continues to unravel the microbial and host-derived signals that govern complement production and activation in the gut, new therapeutic strategies are on the horizon. Precision targeting of complement pathways — whether through modulation of microbial communities, restoration of complement regulation, or inhibition of pathogenic activation — holds promise for a new class of therapeutics aimed at reestablishing mucosal balance. Future studies delineating the spatial, cellular, and molecular determinants of gut complement activity will be pivotal in translating these insights into clinical interventions that improve outcomes across a spectrum of gastrointestinal and systemic diseases. This work was partially supported by a grant from the NIAID New Innovator Award (1DP2AI184835-01 to MW), an NIH grant (1R01AI181938-01A1, subaward to MW), and start-up funds from Washington University in St. Louis. We thank John Atkinson and Xiaobo Wu (Washington University in St. Louis) for their expert consultation and insightful discussions. This work is the result of NIH funding, in whole or in part, and is subject to the NIH Public Access Policy. Through acceptance of this federal funding, the NIH has been given a right to make the work publicly available in PubMed Central. Conflict of interest: Copyright: Reference information: J Clin Invest 1 Alper CA et al Human C’3: evidence for the liver as the primary site of synthesis Science 1969 163 3864 286 288 10.1126/science.163.3864.286 4883617 2 Torisu M et al Serum complement after orthotopic transplantation of the human liver Clin Exp Immunol 1972 12 1 21 30 4628404 PMC1553651 3 Einstein LP et al Biosynthesis of the third component of complement (C3) in vitro by monocytes from both normal and homozygous C3-deficient humans J Clin Invest 1977 60 5 963 969 10.1172/JCI108876 332718 PMC372447 4 Rubin DJ et al Synthesis of the second component of guinea pig complement in vitro J Immunol 1971 106 2 295 303 10.4049/jimmunol.106.2.295 5545134 5 Wyatt HV et al Production of the second (C2) and fourth (C4) components of guinea pig complement by single peritoneal cells: evidence that one cell may produce both components J Immunol 1972 108 6 1609 1614 10.4049/jimmunol.108.6.1609 4555572 6 Cole FS et al Control of complement synthesis and secretion in bronchoalveolar and peritoneal macrophages J Immunol 1980 125 3 1120 1124 10.4049/jimmunol.125.3.1120 6997377 7 Colten HR et al In vitro synthesis of the first component of complement by guinea pig small intestine Proc Natl Acad Sci U S A 1966 56 4 1158 1163 10.1073/pnas.56.4.1158 5230141 PMC220028 8 Colten HR et al Synthesis of the first component of guinea pig complement by columnar epithelial cells of the small intestine J Immunol 1968 100 4 788 792 10.4049/jimmunol.100.4.788 4967044 9 Colten HR et al Synthesis of the first component of human complement in vitro J Exp Med 1968 128 4 595 604 10.1084/jem.128.4.595 5675435 PMC2138552 10 Pendse M et al Macrophages regulate gastrointestinal motility through complement component 1q Elife 2023 12 e78558 10.7554/eLife.78558 37159507 PMC10185340 11 Kohler PF Maturation of the human complement system. I. Onset time and sites of fetal C1q, C4, C3, and C5 synthesis J Clin Invest 1973 52 3 671 677 10.1172/JCI107228 4685088 PMC302305 12 Lai A Fat RF et al In vitro synthesis of immunoglobulins, secretory component, complement and lysozyme by human gastrointestinal tissues. I. Normal tissues Clin Exp Immunol 1976 23 1 9 19 1261092 PMC1538358 13 Andoh A et al Differential cytokine regulation of complement C3, C4, and factor B synthesis in human intestinal epithelial cell line, Caco-2 J Immunol 1993 151 8 4239 4247 10.4049/jimmunol.151.8.4239 8409399 14 Bernet-Camard MF et al Differential expression of complement proteins and regulatory decay accelerating factor in relation to differentiation of cultured human colon adenocarcinoma cell lines Gut 1996 38 2 248 253 10.1136/gut.38.2.248 8801206 PMC1383032 15 Sünderhauf A et al Regulation of epithelial cell expressed C3 in the intestine - Relevance for the pathophysiology of inflammatory bowel disease? Mol Immunol 2017 90 227 238 10.1016/j.molimm.2017.08.003 28843904 16 Wu M et al Gut complement induced by the microbiota combats pathogens and spares commensals Cell 2024 187 4 897 913 10.1016/j.cell.2023.12.036 38280374 PMC10922926 17 Elmentaite R et al Cells of the human intestinal tract mapped across space and time Nature 2021 597 7875 250 255 10.1038/s41586-021-03852-1 34497389 PMC8426186 18 Riordan SM et al Local and systemic complement activity in small intestinal bacterial overgrowth Dig Dis Sci 1997 42 6 1128 1136 10.1023/A:1018821200354 9201072 19 Ahrenstedt Ö et al Enhanced local production of complement components in the small intestines of patients with Crohn’s disease N Engl J Med 1990 322 19 1345 1349 10.1056/NEJM199005103221903 2325733 20 Xu D et al Complement in breast milk modifies offspring gut microbiota to promote infant health Cell 2024 187 3 750 763 10.1016/j.cell.2023.12.019 38242132 PMC10872564 21 Hong S et al Complement and microglia mediate early synapse loss in Alzheimer mouse models Science 2016 352 6286 712 716 10.1126/science.aad8373 27033548 PMC5094372 22 Stevens B et al The classical complement cascade mediates CNS synapse elimination Cell 2007 131 6 1164 1178 10.1016/j.cell.2007.10.036 18083105 23 Nonaka M. Evolution of the complement system. In: Anderluh G, Gilbert R, eds. MACPF/CDC Proteins - Agents of Defence, Attack and Invasion 24 Lubbers R et al Production of complement components by cells of the immune system Clin Exp Immunol 2017 188 2 183 194 10.1111/cei.12952 28249350 PMC5383442 25 Karsten CM et al Monitoring C5aR2 expression using a floxed tdTomato-C5aR2 knock-in mouse J Immunol 2017 199 9 3234 3248 10.4049/jimmunol.1700710 28864475 26 Karsten CM et al Monitoring and cell-specific deletion of C5aR1 using a novel floxed GFP-C5aR1 reporter knock-in mouse J Immunol 2015 194 4 1841 1855 10.4049/jimmunol.1401401 25589074 27 Quell KM et al Monitoring C3aR expression using a floxed tdTomato-C3aR reporter knock-in mouse J Immunol 2017 199 2 688 706 10.4049/jimmunol.1700318 28626064 28 Guglietta S et al Coagulation induced by C3aR-dependent NETosis drives protumorigenic neutrophils during small intestinal tumorigenesis Nat Commun 2016 7 1 11037 10.1038/ncomms11037 26996437 PMC4802169 29 West EE Kemper C Complosome - the intracellular complement system Nat Rev Nephrol 2023 19 7 426 439 10.1038/s41581-023-00704-1 37055581 PMC10100629 30 McCarthy JD et al The anaphylatoxin C3a primes model colonic epithelial cells for expression of inflammatory mediators through Gαi Mol Immunol 2018 103 125 132 10.1016/j.molimm.2018.09.008 30261438 31 Matsumoto N et al C3a enhances the formation of intestinal organoids through C3aR1 Front Immunol 2017 8 1046 10.3389/fimmu.2017.01046 28928734 PMC5591398 32 Ghosh M Rana S The anaphylatoxin C5a: Structure, function, signaling, physiology, disease, and therapeutics Int Immunopharmacol 2023 118 110081 10.1016/j.intimp.2023.110081 36989901 33 Kim S-H et al Complement C5a promotes antigen cross-presentation by Peyer’s patch monocyte-derived dendritic cells and drives a protective CD8 + Cell Rep 2021 35 2 108995 10.1016/j.celrep.2021.108995 33852847 34 Fayyazi A et al C5a receptor and interleukin-6 are expressed in tissue macrophages and stimulated keratinocytes but not in pulmonary and intestinal epithelial cells Am J Pathol 1999 154 2 495 501 10.1016/S0002-9440(10)65295-9 10027407 PMC1849999 35 Zwirner J et al Expression of the anaphylatoxin C5a receptor in non-myeloid cells Mol Immunol 1999 36 13-14 877 884 10.1016/S0161-5890(99)00109-1 10698342 36 Cao Q et al Human colonic epithelial cells detect and respond to C5a via apically expressed C5aR through the ERK pathway Am J Physiol Cell Physiol 2012 302 12 1731 1740 10.1152/ajpcell.00213.2011 22496247 37 Kim S et al M cells expressing the complement C5a receptor are efficient targets for mucosal vaccine delivery Eur J Immunol 2011 41 11 3219 3229 10.1002/eji.201141592 21887786 38 Helmy KY et al CRIg: a macrophage complement receptor required for phagocytosis of circulating pathogens Cell 2006 124 5 915 927 10.1016/j.cell.2005.12.039 16530040 39 Yuan X et al CRIg, a tissue-resident macrophage specific immune checkpoint molecule, promotes immunological tolerance in NOD mice, via a dual role in effector and regulatory T cells Elife 2017 6 e29540 10.7554/eLife.29540 29171836 PMC5728720 40 Nie S et al CRIg+ macrophages deficiency enhanced inflammation damage in IBD due to gut extracellular vesicles containing microbial DNA Gut Microbes 2024 16 1 2379633 10.1080/19490976.2024.2379633 39024479 PMC11259065 41 Eddy A et al The distribution of the CR3 receptor on human cells and tissue as revealed by a monoclonal antibody Clin Immunol Immunopathol 1984 31 3 371 389 10.1016/0090-1229(84)90090-4 6232029 42 Vainer B Horn T Comparative studies of the colonic in situ expression of intercellular adhesion molecules (ICAM-1, -2, and -3), beta2 integrins (LFA-1, Mac-1, and p150,95), and PECAM-1 in ulcerative colitis and Crohn’s disease Am J Surg Pathol 2000 24 8 1115 1124 10.1097/00000478-200008000-00009 10935652 43 Berstad AE Brandtzaeg P Expression of cell membrane complement regulatory glycoproteins along the normal and diseased human gastrointestinal tract Gut 1998 42 4 522 529 10.1136/gut.42.4.522 9616315 PMC1727075 44 Shang Y et al Systematic immunohistochemical analysis of the expression of CD46, CD55, and CD59 in colon cancer Arch Pathol Lab Med 2014 138 7 910 919 10.5858/arpa.2013-0064-OA 24978917 45 Thorsteinsson L et al The complement regulatory proteins CD46 and CD59, but not CD55, are highly expressed by glandular epithelium of human breast and colorectal tumour tissues APMIS 1998 106 9 869 878 10.1111/j.1699-0463.1998.tb00233.x 9808413 46 Ozen A CHAPLE syndrome uncovers the primary role of complement in a familial form of Waldmann’s disease Immunol Rev 2019 287 1 20 32 10.1111/imr.12715 30565236 47 Koretz K et al Decay-accelerating factor (DAF, CD55) in normal colorectal mucosa, adenomas and carcinomas Br J Cancer 1992 66 5 810 814 10.1038/bjc.1992.365 1384641 PMC1977964 48 Andoh A et al Interleukin 4 acts as an inducer of decay-accelerating factor gene expression in human intestinal epithelial cells Gastroenterology 1996 111 4 911 918 10.1016/S0016-5085(96)70058-6 8831585 49 Andoh A et al Tumour necrosis factor-alpha up-regulates decay-accelerating factor gene expression in human intestinal epithelial cells Immunology 1997 90 3 358 363 10.1111/j.1365-2567.1997.00358.x 9155641 PMC1456598 50 Nasu J et al Cytokine-stimulated release of decay-accelerating factor (DAF;CD55) from HT-29 human intestinal epithelial cells Clin Exp Immunol 1998 113 3 379 385 10.1046/j.1365-2249.1998.00660.x 9737666 PMC1905071 51 Bjørge L et al Characterisation of the complement-regulatory proteins decay-accelerating factor (DAF, CD55) and membrane cofactor protein (MCP, CD46) on a human colonic adenocarcinoma cell line Cancer Immunol Immunother 1996 42 3 185 192 10.1007/s002620050269 8640847 PMC11037746 52 Inaba T et al Decay-accelerating factor (DAF) in stool specimens as a marker of disease activity in patients with ulcerative colitis (UC) Clin Exp Immunol 1998 112 2 237 241 10.1046/j.1365-2249.1998.00573.x 9649185 PMC1904958 53 Andoh A et al Intestinal trefoil factor induces decay-accelerating factor expression and enhances the protective activities against complement activation in intestinal epithelial cells J Immunol 2001 167 7 3887 3893 10.4049/jimmunol.167.7.3887 11564806 54 Scheinin T et al Decreased expression of protectin (CD59) in gut epithelium in ulcerative colitis and Crohn’s disease Hum Pathol 1999 30 12 1427 1430 10.1016/S0046-8177(99)90163-6 10667419 55 Bjørge L et al Expression and function of CD59 on colonic adenocarcinoma cells Eur J Immunol 1994 24 7 1597 1603 10.1002/eji.1830240722 7517877 56 Cardone J et al A novel role for CD46 in wound repair Front Immunol 2011 2 28 10.3389/fimmu.2011.00028 22566818 PMC3342392 57 Sina C et al The intestinal complement system in inflammatory bowel disease: Shaping intestinal barrier function Semin Immunol 2018 37 66 73 10.1016/j.smim.2018.02.008 29486961 58 Radoshevich L Cossart P Listeria monocytogenes Nat Rev Microbiol 2018 16 1 32 46 10.1038/nrmicro.2017.126 29176582 59 Van Kessel KP et al Interactions of killed Listeria monocytogenes Infect Immun 1981 34 1 16 19 10.1128/iai.34.1.16-19.1981 6795123 PMC350813 60 Drevets DA Campbell PA Roles of complement and complement receptor type 3 in phagocytosis of Listeria monocytogenes Infect Immun 1991 59 8 2645 2652 10.1128/iai.59.8.2645-2652.1991 1906842 PMC258068 61 Croize J et al Activation of the human complement alternative pathway by Listeria monocytogenes Infect Immun 1993 61 12 5134 5139 10.1128/iai.61.12.5134-5139.1993 8225590 PMC281293 62 Sorbara MT et al Complement C3 drives autophagy-dependent restriction of cyto-invasive bacteria Cell Host Microbe 2018 23 5 644 652 10.1016/j.chom.2018.04.008 29746835 63 Riva R et al The outer membrane protease PgtE of Salmonella enterica Front Microbiol 2015 6 63 10.3389/fmicb.2015.00063 25705210 PMC4319491 64 Ohno M et al Lipopolysaccharide O structure of adherent and invasive Escherichia coli PLoS Pathog 2020 16 10 e1008928 10.1371/journal.ppat.1008928 33027280 PMC7571687 65 Mullineaux-Sanders C et al Citrobacter rodentium Nat Rev Microbiol 2019 17 11 701 715 10.1038/s41579-019-0252-z 31541196 66 Collins JW et al Citrobacter rodentium Nat Rev Microbiol 2014 12 9 612 623 10.1038/nrmicro3315 25088150 67 Jain U et al Properdin provides protection from Citrobacter rodentium J Immunol 2015 194 7 3414 3421 10.4049/jimmunol.1401814 25725105 68 Belzer C et al The role of specific IgG and complement in combating a primary mucosal infection of the gut epithelium Eur J Microbiol Immunol (Bp) 2011 1 4 311 318 10.1556/EuJMI.1.2011.4.7 22485193 PMC3319158 69 Hasegawa M et al Interleukin-22 regulates the complement system to promote resistance against pathobionts after pathogen-induced intestinal damage Immunity 2014 41 4 620 632 10.1016/j.immuni.2014.09.010 25367575 PMC4220303 70 Muller S et al Mannan-binding lectin deficiency results in unusual antibody production and excessive experimental colitis in response to mannose-expressing mild gut pathogens Gut 2010 59 11 1493 1500 10.1136/gut.2010.208348 20682699 71 Kelly P et al Mannose-binding lectin is a component of innate mucosal defense against Cryptosporidium parvum Gastroenterology 2000 119 5 1236 1242 10.1053/gast.2000.19573 11054381 72 Kirkpatrick BD et al Serum mannose-binding lectin deficiency is associated with cryptosporidiosis in young Haitian children Clin Infect Dis 2006 43 3 289 294 10.1086/505396 16804841 73 Petry F et al Binding and activation of human and mouse complement by Cryptosporidium parvum Mol Immunol 2008 45 12 3392 3400 10.1016/j.molimm.2008.04.010 18501966 74 Evans-Osses I et al Involvement of lectin pathway activation in the complement killing of Giardia intestinalis Biochem Biophys Res Commun 2010 395 3 382 386 10.1016/j.bbrc.2010.04.025 20382117 75 Li E et al Complement activation by giardia duodenalis parasites through the lectin pathway contributes to mast cell responses and parasite control Infect Immun 2016 84 4 1092 1099 10.1128/IAI.00074-16 26831470 PMC4807472 76 Bergelson JM et al Decay-accelerating factor (CD55), a glycosylphosphatidylinositol-anchored complement regulatory protein, is a receptor for several echoviruses Proc Natl Acad Sci U S A 1994 91 13 6245 6248 10.1073/pnas.91.13.6245 7517044 PMC44175 77 Karnauchow TM et al The HeLa cell receptor for enterovirus 70 is decay-accelerating factor (CD55) J Virol 1996 70 8 5143 5152 10.1128/jvi.70.8.5143-5152.1996 8764022 PMC190469 78 Bergelson JM et al Coxsackievirus B3 adapted to growth in RD cells binds to decay-accelerating factor (CD55) J Virol 1995 69 3 1903 1906 10.1128/jvi.69.3.1903-1906.1995 7531780 PMC188804 79 Shafren DR et al Coxsackievirus A21 binds to decay-accelerating factor but requires intercellular adhesion molecule 1 for cell entry J Virol 1997 71 6 4736 4743 10.1128/jvi.71.6.4736-4743.1997 9151867 PMC191695 80 Shafren DR et al Coxsackieviruses B1, B3, and B5 use decay accelerating factor as a receptor for cell attachment J Virol 1995 69 6 3873 3877 10.1128/jvi.69.6.3873-3877.1995 7538177 PMC189108 81 Cattaneo R Four viruses, two bacteria, and one receptor: membrane cofactor protein (CD46) as pathogens’ magnet J Virol 2004 78 9 4385 4388 10.1128/JVI.78.9.4385-4388.2004 15078919 PMC387720 82 Dörig RE et al The human CD46 molecule is a receptor for measles virus (Edmonston strain) Cell 1993 75 2 295 305 10.1016/0092-8674(93)80071-L 8402913 83 Naniche D et al Human membrane cofactor protein (CD46) acts as a cellular receptor for measles virus J Virol 1993 67 10 6025 6032 10.1128/jvi.67.10.6025-6032.1993 8371352 PMC238023 84 Lewin J et al Persistent measles virus infection of the intestine: confirmation by immunogold electron microscopy Gut 1995 36 4 564 569 10.1136/gut.36.4.564 7737565 PMC1382498 85 Segerman A et al Adenovirus type 11 uses CD46 as a cellular receptor J Virol 2003 77 17 9183 9191 10.1128/JVI.77.17.9183-9191.2003 12915534 PMC187375 86 Gaggar A et al CD46 is a cellular receptor for group B adenoviruses Nat Med 2003 9 11 1408 1412 10.1038/nm952 14566335 87 Sirena D et al The human membrane cofactor CD46 is a receptor for species B adenovirus serotype 3 J Virol 2004 78 9 4454 4462 10.1128/JVI.78.9.4454-4462.2004 15078926 PMC387694 88 Wu E et al Membrane cofactor protein is a receptor for adenoviruses associated with epidemic keratoconjunctivitis J Virol 2004 78 8 3897 3905 10.1128/JVI.78.8.3897-3905.2004 15047806 PMC374279 89 Maurer K et al CD46 is a cellular receptor for bovine viral diarrhea virus J Virol 2004 78 4 1792 1799 10.1128/JVI.78.4.1792-1799.2004 14747544 PMC369467 90 Hair PS et al Human astrovirus coat protein binds C1q and MBL and inhibits the classical and lectin pathways of complement activation Mol Immunol 2010 47 4 792 798 10.1016/j.molimm.2009.10.006 19896716 91 Bonaparte RS et al Human astrovirus coat protein inhibits serum complement activation via C1, the first component of the classical pathway J Virol 2008 82 2 817 827 10.1128/JVI.01847-07 17959658 PMC2224607 92 Hodgson HJ et al C3 metabolism in ulcerative colitis and Crohn’s disease Clin Exp Immunol 1977 28 3 490 495 891024 PMC1541002 93 Potter BJ et al Clq metabolism in ulcerative colitis and Crohn’s disease Gut 1979 20 11 1012 1019 10.1136/gut.20.11.1012 527870 PMC1412679 94 Hodgson HJ et al Humoral immune system in inflammatory bowel disease: I. Complement levels Gut 1977 18 9 749 753 10.1136/gut.18.9.749 604196 PMC1411653 95 Ward M Eastwood MA Serum C3 and C4 complement components in ulcerative colitis and Crohn’s disease Digestion 1975 13 1-2 100 103 10.1159/000197698 1201816 96 Halstensen TS et al Epithelial deposition of immunoglobulin G1 and activated complement (C3b and terminal complement complex) in ulcerative colitis Gastroenterology 1990 98 5 pt 1 1264 1271 10.1016/0016-5085(90)90343-Y 1691118 97 Halstensen TS et al Surface epithelium related activation of complement differs in Crohn’s disease and ulcerative colitis Gut 1992 33 7 902 908 10.1136/gut.33.7.902 1379568 PMC1379402 98 Laufer J et al Cellular localization of complement C3 and C4 transcripts in intestinal specimens from patients with Crohn’s disease Clin Exp Immunol 2001 120 1 30 37 10.1046/j.1365-2249.2000.01168.x 10759760 PMC1905612 99 Cadinu P et al Charting the cellular biogeography in colitis reveals fibroblast trajectories and coordinated spatial remodeling Cell 2024 187 8 2010 2028 10.1016/j.cell.2024.03.013 38569542 PMC11017707 100 Haneishi Y et al Inflammatory bowel diseases and gut microbiota Int J Mol Sci 2023 24 4 3817 10.3390/ijms24043817 36835245 PMC9958622 101 Qiu P et al The gut microbiota in inflammatory bowel disease Front Cell Infect Microbiol 2022 12 733992 10.3389/fcimb.2022.733992 35273921 PMC8902753 102 Bray F et al Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2024 74 3 229 263 10.3322/caac.21834 38572751 103 Bao D et al Integrative analysis of complement system to prognosis and immune infiltrating in colon cancer and gastric cancer Front Oncol 2021 10 553297 10.3389/fonc.2020.553297 33614473 PMC7886994 104 Ytting H et al Increased activity of the mannan-binding lectin complement activation pathway in patients with colorectal cancer Scand J Gastroenterol 2004 39 7 674 679 10.1080/00365520410005603 15370690 105 Mehrabani D et al Clinical significance of serum vascular endothelial growth factor and complement 3a levels in patients with colorectal cancer in southern Iran Asian Pac J Cancer Prev 2014 15 22 9713 9717 10.7314/APJCP.2014.15.22.9713 25520093 106 Habermann JK et al Increased serum levels of complement C3a anaphylatoxin indicate the presence of colorectal tumors Gastroenterology 2006 131 4 1020 1029 10.1053/j.gastro.2006.07.011 17030172 PMC2532535 107 Zhu X-L et al Association of complement components with risk of colorectal cancer: A systematic review and meta-analysis World J Gastrointest Oncol 2024 16 5 2168 2180 10.4251/wjgo.v16.i5.2168 38764810 PMC11099464 108 Krieg C et al Complement downregulation promotes an inflammatory signature that renders colorectal cancer susceptible to immunotherapy J Immunother Cancer 2022 10 9 e004717 10.1136/jitc-2022-004717 36137652 PMC9511657 109 Urbiola-Salvador V et al Mass spectrometry proteomics characterization of plasma biomarkers for colorectal cancer associated with inflammation Biomark Insights 2024 19 11772719241257739 10.1177/11772719241257739 38911905 PMC11191626 110 Xu D et al C5aR1 promotes the progression of colorectal cancer by EMT and activating Wnt/β-catenin pathway Clin Transl Oncol 2022 25 2 440 446 10.1007/s12094-022-02956-y 36192575 PMC9873742 111 Li X et al Platelets promote CRC by activating the C5a/C5aR1 axis via PSGL-1/JNK/STAT1 signaling in tumor-associated macrophages Theranostics 2023 13 6 2040 2056 10.7150/thno.80555 37064877 PMC10091882 112 Ding P et al C5aR1 is a master regulator in colorectal tumorigenesis via immune modulation Theranostics 2020 10 19 8619 8632 10.7150/thno.45058 32754267 PMC7392014 113 Ding P et al Intracellular complement C5a/C5aR1 stabilizes β-catenin to promote colorectal tumorigenesis Cell Rep 2022 39 9 110851 10.1016/j.celrep.2022.110851 35649359 114 Piao C et al Complement 5a enhances hepatic metastases of colon cancer via monocyte chemoattractant protein-1-mediated inflammatory cell infiltration J Biol Chem 2015 290 17 10667 10676 10.1074/jbc.M114.612622 25739439 PMC4409234 115 Xu Y et al New insights into the role of complement system in colorectal cancer (Review) Mol Med Rep 2025 31 3 68 10.3892/mmr.2025.13433 39791217 PMC11751662 116 Wong CC Yu J Gut microbiota in colorectal cancer development and therapy Nat Rev Clin Oncol 2023 20 7 429 452 10.1038/s41571-023-00766-x 37169888 117 Thomas AM et al Metagenomic analysis of colorectal cancer datasets identifies cross-cohort microbial diagnostic signatures and a link with choline degradation Nat Med 2019 25 4 667 678 10.1038/s41591-019-0405-7 30936548 PMC9533319 118 Wirbel J et al Meta-analysis of fecal metagenomes reveals global microbial signatures that are specific for colorectal cancer Nat Med 2019 25 4 679 689 10.1038/s41591-019-0406-6 30936547 PMC7984229 119 Fishelson Z Kirschfink M Complement C5b-9 and cancer: mechanisms of cell damage, cancer counteractions, and approaches for intervention Front Immunol 2019 10 752 10.3389/fimmu.2019.00752 31024572 PMC6467965 120 Liu J et al The genetic and epigenetic regulation of CD55 Front Immunol 2023 13 947136 10.3389/fimmu.2022.947136 36741376 PMC9889927 121 Tang G et al Knockdown of membrane-bound complement regulatory proteins suppresses colon cancer growth in mice through inducing tumor cell apoptosis Int Immunopharmacol 2023 114 109450 10.1016/j.intimp.2022.109450 36446233 122 Dho S et al A novel therapeutic anti-CD55 monoclonal antibody inhibits the proliferation and metastasis of colorectal cancer cells Oncol Rep 2019 42 6 2686 2693 10.3892/or.2019.7337 31578581 123 Watson NFS et al Expression of the membrane complement regulatory protein CD59 (protectin) is associated with reduced survival in colorectal cancer patients Cancer Immunol Immunother 2006 55 8 973 980 10.1007/s00262-005-0055-0 16151805 PMC11030621 124 Du Y-J et al Complement factor I knockdown inhibits colon cancer development by affecting Wnt/β-catenin/c-Myc signaling pathway and glycolysis World J Gastrointest Oncol 2024 16 6 2646 2662 10.4251/wjgo.v16.i6.2646 38994157 PMC11236223 125 Wilczek E et al The possible role of factor H in colon cancer resistance to complement attack Int J Cancer 2008 122 9 2030 2037 10.1002/ijc.23238 18183578 Version 1 10/01/2025 Electronic publication Figure 1 Unique adaptations of the intestinal complement system compared with the systemic complement system. ( A 16 B C Table 3 Expression of complement regulatory proteins in the gut Table 2 Expression of complement receptors in the gut Table 1 Expression of complement components in the gut ",
  "metadata": {
    "Title of this paper": "The possible role of factor H in colon cancer resistance to complement attack",
    "Journal it was published in:": "The Journal of Clinical Investigation",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483559/"
  }
}