{
  "title": "Paper_318",
  "abstract": "pmc bioRxiv 3848 biorxiv BIORXIV bioRxiv 2692-8205 Cold Spring Harbor Laboratory Preprints PMC12485900 PMC12485900.1 12485900 12485900 41040167 10.1101/2025.09.22.677860 1 preprint 1 Article AMICI: Attention Mechanism Interpretation of Cell-cell Interactions Hong Justin http://orcid.org/0000-0003-2115-9101 Desai Khushi http://orcid.org/0009-0009-3024-8406 Nguyen Tu Duyen Nazaret Achille http://orcid.org/0000-0002-5428-9810 Levy Nathan http://orcid.org/0009-0005-8238-3926 Ergen Can http://orcid.org/0000-0002-3096-2927 Plitas George Azizi Elham http://orcid.org/0000-0001-5059-6971 24 9 2025 498069 2025.09.22.677860 01 10 2025 02 10 2025 03 10 2025 https://creativecommons.org/licenses/by-nc/4.0/ This work is licensed under a Creative Commons Attribution-NonCommercial 4.0 International License http://biorxiv.org/lookup/doi/10.1101/2025.09.22.677860 nihpp-2025.09.22.677860.pdf Abstract Spatial transcriptomic data enable study of cell–cell communication, yet current analysis tools often fail to provide dynamic, interpretable estimates of interactions and their spatial range across tissue. We present AMICI, an interpretable attention framework that jointly estimates interaction length scales, adaptively resolves sender–receiver subpopulations, and links communication to downstream gene programs. AMICI recovers ground-truth interactions in semi-synthetic data, uncovers gene programs linked to cell communication in the mouse cortex, and reveals length-scale-dependent tumor–immune signaling that reinforces estrogen receptor (ER) programs in breast cancer. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version yes pmc-prop-is-scanned-article no pmc-prop-preprint yes pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "\nAMICI: Attention Mechanism Interpretation of Cell-cell Interactions\n",
    "Journal it was published in:": "bioRxiv",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485900/"
  }
}