{
  "title": "Paper_218",
  "abstract": "pmc Front Reprod Health Front Reprod Health 4310 frph Front. Reprod. Health Frontiers in Reproductive Health 2673-3153 2673-3153 Frontiers Media SA PMC12488583 PMC12488583.1 12488583 12488583 10.3389/frph.2025.1629834 1 Reproductive Health Original Research The epidemiology of uterine fibroids: global disease burden from 1990 to 2021 and future trend predictions Wu Chan  1  † Zhou Ling  2  † Chen Ruilin  3 Li Huiling  2 Li Jian  1 Guo Feifei  1 Li Rong  1 Zhou Huaijun  1 * Huang Jingjing  1 * 1 Department of Gynecology Nanjing Drum Tower Hospital, Affiliated Hospital of Medical School, Nanjing University Nanjing China 2 Department of Obstetrics and Gynecology, Peking University People’s Hospital Beijing China 3 Department of Gynecology, Nanjing Drum Tower Hospital Clinical College of Nanjing University of Chinese Medicine Nanjing China Edited by: Pengpeng Ye Reviewed by: Ming Yi Yang Yang Xin Wang * Correspondence: zhouhj2007@126.com huangjingjing80@126.com  † These authors have contributed equally to this work 18 9 2025 2025 7 481470 1629834 23 5 2025 28 8 2025 18 09 2025 03 10 2025 03 10 2025 © 2025 Wu, Zhou, Chen, Li, Li, Guo, Li, Zhou and Huang. 2025 Wu, Zhou, Chen, Li, Li, Guo, Li, Zhou and Huang https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY) Background Uterine fibroids (UF) are the most common benign tumors of the female reproductive system, imposing a significant health burden. A comprehensive understanding of their global, regional, and national burden is essential for targeted public health planning. This study aimed to analyze the spatiotemporal trends of UF burden from 1990 to 2021 and project future trends to 2036. Methods Data on the incidence, prevalence, and disability-adjusted life years (DALYs) of UF from 1990 to 2021 were extracted from the Global Burden of Disease (GBD) 2021 study, covering 204 countries and territories. We analyzed trends using estimated annual percentage changes (EAPC) for age-standardized rates. Socio-demographic Index (SDI) was used to assess the association between development level and disease burden. The Slope Index of Inequality (SII) and concentration index were employed to quantify health inequalities. A Bayesian age-period-cohort (BAPC) model was used to project the burden to 2036. Results Between 1990 and 2021, the global ASIR of UF rose from 234.36 (95%UI: 171.06, 309.92) to 250.93 (183.44, 330.94) per 100,000 [EAPC 0.24 (0.23, 0.25)]. The ASPR increased from 2799.88 (2133.46, 3650.54) to 2841.07 (2164.43, 3682.27) [EAPC 0.04 (0.03, 0.06)]. DALYs grew from 81,142 (57,125, 111,989) to 142,885 (102,183, 192,988), while ASDR showed little change, from 3.48 (2.46, 4.77) to 3.39 (2.43, 4.59). Regional analysis indicated that South Asia exhibited the highest incidence and prevalence of UF, whereas Oceania and Australia experienced a lower burden. Analysis of health inequality revealed a shift in the burden of UF incidence and prevalence from high to low Socio-Demographic Index (SDI) countries between 1990 and 2021, indicating a reduction in health inequality. Future predictions from the BAPC model indicate that both ASIR and ASPR are expected to continue to rise, while ASDR is likely to decline. Conclusions From 1990 to 2021, the global incidence of UF has steadily risen, with South Asia experiencing the greatest impact. Despite the stabilization of ASDR, the rise in ASIR and ASPR remains a significant public health challenge worldwide. Health inequality analysis indicates that the burden of UF is shifting toward low SDI countries. Future prevention and treatment strategies for UF should focus on middle- and low-income countries, specifically by implementing targeted screening programs, investing in low-cost diagnostic tools, and launching public health awareness campaigns. Global public health cooperation, along with early diagnosis and treatment strategies for UF, will be crucial in reducing the disease burden. uterine fibroids global burden of disease health inequality Bayesian age-period-cohort (BAPC) prediction The author(s) declare that financial support was received for the research and/or publication of this article. The authors declare that the financial support of Research Project on Higher Education Reform at Xuzhou Medical University in 2021 (No. Xjylczx202101) was received for the research and publication of this article. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Gynecology 1 Introduction Uterine fibroids (UF), which are prevalent benign tumors in the female reproductive system, consist mainly of smooth muscle cells and fibrous connective tissue. Epidemiological studies indicate that UF are highly prevalent among women of reproductive age, with a notably higher incidence in women over the age of 40. Racial factors significantly influence the incidence of UF ( 1 2 3 UF significantly affect women's health, particularly by causing menstrual irregularities such as heavy, prolonged, or irregular bleeding, which may substantially impair quality of life ( 4 5 6 The consumption of healthcare resources due to UF is also a significant issue ( 7 8 9 10 3 11 12 The social and medical costs associated with UF have become a significant public health concern. Evidence indicates that the economic burden of UF includes not only direct medical expenses but also substantial indirect costs, such as loss of work productivity and obstetric complications ( 13 14 15 Both the incidence and prevalence of UF vary significantly across racial and regional groups. According to a study in the United States, the incidence of UF varies significantly by age and race, with Black women experiencing a notably higher prevalence ( 16 17 18 19 20 21 Given the substantial impact of UF on health, economics, and public health, together with the paucity of up-to-date research, systematically analyzing the global disease burden of UF and predicting future trends is of great importance. Against this background, the present study aims to investigate the burden and temporal trends of UF from 1990 to 2021 using data from the 2021 GBD study. The findings are expected to provide evidence to guide global and national strategies for UF prevention and management and to inform future research directions. 2 Materials and methods 2.1 Data source The GBD database is a major global health platform offering comprehensive data on numerous diseases and injuries. It uses standardized statistical methods and contributions from global health experts to comprehensively evaluate the burden of diseases. This study utilized data from the GBD 2021 study to evaluate the global, regional, and national burden and trends of UF from 1990 to 2021. The GBD dataset was selected as the primary data source for several key reasons. First, its comprehensive and standardized methodology allows for robust comparisons of disease burden across different geographic locations and time periods, which is essential for a global epidemiological analysis. Second, the GBD provides estimates for countries and regions where local data may be scarce or unavailable, filling critical knowledge gaps. However, the use of GBD data has inherent limitations that must be acknowledged. The quality and availability of primary data vary significantly across regions, with low- and middle-income countries often having less robust surveillance and reporting systems. The GBD framework addresses this through statistical modeling, including covariate-driven models and spatio-temporal Gaussian process regression (ST-GPR), to estimate missing data and correct for inconsistencies. This modeling can introduce uncertainty and potential biases, particularly in data-sparse regions where estimates are heavily reliant on covariates rather than direct measurement. For UF, which are often asymptomatic and underdiagnosed, the reliance on administrative and survey data may lead to an underestimation of the true prevalence and incidence. This study interprets all findings in the context of these strengths and weaknesses. 2.2 Data extraction and case definition GBD employs a range of data sources, including census data, disease registry databases, clinical data, health surveys, and research, as well as various national and regional statistics. The GBD methodology for non-fatal diseases like uterine fibroids relies on a comprehensive data synthesis process. For UF, case definitions were based on the International Classification of Diseases (ICD), specifically ICD−10 codes (D25.0, D25.1, D25.2, D25.9). The primary data sources included published literature, survey data, and hospital administrative data. The prevalence of UF was estimated using DisMod-MR 2.1, a Bayesian meta-regression tool that synthesizes diverse data sources to produce consistent estimates of incidence, prevalence, and remission. This model enforces consistency between epidemiological parameters. ST-GPR was then used to interpolate data for locations and years with missing information, borrowing strength from neighboring locations and time points to generate a complete and comparable set of estimates. The study indicators chosen were “Incidence,” “Prevalence,” “Deaths,” “DALYs (Disability-Adjusted Life Years),” “YLDs (Years Lived with Disability),” and “YLLs (Years of Life Lost)”. The data was further collected and analyzed based on different geographic locations, socio-economic development levels, and age groups. 2.3 Statistical analysis This study utilized the Estimated Annual Percentage Change (EAPC) to evaluate temporal trends in the burden of UF from 1990 to 2021. EAPC is a key statistical measure for assessing the rate of change in disease burden and reflects the average annual change in UF over a specific period. The method calculates the slope ( β EAPC = ( e β − 1 ) × 100 β To quantify socioeconomic inequality in the burden of UF across countries, we calculated the Slope Index of Inequality (SII) and the concentration index. The SII represents the absolute difference in health outcomes between the highest and lowest ends of the socioeconomic spectrum. It is derived from a regression of the health outcome on the cumulative proportion of the population ranked by SDI. A positive SII indicates that the burden is higher in countries with higher SDI. The concentration index is a relative measure of inequality. It is calculated as twice the area between the concentration curve (which plots the cumulative proportion of the health outcome against the cumulative proportion of the population ranked by SDI) and the line of equality. The concentration index ranges from −1 to +1, where a positive value indicates that the burden is concentrated among the higher SDI groups, a negative value indicates concentration among the lower SDI groups, and zero signifies perfect equality. This study employed health inequality analysis to evaluate the disparities in UF burden among groups with varying Socio-Demographic Index (SDI) levels, utilizing the Slope Index of Inequality (SII) and the Concentration Index as indicators. The SII quantifies the absolute disparity in health indicators between the highest and lowest SDI groups. The SII calculation is based on relative rankings and is obtained using a robust regression model. This model minimizes outlier sensitivity and bias from data heterogeneity or extreme values, enhancing the accuracy of health inequality assessments. A higher SII value indicates a larger health burden gap between groups, typically suggesting that lower SDI groups bear a larger health burden. In this study, we calculated the SII values for incidence, prevalence, and DALYs rates to assess the trends in these indicators across different SDI levels. The Concentration Index is used to measure the concentration of health indicators within the distribution of socio-economic status, reflecting the relative distribution of the study indicators across different socio-economic groups. The Concentration Index, ranging from [−1, 1], is derived by integrating the cumulative proportion of DALYs with the cumulative population distribution and SDI rankings beneath the Lorenz curve. Positive values indicate that the health indicator is more concentrated in high SDI groups, while negative values suggest a greater concentration in low SDI groups. We used the Concentration Index to analyze the distribution of incidence, prevalence, and DALYs across different SDI levels. Hierarchical clustering was utilized to examine regional similarities in the changes in UF burden. We calculated the Euclidean distances between the EAPC values of age-standardized incidence rate (ASIR) and age-standardized DALYs rate (ASDR) for each region, resulting in a distance matrix. The maximum distance method was then used to perform hierarchical clustering on this data. Countries with similar burden trends were grouped together, allowing us to identify regional patterns in the burden of UF. The results of the clustering analysis were visualized through dendrograms and scatter plots, providing a more intuitive representation of the differences and trends in the burden of UF across regions and countries. In this study, we employed the Bayesian Age-Period-Cohort (BAPC) model to forecast the global burden of uterine fibroids over the next 15 years. The BAPC model is a regression model based on the Bayesian statistical framework, widely used for analyzing disease trends, especially suitable for disease burden studies involving multidimensional data such as age, period, and cohort effects. The BAPC model was chosen over alternatives like Autoregressive Integrated Moving Average (ARIMA) because it can effectively disentangle the distinct influences of age (biological aging), period (external factors affecting all age groups at a specific time), and cohort (generational effects), which are critical for understanding long-term epidemiological transitions. While ARIMA models are effective for time-series forecasting, they do not differentiate these underlying drivers, making BAPC more mechanistically informative for population health data. This model decomposes key health indicators, such as ASIR, age-standardized prevalence rate (ASPR), and ASDR, into these three main components, thus enabling a deeper understanding of the dynamic changes in disease burden. The core hypothesis of the BAPC model is that the incidence of a disease is influenced by the interaction of age, period, and birth cohort effects. To implement this, we assigned appropriate prior distributions to each of these effects. The age effect was modeled as a smooth normal distribution, the period effect as a multinomial distribution, and the cohort effect as a distribution with long-term cyclical fluctuations. Weakly informative priors were selected to minimize their influence on the posterior distribution, allowing the data to primarily drive the results. Under the Bayesian framework, prior distributions were combined with the data, and the model was fitted using the Integrated Nested Laplace Approximations (INLA) method, a computationally efficient alternative to Markov Chain Monte Carlo (MCMC) for fitting Bayesian models. To ensure the validity and robustness of the BAPC model, we performed posterior predictive checks after fitting the model, verifying its appropriateness and stability. Model convergence was assessed by examining trace plots and ensuring the Gelman-Rubin statistic (R-hat) was below 1.1. Data analysis and modeling in this study were performed using R (version 4.5.1), along with several commonly used R packages. All models and statistical analyses underwent rigorous diagnostics to ensure the convergence and accuracy of the models. 2.4 Ethical statement Ethical approval for the Global Burden of Disease (GBD) study was obtained from the Institutional Review Board of the University of Washington. The present analysis is based on secondary use of aggregated, publicly available, and de-identified GBD data; therefore, no additional ethical approval or informed consent was required. 3 Results 3.1 Global burden of UF from 1990 to 2021 Globally, the number of new cases of UF increased from 6,009,553 (95%UI: 4,390,470–8,011,360) in 1990 to 10,100,271 (7,350,444–13,285,677) in 2021.The ASIR for UF increased from 234.36 (171.06–309.92) per 100,000 in 1990 to 250.93 (183.44–330.94) per 100,000 in 2021. From 1990 to 2021, the ASIR increased at an EAPC of 0.24 (0.23–0.25) per year ( Table 1 Figure 1 Figure 1 Figure 1 Table 1 Incidence and ASIR of UF in 1990 and 2021 and the temporal trends from 1990 to 2021. Location Number of incident cases, 1990 ASIR per 100,000 population, 1990 Number of incident cases, 2021 ASIR per 100,000 population, 2021 EAPC of ASIR, 1990–2021 Global 6,009,553 (4,390,470, 8,011,360) 234.36 (171.06, 309.92) 10,100,271 (7,350,444, 13,285,677) 250.93 (183.44, 330.94) 0.24 (0.23, 0.25) Low SDI 448,649 (324,083, 602,294) 221.80 (160.21, 296.73) 1,182,921 (858,970, 1,588,035) 237.87 (171.82, 315.92) 0.28 (0.25, 0.31) Low-middle SDI 1,114,718 (812,004, 1,492,492) 223.03 (162.64, 297.72) 2,608,642 (1,905,584, 3,489,706) 262.69 (191.79, 350.05) 0.65 (0.59, 0.72) Middle SDI 1,643,798 (1,195,917, 2,200,615) 197.65 (143.77, 263.13) 3,120,189 (2,273,529, 4,102,517) 238.21 (174.87, 313.82) 0.58 (0.55 ,0.61) High-middle SDI 1,538,211 (1,113,593, 2,048,532) 277.83 (202.22, 366.07) 1,770,558 (1,294,484, 2,311,244) 256.86 (188.01, 334.87) −0.29 (−0.34, −0.24) High SDI 1,257,846 (922,701, 1,649,758) 262.24 (192.80, 342.64) 1,410,127 (1,017,456, 1,837,590) 265.52 (193.64, 348.39) 0.07 (−0.10, 0.23) Central Asia 126,169 (91,127, 170,429) 411.92 (296.63, 547.76) 226,190 (162,305, 296,419) 436.75 (315.72, 568.20) 0.21 (0.19, 0.22) Central Europe 169,096 (123,215, 222,683) 254.24 (186.78, 329.19) 152,371 (110,543, 197,355) 248.04 (185.24, 316.71) −0.12 (−0.26, 0.03) EasternEurope 739,222 (531,212, 979,789) 605.27 (441.11, 791.73) 705,091 (501,337, 932,122) 610.42 (445.44, 798.58) 0.07 (0.05, 0.09) Australasia 9,849 (7,000, 12,964) 88.04 (62.91, 116.19) 14,101 (10,167, 18,832) 87.86 (63.79, 117.13) −0.06 (−0.08, −0.04) High-income Asia Pacific 251,480 (180,042, 339,316) 281.14 (200.23, 379.46) 217,245 (160,493, 281,971) 296.79 (219.27, 386.14) 0.15 (0.03, 0.27) High-income North America 327,037 (242,148, 427,779) 203.45 (151.77, 263.43) 451,012 (319,517, 594,256) 252.30 (180.16, 335.13) 0.91 (0.54, 1.28) Southern Latin America 63,593 (45,846, 88,040) 259.53 (187.13, 358.71) 100,931 (70,666, 135,009) 276.55 (193.62, 371.61) 0.11 (−0.00, 0.22) Western Europe 712,609 (512,701, 949,248) 356.50 (258.03, 474.32) 711,356 (513,218, 936,554) 345.03 (250.25, 460.96) −0.05 (−0.10, 0.00) Andean Latin America 89,109 (65,231, 120,466) 512.27 (373.95, 686.87) 185,722 (135,694, 247,467) 521.33 (380.49, 694.99) 0.02 (−0.01, 0.04) Caribbean 62,931 (45,749, 84,279) 361.08 (260.13, 480.93) 90,490 (64,956, 122,346) 367.58 (263.71, 497.19) 0.01 (−0.02, 0.05) Central Latin America 337,250 (243,036, 453,351) 454.30 (325.84, 603.09) 620,704 (444,734, 815,811) 446.82 (319.89, 588.04) −0.09 (−0.11, −0.08) Tropical Latin America 139,034 (103,152, 181,603) 181.39 (137.14, 233.57) 363,754 (264,692, 476,322) 278.54 (204.44, 365.57) 1.40 (1.31, 1.50) North Africa and Middle East 169,542 (122,300, 225,742) 118.25 (85.80, 158.20) 401,541 (289,713, 540,267) 122.58 (88.51, 163.47) −0.02 (−0.06, 0.02) South Asia 1,149,229 (836,887, 1,549,090) 243.08 (175.73, 326.15) 2,902,999 (2,098,361, 3,894,859) 296.47 (213.91, 395.25) 0.85 (0.77, 0.92) East Asia 805,490 (574,969, 1,101,400) 125.52 (91.02, 170.75) 1,016,351 (735,440, 1,325,298) 136.50 (101.31, 177.06) 0.19 (0.07, 0.32) Oceania 3,756 (2,688, 5,140) 129.49 (94.03, 175.69) 9,537 (6,856, 13,041) 139.06 (101.13, 189.15) 0.18 (0.15, 0.21) Southeast Asia 311,435 (224,291, 416,987) 135.24 (98.92, 179.53) 543.289 (398.636, 718.133) 144.48 (106.40, 191.70) 0.18 (0.14, 0.21) Central sub-Saharan Africa 56,612 (41,183, 75,933) 254.53 (184.18, 341.19) 159,378 (116,575, 210,784) 267.88 (195.21, 353.82) 0.17 (0.14, 0.19) Eastern sub-Saharan Africa 153,295 (110,657, 205,801) 200.48 (145.14, 265.73) 397,942 (286,113, 537,147) 206.20 (149.22, 275.53) 0.12 (0.11, 0.13) Southern sub-Saharan Africa 130,037 (95,385, 175,292) 532.06 (387.20, 710.22) 240,044 (175,190, 326,696) 534.10 (390.68, 720.81) 0.04 (0.01, 0.06) Western sub-Saharan Africa 202,779 (146,821, 271,872) 261.40 (189.80, 348.89) 590,223 (430,423, 796,707) 272.75 (198.05, 364.30) 0.09 (0.06, 0.13) ASIR, age-standardized incidence rate; EAPC, estimated annual percentage change; UF, uterine fibroids. Figure 1 Global burden of uterine fibroids (UF) from 1990 to 2021. (A) (B) (C) (D) (E) (F) Six panels depicting global health data trends from 1990 to 2021. Panel A shows incident cases and ASIR; Panel B depicts prevalent cases and ASPR; Panel C illustrates DALYs and ASDR. Panels D to F display 2021 data with case numbers and rates by age group. Blue bars represent case numbers, and red lines indicate rates, with data ranges highlighted in pink. 3.2 UF burden in 21 GBD regions Between 1990 and 2021, 17 of the 21 Global Burden of Disease (GBD) regions experienced an increase in the age-standardized incidence rate (ASIR) of UF. In South Asia, new UF cases increased from 1,149,229 (95% UI: 836,887–1,549,090) in 1990 to 2,902,999 (2,098,361–3,894,859) in 2021. In 1990, Oceania reported the fewest new cases, totaling 3,756 (2,688–5,140), which increased to 9,537 (6,856–13,041) by 2021. Eastern Europe had the highest ASIR, with 605.27 (441.11–791.73) per 100,000 in 1990 and 610.42 (445.44–798.58) per 100,000 in 2021. Australasia reported the lowest ASIR, with 88.04 (62.91–116.19) per 100,000 in 1990 and 87.86 (63.79–117.13) per 100,000 in 2021. The highest EAPC for ASIR was observed in Tropical Latin America, with an annual change rate of 1.40 (1.31–1.50), while Central Europe had the lowest EAPC, at −0.12 (−0.26, 0.03) ( Table 1 Figure 2A Figure 2 Global distribution of uterine fibroids (UF) burden across regions from 1990 to 2021. (A) (B) (C) (D) (E) (F) Six bar graphs compare various health metrics globally and by region for the years 1990 and 2021. Each graph uses blue for 1990 and red for 2021. Graph A shows age-standardized incidence rates, B shows prevalence, C shows disability, D shows mortality rates, E shows years lived with disability, and F shows years of life lost per 100,000 population. Regions include Australasia, Central Europe, Latin America, and Sub-Saharan Africa, among others. Error bars indicate variability. Between 1990 and 2021, 16 of the 21 GBD regions experienced an increase in the age-standardized prevalence rate (ASPR) of UF. In South Asia, prevalent cases increased from 11,277,758 (95% UI: 8,425,178–14,969,226) in 1990 to 31,026,201 (23,111,923–41,226,526) in 2021. In Oceania, prevalent cases increased from 34,952 (26,335–46,162) in 1990 to 94,680 (71,466–125,436) in 2021. Eastern Europe had the highest ASPR, with 6,873.77 (5,206.09–8,872.85) per 100,000 in 1990 and 6,934.45 (5,230.48–8,997.04) per 100,000 in 2021. Australasia recorded the lowest ASPR, with 982.11 (718.38–1,304.30) per 100,000 in 1990 and 979.30 (737.69–1,282.38) per 100,000 in 2021. The highest EAPC for ASPR was found in Tropical Latin America, with an annual change rate of 1.02 (0.93–1.11), while Central Europe had the lowest EAPC at −0.12 (−0.23, −0.01) ( Figure 2B Between 1990 and 2021, the ASDR for UF declined in 15 of the 21 GBD regions. South Asia had the highest DALYs for UF, with 26,020 (95% UI: 15,393–38,286) in 1990 and 49,297 (34,836–68,044) in 2021. Oceania had the fewest DALYs in 1990, with 68 (38–105), while Australasia had the fewest DALYs in 2021, with 78 (46–141). The highest ASDR in 1990 was observed in the Caribbean, with 11.01 (8.65–14.03) per 100,000, while in 2021, the highest ASDR was found in Southern Sub-Saharan Africa, with 10.58 (7.30–13.62) per 100,000. Australasia had the lowest ASDR, with 0.64 (0.44–0.96) per 100,000 in 1990 and 0.42 (0.24–0.76) per 100,000 in 2021. East Asia had the highest EAPC for ASDR, with an annual change rate of 2.32 (1.77–2.87), while Central Europe had the lowest EAPC at −1.91 (−2.16, −1.65) ( Figure 2C Detailed data for UF-related mortality, YLLs, YLDs, and other indicators for 1990 and 2021, along with EAPC data, can be found in Figures 2D–F 3.3 UF burden in 204 GBD countries In 2021, the ASIR of UF showed significant international variation, with rates spanning from 83.69 to 686.95 per 100,000. Latvia, Russia, and Ukraine reported the highest incidence rates, with figures of 686.95 (95% UI: 480.42–918.98), 617.21 (453.11–804.78), and 604.21 (440.62–799.57) per 100,000, respectively. Conversely, New Zealand [83.69 (63.38–106.30) per 100,000], Australia [88.65 (63.68–119.63) per 100,000], and North Korea [108.25 (78.35–145.30) per 100,000] reported the lowest incidence rates. Between 1990 and 2019, Brazil [1.43 (1.33–1.53)], India [1.01 (0.88–1.14)], and the USA [0.96 (0.58–1.35)] exhibited the highest EAPC for ASIR. In contrast, the countries with the lowest EAPC for ASIR were Poland [−0.93 (−1.30, −0.56)], Iran [−0.73 (−1.06, −0.40)], and New Zealand [−0.64 (−0.71, −0.56)]. For further details and additional charts, please refer to the ( Figure 3 Figure 3 Global distribution of uterine fibroids (UF) burden by region in 2021. (A) (B) (C) (D) (E) (F) Six world maps labeled A to F display various health metrics using gradient color scales. Map A shows the number of incidence rates, ranging from blue (low) to red (high). Map B illustrates the ASIR per 100,000 population, with a similar color gradient. Map C depicts prevalence numbers, again using blue to red shades. Map D displays ASPR per 100,000 with green indicating mid-range values. Map E shows DALYs numbers, and Map F presents ADSR per 100,000, both using varied color scales from blue (low) to red (high). Each map includes a color legend for reference. 3.4 UF burden in SDI regions In 2021, the ASIR for UF varied among the five SDI groups: Low, Low-middle, Middle, High-middle, and High. The ASIR was highest in the High SDI group at 265.52 (95% UI: 193.64–348.39) per 100,000, while the Low SDI group had the lowest ASIR at 237.87 (171.82–315.92) per 100,000. Regionally, SDI positively correlated with ASIR ( ρ p Table 1 Figure 4A ρ p Figure 4B ρ p Figure 4C Figure 4 Association between socio-demographic index (SDI) and uterine fibroids (UF) burden across regions from 1990 to 2021. (A) (B) (C) Three scatter plots (A, B, C) show the relationship between socio-demographic index and various rates per 100,000 (ASIR, ASPR, ASDR). Each plot contains data from multiple regions like High-income Asia Pacific, Eastern Europe, and others, represented by different colored and shaped dotted lines. The plots reveal trends across years, marked by different circle sizes for each decade from 1990 to 2021. Correlation coefficients (rho) and p-values are indicated at the top of each plot. 3.5 UF burden by age According to global data from 2021, the burden of UF exhibits a clear age-related trend. Figure 1 Figure 1D Figure 1E Figure 1F 3.6 Health inequality analysis of UF burden This study analyzed health inequalities associated with SDI and further identified trends in the changing burden of UF. In 1990, the SII for the incident of UF was 171.87, and for prevalent, it was 2,523.18, indicating that the burden of incident and prevalent was predominantly concentrated in high SDI countries. However, by 2021, the SII for the incident of UF decreased to 80.11, and for prevalent, it decreased to 2,269.71. This reduction in the SII for both incident and prevalent suggests that, while the burden of UF remains concentrated in high SDI countries, the level of health inequality has diminished. In 1990, the SII for UF's DALYs rate was −0.33, and by 2021, the SII for DALYs rate had increased to −2.03. This indicates that the DALY burden of UF is now predominantly concentrated in low SDI countries, with an increasing level of health inequality ( Figures 5A–C Figures 5D–F Figure 5 Health inequality analysis of uterine fibroids (UF) burden by socio-demographic index (SDI) from 1990 to 2021. (A) (B) (C) (D) (E) (F) Charts A to C display the relationship between crude rates and relative rank by SDI for incidence, prevalence, and DALYs with trend lines for 1990 and 2021, highlighted by inequality indices. Charts D to F show concentration curves for the cumulative fraction of incidence, prevalence, and DALYs against the cumulative population fraction ranked by SDI for the same years, with concentration indices annotated. Bubbles represent countries, sized by population. 3.7 Clustering analysis of UF burden Based on the EAPC trends of ASIR and ASDR for UF from 1990 to 2021, we performed hierarchical clustering of 21 GBD regions, dividing them into three main clusters ( Figures 6A,B Figure 6 Clustering analysis of uterine fibroids (UF) burden by region from 1990 to 2021. (A) (B) Panel A shows a phylogenetic tree categorizing regions by color-coded trends: blue for significant decrease, green for stability or minor increase, and red for significant increase. Panel B displays a scatter plot of EAPC_ASIR versus EAPC_ASDR, using similar color coding. Blue circles indicate significant decrease, green triangles for stability or minor increase, and red squares for significant increase. 3.8 BAPC prediction analysis of UF burden Utilizing the BAPC package in R, we projected 15-year trends for ASIR, ASPR, and ASDR of UF. In 1990, the global ASIR for UF was 241.63 per 100,000. Despite fluctuations across the years, the overall trend shows a gradual increase in ASIR over time. By 2021, the ASIR rose to 258.53 per 100,000 and is projected to further increase to 263.19 per 100,000 by 2036 ( Figure 7A Figure 7B Figure 7C Figure 7 Projection of uterine fibroids (UF) burden from 2021 to 2036. (A) (B) (C) Three line graphs labeled A, B, and C forecast global health indices from before 2020 to beyond 2030. Graph A displays the ASIR per 100,000 with a gradual increase and widening prediction interval. Graph B shows a stable ASPR per 100,000 with a similar widening interval. Graph C illustrates a slightly declining ASDR per 100,000, also with widening predictions. Each graph has a dotted line transitioning into a shaded cone representing the forecast uncertainty. These comparisons reveal the trends in ASIR, ASPR, and ASDR for UF throughout the prediction period. Figure 7A Figure 7B Figure 7C 4 Discussion UF, the most prevalent benign tumors in the female reproductive system, have emerged as a major global health concern for women ( 3 The study found that from 1990 to 2021, the global incidence, prevalence, and DALYs of UF significantly increased, while the ASIR and ASPR showed a slight upward trend, with EAPCs of 0.24% and 0.04%, respectively, and the ASDR remained stable without significant change. It is crucial to differentiate the drivers behind the observed trends. The dramatic increase in the absolute number of incidence, prevalence and DALYs is largely attributable to demographic factors, specifically global population growth and the aging of the female population. In contrast, the modest but steady increase in the ASIR and ASPR suggests a true, albeit small, rise in the per-capita risk of developing or being diagnosed with UF over time. This epidemiological shift may be linked to changing risk factor profiles, such as race, genetic predisposition, lifestyle, rising obesity rates, hypertension and shifts in reproductive patterns, as well as improved detection and diagnosis in many parts of the world ( 22 Placing our findings in the context of other GBD-based gynecological disease studies offers valuable insights. For instance, the global burden of cervical cancer has shown a decreasing trend in age-standardized rates, largely due to successful screening programs and HPV vaccination, particularly in high-SDI countries ( 23 Socio-economic and cultural factors, such as education level and healthcare access, also play a crucial role. A study conducted in Haiti found that a higher level of education was associated with a lower prevalence of uterine fibroids, suggesting that education may reduce the incidence of uterine fibroids by improving health awareness and promoting early diagnosis ( 24 25 26 Although advancements in disease management and treatment may have contributed to the relatively stable trend in ASDR, they have not substantially decreased the incidence and prevalence of UF. Differences in healthcare resources, the availability of treatment options, and the coverage of early diagnosis can significantly impact the assessment of the disease burden of uterine fibroids, particularly in terms of DALYs, across different countries and regions. In high-income countries, where healthcare resources are abundant, the treatment of uterine fibroids is typically more standardized and aggressive, with a wider range of both surgical and non-surgical treatment options available. As a result, early diagnosis and treatment may help reduce the disease burden and decrease DALYs. Hysterectomy remains the traditional surgical approach for treating uterine fibroids, but in recent years, myomectomy as a uterus-preserving option, has gained increasing attention ( 27 At the regional level, the burden of UF shows significant heterogeneity. South Asia leads the world in both the incidence and prevalence of UF, likely due to its large population, uneven healthcare resource distribution, and socio-economic disparities ( 28 29 2 3 19 However, it is important to note that epidemiological data on uterine fibroids are limited in certain regions, especially in low- and middle-income countries such as those in Africa, where the diagnosis rate is lower. This is partly due to the lack of typical symptoms in many women and limited opportunities for effective disease screening, which results in a significant number of undiagnosed cases ( 30 31 32 The hierarchical clustering analysis of the EAPC for ASIR and ASDR of UF from 1990 to 2021 revealed three primary clusters among the 21 GBD regions. Regions indicated in red text, including Tropical Latin America, High-income North America, and East Asia, exhibited a notable increase in both ASIR and ASDR. Particularly, the Tropical Latin America region exhibited a rapid increase in the UF burden. Recent epidemiological studies in Latin America and the Caribbean indicate a notable increase in chronic and non-communicable diseases, attributed to rapid urbanization, lifestyle changes, and enhanced healthcare access ( 33 34 35 36 National variations in ASIR of UF highlight significant healthcare disparities. Latvia, Russia, and Ukraine have the highest ASIR for UF, while New Zealand, Australia, and North Korea have the lowest ASIR. These differences may be attributed to variations in healthcare systems, health screening coverage, lifestyle factors, and socio-cultural influences across countries. For instance, some countries may diagnose UF earlier due to more extensive health screening programs, whereas others may underestimate the incidence of UF due to a lack of sufficient medical resources. Additionally, differences in global health policies and healthcare services may contribute to varying incidence rates of UF. Some countries may allocate more resources to early screening and diagnosis, leading to a higher reported incidence, while others may underreport actual incidence due to resource constraints ( 16 This study's health inequality analysis uncovered the link between socio-economic status and the burden of UF. The SII and concentration index reveal a shift in the incidence and prevalence of UF from high SDI countries in 1990 to middle- and low-SDI countries by 2021. This shift may be linked to changes in the global socio-economic structure, the reallocation of healthcare resources, and an increase in health awareness, particularly the improvement in diagnostic rates and the expansion of data coverage in low- and middle-SDI countries. High-SDI countries typically have more advanced healthcare systems and greater healthcare accessibility, which means they can more effectively carry out early diagnosis and disease management. As a result, diagnostic rates for uterine fibroids in these countries are generally higher, leading to more accurate reporting of the disease burden. However, in low-SDI countries, although the actual burden of uterine fibroids may be similar to that in high-SDI countries, lower levels of healthcare and the lack of early diagnostic opportunities may result in many cases going undiagnosed or unreported. With advancements in diagnostic technology and improvements in healthcare resources, more low-SDI countries are beginning to identify and report more cases, which makes the disease burden appear to increase in these regions. Therefore, the observed shift in the burden of uterine fibroids toward low-SDI countries may, in part, be due to improvements in diagnosis and data collection, rather than an actual increase in burden. Given that the trends between SDI and uterine fibroid burden may be influenced by data quality, diagnostic technology, and reporting systems, future research should further investigate the role of these factors in the estimation of disease burden. The burden of UF, as measured by DALYs, is predominantly concentrated in low-SDI countries, where health inequality has worsened. Despite advancements in diagnosis and treatment in some regions, the impact on women's health remains disproportionately high in resource-limited areas ( 15 This study utilized the BAPC model to forecast the 15-year trends in ASIR, ASPR, and ASDR of UF. The results predict that although the ASIR and ASPR of UF are expected to continue increasing, the ASDR is likely to steadily decrease. This prediction reflects global advancements in early diagnosis and treatment of UF, particularly in non-surgical treatments and early interventions ( 37 39 Future efforts to prevent and treat UF will face multiple challenges, with significant variation in prevalence across countries and regions. As the burden of UF shifts increasingly toward low-SDI countries, particularly in low- and middle-income nations, these regions struggle with limited healthcare resources, inadequate screening, and inefficient diagnostic and treatment protocols. This results in barriers to early diagnosis and treatment for women, exacerbating the disease burden. Furthermore, women in impoverished areas often lack the financial means to access necessary treatments, further amplifying the impact of UF. In high-income countries, while overall incidence has decreased, certain groups remain at higher risk. Additionally, lifestyle and reproductive changes—such as poor diet, lack of exercise, environmental pollution, and delayed childbearing—may alter the pathophysiology of UF, complicating prevention and treatment efforts ( 40 42 While this study did not conduct a formal economic analysis, the findings have significant financial implications. The rising prevalence of UF, particularly in LMICs, suggests a growing, often unmeasured, economic burden from direct medical costs and indirect costs like lost productivity. As noted, the annual cost in the US is estimated in the tens of billions of dollars ( 15 While offering an in-depth analysis of the global burden of UF using the GBD database, this study has certain limitations. First, the GBD data's dependence on country-level reports and statistical modeling can result in data quality inconsistencies, particularly in low- and middle-income countries. This may lead to an underestimation of the true disease burden, especially for a condition like UF that is often asymptomatic. Second, this study did not include a formal sensitivity analysis to test the robustness of our findings against different modeling assumptions, which limits the certainty of the conclusions. Third, the GBD dataset does not contain individual-level data on risk factors such as race, lifestyle, or environmental exposures, nor does it capture patient-reported outcomes (PROs) or the psychological impact of the disease. This means our analysis cannot explore the etiological drivers or the full patient experience of UF. Fourth, our predictions are based on the BAPC model, which assumes that past trends will continue; unforeseen changes in healthcare or risk factors could alter future outcomes. Finally, this analysis uses the GBD 2021 data, the most recent comprehensive dataset available. However, public health landscapes are dynamic, and continuous monitoring with updated data will be necessary to track future trends accurately. This study examines GBD data from 1990 to 2021 to highlight the global, regional, and national burden and trends of UF. Despite the increasing global ASIR and ASPR of UF, the ASDR are projected to decline. However, there are significant disparities in the burden of UF between different regions and countries, and health inequalities persist. Future initiatives for preventing and treating UF should prioritize strengthening international collaboration, especially in middle- and low-SDI countries. Actionable steps include investing in low-cost diagnostic technologies, implementing targeted screening for high-risk populations, and developing public health campaigns to improve health literacy about UF. Additionally, future research should focus on region-specific risk factors, cost-effectiveness of interventions, and the patient experience to develop more effective prevention and treatment strategies, ultimately improving the health of women worldwide. Acknowledgments We thank all members of Global Burden of Disease Collaborative Network and Institute for Health Metrics and Evaluation (IHME). Data availability statement The original contributions presented in the study are included in the article/Supplementary Material, further inquiries can be directed to the corresponding authors. Ethics statement Ethical approval was not required for the study involving humans in accordance with the local legislation and institutional requirements. Written informed consent to participate in this study was not required from the participants or the participants' legal guardians/next of kin in accordance with the national legislation and the institutional requirements. Author contributions CW: Methodology, Formal analysis, Data curation, Conceptualization, Software, Investigation, Writing – original draft, Writing – review & editing. LZ: Software, Writing – review & editing, Conceptualization, Investigation, Writing – original draft. RC: Writing – original draft, Writing – review & editing, Methodology, Data curation. HL: Writing – review & editing, Writing – original draft, Formal analysis. JL: Software, Writing – original draft, Writing – review & editing. FG: Writing – original draft, Conceptualization, Writing – review & editing. RL: Writing – review & editing, Methodology, Writing – original draft. HZ: Writing – original draft, Conceptualization, Writing – review & editing, Investigation, Software. JH: Formal analysis, Methodology, Data curation, Writing – original draft, Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher's note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1. Vafaei S Alkhrait S Yang Q Ali M Al-Hendy A Empowering strategies for lifestyle interventions, diet modifications, and environmental practices for uterine fibroid prevention; unveiling the LIFE UP awareness Nutrients 2024 16 6 807 10.3390/nu16060807 38542717 PMC10975324 2. Langton CR Harmon QE Baird DD Family history and uterine fibroid development in black and African American women JAMA Netw Open 2024 7 4 e244185 10.1001/jamanetworkopen.2024.4185 38568693 PMC10993075 3. Mitro SD Dyer W Lee C Bindra A Wang L Ritterman Weintraub M Uterine fibroid diagnosis by race and ethnicity in an integrated health care system JAMA Netw Open 2025 8 4 e255235 10.1001/jamanetworkopen.2025.5235 40172885 PMC11966321 4. Sinai Talaulikar V Medical therapy for fibroids: an overview Best Pract Res Clin Obstet Gynaecol 2018 46 48 56 10.1016/j.bpobgyn.2017.09.007 29066045 5. Zhao R Wang X Zou L Li G Chen Y Li C Adverse obstetric outcomes in pregnant women with uterine fibroids in China: a multicenter survey involving 112,403 deliveries PLoS One 2017 12 11 e0187821 10.1371/journal.pone.0187821 29136018 PMC5685483 6. Donnez J Taylor HS Marcellin L Dolmans M-M Uterine fibroid-related infertility: mechanisms and management Fertil Steril 2024 122 1 31 9 10.1016/j.fertnstert.2024.02.049 38453041 7. Mlodawska OW Saini P Parker JB Wei J-J Bulun SE Simon MA Epigenomic and enhancer dysregulation in uterine leiomyomas Hum Reprod Update 2022 28 4 518 47 10.1093/humupd/dmac008 35199155 PMC9247409 8. Katon JG Plowden TC Marsh EE Racial disparities in uterine fibroids and endometriosis: a systematic review and application of social, structural, and political context Fertil Steril 2023 119 3 355 63 10.1016/j.fertnstert.2023.01.022 36682686 PMC9992263 9. de Smit NS de Lange ME Boomsma MF Huirne JAF Hehenkamp WJK Current treatment for symptomatic uterine fibroids: available evidence and therapeutic dilemmas Lancet 2025 406 10498 91 102 10.1016/S0140-6736(25)00728-7 40544858 10. Puscasiu L Vollenhoven B Nagels HE Melinte I-M Showell MG Lethaby A Preoperative medical therapy before surgery for uterine fibroids Cochrane Database Syst Rev 2025 4 4 CD000547 10.1002/14651858.CD000547.pub3 40183418 PMC11969932 11. Clements W Brown N Buckley B Rogan C Kok HK Liang E Quality care guidelines for uterine artery embolisation in women with symptomatic uterine fibroids in Australia and New Zealand: according to the AGREE-II checklist and endorsed by the interventional radiology society of Australasia J Med Imaging Radiat Oncol 2022 66 6 819 25 10.1111/1754-9485.13455 35785440 PMC9545349 12. Sandrieser L Kuessel L Perricos A Wenzl R Husslein H Myomectomy for a large uterine fibroid via mini-laparotomy: a step-by-step video tutorial Fertil Steril 2022 117 2 456 7 10.1016/j.fertnstert.2021.11.018 34980426 13. Cardozo ER Clark AD Banks NK Henne MB Stegmann BJ Segars JH The estimated annual cost of uterine leiomyomata in the United States Am J Obstet Gynecol 2012 206 3 211.e1 9 10.1016/j.ajog.2011.12.002 22244472 PMC3292655 14. Soliman AM Yang H Du EX Kelkar SS Winkel C The direct and indirect costs of uterine fibroid tumors: a systematic review of the literature between 2000 and 2013 Am J Obstet Gynecol 2015 213 2 141 60 10.1016/j.ajog.2015.03.019 25771213 15. Hazimeh D Coco A Casubhoy I Segars J Singh B The annual economic burden of uterine fibroids in the United States (2010 versus 2022): a comparative cost-analysis Reprod Sci (Thousand Oaks, Calif) 2024 31 12 3743 56 10.1007/s43032-024-01727-0 39455488 16. Manuel EC Plowden TC Valbuena FM Jr Bryce RL Barick AA Ramakrishnan A The environment, leiomyomas, latinas, and adiposity study: rationale and design Am J Obstet Gynecol 2022 226 3 392.e1 12 10.1016/j.ajog.2021.05.005 33974903 17. Yu O Scholes D Schulze-Rath R Grafton J Hansen K Reed SD A US population-based study of uterine fibroid diagnosis incidence, trends, and prevalence: 2005 through 2014 Am J Obstet Gynecol 2018 219 6 591.e1 8 10.1016/j.ajog.2018.09.039 30291840 18. Barreto SM Miranda JJ Figueroa JP Schmidt MI Munoz S Kuri-Morales PP Epidemiology in Latin America and the Caribbean: current situation and challenges Int J Epidemiol 2012 41 2 557 71 10.1093/ije/dys017 22407860 PMC3324459 19. Clements W Ang WC Law M Goh GS Treatment of symptomatic fibroid disease using uterine fibroid embolisation: an Australian perspective Aust N Z J Obstet Gynaecol 2020 60 3 324 9 10.1111/ajo.13120 31956995 20. Lou Z Huang Y Li S Luo Z Li C Chu K Global, regional, and national time trends in incidence, prevalence, years lived with disability for uterine fibroids, 1990–2019: an age-period-cohort analysis for the global burden of disease 2019 study BMC Public Health 2023 23 1 916 10.1186/s12889-023-15765-x 37208621 PMC10199532 21. Li B Wang F Chen L Tong H Global epidemiological characteristics of uterine fibroids Arch Med Sci 2023 19 6 1802 10 10.5114/aoms/171786 38058724 PMC10696973 22. Mitro SD Wise LA Waetjen LE Lee C Zaritsky E Harlow SD Hypertension, cardiovascular risk factors, and uterine fibroid diagnosis in midlife JAMA Netw Open 2024 7 4 e246832 10.1001/jamanetworkopen.2024.6832 38625699 PMC11022113 23. Li T Zhang H Lian M He Q Lv M Zhai L Global status and attributable risk factors of breast, cervical, ovarian, and uterine cancers from 1990 to 2021 J Hematol Oncol 2025 18 1 5 10.1186/s13045-025-01660-y 39794860 PMC11721161 24. Millien C Manzi A Katz AM Gilbert H Fawzi S Farmer MC Assessing burden, risk factors, and perceived impact of uterine fibroids on women’s lives in rural Haiti: implications for advancing a health equity agenda, a mixed methods study Int J Equity Health 2021 20 1 1 10.1186/s12939-020-01327-9 33386078 PMC7777531 25. Krzyżanowski J Paszkowski T Szkodziak P Woźniak S Advancements and emerging therapies in the medical management of uterine fibroids: a comprehensive scoping review Med Sci Monit 2024 30 e943614 10.12659/msm.943614 38837949 PMC11163935 26. Singh SS Belland L Contemporary management of uterine fibroids: focus on emerging medical treatments Curr Med Res Opin 2015 31 1 1 12 10.1185/03007995.2014.982246 25365466 27. Cronan J Horný M Duszak R Newsome J Carlos J Hughes R Invasive procedural treatments for symptomatic uterine fibroids: a cost analysis J Am Coll Radiol 2020 17 10 1237 44 10.1016/j.jacr.2020.03.018 32360526 28. Singh SK Chauhan K Tripathi V Key drivers of hysterectomy among women of reproductive age in three states in India: comparative evidence from NFHS-4 and NFHS-5 BMC Women’s Health 2024 24 1 107 10.1186/s12905-024-02886-7 38336664 PMC10854047 29. Wilson LF Moss KM Doust J Farquhar CM Mishra GD First Australian estimates of incidence and prevalence of uterine fibroids: a data linkage cohort study 2000–2022 Hum Reprod (Oxford, England) 2024 39 9 2134 43 10.1093/humrep/deae162 PMC11373412 39013145 30. Adebamowo CA Morhason-Bello IO Adebamowo SN Validation of self-report of uterine fibroid diagnosis using a transvaginal ultrasound scan Sci Rep 2023 13 1 9091 10.1038/s41598-023-36313-y 37277479 PMC10241956 31. Adebamowo CA Adebamowo SN Population-based study of the reproductive risk factors for transvaginal ultrasound diagnosed uterine fibroids in Nigerian women Sci Rep 2023 13 1 18926 10.1038/s41598-023-44703-5 37919335 PMC10622570 32. Morhason-Bello IO Adebamowo CA Epidemiology of uterine fibroid in black African women: a systematic scoping review BMJ Open 2022 12 8 e052053 10.1136/bmjopen-2021-052053 35922099 PMC9353014 33. Berman JM Shashoua A Olson C Brucker S Thiel JA Bhagavath B Case series of reproductive outcomes after laparoscopic radiofrequency ablation of symptomatic myomas J Minim Invasive Gynecol 2020 27 3 639 45 10.1016/j.jmig.2019.06.009 31238151 34. Jefferies K Bland L Oladimeji B Rothfus M Etowa J Alleyne A Uterine fibroids and black people of African descent globally: a scoping review protocol BMJ Open 2024 14 8 e085622 10.1136/bmjopen-2024-085622 39182930 PMC11404183 35. Wang Y-X Farland LV Gaskins AJ Wang S Terry KL Rexrode KM Endometriosis and uterine fibroids and risk of premature mortality: prospective cohort study Br Med J 2024 387 e078797 10.1136/bmj-2023-078797 39567014 PMC11577545 36. Yu O Schulze-Rath R Grafton J Hansen K Scholes D Reed SD Adenomyosis incidence, prevalence and treatment: United States population-based study 2006–2015 Am J Obstet Gynecol 2020 223 1 94.e1 e10 10.1016/j.ajog.2020.01.016 31954156 37. Engel J Foster T The importance of shared decision making and patient preferences in uterine fibroid treatment outcomes research Am J Obstet Gynecol 2021 224 3 330 1 10.1016/j.ajog.2020.11.014 33212039 38. Serres-Cousine O Kuijper FM Curis E Atashroo D Clinical investigation of fertility after uterine artery embolization Am J Obstet Gynecol 2021 225 4 403.e1 e22 10.1016/j.ajog.2021.05.033 34058169 39. Zaritsky E Le A Tucker L-Y Ojo A Weintraub MR Raine-Bennett T Minimally invasive myomectomy: practice trends and differences between black and non-black women within a large integrated healthcare system Am J Obstet Gynecol 2022 226 6 826.e1 e11 10.1016/j.ajog.2022.01.022 35101407 40. Berta DG Kuisma H Välimäki N Räisänen M Jäntti M Pasanen A Deficient H2A.Z deposition is associated with genesis of uterine leiomyoma Nature 2021 596 7872 398 403 10.1038/s41586-021-03747-1 34349258 41. Bulun SE Yin P Wei J-J Zuberi A Iizuka T Suzuki T Uterine fibroids Physiol Rev 2025 105 4 1947 88 10.1152/physrev.00010.2024 40214304 PMC12419501 42. Yang Q Ciebiera M Bariani MV Ali M Elkafas H Boyer TG Comprehensive review of uterine fibroids: developmental origin, pathogenesis, and treatment Endocr Rev 2022 43 4 678 719 10.1210/endrev/bnab039 34741454 PMC9277653 ",
  "metadata": {
    "Title of this paper": "Comprehensive review of uterine fibroids: developmental origin, pathogenesis, and treatment",
    "Journal it was published in:": "Frontiers in Reproductive Health",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488583/"
  }
}