{
  "title": "Paper_188",
  "abstract": "pmc SAGE Open Nurs SAGE Open Nurs 3964 son SON SAGE Open Nursing 2377-9608 SAGE Publications PMC12489196 PMC12489196.1 12489196 12489196 10.1177/23779608251382659 10.1177_23779608251382659 1 Mental Health Care – Review Article Redefining Strength: Challenging the Strong Black Woman Stereotype in Nursing Education and Leadership https://orcid.org/0000-0003-2353-0410 Iheduru-Anderson Kechi EdD, DNP, RN, CNE, CWCN 1 Akanegbu Christiana DNP, APRN, FNP-BC, NRCME, CNE 2 Ugorji Julia U DNP, MSN/Ed, RN 3  1 416163 The Herbert H. and Grace A. Dow College of Health Professions, Central Michigan University  2 10645 Emmanuel College  3 32916 Southwest Minnesota State University Kechi Iheduru-Anderson, School of Rehabilitation and Medical Sciences, The Herbert H. and Grace A. Dow College of Health Professions, Central Michigan University, Mount Pleasant, MI 48858, USA. \nEmail: ihedu1k@cmich.edu 1 10 2025 Jan-Dec 2025 11 478307 23779608251382659 21 1 2025 27 8 2025 11 9 2025 01 10 2025 03 10 2025 03 10 2025 © The Author(s) 2025 2025 SAGE Publications, Inc. https://creativecommons.org/licenses/by-nc/4.0/ This article is distributed under the terms of the Creative Commons Attribution-NonCommercial 4.0 License ( https://creativecommons.org/licenses/by-nc/4.0/ https://us.sagepub.com/en-us/nam/open-access-at-sage Introduction The Strong Black Woman (SBW) schema, deeply embedded in sociocultural and historical narratives, portrays Black women as inherently resilient, self-sacrificing, and emotionally restrained. While it can serve as a source of pride and survival, the schema often imposes psychological, emotional, and physical burdens—particularly in academic nursing, where systemic inequities intersect with racialized and gendered expectations. This paper examines how the SBW schema operates in nursing education and leadership and advocates for a redefinition of strength that embraces vulnerability, wellness, and collective care. Methods This narrative review synthesizes research on the SBW schema with a focus on its historical origins, cultural significance, and psychological impacts. Peer-reviewed publications in English from 2000 to 2024 were identified through searches in CINAHL, PubMed, ERIC, EBSCO, and Google Scholar using terms related to the SBW schema and nursing contexts. Although few nursing-specific studies exist, key articles by Jefferies, and Parks and Hayman informed the discussion. Additional insights were drawn from psychology, sociology, public health, and Black feminist theory to contextualize its implications for nursing education and leadership. Results The schema contributes to emotional suppression, delayed help-seeking, and heightened risk of burnout. In predominantly white institutions, Black women in nursing experience amplified pressures to overperform, serve as cultural representatives, and navigate professional isolation. These expectations are reinforced by intergenerational and media-driven narratives. While the schema can foster pride and perseverance, its glorification masks its long-term mental health consequences. Emerging literature calls for a paradigm shift that integrates emotional authenticity and systemic support into nursing leadership and education. Conclusion Redefining strength in nursing requires dismantling individualistic ideals of resilience and affirming vulnerability as a culturally grounded act of care and resistance. Structural change must include equity-focused policies, antiracist leadership development, and emotionally safe environments that validate the full humanity of Black women in academic nursing. Strong black woman mental health disparities health and wellness nursing education black women's health higher education leadership systemic reform cultural resilience pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes typesetter ts19 cover-date January-December 2025 Introduction The Strong Black Woman (SBW) schema—also referred to as the Superwoman Schema, Sojourner Syndrome, or SBW archetype—has historically symbolized resilience, independence, and fortitude, rooted in the sociopolitical struggles faced by Black American women during slavery and beyond ( Abrams et al., 2014 Parks & Hayman, 2024 Woods-Giscombé, 2010 Beauboeuf-Lafontant, 2007 Thomas et al., 2022 Iheduru-Anderson et al., 2025 Jefferies, 2022 Abrams et al., 2019 Watson-Singleton et al., 2024 Vulnerability, in this context, refers not simply to personal openness but to the ability to express emotional needs, seek support, and disclose distress without fear of dismissal, judgment, or retribution. For Black women in academic spaces, however, vulnerability is often neither safe nor socially rewarded, making it a political and emotional risk rather than a neutral act of authenticity ( Adebayo et al., 2021 Iheduru-Anderson et al., 2022 Showunmi, 2023 This culturally significant ideal portrays Black women as embodying strength, self-reliance, and resilience, often at the expense of their emotional well-being ( Liao et al., 2020 Nelson et al., 2016 Watson-Singleton et al., 2024 Collins, 2000a Woods-Giscombé, 2010 Amankwaa, 2003 Beauboeuf-Lafontant, 2007 In nursing academia, a field historically shaped by white, Eurocentric values, the SBW archetype has provided a framework for survival and success. However, its unrelenting demands often take a toll on the mental, emotional, and physical well-being of those who embody it ( Beauboeuf-Lafontant, 2007 This paper unpacks the hidden dangers of the SBW archetype within academic nursing, revealing how traits often celebrated as strengths—such as self-reliance, emotional restraint, and unyielding resilience—can become liabilities when shaped by systemic racism and gendered expectations. It explores how the SBW schema intersects with professional identity formation, mental health, and leadership development, particularly within the context of PWIs. Special attention is given to vulnerability as a critical, yet underexamined, counterpoint to the prevailing ideal of strength. By examining the historical foundations, perceived advantages, and overlooked costs of this cultural construct, the analysis highlights how adherence to the SBW ideal influences Black women's health, relationships, and professional trajectories in nursing education and leadership. It also addresses the added burden of mentoring and the persistent pressure to perform strength as a prerequisite for legitimacy. Recognizing these complexities, this paper sets out to challenge dominant narratives surrounding strength and resilience in academic nursing. Purpose The purpose of this paper is to challenge the assumption that strength must exclude vulnerability by advocating for a redefinition of resilience in academic nursing. It seeks to reframe the SBW schema through historical, cultural, and psychological lenses, drawing attention to its impact on Black women's mental health, career advancement, and leadership capacity. Finally, the paper offers actionable strategies for cultivating more inclusive, affirming, and equity-driven environments in nursing education and leadership. The Key Characteristics of the SBW Archetype The SBW Schema Table 1 Table 1. The Historical Evolution of the Core Terms Describing the SBW Schema. Term Focus / Emphasis Scholars / Usage Strong Black Woman Emotional strength, independence, caregiving roles Woods-Giscombé (2010) Beauboeuf-Lafontant (2007) Superwoman Schema Multitasking, overachievement, emotional suppression Nelson et al. (2016) Woods-Giscombé (2010) Mammy Submissive caregiver, maternal figure  Collins (2000b) Black Superwoman Competence and emotional suppression Romero (2000) Wallace et al. (2023) Strong Black Mother Resilience and strength in motherhood Reynolds (2020) Reynolds (2005) Harris-Lacewell (2001) Resilient Black Woman Overcoming adversity and trauma  Abrams et al. (2014) Indestructible Black Woman Invulnerability and extreme self-reliance  Harris-Perry (2011) Sojourner Syndrome Intersection of racial, gendered, and class oppression in Black women's lives; Disproportionate exposure to medical neglect especially in obstetrics  Banda (2025) Lekan (2009) Zakama et al. (2025) At its core, the SBW construct is defined by three interlocking characteristics: emotional restraint, independence, and self-sacrifice. These traits are not simply internalized but are socially reinforced, urging Black women to prioritize others’ well-being—often at the expense of their own physical and emotional health. This enduring pressure to maintain an image of unshakable strength and stoicism contributes to chronic emotional suppression and neglect of self-care ( Geyton et al., 2022 Godbolt et al., 2022 Jefferies, 2022 West et al., 2016 Moreover, the archetype frequently pushes Black women to adopt unrealistically high expectations for themselves, all while striving to fulfill the needs and expectations of others ( Abrams et al., 2014 Geyton et al., 2022 Woods-Giscombé (2010) Woods-Giscombe et al., 2019 Table 2 Table 2 Woods-Giscombé (2010 2019 Table 2. Common Themes Across Terms. Theme Description Self-Silencing and Emotional Suppression Expectation to hide vulnerability and avoid expressing emotional distress. Self-Reliance Pressure to handle challenges alone, avoiding asking for help. Caretaking Burden Assumed role of nurturer and caregiver for family, community, and others. Unrealistic Resilience Endurance in the face of adversity and systemic injustice without acknowledgment of suffering. Perfectionism Tendency to strive for excellence under internalized and external expectations. Hyper-responsibility Sense of obligation to solve others’ problems, often at personal cost. Deprioritization of Self Self-worth measured through service to others, often neglecting personal needs. Methods The SBW archetype has profound implications for nursing education and leadership, though its specific effects in these contexts remain underexplored. This narrative review synthesizes research on the SBW construct, focusing on its historical origins, cultural significance, and psychological impacts. The analysis also integrates findings from adjacent disciplines—such as psychology, sociology, public health, and Black feminist theory—to contextualize its relevance to nursing. Targeted searches were conducted using CINAHL, PubMed, ERIC, EBSCO, and Google Scholar to identify peer-reviewed publications in English between 2000 and 2024. Search strategies combined terms related to the SBW schema (e.g., “Strong Black Woman,” “SBW stereotype,” “Strong Black woman archetype,” “Superwoman ideology”) with terms related to nursing contexts (e.g., “nursing,” “nursing education,” “nursing leadership,” “leadership”). Articles were included if they addressed the SBW schema or related constructs (e.g., Superwoman ideology, Sojourner Syndrome) and examined their influence on mental health, identity formation, or the professional experiences of Black women in academic or healthcare leadership settings. Foundational studies from adjacent disciplines were included when they offered conceptual relevance and enhanced understanding of how the SBW schema operates in professional spaces, particularly in nursing. Studies were excluded if they were not published in English, fell outside the 2000–2024 date range (unless historically significant), or were not peer-reviewed. Additionally, literature that focused solely on clinical practice or patient outcomes, without addressing identity, leadership, or the broader structural dynamics relevant to the SBW schema, was excluded. The search yielded a limited number of nursing-specific publications directly addressing the SBW archetype. However, two recent articles— Jefferies (2022) Parks and Hayman (2024) Godbolt et al., 2022 Nelson et al., 2016 West et al., 2016 Woods-Giscombé, 2010 Given the narrative review methodology, a PRISMA flow diagram was not employed. Results The search process yielded a limited number of nursing-specific publications addressing the Strong Black Woman (SBW) schema. Notably, two recent studies— Jefferies (2022) Parks and Hayman (2024) Jefferies (2022) Parks and Hayman (2024) Historical Origins and Evolution of the SBW Schema The SBW schema emerged from the convergence of historical, racial, and gendered ideologies during slavery, where resilience, self-reliance, and emotional suppression were essential survival mechanisms ( Woods-Giscombé, 2010 As Beauboeuf-Lafontant (2007) Collins (2000b) The Civil Rights Movement further entrenched this image. Unlike mainstream feminist movements, which often sought liberation from domesticity, Black women were celebrated for their perseverance in activism, caregiving, and leadership. Yet, their emotional and physical labor remained overlooked and undervalued ( Watson & Hunter, 2016 Nelson et al., 2024 Cultural Transmission of the SBW Schema: Family, Media, and Identity Formation The SBW schema has been transmitted intergenerationally through both familial socialization and cultural media, reinforcing its endurance across generations. Historically, maternal figures have played a critical role in modeling resilience, self-reliance, and emotional suppression as survival tools in response to racialized and gendered oppression ( Leath et al., 2023 Nelson et al., 2016 This schema is further reinforced in adolescence through social media and popular culture, which often celebrate idealized versions of strength. Hashtags like #BlackGirlMagic promote empowerment but can also intensify pressure to maintain perfection and suppress struggle ( Stanton et al., 2017 Anyiwo et al. (2018) Together, these familial and media-driven messages solidify the SBW schema as both a source of cultural pride and psychological burden. Wallace et al. (2023) Psychological and Healthcare Impacts of the SBW Schema The SBW schema contributes significantly to both psychological distress and healthcare disparities among Black women. Its core traits—emotional suppression, self-reliance, and self-sacrifice—have been consistently linked to chronic stress, anxiety, hypertension, and delays in seeking care ( Henry & Song, 2024 Godbolt et al., 2022 Amankwaa (2003) Nelson et al. (2020) These psychological burdens are compounded by systemic failures in healthcare. The SBW stereotype often leads providers to underestimate or dismiss Black women's symptoms, particularly in maternal care and pain management settings ( Abrams et al., 2014 Nelson et al., 2016 In addition to these systemic disparities, the SBW schema also produces significant internal mental health consequences. Volpe et al. (2024) To challenge these dynamics, Nelson et al. (2016) Godbolt et al. (2022) Benight and Bandura (2004) By integrating the psychological and systemic consequences of the SBW schema, this section underscores the urgent need for care models that honor Black women's full emotional range and humanity. Promoting vulnerability, empathy, and emotional validation in clinical encounters is not only therapeutic—it is foundational to health equity. The Duality of the Strong Black Woman Archetype The SBW schema serves as a counterimage to negative stereotypes and is deeply embedded in cultural and historical narratives ( Denyse et al., 2023 Hall, 2017 Leath et al. (2023) Nelson et al. (2024) However, the SBW schema imposes significant emotional burdens. Emotional suppression, a core aspect of the schema, is tied to poor mental health outcomes. Liao et al. (2020) Denyse et al. (2023) Jefferies (2022) The SBW archetype embodies a complex interplay of positive and negative attributes. Table 3 Table 3. Summary of the Positive and Negative Attributes of the SBW Archetype. Attribute Description Positive attributes Resilience and Perseverance Demonstrates overcoming adversity and thriving in challenging situations, inspiring others facing difficulties. Role Model and Inspiration Serves as a powerful role model, encouraging others to pursue their goals and aspirations. Leadership Qualities Highlights strong leadership, contributing to diversity in leadership roles and breaking down stereotypes. Community Support and Advocacy Engages in community building, mentorship, and advocacy, uplifting and empowering others. Cultural Pride and Identity It reinforces cultural pride by celebrating Black heritage, history, and societal contributions ( Etowa et al., 2017 Negative Attributes Suppressing Vulnerability Discourages open emotional expression, creating barriers to seeking help or acknowledging the need for support. Risk of Burnout The persistent pressure to embody the Strong Black Woman archetype often results in significant physical and mental exhaustion. Corbin et al. (2018) Stereotyping and Oversimplification Leads to one-dimensional perceptions, overlooking the diversity of experiences and identities within the Black community. Expectations of Invincibility. Promotes unrealistic expectations, reducing empathy and support during personal or professional challenges. Impact on Mental Health. Internalizing the archetype contributes to stress, anxiety, isolation, and poor mental health outcomes. The archetype may have negative consequences for mental health. Limited Individuality. Overshadows the multifaceted identities of Black women, prioritizing strength over other attributes and talents. Barriers to Seeking Help Creates fear of being perceived as weak, deterring individuals from accessing support or mental health care. Discussion The SBW schema continues to shape the lived experiences of Black women in nursing academia, where expectations of overperformance, emotional stoicism, and cultural labor are deeply embedded. This discussion section critically examines how the schema manifests in academic settings, highlights gaps in nursing literature, and interrogates its evolving yet persistent presence in professional culture and media. Together, these insights demonstrate the urgent need to rethink how strength is constructed and valued in nursing leadership and education. Manifestations in Academic Settings While the SBW archetype provides a framework for overcoming challenges, it also imposes disproportionate demands on Black women in professional spaces. In PWIs, this construct intersects with systemic racism and implicit bias, requiring Black women to constantly demonstrate excellence while suppressing vulnerabilities ( Apugo, 2019 Godbolt et al., 2022 Jefferies et al., 2018 Nelson et al., 2016 Underrepresentation in Nursing Literature Despite its pervasive influence, the SBW archetype remains understudied in nursing research. Much of the existing research comes from broader cultural and psychological studies, which highlight the schema's dual role as empowering and harmful. Insights from disciplines such as sociology and psychology offer valuable perspectives for understanding how this construct shapes the experiences of Black women in nursing academia and leadership ( Geyton et al., 2022 Godbolt et al., 2022 The literature underscores the complex interplay between cultural pride, systemic oppression, and personal resilience embodied in the SBW schema. While it equips Black women with tools to navigate adversity, it also perpetuates significant psychological and health burdens. Addressing these dualities is crucial for creating supportive academic and professional environments that recognize Black women's diverse experiences and needs. Contemporary Evolution of the SBW Stereotype In contemporary culture, the SBW schema has been reinterpreted and reinforced through media, workplaces, and healthcare systems to portray Black women as inherently invulnerable—an image that has justified their exploitation, erased their need for care, and denied them access to vulnerability routinely afforded to others ( Godbolt et al., 2022 Beauboeuf-Lafontant, 2007 Godbolt et al., 2022 Woods-Giscombé, 2010 Popular television characters such as Olivia Pope in Scandal Empire Cox & Ward, 2019 Leath et al., 2021 Leath et al., 2021 Grey's Anatomy Rae, 2020 Beyond media, the SBW schema remains pervasive in healthcare and workplace settings. Black women are frequently perceived as unbreakable and self-sacrificing, which often leads to their emotional and physical needs being dismissed or underestimated by healthcare providers ( Abrams et al., 2014 Volpe et al., 2024 Intergenerational transmission of the SBW schema through familial and community socialization further amplifies these pressures. Younger generations, influenced by family expectations and cultural movements such as #BlackGirlMagic, continue to grapple with balancing resilience and vulnerability ( Anyiwo et al., 2018 Stanton et al., 2017 These contemporary manifestations underscore the urgent need to interrogate and redefine what constitutes strength—shifting away from ideals of stoicism toward models that embrace balance, emotional authenticity, and holistic well-being. The Hidden Costs of the Strong Black Woman Archetype in Nursing Academia The SBW schema, though often celebrated as a symbol of cultural pride and resilience, imposes significant professional burdens on Black women in academic nursing. It perpetuates expectations of emotional fortitude, hypervigilance, and self-sacrifice—qualities that, while once critical for survival, now contribute to emotional exhaustion and isolation within predominantly White institutions (PWIs) ( Iheduru-Anderson et al., 2025 Jefferies, 2022 In these academic spaces, Black women are often compelled to suppress their needs and vulnerabilities in order to meet heightened demands for excellence. This pressure manifests as self-silencing during departmental meetings, relentless perfectionism in teaching and scholarship, and an outsized mentoring load—all frequently unrecognized and uncompensated by institutions ( Apugo, 2019 Iheduru-Anderson, 2024b Although strength and resilience are deeply valued traits, within academic nursing they are often weaponized into unrealistic expectations of hyper-responsibility ( Iheduru-Anderson et al., 2024a Iheduru-Anderson et al., 2024a Iheduru-Anderson, 2020 Iheduru-Anderson et al., 2022 Iheduru-Anderson & Shingles, 2023 Recognizing and addressing these hidden costs is essential to cultivating emotionally safe and equitable environments where Black women faculty can lead and thrive without sacrificing their well-being. Recent scholarship calls for a redefinition of strength in nursing that embraces vulnerability and self-care as essential leadership qualities, advocating for systemic changes in nursing education and practice to support the well-being and advancement of Black women ( De Sousa & Varcoe, 2021 Iheduru-Anderson et al., 2025 Jefferies, 2022 Future Directions As nursing education and leadership grapple with the structural and cultural burdens imposed by the SBW schema, envisioning a more equitable future requires deliberate shifts in how resilience, strength, and leadership are defined and nurtured. The following sections outline pathways for transforming academic nursing environments—challenging harmful paradigms, redefining resilience to include vulnerability and community care, and empowering future generations to lead with authenticity and well-being. Together, these strategies call for systemic change that centers the full humanity of Black women in nursing academia. Challenging the Paradigm: Strength and Vulnerability While the SBW schema has offered cultural protection and pride, its long-term impacts on well-being and leadership capacity reveal the limits of strength as currently defined. To foster environments where Black women can thrive, not merely survive, it is necessary to challenge the notion that strength must be synonymous with self-denial, emotional suppression, and silent endurance. This section introduces vulnerability Redefining Resilience: Toward Inclusive Academic Environments Resilience need not be synonymous with self-sacrifice. Nelson et al. (2024) Woods-Giscombé (2010) This redefinition also involves a shift in leadership frameworks. Nelson et al. (2016) Watson and Hunter (2015) By creating environments where resilience and vulnerability coexist, nursing academia can support Black women not only to succeed but also to thrive. Embracing a holistic understanding of strength—one that includes rest, emotional expression, and community support—offers a sustainable path forward grounded in justice, care, and well-being. Leadership models that value vulnerability over performance can foster more authentic and inclusive spaces, where diverse experiences and emotional honesty are recognized as strengths, not liabilities. Such a paradigm shift is critical to building cultures that honor the full humanity of Black women and empower them to lead without erasure. Empowering Future Generations Disrupting the intergenerational transmission of the SBW schema is critical to fostering holistic well-being. While the archetype symbolizes resilience, it imposes significant emotional burdens. Traits like emotional suppression and relentless caregiving perpetuate mental health challenges such as stress and depression in young Black women ( Etowa et al., 2017 Wallace et al., 2023 Emerging research shows that younger generations are rejecting traditional notions of unyielding strength by prioritizing self-care and seeking help. Practices like therapy, mindfulness, and boundary setting reflect a cultural shift toward balancing resilience with wellness ( Jones et al., 2021 Mentorship plays a pivotal role in this shift. Jones et al. (2021) Nelson et al., 2016 Corbin et al., 2018 Denyse et al., 2023 Implications for Nursing Education and Leadership Systemic racism and underrepresentation in nursing academia create significant barriers for Black women faculty and leaders. Bias-laden encounters, institutional neglect, and limited structural support contribute to professional isolation, burnout, and career stagnation ( Iheduru-Anderson, 2021 White, 2021 Jefferies (2022) Parks and Hayman (2024) Institutional and Professional Challenges in Nursing Academia In PWIs, systemic racism and gender bias intersect with the SBW schema, producing structural and interpersonal challenges. Black women are expected to overperform while their contributions are often marginalized or tokenized. These dynamics reinforce feelings of invisibility and exclusion, compounding emotional strain ( K. Iheduru-Anderson et al., 2024a Apugo, 2019 Nelson et al., 2024 These challenges are intensified by dual biases related to both race and gender. Black women often engage in code-switching, emotional suppression, and excessive self-monitoring to manage perceptions and guard against discrimination ( Apugo, 2019 Burton et al., 2020 Emotional labor remains an unacknowledged yet central part of many Black women's academic experience. The expectation of invulnerability discourages help-seeking and emotional openness ( Beauboeuf-Lafontant, 2007 Costa & Smith, 2023 Iheduru-Anderson et al., 2024b Redefining Strength: Toward Inclusive Academic Environments Redefining the SBW archetype in nursing education and leadership requires both cultural and institutional shifts. Strength must be reimagined to include vulnerability, relational support, and self-compassion—not as signs of weakness, but as essential elements of resilience and leadership ( Costa & Smith, 2023 S. M. Davis, 2018 Shardé M. Davis, 2015 Institutions must go beyond representation to address systemic exclusion. While the recruitment and retention of Black faculty are essential steps, they alone will not dismantle the SBW schema or its effects. Institutions must undergo cultural transformation. Recruitment must be paired with critical engagement and education. Nurse faculty and leaders must engage deeply with foundational scholarship—particularly Black feminist and womanist literature—that exposes the historical, cultural, and structural roots of the SBW schema. This includes work by scholars such as Patricia Hill Collins, bell hooks, and recent contributors to health disparities literature who connect systemic racism to clinical outcomes and professional dynamics in nursing. This knowledge helps nursing departments critically examine how their own cultures may be complicit in upholding and reinforcing these harmful narratives, even unintentionally. Culturally responsive policies must go beyond surface-level inclusion efforts. Since most nursing leadership remains white, leaders must interrogate their own preparation for inclusive leadership. This includes evaluating what structures are in place for this learning? Is there institutional support for sustained, self-directed education on race and gender equity that does not rely on the unpaid labor of minoritized faculty, students, or staff? Engagement with colleagues of minoritized background should be reciprocal, compensated, and not extractive; otherwise, it risks reinforcing the “minority tax” and displacing the burden of transformation onto those already marginalized ( Costa & Smith, 2023 For example, rather than asking Black nurses to “teach” cultural competence, a department might invest in a curriculum grounded in Black feminist and critical race scholarship, paired with racial literacy coaching for leadership. This model places the responsibility for institutional change where it belongs: with those in power. Another example, a nursing department could initiate a review of its policies—such as tenure and promotion guidelines—through a racial equity lens, followed by facilitated workshops that incorporate external equity consultants. This model encourages meaningful policy reform while reducing the cultural tax often placed on underrepresented faculty. In addition to structural changes, institutions must actively confront and disrupt harmful SBW stereotypes while preserving the cultural pride and community strength embedded in the schema. Narrative shifts are needed to reframe Black womanhood in ways that acknowledge emotional authenticity, complexity, and the full humanity of Black women in academic spaces. These are not issues with easy solutions, but rather tensions to navigate with intentionality. By holding these complexities at the center of institutional reflection and reform, nursing education and leadership can move toward more just and sustaining models of inclusion—grounded in justice, care, and collective well-being. Strategies for Institutional and Cultural Change Breaking free from the SBW schema's systemic constraints requires multilevel interventions: Mentorship and Representation: Establish identity-affirming mentorship networks connecting Black women faculty and students with culturally informed guidance. Nelson et al. (2020) Peer Support Networks: Create and sustain affinity groups and online communities that offer solidarity, shared strategies, and space for emotional expression ( Stanton et al., 2017 Psychological Safe Spaces: Foster peer spaces where Black women can speak freely about challenges and resilience without fear of judgment. Corbin et al. (2018) Denyse et al. (2023) Diversity in Leadership: Increase the number of Black women in leadership roles to ensure institutional decisions reflect diverse needs and perspectives. Leadership Development Initiatives: Support professional development that explicitly addresses systemic barriers and promotes inclusive leadership models. Cultural Knowledge and Humility Training: Integrate cultural humility and self-compassion into nursing curricula and faculty development to reduce bias and support mental wellness ( Volpe et al., 2024 Policy Reforms for Equity: Enact transparent, equity-focused policies around hiring, promotion, workload, and recognition. Such reforms can mitigate overwork and undervaluation ( Corbin et al., 2018 Platt & Fanning, 2023 Reframing Strength and Vulnerability: Center emotional authenticity, care, and community as valid expressions of leadership and resilience. Programs promoting boundary-setting and collective support can help reframe strength as shared, not solitary. Cultural Relevance and the Redefinition of Strength and Vulnerability Within the SBW Schema This section explores how cultural relevance, grounded in Black feminist thought, reshapes our understanding of both strength and vulnerability for Black women navigating the SBW schema. It offers a liberatory redefinition that resists dehumanizing ideals and centers rest, emotional truth, and community care. Vulnerability, as commonly understood in mainstream wellness discourse, is often framed as an individual path toward growth and healing. However, for Black women, such framings risk oversimplifying the profound structural barriers that shape their lived experiences ( Adebayo et al., 2021 Iheduru-Anderson et al., 2025 Harris-Perry, 2011 Woods-Giscombe, 2010 Hooks, 1991 Lorde, 1984 Dominant narratives often universalize vulnerability, presenting it as a neutral, individualized virtue. Yet this framing can obscure how racialized, gendered, and classed systems mediate access to emotional safety and support. For Black women, expressing vulnerability frequently carries risks — including dismissal, punishment, or pathologization ( Beauboeuf-Lafontant, 2009 Collins, 2000b Parks & Hayman, 2024 Phillips, 2006 In this context, vulnerability for Black women involves: Creating safe space for emotional truth — where expression is met with care, not retraumatization or judgment. Recognizing systemic harm — naming institutions and cultural narratives, rather than individuals, as the sources of emotional exhaustion and burnout. Resisting the SBW performance — choosing softness and self-preservation over self-sacrifice, without guilt. Reframing care as a collective act — where rest and emotional expression are not luxuries, but strategies for survival and community continuity. Toward a Just Redefinition of Strength and Vulnerability To redefine strength for Black women within the SBW schema requires a shift from individualistic interpretations of resilience to a justice-centered understanding of healing. Grounded in Black feminist thought, this redefinition positions vulnerability as a communal, intentional, and strategic act–not merely a personal journey, but a refusal to uphold oppressive ideals of stoicism and silence ( Crenshaw, 1991 Lorde, 1984 Figure 1 Figure 1. Redefining Strength and Vulnerability for Black Women Within the SBW Schema Grounded in Black Feminist Thought. Caption. This Figure Contrasts Traditional Narratives of the Strong Black Woman (SBW) Schema—Characterized by Unyielding Strength, Self-Sacrifice, and Emotional Stoicism—with a Redefinition Rooted in Black Feminist Theory. the Reimagined Paradigm Emphasizes Balance, Interdependence, and Emotional Expressiveness as Acts of Resistance and Collective Care. Drawing from Crenshaw (1991) Collins (2000a) hooks (2000) Nelson et al. (2016) Godbolt et al. (2022) As Godbolt et al. (2022) Nelson et al. (2016) While this paper calls for a redefinition of strength that embraces vulnerability, it is crucial to acknowledge that not everyone can access vulnerability safely. For Black women, expressing emotional needs often leads to further marginalization. Thus, the responsibility for fostering vulnerability cannot rest solely on those most at risk. Institutions and colleagues—particularly those not impacted by the SBW schema—must commit to creating emotionally safe environments where vulnerability is protected, not punished ( Iheduru-Anderson et al., 2025 To further operationalize this conceptual shift, Table 4 Table 4. SBW Schema for Black Women: A More Just Redefinition of Strength. Old Paradigm SBW-Informed Redefinition for Black Women \"Strong Black Woman,” “Super Woman” = never breaks Strength = Permission to break, rest, feel, heal Vulnerability = individual growth Vulnerability = collective reclamation and resistance Emotional expression = weakness Emotional truth = cultural survival and ancestral power Self-care = luxury Self-care = Commonweal: legacy work and community preservation Note Commonweal Phillips, 2006 Commonweal In sum, vulnerability is not about shedding armor in unsafe environments; it is about discerning when, where, and with whom it is safe to exhale. For Black women navigating the SBW schema, this intentional vulnerability is both a survival tactic and a strategy for liberation—one rooted in cultural relevance, communal care, and resistance. Within a womanist framework, this resonates with the concept of Commonweal Conclusion Toward a Just Redefinition of Strength and Care The SBW schema, deeply entrenched in systemic racism and sexism, symbolizes resilience—but often at the cost of mental health and self-preservation. For Black women in nursing education and leadership, the schema exerts pressure to overperform while suppressing vulnerability, leaving little room for rest, emotional honesty, or collective care. This paper, drawing on Abrams et al. (2019) Castelin and White (2022) Jones et al. (2021) Nelson et al. (2020) Redefining strength requires dismantling individualistic interpretations of resilience and reimagining vulnerability as a radical, culturally grounded act of resistance and liberation. Grounded in Black feminist thought, this reconceptualization affirms vulnerability not as a weakness, but as a strategic, communal pathway to healing, connection, and wellness ( Lorde, 1984 Crenshaw, 1991 hooks, 2000 Nelson et al. (2020) Woods-Giscombé (2010) It is essential to emphasize that the SBW schema is a culturally situated coping strategy, not a pathological behavior. While internalizing the schema can contribute to emotional strain, the root causes lie in systemic inequities, not in Black women themselves. As Strings (2015) Recent nursing-focused studies ( Jefferies, 2022 Parks & Hayman, 2024 ORCID iD: https://orcid.org/0000-0003-2353-0410 Author Contribution Statement: Funding: The authors declared no potential conflicts of interest with respect to the research, authorship, and/or publication of this article. Data Availability Statement: References Abrams J. A. Hill A. Maxwell M. 2019 Underneath the mask of the strong black woman schema: Disentangling influences of strength and self-silencing on depressive symptoms among U.S. Black women Sex Roles 80 9 517 526 10.1007/s11199-018-0956-y 31086431 PMC6510490 Abrams J. A. Maxwell M. Pope M. Belgrave F. Z. 2014 Carrying the world with the grace of a lady and the grit of a warrior: Deepening our understanding of the “strong black woman” schema Psychology of Women Quarterly 38 4 503 518 10.1177/0361684314541418 Adebayo C. Parcell E. Mkandawire-Valhmu L. Olukotun O. 2021 African American women’s maternal healthcare experiences: A critical race theory perspective Health Communication 37 9 1135 1146 10.1080/10410236.2021.1888453 33601991 Amankwaa L. C. 2003 Postpartum depression among African-American women Issues in Mental Health Nursing 24 3 297 316 10.1080/01612840305283 12623687 Anyiwo N. Ward L. M. Day Fletcher K. Rowley S. 2018 Black adolescents’ television usage and endorsement of mainstream gender roles and the strong black woman schema Journal of Black Psychology 44 4 371 397 10.1177/0095798418771818 Apugo D. 2019 A hidden culture of coping: Insights on African American women’s existence in predominately white institutions Multicultural Perspectives 21 1 53 62 10.1080/15210960.2019.1573067 Banda P. 2025 An Introduction to the framework of ‘obstetric racism’: Theory and intellectual lineage Katz Rothman B. Newnham E. van der Waal R. Sillo C. The routledge companion to gender and reproduction 1st ed 164 178 Routledge Beauboeuf-Lafontant T. 2007 You have to show strength: An exploration of gender, race, and depression Gender & Society 21 1 28 51 10.1177/0891243206294108 Beauboeuf-Lafontant T. 2009 Behind the Mask of the Strong Black Woman: Voice and the Embodiment of a Costly Performance Temple University Press https://muse.jhu.edu/book/9576 Benight C. C. Bandura A. 2004 Social cognitive theory of posttraumatic recovery: The role of perceived self-efficacy Behavior Research and Therapy 42 10 1129 1148 10.1016/j.brat.2003.08.008 15350854 Burton L. J. Cyr D. Weiner J. M. 2020 “Unbroken, but bent”: Gendered racism in school leadership Frontiers in Education 5 Article 52 10.3389/feduc.2020.00052 Castelin S. White G. 2022 I’m a strong independent black woman”: The strong black woman schema and mental health in college-aged black women Psychology of Women Quarterly 46 2 196 208 10.1177/03616843211067501 Collins P. H. 2000a Gender, black feminism, and black political economy The ANNALS of the American Academy of Political and Social Science 568 1 41 53 10.1177/000271620056800105 Collins P. H. 2000b Black feminist thought: Knowledge, consciousness, and the politics of empowerment 2nd ed. Routledge 10.1177/000271620056800105 Corbin N. A. Smith W. A. Garcia J. R. 2018 Trapped between justified anger and being the strong black woman: Black college women coping with racial battle fatigue at historically and predominantly white institutions International Journal of Qualitative Studies in Education 31 7 626 643 10.1080/09518398.2018.1468045 Costa C. B. Smith J. E. 2023 Career satisfaction and advancement related to mentorship experiences of underrepresented nursing faculty Nursing Education Perspectives 44 5 291 10.1097/01.NEP.0000000000001173 37594421 Cox V. Ward L. M. 2019 A wholistic view of black women on scripted TV: A content analysis Journal of Black Psychology 45 6–7 540 570 10.1177/0095798419887072 Crenshaw K. 1991 Mapping the margins: Intersectionality, identity politics, and violence against women of color Stanford Law Review 43 6 1241 1300 10.2307/1229039 Davis S. M. 2015 The “strong black woman collective”: A developing theoretical framework for understanding collective communication practices of black women Women’s Studies in Communication 38 1 20 35 10.1080/07491409.2014.953714 Davis S. M. 2018 Taking back the power: An analysis of black women’s communicative resistance Review of Communication 18 4 301 318 10.1080/15358593.2018.1461234 Denyse T. Martin K. J. Kim J. H. J. Pageot Y. K. Owoyemi P. DeLuz K. D. Stanton A. L. 2023 No complaining, no crying”: A qualitative study of the strong black woman schema in the breast cancer context Annals of Behavioral Medicine: A Publication of the Society of Behavioral Medicine 57 9 733 742 10.1093/abm/kaad029 37318273 PMC10441856 De Sousa I. Varcoe C. 2021 Centering black feminist thought in nursing praxis Nursing Inquiry 29 1 e12473 10.1111/nin.12473 PMC9286449 34820943 Etowa J. B. Beagan B. L. Eghan F. Bernard W. T. 2017 You feel you have to be made of steel”: The strong black woman, health, and well-being in Nova Scotia Health Care for Women International 38 4 379 393 10.1080/07399332.2017.1290099 28151098 Geyton T. Johnson N. Ross K. 2022 I’m good’: Examining the internalization of the strong black woman archetype Journal of Human Behavior in the Social Environment 32 1 1 16 10.1080/10911359.2020.1844838 Godbolt D. Opara I. Amutah-Onukagha N. 2022 Strong black women: Linking stereotypes, stress, and overeating among a sample of black female college students Journal of Black Studies 53 6 609 634 10.1177/00219347221087453 36710718 PMC9881457 Hall S. 2017 Black Girl Magic? The Influence of the Strong Black Woman Schema on the Mental Health of Black Women in the United States https://core.ac.uk/download/pdf/129453831.pdf Harris-Lacewell M. 2001 No place to rest: African American political attitudes and the myth of black women’s strength Women & Politics 23 3 1 33 10.1300/J014v23n03_01 Harris-Perry M. V. 2011 Sister Citizen: Shame, Stereotypes, and Black Women in America Yale University Press Henry C. J. Song M.-K. 2024 Use of the strong black woman construct in research: An integrative review Advances in Nursing Science 47 3 E110 10.1097/ANS.0000000000000501 37192599 Hooks B. 1991 Theory as liberatory practice Yale JL & Feminism 4 1 Hooks B. 2000 All About Love: New Visions William Morrow Iheduru-Anderson K. 2020 Barriers to career advancement in the nursing profession: Perceptions of black nurses in the United States Nursing Forum 55 4 664 677 10.1111/nuf.12483 32643168 PMC7689724 Iheduru-Anderson K. Akanegbu C. Ugorji J. U. Agomoh C. J. 2025 Beyond strength: The paradox of the strong black woman in nursing and leadership Nursing Inquiry 32 3 e70033 10.1111/nin.70033 40370297 Iheduru-Anderson K. Alexander K. E. Webber-Ritchey K. Atkins R. Ramdin V. A. Calvert W. J. Ugorji J. McCamey D. Okoro F. Johnson V. 2024a Voices of resilience: An autoethnographic exploration of the contributions of black nursing faculty in nursing education ABNFF Journal 1 1 17 39 Iheduru-Anderson K. Moore S. Okoro F. 2022 The voice of black academic nurse leaders in the United States: A qualitative study Journal of Professional Nursing: Official Journal of The American Association of Colleges of Nursing 39 84 95 10.1016/j.profnurs.2022.01.007 35272836 Iheduru-Anderson K. Waite R. Murray T. A. 2024b Invisibility/hypervisibility paradox for black women navigating the nursing academic environment Nursing Outlook 72 6 102291 10.1016/j.outlook.2024.102291 39383664 Iheduru-Anderson K. C. 2021 The white/black hierarchy institutionalizes white supremacy in nursing and nursing leadership in the United States Journal of Professional Nursing 37 2 411 421 10.1016/j.profnurs.2020.05.005 33867099 Iheduru-Anderson K. C. Shingles R. R. 2023 Mentoring experience for career advancement: The perspectives of black women academic nurse leaders Global Qualitative Nursing Research 10 1 16 10.1177/23333936231155051 PMC9941592 36824223 Jefferies K. 2022 The strong black woman: Insights and implications for nursing Journal of the American Psychiatric Nurses Association 28 4 332 338 10.1177/1078390320983900 33381984 Jefferies K. Goldberg L. Aston M. Tomblin Murphy G. 2018 Understanding the invisibility of black nurse leaders using a black feminist poststructuralist framework Journal of Clinical Nursing 27 15–16 3225 3234 10.1111/jocn.14505 29752837 Jones M. K. Harris K. J. Reynolds A. A. 2021 In their own words: The meaning of the strong black woman schema among black U.S. College women Sex Roles 84 5 347 359 10.1007/s11199-020-01170-w Leath S. Billingsley J. Jones M. Johnson K. Taliaferro J. Gaskin-Cole G. 2023 Raising resilient black women: A study of superwoman mothering and strength as a form of gendered racial socialization in black mother-daughter relationships Sex Roles 89 11 625 642 10.1007/s11199-023-01417-2 Leath S. Jerald M. C. Perkins T. Jones M. K. 2021 A qualitative exploration of jezebel stereotype endorsement and sexual behaviors among black college women Journal of Black Psychology 47 4-5 244 283 10.1177/0095798421997215 Lekan D. 2009 Sojourner syndrome and health disparities in African American women ANS. Advances in Nursing Science 32 4 307 321 19934837 10.1097/ANS.0b013e3181bd994c Liao K. Y.-H. Wei M. Yin M. 2020 The misunderstood schema of the strong black woman: Exploring its mental health consequences and coping responses among African American women Psychology of Women Quarterly 44 1 84 104 10.1177/0361684319883198 Lorde A. 1984 Sister Outsider: Essays and Speeches, Volume 10 Penguin https://rhinehartibenglish.weebly.com/uploads/2/2/1/0/22108252/sister_outsider_audrey_lorde_ib_pdf_packet.pdf Nelson T. Cardemil E. V. Adeoye C. T. 2016 Rethinking strength: Black women’s perceptions of the “strong black woman” role Psychology of Women Quarterly 40 4 551 563 10.1177/0361684316646716 Nelson T. Cardemil E. V. Overstreet N. M. Hunter C. D. Woods-Giscombé C. L. 2024 Association between superwoman schema, depression, and resilience: The mediating role of social isolation and gendered racial centrality Cultural Diversity & Ethnic Minority Psychology 30 1 95 106 10.1037/cdp0000533 35191721 Nelson T. Shahid N. N. Cardemil E. V. 2020 Do I really need to go and see somebody? Black women’s perceptions of help-seeking for depression Journal of Black Psychology 46 4 263 286 10.1177/0095798420931644 Parks A. K. Hayman L. L. 2024 Unveiling the strong black woman schema—evolution and impact: A systematic review Clinical Nursing Research 33 5 395 404 10.1177/10547738241234425 38439544 Phillips L 2006 The Womanist Reader: The First Quarter Century of Womanist Thought Routledge 10.4324/9780203943670 Platt L. F. Fanning S. C. 2023 The strong black woman concept: Associated demographic characteristics and perceived stress among black women Journal of Black Psychology 49 1 58 84 10.1177/00957984221096211 Rae H. N. 2020 Normalizing TV: A content analysis examining the quality of representation of Grey’s Anatomy character Dr . Miranda Bailey https://cmich.idm.oclc.org/login?url=https://www.proquest.com/dissertations-theses/normalizing-tv-content-analysis-examining-quality/docview/2414272624/se-2 Reynolds T. 2005 Caribbean mothering: Identity and childrearing in the UK Tufnell Press Reynolds T. 2020 Studies of the maternal: Black mothering 10 years on Studies in the Maternal 13 1 8 10.16995/sim.290 Romero R. R. 2000 The icon of the strong black woman Psychotherapy with African American women: Innovations in psychodynamic perspectives and practice 225 250 Guilford Press Showunmi V. 2023 Visible, invisible: Black women in higher education Frontiers in Sociology 8 974617 10.3389/fsoc.2023.974617 37152206 PMC10159179 Stanton A. G. Jerald M. C. Ward L. M. Avery L. R. 2017 Social media contributions to strong black woman ideal endorsement and black women’s mental health Psychology of Women Quarterly 41 4 465 478 10.1177/0361684317732330 Strings S. 2015 Obese black women as “social dead weight”: Reinventing the “diseased black woman” Signs: Journal of Women in Culture and Society 41 1 107 130 10.1086/681773 Thomas Z. Banks J. Eaton A. Ward L. 2022 25 Years of psychology research on the “strong black woman” Social and Personality Psychology Compass 16 9 e12705 10.1111/spc3.12705 Volpe V. V. Ross J. M. Collins A. Spivey B. N. Watson-Singleton N. N. Goode R. W. Hoggard L. S. Woods Giscombé C. L. 2024 Gendered racial microaggressions and emotional eating for black young adult women: The mediating roles of superwoman schema and self-compassion Psychology of Women Quarterly 48 1 93 107 10.1177/03616843231182913 Wallace D. D. Limberg D. Linich K. 2023 White girls are taught to be wives; black girls are taught to survive”: Wellness among strong black women Journal of Mental Health Counseling 45 4 297 318 10.17744/mehc.45.4.02 Wallace D. D. Limberg D. Linich K. 2023 “White girls are taught to be wives; Black girls are taught to survive”: Wellness among strong Black women Journal of Mental Health Counseling 45 4 297 318 10.17744/mehc.45.4.02 Watson N. N. Hunter C. D. 2015 Anxiety and depression among African American women: The costs of strength and negative attitudes toward psychological help-seeking Cultural Diversity & Ethnic Minority Psychology 21 4 604 612 10.1037/cdp0000015 25602466 Watson N. N. Hunter C. D. 2016 I had to be strong”: Tensions in the strong black woman schema Journal of Black Psychology 42 5 424 452 10.1177/0095798415597093 Watson-Singleton N. Spivey B. Harrison E. Nelson T. Lewis J. 2024 Double-Edged sword or outright harmful?: Associations between strong black woman schema and resilience, self-efficacy, and flourishing Sex Roles 90 9 1123 1135 10.1007/s11199-024-01503-z West L. M. Donovan R. A. Daniel A. R. 2016 The price of strength: Black college women’s perspectives on the strong black woman stereotype Women & Therapy 39 3–4 390 412 10.1080/02703149.2016.1116871 White C. N. 2021 When being strong hurts: Trauma and the Strong Black Woman stereotype Ph.D. University of South Carolina https://www.proquest.com/docview/2604031612/abstract/5E2D661B0B3048A8PQ/1 Woods-Giscombé C. L. 2010 Superwoman schema: African American women's stress, strength, and health views Qualitative Health Research 20 5 668 683 10.1177/1049732310361892 20154298 PMC3072704 Woods-Giscombe C. L. Allen A. M. Black A. R. Steed T. C. Li Y. Lackey C. 2019 The giscombe superwoman schema questionnaire: Psychometric properties and associations with mental health and health behaviors in African American women Issues in Mental Health Nursing 40 8 672 681 10.1080/01612840.2019.1584654 31081707 PMC7220093 Woods-Giscombe C. L. Allen A. M. Black A. R. Steed T. C. Li Y. Lackey C. 2019 The Giscombe Superwoman Schema Questionnaire: Psychometric properties and associations with mental health and health behaviors in African American women Issues in Mental Health Nursing 40 8 672 681 10.1080/01612840.2019.1584654 31081707 PMC7220093 Zakama A. K. Mengesha M. Momplaisir F. Lewey J. Debbink M. P. 2025 Black Women’s mental health needs and recommendations after spontaneous preterm birth: A qualitative study BJOG: An International Journal of Obstetrics & Gynaecology 2025 1 1 13 10.1111/1471-0528.18134 PMC12429447 40129227 ",
  "metadata": {
    "Title of this paper": "Black Women’s mental health needs and recommendations after spontaneous preterm birth: A qualitative study",
    "Journal it was published in:": "SAGE Open Nursing",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489196/"
  }
}