{
  "title": "Paper_693",
  "abstract": "Harv Rev Psychiatry Harv Rev Psychiatry 2665 vapa Harvard review of psychiatry 1067-3229 1465-7309 pmc-is-collection-domain yes pmc-collection-title VA Author Manuscripts PMC12478557 PMC12478557.1 12478557 12478557 NIHMS1796321 34352846 10.1097/HRP.0000000000000304 NIHMS1796321 VAPA1796321 1 Article How Shared Is Shared Decision Making? Reaching the Full Potential of Patient-Clinician Collaboration in Mental Health Treichler Emily B. H. PhD Rabin Borsika A. PhD, PharmD, MPH Cohen Amy N. PhD Light Gregory A. PhD Departments of Psychiatry (Drs. Treichler and Light) and Family Medicine and Public Health (Dr. Rabin), and Dissemination and Implementation Science Center, Altman Translational Research Institute (Dr. Rabin), University of California San Diego; VA Desert Pacific Mental Illness Research, Education, and Clinical Center (MIRECC), San Diego, CA (Drs. Treichler and Light); Center of Excellence in Stress and Mental Health, San Diego VA, La Jolla, CA (Dr. Rabin); American Psychiatric Association, Los Angeles, CA (Dr. Cohen) Correspondence: emily.treichler@gmail.com Declaration of interest: Sep-Oct 2021 29 5 497780 361 369 17 04 2022 29 09 2025 30 09 2025 30 09 2025 Shared decision making in mental health is a priority for stakeholders, but faces significant implementation barriers, particularly in settings intended to serve people with serious mental illnesses (SMI). As a result, current levels of shared decision making are low. We highlight these barriers and propose that a novel paradigm, collaborative decision making, will offer conceptual and practical solutions at the systemic and patient/clinician level. Collaborative decision making is tailored for populations like people with SMI and other groups who experience chronic and complex symptoms, along with power imbalances within health systems. Advancing from shared decision making to collaborative decision making clarifies the mission of the model: to facilitate an empowering and recovery-oriented decision-making process that assigns equal power and responsibility to patients and clinicians; to improve alignment of treatment decisions with patient values and priorities; to increase patient trust and confidence in clinicians and the treatment process; and, in the end, to improve treatment engagement, satisfaction, and outcomes. The primary purpose of collaborative decision making is to increase values-aligned care, therefore prioritizing inclusion of patient values, including cultural values and quality of life–related outcomes. Given the broad and constantly changing context of treatment and care for many people with SMI (and also other groups), this model is dynamic and continuously evolving, ready for use across diverse contexts. Implementation of collaborative decision making includes increasing patient knowledge but also patient power, comfort, and confidence. It is one tool to reshape patient-clinician and patient-system relationships and to increase access to value-aligned care for people with SMI and other groups. collaborative decision making patient-centered care patient-provider communication serious mental illness shared decision making pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "How Shared Is Shared Decision Making? Reaching the Full Potential of Patient-Clinician Collaboration in Mental Health",
    "Journal it was published in:": "Harvard review of psychiatry",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478557/"
  }
}