{
  "title": "Paper_286",
  "abstract": "pmc Oncol Lett Oncol Lett 1736 onclett OL Oncology Letters 1792-1074 1792-1082 Spandidos Publications PMC12486745 PMC12486745.1 12486745 12486745 41040914 10.3892/ol.2025.15276 OL-30-5-15276 1 Articles Anticancer effects of thymoquinone on prostate cancer cells and natural killer cell activity Aldarmahi Nouf A. 1 Tarbiah Nesrin I. 1 Alkhattabi Nuha A. 1 Alshaibi Huda F. 1 2 1 2 Correspondence to ntarabah@kau.edu.sa 11 2025 18 9 2025 30 5 495953 530 22 1 2025 25 7 2025 18 09 2025 02 10 2025 03 10 2025 Copyright: © 2025 Aldarmahi et al. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution-NonCommercial-NoDerivs License Dark cumin, or Nigella sativa Nigella sativa Nigella sativa natural killer cells cancer cells prostate cancer thymoquinone Funding: pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Globally, the burden of cancer incidence and death is increasing rapidly ( 1 2 3 4 3 5 2 PC that is detected early may not show any symptoms, often advances slowly and may be treated with little-to-no intervention. The most frequent symptoms, however, are nocturia, increased frequency of urine and difficulty urinating, which are indicative of prostatic enlargement. In more advanced stages of the disease, patients may experience back discomfort and urine retention due to metastasis to the axis skeleton, the most common site of bone metastatic disease ( 6 The risk of PC is notably influenced by diet and exercise. For example, dietary factors are associated with the observed variations in PC incidence rates between countries and ethnic groups ( 7 8 6 7 6 Due to several biological and tumor microenvironmental factors, PC presents substantial treatment challenges. For example, prostate tumors often have a low tumor mutational burden, meaning that the immune system targets fewer neoantigens ( 9 10 11 Using immune checkpoint inhibitors, cancer vaccines, chimeric antigen receptor T-cell treatment and combination medicines, immunotherapy offers potential treatments by using the immune system to target and kill cancer cells. By reducing antitumor immune responses or modifying tumor immunogenicity, several immune system components cooperate to either protect the host against necessary tumor progression, enhance tumor escape, or both ( 12 12 13 14 13 15 16 A subset of lymphocytes, known as natural killer (NK) cells, is essential to the innate immune response against malignancies and infections ( 17 18 19 20 21 22 23 NK cells help to defend the body against foreign (pathogens) and endogenous (cancer) threats. Extensive research has been performed with the goal of identifying an efficient method for targeting impacted cells by utilizing NK cell pathways ( 24 Fig. 1 25 26 Research is investigating the use of NK cells to treat ( 27 29 in vitro in vivo 27 Additionally, PC cells usually develop defenses against immune detection, such as by producing soluble NK cell receptor D (NKG2D) ligands to obstruct the recognition of NK cells. However, NK cells can adapt to these challenges, and strategies are being developed to make them more effective against these tumor escape tactics ( 28 29 32 29 33 30 28 31 32 34 Finally, due to their ability to treat numerous diseases, several plants are regarded as useful therapeutic instruments in a wide range of medical disorders. Moreover, different medicinal plants have been used worldwide to alleviate the symptoms of several illnesses for millennia ( 35 Nigella sativa Ranunculaceae 36 37 38 Nigella sativa 38 Materials and methods Blood collection Blood samples were collected at King Abdulaziz University Hospital (Jeddah, Saudi Arabia) between August and November 2021 from 10 healthy volunteers six male, four female and aged 25–45 years in EDTA tubes (BD Vacutainer) and used for NK cell isolation. All experiments were performed at King Faisal Specialist Hospital and Research Centre (Jeddah, Saudi Arabia). Inclusion criteria for enrolled participants include general good health with no chronic diseases, recent infections and immunosuppressive medication or vaccination. Exclusion criteria were smoking, pregnancy or breastfeeding, autoimmune disease and malignancy. MACS positive isolation NK cells were purified by positive selection of CD56 cells (CD56 MicroBeads, human, 130-050-401, Miltenyi biotec) and MACS column (130-042-201, Miltenyi biotec, USA) was used according to the manufacturer's instruction. Cell lines and culture Transfected PC3 cells with red fluorescence (PC3-RFP cells) with the pDSRed-monomer-Hyg-C1 plasmid to produce hygromycin-resistant cells that express RFP were provided by AlShaibi et al 39 PC3-RFP cells were cultured in high-glucose DMEM (cat. no. 11965118; Thermo Fisher Scientific, Inc.), with sodium pyruvate L-glutamine and Phenol Red, and supplemented with 10% penicillin-streptomycin (10,000 U/ml; cat. no. 15140122; Thermo Fisher Scientific, Inc.). NK cells were cultured in NK MACS Medium (cat. no. 130-092-657; Miltneyi Biotec B.V. & Co. KG), supplemented with 20% FBS (cat. no. 12103C; Sigma-Aldrich; Merck KGaA) and 0.1 mM β-mercaptoethanol (Sigma-Aldrich; Merck KGaA), IL-2 (human animal-component free, recombinant, expressed in E. coli, ≥98%; cat. no. SRP3085; Sigma-Aldrich; Merck KGaA). The cells were routinely maintained in humidified incubator at 37°C and 5% CO 2 TQ preparation TQ (cat. no. 274666-1G; Sigma-Aldrich; Merck KGaA) was prepared by dissolving 4.926 mg TQ crystal in 10 µl anhydrous dimethyl sulfoxide (≥99.9%; cat. no. 276855; Sigma-Aldrich; Merck KGaA) and 9,990 µl NK medium to yield a stock solution. The final DMSO concentration in all TQ working solutions (50 and 25 µM) was 0.1%. Vehicle controls containing 0.1% DMSO in NK medium without TQ were included in all experiments. Cell cytotoxicity of TQ on tumor (PC3-RFP) and NK cells Cell cytotoxicity was analyzed using the CytoTox ® 3 Flow cytometry Following positive selection of NK cells were stained with CD56-PE (DAKO; Agilent Technologies, Inc.) at 25°C for 30 min in the dark. The cells were then analyzed using flow cytometry (Novocyte Flow Cytometer; Agilent Technologies, Inc.). Phycoerythrin (PE) detection channel was the analyte detector, CD56-PE was the analyte reporter, and NovoExpress software (version 1.6.3; Agilent Technologies, Inc.)used for data acquisition and analysis. ELISA PC-3-RFP and NK cells (1:2; 15–30×10 3 Statistical analysis The data were analyzed using GraphPad Prism 9 (IBM Corp.) and the results are presented as the mean ± standard deviation of three independent experiments. Statistical significance was assessed using one-way analysis of variance and Tukey's multiple comparison test. Spearman correlation coefficient was used for correlation tests. P<0.05 was considered to indicate a statistically significant difference. Results Flow cytometry analysis Using flow cytometry, the positivity of CD56 was determined to assess the purity of the isolated NK cells by comparison with the defined cutoff values obtained with unstained control cells. The NK cell purity was 95.7% ( Fig. 2 Cytotoxic effect of TQ on NK cells with PC3-RFP The cytotoxicity of NK cells was evaluated in co-culture with PC3-RFP cells. The effector (NK cells) and target (PC3-RFP) ratio was 1:2 and different concentrations of TQ (25 and 50 µM) were added in the culture. In the presence of TQ, there was a significant increase in NK cell cytotoxicity: Both concentrations of TQ (25 and 50 µM) significantly upregulated NK cell cytotoxicity in PC3-RFP cells, with cytotoxicity at 85.35% compared with 55.1% in the control group of NK cells co-cultured with tumor cells. Cell cytotoxicity was also significantly increased in tumor cells treated with both 25 and 50 µM TQ in the presence of NK cells, compared with tumor cells treated with the same TQ concentrations in the absence of NK cells ( Fig. 3 Effect of TQ on the activity of NK cells Co-culture of NK cells with PC3-RFP cells significantly increased the production of perforin, granzyme B and IFN-α from NK cells compared with NK cells alone using both concentrations of TQ (25 and 50 µM). NK cells co-cultured with PC3-RFP cells and treated with 50 µM TQ had significantly increased production of perforin and granzyme B production compared with the control NK cells co-cultured with tumor cells. The higher 50 µM TQ dose increased the production of perforin and granzyme B (0.80 and 1.24 ng/ml, respectively) by the NK cells more than the lower 25 µM dose (0.50 and 0.76 ng/ml, respectively). Furthermore, IFN-α production by the NK cells was significantly increased in the presence of 25 and 50 µM TQ (0.5 and 0.7 ng/ml, respectively) compared with the control NK cells co-cultured with tumor cells (0.3 ng/ml), with a greater increase observed in the presence of 50 µM TQ ( Fig. 4 The correlation between individual cytokines and NK cytotoxicity was analyzed using the Spearman correlation coefficient. Although there was no significant correlation between the cytokine concentrations and NK cytotoxicity; NK cells released higher levels of IFN-α in response to PC3-RFP cells compared to the other cytokines ( Fig. 5 Discussion Several studies have reported the immunomodulatory effect of TQ on immune cells including NK cells ( 40 43 Majdalawieh et al 44 Nigella sativa N. sativa 44 et al 45 45 46 47 Nigella sativa in vitro in vivo N. sativa 40 42 It has been reported that TQ combined with ionizing radiation, such as γ-radiation, has a synergistic lethal effect on breast cancer cells in vitro 42 43 48 50 51 52 53 54 55 56 et al 57 58 59 in vitro in vivo 48 59 59 60 Research by Shimasaki et al 61 61 62 53 4 47 63 60 61 64 65 64 65 Furthermore, according to the findings of the present study, TQ affects NK cells, which then directly stimulates the immune system. The TQ-induced immunoreactivity of NK cells against PC3-RFP cells increased when 50 µM TQ was applied, compared with 25 µM. This indicated that the stimulation of NK cells by TQ was associated with its cytotoxic effect on PC3-RFP cells. However, although certain signaling molecules implicated in producing the TQ immunostimulatory action in NK cells have been identified, the specific signaling pathways and molecular targets in these cells are still unknown. It has been suggested that TQ increases NK cell-mediated cytotoxicity by upregulating pro-apoptotic markers such as BAX and BID and downregulating anti-apoptotic proteins such as BCL-2 and myeloid cell leukemia 1 ( 66 67 68 in vitro in vivo Despite, the promising results of the capacity of TQ to increase NK cell cytotoxicity against PC3-RFP PC cells in vitro in vitro In conclusion, the present study demonstrated that TQ, a bioactive substance obtained from Nigella sativa in vivo Acknowledgements The authors would like to thank Ms Samar A. Zailaie (King Faisal Specialist Hospital and Research Centre, Jeddah) for technical assistance and scientific advice. Availability of data and materials The data generated in the present study may be requested from the corresponding author. Authors' contributions NIT and NuAA contributed to the study design. NoAA performed the study. NAK and HFA performed the data analysis. NIT, NuAA and HFA performed the data interpretation. HFA and NoAA drafted the manuscript. NIT, NoAA, HFA and NuAA revised the manuscript. All authors critically reviewed the manuscript. NIT and NuAA confirm the authenticity of all the raw data. All authors have read and approved the final manuscript. Ethics approval and consent to participate The present study was approved by the Biomedical Ethics Research Committee of King Abdulaziz University Faculty of Medicine (approval no. No640-20). Written informed consent was obtained from all subjects involved in the study. Patient consent for publication Not applicable. Competing interests The authors declare that they have no competing interests. References 1 Omran AR The epidemiological transition: A theory of the epidemiology of population change Millbank Mem Fund Q 49 509 538 1971 10.2307/3349375 5155251 2 Ferlay J Ervik M Lam F Laversanne M Colombet M Mery L Piñeros M Znaor A Soerjomataram I Bray F Global Cancer Observatory World International Agency for Research on Cancer Lyon, France https://gco.iarc.who.int/media/globocan/factsheets/populations/900-world-fact-sheet.pdf December 26 2024 3 Bray F Ferlay J Soerjomataram I Siegel RL Torre LA Jemal A Global cancer statistics 2018: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 68 394 424 2018 30207593 10.3322/caac.21492 4 Sung H Ferlay J Siegel RL Laversanne M Soerjomataram I Jemal A Bray F Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 71 209 249 2021 33538338 10.3322/caac.21660 5 Panigrahi GK Praharaj PP Kittaka H Mridha AR Black OM Singh R Mercer R van Bokhoven A Torkko KC Agarwal C Exosome proteomic analyses identify inflammatory phenotype and novel biomarkers in African American prostate cancer patients Cancer Med 8 1110 1123 2019 10.1002/cam4.1885 30623593 PMC6434210 6 Rawla P Epidemiology of prostate cancer World J Oncol 10 63 89 2019 10.14740/wjon1191 31068988 PMC6497009 7 Chan JM Gann PH Giovannucci EL Role of diet in prostate cancer development and progression J Clin Oncol 23 8152 8160 2005 10.1200/JCO.2005.03.1492 16278466 8 Platz EA Leitzmann MF Michaud DS Willett WC Giovannucci E Interrelation of energy intake, body size, and physical activity with prostate cancer in a large prospective cohort study Cancer Res 63 8542 8548 2003 14679023 9 Hegde PS Chen DS Top 10 challenges in cancer immunotherapy Immunity 52 17 35 2020 10.1016/j.immuni.2019.12.011 31940268 10 Lopez-Bujanda Z Drake CG Myeloid-derived cells in prostate cancer progression: Phenotype and prospective therapies J Leukoc Biol 102 393 406 2017 10.1189/jlb.5VMR1116-491RR 28550116 PMC6608078 11 Beltran H Rickman DS Park K Chae SS Sboner A MacDonald TY Wang Y Sheikh KL Terry S Tagawa ST Molecular characterization of neuroendocrine prostate cancer and identification of new drug targets Cancer Discov 1 487 495 2011 10.1158/2159-8290.CD-11-0130 22389870 PMC3290518 12 Fridman WH Pagès F Sautès-Fridman C Galon J The immune contexture in human tumours: Impact on clinical outcome Nat Rev Cancer 12 298 306 2012 10.1038/nrc3245 22419253 13 O'Donnell JS Teng MWL Smyth MJ Cancer immunoediting and resistance to T cell-based immunotherapy Nat Rev Clin Oncol 16 151 167 2019 10.1038/s41571-018-0142-8 30523282 14 Pardoll DM The blockade of immune checkpoints in cancer immunotherapy Nat Rev Cancer 12 252 264 2012 10.1038/nrc3239 22437870 PMC4856023 15 Langer CJ Gadgeel SM Borghaei H Papadimitrakopoulou VA Patnaik A Powell SF Gentzler RD Martins RG Stevenson JP Jalal SI Carboplatin and pemetrexed with or without pembrolizumab for advanced, non-squamous non-small-cell lung cancer: A randomised, phase 2 cohort of the open-label KEYNOTE-021 study Lancet Oncol 17 1497 1508 2016 10.1016/S1470-2045(16)30498-3 27745820 PMC6886237 16 Patel SH Rimner A Cohen RB Combining immunotherapy and radiation therapy for small cell lung cancer and thymic tumors Transl Lung Cancer Res 6 186 195 2017 10.21037/tlcr.2017.03.04 28529901 PMC5420531 17 Orange JS Ballas ZK Natural killer cells in human health and disease Clin Immunol 118 1 10 2006 10.1016/j.clim.2005.10.011 16337194 18 Vivier E Tomasello E Baratin M Walzer T Ugolini S Functions of natural killer cells Nat Immunol 9 503 510 2008 10.1038/ni1582 18425107 19 Doherty DG O'Farrelly C Innate and adaptive lymphoid cells in the human liver Immunol Rev 174 5 20 2000 10.1034/j.1600-0528.2002.017416.x 10807503 20 Joyce JA Pollard JW Microenvironmental regulation of metastasis Nat Rev Cancer 9 239 252 2009 10.1038/nrc2618 19279573 PMC3251309 21 Ferlazzo G Pack M Thomas D Paludan C Schmid D Strowig T Bougras G Muller WA Moretta L Münz C Distinct roles of IL-12 and IL-15 in human natural killer cell activation by dendritic cells from secondary lymphoid organs Proc Natl Acad Sci USA 101 16606 16611 2004 10.1073/pnas.0407522101 15536127 PMC534504 22 Romagnani C Juelke K Falco M Morandi B D'Agostino A Costa R Ratto G Forte G Carrega P Lui G CD56brightCD16- killer Ig-like receptor-NK cells display longer telomeres and acquire features of CD56dim NK cells upon activation J Immunol 178 4947 4955 10.4049/jimmunol.178.8.4947 17404276 23 Cooper MA Fehniger TA Caligiuri MA The biology of human natural killer-cell subsets Trends Immunol 22 633 640 2001 10.1016/S1471-4906(01)02060-9 11698225 24 Domaica CI Sierra JM Zwirner NW Fuertes MB Immunomodulation of NK cell activity Methods Mol Biol 2097 125 136 2020 10.1007/978-1-0716-0203-4_9 31776924 25 Balsamo M Scordamaglia F Pietra G Manzini C Cantoni C Boitano M Queirolo P Vermi W Facchetti F Moretta A Melanoma-associated fibroblasts modulate NK cell phenotype and antitumor cytotoxicity Proc Natl Acad Sci USA 106 20847 20852 2009 10.1073/pnas.0906481106 19934056 PMC2791633 26 Lee HH Cho H Improved anti-cancer effect of curcumin on breast cancer cells by increasing the activity of natural killer cells J Microbiol Biotechnol 28 874 882 2018 10.4014/jmb.1801.01074 29642292 27 Montagner IM Penna A Fracasso G Carpanese D Dalla Pietà A Barbieri V Zuccolotto G Rosato A Anti-PSMA CAR-engineered NK-92 cells: An off-the-shelf cell therapy for prostate cancer Cells 9 1382 2020 10.3390/cells9061382 32498368 PMC7349573 28 Lundholm M Schröder M Nagaeva O Baranov V Widmark A Mincheva-Nilsson L Wikström P Prostate tumor-derived exosomes down-regulate NKG2D expression on natural killer cells and CD8+ T cells: Mechanism of immune evasion PLoS One 9 e108925 2014 10.1371/journal.pone.0108925 25268476 PMC4182531 29 Levy EM Roberti MP Mordoh J Natural killer cells in human cancer: From biological functions to clinical applications Biomed Res Int 2011 676198 2011 10.1155/2011/676198 PMC3085499 21541191 30 Tian T Li Z Targeting Tim-3 in cancer with resistance to PD-1/PD-L1 blockade Front Oncol 11 731175 2021 10.3389/fonc.2021.731175 34631560 PMC8492972 31 Siemińska I Baran J Myeloid-derived suppressor cells as key players and promising therapy targets in prostate cancer Front Oncol 12 862416 2022 10.3389/fonc.2022.862416 35860573 PMC9289201 32 Modena A Ciccarese C Iacovelli R Brunelli M Montironi R Fiorentino M Tortora G Massari F Immune checkpoint inhibitors and prostate cancer: A new frontier? Oncol Rev 10 293 2016 27471580 10.4081/oncol.2016.293 PMC4943092 33 Kamada T Togashi Y Tay C Ha D Sasaki A Nakamura Y Sato E Fukuoka S Tada Y Tanaka A PD-1(+) regulatory T cells amplified by PD-1 blockade promote hyperprogression of cancer Proc Natl Acad Sci USA 116 9999 10008 2019 10.1073/pnas.1822001116 31028147 PMC6525547 34 Quatrini L Mariotti FR Munari E Tumino N Vacca P Moretta L The immune checkpoint PD-1 in natural killer cells: Expression, function and targeting in tumour immunotherapy Cancers (Basel) 12 3285 2020 10.3390/cancers12113285 33172030 PMC7694632 35 Majdalawieh AF Fayyad MW Recent advances on the anti-cancer properties of Nigella sativa, a widely used food additive J Ayurveda Integr Med 7 173 180 2016 10.1016/j.jaim.2016.07.004 27649635 PMC5052360 36 Dajani EZ Shahwan TG Dajani NE Overview of the preclinical pharmacological properties of Nigella sativa (black seeds): A complementary drug with historical and clinical significance J Physiol Pharmacol 67 801 817 2016 28195061 37 Bayır AG Karakaş I The Role of Nigella sativa Eurasian J Med Biol Sci 1 1 12 2021 38 Ramadan MF Nutritional value, functional properties and nutraceutical applications of black cumin (Nigella sativa L.): An overview Int J Food Sci Technol 42 1208 1218 2007 10.1111/j.1365-2621.2006.01417.x 39 AlShaibi HF Ahmed F Buckle C Fowles ACM Awlia J Cecchini MG Eaton CL The BMP antagonist Noggin is produced by osteoblasts in response to the presence of prostate cancer cells Biotechnol Appl Biochem 65 407 418 2018 10.1002/bab.1619 28981962 40 Randhawa MA Alghamdi MS Anticancer activity of Nigella sativa (black seed)-a review Am J Chin Med 39 1075 1091 2011 10.1142/S0192415X1100941X 22083982 41 Schneider-Stock R Fakhoury IH Zaki AM El-Baba CO Gali-Muhtasib HU Thymoquinone: Fifty years of success in the battle against cancer models Drug Discov Today 19 18 30 2014 10.1016/j.drudis.2013.08.021 24001594 42 Khan MA Tania M Fu S Fu J Thymoquinone, as an anticancer molecule: From basic research to clinical investigation Oncotarget 8 51907 2017 10.18632/oncotarget.17206 28881699 PMC5584300 43 Khan MA Tania M Wei C Mei Z Fu S Cheng J Xu J Fu J Thymoquinone inhibits cancer metastasis by downregulating TWIST1 expression to reduce epithelial to mesenchymal transition Oncotarget 6 19580 19591 2015 10.18632/oncotarget.3973 26023736 PMC4637306 44 Majdalawieh AF Hmaidan R Carr RI Nigella sativa modulates splenocyte proliferation, Th1/Th2 cytokine profile, macrophage function and NK anti-tumor activity J Ethnopharmacol 131 268 275 2010 10.1016/j.jep.2010.06.030 20600757 45 Sjs B Kavithaa K Poornima A Haribalan P Renukadevi B Sumathi S Modulation of gene expression by thymoquinone conjugated zinc oxide nanoparticles arrested cell cycle, DNA damage and increased apoptosis in triple negative breast cancer cell line MDA-MB-231 Drug Dev Ind Pharm 47 1 19 2022 10.1080/03639045.2022.2072513 35510706 46 Alshaibi HF Aldarmahi NA Alkhattabi NA Alsufiani HM Tarbiah NI Studying the anticancer effects of thymoquinone on breast cancer cells through natural killer cell activity Biomed Res Int 2022 9218640 2022 10.1155/2022/9218640 36199754 PMC9527111 47 Murphy EM Centner CS Bates PJ Malik MT Kopechek JA Delivery of thymoquinone to cancer cells with as1411-conjugated nanodroplets PLoS One 15 e0233466 2020 10.1371/journal.pone.0233466 32437399 PMC7241745 48 Peng L Liu A Shen Y Xu HZ Yang SZ Ying XZ Liao W Liu HX Lin ZQ Chen QY Antitumor and anti-angiogenesis effects of thymoquinone on osteosarcoma through the NF-κB pathway Oncol Rep 29 571 578 2013 10.3892/or.2012.2165 23232982 49 Waggoner SN Daniels KA Welsh RM Therapeutic depletion of natural killer cells controls persistent infection J Virol 88 1953 1960 2014 10.1128/JVI.03002-13 24284324 PMC3911570 50 Krebs P Barnes MJ Lampe K Whitley K Bahjat KS Beutler B Janssen E Hoebe K NK cell-mediated killing of target cells triggers robust antigen-specific T cell-mediated and humoral responses Blood 113 6593 6602 2009 10.1182/blood-2009-01-201467 19406986 PMC2710917 51 Karim S Burzangi AS Ahmad A Siddiqui NA Ibrahim IM Sharma P Abualsunun WA Gabr GA PI3K-AKT pathway modulation by thymoquinone limits tumor growth and glycolytic metabolism in colorectal cancer Int J Mol Sci 23 2305 2022 10.3390/ijms23042305 35216429 PMC8880628 52 Khan A Alsahli MA Aljasir MA Maswadeh H Mobark MA Azam F Allemailem KS Alrumaihi F Alhumaydhi FA Almatroudi AA Experimental and theoretical insights on chemopreventive effect of the liposomal thymoquinone against benzo [a] pyrene-induced lung cancer in swiss albino mice J Inflamm Res 15 2263 2280 2022 10.2147/JIR.S358632 35422652 PMC9005154 53 Mirzaei S Zarrabi A Hashemi F Zabolian A Saleki H Ranjbar A Saleh SH Bagherian M Sharifzadeh SO Hushmandi K Regulation of nuclear factor-KappaB (NF-κB) signaling pathway by non-coding RNAs in cancer: Inhibiting or promoting carcinogenesis? Cancer Lett 509 63 80 2021 10.1016/j.canlet.2021.03.025 33838282 54 Zhang N Bevan MJ CD8+ T cells: Foot soldiers of the immune system Immunity 35 161 168 2011 10.1016/j.immuni.2011.07.010 21867926 PMC3303224 55 Ibrahim S Fahim SA Tadros SA Badary OA Suppressive effects of thymoquinone on the initiation stage of diethylnitrosamine hepatocarcinogenesis in rats J Biochem Mol Toxicol 36 e23078 2022 10.1002/jbt.23078 35437842 56 Zhang B Ting WJ Gao J Kang ZF Huang CY Weng YJ Erk phosphorylation reduces the thymoquinone toxicity in human hepatocarcinoma Environ Toxicol 36 1990 1998 2021 10.1002/tox.23317 34173702 PMC8456969 57 Zhang R Wu T Zheng P Liu M Xu G Xi M Yu J Thymoquinone sensitizes human hepatocarcinoma cells to TRAIL-induced apoptosis via oxidative DNA damage DNA Repair (Amst) 103 103117 2021 10.1016/j.dnarep.2021.103117 33990030 58 Narayanan P Farghadani R Nyamathulla S Rajarajeswaran J Thirugnanasampandan R Bhuwaneswari G Natural quinones induce ROS-mediated apoptosis and inhibit cell migration in PANC-1 human pancreatic cancer cell line J Biochem Mol Toxicol 36 e23008 2022 10.1002/jbt.23008 35253318 59 Zhang M Du H Wang L Yue Y Zhang P Huang Z Lv W Ma J Shao Q Ma M Thymoquinone suppresses invasion and metastasis in bladder cancer cells by reversing EMT through the Wnt/β-catenin signaling pathway Chem Biol Interact 320 109022 2020 10.1016/j.cbi.2020.109022 32112862 60 Sutton VR Davis JE Cancilla M Johnstone RW Ruefli AA Sedelies K Browne KA Trapani JA Initiation of apoptosis by granzyme B requires direct cleavage of bid, but not direct granzyme B-mediated caspase activation J Exp Med 192 1403 1414 2000 10.1084/jem.192.10.1403 11085743 PMC2193191 61 Shimasaki N Jain A Campana D NK cells for cancer immunotherapy Nat Rev Drug Discov 19 200 218 2020 10.1038/s41573-019-0052-1 31907401 62 Smyth MJ Cretney E Kelly JM Westwood JA Street SE Yagita H Takeda K van Dommelen SL Degli-Esposti MA Hayakawa Y Activation of NK cell cytotoxicity Mol Immunol 42 501 510 2005 10.1016/j.molimm.2004.07.034 15607806 63 Kingdom of Saudi Arabia, Saudi Health Council, National Cancer Center, Saudi Cancer Registry Cancer Incididence Report Saudi Arabia 2020 https://shc.gov.sa/Arabic/NewNCC/Activities/AnnualReports/2020.pdf January 5 2025 64 Chowdhury D Lieberman J Death by a thousand cuts: Granzyme pathways of programmed cell death Annu Rev Immunol 26 389 420 2008 10.1146/annurev.immunol.26.021607.090404 18304003 PMC2790083 65 Young JD Hengartner H Podack ER Cohn ZA Purification and characterization of a cytolytic pore-forming protein from granules of cloned lymphocytes with natural killer activity Cell 44 849 859 1986 10.1016/0092-8674(86)90007-3 2420467 66 Singh SK Mishra MK Lillard JW Singh R Thymoquinone enhanced the tumoricidal activity of NK cells against lung cancer J Immunol 200 (Supplement_1) S124 S125 2018 10.4049/jimmunol.200.Supp.124.5 67 Sethi G Ahn KS Aggarwal BB Targeting nuclear factor-κB activation pathway by thymoquinone: role in suppression of antiapoptotic gene products and enhancement of apoptosis Mol Cancer Res 6 1059 1070 2008 10.1158/1541-7786.MCR-07-2088 18567808 68 Sadeghi E Imenshahidi M Hosseinzadeh H Molecular mechanisms and signaling pathways of black cumin (Nigella sativa) and its active constituent, thymoquinone: A review Mol Biol Rep 50 5439 5454 2023 10.1007/s11033-023-08363-y 37155017 Figure 1. Cytotoxicity mechanism of NK cells. By evaluating the net input of activating and inhibitory signals from target cells through NK cell surface receptors, NK cells discriminate healthy cells from target cells. However, several tumors develop mechanisms to escape NK cell immune responses by modifying their cell surface molecules, such as low immunogenicity. Following the identification of the target cell by NK cells, the stimulation domain is activated. This is initiated by the secretion of a cytolytic enzyme, known as perforin, stored in NK cell vesicles. Perforin creates pores in the cell membrane of the target cell, allowing the passage of granzymes into the target cell and starting protein digestion (cytolysis). NK cells express TRAIL and FasL, which interact with TRAIL receptors and FAS ligands in cancer cells, respectively. This interaction results in cell death, signaling complex stimulating apoptosis. NK, natural killer; TRAIL, TNF-related apoptosis inducing ligand; TRAILR, TRAIL receptor; MHC, major histocompatibility complex; FasL, FAS ligand. Created in BioRender.com. Figure 1. Cytotoxicity mechanism of NK cells. By evaluating the net input of activating and inhibitory signals from target cells through NK cell surface receptors, NK cells discriminate healthy cells ... Figure 2. NK cells dot plot before treatment. CD56 positivity was determined by comparison with defined cut-off values obtained from unstained control cells. The NK cell purity was 95.7%. NK, natural killer. Figure 2. NK cells dot plot before treatment. CD56 positivity was determined by comparison with defined cut–off values obtained from unstained control cells. The NK cell purity was 95.7%. NK, natural ... Figure 3. NK cell cytotoxicity against PC3-RFP cells in the presence or absence of TQ. The effector (NK cells) and target (PC3-RFP) ratio was 1:2. *P<0.05; **P<0.01; ***P<0.001. NK, natural killer; TQ, thymoquinone; TC, tumor cells. Figure 3. NK cell cytotoxicity against PC3–RFP cells in the presence or absence of TQ. The effector (NK cells) and target (PC3–RFP) ratio was 1:2. * P<0.05; ** P<0.01; *** P<0.001. NK, natural killer;... Figure 4. Production of major cytokines against PC3-RFP cells by NK cells in the presence or absence of TQ. TQ enhances the release of (A) perforin, (B) granzyme B and (C) IFN-α, the major secreted cytokines of NK cells. *P<0.05; **P<0.01; ***P<0.001. NK, natural killer; TQ, thymoquinone; TC, tumor cells. Figure 4. Production of major cytokines against PC3–RFP cells by NK cells in the presence or absence of TQ. TQ enhances the release of (A) perforin, (B) granzyme B and (C) IFN– α, the major secreted ... Figure 5. Spearman correlation coefficients (2-tailed) of perforin, IFN-α and granzyme B cytokines, and natural killer cytotoxicity with PC3-RFP cells. Figure 5. Spearman correlation coefficients (2–tailed) of perforin, IFN– α and granzyme B cytokines, and natural killer cytotoxicity with PC3–RFP cells. ",
  "metadata": {
    "Title of this paper": "Molecular mechanisms and signaling pathways of black cumin (Nigella sativa) and its active constituent, thymoquinone: A review",
    "Journal it was published in:": "Oncology Letters",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486745/"
  }
}