{
  "title": "Paper_635",
  "abstract": "Indian J Hematol Blood Transfus Indian J Hematol Blood Transfus 1357 ijhbt Indian Journal of Hematology & Blood Transfusion 0971-4502 0974-0449 Springer PMC11512980 PMC11512980.1 11512980 11512980 39469184 10.1007/s12288-024-01765-3 1765 1 Original Article Non-Mutational Changes of Autophagy Marker LC3A in Patients with Acute Myeloid Leukemia; Effect of DNA Methylation and Expression Level of LncRNA-GAS5 and miRNA-155-5p, A Case Control Study Amiri Vahid 1 Mirzaeian Amin 2 Noroozi-Aghideh Ali a.noroozi@ajaums.ac.ir 2 3 1 https://ror.org/03w04rv71 grid.411746.1 0000 0004 4911 7066 Department of Laboratory Sciences, School of Paramedicine, Shahid Sadoughi University of Medical Sciences, 2 grid.411600.2 HSCT Research Center, Shahid Beheshti University of Medical Science, 3 https://ror.org/028dyak29 grid.411259.a 0000 0000 9286 0323 Department of Hematology, Faculty of Paramedicine, Aja University of Medical Sciences, 18 6 2024 10 2024 40 4 473713 621 628 23 10 2023 29 3 2024 01 10 2025 01 10 2025 28 10 2024 01 10 2025 © Indian Society of Hematology and Blood Transfusion 2024. Springer Nature or its licensor (e.g. a society or other partner) holds exclusive rights to this article under a publishing agreement with the author(s) or other rightsholder(s); author self-archiving of the accepted manuscript version of this article is solely governed by the terms of such publishing agreement and applicable law. 2024 Clinical translation of autophagy modulators is tied to thoroughly acquainted with the precise state of this process and its regulators in a particular cancer. LC3Av1 is a marker of autophagosome membrane that has been contributed with pathobiology of myriad of human cancers. In the present study, we examined the effect of promoter methylation and miR-155 and LncRNA-GAS5 (GAS5) expression levels on transcription of LC3Av1 in AML patients. The study included 60 patients with de novo AML and 20 subjects with normal bone marrow cellular composition. Methylation-Sensitive high resolution melting (MS-HRM) was performed for analysis of LC3Av1 CpG island methylation and reverse transcription-quantitative polymerase chain reaction (RT-qPCR) for assessing LC3Av1, GAS5 and miR-155 expression levels. There was a significant elevation in the expression level of miR-155 and repression of LC3Av1 in AML samples. We found that LC3Av1 downregulation was negatively associated with its CpG island hypermethylation and miR-155 expression. Aging leads to overexpression of LC3Av1. GAS5 neither was differently expressed in AML patients compared to control samples nor has been related to LC3Av1 expression. The present study revealed that epigenetic changes like DNA methylation and alteration of miR-155 have a pivotal role in repression of autophagy marker LC3Av1, which potentially could provide the important clues of prognostic and therapeutic targets. The optimal strategies for clinical implementation of autophagy in AML is yet to be fully achieved and deserve further studies. Supplementary Information The online version contains supplementary material available at 10.1007/s12288-024-01765-3. Keywords Acute Myeloid Leukemia Autophagy Epigenetic Methylation Gene Expression pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Indian Society of Hematology and Blood Transfusion 2024 ",
  "metadata": {
    "Title of this paper": "Non-Mutational Changes of Autophagy Marker LC3A in Patients with Acute Myeloid Leukemia; Effect of DNA Methylation and Expression Level of LncRNA-GAS5 and miRNA-155-5p, A Case Control Study",
    "Journal it was published in:": "Indian Journal of Hematology & Blood Transfusion",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11512980/"
  }
}