{
  "title": "Paper_369",
  "abstract": "pmc J Int Med Res J Int Med Res 3252 jimr IMR The Journal of International Medical Research 0300-0605 1473-2300 SAGE Publications PMC12484914 PMC12484914.1 12484914 12484914 41027654 10.1177/03000605251379965 10.1177_03000605251379965 1 Case Report and Case Series A case report of desmoplastic fibroblastoma in a 2-year-old child https://orcid.org/0000-0001-8584-5480 Tian Yihao Ming Jian Department of Pathology, General Hospital of Northern Theater Command, Beifang Hospital of China Medical University, China Jian Ming, Department of Pathology, General Hospital of Northern Theater Command, Beifang Hospital of China Medical University, No.83, Wenhua Road, Shenhe District, Shenyang 110001, Liaoning, China. Email: mjjgc7878@163.com 9 2025 30 9 2025 53 9 496213 03000605251379965 6 7 2025 2 9 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 SAGE Publications https://creativecommons.org/licenses/by-nc/4.0/ Creative Commons Non Commercial CC BY-NC: This article is distributed under the terms of the Creative Commons Attribution-NonCommercial 4.0 License ( https://creativecommons.org/licenses/by-nc/4.0/ https://us.sagepub.com/en-us/nam/open-access-at-sage Desmoplastic fibroblastoma is a benign tumor. It was first reported by Evans in 1995 and is also known as collagenous fibroma. We encountered a case of desmoplastic fibroblastoma in clinical practice, wherein a 2-year-old girl presented with the following specimen from the scalp—a piece of gray–white nonplastic tissue with a volume of 2 × 1.5 × 1 cm. The cut surface was gray–white, solid, and of moderate consistency. Microscopically, there were only a few tumor cells, composed of spindle-shaped and stellate fibroblasts embedded in a dense collagenous or myxoid matrix, with minimal cellular atypia. The patient underwent surgical procedures for resection and is recovering well. This report provides an opportunity for experts and scholars to learn and communicate together. A new breakthrough has been achieved with regard to the age range of onset for this disease. Desmoplastic fibroblastoma 2 years old pathology case report age range pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes typesetter ts2 Introduction Desmoplastic fibroblastoma (DFB) is a benign tumor composed of abundant collagen and a few scattered spindle-shaped or star-shaped fibroblasts. It was first reported by Evans in 1995 and is also known as collagenous fibroma. 1 2  3 Case presentation A 2-year-old girl (admitted to the General Hospital of the Northern Theater Command, No.83, Wenhua Road, Shenhe District, Shenyang, for treatment in May 2019) visited the clinic after a mass was accidentally discovered under the scalp. The general appearance of the mass was as follows: (scalp) one piece of off-white nonplastic tissue, with a volume of 2 × 1.5 × 1 cm, off-white cut surface, solid, medium in quality. Its microscopic appearance was as follows: the tumor cells were sparse and consisted of spindle-shaped and stellate-shaped fibroblasts embedded in a dense collagenous or mucoid matrix as well as myofibroblasts. The cell heterogeneity was not significant. The blood vessels in the interstitium were not obvious, and focal mucinous degeneration was occasionally observed ( Figures 1 2 Figures 3 4 Figure 1. Hematoxylin and eosin staining showing the tumor cells. Figure 2. Hematoxylin and eosin staining showing the tumor cells. Figure 3. Positive immunohistochemical staining for CD34 and Vim. Figure 4. Positive immunohistochemical staining for FOSL1. Discussion DFB generally presents as a nodular or subcircular mass with a clear perimeter; no capsule or partly covered by a pseudocapsule, with an average diameter of 4.5 cm (range: 1.0–20 cm); white or off-white cut surface; and tough or elastic texture. The histological form is usually a tumor substance composed mainly of sparse spindle-shaped or stellate fibroblasts and a large number of dense collagen fibers, and the collagen fibers are arranged in disorder and not in bundles. The nuclear chromatin is homogeneous, fine or vacuolated; small nucleoli can be seen; and mitotic figures are rare. The local interstitium may be fibrous or exhibit myxoid changes; moreover, it may contain a small amount of thin-walled small blood vessels. The results of immunohistochemistry were as follows: tumor cells expressed vimentin, focally or weakly positively expressed actins, and specific nuclei expressed FOSL1. In addition, DFB involves cytogenetic abnormality in the chromosome region 11q12. Macchia et al.  4 5 7 5 6 8  6  7  8 Regarding its differential diagnosis, the following six diseases need to be identified. 1. Invasive fibromatosis: the tumor cells express β-catenin, and molecular testing shows a mutation in the β-catenin gene. 2. Nuchal fibroma: the disease mainly occurs on the back of the nape, between the shoulders, and around the spine. The periphery of the lesion is unclear. It is mainly composed of thick collagen bundles and few and scattered fibroblasts. Proliferative tumors can be seen around the lesion, with small nerve bundles. 3. Tenosynovial fibroma: the disease mostly occurs in the distal limbs, especially the hands, fingers, and wrists, often connected to tendons or tendon sheaths. Under the microscope, the lesions are mostly lobules, mainly composed of collagen fibers, scattered spindle-shaped fibroblasts, and slit-like vascular spaces. Tumor cells do not express FOSL1. 4. Nodular fasciitis: the disease does not involve any capsule, can extend into the surrounding fat or muscle tissue, and is composed of proliferating myofibroblastic cells. Moreover, mitotic figures can be seen, along with interstitial myxedema-like, common erythrocyte extravasation, and the cells diffusely express SMA and CD10. 5. Neurofibroma: the tumor cells are short, spindle-shaped, or oval; can be arranged in waves; and diffusely express S100 and SOX10. 6. Low-grade malignant fibromyxoid sarcomas: multifibrous and myxoid areas are distributed alternately, the density of tumor cells is relatively high, often arranged in a spiral shape, tumor cells express MUC4, and FISH detection can show CREB312 gene translocation. DFB is a rare tumor that primarily occurs in adults, with an average diagnosis age of approximately 50 years.  9 10 11  12  6  5 The value of this case report lies in three breakthroughs: Breaking through the cognitive boundaries of the disease (core value) and redefining the age spectrum of onset. Current medical consensus classifies this disease within the age group of 40–60 years (World Health Organization (WHO) classification standards). The diagnosis of this 2-year-old child proves that this tumor can occur in infancy (two years earlier than the lowest age recorded in the literature), suggesting that diagnostic criteria need to include the differential category of “rare tumors in children,” revealing the mechanisms of clinical heterogeneity. The differences in presentation between child and adult cases suggest the possible existence of embryonic tumor subtypes (requiring molecular identification verification) and different driving gene expression patterns compared with adults. Correcting clinical practice guidelines (clinical value) and optimizing early diagnosis pathways, establishing a diagnostic tree for pediatric soft tissue tumors, and increasing the differential entries for this disease (especially distinguishing it from infantile fibrosarcoma). Regarding the basis for adjusting treatment strategies, the scope of surgical resection should consider the developmental characteristics of children’s organs (as opposed to extensive resection in adults). The potential for special treatment responses in children should be considered, as adult patients often undergo radiotherapy; however, infants are more sensitive to radiation, necessitating avoidance of radiotherapy’s impact on developing tissues. Promoting the translation of fundamental research (scientific value), providing key research models, and offering clinical samples for establishing “age-related tumor evolution” animal models. Considering the young age of onset in the child, the mechanisms may involve differences in gene mutation expression, embryonic developmental remnants, and other special mechanisms, which provide direction for subsequent fundamental research. Of course, this case also has some limitations. For example, the follow-up of the patient was not conducted appropriately, and there is a lack of imaging data. However, this does not affect the reason for reporting this case—the unique age of onset. In conclusion, although DFB is extremely rare or rare in childhood, it is an objective and real situation. In future clinical work, if similar children with soft tissue masses are encountered, both clinicians and pathologists should consider including the disease as one of the possible diagnoses or differential diagnoses to avoid inappropriate diagnosis. Misdiagnosis can lead to clinical undertreatment or overtreatment. The reporting of this study conforms to the Case Report (CARE) guidelines.  13 Supplemental Material sj-pdf-1-imr-10.1177_03000605251379965 - Supplemental material for A case report of desmoplastic fibroblastoma in a 2-year-old child Supplemental material, sj-pdf-1-imr-10.1177_03000605251379965 for A case report of desmoplastic fibroblastoma in a 2-year-old child by Yihao Tian and Jian Ming in Journal of International Medical Research Acknowledgements We would like to thank all the people in our team. Authors’ contributions: Funding: ORCID iD: https://orcid.org/0000-0001-8584-5480 Availability of data and materials Not applicable. Declaration of conflicting interests The authors declare that the study was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Ethics approval and consent to participate All procedures performed in studies involving human participants were in accordance with the ethical standards of the institutional research committee and with the 1964 Helsinki declaration and its later amendments or comparable ethical standards. All procedures were reviewed and approved by the Institutional Review Board of General Hospital of the Northern Theater Command (Institutional Review Board of General Hospital of the Northern Theater Command, No.83, Wenhua Road, Shenhe District, Shenyang 110001, Liaoning, China; approval number: 2025-268, and date of approval: 2025.05.30). Patient consent for publication We obtained signed consent to publish from the patient. References 1 Watanabe H Ishida Y Nagashima K et al Desmoplastic fibroblastoma (collagenous fibroma) J Dermatol 2008 35 93 97 18271804 10.1111/j.1346-8138.2008.00421.x 2 Weisberg NK DiCaudo DJ Meland NB. Collagenous fibroma (desmoplastic fibroblastoma) J Am Acad Dermatol 1999 41 292 294 10426912 10.1016/s0190-9622(99)70367-1 3 Nakayama S Nishio J Aoki M et al An update on clinicopathological, imaging and genetic features of desmoplastic fibroblastoma (collagenous fibroma) In Vivo 2021 35 69 73 33402451 10.21873/invivo.12233 PMC7880796 4 Macchia G Trombetta D Möller E et al FOSL1 as a candidate target gene for 11q12 rearrangements in desmoplastic fibroblastoma Lab Invest 2012 92 735 743 22411068 10.1038/labinvest.2012.46 5 Song XH Hu Y Pan Y. Pregnancy-associated giant abdominal desmoid tumor: a case report of active surveillance and surgical management Int J Womens Health 2025 17 2227 2232 40718085 10.2147/IJWH.S532226 PMC12292384 6 Gao L Li C Zheng W et al Desmoplastic fibroma of the ilium: a case report with 4-month follow-up and literature review Medicine (Baltimore) 2025 104 e43503 40696596 10.1097/MD.0000000000043503 PMC12282707 7 Elena C Andrea C Di Giovanni F et al Hyperparathyroidism-jaw tumor syndrome associated to a CDC73 gene pathogenic VARIANT and a nonossifying desmoplastic fibroma of the mandible Case Rep Endocrinol 2025 2025 4340464 40568365 10.1155/crie/4340464 PMC12197466 8 Al-Khateeb THH. Mandibular versus maxillary desmoplastic fibroma: a pooled analysis of world literature and report of a new case Eur J Dent 2025 19 595 606 40074000 10.1055/s-0044-1801277 PMC12182419 9 Miettinen M Fetsch JF. Collagenous fibroma (desmoplastic fibroblastoma): a clinicopathologic analysis of 63 cases of a distinctive soft tissue lesion with stellate-shaped fibroblasts Hum Pathol 1998 29 676 682 9670823 10.1016/s0046-8177(98)90275-1 10 Evans HL. Desmoplastic fibroblastoma. A report of seven cases Am J Surg Pathol 1995 19 1077 1081 7661281 11 Magro G Venti C. Childhood desmoplastic fibroblastoma (collagenous fibroma) with a 12-year follow-up Pediatr Dev Pathol 1999 2 62 64 9841708 10.1007/s100249900091 12 Bhadani JS Choudhary A Kumar A et al Chronic thigh pain in an adolescent: a case report and literature review of desmoplastic fibroma, a rare benign tumor J Orthop Case Rep 2025 15 206 210 40635943 10.13107/jocr.2025.v15.i07.5826 PMC12237495 13 Gagnier JJ Kienle G Altman DG CARE Group et al The CARE guidelines: consensus-based clinical case reporting guideline development Headache 2013 53 1541 1547 24266334 10.1111/head.12246 ",
  "metadata": {
    "Title of this paper": "The CARE guidelines: consensus-based clinical case reporting guideline development",
    "Journal it was published in:": "The Journal of International Medical Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484914/"
  }
}