{
  "title": "Paper_933",
  "abstract": "pmc Toxics Toxics 3287 toxics toxics Toxics 2305-6304 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473897 PMC12473897.1 12473897 12473897 41012371 10.3390/toxics13090750 toxics-13-00750 1 Article Structural and Kinetic Properties of Liver Rhodanese from Coptodon zillii https://orcid.org/0000-0002-6794-4749 Agboola Oluwaseun E. 1 2 3 * Ayinla Zainab A. 4 Itakorode Babamotemi O. 3 5 Akinsanya Priscilla O. 3 Okonji Raphael E. 3 Odeghe Othuke B. 6 https://orcid.org/0000-0003-3971-9891 Agboola Samuel S. 7 Oluranti Olaiya E. 8 https://orcid.org/0009-0007-0803-5493 Olojo Folake O. 9 https://orcid.org/0000-0003-2165-7936 Oyinloye Babatunji E. 1 10 11 * Zhang Jiliang Academic Editor Lu Xiaoxia Academic Editor 1 2 3 itakorgsoli29@gmail.com priscilaakinsanya@gmail.com 4 zayinla@uwaterloo.ca 5 6 bensandym@yahoo.com 7 agboolass@abuad.edu.ng 8 olaiyaoe@abuad.edu.ng 9 f.olojo@dominionuniversity.edu.ng 10 11 * agboolaoe@abuad.edu.ng babatunjioe@abuad.edu.ng 03 9 2025 9 2025 13 9 497672 750 15 7 2025 23 8 2025 02 9 2025 03 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ The global gold extraction industry has been reported to use cyanide-based recovery processes, which pose environmental effects on water resources. The study examined Coptodon zillii 2 2 2 rhodanese cyanide detoxification Coptodon zillii gold mining environmental adaptation bioremediation This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Food security is of global concern due to environmental constraints and population growth [ 1 1 2 2 3 3 Coptodon zillii 4 4 4 5 5 5 5 5 6 6 6 6 6 6 6 6 6 6 5 5 C. zillii 4 6 4 C. zillii 6 5 C. zillii 2. Materials and Methods 2.1. Materials, Sample Collection, and Authentication All the chemicals and reagents used were of analytical grade. Sodium thiosulfate, potassium cyanide, bovine serum albumin (BSA), and phenylmethylsulfonyl fluoride (PMSF) were procured from Sigma-Aldrich (St. Louis, MO, USA). Tris-HCl buffer components were bought from Merck (Darmstadt, Germany). Spectrophotometric measurements were collected using a UV-Vis spectrophotometer (Shimadzu UV-1800, Kyoto, Japan). Protein electrophoresis was performed using Bio-Rad Mini-PROTEAN equipment (Hercules, CA, USA). Specimens of Coptodon zillii C. zillii 7 2.2. Enzyme Extraction and Purification Fresh liver tissue (45 g) pooled from all fifteen specimens was homogenized in 0.1 M phosphate buffer, pH 7.2 (1:3 w v 8 9 2.3. Enzyme Assay and Protein Determination Rhodanese activity was evaluated spectrophotometrically at 460 nm following thiocyanate production [ 10 2 2 3 11 2.4. Molecular Weight Determination SDS-PAGE (10% gel) assessed subunit molecular weight using the Bio-Rad Mini-PROTEAN system [ 12 2.5. Kinetic Studies Initial velocity tests employed different doses (5–50 mM) of KCN and Na 2 2 3 13 2.6. pH and Temperature Studies Buffer systems (50 mM) ranged from pH 5.0 to 11.0: citrate (5.0–6.0), phosphate (6.5–7.5), Tris-HCl (8.0–9.0), and borate (9.5–11.0). Temperature effects were examined between 30 and 100 °C using normal assay conditions. For stability experiments, enzyme solutions were pre-incubated at specified temperatures for 60 min, with sampling at 10 min intervals for residual activity measurement [ 8 2.7. The Impact of Salts on Rhodanese Activity The impact of different salts on the activity of the rhodanese enzyme that was isolated from the liver of Coptodon zillii 10 2 2 2 2.8. Studies on Substrate Specificity Rhodanese’s substrate specificity has been extensively investigated using a variety of sulfur-containing compounds. Equimolar concentrations (20 mM) of each chemical were assessed using standard assay procedures. Ammonium persulphate, ammonium sulphate, sodium thiosulphate (Na 2 2 3 9 2.9. Studies on Heat Stability Temperatures between 30 °C and 60 °C were used in thermal stability studies. A temperature-controlled water bath (Techne Inc., Princeton, NJ, USA) was used to pre-incubate aliquots of pure enzyme in 50 mM borate buffer (pH 9.4) at different temperatures (30, 40, 50, and 60 °C). Samples (0.1 mL) were extracted at 10 min intervals over a 60 min period and tested right away for residual activity under standard conditions. 2.10. Measures for Quality Control Calibration tests are conducted on a regular basis with validated reference materials. Every test was conducted with blank controls. International biochemistry guidelines were followed in the inclusion of appropriate negative and positive controls in enzyme experiments. 2.11. Computational Study Computational experiments were performed utilizing the rhodanese domain-containing protein from Oreochromis niloticus Coptodon zillii Ligand structures (sodium thiosulfate, 2-mercaptoethanol, ammonium persulfate, and ammonium sulfate) were improved using the MMFF94 force field [ 14 15 16 17 18 19 20 21 2.12. Data Analysis All experiments were performed in triplicate, expressing data as mean ± standard error (SE). Error bars in figures represent the standard error of the mean (n = 3). Statistical analysis was performed using GraphPad Prism 8.0, applying one-way ANOVA with Tukey’s post hoc test. Significance threshold set at p 3. Results 3.1. Enzyme Purification and Molecular Features A methodical purification approach was used to successfully isolate rhodanese from the liver of C. zillii Table 1 A typical elution profile was achieved by ion-exchange chromatography set on CM-Sephadex C-50. Active fractions under 0.1 M NaCl gradient elution were a symmetrical single peak ( Figure 1 Figure 2 Table 1 3.2. Kinetic Properties and Substrate Interactions Control tests demonstrated little non-enzymatic interaction between thiosulfate and cyanide under assay conditions, verifying the enzymatic specificity of reported catalysis. A kinetic study utilizing Lineweaver–Burk plots revealed unique substrate interactions. The enzyme displayed Km values of 20.0 mM and 25.0 mM for sodium thiosulphate and potassium cyanide, with Vmax values of 1.7 and 5.0 rhodanese units (RU), respectively. In Figure 3 Figure 4 3.3. Effect of pH, Temperature, and Salts The purified enzyme recorded an optimum pH of 8 (1.6 ± 0.12 RU/mL/min) and temperature of 50 °C (0.21 ± 0.018 RU/mL/min) ( Figure 5 Figure 6 2 2 2 Coptodon zillii Figure 7 3.4. Thermal Stability Profile Temperature studies revealed optimal stability at 50 °C. The enzyme retained 57% activity after 60 min at this temperature. Activity persistence followed a clear pattern:40 °C (57%) > 50 °C (46%) > 60 °C (44%) ( Figure 8 Figure 8 3.5. Structural Analysis A native molecular weight of 36 kDa was confirmed on the gel filtration. Molecular mass and homogeneity of the enzyme were established by SDS-PAGE electrophoresis. SDS-PAGE analysis revealed a single protein band of 17 kDa ( Figure 9 Figure 10 C. zillii 3.6. Outcomes of Molecular Docking The different substrate binding modes were established in the active site pocket of rhodanese using molecular docking studies ( Table 2 Figure 11 Table 2 Figure 11 4. Discussion The industrial contamination of aquatic ecosystems by artisanal miners presents unheard challenges to global food security [ 22 23 C. zillii This is the full description of Coptodon zillii Tilapia zillii 24 C. zillii C. zillii 25 26 27 C. zillii 28 Azotobacter vinelandii 29 C. zillii C. zillii 30 31 32 33 2 2 2 34 C. zillii 35 C. zillii 36 37 C. zillii 38 39 40 41 C. zillii 42 C. zillii 5. Conclusions The C. zillii Acknowledgments The authors are grateful to the Damsem Scientific Laboratory and Research, Ado-Ekiti, Nigeria, for making its facilities available for this research. The continued support of the University of Zululand Research Committee is greatly appreciated. Disclaimer/Publisher’s Note: Author Contributions O.E.A.: Investigation, data curation, methodology, and writing the original draft. Z.A.A.: Analysis, review, and edit. B.O.I.: Analysis, review, and edit. P.O.A.: review and edit, R.E.O.: Conceptualization and Supervision, O.B.O.: editing of the work. S.S.A.: Supervision, Conception. F.O.O.: Editing of the work, O.E.O.: Editing and Validation. B.E.O.: Supervision, Conception. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement The authors declare that the data supporting the findings of this study are available within the paper. Should any raw data files be needed in another format, they are available from the corresponding author upon reasonable request. Conflicts of Interest The authors declare no conflicts of interest. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. References 1. Gatto A. Chepeliev M. Global food loss and waste estimates show increasing nutritional and environmental pressures Nat. Food 2024 5 136 147 10.1038/s43016-023-00915-6 38287151 2. Tacon A.G. Lemos D. Metian M. Fish for health: Improved nutritional quality of cultured fish for human consumption Rev. Fish. Sci. Aquac. 2020 28 449 458 10.1080/23308249.2020.1762163 3. Prabu E. Rajagopalsamy C.B. Ahilan B. Jeevagan I.J. Renuhadevi M. Tilapia—An excellent candidate species for world aquaculture: A review Annu. Res. Rev. Biol. 2019 31 1 14 10.9734/arrb/2019/v31i330052 4. Arumugam M. Jayaraman S. Sridhar A. Venkatasamy V. Brown P.B. Abdul Kari Z. Tellez-Isaias G. Ramasamy T. Recent advances in tilapia production for sustainable developments in Indian aquaculture and its economic benefits Fishes 2023 8 176 10.3390/fishes8040176 5. Verbrugge B. Lanzano C. Libassi M. The cyanide revolution: Efficiency gains and exclusion in artisanal- and small-scale gold mining Geoforum 2021 126 267 276 10.1016/j.geoforum.2021.07.030 6. Buonvino S. Arciero I. Melino S. Thiosulfate-cyanide sulfurtransferase, a mitochondrial essential enzyme: From cell metabolism to the biotechnological applications Int. J. Mol. Sci. 2022 23 8452 10.3390/ijms23158452 35955583 PMC9369223 7. Adesulu E.A. Syndenham D.H.J. The Freshwater Fishes and Fisheries of Nigeria Macmillan Publishers Limited Basingstoke, UK 2007 10 234 8. Pandey M. Hajela K. Isolation, purification and characterization of a protease from the seeds of Artocarpus heterophyllus Indian J. Biochem. Biophys. (IJBB) 2023 60 690 702 9. Sörbo B.H. Lagerkvist U. Pesola R. Virtanen A.I. Sörensen N.A. Crystalline Rhodanese. I. Purification and physicochemical examination Acta Chem. Scand. 1953 7 1129 1136 10.3891/acta.chem.scand.07-0238 10. Lee C.H. Hwang J.H. Lee Y.S. Cho K.S. Purification and Characterization of mouse liver rhodanese J. Biochem. Mol. Biol. 1995 28 170 176 11. Bradford K.M. A rapid and sensitive method for the quantitation of microgram quantities of protein utilizing the principle of protein-dye binding Anal. Biochem. 1976 72 248 254 10.1016/0003-2697(76)90527-3 942051 12. Weber K. Osborn M. Protein and Sodium Dodecyl Sulphate: Molecular Weight Determination on Polyacrylamide Gels and Related Procedures The Proteins Academic Press New York, NY, USA 1975 179 223 13. Lineweaver H. Burk D. The determination of enzyme dissociation constants J. Am. Chem. Soc. 1934 56 658 666 10.1021/ja01318a036 14. Sriramulu D.K. Lee S.G. Effect of molecular properties of the protein-ligand complex on the prediction accuracy of AutoDock J. Mol. Graph. Model. 2021 106 107921 10.1016/j.jmgm.2021.107921 33887523 15. Agboola O.E. Ayinla Z.A. Agboola S.S. Adegbuyi T.A. Akinseye J.F. Sijuade A. Egbebi A.H. Ilesanmi O.S. Agboola A.A. Ibrahim O.K. Molecular mechanisms underlying the erectogenic effects of nutraceutical lunamarine, a novel PDE5 inhibitor derived from watermelon ( Citrullus lanatus Discov. Food 2024 4 153 10.1007/s44187-024-00233-1 16. Zayed A.O. Optimizing protein-ligand docking through machine learning: Algorithm selection with AutoDock Vina Discov. Chem. 2025 2 164 10.1007/s44371-025-00246-4 17. Agboola O.E. Agboola S.S. Oyinloye O.M. Fadugba A.E. Omolayo E.Y. Ayinla Z.A. Osunsanmi F.O. Olaiya O.E. Olojo F.O. Ajiboye B.O. Integrative genomic and in silico analysis reveals mitochondrially encoded cytochrome C oxidase III (MT-CO 3 Genes 2025 16 546 10.3390/genes16050546 40428367 PMC12111084 18. Oyinloye B.E. Agboola O.E. Ayeni A.M. Oyinloye O.M. Agboola S.S. Idowu O.T. Mathenjwa-Goqo M.S. Owolabi O.V. Ogunyinka B.I. Osunsanmi F.O. Computational analysis of Annona muricata phytochemicals for targeted modulation of endocrine networks in polycystic ovary syndrome Discov. Food 2025 5 145 10.1007/s44187-025-00441-3 19. Agboola O.E. Ayinla Z.A. Apalowo O. Agboola S.S. Fajana O.M. Ekundayo B.E. Itakorode B.O. Oyinloye B.E. Profilage chimio-informatique des composés phytochimiques d’Azardirachta indica en tant qu’inhibiteurs oncogènes doubles SHP2/HSP90: Identification du nimbocinol, de la nimbidinine et de la margolone Ann. Pharm. Françaises 2025 83 907 920 10.1016/j.pharma.2025.04.001 40220992 20. Agboola O.E. Agboola S.S. Agboinghale P.E. Ayinla Z.A. Oyebamiji A.K. Olaiya O.E. Fajana O.M. Oyinloye O.M. Adewale A.I. Idowu O.T. Selective modulation of orexinergic receptors by neem-derived phytochemicals: Computational analysis of structure-activity relationships Toxicol. Rep. 2025 15 102104 10.1016/j.toxrep.2025.102104 40821711 PMC12355582 21. Agboola O.E. Ayinla Z.A. Agboola S.S. Omolayo E.Y. Fadugba A.E. Odeghe O.B. Olaiya O.E. Oyinloye B.E. In silico profiling of neem limonoids and gut microbiome metabolites for Alzheimer’s therapeutics: Targeted inhibition of BACE1 and elucidation of intricate molecular crosstalk with tau oligomers, and bacterial gingipains Discov. Appl. Sci. 2025 7 312 10.1007/s42452-025-06821-9 22. Marrufo T.J. Capece B.P. Silva M.R. Influence of Artisanal Mining and Environmental Pollutants on Food Security in Southern Africa: A Systematic Review Food Energy Secur. 2025 14 e70080 10.1002/fes3.70080 23. Marshall B.G. Veiga M.M. da Silva H.A. Guimarães J.R. Cyanide contamination of the Puyango-Tumbes River caused by artisanal gold mining in Portovelo-Zaruma, Ecuador Curr. Environ. Health Rep. 2020 7 303 310 10.1007/s40572-020-00276-3 32506189 24. Geletu T.T. Tang S. Xing Y. Zhao J. Ecological niche and life-history traits of redbelly tilapia ( Coptodon zillii Aquat. Living Resour. 2024 37 2 10.1051/alr/2023030 25. Akinsiku O.T. Agboola F.K. Kuku A. Afolayan A. Physicochemical and kinetic characteristics of rhodanese from the liver of African catfish Clarias gariepinus Fish Physiol. Biochem. 2010 36 573 586 10.1007/s10695-009-9328-4 19536635 26. Smirnov A. Comte C. Mager-Heckel A.M. Addis V. Krasheninnikov I.A. Martin R.P. Entelis N. Tarassov I. Mitochondrial enzyme rhodanese is essential for 5S ribosomal RNA import into human mitochondria J. Biol. Chem. 2010 285 30792 30803 10.1074/jbc.M110.151183 20663881 PMC2945573 27. Ogudugu B.E. Ademakinwa N.A. Ezinma E.N. Agboola F.K. Purification and physicochemical properties of rhodanese from the liver of a goat, Capra aegagrus J. Biochem. Mol. Biol. Res. 2015 1 105 111 28. Horowitz P.M. Xu R. Acid pH-induced conformational changes in bovine liver rhodanese J. Biol. Chem. 1992 267 19464 19469 10.1016/S0021-9258(18)41798-X 1527067 29. Melino S. Cicero D.O. Orsale M. Forlani F. Pagani S. Paci M. Azotobacter vinelandii rhodanese: Selenium loading and ion interaction studies Eur. J. Biochem. 2003 270 4208 4215 10.1046/j.1432-1033.2003.03818.x 14519133 30. Slobodkin A.I. Slobodkina G.B. Diversity of sulfur-disproportionating microorganisms Microbiology 2019 88 509 522 10.1134/S0026261719050138 31. Volkoff H. Rønnestad I. Effects of temperature on feeding and digestive processes in fish Temperature 2020 7 307 320 10.1080/23328940.2020.1765950 PMC7678922 33251280 32. Napoli G.D. Fissore A. Salladini E. Raccuia E. Oliaro-Bosso S. Ruggiero A. Berisio R. Medina M. Velazquez-Campoy A. Adinolfi S. Characterization of Mycobacterium tuberculosis rhodanese-like sulfurtransferase SseA and its newly identified activator Rv3284: A new pathway to exploit as a drug target? bioRxiv 2025 10.1101/2025.02.04.636439 33. Papenbrock J. Guretzki S. Henne M. Latest news about the sulfurtransferase protein family of higher plants Amino Acids 2011 41 43 57 10.1007/s00726-010-0478-6 20135153 34. Babamotemi O.I. Raphael E.O. Odunayo A. Nkem T. Chinwe O. Ademakinwa O. Studies on some physicochemical properties of rhodanese synthesized by Bacillus cereus isolated from the effluents of the iron and steel smelting industry Afr. J. Biochem. Res. 2019 13 1 8 10.5897/AJBR2018.1014 35. Dildar T. Cui W. Ikhwanuddin M. Ma H. Aquatic Organisms in Response to Salinity Stress: Ecological Impacts, Adaptive Mechanisms, and Resilience Strategies Biology 2025 14 667 10.3390/biology14060667 40563918 PMC12189284 36. Chatterjee S. Hausinger R.P. Sulfur incorporation into biomolecules: Recent advances Crit. Rev. Biochem. Mol. Biol. 2022 57 461 476 10.1080/10409238.2022.2141678 36403141 PMC10192010 37. Spallarossa A. Forlani F. Carpen A. Armirotti A. Pagani S. Bolognesi M. Bordo D. The “rhodanese” fold and catalytic mechanism of 3-mercaptopyruvate sulfurtransferases: Crystal structure of SseA from Escherichia coli J. Mol. Biol. 2004 335 583 593 10.1016/j.jmb.2003.10.072 14672665 38. Sharma M. Akhter Y. Chatterjee S. A review on remediation of cyanide-containing industrial wastes using biological systems with special reference to enzymatic degradation World J. Microbiol. Biotechnol. 2019 35 70 10.1007/s11274-019-2643-8 31011828 39. Bebarta V.S. Nath A.K. Redirecting Intermediary Metabolism to Counteract Cyanide Poisoning FASEB J. 2025 39 e70709 10.1096/fj.202400230RR 40497726 PMC12153418 40. Francioso A. Baseggio Conrado A. Mosca L. Fontana M. Chemistry and biochemistry of natural sulfur compounds: Key intermediates of metabolism and redox biology Oxid. Med. Cell. Longev. 2020 2020 8294158 10.1155/2020/8294158 33062147 PMC7545470 41. Mesbah N.M. Industrial biotechnology based on enzymes from extreme environments Front. Bioeng. Biotechnol. 2022 10 870083 10.3389/fbioe.2022.870083 35480975 PMC9036996 42. Davis S. Murray J. Katsiadaki I. Cyanide in the Aquatic Environment and Its Metabolism by Fish A Report to Ornamental Aquatic Trade Association Centre for Environment Fisheries & Aquaculture Science Lowestoft, UK 2017 Figure 1 Elution Profile of Coptodon zillii Figure 2 Elution Profile of Coptodon zillii Figure 3 Lineweaver–Burk Plot for Varying Concentrations of Sodium Thiosulphate (Na 2 2 3 Coptodon zillii Figure 4 Seasonal Substrate Specificity Chart of some Sulphur-Containing Compounds. Values represent mean ± SE (n = 3). Figure 5 Effect of pH on C. zillii Figure 6 Effect of Temperature on the Activity of C. zillii Figure 7 Effect of Salts on Coptodon zillii Figure 8 Thermal Stability of Coptodon zillii Figure 9 Native Molecular Weight Determination Standard Plot. BSA (66 kDa), ovalbumin (45 kDa), pepsin (35 kDa), and α-chymotrypsinogen (25 kDa) and RD: purified rhodanese (36 kDa). Figure 10 SDS PAGE Profile of the Purified Rhodanese. Lane A: Standard proteins: β-galactosidase (118 kDa), BSA (60 kDa), ovalbumin (45 kDa), carbonic anhydrase (29 kDa), and trypsin inhibitor (20 kDa), while Lane B = purified rhodanese (17 kDa). Figure 11 Molecular Interactions of four different Substrates with Rhodanese Enzyme. ( a b c d toxics-13-00750-t001_Table 1 Table 1 Purification Summary of Rhodanese from C. zillii Purification Step Volume (mL) Total Protein (mg) Total Activity (U) Specific Activity (U/mg) Yield (%) Purification Fold Crude Extract 75 401 690.00 1.72 100 1.00 70% Ammonium Sulphate 30 90 252.00 2.80 37 1.63 CM-Sephadex C-50 17 43 140.08 3.30 20 1.92 Biogel P-100 14 21 113.68 5.40 16 3.10 Values represent means of triplicate determinations. U = Unit of enzyme activity, defined as the amount of enzyme that catalyzes the formation of 1 μmol of product per minute under standard conditions. toxics-13-00750-t002_Table 2 Table 2 Docking Result Summary. Substrate Docking Score (kcal/mol) H-Bond Donors H-Bond Acceptors Surface Interactions Interacting Residues Sodium thiosulfate −4.372 Arg173-NH, Gln161-NH 2 Glu159-COO, SO 4 Strong donor-acceptor (magenta-green gradient) Glu159, Gln161, Arg173, Arg156, Val172 Ammonium sulphate −3.832 Arg156-NH, Gln121-NH 2 SO 4 Moderate donor-acceptor interface Gln121, Trp139, Arg156 2-Mercaptoethanol −2.853 Trp139-NH, Val172-NH OH group, Val172-CO Weak donor-acceptor surface contact Gln121, Trp139, Val172 Ammonium persulphate −1.488 Gln121-NH 2 SO 4 Limited surface complementarity Gln121, Trp139 ",
  "metadata": {
    "Title of this paper": "Industrial biotechnology based on enzymes from extreme environments",
    "Journal it was published in:": "Toxics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473897/"
  }
}