{
  "title": "Paper_1144",
  "abstract": "pmc Genes (Basel) Genes (Basel) 2104 genes genes Genes 2073-4425 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469794 PMC12469794.1 12469794 12469794 41010020 10.3390/genes16091075 genes-16-01075 1 Article Evaluation of Long-Read RNA Sequencing Procedures for Novel Isoform Identification and Quantification in Human Whole Blood Okada Hikari Methodology Validation Data curation Formal analysis Investigation Resources Writing – original draft Writing – review & editing 1 † https://orcid.org/0000-0003-2550-2317 Nasti Alessandro Methodology Validation Data curation Investigation Formal analysis Resources Writing – original draft Writing – review & editing 1 * † Sakai Yoshio Validation Methodology Writing – original draft Writing – review & editing 2 Takeshita Yumie Methodology Validation Data curation Investigation Formal analysis Writing – review & editing 3 https://orcid.org/0000-0003-0434-3054 Iwabuchi Sadahiro Conceptualization Methodology Software Validation Data curation Formal analysis Visualization Writing – review & editing 4 https://orcid.org/0000-0002-5161-338X Yagi Ho Data curation Writing – review & editing 1 Hashiba Tomomi Data curation Writing – review & editing 1 Takata Noboru Data curation Writing – review & editing 2 Sato Taka-Aki Methodology Validation Writing – review & editing 5 Urabe Takeshi Methodology Validation Resources Writing – review & editing 6 Nakamura Seiji Methodology Validation Writing – review & editing 7 Takamura Toshinari Methodology Validation Resources Writing – review & editing 3 https://orcid.org/0000-0002-3383-9131 Yamashita Taro Methodology Validation Resources Writing – review & editing 2 Tamura Takuro Methodology Validation Investigation Formal analysis Resources Writing – review & editing 8 Matsubara Kenichi Methodology Validation Resources Writing – review & editing 5 Kaneko Shuichi Methodology Validation Investigation Formal analysis Resources Funding acquisition Project administration Supervision Writing – original draft Writing – review & editing 1 2 * Hu Zihua Academic Editor 1 2 3 4 5 6 7 8 * anasti@staff.kanazawa-u.ac.jp skaneko@staff.kanazawa-u.ac.jp † These authors contributed equally to this work. 12 9 2025 9 2025 16 9 496504 1075 08 8 2025 04 9 2025 09 9 2025 12 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives: Blood flows through the body and reaches all tissues, contributing to homeostasis and physiological functions. Providing information and understanding on how the transcriptome of whole blood behaves in response to physiological or pathological stimuli is critical. Methods: We collected blood from four healthy individuals and performed long-read RNA sequencing (lrRNA-seq) for the precise identification and expression quantification of RNA variants. Moreover, we compared two genome references: the Genome Reference Consortium Human Build 38 (GRCh38) and the Telomere-to-Telomere (T2T) assembly of the CHM13 cell line (T2T-CHM13). Results: With GRCh38, we could identify an average of about 46,000 genes, 1.3-fold more genes than T2T-CHM13. Similarly, we identified about 185,000 isoforms with GRCh38 and 140,000 with T2T-CHM13, finding similar differences for full splice match (FSM) and incomplete splice match (ISM) transcript isoforms. There were about 90,000 novel isoforms for GRCh38 and 70,000 for T2T-CHM13, 47% and 50% of the total number of identified isoforms, respectively. Differences in isoform numbers between GRCh38 and T2T-CHM13 were identified for the subcategories “Genic Genomic”, “Intergenic”, and “Genic Intron”. Using GRCh38, we generally identified a higher number of non-coding isoforms, as well as a higher number of isoforms aligning within intron and intergenic regions. Nonetheless, GRCh38 might incur false positive results, and T2T-CHM13 is likely more accurate for genome sequences in the repetitive regions. Conclusions: LrRNA-seq is a valid method for the identification of novel isoforms in blood, and this study is a first step toward the creation of a comprehensive database of the structure and expression of transcript isoforms for optimized predictive medicine. human whole blood long-read RNA sequencing T2T-CHM13 GRCh38 isoform identification isoform expression the department of Information-Based Medicine Development, Graduate School of Medical Sciences, Kanazawa University This research was funded by the department of Information-Based Medicine Development, Graduate School of Medical Sciences, Kanazawa University. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Blood flows through the body and reaches all peripheral tissues. It contributes to body homeostasis and maintains physiological functions. We reported previously that, in the long-term gene expression profiles of whole blood of patients undergoing regular medical health check-ups, a group of genes was stably expressed over time. These genes were mainly involved in immune system pathways, including antigen cell presentation and interferon-related signaling; meanwhile, in another group of genes, we observed altered gene expression related to altered cellular machinery signaling [ 1 This longitudinal examination showed that the whole blood gene expression signature can reveal unmanifested physiological changes. Moreover, it is now possible to predict the presence or absence of disease from RNA information in the blood. However, the accuracy of disease prediction is questionable because the basis of RNA information in the blood is incomplete. We focused on the long-read RNA-seq method, which provides more accurate isoform RNA information than short-read RNA-seq [ 2 3 4 5 6 The identification, characterization, and quantification of these variants can reveal how full blood gene expression behaves in physiological settings and under different pathological conditions [ 3 7 8 9 10 11 12 13 8 14 14 15 16 Where possible, it would be best to analyze using both references and compare the results. At present, the appropriateness of the reference may vary depending on the research purpose and analysis target. T2T-CHM13 is likely to become more widespread in the future, and a transition to T2T-CHM13 is expected in the long term [ 14 17 18 19 20 21 14 22 23 Against this background, this is the first comparative study using long-read RNA-seq from whole peripheral blood and data processed using GRCh38 and T2T-CHM13 genomic references for the whole transcriptome. Our future objective is to identify the RNA isoforms present in healthy human adult blood samples to create a database that can show transcript isoform variations when whole human blood is used as a source. This preliminary study is a necessary step toward building such a platform for optimized predictive medicine. 2. Materials and Methods 2.1. Study Design In this study, we withdrew by standard phlebotomy the peripheral whole blood from 4 participants (males: n n 1 24 Supplementary Table S1 2.2. Whole Blood RNA Isolation and lrRNA-Seq Library Creation Patient whole blood was collected in 2016 and stored in PAXgene Blood RNA Tubes, IVD (762165, QIAGEN, Hilden, Germany). Total RNA was extracted from stored blood according to the PAXgene Blood RNA Kit (762164, QIAGEN) protocol. A total RNA quality check was performed according to the Agilent RNA 6000 Nano Kit (5067-1511, Agilent Technologies, Inc., Santa Clara, CA, USA) protocol and analyzed using an Agilent 2100 Bioanalyzer (Agilent Technologies, Inc.). After confirming that the RIN value of RNA was ≥7, cDNA was synthesized and amplified using the Iso-Seq Express 2.0 kit (103-071-500, PacBio, Menlo Park, CA, USA). The prepared cDNA was then ligated with an SMRT adapter at the 5′ and 3′ ends using the SMRTbell prep kit 3.0 (102-182-700, PacBio). After library preparation, the cDNA libraries were sequenced on a Sequel IIe system (PacBio). The numbers of total reads for samples 1_M36, 2_M_105, 3_M127, and 4_M166 were, respectively: 4,456,301; 4,544,423; 4,288,374; and 4,245,914. 2.3. Sequence Analysis Processing Raw PacBio Iso-seq data (BAM files) were aligned to the GRCh38 or T2T-CHM13 genome (GCA_009914755.4 [T2T-CHM13v2.0]) using pbmm2 v10.0 (Release Version 1.10.0 · PacificBiosciences/pbmm2 · GitHub). Isoform analysis was performed with Isoseq v4.0.0 ( https://github.com/PacificBiosciences/IsoSeq https://isoseq.how/classification/pigeon.html 10 https://hgdownload.soe.ucsc.edu/goldenPath/hg38/bigZips/genes/hg38.ncbiRefSeq.gtf.gz https://hgdownload.soe.ucsc.edu/goldenPath/hs1/bigZips/genes/hs1.ncbiRefSeq.gtf.gz 14 3. Results 3.1. Known and Novel Isoforms Identified in Whole Blood The clinical parameters for all four individuals ( Supplementary Table S1 Supplementary Figure S1 25 26 Figure 1 26 25 Figure 1 We found that the Iso-Seq whole blood data analyzed with GRCh38 could identify about 46,000 genes, 1.3-fold more genes than T2T-CHM13 ( Figure 1 Figure 1 Figure 1 Figure 1 Figure 1 Figure 1 3.2. Comparison of Splice Junction Profiles and Isoform Characteristics Using GRCh38 and T2T-CHM13 References in SQANTI Analysis SQANTI identifies isoforms based on their splice junctions—the base pair GT at the beginning and AG at the end of the intron is located in 98.9% of all introns in the human genome [ 28 28 29 25 Figure 1 Figure 1 Figure 1 No difference was observed between individuals regarding the read counts for all isoform length distributions ( Figure 2 Figure 2 Figure 2 Figure 2 3.3. Features of Coding and Non-Coding Isoforms When we analyzed the number of isoforms identified per gene, we found the main difference between GRCh38 and T2T-CHM13 to be in the number of genes with 1 isoform, while a similar number of isoforms were obtained for those genes producing 2–3, 4–5, or more than 5 isoforms ( Figure 3 Figure 3 When the main variant categories are further separated into “Coding” and “Non-coding” we observe further differences between the references and among individuals ( Figure 3 Figure 3 Figure 1 Figure 3 Figure 3 Figure 3 3.4. Features of Isoform Subcategories in Whole Blood Following the subcategorization analysis of FSM isoforms ( Figure 4 25 26 Figure 4 Figure 4 Figure 4 Figure 5 Figure 5 Figure 5 Figure 5 Figure 5 Supplementary Table S2 AKAP13 PTPRC LRRK2 IQGAP1 FYB1 FCGR3B ADGRE5 LILRB2 CTSS HLA-E PTPRC LRRK2 HLA-E Supplementary Table S3 3.5. Expression Levels of lrRNA-Seq Identified Isoforms We selected eight genes of interest that are related to mRNA splicing and modulation to verify the expression of each known and novel isoform when GRCh38 ( Figure 6 Figure 6 Figure 6 FMR1 Figure 6 Figure 6 Figure 6 CTBS GNG5 30 PRIM1 NACA 31 IFNAR2 IL10RB 32 DNAJC4 NUDT22 33 Figure 6 CTBS GNG5 PRIM1 NACA IFNAR2 IL10RB DNAJC4 NUDT22 FOXP1 EIF4E3 ABI2 CYP20A1 CTSD IFITM10 33 34 35 36 HAVCR1 TIMD4 JAK3 INSL3 34 36 37 HACL1 COLQ SIDT2 TAGLN 30 36 These preliminary analyses need to be validated, since some of the fusion genes detected in healthy individuals might be artifacts. The expression identified by lrRNA-seq methods should be checked in terms of expression variations with other methods, such as DNA microarray or short-read RNA-seq. In this context, for the gene expression validation of the eight genes depicted in Figure 6 Supplementary Figure S2 The correlation between the genes’ expressions identified by short-read RNA-seq and the extent of expression identified for each gene/sample by lrRNA-seq (TPM expression of each single isoform together with the number of isoforms in their totality) was confirmed. These results confirm that the summation of isoforms’ expressions (overall gene expression) identified by lrRNA-seq methods can be cross-validated in terms of expression variations with short-read RNA-seq methods. In addition, for the eight novel isoforms shown in Figure 6 Supplementary Figure S3 MBNL2 Supplementary Figure S3 Figure 6 Supplementary Figure S4 4. Discussion Blood flows all through the body and is in constant contact with every organ via the cardiovascular system. It consists of many different cell types, which differ in the amount of RNA they contain; this influences the phenotype and function of these cells [ 38 39 40 3 41 42 43 8 44 45 46 47 48 48 49 50 51 1 52 53 54 5. Conclusions In this preliminary assessment of the whole blood full transcriptome, GRCh38 annotation appears to identify a higher number of isoforms when compared to T2T-CHM13. These differences are more evident for regions related to intron and intergenic sequencies, as well as for the identification of mono-exons. Moreover, knowing how these gene products are generated is crucial, for example in cases of isoforms derived from fusion genes, which are important when investigating diseases. We performed this first analysis to create a database that will allow users to view different isoforms, associated exons, and the endpoints of transcription on a map with two different genome references. Acknowledgments We sincerely thank Nami Nishiyama, Mai Nakayama, Yui Kawamura, Riei Tsurumi, and Miu Awaki for their excellent technical assistance. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/genes16091075/s1 Supplementary Table S2 Figure 6 Figure 6 Figure 6 Author Contributions Conceptualization, H.O., A.N., Y.S., Y.T., S.I., T.-A.S., T.U., S.N., T.T. (Toshinari Takamura), T.Y., T.T. (Takuro Tamura), K.M. and S.K.; methodology, H.O., A.N., Y.S., Y.T., S.I., T.-A.S., T.U., S.N., T.T. (Toshinari Takamura), T.Y., T.T. (Takuro Tamura), K.M. and S.K.; software, S.I. and T.T. (Takuro Tamura); validation, H.O., A.N., Y.S., Y.T., S.I., T.-A.S., T.U., S.N., T.T. (Toshinari Takamura), T.Y., T.T. (Takuro Tamura), K.M. and S.K.; formal analysis, H.O., A.N., Y.T., S.I., T.T. (Takuro Tamura) and S.K.; investigation, H.O., A.N., Y.T., T.T. (Takuro Tamura) and S.K.; resources, H.O., A.N., Y.S., T.H., N.T., T.-A.S., T.U., S.N., T.T. (Toshinari Takamura), T.Y., T.T. (Takuro Tamura), K.M. and S.K.; data curation, H.O., A.N., Y.T., S.I., H.Y., T.H. and N.T.; writing—original draft preparation, H.O., A.N., Y.S., Y.T., H.Y., T.H., N.T., T.-A.S., T.U., S.N., T.T. (Toshinari Takamura), T.Y., T.T. (Takuro Tamura), K.M. and S.K.; writing—review and editing, H.O., A.N., Y.S., Y.T., S.I., H.Y., T.H., N.T., T.-A.S., T.U., S.N., T.T. (Toshinari Takamura), T.Y., T.T. (Takuro Tamura), K.M. and S.K.; visualization, A.N., S.I. and H.Y.; supervision, Y.S. and S.K.; project administration, S.K.; funding acquisition, S.K. All authors contributed to the drafting of the work and reviewed the draft critically for the intellectual content, have read and agreed to the published version of the manuscript, and agreed to be accountable for all aspects of the work to ensure accuracy and integrity. H.O. and A.N. contributed equally to this work. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study protocol was approved by the review committees of Kanazawa University (Human Genome and Genetic Analysis Committee; protocol number: 2015-007; approval date: 25 November 2015, https://www.med.kanazawa-u.ac.jp/staff/ethics/genome/index.html Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Data Availability Statement Original dataset available upon reasonable request from the authors. Conflicts of Interest Taka-Aki Sato and Kenichi Matsubara are affiliated with the company iLAC Co., Ltd. (Tsukuba 305–0821, Japan). Seiji Nakamura is affiliated with the company DNA Chip Research Inc. (Tokyo 105–0022, Japan). Abbreviations The following abbreviations are used in this manuscript: CV Coefficient of Variation FSM Full Splice Match GRCh38 Genome Reference Consortium Human Build 38 GTF Gene Transfer Format ISM Incomplete Splice Match lrRNA-seq long-read RNA sequencing NIC Novel in Catalog NNC Novel Not in Catalog SJs Splice Junctions T2T Telomere-to-Telomere T2T-CHM13 Telomere-to-Telomere assembly of the CHM13 cell line TPM Transcripts per Million TSS Transcription Start Site References 1. Sakai Y. Nasti A. Takeshita Y. Okumura M. Kitajima S. Honda M. Wada T. Nakamura S. Takamura T. Tamura T. Eight-Year Longitudinal Study of Whole Blood Gene Expression Profiles in Individuals Undergoing Long-Term Medical Follow-Up Sci. Rep. 2021 11 16564 10.1038/s41598-021-96078-0 34400700 PMC8368195 2. Pardo-Palacios F.J. Wang D. Reese F. Diekhans M. Carbonell-Sala S. Williams B. Loveland J.E. De María M. Adams M.S. Balderrama-Gutierrez G. Systematic Assessment of Long-Read RNA-Seq Methods for Transcript Identification and Quantification Nat. Methods 2024 21 1349 1363 10.1038/s41592-024-02298-3 38849569 PMC11543605 3. De Paoli-Iseppi R. Gleeson J. Clark M.B. Isoform Age-Splice Isoform Profiling Using Long-Read Technologies Front. Mol. Biosci. 2021 8 711733 10.3389/fmolb.2021.711733 34409069 PMC8364947 4. Ahsan M.U. Liu Q. Perdomo J.E. Fang L. Wang K. A Survey of Algorithms for the Detection of Genomic Structural Variants from Long-Read Sequencing Data Nat. Methods 2023 20 1143 1158 10.1038/s41592-023-01932-w 37386186 PMC11208083 5. Christofi T. Zaravinos A. RNA Editing in the Forefront of Epitranscriptomics and Human Health J. Transl. Med. 2019 17 319 10.1186/s12967-019-2071-4 31547885 PMC6757416 6. Yang H.D. Nam S.W. Pathogenic Diversity of RNA Variants and RNA Variation-Associated Factors in Cancer Development Exp. Mol. Med. 2020 52 582 593 10.1038/s12276-020-0429-6 32346127 PMC7210288 7. National Library of Medicine Homo Sapiens Genome Assembly GRCh38 Available online: https://www.ncbi.nlm.nih.gov/data-hub/assembly/GCF_000001405.26/ (accessed on 4 September 2024) 8. Nurk S. Koren S. Rhie A. Rautiainen M. Bzikadze A.V. Mikheenko A. Vollger M.R. Altemose N. Uralsky L. Gershman A. The Complete Sequence of a Human Genome Science 2022 376 44 53 10.1126/science.abj6987 35357919 PMC9186530 9. National Human Genome Research Institute Telomere-to-Telomere Available online: https://www.genome.gov/about-genomics/telomere-to-telomere (accessed on 4 September 2024) 10. Perez G. Barber G.P. Benet-Pages A. Casper J. Clawson H. Diekhans M. Fischer C. Gonzalez J.N. Hinrichs A.S. Lee C.M. The UCSC Genome Browser Database: 2025 Update Nucleic Acids Res. 2025 53 D1243 D1249 10.1093/nar/gkae974 39460617 PMC11701590 11. Schneider V.A. Graves-Lindsay T. Howe K. Bouk N. Chen H.-C. Kitts P.A. Murphy T.D. Pruitt K.D. Thibaud-Nissen F. Albracht D. Evaluation of GRCh38 and de Novo Haploid Genome Assemblies Demonstrates the Enduring Quality of the Reference Assembly Genome Res. 2017 27 849 864 10.1101/gr.213611.116 28396521 PMC5411779 12. Behera S. LeFaive J. Orchard P. Mahmoud M. Paulin L.F. Farek J. Soto D.C. Parker S.C.J. Smith A.V. Dennis M.Y. FixItFelix: Improving Genomic Analysis by Fixing Reference Errors Genome Biol. 2023 24 31 10.1186/s13059-023-02863-7 36810122 PMC9942314 13. Altemose N. Logsdon G.A. Bzikadze A.V. Sidhwani P. Langley S.A. Caldas G.V. Hoyt S.J. Uralsky L. Ryabov F.D. Shew C.J. Complete Genomic and Epigenetic Maps of Human Centromeres Science 2022 376 eabl4178 10.1126/science.abl4178 35357911 PMC9233505 14. Aganezov S. Yan S.M. Soto D.C. Kirsche M. Zarate S. Avdeyev P. Taylor D.J. Shafin K. Shumate A. Xiao C. A Complete Reference Genome Improves Analysis of Human Genetic Variation Science 2022 376 eabl3533 10.1126/science.abl3533 35357935 PMC9336181 15. Gershman A. Sauria M.E.G. Guitart X. Vollger M.R. Hook P.W. Hoyt S.J. Jain M. Shumate A. Razaghi R. Koren S. Epigenetic Patterns in a Complete Human Genome Science 2022 376 eabj5089 10.1126/science.abj5089 35357915 PMC9170183 16. Xia Q. Ding T. Chang T. Ruan J. Yang J. Ma M. Liu J. Liu Z. Jiao S. Wu J. Nanopore Sequencing with T2T-CHM13 for Accurate Detection and Preventing the Transmission of Structural Rearrangements in Highly Repetitive Heterochromatin Regions in Human Embryos Clin. Transl. Med. 2024 14 e1612 10.1002/ctm2.1612 38445430 PMC10915734 17. Alkan C. Carbone L. Dennis M. Ernst J. Evrony G. Girirajan S. Leung D.C.Y. Cheng C.C. MacAlpine D. Ni T. Implications of the First Complete Human Genome Assembly Genome Res. 2022 32 595 598 10.1101/gr.276723.122 35361622 PMC8997351 18. Hu Y. Fang L. Chen X. Zhong J.F. Li M. Wang K. LIQA: Long-Read Isoform Quantification and Analysis Genome Biol. 2021 22 182 10.1186/s13059-021-02399-8 34140043 PMC8212471 19. Grigorev K. Nelson T.M. Overbey E.G. Houerbi N. Kim J. Najjar D. Damle N. Afshin E.E. Ryon K.A. Thierry-Mieg J. Direct RNA Sequencing of Astronaut Blood Reveals Spaceflight-Associated m6A Increases and Hematopoietic Transcriptional Responses Nat. Commun. 2024 15 4950 10.1038/s41467-024-48929-3 38862496 PMC11166648 20. Cornaby C. Montgomery M.C. Liu C. Weimer E.T. Unique Molecular Identifier-Based High-Resolution HLA Typing and Transcript Quantitation Using Long-Read Sequencing Front. Genet. 2022 13 901377 10.3389/fgene.2022.901377 35879986 PMC9308011 21. Schwenk V. Leal Silva R.M. Scharf F. Knaust K. Wendlandt M. Häusser T. Pickl J.M.A. Steinke-Lange V. Laner A. Morak M. Transcript Capture and Ultradeep Long-Read RNA Sequencing (CAPLRseq) to Diagnose HNPCC/Lynch Syndrome J. Med. Genet. 2023 60 747 759 10.1136/jmg-2022-108931 36593122 PMC10423559 22. Hoyt S.J. Storer J.M. Hartley G.A. Grady P.G.S. Gershman A. de Lima L.G. Limouse C. Halabian R. Wojenski L. Rodriguez M. From Telomere to Telomere: The Transcriptional and Epigenetic State of Human Repeat Elements Science 2022 376 eabk3112 10.1126/science.abk3112 35357925 PMC9301658 23. Yang X. Wang X. Zou Y. Zhang S. Xia M. Fu L. Vollger M.R. Chen N.-C. Taylor D.J. Harvey W.T. Characterization of Large-Scale Genomic Differences in the First Complete Human Genome Genome Biol. 2023 24 157 10.1186/s13059-023-02995-w 37403156 PMC10320979 24. Nasti A. Okumura M. Takeshita Y. Ho T.T.B. Sakai Y. Sato T.-A. Nomura C. Goto H. Nakano Y. Urabe T. The Declining Insulinogenic Index Correlates with Inflammation and Metabolic Dysregulation in Non-Obese Individuals Assessed by Blood Gene Expression Diabetes Res. Clin. Pract. 2024 208 111090 10.1016/j.diabres.2024.111090 38216088 25. Tardaguila M. De La Fuente L. Marti C. Pereira C. Pardo-Palacios F.J. Del Risco H. Ferrell M. Mellado M. Macchietto M. Verheggen K. SQANTI: Extensive Characterization of Long-Read Transcript Sequences for Quality Control in Full-Length Transcriptome Identification and Quantification Genome Res. 2018 28 396 411 10.1101/gr.222976.117 29440222 PMC5848618 26. Pardo-Palacios F.J. Arzalluz-Luque A. Kondratova L. Salguero P. Mestre-Tomás J. Amorín R. Estevan-Morió E. Liu T. Nanni A. McIntyre L. SQANTI3: Curation of Long-Read Transcriptomes for Accurate Identification of Known and Novel Isoforms Nat. Methods 2024 21 793 797 10.1038/s41592-024-02229-2 38509328 PMC11093726 27. Everitt B.S. Skrondal A. The Cambridge Dictionary of Statistics Cambridge University Press Cambridge, UK 2010 28. Parada G.E. Munita R. Cerda C.A. Gysling K. A Comprehensive Survey of Non-Canonical Splice Sites in the Human Transcriptome Nucleic Acids Res. 2014 42 10564 10578 10.1093/nar/gku744 25123659 PMC4176328 29. Cocquet J. Chong A. Zhang G. Veitia R.A. Reverse Transcriptase Template Switching and False Alternative Transcripts Genomics 2006 88 127 131 10.1016/j.ygeno.2005.12.013 16457984 30. Babiceanu M. Qin F. Xie Z. Jia Y. Lopez K. Janus N. Facemire L. Kumar S. Pang Y. Qi Y. Recurrent Chimeric Fusion RNAs in Non-Cancer Tissues and Cells Nucleic Acids Res. 2016 44 2859 2872 10.1093/nar/gkw032 26837576 PMC4824105 31. Levin J.Z. Berger M.F. Adiconis X. Rogov P. Melnikov A. Fennell T. Nusbaum C. Garraway L.A. Gnirke A. Targeted Next-Generation Sequencing of a Cancer Transcriptome Enhances Detection of Sequence Variants and Novel Fusion Transcripts Genome Biol. 2009 10 R115 10.1186/gb-2009-10-10-r115 19835606 PMC2784330 32. Pintarelli G. Dassano A. Cotroneo C.E. Galvan A. Noci S. Piazza R. Pirola A. Spinelli R. Incarbone M. Palleschi A. Read-through Transcripts in Normal Human Lung Parenchyma Are down-Regulated in Lung Adenocarcinoma Oncotarget 2016 7 27889 27898 10.18632/oncotarget.8556 27058892 PMC5053695 33. Yoshihara K. Wang Q. Torres-Garcia W. Zheng S. Vegesna R. Kim H. Verhaak R.G.W. The Landscape and Therapeutic Relevance of Cancer-Associated Transcript Fusions Oncogene 2015 34 4845 4854 10.1038/onc.2014.406 25500544 PMC4468049 34. Gao Q. Liang W.-W. Foltz S.M. Mutharasu G. Jayasinghe R.G. Cao S. Liao W.-W. Reynolds S.M. Wyczalkowski M.A. Yao L. Driver Fusions and Their Implications in the Development and Treatment of Human Cancers Cell Rep. 2018 23 227 238.e3 10.1016/j.celrep.2018.03.050 29617662 PMC5916809 35. Varley K.E. Gertz J. Roberts B.S. Davis N.S. Bowling K.M. Kirby M.K. Nesmith A.S. Oliver P.G. Grizzle W.E. Forero A. Recurrent Read-through Fusion Transcripts in Breast Cancer Breast Cancer Res. Treat. 2014 146 287 297 10.1007/s10549-014-3019-2 24929677 PMC4085473 36. Mitelman F. Johansson B. Mertens F. Mitelman Database Chromosome Aberrations and Gene Fusions in Cancer Available online: https://mitelmandatabase.isb-cgc.org/ (accessed on 3 January 2025) 37. The Cancer Genome Atlas Research Network Comprehensive Molecular Characterization of Papillary Renal-Cell Carcinoma N. Engl. J. Med. 2016 374 135 145 10.1056/NEJMoa1505917 26536169 PMC4775252 38. Sumitomo S. Nagafuchi Y. Tsuchida Y. Tsuchiya H. Ota M. Ishigaki K. Suzuki A. Kochi Y. Fujio K. Yamamoto K. Transcriptome Analysis of Peripheral Blood from Patients with Rheumatoid Arthritis: A Systematic Review Inflamm. Regen. 2018 38 21 10.1186/s41232-018-0078-5 30410636 PMC6217768 39. De Sota R.E. Quake S.R. Sninsky J.J. Toden S. Decoding Bioactive Signals of the RNA Secretome: The Cell-Free Messenger RNA Catalogue Expert Rev. Mol. Med. 2024 26 e12 10.1017/erm.2024.12 38682644 PMC11140549 40. Cao X. Zhou X. Chen S. Xu C. Integration of Transcriptomics and Metabolomics Reveals the Responses of the Maternal Circulation and Maternal-Fetal Interface to LPS-Induced Preterm Birth in Mice Front. Immunol. 2023 14 1213902 10.3389/fimmu.2023.1213902 37649476 PMC10464907 41. Humphrey J. Brophy E. Kosoy R. Zeng B. Coccia E. Mattei D. Ravi A. Efthymiou A.G. Navarro E. Muller B.Z. Long-Read RNA-Seq Atlas of Novel Microglia Isoforms Elucidates Disease-Associated Genetic Regulation of Splicing medRxiv 2023 10.1101/2023.12.01.23299073 40033057 42. Aguzzoli Heberle B. Brandon J.A. Page M.L. Nations K.A. Dikobe K.I. White B.J. Gordon L.A. Fox G.A. Wadsworth M.E. Doyle P.H. Mapping Medically Relevant RNA Isoform Diversity in the Aged Human Frontal Cortex with Deep Long-Read RNA-Seq Nat. Biotechnol. 2025 43 635 646 10.1038/s41587-024-02245-9 38778214 PMC11863200 43. Ament I.H. DeBruyne N. Wang F. Lin L. Long-Read RNA Sequencing: A Transformative Technology for Exploring Transcriptome Complexity in Human Diseases Mol. Ther. 2025 33 883 894 10.1016/j.ymthe.2024.11.025 39563027 PMC11897757 44. Xu J. Zhang J. Zhang W. Antisense RNA: The New Favorite in Genetic Research J. Zhejiang Univ. Sci. B 2018 19 739 749 10.1631/jzus.B1700594 30269442 PMC6194357 45. Liu B. Xiang W. Liu J. Tang J. Wang J. Liu B. Long Z. Wang L. Yin G. Liu J. The Regulatory Role of Antisense lncRNAs in Cancer Cancer Cell Int. 2021 21 459 10.1186/s12935-021-02168-4 34461912 PMC8404292 46. Hangauer M.J. Vaughn I.W. McManus M.T. Pervasive Transcription of the Human Genome Produces Thousands of Previously Unidentified Long Intergenic Noncoding RNAs PLoS Genet. 2013 9 e1003569 10.1371/journal.pgen.1003569 23818866 PMC3688513 47. Ransohoff J.D. Wei Y. Khavari P.A. The Functions and Unique Features of Long Intergenic Non-Coding RNA Nat. Rev. Mol. Cell Biol. 2018 19 143 157 10.1038/nrm.2017.104 29138516 PMC5889127 48. National Library of Medicine Pubmed Available online: https://pubmed.ncbi.nlm.nih.gov/ (accessed on 3 January 2025) 49. Miga K.H. Newton Y. Jain M. Altemose N. Willard H.F. Kent W.J. Centromere Reference Models for Human Chromosomes X and Y Satellite Arrays Genome Res. 2014 24 697 707 10.1101/gr.159624.113 24501022 PMC3975068 50. Chaisson M.J.P. Huddleston J. Dennis M.Y. Sudmant P.H. Malig M. Hormozdiari F. Antonacci F. Surti U. Sandstrom R. Boitano M. Resolving the Complexity of the Human Genome Using Single-Molecule Sequencing Nature 2015 517 608 611 10.1038/nature13907 25383537 PMC4317254 51. Wagner J. Olson N.D. Harris L. McDaniel J. Cheng H. Fungtammasan A. Hwang Y.-C. Gupta R. Wenger A.M. Rowell W.J. Curated Variation Benchmarks for Challenging Medically Relevant Autosomal Genes Nat. Biotechnol. 2022 40 672 680 10.1038/s41587-021-01158-1 35132260 PMC9117392 52. Chu T. Wang Z. Pe’er D. Danko C.G. Cell Type and Gene Expression Deconvolution with BayesPrism Enables Bayesian Integrative Analysis across Bulk and Single-Cell RNA Sequencing in Oncology Nat. Cancer 2022 3 505 517 10.1038/s43018-022-00356-3 35469013 PMC9046084 53. Aoki Y. Taguchi K. Anzawa H. Kawashima J. Ishida N. Otsuki A. Hasegawa A. Baird L. Suzuki T. Motoike I.N. Whole Blood Transcriptome Analysis for Age- and Gender-Specific Gene Expression Profiling in Japanese Individuals J. Biochem. 2024 175 611 627 10.1093/jb/mvae008 38268329 PMC11756699 54. Gal-Oz S.T. Maier B. Yoshida H. Seddu K. Elbaz N. Czysz C. Zuk O. Stranger B.E. Ner-Gaon H. Shay T. ImmGen Report: Sexual Dimorphism in the Immune System Transcriptome Nat. Commun. 2019 10 4295 10.1038/s41467-019-12348-6 31541153 PMC6754408 Figure 1 Identification of known and novel genes and isoforms in peripheral blood using GRCh38 (HG38) and T2T-CHM13 (T2T) genome references. ( A 25 26 B C D E F G A F 27 H I B F H Figure 2 Count quantification per isoform length in peripheral blood using GRCh38 (HG38) and T2T-CHM13 (T2T) genome references. ( A B C A C D Figure 3 Features of coding and non-coding isoforms in peripheral blood using GRCh38 (HG38) and T2T-CHM13 (T2T) genome references. ( A B C D E A C D B E 27 Figure 4 Identification of FSM and ISM isoform subcategories in peripheral blood using GRCh38 (HG38) and T2T-CHM13 (T2T) genome references. ( A 25 26 B C 25 26 D B D N Figure 5 Identification of NIC and NNC isoform subcategories in peripheral blood using GRCh38 (HG38) and T2T-CHM13 (T2T) genome references. ( A 25 26 B C D E F G B G N Figure 6 Long-read RNA-seq identified isoforms and expression levels. ( A B A B C D CTBS GNG5 PRIM1 NACA IFNAR2 IL10RB DNAJC4 NUDT22 ",
  "metadata": {
    "Title of this paper": "ImmGen Report: Sexual Dimorphism in the Immune System Transcriptome",
    "Journal it was published in:": "Genes",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469794/"
  }
}