{
  "title": "Paper_553",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12480838 PMC12480838.1 12480838 12480838 41023009 10.1038/s41598-025-18864-4 18864 1 Article The masking effects of self-efficacy and marital satisfaction on the association between childhood trauma and postpartum depressive symptoms: a cross-sectional study Wang Yanchi 1 2 3 Huang Wei 2 Xu Xujuan xxj_1124@126.com 3 Gu Jian gujianntu@163.com 2 1 https://ror.org/006teas31 grid.39436.3b 0000 0001 2323 5732 Affiliated Nantong Hospital of Shanghai University (The Sixth People’s Hospital of Nantong), 2 https://ror.org/02afcvw97 grid.260483.b 0000 0000 9530 8833 Nantong University, 3 https://ror.org/001rahr89 grid.440642.0 0000 0004 0644 5481 Affiliated Hospital of Nantong University, 29 9 2025 2025 15 478255 33598 13 1 2025 4 9 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Adequate mental health underlies individuals’ overall well-being. This study aims to probe the relationship between childhood trauma and postpartum depressive symptoms among women and dissect the mediating roles of self-efficacy and marital satisfaction, and endeavors to supply pragmatic directives for precluding and taking remedial action on postpartum depression. The study was conducted from December 2023 to June 2024 at the postpartum clinics of three representative tertiary hospitals in Nantong City, with the participants being mothers undergoing their 42-day postpartum check-up. Participants completed the childhood trauma questionnaire (CTQ), the Edinburgh postnatal depression scale (EPDS), the general self-efficacy scale (GSES), and the marital satisfaction scale (MSS). Using SPSS 27.0 and the process macro (Model 4), our parallel mediation analysis revealed that self-efficacy and marital satisfaction acted as masking mediators. These mediators accounted for 64.0% and 133.3% of the total effect, respectively (absolute values), indicating suppression effects. Importantly, the explanatory value of the integrated model lies in its ability to simultaneously assess both pathways, showing how these mediators jointly influence the association between childhood trauma and postpartum depression. This study clarifies the complex relationships among childhood trauma, self-efficacy, marital satisfaction, and postpartum depressive symptoms. Identifying self-efficacy and marital satisfaction as masking mediators offers crucial guidance for PPD prevention and intervention, supplying targeted evidence for alleviating postpartum depressive symptoms by strengthening the former two. It holds significant reference value for comprehensive measures to boost the mental health and well-being of postpartum women and their families. Keywords Childhood trauma Postpartum depressive symptoms Self-efficacy Marital satisfaction Mediation analysis Subject terms Depression Post-traumatic stress disorder The scientific research projects of Nantong Commission of Health QN2023043 Wang Yanchi pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Postpartum Depression (PPD) is a pervasive and grave mental health concern that casts a wide net of consequences on mothers and their families 1 2 3 4 5 5 6 7 8 9 10 11 12 13 PPD is a multifaceted condition influenced by a range of biological 1 6 14 15 16 17 18 20 21 22 23 24 25 26 27 30 28 29 30 27 Self-efficacy, defined as an individual’s belief and perception of their ability to successfully perform a particular behavior, plays a crucial role in a mother’s postpartum experience 31 32 33 34 35 36 Marital satisfaction is also a significant factor in postpartum mental health. According to attachment theory, a secure attachment style is associated with higher marital satisfaction and better mental health 37 38 39 40 41 40 In conclusion, the study aims to uncover the connection tying childhood trauma to postpartum depressive symptoms and examine the mediatory contributions of self-efficacy along with marital satisfaction. Through the in-depth discussions and analyses presented earlier, we have formulated the hypothesized model (Fig. 1 Fig. 1 Hypothetical model of this study. Methods Participants The study was conducted between December 2023 and June 2024 at three major tertiary hospitals in Nantong City, specifically in their postpartum clinics. The study involved women attending their 42-day postpartum health assessments. The 42-day postpartum assessment was selected based on empirical evidence and policy considerations: (1) this period represents a critical biological and psychological transition phase, with physiological recovery and maternal role adaptation converging, during which depressive symptoms often emerge or intensify 1 42 43 44 Measures Basic information survey The basic information survey, crafted by our research group, aimed to gather critical data, encompassing two main areas: (1) key demographic details such as maternal age, education level, and residential location, and (2) factors pertinent to maternity, including the number of previous pregnancies, any history of miscarriages, use of fertility treatments, and complications encountered during pregnancy. Childhood trauma questionnaire-short form (CTQ-SF) The CTQ-SF, a recognized tool for assessing childhood trauma and abuse experiences, consists of 28 items across five categories 45 46 Edinburgh postnatal depression scale (EPDS) The EPDS, which was developed by Cox et al. 47 48 49 50 50 Chinese version of the general self-efficacy scale (GSES) The GSES, which was formulated by Schwarzer 51 52 Marital satisfaction scale (MSS) The MSS is part of Olson’s ENRICH Marital Quality Questionnaire developed by Olson et al. 53 54 Ethics Ethical approval for this study was granted by the Ethics Committee of the Affiliated Hospital of Nantong University. The approval reference number assigned is 2022-K150-01. All procedures involved in this research were carried out in accordance with the Declaration of Helsinki. Clinical trial number: not applicable. At the outset of the questionnaire, participants were given a comprehensive understanding of the study’s objectives. It was emphasized that taking part in the survey was optional, and the confidentiality, privacy, and anonymity of the respondents were assured. The participants were made aware of their right to withdraw from the study whenever they wished, and they were assured that doing so would not lead to any adverse outcomes. The research team pledged that the collected data would be kept confidential and used solely for research purposes. Statistical analysis For measurement data that conform to the normal distribution, they are described by mean ± SD. For measurement data that do not conform to the normal distribution, they are described by median and quartiles. And for categorical data, they are described by frequency or proportion. The Mann–Whitney U-test and the Kruskal–Wallis H-test were used to examine the differences in postpartum depressive symptoms among different groups. Pearson’s correlation analysis was engaged to dissect the correlation among variables. We used multiple linear regression to assess the independent effects of childhood trauma, self-efficacy, and marital satisfaction on postpartum depressive symptoms while controlling for potential confounders. This method allows for the assessment of each predictor’s unique contribution to the outcome, adjusting for other variables that may influence the relationship. Harman’s single-factor test was used to test the common method bias 55 P Results Characteristics of the study population Data on general characteristics, namely the maternal age, education level, husband education level, residence, family monthly income, gestational week of abortion history, feeding pattern, delivery mode, parity, and assisted reproduction, were collected (Table 1 P 2 Table 1 Characteristics of the subjects enrolled in this study. Variables Participants (%) Postpartum depressive P 50 P 25 P 75 Z/H P Age < 30 years 284(45.3) 2(0,6) − 0.811 0.418 ≥ 30 years 341(54.7) 2(0,6) Education (maternal) Below bachelor 232(37.1) 2(0,6) − 0.235 0.814 Bachelor or above 393(62.9) 3(0,6) Education (paternal) Below bachelor 255(40.8) 2(0,6) − 0.328 0.743 Bachelor or above 370(59.2) 3(0,6) Residence Downtown 388(62.1) 2(0,6) 0.526 0.769 Town 126(20.1) 3(0,6) Village 111(17.8) 2(0,6) Family monthly income (CNY ¥) < 5000 21(3.4) 3(0,10) 2.065 0.559 5000–10,000 225(36.0) 3(0,7) 10,001–20,000 234(37.4) 2(0,6) > 20,000 145(23.2) 3(1,6) From only-child family Yes 462(73.9) 2.5(0,6) − 0.175 0.861 No 163(26.1) 3(0,7) Gestational week of delivery < 36 16 (2.6) 3(1,6.3) 1.762 0.414 36–37 33(5.3) 2(0,4.5) > 37 576(92.1) 3(0,6) Parity Primipara 478(76.5) 2(0,6) − 0.417 0.677 Multipara 147(23.5) 3(0,6) History of abortion Yes 184(29.4) 2(0,6) − 0.176 0.860 No 441(70.6) 3(0,6) Feeding pattern Breast-feeding 197(31.5) 2(0,6) 2.027 0.363 Mixed-feeding 319(51.1) 3(0,6) Formula milk 109(17.4) 3(1,6.5) Assisted reproduction Yes 104(16.6) 2(0,5) − 1.650 0.099 No 521(83.4) 3(0,6) Delivery mode Normal vaginal delivery 263(42.1) 3(0,6) 3.710 0.156 Lateral vaginal incision 113(18.1) 2(0,6) Cesarean section 249(39.8) 2(0,6) Pregnancy weight gain (KG) < 10 102(16.3) 2(0,6) 0.524 0.770 10–15 338(54.1) 3(0,6) > 15 185(29.6) 2(0,7) Baby birth weight (KG) < 3 62(9.9) 2.5(0,8) 1.064 0.588 3–4 492(78.7) 2(0,6) > 4 71(11.4) 3(0,7) Table 2 Distribution of postnatal depressive scores (EPDS) in the study population (n = 625). Range (min–max) Mean ± SD Postpartum depressive P (P , P ) Item 1 (1,3) 1.17 ± 1(1,1) Item 2 (1,4) 1.13 ± 1(1,1) Item 3 (1,4) 1.66 ± 1(1,2) Item 4 (1,4) 1.74 ± 2(1,2) Item 5 (1,4) 1.39 ± 1(1,2) Item 6 (1,4) 1.50 ± 1(1,2) Item 7 (1,4) 1.33 ± 1(1,1.5) Item 8 (1,4) 1.41 ± 1(1,2) Item 9 (1,4) 1.46 ± 1(1,2) Item 10 (1,4) 1.06 ± 1(1,1) Common method bias test Harman’s single-factor test was used 55 Correlation analysis Among the 625 participants, 194 (31.0%) reported experiencing at least one type of childhood trauma, as assessed by the Childhood Trauma Questionnaire (CTQ). The prevalence of specific traumatic experiences within this group is as follows: emotional neglect was reported by 130 participants (20.8%), physical neglect by 141 (22.6%), emotional abuse by 6 (1.0%), physical abuse by 4 (0.6%), and sexual abuse by 23 (3.7%). As depicted in Table 3 P P P P P Table 3 Descriptive statistics and correlation analysis results(n = 625). Mean SD 1 2 3 4 1.Childhood trauma 34.48 8.70 1 2.Postpartum depressive 3.86 4.31 0.104 ** 1 3.Self-efficacy 2.83 0.76 − 0.378 ** − 0.271 ** 1 4.Marital satisfaction 39.71 6.91 − 0.454 ** − 0.341 ** 0.411 ** 1 **P < 0.01. Multiple linear regression of postpartum depressive symptoms Multivariate linear regression analysis revealed that childhood trauma (β: − 0.053, 95% CI: − 0.095 to − 0.011, P P P 56 4 Table 4 Multiple linear regression analysis of influencing factors for postpartum depression symptoms (R 2 Variables β SE β* 95%CI t P VIF Lower Upper (Constant) 16.380 1.593 – 13.252 19.508 10.283 < 0.001 – Childhood trauma − 0.053 0.021 − 0.107 − 0.095 − 0.011 − 2.503 0.013 1.334 Self-efficacy − 1.024 0.236 − 0.182 − 1.488 − 0.561 − 4.338 < 0.001 1.264 Marital satisfaction − 0.196 0.027 − 0.315 − 0.249 − 0.143 − 7.234 < 0.001 1.376 β*: standardized regression coefficient . Mediation analysis The mediating role of self-efficacy and marital satisfaction between childhood trauma on postpartum depressive symptoms is illustrated in Fig. 2 57 58 5 Fig. 2 Mediating role of self-efficacy and marital satisfaction between childhood trauma on postpartum depressive symptoms. * P P P Table 5 Tests of mediating effects of self-efficacy and marital satisfaction (incompletely standardized indirect effect(s) of X on Y). Effect Boot SE 95 percent confidence interval Indirect effects/ direct effects Boot LLCI Boot ULCI Total effect 0.0517 0.0197 0.0130 0.0905 Direct effect − 0.0531 0.0212 − 0.0948 − 0.0114 Total indirect effect 0.1048 0.0132 0.0798 0.1321 Childhood trauma → self-efficacy → postpartum depressive symptoms 0.0340 0.0090 0.0171 0.0524 64.0% Childhood trauma → marital satisfaction → postpartum depressive symptoms 0.0708 0.0123 0.0479 0.0958 133.3% C1 − 0.0368 0.0171 − 0.0719 − 0.0036 Discussion The present study explores the complex relationship between childhood trauma and postpartum depressive symptoms, with a focus on the mediating roles of self-efficacy and marital satisfaction. Our findings reveal that these two factors act as masking mediators, highlighting the multifaceted nature of postpartum depression. While childhood trauma is a known risk factor for mental health issues in adulthood, its weak correlation with postpartum depression suggests that it alone cannot fully explain the development of this condition. Instead, postpartum depression appears to be influenced by a combination of biological, psychological, and social factors. Our mediation analysis suggests that the relationship between childhood trauma and postpartum depression may be influenced by indirect pathways, such as self-efficacy and marital satisfaction. Identifying these mediators is crucial for developing targeted interventions. Therefore, a broader exploration of contributing factors, including cultural perspectives, is necessary to enrich our understanding of these complex relationships. The roles of self-efficacy and marital satisfaction as mediators are of crucial significance. Self-efficacy, being an individual’s belief in their ability to perform specific behaviors, is a powerful determinant of a mother’s postpartum experience 59 60 61 62 63 64 A fulfilling marriage provides a solid foundation of emotional support, practical help, and a sense of belonging 65 66 67 68 69 30 70 71 The masking effect observed in this study is truly intriguing and holds several possible explanations. Self-efficacy and marital satisfaction may indeed act as protective factors that counterbalance the negative impact of childhood trauma. A mother with high self-efficacy may be able to draw on her internal resources and coping strategies more effectively 72 73 74 Our findings have significant implications for clinical practice and intervention. Cultural factors, such as societal expectations of motherhood, support systems, and attitudes towards mental health, may influence the relationship between childhood trauma and postpartum depression. For example, strong family support systems in some cultures may mitigate the impact of childhood trauma, while stigma around mental health issues in other cultures may exacerbate symptoms. Future research should explore these cultural nuances to provide a more comprehensive understanding. Healthcare practitioners should be aware of the potential effects of childhood trauma on the mental health of postpartum women. Routine care for expectant and new mothers should include systematic checks for prior trauma experiences. Interventions aimed at enhancing self-efficacy and promoting healthy marital relationships can be highly effective in preventing and treating postpartum depression, especially for those with a history of childhood trauma. Education and support programs can help mothers develop and strengthen their self-efficacy, while couples counseling and support groups can improve marital satisfaction and address underlying relationship issues. In conclusion, this study provides valuable insights into the complex relationships between childhood trauma, postpartum depressive symptoms, self-efficacy, and marital satisfaction. The masking mediating effects of self-efficacy and marital satisfaction highlight the importance of considering multiple factors when addressing postpartum depression. Future research should further investigate the mechanisms underlying these effects to develop more targeted and effective interventions, ultimately improving the mental health of postpartum women and promoting family well-being. There exist multiple limitations in this study that merit attention. Firstly, the study was carried out in the postpartum clinics of just three tertiary hospitals situated in Nantong City. The individuals involved in the study were mothers who were having their routine 42-day postpartum check-ups. This relatively small and specific sample may not be fully representative of all postpartum women, and the results may not generalize to other populations or settings. Secondly, the cross-sectional design of the study does not allow for causal inferences. Future longitudinal studies should adopt prospective cohort designs tracking participants from pregnancy (e.g., third trimester) through multiple postpartum assessments (e.g., 42 days, 3 months, 6 months) to capture dynamic risk factor accumulation and establish temporal causality. Thirdly, the familiarity of the questionnaire administrators with the study’s objectives and procedures might have influenced participants’ responses. Future studies should use blinded administrators or provide additional training to ensure neutral and unbiased questionnaire delivery. Fourth, although delivery mode and feeding pattern are clinically relevant and may influence postpartum mental health in some contexts, our analysis did not find significant associations between these variables and postpartum depressive symptoms. Future studies with larger sample sizes or different populations may explore these associations further. Finally, we recognize that our study’s focus on marital satisfaction as a mediator, rather than directly measuring adult attachment styles, may limit the depth of our understanding of the underlying mechanisms. Future research should consider incorporating measures of adult attachment styles to provide a more nuanced exploration of the pathways linking childhood trauma to postpartum depression. Conclusion In conclusion, this study has illuminated the intricate relationship between childhood trauma and postpartum depressive symptoms and highlighted the masking mediating roles of self-efficacy and marital satisfaction. Our findings underscore the significance of considering these factors in understanding and addressing postpartum depression. Childhood trauma poses a risk, but self-efficacy and marital satisfaction can act as buffers, potentially altering the trajectory of postpartum mental health. This research has important implications for clinical practice, emphasizing the need for screening and targeted interventions to enhance self-efficacy and improve marital relationships, ultimately promoting the well-being of postpartum women and their families. Future research should build on these findings to further refine our understanding and develop more effective preventive and treatment strategies. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Yanchi Wang and Wei Huang contributed equally to this work. Acknowledgements The authors give thanks for all participants who volunteered to participate in this study. Author contributions J.G. and X.X. conceptualized the study. W.H. did the analyses and prepared all the tables and figures. Y.W. wrote the first manuscript draft and J.G. offered further guidance on the analyses, interpretation and writing. All authors reviewed the manuscript. Funding This work was supported by the scientific research projects of Nantong Commission of Health (QN2023043). The funding sources had no role to play in the study design, the collection and interpretation of the data, writing of the report, or decision to submit this paper for publication. Data availability The raw data of the current study would be available from the corresponding author on reasonable request. Declarations Competing interests The authors declare no competing interests. Ethical approval Ethical approval for this study was granted by the Ethics Committee of the Affiliated Hospital of Nantong University. The approval reference number assigned is 2022-K150-01. All procedures involved in this research were carried out in accordance with the Declaration of Helsinki. Clinical trial number: not applicable. References 1. Yim IS Tanner Stapleton LR Guardino CM Hahn-Holbrook J Dunkel Schetter C Biological and psychosocial predictors of postpartum depression: Systematic review and call for integration Annu. Rev. Clin. Psychol. 2015 11 99 137 10.1146/annurev-clinpsy-101414-020426 25822344 PMC5659274 Yim, I. S., Tanner Stapleton, L. R., Guardino, C. M., Hahn-Holbrook, J. & Dunkel Schetter, C. Biological and psychosocial predictors of postpartum depression: Systematic review and call for integration. Annu. Rev. Clin. Psychol. 11 25822344 10.1146/annurev-clinpsy-101414-020426 PMC5659274 2. Li H Maternal-infant attachment and its relationships with postpartum depression, anxiety, affective instability, stress, and social support in a Canadian community sample Psychiatr. Q. 2023 94 1 9 22 10.1007/s11126-022-10011-w 36469258 Li, H. Maternal-infant attachment and its relationships with postpartum depression, anxiety, affective instability, stress, and social support in a Canadian community sample. Psychiatr. Q. 94 36469258 10.1007/s11126-022-10011-w 3. Zhao XH Zhang ZH Risk factors for postpartum depression: An evidence-based systematic review of systematic reviews and meta-analyses Asian J. Psychiatr. 2020 53 102353 10.1016/j.ajp.2020.102353 32927309 Zhao, X. H. & Zhang, Z. H. Risk factors for postpartum depression: An evidence-based systematic review of systematic reviews and meta-analyses. Asian J. Psychiatr. 53 32927309 10.1016/j.ajp.2020.102353 4. Wang Z Liu J Shuai H Cai Z Fu X Liu Y Xiao X Zhang W Krabbendam E Liu S Mapping global prevalence of depression among postpartum women Transl. Psychiatry 2021 11 1 543 10.1038/s41398-021-01663-6 34671011 PMC8528847 Wang, Z. et al. Mapping global prevalence of depression among postpartum women. Transl. Psychiatry 11 34671011 10.1038/s41398-021-01663-6 PMC8528847 5. Liu X Wang S Wang G Prevalence and risk factors of postpartum depression in women: A systematic review and meta-analysis J. Clin. Nurs. 2022 31 19–20 2665 2677 10.1111/jocn.16121 34750904 Liu, X., Wang, S. & Wang, G. Prevalence and risk factors of postpartum depression in women: A systematic review and meta-analysis. J. Clin. Nurs. 31 34750904 10.1111/jocn.16121 6. Agrawal I Mehendale AM Malhotra R Risk factors of postpartum depression Cureus 2022 14 10 e30898 36465774 10.7759/cureus.30898 PMC9711915 Agrawal, I., Mehendale, A. M. & Malhotra, R. Risk factors of postpartum depression. Cureus 14 36465774 10.7759/cureus.30898 PMC9711915 7. Fekih-Romdhane F El Hadathy D Gonzalez-Nuevo C Malaeb D Barakat H Hallit S Development and preliminary validation of the postpartum psychotic experiences scale (PPES) Psychiatry Res. 2023 329 115543 10.1016/j.psychres.2023.115543 37839316 Fekih-Romdhane, F. et al. Development and preliminary validation of the postpartum psychotic experiences scale (PPES). Psychiatry Res. 329 37839316 10.1016/j.psychres.2023.115543 8. Kamperman AM Veldman-Hoek MJ Wesseloo R Robertson Blackmore E Bergink V Phenotypical characteristics of postpartum psychosis: A clinical cohort study Bipolar Disord. 2017 19 6 450 457 10.1111/bdi.12523 28699248 Kamperman, A. M., Veldman-Hoek, M. J., Wesseloo, R., Robertson Blackmore, E. & Bergink, V. Phenotypical characteristics of postpartum psychosis: A clinical cohort study. Bipolar Disord. 19 28699248 10.1111/bdi.12523 9. Bodnar-Deren S Klipstein K Fersh M Shemesh E Howell EA Suicidal ideation during the postpartum period J. Womens Health 2016 25 12 1219 1224 10.1089/jwh.2015.5346 PMC5175420 27227751 Bodnar-Deren, S., Klipstein, K., Fersh, M., Shemesh, E. & Howell, E. A. Suicidal ideation during the postpartum period. J. Womens Health 25 10.1089/jwh.2015.5346 PMC5175420 27227751 10. Chin K Wendt A Bennett IM Bhat A Suicide and maternal mortality Curr. Psychiatry Rep. 2022 24 4 239 275 10.1007/s11920-022-01334-3 35366195 PMC8976222 Chin, K., Wendt, A., Bennett, I. M. & Bhat, A. Suicide and maternal mortality. Curr. Psychiatry Rep. 24 35366195 10.1007/s11920-022-01334-3 PMC8976222 11. Goodman SH Muzik M Simeonova DI Kidd SA Owen MT Cooper B Kim CY Rosenblum KL Weiss SJ Maternal interaction with infants among women at elevated risk for postpartum depression Front. Psychol. 2022 13 737513 10.3389/fpsyg.2022.737513 35310268 PMC8929344 Goodman, S. H. et al. Maternal interaction with infants among women at elevated risk for postpartum depression. Front. Psychol. 13 35310268 10.3389/fpsyg.2022.737513 PMC8929344 12. Aoyagi SS Tsuchiya KJ Does maternal postpartum depression affect children’s developmental outcomes? J. Obstet. Gynaecol. Res. 2019 45 9 1809 1820 10.1111/jog.14064 31321836 Aoyagi, S. S. & Tsuchiya, K. J. Does maternal postpartum depression affect children’s developmental outcomes?. J. Obstet. Gynaecol. Res. 45 31321836 10.1111/jog.14064 13. Brummelte S Galea LA Postpartum depression: Etiology, treatment and consequences for maternal care Horm. Behav. 2016 77 153 166 10.1016/j.yhbeh.2015.08.008 26319224 Brummelte, S. & Galea, L. A. Postpartum depression: Etiology, treatment and consequences for maternal care. Horm. Behav. 77 26319224 10.1016/j.yhbeh.2015.08.008 14. Dimcea DA Petca RC Dumitrascu MC Sandru F Mehedintu C Petca A Postpartum depression: Etiology, treatment, and consequences for maternal care Diagnostics 2024 14 9 865 10.3390/diagnostics14090865 38732283 PMC11083152 Dimcea, D. A. et al. Postpartum depression: Etiology, treatment, and consequences for maternal care. Diagnostics 14 38732283 10.3390/diagnostics14090865 PMC11083152 15. Saharoy R Potdukhe A Wanjari M Taksande AB Postpartum depression and maternal care: Exploring the complex effects on mothers and infants Cureus 2023 15 7 e41381 37546054 10.7759/cureus.41381 PMC10400812 Saharoy, R., Potdukhe, A., Wanjari, M. & Taksande, A. B. Postpartum depression and maternal care: Exploring the complex effects on mothers and infants. Cureus 15 37546054 10.7759/cureus.41381 PMC10400812 16. O’Hara MW Wisner KL Perinatal mental illness: Definition, description and aetiology Best Pract. Res. Clin. Obstet. Gynaecol. 2014 28 1 3 12 10.1016/j.bpobgyn.2013.09.002 24140480 PMC7077785 O’Hara, M. W. & Wisner, K. L. Perinatal mental illness: Definition, description and aetiology. Best Pract. Res. Clin. Obstet. Gynaecol. 28 24140480 10.1016/j.bpobgyn.2013.09.002 PMC7077785 17. Cho H Lee K Choi E Cho HN Park B Suh M Rhee Y Choi KS Association between social support and postpartum depression Sci. Rep. 2022 12 1 3128 10.1038/s41598-022-07248-7 35210553 PMC8873474 Cho, H. et al. Association between social support and postpartum depression. Sci. Rep. 12 35210553 10.1038/s41598-022-07248-7 PMC8873474 18. Kuzminskaite E Vinkers CH Milaneschi Y Giltay EJ Penninx B Childhood trauma and its impact on depressive and anxiety symptomatology in adulthood: A 6-year longitudinal study J. Affect Disord. 2022 312 322 330 10.1016/j.jad.2022.06.057 35760192 Kuzminskaite, E., Vinkers, C. H., Milaneschi, Y., Giltay, E. J. & Penninx, B. Childhood trauma and its impact on depressive and anxiety symptomatology in adulthood: A 6-year longitudinal study. J. Affect Disord. 312 35760192 10.1016/j.jad.2022.06.057 19. Ma N Ji X Shi Y Wang Q Wu J Cui X Niu W Adverse childhood experiences and mental health disorder in China: A nationwide study from CHARLS J. Affect Disord. 2024 355 22 30 10.1016/j.jad.2024.03.110 38548193 Ma, N. et al. Adverse childhood experiences and mental health disorder in China: A nationwide study from CHARLS. J. Affect Disord. 355 38548193 10.1016/j.jad.2024.03.110 20. Merrick MT Ford DC Ports KA Guinn AS Prevalence of adverse childhood experiences from the 2011–2014 behavioral risk factor surveillance system in 23 states JAMA Pediatr. 2018 172 11 1038 1044 10.1001/jamapediatrics.2018.2537 30242348 PMC6248156 Merrick, M. T., Ford, D. C., Ports, K. A. & Guinn, A. S. Prevalence of adverse childhood experiences from the 2011–2014 behavioral risk factor surveillance system in 23 states. JAMA Pediatr. 172 30242348 10.1001/jamapediatrics.2018.2537 PMC6248156 21. Beilharz JE Paterson M Fatt S Wilson C Burton A Cvejic E Lloyd A Vollmer-Conna U The impact of childhood trauma on psychosocial functioning and physical health in a non-clinical community sample of young adults Aust. N. Z. J. Psychiatry 2020 54 2 185 194 10.1177/0004867419881206 31631683 Beilharz, J. E. et al. The impact of childhood trauma on psychosocial functioning and physical health in a non-clinical community sample of young adults. Aust. N. Z. J. Psychiatry 54 31631683 10.1177/0004867419881206 22. Misiak B Szewczuk-Boguslawska M Samochowiec J Moustafa AA Gaweda L Unraveling the complexity of associations between a history of childhood trauma, psychotic-like experiences, depression and non-suicidal self-injury: A network analysis J. Affect Disord. 2023 337 11 17 10.1016/j.jad.2023.05.044 37230261 Misiak, B., Szewczuk-Boguslawska, M., Samochowiec, J., Moustafa, A. A. & Gaweda, L. Unraveling the complexity of associations between a history of childhood trauma, psychotic-like experiences, depression and non-suicidal self-injury: A network analysis. J. Affect Disord. 337 37230261 10.1016/j.jad.2023.05.044 23. Qiao Y Zhu D Zhao M Magnussen CG Xi B Adverse childhood experience, adopting a healthy lifestyle in adulthood, and risk of cardiovascular diseases J. Affect Disord. 2024 362 450 458 10.1016/j.jad.2024.07.023 39009308 Qiao, Y., Zhu, D., Zhao, M., Magnussen, C. G. & Xi, B. Adverse childhood experience, adopting a healthy lifestyle in adulthood, and risk of cardiovascular diseases. J. Affect Disord. 362 39009308 10.1016/j.jad.2024.07.023 24. Peverill M Rosen ML Lurie LA Sambrook KA Sheridan MA McLaughlin KA Childhood trauma and brain structure in children and adolescents Dev. Cogn. Neurosci. 2023 59 101180 10.1016/j.dcn.2022.101180 36563460 PMC9800267 Peverill, M. et al. Childhood trauma and brain structure in children and adolescents. Dev. Cogn. Neurosci. 59 36563460 10.1016/j.dcn.2022.101180 PMC9800267 25. Martins DS Hasse-Sousa M Petry-Perin C Arrial-Cordeiro RT Rabelo-da-Ponte FD Lima FM Rosa AR Bucker J Gama CS Czepielewski LS Perceived childhood adversities: Impact of childhood trauma to estimated intellectual functioning of individuals with bipolar disorder Psychiatry Res. 2019 274 345 351 10.1016/j.psychres.2019.02.046 30851597 Martins, D. S. et al. Perceived childhood adversities: Impact of childhood trauma to estimated intellectual functioning of individuals with bipolar disorder. Psychiatry Res. 274 30851597 10.1016/j.psychres.2019.02.046 26. Azoulay M Reuveni I Dan R Goelman G Segman R Kalla C Bonne O Canetti L Childhood trauma and premenstrual symptoms: The role of emotion regulation Child Abuse Negl. 2020 108 104637 10.1016/j.chiabu.2020.104637 32768748 Azoulay, M. et al. Childhood trauma and premenstrual symptoms: The role of emotion regulation. Child Abuse Negl. 108 32768748 10.1016/j.chiabu.2020.104637 27. Niwa M Lockhart S Wood DJ Yang K Francis-Oliveira J Kin K Ahmed A Wand GS Kano SI Payne JL Prolonged HPA axis dysregulation in postpartum depression associated with adverse early life experiences: A cross-species translational study Nat. Ment. Health 2024 2 5 593 604 10.1038/s44220-024-00217-1 38736646 PMC11087073 Niwa, M. et al. Prolonged HPA axis dysregulation in postpartum depression associated with adverse early life experiences: A cross-species translational study. Nat. Ment. Health 2 38736646 10.1038/s44220-024-00217-1 PMC11087073 28. Koss KJ Gunnar MR Annual research review: Early adversity, the hypothalamic-pituitary-adrenocortical axis, and child psychopathology J. Child Psychol. Psychiatry 2018 59 4 327 346 10.1111/jcpp.12784 28714126 PMC5771995 Koss, K. J. & Gunnar, M. R. Annual research review: Early adversity, the hypothalamic-pituitary-adrenocortical axis, and child psychopathology. J. Child Psychol. Psychiatry 59 28714126 10.1111/jcpp.12784 PMC5771995 29. Sockol LE Epperson CN Barber JP The relationship between maternal attitudes and symptoms of depression and anxiety among pregnant and postpartum first-time mothers Arch. Womens Ment. Health 2014 17 3 199 212 10.1007/s00737-014-0424-9 24643422 PMC4104589 Sockol, L. E., Epperson, C. N. & Barber, J. P. The relationship between maternal attitudes and symptoms of depression and anxiety among pregnant and postpartum first-time mothers. Arch. Womens Ment. Health 17 24643422 10.1007/s00737-014-0424-9 PMC4104589 30. Choi KW Houts R Arseneault L Pariante C Sikkema KJ Moffitt TE Maternal depression in the intergenerational transmission of childhood maltreatment and its sequelae: Testing postpartum effects in a longitudinal birth cohort Dev. Psychopathol. 2019 31 1 143 156 10.1017/S0954579418000032 29562945 PMC6033315 Choi, K. W. et al. Maternal depression in the intergenerational transmission of childhood maltreatment and its sequelae: Testing postpartum effects in a longitudinal birth cohort. Dev. Psychopathol. 31 29562945 10.1017/S0954579418000032 PMC6033315 31. Vieira ES Caldeira NT Eugenio DS Lucca MMD Silva IA Breastfeeding self-efficacy and postpartum depression: A cohort study Rev. Lat. Am. Enfermagem. 2018 26 e3035 10.1590/1518-8345.2110.3035 30208158 PMC6136553 Vieira, E. S., Caldeira, N. T., Eugenio, D. S., Lucca, M. M. D. & Silva, I. A. Breastfeeding self-efficacy and postpartum depression: A cohort study. Rev. Lat. Am. Enfermagem. 26 30208158 10.1590/1518-8345.2110.3035 PMC6136553 32. van der Bijl JJ Shortridge-Baggett LM The theory and measurement of the self-efficacy construct Sch. Inq. Nurs. Pract. 2001 15 3 189 207 10.1891/0889-7182.15.3.189 11871579 van der Bijl, J. J. & Shortridge-Baggett, L. M. The theory and measurement of the self-efficacy construct. Sch. Inq. Nurs. Pract. 15 11871579 33. Fathi F Mohammad-Alizadeh-Charandabi S Mirghafourvand M Maternal self-efficacy, postpartum depression, and their relationship with functional status in Iranian mothers Women Health 2018 58 2 188 203 10.1080/03630242.2017.1292340 28277156 Fathi, F., Mohammad-Alizadeh-Charandabi, S. & Mirghafourvand, M. Maternal self-efficacy, postpartum depression, and their relationship with functional status in Iranian mothers. Women Health 58 28277156 10.1080/03630242.2017.1292340 34. Walter KH Horsey KJ Palmieri PA Hobfoll SE The role of protective self-cognitions in the relationship between childhood trauma and later resource loss J. Trauma Stress 2010 23 2 264 273 10.1002/jts.20504 20419735 PMC2860613 Walter, K. H., Horsey, K. J., Palmieri, P. A. & Hobfoll, S. E. The role of protective self-cognitions in the relationship between childhood trauma and later resource loss. J. Trauma Stress 23 20419735 10.1002/jts.20504 PMC2860613 35. Brenner I Ginzburg K Golan A Igawa MS Lurie I Reicher Y Talmon A Tomashev R Padoa A Peripartum dissociation, sense of control, postpartum posttraumatic stress disorder and emotional adjustment to motherhood in adult survivors of childhood maltreatment Arch. Womens Ment. Health 2024 27 1 127 136 10.1007/s00737-023-01379-0 37851078 Brenner, I. et al. Peripartum dissociation, sense of control, postpartum posttraumatic stress disorder and emotional adjustment to motherhood in adult survivors of childhood maltreatment. Arch. Womens Ment. Health 27 37851078 10.1007/s00737-023-01379-0 36. Barboza GE Schiamberg L Dual trajectories of parenting self-efficacy and depressive symptoms in new, postpartum mothers and socioemotional adjustment in early childhood: A growth mixture model Infant Ment. Health J. 2021 42 5 636 654 10.1002/imhj.21937 34378809 Barboza, G. E. & Schiamberg, L. Dual trajectories of parenting self-efficacy and depressive symptoms in new, postpartum mothers and socioemotional adjustment in early childhood: A growth mixture model. Infant Ment. Health J. 42 34378809 10.1002/imhj.21937 37. Stanton SC Campbell L Perceived social support moderates the link between attachment anxiety and health outcomes PLoS ONE 2014 9 4 e95358 10.1371/journal.pone.0095358 24736729 PMC3988242 Stanton, S. C. & Campbell, L. Perceived social support moderates the link between attachment anxiety and health outcomes. PLoS ONE 9 24736729 10.1371/journal.pone.0095358 PMC3988242 38. Shi P Ren H Li H Dai Q Maternal depression and suicide at immediate prenatal and early postpartum periods and psychosocial risk factors Psychiatry Res. 2018 261 298 306 10.1016/j.psychres.2017.12.085 29331710 Shi, P., Ren, H., Li, H. & Dai, Q. Maternal depression and suicide at immediate prenatal and early postpartum periods and psychosocial risk factors. Psychiatry Res. 261 29331710 10.1016/j.psychres.2017.12.085 39. Fuchshuber J Hiebler-Ragger M Kresse A Kapfhammer HP Unterrainer HF The influence of attachment styles and personality organization on emotional functioning after childhood trauma Front. Psychiatry 2019 10 643 10.3389/fpsyt.2019.00643 31543844 PMC6739441 Fuchshuber, J., Hiebler-Ragger, M., Kresse, A., Kapfhammer, H. P. & Unterrainer, H. F. The influence of attachment styles and personality organization on emotional functioning after childhood trauma. Front. Psychiatry 10 31543844 10.3389/fpsyt.2019.00643 PMC6739441 40. Hepp J Schmitz SE Urbild J Zauner K Niedtfeld I Childhood maltreatment is associated with distrust and negatively biased emotion processing Borderline Pers. Disord. Emot. Dysregul. 2021 8 1 5 10.1186/s40479-020-00143-5 PMC7856450 33536068 Hepp, J., Schmitz, S. E., Urbild, J., Zauner, K. & Niedtfeld, I. Childhood maltreatment is associated with distrust and negatively biased emotion processing. Borderline Pers. Disord. Emot. Dysregul. 8 10.1186/s40479-020-00143-5 PMC7856450 33536068 41. Karakurt G Silver KE Therapy for childhood sexual abuse survivors using attachment and family systems theory orientations Am. J. Fam. Ther. 2014 42 1 79 91 10.1080/01926187.2013.772872 24443623 PMC3891673 Karakurt, G. & Silver, K. E. Therapy for childhood sexual abuse survivors using attachment and family systems theory orientations. Am. J. Fam. Ther. 42 24443623 10.1080/01926187.2013.772872 PMC3891673 42. WHO Recommendations on Postnatal Care of the Mother and Newborn 24624481 43. Wang X Zhang L Lin X Nian S Wang X Lu Y Prevalence and risk factors of postpartum depressive symptoms at 42 days among 2462 women in China J. Affect Disord. 2024 350 706 712 10.1016/j.jad.2024.01.135 38244787 Wang, X. et al. Prevalence and risk factors of postpartum depressive symptoms at 42 days among 2462 women in China. J. Affect Disord. 350 38244787 10.1016/j.jad.2024.01.135 44. Nisar A Yin J Waqas A Bai X Wang D Rahman A Li X Prevalence of perinatal depression and its determinants in mainland China: A systematic review and meta-analysis J. Affect Disord. 2020 277 1022 1037 10.1016/j.jad.2020.07.046 33065811 Nisar, A. et al. Prevalence of perinatal depression and its determinants in mainland China: A systematic review and meta-analysis. J. Affect Disord. 277 33065811 10.1016/j.jad.2020.07.046 45. Loewy RL Pearson R Vinogradov S Bearden CE Cannon TD Psychosis risk screening with the prodromal questionnaire–brief version (PQ-B) Schizophr. Res. 2011 129 1 42 46 10.1016/j.schres.2011.03.029 21511440 PMC3113633 Loewy, R. L., Pearson, R., Vinogradov, S., Bearden, C. E. & Cannon, T. D. Psychosis risk screening with the prodromal questionnaire–brief version (PQ-B). Schizophr. Res. 129 21511440 10.1016/j.schres.2011.03.029 PMC3113633 46. Li Y Long Z Cao D Cao F Maternal history of child maltreatment and maternal depression risk in the perinatal period: A longitudinal study Child Abuse Negl. 2017 63 192 201 10.1016/j.chiabu.2016.12.001 27940036 Li, Y., Long, Z., Cao, D. & Cao, F. Maternal history of child maltreatment and maternal depression risk in the perinatal period: A longitudinal study. Child Abuse Negl. 63 27940036 10.1016/j.chiabu.2016.12.001 47. Cox JL Holden JM Sagovsky R Detection of postnatal depression. Development of the 10-item Edinburgh postnatal depression scale Br. J. Psychiatry. 1987 150 782 786 10.1192/bjp.150.6.782 3651732 Cox, J. L., Holden, J. M. & Sagovsky, R. Detection of postnatal depression. Development of the 10-item Edinburgh postnatal depression scale. Br. J. Psychiatry. 150 3651732 10.1192/bjp.150.6.782 48. Wang Y Guo X Lau Y Chan KS Yin L Chen J Psychometric evaluation of the mainland Chinese version of the Edinburgh postnatal depression scale Int. J. Nurs. Stud. 2009 46 6 813 823 10.1016/j.ijnurstu.2009.01.010 19217107 Wang, Y. et al. Psychometric evaluation of the mainland Chinese version of the Edinburgh postnatal depression scale. Int. J. Nurs. Stud. 46 19217107 10.1016/j.ijnurstu.2009.01.010 49. Levis B Negeri Z Sun Y Benedetti A Thombs BD Group DESDE: Accuracy of the Edinburgh postnatal depression scale (EPDS) for screening to detect major depression among pregnant and postpartum women: systematic review and meta-analysis of individual participant data BMJ Clin. Res. Ed. 2020 371 m4022 10.1136/bmj.m4022 PMC7656313 33177069 Levis, B., Negeri, Z., Sun, Y., Benedetti, A. & Thombs, B. D. Group DESDE: Accuracy of the Edinburgh postnatal depression scale (EPDS) for screening to detect major depression among pregnant and postpartum women: systematic review and meta-analysis of individual participant data. BMJ Clin. Res. Ed. 371 10.1136/bmj.m4022 PMC7656313 33177069 50. Lau Y Wang Y Yin L Chan KS Guo X Validation of the mainland Chinese version of the Edinburgh postnatal depression scale in Chengdu mothers Int. J. Nurs. Stud. 2010 47 9 1139 1151 10.1016/j.ijnurstu.2010.02.005 20219196 Lau, Y., Wang, Y., Yin, L., Chan, K. S. & Guo, X. Validation of the mainland Chinese version of the Edinburgh postnatal depression scale in Chengdu mothers. Int. J. Nurs. Stud. 47 20219196 10.1016/j.ijnurstu.2010.02.005 51. Schwarzer R Renner B Social-cognitive predictors of health behavior: Action self-efficacy and coping self-efficacy Health Psychol. 2000 19 5 487 495 10.1037/0278-6133.19.5.487 11007157 Schwarzer, R. & Renner, B. Social-cognitive predictors of health behavior: Action self-efficacy and coping self-efficacy. Health Psychol. 19 11007157 52. Cheung SK Sun SY Assessment of optimistic self-beliefs: Further validation of the Chinese version of the general self-efficacy scale Psychol. Rep. 1999 85 3 Pt 2 1221 1224 10.2466/pr0.1999.85.3f.1221 10710976 Cheung, S. K. & Sun, S. Y. Assessment of optimistic self-beliefs: Further validation of the Chinese version of the general self-efficacy scale. Psychol. Rep. 85 10710976 10.2466/pr0.1999.85.3f.1221 53. Fowers BJ Olson DH Enrich marital inventory: A discriminant validity and cross-validation assessment J. Marital Fam. Ther. 1989 15 1 65 79 10.1111/j.1752-0606.1989.tb00777.x 21118433 Fowers, B. J. & Olson, D. H. Enrich marital inventory: A discriminant validity and cross-validation assessment. J. Marital Fam. Ther. 15 21118433 10.1111/j.1752-0606.1989.tb00777.x 54. Wang Y Gu J Zhang F Xu X The effect of perceived social support on postpartum stress: The mediating roles of marital satisfaction and maternal postnatal attachment BMC Womens Health 2023 23 1 482 10.1186/s12905-023-02593-9 37697292 PMC10496285 Wang, Y., Gu, J., Zhang, F. & Xu, X. The effect of perceived social support on postpartum stress: The mediating roles of marital satisfaction and maternal postnatal attachment. BMC Womens Health 23 37697292 10.1186/s12905-023-02593-9 PMC10496285 55. Podsakoff PM MacKenzie SB Lee JY Podsakoff NP Common method biases in behavioral research: A critical review of the literature and recommended remedies J. Appl. Psychol. 2003 88 5 879 903 10.1037/0021-9010.88.5.879 14516251 Podsakoff, P. M., MacKenzie, S. B., Lee, J. Y. & Podsakoff, N. P. Common method biases in behavioral research: A critical review of the literature and recommended remedies. J. Appl. Psychol. 88 14516251 10.1037/0021-9010.88.5.879 56. Kim JH Multicollinearity and misleading statistical results Korean J. Anesthesiol. 2019 72 6 558 569 10.4097/kja.19087 31304696 PMC6900425 Kim, J. H. Multicollinearity and misleading statistical results. Korean J. Anesthesiol. 72 31304696 10.4097/kja.19087 PMC6900425 57. Preacher KJ Advances in mediation analysis: A survey and synthesis of new developments Annu. Rev. Psychol. 2015 66 825 852 10.1146/annurev-psych-010814-015258 25148853 Preacher, K. J. Advances in mediation analysis: A survey and synthesis of new developments. Annu. Rev. Psychol. 66 25148853 10.1146/annurev-psych-010814-015258 58. de Mendez ZM Echevarria JU Action of acid etching on the enamel of deciduous teeth Av. Odontoestomatol. 1985 1 6 10 3902042 de Mendez, Z. M. & Echevarria, J. U. Action of acid etching on the enamel of deciduous teeth. Av. Odontoestomatol. 1 3902042 59. Pezley L Cares K Duffecy J Koenig MD Maki P Odoms-Young A Clark Withington MH Lima Oliveira M Loiacono B Prough J Efficacy of behavioral interventions to improve maternal mental health and breastfeeding outcomes: A systematic review Int. Breastfeed. J. 2022 17 1 67 10.1186/s13006-022-00501-9 36064573 PMC9446548 Pezley, L. et al. Efficacy of behavioral interventions to improve maternal mental health and breastfeeding outcomes: A systematic review. Int. Breastfeed. J. 17 36064573 10.1186/s13006-022-00501-9 PMC9446548 60. Law KH Dimmock J Guelfi KJ Nguyen T Gucciardi D Jackson B Stress, depressive symptoms, and maternal self-efficacy in first-time mothers: Modelling and predicting change across the first six months of motherhood Appl. Psychol. Health Well Being 2019 11 1 126 147 10.1111/aphw.12147 30345730 Law, K. H. et al. Stress, depressive symptoms, and maternal self-efficacy in first-time mothers: Modelling and predicting change across the first six months of motherhood. Appl. Psychol. Health Well Being 11 30345730 10.1111/aphw.12147 61. Hajure M Alemu SS Abdu Z Tesfaye GM Workneh YA Dule A Adem Hussen M Wedajo LF Gezimu W Resilience and mental health among perinatal women: A systematic review Front. Psychiatry 2024 15 1373083 10.3389/fpsyt.2024.1373083 39104881 PMC11298415 Hajure, M. et al. Resilience and mental health among perinatal women: A systematic review. Front. Psychiatry 15 39104881 10.3389/fpsyt.2024.1373083 PMC11298415 62. Cohrdes C Mauz E Self-efficacy and emotional stability buffer negative effects of adverse childhood experiences on young adult health-related quality of life J. Adolesc. Health 2020 67 1 93 100 10.1016/j.jadohealth.2020.01.005 32192828 Cohrdes, C. & Mauz, E. Self-efficacy and emotional stability buffer negative effects of adverse childhood experiences on young adult health-related quality of life. J. Adolesc. Health 67 32192828 10.1016/j.jadohealth.2020.01.005 63. Brazeau N Reisz S Jacobvitz D George C Understanding the connection between attachment trauma and maternal self-efficacy in depressed mothers Infant Ment. Health J. 2018 39 1 30 43 10.1002/imhj.21692 29281747 PMC5814850 Brazeau, N., Reisz, S., Jacobvitz, D. & George, C. Understanding the connection between attachment trauma and maternal self-efficacy in depressed mothers. Infant Ment. Health J. 39 29281747 10.1002/imhj.21692 PMC5814850 64. Chau V Dryer R Brunton R Examining the relationship between maternal childhood abuse history and mother-infant bonding: The mediating roles of postpartum depression and maternal self-efficacy Child Abuse Negl. 2023 145 106439 10.1016/j.chiabu.2023.106439 37683403 Chau, V., Dryer, R. & Brunton, R. Examining the relationship between maternal childhood abuse history and mother-infant bonding: The mediating roles of postpartum depression and maternal self-efficacy. Child Abuse Negl. 145 37683403 10.1016/j.chiabu.2023.106439 65. Tolossa T Fetensa G Yilma MT Abadiga M Wakuma B Besho M Fekadu G Etafa W Postpartum depression and associated factors among postpartum women in Ethiopia: A systematic review and meta-analysis, 2020 Public Health Rev. 2020 41 21 10.1186/s40985-020-00136-3 32974057 PMC7493842 Tolossa, T. et al. Postpartum depression and associated factors among postpartum women in Ethiopia: A systematic review and meta-analysis, 2020. Public Health Rev. 41 32974057 10.1186/s40985-020-00136-3 PMC7493842 66. Akincigil A Munch S Niemczyk KC Predictors of maternal depression in the first year postpartum: Marital status and mediating role of relationship quality Soc. Work Health Care 2010 49 3 227 244 10.1080/00981380903213055 20229395 Akincigil, A., Munch, S. & Niemczyk, K. C. Predictors of maternal depression in the first year postpartum: Marital status and mediating role of relationship quality. Soc. Work Health Care 49 20229395 10.1080/00981380903213055 67. Kaufman-Parks AM Longmore MA Manning WD Giordano PC Understanding the effect of adverse childhood experiences on the risk of engaging in physical violence toward an intimate partner: The influence of relationship, social psychological, and sociodemographic contextual risk factors Child Abuse Negl. 2023 144 106381 10.1016/j.chiabu.2023.106381 37542994 PMC10528963 Kaufman-Parks, A. M., Longmore, M. A., Manning, W. D. & Giordano, P. C. Understanding the effect of adverse childhood experiences on the risk of engaging in physical violence toward an intimate partner: The influence of relationship, social psychological, and sociodemographic contextual risk factors. Child Abuse Negl. 144 37542994 10.1016/j.chiabu.2023.106381 PMC10528963 68. Cohen LJ Ardalan F Tanis T Halmi W Galynker I Von Wyl A Hengartner MP Attachment anxiety and avoidance as mediators of the association between childhood maltreatment and adult personality dysfunction Attach. Hum. Dev. 2017 19 1 58 75 10.1080/14616734.2016.1253639 27842464 Cohen, L. J. et al. Attachment anxiety and avoidance as mediators of the association between childhood maltreatment and adult personality dysfunction. Attach. Hum. Dev. 19 27842464 10.1080/14616734.2016.1253639 69. Wrobel AL Russell SE Jayasinghe A Lotfaliany M Turner A Dean OM Cotton SM Diaz-Byrd C Yocum AK Duval ER Attachment insecurity partially mediates the relationship between childhood trauma and depression severity in bipolar disorder Acta Psychiatr. Scand. 2022 145 6 591 603 10.1111/acps.13419 35243610 PMC9314952 Wrobel, A. L. et al. Attachment insecurity partially mediates the relationship between childhood trauma and depression severity in bipolar disorder. Acta Psychiatr. Scand. 145 35243610 10.1111/acps.13419 PMC9314952 70. Ponizovsky AM Drannikov A Contribution of attachment insecurity to health-related quality of life in depressed patients World J. Psychiatry 2013 3 2 41 49 10.5498/wjp.v3.i2.41 24175185 PMC3782183 Ponizovsky, A. M. & Drannikov, A. Contribution of attachment insecurity to health-related quality of life in depressed patients. World J. Psychiatry 3 24175185 10.5498/wjp.v3.i2.41 PMC3782183 71. Stagaki M Nolte T Feigenbaum J King-Casas B Lohrenz T Fonagy P Personality, mood disorder research C, montague PR: The mediating role of attachment and mentalising in the relationship between childhood maltreatment, self-harm and suicidality Child Abuse Negl. 2022 128 105576 10.1016/j.chiabu.2022.105576 35313127 PMC10466023 Stagaki, M. et al. Personality, mood disorder research C, montague PR: The mediating role of attachment and mentalising in the relationship between childhood maltreatment, self-harm and suicidality. Child Abuse Negl. 128 35313127 10.1016/j.chiabu.2022.105576 PMC10466023 72. Santos HP Jr Kossakowski JJ Schwartz TA Beeber L Fried EI Longitudinal network structure of depression symptoms and self-efficacy in low-income mothers PLoS ONE 2018 13 1 e0191675 10.1371/journal.pone.0191675 29360876 PMC5779701 Santos, H. P. Jr., Kossakowski, J. J., Schwartz, T. A., Beeber, L. & Fried, E. I. Longitudinal network structure of depression symptoms and self-efficacy in low-income mothers. PLoS ONE 13 29360876 10.1371/journal.pone.0191675 PMC5779701 73. Zheng X Morrell J Watts K Changes in maternal self-efficacy, postnatal depression symptoms and social support among Chinese primiparous women during the initial postpartum period: A longitudinal study Midwifery 2018 62 151 160 10.1016/j.midw.2018.04.005 29684794 Zheng, X., Morrell, J. & Watts, K. Changes in maternal self-efficacy, postnatal depression symptoms and social support among Chinese primiparous women during the initial postpartum period: A longitudinal study. Midwifery 62 29684794 10.1016/j.midw.2018.04.005 74. Zortea TC Dickson A Gray CM O’Connor RC Associations between experiences of disrupted attachments and suicidal thoughts and behaviours: An interpretative phenomenological analysis Soc. Sci. Med. 2019 235 112408 10.1016/j.socscimed.2019.112408 31323541 Zortea, T. C., Dickson, A., Gray, C. M. & O’Connor, R. C. Associations between experiences of disrupted attachments and suicidal thoughts and behaviours: An interpretative phenomenological analysis. Soc. Sci. Med. 235 31323541 10.1016/j.socscimed.2019.112408 ",
  "metadata": {
    "Title of this paper": "Associations between experiences of disrupted attachments and suicidal thoughts and behaviours: An interpretative phenomenological analysis",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12480838/"
  }
}