{
  "title": "Paper_1060",
  "abstract": "pmc Micromachines (Basel) Micromachines (Basel) 3513 micromac micromachines Micromachines 2072-666X Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471413 PMC12471413.1 12471413 12471413 41011918 10.3390/mi16091028 micromachines-16-01028 1 Review Advancements in Wearable Antenna Design: A Comprehensive Review of Materials, Fabrication Techniques, and Future Trends in Wireless Communication https://orcid.org/0009-0003-2624-1777 Cao Zhikai https://orcid.org/0000-0001-7192-9771 Lu Mai * Zhao Xiaoguang Academic Editor Key Laboratory of Opto-Electronic Technology and Intelligent Control of Ministry of Education, Lanzhou Jiaotong University, Lanzhou 730070, China; czk19988@163.com * mai.lu@hotmail.com 08 9 2025 9 2025 16 9 496720 1028 25 7 2025 02 9 2025 05 9 2025 08 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ With the continuous development of wireless communication technology, the demand for wearable communication devices has rapidly increased. The antenna is one of the key components in communication devices, directly affecting the performance of wearable communication devices. As a result, wearable antenna design has become a research hotspot in recent years. Wearable antennas are widely used in various fields of daily life, including healthcare, sports and entertainment, the internet of things (IoT), and military positioning. In the last decade, related researchers have studied wearable antennas from various perspectives, and this paper summarizes the design and fabrication of wearable antennas more comprehensively and systematically. This review covers material selection, manufacturing techniques, miniaturization technologies, and performance metrics, while addressing key design considerations. It also highlights recent research, applications in critical fields, and future development trends, offering valuable insights for the design and study of wearable antennas. wearable antenna material selection miniaturization technology application National Nature Science Foundation of China 52467026 51867014 Department of Education of Gansu Province 2024CXPT-11 This work is supported in part by the National Nature Science Foundation of China (No.52467026, No.51867014) and by the Department of Education of Gansu Province (Grant Number 2024CXPT-11). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Since the fourth- and fifth-generation wireless communication technologies have entered the field of wearable devices, the applications of wearable devices have been greatly expanded. Fourth generation (4G) technology, with its high-speed data transmission capability, supports the applications of wearable devices in health detection [ 1 2 3 4 According to Grand View Research’s “Wearable Technology Market Share & Trends Report, 2030”, the global wearable devices market reached approximately $45 billion in 2023, with smartwatches and fitness trackers dominating market share. The industry is projected to grow at a CAGR of 18.1%, reaching $150 billion by 2030. Rising income levels and declining prices are driving market expansion in the Asia–Pacific region, particularly China, India, and Japan. Similarly, the “China Smart Wearables Industry Market Competitive Landscape and Investment Outlook Report 2024–2030” by Huajing Industry Research Institute indicates that China’s consumer-grade smart wearables market grew from RMB 21.26 billion to RMB 93.47 billion over the past five years, with a CAGR exceeding 20%. The report forecasts continued growth, with a CAGR above 10% over the next five years. Wearable devices include devices that are worn directly on the body as well as devices that can be integrated into clothing and accessories [ 5 Wearable antennas are widely used in frequency bands, such as industrial, scientific, medical (ISM) (2.4 GHz–2.4835 GHz, 5.725 GHz–5.875 GHz) [ 6 7 8 2. The Evolution of Wearable Antenna Technology The earliest wearable devices can be traced back to the 1960s and 1970s. In the 1960s, the U.S. military developed an early gait monitor to track the activities of soldiers. This device, despite its simplicity, marked the beginning of wearable technology, especially in the areas of motion and biomonitoring. In the 1980s, with the development of computers, computer scientists and electronic engineers began to develop more advanced wearable computers. By the 1990s, wearable technology had initially developed and started transitioning to practical applications. Steve Mann introduced a head-mounted wearable computing device that could superimpose computer-generated images onto the user’s field of view, making it one of the earliest applications of augmented reality technology. With the continuous development of wearable technology, more and more wearable devices have been developed, such as Polar’s heart rate monitor, which enables athletes to monitor their heart rate in real time, and Seiko’s smartwatch, which integrates data storage and management functions to store information, such as addresses, schedules, and notes. This watch represents one of the earliest forms of smartwatches; in 2013, Google launched Google Glass, the first smart glasses to become widely known to the public. Along with the development of wearable devices, the study of wearable antennas integrated in the devices has become more and more intensive. In 1999, P. Salonen et al. proposed a planar inverted-F antenna for wearable devices in their paper, which generates resonance in a dual band by etching a U-shaped slot [ 9 10 11 12 13 The Federal Communications Commission (FCC) formally authorized the implementation of ultra-wideband (UWB) technology in civilian communications through the publication of ET Docket 98–153 in 2002. This authorization stipulated that the primary civilian frequency band for UWB is 3.1–10.6 GHz, with a bandwidth of ≥500 MHz or ≥20% relative bandwidth, and a transmission power not exceeding −41.3 dBm/MHz EIRP. This definition and standard have remained pivotal references for global UWB technology to the present day. Between 2004 and 2006, researchers gradually explored the application of UWB technology in wearable antennas. In the following years, research on UWB antenna design, human signal propagation characteristics, health monitoring, and localization systems was further developed. A UWB antenna brings high bandwidth, low power consumption, and short pulse transmission capability, which is widely used in radar detection, health sensors, and precise localization systems. Considering the miniaturization of wearable antennas, a low-profile wearable electromagnetic bandgap antenna was designed in 2004, which was the first time that an electromagnetic bandgap structure was applied to wearable antennas [ 14 15 The rapid development of flexible materials and electronics in 2010 has prompted researchers to utilize flexible materials, such as metallic nanowires, conductive fibers, and carbon-based materials (e.g., graphene), to engineer antennas that are suitable for wearable applications. These antennas have the capacity to be embedded in clothing and accessories, as well as to be applied to the skin with a certain degree of flexibility and comfort. In addition to their fundamental communication functionality, a growing number of wearable devices are being equipped with an array of features, including heart rate monitoring, GPS positioning, and temperature sensing. This trend underscores the necessity for antennas to be designed with greater diversity to accommodate these multifaceted applications. The advent of material science has paved the way for the development of ultra-thin and transparent antennas. This development is particularly evident in wearable devices, such as smart clothing, smart glasses, and smart bracelets, where transparent antennas can be seamlessly integrated into the device design with minimal or no impact on the device’s appearance [ 16 Since 2020, with the gradual commercialization of 5G technology, antenna design in the 5G communication band has increasingly become a central focus in the research and development of wearable devices. Additionally, it is imperative to consider the influence of the human body on wireless signals. The enhanced specifications for wearable antennas, encompassing parameters such as frequency response, gain, and radiation efficiency, have prompted the ongoing optimization in their design. 3. The Design and Processing Technology of Wearable Antennas 3.1. Materials Utilized in the Fabrication of Wearable Antennas In contrast to conventional antenna design, which prioritizes performance and mechanical strength, wearable antenna design places greater emphasis on flexibility and wearability. Additionally, textile materials are being employed with increasing frequency in antenna design and fabrication due to their exceptional bendability, reduced weight, and lower dielectric constant. The performance of wearable antennas is influenced by two primary factors: the conductive materials (radiating elements) and the non-conductive materials (substrate materials). The selection of conductive materials depends on their electrical conductivity, while non-conductive materials are chosen based on dielectric properties, flexibility, comfort, and compatibility with the human body. Therefore, wearable antenna designs aim to balance antenna performance with human wearability. The goal is to create a high-gain, high-efficiency, safe, and comfortable antenna. 3.1.1. Conductive Materials The materials used in the radiating elements of antennas can be broadly classified into three groups. The first category is metal-based materials such as copper [ 17 18 19 20 21 22 23 24 25 As shown in Figure 1 26 27 Figure 2 28 Table 1 3.1.2. Substrate Materials Conventional antennas are fabricated using printed circuit board (PCB) technology with rigid FR4 substrates [ 29 30 31 32 The resulting antennas are challenging to integrate into clothing. When stretched or bent by external forces, the antennas may deform or even break, thereby impairing their performance. The advent of flexible materials has provided a solution to this issue. Flexible material substrates demonstrate favorable flexibility, sufficient gain, and stable radiation patterns in bending tests, and flexible substrates are generally lighter than rigid substrates, which helps reduce the overall weight of the device, especially for devices that need to be worn for long periods of time. However, the low dielectric constant and dielectric loss of flexible materials necessitate the use of larger dimensions to ensure the efficiency of the antenna under human wear. Examples of such materials include denim [ 33 34 35 36 37 38 39 40 41 42 43 44 45 25 46 As illustrated in Figure 3 47 Figure 3 48 Figure 3 49 Figure 3 2 2 50 In conclusion, the advantageous flexibility, lightweight quality, and compatibility of flexible substrates have led to the gradual replacement of traditional rigid substrates in wearable antenna designs. In order to optimize the performance and efficiency of wearable antennas in the design process, low-loss dielectrics are typically selected as the antenna substrate materials, while highly conductive materials are chosen for use as the antenna radiating elements. Table 2 3.2. Antenna Fabrication Techniques Several primary techniques for designing and manufacturing on thin or flexible substrates include screen printing [ 52 53 54 55 56 57 58 59 60 5 3.2.1. Screen Printing A screen with open areas is positioned on top of the substrate, through which the ink flows. During the printing process, the ink is compressed by a squeegee from the open areas of the screen onto the substrate, thereby forming the printed pattern. This method has the advantages of low cost and simplicity; however, it also has disadvantages. The prints produced have low resolution, and it is difficult to control the thickness of the conductive ink, which can result in a reduction in pattern resolution and antenna performance after multi-layer printing. Furthermore, this technique can only be used on specific substrates, and the depth of penetration of the conductive ink on the substrate must be considered, as this may impact the performance of the antenna. As illustrated in Figure 4 61 Hattan F. Abutarboush et al. employed the screen printing technique to deposit nanosilver ink on a flexible Kapton substrate. The resulting antenna exhibited a wide bandwidth of 1.77 GHz–6.95 GHz and a 119% bandwidth [ 62 63 3.2.2. Inkjet Printing Conductive inks are deposited onto the flexible substrate at the desired location via a printer nozzle and then thermally cured to ensure that it is electrically conductive. The cost of the conductive ink, the printer, and the thermal curing technology contribute to the higher expense of this process compared to other manufacturing techniques. As illustrated in Figure 5 51 Hang Yu designed a flexible coplanar waveguide antenna based on inkjet printing technology. The antenna is fabricated with polyimide substrate and silver nano-ink, the resonant frequency shift is ≤360 MHz, and the return loss is kept to within −14 dB at a lateral/longitudinal bending radius of >30 mm and a skin spacing of >1 mm, which is suitable both for anti-jamming capability and for human safety [ 64 Figure 5 65 Antennas fabricated through screen printing and inkjet printing exhibit poor washability due to the gradual degradation of the ink. To address this issue, conductive inks can be encapsulated with a thermoplastic coating for protection. 3.2.3. Sewing or Embroidery Conductive patterns are woven using traditional methods and then fixed to a substrate. Alternatively, conductive yarns can be woven onto a fabric substrate using an embroidery or sewing machine. In comparison to alternative antenna fabrication techniques, this approach enables the seamless integration of the antenna into clothing without compromising aesthetic appeal, while offering a reduced cost and a more straightforward fabrication process. The efficacy of embroidered antennas is contingent upon the tensile strength of the conductive yarn, the precision of the embroidery machine, and the density and direction of the embroidery stitches. Conversely, the conductive patterns produced by embroidery exhibit a relatively low resolution. Furthermore, the resolution of the geometric patterns is diminished when the material is subjected to bending and stretching. It has been demonstrated that the moisture and gum present in the fabric can be removed by stretching and boiling the fabric substrate prior to printing the ink. This process reduces the surface roughness of the fabric, thereby enhancing the adhesion of the ink to the fabric and improving the effective conductivity of the fabric antenna [ 66 Figure 6 67 Figure 6 68 In comparison to screen-printed antennas, embroidered antennas demonstrate a higher measurement gain. Additionally, screen-printed antennas exhibit a notable impedance mismatch, whereas embroidered antennas are more resilient when assessing the performance variation of antennas at disparate locations on the human body [ 70 Figure 6 69 3.2.4. Substrate-Integrated Waveguides (SIW) Substrate-Integrated Waveguide technology represents a cost-effective and relatively straightforward fabrication process. The structure combines the advantages of planar and non-planar guided structures by employing shorting vias in the cavity sidewalls, thereby ensuring that the electric field is confined within the cavity and supported by the entire grounding layer. The SIW technology can efficiently integrate a variety of passive components and systems onto a single substrate. The implementation of different SIW structures has the potential to facilitate miniaturization, to expand bandwidth, to enhance flexibility, and to improve gain [ 71 Figure 7 72 Figure 7 73 Figure 7 74 ® 3 Figure 7 75 3.3. Antenna Miniaturization Technology The objective of antenna miniaturization is to reduce the antenna’s size while maintaining the antenna’s resonant frequency. Alternatively, the goal is to reduce the antenna’s resonant frequency while maintaining the antenna’s size. Reducing the size of the antenna will inevitably affect its performance, including bandwidth and gain. Consequently, the current research focus on antenna miniaturization is to reduce the antenna’s size while maintaining the antenna’s other performance parameters. 3.3.1. Dielectric Substrate with High Dielectric Constant In accordance with the principles of cavity mode theory, the frequency of a rectangular microstrip antenna can be approximated by the following mathematical formula: (1) f = c 2 ε r μ r m L 2 + n W 2 The dimensions “L” and “W” represent the length and width of the rectangular microstrip antenna, respectively. The symbols “µ r r 8 76 From the formula, it can be seen that the permittivity and magnetic permeability of the dielectric substrate are inversely proportional to the frequency of the antenna. Therefore, a material with high permittivity or high permeability can be selected in order to reduce the resonant frequency of the antenna, thus achieving the miniaturization of the antenna. Nevertheless, the utilization of a high-dielectric-constant dielectric substrate will result in the generation of a robust surface wave, which will consequently induce an increase in dielectric loss. This, in turn, will lead to a reduction in the radiation efficiency of the antenna. This phenomenon can be elucidated by the following equation: (2) Q m i n ≈ 1 k α 3 + 1 k α The quality factor, Q, is approximately equal to 1 divided by the bandwidth, BW, which is approximately equal to 1/Q. The antenna wave number, k, and the antenna size, α, are also relevant factors. Equation (2) demonstrates that, as the antenna size decreases, the bandwidth also decreases [ 76 S. Sreelekshmi and S. Perumal Sankar proposed a portable circular patch antenna at 2.5 GHz using a substrate with a dielectric constant of 10.2. The overall dimensions of the antenna are 35 × 30 × 1.6 mm 3 77 78 3.3.2. Surface Grooving An increase in the current path length can be achieved by modifying the shape of the patch antenna or by creating slots on the antenna surface. This results in an equivalent increase in the effective length of the antenna. However, this approach also generates additional currents on the antenna surface, which leads to an increase in cross-polarization and a subsequent reduction in the gain and efficiency of the patch antenna. As in Figure 8 79 Figure 8 80 Figure 8 81 Figure 8 82 3.3.3. Short-Circuit Pins The introduction of shorting probes on the microstrip antenna, situated in close proximity to the feed point, resulted in the formation of a coupling capacitance, thereby facilitating the miniaturization of the antenna. In a similar approach, Farzad Khajeh-Khalili et al. employed a comparable methodology by loading the antenna with three pairs of shorting pins, thereby effectively eliminating the excess resonant frequency and generating a secondary band (2400–2480 MHz) without altering the antenna’s dimensions [ 80 2 2 83 3.4. Frequency Selective Surface (FSS) Frequency selective surfaces (FSSs) represent an important class of artificial electromagnetic structures, consisting of periodic metallic patches or apertures that act as spatial filters for electromagnetic waves. By appropriately designing the unit-cell geometry, FSSs can selectively transmit or reflect specific frequency bands, thereby enabling applications in antennas, radomes, and stealth technology. Building on the concept of FSSs, artificial magnetic conductors (AMCs) were developed as surfaces that exhibit a reflection phase close to 0°, unlike conventional metals which reflect with a 180° phase. AMC surfaces can enhance antenna performance, suppress surface waves, and reduce antenna profile, and they are often realized using periodic FSS structures. Metamaterials can be classified into two principal categories: three-dimensional metamaterials and two-dimensional hypersurfaces. Metamaterials were initially proposed in 1968 by Prof. Viktor G. Veselago in a paper that introduced the concepts of left-handed materials and double-negative materials, which are materials with negative dielectric constant and magnetic permeability [ 84 85 86 87 An electromagnetic bandgap (EBG) is a collective term for periodic structures that can propagate or suppress electromagnetic waves in specific frequency bands. Attaching an EBG structure to the backside of an antenna radiating patch can suppress the surface waves of the antenna, thus realizing the purpose of antenna miniaturization. In 1999, Dan Sievenpiper et al. proposed the classical EBG structure, which is mushroom-like in shape [ 88 In [ 89 Figure 9 Figure 9 90 Usman Ali et al. proposed a dual-frequency flexible wearable antenna, as depicted in Figure 9 91 Figure 9 92 3.5. Antenna Feeding Technology Two principal categories of microstrip antenna feeds have been distinguished, contact feed and non-contact feed. Coaxial feed and microstrip line feed are classified as contact feeds, while neighbor coupling feed and aperture coupling feed are designated as non-contact feeds. 3.5.1. Coaxial Feed Coaxial feed technology establishes a connection between the outer conductor of the coaxial probe and the ground layer, while the inner conductor penetrates the dielectric and establishes contact with the patch. The coaxial probe introduces an inductance that is dependent upon its length and is determined by the thickness of the antenna’s substrate, in addition to the radiation generated by the probe. The primary advantage of this technique is that the coaxial feed can be placed at any point within the patch to match the input impedance. However, this technique is not suitable for textile applications where comfort and flexibility are important considerations. 3.5.2. Microstrip Feeding In this feed method, microstrip lines are etched on the surface of the substrate to ensure the planar structure of the antenna, thereby eliminating the need for a coaxial probe to pass through. This reduces the difficulty of antenna fabrication and increases antenna flexibility. Impedance matching is achieved by modifying the length and width of the microstrip line, which increases the size of the antenna and the complexity of impedance matching. Deisy Formiga Mamedes et al. compared four impedance matching techniques based on microstrip line feeds. These include embedded feeds, offset feeds, quarter wavelength impedance converters, and mixed-method feeds, which provide larger bandwidths and higher broadside gains [ 93 3.5.3. Coplanar Waveguide Feed (CPW) CPW technology is based on microstrip feed technology, which is a planar structure comprising a center conductor and two adjacent ground planes. This technology offers several advantages, including low loss, wide bandwidth, and ease of integration. The impedance matching of CPW technology is achieved through modifications to the width of the microstrip line and the gap between the microstrip line and the ground plane. In Figure 10 94 Figure 10 95 3.5.4. Adjacent-Coupled Feed The adjacent-coupled feed approach involves the placement of the feed line between two dielectric substrates, with the radiating patch situated on the uppermost substrate, as illustrated in Figure 11 96 97 3.6. Bionic Design of Wearable Antennas Bionic antennas with wider bandwidth and smaller size have become an alternative to conventional antennas. From the biologically inspired butterfly-like antenna [ 98 99 100 Figure 12 101 Figure 12 102 103 Figure 12 104 4. Performance of Wearable Antennas 4.1. Specific Absorption Rate Wearable antennas must meet safety standards because they produce back radiation, which poses a health risk to humans. Internationally, the SAR is used to measure the effect of electromagnetic radiation on the human body. The specific absorption rate (SAR) of an antenna is the amount of energy absorbed by the human body per unit of mass, and is expressed in units of W/kg. It is calculated by the following formula: (3) S A R = σ E 2 ρ 3 105 106 Mahmoud A. Abdelghany et al. [ 107 0 0 0 108 In the experiment, the SAR distribution is governed by multiple coupling factors, including transmission power, the distance and relative position between the antenna and the skin, operating frequency (which determines the penetration depth and energy deposition characteristics of electromagnetic waves), antenna pattern and polarization state, antenna structure and its shielding design, scattering effects from clothing or nearby metallic objects, and the geometric shape and tissue layering of the test subject (e.g., skin, fat, muscle, etc., which have different dielectric parameters). In numerical simulations and experimental measurements, the peak SAR is highly sensitive to spatial average mass (commonly 1 g or 10 g) and grid/voxel resolution. Common engineering measures to suppress the local SAR include reducing the transmission power, increasing the distance between the antenna and the skin, using directional or grounded antenna designs to direct energy away from the human body, and dispersing energy through antenna layout and system-level optimization to avoid local energy concentration. 4.2. Bendability Wearable antennas are designed to be integrated with clothing and must be able to conform to the natural curvature of the human body. This includes the arms, legs, face, and chest, as well as the human body in motion. The antenna’s ability to maintain its shape while adapting to these variations is crucial for its functionality. Therefore, understanding the antenna’s curvature performance is a vital aspect of its development. As illustrated in Figure 13 109 Figure 13 x y 110 Deepti Sharma et al. proposed a multi-band wearable textile antenna that employs a stepped square monopole antenna structure with an asymmetrical curved slot at the top and a partially slotted ground plane at the bottom. The antenna has impedance bandwidths of 310 MHz, 960 MHz, and 1140 MHz at 1.8 GHz, 2.45 GHz, and 5.8 GHz, respectively, with gains of 3.7 dBi, 5.3 dBi, and 9.6 dBi, respectively. Studies indicated that even under different bending radii (e.g., 25 mm, 35 mm, and 45 mm), the antenna’s reflection coefficient and frequency response exhibit minimal variation, demonstrating its excellent flexibility and adaptability [ 111 112 2 Table 3 5. Applications of Wearable Antennas The applications of wearable antennas encompass a broad spectrum of wireless communication and sensing needs, spanning a range of frequencies from low to high, contingent upon the specific frequency band. Each frequency band exhibits distinct requirements for antenna design, performance, and application scenarios. Within the low-frequency band (30 Hz–3 MHz), wearable antennas find application in the wireless transmission of medical devices, particularly those used for the monitoring of electrophysiological signals, such as electrocardiograms (ECGs) and electroencephalograms (EEGs). The penetration capability of low-frequency signals, which is attributed to their high frequency, enables effective transmission through the human body. In the UHF band (300 MHz–3 GHz), wearable antennas facilitate wireless communication between wearable devices, including heart rate monitors, blood glucose monitors, health bracelets, and smart clothing. In higher microwave bands (3 GHz–30 GHz) and millimeter-wave bands (30 GHz–300 GHz), the focus has shifted to real-time transmission of large data sets, such as high-definition video, and real-time monitoring and control of internet of things (IoT) devices. The subsequent discussion will primarily address the applications of wearable antennas in the microwave band. 5.1. Cancer Detection Wearable antennas can be used to monitor patient’s vital signs, including body data such as heartbeat, temperature and blood pressure, and can also be used for the detection of some diseases [ 113 114 115 116 117 118 Komalpreet Kaur and Amanpreet Kaur proposed an ex vivo detection method for skin cancer based on ultra-wideband stacked microstrip patch antennas. The proposed antenna structure is compact and has a peak gain of 6.3 dB at a frequency of 10.8 GHz [ 119 120 Figure 14 121 122 Figure 14 The technique of imaging by microwave was initially employed for the detection of breast cancer. Despite the complexity of the dielectric properties of human tissues and the dearth of pertinent in vivo measurement data, researchers have devised a range of clinical or simulation experiments to conduct the requisite measurements [ 123 124 As illustrated in Figure 15 125 Md Samsuzzaman et al. presented a circular slotted defect grounded monopole patch antenna for microwave head imaging to detect brain tumors, as shown in Figure 16 126 5.2. Vital Signs Monitoring In the field of sports, wearable antennas have the potential to be utilized for the non-invasive monitoring of an athlete’s health status and athletic performance. As illustrated in Figure 17 127 128 129 In a separate study, a patch antenna incorporating a silver mode was employed to quantify oxygen concentration. The resonant frequency of the antenna exhibited a corresponding change in accordance with the oxygen concentration. The designed antenna has the potential for integration into healthcare systems [ 130 As illustrated in Figure 18 131 The advancement of antenna technology has also led to the development of microwave-based solutions for the detection of potential bone-related issues. In response to the rising prevalence of osteoporosis, Dr. Kiran Rathod et al. proposed a hexagonal loop wearable antenna. The antenna employs polyester conductive e-textile as the radiating fabric and polyester fabric as the substrate, operating within the frequency range of 1.5 GHz–4.5 GHz. Its efficacy for bone detection was validated through experimental verification [ 132 Sumon Modak et al. [ 133 134 135 5.3. Other Applications Wearable antennas have the potential to be utilized in military settings for the purpose of personnel localization. Additionally, they could prove invaluable in emergency situations, such as disasters or accidents, for the localization of injured personnel and the facilitation of emergency rescue operations. Rishabh Kumar Baudh et al. designed a circularly polarized fabric antenna for defense applications, which is loaded with a hypersurface structure to achieve a wide bandwidth of 37.5% (7.73 GHz–11.3 GHz), a high gain of 8.9 dBic, and an axial-ratio bandwidth of 3 dB of 21.3% (8.8 GHz–10.9 GHz) [ 136 137 138 Table 4 6. Perspectives of Wearable Antennas As communication technology continues to advance, so too do the demands placed on wearable antennas [ 139 In the field of healthcare, implantable antennas offer a promising advancement in wearable healthcare technology. However, their design faces challenges due to the complex dielectric properties of human tissues, making a theoretical analysis of radiation characteristics difficult. Most studies rely on simplified human body models, limiting accuracy. Despite these challenges, implantable antennas hold great potential for long-term health monitoring and early disease detection. In terms of frequency band, the 6G terahertz band is situated between the microwave and far-infrared spectra. It produces non-ionizing radiation that causes minimal or no harm to the human organism. Additionally, the long terahertz wavelengths can penetrate certain non-metallic materials, making terahertz antennas suitable for medical imaging, high-speed communication, and other applications. At high frequencies (5G millimeter wave, 6G terahertz), the antenna has a small structure, which presents a significant challenge for fabrication using traditional PCB technology. However, additive manufacturing technology offers a promising alternative in terms of cost-effectiveness and ease of fabrication [ 140 With regard to materials, wearable antennas are required to function in close proximity to the human body over extended periods of time. This necessitates the consideration of materials suitable for use in sensitive areas, such as the eyes and the head. The selection of biocompatible materials can prevent the production of inflammation and other adverse reactions, as exemplified by silicon carbide [ 141 From the design side, the most commonly used computational electromagnetic (CEM) methods for antenna design are numerical methods and radio frequency methods. Three numerical analysis methods are commonly employed for the design and testing of antennas: the finite-difference time-domain (FDTD) method, the finite-element method (FEM), and the method of moments (MoM). The simulation of antennas necessitates the establishment of boundary conditions in computers to facilitate the resolution of partial differential equations. Commercially available software for antenna design includes high frequency structure simulators (HFSS), advanced design systems (ADS), and computational simulation techniques (CST). However, the execution time of HFSS and CST is considerable, increasing with the size of the antenna structure. Furthermore, ADS is unable to model the three-dimensional structure in detail. The advent of artificial intelligence (AI) has led to the integration of machine learning (ML) and deep learning (DL) into antenna design and optimization. Furthermore, AI techniques have the potential to reduce computational costs, to accelerate design processes, and to enhance the efficacy of antenna optimization [ 142 Aggraj Gupta et al. devised a tandem neural network architecture that enables the fabrication of single- and dual-band antennas with more compact dimensions and reduced substrate thicknesses compared to conventional antennas, while maintaining competitive performance [ 143 144 Arpan H. Shah and Piyush N. Patel designed a wearable textile antenna for use in diagnostic applications related to knee effusion and optimized the antenna’s parameters using a machine learning algorithm, resulting in improved impedance matching. The proposed DNN model predicted an optimal impedance matching of −36.21 dB, which is in close agreement with the −35.69 dB calculated by the CST simulation. The proposed ML algorithm is accurate and efficient [ 145 146 As shown in Figure 19 147 148 149 GST-HBA significantly outperforms HBA, differential evolution, JAYA and sine cosine algorithm (SCA) in convergence speed, optimization accuracy and global searching ability, and provides a new method for solving complex electromagnetic problems. Wendong Yang et al. proposed an antenna design method based on the optimized agent model and the NSGA-III algorithm, which introduces the TCN network into the antenna agent model and solves the problem of balancing the efficiency and accuracy of the traditional CNN/BiLSTM in parameter mapping, and further reduces the running time by 2.67%, improves the prediction accuracy by 12.489%, and improves the computational efficiency significantly compared with the traditional scheme. The efficiency is significantly improved [ 150 Table 5 As a fundamental element of wearable devices, the design and fabrication of antennas directly impact the performance, safety, and user experience of these devices. The advent of flexible and novel conductive materials has prompted a shift in the design of wearable antennas from rigid to lightweight, flexible, and multifunctional, enhancing both comfort and aesthetics while ensuring efficient wireless communication. Research has demonstrated that the selection of conductive and substrate materials is pivotal in determining the antennas’ conductivity, dielectric properties, and compatibility. The advent of advanced manufacturing technologies, such as inkjet printing and screen printing, has further propelled the production of high-performance flexible antennas, thereby facilitating the proliferation of wearable devices. The imminent advent of 6G communication, millimeter wave, and terahertz technology is poised to further enhance the capabilities of wearable antennas, particularly in high-frequency applications. These high-frequency band antennas boast a wide spectrum, high data transmission rate, and strong resolution, and will be widely used in ultra-high-speed wireless communication, precise medical monitoring, augmented reality, and virtual reality devices, among other fields. In the medical field, high frequency antennas can realize the high precision monitoring and real-time data transmission of human biological signals, providing technical support for remote diagnosis and treatment and health management. In the domain of consumer electronics, these antennas will facilitate the enhancement of computing and communication capabilities in smart wearable devices, ensuring seamless connectivity. In the future, the combination of flexible materials, nanotechnology, and artificial intelligence will promote the miniaturization, low power consumption, and high gain of antennas. This combination will support multi-frequency band adaptive functions and further enhance device performance and user experience. Concurrently, these technologies will also create new opportunities in the fields of health monitoring, smart apparel, and security monitoring. These opportunities will become an important cornerstone for the development of future communication technologies. 7. Comparisons In recent years, a growing body of review papers has emerged on the subject of wearable antennas. The work of Marterer et al. delved into the development of wearable textile antennas, with a particular focus on material selection, fabrication methods, design strategies, and application areas [ 46 151 113 25 152 153 8. Conclusions This review provides a systematic and comprehensive overview of the design of wearable antennas based on the latest 5 years of the literature. This article highlights the rapid development of wearable technology, driven by advances in wireless communication technology and the growing demand for wearable devices in various fields, such as healthcare, sports, and defense. This article pays particular attention to flexible substrates, novel materials (e.g., conductive fabrics), emerging fabrication methods (e.g., inkjet printing and embroidery), and the application of wearable antennas for health detection, and discusses the use of artificial intelligence in antenna design. Overall, it provides valuable guidance for future research and practical applications in the field of wearable antennas Disclaimer/Publisher’s Note: Author Contributions Z.C.: investigation, writing—original draft, writing—review and editing. M.L.: conceptualization, funding acquisition, resources, supervision, writing—original draft, writing—review and editing. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Conflicts of Interest The authors declare no conflicts of interest. The funders had no role in the design of the study; in the collection, analyses, or interpretation of data; in the writing of the manuscript; or in the decision to publish the results. Abbreviations The following abbreviations are used in this manuscript: AMC Artificial Magnetic Conductor ACS Asymmetric Coplanar Strip AI Artificial Intelligence ADS Advanced Design System BiLSTM Bidirectional Long Short-Term Memory CAGR Compound Annual Growth Rate CPW Coplanar Waveguide Feed CPS Cardiopulmonary Stethoscope CEM Computational Electromagnetics CST Computational Simulation Techniques CIOA Circle-Inspired Optimization Algorithm CNN Convolutional Neural Networks DL Deep Learning DNN Deep Neural Network ECGs Electrocardiograms EEGs Electroencephalograms EBG Electromagnetic Bandgap FSS Frequency Selective Surface FCC Federal Communications Commission FBR Front-To-Back Ratio FDTD Finite-Difference Time-Domain FEM Finite-Element Method GPS Global Positioning System GAF Graphene Assembled Film HFSS High Frequency Structure Simulator IoT Internet of Things ICNIRP International Commission on Non-Ionizing Radiation Protection IEEE International Institute of Electrical and Electronics Engineers MIMO Multiple-Input Multiple-Output MoM Method of Moments ML Machine Learning NSGA-III Non-dominated Sorting Genetic Algorithm III PCB Printed Circuit Board PET Polyethylene Terephthalate RCS Radar Cross-Section SAR Specific Absorption Rate SIW Substrate-Integrated Waveguide SHCNN Siamese Heterogeneous Convolutional Neural Network SCA Sine Cosine Algorithm TCN Temporal Convolutional Network TCF Transparent Conductive Film UWB Ultra-Wideband UHF-RFID Ultra-High Frequency Radio Frequency Identification WLAN Wireless Local Area Network WBAN Wireless Body Area Network Wi-MAX World Interoperability for Microwave Access References 1. Soh P.J. Vandenbosch G.A. Mercuri M. Schreurs D.M.P. Wearable wireless health monitoring: Current developments, challenges, and future trends IEEE Microw. Mag. 2015 16 55 70 10.1109/MMM.2015.2394021 2. Liu S.Q. Zhang J.C. Zhu R. A wearable human motion tracking device using micro flow sensor incorporating a micro accelerometer IEEE Trans. Biomed. Eng. 2019 67 940 948 10.1109/TBME.2019.2924689 31247541 3. Sunehra D. Sreshta V.S. Shashank V. Goud B.U.K. Raspberry Pi based smart wearable device for women safety using GPS and GSM technology Proceedings of the 2020 IEEE international conference for innovation in technology (INOCON) Bengaluru, India 6–8 November 2020 IEEE Piscataway, NJ, USA 2020 1 5 4. Aun N.F.M. Soh P.J. Al-Hadi A.A. Jamlos M.F. Vandenbosch G.A. Schreurs D. Revolutionizing wearables for 5G: 5G technologies: Recent developments and future perspectives for wearable devices and antennas IEEE Microw. Mag. 2017 18 108 124 10.1109/MMM.2017.2664019 5. Dian F.J. Vahidnia R. Rahmati A. Wearables and the Internet of Things (IoT), applications, opportunities, and challenges: A Survey IEEE Access 2020 8 69200 69211 10.1109/ACCESS.2020.2986329 6. Waly M.I. Smida A. Aljarallah N.A. Ghayoula R. Negm A.S. Muhammad S. Tiang J.J. Iqbal A. Advancement of a high-efficiency wearable antenna enabling wireless body area networks IEEE Access 2023 11 138325 138335 10.1109/ACCESS.2023.3339559 7. Jeong M.J. Hussain N. Bong H.U. Park J.W. Shin K.S. Lee S.W. Rhee S.Y. Kim N. Ultrawideband microstrip patch antenna with quadruple band notch characteristic using negative permittivity unit cells Microw. Opt. Technol. Lett. 2020 62 816 824 10.1002/mop.32078 8. Paracha K.N. Rahim S.K.A. Soh P.J. Khalily M. Wearable antennas: A review of materials, structures, and innovative features for autonomous communication and sensing IEEE Access 2019 7 56694 56712 10.1109/ACCESS.2019.2909146 9. Salonen P. Sydanheimo L. Keskilammi M. Kivikoski M. A small planar inverted-F antenna for wearable applications Proceedings of the Digest of Papers. Third International Symposium on Wearable Computers San Francisco, CA, USA 18–19 October 1999 IEEE Piscataway, NJ, USA 1999 95 100 10. Salonen P. Rantanen J. A dual-band and wide-band antenna on flexible substrate for smart clothing Proceedings of the IECON’01. 27th Annual Conference of the IEEE Industrial Electronics Society (Cat. No. 37243) Denver, CO, USA 29 November –2 December 2001 IEEE Piscataway, NJ, USA 2001 125 130 11. Salonen P. Keskilammi M. Rantanen J. Sydanheimo L. A novel Bluetooth antenna on flexible substrate for smart clothing Proceedings of the 2001 IEEE International Conference on Systems, Man and Cybernetics. e-Systems and e-Man for Cybernetics in Cyberspace (Cat. No. 01CH37236) Tucson, AZ, USA 7–10 October 2001 IEEE Piscataway, NJ, USA 2001 789 794 12. Tanaka M. Jang J.H. Wearable microstrip antenna Proceedings of the IEEE Antennas and Propagation Society International Symposium. Digest. Held in conjunction with: USNC/CNC/URSI North American Radio Sci. Meeting (Cat. No. 03CH37450) Columbus, OH, USA 22–27 June 2003 IEEE Piscataway, NJ, USA 2003 704 707 13. Locher I. Klemm M. Kirstein T. Troster G. Design and characterization of purely textile patch antennas IEEE Trans. Adv. Packag. 2006 29 777 788 10.1109/TADVP.2006.884780 14. Salonen P. Yang F. Rahmat-Samii Y. Kivikoski M. WEBGA-wearable electromagnetic band-gap antenna Proceedings of the IEEE Antennas and Propagation Society Symposium Monterey, CA, USA 16–21 June 2002 IEEE Piscataway, NJ, USA 2004 451 454 15. Zhu S. Langley R. Dual-band wearable textile antenna on an EBG substrate IEEE Trans. Antennas Propag. 2009 57 926 935 10.1109/TAP.2009.2014527 16. Hong S. Kang S.H. Kim Y. Jung C.W. Transparent and flexible antenna for wearable glasses applications IEEE Trans. Antennas Propag. 2016 64 2797 2804 10.1109/TAP.2016.2554626 17. Hong S. Kim Y. Jung C.W. Transparent microstrip patch antennas with multilayer and metal-mesh films IEEE Antennas Wirel. Propag. Lett. 2016 16 772 775 10.1109/LAWP.2016.2602389 18. Bernardo M.G. Freire R.C.S.V. De Queiroz A.K.F. Araujo J.I.L. Morais S.M.A. Serres A.J.R. da Silva P.F. Aperture-coupled on-chip patch antennas for ISM band 60 GHz Proceedings of the 2017 2nd International Symposium on Instrumentation Systems, Circuits and Transducers (INSCIT) Fortaleza, Brazil 27–31 August 2017 IEEE Piscataway, NJ, USA 2017 1 4 19. Kaur G. Singh A. Mittal D. Kaur A. Panday P. Sidhu E. Performance analysis of conductive patch materials for the design and fabrication of microstrip patch antennas Proceedings of the 2017 Progress in Electromagnetics Research Symposium-Spring (PIERS) St. Petersburg, Russia 22–25 May 2017 IEEE Piscataway, NJ, USA 2017 502 508 20. Elmobarak H.A. Himdi M. Castel X. Rahim S.K.A. Geok T.K. Flexible patch antenna array operating at microwaves based on thin composite material IEEE Access 2022 10 115663 115672 10.1109/ACCESS.2022.3218342 21. Liu Y. Yu M. Xu L. Li Y. Ye T.T. Characterizations and optimization techniques of embroidered RFID antenna for wearable applications IEEE J. Radio. Freq. Identif. 2019 4 38 45 10.1109/JRFID.2019.2961189 22. Alonso-González L. Ver-Hoeye S. Fernández-García M. Vázquez-Antuña C. Andrés F.L.H. On the development of a novel mixed embroidered-woven slot antenna for wireless applications IEEE Access 2019 7 9476 9489 10.1109/ACCESS.2019.2891208 23. Le V. Lemmer U. Mackensen E. Analysis of miniaturized printed flexible RFID/NFC antennas using different carrier substrates IEEE J. Radio Freq. Identif. 2020 4 428 437 10.1109/JRFID.2020.3001336 24. Al-Gburi A.J.A. Radi N.H.M. Saeidi T. Mohammed N.J. Zakaria Z. Das G.S. Buragohain A. Ismail M.M. Superconductive and flexible antenna based on a tri-nanocomposite of graphene nanoplatelets, silver, and copper for wearable electronic devices J. Sci. Adv. Mater. Dev. 2024 9 100773 10.1016/j.jsamd.2024.100773 25. Ali Khan M.U. Raad R. Tubbal F. Theoharis P.I. Liu S. Foroughi J. Bending analysis of polymer-based flexible antennas for wearable, general IoT applications: A review Polymers 2021 13 357 10.3390/polym13030357 33499265 PMC7865813 26. Zhang J. Song R. Zhao X. Fang R. Zhang B. Qian W. Zhang J. Liu C. He D. Flexible graphene-assembled film-based antenna for wireless wearable sensor with miniaturized size and high sensitivity ACS Omega 2020 5 12937 12943 10.1021/acsomega.0c00263 32548477 PMC7288573 27. Lin X. Chen Y. Gong Z. Seet B.C. Huang L. Lu Y. Ultrawideband textile antenna for wearable microwave medical imaging applications IEEE Trans. Antennas Propag. 2020 68 4238 4249 10.1109/TAP.2020.2970072 28. Montisci G. Mura G. Muntoni G. Casula G.A. Chietera F.P. Aburish-Hmidat M. A curved microstrip patch antenna designed from transparent conductive films IEEE Access 2022 11 839 848 10.1109/ACCESS.2022.3233471 29. Samantaray D. Bhattacharyya S. A gain-enhanced slotted patch antenna using metasurface as superstrate configuration IEEE Trans. Antennas Propag. 2020 68 6548 6556 10.1109/TAP.2020.2990280 30. Zhang Y. Lin S. Li Y. Cui J. Dai F. Jiao J. Denisov A. Wideband pattern-and polarization-reconfigurable antenna based on bistable composite cylindrical shells IEEE Access 2020 8 66777 66787 10.1109/ACCESS.2020.2986353 31. Gil-Martínez A. Poveda-García M. Cañete-Rebenaque D. Gómez-Tornero J.L. Frequency-scanned monopulse antenna for RSSI-based direction finding of UHF RFID tags IEEE Antennas Wirel. Propag. Lett. 2021 21 158 162 10.1109/LAWP.2021.3122233 32. Catarinucci L. Chietera F. Colella R. Permittivity-customizable ceramic-doped silicone substrates shaped with 3-D-printed molds to design flexible and conformal antennas IEEE Trans. Antennas Propag. 2020 68 4967 4972 10.1109/TAP.2020.2969748 33. Singh V.P. Krishnamoorthy K. Rahman M. graphene-oxide-coated flexible fabric antenna sensor for contact-free H 2 IEEE Sens. J. 2023 24 1175 1182 10.1109/JSEN.2023.3337492 34. De A. Roy B. Bhattacharya A. Bhattachaqee A.K. Bandwidth-enhanced ultra-wide band wearable textile antenna for various WBAN and Internet of Things (IoT) applications Radio Sci. 2021 56 1 16 10.1029/2021RS007315 35. Ali U. Ullah S. Basir A. Kamal B. Matekovits L. Yoo H. Design and SAR analysis of AMC-based fabric antenna for body-centric communication IEEE Access 2023 11 73894 73911 10.1109/ACCESS.2023.3295993 36. Sheeba I.R. Design and implementation of flexible wearable antenna on thyroid gland in the detection of cancer cells Biomed. Res. 2018 29 2307 2312 10.4066/biomedicalresearch.44-17-3380 37. Sakib N. Ibrahim S.N. Ibrahimy M.I. Islam M.S. Mahfuz M.H. Design of microstrip patch antenna on rubber substrate with DGS for WBAN applications Proceedings of the 2020 IEEE Region 10 Symposium (TENSYMP) Dhaka, Bangladesh 5–7 June 2020 IEEE Piscataway, NJ, USA 2020 1050 1053 38. Ashyap A.Y. Inam M. Kamarudin M. Dahri M. Shamsan Z. Almuhanna K. Alorifi F. Multi-band metamaterial antenna for terahertz applications Comput. Mater. Contin. 2023 75 1765 1782 10.32604/cmc.2023.030618 39. Li H. Zhang H. Kong Y. Zhou C. Flexible dual-polarized UWB antenna sensors for breast tumor detection IEEE Sens. J. 2022 22 13648 13658 10.1109/JSEN.2022.3180356 40. Liu Q. Yi C. Chen J. Xia M. Lu Y. Wang Y. Liu X. Li M. Liu K. Wang D. Flexible, breathable, and highly environmental-stable Ni/PPy/PET conductive fabrics for efficient electromagnetic interference shielding and wearable textile antennas Compos. B Eng. 2021 215 108752 10.1016/j.compositesb.2021.108752 41. Tomaszewski G. Jankowski-Mihułowicz P. Potencki J. Pietrikova A. Lukacs P. Inkjet-printed HF antenna made on PET substrate Microelectron. Reliab. 2022 129 114473 10.1016/j.microrel.2021.114473 42. Sharma P.K. Gupta N. A CPW-fed circular SRR-inspired flexible antenna using polydimethylsiloxane (PDMS) substrate for WLAN and WBAN applications IEEE J. Flex. Electron. 2022 1 39 46 10.1109/JFLEX.2022.3153240 43. Zhang K. Särestöniemi M. Myllymäki S. Soh P.J. Chen J. Yan S. A wideband circularly polarized antenna with metasurface plane for biomedical telemetry IEEE Antennas Wirel. Propag. Lett. 2024 23 1879 1883 10.1109/LAWP.2024.3372197 44. Su W. Zhu J. Liao H. Tentzeris M.M. Wearable antennas for cross-body communication and human activity recognition IEEE Access 2020 8 58575 58584 10.1109/ACCESS.2020.2982965 45. López-Soriano S. Melià-Seguí J. Granados J.P. UHF RFID wristbands: A long-range, durable, flexible, and low-cost tag antenna design IEEE J. Radio Freq. Identif. 2024 8 125 133 10.1109/JRFID.2024.3365796 46. Marterer V. Radouchová M. Soukup R. Hipp S. Blecha T. Wearable textile antennas: Investigation on material variants, fabrication methods, design and application Fash. Text. 2024 11 9 10.1186/s40691-023-00369-1 47. Marasco I. Niro G. De Marzo G. Rizzi F. D’Orazio A. Grande M. De Vittorio M. Design and fabrication of a plastic-free antenna on a sustainable chitosan substrate IEEE Electron Device Lett. 2022 44 341 344 10.1109/LED.2022.3232986 48. Abutarboush H.F. Silver nanoparticle inkjet-printed multiband antenna on synthetic paper material for flexible devices Alex. Eng. J. 2022 61 6349 6355 10.1016/j.aej.2021.11.060 49. Siraj Y. Khardioui Y. Alaoui K.S. Foshi J. High-performance terahertz patch antenna with metamaterials for advanced 6G and biomedical technologies Sci. Afr. 2025 28 e02716 10.1016/j.sciaf.2025.e02716 50. Zhuang Z. Xuan X. Li H. Jiang D. Li M. A wearable antenna sensor based on ePDA/SiO 2 Sens. Actuators B Chem. 2024 404 135265 10.1016/j.snb.2023.135265 51. Hossain A.R. Sagar M.S.I. Mertvyy A.A. Sekhar P.K. Karacolak T. Inkjet printed flexible dual-band dual-sense circularly polarized patch antenna IEEE Access 2024 12 55424 55433 10.1109/ACCESS.2024.3389706 52. Arulmurugan S. Tr S.K. Sidén J. Alex Z.C. Circular polarized dual-band wearable screen-printed MIMO antenna integrated with AMC for WBAN communications IEEE Open J. Antennas Propag. 2024 5 1805 1814 10.1109/OJAP.2024.3458968 53. Merzaki F. Besnier P. Himdi M. Castel X. Sergolle M. Levavasseur T. Caldamone P. A compact double-sided FSS absorbing wall for decoupling 5G antenna arrays IEEE Trans. Electromagn. Compat. 2021 64 303 314 10.1109/TEMC.2021.3129368 54. Zahertar S. Laurin E. Dodd L.E. Torun H. Embroidered rectangular split-ring resonators for the characterization of dielectric materials IEEE Sens. J. 2019 20 2434 2439 10.1109/JSEN.2019.2953251 55. Shah A. Patel P. Suspended embroidered triangular e-textile broadband antenna loaded with shorting pins Int. J. Electron. Commun. 2021 130 153573 10.1016/j.aeue.2020.153573 56. Vital D. Bhardwaj S. Volakis J.L. Textile-based large area RF-power harvesting system for wearable applications IEEE Trans. Antennas Propag. 2019 68 2323 2331 10.1109/TAP.2019.2948521 57. Ashraf F.B. Alam T. Islam M.T. Singh M.J. Misran N.B. Islam M.T. Inkjet printed metamaterial loaded antenna for WLAN/WiMAX applications Comput. Mater. Contin. 2022 71 2271 2284 10.32604/cmc.2022.021751 58. Castro A.T. Sharma S.K. Inkjet-printed wideband circularly polarized microstrip patch array antenna on a PET film flexible substrate material IEEE Antennas Wirel. Propag. Lett. 2017 17 176 179 10.1109/LAWP.2017.2779440 59. Chen H. Shao Y. Zhang Y. Zhang C. Zhang Z. A millimeter-wave triple-band SIW antenna with dual-sense circular polarization IEEE Trans. Antennas Propag. 2020 68 8162 8167 10.1109/TAP.2020.2996806 60. Yang T. Zhao Z. Yang D. Nie Z. Low cross-polarization SIW slots array antenna with a compact feeding network IEEE Antennas Wirel. Propag. Lett. 2020 20 189 193 10.1109/LAWP.2020.3043774 61. Hasni U. Piper M.E. Lundquist J. Topsakal E. Screen-printed fabric antennas for wearable applications IEEE Open J. Antennas Propag. 2021 2 591 598 10.1109/OJAP.2021.3070919 62. Abutarboush H.F. Li W. Shamim A. Flexible-screen-printed antenna with enhanced bandwidth by employing defected ground structure IEEE Antennas Wirel. Propag. Lett. 2020 19 1803 1807 10.1109/LAWP.2020.3019462 63. Mao C.X. Zhou Y. Wu Y. Soewardiman H. Werner D.H. Jur J.S. Low-profile strip-loaded textile antenna with enhanced bandwidth and isolation for full-duplex wearable applications IEEE Trans. Antennas Propag. 2020 68 6527 6537 10.1109/TAP.2020.2989862 64. Yu H. Zhang X. Zheng H. Li D. Pu Z. An inkjet-printed bendable antenna for wearable electronics Int. J. Bioprint. 2023 9 722 10.18063/ijb.722 37323486 PMC10261132 65. Yang W. Zhao X. Guo Z. Sun H. List-Kratochvil E.J. A compact tri-notched flexible UWB antenna based on an inkjet-printable and plasma-activated silver nano ink Sci. Rep. 2024 14 11407 10.1038/s41598-024-62253-2 38762538 PMC11102509 66. Aprilliyani R. Dzagbletey P.A. Lee J.H. Jang M.J. So J.H. Chung J.Y. Effects of textile weaving and finishing processes on textile-based wearable patch antennas IEEE Access 2020 8 63295 63301 10.1109/ACCESS.2020.2984934 67. Varma S. Sharma S. John M. Bharadwaj R. Dhawan A. Koul S.K. Design and performance analysis of compact wearable textile antennas for IoT and body-centric communication applications Int. J. Antennas Propag. 2021 2021 7698765 10.1155/2021/7698765 68. Truong T. Kim J.S. Kim J. Design and Optimization of Embroidered Antennas on Textile Using Silver Conductive Thread for Wearable Applications Fibers Polym. 2021 22 2900 2909 10.1007/s12221-021-0030-1 69. Bakogianni S. Tsolis A. Angelaki C. Alexandridis A.A. On the development of embroidered reconfigurable dipole antennas: A textile approach to mechanical reconfiguration Electronics 2024 13 3649 10.3390/electronics13183649 70. Martinez I. Mao C.X. Vital D. Shahariar H. Werner D.H. Jur J.S. Bhardwaj S. Compact, low-profile and robust textile antennas with improved bandwidth for easy garment integration IEEE Access 2020 8 77490 77500 10.1109/ACCESS.2020.2989260 71. Delmonte N. Silvestri L. Perregrini L. Bozzi M. Substrate integrated waveguide (SIW) cavity resonators: A review of technologies and applications Proceedings of the 2021 IEEE International Symposium on Radio-Frequency Integration Technology (RFIT) Hualien, Taiwan 25–27 August 2021 IEEE Piscataway, NJ, USA 2021 1 3 72. Patil S.M. Venkatesan R. A compact circularly polarized (CP) substrate integrated waveguide (SIW) cavity-backed antenna with controlled axial ratio Int. J. Commun. Syst. 2024 37 e5951 10.1002/dac.5951 73. Casula G.A. Montisci G. Muntoni G. A novel design for dual-band wearable textile eighth-mode SIW antennas IEEE Access 2023 11 11555 11569 10.1109/ACCESS.2023.3242602 74. Kumar L. Nath V. Reddy B. A wideband substrate integrated waveguide (SIW) antenna using shorted vias for 5G communications Int. J. Electron. Commun. 2023 171 154879 10.1016/j.aeue.2023.154879 75. Gao G.P. Jin L.J. Bai J.M. Ma G. Guo W.D. Hu B. Tri-Band wearable SIW textile antenna with metasurface for wireless body area network Microw. Opt. Technol. Lett. 2025 67 e70149 10.1002/mop.70149 76. Balanis C.A. Antenna Theory: Analysis and Design John Wiley & Sons Hoboken, NJ, USA 2016 77. Sreelekshmi S. Sankar S.P. A 2.5 GHz compact wearable microstrip patch antenna for off body wireless communication in WBANs Proceedings of the 2021 Fifth International Conference on I-SMAC (IoT in Social, Mobile, Analytics and Cloud) (I-SMAC) Palladam, India 11–13 November 2021 IEEE Piscataway, NJ, USA 2021 1751 1756 78. Banciu M.G. Ion V. Nedelcu L. Geambasu D.C. Trupina L. Besleaga-Stan C. Scarisoreanu N.D. Printed monopole arrowhead antenna compared to microstrip rectangular antenna on high dielectric constant substrate Proceedings of the 2018 International Symposium on Fundamentals of Electrical Engineering (ISFEE) Bucharest, Romania 1–3 November 2018 IEEE Piscataway, NJ, USA 2018 1 4 79. Waly M. Smida J. Bakouri M. Alresheedi B.A. Alqahtani T.M. Alonzi K.A. Smida A. Optimization of a compact wearable LoRa patch antenna for vital sign monitoring in WBAN medical applications using machine learning IEEE Access 2024 12 103860 103879 10.1109/ACCESS.2024.3434595 80. Khajeh-Khalili F. Haghshenas F. Shahriari A. Wearable dual-band antenna with harmonic suppression for application in medical communication systems Int. J. Electron. Commun. 2020 126 153396 10.1016/j.aeue.2020.153396 81. Sainath K. Gunamony S.L. Awan W.A. George N.M. Sindhu M.D. Alsunaydih F.N. Alhassoon K. Development of flexible durable multi-slotted antenna for wearable applications Heliyon 2024 10 e40627 10.1016/j.heliyon.2024.e40627 39660198 PMC11629234 82. George J. Uko M. Ekpo S. Elias F. Design of an elliptically-slotted patch antenna for multi-purpose wireless wi-Fi and biosensing applications e-Prime Adv. Electr. Eng. Electron. Energy 2023 6 100368 10.1016/j.prime.2023.100368 83. Hu B. Gao G.P. He L.L. Cong X.D. Zhao J.N. Bending and on-arm effects on a wearable antenna for 2.45 GHz body area network IEEE Antennas Wirel. Propag. Lett. 2015 15 378 381 10.1109/LAWP.2015.2446512 84. Veselago V.G. The electrodynamics of substances with simultaneously negative values of and μ Phys.-Uspekhi 1968 10 509 514 10.1070/PU1968v010n04ABEH003699 85. Pendry J.B. Holden A. Stewart W. Youngs I. Extremely low frequency plasmons in metallic mesostructures Phys. Rev. Lett. 1996 76 4773 10.1103/PhysRevLett.76.4773 10061377 86. Pendry J.B. Holden A.J. Robbins D.J. Stewart W.J. Magnetism from conductors and enhanced nonlinear phenomena IEEE Trans. Microw. Theory Tech. 1999 47 2075 2084 10.1109/22.798002 87. Cui T.J. Qi M.Q. Wan X. Zhao J. Cheng Q. Coding metamaterials, digital metamaterials and programmable metamaterials Light Sci. Appl. 2014 3 e218 10.1038/lsa.2014.99 88. Sievenpiper D. Zhang L. Broas R.F. Alexopolous N.G. Yablonovitch E. High-impedance electromagnetic surfaces with a forbidden frequency band IEEE Trans. Microw. Theory Tech. 1999 47 2059 2074 10.1109/22.798001 89. Hamza M.N. Islam M.T. Koziel S. Advanced sensor for non-invasive breast cancer and brain cancer diagnosis using antenna array with metamaterial-based AMC Eng. Sci. Technol. 2024 56 101779 10.1016/j.jestch.2024.101779 90. Ahmad A. Faisal F. Ullah S. Choi D.Y. Design and SAR analysis of a dual band wearable antenna for WLAN applications Appl. Sci. 2022 12 9218 10.3390/app12189218 91. Ali U. Basir A. Zada M. Ullah S. Kamal B. Yoo H. Performance improvement of a dual-band textile antenna for on-body through artificial magnetic conductor IEEE Access 2023 11 72316 72331 10.1109/ACCESS.2023.3294412 92. Zerrad F.E. Taouzari M. Makroum E.M. Islam M.T. Özkaner V. Abdulkarim Y.I. Karaaslan M. Multilayered metamaterials array antenna based on artificial magnetic conductor’s structure for the application diagnostic breast cancer detection with microwave imaging Med. Eng. Phys. 2022 99 103737 10.1016/j.medengphy.2021.103737 35058030 93. Mamedes D.F. Da Silva J.P.F. Da Silva Souza J. Da Silva Evangelista T. De Sousa T.R. Da Fonseca Silva P.H. Analysis of impedance matching techniques in tapered microstrip patch antenna Proceedings of the 2017 SBMO/IEEE MTT-S International Microwave and Optoelectronics Conference (IMOC) Aguas de Lindoia, Brazil 27–30 August 2017 IEEE Piscataway, NJ, USA 2017 1 4 94. Ashyap A.Y. Abidin Z.Z. Dahlan S.H. Majid H.A. Kamarudin M.R. Alomainy A. Abd-Alhameed R.A. Kosha J.S. Noras J.M. Highly efficient wearable CPW antenna enabled by EBG-FSS structure for medical body area network applications IEEE Access 2018 6 77529 77541 10.1109/ACCESS.2018.2883379 95. Abbas A.K. Thangavelu S. Compact ACS-fed monopole antenna with CRR defect for triple band application Int. J. Electron. Commun. 2020 127 153487 10.1016/j.aeue.2020.153487 96. Grilo M. Hiroaki Seko M. Salete Correra F. Wearable textile patch antenna fed by proximity coupling with increased bandwidth Microw. Opt. Technol. Lett. 2016 58 1906 1912 10.1002/mop.29942 97. Del-Rio-Ruiz R. Lopez-Garde J.M. Legarda J. Caytan O. Rogier H. A combination of transmission line models as design instruments for electromagnetically coupled microstrip patch antennas in the 2.45 GHz ISM band IEEE Trans. Antennas Propag. 2020 69 550 555 10.1109/TAP.2020.3001668 98. Oliveira M. Morais S. Araujo J. Serres G. Serres A. Silva P. Silva P.H.F. D’Assunção A.G. Bio-inspired butterfly-shaped patch antenna array for 2.4 GHz WLAN applications Proceedings of the 2020 IEEE International Symposium on Antennas and Propagation and North American Radio Science Meeting Montreal, QC, Canada 5–10 July 2020 IEEE Piscataway, NJ, USA 2020 201 202 99. Biswas B. Ghatak R. Poddar D. A fern fractal leaf inspired wideband antipodal Vivaldi antenna for microwave imaging system IEEE Trans. Antennas Propag. 2017 65 6126 6129 10.1109/TAP.2017.2748361 100. Ullah H. Tahir F.A. A novel snowflake fractal antenna for dual-beam applications in 28 GHz band IEEE Access 2020 8 19873 19879 10.1109/ACCESS.2020.2968619 101. Sarma C.A. Inthiyaz S. Madhav B. Design and assessment of bio-inspired antennas for Mobile Communication Systems Int. J. Electr. Electron. Res. 2023 11 176 184 10.37391/ijeer.110125 102. IEEE 802.16-2017 IEEE Standard for Air Interface for Broadband Wireless Access Systems IEEE Piscataway, NJ, USA 2020 103. Mishra G. Sahu S. Nature inspired tree shaped antenna with dual band notch for UWB applications Microw. Opt. Technol. Lett. 2016 58 1658 1661 10.1002/mop.29874 104. Mohanty A. Sahu S. Bio-inspired maple-leaf viburnum shaped 4-port compact wideband MIMO antenna with reinforced interleaved SIW cavity integration Int. J. Electron. Commun. 2022 156 154383 10.1016/j.aeue.2022.154383 105. International Commission on Non-Ionizing Radiation Protection (ICNIRP) Guidelines for Limiting Exposure to Electromagnetic Fields (100 kHz to 300 GHz) Health Phys. 2020 118 483 524 10.1097/HP.0000000000001210 32167495 106. IC95.1-2019-IEEE Standard for Safety Levels with Respect to Human Exposure to Electric, Magnetic, and Electromagnetic Fields, 0 Hz to 300 GHz IEEE Piscataway, NJ, USA 2019 107. Abdelghany M.A. Ahmed M.I. Ibrahim A.A. Desai A. Ahmed M.F. Textile Antenna with Dual Bands and SAR Measurements for Wearable Communication Electronics 2024 13 2251 10.3390/electronics13122251 108. Saeidi T. Al-Gburi A.J.A. Karamzadeh S. A Miniaturized Full-Ground Dual-Band MIMO Spiral Button Wearable Antenna for 5G and Sub-6 GHz Communications Sensors 2023 23 1997 10.3390/s23041997 36850599 PMC9967624 109. Aishwarya T. Das P. A FSS integrated wearable modified bow-tie antenna for biomedical applications Results Eng. 2025 26 104894 10.1016/j.rineng.2025.104894 110. Musa U. Shah S.M. Majid H.A. Mahadi I.A. Rahim M.K.A. Yahya M.S. Abidin Z.Z. Design and analysis of a compact dual-band wearable antenna for WBAN applications IEEE Access 2023 11 30996 31009 10.1109/ACCESS.2023.3262298 111. Sharma D. Tiwari R.N. Kumar S. Sharma S. Matekovits L. A Compact Wearable Textile Antenna for NB-IoT and ISM Band Patient Tracking Applications Sensors 2024 24 5077 10.3390/s24155077 39124125 PMC11314978 112. Tiwari R.N. Malya K.G. Nandini G. Nikhitha P.B. Sharma D. Singh P. Kumar P. Quad-Band 1 × 4 Linear MIMO Antenna for Millimeter-Wave, Wearable and Biomedical Telemetry Applications Sensors 2024 24 4427 10.3390/s24144427 39065825 PMC11280940 113. Chishti A.R. Aziz A. Qureshi M.A. Abbasi M.N. Abbasi D. Iqbal S.S. Zerguine A. Algarni A.M. Hussain R. Advances in antenna-based techniques for detection and monitoring of critical chronic diseases: A comprehensive review IEEE Access 2023 11 104463 104484 10.1109/ACCESS.2023.3316149 114. Rambe A.H. Jusoh M. Al-Bawri S.S. Abdelghany M.A. Wearable UWB antenna-based bending and wet performances for breast cancer detection Comput. Mater. Contin. 2022 73 5575 5587 10.32604/cmc.2022.030902 115. Mersani A. Osman L. Ribero J.M. Flexible UWB AMC antenna for early stage skin cancer identification Prog. Electromagn. Res. M 2019 80 71 81 10.2528/PIERM18121404 116. Saleeb D.A. Helmy R.M. Areed N.F. Marey M. Almustafa K.M. Elkorany A.S. Detection of kidney cancer using circularly polarized patch antenna array IEEE Access 2022 10 78102 78113 10.1109/ACCESS.2022.3192555 117. Abbas A.M. Kumar P.D. Raghulraj D. Suraj K. Design and implementation of a flexible wearable antenna for the detection of cancer in the thyroid gland Proceedings of the 2023 2nd International Conference on Smart Technologies and Systems for Next Generation Computing (ICSTSN) Villupuram, India 21–22 April 2023 IEEE Piscataway, NJ, USA 2023 1 5 118. Rathod K. Gandhi T. Harne V. Bhagywant S. Mulaparti M.K. Dalal P. Design and optimization of non-woven polyester made U shaped flexible patch antenna for early detection of thyroid cancer Proceedings of the 2024 IEEE Wireless Antenna and Microwave Symposium (WAMS) Visakhapatnam, India 29 February–3 March 2024 IEEE Piscataway, NJ, USA 2024 1 5 119. Kaur K. Kaur A. In vitro detection of skin cancer using an UWB stacked micro strip patch antenna with microwave imaging Int. J. RF Microw. Comput. Aided Eng. 2022 32 e23407 10.1002/mmce.23407 120. Hasan R.R. Saleque A.M. Anwar A.B. Rahman M.A. Tsang Y.H. Multiwalled carbon nanotube-based on-body patch antenna for detecting COVID-19-affected lungs ACS Omega 2022 7 28265 28274 10.1021/acsomega.2c02550 35983370 PMC9380818 121. Saleeb D.A. Helmy R.M. Areed N.F. Marey M. Abdulkawi W.M. Elkorany A.S. A technique for the early detection of brain cancer using circularly polarized reconfigurable antenna array IEEE Access 2021 9 133786 133794 10.1109/ACCESS.2021.3115707 122. Alibakhshikenari M. Virdee B.S. Shukla P. Parchin N.O. Azpilicueta L. See C.H. Abd-Alhameed R.A. Falcone F. Huynen I. Denidni T.A. Metamaterial-inspired antenna array for application in microwave breast imaging systems for tumor detection IEEE Access 2020 8 174667 174678 10.1109/ACCESS.2020.3025672 123. O’Loughlin D. O’Halloran M. Moloney B.M. Glavin M. Jones E. Elahi M.A. Microwave breast imaging: Clinical advances and remaining challenges IEEE Trans. Biomed. Eng. 2018 65 2580 2590 10.1109/TBME.2018.2809541 29993488 124. Ghosh M. Basu B. Detection of malignant breast tissue using SAR observation with microwave imaging and convolutional neural network Comput. Electr. Eng. 2024 119 109620 10.1016/j.compeleceng.2024.109620 125. Sadasivam S. Bai T. A compact ultra-wide band fractal antenna for breast cancer detection applications Alex. Eng. J. 2024 103 376 383 10.1016/j.aej.2024.06.018 126. Samsuzzaman M. Talukder M.S. Alqahtani A. Alharbi A.G. Azim R. Soliman M.S. Islam M.T. Circular slotted patch with defected grounded monopole patch antenna for microwave-based head imaging applications Alex. Eng. J. 2023 65 41 57 10.1016/j.aej.2022.10.034 127. El Gharbi M. Fernández-García R. Gil I. Embroidered wearable Antenna-based sensor for Real-Time breath monitoring Measurement 2022 195 111080 10.1016/j.measurement.2022.111080 128. Ahadi M. Roudjane M. Dugas M.A. Miled A. Messaddeq Y.E.S. Wearable sensor based on flexible sinusoidal antenna for strain sensing applications Sensors 2022 22 4069 10.3390/s22114069 35684691 PMC9185364 129. Roudjane M. Bellemare-Rousseau S. Khalil M. Gorgutsa S. Miled A. Messaddeq Y. A portable wireless communication platform based on a multi-material fiber sensor for real-time breath detection Sensors 2018 18 973 10.3390/s18040973 29587396 PMC5948861 130. do Nascimento J.P.C. do Carmo F.F. Sales A.J.M. Maia S.M. Frutuoso R.L. da Silveira Cavalcante T. Cavalcante C. Vieira J.D.S. de Carvalho C.R.R. Sombra A.S.B. A novel wireless oxygen gas sensor based on silver film loaded on a patch antenna Mater. Chem. Phys. 2023 299 127513 10.1016/j.matchemphys.2023.127513 131. Hanna J. Bteich M. Tawk Y. Ramadan A.H. Dia B. Asadallah F.A. Eid A. Kanj R. Costantine J. Eid A.A. Noninvasive, wearable, and tunable electromagnetic multisensing system for continuous glucose monitoring, mimicking vasculature anatomy Sci. Adv. 2020 6 eaba5320 10.1126/sciadv.aba5320 32577523 PMC7286677 132. Rathod K. Raskar S. Gamit S. Deshpande S. Design of hexagonal ring wearable textile antenna using polyester for early bone health detection Procedia Comput. Sci. 2023 230 946 954 10.1016/j.procs.2023.12.134 133. Modak S. Kaim V. Khan T. Kanaujia B.K. Matekovits L. Rambabu K. Design and performance measurement of worn-on-body instrumental ultra-miniaturized UWB wearable patch for e-health monitoring IEEE Access 2024 12 25719 25730 10.1109/ACCESS.2024.3365938 134. He P.Y. Lai F.P. Chen Y.S. Sensitivity enhancement in cardio-pulmonary stethoscope applications through artificial magnetic conductor-backed antenna design IEEE J. Electromagn. RF Microw. Med. Biol. 2024 8 135 143 10.1109/JERM.2024.3372290 135. El Gharbi M. Abounasr J. García R.F. Gali I.G. Textile Stretchable Antenna-based Sensor for Breathing Monitoring IEEE Sens. J. 2024 24 42018 42027 10.1109/JSEN.2024.3485472 136. Baudh R.K. Sahu S. Parihar M.S. Kumar V.D. A wideband circularly polarized all textile on body antenna for defense applications IEEE Trans. Circuits Syst. II Express Briefs 2023 71 567 571 10.1109/TCSII.2023.3308213 137. Çelenk E. Tokan N.T. All-textile on-body antenna for military applications IEEE Antennas Wirel. Propag. Lett. 2022 21 1065 1069 10.1109/LAWP.2022.3159301 138. Berdasco A.F. De Cos Gómez M.E. Laviada J. Las-Heras F. AMC-backed twin arrow antenna for wearable electronic travel aid system at 24 GHz IEEE Antennas Wirel. Propag. Lett. 2024 23 3337 3341 10.1109/lawp.2024.3378012 139. Ikram M. Sultan K. Lateef M.F. Alqadami A.S. A road towards 6G communication—A review of 5G antennas, arrays, and wearable devices Electronics 2022 11 169 10.3390/electronics11010169 140. Aksimsek S. Ozek E.A. Ozpinar H. Laser ablation cutting-based metal patterning technique enabling 3D-printed broadband antennas for sub-6 GHz wireless communications applications IEEE Trans. Compon. Packag. Manuf. Technol. 2021 11 1506 1513 10.1109/TCPMT.2021.3100713 141. Rice A. Kiourti A. High-contrast low-loss antenna: A novel antenna for efficient into-body radiation IEEE Trans. Antennas Propag. 2022 70 10132 10140 10.1109/TAP.2022.3188354 36407055 PMC9674308 142. Sarker N. Podder P. Mondal M.R.H. Shafin S.S. Kamruzzaman J. Applications of machine learning and deep learning in antenna design, optimization, and selection: A review IEEE Access 2023 11 103890 103915 10.1109/ACCESS.2023.3317371 143. Gupta A. Karahan E.A. Bhat C. Sengupta K. Khankhoje U.K. Tandem neural network based design of multiband antennas IEEE Trans. Antennas Propag. 2023 71 6308 6317 10.1109/TAP.2023.3276524 144. Wu D.L. Hu X.J. Chen J.H. Ye L.H. Li J.F. Ai deep learning optimization for compact dual-polarized high-isolation antenna using backpropagation algorithm IEEE Antennas Wirel. Propag. Lett. 2023 23 898 902 10.1109/LAWP.2023.3338360 145. Shah A.H. Patel P.N. Embroidered annular elliptical E-textile antenna sensor for knee effusion diagnosis IEEE Sens. J. 2023 23 4809 4818 10.1109/JSEN.2023.3239783 146. Montaser A.M. Mahmoud K.R. Deep learning based antenna design and beam-steering capabilities for millimeter-wave applications IEEE Access 2021 9 145583 145591 10.1109/ACCESS.2021.3123219 147. Venkat S. Radhika R. Aruna V.V. Design of triband circularly polarized hexagon shaped patch antenna using optimized Siamese heterogeneous convolutional neural networks for 5G wireless communication system Nano Commun. Netw. 2025 43 100562 10.1016/j.nancom.2024.100562 148. Varshney H.K. Agrawal S. Jhariya D.K. Design and optimization of broadband circular polarized miniaturized UWB antenna using machine learning Int. J. Electron. Commun. 2025 197 155824 10.1016/j.aeue.2025.155824 149. Adegboye O.R. Feda A.K. Ishaya M.M. Agyekum E.B. Kim K.C. Mbasso W.F. Kamel S. Antenna S-parameter optimization based on golden sine mechanism based honey badger algorithm with tent chaos Heliyon 2023 9 e21596 10.1016/j.heliyon.2023.e21596 38034692 PMC10682539 150. Yang W. Liu S. Yang J. An optimized surrogate model and algorithm with rapid multi-parameter processing capability for antenna design Measurement 2025 241 115719 10.1016/j.measurement.2024.115719 151. Lundquist J. Linkous L. Piper M.E. Sickey Z. Zimmet K. Mendoza I. Suresh S. Topsakal E. Textile-based inkjet-printed RFIDs: Exploring wearable antennas in the real world [Bioelectromagnetics] IEEE Antennas Propag. Mag. 2024 66 50 62 152. Singh S. Mishra R. Kapoor A. Singh S. A Comprehensive Review and Analysis of the Design Aspects, Structure, and Applications of Flexible Wearable Antennas Telecom 2025 6 3 10.3390/telecom6010003 153. Yang M. Ye Z. Ren Y. Farhat M. Chen P.-Y. Materials, Designs, and Implementations of Wearable Antennas and Circuits for Biomedical Applications: A Review Micromachines 2024 15 26 10.3390/mi15010026 38258145 PMC10819388 Figure 1 GAF wearable antenna [ 26 Figure 2 ( a b 28 Figure 3 ( a 47 b 48 c 49 d 50 Figure 4 Screen printed CKA on a fabric (nylon/spandex) substrate [ 61 Figure 5 ( a 51 b 64 Figure 6 ( a 67 b 68 c 69 Figure 7 ( a 72 b 73 c 74 d 75 Figure 8 ( a 79 b 80 c 81 d 82 Figure 9 ( a 89 b 90 c 91 d 92 Figure 10 ( a 94 b 95 Figure 11 Textile patch antenna [ 96 Figure 12 ( a 101 b 103 c 104 Figure 13 ( a 109 b 110 Figure 14 ( a 121 b 122 Figure 15 ( a b 125 Figure 16 ( a b 126 Figure 17 Simplified view of lungs during respiration and the embroidered dipole antenna [ 127 Figure 18 ( a b 131 Figure 19 Design flow of the tri-band circularly polarized hexagonal patch antenna [ 147 micromachines-16-01028-t001_Table 1 Table 1 Conductivity and thickness of relevant conductive materials. Conductive Material Conductivity Thickness Copper [ 17 5.9 × 10 7 0.035 Aluminum [ 18 3.8 × 10 7 0.01 Stainless steel [ 19 1.0 × 10 6 0.45 Silver ink [ 24 1.97 × 10 6 0.12 Graphene [ 26 1.1 × 10 6 0.028 Copper–polyester 27 0.4 × 10 5 0.08 micromachines-16-01028-t002_Table 2 Table 2 Parameters of relevant substrate materials. Dielectric Material Dielectric Constant Dielectric Loss Frequency Range PET [ 28 2.5 0.01 2.025–2.29 (GHz) FR4 [ 29 4.4 0.025 10.14–10.94 (GHz) Denim [ 34 1.7 0.024 2.4–14.88 (GHz) Felt [ 35 1.3 0.044 2.4–2.5 (GHz) Rubber [ 37 3.1 0.02 2.4–2.5 (GHz) PTFE [ 44 2.2 0.002 2.4 (GHz) Synthetic paper [ 48 2 0.0022 1.83–2.9 (GHz), PI [ 49 3.5 0.008 3.62 (THz) PET paper [ 51 3.2 0.022 4.01–5.05 (GHz), micromachines-16-01028-t003_Table 3 Table 3 Comparison of various bending angles used for wearable antennas. Ref. Substrate Radius Dimensions Application [ 90 Polyethylene foam (40, 60, 70) 68 × 73 × 3 (mm 3 WLAN [ 91 Felt Rx (15, 30, 45) 0.41λ 0 0 0 ISM [ 94 Jeans Rx (70, 80, 100) 60 × 60 × 2.4 (mm 3 MBAN [ 109 Jeans (40, 50, 60) 27 × 27.5 × 1 (mm 3 WBAN [ 110 Rogers 3003 Rx (50, 80, 100) 41 × 44 × 1.52 (mm 3 WBAN [ 111 Denim (25, 35, 45) 60 × 60 × 1 (mm 3 ISM [ 112 Rogers 3003 Rx (40, 60, 80) 11 × 11 × 0.25 (mm 3 MM-WAVE micromachines-16-01028-t004_Table 4 Table 4 Performance parameters of wearable antennas for practical applications. Ref. Antenna Type Frequency Dimensions Dielectric Peak of Gain Bandwidth Application [ 114 UWB antenna 3.1–10.6 (GHz) 60 × 60 (mm) Felt 4.5 (dBi) 8.5 GHz Breast cancer [ 115 UWB antenna 8.2–13 (GHz) 36 × 48 (mm) Felt 7.04 (dB) 4.8 (GHz) Skin cancer [ 116 Antenna array 2.4 (GHz) 200 × 78 (mm) FR4 6.6 (dBi) 1 (GHz) Kidney cancer [ 117 H-type patch 5.4 (GHz) 50 × 50 (mm) RT/duroid® 5880 5.25 (dB) - Thyroid cancer [ 118 U-shaped textile antenna 5.4 (GHz) 0.41λ 0 0 Non-woven 9.17 (dB) 952 (MHz) Thyroid cancer [ 119 UWB stacked micro-strip antenna 6.1–12.3 (GHz) 36 × 30 (mm) FR4 6.3 (dB) 6.2 (GHz) Skin cancer [ 121 Reconfigurable 2.4 (GHz) 200 × 78 (mm) FR4 3.1 (dB) 90.9 (MHz) Brain cancer [ 123 Flexible antenna 4.1 (GHz) 12 × 20 (mm) PI 1.72 (dBi) - Blood glucose [ 125 UWB fractal 3–10.2 (GHz) 28.5 × 20 (mm) FR4 3.2 (dBi) 6.8 (GHz) Breast cancer [ 127 Dipole antenna 2.4 (GHz) 45 × 4.8 (mm) Cotton 1.86 (dB) - Breath [ 133 UBW 3.15–10.55 (GHz) 16 × 10 (mm) Polyimide 4.2 (dBi) 7.4 (GHz) Health [ 134 AMC 2.37–3.12 (GHz) 81 × 81 (mm) FR4 6.2 (dBi) 750 (MHz) Pulmonary edema [ 135 Textile 2.4 (GHz) 40 × 50 (mm) Thermoplastic polyurethane - - Breathing [ 138 AMC 23–27 (GHz) 9.6 × 14.1 (mm) RO3003 6.73 (dBi) 4 (GHz) Electronic travel aid micromachines-16-01028-t005_Table 5 Table 5 Comparison of related algorithms in the literature. Ref. Method Advantages Conclusion Application [ 146 5-layer DNN model MGSA-PSO optimizes feeding phases Combination of DNN and hybrid algorithms enables efficient beamforming 5G mm-Wave communication systems [ 147 Siamese Heterogeneous Convolutional Network + Shorten the design time Algorithm combined with heterogeneous network for efficient multi-band circular polarization design Multi-band communication for 5G base stations/UE devices [ 148 Ensemble Boosted Tree + Trilayered Neural Network + Fine Tree Simultaneously optimize AR and S11 using machine learning methods. Machine learning predictions align with simulation and actual measurement data. Satellite and radar applications [ 149 GST-HBA algorithm: Multi-function Algorithm improvement significantly boosts optimization efficiency for complex electromagnetic problems Antenna design parameter [ 150 Adaptive NSGA-III Pseudo-weight NSGA-III enhances Pareto front diversity Data-driven modeling combined with optimization shortens Fast ",
  "metadata": {
    "Title of this paper": "Materials, Designs, and Implementations of Wearable Antennas and Circuits for Biomedical Applications: A Review",
    "Journal it was published in:": "Micromachines",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471413/"
  }
}