{
  "title": "Paper_1119",
  "abstract": "pmc Genes (Basel) Genes (Basel) 2104 genes genes Genes 2073-4425 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470105 PMC12470105.1 12470105 12470105 41009989 10.3390/genes16091044 genes-16-01044 1 Article High-Mobility Group Box Protein 3 (HMGB3) Facilitates DNA Interstrand Crosslink Processing and Double-Strand Break Repair in Human Cells https://orcid.org/0009-0005-2400-2259 Dangerfield Jillian Conceptualization Data curation Formal analysis Investigation Methodology Writing – original draft Writing – review & editing 1 † Mukherjee Anirban Conceptualization Data curation Writing – review & editing Methodology Investigation Formal analysis Writing – original draft 2 † Reh Wade Data curation Investigation Formal analysis 3 https://orcid.org/0000-0002-7455-9064 Battenhouse Anna Formal analysis Writing – original draft 4 https://orcid.org/0000-0002-6958-5073 Vasquez Karen M. Conceptualization Resources Project administration Funding acquisition Writing – review & editing Supervision Methodology 1 * Lopez Bernard S. Academic Editor 1 2 anirban.mukherjee@refeyn.com 3 4 * karen.vasquez@austin.utexas.edu † These authors have contributed equally to this work and share first authorship. 04 9 2025 9 2025 16 9 496504 1044 15 8 2025 01 9 2025 01 9 2025 04 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives Methods Results Conclusions high-mobility group box protein 3 (HMGB3) DNA damage repair DNA interstrand crosslink (ICL) DNA double-strand break (DSB) repair cancer NIH/National Cancer Institute CA193124 This research was funded by the NIH/National Cancer Institute, grant number CA193124 (to K.M.V.). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction DNA damage occurs from both endogenous and exogenous sources, and error-free repair is essential to ensure genome integrity. Endogenous DNA damage forms at a rate of around 10 4 5 1 2 3 1 2 4 5 6 High-mobility group box (HMGB) proteins are nuclear non-histone architectural proteins. We have previously found that one of the members of this family of proteins, HMGB1, is involved in the repair of both DNA intrastrand crosslinks and DNA interstrand crosslinks (ICLs) [ 7 8 9 10 11 12 0 1 2 12 13 14 15 13 15 The HMGB family comprises a group of architectural proteins first discovered because of their high mobility on polyacrylamide gels observed in purified calf thymus samples [ 16 17 18 19 18 18 HMGB1, HMGB2, and HMGB3 share 80% sequence homology, yet they appear to play distinct biological roles [ 18 20 21 22 23 18 24 25 26 27 20 21 22 23 21 22 28 22 Of the three proteins, the most work has been done to understand the cellular functions of HMGB1. This includes its roles in DNA damage repair; for example, we have identified it as an NER cofactor [ 8 9 10 27 29 11 8 8 8 11 29 10 8 Not only has HMGB1 been implicated in NER processing of canonical UV irradiation-induced DNA lesions, but it has also been found to be involved in processing of complex ICLs [ 9 10 15 9 10 Despite the striking structural and sequence similarity of HMGB3 and HMGB1, this third member of the HMGB protein family has not been well studied for its potential role in DNA repair. However, we have identified a role for HMGB3 in resistance to cisplatin, a DNA-damaging chemotherapeutic agent, in human ovarian cancer cells [ 30 31 32 33 34 35 36 The question we asked here is whether HMGB3, in addition to its transcriptional regulation of ATR 30 2. Results 2.1. HMGB3, Unlike HMGB1, Does Not Play a Substantial Role in Nucleotide Excision Repair (NER) Experiments using UV-induced DNA damage were conducted in HMGB3 knockout human U2OS cells to investigate if HMGB3, like HMGB1, functions as an NER cofactor. HMGB3 knockout was verified through Sanger sequencing and Western blot analysis ( Supplementary Figure S1 2 2 2 2 2 Figure 1 2 2 2 Figure 1 Supplementary Figure S2 2 2 Figure 1 Next, assays were conducted to assess the mutagenic processing of UV-induced DNA damage. A mutation reporter (psp189) containing a SupF Figure 1 Figure 1 Table 1 8 10 2.2. HMGB3 Depletion Increases Mutation Frequencies, Large Deletions, and Chromosomal Aberrations in Response to ICLs In order to investigate the mutagenic repair of ICLs as a function of HMGB3 depletion, a mutagenesis assay using a supF Figure 2 Figure 2 Figure 2 Table 2 Supplementary Figure S3 Next, metaphase spread experiments were conducted to investigate chromosomal stability as a function of HMGB3 depletion in response to psoralen ICLs. In HMGB3-depleted human U2OS cells ( Figure 2 Figure 2 2.3. HMGB3 Depletion Decreases Cell Survival and Reduces the Efficiency of DSB-Repair Pathways in Response to DSBs One of the mechanisms employed in ICL repair involves DSB repair proteins/pathways; therefore, a series of DSB repair assays was conducted to investigate the role of HMGB3 in DSB processing. Clonogenic survival of U2OS cells was measured after treating the cells with 200 μg/mL of zeocin in the presence or absence of HMGB3. HMGB3 depletion was achieved using siRNA ( Figure 3 Figure 3 Table 2 Supplementary Figure S3 38 38 p Figure 3 p Figure 3 Figure 3 2.4. HMGB3 Forms Foci Following Cisplatin Treatment and HMGB3 Depletion Delays Cisplatin-Induced DNA Damage Repair Our previously published studies showed that HMGB3 depletion sensitized cisplatin-resistant A2780/CP70 human ovarian cancer cells to cisplatin and induced apoptosis [ 30 30 Figure 4 Supplementary Figure S4 Figure 4 One mechanism of cisplatin resistance in ovarian cancer cells is more efficient removal of cisplatin–DNA adducts, thereby reducing drug efficacy [ 5 Figure 4 Figure 4 p 2.5. HMGB3 Knockout Downregulates Several Cell Cycle-Associated and Chromatin Assembly-Associated Genes Previously, we found that HMGB3 facilitates transcription of the DNA damage response kinases, ATR CHK1 30 43 44 Figure 5 Supplementary Tables S1 and S2 Figure 5 p p p p p p p p p p p 3. Discussion HMGB3 is an architectural protein with the potential to influence DNA damage repair via binding to and bending DNA [ 18 18 7 8 9 10 27 8 9 10 29 27 45 46 27 47 48 30 31 32 33 34 Here, we provide evidence for a role of HMGB3 in DNA damage processing and uncover new evidence for how HMGB3 may be contributing to cisplatin resistance in ovarian cancer cells. Interestingly, our results suggest that HMGB3 plays only a minor role in NER, which is in contrast to the substantial evidence for its family member, HMGB1, being an NER cofactor [ 7 8 9 10 Figure 6 We first investigated a potential role for HMGB3 in NER, given the structural similarity between HMGB3 and HMGB1 [ 18 8 8 Moreover, mutagenesis assays revealed that with HMGB1 knockout in MEFs, the mutation frequencies increased in response to UV damage [ 8 A potential role for HMGB3 in ICL repair was investigated as well. HMGB1 has been shown to be involved in ICL repair, albeit through NER, and HMGB3 has also been implicated in ICL repair in the case of site-directed psoralen-induced ICLs [ 30 30 49 10 Since HMGB3 appears to be involved in ICL processing, likely not via NER, but rather through DSB repair pathways, we investigated the potential role(s) of HMGB3 in several DSB repair pathways. First, we found an increased sensitivity to zeocin (a DSB-inducing agent) in HMGB3-depleted U2OS cells compared to WT U2OS cells. Further, we observed that with HMGB3 depletion, SSA is less efficient in processing ICLs. In addition, HMGB3 depletion resulted in a decrease in the frequency of HDR, generally considered an error-free DSB repair process. If there is a decrease in HDR following HMGB3 depletion, then an increase in the number of large deletions as seen from mutation screening could result if a more error-generating pathway, such as SSA, was used as an alternative pathway to process DSBs, causing a pathway shift to occur [ 38 50 38 50 The role of HMGB3 in response to treatment with the chemotherapeutic drug, cisplatin, was further investigated by observing foci formation as a function of time and subsequently removal of cisplatin-adduct containing DNA via slot blot assays. Foci formation of HMGB3 in response to cisplatin treatment indicates a response in the nucleus of HMGB3 to DNA damage. The slot blot data support this, indicating that cisplatin-specific DNA damage removal is significantly delayed in HMGB3-depleted chemoresistant A2780/CP70 ovarian cancer cells. These data are consistent with our previously published results, supporting a role for HMGB3 in cisplatin resistance [ 30 As mentioned above, differences in the expression of groups of genes were observed in the GO analysis of biological processes between the WT and HMGB3 knockout cells. In addition to an overall downregulation of cell cycle-associated genes, there are also indications from the GO analysis that genes associated with chromatin organization could be impacted by HMGB3, consistent with HMGB3 being an architectural protein, and consistent with the relaxed chromatin appearance in HMGB3-depleted cells, as seen in the metaphase spreads. The result that chromatin organization genes are impacted as a function of HMGB3 could also indicate that HMGB3 may be influencing DNA damage repair in a more indirect manner via transcriptional regulation. In fact, HMGB1 and HMGB2 have previously been described to act in conjunction with transcription factors, including p53 51 52 ATR CHK1 30 23 53 54 55 34 56 57 In conclusion, HMGB3 appears to be involved in ICL and DSB processing in human cells, a novel finding for this protein, in a fashion that is distinct from that of HMGB1, as the role for HMGB3 in NER appears to be minimal. This is a notable result, considering the structural and sequence similarities between the two proteins. Moreover, additional insight was gained into the potential mechanism(s) for how HMGB3 impacts cisplatin resistance by possibly facilitating more efficient DNA adduct removal, and into the effects of HMGB3 on the modulation of gene expression. Future investigation on how HMGB3 is involved in ICL and DSB repair, and subsequently, drug resistance in cancer cells, may allow for the development of improved therapies for cancer treatment and to improve the quality of life of cancer patients. 4. Materials and Methods Cell Culture and siRNA Transfection: The human U2OS knockout clones, and corresponding wild-type (WT) cells, were grown in McCoy’s 5A media (Iwakata and Grace modified) with L. Glutamine, 10% FBS, and 1% Pen-Strep (Cat #10-050-CV, Corning Inc., Corning, NY, USA), according to ATCC guidelines, in a 37 °C incubator (5% CO 2 10 30 30 10 30 Isolation of HMGB3 KO Clones: Human U2OS cells were obtained (Synthego, Redwood City, CA, USA), pre-treated with CRISPR-Cas9 targeting of HMGB3 L34969 HMGB3 Clonogenic Assays: Cells were seeded in 60 mm cell culture dishes, left in the 37 °C incubator overnight to adhere, and irradiated the following day with either UVC (254 nm) at a dose of 3 J/m 2 2 2 2 p Cell Line Construction and Induction of DNA Double-Strand Breaks: A NHEJ reporter construct (IRES-TK-EGFPKV) was built in-house based on the IRES-TK-EGFP construct reported by [ 42 For an HR reporting system, we obtained U2OS cells containing the DR-GFP reporter substrate [ 40 58 −7 Slot Blot Assays: Cells were seeded in 60 mm petri dishes and left overnight to adhere at 37 °C. The plated cells were then treated either with UVC at a dose of 3 J/m 2 2 30 59 2 2 p Mutagenesis Assays: Cells were either seeded in 60 mm petri dishes and left overnight at 37 °C to adhere for the HMGB3 knockout cells or a reverse transfection was performed while plating, followed the next day by a forward transfection for the samples undergoing HMGB3 knockdown (as previously described [ 10 2 10 Dpn1 E. coli p TagSeq Sample Preparation 43 44 Gene Expression Analysis Methods Experimental Libraries WT KO1 KO2 KO3 TagSeq Library Preparation: Library preparation and sequencing for TagSeq [ 43 44 Sequence Data Pre-processing: FASTQ datasets were post-processed [ 60 61 62 Alignment: Single-end pseudo-alignment was performed against the human transcriptome (GENCODE [ 63 64 Differential Gene Expression Analysis: Downstream analysis of transcript abundance data was performed in R [ 65 66 67 68 p Gene Ontology (GO) Analysis: Gene ontology (GO) analyses were performed using R packages topGO [ 69 70 71 72 p p p p 73 Metaphase Spreads: To visualize the chromosomal aberrations induced by ICLs, we performed metaphase spreads on cells treated with 10 −9 2 2 2 Single-strand Annealing Mutation-Reporter Assays: To determine the effect of HMGB protein depletion in U2OS, XPA- and XPF-deficient cells, 2 µg of plasmids containing TFO-directed ICLs or control plasmids were transfected using GenePORTER (Invitrogen) transfection reagent following the second round of HMGB1 or control siRNA transfections as per the manufacturer’s suggestions. Mutagenesis assays were performed as described (Christensen et al., 2004, Mol. Carcinog. [ 37 DpnI supF supF E. coli supF supF p Homologous Recombination and NHEJ GFP Reporter Assays: A NHEJ reporter construct (IRES-TK-EGFPKV) was built in-house based on a previously reported construct, IRES-TK-EGFP [ 42 Herpes simplex virus-thymidine kinase HSV-TK I-SceI 40 I-SceI 58 Foci Formation Detection HMGB3 Acknowledgments Thank you to the Vasquez Lab for valuable input and discussions over the years that contributed to this work. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/genes16091044/s1 10 74 Author Contributions Conceptualization, J.D., A.M. and K.M.V.; methodology, J.D., A.M., W.R., A.B. and K.M.V.; formal analysis, J.D., A.M., W.R. and A.B.; investigation, J.D., A.M., W.R. and A.B.; resources, K.M.V.; writing—original draft preparation, J.D., A.M. and A.B.; writing—review and editing, J.D., A.M. and K.M.V.; visualization, J.D., A.M. and A.B.; supervision, K.M.V.; project administration, K.M.V.; funding acquisition, K.M.V. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Data Availability Statement The original data presented in the study are openly available in the NCBI Gene Expression Omnibus under accession number GSE285696 Conflicts of Interest Author Anirban Mukherjee was employed by the company Refeyn Inc. The remaining authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Abbreviations The following abbreviations are used in this manuscript: HMGB3 High Mobility Group Box Protein 3 HMGB1 High Mobility Group Box Protein 1 NER Nucleotide excision repair ICL DNA interstrand crosslink pTFO-ICLs Triplex-directed psoralen ICLs DSB Double-strand break 6-4 PPs 6-4 photoproducts CPDs Cyclobutene pyrimidine dimers SSA Single-strand annealing HDR Homology-directed repair NHEJ Non-homologous end joining FDR False discovery rate GO Gene Ontology WT Wild type MMR Mismatch repair BER Base excision repair MLH1 MutL Protein Homolog 1 EXO-1 Exonuclease 1 APE1 Apurinic/apyrimidinic endonuclease MEFs Mouse embryonic fibroblasts CDK cyclin-dependent kinase References 1. Hoeijmakers J.H. DNA damage, aging, and cancer N. Engl. J. Med. 2009 361 1475 1485 10.1056/NEJMra0804615 19812404 2. Yousefzadeh M. Henpita C. Vyas R. Soto-Palma C. Robbins P. Niedernhofer L. DNA damage—How and why we age? eLife 2021 10 e62852 10.7554/eLife.62852 33512317 PMC7846274 3. Burcham P.C. Internal hazards: Baseline DNA damage by endogenous products of normal metabolism Mutat. Res./Genet. Toxicol. Environ. Mutagen. 1999 443 11 36 10.1016/S1383-5742(99)00008-3 10415429 4. Basu A.K. DNA damage, mutagenesis and cancer Int. J. Mol. Sci. 2018 19 970 10.3390/ijms19040970 29570697 PMC5979367 5. Martin L.P. Hamilton T.C. Schilder R.J. Platinum resistance: The role of DNA repair pathways Clin. Cancer Res. 2008 14 1291 1295 10.1158/1078-0432.CCR-07-2238 18316546 6. Dilruba S. Kalayda G.V. Platinum-based drugs: Past, present and future Cancer Chemother. Pharmacol. 2016 77 1103 1124 10.1007/s00280-016-2976-z 26886018 7. Reddy M.C. Christensen J. Vasquez K.M. Interplay between human high mobility group protein 1 and replication protein A on psoralen-cross-linked DNA Biochemistry 2005 44 4188 4195 10.1021/bi047902n 15766246 8. Lange S.S. Mitchell D.L. Vasquez K.M. High mobility group protein B1 enhances DNA repair and chromatin modification after DNA damage Proc. Natl. Acad. Sci. USA 2008 105 10320 10325 10.1073/pnas.0803181105 18650382 PMC2492475 9. Lange S.S. Reddy M.C. Vasquez K.M. Human HMGB1 directly facilitates interactions between nucleotide excision repair proteins on triplex-directed psoralen interstrand crosslinks DNA Repair 2009 8 865 872 10.1016/j.dnarep.2009.04.001 19446504 PMC2700216 10. Mukherjee A. Vasquez K.M. HMGB1 interacts with XPA to facilitate the processing of DNA interstrand crosslinks in human cells Nucleic Acids Res. 2016 44 1151 1160 10.1093/nar/gkv1183 26578599 PMC4756816 11. Scharer O.D. Nucleotide excision repair in eukaryotes Cold Spring Harb. Perspect. Biol. 2013 5 a012609 10.1101/cshperspect.a012609 24086042 PMC3783044 12. Vasquez K.M. Targeting and processing of site-specific DNA interstrand crosslinks Environ. Mol. Mutagen. 2010 51 527 539 10.1002/em.20557 20196133 PMC2895014 13. Muniandy P.A. Liu J. Majumdar A. Liu S.-t. Seidman M.M. DNA interstrand crosslink repair in mammalian cells: Step by step Crit. Rev. Biochem. Mol. Biol. 2010 45 23 49 10.3109/10409230903501819 20039786 PMC2824768 14. Wood R.D. Mammalian nucleotide excision repair proteins and interstrand crosslink repair Environ. Mol Mutagen 2010 51 520 526 10.1002/em.20569 20658645 PMC3017513 15. Deans A.J. West S.C. DNA interstrand crosslink repair and cancer Nat. Rev. Cancer 2011 11 467 480 10.1038/nrc3088 21701511 PMC3560328 16. Goodwin G.H. Sanders C. Johns E.W. A new group of chromatin-associated proteins with a high content of acidic and basic amino acids Eur. J. Biochem. 1973 38 14 19 10.1111/j.1432-1033.1973.tb03026.x 4774120 17. McCauley M.J. Zimmerman J. Maher L.J. 3rd Williams M.C. HMGB binding to DNA: Single and double box motifs J. Mol. Biol. 2007 374 993 1004 10.1016/j.jmb.2007.09.073 17964600 PMC2117627 18. Stros M. HMGB proteins: Interactions with DNA and chromatin Biochim. Biophys. Acta 2010 1799 101 113 10.1016/j.bbagrm.2009.09.008 20123072 19. Murphy F.V. IV Sweet R.M. Churchill M.E.A. The structure of a chromosomal high mobility group protein–DNA complex reveals sequence-neutral mechanisms important for non-sequence-specific DNA recognition EMBO J. 1999 18 6610 6618 10.1093/emboj/18.23.6610 10581235 PMC1171724 20. Calogero S. Grassi F. Aguzzi A. Voigtlander T. Ferrier P. Ferrari S. Bianchi M.E. The lack of chromosomal protein Hmg1 does not disrupt cell growth but causes lethal hypoglycaemia in newborn mice Nat. Genet. 1999 22 276 280 10.1038/10338 10391216 21. Ronfani L. Ferraguti M. Croci L. Ovitt C.E. Scholer H.R. Consalez G.G. Bianchi M.E. Reduced fertility and spermatogenesis defects in mice lacking chromosomal protein Hmgb2 Development 2001 128 1265 1273 10.1242/dev.128.8.1265 11262228 22. Nemeth M.J. Curtis D.J. Kirby M.R. Garrett-Beal L.J. Seidel N.E. Cline A.P. Bodine D.M. Hmgb3: An HMG-box family member expressed in primitive hematopoietic cells that inhibits myeloid and B-cell differentiation Blood 2003 102 1298 1306 10.1182/blood-2002-11-3541 12714519 23. Nemeth M.J. Kirby M.R. Bodine D.M. Hmgb3 regulates the balance between hematopoietic stem cell self-renewal and differentiation Proc. Natl. Acad. Sci. USA 2006 103 13783 13788 10.1073/pnas.0604006103 16945912 PMC1564268 24. Yang H. Wang H. Czura C.J. Tracey K.J. The cytokine activity of HMGB1 J. Leukoc. Biol. 2005 78 1 8 10.1189/jlb.1104648 15734795 25. Yamada S. Maruyama I. HMGB1, a novel inflammatory cytokine Clin. Chim. Acta 2007 375 36 42 10.1016/j.cca.2006.07.019 16979611 26. Wang H. Yang H. Tracey K. Extracellular role of HMGB1 in inflammation and sepsis J. Intern. Med. 2004 255 320 331 10.1111/j.1365-2796.2003.01302.x 14871456 27. Mandke P. Vasquez K.M. Interactions of high mobility group box protein 1 (HMGB1) with nucleic acids: Implications in DNA repair and immune responses DNA Repair 2019 83 102701 10.1016/j.dnarep.2019.102701 31563843 PMC6906087 28. Vaccari T. Beltrame M. Ferrari S. Bianchi M. Hmg4, a New Member of theHmg1/2Gene Family Genomics 1998 49 247 252 10.1006/geno.1998.5214 9598312 29. Lange S.S. Vasquez K.M. HMGB1: The jack-of-all-trades protein is a master DNA repair mechanic Mol. Carcinog. 2009 48 571 580 10.1002/mc.20544 19360789 PMC2856944 30. Mukherjee A. Huynh V. Gaines K. Reh W.A. Vasquez K.M. Targeting the high-mobility group box 3 protein sensitizes chemoresistant ovarian cancer cells to cisplatin Cancer Res. 2019 79 3185 3191 10.1158/0008-5472.CAN-19-0542 31061066 PMC6606364 31. Gu J. Xu T. Huang Q.-H. Zhang C.-M. Chen H.-Y. HMGB3 silence inhibits breast cancer cell proliferation and tumor growth by interacting with hypoxia-inducible factor 1α Cancer Manag. Res. 2019 11 5075 10.2147/CMAR.S204357 31213919 PMC6549700 32. Guo S. Wang Y. Gao Y. Zhang Y. Chen M. Xu M. Hu L. Jing Y. Jing F. Li C. Knockdown of high mobility group-box 3 (HMGB3) expression inhibits proliferation, reduces migration, and affects chemosensitivity in gastric cancer cells Med. Sci. Monit. Int. Med. J. Exp. Clin. Res. 2016 22 3951 10.12659/MSM.900880 27774979 PMC5081235 33. Li Z. Zhang Y. Sui S. Hua Y. Zhao A. Tian X. Wang R. Guo W. Yu W. Zou K. Targeting HMGB3/hTERT axis for radioresistance in cervical cancer J. Exp. Clin. Cancer Res. 2020 39 243 10.1186/s13046-020-01737-1 33187536 PMC7664109 34. Chen X. Zeng L. Ginkgo biloba extract 761 enhances 5-fluorouracil chemosensitivity in colorectal cancer cells through regulation of high mobility group-box 3 expression Am. J. Transl. Res. 2018 10 1773 1783 30018718 PMC6038068 35. Wen B. Wei Y.-t. Zhao K. The role of high mobility group protein B3 (HMGB3) in tumor proliferation and drug resistance Mol. Cell. Biochem. 2021 476 1729 1739 10.1007/s11010-020-04015-y 33428061 36. Mukherjee A. Vasquez K.M. Targeting chromosomal architectural HMGB proteins could be the next frontier in cancer therapy Cancer Res. 2020 80 2075 2082 10.1158/0008-5472.CAN-19-3066 32152151 PMC7272294 37. Christensen L.A. Conti C.J. Fischer S.M. Vasquez K.M. Mutation frequencies in murine keratinocytes as a function of carcinogenic status Mol. Carcinog. Publ. Coop. Univ. Tex. MD Anderson Cancer Cent. 2004 40 122 133 10.1002/mc.20026 15170817 38. Ceccaldi R. Rondinelli B. D’Andrea A.D. Repair Pathway Choices and Consequences at the Double-Strand Break Trends Cell Biol. 2016 26 52 64 10.1016/j.tcb.2015.07.009 26437586 PMC4862604 39. Liu Y. Nairn R.S. Vasquez K.M. Processing of triplex-directed psoralen DNA interstrand crosslinks by recombination mechanisms Nucleic Acids Res. 2008 36 4680 4688 10.1093/nar/gkn438 18628293 PMC2504320 40. Pierce A.J. Johnson R.D. Thompson L.H. Jasin M. XRCC3 promotes homology-directed repair of DNA damage in mammalian cells Genes Dev. 1999 13 2633 2638 10.1101/gad.13.20.2633 10541549 PMC317094 41. Cavallo F. Caggiano C. Jasin M. Barchi M. Assessing Homologous Recombination and Interstrand Cross-Link Repair in Embryonal Carcinoma Testicular Germ Cell Tumor Cell Lines Methods Mol. Biol. 2021 2195 113 123 10.1007/978-1-0716-0860-9_9 32852761 42. Ogiwara H. Ui A. Otsuka A. Satoh H. Yokomi I. Nakajima S. Yasui A. Yokota J. Kohno T. Histone acetylation by CBP and p300 at double-strand break sites facilitates SWI/SNF chromatin remodeling and the recruitment of non-homologous end joining factors Oncogene 2011 30 2135 2146 10.1038/onc.2010.592 21217779 43. Lohman B.K. Weber J.N. Bolnick D.I. Evaluation of TagSeq, a reliable low-cost alternative for RNAseq Mol. Ecol. Resour. 2016 16 1315 1321 10.1111/1755-0998.12529 27037501 44. Meyer E. Aglyamova G. Matz M. Profiling gene expression responses of coral larvae ( Acropora millepora Mol. Ecol. 2011 20 3599 3616 10.1111/j.1365-294X.2011.05205.x 21801258 45. Yuan F. Gu L. Guo S. Wang C. Li G.-M. Evidence for involvement of HMGB1 protein in human DNA mismatch repair J. Biol. Chem. 2004 279 20935 20940 10.1074/jbc.M401931200 15014079 46. Zhang Y. Yuan F. Presnell S.R. Tian K. Gao Y. Tomkinson A.E. Gu L. Li G.-M. Reconstitution of 5′-directed human mismatch repair in a purified system Cell 2005 122 693 705 10.1016/j.cell.2005.06.027 16143102 47. Prasad R. Liu Y. Deterding L.J. Poltoratsky V.P. Kedar P.S. Horton J.K. Kanno S.-I. Asagoshi K. Hou E.W. Khodyreva S.N. HMGB1 is a cofactor in mammalian base excision repair Mol. Cell 2007 27 829 841 10.1016/j.molcel.2007.06.029 17803946 PMC2799894 48. Liu Y. Prasad R. Wilson S.H. HMGB1: Roles in base excision repair and related function Biochim. Biophys. Acta (BBA)—Gene Regul. Mech. 2010 1799 119 130 10.1016/j.bbagrm.2009.11.008 PMC2818529 20123074 49. Köberle B. Tomicic M.T. Usanova S. Kaina B. Cisplatin resistance: Preclinical findings and clinical implications Biochim. Biophys. Acta (BBA)—Rev. Cancer 2010 1806 172 182 10.1016/j.bbcan.2010.07.004 20647037 50. Blasiak J. Single-strand annealing in cancer Int. J. Mol. Sci. 2021 22 2167 10.3390/ijms22042167 33671579 PMC7926775 51. Ueda T. Yoshida M. HMGB proteins and transcriptional regulation Biochim. Biophys. Acta—Gene Regul. Mech. 2010 1799 114 118 10.1016/j.bbagrm.2009.11.005 20123073 52. Stros M. Ozaki T. Bačíková A. Kageyama H. Nakagawara A. HMGB1 and HMGB2 cell-specifically down-regulate the p53- and p73-dependent sequence-specific transactivation from the human Bax gene promoter J. Biol. Chem. 2002 277 7157 7164 10.1074/jbc.M110233200 11748232 53. Chen F. Sun F. Liu X. Shao J. Zhang B. Glaucocalyxin A Inhibits the Malignant Progression of Epithelial Ovarian Cancer by Affecting the MicroRNA-374b-5p/HMGB3/Wnt-β-Catenin Pathway Axis Front. Oncol. 2022 12 955830 10.3389/fonc.2022.955830 35912216 PMC9329791 54. Song T. Hou X. Lin B. Microrna-758 inhibits cervical cancer cell proliferation and metastasis by targeting hmgb3 through the wnt/β-catenin signaling pathway Oncol. Lett. 2019 18 1786 1792 10.3892/ol.2019.10470 31423246 PMC6607054 55. Zhuang S. Yu X. Lu M. Li Y. Ding N. Ding Y. High mobility group box 3 promotes cervical cancer proliferation by regulating Wnt/β-catenin pathway J. Gynecol. Oncol. 2020 31 e91 10.3802/jgo.2020.31.e91 33078596 PMC7593223 56. Zhang Z. Chang Y. Zhang J. Lu Y. Zheng L. Hu Y. Zhang F. Li X. Zhang W. Li X. HMGB3 promotes growth and migration in colorectal cancer by regulating WNT/β-catenin pathway PLoS ONE 2017 12 e0179741 10.1371/journal.pone.0179741 28678825 PMC5497964 57. Gao S. Zhang X. Bai W. Wang J. Jiang B. Circ-IGF1R Affects the Progression of Colorectal Cancer by Activating the miR-362-5p/HMGB3-Mediated Wnt/β-Catenin Signal Pathway Biochem. Genet. 2023 61 1210 1229 10.1007/s10528-022-10316-2 36542208 58. Shahar O. Ram E. Shimshoni E. Hareli S. Meshorer E. Goldberg M. Live imaging of induced and controlled DNA double-strand break formation reveals extremely low repair by homologous recombination in human cells Oncogene 2012 31 3495 3504 10.1038/onc.2011.516 22105360 59. Park J.-M. Kang T.-H. DNA Slot Blot Repair Assay Bio-Protoc 2015 5 e1453 10.21769/BioProtoc.1453 60. Matz M. Available online: https://github.com/z0on/tag-based_RNAseq/ (accessed on 15 January 2023) 61. Andrews S. FastQC Available online: https://www.bioinformatics.babraham.ac.uk/projects/fastqc/ (accessed on 15 January 2023) 62. Ewels P. Magnusson M. Lundin S. Käller M. MultiQC: Summarize analysis results for multiple tools and samples in a single report Bioinformatics 2016 32 3047 3048 10.1093/bioinformatics/btw354 27312411 PMC5039924 63. Frankish A. Diekhans M. Ferreira A.M. Johnson R. Jungreis I. Loveland J. Mudge J.M. Sisu C. Wright J. Armstrong J. GENCODE reference annotation for the human and mouse genomes Nucleic Acids Res 2019 47 D766 D773 10.1093/nar/gky955 30357393 PMC6323946 64. Bray N.L. Pimentel H. Melsted P. Pachter L. Near-optimal probabilistic RNA-seq quantification Nat. Biotechnol. 2016 34 525 527 10.1038/nbt.3519 27043002 65. R Core Team R: A Language and Environment for Statistical Computing R Foundation for Statistical Computing Vienna, Austria 2013 66. Love M.I. Anders S. Kim V. Huber W. RNA-Seq workflow: Gene-level exploratory analysis and differential expression F1000Research 2015 4 10.12688/f1000research.7035.1 26674615 PMC4670015 67. Soneson C. Love M.I. Robinson M.D. Differential analyses for RNA-seq: Transcript-level estimates improve gene-level inferences F1000Research 2015 4 1521 10.12688/f1000research.7563.1 26925227 PMC4712774 68. Love M.I. Huber W. Anders S. Moderated estimation of fold change and dispersion for RNA-seq data with DESeq2 Genome Biol. 2014 15 550 10.1186/s13059-014-0550-8 25516281 PMC4302049 69. Alexa A. Rahnenführer J. Gene set enrichment analysis with topGO Bioconductor Improv 2009 27 1 26 70. Alexa A. Rahnenfuhrer J. Enrichment Analysis for Gene Ontology Available online: https://bioconductor.org/packages/release/bioc/html/topGO.html (accessed on 15 January 2023) 71. Wright R.M. Aglyamova G.V. Meyer E. Matz M.V. Gene expression associated with white syndromes in a reef building coral, Acropora hyacinthus BMC Genom. 2015 16 371 10.1186/s12864-015-1540-2 PMC4425862 25956907 72. Matz M. Available online: https://github.com/z0on/GO_MWU (accessed on 15 January 2023) 73. Carbon S. Mungall C. Gene Ontology Data Reference Available online: https://zenodo.org/record/7504845 (accessed on 15 January 2023) 74. Balana A.T. Mukherjee A. Nagpal H. Moon S.P. Fierz B. Vasquez K.M. Pratt M.R. O-GlcNAcylation of high mobility group box 1 (HMGB1) alters its DNA binding and DNA damage processing activities J. Am. Chem. Soc. 2021 143 16030 16040 10.1021/jacs.1c06192 34546745 PMC8636066 Figure 1 HMGB3 knockout minimally decreases cell survival in response to UVC irradiation in human U2OS cell lines. ( A B 2 2 2 2 2 2 2 p 2 2 C 2 D 2 p E 2 F 2 G 2 SupF 8 10 37 H p p p p Figure 2 HMGB3 depletion in human U2OS cells results in mutagenic TFO-directed ICL processing and increases chromosomal anomalies. ( A 10 37 SupF B C C D E −9 2 F p Figure 3 HMGB3 depletion impacts DNA double-strand break repair processes. ( A B C 39 Figure 1 39 D Figure 1 40 Figure 1 41 E 42 p Figure 4 HMGB3 forms foci upon cisplatin treatment in A2780 human ovarian cancer cells, and HMGB3 depletion reduces cisplatin adduct removal from cisplatin-resistant A2780/CP70 human ovarian cancer cells. ( A B C D E p t F G p Figure 5 TagSeq reveals that HMGB3 knockout alters the expression of genes associated with the cell cycle and chromatin organization in human U2OS cells. ( A B ▲ Figure 6 The emerging roles of HMGB3 in multiple cellular processes. HMGB3 is involved in the mutagenic processing of ICLs, likely through a DSB repair mechanism, and is associated with genomic stability. HMGB3 is also involved in cisplatin–DNA adduct processing in ovarian cancer cells. In addition, it is involved in checkpoint signaling following DNA damage in ovarian cancer cells. Further, expression of many genes was substantially modified by either up- or downregulation in HMGB3 knockout U2OS cells. genes-16-01044-t001_Table 1 Table 1 Mutation spectra resulting from processing of a UVC-treated mutation reporter (psp189) in human U2OS cells as a function of HMGB3 knockout in three clones and wild-type U2OS cells. Cell Line Base Substitution Insertion Single Nucleotide Deletion Large Deletion Genomic Fusions Total Sequenced Wild Type 92% - - 8% - 20 HMGB3 KO Cl.#2 92% - - 8% - 10 HMGB3 KO Cl.#5 100% - - - - 10 HMGB3 KO Cl.#6 100% - - - - 10 genes-16-01044-t002_Table 2 Table 2 Mutation spectra resulting from TFO-directed ICL processing in human U2OS cells as a function of HMGB3 depletion. Depletion of Base Substitution Insertion Single Nucleotide Deletion Large Deletion Genomic Fusions Total Sequenced No depletion 100% - - - - 20 HMGB3 31.5% 21% 10.2% 36.3% - 20 ",
  "metadata": {
    "Title of this paper": "O-GlcNAcylation of high mobility group box 1 (HMGB1) alters its DNA binding and DNA damage processing activities",
    "Journal it was published in:": "Genes",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470105/"
  }
}