{
  "title": "Paper_481",
  "abstract": "pmc Gut Microbes Gut Microbes 1365 gmic Gut Microbes 1949-0976 1949-0984 Taylor & Francis PMC12482443 PMC12482443.1 12482443 12482443 41021306 10.1080/19490976.2025.2564765 2564765 1 Version of Record Review Article Review Article Metabolism of inositol derivatives by the gut microbiome H. JESSEN AND T. P. N. BUI GUT MICROBES https://orcid.org/0000-0002-1025-9484 Jessen Henning a Writing – review & editing https://orcid.org/0000-0001-5366-5960 Bui Thi Phuong Nam b * Writing – original draft a Institute of Organic Chemistry & Centre for Integrative Biological Signaling Studies (CIBSS), University of Freiburg Freiburg Germany b Department of Experimental Vascular Medicine, Amsterdam University Medical Center Amsterdam the Netherlands CONTACT t.p.n.bui@amsterdamumc.nl Department of Experimental Vascular Medicine, Amsterdam University Medical Center Amsterdam the Netherlands 29 9 2025 2025 17 1 477378 2564765 29 09 2025 01 10 2025 01 10 2025 26 6 2025 22 8 2025 16 9 2025 MPS 26 9 2025 © 2025 The Author(s). Published with license by Taylor & Francis Group, LLC. 2025 The Author(s) https://creativecommons.org/licenses/by/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution License ( http://creativecommons.org/licenses/by/4.0/ Abstract The gut microbiome harbors immense metabolic capacity, much of which is still being uncovered. Recent discoveries have highlighted the ability of gut microbes to metabolize inositol-derived compounds, including free inositols and their phosphorylated derivatives, inositol phosphates. While these compounds are abundant in plant-based diets, our understanding of the specific bacterial taxa involved and their metabolic pathways has only recently begun to emerge. Intriguingly, inositols and inositol phosphates have been associated with a range of health benefits. Although some effects have been attributed to direct absorption or chemical interactions within the host, increasing evidence points to the gut microbiota as a key mediator in unlocking their therapeutic potential. This review emphasizes the microbial metabolism of inositol derivatives, highlights the intersection between diet, microbial function, and host health, and discusses their implications for nutrition and future therapeutic strategies. Keywords The gut microbiome inositol inositol phosphates phytate short chain fatty acids phytase ZonMw 10.13039/501100001826 This work was supported by a personal Amsterdam UMC postdoc bridging grant and a personal ZONMW VENI grant 2022 [09150162210057] and Amsterdam UMC Fellowship to T.P.N.B. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction The human gastrointestinal (GI) tract harbors trillions of microbial cells, forming a dynamic ecosystem that functions as an integral organ. These microbes play critical roles in maintaining health and modulating disease processes. 1-3 4 , 5 6-10 11 12 , 13 7 14 Diet is a major determinant of gut microbiome composition and function, thereby significantly influencing human health. 15-17 18 , 19 20 21 6 Considerable research focused on the gut microbial metabolism of fibers 22-24 25 Prevotella, 26 Bifidobacterium 27 Roseburia, 28 Ruminococcus 26 29 Eubacterium Anaerostipes 22 , 30 31 32 33 Inositols and their derivatives are abundant components of both the human diet and mammalian cells. 34 , 35 36-38 Dietary inositol derivative intake and its absorption/secretion Inositol derivatives (mostly myo 39 Inositols epi, cis-, neo-, allo-, scyllo-, muco-, myo-, D-chiro- L-chiro- myo- 40 myo 41 myo 42 , 43 myo 44 Inositol phosphates myo 45 46 34 47 48 34 49 A pharmacokinetic study using radiolabelled C 14 50 6 5 4 3 2 6 51 52 53 54 55 56 34 Despite the variation in phytate excretion reported across human studies, there is a general consensus that dietary phytate is primarily metabolized in the gut. Population-level differences in phytate excretion likely reflect both cultural dietary pattern and interindividual variation in the gut microbiome composition and metabolic capacity. Diet is a well-established driver of microbiome composition and functions, 57 , 58 59 Inositol fermentation by gut bacteria To date, several bacterial species have been reported to ferment myo Figure 1 Aerobacter aerogenes, myo keto 2 2 60 myo 2 Bacillus subtilis 61 Lactobacillus casei 62 myo 63 64 myo L. casei B. subtilis myo Figure 1. Postulation of microbial inositol and phytate degradation pathway in the human gut. Dashed row: multiple steps. The gray box for the reaction steps found in particular bacterial species at the bottom left. Figure created with BioRender.com Recently, it was discovered that Anaerostipes myo 64 Anaerostipes rhamonosivorans myo chiro Anaerostipes hiro myo myo Anaerostipes Notably, not all Anaerostipes myo 64 Anaerostipes hadrus myo myo Anaerostipes myo Emerging evidence suggests that certain gut bacteria are capable of converting myo 65 Dysosmobacter welbionis Intestinibacillus massilensis myo It was recently reported that Mitsuokella myo 59 Mitsuokella Mitsuokella jalaludinii Salmonella enterica 66 Dietary inositol phosphate metabolism by gut bacteria Initial dephosphorylation of phytate by microbial phytases Unlike inositols, dietary inositol phosphates serve as reservoirs for both inorganic phosphate and fermentable carbon for microbial fermentation in the gut. The microbial metabolism of dietary inositol phosphates, particularly phytate, represents a critical yet understudied aspect of diet‒microbiota‒host interactions. To utilize phytate, bacteria must first hydrolyse it into lower phosphorylated inositol phosphates and free phosphate via the action of phytases. These enzymes are classified based on their initial site of cleavage on the inositol ring: 3-phytases (C1 or C3), 6-phytases (C6), and 5-phytases (C5). While 3-phytases are commonly found in bacteria and fungi, 67 , 68 Selenomonas ruminantium 69 Several anaerobic ruminal bacteria have been reported to exhibit strong phytase activity, including Selenomonas ruminatium Mitsuokella 70 S. ruminantium 71 M. jalaludinii Mitsuokella multiacidus, 72 , 73 B. subtilis 74 myo by Aspergillus niger 75 Although numerous gut bacteria have been reported to exhibit phytase activities, their capacities to hydrolyse phytate vary significantly. For example, Bacillus spp. Escherichia coli Bifidobacterium Lactobacillus 76-79 Mitsuokella myo 59 , 72 , 73 Bifidobacteria Lactobacillus 3 77 , 80 81 Bifidobacterium 76 Bacteroides thetaiotaomicron 3 3 82 E. coli 3 3 3, 3 3 78 Bacillus 3 3 3, 79 83 M. jalaludinii 59 59 , 64 Mitsuokella Mitsuokella Figure 2 M. jalaludinii E. coli 73 2+ 2+ + 2+ 3+ 2+ Figure 2. Phylogeny of phytase. A phylogenetic tree constructed using predicted phytases from M. jalaludinii M. multacida 82 % Due to its highly polyanionic nature, phytate is unable to cross bacterial membranes. Consequently, bacteria must either secrete extracellular phytase or anchor the enzyme in their outer membrane to access phytate. Certain gut bacteria, such as B. thetaiotaomicron 82 3 E. coli 78 Mitsuokella multidacidus S. ruminatium 72 S. ruminatium 69 M. jalaludinii Mitsuokella Mitsuokella 59 42 59 SCFA production from microbial cross-feeding Complete degradation of phytate by the human gut microbiota results in the production of SCFAs, primarily propionate, butyrate and acetate. Interestingly, distinct gut microbiomes exhibit divergent fermentative capacities, converting phytate to either propionate and acetate or butyrate and acetate. 59 , 64 Ruminococcaceae, Mitsuokella Butyricicoccus Butyricicoccus, Mitsuokella E. coli/Shigella 59 Mitsuokella n Mitsuokella Mitsuokella Prevotella 84 The microbial conversion of phytate to short-chain fatty acids within the gut microbiota requires metabolic cross-feeding between different bacterial species. 59,64 Mitsuokella the in vitro 59 M. jalaludinii Anaerostipes rhamnosivorans M. jalaludinii A. rhamnosivorans M. jalaludinii A. rhamnosivorans M. jalaludinii Mitsuokella Inositol lipid metabolism Gut bacteria not only use inositol phosphates as sources of carbon and energy but also incorporate them into the biosynthesis of membrane lipids, contributing to host‒microbe symbiosis. 39 85 Bacteroides 86 B. thetaiotaomicron myo de novo in vitro 39 Prevotella Health implications of microbial Inositol phosphate metabolism Health benefits from Inositol supplementation Inositols have been reported to promote metabolic health and ovarian functions in patients with polycystic ovary syndrome (PCOS). 87 , 88 89 7 A. rhamnosivorans myo 64 A. hadrus 90 myo Megamonas rupellensis myo 91 Anaerostipes 42 64 , 65 Medicinal effects for dietary phytate – what do we know Phytate, a naturally abundant compound in plant-based diets, has been extensively studied for its potential health benefits ( Figure 3 Figure 3. Overview of reported health effects of dietary phytate based on in vitro in vivo BioRender.com The first mechanism stems from the polyanionic structure of phytate, which enables it to chelate metal ions such as iron. This chelation can inhibit iron-mediated hydroxyl radical formation in vitro 92 93 in vivo 94 in vitro in vivo 95 in vitro in vivo 96 In vitro 97 98 96 99 100 101 One hypothesis suggests that oral phytate may exert systemic effects via increased circulating phytate. For example, phytate supplementation was shown to reduce plasma advanced glycation end products (AGEs), potentially through ion chelation, a critical co-factor of AGE formation. 102 34 103 While many in vivo in vitro 59 50 myo 104 Notably, the gut microbiome can convert 105 106 B. thetaiotaomicron 3 82 59 , 64 7 59 107 On the other hand, phytate has long been characterized as an antinutrient due to its strong mineral-binding capacity. 108 109 110 59 Conclusions and future perspectives Inositols and inositol phosphates are abundant dietary components that are associated with benefits to host immunity and metabolism. Emerging evidence suggests that these effects may not arise from direct absorption and action on target tissues, particularly in the case of phytate. Due to its highly polyanionic structure and lack of specific transporters, phytate is poorly absorbed in the gastrointestinal tract. This observation is supported by evidence demonstrating the gut microbiota’s efficient capacity to degrade dietary phytate, likely reflecting an evolutionary adaptation that allows gut microbes to utilize otherwise inaccessible nutrients for their own growth and survival. The microbial conversion of phytate to SCFAs, 3-hydroxypropionate and inositol phosphates may play a pivotal role in mediating the host benefits attributed to phytate and inositol. Further investigation into phytate-degrading microbial communities, especially within specific subpopulations such as vegetarians or individuals experiencing malnutrition, could guide the development of microbiome-targeted strategies to address mineral deficiencies and malnutrition. It is noteworthy that several phytate-degrading microorganisms can grow under low pH conditions, resembling those of the small intestine, where the majority of minerals and microelements are absorbed. Although concerns remain regarding the inhibitory effects of phytate on the absorption of minerals such as zinc and iron, the gut microbiome may represent a promising therapeutic target to mitigate these antinutritional effects by facilitating mineral release and absorption. Acknowledgments This work was supported by a personal Amsterdam UMC postdoc bridging grant and a personal ZONMW VENI grant 2022 [09150162210057] and Amsterdam UMC Fellowship to T.P.N.B. Disclosure of potential conflicts of interest No potential conflicts of interest were disclosed. References 1. Fan Y Pedersen O Gut microbiota in human metabolic health and disease Nat Rev Microbiol 2021 19 1 55 71 10.1038/s41579-020-0433-9 32887946 2. Guarner F Malagelada J-R Gut flora in health and disease Lancet 2003 361 9356 512 519 10.1016/S0140-6736(03)12489-0 12583961 3. Neish A Microbes in gastrointestinal health and disease Gastroenterology 2009 136 65 80 10.1053/j.gastro.2008.10.080 19026645 PMC2892787 4. Qin N Yang F Li A Prifti E Chen Y Shao L Guo J Le Chatelier E Yao J Wu L et al. Alterations of the human gut microbiome in liver cirrhosis Nature 2014 513 7516 59 64 10.1038/nature13568 25079328 5. Qin J Li Y Cai Z Zhu J Zhang F Liang S Guan Y Shen D Peng Y Jie Z et al. A metagenome-wide association study of gut microbiota in type 2 diabetes Nature 2012 490 7418 55 60 10.1038/nature11450 23023125 6. Dodd D Spitzer MH Van Treuren W Merrill BD Hryckowian AJ Higginbottom SK Le A Cowan TM Nolan GP Fischbach MA et al. A gut bacterial pathway metabolizes aromatic amino acids into nine circulating metabolites Nature 2017 551 7682 648 652 10.1038/nature24661 29168502 PMC5850949 7. Canfora EE JW Jocken EE Blaak Short-chain fatty acids in control of body weight and insulin sensitivity Nat Rev Endocrinol 2015 11 10 577 591 10.1038/nrendo.2015.128 26260141 8. Koh A De Vadder F Kovatcheva-Datchary P Bäckhed F From dietary fiber to host physiology: short-chain fatty acids as key bacterial metabolites Cell 2016 165 6 1332 1345 10.1016/j.cell.2016.05.041 27259147 9. LeBlanc JG Milani C de Giori GS Sesma F van Sinderen D Ventura M Bacteria as vitamin suppliers to their host: a gut microbiota perspective Curr Opin Biotechnol 2013 24 2 160 168 10.1016/j.copbio.2012.08.005 22940212 10. Wahlström A Sayin SI Marschall H Bäckhed F Intestinal crosstalk between bile acids and microbiota and its impact on host metabolism Cell Metab 2016 24 1 41 50 10.1016/j.cmet.2016.05.005 27320064 11. Donohoe DR Collins LB Wali A Bigler R Sun W Bultman SJ The Warburg effect dictates the mechanism of butyrate-mediated histone acetylation and cell proliferation Mol Cell 2012 48 4 612 626 10.1016/j.molcel.2012.08.033 23063526 PMC3513569 12. Brown AJ Goldsworthy SM Barnes AA Eilert MM Tcheang L Daniels D Muir AI Wigglesworth MJ Kinghorn I Fraser NJ et al. The orphan G protein-coupled receptors GPR41 and GPR43 are activated by propionate and other short chain carboxylic acids J Biol Chem 2003 278 13 11312 11319 10.1074/jbc.M211609200 12496283 13. Nilsson NE Kotarsky K Owman C Olde B Identification of a free fatty acid receptor, FFA2R, expressed on leukocytes and activated by short-chain fatty acids Biochem Biophys Res Commun 2003 303 4 1047 1052 10.1016/S0006-291X(03)00488-1 12684041 14. Singh N Gurav A Sivaprakasam S Brady E Padia R Shi H Thangaraju M Prasad PD Manicassamy S Munn DH et al. Activation of Gpr109a, receptor for niacin and the commensal metabolite butyrate, suppresses colonic inflammation and carcinogenesis Immunity 2014 40 1 128 139 10.1016/j.immuni.2013.12.007 24412617 PMC4305274 15. David LA Maurice CF Carmody RN Gootenberg DB Button JE Wolfe BE Ling AV Devlin AS Varma Y Fischbach MA et al. Diet rapidly and reproducibly alters the human gut microbiome Nature 2014 505 7484 559 563 10.1038/nature12820 24336217 PMC3957428 16. Valles-Colomer M Menni C Berry SE Valdes AM Spector TD Segata N Cardiometabolic health, diet and the gut microbiome: a meta-omics perspective Nat Med 2023 29 3 551 561 10.1038/s41591-023-02260-4 36932240 PMC11258867 17. Koropatkin NM Cameron EA Martens EC How glycan metabolism shapes the human gut microbiota Nat Rev Microbiol 2012 10 5 323 335 10.1038/nrmicro2746 22491358 PMC4005082 18. Li F Armet AM Korpela K Liu J Quevedo RM Asnicar F Seethaler B Rusnak TBS Cole JL Zhang Z et al. Cardiometabolic benefits of a non-industrialized-type diet are linked to gut microbiome modulation. Cell 2025 188 5 1226 1247.e18 10.1016/j.cell.2024.12.034 39855197 19. Cordova R Viallon V Fontviveille E Peruchet-Noray L Jansana A Wagner KH Kyrø C Tjønneland A Katzke V Bajracharya R et al. Consumption of ultra-processed foods and risk of multimorbidity of cancer and cardiometabolic diseases: a multinational cohort study Lancet Reg Health Europe 2023 35 100771 38115963 10.1016/j.lanepe.2023.100771 PMC10730313 20. O’Hearn M Lara-Castor L Cudhea F Miller V Reedy J Shi P Zhang J Wong JB Economos CD Micha R et al. Incident type 2 diabetes attributable to suboptimal diet in 184 countries Nat Med 2023 29 4 982 995 10.1038/s41591-023-02278-8 37069363 PMC10115653 21. Tessier A-J Wang F Korat AA Eliassen AH Chavarro J Grodstein F Li J Liang L Willett WC Sun Q et al. Optimal dietary patterns for healthy aging Nat Med 2025 31 1644 1652 10.1038/s41591-025-03570-5 40128348 PMC12092270 22. Belenguer A Duncan SH Calder AG Holtrop G Louis P Lobley GE Flint HJ Two routes of metabolic cross-feeding between Bifidobacterium adolescentis Appl Environ Microbiol 2006 72 5 3593 3599 10.1128/AEM.72.5.3593-3599.2006 16672507 PMC1472403 23. Walker AW Ince J Duncan SH Webster LM Holtrop G Ze X Brown D Stares MD Scott P Bergerat A et al. Dominant and diet-responsive groups of bacteria within the human colonic microbiota ISME J 2011 5 2 220 230 10.1038/ismej.2010.118 20686513 PMC3105703 24. Ze X Duncan SH Louis P Flint HJ Ruminococcus bromii ISME J 2012 6 1535 1543 10.1038/ismej.2012.4 22343308 PMC3400402 25. Balasundram N Sundram K Samman S Phenolic compounds in plants and agri-industrial by-products: antioxidant activity, occurrence, and potential uses Food Chem 2006 99 1 191 203 10.1016/j.foodchem.2005.07.042 26. Frame LA Costa E Jackson SA Current explorations of nutrition and the gut microbiome: a comprehensive evaluation of the review literature Nutr Rev 2020 78 10 798 812 10.1093/nutrit/nuz106 32211860 27. Williams GM Tapsell LC O’Brien CL Tosh SM Barrett EM Beck EJ Gut microbiome responses to dietary intake of grain-based fibers with the potential to modulate markers of metabolic disease: a systematic literature review Nutr Res 2020 79 11 1274 1292 10.1093/nutrit/nuaa128 33369654 28. Asnicar F Berry SE Valdes AM Nguyen LH Piccinno G Drew DA Leeming E Gibson R Le Roy C Khatib HA et al. Microbiome connections with host metabolism and habitual diet from 1,098 deeply phenotyped individuals Nat Med 2021 27 2 321 332 10.1038/s41591-020-01183-8 33432175 PMC8353542 29. Fu X Liu Z Zhu C Mou H Kong Q Nondigestible carbohydrates, butyrate, and butyrate-producing bacteria Crit Rev Food Sci Nutr 2019 59 suppl 1 S130 S152 10.1080/10408398.2018.1542587 30580556 30. Duncan SH Louis P Flint HJ Lactate-utilizing bacteria, isolated from human feces, that produce butyrate as a major fermentation product Appl Environ Microbiol 2004 70 10 5810 5817 10.1128/AEM.70.10.5810-5817.2004 15466518 PMC522113 31. Ferguson L Tasman-Jones C Englyst H Harris PJ Comparative effects of three resistant starch preparations on transit time and short-chain fatty acid production in rats Nutr Cancer 2000 36 230 237 10.1207/S15327914NC3602_13 10890035 32. Raji Z Karim A Karam A Khalloufi S A review on the heavy metal absorption capacity of dietary fibers derived from agro-based wastes: opportunities and challenges for practical applications in the food industry Trends Food Sci Technol 2023 137 74 91 33. Sinha AK Laursen MF Brinck JE Rybtke ML Hjørne AP Procházková N Pedersen M Roager HM Licht TR Dietary fibre directs microbial tryptophan metabolism via metabolic interactions in the gut microbiota Nat Microbiol 2024 9 8 1964 1978 10.1038/s41564-024-01737-3 38918470 PMC11306097 34. Schlemmer U Frølich W Prieto RM Grases F Phytate in foods and significance for humans: food sources, intake, processing, bioavailability, protective role and analysis. Mol Nutr Food Res 2009 53 Suppl 2 S330 S375 10.1002/mnfr.200900099 19774556 35. Bizzarri M Fuso A Dinicola S Cucina A Bevilacqua A Pharmacodynamics and pharmacokinetics of inositol(s) in health and disease Expert Opin Drug Metab Toxicol 2016 12 10 1181 1196 27351907 10.1080/17425255.2016.1206887 36. Michell RH Evolution of the diverse biological roles of inositols Biochem Soc Symp 2007 74 223 246 10.1042/BSS2007c19 17233593 37. Koguchi T Tanikawa C Mori J Kojima Y Matsuda K Regulation of myo-inositol biosynthesis by p53-ISYNA1 pathway Int J Oncol 2016 48 6 2415 2424 10.3892/ijo.2016.3456 27035231 38. Chakraborty A The inositol pyrophosphate pathway in health and diseases Biol Rev 2018 93 2 1203 1227 10.1111/brv.12392 29282838 PMC6383672 39. Heaver SL Le HH Tang P Baslé A Mirretta Barone C Vu DL Waters JL Marles-Wright J Johnson EL Campopiano DJ et al. Characterization of inositol lipid metabolism in gut-associated Bacteroidetes Nat Microbiol 2022 7 7 986 1000 10.1038/s41564-022-01152-6 35725777 PMC9246714 40. Thomas MP Mills SJ Potter BV The \"other\" inositols and their phosphates: synthesis, biology, and medicine (with recent advances in myo-inositol chemistry) Angew Chem Int Ed Engl 2016 55 5 1614 1650 10.1002/anie.201502227 26694856 PMC5156312 41. Schneider S Inositol transport proteins FEBS Lett 2015 589 10 1049 1058 10.1016/j.febslet.2015.03.012 25819438 42. Caspary WF Crane RK Active transport of myo-inositol and its relation to the sugar transport system in hamster small intestine Biochim Biophys Acta 1970 203 2 308 316 10.1016/0005-2736(70)90145-8 5441390 43. Bourgeois F Coady MJ Lapointe JY Determination of transport stoichiometry for two cation-coupled myo-inositol cotransporters: SMIT2 and HMIT J Physiol 2005 563 Pt 2 333 343 10.1113/jphysiol.2004.076679 15613375 PMC1665580 44. Antonowski T Osowski A Szczesny D Szablińska-Piernik J Juśkiewicz J Lahuta L Rynkiewicz A Wojtkiewicz J Pharmacokinetics of myo-inositol in a Wistar Rat Animal Model Int J Mol Sci 2022 23 19 11246 10.3390/ijms231911246 36232547 PMC9570207 45. Raboy V Gibson RS Bailey KB King JC Comparison of four methods for phytate analysis in plant-based foods J Food Compos Anal 2020 90 103481 46. Reddy NR Sathe SK Salunkhe DK 10.1016/S0065-2628(08)60110-X 6299067 47. Lind T Lönnerdal B Persson L Stenlund H Tennefors C Hernell O Effects of weaning cereals with different phytate contents on hemoglobin, iron stores, and serum zinc: a randomized intervention in infants from 6 to 12 mo of age2 Am J Clin Nutr 2003 78 1 168 175 10.1093/ajcn/78.1.168 12816787 48. Beaton GH Calloway DH Murphy SP Estimated protein intakes of toddlers: predicted prevalence of inadequate intakes in village populations in Egypt, Kenya, and Mexico AJCN 1992 55 4 902 911 10.1093/ajcn/55.4.902 1550075 49. Harland BF Peterson M Nutritional status of lacto-ovo vegetarian Trappist monks. J Am Diet Assoc 1978 72 3 259 264 10.1016/S0002-8223(21)05973-3 580287 50. Eiseman J Lan J Guo J Joseph E Vucenik I Pharmacokinetics and tissue distribution of inositol hexaphosphate in C.B17 SCID mice bearing human breast cancer xenografts Metabolism 2011 60 10 1465 1474 10.1016/j.metabol.2011.02.015 21489580 51. Fedeli V Wang J Cantagrel V Saiardi A Human plasma inositol hexakisphosphate (InsP (6) phosphatase identified as the Multiple Inositol Polyphosphate Phosphatase 1 (MINPP1) MicroPubl Biol 2024 2024 10.17912/micropub.biology.001390 PMC11633940 39665074 52. Schlemmer U Jany K Berk A Schulz E Rechkemmer G Degradation of phytate in the gut of pigs – pathway of gastrointestinal inositol phosphate hydrolysis and enzymes involved Arch Tierernaehr 2001 55 4 255 280 10.1080/17450390109386197 12357589 53. Grases F Simonet BM Vucenik I Prieto RM Costa‐Bauzá A March JG Shamsuddin AM Absorption and excretion of orally administered inositol hexaphosphate (IP6 or phytate) in humans BioFactors 2001 15 1 53 61 10.1002/biof.5520150105 11673644 54. Joung H Jeun BY Li SJ Kim J Woodhouse LR King JC Welch RM Paik HY Fecal phytate excretion varies with dietary phytate and age in women J Am Coll Nutr 2007 26 3 295 302 10.1080/07315724.2007.10719614 17634176 55. Prieto RM Fiol M Perello J Estruch R Ros E Sanchis P Grases F Effects of Mediterranean diets with low and high proportions of phytate-rich foods on the urinary phytate excretion Eur J Nutr 2010 49 6 321 326 10.1007/s00394-009-0087-x 20108098 56. Qiu D Gu C Liu G Ritter K Eisenbeis VB Bittner T Gruzdev A Seidel L Bengsch B Shears SB et al. Capillary electrophoresis mass spectrometry identifies new isomers of inositol pyrophosphates in mammalian tissues. Chem Sci 2023 14 3 658 667 10.1039/d2sc05147h 36741535 PMC9847636 57. Valdés-Mas R Leshem A Zheng D Cohen Y Kern L Zmora N He Y Katina C Eliyahu-Miller S Yosef-Hevroni T et al. Metagenome-informed metaproteomics of the human gut microbiome, host, and dietary exposome uncovers signatures of health and inflammatory bowel disease Cell 2025 188 10.1016/j.cell.2024.12.016 39837331 58. Fujisaka S Avila-Pacheco J Soto M Kostic A Dreyfuss JM Pan H Ussar S Altindis E Li N Bry L et al. Diet, genetics, and the gut microbiome drive dynamic changes in plasma metabolites Cell Rep 2018 22 11 3072 3086 10.1016/j.celrep.2018.02.060 29539432 PMC5880543 59. De Vos WM Nguyen Trung M Davids M Liu G Rios-Morales M Jessen H Fiedler D Nieuwdorp M Bui TPN Phytate metabolism is mediated by microbial cross-feeding in the gut microbiota Nat Microbiol 2024 9 1812 1827 10.1038/s41564-024-01698-7 38858593 PMC7618129 60. Volk WA Pennington D The fermentation of inositol J Bacteriol 1951 61 4 469 473 10.1128/jb.61.4.469-473.1951 14832185 PMC386027 61. Yoshida K-I Yamaguchi M Morinaga T Kinehara M Ikeuchi M Ashida H Fujita Y Myo-inositol catabolism in Bacillus subtilis J Biol Chem 2008 283 16 10415 10424 10.1074/jbc.M708043200 18310071 62. Yebra MJ Zúñiga M Beaufils S Pérez-Martínez G Deutscher J Monedero V Identification of a gene cluster enabling Lactobacillus casei Appl Environ Microbiol 2007 73 12 3850 3858 10.1128/AEM.00243-07 17449687 PMC1932728 63. Yoshida K-I Yamamoto Y Omae K Fujita Y Identification of two myo-inositol transporter genes of Bacillus subtilis J Bacteriol 2002 184 4 983 991 10.1128/jb.184.4.983-991.2002 11807058 PMC134797 64. Bui TPN Mannerås-Holm L Puschmann R Wu H Troise AD Nijsse B Boeren S Bäckhed F Fiedler D deVos WM Conversion of dietary inositol into propionate and acetate by commensal Anaerostipes associates with host health Nat Commun 2021 12 1 4798 10.1038/s41467-021-25081-w 34376656 PMC8355322 65. Le Roy T Moens de Hase E Van Hul M Paquot A Pelicaen R Régnier M Depommier C Druart C Everard A Maiter D et al. Dysosmobacter welbionis is a newly isolated human commensal bacterium preventing diet-induced obesity and metabolic disorders in mice. Gut 2022 71 3 534 543 10.1136/gutjnl-2020-323778 34108237 PMC8862106 66. Levine UY Bearson SMD Stanton TB Mitsuokella jalaludinii Salmonella enterica Vet Microbiol 2012 159 1 115 122 10.1016/j.vetmic.2012.03.027 22503601 67. Sajidan A Farouk A Greiner R Jungblut P Müller E Borriss R Molecular and physiological characterisation of a 3-phytase from soil bacterium Klebsiella Appl Microbiol Biotechnol 2004 65 1 110 118 10.1007/s00253-003-1530-1 14727093 68. Oakley AJ The structure of Aspergillus niger Biochem Biophys Res Commun 2010 397 4 745 749 10.1016/j.bbrc.2010.06.024 20541524 69. Yanke LJ Selinger LB Cheng KJ Phytase activity of Selenomonas ruminantium Lett Appl Microbiol 1999 29 1 20 25 10.1046/j.1365-2672.1999.00568.x 70. Yanke LJ Bae HD Selinger LB Cheng KJ Phytase activity of anaerobic ruminal bacteria Microbiology 1998 144 6 1565 1573 10.1099/00221287-144-6-1565 9639927 71. Chu H-M Guo R Lin T Chou C Shr H Lai H Tang T Cheng K Selinger BL Wang AH Structures of Selenomonas ruminantium Structure 2004 12 11 2015 2024 10.1016/j.str.2004.08.010 15530366 72. D'Silva CG Bae HD Yanke LJ Cheng K-J Selinger LB Localization of phytase in Selenomonas ruminantium Mitsuokella multiacidus Can J Microbiol 2000 46 4 391 395 10.1139/w00-001 10779878 73. Tan W-q Yee PC Chin SC Clemente Michael Wong Vui L Abdullah N Radu S Wan HY Cloning of a novel phytase from an anaerobic rumen bacterium, Mitsuokella jalaludinii Escherichia coli J Integr Agric 2015 14 9 1816 1826 10.1016/S2095-3119(14)60960-6 74. Kerovuo J Lauraeus M Nurminen P Kalkkinen N Apajalahti J Isolation, characterization, molecular gene cloning, and sequencing of a novel phytase from Bacillus subtilis Appl Environ Microbiol 1998 64 6 2079 2085 10.1128/AEM.64.6.2079-2085.1998 9603817 PMC106281 75. Dvořáková J Kopecký J Havlíček V Křen V Formation of myo-inositol phosphates by Aspergillus niger Folia Microbiol 2000 45 2 128 132 10.1007/BF02817410 11271819 76. Haros M Bielecka M Sanz Y Phytase activity as a novel metabolic feature in Bifidobacterium FEMS Microbiol Lett 2005 247 2 231 239 10.1016/j.femsle.2005.05.008 15935567 77. García-Mantrana I Monedero V Haros M Reduction of phytate in soy drink by fermentation with Lactobacillus casei Plant Foods Hum Nutr 2015 70 3 269 274 10.1007/s11130-015-0489-2 26003176 78. Greiner R Konietzny U Jany KD Purification and characterization of two phytases from Escherichia coli Arch Biochem Biophys 1993 303 1 107 113 10.1006/abbi.1993.1261 8387749 79. Kerovuo J Rouvinen J Hatzack F Analysis of myo-inositol hexakisphosphate hydrolysis by Bacillus phytase Biochem J 2000 352 Pt 3 623 628 10.1042/bj3520623 11104666 PMC1221497 80. Haros M Bielecka M Honke J Sanz Y Myo-inositol hexakisphosphate degradation by Bifidobacterium infantis Int J Food Microbiol 2007 117 1 76 84 10.1016/j.ijfoodmicro.2007.02.021 17462768 81. Oh BC Choi W Park S Kim Y Biochemical properties and substrate specificities of alkaline and histidine acid phytases Appl Microbiol Biotechnol 2004 63 4 362 372 10.1007/s00253-003-1345-0 14586576 82. Stentz R Osborne S Horn N Li AW Hautefort I Bongaerts R Rouyer M Bailey P Shears SB Hemmings AM et al. A bacterial homolog of a eukaryotic inositol phosphate signaling enzyme mediates cross-kingdom dialog in the mammalian gut Cell Rep 2014 6 4 646 656 10.1016/j.celrep.2014.01.021 24529702 PMC3969271 83. Ha N-C Oh B Shin S Kim H Choi KY Crystal structures of a novel, thermostable phytase in partially and fully calcium-loaded states Nat Struct Biol 2000 7 2 147 153 10.1038/72421 10655618 84. Wu GD Chen J Hoffmann C Bittinger K Keilbaugh SA Bewtra M Knights D Walters WA Knight R Sinha R et al. Linking long-term dietary patterns with gut microbial enterotypes Science 2011 334 6052 105 108 10.1126/science.1208344 21885731 PMC3368382 85. Michell RH Inositol lipids and phosphates Curr Opin Cell Biol 1989 1 2 201 205 10.1016/0955-0674(89)90087-2 2698670 86. Brown EM Ke X Hitchcock D Jeanfavre S Avila-Pacheco J Nakata T Arthur TD Fornelos N Heim C Franzosa EA et al. Bacteroides-Derived Sphingolipids Are Critical for Maintaining Intestinal Homeostasis and Symbiosis. Cell Host Microbe 2019 25 5 668 680.e7 10.1016/j.chom.2019.04.002 31071294 PMC6544385 87. Nordio M Proietti E The combined therapy with myo-inositol and D-chiro-inositol reduces the risk of metabolic disease in PCOS overweight patients compared to myo-inositol supplementation alone Eur Rev Med Pharmacol Sci 2012 16 5 575 581 22774396 88. Monastra G Unfer V Harrath AH Bizzarri M Combining treatment with myo-inositol and D-chiro-inositol (40:1) is effective in restoring ovary function and metabolic balance in PCOS patients Gynecol Endocrinol 2017 33 1 1 9 10.1080/09513590.2016.1247797 27898267 89. Cabrera-Cruz H Oróstica L Plaza-Parrochia F Torres-Pinto I Romero C Vega M The insulin-sensitizing mechanism of myo-inositol is associated with AMPK activation and GLUT-4 expression in human endometrial cells exposed to a PCOS environment Am J Physiol Endocrinol Metab 2020 318 2 E237 E248 10.1152/ajpendo.00162.2019 31874063 90. Zeevi D Korem T Godneva A Bar N Kurilshikov A Lotan-Pompan M Weinberger A Fu J Wijmenga C Zhernakova A et al. Structural variation in the gut microbiome associates with host health Nature 2019 568 43 48 10.1038/s41586-019-1065-y 30918406 91. Wu C Yang F Zhong H Hong J Lin H Zong M Ren H Zhao S Chen Y Shi Z Obesity-enriched gut microbe degrades myo-inositol and promotes lipid absorption. Cell Host Microbe 2024 32 8 1301 1314.e9 10.1016/j.chom.2024.06.012 38996548 92. Zajdel A Wilczok A Węglarz L Dzierżewicz Z Phytic acid inhibits lipid peroxidation in vitro. Biomed Res Int 2013 2013 147307 147307 10.1155/2013/147307 24260736 PMC3821898 93. Graf E Eaton JW Dietary suppression of colonic cancer. Fiber or phytate? Cancer 1985 56 4 717 718 2990653 10.1002/1097-0142(19850815)56:4<717::aid-cncr2820560402>3.0.co;2-4 94. Rimbach G Pallauf J Phytic acid inhibits free radical formation in vitro but does not affect liver oxidant or antioxidant status in growing rats J Nutr 1998 128 11 1950 1955 10.1093/jn/128.11.1950 9808648 95. Yuangklang C Wensing T Lemmens AG Jittakhot S Beynen AC Effect of sodium phytate supplementation on fat digestion and cholesterol metabolism in female rats J Anim Physiol Anim Nutr 2005 89 11-12 373 378 10.1111/j.1439-0396.2005.00525.x 16401188 96. Thompson LU Button CL Jenkins DJ Phytic acid and calcium affect the in vitro rate of navy bean starch digestion and blood glucose response in humans AJCN 1987 46 3 467 473 10.1093/ajcn/46.3.467 3630965 97. Yoon JH Thompson LU Jenkins DJ The effect of phytic acid on in vitro rate of starch digestibility and blood glucose response AJCN 1983 38 6 835 842 10.1093/ajcn/38.6.835 6650445 98. Sandberg A-S Andersson H Kivistö B Sandström B Extrusion cooking of a high-fibre cereal product: 1. Effects on digestibility and absorption of protein, fat, starch, dietary fibre and phytate in the small intestine Br J Nutr 1986 55 2 245 254 10.1079/BJN19860031 2823863 99. Sanchis P Calvo P Pujol A Rivera R Berga F Fortuny R Costa-Bauza A Grases F Masmiquel L Daily phytate intake increases adiponectin levels among patients with diabetes type 2: a randomized crossover trial. Nutr Diabetes 2023 13 1 2 10.1038/s41387-023-00231-9 36854678 PMC9975181 100. Liu C Chen C Yang F Li X Cheng L Song Y Phytic acid improves intestinal mucosal barrier damage and reduces serum levels of proinflammatory cytokines in a 1,2-dimethylhydrazine-induced rat colorectal cancer model Br J Nutr 2018 120 2 121 130 10.1017/S0007114518001290 29947321 101. Okazaki Y Katayama T Dietary phytic acid modulates characteristics of the colonic luminal environment and reduces serum levels of proinflammatory cytokines in rats fed a high-fat diet Nutr Res 2014 34 12 1085 1091 10.1016/j.nutres.2014.09.012 25444642 102. Nagai R Murray DB Metz TO Baynes JW Chelation: a fundamental mechanism of action of AGE inhibitors, AGE breakers, and other inhibitors of diabetes complications Diabetes 2012 61 3 549 559 10.2337/db11-1120 22354928 PMC3282805 103. Nguyen Trung M Kieninger S Fandi Z Qiu D Liu G Mehendale NK Saiardi A Jessen H Keller B Fiedler D et al. Stable Isotopomers of myo-Inositol Uncover a Complex MINPP1-Dependent Inositol Phosphate Network. ACS Cent Sci 2022 8 12 1683 1694 10.1021/acscentsci.2c01032 36589890 PMC9801504 104. Okazaki Y Sekita A Katayama T Intake of phytic acid and myo-inositol lowers hepatic lipogenic gene expression and modulates gut microbiota in rats fed a high-sucrose diet Biomed Rep 2018 8 5 466 474 10.3892/br.2018.1079 29725525 PMC5920403 105. Wu S-e Hashimoto-Hill S Woo V Eshleman EM Whitt J Engleman L Karns R Denson LA Haslam DB Alenghat T Microbiota-derived metabolite promotes HDAC3 activity in the gut Nature 2020 586 7827 108 112 10.1038/s41586-020-2604-2 32731255 PMC7529926 106. Hashimoto-Hill S Colapietro L Woo V Antonacci S Whitt J Engleman L Alenghat T Dietary phytate primes epithelial antibacterial immunity in the intestine. Front Immunol 2022 13 952994 10.3389/fimmu.2022.952994 36341403 PMC9627201 107. Thaiss CA Levy M Grosheva I Zheng D Soffer E Blacher E Braverman S Tengeler AC Barak O Elazar M et al. Hyperglycemia drives intestinal barrier dysfunction and risk for enteric infection Science 2018 359 6382 1376 1383 10.1126/science.aar3318 29519916 108. Abdulwaliyu I Arekemase SO Adudu JA Batari ML Egbule MN Okoduwa SIR Investigation of the medicinal significance of phytic acid as an indispensable anti-nutrient in diseases Clin Nutr Exp 2019 28 42 61 10.1016/j.yclnex.2019.10.002 109. Fredlund K Isaksson M Rossander-Hulthén L Almgren A Sandberg A Absorption of zinc and retention of calcium: dose-dependent inhibition by phytate J Trace Elem Med Biol 2006 20 1 49 57 10.1016/j.jtemb.2006.01.003 16632176 110. Shamsuddin AM Anti-cancer function of phytic acid Int J Food Sci Technol 2002 37 7 769 782 ",
  "metadata": {
    "Title of this paper": "Anti-cancer function of phytic acid",
    "Journal it was published in:": "Gut Microbes",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482443/"
  }
}