{
  "title": "Paper_71",
  "abstract": "pmc Nanoscale Adv Nanoscale Adv 4221 nanoadv NA Nanoscale Advances 2516-0230 Royal Society of Chemistry PMC12489389 PMC12489389.1 12489389 12489389 10.1039/d5na00606f d5na00606f 1 Chemistry Functionalization of lipid nanoemulsions with humanized antibodies using plug-and-play cholesterol anchor for targeting cancer cells Boide-Trujillo Valeria Jose a † https://orcid.org/0000-0002-0456-3957 Mittelheisser Vincent b † Liu Fei a c † I-2388-2016 Lefebvre Olivier b Andreiuk Bohdan a https://orcid.org/0000-0002-7047-9657 Anton Nicolas c https://orcid.org/0000-0003-2842-8116 Goetz Jacky G. b https://orcid.org/0000-0002-2423-830X Klymchenko Andrey S. a  a Laboratoire de Bioimagerie et Pathologies, CNRS UMR_7021, ITI SysChem-Chimie des Systèmes Complexes, Université de Strasbourg Illkirch France andrey.klymchenko@unistra.fr  b Tumor Biomechanics Lab, INSERM UMR_S1109, Fédération de Médecine Translationnelle de Strasbourg, Université de Strasbourg, Equipe labélisée Ligue Nationale Contre le Cancer Strasbourg France jacky.goetz@inserm.fr https://www.goetzlab.fr  c Regenerative Nanomedicine (RNM), INSERM UMR_1260, Fédération de Médecine Translationnelle de Strasbourg, Université de Strasbourg Strasbourg France † VJBT, VM and FL have contributed equally to this work. 23 9 2025 475012 19 6 2025 20 9 2025 23 09 2025 03 10 2025 03 10 2025 This journal is © The Royal Society of Chemistry 2025 RSC https://creativecommons.org/licenses/by/3.0/ This article is licensed under a Creative Commons Attribution 3.0 Unported Licence Lipid nanoemulsions (NEs) are promising green nanocarriers for diagnostic and therapeutic applications, but their functionalization with biomolecules, such as antibodies, remains a challenge due to liquid nature of their core. Here, we developed an original plug-and-play strategy to graft an antibody (trastuzumab) at the surface of NEs, using components generally recognized as safe (GRAS). We synthesized a reactive 4-nitrophenyl carbonate of cholesterol (NPC-Chol) and a Biotin-PEG 3000 3000 3000 1 A plug-and-play functionalization of nanoemulsions with antibodies based on reactive cholesterol and bifunctional linker was proposed for specific cell targeting. Ligue Contre le Cancer 10.13039/501100004099 Unassigned Agence Nationale de la Recherche 10.13039/501100001665 SenEmul Association pour la Recherche sur le Cancer 10.13039/100007391 Unassigned Institut National Du Cancer 10.13039/501100006364 Unassigned China Scholarship Council 10.13039/501100004543 Unassigned Ministère de l'Enseignement supérieur, de la Recherche et de l'Innovation 10.13039/100012948 ARCDOC42023010006005 Association pour la Recherche sur le Cancer 10.13039/100007391 Unassigned pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf yes pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes pubstatus Advance Article Introduction Cancer nanomedicine has initially emerged to improve the delivery selectivity of chemotherapeutics to reduce associated toxicities. 1,2 3–5 6–8 6 8 9 10 11 in vivo in vivo 6–8 8,12 13,14 Enhancing the targeting selectivity of drugs and contrast agents is a primary focus in cancer diagnostics and treatment to minimize systemic exposure and increase their efficacy. 15 16 17 2,18 19,20 14 6 The major challenge in surface modifications of NEs is the dynamic nature of their liquid/liquid interface of NEs, which renders surface grafting poorly stable. In previous studies, NEs were functionalized with a peptide arginylglycylaspartic acid (RGD) using lipids 21 22 v 3 23 24 25 26,27 14,28,29 In the present work, we engineered antibody-targeted NEs to enhance tumor cell selectivity and improve their potential for clinical translation. To this end, we used a biotinylation strategy, which is commonly used in molecular biology and bio-nanotechnology for its rapid, efficient, and robust bio-conjugation. 30,31 3000 3000 3000 32 in vitro Materials and methods Materials Boc-NH-PEG-NH 2 H N N ® 2+ 2+ Equipment Size distributions and zeta potential of NEs were determined by dynamic light scattering using a Zetasizer Nano ZSP (Malvern Instruments). Absorption spectra were recorded on a Cary 5000-UV-vis-NIR spectrophotometer (Agilent). NMR spectra were recorded at 20 °C on a Bruker Avance III 400 MHz NMR spectrometer (Bruker). Conjugation experiments were carried out in DNA low-binding tubes 1.5 mL (Eppendorf) at atmospheric pressure at room temperature unless otherwise stated. Ultrafiltration was carried out in centrifugal filters Amicon ® −1 Synthesis Compound 1 Biotin (5 eq., 62.3 mg, 0.25 mmol) and HATU (5 eq., 100.0 mg, 0.25 mmol) were dissolved in 5 mL of dry DMF. DiPEA (18 eq., 145 μL, 0.85 mmol) was added and stirred for 15 min. A 5 mL solution of Boc-NH-PEG-NH 2 1 3 δ J J J J J J J J Compound 2 Compound 1 (1 eq., 107.0 mg, 0.03 mmol) was dissolved in dry DCM (2 mL). Trifluoroacetic acid (150 eq., 0.34 mL, 4.48 mmol) was added, followed by 3 hours of stirring at room temperature. DCM was removed under reduced pressure. Co-evaporation with methanol (1 mL) was done several times to remove the remaining trifluoroacetic acid, affording compound 2 (102.0 mg, 0.03 mmol, 96%) as light-yellow wax. 1 3 δ J J J J J J J Compound 3 DiBoc-lysine (3 eq., 51.4 mg, 0.09 mmol) and HATU (2.5 eq., 31.0 mg, 0.07 mmol) were dissolved in 5 mL of dry DMF. DiPEA (10 eq., 55 μL, 0.32 mmol) was added and stirred for 15 min. A 5 mL solution of compound 2 (1 eq., 102.0 mg, 0.03 mmol) in dry DMF was added to the previous mixture, and the final mixture was stirred overnight at 40 °C. The crude was purified by size exclusion chromatography LH-20 (DCM : MeOH, 1 : 1) to afford compound 3 (105.0 mg, 0.03 mmol, 95%) as a colorless wax. 1 3 δ J J J J J J J J Compound 4 Compound 3 (1 eq., 105.0 mg, 0.03 mmol) was dissolved in 2 mL of dry DCM. Trifluoroacetic acid (150 eq., 0.34 mL, 4.48 mmol) was added, followed by 3 hours of stirring at room temperature. DCM was removed under reduced pressure. Co-evaporation with methanol (1 mL) was done several times to remove the remaining trifluoroacetic acid, affording compound 4 (104.0 mg, 0.03 mmol, 99%) as light-yellow wax. 1 3 δ J J J J J J J J J J J 144 286 6 66 + + General protocol for formulation of nanoemulsions (NEs) NEs were produced by spontaneous nanoemulsification: 55 mg vitamin E acetate containing 6% of NPC-cholesterol with Cy5.5-TPB at 2% and 45 mg Kolliphor ® Nanoemulsion biotinylation 55 mg vitamin E acetate containing 6% of NPC-cholesterol (with or without Cy5.5-TPB at 2%), Biotin-PEG-Lysine (5 mg), and triethylamine (1.3 μL) were mixed in THF (500 μL), overnight at 60 °C. THF and triethylamine were removed under reduced pressure. Kolliphor ® NPC-cholesterol conversion NPC-cholesterol (3.3 mg), Biotin-PEG-Lysine (5 mg), and triethylamine (1.3 μL) were mixed in THF (500 μL), overnight at 60 °C. THF and triethylamine were removed under reduced pressure. The residue was dissolved in CDCl3 (100 μL) and transferred to a 3 mm diameter tube for 1 Trastuzumab conjugation with biotin-NHS ester 500 μL of Trastuzumab (32 μM in borate buffer) was mixed with 5 μL of NHS-biotin (100 mM in DMSO). The reaction was incubated overnight on a ThermoShaker (room temperature, 300 rpm). Afterward, purification was done by ultrafiltration (50 kDa MWCO) using PBS. The biotin-trastuzumab was stored at 4 °C in DPBS, in the presence of 0.05% (w/v) of sodium azide, for conservation. Nanoemulsion functionalization with trastuzumab 200 μL of neutravidin (22 μM in DPBS) and 200 μL of biotinylated antibody (11 μM in DPBS) were incubated for 24 hours at room temperature in a DNA low-binding Eppendorf. Then, 100 μL of biotinylated-NEs were added, followed by 24 hours of further incubation. Finally, antibody-NEs were purified by size exclusion chromatography using Sephacryl S300 HR gel column, which is specially adapted for separating relatively large macromolecules or globular proteins in the range 10 to 150 kDa, and DPBS as an eluent. Fluorescence correlation spectroscopy (FCS) of NEs FCS measurements were performed on a home-built confocal setup based on a Nikon inverted microscope with a Nikon 60× 1.2 NA water immersion objective. Excitation was provided by a continuous wave laser diode at 638 nm (Oxxius LCC) and photons were detected with a fibered avalanche photodiode (APD SPCM-AQR-14-FC, PerkinElmer) connected to an online hardware correlator (ALV7000-USB, ALV GmbH, Germany). The data were analyzed using the PyCorrFit software. NEs (non-functionalized or biotin NEs) in a total volume of 500 μL (DPBS or 10% FBS in DPBS) were incubated for 1 h at 37 °C. The resulting solutions were further diluted 10-fold in PBS. Alexa 647 acid was used as a reference (50 nM aqueous solution). Biotin-NEs immobilization protocol 8-well LabTek ® −1 −1 Cell experiments Cell culture MDA-MB-231 (ATCC #CRM-HTB-26) and HCC-1954 (ATCC #CRL-2338) human breast cancer cell lines were kindly provided by M. Donzeau (IGBMC, Strasbourg, France). Cells were cultured in RPMI1640 with l −1 −1 2 Cytotoxicity 2500 MDA-MB-231 and 7500 HCC-1954 were plated in a 96-well plate and let adhere overnight. The day after, medium was changed for medium containing increasing concentration of bare NEs or antibody-targeted NEs. After 72 h, cells were washed, fixed with PFA 4% and stained for 1 h with 2% cristal violet. Excess of cristal violet was washed with tap water and plates were let dry before destaining by acetic acid. Cristal violet absorbance was measured at 595 nm using a MultiSkan FC plate-reader. Nanoemulsion internalization 30 000 MDA-MB-231 or HCC-1954 were plated in an 8-well LabTek slide and let adhere overnight. The day after, medium was changed for medium containing 1.1 nM of bare NEs or antibody-targeted NEs in Opti-MEM. After 4 h of incubation at 37 °C, cells were washed and their membranes were stained with wheat germ agglutinin (WGA) Alexa-Fluor 488 (5 μg mL −1 vs. l 2 Statistical analysis Statistical analysis was performed with GraphPad Prism 9 software. The normal distribution of the data was tested using the Shapiro–Wilk normality test. When comparing two groups, a Mann–Whitney analysis were used, for more than 2 groups a Kruskal–Wallis test followed by the original FDR method of Benjamini and Hochberg post p p p p Results and discussion Design and synthesis of GRAS-compatible building blocks for NEs surface functionalization To address the current limitations of anti-HER2 ADCs and NPs, we aimed to develop trastuzumab-functionalized NEs capable of targeting their cognate antigen expressed on the surface of tumor cells. However, given the liquid nature of the NE oil core, efficient surface anchoring of large biomolecules such as the humanized IgG 1 p 33 3000 Fig. 1 3000 3000 1 Fig. 1 Fig. 1 Schemes for preparation of functionalized NEs. (A) Synthesis of the Biotin-PEG 3000 3000 3000 p Formulation of in situ In our approach, the reactive anchor NPC-Chol was first coupled with the linker Biotin-PEG 3000 Fig. 1B 1 p Fig. 2A in situ 3000 4,6,8 3000 p p 34 p p Fig. 2 Characterization of the reaction of NPC-Chol with the biotin linker. (A) Superimposed 1 3000 p n 3000 Then, to quench the non-reacted NPC-Chol, we incubated the NEs mixture with an excess of n p Fig. 2B n p 3000 p 35 As a model of hydrophobic cargo and a fluorescent tracer of NEs, we added to the oil core lipophilic fluorescent dye – cyanine 5.5 derivative with its bulky counterion tetraphenylborate (Cy5.5-LP/TPB, Fig. 3A 8 8,11 Fig. 3B 36 37–40 37 8 Fig. 3 Validation of biotinylated nanoemulsions. (A) Schematic representation of Cy5.5-LP/TPB loaded NEs and their immobilization on a glass surface coated with BSA-biotin and neutravidin. (B) Absorption (solid line) and emission (dashed line) spectra of NEs loaded with Cy5.5-LP/TPB in water, and Cy5.5-LP/TPB in Labrafac. (C–E) Fluorescence microscopy of neutravidin-coated glass surface incubated with bare NEs (30 000-fold dilution) (C) or biotin-decorated NEs (100 000- (D) or 30 000-fold (E) dilution). Scale bar = 20 μm. Validation of surface biotin activity via To assess the presence of active biotin units on the surface of NEs, we formulated biotinylated-NEs loaded with a hydrophobic fluorescent dye Cy5.5-LP/TPB at 2 wt% in the oil phase ( Fig. 3A Fig. 3B 41 24,31,42,43 Fig. 3A 42,43 Fig. 3D and E Fig. 3D and E Fig. 3C Functionalization of NEs with trastuzumab Prompted by these results, we next generated NEs decorated with therapeutic antibodies to enable selective targeting of tumor cells expressing cognate antigens. For this purpose, trastuzumab – a clinically approved anti-HER2 antibody 34 via 34 Fig. 4A Fig. 4B via K d −15 −1 30,31 44 K d K d −1 Fig. 4C 45,46 Fig. 4 Validation of biotinylated trastuzumab on HER2-amplified HCC1954 cells. (A and B) Quantification of the trastuzumab-biotin membrane staining by following Streptavidin-AF647 (SA-AF647) fluorescence without (A) or with (B) pre-blocking with neutravidin, using fluorescence confocal microscopy. Cell membranes were labeled with Wheat Germ Agglutinin-AF488 (green). Scale bar is 10 μm. Cell edges are marked by dot lines on the fluorescence profil plots. (C) Flow cytometry study determining the apparent binding affinity of the trastuzumab-functionalized nanoemulsions on HER2-amplified HCC-1954 cells. Error bars are standard deviation of the mean ( n Trastuzumab-functionalized NEs target HER2-amplified tumor cells in vitro Building on these results, we next evaluated whether trastuzumab-functionalized NEs can target specifically tumor cells with high expression of HER2 receptor (HCC-1954) ( Fig. 5A and B vs. Fig. 5C low Fig. 5C low Fig. 6 Fig. 5 Trastuzumab-functionalized nanoemulsions target breast cancer cells in an antigen–antibody manner. (A) Biotinylated-NEs or trastuzumab-functionalized NEs interactions, assessed using HER2-amplified HCC-1954 cells or HER2 low low Fig. 6 Nanoemulsions cytotoxicity, measured after a 72 h treatment with NEs increasing concentrations of HER2-amplified HCC-1954 (left) and HER2 low n n Conclusions Functionalization of lipid NEs with biomolecules for selective targeting remains a challenge. Here, we developed an original plug-and-play strategy to graft an antibody (trastuzumab) at the surface of NEs, using GRAS components. For this purpose, we synthesized a reactive derivative of cholesterol, cholesteryl (4-nitrophenol) carbonate (NPC-Chol), which can be readily encapsulated in the oil core of NEs and react with amines. We also designed a Biotin-PEG 3000 3000 3000 3000 1 via 24,25 21,47 22,48 The targeting selectivity of the trastuzumab-decorated NEs was evaluated in vitro low Altogether, our study showed that combining the high encapsulation capacity of the NEs with the trastuzumab surface decoration allowed receptor-selective targeting of HER2-amplified breast cancer cells. This easily tunable functionalized system provides a platform for the conjugation of different monoclonal antibodies and the encapsulation of a large variety of contrast agents and drugs; thus, it can be used for imaging, therapeutic and targeted drug delivery applications. Although in vivo via 8,49,50 51 25,52,53 14 in vivo Conflicts of interest The authors have no conflict of interest to declare. Supplementary Material NA-OLF-D5NA00606F-s001 We thank all members of the JGG and ASK labs for helpful discussions. ASK team and VJBT were supported by ANR SenEmul and by the Interdisciplinary Thematic Institute SysChem, via Data availability The data supporting this article have been included as part of the supplementary information (SI). Supplementary information: it contains NMR and mass spectra, additional data on DLS, zeta potential, optical spectroscopy, FCS, chromatography analysis and cell imaging and comparative analysis of developed functionalization approach with respect to previously reported ones. See DOI: https://doi.org/10.1039/d5na00606f References Rosenblum D. Joshi N. Tao W. Karp J. M. Peer D. Progress and challenges towards targeted delivery of cancer therapeutics Nat. Commun. 2018 9 1410 29650952 10.1038/s41467-018-03705-y PMC5897557 Mitchell M. J. Billingsley M. M. Haley R. M. Wechsler M. E. Peppas N. A. Langer R. Engineering precision nanoparticles for drug delivery Nat. Rev. Drug Discovery 2021 20 101 124 33277608 10.1038/s41573-020-0090-8 PMC7717100 Tayeb H. H. Felimban R. Almaghrabi S. Hasaballah N. Nanoemulsions: Formulation, characterization, biological fate, and potential role against COVID-19 and other viral outbreaks Colloid Interface Sci. Commun. 2021 45 100533 34692429 10.1016/j.colcom.2021.100533 PMC8526445 Anton N. Vandamme T. F. Nano-emulsions and micro-emulsions: clarifications of the critical differences Pharm. Res. 2011 28 978 985 21057856 10.1007/s11095-010-0309-1 Singh Y. Meher J. G. Raval K. Khan F. A. Chaurasia M. Jain N. K. Chourasia M. K. Nanoemulsion: Concepts, development and applications in drug delivery J. Controlled Release 2017 252 28 49 10.1016/j.jconrel.2017.03.008 28279798 Klymchenko A. S. Liu F. Collot M. Anton N. Dye-Loaded Nanoemulsions: Biomimetic Fluorescent Nanocarriers for Bioimaging and Nanomedicine Adv. Healthcare Mater. 2021 10 2001289 10.1002/adhm.202001289 33052037 Liu F. Niko Y. Bouchaala R. Mercier L. Lefebvre O. Andreiuk B. Vandamme T. Goetz J. G. Anton N. Klymchenko A. Drug-Sponge Lipid Nanocarrier for in Situ Cargo Loading and Release Using Dynamic Covalent Chemistry Angew. Chem., Int. Ed. 2021 anie.202014259 Bouchaala R. Mercier L. Andreiuk B. Mély Y. Vandamme T. Anton N. Goetz J. G. Klymchenko A. S. Integrity of lipid nanocarriers in bloodstream and tumor quantified by near-infrared ratiometric FRET imaging in living mice J. Controlled Release 2016 236 57 67 10.1016/j.jconrel.2016.06.027 PMC4968657 27327767 Khalin I. Adarsh N. Schifferer M. Wehn A. Groschup B. Misgeld T. Klymchenko A. Plesnila N. Size-Selective Transfer of Lipid Nanoparticle-Based Drug Carriers Across the Blood–Brain Barrier Via Vascular Occlusions Following Traumatic Brain Injury Small 2022 18 2200302 10.1002/smll.202200302 35384294 Alleva M. Baranyai Z. Esteban-Pérez N. Martínez-Vicente P. Martín-Rapún R. Moros M. Martínez de la Fuente J. Förster Resonance Energy Transfer (FRET) Demonstrates In Vitro Chitosan-Coated Nanocapsules Suitability for Intranasal Brain Delivery ACS Appl. Mater. Interfaces 2025 17 26348 26360 40289325 10.1021/acsami.5c01920 PMC12067367 Kilin V. N. Anton H. Anton N. Steed E. Vermot J. Vandamme T. F. Mely Y. Klymchenko A. S. Counterion-enhanced cyanine dye loading into lipid nano-droplets for single-particle tracking in zebrafish Biomaterials 2014 35 4950 4957 24661553 10.1016/j.biomaterials.2014.02.053 Matsumura Y. Maeda H. A new concept for macromolecular therapeutics in cancer chemotherapy: mechanism of tumoritropic accumulation of proteins and the antitumor agent smancs Cancer Res. 1986 46 6387 6392 2946403 Wilhelm S. Tavares A. J. Dai Q. Ohta S. Audet J. Dvorak H. F. Chan W. C. W. Analysis of nanoparticle delivery to tumours Nat. Rev. Mater. 2016 1 16014 Mittelheisser V. Coliat P. Moeglin E. Goepp L. Goetz J. G. Charbonnière L. J. Pivot X. Detappe A. Optimal Physicochemical Properties of Antibody–Nanoparticle Conjugates for Improved Tumor Targeting Adv. Mater. 2022 34 2110305 10.1002/adma.202110305 35289003 Rosenblum D. Joshi N. Tao W. Karp J. M. Peer D. Progress and challenges towards targeted delivery of cancer therapeutics Nat. Commun. 2018 9 1410 29650952 10.1038/s41467-018-03705-y PMC5897557 Drago J. Z. Modi S. Chandarlapaty S. Unlocking the potential of antibody–drug conjugates for cancer therapy Nat. Rev. Clin. Oncol. 2021 18 327 344 33558752 10.1038/s41571-021-00470-8 PMC8287784 Hamblett K. J. Senter P. D. Chace D. F. Sun M. M. Lenox J. Cerveny C. G. Kissler K. M. Bernhardt S. X. Kopcha A. K. Zabinski R. F. Meyer D. L. Francisco J. A. Effects of drug loading on the antitumor activity of a monoclonal antibody drug conjugate Clin. Cancer Res. 2004 10 7063 7070 15501986 10.1158/1078-0432.CCR-04-0789 Johnston M. C. Scott C. J. Antibody conjugated nanoparticles as a novel form of antibody drug conjugate chemotherapy Drug Discovery Today: Technol. 2018 30 63 69 10.1016/j.ddtec.2018.10.003 30553522 Howes P. D. Chandrawati R. Stevens M. M. Bionanotechnology. Colloidal nanoparticles as advanced biological sensors Science 2014 346 1247390 25278614 10.1126/science.1247390 Ashoka A. H. Aparin I. O. Reisch A. Klymchenko A. S. Brightness of fluorescent organic nanomaterials Chem. Soc. Rev. 2023 52 4525 4548 37338018 10.1039/d2cs00464j PMC10351213 Goutayer M. Dufort S. Josserand V. Royère A. Heinrich E. Vinet F. Bibette J. Coll J. L. Texier I. Tumor targeting of functionalized lipid nanoparticles: assessment by in vivo fluorescence imaging Eur. J. Pharm. Biopharm. 2010 75 137 147 20149869 10.1016/j.ejpb.2010.02.007 Attia M. F. Swasy M. I. Akasov R. Alexis F. Whitehead D. C. Strategies for High Grafting Efficiency of Functional Ligands to Lipid Nanoemulsions for RGD-Mediated Targeting of Tumor Cells In Vitro ACS Appl. Bio Mater. 2020 3 5067 5079 10.1021/acsabm.0c00567 35021683 Sobot D. Mura S. Yesylevskyy S. O. Dalbin L. Cayre F. Bort G. Mougin J. Desmaële D. Lepetre-Mouelhi S. Pieters G. Andreiuk B. Klymchenko A. S. Paul J.-L. Ramseyer C. Couvreur P. Conjugation of squalene to gemcitabine as unique approach exploiting endogenous lipoproteins for drug delivery Nat. Commun. 2017 8 15678 28555624 10.1038/ncomms15678 PMC5459998 Bou S. Wang X. Anton N. Bouchaala R. Klymchenko A. S. Collot M. Lipid-core/polymer-shell hybrid nanoparticles: synthesis and characterization by fluorescence labeling and electrophoresis Soft Matter 2020 16 4173 4181 32286601 10.1039/d0sm00077a Belcastro E. Rehman A. U. Remila L. Park S.-H. Gong D. S. Anton N. Auger C. Lefebvre O. Goetz J. G. Collot M. Klymchenko A. S. Vandamme T. F. Schini-Kerth V. B. Fluorescent nanocarriers targeting VCAM-1 for early detection of senescent endothelial cells Nanomed. Nanotechnol. Biol. Med. 2021 102379 10.1016/j.nano.2021.102379 33713860 Atreya R. Neumann H. Neufert C. Waldner M. J. Billmeier U. Zopf Y. Willma M. App C. Münster T. Kessler H. Maas S. Gebhardt B. Heimke-Brinck R. Reuter E. Dörje F. Rau T. T. Uter W. Wang T. D. Kiesslich R. Vieth M. Hannappel E. Neurath M. F. In vivo imaging using fluorescent antibodies to tumor necrosis factor predicts therapeutic response in Crohn's disease Nat. Med. 2014 20 313 318 24562382 10.1038/nm.3462 PMC4479137 Schnell U. Dijk F. Sjollema K. A. Giepmans B. N. Immunolabeling artifacts and the need for live-cell imaging Nat. Methods 2012 9 152 158 22290187 10.1038/nmeth.1855 Peer D. Karp J. M. Hong S. FaroKhzad O. C. Margalit R. Langer R. Nanocarriers as an emerging platform for cancer therapy Nat. Nanotechnol. 2007 2 751 760 18654426 10.1038/nnano.2007.387 Colombo M. Fiandra L. Alessio G. Mazzucchelli S. Nebuloni M. De Palma C. Kantner K. Pelaz B. Rotem R. Corsi F. Parak W. J. Prosperi D. Tumour homing and therapeutic effect of colloidal nanoparticles depend on the number of attached antibodies Nat. Commun. 2016 7 13818 27991503 10.1038/ncomms13818 PMC5187442 Nau F. Guérin-Dubiard C. Croguennec T. Avidin Bioactive Egg Compounds 2007 Wayment J. R. Harris J. M. Biotin-avidin binding kinetics measured by single-molecule imaging Anal. Chem. 2009 81 336 342 19117461 10.1021/ac801818t Swain S. M. Shastry M. Hamilton E. Targeting HER2-positive breast cancer: advances and future directions Nat. Rev. Drug Discovery 2023 22 101 126 36344672 10.1038/s41573-022-00579-0 PMC9640784 Vangala M. Shinde G. P. p-Nitrophenyl carbonate promoted ring-opening reactions of DBU and DBN affording lactam carbamates Beilstein J. Org. Chem. 2016 12 2086 2092 27829914 10.3762/bjoc.12.197 PMC5082618 Bowers Jr G. N. McComb R. B. Christensen R. G. Schaffer R. High-purity 4-nitrophenol: purification, characterization, and specifications for use as a spectrophotometric reference material Clin. Chem. 1980 26 724 729 7371150 Patravale V. Dandekar P. Jain R. Nanoparticulate Drug Delivery V. Patravale P. Dandekar R. Jain Woodhead Publishing 2012 Wöll D. Fluorescence correlation spectroscopy in polymer science RSC Adv. 2014 4 2447 2465 Klymchenko A. S. Roger E. Anton N. Anton H. Shulov I. Vermot J. Mely Y. Vandamme T. F. Highly lipophilic fluorescent dyes in nano-emulsions: towards bright non-leaking nano-droplets RSC Adv. 2012 2 11876 11886 29242742 10.1039/C2RA21544F PMC5726488 Liedl T. Keller S. Simmel F. C. Rädler J. O. Parak W. J. Fluorescent nanocrystals as colloidal probes in complex fluids measured by fluorescence correlation spectroscopy Small 2005 1 997 1003 17193385 10.1002/smll.200500108 Röcker C. Pötzl M. Zhang F. Parak W. J. Nienhaus G. U. A quantitative fluorescence study of protein monolayer formation on colloidal nanoparticles Nat. Nanotechnol. 2009 4 577 580 19734930 10.1038/nnano.2009.195 Runser A. Dujardin D. Ernst P. Klymchenko A. S. Reisch A. Zwitterionic Stealth Dye-Loaded Polymer Nanoparticles for Intracellular Imaging ACS Appl. Mater. Interfaces 2020 12 117 125 31872751 10.1021/acsami.9b15396 Jain A. Barve A. Zhao Z. Jin W. Cheng K. Comparison of Avidin, Neutravidin, and Streptavidin as Nanocarriers for Efficient siRNA Delivery Mol. Pharm. 2017 14 1517 1527 28026957 10.1021/acs.molpharmaceut.6b00933 PMC6628714 Melnychuk N. Klymchenko A. S. DNA-Functionalized Dye-Loaded Polymeric Nanoparticles: Ultrabright FRET Platform for Amplified Detection of Nucleic Acids J. Am. Chem. Soc. 2018 140 10856 10865 30067022 10.1021/jacs.8b05840 Yudhistira T. Da Silva E. C. Combes A. Lehmann M. Reisch A. Klymchenko A. S. Biotinylated Fluorescent Polymeric Nanoparticles for Enhanced Immunostaining Small Methods 2023 e2201452 36808832 10.1002/smtd.202201452 Gupta P. Makowski E. K. Kumar S. Zhang Y. Scheer J. M. Tessier P. M. Antibodies with Weakly Basic Isoelectric Points Minimize Trade-offs between Formulation and Physiological Colloidal Properties Mol. Pharm. 2022 19 775 787 35108018 10.1021/acs.molpharmaceut.1c00373 PMC9350878 Coussens L. Yang-Feng T. L. Liao Y.-C. Chen E. Gray A. McGrath J. Seeburg P. H. Libermann T. A. Schlessinger J. Francke U. Levinson A. Ullrich A. Tyrosine Kinase Receptor with Extensive Homology to EGF Receptor Shares Chromosomal Location with neu Science 1985 230 1132 1139 2999974 10.1126/science.2999974 Slamon D. J. Godolphin W. Jones L. A. Holt J. A. Wong S. G. Keith D. E. Levin W. J. Stuart S. G. Udove J. Ullrich A.  et al. Science 1989 244 707 712 2470152 10.1126/science.2470152 Bonnet S. Prévot G. Mornet S. Jacobin-Valat M.-J. Mousli Y. Hemadou A. Duttine M. Trotier A. Sanchez S. Duonor-Cérutti M. Crauste-Manciet S. Clofent-Sanchez G. A Nano-Emulsion Platform Functionalized with a Fully Human scFv-Fc Antibody for Atheroma Targeting: Towards a Theranostic Approach to Atherosclerosis Int. J. Mol. Sci. 2021 22 5188 34068875 10.3390/ijms22105188 PMC8153629 Navarro-Marchal S. A. Griñán-Lisón C. Entrena J.-M. Ruiz-Alcalá G. Tristán-Manzano M. Martin F. Pérez-Victoria I. Peula-García J. M. Marchal J. A. Anti-CD44-Conjugated Olive Oil Liquid Nanocapsules for Targeting Pancreatic Cancer Stem Cells Biomacromolecules 2021 22 1374 1388 33724003 10.1021/acs.biomac.0c01546 Sana S. S. Chandel A. K. S. Raorane C. J. Aly Saad Aly M. Kim S.-C. Raj V. Sangkil L. Recent advances in nano and micro formulations of Ginsenoside to enhance their therapeutic efficacy Phytomedicine 2024 134 156007 39276537 10.1016/j.phymed.2024.156007 Yan Z. Yu T. Wu X. Deng M. Wei P. Su N. Ding Y. Xia D. Zhang Y. Zhang L. Chen T. Nanoemulsion based lipid nanoparticles for effective demethylcantharidin delivery to cure liver cancer Chem. Biol. Drug Des. 2024 104 e14580 39031936 10.1111/cbdd.14580 Yumura K. Ui M. Doi H. Hamakubo T. Kodama T. Tsumoto K. Sugiyama A. Mutations for decreasing the immunogenicity and maintaining the function of core streptavidin Protein Sci. 2013 22 213 221 23225702 10.1002/pro.2203 PMC3588917 Rehman A. U. Anton N. Bou S. Schild J. Messaddeq N. Vandamme T. Akram S. Klymchenko A. Collot M. Tunable functionalization of nano-emulsions using amphiphilic polymers Soft Matter 2021 17 1788 1795 33398307 10.1039/d0sm01952f Prévot G. Duonor-Cérutti M. Larivière M. Laroche-Traineau J. Jacobin-Valat M. J. Barthélémy P. Clofent-Sanchez G. Crauste-Manciet S. Data on atherosclerosis specific antibody conjugation to nanoemulsions Data Brief 2017 15 824 827 29159220 10.1016/j.dib.2017.10.058 PMC5676083 ",
  "metadata": {
    "Title of this paper": "Data on atherosclerosis specific antibody conjugation to nanoemulsions",
    "Journal it was published in:": "Nanoscale Advances",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489389/"
  }
}