{
  "title": "Paper_963",
  "abstract": "pmc Pharmaceutics Pharmaceutics 2103 pharmamdpi pharmaceutics Pharmaceutics 1999-4923 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473271 PMC12473271.1 12473271 12473271 41012461 10.3390/pharmaceutics17091124 pharmaceutics-17-01124 1 Article Green Synthesis of Bioactive Silver Nanoparticles from Fagopyrum esculentum https://orcid.org/0000-0002-2827-3217 Macovei Irina Conceptualization Methodology Investigation Writing – original draft Writing – review & editing 1 https://orcid.org/0000-0003-0904-0060 Luca Simon Vlad Investigation Writing – original draft 2 https://orcid.org/0000-0002-9313-5929 Skalicka-Woźniak Krystyna Methodology Resources 3 Sacarescu Liviu Investigation Resources 4 https://orcid.org/0000-0003-0982-0040 Rimbu Cristina Mihaela Methodology Investigation 5 Vochita Gabriela Methodology Investigation Resources 6 Aprotosoaie Ana Clara Writing – original draft Writing – review & editing 1 https://orcid.org/0000-0003-4061-2143 Corciova Andreia Methodology Supervision 1 https://orcid.org/0000-0002-0353-4564 Miron Anca Conceptualization Writing – original draft Writing – review & editing Supervision 1 * Zannella Carla Academic Editor De Filippis Anna Academic Editor 1 irina-macovei@umfiasi.ro 2 3 4 5 6 * anca.miron@umfiasi.ro 28 8 2025 9 2025 17 9 497664 1124 12 7 2025 31 7 2025 12 8 2025 28 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives Methods Fagopyrum esculentum Results 50 Staphylococcus aureus Staphylococcus epidermidis 50 Conclusions buckwheat hulls silver nanoparticles A-375 human malignant melanoma cells MRSA Staphylococcus epidermidis Core Program, developed with the support of the Romanian Ministry of Research, Innovation, and Digitization contract no. 7N/2023, project PN 23020402 This study benefited from partial support through a grant from the Core Program, developed with the support of the Romanian Ministry of Research, Innovation, and Digitization, contract no. 7N/2023, project PN 23020402. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Food waste represents a global challenge with significant economic, health, and environmental consequences. An effective management of the supply chain, consumer education on food preservation, and the conversion of food waste into value-added products are essential in tackling this issue [ 1 2 1 The use of an aqueous extract from the fruit peel of Punica granatum Staphylococcus aureus Staphylococcus epidermidis Escherichia coli Pseudomonas aeruginosa Klebsiella pneumoniae Salmonella typhi Proteus vulgaris 3 4 Citrus limon E. coli Salmonella typhimurium P. aeruginosa S. aureus 5 Citrus paradisi C. paradisi S. aureus Enterococcus faecalis E. coli 6 Citrus macroptera 7 Musa paradisiaca Candida albicans Candida lipolytica E. coli S. epidermidis S. aureus Bacillus anthracis Proteus mirabilis 8 9 Pisum sativum E. coli Enterococcus faecium S. typhimurium Salmonella enterica 2 Hylocereus undatus S. aureus E. coli P. aeruginosa 10 S. aureus P. mirabilis, Psidium guavaja Cucurbita pepo 11 Mangifera indica E. coli S. aureus 12 Given the valuable potential of plant wastes in the generation of AgNPs, we chose to explore the capacity of two extracts derived from Fagopyrum esculentum 13 14 S. aureus 15 16 2. Materials and Methods 2.1. Chemicals and Reagents 2,2-Diphenyl-1-picrylhydrazyl (DPPH) radical, 2,2′-azinobis(3-ethylbenzothiazoline-6-sulfonic acid) (ABTS) diammonium salt, HPLC-grade acetonitrile, HPLC-grade formic acid, dimethyl sulfoxide (DMSO), Folin–Ciocalteu phenol reagent, gallic acid, silver nitrate (AgNO 3 2.2. Microorganisms S. aureus S. epidermidis E. coli P. aeruginosa 2.3. Cell Lines African green monkey kidney (Vero, ATCC ® TM ® TM 2.4. Preparation and Chemical Characterization of Buckwheat Hull Extracts 2.4.1. Preparation of Buckwheat Hull Extracts The extraction of buckwheat hulls followed a previously reported method, with minor changes. Briefly, 10 g of ground buckwheat hulls (Bio Backerei Spiegelhauer, Dresden, Germany) were stirred for 3 h at room temperature with 100 mL of 70% ethanol ( v v 17 18 19 2.4.2. Qualitative Analysis of Buckwheat Hull Extracts The chemical composition of buckwheat hull extracts was investigated by liquid chromatography coupled to high-resolution tandem mass spectrometry (LC-HRMS/MS). The analysis was conducted on an Agilent 1200 HPLC system (Agilent Technologies, Santa Clara, CA, USA). The chromatographic and MS conditions were applied as previously described [ 17 18 20 2.4.3. Quantitative Analysis of Buckwheat Hull Extracts The phenolic contents of buckwheat hull extracts, as well as the phenolic contents in the reaction mixtures before and after the synthesis and separation of AgNPs, were determined spectrophotometrically, using the Folin–Ciocalteu method, as previously reported [ 17 18 21 2.5. Optimization of AgNP Synthesis The green synthesis of AgNPs using the buckwheat hull extracts was optimized as previously described [ 18 22 23 24 3 3 v v 3 3 v v 2.6. Characterization of AgNPs AgNP pellets were analyzed by attenuated total reflection Fourier transform infrared spectroscopy (ATR-FTIR) (Bruker Alpha-P ATR FTIR spectrometer, Bruker, Ettlingen, Germany) and scanning electron microscopy (SEM) coupled with energy-dispersive X-ray spectroscopy (EDX) (Quanta 200 scanning electron microscope equipped with an energy dispersive spectrometer, FEI Company, Hillsboro, OR, USA), whereas AgNP colloidal dispersions were subjected to transmission electron microscopy (TEM) (Hitachi High-Tech HT7700 transmission electron microscope equipped with a Bruker EDX detector, Hitachi High-Technologies Corporation, Tokyo, Japan) and dynamic light scattering (DLS) (Malvern Zetasizer Nano-ZS, Malvern Instruments, Malvern, UK). Sample preparation and experimental conditions for each analysis were carried out according to previously described protocols [ 17 18 2.7. Antioxidant Activity 2.7.1. DPPH Radical Scavenging Assay The DPPH radical scavenging activity was evaluated according to earlier reports. The EC 50 18 25 2.7.2. ABTS Radical Cation Scavenging Assay The ABTS radical cation scavenging activity was assessed following a previously reported method [ 18 26 50 Section 2.7.1 2.8. Cytotoxic Activity 2.8.1. Cell Cultures In order to achieve an optimal cell confluence (>90%), Vero and A-375 cells were cultured in DMEM supplemented with fetal bovine serum, penicillin (100 μg/mL), and streptomycin (100 IU/mL), and incubated at 37 °C in a humidified atmosphere (5% CO 2 18 27 2.8.2. Cell Viability Cell viability was evaluated using the MTT assay, as previously described [ 18 28 29 30 50 t 2.8.3. Cell Morphology The morphological alterations in Vero and A-375 cells, after 24 and 48 h of exposure to AgNPs, were examined using a Nikon Eclipse TS100 inverted microscope (Nikon, Tokyo, Japan) with a digital camera (MSHOT MS60). 2.9. Antibacterial Activity The antibacterial activity was assessed using the broth microdilution method, as previously described [ 18 31 32 33 18 3. Results 3.1. Chemical Characterization of Buckwheat Hull Extracts In total, 18 and 9 compounds were tentatively identified by LC-HRMS/MS in hydroethanolic and aqueous buckwheat hull extracts ( Figure 1 Table 1 Quantitative studies showed a higher phenolic content in the buckwheat aqueous hull extract (493.08 ± 23.28 μg/mL) than in the hydroethanolic extract (397.62 ± 6.25 μg/mL). In the reaction mixtures used for the optimal synthesis of AgNPs [0.5:9.5 ( v v 3 v v 3 3.2. Optimization of AgNP Synthesis The synthesis of AgNPs from the hydroethanolic and aqueous buckwheat hull extracts was monitored and confirmed by UV-Vis spectroscopy. The formation of a surface plasmon resonance (SPR) band at 400–500 nm, resulting from the collective oscillations of free electrons in metallic silver, along with a color change, indicated the generation of AgNPs [ 43 max max 3.2.1. AgNO 3 The impact of AgNO 3 3 3 3 max 3 3 max Figure 2 3 max max 3 3.2.2. Plant Extract to AgNO 3 Six experiments were performed for each type of extract, by varying the ratio between the extract and silver salt as follows: 0.5:9.5, 1:9, 2:8, 3:7, 5:5, and 7:3 ( v v Figure 2 3 max 3 max 3 max 3 Figure 2 3 max max 3 max Figure 2 3 3.2.3. pH The pH value of the reaction medium has a strong impact on the dynamics of AgNP synthesis. In our study, the synthesis of AgNPs was carried out at pH values ranging from 2 to 10 ( Figure 2 max max max 3.2.4. Temperature In general, the temperature of the reaction medium plays a vital role in AgNP synthesis. Therefore, our study included a set of experiments to evaluate the impact of various temperatures ranging from 30 to 60 °C on AgNP synthesis. The UV-Vis spectra ( Figure 2 max max max 3.2.5. Reaction Time The synthesis of AgNPs was monitored at different time intervals over two hours (0, 10, 20, 30, 40, 50, 60, 90, and 120 min) of magnetic stirring. Additionally, spectral data were collected at 24 h post-stirring ( Figure 2 3 max max The optimized parameters for the synthesis of AgNPs from the hydroethanolic buckwheat hull extract were 2 mM AgNO 3 3 v v 3 3 v v 3.3. Characterization of AgNPs 3.3.1. ATR-FTIR Spectroscopy The ATR-FTIR spectra of AgNP pellets were compared with those of the buckwheat hull extracts used in their synthesis (after concentration under reduced pressure at 40 °C, followed by freeze-drying) ( Figure 3 18 44 −1 −1 −1 2 3 18 45 −1 46 −1 17 47 −1 48 −1 49 3.3.2. DLS Analysis DLS analysis enabled the measurement of the mean diameter of AgNPs in the hydrated state (mean hydrodynamic diameter, Z-average), along with their polydispersity index (PDI) and zeta potential values ( Figure 4 50 51 3.3.3. SEM-EDX Analysis The SEM images (magnification of 10,000×), which were acquired in the secondary electron (SE) mode, revealed the presence of unevenly distributed spherical aggregates of AgNPs ( Figure 5 52 53 0 Figure 5 3.3.4. TEM Analysis TEM analysis was used to assess the shape and size of AgNPs in their dehydrated state. Relevant TEM images for AgNPs synthesized from the hydroethanolic and aqueous buckwheat hull extracts are illustrated at different scales in Figure 6 Figure 6 Figure 6 Figure 6 Figure 6 3.4. Antioxidant Activity 3.4.1. DPPH Radical Scavenging Activity Both AgNPs expressed antioxidant activity in a dose-dependent manner ( Figure 7 50 Table 2 3.4.2. ABTS Radical Cation Scavenging Activity The ABTS radical cation scavenging effects of AgNPs were dose-dependent ( Figure 8 50 Table 2 3.5. Cytotoxic Activity The cytotoxic activity of AgNPs was dependent on the concentration and time of exposure. A concentration of only 6.25 μg/mL of AgNPs synthesized from the hydroethanolic buckwheat hull extract reduced the viability of A-375 cells to 17.18 ± 0.65% after 48 h exposure ( Figure 9 Figure 9 Figure 9 Figure 9 Figure 9 50 Table 2 The morphology of A-375 and Vero cells treated with AgNPs derived from the buckwheat hull extracts (3.12–25 µg/mL) for 24 and 48 h was studied and compared. Figures S1–S4 Supplementary Materials 3.6. Antibacterial Activity The antibacterial activities of AgNPs derived from buckwheat hull extracts were evaluated against Gram-positive ( S. aureus S. epidermidis E. coli P. aeruginosa Table 3 S. aureus E. coli S. epidermidis P. aeruginosa The buckwheat hull extracts led to the formation of AgNPs with distinct physicochemical and biological properties, attributable to variations in synthesis conditions and extract composition. Thus, AgNPs derived from the hydroethanolic buckwheat hull extract showed higher diameters in both hydrated and dehydrated states and various shapes. AgNPs derived from the aqueous buckwheat hull extract were predominantly spherical in shape. Both samples of AgNPs exhibited similar electrostatic stability. With regard to the biological activity, AgNPs derived from the hydroethanolic buckwheat hull extract exhibited higher antibacterial activity against MRSA and S. epidermidis 4. Discussion Plant extract-mediated synthesis of AgNPs is simple, efficient, fast, economical [ 54 55 56 57 In this study, AgNPs were synthesized using buckwheat hull extracts. The involvement of phenolic compounds in the synthesis of AgNPs was supported by the differences in phenolic content between the initial reaction mixture (plant extract and AgNO 3 The biological activities of AgNPs are influenced by their physicochemical properties, which can be modulated by adjusting the synthesis conditions [ 58 The AgNO 3 3 3 58 3 59 3 59 60 61 3 3 pH is another parameter with a decisive role in the synthesis of AgNPs. In an alkaline environment, the hydroxyl groups of phenolic compounds are deprotonated, generating anions [ 62 63 64 65 66 Another important factor affecting AgNP synthesis is temperature. A high temperature of the reaction medium increases the kinetic energy of molecules, which accelerates the production of smaller AgNPs [ 65 67 68 The reaction time is essential to ensure the complete reduction of silver ions to metallic silver while also modulating the shape and size of AgNPs. Most commonly, after a certain period of reaction time, no significant changes were observed in the UV-Vis spectra of AgNPs, suggesting that all available silver ions had been consumed [ 69 Generally, AgNPs synthesized using plants possess antioxidant activity mostly due to compounds found in the plant extracts that cap and stabilize the surface of AgNPs. Silver nanoparticles exhibit enhanced reactivity due to their high surface area-to-volume ratio, as the reduction reactions occur on their surface [ 70 71 72 50 50 18 50 50 Plant extract-derived AgNPs have demonstrated significant cytotoxicity against various malignant cell lines. The cytotoxic mechanisms include the induction of apoptosis, cell cycle arrest, modulation of various signaling pathways, and activation of endoplasmic reticulum stress. Phytochemicals present in the plant extracts used for AgNP synthesis play a crucial role in their antitumor activity. Those possessing intrinsic anticancer properties potentiate the overall bioactivity of AgNPs [ 73 74 50 n 75 76 77 73 74 78 79 50 50 16 15 80 81 Our study showed variation in the cellular response between the two cell lines. The accumulation of AgNPs in the culture medium of Vero cells treated with concentrations above 6.25 μg/mL can be attributed both to the small size of Vero cells, which limits their ability to efficiently internalize AgNPs, and to their low division rate compared to A-375 cells, resulting in fewer viable cells observed under the microscope. In contrast, A-375 cells, due to their larger size and faster proliferation rate, reach high cell densities within a short time and internalize AgNPs efficiently [ 82 The AgNPs obtained in this study also demonstrated antibacterial activity. As previously stated, the bioactivity of AgNPs synthesized using plant extracts is determined by both the metallic silver core and the phytochemicals that coat the nanoparticles [ 83 84 Bacillus cereus, S. aureus, E. faecalis Salmonella choleraesuis, E. coli, P. mirabillis 85 86 87 86 88 89 90 91 79 18 S. aureus E. faecalis E. coli P. aeruginosa 16 MRSA represents a serious threat to global health, causing severe and difficult-to-control infections that primarily affect the skin and subcutaneous tissues but can also involve the bones, joints, lungs, and endocardium [ 92 93 94 Citrus maxima Moringa oleifera 95 96 97 S. epidermidis 98 Cotyledon orbiculata Salvadora persica S. epidermidis 99 100 P. aeruginosa E. coli P. aeruginosa E. coli 18 100 P. aeruginosa 99 101 The main findings of the present study are summarized in Figure 10 5. Conclusions In this study, AgNPs were synthesized via a green synthesis approach using the hydroethanolic and aqueous extracts of buckwheat ( F. esculentum S. epidermidis Acknowledgments Valeria Harabagiu (Petru Poni Institute of Macromolecular Chemistry, Iasi, Romania) is gratefully acknowledged for supporting this work. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/pharmaceutics17091124/s1 Author Contributions Conceptualization, I.M. and A.M.; methodology, I.M., K.S.-W., C.M.R., G.V. and A.C.; investigation, I.M., S.V.L., L.S., C.M.R. and G.V.; resources, K.S.-W., L.S. and G.V.; writing—original draft preparation, I.M., S.V.L., A.C.A. and A.M.; writing—review and editing, I.M., A.C.A. and A.M.; supervision, A.C. and A.M. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement The original contributions presented in this study are included in the article. Further inquiries can be directed to the corresponding author. Conflicts of Interest The authors declare no conflicts of interest. References 1. Priya A.S. Afzal O. Khalid M. Faruque Ahmad M. Upadhyay A. Kumar S. Garg A. Ramzan M. Hussain A. Altamimi M.A. Biogenic nanoparticles from waste fruit peels: Synthesis, applications, challenges and future perspectives Int. J. Pharm. 2023 643 123223 10.1016/j.ijpharm.2023.123223 37442399 2. Patra J.K. Das G. Shin H.S. Facile green biosynthesis of silver nanoparticles using Pisum sativum Int. J. Nanomed. 2019 14 6679 6690 10.2147/IJN.S212614 31695363 PMC6707436 3. Ahmad N. Sharma S. Rai R. Rapid green synthesis of silver and gold nanoparticles using peels of Punica granatum Adv. Mater. Lett. 2012 3 376 380 10.5185/amlett.2012.5357 4. Devanesan S. AlSalhi M.S. Balaji R.V. Ranjitsingh A.J.A. Ahamed A. Alfuraydi A.A. AlQahtani F.Y. Aleanizy F.S. Othman A.H. Antimicrobial and cytotoxicity effects of synthesized silver nanoparticles from Punica granatum Nanoscale Res. Lett. 2018 13 315 10.1186/s11671-018-2731-y 30288618 PMC6172160 5. Alkhulaifi M.M. Alshehri J.H. Alwehaibi M.A. Awad M.A. Al-Enazi N.M. Aldosari N.S. Hatamleh A.A. Abdel- Raouf N. Green synthesis of silver nanoparticles using Citrus limon Saudi J. Biol. Sci. 2020 27 3434 3441 10.1016/j.sjbs.2020.09.031 33304153 PMC7715020 6. Arsène M.M.J. Podoprigora I.V. Davares A.K.L. Razan M. Das M.S. Senyagin A.N. Antibacterial activity of grapefruit peel extracts and green-synthesized silver nanoparticles Vet. World 2021 14 1330 1341 10.14202/vetworld.2021.1330-1341 34220139 PMC8243687 7. Saha P. Mahiuddin M. Islam A.B.M.N. Ochiai B. Biogenic synthesis and catalytic efficacy of silver nanoparticles based on peel extracts of Citrus macroptera ACS Omega 2021 6 18260 18268 10.1021/acsomega.1c02149 34308057 PMC8296544 8. Bankar A. Joshi B. Kumar A.R. Zinjarde S. Banana peel extract mediated novel route for the synthesis of silver nanoparticles Colloids Surf. A Physicochem. Eng. Asp. 2010 368 58 63 10.1016/j.colsurfa.2010.07.024 9. Dang H. Fawcett D. Poinern G.E.J. Biogenic synthesis of silver nanoparticles from waste banana plant stems and their antibacterial activity against Escherichia coli Staphylococcus epidermis Int. J. Res. Med. Sci. 2017 5 3769 10.18203/2320-6012.ijrms20173947 10. Phongtongpasuk S. Poadang S. Yongvanich N. Environmental-friendly method for synthesis of silver nanoparticles from Dragon fruit peel extract and their antibacterial activities Energy Procedia 2016 89 239 247 10.1016/j.egypro.2016.05.031 11. Tasiu M. Abdulmumin Y. Abdulmumin T.M. Murtala M. Shehu A. Abubakar A.L. Zainab S. Mustapha R.K. Binta S.S. Antimicrobial evaluation of biologically synthesized silver nanoparticles using aqueous peel extracts of guava ( Psidium guavaja Cucurbita pepo Asian J. Biotechnol. Genet. Eng. 2022 5 80 89 12. Xing Y. Liao X. Liu X. Li W. Huang R. Tang J. Xu Q. Li X. Yu J. Characterization and antimicrobial activity of silver nanoparticles synthesized with the peel extract of mango Materials 2021 14 5878 10.3390/ma14195878 34640275 PMC8510210 13. Zhang Z. Fan S. Duncan G.J. Morris A. Henderson D. Morrice P. Russell W.R. Duncan S.H. Neacsu M. Buckwheat ( Fagopyrum esculentum Int. J. Mol. Sci. 2023 24 16310 10.3390/ijms242216310 38003497 PMC10671810 14. Li H. Lv Q. Liu A. Wang J. Sun X. Deng J. Chen Q. Wu Q. Comparative metabolomics study of tartary ( Fagopyrum tataricum Fagopyrum esculentum Food Chem. 2022 371 131125 10.1016/j.foodchem.2021.131125 34563971 15. Phirange A.S. Sabharwal S.G. Green synthesis of silver nanoparticles using Fagopyrum esculentum Ind. J. Biotechnol. 2019 18 52 63 16. Karpuz Ö. Baltacı C. Gül A. Gülen J. Bozbeyoğlu P. Aydoğan N. Green synthesis of iron and silver nanoparticles from aqueous extract of buckwheat husk waste: Antibacterial, cytotoxic, and dye decolorization properties Biomass Conv. Bioref. 2024 10.1007/s13399-024-06287-6 17. Macovei I. Luca S.V. Skalicka-Woźniak K. Sacarescu L. Pascariu P. Ghilan A. Doroftei F. Ursu E.L. Rimbu C.M. Horhogea C.E. Phyto-functionalized silver nanoparticles derived from conifer bark extracts and evaluation of their antimicrobial and cytogenotoxic effects Molecules 2022 27 217 10.3390/molecules27010217 PMC8746316 35011449 18. Macovei I. Luca S.V. Skalicka-Woźniak K. Horhogea C.E. Rimbu C.M. Sacarescu L. Vochita G. Gherghel D. Ivanescu B.L. Panainte A.D. Silver nanoparticles synthesized from Abies alba Pinus sylvestris Antioxidants 2023 12 797 10.3390/antiox12040797 37107172 PMC10135277 19. Karthika V. Arumugam A. Gopinath K. Kaleeswarran P. Govindarajan M. Alharbi N.S. Kadaikunnan S. Khaled J.M. Benelli G. Gauzuma ulmifolia J. Photochem. Photobiol. B 2017 167 189 199 10.1016/j.jphotobiol.2017.01.008 28076823 20. Luca S.V. Miron A. Aprotosoaie A.C. Mihai C.T. Vochita G. Gherghel D. Ciocarlan N. Skalicka-Woźniak K. HPLC-DAD-ESI-Q-TOF-MS/MS profiling of Verbascum ovalifolium Phytochem. Anal. 2019 30 34 45 10.1002/pca.2788 30155925 21. Singleton V.L. Rossi A.J. Colorimetry of total phenolics with phosphomolybdic-phosphotungstic acid reagents Am. J. Enol. Vitic. 1965 16 144 158 10.5344/ajev.1965.16.3.144 22. Corciovă A. Mircea C. Fifere A. Turin-Moleavin I.A. Roşca I. Macovei I. Ivănescu B. Vlase A.M. Hăncianu M. Burlec A.F. Biogenic synthesis of silver nanoparticles mediated by Aronia melanocarpa Life 2024 14 1211 10.3390/life14091211 39337993 PMC11433241 23. Vikas S. Manjit S. Krishan S. Biogenic synthesis, optimisation and antibacterial efficacy of extracellular silver nanoparticles using novel fungal isolate Aspergillus fumigatus IET Nanobiotechnol. 2016 10 215 221 10.1049/iet-nbt.2015.0058 27463792 PMC8676568 24. Jiamboonsri P. Wanwong S. Photoassisted synthesis of silver nanoparticles using riceberry rice extract and their antibacterial application J. Nanomater. 2021 2021 5598924 10.1155/2021/5598924 25. Kharat S.N. Mendhulkar V.D. Synthesis, characterization and studies on antioxidant activity of silver nanoparticles using Elephantopus scaber Mat. Sci. Eng. C 2016 62 719 724 10.1016/j.msec.2016.02.024 26952477 26. Alahmad A. Feldhoff A. Bigall N.C. Rusch P. Scheper T. Walter J.G. Hypericum perforatum Nanomaterials 2021 11 487 10.3390/nano11020487 33673018 PMC7918618 27. Vunjak-Novakovic G. Freshney I. Culture of Cells for Tissue Engineering Wiley Hoboken, NJ, USA 2006 28. Mosmann T. Rapid colorimetric assay for cellular growth and survival: Application to proliferation and cytotoxicity assays J. Immunol. Methods 1983 65 55 63 10.1016/0022-1759(83)90303-4 6606682 29. Berridge M.V. Herst P.M. Tan A.S. Tetrazolium dyes as tools in cell biology: New insights into their cellular reduction Biotechnol. Annu. Rev. 2005 11 127 152 10.1016/S1387-2656(05)11004-7 16216776 30. Stockert J.C. Blázquez-Castro A. Cañete M. Horobin R.W. Villanueva Á. MTT assay for cell viability: Intracellular localization of the formazan product is in lipid droplets Acta Histochem. 2012 114 785 796 10.1016/j.acthis.2012.01.006 22341561 31. Aelenei P. Rimbu C.M. Horhogea C.E. Lobiuc A. Neagu A.N. Dunca S.I. Motrescu I. Dimitriu G. Aprotosoaie A.C. Miron A. Prenylated phenolics as promising candidates for combination antibacterial therapy: Morusin and kuwanon G Saudi Pharm. J. 2020 28 1172 1181 10.1016/j.jsps.2020.08.006 33132710 PMC7584796 32. Vega-Jiménez A.L. Vázquez-Olmos A.R. Acosta-Gío E. Álvarez-Pérez M.A. In vitro antimicrobial activity evaluation of metal oxide nanoparticles Nanoemulsions–Properties, Fabrications, and Applications Koh K.S. Wong V.L. IntechOpen London, UK 2019 10.5772/intechopen.84369 33. Massadeh M.I. Al-Masri M. Abu-Qatouseh L.F. Antibacterial activity of Peganum harmala Farmacia 2022 70 954 963 10.31925/farmacia.2022.5.22 34. KNApSAcK: A Comprehensive Species-Metabolite Relationship Database Available online: https://www.knapsackfamily.com/KNApSAcK/ (accessed on 12 February 2025) 35. Bujor A. Miron A. Luca S.V. Skalicka-Wozniak K. Silion M. Trifan A. Girard C. Demougeot C. Totoson P. Vasorelaxant effects of Crataegus pentagyna J. Ethnopharmacol. 2020 252 112559 10.1016/j.jep.2020.112559 31935497 36. Al-Yousef H.M. Hassan W.H.B. Abdelaziz S. Amina M. Adel R. El-Sayed M.A. UPLC-ESI-MS/MS profile and antioxidant, cytotoxic, antidiabetic, and antiobesity activities of the aqueous extracts of three different Hibiscus J. Chem. 2020 2020 6749176 10.1155/2020/6749176 37. Bujor A. Miron A. Luca S.V. Skalicka-Wozniak K. Silion M. Ancuceanu R. Dinu M. Girard C. Demougeot C. Totoson P. Metabolite profiling, arginase inhibition and vasorelaxant activity of Cornus mas Sorbus aucuparia Viburnum opulus Food Chem. Toxicol. 2019 133 110764 10.1016/j.fct.2019.110764 31437471 38. Zhang W. Zhu Y. Liu Q. Bao J. Liu Q. Identification and quantification of polyphenols in hull, bran and endosperm of common buckwheat ( Fagopyrum esculentum J. Funct. Foods 2017 38 363 369 10.1016/j.jff.2017.09.024 39. Llorent-Martinez E.J. Spinola V. Gouveia S. Castilho P.C. HPLC-ESI-MSn characterization of phenolic compounds, terpenoid saponins, and other minor compounds in Bituminaria bituminosa Ind. Crops Prod. 2015 69 80 90 10.1016/j.indcrop.2015.02.014 40. Kumar S. Singh A. Kumar B. Identification and characterization of phenolics and terpenoids from ethanolic extracts of Phyllanthus J. Pharm. Anal. 2017 7 214 222 10.1016/j.jpha.2017.01.005 29404041 PMC5790687 41. Yang W. Su Y. Dong G. Qian G. Shi Y. Mi Y. Zhang Y. Xue J. Du W. Shi T. Liquid chromatography–mass spectrometry-based metabolomics analysis of flavonoids and anthraquinones in Fagopyrum tataricum Food Chem. 2020 331 127354 10.1016/j.foodchem.2020.127354 32569973 42. Simirgiotis M.J. Silva M. Becerra J. Schmeda-Hirschmann G. Direct characterisation of phenolic antioxidants in infusions from four Mapuche medicinal plants by liquid chromatography with diode array detection (HPLC-DAD) and electrospray ionisation tandem mass spectrometry (HPLC-ESI-MS) Food Chem. 2012 131 318 327 10.1016/j.foodchem.2011.07.118 43. Jain N. Jain P. Rajput D. Patil U.K. Green synthesized plant-based silver nanoparticles: Therapeutic prospective for anticancer and antiviral activity Micro Nano Syst. Lett. 2021 9 5 10.1186/s40486-021-00131-6 44. Kumari R. Saini A.K. Kumar A. Saini R.V. Apoptosis induction in lung and prostate cancer cells through silver nanoparticles synthesized from Pinus roxburghii J. Biol. Inorg. Chem. 2020 25 23 37 10.1007/s00775-019-01729-3 31641851 45. Rizwana H. Khan M. Aldehaish H.A. Adil S.F. Shaik M.R. Assal M.E. Hatshan M.R. Siddiqui M.R.H. Green biosynthesis of silver nanoparticles using Vaccinium oxycoccos Crystals 2023 13 294 10.3390/cryst13020294 46. Kora A.J. Arunachalam J. Green fabrication of silver nanoparticles by Gum tragacanth ( Astragalus gummifer J. Nanomater. 2012 2012 869765 10.1155/2012/869765 47. Adib A.M. Jamaludin F. Kiong L.S. Hashim N. Abdullah Z. Two-dimensional correlation infrared spectroscopy applied to analyzing and identifying the extracts of Baeckea frutescens J. Pharm. Biomed. Anal. 2014 96 104 110 10.1016/j.jpba.2014.03.022 24727283 48. Harshiny M. Matheswaran M. Arthanareeswaran G. Kumaran S. Rajasree S. Enhancement of antibacterial properties of silver nanoparticles-ceftriaxone conjugate through Mukia maderaspatana Ecotoxicol. Environ. Saf. 2015 121 135 141 10.1016/j.ecoenv.2015.04.041 25982731 49. Katas H. Lim C.S. Nor Azlan A.Y.H. Buang F. Mh Busra M.F. Antibacterial activity of biosynthesized gold nanoparticles using biomolecules from Lignosus rhinocerotis Saudi Pharm. J. 2019 27 283 292 10.1016/j.jsps.2018.11.010 30766441 PMC6362174 50. Lomelí-Rosales D.A. Zamudio-Ojeda A. Reyes-Maldonado O.K. López-Reyes M.E. Basulto-Padilla G.C. Lopez-Naranjo E.J. Zuñiga-Mayo V.M. Velázquez-Juárez G. Green synthesis of gold and silver nanoparticles using leaf extract of Capsicum chinense Molecules 2022 27 1692 10.3390/molecules27051692 35268794 PMC8911899 51. Bhattacharjee S. DLS and zeta potential-what they are and what they are not? J. Contr. Release 2016 235 337 351 10.1016/j.jconrel.2016.06.017 27297779 52. Khatoon J. Mehmood A. Khalid A.R. Khan M.A.R. Ahmad K.S. Amjad M.S. Bashir U. Raffi M. Proćków J. Green-fabricated silver nanoparticles from Quercus incana Alternaria solani BMC Plant Biol. 2024 24 302 10.1186/s12870-024-05008-5 38637784 PMC11027421 53. Shankar T. Karthiga P. Swarnalatha K. Rajkumar K. Green synthesis of silver nanoparticles using Capsicum frutescence E. coli Res.-Eff. Technol. 2017 3 303 308 10.1016/j.reffit.2017.01.004 54. Ovais M. Khalil A.T. Raza A. Khan M.A. Ahmad I. Islam N.U. Saravanan M. Ubaid M.F. Ali M. Shinwari Z.K. Green synthesis of silver nanoparticles via plant extracts: Beginning a new era in cancer theranostics Nanomed 2016 12 3157 3177 10.2217/nnm-2016-0279 27809668 55. Borase H.P. Salunke B.K. Salunkhe R.B. Patil C.D. Hallsworth J.E. Kim B.S. Patil S.V. Plant extract: A promising biomatrix for ecofriendly, controlled synthesis of silver nanoparticles Appl. Biochem. Biotechnol. 2014 173 1 29 10.1007/s12010-014-0831-4 24622849 56. Heinemann M.G. Rosa C.H. Rosa G.R. Dias D. Biogenic synthesis of gold and silver nanoparticles used in environmental applications: A review Trend Environ. Anal. Chem. 2021 30 e00129 10.1016/j.teac.2021.e00129 57. Haridas E.S.H. Varma M.K.R. Chandra G.K. Bioactive silver nanoparticles derived from Carica papaya Sci. Rep. 2025 15 9001 10.1038/s41598-025-93864-y 40089549 PMC11910587 58. Sati A. Ranade T.N. Mali S.N. Ahmad Yasin H.K. Pratap A. Silver nanoparticles (AgNPs): Comprehensive insights into bio/synthesis, key influencing factors, multifaceted applications, and toxicity—A 2024 update ACS Omega 2025 10 7549 7582 10.1021/acsomega.4c11045 40060826 PMC11886731 59. Mashwani Z.R. Khan T. Khan M.A. Nadhman A. Synthesis in plants and plant extracts of silver nanoparticles with potent antimicrobial properties: Current status and future prospects Appl. Microbiol. Biotechnol. 2015 99 9923 9934 10.1007/s00253-015-6987-1 26392135 60. Ni Q. Zhu T. Wang W. Guo D. Li Y. Chen T. Zhang X. Green synthesis of narrow-size silver nanoparticles using Ginkgo biloba Int. J. Mol. Sci. 2024 25 1913 10.3390/ijms25031913 38339192 PMC10856183 61. Tanase C. Berta L. Mare A. Man A. Talmaciu A.I. Roșca I. Mircia E. Volf I. Popa V.I. Biosynthesis of silver nanoparticles using aqueous bark extract of Picea abies Eur. J. Wood Wood Prod. 2020 78 281 291 10.1007/s00107-020-01502-3 62. Majeed M. Hakeem K.R. Rehman R.U. Synergistic effect of plant extract coupled silver nanoparticles in various therapeutic applications- present insights and bottlenecks Chemosphere 2022 288 132527 10.1016/j.chemosphere.2021.132527 34637861 63. Handayani W. Ningrum A.S. Imawan C. The role of pH in synthesis silver nanoparticles using Pometia pinnata (matoa) leaves extract as bioreductor Proceedings of the Journal of Physics: Conference Series Institute of Physics Publishing Bristol, UK 2020 Volume 1428 64. Krishnaraj C. Ramachandran R. Mohan K. Kalaichelvan P.T. Optimization for rapid synthesis of silver nanoparticles and its effect on phytopathogenic fungi Spectrochim. Acta A Mol. Biomol. Spectrosc. 2012 93 95 99 10.1016/j.saa.2012.03.002 22465774 65. Verma A. Mehata M.S. Controllable synthesis of silver nanoparticles using neem leaves and their antimicrobial activity J. Radiat. Res. Appl. Sci. 2016 9 109 115 10.1016/j.jrras.2015.11.001 66. Seifipour R. Nozari M. Pishkar L. Green synthesis of silver nanoparticles using Tragopogon collinus J. Inorg. Organomet. Polym. Mater. 2020 30 2926 2936 10.1007/s10904-020-01441-9 67. Zhang Y. Cheng X. Zhang Y. Xue X. Fu Y. Biosynthesis of silver nanoparticles at room temperature using aqueous aloe leaf extract and antibacterial properties Colloids Surf. A Physicochem. Eng. Asp. 2013 423 63 68 10.1016/j.colsurfa.2013.01.059 68. Alharbi N.S. Alsubhi N.S. Felimban A.I. Green synthesis of silver nanoparticles using medicinal plants: Characterization and application J. Radiat. Res. Appl. Sci. 2022 15 109 124 10.1016/j.jrras.2022.06.012 69. Dhaka A. Chand Mali S. Sharma S. Trivedi R. A review on biological synthesis of silver nanoparticles and their potential applications Results Chem. 2023 6 101108 10.1016/j.rechem.2023.101108 70. Zykova M.V. Volikov A.B. Buyko E.E. Bratishko K.A. Ivanov V.V. Konstantinov A.I. Logvinova L.A. Mihalyov D.A. Sobolev N.A. Zhirkova A.M. Enhanced antioxidant activity and reduced cytotoxicity of silver nanoparticles stabilized by different humic materials Polymers 2023 15 3386 10.3390/polym15163386 37631443 PMC10457742 71. Sreelekha E. George B. Shyam A. Sajina N. Mathew B. A comparative study on the synthesis, characterization, and antioxidant activity of green and chemically synthesized silver nanoparticles J. Bionanosci. 2021 11 489 496 10.1007/s12668-021-00824-7 72. Mashilo C.M. Sibuyi N.R.S. Botha S. Meyer M. Razwinani M. Motaung K.S. Madiehe A.M. Antioxidant and antimicrobial activities of green-synthesized silver nanoparticles using a cocktail aqueous extract of Capparis sepiaria Tabernaemontana elegans ChemistrySelect 2025 10 e202404781 10.1002/slct.202404781 73. Fullstone G. Wood J. Holcombe M. Battaglia G. Modelling the transport of nanoparticles under blood flow using an agent-based approach Sci. Rep. 2015 5 10649 10.1038/srep10649 26058969 PMC4462051 74. Miethling-Graff R. Rumpker R. Richter M. Verano-Braga T. Kjeldsen F. Brewer J. Hoyland J. Rubahn H.G. Erdmann H. Exposure to silver nanoparticles induces size- and dose-dependent oxidative stress and cytotoxicity in human colon carcinoma cells Toxicol. Vitr. 2014 28 1280 1289 10.1016/j.tiv.2014.06.005 24997297 75. Kim S.H. Cui C.B. Kang I.J. Sun Y.K. Ham S.S. Cytotoxic effect of buckwheat ( Fagopyrum esculentum J. Med. Food 2007 10 232 238 10.1089/jmf.2006.1089 17651057 76. Yuan Y.G. Peng Q.L. Ggurunathan S. Silver nanoparticles enhance the apoptotic potential of gemcitabine in human ovarian cancer cells: Combination therapy for effective cancer treatment Int. J. Nanomed. 2017 12 6487 6502 10.2147/IJN.S135482 28919750 PMC5592960 77. Zielinska E. Zauszkiewicz-Pawlak A. Wojcik M. Inkielewicz-Stepniak I. Silver nanoparticles of different sizes induce a mixed type of programmed cell death in human pancreatic ductal adenocarcinoma Oncotarget 2017 9 4675 4697 10.18632/oncotarget.22563 29435134 PMC5797005 78. Sen Gupta A. Role of particle size, shape, and stiffness in design of intravascular drug delivery systems: Insights from computations, experiments, and nature Wiley Interdiscip. Rev. Nanomed. Nanobiotechnol. 2016 8 255 270 10.1002/wnan.1362 26306941 79. Barbalinardo M. Caicci F. Cavallini M. Gentili D. Protein corona mediated uptake and cytotoxicity of silver nanoparticles in mouse embryonic fibroblast Small 2018 14 e1801219 10.1002/smll.201801219 30058105 80. Böhme I. Bosserhoff A.K. Acidic tumor microenvironment in human melanoma Pigment. Cell Melanoma Res. 2016 29 508 523 10.1111/pcmr.12495 27233233 81. Van Gheluwe L. Chourpa I. Gaigne C. Munnier E. Polymer-based smart drug delivery systems for skin application and demonstration of stimuli-responsiveness Polymers 2021 13 1285 10.3390/polym13081285 33920816 PMC8071137 82. Awashra M. Młynarz P. The toxicity of nanoparticles and their interaction with cells: An in vitro metabolomic perspective Nanoscale Adv. 2023 5 2674 2723 10.1039/D2NA00534D 37205285 PMC10186990 83. Durán N. Durán M. de Jesus M.B. Seabra A.B. Fávaro W.J. Nakazato G. Silver nanoparticles: A new view on mechanistic aspects on antimicrobial activity Nanomed Nanotechnol. Biol. Med. 2016 12 789 799 10.1016/j.nano.2015.11.016 26724539 84. Woo K.J. Hye C.K. Ki W.K. Shin S. So H.K. Yong H.P. Antibacterial activity and mechanism of action of the silver ion in Staphylococcus aureus Escherichia coli Appl. Environ. Microbiol. 2008 74 2171 2178 10.1128/aem.02001-07 18245232 PMC2292600 85. Cabarkapa I.S. Sedej I.J. Sakac M.B. Saric L.C. Plavsic S.V. Antimicrobial activity of buckwheat ( Fagopyrum esculentum Food Feed Res. 2008 4 159 164 86. Roy A. Bulut O. Some S. Mandal A.K. Yilmaz M.D. Green synthesis of silver nanoparticles: Biomolecule-nanoparticle organizations targeting antimicrobial activity RSC Adv. 2019 9 2673 2702 10.1039/C8RA08982E 35520490 PMC9059941 87. Ferreyra Maillard A.P.V. Dalmasso P.R. López de Mishima B.A. Hollmann A. Interaction of green silver nanoparticles with model membranes: Possible role in the antibacterial activity Colloids Surf. B Biointerfaces 2018 171 320 326 10.1016/j.colsurfb.2018.07.044 30055472 88. Yacamán M.J. Ascencio J.A. Liu H.B. Gardea-Torresdey J. Structure shape and stability of nanometric sized particles J. Vac. Sci. Technol. B Microelectron. Nanometer Struct. 2001 19 1091 1103 10.1116/1.1387089 89. El-Zahry M.R. Mahmoud A. Refaat I.H. Mohamed H.A. Bohlmann H. Lendl B. Antibacterial effect of various shapes of silver nanoparticles monitored by SERS Talanta 2015 138 183 189 10.1016/j.talanta.2015.02.022 25863389 90. Alshareef A. Laird K. Cross R.B.M. Shape-dependent antibacterial activity of silver nanoparticles on Escherichia coli Enterococcus faecium Appl. Surf. Sci. 2017 424 310 315 10.1016/j.apsusc.2017.03.176 91. Ahmad A. Wei Y. Syed F. Tahir K. Rehman A.U. Khan A. Ullah S. Yuan Q. The effects of bacteria-nanoparticles interface on the antibacterial activity of green synthesized silver nanoparticles Microb. Pathog. 2017 102 133 142 10.1016/j.micpath.2016.11.030 27916692 92. Turner N.A. Sharma-Kuinkel B.K. Maskarinec S.A. Eichenberger E.M. Shah P.P. Carugati M. Holland T.L. Fowler V.G. Methicillin-resistant Staphylococcus aureus Nat. Rev. Microbiol. 2019 17 203 218 10.1038/s41579-018-0147-4 30737488 PMC6939889 93. Mlynarczyk-Bonikowska B. Kowalewski C. Krolak-Ulinska A. Marusza W. Molecular mechanisms of drug resistance in Staphylococcus aureus Int. J. Mol. Sci. 2022 23 8088 10.3390/ijms23158088 35897667 PMC9332259 94. ATCC Available online: https://www.atcc.org/products/43300-mini-pack (accessed on 10 March 2025) 95. Long Do B. Ha Bui T. Gia-Thien Ho T. Linh Duong N. Minh Nguyen V. Dang-Bao T. Nguyen T. Hong Phuong P. Green synthesis of nano-silver and its antibacterial activity against methicillin-resistant Staphylococcus aureus J. Saudi Chem. Soc. 2023 27 101722 10.1016/j.jscs.2023.101722 96. Moodley J.S. Krishna S.B.N. Pillay K. Sershen Govender P. Green synthesis of silver nanoparticles from Moringa oleifera Adv. Nat. Sci. Nanosci. Nanotechnol. 2018 9 015011 10.1088/2043-6254/aaabb2 97. Kuete V. Potential of Cameroonian plants and derived products against microbial infections: A review Planta Med. 2010 76 1479 1491 10.1055/s-0030-1250027 20533165 98. Macleod D.T. Cogen A.L. Gallo R.L. Skin Microbiology Encyclopedia of Microbiology Academic Press Cambridge, MA, USA 2009 734 747 99. Tyavambiza C. Elbagory A.M. Madiehe A.M. Meyer M. Meyer S. The antimicrobial and anti-inflammatory effects of silver nanoparticles synthesised from Cotyledon orbiculata Nanomaterials 2021 11 1343 10.3390/nano11051343 34065254 PMC8160699 100. Arshad H. Sami M.A. Sadaf S. Hassan U. Salvadora persica Sci. Rep. 2021 11 5996 10.1038/s41598-021-85584-w 33727607 PMC7966387 101. Chandrasekharan S. Chinnasamy G. Bhatnagar S. Sustainable phyto-fabrication of silver nanoparticles using Gmelina arborea Sci. Rep. 2022 12 156 10.1038/s41598-021-04025-w 34997051 PMC8742086 Figure 1 Base peak chromatograms of hydroethanolic ( A B Figure 2 Impact of AgNO 3 3 A C E G I B D F H J Figure 3 ATR-FTIR spectra of hydroethanolic ( A B Figure 4 The mean hydrodynamic diameter (Z-average), polydispersity index (PDI), and zeta potential of AgNPs derived from the hydroethanolic ( A B Figure 5 Elemental composition determined by energy-dispersive X-ray (EDX) spectroscopy, along with scanning electron microscopy (SEM) micrographs of AgNPs derived from the hydroethanolic ( A B C D Figure 6 AgNPs derived from the hydroethanolic buckwheat hull extract: transmission electron microscopy (TEM) images ( A C D E F H I J Figure 7 2,2-Diphenyl-1-picrylhydrazyl (DPPH) radical scavenging activity of AgNPs derived from the hydroethanolic and aqueous buckwheat hull extracts. Figure 8 2,2′-Azinobis(3-ethylbenzothiazoline-6-sulfonic acid) (ABTS) radical cation scavenging activity of AgNPs derived from the hydroethanolic and aqueous buckwheat hull extracts. Figure 9 Viability of A-375 human malignant melanoma cells exposed to AgNPs derived from the hydroethanolic ( A B C D p Figure 10 Physicochemical characteristics and biological activities of AgNPs derived from the hydroethanolic and aqueous buckwheat hull extracts. pharmaceutics-17-01124-t001_Table 1 Table 1 Compounds tentatively identified in hydroethanolic and aqueous buckwheat hull extracts. No. T R [M-H] − m/z MF MS/MS Fragments m/z Proposed Identity Extract Ref.  1 1.6 341.1090 C 12 22 11 179.0551; 119.0312 sucrose hydroethanolic [ 34  2 1.8 191.0549 C 7 12 6 173.0429; 127.0354 quinic acid hydroethanolic [ 35  3 2.3 117.0205 C 4 6 4 99.0092 succinic acid hydroethanolic [ 36  4 2.5 191.0193 C 6 8 7 129.02 citric acid hydroethanolic [ 35  5 3.9 169.0145 C 7 6 5 125.0339; 109.0726 gallic acid hydroethanolic [ 34  6 5.3 167.0343 C 8 8 4 149.0342; 123.1439 vanillic acid hydroethanolic [ 37  7 7.5 153.0184 C 7 6 4 109.0221; 91.0179 dihydroxybenzoic acid hydroethanolic [ 34  8 9.9 137.0240 C 7 6 3 108.0224 hydroxybenzoic hydroethanolic [ 35 37  9 21.3 447.0907 C 21 20 11 357.0609; 327.0502; 299.0541 luteolin- C hydroethanolic [ 38 39  10 22.8 609.1476 C 27 30 16 343.0453; 300.0278; 271.0244; 178.9985; 151.0026 quercetin- O hydroethanolic [ 38 40  11 23.6 463.0877 C 21 20 12 301.0338; 271.0237; 243.0698; 178.9982; 151.0043 quercetin- O hydroethanolic [ 41  12 25.6 329.0659 C 17 14 7 314.0415; 299.0193; 286.0462; 271.0232 trihydroxy-dimethoxy-flavone I hydroethanolic [ 34 41  13 26.9 447.0939 C 21 20 11 285.0399; 133.0295 luteolin- O hydroethanolic [ 34  14 30.8 301.0362 C 15 10 7 178.9973; 151.0023 quercetin hydroethanolic [ 38 42  15 30.9 285.0377 C 15 10 6 171.0364; 151.0028; luteolin hydroethanolic [ 40 41  16 31.3 345.0605 C 17 14 8 330.0387; 315.0125; 287.0175; 259.0313 tetrahydroxy-dimethoxy-flavone I hydroethanolic [ 34  17 31.7 315.0516 C 16 12 7 300.0282; 271.0246; 255.0288; 243.0322 tetrahydroxy-methoxy-flavone II hydroethanolic [ 34  18 35.3 329.0657 C 17 14 7 314.0413; 299.0193; 271.0234; 199.1317 trihydroxy-dimethoxy-flavone II hydroethanolic [ 34 41 T R pharmaceutics-17-01124-t002_Table 2 Table 2 Antioxidant and cytotoxic activity of AgNPs derived from the buckwheat hull extracts. Sample EC 50 IC 50 Antioxidant Activity Cytotoxicity (MTT Assay) DPPH Assay ABTS Assay A-375 Cells Vero Cells AgNPs derived from the hydroethanolic buckwheat hull extract 455.8 ± 0.2 376.10 ± 2.48 2.48 ± 1.21 2.77± 0.21 AgNPs derived from the aqueous 132.6 ± 0.3 77.40 ± 3.52 4.72 ± 0.61 7.90 ±0.39 * After 48 h treatment; EC 50 50 pharmaceutics-17-01124-t003_Table 3 Table 3 Antibacterial activity of AgNPs derived from the buckwheat hull extracts. Sample MIC (μg/mL) S. aureus S. aureus S. epidermidis E. coli P. aeruginosa AgNPs derived from the hydroethanolic buckwheat hull extract 75.00 37.50 4.68 75.00 NA AgNPs derived from the aqueous buckwheat hull extract 75.00 75.00 18.75 75.00 75.00 MIC, minimum inhibitory concentration; MRSA, methicillin-resistant Staphylococcus aureus ",
  "metadata": {
    "Title of this paper": "Sustainable phyto-fabrication of silver nanoparticles using ",
    "Journal it was published in:": "Pharmaceutics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473271/"
  }
}