{
  "title": "Paper_945",
  "abstract": "pmc Toxics Toxics 3287 toxics toxics Toxics 2305-6304 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473602 PMC12473602.1 12473602 12473602 41012334 10.3390/toxics13090713 toxics-13-00713 1 Article Curcumin Can Inhibit Zearalenone-Induced Ferroptosis in Porcine Intestinal Epithelial Cells via the p53/SLC7A11/GPX4 Pathway Xiong Dongwei Investigation † Qi Weidong Investigation † https://orcid.org/0000-0001-6683-1956 Long Miao Writing – review & editing Supervision * Dai Chongshan Academic Editor Key Laboratory of Livestock Infectious Diseases, Ministry of Education, College of Animal Science & Veterinary Medicine, Shenyang Agricultural University, Shenyang 110866, China; 2022200183@stu.syau.edu.cn 2022220619@stu.syau.edu.cn * longmiao@syau.edu.cn † These authors contributed equally to this work. 24 8 2025 9 2025 13 9 497672 713 21 7 2025 15 8 2025 23 8 2025 24 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Zearalenone (ZEA) is a widely distributed estrogenic mycotoxin that can disrupt intestinal barrier integrity by inducing ferroptosis, thereby posing serious risks to animal health. Curcumin (CUR), as a natural polyphenolic compound with multi-target regulatory properties, has attracted increasing attention for its antioxidative and cytoprotective effects; however, its role in ZEA-induced ferroptosis remains poorly understood. In this study, the protective effects of curcumin (CUR) were evaluated in IPEC-J2 cells by co-treating the cells with zearalenone (ZEA) at its LC 50 p p p p 2+ p p p zearalenone curcumin ferroptosis lipid peroxidation IPEC-J2 cells National Natural Science Foundation of China 32273074 31972746 31772809 This research was funded by the National Natural Science Foundation of China (grant No. 32273074, grant No. 31972746, grant No. 31772809). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction In recent years, feed contamination by mycotoxins has garnered increasing attention, with zearalenone (ZEA), an estrogenic mycotoxin produced by the Fusarium species, being one of the most prevalent contaminants in grains and their by-products [ 1 2 3 4 5 6 7 8 Traditional studies have primarily focused on classical forms of programmed cell death such as apoptosis and necrosis induced by ZEA. In recent years, ferroptosis, a novel iron-dependent form of programmed cell death, has garnered increasing attention due to its pivotal role in various disease models. Ferroptosis is characterized by the accumulation of lipid peroxides on cellular membranes, along with molecular events such as glutathione (GSH) depletion, inactivation of glutathione peroxidase 4 (GPX4), and disruption of intracellular iron homeostasis, ultimately leading to loss of cellular structural integrity [ 9 10 11 11 12 10 13 14 Figure 1 15 16 Natural bioactive compounds have emerged as a research hotspot for mitigating ZEA toxicity due to their low toxicity, high efficiency, and multi-targeted properties. Curcumin (CUR), a natural polyphenolic compound extracted from turmeric, exhibits prominent antioxidant and anti-inflammatory activities [ 17 18 19 20 Therefore, this study employed a ZEA-induced IPEC-J2 porcine intestinal epithelial cell model to systematically investigate the protective effects of curcumin and its underlying mechanisms by assessing cell viability, ROS and Fe 2+ 2. Materials and Methods 2.1. Culture of IPEC-J2 Cells Porcine intestinal epithelial cells (IPEC-J2, American Type Culture Collection, Manassas, VA, USA) were maintained in DMEM/F-12 (Procell, Wuhan, China) containing 10% fetal bovine serum (FBS; Hyclone, Marlborough, MA, USA) and 1% penicillin–streptomycin (Procell, Wuhan, China) at 37 °C in a 5% CO 2 21 22 2.2. Cytotoxicity Assay and Relative Cell Viability Measurement When IPEC-J2 cells reached 80% confluency, they were digested with 0.25% trypsin to prepare a single-cell suspension. After determining the cell concentration using an automated cell counter, the suspension was adjusted to 1 × 10 4 2 (1) Curcumin Treatment and Relative Cell Viability Assay (CCK-8 assay) To evaluate the effect of CUR (purity > 98%, Solarbio, Beijing, China) on the viability of IPEC-J2 cells, a CUR concentration gradient of 0, 5, 10, 15, 20, 25, and 30 μmol/L was established. Following the method described by Wang et al. [ 23 v v (2) Zearalenone Treatment and Relative Cell Viability Assay (CCK-8 assay) ZEA (purity > 99%, Pribolab, Qingdao, China) treatment concentrations were set at 50, 60, 70, 80, 90, 100, and 110 μmol/L. The experiment included ZEA-treated and control groups, following the same incubation conditions and detection procedures as in the CUR experiment. After 24 h of ZEA exposure, CCK-8 reagent (Solarbio, Beijing, China) was added, and absorbance was measured at 480 nm to determine OD values. (3) Investigation of the Combined Effects of CUR and ZEA (CCK-8 assay) To investigate the combined effects of CUR and ZEA, co-treatment experiments were designed based on the median lethal concentration (LC 50 50 2.3. Measurement of GSH, Fe 2+ When IPEC-J2 cells reached 80% confluency, four groups were established: control, ZEA (75 μmol/L), ZEA + CL (75 μmol/L ZEA + 5 μmol/L CUR), and ZEA + CH (75 μmol/L ZEA + 15 μmol/L CUR), with three biological replicates per group. Following 24 h of exposure, the medium was removed, cells were rinsed twice with PBS, the residual liquid was completely aspirated, and the cells were collected using a cell scraper. A cell suspension was prepared in 2 mL PBS and subjected to cell counting. The method is described by Sun et al. [ 24 (1) Measurement of GSH Contents During sample preparation, approximately 1 × 10 6 g GSH = ((ΔA − b)/a) × 2/C pr (1) pr (2) Measurement of Fe 2+ The determination of intracellular Fe 2+ 6 g 2+ 2+ 6 Fe 2+ test control 6 (2) test control (3) Measurement of Lipid peroxidation (LPO) Contents For sample processing, 1 × 10 6 (4) Measurement of Malondialdehyde (MDA) Contents For sample preparation, 1 × 10 6 g MDA = (A sample blank control blank pr (3) pr 2.4. Flow Cytometric Analysis of ROS Production in IPEC-J2 Cells At 80% confluency, IPEC-J2 cells were divided into four groups: control, ZEA, ZEA + CL, and ZEA + CH, with three biological replicates per group. Prior to ROS analysis, the culture medium was discarded, cells were washed twice with PBS to remove residual substances, collected with a cell scraper, resuspended in 2 mL PBS, and counted to prepare for ROS level assessment. Cells from each treatment group were rinsed twice with PBS, digested using 0.25% trypsin, and centrifuged at 1000 rpm for 5 min to obtain the cell pellets. Cell density was standardized to 1 × 10 6 2.5. Observation of Mitochondrial Damage in IPEC-J2 Cells by Transmission Electron Microscopy IPEC-J2 cells were cultured in T75 flasks, and when the cells reached approximately 80% confluency with good growth status, mitochondrial structure observation experiments were initiated. Grouping and drug treatments followed the protocols described in Section 2.3 2.6. Validation of Target Gene Expression When IPEC-J2 cells reached roughly 80% confluence, they were allocated into four experimental sets: control, ZEA, ZEA + CL, and ZEA + CH, each containing three independent replicates. Treatments were applied for 24 h, after which the culture medium was removed, and cells were rinsed twice with PBS. The harvested cells were resuspended in PBS and counted. Total RNA was isolated using the Trizol reagent (Takara, Kyoto, Japan) according to standard procedures, including chloroform extraction, precipitation with isopropanol, and subsequent washing in 75% ethanol. The RNA pellet was reconstituted in RNase-free water. RNA yield and purity were assessed via a micro-spectrophotometer, with only samples showing an A260/A280 ratio of 1.8–2.1 processed for reverse transcription. cDNA was generated by eliminating genomic DNA (42 °C, 2 min), followed by first-strand synthesis (37 °C, 15 min; 85 °C, 5 s). The synthesized cDNA was either used immediately for qPCR analysis or preserved at −80 °C for later use. Quantitative PCR was carried out to measure the transcription levels of ferroptosis-associated genes, namely, p53, SLC7A11, GPX4, ACSL4, and FTH1. Primer sequences were designed from NCBI database entries and verified using the Primer-BLAST tool ( Table 1 −ΔΔCt 2.7. Western Blotting to Assess the Expression of Ferroptosis-Associated Proteins IPEC-J2 cells were cultured to approximately 80% confluency and allocated into four groups: control, ZEA, ZEA + CL, and ZEA + CH, each with three biological replicates. After 24 h of exposure, the medium was discarded, and the cells were rinsed twice with PBS, collected using a cell scraper, resuspended in PBS, and counted. The lysis buffer was composed of radio immunoprecipitation assay (RIPA) buffer, protease inhibitor, and phenyl methyl sulfonyl fluoride (PMSF) (Solarbio, Beijing, China) in a 100:1:1 ratio. Following 30 min of lysis, samples were centrifuged at 14,000× g 3. Results 3.1. The Cytotoxic Effects of ZEA and CUR on IPEC-J2 Cells The CCK-8 assay was used to evaluate the effects of different concentrations of ZEA on the viability of IPEC-J2 cells to determine its individual and combined effects on cell survival. As shown in Figure 2 p Figure 2 Figure 2 To investigate whether curcumin (CUR) could attenuate zearalenone (ZEA)-induced cytotoxicity, we examined the combined effects of ZEA and CUR on the viability of IPEC-J2 cells. As shown in Figure 2 p p p 3.2. The Impact of ZEA and CUR on Oxidative Stress and Iron Homeostasis in IPEC-J2 Cells To investigate the effects of ZEA and CUR on oxidative stress and its underlying mechanisms in IPEC-J2 cells, we measured key biomarkers including glutathione (GSH), Fe 2+ Figure 3 p p p Subsequently, the effects of ZEA and CUR on intracellular Fe 2+ Figure 3 2+ p 2+ p Additionally, ZEA- and CUR-induced alterations in the oxidative system were assessed by quantifying lipid peroxidation products (LPO, MDA) and reactive oxygen species (ROS) levels. Figure 3 p Figure 3 p p p p Figure 2 3.3. The Impact of ZEA and CUR on Mitochondrial Injury in IPEC-J2 Cells Mitochondria play a critical role in cellular energy production and maintenance of homeostasis; therefore, we further investigated the effects of ZEA and CUR on mitochondrial integrity and function in IPEC-J2 cells. Figure 3 Figure 4 Figure 5 3.4. mRNA Expression Levels of Ferroptosis-Related Genes in IPEC-J2 Cells We examined the mRNA expression profiles of pivotal ferroptosis-associated genes in IPEC-J2 cells following ZEA exposure and CUR intervention. The investigated genes—ACSL4, p53, FTH1, SLC7A11, and GPX4—are recognized for their essential roles in modulating ferroptosis, maintaining iron homeostasis, and mediating oxidative stress responses. Figure 5 p p p p p p p p 3.5. Expression Levels of Ferroptosis-Related Proteins in IPEC-J2 Cells We subsequently examined the expression of pivotal ferroptosis-associated proteins in IPEC-J2 cells following ZEA exposure and CUR intervention. Figure 6 p p p p p p p p p 4. Discussion Ferroptosis, defined as a programmed cell death modality marked by iron-dependent lipid peroxidation, has emerged as a focal point in toxicology research in recent years. While some studies have indicated the potential of certain mycotoxins to trigger ferroptosis, the underlying molecular mechanisms are still not fully understood. Zearalenone (ZEA), a mycotoxin with widespread occurrence, has been closely linked to damage of the intestinal epithelium in animals [ 25 This study demonstrated that ZEA exposure significantly reduced the viability of IPEC-J2 cells, indicating its pronounced cytotoxic effects. CCK-8 assay results showed that ZEA exerted a strong dose-dependent cytotoxicity at concentrations exceeding 75 μmol/L. In subsequent ferroptosis assays on IPEC-J2 cells, we found that ZEA increased intracellular markers such as Fe 2+ 26 27 28 29 ZEA induces oxidative stress and lipid peroxidation and further engages in modulating cell death by regulating the expression of critical molecules within multiple ferroptosis signaling pathways. In this study, ZEA exposure resulted in significant changes in the expression of ferroptosis-related genes and proteins in IPEC-J2 cells. The upregulation of ACSL4 and p53, along with the downregulation of FTH1, SLC7A11, and GPX4, indicates that ZEA induced ferroptosis. ACSL4, a key molecular marker of ferroptosis regulation, specifically modifies arachidonic acid via its encoded acyl-CoA synthetase, thereby altering the lipid composition of cell membranes and influencing sensitivity to ferroptosis [ 30 31 2+ 32 33 2+ 2+ 3+ 34 35 36 Concurrently, p53 upregulation is tightly linked to the activation of oxidative stress within cells. By suppressing SLC7A11 expression, p53 reduces intracellular antioxidant synthesis, thereby diminishing cellular antioxidant defenses and heightening susceptibility to ferroptosis [ 37 38 39 40 41 42 43 42 44 45 − 46 47 CUR, a natural antioxidant, has been extensively studied and applied in the treatment of various oxidative-stress-related diseases [ 48 49 50 51 52 53 54 55 20 56 57 58 59 Apart from molecular alterations, mitochondrial structural disruption represents a hallmark morphological characteristic of ferroptosis. Serving as the central organelle for iron metabolism, decomposition, and synthesis, mitochondria are pivotal in maintaining iron homeostasis and orchestrating energy and material metabolism within cells [ 60 61 62 63 In addition to preserving mitochondrial structural integrity, CUR’s protective effects may also originate from its interactions with the plasma membrane and associated receptors. Given its amphiphilic nature, CUR can incorporate into lipid bilayers, stabilizing membrane microdomains and influencing the spatial organization of receptor complexes [ 64 65 66 67 68 5. Conclusions This study confirms that CUR effectively alleviates ZEA-induced ferroptosis in IPEC-J2 cells in vitro. CUR treatment not only suppressed the accumulation of Fe 2+ Disclaimer/Publisher’s Note: Author Contributions Methodology, M.L.; validation, D.X. and W.Q.; formal analysis, D.X.; writing—original draft preparation, D.X.; writing—review and editing, M.L.; visualization, D.X. and W.Q.; supervision, M.L. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement The data presented in this study are available in this article. Conflicts of Interest The authors declare no conflicts of interest. References 1. Rai A. Das M. Tripathi A. Occurrence and toxicity of a fusarium mycotoxin, zearalenone Crit. Rev. Food Sci. Nutr. 2020 60 2710 2729 10.1080/10408398.2019.1655388 31446772 2. Yang C. Song G. Lim W. Effects of mycotoxin-contaminated feed on farm animals J. Hazard. Mater. 2020 389 122087 10.1016/j.jhazmat.2020.122087 32004836 3. Jing S. Liu C. Zheng J. Dong Z. Guo N. Toxicity of zearalenone and its nutritional intervention by natural products Food Funct. 2022 13 10374 10400 10.1039/D2FO01545E 36165278 4. Kowalska K. Habrowska-Gorczynska D.E. Urbanek K.A. Dominska K. Sakowicz A. Piastowska-Ciesielska A.W. Estrogen receptor beta plays a protective role in zearalenone-induced oxidative stress in normal prostate epithelial cells Ecotoxicol. Environ. Saf. 2019 172 504 513 10.1016/j.ecoenv.2019.01.115 30738973 5. Wang S. Fu W. Zhao X. Chang X. Liu H. Zhou L. Li J. Cheng R. Wu X. Li X. Zearalenone disturbs the reproductive-immune axis in pigs: The role of gut microbial metabolites Microbiome 2022 10 234 10.1186/s40168-022-01397-7 36536466 PMC9762105 6. Wu K. Ren C. Gong Y. Gao X. Rajput S.A. Qi D. Wang S. The insensitive mechanism of poultry to zearalenone: A review Anim. Nutr. 2021 7 587 594 10.1016/j.aninu.2021.01.002 34377845 PMC8327487 7. Kim N.Y. Kim M.O. Shin S. Kwon W.S. Kim B. Lee J.Y. In L.S. Effect of atractylenolide III on zearalenone-induced Snail1-mediated epithelial-mesenchymal transition in porcine intestinal epithelium J. Anim. Sci. Biotechnol. 2024 15 80 10.1186/s40104-024-01038-z 38845033 PMC11157892 8. Lin X. Zhu L. Gao X. Kong L. Huang Y. Zhao H. Chen Y. Wen L. Li R. Wu J. Ameliorative effect of betulinic acid against zearalenone exposure triggers testicular dysfunction and oxidative stress in mice via p38/ERK MAPK inhibition and Nrf2-mediated antioxidant defense activation Ecotoxicol. Environ. Saf. 2022 238 113561 10.1016/j.ecoenv.2022.113561 35489292 9. Cao L. Fan L. Zhao C. Yin S. Hu H. Role of ferroptosis in food-borne mycotoxin-induced toxicities Apoptosis 2024 29 267 276 10.1007/s10495-023-01907-4 38001339 10. Huangfu B. Li J. Xu T. Ren X. Zhang R. Chen Y. Wang J. Huang K. He X. Zearalenone induces intestinal damage and flora disturbance in rats by triggering ferroptosis via the system Xc(-)-GSH-GPX4 signaling pathway Ecotoxicol. Environ. Saf. 2025 302 118600 10.1016/j.ecoenv.2025.118600 40592152 11. Wang C. Chen C. Wang M. Rahman S.U. Wei B. Ding H. Huang W. Wang X. Rutin attenuates zearalenone-induced ferroptosis of endometrial stromal cells in piglets through the p53 signaling pathway Ecotoxicol. Environ. Saf. 2025 290 117546 10.1016/j.ecoenv.2024.117546 39700772 12. Zhang H.J. Luo J.Z. Lan C.L. Teng X. Ge B. Liu J.Q. Xie H.X. Yang K.J. Qin C.J. Zhou X. Baicalin protects against hepatocyte injury caused by aflatoxin B(1) via the TP53-related ferroptosis Pathway Ecotoxicol. Environ. Saf. 2024 281 116661 10.1016/j.ecoenv.2024.116661 38954907 13. Wang W. Ma F. Cheung Y.T. Zeng G. Zhou Y. Chen Z. Liang L. Luo T. Tong R. Marine alkaloid lepadins e and h induce ferroptosis for cancer chemotherapy J. Med. Chem. 2023 66 11201 11215 10.1021/acs.jmedchem.3c00659 37578947 14. Zhi S.M. Cui Y. Liu Y. Zhang J.T. Li X.J. Sheng B. Chen X.X. Yan C.L. Li W. Mao J.N. Paeoniflorin suppresses ferroptosis after traumatic brain injury by antagonizing P53 acetylation Phytomedicine 2024 133 155940 10.1016/j.phymed.2024.155940 39128303 15. Sun D. Wang L. Wu Y. Yu Y. Yao Y. Yang H. Hao C. Lipid metabolism in ferroptosis: Mechanistic insights and therapeutic potential Front. Immunol. 2025 16 1545339 10.3389/fimmu.2025.1545339 40134420 PMC11932849 16. Wang X. Kong X. Feng X. Jiang D.S. Effects of DNA, RNA, and protein methylation on the regulation of ferroptosis Int. J. Biol. Sci. 2023 19 3558 3575 10.7150/ijbs.85454 37497000 PMC10367552 17. Kaur K. Al-Khazaleh A.K. Bhuyan D.J. Li F. Li C.G. A review of recent curcumin analogues and their antioxidant, Anti-Inflammatory, and anticancer activities Antioxidants 2024 13 1092 10.3390/antiox13091092 39334750 PMC11428508 18. Li R. Zhang J. Zhou Y. Gao Q. Wang R. Fu Y. Zheng L. Yu H. Transcriptome investigation and in vitro verification of curcumin-induced HO-1 as a feature of ferroptosis in breast cancer cells Oxid. Med. Cell. Longev. 2020 2020 3469840 10.1155/2020/3469840 33294119 PMC7691002 19. Zhang Y. Yu C. Peng C. Peng F. Potential roles and mechanisms of curcumin and its derivatives in the regulation of ferroptosis Int. J. Biol. Sci. 2024 20 4838 4852 10.7150/ijbs.90798 39309443 PMC11414380 20. Ming T. Lei J. Peng Y. Wang M. Liang Y. Tang S. Tao Q. Wang M. Tang X. He Z. Curcumin suppresses colorectal cancer by induction of ferroptosis via regulation of p53 and solute carrier family 7 member 11/glutathione/glutathione peroxidase 4 signaling axis Phytother. Res. 2024 38 3954 3972 10.1002/ptr.8258 38837315 21. Cheng Q. Jiang S. Huang L. Wang Y. Yang W. Zearalenone exposure affects the Keap1-Nrf2 signaling pathway and glucose nutrient absorption related genes of porcine jejunal epithelial cells Toxins 2022 14 793 10.3390/toxins14110793 36422967 PMC9696209 22. Wang C. Fu Y. Wang R. Wang Q. Yu H. Zhang J. Quercetin attenuates the combined effects of zearalenone and lipopolysaccharide on IPEC-J2 cell injury through activating the Nrf2 signaling pathway Toxins 2023 15 679 10.3390/toxins15120679 38133183 PMC10748267 23. Wang Q. Li A. Yu H. Wang C. Wang T. Zhang J. Evaluation of Cross-Talk and alleviate potential of cytotoxic factors induced by deoxynivalenol in IPEC-J2 cells interference with curcumin Int. J. Mol. Sci. 2024 25 6984 10.3390/ijms25136984 39000093 PMC11241398 24. Sun H. Zhang M. Li J. Shan A. DL-Selenomethionine alleviates oxidative stress induced by zearalenone via Nrf2/Keap1 signaling pathway in IPEC-J2 cells Toxins 2021 13 557 10.3390/toxins13080557 34437428 PMC8402336 25. Guan H. Ma W. Wu Q. Cai J. Zhang Z. Exploring the toxic effects of ZEA on IPEC-J2 cells from the inflammatory response and apoptosis Animals 2023 13 2731 10.3390/ani13172731 37684994 PMC10487149 26. Bao L. Huang Y. Gu F. Liu W. Guo Y. Chen H. Wang K. Wu Z. Li J. Zearalenone induces liver injury in mice through ferroptosis pathway Sci. Total Environ. 2024 952 175875 10.1016/j.scitotenv.2024.175875 39216757 27. Liu M. Zheng M. Cai D. Xie J. Jin Z. Liu H. Liu J. Zeaxanthin promotes mitochondrial biogenesis and adipocyte browning via AMPKalpha1 activation Food Funct. 2019 10 2221 2233 10.1039/C8FO02527D 30950462 28. Rai A. Patwardhan R.S. Jayakumar S. Pachpatil P. Das D. Panigrahi G.C. Gota V. Patwardhan S. Sandur S.K. Clobetasol propionate, a Nrf-2 inhibitor, sensitizes human lung cancer cells to radiation-induced killing via mitochondrial ROS-dependent ferroptosis Acta Pharmacol. Sin. 2024 45 1506 1519 10.1038/s41401-024-01233-8 38480835 PMC11192725 29. Mortensen M.S. Ruiz J. Watts J.L. Polyunsaturated fatty acids drive lipid peroxidation during ferroptosis Cells 2023 12 804 10.3390/cells12050804 36899940 PMC10001165 30. Ding K. Liu C. Li L. Yang M. Jiang N. Luo S. Sun L. Acyl-CoA synthase ACSL4: An essential target in ferroptosis and fatty acid metabolism Chin. Med. J. 2023 136 2521 2537 10.1097/CM9.0000000000002533 37442770 PMC10617883 31. Doll S. Proneth B. Tyurina Y.Y. Panzilius E. Kobayashi S. Ingold I. Irmler M. Beckers J. Aichler M. Walch A. ACSL4 dictates ferroptosis sensitivity by shaping cellular lipid composition Nat. Chem. Biol. 2017 13 91 98 10.1038/nchembio.2239 27842070 PMC5610546 32. Ohshima T. Yamamoto H. Sakamaki Y. Saito C. Mizushima N. NCOA4 drives ferritin phase separation to facilitate macroferritinophagy and microferritinophagy J. Cell Biol. 2022 221 e202203102 10.1083/jcb.202203102 36066504 PMC9452830 33. Yu F. Zhang Q. Liu H. Liu J. Yang S. Luo X. Liu W. Zheng H. Liu Q. Cui Y. Dynamic O-GlcNAcylation coordinates ferritinophagy and mitophagy to activate ferroptosis Cell Discov. 2022 8 40 10.1038/s41421-022-00390-6 35504898 PMC9065108 34. Cui J. Chen Y. Yang Q. Zhao P. Yang M. Wang X. Mang G. Yan X. Wang D. Tong Z. Protosappanin a protects DOX-Induced myocardial injury and cardiac dysfunction by targeting ACSL4/FTH1 Axis-Dependent ferroptosis Adv. Sci. 2024 11 e2310227 10.1002/advs.202310227 38984448 PMC11425893 35. Hu W. Zhou C. Jing Q. Li Y. Yang J. Yang C. Wang L. Hu J. Li H. Wang H. FTH promotes the proliferation and renders the HCC cells specifically resist to ferroptosis by maintaining iron homeostasis Cancer Cell Int. 2021 21 709 10.1186/s12935-021-02420-x 34965856 PMC8717654 36. Pekec T. Lewandowski J. Komur A.A. Sobanska D. Guo Y. Switonska-Kurkowska K. Malecki J.M. Dubey A.A. Pokrzywa W. Frankowski M. Ferritin-mediated iron detoxification promotes hypothermia survival in Caenorhabditis elegans and murine neurons Nat. Commun. 2022 13 4883 10.1038/s41467-022-32500-z 35986016 PMC9391379 37. Liu D.S. Duong C.P. Haupt S. Montgomery K.G. House C.M. Azar W.J. Pearson H.B. Fisher O.M. Read M. Guerra G.R. Inhibiting the system x(C) (-)/glutathione axis selectively targets cancers with mutant-p53 accumulation Nat. Commun. 2017 8 14844 10.1038/ncomms14844 28348409 PMC5379068 38. Su Z. Kon N. Yi J. Zhao H. Zhang W. Tang Q. Li H. Kobayashi H. Li Z. Duan S. Specific regulation of BACH1 by the hotspot mutant p53(R175H) reveals a distinct gain-of-function mechanism Nat. Cancer 2023 4 564 581 10.1038/s43018-023-00532-z 36973430 PMC10320414 39. Wang C. He J. Jin H. Xiao H. Peng S. Xie J. Zhang L. Guo J. T-2 toxin induces cardiotoxicity by activating ferroptosis and inhibiting heme oxygenase-1 Chemosphere 2023 341 140087 10.1016/j.chemosphere.2023.140087 37678596 40. Wang G. Qin S. Zheng Y. Xia C. Zhang P. Zhang L. Yao J. Yi Y. Deng L. T-2 toxin induces ferroptosis by increasing lipid reactive oxygen species (ROS) and downregulating solute carrier family 7 member 11 (SLC7A11) J. Agric. Food Chem. 2021 69 15716 15727 10.1021/acs.jafc.1c05393 34918923 41. Lee J. Roh J.L. SLC7A11 as a gateway of metabolic perturbation and ferroptosis vulnerability in cancer Antioxidants 2022 11 2444 10.3390/antiox11122444 36552652 PMC9774303 42. Upadhyayula P.S. Higgins D.M. Mela A. Banu M. Dovas A. Zandkarimi F. Patel P. Mahajan A. Humala N. Nguyen T. Dietary restriction of cysteine and methionine sensitizes gliomas to ferroptosis and induces alterations in energetic metabolism Nat. Commun. 2023 14 1187 10.1038/s41467-023-36630-w 36864031 PMC9981683 43. Xue X. Wang M. Cui J. Yang M. Ma L. Kang R. Tang D. Wang J. Glutathione metabolism in ferroptosis and cancer therapy Cancer Lett. 2025 621 217697 10.1016/j.canlet.2025.217697 40189013 44. Song X. Wang X. Chen X. Yu Z. Zhou Y. SRSF1 inhibits ferroptosis and reduces cisplatin chemosensitivity of triple-negative breast cancer cells through the circSEPT9/GCH1 axis J. Proteom. 2024 292 105055 10.1016/j.jprot.2023.105055 38040194 45. Xu L. Zhang L. Xiang Y. Zhang X. Knockdown of lncRNA NEAT1 suppresses streptococcus pneumoniae-induced ferroptosis in alveolar epithelial cells by regulating the Nrf2-GPX4 pathway Toxicon 2024 243 107705 10.1016/j.toxicon.2024.107705 38556062 46. Tao L. Xu J. Jiang L. Hu J. Tang Z. Investigation into the influence of mild hypothermia on regulating ferroptosis through the P53-SLC7A11/GPX4 signaling pathway in sepsis-induced acute lung injury Intensive Care Med. Exp. 2025 13 4 10.1186/s40635-025-00713-3 39812923 PMC11735705 47. Jin X. He R. Lin Y. Liu J. Wang Y. Li Z. Liao Y. Yang S. Shenshuaifu granule attenuates acute kidney injury by inhibiting ferroptosis mediated by p53/SLC7A11/GPX4 pathway Drug Des. Dev. Ther. 2023 17 3363 3383 10.2147/DDDT.S433994 PMC10656853 38024532 48. Li H. Sureda A. Devkota H.P. Pittala V. Barreca D. Silva A.S. Tewari D. Xu S. Nabavi S.M. Curcumin, the golden spice in treating cardiovascular diseases Biotechnol. Adv. 2020 38 107343 10.1016/j.biotechadv.2019.01.010 30716389 49. Pei J. Palanisamy C.P. Natarajan P.M. Umapathy V.R. Roy J.R. Srinivasan G.P. Panagal M. Jayaraman S. Curcumin-loaded polymeric nanomaterials as a novel therapeutic strategy for Alzheimer’s disease: A comprehensive review Ageing Res. Rev. 2024 99 102393 10.1016/j.arr.2024.102393 38925479 50. Scuto M. Ontario M.L. Salinaro A.T. Caligiuri I. Rampulla F. Zimbone V. Modafferi S. Rizzolio F. Canzonieri V. Calabrese E.J. Redox modulation by plant polyphenols targeting vitagenes for chemoprevention and therapy: Relevance to novel anti-cancer interventions and mini-brain organoid technology Free Radic. Biol. Med. 2022 179 59 75 10.1016/j.freeradbiomed.2021.12.267 34929315 51. Wang Z. Liu F. Liao W. Yu L. Hu Z. Li M. Xia H. Curcumin suppresses glioblastoma cell proliferation by p-AKT/mTOR pathway and increases the PTEN expression Arch. Biochem. Biophys. 2020 689 108412 10.1016/j.abb.2020.108412 32445778 52. Rainey N.E. Moustapha A. Petit P.X. Curcumin, a multifaceted hormetic agent, mediates an intricate crosstalk between mitochondrial turnover, autophagy, and apoptosis Oxid. Med. Cell. Longev. 2020 2020 3656419 10.1155/2020/3656419 32765806 PMC7387956 53. Wang L. Chen X. Du Z. Li G. Chen M. Chen X. Liang G. Chen T. Curcumin suppresses gastric tumor cell growth via ROS-mediated DNA polymerase gamma depletion disrupting cellular bioenergetics J. Exp. Clin. Cancer Res. 2017 36 47 10.1186/s13046-017-0513-5 28359291 PMC5374654 54. Davoudi M. Jadidi Y. Moayedi K. Farrokhi V. Afrisham R. Ameliorative impacts of polymeric and metallic nanoparticles on cisplatin-induced nephrotoxicity: A 2011–2022 review J. Nanobiotechnol. 2022 20 504 10.1186/s12951-022-01718-w PMC9714065 36457031 55. Bai C. Zhao J. Su J. Chen J. Cui X. Sun M. Zhang X. Curcumin induces mitochondrial apoptosis in human hepatoma cells through BCLAF1-mediated modulation of PI3K/AKT/GSK-3beta signaling Life Sci. 2022 306 120804 10.1016/j.lfs.2022.120804 35882275 56. Li J. Song J. Deng Z. Yang J. Wang X. Gao B. Zhu Y. Yang M. Long D. Luo X. Robust reactive oxygen species modulator hitchhiking yeast microcapsules for colitis alleviation by trilogically intestinal microenvironment renovation Bioact. Mater. 2024 36 203 220 10.1016/j.bioactmat.2024.02.033 38463553 PMC10924178 57. Anand P. Kunnumakkara A.B. Newman R.A. Aggarwal B.B. Bioavailability of curcumin: Problems and promises Mol. Pharm. 2007 4 807 818 10.1021/mp700113r 17999464 58. Pan-On S. Dilokthornsakul P. Tiyaboonchai W. Trends in advanced oral drug delivery system for curcumin: A systematic review J. Control. Release 2022 348 335 345 10.1016/j.jconrel.2022.05.048 35654170 59. Yan Y. Kulsoom Sun Y. Li Y. Wang Z. Xue L. Wang F. Advancing cancer therapy: Nanomaterial-based encapsulation strategies for enhanced delivery and efficacy of curcumin Mater. Today Bio 2025 33 101963 10.1016/j.mtbio.2025.101963 PMC12198038 40575656 60. Su Y. Cao N. Zhang D. Wang M. The effect of ferroptosis-related mitochondrial dysfunction in the development of temporal lobe epilepsy Ageing Res. Rev. 2024 96 102248 10.1016/j.arr.2024.102248 38408490 61. Otasevic V. Vucetic M. Grigorov I. Martinovic V. Stancic A. Ferroptosis in different pathological contexts seen through the eyes of mitochondria Oxid. Med. Cell. Longev. 2021 2021 5537330 10.1155/2021/5537330 34211625 PMC8205588 62. Yuan H. Han Z. Chen Y. Qi F. Fang H. Guo Z. Zhang S. He W. Ferroptosis photoinduced by new cyclometalated Iridium(III) complexes and its synergism with apoptosis in tumor cell inhibition Angew. Chem. 2021 60 8174 8181 10.1002/anie.202014959 33656228 63. Friedmann A.J. Schneider M. Proneth B. Tyurina Y.Y. Tyurin V.A. Hammond V.J. Herbach N. Aichler M. Walch A. Eggenhofer E. Inactivation of the ferroptosis regulator Gpx4 triggers acute renal failure in mice Nat. Cell Biol. 2014 16 1180 1191 10.1038/ncb3064 25402683 PMC4894846 64. Sharma V.K. Gupta J. Srinivasan H. Bhatt H. Garcia S.V. Mitra S. Curcumin accelerates the lateral motion of DPPC membranes Langmuir 2022 38 9649 9659 10.1021/acs.langmuir.2c01250 35878409 65. Lin W. Wang C. Liu G. Bi C. Wang X. Zhou Q. Jin H. SLC7A11/xCT in cancer: Biological functions and therapeutic implications Am. J. Cancer Res. 2020 10 3106 3126 33163260 PMC7642655 66. Pecchillo C.T. Punziano C. Panico I. Petrone Z. Cassese M. Faraonio R. Barresi V. Esposito G. Ammendola R. Cattaneo F. Formyl-Peptide receptor 2 signaling modulates SLC7A11/xCT expression and activity in tumor cells Antioxidants 2024 13 552 10.3390/antiox13050552 38790657 PMC11118824 67. Hu H. Zhang G. Tian M. Yin Y. Bao Y. Guan X. Ding C. Yu S. Brucella rough RB51 infection activates P53-Slc7a11-Gpx4/GSH pathway to induce ferroptosis to attenuate the intracellular survival on macrophages Vet. Microbiol. 2024 298 110224 10.1016/j.vetmic.2024.110224 39153287 68. Liu C. Tian Q. Li Z. Wang G. Han W. Jiang S. Sun Z. Xu Q. Wang L. Liao J. FOXO3a-BAP1 axis regulates neuronal ferroptosis in early brain injury after subarachnoid hemorrhage Redox Biol. 2025 82 103550 10.1016/j.redox.2025.103550 40080966 PMC11946873 Figure 1 Mechanisms of ferroptosis regulation. Figure 2 Protective role of curcumin against zearalenone-induced cytotoxicity in IPEC-J2 cells: ( A B C D p p p p Figure 3 CUR mitigates ZEA-induced oxidative injury by restoring antioxidant capacity and iron homeostasis in IPEC-J2 cells: ( A B 2+ C D E p p p p Figure 4 Alterations in the mitochondrial structure of IPEC-J2 cells following treatment with various agents: red arrows highlight alterations in the mitochondrial structure within the cytoplasm of IPEC-J2 cells; the magnifications of the rectangular insets for each group are 2.5K×, 7K×, and 20K×, respectively. Figure 5 Alterations in ferroptosis-associated gene mRNA expression in IPEC-J2 cells following treatment with varying CUR concentrations: “*” denotes a statistically significant difference versus the blank control group ( p p p p Figure 6 Alterations in ferroptosis-associated protein expression levels in IPEC-J2 cells following treatment with varying CUR concentrations: “*” denotes a statistically significant difference versus the blank control group ( p p p p toxics-13-00713-t001_Table 1 Table 1 Primer sequence list. Gene Primer Sequence (5′-3′) ACSL4 Forward: 5′-CTGGAAATGCTGGGTTTGGGA-3′ GPX4 Forward: 5′-TGTGTGAATGGGGACGATGC-3′ SLC7A11 Forward: 5′-CATCGGGACCATCATCGGAG-3′ FTH1 Forward: 5′-ATTTGCGCTGCACGTGGT-3′ p53 Forward: 5′-ACGCTTCGAGATGTTCCGAG-3′ ",
  "metadata": {
    "Title of this paper": "FOXO3a-BAP1 axis regulates neuronal ferroptosis in early brain injury after subarachnoid hemorrhage",
    "Journal it was published in:": "Toxics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473602/"
  }
}