{
  "title": "Paper_1120",
  "abstract": "pmc Genes (Basel) Genes (Basel) 2104 genes genes Genes 2073-4425 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470080 PMC12470080.1 12470080 12470080 41010008 10.3390/genes16091063 genes-16-01063 1 Article RNA Polymerase I Dysfunction Underlying Craniofacial Syndromes: Integrated Genetic Analysis Reveals Parallels to 22q11.2 Deletion Syndrome Silvey Spencer Conceptualization Methodology Software Formal analysis Investigation Resources Data curation Writing – original draft Writing – review & editing 1 https://orcid.org/0000-0002-3215-4472 Lovell Scott Software Formal analysis Investigation Data curation 2 https://orcid.org/0000-0002-2911-0524 Butler Merlin G. Conceptualization Methodology Software Formal analysis Writing – original draft Writing – review & editing Visualization Supervision Project administration 1 * Luo Xingguang Academic Editor 1 ssilvey@kumc.edu 2 swlovell@ku.edu * mbutler4@kumc.edu 10 9 2025 9 2025 16 9 496504 1063 22 7 2025 24 8 2025 25 8 2025 10 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objective: POLR1A and related gene variants cause craniofacial and developmental syndromes, including Acrofacial Dysostosis-Cincinnati, Treacher-Collins types 2–4, and TWIST1-associated disorders. Using a patient case integrated with molecular analyses, we aimed to clarify shared pathogenic mechanisms and propose these conditions as part of a spectrum of RNA polymerase I (Pol I)–related ribosomopathies. Methods: A patient with a heterozygous POLR1A variant underwent clinical evaluation. Findings were integrated with a literature review of craniofacial syndromes to identify overlapping fea tures. Protein-protein and gene-gene interactions were analyzed with STRING and Pathway Commons, a structural modeling of POLR1A assessed the mutation’s impact. Results: The patient exhibited features overlapping with Sweeney-Cox, Saethre-Cox, Robinow-Sorauf, and Treacher-Collins types 2–4, supporting a shared spectrum. Computational analyses identified POLR1A-associated partners and pathways converging on Pol I function, ribosomal biogenesis, and nucleolar processes. Structural modeling of the Met496Ile variant suggested disruption of DNA binding and polymerase activity, linking molecular dysfunction to the clinical phenotype. Conclusion: Significant clinical and genetic overlap exists among Saethre-Chotzen, Sweeney-Cox, Treacher-Collins types 2–4, and Acrofacial Dysostosis-Cincinnati. POLR1A and related Pol I subunits provide a mechanistic basis through impaired nucleolar organization and rRNA transcription, contributing to abnormal craniofacial development. Integrative protein, gene, and structural analyses support classifying these syndromes as Pol I–related ribosomopathies, with implications for diagnosis, counseling, and future mechanistic or therapeutic studies. RNA polymerase I disorders STRING genetic mechanisms, functions, pathways, cellular components, human phenotypes, and ribosomopathies craniofacial, cardiac, skeletal, and neurodevelopmental anomalies protein profiling genetic and clinical syndromic correlations This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Disorders caused by POLR1A and related gene variants, including Acrofacial Dysostosis—Cincinnati type, Treacher–Collins syndrome types 2–4, and TWIST1-associated syndromes such as Saethre–Chotzen and Sweeney–Cox, exhibit overlapping craniofacial and developmental phenotypes. By combining novel clinical observations with a literature-driven evaluation of Pol I and TWIST1-associated pathways, we aim to clarify shared pathogenic mechanisms and propose a framework for considering these disorders as part of an emerging spectrum of Pol I gene-related ribosomopathies. The identification of various clinical features overlapping in dysmorphic genetic disorders with the same related genetic causation has been reported over the years, as classically illustrated in DiGeorge syndrome, in patients presenting with cardiovascular anomalies, hypoparathyroidism with low calcium levels and cellular immune deficiency. Subsequently, Shprintzen et al. [ 1 2 3 3 4 5 Common clinical findings of 22q11.2 deletion syndrome (now labeled 22q11DS) include immunodeficiency, cleft palate, laryngeal defects, congenital heart defects (some severe or lethal), hypocalcemia, craniofacial anomalies, variable eye abnormalities, and developmental or behavioral problems, including autism [ 3 6 Similarly, we propose that the disorders discussed in our report are associated with disturbances of the POLR1A gene on chromosome 2, potentially involving interacting genes that generate a shared spectrum of clinical findings. Pol I-related disorders include Acrofacial Dysostosis—Cincinnati type (OMIM, 616462) [ 7 2. POLR1A Gene, Protein, and Function The POLR1A (subunit A of RNA Polymerase I) gene, located on chromosome 2p11.2, encodes a 194 kDa protein [ 7 8 9 10 11 The process of ribosome assembly, coined ribosome biogenesis, is a complex and delicate process involving the coordination of more than 200 proteins [ 12 13 14 15 Animal studies highlight the essential role of POLR1A in embryonic development. In zebrafish, loss-of-function variants cause severe craniofacial and cardiac malformations, depletion of neural crest progenitors, and early embryonic lethality. Similarly, knockout mice are embryonic lethal, with conditional models revealing impaired neural crest proliferation, facial malformations, and cardiac outflow tract defects. Expression studies in both models show early ubiquitous POLR1A expression that becomes enriched in the brain, eyes, branchial arches, and frontonasal prominences—sites corresponding to tissues most affected in human POLR1A-related disorders [ 7 16 17 3. Methods  Case Identification The patient described was diagnosed and followed clinically by a board-certified geneticist. Clinical features were documented through standard genetic assessment, imaging, and laboratory investigations. Exome sequencing identified a heterozygous, likely pathogenic POLR1A variant (c.1488G > T, p.Met496Ile).  Literature Review A systematic literature review was performed using PubMed, OMIM, and genetic databases to identify disorders related to POLR1A and associated genes, including Treacher–Collins, Saethre–Chotzen, Sweeney–Cox, and Acrofacial Dysostosis syndromes. Articles were screened for clinical, molecular, and structural data relevant to RNA polymerase I-related ribosomopathies. Reference lists were also checked for additional relevant publications.  Integrated Genetic Analysis Protein–protein interactions involving POLR1A were analyzed using the STRING database ( www.string-db.org  Structural Modeling The POLR1A protein structure, including the site of the patient-specific mutation (Met496Ile), was evaluated using published cryo-EM Pol I structures (PDB 7VBA and related models). Structural assessment focused on the location of the mutation relative to the DNA-binding and catalytic regions and interactions with initiation factors (e.g., RRN3).  Data Synthesis and Analysis Clinical, molecular, structural, and computational data were integrated to construct a comprehensive profile of POLR1A-related disorders. Comparative tables were created to summarize overlapping clinical features across syndromes, highlight associated genes and proteins, and illustrate predicted functional interactions. Enrichment metrics, statistical significance (FDR), and pathway correlations were calculated using built-in STRING algorithms and standard bioinformatics tools. 4. Results 4.1. Table of Pol I-Associated Disorders and Case Report 4.1.1. Anchoring Case One of the authors (MGB), a clinical geneticist, diagnosed and followed the patient in the clinical setting with a de novo POLR1A gene defect. At three months of age, the patient presented for genetic services due to his constellation of cranio-facial abnormalities, skeletal deformities, acalvaria, malformed eye lids with extreme hypertelorism, small malformed ears with small canals, low hairline, a small chin, absent gag reflex, and a cardiac defect of the atrium ( Figure 1 7 4.1.2. Table of Pol 1 Related Clinical Disorders Upon further review of this patient, his clinical features were highly reminiscent of Sweeney–Cox, Saethre–Chotzen, and Robinow–Sorauf syndromes and Treacher Collins types 1, 2, and 3 (see Table 1 Table 1 4.2. Molecular Analysis: POLR1A Protein and Gene Interactions We undertook a detailed study of the POLR1A POLR1A 4.2.1. Protein–Protein Interactions and Literature Review of Associated Proteins Congenital anomalies in genetic disorders are caused by a combination of genetic and environmental factors that contribute to altered critical molecular pathways during embryogenesis. To further understand the role of the POLR1A gene seen in our patient, the STRING computer-based program and database ( www.string-db.org 18 Figure 2 Table 2 Table 3 4.2.2. Gene–Gene Interactions and Literature Review of Associated Genes POLR1A gene–gene interactions were divided into two categories: (1) binding partners—CIT, NOLC1, PARP1, ASB7, RRN2, LMBR1L, and BRCA1; (2) binding plus co-expression partners, primarily histone genes ( Figure 3 Table 4 4.2.3. POLR1A Protein Structure and Function Human RNA polymerase I (Pol I) is responsible for the transcription of ribosomal DNA to produce downstream RNA that is utilized for ribosome production [ 18 19 Figure 1 POLR1A Figure 4 20 Figure 4 5. Review of POLR1A Gene-Related Disorder and Other Associated Ribosomopathies 5.1. Acrofacial Dysostosis, Cincinnati-Type Pathogenic variants of the POLR1A gene in humans are reported to cause autosomal-dominant Acrofacial Dysostosis, Cincinnati-type, a disorder characterized by congenital craniofacial anomalies with variable limb defects. Weaver et al. [ 16 16 3 7 7 5.2. Treacher–Collins Syndrome The best-understood example of a Polymerase I-associated ribosomopathy is Treacher–Collins syndrome (TCS), a congenital disorder of craniofacial development that occurs with an estimated incidence of 1/50,000 live births [ 3 21 22 TCOF1 POLR1B POLR1C POLR1D TCOF1 7 23 24 5.3. The TWIST1 Gene and Saethre–Chotzen Syndrome Another important gene implicated in the POLR1A gene family ribosomopathies is TWIST 25 26 27 Wang et al. [ 28 29 30 31 32 33 34 35 36 37 38 39 In summary, TWIST1 loss-of-function mutations lead to osteoblast apoptosis and impaired craniofacial development signaling, and in-concert, illustrate how TWIST1 mutations cause Treacher–Collins syndrome types 2, 3, and 4 and Saethre–Chotzen syndrome. Another clinical condition at one time connected with Saethre–Chotzen was the Robinow–Sorauf syndrome, also caused by a TWIST1 gene defect. It shared facial findings reminiscent of Saethre–Chotzen syndrome with the only clinical differentiator being the presence of bifid or partially duplicated halluces [ 40 41 5.4. Sweeney–Cox Syndrome Sweeney–Cox syndrome (SWCOS) is another condition connected to a heterozygous TWIST1 gene mutation. SWCOS presents with a similar pattern of clinical findings to Saethre–Chotzen syndrome and Acrofacial Dysostosis, Cincinnati type, recognized in our patient, including striking facial anomalies with marked hypertelorism, prominent metopic ridge, upper eyelid colobomas, deficiency of orbital bones, mild micrognathia, cleft palate/velopharyngeal insufficiency, and cupped, low-set ears [ 42 42 6. Discussion This report highlights the clinical and genetic overlap among Saethre–Chotzen, Sweeney–Cox, Treacher–Collins types 2–4, and Acrofacial Dysostosis—Cincinnati. The features of our patient initially suggested to us that there may be shared pathogenic mechanisms involving RNA polymerase I dysfunction. To explore this, we performed detailed protein–protein ( Figure 2 Table 2 Figure 2 Table 3 43 POLR1D 43 Figure 2 Figure 4 The overlap between Pol I-related syndromes (e.g., Treacher–Collins and Acrofacial Dysostosis—Cincinnati) and TWIST1-associated disorders (Saethre–Chotzen and Sweeney–Cox) is perhaps more complex. TWISTNB (TWIST nearby protein), also known as POLR1F, encodes a subunit of RNA polymerase I and lies approximately 580 kb upstream of TWIST1 [ 44 Figure 2 45 Table 1 46 Our combined analysis of protein–protein and gene–gene interactions provides compelling evidence that POLR1A dysfunction disrupts key cellular pathways critical for nucleolar organization, rRNA transcription, and RNA polymerase I complex assembly ( Table 2 Table 2 Table 3 Table 4 Table 1 Figure 3 Table 4 Figure 4 Beyond the individual variant, our integrative approach highlights the utility of combining exome sequencing with protein structural modeling and network-based bioinformatic analyses. Such strategies not only identify pathogenic variants but also predict their functional consequences within complex molecular networks. By revealing shared pathways between POLR1A- and TWIST1-associated disorders, this study provides a unifying framework for understanding ribosomopathy-driven craniofacial syndromes. Clinically, recognizing these common molecular mechanisms may inform anticipatory management, including monitoring for skeletal, neurological, and hematological manifestations. Furthermore, elucidating the downstream signaling consequences of Pol I dysfunction opens avenues for therapeutic exploration, potentially targeting ribosome biogenesis, chromatin accessibility, or compensatory developmental pathways. Overall, these findings demonstrate the power of integrative genomics and systems biology in bridging genotype–phenotype gaps in rare developmental disorders, providing both mechanistic insight and a roadmap for translational application. 7. Conclusions Our analysis highlights considerable clinical and genetic overlap among Saethre–Chotzen, Sweeney–Cox, Treacher–Collins types 2–4, and Acrofacial Dysostosis—Cincinnati, with accumulating evidence that RNA polymerase I dysfunction may represent a shared pathogenic mechanism. These findings suggest that such disorders could be viewed as part of an emerging spectrum of Pol I gene-related disorders, rather than entirely distinct entities. Recognizing these connections may have future implications for genetic testing strategies, counseling, and clinical management, particularly as disorder-specific panels expand. Our case contributes to this developing framework and underscores the importance of further studies to clarify the molecular mechanisms, genotype–phenotype correlations, and potential diagnostic utility of considering these disorders together. Acknowledgments The authors recognize the National Institute of Child Health and Human Development (NICHD), grant number HD02528. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, M.G.B. and S.S.; methodology, M.G.B.; software, S.S.; validation, M.G.B., S.S. and S.L.; formal analysis, S.S.; investigation, S.S.; resources, M.G.B.; data curation, S.S.; writing—original draft preparation, S.S.; writing—review and editing, M.G.B.; visualization, S.S.; supervision, M.G.B.; project administration, M.G.B.; funding acquisition, M.G.B. All authors have read and agreed to the published version of the manuscript. Institutional Review Board The paper describes a single-patient clinical case report and does not meet the DHHS definition of “research,” which is: “a systematic investigation, including research development, testing and evaluation, designed to develop or contribute to generalizable knowledge” (45 CFR 46.102(l)). Therefore, IRB approval is not required. The patient’s information has been anonymized in accordance with HIPAA protections. Informed Consent Informed consent was obtained from all subjects involved in the study. Data Availability Statement All data are shown in this report. Conflicts of Interest The authors declare no conflicts of interest. References 1. Shprintzen R.J. Goldberg R.B. Lewin M.L. Sidoti E.J. Berkman M.D. Argamaso R.V. Young D. A new syndrome involving cleft palate, cardiac anomalies, typical facies, and learning disabilities: Velo-cardio-facial syndrome Cleft Palate J. 1978 15 56 62 272242 2. Shprintzen R.J. Goldberg R.B. Young D. Wolford L. The velo-cardio-facial syndrome: A clinical and genetic analysis Pediatrics 1981 67 167 172 10.1542/peds.67.2.167 7243439 3. Jones T.L. Baxter M.A. Khanduja V. A quick guide to survey research Ann. R. Coll. Surg. Engl. 2013 95 5 7 10.1308/003588413X13511609956372 23317709 PMC3964639 4. Butler M.G. Mowrey P. Should the 3C (craniocerebellocardiac) syndrome be included in the spectrum of velocardiofacial syndrome and DiGeorge sequence? J. Med. Genet. 1996 33 719 720 10.1136/jmg.33.8.719-a 8863172 PMC1050717 5. Lynch D.R. McDonald-McGinn D.M. Zackai E.H. Emanuel B.S. Driscoll D.A. Whitaker L.A. Fischbeck K.H. Cerebellar atrophy in a patient with velocardiofacial syndrome J. Med. Genet. 1995 32 561 563 10.1136/jmg.32.7.561 7562973 PMC1050553 6. Butler M.G. Oyetunji A. Manzardo A.M. Age Distribution, Comorbidities and Risk Factors for Thrombosis in Prader-Willi Syndrome Genes 2020 11 67 10.3390/genes11010067 31936105 PMC7017326 7. Smallwood K. Watt K.E.N. Ide S. Baltrunaite K. Brunswick C. Inskeep K. Capannari C. Adam M.P. Begtrup A. Bertola D.R. POLR1A variants underlie phenotypic heterogeneity in craniofacial, neural, and cardiac anomalies Am. J. Hum. Genet. 2023 110 809 825 10.1016/j.ajhg.2023.03.014 37075751 PMC10183370 8. Seither P. Coy J.F. Pouska A. Grummt I. Molecular cloning and characterization of the cDNA encoding the largest subunit of mouse RNA polymerase I Mol. Gen. Genet. 1997 255 180 186 10.1007/s004380050487 9236775 9. O’Leary N.A. Wright M.W. Brister J.R. Ciufo S. Haddad D. McVeigh R. Rajput B. Robbertse B. Smith-White B. Ako-Adjei D. Reference sequence (RefSeq) database at NCBI: Current status, taxonomic expansion, and functional annotation Nucleic Acids Res. 2016 44 D733 D745 10.1093/nar/gkv1189 26553804 PMC4702849 10. Russell J. Zomerdijk J.C. The RNA polymerase I transcription machinery Biochem. Soc. Symp. 2006 73 203 216 10.1042/bss0730203 PMC3858827 16626300 11. McStay B. Nucleolar organizer regions: Genomic “dark matter” requiring illumination Genes Dev. 2016 30 1598 1610 10.1101/gad.283838.116 27474438 PMC4973289 12. Thomson E. Ferreira-Cerca S. Hurt E. Eukaryotic ribosome biogenesis at a glance J. Cell Sci. 2013 126 Pt 21 4815 4821 10.1242/jcs.111948 24172536 13. Boulon S. Westman B.J. Hutten S. Boisvert F.M. Lamond A.I. The nucleolus under stress Mol. Cell 2010 40 216 227 10.1016/j.molcel.2010.09.024 20965417 PMC2987465 14. Grandori C. Gomez-Roman N. Felton-Edkins Z.A. Ngouenet C. Galloway D.A. Eisenman R.N. White R.J. c-Myc binds to human ribosomal DNA and stimulates transcription of rRNA genes by RNA polymerase I Nat. Cell Biol. 2005 7 311 318 10.1038/ncb1224 15723054 15. Mills E.W. Green R. Ribosomopathies: There’s strength in numbers Science 2017 358 eaan2755 10.1126/science.aan2755 29097519 16. Weaver K.N. Watt K.E. Hufnagel R.B. Navajas Acedo J. Linscott L.L. Sund K.L. Bender P.L. König R. Lourenco C.M. Hehr U. Acrofacial Dysostosis, Cincinnati Type, a Mandibulofacial Dysostosis Syndrome with Limb Anomalies, Is Caused by POLR1A Dysfunction Am. J. Hum. Genet. 2015 96 765 774 10.1016/j.ajhg.2015.03.011 25913037 PMC4570288 17. Vanderver A. Prust M. Tonduti D. Mochel F. Hussey H.M. Helman G. Garbern J. Eichler F. Labauge P. Aubourg P. GLIA Consortium Case definition and classification of leukodystrophies and leukoencephalopathies Mol. Genet. Metab. 2015 114 494 500 10.1016/j.ymgme.2015.01.006 25649058 PMC4390457 18. Szklarczyk D. Kirsch R. Koutrouli M. Nastou K. Mehryary F. Hachilif R. Gable A.L. Fang T. Doncheva N.T. Pyysalo S. The STRING database in 2023: Protein-protein association networks and functional enrichment analyses for any sequenced genome of interest Nucleic Acids Res. 2023 51 D638 D646 10.1093/nar/gkac1000 36370105 PMC9825434 19. Zhao D. Liu W. Chen K. Wu Z. Yang H. Xu Y. Structure of the human RNA polymerase I elongation complex Cell Discov. 2021 7 97 10.1038/s41421-021-00335-5 34671025 PMC8528822 20. Misiaszek A.D. Girbig M. Grötsch H. Baudin F. Murciano B. Lafita A. Müller C.W. Cryo-EM structures of human RNA polymerase I Nat. Struct. Mol. Biol. 2021 28 997 1008 10.1038/s41594-021-00693-4 34887565 PMC8660638 21. Trainor P.A. Dixon J. Dixon M.J. Treacher Collins syndrome: Etiology, pathogenesis and prevention Eur. J. Hum. Genet. 2009 17 275 283 10.1038/ejhg.2008.221 19107148 PMC2986179 22. Dixon M.J. Read A.P. Donnai D. Colley A. Dixon J. Williamson R. The gene for Treacher Collins syndrome maps to the long arm of chromosome 5 Am. J. Hum. Genet. 1991 49 17 22 1676560 PMC1683211 23. Vincent M. Geneviève D. Ostertag A. Marlin S. Lacombe D. Martin-Coignard D. Coubes C. David A. Lyonnet S. Vilain C. Treacher Collins syndrome: A clinical and molecular study based on a large series of patients Genet. Med. 2016 18 49 56 10.1038/gim.2015.29 25790162 24. Dixon J. Jones N.C. Sandell L.L. Jayasinghe S.M. Crane J. Rey J.P. Dixon M.J. Trainor P.A. Tcof1/Treacle is required for neural crest cell formation and proliferation deficiencies that cause craniofacial abnormalities Proc. Natl. Acad. Sci. USA 2006 103 13403 13408 10.1073/pnas.0603730103 16938878 PMC1557391 25. Qin Q. Xu Y. He T. Qin C. Xu J. Normal and disease-related biological functions of Twist1 and underlying molecular mechanisms Cell Res. 2012 22 90106 10.1038/cr.2011.144 PMC3351934 21876555 26. Bourgeois P. Stoetzel C. Bolcato-Bellemin A.L. Mattei M.G. Perrin-Schmitt F. The human H-twist gene is located at 7p21 and encodes a B-HLH protein that is 96% similar to its murine M-twist counterpart Mamm. Genome 1996 7 915 917 10.1007/s003359900269 8995765 27. Shishido E. Higashijima S. Emori Y. Saigo K. Two FGF-receptor homologues of Drosophila: One is expressed in mesodermal primordium in earlyembryos Development 1993 117 751 761 10.1242/dev.117.2.751 8330538 28. Wang S.M. Coljee V.W. Pignolo R.J. Rotenberg M.O. Cristofalo V.J. Sierra F. Cloning of the human twist gene: Its expression is retained in adult mesodermally-derived tissues Gene 1997 187 83 92 10.1016/S0378-1119(96)00727-5 9073070 29. Yang J. Mani S.A. Donaher J.L. Ramaswamy S. Itzykson R.A. Come C. Savagner P. Gitelman I. Richardson A. Weinberg R.A. Twist, a master regulator of morphogenesis, plays an essential role in tumor metastasis Cell 2004 117 927 939 10.1016/j.cell.2004.06.006 15210113 30. Stasinopoulos I.A. Mironchik Y. Raman A. Wildes F. Winnard P. Jr. Raman V. HOXA5-twist interaction alters p53 homeostasis in breast cancer cells J. Biol. Chem. 2005 280 2294 2299 10.1074/jbc.M411018200 15545268 31. Niesner U. Albrecht I. Janke M. Doebis C. Loddenkemper C. Lexberg M.H. Eulenburg K. Kreher S. Koeck J. Baumgrass R. Autoregulation of Th1-mediated inflammation by twist1 J. Exp. Med. 2008 205 1889 1901 10.1084/jem.20072468 18663125 PMC2525589 32. Wilkie A.O. Morriss-Kay G.M. Genetics of craniofacial development and malformation Nat. Rev. Genet. 2001 2 458 468 10.1038/35076601 11389462 33. Ciurea A.V. Toader C. Genetics of craniosynostosis: Review of the literature J. Med. Life 2009 2 5 17 20108486 PMC5051481 34. Agochukwu N.B. Solomon B.D. Muenke M. Impact of genetics on the diagnosis and clinical management of syndromic craniosynostoses Child’s Nerv. Syst. 2012 28 1447 1463 10.1007/s00381-012-1756-2 22872262 PMC4101189 35. Jabs E.W. TWIST1 and the Saethre-Chotzen syndrome Inborn Errors of Development: The Molecular Basis of Clinical Disorders of Morphogenesis 2nd ed. Epstein C.J. Erickson R.P. Wynshaw-Boris A. Oxford University Press Melbourne, Australia 2008 474 481 36. El Ghouzzi V. Lajeunie E. Le Merrer M. Cormier-Daire V. Renier D. Munnich A. Bonaventure J. Mutations within or upstream of the basic helix-loop-helix domain of the TWIST gene are specific to Saethre-Chotzen syndrome Eur. J. Hum. Genet. 1999 7 27 33 10.1038/sj.ejhg.5200240 10094188 37. El Ghouzzi V. Legeai-Mallet L. Aresta S. Benoist C. Munnich A. de Gunzburg J. Bonaventure J. Saethre-Chotzen mutations cause TWIST protein degradation or impaired nuclear location Hum. Mol. Genet. 2000 9 813 819 10.1093/hmg/9.5.813 10749989 38. Yousfi M. Lasmoles F. El Ghouzzi V. Marie P.J. Twist haploinsufficiency in Saethre-Chotzen syndrome induces calvarial osteoblast apoptosis due to increased TNFα expression and caspase-2 activation Hum. Mol. Genet. 2002 11 359 369 10.1093/hmg/11.4.359 11854168 39. Guenou H. Kaabeche K. Mée S.L. Marie P.J. A role for fibroblast growth factor receptor-2 in the altered osteoblast phenotype induced by Twist haploinsufficiency in the Saethre-Chotzen syndrome Hum. Mol. Genet. 2005 14 1429 1439 10.1093/hmg/ddi152 15829502 40. Cai J. Shoo B.A. Sorauf T. Jabs E.W. A novel mutation in the TWIST gene, implicated in Saethre-Chotzen syndrome, is found in the original case of Robinow-Sorauf syndrome Clin. Genet. 2003 64 79 82 10.1034/j.1399-0004.2003.00098.x 12791045 41. Thakur A.R. Naikmasur V.G. A case of Robinow-Sorauf syndrome (Craniosynostosis-Bifid Hallux Syndrome): The allelic variant of the Saethre-Chotzen syndrome Indian J. Dent. 2014 5 96 99 10.4103/0975-962X.135276 25565733 PMC4184321 42. Kim S. Twigg S.R.F. Scanlon V.A. Chandra A. Hansen T.J. Alsubait A. Fenwick A.L. McGowan S.J. Lord H. Lester T. Localized TWIST1 and TWIST2 basic domain substitutions cause four distinct human diseases that can be modeled in Caenorhabditis elegans Hum. Mol. Genet. 2017 26 2118 2132 10.1093/hmg/ddx107 28369379 PMC5438873 43. Schaefer E. Collet C. Genevieve D. Vincent M. Lohmann D.R. Sanchez E. Bolender C. Eliot M.M. Nürnberg G. Passos-Bueno M.R. Autosomal recessive POLR1D mutation with decrease of TCOF1 mRNA is responsible for Treacher Collins syndrome Genet. Med. 2014 16 720 724 10.1038/gim.2014.12 24603435 44. Schömig-Spingler M. Schmid M. Brosi W. Grimm T. Chromosome 7 short arm deletion, 7p21→pter Hum. Genet. 1986 74 323 325 10.1007/BF00282559 3781561 45. Kosan C. Kunz J. Identification and characterization of the gene TWIST NEIGHBOR (TWISTNB) located in the microdeletion syndrome 7p21 region Cytogenet. Genome Res. 2002 97 167 170 10.1159/000066618 12438708 46. Johnson D. Horsley S.W. Moloney D.M. Oldridge M. Twigg S.R. Walsh S. Barrow M. Njølstad P.R. Kunz J. Ashworth G.J. A comprehensive screen for TWIST mutations in patients with craniosynostosis identifies a new microdeletion syndrome of chromosome band 7p21.1 Am. J. Hum. Genet. 1998 63 1282 1293 10.1086/302122 9792856 PMC1377539 Figure 1 Craniofacial and full body views of front, back, and extremities of the male proband at 3 months of age. A pathogenic missense POLR1A variant was found at c.1488G > T (p.Met496Ile). Figure 2 STRING protein–protein interactions with POLR1A. Associations indicate shared function and interactions among proteins. The legend and the color corresponding to the connecting lines describe whether the interaction is known, experimentally, via database, or based on predicted interactions and similarities. Figure 3 POLR1A gene–gene functional interactions determined via binding (blue lines) and co-expression (orange lines). POLR1A H4C RRN3 PARP1, NOLC1 ASB7 https://apps.pathwaycommons.org/search?type=Pathway&q=POLR1A Figure 4 Structures of Pol I show the POLR1A (tan) and POLR1B (green) subunits. ( A B genes-16-01063-t001_Table 1 Table 1 Clinical and genetic findings from overlapping syndromes with POLR1A and related gene mutations. Highlights denote shared genetic or clinical presentations of two or more across each row.  Acrofacial-Dysostosis, Cincinnati Type (616462) Saethre–Chotzen (101400) Sweeney–Cox (617746) Robinow–Sorauf (180750) Treacher–Collins 2,3, and 4 (613717, 248390, and 248390) Clinical Report at 3 Months of Age Overlapping Clinical Findings Inheritance  -Autosomal Dominant  -Autosomal Dominant  -Autosomal Dominant  -Autosomal Dominant  -Autosomal Dominant  -Autosomal Dominant -Autosomal Dominant Growth  -Short stature -Low weight -Failure to thrive  -Short stature     -Short stature -Low weight -Failure to thrive -Short stature Head  -Microcephaly -Trigonocephaly  -Brachycephaly -Acrocephaly  -Flattened occiput -Brachycephaly    -Cranial deformity -Mis-shaped head Neck   -Wide neck     Face  -Mild to severe midface hypoplasia -Mild to severe micrognathia -Hypoplastic zygomatic arches -Hypoplastic maxilla -Hypoplastic Mandible -Absent mandibular rami  -Flat face -High, flat forehead -Low frontal hairline -Maxillary hypoplasia -Facial asymmetry -Prominent metopic ridge -Low hairline -Midface hypoplasia -Micrognathia, mild  -Zygomatic complex hypoplasia -Mandibular hypoplasia -Malar hypoplasia  -Facial anomaly -Low hairline -Micrognathia -Abnormal, low frontal or scalp hairline Ears -Large ears -Microtia -Thickened helices -Low-set ears -Anteriorly placed ears -Anotia with conductive hearing loss -Sensorineural hearing loss  -Long, prominent ear crus -Small ears -Low-set ears -Atpical cartilage deformity -Deafness -Small ears -Low-set ears -Narrow external ear canals -Hearing loss, bilateral  -Malformation of auricle -Conductive hearing loss -Small, malformed ears -Small ear canals -Hearing loss -Low-set, abnormal size, and malformed ears Eyes -Downslanting palpebral fissures -Upslanting palpebral fissures -Mild to severe hypertelorism -Telecanthus -Eyelid clefts -Eyelid coloboma -Ptosis -Inferiorly displaced orbits -Shallow orbits -Hypertelorism -Strabismus -Hypertelorism -Upper eyelid colobomas -Deficient bony orbits -Small globes -Shallow orbits -Hypertelorism -Strabismus  -Downslanting of palpebral fissure -Coloboma  -Severe hypertelorism -Coloboma -Right eye Telecanthus -Telecanthus Nose -Broad, flat nasal bridge -Hypoplastic alae nasi -Choanal atresia -Thin, long pointed nose -Wide nasal bridge -Hypoplastic alae nasi -Choanal atresia -Long, pointed nose  -Choanal atresia/stenosis  -Abnormal hypoplastic alae Mouth  -High-arched palate -Cleft palate -Narrow palate -Cleft palate -Small mouth -Cleft-palate -High-arched palate   -Cleft palate  -Abnormal palate with cleft Cardiovascular  -Patent ductus arteriosus -Atrial septal defect -Patent foramen ovale -Hypertrophic cardiomyopathy -Congenital defects     -Atrial cardiac defect -Cardiac defects Skull  -Microcephaly -Metopic craniosynostosis -Partial acalvaria -Late closing fontanelles -Craniosynostosis of coronal, lamboid, or metopic structures  -Small frontal bones -Thickened frontal bones -Wide anterior fontanel -Fusion of occipito-mastoid suture    -Acalvaria -Craniosynostosis -Skull defects Abdomen/GU/Pelvis -Dysplastic acetabulae -Feeding problems -Small Ilia -GERD -Imperforate anus -Cryptorchidism    -Cryptorchidism -Gastric tube placement -Cryptorchidism Chest   -Short clavicle     Limbs -Short, bowed forearms -Radioulnar synostosis      Hands  -Short broad digits -Preaxial polydactyly -Adducted thumb with bifid distal phalanx -Fifth finger clinodactyly and short medial phalanx  -Syndactyly, mild and often in second or third fingers -Bifid terminal phalanges -Brachydactyly -Fifth finger clinodactyly  -Long fingers -Relatively short and fixed flexion of distal phalanges -Cutaneous syndactyly    -Syndactyly Feet -Short toes -Overriding toes -Club feet -Absent first metatarsal -Syndactyly  -Cutaneous syndactyly  -Broad great toes -Duplicated distal toe phalanx   -Syndactyly Neurologic -Hypotonia -Global developmental delay -Motor delay -Delayed or absent speech  -Global developmental delay -Developmental and learning disability -Speech delay   -Motor delay -Speech delay  -Global developmental delay Other -Asymmetric thumb nails -Increased risk of breast cancer -Generalized hirsutism     Molecular genetics  -POLR1A -TWIST1 -TWIST1 -TWIST1  -POLR1D (2) -POLR1C (3) -POLR1B (4)  -POLR1A -POLR1A genes-16-01063-t002_Table 2 Table 2 Analysis and results of the ten interactive proteins associated with POLR1A identified using STRING computer-based program with shared and corresponding biological processes (Gene Ontology), molecular functions (Gene Ontology), cellular components (Gene Ontology), pathways (Reactome), and human phenotype correlations. Biological Process CIN A Strength B Signal C FDR D Transcription by RNA polymerase I 5 of 25 2.55 4.37 3.76 × 10 −9 RNA polymerase I preinitiation complex assembly 2 of 10 2.55 1.08 0.0108 Nucleolus organization 2 of 15 2.38 0.93 0.0194 rRNA transcription 2 of 21 2.23 0.81 0.0328 ncRNA transcription 3 of 38 2.15 1.57 0.00097 DNA-templated transcription, initiation 3 of 131 1.61 0.8 0.0239 Transcription, DNA-templated 11 of 518 1.58 3.44 7.37 × 10 −14 Transcription by RNA polymerase II 4 of 357 1.3 0.76 0.0172 Molecular Function CIN Strength Signal FDR DNA-directed 5-3 RNA polymerase activity 6 of 29 2.57 5.29 4.52 × 10 −11 DNA binding 9 of 2498 0.81 0.71 0.00026 Nucleic acid binding 10 of 4003 0.65 0.53 0.00067 Cellular Component CIN Strength Signal FDR RNA polymerase I complex 10 of 13 3.14 13.65 1.06 × 10 −26 RNA polymerase III complex 5 of 19 2.67 5.09 1.79 × 10 −10 RNA polymerase II, core complex 4 of 15 2.68 3.96 3.46 × 10 −18 Nucleolus 11 of 996 1.3 2.22 2.01 × 10 −12 Nucleoplasm 11 of 4169 0.67 0.63 6.08 × 10 −6 Fibrillar center 3 of 145 1.57 1.04 0.0058 Reactome Pathway CIN Strength Signal FDR RNA polymerase I transcription termination 9 of 30 2.73 10.01 7.16 × 10 −21 RNA polymerase III chain elongation 4 of 17 2.62 3.82 5.95 × 10 −8 RNA polymerase I transcription initiation 10 of 46 2.59 10.13 3.67 × 10 −22 Signaling by FGFR2 IIIa 4 of 19 2.58 3.73 8.12 × 10 −8 RNA Polymerase III transcription termination 4 of 22 2.51 3.6 1.27 × 10 −7 Abortive elongation of HIV-1 transcript in absence of Tat 4 of 23 2.49 3.57 1.39 × 10 −7 RNA Polymerase I promoter escape 10 of 59 2.48 9.46 1.75 × 10 −21 MicroRNA (miRNA) biogenesis 4 of 24 2.47 3.54 1.52 × 10 −7 B-WICH complex positively regulates rRNA expression 9 of 59 2.44 8.29 8.31 × 10 −19 RNA Polymerase III transcription initiation from type 2 promoter 4 of 26 2.44 3.47 1.92 × 10 −7 FGFR2 alternative splicing 4 of 26 2.44 3.47 1.92 × 10 −7 Phenotype CIN Strength Signal FDR Branchial fistula 2 of 6 2.78 0.99 0.0161 Lower eyelid coloboma 2 of 8 2.65 0.94 0.0194 Multiple enchondromatosis 2 of 9 2.6 0.92 0.0211 Choanal stenosis 3 of 21 2.41 1.35 0.0032 Narrow internal auditory canal 2 of 14 2.41 0.84 0.0297 Short face 2 of 16 2.35 0.81 0.0329 Facial cleft 2 of 16 2.35 0.81 0.0329 Eyelid coloboma 3 of 30 2.25 1.27 0.0043 Rectovaginal fistula 2 of 20 2.25 0.79 0.0356 Thyroid hypoplasia 2 of 21 2.23 0.79 0.0356 Absent eyelashes 2 of 26 2.14 0.73 0.0447 Glossoptosis 2 of 26 2.14 0.73 0.0447 Hypoplasia of the zygomatic bone 2 of 29 2.09 0.71 0.0477 Hypoplasia of the thymus 2 of 30 2.08 0.71 0.0477 Blepharospasm 2 of 32 2.05 0.70 0.0492 Preauricular skin tag 3 of 51 2.02 1.06 0.0096 Abnormal periauricular region morphology 3 of 77 1.84 0.90 0.0181 Choanal atresia 3 of 101 1.73 0.79 0.0279 Hypoplasia of the maxilla 3 of 104 1.71 0.79 0.0279 Microtia 3 of 113 1.68 0.77 0.0297 Abnormality of the maxilla 3 of 118 1.66 0.77 0.0297 Cleft upper lip 3 of 144 1.57 0.72 0.0356 Cleft lip 3 of 183 1.47 0.64 0.0477 Narrow mouth 3 of 198 1.43 0.63 0.0495 A B C p D p genes-16-01063-t003_Table 3 Table 3 RNA Polymerase1A-associated proteins, functions, and disorders. Gene Protein Function/Role 1 Pathways/Interactions 2 Associated Disorders 3 POLR1F (TWISTNB) Subunit of RNA polymerase I; enables DNA-directed 5′–3′ RNA polymerase activity; essential for rRNA precursor synthesis and protein production. Associates with RRN3/TIF-IA; may recruit Pol I to rDNA promoters. Inflammatory bowel disease 2; Saethre–Chotzen syndrome RRN3 RNA Pol I transcription factor; enables core promoter sequence-specific DNA binding; regulates transcription initiation; negative regulation of p53-mediated apoptosis. Associates with POLR1A; nucleolar localization. Childhood-onset neurodegeneration with brain atrophy; Treacher–Collins syndrome 1 (potential) POLR1D Component of RNA polymerase I and III complexes; synthesizes rRNA precursors and small RNAs. Core Pol I/Pol III subunit. Treacher–Collins syndrome 1 and 2 POLR2L Subunit of RNA polymerase II; synthesizes mRNA; contains zinc-binding domain. RNA Pol II complex. Cockayne syndrome; Hyperparathyroidism 2 with jaw tumors POLR1H Subunit of RNA polymerase I; contains zinc-binding motifs; involved in proofreading nascent RNA and regulation of cell proliferation. Functions in Pol I error correction. Gastric cancer; Seckel syndrome POLR2K Small subunit of RNA polymerase II; involved in mRNA synthesis. RNA Pol II complex. Immunodeficiency 26; Primary ciliary dyskinesia POLR1E Facilitates Pol I initiation complex formation by mediating Pol I–UBTF interaction; contributes to DNA binding and Pol I transcription. Pol I initiation factor binding. Primary hyperoxaluria; Diamond–Blackfan anemia POLR2F Sixth largest Pol II subunit; mRNA synthesis. RNA Pol II complex. Peripheral demyelinating neuropathy, central dysmyelination, Waardenburg syndrome, Hirschsprung disease POLR2H Essential Pol II subunit; contributes to Pol I and II activity; synthesizes rRNA, mRNA, small RNAs (e.g., 5S rRNA, tRNAs). Shared between Pol I and Pol II. Progressive leukoencephalopathy with ovarian failure POLR1B Core catalytic subunit of RNA Pol I active center; works with POLR1A in nucleotide addition, proofreading, and backtracking. Coordinates Mg 2+ Treacher–Collins syndrome 1 and 4 1 www.string-db.org 2 3 genes-16-01063-t004_Table 4 Table 4 RNA Polymerase 1A-associated genes, with functions and associated disorders. Category Gene Function/Role 1 Associated Disorders 2 Binding CIT Serine/threonine kinase important for cytokinesis; works with KIF14 at central spindle. Bipolar disorder, schizophrenia Binding NOLC1 Nucleolar protein connecting RNA Pol I to ribosomal processing enzymes; monoubiquitinated by BCR complex and associates with TCOF1; essential for neural crest specification. Neural crest development Binding PARP1 Poly(ADP-ribosyl) transferase; DNA-dependent chromatin enzyme regulating proliferation, differentiation, tumor suppression, and DNA repair. Fanconi anemia, type 1 diabetes mellitus Binding ASB7 Ankyrin repeat protein with SOCS-box motif; bridges substrate-binding and E3 ubiquitin ligases; regulates protein turnover via ubiquitination.  Binding RRN3 RNA Pol I core promoter factor; initiates transcription (described in Table 1 Childhood-onset neurodegeneration, Treacher–Collins syndrome 1 (potential) Binding LMBR1L Transmembrane protein; involved in receptor-mediated endocytosis and signal transduction; localizes to ER and plasma membrane.  Binding BRCA1 Nuclear phosphoprotein; tumor suppressor; forms BASC complex with Pol II; regulates transcription, DNA repair, and recombination. Hereditary breast and ovarian cancer Binding + Co-expression Histone genes (H2A, H2B, H3, H4, H1) Core nucleosome proteins; package DNA into chromatin; H1 compacts DNA into higher-order structures.  1 2 ",
  "metadata": {
    "Title of this paper": "A comprehensive screen for TWIST mutations in patients with craniosynostosis identifies a new microdeletion syndrome of chromosome band 7p21.1",
    "Journal it was published in:": "Genes",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470080/"
  }
}