{
  "title": "Paper_961",
  "abstract": "pmc Polymers (Basel) Polymers (Basel) 3589 polymers polymers Polymers 2073-4360 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473284 PMC12473284.1 12473284 12473284 41012220 10.3390/polym17182456 polymers-17-02456 1 Article PVA-Cellulose Fibers Composites Impregnated with Antimicrobial Particles: The Solvent Effect https://orcid.org/0000-0001-7157-5942 Grigoras Anca Giorgiana Conceptualization Methodology Validation Resources Data curation Writing – original draft Writing – review & editing Visualization Supervision 1 * https://orcid.org/0000-0001-6449-8408 Popescu Irina Formal analysis Investigation Writing – review & editing 1 https://orcid.org/0000-0001-9106-8139 Gradinaru Luiza Madalina Formal analysis Investigation Writing – review & editing 1 Mihalache Gabriela Formal analysis Investigation Writing – review & editing 2 https://orcid.org/0000-0002-2127-4225 Lipsa Florin Daniel Validation Writing – review & editing 3 https://orcid.org/0000-0002-7498-807X Nica Simona Luminita Formal analysis Writing – review & editing 1 Grigoras Vasile Cristian Methodology Validation Writing – review & editing Visualization 1 Pizzi Antonio Academic Editor Tofanica Bogdan Marian Academic Editor 1 2 3 * angrig@icmpp.ro 10 9 2025 9 2025 17 18 497668 2456 13 8 2025 01 9 2025 09 9 2025 10 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Nowadays, utilizing biodegradable and bio-inspired substances and combining them in innovative ways is a prerequisite for obtaining new and useful materials. In this paper, we designed and characterized eco-friendly materials as alternatives for packaging and medical applications. Thus, cellulose fibers of medical gauze or filter paper were coated with a mixed solution containing poly(vinyl alcohol) (PVA), plant-based synthesized silver particles (AgPs), and magnetite (MG). The composites and their components were studied using UV-Vis, FTIR, and Energy-Dispersive X-ray (EDX) spectroscopy, Dynamic Light Scattering (DLS), Transmission Electron Microscopy (TEM), and Scanning Electron Microscopy (SEM) to evidence the presence, size, surface charge, morphology, and chemical composition of particles in the composites, as well as particle interactions. Their proven hydrophobic and antibacterial character could recommend them for the design of antifouling medical coatings and food packaging. cellulose-PVA composites silver particles magnetite cryogel wettability antimicrobial activity This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction In recent years, the development of multifunctional composite materials has gained significant momentum, particularly in biomedical, environmental, and packaging applications. Among these, polymer-based composites incorporating inorganic nanoparticles have shown remarkable promise due to their enhanced mechanical, thermal, and biological properties [ 1 3 4 PVA is widely used in biomedical and environmental engineering due to its non-toxic nature, biodegradability, and ability to form hydrogels through physical or chemical crosslinking. When subjected to freeze–thaw cycles, PVA undergoes physical gelation, resulting in cryogels with highly porous, interconnected network structures. This process avoids the use of potentially harmful chemical crosslinkers and creates a suitable matrix for immobilizing nanoparticles and controlling moisture absorption or diffusion [ 2 Silver nanoparticles (AgNPs) are well known for their broad-spectrum antimicrobial properties, attributed to their ability to disrupt bacterial membranes and interfere with cellular metabolism. Incorporating AgNPs into polymer matrices allows for controlled release and enhanced durability of their antibacterial effects. MG nanoparticles, owing to their superparamagnetic properties, introduce additional functionality to the composite, enabling applications such as targeted drug delivery, magnetic separation, and remote actuation. Green chemistry plays an increasingly important role in nanotechnology. In this context, plant-derived phytochemicals serve as both reducing and stabilizing agents for the eco-friendly synthesis of AgNPs. Plant extracts, rich in bioactive compounds such as polyphenols (e.g., flavonoids and phenolic acids), terpenoids, proteins, reducing sugars, and organic acids, effectively reduce silver ions (Ag + 0 3 4 5 6 The use of cellulose fibers, in forms such as medical gauze or paper, as a solid support enhances the mechanical integrity of the composites while providing a biocompatible and flexible substrate. The hydrophilic nature of cellulose also interacts favorably with the PVA matrix, ensuring uniform coating and structural stability. Additionally, the choice of solvent (e.g., water or ethanol) during nanoparticle dispersion and composite casting has a significant influence on the final microstructure, affecting nanoparticle distribution and surface wettability. Wettability, typically measured by contact angle analysis, is a critical surface property that governs fluid absorption, bacterial adhesion, and the formation of biofilms. It can be tuned by varying the PVA-to-nanoparticle ratio, the nature of the cellulose substrate, and the casting solvent. These variables influence surface energy, porosity, and morphology, thereby dictating how the composite interacts with biological fluids. The antibacterial efficacy of these composites is primarily due to AgNPs; the spatial distribution and long-term stability of the nanoparticles, along with potential synergistic effects with MG, also contribute to sustaining the antimicrobial action. These features are crucial for applications such as wound dressings, hygiene products, and medical coatings where infection control is essential. Hybrid nanostructures that combine the antimicrobial or catalytic effects of silver with the magnetic or adsorptive properties of MG are being widely explored for use in biomedical, environmental, and catalytic applications—including antimicrobial agents, drug delivery systems, wastewater treatment, MRI contrast agents, and redox or photocatalytic reactions [ 7 8 9 10 11 12 13 14 15 16 17 18 Unlike conventional hydrogels or coatings, cryogelation offers distinct advantages: it uses physical rather than chemical crosslinking, eliminating toxic reagents and reducing regulatory concerns for biomedical use. The physically crosslinked network can be reversible, allowing for reprocessing or reuse. The ice crystals formed during freezing act as porogens, creating a highly porous structure ideal for biomedical, filtration, or food [ 2 19 The solvent type plays a crucial role in determining the cryogel’s microstructure. The water crystallization during freeze–thaw cycles drives the gel’s pore architecture [ 20 21 22 23 24 While AgNPs possess potent antibacterial properties, MG particles exhibit milder antimicrobial effects [ 25 The primary aim of this research is to develop and characterize PVA-based cryogel composites embedded with AgPs and MG particles, reinforced with cellulose fibers, and to investigate how processing variables (e.g., solvent type, freeze–thaw conditions) influence their surface characteristics and biological functionality. A secondary objective is to evaluate the efficacy of different added capping agents for plant-derived synthesis of AgPs. This study introduces a novel composite that combines the mechanical flexibility and hydrophilicity of cellulose, the gel-forming ability of PVA, and the multifunctionality of metal nanoparticles. 2. Materials and Methods 2.1. Materials The mature Salvia officinalis 3 4 3 4 3 2.2. Synthesis of Silver Particles (AgPs) The bio-inspired synthesis of silver particles was conducted following a previously published protocol [ 26 Salvia officinalis v v The plant extract was then processed using a rotary evaporator, initially heated for 30 min at 80 °C, followed by an additional 30 min at 60 °C, with continuous rotation at 50 rpm in a water bath. After processing, the extract was cooled to room temperature, diluted to 250 mL with the same solvent mixture, filtered through standard filter paper, and stored in a refrigerator until further use. To adjust the pH of the extract to alkaline conditions (from pH 5 to 9), an aqueous solution of 0.1 M NaHCO 3 w v w v 3 + The resulting colloidal solutions were subjected to successive centrifugation at 10,000 rpm. The supernatant was decanted, and the precipitated particles were redispersed in the solvent. The final sediments were dried under vacuum at 60 °C. Two types of silver particles were obtained based on the stabilizing agent used: A-type AgPs B-type AgPs Previous studies have confirmed that Salvia 5 + 0 3 4 27 28 29 30 2.3. Preparation of Particle Mixtures and Design of Cellulose-Based Composites Solutions with initial concentrations of 0.1% ( w v w v Initially, the inorganic particles (AgPs and MG) were dispersed separately by sonication for 2 h in either water or ethanol using an ultrasonic bath with 42 KHz frequency and 100 W power output (Cole-Parmer Instrument Company, Vermon Hills, IL, USA). The pH of the MG suspension was adjusted to 9 using an aqueous solution of ammonium bicarbonate ((NH 4 3 On the following day, the mixed inorganic suspension, re-homogenized by ultrasonication for 30 min, was slowly added dropwise into the PVA solution. The resulting mixture was continuously stirred for over 30 min at 35 °C using magnetic agitation to ensure uniform dispersion. As described in Section 2.1 A total of eight composite samples were prepared, starting from two types of silver particles, one type of magnetite, two types of solvents, and two types of cellulose supports ( Table 1 CPZ 1-4 CZH 1-4 CPZ-M CZH-M 2.4. Characterization Methods of Particles and Composites 2.4.1. Transmission Electron Microscopy (TEM) Transmission electron microscopy was used to evaluate the size and morphology of the AgPs produced via plant-mediated synthesis. The analyses were performed using a Hitachi HT7700 series TEM (Hitachi, Ltd., Minato-ku, Tokyo, Japan) operated at a maximum acceleration voltage of 120 kV. This instrument features a special design that enables imaging in “high-contrast” or “high-resolution” modes without the need for additional adjustments, allowing real-time visual inspection under daylight conditions directly on the display. The samples were prepared by depositing the nanoparticles from the liquid phase onto Ted Pella 300-mesh copper grids coated with a carbon film. The grids were then dried under conditions optimized for the specific material to minimize alterations to their morphology and appearance. 2.4.2. Scanning Electron Microscopy (SEM) and Energy-Dispersive X-Ray (EDX) Spectroscopy The sample’s particle shape and chemical composition were examined using a Verios G4 UC Scanning electron microscope (Thermo Scientific, Brno, Czech Republic) fitted with an energy-dispersive X-ray spectroscopy analyzer (Octane Elect Super SDD detector, Pleasanton, CA, USA). For SEM analysis, the samples were mounted on aluminum stubs using double-sided carbon adhesive tape and coated with a 4 nm layer of platinum with a Leica EM ACE200 sputter coater (Vienna, Austria) to ensure electrical conductivity and minimize charge accumulation under the electron beam. The morphological characterization was performed with a secondary electron detector-Through Lens Detector (TLD) in high-resolution mode at an accelerating voltage of 5 kV and a beam current of 0.2 nA. For EDX measurements, the samples were examined at an accelerating voltage of 20 kV and a beam current of 6.4 nA. 2.4.3. UV-Vis Spectroscopy UV–Visible spectra were recorded using a SPECORD 200 spectrophotometer (Analytik Jena GmbH & Co., Jena, Germany) with 1 × 1 cm 2 Unlike bulk metals, the metallic nanoparticles acquire optical resonance during the interaction with electromagnetic waves. The collective oscillations of the surface free electrons in multiple directions —referred to as plasmonic modes—are readily excited. The principal plasmonic resonance modes are as follows: In-plane dipole mode: This mode gives rise to a strong, dominant surface plasmon resonance (SPR) peak in the UV–Vis region; Out-of-plane quadrupole mode: This mode results in a weaker and broader signal in the UV–Vis spectrum, often observed as a shoulder peak, and is typically associated with asymmetric nanoparticles or particle aggregation [ 31 32 33 Usually, the appearance of a dark-brown color during the synthesis process of metallic nanoparticles is attributed to this SPR [ 34 35 36 37 2.4.4. Dynamic Light Scattering (DLS) The particle size in aqueous and ethanol solutions was measured using a Zetasizer Nano ZS (Malvern Instruments, Malvern, UK) equipped with a 633 nm He-Ne laser and backscattering detection at 173°. For the DLS experiments, the 0.1% ( w v w v The researchers often compare the size of nanoparticles in a colloidal dispersion with the particle size obtained after solution drying [ 38 39 40 41 42 43 44 2.4.5. Fourier-Transform Infrared (FTIR) Spectroscopy FTIR spectra were collected in the transmission mode from 400 cm −1 −1 −1 2.4.6. Contact Angle Measurements The wettability of the samples was established by measuring the static contact angle values using the sessile drop method at room temperature with a CAM 101 Optical Contact Angle device (KSV Instruments, Helsinki, Finland). The solvent used was MilliQ water. A Hamilton syringe was utilized to place a drop of liquid (~1 µL) on the surface of the samples, and images were captured for analysis on a computer. 2.4.7. Antimicrobial Screening Model microorganisms such as E. coli S. aureus 2 8 45 2 2 2.4.8. Statistical Analysis The statistical analysis was performed using OriginPro 2018 software (OriginLab Corporation, Northampton, MA, USA), and results were expressed as mean ± standard deviation (SD) of three replicates (n = 3). All data were analyzed by one-way ANOVA, followed by Student’s t p p 3. Results and Discussion 3.1. Morphology and Size of Silver Particles in Bulk The morphology of AgNPs can vary significantly depending on the synthesis conditions. When using different Salvia 15 In the present study, we predominantly obtained spherical AgPs, which appeared embedded or sequestered within a matrix of organic residues—likely plant-derived compounds. Representative transmission electron microscopy (TEM) images of dry samples obtained from both aqueous and alcoholic dispersions are shown in Figure 1 To determine particle size distributions, 50–100 particles from each sample were analyzed using ImageJ software. The resulting histograms were used to calculate average particle sizes for each type of AgP. As expected, A-type AgPs, stabilized with small-molecule agents (e.g., dextrose), exhibited smaller average diameters, ranging from 18 to 23 nm. In contrast, B-type AgPs, coated with polymeric stabilizers (e.g., PEG), were larger, with sizes ranging from 26 to 30 nm ( Figure 1 The choice of solvent used during particle dispersion and drying for TEM grid preparation also influenced the observed particle size. The particles dried from ethanol generally displayed smaller sizes and better separation compared to those dried from aqueous solutions. This suggests that ethanol enhances particle dispersion upon solvent evaporation, a well-documented phenomenon exploited in TEM sample preparation to improve the resolution and reduce particle agglomeration. 3.2. Chemical Composition of Inorganic Particles EDX spectroscopy results are presented in Figure 2 Table 2 For both A-type and B-type AgPs, characteristic peaks corresponding to silver were observed—most notably the intense Ag(L) peak at 2.984 keV, associated with L-shell electronic transitions. These peaks confirm the successful synthesis of AgPs in both types. Additional peaks corresponding to carbon (C(K), 0.27 keV) and oxygen (O(K), 0.52 keV) were also detected. These signals are attributed in part to residual organic compounds originating from the Salvia officinalis 46 12 Similar results were reported by Sreckovic N.Z. et al. [ 47 Salvia pratensis 48 49 A small platinum peak (Pt(M)) at 2.04 keV was also present in Figure 2 The EDX spectrum of the MG sample ( Figure 2 50 Qualitative EDX analysis of the inorganic particles revealed the presence of silver, carbon, oxygen, iron, and trace chlorine in varying proportions ( Table 2 3.3. Surface Properties of Inorganic Particles and Their Mixture AgPs were combined with MG in different solvents to form composite mixtures. Mixtures prepared in water were designated as MIX 1 (A-type AgPs with MG) and MIX 2 (B-type AgPs with MG), while those prepared in ethanol were labeled MIX 3 (A-type AgPs with MG) and MIX 4 (B-type AgPs with MG). The size and surface morphology of the dried individual metallic particles and their mixtures were examined using SEM analysis. The AgPs synthesized via the plant-assisted method were predominantly spherical and smaller in size compared to the polyhedral, angular particles (e.g., cubic, hexagonal) characteristic of commercial MG, as shown in Figure 3 In all inorganic particle mixtures (MIX 1–4), two distinct populations of particles with different sizes and morphologies were identified. One population consisted of smaller particles, approximately an order of magnitude smaller than the other. These smaller AgPs ( Figure 3 Salvia Figure 3 Figure 3 In MIX 1, the SEM micrograph shows a relatively homogeneous composite with MG as the dominant phase, composed of faceted MG particles sparsely decorated with A-type AgPs. The low number of distinct AgPs on the MG surface suggests that A-type AgPs were well incorporated or embedded within the MG matrix. The rough surface observed in the MIX 3 sample can be attributed to three types of clusters: (a) MG aggregates formed due to dipole–dipole magnetic interactions characteristic of such materials, (b) A-type AgPs electrostatically adsorbed onto MG surfaces, and (c) agglomerates of A-type AgPs embedded in the more irregular and disrupted MG surface. In contrast, the micrograph of MIX 2 displays a distinct heterostructure morphology, indicating a different interaction mechanism between the inorganic components. Here, smaller, spherical B-type AgPs are anchored onto the surface of larger, irregular MG particles, resembling a core–shell configuration. The good dispersion and separation of B-type AgPs suggest stabilization via surface interactions with MG. Compared to MIX 2, the MIX 4 sample appeared smoother, with more irregular clustering. This morphology likely results from partial embedding of B-type AgPs into the MG matrix during drying, implying stronger interactions between the two components. In both MIX 2 and MIX 4, which contain B-type AgPs, PEG likely acts as a stabilizing or bridging agent between MG and AgPs. This is supported by SEM images showing MG particles decorated with smaller AgPs, indicating the presence of a polymeric interfacial layer. Finally, MIX 3 and MIX 4 (dried from ethanol) appear more compact than their water-based counterparts (MIX 1 and MIX 2). This may be because dextrose and PEG act as more effective capping agents in aqueous environments. The solvent system influenced the final morphology of the mixtures, with enhanced stability of B-type AgPs in the MG matrix observed in ethanol-dried samples. 3.4. Optical Properties of Inorganic Particles in Solution The AgNPs are also known to have a distinct SPR peak, and their absorption band is influenced by the shape and the size of the nanoparticles, too [ 51 52 The UV-Vis spectra of our AgPs obtained using Salvia officinalis Figure 4 Figure 5 max 52 53 26 Figure 4 3 Regarding the optical properties of the MG in the UV-Vis range, the results reported in the literature are contradictory. Some authors state that the MG exhibits characteristic absorption bands with peaks at 260–270 nm (Fe 2+ 3+ 2+ 54 55 56 2+ 3+ 57 58 Figure 5 Generally, the optical properties of the inorganic particles in solution changed after mixing the AgPs with the MG, depending on the solvent used for their dispersion ( Figure 5 The electrostatic interactions between B-type AgPs and MG in water caused a so-called “blueshift” for λ max 59 60 The AgNPs should also have the plasmon absorption maximum in ethanol between 400 and 450 nm [ 61 62 Figure 5 Figure 5 Because the polyphenols, containing chromophore benzene rings, are highly soluble in ethanol, the UV band at 285 nm ( Figure 5 63 3.5. Size Distributions and Colloidal Stability of Inorganic Particle in Solution The particle sizes in solution, as well as their colloidal stability, were monitored through DLS and zeta potential (ZP) measurements. The Z-average diameters and ZP of the AgPs and MG and their mixture in water and ethanol are summarized in Table 3 Figure 6 64 The stability of magnetic particles such as MG in solution is maintained when the attractive interactions responsible for particle aggregation (van der Waals and dipole–dipole forces) are counteracted by electrostatic repulsion between charged surfaces, hydrophilic interactions between particles, or the introduction of a surface shell that provides a steric barrier [ 65 MG is an amphoteric material, meaning it can act as both an acid and a base. Its surface contains Fe-OH sites that can undergo protonation (acting as Brønsted bases, meaning they accept protons (H + 2+ 66 Arias J.L. and colleagues [ 66 −3 64 67 In our study, MG particles, without a stabilizer, were poorly dispersed in water. Consequently, the inorganic particles with sizes between 100 and 1000 nm were obtained in water ( Figure 6 Figure 3 In the case of AgPs, the DLS measured the size of the particles coated with the organic layer (plant extract and capping agent). Using dextrose or PEG 6000 as capping agents for the synthesis of the AgPs, the colloidal stability was slightly improved compared with the old study (about 19 mV) [ 26 Figure 6 Figure 6 68 69 70 An unexpected result was when AgPs were mixed with MG (MIX 1 and MIX 2); the size distribution showed the presence of smaller particles ( Figure 6 Section 3.1 Table 3 The MG particles have an even worse dispersion ability in ethanol compared with water, so the polydispersity index was very high (0.93), and particles with 140 nm, 1100 nm, and 5600 nm were observed in the size distribution by intensity ( Figure 6 The AgPs, covered with capping agents and plant extract, have higher diameters in ethanol compared with water ( Table 3 Figure 6 Table 3 Silver, being a diamagnetic material, diminished the direct magnetic interactions between MG particles, thereby reducing their tendency to agglomerate. Consequently, coating MG particles with AgPs enhanced their colloidal stability, particularly in aqueous environments, as other studies confirmed [ 71 3.6. Interactions and Functional Groups of Inorganic Particles FTIR spectroscopy is widely applied for identifying and characterizing inorganic particles. In many studies on plant-based synthesized AgNPs, the discussion often focuses only on bands from phytochemicals—such as those at 3400–3200 cm −1 −1 −1 −1 8 10 11 12 13 14 58 72 Our FTIR investigation ( Figures S1–S4—Supplementary Materials (1) The signals centered at ~3435 cm −1 −1 (2) The 3010–2800 cm −1 −1 2 3 3 (3) The 1633 cm −1 −1 −1 −1 (4) The 1460 cm −1 −1 − −1 3 − 3 2 −1 (5) In 1230–900 cm −1 −1 −1 So, the signals from the 1500–1000 cm −1 (6) In the 900–650 cm −1 −1 Figures S1–S4 Table 4 (1) The peak at ~840 cm −1 (2) The peak observed at 803, 805, and 808 cm −1 −1 −1 (3) For the samples dried from ethanol, the signal observed at 804, 793, and 795 cm −1 −1 (4) The fingerprint of nanoparticles or bulk MG includes a main peak ~570 cm −1 3+ −1 2+ 3+ −1 −1 −1 −1 8 −1 58 −1 13 −1 −1 −1 −1 −1 −1 −1 58 3 4 (5) The AgPs spectra contain signals specific to Ag-Cl bonds: at ~569 cm −1 −1 −1 −1 −1 Salvia officinalis − 2 73 74 75 76 77 Section 3.2 (6) For the samples dried from water, the signals at 451, 457, and 457 cm −1 −1 2+ 3+ (7) MG dried from ethanol exhibits a characteristic peak at 452 cm −1 −1 −1 (8) The signal at ~395 cm −1 (9) In conclusion, the weak, indirect signatures observed in the ~800–300 cm −1 (10) In mixtures, most of the bands observed in the deconvoluted signals come from AgPs and/or MG, but new bands were recorded at ~723 cm −1 −1 −1 −1 3.7. Surface Properties of Composites The microstructure of the PVA-cellulose composites decorated with inorganic particles was influenced by the degree of compaction or volume density of the reinforcing agent (cellulose fibers), but also by the solvent used for cryogel formation, this being decisive for cryogel porosity. The SEM micrographs of composites are presented in Figure 7 In control samples (CPZ-M and CZH-M) the paper cellulose fibers were thicker than those from the gauze ( Figure 7 In case of CZH samples ( Figure 7 By weaving, the cellulose fibers in the gauze were more aerated, and the PVA matrix had partially seeped/penetrated between the cellulose fibers, and the voids formed by the PVA cryogel were consequently less visible in CPZ samples ( Figure 7 The thermal properties of the solvents (water or ethanol, respectively, from the water-ethanol mixture) influenced the porosity of the cryogels: thus, by adding ethanol, the freezing temperature/freezing rate of the composites formed from the water-ethanol mixture decreased. Simultaneously, the ethanol limited the formation of water crystals, resulting in smaller crystals compared to those formed by pure water. Thus, after the crystal thawing phase, the resulting pores were also smaller but more compact in the PVA cryogel prepared from the mixed solvent, compared to those in the PVA cryogel prepared from pure water. The physical interaction between the inorganic particles and the cellulose fiber-reinforced PVA matrix can also be observed in the SEM micrographs ( Figure 7 In the case of composites with gauze cellulose fibers ( Figure 7 In the case of composites containing filter paper ( Figure 7 3.8. Wettability of Composites Wettability is a key factor in various applications, including composite manufacturing, treatment of wood, ceramic, cellulose, or PVC, and even biomedical applications [ 78 79 80 The data presented in Table 5 81 82 Generally, the impregnation of different materials can change their surface chemistry and roughness, which in turn affects their wettability [ 83 84 3.9. Preliminary Evaluation of the Antimicrobial Activity of Composites AgNPs are among the most potent and widely studied antimicrobial agents. They exhibit broad-spectrum antibacterial activity against both Gram-positive and Gram-negative bacteria, including antibiotic-resistant strains. AgNPs are effective at very low concentrations, making them ideal for incorporation into biomaterials where long-term antimicrobial action is needed without cytotoxic effects on human cells. Their inclusion in the composite adds a biocidal functionality, crucial for wound dressings, medical textiles, and surfaces requiring hygienic protection. MG particles are biocompatible, superparamagnetic materials with applications ranging from magnetic drug delivery to biosensing and pollutant removal. In composite systems, MG may contribute to antibacterial activity via Fenton-like reactions or synergy with AgNPs. The mechanisms of action of metal particles on bacteria are not fully understood. Until now, researchers have proposed several mechanisms. One of the proposed mechanisms involves electrostatic interactions through attractive forces between metal particles with positive surface charge and negative charges of the bacterial surface. As a result of these interactions, bacteria are oxidized, and cell lysis occurs due to the nanomaterials’ released ions that interact with the thiol groups of proteins in the surface structure of the bacterial cell. Another frequently proposed mechanism refers to the occurrence of oxidative stress caused by ROS. Reactive oxygen species like singlet oxygen ( 1 2 2− 2 2 9 50 57 Other factors that have been reported to influence the antibacterial activity are the bacterial species, the nanoparticle type, size, shape, and charge, the stability of the particles, their concentration, the type of capping agent used, or the surface chemistry [ 57 85 86 87 Various composites comprising AgNPs combined with PVA and/or cellulose were assessed against clinically relevant microorganisms, including Gram-positive bacteria ( Enterococcus faecalis Micrococcus luteus Staphylococcus aureus Escherichia coli 16 17 18 Regarding the MG nanoparticles, the antibacterial activity was evaluated using the well diffusion method against a range of bacteria, including Gram-positive species ( Bacillus subtilis Staphylococcus aureus Staphylococcus epidermidis Escherichia coli Pseudomonas aeruginosa Xanthomonas Proteus vulgaris 50 88 89 25 In our study, the inhibition zones generated by the composites against the tested microorganisms are presented in Figure 8 Table S1 (Supplementary Material) Composites with gauze cellulose fibers (CPZ-3 and CPZ-4) and paper cellulose fibers (CZH-3 and CZH-4), respectively, exerted antibacterial activity on both bacteria, with higher inhibition zones being registered against S. aureus Table S1—Supplementary Material E. coli S. aureus 90 E. coli 71 91 57 CPZ-1 and CZH-1 composites inhibited only the growth of S. aureus Focusing on drug release, some studies have examined how pore architecture is influenced by solvent composition. Huang X. and Brazel C.S. [ 92 23 As a result, cryogels with intermediate pore size and limited connectivity were formed, restricting the deep migration of inorganic particle aggregates during synthesis. Consequently, the antimicrobial particles remained concentrated near the surface of the alcohol–water-based composites, thereby enhancing their interaction probability with bacterial cell membranes. 4. Conclusions Composites based on polyvinyl alcohol (PVA) cryogels were developed by reinforcing them with cellulose fibers (from gauze or filter paper) and impregnating them with silver particles and commercial magnetite. Silver particles synthesized with Salvia versus Both PVA cryogelation and the incorporation of inorganic particles increased surface roughness, which enhanced the hydrophobicity of the composites. Among them, CZH-4 showed the highest hydrophobicity. Most of the composites demonstrated stronger antibacterial activity against S. aureus These findings provide a valuable first comparison among the tested composites; however, because the current assays were limited to surface-based screening, they cannot be taken as definitive potency measurements. Future studies will include quantitative analyses—such as MIC, MBC, and time–kill assays—to validate and extend these preliminary observations. To ensure safe application in medical devices (as biocides) and food-contact materials (as packaging), we will also assess cytotoxicity and particle release under physiological conditions. Overall, this composite design represents a versatile and sustainable platform for creating multifunctional materials with tunable properties, offering promising opportunities for healthcare and advanced materials science. Acknowledgments The authors are grateful to Florica Doroftei, Liviu Sacarescu, and Mirela Fernanda Zaltariov, for their contributions to SEM-EDX, TEM and FTIR analysis, respectively. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at https://www.mdpi.com/article/10.3390/polym17182456/s1 a b c e a b c e a b c e a b c d e E. coli S. aureus Author Contributions Conceptualization, A.G.G.; methodology, A.G.G. and V.C.G.; validation, A.G.G., V.C.G. and F.D.L.; formal analysis, I.P., L.M.G., G.M. and S.L.N.; investigation, I.P., L.M.G. and G.M.; writing—original draft preparation, A.G.G.; writing—review and editing, A.G.G., I.P., L.M.G., G.M., F.D.L., S.L.N. and V.C.G.; visualization, A.G.G. and V.C.G.; supervision, A.G.G. All authors have read and agreed to the published version of the manuscript. Data Availability Statement The original contributions presented in this study are included in the article/ Supplementary Material Conflicts of Interest The authors declare no conflicts of interest. References 1. Jeon I.-Y. Baek J.-B. Nanocomposites derived from polymers and inorganic nanoparticles Materials 2010 3 3654 3674 10.3390/ma3063654 2. Hassan C.M. Peppas N.A. Structure and applications of poly(vinyl alcohol) hydrogels produced by conventional crosslinking or by freezing/thawing methods Adv. Polym. Sci. 2000 153 37 65 10.1007/3-540-46414-X_2 3. Lu Y. Foo L.Y. Polyphenolics of Salvia Phytochemistry 2002 59 117 140 10.1016/S0031-9422(01)00415-0 11809447 4. Bozin B. Mimica-Dukic N. Samojlik I. Jovin E. Antimicrobial and antioxidant properties of rosemary and sage ( Rosmarinus officinalis Salvia officinalis Lamiaceae J. Agric. Food Chem. 2007 55 7879 7885 10.1021/jf0715323 17708648 5. Damjanoviae-Vratnica B. Djakov T.A. Šukoviæ D. Damjanoviae J. Chemical composition and antimicrobial activity of essential oil of wild-growing Salvia officinalis J. Essent. Oil Bear. Plants 2008 11 79 89 10.1080/0972060X.2008.10643602 6. Wang Z. Wang Q. Liu C. He F. Song Z. Qiu Q. Yan J. Zhu W. Interaction of polyphenols and Ag on the surface plasmon resonance absorption and resonance Rayleigh scattering spectra Vib. Spectrosc. 2020 107 103037 10.1016/j.vibspec.2020.103037 7. Stephen Z.R. Kievit F.M. Zhang M. Magnetite nanoparticles for medical MR imaging Mater. Today 2011 14 330 338 10.1016/S1369-7021(11)70163-8 PMC3290401 22389583 8. Khalkhali M. Rostamizadeh K. Sadighian S. Khoeini F. Naghibi M. Hamidi M. The impact of polymer coatings on magnetite nanoparticles performance as MRI contrast agents: A comparative study J. Pharm. Sci. 2015 23 45 10.1186/s40199-015-0124-7 PMC4574187 26381740 9. Yin I.X. Zhang J. Zhao I.S. Mei M.L. Li Q. Chu C.H. The antibacterial mechanism of silver nanoparticles and its application in dentistry Int. J. Nanomed. 2020 15 2555 2562 10.2147/IJN.S246764 32368040 PMC7174845 10. Amendola V. Guadagnini A. Agnoli S. Badocco D. Pastore P. Fracasso G. Gerosa M. Vurro F. Busato A. Marzola P. Polymer-coated silver-iron nanoparticles as efficient and biodegradable MRI contrast agents J. Colloid Interface Sci. 2021 596 332 341 10.1016/j.jcis.2021.03.096 33839358 11. Jain N. Jain P. Rajput D. Patil U.K. Green synthesized plant-based silver nanoparticles: Therapeutic prospective for anticancer and antiviral activity Micro Nano Syst. Lett. 2021 9 5 10.1186/s40486-021-00131-6 12. Okaiyeto K. Hoppe H. Okoh A.I. Plant-based synthesis of silver nanoparticles using aqueous leaf extract of Salvia officinalis J. Clust. Sci. 2021 32 101 109 10.1007/s10876-020-01766-y 13. Gharehaghaji N. Divband B. PEGylated magnetite/hydroxyapatite: A green nanocomposite for T2-weighted MRI and curcumin carrying Evid. Based Complement. Alternat. Med. 2022 2022 1337588 10.1155/2022/1337588 35722138 PMC9201731 14. Ihsan S. Gul H. Jamila N. Khan N. Ullah R. Bari A. Nee T.W. Hwang J.H. Masood R. Biogenic Salvia Heliyon 2024 10 e25814 10.1016/j.heliyon.2024.e25814 38375246 PMC10875438 15. Shahzadi S. Fatima S. Ain Q.U. Shafiq Z. Janjua M.R.S.A. A review on green synthesis of silver nanoparticles (SNPs) using plant extracts: A multifaceted approach in photocatalysis, environmental remediation, and biomedicine RSC Adv. 2025 15 3858 10.1039/D4RA07519F 39917042 PMC11800103 16. Errokh A. Magnin A. Putaux J.-L. Boufi S. Hybrid nanocellulose decorated with silver nanoparticles as reinforcing filler with antibacterial properties Mater. Sci. Eng. C Mater. Biol. Appl. 2019 105 110044 10.1016/j.msec.2019.110044 31546437 17. Bag S.S. Bora A. Golder A. Raina K. Haridhasapavalan K.K. Thummer R.P. Gelatin-Pva-Agnps triad composite as wound healing hydrogel with wounded skin surface protective efficiency Res. Sq. 2023 preprint research 10.2139/ssrn.4219683 18. Song S. Liu Z. Abubaker M.A. Ding L. Zhang J. Yang S. Zengjie F. Antibacterial polyvinyl alcohol/bacterial cellulose/nano-silver hydrogels that effectively promote wound healing Mat. Sci. Eng. C 2021 126 112171 10.1016/j.msec.2021.112171 34082972 19. Charti I. Sair S. Rafik O. Abboud Y. El Bouari A. Ecofriendly synthesis of cellulose-silver nanocomposites and the evaluation of their antibacterial activity Discov. Nano 2025 20 59 10.1186/s11671-024-04156-9 40153097 PMC11953487 20. Peppas N.A. Stauffer S.R. Reinforced uncrosslinked poly(vinyl alcohol) gels produced by cyclic freezing–thawing processes: A structural and mechanical study J. Control. Release 1991 16 305 310 10.1016/0168-3659(91)90007-Z 21. Lozinsky V.I. Cryogels on the basis of natural and synthetic polymers: Preparation, properties and applications Russ. Chem. Rev. 2002 71 489 511 10.1070/RC2002v071n06ABEH000720 22. Lozinsky V.I. Damshkaln L.G. Shaskolskii B.L. Babushkina T.A. Kurochkin I.N. Kurochkin I.I. Study of cryostructuring of polymer systems: 27. Physicochemical properties of poly(vinyl alcohol) cryogels and specific features of their macroporous morphology Colloid J. 2007 69 747 764 10.1134/S1061933X07060117 23. Lozinsky V.I. Plieva F.M. Poly(vinyl alcohol) cryogels employed as matrices for cell immobilization. 3. Overview of recent research and developments Enzyme Microb. Technol. 1998 23 227 242 10.1016/S0141-0229(98)00036-2 24. Lozinsky V.I. Damshkaln L.G. Kurochkin I.N. Kurochkin I.I. Cryostructuring of polymeric systems. 36. Poly(vinyl alcohol) cryogels prepared from solutions of the polymer in water/low-molecular alcohol mixtures Eur. Polym. J. 2014 53 189 205 10.1016/j.eurpolymj.2014.01.020 25. Fernandez-Lopez J. Zhi N. Aleson-Carbonell L. Pérez-Alvarez J.A. Kuri V. Antioxidant and antibacterial activities of natural extracts: Application in beef meatballs Meat Sci. 2005 69 371 380 10.1016/j.meatsci.2004.08.004 22062974 26. Grigoras A.G. Grigoras V.C. Eco-friendly silver nanoparticles obtained by green synthesis from Salvia officinalis Sustain. Chem. 2024 5 215 228 10.3390/suschem5030014 27. Daoud S. Alkahtani M.A.M. Alkhalifah D.H.M. Elobeid M.M. Mohammed A.E. Biosynthesis of silver nanoparticles using Salvia officinalis Int. J. Curr. Res. 2019 7 21548 21552 Available online: https://www.journalcra.com/sites/default/files/issue-pdf/11043.pdf (accessed on 1 June 2025) 28. Pop A.V. Tofana M. Socaci S. Varban D. Fogarasi M. Muntean M.-D. Sfechis S. Evaluation of antioxidant activity and phenolic content in different Salvia officinalis Bull. Univ. Agric. Sci. Vet. Med. Cluj-Napoca Food Sci. Technol. 2015 72 210 214 10.15835/buasvmcn-fst:11582 29. Takci D. Ozdenefe M.S. Genc S. Green synthesis of silver nanoparticles with an antibacterial activity using Salvia officinalis J. Cryst. Growth 2023 614 127239 10.1016/j.jcrysgro.2023.127239 30. Mihailović V. Srećković N. Nedić Z.P. Dimitrijević S. Matić M. Obradović A. Selaković D. Rosić G. Katanić Stanković J. Green synthesis of silver nanoparticles using Salvia verticillata Filipendula ulmaria Molecules 2023 28 808 10.3390/molecules28020808 36677866 PMC9861472 31. Biswas A. Aktas O.C. Kanzow J. Saeed U. Strunskus T. Zaporojtchenko V. Faupel F. Polymer-metal optical nanocomposites with tunable particle plasmon resonance prepared by vapor phase co-deposition Mater. Lett. 2004 58 1530 1534 10.1016/j.matlet.2003.10.037 32. Popov A.K. Brummer J. Tanke R.S. Taft G. Loth M. Langlois R. Wruck A. Schmitz R. Synthesis of isolated silver nanoparticles and their aggregates manipulated by light Laser Phys. Lett. 2006 3 546 10.1002/lapl.200610055 33. Movsesyan A. Plasmonic Properties of Metallic Nanoparticles: Beyond the Dipolar Resonance Ph.D. Thesis Universite de Technologie de Troyes Troyes, France 14 December 2018 Available online: https://theses.hal.science/tel-03610410v1 (accessed on 18 July 2025) 34. Chhatre A. Solasa P. Sakle S. Thaokar R. Mehra A. Color and surface plasmon effects in nanoparticle systems: Case of silver nanoparticles prepared by microemulsion route Colloids Surf. A Physicochem. Eng. Asp. 2012 404 83 92 10.1016/j.colsurfa.2012.04.016 35. Sorensen L.K. Khrennikov D.E. Gerasimov V.S. Ershov A.E. Polyutov S.P. Karpov S.V. Ågren H. Nature of the anomalous size dependence of resonance red shifts in ultrafine plasmonic nanoparticles J. Phys. Chem. C 2022 126 16804 16814 10.1021/acs.jpcc.2c03738 36. Szanto G. Pritzke P. Kluitmann J.J. Köhler J.M. Csáki A. Fritzsche W. Csarnovics I. Bonyár A. Optimization of the bulk refractive index sensitivity of silver nanoprisms Adv. Opt. Mater. 2024 12 2302967 10.1002/adom.202302967 37. Loiseau A. Asila V. Boitel-Aullen G. Lam M. Salmain M. Boujday S. Silver-based plasmonic nanoparticles for and their use in biosensing Biosensors 2019 9 78 10.3390/bios9020078 31185689 PMC6627098 38. Hassellöv M. Readman J.W. Ranville J.F. Tiede K. Nanoparticle analysis and characterization methodologies in environmental risk assessment of engineered nanoparticles Ecotoxicology 2008 17 344 361 10.1007/s10646-008-0225-x 18483764 39. Powers K.W. Carpinone P.L. Siebein K.N. Characterization of nanomaterials for toxicological studies Methods Mol. Biol. 2012 926 13 32 10.1007/978-1-62703-002-1_2 22975954 40. Domingos R.F. Baalousha M.A. Ju-Nam Y. Reid M.M. Tufenkji N. Lead J.R. Leppard G.G. Wilkinson K.J. Characterizing manufactured nanoparticles in the environment: Multimethod determination of particle sizes Environ. Sci. Technol. 2009 43 7277 7284 10.1021/es900249m 19848134 41. Mota W.S. Severino P. Kadian V. Rao R. Zielińska A. Silva A.M. Mahant S. Souto E.B. Nanometrology: Particle sizing and influence on the toxicological profile Front. Nanotechnol. 2025 7 1479464 10.3389/fnano.2025.1479464 42. Pabisch S. Feichtenschlager B. Kickelbick G. Peterlik H. Effect of interparticle interactions on size determination of zirconia and silica based systems—A comparison of SAXS, DLS, BET, XRD and TEM Chem. Phys. Lett. 2012 521 91 97 10.1016/j.cplett.2011.11.049 22347721 PMC3280720 43. Kuznetsova E.V. Kuznetsov N.M. Kalinin K.T. Lebedev-Stepanov P.V. Novikov A.A. Chvalun S.N. The role of integrated approach in the determination of nanoparticle sizes in dispersions Colloid J. 2022 84 704 714 10.1134/S1061933X22600348 44. Filippov S.K. Khusnutdinov R. Murmiliuk A. Inam W. Zakharova L.Y. Zhang H. Khutoryanskiy V.V. Dynamic light scattering and transmission electron microscopy in drug delivery: A roadmap for correct characterization of nanoparticles and interpretation of results Mater. Horiz. 2023 10 5354 5370 10.1039/D3MH00717K 37814922 45. Hudzicki J. Kirby-Bauer Disk Diffusion Susceptibility Test Protocol. American Society for Microbiology 2009 Available online: https://asm.org/getattachment/2594ce26-bd44-47f6-8287-0657aa9185ad/kirby-bauer-disk-diffusion-susceptibility-test-protocol-pdf (accessed on 8 August 2025) 46. Kapoor S. Sood H. Saxena S. Chaurasia O.P. Green synthesis of silver nanoparticles using Rhodiola imbricata Withania somnifera Bioprocess Biosyst. Eng. 2022 45 365 380 10.1007/s00449-021-02666-9 34988733 47. Sreckovic N.Z. Nedic Z.P. Monti D.M. D’Elia L. Dimitrijevic S.B. Mihailovic N.R. Katanic Stankovic J.S. Mihailovic V.B. Biosynthesis of silver nanoparticles using Salvia pratensis Molecules 2023 28 1387 10.3390/molecules28031387 36771054 PMC9921037 48. Rodríguez-León E. Iñiguez-Palomares R. Navarro R.E. Herrera-Urbina R. Tánori J. Iñiguez-Palomares C. Maldonado A. Synthesis of silver nanoparticles using reducing agents obtained from natural sources ( Rumex hymenosepalus Nanoscale Res. Lett. 2013 8 318 10.1186/1556-276X-8-318 23841946 PMC3716778 49. De Leersnyder I. Rijckaert H. De Gelder L. Van Driessche I. Vermeir P. High variability in silver particle characteristics, silver concentrations, and production batches of commercially available products indicates the need for a more rigorous approach Nanomaterials 2020 10 1394 10.3390/nano10071394 32708985 PMC7408040 50. Prabhu Y.T. Rao K.V. Kumari B.S. Kumar V.S.S. Pavani T. Synthesis of Fe 3 4 Int. Nano. Lett. 2015 5 85 92 10.1007/s40089-015-0141-z 51. Xie J. Lee J.Y. Wang D.I.C. Ting Y.P. Silver nanoplates: From biological to biomimetic synthesis ACS Nano 2007 1 429 439 10.1021/nn7000883 19206664 52. Paramelle D. Sadovoy A. Gorelik S. Free P. Hobley J. Fernig D.G. A rapid method to estimate the concentration of citrate capped silver nanoparticles from UV-visible light spectra Analyst 2014 139 4855 4861 10.1039/C4AN00978A 25096538 53. Pannerselvam B. Durai P. Thiyagarajan D. Song H.J. Kim K.J. Jung Y.S. Kim H.J. Rangarajulu S.K. Facile synthesis of silver nanoparticles using Asian Spider Processes 2020 8 430 10.3390/pr8040430 54. Razack S.A. Suresh A. Sriram S. Ramakrishnan G. Sadanandham S. Veerasamy M. Nagalamadaka R.B. ·Sahadevan R. Green synthesis of iron oxide nanoparticles using Hibiscus rosa-sinensis SN Appl. Sci. 2020 2 898 10.1007/s42452-020-2477-x 55. Cloutis E.A. McCormack K.A. Bell J.F. III Hendrix A.R. Bailey D.T. Craig M.A. Mertzman S.A. Robinson M.S. Riner M.A. Ultraviolet spectral reflectance properties of common planetary minerals Icarus 2008 197 321 347 10.1016/j.icarus.2008.04.018 56. Rajendran K. Balakrishnan G.S. Kalirajan J. Synthesis of magnetite nanoparticles for arsenic removal from ground water pond Int. J. PharmTech Res. 2015 8 670 677 57. Ma S. Zhan S. Jia Y. Zhou Q. Superior antibacterial activity of Fe 3 4 2 ACS Appl. Mater. Interfaces 2015 7 21875 21883 10.1021/acsami.5b06264 26372171 58. Yang R. Liang B. Han D. Guo Z. Yang C. Yang J. Qiu Y. Li Q. Guo S. Shi J. Synthesis and antibacterial activity of magnetic Fe 3 4 J. Alloys Compd. 2024 973 172849 10.1016/j.jallcom.2023.172849 59. Pastoriza-Santos I. Liz-Marzan L.M. Formation of PVP-protected metal nanoparticles in DMF Langmuir 2002 18 2888 2894 10.1021/la015578g 60. Haes A.J. Stuart D.A. Nie S. Van Duyne R.P. Using solution-phase nanoparticles, surface-confined nanoparticle arrays and single nanoparticles as biological sensing platforms J. Fluoresc. 2004 14 355 367 10.1023/B:JOFL.0000031817.35049.1f 15617378 61. He R. Qian X. Yin J. Zhu Z. Preparation of polychrome silver nanoparticles in different solvents J. Mater. Chem. 2002 12 3783 3786 10.1039/b205214h 62. Liz-Marzán L.M. Tailoring surface plasmons through the morphology and assembly of metal nanoparticles Langmuir 2006 22 32 41 10.1021/la0513353 16378396 63. Antropova I.G. Revina A.A. Oo P.M. Kurakina E.S. Butorova I.A. Magomedbekov E.P. Synthesis of silver nanoparticles using reactive water−ethanol extracts from Murraya paniculata ACS Omega 2021 6 8313 8321 10.1021/acsomega.1c00019 33817491 PMC8015097 64. Lee J.-M. Lim D.-S. Jeon S.-H. Hur D.H. Zeta potentials of magnetite particles and alloy 690 surfaces in alkaline solutions Materials 2020 13 3999 10.3390/ma13183999 32917041 PMC7558357 65. Reddy L.H. Arias J.L. Nicolas J. Couvreur P. Magnetic nanoparticles: Design and characterization, toxicity and biocompatibility, pharmaceutical and biomedical applications Chem. Rev. 2012 112 5818 5878 10.1021/cr300068p 23043508 66. Arias J.L. Reddy L.H. Couvreur P. Magnetoresponsive squalenoyl gemcitabine composite nanoparticles for cancer active targeting Langmuir 2008 24 7512 10.1021/la800547s 18540685 67. Jorge M.J. Nilson M.C. Aracely H.R. Machuca-Martínez F. Data on the removal of metals (Cr 3+ , Cr 6+ , Cd 2+ , Cu 2+ , Ni 2+ , Zn 2+ ) Data Brief 2019 24 103956 10.1016/j.dib.2019.103956 31193134 PMC6517579 68. Singh S. Arya H. Sahu W. Reddy K.S. Nimesh S. Alotaibi B.S. Kumar Bhatt T. Green synthesized silver nanoparticles of Terminalia bellirica Artif. Cells Nanomed. Biotechnol. 2024 52 238 249 10.1080/21691401.2024.2339429 38696111 69. Khane Y. Benouis K. Albukhaty S. Sulaiman G.M. Abomughaid M.M. Al Ali A. Aouf D. Fenniche F. Khane S. Chaibi W. Green synthesis of silver nanoparticles using aqueous Citrus limon Nanomaterials 2022 12 2013 10.3390/nano12122013 35745352 PMC9227472 70. Shanwaz M.M. Shyam P. Synthesis of Silver nanoparticles from Vitex negundo Lett. Appl. NanoBioSci. 2023 12 59 10.33263/LIANBS122.059 71. Dabagh S. Haris S.A. Isfahani B.K. Ertas Y.N. Silver-decorated and silica-capped magnetite nanoparticles with effective antibacterial activity and reusability ACS Appl. Bio Mater. 2023 6 2266 2276 10.1021/acsabm.3c00122 37273221 PMC10283023 72. Shameli K. Ahmad M.B. Jazayeri S.D. Sedaghat S. Shabanzadeh P. Jahangirian H. Mahdavi M. Abdollahi Y. Synthesis and characterization of polyethylene glycol mediated silver nanoparticles by the green method Int. J. Mol. Sci. 2012 13 6639 6650 10.3390/ijms13066639 22837654 PMC3397486 73. Bandoniene D. Venskutonis P. Gruzdiene D. Murkovic M. Antioxidative activity of Sage ( Salvia officinalis Satureja hortensis Borago officinalis Eur. J. Lipid Sci. Technol. 2002 104 286 292 10.1002/1438-9312(200205)104:5&#x0003c;286::AID-EJLT286&#x0003e;3.0.CO;2-O 74. Zaguła G. Fabisiak A. Bajcar M. Czernicka M. Saletnik B. Puchalski C. Mineral components analysis of selected dried herbs EconTechMod—Int. Q. J. 2016 5 127 132 75. Mot M.-D. Gavrilaș S. Lupitu A.I. Moisa C. Chambre D. Tit D.M. Bogdan M.A. Bodescu A.-M. Copolovici L. Copolovici D.M. Salvia officinalis Antioxidants 2022 11 808 10.3390/antiox11050808 35624672 PMC9137537 76. Koçak M.Z. Karadağ M. Çelikcan F. Essential oil composition of Salvia officinalis Rosmarinus officinalis J. Agric. 2021 4 39 47 10.46876/ja.938170 77. Gogoasa I. Jurca V. Alda L.M. Velciov A. Rada M. Alda S. Sirbulescu C. Bordean D.M. Gergen I. Mineral content of some medicinal herbs J. Hort. Forest. Biotechnol. 2013 17 65 67 Available online: https://www.usab-tm.ro/Journal-HFB/2013/Lista%20Lucrari%20PDF/Lucrari%20Vol%2017(4)%20PDF/14.pdf (accessed on 5 August 2025) 78. Zhang M. Chu L. Chen J. Qi F. Li X. Chen X. Yu D.-G. Asymmetric wettability fibrous membranes: Preparation and biologic applications Compos. Part B 2024 269 111095 10.1016/j.compositesb.2023.111095 79. Sun L. Guo J. Chen H. Zhang D. Shang L. Zhang B. Zhao Y. Tailoring materials with specific wettability in biomedical engineering Adv. Sci. 2021 8 2100126 10.1002/advs.202100126 34369090 PMC8498887 80. Erbil Y. Contact angle of liquid drops on solids Surface Chemistry of Solid and Liquid Interfaces Erbil Y. Blackwell Publishing Ltd. Oxford, UK 2006 308 334 81. Kumar R. Sahani A.K. Role of superhydrophobic coatings in biomedical applications Mater. Today Proc. 2021 45 5655 5659 10.1016/j.matpr.2021.02.457 82. Zhong Y. Lin Q. Yu H. Shao L. Cui X. Pang Q. Zhu Y. Hou R. Construction methods and biomedical applications of PVA-based hydrogels Front. Chem. 2024 12 1376799 10.3389/fchem.2024.1376799 38435666 PMC10905748 83. Ahmad D. van den Boogaert I. Miller J. Presswell R. Jouhara H. Hydrophilic and hydrophobic materials and their applications Energy Sources Part A 2018 40 2686 2725 10.1080/15567036.2018.1511642 84. Manoudis P.N. Karapanagiotis I. Modification of the wettability of polymer surfaces using nanoparticles Prog. Org. Coat. 2014 77 331 338 10.1016/j.porgcoat.2013.10.007 85. Dubey P. Matai I. Kumar S.U. Sachdev A. Bhushan B. Gopinath P. Perturbation of cellular mechanistic system by silver nanoparticle toxicity: Cytotoxic, genotoxic and epigenetic potentials Adv. Colloid Interface Sci. 2015 221 4 21 10.1016/j.cis.2015.02.007 25935324 86. Wang L. Hu C. Shao L. The antimicrobial activity of nanoparticles: Present situation and prospects for the future Int. J. Nanomed. 2017 12 1227 1249 10.2147/IJN.S121956 28243086 PMC5317269 87. Girma A. Abera B. Mekuye B. Mebratie G. Antibacterial activity and mechanisms of action of inorganic nanoparticles against foodborne bacterial pathogens: A systematic review IET Nanobiotechnol. 2024 2024 5417924 10.1049/2024/5417924 38863967 PMC11095078 88. Taylor E.N. Webster T.J. The use of superparamagnetic nanoparticles for prosthetic biofilm Int. J. Nanomed. 2009 4 145 152 10.2147/ijn.s5976 19774113 PMC2747349 89. Bahari A. Roeinfard M. Ramzannezhad A. Khodabakhshi M. Mohseni M. Nanostructured features and antimicrobial properties of Fe 3 4 Natl. Acad. Sci. Lett. 2019 42 9 12 10.1007/s40009-018-0666-6 90. Maher C. Hassan K.A. The Gram-negative permeability barrier: Tipping the balance of the in and the out mBio 2023 14 e01205-23 10.1128/mbio.01205-23 37861328 PMC10746187 91. Dalrymple O.K. Stefanakos E. Trotz M.A. Goswami D.Y. A review of the mechanisms and modeling of photocatalytic disinfection Appl. Catal. B Environ. 2010 98 27 38 10.1016/j.apcatb.2010.05.001 92. Huang X. Brazel C.S. On the importance and mechanisms of burst release in matrix-controlled drug delivery systems J. Control. Release 2001 73 121 136 10.1016/S0168-3659(01)00248-6 11516493 Figure 1 TEM micrographs (scale of 200 nm) and size distribution histograms of A-type AgPs dried from water ( a e b f c g d h Figure 2 EDX Spectra of A-type AgPs ( a b c Figure 3 SEM micrographs (scale of 500 nm) of dried samples: A-type AgPs ( a b c d g Figure 4 UV-Vis spectra of plant extract, silver nitrate, and AgPs. Figure 5 UV-Vis spectra of AgPs, MG, and their mixtures in water ( a b c d Figure 6 Size distribution of the MG, AgPs and their mixture in water ( a c d f Figure 7 SEM micrographs (scale of 10 μm) of CPZ-M ( a b c f g j Figure 8 Photographs of the effect of composites against E. coli S. aureus a E. coli b S. aureus c f g j polymers-17-02456-t001_Table 1 Table 1 Composition of PVA-cellulose composites containing inorganic particles. Composite Cellulose Support Dispersant for A-Type B-Type MG PVA aq. sol. CPZ-1 medical gauze H 2 x  x x CPZ-2 H 2  x x x CPZ-3 EtOH x  x x CPZ-4 EtOH  x x x CZH-1 filter paper H 2 x  x x CZH-2 H 2  x x x CZH-3 EtOH x  x x CZH-4 EtOH  x x x polymers-17-02456-t002_Table 2 Table 2 Elemental Composition (weight percentage, %) at the Surface of Inorganic Particles.   Sample  A-Type AgPs  B-Type AgPs  MG  Elements  C (K) 22.03 19.28 - O (K) 13.27 13.63 18.82 Ag (L) 64.69 67.08 - Fe (K) - - 81.17 polymers-17-02456-t003_Table 3 Table 3 DLS and ZP data for AgPs (A or B), magnetite (MG) and their mixtures (MIX) in water or ethanol. Sample Solvent Z-Average Diameter PdI ZP MG H 2 450 ± 26 0.55 ± 0.05 −21.8 ± 0.3 A-type AgPs 224 ± 4 0.37 ± 0.01 −25.3 ± 0.7 B-type AgPs 287 ± 19 0.50 ± 0.08 −20.7 ± 0.9 MIX 1 (A-type AgPs+MG) 105 ± 0.87 0.37 ± 0.01 −28.3 ± 1.1 MIX 2 (B-type AgPs+MG) 132 ± 1.77 0.48 ± 0.30 −26.8 ± 2.3 MG EtOH 1451 ± 110 0.93 ± 0.07 +17.8 ± 0.4 A-type AgPs 2513 ± 130 0.31 ± 0.04 −2.0 ± 0.4 B-type AgPs 3051 ± 175 0.40 ± 0.06 −1.9 ± 0.3 MIX 3 (A-type AgPs+MG) 1116 ± 107 0.40 ± 0.05 −17.2 ± 2.2 MIX 4 (B-type AgPs+MG) 782 ± 78 0.65 ± 0.01 −21.1 ± 0.4 polymers-17-02456-t004_Table 4 Table 4 FTIR specific bands (cm −1 MG AgNPs A-Type B-Type A-Type B-Type   839 838 841         800–700 803 805 808 799 801 804 793 795 802 802      723 723 720   723 724      692 690 678   701   650–550 658    656  654 654 667     639 635          621 619 621 617  620 623 625 624 623       604      540–500  573   584  590   575 586    569 569 556 562 562     500–480 500–400 451 457 457 453 453 452   450 450         432 432      417 419       420      400 400        396     392  396 396 395     381        Notes polymers-17-02456-t005_Table 5 Table 5 Contact angle values of CPZ and CZH composites and their control samples. Sample Contact Angle (θ ° CPZ-M 111.86 ± 1.26 CPZ-1 104.75 ± 0.36 CPZ-2 112.56 ± 0.36 CPZ-3 111.40 ± 0.68 CPZ-4 115.88 ± 0.28 CZH-M 91.33 ± 1.09 CZH-1 98.42 ± 1.03 CZH-2 106.36 ± 0.99 CZH-3 116.14 ± 0.40 CZH-4 117.51 ± 0.14 Note t p ",
  "metadata": {
    "Title of this paper": "On the importance and mechanisms of burst release in matrix-controlled drug delivery systems",
    "Journal it was published in:": "Polymers",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473284/"
  }
}