{
  "title": "Paper_1146",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469749 PMC12469749.1 12469749 12469749 41009395 10.3390/ijms26188828 ijms-26-08828 1 Review Claspin and Cancer: Where Are We Now? https://orcid.org/0000-0002-2612-9975 Azenha Diana 1 Martins Teresa C. 2 3 * Giordano Antonio Academic Editor Alfano Luigi Academic Editor 1 2 3 * tmartins@ipocoimbra.min-saude.pt 10 9 2025 9 2025 26 18 497349 8828 31 7 2025 04 9 2025 08 9 2025 10 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Cancer cells arise from the cumulative acquisition of genetic and epigenetic alterations that affect vital cellular functions. Genomic instability results from deficiencies in protective mechanisms, such as cell cycle checkpoints, DNA replication control, or DNA repair. Claspin integrates a group of crucial proteins that maintain genome integrity. It participates in key cellular events such as DNA damage checkpoint activation, DNA replication, replication stress responses, DNA repair, epigenetic memory, and apoptosis. Given its crucial functions, a role for Claspin in cancer is not a surprise. Indeed, there is a considerable body of evidence linking Claspin deregulation with cancer. For instance, over-expression of Claspin and Tim promoted the survival of cancer cells by enabling adaptation to oncogene-induced replication stress. In addition, Claspin gene ( CLSPN Claspin cancer replication stress cancer therapy This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Cancer is one of the most common causes of mortality worldwide. Cancer is generally characterized by specific hallmarks that drive cancer development and progression, including sustained and uncontrolled proliferation, evasion of growth suppression, cell death resistance, angiogenesis, invasion and metastasis, replicative immortality, deregulated cellular metabolism, subversion of inflammatory cells, and immune evasion [ 1 2 3 1 2 4 5 6 7 8 9 10 11 2. Claspin Claspin was first identified during cell cycle checkpoint regulation experiments as a crucial protein for Xenopus 5 5 12 13 CLSPN − /− 14 15 16 17 18 Claspin participates in several key cellular functions that are usually altered in cancer ( Figure 1 Figure 1 19 20 21 9 22 Figure 1 10 Figure 1 5 13 23 24 25 Figure 1 Figure 1 7 8 Figure 1 26 27 28 Figure 1 2 Figure 1 11 Due to the importance of its functions in cell homeostasis, Claspin expression must be tightly regulated. Similar to other crucial proteins, such as p53, Claspin is an unstable protein, whose expression is regulated at the transcriptional, post-transcriptional, and post-translational levels. Claspin expression oscillates throughout the cell cycle, being nearly absent in G0/G1, peaking at S/G2, and declining abruptly at the onset of mitosis [ 5 13 26 27 28 29 30 31 32 33 34 2.1. Claspin and the DNA Damage Response The integrity of the cell’s genetic information is constantly challenged by exogenous and endogenous threats. To ensure that genetic information is faithfully transmitted during cell division, cells have developed highly complex defense mechanisms capable of detecting and dealing with a plethora of DNA lesions, which are collectively known as the DNA damage response (DDR). The DDR is triggered whenever a DNA lesion is detected by sensor proteins. The danger signal is then transmitted to effector proteins by transducer proteins through the action of mediator or adaptor proteins that function as bridges and/or scaffolds that promote protein–protein interactions and proper checkpoint activation. Effector proteins then act on specific substrates, either inducing cell cycle arrest, providing the cell time to activate downstream repair actions and resume the cell cycle, or, if the damage is irreparable, cell death, to preserve genome integrity [ 5 35 36 The ATR–Chk1 pathway is activated predominantly in response to single-strand breaks (SSBs) and DNA lesions arising from RS, although it can also be activated by double-strand breaks (DSBs). RPA has a high affinity for ssDNA stretches arising from genotoxic stress or RS, stabilizing them and preventing further breakage. The RPA-ssDNA conjugate constitutes the trigger for the DDR response and ensures the recruitment of ATR-activating proteins to the site of damage [ 36 37 37 Figure 1 36 38 12 37 12 37 39 40 41 42 42 12 6 Claspin also seems to play a role in bridging the ATR-Chk1 cell cycle checkpoint with DNA damage repair pathways ( Figure 1 43 44 45 41 46 24 25 23 When the cell is unable to repair DNA damage, or the cell cycle arrest is too prolonged, the checkpoint response must be terminated, and the cell induced to die by apoptosis. Claspin seems to act as a brake against apoptosis in cells with DNA damage or replication blocks. However, when DNA damage is too extensive, this brake must be relieved, and the cell induced to die. Brake release is dependent on Claspin degradation ( Figure 1 7 8 7 8 8 Figure 1 26 28 26 27 Figure 1 47 Xenopus 48 2.2. Claspin’s Role in DNA Replication and Replication Stress Claspin’s role in DNA replication is well established, although not fully understood (for more details, refer to [ 43 49 20 21 50 51 52 5 51 52 50 51 53 54 55 22 52 55 55 Claspin is a component of the replication fork protection complex (FPC), along with Tim, Tipin, and And-1 ( Figure 1 10 20 51 56 57 58 59 60 61 62 63 64 59 DNA replication must be coordinated with the duplication of chromatin structures to guarantee faithful transmission of specialized states of chromatin onto daughter cells [ 11 Figure 1 11 RS occurs whenever replication is blocked or perturbed. RS sources include unrepaired DNA lesions, repeated sequences that may form secondary structures (e.g., hairpins, triplets), and replication and transcription machinery collisions, among others. RS usually results in ssDNA stretches that are coated with RPA, triggering an RS response led by the ATR–Claspin–Chk1 pathway [ 65 38 66 67 68 68 66 66 67 68 67 RS may also arise when the timing of replication, which is usually defined in early G1, is altered due to oncogene activation, which induces firing of replication origins in genes with high transcription rates. Claspin is also involved in an evolutionary conserved genome defense mechanism mediated by p38 that operates during the S-phase [ 69 69 69 3. Claspin and Cancer As Claspin has a role in several processes involved in the maintenance of genome integrity and the promotion of successful and uneventful cell division, it is plausible that it may have a role in cancer development. In 2017 and 2019 [ 6 43 70 71 72 73 74 75 71 71 Claspin was also implicated in Epstein-Barr Virus (EBV) infection, which is associated with B-cell lymphoproliferative diseases or lymphomas. Like HPV, the success of infection depends on bypassing checkpoint responses. EBV mobilizes host STAT3, a transcription activator implicated in the induction of proliferative and anti-apoptotic genes, to relax the ongoing checkpoint response activated in B cells by infection [ 70 70 72 26 72 Together, these data suggest that Claspin inactivation is an important event in carcinogenesis, and that Claspin may act as a tumor suppressor. Indeed, a Claspin-dependent, but ATM/ATR-independent, checkpoint response was shown to be lost during colorectal carcinogenesis [ 76 77 40 41 78 79 CLSPN 14 80 CLSPN 81 82 83 84 85 86 81 83 84 82 85 82 85 CLSPN CLSPN 86 CLSPN CLSPN 81 81 51 87 CLSPN 81 CLSPN CLSPN 88 89 CLSPN 69 CLSPN 90 11 Reduced Claspin expression seems to promote initiation of tumorigenesis through deficient oncogene-induced DDR and increased genomic instability [ 12 85 CLSPN CLSPN CLSPN CLSPN 12 80 CLSPN 12 80 80 CLSPN 91 92 11 2 Nevertheless, there is also data that argues against a protective role for Claspin in cancer. Increased Claspin expression has been detected in a variety of cancer samples and cell lines and was associated with reduced patient survival. For instance, Benevolo and colleagues [ 93 94 95 96 95 97 CLSPN 98 99 100 101 99 100 100 99 CLSPN CLSPN 102 CLSPN 103 CLSPN 102 Simian virus 40 (SV40) infection is associated with human primary brain tumors, malignant mesotheliomas, bone cancer, and non-Hodgkin’s lymphoma. The Large T antigen (LT) is a key mediator of the SV40 infection. The SV40 LT oncoprotein acts on the host cell machinery to create a permissive environment for viral genome replication. Although several oncogenic viruses act through DDR inactivation, others, such as SV40, take advantage of it. Indeed, SV40 LT activates both ATR- and ATM-mediated checkpoints, in part through interaction with Bub1, a mitotic spindle checkpoint kinase [ 104 104 105 Altogether, these data suggest that Claspin may instead act as an oncogene. So, where do these data leave us? 3.1. Claspin: Tumor Suppressor or Oncogene? The importance of Claspin in cell homeostasis and its potential role in carcinogenesis is well established. The discussion now revolves around its role in cancer development: there are data that suggest a role as a tumor suppressor, as well as data pointing in the opposite direction—that of an oncogene. It is important to point out that the majority of the studies available so far are mostly based on the analysis of Claspin expression and are correlational studies. Little experimental research is available. One of the ways the above-described contradictory findings may be explained is based on the cellular context. As mentioned, Claspin expression is correlated with different outcomes in tumors from distinct cell origins. Experimental data have also shown that CLSPN CLSPN 81 TP53 TP53 CLSPN 80 TP53 106 107 108 Another possible, and the most plausible, explanation regards the possibility of Claspin assuming different roles in different stages of oncogenesis ( Figure 2 89 97 Figure 2 94 109 110 1 100 94 Figure 2 1 110 111 Figure 2 70 94 112 113 114 115 116 104 105 94 Thus, Claspin may assume different roles in different stages of oncogenesis. Indeed, Claspin expression may vary in different phases of tumor development. Benevolo and colleagues [ 93 71 93 95 96 101 Figure 2 94 110 94 110 108 108 116 13 Claspin over-expression not only guarantees the availability of FPC to stabilize and restart stalled replication forks and allow DNA replication and cell division, but also permits tumor cells that can activate Chk1-mediated checkpoint responses ( Figure 2 94 109 110 7 8 95 99 Several studies associate Claspin expression in the tumor with increased cancer cell proliferation and tumor progression, namely migration, invasion, and metastasis formation. CLSPN 95 99 100 100 7 8 47 Figure 2 Claspin has been shown to have a significant role in survival and in stress coping pathways. Claspin may be stabilized in cancer cells as a mechanism to cope with the increased instability and a stressful tumor microenvironment. For instance, EGFR, a tyrosine kinase receptor commonly upregulated and mutated in cancer, triggers an oncogenic pathway that fosters cancer cell survival and proliferation, through the activation of the PI3K/Akt and RAS–MAPK–Erk signaling pathways, respectively [ 117 95 CLSPN 95 99 118 118 119 Recently, research has focused on CLSPN 120 CLSPN 121 Claspin has an important role in DNA replication both in unperturbed cells and during replication stress. It has been argued that, as tumor cells are usually under RS due to oncogene activation, the higher levels of Claspin observed in higher-grade lesions could simply reflect their higher proliferative rates as described for Ki-67 [ 6 88 93 122 18 123 12 89 122 94 94 94 Figure 2 94 Another cause for discrepancies amongst Claspin expression data can be attributed to the fact that most of the studies only focused the detection of Claspin expression on a given moment and its correlation with prognosis or other clinical parameters. The results of those studies constitute a one-moment portrait of Claspin expression, ignoring the evolutionary mutational landscape of the tumor. The correlation of Claspin expression with clinical parameters at that moment fails to fully explain Claspin’s role in the tumor pathophysiology and does not prove a causative role for Claspin in the clinical parameters studied. For instance, Jia and colleagues [ 98 + 98 97 hi 124 11 Figure 2 As most of the studies have only provided correlational observations, no definite conclusions can be drawn, and no hypothesis can be discarded. Thus, the possibility that Claspin over-expression in cancer can reflect oncogenic activity also has to be considered. There is evidence that genes that usually behave as tumor suppressors can sometimes acquire oncogenic activity [ 125 126 125 126 127 TP53 TP53 127 127 128 129 CLSPN 81 3.2. Claspin and Response to Therapy Cancer cells are characterized by uncontrolled proliferation and RS. To overcome the outcomes of deficient control of DNA replication, tumor cells often inactivate components of the DNA damage response (DDR), while becoming more dependent on others, particularly those involved in the maintenance of replication fork integrity. These dependencies may constitute vulnerabilities that can be exploited in cancer treatment [ 65 123 130 + 131 131 65 Mounting evidence places Claspin as a central component in acquired radio- [ 132 133 69 99 119 134 Figure 3 135 132 132 133 Figure 3 133 135 133 133 Cancer therapy using cytotoxic agents is widely used in the clinic. Claspin expression was also associated with resistance to chemotherapy in several cancers ( Figure 3 136 99 134 Figure 3 134 137 138 Figure 3 137 69 Figure 3 69 69 120 134 Although in all the above-described situations Claspin over-expression was not the direct cause of resistance to therapy but resulted from the upstream aberrant activation of proteins that are able to interfere with Claspin’s half-life, interfering with Claspin expression determined cell fate in all these settings. Therefore, Claspin may constitute an attractive therapeutic target for chemo- and radio-sensitization [ 43 In triple-negative breast cancer, increased GSK3-β expression is associated with a worse prognosis. GSK3-β activation also interferes with Claspin stabilization [ 139 139 140 141 141 46 43 141 Although Claspin is an essential gene for the maintenance of cell viability and homeostasis, the use of Claspin inhibitors may still be viable and achievable without too much (or acceptable) toxicity to healthy cells due to the intrinsic features of cancer cells that are absent in healthy ones [ 65 Although much research is still needed, Claspin is now viewed as an attractive therapeutic target, and much research is ongoing to validate it as such. Further research is needed in order to translate this knowledge into therapeutic tools. However, as Claspin biological behavior is uncovered, Claspin-centered therapies appear to become a gradually closer reality. 4. Final Thoughts and Perspectives There are many routes to cancer. During oncogenesis, tumor cells accumulate a series of changes (genetic, epigenetic, post-transcriptional, and post-translational) that ultimately result in the acquisition of a set of “new” biologic abilities: sustained proliferation, resistance to growth inhibitors, apoptosis resistance and increased survival, immortality, angiogenesis, invasion, and metastasis formation. Different tumors acquire given abilities at different timings during oncogenesis, and the order of ability acquisition is also variable between tumors. A well-established enabling feature that promotes tumor development is genome instability, which is crucial for the inactivation of tumor suppressor genes and the activation of oncogenes. Genome instability is particularly important in the early stages of oncogenesis. Healthy cells have developed several mechanisms to maintain genome integrity, namely monitoring of DNA replication and quality, and the presence of replication errors, and through the existence of checkpoints during the cell cycle, when the quality of DNA is checked before and after replication, and when the cell verifies if DNA replication has been completed. When problems are found, these checkpoints are activated and the cell cycle arrested, so that the cell has time to attempt to repair DNA or deal with other problems through localized responses. If the damage is too extensive or irreparable, the cell is then induced to die through apoptosis. Successful tumor cells must overcome these genome protection barriers. Figure 4 6 117 118 71 CLSPN 81 70 80 11 However, as tumors accumulate changes and oncogenes are activated, in more advanced stages of oncogenesis, Claspin-mediated pathways may conversely promote tumor progression, as they may help to foster tumor cell addiction to checkpoint kinase signaling, which is required for the prevention of further genome instability and for promoting cancer cell survival. In line with this, it has been observed that oncogene activation (e.g., EGFR, HER2, PI3K/Akt) promotes Claspin stabilization and expression [ 95 99 117 97 98 CLSPN 81 As described and discussed above, there are data correlating Claspin expression with both better and worse prognosis, and other clinical parameters, in different types of cancer. As already highlighted, different tumors follow different routes to cancer. Their mutational landscape will be different, and the sequence of events and ability acquisition of tumor cells will also be distinct. In addition, distinct tumors become addicted to different oncogene-induced pathways and will inactivate distinct tumor suppressor genes and respective tumor suppressive mechanisms. These differences may explain the apparently opposing correlational findings regarding Claspin expression and clinical outcomes. This was clearly demonstrated for breast cancer, in which low Claspin expression was correlated with a worse overall survival but only when tumor cells concomitantly presented p53 inactivation (apoptosis resistance) or HER2 over-expression (increased proliferation and survival signals; resistance to apoptosis induction), the opposite being observed in cells with wt TP53 80 94 There are also important data regarding the role of Claspin in the response to treatment. Generally, it was observed that several pathways involved in tumor resistance to either chemo- or radiation therapy involved downstream stabilization and sustained expression of Claspin [ 69 99 124 132 133 134 43 TP53 5. Conclusions In conclusion, current data clearly highlight a role for Claspin in cancer. In early stages, Claspin activation may counteract tumor development, constituting an important barrier that cancer cells must overcome. However, as oncogenesis progresses and replication stress (RS) increases, cancer cells may start to exploit the RS response, in which Claspin plays a pivotal role. Being a hub onto which several therapy-resistance pathways converge, Claspin constitutes an attractive target for radio- and chemo-sensitization. Disclaimer/Publisher’s Note: Author Contributions Writing—original draft preparation, D.A. and T.C.M.; writing—review and editing, T.C.M. All authors have read and agreed to the published version of the manuscript. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: AKT AK strain transforming ALDH Aldehyde dehydrogenase APC Anaphase promoting complex ATM Ataxia telangiectasia mutated ATR Ataxia telangiectasia and Rad3-related protein ATRIP ATR interacting protein BARD1 BRCA1-Associated RING Domain 1 BRCA1 Breast Cancer gene 1 Bub1 Budding uninhibited by benzimidazoles 1 Cdc Cell division cycle Cdh1 Cdc20 homolog 1 CDKs Cyclin-dependent kinases Chk1/2 Checkpoint kinase 1/2 CK1γ1 Casein kinase 1 gamma 1 DDB Damaged DNA binding protein EGFR Epidermal Growth Factor Receptor ERK Extracellular signal-regulated kinase ETAA1 Ewing’s tumor-associated antigen 1 FANC Fanconi FANCD2 Fanconi Anemia Complementation Group D2 GSK3-β Glycogen Synthase Kinase 3-beta HER2 Human Epidermal Growth Factor Receptor 2 HNF-1β hepatocyte nuclear factor 1-beta Ki67 Antigen Kiel 67 MAPK Mitogen-activated protein kinases MCM Mini-chromosome maintenance MSH6 MutS homolog 6 mTOR Mammalian target of Rapamycin OZF Only Zinc-Finger PCNA Proliferating cell nuclear antigen PDK1 Phosphoinositide-dependent kinase 1 PD-L1 Programmed death ligand 1 PI3K Phosphoinositide 3-kinase PMS2 Postmeiotic segregation increased 2 Pol/POL Polymerases pRb Retinoblastoma protein RAD51 DNA repair protein Ras Rat sarcoma oncogene RFC Replication Factor C RPA Replication protein A SCFβTrCP Skp1-Cullin-F-box-protein ubiquitin ligase complex SLF2 SMC5-SMC6 Complex Localization Factor 2 STAT3 Signal transducer and activator of transcription 3 Tim Timeless TOPBP1 Topoisomerase II binding protein 1 TRIM21 Tripartite motif protein 21 USP Ubiquitin-specific proteases 3′-UTR 3′-untranslated region XPC Xeroderma pigmentosum protein C References 1. Hanahan D. Weinberg R.A. Hallmarks of cancer: The next generation Cell 2011 144 646 674 10.1016/j.cell.2011.02.013 21376230 2. Hanahan D. Hallmarks of cancer: New dimensions Cancer Discov. 2022 12 31 46 10.1158/2159-8290.CD-21-1059 35022204 3. Jones R.M. Petermann E. Replication fork dynamics and the DNA damage response Biochem. J. 2012 443 13 26 10.1042/BJ20112100 22417748 4. Atemin A. Ivanona A. Kanev P.-B. Uzunova S. Nedelcheva-Veleva M. Stoynov S. Dynamics of replication-associated protein levels through the cell cycle Int. J. Mol. Sci. 2024 25 8230 10.3390/ijms25158230 39125800 PMC11311332 5. Kumagai A. Dunphy W.G. Claspin, a novel protein required for the activation of Chk1 during a DNA replication checkpoint response in Xenopus Mol. Cell 2000 6 839 849 10.1016/S1097-2765(05)00092-4 11090622 6. Azenha D. Lopes M.C. Martins T.C. Claspin functions in cell homeostasis—A link to cancer? DNA Repair 2017 59 27 33 10.1016/j.dnarep.2017.09.002 28942358 7. Clarke C.A. Bennett L.N. Clarke P.R. Cleavage of claspin by caspase-7 during apoptosis inhibits the Chk1 pathway J. Biol. Chem. 2005 280 35337 35345 10.1074/jbc.M506460200 16123041 8. Semple J.I. Smits V.A. Fernaud J.R. Mamely I. Freire R. Cleavage and degradation of Claspin during apoptosis by caspases and the proteasome Cell Death Differ. 2007 14 1433 1442 10.1038/sj.cdd.4402134 17431426 9. Masai H. Yang C.C. Matsumoto S. Mrc1/Claspin: A new role for regulation of origin firing Curr. Genet. 2017 63 813 818 10.1007/s00294-017-0690-y 28357499 10. Smith-Roe S.L. Patel S.S. Zhou Y. Simpson D.A. Rao S. Ibrahim Cordeiro-Stone M. Kaufmann W.K. Separation of intra-S checkpoint protein contributions to DNA replication fork protection and genomic stability in normal human fibroblasts Cell Cycle 2013 12 332 345 10.4161/cc.23177 23255133 PMC3575462 11. Charlton S.J. Flury V. Kanoh Y. Genzor A.V. Kollenstart L. Ao W. Brogger P. Weisser M.B. Adamus M. Alcaraz N. The fork protection complex promotes parental histone recycling and epigenetic memory Cell 2024 187 5029 5047 10.1016/j.cell.2024.07.017 39094569 PMC11383432 12. Smits V.A. Gillespie D.A. DNA damage control: Regulation and functions of checkpoint kinase 1 FEBS J. 2015 282 3681 3692 10.1111/febs.13387 26216057 13. Chini C.C. Chen J. Human claspin is required for replication checkpoint control J. Biol. Chem. 2003 278 30057 30062 10.1074/jbc.M301136200 12766152 14. Madgwick S. Luli S. Sellier H. Butterworth J.A. Leslie J. Moore A.J. Corbin E.K. Yemm A.I. Chiremba R.T. Tiniakos D. Claspin haploinsufficiency leads to defects in fertility, hyperplasia and an increased oncogenic potential Biochem. J. 2022 479 2115 2130 10.1042/BCJ20220101 36240068 PMC9704638 15. Deng C.-X. Xu X. Generation and analysis of Brca1 conditional knockout mice Methods Mol. Biol. 2004 280 185 200 10.1385/1-59259-788-2:185 15187254 16. Dine J. Deng C.-X. Mouse models of BRCA1 and their application to breast cancer research Cancer Metastasis Rev. 2013 32 25 37 10.1007/s10555-012-9403-7 23093327 17. Liu Q. Guntuku S. Cui X.S. Matsuoka S. Cortez D. Tamai K. Luo G. Carattini-Rivera S. DeMayo F. Bradley A. Chk1 is an essential kinase that is regulated by Atr and required for the G(2)/M DNA damage checkpoint Genes Dev. 2000 14 1448 1459 10.1101/gad.14.12.1448 10859164 PMC316686 18. Takai H. Tominaga K. Motoyama N. Minamishima Y.A. Nagahama H. Tsukiyama T. Ikeda K. Nakayama K. Nakanishi M. Nakayama K. Aberrant cell cycle checkpoint function and early embryonic death in Chk1(−/−) mice Genes Dev. 2000 14 1439 1447 10.1101/gad.14.12.1439 10859163 PMC316691 19. Aze A. Zhou J.C. Costa A. Costanzo V. DNA replication and homologous recombination factors: Acting together to maintain genome stability Chromosoma 2013 122 401 413 10.1007/s00412-013-0411-3 23584157 20. Jones M.L. Baris Y. Taylor M.R.G. Yeeles J.T.P. Structure of a human replisome shows the organization and interactions of a DNA replication machine Embo J. 2021 40 e108819 10.15252/embj.2021108819 34694004 PMC8634136 21. Pellegrini L. The CMG DNA helicase and the core replisome Curr. Opin. Struct. Biol. 2023 81 102612 10.1016/j.sbi.2023.102612 37244171 22. Petermann E. Helleday T. Caldecott K.W. Claspin promotes normal replication fork rates in human cells Mol. Biol. Cell 2008 19 2373 2378 10.1091/mbc.e07-10-1035 18353973 PMC2397295 23. Guervilly J.H. Mace-Aime G. Rosselli F. Loss of CHK1 function impedes DNA damage-induced FANCD2 monoubiquitination but normalizes the abnormal G2 arrest in Fanconi anemia Hum. Mol. Genet. 2008 17 679 689 10.1093/hmg/ddm340 18029388 24. Liu Y. Fang Y. Shao H. Lindsey-Boltz L. Sancar A. Modrich P. Interactions of human mismatch repair proteins MutSα and MutLα with proteins of the ATR-Chk1 pathway J. Biol. Chem. 2010 285 5974 5982 10.1074/jbc.M109.076109 20029092 PMC2820822 25. Prætorius-Ibba M. Wang Q.-E. Wani G. El-Mahdy M.A. Zhu Q. Qin S. Wani A.A. Role of Claspin in regulation of nucleotide excision repair factor DDB2 DNA Repair 2007 6 578 587 10.1016/j.dnarep.2006.11.009 17196446 26. Mailand N. Bekker-Jensen S. Bartek J. Lukas J. Destruction of claspin by SCFβTrCP restrains Chk1 activation and facilitates recovery from genotoxic stress Mol. Cell 2006 23 307 318 10.1016/j.molcel.2006.06.016 16885021 27. Mamely I. van Vugt M.A. Smits V.A. Semple J.I. Lemmens B. Perrakis A. Medema R.H. Freire R. Polo-like kinase-1 controls proteasome-dependent degradation of claspin during checkpoint recovery Curr. Biol. 2006 16 1950 1955 10.1016/j.cub.2006.08.026 16934469 28. Peschiaroli A. Dorrello N.V. Guardavaccaro D. Venere M. Halazonetis T. Sherman N.E. Pagano M. SCFβTrCP-mediated degradation of claspin regulates recovery from the DNA replication checkpoint response Mol. Cell 2006 23 319 329 10.1016/j.molcel.2006.06.013 16885022 29. Bennett L.N. Clarke P.R. Regulation of Claspin degradation by the ubiquitin-proteasome pathway during the cell cycle and in response to ATR-dependent checkpoint activation FEBS Lett. 2006 580 4176 4181 10.1016/j.febslet.2006.06.071 16828751 30. Faustrup H. Bekker-Jensen S. Bartek J. Lukas J. Mailand N. USP7 counteracts SCFβTrCP- but not APC/Cdh1-mediated proteolysis of Claspin J. Cell Biol. 2009 184 13 19 10.1083/jcb.200807137 19124652 PMC2615094 31. Martín Y. Cabrera E. Amoedo H. Hernández-Pérez S. Domínguez-Kelly R. Freire R. USP29 controls the stability of checkpoint adaptor Claspin by deubiquitination Oncogene 2015 34 1058 1063 10.1038/onc.2014.38 24632611 32. McGarry E. Gaboriau D. Rainey M.D. Restuccia U. Bachi A. Santocanale C. The deubiquitinase USP9X maintains DNA replication fork stability and DNA damage checkpoint responses by regulating CLASPIN during S-phase Cancer Res. 2016 76 2384 2393 10.1158/0008-5472.CAN-15-2890 26921344 33. Zhang D. Zaugg K. Mak T.W. Elledge S.J. A role for the deubiquitinating enzyme USP28 in control of the DNA-damage response Cell 2006 126 529 542 10.1016/j.cell.2006.06.039 16901786 34. Lee T.H. Choi J.Y. Park J.M. Kang T.H. Posttranscriptional control of the RS response via TTP-mediated Claspin mRNA stabilization Oncogene 2020 39 3245 3257 10.1038/s41388-020-1220-9 32086441 35. Awasthi P. Foiani M. Kumar A. ATM and ATR signaling at a glance J. Cell Sci. 2015 128 4255 4262 10.1242/jcs.169730 26567218 36. Marechal A. Zou L. RPA-coated single-stranded DNA as a platform for post-translational modifications in the DNA damage response Cell Res. 2015 25 9 23 10.1038/cr.2014.147 25403473 PMC4650586 37. Smith H.L. Southgate H. Tweddle D.A. Curtin N.J. DNA damage checkpoint kinases in cancer Expert Rev. Mol. Med. 2020 22 e2 10.1017/erm.2020.3 32508294 38. Marechal A. Zou L. DNA damage sensing by the ATM and ATR kinases Cold Spring Harb. Perspect. Biol. 2013 5 a012716 10.1101/cshperspect.a012716 24003211 PMC3753707 39. Gonzalez Besteiro M.A. Gottifredi V. The fork and the kinase: A DNA replication tale from a CHK1 perspective Mutat. Res./Rev. Mutat. Res. 2015 763 168 180 10.1016/j.mrrev.2014.10.003 25795119 PMC4369321 40. Clarke C.A.L. Clarke P.R. DNA-dependent phosphorylation of Chk1 and Claspin in a human cell-free system Biochem. J. 2005 388 705 712 10.1042/BJ20041966 15707391 PMC1138979 41. Lin S.Y. Li K. Stewart G.S. Elledge S.J. Human Claspin works with BRCA1 to both positively and negatively regulate cell proliferation Proc. Natl. Acad. Sci. USA 2004 101 6484 6489 10.1073/pnas.0401847101 15096610 PMC404071 42. Yoo H.Y. Jeong S.-Y. Dunphy W.G. Site-specific phosphorylation of a checkpoint mediator protein controls its responses to different DNA structures Genes Dev. 2006 20 772 783 10.1101/gad.1398806 16547171 PMC1472281 43. Azenha D. Lopes M.C. Martins T.C. Claspin: From replication stress and DNA damage responses to cancer therapy Adv. Protein Chem. Struct. Biol. 2019 115 203 246 10.1016/bs.apcsb.2018.10.007 30798932 44. Bahassi E.M. Ovesen J.L. Riesenberg A.L. Bernstein W.Z. Hasty P.E. Stambrook P.J. The checkpoint kinases Chk1 and Chk2 regulate the functional associations between hBRCA2 and Rad51 in response to DNA damage Oncogene 2008 27 3977 3985 10.1038/onc.2008.17 18317453 45. Sørensen C.S. Hansen L.T. Dziegielewski J. Syljuåsen R.G. Lundin C. Bartek J. Helleday T. The cell-cycle checkpoint kinase Chk1 is required for mammalian homologous recombination repair Nat. Cell Biol. 2005 7 195 201 10.1038/ncb1212 15665856 46. Sato K. Sundaramoorthy E. Rajendra E. Hattori H. Jeyasekharan A.D. Ayoub N. Shiess R. Aebersold R. Nishikawa H. Sedukhina A.S. A DNA-damage selective role for BRCA1 E3 ligase in Claspin ubiquitylation, CHK1 activation, and DNA repair Curr. Biol. 2012 22 1659 1666 10.1016/j.cub.2012.07.034 22863316 47. Yoo H.Y. Kumagai A. Shevchenko A. Shevchenko A. Dunphy W.G. Adaptation of a DNA replication checkpoint response depends upon inactivation of Claspin by the Polo-like kinase Cell 2004 117 575 588 10.1016/S0092-8674(04)00417-9 15163406 48. Syljuåsen R.G. Jensen S. Bartek J. Lukas J. Adaptation to the ionizing radiation-induced G2 checkpoint occurs in human cells and depends on checkpoint kinase 1 and Polo-like kinase 1 kinases Cancer Res. 2006 66 10253 10257 10.1158/0008-5472.CAN-06-2144 17079442 49. Scorah J. McGowan C.H. Claspin and Chk1 regulate replication fork stability by different mechanisms Cell Cycle 2009 8 1036 1043 10.4161/cc.8.7.8040 19270516 PMC2668962 50. Lee J. Gold D.A. Shevchenko A. Shevchenko A. Dunphy W.G. Roles of replication fork-interacting and Chk1-activating domains from Claspin in a DNA replication checkpoint response Mol. Biol. Cell 2005 16 5269 5282 10.1091/mbc.e05-07-0671 16148040 PMC1266425 51. Uno S. Masai H. Efficient expression and purification of human replication fork-stabilizing factor, Claspin, from mammalian cells: DNA-binding activity and novel protein interactions Genes Cells 2011 16 842 856 10.1111/j.1365-2443.2011.01535.x 21790909 52. Sar F. Lindsey-Boltz L.A. Subramanian D. Croteau D.L. Hutsell S.Q. Griffith J.D. Sancar A. Human Claspin is a ring-shaped DNA-binding protein with high affinity to branched DNA structures J. Biol. Chem. 2004 279 39289 39295 10.1074/jbc.M405793200 15226314 53. Broderick R. Rainey M.D. Santocanale C. Nasheuer H.P. Cell cycle-dependent formation of Cdc45-Claspin complexes in human cells is compromised by UV-mediated DNA damage FEBS J. 2013 280 4888 4902 10.1111/febs.12465 23910567 54. Feu S. Unzueta F. Llopis A. Semple J.I. Ercilla A. Guaita-Esteruelas S. Jaumont M. Freire R. Agell N. OZF is a Claspin-interacting protein essential to maintain the replication fork progression rate under RS FASEB J. 2020 34 6907 6919 10.1096/fj.201901926R 32267586 55. Yang C.C. Suzuki M. Yamakawa S. Uno S. Ishii A. Yamazaki S. Fukatsu R. Fujisawa R. Sakimura K. Tsurimoto T. Claspin recruits Cdc7 kinase for initiation of DNA replication in human cells Nat. Commun. 2016 7 12135 10.1038/ncomms12135 27401717 PMC4945878 56. Smith-Roe S.L. Patel S.S. Simpson D.A. Zhou Y.C. Rao S. Ibrahim J.G. Kaiser-Rogers K.A. Cordeiro-Stone M. Kaufmann W.K. Timeless functions independently of the Tim-Tipin complex to promote sister chromatid cohesion in normal human fibroblasts Cell Cycle 2011 10 1618 1624 10.4161/cc.10.10.15613 21508667 PMC3127161 57. Liu G. Chen X. Gao Y. Lewis T. Barthelemy J. Leffak M. Altered replication in human cells promotes DMPK (CTG)(n) (CAG)(n) repeat instability Mol. Cell. Biol. 2012 32 1618 1632 10.1128/MCB.06727-11 22354993 PMC3347245 58. Yang X.H. Shiotani B. Classon M. Zou L. Chk1 and Claspin potentiate PCNA ubiquitination Genes Dev. 2008 22 1147 1152 10.1101/gad.1632808 18451105 PMC2335311 59. Focarelli M.L. Soza S. Mannini L. Paulis M. Montecucco A. Musio A. Claspin inhibition leads to fragile site expression Genes Chrom. Canc. 2009 48 1083 1090 10.1002/gcc.20710 19760606 60. Dillon L.W. Burrow A.A. Wang Y.H. DNA instability at chromosomal fragile sites in cancer Curr. Genom. 2010 11 326 337 10.2174/138920210791616699 PMC2944998 21286310 61. Casper A.M. Nghiem P. Arlt M.F. Glover T.W. ATR regulates fragile site stability Cell 2002 111 779 789 10.1016/S0092-8674(02)01113-3 12526805 62. Durkin S.G. Arlt M.F. Howlett N.G. Glover T.W. Depletion of CHK1, but not CHK2, induces chromosomal instability and breaks at common fragile sites Oncogene 2006 25 4381 4388 10.1038/sj.onc.1209466 16732333 63. Koundrioukoff S. Carignon S. Techer H. Letessier A. Brison O. Debatisse M. Stepwise activation of the ATR signaling pathway upon increasing RS impacts fragile site integrity PLoS Genet. 2013 9 e1003643 10.1371/journal.pgen.1003643 23874235 PMC3715430 64. Franchitto A. Pichierri P. Replication fork recovery and regulation of common fragile sites stability Cell. Mol. Life Sci. 2014 71 4507 4517 10.1007/s00018-014-1718-9 25216703 PMC11113654 65. Khamidullina A.I. Abramenko Y.E. Bruter A.V. Tatarskiy V.V. Key proteins of replication stress response and cell cycle control as cancer therapy targets Int. J. Mol. Sci. 2024 25 1263 10.3390/ijms25021263 38279263 PMC10816012 66. Kim J.M. Kakusho N. Yamada M. Kanoh Y. Takemoto N. Masai H. Cdc7 kinase mediates Claspin phosphorylation in DNA replication checkpoint Oncogene 2008 27 3475 3482 10.1038/sj.onc.1210994 18084324 67. Rainey M.D. Harhen B. Wang G.N. Murphy P.V. Santocanale C. Cdc7-dependent and -independent phosphorylation of Claspin in the induction of the DNA replication checkpoint Cell Cycle 2013 12 1560 1568 10.4161/cc.24675 23598722 PMC3680535 68. Yang C.C. Kato H. Shindo M. Masai H. Cdc7 activates replication checkpoint by phosphorylating the Chk1 binding domain of Claspin in human cells eLife 2019 8 e50796 10.7554/eLife.50796 31889509 PMC6996922 69. Ulsamer A. Martínez-Limón A. Bader S. Rodríguez-Acebes S. Freire R. Méndez J. Nadal E. Posas F. Regulation of Claspin by the p38 stress-activated protein kinase protects cells from DNA damage Cell Rep. 2022 40 111375 10.1016/j.celrep.2022.111375 36130506 70. Koganti S. Hui-Yuen J. McAllister S. Gardner B. Grasser F. Palendira U. Tangye S.G. Freeman A.F. Bhaduri-McIntosh S. STAT3 interrupts ATR-Chk1 signaling to allow oncovirus-mediated cell proliferation Proc. Natl. Acad. Sci. USA 2014 111 4946 4951 10.1073/pnas.1400683111 24639502 PMC3977268 71. Spardy N. Covella K. Cha E. Hoskins E.E. Wells S.I. Duensing A. Duensing S. Human papillomavirus 16 E7 oncoprotein attenuates DNA damage checkpoint control by increasing the proteolytic turnover of Claspin Cancer Res. 2009 69 7022 7029 10.1158/0008-5472.CAN-09-0925 19706760 PMC2737077 72. Studach L. Wang W.H. Weber G. Tang J. Hullinger R.L. Malbrue R. Liu X. Andrisani O. Polo-like kinase 1 activated by the hepatitis B virus X protein attenuates both the DNA damage checkpoint and DNA repair resulting in partial polyploidy J. Biol. Chem. 2010 285 30282 30293 10.1074/jbc.M109.093963 20624918 PMC2943266 73. Sun A. Bagella L. Tutton S. Romano G. Giordano A. From G0 to S phase: A view of the roles played by the retinoblastoma (Rb) family members in the Rb-E2F pathway J. Cell Biochem. 2007 102 1400 1404 10.1002/jcb.21609 17979151 74. Liu X. Clements A. Zhao K. Marmorstein R. Structure of the human papillomavirus E7 oncoprotein and its mechanism for inactivation of the retinoblastoma tumor suppressor J. Biol. Chem. 2006 281 578 586 10.1074/jbc.M508455200 16249186 75. Scheffner M. Huibregtse J.M. Vierstra R.D. Howley P.M. The HPV-16 E6 and E6-AP complex functions as a ubiquitin-protein ligase in the ubiquitination of p53 Cell 1993 75 495 505 10.1016/0092-8674(93)90384-3 8221889 76. Rodriguez-Bravo V. Guaita-Esteruelas S. Florensa R. Bachs O. Agell N. Chk1- and Claspin-dependent but ATR/ATM- and Rad17-independent DNA replication checkpoint response in HeLa cells Cancer Res. 2006 66 8672 8679 10.1158/0008-5472.CAN-05-4443 16951182 77. Zhang L. Wirth M. Patra U. Stroh J. Isaakidis K. Rieger L. Kossatz S. Milanovic M. Zang C. Demel U. Actionable loss of SLF2 drives B-cell lymphomagenesis and impairs the DNA damage response EMBO Mol. Med. 2023 15 e16431 10.15252/emmm.202216431 37485814 PMC10493575 78. Wang C. Yang C. Ji J. Jiang J. Shi M. Cai Q. Yu Y. Zhu Z. Zhang J. Deubiquitinating enzyme USP20 is a positive regulator of claspin and suppresses the malignant characteristics of gastric cancer cells Int. J. Oncol. 2017 50 1136 1146 10.3892/ijo.2017.3904 28350092 PMC5363881 79. Bold I.T. Specht A.-K. Droste C.F. Zielinski A. Meyer F. Clauditz T.S. Munsher A. Werner S. Rothkamm K. Petersen C. DNA damage response during replication correlates with CIN70 score and determines survival in HNSCC patients Cancers 2021 13 1194 10.3390/cancers13061194 33801877 PMC7998578 80. Hunter J.E. Butterworth J.A. Sellier H. Luli S. Floudas A. Moore A.J. Thomas H.D. Campbell K. Kenneth N. Chiremba T. Regulation of checkpoint kinase signalling and tumorigenesis by the NF-κB regulated gene, CLSPN BioRxiv 2018 358291 10.1101/358291 81. Azenha D. Hernandez-Perez S. Martin Y. Viegas M.S. Martins A. Lopes M.C. Lam E.W. Freire R. Martins T.C. Implications of CLSPN Cancers 2020 12 2396 10.3390/cancers12092396 32847043 PMC7565888 82. Erkko H. Pylkas K. Karppinen S.M. Winqvist R. Germline alterations in the CLSPN gene in breast cancer families Cancer Lett. 2008 261 93 97 10.1016/j.canlet.2007.11.003 18077083 83. Madeira A. Azenha D. Correia L. Goncalves V. Ferreira M. Lacerda M. Lopes C. Martins T.C. Claspin mutations and loss of function may contribute to breast carcinogenesis and gliomagenesis Eur. J. Cancer 2012 48 S172 10.1016/S0959-8049(12)71365-5 84. Madeira A. Gonçalves V. Ferreira M. Lacerda M. Martins T.C. Loss of expression of Claspin in tumour cells may be involved in breast carcinogenesis Eur. J. Cancer 2008 6 S43 10.1016/S1359-6349(08)71339-9 85. Wang X. Szabo C. Qian C. Amadio P.G. Thibodeau S.N. Cerhan J.R. Petersen G.M. Liu W. Couch F.J. Mutational analysis of thirty-two double-strand DNA break repair genes in breast and pancreatic cancers Cancer Res. 2008 68 971 975 10.1158/0008-5472.CAN-07-6272 18281469 86. Zhang J. Song Y.-H. Brannigan B.W. Wahrer D.C.R. Schiripo T.A. Harris P.L. Haserlat S.M. Ulkus L.E. Shannon K.M. Garber J.E. Prevalence and functional analysis of sequence variants in the ATR checkpoint mediator Claspin Mol. Cancer Res. 2009 7 1510 1516 10.1158/1541-7786.MCR-09-0033 19737971 PMC2994259 87. Serçin O. Kemp M.G. Characterization of functional domains in human Claspin Cell Cycle 2011 10 1599 1606 10.4161/cc.10.10.15562 21478680 PMC3127160 88. Thutkawkorapin J. Lindblom A. Tham E. Exome sequencing in 51 early onset non-familial CRC cases Mol. Genet. Genom. Med. 2019 7 e605 10.1002/mgg3.605 PMC6503031 30809968 89. Smits V.A.J. Cabrera E. Freire R. Gillespie D.A. Claspin—Checkpoint adaptor and DNA replication factor FEBS J. 2019 286 441 455 10.1111/febs.14594 29931808 90. Hsieh M.-J. Lo Y.-S. Ho H.-Y. Lin C.-C. Chuang Y.-C. The interaction between CLSPN gene polymorphisms and alcohol consumption contributes to oral cancer progression Int. J. Mol. Sci. 2024 25 1098 10.3390/ijms25021098 38256171 PMC10816373 91. Johmura Y. Yamashita E. Shimada M. Nakanishi K. Nakanishi M. Defective DNA repair increases susceptibility to senescence through extension of Chk1-mediated G2 checkpoint activation Sci. Rep. 2016 6 31194 10.1038/srep31194 27507734 PMC4979019 92. Zhu X. Xue J. Jiang X. Gong Y. Gao C. Cao T. Li Q. Bai L. Li Y. Xu G. TRIM21 suppresses CHK1 activation by preferentially targeting CLASPIN for K63-linked ubiquitination Nucleic Acids Res. 2022 50 1517 1530 10.1093/nar/gkac011 35048968 PMC8860585 93. Benevolo M. Musio A. Vocaturo A. Donà M. Rollo F. Terrenato I. Carosi M. Pescarmona E. Vocaturo G. Mottolese M. Claspin as a biomarker of human papillomavirus-related high grade lesions of uterine cervix J. Transl. Med. 2012 10 132 10.1186/1479-5876-10-132 22731782 PMC3433305 94. Bianco J.N. Bergoglio V. Lin Y.L. Pillaire M.J. Schmitz A.L. Gilhodes J. Lusque A. Mazières J. Lacroix-Triki M. Roumeliotis T.I. Overexpression of Claspin and Timeless protects cancer cells from RS in a checkpoint-independent manner Nat. Commun. 2019 10 910 10.1038/s41467-019-08886-8 30796221 PMC6385232 95. Kobayashi G. Sentani K. Babasaki T. Sekino Y. Shigematsu Y. Hayashi T. Oue N. Teishima J. Matsubara A. Sasaki N. Claspin overexpression is associated with high-grade histology and poor prognosis in renal cell carcinoma Cancer Sci. 2020 111 1020 1027 10.1111/cas.14299 31912588 PMC7060467 96. Kobayashi G. Hayashi T. Sentani K. Babasaki T. Sekino Y. Inoue S. Uraoka N. Hanamoto M. Nose H. Teishima J. Clinicopathological significance of claspin overexpression and its efficacy as a novel biomarker for the diagnosis of urothelial carcinoma Virchows Arch. 2022 480 621 633 10.1007/s00428-021-03239-7 34842980 97. Kobayashi G. Sentani K. Hattori T. Yamamoto Y. Imai T. Sakamoto N. Kuraoka K. Oue N. Sasaki N. Taniyama K. Clinicopathological significance of claspin overexpression and its association with spheroid formation in gastric cancer Hum. Pathol. 2019 84 8 17 10.1016/j.humpath.2018.09.001 30240769 98. Jia Y. Cheng X. Liang W. Lin S. Li P. Yan Z. Zhang M. Ma W. Hu C. Wang B. CLSPN is a potential biomarker associated with poor prognosis in low-grade gliomas based on a multi-database analysis Curr. Res. Translat. Med. 2022 70 103345 10.1016/j.retram.2022.103345 35487167 99. Babasaki T. Sentani K. Sekino Y. Kobayashi G. Pham Q.T. Katsuya N. Akabane S. Taniyama D. Hayashi T. Shiota M. Overexpression of Claspin promotes docetaxel resistance and is associated with prostate-specific antigen recurrence in prostate cancer Cancer Med. 2021 10 5574 5588 10.1002/cam4.4113 34240817 PMC8366092 100. Cai C. Luo J. Liu Q. Liu Z. Zhao Y. Wu X. Yuegao Y. Lei Y. Lu J. Wang Y. Claspin overexpression promotes tumor progression and predicts poor clinical outcome in prostate cancer Gene Ther. Mol. Biol. 2021 25 131 139 Correction in Gene Ther. Mol. Biol. 2021 25 https://doi.org/10.1089/gtmb.2020.0226.correx 10.1089/gtmb.2020.0226 33596143 101. Elbasateeny S. Abdelwahab M. Mahmoud A. Malek M. Yassin M. Ismail A. Ibrahim H. Immunohistochemical expression of Claspin and TopBP1 in prostatic adenocarcinoma: Correlation with clinicopathological parameters and prognostic significance Egypt. J. Hosp. Med. 2022 89 6422 6431 10.21608/ejhm.2022.270276 102. Lin C. Yuan G. Hu Z. Zeng Y. Qiu X. Yu H. He S. Bioinformatics analysis of the interactions among lncRNA, miRNA, and mRNA expression, genetic mutations, and epigenetic modifications in hepatocellular carcinoma Mol. Med. Rep. 2019 19 1356 1364 10.3892/mmr.2018.9728 30535497 103. Liao X. Wang X. Huang K. Han C. Deng J. Yu T. Yang C. Huang R. Liu X. Yu L. Integrated analysis of competing endogenous RNA network revealing potential prognostic biomarkers of hepatocellular carcinoma J. Cancer 2019 10 3267 3283 10.7150/jca.29986 31289599 PMC6603367 104. Hein J. Boichuk S. Wu J. Cheng Y. Freire R. Jat P.S. Roberts T.M. Gjoerup O.V. Simian virus 40 large T antigen disrupts genome integrity and activates a DNA damage response via Bub1 binding J. Virol. 2009 83 117 127 10.1128/JVI.01515-08 18922873 PMC2612341 105. Rohaly G. Korf K. Dehde S. Dornreiter I. Simian virus 40 activates ATR-Delta p53 signaling to override cell cycle and DNA replication control J. Virol. 2010 84 10727 10747 10.1128/JVI.00122-10 20686026 PMC2950571 106. Senturk E. Manfredi J.J. p53 and cell cycle effects after DNA damage Methods Mol. Biol. 2013 962 49 61 10.1007/978-1-62703-236-0_4 23150436 PMC4712920 107. Marei H.E. Althani A. Afifi N. Hasan A. Caceci T. Pozzoli G. Morrione A. Giordano A. Cenciarelli C. Cenciarelli C. p53 signaling in cancer progression and therapy Cancer Cell Int. 2021 21 703 10.1186/s12935-021-02396-8 34952583 PMC8709944 108. Allera-Moreau C. Rouquette I. Lepage B. Oumouhou N. Walschaerts M. Leconte E. Schilling V. Gordien K. Brouchet L. Delisle M.B. DNA replication stress response involving PLK1, CDC6, POLQ, RAD51 and CLASPIN upregulation prognoses the outcome of early/mid-stage non-small cell lung cancer patients Oncogenesis 2012 1 e30 10.1038/oncsis.2012.29 23552402 PMC3503291 109. Briu L.M. Maric C. Cadoret J.C. Replication stress, genomic instability, and replication timing: A complex relationship Int. J. Mol. Sci. 2021 22 4764 10.3390/ijms22094764 33946274 PMC8125245 110. Pasero P. Tourrière H. Overexpression of the Fork Protection Complex: A strategy to tolerate oncogene-induced RS in cancer cells Cell Cycle 2019 6 1607455 10.1080/23723556.2019.1607455 PMC6548472 31211234 111. Bartek J. Mistrik M. Bartkova J. Thresholds of replication stress signaling in cancer development and treatment Nat. Struct. Mol. Biol. 2012 19 5 10.1038/nsmb.2220 22218289 112. Lopez-Contreras A.J. Fernadez-Capetillo O. The ATR barrier to replication-born DNA damage DNA Repair 2010 9 1249 1255 10.1016/j.dnarep.2010.09.012 21036674 PMC3590793 113. Gilad O. Nabet B.Y. Ragland R.L. Schoppy D.W. Smith K.D. Durham A.C. Brown E.J. Combining ATR suppression with oncogenic Ras synergistically increases genomic instability, causing synthetic lethality or tumorigenesis in a dosage-dependent manner Cancer Res. 2010 70 9693 9702 10.1158/0008-5472.CAN-10-2286 21098704 PMC3057927 114. Fang Y. Tsao C.C. Goodman B.K. Furumai R. Tirado C.A. Abraham R.T. Wang X.F. ATR functions as a gene dosage-dependent tumor suppressor on a mismatch repair-deficient background EMBO J. 2004 23 3164 3174 10.1038/sj.emboj.7600315 15282542 PMC514932 115. Lopez-Contreras A.J. Gutierrez-Martinez P. Specks J. Rodrigo-Perez S. Fernadez-Capetillo O. An extra allele of Chk1 limits oncogene-induced replicative stress and promotes transformation J. Exp. Med. 2012 209 455 461 10.1084/jem.20112147 22370720 PMC3302228 116. Black E.M. Joo Y.K. Kabeche L. Keeping relApse in Chk: Molecular mechanisms of Chk1 inhibitor resistance in lymphoma Biochem. J. 2022 479 2345 2349 10.1042/BCJ20220461 36416754 PMC9704517 117. Wee P. Wang Z. Epidermal growth factor receptor cell proliferation signaling pathways Cancers 2017 9 52 10.3390/cancers9050052 28513565 PMC5447962 118. Yang C.C. Masai H. Claspin is Required for Growth Recovery from Serum Starvation through Regulating the PI3K-PDK1-mTOR Pathway in Mammalian Cells Mol. Cell. Biol. 2023 43 1 21 10.1080/10985549.2022.2160598 36720467 PMC9936878 119. Peng Y. Wang Y. Zhou C. Mei W. Zeng C. PI3K/Akt/mTOR pathway and its role in cancer therapeutics: Are we making headway? Front. Oncol. 2022 12 819128 10.3389/fonc.2022.819128 35402264 PMC8987494 120. Salmena L. Poliseno L. Tay Y. Kats L. Pandolfi P.P. A ceRNA hypothesis: The Rosetta Stone of a hidden RNA language? Cell 2011 146 353 358 10.1016/j.cell.2011.07.014 21802130 PMC3235919 121. Hu T. Lei D. Zhou J. Zhang B. circRNA derived from CLSPN (circCLSPN) is an oncogene in human glioblastoma multiforme by regulating cell growth, migration, and invasion via ceRNA pathway J. Biosci. 2021 46 66 10.1007/s12038-021-00185-z 34269180 122. Tsimaratou K. Kletsas D. Kastrinakis N. Tsantoulis P. Evangelou K. Sideridou M. Liontos M. Poulias I. Venere M. Salmas M. Evaluation of claspin as a proliferation marker in human cancer and normal tissues J. Pathol. 2007 211 331 339 10.1002/path.2095 17152083 123. Hsiao H.W. Yang C.C. Masai H. Roles of Claspin in regulation of DNA replication, replication stress responses, and oncogenesis in human cells Genome Instab. Dis. 2021 2 263 280 10.1007/s42764-021-00049-8 124. Yamada S. Miyata H. Isono M. Hori K. Yanagawa J. Murai A. Minowa T. Mizue Y. Sasaki K. Murata K. Cisplatin resistance driver Claspin is a target for immunotherapy in urothelial carcinoma Cancer Immunol. Immunother. 2023 72 2057 2065 10.1007/s00262-023-03388-5 36795123 PMC10992486 125. Shen L. Shi Q. Wang W. Double agents: Genes with both oncogenic and tumor-suppressor functions Oncogenesis 2018 7 25 10.1038/s41389-018-0034-x 29540752 PMC5852963 126. Datta N. Chakraborty S. Basu M. Ghosh M.K. Tumor suppressors having oncogenic functions: The double agents Cells 2020 10 46 10.3390/cells10010046 33396222 PMC7824251 127. Pitolli C. Wang Y. Candi E. Shi Y. Melino G. Amelio I. p53-mediated tumor suppression: DNA-damage response and alternative mechanisms Cancers 2019 11 1983 10.3390/cancers11121983 31835405 PMC6966539 128. Soussi T. Wiman K.G. TP53: An oncogene in disguise Cell Death Diff. 2015 22 1239 1249 10.1038/cdd.2015.53 PMC4495363 26024390 129. Zhang C. Liu J. Xu D. Zhang T. Hu W. Feng Z. Gain-of-function mutant p53 in cancer progression and therapy J. Mol. Cell Biol. 2020 12 674 687 10.1093/jmcb/mjaa040 32722796 PMC7749743 130. Choi W. Lee E.S. Therapeutic targeting of DNA damage response in cancer Int. J. Mol. Sci. 2022 23 1701 10.3390/ijms23031701 35163621 PMC8836062 131. Rose M. Burgess J.T. O’Byrne K. Richard D.J. Bolderson E. PARP inhibitors: Clinical relevance, mechanisms of action and tumor resistance Front. Cell Dev. Biol. 2020 8 564601 10.3389/fcell.2020.564601 33015058 PMC7509090 132. Choi S. Yang H. Lee S. Ki J.-H. Nam D.-H. Yoo H. TopBP1 and Claspin contribute to the radioresistance of lung cancer brain metastases Mol. Cancer 2014 13 211 10.1186/1476-4598-13-211 25216549 PMC4168047 133. Tu Y. Chen Z. Zhao P. Sun G. Bao Z. Chao H. Fan L. Li C. You Y. Qu Y. Smoothened promotes glioblastoma radiation resistance via activating USP3-mediated claspin deubiquitination Clin. Cancer Res. 2020 26 1749 1762 10.1158/1078-0432.CCR-19-1515 31900278 134. Ito F. Yoshimoto C. Yamada Y. Sudo T. Kobayashi H. The HNF-1β-USP28-Claspin pathway upregulates DNA damage-induced Chk1 activation in ovarian clear cell carcinoma Oncotarget 2018 9 17512 17522 10.18632/oncotarget.24776 29707125 PMC5915133 135. Busato F. Khouzai B.E. Mognato M. Biological mechanisms to reduce radioresistance and increase the efficacy of radiotherapy: State of the art Int. J. Mol. Sci. 2022 23 10211 10.3390/ijms231810211 36142122 PMC9499172 136. Imran M. Saleem S. Chaudhuri A. Ali J. Baboota S. Docetaxel: An update on its molecular mechanisms, therapeutic trajectory and nanotechnology in the treatment of breast, lung, and prostate cancer J. Drug Deliv. Sci. Technol. 2020 60 101959 10.1016/j.jddst.2020.101959 137. Corno C. D’Arcy P. Bagnoli M. Paolini B. Constantino M. Carenini N. Corna E. Alberti P. Mezzanzanica D. Colombo D. The deubiquitinase USP8 regulates ovarian cancer cell response to cisplatin by suppressing apoptosis Front. Cell. Dev. Biol. 2022 10 1055067 10.3389/fcell.2022.1055067 36578788 PMC9791127 138. Aldossary S.A. Review on pharmacology of cisplatin: Clinical use, toxicity, and mechanism of resistance of cisplatin Biomed. Pharmacol. J. 2019 12 7 15 10.13005/bpj/1608 139. Walz A. Ugolkov A. Chandra S. Kozikowski A. Carneiro B.A. O’Halloran T.V. Giles F.J. Billadeau D.D. Mazar A.P. Molecular pathways: Revisiting glycogen synthase kinase-3β as a target for the treatment of cancer Clin. Cancer Res. 2017 23 1891 1897 10.1158/1078-0432.CCR-15-2240 28053024 PMC5392367 140. Ugolkov A. Gaisina I. Zhang J.-S. Billadeau D.D. White K. Kozikowski A. Jain S. Cristofanilli M. Giles F. O’Halloran T. GSK-3 inhibition overcomes chemoresistance in human breast cancer Cancer Lett. 2016 380 384 392 10.1016/j.canlet.2016.07.006 27424289 PMC5786372 141. Cabrera E. Raninga P. Khanna K.K. Freire R. GSK3-β Stimulates Claspin Degradation via β-TrCP Ubiquitin Ligase and Alters Cancer Cell Survival Cancers 2019 11 1073 10.3390/cancers11081073 31362447 PMC6721324 Figure 1 Claspin participates in several cellular mechanisms that are usually altered in cancer. Claspin is a component of the replisome, which regulates replication and origin firing (A), and of the replication fork protection complex (FPC), being responsible for the stabilization of replication forks (B). Claspin is an essential scaffold protein in Chk1 phosphorylation by ATR during checkpoint activation and cell cycle arrest (C). In addition, Claspin bridges checkpoint activation and different DNA repair pathways (homologous recombination, HR; nucleotide excision repair, NER; mismatch repair, MMR; and FANC/BRCA pathway) (D). If DNA damage is too extensive and cannot be repaired, Claspin is cleaved by caspases-3 and -7, and is degraded in the proteasome, which drives the cell into apoptosis (E). After DNA damage repair, Plk1 phosphorylates Claspin, promoting its degradation by the ubiquitin–proteasome pathway. Claspin elimination allows for checkpoint recovery and cell entry into mitosis (F), or checkpoint adaptation (G), a process in which cells undergo mitosis despite sustained DNA damage. Claspin also plays an important role in epigenetic memory (H). Figure 2 Claspin: tumor suppressor or oncogene? In early stages of oncogenesis, Claspin may act as a tumor suppressor ( top bottom Figure 3 Claspin is a central player in acquired radio- and chemoresistance and cancer survival. Claspin is overexpressed in tumor cells that escape radiation- and chemotherapy, its depletion enhancing sensitivity to different cancer treatments. Claspin over-expression is generally due to the triggering of different upstream players (e.g., Smo, HNF-1β, p38) that converge on the activation of DUBs (e.g., USP3, USP8, USP28) and Claspin stabilization, thereby allowing Claspin-dependent ATR–Chk1 signaling activation and cell cycle arrest, providing the cell time to repair DNA damage and survive. Claspin over-expression also allows survival of cells exposed to genotoxics through activation of survival pathways, as those mediated by Akt and Erk. Therefore, Claspin inhibition may constitute a therapeutic strategy for chemo- and radio-sensitization. Figure 4 Proposed model for Claspin’s role in cancer. At pre-malignant and initial stages of cancer development, Claspin acts as a tumor suppressor, preventing malignant transformation. This is achieved by Claspin’s tumor suppressor functions that include its role in DNA damage and replication checkpoint activation, replication protection, DNA repair, apoptosis, and epigenetic memory. CLSPN’s inactivation at such early stages is known to promote carcinogenesis. However, cancer is an evolving entity. As oncogenes are activated, cancer cells start feeling the pressure of replication stress (RS) and must adapt. Adaptation seems to involve exploitation of Claspin’s functions in the RS response, through its role in the replisome and FPC, which is independent of the ATR–Chk1 checkpoint activation, but also through its role in Chk1-mediated checkpoint responses. However, there are many routes to cancer, and different cancer cells may adopt distinct strategies to survive and proliferate. The strategies adopted may depend on the cell type and context, the mutational landscape and the stage of carcinogenesis. Through its stabilization and expression, Claspin promotes survival by different pathways, specifically, through stress coping mechanisms. For instance, Claspin-sustained expression may inhibit apoptosis, promoting cancer cell survival, namely through survival signals mediated by Akt. Claspin is also involved in mechanisms that allow the uncontrolled replication of tumor cells (RS), and possibly also contributes to tumor migration, invasion, and metastasis formation. Importantly, Claspin over-expression seems to underly several pathways implicated in therapy resistance, which turns Claspin targeting, in single or combined therapeutic regimens, into an attractive possibility. ",
  "metadata": {
    "Title of this paper": "GSK3-β Stimulates Claspin Degradation via β-TrCP Ubiquitin Ligase and Alters Cancer Cell Survival",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469749/"
  }
}