{
  "title": "Paper_611",
  "abstract": "pmc Front Immunol Front Immunol 1754 frontimmu Front. Immunol. Frontiers in Immunology 1664-3224 Frontiers Media SA PMC12479322 PMC12479322.1 12479322 12479322 41035634 10.3389/fimmu.2025.1648432 1 Immunology Review Bridging the gap: ferroptosis of immune cells in the tumor microenvironment Wang Weijing  1  † Li Huiyao  2  † Liang Shuai  1  † Hu Yani  1  † Ding Junli  1  * Wu Xi  1  * Hua Dong  1  *  1 Department of Oncology, The Affiliated Wuxi People's Hospital of Nanjing Medical University, Wuxi People's Hospital, Wuxi Medical Center, Nanjing Medical University Wuxi China  2 The Affiliated Children's Hospital of Jiangnan University, Wuxi Children's Hospital, Wuxi School of Medicine, Jiangnan University Wuxi China Edited by: Jun Zhang Reviewed by: Lingzhang Meng  Fangmin Zhong *Correspondence: Junli Ding, dingjunliletters@163.com wuxiolivia@126.com wx89211@163.com †These authors have contributed equally to this work 16 9 2025 2025 16 480569 1648432 17 6 2025 27 8 2025 16 09 2025 01 10 2025 02 10 2025 Copyright © 2025 Wang, Li, Liang, Hu, Ding, Wu and Hua. 2025 Wang, Li, Liang, Hu, Ding, Wu and Hua https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Ferroptosis, an iron-dependent form of regulated cell death driven by lipid peroxidation, is increasingly recognized as a pivotal immunomodulatory mechanism within the tumor microenvironment (TME). Beyond its well-established role in tumor cell elimination, emerging evidence reveals that immune cell subsets exhibit distinct susceptibility to ferroptosis, with profound consequences for antitumor immunity. This review systematically delineates the dual and cell-type-specific roles of ferroptosis across innate and adaptive immune populations: while ferroptosis-mediated depletion of immunosuppressive cells potentiates antitumor responses, immunostimulatory cells critically depend on ferroptosis defense pathways to sustain their survival and function—their dysfunction exacerbates immune evasion. We further decode the metabolic and signaling networks that govern immune cell ferroptosis and their dynamic interplay with immunotherapy and engineered nanomaterials. Finally, we critically addressed key challenges in clinical translation, including biomarker development, cell-specific delivery, and design of nanomaterials to minimize off-target effects. By elucidating the immune context-dependence of ferroptosis, this review provides a framework for developing precision therapies that harness ferroptosis-immune crosstalk to improve cancer therapy in the clinic. ferroptosis tumor microenvironment immune cells immunotherapy nanomaterials The author(s) declare financial support was received for the research and/or publication of this article. This work was supported by the Young Scientists Fund of the National Natural Science Foundation of China (No. 82403576), Top Medical Expert Team of 2021 Taihu Talent Plan Project, Medical Innovation Team of Wuxi (No. CXTD2021001), 2025 Goose Flock Talent Program for Leading Discipline Experts of Wuxi People’s Hospital (No. YZ-XKDTR-HD-2025), General Program of Wuxi Medical Center (No. WMCG202352). Nanjing Medical University-Qilu Clinical Research Fund Project (2024KF0277). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Cancer Immunity and Immunotherapy 1 Introduction Tumor microenvironment (TME), a multifaceted system, is not limited to the immediate habitat of tumor cells themselves, diverse immune components but also is characterized by its dynamic complexity, which means it can promote the expansion and metastasis of tumors, as well as directly modulates their receptiveness to therapeutic interventions, while its effect is highly dependent on the host’s immune status. In detail, the anti-tumor immune system can be divided into two major parts: innate immunity and adaptive immunity, whereas the immune cells in the TME are stratified as immunosuppressive cells and immunostimulatory cells, and the balance between them determines the occurrence and development of cancer. More importantly, the quest to debilitate suppressive functionalities whilst fortifying stimulatory counterparts is still an urgent problem to be solved. At present, with the emergence of various forms of cell death, especially iron-dependent ferroptosis, has catalyzed a paradigm shift, presenting novel avenues for addressing this critical dilemma. Ferroptosis is an iron-dependent programmed cell death mode, which is characterized by excessive Reactive Oxygen Species (ROS) accumulation and lipid peroxidation ( 1 3 + 4 5 6 Moreover, the combination of ferroptosis with immunotherapy and nanomaterials has received substantial attention in recent years. On the one hand, Nano-carriers represent a novel type of nano-scale drug delivery system with the advantages of suitable size, easy modification, strong targeting ability, high cellular uptake, and good biocompatibility ( 7 8 Hence, in this review, we mainly focus on the ferroptosis of immune cells in the TME and discuss the precise potential of anti-cancer strategies involving the combination of ferroptosis in immunotherapy or nanomaterials, which could provide novel insights into the clinical diagnosis and treatment of cancer. 2 Ferroptosis 2.1 Mechanism of ferroptosis Ferroptosis, a recently discovered form of cell death, exhibits distinct morphological and biochemical characteristics ( 2  Figure 1 9 10 3 Figure 1 Significant Timeline for the Development of Ferroptosis. RSL3, RAS-selective lethal compound 3; DFO, Deferoxamine; VitE, Vitamin E; GPX4, Glutathione Peroxidase 4; PUFA, Polyunsaturated Fatty Acids; ACSL4, Acyl-CoA Synthetase Long Chain Family Member 4; FSP1, Ferroptosis Suppressor Protein 1; DHODH, Dihydroorotate Dehydrogenase; MYCN, MYCN Proto-Oncogene. Timeline illustrating key discoveries and developments in ferroptosis from 2003 to 2024. Key milestones include the definition of ferroptosis in 2012, identification of GPX4 regulation in 2014, and ongoing research in 2024. Various inhibitors and sensitizers, such as Erastin in 2003 and AS-252424 in 2024, are highlighted as potential therapeutic targets. 2.2 Antioxidant pathways of ferroptosis Ferroptosis can be inhibited by dual antioxidant pathways: Glutathione peroxidase 4 (GPX4)-dependent and non-GPX4-dependent pathways (  Figure 2 11 Figure 2 Mechanisms and regulatory pathways of ferroptosis. Ferroptosis is mainly caused by the peroxidation of PUFAs on specific membrane lipids. ACSL4 and LPCAT3 are crucial enzymes involved in the synthesis of PUFAs for membrane lipids. Hitherto, four regulatory pathways that reverse ferroptosis have been identified: the GPX4-GSH pathway, the FSP1-CoQH 2 2 2 Diagram illustrating the biochemical pathways involved in ferroptosis, highlighting interactions between cystine and glutamate transport, GSH production, and GPX4 activity. It details mechanisms like lipid peroxidation, the role of PI3K, E-cadherin, and ACSL4 in the process, and the involvement of NRF2 and VHL. Components such as CoQ10 and pathways like the mevalonate pathway are also shown, emphasizing mitochondrial functions and cellular responses leading to ferroptosis. 2.2.1 The canonical GPX4-regulated ferroptosis pathway GPX4, a selenoprotein essential for cellular redox homeostasis, neutralizes PLOOHs on biological membranes by utilizing GSH as its obligate co-substrate ( 12 - 1 13 14 - - 15 16 17 18 Paradoxically, upon GPX4 ablation, some cancer cell lineages remain resistant to ferroptosis revealing the existence of compensatory GPX4 independent defense mechanisms ( 19 2.2.2 GPX4-independent surveillance pathways Emerging research has established the Ferroptosis inhibitor protein 1 (FSP1)- Ubiquinone (CoQ) axis as a parallel antioxidant system that functions as a compensatory mechanism specifically in GPX4-deficient cellular contexts ( 20 21 22 Recent studies have positioned GTP cyclohydroxylase-1 (GCH1) as another critical regulator of ferroptosis ( 23 24 25 23 A recent study uncovered a mitochondria-localized antioxidant system mediated by Dihydroorotate Dehydrogenase (DHODH) capable of compensating for GPX4 deficiency by neutralizing lipid peroxidation within mitochondria ( 26 In addition, the crosstalk between ferroptosis and other signaling pathways has only been extensively studied in cancer. Key pathways such as PI3K-AKT-mTOR, LKB1-AMPK, E-cadherin-Hippo-YAP/TAZ, and VHL-HIF critically modulate ferroptosis in cancers via metabolic regulation and stress-response mechanisms ( 27 In the future, integrating strategies to target ferroptosis defense pathways and enhance the efficacy of cancer immunotherapy will represent a promising therapeutic approach. 3 The ferroptosis of immune cells The TME comprises a complex network of tumor cells, immune cells, and stromal components, where ferroptosis acts as a dual-edged sword—directly eliminating tumor cells while indirectly shaping immune responses. When tumor cells undergo ferroptosis, they release damage-associated molecular patterns (DAMPs) such as high mobility group box 1 (HMGB1), adenosine triphosphate (ATP), and KRASG12D, which engage pattern recognition receptors (e.g., toll-like receptor 4,TLR4; P2X Ligand-Gated Ion Channel 7,P2X7) on innate immune cells to trigger immunogenic cell death (ICD) or modulate polarization states (e.g., STAT3-driven M2 macrophage skewing via AGER/RAGE) ( 28 32  Figure 3 33 36 Figure 3 Regulatory mechanisms of ferroptosis in various immune cells. The figure depicts different regulation of ferroptosis in immune inhibitory cells and immune stimulating cells and its different function in innate immunity and adaptive immunity. In innate immunity, M1 and M2 macrophages show disparate sensitivity to ferroptosis. Mature DC cells express higher levels of CD86, CD80, MCHII. Ferroptosis in PMN-MDSCs plays an immunosuppressive role, which is mediated through the release of oxidized lipids and promoted by FATP2.Phosphatidylethanolamine widely exists on the ferroptosis of cell membranes, especially SAPE-OOH. Tregs play an important role in maintaining immune tolerance. Activating the function of NRF2 in NK cells can reverse the inhibitory effect on NK cells in the TME. In adaptive immunity, CD8 + Diagram illustrating the interaction between innate and adaptive immunity focusing on cellular mechanisms such as macrophages, dendritic cells, T cells, and B cells. The left side features innate immunity components like macrophages and dendritic cells with pathways involving GPX4 and LPO. The right side shows adaptive immunity detailing CD8+ T cells and B cells along with processes involving lipid peroxidation and GPX4. Arrows and labels depict cellular pathways and interactions. 3.1 Innate immunity 3.1.1 Dendritic cells Ferroptosis of early tumor cells can promote the maturation and activation of DCs, enhance the antigen-presenting function of DCs, and stimulate effector T cells to exert anti-tumor effects ( 37 38 Indeed, ferroptosis can impair DCs antigen presentation through multiple mechanisms. Early lipid ROS accumulation downregulates CD86, CD40, and MHC II expression while reducing Interleukin-12(IL-12) and Interferon-γ(IFN-γ) secretion, impairing T cell activation ( 37 37 39 The progression of ferroptosis in DCs follows a distinct temporal pattern. Initially, lipid ROS accumulation impairs DC maturation and phagocytic capacity. As the process continues, transient calreticulin (CRT) exposure and ATP release occur during an intermediate phase, though immunogenicity remains limited. Ultimately, terminal membrane rupture releases DAMPs (High Mobility Group Box 1, HMGB1, Lactate Dehydrogenase, LDH) and cytokines (Tumor Necrosis Factor, TNF, IFN-β), while permanently impairing cross-presentation capability. This phased deterioration of DC function helps explain why the timing of ferroptosis induction is so critical for immune outcomes ( 37 This timing dependence is clearly demonstrated by Efimova’s team, who showed that the GPX4 inhibitor RAS-Selective Lethal compound 3 (RSL3) stimulated ICD in tumor cells to activate DCs and induce anti-tumor immunity in an animal tumor model ( 40 41 While DCs can enhance anti-tumor immunity through multiple mechanisms including NK cell activation, their function is particularly vulnerable in the tumor microenvironment. Tumor-infiltrating DCs, which tend to accumulate more lipids, show increased susceptibility to ferroptosis and consequent antigen presentation failure ( 42 43 44 45 3.1.2 Natural killer cells NK cells, which are considered inherently immunized cells, are involved in the perforin/granzyme pathway, Factor Associated Suicide (Fas) and Factor Associated Suicide Ligand (FasL) interactions, TNF-α and TNFR-1 interactions, and antibody-dependent cytotoxicity ( 46 47 48 3.1.3 PMN-MDSCs Neutrophils, originating from the bone marrow, are the first line of defense against microbial infection ( 49 50 + 51 However, tumor-derived signals can alter bone marrow formation, leading to the expansion and pathological activation of neutrophils, called polymorphonuclear MDSCs (PMN-MDSCs) ( 52 PMN-MDSCs play an immunosuppressive role by attenuating immune responses mediated by T cells, B cells, and NK cells. PMN-MDSCs employ three distinct but interconnected mechanisms to mediate immunosuppression. First, through metabolic regulation, their lipid peroxidation products (4-HNE and Malondialdehyde, MDA) directly activate arginase-1 (ARG1) and inducible nitric oxide synthase (iNOS), effectively suppressing T cell function ( 53 54 55 56 Ferroptosis-related genes have been associated with genes found in PMN-MDSCs in various cancer types ( 54 57 58 59 Tumor-infiltrating PMN-MDSCs exhibit complex dual functions in anti-tumor immunity through ferroptosis-dependent mechanisms. These cells can promote tumor cell ferroptosis (particularly in glioblastoma), inducing tumor death and growth inhibition. Conversely, when PMN-MDSCs themselves undergo ferroptosis in the tumor microenvironment, they release lipid oxides via fatty acid transporter (FATP2)-mediated pathways, creating an immunosuppressive niche that paradoxically supports tumor progression. This immunosuppression involves the secretion of oxidized phospholipids and immunomodulatory factors that activate ARG1 and iNOS to suppress T cell proliferation ( 53 54 60 61 A comprehensive elucidation of the mechanistic interplay between PMN-MDSCs and ferroptosis, particularly regarding their tumor-type-specific regulation of immune suppression versus activation, represents a crucial unmet need in the field. 3.1.4 Tumor-associated macrophages Tumor-associated macrophages (TAMs) are the main immune cells in the TME, and a high degree of TAM infiltration often indicates a poor prognosis ( 62 63 64 3.1.4.1 Ferroptosis susceptibility in M1/M2 macrophages TAMs exhibit high plasticity, whereas the development and homeostasis of resident macrophages in lung, peritoneum, spleen and bone marrow (which can be regarded as M0 state) are not affected ( 62 In addition, CD44 is a key molecule linking ferroptosis and macrophage polarization. By regulating cell adhesion and ROS generation, it promotes the recruitment of M1 macrophages. Anti-CD44 antibodies can reduce M1 accumulation and suppress ferroptosis. Enhancer of Zeste Homolog 2 (EZH2), through epigenetic modifications, inhibits pro-inflammatory genes and may promote M2 polarization. Peroxisome Proliferator-Activated Receptor Alpha (PPARα) may indirectly reduce macrophage inflammatory responses by suppressing lipid peroxidation upon activation ( 65 The sensitivity of these two macrophage subtypes to ferroptosis is different. In most tumors, M2 macrophages express ARG1 and CD206 while secreting IL-10 and TGF-β, thereby promoting angiogenesis, matrix remodeling, and immunosuppression to maintain tumor cell growth. On the contrary, M1 macrophages express CD86 and iNOS, exerting tumor-suppressive effects by producing IL-1α/β, IL-6, TNF-α, and ROS ( 66 6 3.1.4.2 Therapeutic implications of macrophage ferroptosis Ferroptosis inducers (such as the GPX4 inhibitor RSL3) can lead to the elimination of M2 macrophages, but do not affect M1 macrophages, resulting in synergistic anti-tumor effects. Given that M1 macrophages have antitumor activity, it is necessary to focus on the transformation of M2 macrophages into the M1 phenotype in the context of ferroptosis. Studies have demonstrated that ferumoxytol, an iron oxide nanoparticle formulation, (the detailed mechanism of Fenton reaction in Section 4.2) modulates intracellular iron homeostasis and induces M1 macrophage polarization, ultimately triggering ferroptosis ( 67 Shi and Hu developed iron-doped mesoporous silica nanoparticles loaded with citrate and dextran (DFHC) ( 68 69 Furthermore, the monocyte-phagocyte system is not sensitive to ferroptosis in some cases. For instance, human peripheral blood mononuclear cells (PBMCs) are resistant to ferroptosis induced by erastin. On the contrary, erastin promotes the proliferation and differentiation of human PBMCs into B cells and NK cells by regulating bone morphogenetic protein (BMP), thereby enhancing anti-tumor immunity ( 70 71 54 The evidence demonstrates that pharmacological modulation of macrophage polarization toward the M1 phenotype by targeting ferroptosis sensitivity or epigenetic reprogramming represents a promising approach to enhancing tumoricidal immunity. 3.2 Adaptive immunity 3.2.1 CD8 + 3.2.1.1 Ferroptosis promotes CD8 + CTLs, also known as CD8 + + + 72 73 + 74 75 + + + 76 + In summary, ferroptosis-related factors interact with cytotoxic T lymphocytes (CTLs), modulating their activity and function, while CTLs reciprocally influence ferroptosis levels in tumor cells. 3.2.1.2 CD8 + IFN-γ downregulates the expression of SLC3A2 and SLC7A11 on tumor cell surfaces through the JAK-STAT1 pathway ( 34 + 77 78 + 74 CD8 + 79 80 81 Notably, the sensitivity of tumor cells and CTLs to ferroptosis in the TME remains controversial. Some studies suggest ferroptosis inducers selectively target tumor cells without compromising CTL function, thereby enhancing immunotherapy efficacy ( 82 in vitro 83 84 + 76 3.2.2 Regulatory T cells Treg cells are key inhibitory cells that maintain immune tolerance and escape of tumor cells. They are a subset of CD4 + 85 86 35 + 87 Treg cells shape the immunosuppressive TME through multiple mechanisms, with their metabolic vulnerabilities (particularly ferroptosis sensitivity) offering a critical breakthrough for reversing tumor immune escape. Targeted modulation of Treg cell survival and function holds promise for reprogramming the TME from immunosuppressive to immunostimulatory states, thereby opening new avenues for cancer immunotherapy. 3.2.3 B cells B cells produce and release antibodies against specific antigens, playing an important role in humoral immune responses ( 88 Different subtypes of B cells exhibit varying sensitivity to ferroptosis ( 89 Following CD36 binding to PUFAs, APT1-mediated depalmitoylation promotes the formation of a signaling complex between CD36 and spleen tyrosine kinase, triggering caveolae-mediated endocytosis. This process significantly increases intracellular PUFA accumulation, leading to a “lipid peroxidation storm” under GPX4-deficient conditions. While B1/MZ B cells can activate parallel antioxidant systems through exogenous CoQ10 supplementation or FSP1 overexpression, this pathway exhibits limited efficacy in follicular B cells ( 22 90 91 Altogether, ferroptosis is involved in the survival and potential anti-cancer effects of B cells. However, the specific underlying mechanisms warrant further investigation. 4 Ferroptosis in combination with immunotherapy and nanomaterials 4.1 Ferroptosis in combination with immunotherapy Immunotherapy is a recently developed anti-cancer strategy, following surgery, chemotherapy, and radiotherapy. Ferroptosis of tumor cells can enhance the anti-tumor responses of immune cells in the TME. Therefore, combining the induction of tumor cell ferroptosis with immunotherapy presents significant potential for clinical application in cancer therapy (  Table 1 Table 1 Selected ferroptosis-inducing compounds/drugs in preclinical and clinical development. Compound/Drug Caner type Target Function Type of test Reference Gemcitabine Pancreatic cancer GPX4 Inhibit the level of GPX4 Preclinical Research ( 92 Etoposide Myelogenous leukemia GPX4 Inhibit the level of GPX4 Preclinical Research ( 93 Sorafenib Hepatocellular SLC7A11 Reduce cysteine uptake Preclinical Research ( 94 Cisplatin Ovarian cancer, lung cancer, thyroid cancer, lymphosarcoma, GSH Reduce GSH Preclinical Research ( 95 Siramesine, Lapatinib Breast cancer Fe Increase the intracellular iron level Preclinical Research ( 96 97 Decitabine Myelodysplastic syndrome GPX4, GSH Decreases GSH levels and inhibits GPX4 activity Preclinical Research ( 98 Sulfasalazine Head neck cancer, Glioblastoma, Fibrosarcoma SLC7A11 Inhibit transporter XC - Phase I clinical trial NCT04205357 ( 99 101 Altretamine Diffuse large B cell lymphoma GPX4 Inhibit the level of GPX4 Preclinical Research ( 102 Statins Lung cancer GPX4 Inhibit the level of GPX4 Preclinical Research ( 103 Vorinostat Lung cancer SLC7A11 Inhibit SLC7A11 expression Preclinical Research ( 104 Olaparib Ovarian cancer SLC7A11 Suppress SLC7A11 mediated GSH synthesis Preclinical Research ( 105 Temozolomide Glioblastoma GSH Reduce GSH Phase II clinical trial NCT06218524 ( 106 NRF2, Nuclear factor erythroid 2-related factor 2; GSH, Glutathione; HO-1, Heme Oxygenase-1; ROS, Reactive Oxygen Species; GPX4, Glutathione peroxidase 4; SLC7A11, Solute carrier family 7 membrane 11. The bolded NCT04205357 NCT04205357 Programmed deathligand1 (PD-L1) is highly expressed in most tumor tissues and is closely related to the development of malignant tumors ( 107 34 in vitro + in vivo ( 108 - - 109 110 111 112 113 High CD36 expression impairs PD-1 efficacy through multiple mechanisms: In T cells, CD36-mediated lipid peroxidation triggers ferroptosis, while PD-1 signaling inhibits AKT-mTOR pathway to downregulate phospholipid phosphatase 1(PLPP1), exacerbating lipid accumulation and forming a vicious cycle of “lipid metabolism-ferroptosis-immune suppression”; In ovarian/gastric cancers, CD36-high tumor cells competitively consume lipid resources in the TME, starving T cells and inducing ferroptosis to evade immune surveillance; CD36 upregulates PD-L1 via peroxisome proliferator-activated receptor gamma (PPARγ) signaling, creating dual resistance through “lipid metabolism-immune checkpoint” crosstalk ( 114 However, immunotherapy has both advantages and disadvantages. On one hand, it enhances anti-tumor immunity by modulating CD8 + + + 115 This paradox may stem from spatiotemporal differences in metabolic competition and oxidative stress. Wang’s team demonstrated that both human and murine CD4 + + 34 + Additionally, we can identify potential biomarkers for patient stratification. For instance, Yi et al. demonstrated that the proportion of CD36 + + + + 73 116 34 Notably, ferroptosis may exacerbate immune-related adverse effects. Through lipid peroxidation and dysregulation of antioxidant systems, ferroptosis contributes to the pathogenesis of various autoimmune diseases. For example: In inflammatory bowel disease (IBD), PUFA accumulation increases intestinal epithelial cell susceptibility to ferroptosis. In rheumatoid arthritis (RA), neutrophils oxidative stress exacerbates joint damage. In systemic lupus erythematosus (SLE), ferroptosis of neutrophils promotes renal and cutaneous lesions. Targeted strategies can be employed to mitigate immune-related side effects of ferroptosis. Antibody-targeted approaches using anti-CD36/PD-L1 nanoparticles precisely act on tumor or immunosuppressive cells while avoiding damage to immune cells. Microenvironment-responsive designs enable pH/ROS-triggered nanocarriers for localized drug release, thereby reducing systemic toxicity. Antioxidant protection can be achieved by delivering Ferrostatin-1 or vitamin E to normal tissues ( 117 4.2 Ferroptosis in combination with nanomaterials As mentioned in Section 3.1.4.2, nanomaterials such as ferumoxytol and DFHC can enhance ferroptosis by targeting iron metabolism of macrophages. This section will systematically categorize the design mechanisms of these nanomaterials and analyze their relationship with immunomodulation. Advances in cancer ferroptosis and nanotechnology have propelled the design of both iron-based and non-ferrous nanomaterials for ferroptosis regulation as a major research frontier. (  Table 2 ). Table 2 Examples of ferroptosis-modulating nanomaterials categorized by material type and mechanism. Nanoparticle Material type Encapsulation Mechanism Reference FeGd-HN@Pt@LF/RGD2 IONPS Fe3O4, Gd2O3 Promote Fenton reaction ( 118 Mn3[Co(CN)6] 2 MOFS Artesunate, Fe 3+ Promote Fenton reaction ( 119 FePt@MnO@DSPE-PEG5000-FA FePt Fe 2+ 2+ Promote Fenton reaction and Increase ROS ( 120 LDL-DHA Self-assembled nanoparticles low-density, lipoprotein, docosahexaenoic acid GSH depletion, GPX4 inhibition and Lipid peroxidation ( 121 MMSNs Self-assembled nanoparticles Mn 2+ 2 GSH exhaustion and ROS overloading ( 122 bcc-USINPs Single-Crystal Fe Nanoparticle Fe 2+ Fe 2+ ( 123 Carbon Nanoparticles−Fe (II) Self-assembled nanoparticles Fe 2+ ROS overgeneration, NCT06048367 ( 124 SRF@FeIIITA (SFT) Self-assembled nanoparticles Fe 3+ LPO increasing ( 125 Silica nanoparticles Self-assembled nanoparticles Poly (ethylene glycol), peptides ROS overgeneration ( 126 Erastin@FA-exo Exosome Erastin GPX4 inhibition, CDO1 increasing and ROS overloading ( 127 TCLMS Self-assembled nanoparticles Lactose, Triapine, Ce6 Promote Fenton reaction, Increase chemophotodynamic therapy and Increase ROS ( 128 RF@LA-Fe-MOF Self-assembled nanoparticles Fe, lactobionic acid, RSL3 and iFSP1 GPX4 and FSP1 inhibition, Lipid peroxidation ( 129 IONPS, Iron oxide nanoparticles; MOFS, metal-organic frameworks; LPO: Lipid Hydroperoxide; ROS, reactive oxygenspecies; GSH, Glutathione; GPX4, Glutathione peroxidase 4; CDO1, cysteine dioxygenase 1; Ce6, Chlorin e6; FSP1, Ferroptosis suppressor protein 1; iFSP1, inhibitor of ferroptosis suppressor protein 1. 4.2.1 Iron-based nanomaterials Iron-based nanomaterials account for a large proportion of nanoscale ferroptosis inducers, as iron itself is the key component of ROS produced by Fenton reaction and the process of ferroptosis depends on iron. Iron oxide nanoparticles (IONPs) are key iron-based nanomaterials capable of inducing tumor ferroptosis ( 130 118 + + 2 2 + + 119 120 + 2 2 + + 123 + 125 + 2 2 131 127 4.2.2 Non-ferrous nanomaterials While iron-free nanomaterials show biomedical potential, their application in ferroptosis-targeted cancer therapy remains limited due to iron’s central role in this process. Kim et al. engineered sub-10 nm peptide/PEG-modified SiO 2 126 121 132 122 4.2.3 Previous work of our team Our team has advanced tumor ferroptosis-regulation nanomaterials, mirroring current research trends. We pioneered lactose-modified TCLM nanomicelles co-delivering Triapine/Ce6 as the first nano-DDS for Triapine-based therapy ( 128 129 We summarized common design principles emerging from research. In the field of targeted delivery, ligands such as lactobionic acid, folic acid, and apolipoproteins or targeting antibodies (e.g., PD-L1) have been utilized, thereby enhancing antitumor efficacy, improving tumor accumulation, and reducing off-target toxicity. Regarding stimuli-responsive strategies, leveraging TME features such as low pH, high GSH, and high ROS, Wang’s team constructed a dual tumor-feature (ATP and acidity) unlocked nanoplatform to amplify ferroptotic damage for efficient ferroptosis-based therapy ( 133 134 135 118 2 120 122 127 129 125 128 136 However, clinical translation faces several challenges: difficulties in large-scale production of complex nanostructures requiring precise control of layered compositions ( 118 137 138 139 140 4.3 Ongoing clinical trials Current clinical trials investigating ferroptosis in oncology remain limited in number and are predominantly in early-phase development, such as NCT06218524 106 in vivo in vitro NCT06048367 124 NCT04205357 NCT05924074 141 142 Current clinical trials in ferroptosis research encounter multiple significant challenges. The absence of reliable ferroptosis-specific biomarkers complicates patient stratification, introducing substantial experimental variability. Methodological limitations persist, as conventional lipid peroxidation detection techniques such as fluorescent probes prove inadequate for tissue analysis or in vivo in vitro in vivo 5 Concluding remarks and future perspectives Ferroptosis is a recently discovered iron-dependent programmed cell death mode. In this review, we further summarized the ferroptosis of innate and adaptive immune cells in the TME and discussed key genes regulating the sensitivity of these cells to ferroptosis. In recent years, traditional anti-cancer therapies, such as chemotherapy and radiotherapy, are not always effective owing to the wide range of targets and tumor cell resistance. Compared with these therapies, immunotherapy has the advantages of remarkable curative effects, long-lasting effects and fewer side effects. Ferroptosis has been shown to enhance the anti-tumor effects of immune cells, inhibit tumor growth, prolong the survival time of patients and improve the quality of life. Meanwhile, the combined application of ferroptosis and nanomaterials is currently a research hotspot, nanomaterials have both promising therapeutic avenues and major challenges. Moreover, clinical trials investigating the therapeutic potential of ferroptosis regulators in cancer are underway ( NCT06048367 NCT06218524 NCT04205357 NCT05924074 The central challenge in harnessing ferroptosis for immunotherapy lies in achieving cellular selectivity within the TME. Current strategies often lack specificity, risking collateral damage to immunostimulatory cells. Future work should focus on: Biomarker-guided targeting: Studies indicate that activated lymphocytes exhibit higher expression of TfR1 ( 143 144 145 146 + 147 + + 148 + + 149 This review is the first to systematically delineate the differential ferroptosis responses among immune cell subsets, revealing their dual role in antitumor immunity. By innovatively proposing the “Ferroptosis Immunomodulation Index (FII)”, we provide a novel benchmark for precision cancer therapy. Beyond deciphering the metabolic and signaling networks of immune cell ferroptosis, we introduced a groundbreaking “biomarker-guided, cell-selective modulation” strategy, bridging the gap between mechanism and clinical translation. This framework, integrating theoretical depth and therapeutic innovation, offers a transformative perspective for the combined application with immunotherapy and nanomaterials. Future directions should focus on developing humanized models (e.g., organoid-immune cocultures), combination strategies to accelerate clinical implementation. Create targeted ferroptosis therapies through three key approaches: first, by designing cell-specific inducers with advanced delivery platforms to achieve precise tumor targeting; second, by discovering definitive ferroptosis biomarkers and developing dynamic imaging modalities for accurate disease monitoring; finally, by addressing therapeutic resistance pathways including FSP1-mediated defense mechanisms in malignant cells to maintain long-term treatment effectiveness. Together, these strategic approaches will bridge the gap between ferroptosis research and clinical translation, ultimately enabling precision cancer therapies that selectively exploit this vulnerability while overcoming treatment barriers. Acknowledgments   Figures 1  3 Author contributions WW: Writing – original draft, Writing – review & editing. HL: Writing – review & editing. SL: Writing – review & editing. YH: Writing – review & editing. JD: Funding acquisition, Writing – review & editing. XW: Funding acquisition, Writing – review & editing. DH: Funding acquisition, Writing – review & editing, Supervision. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1 Dixon SJ Lemberg KM Lamprecht MR Skouta R Zaitsev EM Gleason CE Ferroptosis: an iron-dependent form of nonapoptotic cell death Cell 2012 149 1060–72 10.1016/j.cell.2012.03.042 22632970 PMC3367386 2 Jiang X Stockwell BR Conrad M Ferroptosis: mechanisms, biology and role in disease Nat Rev Mol Cell Biol 2021 22 266–82 10.1038/s41580-020-00324-8 33495651 PMC8142022 3 Chen X Kang R Kroemer G Tang D Broadening horizons: the role of ferroptosis in cancer Nat Rev Clin Oncol 2021 18 280–96 10.1038/s41571-020-00462-0 33514910 4 Kim R Taylor D Vonderheide RH Gabrilovich DI Ferroptosis of immune cells in the tumor microenvironment Trends Pharmacol Sci 2023 44 542–52 10.1016/j.tips.2023.06.005 37380530 5 Chen X Kang R Kroemer G Tang D Ferroptosis in infection, inflammation, and immunity J Exp Med 2021 218 e20210518 10.1084/jem.20210518 33978684 PMC8126980 6 Xu S Min J Wang F Ferroptosis: an emerging player in immune cells Sci Bull 2021 66 2257–60 10.1016/j.scib.2021.02.026 36654451 7 Luo L Wang H Tian W Li X Zhu Z Huang R Targeting ferroptosis-based cancer therapy using nanomaterials: strategies and applications Theranostics 2021 11 9937–52 10.7150/thno.65480 34815796 PMC8581438 8 Zhao L Zhou X Xie F Zhang L Yan H Huang J Ferroptosis in cancer and cancer immunotherapy Cancer Commun Lond Engl 2022 42 88 116 10.1002/cac2.12250 35133083 PMC8822596 9 Wang H Liu C Zhao Y Gao G Mitochondria regulation in ferroptosis Eur J Cell Biol 2020 99 151058 10.1016/j.ejcb.2019.151058 31810634 10 Rochette L Dogon G Rigal E Zeller M Cottin Y Vergely C Lipid peroxidation and iron metabolism: two corner stones in the homeostasis control of ferroptosis Int J Mol Sci 2022 24 449 10.3390/ijms24010449 36613888 PMC9820499 11 Ma TL Chen JX Zhu P Zhang CB Zhou Y Duan JX Focus on ferroptosis regulation: Exploring novel mechanisms and applications of ferroptosis regulator Life Sci 2022 307 120868 10.1016/j.lfs.2022.120868 35940216 12 Brigelius-Flohé R Maiorino M Glutathione peroxidases Biochim Biophys Acta 2013 1830 3289–303 10.1016/j.bbagen.2012.11.020 23201771 13 Dai Y Cui C Jiao D Zhu X JAK/STAT signaling as a key regulator of ferroptosis: mechanisms and therapeutic potentials in cancer and diseases Cancer Cell Int 2025 25 83 10.1186/s12935-025-03681-6 40055704 PMC11889932 14 Wang H An P Xie E Wu Q Fang X Gao H Characterization of ferroptosis in murine models of hemochromatosis Hepatol Baltim Md 2017 66 449–65 10.1002/hep.29117 28195347 PMC5573904 15 Gao M Monian P Pan Q Zhang W Xiang J Jiang X Ferroptosis is an autophagic cell death process Cell Res 2016 26 1021–32 10.1038/cr.2016.95 27514700 PMC5034113 16 Zheng J Conrad M The metabolic underpinnings of ferroptosis Cell Metab 2020 32 920–37 10.1016/j.cmet.2020.10.011 33217331 17 Alim I Caulfield JT Chen Y Swarup V Geschwind DH Ivanova E Selenium drives a transcriptional adaptive program to block ferroptosis and treat stroke Cell 2019 177 1262 1279.e25 10.1016/j.cell.2019.03.032 31056284 18 Anderton B Camarda R Balakrishnan S Balakrishnan A Kohnz RA Lim L MYC-driven inhibition of the glutamate-cysteine ligase promotes glutathione depletion in liver cancer EMBO Rep 2017 18 569–85 10.15252/embr.201643068 28219903 PMC5376764 19 Viswanathan VS Ryan MJ Dhruv HD Gill S Eichhoff OM Seashore-Ludlow B Dependency of a therapy-resistant state of cancer cells on a lipid peroxidase pathway Nature 2017 547 453–7 10.1038/nature23007 28678785 PMC5667900 20 Li W Liang L Liu S Yi H Zhou Y FSP1: a key regulator of ferroptosis Trends Mol Med 2023 29 753–64 10.1016/j.molmed.2023.05.013 37357101 21 Doll S Freitas FP Shah R Aldrovandi M da Silva MC Ingold I FSP1 is a glutathione-independent ferroptosis suppressor Nature 2019 575 693–8 10.1038/s41586-019-1707-0 31634899 22 Bersuker K Hendricks JM Li Z Magtanong L Ford B Tang PH The CoQ oxidoreductase FSP1 acts parallel to GPX4 to inhibit ferroptosis Nature 2019 575 688–92 10.1038/s41586-019-1705-2 31634900 PMC6883167 23 Kraft VAN Bezjian CT Pfeiffer S Ringelstetter L Müller C Zandkarimi F GTP cyclohydrolase 1/tetrahydrobiopterin counteract ferroptosis through lipid remodeling ACS Cent Sci 2020 6 41 53 10.1021/acscentsci.9b01063 31989025 PMC6978838 24 Soula M Weber RA Zilka O Alwaseem H La K Yen F Metabolic determinants of cancer cell sensitivity to canonical ferroptosis inducers Nat Chem Biol 2020 16 1351–60 10.1038/s41589-020-0613-y 32778843 PMC8299533 25 Feng Y Feng Y Gu L Mo W Wang X Song B Tetrahydrobiopterin metabolism attenuates ROS generation and radiosensitivity through LDHA S-nitrosylation: novel insight into radiogenic lung injury Exp Mol Med 2024 56 1107–22 10.1038/s12276-024-01208-z 38689083 PMC11148139 26 Mao C Liu X Zhang Y Lei G Yan Y Lee H DHODH-mediated ferroptosis defence is a targetable vulnerability in cancer Nature 2021 593 586–90 10.1038/s41586-021-03539-7 33981038 PMC8895686 27 Liang D Minikes AM Jiang X Ferroptosis at the intersection of lipid metabolism and cellular signaling Mol Cell 2022 82 2215–27 10.1016/j.molcel.2022.03.022 35390277 PMC9233073 28 Hänggi K Ruffell B Cell death, therapeutics, and the immune response in cancer Trends Cancer 2023 9 381–96 10.1016/j.trecan.2023.02.001 36841748 PMC10121860 29 Tang D Kroemer G Kang R Ferroptosis in immunostimulation and immunosuppression Immunol Rev 2024 321 199 210 10.1111/imr.13235 37424139 30 Bianchi ME Crippa MP Manfredi AA Mezzapelle R Rovere Querini P Venereau E High-mobility group box 1 protein orchestrates responses to tissue damage via inflammation, innate and adaptive immunity, and tissue repair Immunol Rev 2017 280 74 82 10.1111/imr.12601 29027228 31 Krysko DV Garg AD Kaczmarek A Krysko O Agostinis P Vandenabeele P Immunogenic cell death and DAMPs in cancer therapy Nat Rev Cancer 2012 12 860–75 10.1038/nrc3380 23151605 32 Dai E Han L Liu J Xie Y Kroemer G Klionsky DJ Autophagy-dependent ferroptosis drives tumor-associated macrophage polarization via release and uptake of oncogenic KRAS protein Autophagy 2020 11) 2069–83 10.1080/15548627.2020.1714209 31920150 PMC7595620 33 Matsushita M Freigang S Schneider C Conrad M Bornkamm GW Kopf M T cell lipid peroxidation induces ferroptosis and prevents immunity to infection J Exp Med 2015 212 555–68 10.1084/jem.20140857 25824823 PMC4387287 34 Wang W Green M Choi JE Gijón M Kennedy PD Johnson JK CD8+ T cells regulate tumour ferroptosis during cancer immunotherapy Nature 2019 569 270–4 10.1038/s41586-019-1170-y 31043744 PMC6533917 35 Xu C Sun S Johnson T Qi R Zhang S Zhang J The glutathione peroxidase Gpx4 prevents lipid peroxidation and ferroptosis to sustain Treg cell activation and suppression of antitumor immunity Cell Rep 2021 35 109235 10.1016/j.celrep.2021.109235 34133924 36 Yao L Hou J Wu X Lu Y Jin Z Yu Z Cancer-associated fibroblasts impair the cytotoxic function of NK cells in gastric cancer by inducing ferroptosis via iron regulation Redox Biol 2023 67 102923 10.1016/j.redox.2023.102923 37832398 PMC10582581 37 Wiernicki B Maschalidi S Pinney J Adjemian S Vanden Berghe T Ravichandran KS Cancer cells dying from ferroptosis impede dendritic cell-mediated anti-tumor immunity Nat Commun 2022 13 3676 10.1038/s41467-022-31218-2 35760796 PMC9237053 38 Rothe T Gruber F Uderhardt S Ipseiz N Rössner S Oskolkova O 12/15-Lipoxygenase-mediated enzymatic lipid oxidation regulates DC maturation and function J Clin Invest 2015 125 1944–54 10.1172/JCI78490 25844901 PMC4463199 39 Gu X Liu Y Dai X Yang YG Zhang X Deciphering the potential roles of ferroptosis in regulating tumor immunity and tumor immunotherapy Front Immunol 2023 14 1137107 10.3389/fimmu.2023.1137107 36926345 PMC10011099 40 Efimova I Catanzaro E van der Meeren L Turubanova VD Hammad H Mishchenko TA Vaccination with early ferroptotic cancer cells induces efficient antitumor immunity J Immunother Cancer 2020 8 e001369 10.1136/jitc-2020-001369 33188036 PMC7668384 41 Del Prete A Salvi V Soriani A Laffranchi M Sozio F Bosisio D Dendritic cell subsets in cancer immunity and tumor antigen sensing Cell Mol Immunol 2023 20 432–47 10.1038/s41423-023-00990-6 36949244 PMC10203372 42 Plebanek MP Xue Y Nguyen YV DeVito NC Wang X Holtzhausen A A lactate-SREBP2 signaling axis drives tolerogenic dendritic cell maturation and promotes cancer progression Sci Immunol 2024 9 eadi4191 10.1126/sciimmunol.adi4191 38728412 PMC11926670 43 Venkatesh D O’Brien NA Zandkarimi F Tong DR Stokes ME Dunn DE MDM2 and MDMX promote ferroptosis by PPARα-mediated lipid remodeling Genes Dev 2020 34 526–43 10.1101/gad.334219.119 32079652 PMC7111265 44 Li JY Ren C Wang LX Yao RQ Dong N Wu Y Sestrin2 protects dendrite cells against ferroptosis induced by sepsis Cell Death Dis 2021 12 834 10.1038/s41419-021-04122-8 34482365 PMC8418614 45 Cubillos-Ruiz JR Silberman PC Rutkowski MR Chopra S Perales-Puchalt A Song M ER stress sensor XBP1 controls anti-tumor immunity by disrupting dendritic cell homeostasis Cell 2015 161 1527–38 10.1016/j.cell.2015.05.025 26073941 PMC4580135 46 Wolf NK Kissiov DU Raulet DH Roles of natural killer cells in immunity to cancer, and applications to immunotherapy Nat Rev Immunol 2023 23 90 105 10.1038/s41577-022-00732-1 35637393 47 Poznanski SM Singh K Ritchie TM Aguiar JA Fan IY Portillo AL Metabolic flexibility determines human NK cell functional fate in the tumor microenvironment Cell Metab 2021 33 1205 1220.e5 10.1016/j.cmet.2021.03.023 33852875 48 Abdelbaset A Jouda A Pasha H Soliman A Toam M Elkhashab M Value of ascitic fluid lipids in the differentiation between cirrhotic and Malignant ascites Clin Cancer Investig J 2019 8 205 10.4103/ccij.ccij_53_19 49 Mayadas TN Cullere X Lowell CA The multifaceted functions of neutrophils Annu Rev Pathol 2014 9 181 218 10.1146/annurev-pathol-020712-164023 24050624 PMC4277181 50 Coffelt SB Wellenstein MD De Visser KE Neutrophils in cancer: neutral no more Nat Rev Cancer 2016 16 431–46 10.1038/nrc.2016.52 27282249 51 Wang Z Shen J Ye K Zhao J Huang S He S Neutrophil-derived IL-6 potentially drives ferroptosis resistance in B cells in lupus kidney Mediators Inflamm 2023 2023 9810733 10.1155/2023/9810733 37273451 PMC10239302 52 Gabrilovich DI Ostrand-Rosenberg S Bronte V Coordinated regulation of myeloid cells by tumours Nat Rev Immunol 2012 12 253–68 10.1038/nri3175 22437938 PMC3587148 53 Ibrahim A Mohamady Farouk Abdalsalam N Liang Z Kashaf Tariq H Li R O Afolabi L MDSC checkpoint blockade therapy: a new breakthrough point overcoming immunosuppression in cancer immunotherapy Cancer Gene Ther 2025 32 371–92 10.1038/s41417-025-00886-9 40140724 PMC11976280 54 Kim R Hashimoto A Markosyan N Tyurin VA Tyurina YY Kar G Ferroptosis of tumour neutrophils causes immune suppression in cancer Nature 2022 612 338–46 10.1038/s41586-022-05443-0 36385526 PMC9875862 55 Veglia F Sanseviero E Gabrilovich DI Myeloid-derived suppressor cells in the era of increasing myeloid cell diversity Nat Rev Immunol 2021 21 485–98 10.1038/s41577-020-00490-y 33526920 PMC7849958 56 LV B Wang Y Ma D Cheng W Liu J Yong T Immunotherapy: reshape the tumor immune microenvironment Front Immunol 2022 13 844142 10.3389/fimmu.2022.844142 35874717 PMC9299092 57 Zhang Y Song J Zhao Z Yang M Chen M Liu C Single-cell transcriptome analysis reveals tumor immune microenvironment heterogenicity and granulocytes enrichment in colorectal cancer liver metastases Cancer Lett 2020 470 84 94 10.1016/j.canlet.2019.10.016 31610266 58 Zhu H Klement J Lu C Redd PS Yang D Smith AD Asah2 represses the p53-Hmox1 axis to protect myeloid-derived suppressor cells from ferroptosis J Immunol Baltim Md 1950 2021 206 1395–404 10.4049/jimmunol.2000500 33547170 PMC7946776 59 Condamine T Mastio J Gabrilovich DI Transcriptional regulation of myeloid-derived suppressor cells J Leukoc Biol 2015 98 913–22 10.1189/jlb.4RI0515-204R 26337512 PMC4661041 60 Conche C Finkelmeier F Pešić M Nicolas AM Böttger TW Kennel KB Combining ferroptosis induction with MDSC blockade renders primary tumours and metastases in liver sensitive to immune checkpoint blockade Gut 2023 72 1774–82 10.1136/gutjnl-2022-327909 36707233 PMC10423492 61 Zhu L Yu X Cao T Deng H Tang X Lin Q Immune cell membrane-based biomimetic nanomedicine for treating cancer metastasis Acta Pharm Sin B 2023 13 2464–82 10.1016/j.apsb.2023.03.004 37425034 PMC10326251 62 Ngambenjawong C Gustafson HH Pun SH Progress in tumor-associated macrophage (TAM)-targeted therapeutics Adv Drug Delivery Rev 2017 114 206–21 10.1016/j.addr.2017.04.010 28449873 PMC5581987 63 Kwak T Wang F Deng H Condamine T Kumar V Perego M Distinct populations of immune-suppressive macrophages differentiate from monocytic myeloid-derived suppressor cells in cancer Cell Rep 2020 33 108571 10.1016/j.celrep.2020.108571 33378668 PMC7809772 64 Geissmann F Manz MG Jung S Sieweke MH Merad M Ley K Development of monocytes, macrophages, and dendritic cells Science 2010 327 656–61 10.1126/science.1178331 20133564 PMC2887389 65 Zhou Y Yang Y Wang B Chen W Wei Y Wu R Discovery of ferroptosis-related genes in renal ischemia reperfusion and evaluate the potential impact on kidney transplantation Front Immunol 2024 15 1394477 10.3389/fimmu.2024.1394477 39308866 PMC11412852 66 Cheng K Cai N Zhu J Yang X Liang H Zhang W Tumor-associated macrophages in liver cancer: From mechanisms to therapy Cancer Commun Lond Engl 2022 42 1112–40 10.1002/cac2.12345 36069342 PMC9648394 67 Zanganeh S Hutter G Spitler R Lenkov O Mahmoudi M Shaw A Iron oxide nanoparticles inhibit tumour growth by inducing pro-inflammatory macrophage polarization in tumour tissues Nat Nanotechnol 2016 11 986–94 10.1038/nnano.2016.168 27668795 PMC5198777 68 Feng Q Fang W Guo Y Hu P Shi J Nebulized therapy of early orthotopic lung cancer by iron-based nanoparticles: macrophage-regulated ferroptosis of cancer stem cells J Am Chem Soc 2023 145 24153–65 10.1021/jacs.3c08032 37897426 69 Wei G Sun J Luan W Hou Z Wang S Cui S Natural product albiziabioside A conjugated with pyruvate dehydrogenase kinase inhibitor dichloroacetate to induce apoptosis-ferroptosis-M2-TAMs polarization for combined cancer therapy J Med Chem 2019 62 8760–72 10.1021/acs.jmedchem.9b00644 31509699 70 Wang D Xie N Gao W Kang R Tang D The ferroptosis inducer erastin promotes proliferation and differentiation in human peripheral blood mononuclear cells Biochem Biophys Res Commun 2018 503 1689–95 10.1016/j.bbrc.2018.07.100 30049441 PMC6179365 71 Singh KS Leu JIJ Barnoud T Vonteddu P Gnanapradeepan K Lin C African-centric TP53 variant increases iron accumulation and bacterial pathogenesis but improves response to malaria toxin Nat Commun 2020 11 473 10.1038/s41467-019-14151-9 31980600 PMC6981190 72 Subramanian M Marelli-Berg FM CD36 pumps fat to defang killer T cells in tumors Cell Metab 2021 33 1509–11 10.1016/j.cmet.2021.07.004 34348095 73 Ma X Xiao L Liu L Ye L Su P Bi E CD36-mediated ferroptosis dampens intratumoral CD8+ T cell effector function and impairs their antitumor ability Cell Metab 2021 33 1001 1012.e5 10.1016/j.cmet.2021.02.015 33691090 PMC8102368 74 Liao P Wang W Wang W Kryczek I Li X Bian Y CD8+ T cells and fatty acids orchestrate tumor ferroptosis and immunity via ACSL4 Cancer Cell 2022 40 365 378.e6 10.1016/j.ccell.2022.02.003 35216678 PMC9007863 75 Xu S Chaudhary O Rodríguez-Morales P Sun X Chen D Zappasodi R Uptake of oxidized lipids by the scavenger receptor CD36 promotes lipid peroxidation and dysfunction in CD8+ T cells in tumors Immunity 2021 54 1561 1577.e7 10.1016/j.immuni.2021.05.003 34102100 PMC9273026 76 Li S Ouyang X Sun H Jin J Chen Y Li L DEPDC5 protects CD8+ T cells from ferroptosis by limiting mTORC1-mediated purine catabolism Cell Discov 2024 10 53 10.1038/s41421-024-00682-z 38763950 PMC11102918 77 Doll S Proneth B Tyurina YY Panzilius E Kobayashi S Ingold I ACSL4 dictates ferroptosis sensitivity by shaping cellular lipid composition Nat Chem Biol 2017 13 91–8 10.1038/nchembio.2239 27842070 PMC5610546 78 Shintoku R Takigawa Y Yamada K Kubota C Yoshimoto Y Takeuchi T Lipoxygenase-mediated generation of lipid peroxides enhances ferroptosis induced by erastin and RSL3 Cancer Sci 2017 108 2187–94 10.1111/cas.13380 28837253 PMC5666033 79 Pan X Wang J Zhang L Li G Huang B Metabolic plasticity of T cell fate decision Chin Med J (Engl) 2024 137 762–75 10.1097/CM9.0000000000002989 38086394 PMC10997312 80 Guo C You Z Shi H Sun Y Du X Palacios G SLC38A2 and glutamine signalling in cDC1s dictate anti-tumour immunity Nature 2023 620 200–8 10.1038/s41586-023-06299-8 37407815 PMC10396969 81 Kurniawan H FranChina DG Guerra L Bonetti L Soriano-Baguet L Grusdat M Glutathione restricts serine metabolism to preserve regulatory T cell function Cell Metab 2020 31 920 936.e7 10.1016/j.cmet.2020.03.004 32213345 PMC7265172 82 Lang X Green MD Wang W Yu J Choi JE Jiang L Radiotherapy and immunotherapy promote tumoral lipid oxidation and ferroptosis via synergistic repression of SLC7A11 Cancer Discov 2019 12) 1673–85 10.1158/2159-8290.CD-19-0338 31554642 PMC6891128 83 Ma T Du J Zhang Y Wang Y Wang B Zhang T GPX4-independent ferroptosis-a new strategy in disease’s therapy Cell Death Discov 2022 8 434 10.1038/s41420-022-01212-0 36309489 PMC9617873 84 Du Y Guo Z Recent progress in ferroptosis: inducers and inhibitors Cell Death Discov 2022 8 501 10.1038/s41420-022-01297-7 36581640 PMC9800531 85 Nishikawa H Koyama S Mechanisms of regulatory T cell infiltration in tumors: implications for innovative immune precision therapies J Immunother Cancer 2021 9 e002591 10.1136/jitc-2021-002591 34330764 PMC8327843 86 Li C Jiang P Wei S Xu X Wang J Regulatory T cells in tumor microenvironment: new mechanisms, potential therapeutic strategies and future prospects Mol Cancer 2020 19 116 10.1186/s12943-020-01234-1 32680511 PMC7367382 87 Chen SMY Popolizio V Woolaver RA Ge H Krinsky AL John J Differential responses to immune checkpoint inhibitor dictated by pre-existing differential immune profiles in squamous cell carcinomas caused by same initial oncogenic drivers J Exp Clin Cancer Res CR 2022 41 123 10.1186/s13046-022-02337-x 35366939 PMC8976353 88 Muri J Thut H Bornkamm GW Kopf M B1 and marginal zone B cells but not follicular B2 cells require gpx4 to prevent lipid peroxidation and ferroptosis Cell Rep 2019 29 2731 2744.e4 10.1016/j.celrep.2019.10.070 31775041 89 Caro-Maldonado A Wang R Nichols AG Kuraoka M Milasta S Sun LD Metabolic reprogramming is required for antibody production that is suppressed in anergic but exaggerated in chronically BAFF-exposed B cells J Immunol 2014 192 3626–36 10.4049/jimmunol.1302062 24616478 PMC3984038 90 Liu H Shen L Gong X Zhou X Huang Y Zhou Y Mechanistic insights into the iron-sulfur cluster-dependent interaction of the autophagy receptor NCOA4 with the E3 ligase HERC2 Proc Natl Acad Sci U S A 2025 122 e2510269122 10.1073/pnas.2510269122 40705422 PMC12318192 91 Martinis E Tonon S Colamatteo A La Cava A Matarese G Pucillo CEM B cell immunometabolism in health and disease Nat Immunol 2025 26 366–77 10.1038/s41590-025-02102-0 39984733 92 Zhu S Zhang Q Sun X Zeh HJ Lotze MT Kang R HSPA5 regulates ferroptotic cell death in cancer cells Cancer Res 2017 77 2064–77 10.1158/0008-5472.CAN-16-1979 28130223 PMC5392369 93 Kagan VE Mao G Qu F Angeli JPF Doll S Croix CS Oxidized arachidonic and adrenic PEs navigate cells to ferroptosis Nat Chem Biol 2017 13 81 90 10.1038/nchembio.2238 27842066 PMC5506843 94 Su Y Zhao B Zhou L Zhang Z Shen Y Lv H Ferroptosis, a novel pharmacological mechanism of anti-cancer drugs Cancer Lett 2020 483 127–36 10.1016/j.canlet.2020.02.015 32067993 95 Lin Q Li S Jin H Cai H Zhu X Yang Y Mitophagy alleviates cisplatin-induced renal tubular epithelial cell ferroptosis through ROS/HO-1/GPX4 axis Int J Biol Sci 2023 19 1192–210 10.7150/ijbs.80775 36923942 PMC10008689 96 Ma S Henson ES Chen Y Gibson SB Ferroptosis is induced following siramesine and lapatinib treatment of breast cancer cells Cell Death Dis 2016 7 e2307–7 10.1038/cddis.2016.208 27441659 PMC4973350 97 Sun L Wang H Xu D Yu S Zhang L Li X Lapatinib induces mitochondrial dysfunction to enhance oxidative stress and ferroptosis in doxorubicin-induced cardiomyocytes via inhibition of PI3K/AKT signaling pathway Bioengineered 2002 13 48 60 10.1080/21655979.2021.2004980 34898356 PMC8805895 98 Lv Q Niu H Yue L Liu J Yang L Liu C Abnormal ferroptosis in myelodysplastic syndrome Front Oncol 2020 10 1656 10.3389/fonc.2020.01656 32984038 PMC7492296 99 Sun X Ou Z Chen R Niu X Chen D Kang R Activation of the p62-Keap1-NRF2 Pathway Protects against Ferroptosis in Hepatocellular Carcinoma Cells Hepatol Baltim Md 2016 63 173–84 10.1002/hep.28251 26403645 PMC4688087 100 Polewski MD Reveron-Thornton RF Cherryholmes GA Marinov GK Cassady K Aboody KS Increased expression of system xc– in glioblastoma confers an altered metabolism and chemoresistance Mol Cancer Res MCR 2016 14 1229–42 10.1158/1541-7786.MCR-16-0028 27658422 PMC6237285 101 Sleire L Skeie BS Netland IA Førde HE Dodoo E Selheim F Drug repurposing: sulfasalazine sensitizes gliomas to gamma knife radiosurgery by blocking cystine uptake through system Xc-, leading to glutathione depletion Oncogene 2015 34 5951–9 10.1038/onc.2015.60 25798841 102 Ye L Jin F Kumar SK Dai Y The mechanisms and therapeutic targets of ferroptosis in cancer Expert Opin Ther Targets 2021 25 965–86 10.1080/14728222.2021.2011206 34821176 103 Hung MS Chen IC Lee CP Huang RJ Chen PC Tsai YH Statin improves survival in patients with EGFR-TKI lung cancer: A nationwide population-based study PLoS One 2017 12 e0171137 10.1371/journal.pone.0171137 28158206 PMC5291515 104 Zhang T Sun B Zhong C Xu K Wang Z Hofman P Targeting histone deacetylase enhances the therapeutic effect of Erastin-induced ferroptosis in EGFR-activating mutant lung adenocarcinoma Transl Lung Cancer Res 2021 10 1857–72 10.21037/tlcr-21-303 34012798 PMC8107764 105 Hong T Lei G Chen X Li H Zhang X Wu N PARP inhibition promotes ferroptosis via repressing SLC7A11 and synergizes with ferroptosis inducers in BRCA-proficient ovarian cancer Redox Biol 2021 42 101928 10.1016/j.redox.2021.101928 33722571 PMC8113041 106 Shi L Chen H Chen K Zhong C Song C Huang Y The DRD2 antagonist haloperidol mediates autophagy-induced ferroptosis to increase temozolomide sensitivity by promoting endoplasmic reticulum stress in glioblastoma Clin Cancer Res Off J Am Assoc Cancer Res 2023 29 3172–88 10.1158/1078-0432.CCR-22-3971 37249604 107 Topalian SL Taube JM Pardoll DM Neoadjuvant checkpoint blockade for cancer immunotherapy Science 2020 367 eaax0182 10.1126/science.aax0182 32001626 PMC7789854 108 Li H Sun Y Yao Y Ke S Zhang N Xiong W USP8-governed GPX4 homeostasis orchestrates ferroptosis and cancer immunotherapy Proc Natl Acad Sci U S A 2024 121 e2315541121 10.1073/pnas.2315541121 38598341 PMC11032464 109 Liu N Zhang J Yin M Liu H Zhang X Li J Inhibition of xCT suppresses the efficacy of anti-PD-1/L1 melanoma treatment through exosomal PD-L1-induced macrophage M2 polarization Mol Ther J Am Soc Gene Ther 2021 29 2321–34 10.1016/j.ymthe.2021.03.013 33744468 PMC8261162 110 Li N Zuo R He Y Gong W Wang Y Chen L PD-L1 induces autophagy and primary resistance to EGFR–TKIs in EGFR-mutant lung adenocarcinoma via the MAPK signaling pathway Cell Death Dis 2024 15 8 555 10.1038/s41419-024-06945-7 39090096 PMC11294607 111 Kasikova L Rakova J Hensler M Lanickova T Tomankova J Pasulka J Tertiary lymphoid structures and B cells determine clinically relevant T cell phenotypes in ovarian cancer Nat Commun 2024 15 2528 10.1038/s41467-024-46873-w 38514660 PMC10957872 112 Jiang Y Wang Y Chen G Sun F Wu Q Huang Q Nicotinamide metabolism face-off between macrophages and fibroblasts manipulates the microenvironment in gastric cancer Cell Metab 2024 36 1806 1822.e11 10.1016/j.cmet.2024.05.013 38897198 113 Mao W Cai Y Chen D Jiang G Xu Y Chen R Statin shapes inflamed tumor microenvironment and enhances immune checkpoint blockade in non-small cell lung cancer JCI Insight 2022 7 e161940 10.1172/jci.insight.161940 35943796 PMC9675559 114 Szeles L Torocsik D Nagy L PPARγ in immunity and inflammation: cell types and diseases Biochim Biophys Acta BBA - Mol Cell Biol Lipids 2007 1771 1014–30 10.1016/j.bbalip.2007.02.005 17418635 115 Ping Y Shan J Qin H Li F Qu J Guo R PD-1 signaling limits expression of phospholipid phosphatase 1 and promotes intratumoral CD8+ T cell ferroptosis Immunity 2024 57 2122 2139.e9 10.1016/j.immuni.2024.08.003 39208806 116 Li J Liu J Zhou Z Wu R Chen X Yu C Tumor-specific GPX4 degradation enhances ferroptosis-initiated antitumor immune response in mouse models of pancreatic cancer Sci Transl Med 2023 15 eadg3049 10.1126/scitranslmed.adg3049 37910602 117 Bell HN Stockwell BR Zou W Ironing out the role of ferroptosis in immunity Immunity 2024 57 941–56 10.1016/j.immuni.2024.03.019 38749397 PMC11101142 118 Shen Z Liu T Li Y Lau J Yang Z Fan W Fenton-reaction-accelerable magnetic nanoparticles for ferroptosis therapy of orthotopic brain tumors ACS Nano 2018 12 11 11355–65 10.1136/jitc-2021-002591 30375848 119 Wang D Zhou J Chen R Shi R Wang C Lu J Core–shell metal-organic frameworks as fe2+ Suppliers for fe2+-mediated cancer therapy under multimodality imaging Chem Mater 2017 29 3477–89 10.1021/acs.chemmater.6b05215 120 Yang B Liu Q Yao X Zhang D Dai Z Cui P FePt@MnO-based nanotheranostic platform with acidity-triggered dual-ions release for enhanced MR imaging-guided ferroptosis chemodynamic therapy ACS Appl Mater Interfaces 2019 11 38395–404 10.1021/acsami.9b11353 31554396 121 Ou W Mulik RS Anwar A McDonald JG He X Corbin IR Low-density lipoprotein docosahexaenoic acid nanoparticles induce ferroptotic cell death in hepatocellular carcinoma Free Radic Biol Med 2017 112 597 607 10.1016/j.freeradbiomed.2017.09.002 28893626 PMC5848495 122 Tang H Chen D Li C Zheng C Wu X Zhang Y Dual GSH-exhausting sorafenib loaded manganese-silica nanodrugs for inducing the ferroptosis of hepatocellular carcinoma cells Int J Pharm 2019 572 118782 10.1016/j.ijpharm.2019.118782 31678528 123 Liang H Wu X Zhao G Feng K Ni K Sun X Renal clearable ultrasmall single-crystal fe nanoparticles for highly selective and effective ferroptosis therapy and immunotherapy J Am Chem Soc 2021 143 15812–23 10.1021/jacs.1c07471 34473493 124 Xie P Yang ST Huang Y Zeng C Xin Q Zeng G Carbon nanoparticles-fe(II) complex for efficient tumor inhibition with low toxicity by amplifying oxidative stress ACS Appl Mater Interfaces 2020 12 29094–102 10.1021/acsami.0c07617 32510916 125 Liu T Liu W Zhang M Yu W Gao F Li C Ferrous-supply-regeneration nanoengineering for cancer-cell-specific ferroptosis in combination with imaging-guided photodynamic therapy ACS Nano 2018 12 12181–92 10.1021/acsnano.8b05860 30458111 126 Kim SE Zhang L Ma K Riegman M Chen F Ingold I Ultrasmall nanoparticles induce ferroptosis in nutrient-deprived cancer cells and suppress tumour growth Nat Nanotechnol 2016 11 977–85 10.1038/nnano.2016.164 27668796 PMC5108575 127 Yu M Gai C Li Z Ding D Zheng J Zhang W Targeted exosome-encapsulated erastin induced ferroptosis in triple negative breast cancer cells Cancer Sci 2019 110 3173–82 10.1111/cas.14181 31464035 PMC6778638 128 Zhang P Liu C Wu W Mao Y Qin Y Hu J Triapine/Ce6-loaded and lactose-decorated nanomicelles provide an effective chemo-photodynamic therapy for hepatocellular carcinoma through a reactive oxygen species-boosting and ferroptosis-inducing mechanism Chem Eng J 2021 425 131543 10.1016/j.cej.2021.131543 129 Zhang P Fu J Hu J You Q Yao X Hua D Evoking and enhancing ferroptosis of cancer stem cells by a liver-targeted and metal-organic framework-based drug delivery system inhibits the growth and lung metastasis of hepatocellular carcinoma Chem Eng J 2023 454 140044 10.1016/j.cej.2022.140044 130 Klenk C Gawande R Uslu L Khurana A Qiu D Quon A Ionising radiation-free whole-body MRI versus (18)F-fluorodeoxyglucose PET/CT scans for children and young adults with cancer: a prospective, non-randomised, single-centre study Lancet Oncol 2014 15 275–85 10.1016/S1470-2045(14)70021-X 24559803 131 An Y Zhu J Liu F Deng J Meng X Liu G Boosting the ferroptotic antitumor efficacy via site-specific amplification of tailored lipid peroxidation ACS Appl Mater Interfaces 2019 11 29655–66 10.1021/acsami.9b10954 31359759 132 Lin LS Song J Song L Ke K Liu Y Zhou Z Simultaneous fenton-like ion delivery and glutathione depletion by mnO2-based nanoagent to enhance chemodynamic therapy Angew Chem 2018 130 4996 5000 10.1002/ange.201712027 29488312 133 Meng X Lu Z Zhang L Wang Z A pH/ATP-responsive nanomedicine via disrupting multipath homeostasis of ferroptosis for enhanced cancer therapy Chem Eng J 2023 457 141313 10.1016/j.cej.2023.141313 134 Jiang C Li X Wan S Ji S Wang Q Hu S Copper-doped polydopamine nanoparticles-mediated GSH/GPX4-depleted ferroptosis and cuproptosis sensitizes lung tumor to checkpoint blockade immunotherapy Small Weinh Bergstr Ger 2025 21 e2503208 10.1002/smll.202503208 40231637 135 Zhang C Liu S Zhang J Lu J Chen Z Pan B A multifunctional fe-EGCG@RSL3 nanomedicine synergizes ferroptosis induction and tumor microenvironment remodeling for enhanced bladder cancer immunotherapy Research 2025 8 0735 10.34133/research.0735 40530387 PMC12173478 136 Gao Z He T Zhang P Li X Zhang Y Lin J Polypeptide-based theranostics with tumor-microenvironment-activatable cascade reaction for chemo-ferroptosis combination therapy ACS Appl Mater Interfaces 2020 12 20271–80 10.1021/acsami.0c03748 32283924 137 Zhang YN Poon W Tavares AJ McGilvray ID Chan WCW Nanoparticle–liver interactions: Cellular uptake and hepatobiliary elimination J Controlled Release 2016 240 332–48 10.1016/j.jconrel.2016.01.020 26774224 138 You Z Wang Z Tian K Yao X Activation of persulfate by MIL-100(Fe) coated with perylene diimide heterojunction photocatalyst for efficient removal of Bisphenol A in visible light J Environ Chem Eng 2023 11 110159 10.1016/j.jece.2023.110159 139 Catenacci L Rossi R Sechi F Buonocore D Sorrenti M Perteghella S Effect of lipid nanoparticle physico-chemical properties and composition on their interaction with the immune system Pharmaceutics 2024 16 1521 10.3390/pharmaceutics16121521 39771501 PMC11728546 140 Zhang S You H Fan H Chen Y Song H Zhao Z Transcytosis-triggering nanoparticles for overcoming stromal barriers and reversing immunosuppression in pancreatic cancer combinatorial therapy Nano Lett 2025 25 2949–59 10.1021/acs.nanolett.4c06372 39914891 141 Tasdogan A Faubert B Ramesh V Ubellacker JM Shen B Solmonson A Metabolic heterogeneity confers differences in melanoma metastatic potential Nature 2020 577 115–20 10.1038/s41586-019-1847-2 31853067 PMC6930341 142 Zhang Y Swanda RV Nie L Liu X Wang C Lee H mTORC1 couples cyst(e)ine availability with GPX4 protein synthesis and ferroptosis regulation Nat Commun 2021 12 1589 10.1038/s41467-021-21841-w 33707434 PMC7952727 143 Candelaria PV Leoh LS Penichet ML Daniels-Wells TR Antibodies targeting the transferrin receptor 1 (TfR1) as direct anti-cancer agents Front Immunol 2021 12 607692 10.3389/fimmu.2021.607692 33815364 PMC8010148 144 Mogilenko DA Sergushichev A Artyomov MN Systems immunology approaches to metabolism Annu Rev Immunol 2023 41 317–42 10.1146/annurev-immunol-101220-031513 37126419 145 Fang W Yu Z Hu P Shi J Fe/al-LDH nanomedicine for antitumor ferroptosis-immunotherapy by immunosuppression reversal Adv Funct Mater 2024 34 2405483 10.1002/adfm.202405483 146 Ye Z Yi J Jiang X Shi W Xu H Cao H Gastric cancer-derived exosomal let-7 g-5p mediated by SERPINE1 promotes macrophage M2 polarization and gastric cancer progression J Exp Clin Cancer Res CR 2025 44 2 10.1186/s13046-024-03269-4 39748408 PMC11694445 147 Wei X Sun L Deng J Yang Q Zhao J Zhou S A Multifunctional exosome with dual homeostasis disruption augments cGAS-STING-Mediated tumor immunotherapy by boosting ferroptosis Nano Lett 2024 24 45 14263–72 10.1021/acs.nanolett.4c03862 39475013 148 Xiang B Zhang M Li K Zhang Z Liu Y Gao M The epitranscriptional factor PCIF1 orchestrates CD8+ T cell ferroptosis and activation to control antitumor immunity Nat Immunol 2025 26 252–64 10.1038/s41590-024-02047-w 39762445 149 Roeck BF Lotfipour Nasudivar S Vorndran MRH Schueller L Yapici FI Rübsam M Ferroptosis spreads to neighboring cells via plasma membrane contacts Nat Commun 2025 16 2951 10.1038/s41467-025-58175-w 40140422 PMC11947162 ",
  "metadata": {
    "Title of this paper": "Ferroptosis spreads to neighboring cells via plasma membrane contacts",
    "Journal it was published in:": "Frontiers in Immunology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479322/"
  }
}