{
  "title": "Paper_142",
  "abstract": "pmc Cell Rep Med Cell Rep Med 3954 cellrepsmed Cell Reports Medicine 2666-3791 Elsevier PMC12490213 PMC12490213.1 12490213 12490213 40882623 10.1016/j.xcrm.2025.102319 S2666-3791(25)00392-1 102319 1 Article Selenized neural stem cell-derived exosomes: A neotype therapeutic agent for traumatic injuries of the central nervous system Wang Wenjing 1 3 Lu Guihong 2 Guo Peilin 1 4 Zhang Haochong 5 Wang Yan 1 Zheng Diwei 1 Lyu Chengliang 1 Wang Dongfang 6 Li Shang 5 Li Feng 1 Zhao Jiawei 1 Qin Meng 7 Li Weiping wpli@szu.edu.cn 3 ∗ Tan Hui huitan@email.szu.edu.cn 2 3 ∗∗ Ma Guanghui ghma@ipe.ac.cn 1 4 ∗∗∗ Wei Wei weiwei@ipe.ac.cn 1 4 8 ∗∗∗∗ 1 2 3 4 5 6 7 ∗ wpli@szu.edu.cn ∗∗ huitan@email.szu.edu.cn ∗∗∗ ghma@ipe.ac.cn ∗∗∗∗ weiwei@ipe.ac.cn 8 Lead contact 16 9 2025 28 8 2025 6 9 498186 102319 11 12 2023 10 9 2024 31 7 2025 28 08 2025 03 10 2025 03 10 2025 © 2025 The Author(s) 2025 https://creativecommons.org/licenses/by-nc/4.0/ This is an open access article under the CC BY-NC license (http://creativecommons.org/licenses/by-nc/4.0/). Summary Oxidative damage and neuroinflammation are the key features of central nervous system (CNS) injury. Inspired by the neuroprotective properties of neural stem cell-derived exosomes (NExo) and the reactive oxygen species (ROS) scavenging ability of selenium, we develop an advanced NExo bearing ultrasmall nano-selenium (∼3.5 nm) via lipid-mediated nucleation (SeNExo). In addition to maintaining the biological components of NExo, the resulting SeNExo exhibits a Se–O bond that dramatically enhances its ROS-scavenging performance. SeNExo penetrates the blood-brain barrier (BBB) via the apolipoprotein E and prolow-density lipoprotein receptor-related protein 1 (APOE_LRP-1) interaction. Through proteomics, microRNA (miRNA) omics, and single-nucleus RNA sequencing, we find that SeNExo can alleviate neuronal apoptosis, restore glia homeostasis, and remodel glia-neuron networks. Therefore, SeNExo confers potent therapeutic benefits, significantly reducing cerebral lesions in a murine traumatic brain injury model. Even extending to a murine spinal cord injury model, SeNExo promotes locomotory recovery, further supporting SeNExo as a neotype and a promising therapeutic agent for treating traumatic CNS injury. Graphical abstract Highlights • NSC-derived exosomes are functionalized with ultrasmall nano-selenium • SeNExo crosses the BBB by utilizing APOE_LRP-1 interaction • SeNExo exhibits ROS scavenging and neuroprotection abilities • Therapeutic efficacies are demonstrated in TBI and SCI model mice Wang et al. develop SeNExo, an advanced NExo bearing ultrasmall nano-selenium, exhibiting both ROS scavenging and neuroprotection abilities. SeNExo alleviates neuronal apoptosis, restores glia homeostasis, and remodels glia-neuron networks in TBI and SCI model mice. Keywords exosomes traumatic brain injury traumatic spinal cord injury selenium oxidative stress neuroinflammation pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Published: August 28, 2025 Introduction Traumatic injuries to the central nervous system (CNS), including traumatic brain injury (TBI) and spinal cord injury (SCI), often lead to long-term disability across all age groups. 1 , 2 , 3 4 , 5 6 , 7 , 8 , 9 10 , 11 , 12 Motivated by the potential for cell-based therapeutics, researchers have explored neural stem cells (NSCs) to mitigate neuronal damage. 13 , 14 , 15 , 16 17 , 18 , 19 , 20 , 21 22 , 23 , 24 25 , 26 , 27 While certainly exciting, the complex pathological microenvironments of CNS injury highlight the need to further enhance the therapeutic potential of NExo. Given the aforementioned central role of ROS in exacerbating CNS injury, we propose developing advanced NExo with ROS scavenging ability to boost their therapeutic efficacy. Selenium, a trace element known to reduce oxidative damage, 28 , 29 30 , 31 32 in situ Keeping these considerations in mind, we developed a mild and facile one-pot approach to decorate NExo with nano-selenium (SeNExo) through lipid-mediated crystallization ( Figure 1 Figure 1 Figure 1 Design, construction, and characterizations of SeNExo (A) Schematic illustration showing the construction of SeNExo. (B) Schematic illustration showing the BBB penetration of SeNExo and subsequent efficient therapy for CNS injury. (C) Representative TEM images of SeNExo and the magnified (211) facet with 0.308 nm interplanar spacing of the ultrasmall nano-selenium. Low-magnification image scale bars, 100 nm. High-magnification image scale bars, 2 nm. (D) Representative cryo-TEM image of SeNExo, showing the ultrasmall nano-selenium at the membrane (indicated by white arrows). Scale bars, 20 nm. (E) Elemental mapping images of SeNExo and the merged view. Scale bars, 50 nm. (F) Electron spin resonance (ESR) spectra for assessing the free radical scavenging activity of SeNExo compared with Se NPs toward ⋅OH radicals. The Se content in both entities remained uniform. (G) Left: illustration of the model for Se and Se with partial Se–O bond insertion, showing different adsorption levels for hydroxyl radicals, and the corresponding difference charge density for the Se/⋅OH and Se–O/⋅OH systems. Right: calculated adsorption energies of Se/⋅OH or Se–O/⋅OH systems, and the Bader charges of the predicted gained electrons for ⋅OH in the Se/⋅OH or Se–O/⋅OH systems. (H) Stability characterization of SeNExo in terms of particle size, zeta potential, and Se content before and after a lyophilization/rehydration (Lyo/Reh) cycle ( n (I and J) Proteomics and miRNA omics analysis of fresh NExo and SeNExo after Lyo/Reh. Data in (H) are presented as the mean ± SD and were compared by two-tailed unpaired Student’s t test. Results Construction and characterization of SeNExo Inspired by the abundant phosphoryl groups on the membrane and their potential to interact with precursors and regulate subsequent nucleation, we developed a mild and facile method for in situ Figure S1 in situ Figures 1 S1 in situ Figure 1 Figure 1 Figure S1 Figure S1 8 Figures S1 To validate the exceptional ROS scavenging capacity of ultrasmall nano-selenium, we conducted electron spin resonance (ESR) spectroscopy. As shown in Figures 1 S1 2 ⋅- Figure S1 2 2 Figures S1 in situ Figures S2 Figures 1 S2 Upon successful fabrication of SeNExo with excellent ROS-scavenging performance, we conducted a series of experiments to evaluate their stability. During 48 h of incubation with phosphate-buffered solution (PBS) containing 10% serum, SeNExo exhibited no changes in size, zeta potential, or Se content ( Figure S2 Figure 1 Figure S2 22 Figure S2 Figure 1 Figure 1 Evaluation and mechanism of SeNExo’s BBB penetration capacity Because accumulation at the lesion site is a prerequisite for treating CNS injury, we investigated the BBB penetration capacity of SeNExo in TBI model mice induced by a controlled cortical impactor. 33 34 , 35 Figures 2 Figures S3 Figures S3 Figure 2 Mechanism of BBB penetration ability of SeNExo (A and B) Schematic illustration of the administration of Alp-labeled Lipo, NExo, and SeNExo via i.v. injection for TBI model mice at 0 days, corresponding in vivo (C and D) Schematic illustration of the administration of Alp-labeled Lipo, NExo, and SeNExo via i.v. injection for TBI model mice at 7 days, corresponding in vivo (E) Dot plot showing the top 6 expressed ligands and receptors associated with cellular recognition and transport between SeNExo and bEnd.3 cells. (F) Schematic illustration of the administration of Alp-labeled SeNExo and anti-APOE-blocked SeNExo via i.v. injection for TBI model mice (7 days, left), corresponding in vivo (G) Representative fluorescence images of frozen TBI brain section (7 days) at 6 h post injection with 3,3′-dioctadecyloxacarbocyanine perchlorate (DIO)-labeled SeNExo. Regions in the white squares (f1–f3, f3i–f3iii) were enlarged to show the colocalization of DIO-labeled SeNExo (green) with microglia (IBA1+, cyan), astrocytes (GFAP+, yellow), and neurons (NEUN/β3-tubulin+, red/gray) near the injury. Nuclei: Hoechst 33342 (blue). Low-magnification image scale bars, 500 μm. Scale bars in f1–f3, 50 μm. Scale bars in f3i–f3iii, 10 μm. Data in (B), (D), and (F) are presented as the mean ± SD from 3 biological replicates and were assessed via one-way ANOVA (B and D) and two-tailed unpaired Student’s t test (F). Subsequently, we investigated the accumulation performance of the samples 7 days after TBI. Unlike the acute stage, the Lipo signal was hardly detected in the recovery stage of the BBB, while both NExo and SeNExo still showed abundant accumulation at the lesion site, exhibiting a signal intensity nearly 4.5-fold than that in the Lipo group ( Figures 2 To gain deeper insight at the molecular level, we used a well-established Transwell model ( Figures S3 36 Figure 2 Figure S3 Figures 2 S3 For higher resolution, the frozen slides of brain tissue were immunostained with ionized calcium-binding adapter molecule 1 (IBA1), glial fibrillary acidic protein (GFAP), neuronal nuclear antigen (NEUN), and β3-tubulin to mark microglia, astrocytes, neuronal nuclei, and neuronal microtubules, respectively. As shown in Figure 2 Figures S3 Therapeutic effects of SeNExo in TBI model mice Having found that SeNExo can cross the BBB and accumulate at the TBI lesion site, we evaluated the in vivo Figures S4 11 Figures S4 Figure 3 35 , 37 th 38 th Figure 3 Therapeutic effects of SeNExo in TBI model mice (A) Experimental design for evaluating the therapeutic effects in TBI model mice. (B) Representative MWM-swimming track. The platform was in the third quadrant, with the red and blue squares representing the entry and end positions, respectively. (C) The number of platform crossings and the percentage of searching time in the target quadrant. (D) Representative two-photon fluorescence images showing ROS levels at the lesion site and quantitative analysis. Scale bars, 200 μm. (E) Representative immunofluorescence of neuroinflammation markers IBA1 and GFAP at the lesion site and quantitative analysis. Scale bars, 50 μm. (F) Representative immunofluorescence of neuronal survival marker NEUN at the lesion site and quantitative analysis. Scale bars, 50 μm. (G) Representative fluorescence images of Hoechst 33342-stained brain sections with lesion area quantitation. Scale bars, 1 mm. (H) Disparities of seven indices between the sham group and different treatment groups. The linear distance between two groups was calculated using the Euclidean distance method. (I) Heatmap of seven indices among the six groups. Data were normalized for plotting. Data in (C)–(G) are presented as the mean ± SD from 6 biological replicates and were assessed via one-way ANOVA. The images in (E), (F), and (G) were serial tissue sections. As shown in Figures 3 Figures S4 Figures S4 39 , 40 To gain a deeper insight into the excellent therapeutic benefits of SeNExo, we performed histological analyses. Using 2′, 7′-dichlorofluorescin diacetate as the ROS probe, the SeNExo group showed the lowest fluorescence intensity at the lesion site, similar to the sham group ( Figure 3 Figure 3 Figure S4 Figures 3 To provide a clearer visualization for the disparities of the aforementioned data, we calculated the linear distance between the sham group and different treatment groups across seven indices, including MWM behaviors (crossing number and time percentage in the target quadrant), ROS levels, activated microglia and astrocyte indicators (IBA1 and GFAP), and neuron number indicators (NEUN and lesion area). As shown in Figure 3 Figure 3 Z Z Figure S4 Figure S4 Figure S4 Mechanism of SeNExo’s therapeutic effects using snRNA-seq To better understand the underlying mechanism behind SeNExo’s therapeutic effects, we performed snRNA-seq analysis on lesion tissue from TBI model mice treated with SeNExo or PBS ( Figure 4 Figure 4 Figure 4 Figure 4 Diversity of cell types identified by snRNA-seq analysis and the mechanisms of SeNExo’s effects for alleviating neuronal apoptosis (A) Schematic of lesion tissues collected from mice brains and processing for snRNA-seq. (B) t-distributed stochastic neighbor embedding (t-SNE) plot of brain tissue colored by main cell lineage (left), and a dot plot depicting the cell type-specific marker genes for individual clusters (right). (C) Different cell type frequency changes in the sham, PBS, and SeNExo groups. (D) Histogram of differentially expressed genes (DEGs) in neurons of different groups. Venn diagram of upregulated and downregulated DEGs in neurons was displayed on the right side. |Log2 (fold change)| > 0.36, q (E) Heatmap of representative DEGs selected from Venn intersection in (D). (F) Violin plots of different gene-set scores in neurons across the sham, PBS, and SeNExo groups. (G) Heatmap showing the similar trend between the ROS level and expression of representative genes for the sham, PBS, and SeNExo groups. (H) Network plot (from PBS vs. SeNExo) illustrating that the proteins (circle) in the SeNExo interact with the neuronal upregulated DEGs (square, red edge) related to neuroprotection and neuronal downregulated DEGs (square, blue edge) related to apoptosis. (I) Sankey plot (from PBS vs . Data in (F) were assessed via one-way ANOVA. We initially focused on differentially expressed genes (DEGs) in neurons after SeNExo treatment ( Figure 4 Cst3 Acsl3 Ubb Bax Tenm4 Mef2c Figure 4 Figure 4 Figure 4 Figure 4 Pparg Mef2c Ubb Xbp1 Traf6 Xbp1 Figure 4 Recalling the significant alterations in the proportions of the four glial cell types, we subsequently assessed DEGs in microglia, astrocytes, OPCs, and oligodendrocytes. Microglia, as resident macrophages in the brain, respond to injury by transitioning from a homeostatic to a proliferative state, producing cytokines and chemokines to activate immune cells. 41 42 Figure 5 C1qa Trem2 B2m H2-K1 Figures 5 S5 Cst3 C1qa Trem2 Cd9 B2m Fth1 Figure 5 43 Figure S5 Figure S5 Figure 5 Mechanisms of SeNExo’s effects on restoring glial homeostasis and remodeling glia-neuron networks (A) Pseudo-time analysis showing the “early” and “late” states of microglia along the main pseudo-time trajectories in the sham, PBS, and SeNExo groups. Each dot represented one cell. (B) Heatmap showing clustering and expression of genes along the trajectories of microglia. Z (C) Scatterplot of the expression of representative MC1 and MC2 genes along pseudo-time. (D) Overview of the significantly enriched ligand_receptor interactions involved in astrogliosis, inflammatory response, and CNS development between neurons and glial cells in the sham, PBS, and SeNExo groups. The pink dot represented p p (E) Diagram of representative ligand_receptor pairs in (D). In the terms of astrocytes, we found that SeNExo downregulated the expression of DEGs related to inflammation (e.g., Clu Gja1 Cst3 Acsl3 Ctsd Ubb Figure S5 Figure S5 CD81 CD9 Figures S5 Traf6 Trem2 44 B2m Cd81 Figure S5 Dysfunctional crosstalk between neurons and glial cells has been considered as another essential driving force for exacerbating CNS injury. 45 46 p Figures 5 Sema3a Nrp1 P2ry6 Nampt Pdgfc Pdgfra Ptprz1_ Ptn Fgf1 Fgfr1 Figure 3 Lgr4 Nrg1 Nrg1 Erbb3 Extension of the therapeutic effects of SeNExo in SCI model mice Given that CNS injury includes both TBI and SCI, we were finally interested in examining the in vivo Figure 6 47 Ex vivo Figures 6 S6 Figure 6 Figure 6 Distribution and therapeutic effects of SeNExo in SCI model mice (A) Experimental design for ex vivo (B) Representative ex vivo (C) Representative fluorescence images of frozen spinal cord from SCI model mice at 12 h post injection with DIO-labeled SeNExo. Regions in the white squares (f1–f2, f1i–f1ii) were enlarged to show the colocalization of DIO-labeled SeNExo (green) with microglia (IBA1+, cyan), astrocytes (GFAP+, yellow), and neurons (NEUN/β3-tubulin+, red/gray) near the injury. Nuclei: Hoechst 33342 (blue). Low-magnification image scale bars, 200 μm. Scale bars in f1i–f1ii, 20 μm. Scale bars in f2, 20 μm. (D) BMS score for the left and right hindpaws at the indicated post-injury time points for different groups. (E) Representative pictures of mice in different groups (left) and corresponding representative images of limb footprints (right). Cyan: right front (RF); magenta: right hind (RH); yellow: left front (LF); green: left hind (LH). (F) Representative pictures of RH and LH footprints and corresponding 3D footprint contact intensities in different groups. (G) Quantitative analysis of stride length of LF and RF forefeet (E), mean print area of LH and RH footprints (F), and mean contact intensity of LH and RH footprints (F) to evaluate the extent of locomotion recovery. (H) Representative two-photon fluorescence images of ROS levels at the lesion site and the quantitative analysis. Scale bars, 200 μm. (I) Representative immunofluorescence of neuroinflammation markers IBA1 and GFAP at the lesion site. Low-magnification image scale bars, 500 μm; high-magnification image scale bars, 200 μm. (J) Representative immunofluorescence of neuronal survival markers NEUN and NF200 at the lesion site. Low-magnification image scale bars, 500 μm; high-magnification image scale bars, 200 μm. (K) Quantitative analysis of IBA1, NEUN, and the lengths of the lesions following various treatments. Data in (B), (H), and (K) are presented as the mean ± SD from 3 biological replicates. Data in (D) and (G) are presented as the mean ± SD from 6 biological replicates. Data in (D) were assessed by two-tailed unpaired Student’s t test. Data in (G), (H), and (K) were assessed via one-way ANOVA. To assess the therapeutic effects on locomotor function, the SCI model mice received PBS or SeNExo treatment (1.32 × 10 11 48 Figure 6 Figures 6 Recalling the pathological features of CNS injury, the spinal cord tissues from the SCI model mice were excised for histological evaluation after gait analysis. Similar to the results in the TBI model mice, the SeNExo group showed significantly reduced ROS levels compared to the PBS group ( Figure 6 Figures 6 S6 Figures 6 Figure S6 Figure S6 Figure S6 Discussion Owing to the barrier between the blood and CNS, and the complex pathological features of CNS injury, it is desirable to develop therapeutics that can efficiently accumulate in CNS lesions and simultaneously ameliorate the injury microenvironment. Herein, we established a mild and facile strategy for the in situ Given the crucial role of ROS in exacerbating CNS injury, efficient ROS reduction is an indispensable requirement for therapeutics. However, traditional aqueous-synthesized Se NPs have a size range of 40–400 nm, and relatively low surface-to-volume ratios limit its antioxidant activity to a higher level. By exploiting the interaction between phosphoryl groups on the NExo membrane and sodium selenite precursor, we succeeded in in situ 49 , 50 49 50 In addition to nano-selenium, exosome components also deserve further discussion. Proteomics analysis indicated that APOE on NExo could bind to the LRP-1 receptor on vascular endothelial cells to facilitate BBB penetration. Throughout this process, the ultrasmall nano-selenium at the membrane does not disturb the aforementioned binding and can hitchhike to the lesion site. Beyond the targeting mechanism, we utilized a multi-omics approach to reveal the contributions of proteins and miRNAs from NExo to the amelioration of neuroinflammation and the enhancement of neuroprotection to a certain extent. For example, mmu-miR-26a-5p, which has been reported to inhibit inflammatory responses, was strongly associated with a reduction in inflammation-related genes (e.g., Cd81 Ptn Pparg Mef2c Ubb Xbp1 Olfm1 Xbp1 Regarding clinical translation, SeNExo also holds several superiorities that deserve emphasis. Compared with traditional stem cell therapy, which is always compromised by pathological conditions, our NExo chassis with stable biological components excluded the possibility of phenotypic alterations, thus ensuring therapeutic functions at the lesion site. Furthermore, the phosphoryl groups enabled nano-selenium to stably anchor at the NExo membrane, preventing disassociation during in vivo 22 , 51 Limitations of the study In this study, SeNExo efficacy was demonstrated solely through i.v. injection. Intranasal administration is also worth investigating, as this non-invasive approach facilitates the delivery of nanoformulation to the CNS, potentially reducing liver retention while enhancing targeting. Furthermore, establishing a non-human primate model to evaluate the therapeutic effects of SeNExo is more suitable for assessing its clinical translational potential. Given that our SeNExo comprises a mixture of inorganic elements, proteins, and diverse miRNAs, the specific contributions of the signaling pathways activated by these components in neural repair remain to be fully elucidated. Resource availability Lead contact Requests for further information and resources should be directed to and will be fulfilled by the lead contact, Wei Wei ( weiwei@ipe.ac.cn Materials availability This study did not generate new unique reagents. Data and code availability  • The raw sequence data of snRNA-seq and small RNA-seq data have been deposited in the Genome Sequence Archive (Genomics, Proteomics & Bioinformatics 2021) in National Genomics Data Center (Nucleic Acids Res 2022), China National Center for Bioinformation/Beijing Institute of Genomics, Chinese Academy of Sciences (GSA: CRA024534 for snRNA-seq and GSA: CRA024600 for small RNA-seq) that are publicly accessible at https://ngdc.cncb.ac.cn/gsa • The mass spectrometry proteomics data have been deposited in the ProteomeXchange Consortium ( https://proteomecentral.proteomexchange.org PXD062901 PXD062903 • This paper does not report original code. • Any additional information required to reanalyze the data reported in this paper is available from the lead contact Acknowledgments This work was supported by the 10.13039/501100001809 National Natural Science Foundation of China T2225021 U2001224 21821005 32101120 Beijing Natural Science Foundation JQ21027 Shenzhen Science and Technology Program JCYJ20220818102804009 Author contributions W. Wei, G.M., H.T., and W.L. conceived and designed the study; W. Wang constructed the therapeutic agent and performed in vivo in vitro in vivo Declaration of interests The authors declare no competing interests. STAR★Methods Key resources table  REAGENT or RESOURCE SOURCE IDENTIFIER Antibodies Anti-IBA1 Abcam Cat# ab283346; RRID: AB_3065282 Anti-GFAP Abcam Cat# ab207165; RRID: AB_2924325 Anti-NEUN Abcam Cat# ab177487; RRID: AB_2532109 Anti-β3 Tubulin Abcam Cat# ab78078; RRID: AB_2256751 Anti-IBA1 Abcam Cat# ab178847; RRID: AB_2832244 Anti-GFAP Abcam Cat# ab279289; RRID: AB_3698194 Anti-NF200 Proteintech Cat# 60331-1-Ig; RRID: AB_2881440 Anti-APOE Abcam Cat# ab183597; RRID: AB_3331650 Anti-TSG101 Affinity Cat# DF8427; RRID: AB_2841675 Goat Anti-Rat IgG H&L (Alexa Fluor® 647) Abcam Cat# ab150159; RRID: AB_2566823 Goat Anti-Rabbit IgG H&L (Alexa Fluor® 555) Abcam Cat# ab150078; RRID: AB_2722519 Goat Anti-Mouse IgG H&L (Alexa Fluor® 647) Abcam Cat# ab150115; RRID: AB_2687948 Goat Anti-Mouse IgG H&L (Alexa Fluor® 488) Abcam Cat# ab150113; RRID: AB_2576208 Anti-SOX2 Abcam Cat# ab92494; RRID: AB_10585428 Anti-Nestin Invitrogen Cat# MA1-110; RRID: AB_2536821 Anti-MFGE8 Invitrogen Cat# PA5-109955; RRID: AB_2855366 Anti-ITGB1 Abcam Cat# ab183666; RRID: AB_3698195 Chemicals, peptides, and recombinant proteins Sodium Selenite Sigma-Aldrich Cat# S5261 Ascorbic Acid Sigma-Aldrich Cat# A4544 S-nitroso-N-acetylpenicillamine Sigma-Aldrich Cat# N3398 DOPC Sigma-Aldrich Cat# P6354 Cholesterol Solarbio Cat# C8280 DSPE-PEG 2000 Xi’an ruixi Biological Technology Cat# R-1028-2K 3,3′-dioctadecyloxacarbocyanine perchlorate (DIO) Sigma-Aldrich Cat# D4292 Edaravone Aladdin Cat# P109105 Ganglioside GM1 Aladdin Cat# G130562 L-Selenocystine (SeCys) Aladdin Cat# S640012 2′,7′-dichlorofluorescin diacetate (DCFH-DA) Sigma-Aldrich Cat# 4091-99-0 Premo™ cellular hydrogen peroxide Sensor Thermo Fisher Cat# P36243 5-(Diethoxyphosphoryl)-5-methyl-1-pyrroline-N-oxide (DEPMPO) Santa Cruz Biotechnology Cat# sc-202132 5,5-Dimethyl-1-pyrroline-N-oxide (DMPO) Santa Cruz Biotechnology Cat# sc-202587 1,1-Diphenyl-2-picrylhydrazyl Free Radical (DPPH) Aladdin Cat# D273092 Al (III) phthalocyanine chloride tetrasulfonic acid Frontier Cat# AIPcS-834 Phenylmethanesulfonyl fluoride (PMSF) Solarbio Cat# P0100 Hoechst 33342 Solarbio Cat# C0031 Acridine orange Abcam Cat# ab270791 Triton X-100 Solarbio Cat# T8200 RIPA Lysis Buffer Thermo Fisher Cat# 89901 Percoll Cytiva Cat# GE17-0891-02 Papain MCE Cat# HY-P1645 N, N dimethylformamide Sigma-Aldrich Cat# 319937 Evans blue Sigma-Aldrich Cat# E2129 Dulbecco’s Modified Eagle’s Medium (DMEM) Gibco Cat# 6124090 Fetal bovine serum (FBS) Gibco Cat# 10099141C Trypsin EDTA Solution B VivaCell Cat# C3532-0100 Penicillin-Streptomycin Solution VivaCell Cat# C3420-0100 Mouse Neural Stem Cell Complete Medium (serum free) Cyagen, OriCell® Cat# MUXNF-90011 Critical commercial assays Mouse IL-1β ELISA KIT Solarbio Cat# SEKM-0002 Mouse TNF-α ELISA KIT Solarbio Cat# SEKM-0034 Micro Hydroxyl Free Radical Scavenging Capacity Assay Kit Solarbio Cat# BC1325 Superoxide Anion Activity Content Assay Kit Solarbio Cat# BC1295 8-Hydroxydeoxyguanosine (8-OHdG) ELISA Kit Solarbio Cat# SEKSM-0038 ElaBoXTM Mouse IgG (Total) ELISA Kit Solarbio Cat# SEKM-0098 CD11b Microbeads Miltenyi Biotec Cat# 130-093-636 Anti-ACSA-2 Microbead Kit Miltenyi Biotec Cat# 130-097-679 Neuron Isolation Kit Miltenyi Biotec Cat# 130-115-390 NSC astrogenic differentiation kit Cyagen, OriCell® Cat# MUXNX-90091 Deposited data snRNA-seq data This study GSA: CRA024534 Small RNA-seq data This study GSA: CRA024600 Proteomics data This study PXD062901 PXD062903 Experimental models: Cell lines bEnd.3 Mouse brain microvascular endothelial cells Cell Resource Center, Peking Union Medical College (PCRC) Cat# 3101MOUTCM40 HT22 hippocampal neuronal cells Cell Resource Center, Peking Union Medical College (PCRC) Cat# 3101MOUGNM47 BV2 mouse microglial cells Cell Resource Center, Peking Union Medical College (PCRC) Cat# 3101MOUGNM45 Primary Neural Stem Cell derived from C57BL/6 mice Cyagen, OriCell® Cat# MUBNF-01001 Experimental models: Organisms/strains Mouse: C57BL/6, female Vital River Laboratories N/A Software and algorithms GraphPad Prism 9.0.0 GraphPad Software Inc. https://www.graphpad.com/ ImageJ ImageJ Software Inc. https://imagej.nih.gov/ij/index.html CatWalk XT 10.6 Noldus https://noldus.com/catwalk-xt Vectra software (v.2.0.7.1 version) AKOYA BIOSCIENCES https://www.akoyabio.com/phenoimager/instruments/vectra-3-0/ Cell ranger 5.0.0 10x Genomics https://www.10xgenomics.com/ Omicsmart platform Gene Denovo https://www.omicsmart.com/#/ R 3.5.1 R Project https://www.r-project.org Monocle2 2.8.0 Qiu et al. 42 https://github.com/cole-trapnell-lab CellphoneDB 2.1.2 Efremova M et al. 46 https://www.cellphonedb.org Cytoscape (v3.8.2) Shannon P et al. 52 https://cytoscape.org Experimental model and study participant details Cell lines and culture bEnd.3 Mouse brain microvascular endothelial cells, HT22 hippocampal neuronal cells, and BV2 mouse microglia were obtained from Cell Resource Center, Peking Union Medical College (PCRC). Primary Neural Stem Cells derived from C57BL/6 mice were obtained from Cyagen Biosciences (Guangzhou) Inc. bEnd.3, HT22 and BV2 cells were cultured in DMEM supplemented with 10% FBS and 1% of penicillin-streptomycin in a 5% CO 2 2 Animals C57BL/6 mice (6–8 weeks, female) mice were obtained from Vital River Laboratories (Beijing, China). All mice were raised in a standard environmentally controlled room with relatively constant room temperature (21°C–23°C) and humidity (55% ± 5%) under a 12-12 h light-dark cycle. The Animal Ethics Committee of the Institute of Process Engineering thoroughly reviewed and approved all animal experiments (approval ID, IPEAECA2020072). This study was conducted in strict compliance with the Regulations for the Care and Use of Laboratory Animals and the Guideline for Ethical Review of Animals (China, GB/T 35892-2018). Method details Extraction of exosomes The culture supernatant from NSCs was harvested and subsequently subjected to centrifugation at 300 g Preparation and characterization of SeNExo, SeLipo and Se NP For SeNExo preparation, NExo (4×10 11 8 In order to explain the growth mechanism of ultrasmall-sized nano-selenium at NExo, selenium synthesized on different substrates was implemented. For SeLipo, liposomes were synthesized first and then crystallization of nano-selenium at liposomes. Briefly, 1 mg of DOPC, 0.33 mg of cholesterol, and 0.33 mg of DSPE-PEG2000 were blended in chloroform/methanol (3:1, v/v, 20 mL). Subsequently, the mixture was evaporated to create a thin film, dried overnight under vacuum, and rehydrated in PBS buffer (1 mL). To achieve nanoscale liposomes (Lipo), a MiniExtruder (Avanti) was employed to gradually extrude the liposomes through filter membranes at 800 nm, 400 nm, and 200 nm. Lipo crystallized with nano-selenium was prepared in the same protocol as that of SeNExo. For Se NP (BSA), the protocol was the same as for the synthesis of SeNExo except that NExo was changed to 4 mg/mL BSA solution. For Se NP (H 2 We deposited the aqueous solution directly onto an ultra-thin carbon film (Electron Microscopy China) to prepare the samples for electron microscopy. TEM imaging (negative staining using uranyl acetate), element mapping (unstained), and EDS analysis (unstained) were implemented by a JEM-2100F microscopy. Cryo-TEM was implemented to provide further evidence of the in situ For XRD investigations, the SeNExo was lyophilized and then operated on Empyrean high resolution powder X-ray diffractometer. For XPS investigations, the SeNExo was lyophilized and then characterized on a ESCALAB 250Xi instrument (Thermo Fisher Scientific). For EXAFS analysis, Lipo-Se, Se NP (BSA) and Se NP (H 2 53 Evaluation of ROS scavenging activity ROS scavenging abilities of SeNExo and Se NP with equivalent of selenium were performed by electron spin resonance (ESR) spectrometer (Bruker ElexSys E500 spectrometer). Hydroxyl radicals (⋅OH) and Superoxide anions (O 2 ⋅- 2 ⋅- For a quantitative comparison the ROS-scavenging performance of SeNExo in vitro 2 2 2 2 4 2 2 9 n For comparison of antioxidant capacity between SeNExo and SeCys in vitro 2 2 4 2 2 9 2 2 Stability evaluation To supervise the structural stability, SeNExo were dispersed in PBS containing 10% serum and kept at 4°C. The size and zeta potential were tested via nanoparticle tracking analysis (NTA) every 12 h. The changes of Se content of SeNExo were also investigated during the incubation. At different time points, SeNExo was digested with aqua regia for 3 h and then diluted to measure the Se content by ICP-MS. To evaluate the stability of SeNExo after a lyophilization/rehydration cycle (48 h, R.T.), size, zeta potential, and Se content of SeNExo were tested. To further evaluate the shelf life, lyophilized SeNExo was stored at R.T. for 28 days. Then, size, zeta potential, Se content, and DPPH scavenging capacity were tested. To evaluate the biological stability, proteomic analysis and miRNA omics were implemented for fresh NExo and rehydrated SeNExo. We sent the samples to Bio-Tech Pack Technology Company Ltd. for sample preparation and label-free quantitative proteomic analysis or small RNA-seq. Proteomic analysis Protein (from fresh NExo, rehydrated SeNExo, or bEnd.3 cells) was isolated by the RIPA lysis method. Through the following processes: enzymolysis with filter assisted proteome preparation, desalination with C18 Cartridge, and freeze-drying, peptides were obtained. We further analyzed the prepared peptide samples using LC-MS/MS system (Q Exactive Hybrid Quadrupole-Orbitrap Mass Spectrometer, Thermo Fisher Scientific). The raw MS files were analyzed and queried against protein database based on the species of the samples utilizing MaxQuant (1.6.2.10). Small RNA-seq Exosomes RNA was isolated using Trizol extraction from samples. Quantification of RNA was implemented by Agilent Bioanalyzer small RNA assay kit (Novogene). The small RNA-seq library followed the PE150 sequencing scheme, and the quality of the sequencing library was assessed using fastqc. N-base excision, q20 filtration, and adapter excision at both ends of the sequence were carried out using fastp. Using the Ensemble release 102 Homo sapiens genome as a reference, we utilized the Bowtie short sequence alignment tool to align the Rfam library, eliminating non-coding RNAs (ncRNAs) such as rRNA and tRNA. Small RNA quantification was performed using miRDeep2, and differential expression analysis was conducted using DESeq2 (with duplicate samples) or EdgeR (without duplicate samples). DFT calculations We utilized the Vienna Ab initio Simulation Package to conduct density functional theory (DFT) calculations, employing the generalized gradient approximation (GGA) with the Perdew-Burke-Ernzerhof (PBE) formulation. 54 , 55 −5 The adsorption energy (E adsorption E adsorption A/surf surf A(g) A/surf surf A(g) TBI model establishment The TBI model was established on C57BL/6 mice using controlled cortex impact method by a brain impact instrument (Beijing Zhongshi Technology). 33 SCI model establishment The SCI model was established on C57BL/6 mice using a weight-drop method by spinal cord striker (Beijing Zhongshi Technology). 47 Evaluation of SeNExo’s blood-CNS barrier penetration capacity in vivo The in vivo in situ For TBI model, mice in the acute stage (0 days after injury) or recovery stage (7 days after injury) were randomly divided into three groups ( n i.v. 11 For SCI model, the mice (7 days after injury) were received i.v. 11 n n i.v. 11 Investigation of the ex vivo For ex vivo For calculating the clearance rate of SeNExo from blood, the mean plasma concentration-time profile of SeNExo was plotted. Blood (50 μL) was collected at 5 min, 30 min, 1 h, 3 h, 6 h, 9 h, 12 h, 24 h, and 48 h following the injection (200 μL, 1.32 × 10 11 56 To investigate the stability of Se content in exosomes during in vivo i.v. 11 For confirming the Se accumulated at the lesion site, the lesion tissues of PBS or SeNExo-treated TBI mice (200 μL, 1.32 × 10 11 Exploring the mechanisms of BBB penetration by SeNExo For in vitro 36 4 4 trans 2 9 9 For APOE blocking experiments, mice in recovery stage (7 days after injury) were randomly divided into two groups ( n i.v. n i.v. Characterization of SeNExo uptake by microglia, astrocytes, and neurons For investigating the colocalization of SeNExo with cells at lesion site, histological evaluation was implemented. In order to enhance the fluorescence intensity of SeNExo and avoid interference from blood stasis self-luminescence at the lesion site, we labeled SeNExo with DIO. The DIO-labeled SeNExo was purified by removing excess free dyes through Nap-5 Column Sephadex. TBI model mice (after 6 h of i.v. i.v. For investigating the changes of Se content in microglia, astrocytes, and neurons of TBI lesion tissues after treatment with SeNExo, sorting experiments were implemented using Microbeads as previous reported. 57 , 58 , 59 To investigate the uptake of SeNExo by microglia, astrocytes, and neurons, we co-cultured SeNExo with BV2, NSC-induced astrocytes, and HT22, respectively. We then observed the co-localization of SeNExo and acid organelles by CLSM and TEM. Note that astrocytes were induced from mouse NSCs by culturing them with mouse NSC astrogenic differentiation kit. For CLSM imaging, the SeNExo was labeled with Alp. BV2, NSC-induced astrocytes, and HT22 cells were seeded at 2 ×10 4 9 60 , 61 For TEM, in order to distinguish the SeNExo from other vesicles within the cells, SeNExo was labeled with gold nanoparticles (15 μg/mL in culture medium, Au-labeled SeNExo) using the same protocol as for Alp labeling. The gold nanoparticles were prepared using the citrate reduction approach. 62 5 9 Dose escalation study For a dose escalation study, the TBI model mice were divided into five groups including PBS, 0.5×, 1×, 2×, and 5× SeNExo group and the sham group treated with PBS as the healthy control ( n i.v. 11 Figure 3 Evaluation of the therapeutic effects of SeNExo on BBB recovery For evaluation of BBB integrity, Evans blue staining method and IgG level detection of lesion tissues were conducted as previously reported. 37 , 38 n i.v. N,N n Evaluation of the therapeutic effects of SeNExo in TBI model mice The TBI model mice were divided into six groups randomly ( n i.v. 11 Figure 3 For spatial learning and memory abilities assessment, the Morris water maze (MWM) test was performed to evaluate the spatial learning and memory abilities of mice in the 5 th Investigating the mechanism of action of SeNExo To investigate the mechanism of action of SeNExo, we employed intracerebral (IC) injection or intravenous (i.v.) injection to treat TBI model mice to control the distribution of SeNExo. The TBI model mice were divided into five groups including PBS (IC injection), SeNExo (IC injection), NExo (IC injection), SeNExo ( i.v. i.v. n 10 10 i.v. 11 n Evaluation of the therapeutic effects of SeNExo in SCI model mice SCI model mice were randomly divided into two groups ( n i.v. 11 Figure 6 For behavior assessment, the locomotory behaviors of SCI model mice were assessed and scored on days 0, 7, 14, 21, 28, 35, 42, 49, and 56 according to guidelines of the Basso Mouse Scale (BMS), with scores ranging from 0 to 9 (9 indicating complete normalcy, 0 indicating complete paralysis). The animals were put in an open field for 4-min observation. Three examiners who were unaware of the group of mice inspected and scored the left and right ankle joints, the degree of tactility of the soles and dorsum of the feet, trunk stability and tail position, respectively. This experiment was repeated 3 times. For gait analysis, SCI model mice were evaluated using the Noldus CatWalk XT Automated Gait Analysis System in the 9 th 63 Two-photon imaging After behavioral testing (35 days post-TBI or 58 days post-SCI), the ROS levels of lesion tissues were estimated. The same batch of TBI ( n n i.v. Estimation of inflammatory cytokines For inflammatory cytokines (IL-1 β α n n Histological evaluation For histological evaluation, dissected brains ( n n Brain snRNA-seq analysis TBI model mice were divided into two groups randomly including PBS and SeNExo, and the sham group with PBS treatment was utilized as the healthy control. Mice were i.v. 11 Figure 3 Denovo Denovo For pseudo-time analysis, we utilized Monocle2 (version 2.8.0) to reconstruct the development trajectory of microglia, OPCs, and oligodendrocytes. 42 42 P2ry12 Ptprk Fth1 Trem2 41 , 43 64 46 https://www.CellphoneDB.org/ p Biosafety analysis Blood samples from sham and SeNExo-treated TBI model mice or SCI model mice were collected for hematology to assess the safety of SeNExo. Major organs (heart, liver, spleen, lung, and kidney) were harvested and cut into 10-μm slices. Following hematoxylin and eosin staining, the slices were examined by using an automatic multispectral imaging system (Vectra III, AKOYA) with Vectra software (v.2.0.7.1 version). Quantification and statistical analysis All results are expressed as a mean ± standard deviation unless specified otherwise. Statistical analyses were conducted with GraphPad Prism 9.0.0. Statistical analysis was performed using one-way analysis of variance (ANOVA, comparison among more than two groups) or two-tailed Student’s t test (comparison between two groups). For the snRNA-seq analysis, cell clustering, UMAP visualization, heatmaps, Venn diagrams, Sankey plots, scatterplots, and pseudo-time trajectory visualizations were performed using the Omicsmart platform ( http://www.omicsmart.com 52 References 1 GBD Spinal Cord Injuries Collaborators Global, regional, and national burden of spinal cord injury, 1990-2019: a systematic analysis for the global burden of disease study 2019 Lancet Neurol. 22 2023 1026 1047 10.1016/S1474-4422(24)00095-4 37863591 PMC10584692 2 Maas A.I.R. Menon D.K. Manley G.T. Abrams M. Åkerlund C. Andelic N. Aries M. Bashford T. Bell M.J. Bodien Y.G. Traumatic brain injury: progress and challenges in prevention, clinical care, and research Lancet Neurol. 21 2022 1004 1060 10.1016/s1474-4422(22)00309-x 36183712 PMC10427240 3 Savic G. DeVivo M.J. Frankel H.L. Jamous M.A. Soni B.M. Charlifue S. Long-term survival after traumatic spinal cord injury: a 70-year British study Spinal Cord 55 2017 651 658 10.1038/sc.2017.23 28290467 4 Blennow K. Brody D.L. Kochanek P.M. Levin H. McKee A. Ribbers G.M. Yaffe K. Zetterberg H. Traumatic brain injuries Nat. Rev. Dis. Primers 2 2016 16084 10.1038/nrdp.2016.84 27853132 5 Ahuja C.S. Wilson J.R. Nori S. Kotter M.R.N. Druschel C. Curt A. Fehlings M.G. Traumatic spinal cord injury Nat. Rev. Dis. Primers 3 2017 17018 10.1038/nrdp.2017.18 28447605 6 Wangler L.M. Godbout J.P. Microglia moonlighting after traumatic brain injury: aging and interferons influence chronic microglia reactivity Trends Neurosci. 46 2023 926 940 10.1016/j.tins.2023.08.008 37723009 PMC10592045 7 Block M.L. Zecca L. Hong J.S. Microglia-mediated neurotoxicity: uncovering the molecular mechanisms Nat. Rev. Neurosci. 8 2007 57 69 10.1038/nrn2038 17180163 8 Greenhalgh A.D. David S. Bennett F.C. Immune cell regulation of glia during CNS injury and disease Nat. Rev. Neurosci. 21 2020 139 152 10.1038/s41583-020-0263-9 32042145 9 Simon D.W. McGeachy M.J. Bayır H. Clark R.S.B. Loane D.J. Kochanek P.M. The far-reaching scope of neuroinflammation after traumatic brain injury Nat. Rev. Neurol. 13 2017 171 191 10.1038/nrneurol.2017.13 28186177 PMC5675525 10 Babior B.M. Phagocytes and oxidative stress Am. J. Med. 109 2000 33 44 10.1016/s0002-9343(00)00481-2 10936476 11 Pawate S. Shen Q. Fan F. Bhat N.R. Redox regulation of glial inflammatory response to lipopolysaccharide and interferongamma J. Neurosci. Res. 77 2004 540 551 10.1002/jnr.20180 15264224 12 Sies H. Jones D.P. Reactive oxygen species (ROS) as pleiotropic physiological signalling agents Nat. Rev. Mol. Cell Biol. 21 2020 363 383 10.1038/s41580-020-0230-3 32231263 13 Assinck P. Duncan G.J. Hilton B.J. Plemel J.R. Tetzlaff W. Cell transplantation therapy for spinal cord injury Nat. Neurosci. 20 2017 637 647 10.1038/nn.4541 28440805 14 Nie L. Yao D. Chen S. Wang J. Pan C. Wu D. Liu N. Tang Z. Directional induction of neural stem cells, a new therapy for neurodegenerative diseases and ischemic stroke Cell Death Discov. 9 2023 215 10.1038/s41420-023-01532-9 37393356 PMC10314944 15 Genchi A. Brambilla E. Sangalli F. Radaelli M. Bacigaluppi M. Furlan R. Andolfo A. Drago D. Magagnotti C. Scotti G.M. Neural stem cell transplantation in patients with progressive multiple sclerosis: an open-label, phase 1 study Nat. Med . 29 2023 75 85 10.1038/s41591-022-02097-3 36624312 PMC9873560 16 Chang F.-C. James M.M. Qassab A.M. Zhou Y. Ando Y. Shi M. Zhang M. 3D chitosan scaffolds support expansion of human neural stem cells in chemically defined condition Matter 6 2023 3631 3660 10.1016/j.matt.2023.08.014 17 Amer M.H. Rose F.R.A.J. Shakesheff K.M. Modo M. White L.J. Translational considerations in injectable cell-based therapeutics for neurological applications: concepts, progress and challenges NPJ Regen. Med. 2 2017 23 10.1038/s41536-017-0028-x 29302358 PMC5677964 18 Sinden J.D. Hicks C. Stroemer P. Vishnubhatla I. Corteling R. Human neural stem cell therapy for chronic ischemic stroke: charting progress from laboratory to patients Stem Cells Dev. 26 2017 933 947 10.1089/scd.2017.0009 28446071 PMC5510676 19 Curtis E. Martin J.R. Gabel B. Sidhu N. Rzesiewicz T.K. Mandeville R. Van Gorp S. Leerink M. Tadokoro T. Marsala S. A first-in-human, phase I study of neural stem cell transplantation for chronic spinal cord injury Cell Stem Cell 22 2018 941 950.e6 10.1016/j.stem.2018.05.014 29859175 20 Zhu Y. Huang R. Wu Z. Song S. Cheng L. Zhu R. Deep learning-based predictive identification of neural stem cell differentiation Nat. Commun. 12 2021 2614 10.1038/s41467-021-22758-0 33972525 PMC8110743 21 Zhang K. Lu W.-C. Zhang M. Zhang Q. Xian P.-P. Liu F.-F. Chen Z.-Y. Kim C.S. Wu S.-X. Tao H.-R. Wang Y.-Z. Reducing host aldose reductase activity promotes neuronal differentiation of transplanted neural stem cells at spinal cord injury sites and facilitates locomotion recovery Neural Regen. Res. 17 2022 1814 1820 10.4103/1673-5374.330624 35017443 PMC8820702 22 Popowski K.D. Moatti A. Scull G. Silkstone D. Lutz H. López de Juan Abad B. George A. Belcher E. Zhu D. Mei X. Inhalable dry powder mRNA vaccines based on extracellular vesicles Matter 5 2022 2960 2974 10.1016/j.matt.2022.06.012 35847197 PMC9272513 23 Guo J. Wang F. Hu Y. Luo Y. Wei Y. Xu K. Zhang H. Liu H. Bo L. Lv S. Exosome-based bone-targeting drug delivery alleviates impaired osteoblastic bone formation and bone loss in inflammatory bowel diseases Cell Rep. Med. 4 2023 100881 10.1016/j.xcrm.2022.100881 PMC9873828 36603578 24 Zhang Z.G. Buller B. Chopp M. Exosomes-beyond stem cells for restorative therapy in stroke and neurological injury Nat. Rev. Neurol. 15 2019 193 203 10.1038/s41582-018-0126-4 30700824 25 Vogel A.D. Upadhya R. Shetty A.K. Neural stem cell derived extracellular vesicles: Attributes and prospects for treating neurodegenerative disorders EBioMedicine 38 2018 273 282 10.1016/j.ebiom.2018.11.026 30472088 PMC6306394 26 Rong Y. Liu W. Wang J. Fan J. Luo Y. Li L. Kong F. Chen J. Tang P. Cai W. Neural stem cell-derived small extracellular vesicles attenuate apoptosis and neuroinflammation after traumatic spinal cord injury by activating autophagy Cell Death Dis. 10 2019 340 10.1038/s41419-019-1571-8 31000697 PMC6472377 27 Upadhya R. Madhu L.N. Attaluri S. Gitaí D.L.G. Pinson M.R. Kodali M. Shetty G. Zanirati G. Kumar S. Shuai B. Extracellular vesicles from human iPSC-derived neural stem cells: miRNA and protein signatures, and anti-inflammatory and neurogenic properties J. Extracell. Vesicles 9 2020 1809064 10.1080/20013078.2020.1809064 PMC7480597 32944193 28 Alim I. Caulfield J.T. Chen Y. Swarup V. Geschwind D.H. Ivanova E. Seravalli J. Ai Y. Sansing L.H. Ste Marie E.J. Selenium drives a transcriptional adaptive program to block ferroptosis and treat Stroke Cell 177 2019 1262 1279.e25 10.1016/j.cell.2019.03.032 31056284 29 Cong W. Bai R. Li Y.F. Wang L. Chen C. Selenium Nanoparticles as an Efficient Nanomedicine for the Therapy of Huntington's Disease ACS Appl. Mater. Interfaces 11 2019 34725 34735 10.1021/acsami.9b12319 31479233 30 Wu Z. Ren Y. Liang Y. Huang L. Yang Y. Zafar A. Hasan M. Yang F. Shu X. Synthesis, characterization, immune regulation, and antioxidative assessment of yeast-derived selenium nanoparticles in cyclophosphamide-induced rats ACS Omega 6 2021 24585 24594 10.1021/acsomega.1c03205 34604640 PMC8482516 31 Lin X. Wang L. Zhao J. He L. Cui L. Gao Y. Chen C. Fan Y. Li B. Li Y.F. Nanosafety evaluation through feces: A comparison between selenium nanoparticles and selenite in rats Nano Today 36 2021 101010 10.1016/j.nantod.2020.101010 32 Chaudhary S. Umar A. Mehta S.K. Selenium nanomaterials: An overview of recent developments in synthesis, properties and potential applications Prog. Mater. Sci. 83 2016 270 329 10.1016/j.pmatsci.2016.07.001 33 Zhu B. Eom J. Hunt R.F. Transplanted interneurons improve memory precision after traumatic brain injury Nat. Commun. 10 2019 5156 10.1038/s41467-019-13170-w 31727894 PMC6856380 34 Li W. Qiu J. Li X.L. Aday S. Zhang J. Conley G. Xu J. Joseph J. Lan H. Langer R. BBB pathophysiology-independent delivery of siRNA in traumatic brain injury Sci. Adv. 7 2021 eabd6889 10.1126/sciadv.abd6889 PMC7775748 33523853 35 Zuo Y. Ye J. Cai W. Guo B. Chen X. Lin L. Jin S. Zheng H. Fang A. Qian X. Controlled delivery of a neurotransmitter-agonist conjugate for functional recovery after severe spinal cord injury Nat. Nanotechnol. 18 2023 1230 1240 10.1038/s41565-023-01416-0 37308588 36 He C. Li J. Cai P. Ahmed T. Henderson J.T. Foltz W.D. Bendayan R. Rauth A.M. Wu X.Y. Two-step targeted hybrid nanoconstructs increase brain penetration and efficacy of the therapeutic antibody trastuzumab against brain metastasis of HER2-positive breast cancer Adv. Funct. Mater. 28 2018 1705668 10.1002/adfm.201705668 37 Huang B. Tang T. Chen S.-H. Li H. Sun Z.-J. Zhang Z.-L. Zhang M. Cui R. Near-infrared-IIb emitting single-atom catalyst for imaging-guided therapy of blood-brain barrier breakdown after traumatic brain injury Nat. Commun. 14 2023 197 10.1038/s41467-023-35868-8 36639379 PMC9839749 38 Mu X. Wang J. He H. Li Q. Yang B. Wang J. Liu H. Gao Y. Ouyang L. Sun S. An oligomeric semiconducting nanozyme with ultrafast electron transfers alleviates acute brain injury Sci. Adv. 7 2021 eabk1210 10.1126/sciadv.abk1210 PMC8580303 34757781 39 Ismail H. Shakkour Z. Tabet M. Abdelhady S. Kobaisi A. Abedi R. Nasrallah L. Pintus G. Al-Dhaheri Y. Mondello S. Traumatic brain injury: oxidative stress and novel anti-oxidants such as mitoquinone and edaravone Antioxidants 9 2020 943 10.3390/antiox9100943 33019512 PMC7601591 40 Zhang W. Krafft P.R. Wang T. Zhang J.H. Li L. Tang J. Pathophysiology of ganglioside GM1 in ischemic stroke: ganglioside GM1: a critical review Cell Transplant. 28 2019 657 661 10.1177/0963689718822782 30666888 PMC6686431 41 Hammond T.R. Dufort C. Dissing-Olesen L. Giera S. Young A. Wysoker A. Walker A.J. Gergits F. Segel M. Nemesh J. Single-cell RNA sequencing of microglia throughout the mouse lifespan and in the injured brain reveals complex cell-state changes Immunity 50 2019 253 271.e6 10.1016/j.immuni.2018.11.004 30471926 PMC6655561 42 Qiu X. Mao Q. Tang Y. Wang L. Chawla R. Pliner H.A. Trapnell C. Reversed graph embedding resolves complex single-cell trajectories Nat. Methods 14 2017 979 982 10.1038/nmeth.4402 28825705 PMC5764547 43 Absinta M. Maric D. Gharagozloo M. Garton T. Smith M.D. Jin J. Fitzgerald K.C. Song A. Liu P. Lin J.P. A lymphocyte-microglia-astrocyte axis in chronic active multiple sclerosis Nature 597 2021 709 714 10.1038/s41586-021-03892-7 34497421 PMC8719282 44 Linley J.E. Ooi L. Pettinger L. Kirton H. Boyle J.P. Peers C. Gamper N. Reactive oxygen species are second messengers of neurokinin signaling in peripheral sensory neurons Proc. Natl. Acad. Sci. USA 109 2012 1578 1586 10.1073/pnas.1201544109 22586118 PMC3386117 45 Garden G.A. La Spada A.R. Intercellular (mis)communication in neurodegenerative disease Neuron 73 2012 886 901 10.1016/j.neuron.2012.02.017 22405200 PMC3334539 46 Efremova M. Vento-Tormo M. Teichmann S.A. Vento-Tormo R. CellPhoneDB: inferring cell-cell communication from combined expression of multi-subunit ligand-receptor complexes Nat. Protoc. 15 2020 1484 1506 10.1038/s41596-020-0292-x 32103204 47 Cheriyan T. Ryan D.J. Weinreb J.H. Cheriyan J. Paul J.C. Lafage V. Kirsch T. Errico T.J. Spinal cord injury models: a review Spinal Cord 52 2014 588 595 10.1038/sc.2014.91 24912546 48 Leibinger M. Zeitler C. Gobrecht P. Andreadaki A. Gisselmann G. Fischer D. Transneuronal delivery of hyper-interleukin-6 enables functional recovery after severe spinal cord injury in mice Nat. Commun. 12 2021 391 10.1038/s41467-020-20112-4 33452250 PMC7810685 49 Gao X. Zhang J. Zhang L. Hollow sphere selenium nanoparticles: their in-vitro anti hydroxyl radical effect Adv. Mater. 14 2002 290 293 10.1002/1521-4095(20020219)14:4&#x0003c;290::AIDADMA290&#x0003e;3.0.CO;2-U 50 Huang Y. Ren J. Qu X. Nanozymes: classification, catalytic mechanisms, activity regulation, and applications Chem. Rev. 119 2019 4357 4412 10.1021/acs.chemrev.8b00672 30801188 51 Wang Z. Popowski K.D. Zhu D. De Juan Abad B.L. Wang X. Liu M. Lutz H. De Naeyer N. DeMarco C.T. Denny T.N. Exosomes decorated with a recombinant SARS-CoV-2 receptor-binding domain as an inhalable COVID-19 vaccine Nat. Biomed. Eng. 6 2022 791 805 10.1038/s41551-022-00902-5 35788687 PMC10782831 52 Shannon P. Markiel A. Ozier O. Baliga N.S. Wang J.T. Ramage D. Amin N. Schwikowski B. Ideker T. Cytoscape: a software environment for integrated models of biomolecular interaction networks Genome Res. 13 2003 2498 2504 10.1101/gr.1239303 14597658 PMC403769 53 Gao B. Zhao Y. Du X. Li D. Ding S. Li Y. Xiao C. Song Z. Electron injection induced phase transition of 2H to 1T MoS 2 Chem. Eng. J. 411 2021 128567 10.1016/j.cej.2021.128567 54 Kresse G. Furthmüller J. Efficient iterative schemes for ab initio total-energy calculations using a plane-wave basis set Phys. Rev. B Condens. Matter 54 1996 11169 11186 10.1103/physrevb.54.11169 9984901 55 Perdew J.P. Burke K. Ernzerhof M. Generalized gradient approximation made simple Phys. Rev. Lett. 77 1996 3865 3868 10.1103/PhysRevLett.77.3865 10062328 56 Zhang S.-Q. Shen S. Zhang Y. Comparison of bioavailability, pharmacokinetics, and biotransformation of selenium-enriched yeast and sodium selenite in rats using plasma selenium and selenomethionine Biol. Trace Elem. Res. 196 2020 512 516 10.1007/s12011-019-01935-9 31707637 57 Sharma K. Schmitt S. Bergner C.G. Tyanova S. Kannaiyan N. Manrique-Hoyos N. Kongi K. Cantuti L. Hanisch U.-K. Philips M.-A. Cell type– and brain region–resolved mouse brain proteome Nat. Neurosci. 18 2015 1819 1831 10.1038/nn.4160 26523646 PMC7116867 58 Korin B. Dubovik T. Rolls A. Mass cytometry analysis of immune cells in the brain Nat. Protoc. 13 2018 377 391 10.1038/nprot.2017.155 29370157 59 Beaudet M.-J. Yang Q. Cadau S. Blais M. Bellenfant S. Gros-Louis F. Berthod F. High yield extraction of pure spinal motor neurons, astrocytes and microglia from single embryo and adult mouse spinal cord Sci. Rep. 5 2015 16763 10.1038/srep16763 PMC4649473 26577180 60 Kirkegaard T. Roth A.G. Petersen N.H.T. Mahalka A.K. Olsen O.D. Moilanen I. Zylicz A. Knudsen J. Sandhoff K. Arenz C. Hsp70 stabilizes lysosomes and reverts niemann–pick disease-associated lysosomal pathology Nature 463 2010 549 553 10.1038/nature08710 20111001 61 Sudhakar J.N. Lu H.-H. Chiang H.-Y. Suen C.-S. Hwang M.-J. Wu S.-Y. Shen C.-N. Chang Y.-M. Li F.-A. Liu F.-T. Shui J.W. Lumenal galectin-9-Lamp2 interaction regulates lysosome and autophagy to prevent pathogenesis in the intestine and pancreas Nat. Commun. 11 2020 4286 10.1038/s41467-020-18102-7 32855403 PMC7453023 62 Li J. Wu J. Zhang X. Liu Y. Zhou D. Sun H. Zhang H. Yang B. Controllable synthesis of stable urchin-like gold nanoparticles using hydroquinone to tune the reactivity of gold chloride J. Phys. Chem. C 115 2011 3630 3637 10.1021/jp1119074 63 Hong L.T.A. Kim Y.M. Park H.H. Hwang D.H. Cui Y. Lee E.M. Yahn S. Lee J.K. Song S.C. Kim B.G. An injectable hydrogel enhances tissue repair after spinal cord injury by promoting extracellular matrix remodeling Nat. Commun. 8 2017 533 10.1038/s41467-017-00583-8 28912446 PMC5599609 64 Jäkel S. Agirre E. Mendanha Falcão A. van Bruggen D. Lee K.W. Knuesel I. Malhotra D. ffrench-Constant C. Williams A. Castelo-Branco G. Altered human oligodendrocyte heterogeneity in multiple sclerosis Nature 566 2019 543 547 10.1038/s41586-019-0903-2 30747918 PMC6544546 Supplemental information  Document S1. Figures S1–S6 Document S2. Article plus supplemental information Supplemental information can be found online at https://doi.org/10.1016/j.xcrm.2025.102319 ",
  "metadata": {
    "Title of this paper": "Altered human oligodendrocyte heterogeneity in multiple sclerosis",
    "Journal it was published in:": "Cell Reports Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490213/"
  }
}