{
  "title": "Paper_364",
  "abstract": "pmc NPJ Breast Cancer NPJ Breast Cancer 3134 npjbcancer NPJ Breast Cancer 2374-4677 Nature Publishing Group PMC12484999 PMC12484999.1 12484999 12484999 41027929 10.1038/s41523-025-00820-0 820 1 Article Polygenic risk score for breast cancer risk prediction in Asian BRCA1 BRCA2 Tai Mei-Chee 1 Dennis Joe 2 Park Sue K. 3 4 5 Kim Sung-Won 6 Lee Jong Won 7 Hassan Nur Tiara 1 Kwong Ava 8 9 10 Hartman Mikael 11 12 13 Yoon Sook-Yee 1 Ngeow Joanne 14 15 Woo Yin-Ling 16 Park Boyoung 17 Wong Zhi-Lei 1 Leslie Goska 2 Bolla Manjeet K. 2 Barnes Daniel R. 2 Parsons Michael T. 18 Soucy Penny 19 Simard Jacques 19 Mohd Taib Nur Aishah 20 21 Yip Cheng-Har 22 23 Easton Douglas F. 2 24 Chenevix-Trench Georgia 25 Antoniou Antonis C. 2 Teo Soo-Hwang 1 20 Ho Weang-Kee WeangKee.Ho@nottingham.edu.my 1 26 1 https://ror.org/00g0aq541 grid.507182.9 0000 0004 1786 3427 Cancer Research Malaysia, 2 https://ror.org/013meh722 grid.5335.0 0000 0001 2188 5934 Centre for Cancer Genetic Epidemiology, Department of Public Health and Primary Care, University of Cambridge, 3 https://ror.org/04h9pn542 grid.31501.36 0000 0004 0470 5905 Department of Preventive Medicine, Seoul National University College of Medicine, 4 https://ror.org/04h9pn542 grid.31501.36 0000 0004 0470 5905 Cancer Research Institute, Seoul National University, 5 https://ror.org/04h9pn542 grid.31501.36 0000 0004 0470 5905 Integrated Major in Innovative Medical Science, Seoul National University College of Medicine, 6 https://ror.org/056cn0e37 grid.414966.8 0000 0004 0647 5752 Department of Surgery, Daerim St. Mary’s Hospital, 7 https://ror.org/03s5q0090 grid.413967.e 0000 0004 5947 6580 Department of Surgery, Ulsan College of Medicine and Asan Medical Center, 8 https://ror.org/010mjn423 grid.414329.9 0000 0004 1764 7097 Cancer Genetics Centre and Breast Surgery Centre, Hong Kong Sanatorium and Hospital, 9 10 https://ror.org/02zhqgq86 grid.194645.b 0000 0001 2174 2757 Division of Breast Surgery, Department of Surgery, The University of Hong Kong, 11 https://ror.org/05tjjsh18 grid.410759.e 0000 0004 0451 6143 Department of Surgery, National University Hospital and National University Health System, 12 https://ror.org/01tgyzw49 grid.4280.e 0000 0001 2180 6431 Department of Surgery, Yong Loo Lin School of Medicine, National University of Singapore and National University Health System, 13 https://ror.org/01tgyzw49 grid.4280.e 0000 0001 2180 6431 Saw Swee Hock School of Public Health, National University of Singapore and National University Health System, 14 https://ror.org/03bqk3e80 grid.410724.4 0000 0004 0620 9745 Cancer Genetics Service, National Cancer Centre Singapore, 15 https://ror.org/02e7b5302 grid.59025.3b 0000 0001 2224 0361 Lee Kong Chian School of Medicine, Nanyang Technological University, 16 https://ror.org/00rzspn62 grid.10347.31 0000 0001 2308 5949 Department of Obstetrics and Gynaecology, Faculty of Medicine, University of Malaya, 17 https://ror.org/046865y68 grid.49606.3d 0000 0001 1364 9317 Department of Preventive Medicine, Hanyang University College of Medicine, 18 https://ror.org/004y8wk30 grid.1049.c 0000 0001 2294 1395 Public Health Division, QIMR Berghofer Medical Research Institute, 19 https://ror.org/006a7pj43 grid.411081.d 0000 0000 9471 1794 Genomics Center, CHU de Québec-Université Laval Research Center, 20 https://ror.org/00rzspn62 grid.10347.31 0000 0001 2308 5949 Department of Surgery, Faculty of Medicine, University of Malaya, 21 https://ror.org/00rzspn62 grid.10347.31 0000 0001 2308 5949 University Malaya Cancer Research Institute (UMCRI), University of Malaya, Kuala Lumpur, 22 https://ror.org/05b01nv96 grid.415921.a 0000 0004 0647 0388 Sime Darby Medical Centre, 23 https://ror.org/00gyq3v51 grid.490396.1 Picaso Hospital, 24 https://ror.org/013meh722 grid.5335.0 0000 0001 2188 5934 Centre for Cancer Genetic Epidemiology, Department of Oncology, University of Cambridge, 25 https://ror.org/00x362k69 grid.278859.9 0000 0004 0486 659X Department of Haematology-Oncology, University of Adelaide, The Queen Elizabeth Hospital, 26 https://ror.org/04mz9mt17 grid.440435.2 School of Mathematical Sciences, Faculty of Science and Engineering, University of Nottingham Malaysia, 30 9 2025 2025 11 478466 105 12 12 2024 20 8 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Polygenic risk scores (PRS) have been shown to be predictive of breast cancer (BC) risk in European BRCA1 BRCA2 BRCA1 BRCA2 BRCA1 BRCA2 Subject terms Cancer epidemiology Population genetics Genetic predisposition to disease Wellcome Trust v203477/Z/16/Z v203477/Z/16/Z v203477/Z/16/Z Basser Centre grant Wellcome Trust Career Development Award 227824/Z/23/Z (UNS146816) pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Women with pathogenic or likely pathogenic variants (PV) in BRCA1 BRCA2 1 BRCA1 BRCA2 2 6 7 Polygenic risk scores (PRS), combining the effects of multiple disease-associated single nucleotide variations (SNVs), have emerged as powerful tools for breast cancer risk stratification in European populations, both in the general population and BRCA1 BRCA2 3 4 8 313 9 333 10 10 11 GW In this study, we aimed to evaluate if these PRS can predict the risk of breast cancer in BRCA1 BRCA2 Results The study cohort consists of 604 BRCA1 BRCA2 S1 BRCA1 BRCA2 BRCA1 BRCA2 1 Table 1 Description of study cohort Description BRCA1 BRCA2 Total Aff (%) Unaff (%) Total Aff (%) Unaff (%) Total, N 604 390 (100.0) 214 (100.0) 785 552 (100.0) 233 (100.0) Country Malaysia 255 126 (32.3) 129 (60.3) 220 143 (25.9) 77 (33.0) Korea 218 159 (40.8) 59 (27.6) 359 229 (41.5) 130 (55.8) Hong Kong 67 52 (13.3) 15 (7.0) 93 74 (13.4) 19 (8.2) Singapore 64 53 (13.6) 11 (5.1) 113 106 (19.2) 7 (3.0) Year of Birth ≤1940 15 6 (1.5) 9 (4.2) 16 15 (2.7) 1 (0.4) 1941-1950 40 22 (5.6) 18 (8.4) 71 58 (10.5) 13 (5.6) 1951-1960 127 86 (22.1) 41 (19.2) 193 140 (25.4) 53 (22.7) 1961-1970 172 118 (30.3) 54 (25.2) 256 189 (34.2) 67 (28.8) >1970 250 158 (40.5) 92 (43.0 249 150 (27.2) 99 (42.5) Censoring age Mean (SD) 42.9 (12.0) 40.9 (10.2) 46.5 (13.9) 44.1 (11.4) 44.3 (10.2) 43.4 (13.8) Range 19.13-80.91 19.73–73.63 19.13–80.91 19.19–80.94 22.74–77.77 19.19–80.94 Censoring age group ≤30 74 45 (11.5) 29 (13.6) 71 25 (4.5) 46 (19.7) 30-40 211 165 (42.3) 46 (21.5) 239 191 (34.6) 48 (20.6) 40-50 163 108 (27.7) 55 (25.7) 245 184 (33.3) 61 (26.2) 50-60 94 51 (13.1) 43 (20.1) 159 110 (19.9) 49 (21.0) >60 62 21 (5.4) 41 (19.2) 71 42 (7.6) 29 (12.4) Aff Unaff SD PRS association with breast cancer risk Five PRS, which were previously demonstrated to be predictive for breast cancer risk in the general Asian population,n were selected for analysis: three based on PRS developed through analyses of studies in the Breast Cancer Association Consortium in European populations 8 9 10 S2 BRCA1 BRCA2 GW p 2 GW BRCA1 p BRCA2 p S3 Table 2 Association of PRSs with BC risk in BRCA carriers PRS BRCA1 BRCA2 HR (95% CI) p HR (95% CI) p Asian PRS PRS 333 1.15 (0.97–1.36) 0.1046 1.04 (0.88–1.22) 0.6755 PRS GWS 1.47 (1.10–1.95) 0.0089 1.43 (1.04–1.95) 0.0255 European PRS PRS OVERALL 1.16 (0.98–1.37) 0.0761 1.09 (0.92–1.28) 0.3343 PRS ER+ 1.16 (0.98–1.38) 0.0862 1.10 (0.92–1.30) 0.3042 PRS ER- 1.12 (0.95–1.32) 0.1905 1.07 (0.89–1.29) 0.4738 Analysis was conducted using weighted Cox regression, with the weights estimated based on the average breast cancer incidence among BRCA carriers in four countries. Aff Unaff We further evaluated the association between PRS GW BRCA1 3 BRCA2 Table 3 Proportion of samples in percentile categories of PRS GW Percentile BRCA1 BRCA2 Unaff. Aff. Estimated HR (95% CI) Predicted HR Unaff. Aff. Estimated HR (95% CI) Predicted HR 0-20 44 57 0.89 (0.52–1.52) 0.59 48 62 0.44 (0.24–0.80) 0.61 20-40 43 42 0.61 (0.34–1.07) 0.82 47 91 0.91 (0.53–1.59) 0.83 40-60 43 72 1 1 47 109 1 1 60-80 43 102 1.57 (0.96–2.55) 1.23 47 136 1.22 (0.73–2.04) 1.21 80-100 44 121 1.57 (0.99–2.49) 1.23 47 155 1.09 (0.67–1.80) 1.67 Aff Unaff Predicted absolute risk by PRS percentile We used the hazard ratio estimates and the average breast cancer incidence across the four countries included in this study to compute age-specific absolute cumulative breast cancer risks for PV carriers by PRS percentiles according to PRS GW 1 BRCA1 th BRCA1 th BRCA2 th BRCA2 th Fig. 1 Age-specific absolute cumulative breast cancer risks for PV carriers by PRS percentiles according to PRS GW a BRCA1 b) BRCA2 Discussion In this study, we evaluated the association of PRS, previously validated in the Asian general population, with the risk of breast cancer among carriers of BRCA1 BRCA2 GW BRCA1 BRCA2 This is qualitatively consistent with our previous observations in the general population, which showed that PRS GW 333 OVERALL 10 GW 11 We found that the estimated effect sizes for all of the PRS on cancer risks in BRCA1 BRCA2 GW BRCA1 BRCA2 4 8 In the European studies, the PRS adapted for ER-negative breast cancer (PRS ER- OVERALL BRCA1 BRCA1 OVERALL BRCA2 OVERALL BRCA1 BRCA2 Previous research by Kuchenbäcker et al. 3 BRCA BRCA1 BRCA2 BRCA1 BRCA2 BRCA BRCA We showed that PRS GW BRCA1 BRCA2 1 6 GW BRCA1 BRCA2 BRCA- One limitation of our study is that although this is the largest available dataset for Asian BRCA1 BRCA2 BRCA1 S4 In summary, the results demonstrate the potential utility of PRS GW BRCA1 BRCA2 Methods Study population Eligible study subjects included in the Consortium of Investigators of Modifiers of BRCA1/2 BRCA1 BRCA2 https://www.ncbi.nlm.nih.gov/clinvar/ https://enigmaconsortium.org/ S1 BRCA1 BRCA2 12 13 14 15 Polygenic Risk Score PRS were computed using the standard formula: 1 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${PRS}=\\,{\\beta }_{1}{x}_{1}+{\\beta }_{2}{x}_{2}+...+{\\beta }_{k}{x}_{k}+\\ldots +{\\beta }_{n}{x}_{n}$$\\end{document} PRS = β 1 x 1 + β 2 x 2 + . . . + β k x k + … + β n x n x k k β k k The list of SNVs and their corresponding log odds ratios is in accordance with those reported in previous publications. PRS OVERALL 9 ER+ ER- OVERALL et 333 OVERALL 10 333 2 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${{\\rm{PRS}}}_{333}={{\\rm{\\alpha }}}_{1}{{\\rm{PRS}}}_{{\\rm{ASN}}}+{{\\rm{\\alpha }}}_{2}{{\\rm{PRS}}}_{{\\rm{OVERALL}}}+{{\\rm{\\alpha }}}_{0},$$\\end{document} PRS 333 = α 1 PRS ASN + α 2 PRS OVERALL + α 0 , 1 2 0 ASN GW 3 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${{\\rm{PRS}}}_{{\\rm{GW}}}={{\\rm{\\alpha }}}_{1}{{\\rm{PRS}}}_{{\\rm{GW\\_ASN}}}+{{\\rm{\\alpha }}}_{2}{{\\rm{PRS}}}_{{\\rm{GW\\_EUR}}}+{{\\rm{\\alpha }}}_{0},$$\\end{document} PRS GW = α 1 PRS GW_ASN + α 2 PRS GW_EUR + α 0 , 1 2 0 To facilitate a direct comparison of the performance of each PRS, we standardized the PRS to the standard deviation (SD) of the PRS in the validation set of control subjects previously reported 9 10 Statistical analysis The association between each PRS and the incidence of breast cancer was evaluated in a survival analysis framework. Individuals were considered at risk from birth and censored at the age of the first breast or ovarian cancer diagnosis, age at bilateral prophylactic mastectomy, or the age at last follow-up. There were two women in the study with censoring age > 80 (both with age of last follow-up at age 81). PV carriers censored at ovarian cancer diagnosis were considered unaffected for the breast cancer analysis. To account for the oversampling of affected BRCA1 BRCA2 16 BRCA1 BRCA2 6 BRCA1 BRCA2 BRCA1 BRCA2 S5 S6 PRS was treated as either a continuous or a categorical variable in the model. The first 4 ancestry principal components (PCs) and birth cohort (in decades) were included as covariates. The robust variance approach was used to account for related individuals in the study by clustering on family membership. All models were fitted separately in BRCA1 BRCA2 17 The age-specific absolute risks of developing breast cancer in each PRS percentile were calculated using the following formula described in Barnes et al. 4 4 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${\\mathrm{AR}}_{{\\rm{g}}}\\left(t\\right)=\\mathop{\\sum }\\limits_{u=0}^{t}{\\lambda }_{{\\rm{g}}}\\left(u\\right)\\cdot {{\\rm{S}}}_{{\\rm{g}}}(u)$$\\end{document} AR g t = ∑ u = 0 t λ g u · S g ( u ) \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${\\lambda }_{{\\rm{g}}}$$\\end{document} λ g u \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${\\lambda }_{0}\\left(u\\right)\\exp {(\\beta }_{g})$$\\end{document} λ 0 u exp ( β g ) u \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${\\lambda }_{0}\\left(u\\right)$$\\end{document} λ 0 u \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${\\beta }_{g}$$\\end{document} β g g g u u \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${\\lambda }_{{\\rm{g}}}$$\\end{document} λ g u BRCA1 BRCA2 All statistical analyses were conducted using R v.3.6.3. Supplementary information  Supplementary Information Publisher’s note These authors jointly supervised this work: Soo-Hwang Teo, Weang-Kee Ho. Supplementary information The online version contains supplementary material available at 10.1038/s41523-025-00820-0. Acknowledgements This study was supported by Wellcome Trust grant [grant no: v203477/Z/16/Z] and Basser Centre grant. W.-K.H. is funded by Wellcome Trust Career Development Award [grant no. 227824/Z/23/Z (UNS146816)]. J. D. was supported by core funding from the NIHR Cambridge Biomedical Research Centre (NIHR203312). CIMBA is supported by Cancer Research U grant: PPRPGM-Nov20\\100002, and the Gray Foundation. This work was supported by core funding from the NIHR Cambridge Biomedical Research Centre (NIHR203312) [*]. Genotyping of the OncoArray was funded by the NIH Grant U19 CA148065, and Cancer Research UK Grant C1287/A16563 and the PERSPECTIVE project supported by the Government of Canada through Genome Canada and the Canadian Institutes of Health Research (grant GPH-129344) and, the Ministère de l’Économie, Science et Innovation du Québec through Genome Québec and the PSRSIIRI-701 grant, and the Quebec Breast Cancer Foundation. Funding for iCOGS came from: the European Community's Seventh Framework Programme under grant agreement n° 223175 (HEALTH-F2-2009-223175) (COGS), Cancer Research UK (C1287/A10118, C1287/A10710, C12292/A11174, C1281/A12014, C5047/A8384, C5047/A15007, C5047/A10692, C8197/A16565), the National Institutes of Health (CA128978) and Post-Cancer GWAS initiative (1U19 CA148537, 1U19 CA148065 and 1U19 CA148112 - the GAME-ON initiative), the Department of Defence (W81XWH-10-1-0341), the Canadian Institutes of Health Research (CIHR) for the CIHR Team in Familial Risks of Breast Cancer, and Komen Foundation for the Cure, the Breast Cancer Research Foundation, and the Ovarian Cancer Research Fund. KOHBRA is supported by a grant from the National R&D Program for Cancer Control, Ministry for Health, Welfare and Family Affairs, Republic of Korea (1020350). MyBrCa was funded by the Malaysian Ministry of Science, the Malaysian Ministry of Higher Education High Impact Research Grant (Grant No.: UM.C/HIR MOHE/06). MaGiC was funded in part through an AstraZeneca External Investigator Grant. MyBrCa, MyOvCa and MaGiC were funded by charitable funds from Yayasan Sime Darby, Yayasan PETRONAS, Estee Lauder Group of Companies, Khind Starfish Foundation, Vistage Group of Companies and other donors of Cancer Research Malaysia. SGBCC is funded by the National Research Foundation Singapore, NUS start-up Grant, National University Cancer Institute Singapore (NCIS) Centre Grant, Breast Cancer Prevention Programme, Asian Breast Cancer Research Fund, the NMRC Clinician Scientist Award (SI Category) and the Breast Cancer Screening and Prevention Programme. NCCS is supported in part by the National Research Foundation, Singapore, through the Singapore Ministry of Health’s National Medical Research Council and the Precision Health Research, Singapore (PRECISE), under PRECISE’s Clinical Implementation Pilot grant scheme. *The views expressed are those of the author(s) and not necessarily those of the NIHR or the Department of Health and Social Care. We also thank all the participants and their families for taking part in the research studies and all the researchers, clinicians, technicians and administrative staff who have enabled this work to be carried out. KOHBRA thanks the KOHBRA study group. MyBrCa, MyOvCa, and MaGiC thank all research staff at Cancer Research Malaysia, University Malaya, participating Ministry of Health Malaysia hospitals, Subang Jaya Medical Centre, Beacon Hospital, Gleneagles Penang, Hospital Universiti Sains Malaysia, KPJ Ampang Puteri Specialist Hospital, KPJ Johor Specialist Hospital, KPJ Sabah Specialist Hospital, Loh Guan Lye Specialist Centre, Mount Miriam Cancer Hospital, Pantai Hospital Kuala Lumpur, Penang Adventist Hospital, Universiti Kebangsaan Malaysia Medical Centre and Sunway Medical Centre who assisted in recruitment and interviews for their contributions and commitment to this study. We want to thank Siti Norhidayu Hasan, Lau Shao Yan and Habibatul Saadiah Isa for assistance with DNA preparation for MaGiC; Lee Sheau Yee, Daphne SC Lee, Wong Siu Wan and Lee Yong Quan for their assistance in curating family history data for MyBrCa, MyOvCa and MaGiC. SGBCC thanks Dr Jingmei Li, Dr Peh Joo Ho and Alexis Jiaying Khng for their assistance with DNA preparation for SGBCC; Dr Ern Yu Tan, A/Prof Benita Kiat-Tee Tan, A/Prof Veronique Kiak Mien Tan, Dr Geok Hoon Lim, and Dr Su-Ming Tan for their support and supervision of recruitment at the individual participating sites. For the NCCS study, we thank all our clinical partners and genetic counsellors Shao Tzu Li, Jeanette Yuen, Hui Xuan Goh and laboratory staff Sock Hoai Chan, Ee Ling Chew and Siao Ting Chong for their efforts in patient recruitment and database management. We thank all NCCS patients and families for their support of our research efforts. HRBCP acknowledges Edmond SK Ma, CH Au, Cecilia YS Ho for research coordination; WP Luk and LH Fung for HRBCP data and statistical support; doctors, nurses and genetic counsellors from the University of Hong Kong-affiliated Hospitals from Hong Kong for recruitment. Author contributions Conceptualization: D.F.E, G.C.T., A.C.A., S.H.T., W.K.H.; Project administration: Data curation: M.C.T., J.D., Z.L.W., G.L., M.K.B., D.R.B, M.T.P, P.S; Formal analysis: M.C.T., W.K.H; Resources: S.K.P, S.W.K., J.W.L., T.H., A.K., M.H., S.Y.Y., J.N.Y.Y, Y.L.W., B.P., J.S., N.A.M.T, C.H.Y.; Writing – original draft: M.C.T., D.F.E, G.C.T., A.C.A., S.H.T., W.K.H.; Writing – review & editing: all authors. Data availability CIMBA data is available on request. To receive access to the data, a concept form must be submitted, which will then be reviewed by the CIMBA Data Access Coordination Committee (DACC). Concept forms and the process of submitting data access requests can be found at: https://www.ccge.medschl.cam.ac.uk/consortium-investigators-modifiers-brca12-cimba/data-data-access Code availability The code for the statistical analysis performed in R v.3.6.3, using the R package survival and rms, and PRS was compute using PLINK 2.0, can be shared with interested readers upon request via email to the corresponding author. Competing interests A. Kwong received educational grants and funding support for genetic testing from Astrazeneca and Pfizer. S. Y. Yoon is a recipient of an Investigator-Initiated Grant from AstraZeneca for the MaGIC Study. J. Ngeow received research support from AstraZeneca. All other authors declare no conflicts of interest. References 1. Daly MB Genetic/Familial High-Risk Assessment: Breast, Ovarian, and Pancreatic, Version 2.2021, NCCN Clinical Practice Guidelines in Oncology J. Natl. Compr. Cancer Netw.: JNCCN 2021 19 77 102 10.6004/jnccn.2021.0001 33406487 Daly, M. B. et al. Genetic/Familial High-Risk Assessment: Breast, Ovarian, and Pancreatic, Version 2.2021, NCCN Clinical Practice Guidelines in Oncology. J. Natl. Compr. Cancer Netw.: JNCCN 19 33406487 10.6004/jnccn.2021.0001 2. Chang-Claude J Age at menarche and menopause and breast cancer risk in the International BRCA1/2 Carrier Cohort Study Cancer Epidemiol. Biomark. Prev. 2007 16 740 6 10.1158/1055-9965.EPI-06-0829 17416765 Chang-Claude, J. et al. Age at menarche and menopause and breast cancer risk in the International BRCA1/2 Carrier Cohort Study. Cancer Epidemiol. Biomark. Prev. 16 10.1158/1055-9965.EPI-06-0829 17416765 3. Kuchenbaecker KB Evaluation of polygenic risk scores for breast and ovarian cancer risk prediction in BRCA1 and BRCA2 mutation carriers J. Natl. Cancer Inst. 2017 109 7 10.1093/jnci/djw302 PMC5408990 28376175 Kuchenbaecker, K. B. Evaluation of polygenic risk scores for breast and ovarian cancer risk prediction in BRCA1 and BRCA2 mutation carriers. J. Natl. Cancer Inst. 109 10.1093/jnci/djw302 PMC5408990 28376175 4. Barnes DR Polygenic risk scores and breast and epithelial ovarian cancer risks for carriers of BRCA1 and BRCA2 pathogenic variants Genet. Med. 2020 22 1653 1666 10.1038/s41436-020-0862-x 32665703 PMC7521995 Barnes, D. R. et al. Polygenic risk scores and breast and epithelial ovarian cancer risks for carriers of BRCA1 and BRCA2 pathogenic variants. Genet. Med. 22 32665703 10.1038/s41436-020-0862-x PMC7521995 5. Li H Alcohol consumption, cigarette smoking, and risk of breast cancer for BRCA1 and BRCA2 mutation carriers: results from The BRCA1 and BRCA2 Cohort Consortium Cancer Epidemiol. Biomark. Prev. 2020 29 368 378 10.1158/1055-9965.EPI-19-0546 PMC7611162 31792088 Li, H. et al. Alcohol consumption, cigarette smoking, and risk of breast cancer for BRCA1 and BRCA2 mutation carriers: results from The BRCA1 and BRCA2 Cohort Consortium. Cancer Epidemiol. Biomark. Prev. 29 10.1158/1055-9965.EPI-19-0546 PMC7611162 31792088 6. Ho WK Age-specific breast and ovarian cancer risks associated with germline BRCA1 or BRCA2 pathogenic variants - an Asian study of 572 families Lancet Reg. Health West Pac. 2024 44 101017 38333895 10.1016/j.lanwpc.2024.101017 PMC10851205 Ho, W. K. et al. Age-specific breast and ovarian cancer risks associated with germline BRCA1 or BRCA2 pathogenic variants - an Asian study of 572 families. Lancet Reg. Health West Pac. 44 38333895 10.1016/j.lanwpc.2024.101017 PMC10851205 7. Morgan J Psychosocial outcomes after varying risk management strategies in women at increased familial breast cancer risk: a mixed methods study of patient and partner outcomes Ann. R. Coll. Surg. Engl. 2024 106 78 91 10.1308/rcsann.2023.0042 37458196 PMC10757884 Morgan, J. et al. Psychosocial outcomes after varying risk management strategies in women at increased familial breast cancer risk: a mixed methods study of patient and partner outcomes. Ann. R. Coll. Surg. Engl. 106 37458196 10.1308/rcsann.2023.0042 PMC10757884 8. Mavaddat N Polygenic risk scores for prediction of breast cancer and breast cancer subtypes Am. J. Hum. Genet. 2019 104 21 34 10.1016/j.ajhg.2018.11.002 30554720 PMC6323553 Mavaddat, N. et al. Polygenic risk scores for prediction of breast cancer and breast cancer subtypes. Am. J. Hum. Genet. 104 30554720 10.1016/j.ajhg.2018.11.002 PMC6323553 9. Ho WK European polygenic risk score for prediction of breast cancer shows similar performance in Asian women Nat. Commun. 2020 11 3833 10.1038/s41467-020-17680-w 32737321 PMC7395776 Ho, W. K. et al. European polygenic risk score for prediction of breast cancer shows similar performance in Asian women. Nat. Commun. 11 32737321 10.1038/s41467-020-17680-w PMC7395776 10. Ho WK Polygenic risk scores for prediction of breast cancer risk in Asian populations Genet. Med. 2022 24 586 600 10.1016/j.gim.2021.11.008 34906514 PMC7612481 Ho, W. K. et al. Polygenic risk scores for prediction of breast cancer risk in Asian populations. Genet. Med. 24 34906514 10.1016/j.gim.2021.11.008 PMC7612481 11. Ruan Y Improving polygenic prediction in ancestrally diverse populations Nat. Genet. 2022 54 573 580 10.1038/s41588-022-01054-7 35513724 PMC9117455 Ruan, Y. et al. Improving polygenic prediction in ancestrally diverse populations. Nat. Genet. 54 35513724 10.1038/s41588-022-01054-7 PMC9117455 12. Michailidou K Large-scale genotyping identifies 41 new loci associated with breast cancer risk Nat. Genet. 2013 45 353 361 10.1038/ng.2563 23535729 PMC3771688 Michailidou, K. et al. Large-scale genotyping identifies 41 new loci associated with breast cancer risk. Nat. Genet. 45 23535729 10.1038/ng.2563 PMC3771688 13. Amos CI The OncoArray Consortium: A Network for Understanding the Genetic Architecture of Common Cancers Cancer Epidemiol. Biomark. Prev. 2017 26 126 135 10.1158/1055-9965.EPI-16-0106 PMC5224974 27697780 Amos, C. I. et al. The OncoArray Consortium: A Network for Understanding the Genetic Architecture of Common Cancers. Cancer Epidemiol. Biomark. Prev. 26 10.1158/1055-9965.EPI-16-0106 PMC5224974 27697780 14. Couch FJ Genome-wide association study in BRCA1 mutation carriers identifies novel loci associated with breast and ovarian cancer risk PLoS Genet. 2013 9 e1003212 10.1371/journal.pgen.1003212 23544013 PMC3609646 Couch, F. J. et al. Genome-wide association study in BRCA1 mutation carriers identifies novel loci associated with breast and ovarian cancer risk. PLoS Genet. 9 23544013 10.1371/journal.pgen.1003212 PMC3609646 15. Gaudet MM Identification of a BRCA2-specific modifier locus at 6p24 related to breast cancer risk PLoS Genet. 2013 9 e1003173 10.1371/journal.pgen.1003173 23544012 PMC3609647 Gaudet, M. M. et al. Identification of a BRCA2-specific modifier locus at 6p24 related to breast cancer risk. PLoS Genet. 9 23544012 10.1371/journal.pgen.1003173 PMC3609647 16. Antoniou AC A weighted cohort approach for analysing factors modifying disease risks in carriers of high-risk susceptibility genes Genet. Epidemiol. 2005 29 1 11 10.1002/gepi.20074 15880399 Antoniou, A. C. et al. A weighted cohort approach for analysing factors modifying disease risks in carriers of high-risk susceptibility genes. Genet. Epidemiol. 29 15880399 10.1002/gepi.20074 17. Chatterjee N Shi J García-Closas M Prediction of complex disease using polygenic risk scores Genet. Epidemiol. 2016 40 542 552 Chatterjee, N., Shi, J. & García-Closas, M. Prediction of complex disease using polygenic risk scores. Genet. Epidemiol. 40 ",
  "metadata": {
    "Title of this paper": "Prediction of complex disease using polygenic risk scores",
    "Journal it was published in:": "NPJ Breast Cancer",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484999/"
  }
}