{
  "title": "Paper_902",
  "abstract": "pmc Discov Oncol Discov Oncol 4139 discon Discover Oncology 2730-6011 Springer PMC12474774 PMC12474774.1 12474774 12474774 41003822 10.1007/s12672-025-03490-3 3490 1 Brief Report Potential of circulating miR-6875 and miR-1307 as non-invasive diagnostic biomarkers for pancreatic cancer https://orcid.org/0000-0002-1936-6112 Sharma Vinit 1 https://orcid.org/0000-0002-6588-1748 Semwal Ankita 1 https://orcid.org/0009-0004-6446-2842 Lohani Shivangani 1 https://orcid.org/0009-0005-4098-5005 Arora Ankita 1 https://orcid.org/0000-0002-8719-7955 Bansal Sakshi 1 https://orcid.org/0000-0001-9670-6611 Sharma Mayank 1 Gupta Rajesh 2 Singh Harjeet 2 https://orcid.org/0000-0001-6523-5052 Aggarwal Anjali aggarwal.anjali@pgimer.edu.in anjli_doc@yahoo.com 1 1 https://ror.org/009nfym65 grid.415131.3 0000 0004 1767 2903 Department of Anatomy, Post Graduate Institute of Medical Education and Research (PGIMER), 2 https://ror.org/009nfym65 grid.415131.3 0000 0004 1767 2903 Department of GI Surgery, HPB and Liver Transplantation, Post Graduate Institute of Medical Education and Research (PGIMER), 26 9 2025 12 2025 16 478248 1710 23 5 2025 23 8 2025 26 09 2025 28 09 2025 28 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Aim Pancreatic cancer (PC) is marked by high mortality and resistance to conventional therapies, largely due to a dense desmoplastic stroma that promotes drug resistance and metastasis. This highlights the need for specific non-invasive diagnostic markers. MicroRNAs (miRNAs), known for regulating gene expression and influencing tumor behavior, have emerged as promising biomarkers. This study aimed to evaluate the expression of circulating miR-6875 and miR-1307 in PC patients to explore their diagnostic potential. Methods Blood, urine, and saliva samples were collected from 20 PC patients and 12 healthy controls. RNA extraction and cDNA synthesis were performed following standard protocols, and quantitative real-time PCR assays were used to quantify miR-6875 and miR-1307 expression levels. Statistical analysis was performed to predict their diagnostic potential and association with clinical and biochemical parameters of PC patients. Results Our results revealed significantly elevated levels of miR-6875 and miR-1307 in plasma, urine samples, and saliva samples from PC patients compared to controls. Receiver operating characteristic (ROC) curve analysis demonstrated the potential of miR-6875 and miR-1307 in plasma as diagnostic biomarkers for PC, with AUC values of 0.79 and 0.83, respectively. Conclusion Plasma levels of miR-6875 and miR-1307 show potential as non-invasive diagnostic biomarkers for pancreatic cancer. Supplementary Information The online version contains supplementary material available at 10.1007/s12672-025-03490-3. Keywords Pancreatic cancer Diagnosis Non-invasive biomarker miR-6875 miR-1307 Department of Science and Technology, Chandigarh Administration, India S&T&RE/RP/147/E-2873/(22-23)/SANC/09/2022/907-915 Aggarwal Anjali pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Science+Business Media LLC, part of Springer Nature 2025 Introduction Pancreatic cancer (PC) is a highly aggressive cancer with a dismal overall survival rate of 8.5%, despite standard treatments like chemotherapy and surgical interventions for resectable tumors [ 1 2 3 4 7 8 Recent research has emphasized the role of microRNAs (miRNAs) as potential biomarkers and cellular targets in PC. miRNAs are short single-stranded RNA molecules, typically comprising 18–24 nucleotides, responsible for regulating the transcription of target genes and participating in various intracellular processes [ 9 10 11 12 13 15 16 In previous studies, miR-6875 and miR-1307 have emerged as crucial miRNAs associated with tumor progression and resistance to chemotherapy and immunotherapies across multiple cancer types. Specifically, miR-6875 has garnered attention for its upregulation in early-stage breast cancer, with studies demonstrating its potential as a diagnostic marker due to its association with breast cancer detection and its impact on immunotherapy efficacy [ 17 18 19 20 Despite these advancements, the exploration of miR-6875 and miR-1307 as diagnostic markers for PC in body fluids remains relatively unexplored. The development of chemoresistance poses a significant challenge for patients undergoing treatment for PC. Thus, the evaluation of the expression levels of miRNA-6875 and miR-1307 holds paramount importance within the context of PC research. Therefore, the primary objective of this study is to assess the diagnostic potential of miR-6875 and miR-1307 in PC by analyzing their expression patterns in peripheral blood, urine, and saliva samples obtained from PC cancer patients. Furthermore, we aim to explore the correlation between miR-6875 and miR-1307 expression levels and clinicopathological features of PC patients, thereby elucidating their diagnostic value. Materials and methods Study participants A total of 20 clinically diagnosed pancreatic cancer (PC) patients (11 males and 9 females), with a mean age of 58.20 ± 2.66 years, were recruited from the Department of GI Surgery, HPB and Liver Transplantation, Postgraduate Institute of Medical Education and Research (PGIMER), Chandigarh. The diagnosis was established based on widely accepted criteria, including imaging techniques (computed tomography), blood tumor markers (carbohydrate antigen 19-9), clinical presentations, and biopsy-confirmed histopathological findings. Among the 20 patients, 6 were classified as stage IA, 6 as stage IB, 4 as stage II, and the remaining 4 as stage IIB, based on the TNM staging system recommended by the American Joint Committee on Cancer (AJCC) for PC. Histologically, 25% (5/20) of patients had well-differentiated carcinoma, while 57% (15/20) had moderately differentiated pancreatic cancer. The mean age of male patients was 60.91 ± 3.32 years, while that of females was 54.89 ± 4.26 years. The patients who have received any radiotherapy and chemotherapy before excision or have fetal medical problems such as coronary artery disease, stroke, and comorbidities were excluded from the study. A total of 12 age-matched healthy volunteers (males = 06, females = 06) with a mean age of 57.58 ± 2.23 years (males = 55.17 ± 3.77 years, females = 60.0 ± 2.33years) having no significant medical history were recruited as a control in this study. All procedures were conducted in accordance with the ethical standards and guidelines of the Institutional Ethics Committee of the Postgraduate Institute of Medical Education and Research (PGIMER), Chandigarh, India. The study was approved by the Institutional Ethics Committee of PGIMER (IEC-07/2021–2050) and carried out in compliance with the relevant national and institutional guidelines and regulations. Informed consent was obtained from all the individuals recruited in the study. The demographic features and levels of biochemical markers in PC patients relevant to this study are mentioned in Table 1 Sample processing  Table 1 Demographic features and levels of clinicopathological markers in pancreatic cancer patients Sr. no. Demographic features and biochemical markers Pancreatic cancer patients Healthy controls 1. Sample size 20 12 2. Number of males 11 06 3. Number of females 09 06 4. Age 58.20 ± 2.66 57.58 ± 2.23 5. Age of males 60.91 ± 3.32 55.17 ± 3.77 6. Age of females 54.89 ± 4.26 60.0 ± 2.33 7. Amylase (28.0–100.0 U/L) 103.40 ± 27.10 NA 8. AST (2.0–40.0 U/L) 67.64 ± 12.41 NA 9. ALT (2.0–41.0 U/L) 56.40 ± 12.41 NA 10. ALP (42.0–128 U/L) 317.70 ± 112.20 NA 11. CA19-9 (0.0–27.0 IU/ml) 763.9 ± 507.0 NA 12. CEA 25 (0.0–4.70 ng/ml) 6.87 ± 3.05 NA 13. Lipase (13.0–16.0 U/L) 176.1 ± 114.5 NA 14. Urea (10.0–50.0 mg/dL) 28.05 ± 2.40 NA 15. Creatinine (0.5–1.2 mg/dL) 1.01 ± 0.20 NA 16. Bilirubin total (0.2–1.2 mg/dL) 4.24 ± 1.47 NA 17. Bilirubin conjugated (0.0–0.3 mg/dL) 1.81 ± 0.64 NA 18. Tumor stage IA = 6, IB = 6, IIA = 4, IIB = 4 NA 19. Tumor grade Well Diff = 5 (Grade 1), Moderate Diff = 15 (Grade 2) NA 20. Tumor site Head of pancreas and periampullary region NA 21. Resection Yes ( n NA Data values are the mean ± standard error of the mean Preoperative venous blood, urine, and saliva samples were collected from PC patients scheduled to undergo Whipple surgery at the Department of GI Surgery, HPB and Liver Transplantation, PGIMER, Chandigarh, as well as from healthy volunteers (non-surgical, asymptomatic individuals with no history of malignancy), who served as controls. Morning first-pass urine samples were collected in sterile containers. Saliva samples were collected approximately one hour after a light meal, following an oral rinse with water to minimize contamination. Venous blood was drawn during the same preoperative visit. All sample collections were conducted prior to surgery, following radiological and tumor marker-based diagnosis (e.g., CT scan and CA 19-9 levels), but before histopathological confirmation by biopsy. Following collection, blood samples were centrifuged at 1000 × g g Extraction of total RNA Total RNA was extracted from 200 µl of serum, saliva, and urine samples using miRNeasy Serum/Plasma kit (Qiagen) according to the manufacturer’s instructions. Unisp6 spike-in control was used for normalization during RNA extraction. The RNA quality and quantity were measured by measuring the absorbance at 260 and 280 nm through EPOCH 2 Microplate spectrophotometer reader (Biotech, USA). Pure RNA samples with an A260/280 ratio between 1.8 and 1.9 were assessed for integrity using 1.2% agarose gel electrophoresis. Representative gel images are provided in the Supplementary Fig. 1 (Supplementary file). The presence of distinct 28 S and 18 S rRNA bands confirmed the acceptable quality of the isolated RNA. Synthesis of cDNA Total RNA was transcribed to cDNA through qPCR using miRCURY LNA™ miRNA PCR Starter Kit (Qiagen) according to the manufacturer’s instructions. Unisp6 spike-in control was used for normalization during cDNA synthesis. Determination of expression of miRNAs (6875 and 1307) by qRT-PCR qRT-PCR was performed using the SYBR green method suggested by miRCURY LNA™ miRNA PCR Starter Kit (Qiagen). The primers for miR-6875 and miR-1307 were synthesized using GeneGlobe Design and Analysis Hub of Qiagen with the following IDs, miR-6875: YKP-HS-YP02116574, miR-1307: YKP-HS-YP02103132. For qRT-PCR, miR-103-3p was used as the endogenous control for normalization, based on the manufacturer’s instructions for the assay kit and supported by previous studies demonstrating its stable expression across various biological fluids and pathological conditions. The expression of miRNAs was determined using qRT-PCR on the StepOnePlus Real-Time PCR system (Applied Biosystems, USA). The 2 −ΔΔCt Statistical analysis Statistical evaluation was performed using GraphPad Prism 6.0 software (GraphPad Software Inc). All the data were checked for normal distribution using the recommended test, D’Agostino Pearson omnibus normality test. The difference between the two study groups was determined using a two-tailed unpaired student’s t-test (Kolmogorov Smirnov test) and among three groups by one-way ANOVA (Kruskal walis test). The data were represented as Mean ± SEM for comparing groups. Any correlation of miRNAs with tumor size, clinical stage, tumor grading, and other clinicopathological features was determined using a non-parametric Spearman test. Receiver operating characteristic (ROC) curves and area under the curve (AUC) were used to assess the sensitivity and specificity of serum/urine/saliva miRNAs for utilizing them as a biomarker for detecting PC. P-value ≤ 0.05 was considered statistically significant. Results Increased levels of classical pancreatic inflammatory and tumor markers in pancreatic cancer patients The demographic details, including the age and gender of patients and levels of classical biochemical/pathological markers, were recorded for all the patients (Table 1 1 Increased relative expression of miR-6875 and miR-1307 in plasma, urine, and saliva samples of pancreatic cancer patients Relative expression of miR-6875 and miR-1307 was determined in plasma, urine, and saliva samples of every PC patient after normalizing the data with control samples and miR-103-3p as endogenous control using the 2 −ΔΔCt 2 −ΔΔCt P P P 1  Table 2 Relative expression of miR-6875 and miR-1307 in plasma, urine, and saliva samples of pancreatic cancer patients compared to controls miRNA type Sample type Relative expression in all PC patients ( n Relative expression in male PC patients ( n Relative expression in female PC patients ( n Statistical comparison of miRNAs expression in male vs. female PC patients ( P miR-6875 Plasma 1.127 ± 0.61 ( P 1.45 ± 1.05 0.72 ± 0.49 0.1857 Urine 3.49 ± 1.82 ( P 5.55 ± 3.21 1.02 ± 0.86 0.299 Saliva 6.29 ± 3.07 ( P 8.12 ± 5.01 4.09 ± 3.24 0.2193 miR-1307 Plasma 4.17 ± 3.81 ( P 0.292 ± 0.07 8.83 ± 8.38 0.0898 Urine 28.71 ± 17.36 ( P 30.64 ± 24.52 26.39 ± 25.75 0.3993 Saliva 326.4 ± 306.8, ( P 564.2 ± 563.5 41.06 ± 30.69 0.4557 Data values are mean ± standard error of the mean; Kolmogorov-Smirnov test was performed to compare relative expression of male and female circulating miRNAs; Bold P-values are statistically significant; PC: Pancreatic cancer  Fig. 1 Relative expression of [ A B n A B n n P P P P Further, the relative expression (2 −ΔΔCt P P P 1 Role of miR-6875 and miR-1307 as a non-invasive biomarker for pancreatic cancer The expression of miR-6875 and miR-1307 was markedly raised in the body fluids of PC patients compared to control; therefore, these miRNAs have the potential as a non-invasive biomarker for PC. For investigating the possibility of miR-6875 and miR-1307 as a biomarker of PC, a receiver operating characteristic (ROC) curve analysis was performed, whose area under the curve (AUC) indicates the sensitivity (true positive rate) and specificity (false positive rate) of biomarkers in diagnostic tests. The AUC value for plasma miR-6875 was 0.79 (95% CI: 0.6493–0.9454, P P P 2  Fig. 2 Receiver operating characteristic (ROC) curves of pancreatic cancer patients compared to healthy controls. ROC curves indicate the area under the curve (AUC) values for ( A B The AUC value for plasma miR-1307 was 0.83 (95% CI: 0.6907–0.9722, P P P 2 The diagnostic performance of circulating miR-6875 and miR-1307 in plasma, urine, and saliva samples for pancreatic cancer detection has been mentioned in Table 3  Table 3 Diagnostic performance of circulating miR-6875 and miR-1307 in plasma, urine, and saliva samples for pancreatic cancer detection miRNA type Sample type Cut-off value AUC (95% CI) Sensitivity (%) Specificity (%) PPV (%) NPV (%) Accuracy (%) P miR-6875 Plasma 0.05 0.797 (0.649–0.945) 63.64 91.67 92.86 61.11 75.00  0.0047 * miR-6875 Urine 0.44 0.690 (0.515–0.874) 68.18 75.00 82.35 60.00 71.88 0.063 miR-6875 Saliva 0.17 0.650 (0.461–0.830) 59.09 75.00 80.00 52.94 65.63 0.1653 miR-1307 Plasma 0.33 0.830 (0.690–0.972) 86.36 75.00 85.00 75.00 81.25  0.0016 * miR-1307 Urine 0.05 0.570 (0.364–0.783) 36.36 83.33 77.80 43.50 53.10 0.4800 miR-1307 Saliva 0.27 0.617 (0.440–0.793) 61.54 75.00 84.20 47.40 65.80 0.2518 *Bold P-values are statistically significant Expression of miR-6875 and miR-1307 is associated with stage and grade of pancreatic cancer patients The expression of miR-6875 and miR-1307 in plasma, urine, and saliva samples appeared to increase with advancing stage (I and II) and grade (1 and 2) of PC patients; however, these differences did not reach statistical significance (Table 4  Table 4 Stage and grade-wise comparison of relative expression of miR-6875 and miR-1307 in plasma, urine, and saliva samples of pancreatic cancer patients compared to controls miRNA type Sample type Stage-wise comparison of relative expression of miRNAs Grade-wise comparison of relative expression of miRNAs Stage I PC patients ( n Stage II PC patients ( n Statistical comparison in Stage I vs. Stage II Grade 1 PC patients ( n Grade 2 PC patients ( n Statistical comparison in Grade 1 vs. Grade 2 (P-value) miR-6875 Plasma 0.42 ± 0.262 0.89 ± 0.53 0.49 0.009 ± 0.003 1.64 ± 0.87 0.17 Urine 1.23 ± 0.92 3.18 ± 1.88 0.61 0.047 ± 0.029 5.1 ± 2.60 0.096 Saliva 0.90 ± 0.75 1.21 ± 0.48 0.46 6.58 ± 6.52 7.01 ± 4.03 0.48 miR-1307 Plasma 0.22 ± 0.07 11.12 ± 10.4 0.66 0.05 ± 0.03 6.09 ± 5.58 0.09 Urine 25.23 ± 24.48 41.08 ± 31.92 0.37 0.82 ± 0.40 41.82 ± 24.9 0.70 Saliva 0.2416 ± 0.09 14.66 ± 13.76 0.39 59.81 ± 59.76 458.8 ± 450.3 0.096 Data values are mean ± standard error of the mean; Kolmogorov-Smirnov test was performed to compare relative expression of circulating miRNAs between 2 groups; PC: Pancreatic cancer Additionally, the expression levels of miR-6875 and miR-1307 were analyzed in relation to various clinicopathological parameters, including amylase, AST, ALT, ALP, CA 19 − 9, CEA-25, lipase, urea, creatinine, and total and conjugated bilirubin. However, no statistically significant correlations were observed. The summary statistics, including correlation coefficients (r) and p-values, are provided in the Supplimentary Table 1 (Supplementary file). These observations suggest that miR-6875 and miR-1307 may act as independent diagnostic biomarkers for PC. Discussion Recent studies have elucidated the role of miRNAs as key regulators of various cellular processes in tumorigenesis, acting either as proto-oncogenes or tumor suppressors. These processes include cell proliferation, apoptosis, invasion, and metastasis, mediated through intricate signaling pathways, thus exerting significant influence on tumor development and prognosis [ 21 Previous studies have consistently highlighted miR-6875 and miR-1307 as critical miRNAs linked to tumor advancement and the development of resistance against chemotherapy and immunotherapies across diverse cancer categories. Among the miRNA family, miR-6875 has garnered attention for its upregulation in early-stage breast cancer patients. In an investigation, miRNA expressions were compared between individuals with and without breast cancer, revealing a set of five miRNAs (miR-1246, miR-1307-3p, miR-4634, miR-6861-5p, and miR-6875-5p) capable of breast cancer detection. This combined miRNA panel exhibited high sensitivity (97.3%), specificity (82.9%), and accuracy (89.7%) in the test group. Moreover, it displayed a sensitivity of 98.0% for early-stage breast cancer [ 17 22 18 18 23 18 24 Similar to miR-6875, miR-1307 was previously found to be associated with chemoresistance in ovarian cancer. Moreover, miR-1307 directly targets inhibitors of growth protein 5 (ING5), resulting in reduced ING5 levels in these cells. Furthermore, ING5 suppresses cell proliferation, enhances apoptosis, and counteracts chemoresistance in ovarian cancer cells [ 19 20 Previously, various protein-based biomarkers such as CA 19 -9 and CEA, as well as circulating miRNAs like miR-21, miR-34a, miR-198 and miR-217, have been reported as potential diagnostic tools for pancreatic cancer [ 25 26 Given the substantial challenge posed by the lack of effective non-invasive diagnostic markers in PC, assessing the expression levels of these miRNAs becomes paramount in PC research. Our study demonstrates a significant elevation in the expression levels of miR-6875 and miR-1307 in plasma, urine, and saliva samples from PC patients compared to controls. This consistent upregulation across multiple body fluids highlights their potential as non-invasive biomarkers for PC detection. Notably, plasma levels of both miR-6875 and miR-1307 showed significant AUC values in the ROC analysis, indicating stronger diagnostic performance compared to traditional markers. However, the AUC values obtained in urine and saliva samples did not reach statistical significance. These findings underscore the clinical relevance of plasma miR-6875 and miR-1307 as promising biomarkers for the early detection of PC. Furthermore, the association between the expression levels of miR-6875 and miR-1307 in plasma, urine, and saliva samples with the severity of PC adds another layer of potential diagnostic utility. The association with histopathological stage and grade suggests that these miRNAs could serve as promising biomarkers for detecting PC and assessing its progression and severity in patients. To strengthen the clinical relevance of our findings, we further examined the expression of miR-6875 and miR-1307 using TCGA-PAAD miRNA-seq data through the ENCORI (StarBase v3.0) platform [ 27 p n Despite the promising findings, our study has certain limitations. The relatively small sample size may affect the generalizability of the results, and future studies with larger, more diverse cohorts are warranted to validate these observations. The absence of a longitudinal or external validation cohort is another constraint, highlighting the need for prospective studies to assess the reproducibility and predictive value of these miRNAs over time. Functional validation of predicted targets was also beyond the scope of the present study. Moreover, potential confounding factors such as comorbidities and lifestyle variables were not systematically evaluated. Addressing these aspects in future investigations will help to further establish the clinical utility of miR-6875 and miR-1307 as non-invasive biomarkers for pancreatic cancer. Further, this study did not specifically evaluate the expression of miR-6875 and miR-1307 in chemo-resistant patient samples. Future investigations incorporating treatment response data will be necessary to explore the potential role of these miRNAs in predicting or monitoring therapeutic resistance. Conclusion Our findings underscore the potential of plasma levels of miRNA-6875 and miR-1307 as non-invasive diagnostic biomarkers. Further, the elevated levels of miRNA-6875 and miR-1307 across various biological fluids such as plasma, urine and saliva shows association with disease severity, suggesting their utility in non-invasive diagnosis of advance stage pancreatic cancer. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements We thank all the patients and volunteers for their participation. Author contributions Vinit Sharma: Conceptualization, data curation, formal analysis, investigation, visualization, validation, writing – original draft, writing – review & editing. Ankita Semwal: Conceptualization, data curation, investigation. Shivangani Lohani, Ankita Arora, Sakshi Bansal, Mayank Sharma: Data curation, investigation. Rajesh Gupta, Harjeet Singh: Investigation, supervision. Anjali Aggarwal: Conceptualization, formal analysis, investigation, supervision, validation, writing – review & editing. Funding The study was supported by a small extramural grant from the Department of Science and Technology, Chandigarh Administration, India (Grant No. S&T&RE/RP/147/E-2873/(22–23)/SANC/09/2022/907–915). Data availability All data generated or analyzed during this study are included in this manuscript. Raw data will be made available by the corresponding author upon reasonable and legitimate request from any qualified investigator. Declarations Ethics approval and consent to participate All procedures were conducted in accordance with the ethical standards and guidelines of the Institutional Ethics Committee. The study was approved by the Institutional Ethics Committee of the Post Graduate Institute of Medical Education and Research (PGIMER), Chandigarh, India (Approval No. IEC-07/2021–2050). Written informed consent was obtained from all individuals participating in this study, in compliance with institutional and ethical standards. Consent for publication All authors have read and agreed with the content of the manuscript. Competing interests The authors declare no competing interests. Abbreviations AUC Area under the ROC curve CI Confidence interval PPV Positive predictive value NPV Negative predictive value P-value Probability value References 1. Wang S Zheng R Li J Global, regional, and National lifetime risks of developing and dying from Gastrointestinal cancers in 185 countries: a population-based systematic analysis of GLOBOCAN Lancet Gastroenterol Hepatol 2024 9 3 229 37 10.1016/S2468-1253(23)00366-7 38185129 PMC10849975 Wang S, Zheng R, Li J, et al. Global, regional, and National lifetime risks of developing and dying from Gastrointestinal cancers in 185 countries: a population-based systematic analysis of GLOBOCAN. Lancet Gastroenterol Hepatol. 2024;9(3):229–37. 38185129 10.1016/S2468-1253(23)00366-7 PMC10849975 2. Blair AB Yin L-D Pu N Recurrence in patients achieving pathological complete response after neoadjuvant treatment for advanced pancreatic cancer Ann Surg 2021 274 1 162 9 10.1097/SLA.0000000000003570 32304375 Blair AB, Yin L-D, Pu N, et al. Recurrence in patients achieving pathological complete response after neoadjuvant treatment for advanced pancreatic cancer. Ann Surg. 2021;274(1):162–9. 32304375 10.1097/SLA.0000000000003570 3. Park SJ Yoo HC Ahn E Enhanced Glutaminolysis drives hypoxia-induced chemoresistance in pancreatic cancer Cancer Res 2023 83 5 735 52 10.1158/0008-5472.CAN-22-2045 36594876 Park SJ, Yoo HC, Ahn E, et al. Enhanced Glutaminolysis drives hypoxia-induced chemoresistance in pancreatic cancer. Cancer Res. 2023;83(5):735–52. 36594876 10.1158/0008-5472.CAN-22-2045 4. Apte M Park S Phillips P Desmoplastic reaction in pancreatic cancer: role of pancreatic stellate cells Pancreas 2004 29 3 179 87 10.1097/00006676-200410000-00002 15367883 Apte M, Park S, Phillips P, et al. Desmoplastic reaction in pancreatic cancer: role of pancreatic stellate cells. Pancreas. 2004;29(3):179–87. 15367883 10.1097/00006676-200410000-00002 5. Sharma V Sachdeva N Gupta V IL-6 is associated with expansion of myeloid‐derived suppressor cells and enhanced immunosuppression in pancreatic adenocarcinoma patients Scand J Immunol 2021 94 6 e13107 10.1111/sji.13107 38192074 Sharma V, Sachdeva N, Gupta V, et al. IL-6 is associated with expansion of myeloid‐derived suppressor cells and enhanced immunosuppression in pancreatic adenocarcinoma patients. Scand J Immunol. 2021;94(6):e13107. 38192074 10.1111/sji.13107 6. Sharma V Sachdeva N Gupta V CCR4 + monocytic myeloid-derived suppressor cells are associated with the increased epithelial-mesenchymal transition in pancreatic adenocarcinoma patients Immunobiology 2022 227 3 152210 10.1016/j.imbio.2022.152210 35358941 Sharma V, Sachdeva N, Gupta V, et al. CCR4 + monocytic myeloid-derived suppressor cells are associated with the increased epithelial-mesenchymal transition in pancreatic adenocarcinoma patients. Immunobiology. 2022;227(3):152210. 35358941 10.1016/j.imbio.2022.152210 7. Sharma V Aggarwal A Jacob J Sahni D Myeloid-derived suppressor cells: bridging the gap between inflammation and pancreatic adenocarcinoma Scand J Immunol 2021 93 5 e13021 10.1111/sji.13021 33455004 Sharma V, Aggarwal A, Jacob J, Sahni D. Myeloid-derived suppressor cells: bridging the gap between inflammation and pancreatic adenocarcinoma. Scand J Immunol. 2021;93(5):e13021. 33455004 10.1111/sji.13021 8. Hosein AN Brekken RA Maitra A Pancreatic cancer stroma: an update on therapeutic targeting strategies Nat Reviews Gastroenterol Hepatol 2020 17 8 487 505 10.1038/s41575-020-0300-1 PMC8284850 32393771 Hosein AN, Brekken RA, Maitra A. Pancreatic cancer stroma: an update on therapeutic targeting strategies. Nat Reviews Gastroenterol Hepatol. 2020;17(8):487–505. 10.1038/s41575-020-0300-1 PMC8284850 32393771 9. Ratti M Lampis A Ghidini M MicroRNAs (miRNAs) and long non-coding RNAs (lncRNAs) as new tools for cancer therapy: first steps from bench to bedside Target Oncol 2020 15 261 78 10.1007/s11523-020-00717-x 32451752 PMC7283209 Ratti M, Lampis A, Ghidini M, et al. MicroRNAs (miRNAs) and long non-coding RNAs (lncRNAs) as new tools for cancer therapy: first steps from bench to bedside. Target Oncol. 2020;15:261–78. 32451752 10.1007/s11523-020-00717-x PMC7283209 10. Daoud AZ Mulholland EJ Cole G McCarthy HO MicroRNAs in pancreatic cancer: biomarkers, prognostic, and therapeutic modulators BMC Cancer 2019 19 1 13 10.1186/s12885-019-6284-y 31752758 PMC6868851 Daoud AZ, Mulholland EJ, Cole G, McCarthy HO. MicroRNAs in pancreatic cancer: biomarkers, prognostic, and therapeutic modulators. BMC Cancer. 2019;19:1–13. 31752758 10.1186/s12885-019-6284-y PMC6868851 11. Vieira NF Serafini LN Novais PC The role of Circulating MiRNAs and CA19-9 in pancreatic cancer diagnosis Oncotarget 2021 12 17 1638 10.18632/oncotarget.28038 34434493 PMC8378767 Vieira NF, Serafini LN, Novais PC, et al. The role of Circulating MiRNAs and CA19-9 in pancreatic cancer diagnosis. Oncotarget. 2021;12(17):1638. 34434493 10.18632/oncotarget.28038 PMC8378767 12. Dittmar RL Liu S Tai MC Plasma MiRNA biomarkers in limited volume samples for detection of early-stage pancreatic cancer Cancer Prev Res 2021 14 7 729 40 10.1158/1940-6207.CAPR-20-0303 PMC8818322 33893071 Dittmar RL, Liu S, Tai MC, et al. Plasma MiRNA biomarkers in limited volume samples for detection of early-stage pancreatic cancer. Cancer Prev Res. 2021;14(7):729–40. 10.1158/1940-6207.CAPR-20-0303 PMC8818322 33893071 13. Huynh KQ, Le AT, Phan TT et al. The diagnostic power of circulating miR-1246 in screening cancer: an updated meta-analysis. Oxid Med Cell Longev. 2023;2023. 10.1155/2023/8379231 PMC10139802 37122536 14. Chuma M Toyoda H Matsuzaki J Circulating microRNA-1246 as a possible biomarker for early tumor recurrence of hepatocellular carcinoma Hepatol Res 2019 49 7 810 22 10.1111/hepr.13338 30920086 Chuma M, Toyoda H, Matsuzaki J, et al. Circulating microRNA-1246 as a possible biomarker for early tumor recurrence of hepatocellular carcinoma. Hepatol Res. 2019;49(7):810–22. 30920086 10.1111/hepr.13338 15. Ishige F Hoshino I Iwatate Y MIR1246 in body fluids as a biomarker for pancreatic cancer Sci Rep 2020 10 1 8723 10.1038/s41598-020-65695-6 32457495 PMC7250935 Ishige F, Hoshino I, Iwatate Y, et al. MIR1246 in body fluids as a biomarker for pancreatic cancer. Sci Rep. 2020;10(1):8723. 32457495 10.1038/s41598-020-65695-6 PMC7250935 16. Lee T Teng TZJ Shelat VG Carbohydrate antigen 19 – 9—Tumor marker: past, present, and future World J Gastrointest Surg 2020 12 12 468 10.4240/wjgs.v12.i12.468 33437400 PMC7769746 Lee T, Teng TZJ, Shelat VG. Carbohydrate antigen 19 – 9—Tumor marker: past, present, and future. World J Gastrointest Surg. 2020;12(12):468. 33437400 10.4240/wjgs.v12.i12.468 PMC7769746 17. Shimomura A Shiino S Kawauchi J Novel combination of serum MicroRNA for detecting breast cancer in the early stage Cancer Sci 2016 107 3 326 34 10.1111/cas.12880 26749252 PMC4814263 Shimomura A, Shiino S, Kawauchi J, et al. Novel combination of serum MicroRNA for detecting breast cancer in the early stage. Cancer Sci. 2016;107(3):326–34. 26749252 10.1111/cas.12880 PMC4814263 18. Xie Y Du J Liu Z Zhang D Yao X Yang Y MiR-6875-3p promotes the proliferation, invasion and metastasis of hepatocellular carcinoma via BTG2/FAK/Akt pathway J Exp Clin Cancer Res 2019 38 1 14 10.1186/s13046-018-1020-z 30621734 PMC6323674 Xie Y, Du J, Liu Z, Zhang D, Yao X, Yang Y. MiR-6875-3p promotes the proliferation, invasion and metastasis of hepatocellular carcinoma via BTG2/FAK/Akt pathway. J Exp Clin Cancer Res. 2019;38:1–14. 30621734 10.1186/s13046-018-1020-z PMC6323674 19. Chen W-T Yang Y-J Zhang Z-D MiR-1307 promotes ovarian cancer cell chemoresistance by targeting the ING5 expression J Ovarian Res 2017 10 1 12 10.1186/s13048-016-0301-4 28086946 PMC5234104 Chen W-T, Yang Y-J, Zhang Z-D, et al. MiR-1307 promotes ovarian cancer cell chemoresistance by targeting the ING5 expression. J Ovarian Res. 2017;10:1–12. 28086946 10.1186/s13048-016-0301-4 PMC5234104 20. Carotenuto P Amato F Lampis A Modulation of pancreatic cancer cell sensitivity to FOLFIRINOX through microRNA-mediated regulation of DNA damage Nat Commun 2021 12 1 6738 10.1038/s41467-021-27099-6 34795259 PMC8602334 Carotenuto P, Amato F, Lampis A, et al. Modulation of pancreatic cancer cell sensitivity to FOLFIRINOX through microRNA-mediated regulation of DNA damage. Nat Commun. 2021;12(1):6738. 34795259 10.1038/s41467-021-27099-6 PMC8602334 21. Li J Ju J Ni B Wang H The emerging role of miR-506 in cancer Oncotarget 2016 7 38 62778 10.18632/oncotarget.11294 27542202 PMC5308765 Li J, Ju J, Ni B, Wang H. The emerging role of miR-506 in cancer. Oncotarget. 2016;7(38):62778. 27542202 10.18632/oncotarget.11294 PMC5308765 22. Kijima T Hazama S Tsunedomi R MicroRNA-6826 and-6875 in plasma are valuable non–invasive biomarkers that predict the efficacy of vaccine treatment against metastatic colorectal cancer Oncol Rep 2017 37 1 23 30 10.3892/or.2016.5267 27878288 PMC5355687 Kijima T, Hazama S, Tsunedomi R, et al. MicroRNA-6826 and-6875 in plasma are valuable non–invasive biomarkers that predict the efficacy of vaccine treatment against metastatic colorectal cancer. Oncol Rep. 2017;37(1):23–30. 27878288 10.3892/or.2016.5267 PMC5355687 23. Mao B Zhang Z Wang G BTG2: a rising star of tumor suppressors Int J Oncol 2015 46 2 459 64 10.3892/ijo.2014.2765 25405282 Mao B, Zhang Z, Wang G. BTG2: a rising star of tumor suppressors. Int J Oncol. 2015;46(2):459–64. 25405282 10.3892/ijo.2014.2765 24. Zhu X-X Yin X-Q Hei G-Z Increased miR-6875-5p inhibits plasmacytoid dendritic cell differentiation via the STAT3/E2-2 pathway in recurrent spontaneous abortion Mol Hum Reprod 2021 27 8 gaab044 10.1093/molehr/gaab044 34240166 PMC8355038 Zhu X-X, Yin X-Q, Hei G-Z, et al. Increased miR-6875-5p inhibits plasmacytoid dendritic cell differentiation via the STAT3/E2-2 pathway in recurrent spontaneous abortion. Mol Hum Reprod. 2021;27(8):gaab044. 34240166 10.1093/molehr/gaab044 PMC8355038 25. Vychytilova-Faltejskova P Kiss I Klusova S MiR-21, miR-34a, miR-198 and miR-217 as diagnostic and prognostic biomarkers for chronic pancreatitis and pancreatic ductal adenocarcinoma Diagn Pathol 2015 10 1 5 10.1186/s13000-015-0272-6 25908274 PMC4407796 Vychytilova-Faltejskova P, Kiss I, Klusova S, et al. MiR-21, miR-34a, miR-198 and miR-217 as diagnostic and prognostic biomarkers for chronic pancreatitis and pancreatic ductal adenocarcinoma. Diagn Pathol. 2015;10:1–5. 25908274 10.1186/s13000-015-0272-6 PMC4407796 26. Liu C Deng S Jin K Lewis antigen-negative pancreatic cancer: an aggressive subgroup Int J Oncol 2020 56 4 900 8 32319567 10.3892/ijo.2020.4989 PMC7050983 Liu C, Deng S, Jin K, et al. Lewis antigen-negative pancreatic cancer: an aggressive subgroup. Int J Oncol. 2020;56(4):900–8. 32319567 10.3892/ijo.2020.4989 PMC7050983 27. Li J-H Liu S Zhou H Qu L-H Yang J-H StarBase v2. 0: decoding miRNA-ceRNA, miRNA-ncRNA and protein–RNA interaction networks from large-scale CLIP-Seq data Nucleic Acids Res 2014 42 D1 D92 7 10.1093/nar/gkt1248 24297251 PMC3964941 Li J-H, Liu S, Zhou H, Qu L-H, Yang J-H. StarBase v2. 0: decoding miRNA-ceRNA, miRNA-ncRNA and protein–RNA interaction networks from large-scale CLIP-Seq data. Nucleic Acids Res. 2014;42(D1):D92–7. 24297251 10.1093/nar/gkt1248 PMC3964941 ",
  "metadata": {
    "Title of this paper": "StarBase v2. 0: decoding miRNA-ceRNA, miRNA-ncRNA and protein–RNA interaction networks from large-scale CLIP-Seq data",
    "Journal it was published in:": "Discover Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474774/"
  }
}