{
  "title": "Paper_240",
  "abstract": "pmc J Adv Pract Oncol J Adv Pract Oncol 2128 jadpraconcol J Adv Pract Oncol JADPRO Journal of the Advanced Practitioner in Oncology 2150-0878 2150-0886 BroadcastMed LLC PMC12487980 PMC12487980.1 12487980 12487980 41040920 10.6004/jadpro.2025.16.7.23 2025.16.7.23 1 Research & Scholarship Quality Improvement Drivers of Hematology and Oncology Care Team Staff Satisfaction Eiring Rachel A. PA-C  1 Carroll Jamie L. APRN, CNP, MSN  1 Derr Amber N. MBA  2 Gosselin Christopher J. MBA, RN  1 Jasik Amy J. MBA  1 Klebig Robin R. APRN, CNP  2 McWilliams Robert R. MD  1 Resnick Adam S.  3 From 1 2 3 Correspondence to: Rachel A. Eiring, PA-C, 200 1st St SW, Rochester, MN 55905 E-mail: eiring.rachel@mayo.edu 9 2025 05 9 2025 475305 1 11 05 09 2025 02 10 2025 03 10 2025 © 2025 BroadcastMed LLC 2025 https://creativecommons.org/licenses/by-nc-nd/3.0/ This article is distributed under the terms of the Creative Commons Attribution Non-Commercial Non-Derivative License, which permits unrestricted non-commercial and non-derivative use, distribution, and reproduction in any medium, provided the original work is properly cited. This study explores drivers of satisfaction in modern care teams in which clinical and support staff are fragmented between work locations and communication methods with a large workload of digital messages. It explores the association of team culture, communication, perceived staffing, and work location on team satisfaction in an outpatient hematology and oncology practice at a large academic medical center. Clinic observation sessions and interviews with clinicians were conducted to identify potential drivers of staff satisfaction. Subsequently, a 21-question survey was developed to assess drivers correlated with care team staff satisfaction. The anonymous survey was sent to clinical and non-clinical staff. A total of 586 staff received the survey, and 278 (47%) completed the survey. Team culture/collaboration, ability to get information, and sufficient staffing were associated with high team satisfaction. Team culture/collaboration was most correlated with an individual's team satisfaction. Clinicians who spent time in a shared team workspace had 21 percentage points higher overall satisfaction. Clinicians preferred in-person communication while support staff preferred asynchronous messaging. This study highlights the importance of building team culture for strong staff satisfaction. Practices should consider colocation of clinical teams within a shared workroom space to improve satisfaction. Colocation may be a way to support positive team culture. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf yes pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes The modern cancer care team incorporates multiple health-care roles, including physicians, advanced practice providers (APPs, including nurse practitioners and physician assistants), registered nurses (RNs), clinical pharmacists, and other support staff. As the complexity of cancer care has increased, so has the health-care system and the number of ways clinicians interact with patients and colleagues. Patients can now seek medical advice through patient messaging, telemedicine (phone and video visits), and online resources. For interdisciplinary communication, care teams can use messaging systems in electronic medical records (EMR), email, pager, calls, virtual meetings, or in-person discussion. This changes the way clinical staff interact with internal colleagues and across different health-care systems. The COVID-19 pandemic accelerated the use of telemedicine and changed the face of health care, with more roles now being able to leverage virtual platforms to work remotely. The rapid shift in work location has had a significant impact on how cancer care teams logistically interact daily. Recent literature has examined overall satisfaction among oncology health-care professionals. Samant and colleagues (2023) Karukivi and colleagues (2023) Hansen and colleagues (2024) Care teams need to adapt to match patient communication preferences and ensure information is clearly communicated to avoid an increase in unscheduled work. With these changes and more roles involved in patient interactions, strong intra-team communication is essential to ensure care coordination and messaging are consistent. With rapid digital changes in team communication, there is a risk of a decrease in the quality of communication. If the change from face-to-face communication with patients decreased efficiency of communication, the same is likely true of intra-team communication. This was previously recognized by Gross and colleagues (2016) Azar and colleagues (2017) This study evaluates the satisfaction of cancer care team members, both on the clinical team (physicians, APPs, RNs, pharmacists) and supportive team (scheduling staff, medical administrative assistants, other roles). It explores the association between workspace, work location, communication method, and team culture. This is important to understand as cancer care continues to rapidly evolve and adds to the literature an examination of underexplored drivers of cancer care team satisfaction such as colocation and method of communication. METHODS This study was completed in an outpatient hematology and oncology practice at a large academic medical center in which outpatient cancer care is aligned by disease-oriented groups. Care team members included clinical staff (physicians, APPs, RNs, pharmacists) and supportive team members (scheduling staff, medical administrative assistants, other roles). To determine which variables might impact care team member satisfaction, the study team conducted clinic observations and interviews of practice leadership. Eight half-day, unblinded observation sessions were completed in which nursing and APP staff observed the operations of different disease-oriented clinical care teams. Post-observation synthesis sessions were completed to document beneficial practices incorporated into team operations. Interviews with hematology and oncology practice leadership and disease group leaders were conducted to gain further insight into differences among team structure, communication practices, and clinical workflows. A recent inventory of survey tools completed by Kash and colleagues (2018) Muthuri and colleagues (2020) The factors and attributes affecting care team satisfaction identified in observations and interviews were synthesized into a 21-question survey ( Table 1 Table 1 Survey Questions  1. What is your role? Physician APP (advanced practice provider) Clinic RN (registered nurse) Research RN Desk operations specialist (Scheduling) Patient appointment services specialist (Scheduling) Medical administrative assistant Pharmacist Social worker Trial coordinator Other 2. What care team(s)/disease group(s) are you on? (Optional) Acute Leukemia & Myeloid Neoplasms (ALMN) Bone Marrow Transplant Cell Therapy Chronic Lymphocytic Leukemia (CLL) Core Consultative Hematology Lymphoma Myeloma, Amyloidosis, Dysproteinemia (MAD) Brain Breast Early Cancer Therapeutics/Phase I Endocrine Gastrointestinal General Genitourinary Gynecologic Head/Neck Integrative Oncology Lung Melanoma and Skin Cancer Precision Oncology Sarcoma Acute Other 3. What is your overall satisfaction with the function of the primary care team(s)/disease group(s) that you support? Very dissatisfied Somewhat dissatisfied Neither satisfied or dissatisfied Somewhat satisfied Very satisfied 4. Please rate your agreement with the following statements. My team has sufficient staffing for our workload My team has efficient and effective scheduling processes My team has strong collaboration or coordination I am able to get the information I need to do my job My team has well-defined team roles and responsibilities My team has a good culture My team has enough physical space (exam rooms, workrooms, offices) For each statement for question 4: Strongly disagree Disagree Neither disagree or agree Agree Strongly agree Does not apply 5. Is there a challenge not listed above that you would like to highlight? Yes No 6. If yes, what is the challenge? Free text 7. What percent of your days, on average, is spent managing in-basket messages (triaging, reviewing, information gathering, responding, etc.) 0–20% 20–40% 40–60% 60–80% 80–100% I do not work with in basket messages 8. How much of a stressor is the management of in-basket messages? Not a stressor Somewhat a stressor Very much a stressor 9. How effectively does your team prioritize in-basket messages by urgency? Not very effectively Somewhat effectively Effectively Very effectively 10. How effectively does your team get in-basket messages to the right care team role for response? Not very effectively Somewhat effectively Effectively Very effectively 11. How often is an in-basket message forwarded to you with incomplete information or context? Rarely Sometimes Frequently Constantly 12. When responding to the following types of in-basket message, what is your primary mode of communication: Staff-generated message (communication, etc.) Automated message requiring follow-up (lab, exam, etc.) Patient-generated message (portal message, etc.) For all statements for question 12: Asynchronous (respond using message) Synchronous (respond by calling, paging, etc.) In-person (conversation face-to-face) No response is typically required or not applicable 13. How often are you interrupted from completing a task during your workday? Rarely Sometimes Frequently Constantly 14. Do you feel that frequent interruptions are a stressor in your workday? No Yes 15. How easy is it for you to track down the following care team members when you need information from them? Physician APP (Advanced Practice Provider) Clinic RN Research RN DOS (Desk Operations Staff) Scheduling PASS (Patient Appointment Services Specialist) Scheduling MAA (Medical Administrative Assistant) Pharmacist Social Work For all statements for question 15: Very challenging Somewhat challenging Neither easy or challenging Easy Very easy N/A 16. When not in an exam room, please indicate what percent of your working day is spent in the following working settings: Drop-in space in shared workroom or desk area Dedicated private cubicle in a shared office Private office Work from home Other For all statements for question 16: 0–20% 20–40% 40–60% 60–80% 80–100% 17. What are your top 3 preferred methods of communication (select up to 3 options): In-person conversation Email Teams message In-basket message in Epic/EMR Secure chat message in Epic/EMR Page Phone call Other 18. Are there tasks that you perform that should be completed by another care team role? Yes, frequently Yes, infrequently No N/A 19. What are the tasks that you perform that should be completed by another care team role? Why is that role not performing the task? Free text 20. If you could change one thing about your team, what would it be? Free text 21. What attributes of your team would you not want to change? Free text The primary endpoint of the study was an individual's overall care team satisfaction, identified in survey question 3, measured on a 5-point Likert scale from “Very dissatisfied” to “Very satisfied.” This endpoint was compared to (1) seven overarching key drivers of team satisfaction identified in interviews and observations, (2) work location, and (3) method of communication with teammates to identify best practices that could be disseminated to improve care team satisfaction across teams. Likert scales were converted to binary indicators (either participant responded “Agree/Strongly Agree” or did not respond “Agree/Strongly Agree”) and were compared using a Z-test of proportions, a statistical test used to compare if there is a significant difference between two sample population proportions. Data processing was completed in Python with statistical analysis and modeling completed in BlueSky Statistics (version 7.2) and Microsoft Excel. This study was deemed exempt by the institutional review board. RESULTS Response Rate Overall, 586 staff received the survey. Of these, 278 completed the survey for an overall response rate of 47% ( Table 2 Table 2 Response Rate to Survey by Role Role Total received Total sent Response rate Advanced practice provider 29 45 64% Clinic registered nurse 39 90 43% Desk operations specialist 36 93 39% Medical administrative assistant 30 43 70% Patient appointment services specialist 29 44 66% Pharmacist 11 50 22% Physician 70 126 56% Research registered nurse 9 27 33% Social worker 2 4 50% Trial coordinator 23 64 36% Total 278 586 47% Overall Satisfaction Overall, 73% of staff indicated that they were somewhat satisfied or very satisfied with the function of their primary care team. Key Satisfaction Drivers Seven key drivers of satisfaction synthesized from observations and interviews were identified in question 4 of the study data collection survey. These included team staffing, efficient scheduling, team collaboration, ability to get information, well defined roles, good culture, and sufficient physical space ( Table 3 Figure 1 Table 3 Satisfaction by Component Component of satisfaction % responding agree or strongly agree My team has a good culture 86% My team has strong collaboration or coordination 81% I am able to get the information I need to do my job 78% My team has well-defined team roles and responsibilities 72% My team has sufficient staffing for our workload 51% My team has enough physical space (exam rooms, workrooms, offices) 48% My team has efficient and effective scheduling processes 46% Figure 1 Odds ratio for drivers of satisfaction (95% CI). The components with the highest satisfaction (responses of “Strongly Agree” or “Agree” with the statement) included team culture (86%) and collaboration (81%). Components with the lowest scores were sufficient space (48%) and efficient scheduling (46%). A binary logistic regression model was fit to predict the association between overall team satisfaction, the study endpoint, and the seven key components of satisfaction identified above. Due to collinearity, “My team has a good culture” and “My team has strong collaboration or coordination” were combined to a single variable indicating if the respondent responded “Agree” or “Strongly Agree” to either one of the attributes of satisfaction. Staff who responded “Agree” or “Strongly Agree” that either their team had good culture or their team had strong collaboration or coordination were 5.9 times more likely to report overall satisfaction with their team (95% confidence interval [CI] = 2.1–18.6). Staff who responded “Agree” or “Strongly Agree” that they were able to get the information they need to do their job from colleagues were 3.1 times more likely to be satisfied with their team (95% CI = 1.4–7.4). Staff who responded “Agree” or “Strongly Agree” that they were on a team with sufficient staffing were 2.6 times more likely to be satisfied with their team (95% CI = 1.3–5.4). Aligning with the quantitative results, survey comments from clinicians (physicians, APPs) who were satisfied with their team typically mentioned strong team culture and collaborative environments in which information flowed smoothly between team members. Survey comments from providers who were dissatisfied frequently mentioned a need for better team structure, a more collaborative environment, and improved scheduling. Work Location For this analysis, the only roles under examination were the core clinical team of physicians, RNs, APPs, and pharmacists. Due to varying levels of clinical time, with some clinicians spending only 1 to 2 days in the clinic per week, a threshold of 20% of work time spent in a shared workroom space was selected to compare satisfaction between teams operating in a shared workroom model vs. working from private offices with sufficient sample size for comparison. Overall, clinicians (physicians, APPs, pharmacists, RNs) who spent at least 20% of their time in a shared workspace with their team reported 21 percentage points higher overall team satisfaction (Z-test of proportions, p p p Table 4 Table 4 Clinical Team Shared Workroom Utilization vs. Drivers of Satisfaction and Interruption Frequency Driver of satisfaction Does not spend at least 20% of time in shared work location Spends at least 20% of time in shared work location Percentage point difference p Overall care team satisfaction 66% 87% 21 .006 ** My team has sufficient staffing for our workload 47% 64% 17 .051 * My team has efficient and effective scheduling processes 31% 44% 13 .094 * My team has strong collaboration or coordination 80% 87% 6 .233 I am able to get the information I need to do my job 75% 82% 7 .245 My team has well-defined team roles and responsibilities 69% 70% 1 .393 My team has a good culture 86% 92% 5 .233 My team has enough physical space (exam rooms, workrooms, offices) 48% 39% −9 .215 How often are you interrupted from completing a task during your workday? (constantly or frequently) 69% 82% 13 .074 * Do you feel that frequent interruptions are a stressor in your workday? (Yes) 73% 67% −6 .298 ** = p * = p Method of Communication The following methods of communication among care teams were evaluated: in person, Microsoft Teams message, Epic Secure Chat, Epic In-Basket message, phone call, page, and email. Among all roles, individuals who listed in-person communication within their top three preferred methods of communication were 12 percentage points more likely to be satisfied with their ability to get information from their teammates (Z-test of proportions, p p p Figure 2 Figure 2 Impact of preferred communication method on satisfaction with ability to get information. Significance of difference, Z-test of two proportions. ** = p p Comparing the results for clinicians and support staff, significant differences were found in preference between communication modalities ( Figure 3 p p Figure 3 Role type vs. preferred communication method. Significance of difference, Z-test of two proportions. ** = p p DISCUSSION This analysis confirmed the importance of strong care team collaboration and team culture. These were found to be strong drivers of satisfaction across all roles of the care team. This environment fosters teamwork, open discussion, and the ability to ask questions, and ensures clear communication. The second driver to satisfaction was the ability to get information from team members to do one's own role. Interestingly, insufficient staffing, which has been a noted concern throughout the health-care industry as a driver of staff dissatisfaction, was less impactful to staff members' overall satisfaction with their team than culture or collaboration and communication. In the context of the recent changes to the health-care system and growth of remote workers, it is important to understand how to best maintain a collaborative environment and effective communication. There was a disconnect between the clinical team preferring in-person communication methods and those in a support role preferring electronic forms of communication, such as EMR messaging and email. A common strategy mentioned in interviews with clinical leaders included the creation of dedicated daily or weekly synchronous team huddles with remote staff through virtual platforms to balance both groups' preferences, connect in real time, and minimize the need for additional intra-team messaging. More work needs to be done on how to best incorporate the use of virtual huddles into daily clinic workflows. For the clinical roles, there was higher overall satisfaction when care teams practiced out of a shared workroom space. This was despite challenges with space (limited seats or computers in the workroom) and increased interruptions throughout the clinic day. It could be argued that the value created by the shared space contributed to the positive team environment and ability to communicate clearly. Staff who spent time in a colocated workroom did not report higher stress from interruptions than their colleagues who did not work out of a colocated space. This may be because the ability to have in-person communication reduced asynchronous methods, such as email and EMR messaging, overall reducing the burden of non-visit care. Challenges with space and interruptions were the only two variables that were identified as tradeoffs with colocated workrooms, yet overall satisfaction improved. Future research, especially qualitative research to dive deeper into the lived experience of health-care professionals, should be completed to assess how the burden of electronic or asynchronous messaging and colocation affect team satisfaction and collaboration. This study is limited as it was not controlled for all factors that could contribute to team satisfaction. There was significant variation in team size and roles that constitute the care team. For example, not every team has a clinical pharmacist or research RN supporting the team. The sample size for some of the roles was small due to limited staff in the role or low survey response rates. Despite these challenges, these results are intriguing and support the need to keep the focus on strong team collaboration as cancer care continues to evolve and more technologies become available to support teamwork and patient care. This study confirms the importance of strong teamwork as published previously in the literature and addresses the gap in how changes in work location and communication platforms have impacted care team satisfaction. IMPLICATIONS FOR ONCOLOGY ADVANCED PRACTITIONERS This study has high response rates from surveyed nurse practitioners and physician assistants and engagement in cross-team shadowing by these roles. The response rate from clinical pharmacists was the lowest. In alignment with the overall results, team culture and collaboration were the highest rated components of satisfaction specific to these roles, allowing for this work to be applied when looking at opportunities to improve the care satisfaction of APPs. It is more difficult to know if it is as relevant to the clinical pharmacist role in the context of the low response rate. Additional research needs to be done to understand how to improve collaborative work and team culture specifically for the oncology APP and pharmacist roles. Based on qualitative feedback from survey comments, having collaborating physicians readily available allows these roles to work at the top of their scope and might impact satisfaction. Further research needs to be done more deeply to explore this. CONCLUSION It is important for teams to have conversations about these drivers of satisfaction. Optimizing clinical workflows and maintaining a collaborative and strong team culture will lead to higher care team staff satisfaction. We anticipate this will help decrease turnover across the various roles in the care team and may lead to improved patient outcomes as was demonstrated in prior studies. If care teams elect for colocation, there should be agreement about what type of interruptions are appropriate to minimize the frequency of interruptions but also allow an opportunity to collaborate when urgent patient needs arise. Continuing huddles regardless of location might be one way to overcome some of these challenges. When using asynchronous forms of communication, efforts should be made to reduce the volume of messages and appropriately transmit and prioritize remaining messages to synchronous platforms to improve team communication and the burden of indirect clinical work. Teams should consider opportunities to utilize both in-person and asynchronous messaging platforms to optimize communication workflows. Open discussions within care teams are important to understand various roles' communication preferences and negotiate workflows that support all team members in their ability to gain information needed to do their work. Acknowledgment The authors would like to thank Dr. Stephen M. Ansell, Dr. William J. Hogan, Dr. Joleen M. Hubbard, Winston L. Stellner, Pamela J. Bowman, James L. Ryan, and Hollie L. Stegemann. The authors have no conflicts of interest to disclose. References Azar J. M. Johnson C. S. Frame A. M. Perkins S. M. Cottingham A. H. Litzelman D. K. 2017 Evaluation of interprofessional relational coordination and patients' perception of care in outpatient oncology teams Journal of Interprofessional Care 31 2 273 276 10.1080/13561820.2016.1248815 27936991 PMC5581663 Gross A. H. Leib R. K. Tonachel A. Tonachel R. Bowers D. M. Burnard R. A. Rhinehart C. A. Valentim R. Bunnell C. A. 2016 Teamwork and electronic health record implementation: A case study of preserving effective communication and mutual trust in a changing environment Journal of Oncology Practice 12 11 1075 1083 10.1200/JOP.2016.013649 27601513 Hansen M. Schiele K. Schear R. M. Richardson R. N. Munoz R. J. Bourne G. Eckhardt S. G. Kvale E. 2024 A comparative cohort study of gastrointestinal oncology patients: Impact of a shift to telehealth on delivery of interprofessional cancer care Journal of Telemedicine and Telecare 30 7 1116 1122 10.1177/1357633X221122125 36071633 Karukivi J. Leino-Kilpi H. Kuokkanen L. Kuusisto H. Rautava P. Seppänen L. Sulosaari V. Stolt M. 2023 Association between work empowerment and interprofessional collaboration among health care professionals working in cancer care settings Journal of Interprofessional Care 37 1 21 28 10.1080/13561820.2021.1997949 34979858 Kash B. A. Cheon O. Halzack N. M. Miller T. R. 2018 Measuring team effectiveness in the health care setting: an inventory of survey tools Health Services Insights 11 1178632918796230 10.1177/1178632918796230 30158825 PMC6109848 Muthuri R. N. D. K. Senkubuge F. Hongoro C. 2020 Determinants of happiness among healthcare professionals between 2009 and 2019: A systematic review Humanities and Social Sciences Communications 7 1 Article 5 10.1057/s41599-020-00592-x Samant R. Babadagli E. Laprade S. Locke G. E. Zhang Y. McNeil A. Renaud J. Cisa-Paré E. Chan J. Song J. Meng J. 2023 Cancer center staff satisfaction: Descriptive results of a Canadian study Current Oncology (Toronto, Ont.) 30 11 9872 9885 10.3390/curroncol30110717 37999137 PMC10670850 ",
  "metadata": {
    "Title of this paper": "Cancer center staff satisfaction: Descriptive results of a Canadian study",
    "Journal it was published in:": "Journal of the Advanced Practitioner in Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487980/"
  }
}