{
  "title": "Paper_968",
  "abstract": "pmc Molecules Molecules 3416 molecules molecules Molecules 1420-3049 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473109 PMC12473109.1 12473109 12473109 41011687 10.3390/molecules30183795 molecules-30-03795 1 Review Unlocking the Alkaloid Biological Potential of Chili Pepper ( Capsicum Theobroma cacao Coffea Cárdenas Anahí https://orcid.org/0000-0001-6994-8711 Mojica Luis https://orcid.org/0000-0002-6225-1142 Coronado-Cáceres Luis https://orcid.org/0000-0002-0538-7318 Castillo-Herrera Gustavo A. * Petropoulos Spyridon Academic Editor Centro de Investigación y Asistencia en Tecnología y Diseño del Estado de Jalisco, Tecnología Alimentaria, Camino al Arenero #1227, Col. El Bajío Arenal, Zapopan 45019, Jalisco, Mexico; ancardenas_al@ciatej.edu.mx lmojica@ciatej.mx lucoronado@ciatej.mx * gcastillo@ciatej.mx 18 9 2025 9 2025 30 18 496804 3795 11 7 2025 10 9 2025 16 9 2025 18 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Chili peppers ( Capsicum Theobroma cacao Coffea secondary metabolites bioactive alkaloids capsaicin theobromine caffeine non-conventional extraction SECIHTI CVU1260321 project CONACYT-320885 COECYTJAL DyD-11598-2025 This research was funded by SECIHTI, grant number CVU1260321, and the project CONACYT-320885 and also by COECYTJAL with the project number DyD-11598-2025. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Agricultural byproducts are often called agricultural waste because they are not the main production objective [ 1 2 3 4 Cacao ( Theobroma cacao Coffea Capsicum 5 6 7 Alkaloids are secondary metabolites synthesized from amino acids in plants as a defense mechanism against their harsh environment, hence their bioactivity [ 8 9 10 11 The extraction process is a crucial step to consider for ensuring the quality of alkaloids. Alkaloids could be incorporated into functional products; however, the cost and efficiency of the extraction method used must be assessed. Standard solid–liquid methods such as lixiviation, maceration, and Soxhlet extraction require high quantities of heat, energy, time, and solvents [ 12 13 2. Literature Search Strategy and Eligibility Criteria In this review, a careful literature exploration was performed to analyze the available information on the extraction methods, biological potential, and applications of caffeine, theobromine, and capsaicin. For this review, original papers published after 2010 were considered from online databases such as PubMed ( https://pubmed.ncbi.nlm.nih.gov/ www.sciencedirect.com www.scopus.com https://scholar.google.com/ www.researchgate.net www.mdpi.com 3. Byproducts of Chili Pepper, Cocoa, and Coffee Cultivation Sustainability is one of the primary targets to achieve in the agricultural industry. This sector generates a large amount of waste and byproducts that are not effectively used and generate economic losses and pollution [ 14 15 3.1. Chili Pepper In chillis, the pericarp is the central part consumed. Therefore, the seeds, placenta, peduncles, stems, leaves, and fruits that do not meet quality standards are discarded. These non-edible parts of chili make up 10–35% of the fruit, depending on the Capsicum 16 Figure 1 3.2. Cacao The cacao fruit ( Theobroma cacao 17 Figure 1 14 18 Approximately 80% of the fruit is discarded since only the beans have industrial use [ 15 17 19 20 21 3.3. Coffee The coffee seed grows inside the coffee tree’s fruit. After it is harvested, the skin, pulp, mucilage, silver skin, parchment, and defective beans are discarded ( Figure 1 22 23 24 21 23 25 4. Factors Influencing Alkaloid Content The organoleptic properties of edible crops depend on their environmental conditions, season, species, variety, harvesting method, storage method, and drying method, if necessary [ 26 27 4.1. Chili Pepper Alkaloids Capsaicinoids are a group of substances characterized by having a vanilloid ring in their structure. There are five main capsaicinoids found in nature: capsaicin, which is the most abundant, dihydrocapsaicin, nordihydrocapsaicin, homodihydrocapsaicin, and homocapsaicin ( Figure 2 28 29 Additionally, water supply also influences the pungency level; excess humidity promotes lower pungency in the fruit. At the same time, drought conditions significantly increase capsaicinoid concentration, although it causes the fruit to have fewer seeds and a smaller size. Under stress conditions, the fruit appears to activate genes involved in the capsaicinoid synthesis pathway that occurs mainly in the placenta of the chili pepper ( Capsicum annuum 30 31 4.2. Cacao Alkaloids Methylxanthines ( Figure 2 32 33 34 35 36 37 38 39 38 40 4.3. Coffee Alkaloids Caffeine content is related to the sensory attributes of the coffee plant and its quality. The altitude, soil type, rainfall, temperature, soil pH, and quality factors influence the caffeine content, as well as the contents of other secondary metabolites, even in coffee from the same species and variety [ 41 42 Coffea arabica 41 43 Bioactive compound levels are directly related to biological potential. Identifying and controlling aspects of the crop that impact alkaloid content is key to maximizing their biological potential. 5. Alkaloid Functions and Biological Potential After examining how environmental conditions affect alkaloid content in chili peppers, coffee, and cacao, attention is now directed to the biological activities of capsaicin, caffeine, and theobromine ( Table 1 5.1. Capsaicin Capsaicin is well known for its spicy taste, even though consuming chili pepper could be considered detrimental for the human body. Nevertheless, capsaicin has specific biological potentials as an antidiabetic, anticancer, and body weight control substance, highlighting its anti-inflammatory properties. Capsaicinoids contain a vanilloid group which is associated with the transient receptor potential vanilloid subtype 1 (TRPV1), a signal receptor that detects potential injuries and activates inflammation and pain sensation [ 44 45 This receptor is distributed in peripheral and central tissues. It can also be found in hepatocytes, adipocytes, skeletal muscles, and endothelial cells [ 46 47 45 Table 1 48 49 46 50 48 51 Inhibition of cell proliferation has also been demonstrated in Caco-2 colorectal adenocarcinoma cells and OE19 esophageal cells (IC 50 49 50 50 51 47 5.2. Theobromine Theobromine is present in a world-renowned sweet treat: chocolate. Consuming this snack has been linked with detrimental effects, mainly regarding its sugar and fat content. However, theobromine has proved to exert anti-inflammatory, antiproliferative, neuro-stimulant, and even body weight management properties ( Table 1 Theobromine has demonstrated anti-inflammatory properties by downregulating the expression of inflammatory interleukin IL-1β, thereby decreasing proinflammatory mediators from the inflammatory pathway, including cyclooxygenase-2 (COX-2), prostaglandin E2 (PGE2), nitric oxide synthase (iNOS), and nitric oxide (NO). It also inhibited metalloproteinases MMP-3 and MMP-13 and suppressed the nuclear factor NF-κB, as well as the tumor necrosis factor (TNF-α) and monocyte chemoattractant protein (MCP-1), at a dose of 50 μM in an in vitro study on SW135 cells, where its effect was linked to osteoarthritis [ 52 53 54 55 Theobromine has also demonstrated an apoptotic effect on colorectal cancer HT-29 cells (0.673 μg/mL) [ 56 57 50 50 58 59 5.3. Caffeine Caffeine is the most studied alkaloid among those reviewed in the present work. This substance, which is consumed daily by millions of people, has various properties, highlighting its neuro-stimulating and anti-inflammatory potential. Caffeine is an antagonist of adenosine receptors since it has a similar structure to adenosine and can bind to its receptors. Research related to caffeine’s biological potential is shown in Table 1 60 61 62 Caffeine and theobromine are commonly found together in fruits such as cacao and guarana [ 63 56 Beyond alkaloid–alkaloid interactions, synergistic effects might occur through their combination with polyphenols, terpenoids, and flavonoids. When extracting from a natural source, it is common to obtain a mixture of several substances in the extract, which can enhance its bioactive potential. For instance, the employment of cacao-derived flavonols, such as epicatechin, has been shown to downregulate diastolic blood pressure; however, their combination with the methylxanthines found in cacao, including theobromine and caffeine, has enhanced their vascular positive effects [ 64 Staphylococcus aureus 65 The synergistic underlying mechanism can be related to the targeting of multiple steps of a regulation pathway by a range of compounds. It can also be explained by substances that do not have bioactive potential but enhance the bioavailability, solubility, or absorption of the active compounds [ 66 molecules-30-03795-t001_Table 1 Table 1 Biological potential of capsaicin, theobromine, and caffeine as determined through experimental assays. Alkaloid Function Model Assay Dose Result Reference Capsaicin Anti-inflammatory Myoblast cells LPS-induced inflammation 50 µM ↓Calpain-1, ↓TNF-α, and ↓Capase-3 [ 48 RAW 264.7 cells LPS-induced inflammation 3.05 µM ↓IL-1 β [ 49 Anti-obesity C57BL/6 mice Body weight HFD + 0.01% ↑Glucose homeostasis, ↓body weight gain [ 46 Mice RT-PCR, Western blot, body growth, and fat growth HFD + 5% capsinoids ↓Body weight, ↓fat mass, ↑HMG-CoA reductase, ↑CPT-1, ↑FAT/CD36, and ↑GLUT4 [ 50 Antidiabetic Type 1 diabetic male Sprague Dawley (SD) rats Apparent digestibility determination of total sugar and biochemical index determination 6 mg/kg body weight ↑Glucose metabolism, ↑insulin level, ↑glycogen content [ 51 Hepatocellular carcinoma HepG2 Fluorescence indicated by 2-NBDG 25–200 µM ↑Glucose consumption, dose-dependent [ 67 Antiproliferative Colon adenocarcinoma Caco-2 and esophageal OE19 cells MTT assay 81.86 μM ↑Inhibition of cell proliferation by IC 50 [ 68 Hepatocellular carcinoma HepG2 MTT assay 172.8 μM ↑Inhibition of cell proliferation by IC 50 [ 69 Theobromine Antiproliferative Colorectal cancer line HT-29 cells Clonogenic assay 100 μg extract/mL Antiproliferative effect [ 56 Lung carcinoma epithelial A549 and human colon cancer HTC-116 MTT assay 40.20 µM and 34.05 µM, respectively Inhibition by IC 50 [ 58 Anti-inflammatory SW1353 cells induced by IL-1β RT-PCR, Western blot, ELISA, Luciferase assay, ROS, and intracellular NO measurement 50 μM ↓ROS production, ↓COX-2, ↓PGE 2 [ 52 Human colorectal adenocarcinoma CaCo-2 cells induced by oxysterols Cell death, immunoblotting, Cytokine by ELISA 10 μM ↓ IL-8, ↓MCP-1, ↓tight junction protein level decrease, ↓apoptotic activity [ 57  Cardiovascular protection Overweight and obese adults aged 40–55 years old Anthropometric indices, blood pressure, lipid profile, and glycemic indices 450 mg/day ↓Waist circumference, ↓LDL-c/HDL-c, ↓TG/HDL-c [ 53 C57BL/6 mice Blood sampling, immunoblot analysis, RT-PCR 200 mg/kg body weight ↓Body weight gain, ↓PDE4D activity, and ↑energy expenditure [ 55 Caffeine Antidepressant Reserpine-induced rat model of depression Neurotransmitter analysis 30 mg/kg Regulated serotonin, norepinephrine, and dopamine; ↑AchE activity [ 60 Antidepressant Male inpatients age 31–59 years old Depressive symptoms measurement, Montreal Cognitive Assessment 60 mg/day ↑Enhance antidepressant medication, ↑cognitive function, ↓HPA hyperactivation [ 61 Adult Swiss male mice LPS-induced inflammation on vastus lateralis muscle 6 mg/kg of body weight Attenuated LPS-induced catabolic state, ↓NLRP3, ↑adenosinergic receptors Adora1 Adora 2A [ 70 Anti-inflammatory RAW 264.7 cells Nitric oxide assay, cytokine assay, nitrite determination, RT-PCR, and Western blot analysis 200 μM ↓ NO production, ↓iNOS, ↓COX-2, ↓IL-6, ↓IL-3, ↓IL-12, ↓NF-κB, ↓phospho-p38MAPK i [ 62 Human Neuroblastoma cells treated with HIV-1 Tat 1–72 Aβ level quantification, immunoblotting, and immunoelution 200 μM ↓ Aβ levels, decreased vacuolar ATPase, and increased cathepsin D [ 71 Neuroprotective AlCl 3 Measurement of lipid peroxidation, reduced glutathione (GHS), nitric oxide, and AchE, Na + + 20 mg/kg ↑AchE, ↑Na + + [ 72 Note: The symbols indicate a significant increase or decrease in the parameter in contrast to the control. All units are associated with the alkaloid displayed unless indicated otherwise. Abbreviations: Aβ, amyloid-β; AchE, acetylcholinesterase; ATPase, adenosine triphosphatase; COX-2, cyclooxygenase-2; CPT-1, carnitine palmitoyltransferase 1; FAT/CD36, fatty acid translocase/cluster of differentiation 36; GHS, reduced glutathione; GLUT-4, glucose transporter type 4; HDL-c, high-density lipoprotein cholesterol; HFD, high-fat diet; HMG-CoA, hydroxymethylglutaryl-Coa; HPA, hypothalamus-pituitary-adrenal; IC 50 6. Alkaloid Extraction Techniques As described earlier, alkaloids have a diverse range of functions. The extraction technique must be appropriate to obtain the substance of interest without damaging its bioactive potential while achieving a high extraction yield. The traditional methods are detrimental to the environment as they require a high volume of organic solvents and a long extraction time. Extraction can be optimized by reducing particle size and increasing temperature, thereby improving solubility and reducing extraction time. Regardless, an elevated temperature can result in the degradation of thermolabile substances intended for recovery [ 73 Therefore, greener alternatives have been developed to recover bioactive compounds effectively. These techniques are best known as non-conventional extraction methods since they are not yet widely used in the industry, even though they offer benefits like maximizing extraction yield, attenuating energy and solvent consumption, decreasing extraction time, and preventing the degradation of thermolabile compounds [ 74 Table 2 Caffeine is present in most of the coffee plant anatomy; for that reason, different extraction methods have been studied to obtain it and other bioactive compounds from coffee byproducts. UAE achieves a greater caffeine extraction ratio in the same amount of time as conventional methods, such as liquid–solid extraction. UAE utilizes sonic energy, which translates to a mechanical force capable of breaking into the cell walls of the material, facilitating compound extraction [ 75 76 77 78 79 HPTE is another non-conventional technique that has been applied to retrieve caffeine from SCGs. Silva et al. [ 12 76 80 81 EAE, a non-conventional extraction technique, has gained interest due to its ability to enhance the release of bioactive compounds [ 82 83 EAE is capable of breaking into the composition of the cell wall in fruits and seeds, enabling access to compounds such as capsaicinoids inside the cell wall. EAE of habanero chili pepper using cellulase demonstrated its capability to obtain capsaicin and phenolic compounds, although the conditions for each component differed. At 318.15 and a concentration of 250 UI/L over 150 min, 310.23 µg capsaicin/mL was obtained. A higher concentration of phenolic compounds was achieved over the same time but at 303.15 K and 2500 UI/L [ 84 83 SFE has also been applied to recover this alkaloid from habanero chili pepper. This method does not require water as it works with carbon dioxide at supercritical pressure. However, unlike caffeine, capsaicin is a nonpolar molecule; therefore, a nonpolar solvent can be added to increase extraction. For example, using 20% ethanol w w 79 Regardless of the extraction method, the pretreatment of the sample is crucial to consider. Chili pepper needs to be dried and milled before the process. This drying is commonly performed at high temperatures, which is not detrimental to capsaicin as it is stable at high temperatures; however, the extract may contain thermolabile phenolic compounds. An option to avoid high temperatures is to freeze-dry the sample. This method is favorable for increasing the total extractable compounds, as reported by Avilés-Betanzos et al., who compared the capsaicin content of freeze-dried and oven-dried Malagueta pepper extracts. The results show a lower concentration of capsaicin in the oven-dried peppers, attributed to the heat treatment, which decreases the alkaloid content [ 79 85 86 Cacao’s shell is one of the main byproducts of cacao farming, containing interesting bioactive compounds. PHWE, SFE, and PEFAE have been applied to obtain theobromine and caffeine from this source. Utilizing only CO 2 87 88 89 Although there are several non-conventional techniques to retrieve theobromine, as well as caffeine and capsaicin, the right option depends on the source, conditions, and tools available to improve the extraction process. Nonetheless, the perks of implementing the use of non-conventional extraction methods are found in the time saved, the solvents used, and the extract quality, which are essential when working to incorporate these bioactive substances in novel and functional foods. molecules-30-03795-t002_Table 2 Table 2 Conventional and non-conventional extraction methods to obtain capsaicin, theobromine, and caffeine. Raw Material Extract Method Solvent Conditions Yield Reference Coffee pulp Caffeine UAE Water 348.15 K–363.1 K, 396 W, 5.5 min 206.6 ± 0.1 mg/L [ 76 90 Crude guarana and guarana waste Caffeine Enzyme-assisted PLE Water 323 K, pH 5.0, cellulase 46.2 ± 0.14 g/100 g extract and 43.53 ± 0.13 g/100 g extract [ 83 Spent coffee grounds Caffeine HPTE Ethanol and water 50% v v 423.15 K, 700 kPa and 60 min 31.7 ± 2.9 mg/100 mL extract [ 12 Spent coffee grounds Caffeine and coffee oils SFE Carbon dioxide and ethanol 333 K, 30 MPa, 10% co-solvent 3.96% molar [ 77 Green tea Caffeine SFE Carbon dioxide 333.15 K, 25 MPa, 3 h 100% [ 81 Green tea Caffeine SFE CO 2 343.15 K, 30 MPa, 4 h 460.0 mg/g [ 80  Habanero (Campsicum chinense Capsaicinoids SFE Ethanol 20% w w 318.15 K, 10 MPa, 60 min 37.09 ± 0.84 mg/g extract [ 79 Trinidad Scorpion Moruga fruit Capsaicin PHWE Water 473.15 K, 20 MPa, and 10 + 20 min of static extraction time 46.45 ± 0.410 mg/g dried sample [ 91 Trinidad Scorpion Moruga fruit Capsaicinoids Soxhlet Methanol 2 h, 0.1 g chili, 150 mL methanol 42.875 ± 0.403 mg/g dried sample [ 92 Habanero chili pepper Capsaicin and phenolic compounds EAE Enzyme solution 1:15 w v 318.15 K, 150 min 310.23 µg/mL [ 84 Cacao shell Theobromine and caffeine PHWE Water Ethanol 15%, 363.15 K, 5 extraction cycles, 6 min static time 2.06 ± 0.06 and 0.48 ± 0.02 g/100 g [ 89 Cacao shell Caffeine SFE CO 2 41.3 MPa, 313 K, 90 min 91.80% [ 87 Cacao shell Theobromine and caffeine PEFAE Ethanol and water 40% v v 1:30 g/mL, 313.15 K, 2 h, 3 kW/cm, and 20 kJ/kg +25% and +34% [ 93 Cocoa shell Theobromine and caffeine SFE + PLE Ethanol 313.15 K, 20 MPa, 343.15 K, 10 MPa - [ 88 Abbreviations: EAE, enzyme-assisted extraction; HPTE, high-pressure and -temperature extraction; MAE, microwave-assisted extraction; PEFAE, pulsed electric field-assisted extraction; PHWE, pressurized hot water extraction; PLE, pressurized liquid extraction; SFE, supercritical fluid extraction; UAE, ultrasound-assisted extraction. 7. Alkaloids: Current and Potential Applications in the Industry Capsaicin, theobromine, and caffeine are highly valued for their properties, which offer numerous applications. These alkaloids have been utilized for their medicinal potential, and they also provide practical options for functionalizing products such as food, beverages, and cosmetics. Several ongoing studies focus on using plant extracts rich in alkaloids to drive innovation in these markets. Capsaicin is being researched for its anti-inflammatory properties in topical treatments for pain caused by osteoarthritis [ 94 95 82 96 97 98 99 Furthermore, extracts rich in theobromine coming from cacao and its byproducts have been recently studied for their application as a food ingredient to enhance antioxidant activity [ 100 101 102 103 104 63 105 106 107 Caffeine is used in various products, including energy drinks, cosmetics, and pharmaceuticals. Recent investigations discuss the use of coffee byproducts rich in caffeine in food formulations, as is the case of cookies enriched with coffee silverskin to provide fiber and antioxidant capacity [ 107 108 109 110 111 112 113 The global market size of caffeine is expected to change at a compound annual growth rate of 6.7 to 7.7%, reaching a value of USD 767.7 million by the year 2030. The interest in this alkaloid is increasing due to modern lifestyle changes, demanding boosting beverages, coffee-based drinks, and energy-fueling snacks. It is also valued in healthcare to develop pharmaceuticals aimed at weight control, as well as in the cosmetic and personal care sector [ 114 115 116 117 8. Perspectives and Conclusions Multiple studies have proved the biological potential of capsaicin, theobromine, and caffeine. However, their possible applications are still growing with available technologies. Non-emergent technologies are improving the quality and yield of the extracts. Furthermore, emergent technologies, such as nanoencapsulation, applied in the development of new products, enable the use of these alkaloids in the formulation of food, cosmetics, and pharmaceuticals that would otherwise be infeasible due to their taste, smell, and other unpalatable characteristics. As part of the circular economy system, the utilization of agricultural byproducts to produce new developments is increasing. Future research should focus on the possibility of incorporating agricultural waste produced when crops are exposed to diseases as a potential source of bioactive compounds generated as part of the plants’ defense mechanisms exhibited under the stress caused by plagues. Characterization and comparison to their healthy counterparts should be carried out to assess the benefits they can offer. Besides being a source of income, this would also mitigate the economic loss caused by plagues. Acknowledgments The authors thank the Department of Food Technology from Centro de Investigación y Asistencia en Tecnología y Diseño del Estado de Jalisco for the support given during the making of this work. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, A.C. and G.A.C.-H.; methodology, A.C.; validation, A.C., G.A.C.-H., L.C.-C. and L.M.; investigation, A.C.; writing—original draft preparation, A.C.; writing—review and editing A.C., G.A.C.-H., L.C.-C. and L.M.; visualization, G.A.C.-H., L.C.-C. and L.M.; supervision, G.A.C.-H., L.C.-C. and L.M.; project administration, G.A.C.-H.; funding acquisition, G.A.C.-H. All authors have read and agreed to the published version of the manuscript. Conflicts of Interest The authors declare no conflicts of interest. References 1. Hamda A.S. Abo L.D. Jayakumar M. Selvakumar K.V. Periyasamy S. Emana A.N. Introduction: Growth of Agricultural Waste, Its Disposal, and Related Environmental Issues Agricultural Waste to Value-Added Products: Technical, Economic and Sustainable Aspects Neelancherry R. Gao B. Wisniewski A. Jr. Springer Nature Singapore 2023 1 19 978-981-9944-72-9 2. Mateos-Aparicio I. Matias A. Food Industry Processing by-Products in Foods The Role of Alternative and Innovative Food Ingredients and Products in Consumer Wellness Elsevier Amsterdam, The Netherlands 2019 239 281 978-0-12-816453-2 3. Galanakis C.M. 12—Food Waste Recovery: Prospects and Opportunities Sustainable Food Systems from Agriculture to Industry Academic Press Cambridge, MA, USA 2018 401 419 978-0-12-811935-8 4. Reguengo L.M. Salgaço M.K. Sivieri K. Maróstica Júnior M.R. Agro-Industrial by-Products: Valuable Sources of Bioactive Compounds Food Res. Int. 2022 152 110871 10.1016/j.foodres.2021.110871 35181119 5. Azlan A. Sultana S. Huei C.S. Razman M.R. Antioxidant, Anti-Obesity, Nutritional and Other Beneficial Effects of Different Chili Pepper: A Review Molecules 2022 27 898 10.3390/molecules27030898 35164163 PMC8839052 6. Lippi D. Sin and Pleasure: The History of Chocolate in Medicine J. Agric. Food Chem. 2015 63 9936 9941 10.1021/acs.jafc.5b00829 25989318 7. Patay É.B. Bencsik T. Papp N. Phytochemical Overview and Medicinal Importance of Coffea Species from the Past until Now Asian Pac. J. Trop. Med. 2016 9 1127 1135 10.1016/j.apjtm.2016.11.008 27955739 8. Debnath B. Singh W.S. Das M. Goswami S. Singh M.K. Maiti D. Manna K. Role of Plant Alkaloids on Human Health: A Review of Biological Activities Mater. Today Chem. 2018 9 56 72 10.1016/j.mtchem.2018.05.001 9. Zhang S. Jin J. Chen J. Ercisli S. Chen L. Zhang S. Jin J. Chen J. Ercisli S. Chen L. Purine Alkaloids in Tea Plants: Component, Biosynthetic Mechanism and Genetic Variation Beverage Plant Res. 2022 2 13 10.48130/BPR-2022-0013 10. Arce-Rodríguez M.L. Ochoa-Alejo N. Biochemistry and Molecular Biology of Capsaicinoid Biosynthesis: Recent Advances and Perspectives Plant Cell Rep. 2019 38 1017 1030 10.1007/s00299-019-02406-0 30941502 11. Maharjan A. Vasamsetti B.M.K. Park J.-H. A Comprehensive Review of Capsaicin: Biosynthesis, Industrial Productions, Processing to Applications, and Clinical Uses Heliyon 2024 10 e39721 10.1016/j.heliyon.2024.e39721 39524861 PMC11543913 12. da Silva M.F. Pettinato M. Casazza A.A. Maciel M.I.S. Perego P. Design and Evaluation of Non-Conventional Extraction for Bioactive Compounds Recovery from Spent Coffee ( Coffea arabica Chem. Eng. Res. Des. 2022 177 418 430 10.1016/j.cherd.2021.11.011 13. Sridhar A. Vaishampayan V. Senthil Kumar P. Ponnuchamy M. Kapoor A. Extraction Techniques in Food Industry: Insights into Process Parameters and Their Optimization Food Chem. Toxicol. 2022 166 113207 10.1016/j.fct.2022.113207 35688271 14. Mendoza-Meneses C.J. Feregrino-Pérez A.A. Gutiérrez-Antonio C. Potential Use of Industrial Cocoa Waste in Biofuel Production J. Chem. 2021 2021 e3388067 10.1155/2021/3388067 15. Mohammadnezhad P. Valdés A. Álvarez-Rivera G. Bioactivity of Food by-Products: An Updated Insight Curr. Opin. Food Sci. 2023 52 101065 10.1016/j.cofs.2023.101065 16. Yasin M. Li L. Donovan-Mak M. Chen Z.-H. Panchal S.K. Capsicum Waste as a Sustainable Source of Capsaicinoids for Metabolic Diseases Foods 2023 12 907 10.3390/foods12040907 36832982 PMC9956217 17. Vásquez Z.S. de Carvalho Neto D.P. Pereira G.V.M. Vandenberghe L.P.S. de Oliveira P.Z. Tiburcio P.B. Rogez H.L.G. Góes Neto A. Soccol C.R. Biotechnological approaches for cocoa waste management: A review Waste Manag. 2019 90 72 83 10.1016/j.wasman.2019.04.030 31088675 18. Campos-Vega R. Nieto-Figueroa K.H. Oomah B.D. Cocoa ( Theobroma cacao Trends Food Sci. Technol. 2018 81 172 184 10.1016/j.tifs.2018.09.022 19. Rojo-Poveda O. Barbosa-Pereira L. Zeppa G. Stévigny C. Cocoa Bean Shell—A By-Product with Nutritional Properties and Biofunctional Potential Nutrients 2020 12 1123 10.3390/nu12041123 32316449 PMC7230451 20. Nguyen V.T. Nguyen N.H. Proximate Composition, Extraction, and Purification of Theobromine from Cacao Pod Husk ( Theobroma cacao Technologies 2017 5 14 10.3390/technologies5020014 21. Okiyama D.C.G. Soares I.D. Cuevas M.S. Crevelin E.J. Moraes L.A.B. Melo M.P. Oliveira A.L. Rodrigues C.E.C. Pressurized Liquid Extraction of Flavanols and Alkaloids from Cocoa Bean Shell Using Ethanol as Solvent Food Res. Int. 2018 114 20 29 10.1016/j.foodres.2018.07.055 30361017 22. Forcina A. Petrillo A. Travaglioni M. di Chiara S. De Felice F. A Comparative Life Cycle Assessment of Different Spent Coffee Ground Reuse Strategies and a Sensitivity Analysis for Verifying the Environmental Convenience Based on the Location of Sites J. Clean. Prod. 2023 385 135727 10.1016/j.jclepro.2022.135727 23. Machado M. Espírito Santo L. Machado S. Lobo J.C. Costa A.S.G. Oliveira M.B.P.P. Ferreira H. Alves R.C. Bioactive Potential and Chemical Composition of Coffee By-Products: From Pulp to Silverskin Foods 2023 12 2354 10.3390/foods12122354 37372564 PMC10297123 24. Oliveira G. Passos C.P. Ferreira P. Coimbra M.A. Gonçalves I. Coffee By-Products and Their Suitability for Developing Active Food Packaging Materials Foods 2021 10 683 10.3390/foods10030683 33806924 PMC8005104 25. da Silva W.B. Rocha L.M. Soares M.S. Good God P.I.V. da Silva S.A. Moreira D.B. Silva G.H. Validation of Methodology for Quantifying Caffeic and Ferulic Acids in Raw and Roasted Coffee Extracts by High-Performance Liquid Chromatography J. Multidiscip. Sci. J. 2025 8 8 10.3390/j8010008 26. Suryana E.A. Kamsiati E. Somantri A.S. Characteristics of Organoleptic Quality of Several Long-Grain and Bold-Grain Rice Varieties in Indonesia IOP Conf. Ser. Earth Environ. Sci. 2022 1024 012058 10.1088/1755-1315/1024/1/012058 27. Pott D.M. Osorio S. Vallarino J.G. From Central to Specialized Metabolism: An Overview of Some Secondary Compounds Derived from the Primary Metabolism for Their Role in Conferring Nutritional and Organoleptic Characteristics to Fruit Front. Plant Sci. 2019 10 835 10.3389/fpls.2019.00835 31316537 PMC6609884 28. Elmas C. Gezer C. Capsaicin and Its Effects on Body Weight J. Am. Nutr. Assoc. 2022 41 831 839 10.1080/07315724.2021.1962771 34383610 29. González-Zamora A. Sierra-Campos E. Luna-Ortega J.G. Pérez-Morales R. Ortiz J.C.R. García-Hernández J.L. Characterization of Different Capsicum Varieties by Evaluation of Their Capsaicinoids Content by High Performance Liquid Chromatography, Determination of Pungency and Effect of High Temperature Molecules 2013 18 13471 13486 10.3390/molecules181113471 24184818 PMC6269802 30. Rathnayaka R.M.S.M.B. Kondo F. Prabandaka S.S. Nemoto K. Matsushima K. Drought Stress Induced an Increase in the Pungency and Expression of Capsaicinoid Biosynthesis Genes in Chili Pepper ( Capsicum annuum Hortic. J. 2021 90 410 419 10.2503/hortj.UTD-282 31. Guillen N.G. Tito R. Mendoza N.G. Capsaicinoids and Pungency in Capsicum chinense Capsicum Baccatum Pesqui. Agropecu. Trop. 2018 48 237 244 10.1590/1983-40632018v4852334 32. Rodríguez-Carrasco Y. Gaspari A. Graziani G. Santini A. Ritieni A. Fast Analysis of Polyphenols and Alkaloids in Cocoa-Based Products by Ultra-High Performance Liquid Chromatography and Orbitrap High Resolution Mass Spectrometry (UHPLC-Q-Orbitrap-MS/MS) Food Res. Int. 2018 111 229 236 10.1016/j.foodres.2018.05.032 30007681 33. Jean-Marie E. Bereau D. Robinson J.-C. Benefits of Polyphenols and Methylxanthines from Cocoa Beans on Dietary Metabolic Disorders Foods 2021 10 2049 10.3390/foods10092049 34574159 PMC8470844 34. Cruz J.F.M. Leite P.B. Soares S.E. Bispo E.D.S. Bioactive Compounds in Different Cocoa ( Theobroma cacao Food Sci. Technol. 2015 35 279 284 10.1590/1678-457X.6541 35. Monteiro J.P. Alves M.G. Oliveira P.F. Silva B.M. Structure-Bioactivity Relationships of Methylxanthines: Trying to Make Sense of All the Promises and the Drawbacks Molecules 2016 21 974 10.3390/molecules21080974 27472311 PMC6273298 36. Utrilla-Vázquez M. Rodríguez-Campos J. Avendaño-Arazate C.H. Gschaedler A. Lugo-Cervantes E. Analysis of Volatile Compounds of Five Varieties of Maya Cocoa During Fermentation and Drying Processes by Venn diagram and PCA Food Res. Int. 2020 129 108834 10.1016/j.foodres.2019.108834 32036902 37. Fajardo J.G.B. Tellez H.B.H. Atuesta G.C.P. Aldana A.P.S. Arteaga J.J.M. Antioxidant Activity, Total Polyphenol Content and Methylxantine Ratio in Four Materials of Theobroma cacao Heliyon 2022 8 e09402 10.1016/j.heliyon.2022.e09402 35600450 PMC9118492 38. Velásquez-Reyes D. Rodríguez-Campos J. Avendaño-Arrazate C. Gschaedler A. Alcázar-Valle M. Lugo-Cervantes E. Forastero and Criollo Cocoa Beans, Differences on the Profile of Volatile and Non-Volatile Compounds in the Process from Fermentation to Liquor Heliyon 2023 9 e15129 10.1016/j.heliyon.2023.e15129 37089295 PMC10119589 39. Peláez P. Bardón I. Camasca P. Methylxanthine and Catechin Content of Fresh and Fermented Cocoa Beans, Dried Cocoa Beans, and Cocoa Liquor Sci. Agropecu. 2016 7 355 365 10.17268/sci.agropecu.2016.04.01 40. Dang Y.K.T. Nguyen H.V.H. Effects of Maturity at Harvest and Fermentation Conditions on Bioactive Compounds of Cocoa Beans Plant Foods Hum. Nutr. 2019 74 54 60 10.1007/s11130-018-0700-3 30368643 41. Mengistu M.W. Workie M.A. Mohammed A.S. Biochemical Compounds of Arabica Coffee ( Coffea arabica Cogent Food Agric. 2020 6 1741319 10.1080/23311932.2020.1741319 42. Gebeyehu B.T. Determination of Caffeine Content and Antioxidant Activity of Coffee Am. J. Appl. Chem. 2015 3 69 10.11648/j.ajac.20150302.16 43. Gamonal L.E. Vallejos-Torres G. López L.A. Sensory Analysis of Four Cultivars of Coffee ( Coffea arabica Cienc. Rural. 2017 47 e20160882 10.1590/0103-8478cr20160882 44. Du Q. Liao Q. Chen C. Yang X. Xie R. Xu J. The Role of Transient Receptor Potential Vanilloid 1 in Common Diseases of the Digestive Tract and the Cardiovascular and Respiratory System Front. Physiol. 2019 10 1064 10.3389/fphys.2019.01064 31496955 PMC6712094 45. Meza R.C. Ancatén-González C. Chiu C.Q. Chávez A.E. Transient Receptor Potential Vanilloid 1 Function at Central Synapses in Health and Disease Front. Cell. Neurosci. 2022 16 864828 10.3389/fncel.2022.864828 35518644 PMC9062234 46. Shen W. Shen M. Zhao X. Zhu H. Yang Y. Lu S. Tan Y. Li G. Li M. Wang J. Anti-Obesity Effect of Capsaicin in Mice Fed with High-Fat Diet Is Associated with an Increase in Population of the Gut Bacterium Akkermansia muciniphila Front. Microbiol. 2017 8 272 10.3389/fmicb.2017.00272 28280490 PMC5322252 47. Silva J.L. Santos E.A. Alvarez-Leite J.I. Are We Ready to Recommend Capsaicin for Disorders Other Than Neuropathic Pain? Nutrients 2023 15 4469 10.3390/nu15204469 37892544 PMC10609899 48. Shang K. Amna T. Amina M. Al-Musayeib N. Al-Deyab S. Hwang I. Influence of Capsaicin on Inflammatory Cytokines Induced by Lipopolysaccharide in Myoblast Cells Under in Vitro Environment Pharmacogn. Mag. 2017 13 s26 s32 10.4103/0973-1296.203984 28479722 PMC5407112 49. Cortés-Ferré H.E. Martínez-Avila M. Antunes-Ricardo M. Guerrero-Analco J.A. Monribot-Villanueva J.L. Gutiérrez-Uribe J.A. In Vitro Evaluation of Anti-Inflammatory Activity of “Habanero” Chili Pepper ( Capsicum chinense Plant Foods Hum. Nutr. 2023 78 109 116 10.1007/s11130-022-01026-6 36350416 50. Hong Q. Xia C. Hu X. Quan Y. Capsinoids Suppress Fat Accumulation via Lipid Metabolism Mol. Med. Rep. 2015 11 1669 1674 10.3892/mmr.2014.2996 25421144 PMC4270323 51. Zhang S. Ma X. Zhang L. Sun H. Liu X. Capsaicin Reduces Blood Glucose by Increasing Insulin Levels and Glycogen Content Better than Capsiate in Streptozotocin-Induced Diabetic Rats J. Agric. Food Chem. 2017 65 2323 2330 10.1021/acs.jafc.7b00132 28230360 52. Gu R. Shi Y. Huang W. Lao C. Zou Z. Pan S. Huang Z. Theobromine Mitigates IL-1β-Induced Oxidative Stress, Inflammatory Response, and Degradation of Type II Collagen in Human Chondrocytes Int. Immunopharmacol. 2020 82 106226 10.1016/j.intimp.2020.106226 32146317 53. Sharifi-Zahabi E. Rezvani N. Hajizadeh-Sharafabad F. Hosseini-Baharanchi F.S. Shidfar F. Rahimi M. Theobromine Supplementation in Combination with a Low-Calorie Diet Improves Cardiovascular Risk Factors in Overweight and Obese Subjects with Metabolic Syndrome: A Randomized Controlled Trial Food Funct. 2023 14 8431 8441 10.1039/D3FO00555K 37615657 54. Fuggetta M.P. Zonfrillo M. Villivà C. Bonmassar E. Ravagnan G. Inflammatory Microenvironment and Adipogenic Differentiation in Obesity: The Inhibitory Effect of Theobromine in a Model of Human Obesity In Vitro Mediat. Inflamm. 2019 2019 1515621 10.1155/2019/1515621 PMC6360562 30804705 55. Jang M.H. Mukherjee S. Choi M.J. Kang N.H. Pham H.G. Yun J.W. Theobromine Alleviates Diet-Induced Obesity in Mice via Phosphodiesterase-4 Inhibition Eur. J. Nutr. 2020 59 3503 3516 10.1007/s00394-020-02184-6 31965293 56. Cadoná F.C. Machado A.K. Azzolin V.F. Barbisan F. Dornelles E.B. Glanzner W. Gonçalves P.B.D. Assmann C.E. Ribeiro E.E. da Cruz I.B.M. Guaraná a Caffeine-Rich Food Increases Oxaliplatin Sensitivity of Colorectal HT-29 Cells by Apoptosis Pathway Modulation Anti-Cancer Agents Med. Chem. 2016 16 1055 1065 10.2174/1871520616666151217121138 26673759 57. Iaia N. Rossin D. Sottero B. Venezia I. Poli G. Biasi F. Efficacy of Theobromine in Preventing Intestinal CaCo-2 Cell Damage Induced by Oxysterols Arch. Biochem. Biophys. 2020 694 108591 10.1016/j.abb.2020.108591 32961113 58. Eissa I.H. Yousef R.G. Elkaeed E.B. Alsfouk A.A. Husein D.Z. Ibrahim I.M. Alesawy M.S. Elkady H. Metwaly A.M. Anticancer Derivative of the Natural Alkaloid, Theobromine, Inhibiting EGFR Protein: Computer-Aided Drug Discovery Approach PLoS ONE 2023 18 e0282586 10.1371/journal.pone.0282586 36893122 PMC9997933 59. Martínez-Pinilla E. Oñatibia-Astibia A. Franco R. The Relevance of Theobromine for the Beneficial Effects of Cocoa Consumption Front. Pharmacol. 2015 6 30 10.3389/fphar.2015.00030 25750625 PMC4335269 60. Khadrawy Y.A. Sawie H.G. Hosny E.N. Mourad H.H. Assessment of the Antidepressant Effect of Caffeine Using Rat Model of Depression Induced by Reserpine Bull. Natl. Res. Cent. 2018 42 36 10.1186/s42269-018-0034-1 61. Liu Q.-S. Deng R. Fan Y. Li K. Meng F. Li X. Liu R. Low Dose of Caffeine Enhances the Efficacy of Antidepressants in Major Depressive Disorder and the Underlying Neural Substrates Mol. Nutr. Food Res. 2017 61 1600910 10.1002/mnfr.201600910 28054436 62. Hwang J.-H. Kim K.-J. Ryu S.-J. Lee B.-Y. Caffeine Prevents LPS-Induced Inflammatory Responses in RAW264.7 Cells and Zebrafish Chem. Biol. Interact. 2016 248 1 7 10.1016/j.cbi.2016.01.020 26852703 63. Pinho L.S. da Silva M.P. Thomazini M. Cooperstone J.L. Campanella O.H. da Costa Rodrigues C.E. Favaro-Trindade C.S. Guaraná ( Paullinia cupana J. Food Process. Preserv. 2021 45 e15854 10.1111/jfpp.15854 64. Sansone R. Ottaviani J.I. Rodriguez-Mateos A. Heinen Y. Noske D. Spencer J.P. Crozier A. Merx M.W. Kelm M. Schroeter H. Methylxanthines Enhance the Effects of Cocoa Flavanols on Cardiovascular Function: Randomized, Double-masked Controlled Studies Am. J. Clin. Nutr. 2017 105 352 360 10.3945/ajcn.116.140046 28003203 65. Aksoy C.S. Avci F.G. Ugurel O.M. Atas B. Sayar N.A. Akbulut B.S. Potentiating the Activity of Berberine for Staphylococcus aureus Microb. Pathog. 2020 149 104542 10.1016/j.micpath.2020.104542 33010366 66. Caesar L.K. Cech N.B. Synergy and Antagonism in Natural Product Extracts: When 1 + 1 Does Not Equal 2 Nat. Prod. Rep. 2019 36 869 888 10.1039/C9NP00011A 31187844 PMC6820002 67. Zeng H. Shi N. Peng W. Yang Q. Ren J. Yang H. Chen L. Chen Y. Guo J. Effects of Capsaicin on Glucose Uptake and Consumption in Hepatocytes Molecules 2023 28 5258 10.3390/molecules28135258 37446918 PMC10343879 68. Lavorgna M. Orlo E. Nugnes R. Piscitelli C. Russo C. Isidori M. Capsaicin in Hot Chili Peppers: In Vitro Evaluation of Its Antiradical, Antiproliferative and Apoptotic Activities Plant Foods Hum. Nutr. 2019 74 164 170 10.1007/s11130-019-00722-0 30835044 69. Hacioglu C. Capsaicin Inhibits Cell Proliferation by Enhancing Oxidative Stress and Apoptosis Through SIRT1/NOX4 Signaling Pathways in HepG2 and HL-7702 Cells J. Biochem. Mol. Toxicol. 2022 36 e22974 10.1002/jbt.22974 34939720 70. Eichwald T. Solano A.F. Souza J. de Miranda T.B. Carvalho L.B. dos Santos Sanna P.L. da Silva R.A.F. Latini A. Anti-Inflammatory Effect of Caffeine on Muscle under Lipopolysaccharide-Induced Inflammation Antioxidants 2023 12 554 10.3390/antiox12030554 36978802 PMC10045054 71. Soliman M.L. Geiger J.D. Chen X. Caffeine Blocks HIV-1 Tat-Induced Amyloid Beta Production and Tau Phosphorylation J. Neuroimmune Pharmacol. 2017 12 163 170 10.1007/s11481-016-9707-4 27629410 PMC5316495 72. Hosny E.N. Sawie H.G. Elhadidy M.E. Khadrawy Y.A. Evaluation of Antioxidant and Anti-Inflammatory Efficacy of Caffeine in Rat Model of Neurotoxicity Nutr. Neurosci. 2019 22 789 796 10.1080/1028415X.2018.1446812 29514562 73. Zhang Q.-W. Lin L.-G. Ye W.-C. Techniques for Extraction and Isolation of Natural Products: A Comprehensive Review Chin. Med. 2018 13 20 10.1186/s13020-018-0177-x 29692864 PMC5905184 74. Santos T.R.J. de Santana L.C.L.A. Conventional and Emerging Techniques for Extraction of Bioactive Compounds from Fruit Waste Braz. J. Food Technol. 2022 25 e2021130 10.1590/1981-6723.13021 75. Mussatto S.I. Chapter 11—Generating Biomedical Polyphenolic Compounds from Spent Coffee or Silverskin Coffee in Health and Disease Prevention Preedy V.R. Academic Press San Diego, CA, USA 2015 93 106 978-0-12-409517-5 76. Serna-Jiménez J.A. Torres-Valenzuela L.S. Sanín Villarreal A. Roldan C. Martín M.A. Siles J.A. Chica A.F. Advanced Extraction of Caffeine and Polyphenols from Coffee Pulp: Comparison of Conventional and Ultrasound-Assisted Methods LWT 2023 177 114571 10.1016/j.lwt.2023.114571 77. Coelho J. Filipe R. Robalo M. Boyadzhieva S. Cholakov G. STATEVA R. Supercritical CO 2 J. Supercrit. Fluids 2020 161 104825 10.1016/j.supflu.2020.104825 78. Thai L.Q. Niwat C. Qin S. Konsue N. Supercritical Carbon Dioxide and Ethanol-Assisted Extraction of Bioactive Compounds from Bourbon, Catimor, and Caturra coffee pulp for maximized antioxidant and therapeutic properties Future Foods 2024 9 100381 10.1016/j.fufo.2024.100381 79. Avilés-Betanzos K.A. Scampicchio M. Ferrentino G. Ramírez-Sucre M.O. Rodríguez-Buenfil I.M. Evaluation of the Capsaicinoid Extraction Conditions from Mexican Capsicum chinense Processes 2023 11 2272 10.3390/pr11082272 80. Milovanovic S. Lukic I. Krgovic N. Tadic V. Radovanovic Z. Tyśkiewicz K. Konkol M. Selection of Processing Parameters for the Integrated Supercritical CO 2 J. Supercrit. Fluids 2024 206 106163 10.1016/j.supflu.2023.106163 81. Sökmen M. Demir E. Alomar S.Y. Optimization of Sequential Supercritical Fluid Extraction (SFE) of Caffeine and Catechins from Green Tea J. Supercrit. Fluids 2018 133 171 176 10.1016/j.supflu.2017.09.027 82. Streimikyte P. Viskelis P. Viskelis J. Enzymes-Assisted Extraction of Plants for Sustainable and Functional Applications Int. J. Mol. Sci. 2022 23 2359 10.3390/ijms23042359 35216475 PMC8876524 83. Santana Á.L. Queirós L.D. Martínez J. Macedo G.A. Pressurized Liquid- and Supercritical Fluid Extraction of Crude and Waste Seeds of Guarana ( Paullinia cupana Food Bioprod. Process. 2019 117 194 202 10.1016/j.fbp.2019.07.007 84. Cortes-Ferre H.E. Antunes-Ricardo M. Gutiérrez-Uribe J.A. Enzyme-Assisted Extraction of Anti-Inflammatory Compounds from Habanero Chili Pepper ( Capsicum chinense Front. Nutr. 2022 9 942805 10.3389/fnut.2022.942805 36159478 PMC9498820 85. Putra N.R. Rizkiyah D.N. Aziz A.H.A. Mamat H. Jusoh W.M.S.W. Idham Z. Yunus M.A.C. Irianto I. Influence of Particle Size in Supercritical Carbon Dioxide Extraction of Roselle ( Hibiscus sabdariffa Sci. Rep. 2023 13 10871 10.1038/s41598-023-32181-8 37407592 PMC10322909 86. Yian L.N. Putra N.R. Idham Z. Mohd Idrus N.F. Abdul Aziz A.H. Mohd Setapar S.H. Che Yunus M.A. Supercritical Carbon Dioxide Extraction of Hevea Brasiliensis Seeds: Influence of Particle Size on to Oil Seed Recovery and its Kinetic Malays. J. Fundam. Appl. Sci. 2021 17 253 261 10.11113/mjfas.v17n3.2073 87. González-Alejo F.A. Barajas-Fernández J. Olán-Acosta M.D.L.Á. Lagunes-Gálvez L.M. García-Alamilla P. Supercritical Fluid Extraction of Fat and Caffeine with Theobromine Retention in the Cocoa Shell Processes 2019 7 385 10.3390/pr7060385 88. Mazzutti S. Rodrigues L.G.G. Mezzomo N. Venturi V. Ferreira S.R.S. Integrated Green-Based Processes Using Supercritical CO 2 Theobroma cacao J. Supercrit. Fluids 2018 135 52 59 10.1016/j.supflu.2017.12.039 89. Pagliari S. Celano R. Rastrelli L. Sacco E. Arlati F. Labra M. Campone L. Extraction of Methylxanthines by Pressurized Hot Water Extraction from Cocoa Shell by-Product as Natural Source of Functional Ingredient LWT 2022 170 114115 10.1016/j.lwt.2022.114115 90. Myo H. Nuntawat K. Optimization of Ultrasound-Assisted Extraction of Bioactive Compounds from Coffee Pulp Using Propylene Glycol as a Solvent and Their Antioxidant Activities Ultrason. Sonochem. 2022 89 106127 10.1016/j.ultsonch.2022.106127 36007328 PMC9424582 91. Bajer T. Bajerová P. Kremr D. Eisner A. Ventura K. Central Composite Design of Pressurised Hot Water Extraction Process for Extracting Capsaicinoids from Chili Peppers J. Food Compos. Anal. 2015 40 32 38 10.1016/j.jfca.2014.12.008 92. Carpentieri S. Režek Jambrak A. Ferrari G. Pataro G. Pulsed Electric Field-Assisted Extraction of Aroma and Bioactive Compounds from Aromatic Plants and Food by-Products Front. Nutr. 2022 8 792203 10.3389/fnut.2021.792203 35155517 PMC8829011 93. Tshering G. Posadzki P. Kongkaew C. Efficacy and Safety of Topical Capsaicin in the Treatment of Osteoarthritis Pain: A Systematic Review and Meta-Analysis Phytother. Res. 2024 38 3695 3705 10.1002/ptr.8223 38761115 94. Okoro N.K. Oseni B.A. Okubanjo O.O. Adegun A.A. Ilomuanya M.O. Development of Diclofenac and Capsaicin Emulgel for the Management of Inflammation in Rheumatoid Arthritis Trop. J. Nat. Prod. Res. 2023 7 3246 3252 95. Diaz Jalaff L. Ortega Cancino E. Altavilla M. Vargas Hurtado K. Nolan Mella N. Faccini M. Eco-Friendly Sol–Gel Coatings as Microfouling Barrier for Marine Applications Coatings 2023 13 1755 10.3390/coatings13101755 96. Rakesh V. Patgiri P. Borah A. Nandhini D. Gogoi I. Comparative Study on the Repellency and Chemical Profiles of Different Chilli Peppers Formulations Against Sitophilus oryzae J. Stored Prod. Res. 2024 106 102312 10.1016/j.jspr.2024.102312 97. Noor Hasyierah M.S. Norhidayah A. Rahayu M.A. Adilah A. Nur Humaira I. Botanical Insecticide of Chili and Ginger Extract on Nilaparvata lugens IOP Conf. Ser. Mater. Sci. Eng. 2020 932 012001 10.1088/1757-899X/932/1/012001 98. Global Market Insights Inc Capsaicin Market Size & Share, Global Report 2023–2032 Available online: https://www.gminsights.com/industry-analysis/capsaicin-market (accessed on 2 September 2025) 99. Hussain N. bt Md Dali A.Z. Munawar N. Effects of Fat Contents and Particle Size of Cocoa Nibs on Alkaloid Composition, Antioxidant Activities, and Volatile Compound of Concentrated Cocoa Drink J. Food Process. Preserv. 2021 45 e15748 10.1111/jfpp.15748 100. Jozinović A. Panak Balentić J. Ačkar Đ. Babić J. Pajin B. Miličević B. Guberac S. Vrdoljak A. Šubarić D. Cocoa Husk Application in the Enrichment of Extruded Snack Products J. Food Process. Preserv. 2019 43 e13866 10.1111/jfpp.13866 101. Agudelo C. Bravo K. Ramírez-Atehortúa A. Torres D. Osorio E. Carrillo-Hormaza L. Chemical and Skincare Property Characterization of the Main Cocoa Byproducts: Extraction Optimization by Rsm Approach for Development of Sustainable ingredients Molecules 2021 26 7429 10.3390/molecules26247429 34946510 PMC8709444 102. Danaswari M.S. Yogiartono R.M. Rachmadi P. Rubbing Cacao Bean Extract in Improving Microhardness Enamel on Dental Bleaching Int. J. Pharm. Res. 2020 12 1579 1584 10.31838/ijpr/2020.12.04.226 103. Taneja V. Nekkanti S. Gupta K. Hassija J. Remineralization Potential of Theobromine on Artificial Carious Lesions J. Int. Soc. Prev. Community Dent. 2019 9 576 583 10.4103/jispcd.jispcd_265_19 32039078 PMC6905311 104. Stats Market Research Global Theobromine Market Research Report 2024 (Status and Outlook) Available online: https://www.statsmarketresearch.com/global-theobromine-2024-297-8012027 (accessed on 2 September 2025) 105. Sharma R. Theobromine Market Report | Global Forecast From 2025 To 2033 Available online: https://dataintelo.com/report/theobromine-market (accessed on 2 September 2025) 106. Data Horizzon Research Capsaicin Market Size, Growth Analysis & Forecast Report—2033 Available online: https://datahorizzonresearch.com/capsaicin-market-58589 (accessed on 2 September 2025) 107. Dauber C. Romero M. Chaparro C. Ureta C. Ferrari C. Lans R. Frugoni L. Echeverry M.V. Calvo B.S. Trostchansky A. Cookies Enriched with Coffee Silverskin Powder and Coffee Silverskin Ultrasound Extract to Enhance Fiber Content and Antioxidant Properties Appl. Food Res. 2024 4 100373 10.1016/j.afres.2023.100373 108. Benincá D.B. do Carmo L.B. Grancieri M. Aguiar L.L. Lima Filho T. Costa A.G.V. Oliveira D.D.S. Saraiva S.H. Silva P.I. Incorporation of Spent Coffee Grounds in Muffins: A Promising Industrial Application Food Chem. Adv. 2023 3 100329 10.1016/j.focha.2023.100329 109. Huang G. Huang Y. Sun Y. Lu T. Cao Q. Chen X. Characterization of Kombucha Prepared from Black Tea and Coffee Leaves: A Comparative Analysis of Physiochemical Properties, Bioactive Components, and Bioactivities J. Food Sci. 2024 89 3430 3444 10.1111/1750-3841.17027 38638068 110. Shaddel R. Rajabi-Moghaddam S. Encapsulation of Caffeine in Chitosan-Coated Nanoliposomes and Its Application in Drink Formulation Food Hydrocoll. 2024 149 109598 10.1016/j.foodhyd.2023.109598 111. Kassem A.A. Asfour M.H. Abd El-Alim S.H. Khattab M.A. Salama A. Topical Caffeine-Loaded Nanostructured Lipid Carriers for Enhanced Treatment of Cellulite: A 32 Full Factorial Design Optimization and in Vivo Evaluation in rats Int. J. Pharm. 2023 643 123271 10.1016/j.ijpharm.2023.123271 37499772 112. Bazana M.T. Codevilla C.F. de Menezes C.R. Nanoencapsulation of Bioactive Compounds: Challenges and Perspectives Curr. Opin. Food Sci. 2019 26 47 56 10.1016/j.cofs.2019.03.005 113. Singh A.K. Pal P. Pandey B. Goksen G. Sahoo U.K. Lorenzo J.M. Sarangi P.K. Development of “Smart Foods” for Health by Nanoencapsulation: Novel Technologies and Challenges Food Chem. X 2023 20 100910 10.1016/j.fochx.2023.100910 38144773 PMC10740092 114. Neha G. Rakesh N. Siddharth D. Caffeine Market Report and Forecast 2025–2034 Available online: https://www.expertmarketresearch.com/reports/caffeine-market (accessed on 2 September 2025) 115. Mark Wide Research. Caffeine Market Analysis-Industry Size, Share, Research Report, Insights, Covid-19 Impact, Statistics, Trends, Growth and Forecast 2025–2034 | Size, Share, Growth Available online: https://markwideresearch.com/coffee-market. (accessed on 1 September 2025) 116. Research and Markets 2025 Caffeine Market Report—Industry Size, Competition, Trends and Growth Opportunities by Region—Forecast by Types and Applications (2024–2032) Available online: https://www.researchandmarkets.com/reports/5608033/2025-caffeine-market-report-industry-size (accessed on 2 September 2025) 117. QY Research Global Caffeine Industry Research Report, Growth Trends and Competitive Analysis 2024–2030 Available online: https://www.qyresearch.com/reports/2699919/caffeine (accessed on 2 September 2025) Figure 1 Fruit anatomy and distribution of ( A B C Figure 2 Chemical structures of theobromine, caffeine, and capsaicinoids reviewed. The different colors in the molecules indicate the functional group that changes within each set of families. ",
  "metadata": {
    "Title of this paper": "Global Caffeine Industry Research Report, Growth Trends and Competitive Analysis 2024–2030",
    "Journal it was published in:": "Molecules",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473109/"
  }
}