{
  "title": "Paper_134",
  "abstract": "pmc Cell Rep Med Cell Rep Med 3954 cellrepsmed Cell Reports Medicine 2666-3791 Elsevier PMC12490261 PMC12490261.1 12490261 12490261 40925373 10.1016/j.xcrm.2025.102320 S2666-3791(25)00393-3 102320 1 Article Rapid and sensitive acute leukemia classification and diagnosis platform using deep learning-assisted SERS detection Zhang Dongjie 1 2 3 4 16 Cheng Zhaoyang 1 2 16 Song Yali 5 16 Li Huandi 1 2 Shi Lin 1 2 Wang Nan 1 2 Peng Yingwen 1 2 3 Chen Renan chen-renan@163.com 6 ∗ Sun Nianzheng sdqlyysnz@email.sdu.edu.cn 7 8 ∗∗ Han Min hanmin@sdfmu.edu.cn 9 ∗∗∗ Hu Fengjiao 10 Zong Chuntao 6 Zhang Rui 8 Chen Si 5 Zhu Conghui 6 Zhang Xiaoli 6 Li Xiaobo 11 Ma Xiaopeng 12 Shi Changbei 13 Zhang Xiaofei 14 Liu Rui 1 2 Ren Ziqi 1 2 Wang Lin 15 Zeng Qi qzeng@xidian.edu.cn 1 2 ∗∗∗∗ Zeng Tingting zengtingting80@scu.edu.cn 5 10 ∗∗∗∗∗ Chen Xueli xlchen@xidian.edu.cn 1 2 3 4 17 ∗∗∗∗∗∗ 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 ∗ chen-renan@163.com ∗∗ sdqlyysnz@email.sdu.edu.cn ∗∗∗ hanmin@sdfmu.edu.cn ∗∗∗∗ qzeng@xidian.edu.cn ∗∗∗∗∗ zengtingting80@scu.edu.cn ∗∗∗∗∗∗ xlchen@xidian.edu.cn 16 These authors contributed equally 17 Lead contact 16 9 2025 08 9 2025 6 9 498186 102320 10 3 2025 17 6 2025 31 7 2025 08 09 2025 03 10 2025 03 10 2025 © 2025 The Author(s) 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). Summary Rapid identification and accurate diagnosis are critical for individuals with acute leukemia (AL). Here, we propose a combined deep learning and surface-enhanced Raman scattering (DL-SERS) classification strategy to achieve rapid and sensitive identification of AL with various subtypes and genetic abnormalities. More than 390 of cerebrospinal fluid (CSF) samples are collected as targets, encompassing healthy control, AL patients, and individuals with other diseases. Sensitive SERS detection could be achieved within 5 min, using only 0.5 μL volume of CSF. Through integrated feature fusion (1D spectra and 2D image) with a transformer model, the classification method is developed to screen and diagnose AL patients, demonstrating exceptional classification performances of accuracy, sensitivity, specificity, or reliability. Also, this approach demonstrates remarkable versatility and could be extended to the classifications of meningitis diseases. The sensitive DL-SERS classification platform has the potential to be a powerful auxiliary in vitro Graphical abstract Highlights • Enriched SERS is employed to detect clinical cerebrospinal fluids (CSFs) • Sensitive spectral classification is established through transformer • Discriminations of acute leukemia with various categories or subtypes are realized Zhang et al. propose a combined deep learning and surface-enhanced Raman spectroscopy (DL-SERS) classification strategy to achieve rapid and sensitive identifications of AL with various subtypes or genetic abnormalities. This DL-SERS classification platform has the potential to be a powerful auxiliary in vitro Keywords surface enhanced raman scattering acute leukemia deep learning cerebrospinal fluids pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Published: September 8, 2025 Introduction Central nervous system leukemia (CNSL) is the main cause of leukemia relapse and drug resistance development and potentially results in serious complications and life-threatening situations. Rapid identification and immediate symptomatic treatment are of paramount importance for patients with CNSL. 1 , 2 3 4 , 5 The measurement and evaluation of CSF biomarkers released or secreted by leukemia cells might represent a more sensitive, accurate, and quantitative diagnostic approach compared to cytological detection methods. 2 6 7 , 8 , 9 10 Surface-enhanced Raman scattering (SERS) is a powerful molecular fingerprint spectroscopy technique characterized by its high sensitivity, excellent specificity, fast detection speed, simplicity of use in situ 11 , 12 13 14 , 15 , 16 17 , 18 , 19 , 20 , 21 , 22 Here, CSF samples with relatively simple biochemical components were selected as the target substances, and a reliable SERS detection method based on focused and space-confined hotspots was established. Then, a combined DL-SERS classification strategy was developed to identify healthy controls and various categories or subtypes of AL, encompassing AML or ALL, subtypes of AML and ALL, the subtypes of B-ALL with genetic abnormalities or breakpoint cluster region/abelson murine leukemia viral oncogene homolog1 (BCR/ABL) relevant gene (e.g., Ph+ with p190 or p210, and Ph-like), and AL with CNS involvements. Compared to existing leukemia detection techniques, the combined deep learning and surface-enhanced Raman scattering (DL-SERS) classification method may offer the following potential benefits: (1) Fast and simple: only 0.5 μL of CSF sample was required without any pretreatment, and the spectral data can be obtained within 5 min; (2) excellent classification performance: for various AL subtypes and categories, the prediction accuracy, sensitivity, and specificity can exceed 90%; and (3) generalizability and transferability: the data fusion- and transformer-driven DL-SERS classification method could be extended to the diagnosis of other CNS-related diseases, such as meningitis. Results Datasets and study design We collected 332 CSF samples from five different medical institutions across the country, comprising 268 cases from individuals with acute leukemia and 64 samples from healthy controls. The healthy control cohort primarily consisted of individuals presenting with dizziness or headaches, who were subsequently ruled out for leukemia, tumors, infections, and other organic lesions through a series of clinical examinations. In other words, these participants’ symptoms were idiopathic and unrelated to the diseases under investigation. The disease cohort encompassed patients with various subtypes of acute leukemia, including AML, ALL, and their respective subcategories. In accordance with the French-American-British classification and leukemia cell types, the AML patients in this study were categorized into three groups: M1/M2 (acute myeloblastic leukemia with minimal maturation/maturation, 36 samples), M3 (APL, acute promyelocytic leukemia, 32 samples), and M4/M5 (acute myelomonocytic/monocytic leukemia, 43 samples). The ALL patients were divided into two subtypes: B-cell acute lymphoblastic leukemia (B-ALL) and T-cell acute lymphoblastic leukemia (T-ALL). Given the lower cure rate and incidence of T-ALL compared to B-ALL, the sample number of T-ALL (30 samples) in the study cohort was significantly lower than that of B-ALL (67 samples). Based on genetic abnormalities, the B-ALL disease cohort was further subclassified into genetic abnormalities and genetic normal groups or BCR/ABL fusion gene positive and negative groups. Furthermore, patients with CNS involvement, as determined through repetitive cytological examinations or FCM, were classified into a separate CNS involvement cohort, which included 11 patients. The control group for the CNSL cohort was selected by the following method: after undergoing 2–3 rounds of cytological and FCM tests, patients with different subtypes of acute leukemia were diagnosed as not having CNS infiltration. Within this range, 11 cases of patients were randomly selected as the control group. Table 1 Table 1 Characteristics of the primary and external test datasets Primary cohort External validation cohort Entire dataset No. of subjects No. of SERS spectra Gender Age in years (range) No. of subjects No. of SERS spectra Gender Age in years (range) No. of subjects Male Female Male Female Total 212 12,139 87 (41.0%) 125 (59.0%) 39 ± 1 (14–79) 120 6,000 56 (46.7%) 64 (53.3%) 36 ± 2 (15–61) 332 Control cohort 64 3517 25 (39.1%) 39 (60.9%) 45 ± 3 (14–79) / / / / / 64 Leukemia cohort 148 8,622 62 (41.9%) 86 (58.1%) 36 ± 2 (14–67) 120 6,000 56 (46.7%) 64 (53.3%) 38 ± 7 (15–61) 268 Acute myeloid leukemia (AML) 81 4,828 34 (41.9%) 47 (58.1%) 37 ± 2 (15–58) 15 750 7 (46.7%) 8 (53.3%) 34 ± 6 (15–52) / Acute lymphoblastic leukemia (ALL) 67 3,794 28 (41.8%) 39 (58.2%) 34 ± 3 (14–67) 15 750 11 (73.3%) 4 (26.7%) 37 ± 8 (16–61) / AML M1/M2 subtypes 26 1,577 12 (46.2%) 14 (53.8%) 37 ± 5 (15–58) 10 500 2 (20%) 8 (80%) 29 ± 6 (15–47) / M3 subtypes 22 1,445 7 (31.8%) 15 (68.2%) 40 ± 5 (17–55) 10 500 3 (30%) 7 (70%) 44 ± 6 (19–52) / M4/M5 subtypes 33 1,806 15 (45.5%) 18 (54.5%) 36 ± 3 (15–55) 10 500 5 (50%) 5 (50%) 37 ± 8 (15–54) / ALL T cell ALL (T-ALL) 15 883 10 (66.7%) 5 (33.3%) 35 ± 6 (16–50) 15 750 9 (60%) 6 (40%) 31 ± 6 (16–50) / B cell ALL (B-ALL) 52 2,911 18 (34.6%) 34 (65.4%) 34 ± 3 (14–67) 15 750 4 (26.7%) 11 (73.3%) 39 ± 7 (16–57) / B-ALL B-ALL without genetic abnormalities 17 927 4 (23.5%) 13 (76.5%) 35 ± 6 (14–61) 15 750 6 (40%) 9 (60%) 34 ± 7 (16–57) / B-ALL with genetic abnormalities 35 1,984 14 (40%) 21 (60%) 34 ± 4 (16–67) 15 750 9 (60%) 6 (40%) 39 ± 7 (15–61) / BCR/ABL fusion gene positive 29 1,404 12 (41.4%) 17 (58.6%) 37 ± 4 (17–67) / / / / / / BCR/ABL fusion gene negative 23 1,507 6 (26.1%) 17 (73.9%) 31 ± 5 (14–61) / / / / / / Central nervous system (CNS) involvements 11 554 4 (36%) 7 (64%) 42 ± 7 (20–54) / / / / / / Combined DL-SERS classification strategy The combined DL-SERS classification strategy encompasses several components: SERS spectral data acquisition, deep learning classification method, AL screening, diagnosis, and generalizability validation of classification methods. The SERS detection consists of three parts: collection of CSF specimens from clinical individuals, SERS spectra acquisition, and data preprocessing. An enrichment-based SERS strategy was employed to achieve the acquisition of highly sensitive spectral data ( Figure 1 Figure 1 Figures 1 Figure 1 Overview of the combined deep learning-assisted SERS (DL-SERS) classification strategy (A) Collection of SERS spectra data. CSFs collected from more than 390 individuals are used as detection targets. Spectral data are acquired based on the enriched SERS “hotspots.” For each CSF sample, at least 50 of spectral curves were collected randomly to improve the signal reliability. (B) DL-SERS classification. The classification model comprised several parts: pretreatments of one-dimensional (1D) spectra and two-dimensional (2D) image, date splicing and fusion, transformer classification, and output by multi-layer perception (MLP) mechanism. (C) The screening model takes syncretic spectral and image data as inputs and outputs the related binary classification to discriminate acute leukemia. (D) The diagnostic model is established for the classifications of AL with different categories or subtypes, including AML or ALL, subtypes of AML or ALL, the subtypes of B-ALL with genetic abnormalities or BCR/ABL relevant gene, and AL with CNS involvements. (E) The generalizability of DL-SERS classification. Various subtypes of meningitis are employed, including autoimmune encephalitis, novel cryptococcal meningitis, viral meningitis, or tuberculous meningitis. For the deep learning classification approach, the integration of one-dimensional (1D) spectra and two-dimensional (2D) image was used as the input data. Principal-component analysis (PCA) was utilized to extract features from the 1D spectra, while the ResNet50 architecture was engaged for feature extraction from the 2D image. Subsequently, these two categories of features were combined through a matrix concatenation approach. The transformer algorithm was implemented to identify, process, and generate features, yielding the corresponding attention weights. The weight vectors were thereafter normalized and linearly manipulated and subsequently added to the original data to obtain the output. Eventually, multi-layer perceptrons (MLP) and fully connected layers were employed to generate the classification outcomes. The optimized model derived from the validation set was adopted as the final classification model for the subsequent classification and prediction. In the data partitioning process, CSF samples were collected from 332 patients across five medical centers, comprising 268 patients with acute leukemia and 64 healthy individuals. These samples were randomly divided into two cohorts: a primary cohort ( n n Figure S1 The validation accuracy served as an index to evaluate the performance and reliability of the transformer-based classification model. As the learning iterations ranged from 0 to 300, the accuracy values of the validation set progressively stabilized and converged for different classification models, signifying the absence of overfitting. The model was trained with an optimized iteration count of 100, attaining outstanding validation accuracies ranging from 0.9 to 0.95, without triggering early stopping ( Figure S1 Figure S2 −1 Figure S3 Figure S4 A variety of evaluation metrics, including the F 1 F 1 Prediction precision = true positive/(true positive + false positive). Prediction accuracy = (true positive + true negative)/(true positive + false positive + true negative + false negative). Prediction sensitivity = true positive/(true positive + false negative). Prediction specificity = true negative/(false positive + true negative). Screening for acute leukemia Figure 2 Figures S5 Figure S5 Figure S5 Figure S5 Figure S6 Figure 2 Screening for acute leukemia (A) Schematic of the working principle of SERS detection. Two signal enhanced approaches are proposed: the physical enrichment by slippery liquid-infused porous surface (SLIPS) and the aggregation effect by NaCl (120–130 mM) contents in CSF. (B and C) SERS spectra and compared intensities of CSFs with different volumes ranging from 0.2 to 5 μL. (D and E) SERS spectra of CSFs collected from healthy individuals experiencing feelings of dizziness and headaches. All people have excluded the presence of leukemia, tumors, infections, and other organic lesions. (F) Compared SERS spectra for acute leukemia and healthy individuals. (G) The confusion matrix of binary classification for screening of acute leukemia and healthy individuals. (H) The receiver operating characteristic curves (ROCs) of binary classification for screening of acute leukemia and healthy individuals. (I) Compared classification performance of various deep learning methods, including feature fusions (1D spectra and 2D image) combined with transformer (data fusion & transformer), 1D spectra combined with transformer (1D spectra & transformer), features fusion combined with convolutional neural network (data fusion & CNN), and 1D spectra combined with CNN (1D spectra & CNN). The optical image of dried SERS substrates was characterized as shown in the inset image ( Figure S7 Figure S7 Figures S7 Figures 2 S7 −1 Figure 2 Figure S8 −1 Spectral data from a healthy cohort comprising 32 individuals with dizziness and 32 with headaches, as well as a disease cohort of 148 cases, were measured using the optimized SERS detection method described earlier. At least 50 spectral curves were acquired for each CSF sample, and average SERS spectra were plotted to mitigate the influence of random events. From the 64 participants in the healthy group, 5 individuals with dizziness and 5 individuals with headache were selected to demonstrate that individual variability may lead to significant changes in spectral characteristics. As depicted in Figures 2 Figure S9 −1 Figure S10 Figure S10 An overlay of SERS spectra from all subjects is presented in Figure 2 Table S1 Figure S11 Table S2 Due to the impact of inter-individual variability, classification and prediction of unknown individuals based on the characteristic peak positions or intensities of CSF spectra were not feasible. Consequently, a dataset of 12,139 spectral data, including 3,517 from the healthy cohort and 8,622 from the acute leukemia cohort, was input into a deep learning classification model for training, validation, and testing. Based on transformer algorithm combined with feature fusion (1D spectra and 2D image) method, the confusion matrix results indicated a classification accuracy of 96.13% for distinguishing between the healthy and disease groups ( Figure 2 F 1 Figure 2 Figure 2 F 1 Diagnosis for acute leukemia The diagnostic method based on data fusion and transformer was primarily utilized for the identification and classification of various subtypes or disease stages of acute leukemia, including patients with AML or ALL, subtypes of AML and ALL, B-ALL patients with genetic or BCR/ABL-relevant fusion gene abnormalities, and AL patients with CNS involvements ( Figure S12 −1 Figure S12 Figures S12 S13–S15 Figure S16 −1 However, for patients with genetic abnormalities or BCR/ABL fusion gene alterations, the spectral variability among individuals was significant ( Figures S12 S17 S18 Figure S18 −1 − Figure S12 Table S3 Table S4 Figure S19 −1 −1 Figures S20–S22 Based on the SERS spectral data from AL patients, a multifunctional diagnostic model was constructed using the data fusion and transformer-based deep learning network, encompassing six distinct binary or ternary classifications. The primary dataset comprised 8,622 spectra from 148 individual patients. Figure 3 Figures 3 Figures 3 Table 2 F 1 F 1 Figure S23 Figure S24 Figure 3 Diagnosis for acute leukemia (A–F) Confusion matrices of prediction results for identification of AL with different categories or subtypes based on feature fusions (1D spectra and 2D image) combined with transformer. The diagnostic results contain various binary or trinary classifications, including (A) AML/ALL, (B) B-ALL/T-ALL, (C) AML subtypes (M1&M2, M3, and M4&M5), (D) B-ALL chromosome normal or abnormal, (E) BCR/ABL fusion gene positive or negative, and (F) CNS involvements or not. (G–L) ROCs for the diagnostic of AL with different categories or subtypes, including (G) AML/ALL, (H) B-ALL/T-ALL, (I) AML subtypes, (J) B-ALL chromosome normal or abnormal, (K) BCR/ABL1 fusion gene positive or negative, and (L) CNS involvements or not. Table 2 Summarized classification performances of the diagnostic models of acute leukemia with various categories or subtypes ALL/AML B-ALL/T-ALL AML B-ALL genetic-norm/abnormal BCR-ABL positive/negative CNS involvement or not F 1 0.969 0.938 0.921 0.967 0.949 0.967 Accuracy 96.2% 96.5% 91.8% 94.3% 93.9% 95.9% Sensitivity 98.4% 95.0% 91.7% 93.5% 93.1% 98.8% Specificity 93.0% 97.1% 95.9% 95.0% 94.9% 91.1% ROC 0.99 0.98 0.97 0.99 0.98 0.99 To assess the reliability of the AL diagnostic model, an external independent validation was conducted using 120 cases of AL patients collected separately from different hospitals. The external test dataset comprised 6,000 of spectral data points, and the detailed clinical information of the patients was provided in Table 1 Table S5 Figure 4 Figure 4 External validation of DL-SERS classification and the flow cytometry analysis (A) Compared prediction accuracy performances for the internal and external set validation. The diagnostic results contain AML/ALL, ALL subtypes, AML subtypes, and B-ALL with or without genetic abnormalities. (B) SERS spectra of CSF samples from B-ALL patients with CNS involvements at different stages. The proportions of abnormal primitive B lymphocytes in CSFs were 0%, 15.3%, and 24%. (C–E) FCM results of CNSL patients originating from B-ALL with varying proportions of abnormal primitive B lymphocytes in CSF: (C) 0%, (D) 15.3%, and (E) 24%. In these figures, the red dots denote leukemia cells, while the green dots signify normal lymphocytes. Investigation into CNS involvements resulting from various acute leukemia patients was conducted based on the SERS spectra and FCM results. Firstly, B-ALL patients at various CNS infiltration stages were selected for investigation, with CD33, CD34, CD64, CD7, and human leukocyte antigen-D related (HLA-DR) chosen as biomarkers for FCM analysis. The results revealed that the proportions of abnormal primitive B lymphocytes in CSF of these individuals were 0%, 15.3%, and 24%, ( Figures 4 Figure 4 −1 −1 −1 −1 Figures S25 −1 −1 −1 −1 −1 −1 −1 Figure S25 Generalizability and transferability To validate the generalizability and transferability of the DL-SERS diagnosis platform, meningitis with various subtypes was selected as the subject of study, with CSF samples from patients collected to obtain SERS spectral data. The dataset comprised a total of 3,000 spectral entries from 60 individuals, distributed across different meningitis patient groups: viral meningitis (15 cases), tubercular meningitis (15 cases), cryptococcal meningitis (15 cases), and autoimmune encephalitis (15 cases). Demographic information such as the number of patients, gender, and age distribution is presented in Table S6 Figures 5 Figures 5 Figure 5 Generalizability and transferability of DL-SERS classification for meningitis (A–D) SERS spectra of CSF samples collected from meningitis patients with various subtypes, including (A) viral meningitis, (B) tubercular meningitis, (C) cryptococcal meningitis, and (D) autoimmune encephalitis. All patients have been diagnosed through the CSF biochemical testing and cytological methods. (E) The confusion matrix of four-class classification for various meningitis subtypes. (F) The ROCs of four-class classification for various meningitis subtypes. Discussion In comparison with blood, plasma, or urine samples, CSF generally exhibits a more simplified composition owing to the presence of the blood-brain barrier. It predominantly comprises water; chloride (approximately 120–130 mM); glucose (2.5–4.5 mM); and only trace amounts of proteins, enzymes, or nucleic acids. Virtually no cells can be detected in the CSF of healthy individuals. Hence, as a distinctive human fluid for liquid biopsy, the SERS spectra of CSF samples are more amenable to processing and analysis. The biological metabolites present within the CSF might be intimately correlated with the degree or progression of CNS involvement in different patients. The CSF-based liquid biopsy approach holds promise for the early screening and detection of cerebral or CNS-related disorders. 23 As a fingerprint spectroscopic technique with single-molecule sensitivity, SERS detection involves complex interactions among photons, target substances, and the enhanced substrates. 24 , 25 26 , 27 CNS infiltration poses a significant clinical challenge in the field of acute leukemia detection and diagnosis, often leading to severe complications and mortality. This challenge arises because infiltrated leukemia cells readily adhere to the inner wall of meningeal blood vessels, consequently reducing detection sensitivity in the early stages of CNS infiltration. It is reported that CNSL was identified in about 3%–5% of patients at initial diagnosis and in 30%–40% of patients at relapse. 28 in situ The previously reported AI-assisted SERS strategies mainly utilized networks like convolutional neural networks or artificial neural networks to classify targets based on the 1D characteristics of Raman spectral data. 29 , 30 , 31 , 32 33 In summary, the DL-SERS-based CSF detection could emerges as a highly sensitive and rapid strategy compared to existing cellular diagnostic techniques. It has the potential to serve as a potent auxiliary in vitro Limitations of the study Establishing a precise correlation between experimental SERS spectra and molecular differences in the CSFs remains challenging in this work. In future research, efforts should be made to establish the possible correlation between experimental fingerprint data and molecule information in CSFs or other clinical samples, to clarify the molecular mechanism of the occurrence and development of CNS diseases. In addition, the sample size of CNSL individuals here is small, which may lead to insufficient reliability of the recognition model. Resource availability Lead contact Further information and requests for resources should be directed to and will be fulfilled by the lead contact, Xueli Chen ( xlchen@xidian.edu.cn Materials availability This study did not generate new unique reagents. Data and code availability  • All data and any additional information are available from the lead contact • The codes and data including the model, the training engine, the testing script, and the model weight and partial test dataset have been deposited at Zenodo and are publicly available as of the date of publication. DOI is listed in the key resources table • Any additional information required to reanalyze the data reported in this work paper is available from the lead contact Acknowledgments This work has been supported by the 10.13039/501100001809 National Natural Science Foundation of China 32201133 62275210 82302632 National Leading Talent Program National Young Talent Program Shaanxi Young Top-notch Talent Program Association for Science and Technology 20230222 Science and Technology Projects in Guangzhou 2023A04J1509 10.13039/501100021171 Guangdong Basic and Applied Basic Research Foundation 2025A1515010789 1·3·5 project for disciplines of excellence 10.13039/501100013365 West China Hospital, Sichuan University ZYJC21067 Sichuan Science and Technology Program 2022YFS0214 10.13039/501100018542 Natural Science Foundation of Sichuan Province 2022NSFSC1305 10.13039/501100012226 Fundamental Research Funds for the Central Universities ZYTS25098 QTZX25113 10.13039/501100005320 Xidian University TZJH2024036 Shanxi Key Laboratory of Ferroelectric Physical Micro-nano Devices and Systems TDWL-202501 10.13039/501100005320 Xidian University Comprehensive Experimental Center for Chemistry and Bioscience of Xidian University https://www.mogoedit.com Author contributions D.Z., X.C., and T.Z. conceived and designed the study. H.L., Y.P., L.S., X.L., R.L., and Q.Z. conducted the experiments and characterizations. Z.C., Z.R., and N.W. implemented the deep learning algorithm. Y.S., F.H., C. Zong, R.Z., S.C., C. Zhu, Xiaoli Zhang, and M.H. performed the CSF sample collection and clinical testing. C.S., Xiaofei Zhang, X.M., and L.W. provided support for data analysis. X.C., T.Z., R.C., N.S., and Q.Z. supervised the study. D.Z., Z.C., Q.Z., and X.C. wrote and revised the manuscript. D.Z., Z.C., and Y.S. contributed equally to this work. Declaration of interests The authors declare no competing interests. STAR★Methods Key resources table  REAGENT or RESOURCE SOURCE IDENTIFIER Biological samples cerebrospinal fluids This paper N/A Chemicals, peptides, and recombinant proteins silver nitrate (0.1 mol/L) Aladdin S116267; CAS No.: 7761-88-8 sodium citrate (≥99%) Aladdin S189183; CAS No.:68-04-2 potassium iodide (≥99%) Sigma CAS No.: 7681-11-0 Perfluoropolyether lubricating oil (GPL107) Dupont Krytox CAS No.: 60164-51-4 Critical commercial assays BD FACSCanto™ Clinical Flow Cytometry System Becton, Dickinson and Company SFDA Certified No:20192222462 Software and algorithms Python (version 3.8.16) Python Software Foundation https://www.python.org PyTorch (version 2.1.1+cu121) Python Software Foundation https://www.python.org Numpy (version 1.23.5) Python Software Foundation https://www.python.org Matplotlib (version 3.7.1) Python Software Foundation https://www.python.org Pandas (version 2.0.3) Python Software Foundation https://www.python.org Seaborn (version 0.12.2) Python Software Foundation https://www.python.org Cuda (version 12.2) NVIDIA Developer https://developer.nvidia.com Cuda (version 8.8.1) NVIDIA Developer https://developer.nvidia.com MATLAB (version 2023a) MathWorks Developer https://www.mathworks.com/ Spectra classification algorithm This paper https://doi.org/10.5281/zenodo.15968616 Experimental model and study participant details Human subjects Clinical CSF samples employed in this study were provided by five different medical institutions, including West China Hospital, Xi’an Daxing Hospital, Qilu Hospital of Shandong University Dezhou Hospital, Shandong Provincial Qianfoshan Hospital and Chengdu Shangjin Nanfu Hospital. The collection and usage of clinical samples have been approved by the ethics committees of these five medical institutions. In total, the study contained 392 of CSF samples, including 64 samples received from healthy controls, 268 CSF samples from acute leukemia patients with different types, and 60 cases from meningitis patients. The healthy control cohort were collected from normal person with the feelings of dizziness or headaches, which have not been diagnosed with leukemia or other diseases undoubtedly. The detailed clinical diagnostic information of acute leukemia samples has been measured via different clinical detection methods. Especially, conventional cytological and flow cytometry have been used to identify the CNSL involvement and transfer for various types of acute leukemia. The received CSF samples were stored at −80°C. In order to ensure the biochemical components unchanged for detection and storage, each CSF sample should be used within 3 times of freeze-thaw cycles. Sample size estimation and allocation Assuming an expected sensitivity (P) of 0.9, a disease prevalence of 0.05, an allowable error (δ) of 0.1, and a significance level (α) of 0.05, the calculated sample size was determined to be 691, based on the following standard sensitivity estimation formula. n = Z α / 2 2 P ( 1 − P ) 0.05 δ 2 However, due to practical constraints in CSF sample collection, the final sample size we selected was 392. These samples here could be divided into three distinct groups: healthy controls ( n n n n n Method details Instrumentations The UV spectroscopy measurements were characterized using ultraviolet-visible spectroscopy (Agilent, Carry 60). SERS detection was conducted on a confocal Raman Spectrometer (Renishaw, Invia system). Flow cytometric analysis was conducted using the BD FACSCanto Clinical Flow Cytometry System along with the respective fluorescent antibodies, isotype controls, and CST fluorescent microspheres. Synthesis of Ag NPs SERS-active Ag NPs were prepared by the classical sodium citrate reduction method. In brief, 100 mL of AgNO 3 10 - 3 Enrichment-based SERS measurement For the enrichment-typed SERS detection, a slippery liquid-infused porous surface (SLIPS) substrate was prepared according to the previous report. 34 Deep learning-based classification method Spectral data preprocessing Smoothing, denoising and baseline subtraction were taken for achieving a better quality of Raman spectra. Savitzky-Golay was employed for smoothing and denoising, followed by an iterative baseline correction algorithm based on morphology to subtract the baseline background from the spectral data. To enable downstream image-based feature extraction and model fusion, the 2-D image data was generated through 1-D Raman spectral data’ transformation, rather than obtained using the Raman spectrometer’s mapping function. Here, Raman shift and corresponding intensity values were treated as independent and dependent variables, respectively, with a strict one-to-one mapping maintained across all data points. A linear interpolation algorithm was employed to resample the spectral points, minimizing the sum of squared residuals between adjacent data pairs. This interpolation strategy was selected to preserve key spectral characteristics while mitigating the risk of artificial oscillations-such as Gibbs artifacts-that can result from higher-order interpolation methods. Following interpolation, the data points were sequentially connected using solid lines to generate a continuous spectral curve. The resulting 2-D Raman image visually represents the spatial distribution of signal intensities and the variation of spectral peak shapes across the defined Raman shift range. This dimensional transformation from discrete spectral arrays to continuous image representations enhances both the interpretability and fidelity of the spectral features. The converted 2-D images were subsequently used for convolutional feature extraction and multimodal fusion within the classification framework. Feature extraction and fusion Spectral feature extraction and fusion comprised two components: 1-D 2-D 2-D 2-D Transformer classification method The core of the AL disease classification and diagnosis platform was based on the spectral recognition and classification component of the Transformer model. In this regard, six different types of classification were achieved, including non-leukemia or AL, AML or ALL, B-ALL or T-ALL, various subtypes of AML, B-ALL with or without genetic abnormalities, and BCR/ABL fusion gene positive or negative. The network model consisted of multiple components, including an Embedding layer, a Multi-Head Attention layer, a Multi-Layer Perceptron (MLP) which included two Linear layers and two Dropout layers, as well as a Fully Connected layer (FC). First, the fused features were embedded through an Embedding layer, transforming the data into fixed-dimensional vectors. They were then inputted into the Multi-Head Attention, which was the core of the classification model, allowing the model to simultaneously attend to information from different positions. Within the Multi-Head Attention, the batch size of the input data was first obtained, followed by the conversion of the input data into query (q), key (k), and value (v) vectors through linear layers. These vectors were respectively used to calculate attention scores, completed by performing matrix multiplication between the query vectors and key vectors, followed by normalization to obtain attention weights. These weights were used to weight the sum of the value vectors, with a dropout layer added to prevent overfitting, and the dropout rate was set to 0.1. Finally, the weighted value vectors were processed through normalization and linear layers, followed by addition to the original input data, yielding the output of the Multi-Head Attention. Next, the data processed through the Multi-Head Attention was subjected to adaptive average pooling to reduce dimensions and extract important features. The pooled data then entered the MLP module, which comprised two linear layers, each followed by a dropout layer and activated using the ReLU function. Subsequently, the data passed through an FC layer to transform it into the output dimension. For the binary classifications, a sigmoid activation function was used to convert the output into probability values ranging from 0 to 1, resulting in the final classification output. For the multi-class classifications (M1&M2, M3 and M4&M5), softmax activation was used, allowing the model to output probability values for each class, enabling the prediction of multiple class probabilities simultaneously. For the two classifications, the BCELoss function was employed as the model’s loss function to optimize its parameters, while the Adam optimizer updated the model’s parameters with a learning rate of 0.0001 during training. Similarly, in the multi-class classification, the CrossEntropyLoss function was used as the model’s loss function, and the Adam optimizer’s learning rate was also set to 0.0001. Other DL classification methods In addition to the aforementioned Transformer classification methods based on 1-D 2-D 1-D&2-D 1-D 1-D 1-D 1-D 2-D 1-D&2-D 1-D The 1-D CNN method also used preprocessed 1-D 2-D Quantification and statistical analysis We used Prism (Version 7.00) to analyze differences in model performance and to conduct correlation analysis between differential Raman spectral intensities and biochemical parameters. All model data are expressed as mean ± SD and were subjected to two-way ANOVA. Values of p References 1 Paul S. Short N.J. Central Nervous System Involvement in Adults with Acute Leukemia: Diagnosis, Prevention, and Management Curr. Oncol. Rep. 24 2022 427 436 35141858 10.1007/s11912-022-01220-4 2 Thastrup M. Duguid A. Mirian C. Schmiegelow K. Halsey C. Central nervous system involvement in childhood acute lymphoblastic leukemia: challenges and solutions Leukemia 36 2022 2751 2768 36266325 10.1038/s41375-022-01714-x PMC9712093 3 Del Principe M.I. Buzzatti E. Piciocchi A. Forghieri F. Bonifacio M. Lessi F. Imbergamo S. Orciuolo E. Rossi G. Fracchiolla N. Clinical significance of occult central nervous system disease in adult acute lymphoblastic leukemia. A multicenter report from the Campus ALL Network Haematologica 106 2021 39 45 31879328 10.3324/haematol.2019.231704 PMC7776237 4 Córdova-Serrano R.D. Almanza Huante E. Mártinez-Moreno E. Hérnandez-Alcántara A. Fernández-Sánchez E. Gomez-De Leon A. Espinosa K.A. Central Nervous System (CNS) Involvement in Adult Acute Lymphoblastic Leukemia (ALL) Assessed Solely By Flow Cytometry Has an Adverse Impact on Survival Blood 136 2020 2 3 5 Kopmar N.E. Cassaday R.D. How I prevent and treat central nervous system disease in adults with acute lymphoblastic leukemia Blood 141 2023 1379 1388 36548957 10.1182/blood.2022017035 PMC10082377 6 Gu J. Huang X. Zhang Y. Bao C. Zhou Z. Tong H. Jin J. Cerebrospinal fluid interleukin-6 is a potential diagnostic biomarker for central nervous system involvement in adult acute myeloid leukemia Front. Oncol. 12 2022 1013781 10.3389/fonc.2022.1013781 PMC9751393 36531024 7 Egyed B. Kutszegi N. Sági J.C. Gézsi A. Rzepiel A. Visnovitz T. Lőrincz P. Müller J. Zombori M. Szalai C. MicroRNA-181a as novel liquid biopsy marker of central nervous system involvement in pediatric acute lymphoblastic leukemia J. Transl. Med. 18 2020 250 32571344 10.1186/s12967-020-02415-8 PMC7310470 8 Haney M. Moore H. Sampathi S. Chernyavskaya Y. Badgett T. Blackburn J. Cell-Free DNA As a Biomarker for Acute Lymphoblastic Leukemia Relapse in the Central Nervous System Blood 136 2020 7 8 9 Cheung Y.T. Khan R.B. Liu W. Brinkman T.M. Edelmann M.N. Reddick W.E. Pei D. Panoskaltsis-Mortari A. Srivastava D. Cheng C. Association of Cerebrospinal Fluid Biomarkers of Central Nervous System Injury With Neurocognitive and Brain Imaging Outcomes in Children Receiving Chemotherapy for Acute Lymphoblastic Leukemia JAMA Oncol. 4 2018 e180089 29596541 10.1001/jamaoncol.2018.0089 PMC5885182 10 Lenk L. Alsadeq A. Schewe D.M. Involvement of the central nervous system in acute lymphoblastic leukemia: opinions on molecular mechanisms and clinical implications based on recent data Cancer Metastasis Rev. 39 2020 173 187 31970588 10.1007/s10555-020-09848-z PMC7098933 11 Cutshaw G. Uthaman S. Hassan N. Kothadiya S. Wen X. Bardhan R. The Emerging Role of Raman Spectroscopy as an Omics Approach for Metabolic Profiling and Biomarker Detection toward Precision Medicine Chem. Rev. 123 2023 8297 8346 37318957 10.1021/acs.chemrev.2c00897 PMC10626597 12 Liu J. Zheng T. Tian Y. Functionalized h-BN Nanosheets as a Theranostic Platform for SERS Real-Time Monitoring of MicroRNA and Photodynamic Therapy Angew Chem. Int. Ed. Engl. 58 2019 7757 7761 30963650 10.1002/anie.201902776 13 Guo S. Popp J. Bocklitz T. Chemometric analysis in Raman spectroscopy from experimental design to machine learning-based modeling Nat. Protoc. 16 2021 5426 5459 34741152 10.1038/s41596-021-00620-3 14 Dong S. He D. Zhang Q. Huang C. Hu Z. Zhang C. Nie L. Wang K. Luo W. Yu J. Early cancer detection by serum biomolecular fingerprinting spectroscopy with machine learning eLight 3 2023 17 10.1038/s41377-024-01664-2 PMC11743758 39828747 15 Shi L. Li Y. Li Z. Early cancer detection by SERS spectroscopy and machine learning Light Sci. Appl. 12 2023 234 37714845 10.1038/s41377-023-01271-7 PMC10504315 16 Yi J. You E.M. Liu G.K. Tian Z.Q. AI–nano-driven surface-enhanced Raman spectroscopy for marketable technologies Nat. Nanotechnol. 19 2024 1758 1762 39639177 10.1038/s41565-024-01825-9 17 Ayyappan V. Chang A. Zhang C. Paidi S.K. Bordett R. Liang T. Barman I. Pandey R. Identification and Staging of B-Cell Acute Lymphoblastic Leukemia Using Quantitative Phase Imaging and Machine Learning ACS Sens. 5 2020 3281 3289 33092347 10.1021/acssensors.0c01811 18 Li M. Wu Y. Chi M. Wang Y. Zhu M. Gao S. Recognition of Nucleophosmin Mutant Gene Expression of Leukemia Cells Using Raman Spectroscopy Appl. Spectrosc. 77 2023 689 697 37306050 10.1177/00037028231176547 19 Paidi S.K. Raj P. Bordett R. Zhang C. Karandikar S.H. Pandey R. Barman I. Raman and quantitative phase imaging allow morpho-molecular recognition of malignancy and stages of B-cell acute lymphoblastic leukemia Biosens. Bioelectron. 190 2021 113403 10.1016/j.bios.2021.113403 PMC8492164 34130086 20 Ye M. Chen Y. Wang Y. Xiao L. Lin Q. Lin H. Duan Z. Feng S. Cao Y. Zhang J. Subtype discrimination of acute myeloid leukemia based on plasma SERS technique Spectrochim. Acta Mol. Biomol. Spectrosc. 271 2022 120865 10.1016/j.saa.2022.120865 35063821 21 Han H. Gong J. Tian Y. Analysis of serum from acute leukemia patients using surface-enhanced Raman spectroscopy (SERS) Spectroscopy 37 2022 36 41 22 Oktem F. Akdeniz M. Al-Shaebi Z. Akyol G. Keklik M. Aydin O. SERS and machine learning-enabled liquid biopsy: a promising tool for early detection and recurrence prediction in acute leukemia ACS Omega 10 2025 11887 11899 40191347 10.1021/acsomega.4c08499 PMC11966330 23 Miller A.M. Shah R.H. Pentsova E.I. Pourmaleki M. Briggs S. Distefano N. Zheng Y. Skakodub A. Mehta S.A. Campos C. Tracking tumour evolution in glioma through liquid biopsies of cerebrospinal fluid Nature 565 2019 654 658 30675060 10.1038/s41586-019-0882-3 PMC6457907 24 Bi X. Czajkowsky D.M. Shao Z. Ye J. Digital colloid-enhanced Raman spectroscopy by single-molecule counting Nature 628 2024 771 775 38632399 10.1038/s41586-024-07218-1 25 Chen X. Ding Q. Bi C. Ruan J. Yang S. Lossless enrichment of trace analytes in levitating droplets for multiphase and multiplex detection Nat. Commun. 13 2022 7807 36528683 10.1038/s41467-022-35495-9 PMC9759559 26 Zhang D. You H. Yuan L. Hao R. Li T. Fang J. Hydrophobic Slippery Surface-Based Surface-Enhanced Raman Spectroscopy Platform for Ultrasensitive Detection in Food Safety Applications Anal. Chem. 91 2019 4687 4695 30810031 10.1021/acs.analchem.9b00085 27 Zhou Z.M. Zheng H. Liu T. Xie Z.Z. Luo S.H. Chen G.Y. Tian Z.Q. Liu G.K. Improving SERS Sensitivity toward Trace Sulfonamides: The Key Role of Trade-Off Interfacial Interactions among the Target Molecules, Anions, and Cations on the SERS Active Surface Anal. Chem. 93 2021 8603 8612 34115465 10.1021/acs.analchem.1c01530 28 Pui C.-H. Howard S.C. Current management and challenges of malignant disease in the CNS in paediatric leukaemia Lancet Oncol. 9 2008 257 268 18308251 10.1016/S1470-2045(08)70070-6 29 Shin H. Choi B.H. Shim O. Kim J. Park Y. Cho S.K. Kim H.K. Choi Y. Single test-based diagnosis of multiple cancer types using Exosome-SERS-AI for early stage cancers Nat. Commun. 14 2023 1644 36964142 10.1038/s41467-023-37403-1 PMC10039041 30 Huang L. Sun H. Sun L. Shi K. Chen Y. Ren X. Ge Y. Jiang D. Liu X. Knoll W. Rapid, label-free histopathological diagnosis of liver cancer based on Raman spectroscopy and deep learning Nat. Commun. 14 2023 48 36599851 10.1038/s41467-022-35696-2 PMC9813224 31 Xie Y. Su X. Wen Y. Zheng C. Li M. Artificial Intelligent Label-Free SERS Profiling of Serum Exosomes for Breast Cancer Diagnosis and Postoperative Assessment Nano Lett. 22 2022 7910 7918 36149810 10.1021/acs.nanolett.2c02928 32 Shin H. Oh S. Hong S. Kang M. Kang D. Ji Y.G. Choi B.H. Kang K.W. Jeong H. Park Y. Early-Stage Lung Cancer Diagnosis by Deep Learning-Based Spectroscopic Analysis of Circulating Exosomes ACS Nano 14 2020 5435 5444 32286793 10.1021/acsnano.9b09119 33 Qi Y. Zhang G. Yang L. Liu B. Zeng H. Xue Q. Liu D. Zheng Q. Liu Y. High-Precision Intelligent Cancer Diagnosis Method: 2D Raman Figures Combined with Deep Learning Anal. Chem. 94 2022 6491 6501 35271250 10.1021/acs.analchem.1c05098 34 Zhang D. Peng L. Shang X. Zheng W. You H. Xu T. Ma B. Ren B. Fang J. Buoyant particulate strategy for few-to-single particle-based plasmonic enhanced nanosensors Nat. Commun. 11 2020 2603 32451374 10.1038/s41467-020-16329-y PMC7248072 Supplemental information  Document S1. Figures S1–S25 and Tables S1–S6 Document S2. Article plus supplemental information Supplemental information can be found online at https://doi.org/10.1016/j.xcrm.2025.102320 ",
  "metadata": {
    "Title of this paper": "Buoyant particulate strategy for few-to-single particle-based plasmonic enhanced nanosensors",
    "Journal it was published in:": "Cell Reports Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490261/"
  }
}