{
  "title": "Paper_655",
  "abstract": "Indian J Clin Biochem Indian J Clin Biochem 1356 ijclbio Indian Journal of Clinical Biochemistry 0970-1915 0974-0422 Springer PMC11436522 PMC11436522.1 11436522 11436522 39346710 10.1007/s12291-023-01146-z 1146 1 Original Research Article TRAIL C1595T Variant Critically Alters the Level of sTRAIL in Terms of Histopathological Parameters in Colorectal Cancer http://orcid.org/0000-0001-8998-2028 Horozoglu Cem 1 7 http://orcid.org/0000-0001-5313-0579 Yildiz Asli 2 http://orcid.org/0000-0002-4962-5330 Sonmez Dilara 3 http://orcid.org/0000-0003-1211-0736 Demirkol Seyda 4 http://orcid.org/0000-0002-1741-0503 Yildiz Yemliha 5 http://orcid.org/0000-0001-7132-6161 Arikan Soykan 6 http://orcid.org/0000-0003-2615-0202 Yaylim Ilhan ilhanyaylim@gmail.com 3 1 https://ror.org/022xhck05 grid.444292.d 0000 0000 8961 9352 Faculty of Medicine, Halic University, 2 https://ror.org/01nkhmn89 grid.488405.5 0000 0004 4673 0690 Faculty of Medicine, Biruni University, 3 https://ror.org/03a5qrr21 grid.9601.e 0000 0001 2166 6619 Department of Molecular Medicine, Aziz Sancar Institute of Experimental Medicine, Istanbul University, 4 https://ror.org/01nkhmn89 grid.488405.5 0000 0004 4673 0690 Department of Molecular Biology and Genetics, Faculty of Engineering Natural Science, Biruni University, 5 https://ror.org/03081nz23 grid.508740.e 0000 0004 5936 1556 Department of Medical Biology, Faculty of Medicine, Istinye University, 6 https://ror.org/05grcz969 0000 0005 0683 0715 Department of General Surgery, Basaksehir Cam and Sakura City Hospital, 7 https://ror.org/01nkhmn89 grid.488405.5 0000 0004 4673 0690 Department of Medical Biochemistry, Faculty of Medicine, Biruni University, 9 8 2023 10 2024 39 4 471673 593 599 30 5 2023 21 7 2023 01 10 2025 01 10 2025 29 09 2024 01 10 2025 © The Author(s), under exclusive licence to Association of Clinical Biochemists of India 2023. Springer Nature or its licensor (e.g. a society or other partner) holds exclusive rights to this article under a publishing agreement with the author(s) or other rightsholder(s); author self-archiving of the accepted manuscript version of this article is solely governed by the terms of such publishing agreement and applicable law. 2023 TRAIL, a member of the TNF family, is expressed in tumor and tumor surrounding tissue in many solid organ cancers. While the induction of tumor-specific apoptosis in correlation with cytokine stimulation may cause anti-tumoral effects, the pro-tumorigenic effects of its expression by tumor surrounding tissue members have been reported in the literature. In our study, it was aimed to evaluate the effect of the gene variant of TRAIL on soluble levels in patients with colorectal cancer (CRC) on the molecular pathological axis. TRAIL C1595 gene variant PCR–RFLP and sTRAIL levels were determined by ELISA in age and sex adjusted CRC and control groups. It was determined that CT carriage was high in patients without perineural invasion and sTRAIL levels were approximately 2.72 times lower than CC in patients with CT in this group ( p p Keywords Colorectal cancer TRAIL C1595T sTRAIL http://dx.doi.org/10.13039/501100004006 Bilimsel Araştirma Projeleri Birimi, Istanbul Üniversitesi TYO-2019-33675 Yaylim Ilhan pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Association of Clinical Biochemists of India 2024 ",
  "metadata": {
    "Title of this paper": "TRAIL C1595T Variant Critically Alters the Level of sTRAIL in Terms of Histopathological Parameters in Colorectal Cancer",
    "Journal it was published in:": "Indian Journal of Clinical Biochemistry",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11436522/"
  }
}