{
  "title": "Paper_343",
  "abstract": "pmc Cancer Immunol Res Cancer Immunol Res 4147 aacrsd Cancer Immunology Research 2326-6066 2326-6074 pmc-is-collection-domain yes pmc-collection-title AACR Open Access PMC12485383 PMC12485383.1 12485383 12485383 40758122 10.1158/2326-6066.CIR-24-0927 CIR-24-0927 1 Version of Record Immunology Dendritic Cells Tumor Immunology Animal Models Immunotherapy Cancer Vaccines Immunotherapy Metabolism Preclinical Models Animal Models of Cancer Research Articles High Levels of Endogenous Omega-3 Fatty Acids Promote Dendritic Cell Antigen Presentation and Improve Dendritic Cell–Based Cancer Vaccine Efficacy in Mice N-3 Fatty Acids Improve DC-Based Cancer Vaccine Efficacy https://orcid.org/0000-0002-2635-2560 Tiwary Shweta 1 * https://orcid.org/0009-0002-8365-0748 Hsu Kevin S. 1 https://orcid.org/0000-0001-8774-7454 Goldfarbmuren Katherine C. 1 2 https://orcid.org/0009-0000-9664-8546 Xia Zheng 1 https://orcid.org/0000-0002-0342-3194 Berzofsky Jay A. 1  1  2 * Corresponding Author: shweta.tiwary@nih.gov Cancer Immunol Res 2025;13:1609–22 01 10 2025 04 8 2025 13 10 498054 1609 1622 20 9 2024 31 1 2025 31 7 2025 01 10 2025 02 10 2025 03 10 2025 ©2025 The Authors; Published by the American Association for Cancer Research 2025 American Association for Cancer Research https://creativecommons.org/licenses/by-nc-nd/4.0/ This open access article is distributed under the Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International (CC BY-NC-ND 4.0) license. DCs from patients with cancer show compromised antigen presentation ability. The authors show that differentiation of DCs in the presence of omega-3 fatty acids enhances their antigen presentation ability and their efficacy as cancer vaccines in mice. Abstract Antigen presentation by dendritic cells (DC) is crucial in activating T cells. DCs capture, process, and present antigens to T cells, making them attractive vaccine vehicles. However, most DC cancer vaccines have had limited clinical efficacy, suggesting a need to increase their potency. We report that high levels of omega-3 fatty acids in mice significantly prolonged lifespan and reduced tumor growth and body weight loss. This effect was mediated in part by more effective DC antigen presentation. DCs derived from Tg(CAG - fat- 1 + in vitro in vivo in vitro Division of Cancer Prevention, National Cancer Institute (DCP, NCI) http://dx.doi.org/10.13039/100007316 Tiwary S. Hsu K. Goldfarbmuren K.C. Xia Z. Berzofsky J.A. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Besides genetic and epigenetic changes, metabolic reprogramming is crucial to tumor initiation and progression ( 1 2 de novo 3 4 5 6 7 Tumor-specific immune suppressive factors remain the main challenge for the optimal functioning of antitumor immunity ( 8 9 10 11 12 13 14 15 To address this question, we utilized a mouse model with expression of the Caenorhabditis elegans - fat- 1 16 17 In vitro + We found that the T-cell dwell time was significantly higher for cells associating with antigen-pulsed FAT-1 BMDCs than with WT BMDCs. WT BMDCs generated in the presence of omega-3 FAs and specialized proresolving lipid mediators (SPM) mimicked the antigen presentation ability of FAT-1 BMDCs in vitro Materials and Methods Reagents The reagents used are as follows: RPMI 1640 (Gibco, 11875-093), FBS (Gibco, A52095-02), glutamine, penicillin/streptomycin (Gibco, 15140-122), beta-mercaptoethanol (Gibco, 21985-023), D-PBS (Gibco, 14190-144), duo ELISA kit IFNγ (R&D Systems, DY485), mouse CD8a T-cell enrichment kit (Miltenyi, 130-104-075), CMFDA cell tracker green dye (Invitrogen, C7025), CMPTX cell tracker red dye (Invitrogen, C34552 Cell lines B16F10 melanoma murine cancer cell line (ATCC, CRL-6475, 2019) was grown in complete RPMI 1640 (cRPMI), comprising RPMI 1640 supplemented with 10% FBS, 100 IU/mL penicillin, 100 μg/mL streptomycin, and 2 mmol/L L-glutamine at 37°C in humidified air with 5% CO 2 2 Mice and vaccination experimental design C57BL/6-Tg(CAG- fat- 1 C. elegans https://www.jax.org/strain/020097 Female mice 10 to 12 weeks old were used for all tumor experiments. For the B16F10 melanoma tumor model, 10 5 5 BMDC generation BM cells were isolated from the femurs of 10- to 12-week-old female FAT-1 or WT mice as previously described ( 18 6 Antigen presentation assay and IFNγ ELISA A total of 20,000 immature BMDCs, either from FAT-1 or WT mice, were plated in 200 μL of cRPMI media in a flat-bottom, 96-well plate. The cells were matured and pulsed with 10 ng/mL LPS and 5 μg/mL hgp100 peptide overnight. The next day, the mature BMDCs were washed with PBS and cocultured with 2 × 10 5 + + 2 DHA ELISA Serum from three FAT-1 and WT animals was obtained, and DHA levels were measured using the BIOMATIK DHA ELISA kit ( EKU08761  Ex vivo Tumor-bearing WT animals vaccinated with either E7-pulsed FAT-1 BMDCs or WT BMDCs were bled (mandibular bleed) 2 to 3 days after the second vaccine dose, and the blood was collected in EDTA tubes. The tubes were centrifuged at 1,500 rpm for 10 minutes, and plasma was collected and frozen at −80°C until further use. Whole blood was plated in U-bottom, 96-well plates and restimulated with E7 peptide (5 μg/mL) overnight and for 48 hours. The cells were washed 3× with PBS, followed by surface staining for immune markers and flow cytometry analysis to detect vaccine specificity and efficacy (see “Flow cytometry”). Cytokine array Plasma was pooled from six independent biological replicates from either WT or FAT-1 tumor-naïve animals, and supernatants from BMDC culture were used to probe the array membrane from the R&D Proteome Profiler Cytokine Array Kit (ARY006). The manufacturer’s protocol was followed, and images were captured using a Bio-Rad imager. The array image was analyzed and quantitated using ImageJ software. T-cell dwell time The antigen presentation assay was set up as described in the “Antigen presentation assay and IFNγ ELISA” section of the “Materials and Methods” section of this article. The DC/T-cell ratio was kept at 1:2, and cells were plated in an eight-chamber glass slide from Ibidi (80841). Live imaging of the coculture was carried out using a Nikon spinning disk confocal microscope overnight. The images were taken 5 minutes apart. Individual T cells were tracked, and the time spent in contact with one or more DCs was calculated per frame per T cell in contact with DCs. Track length generated by individual T cells was calculated using the Imaris software. Flow cytometry Fluorescent protein-labeled antibodies against CD4, CD8, TCRβ, CD45, IFNγ, CD11c, CD11b, MHC class II, CD80, CD86, and CD40 were used (Supplementary Table S1). HPV16 E7 49–57 b L23105 RNA-seq Total RNA from BM cells, immature BMDCs, and mature BMDCs was harvested using an RNA Miniprep Kit from Zymo Research ( R1054 https://github.com/CCBR/RENEE P Data availability The expression profile data generated in this study are publicly available in processed form at https://github.com/NCI-VB/berzofsky_tiwary_FAT1_DCbulk GSE288336 Results High levels of omega-3 FAs extend lifespan and protect against tumor growth in mice To demonstrate the direct impact of elevated omega-3 levels on lifespan extension and cancer protection, we utilized mice with transgene expression of a FAT-1 desaturase gene from Caenorhabditis elegans Fig. 1A 16 17 Fig. 1B Fig. 1C Fig. 1C in vivo Fig. 1D F Fig. 1E Fig. 1G Figure 1. FAT-1 transgenic mice show improved overall survival, lower body mass, and protection against tumor growth compared with WT mice. A, B, C, P D, P E, P F, P G, P H, P I, in vitro J, K, + P L, Statistical analysis: In addition to the improved overall survival of tumor-bearing animals in the FAT-1 group compared with the WT group, we also observed a significant delay in the onset of palpable tumors in the B16F10 melanoma tumor model ( Fig. 1H FAT-1–derived BMDCs are efficient antigen-presenting cells in vitro Although there may be a direct effect of high levels of omega-3 FA on tumor cells in FAT-1 mice ( 19 21 + 22 + 23 24 + Fig. 1J We isolated BM cells from the femurs of FAT-1 and WT mice and generated BMDCs from them to investigate their antigen presentation ability. BMDCs are a good model of the autologous monocyte-derived DCs used in human DC vaccine clinical trials. Mature antigen-pulsed BMDCs were cocultured with CD8 + 25 26 + + Fig. 1K Fig. 1L Our data indicate a greater ability of FAT-1 BMDCs, independent of the DC activation surface molecules, to induce an antigen-specific response by CD8 + FAT-1–derived DC vaccine significantly reduces tumor burden in murine models To evaluate the efficacy of a FAT-1–derived DC vaccine, we vaccinated TC-1 tumor-bearing WT animals with either E7 antigen-pulsed FAT-1 DCs or E7 antigen-pulsed WT DCs, as shown in Fig. 2A Fig. 2B Fig. 2C D Fig. 2E–G 3 Fig. 2H Fig. 2D Fig. 2I Figure 2. FAT-1–derived BMDCs significantly reduce tumor burden in WT TC-1 lung cancer tumor–bearing mice. A, B, C, D, E–G, E F G H, I, P P P We observed similar results in the B16F10 melanoma model. The vaccination timeline was identical to that in the TC-1 lung cancer model; however, in the B16F10 melanoma model, we started the vaccination 5 days after the cells were inoculated due to the aggressive nature of this tumor model ( Fig. 3A Fig. 3C D Fig. 3B 3 Fig. 3G Fig. 3F Fig. 3E Figure 3. FAT-1–derived BMDCs significantly reduce tumor burden in WT B16F10 melanoma tumor–bearing mice. A, B, C, D, E–G, H, 3 3 P P FAT-1–derived DC vaccines induce a better vaccine-specific response ex vivo Our data suggested that the maximum therapeutic benefit of the vaccine was achieved between the second and third doses. Therefore, we decided to test the vaccine-specific T-cell response from different groups at the midpoint of the second and third vaccine doses ( Fig. 4A ex vivo ex vivo + + Fig. 4B + + Fig. 4C + + Fig. 4E + 24 + + + Fig. 4F + + Fig. 4D + + Fig. 4G + + + + + + + Fig. 1H in vivo ex vivo Figure 4. FAT-1–derived BMDCs induce a higher vaccine-specific response ex vivo A, ex vivo B C, + B + + C D, + E–G, + E + + F + + G P P P Bulk RNA-seq analysis reveals DEGs in FAT-1 and WT BM and immature and mature BMDCs As we could not detect any differences in the activation and maturation molecular markers between the FAT-1 and WT mature BMDCs, we performed bulk RNA-seq to evaluate their transcriptomic profiles. We also included BM and immature BMDCs to assess the temporal changes as the cells differentiate from stem cells (BM) to terminally differentiated DCs. Figure 5A Fig. 5B Fig. 5B Fig. 5C Fig. 5D Fig. 6 Fig. 6A Fig. 6A Fig. 6B Fig. 6B Fig. 6C Fig. 6D Fig. 6E Fig. 6E Fig. 6F Figure 5.  A, B, C, D, P P P P Figure 6.  A, B, A D– F P P C, P P D–F, P P P D, E, F, RNA-seq identifies candidate genes in BMDCs that can influence immune cell recruitment and T-cell dwell time  CXLC2 S1PR1 Fig. 6B S1PR1 27 CXCL2 28 28 CCL2 CCL7 Fig. 6B PF4 CXCL4 Fig. 6B Fig. 7A Fig. 7B C NBEA, DACH1, WWC2 Fig. 6B Figure 7. FAT-1 BMDCs have higher T-cell dwell time, and supplementation of omega-3 in WT BMDCs mimics FAT-1–like antigen presentation ability in vitro A, B, C, D, E, F, P G, H–K, + P P We hypothesized that with the expression of the genes with potential for regulating migration, synapse formation, and chemokines/cytokines that may serve as attractants for immune cells, it was likely that T cells were spending more time in contact with FAT-1 DCs and, hence, that there would be an increase in T-cell dwell time. To test that hypothesis, we performed live imaging of the coculture of PMEL-1 CD8 + + + Fig. 7D Fig. 7E Fig. 7F Omega-3 FA and SPMs mimic the FAT-1 phenotype in vitro As we observed a significant increase in antigen presentation in coculture experiments with FAT-1 BMDCs and antigen-specific CD8 + Fig. 7G + + Fig. 7H I K Fig. 7J Discussion In this study, we show that a high level of omega-3 FA can improve the antigen presentation ability of BMDCs, thereby enhancing the therapeutic efficacy of DC-based cancer vaccines in murine tumor models. In addition to slower tumor growth, we show an increased ex vivo + Most studies have utilized omega-3 dietary supplementation to investigate its effects on physiology and diseases in rodents and humans ( 29 32 C. elegans 33 34 We found that FAT-1 mice exhibited lower body mass throughout their lifespan and significantly prolonged overall survival compared with WT mice. These findings demonstrate a direct effect of high omega-3 FAs on age-related weight gain and lifespan extension. In line with our observation, recent studies have reported a positive correlation between high omega-3 FAs and decreased mortality risk in humans ( 6 7 We observed that FAT-1 mice demonstrated a decrease in tumor growth rate in various tumor models, including TC-1 lung cancer and B16F10 melanoma, consistent with previous studies ( 19 20 35 de novo 36 39 5 Although we observed no differences in the frequencies of major immune cell subtypes at the basal level, we saw a significant increase in the antigen presentation ability of BMDCs from FAT-1 mice in vitro 40 43 44 45 We have discovered that antigen-pulsed BMDCs from FAT-1 mice can significantly reduce tumor growth and body weight loss and increase overall survival in tumor-bearing WT mice. In addition, we have observed an enhanced vaccine-specific response in both tumor-bearing and tumor-naïve WT mice when vaccinated with antigen-pulsed BMDCs derived from FAT-1 mice. We also observed increased PD-1 + + 46 + + + In this study, we also report the transcriptomic profile of BM cells and immature and mature BMDCs from FAT-1 and WT mice. The bulk RNA-seq from these cell types revealed DEGs that are explicitly upregulated in FAT-1 BM cells and immature and mature BMDCs. Several chemokines and cytokines, such as CXCL2, CCL2, CCL7, CXCL7 Ppbp PF4/CXCL4 47 In addition to these known modulators of immune cells, we also found some upregulated genes in which relevance in DCs is either unknown or poorly understood. HIC1, WWC2, DACH1 CENPF 48 47 49 WWC2 is a protein that acts as a scaffold, regulates the Hippo pathway, and has crucial roles during embryonic development ( 50 51 52 53 Our RNA-seq results have identified factors that can affect the immune synapse between DCs and T cells. To investigate further, we compared the interaction time between FAT-1 and WT BMDCs with T cells. Our data revealed that T cells spent significantly longer (>10-fold) with FAT-1 BMDCs than with WT BMDCs, and the longer dwell time was associated with better T-cell priming and immune response ( 54 One limitation of our study is that most of our data were obtained from a genetic mouse model. However, we observed a similar trend in BMDCs generated in the presence of DHA, at least in vitro In summary, our study demonstrates that high levels of omega-3 have a direct effect on antigen presentation, leading to improved efficacy of cancer vaccines. We propose that this enhanced T-cell response is due to the prolonged interaction between T cells and DCs, increasing T-cell dwell time. Furthermore, this study identifies several molecules with potential roles in enhancing DC function and improving the therapeutic efficacy of DC-based cancer vaccines. Supplementary Material Figure S1 Figure S1: DHA levels in FAT-1 Vs WT mouse serum. Serum was isolated from naïve FAT-1 (N = 3) and WT (N = 3) mice and DHA was measured by ELISA. Figure S2 Fig S2. Tumor growth kinetics of TC-1 and B16F10 syngeneic models in mice from different sources. Figure S3 Figure S3: Naïve WT mice vaccinated with E7-Pulsed FAT-1 DCs show a significantly high IFNg+ CD8 T cells compared to WT-DC and vehicle control. *p < 0.05 Figure S4 Figure S4: A. Tumor growth kinetics for WT tumor bearing mice vaccinated with WT-DCs (red curve) and FAT-1 tumor bearing mice vaccinated with FAT-1 DCs (purple curve). B. Kaplan Meier survival graph for the same. Figure S5 Fig S5: FACS plot for PDL1 single positive and PDL-1 and PDL-2 double positive cells in FAT-1-DC/hgp100 vaccine group. Figure S6 Fig S6: Vaccinated tumor bearing animals have a higher percentage of B220-CD3+PDL-1+ and B220-CD3+PDL-1/PDL-2+ T-cells compared to the vehicle control. Additionally, the frequency CD8+ PDL-1/PDL-2+ T-cells is significantly higher in FAT-1 vaccinated animals. Figure S7 Figure S7: Antigen presentation assay to test the ability of DCs generated from WT mice in varying doses of DHA in presenting antigen to CD8 T cells. Figure S8 Figure S8: Antigen presentation assay to test the ability of DCs generated from WT mice in varying doses of SPMs in presenting antigen to CD8 T cells. Figure S9 Figure S9: A. Fold change in BMDC numbers when derived from WT bone marrow in presence of DHA compared to those in presence of vehicle (ethanol). B. Antigen presentation of DCs isolated from old and young mice in presence of DHA or vehicle control. Supplementary Video 1 Video Supplementary Table 1 Antibody information Acknowledgments The study was part of intramural research funded by the Center for Cancer Research, NCI, NIH.  Note: http://cancerimmunolres.aacrjournals.org/ Authors’ Disclosures S. Tiwary reports a patent for PCT/US2024/049057 pending. J.A. Berzofsky reports a patent for PCT/US20224/049057 pending. No disclosures were reported by the other authors. Authors’ Contributions  S. Tiwary: K.S. Hsu: K.C. Goldfarbmuren: Z. Xia: J.A. Berzofsky: References 1. Martínez-Reyes I Chandel NS Cancer metabolism: looking forward Nat Rev Cancer 2021 21 669 80 34272515 10.1038/s41568-021-00378-6 2. Bergers G Fendt S-M The metabolism of cancer cells during metastasis Nat Rev Cancer 2021 21 162 80 33462499 10.1038/s41568-020-00320-2 PMC8733955 3. Koundouros N Poulogiannis G Reprogramming of fatty acid metabolism in cancer Br J Cancer 2020 122 4 22 31819192 10.1038/s41416-019-0650-z PMC6964678 4. Broadfield LA Pane AA Talebi A Swinnen JV Fendt S-M Lipid metabolism in cancer: new perspectives and emerging mechanisms Dev Cell 2021 56 1363 93 33945792 10.1016/j.devcel.2021.04.013 5. Tiwary S Morales JE Kwiatkowski SC Lang FF Rao G McCarty JH Metastatic brain tumors disrupt the blood-brain barrier and alter lipid metabolism by inhibiting expression of the endothelial cell fatty acid transporter Mfsd2a Sci Rep 2018 8 8267 29844613 10.1038/s41598-018-26636-6 PMC5974340 6. McBurney MI Tintle NL Vasan RS Sala-Vila A Harris WS Using an erythrocyte fatty acid fingerprint to predict risk of all-cause mortality: the framingham offspring cohort Am J Clin Nutr 2021 114 1447 54 34134132 10.1093/ajcn/nqab195 PMC8488873 7. Harris WS Tintle NL Imamura F Qian F Korat AVA Marklund M Blood n-3 fatty acid levels and total and cause-specific mortality from 17 prospective studies Nat Commun 2021 12 2329 33888689 10.1038/s41467-021-22370-2 PMC8062567 8. Leone RD Zhao L Englert JM Sun I-M Oh M-H Sun I-H Glutamine blockade induces divergent metabolic programs to overcome tumor immune evasion Science 2019 366 1013 21 31699883 10.1126/science.aav2588 PMC7023461 9. Leone RD Powell JD Metabolism of immune cells in cancer Nat Rev Cancer 2020 20 516 31 32632251 10.1038/s41568-020-0273-y PMC8041116 10. Veglia F Tyurin VA Mohammadyani D Blasi M Duperret EK Donthireddy L Lipid bodies containing oxidatively truncated lipids block antigen cross-presentation by dendritic cells in cancer Nat Commun 2017 8 2122 29242535 10.1038/s41467-017-02186-9 PMC5730553 11. Ma X Bi E Lu Y Su P Huang C Liu L Cholesterol induces CD8 + Cell Metab 2019 30 143 56.e5 31031094 10.1016/j.cmet.2019.04.002 PMC7061417 12. Bayerl F Meiser P Donakonda S Hirschberger A Lacher SB Pedde AM Tumor-derived prostaglandin E2 programs cDC1 dysfunction to impair intratumoral orchestration of anti-cancer T cell responses Immunity 2023 56 1341 58.e11 37315536 10.1016/j.immuni.2023.05.011 13. Perez CR De Palma M Engineering dendritic cell vaccines to improve cancer immunotherapy Nat Commun 2019 10 5408 31776331 10.1038/s41467-019-13368-y PMC6881351 14. Laureano RS Sprooten J Vanmeerbeerk I Borras DM Govaerts J Naulaerts S Trial watch: dendritic cell (DC)-based immunotherapy for cancer Oncoimmunology 2022 11 2096363 35800158 10.1080/2162402X.2022.2096363 PMC9255073 15. Zhang S Lv K Liu Z Zhao R Li F Fatty acid metabolism of immune cells: a new target of tumour immunotherapy Cell Death Discov 2024 10 39 38245525 10.1038/s41420-024-01807-9 PMC10799907 16. Kang JX Fat-1 transgenic mice: a new model for omega-3 research Prostaglandins Leukot Essent Fatty Acids 2007 77 263 7 18042365 10.1016/j.plefa.2007.10.010 PMC2211362 17. Kang JX Wang J Wu L Kang ZB Transgenic mice: fat-1 mice convert n-6 to n-3 fatty acids Nature 2004 427 504 14765186 10.1038/427504a 18. Madaan A Verma R T Singh A Jain SK Jaggi M A stepwise procedure for isolation of murine bone marrow and generation of dendritic cells J Biol Methods 2014 1 1 19. Xia S Lu Y Wang J He C Hong S Serhan CN Melanoma growth is reduced in fat-1 transgenic mice: impact of omega-6/omega-3 essential fatty acids Proc Natl Acad Sci U S A 2006 103 12499 504 16888035 10.1073/pnas.0605394103 PMC1567907 20. Taguchi A Kawana K Tomio K Yamashita A Isobe Y Nagasaka K Matrix metalloproteinase (MMP)-9 in cancer-associated fibroblasts (CAFs) is suppressed by omega-3 polyunsaturated fatty acids in vitro and in vivo PLoS One 2014 9 e89605 24586907 10.1371/journal.pone.0089605 PMC3937340 21. Dierge E Debock E Guilbaud C Corbet C Mignolet E Mignard L Peroxidation of n-3 and n-6 polyunsaturated fatty acids in the acidic tumor environment leads to ferroptosis-mediated anticancer effects Cell Metab 2021 33 1701 15.e5 34118189 10.1016/j.cmet.2021.05.016 22. MacNabb BW Chen X Tumuluru S Godfrey J Kasal DN Yu J Dendritic cells can prime anti-tumor CD8 + Immunity 2022 55 982 97.e8 35617964 10.1016/j.immuni.2022.04.016 PMC9883788 23. Terabe M Robertson FC Clark K De Ravin E Bloom A Venzon D Blockade of only TGF-β 1 and 2 is sufficient to enhance the efficacy of vaccine and PD-1 checkpoint blockade immunotherapy Oncoimmunology 2017 6 e1308616 28638730 10.1080/2162402X.2017.1308616 PMC5467996 24. Becker W Olkhanud PB Seishima N Moreno PA Goldfarbmuren KC Maeng HM Second-generation checkpoint inhibitors and Treg depletion synergize with a mouse cancer vaccine in accordance with tumor microenvironment characterization J Immunother Cancer 2024 12 e008970 38955422 10.1136/jitc-2024-008970 PMC11218019 25. Ji Y Abrams N Zhu W Salinas E Yu Z Palmer DC Identification of the genomic insertion site of Pmel-1 TCR α and β transgenes by next-generation sequencing PLoS One 2014 9 e96650 24827921 10.1371/journal.pone.0096650 PMC4020793 26. Overwijk WW Theoret MR Finkelstein SE Surman DR de Jong LA Vyth-Dreese FA Tumor regression and autoimmunity after reversal of a functionally tolerant state of self-reactive CD8 + J Exp Med 2003 198 569 80 12925674 10.1084/jem.20030590 PMC2194177 27. Czeloth N Bernhardt G Hofmann F Genth H Förster R Sphingosine-1-phosphate mediates migration of mature dendritic cells J Immunol 2005 175 2960 7 16116182 10.4049/jimmunol.175.5.2960 28. Pan YC Nishikawa T Chang CY Tai JA Kaneda Y CXCL2 combined with HVJ-E suppresses tumor growth and lung metastasis in breast cancer and enhances anti-PD-1 antibody therapy Mol Ther Oncolytics 2021 20 175 86 33575480 10.1016/j.omto.2020.12.011 PMC7851488 29. Natto ZS Yaghmoor W Alshaeri HK Van Dyke TE Omega-3 fatty acids effects on inflammatory biomarkers and lipid profiles among diabetic and cardiovascular disease patients: a systematic review and meta-analysis Sci Rep 2019 9 18867 31827125 10.1038/s41598-019-54535-x PMC6906408 30. Freitas RDS Campos MM Protective effects of omega-3 fatty acids in cancer-related complications Nutrients 2019 11 945 31035457 10.3390/nu11050945 PMC6566772 31. West L Yin Y Pierce SR Fang Z Fan Y Sun W Docosahexaenoic acid (DHA), an omega-3 fatty acid, inhibits tumor growth and metastatic potential of ovarian cancer Am J Cancer Res 2020 10 4450 63 33415010 PMC7783742 32. Pellegrini M D’Eusebio C Ponzo V Tonella L Finocchiaro C Fierro MT Nutritional interventions for patients with melanoma: from prevention to therapy-an update Nutrients 2021 13 4018 34836273 10.3390/nu13114018 PMC8624488 33. Zhang Y Sun Y Yu Q Song S Brenna JT Shen Y Higher ratio of plasma omega-6/omega-3 fatty acids is associated with greater risk of all-cause, cancer, and cardiovascular mortality: a population-based cohort study in UK Biobank Elife 2024 12 RP90132 38578269 10.7554/eLife.90132 PMC10997328 34. Chaves H Singh RB Khan S Wilczynska A Takahashi T Chapter 14 - High omega-6/omega-3 fatty acid ratio diets and risk of noncommunicable diseases: Is the tissue, the main issue? New York (NY) Academic Press 2019 35. Yin X Yu X-W Zhu P Zhang Y-M Zhang X-H Wang F Endogenously synthesized n-3 fatty acids in fat-1 transgenic mice prevent melanoma progression by increasing E-cadherin expression and inhibiting beta-catenin signaling Mol Med Rep 2016 14 3476 84 27573698 10.3892/mmr.2016.5639 36. Zhou W Han WF Landree LE Thupari JN Pinn ML Bililign T Fatty acid synthase inhibition activates AMP-activated protein kinase in SKOV3 human ovarian cancer cells Cancer Res 2007 67 2964 71 17409402 10.1158/0008-5472.CAN-06-3439 37. Li Q Yao H Wang Y Wu Y Thorne RF Zhu Y circPRKAA1 activates a Ku80/Ku70/SREBP-1 axis driving de novo fatty acid synthesis in cancer cells Cell Rep 2022 41 111707 36417875 10.1016/j.celrep.2022.111707 38. Li S Lu C-W Diem EC Li W Guderian M Lindenberg M Acetyl-CoA-Carboxylase 1-mediated de novo fatty acid synthesis sustains Lgr5 + Nat Commun 2022 13 3998 35810180 10.1038/s41467-022-31725-2 PMC9271096 39. Vogel FCE Schulze A Fatty acid synthesis enables brain metastasis Nat Cancer 2021 2 374 6 35122002 10.1038/s43018-021-00202-y 40. Wang H Hao Q Li Q-R Yan X-W Ye S Li Y-S Omega-3 polyunsaturated fatty acids affect lipopolysaccharide-induced maturation of dendritic cells through mitogen-activated protein kinases p38 Nutrition 2007 23 474 82 17499970 10.1016/j.nut.2007.04.002 41. Kong W Yen J-H Vassiliou E Adhikary S Toscano MG Ganea D Docosahexaenoic acid prevents dendritic cell maturation and in vitro and in vivo expression of the IL-12 cytokine family Lipids Health Dis 2010 9 12 20122166 10.1186/1476-511X-9-12 PMC2827414 42. Zeyda M Säemann MD Stuhlmeier KM Mascher DG Nowotny PN Zlabinger GJ Polyunsaturated fatty acids block dendritic cell activation and function independently of NF-kappaB activation J Biol Chem 2005 280 14293 301 15684433 10.1074/jbc.M410000200 43. Gutiérrez S Svahn SL Johansson ME Effects of omega-3 fatty acids on immune cells Int J Mol Sci 2019 20 5028 31614433 10.3390/ijms20205028 PMC6834330 44. Kitajka K Sinclair AJ Weisinger RS Weisinger HS Mathai M Jayasooriya AP Effects of dietary omega-3 polyunsaturated fatty acids on brain gene expression Proc Natl Acad Sci U S A 2004 101 10931 6 15263092 10.1073/pnas.0402342101 PMC503722 45. Rosa Velazquez M Batistel F Pinos Rodriguez JM Relling AE Effects of maternal dietary omega-3 polyunsaturated fatty acids and methionine during late gestation on fetal growth, DNA methylation, and mRNA relative expression of genes associated with the inflammatory response, lipid metabolism and DNA methylation in placenta and offspring’s liver in sheep J Anim Sci Biotechnol 2020 11 111 33292515 10.1186/s40104-020-00513-7 PMC7672917 46. Sharpe AH Pauken KE The diverse functions of the PD1 inhibitory pathway Nat Rev Immunol 2018 18 153 67 28990585 10.1038/nri.2017.108 47. Schroer AB Ventura PB Sucharov J Misra R Chui MKK Bieri G Platelet factors attenuate inflammation and rescue cognition in ageing Nature 2023 620 1071 9 37587343 10.1038/s41586-023-06436-3 PMC10468395 48. Burrows K Antignano F Bramhall M Chenery A Scheer S Korinek V The transcriptional repressor HIC1 regulates intestinal immune homeostasis Mucosal Immunol 2017 10 1518 28 28327618 10.1038/mi.2017.17 49. Cao H Li M-Y Li G Li S-J Wen B Lu Y Retinoid X receptor α regulates DHA-dependent spinogenesis and functional synapse formation in vivo Cell Rep 2020 31 107649 32433958 10.1016/j.celrep.2020.107649 50. Hermann A Wu G Nedvetsky PI Brücher VC Egbring C Bonse J The Hippo pathway component Wwc2 is a key regulator of embryonic development and angiogenesis in mice Cell Death Dis 2021 12 117 33483469 10.1038/s41419-021-03409-0 PMC7822818 51. Cao R Zhu R Sha Z Qi S Zhong Z Zheng F WWC1/2 regulate spinogenesis and cognition in mice by stabilizing AMOT Cell Death Dis 2023 14 491 37528078 10.1038/s41419-023-06020-7 PMC10394084 52. Castiglioni V Faedo A Onorati M Bocchi VD Li Z Iennaco R Dynamic and cell-specific DACH1 expression in human neocortical and striatal development Cereb Cortex 2019 29 2115 24 29688344 10.1093/cercor/bhy092 PMC6458905 53. Endlich N Kliewe F Kindt F Schmidt K Kotb AM Artelt N The transcription factor Dach1 is essential for podocyte function J Cell Mol Med 2018 22 2656 69 29498212 10.1111/jcmm.13544 PMC5908116 54. Mempel TR Henrickson SE Von Andrian UH T-cell priming by dendritic cells in lymph nodes occurs in three distinct phases Nature 2004 427 154 9 14712275 10.1038/nature02238 ",
  "metadata": {
    "Title of this paper": "T-cell priming by dendritic cells in lymph nodes occurs in three distinct phases",
    "Journal it was published in:": "Cancer Immunology Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485383/"
  }
}