{
  "title": "Paper_175",
  "abstract": "pmc Cancer Med Cancer Med 1974 canmed CAM4 Cancer Medicine 2045-7634 Wiley PMC12489462 PMC12489462.1 12489462 12489462 41036596 10.1002/cam4.71232 CAM471232 CAM4-2025-05-2777.R1 1 Research Article Research Article The Associations Between the TyG Li Hongyu  1  2 Chen Zijie  1  2 Jiang Guoheng  1  2 Yu Wenqian  1  2 Luo Jing  1  2 Li Shiyi  1  2 Xie Linjun  1  2 Bai Xuan  1  2 Xu Yiting  1  2 Jiang Yi  1  2 He Menglin  1  2 Mao Min  3  4  5 Wang Xin https://orcid.org/0000-0001-9325-3194  1  2 wangxinmarine@126.com   1 Department of Epidemiology and Biostatistics, West China School of Public Health and West China Fourth Hospital Sichuan University Chengdu China   2 Health Promotion and Food Nutrition & Safety Key Laboratory of Sichuan Province West China School of Public Health and West China Fourth Hospital, Sichuan University Chengdu China   3 Department of Pediatric Pulmonology and Immunology West China Second University Hospital, Sichuan University Chengdu China   4 Key Laboratory of Birth Defects and Related Diseases of Women and Children (Sichuan University), Ministry of Education Chengdu China   5 Sichuan Birth Defects Clinical Research Center, West China Second University Hospital Sichuan University Chengdu China * Correspondence: wangxinmarine@126.com 02 10 2025 10 2025 14 19 497574 10.1002/cam4.v14.19 e71232 14 8 2025 20 5 2025 27 8 2025 02 10 2025 03 10 2025 03 10 2025 © 2025 The Author(s). Cancer Medicine https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ ABSTRACT Background The triglyceride glucose (TyG) index, a simple and reliable surrogate marker of insulin resistance (IR), has garnered increasing attention in metabolic research. Although IR is mechanistically linked to carcinogenesis through multiple pathways, including chronic inflammation, hyperinsulinemia‐driven pro‐mitogenic signaling, and altered adipokine secretion, the specific utility of the TyG index for cancer risk assessment remains unclear. This systematic review examines whether the TyG index shows consistent associations across cancer types and holds value as an independent risk predictor beyond established metabolic syndrome components. Methods We systematically searched PubMed, Embase, and Web of Science databases from 2008 (the year the TyG index was established as an IR marker) to December 31, 2024, for studies on the TyG index‐cancer association. Cohort, cross‐sectional, and case–control studies were included. Using meta‐analysis, we pooled effect sizes and conducted subgroup analyses by gender, region, population source, and study design. Trial sequential analysis (TSA) evaluated evidence reliability. Results This meta‐analysis incorporated a total of 20 eligible studies. Our findings demonstrated that elevated TyG index levels were significantly associated with increased risks of various malignancies, including digestive system cancers (OR: 1.22, 95% CI 1.13–1.31), urogenital system cancers (OR: 2.04, 95% CI 1.53–2.71), and breast cancer (OR: 1.64, 95% CI 1.49–1.80) when compared to lower TyG index levels. These associations remained consistent across all pre‐specified subgroup analyses stratified by study characteristics. Furthermore, TSA confirmed sufficient statistical power for definitive conclusions. Conclusions The consistent observed association between elevated TyG index and increased cancer risk highlights its potential as a candidate biomarker for further investigation. While these findings support the biological plausibility of insulin resistance in oncogenesis, current evidence—partially derived from observational studies—cannot establish causality or direct clinical utility. Future research should prioritize: (1) prospective validation of TyG index thresholds for cancer risk prediction, (2) mechanistic studies elucidating its role in tumor biology, and (3) assessment of its incremental value to existing risk stratification tools. cancer insulin resistance meta‐analysis systematic review triglyceride‐glucose index Natural Science Foundation of Sichuan 10.13039/501100018542 2023NSFSC1927 Medical Youth Innovation Research Project of Sichuan Province Q21016 National Natural Science Foundation of China 10.13039/501100001809 81903398 “From 0 to 1” Innovation Project, Sichuan University 2023SCUH0026 The research start‐up fund for the introduction of talents of Sichuan University YJ2021112 Sichuan Provincial Science and Technology Department 2023 Central Guide Local Project 2023ZYD0097 The Sichuan Tianfu Emei Plan for Young Talents No.Emei‐1841 The Sichuan Health Commission’s Popularization and Application Project No.2025‐2401 Research Project on High‐Quality Development of Clinical Nutrition Work 2025‐3‐Y‐15 Medical Research Project of Chengdu City 2025129 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:02.10.2025  H. Li Z. Chen G. Jiang The Associations Between the TyG Cancer Medicine 14 19 2025 e71232 10.1002/cam4.71232 41036596  Funding: Hongyu Li and Zijie Chen—Co‐first authors. 1 Introduction The escalating global burden of cancer, reflected in rising incidence and mortality rates worldwide, represents a major public health challenge [ 1 2 3 TyG index, calculated as ln[fasting triglycerides (mg/dL) × fasting glucose (mg/dL)/2], serves as a reliable and easily obtainable surrogate marker for IR [ 4 5 6 3 2 Methods 2.1 Search Strategy We conducted a comprehensive systematic search of three major databases (PubMed, Embase, and Web of Science) from 2008 (the year the TyG index was established as an IR marker) through December 31, 2024. Our search strategy employed a combination of controlled vocabulary terms and free‐text words. Using PubMed as an illustrative example, the search algorithm incorporated the following key concepts: (“triglyceride glucose index” OR “TyG index” OR “triglyceride‐glucose index” OR “TyG”) AND (“cancer” OR “neoplasm” OR “malignancy” OR “tumor” OR “carcinoma”) AND (“odds ratio” OR “OR” OR “hazard ratio” OR “HR” OR “relative risk” OR “RR”) AND (“risk” OR “association” OR “relationship”). More detail in Appendix S1 2.2 Literature Screening Process The screening process was independently performed by two reviewers (Hongyu Li and Zijie Chen) under the supervision of a senior researcher (Xin Wang). The procedure comprised: (1) Title/abstract screening: Initial eligibility assessment by dual independent reviewers, with discrepancies resolved by the third arbitrator; (2) Full‐text review: Applying identical dual‐independent screening methodology; (3) Data extraction: Conducted using a standardized form after pilot testing on five publications (complete dataset in Appendix S2 S3 2.3 Inclusion and Exclusion Criteria These studies included in the analysis met the following criteria: (1) The study adopted a cohort, cross‐sectional, or case–control design. (2) The participants enrolled in the trial are healthy at baseline. (3) The objective of the study was to evaluate the correlation between the TyG index and the risk of cancer. (4) The study provided HR, OR, RR, and their 95% confidence interval (CI) for different TyG index groups or every unit or standard deviation increase of the TyG index, or supplied relevant values that can calculate the 95% CI. (5) The effect size was adjusted using a multivariable analysis. (6) If multiple reports contain the same participants or overlapping individuals, priority should be given to the study with the largest sample size. The exclusion criteria were defined as follows: (1) Conference abstracts presented at academic conferences. (2) Animal research, review papers, and Mendelian randomization studies. (3) Data related to expected results is either unavailable or not accessible. 2.4 Data Extraction and Quality Assessment The We systematically extracted the following key variables from each included study: first author's name, publication year, and geographic region/country as basic study information; study design (cohort, case–control, or cross‐sectional), total sample size, and follow‐up duration (for longitudinal studies) as methodological characteristics; participant source (e.g., general population, hospital‐based), mean/median age and age range, and gender distribution as population demographics; TyG index categorization method (e.g., quartiles, tertiles, or continuous per 1‐unit/1‐SD increase) and reference category used for comparison as TyG index parameters; and effect estimates (HR, OR, or RR) from the most fully adjusted model with corresponding 95% CI and covariates included in the adjusted model as outcome measures. We assessed study quality using standardized tools: the Newcastle‐Ottawa Scale (NOS) [ 7 8 2.5 Statistical Analysis Of the twenty included studies, the majority reported odds ratios (ORs) as their primary effect measure, while a minority utilized hazard ratios (HRs). Consequently, we standardized all outcome measures to ORs with corresponding 95% CIs to quantify the TyG index‐cancer risk association. For categorical analyses, we compared the highest versus lowest TyG index categories, whereas for continuous analyses, we expressed effect sizes as per unit or per standard deviation increments in TyG index values. We evaluated study heterogeneity using Cochran's Q I 2 Q p 9 Q p 10 To address potential Type I errors and false‐positive results inherent in meta‐analyses—particularly given limited data availability and repeated testing in cumulative analyses—we conducted trial sequential analysis (TSA) [ 11 Z 12 Statistical analyses were carried out using the software Comprehensive Meta Analysis Version 3.0. A summarized forest plot was drawn using R version 4.3.3. TSA was conducted by Stata version 17.0. 3 Results 3.1 Literature Selection Our systematic search identified 307 potentially relevant articles across PubMed, Embase, and Web of Science databases. Following duplicate removal and rigorous screening based on predefined eligibility criteria, 20 studies were ultimately included for quantitative analysis of the TyG index‐cancer risk association. The complete study selection process, including reasons for exclusion at each stage, is detailed in Figure 1 FIGURE 1 Flow chart of this study. 3.2 Study Characteristics Our analysis incorporated 20 eligible studies examining TyG index‐cancer associations, which revealed the following distribution: Ten studies focused on digestive system malignancies (comprising seven colorectal cancer studies [ 13 14 15 16 17 18 19 14 14 20 21 22 23 14 24 25 26 27 28 26 29 30 31 S2 S3 3.3 Main Meta‐Analysis When analyzing the TyG index as a categorical variable, our meta‐analysis demonstrated significant dose–response relationships between elevated TyG index levels and increased cancer risk. The pooled analysis revealed an overall 40% higher cancer risk among individuals in the highest TyG index category compared to the lowest (OR = 1.40, 95% CI: 1.29–1.51). Site‐specific analyses showed particularly strong associations for urogenital cancers (OR = 2.04, 95% CI: 1.53–2.71) and endocrine‐related cancers (OR = 2.15, 95% CI: 1.39–3.32), along with significant but more modest associations for digestive system cancers (OR = 1.22, 95% CI: 1.13–1.31) and breast cancer (OR = 1.64, 95% CI: 1.49–1.80) (Figure 2 FIGURE 2 Forest plot of the association between the TyG index and cancer. (A) The association between the continuous triglyceride glucose (TyG) index and cancer risk reflects the change in cancer risk associated with each unit or standard deviation increase in the TyG index. (B) The association between the categorical TyG index and cancer risk reflects changes in cancer risk at higher levels of TyG compared to lower levels of TyG. * p Analysis of TyG index as a continuous variable revealed significant positive associations for both digestive system cancers (pooled OR = 1.13, 95% CI: 1.08–1.19) and breast cancer (pooled OR = 1.29, 95% CI: 1.08–1.53). However, the limited number of studies examining respiratory system cancers ( n n I 2 p 2 Notably, a single study [21] reported an inverse association between TyG index and esophageal squamous cell carcinoma risk (OR = 0.8, 95% CI: 0.67–0.95). However, this contradicts the biological plausibility of insulin resistance increasing cancer risk through chronic inflammation and cellular proliferation. Moreover, seven other studies on upper gastrointestinal cancers (gastric/esophagogastric junction) consistently demonstrated positive associations, calling its reliability into question. This isolated inverse association likely reflects methodological limitations rather than true biological effects, requiring validation in larger prospective cohorts. Current evidence does not support a protective association between TyG index and esophageal squamous cell carcinoma. 3.4 Publication Bias Both Egger's test and Begg's test indicated significant publication bias among studies examining the TyG index–colorectal cancer association. This bias persisted regardless of whether the TyG index was analyzed as a continuous (Egger's p p p p 2 3.5 Subgroup Analysis Stratified analyses consistently demonstrated that elevated TyG index levels were significantly associated with increased cancer risk, regardless of variable type (continuous or categorical). When stratified by key covariates—including gender, geographic region, study design, and participant source—we observed moderate reductions in heterogeneity ( I 2 p 1 S4 TABLE 1 Subgroup analysis for the associations between the TyG index and cancer. Disease No. of studies Sample size  I 2 Pooled OR (95% CI)  p (A) All cancer 11 1,832,273 72.241 1.171 (1.121–1.223) Study design 0.203 Case–control 2 3987 96.224 2.053 (0.685–6.158) Cohort 8 1,686,102 64.261 1.130 (1.080–1.182) Cross‐sectional 1 142,184 NA 1.290 (1.084–1.535) Geographic background 0.001 Asia 8 608,568 79.56 1.359 (1.200–1.540) Europe 3 1,223,705 53.325 1.089 (1.044–1.135) Source of participants 0.048 Employee 1 93,659 NA 1.190 (1.053–1.344) Health check‐up 5 273,925 90.66 1.672 (1.198–2.334) Multicenter 5 1,464,689 60.719 1.121 (1.072–1.172) Increase type 0.022 Not mentioned 4 594,272 76.893 1.339 (0.959–1.870) Per 1 SD 3 1,041,555 59.996 1.098 (1.051–1.147) Per 1 unit 4 196,446 82.953 1.376 (1.163–1.627) Sex 0.85 Female 3 850,614 0 1.195 (1.114–1.282) Male 3 850,614 58.082 1.181 (1.070–1.304) (B) All cancer 14 1,500,329 79.294 1.397 (1.292–1.51) Study design 0.00 Case–control 5 4298 82.716 2.361 (1.685–3.308) Cohort 5 1,318,382 70.824 1.205 (1.126–1.290) Cross‐sectional 4 177,649 19.783 1.741 (1.510–2.006) Geographic background 0.00 America 2 32,877 0 2.167 (1.767–2.657) Asia 9 567,699 83.104 1.547 (1.369–1.749) Europe 3 899,753 72.836 1.185 (1.076–1.305) Source of participants 0.269 Employee 1 93,659 NA 1.422 (1.205–1.704) Health check‐up 7 331,814 84.774 1.569 (1.333–1.846) Multicenter 6 1,074,856 75.353 1.345 (1.224–1.478) Sex 0.12 Female 3 532,306 63.898 2.016 (1.388–2.928) Male 1 93,659 NA 1.450 (1.209–1.740)  Note: 3.6  TSA For studies providing adequate data, we performed TSA to evaluate the robustness of observed associations. When analyzing TyG index categorically, the cumulative Z Z p 3 FIGURE 3 Trial sequential analysis (TSA) for evaluating the reliability of the association between the TyG index and cancer. (A) Continuous TyG index and the cancer of digestive system. (B) Categorical TyG index and the cancer of digestive system. (C) Categorical TyG index and the cancer of urogenital system. (D) Categorical TyG index and breast cancer. Monitoring boundaries calculated based on *observed effect size*. Does not preclude *residual confounding*. 4 Discussion 4.1 Summary The TyG index, a well‐established marker of insulin resistance, emerges as a clinically relevant indicator for cancer risk stratification. Our comprehensive meta‐analysis of 20 observational studies demonstrates that elevated TyG index levels are significantly associated with an increased risk of various malignancies, including digestive system cancers (colorectal, pancreatic, and gastric cancers), genitourinary cancers (renal, endometrial, and ovarian cancers), and breast cancer. These associations remained robust across all subgroup analyses stratified by demographic and study characteristics. Compared to the prior meta‐analysis limited to six studies with a literature search up to July 2022 [ 32 4.2 Mechanisms The elevated TyG index demonstrates a significant association with increased risk of digestive system malignancies, including colorectal, pancreatic, hepatic, and gastric cancers. This association may be mediated through multiple interrelated pathophysiological mechanisms: (1) Chronic inflammatory cascade: Insulin resistance induces adipose tissue dysfunction, triggering sustained release of pro‐inflammatory cytokines (TNF‐α, IL‐6) that establish a chronic low‐grade inflammatory state conducive to tumorigenesis [ 33 34 14 35 36  Clostridium perfringens 37 38 39 40 41 Elevated TyG index promotes urogenital system cancers through similar metabolic‐inflammatory mechanisms as digestive cancers, with additional endocrine effects: (1) Hormonal dysregulation: Insulin resistance increases androgens (e.g., in PCOS) [ 42 43 44 The TyG index demonstrates a similar association with breast cancer risk, primarily mediated through estrogen pathway activation. Specifically, insulin resistance reduces SHBG production [ 45 46 4.3 Clinical Implications Our findings demonstrate that the TyG index is a practical and cost‐effective biomarker for cancer risk assessment, requiring only routine blood glucose and triglyceride measurements. We recommend its integration into standard health screenings and cancer prediction models to identify high‐risk individuals for targeted prevention strategies. 4.4 Limitations This study has several limitations: (1) The small number of studies on certain cancers (e.g., respiratory cancers) precludes definitive conclusions, warranting further investigation; (2) While some studies examined diagnostic utility, comprehensive evaluation of clinical applications requires additional evidence synthesis; (3) Notably, some subgroup analyses showed persistently high heterogeneity ( I 2 S2 5 Conclusion In summary, this systematic review of observational studies demonstrates consistent positive associations between elevated TyG index and site‐specific cancer risks (digestive, genitourinary, breast), with magnitude varying across cancer types. While biologically plausible through alignment with insulin resistance pathways, these associations require prospective validation to establish causality, define cancer‐specific thresholds, and clarify their incremental value in cancer screening frameworks. Author Contributions  Hongyu Li: Zijie Chen: Guoheng Jiang: Wenqian Yu: Jing Luo: Shiyi Li: Linjun Xie: Xuan Bai: Yiting Xu: Yi Jiang: Menglin He: Min Mao: Xin Wang: Ethics Statement The authors have nothing to report. Conflicts of Interest The authors declare no conflicts of interest. Supporting information  Data S1:  Appendix S1:  Appendix S2:  Appendix S3:  Appendix S4: Acknowledgments The authors have nothing to report. Data Availability Statement The original contributions presented in the study are included in the article/ Supporting Information References 1 F. Bray M. Laversanne H. Sung Global Cancer Statistics 2022: GLOBOCAN Estimates of Incidence and Mortality Worldwide for 36 Cancers in 185 Countries CA: A Cancer Journal for Clinicians 74 3 2024 229 263 10.3322/caac.21834 38572751 2 J. Gyamfi J. Kim J. Choi Cancer as a Metabolic Disorder International Journal of Molecular Sciences 23 3 2022 35163079 10.3390/ijms23031155 PMC8835572 35163079 3 E. Chiefari M. Mirabelli S. La Vignera Insulin Resistance and Cancer: In Search for a Causal Link International Journal of Molecular Sciences 22 20 2021 11137 10.3390/ijms222011137 34681797 PMC8540232 4 D. L. Tahapary L. B. Pratisthita N. A. Fitri Challenges in the Diagnosis of Insulin Resistance: Focusing on the Role of HOMA‐IR and Tryglyceride/Glucose Index Diabetes and Metabolic Syndrome 16 8 2022 102581 10.1016/j.dsx.2022.102581 35939943 5 L. C. Tao J. N. Xu T. T. Wang F. Hua J. J. Li Triglyceride‐Glucose Index as a Marker in Cardiovascular Diseases: Landscape and Limitations Cardiovascular Diabetology 21 1 2022 68 10.1186/s12933-022-01511-x 35524263 PMC9078015 6 S. S. Nayak D. Kuriyakose L. D. Polisetty Diagnostic and Prognostic Value of Triglyceride Glucose Index: A Comprehensive Evaluation of Meta‐Analysis Cardiovascular Diabetology 23 1 2024 310 10.1186/s12933-024-02392-y 39180024 PMC11344391 7 L. Hartling A. Milne M. P. Hamm Testing the Newcastle Ottawa Scale Showed Low Reliability Between Individual Reviewers Journal of Clinical Epidemiology 66 9 2013 982 993 10.1016/j.jclinepi.2013.03.003 23683848 8 R. Chou W. L. Baker L. L. Bañez Agency for Healthcare Research and Quality Evidence‐Based Practice Center Methods Provide Guidance on Prioritization and Selection of Harms in Systematic Reviews Journal of Clinical Epidemiology 98 2018 98 104 10.1016/j.jclinepi.2018.01.007 29409913 9 D. Langan J. Higgins D. Jackson A Comparison of Heterogeneity Variance Estimators in Simulated Random‐Effects Meta‐Analyses Research Synthesis Methods 10 1 2019 83 98 10.1002/jrsm.1316 30067315 10 C. B. Begg M. Mazumdar Operating Characteristics of a Rank Correlation Test for Publication Bias Biometrics 50 4 1994 1088 1101 7786990 11 J. Brok K. Thorlund J. Wetterslev C. Gluud Apparently Conclusive Meta‐Analyses May Be Inconclusive—Trial Sequential Analysis Adjustment of Random Error Risk due to Repetitive Testing of Accumulating Data in Apparently Conclusive Neonatal Meta‐Analyses International Journal of Epidemiology 38 1 2009 287 298 10.1093/ije/dyn188 18824466 12 J. Brok K. Thorlund C. Gluud J. Wetterslev Trial Sequential Analysis Reveals Insufficient Information Size and Potentially False Positive Results in Many Meta‐Analyses Journal of Clinical Epidemiology 61 8 2008 763 769 10.1016/j.jclinepi.2007.10.007 18411040 13 T. Okamura Y. Hashimoto M. Hamaguchi A. Obora T. Kojima M. Fukui Triglyceride‐Glucose Index (TyG Index) is a Predictor of Incident Colorectal Cancer: A Population‐Based Longitudinal Study BMC Endocrine Disorders 20 1 2020 113 10.1186/s12902-020-00581-w 32709256 PMC7379831 14 J. Fritz T. Bjørge G. Nagel The Triglyceride‐Glucose Index as a Measure of Insulin Resistance and Risk of Obesity‐Related Cancers International Journal of Epidemiology 49 1 2020 193 204 10.1093/ije/dyz053 30945727 15 T. Liu Q. Zhang Y. Wang Association Between the TyG Index and TG/HDL‐C Ratio as Insulin Resistance Markers and the Risk of Colorectal Cancer BMC Cancer 22 2022 1007 10.1186/s12885-022-10100-w 36138391 PMC9503258 16 M. Son S. Y. Moon M. Koh Y. Kang J. Y. Lee Association Between Surrogate Markers of Insulin Resistance and the Incidence of Colorectal Cancer in Korea: A Nationwide Population‐Based Study Journal of Clinical Medicine 13 6 2024 1628 10.3390/jcm13061628 38541854 PMC10971512 17 A. Kityo S. A. Lee Triglyceride‐Glucose Index, Modifiable Lifestyle, and Risk of Colorectal Cancer: A Prospective Analysis of the Korean Genome and Epidemiology Study Journal of Epidemiology and Global Health 14 3 2024 1249 1256 10.1007/s44197-024-00282-w 39103728 PMC11442717 18 J. Li J. Chen H. Liu Association of the Triglyceride‐Glucose Index With the Occurrence and Recurrence of Colorectal Adenomas: A Retrospective Study From China BMC Public Health 24 1 2024 579 10.1186/s12889-024-18076-x 38395868 PMC10885480 19 M. Han H. Wang S. Yang Triglyceride Glucose Index and Atherogenic Index of Plasma for Predicting Colorectal Neoplasms in Patients Without Cardiovascular Diseases Frontiers in Oncology 12 2022 1031259 10.3389/fonc.2022.1031259 36452491 PMC9702061 20 Y. M. Kim J. H. Kim J. S. Park Association Between Triglyceride‐Glucose Index and Gastric Carcinogenesis: A Health Checkup Cohort Study Gastric Cancer 25 1 2022 33 41 10.1007/s10120-021-01222-4 34355281 21 C. Yang W. Cheng P. S. Plum J. Köppe I. Gockel R. Thieme Association Between Four Insulin Resistance Surrogates and the Risk of Esophageal Cancer: A Prospective Cohort Study Using the UK Biobank Journal of Cancer Research and Clinical Oncology 150 8 2024 399 10.1007/s00432-024-05919-8 39180548 PMC11344731 22 L. Wang S. Si J. Li Triglyceride‐Glucose Index Is Not Associated With Lung Cancer Risk: A Prospective Cohort Study in the UK Biobank Frontiers in Oncology 11 2021 774937 10.3389/fonc.2021.774937 34869022 PMC8635521 23 X. Yan Y. Gao J. Tong M. Tian J. Dai Y. Zhuang Association Between Triglyceride Glucose Index and Non‐Small Cell Lung Cancer Risk in Chinese Population Frontiers in Oncology 11 2021 585388 10.3389/fonc.2021.585388 33777737 PMC7990872 24 H. Shi F. Guo K. Zheng R. Li H. Zhou Triglyceride‐Glucose Index (TyG Index) and Endometrial Carcinoma Risk: A Retrospective Cohort Study International Journal of Gynecology & Obstetrics 164 1 2024 298 304 10.1002/ijgo.15038 37555382 25 T. Li Y. Zhou J. Wang Association of Triglyceride‐Glucose Index With the Risk of Prostate Cancer: A Retrospective Study PeerJ 11 2023 e16313 10.7717/peerj.16313 37953784 PMC10637243 26 H. Shi L. Zhou S. Yang H. Zhou The Relationship Between Triglyceride and Glycose (TyG) Index and the Risk of Gynaecologic and Breast Cancers Clinical Nutrition ESPEN 51 2022 345 352 10.1016/j.clnesp.2022.08.004 36184226 27 Y. Zhou T. Li G. Muheiyati Triglyceride‐Glucose Index Is a Predictor of the Risk of Prostate Cancer: A Retrospective Study Based on a Transprostatic Aspiration Biopsy Population Frontiers in Endocrinology 14 2023 1280221 10.3389/fendo.2023.1280221 38260162 PMC10801031 28 E. G. Alkurt F. Şahin B. Tutan K. Canal V. B. Turhan The Relationship Between Papillary Thyroid Cancer and Triglyceride/Glucose Index, Which Is an Indicator of Insulin Resistance European Review for Medical and Pharmacological Sciences 26 17 2022 6114 6120 10.26355/eurrev_202209_29629 36111913 29 X. Wu S. Wang L. Lin Association Between Triglyceride Glucose Index and Breast Cancer in 142,184 Chinese Adults: Findings From the REACTION Study Frontiers in Endocrinology 15 2024 1321622 10.3389/fendo.2024.1321622 38904041 PMC11186986 30 J. Zhang B. Yin Y. Xi Y. Bai Triglyceride‐Glucose Index Is a Risk Factor for Breast Cancer in China: A Cross‐Sectional Study Lipids in Health and Disease 23 1 2024 29 10.1186/s12944-024-02008-0 38279158 PMC10811843 31 S. S. Panigoro N. Sutandyo F. Witjaksono The Association Between Triglyceride‐Glucose Index as a Marker of Insulin Resistance and the Risk of Breast Cancer Frontiers in Endocrinology 12 2021 745236 10.3389/fendo.2021.745236 34707572 PMC8543012 32 H. Wang F. Yan Y. Cui F. Chen G. Wang W. Cui Association Between Triglyceride Glucose Index and Risk of Cancer: A Meta‐Analysis Frontiers in Endocrinology 13 2022 1098492 10.3389/fendo.2022.1098492 36714554 PMC9877418 33 G. S. Hotamisligil N. S. Shargill B. M. Spiegelman Adipose Expression of Tumor Necrosis Factor‐Alpha: Direct Role in Obesity‐Linked Insulin Resistance Science 259 5091 1993 87 91 10.1126/science.7678183 7678183 34 M. Hoene C. Weigert The Role of Interleukin‐6 in Insulin Resistance, Body Fat Distribution and Energy Balance Obesity Reviews 9 1 2008 20 29 10.1111/j.1467-789X.2007.00410.x 17956545 35 Y. Takada A. Bhardwaj P. Potdar B. B. Aggarwal Nonsteroidal Anti‐Inflammatory Agents Differ in Their Ability to Suppress NF‐kappaB Activation, Inhibition of Expression of Cyclooxygenase‐2 and Cyclin D1, and Abrogation of Tumor Cell Proliferation Oncogene 23 57 2004 9247 9258 10.1038/sj.onc.1208169 15489888 36 V. Grubelnik J. Zmazek M. Završnik M. Marhl Lipotoxicity in a Vicious Cycle of Pancreatic Beta Cell Exhaustion Biomedicine 10 7 2022 1627 10.3390/biomedicines10071627 PMC9313354 35884932 37 A. Camargo J. D. Ramírez R. Kiu L. J. Hall M. Muñoz Unveiling the Pathogenic Mechanisms of  Clostridium perfringens Emerging Microbes & Infections 13 1 2024 2341968 10.1080/22221751.2024.2341968 38590276 PMC11057404 38 C. L. Boulangé A. L. Neves J. Chilloux J. K. Nicholson M. E. Dumas Impact of the Gut Microbiota on Inflammation, Obesity, and Metabolic Disease Genome Medicine 8 1 2016 42 10.1186/s13073-016-0303-2 27098727 PMC4839080 39 D. H. Kim Y. O. Ahn Molecular Epidemiology of Colon Cancer Cancer Research and Treatment 36 2 2004 93 99 10.4143/crt.2004.36.2.93 20396547 PMC2855094 40 N. Jonckheere R. Vasseur I. Van Seuningen The Cornerstone K‐RAS Mutation in Pancreatic Adenocarcinoma: From Cell Signaling Network, Target Genes, Biological Processes to Therapeutic Targeting Critical Reviews in Oncology/Hematology 111 2017 7 19 10.1016/j.critrevonc.2017.01.002 28259298 41 G. G. Jinesh V. Sambandam S. Vijayaraghavan K. Balaji S. Mukherjee Molecular Genetics and Cellular Events of K‐Ras‐Driven Tumorigenesis Oncogene 37 7 2018 839 846 10.1038/onc.2017.377 29059163 PMC5817384 42 H. Ding J. Zhang F. Zhang Resistance to the Insulin and Elevated Level of Androgen: A Major Cause of Polycystic Ovary Syndrome Frontiers in Endocrinology 12 2021 741764 10.3389/fendo.2021.741764 34745009 PMC8564180 43 W. C. Burkett A. D. Clontz T. O. Keku V. Bae‐Jump The Interplay of Obesity, Microbiome Dynamics, and Innovative Anti‐Obesity Strategies in the Context of Endometrial Cancer Progression and Therapeutic Approaches BBA Reviews on Cancer 1878 6 2023 189000 10.1016/j.bbcan.2023.189000 37844671 PMC12046527 44 H. Zhang X. Chen J. Aravindakshan M. R. Sairam Changes in Adiponectin and Inflammatory Genes in Response to Hormonal Imbalances in Female Mice and Exacerbation of Depot Selective Visceral Adiposity by High‐Fat Diet: Implications for Insulin Resistance Endocrinology 148 12 2007 5667 5679 10.1210/en.2007-0647 17717050 45 N. L. Dimou N. Papadimitriou D. Gill Sex Hormone Binding Globulin and Risk of Breast Cancer: A Mendelian Randomization Study International Journal of Epidemiology 48 3 2019 807 816 10.1093/ije/dyz107 31143958 PMC6659370 46 A. Nounu S. P. Kar C. L. Relton R. C. Richmond Sex Steroid Hormones and Risk of Breast Cancer: A Two‐Sample Mendelian Randomization Study Breast Cancer Research 24 1 2022 66 10.1186/s13058-022-01553-9 36209141 PMC9548139 ",
  "metadata": {
    "Title of this paper": "Sex Steroid Hormones and Risk of Breast Cancer: A Two‐Sample Mendelian Randomization Study",
    "Journal it was published in:": "Cancer Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489462/"
  }
}