{
  "title": "Paper_474",
  "abstract": "pmc BMC Genomics BMC Genomics 32 bmcgeno BMC Genomics 1471-2164 BMC PMC12482561 PMC12482561.1 12482561 12482561 41023610 10.1186/s12864-025-12023-9 12023 1 Software SoMaCX: a complex generative genome modeling framework Becker Timothy James tbecker@conncoll.edu https://ror.org/01hpqfm28 grid.254656.6 0000 0001 2343 1311 Department of Computer Science, Connecticut College, 29 9 2025 2025 26 478389 853 2 1 2025 20 8 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Somatic structural variations (SVs) are commonly observed in cancer tissue, but remain challenging to discover with short and long read sequencing due to tumor heterogeneity and other technical sequencing factors. Only SVs with a sufficient fraction of reads spanning the event will be detectable, while issues like chromothripsis increase the complexity and resulting interpretation significantly. Because structural variation is difficult to measure and reproduce in vivo, it is logical to make use of simulation frameworks to determine realistic system limitations. Our generative modeling approach called soMaCX uses distributions from data to empower simulations that approach real data. Results Our generative framework includes mechanisms for biological conservation in the germline as well as tissue composition in the somatic along with regional distribution controls and complex SV generation that is not available in other systems. The output of this system is FASTA format which can then be used as input to any downstream read simulator making Illumina, PacBio, 10X genomics, Oxford-Nanopore and Bionano FASTQ data files which are further processed to become standard BAM files for SV calling. Conclusions The soMaCX framework provides superior generative modeling-based performance when compared to other simulation frameworks with respect to real data. Our open-source method introduces an important conceptual element to simulation by utilizing biological relevant regions (genes and regulatory elements) as the distribution controls along with the biological modulation of known pathways (end-joining) leading to more detailed and realistic simulated genomes. By designing a generative method to explore the most difficult genomic conditions, we provide a means to measure germline variation calling performance and to calibrate the results for rare variants needed in the clinical setting. We provide a python 3 implementation at: https://github.com/timothyjamesbecker/somacx Supplementary Information The online version contains supplementary material available at 10.1186/s12864-025-12023-9. Keywords Next generation sequencing Genome simulation Somatic simulation Generative modeling FASTA generation. National Institutes of Health R03DE033083 Becker Timothy James pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Cancer evolution literature has shown that less than 5% of a survival advantage is offered to oncogenic regions through normal environmental exposure like ultra-violet radiation, but these external effects can create selective advantage to those cells that have the oncogenic alterations. This in turn can cause feedback deriving more variation due to loss of function with DNA repair mechanisms [ 1 2 3 4 6 de novo 7 The system works by first generating the starting point which is a germline genome (two FASTA files for the maternal and paternal lines) that may also have de novo  Fig. 1 Clonal Evolution in the somatic genome can either be simulated by using a JSON configuration file as shown above or can also be simulated using a set of branching and decay parameters ( for branching, for decay). This allows users to build (A) sub-clonal structures (B) cancer stem cell structures Genomic variation rates for every SV type are established by a two-dimensional vector with b )) 8 (1–5)  Fig. 2 SV types include pre-SV substitutions (SNV, MNV), insertions, deletion, duplications, inversions, translocations and finally post-SV substitutions. This allows the user to have SNV and MNV that are in and out of linkage to the DEL, DUP, INV, INS, TRA events. The visualization shows an example of the chance of an SV event per base-pair (the Y axis) along with the chance for a given size (the X axis). These distributions are set within the JSON file. Defaults are included in the soMaCX distribution that are based on the 1000 Genomes Phase 3 rates detected using the SVE and FusorSV framework The soMaCX framework allows simulation of healthy individuals that have properties and rates similar to the 1000 genomes Phase 3 or Phase 4 samples (for example) [ 4 6 6 9 10 https://github.com/timothyjamesbecker/somacx Genome consortium efforts such as the 1000 Genomes project have estimated that a typical human genome contains 2.1–2.5 thousand SVs (greater than 50 base pairs), affecting ~ 20 million base pairs (bp), or ~ 5 times that of normally affected SNVs [ 2 4 6 11 11 12 11 13 Although many read simulators have been developed in the past ten years, none have focused on the ability to include complex SVs (along with linked and unlinked SNVs) using biologically relevant structures or have specifically targeted and modeled major drivers of those SVs (end-joining pathways) which are related to replication-based perturbations [ 14 15 14 16 DNA breakage and repair Unlike germline genomes, cancer genomes are under selective pressure either before or after treatment in the form of pathway impairments and double stranded DNA breaks. To repair the damage, cells will employ homologous mediated repair, or homologous recombination, by utilizing the corresponding sequence of the site of damage on the undamaged sister chromatid to allow for precise repair. Homologous mediated repair can only occur after DNA has replicated in S phase and occurs in G2 and only if the pathway is intact [ 1 Non-homologous end joining (NHEJ) can occur before S phase in G1, where the break is ligated by protein machinery including the Ku70/80 heterodimer as well as protein kinases and additional ligases. NHEJ is particularly error prone, and initially small deletions are made in the end breaks before ligation. Disruption to both processes can result in chromosomal aberrations such as inversions and deletions and other replication errors observed in chromosomes after progression of malign tumor formation [ 14 16 1 An alternate form of NHEJ, microhomology-mediated end joining (MMEJ), requires protein machinery similar to homologous mediated repair, and is Ku70/80 independent [ 17 17 18 One prominent cause of cell immortality in cancer is apoptotic dysfunction [ 1 1 1 A complete loss or gain of a chromosome, known as aneuploidy, has also been shown in cancer cell lines. This occurs during abnormal mitotic checkpoint (MITCP) function and spindle formation. When nuclear division proceeds, spindle formation through microtubule connection to the kinetochore is established in metaphase. If the spindle has not formed properly, chromosomes will not migrate to the proper pole and unequal chromosome number will result in the daughter cell. Normal function of the following genes has been shown in our dataset to be important for MITCP processing: BUB1, BUB1B, BUB3, CENPE, CDC20, CDH1, FZR1, MAD1L1, MAD2L1, MAD2L2, MAD2L1BP, MPEG1, PTTG1, RAE1 [ 19  Fig. 3 region (or gene list) distribution w Implementation To generate MNVs and SVs in controllable biological positions and with quantities and qualities that would reflect the full spectrum of healthy to diseased genomes, we employ a joint distribution with three components: positional, type and size, and then one additional dimension for somatic evolution (where the genome will vary from cell to cell). The positional distribution can be built with either gene lists or by using BED file coordinates directly with what we call classes that are names associate with a set of coordinates. For example, the default JSON file includes important classes such as “APOT” which is a gene list that keeps genes in the apoptosis pathway from being modified in the germline (0 chance of an SV event in that area). The positional distribution for n 3 m i 1 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:{\\omega\\:}_{i}=\\:〈{\\omega\\:}_{i,1},\\:{\\omega\\:}_{i,2},\\:\\dots\\:,{\\omega\\:}_{i,m}〉\\::1<i\\le\\:n$$\\end{document} Using all the weight classes in an additive manner and then normalizing by the positional totals would then lead to the probability of sampling a position \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:0\\le\\:x\\le\\:m$$\\end{document} 2 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:p\\left(x\\right)=\\frac{\\displaystyle\\sum_{i=1}^{n}{\\omega\\:}_{i,x}}{\\displaystyle\\sum_{i=1}^{n}\\displaystyle\\sum_{y=0}^{m}{\\omega\\:}_{i,y}}:\\:0\\le\\:x\\le\\:m$$\\end{document} Next we have a set of variation types below where SUB represented multi-nucleotide variation (small substitutions), DEL is for a deletion in the reference, DUP is a duplication in the reference and has inverted, tandem and dispersed subtypes, INV represents inversion with either a simple or complex subtype (complex will have deletions, duplications and insertion at breakpoints or inside the inversion range), INS is insertion and is either random or is drawn from libraries like MELT that make use a library of known mobile element families, TRA can either be balanced or unbalanced where a section of the reference is relocated to a new position in the sample [ 20 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:\\varvec{t}\\in\\:$$\\end{document} λ κ b let: \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:{\\lambda\\:}_{t}=\\:〈{\\lambda\\:}_{1},{\\lambda\\:}_{2},\\dots\\:,{\\lambda\\:}_{b}〉$$\\end{document} let: \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:{\\kappa\\:}_{t}=〈{\\kappa\\:}_{1},{\\kappa\\:}_{2},\\dots\\:,{\\kappa\\:}_{b}〉$$\\end{document} then we generate the distribution of variant type t 3 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:p\\left(x\\right)=\\left[\\frac{{\\kappa\\:}_{x}}{\\sum_{i=1}^{b}{\\kappa\\:}_{i}}\\right]\\left[\\frac{{\\lambda\\:}_{x}^{{\\kappa\\:}_{x}}{e}^{-{\\lambda\\:}_{x}}}{{\\kappa\\:}_{x}!}\\right]:\\:1\\:\\le\\:x\\:\\le\\:b$$\\end{document} In our implementation the JSON file sets these b control points λ κ 2 β δ α i 4 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:p\\left({\\beta\\:}_{i}\\right)=\\left\\{\\begin{array}{c}{\\beta\\:}_{root},\\:\\:\\:\\:\\:\\;\\:\\text{if i=root}\\\\\\:\\alpha\\:{\\beta\\:}_{parent\\left(i\\right)},\\:\\:\\text{e}\\text{l}\\text{s}\\text{e}\\end{array}\\right.$$\\end{document} After the branching chances have been simulated at each time point, the decay probabilities are applied, giving each node i This is given as the recurrence: 5 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:\\text{p}\\left({{\\updelta\\:}}_{i}\\right)=\\left\\{\\begin{array}{c}{\\delta\\:}_{root},\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\text{if i=root}\\\\\\:min\\left\\{\\begin{array}{c}1\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\\\\\:max\\left\\{\\begin{array}{c}\\epsilon\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\:\\\\\\:2\\alpha\\:{\\delta\\:}_{parent\\left(i\\right)}-{\\delta\\:}_{parent\\left(i\\right)}+\\epsilon\\:\\end{array}\\right.\\end{array}\\right.,\\:\\:\\text{e}\\text{l}\\text{s}\\text{e}\\end{array}\\right.$$\\end{document} for \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:0<\\epsilon\\:<0.1$$\\end{document} Using this formulation for tree generation allows for an unlimited number of clones as well as tree variation ranging from extremely branchy (cancer stem cell where omnipotent clones divide while containing de novo The framework shown in Fig. 4 For the somatic genome, we generate a Clonal Tree for each instance by embedding the VCF header with a pedigree format detailing the clonal structure. Each clone is enumerated from 0 (the root whose SVs will appear in children clones) down to the stopping level (leaves) which is set by the depth parameter. In practice, it makes sense to first determine the total coverage that will be simulated on the read simulation system such as ART and then divide by two to allow frequencies of the SVs to reach up to or past the edge of detection [ 21 In our open-source python 3 implementation, we include example scripts to facilitate the remaining tasks a user will need complete once the main soMaCX generator.py script is run. This entails running a read simulator such as ART or PBSIM shown in Fig. 4 4 22 24 23  Fig. 4 soMaCX complete example workflow: (A) A reference FASTA file generation of multiple diverging genomes (B) FASTA based read platform simulator in (C). A B To ensure that our system can produce plausible healthy and cancer genomes, we mined current literature for oncogenes (2027 oncogenes in total), MITCP genes (14 genes), NHEJ genes (16 genes), MMEJ (11 genes), and apoptosis genes (96 genes) [ 14 17 19 22 25 29 4 Results Method feature comparison The soMaCX system was designed to model genomic events described in literature but missing in other methods. Presented as Table 1  Table 1 Comparison table of SVEngine in red, tHapMix in orange, Xome-Blender in orange-yellow, SCNVsim in yellow, Varsim in blue and soMaCX in green Rows that start with SV: included features that are specific to generation of structural variations, while Germline: would refer to specific features for the germline generation phase and finally Somatic: would denote somatic specific generation features. We took care to include most of the features listed in the SVEngine and SCNVsim papers to make the comparison table complete while adding implementation details in the bottom such as programming language and whether the system can currently be built or used which we thought was an important consideration from the user perspective Overall, soMaCX offers the feature set closest to current literature in the field of sequence variation and cancer sequencing. Additionally, we note that with soMaCX we implement a novel out of core algorithm that holds the original sequence and the currently generating clone sequence(s) and uses a genotype aware editing map to apply sequence variations from the left hand of the chromosome to the right which we call FASTA spooling (printing part of the somatic clone at a time like a printer). This allows our method to scale to extremely large clone numbers such as would be present in a single cell experiment. Several of the methods we looked at such as SCNVsim and Xome-Blender had limitations to clones less than 5 while in our experiment we explored around 25 which is the limit based on the coverage we chose. Current whole genome sequencing is limited with single cell experiments, but we envision this will be possible in the future and soMaCX will be capable of simulating those experiments without modification to algorithm or code implementation. SVEngine offer the next best set of features, but currently suffers from a lack of software maintenance where a modern system cannot build the software using the provided instructions nor run the software without modification to the depreciated python2 code [ 30 30 6 de novo 11 tHapMix includes a non-buildable dockerfile and a link to a functioning prebuilt image [ 31 12 15 Xome-Blender is a similar BAM mixing method to tHaPMix in that it takes input BAM files as input and then attempts to mix in new variations [ 32 SCNV uses functioning java code that runs and produces correct output, but the implementation has severe limitations such as a maximum of three clones and a total amount of variation for all three clones limited to 300 events [ 33 30 Varsim produces adequate germline sequence variation if it is given the exact set of events it should sample from such as a curated VCF file with all potential variations. The problem here though is that Varsim will not introduce de novo 15 Germline comparison with varsim  Table 2 JBPD euclidian distance SoMaCX G1K Varsim Note: Varsim randomly selects existing SVs in a non-generative manner from VCF file and so is incapable of de novo 5 For our first experiment we measured how close a set of soMaCX genomes could be to real germline data and contrast that to the same experiment with another simulation method which is shown in Table 2 21 We selected 15 samples from 1000 Genomes phase 3 and used the VCF files to generated 15 genomes with soMaCX set to hybrid mode (--g1k_sample) using the hgv37d preset al.ong with another 15 genomes using Varsim with the default setting and the same 15 sample input VCF files [ 15 1 2 23 22 24 2 We used a distance version of the Jaccard base-pair similarity (JBPS) metric for pairs of SV callers as described in the FusorSV manuscript method to construct a single distance value between any two datasets. This calculation is further detailed below in Eqs. ( 6 2 Individual SV caller performances for the 27-sample high coverage study in the FusorSV paper (middle row in Fig. 5 6 15 Somatic comparison with Xome-Blender  Table 3 JBPD euclidian distance Xome-blender does not generate germline or somatic SVs and then make a FASTA, instead it blends existing BAM files. The result is that very little variation is achieve and the input BAM file which were taken from 1000 genomes phase 4 where very similar to those germline samples. The TCRB samples have very large amount of SVs as they are measurably disrupted genomes For our second experiment (shown in Table 3 34  Fig. 5 (A): SV Caller performance by type for real human samples from the 1000 Genomes Phase 3 high coverage. 27 high coverage samples with 50 average coverage using PCR-free design, 250 bp average read length, 451 bp insert size mean, 125 bp insert size standard deviation. The upper row details two accuracy-based metrics which are the harmonic mean (F1 score) of the precision and recall on the x-axis and the Jaccard base pair similarity metric on the y-axis. The lower row shows the number of true calls against the number of calls made by each caller. (B) soMaCX hybrid normal germline simulation scores using the same format. (C) Varsim data scores are almost perfect and as a result makes this dataset further from the real one in than soMaCX. The visualizations of (A), (B) and (C) indicate differences in measurements of SV callers compared to the true known calls. Since (A) is real data, it represents the best estimates of the 1000 Genomes Phase 3 PCR-free high coverage data which may be missing some real calls due to the methodology that sought to control FDR (but didn’t use an orthogonal sequencing technology) JBPS and JBPD metric details The Jaccard base-pair similarity (J) metric counts the individual overlapping base-pair coordinates so that break point accuracy and other large copy number artifacts (like SV call multiplicity) are diminished, making the calculation close to sequence homology around the SV alleles. The Jaccard base-pair distance is simply 1.0-J which we denote as JBPD. A JBPD of 0.1 means that two call sets have 10% sequence divergence between the SV alleles. let \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:L$$\\end{document} let \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:C=\\{{C}_{1},{C}_{2},\\dots\\:,{C}_{m}\\}$$\\end{document} m where \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:{C}_{i,l}$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:l\\in\\:L$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:i\\in\\:\\{\\text{1,2},\\dots\\:m\\}$$\\end{document} we then define the JBPD matrix as the average across the L 6 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:\\text{J}\\left[\\text{i},\\text{j}\\right]=\\left(\\frac{1}{L}\\right)\\displaystyle\\sum_{l \\in L}\\left(1-\\frac{\\left[{C}_{i,l}{\\bigcap\\:}_{bp}{C}_{j,l}\\right]}{\\left[{C}_{i,l}{\\bigcup\\:}_{bp}{C}_{j,l}\\right]}\\right):i,j\\:=\\text{1,2},\\dots\\:,\\text{m}$$\\end{document} let the real 1000 Genomes phase 3 data JBPD matrix will be denoted as: G1K let the VarSim simulated data JBPD matrix will be denoted as: VS let the SoMaCX simulated data JBPD will be denoted as: SX then, the Euclidean distance between G1K VS 7 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:\\sqrt{{\\sum\\:}_{i}^{\\text{m}}{\\sum\\:}_{\\text{j}}^{\\text{m}}{\\left(G1K\\left[i,j\\right]-VS\\left[i,j\\right]\\right)}^{2}}$$\\end{document} and the Euclidean distance between G1K SX 8 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:\\sqrt{{\\sum\\:}_{i}^{m}{\\sum\\:}_{j}^{m}{\\left(G1K\\left[i,j\\right]-SX\\left[i,j\\right]\\right)}^{2}}$$\\end{document} (similarity matrix files and the distance_calculation.py script are in supplementary files) Measuring limitations of somatic SV calling Another use of the soMaCX framework is to estimate the limitations of SV calling by type and coverage fraction (allele frequency) using a machine learning diagnostic tool like TensorSV [ 35 We simulated 15 germline and matching somatic genomes at 25X paired-end coverage for the normal and 50X coverage for the tumor as we observed in TCRBOA6 and TCRBOA7 samples from the open-source cancer pilot dataset [ 34 5 2 Next, we focus only on the tumor simulation framework to estimate the lower and upper bounds of SV detection. We made use of the TensorSV system and trained a 4-class SV model to estimate the lower bound on each SV type using a set of allele fraction to genotype class [ 35  Fig. 6 A: TensorSV Model Confusion Matrix for DEL types. The second class or label 1 shows confusion with the lowest value suggesting that these intermediate allele frequencies are challenging for detection. B: TensorSV Model Confusion Matrix for DUP types. Accuracy is lower than DEL overall and fractional alleles are more difficult to detect than the homozygous 0/0 and 1/1 (class 0 and class 3). C: TensorSV Model Confusion Matrix for INV types. Overall performance accuracy is good and confusion is less than with the DEL and DUP types suggesting that simple INV do not represent the reality of the complex variation present in human genomes Discussion The diminished somatic call accuracy shown in Fig. 6 36 38 4 5 To ensure that these simulations are plausible for human genomes, we compared our synthetic genomes to two of the few open-source cancer data samples that exist and based our non-uniform SV distributions on several prominent sources of current literature [ 17 22 26 29 de novo 28 39 41 Much of the results discussed in this work could be improved using the increased insertion discovery that the Human Genome Structural Variation project has discovered as the basis for better estimation of the insertion distribution [ 12 42 12 22 43 Because germline modeling is needed to create the somatic genomes, the soMaCX method is a natural mechanism to develop detailed phenotype related genetic disorder models where SNV, MNV and SV from studies such as the Gabriella Millers Kids First data portal can be used [ 44 5 6 Conclusions This paper details the important aspects of genome generation starting at the germline and how that can be used to simulate somatic tissues with clonal modeling through generative means. We introduced an important control structure which is missing in other simulation frameworks allowing for regional distributions that adhere to biological relevant functionality such as ensuring germline genomes do not have structural variants in the apoptosis pathway. This overlooked element has been generalized so that these regional controls (via gene set lists or BED files with enhancer regions) become an ideal method to perturb genomes and measure sequence variation detection accuracy in any given read platform. Additionally, there is no other simulation framework that offers the complexity of SVs where inversions can contain duplicated or deleted break ends as well as complex translocations or dispersed duplications. Given its flexibility, open-source code and extensibility from new data, this software framework will have broad application to the genomic community. Using ART simulated Illumina pair-end reads we showed that soMaCX simulated genomes are more similar to real data than other simulation frameworks and in turn can give a better estimate of system performance. For germline generation soMaCX can be used to model specific genetic disorders given a sample set of sufficient size where VCF and BED files can be used to allow multi-omic data to control the soMaCX distributions. For somatic tissues large studies can be used where allele frequencies can control the shape of each soMaCX simulated clonal tree offering a controllable but extremely complex simulation result. We included example scripts to process the soMaCX FASTA output into FASTQ for Illumina and PacBio data, but the user would need to expand our work in order to have working simulation for other read platforms such as Oxford Nanopore. Additionally, more complex structural variations beyond what we have implemented and detailed in our work would require future updates and careful planning since multiple overlapping SV alleles have not been formally defined or resolved theoretically. What this means is that measurement of overlapping SV events is not currently well defined and as a result our simulation tends to generate more well separated events (in coordinate space) other than the complex inversion and dispersed duplication SV types. There is room for future work to develop less ambiguous and more formal definitions of what exactly a copy number variation is versus a copy number aberration versus a deletion or duplication event. In our work we seek to carefully define and implement each of these possibilities so that the simulation framework can serve to benchmark a wide variety of platforms and algorithms such as CNVnator, ERDS, Ginko, SCICoNE, CHISEL and CNRein [ 36 45 49 50 Author contributions TJB completed all parts of the project. Funding This work was supported in part by NIH grant No. R03DE033083. Its contents are the sole responsibility of the authors and do not necessarily represent the views of the NIH. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1 Abbreviations DEL deletion structural variation event DUP duplication structural variation event INV inversion structural variation event INS insertion structural variation event TRA translocation structural variation event NHEJ non-homologous end-joining MMEJ micro-homology mediated end-joining MITCP mitotic check point SV structural variation SNV single nucleotide variation MNV multi nucleotide variation SUB substitution sequence variation TCGA The Cancer Genome Atlas PCAWG Pan-Cancer Analysis of Whole Genomes Consortium Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Author contributions T.J.B. completed all parts of the work: manuscript, data analysis, method development, software implementation and software testing. Data availability Project name: soMaCXProject home page: https://github.com/timothyjamesbecker/somacxOperating Systems: LinuxProgramming language: Python 3License: GPL3Any restrictions to use by non-academics: GPL3. Declarations Ethical approval Not applicable. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Greaves M Maley M Clonal evolution in cancer Nature 2012 481 306 13 10.1038/nature10762 22258609 PMC3367003 Greaves M, Maley M. Clonal evolution in cancer. Nature. 2012;481:306–13. 22258609 10.1038/nature10762 PMC3367003 2. Becker T FusorSV: an algorithm for optimally combining data from multiple structural variation methods Genome Biol 2018 19 38 10.1186/s13059-018-1404-6 29559002 PMC5859555 Becker T, et al. FusorSV: an algorithm for optimally combining data from multiple structural variation methods. Genome Biol. 2018;19:38. 29559002 10.1186/s13059-018-1404-6 PMC5859555 3. The Cancer Genome Atlas Research Network., Weinstein, J., Collisson, E. et al. Nat Genet 45 https://www.nature.com/articles/ng.2764#citeas 10.1038/ng.2764 PMC3919969 24071849 4. Byrska-Bishop M High-coverage whole-genome sequencing of expanded 1000 genomes project cohort including 602 trios Cell 2022 185 3426 40 10.1016/j.cell.2022.08.004 36055201 PMC9439720 Byrska-Bishop M, et al. High-coverage whole-genome sequencing of expanded 1000 genomes project cohort including 602 trios. Cell. 2022;185:3426–40. 36055201 10.1016/j.cell.2022.08.004 PMC9439720 5. The ICGC/TCGA Pan-Cancer Analysis of Whole Genomes Consortium Pan-cancer analysis of whole genomes Nature 2020 578 82 93 10.1038/s41586-020-1969-6 32025007 PMC7025898 The ICGC/TCGA Pan-Cancer Analysis of Whole Genomes Consortium. Pan-cancer analysis of whole genomes. Nature. 2020;578:82–93. 32025007 10.1038/s41586-020-1969-6 PMC7025898 6. Sudmant P An integrated map of structural variation in 2504 human genomes Nature 2015 526 75 81 10.1038/nature15394 26432246 PMC4617611 Sudmant P, et al. An integrated map of structural variation in 2504 human genomes. Nature. 2015;526:75–81. 26432246 10.1038/nature15394 PMC4617611 7. National Center for Biotechnology Information, File Format Guide: FASTQ United States Library of Medicine. 2019. https://www.ncbi.nlm.nih.gov/sra/docs/submitformats/#fastq-files 8. Haeussler M The UCSC genome browser database: 2019 update Nucleic Acids Res 2019 47 853 8 10.1093/nar/gky1095 PMC6323953 30407534 Haeussler M, et al. The UCSC genome browser database: 2019 update. Nucleic Acids Res. 2019;47:853–8. 10.1093/nar/gky1095 PMC6323953 30407534 9. Eichler E Missing heritability and strategies for finding the underlying causes of complex disease Nat Rev Genet 2010 11 446 50 10.1038/nrg2809 20479774 PMC2942068 Eichler E, et al. Missing heritability and strategies for finding the underlying causes of complex disease. Nat Rev Genet. 2010;11:446–50. 20479774 10.1038/nrg2809 PMC2942068 10. Manolio T Finding the missing heritability of complex diseases Nature 2009 461 747 53 10.1038/nature08494 19812666 PMC2831613 Manolio T, et al. Finding the missing heritability of complex diseases. Nature. 2009;461:747–53. 19812666 10.1038/nature08494 PMC2831613 11. Collins R Defining the diverse spectrum of inversions, complex structural variation, and chromothripsis in the morbid human genome Genome Biol 2017 18 36 10.1186/s13059-017-1158-6 28260531 PMC5338099 Collins R, et al. Defining the diverse spectrum of inversions, complex structural variation, and chromothripsis in the morbid human genome. Genome Biol. 2017;18:36. 28260531 10.1186/s13059-017-1158-6 PMC5338099 12. Chaisson M Multi-platform discovery of haplotype-resolved structural variation in human genomes Nat Commun 2019 10 1784 10.1038/s41467-018-08148-z 30992455 PMC6467913 Chaisson M, et al. Multi-platform discovery of haplotype-resolved structural variation in human genomes. Nat Commun. 2019;10:1784. 30992455 10.1038/s41467-018-08148-z PMC6467913 13. Kumar S MEGA7: molecular evolutionary genetics analysis version 7.0 for bigger datasets Mol Biol Evol 2016 33 7 1870 4 10.1093/molbev/msw054 27004904 PMC8210823 Kumar S, et al. MEGA7: molecular evolutionary genetics analysis version 7.0 for bigger datasets. Mol Biol Evol. 2016;33(7):1870–4. 27004904 10.1093/molbev/msw054 PMC8210823 14. Davis A Chen D DNA double strand break repair via non-homologous end-joining Translational Cancer Res 2013 2 3 130 43 10.3978/j.issn.2218-676X.2013.04.02 PMC3758668 24000320 Davis A, Chen D. DNA double strand break repair via non-homologous end-joining. Translational Cancer Res. 2013;2(3):130–43. 10.3978/j.issn.2218-676X.2013.04.02 PMC3758668 24000320 15. Mu J VarSim: a high-fidelity simulation and validation framework for high-throughput genome sequencing with cancer applications Bioinformatics 2015 31 1469 71 10.1093/bioinformatics/btu828 25524895 PMC4410653 Mu J, et al. VarSim: a high-fidelity simulation and validation framework for high-throughput genome sequencing with cancer applications. Bioinformatics. 2015;31:1469–71. 25524895 10.1093/bioinformatics/btu828 PMC4410653 16. Aguilera A García-Muse T Causes of genome instability Annu Rev Genet 2013 47 1 32 10.1146/annurev-genet-111212-133232 23909437 Aguilera A, García-Muse T. Causes of genome instability. Annu Rev Genet. 2013;47:1–32. 23909437 10.1146/annurev-genet-111212-133232 17. Patterson-Fortin J D’Andrea A Exploiting the Microhomology-Mediated End-Joining pathway in cancer therapy Cancer Res 2020 80 21 4593 600 10.1158/0008-5472.CAN-20-1672 32651257 PMC7641946 Patterson-Fortin J, D’Andrea A. Exploiting the Microhomology-Mediated End-Joining pathway in cancer therapy. Cancer Res. 2020;80(21):4593–600. 32651257 10.1158/0008-5472.CAN-20-1672 PMC7641946 18. Nikolov D Burley S RNA polymerase II transcription initiation: a structural view Proc Natl Acad Sci 1997 94 1 15 22 10.1073/pnas.94.1.15 8990153 PMC33652 Nikolov D, Burley S. RNA polymerase II transcription initiation: a structural view. Proc Natl Acad Sci. 1997;94(1):15–22. 8990153 10.1073/pnas.94.1.15 PMC33652 19. Giotti B et al. Assembly of a parts list of the human mitotic cell cycle machinery. J Mol Cell Biol. 2019;11 – 8:703–18. 10.1093/jmcb/mjy063 PMC6788831 30452682 20. Gardner E The mobile element locator tool (MELT): population-scale mobile element discovery and biology Genome Res 2017 27 11 1916 29 10.1101/gr.218032.116 28855259 PMC5668948 Gardner E, et al. The mobile element locator tool (MELT): population-scale mobile element discovery and biology. Genome Res. 2017;27(11):1916–29. 28855259 10.1101/gr.218032.116 PMC5668948 21. Huang W ART: a next-generation sequencing read simulator Bioinformatics 2012 28 4 593 4 10.1093/bioinformatics/btr708 22199392 PMC3278762 Huang W, et al. ART: a next-generation sequencing read simulator. Bioinformatics. 2012;28(4):593–4. 22199392 10.1093/bioinformatics/btr708 PMC3278762 22. Li H The sequence alignment/map format and samtools Bioinformatics 2009 25 16 2078 9 10.1093/bioinformatics/btp352 19505943 PMC2723002 Li H, et al. The sequence alignment/map format and samtools. Bioinformatics. 2009;25(16):2078–9. 19505943 10.1093/bioinformatics/btp352 PMC2723002 23. Li H Minimap2: pairwise alignment for nucleotide sequences Bioinformatics 2018 34 3094 100 10.1093/bioinformatics/bty191 29750242 PMC6137996 Li H. Minimap2: pairwise alignment for nucleotide sequences. Bioinformatics. 2018;34:3094–100. 29750242 10.1093/bioinformatics/bty191 PMC6137996 24. Tarasov A Vilella AJ Cuppen E Nijman IJ Prins P Sambamba: fast processing of NGS alignment formats Bioinformatics 2015 31 12 2032 4 10.1093/bioinformatics/btv098 25697820 PMC4765878 Tarasov A, Vilella AJ, Cuppen E, Nijman IJ, Prins P. Sambamba: fast processing of NGS alignment formats. Bioinformatics. 2015;31(12):2032–4. 10.1093/bioinformatics/btv098. 25697820 10.1093/bioinformatics/btv098 PMC4765878 25. Akagi K RTCGD: retroviral tagged cancer gene database Nucleic Acids Res 2004 32 523 7 10.1093/nar/gkh013 PMC308748 14681473 Akagi K, et al. RTCGD: retroviral tagged cancer gene database. Nucleic Acids Res. 2004;32:523–7. 10.1093/nar/gkh013 PMC308748 14681473 26. Higgins M CancerGenes: a gene selection resource for cancer genome projects Nucleic Acids Res 2007 35 721 6 10.1093/nar/gkl811 PMC1781153 17088289 Higgins M, et al. CancerGenes: a gene selection resource for cancer genome projects. Nucleic Acids Res. 2007;35:721–6. 10.1093/nar/gkl811 PMC1781153 17088289 27. Huret J Atlas of genetics and cytogenetics in oncology and hematology, an interactive database Nucleic Acids Res 2000 28 1 349 51 10.1093/nar/28.1.349 10592271 PMC102493 Huret J, et al. Atlas of genetics and cytogenetics in oncology and hematology, an interactive database. Nucleic Acids Res. 2000;28(1):349–51. 10592271 10.1093/nar/28.1.349 PMC102493 28. Roberts L Patterns of somatic structural variation in human cancer genomes Nature 2020 578 7793 112 21 10.1038/s41586-019-1913-9 32025012 PMC7025897 Roberts L, et al. Patterns of somatic structural variation in human cancer genomes. Nature. 2020;578(7793):112–21. 32025012 10.1038/s41586-019-1913-9 PMC7025897 29. Vogelstein B Cancer genome landscapes Science 2013 339 6127 1546 58 10.1126/science.1235122 23539594 PMC3749880 Vogelstein B, et al. Cancer genome landscapes. Science. 2013;339(6127):1546–58. 23539594 10.1126/science.1235122 PMC3749880 30. Li C, Xia D, Ai H, Lee N, Andor C, Li NR, Zhang, Hanlee P, Ji. SVEngine: an efficient and versatile simulator of genome structural variations with features of cancer clonal evolution. GigaScience. July 2018;7:giy081. 10.1093/gigascience/giy081. 10.1093/gigascience/giy081 PMC6057526 29982625 31. Sergii Ivakhno C, Colombo S, Tanner P, Tedder S, Berri AJ, Cox. tHapMix: simulating tumour samples through haplotype mixtures, Bioinformatics 10.1093/bioinformatics/btw589 27605106 32. Semeraro R et al. Apr. Xome-Blender: A novel cancer genome simulator. PloS one vol. 13,4 e0194472. 5 2018, 10.1371/journal.pone.0194472 10.1371/journal.pone.0194472 PMC5886411 29621252 33. Qin M Liu B Conroy JM SCNVSim: somatic copy number variation and structure variation simulator BMC Bioinformatics 2015 16 66 10.1186/s12859-015-0502-7 25886838 PMC4349766 Qin M, Liu B, Conroy JM, et al. SCNVSim: somatic copy number variation and structure variation simulator. BMC Bioinformatics. 2015;16:66. 10.1186/s12859-015-0502-7. 25886838 10.1186/s12859-015-0502-7 PMC4349766 34. Becnel L An open access pilot freely sharing cancer genomic data from participants in Texas Sci Data 2016 3 160010 10.1038/sdata.2016.10 26882539 PMC4755126 Becnel L, et al. An open access pilot freely sharing cancer genomic data from participants in Texas. Sci Data. 2016;3:160010. 26882539 10.1038/sdata.2016.10 PMC4755126 35. Becker T Shin D Efficient methods for hierarchical multi-omic feature extraction and visualization Int J Data Min Bioinform 2020 23 4 285 98 10.1504/IJDMB.2020.108699 Becker T, Shin D. Efficient methods for hierarchical multi-omic feature extraction and visualization. Int J Data Min Bioinform. 2020;23(4):285–98. 36. Abyzov A CNVnator: an approach to discover, genotype, and characterize typical and atypical CNVs from family and population genome sequencing Genome Res 2011 21 974 84 10.1101/gr.114876.110 21324876 PMC3106330 Abyzov A, et al. CNVnator: an approach to discover, genotype, and characterize typical and atypical CNVs from family and population genome sequencing. Genome Res. 2011;21:974–84. 21324876 10.1101/gr.114876.110 PMC3106330 37. Belyeu J SV-plaudit: a cloud-based framework for manually curating thousands of structural variants GigaScience 2018 7 7 10.1093/gigascience/giy064 PMC6030999 29860504 Belyeu J, et al. SV-plaudit: A cloud-based framework for manually curating thousands of structural variants. GigaScience. 2018;7:7. 10.1093/gigascience/giy064 PMC6030999 29860504 38. Rausch T DELLY: structural variant discovery by integrated paired-end and split-read analysis Bioinformatics 2012 28 333 9 10.1093/bioinformatics/bts378 PMC3436805 22962449 Rausch T, et al. DELLY: structural variant discovery by integrated paired-end and split-read analysis. Bioinformatics. 2012;28:333–9. 10.1093/bioinformatics/bts378 PMC3436805 22962449 39. Chen X et al. Manta: rapid detection of structural variants and indels for germline and cancer sequencing applications. Bioinformatics 32(8):1220–2. 10.1093/bioinformatics/btv710 26647377 40. Cortés-Ciriano I Comprehensive analysis of chromothripsis in 2,658 human cancers using whole-genome sequencing Nat Genet 2020 52 3 331 41 10.1038/s41588-019-0576-7 32025003 PMC7058534 Cortés-Ciriano I, et al. Comprehensive analysis of chromothripsis in 2,658 human cancers using whole-genome sequencing. Nat Genet. 2020;52(3):331–41. 32025003 10.1038/s41588-019-0576-7 PMC7058534 41. Nielsen R Analyses of non-coding somatic drivers in 2658 cancer whole genomes Nature 2020 578 7793 102 11 32025015 10.1038/s41586-020-1965-x PMC7054214 Nielsen R, et al. Analyses of non-coding somatic drivers in 2,658 cancer whole genomes. Nature. 2020;578(7793):102–11. 32025015 10.1038/s41586-020-1965-x PMC7054214 42. Chen NC Reference flow: reducing reference bias using multiple population genomes Genome Biol 2021 22 8 10.1186/s13059-020-02229-3 33397413 PMC7780692 Chen NC, et al. Reference flow: reducing reference bias using multiple population genomes. Genome Biol. 2021;22:8. 33397413 10.1186/s13059-020-02229-3 PMC7780692 43. Cullot G CRISPR-Cas9 genome editing induces megabase-scale chromosomal truncations Nat Commun 2019 10 1 1136 10.1038/s41467-019-09006-2 30850590 PMC6408493 Cullot G, et al. CRISPR-Cas9 genome editing induces megabase-scale chromosomal truncations. Nat Commun. 2019;10(1):1136. 30850590 10.1038/s41467-019-09006-2 PMC6408493 44. National Institute of Child Health and Human Development. Gabriella Miller Kids First Pediatric Research Program. 2024. https://kidsfirstdrc.org/resources/ 45. Zhu M Need AC Han Y Ge D Maia JM Zhu Q Heinzen EL Cirulli ET Pelak K He M Ruzzo EK Gumbs C Singh A Feng S Shianna KV Goldstein DB Using ERDS to infer copy-number variants in high-coverage genomes Am J Hum Genet 2012 91 3 408 21 10.1016/j.ajhg.2012.07.004 22939633 PMC3511991 Zhu M, Need AC, Han Y, Ge D, Maia JM, Zhu Q, Heinzen EL, Cirulli ET, Pelak K, He M, Ruzzo EK, Gumbs C, Singh A, Feng S, Shianna KV, Goldstein DB. Using ERDS to infer copy-number variants in high-coverage genomes. Am J Hum Genet. 2012;91(3):408–21. Epub 2012 Aug 30. PMID: 22939633; PMCID: PMC3511991. 22939633 10.1016/j.ajhg.2012.07.004 PMC3511991 46. Garvin T Aboukhalil R Kendall J Interactive analysis and assessment of single-cell copy-number variations Nat Methods 2015 12 1058 60 10.1038/nmeth.3578 26344043 PMC4775251 Garvin T, Aboukhalil R, Kendall J, et al. Interactive analysis and assessment of single-cell copy-number variations. Nat Methods. 2015;12:1058–60. 10.1038/nmeth.3578. 26344043 10.1038/nmeth.3578 PMC4775251 47. Kuipers J Tuncel MA Ferreira PF Jahn K Beerenwinkel N Single-cell copy number calling and event history reconstruction Bioinformatics 2025 41 3 btaf072 10.1093/bioinformatics/btaf072 39946094 PMC11897432 Kuipers J, Tuncel MA, Ferreira PF, Jahn K, Beerenwinkel N. Single-cell copy number calling and event history reconstruction. Bioinformatics. 2025;41(3):btaf072. 10.1093/bioinformatics/btaf072. PMID: 39946094; PMCID: PMC11897432. 39946094 10.1093/bioinformatics/btaf072 PMC11897432 48. Zaccaria S Raphael BJ Characterizing allele- and haplotype-specific copy numbers in single cells with CHISEL Nat Biotechnol 2021 39 207 14 10.1038/s41587-020-0661-6 32879467 PMC9876616 Zaccaria S, Raphael BJ. Characterizing allele- and haplotype-specific copy numbers in single cells with CHISEL. Nat Biotechnol. 2021;39:207–14. 10.1038/s41587-020-0661-6. 32879467 10.1038/s41587-020-0661-6 PMC9876616 49. Ivanovic S El-Kebir M CNRein: an evolution-aware deep reinforcement learning algorithm for single-cell DNA copy number calling Genome Biol 2025 26 87 10.1186/s13059-025-03553-2 40197547 PMC11974095 Ivanovic S, El-Kebir M. CNRein: an evolution-aware deep reinforcement learning algorithm for single-cell DNA copy number calling. Genome Biol. 2025;26:87. 10.1186/s13059-025-03553-2. 40197547 10.1186/s13059-025-03553-2 PMC11974095 50. Mao Y Zhang GA complete, telomere-to-telomere human genome sequence presents new opportunities for evolutionary genomics Nat Methods 2022 19 635 8 10.1038/s41592-022-01512-4 35689027 Mao Y, Zhang GA. complete, telomere-to-telomere human genome sequence presents new opportunities for evolutionary genomics. Nat Methods. 2022;19:635–8. 10.1038/s41592-022-01512-4. 35689027 10.1038/s41592-022-01512-4 ",
  "metadata": {
    "Title of this paper": "complete, telomere-to-telomere human genome sequence presents new opportunities for evolutionary genomics",
    "Journal it was published in:": "BMC Genomics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482561/"
  }
}