{
  "title": "Paper_746",
  "abstract": "Cancer Res Cancer Res 319 nihpa Cancer research 0008-5472 1538-7445 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12477665 PMC12477665.1 12477665 12477665 NIHMS2110919 40911784 10.1158/0008-5472.CAN-25-0315 NIHMS2110919 NIHPA2110919 1 Article PAX3-FOXO1 drives targetable cell state-dependent metabolic vulnerabilities in rhabdomyosarcoma Paras Katrina I. 1 2 Brunner Julia S. 1 Montero Angela M. 1 2 Boyer Jacob A. 3 Jackson Benjamin T. 1 Chakraborty Sangita 1 Xie Abigail 1 Guillan Kristina 6 Siddiquee Armaan 6 Torres Lourdes Pajuelo 1 2 Rabinowitz Joshua D. 3 4 5 Kung Andrew L. 6 You Daoqi 6 Dela Cruz Filemon S. 6 Finley Lydia W. S. 1 * 1 2 3 4 5 6 * finleyl@mskcc.org Authors’ Contributions K.I.P. and L.W.S.F. conceived the study. K.I.P. carried out experiments with assistance from J.S.B., A.M.M., A.X., S.C., and L.P. K.I.P. conducted all computational analysis with assistance from B.T.J. K.G., A.S., D.Y., and F.D.C. assisted with PDX implantation and study design. J.A.B. and J.D.R. assisted with nucleotide analyses. K.I.P. and L.W.S.F. wrote the manuscript with input from all authors. K.I. Paras: Conceptualization, data curation, formal analysis, investigation, methodology, visualization, writing – original draft, writing – review & editing. J.S. Brunner: Investigation, methodology, visualization, writing – review & editing. A.M. Montero: Investigation, writing – review & editing. J.A. Boyer: Investigation. B.T. Jackson: Data curation, methodology, visualization, writing – review & editing. S. Chakraborty: Investigation. A. Xie: Investigation, writing – review & editing. K. Guillan: Investigation. A. Siddiquee: Investigation. L. Pajuelo Torres: Investigation. J. Rabinowitz: Resources. A.L. Kung: Resources. D. You: Methodology, project administration, resources. F.S. Dela Cruz: Methodology, project administration, resources. L.W.S. Finley: Conceptualization, formal analysis, funding acquisition, methodology, resources, supervision, visualization, writing – original draft, writing – review & editing. The authors declare no potential conflicts of interest. 05 9 2025 497744 10.1158/0008-5472.CAN-25-0315 24 09 2025 29 09 2025 30 09 2025 30 09 2025 PAX3-FOXO1 drives targetable cell state-dependent metabolic vulnerabilities in rhabdomyosarcoma 19 1 2025 2025.01.15.633227 bioRxiv PMC11761651 39868247 PAX3-FOXO1, an oncogenic transcription factor, drives a particularly aggressive subtype of rhabdomyosarcoma (RMS) by enforcing gene expression programs that support malignant cell states. Here we show that PAX3-FOXO1 + de novo + PAX3-FOXO1 + pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf yes pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "\nPAX3-FOXO1 drives targetable cell state-dependent metabolic vulnerabilities in rhabdomyosarcoma\n",
    "Journal it was published in:": "Cancer research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477665/"
  }
}