{
  "title": "Paper_595",
  "abstract": "pmc Nat Commun Nat Commun 2873 ncomms Nature Communications 2041-1723 Nature Publishing Group PMC12479768 PMC12479768.1 12479768 12479768 41022745 10.1038/s41467-025-63585-x 63585 1 Article A newborn derived monoclonal IgM antibody selectively modulates microbial metabolism in the gut He Zihan 1 Gong Shijie 1 Mu Fan 1 http://orcid.org/0000-0001-7294-042X Gu Qisheng 2 Kundu Parag 1 http://orcid.org/0000-0003-3539-4647 Gao Yi-Zhou gaoyizhou@yeah.net 1 http://orcid.org/0000-0002-1290-2592 Lo-Man Richard richard.loman@pm.me 1 Draheim Marion marion.draheim@yahoo.com 1 1 https://ror.org/034t30j35 grid.9227.e 0000 0001 1957 3309 The Center for Microbes, Development and Health, Shanghai Institute of Immunity and Infection, Chinese Academy of Sciences, 2 https://ror.org/00my25942 grid.452404.3 0000 0004 1808 0942 Fudan University Shanghai Cancer Center, 29 9 2025 2025 16 478256 8563 13 12 2024 22 8 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Metabolism and gut microbiota are essential for newborn health, influencing immune function, energy balance, and growth. Breast milk provides IgA, crucial for shaping gut microbiota in infants. In non-breastfed newborns, we observe the presence of IgM antibodies that can recognize various bacteria, influence bacterial clustering, and alter bacterial metabolism, such as carbon source utilization in vitro within small bacterial communities. Based on these findings, we developed a monoclonal IgM, M291, derived from a newborn-B cell, which mimics naturally occurring antibodies and could serve as a surrogate tool to modulate intestinal bacterial functions and metabolism. Oral administration of M291 alters the metabolome of germ-free mice colonized with a defined bacterial consortium or an infant gut microbiota, by modulating the bacterial transcriptome, while maintaining microbial abundance and diversity. This study establishes proof of concept for the design and application of newborn-derived antibodies to modulate microbial and host metabolism, including lipid metabolism and bile acid secretion, without significantly altering microbiota composition. Here, the authors characterize a newborn-derived monoclonal IgM, showing it influences bacterial clustering, gene expression, and metabolic activity, thereby modulating gut bacterial functions and host metabolism without altering microbiota composition. Subject terms Mucosal immunology Microbiome Metagenomics Antibodies https://doi.org/10.13039/501100011002 National Science Foundation of China | National Natural Science Foundation of China-Yunnan Joint Fund (NSFC-Yunnan Joint Fund) 32250410303 Draheim Marion pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction The intestinal metabolome, consisting of various low-molecular-weight metabolites including sugars, organic acids, and amino acids, is shaped by the combined effects of host metabolism and gut microbiota activities 1 2 3 The initial microbial colonization in the gut is crucial for the development and maturation of the intestinal mucosa and the immune system in neonates 4 5 4 6 7 9 10 12 10 13 14 15 16 Immunoglobulins (Igs) have been found to coat a significant portion of the gut microbiota 17 18 19 22 23 24 IgA is the predominant isotype present at mucosal surfaces in mammals, including the small intestine, where it is actively secreted 25 26 18 27 28 29 30 31 32 33 34 34 In the present study, we characterized intestinal antibodies during the first month of life by analyzing their microbial recognition and their impact on bacterial behavior both individually and within communities. Our findings show that neonatal IgM antibodies can modulate bacterial clusters and influence microbial abundance. We developed a newborn B-cell-derived monoclonal IgM pentameric antibody and investigated its interactions with microbial consortia in vitro as well as in vivo. Notably, we show that a single monoclonal IgM can alter the in vivo metabolome of germ-free mice colonized with neonatal microbiota—not by changing the overall microbial community structure, but by modulating bacterial functions. This study opens the scope for using mAbs as a novel therapeutic tool for shaping the intestinal milieu at the metabolic level. Results Characterization of newborn intestinal Ig during the first month of life In the intestinal lumen of formula-fed neonates during the first month of life, IgM was found to be the predominant Ig, whereas IgA levels increased over time (Fig. 1A 1A 1B 1C 1B 1 1C 1D Fig. 1 Characterization of Intestinal Secreted Neonatal Immunoglobulins During the First Month of Life. A B n n n n C D E. coli E E. faecalis F S. epidermidis G S. salivarius H B. bifidum I B. thetaiotaomicron J K E J L n C–L p B –J p p p p Intestinal Igs are known to coat bacteria 18 Enterococcus faecalis, Staphylococcus epidermidis, Streptococcus salivarius, Bifidobacteria bifidum Escherichia coli, Bacteroidetes thetaiotaomicron 1E–J 1D 1E–J 1K S1 C. perfringens E. cloacae S. aureus S. epidermidis L. crispatus E. faecium S. salivarius, B. thetaiotaomicron B. dorei B. thetaiotaomicron 1C 1L 1D 1D–F Firmicutes Actinobacteria Proteobacteria 1D Bifidobacteria 1E 1F 1D–L Newborn intestinal Igs affect bacterial community metabolism We subsequently evaluated the impact of early intestinal antibody isotypes on the neonatal bacterial community. We isolated secreted IgA (Nint_pA) and IgM (Nint_pM) from samples collected at week 3, and the binding capacity to PGN and LPS was assessed (Supplementary Fig. 2A, B 2A, B E. coli, E. faecalis, S. epidermidis, S. salivarius, B. bifidum B. thetaiotaomicron 2C 2A 2B E. coli, E. faecalis, S. epidermidis, S. salivarius B. thetaiotaomicron 2A, B Fig. 2 Impact of newborn intestinal immunoglobulins on bacterial clustering and microbial consortia. Indicated bacterial strains were cultured individually in AF medium in the presence of neonatal intestinal IgM (Nint_pM) ( A B C D E (A B, D n E p A B D E p We investigated the capacity of dimeric IgA and pentameric IgM in the gut to form diverse bacterial clusters through cross-species binding. Bacteria were labeled with fluorescent amino acids, and clustering was analyzed by FACS in the presence or absence of Igs (Supplementary Fig. 2D–F 2C E. coli, E. faecalis, S. epidermidis S. salivarius E. faecalis, S. salivarius B. bifidum E. faecalis S. epidermidis S. salivarius B. bifidum B. thetaiotaomicron ( 2C Bacterial clustering can influence microbial interactions, affecting growth, gene expression, and metabolic functions 35 36 2G B. thetaiotaomicron S. salivarius S. epidermidis B. bifidum 2D E.coli, E.faecalis, S.epidermidis B.bifidum 2E 2E In summary, we found that IgA and IgM are able to modulate individual bacterial cultures and modulate differentially bacterial metabolism. However, IgM have a stronger impact on bacterial aggregation and metabolism compared to IgA. Designing a newborn mAb to modulate bacterial functions We explored the impact of neonatal B cell-derived microbiota-reactive monoclonal mAbs, specifically BRG291-derived monomeric IgG (G291) 34 3A 3A 3B 3A 3B 3C–E 3B Fig. 3 Microbial reactivity of neonatal G291 and M291 mAbs. Monoclonal antibodies derived from BRG291, produced as monomeric IgG [G291] and pentameric IgM [M291], were evaluated by ELISA for their reactivity toward PGN ( A B C D E. coli, E. faecalis, S. epidermidis, S. salivarius, B. bifidum, and B. thetaiotaomicron A B C D E We assessed effects of G291 and M291 on individual bacterial cultures and the MIC6 consortium. No significant growth differences were observed with G291 on single bacterial cultures (Fig. 4A E. faecalis, S. salivarius, B. bifidum B. thetaiotaomicron 4B 4A 4B 4C S. epidermidis B. thetaiotaomicron 4C E. coli, E. faecalis, S. epidermidis S. salivarius B. thetaiotaomicron 4D 4E Fig. 4 Comparative effect of the pentameric and monomeric forms of a neonatal monoclonal antibody on bacterial clustering and carbon source utilization in vitro . Indicated A B C D E A B D n E n p A B , and D t E p Given that complement components in the intestinal lumen can be mobilized with or without antibody action to target bacteria 37 38 4D 4E 4D 4E These findings indicate that a pentameric mAb, like M291, had a greater influence over bacterial community behavior, affecting growth, carbon source utilization, and metabolite production, compared to its monomeric counterpart. Influence of M291 treatment on MIC6 colonization and metabolome To investigate the in vivo effects of M291 on gut colonization, we colonized germ-free (GF) mice with the MIC6 bacterial consortium. Mice were orally inoculated with MIC6, with a booster dose given on day 3. Colonization was confirmed on days 7 and 10 using quantitative PCR (qPCR), and the mice were euthanized 11 days after the initial gavage (Fig. 5A 5A B. bifidum B. thetaiotaomicron S. epidermidis E. faecalis S. salivarius E. coli 5B 5B 5A E.coli B. thetaiotaomicron B. bifidum 5B Fig. 5 Effect of M291 treatment on the metabolome of MIC6 colonized GF mice. A E. coli E. faecalis S. epidermidis S. salivarius B. bifidum B. thetaiotaomicron B n C D H D E F G H p We next analyzed the metabolites induced by MIC6 colonization. We identified nearly 1, 000 metabolites, revealing distinct metabolite profiles that enabled clear differentiation among the three groups (Fig. 5C 5B 5C 5D 5D 5E n n 5F Among lipids, fatty acyls were heavily promoted as they are key in energy storage or in hormone synthesis. Notably, steroids and their derivatives were found to be predominantly induced upon M291 treatment, which are essential for healthy development and functioning (Fig. 5G 5H 5H 5E Metabolites produced in M291-treated MIC6 colonized mice can affect bacterial functions To evaluate the overall impact of metabolomic changes on bacterial growth, we cultured individual bacterial strains with cecal content from GF mice. Growth rates were calculated relative to the GF_UC baseline. Application of the GF_Co_UN metabolome significantly enhanced the growth of B. bifidum S. epidermidis E. faecalis E. coli 6A 5H B. bifidum S. epidermidis E. faecalis E. coli B. thetaiotaomicron 6A B. thetaiotaomicron E. coli S. salivarius 6B E. coli S. salivarius 6C E. coli E. faecalis B. thetaiotaomicron 6B Fig. 6 Impact of metabolome from mAb treated colonized GF mice on in vitro bacterial culture. Indicated bacterial strains were cultured individually ( A B A, B n p p p p Influence of M291 treatment on newborn FMT and associated metabolome Using microbiota from non-breastfed newborns, we performed a fecal microbiota transplant (FMT) in GF mice, which were then treated with either M291 (GF_FMT_M291) or Nint_pM (GF_FMT_NintpM) as previously described, and compared them to untreated control (GF_FMT_UN) and uncolonized (GF_UC) groups (Fig. 7A 7B–D 7A, B E. faecalis, K. aerogenes C. butyricum C. paraputrificum B. breve E. fergusonii K. pneumoniae 7D 7A 7B 7C Fig. 7 Bacterial abundance and gene expression in GF mice following FMT colonization. A B C D E F G Monitoring of microbial colonization over the experimental period showed a clear dominance of C. butyricum K. aerogenes E. faecalis C. paraputrificum B. breve E. fergusonii E. fergusonii K. pneumoniae 7D C. butyricum K. aerogenes E. faecalis B. breve K. pneumoniae B. breve K. pneumoniae 7D As shown by bacterial gene sequencing analysis, the bacterial composition at the genus level in FMT samples differs from that in GF_FMT_UN. However, no significant differences were observed between GF_FMT_UN and GF_FMT_M291, as evidenced by the lack of clustering between these groups (Fig. 7E 7F 7E 7F 7G We therefore performed metabolite analysis of cecal content, revealing distinct clustering patterns between the four different groups (Fig. 8A 8A–C E. faecalis B. thetaiotaomicron E. coli E. coli 8A 8B S. epidermidis E. coli E. faecalis S. salivarius, B. bifidum B. thetaiotaomicron 8C 8D Fig. 8 Differential impact of FMT and M291 on the metabolome of colonized germ-free mice. A 7A B C D E F p G n p p p Following FMT colonization, 1360 metabolites were identified in GF mice, of which 510 were differentially expressed, with 148 metabolites being upregulated as a result of the FMT colonization (Supplementary Fig. 8E 8F 8G 8H 8H 8B 8C 8D 8E Upon analyzing the secondary class pathways following M291 treatment, we observed the up-regulation of 17 pathways, with 2 remaining unchanged and 11 being down-regulated. Among the down-regulated pathways, we focused on the linoleic acid (LA) metabolism (Fig. 8F 39 40 41 8G 8G 8G Metabolomic analysis indicates that M291 treatment significantly alters the metabolic profile, of the gut particularly enhancing lipid metabolism. The treatment also differentially impacts the growth of specific bacterial species within the MIC6 community, suggesting a complex interplay between bacterial growth and metabolic activity. These findings underscore the potential of targeted metabolic interventions in modulating gut microbiota functions, with implications for therapeutic strategies in gut-related disorders. Discussion This study provides novel insights into the role of neonatal IgM antibodies with broad microbial reactivities in modulating the interplay between gut microbiota and host metabolism. We developed the pentameric M291 mAb that exerts distinct effects on bacterial growth and functions, metabolic pathways, without significantly disrupting the microbial community structure. This suggests its therapeutic potential as a modulator of gut metabolism, with implications for early-life development and long-term health outcomes. Upon birth, neonates are exposed to microorganisms that initiate the colonization. The balance between pathogen defense and minimal inflammation is critical for establishing symbiotic relationships with commensal bacteria. We characterized gut-secreted antibodies, their binding capacity to various microbial species and their potential influence on gut colonization 42 B. thetaiotaomicron 43 28 29 34 Recently, a mouse monoclonal IgA (W27) has been demonstrated to modulate gut microbiota by selectively inhibiting the growth of certain bacteria, such as E.coli L. casei 44 B. bifidum B. thetaiotaomicron B. thetaiotaomicron B. breve B. longum 45 . B. fragilis B. longum Bifidobacterium Bifidobacterium spp 46 47 47 Our findings suggest that the metabolites produced in response to M291 treatment serve as modulatory factors, shaping bacterial physiology and interspecies interactions. Utilizing a GF mouse model, we demonstrated the impact of mAb treatment on the metabolome while bacterial composition remained similar between groups. With two distinct consortia, we observed a differential impact of mAb treatment on the metabolome, adjusted according to the bacterial species used as colonizers of GF mice. Using a well-defined community composed of E. coli, E. faecalis, S. salivarius, S. epidermidis, B. bifidum B. thetaiotaomicron 48 49 50 Effect of M291 on lipid-related molecules like prenol lipids and steroids shows it can adjust the interaction between the host and microbes’ metabolisms. M291 also affected LA metabolism, which is important for gut health. It lowered LA levels and changed the AA pathway. AA is a key fatty acid that helps with gut health by producing substances like prostaglandins and leukotrienes, which control inflammation and immune reactions 51 52 B. breve 39 39 These metabolites are important for immune control and keeping tissues healthy, so effect of M291 on LA metabolism might be important for gut health and overall immunity 53 The relevance of our findings is underscored by the analysis of metabolites generated from consortia comprising bacteria not typically associated with FMT. This is illustrated by the effect of metabolites from M291-treated GF mice on the utilization of carbon sources by the MIC6 community. This shows that M291 treatment can influence the metabolism of bacteria, directly or indirectly, through metabolite interactions. Metatranscriptomic analysis demonstrates a change in bacterial metabolism, due to a differential bacterial gene expression upon treatment. A capsular polysaccharide Ab has been shown to change the gene expression of S. pneumoniae 54 Our results show that antibodies can change how the gut microbiota works, as seen by increased activity in metabolic pathways, including those for lipids and proteins, when treated with mAb. The activation of BAs secretion pathways also shows the complex interaction between the host’s factors and microbial metabolism, which is important for nutrient absorption and health. Mechanisms involve microbiota-dependent changes in bile acid metabolism, affecting signaling through bile acid receptors such as FXR and TGR5 55 56 57 L. paracasei E. coli 58 59 Monoclonals have greatly developed highlighting their therapeutic applications across various diseases, including cancer and infectious diseases 60 61 We demonstrate the potential of neonatal-derived antibodies as tools for therapeutic intervention in the gut. By modulating specific bacterial behaviors and metabolic pathways, mAb like M291 offer a targeted approach to restoring or enhancing gut homeostasis. This approach is particularly relevant in the context of microbiota gut colonization, where interventions to prevent dysbiosis could have lifelong health benefits. The ability of M291 to selectively influence metabolomic profiles without disrupting microbial diversity further underscores its potential for safe and effective modulation of the gut environment. However, because only a single monoclonal antibody (M291) was evaluated, we cannot yet generalize these observations to other antibody clones or isotypes, and systematic screens will be required to define structure–function relationships across the broader neonatal antibody repertoire. Therefore, antibodies targeting microbiota act as modulators of microbial metabolism, affecting bacterial dynamics and ecosystem balance. Future studies should explore the applicability of such interventions in models of neonates, dysbiosis, disease, as well as the potential synergistic effects of combining mAb treatments with dietary or probiotic strategies. Methods Inclusion and ethics statements This research follows the guidelines of inclusion and ethics by Nature Communications. All authors have fulfilled the authorship criteria. Preparation of newborn fecal samples Fecal samples for intestinal IgM/IgA analysis were obtained from formula-fed healthy newborns during the first month of life with the written consent of the parents under the approval No. 2022-IPID-01. Fecal samples were resuspended at 100 mg/ml in cold sterile PBS and homogenized by pipetting and vortexing. Fibers were spun down at 500 × g g Newborn intestinal Ig purification Newborn fecal samples with an IgA:IgM ratio of 1:2 from three samples of Week 2 and Week 3 (days 12, 15 and 19) were pooled, and IgA were purified by affinity chromatography using Peptide M agarose (gel-pdm-5) stack into Poly-Prep® Chromatography Columns (7311550; Bio-Rad). After IgA purification, the flow-through from the Peptide M agarose column was used for IgM precipitation. An equal volume of saturated ammonium sulfate solution was added to the flow-through to achieve a final concentration of 50% ammonium sulfate. The mixture was incubated overnight at 4 °C with continuous stirring. The precipitate was collected by centrifugation at 10,000 × g ELISA Bacterial recognition was measured by ELISA as previously described 62 Production of G291 and M291 monoclonal antibodies BRG291 sequences were selected from our previous study 34 34 34 Bacterial strains All bacterial strains were procured from the Chinese Human Gut Microbial Biobank (hGMB). E. coli, E. faecalis, S. epidermidis, S. salivarius, B. bifidum B. thetaiotaomicron 34 Bacterial medium and growth conditions Bacterial strains were obtained from different sources and cultured in AF media adapted from 63 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${{\\rm{Growth}}}(\\%)=\\frac{{{\\rm{bacteria\\; growth}}}({{\\rm{OD}}}) * 100}{{average\\; of\\; bacterial\\; growth\\; in\\; PBS}({OD})}$$\\end{document} Growth ( % ) = bacteria growth ( OD ) * 100 a v e r a g e o f b a c t e r i a l g r o w t h i n P B S ( O D ) Synthetic MIC6 bacterial consortia cultures Synthetic bacterial community was cultured as previously described 63 E. coli, E. faecalis, S. epidermidis, S. salivarius, Bifidobacterium bifidum . thetaiotaomicron 600 E. coli E. faecalis S. epidermidis S. salivarius B. bifidum B. thetaiotaomicron Microbial ecological cultures Community–level physiological profiling has been performed to monitor changes in MIC culture performed in an anaerobic chamber using the Biolog EcoPlate system, which contains 31 independent carbon sources that are useful for their metabolism. The metabolic fingerprint reaction patterns is monitored by following the respiration that rapidly reduces the tetrazolium dye included with the carbon source and was measured by OD at 590 nm. Fluorescent bacterial labeling Bacterial strains were grown individually until reaching the exponential phase and diluted to OD 600 64 Analysis of bacterial coated antibodies Fluorescent bacteria were pooled at 2 µL for each strain. To measure IgM- and IgA-coated intestinal bacteria, 5 µL of microbial pellets were resuspended in PBS. The bacterial suspensions were passed through a 40 µm cell strainer to eliminate aggregates and ensure uniformity. Fluorescent bacterial mixes (E. coli E. faecalis S. epidermidis S. salivarius B. bifidum B. thetaiotaomicron Extraction of DNA from bacteria DNA from 1 ml of a single bacterial culture or from synthetic consortia was extracted using the E.Z.N.A bacterial kit (Omega, D3350) following the manufacturer’s instructions. Briefly, bacteria pellets were incubated with 100 µl of TE buffer and 10 µl of lysozyme for 10 min at 37 °C. For Gram-positive bacteria and synthetic consortia, this step was directly followed by a glass bead lysis 5 min at a maximum of speed. Supernatants were incubated with 100 µl of BTL and 20 µl protease K at 55 °C for 1 h to disrupt the cell wall, and 5 µl of RNase A was added, mix gently and incubate RT for 5 min. After spinning, supernatants were incubated 10 min at 60 °C with 220 µl of BDL buffer and transfer into the provided column t after adding 220 µl of ethanol 75%. After spinning, flow through were discard and 500 µl of HBC was added to the column before 2 steps of wash. DNA were then eluted using elution buffer pre-warmed at 65 °C and the DNA amount was measured at 260 and 280 nm. Real-time quantitative PCR Real-time qPCR was performed using an ABI Quantstudio Sequence Detection System apparatus. The qPCR reaction mixture (20 µ µ E. coli 65 E. faecalis E. faecalis- 66 S. epidermidis S. epidermidis 67 S. salivarius S. salivarius 68 B. thetaiotaomicron B. thetaiotaomicron 69 B. bifidum B. bifidum 70 Determination of copy number Bacterial suspensions were plated on AF agar plates ON 37 °C with serial dilutions from OD 600 –3 –8 Germ-free mouse colonization and treatment Animal experiments were approved by the ethical committee (Ethical Approval No. A2023025). 6 weeks old Germ free male C57Bl/6 mice were kept in cage setups with autoclaved food and water to minimize unwanted cross-contaminations in 12 light/12 dark cycles with 18-23 °C with 40-60% humidity. Mice and the environment were tested to confirm germ-free conditions. Mice were orally administered with 150 µl of MIC6 consortium (10 9 9 71 Preparation of cecal content for metabolome analysis and bacterial culture Caecum from mice were retrieved and weighted. Cecal content was homogenized in cold sterile PBS at 1 g/ml. Homogenate was spun down at 10,000 × g for 10 min at 4degres. Supernatant were collected and analyzed for metabolome content. Pellets and 0.22 µm filtered supernatants were aliquoted individually and immediately frozen at −80 °C for bacterial growth experiments. Metabolomics Supernatants were prepared from the caecum as described above. The sample (100 µL) was thoroughly mixed with 400 µL of cold methanol acetonitrile (v/v, 1:1) via vortexing. Then, the mixture was processed with sonication for 1 h in an ice bath. The mixture was then incubated at −20 °C for 1 h and centrifuged at 4 °C for 20 min at a speed of 14,000 g. The supernatants were then harvested and dried under vacuum for LC-MS analysis. UHPLC-MS/MS analysis. Metabolomics profiling was analyzed using a UPLC-ESI-Q-Orbitrap-MS system (UHPLC, Shimadzu Nexera X2 LC-30AD, Shimadzu, Japan) coupled with Q-Exactive Plus (Thermo Scientific, San Jose, USA). For liquid chromatography (LC) separation, samples were analyzed using the ACQUITY UPLC® HSS T3 column (2.1×100 mm, 1.8 μm) (Waters, Milford, MA, USA). The flow rate was 0.3 mL/min, and the mobile phase contained A: 0.1% FA in water and B: 100% acetonitrile (ACN). The gradient was 0% buffer B for 2 min and linearly increased to 48% in 4 min, then up to 100% in 4 min and maintained for 2 min, then decreased to 0% buffer B in 0.1 min, with a 3 min re-equilibration period employed. The electrospray ionization (ESI) with positive and negative modes was applied for MS data acquisition separately. The HESI source conditions were set as follows: Spray Voltage: 3.8 kv (positive) and 3.2 kv (negative); Capillary Temperature: 320 °C; Sheath Gas (nitrogen) Flow: 30 arb (arbitrary units); Aux Gas Flow: 5 arb; Probe Heater Temp: 350 °C; S-Lens RF Level: 50. The instrument was set to acquire over the m/z range 70-1050 Da for full MS. The full MS scans were acquired at a resolution of 70,000 at m/z 200, and 17,500 at m/z 200 for the MS/MS scan. The maximum injection time was set to 100 ms for MS and 50 ms for MS/MS. The isolation window for MS2 was set to 2 m/z, and the normalized collision energy (stepped) was set as 20, 30, and 40 for fragmentation. Data preprocessing and filtering. The raw MS data were processed using MS-DIAL for peak alignment, retention time correction, and peak area extraction. The metabolites were identified by accurate mass (mass tolerance <10 ppm) and MS/MS data (mass tolerance <0.02 Da), which were matched with HMDB, MassBank, and other public databases and our self-built metabolite standard library. In the extracted-ion features, only the variables having more than 50% of the nonzero measurement values in at least one group were kept. KEGG enrichment analysis. To identify the perturbed biological pathways, the differential metabolite data were subjected to KEGG pathway analysis using the KEGG database ( http://www.kegg.jp Sequencing of fecal samples Total microbial genomic DNA was extracted from mouse fecal samples using the FastPure Stool DNA Isolation Kit (MJYH, Shanghai, China) according to manufacturer’s instructions. The quality and concentration of DNA were determined by 1.0% agarose gel electrophoresis and a NanoDrop® ND-2000 spectrophotometer (Thermo Scientific Inc., USA) and kept at −80 °C prior to further use. The hypervariable region V3-V4 of the bacterial 16S rRNA gene were amplified with primer pairs 338 F (5’-ACTCCTACGGGAGGCAGCAG-3’) and 806 R (5’-GGACTACHVGGGTWTCTAA T-3’) by a T100 Thermal Cycler (BIO-RAD, USA). The PCR reaction mixture including 4 μL 5 × Fast Pfu buffer, 2 μL 2.5 mM dNTPs, 0.8 μL each primer (5 μM), 0.4 μL Fast Pfu polymerase, 10 ng of template DNA, and ddH2O to a final volume of 20 µL. PCR amplification cycling conditions were as follows: initial denaturation at 95 °C for 3 min, followed by 27 cycles of denaturing at 95 °C for 30 s, annealing at 55 °C for 30 s, and extension at 72 °C for 45 s, and a single extension at 72 °C for 10 min, and end at 4 °C. All samples were amplified in triplicate. The PCR product was extracted from 2% agarose gel and purified. Then quantified using Synergy HTX (Biotek, USA). Purified amplicons were pooled in equimolar amounts and paired-end sequenced on an Illumina NextSeq 2000 PE300 platform (Illumina, San Diego, USA) according to the standard protocols by Majorbio Bio-Pharm Technology Co. Ltd. (Shanghai, China). Sequencing for metatranscriptomics Total RNA was extracted from the tissue using TRIzol® Reagent according to the manufacturer’s instructions. Then RNA quality was determined by the 5300 Bioanalyser (Agilent) and quantified using the ND-2000 (NanoDrop Technologies). Only high-quality RNA sample (OD260/280 = 1.8 ~ 2.2, OD260/230 ≥ 2.0, RQN ≥ 6.5, 28S:18S ≥ 1.0, >1 μg) was used to construct sequencing library. RNA purification, reverse transcription, library construction, and sequencing were performed at Shanghai Majorbio Bio-pharm Biotechnology Co., Ltd. (Shanghai, China) according to the manufacturer’s instructions. The RNA-seq transcriptome library was prepared following Illumina® Stranded mRNA Prep, Ligation (San Diego, CA) using 1 μg of total RNA. Shortly, messenger RNA was isolated according to the polyA selection method by oligo (dT) beads, and then fragmented by the fragmentation buffer first. Secondly, double-stranded cDNA was synthesized using a SuperScript double-stranded cDNA synthesis kit (Invitrogen, CA) with random hexamer primers. Then the synthesized cDNA was subjected to end-repair, phosphorylation, and adapter addition according to library construction protocol. Libraries were size-selected for cDNA target fragments of 300 bp on 2% Low Range Ultra Agarose, followed by PCR amplification using Phusion DNA polymerase (NEB) for 15 PCR cycles. After quantification by Qubit 4.0, the sequencing library was performed on the NovaSeq X Plus platform (PE150) using the NovaSeq Reagent Kit. The raw paired-end reads were trimmed and quality controlled by fastp with default parameters. Then clean reads were separately aligned to the reference genome with orientation mode using HISAT2 software. The mapped reads of each sample were assembled by StringTie in a reference-based approach. To identify DEGs (differential expression genes) between two different samples, the expression level of each transcript was calculated according to the transcripts per million reads (TPM) method. RSEM was used to quantify gene abundances. Essentially, differential expression analysis was performed using the DESeq2 or DEGseq. DEGs with |log2FC | ≧1 and FDR <0.05(DESeq2) or FDR < 0.001(DEGseq) were considered to be significantly different expressed genes. In addition, functional-enrichment analysis, including GO and KEGG were performed to identify which DEGs were significantly enriched in GO terms and metabolic pathways at a Bonferroni-corrected P Data and statistical analysis Analyses were performed using GraphPad Prism (v 8.3.0). AUC of bacterial recognition of mAbs was calculated using R function smplot2::sm_auc_all (v 0.1.0)82 8 9, and the background AUC, which was calculated as the mean of the three lowest values in each assay, was subtracted. R function sva::ComBat (v 3.48.0)83 was applied to remove the batch effect of experiments14. Heatmaps were plotted using R package 12 pheatmap (v 1.0.12) or using Prism GraphPad v9. The number of donors and experiments and methods of tests were indicated in each Fig. legend. Statistical significance of difference between groups were tested using Student’s t test or Mann-Whitney test according to test requirements. Error bars represent SD and P P Statistics and reproducibility Sample sizes were determined by the availability of specimens. All statistical analyses were conducted using GraphPad Prism 9.5.0. Sample sizes ( n P P P P P Reporting summary Further information on research design is available in the Nature Portfolio Reporting Summary Supplementary information  Supplementary Information Reporting Summary Transparent Peer Review file Publisher’s note These authors contributed equally: Zihan He, Shijie Gong. Supplementary information The online version contains supplementary material available at 10.1038/s41467-025-63585-x. Acknowledgements We would like to express our gratitude to Dr. H. Mouquet and Dr. C. Planchais for generously providing B-cell repertoire sequences. We also extend our thanks to Zhao Liang for the invaluable support provided throughout the project. This research was financially supported by the National Natural Science Foundation of China (Grant No. 32250410303) and Shanghai Sailing program (No. 22YF1454400), and we acknowledge the support received by M.D. and R.L.M. through the MOST Expert program. The authors declare no competing financial interests. Author contributions Conceptualization, M.D., R.L.M.; methodology, ZH.H., SJ.G., F.M., and P.K.; formal analysis, ZH.H., SJ.G., and F.M.; investigation, ZH.H., S.J.G., Q.S.G., and F.M.; resources, P.K., M.D., R.L.M., Y.Z.G.; writing, M.D., R.L.M., Y.Z.G.; review and editing, P.K.; funding acquisition, Y.Z.G., M.D., and R.L.M.; supervision, M.D. and R.L.M. Peer review Peer review information Nature Communications Data availability The metatranscriptomics, 16S RNA sequencing and the untargeted metabolome data generated in this study have been deposited in the BioProject Database of the National Centre for Biotechnology Information under the following accession codes: PRJCA036969 https://ngdc.cncb.ac.cn/search/specific?db=bioproject&q=PRJCA036969 https://ngdc.cncb.ac.cn/search/specific?db=bioproject&q=PRJCA036997 https://ngdc.cncb.ac.cn/search/specific?db=bioproject&q=PRJCA036996 Competing interests The authors declare no competing interests. References 1. Aburto MR Cryan JF Gastrointestinal and brain barriers: unlocking gates of communication across the microbiota-gut-brain axis Nat. Rev. Gastroenterol. Hepatol. 2024 21 222 247 10.1038/s41575-023-00890-0 38355758 Aburto, M. R. & Cryan, J. F. Gastrointestinal and brain barriers: unlocking gates of communication across the microbiota-gut-brain axis. Nat. Rev. Gastroenterol. Hepatol. 21 38355758 10.1038/s41575-023-00890-0 2. Noecker C Turnbaugh PJ Emerging tools and best practices for studying gut microbial community metabolism Nat. Metab. 2024 6 1225 1236 10.1038/s42255-024-01074-z 38961185 Noecker, C. & Turnbaugh, P. J. Emerging tools and best practices for studying gut microbial community metabolism. Nat. Metab. 6 38961185 10.1038/s42255-024-01074-z 3. Oliphant K Allen-Vercoe E Macronutrient metabolism by the human gut microbiome: major fermentation by-products and their impact on host health Microbiome 2019 7 91 10.1186/s40168-019-0704-8 31196177 PMC6567490 Oliphant, K. & Allen-Vercoe, E. Macronutrient metabolism by the human gut microbiome: major fermentation by-products and their impact on host health. Microbiome 7 31196177 10.1186/s40168-019-0704-8 PMC6567490 4. Lee, J. K., Hern Tan, L. T., Ramadas, A., Ab Mutalib, N. S. & Lee, L.H. Exploring the Role of Gut Bacteria in Health and Disease in Preterm Neonates. Int. J. Environ. Res. Public Health 17 10.3390/ijerph17196963 PMC7579082 32977611 5. Bharadia L Agrawal N Joshi N Development and Functions of the Infant Gut Microflora: Western vs. Indian Infants Int J. Pediatr. 2020 2020 7586264 10.1155/2020/7586264 32454840 PMC7229554 Bharadia, L., Agrawal, N. & Joshi, N. Development and Functions of the Infant Gut Microflora: Western vs. Indian Infants. Int J. Pediatr. 2020 32454840 10.1155/2020/7586264 PMC7229554 6. Laursen, M. F., Bahl, M. I. & Licht, T. R. Settlers of our inner surface - factors shaping the gut microbiota from birth to toddlerhood. FEMS Microbiol. Rev 45 10.1093/femsre/fuab001 PMC8371275 33428723 7. Coker MO Infant Feeding Alters the Longitudinal Impact of Birth Mode on the Development of the Gut Microbiota in the First Year of Life Front. Microbiol. 2021 12 642197 10.3389/fmicb.2021.642197 33897650 PMC8059768 Coker, M. O. et al. Infant Feeding Alters the Longitudinal Impact of Birth Mode on the Development of the Gut Microbiota in the First Year of Life. Front. Microbiol. 12 33897650 10.3389/fmicb.2021.642197 PMC8059768 8. Kapourchali FR Cresci GAM Early-life gut microbiome-the importance of maternal and infant factors in its establishment Nutr. Clin. Pr. 2020 35 386 405 10.1002/ncp.10490 32329544 Kapourchali, F. R. & Cresci, G. A. M. Early-life gut microbiome-the importance of maternal and infant factors in its establishment. Nutr. Clin. Pr. 35 10.1002/ncp.10490 32329544 9. Tamburini S Shen N Wu HC Clemente JC The microbiome in early life: implications for health outcomes Nat. Med. 2016 22 713 722 10.1038/nm.4142 27387886 Tamburini, S., Shen, N., Wu, H. C. & Clemente, J. C. The microbiome in early life: implications for health outcomes. Nat. Med. 22 27387886 10.1038/nm.4142 10. Brennan CA Garrett WS Gut Microbiota, Inflammation, and Colorectal Cancer Annu Rev. Microbiol 2016 70 395 411 10.1146/annurev-micro-102215-095513 27607555 PMC5541233 Brennan, C. A. & Garrett, W. S. Gut Microbiota, Inflammation, and Colorectal Cancer. Annu Rev. Microbiol 70 27607555 10.1146/annurev-micro-102215-095513 PMC5541233 11. Hills, R. D., Jr. et al. Gut Microbiome: Profound Implications for Diet and Disease. Nutrients 11 10.3390/nu11071613 PMC6682904 31315227 12. Singh RK Influence of diet on the gut microbiome and implications for human health J. Transl. Med. 2017 15 73 10.1186/s12967-017-1175-y 28388917 PMC5385025 Singh, R. K. et al. Influence of diet on the gut microbiome and implications for human health. J. Transl. Med. 15 28388917 10.1186/s12967-017-1175-y PMC5385025 13. Tun HM Roles of birth mode and infant gut microbiota in intergenerational transmission of overweight and obesity from mother to offspring JAMA Pediatr. 2018 172 368 377 10.1001/jamapediatrics.2017.5535 29459942 PMC5875322 Tun, H. M. et al. Roles of birth mode and infant gut microbiota in intergenerational transmission of overweight and obesity from mother to offspring. JAMA Pediatr. 172 29459942 10.1001/jamapediatrics.2017.5535 PMC5875322 14. Francis AP Dominguez-Bello MG Early-life microbiota perturbations and behavioral effects Trends Microbiol 2019 27 567 569 10.1016/j.tim.2019.04.004 31103277 Francis, A. P. & Dominguez-Bello, M. G. Early-life microbiota perturbations and behavioral effects. Trends Microbiol 27 31103277 10.1016/j.tim.2019.04.004 15. Arrieta MC Early infancy microbial and metabolic alterations affect risk of childhood asthma Sci. Transl. Med 2015 7 307ra152 10.1126/scitranslmed.aab2271 26424567 Arrieta, M. C. et al. Early infancy microbial and metabolic alterations affect risk of childhood asthma. Sci. Transl. Med 7 26424567 10.1126/scitranslmed.aab2271 16. Hoskinson C Delayed gut microbiota maturation in the first year of life is a hallmark of pediatric allergic disease Nat. Commun. 2023 14 4785 10.1038/s41467-023-40336-4 37644001 PMC10465508 Hoskinson, C. et al. Delayed gut microbiota maturation in the first year of life is a hallmark of pediatric allergic disease. Nat. Commun. 14 37644001 10.1038/s41467-023-40336-4 PMC10465508 17. Janzon, A. et al. Interactions between the Gut Microbiome and Mucosal Immunoglobulins A, M, and G in the Developing Infant Gut. mSystems 4 10.1128/mSystems.00612-19 PMC6880043 31771976 18. Magri G Human secretory IgM emerges from plasma cells clonally related to gut memory B cells and targets highly diverse commensals Immunity 2017 47 118 134.e118 10.1016/j.immuni.2017.06.013 28709802 PMC5519504 Magri, G. et al. Human secretory IgM emerges from plasma cells clonally related to gut memory B cells and targets highly diverse commensals. Immunity 47 28709802 10.1016/j.immuni.2017.06.013 PMC5519504 19. Bunker JJ Innate and Adaptive Humoral Responses Coat Distinct Commensal Bacteria with Immunoglobulin A Immunity 2015 43 541 553 10.1016/j.immuni.2015.08.007 26320660 PMC4575282 Bunker, J. J. et al. Innate and Adaptive Humoral Responses Coat Distinct Commensal Bacteria with Immunoglobulin A. Immunity 43 26320660 10.1016/j.immuni.2015.08.007 PMC4575282 20. Mantis NJ Rol N Corthesy B Secretory IgA’s complex roles in immunity and mucosal homeostasis in the gut Mucosal. Immunol. 2011 4 603 611 10.1038/mi.2011.41 21975936 PMC3774538 Mantis, N. J., Rol, N. & Corthesy, B. Secretory IgA’s complex roles in immunity and mucosal homeostasis in the gut. Mucosal. Immunol. 4 21975936 10.1038/mi.2011.41 PMC3774538 21. Palm NW Immunoglobulin A coating identifies colitogenic bacteria in inflammatory bowel disease Cell 2014 158 1000 1010 10.1016/j.cell.2014.08.006 25171403 PMC4174347 Palm, N. W. et al. Immunoglobulin A coating identifies colitogenic bacteria in inflammatory bowel disease. Cell 158 25171403 10.1016/j.cell.2014.08.006 PMC4174347 22. Viladomiu, M. et al. IgA-coated E. coli enriched in Crohn’s disease spondyloarthritis promote T(H)17-dependent inflammation. Sci. Transl.Med 9 10.1126/scitranslmed.aaf9655 PMC6159892 28179509 23. Peterson DA McNulty NP Guruge JL Gordon JI IgA response to symbiotic bacteria as a mediator of gut homeostasis Cell Host Microbe 2007 2 328 339 10.1016/j.chom.2007.09.013 18005754 Peterson, D. A., McNulty, N. P., Guruge, J. L. & Gordon, J. I. IgA response to symbiotic bacteria as a mediator of gut homeostasis. Cell Host Microbe 2 18005754 10.1016/j.chom.2007.09.013 24. Rollenske T Parallelism of intestinal secretory IgA shapes functional microbial fitness Nature 2021 598 657 661 10.1038/s41586-021-03973-7 34646015 Rollenske, T. et al. Parallelism of intestinal secretory IgA shapes functional microbial fitness. Nature 598 34646015 10.1038/s41586-021-03973-7 25. Bunker JJ Bendelac A IgA responses to microbiota Immunity 2018 49 211 224 10.1016/j.immuni.2018.08.011 30134201 PMC6107312 Bunker, J. J. & Bendelac, A. IgA responses to microbiota. Immunity 49 30134201 10.1016/j.immuni.2018.08.011 PMC6107312 26. Bunker, J. J. et al. Natural polyreactive IgA antibodies coat the intestinal microbiota. Science 358 10.1126/science.aan6619 PMC5790183 28971969 27. Wei H Wang JY Role of Polymeric Immunoglobulin Receptor in IgA and IgM Transcytosis Int J. Mol. Sci. 2021 22 2284 10.3390/ijms22052284 33668983 PMC7956327 Wei, H. & Wang, J. Y. Role of Polymeric Immunoglobulin Receptor in IgA and IgM Transcytosis. Int J. Mol. Sci. 22 33668983 10.3390/ijms22052284 PMC7956327 28. Kuitunen M Savilahti E Mucosal IgA, mucosal cow’s milk antibodies, serum cow’s milk antibodies and gastrointestinal permeability in infants Pediatr. Allergy Immunol. 1995 6 30 35 10.1111/j.1399-3038.1995.tb00254.x 7550762 Kuitunen, M. & Savilahti, E. Mucosal IgA, mucosal cow’s milk antibodies, serum cow’s milk antibodies and gastrointestinal permeability in infants. Pediatr. Allergy Immunol. 6 7550762 10.1111/j.1399-3038.1995.tb00254.x 29. Rognum TO Thrane S Stoltenberg L Vege A Brandtzaeg P Development of intestinal mucosal immunity in fetal life and the first postnatal months Pediatr. Res 1992 32 145 149 10.1203/00006450-199208000-00003 1508603 Rognum, T. O., Thrane, S., Stoltenberg, L., Vege, A. & Brandtzaeg, P. Development of intestinal mucosal immunity in fetal life and the first postnatal months. Pediatr. Res 32 1508603 10.1203/00006450-199208000-00003 30. Schuurman HJ Hagenaars AM Zegers BJ Cord serum levels of IgM, IgA, and alpha-fetoprotein and their interrelationships Clin. Chim. Acta 1977 79 363 369 10.1016/0009-8981(77)90430-2 70285 Schuurman, H. J., Hagenaars, A. M. & Zegers, B. J. Cord serum levels of IgM, IgA, and alpha-fetoprotein and their interrelationships. Clin. Chim. Acta 79 70285 10.1016/0009-8981(77)90430-2 31. Cheng MM Development of serum IgA and IgM levels in breast-fed and formula-fed infants during the first week of life Early Hum. Dev. 2012 88 743 745 10.1016/j.earlhumdev.2012.03.005 22784936 Cheng, M. M. et al. Development of serum IgA and IgM levels in breast-fed and formula-fed infants during the first week of life. Early Hum. Dev. 88 22784936 10.1016/j.earlhumdev.2012.03.005 32. Granger CL Secretory immunoglobulin A in preterm infants: determination of normal values in breast milk and stool Pediatr. Res. 2022 92 979 986 10.1038/s41390-021-01930-8 34952939 Granger, C. L. et al. Secretory immunoglobulin A in preterm infants: determination of normal values in breast milk and stool. Pediatr. Res. 92 34952939 10.1038/s41390-021-01930-8 33. Fitzsimmons SP Immunoglobulin A subclasses in infants’ saliva and in saliva and milk from their mothers J. Pediatr. 1994 124 566 573 10.1016/S0022-3476(05)83135-X 8151471 Fitzsimmons, S. P. et al. Immunoglobulin A subclasses in infants’ saliva and in saliva and milk from their mothers. J. Pediatr. 124 8151471 10.1016/s0022-3476(05)83135-x 34. Gu Q Intestinal newborn regulatory B cell antibodies modulate microbiota communities Cell Host Microbe 2024 32 1787 1804.e1789 10.1016/j.chom.2024.08.010 39243760 Gu, Q. et al. Intestinal newborn regulatory B cell antibodies modulate microbiota communities. Cell Host Microbe 32 39243760 10.1016/j.chom.2024.08.010 35. Culp EJ Goodman AL Cross-feeding in the gut microbiome: Ecology and mechanisms Cell Host Microbe 2023 31 485 499 10.1016/j.chom.2023.03.016 37054671 PMC10125260 Culp, E. J. & Goodman, A. L. Cross-feeding in the gut microbiome: Ecology and mechanisms. Cell Host Microbe 31 37054671 10.1016/j.chom.2023.03.016 PMC10125260 36. Kern L Abdeen SK Kolodziejczyk AA Elinav E Commensal inter-bacterial interactions shaping the microbiota Curr. Opin. Microbiol. 2021 63 158 171 10.1016/j.mib.2021.07.011 34365152 Kern, L., Abdeen, S. K., Kolodziejczyk, A. A. & Elinav, E. Commensal inter-bacterial interactions shaping the microbiota. Curr. Opin. Microbiol. 63 34365152 10.1016/j.mib.2021.07.011 37. Wu M Gut complement induced by the microbiota combats pathogens and spares commensals Cell 2024 187 897 913.e818 10.1016/j.cell.2023.12.036 38280374 PMC10922926 Wu, M. et al. Gut complement induced by the microbiota combats pathogens and spares commensals. Cell 187 38280374 10.1016/j.cell.2023.12.036 PMC10922926 38. Wu, M. et al. Microbiome induced complement synthesized in the gut protects against enteric infections. bioRxiv 39. Senizza A Rocchetti G Callegari ML Lucini L Morelli L Linoleic acid induces metabolic stress in the intestinal microorganism Bifidobacterium breve DSM 20213 Sci. Rep. 2020 10 5997 10.1038/s41598-020-62897-w 32265475 PMC7138814 Senizza, A., Rocchetti, G., Callegari, M. L., Lucini, L. & Morelli, L. Linoleic acid induces metabolic stress in the intestinal microorganism Bifidobacterium breve DSM 20213. Sci. Rep. 10 32265475 10.1038/s41598-020-62897-w PMC7138814 40. Devillard E McIntosh FM Duncan SH Wallace RJ Metabolism of linoleic acid by human gut bacteria: different routes for biosynthesis of conjugated linoleic acid J. Bacteriol., 2007 189 2566 2570 10.1128/JB.01359-06 17209019 PMC1899373 Devillard, E., McIntosh, F. M., Duncan, S. H. & Wallace, R. J. Metabolism of linoleic acid by human gut bacteria: different routes for biosynthesis of conjugated linoleic acid. J. Bacteriol., 189 17209019 10.1128/JB.01359-06 PMC1899373 41. Zhang Y Arachidonic acid metabolism in health and disease MedComm (2020) 2023 4 e363 10.1002/mco2.363 37746665 PMC10511835 Zhang, Y. et al. Arachidonic acid metabolism in health and disease. MedComm (2020) 4 37746665 10.1002/mco2.363 PMC10511835 42. Donaldson GP Gut microbiota utilize immunoglobulin A for mucosal colonization Science 2018 360 795 800 10.1126/science.aaq0926 29724905 PMC5973787 Donaldson, G. P. et al. Gut microbiota utilize immunoglobulin A for mucosal colonization. Science 360 29724905 10.1126/science.aaq0926 PMC5973787 43. Moor K High-avidity IgA protects the intestine by enchaining growing bacteria Nature 2017 544 498 502 10.1038/nature22058 28405025 Moor, K. et al. High-avidity IgA protects the intestine by enchaining growing bacteria. Nature 544 28405025 10.1038/nature22058 44. Okai S High-affinity monoclonal IgA regulates gut microbiota and prevents colitis in mice Nat. Microbiol 2016 1 16103 10.1038/nmicrobiol.2016.103 27562257 Okai, S. et al. High-affinity monoclonal IgA regulates gut microbiota and prevents colitis in mice. Nat. Microbiol 1 27562257 10.1038/nmicrobiol.2016.103 45. Cho S Interactions between Bifidobacterium and Bacteroides and human milk oligosaccharides and their associations with infant cognition Front Nutr. 2023 10 1216327 10.3389/fnut.2023.1216327 37457984 PMC10345227 Cho, S. et al. Interactions between Bifidobacterium and Bacteroides and human milk oligosaccharides and their associations with infant cognition. Front Nutr. 10 37457984 10.3389/fnut.2023.1216327 PMC10345227 46. Xiao M Cross-feeding of bifidobacteria promotes intestinal homeostasis: a lifelong perspective on the host health NPJ Biofilms Microbiomes 2024 10 47 10.1038/s41522-024-00524-6 38898089 PMC11186840 Xiao, M. et al. Cross-feeding of bifidobacteria promotes intestinal homeostasis: a lifelong perspective on the host health. NPJ Biofilms Microbiomes 10 38898089 10.1038/s41522-024-00524-6 PMC11186840 47. Horrocks V King OG Yip AYG Marques IM McDonald JAK Role of the gut microbiota in nutrient competition and protection against intestinal pathogen colonization Microbiology 2023 169 001377 10.1099/mic.0.001377 37540126 PMC10482380 Horrocks, V., King, O. G., Yip, A. Y. G., Marques, I. M. & McDonald, J. A. K. Role of the gut microbiota in nutrient competition and protection against intestinal pathogen colonization. Microbiology 169 37540126 10.1099/mic.0.001377 PMC10482380 48. Ridlon JM Gaskins HR Another renaissance for bile acid gastrointestinal microbiology Nat. Rev. Gastroenterol. Hepatol. 2024 21 348 364 10.1038/s41575-024-00896-2 38383804 PMC11558780 Ridlon, J. M. & Gaskins, H. R. Another renaissance for bile acid gastrointestinal microbiology. Nat. Rev. Gastroenterol. Hepatol. 21 38383804 10.1038/s41575-024-00896-2 PMC11558780 49. van Best N Bile acids drive the newborn’s gut microbiota maturation Nat. Commun. 2020 11 3692 10.1038/s41467-020-17183-8 32703946 PMC7378201 van Best, N. et al. Bile acids drive the newborn’s gut microbiota maturation. Nat. Commun. 11 32703946 10.1038/s41467-020-17183-8 PMC7378201 50. Peng YL Effects of bile acids on the growth, composition and metabolism of gut bacteria NPJ Biofilms Microbiomes 2024 10 112 10.1038/s41522-024-00566-w 39438471 PMC11496524 Peng, Y. L. et al. Effects of bile acids on the growth, composition and metabolism of gut bacteria. NPJ Biofilms Microbiomes 10 39438471 10.1038/s41522-024-00566-w PMC11496524 51. Tallima H El Ridi R Arachidonic acid: Physiological roles and potential health benefits - A review J. Adv. Res 2018 11 33 41 10.1016/j.jare.2017.11.004 30034874 PMC6052655 Tallima, H. & El Ridi, R. Arachidonic acid: Physiological roles and potential health benefits - A review. J. Adv. Res 11 30034874 10.1016/j.jare.2017.11.004 PMC6052655 52. Luo D Gut microbiota combined with metabolomics reveals the metabolic profile of the normal aging process and the anti-aging effect of FuFang Zhenshu TiaoZhi(FTZ) in mice Biomed. Pharmacother. 2020 121 109550 10.1016/j.biopha.2019.109550 31704617 Luo, D. et al. Gut microbiota combined with metabolomics reveals the metabolic profile of the normal aging process and the anti-aging effect of FuFang Zhenshu TiaoZhi(FTZ) in mice. Biomed. Pharmacother. 121 31704617 10.1016/j.biopha.2019.109550 53. Choque B Catheline D Rioux V Legrand P Linoleic acid: between doubts and certainties Biochimie 2014 96 14 21 10.1016/j.biochi.2013.07.012 23900039 Choque, B., Catheline, D., Rioux, V. & Legrand, P. Linoleic acid: between doubts and certainties. Biochimie 96 23900039 10.1016/j.biochi.2013.07.012 54. Doyle CR Moon JY Daily JP Wang T Pirofski LA A Capsular Polysaccharide-Specific Antibody Alters Streptococcus pneumoniae Gene Expression during Nasopharyngeal Colonization of Mice Infect. Immun. 2018 86 e00300-18 10.1128/IAI.00300-18 29735523 PMC6013671 Doyle, C. R., Moon, J. Y., Daily, J. P., Wang, T. & Pirofski, L. A. A Capsular Polysaccharide-Specific Antibody Alters Streptococcus pneumoniae Gene Expression during Nasopharyngeal Colonization of Mice. Infect. Immun. 86 29735523 10.1128/IAI.00300-18 PMC6013671 55. Yu Y Raka F Adeli K The role of the gut microbiota in lipid and lipoprotein metabolism J. Clin. Med 2019 8 2227 10.3390/jcm8122227 31861086 PMC6947520 Yu, Y., Raka, F. & Adeli, K. The role of the gut microbiota in lipid and lipoprotein metabolism. J. Clin. Med 8 31861086 10.3390/jcm8122227 PMC6947520 56. Martinez-Guryn K Small intestine microbiota regulate host digestive and absorptive adaptive responses to dietary Lipids Cell Host Microbe 2018 23 458 469.e455 10.1016/j.chom.2018.03.011 29649441 PMC5912695 Martinez-Guryn, K. et al. Small intestine microbiota regulate host digestive and absorptive adaptive responses to dietary Lipids. Cell Host Microbe 23 29649441 10.1016/j.chom.2018.03.011 PMC5912695 57. Chang EB Martinez-Guryn K Small intestinal microbiota: the neglected stepchild needed for fat digestion and absorption Gut Microbes 2019 10 235 240 10.1080/19490976.2018.1502539 30136893 PMC6546320 Chang, E. B. & Martinez-Guryn, K. Small intestinal microbiota: the neglected stepchild needed for fat digestion and absorption. Gut Microbes 10 30136893 10.1080/19490976.2018.1502539 PMC6546320 58. Araujo JR Fermentation products of commensal bacteria alter enterocyte lipid metabolism Cell Host Microbe 2020 27 358 375.e357 10.1016/j.chom.2020.01.028 32101704 Araujo, J. R. et al. Fermentation products of commensal bacteria alter enterocyte lipid metabolism. Cell Host Microbe 27 32101704 10.1016/j.chom.2020.01.028 59. Vonaesch P Stunted children display ectopic small intestinal colonization by oral bacteria, which cause lipid malabsorption in experimental models Proc. Natl. Acad. Sci. USA 2022 119 e2209589119 10.1073/pnas.2209589119 36197997 PMC9573096 Vonaesch, P. et al. Stunted children display ectopic small intestinal colonization by oral bacteria, which cause lipid malabsorption in experimental models. Proc. Natl. Acad. Sci. USA 119 36197997 10.1073/pnas.2209589119 PMC9573096 60. Carter PJ Rajpal A Designing antibodies as therapeutics Cell 2022 185 2789 2805 10.1016/j.cell.2022.05.029 35868279 Carter, P. J. & Rajpal, A. Designing antibodies as therapeutics. Cell 185 35868279 10.1016/j.cell.2022.05.029 61. Shinkura R Therapeutic immunoglobulin A antibody for dysbiosis-related diseases Int Immunol. 2021 33 787 790 10.1093/intimm/dxab066 34492105 PMC8499904 Shinkura, R. Therapeutic immunoglobulin A antibody for dysbiosis-related diseases. Int Immunol. 33 34492105 10.1093/intimm/dxab066 PMC8499904 62. Planchais C HIV-1 envelope recognition by polyreactive and cross-reactive intestinal B cells Cell Rep. 2019 27 572 585.e577 10.1016/j.celrep.2019.03.032 30970259 PMC6458971 Planchais, C. et al. HIV-1 envelope recognition by polyreactive and cross-reactive intestinal B cells. Cell Rep. 27 30970259 10.1016/j.celrep.2019.03.032 PMC6458971 63. von Strempel A Bacteriophages targeting protective commensals impair resistance against Salmonella Typhimurium infection in gnotobiotic mice PLoS Pathog. 2023 19 e1011600 10.1371/journal.ppat.1011600 37603558 PMC10470868 von Strempel, A. et al. Bacteriophages targeting protective commensals impair resistance against Salmonella Typhimurium infection in gnotobiotic mice. PLoS Pathog. 19 37603558 10.1371/journal.ppat.1011600 PMC10470868 64. Kuru E In Situ probing of newly synthesized peptidoglycan in live bacteria with fluorescent D-amino acids Angew. Chem. Int Ed. Engl. 2012 51 12519 12523 10.1002/anie.201206749 23055266 PMC3589519 Kuru, E. et al. In Situ probing of newly synthesized peptidoglycan in live bacteria with fluorescent D-amino acids. Angew. Chem. Int Ed. Engl. 51 23055266 10.1002/anie.201206749 PMC3589519 65. Kim S Mucin degrader Akkermansia muciniphila accelerates intestinal stem cell-mediated epithelial development Gut Microbes 2021 13 1 20 10.1080/19490976.2021.1892441 33678130 PMC7946046 Kim, S. et al. Mucin degrader Akkermansia muciniphila accelerates intestinal stem cell-mediated epithelial development. Gut Microbes 13 33678130 10.1080/19490976.2021.1892441 PMC7946046 66. Schabauer L Wenning M Huber I Ehling-Schulz M Novel physico-chemical diagnostic tools for high throughput identification of bovine mastitis associated gram-positive, catalase-negative cocci BMC Vet. Res. 2014 10 156 10.1186/1746-6148-10-156 25015262 PMC4105049 Schabauer, L., Wenning, M., Huber, I. & Ehling-Schulz, M. Novel physico-chemical diagnostic tools for high throughput identification of bovine mastitis associated gram-positive, catalase-negative cocci. BMC Vet. Res. 10 25015262 10.1186/1746-6148-10-156 PMC4105049 67. Liu Q Staphylococcus epidermidis Contributes to Healthy Maturation of the Nasal Microbiome by Stimulating Antimicrobial Peptide Production Cell Host Microbe 2020 27 68 78.e65 10.1016/j.chom.2019.11.003 31866425 PMC10988655 Liu, Q. et al. Staphylococcus epidermidis Contributes to Healthy Maturation of the Nasal Microbiome by Stimulating Antimicrobial Peptide Production. Cell Host Microbe 27 31866425 10.1016/j.chom.2019.11.003 PMC10988655 68. Ha MT Comparison of qPCR and chromogenic culture methods for rapid detection of group B streptococcus colonization in Vietnamese pregnant women Pr. Lab Med 2024 42 e00435 10.1016/j.plabm.2024.e00435 PMC11532469 39497793 Ha, M. T. et al. Comparison of qPCR and chromogenic culture methods for rapid detection of group B streptococcus colonization in Vietnamese pregnant women. Pr. Lab Med 42 10.1016/j.plabm.2024.e00435 PMC11532469 39497793 69. Yang S Differences in the digestive enzyme activity, intestinal mucosa and microbial community in loach cultivated in two separate environments BMC Microbiol 2018 18 113 10.1186/s12866-018-1237-1 30200876 PMC6131900 Yang, S. et al. Differences in the digestive enzyme activity, intestinal mucosa and microbial community in loach cultivated in two separate environments. BMC Microbiol 18 30200876 10.1186/s12866-018-1237-1 PMC6131900 70. Wang W Increased proportions of Bifidobacterium and the Lactobacillus group and loss of butyrate-producing bacteria in inflammatory bowel disease J. Clin. Microbiol 2014 52 398 406 10.1128/JCM.01500-13 24478468 PMC3911339 Wang, W. et al. Increased proportions of Bifidobacterium and the Lactobacillus group and loss of butyrate-producing bacteria in inflammatory bowel disease. J. Clin. Microbiol 52 24478468 10.1128/JCM.01500-13 PMC3911339 71. Okai S Intestinal IgA as a modulator of the gut microbiota Gut Microbes 2017 8 486 492 10.1080/19490976.2017.1310357 28384049 PMC5628655 Okai, S. et al. Intestinal IgA as a modulator of the gut microbiota. Gut Microbes 8 28384049 10.1080/19490976.2017.1310357 PMC5628655 ",
  "metadata": {
    "Title of this paper": "Intestinal IgA as a modulator of the gut microbiota",
    "Journal it was published in:": "Nature Communications",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479768/"
  }
}