{
  "title": "Paper_1023",
  "abstract": "pmc Microorganisms Microorganisms 3054 microorg microorganisms Microorganisms 2076-2607 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472254 PMC12472254.1 12472254 12472254 41011525 10.3390/microorganisms13092195 microorganisms-13-02195 1 Article Acanthospermum australe Plasmodium falciparum https://orcid.org/0000-0002-9453-2731 Koza Ntombikhona Appear Formal analysis Investigation Writing – original draft 1 * Myeza Ntokozo Nkosinathi 1 https://orcid.org/0000-0003-4409-1955 Hoppe Heinrich Formal analysis Resources 2 https://orcid.org/0000-0002-7189-2822 Mosa Rebamang Anthony Formal analysis Writing – original draft 3 https://orcid.org/0000-0003-2521-8957 Kappo Abidemi Paul Supervision 4 https://orcid.org/0000-0002-7798-3020 Simelane Mthokozisi Blessing Cedric 4 https://orcid.org/0000-0002-8049-0761 Opoku Andrew Rowland Supervision 1 Alonso Diego Peres Academic Editor Ribolla Paulo Eduardo Martins Academic Editor 1 ntokozomyz@gmail.com opokua@unizulu.ac.za 2 h.hoppe@ru.ac.za 3 rebamang.mosa@up.ac.za 4 akappo@uj.ac.za msimelane@uj.ac.za * khokoza@gmail.com 19 9 2025 9 2025 13 9 496716 2195 25 6 2025 07 8 2025 09 8 2025 19 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ The resistance of malaria parasites towards the current antimalarial therapies continues to fuel the search for new antimalarial drugs, preferably from natural sources. This study aimed to investigate the potential of the dichloromethane extract of Acanthospermum australe Plasmodium falciparum Pf P. falciparum P. falciparum Pf P. falciparum 50 Pf Pf Pf A. australe Plasmodium medicinal plants heat shock proteins University of Zululand National Research Foundation (NRF) MND190729460297 The authors would like to thank the University of Zululand research fund and the National Research Foundation (NRF) (REF: MND190729460297) for the scholarship awarded to N.A.K. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Malaria continues to be among the major human health concerns worldwide, with many developing countries being the most affected [ 1 Plasmodium falciparum 2 3 P. falciparum 4 5 6 7 Heat shock protein 70 (Hsp70), one of the highly conserved molecular chaperones, is the most studied homologue. Generally, Hsp70 is ubiquitously expressed in cells in response to normal and stressful conditions. P. falciparum Pf Pf Pf Pf Pf Pf 8 Pf Pf Pf 9 10 Pf 11 Pf Acanthospermum australe Asteraceae 12 13 Pf 2. Materials and Methods 2.1. Chemicals and Reagents Sodium carbonate and dimethyl sulfoxide (DMSO) were purchased from Merck (Darmstadt, Germany). Chloroquine, kanamycin, bis-acrylamide, sodium dodecyl sulfate (SDS), isopropyl-β-D-thiogalactopyranoside (IPTG), Coomassie blue R 250, phenylmethylsulphonyl fluoride (PMSF), lysozyme, dithiothreitol (DTT), ammonium molybdate, 2-mercaptoethanol, tris (hydroxymethyl)aminomethane, and polyvinylidene fluoride (PVDF) were all purchased from Inqaba Biotechnical Industries (Pretoria, South Africa). 2.2. Plant Collection and Extract Preparation Fresh plant material of Acanthospermum australe n w v 2.3. Gas Chromatography–Mass Spectrometry Analysis The phytochemical composition of the plant extract was analysed using gas chromatography (GC). The GC was connected to a mass spectrometer furnished with Elite-1 and a fused silica capillary column. The compounds were detected by employing an electron ionisation system with an ionisation energy of 70 eV. Helium gas was used as a carrier at a constant flow rate of 1 mL and a 2 μL injection volume. The injector was maintained at a temperature of 250 °C and ion-source temperature of 280 °C. The oven temperature was programmed to hold for 2 min at 110 °C, further increased by 10 °C/min interval until it reached 200 °C; then it was increased by 5 °C/min to 280 °C, and the isothermal ended after 9 min at 280 °C. The mass spectra (MS) were obtained at 70 eV, with a scanning interval of 0.5 s and fragments from 45 to 450 Da. The overall running time of the GC-MS (Perkin Elmer, Shelton, CT, USA) was 30 min for each sample. Turbomass 5.1 software for the mass spectra mass spectra and chromatograms were used to obtain the compound data. These compounds were matched with database compounds of the National Institute of Standards and Technology library (Gaithersburg, MD, USA) (NIST08.LIB). 2.4. Plasmodium Lactate Dehydrogenase (pLDH) Assay The plasmodium lactate dehydrogenase (pLDH) assay described by Makler et al. (1993) was adapted to determine the in vitro antiplasmodial activity of the extract on the chloroquine-sensitive strain of Plasmodium falciparum 14 P. falciparum 2 2 2 2.5. Transformation and Expression of Recombinant PfHsp70-1 Protein Competent E. coli XL1 blue Pf Pf 15 16 g Pf 2.6. Purification of Expressed PfHsp70-1 Protein The purification of recombinant Pf 17 E. coli Pf g Pf Pf Pf Pf 2.7. Malate Dehydrogenase and Luciferase Aggregation Assay The inhibitory activity of the plant extract on the chaperone function of Pf 18 PfHsp70 The thermal-induced luciferase aggregation assay was conducted as described for the MDH assay with slight modifications. The HEPES buffer (20 mM HEPES-KOH, pH 7.5, 5 mM NaOA C 2 2.8. ATPase Assay The ATPase assay was used to determine the inhibitory activity of the plant extract on the ATPase activity of Pf 19 2 i i 2 4 2.9. UV-Vis Spectrometer Analysis The Ultraviolet-visible (UV-vis) spectrophotometer method described by Opoku et al. (2019) was followed with minor modifications to analyse the conformational changes in Pf 17 Pf Pf Pf 2.10. Statistical Analysis Unless stated otherwise, all experiments were repeated three times. Data generated were entered into Microsoft Excel ® post hoc p 3. Results 3.1. Chemical Profiling of the DCM Extract Using GC-MS The GC-MS analysis of the DCM extract recorded a total of 185 compounds. About 11 were considered major (peak area ≥ 0.2%) compounds in the extract. These include 5-Benzofuranacetic acid, 6-ethenyl-2,4,5,6,7,7a-hexahydro-3,6-dimethyl-à-methylene-2-oxo-, methyl ester, Methyl 10,12-pentacosadiynoate, Fluoxymesterone, and Estra-1,3,5(10)-trien-17á-ol ( Table 1 3.2. Antiplasmodial Activity The antiplasmodial activity of the plant extract was determined against P. falciparum Table 2 50 3.3. The Expression and Purification of PfHs70-1 Recombinant Protein SDS-PAGE gel (12%) was used to resolve the recombinant expression of Pf E. coli BL21 Pf Figure 1 Pf Figure 1 Pf Figure 1 Pf Figure 1 Pf 3.4. The Extract Suppresses the Chaperone Activity of PfHsp70-1 Incubation of the proteins (MDH and luciferase) in the presence of Pf Pf Figure 2 Pf 3.5. A. australe Extract Inhibits PfHsp70-1 ATPase Activity The results of the plant extract on basal ATPase activity are shown in Figure 3 Pf i Pf i i Pf 3.6. UV-Vis Analysis of the Interaction of PfHsp70-1 with the Plant Extract UV–visible spectrum was used to determine the binding effect of the extract on PfHsp70 Pf PfHsp70 Figure 4 Table 3 4. Discussion The current study sought to confirm the antiplasmodial activity of the plant extract and further evaluate its effect on the chaperone activity of the P. falciparum Pf A. australe Table 1 21 24 30 26 The antiplasmodial activity of the A. australe P. falciparum 50 50 50 37 50 Table 2 13 26 27 Pf 9 10 PfHsp70-1 Pf Figure 2 Pf Pf A. australe Pf The inhibitory effect of the extract was further determined on the basal ATPase activity of Pf Pf i 38 i Pf Figure 3 Pf Pf Pterocarpus angolensis Ziziphus mucronate 10 UV-vis spectroscopy was used to analyse some conformational changes in the PfHsp70-1 structure upon interaction with the extract. The aromatic amino acids (tryptophan and tyrosine) contribute to strong UV absorption of approximately 240–300 nm wavelength [ 39 Figure 4 Table 3 Pf The high in vitro antiplasmodial activity of the extract, its inhibitory effect against Pf 5. Conclusions The results from this study indicated that the DCM extract of A. australe Pf Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/microorganisms13092195/s1 A Pf E. coli Pf Pf B Pf C Pf Pf Pf Figure 1 australe P. falciparum 50 n Author Contributions Writing of the original draft, N.A.K., R.A.M. and A.R.O.; data analysis, N.A.K., R.A.M. and H.H.; investigation, N.A.K., N.N.M. and M.B.C.S.; supervision, A.R.O., M.B.C.S. and A.P.K. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was approved by the University of Zululand Research Ethics Committee (Reg No: UZREC171110-030 PGD 2021/67) on 10 January 2022. Informed Consent Statement Not applicable. Data Availability Statement The original contributions presented in this study are included in the article/ Supplementary Materials Conflicts of Interest The authors declare no conflicts of interest. Abbreviations  DCM Dichloromethane GAE Gallic Acid Equivalent GC-MS Gas chromatography–mass spectrometer IPTG Isopropyl-β-D-thiogalactopyranoside MDH Malate dehydrogenase PfHsp Plasmodium falciparum heat shock protein PMB Polymyxin B QE Quercetin SDS-PAGE Sodium dodecyl sulfate polyacrylamide gel electrophoresis UV-vis Ultraviolet-visible (UV-vis) References 1. Zekar L. Sharman T. Malaria (Plasmodium Falciparum) StatPearls Publishing Treasure Island, FL, USA 2020 32310422 2. Haakenstad A. Harle A.C. Tsakalos G. Micah A.E. Tao T. Anjomshoa M. Cohen J. Fullman N. Hay S.I. Mestrovic T. Tracking spending on malaria by source in 106 countries, 2000–2016: An economic modelling study Lancet Infect. Dis. 2019 19 703 716 10.1016/S1473-3099(19)30165-3 31036511 PMC6595179 3. WHO World Malaria Report 2020: 20 Years of Global Progress and Challenges World Malaria Report WHO Geneva, Switzerland 2020 1 151 4. Ceravolo I.P. Zani C.L. Figueiredo F.J. Kohlhoff M. Santana A.E. Krettli A.U. Aspidosperma pyrifolium Malar. J. 2018 17 436 10.1186/s12936-018-2568-y 30477525 PMC6257952 5. Mathenge P.G. Low S.K. Vuong N.L. Mohamed M.Y.F. Faraj H.A. Alieldin G.I. Yahia N.A. Khan A. Diab O.M. Mohamed Y.M. Efficacy and resistance of different artemisinin-based combination therapies: A systematic review and network meta-analysis Parasitol. Int. 2020 74 101919 10.1016/j.parint.2019.04.016 31015034 6. Pinheiro L. Feitosa L.M. Silveira F.F. Boechat N. Current antimalarial therapies and advances in the development of semi-synthetic artemisinin derivatives An. Da Acad. Bras. De Ciências 2018 90 1251 1271 10.1590/0001-3765201820170830 29873667 7. Sullivan D.J. Quinolines block every step of malaria heme crystal growth Proc. Natl. Acad. Sci. USA 2017 114 7483 7485 10.1073/pnas.1708153114 28696317 PMC5530708 8. Torrente M.P. Shorter J. The metazoan protein disaggregase and amyloid depolymerase system: Hsp110, Hsp70, Hsp40, and small heat shock proteins Prion 2013 7 457 463 10.4161/pri.27531 24401655 PMC4201613 9. Cockburn I.L. Boshoff A. Pesce E.R. Blatch G.L. Selective modulation of plasmodial Hsp70s by small molecules with antimalarial activity Biol. Chem. 2014 395 1353 1362 10.1515/hsz-2014-0138 24854538 10. Zininga T. Anokwuru C.P. Sigidi M.T. Tshisikhawe M.P. Ramaite I.I. Traoré A.N. Hoppe H. Shonhai A. Potgieter N. Extracts obtained from Pterocarpus angolensis Ziziphus mucronata Molecules 2017 22 1224 10.3390/molecules22081224 28788073 PMC6152082 11. Daniyan M.O. Przyborski J.M. Shonhai A. Partners in mischief: Functional networks of heat shock proteins of Plasmodium falciparum and their influence on parasite virulence Biomolecules 2019 9 295 10.3390/biom9070295 31340488 PMC6681276 12. Mallmann R. Ethur E.M. Bianchetti P. Faleiro D. Hoehne L. Goettert M.I. Effectiveness of aqueous and hydroalcoholic extracts of Acanthospermum australe Braz. J. Biol. 2018 78 619 624 10.1590/1519-6984.167376 29319752 13. Nethengwe M.F. Opoku A.R. Dludla P.V. Madida K.T. Shonhai A. Smith P. Singh M. Larvicidal, antipyretic and antiplasmodial activity of some Zulu medicinal plants J. Med. Plants Res. 2012 6 1255 1262 10.5897/JMPR11.1319 14. Makler M.T. Ries J.M. Williams J.A. Bancroft J.E. Piper R.C. Gibbins B.L. Hinrichs D.J. Parasite lactate dehydrogenase as an assay for Plasmodium failciparum Am. J. Trop. Med. Hyg. 1993 48 739 741 10.4269/ajtmh.1993.48.739 8333566 15. Salomane N. Pooe O.J. Simelane M.B. Iso-mukaadial acetate and ursolic acid acetate inhibit the chaperone activity of Plasmodium falciparum heat shock protein 70-1 Cell Stress Chaperones 2021 26 685 693 10.1007/s12192-021-01212-6 34023985 PMC8275760 16. Shonhai A. Botha M. de Beer T.A. Boshoff A. Blatch G.L. Structure-function study of a Plasmodium falciparum Protein Pept. Lett. 2008 15 1117 1125 10.2174/092986608786071067 19075824 17. Opoku F. Govender P.P. Pooe O.J. Simelane M.B. Evaluating iso-mukaadial acetate and ursolic acid acetate as plasmodium falciparum Biomolecules 2019 9 861 10.3390/biom9120861 31835879 PMC6995562 18. Cockburn I.L. Pesce E.R. Pryzborski J.M. Davies-Coleman M.T. Clark P.G. Keyzers R.A. Screening for small molecule modulators of Hsp70 chaperone activity using protein aggregation suppression assays: Inhibition of the plasmodial chaperone PfHsp70-1 Biol. Chem. 2011 392 431 438 10.1515/bc.2011.040 21426241 19. Mabate B. Zininga T. Ramatsui L. Makumire S. Achilonu I. Dirr H.W. Shonhai A. Structural and biochemical characterization of Plasmodium falciparum Proteins Struct. Funct. Bioinform. 2018 86 1189 1201 10.1002/prot.25600 PMC6282620 30183110 20. Dey P. Goyary D. Chattopadhyay P. Kishor S. Karmakar S. Verma A. Evaluation of larvicidal activity of Piper longum Aedes aegypti Anopheles stephensi Culex quinquefasciatus S. Afr. J. Bot. 2020 132 482 490 10.1016/j.sajb.2020.06.016 21. Starlin T. Prabha P.S. Thayakumar B.K.A. Gopalakrishnan V.K. Screening and GC-MS profiling of ethanolic extract of Tylophora pauciflora Bioinformation 2019 15 425 10.6026/97320630015425 31312080 PMC6614127 22. Carey A.F. Wang G. Su C.Y. Zwiebel L.J. Carlson J.R. Odorant reception in the malaria mosquito Anopheles gambiae Nature 2010 464 66 71 10.1038/nature08834 20130575 PMC2833235 23. Youssef A.M. Maaty D.A. Al-Saraireh Y.M. Phytochemical Analysis and Profiling of Antitumor Compounds of Leaves and Stems of Calystegia silvatica Molecules 2023 28 630 10.3390/molecules28020630 36677687 PMC9863965 24. Kuley E. Kuscu M.M. Durmus M. Ucar Y. Inhibitory activity of Co-microencapsulation of cell free supernatant from Lactobacillus plantarum with propolis extracts towards fish spoilage bacteria LWT 2021 146 111433 10.1016/j.lwt.2021.111433 25. Chan W.K. Tan L.T.H. Chan K.G. Lee L.H. Goh B.H. Nerolidol: A sesquiterpene alcohol with multi-faceted pharmacological and biological activities Molecules 2016 21 529 10.3390/molecules21050529 27136520 PMC6272852 26. Van Zyl R.L. Seatlholo S.T. Viljoen A.M. Pharmacological interactions of essential oil constituents on the in vitro growth of Plasmodium falciparum S. Afr. J. Bot. 2010 76 662 667 10.1016/j.sajb.2010.08.002 27. Van Zyl R.L. Seatlholo S.T. Van Vuuren S.F. Viljoen A.M. The biological activities of 20 naturally identical essential oil constituents J. Essent. Oil Res. 2006 18 129 133 10.1080/10412905.2006.12067134 28. Weathers P.J. Towler M. Hassanali A. Lutgen P. Engeu P.O. Dried-leaf Artemisia annua World J. Pharmacol. 2014 3 39 10.5497/wjp.v3.i4.39 25678989 PMC4323188 29. Motshudi M.C. Olaokun O.O. Mkolo N.M. Evaluation of GC× GC-TOF-MS untargeted metabolomics, cytotoxicity and antimicrobial activity of leaf extracts of Artemisia afra (Jacq.) purchased from three local vendors J. King Saud Univ.Sci. 2021 33 101422 10.1016/j.jksus.2021.101422 30. Singh N. Mansoori A. Jiwani G. Solanke A.U. Thakur T.K. Kumar R. Chaurasiya M. Kumar A. Antioxidant and antimicrobial study of Schefflera vinosa leaves crude extracts against rice pathogens Arab. J. Chem. 2021 14 103243 10.1016/j.arabjc.2021.103243 31. Claessens A.K. Ibragimova K.I. Geurts S.M. Bos M.E. Erdkamp F.L. Tjan-Heijnen V.C. The role of chemotherapy in the treatment of advanced breast cancer: An overview for clinical practice Crit. Rev. Oncol. Hematol. 2020 153 102988 10.1016/j.critrevonc.2020.102988 32599374 32. Murugesan K. Mulugeta K. Hailu E. Tamene W. Yadav S.A. Insights for integrative medicinal potentials of Ethiopian Kale ( Brassica carinata Chin. Herb. Med. 2021 13 250 254 10.1016/j.chmed.2020.09.003 36117508 PMC9476739 33. Jabeen N. Khan I.H. Javaid A. Fungicidal potential of leaf extracts of Datura metel L. to control Sclerotium rolfii Sacc Allelopath. J. 2022 56 59 68 10.26651/allelo.j/2022-56-1-1387 34. Suryanti V. Kusumaningsih T. Marliyana S.D. Setyono H.A. Trisnawati E.W. Identification of active compounds and antioxidant activity of teak ( Tectona grandis J. Biol. Divers. 2020 21 10.13057/biodiv/d210313 35. Mailafiya M.M. Yusuf A.J. Abdullahi M.I. Aleku G.A. Ibrahim I.A. Yahaya M. Abubakar H. Sanusi A. Adamu H.W. Alebiosu C.O. Antimicrobial activity of stigmasterol from the stem bark of Neocarya macrophylla J. Med. Plants Econ. Dev. 2018 2 1 5 10.4102/jomped.v2i1.38 36. Wang J. Huang M. Yang J. Ma X. Zheng S. Deng S. Huang Y. Yang X. Zhao P. Anti-diabetic activity of stigmasterol from soybean oil by targeting the GLUT4 glucose transporter Food Nutr. Res. 2017 61 1364117 10.1080/16546628.2017.1364117 28970778 PMC5614214 37. Waiganjo B. Moriasi G. Onyancha J. Elias N. Muregi F. Antiplasmodial and cytotoxic activities of extracts of selected medicinal plants used to treat malaria in Embu County, Kenya J. Parasitol. Res. 2020 2020 8871375 10.1155/2020/8871375 32724666 PMC7364238 38. Solana J.C. Bernardo L. Moreno J. Aguado B. Requena J.M. The Astonishing Large Family of HSP40/DnaJ Proteins Existing in Leishmania Genes 2022 13 742 10.3390/genes13050742 35627127 PMC9141911 39. Aitken A. Learmonth M.P. Protein determination by UV absorption The Protein Protocols Handbook Humana Press Totowa, NJ, USA 2002 3 6 Figure 1 Expression and purification of the Pf A Pf E. coli Pf Pf B Pf C Pf Pf Pf D E Pf Supplementary data Figure 2 Effect of the extract on the chaperone activity of Pf A B n p p Figure 3 Effect of the extract on the basal PfHsp70-1 ATPase activity. A mixture of Pf (n p Pf Figure 4 UV-vis absorption spectra of Pf microorganisms-13-02195-t001_Table 1 Table 1 Major compounds found in the DCM extract of A. australe Peak Number Retention Time (s) Compound Name Peak Area % Molecular Formula Molecular Weight (g/mol) Bioactivities Reference(s) 1 1496.4 n-Hexadecanoic acid 0.98394 C 16 32 2 18 Larvicidal, anticancer, hemolytic [ 20 21 2 1635.8 Octadecanoic acid 0.91725 C 18 36 2 25 Hepato-protective, antioxidant, larvicidal [ 21 22 3 1826.6 (S,Z)-Heptadeca-1,9-dien-4,6-diyn-3-ol 0.53102 C 17 24 244 Antitumor [ 23 4 1844.7 1,6-Heptadien-4-ol 1.9095 C 7 12 776 Antimicrobial [ 24 5 1990.8 1,6,10-Dodecatrien-3-ol, 3,7,11-trimethyl- 0.22794 C 15 26 698 Anti-parasitic, skin-repellent, antimalarial [ 25 26 27 28 6 2032.7 5-Benzofuranacetic acid, 6-ethenyl-2,4,5,6,7,7a-hexahydro-3,6-dimethyl-à-methylene-2-oxo-, methyl ester 22.564 C 16 20 4 705 Anticonvulsant, anti-inflammatory, antimicrobial [ 29 7 2075.1 Methyl 10,12-pentacosadiynoate 2.3019 C 26 44 2 729 Antimicrobial [ 30 8 2122.7 Fluoxymesterone 2.6697 C 20 29 3 561 Anticancer [ 31 9 2124.6 Estra-1,3,5(10)-trien-17á-ol 2.7174 C 18 24 645 Anti-estrogenic [ 32 10 2162.9 1-Eicosanol 0.57624 C 20 42 916 Antioxidant, fungicidal [ 33 34 11 2250.9 Stigmasterol 0.56558 C 29 48 869 Antibacterial, antifungal, anticancer [ 35 36 microorganisms-13-02195-t002_Table 2 Table 2 Mortality (%) of the P. falciparum Extract Concentration (µg/mL) IC 50 10 50   A. australe 72.09 ± 3.84 ** 94.84 ± 3.07 ** 1.3 ± 0.11 Chloroquine - - 3.12 Chloroquine was used as a reference drug. Data are expressed as mean ± SD, ( n p microorganisms-13-02195-t003_Table 3 Table 3 Maximum absorbance of Hsp70-1 protein at 290 nm and 400 nm derived from UV-vis spectral data analysis of Figure 4 Samples Maximum Absorbance 290 nm 400 nm Pf 0.897 0.69 Pf 0.283 0.198 Pf A. australe 0.461 0.357 Pf A. australe 0.203 0.031 ",
  "metadata": {
    "Title of this paper": "Protein determination by UV absorption",
    "Journal it was published in:": "Microorganisms",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472254/"
  }
}