{
  "title": "Paper_381",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12484616 PMC12484616.1 12484616 12484616 41028235 10.1038/s41598-025-13352-1 13352 1 Article Zinc alleviates vascular calcification by activating ERK1/2-mediated autophagy Guo Guangying 1 Long Juan 1 Xu Tianhua 1 Li Xingru 2 Sui Dandan 2 Feng Xin drfengxin05@163.com 2 Yao Li liyao@cmu.edu.cn 1 1 https://ror.org/04wjghj95 grid.412636.4 Department of Nephrology, The First Hospital of China Medical University, 2 30 9 2025 2025 15 478255 34039 15 10 2024 23 7 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Chronic kidney disease (CKD) causes a significant health and economic burden across the world. This study aimed to evaluate the effects of zinc on CKD-mineral bone disorder (CKD-MBD) and autophagy in CKD rats by a diet containing 0.25% adenine and low vitamin K and to explore its mechanism of action on autophagy and calcification in a vascular smooth muscle cell (VSMC) calcification model using 10 mM β-glycerophosphate (β-GP). In vivo experiments showed that zinc supplementation improved blood and urinary biochemistry, corrected abnormalities related to bone metabolism in rats with CKD, promoted autophagy, and reduced aortic calcification. In vitro, zinc reduced the calcification of VSMCs induced by β-GP. During VSMC calcification, zinc further upregulated autophagy levels and the phosphorylated extracellular regulatory kinase1/2 (ERK1/2) levels in a high-phosphorus environment. Pretreatment with 3-methyladenine (3-MA), an autophagy inhibitor, or with U0126, an ERK1/2 pathway inhibitor, decreased autophagy and increased calcification. In conclusion, zinc improved CKD-MBD by inhibiting vascular calcification (VC) and ameliorating bone metabolism disorders. Furthermore, zinc alleviates VC in CKD by activating ERK1/2-mediated autophagy. Keywords Chronic kidney disease Vascular calcification Zinc Autophagy ERK1/2 Subject terms Kidney diseases Inflammation Experimental models of disease http://dx.doi.org/10.13039/501100001809 National Natural Science Foundation of China U21A20349 U21A20349 U21A20349 U21A20349 U21A20349 U21A20349 U21A20349 http://dx.doi.org/10.13039/501100005047 Natural Science Foundation of Liaoning Province 2023-MSLH-398 2023-MSLH-398 2023-MSLH-398 2023-MSLH-398 2023-MSLH-398 2023-MSLH-398 2023-MSLH-398 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction CKD represents a significant challenge in global health, with a prevalence exceeding 10%, affecting approximately 800 million people 1 2 3 4 5 6 7 8 Autophagy, a vital physiological process, plays a significant part in several disorders, including CVD 9 10 11 12 13 14 Zinc as an essential trace element in cellular metabolism is involved in various pathophysiological processes 15 16 17 18 19 22 23 24 25 The role that zinc plays in controlling autophagy has drawn more attention in recent times. Zinc deficiency impedes the maturation and degradation of autophagosomes, while zinc supplementation can positively regulate autophagy levels 26 27 28 30 Material and methods All methods were performed in accordance with the relevant guidelines and regulations, and the experimental protocol has been approved by the Ethics Committee of China Medical University. Animal studies Wistar male rats, aged 8–10 weeks, were obtained from Liaoning Changsheng Biotechnology Co., Ltd (Liaoning, China) and raised following the Animal Research Ethics Committee of China Medical University guidelines, and the study is reported in accordance with ARRIVE guidelines. Four groups of thirty-two rats were randomly assigned: control group (CTR), zinc control group (CTR + Zn), calcification group (CKD), and calcification + zinc group (CKD + Zn), each comprising eight rats. From day 1 to day 90, rats were fed a 0.25% adenine, 0.2 mg/kg vitamin K diet containing 1% calcium, 1% phosphorus, 1 IU/g vitamin D and 6% protein to establish the CKD calcification model 31 Cell culture A7R5, purchased from the Cell Bank of a Shanghai Academy of Sciences, was cultured in a 5% CO 2 Biochemical parameter analysis Urine and blood samples were collected from the rats at the beginning of the study and every two weeks thereafter. Serum calcium (SCa), serum creatinine (SCr), serum phosphorus (SP), serum zinc (SZn), urinary calcium (Uca), and urinary phosphorus (UP) were analyzed using reagent kits from Jiancheng Bio (Nanjing, China). Levels of serum parathyroid hormone (PTH) were measured using an ELISA kit (Immunoway, USA; Cat# KE1453), while receptor activator of nuclear factor-κB ligand (sRANKL), procollagen type I N-terminal propeptide (PINP), and C-terminal telopeptide of type I collagen (CTX- I) were analyzed using Cusabio ELISA kits (China; Cat# CSB-E05126r, CSB-E12774r, and CSB-E12776r, respectively). Alizarin red S staining After deparaffinizing and rehydrating the rat aortic paraffin sections, Alizarin red S staining solution was applied for five minutes; the staining solution was then removed, dried, and mounted with neutral balsam. For 14-day treated cells, they were fixed with neutral formalin for 20 min, and washed three times with distilled water. After adding the Alizarin red S staining solution, the cells were dyed in the dark for thirty minutes at 37 °C. Photographs were taken after removal of the staining solution and washing. Calcium quantification assay 3 mL of 0.6 mmol/L hydrochloric acid (HCl) was added to the tissue and 14-day treated cells separately; these specimens were then placed in an incubator at 37 °C for 24 h. Thereafter, the supernatant was collected, and using a calcium test kit, the amount of calcium in the tissue and cells was assessed. The calcium content of the vascular tissue (mg/g) was calculated using the formula: the calcium content (mg/g) = [Supernatant calcium concentration (mmol/L) × 2 × 10 –3 Western blot (WB) To extract protein samples, RIPA buffer containing protease and phosphatase inhibitors was used to lyse cells or blood vessels. The protein extracts were then quantified using the BCA method. Proteins were sorted into equivalent amounts using SDS-PAGE gel electrophoresis and placed onto PVDF membranes. The membranes were then sealed for 1.5 h at room temperature using 10% skimmed milk. After washing with Tris-buffered saline containing 0.1% Tween (TBST), the membranes were left overnight at 4 °C with appropriate primary antibodies: anti-α-SMA (1:1000, Abcam, cat# ab7817), anti-Runx2 (1:1000, Santa, cat# sc-390351), anti-Beclin1 (1:500, CST, cat# 3495), anti-LC3 (1:500, Abcam, cat# ab192890), anti-ERK1/2 (1:500, CST, cat# 4695), anti-Phospho-ERK1/2 (1:500, CST, cat# 4370), and anti-GAPDH (1:1000, CST, cat# 5174). The following day, the membranes were incubated with HRP-conjugated goat anti-rabbit (1:50,000, Abbkine, cat# A21020) and goat anti-mouse (1:50,000, Abbkine, cat# A21010) secondary antibodies for 1.5 h at 37 °C. Then, an ECL reagent was added for image capture using a chemiluminescence imaging system. Finally, the grey-scale values of each band were analyzed and recorded using ImageJ v1.8.0 software ( https://imagej.net/ij/ Immunohistochemistry (IHC) Following the heat-mediated antigen retrieval treatments, the paraffin sections were incubated individually at 4 °C overnight in a humidified box with primary antibodies that were suitably diluted: anti-α-SMA (1:200, Abcam, cat# ab7817), anti-Runx2 (1:150, Santa, cat# sc-390351), and anti-LC3 (1:200, Abcam, cat# ab192890). After washing, the pieces were blocked for ten minutes at room temperature using 0.3% H 2 2 Micro-CT detection The right femur was fixed in 70% ethanol for 48 h and then subjected to micro-CT scanning (SkyScan 1276, Bruker, Germany) to obtain imaging of the right distal femur. The micro-CT parameters were set as follows: tube voltage of 70 kV, tube current of 57 μA, and a resolution of 6 μm. The region of interest (ROI) for trabecular bone was defined as a 1.2 mm segment starting 0.78 mm from the growth plate. The ROI for cortical bone was defined as a 1.2 mm segment starting 4.5 mm from the growth plate. After scanning, data analysis and 3-d image reconstruction were performed using CT image analysis software (CtAn v.1.18 and CtVox v3.3.0, https://blue-scientific.com/ Immunofluorescence staining (IF) After being fixed for 20 min with a neutral fixative, the cells culturing for 72 h were permeabilized for 20 min with 0.5% Triton X-100, blocked for 30 min at room temperature with 5% BSA, and then incubated overnight with the anti-LC3 (1:200, Abcam, cat# ab192890) at 4 °C. The next day, the cells were cleaned with PBS and then incubated for 2 h at room temperature in the dark with a fluorescent secondary antibody (1:100, Abbkine, cat# A23420). A DAPI solution was used for nuclear staining. Lastly, pictures were taken with a confocal microscope after mounting in glycerol. Transmission electron microscopy (TEM) After culturing for 72 h, the VSMCs were treated at 4 °C for 4 h in an electron microscopy fixative. The cells were dehydrated and then soaked in acetone to enclose them. Then, thin sections measuring 70 nm were cut and dyed using a 2% uranyl acetate solution in ethanol under light protection. The sections were stained, cleaned, and allowed to air dry at room temperature for the entire night. Lastly, a TEM was used to examine and record the sections. Statistical analysis GraphPad Prism v8.0 ( https://www.graphpad.com/ t test p Results Effects of zinc on the body weight, blood biochemistry, and urine biochemistry in CKD rats Compared to the CTR and CTR + ZH groups, the CKD group showed decreased the body weight, SCa, and UP levels, while levels of SCr, SP, UCa, PTH, sRANKL (an osteoclast activator), PINP (a bone formation marker), and CTX-I (a bone resorption marker) levels increased. Additionally, compared to the CKD group, zinc supplementation elevated the SCa level and reduced the levels of SCr, SP, UCa, PTH, sRANKL, PINP, and CTX-I but had no significant effect on the rat body weight or UP levels. The level of SZn did not differ significantly across any of the aforementioned groups (Table 1 Table 1 Effects of zinc intake on the weight, blood chemistry and urine chemistry in the study groups. CTR(n = 8) CTR + Zn(n = 8) CKD(n = 8) CKD + Zn(n = 8) Weight (g) 423.38 ± 23.82 412.13 ± 16.97 311.25 ± 15.83 a 318.88 ± 21.95 a SCr (μmol/L) 65.12 ± 20.08 60.59 ± 22.32 511.21 ± 60.76 a 420.16 ± 80.37 a,b SCa (mmol/L) 2.49 ± 0.12 3.24 ± 0.16 1.65 ± 0.14 a 2.07 ± 0.12 a,b SP (mmol/L) 2.42 ± 0.29 2.68 ± 0.26 7.62 ± 0.16 a 5.58 ± 0.31 a,b SZn (μmol/L) 19.49 ± 0.92 19.11 ± 0.45 19.25 ± 1.70 17.79 ± 1.14 UCa (mg/24 h) 1.01 ± 0.65 1.22 ± 0.41 1.81 ± 0.82 a 1.49 ± 0.57 a,b UP (mg/24 h) 126.67 ± 88.32 152.22 ± 72.16 70.05 ± 15.83 a 78.29 ± 27.52 a PTH (pg/mL) 22.24 ± 6.51 19.23 ± 5.76 602.18 ± 97.92 a 80.50 ± 16.31 a,b sRANKL (pg/mL) 95.41 ± 20.32 93.56 ± 22.19 178.83 ± 23.40 a 133.25 ± 19.66 a,b PINP (pg/mL) 158.32 ± 23.25 155.43 ± 25.38 307.44 ± 31.69 a 232.15 ± 28.64 a,b CTX-I (pg/mL) 56.93 ± 9.6 55.85 ± 8.2 86.12 ± 12.24 a 73.57 ± 9.3 a,b This table compares the effects of zinc intake on various parameters, including mass, and SCr, SCa, SP, SZn, UCa, UP, PTH, sRANKL, PINP, and CTX-I levels across four groups: CTR, CTR + Zn, CKD, and CKD + Zn. All data are shown as means ± SEM ( n a P b P versus Effects of zinc on aortic calcification and autophagy in CKD rats The aortas were subjected to Alizarin Red S staining three months after modelling. The results (Fig. 1 1 i 1 1 Fig. 1 Effects of zinc intake on the calcification and autophagic activity in the aorta. ( A B C D G n H I a P versus b P versus Effect of zinc on the bone metabolism of CKD rats Three months later, Micro-CT scanning and 3-d imaging (Fig. 2 2 2 Fig. 2 Effects of zinc intake on bone metabolism observed by micro-CT. ( A B Table 2 Analysis of trabecular and cortical bone parameters in rat femurs. CTR(n = 8) CTR + Zn(n = 8) CKD(n = 8) CKD + Zn(n = 8) BV/TV (%) 18.62 ± 3.39 21.56 ± 3.56 10.29 ± 1.19 a 15.98 ± 2.98 a,b BS/TV (%) 9.64 ± 2.10 11.05 ± 2.67 4.80 ± 0.69 a 7.79 ± 1.55 a,b Tb.N(1/mm) 2.31 ± 0.66 2.76 ± 0.53 1.32 ± 0.18 a 1.89 ± 0.03 a,b Tb.Sp(mm) 0.33 ± 0. 06 0.27 ± 0.08 0.63 ± 0.05 a 0.46 ± 0.07 a,b Tb.BMD 0.34 ± 0.02 0.32 ± 0.50 0.19 ± 0.01 a 0.25 ± 0.02 a,b Tb.Th (mm) 0.08 ± 0.03 0.07 ± 0.02 0.08 ± 0.02 0.08 ± 0.02 Tt.Ar (mm 2 6.30 ± 0.50 5.78 ± 0.15 5.20 ± 0.18 a 6.25 ± 0.10 a,b Ct.Ar (mm 2 5.88 ± 0.48 5.51 ± 0.48 4.74 ± 0.24 a 5.63 ± 0.14 a,b Ct.Ar/Tt.Ar (100%) 93.29 ± 0.26 92.80 ± 0.09 88.61 ± 0.80 a 91.10 ± 2.32 a,b Ct.Po (100%) 6.62 ± 0.41 7.10 ± 0.09 10.13 ± 0.25 a 8.80 ± 1.08 a,b Ct.Th (mm) 0.53 ± 0.02 0.48 ± 0.02 0.40 ± 0.02 a 0.43 ± 0.06 a Ct.BMD 1.24 ± 0.15 1.23 ± 0.13 1.18 ± 0.13 1.20 ± 0.08 BV/TV: bone volume/total volume; BS/TV: bone surface/total volume; Tb.N: trabecular number; Tb.Sp: trabecular separation; Tb.BMD: trabecular bone mineral density; Tb.Th: trabecular thickness; Tt.Ar: total cortical bone area; Ct.Ar: cortical bone area; Ct.Ar/Tt.Ar: cortical bone area/total cortical bone area ratio; Ct.Po: cortical bone porosity; Ct.Th: cortical bone thickness; Ct.BMD: cortical bone mineral density. All data are shown as means ± SEM ( n a P versus b P versus Effect of zinc on β-GP-induced VSMC calcification High concentrations of zinc can impair cell viability. To determine a safe concentration for A7R5 cells, ZnCl 2 3 2 3 3 2 3 Fig. 3 Different concentrations of zinc on VSMC calcification. ( A * P versus B C E F Effect of zinc on β-GP-induced VSMC autophagy The autophagy-associated proteins were analyzed using a Western blot assay to investigate the possible influence of zinc on VSMC autophagy. As depicted in Fig. 4 4 4 Fig. 4 Zinc promotes autophagy and inhibits VSMC calcification. ( A B E n F G n a P versus b P versus c P versus Zinc increases autophagy to reduce β-GP-induced VSMC calcification To examine whether zinc may mitigate the VSMC calcification by fostering autophagy, the cells were pre-treated with 3-MA (5 mmol/L), an autophagy inhibitor, for half an hour before receiving zinc and β-GP treatments. Calcium quantification revealed that VSMCs that received a 3-MA pre-treatment showed higher levels of calcium deposition than cells that did not receive this therapy (Fig. 4 4 i 4 5 4 Fig. 5 Zinc inhibits the VSMC calcification by activating ERK1/2-mediated autophagy. ( A B C G n H I n a P versus b P versus c P versus Zinc stimulates the ERK1/2 signaling pathway to increase autophagy. Before being treated with β-GP and zinc, VSMCs had previously been treated with U0126, the ERK1/2 inhibitor, for 1 h to investigate whether the ERK1/2 signaling pathway contributes to the activation of autophagy by zinc. After pre-treating the VSMCs with U0126, there was a decrease in fluorescent LC3 puncta (Fig. 4 4 5 5 5 5 Discussion Zinc is an essential trace element for the human body, participating in protein synthesis and energy metabolism. Recent studies suggest that zinc offers substantial protection against CVD. SZn levels in CKD patients are negatively correlated with coronary artery calcification (CAC), and lower zinc levels are linked to a higher incidence of CVD 18 19 20 21 22 26 32 34 35 36 Zinc is essential for the normal development and maintenance of bone homeostasis. It is involved in synthesizing, mineralizing, and remodeling bone tissue. Zinc stimulates osteoblast differentiation, inhibits osteoclast formation, and facilitates bone remodeling by regulating the RANKL/RANK/OPG pathway 25 37 38 39 Autophagy is an intracellular degradation process that removes damaged organelles and proteins to sustain cellular homeostasis 12 14 e.g 40 26 27 41 The mechanism through which zinc regulates autophagy remains unclear. Three studies (tamoxifen-treated breast cancer cells, alcohol-treated human liver cancer cells, and hypoxia-reoxygenation-treated human cardiomyocytes) have highlighted the crucial role of ERK1/2 in zinc-mediated regulation of autophagy 28 30 42 43 44 Additionally, research has indicated that, in high-phosphate-induced human arterial smooth muscle cells (hASMCs) under inflammatory conditions, the application of ERK1/2 inhibitors does not affect hASMC calcification 45 21 The present research did not encompass experiments involving the silencing of GPR39 to elucidate its influence on ERK phosphorylation and autophagy triggered by zinc, constituting a notable constraint on our investigation. Subsequent studies should incorporate such experiments to enhance the understanding of the mechanisms of action of zinc. Furthermore, our investigation did not explore other plausible signaling pathways, such as PI3K/AKT/mTOR, which could be implicated in autophagy induced by zinc. Future research should explore these pathways to provide a more comprehensive view. Conclusions Zinc supplementation can improve CKD-MBD. Zinc enhances autophagy by activating the ERK1/2 pathway and inhibits VC induced by CKD (Fig. 6 in-vivo Fig. 6 The proposed model for the role of Zinc in regulating ERK1/2-mediated autophagy to respond vascular calcification. Supplementary Information  Supplementary Information. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Guangying Guo, Juan Long and Tianhua Xu contributed equally to this work and should be considered co-first authors. Supplementary Information The online version contains supplementary material available at 10.1038/s41598-025-13352-1. Acknowledgements This project was funded by grants from the National Natural Science Foundation of China (Grant Nos 82270779 and U21A20349) and the Liaoning Province Science and Technology Fund (Grant No. 2023-MSLH-398). Author contributions GG, XF, and LY designed the experiments; GG performed the majority of the experiments; JL carried out the immunofluorescence experiment; TX conducted the TEM; XL and DS performed all statistical analysis; GG, JL, TX, and LY wrote the manuscript. All the authors read and approved the final manuscript. Data availability Data will be made available from the corresponding author upon reasonable request. Declarations Competing interests The authors declare that they have no competing interests. Ethics approval The Animal Research Ethics Committee of China Medical University authorized the present research in accordance with the tenets of The Declaration of Helsinki. References 1. Kovesdy CP Epidemiology of chronic kidney disease: An update 2022 Kidney Int. Suppl. 2022 2011 12 7 11 10.1016/j.kisu.2021.11.003 PMC9073222 35529086 Kovesdy, C. P. Epidemiology of chronic kidney disease: An update 2022. Kidney Int. Suppl. 2011 10.1016/j.kisu.2021.11.003 PMC9073222 35529086 2. Modi ZJ Risk of cardiovascular disease and mortality in young adults with end-stage renal disease: An analysis of the US renal data system JAMA Cardiol. 2019 4 353 362 10.1001/jamacardio.2019.0375 30892557 PMC6484951 Modi, Z. J. et al. Risk of cardiovascular disease and mortality in young adults with end-stage renal disease: An analysis of the US renal data system. JAMA Cardiol. 4 30892557 10.1001/jamacardio.2019.0375 PMC6484951 3. Kalantar-Zadeh K Caring for patients with advanced chronic kidney disease: Dietary options and conservative care instead of maintenance dialysis J. Ren. Nutr. 2023 33 508 519 10.1053/j.jrn.2023.02.002 36796502 Kalantar-Zadeh, K. et al. Caring for patients with advanced chronic kidney disease: Dietary options and conservative care instead of maintenance dialysis. J. Ren. Nutr. 33 36796502 10.1053/j.jrn.2023.02.002 4. Hou Y-C Lu C-L Lu K-C Mineral bone disorders in chronic kidney disease Nephrology (Carlton) 2018 23 Suppl 4 88 94 10.1111/nep.13457 30298663 Hou, Y.-C., Lu, C.-L. & Lu, K.-C. Mineral bone disorders in chronic kidney disease. Nephrology (Carlton) 23 30298663 10.1111/nep.13457 5. Disthabanchong S Boongird S Role of different imaging modalities of vascular calcification in predicting outcomes in chronic kidney disease World J. Nephrol. 2017 6 100 110 10.5527/wjn.v6.i3.100 28540199 PMC5424431 Disthabanchong, S. & Boongird, S. Role of different imaging modalities of vascular calcification in predicting outcomes in chronic kidney disease. World J. Nephrol. 6 28540199 10.5527/wjn.v6.i3.100 PMC5424431 6. Bansal N Evolution of cardiovascular disease during the transition to end-stage renal disease Semin Nephrol. 2017 37 120 131 10.1016/j.semnephrol.2016.12.002 28410646 PMC5407373 Bansal, N. Evolution of cardiovascular disease during the transition to end-stage renal disease. SSemin Nephrol. 37 28410646 10.1016/j.semnephrol.2016.12.002 PMC5407373 7. Giachelli CM Vascular calcification mechanisms J. Am. Soc. Nephrol. 2004 15 2959 2964 10.1097/01.ASN.0000145894.57533.C4 15579497 Giachelli, C. M. Vascular calcification mechanisms. J. Am. Soc. Nephrol. 15 15579497 10.1097/01.ASN.0000145894.57533.C4 8. Shanahan CM Crouthamel MH Kapustin A Giachelli CM Arterial calcification in chronic kidney disease: Key roles for calcium and phosphate Circ. Res. 2011 109 697 711 10.1161/CIRCRESAHA.110.234914 21885837 PMC3249146 Shanahan, C. M., Crouthamel, M. H., Kapustin, A. & Giachelli, C. M. Arterial calcification in chronic kidney disease: Key roles for calcium and phosphate. Circ. Res. 109 21885837 10.1161/CIRCRESAHA.110.234914 PMC3249146 9. Abdellatif M Sedej S Carmona-Gutierrez D Madeo F Kroemer G Autophagy in cardiovascular aging Circ. Res. 2018 123 803 824 10.1161/CIRCRESAHA.118.312208 30355077 Abdellatif, M., Sedej, S., Carmona-Gutierrez, D., Madeo, F. & Kroemer, G. Autophagy in cardiovascular aging. Circ. Res. 123 30355077 10.1161/CIRCRESAHA.118.312208 10. Bravo-San Pedro JM Kroemer G Galluzzi L Autophagy and mitophagy in cardiovascular disease Circ. Res. 2017 120 1812 1824 10.1161/CIRCRESAHA.117.311082 28546358 Bravo-San Pedro, J. M., Kroemer, G. & Galluzzi, L. Autophagy and mitophagy in cardiovascular disease. Circ. Res. 120 28546358 10.1161/CIRCRESAHA.117.311082 11. Kroemer G Levine B Autophagic cell death: The story of a misnomer Nat. Rev. Mol. Cell Biol. 2008 9 1004 1010 10.1038/nrm2529 18971948 PMC2727358 Kroemer, G. & Levine, B. Autophagic cell death: The story of a misnomer. Nat. Rev. Mol. Cell Biol. 9 18971948 10.1038/nrm2527 PMC2727358 12. Levine B Kroemer G Biological functions of autophagy genes: A disease perspective Cell 2019 176 11 42 10.1016/j.cell.2018.09.048 30633901 PMC6347410 Levine, B. & Kroemer, G. Biological functions of autophagy genes: A disease perspective. Cell 176 30633901 10.1016/j.cell.2018.09.048 PMC6347410 13. Mizushima N Komatsu M Autophagy: Renovation of cells and tissues Cell 2011 147 728 741 10.1016/j.cell.2011.10.026 22078875 Mizushima, N. & Komatsu, M. Autophagy: Renovation of cells and tissues. Cell 147 22078875 10.1016/j.cell.2011.10.026 14. Dai X-Y Phosphate-induced autophagy counteracts vascular calcification by reducing matrix vesicle release Kidney Int. 2013 83 1042 1051 10.1038/ki.2012.482 23364520 Dai, X.-Y. et al. Phosphate-induced autophagy counteracts vascular calcification by reducing matrix vesicle release. Kidney Int. 83 23364520 10.1038/ki.2012.482 15. Chasapis CT Ntoupa P-SA Spiliopoulou CA Stefanidou ME Recent aspects of the effects of zinc on human health Arch. Toxicol. 2020 94 1443 1460 10.1007/s00204-020-02702-9 32394086 Chasapis, C. T., Ntoupa, P.-S.A., Spiliopoulou, C. A. & Stefanidou, M. E. Recent aspects of the effects of zinc on human health. Arch. Toxicol. 94 32394086 10.1007/s00204-020-02702-9 16. Ozyildirim S Baltaci SB Cardiovascular diseases and zinc Biol. Trace. Elem. Res. 2023 201 1615 1626 10.1007/s12011-022-03292-6 35672544 Ozyildirim, S. & Baltaci, S. B. Cardiovascular diseases and zinc. Biol. Trace. Elem. Res. 201 35672544 10.1007/s12011-022-03292-6 17. Nakatani S Mori K Shoji T Emoto M Association of zinc deficiency with development of CVD events in patients with CKD Nutrients 2021 13 1680 10.3390/nu13051680 34063377 PMC8156917 Nakatani, S., Mori, K., Shoji, T. & Emoto, M. Association of zinc deficiency with development of CVD events in patients with CKD. Nutrients 13 34063377 10.3390/nu13051680 PMC8156917 18. Zhang D Associations of whole blood zinc levels with coronary artery calcification and future cardiovascular events in CKD patients Biol. Trace Elem. Res. 2024 202 46 55 10.1007/s12011-023-03655-7 37071258 Zhang, D. et al. Associations of whole blood zinc levels with coronary artery calcification and future cardiovascular events in CKD patients. Biol. Trace Elem. Res. 202 37071258 10.1007/s12011-023-03655-7 19. Chen Z Zinc ameliorates human aortic valve calcification through GPR39 mediated ERK1/2 signalling pathway Cardiovasc. Res. 2021 117 820 835 10.1093/cvr/cvaa090 32259211 Chen, Z. et al. Zinc ameliorates human aortic valve calcification through GPR39 mediated ERK1/2 signalling pathway. Cardiovasc. Res. 117 32259211 10.1093/cvr/cvaa090 20. Henze LA Zinc ameliorates the osteogenic effects of high glucose in vascular smooth muscle cells Cells 2021 10 3083 10.3390/cells10113083 34831306 PMC8623153 Henze, L. A. et al. Zinc ameliorates the osteogenic effects of high glucose in vascular smooth muscle cells. Cells 10 34831306 10.3390/cells10113083 PMC8623153 21. Alcantara EH Kwon J-H Kang M-K Cho Y-E Kwun I-S Zinc deficiency promotes calcification in vascular smooth muscle cells independent of alkaline phosphatase action and partly impacted by Pit1 upregulation Nutrients 2024 16 291 10.3390/nu16020291 38257184 PMC10819640 Alcantara, E. H., Kwon, J.-H., Kang, M.-K., Cho, Y.-E. & Kwun, I.-S. Zinc deficiency promotes calcification in vascular smooth muscle cells independent of alkaline phosphatase action and partly impacted by Pit1 upregulation. Nutrients 16 38257184 10.3390/nu16020291 PMC10819640 22. Voelkl J Zinc inhibits phosphate-induced vascular calcification through TNFAIP3-mediated suppression of NF-κB J. Am. Soc. Nephrol. 2018 29 1636 1648 10.1681/ASN.2017050492 29654213 PMC6054342 Voelkl, J. et al. Zinc inhibits phosphate-induced vascular calcification through TNFAIP3-mediated suppression of NF-κB. J. Am. Soc. Nephrol. 29 29654213 10.1681/ASN.2017050492 PMC6054342 23. Chen W Association between dietary zinc intake and abdominal aortic calcification in US adults Nephrol Dial Transplant 2020 35 1171 1178 10.1093/ndt/gfz134 31298287 PMC7417001 Chen, W. et al. Association between dietary zinc intake and abdominal aortic calcification in US adults. Nephrol Dial Transplant 35 31298287 10.1093/ndt/gfz134 PMC7417001 24. Kong X Wang W Associations between the composite dietary antioxidant index and abdominal aortic calcification among United States adults: A cross-sectional study JPEN J. Parenter Enteral. Nutr. 2024 48 571 579 10.1002/jpen.2638 38734926 Kong, X. & Wang, W. Associations between the composite dietary antioxidant index and abdominal aortic calcification among United States adults: A cross-sectional study. JPEN J. Parenter Enteral. Nutr. 48 38734926 10.1002/jpen.2638 25. Molenda M Kolmas J The role of zinc in bone tissue health and regeneration: A review Biol. Trace. Elem. Res. 2023 201 5640 5651 10.1007/s12011-023-03631-1 37002364 PMC10620276 Molenda, M. & Kolmas, J. The role of zinc in bone tissue health and regeneration: A review. Biol. Trace. Elem. Res. 201 37002364 10.1007/s12011-023-03631-1 PMC10620276 26. Hadj Abdallah N Zinc mitigates renal ischemia-reperfusion injury in rats by modulating oxidative stress, endoplasmic reticulum stress, and autophagy J. Cell Physiol. 2018 233 8677 8690 10.1002/jcp.26747 29761825 Hadj Abdallah, N. et al. Zinc mitigates renal ischemia-reperfusion injury in rats by modulating oxidative stress, endoplasmic reticulum stress, and autophagy. J. Cell Physiol. 233 29761825 10.1002/jcp.26747 27. Lin J-Q Zinc provides neuroprotection by regulating NLRP3 inflammasome through autophagy and ubiquitination in a spinal contusion injury model CNS Neurosci. Ther. 2021 27 413 425 10.1111/cns.13460 33034415 PMC7941232 Lin, J.-Q. et al. Zinc provides neuroprotection by regulating NLRP3 inflammasome through autophagy and ubiquitination in a spinal contusion injury model. CNS Neurosci. Ther. 27 33034415 10.1111/cns.13460 PMC7941232 28. Hwang JJ Zinc(II) ion mediates tamoxifen-induced autophagy and cell death in MCF-7 breast cancer cell line Biometals 2010 23 997 1013 10.1007/s10534-010-9346-9 20524045 Hwang, J. J. et al. Zinc(II) ion mediates tamoxifen-induced autophagy and cell death in MCF-7 breast cancer cell line. Biometals 23 20524045 10.1007/s10534-010-9346-9 29. Liuzzi JP Yoo C Role of zinc in the regulation of autophagy during ethanol exposure in human hepatoma cells Biol. Trace Elem. Res. 2013 156 350 356 10.1007/s12011-013-9816-3 24061963 Liuzzi, J. P. & Yoo, C. Role of zinc in the regulation of autophagy during ethanol exposure in human hepatoma cells. Biol. Trace Elem. Res. 156 24061963 10.1007/s12011-013-9816-3 30. Bian X Zinc prevents mitochondrial superoxide generation by inducing mitophagy in the setting of hypoxia/reoxygenation in cardiac cells Free Radic. Res. 2018 52 80 91 10.1080/10715762.2017.1414949 29216769 Bian, X. et al. Zinc prevents mitochondrial superoxide generation by inducing mitophagy in the setting of hypoxia/reoxygenation in cardiac cells. Free Radic. Res. 52 29216769 10.1080/10715762.2017.1414949 31. Neven E Disturbances in bone largely predict aortic calcification in an alternative rat model developed to study both vascular and bone pathology in chronic kidney disease J. Bone Miner Res. 2015 30 2313 2324 10.1002/jbmr.2585 26108730 Neven, E. et al. Disturbances in bone largely predict aortic calcification in an alternative rat model developed to study both vascular and bone pathology in chronic kidney disease. J. Bone Miner Res. 30 26108730 10.1002/jbmr.2585 32. Nakatani S Association between serum zinc and calcification propensity (T50) in Patients with Type 2 diabetes mellitus and in vitro effect of exogenous zinc on T50 Biomedicines 2020 8 337 10.3390/biomedicines8090337 32916995 PMC7555216 Nakatani, S. et al. Association between serum zinc and calcification propensity (T50) in Patients with Type 2 diabetes mellitus and in vitro effect of exogenous zinc on T50. Biomedicines 8 32916995 10.3390/biomedicines8090337 PMC7555216 33. Sohail A Association of serum zinc with mineral stress in chronic kidney disease Clin. Kidney J. 2024 17 sfae258 10.1093/ckj/sfae258 39286240 PMC11403325 Sohail, A. et al. Association of serum zinc with mineral stress in chronic kidney disease. Clin. Kidney J. 17 39286240 10.1093/ckj/sfae258 PMC11403325 34. Geroldinger-Simic M Accelerated calciprotein crystallization time (T50) is correlated with impaired lung diffusion capacity in systemic sclerosis Front. Immunol. 2024 15 1425885 10.3389/fimmu.2024.1425885 39399492 PMC11466802 Geroldinger-Simic, M. et al. Accelerated calciprotein crystallization time (T50) is correlated with impaired lung diffusion capacity in systemic sclerosis. Front. Immunol. 15 39399492 10.3389/fimmu.2024.1425885 PMC11466802 35. Kunishige R Calciprotein particle-induced cytotoxicity via lysosomal dysfunction and altered cholesterol distribution in renal epithelial HK-2 cells Sci. Rep. 2020 10 20125 10.1038/s41598-020-77308-3 33208865 PMC7676272 Kunishige, R. et al. Calciprotein particle-induced cytotoxicity via lysosomal dysfunction and altered cholesterol distribution in renal epithelial HK-2 cells. Sci. Rep. 10 33208865 10.1038/s41598-020-77308-3 PMC7676272 36. Hall AG King JC McDonald CM Comparison of serum, plasma, and liver zinc measurements by AAS, ICP-OES, and ICP-MS in diverse laboratory settings Biol. Trace Elem. Res. 2022 200 2606 2613 10.1007/s12011-021-02883-z 34453311 PMC9132797 Hall, A. G., King, J. C. & McDonald, C. M. Comparison of serum, plasma, and liver zinc measurements by AAS, ICP-OES, and ICP-MS in diverse laboratory settings. Biol. Trace Elem. Res. 200 34453311 10.1007/s12011-021-02883-z PMC9132797 37. Suzuki T Kajita Y Katsumata S Matsuzaki H Suzuki K Zinc deficiency increases serum concentrations of parathyroid hormone through a decrease in serum calcium and induces bone fragility in rats J. Nutr. Sci. Vitaminol. 2015 61 382 390 10.3177/jnsv.61.382 26639846 Suzuki, T., Kajita, Y., Katsumata, S., Matsuzaki, H. & Suzuki, K. Zinc deficiency increases serum concentrations of parathyroid hormone through a decrease in serum calcium and induces bone fragility in rats. J. Nutr. Sci. Vitaminol. 61 26639846 10.3177/jnsv.61.382 38. Park KH Zinc promotes osteoblast differentiation in human mesenchymal stem cells via activation of the cAMP-PKA-CREB signaling pathway Stem Cells Dev. 2018 27 1125 1135 10.1089/scd.2018.0023 29848179 Park, K. H. et al. Zinc promotes osteoblast differentiation in human mesenchymal stem cells via activation of the cAMP-PKA-CREB signaling pathway. Stem Cells Dev. 27 29848179 10.1089/scd.2018.0023 39. Ceylan MN Akdas S Yazihan N Is zinc an important trace element on bone-related diseases and complications? A meta-analysis and systematic review from serum level, dietary intake, and supplementation aspects Biol. Trace Elem. Res. 2021 199 535 549 10.1007/s12011-020-02193-w 32451694 Ceylan, M. N., Akdas, S. & Yazihan, N. Is zinc an important trace element on bone-related diseases and complications? A meta-analysis and systematic review from serum level, dietary intake, and supplementation aspects. Biol. Trace Elem. Res. 199 32451694 10.1007/s12011-020-02193-w 40. Liuzzi JP Pazos R Interplay between autophagy and zinc J. Trace Elem. Med Biol. 2020 62 126636 10.1016/j.jtemb.2020.126636 32957075 Liuzzi, J. P. & Pazos, R. Interplay between autophagy and zinc. J. Trace Elem. Med Biol. 62 32957075 10.1016/j.jtemb.2020.126636 41. Liuzzi JP Narayanan V Doan H Yoo C Effect of zinc intake on hepatic autophagy during acute alcohol intoxication Biometals 2018 31 217 232 10.1007/s10534-018-0077-7 29392448 PMC5866217 Liuzzi, J. P., Narayanan, V., Doan, H. & Yoo, C. Effect of zinc intake on hepatic autophagy during acute alcohol intoxication. Biometals 31 29392448 10.1007/s10534-018-0077-7 PMC5866217 42. Allen-Redpath K Marginal dietary zinc deficiency in vivo induces vascular smooth muscle cell apoptosis in large arteries Cardiovasc. Res. 2013 99 525 534 10.1093/cvr/cvt114 23667188 Allen-Redpath, K. et al. Marginal dietary zinc deficiency in vivo induces vascular smooth muscle cell apoptosis in large arteries. Cardiovasc. Res. 99 23667188 10.1093/cvr/cvt114 43. Chavkin NW Chia JJ Crouthamel MH Giachelli CM Phosphate uptake-independent signaling functions of the type III sodium-dependent phosphate transporter, PiT-1, in vascular smooth muscle cells Exp. Cell Res. 2015 333 39 48 10.1016/j.yexcr.2015.02.002 25684711 PMC4387109 Chavkin, N. W., Chia, J. J., Crouthamel, M. H. & Giachelli, C. M. Phosphate uptake-independent signaling functions of the type III sodium-dependent phosphate transporter, PiT-1, in vascular smooth muscle cells. Exp. Cell Res. 333 25684711 10.1016/j.yexcr.2015.02.002 PMC4387109 44. Zhu D Mackenzie NCW Millan JL Farquharson C MacRae VE A protective role for FGF-23 in local defence against disrupted arterial wall integrity? Mol. Cell Endocrinol. 2013 372 1 11 10.1016/j.mce.2013.03.008 23523568 PMC3725806 Zhu, D., Mackenzie, N. C. W., Millan, J. L., Farquharson, C. & MacRae, V. E. A protective role for FGF-23 in local defence against disrupted arterial wall integrity?. Mol. Cell Endocrinol. 372 23523568 10.1016/j.mce.2013.03.008 PMC3725806 45. Toita R Protein kinase A (PKA) inhibition reduces human aortic smooth muscle cell calcification stimulated by inflammatory response and inorganic phosphate Life Sci. 2018 209 466 471 10.1016/j.lfs.2018.08.051 30144450 Toita, R. et al. Protein kinase A (PKA) inhibition reduces human aortic smooth muscle cell calcification stimulated by inflammatory response and inorganic phosphate. Life Sci. 209 30144450 10.1016/j.lfs.2018.08.051 ",
  "metadata": {
    "Title of this paper": "Protein kinase A (PKA) inhibition reduces human aortic smooth muscle cell calcification stimulated by inflammatory response and inorganic phosphate",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484616/"
  }
}