{
  "title": "Paper_529",
  "abstract": "pmc Lupus Sci Med Lupus Sci Med 2614 lupus lupus Lupus Science & Medicine 2053-8790 BMJ Publishing Group PMC12481352 PMC12481352.1 12481352 12481352 41027684 10.1136/lupus-2025-001653 lupus-2025-001653 1 Original Research Epidemiology and Outcomes 2257 1506 Characterisation of systemic lupus erythematosus associated with immune checkpoint inhibitors: a pharmacovigilance study using FAERS database https://orcid.org/0009-0003-4555-7099 Zhen Lan 1 0 0 https://orcid.org/0009-0002-0729-3144 Chen Hong 2 0 0 https://orcid.org/0009-0006-8979-5066 Pan Wuyuan 1 https://orcid.org/0009-0008-1193-645X Song Jianrong 1 https://orcid.org/0009-0009-9209-916X Yi Huan 1 * https://orcid.org/0000-0002-4811-5064 Zhou Hong 3 1 Department of Gynecology Oncology Fujian Maternity and Child Health Hospital Fuzhou Fujian China 2 Department of Neurology Fujian Provincial Hospital, Fuzhou University Affiliated Provincial Hospital, Shengli Clinical College of Fujian Medical University Fuzhou Fujian China 3 Department of Pharmacy Fujian Maternity and Child Health Hospital Fuzhou Fujian China Supplemental material This content has been supplied by the author(s). It has not been vetted by BMJ Publishing Group Limited (BMJ) and may not have been peer-reviewed. Any opinions or recommendations discussed are solely those of the author(s) and are not endorsed by BMJ. BMJ disclaims all liability and responsibility arising from any reliance placed on the content. Where the content includes any translated material, BMJ does not warrant the accuracy and reliability of the translations (including but not limited to local regulations, clinical guidelines, terminology, drug names and drug dosages), and is not responsible for any error and/or omissions arising from translation and adaptation or otherwise. Supplement: https://doi.org/10.1136/lupus-2025-001653 None declared. Dr Hong Zhou; banny_80p@msn.cn Dr Huan Yi; yi.huan@fjmu.edu.cn LZ and HC contributed equally. LZ and HC are joint first authors. 2025 30 9 2025 12 2 492040 e001653 30 4 2025 07 9 2025 30 09 2025 01 10 2025 01 10 2025 Copyright © Author(s) (or their employer(s)) 2025. Re-use permitted under CC BY-NC. No commercial re-use. See rights and permissions. Published by BMJ Group. 2025 https://creativecommons.org/licenses/by-nc/4.0/ This is an open access article distributed in accordance with the Creative Commons Attribution Non Commercial (CC BY-NC 4.0) license, which permits others to distribute, remix, adapt, build upon this work non-commercially, and license their derivative works on different terms, provided the original work is properly cited, appropriate credit is given, any changes made indicated, and the use is non-commercial. See: http://creativecommons.org/licenses/by-nc/4.0/ Abstract Objectives SLE associated with immune checkpoint inhibitors (ICIs) is rare, and a comprehensive profile of ICI-induced SLE remains poorly characterised. This study aimed to explore the potential association between ICIs and SLE and characterise clinical features. Methods We extracted adverse event reports of patients with cancer with SLE from the FAERS (US Food and Drug Administration Adverse Event Reporting System) database (Q1 2011–Q4 2024). A disproportionality analysis was conducted using the reporting OR (ROR) and the information component, with adjusted ROR calculated via logistic regression to control for confounders. Results 146 066 ICI-related adverse events cases from patients with cancer were identified. Among these, 209 (median (IQR) age 63 (55.3–71.7) years; 106 (51%) female) cases of SLEs were reported. Our analysis detected significant positive signals for SLE associated with ICIs overall, particularly for anti-programmed cell death protein 1 (PD-1) and anti-programmed death-ligand 1 therapy. Eight positive signals of SLEs were identified, predominantly cutaneous lupus and SLE. The risk of ICI-related SLEs was significantly higher in females than in males. However, age and chemotherapy were not significant risk factors for the incidence of ICI-related SLEs. The risk was higher with anti-PD-1 therapy compared with other ICI therapies. Patients with lung cancer, melanoma or breast cancer appeared to be at higher risk. Most patients experienced serious outcomes, with a mortality rate of 4.31% (nine cases). Conclusion This first pharmacovigilance study identified a significant association between ICI use and SLEs, suggesting ICIs may constitute a novel class of drug-induced SLE triggers. Personalised long-term safety monitoring for ICIs is warranted for high-risk patients (eg, females, anti-PD-1 recipients). Systemic Lupus Erythematosus Epidemiology Lupus Erythematosus, Systemic Risk Factors Natural Science Foundation of Fujian Province of China 2024J08264 Joint Funds for the Innovation of Science and Technology, Fujian Province 2024Y9567 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes WHAT IS ALREADY KNOWN ON THIS TOPIC Current knowledge about SLE associated with immune checkpoint inhibitors (ICIs) is limited, primarily derived from case reports and small case series. WHAT THIS STUDY ADDS This study analysed 146 066 ICI-related adverse event reports and identified 209 cases of SLE (0.14%), providing the most comprehensive real-world safety profile of ICI-associated SLE to date. Disproportionality analysis revealed a significant association between ICIs and SLE. Furthermore, female patients with lung cancer, melanoma or breast cancer, or those on anti-programmed cell death protein 1 therapy may be at higher risk of ICI-related SLE. HOW THIS STUDY MIGHT AFFECT RESEARCH, PRACTICE OR POLICY Our findings suggest that ICIs should be added to the evolving list of drug-induced SLE. In clinical practice, heightened vigilance and individualised monitoring are warranted for at-risk patients. Introduction The advent of immune checkpoint inhibitors (ICIs) has transformed the therapeutic landscape of oncology, offering unprecedented clinical benefits across multiple malignancies. 1 2 3 3 5 6 7 8 SLE constitutes a clinically heterogeneous systemic autoimmune disease, frequently culminating in multi-organ damage. The broadening therapeutic landscape of ICIs has seen the concomitant emergence of multiple de novo SLE cases, as evidenced by accumulating pharmacovigilance reports. 8 14 15 16 17 18 19 Pharmacovigilance studies using large-scale databases such as the US Food and Drug Administration (FDA) Adverse Event Reporting System (FAERS) offer a powerful approach to detecting potential safety signals for rare adverse drug reactions. 20 21 22 24 25 et al 26 27 26 To date, no comprehensive pharmacovigilance study has systematically evaluated the association between ICIs and SLE using disproportionality analysis from FAERS. This study leverages FAERS to explore the potential association between ICI and SLE, along with their characteristics and prognosis. Methods Data sources and collection This study was conducted in accordance with the READUS-PV (Reporting of a Disproportionality Analysis for Drug Safety Signal detection using individual case safety reports in pharmacoVigilance) guidelines. 28 29 30 31 32 As of 2024, the FDA has approved 12 ICIs targeting PD-1, PD-L1, CTLA-4 and lymphocyte activation gene-3 (LAG-3), which include the following agents: anti-PD-1 (pembrolizumab, nivolumab, tislelizumab, dostarlimab, toripalimab and cemiplimab), anti-PD-L1 (atezolizumab, durvalumab and avelumab), anti-CTLA-4 (ipilimumab and tremelimumab) and anti-LAG-3 (relatlimab). Both generic and brand names were used to identify adverse events (AEs) cases related to ICI agents. SMQs include narrow and/or broad scope term. A ‘narrow’ scope identifies cases that are highly likely to represent the condition of interest and a ‘broad’ scope those instances in which a user seeks to identify all possible cases. 31 online supplemental table 1 20 Statistical analysis In the study, we used descriptive statistical methods to analyse the clinical features of SLE linked to ICIs, as documented in the FAERS database. Time from the initiation of the ICIs to the start of the adverse event for all SLE events was evaluated using the Kruskal-Wallis test, with a significance threshold of p<0.05. We performed two different disproportionality approaches to increase the consistency and robustness of results and reduce the risk of finding false positive signals. The reporting OR (ROR), a frequentist method, 20 23 33 22 34 35 33 online supplemental table 2 In the treatment regimen of ICIs, a common strategy to enhance therapeutic efficacy is the combination of ICIs with other drugs. Moreover, due to the potential presence of various comorbidities in patients, the use of multiple medications is a frequent occurrence. These drug combinations may influence the onset and progression of SLE. To improve the reliability of our research findings and minimise these potential biases, we employed multivariable logistic regression to adjust for the ROR of concomitant drugs (including carboplatin, pemetrexed, paclitaxel and proton pump inhibitors (PPIs)). Factors such as ICI treatment strategy, age, sex, whether the individual had combined chemotherapy therapy were defined as risk factors for ICI-related SLEs. Univariate and multivariable logistic regression analyses were used to calculate the OR for the occurrence of SLE among ICI-associated AEs compared with those without SLE under different exposures. Time to onset is calculated as the interval between EVENT_DT (the date of occurrence of AEs) and START_DT (the drug start date). All statistical analyses were conducted using IBM SPSS statistics software (V.21.0) or R (V.4.4.2). Results Descriptive characteristics From the first quarter of 2011 to the fourth quarter of 2024, a total of 2 113 676 AE cases from patients with malignancies from FAERS database. Among these, there were 146 066 AE cases under ICI agents. Our research identified 209 cases associated with ICI as the primary suspected drug. The flow chart of data processing was detailed in online supplemental figure 1 table 1 online supplemental table 3 Table 1 The characteristics of patients with ICI-related SLE events Characteristics Cases, N (%) Number of cases 209 Sex Male 84 (40.19) Female 106 (50.72) Unknown 19 (9.09) Age, years Median (IQR) 63 (55.3–71.7) <18 8 (3.83) 18≥ and <45 15 (7.18) 45≥ and <65 67 (32.06) 65≥ and <75 53 (25.36) ≥75 23 (11) Unknown 43 (20.57) Time to onset, days-median (IQR) 81 (28–211) Reported countries (top five) USA 66 (31.58) France 49 (23.44) Japan 30 (14.35) Germany 15 (7.18) China 6 (2.87) Reported person Health professional 184 (88.04) Consumer 22 (10.53) Unknown 3 (1.44) Treatment strategy Anti-PD-1 158 (75.6) Anti-PD-L1 29 (13.88) Anti-CTLA-4 4 (1.91) Combination therapy 18 (8.61) Plus chemotherapy No 167 (79.9) Yes 42 (20.1) Plus targeted therapy No 202 (96.65) Yes 7 (3.35) Tumour indications Lung 97 (46.41) Melanoma 41 (19.62) Breast 20 (9.57) Gastrointestinal 14 (6.7) Renal 8 (3.83) Gynaecological 7 (3.35) Head and neck 5 (2.39) Skin 2 (0.96) Haematological 1 (0.48) Unspecified 14 (6.7) Serious outcome Death 9 (4.31) Disability 3 (1.44) Hospitalisation 64 (30.62) Other serious 129 (61.72) Unknown 4 (1.91) CTLA-4, cytotoxic T-lymphocyte-associated protein 4; ICI, immune checkpoint inhibitor; PD-1, programmed cell death protein 1; PD-L1, programmed death-ligand 1. Signal analysis for ICI-related SLEs We identified significant safety signals between ICIs and SLEs based on the FAERS database ( figure 1 figure 1 Figure 1 Signal analysis for ICI-related SLEs associated with different ICI treatment strategies based on the FAERS database. CTLA-4, cytotoxic T-lymphocyte-associated protein 4; FAERS, FDA Adverse Event Reporting System; FDA, US Food and Drug Administration; ICI, immune checkpoint inhibitor; PD-L1, programmed death-ligand 1; PD-1, programmed cell death protein 1; ROR, reporting OR. We found eight statistically positive signals ( table 2 table 2 online supplemental table 4 Table 2 Adjusted reporting odds ratios (aROR) for ICI associated SLE compared with non-ICI treatments in the FAERS AE Case number with SLE ROR (95% CI) IC (95% CI) aROR (95% CI) * With ICI Without ICI Overall 209/145 857 1168/1 966 442 2.41 (2.08 to 2.8) 1.14 (0.91 to 1.34) 2.26 (1.90 to 2.66) † Subacute cutaneous lupus erythematosus 64/146 002 342/1 967 268 2.52 (1.91 to 3.27) 1.19 (0.77 to 1.54) 2.13 (1.57 to 2.82) † Systemic lupus erythematosus 61/146 005 323/1 967 287 2.54 (1.92 to 3.32) 1.2 (0.77 to 1.56) 2.51 (1.75 to 3.50) † Cutaneous lupus erythematosus 25/146 041 165/1 967 445 2.04 (1.31 to 3.05) 0.93 (0.27 to 1.48) 1.86 (1.15 to 2.86) † Lupus-like syndrome 18/146 048 130/1 967 480 1.87 (1.10 to 2.97) 0.82 (0.05 to 1.45) 1.89 (1.07 to 3.14) † Antinuclear antibody positive 15/146 051 54/1 967 556 3.74 (2.04 to 6.46) 1.65 (0.66 to 2.25) 4.14 (2.11 to 7.59 † Antinuclear antibody increased 11/146 055 29/1 967 581 5.11 (2.44 to 9.94) 1.99 (0.7 to 2.59) 5.42 (2.22 to 11.99) † Chronic cutaneous lupus erythematosus 10/146 056 38/1 967 572 3.55 (1.67 to 6.84) 1.59 (0.36 to 2.29) 3.42 (1.47 to 7.05) † Lupus nephritis 6/146 060 25/1 967 585 3.23 (1.20 to 7.38) 1.49 (0.33 to 1.92) 3.44 (1.13 to 8.69) † * Adjusted ROR, adjusted for age, sex and concomitant drugs (including carboplatin, pemetrexed, paclitaxel and proton pump inhibitors) via a multivariable logistic regression. † P<0.05 was considered statistically significant. AE, adverse event; FAERS, FDA Adverse Event Reporting System; FDA, US Food and Drug Administration; IC, information component; ICI, immune checkpoint inhibitor. In addition, given that ‘antinuclear antibody positive’ and ‘antinuclear antibody increase’ were the AEs with the highest aROR, we conducted a sensitivity analysis excluding these cases in overall ICIs. The results still indicated a disproportionate reporting of ICI-associated SLEs (ROR 2.27, 95% CI: 1.94 to 2.65; IC 1.06, 95% CI: 0.82 to 1.28; aROR 2.11, 95% CI: 1.75 to 2.51). Influencing factors for ICI-related SLEs Table 3 online supplemental table 5 Table 3 Clinical characteristics of patients who had ICI-related SLE events Characteristics Subacute cutaneous lupus erythematosus Systemic lupus erythematosus Cutaneous lupus erythematosus Lupus-like syndrome Antinuclear antibody positive Antinuclear antibody increased Chronic cutaneous lupus erythematosus Lupus nephritis Number of cases (%) 64 (30.6) 61 (29.2) 25 (12) 18 (8.6) 15 (7.2) 11 (5.3) 10 (4.8) 6 (2.9) Sex (female/male) 37/25 32/20 10/12 8/10 8/7 4/5 4/4 3/3 Age, median (IQR) 62 (55.5–72) 61.5 (55–66) 68 (62–72) 63 (57–65) 66 (62–73) 69 (43.25–78) 55 (46.25–69.25) 30 (29–64) Time to onset, days, median (IQR) 81 (49–173) 120 (46.5–120) 103 (34–179) 43.5 (0.75–176.5) 28 (14–62.5) 72 (44–128.5) 121 (106–307) 151.5 (111.25–191.75) Treatment strategy PEM: 21 PEM: 26 PEM: 10 PEM: 13 PEM: 11 PEM: 4 PEM: 4 PEM: 2 Tumour indications Lung: 32 Lung: 26 Lung: 12 Lung: 11 Lung: 6 Lung: 4 Lung: 3 Lung: 1 Fatal cases 0 5 0 0 1 2 0 1 ATE, atezolizumab; AVE, avelumab; CEM, cemiplimab; DOS, dostarlimab; DUR, durvalumab; ICI, immune checkpoint inhibitor; IPI, ipilimumab; NIV, nivolumab; PEM, pembrolizumab; TIS, tislelizumab. As shown in table 4 Table 4 OR of clinical characteristics for ICI-related SLE events Variable OR (univariable) OR (multivariable) Age – <18 Ref 18≥ and <45 1.69 (0.73–4.20, p=0.231) 45≥ and <65 1.37 (0.70–3.11, p=0.396) 65≥ and <75 1.20 (0.60–2.73, p=0.633) ≥75 0.79 (0.37–1.88, p=0.565) Sex Male Ref Ref Ref 2.14 (1.57–2.92, p<0.001) 1.93 (1.40–2.68, p<0.001) Treatment strategy Anti-PD-1 Ref Ref Anti-PD-L1 0.43 (0.26–0.67, p<0.001) 0.40 (0.24–0.64, p<0.001) Anti-CTLA-4 0.32 (0.08–0.86, p=0.054) 0.22 (0.05–0.61, p=0.012) Combination therapy 0.29 (0.15–0.51, p<0.001) 0.27 (0.14–0.48, p<0.001) Plus chemotherapy No Ref Ref Yes 1.83 (1.24–2.64, p=0.002) 1.45 (0.93–2.21, p=0.092) Tumour indications Other Ref Ref Lung 2.99 (2.02–4.50, p<0.001) 2.95 (1.97–4.48, p<0.001) Melanoma 2.78 (1.76–4.42, p<0.001) 3.54 (2.20–5.70, p<0.001) Breast 5.57 (3.00–9.86, p<0.001) 3.07 (1.55–5.85, p=0.001) CTLA-4, cytotoxic T-lymphocyte-associated protein 4; ICI, immune checkpoint inhibitor; PD-1, programmed cell death protein 1; PD-L1, programmed death-ligand 1; Ref, Reference. Time to onset analysis A total of 81 ICI-related SLEs with available onset times were included for analysis. The median onset time was 81 days (IQR 28–211). The time to onset analysis of ICI-related SLEs is shown in figure 2 figure 2A figure 2B figure 2B Figure 2 Time to onset analysis. ( A B Discussion ICIs have become standard therapeutic agents for a growing number of malignancies, while ICI-induced lupus remains a rare clinical entity. There remains a paucity of data regarding SLE in the setting of checkpoint inhibitor usage. Our study represents the first comprehensive pharmacovigilance analysis investigating the association between ICIs and SLE using the FAERS database. We characterised the clinical features of ICI-associated SLE cases. Our disproportionality analysis revealed significant positive signals for ICI-related SLE, with the association being assessed through adjusted RORs. Furthermore, we evaluated potential risk factors and conducted time-to-onset analysis for these irAEs. In the present study, ICI-associated SLE reporting was rare. Among 146 066 ICI-related reports submitted to FAERS, 0.14% involved SLEs as defined by MedDRA. The gender distribution shows a higher risk in females than in males. The age range is broad, mainly concentrated between 45 and 75 years, with a median age of 63 (IQR 55.3–71.7). The predominant immunotherapy regimen is the combination of chemotherapy and PD-1/PD-L1 inhibitors, which are used in the treatment of lung cancer, melanoma and breast cancer. Recent literature reviews of 29 ICI-associated SLE case series revealed comparable demographic and therapeutic patterns to our study, including median age, sex distribution, treatment regimens and oncological indications. 8 36 The association was further confirmed through aROR analysis accounting for sex, age and concomitant medications. Notably, most ICI regimens involved combination therapy with chemotherapeutic agents (paclitaxel, carboplatin, pemetrexed) and PPIs. PPIs have been increasingly reported to induce SCLE, 26 37 38 39 The most frequently reported clinical spectrum in our analysis involved subacute cutaneous lupus erythematosus, consistent with prior case reports and reviews. 10 13 6 40 41 8 Regarding risk factors for ICI-related SLEs, we found that women were at significantly higher risk than men. Autoimmune diseases were generally more prevalent in women than in men, with rheumatic autoimmune diseases being particularly pronounced in women. 42 43 15 Intriguingly, the combination of ICIs and chemotherapy did not achieve statistical significance in multivariate analyses. While chemotherapy-containing regimens generally increased the incidence of treatment-related AEs, they were associated with lower irAEs compared with ICI monotherapy. However, the occurrence of specific irAEs varied by organ system and severity. 44 45 46 25 In this study, time-to-onset analysis revealed both early and delayed occurrences, with more than half of the AEs occurring within the first 3 months and approximately 20% of cases developing more than 1 year after treatment initiation. The median onset time was 81 days, and other serious events were recorded in most cases, with nine deaths. These findings demonstrate that ICI-induced SLE symptoms typically manifest after months to years of drug exposure, although acute onset may also occur. This highlights the importance of long-term monitoring of SLEs in patients receiving ICI therapy. The present study revealed that the overall mortality rate associated with ICI-related SLE was relatively low (4.31%, 9/209), comparable to that observed in non-ICI populations (4.2%, 49/1168; p=0.592), suggesting that ICI use may not increase the fatal risk of SLE. This finding indicates a generally favourable prognosis, consistent with previous reports on drug-induced lupus, 36 47 Despite these insights, our study has limitations. The FAERS database primarily includes voluntarily reported data, which may lead to under-reporting and potential bias in the reported cases. However, it is noteworthy that 88.04% of the AE reports collected in our study were derived from healthcare professionals. Additionally, disproportionality analysis alone cannot prove causation or measure incidence, and it has specific limitations, including confounding and reporting bias. Given the inherent heterogeneity and potential reporting bias in the FAERS database, we restricted the analysed population, performed two different disproportionality approaches and conducted sensitivity analyses to mitigate bias. 20 32 48 In conclusion, this first comprehensive pharmacovigilance analysis provides valuable insights into the association between ICIs and SLE, as gathered from the FAERS database. Although SLE associated with ICI appears rare, the increasing use of ICIs in clinical practice strengthens the importance of maintaining awareness and sustained long-term vigilance by clinicians of this evolving drug-induced clinical entity. Our findings emphasise the need for heightened surveillance and targeted long monitoring strategies in the first 3 months after ICI initiation, including early detection of antinuclear antibody, surveillance for cutaneous manifestations and risk-stratified monitoring, particularly for high-risk groups such as females and those receiving PD-1/L1 inhibitors. Supplementary material 10.1136/lupus-2025-001653 online supplemental file 1 Acknowledgements We sincerely thank the information engineer of Qichun Ye for his help in providing technical support for the data preprocessing. Funding: Provenance and peer review: Patient consent for publication: Ethics approval: Data availability free text: Patient and public involvement: References 1 Carlino MS Larkin J Long GV Immune checkpoint inhibitors in melanoma The Lancet 2021 398 1002 14 10.1016/S0140-6736(21)01206-X 34509219 2 Tang S Qin C Hu H et al Immune Checkpoint Inhibitors in Non-Small Cell Lung Cancer: Progress, Challenges, and Prospects Cells 2022 11 320 10.3390/cells11030320 35159131 PMC8834198 3 Wang SJ Dougan SK Dougan M Immune mechanisms of toxicity from checkpoint inhibitors Trends Cancer 2023 9 543 53 10.1016/j.trecan.2023.04.002 37117135 PMC10330206 4 Martins F Sofiya L Sykiotis GP et al Adverse effects of immune-checkpoint inhibitors: epidemiology, management and surveillance Nat Rev Clin Oncol 2019 16 563 80 10.1038/s41571-019-0218-0 31092901 5 Okiyama N Tanaka R Immune-related adverse events in various organs caused by immune checkpoint inhibitors Allergol Int 2022 71 169 78 10.1016/j.alit.2022.01.001 35101349 6 Thompson JA Schneider BJ Brahmer J et al NCCN Guidelines® Insights: Management of Immunotherapy-Related Toxicities, Version 2.2024 J Natl Compr Canc Netw 2024 22 582 92 10.6004/jnccn.2024.0057 39536465 7 Abdel-Wahab N Suarez-Almazor ME Rheumatic adverse events of immune checkpoint inhibitors in cancer immunotherapy Expert Rev Clin Immunol 2024 20 873 93 10.1080/1744666X.2024.2323966 38400840 PMC11449381 8 Vitzthum von Eckstaedt H Singh A Reid P et al Immune Checkpoint Inhibitors and Lupus Erythematosus Pharmaceuticals (Basel) 2024 17 252 10.3390/ph17020252 38399467 PMC10892070 9 Wang LL Patel G Chiesa-Fuxench ZC et al Timing of Onset of Adverse Cutaneous Reactions Associated With Programmed Cell Death Protein 1 Inhibitor Therapy JAMA Dermatol 2018 154 1057 61 10.1001/jamadermatol.2018.1912 30027278 PMC6143042 10 Fietz S Fröhlich A Mauch C et al Manifestation of subacute cutaneous lupus erythematosus during treatment with anti-PD-1 antibody cemiplimab - a case report Front Immunol 2023 14 1324231 10.3389/fimmu.2023.1324231 38143738 PMC10748382 11 Diago A Hueso L Ara-Martín M et al Subacute cutaneous lupus erythematosus induced by PD-1 Inhibitor therapy: two case reports and literature review Australas J Dermatol 2021 62 e347 9 10.1111/ajd.13538 33484581 12 Marano AL Clarke JM Morse MA et al Subacute cutaneous lupus erythematosus and dermatomyositis associated with anti-programmed cell death 1 therapy Br J Dermatol 2019 181 580 3 10.1111/bjd.17245 30244487 13 Mayer B Babál P Krivošíková L Pembrolizumab- induced subacute cutaneous lupus erythematosus in a patient with oropharyngeal squamous cell carcinoma: A case report and literature review Hum Vaccin Immunother 2025 21 2454073 10.1080/21645515.2025.2454073 39835881 14 Fadel F El Karoui K Knebelmann B Anti-CTLA4 antibody-induced lupus nephritis N Engl J Med 2009 361 211 2 10.1056/NEJMc0904283 19587352 15 Curran CS Gupta S Sanz I et al PD-1 immunobiology in systemic lupus erythematosus J Autoimmun 2019 97 1 9 10.1016/j.jaut.2018.10.025 30396745 PMC7449827 16 Nishimura H Nose M Hiai H et al Development of lupus-like autoimmune diseases by disruption of the PD-1 gene encoding an ITIM motif-carrying immunoreceptor Immunity 1999 11 141 51 10.1016/s1074-7613(00)80089-8 10485649 17 Király Z Szepesi Á Sebestyén A et al Immunohistochemical Study of the PD-1/PD-L1 Pathway in Cutaneous Lupus Erythematosus Pathol Oncol Res 2022 28 1610521 10.3389/pore.2022.1610521 35979531 PMC9377145 18 Godiyal Y Maheshwari D Taniguchi H et al Role of PD-1/PD-L1 signaling axis in oncogenesis and its targeting by bioactive natural compounds for cancer immunotherapy Mil Med Res 2024 11 82 10.1186/s40779-024-00586-9 39690423 PMC11654217 19 Dema B Charles N Autoantibodies in SLE: Specificities, Isotypes and Receptors Antibodies (Basel) 2016 5 2 10.3390/antib5010002 31557984 PMC6698872 20 Shen J Hu R Lin A et al Characterization of second primary malignancies post CAR T-cell therapy: real-world insights from the two global pharmacovigilance databases of FAERS and VigiBase EClinicalMedicine 2024 73 102684 10.1016/j.eclinm.2024.102684 39007060 PMC11245995 21 Zhou J Zheng Y Xu B et al Exploration of the potential association between GLP-1 receptor agonists and suicidal or self-injurious behaviors: a pharmacovigilance study based on the FDA Adverse Event Reporting System database BMC Med 2024 22 65 10.1186/s12916-024-03274-6 38355513 PMC10865629 22 Mikami T Liaw B Asada M et al Neuroimmunological adverse events associated with immune checkpoint inhibitor: a retrospective, pharmacovigilance study using FAERS database J Neurooncol 2021 152 135 44 10.1007/s11060-020-03687-2 33423151 23 Zhou C Peng S Lin A et al Psychiatric disorders associated with immune checkpoint inhibitors: a pharmacovigilance analysis of the FDA Adverse Event Reporting System (FAERS) database eClinicalMedicine 2023 59 101967 10.1016/j.eclinm.2023.101967 37131541 PMC10149185 24 Köylü B Esen BH Bektaş ŞN et al Pharmacovigilance analysis of immune checkpoint inhibitor-related reproductive adverse effects based on the FDA adverse event reporting system Sci Rep 2025 15 7770 10.1038/s41598-025-91476-0 40044844 PMC11883018 25 Tyagi S Kumar A Safety of immune checkpoint inhibitors: An updated comprehensive disproportionality analysis and meta-analysis Crit Rev Oncol Hematol 2024 200 104398 10.1016/j.critrevonc.2024.104398 38810844 26 Raschi E Antonazzo IC Poluzzi E et al Drug-induced systemic lupus erythematosus: should immune checkpoint inhibitors be added to the evolving list? Ann Rheum Dis 2021 80 e120 10.1136/annrheumdis-2019-215819 31189551 27 Arnaud L Mertz P Gavand P-E et al Drug-induced systemic lupus: revisiting the ever-changing spectrum of the disease using the WHO pharmacovigilance database Ann Rheum Dis 2019 78 504 8 10.1136/annrheumdis-2018-214598 30793701 28 Fusaroli M Salvo F Begaud B et al The Reporting of a Disproportionality Analysis for Drug Safety Signal Detection Using Individual Case Safety Reports in PharmacoVigilance (READUS-PV): Development and Statement Drug Saf 2024 47 575 84 10.1007/s40264-024-01421-9 38713346 PMC11116242 29 Fusaroli M Salvo F Begaud B et al The REporting of A Disproportionality Analysis for DrUg Safety Signal Detection Using Individual Case Safety Reports in PharmacoVigilance (READUS-PV): Explanation and Elaboration Drug Saf 2024 47 585 99 10.1007/s40264-024-01423-7 38713347 PMC11116264 30 FDA FDA adverse event reporting system (FAERS) 2025 Available https://www.fda.gov/drugs/questions-and-answers-fdas-adverse-event-reporting-system-faers/fda-adverse-event-reporting-system-faers-latest-quarterly-data-files Accessed 30-Jan-2025 31 ICH Organization MedDRA hierarchy Available https://www.meddra.org/how-to-use/tools/smqs Accessed 20-Feb-2025 32 Xia S Gong H Zhao Y et al Tumor Lysis Syndrome Associated with Monoclonal Antibodies in Patients with Multiple Myeloma: A Pharmacovigilance Study Based on the FAERS Database Clin Pharmacol Ther 2023 114 211 9 10.1002/cpt.2920 37086211 33 Noguchi Y Tachi T Teramachi H Detection algorithms and attentive points of safety signal using spontaneous reporting systems as a clinical data source Brief Bioinformatics 2021 22 10.1093/bib/bbab347 34453158 34 Schoretsanitis G Weiler S Barbui C et al Disproportionality Analysis From World Health Organization Data on Semaglutide, Liraglutide, and Suicidality JAMA Netw Open 2024 7 e2423385 10.1001/jamanetworkopen.2024.23385 39163046 PMC11337067 35 Dijkstra L Garling M Foraita R et al Adverse drug reaction or innocent bystander? A systematic comparison of statistical discovery methods for spontaneous reporting systems Pharmacoepidemiol Drug Saf 2020 29 396 403 10.1002/pds.4970 32092786 36 Wu Z Huang R Sun W et al Clinical characteristics, treatment and outcome of subacute cutaneous lupus erythematosus induced by PD-1/PD-L1 inhibitors Arch Dermatol Res 2024 316 722 10.1007/s00403-024-03484-1 39460790 37 Poh YJ Alrashid A Sangle SR et al Proton pump inhibitor induced subacute cutaneous lupus erythematosus: Clinical characteristics and outcomes Lupus (Los Angel) 2022 31 1078 83 10.1177/09612033221104237 35635045 38 Guhl G Diaz-Ley B García-García C et al Chemotherapy-induced subacute lupus erythematosus Lupus (Los Angel) 2009 18 859 60 10.1177/0961203309103050 19578115 39 He Y Sawalha AH Drug-induced lupus erythematosus: an update on drugs and mechanisms Curr Opin Rheumatol 2018 30 490 7 10.1097/BOR.0000000000000522 29870500 PMC7299070 40 Quach HT Dewan AK Davis EJ et al Association of Anti-Programmed Cell Death 1 Cutaneous Toxic Effects With Outcomes in Patients With Advanced Melanoma JAMA Oncol 2019 5 906 8 10.1001/jamaoncol.2019.0046 30998826 PMC6567826 41 Quach HT Johnson DB LeBoeuf NR et al Cutaneous adverse events caused by immune checkpoint inhibitors J Am Acad Dermatol 2021 85 956 66 10.1016/j.jaad.2020.09.054 34332798 42 Fairweather D Beetler DJ McCabe EJ et al Mechanisms underlying sex differences in autoimmunity J Clin Invest 2024 134 10.1172/JCI180076 PMC11405048 39286970 43 Rees F Doherty M Grainge MJ et al The worldwide incidence and prevalence of systemic lupus erythematosus: a systematic review of epidemiological studies Rheumatology (Sunnyvale) 2017 56 1945 61 10.1093/rheumatology/kex260 28968809 44 Yan Y-D Zhao Y Zhang C et al Toxicity spectrum of immunotherapy in advanced lung cancer: A safety analysis from clinical trials and a pharmacovigilance system EClinicalMedicine 2022 50 101535 10.1016/j.eclinm.2022.101535 35812997 PMC9256649 45 Yan Y-D Cui J-J Fu J et al A Network Comparison on Safety Profiling of Immune Checkpoint Inhibitors in Advanced Lung Cancer Front Immunol 2021 12 760737 10.3389/fimmu.2021.760737 34925331 PMC8677695 46 Hadfield MJ Mistry H Pelcovits A et al Risk Factors for Immunotherapy-related Adverse Events (IrAE) in Patients Treated With Immune Checkpoint Inhibitors Am J Clin Oncol 2023 46 183 4 10.1097/COC.0000000000000984 36959209 47 Borchers AT Keen CL Gershwin ME Drug-induced lupus Ann N Y Acad Sci 2007 1108 166 82 10.1196/annals.1422.019 17893983 48 Chen H Yang G Ma J Ocular toxicity associated with anti-HER2 agents in breast cancer: A pharmacovigilance analysis using the FAERS database Int J Cancer 2024 154 1616 25 10.1002/ijc.34848 38216995 Data availability statement Data are available in a public, open access repository. ",
  "metadata": {
    "Title of this paper": "Ocular toxicity associated with anti-HER2 agents in breast cancer: A pharmacovigilance analysis using the FAERS database",
    "Journal it was published in:": "Lupus Science & Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481352/"
  }
}