{
  "title": "Paper_1059",
  "abstract": "pmc Med Sci (Basel) Med Sci (Basel) 3304 medsci medsci Medical Sciences 2076-3271 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471425 PMC12471425.1 12471425 12471425 41003151 10.3390/medsci13030202 medsci-13-00202 1 Article Immunohistochemistry-Based Molecular Profiling of Muscle-Invasive Bladder Cancer: Analysis of 100 Consecutive Cases with Morphological Correlation https://orcid.org/0009-0000-0154-7575 Kraevska Elitsa * Popovska Savelina Duan Wei Academic Editor Department of Pathoanatomy, Faculty of Medicine, Medical University-Pleven, 5800 Pleven, Bulgaria * patologia@mu-pleven.bg 22 9 2025 9 2025 13 3 493652 202 19 8 2025 10 9 2025 16 9 2025 22 09 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives Methods Results 2 p Conclusions muscle-invasive bladder carcinoma molecular variants immunohistochemistry histological subtypes Medical University—Pleven, Bulgaria D7/2024 European Union—NextGenerationEU BG-RRP-2.004-0003 This research was funded by the Medical University—Pleven, Bulgaria, within Project No D7/2024 and by the European Union—NextGenerationEU, through the National Recovery and Resilience Plan of the Republic of Bulgaria Project No BG-RRP-2.004-0003. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Bladder cancer is the 10th most common malignancy worldwide, accounting for about 3% of all newly diagnosed cancer cases [ 1 1 2 2 2 Histologically, over 90% of bladder tumors are urothelial carcinomas arising from the urothelial lining [ 1 1 1 3 1 Over the past decade, intensive molecular-genetic studies have led to the development of a molecular classification of MIBC. Global transcriptomic profiles reveal two major molecular phenotypes—luminal and basal, analogous to those in breast carcinoma [ 3 3 4 3 5 The molecular variants differ in their biology and clinical behavior. Knowledge of the frequency and characteristics of each variant is important, as some have distinct prognoses and therapy sensitivities. For example, basal and stroma-rich cancers typically show a better response to platinum-based chemotherapy, whereas luminal papillary cancers are associated with a more favorable prognosis but poor response to systemic chemotherapy (in such cases, radical surgery and/or targeted therapy—e.g., FGFR inhibitors if FGFR3 mutations are present—are more appropriate) [ 6 4 7 2. Materials and Methods 2.1. Clinical Cohort and Study Design A retrospective single-center study was carried out on patients with MIBC treated at the Urology Clinic of University Hospital “St. Marina”—Pleven, Bulgaria over a 4-year period (January 2021–December 2024). The study series includes 100 consecutive patient cases with histologically confirmed muscle-invasive urothelial carcinoma of the bladder who underwent either radical cystectomy (RC) or transurethral resection (TURB) of the tumor. The ratio of surgical intervention types is 34% RC to 66% TURB. Tumors were staged and graded according to the fifth edition of the World Healt Organization (WHO) classification of urogenital tumours published in 2022 [ 8 Inclusion criteria: primary muscle-invasive urothelial carcinoma of the bladder (≥pT2 at diagnosis). Exclusion criteria: non-muscle-invasive tumors (pTa, pT1), recurrence in the same patient, and insufficient tumor material (exhausted biopsies). For all included cases, data were collected from hospital records: age, sex, stage, and histological subtype of the carcinoma. The key demographic indicators of the patients are as follows: mean age 69.5 years (standard deviation 8.7; median 70; range 47–87 years) and male sex in 86% of cases ( Figure 1 2.2. Immunohistochemical Analysis and Molecular Subtyping All cases were evaluated independently by two pathologists (one professor (SLP) and one uropathologist (EPK)), and paraffin blocks with invasive tumor involving the muscularis propria were selected for immunohistochemical analysis. Four-micron sections were cut onto adhesive slides and processed by a standard protocol for IHC technique on an automated platform (Dako/Agilent). A panel of antibodies was used, selected as a surrogate marker panel to distinguish the major molecular variants. The following primary antibodies were included: CK5/6 (mouse, monoclonal, clone D5/16 B4, ready to use, Dako/Agilent, targeting cytokeratins 5 and 6), CK20 (mouse, monoclonal, clone Ks20.8, ready to use, Dako/Agilent targeting 20 kDa cytokeratin), and p16 (mouse, monoclonal, clone JC2, ready to use, Diagnostic BioSystems, California, U.S. targeting the tumor suppressor protein). Antigen retrieval was performed by heat-induced epitope retrieval (HIER)—optimally in an alkaline buffer (e.g., Tris-EDTA, pH 9) for ~20 min at ~95 °C. Primary antibody incubation was 20–30 min at room temperature, followed by visualization with a two-step polymer HRP/DAB system (EnVision) to develop the signal. Appropriate positive controls were used for each marker: normal prostatic glands for CK5/6 (strong positive staining in basal cells), appendix for CK20 (diffuse cytoplasmic staining of the surface epithelium and moderate in crypts), and high-risk HPV-associated squamous cell carcinoma of the uterine cervix for p16 (diffuse strong nuclear and cytoplasmic expression). The IHC staining is evaluated semi-quantitatively by the pathologists. Although the H-score method (combining percentage and intensity of staining) is widely used, its application is challenging in cases of heterogeneous expression. In the present study, we adopted a simpler positivity criterion—the presence of specific tumor staining in over 10% of the tumor cells. For each tumor, CK5/6 and CK20 are assessed by intensity (strong, moderate, weak) and percentage of positive cells (in 10% increments). CK5/6 is used as a surrogate marker for a basal molecular phenotype and CK20 as a marker for a luminal phenotype. A tumor is considered CK5/6-positive (hence “basal”) if there is strong or moderate cytoplasmic staining in ≥10% of the cells (staining of a basal membrane-like pattern is interpreted as a negative result ( Figure 2 For further differentiation of the luminal tumors, we performed p16 immunostaining. We took into account literature data suggesting that normal urothelium often does not express or only weakly expresses p16, whereas overexpression of p16 in tumors may indicate genomic instability. In our study, we interpret p16 as positive if there is intense or moderate nuclear staining in ≥50% of tumor cells or so-called “block” positivity (staining of ≥50% of both the nucleus and cytoplasm in tumor cells), and weak or absent nuclear staining (regardless of cytoplasmic staining) is considered a negative result. Based on the combination of marker expression, each tumor is classified into a corresponding molecular variant as follows: Basal variant: CK5/6 (+ve) and CK20 (−ve). Luminal variant: CK20 (+ve) and CK5/6 (−ve). The luminal tumors are further subdivided: luminal papillary if p16 is negative, and luminal unstable if p16 is positive. Luminal non-specified variant: preserved urothelial morphology, expression of either marker (CK5/6 (−ve), CK20 variable (−ve or <10%)). These cases phenotypically fall into the luminal spectrum but do not classify as luminal papillary or luminal unstable. Double-negative variants: CK5/6 (−ve) and CK20 (−ve). These tumors are split into two subgroups according to morphology: cases with neuroendocrine morphological characteristics are classified as neuroendocrine-like variant and cases with abundant stroma and/or sarcomatoid areas as stroma-rich variant. Basoluminal variant: tumors co-expressing both CK5/6 and CK20 (co-expression). In our series, such cases had mixed morphology, with different parts of the tumor showing zonal expression of different markers (e.g., one tumor component basal, another luminal). 2.3. Statistical Analysis Data processing was performed using SPSS v.25 software (Statistical Package for the Social Sciences v.25 (SPSS Inc., Chicago, IL, USA)). Descriptive statistics (mean values, proportions) were used to characterize subtype distribution. The relationship between categorical variables (e.g., histological subtype and molecular variant) was examined with a chi-square test for independence. A significance level of p 2.4. Ethical Aspects This study was conducted following the national and international requirements for clinical studies, including the preservation of the anonymity of the participants and the non-disclosure of their personal information. Each participant signed an informed consent form. This study was conducted in accordance with the requirements of the Ethics Committee of the Medical University of Pleven, Bulgaria, approval number No 781/14.06.2024. 3. Results 3.1. Pathological Characteristics of the Patients The most common subtypes are urothelial papillary carcinoma (27 cases, 27%) and urothelial carcinoma with squamous differentiation (present as a component in 17 tumors, 17%), followed by less common subtypes such as sarcomatoid urothelial carcinoma (5 cases, 5%), small-cell carcinoma (5 cases, 5%), micropapillary urothelial carcinoma (4 cases, 4%), urothelial carcinoma with glandular differentiation (3 cases, 3%), plasmacytoid urothelial carcinoma (3 cases, 3%), poorly differentiated urothelial carcinoma (3 cases, 3%), and nested urothelial carcinoma (2 cases, 2%) ( Table 1 We found that 66% (including mixed tumors) of MIBC cases have at least one divergent histological component. This is higher than the classically cited 20–30% incidence of variant differentiation in bladder cancer [ 6 The specific frequencies of variants in our study largely fall within known ranges. Squamous differentiation (17% of cases) is in line with expectations—it is the most common divergent form in urothelial carcinoma, with a reported incidence up to 40% [ 9 10 9 9 10 9 9 10 In conclusion, regarding the morphological findings, our series supports the notion that tumors with variant histology are not an exception but rather the rule in muscle-invasive bladder cancer—over two-thirds of cases in our study had some divergent feature (squamous, glandular, sarcomatoid, etc.). This has direct clinical implications: it is advisable for pathologists to actively search for such variant features because identifying them can alter the tumor’s stage (for example, the presence of a sarcomatoid component automatically designates the tumor as high-grade/grade 3 and is often associated with more aggressive behavior) and inform therapeutic planning (for example, micropapillary tumors, even with limited invasion, often warrant early cystectomy due to their tendency for dissemination). 3.2. Molecular Classification of the Tumors The high cost and limited accessibility of technologies for comprehensive molecular characterization restrict their use in routine clinical practice. Therefore, immunohistochemistry is employed as a more feasible surrogate to define the main molecular subtypes—luminal and basal—similar to the classification used in breast cancer. Choi et al. demonstrated that only two markers are sufficient to distinguish luminal (CK20+, CK5/6–) from basal (CK5/6+, CK20–) variants in bladder cancer [ 6 6 6 6 Through IHC profiling, each tumor is classified into a particular surrogate molecular variant. In our series of 100 MIBCs, a total of 7 molecular variants are identified: basal—33% of cases; luminal papillary—24%; luminal unstable—16%; luminal non-specified—10%; basoluminal—9%; neuroendocrine-like—6%; stroma-rich—2%. The distribution of variants is summarized in Table 2 In summary, the distribution of molecular variants in our series is similar to that reported in the major studies on molecular classifications of MIBC [ 4 7 p 4. Discussion 4.1. Comparison with Published Data on Molecular Variant The obtained results from the IHC-based molecular classification confirm the main trends reported in the literature for MIBC. In our study, basal tumors constituted ~33%, which is almost identical to the ~35% relative share in the international consensus and in TCGA ( Table 2 6 The luminal papillary variant represented 24% of our cohort, aligning exactly with the 24% in the consensus. TCGA reported a higher percentage (~35%) of luminal papillary tumors, which is likely due to methodological differences—in the consensus classification, some cases that TCGA classified as luminal are reallocated into separate groups (e.g., “luminal unstable” and “luminal non-specified”). The luminal unstable (Luminal Unstable, LumU) variant in our study is 16%, virtually identical to the published ~15%. This variant corresponds to tumors with high mutational burden and an aggressive genomic profile—equivalent to the so-called “Genomically Unstable” class in some older classifications (Lund). TCGA did not define LumU as a separate category, but a subset of their luminal tumors with an infiltrated phenotype falls into this category. The luminal non-specified variant (Luminal Non-specified, LumNS) is represented in 10% of our cases, which is slightly above the ~6–8% reported in the large series. These are luminal tumors that do not fit into the papillary or unstable subtypes. TCGA identified a similar small group (~6%) of “pure luminal” tumors with a differentiated phenotype. In both our study and the large studies, this LumNS variant is the smallest luminal category. More notable differences are observed for the stroma-rich (infiltrated) variant. Our share is only 2%, versus ~15–20% in the consensus classification and TCGA ( Table 2 Overall, our results affirm the primary trends in variant distribution established by other authors. This demonstrates the feasibility of reliably subtyping MIBC by immunohistochemical means, since the obtained IHC profiles largely recapitulate the transcriptomic classes. Some deviations could warrant further study—for example, the significantly lower share of stroma-rich tumors in our series, as well as the slightly higher percentages of neuroendocrine-like cases. These differences merit attention but do not alter the overall picture of concordance. 4.2. Correlation Between Histological Subtypes and Molecular Variants Along with variant frequencies, the interrelationship between the morphological (histological) appearance of the tumor and its molecular profile is of particular interest. Increasing evidence shows that the different histological subtypes of urothelial carcinoma are not evenly distributed among molecular variants but rather exhibit preferences for certain profiles. In other words, morphologically distinct “divergent differentiations” (e.g., squamous, glandular) largely correlate with the variant determined by gene expression. Our observations confirm these patterns of association ( Table 3 Papillary tumors—luminal variant. Urothelial carcinomas with papillary architecture ( Figure 2 6 Table 3 6 9 Table 3 Micropapillary subtype—luminal unstable variant. Micropapillary urothelial carcinoma is an aggressive histological subtype, but it too usually falls into the luminal spectrum of the molecular classification [ 4 5 7 9 4 5 7 9 Squamous differentiation—basal variant. There is an exceptionally strong correlation between the presence of a squamous component in a tumor and the basal molecular phenotype ( Figure 3 5 5 Table 3 Glandular differentiation—luminal variant. Urothelial carcinoma with glandular differentiation is relatively uncommon. Due to the limited number of cases, the literature does not provide a definitive classification for this variant [ 5 4 5 7 9 Sarcomatoid subtype—basal or stroma-rich variant. Sarcomatoid urothelial carcinoma is an extreme manifestation of tumor dedifferentiation, in which the epithelial tumor acquires a sarcomatous appearance. Molecularly, data indicate heterogeneity: a portion of sarcomatoid tumors represent an extreme manifestation of the basal variant ( Figure 4 5 5 Table 2 Plasmacytoid subtype—luminal variant (with heterogeneity). The plasmacytoid urothelial carcinoma (also known as the diffuse subtype) is rare, composed of discohesive tumor cells resembling plasma cells. Molecularly, the majority of studies position it in the luminal spectrum. For example, Eckstein et al. found in plasmacytoid tumors an immunophenotype of CK20+/CK5/6– and GATA3+, which is characteristic of the luminal variant [ 5 5 5 5 7 9 Table 3 5 Small-cell carcinoma—neuroendocrine-like variant. Small-cell carcinoma of the bladder is a distinct, rare histological subtype with neuroendocrine morphology. Molecularly, it corresponds to the aforementioned “neuronal” (neuroendocrine) variant, identified by TCGA as the smallest group [ 11 Figure 5 Rare variants. Some rarer histological variants of urothelial carcinoma are encountered too sporadically to make a compelling correlation, but available evidence also suggests preferred profiles. For example, the lymphoepithelioma-like subtype (urothelial carcinoma resembling lymphoepithelioma in the nasopharynx) is more associated with a basal/immune-infiltrated phenotype [ 5 Figure 6 11 Mixed subtypes (with basoluminal profile). A significant proportion of cases—27%—have a heterogeneous morphology containing more than one of the above-mentioned histological components. In these cases, a mixed immunophenotype with co-expression of basal and luminal markers is often observed. In fact, our defined basoluminal category (9% of all tumors) reflects exactly such cases with a “double positive” profile. Similar mixed expression profiles have been described in the literature—e.g., the Lund UroB variant, or other authors who note ~5–10% of tumors with a combination of basal and luminal characteristics. Our data (9%) are in line with these observations. Mixed basoluminal tumors often correspond morphologically to mixed histological subtypes. Such tumors underscore the internal heterogeneity of some MIBCs and demonstrate that molecular variants are not always strictly demarcated—overlap within the same tumor is possible. From a practical standpoint, in these cases, the morphological and IHC assessment should account for all components in order to characterize the complete profile of the neoplasm. 5. Conclusions The correlations outlined above indicate that the morphological subtypes of urothelial carcinoma largely predetermine the molecular variant. The overall picture demonstrates more concordance than discordance: papillary tumors correspond to the luminal axis and tumors with squamous differentiation to the basal axis of the molecular classification. Deviations from these main “axes”—such as mesenchymal (stroma-rich, sarcomatoid) or neuroendocrine morphology—represent separate variants that can also be recognized and predicted by an experienced pathologist. This knowledge has practical significance. For example, the presence of a squamous-differentiated tumor suggests a basal type, for which we would consider more aggressive systemic therapy, whereas a purely papillary tumor is most likely luminal and is characterized by a better prognosis but also a weaker response to chemotherapy. Thus, the combination of classic histopathology with molecular (IHC) profiling provides the most complete characterization of the tumor and may help achieve a more precise prognosis and personalized treatment for patients with muscle-invasive bladder cancer. Acknowledgments This study was conducted with financial support from the Medical University—Pleven, Bulgaria within Project No D7/2024, and by the European Union—NextGenerationEU, through the National Recovery and Resilience Plan of the Republic of Bulgaria Project No BG-RRP-2.004-0003. The Dako autostainer with PT Link was provided by the Medical University—Pleven, “Center of competence for personalized medicine, 3D and telemedicine, robotized and minimally invasive surgery”. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, S.P. and E.K.; methodology, E.K.; validation, S.P.,; formal analysis, E.K.; investigation, E.K.; resources, E.K. and S.P.; data curation, E.K.; writing—original draft preparation, E.K.; writing—review and editing, S.P.; visualization, E.K.; supervision, S.P.; project administration, E.K.; funding acquisition, S.P. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement This study was conducted in accordance with the requirements of the Ethics Committee of the Medical University of Pleven, Bulgaria: approval number No 781/14.06.2024, approval date: 14 June 2024. Informed Consent Statement This study was conducted following the national and international requirements for clinical studies, including the preservation of the anonymity of the participants and the non-disclosure of their personal information. Each participant signed an informed consent form during their hospital stay. Data Availability Statement The original contributions presented in this study are included in the article. Further inquiries can be directed to the corresponding author. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: BC Bladder carcinoma MIBC Muscle-invasive bladder carcinoma TCGA The Cancer Genome Atlas IHC Immunohistochemistry TURB Transurethral resection RC Radical cystestomy FGFR Fibroblast Growth Factor Receptor 3 References 1. Saginala K. Barsouk A. Aluru J.S. Rawla P. Padala S.A. Barsouk A. Epidemiology of Bladder Cancer Med. Sci. 2020 8 15 10.3390/medsci8010015 32183076 PMC7151633 2. Doshi B. Athans S.R. Woloszynska A. Biological differences underlying sex and gender disparities in bladder cancer: Current synopsis and future directions Oncogenesis 2023 12 44 10.1038/s41389-023-00489-9 37666817 PMC10477245 3. Sanguedolce F. Zanelli M. Palicelli A. Ascani S. Zizzo M. Cocco G. Björnebo L. Lantz A. Falagario U.G. Cormio L. Are We Ready to Implement Molecular Subtyping of Bladder Cancer in Clinical Practice? Part 1: General Issues and Marker Expression Int. J. Mol. Sci. 2022 23 7819 10.3390/ijms23147819 35887164 PMC9319819 4. Kamoun A. De Reyniès A. Allory Y. Sjödahl G. Robertson A.G. Seiler R. Hoadley K.A. Groeneveld C.S. Al-Ahmadie H. Choi W. A Consensus Molecular Classification of Muscle-invasive Bladder Cancer Eur. Urol. 2020 77 420 433 10.1016/j.eururo.2019.09.006 31563503 PMC7690647 5. Sanguedolce F. Zanelli M. Palicelli A. Ascani S. Zizzo M. Cocco G. Björnebo L. Lantz A. Landriscina M. Conteduca V. Are We Ready to Implement Molecular Subtyping of Bladder Cancer in Clinical Practice? Part 2: Subtypes and Divergent Differentiation Int. J. Mol. Sci. 2022 23 7844 10.3390/ijms23147844 35887192 PMC9317362 6. Lopez-Beltran A. Cimadamore A. Montironi R. Cheng L. Molecular pathology of urothelial carcinoma Hum. Pathol. 2021 113 67 83 10.1016/j.humpath.2021.04.001 33887300 7. Robertson A.G. Kim J. Al-Ahmadie H. Bellmunt J. Guo G. Cherniack A.D. Hinoue T. Laird P.W. Hoadley K.A. Akbani R. Comprehensive Molecular Characterization of Muscle-Invasive Bladder Cancer Cell 2017 171 540 556.e25 10.1016/j.cell.2017.09.007 28988769 PMC5687509 8. Netto G.J. Amin M.B. Berney D.M. Compérat E.M. Gill A.J. Hartmann A. Menon S. Raspollini M.R. Rubin M.A. Srigley J.R. The 2022 World Health Organization Classification of Tumors of the Urinary System and Male Genital Organs-Part B: Prostate and Urinary Tract Tumors Eur. Urol. 2022 82 469 482 10.1016/j.eururo.2022.07.002 35965208 9. Takahara T. Murase Y. Tsuzuki T. Urothelial carcinoma: Variant histology, molecular subtyping, and immunophenotyping significant for treatment outcomes Pathology 2021 53 56 66 10.1016/j.pathol.2020.09.004 33070956 10. Moschini M. D’Andrea D. Korn S. Irmak Y. Soria F. Compérat E. Shariat S.F. Characteristics and clinical significance of histological variants of bladder cancer Nat. Rev. Urol. 2017 14 651 668 10.1038/nrurol.2017.125 28895563 11. Processali T. Diminutto A. Cerruto M.A. Antonelli A. The impact of histological variants on bladder cancer outcomes AME Med. J. 2020 5 4 10.21037/amj.2020.02.02 Figure 1 Distribution of MIBC patients (n-100): ( a b Figure 2 UC with papillary architecture—LumP variant: ( a b c d Figure 3 UC with squamous differentiation—basal variant. ( a b c Figure 4 Sarcomatoid subtype—basal variant. ( a b c Figure 5 Small-cell carcinoma—neuroendocrine-like variant. ( a b c Figure 6 Lymphoepithelioma-like subtype—basal variant. ( a b c medsci-13-00202-t001_Table 1 Table 1 Frequency of the main histological subtypes in the studied cohort ( n Subtype (WHO 2022) Number of Cases ( n Percentage (%) UC (NOS) 4 4.0% Papillary UC 27 27.0% UC with squamous diff. 17 17.0% UC with glandular diff. 3 3.0% Sarcomatoid 5 5.0% Plasmacytoid 3 3.0% Nested 2 2.0% Micropapillary 4 4.0% Small-cell carcinoma 5 5.0% Poorly differentiated UC 3 3.0% Mixed tumor (≥2 subtype) 27 27.0% Total 100 100% medsci-13-00202-t002_Table 2 Table 2 Comparison of the frequency of MIBC molecular variants between the present study (N = 100) and published data (consensus classification 2020 and The Cancer Genome Atlas, TCGA 2017). Molecular Variant Our Study (N = 100) Number of Cases ( n Consensus 2020 (N ≈ 1750) TCGA 2017 (N = 408) Ba/Sq 33% 33 35% 35% (Ba/Sq) LumPap 24% 24 24% 35% (LumPap) LumU 16% 16 15% Inc. in Lum-infiltrated LumNS 10% 10 8% 6% (Luminal) Stroma-rich 2% 2 15% 19% (Lum-infiltrated) NE-like 6% 6 3% 5% (Neuronal) BasoLum 9% 9 No separate class No separate class medsci-13-00202-t003_Table 3 Table 3 Comparison of the predominant molecular variants in various histological subtypes of urothelial carcinoma (literature data) and their distribution in our study (N = 100). Notes: Histological Subtype Dominant Molecular Variant Literature [ 4 7 9 Most Common Variant (Our Data) Papillary urothelial carcinoma Luminal (especially LumP) LumP 63% of cases (17 cases from 27) Micropapillary Luminal (e.g., LumNS or LumU) LumU 75% of cases (3 cases from 4) Nested subtype Luminal or Basal LumP 100% of cases (2 cases from 2) UC with squamous diff. Basal (Ba/Sq) Basal 100% of cases UC with glandular diff. Luminal (limited data; likely lumU) LumU 67% of cases (2 cases from 3) Sarcomatoid Basal Basal (60%; 3 cases)), Stroma-rich (40%; 2 cases) total 5 cases Plasmacytoid Luminal (predominantly lumNS) Stroma rich No dominant; ~evenly distributed among 1 LumP, 1 basolum., and 1 lumNS (~33% each/total 3 cases) Small-cell carcinoma NE-like (“neuronal”) NE-like (100%; 5 cases from 5) ",
  "metadata": {
    "Title of this paper": "The impact of histological variants on bladder cancer outcomes",
    "Journal it was published in:": "Medical Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471425/"
  }
}