{
  "title": "Paper_1013",
  "abstract": "pmc Nurs Rep Nurs Rep 4127 nursrep nursrep Nursing Reports 2039-439X 2039-4403 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472408 PMC12472408.1 12472408 12472408 41003270 10.3390/nursrep15090315 nursrep-15-00315 1 Article Social Frailty and Social Isolation in Chinese Community-Dwelling Older Adults: A Network Analysis He Hai-Yan 1 Duan Di-Fei 2 Yan Lin-Jia 3 Lin Lin Conceptualization Investigation Data curation Writing – review & editing Supervision Project administration 1 * Gray Richard Academic Editor 1 hehaiyan@scctcm.edu.cn 2 duandifei89@wchscu.cn 3 1155185244@link.cuhk.edu.hk * linlin@scctcm.edu.cn 27 8 2025 9 2025 15 9 497661 315 03 6 2025 17 8 2025 25 8 2025 27 08 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background: Method: Result: Conclusions: social frailty social isolation older adults network analysis nursing This research received no funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Global population ageing is accelerating: by 2050, the number of people aged 60 years and older is projected to reach ≈ 2.1 billion worldwide [ 1 2 3 4 5 Within this context, social frailty—a multidimensional construct encompassing reduced social participation, weakened support networks, and diminished community engagement—has emerged as a critical determinant of adverse health outcomes among older adults [ 6 7 8 9 10 Social isolation, defined as an objective lack of social connections or interactions, has been recognized as a pervasive issue among older adults [ 11 12 13 11 14 15 16 17 These challenges are particularly acute in community settings, where older adults often experience fragmented access to resources and limited opportunities for social engagement [ 18 19 20 21 22 23 24 25 26 27 28 Despite the increasing recognition of social frailty and isolation among older adults, no study has systematically examined the structural relationships between these two factors in Chinese older adults using network analysis. This gap hinders the development of culturally appropriate strategies to mitigate their combined impact. The present study aims to (1) construct a network model to visualize and quantify the interactions between the components of social frailty and social isolation and (2) identify central nodes and bridging pathways that exacerbate vulnerability. By integrating theoretical insights with practical applications, this research seeks to contribute to both the academic understanding and the formulation of effective strategies to address the dual challenges of social frailty and isolation in aging populations. 2. Materials and Methods We used the STROBE Checklist for a more rigorous study design and improved article quality. 2.1. Study Design and Participants This was a cross-sectional study that involved the recruitment of 451 older participants between September and December 2024 using a convenience sampling approach. Participants were recruited from two community settings in southwestern China—Chongqing (a centrally administered municipality with ~31.9 million permanent residents; urbanization 71.67%; ~387 persons/km 2 2 29 30 31 The inclusion criteria required participants to be aged 60 or older, without severe impairments in hearing, speech, or cognition that would hinder communication, who voluntarily consented to participate. We defined ‘older adults’ as age ≥60 years, consistent with the People’s Republic of China’s legal definition of the elderly and international usage by the United Nations/World Health Organization [ 1 32 8 33 Supplementary Figure S1 2.2. Sample Size Calculations We determined our sample size a priori using two complementary approaches and adopted the larger estimate. First, for estimating the prevalence of social frailty, we applied a precision-based calculation (PASS 15.0, Proportion module), specifying p 8 34 35 34 2.3. Measurements 2.3.1. Demographic Data and Covariates The first section of the questionnaire gathers demographic data, including age, gender, marital status, economic status, employment status, educational level, and the presence of chronic diseases, etc. 2.3.2. The HALFT Scale The scale is made up of one letter from each of the words: Help, Activities, Loneliness, Financial, and Talk. It is a straightforward self-report tool designed to assess social frailty, consisting of 5 items with scores ranging from 0 to 5. A score of 0 indicates no social frailty, scores between 1–2 suggest early-stage social frailty, and scores of 3 or higher indicate social frailty. This scale is commonly used among older adults living in the community, with a Cronbach’s α coefficient of 0.602 [ 36 36 2.3.3. The Social Isolation Scale (SIS) for Older Adults The SIS for Older Adults, developed by Dr. Nicholson and colleagues in 2019, assesses social isolation in older adults over the past month from both objective and subjective perspectives [ 37 38 2.3.4. Statistical Analysis SPSS 26.0 software was used to calculate the means, standard deviations, and Cronbach’s α coefficients for social frailty and social isolation. R 4.1.1 software was used for network model construction. Network model construction: Because social frailty and social isolation are multidimensional and interdependent, we applied psychometric network analysis to estimate conditional item–item associations without assuming a single latent construct, to identify central and bridging nodes as potential intervention targets, and to evaluate the accuracy and stability of the network structure using nonparametric bootstrapping [ 39 34 40 41 41 We used the R package bootnet to test the significance of edge weight differences between node pairs and evaluate their accuracy. Bootstrapping (1000 samples, α = 0.05) was applied to test the differences, and the 95% confidence interval was estimated to assess accuracy. A narrow confidence interval indicates high accuracy, as per Epskamp et al. [ 34 3. Results 3.1. The Characteristics of Participants This study included 451 community-dwelling older adults, with a median age of 71 years (IQR: 66–80). The sample was nearly balanced by gender, with 49.9% male. Education levels varied: 37% had ≤6 years of formal education, 50.3% had 6–12 years, and 12.7% had >12 years. Most participants were married (73.3%) (see Table 1 3.2. Social Frailty Severity and Social Isolation Score of Participants There were 164 participants without social frailty, accounting for 36.4% of the sample. A total of 184 participants (40.8%) were classified in the pre-frail stage of social frailty, while 103 participants (22.8%) were identified as frail. The median score for social isolation was 13 (IQR: 9–16). The boxplot for both variables is shown in Figure 1 3.3. The Network Structure of Social Frailty and Social Isolation in Chinese Older Adults The network analysis identified key relationships between social frailty (SF) and social isolation (SI). Most of the cross-community edges were positive. The edges with the highest edge weights were SF1 “Inability to help others”—SI1 “See face-to-face at least once a month” (edge weight = 1.85), SF2 “Limited social participation”—SI3 “Feel close on a personal level” (edge weight = 0.78), and SF3 “Loneliness”—SI2 “Communicate on a personal level” (edge weight = 0.68). It is worth mentioning that there were 2 negative cross-community edges: SF1 “Inability to help others”—SI2 “Communicate on a personal level” (edge weight = −0.23) and SF2 “Limited social participation”—SI3 “Feel close on a personal level” (edge weight = −0.23). Supplementary Table S1 Supplementary Materials Figure 2 As depicted in Supplementary Figure S2 Supplementary Materials Supplementary Figure S3 Supplementary Materials 4. Discussion This study represents the first application of network analysis to investigate the intricate relationship between social frailty and social isolation among community-dwelling older adults in China. Our findings demonstrated that SF and SI were not only prevalent but also interconnected in the Chinese context, reflecting the unique demographic and cultural challenges facing this population. In our study, the median score for SI was 13 (IQR: 9–16), indicating a moderate level of social isolation across the sample. For social frailty (SF), 40.8% were pre-frail and 22.8% frail, pointing to a considerable social vulnerability burden. These SF figures align with prior estimates of 20–22% SF prevalence in Chinese older adults [ 7 12 42 43 42 44 45 10 16 46 47 48 49 In addition, the network analysis provides a novel perspective on the interplay between SF and SI, suggesting that they are not merely co-occurring phenomena but are interlinked in a complex relationship. The network analysis revealed complex interactions between SF and SI components. Supplementary Table S1 6 11 50 51 The network analysis also identified SI2 (“Personal communication”), SI4 (“Lack of belonging”), and SF5 (“Lack of someone to talk to”) as central nodes within the interconnected system of social isolation and social frailty among community-dwelling older adults. These findings highlight the critical role of relational disconnection and perceived social marginalization in shaping psychosocial vulnerability in aging populations [ 52 53 54 55 56 57 58 Despite the valuable insights gained from this study, several limitations must be acknowledged. The cross-sectional design precludes the establishment of causal relationships between social frailty and social isolation. The convenience sampling methodology might have introduced sampling bias, potentially limiting the generalizability of the findings to other settings. The study’s focus solely on the perspectives of older adults might limit a comprehensive understanding of the complex dynamics of social health; including the views of family members, healthcare providers, and other relevant stakeholders would significantly enrich future research. Our study defined older adults as ≥60 years, but the lack of age-stratified analyses (e.g., 60–64 vs. ≥65) may limit comparability with studies using a 65-year cut-off; future work should refine SI and SF analyses across age segments to address this gap. Implications for Clinical Nursing Practice The findings of this study carry important implications for community and primary care nursing practice. Integrating dual screening for social frailty and social isolation into comprehensive geriatric assessments is warranted, as both conditions were highly prevalent and interrelated in our sample, underscoring the need for early detection [ 59 60 61 62 63 64 5. Conclusions This study highlights the intertwined nature of social frailty and isolation among Chinese older adults, identifying communication and perceived isolation as critical intervention targets. Culturally adapted community programs addressing reciprocal support and subjective loneliness could mitigate adverse health outcomes, offering a roadmap for policymakers and healthcare providers to enhance aging-in-place initiatives. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/nursrep15090315/s1 Author Contributions Conceptualization, L.L. and H.-Y.H.; data curation, L.L. and H.-Y.H.; formal analysis, H.-Y.H. and D.-F.D.; investigation, L.L. and H.-Y.H.; methodology, D.-F.D. and L.-J.Y.; project administration, L.L. and H.-Y.H.; supervision, L.L. and H.-Y.H.; visualization, D.-F.D. and H.-Y.H.; writing—original draft, H.-Y.H.; writing—review and editing, L.L., H.-Y.H., D.-F.D. and L.-J.Y. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement All procedures involving human participants were conducted in accordance with institutional and national ethical standards, the 1964 Declaration of Helsinki and its amendments, or equivalent guidelines. This study was approved by the Biomedical Ethics Review Committee of West China Hospital, Sichuan University (Approval No. 2024(2475); approved on 20 January 2024). Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Written informed consent was obtained from the patient(s) to publish this paper. Data Availability Statement The datasets analyzed in this study are available from the corresponding author upon reasonable request. Public Involvement Statement No public involvement in any aspect of this research. Guidelines and Standards Statement This manuscript was drafted against the STROBE (Strengthening the Reporting of Observational Studies in Epidemiology) guidelines for cross-sectional observational research. The checklist was used to ensure comprehensive and transparent reporting. Use of Artificial Intelligence ChatGPT-o3 (OpenAI) was used only for language editing and grammar correction; no text was generated by AI. Conflicts of Interest The authors declare no conflicts of interest. References 1. Ageing and Health Available online: https://perma.cc/R793-24HJ (accessed on 17 August 2025) 2. Communiqué of the Seventh National Population Census Available online: https://perma.cc/5XHD-BNAU (accessed on 17 August 2025) 3. Section I: Demographic Indicators Available online: https://perma.cc/C6FW-QV8N (accessed on 17 August 2025) 4. Lv Y. Fan L. Zhou J. Ding E. Shen J. Tang S. He Y. Shi X. Burden of non-communicable diseases due to population ageing in China: Challenges to healthcare delivery and long term care services BMJ 2024 387 e076529 10.1136/bmj-2023-076529 39424307 PMC11484826 5. Lobanov-Rostovsky S. He Q. Chen Y. Liu Y. Wu Y. Liu Y. Venkatraman T. French E. Curry N. Hemmings N. Growing old in China in socioeconomic and epidemiological context: Systematic review of social care policy for older people BMC Public Health 2023 23 1272 10.1186/s12889-023-15583-1 37391766 PMC10311713 6. Bunt S. Steverink N. Olthof J. van der Schans C.P. Hobbelen J.S.M. Social frailty in older adults: A scoping review Eur. J. Ageing 2017 14 323 334 10.1007/s10433-017-0414-7 28936141 PMC5587459 7. Zhang X.M. Cao S. Gao M. Xiao S. Xie X. Wu X. The Prevalence of Social Frailty Among Older Adults: A Systematic Review and Meta-Analysis J. Am. Med. Dir. Assoc. 2023 24 29 37.e29 10.1016/j.jamda.2022.10.007 36402197 8. Li J. Zhu L. Yang Y. Li Y. Fu P. Yuan H. Prevalence and potential influencing factors for social frailty among community-dwelling older adults: A systematic review and meta-analysis BMC Geriatr. 2024 24 762 10.1186/s12877-024-05365-8 39285322 PMC11403955 9. Zhang H. Hu Z. Jiang S. Hao M. Li Y. Liu Y. Jiang X.Y. Jin L. Wang X. Social frailty and the incidence of motoric cognitive risk syndrome in older adults Alzheimers Dement. 2024 20 2329 2339 10.1002/alz.13696 38284799 PMC11032557 10. Li X. Gao L. Qiu Y. Zhong T. Zheng L. Liu W. Li G. Chen L. Social frailty as a predictor of adverse outcomes among older adults: A systematic review and meta-analysis Aging Clin. Exp. Res. 2023 35 1417 1428 10.1007/s40520-023-02421-y 37219756 11. Cotterell N. Buffel T. Phillipson C. Preventing social isolation in older people Maturitas 2018 113 80 84 10.1016/j.maturitas.2018.04.014 29903652 12. Li Q. Cen W. Yang T. Tao S. Development and validation of a risk prediction model for older adults with social isolation in China BMC Public Health 2024 24 2600 10.1186/s12889-024-20142-3 39334267 PMC11428333 13. Chen X. Giles J. Yao Y. Yip W. Meng Q. Berkman L. Chen H. Chen X. Feng J. Feng Z. The path to healthy ageing in China: A Peking University-Lancet Commission Lancet 2022 400 1967 2006 10.1016/S0140-6736(22)01546-X 36423650 PMC9801271 14. Hilakivi-Clarke L. de Oliveira Andrade F. Social Isolation and Breast Cancer Endocrinology 2023 164 bqad126 10.1210/endocr/bqad126 37586098 15. Albasheer O. Abdelwahab S.I. Zaino M.R. Altraifi A.A.A. Hakami N. El-Amin E.I. Alshehri M.M. Alghamdi S.M. Alqahtani A.S. Alenazi A.M. The impact of social isolation and loneliness on cardiovascular disease risk factors: A systematic review, meta-analysis, and bibliometric investigation Sci. Rep. 2024 14 12871 10.1038/s41598-024-63528-4 38834606 PMC11150510 16. Zhang Y. Hu W. Feng Z. Social isolation and health outcomes among older people in China BMC Geriatr. 2021 21 721 10.1186/s12877-021-02681-1 34922481 PMC8683828 17. Yu B. Steptoe A. Chen Y. Social isolation, loneliness, and all-cause mortality: A cohort study of 35,254 Chinese older adults J. Am. Geriatr. Soc. 2022 70 1717 1725 10.1111/jgs.17708 35229887 18. Gong N. Meng Y. Hu Q. Du Q. Wu X. Zou W. Zhu M. Chen J. Luo L. Cheng Y. Obstacles to access to community care in urban senior-only households: A qualitative study BMC Geriatr. 2022 22 122 10.1186/s12877-022-02816-y 35164708 PMC8842867 19. Pradana A.A. Gobbens R.J.J. Chiu H.-L. Lin C.-J. Lee S.-C. Social frailty in older adults: A concept analysis Arch. Gerontol. Geriatr. 2025 130 105729 10.1016/j.archger.2024.105729 39736234 20. Misu Y. Katayama O. Lee S. Makino K. Harada K. Tomida K. Morikawa M. Yamaguchi R. Nishijima C. Fujii K. Reciprocal relationship between physical and social frailty among community-dwelling older adults Arch. Gerontol. Geriatr. 2023 114 105066 10.1016/j.archger.2023.105066 37245490 21. Wong A.K.C. Zhang M.Q. Bayuo J. Chow K.K.S. Wong S.M. Wong B.P. Liu B.C.M. Lau D.C.H. Kowatsch T. The Effect of Young People-Assisted, Individualized, Motion-Based Video Games on Physical, Cognitive, and Social Frailty Among Community-Dwelling Older Adults With Frailty: Randomized Controlled Trial JMIR Serious Games 2024 12 e57352 10.2196/57352 39622701 PMC11600656 22. Suzuki M. Asai S. Ohashi Y. Sobue Y. Ishikawa H. Terabe K. Sato R. Kosugiyama H. Hasegawa J. Ohno Y. Prevalence of social frailty in patients with rheumatoid arthritis: Data from a multicenter observational study (T-FLAG study) Mod. Rheumatol. 2024 35 234 239 10.1093/mr/roae078 39177377 23. National Academies of Sciences, Engineering, and Medicine Health and Medicine Division Division of Behavioral and Social Sciences and Education Board on Health Sciences Policy Board on Behavioral, Cognitive, and Sensory Sciences Committee on the Health and Medical Dimensions of Social Isolation and Loneliness in Older Adults Social Isolation and Loneliness in Older Adults: Opportunities for the Health Care System National Academies Press Washington, DC, USA 2020 10.17226/25663 32510896 24. Arms T. McCumber S. Social Isolation: Levels of Response for Nurse Practitioners J. Nurse Pract. 2023 19 104391 10.1016/j.nurpra.2022.06.016 25. Galderisi S. Rucci P. Kirkpatrick B. Mucci A. Gibertoni D. Rocca P. Rossi A. Bertolino A. Strauss G.P. Aguglia E. Interplay Among Psychopathologic Variables, Personal Resources, Context-Related Factors, and Real-life Functioning in Individuals With Schizophrenia: A Network Analysis JAMA Psychiatry 2018 75 396 404 10.1001/jamapsychiatry.2017.4607 29450447 PMC5875306 26. Mehrpour A. Widmer E.D. Staerklé C. Social network analysis in social psychological ressearch (1990–2020): A scoping review Br. J. Soc. Psychol. 2025 64 e12833 10.1111/bjso.12833 39789993 27. Bai X. Zhou Y. Lv X. Li J. Wang L. Gao X. Clarifying the relationship between insecure attachment and problematic social media use across platforms: A network analysis Soc. Psychiatry Psychiatr. Epidemiol. 2024 60 1467 1478 10.1007/s00127-024-02756-5 39230735 28. Yang W.F.Z. Chan Y.H. Griva K. Kuparasundram S. Mahendran R. Lifestyle and Symptom Management Needs: A Network Analysis of Family Caregiver Needs of Cancer Patients Front. Psychiatry 2021 12 739776 10.3389/fpsyt.2021.739776 34616323 PMC8488172 29. Bulletin of the Seventh National Population Census of Chongqing Municipality Available online: https://perma.cc/7WTY-VTEC (accessed on 17 August 2025) 30. Statistical Bulletin on the National Economic and Social Development of Chongqing Municipality Available online: https://perma.cc/2F7K-8ZWS (accessed on 17 August 2025) 31. Statistical Bulletin on the National Economic and Social Development of Luzhou Municipality Available online: https://perma.cc/YBY5-HSTM (accessed on 17 August 2025) 32. Law of the People’s Republic of China on the Protection of the Rights and Interests of the Elderly Available online: https://perma.cc/L5TV-YZ9Y (accessed on 17 August 2025) 33. Gong J. Wang G. Wang Y. Chen X. Chen Y. Meng Q. Yang P. Yao Y. Zhao Y. Nowcasting and forecasting the care needs of the older population in China: Analysis of data from the China Health and Retirement Longitudinal Study (CHARLS) Lancet Public Health 2022 7 e1005 e1013 10.1016/S2468-2667(22)00203-1 36423656 PMC9741660 34. Epskamp S. Borsboom D. Fried E.I. Estimating psychological networks and their accuracy: A tutorial paper Behav. Res. Methods 2018 50 195 212 10.3758/s13428-017-0862-1 28342071 PMC5809547 35. Wolf E.J. Harrington K.M. Clark S.L. Miller M.W. Sample Size Requirements for Structural Equation Models: An Evaluation of Power, Bias, and Solution Propriety Educ. Psychol. Meas. 2013 76 913 934 10.1177/0013164413495237 25705052 PMC4334479 36. Ma L. Sun F. Tang Z. Social Frailty Is Associated with Physical Functioning, Cognition, and Depression, and Predicts Mortality J. Nutr. Health Aging 2018 22 989 995 10.1007/s12603-018-1054-0 30272104 37. Nicholson N.R. Feinn R. Casey E.A. Dixon J. Psychometric Evaluation of the Social Isolation Scale in Older Adults Gerontologist 2020 60 e491 e501 10.1093/geront/gnz083 31201744 38. Hui P. The Chinese Translation and Preliminary Application of the Social Isolation Scale for Older Adults (SIS) Master’s Thesis Inner Mongolia Medical University Hohhot, China 2021 39. Borsboom D. Deserno M.K. Rhemtulla M. Epskamp S. Fried E.I. McNally R.J. Robinaugh D.J. Perugini M. Dalege J. Costantini G. Network analysis of multivariate data in psychological science Nat. Rev. Methods Primers 2021 1 58 10.1038/s43586-021-00055-w 40. Epskamp S. Cramer A.O. Waldorp L.J. Schmittmann V.D. Borsboom D. qgraph: Network visualizations of relationships in psychometric data J. Stat. Softw. 2012 48 1 18 10.18637/jss.v048.i04 41. Epskamp S. Fried E.I. A tutorial on regularized partial correlation networks Psychol. Methods 2018 23 617 634 10.1037/met0000167 29595293 42. Lin Y. Zhu T. Zhang X. Zeng Z. Trends in the prevalence of social isolation among middle and older adults in China from 2011 to 2018: The China Health and Retirement Longitudinal Study BMC Public Health 2024 24 339 10.1186/s12889-024-17734-4 38302982 PMC10832184 43. Teo R.H. Cheng W.H. Cheng L.J. Lau Y. Lau S.T. Global prevalence of social isolation among community-dwelling older adults: A systematic review and meta-analysis Arch. Gerontol. Geriatr. 2023 107 104904 10.1016/j.archger.2022.104904 36563614 44. Hou B. Nazroo J. Banks J. Marshall A. Are cities good for health? A study of the impacts of planned urbanization in China Int. J. Epidemiol. 2019 48 1083 1090 10.1093/ije/dyz031 30887030 45. Ren X. Lu C. Effect of Children’s Support on Depression among Older Adults Living Alone or with a Spouse: A Comparative Analysis between Urban and Rural Areas of China Sustainability 2021 13 6315 10.3390/su13116315 46. Coe N.B. Konetzka R.T. Berkowitz M. Blecker E. Van Houtven C.H. The effects of home care provider mix on the care recipient: An international, systematic review of articles from 2000 to 2020 Annu. Rev. Public Health 2021 42 483 503 10.1146/annurev-publhealth-090419-102354 33395544 PMC8190630 47. Zhang J. Sun X. Yao A. Use of home and community-based services and loneliness in older people with functional limitations: A cross-sectional study BMC Psychiatry 2023 23 717 10.1186/s12888-023-05225-6 37794343 PMC10548717 48. Li Y. Luo L. Dong H. Delivering Integrated Community Care for the Elderly: A Qualitative Case Study in Southern China Int. J. Environ. Res. Public Health 2024 21 680 10.3390/ijerph21060680 38928927 PMC11203458 49. Zhou W. Guo M. Hu B. Jiang Y. Yao Y. The effect of China’s Integrated Medical and Social Care Policy on functional dependency and care deficits in older adults: A nationwide quasi-experimental study Lancet Healthy Longev. 2025 6 100697 10.1016/j.lanhl.2025.100697 40179935 50. Körlof L. Nyman A. Isaksson G. Larsson E. Older Adults’ Experiences of Using Strategies to Maintain and Foster Social Participation: A Systematic Review with Metasynthesis of Qualitative Studies Health Soc. Care Community 2024 2024 7877128 10.1155/2024/7877128 51. Kelly M.E. Duff H. Kelly S. McHugh Power J.E. Brennan S. Lawlor B.A. Loughrey D.G. The impact of social activities, social networks, social support and social relationships on the cognitive functioning of healthy older adults: A systematic review Syst. Rev. 2017 6 259 10.1186/s13643-017-0632-2 29258596 PMC5735742 52. Sun J. Jiang W. Li H. Social isolation and loneliness among Chinese older adults: Examining aging attitudes as mediators and moderators Front. Psychol. 2022 13 1043921 10.3389/fpsyg.2022.1043921 36562076 PMC9763440 53. Olawa B.D. Taiwo A.O. Nolte L. Ageing Perception and Social Relationships Moderate the Associations Between Health Stressors and Life Satisfaction in the Very Old: Evidence from the ELSA Study J. Gerontol. Soc. Work. 2024 68 631 653 10.1080/01634372.2024.2435916 39617877 54. Döring N. Conde M. Brandenburg K. Broll W. Gross H.-M. Werner S. Raake A. Can Communication Technologies Reduce Loneliness and Social Isolation in Older People? A Scoping Review of Reviews Int. J. Environ. Res. Public Health 2022 19 11310 10.3390/ijerph191811310 36141581 PMC9517063 55. Buettmann E.G. Goldscheitter G.M. Hoppock G.A. Friedman M.A. Suva L.J. Donahue H.J. Similarities Between Disuse and Age-Induced Bone Loss J. Bone Miner. Res. 2022 37 1417 1434 10.1002/jbmr.4643 35773785 PMC9378610 56. Huang X. Tan H.Y. Er P.L. Wong A. Lim S.Q. Kuan Tan J. Yee W.Q. Xin X. Low L.L. From the WHO framework to integrated senior health and wellness hub program: An implementation journey Front. Public Health 2025 13 1593490 10.3389/fpubh.2025.1593490 40791618 PMC12336022 57. Hu L. Glavin Y.W. Integrating Health and Care for Older People in China: What Has Been Accomplished? What is Next? Int. J. Integr. Care 2023 23 16 10.5334/ijic.7598 PMC10038113 36967837 58. Tan X. Liu X. Shao H. Healthy China 2030: A Vision for Health Care Value Health Reg. Issues 2017 12 112 114 10.1016/j.vhri.2017.04.001 28648308 59. Li Z. Gu J. Li P. Hu J. Wang S. Wang P. Zhou L. Yun Y. Shi Y. Wang P. The relationship between social frailty and loneliness in community-dwelling older adults: A cross-sectional study BMC Geriatr. 2024 24 73 10.1186/s12877-024-04666-2 38238657 PMC10797967 60. Conwell Y. Van Orden K.A. Stone D.M. McIntosh W.L. Messing S. Rowe J. Podgorski C. Kaukeinen K.A. Tu X. Peer Companionship for Mental Health of Older Adults in Primary Care: A Pragmatic, Nonblinded, Parallel-Group, Randomized Controlled Trial Am. J. Geriatr. Psychiatry 2021 29 748 757 10.1016/j.jagp.2020.05.021 32586693 PMC7266585 61. Shekelle P.G. Miake-Lye I.M. Begashaw M.M. Booth M.S. Myers B. Lowery N. Shrank W.H. Interventions to Reduce Loneliness in Community-Living Older Adults: A Systematic Review and Meta-analysis J. Gen. Intern. Med. 2024 39 1015 1028 10.1007/s11606-023-08517-5 38200279 PMC11074098 62. Zheng L. Li X. Qiu Y. Xu Y. Yang Y. Chen L. Li G. Effects of nurse-led interventions on the physical and mental health among pre-frail or frail older adults: A systematic review Ageing Res. Rev. 2024 100 102449 10.1016/j.arr.2024.102449 39111408 63. Hoang P. King J.A. Moore S. Moore K. Reich K. Sidhu H. Tan C.V. Whaley C. McMillan J. Interventions Associated With Reduced Loneliness and Social Isolation in Older Adults: A Systematic Review and Meta-analysis JAMA Netw. Open 2022 5 e2236676 10.1001/jamanetworkopen.2022.36676 36251294 PMC9577679 64. Howland J. Stone A. Public health nurses for case finding, assessment and referral of community-dwelling socially isolated and/or lonely older adults Front. Public Health 2023 11 1114792 10.3389/fpubh.2023.1114792 37033035 PMC10073688 Figure 1 Boxplot of Social Frailty Severity and Social Isolation Score. 0 = without social frailty; 1 = with the pre-frail stage of social frailty; 2 = with social frailty; SI = social isolation. Figure 2 The network structure of social frailty and social isolation in Chinese older adults. Note: SF1 = Inability to help others; SF2 = Limited social participation; SF3 = Loneliness; SF4 = Economic hardship; SF5 = Lack of someone to talk to. SI1 = See face-to-face at least once a month; SI2 = Communicate with on a personal level; SI3 = Feel close to on a personal level; SI4 = Feel that my relationships are fulfilling; SI5 = I feel like I just don’t belong; SI6 = Spend enough time in social activities; Edges are colored by sign (blue = positive, red = negative), and their width/saturation indicates absolute edge weight. nursrep-15-00315-t001_Table 1 Table 1 The characteristics of participants (n = 451). Variables Median, IQR, Percentage (n = 451) Age 71 (66, 80) Gender  Male 225 (49.9) Female 226 (50.1) Educational years  ≤6 years 167 (37.0) >6 to 12 years 227 (50.3) >12 years 57 (12.7) Marital status  Married 331 (73.3) Divorced/Widowed 120 (26.7) Source of income  Children 120 (26.7) Pension 283 (62.7) Other 48 (10.6) Household Per Capita Monthly Income  ≤2000 yuan 72 (15.9) >2000 to 4000 yuan 147 (32.5) >4000 yuan 75 (16.6) Not reported 157 (34.8) Employment status  Retired/Unemployed 431 (95.5) Employed 20 (4.5) Number of children  ≤1 173 (38.3) 2 148 (32.8) ≥3 130 (28.8) Living alone  Yes 117 (25.9) No 334 (74.1) ",
  "metadata": {
    "Title of this paper": "Public health nurses for case finding, assessment and referral of community-dwelling socially isolated and/or lonely older adults",
    "Journal it was published in:": "Nursing Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472408/"
  }
}