{
  "title": "Paper_303",
  "abstract": "Environ Sci Technol Environ Sci Technol 319 nihpa Environmental science & technology 0013-936X 1520-5851 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12486300 PMC12486300.1 12486300 12486300 NIHMS2111033 40576990 10.1021/acs.est.5c04054 NIHMS2111033 NIHPA2111033 1 Article Machine Learning and Large Language Models for Modeling Complex Toxicity Pathways and Predicting Steroidogenesis Lane Thomas R. 1 * Vignaux Patricia A. 1 Harris Joshua S. 1 Snyder Scott H. 1 Urbina Fabio 1 Ekins Sean 1 * 1 * Corresponding Author tom@collaborationspharma.com sean@collaborationspharma.com Competing interests: SE is CEO and Founder at Collaborations Pharmaceuticals, Inc. while TRL, FU, SHS are employees of this company. Other authors have no conflicts. 15 7 2025 27 6 2025 59 27 498036 13844 13856 23 09 2025 01 10 2025 02 10 2025 02 10 2025 High-throughput screening and computational models have been effective in predicting chemical interactions with estrogen and androgen receptors, but similar approaches for steroidogenesis remain limited. To address this gap, we developed general steroidogenesis modulation models using data from ~1,800 chemicals screened in H295R human adrenocortical carcinoma cells. A random forest model was validated using a prospective test set of 20 compounds (14 predicted active, 6 inactive), achieving 80% accuracy with conformal prediction adjustments. In parallel, we built classification and regression models based on IC 50 Graphical Abstract  Steroidogenesis endocrine disruption machine learning large language models MolBART conformal predictors pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Machine Learning and Large Language Models for Modeling Complex Toxicity Pathways and Predicting Steroidogenesis",
    "Journal it was published in:": "Environmental science & technology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486300/"
  }
}