{
  "title": "Paper_28",
  "abstract": "pmc Cell Rep Med Cell Rep Med 3954 cellrepsmed Cell Reports Medicine 2666-3791 Elsevier PMC12490239 PMC12490239.1 12490239 12490239 40858106 10.1016/j.xcrm.2025.102313 S2666-3791(25)00386-6 102313 1 Article Combining BET inhibition with SMAC mimetics restricts tumor growth and triggers immune surveillance in preclinical cancer models Slavic Obradovic Ksenija 1 Ebner Florian 1 Artemov Artem V. 1 Miotto Martina 2 Traexler Paula-Elena 1 Jacob Robin 1 Pham Thi Thanh Ha 1 Ruzicka Regina 1 Wernitznig Andreas 1 Baumann Ines 1 Gerlach Daniel 1 Impagnatiello Maria-Antonietta 1 Siena Salvatore 5 6 Murphy Mary 3 House Reniqua 3 Reiser Ulrich 1 Santoro Valeria 1 Popow Johannes 1 Carotta Sebastian 1 Baum Anke 1 Lipp Jesse 1 Bardelli Alberto 2 4 Tontsch-Grunt Ulrike 1 Russo Mariangela mariangela.russo@unito.it 2 ∗ Aichinger Martin martin.aichinger@boehringer-ingelheim.com 1 7 ∗∗ 1 2 3 4 5 6 ∗ mariangela.russo@unito.it ∗∗ martin.aichinger@boehringer-ingelheim.com 7 Lead contact 16 9 2025 25 8 2025 6 9 498186 102313 5 8 2024 29 4 2025 28 7 2025 25 08 2025 03 10 2025 03 10 2025 © 2025 The Author(s) 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). Summary Second mitochondrial activator of caspase (SMAC) mimetics (SMACm) and bromodomain and extra-terminal domain (BET) inhibitors (BETi) are two distinct classes of novel anticancer therapeutics. So far, broad clinical benefit for either monotherapy has not been achieved, calling for effective combination strategies. We show that the combination of BI 891065, a monovalent oral SMACm antagonist of inhibitor of apoptosis protein 1 (cellular inhibitor of apoptosis protein 1 [cIAP1]), and BI 894999, a potent and selective oral BETi, significantly impaired cancer cell proliferation irrespective of tissue context. Interestingly, we observed various forms of cell death pointing at distinct, but functionally converging, modulation of cell death-promoting pathways. A multi-omic analysis using Cellular Indexing of Transcriptomes and Epitopes by sequencing (CITE-seq) and advanced flow cytometry of a syngeneic model of pancreatic ductal adenocarcinoma (PDAC) unveils distinct phenotypic correlations of augmented anti-tumor immunity and a substantially reduced immunosuppressive tumor microenvironment (TME). Collectively, this study presents BETi and SMACm as a promising drug combination for patients with cancer with a multi-layered impact on both tumor cell-intrinsic and TME-dependent mechanisms. Graphical abstract Highlights • BETi+SMACm inhibits cancer cell proliferation resulting in enhanced in vivo • Combination therapy modulates the tumor microenvironment and enhances anti-tumor immunity • CITE-seq in syngeneic PDAC model provides insight into impact on anti-tumor immunity Slavic-Obradovic et al. demonstrate broad synergy between SMAC mimetics and BET bromodomain inhibition in inducing tumor cell death across solid cancer indications. In a pancreatic cancer model, they reveal that this combination remodels the tumor microenvironment and promotes anti-tumor immunity. Keywords SMAC mimetic cIAP BET inhibition cell death tumor microenvironment combination therapy pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Published: August 25, 2025 Introduction The discovery of effective combination therapies for cancer holds promise to broadening response rates to a wider indication spectrum as well as suppressing the emergence of drug resistance. 1 The BET protein family consists of BRD2, BRD3, BRD4, and BRDT. The best-studied BET family member BRD4 is a “reader” of epigenetic information and can bind to acetylated chromatin and non-chromatin proteins to act as a key regulator of transcription. 2 3 , 4 , 5 6 , 7 , 8 8 , 9 10 , 11 Small-molecule compounds mimicking the second mitochondrial activator of caspases (SMAC), SMAC mimetics (SMACm), are antagonists of IAPs and have been clinically evaluated as anti-cancer treatments. 12 13 13 14 15 16 , 17 18 , 19 , 20 16 , 17 Mechanistically, both BETi and SMACm exert multifaceted effects on tumor cells, and their activity may converge at multiple points to initiate a cell death cascade. BETi have been shown to modulate the NF-κB pathway. 21 , 22 23 23 , 24 , 25 26 27 28 23 , 24 , 25 , 28 , 29 In addition to cancer cell-intrinsic activity, both BETi and SMACm have shown wide-ranging immunomodulatory effects, which may favor anti-tumor immune activity. 30 , 31 , 32 33 in vitro in vivo Results SMACm and BETi synergize in inducing a potent antiproliferative effect across a broad panel of cancer cell lines BI 891065, a 2-amino- N NCT03166631 NCT04138823 To determine the selectivity profile of BI 891065, binding assays were performed quantifying the interaction between BI 891065 and the baculoviral IAP repeat domain 3 domain of cIAP1, cIAP2, and XIAP by displacing the SMAC-derived peptide, as recently described for BI 878382. 32 , 34 Figures 1 Figure 1 The combinatorial effect of BI 894999 and BI 891065 across a panel of human tumor cell lines (A) Selectivity and potency profiles of BI 891065. Top left, structure of BI 891065. Top right, IC 50 (B) WES (Simple Western System) analysis of cIAP1, cIAP2, and XIAP levels upon treatment of HT-29 cells with indicated concentrations of BI 891065 for 6 h (C) IC 50 n (D) Example of proliferation assay for synergy analysis in LoVo cell line; shown is combination plate map matrix and the cell growth inhibition (CGI) at the indicated concentrations; CGI values < 100%: tumor cell growth, CGI 100%: tumor cell stasis, and CGI > 100%: tumor cell killing. (E) Synergy scores across the tested panel of cell lines obtained using Bliss synergy analysis. (F) Violin plots showing the synergy scores for BETi and SMACm combination across indications. N is the number of cell lines tested in each indication group. BI 894999 is a potent BET family inhibitor, blocking the binding of BRD2/3/4 and BRDT to acetylated histones in the low nanomolar range. 7 50 8 To investigate the synergistic interaction between BI 894999 (hereafter, BETi) and BI 891065 (hereafter, SMACm), we evaluated the in vitro Figures 1 Table S2 Figure 1 Figures 1 Figure 1 Figure 1 SMACm and BETi combination can induce different modalities of cell death in cancer cells The interaction between BETi and SMACm was further investigated mechanistically in three human cell lines. In vitro Figure 2 Figure 2 BETi and SMACm combination induces multiple forms of cell death in vitro (A) IncuCyte S3 live-cell imaging, following in vitro (B) Effect of TNF and caspase inhibition on induction of cell death by BETi and SMACm co-treatment. Shown is cell confluence measured at day 7 of treatment. Shown results are pool of 3 independent experiments (including data shown in A), plotted as mean +/- SD. BETi (BI 894999) and SMACm (BI 891065) concentrations were as shown in (A), TNF inhibitor Enbrel, 5 μg/mL, caspase inhibitor Z-VAD-FMK (zVAD), 20 μM. Statistical analysis: ∗∗∗ p p To better characterize the mode of cell death induced by the combinatorial treatment, we evaluated the impact of caspase inhibition in this context. As both BETi and SMACm can lead to the production of TNF via an activation of the NF-κB pathway, 16 , 17 MKN-45 cells under combination treatment were rescued from cell death by addition of a pan-caspase inhibitor (zVAD), as well as by blocking TNF signaling ( Figure 2 Figure S1 Figure 2 As XIAP, which is not effectively targeted by BI 891065 ( Figure 1 13 Figures S1 Thus, our results show that depending on cellular context, combination of BETi and SMACm can lead to induction of various modalities of cell death that can differentially rely on TNF signaling. Combining SMACm and BETi is effective in colorectal patient-derived organoid models and in pancreatic and colorectal in vivo To further approximate the effect of the combinatorial regimen on human disease, we performed experiments in CRC patient-derived organoids (PDOs), which more closely recapitulate disease. To this aim, we tested six CRC PDOs in vitro Figures 3 S1 Figure 3 Efficacy of BETi and SMACm co-administration in CRC patient-derived organoid models and in PDAC and CRC cell line-derived xenografts (A) Sensitivity of CRC patient-derived organoids (PDOs) to increasing SMACm concentrations in the absence or presence of BETi. Average of three independent experiments for PDO_1, PDO_2, and PDO_3 and average of two independent experiments for PDO_4 are shown. For each experiment, data were normalized to the mean of the DMSO control wells and plotted as mean ± SEM values. (B) BETi and SMACm target engagement in BxPC-3 in vivo (C–F) Mean tumor volumes +/- SEM in treated mice measured over a time course for different models: (C) pancreatic ductal adenocarcinoma BxPC-3 xenograft model ( p p p p p p p p Statistics: (A and B) one-way ANOVA with Dunnett’s multiple comparison test (shown only for experiments with 3 independent biological replicates); (C–F) Kruskal-Wallis test with Dunn’s correction for multiple comparisons was performed on the last time points where at least 70% of animals remained in all the treatment groups. In all four models, treatments were given orally at indicated doses, with q.d. schedule. BETi, BI 894999; SMACm, BI 891065. To further extend upon the physiological relevance of the BETi and SMACm combination, we next evaluated the impact of mono- and combination therapies in vivo in vivo 6 Figures 3 S3 in vivo. in vivo Figure S3 Figure 3 Figure 3 In three CRC xenograft models tested (LoVo, C80, and LIM2551), neither of the inhibitors applied alone at clinically relevant doses resulted in pronounced TGI when compared to the vehicle control. However, all CRC models showed an improved response and significant TGI upon the combination treatment regimen ( Figures 3 Overall, models established in BomTac:NMRI- Foxn1 nu Figure S2 Figure S2 Together, our findings demonstrate the enhanced therapeutic impact of the BETi and SMACm combination in inducing stronger TGI over either monotherapy in different in vivo SMACm and BETi combination impairs tumor growth in a pancreatic syngeneic model Accumulating evidence points toward a broad spectrum of immunomodulatory effects mediated by BETi and SMACm as single agents. 30 , 31 , 32 , 33 , 35 , 36 in vivo Initial in vitro Figure 4 Figure S1 Figures S1 Figure 4 BETi and SMACm combination impairs tumor growth of a pancreatic syngeneic model (A) Time course of in vitro (B) Caspase inhibition by Z-VAD-FMK (zVAD) and RIPK1 inhibition by necrostatin-1 (Nec-1) rescue Pan02 cells from cell death induced by BETi+SMACm combination in the presence of TNF. Cell viability was measured by the CellTiter-Glo assay 96 h after treatments started. Shown results are pool of 2 independent experiments. Concentration of zVAD was 20 μM, and Nec-1 concentration was 10 μM (one-way ANOVA with Dunnett’s multiple comparison test; ∗∗ p (C) JESS (Simple Western System) analysis of caspase-3 and PARP cleavage in Pan02 cell line upon treatments with BETi (50 nM), SMACm (1 μM), and TNF (25 ng/mL). Cell pellets were collected for lysis and JESS analysis at the 24 h time point after treatments started. Error bars indicate SEM. (D) Mean tumor volumes of Pan02 syngeneic model ( p p p Statistics: Kruskal-Wallis test with Dunn’s correction for multiple comparisons was performed on the last time points where at least 70% of animals remained in all the treatment groups. Treatments were given orally at indicated doses, with q.d. schedule. BETi, BI 894999; SMACm, BI 891065. This led us to further investigate the mechanism of cell death induced in Pan02 cells. Our findings point to RIPK1-dependent apoptosis, as cells were rescued from cell death by addition of the caspase inhibitor zVAD or the RIPK1 inhibitor Nec-1 ( Figure 4 Figure 4 In vivo in vivo in vitro Figure 4 Combining SMACm and BETi induces immune-modulatory effects in an immunocompetent pancreatic (Pan02) model In order to dissect the effects of SMACm and BETi therapy on the immune compartment and the TME, we performed an additional in vivo Figures S4 5 Figure S4 Figure 5 Combined SMACm and BETi treatment augments anti-tumor immunity in vivo (A) Tumor weights on the day of analysis (day 16 post treatment, n (B) Viable cell numbers determined by trypan blue-stained automated counting. (C and D) Fraction of (C) myeloid cells (CD11b+) and (D) T cells (Thy1.2+) as a percentage of all immune cells pre-gated on living CD45 + (E) Representative flow cytometry plots show CD8a+ and CD4 + (F) CD8a+ T cell frequency among all immune cells. CD8a+ T cells were pre-gated as living CD45+Thy1.2+. (G) Frequency of polymorphonuclear myeloid-derived suppressor cells (PMN-MDSCs) among all immune cells gated on living CD45 + (H) Macrophage polarization marker expressing cells as frequency of all tumor-associated macrophages (TAMs). Depicted are CD86, CD11c, CD80, and CD206 (from left to right). (I) Frequency of arginase-1-expressing TAMs among all TAMs. TAMs were gated on living CD45 + (J) Left, histograms showing arginase-1 high- and low-expressing populations of macrophages. Right, bar plots show Arg-1hi-expressing TAMs among all Arg-1+ TAMs. n Data plotted in A–D and F–J are ±/− SD. Statistical significance: ∗ p p p Multicolor spectral flow cytometry was performed with a focus on analysis of tumor-infiltrating immune cells ( Figure S4 Table S4 Figure 5 Figure 5 Figures 5 + + Figure S4 Within the myeloid cell population, the combined action of SMACm and BETi leads to a substantial reduction of immunosuppressive polymorphonuclear myeloid-derived suppressor cells (PMN-MDSCs)/neutrophils ( Figure 5 Frequencies of eosinophils and tumor-associated macrophages (TAMs) were largely comparable across all treatment groups, whereas monocytic MDSCs and myeloid dendritic cells were more abundant in the double-treated animals ( Figure S4 Figure 5 Figure 5 Additionally, we investigated the expression of the immunosuppressive enzyme arginase-1 37 Figures 5 Endothelial cell and cancer-associated fibroblast (CAF) frequencies within the TME were similar across all treatment groups ( Figure S4 38 Figure S4 Taken together, this flow cytometry analysis demonstrated distinct pharmacodynamic changes elicited by BETi+SMACm co-treatment which correlated with increased tumor control, enhanced CD8a+ T cell immunity, and reduced immunosuppressive cell types—such as PMN-MDSCs, arginase-1-expressing TAMs, and Ly-6C+ CAFs. Single-cell CITE-seq analysis showed improved anti-tumor immunity and a reduced immunosuppressive TME in the syngeneic Pan02 preclinical model To further examine therapy effects on the immune compartment of Pan02 tumors with a single-cell resolution, we next performed multi-omic CITE-seq analysis aiming at deeper characterization of immune cell correlates of efficacy in response to BETi+SMACm treatment. To this end, we quantified 56 cell surface proteins and mRNA expression levels of 397 immune response genes. Dimensionality reduction of obtained multi-omic data allowed identification of cell states and the annotation of landmark immune cell subsets ( Figures 6 Figure 5 + Figure 6 Figure 6 Immune-modulatory effects of SMACm and BETi in the syngeneic PDAC model (A) Uniform manifold approximation and projection cell clustering based on CITE-seq RNA and protein analysis. (B and C) (B) Gene expression (single-cell RNA sequencing) and (C) surface protein abundance (CITE-seq) of cell type markers. (D) Fractions of cell types shown in (A) split by treatments; fractions were calculated as a ratio between the number of cells in a cell type and the total number of cells in the treatment. (E) Violin plots showing expression of selected cytotoxic cytokines across cell types shown in (A) (top). Bottom, expression of Tnf, Ifng, and Fasl RNA across cell types split by treatments assessed by CITE-seq analysis (gene expression is normalized by Seurat in a standard way). Order of samples is corresponding to the dot plot below in (F). (F) Dot plot shows selected top differentially abundant surface proteins assessed by CITE-seq (average row-wise expression was subtracted for normalization). (G) Gene expression profiling by CITE-seq analysis; heatmap shows RNA expression of selected top differentially expressed genes (DEGs) across main immune cell types split by treatment. As the presence of TNF is necessary for the antiproliferative effect of BETi+SMACm on Pan02 cells in vitro Figure 4 Tnf Tnf Tnf Figure 6 + Figure 6 Ifng + Figure 6 We further interrogated expression patterns of the most differentially expressed genes across main immune cell subsets ( Figure 6 Table S5 Cd8a Tnfrsf4 OX40 Tnfrsf9 4-1BB Tnfrsf18 Dpp4 Ccr7 39 , 40 , 41 , 42 Figure 6 + Top2a Pcna Mcm2 Mcm4 Bcl2 Pdcd1 Lag3 Figure 6 In line with these indicators of increased activity, the immune checkpoint Ctla4 + Cd86 Figure 6 Expression of chemokines and cytokines promoting the recruitment of effector T cells and natural killer cells into tumors, 43 , 44 Cxcl9 Cxcl10 Arginase-1 Ccr2 Ccr5 45 , 46 Figure 6 In addition to mRNA expression analysis, the CITE-seq approach facilitated the simultaneous examination of cell surface protein abundance ( Figures 6 S5 Figures 6 S5 Figures 6 S5 47 Figures S5 Collectively, our CITE-seq analysis complements the cytometry findings described earlier by adding a functional layer building on gene and protein expression data at the single-cell level. The induction of TNF and genes implicated in T cell activation and proliferation together with a distinct modulation of immune-suppressive cues further corroborates the anti-tumor activity of BETi+SMACm combination exerted via the immune compartment. Discussion Despite broad evidence for the anticancer efficacy of BETi in preclinical studies, efforts to translate these findings for therapeutic application have been hampered by side effects and a short duration of clinical response. These limitations call for the identification of effective combination drugs, which may allow lowering therapeutic doses. 9 48 49 , 50 , 51 Mechanistically, our data portray a unique property of this therapeutic approach to robustly facilitate different forms of cell death like apoptosis (MKN-45 and Pan02) or caspase-independent forms of cell death (LoVo and BxPC-3). Adding to this robustness is the compatibility of this therapeutic modality with several independent cell death triggers. As it is fair to assume that in our experimental in vitro in vitro Our experiments clearly demonstrate an essential role for TNF in being the initial cell death trigger for some cell lines (MKN-45, LoVo, and Pan02); cell death in other cell lines like BxPC-3 is initiated by factors other than TNF, as functional depletion did not impact the viability of cells in the context of BETi+SMACm treatment. Importantly, SMACm have been shown to facilitate death induction in the presence of other cell death ligands, e.g., interferons and TNF-related apoptosis inducing ligand (TRAIL), 52 53 TNF and other death ligands can—in principle—be provided by many cells within the TME, including autocrine secretion from cancer cells upon stimulation, 32 , 54 55 Further leveraging state-of-the-art multi-omic analysis, we found that SMACm and BETi combination overall shaped the TME to be less immunosuppressive. This state is relayed via a concerted treatment-induced modulation of key cell types and phenotypes. While generally these effects were most pronounced in the combination setting, some effects were primarily driven by either BETi or SMACm treatment. For example, SMACm treatment was the driving cause of a reduction of M2-polarized TAMs, while at the same time leading to an increased abundance of TAMs with a pro-inflammatory signature (highlighted by increased expression of CD86 and CD11c protein, Cxcl9 Cxcl10 56 , 57 , 58 + 59 + Other favorable changes potentially contributing to the mechanisms affording enhanced tumor control were the reduction of additional tumor-promoting immunosuppressive cell types like Ly-6C+ CAFs and PMN-MDSCs. 38 , 44 Figures 5 S4 Table S3 30 , 35 Taking into account our findings in vivo Clinical implications, beyond indications investigated here, include head and neck squamous cell carcinoma (HNSCC) for which there is a high unmet medical need for effective targeted therapies. Recent studies have shown great promise for IAP antagonists in the treatment of HNSCC, especially in combination with radiation therapy. 60 61 Taken together, our data put forward the promising therapeutic concept of combining BETi and SMACm. The simultaneous induction of tumor cell death and the modulation of anti-tumor immunity may ultimately lead to improved outcomes for patients with cancer. Limitations of the study This study has limitations. We found that the combination of SMACm and BETi is effective in a substantial fraction of tumors independently of their tissue origin and genetic background, but we have not benchmarked this combination against other potential preclinical combinations and have not identified biomarkers associated with sensitivity or resistance. Our study positions TNF signaling as a central factor facilitating the anti-tumor efficacy of the combination treatment. However, in the BxPC3 model, the dominant effect is mediated by other factors, which we do not further characterize in this study. In the syngeneic PAN02 model, we describe various cellular sources of TNF, and while the presented data strongly suggest causality, we do not formally show the consequences of in vivo Resource availability Lead contact Requests for further information or reagents should be directed to the lead contact, Martin Aichinger ( martin.aichinger@boehringer-ingelheim.com Materials availability There are restrictions to the availability of materials. The PDOs are available from A. Bardelli and M.R. (UNITO) (MTA required). BI 894999 is available through opnME https://www.opnme.com/molecules/bet-inhibitor-bi89499 Data and code availability  • Single-cell sequencing data generated during the study are available at GEO accession number GSE269602 • The codes used for the analyses are available at https://github.com/Boehringer-Ingelheim/smacm_beti_cellreportsmedicine • Any additional information required to reanalyze the data reported in this work paper is available from the lead contact Acknowledgments We would like to acknowledge A. Krolo, J. Klufa, S. Kupka, and I. Tirapu for continued discussions, S. Olt and R. Holly for technical assistance, and E. Strauss for help with screening data import and validation. Research leading to these results was supported by AIRC under 5 per Mille 2018 21091 AIRC under IG 2023 28922 AIRC MFAG 2021 26439 Figure S4 Author contributions K.S.O., F.E., P.-E.T., H.P.T.T., R.R., R.J., I.B., M. Miotto, and M. Murphy performed the experiments. Conceptualization, analysis, and interpretation of in vitro ex vivo in vivo Declaration of interests A. Bardelli declares the following competing financial interests: receipt of grants/research supports from Neophore, AstraZeneca, and Boehringer Ingelheim; receipt of honoraria or consultation fees from Guardant Health; stock shareholder at Neophore and Kither Biotech; and a member of the SAB of Neophore. S.S. is an advisory board member for Agenus, AstraZeneca, Bayer, Bristol Myers Squibb, CheckmAb, Daiichi-Sankyo, GlaxoSmithKline, Istituto Nazionale Genetica Medica, MSD, Merck, Novartis, Ospedale San Raffaele, Pierre-Fabre, Pfizer, Seagen, and T-One Therapeutics. K.S.O., F.E., A.V.A., P.-E.T., R.J., H.P.T.T., R.R., A.W., I.B., D.G., M.-A.I., M. Murphy, R.H., U.R., V.S., J.P., S.C., A. Baum, J.L., U.T.-G., and M.A. are current or past employees of Boehringer Ingelheim. BI 894999 is part of patent applications derived from WO2014/076237, and BI 891065 is part of patent applications derived from WO2016/023858. STAR★Methods Key resources table  REAGENT or RESOURCE SOURCE IDENTIFIER Antibodies Thy1.2 BD CAT# 740205; RRID:AB_2739955 CD45 BD CAT# 749889; RRID:AB_2874129 CD31 BD CAT# 741505; RRID:AB_2870961 CD80 BD CAT# 741956; RRID:AB_2871264 F4/80 Biolegend CAT# 123131; RRID:AB_10901171 CD11b BD CAT# 566117; RRID:AB_2739519 CD8a Thermo Fisher CAT# 69-0081-82; RRID:AB_2637161 CD44 Biolegend CAT# 103037; RRID:AB_10900641 CD25 BD CAT# 563061; RRID:AB_2737982 Ly-6C Biolegend CAT# 128037; RRID:AB_2562630 CD86 BD CAT# 747439; RRID:AB_2872120 CD4 Thermo Fisher CAT# Q22165 CD11c Biolegend CAT# 117364; RRID:AB_2832410 MHCII (I-A/I-E) Biolegend CAT# 107624; RRID:AB_2191073 PD-L1 Biolegend CAT# 116130; RRID:AB_2800583 Ly-6G (self-conjugated) Biolegend/Thermo Fisher CAT# 127601/K06T04L007 CD103 BD CAT# 562772; RRID:AB_2737784 Siglec-F BD CAT# 562680; RRID:AB_2687570 Foxp3 BD CAT# 563902; RRID:AB_2630318 CD206 Biolegend CAT# 141738; RRID:AB_2860694 Arg1 Thermo Fisher CAT# 25-3697-82; RRID:AB_2734841 CD3 BD CAT# 940107; RRID:AB_2875997 CD4 BD CAT# 940108; RRID:AB_2875998 CD45R (B220) BD CAT# 940110; RRID:AB_2876000 CD19 BD CAT# 940111; RRID:AB_2876001 CD11c BD CAT# 940112; RRID:AB_2876002 Ly-6G BD CAT# 940113; RRID:AB_2876003 CD25 BD CAT# 940116; RRID:AB_2876006 Siglec-F BD CAT# 940117; RRID:AB_2876007 Ly-6G/Ly-6C BD CAT# 940119; RRID:AB_2876009 CD28 BD CAT# 940120; RRID:AB_287601 NK-1.1 BD CAT# 940121; RRID:AB_2876011 CD62L BD CAT# 940122; RRID:AB_2876012 I-A/I-E BD CAT# 940123; RRID:AB_2876013 TCR BETA CHAIN BD CAT# 940125; RRID:AB_2876014 CD69 BD CAT# 940126; RRID:AB_2876015 CD117 (c-Kit) BD CAT# 940127; RRID:AB_2876016 CD279 PD-1 BD CAT# 940128; RRID:AB_2876017 CD86 (B7-2) BD CAT# 940129; RRID:AB_2876018 TER-119 BD CAT# 940132; RRID:AB_2876021 CD103 BD CAT# 940136; RRID:AB_2876025 CD90.2 BD CAT# 940139; RRID:AB_2876028 CD335(NKp46) BD CAT# 940140; RRID:AB_2876029 CD80 (B7-1) BD CAT# 940141; RRID:AB_2876030 CD274 (B7-H1) BD CAT# 940142; RRID:AB_2876031 CD40 BD CAT# 940143; RRID:AB_2876032 CD24 BD CAT# 940144; RRID:AB_2876033 CD223 (LAG-3) BD CAT# 940152; RRID:AB_2876041 H-2Kb BD CAT# 940164; RRID:AB_2876052 CD197 (CCR7) BD CAT# 940165; RRID:AB_2876053 CD326 (Ep-CAM) BD CAT# 940169; RRID:AB_2876056 CD1d BD CAT# 940171; RRID:AB_2876058 CD54 (ICAM-1) BD CAT# 940172; RRID:AB_2876059 CD14 BD CAT# 940174; RRID:AB_2876061 CD278(ICOS) BD CAT# 940176; RRID:AB_2876063 CD273 (PD-L2) BD CAT# 940180; RRID:AB_2876066 H-2Kd BD CAT# 940194; RRID:AB_2876077 CD115 BD CAT# 940198; RRID:AB_2876081 CD137 (4-1BB) BD CAT# 940199; RRID:AB_2876082 CD172a (SIRPα) BD CAT# 940201; RRID:AB_2876084 CD45RB BD CAT# 940206; RRID:AB_2876088 CXCR2 BD CAT# 940209; RRID:AB_2876091 TCR Vγ1.1 BD CAT# 940334; RRID:AB_2876207 CD45Ra BD CAT# 940335; RRID:AB_2876208 CD8a BD CAT# 940345; RRID:AB_2876217 CD25 BD CAT# 940356; RRID:AB_2876227 CD83 BD CAT# 940350; RRID:AB_2876221 CD272 BD CAT# 940415; RRID:AB_2876275 Vγ 3 TCR BD CAT# 940354; RRID:AB_2876225 F4/80-L BD CAT# 940412; RRID:AB_2876273 CD44 BD CAT# 940114; RRID:AB_2876004 CD11b BD CAT# 940008; RRID:AB_2875899 cIAP1 Cell Signaling CAT# 7065; RRID:AB_10890862 cIAP2 Cell Signaling CAT# 3130; RRID:AB_10693298 XIAP Cell Signaling CAT# 14334; RRID:AB_2784533 GAPDH Abcam CAT# 8245; RRID:AB_2107448 PARP Cell Signaling CAT# 9542; RRID:AB_2160739 Caspase-3 Cell Signaling CAT# 14220; RRID:AB_2798429 Cleaved Caspase-3 Cell Signaling CAT# 9664; RRID:AB_2070042 Goat anti-Mouse IgG (H + L) Secondary Antibody DyLight 650 Novus NBP1-75147C; RRID:AB_3219020 Chemicals, peptides, and recombinant proteins Z-VAD-FMK Sigma-Aldrich V116-2MG Etanercept (Enbrel ®) Pfizer Necrostatin-1 MedChemExpress HY-15760 BI 894999 Boehringer Ingelheim BI 891065 Boehringer Ingelheim Halt™ protease and phosphatase inhibitor cocktail Thermo Fisher Scientific 78440 MSD Tris Lysis Buffer MSD R60TX-2 Calcein AM Thermo Fisher C1430 Draq7 BD 564904 AMPure XP Beckman Coulter A63880 Critical commercial assays CellTiter-Glo®2.0 Promega G9242 GAPDH assay kit MSD MSD-K151PWD-2 cIAP1 assay kit MSD F217V Qiagen RNeasy Lipid Tissue Kit Qiagen 74804 TaqMan Fast Advanced Master Mix Applied Biosystems 4444556 Quantseq 3′mRNA-Seq Library Prep Kit-FWD Lexogen 015 QuBit 1x dsDNA HS Assay Kit Invitrogen Q33231 High Sensitivity D1000 Reagents Agilent 5067–5585 High Sensitivity DNA ScreenTape Agilent 5067–5584 Kapa Library Quantification Kit ROX low Roche KK4973 Tumor Dissociation Kit, mouse Miltenyi 130-096-730 CD45 (TIL) MicroBeads, mouse Miltenyi 130-110-618 BD Ms Single Cell Sample Multiplexing Kit BD 633793 BD Rhapsody Cartridge Reagent Kit BD 633731 BD Rhapsody Cartridge Kit BD 633733 BD Rhapsody cDNA Kit BD 633773 BD Rhapsody Immune Response Panel Mm BD 633753 BD Rhapsody Targeted mRNA and AbSeq Amplification Kit BD 633774 Deposited data Single cell sequencing data GEO accession number GSE269602 Experimental models: Cell lines Full list of human cell lines and culture conditions is given in Table S1 Experimental models: Organisms/strains BomTac:NMRI- Foxn1 nu Taconic Biosciences C57BL/6NTac mice Taconic Biosciences NOD SCID Axis Bioservices Software and algorithms Incucyte® S3 Software Sartorius Prism 10 GraphPad Software FlowJo BD Compass for Simple Western ProteinSimple version 6.1 SevenBridges platform version 1.9.1 Seurat package version 4.2.0 Scrublet version 0.2.3 SingleR package version 2.0.0 Experimental model and study participant details Cell lines If not otherwise specified, tumor cell lines were obtained from the American Type Culture Collection (Manassas, US500 VA) and were cultured in recommended media as listed in Table S1 Patient-derived organoids Tumor samples used for the establishment of patient-derived organoids were obtained from patients treated at Niguarda Cancer Center, (Milano, Italy). All patients signed a dedicated informed consent in accordance with guidelines of the ALFAOMEGA Master Observational Trial ( NCT04120935 Table S6 In vivo Mice were group-housed (8–10 mice per cage) under pathogen-free and controlled environmental conditions (21 ± 1.5 C temperature, 55 ± 10% humidity) in an AAALAC accredited facility and handled according to the institutional, governmental and European Union guidelines (Austrian Animal Protection Laws, GV-SOLAS and FELASA guidelines). Animal studies were approved by the internal ethics committee and the local authorities. For establishment of CDX models, 5 × 10 6 7 Foxn1 nu 6 7 Mice were randomly distributed between the treatment and the vehicle control groups once tumors were established. Compounds were suspended in 0.5% Natrosol and administered QD intra-gastral by gavage needle. Tumor volume was determined three times a week using a caliper. The volume of each tumor [in mm 3 final day day1 final day day1 Method details Compounds and reagents BI 894999 and BI 891065 are compounds developed and synthesized by Boehringer Ingelheim. TNF inhibitor Etanercept (Enbrel ) was purchased from Pfizer. Caspase inhibitor Z-VAD-FMK was purchased from Sigma-Aldrich, Cat.no. V116-2MG. Necrostatin-1 was purchased from MedChemExpress, cat.no. HY-15760. Cell proliferation assay and drugs combination studies The effect of BETi, SMACm alone or in combination cell viability was determined using a 96-h CellTiter-Glo2.0 proliferation assay. Cells were seeded in assay plates and placed at 37°C with 5% CO2 for twenty-four hours before treatment. Compounds were added in triplicate in gradients of increasing concentrations, in case of SMACm ranging between 4.5 nM and 10 μM and in case of BETi between 1.4 nM and 3 μM. DMSO served as control. Cell viability was measured by luminescence analysis using luminescence read on Envision plate readers (PerkinElmer). An additional set of colorectal cancer cell lines was assayed with technical duplicates and experimental triplicates. Cell viability was measured by luminescence analysis using luminescence read on Tecan Plate reader. The effects of drug combinations were analyzed using the Bliss Independence Model. 34 For selected cell lines, in vitro Growth inhibition studies in patient-derived organoids The PDOs were established and maintained in the culture as described in full details previously. 49 Protein capillary immunoassay Cell lysates for protein analysis were obtained by lysis of cells in RIPA buffer supplemented with 1x Halt protease and phosphatase inhibitor cocktail (Thermo Fisher Scientific, Cat.no. 78440). Cell lysates were cleared by centrifugation at 16 000 g for 20 min at 4°C. Protein concentration was determined by Bradford assay and samples were diluted to a final concentration of 0.5 mg/mL. Proteins of interest were then analyzed by using an automated quantitative capillary-based immunoassay platform, Jess and WES (ProteinSimple). Capillary immunoassays were carried out using the anti-rabbit detection module according to the manufacturer’s protocol. The following primary antibodies were used: c-IAP1 (dilution 1:50, Cell Signaling, Cat.no. 7065), c-IAP2 (dilution 1:20, Cell Signaling, Cat.no. 3130), anti-XIAP (dilution 1:50, Cell Signaling, Cat.no. 14334) anti-PARP (dilution 1:50, Cell Signaling, Cat.no. 9542), Caspase-3 (dilution 1:50, Cell Signaling, Cat.no. 14220), Cleaved Caspase-3 (dilution 1:25, Cell Signaling, Cat.no. 9664). In cases where multiplex immunoassays were performed, anti-GAPDH antibody (dilution 1:25, Abcam, Cat.no. 8245) was detected with fluorescent secondary antibody (Goat anti-Mouse IgG (H + L) Secondary Antibody [DyLight 650], Novus Cat.no. NBP1-75147C, dilution 1:50). Immunoassays were analyzed using the Compass for SW 6.1.0. Ex vivo For biomarker analysis, BxPC-3 tumors were taken from BomTac:NMRI-Foxn1nu mice, 4 h after the treatment with 0.5% Natrosol, 2mg/kg BI 894999, 50mg/kg BI891065 BI891065 RNA purification Total RNA was extracted from tumors using Qiagen RNeasy Lipid Tissue Kit (cat.74804, Qiagen) per manufacturer’s instructions with on-column DNase digestion. RNA concentration was measured using Quant-iT (cat. Q10213 qRT-PCR Synthesis of cDNA was performed on the Veriti 96 well Fast Thermal Cycler from 1 μg of total RNA using the SuperScript IV VILO Master Mix Kit (cat.11756050, Thermo Fisher) per manufacturer’s instructions. Specifically, 1 μg of total RNA was mixed with 4 μL of SuperScript IV VILO Master Mix, increasing the final reaction volume to 20 μl. The mixture was incubated for 10 min at 25°C, 10 min at 50°C, and 5 min at 85°C. The resulting cDNA diluted to 100 μl and was stored at −20°C. The qRT-PCR assays were performed using the TaqMan Fast Advanced Master Mix (cat.4444556, Applied Biosystems) and off the shelf Taqman assays for the following genes: BIRC2, HEXIM1, TNF, GADPH, RPS18, RPL19 and HPRT1 (cat# Hs01112284, Hs00538918, Hs00174128, Hs02786624, Hs01375212, Hs02338565, Hs02800695 respectively). Each reaction contained 5 μl of 2x TaqMan Fast Advanced Master Mix, 0.5 μl of Taqman assay, 1 μl of diluted cDNA and 3.5 μl of nuclease-free water. Amplifications were carried out in 384-well plates in the QuantStudio 12K Flex PCR instrument. Thermo cycling conditions are as follows: 20 s at 95° for polymerase activation, followed by 40 cycles of 1 s denaturation at 95° and 20 s anneal/extension at 60°. Fluorescence measurements were taken at 60°C of each cycle. Analysis of qPCR data was performed using the double delta Ct method (Thermo Fisher). Library generation Libraries were prepared from the extracted RNA using Quantseq 3′mRNA-Seq Library Prep Kit-FWD (cat. 015, Lexogen) per manufacturer’s instructions using 500ng of RNA per library. Indices from columns 1–9 of the Lexogen i7 6nt Index Plate for Illumina adapters 7049–7096 were used, and 14 cycles of library amplification were performed. Library concentration was quantified using the QuBit 1x dsDNA HS Assay Kit (cat. Q33231 Preparation of single cell suspensions 15 days post treatment start, explanted Pan02 tumors were minced into small ∼1mm 3 Flow cytometry Approximately 1.5 × 106 total cells/tumor were stained for flow cytometry in round-bottom 96-well format. Single cell suspensions were treated with 200 U DNAse I for 10min on room temperature in 1xDPBS (Gibco, 14190-094) containing 5 mM MgCl2 (Sigma, 68475-100ML) prior to staining procedure. For exclusion of dead cells, suspensions were stained with 1:2000 diluted Fixable Blue Dead Cell Stain (Invitrogen, L34962 Figure S4 Table S4 CITE-seq using BD rhapsody For CITE-Seq analysis, single cell libraries were generated using the BD Rhapsody system. Enriched CD45 + Table S4 Sequence alignment was performed by SevenBridges platform 1.9.1 (BD Rhapsody workflow reversion 13). The following steps were performed for the filtering of the single cell dataset: single cell with multiple or no assigned sample barcodes were discarded. Scater and scuttle packages [ https://doi.org/10.1093/bioinformatics/btw777 Quantification and statistical analysis In vitro The effects of drug combinations in the cell line panel were analyzed using the Bliss Independence Model. 34 For statistical analysis of in vitro Statistical analysis of experiments involving patient-derived organoids was performed using One-way ANOVA with Dunnett’s correction for multiple comparisons. In vivo Statistics for the experiments evaluating the efficacy of drugs combination in mice were done using Kruskal-Wallis test with Dunn’s correction for multiple comparisons. Statistical analysis of flow cytometry experiments was performed using one-way ANOVA with Dunnett’s multiple comparisons test. References 1 Jin H. Wang L. Bernards R. Rational combinations of targeted cancer therapies: background, advances and challenges Nat. Rev. Drug Discov. 22 2023 213 234 36509911 10.1038/s41573-022-00615-z 2 Shi J. Vakoc C.R. The Mechanisms behind the Therapeutic Activity of BET Bromodomain Inhibition Mol. Cell 54 2014 728 736 24905006 10.1016/j.molcel.2014.05.016 PMC4236231 3 Guo J. Zheng Q. Peng Y. BET proteins: Biological functions and therapeutic interventions Pharmacol. Ther. 243 2023 108354 10.1016/j.pharmthera.2023.108354 36739915 4 Gajjela B.K. Zhou M.-M. Bromodomain inhibitors and therapeutic applications Curr. Opin. Chem. Biol. 75 2023 102323 10.1016/j.cbpa.2023.102323 PMC10524616 37207401 5 To K.K.W. Xing E. Larue R.C. Li P.-K. BET Bromodomain Inhibitors: Novel Design Strategies and Therapeutic Applications Molecules 28 2023 3043 37049806 10.3390/molecules28073043 PMC10096006 6 Tontsch-Grunt U. Savarese F. Baum A. Scharn D. Gerlach D. Hofmann M.H. Kaya O. Schweifer N. Engelhardt H. Musa H. Effects of the novel BET inhibitor BI 894999 on upregulation of HEXIM1 in cancer cells and on antitumor activity in xenograft tumor models J. Clin. Oncol. 34 2016 11574 7 Gerlach D. Tontsch-Grunt U. Baum A. Popow J. Scharn D. Hofmann M.H. Engelhardt H. Kaya O. Beck J. Schweifer N. The novel BET bromodomain inhibitor BI 894999 represses super-enhancer-associated transcription and synergizes with CDK9 inhibition in AML Oncogene 37 2018 2687 2701 29491412 10.1038/s41388-018-0150-2 PMC5955861 8 Tontsch-Grunt U. Traexler P.E. Baum A. Musa H. Marzin K. Wang S. Trapani F. Engelhardt H. Solca F. Therapeutic impact of BET inhibitor BI 894999 treatment: backtranslation from the clinic Br. J. Cancer 127 2022 577 586 10.1038/s41416-022-01815-5 35444289 PMC9346113 9 Sun Y. Han J. Wang Z. Li X. Sun Y. Hu Z. Safety and Efficacy of Bromodomain and Extra-Terminal Inhibitors for the Treatment of Hematological Malignancies and Solid Tumors: A Systematic Study of Clinical Trials Front. Pharmacol. 11 2020 621093 10.3389/fphar.2020.621093 PMC7870522 33574760 10 Morel D. Jeffery D. Aspeslagh S. Almouzni G. Postel-Vinay S. Combining epigenetic drugs with other therapies for solid tumours — past lessons and future promise Nat. Rev. Clin. Oncol. 17 2020 91 107 31570827 10.1038/s41571-019-0267-4 11 Ramadoss M. Mahadevan V. Targeting the cancer epigenome: synergistic therapy with bromodomain inhibitors Drug Discov. Today 23 2018 76 89 28943305 10.1016/j.drudis.2017.09.011 12 Morrish E. Brumatti G. Silke J. Future Therapeutic Directions for Smac-Mimetics Cells 9 2020 406 32053868 10.3390/cells9020406 PMC7072318 13 Fulda S. Vucic D. Targeting IAP proteins for therapeutic intervention in cancer Nat. Rev. Drug Discov. 11 2012 109 124 22293567 10.1038/nrd3627 14 Silke J. Vucic D. Chapter Two IAP Family of Cell Death and Signaling Regulators Methods Enzymol. 545 2014 35 65 25065885 10.1016/B978-0-12-801430-1.00002-0 15 Fulda S. Smac mimetics as IAP antagonists Semin. Cell Dev. Biol. 39 2015 132 138 25550219 10.1016/j.semcdb.2014.12.005 16 Varfolomeev E. Blankenship J.W. Wayson S.M. Fedorova A.V. Kayagaki N. Garg P. Zobel K. Dynek J.N. Elliott L.O. Wallweber H.J.A. IAP Antagonists Induce Autoubiquitination of c-IAPs, NF-κB Activation, and TNFα-Dependent Apoptosis Cell 131 2007 669 681 18022362 10.1016/j.cell.2007.10.030 17 Vince J.E. Wong W.W.L. Khan N. Feltham R. Chau D. Ahmed A.U. Benetatos C.A. Chunduru S.K. Condon S.M. McKinlay M. IAP Antagonists Target cIAP1 to Induce TNFα-Dependent Apoptosis Cell 131 2007 682 693 18022363 10.1016/j.cell.2007.10.037 18 Oberst A. Dillon C.P. Weinlich R. McCormick L.L. Fitzgerald P. Pop C. Hakem R. Salvesen G.S. Green D.R. Catalytic activity of the caspase-8–FLIPL complex inhibits RIPK3-dependent necrosis Nature 471 2011 363 367 21368763 10.1038/nature09852 PMC3077893 19 Sun L. Wang H. Wang Z. He S. Chen S. Liao D. Wang L. Yan J. Liu W. Lei X. Wang X. Mixed Lineage Kinase Domain-like Protein Mediates Necrosis Signaling Downstream of RIP3 Kinase Cell 148 2012 213 227 22265413 10.1016/j.cell.2011.11.031 20 Cho Y.S. Challa S. Moquin D. Genga R. Ray T.D. Guildford M. Chan F.K.M. Phosphorylation-driven assembly of the RIP1-RIP3 complex regulates programmed necrosis and virus-induced inflammation Cell 137 2009 1112 1123 19524513 10.1016/j.cell.2009.05.037 PMC2727676 21 Brown J.D. Lin C.Y. Duan Q. Griffin G. Federation A. Paranal R.M. Bair S. Newton G. Lichtman A. Kung A. NF-κB Directs Dynamic Super Enhancer Formation in Inflammation and Atherogenesis Mol. Cell 56 2014 219 231 25263595 10.1016/j.molcel.2014.08.024 PMC4224636 22 Huang B. Yang X.-D. Zhou M.-M. Ozato K. Chen L.-F. Brd4 Coactivates Transcriptional Activation of NF-κB via Specific Binding to Acetylated RelA Mol. Cell Biol. 29 2009 1375 1387 19103749 10.1128/MCB.01365-08 PMC2643823 23 Zou Z. Huang B. Wu X. Zhang H. Qi J. Bradner J. Nair S. Chen L.F. Brd4 maintains constitutively active NF-κB in cancer cells by binding to acetylated RelA Oncogene 33 2014 2395 2404 23686307 10.1038/onc.2013.179 PMC3913736 24 Wellinger L.C. Hogg S.J. Newman D.M. Friess T. Geiss D. Michie J. Ramsbottom K.M. Bacac M. Fauti T. Marbach D. BET Inhibition Enhances TNF-Mediated Antitumor Immunity Cancer Immunol. Res. 10 2022 87 107 34782346 10.1158/2326-6066.CIR-21-0224 25 Hajmirza A. Emadali A. Gauthier A. Casasnovas O. Gressin R. Callanan M.B. BET Family Protein BRD4: An Emerging Actor in NFκB Signaling in Inflammation and Cancer Biomedicines 6 2018 16 29415456 10.3390/biomedicines6010016 PMC5874673 26 Klingbeil O. Lesche R. Gelato K.A. Haendler B. Lejeune P. Inhibition of BET bromodomain-dependent XIAP and FLIP expression sensitizes KRAS-mutated NSCLC to pro-apoptotic agents Cell Death Dis. 7 2016 e2365 10.1038/cddis.2016.271 PMC5059870 27607580 27 Cheung H.H. Mahoney D.J. LaCasse E.C. Korneluk R.G. Down-regulation of c-FLIP Enhances Death of Cancer Cells by Smac Mimetic Compound Cancer Res. 69 2009 7729 7738 19773432 10.1158/0008-5472.CAN-09-1794 28 Wyce A. Ganji G. Smitheman K.N. Chung C.W. Korenchuk S. Bai Y. Barbash O. Le B. Craggs P.D. McCabe M.T. BET Inhibition Silences Expression of MYCN and BCL2 and Induces Cytotoxicity in Neuroblastoma Tumor Models PLoS One 8 2013 e72967 10.1371/journal.pone.0072967 PMC3751846 24009722 29 Chen K.-F. Lin J.P. Shiau C.W. Tai W.T. Liu C.Y. Yu H.C. Chen P.J. Cheng A.L. Inhibition of Bcl-2 improves effect of LCL161, a SMAC mimetic, in hepatocellular carcinoma cells Biochem. Pharmacol. 84 2012 268 277 22580047 10.1016/j.bcp.2012.04.023 30 Andrieu G.P. Shafran J.S. Smith C.L. Belkina A.C. Casey A.N. Jafari N. Denis G.V. BET protein targeting suppresses the PD-1/PD-L1 pathway in triple-negative breast cancer and elicits anti-tumor immune response Cancer Lett. 465 2019 45 58 31473251 10.1016/j.canlet.2019.08.013 PMC6901183 31 Wang H. Liu G. Jin X. Song S. Chen S. Zhou P. Li H. Liang J. Li B. Zhang C. He Y. BET inhibitor JQ1 enhances anti-tumor immunity and synergizes with PD-1 blockade in CRC J. Cancer 13 2022 2126 2137 35517410 10.7150/jca.69375 PMC9066214 32 Pinto C. Slavic-Obradovic K. Fürweger D. Thaler B. Souabni A. Carotta S. Aichinger M. Reiser U. Impagnatiello M.A. Tirapu I. Tumor microenvironment mimicking 3D models unveil the multifaceted effects of SMAC mimetics iScience 26 2023 106381 10.1016/j.isci.2023.106381 PMC10064235 37009211 33 Yamamoto K. Tateishi K. Kudo Y. Hoshikawa M. Tanaka M. Nakatsuka T. Fujiwara H. Miyabayashi K. Takahashi R. Tanaka Y. Stromal remodeling by the BET bromodomain inhibitor JQ1 suppresses the progression of human pancreatic cancer Oncotarget 7 2016 61469 61484 27528027 10.18632/oncotarget.11129 PMC5308665 34 Mei M. Impagnatiello M.A. Jiao J. Reiser U. Tontsch-Grunt U. Zhang J. Nicklin P. Yu B. Wang Y. He Y. Tan X. An orally available monovalent SMAC mimetic compound as a broad-spectrum antiviral Protein Cell 15 2024 69 75 10.1093/procel/pwad033 37294910 PMC10762662 35 Zhu H. Bengsch F. Svoronos N. Rutkowski M.R. Bitler B.G. Allegrezza M.J. Yokoyama Y. Kossenkov A.V. Bradner J.E. Conejo-Garcia J.R. Zhang R. BET Bromodomain Inhibition Promotes Anti-tumor Immunity by Suppressing PD-L1 Expression Cell Rep. 16 2016 2829 2837 27626654 10.1016/j.celrep.2016.08.032 PMC5177024 36 Dougan S.K. Dougan M. Regulation of innate and adaptive antitumor immunity by IAP antagonists Immunotherapy 10 2018 787 796 29807457 10.2217/imt-2017-0185 PMC6462841 37 DeNardo D.G. Ruffell B. Macrophages as regulators of tumour immunity and immunotherapy Nat. Rev. Immunol. 19 2019 369 382 30718830 10.1038/s41577-019-0127-6 PMC7339861 38 Agorku D.J. Langhammer A. Heider U. Wild S. Bosio A. Hardt O. CD49b, CD87, and CD95 Are Markers for Activated Cancer-Associated Fibroblasts Whereas CD39 Marks Quiescent Normal Fibroblasts in Murine Tumor Models Front. Oncol. 9 2019 716 31428583 10.3389/fonc.2019.00716 PMC6690267 39 Laufer J.M. Kindinger I. Artinger M. Pauli A. Legler D.F. CCR7 Is Recruited to the Immunological Synapse, Acts as Co-stimulatory Molecule and Drives LFA-1 Clustering for Efficient T Cell Adhesion Through ZAP70 Front. Immunol. 9 2018 3115 30692994 10.3389/fimmu.2018.03115 PMC6339918 40 Croft M. So T. Duan W. Soroosh P. The significance of OX40 and OX40L to T-cell biology and immune disease Immunol. Rev. 229 2009 173 191 19426222 10.1111/j.1600-065X.2009.00766.x PMC2729757 41 Kim A.M.J. Nemeth M.R. Lim S.-O. 4-1BB: A promising target for cancer immunotherapy Front. Oncol. 12 2022 968360 10.3389/fonc.2022.968360 PMC9515902 36185242 42 Melero I. Shuford W.W. Newby S.A. Aruffo A. Ledbetter J.A. Hellström K.E. Mittler R.S. Chen L. Monoclonal antibodies against the 4-1BB T-cell activation molecule eradicate established tumors Nat. Med. 3 1997 682 685 9176498 10.1038/nm0697-682 43 Nagarsheth N. Wicha M.S. Zou W. Chemokines in the cancer microenvironment and their relevance in cancer immunotherapy Nat. Rev. Immunol. 17 2017 559 572 28555670 10.1038/nri.2017.49 PMC5731833 44 Yi M. Li T. Niu M. Mei Q. Zhao B. Chu Q. Dai Z. Wu K. Exploiting innate immunity for cancer immunotherapy Mol. Cancer 22 2023 187 38008741 10.1186/s12943-023-01885-w PMC10680233 45 Qian B.-Z. Li J. Zhang H. Kitamura T. Zhang J. Campion L.R. Kaiser E.A. Snyder L.A. Pollard J.W. CCL2 recruits inflammatory monocytes to facilitate breast-tumour metastasis Nature 475 2011 222 225 21654748 10.1038/nature10138 PMC3208506 46 Ban Y. Mai J. Li X. Mitchell-Flack M. Zhang T. Zhang L. Chouchane L. Ferrari M. Shen H. Ma X. Targeting Autocrine CCL5–CCR5 Axis Reprograms Immunosuppressive Myeloid Cells and Reinvigorates Antitumor Immunity Cancer Res. 77 2017 2857 2868 28416485 10.1158/0008-5472.CAN-16-2913 PMC5484057 47 Hogg S.J. Vervoort S.J. Deswal S. Ott C.J. Li J. Cluse L.A. Beavis P.A. Darcy P.K. Martin B.P. Spencer A. BET-Bromodomain Inhibitors Engage the Host Immune System and Regulate Expression of the Immune Checkpoint Ligand PD-L1 Cell Rep. 18 2017 2162 2174 28249162 10.1016/j.celrep.2017.02.011 PMC5340981 48 Falcinelli S.D. Peterson J.J. Turner A.M.W. Irlbeck D. Read J. Raines S.L. James K.S. Sutton C. Sanchez A. Emery A. Combined noncanonical NF-κB agonism and targeted BET bromodomain inhibition reverse HIV latency ex vivo J. Clin. Investig. 132 2022 e157281 10.1172/JCI157281 PMC9012286 35426377 49 Arena S. Corti G. Durinikova E. Montone M. Reilly N.M. Russo M. Lorenzato A. Arcella P. Lazzari L. Rospo G. A Subset of Colorectal Cancers with Cross-Sensitivity to Olaparib and Oxaliplatin Clin. Cancer Res. 26 2020 1372 1384 31831554 10.1158/1078-0432.CCR-19-2409 50 Corti G. Buzo K. Berrino E. Miotto M. Aquilano M.C. Lentini M. Bellomo S.E. Lorenzato A. Bartolini A. Mauri G. Prediction of homologous recombination deficiency identifies colorectal tumors sensitive to PARP inhibition npj Precis. Oncol. 8 2024 231 39402170 10.1038/s41698-024-00706-7 PMC11473949 51 Durinikova E. Reilly N.M. Buzo K. Mariella E. Chilà R. Lorenzato A. Dias J.M.L. Grasso G. Pisati F. Lamba S. Targeting the DNA Damage Response Pathways and Replication Stress in Colorectal Cancer Clin. Cancer Res. 28 2022 3874 3889 35881546 10.1158/1078-0432.CCR-22-0875 PMC9433963 52 Beug S.T. Tang V.A. LaCasse E.C. Cheung H.H. Beauregard C.E. Brun J. Nuyens J.P. Earl N. St-Jean M. Holbrook J. Smac mimetics and innate immune stimuli synergize to promote tumor death Nat. Biotechnol. 32 2014 182 190 24463573 10.1038/nbt.2806 PMC5030098 53 Tong J. Tan X. Risnik D. Gao M. Song X. Ermine K. Shen L. Wang S. Yu J. Zhang L. BET protein degradation triggers DR5-mediated immunogenic cell death to suppress colorectal cancer and potentiate immune checkpoint blockade Oncogene 40 2021 6566 6578 34615996 10.1038/s41388-021-02041-8 PMC8642302 54 Lalaoui N. Merino D. Giner G. Vaillant F. Chau D. Liu L. Kratina T. Pal B. Whittle J.R. Etemadi N. Targeting triple-negative breast cancers with the Smac-mimetic birinapant Cell Death Differ. 27 2020 2768 2780 32341449 10.1038/s41418-020-0541-0 PMC7492458 55 Kearney C.J. Vervoort S.J. Hogg S.J. Ramsbottom K.M. Freeman A.J. Lalaoui N. Pijpers L. Michie J. Brown K.K. Knight D.A. Tumor immune evasion arises through loss of TNF sensitivity Sci. Immunol. 3 2018 eaar3451 10.1126/sciimmunol.aar3451 29776993 56 Orecchioni M. Ghosheh Y. Pramod A.B. Ley K. Macrophage Polarization: Different Gene Signatures in M1(LPS+) vs. Classically and M2(LPS–) vs. Alternatively Activated Macrophages Front. Immunol. 10 2019 1084 31178859 10.3389/fimmu.2019.01084 PMC6543837 57 Shin H.C. Seo I. Jeong H. Byun S.J. Kim S. Bae S.U. Kwon S.Y. Lee H.W. Prognostic Impact of Tumor-Associated Macrophages on Long-Term Oncologic Outcomes in Colorectal Cancer Life 11 2021 1240 34833118 10.3390/life11111240 PMC8618174 58 Rodriguez P.C. Quiceno D.G. Zabaleta J. Ortiz B. Zea A.H. Piazuelo M.B. Delgado A. Correa P. Brayer J. Sotomayor E.M. Arginase I Production in the Tumor Microenvironment by Mature Myeloid Cells Inhibits T-Cell Receptor Expression and Antigen-Specific T-Cell Responses Cancer Res. 64 2004 5839 5849 15313928 10.1158/0008-5472.CAN-04-0465 59 Menjivar R.E. Nwosu Z.C. Du W. Donahue K.L. Hong H.S. Espinoza C. Brown K. Velez-Delgado A. Yan W. Lima F. Arginase 1 is a key driver of immune suppression in pancreatic cancer eLife 12 2023 e80721 10.7554/eLife.80721 PMC10260021 36727849 60 Kansal V. Kinney B.L.C. Uppada S. Saba N.F. Stokes W.A. Buchwald Z.S. Schmitt N.C. The expanding role of IAP antagonists for the treatment of head and neck cancer Cancer Med. 12 2023 13958 13965 37132167 10.1002/cam4.6011 PMC10358233 61 Zhang M. Wang G. Ma Z. Xiong G. Wang W. Huang Z. Wan Y. Xu X. Hoyle R.G. Yi C. BET inhibition triggers antitumor immunity by enhancing MHC class I expression in head and neck squamous cell carcinoma Mol. Ther. 30 2022 3394 3413 35923111 10.1016/j.ymthe.2022.07.022 PMC9637808 Supplemental information  Document S1. Figures S1–S5 Table S1. Cell lines Table S2. IC50 synergy scores Table S3. RNA-seq BxPC-3 in vivo Table S4. Flow and AbSeq antibodies Table S5. DEGs from CITE-seq analysis Table S6. PDO information Document S2. Article plus supplemental information Supplemental information can be found online at https://doi.org/10.1016/j.xcrm.2025.102313 ",
  "metadata": {
    "Title of this paper": "BET inhibition triggers antitumor immunity by enhancing MHC class I expression in head and neck squamous cell carcinoma",
    "Journal it was published in:": "Cell Reports Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490239/"
  }
}