{
  "title": "Paper_897",
  "abstract": "pmc Discov Oncol Discov Oncol 4139 discon Discover Oncology 2730-6011 Springer PMC12474803 PMC12474803.1 12474803 12474803 41003874 10.1007/s12672-025-03575-z 3575 1 Brief Report Amyloid precursor protein accumulation in glioblastoma is associated with altered synaptic dynamics and immune suppression https://orcid.org/0009-0003-1413-2100 Porter Tyrel R. 122tporter@uccaribe.edu 1 Inyushin Mikhail 2 Kucheryavykh Lilia 1 1 https://ror.org/01rpmzy83 grid.253922.d 0000 0000 9699 6324 Department of Biochemistry, Universidad Central del Caribe, 2 https://ror.org/01rpmzy83 grid.253922.d 0000 0000 9699 6324 Department of Physiology, Universidad Central del Caribe, 26 9 2025 12 2025 16 478248 1730 3 2 2025 2 9 2025 26 09 2025 28 09 2025 28 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Increased amyloid precursor protein (APP), including both mRNA and protein expression, has been linked to glioblastoma (GBM) yet the physiological effects are poorly understood. In this study, we investigated the relationship between APP protein abundance and mRNA expression in GBM. Gene set enrichment analysis revealed significant positive enrichment of neuron projection and synaptic junction gene sets from Gene Ontology. Additionally, several immune-related processes were negatively enriched, suggesting a broad immune suppression associated with increased presence of APP. These findings suggest a multi-faceted role of APP, linking its presence to modulation of synaptic activity as well as the immune microenvironment in GBM tumors. Supplementary Information The online version contains supplementary material available at 10.1007/s12672-025-03575-z. Key points  APP expression in glioblastoma is significantly associated with the upregulation of several gene sets found within neuron projection and synaptic junction. Enrichment of monoatomic channel complexes and synaptic components in glioblastoma highlights potential involvement of APP in modulating tumor progression through increased neuronal excitability. Gene set enrichment analysis reveals a strong correlation between APP protein abundance and the suppression of immune-related processes, including both innate and adaptive immune responses. Supplementary Information The online version contains supplementary material available at 10.1007/s12672-025-03575-z. https://doi.org/10.13039/100000002 National Institutes of Health 1R15CA287203 1R16GM153522 Kucheryavykh Lilia pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Science+Business Media LLC, part of Springer Nature 2025 Introduction GBM is a highly aggressive brain tumor characterized by invasive growth and resistance to treatment, resulting in poor patient outcomes. Previously, amyloid beta (Aβ) accumulation within GBM tumors was identified, with deposits found in both tumor cells and the extracellular matrix [ 1 2 3 4 Methods The relationship between APP protein expression in GBM and mRNA expression in tumor samples was first investigated by gene set enrichment analysis (GSEA) of Gene Ontology gene sets. mRNA expression and protein abundance data from GBM tissue samples were obtained via cBioPortal for Cancer Genomics (CPTAC, Cell 2021) from datasets originally published by Wang et al. ( Cancer Cell 5 8 8 Correlations between mRNA expression and APP protein abundance ratios were subsequently calculated using Spearman’s rank correlation coefficient across 99 GBM samples and 29,455 genes. Following these calculations, GSEA (v4.3.3) was then performed using a preranked gene list based on Spearman correlation coefficients. Targeted analysis focused on Gene Ontology gene sets accessed from MSigDB (2024.1) [ 9 11 Network-based visualizations using enriched gene sets were generated using Cytoscape (v3.10.3) with the Enrichment Map plugin (v3.5.0) [ 12 13 Results GSEA of Gene Ontology Cellular Component (GOCC) gene sets yielded 494 usable gene sets following size-based filtering. Applying significance thresholds, 133 gene sets were identified as significantly enriched, of which 106 showed negative and 27 showed positive NES. To refine the network visualization and focus on the most robust associations, we applied an additional stringency filter of nominal p-value < 0.005 prior to enrichment map visualization. The enrichment map revealed several distinct network components, a strongly enriched group containing neuron projection gene sets (GO:0043005) was observed, including dendrite membrane (NES = 2.11; 28 of 40 genes in leading edge), neuron projection membrane (NES = 2.02; 37 of 60), and neuron spine (NES = 1.63; 69 of 174) Fig. 1  Fig. 1 Network containing enrichment of neuronal and immune-related gene sets in glioblastoma, according to APP protein abundance as defined by normalized enrichment scores (NES) (FDR < 0.05, NES > ± 1.6). (a) Enrichment analysis, rendering an enrichment map which reveals overlaps of enriched pathways as a network, of cellular component gene sets demonstrates positive correlations between APP protein abundance and neuron projection and synaptic junction-related processes, and ion channel complexes. (b) Enrichment map including both Cellular Component and Biological Process gene sets, highlighting negative correlations between APP abundance and the suppression of immune-related processes. (c) Dot plot summarizing NES appearing in enrichment maps for Neuron Projection and Synaptic Junction in addition to Immune Response, which include significantly enriched and suppressed gene sets, respectively Given that the majority of significantly enriched GOCC gene sets exhibited negative NES, we performed a complementary enrichment analysis to further investigate the biological processes associated with negatively correlated gene expression patterns to more comprehensively characterize these negatively associated gene expression patterns. Including Gene Ontology Biological Processes (GOBP) in addition to GOCC categories and initially identified 171 gene sets that met initial significance criteria (nominal p-value < 0.05, FDR < 0.05). Considering the addition of more gene sets, a more rigorous statistical threshold (nominal p-value < 0.001, FDR < 0.001) was implemented prior to gene set enrichment network analysis. This approach was intended to minimize false positives and highlight only the most robust and biologically meaningful associations among downregulated pathways. The resulting enrichment map revealed a distinct cluster of negatively enriched immune response gene sets, suggesting that APP expression in GBM is linked to suppression of immune activity. More specifically, the resulting enrichment map revealed a negatively enriched cluster of immune response gene sets (GO:0006955), including B cell-mediated immunity (NES = -2.77; 111 of 188 genes in leading edge), leukocyte-mediated immunity (NES = -2.61; 228 of 450), lymphocyte mediated immunity (NES = -2.60; 182 of 353), and complement activation (NES = -2.42; 34 of 64) [Fig. 1 Discussion Neuronal remodeling and tumor invasion Our results showed transcriptional increases in neuron projection, synaptic junction, particularly within ion channels. Interestingly, increased synaptic activity and neuronal remodeling has been linked with GBM progression, as well as higher mortality [ 14 15 16 With this in mind, transient axonal glycoprotein-1, a known APP ligand, has been shown to induce apoptosis-associated gene expression in glioma cells without triggering apoptosis, instead promoting proliferation [ 17 Immunosuppressive microenvironment In addition to altered synaptic dynamics, our results show APP appears to play a key role in modulating the immunosuppressive microenvironment in GBM. Previous studies have shown that APP and its cleaved products, such as Aβ, regulate immune responses, particularly affecting macrophages by reducing TNFα and IL-6 secretion and increasing IL-10, promoting an anti-inflammatory state [ 18 2 19 These results raise some interesting questions, considering one study linked APP to the upregulation of pro-inflammatory markers, specifically IL-1β, COX-2, and cPLA2 in GBM [ 2 20 18 Limitations While our findings demonstrate significant associations between APP protein abundance and coordinated transcriptional changes in GBM, several limitations should be noted. First, this study is based on correlation analyses, which cannot establish causal relationships. Although GSEA provides robust pathway-level enrichment, functional studies using APP knockdown or overexpression in GBM models are needed to confirm its mechanistic role in modulating synaptic and immune processes. Furthermore, the transcriptomic and proteomic data analyzed were derived from bulk tumor tissue, which includes a mixture of tumor cells, neurons, glia, and immune cells. As such, observed associations with APP may partly reflect expression patterns in surrounding stromal or neural cells. Future studies using single-cell or spatial transcriptomic approaches would allow for more precise resolution of cell-type-specific expression and signaling. Lastly, while our pathway-level analysis identified coherent enrichment patterns, further investigation into individual genes within leading edge subsets may help clarify which specific genes are most strongly associated with APP expression and whether they have functional roles in GBM progression or immune modulation and subsequent effects on clinical outcomes. Conclusion This study identified significant correlations between APP protein abundance and gene expression patterns associated with both increased neuronal excitability and suppression of immune-related pathways in GBM. These findings suggest that APP may serve as a molecular bridge between neuronal remodeling and immune evasion, processes that are increasingly recognized as key drivers of glioma progression. While our results do not directly demonstrate functional consequences such as tumor proliferation or invasion, the observed upregulation of synaptic and ion channel-related genes, alongside downregulation of immune signaling pathways, raises the possibility that APP contributes to a tumor-supportive microenvironment through neuro-immune interactions. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1  Supplementary Material 2  Supplementary Material 3  Supplementary Material 4 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Author contributions T.R.P.: Conceptualization, Methodology, Formal analysis, Data Curation, Writing - Original Draft, Writing - Review & Editing. M.I.: Writing – Writing - Review & EditingL.K.: Supervision, Writing - Review & Editing, Funding acquisition. Funding This study was supported by NIH Grants 1R15CA287203 and 1R16GM153522. Data availability Data used in this publication were generated by the National Cancer Institute Clinical Proteomic Tumor Analysis Consortium (CPTAC) and accessed via cBioPortal for Cancer Genomics (https://www.cbioportal.org/study/summary? id=gbm_cptac_2021). The datasets analyzed in this study were originally published in: Wang LB, Karpova A, Gritsenko MA, et al. Proteogenomic and metabolomic characterization of human glioblastoma. *Cancer Cell* . 2021;39(4):509-528.e20. doi:10.1016/j.ccell.2021.01.006. Declarations Ethics approval and consent to participate This study utilized publicly available, de-identified transcriptomic and clinical data. As such, approval from an IRB was not required. Consent for publication Not applicable. Research involving human or animal participants This study did not involve direct experimentation on humans or animals. Competing interests The authors declare no competing interests. References 1. Zayas-Santiago A Díaz-García A Nuñez-Rodríguez R Inyushin M Accumulation of amyloid beta in human glioblastomas Clin Exp Immunol 2020 202 3 325 34 10.1111/cei.13493 32654112 PMC7670151 Zayas-Santiago A, Díaz-García A, Nuñez-Rodríguez R, Inyushin M. Accumulation of amyloid beta in human glioblastomas. Clin Exp Immunol. 2020;202(3):325–34. 10.1111/cei.13493. 32654112 10.1111/cei.13493 PMC7670151 2. Culicchia F Cui JG Li YY Lukiw WJ Upregulation of β-amyloid precursor protein expression in glioblastoma multiforme NeuroReport 2008 19 9 981 10.1097/WNR.0b013e328302f139 18521005 Culicchia F, Cui JG, Li YY, Lukiw WJ. Upregulation of β-amyloid precursor protein expression in glioblastoma multiforme. NeuroReport. 2008;19(9):981. 10.1097/WNR.0b013e328302f139. 18521005 10.1097/WNR.0b013e328302f139 3. Greutter L Miller-Michlits Y Klotz S Frequent alzheimer’s disease neuropathological change in patients with glioblastoma Neurooncol Adv 2024 6 1 vdae118 10.1093/noajnl/vdae118 39220249 PMC11362848 Greutter L, Miller-Michlits Y, Klotz S, et al. Frequent alzheimer’s disease neuropathological change in patients with glioblastoma. Neurooncol Adv. 2024;6(1):vdae118. 10.1093/noajnl/vdae118. 39220249 10.1093/noajnl/vdae118 PMC11362848 4. Lim S Yoo BK Kim HS Amyloid-β precursor protein promotes cell proliferation and motility of advanced breast cancer BMC Cancer 2014 14 928 10.1186/1471-2407-14-928 25491510 PMC4295427 Lim S, Yoo BK, Kim HS, et al. Amyloid-β precursor protein promotes cell proliferation and motility of advanced breast cancer. BMC Cancer. 2014;14:928. 10.1186/1471-2407-14-928. 25491510 10.1186/1471-2407-14-928 PMC4295427 5. Cerami E Gao J Dogrusoz U The cBio cancer genomics portal: an open platform for exploring multidimensional cancer genomics data Cancer Discov 2012 2 5 401 4 10.1158/2159-8290.CD-12-0095 22588877 PMC3956037 Cerami E, Gao J, Dogrusoz U, et al. The cBio cancer genomics portal: an open platform for exploring multidimensional cancer genomics data. Cancer Discov. 2012;2(5):401–4. 10.1158/2159-8290.CD-12-0095. 22588877 10.1158/2159-8290.CD-12-0095 PMC3956037 6. Gao J Aksoy BA Dogrusoz U Integrative analysis of complex cancer genomics and clinical profiles using the cBioPortal Sci Signal 2013 6 269 pl1 10.1126/scisignal.2004088 23550210 PMC4160307 Gao J, Aksoy BA, Dogrusoz U, et al. Integrative analysis of complex cancer genomics and clinical profiles using the cBioPortal. Sci Signal. 2013;6(269):pl1. 10.1126/scisignal.2004088. 23550210 10.1126/scisignal.2004088 PMC4160307 7. de Bruijn I Kundra R Mastrogiacomo B Analysis and visualization of longitudinal genomic and clinical data from the AACR project GENIE biopharma collaborative in cBioPortal Cancer Res 2023 83 23 3861 7 10.1158/0008-5472.CAN-23-0816 37668528 PMC10690089 de Bruijn I, Kundra R, Mastrogiacomo B, et al. Analysis and visualization of longitudinal genomic and clinical data from the AACR project GENIE biopharma collaborative in cBioPortal. Cancer Res. 2023;83(23):3861–7. 10.1158/0008-5472.CAN-23-0816. 37668528 10.1158/0008-5472.CAN-23-0816 PMC10690089 8. Wang LB Karpova A Gritsenko MA Proteogenomic and metabolomic characterization of human glioblastoma Cancer Cell 2021 39 4 509 e52820 10.1016/j.ccell.2021.01.006 33577785 PMC8044053 Wang LB, Karpova A, Gritsenko MA, et al. Proteogenomic and metabolomic characterization of human glioblastoma. Cancer Cell. 2021;39(4):509–e52820. 10.1016/j.ccell.2021.01.006. 33577785 10.1016/j.ccell.2021.01.006 PMC8044053 9. Subramanian A Tamayo P Mootha VK Gene set enrichment analysis: a knowledge-based approach for interpreting genome-wide expression profiles Proc Natl Acad Sci U S A 2005 102 43 15545 50 10.1073/pnas.0506580102 16199517 PMC1239896 Subramanian A, Tamayo P, Mootha VK, et al. Gene set enrichment analysis: a knowledge-based approach for interpreting genome-wide expression profiles. Proc Natl Acad Sci U S A. 2005;102(43):15545–50. 10.1073/pnas.0506580102. 16199517 10.1073/pnas.0506580102 PMC1239896 10. Ashburner M Ball CA Blake JA Gene ontology: tool for the unification of biology Nat Genet 2000 25 1 25 9 10.1038/75556 10802651 PMC3037419 Ashburner M, Ball CA, Blake JA, et al. Gene ontology: tool for the unification of biology. Nat Genet. 2000;25(1):25–9. 10.1038/75556. 10802651 10.1038/75556 PMC3037419 11. Gene Ontology Consortium Aleksander SA Balhoff J The gene ontology knowledgebase in 2023 Genetics 2023 224 1 iyad031 10.1093/genetics/iyad031 36866529 PMC10158837 Gene Ontology Consortium, Aleksander SA, Balhoff J, et al. The gene ontology knowledgebase in 2023. Genetics. 2023;224(1):iyad031. 10.1093/genetics/iyad031. 36866529 10.1093/genetics/iyad031 PMC10158837 12. Shannon P Markiel A Ozier O Cytoscape: a software environment for integrated models of biomolecular interaction networks Genome Res 2003 13 11 2498 504 10.1101/gr.1239303 14597658 PMC403769 Shannon P, Markiel A, Ozier O, et al. Cytoscape: a software environment for integrated models of biomolecular interaction networks. Genome Res. 2003;13(11):2498–504. 10.1101/gr.1239303. 14597658 10.1101/gr.1239303 PMC403769 13. Merico D Isserlin R Stueker O Emili A Bader GD Enrichment map: a network-based method for gene-set enrichment visualization and interpretation PLoS ONE 2010 5 11 e13984 10.1371/journal.pone.0013984 21085593 PMC2981572 Merico D, Isserlin R, Stueker O, Emili A, Bader GD. Enrichment map: a network-based method for gene-set enrichment visualization and interpretation. PLoS ONE. 2010;5(11):e13984. 10.1371/journal.pone.0013984. 21085593 10.1371/journal.pone.0013984 PMC2981572 14. Taylor KR Barron T Hui A Glioma synapses recruit mechanisms of adaptive plasticity Nature 2023 623 7986 366 74 10.1038/s41586-023-06678-1 37914930 PMC10632140 Taylor KR, Barron T, Hui A, et al. Glioma synapses recruit mechanisms of adaptive plasticity. Nature. 2023;623(7986):366–74. 10.1038/s41586-023-06678-1. 37914930 10.1038/s41586-023-06678-1 PMC10632140 15. Krishna S Choudhury A Keough MB Glioblastoma remodelling of human neural circuits decreases survival Nature 2023 617 7961 599 607 10.1038/s41586-023-06036-1 37138086 PMC10191851 Krishna S, Choudhury A, Keough MB, et al. Glioblastoma remodelling of human neural circuits decreases survival. Nature. 2023;617(7961):599–607. 10.1038/s41586-023-06036-1. 37138086 10.1038/s41586-023-06036-1 PMC10191851 16. Venkatesh HS Morishita W Geraghty AC Electrical and synaptic integration of glioma into neural circuits Nature 2019 573 7775 539 45 10.1038/s41586-019-1563-y 31534222 PMC7038898 Venkatesh HS, Morishita W, Geraghty AC, et al. Electrical and synaptic integration of glioma into neural circuits. Nature. 2019;573(7775):539–45. 10.1038/s41586-019-1563-y. 31534222 10.1038/s41586-019-1563-y PMC7038898 17. Chang H Song S Chen Z Transient axonal glycoprotein-1 induces apoptosis-related gene expression without triggering apoptosis in U251 glioma cells Neural Regen Res 2014 9 5 519 25 10.4103/1673-5374.130079 25206849 PMC4153508 Chang H, Song S, Chen Z, et al. Transient axonal glycoprotein-1 induces apoptosis-related gene expression without triggering apoptosis in U251 glioma cells. Neural Regen Res. 2014;9(5):519–25. 10.4103/1673-5374.130079. 25206849 10.4103/1673-5374.130079 PMC4153508 18. Spitzer P Walter M Göth C Pharmacological Inhibition of amyloidogenic APP processing and Knock-Down of APP in primary human macrophages impairs the secretion of cytokines Front Immunol 2020 11 1967 10.3389/fimmu.2020.01967 33013850 PMC7494750 Spitzer P, Walter M, Göth C, et al. Pharmacological Inhibition of amyloidogenic APP processing and Knock-Down of APP in primary human macrophages impairs the secretion of cytokines. Front Immunol. 2020;11:1967. 10.3389/fimmu.2020.01967. 33013850 10.3389/fimmu.2020.01967 PMC7494750 19. Kleffman K Levinson G Rose IVL Melanoma-Secreted amyloid beta suppresses neuroinflammation and promotes brain metastasis Cancer Discov 2022 12 5 1314 35 10.1158/2159-8290.CD-21-1006 35262173 PMC9069488 Kleffman K, Levinson G, Rose IVL, et al. Melanoma-Secreted amyloid beta suppresses neuroinflammation and promotes brain metastasis. Cancer Discov. 2022;12(5):1314–35. 10.1158/2159-8290.CD-21-1006. 35262173 10.1158/2159-8290.CD-21-1006 PMC9069488 20. Kiss M Vande Walle L Saavedra PHV IL1β promotes immune suppression in the tumor microenvironment independent of the inflammasome and gasdermin D Cancer Immunol Res 2021 9 3 309 23 10.1158/2326-6066.CIR-20-0431 33361087 Kiss M, Vande Walle L, Saavedra PHV, et al. IL1β promotes immune suppression in the tumor microenvironment independent of the inflammasome and gasdermin D. Cancer Immunol Res. 2021;9(3):309–23. 10.1158/2326-6066.CIR-20-0431. 33361087 10.1158/2326-6066.CIR-20-0431 ",
  "metadata": {
    "Title of this paper": "IL1β promotes immune suppression in the tumor microenvironment independent of the inflammasome and gasdermin D",
    "Journal it was published in:": "Discover Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474803/"
  }
}