{
  "title": "Paper_517",
  "abstract": "pmc Endocr Metab Immune Disord Drug Targets Endocr Metab Immune Disord Drug Targets 585 benthamopen EMIDDT Endocrine, Metabolic & Immune Disorders Drug Targets 1871-5303 2212-3873 pmc-is-collection-domain yes pmc-collection-title Bentham Open Access PMC12481567 PMC12481567.1 12481567 12481567 39810445 10.2174/0118715303325979241206115417 EMIDDT-25-7-527 1 Pharmacology, Medicine, Endocrinology, Immunology, Inflammation & Allergy, Biochemistry and Molecular Biology The Polygenic Nature of Multiple Sclerosis: Genetic Variants, Immunological Modulation, and Environmental Connections Khan Zuber 1 Mehan Sidharth 1 * Maurya Pankaj Kumar 1 Kumar Aakash 1 Das Gupta Ghanshyam 2 Narula Acharan S. 3 Kalfin Reni 4 5 1 Punjab 144603 India 2 Department of Pharmaceutics, ISF College of Pharmacy, Moga, Punjab, India Affiliated to IK Gujral Punjab Technical University, Jalandhar Punjab 144603 India 3 Narula Research, LLC 107 Boulder Bluff Chapel Hill NC 27516 USA 4 Institute of Neurobiology, Bulgarian Academy of Sciences, Acad. G. Bonchev St. Block 23 Bulgaria 5 Department of Healthcare South-West University “NeofitRilski” Ivan Mihailov St. 66 Blagoevgrad , 2700 Bulgaria * sidharthmehan@isfcp.org 31 12 2024 2025 25 7 497984 527 559 21 6 2024 02 10 2024 16 10 2024 30 09 2025 01 10 2025 01 10 2025 © 2025 The Author(s). Published by Bentham Science Publisher. 2025 The Author(s) https://creativecommons.org/licenses/by/4.0/ © 2025 The Author(s). Published by Bentham Science Publishers. This is an open access article published under CC BY 4.0 https://creativecommons.org/licenses/by/4.0/legalcode Multiple Sclerosis (MS), a debilitating inflammatory disorder of the central nervous system characterized by demyelination, is significantly influenced by polygenic variations. Although the precise cause of MS remains unclear, it is believed to arise from a complex interplay of genetic and environmental factors. Recent investigations have focused on the polygenic nature of genetic alterations linked to MS risk. This review highlights the critical role of these genetic variants in shaping disease susceptibility and progression. Specific Human Leukocyte Antigen (HLA) alleles, such as HLA-DRB1*15:01, HLA-DRB50*101, HLA-DR2+, HLA-DQ6, DQA 0102, and DQB1 0602, are implicated in immune modulation, significantly increasing the risk of developing MS. Additionally, Genome-wide Association Studies (GWAS) have identified non-HLA genetic variants that contribute to MS susceptibility, including IL-2RA (rs2104286), IL-7R (rs6897932), CD40 (rs1883832 T), CD58 (rs2300747), and others, each playing a role in immune regulation and disease progression. Dysfunctions in genes regulating myelin integrity, such as MOG (Myelin Oligodendrocyte Glycoprotein), MAG (Myelin-associated Glycoprotein), and PLP1 (Proteolipid Protein 1), further drive MS pathogenesis. Moreover, viral infections, notably Epstein-Barr Virus (EBV), Human Herpesvirus 6 (HHV-6), and measles virus, may exacerbate the development of MS by triggering immune responses. Understanding the contribution of these genetic and viral factors may shed light on the complex etiology of MS. Polygenic Risk Scores (PRS) provide a valuable tool for estimating MS susceptibility based on the cumulative effect of genetic variants. However, translating these genetic insights into clinical practice requires further validation, including environmental considerations. Investigating MS polygenicity could lead to personalized therapies, enhancing diagnosis, prognosis, and treatment, ultimately improving outcomes for MS patients. Keywords Multiple sclerosis genetic variants genome-wide association study demyelination polygenic risk score diagnosis (Core Research Grant) (grant number: CRG/2021/001009). This work was supported by the Department of Science and Technology, Science and Engineering Board, DST-SERB, CRG (Core Research Grant) (grant number: CRG/2021/001009). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 INTRODUCTION Multiple Sclerosis (MS) is classified as an autoimmune disorder predominantly impacting the Central Nervous System (CNS), which includes the brain and spinal cord [ 1 2 3 et al. 4 5 6 7 et al. 1 8 9 The concept of a polygenic nature pertains to the involvement of multiple genes in the development and progression of a disease. MS is widely recognized as a polygenic disorder, indicating that it arises from the collective influence of numerous gene variants, known as polymorphic genes, rather than a single gene [ 10 11 11 14 14 15 Although no definitive genetic factor responsible for MS has been established, substantial evidence supports the notion of inherited susceptibility to the disease [ 16 17 18 19 et al. 20 et al. 21 et al. et al. 22 23 Additionally, approximately 15% of patients report a family member suffering from the illness. A genomic cluster of genes within the HLA region on chromosome 6 correlates with increased susceptibility to MS. This susceptibility is associated with the presence of specific genetic markers, including HLA-DR2 positivity, the DQA 0102 and DQB1 0602 alleles, and the HLA-DRB1, DR15, DRB1*1501, and DRB1*1503 genes [ 24 28 29 A recent study in the United States revealed a definitive correlation between the risk allele rs10191329 of the DYSF-ZNF638 locus and a shorter median duration before individuals who are homozygous carriers require walking assistance. This variant is also associated with more severe brainstem and cortical pathology in brain tissue. Significant genetic enrichment in CNS tissues also identified a potential association between rs149097173 in the DNM3-PIGC gene and this phenomenon [ 30 31 32 It is hypothesized that environmental exposure and a genetic predisposition contribute to MS development, showing variability among individuals [ 33 et al. et al. 34 35 36 37 However, the exact correlation between these viral infections and MS is under investigation. There is evidence of a correlation between tobacco smoking and an increased susceptibility to MS, as well as a worsening in the disease's progression and severity [ 38 40 41 43 Mazdeh et al. 44 et al. 45 46 2 GENETIC VARIANTS AND IMMUNE SYSTEM DYSREGULATION IN MS 2.1 Role of HLA region and HLA-DRB1*15:01 Allele Although the HLA gene exerts a substantial hereditary influence on susceptibility to MS, the precise mechanisms by which it affects an individual’s likelihood of developing the disease remain uncertain. Researchers have investigated the relationship between MS and other autoimmune disorders using GWAS and serological typing techniques [ 27 47 The HLA region, the Major Histocompatibility Complex (MHC), is located on chromosome 6p21 and spans a genomic area of 7.6 megabases. The scrutinized genomic region comprises 252 loci currently undergoing transcription, with a significant proportion associated with genes involved in immune response mechanisms [ 48 27 48 HLA class II molecules are glycoproteins that form heterodimers on the cellular membrane. Their molecular structure comprises two distinct chains, α and β, encoded within the class II area of the MHC [ 49 50 + 51 52 53 48 GWASs have linked 233 frequently occurring genetic variations to MS; 32 are located inside the HLA area and 201 outside of it [ 54 et al. 55 56 The HLA-DRB1*15:01 allele is hypothesized to influence MS development significantly through its modulation of immune system functioning. The exact mechanisms of this allele's effects are not fully understood; however, a hypothesis suggests that it might alter the presentation of specific antigens to immune cells. Consequently, an atypical immune response against self-antigens could occur, leading to inflammation and subsequent Central Nervous System (CNS) damage [ 48 57 59 Waubant et al. 60 61 63 64 66 1 2.2 Genes Involved in Immune Response, Inflammation, and Myelin regulation 2.2.1 Immune Response and Inflammation Regulating Genes 2.2.1.1 IL-2RA (Interleukin-2 Receptor Alpha) Gene involvement plays a vital role in various biological processes, including immune response, inflammation, and myelin remodeling [ 67 68 69 69 Buhelt et al. + 70 + 71 et al., 72 et al. et al. 68 73 33 2.2.1.2 IL-7R T2441 Polymorphism and MS The Interleukin 7 Receptor (IL7R), classified as a type-I cytokine receptor, is characterized by alpha and gamma chains. This receptor is present in a significant proportion of activated adult T cells, thymocytes, and immature B cells up to the pre-B stage [ 74 et al. 75 76 11 26 77 79 80 SNP rs6897932, a genetic variant of IL-7R, has been extensively investigated. Its association with increased MS susceptibility has been established across several populations [ 81 82 83 84 The rs6897932 genetic variant is an SNP, indicating a single base pair substitution in the DNA sequence. This modification could affect the IL-7R protein's structure or functionality, influencing T-cell proliferation and viability and potentially increasing disease susceptibility [ 28 79 85 2.2.1.3 TNFRSF1A (Tumor Necrosis Factor Receptor Superfamily Member 1A) The gene TNFRSF1A encodes the protein known as TNF Receptor type 1 (TNFR1). This cell surface receptor binds to TNF, a cytokine implicated in the pathogenesis of numerous inflammatory disorders [ 86 87 88 89 91 et al., 86 In addition to TNFRSF1A variations in TRAPS, scholarly studies have explored the association between these variants and various inflammatory illnesses, including MS [ 90 88 91 et al. 91 11 87 92 87 92 89 93 Based on the above data, it can be inferred that there is a lack of comprehensive understanding regarding the specific processes through which genetic variations contribute to MS. The interplay among genetic determinants, environmental triggers, and immune dysregulation in MS is complex and multidimensional. Further investigation is warranted to ascertain the specific involvement of TNFRSF1A mutations in the susceptibility and progression of MS. 2.2.2 Myelin Regulation 2.2.2.1 The MOG (Myelin Oligodendrocyte Glycoprotein) Gene MOG, an Immunoglobulin (Ig) specific to the CNS, is localized exclusively on the outer surface of myelin sheaths and oligodendrocyte membranes. Eliseeva et al. et al. 94 95 96 95 Multiple studies have established a correlation between specific MOG gene variations and increased susceptibility to MS [ 97 98 99 98 60 100 101 2.2.2.2 MAG (Myelin-associated Glycoprotein) Gene Dysregulated MAG expression has been documented in MS lesions. MAG is crucial for preserving and reinforcing myelin, the protective sheath for nerve fibers in the CNS [ 102 103 104 A decrease in MAG levels is observed in MS lesions, particularly in demyelinated areas. This downregulation may adversely affect myelin maintenance and repair mechanisms [ 102 105 et al. 106 2.2.2.3 PLP1 (Proteolipid Protein 1) Gene PLP1 is a critical structural protein component in myelin, comprising approximately 50% of the protein content in CNS myelin. Notably, the amino acid sequence of PLP1 is perfectly conserved across human, mouse, and rat species, underscoring its vital role in myelin function. This observation is significant, especially considering that complete gene deletions have been linked to the least severe disease manifestations [ 107 et al. 108 109 Interestingly, there is an overlap in the genetic risk factors for PMD and specific MS forms. While PMD and MS are distinct, studies have shown that mutations in the PLP1 gene can influence susceptibility to both conditions [ 110 108 110 The exact mechanism by which these mutations lead to clinical conditions remains unclear. However, in PMD animal models, PLP1 gene mutations cause oligodendrocyte death [ 108 111 112 108 113 114 115 116 3 NON-HLA GENETIC VARIANTS AND MS RISK 3.1 Overview of Non-HLA Susceptibility Loci Identified Through GWAS GWASs have been instrumental in identifying non-HLA genetic variations associated with MS risk. The HLA genes, crucial for immune system functionality, have a well-recognized link to MS susceptibility [ 117 11 3.1.1 CD40 (Cluster of Differentiation 40) The CD40 gene, called cluster of differentiation 40, is crucial in immunological signaling, particularly in activating B cells responsible for antibody production and immune regulation [ 118 et al. 119 120 et al. 121 CD40 is primarily expressed on B cell membranes, interacting with its ligand, CD40L, on activated T cells. This interaction is essential for initiating B cell activation and antibody synthesis. The CD40-CD40L signaling pathway modulates immune responses, activating other immune cells and releasing pro-inflammatory mediators [ 118 120 122 123 et al. 118 In conclusion, there is a significant link between genetic diversity in CD40 and MS progression. Further research is necessary to understand how CD40 genetic variations influence MS susceptibility, B cell function, and immune responses during the disease. Insights into CD40's role in MS etiology could lead to novel therapeutic strategies targeting immune response modulation and disease progression inhibition. 3.1.2 CD58 (Cluster of Differentiation 58) CD58, often called cluster of differentiation 58 or Lymphocyte Function-associated Antigen 3 (LFA-3), is a critical genetic element in the immune response, enhancing intercellular connections among immune cells. The 2021 study by Zhang et al. 124 124 126 127 128 et al. et al. 129 130 et al. 125 et al. 131 Hecker et al.'s 132 124 et al. 124 133 Previous research has linked CD58 variations to other autoimmune disorders, including Rheumatoid Arthritis (RA) and Systemic Lupus Erythematosus (SLE), suggesting common genetic determinants and immunological dysregulation across these diseases [ 134 et al. 125 2 3.1.3 CLEC16A (C-type Lectin Domain Family 16, Member A) The gene CLEC16A, also known as 'C-type lectin domain family 16 member A', plays a significant role in the modulation and functioning of immune cells [ 135 136 135 137 A research study conducted in Norway demonstrated a significant association between the CLEC16A Single Nucleotide Polymorphism (SNP) rs12708716 and MS. Further investigation revealed a robust correlation between the rs12708716 genotype and the relative expression of two distinct CLEC16A transcripts in the thymus, but not in blood. This finding suggests the presence of thymus-specific or cell-specific splicing regulation [ 138 139 et al., 140 137 140 The dysregulation of autophagy has been implicated in certain autoimmune diseases, including MS [ 141 80 134 3.1.4 IRF8 (Interferon Regulatory Factor 8) A study conducted by Salem et al. 142 143 144 145 The expression and function of IRF8 can be influenced by these genetic variations, potentially resulting in immunological dysregulation and increased susceptibility to neuroinflammatory disorders, such as MS [ 146 147 143 146 148 149 Furthermore, previous studies have established a correlation between IRF8 and the activation and control of microglia, immune cells in the CNS crucial for neuroinflammation and immunological reactions within the brain and spinal cord [ 150 151 27 152 3.2 Genes Associated with T-cell Activation, B-cell Function, and Immune Cell Migration 3.2.1 CXCR5 (C-X-C Motif Chemokine Receptor 5) The chemokine receptor CXCR5, expressed on B cells and T follicular helper (Tfh) cells, facilitates migration to lymphoid organs. This migration is crucial for the interaction between B cells and Tfh cells, which leads to antibody production and the initiation of immunological responses. Previous studies have established a link between CXCR5 variants and susceptibility to MS [ 153 154 et al. 155 In MS, CXCR5 plays a vital role in developing and maintaining immune cell aggregates within lymphoid tissues, such as lymph nodes and the spleen. These aggregates, known as germinal centers, are sites where B cells undergo activation, proliferation, and differentiation into plasma cells that produce antibodies [ 156 157 158 158 159 3.2.2 CCR5 (C-C Chemokine Receptor Type 5) The CCR5 receptor, a chemokine receptor, facilitates the migration of immune cells, particularly T lymphocytes, to sites of inflammation [ 160 160 161 162 163 et al. 164 Furthermore, the CCR5 gene plays a role in modulating chemokine-mediated immune cell motility. It interacts with chemokines, such as CCL3, CCL4, and CCL5, implicated in inflammation and immune responses [ 165 166 167 The genetic variations, including the CCR5-Δ32 deletion variant, have been linked to the modified expression and functionality of CCR5. According to Ellwanger et al., 164 168 169 Additional research is essential for a comprehensive understanding of the impact of CCR5 genetic variations on MS susceptibility and their influence on immune cell trafficking and inflammation. Understanding the role of the CCR5 gene and examining the dynamics of cytokine-cytokine and cytokine-neurotransmitter interactions is crucial. The CCR5 mutation shows potential as a prognostic indicator and could inform the development of therapeutic strategies for individuals with MS. 3.2.3 CTLA4 (Cytotoxic T-Lymphocyte-Associated Protein 4) CTLA4 (Cytotoxic T-lymphocyte-associated protein 4) is a co-inhibitory receptor on activated T cells. It regulates T-cell activation and immune responses, with abnormalities in CTLA4 signaling potentially leading to immune dysregulation in MS [ 170 171 The association between CTLA4 gene variations and increased MS susceptibility has been established. CTLA4 signaling or expression failures may contribute to MS's immunological dysregulation [ 172 173 174 175 These examples illustrate genes associated with T-cell activation, B-cell activity, and immune cell migration in MS. Each gene plays a role in various immune responses. Their complex interactions influence MS development. Further investigation is needed to fully understand how these genes contribute to MS pathophysiology and explore their potential as therapeutic targets (Fig. 3 3.2.4 TNFAIP3 Gene Tumor Necrosis Factor Alpha-induced Protein 3 (TNFAIP3), commonly known as A20, plays a crucial role in the regulatory mechanisms of the NF-κB signaling pathway, acting as a key component in its negative feedback control [ 176 177 in vitro 178 3.2.5 CD226 Gene Regarding the CD226 gene, the presence of a nonsynonymous mutation, Gly307Ser (rs763361), has been correlated with various autoimmune diseases, including MS. This finding supports the arguments of Gross et al. 179 180 et al. 180 et al. 181 183 181 182 183 184 3.2.6 TYK2 Gene In the TYK2 gene, the association of an SNP, rs34536443, which results in the substitution of proline for alanine at amino acid 1104, has been established through GWAS. This mutation offers protection against various autoimmune diseases, including SLE and MS [ 184 et al. 185 et al. 186 TYK2, a member of the Janus Kinase (JAK) family of tyrosine kinases, has been identified as a potential candidate gene associated with autoimmune illnesses, particularly those with hereditary factors. This association is attributed to TYK2's role in mediating cytokine signaling pathways, including those of Interferon type I (IFN-I) [ 187 188 187 189 Autoimmune illnesses frequently correlate with abnormal production of IFN-I, other cytokines, or members of the JAK kinase family by immune cells [ 187 190 191 191 192 3.2.7 SLAMF1 (Signaling Lymphocytic Activation Molecule Family Member 1) SLAMF1 (Signaling Lymphocytic Activation Molecule Family member 1) has also been studied for its genetic polymorphisms. Investigations into the SLAMF1 gene locus have revealed the minimal functional impact of the rs11265455 polymorphism's minor and major variants on the SLAMF1 promoter. However, the minor variant of the rs3753381 polymorphism in enhancer E has demonstrated a more than twofold increase in SLAMF1 promoter activity [ 192 193 et al. 192 et al. 194 1 4 195 197 4 POLYGENIC RISK SCORES (PRS) AND PREDICTION MODELS IN MS 4.1 PRS and their Calculation PRS are statistical methods that use an individual's genetic profile to forecast their hereditary susceptibility to a particular trait or ailment. The ability of genetic variants to predict disease susceptibility, aid in risk stratification, and facilitate personalized medicine has garnered significant attention in both genetic research and clinical applications [ 198 76 4.1.1 Calculation of PRS 4.1.1.1 Selection of GWAS Summary Statistics PRS are commonly obtained through extensive GWAS, wherein many SNPs distributed throughout the genome are examined for their correlation with the specific characteristic or disease under investigation [ 25 199 4.1.1.2 Selection of the SNP Set and Effect Sizes The selection of SNPs for inclusion in the PRS computation is based on a subset derived from the GWAS summary statistics. SNPs are commonly chosen following a predetermined threshold of significance, such as a p-value, or by considering patterns of LD [ 199 200 4.1.1.3 Weighting of SNPs The impact sizes of the chosen SNPs are subsequently assigned weights based on their level of correlation with the specific trait or condition. The determination of weighting can be derived from several factors, such as the magnitude of the effect size, the significance level, or other pertinent metrics [ 201 202 203 4.1.1.4 Calculation of PRS The calculation of the PRS involves the summation of weighted effect sizes for selected SNPs across all SNPs considered for an individual. The formula utilized for the computation of PRS is as follows: PRS = Σ (weighted effect size * genotype) + intercept In this context, “genotype” refers to an individual's count of risk alleles (0, 1, or 2) for each SNP. At the same time, the “intercept” denotes an optional constant value incorporated into the score [ 199 4.2 Utility of PRS in Assessing Individual MS Risk The utilization of PRS has been identified as a viable approach for assessing an individual's susceptibility to developing various diseases during their lifespan. This methodology has been particularly effective in evaluating the likelihood of obtaining MS based on an individual's genetic composition. The PRS is a method that considers the collective impact of many genetic variations associated with MS and provides a measure of an individual's genetic susceptibility to the disease [ 204 4.2.1 Predictive Power The field of behavioral sciences has witnessed significant growth in the study of polygenic scores over the past decade [ 205 et al. 206 206 207 208 33 The accuracy of polygenic score predictions depends on the Genotype-Environment (GE) relationship and population stratification. Over four decades, numerous quantitative genetic studies have examined the interplay between genetics and environmental factors. These studies have consistently revealed that a significant portion, approximately 25%, of the environmental measurements commonly used in behavioral sciences exhibit heritability [ 209 212 213 209 205 4.2.2 Early Identification The timely detection of individuals with an increased susceptibility to developing MS is paramount for adopting effective preventative strategies and enhancing condition management. Polygenic Risk Scores (PRS) have proven effective in the early detection of MS by evaluating an individual's genetic makeup and predicting their disease susceptibility, even before observable clinical symptoms manifest [ 214 et al. 208 Utilizing information about an individual's increased genetic susceptibility, healthcare professionals can implement preventative strategies and lifestyle adjustments, potentially delaying or mitigating MS occurrence [ 215 33 et al. 216 et al. 217 Research has shown that DMTs can slow MS progression and decrease relapse occurrence in affected individuals. Early treatment initiation, guided by heightened genetic susceptibility, can improve therapeutic outcomes and potentially reduce long-term impairment [ 218 et al. 219 220 et al. 221 223 In summary, utilizing PRS in the context of MS promises substantial impacts on disease management and patient outcomes. Using genetic data to identify high-risk individuals early enables prompt interventions, personalized monitoring, and optimized treatment strategies. However, it is essential to remember that PRS is just one aspect of risk assessment. A comprehensive understanding of an individual's total MS risk requires clinical examinations and other relevant factors alongside PRS. 4.2.3 Risk Stratification PRS have been demonstrated to be a significant and valuable tool for categorizing individuals based on their genetic predisposition to MS [ 203 206 223 et al. 199 The application of PRS for risk stratification can influence the frequency and severity of clinical follow-up procedures. As Qassim et al. 224 et al. 207 207 225 In summary, PRS facilitates categorizing individuals into various MS risk levels. This stratification process allows for resource and intervention allocation based on priority, including increased clinical follow-ups, lifestyle modifications, and early implementation of disease-modifying medications. Risk stratification through PRS can enhance patient outcomes and optimize MS management by tailoring interventions to an individual's genetic predisposition. 4.2.4 Population Screening In the context of population screening, the term 'systematic identification' refers to identifying individuals within a specific group who may be highly susceptible to a particular ailment or disease [ 226 204 226 204 207 Given these findings, conducting further clinical assessments and considering additional variables are essential before making conclusive statements about an individual's well-being. Integrating Patient-reported Outcomes (PROs) into population screening programs for illnesses, like MS, offers a more focused and streamlined approach to identifying individuals with elevated risk profiles. Leveraging genetic information can lead to more efficient distribution of healthcare resources, potentially resulting in earlier interventions and improved health outcomes for those in greatest need. 4.2.5 Clinical Trial Design According to Slunecka et al., 208 227 The utilization of PROs in the design of clinical trials contributes to the advancement of targeted therapeutic interventions. By identifying individuals with heightened genetic susceptibility to MS, researchers can investigate medications targeting genetic factors associated with the disease [ 228 et al. 229 204 PRS is also beneficial in estimating sample sizes for clinical trials, as discussed by Bader et al. 230 226 204 4.2.6 Counselling and Patient Education PROs significantly impact genetic counseling and patient education, particularly concerning diseases, like MS [ 225 193 231 Alfredsson and Olsson suggested that individuals at an elevated risk of acquiring MS can receive guidance regarding environmental and lifestyle factors that could impact the progression of the disease. They may receive advice on cultivating positive behaviors, such as adhering to a well-rounded dietary regimen, engaging in regular physical activity, effectively managing stress levels, and abstaining from recognized risk factors, like smoking [ 33 231 232 207 233 60 et al., 224 4.2.7 Precision Medicine The application of precision medicine in the context of MS holds the potential to enhance treatment efficacy. An understanding of the biochemical foundations underlying the diverse range of neurological symptoms and variations in disease severity observed in individuals with MS is now in its nascent stages. Categorizing diseases into subgroups based on their biological attributes, rather than solely relying on clinical characteristics, can elucidate disease progression and therapy effectiveness within the field of precision medicine. Several biomarkers associated with therapeutic response are now being developed, and the field of MS treatment has already seen the licensing of over 18 disease-modifying medications [ 234 Precision medicine is advanced by using PRS, which tailors therapies and treatments to an individual's genetic risk profile [ 235 236 208 et al. 207 235 Proactive risk management is enhanced by implementing the Person-Environment Fit (PEF) model. This model identifies individuals who may benefit from timely interventions or preventive actions. For example, individuals with a higher PRS for cardiovascular diseases can receive advice on lifestyle modifications. These include adopting a nutritious diet, increasing physical activity, and reducing stress. Such counseling mitigates their genetic predisposition and comprehensively improves their cardiovascular health [ 237 Moreover, integrating genetic counseling and informed consent within the precision medicine framework is crucial [ 204 238 In summary, PRS significantly contributes to advancing precision medicine. It guides tailored treatment strategies, enhances disease management, facilitates risk stratification, informs clinical trial design, and enables proactive risk management. Precision medicine aims to improve patient outcomes and optimize healthcare interventions' efficacy by incorporating genetic risk information. While PRS is not a definitive diagnostic tool, it is an additional risk assessment instrument, integrating genetic data. Environmental and non-genetic factors significantly influence the development of MS. Consequently, it is essential to interpret PRS alongside clinical assessments and other relevant risk factors to thoroughly understand an individual's overall susceptibility to MS. 4.3 Association of PRS with Phenotypes in Neuroimaging The present investigation involved the examination of calibrated volumetric measures of different brain regions, encompassing the entire brain, white matter, peripheral grey matter, CSF, as well as three subdivisions within the deep grey matter (namely, the thalamus, caudate, and putamen). The study centered around a sample of 467 individuals from the UCSF-EPIC cohort, who were subject to annual follow-ups over 10 years. The parameters above were examined as prospective indicators of disease development in MS (Table 2 207 239 5 CHALLENGES AND FUTURE DIRECTIONS 5.1 Identifying Causal Variants and Understanding their Functional Implications A key challenge is understanding the functional consequences of identified variations. When a likely causal mutation is identified, researchers must ascertain its effects on gene expression, protein function, and other molecular mechanisms involved in MS pathogenesis. This requires integrating both experimental and computational approaches [ 240 et al. 241 242 The potential for identifying causative variations in MS is expected to strengthen with advancements in genomic technologies. These include improved sequencing techniques and the inclusion of diverse populations in larger-scale research studies [ 243 et al. 244 245 Understanding the functional consequences of causal variations could facilitate the development of personalized therapeutic approaches for individuals with MS. Clinicians could personalize medications by identifying distinct genetic variations associated with therapy response or disease development. This approach improves effectiveness while reducing adverse effects. In a broader context, identifying causal variations and understanding their functional consequences are critical milestones in unraveling the complex mechanisms underlying MS. Ongoing research in this field can deepen our understanding of the disease and also aid in developing more targeted and individualized therapeutic interventions for those diagnosed with MS. 5.2 Investigating Gene-Gene and Gene-Environment Interactions in MS Susceptibility Gene-gene interactions, known as epistasis, relate to how one gene influences a particular trait or condition depending on the presence or absence of another gene [ 246 11 247 248 11 75 249 Another established genetic relationship involves the increased epistasis susceptibility among the HLA-DRB1, HLA-DQA1, and HLA-DQB1 loci. Lincoln et al.'s 52 250 Gene-environment interactions refer to the complex interplay between genetic and environmental factors in determining disease susceptibility. Several environmental factors, such as low vitamin D levels, smoking, Epstein-Barr virus infection, and limited sunlight exposure, have been associated with a higher risk of developing MS [ 60 et al. et al. 251 252 253 254 5.2.1 Integrating Genetic Data with Other Omics Approaches for a Comprehensive Understanding of MS Etiology Integrating genetic data with other omics methods offers a more thorough understanding of MS mechanisms and etiology. Genetic investigations have identified numerous variations linked to an increased susceptibility to MS. Patsopoulos noted that GWAS and other genetic sequencing methodologies are commonly used to detect these variations. By analyzing genetic data from MS patients and comparing it to data from healthy individuals, researchers can identify specific genetic variations prevalent in those diagnosed with MS [ 11 255 256 Transcriptomics, an essential omics technique, analyzes gene expression patterns across tissues or cell types [ 257 258 Epigenomics, another omics method, studies changes in DNA and histones that can affect gene expression while preserving the DNA sequence [ 259 et al. 260 261 262 263 In summary, integrating genetic data with transcriptomics, epigenomics, proteomics, metabolomics, and microbiomics can enhance our understanding of MS etiology. This approach allows for examining the interactions among genetic factors, gene expression, epigenetic modifications, protein compositions, metabolite concentrations, and the microbiome, aiming to deepen our understanding of the mechanisms driving MS development and progression. 6 TRANSLATING GENETIC FINDINGS INTO CLINICAL PRACTICE 6.1 Implications of Genetic Findings in MS Diagnosis and Prognosis The genetic findings in MS have significant implications for diagnosing and predicting the disease's progression. MS, a complex condition influenced by genetic and environmental factors, has been linked to certain genetic abnormalities that increase susceptibility to MS [ 11 117 247 6.1.1 Differential Diagnosis MS shares clinical characteristics with other neurological illnesses with respect to differential diagnosis, thus complicating accurate diagnosis, especially in the early stages [ 264 11 265 266 267 268 Therefore, genetic findings, particularly those related to MS, can reinforce its diagnosis and distinguish it from other neurological conditions with similar symptoms. Specific genetic variants, like those in the HLA gene region, provide significant evidence for differential diagnosis. However, considering clinical manifestations and diagnostic criteria, a comprehensive assessment is necessary for an accurate MS diagnosis. 6.1.2 Prognostic Markers Regarding prognostic markers, certain genetic variations serve as indicators, shedding light on MS progression and severity. Paul et al. 269 270 271 6.1.3 Personalized Treatment Approaches Genetic discoveries offer critical insights for devising personalized treatment strategies for MS. Pardo and Jones identified a correlation between genetic variations and differential responses to distinct Disease-modifying Therapies (DMTs) [ 272 273 274 215 Personalization must be viewed as a dynamic interaction among persons with MS, their health care professionals, and the wider clinical system supporting them. Individuals with MS have the potential to embrace personalized therapy, as people with MS are frequent smartphone users and see smartphones as helpful and convenient in general [ 275 274 6.1.4 Research and Drug Development Genomic studies in MS research can significantly enhance the accuracy and specificity of identifying fundamental mechanisms underlying the disease's development and progression. Patsopoulos noted that these findings greatly augment our understanding of the molecular mechanisms and processes involved in MS development and progression [ 11 et al., 276 60 6.2 Multidisciplinary Approach for Integrating Genetics into Clinical Care Incorporating genetics into clinical practice is a fundamental component of contemporary medicine. It enables healthcare practitioners to deliver customized and precise interventions informed by an individual's genetic composition [ 233 6.2.1 Geneticists and Genomic Specialists or Counselors Geneticists and experts in genomics play a pivotal role in genetic testing, interpretation, and counseling of genetic information. According to Malgorzata et al., 277 6.2.2 Genetic Counselors Genetic counselors are highly skilled professionals who guide and support individuals and families in understanding the genetic aspects of their health-related issues. They offer comprehensive assistance throughout the genetic testing process, interpreting test outcomes and providing information about various medical treatments' potential risks and benefits. Genetic counselors or other healthcare professionals collect personal and familial health histories to ascertain potential genetic disorders. Based on this information, they help decide the appropriateness of genetic testing for individuals or their relatives [ 278 6.2.3 Clinicians (Physicians and Nurse Practitioners) Integrating genetic information into the entire patient care plan requires clinical expertise. Healthcare providers must understand genetic test results comprehensively, interpret their significance accurately, and make informed decisions about treatment options, as emphasized by Malgorzata et al. 277 6.2.4 Bioinformaticians and Data Analysts Bioinformatics researchers conduct scientific investigations with extensive molecular datasets, including DNA, microarrays, and proteomics data. The substantial volume of data generated by genetic testing underscores the pivotal role of bioinformaticians and data analysts in processing and analyzing genomic data. Hassan et al. 279 280 6.2.5 Pharmacists Pharmacists play a crucial role in interdisciplinary teams due to the potential impact of genetics on medication responses and metabolic processes. Crews et al. 281 282 283 6.2.6 Psychosocial and Behavioral Specialists Disclosing genetic information can have significant psychological and emotional ramifications for patients and their families. Oliveri et al. 284 285 286 The receipt of genetic testing results can elicit a wide range of emotional and psychological responses. Oliveri et al. 284 285 287 288 Incorporating psychosocial and behavioural specialists in genetic testing is crucial for comprehensive care that addresses the broader implications of genetic information for individuals' physical and emotional well-being and their family relationships. Healthcare professionals' expertise and practical knowledge can help individuals manage the psychological aspects of genetic testing outcomes. This support can foster resilience and enable informed healthcare decisions. 6.2.7 Health Information Technology (IT) Experts The complexity of genetic data necessitates secure storage, maintenance, and integration within the Electronic Health Record (EHR) system. Ayatollahi et al. 289 Health information technology professionals are essential in managing and securely integrating genetic data within the EHR system. The complexity of this data, which includes sensitive information about hereditary traits, potential health risks, and various genomic attributes, requires utmost caution in its storage, management, and integration to ensure accessibility, accuracy, and security [ 289 290 CONCLUSION The present investigation has examined the polygenic characteristics of genetic variations and their potential consequences for the risk of MS. In recent years, notable progress has been made in studying genetic factors associated with MS susceptibility. Accumulating evidence suggests that a complex interplay of various genetic variants influences the development of this debilitating neurological disorder. Each of these variants exerts minor individual effects, but collectively, they contribute to the overall risk. Findings from GWAS and meta-analyses have revealed a broad range of genetic loci associated with MS susceptibility. Each locus influences the disease's initiation, progression, and severity. The presence of these genetic variants, which include genes related to immune regulation, inflammation, and Central Nervous System (CNS) functions, highlights the intricate nature of MS and its complex pathophysiology. Moreover, this analysis has emphasized the importance of integrating environmental factors with genetic susceptibility to better understand the overall risk profile associated with MS. The complexity of MS is further underscored by the potential influence of gene-environment interactions in predicting an individual's susceptibility to the disease. The challenge of risk prediction using solely genetic information remains due to the limited impact of individual genetic differences, as indicated by their modest effect sizes. However, recent advancements in PRS, combined with clinical and environmental information, hold significant potential for enhancing risk evaluation and the implementation of personalized approaches to disease management. This review has also highlighted the need for further research to elucidate the functional implications of the identified genetic variants associated with MS. Understanding the molecular mechanisms underlying these associations could pave the way for targeted therapeutic interventions and innovative treatment modalities, ultimately improving the quality of life for individuals affected by MS. ACKNOWLEDGEMENTS Declared none. AUTHORS’ CONTRIBUTIONS The authors confirm their contribution to the paper as follows: study conception and design: S.M., G.D.G.; writing of the paper: Z.K.; data collection: P.K.M., R.K.; data analysis or interpretation: A.K., A.S.N. All authors have reviewed the results and approved the final version of the manuscript. LIST OF ABBREVIATIONS APC Antigen-presenting Cells CCR5 C-C Chemokine Receptor type 5 CD Crohn’s Disease CD4 Cluster of Differentiation CHOP C/enhancer Binding Protein Homologous Protein CLEC116A C-type Lectin Domain Family CTLA-4 Cytotoxic T Lymphocyte-associated Protein-4 CXCR5 C-X-C Motif Chemokine Receptor 5 DMT Disease-modifying Therapy DYSF-ZNF Dysferlin Zinc Finger Protein 638 EBV Epstein-Barr Virus EHR Electronic Health Record eQTLs Expression Quantitative Trait Loci EA Educational Attainment ER Endoplasmic Reticulum GE Genotype-Environment GLI1 Glioma-Associated Oncogene Homologue 1 GWAS Genome Wide-Association Study HHV-6 Human-Herpes Virus 6 HLA Human leucocyte Antigen HLA-DRB1 HLA class II Histocompatibility-related Beta Chain IFN Interferon Ig Immunoglobulin IL-2 Interleukin-2 IL-7R Interleukin-7 Receptor IRF8 Interferon Regulator Factor 8 JAK Janus Kinase LD Linkage Disequilibrium LFA-3 Lymphocyte Function-associated Antigen MAG Myelin-associated Glycoprotein MBP Myelin Basic Protein MHC Major Histocompatibility Complex MOG Myelin Oligodendrocyte Glycoprotein MS Multiple Sclerosis NF-κB Nuclear Factor Kappa β NK Natural Killer Cells OCB Oligoclonal Bands PEF Person-environment Fit PLP1 Proteolipid Protein-1 PRS Polygenic Risk Score RA Rheumatoid Arthritis SLE Systemic Lupus Erythematosus SNP Single Nucleotide Polymorphism STAT Signal Transducer and Activator of Transcription SUFU Suppression of Fused Homolog Tfh Follicular Helper T Cells TNF Tumor Necrosis Factor TNFRSF1A TNF Superfamily 1 A TRAP TNF receptor-associated Periodic Syndrome Tregs Regulatory T Cells TYK2 Tyrosine Kinase 2 Protein UC Ulcerative Colitis UPR Unfolded Protein Response US United States CONSENT FOR PUBLICATION Not applicable. FUNDING This work was supported by the Department of Science and Technology, Science and Engineering Board, DST-SERB, CRG (Core Research Grant) (grant number: CRG/2021/001009). CONFLICT OF INTEREST The authors declare no conflict of interest, financial or otherwise. REFERENCES 1 Khan Z. Gupta G.D. Mehan S. Cellular and molecular evidence of multiple sclerosis diagnosis and treatment challenges. J. Clin. Med. 2023 12 13 4274 10.3390/jcm12134274 37445309 PMC10342392 2 Prajapati A. Mehan S. Khan Z. The role of Smo-Shh/Gli signaling activation in the prevention of neurological and ageing disorders. Biogerontology 2023 24 4 493 531 10.1007/s10522-023-10034-1 37097427 3 Singh A. Upadhayay S. Mehan S. Inhibition of c-JNK/p38MAPK signaling pathway by Apigenin prevents neurobehavioral and neurochemical defects in ethidium bromide-induced experimental model of multiple sclerosis in rats: Evidence from CSF, blood plasma and brain samples. Phytomed. Plus 2021 1 4 100139 10.1016/j.phyplu.2021.100139 4 Khan Z. Mehan S. Gupta G.D. Narula A.S. Immune system dysregulation in the progression of multiple sclerosis: Molecular insights and therapeutic implications. Neuroscience 2024 548 9 26 10.1016/j.neuroscience.2024.04.004 38692349 5 Thompson A.J. Banwell B.L. Barkhof F. Carroll W.M. Coetzee T. Comi G. Correale J. Fazekas F. Filippi M. Freedman M.S. Fujihara K. Galetta S.L. Hartung H.P. Kappos L. Lublin F.D. Marrie R.A. Miller A.E. Miller D.H. Montalban X. Mowry E.M. Sorensen P.S. Tintoré M. Traboulsee A.L. Trojano M. Uitdehaag B.M.J. Vukusic S. Waubant E. Weinshenker B.G. Reingold S.C. Cohen J.A. Diagnosis of multiple sclerosis: 2017 revisions of the McDonald criteria. Lancet Neurol. 2018 17 2 162 173 10.1016/S1474-4422(17)30470-2 29275977 6 Ghasemi N. Razavi S. Nikzad E. Multiple sclerosis: Pathogenesis, symptoms, diagnoses and cell-based therapy. Cell J. 2017 19 1 1 10 28367411 10.22074/cellj.2016.4867 PMC5241505 7 Uher R. Zwicker A. Etiology in psychiatry: embracing the reality of poly-gene-environmental causation of mental illness. World Psychiatry 2017 16 2 121 129 10.1002/wps.20436 28498595 PMC5428165 8 Yamout B. Al-Jumah M. Sahraian M.A. Almalik Y. Khaburi J.A. Shalaby N. Aljarallah S. Bohlega S. Dahdaleh M. Almahdawi A. Khoury S.J. Koussa S. Slassi E. Daoudi S. Aref H. Mrabet S. Zeineddine M. Zakaria M. Inshasi J. Gouider R. Alroughani R. Consensus recommendations for diagnosis and treatment of Multiple Sclerosis: 2023 revision of the MENACTRIMS guidelines. Mult. Scler. Relat. Disord. 2024 83 105435 10.1016/j.msard.2024.105435 38245998 9 Dimitrov L.G. Turner B. What’s new in multiple sclerosis? Br. J. Gen. Pract. 2014 64 629 612 613 10.3399/bjgp14X682609 25452512 PMC4240117 10 Lvovs D. Favorova O.O. Favorov A.V. A polygenic approach to the study of polygenic diseases. Acta Nat. (Engl. Ed.) 2012 4 3 59 71 10.32607/20758251-2012-4-3-59-71 23150804 PMC3491892 11 Patsopoulos N.A. Genetics of multiple sclerosis: An overview and new directions. Cold Spring Harb. Perspect. Med. 2018 8 7 a028951 10.1101/cshperspect.a028951 29440325 PMC6027932 12 Jakimovski D. Bittner S. Zivadinov R. Morrow S.A. Benedict R.H.B. Zipp F. Weinstock-Guttman B. Multiple sclerosis. Lancet 2024 403 10422 183 202 10.1016/S0140-6736(23)01473-3 37949093 13 Upadhayay S. Mehan S. Prajapati A. Sethi P. Suri M. Zawawi A. Almashjary M.N. Tabrez S. Nrf2/HO-1 Signaling Stimulation through Acetyl-11-Keto-Beta-Boswellic Acid (AKBA) Provides Neuroprotection in Ethidium Bromide-Induced Experimental Model of Multiple Sclerosis. Genes (Basel) 2022 13 8 1324 10.3390/genes13081324 35893061 PMC9331916 14 Singh A. Upadhayay S. Mehan S. Understanding abnormal c-JNK/p38MAPK signaling overactivation involved in the progression of multiple sclerosis: Possible therapeutic targets and impact on neurodegenerative diseases. Neurotox. Res. 2021 39 5 1630 1650 10.1007/s12640-021-00401-6 34432262 15 Uffelmann E. Genome-wide association studies. Nat. Rev. Methods Primers 2021 1 59 10.1038/s43586-021-00056-9 16 Podbielska M. Banik N. Kurowska E. Hogan E. Myelin recovery in multiple sclerosis: The challenge of remyelination. Brain Sci. 2013 3 3 1282 1324 10.3390/brainsci3031282 24961530 PMC4061877 17 Kumar N. Sharma N. Khera R. Gupta R. Mehan S. Guggulsterone ameliorates ethidium bromide-induced experimental model of multiple sclerosis via Metab. Brain Dis. 2021 36 5 911 925 10.1007/s11011-021-00691-x 33635478 18 Song J. Westerlind H. McKay K.A. Almqvist C. Stridh P. Kockum I. Hillert J. Manouchehrinia A. Familial risk of early- and late-onset multiple sclerosis: A Swedish nationwide study. J. Neurol. 2019 266 2 481 486 10.1007/s00415-018-9163-6 30578428 PMC6373346 19 Sharma N. Shandilya A. Kumar N. Mehan S. Dysregulation of SIRT-1 signaling in multiple sclerosis and neuroimmune disorders: A systematic review of SIRTUIN activators as potential immunomodulators and their influences on other dysfunctions. Endocr. Metab. Immune Disord. Drug Targets 2021 21 10 1845 1868 10.2174/1871530321666210309112234 33687904 20 Sawcer S. Franklin R.J.M. Ban M. Multiple sclerosis genetics. Lancet Neurol. 2014 13 7 700 709 10.1016/S1474-4422(14)70041-9 24852507 21 Lee E. Kim J.H. Choi H. Kang H. Lim H. Kim J. Cho S.J. Nam E. Park H. Kim N. Kwon M. Comparison of the concordance of allergic diseases between monozygotic and dizygotic twins: A cross-sectional study using KoGES HTS data. J. Pers. Med. 2023 13 5 721 10.3390/jpm13050721 37240891 PMC10220535 22 Sharma N. Upadhayay S. Shandilya A. Sahu R. Singh A. Rajkhowa B. Mehan S. Neuroprotection by solanesol against ethidium bromide-induced multiple sclerosis-like neurobehavioral, molecular, and neurochemical alterations in experimental rats. Phytomed. Plus 2021 1 4 100051 10.1016/j.phyplu.2021.100051 23 Goris A. Vandebergh M. McCauley J.L. Saarela J. Cotsapas C. Genetics of multiple sclerosis: lessons from polygenicity. Lancet Neurol. 2022 21 9 830 842 10.1016/S1474-4422(22)00255-1 35963264 24 Lin X. Deng F.Y. Lu X. Lei S.F. Susceptibility genes for multiple sclerosis identified in a gene-based genome-wide association study. J. Clin. Neurol. 2015 11 4 311 318 10.3988/jcn.2015.11.4.311 26320842 PMC4596110 25 Hollenbach J.A. Oksenberg J.R. The immunogenetics of multiple sclerosis: A comprehensive review. J. Autoimmun. 2015 64 1 13 25 10.1016/j.jaut.2015.06.010 26142251 PMC4687745 26 Majdinasab N. Hosseini Behbahani M. Galehdari H. Mohaghegh M. Association of interleukin 7 receptor gene polymorphism rs6897932 with multiple sclerosis patients in Khuzestan. Iran. J. Neurol. 2014 13 3 168 171 25422737 PMC4240935 27 Crux N.B. Elahi S. Human Leukocyte Antigen (HLA) and Immune Regulation: How Do Classical and Non-Classical HLA Alleles Modulate Immune Response to Human Immunodeficiency Virus and Hepatitis C Virus Infections? Front. Immunol. 2017 8 832 10.3389/fimmu.2017.00832 28769934 PMC5513977 28 Kaushansky N. Altmann D.M. David C.S. Lassmann H. Ben-Nun A. DQB1*0602 rather than DRB1*1501 confers susceptibility to multiple sclerosis-like disease induced by proteolipid protein (PLP). J. Neuroinflammation 2012 9 1 29 10.1186/1742-2094-9-29 22316121 PMC3344688 29 Maghbooli Z. Sahraian M.A. Multiple sclerosis and human leukocyte antigen genotypes: Focus on the Middle East and North Africa region. Mult Scler J Exp Transl Clin. 2020 6 1 2055217319881775 31976083 10.1177/2055217319881775 PMC6956601 30 Harroud A. Stridh P. McCauley J.L. Saarela J. van den Bosch A.M.R. Engelenburg H.J. Beecham A.H. Alfredsson L. Alikhani K. Amezcua L. Andlauer T.F.M. Ban M. Barcellos L.F. Barizzone N. Berge T. Berthele A. Bittner S. Bos S.D. Briggs F.B.S. Caillier S.J. Calabresi P.A. Caputo D. Carmona-Burgos D.X. Cavalla P. Celius E.G. Cerono G. Chinea A.R. Chitnis T. Clarelli F. Comabella M. Comi G. Cotsapas C. Cree B.C.A. D’Alfonso S. Dardiotis E. De Jager P.L. Delgado S.R. Dubois B. Engel S. Esposito F. Fabis-Pedrini M.J. Filippi M. Fitzgerald K.C. Gasperi C. Gomez L. Gomez R. Hadjigeorgiou G. Hamann J. Held F. Henry R.G. Hillert J. Huang J. Huitinga I. Islam T. Isobe N. Jagodic M. Kermode A.G. Khalil M. Kilpatrick T.J. Konidari I. Kreft K.L. Lechner-Scott J. Leone M. Luessi F. Malhotra S. Manouchehrinia A. Manrique C.P. Martinelli-Boneschi F. Martinez A.C. Martinez-Maldonado V. Mascia E. Metz L.M. Midaglia L. Montalban X. Oksenberg J.R. Olsson T. Oturai A. Pääkkönen K. Parnell G.P. Patsopoulos N.A. Pericak-Vance M.A. Piehl F. Rubio J.P. Santaniello A. Santoro S. Schaefer C. Sellebjerg F. Shams H. Shchetynsky K. Silva C. Siokas V. Søndergaard H.B. Sorosina M. Taylor B. Vandebergh M. Vasileiou E.S. Vecchio D. Voortman M.M. Weiner H.L. Wever D. Yong V.W. Hafler D.A. Stewart G.J. Compston A. Zipp F. Harbo H.F. Hemmer B. Goris A. Smolders J. Hauser S.L. Kockum I. Sawcer S.J. Baranzini S.E. Harroud A. Jónsdóttir I. Blanco Y. Llufriu S. Madireddy L. Saiz A. Villoslada P. Stefánsson K. Locus for severity implicates CNS resilience in progression of multiple sclerosis. Nature 2023 619 7969 323 331 10.1038/s41586-023-06250-x 37380766 PMC10602210 31 Amezcua L. McCauley J.L. Race and ethnicity on MS presentation and disease course. Mult. Scler. 2020 26 5 561 567 10.1177/1352458519887328 31965878 PMC7160002 32 Vinoy N. Sheeja N. Kumar S. Biswas L. Class II HLA (DRB1, & DQB1) alleles and IL7R (rs6897932) variants and the risk for Multiple Sclerosis in Kerala, India. Mult. Scler. Relat. Disord. 2021 50 102848 10.1016/j.msard.2021.102848 33657520 33 Alfredsson L. Olsson T. Lifestyle and environmental factors in multiple sclerosis. Cold Spring Harb. Perspect. Med. 2019 9 4 a028944 10.1101/cshperspect.a028944 29735578 PMC6444694 34 Sintzel M.B. Rametta M. Reder A.T. Vitamin D and multiple sclerosis: A comprehensive review. Neurol. Ther. 2018 7 1 59 85 10.1007/s40120-017-0086-4 29243029 PMC5990512 35 Breuer J. Loser K. Mykicki N. Wiendl H. Schwab N. Does the environment influence multiple sclerosis pathogenesis via J. Neuroimmunol. 2019 329 1 8 10.1016/j.jneuroim.2018.05.006 29793727 36 Oskari Virtanen J. Jacobson S. Viruses and multiple sclerosis. CNS Neurol. Disord. Drug Targets 2012 11 5 528 544 10.2174/187152712801661220 22583435 PMC4758194 37 Kapoor T. Mehan S. Neuroprotective methodologies in the treatment of multiple sclerosis current status of clinical and pre-clinical findings. Curr. Drug Discov. Technol. 2021 18 1 31 46 10.2174/1570163817666200207100903 32031075 38 Ullah N. Hasnain S.Z.U. Baloch R. Amin A. Nasibova A. Selakovic D. Rosic G.L. Islamov S. Naraliyeva N. Jaradat N. Mammadova A.O. Exploring essential oil-based bio-composites: molecular docking and in vitro Front Chem. 2024 12 1383620 10.3389/fchem.2024.1383620 39086984 PMC11288909 39 Ziarati P. Tajik S. Sawicka B. Cruz-Rodriguez L. Vambol V. Vambol S. Detoxification of lead and cadmium in pharmaceutical effluent by home-made food wastes. Adv. Biol. & Earth Sci. 2023 8 2 40 Mehan S. Editorial: Therapeutic modulators inhibiting neuromuscular and motor neuron degeneration. Front. Neurosci. 2023 17 4 1188945 10.3389/fnins.2023.1188945 37090793 PMC10116609 41 Gianfrancesco M. Barcellos L. Obesity and multiple sclerosis susceptibility: A review. J. Neurol. Neuromedicine 2016 1 7 1 5 10.29245/2572.942X/2016/7.1064 27990499 PMC5156319 42 Ysrraelit M.C. Correale J. Impact of sex hormones on immune function and multiple sclerosis development. Immunology 2019 156 1 9 22 10.1111/imm.13004 30222193 PMC6283654 43 Sarihi S. Toxic heavy metal concentrations in multiple sclerosis patients: A systematic review and meta-analysis. EXCLI J. 2021 20 1571 1584 10.17179/excli2021-3484 34924905 PMC8678057 44 Mazdeh M. Ghafouri-Fard S. Noroozi R. Sayad A. Khani M. Taheri M. Davood O. M. Ecotropic Viral Integration Site 5 (EVI5) variants are associated with multiple sclerosis in Iranian population. Mult. Scler. Relat. Disord. 2017 18 15 19 10.1016/j.msard.2017.09.011 29141798 45 Johnson B.A. Wang J. Taylor E.M. Caillier S.J. Herbert J. Khan O.A. Cross A.H. De Jager P.L. Gourraud P-A.F. Cree B.C.A. Hauser S.L. Oksenberg J.R. Multiple sclerosis susceptibility alleles in African Americans. Genes Immun. 2010 11 4 343 350 10.1038/gene.2009.81 19865102 PMC2880217 46 Mishra S. Maurya S.K. Srivastava K. Shukla S. Mishra R. Pax6 influences expression patterns of genes involved in neurodegeneration. Ann. Neurosci. 2015 22 4 226 231 10.5214/ans.0972.7531.220407 26525840 PMC4627194 47 Martin R. Sospedra M. Eiermann T. Olsson T. Multiple sclerosis: doubling down on MHC. Trends Genet. 2021 37 9 784 797 10.1016/j.tig.2021.04.012 34006391 48 Al Naqbi H. Mawart A. Alshamsi J. Al Safar H. Tay G.K. Major histocompatibility complex (MHC) associations with diseases in ethnic groups of the Arabian Peninsula. Immunogenetics 2021 73 2 131 152 10.1007/s00251-021-01204-x 33528690 PMC7946680 49 Hauser S.L. Silencing immune dialogue in multiple sclerosis. N. Engl. J. Med. 2024 390 7 662 663 10.1056/NEJMe2314434 38354146 PMC10959047 50 Scholz E.M. Marcilla M. Daura X. Arribas-Layton D. James E.A. Alvarez I. Human leukocyte antigen (HLA)-DRB1*15:01 and HLA-DRB5*01:01 present complementary peptide repertoires. Front. Immunol. 2017 8 1 984 10.3389/fimmu.2017.00984 28871256 PMC5566978 51 Couture A. Garnier A. Docagne F. Boyer O. Vivien D. Le-Mauff B. Latouche J.B. Toutirais O. HLA-class II artificial antigen presenting cells in CD4 + Front. Immunol. 2019 10 1081 10.3389/fimmu.2019.01081 31156634 PMC6533590 52 Lincoln M.R. Ramagopalan S.V. Chao M.J. Herrera B.M. DeLuca G.C. Orton S.M. Dyment D.A. Sadovnick A.D. Ebers G.C. Epistasis among HLA-DRB1, HLA-DQA1, HLA-DQB1 Proc. Natl. Acad. Sci. USA 2009 106 18 7542 7547 10.1073/pnas.0812664106 19380721 PMC2678609 53 Delfan N. Galehdari H. Ghanbari Mardasi F. Zabihi R. Latifi Pakdehi T. Seifi T. Majdinasab N. Association of HLA- DR2-Related Haplotype (HLA-DRB5*01-DRB1*1501-DQB1*0602) in Patients with Multiple Sclerosis in Khuzestan Province. Iran. J. Child. Neurol. 2021 15 3 35 46 10.22037/ijcn.v14i4.18795 34282361 PMC8272550 54 Barrie W. Yang Y. Irving-Pease E.K. Attfield K.E. Scorrano G. Jensen L.T. Armen A.P. Dimopoulos E.A. Stern A. Refoyo-Martinez A. Pearson A. Ramsøe A. Gaunitz C. Demeter F. Jørkov M.L.S. Møller S.B. Springborg B. Klassen L. Hyldgård I.M. Wickmann N. Vinner L. Korneliussen T.S. Allentoft M.E. Sikora M. Kristiansen K. Rodriguez S. Nielsen R. Iversen A.K.N. Lawson D.J. Fugger L. Willerslev E. Elevated genetic risk for multiple sclerosis emerged in steppe pastoralist populations. Nature 2024 625 7994 321 328 10.1038/s41586-023-06618-z 38200296 PMC10781639 55 Enz L.S. Zeis T. Schmid D. Geier F. van der Meer F. Steiner G. Certa U. Binder T.M.C. Stadelmann C. Martin R. Schaeren-Wiemers N. Increased HLA-DR expression and cortical demyelination in MS links with HLA-DR15. Neurol. Neuroimmunol. Neuroinflamm. 2020 7 2 e656 10.1212/NXI.0000000000000656 31882398 PMC6943368 56 Gontika M. Skarlis C. Artemiadis A. Pons R. Mastroyianni S. Vartzelis G. Theodorou V. Kilindireas K. Stefanis L. Dalakas M. Chrousos G. Anagnostouli M. HLA-DRB1 Mult. Scler. J. Exp. Transl. Clin. 2020 6 1 2055217320908046 10.1177/2055217320908046 32133149 PMC7040929 57 Mosca L. Mantero V. Penco S. La Mantia L. De Benedetti S. Marazzi M.R. Spreafico C. Erminio C. Grassi L. Lando G. Zagaria M. Agostoni E. Protti A. HLA-DRB1*15 association with multiple sclerosis is confirmed in a multigenerational Italian family. Funct. Neurol. 2017 32 2 83 88 10.11138/FNeur/2017.32.2.083 28676141 PMC5507157 58 Mamedov A. Vorobyeva N. Filimonova I. Zakharova M. Kiselev I. Bashinskaya V. Baulina N. Boyko A. Favorov A. Kulakova O. Ziganshin R. Smirnov I. Poroshina A. Shilovskiy I. Khaitov M. Sykulev Y. Favorova O. Vlassov V. Gabibov A. Belogurov A. Jr. Protective allele for multiple sclerosis HLA-DRB1*01:01 provides kinetic discrimination of myelin and exogenous antigenic peptides. Front. Immunol. 2020 10 3088 10.3389/fimmu.2019.03088 32010139 PMC6978714 59 Isobe N. Keshavan A. Gourraud P.A. Zhu A.H. Datta E. Schlaeger R. Caillier S.J. Santaniello A. Lizée A. Himmelstein D.S. Baranzini S.E. Hollenbach J. Cree B.A.C. Hauser S.L. Oksenberg J.R. Henry R.G. Association of HLA genetic risk burden with disease phenotypes in multiple sclerosis. JAMA Neurol. 2016 73 7 795 802 10.1001/jamaneurol.2016.0980 27244296 PMC5081075 60 Waubant E. Lucas R. Mowry E. Graves J. Olsson T. Alfredsson L. Langer-Gould A. Environmental and genetic risk factors for MS: an integrated review. Ann. Clin. Transl. Neurol. 2019 6 9 1905 1922 10.1002/acn3.50862 31392849 PMC6764632 61 Haki M. AL-Biati H.A. Al-Tameemi Z.S. Ali I.S. Al-hussaniy H.A. Review of multiple sclerosis: Epidemiology, etiology, pathophysiology, and treatment. Medicine (Baltimore) 2024 103 8 e37297 10.1097/MD.0000000000037297 38394496 PMC10883637 62 Mirza A. Forbes J.D. Zhu F. Bernstein C.N. Van Domselaar G. Graham M. Waubant E. Tremlett H. The multiple sclerosis gut microbiota: A systematic review. Mult. Scler. Relat. Disord. 2020 37 101427 10.1016/j.msard.2019.101427 32172998 63 Noto D. Miyake S. Gut dysbiosis and multiple sclerosis. Clin. Immunol. 2022 235 108380 10.1016/j.clim.2020.108380 32169440 64 Riise T. Mohr D.C. Munger K.L. Rich-Edwards J.W. Kawachi I. Ascherio A. Stress and the risk of multiple sclerosis. Neurology 2011 76 22 1866 1871 10.1212/WNL.0b013e31821d74c5 21624985 PMC3115807 65 Jiang X. Olsson T. Hillert J. Kockum I. Alfredsson L. Stressful life events are associated with the risk of multiple sclerosis. Eur. J. Neurol. 2020 27 12 2539 2548 10.1111/ene.14458 32741033 PMC7692913 66 Sparaco M. Miele G. Lavorgna L. Abbadessa G. Bonavita S. Association between relapses, stress, and depression in people with multiple sclerosis during the COVID-19 pandemic. Neurol. Sci. 2022 43 5 2935 2942 10.1007/s10072-022-05917-z 35092543 PMC8799958 67 Liu G. Hu Y. Jin S. Jiang Q. Genetic variant rs763361 regulates multiple sclerosis CD226 Proc. Natl. Acad. Sci. USA 2017 114 6 E906 E907 10.1073/pnas.1618520114 28137889 PMC5307472 68 Peerlings D. Mimpen M. Damoiseaux J. The IL-2 – IL-2 receptor pathway: Key to understanding multiple sclerosis. J. Transl. Autoimmun. 2021 4 6 100123 10.1016/j.jtauto.2021.100123 35005590 PMC8716671 69 Ross S.H. Cantrell D.A. Signaling and Function of Interleukin-2 in T Lymphocytes. Annu. Rev. Immunol. 2018 36 1 411 433 10.1146/annurev-immunol-042617-053352 29677473 PMC6472684 70 Buhelt S. Søndergaard H.B. Oturai A. Ullum H. von Essen M.R. Sellebjerg F. Relationship between multiple sclerosis-associated IL2RA Cells 2019 8 6 634 10.3390/cells8060634 31242590 PMC6628508 71 Buhelt S. Laigaard H.M. von Essen M.R. Ullum H. Oturai A. Sellebjerg F. Søndergaard H.B. IL2RA + Front. Immunol. 2021 12 5 676141 10.3389/fimmu.2021.676141 34386002 PMC8353370 72 Lindner E. Weger M. Ardjomand N. Renner W. El-Shabrawi Y. Associations of independent IL2RA gene variants with intermediate uveitis. PLoS One 2015 10 7 e0130737 10.1371/journal.pone.0130737 26133380 PMC4489875 73 Kumar N. Sahoo N.K. Mehan S. verma B. The importance of gut-brain axis and use of probiotics as a treatment strategy for multiple sclerosis. Mult. Scler. Relat. Disord. 2023 71 4 104547 10.1016/j.msard.2023.104547 36805171 74 Chen D. Tang T.X. Deng H. Yang X.P. Tang Z.H. Interleukin-7 biology and its effects on immune cells: Mediator of generation, differentiation, survival, and homeostasis. Front. Immunol. 2021 12 747324 10.3389/fimmu.2021.747324 34925323 PMC8674869 75 Galarza-Muñoz G. Briggs F.B.S. Evsyukova I. Schott-Lerner G. Kennedy E.M. Nyanhete T. Wang L. Bergamaschi L. Widen S.G. Tomaras G.D. Ko D.C. Bradrick S.S. Barcellos L.F. Gregory S.G. Garcia-Blanco M.A. Human epistatic interaction controls IL7R splicing and increases multiple Sclerosis Risk. Cell 2017 169 1 72 84.e13 10.1016/j.cell.2017.03.007 28340352 PMC5456452 76 Wang C. Kong L. Kim S. Lee S. Oh S. Jo S. Jang I. Kim T.D. The role of IL-7 and IL-7R in cancer pathophysiology and immunotherapy. Int. J. Mol. Sci. 2022 23 18 10412 10.3390/ijms231810412 36142322 PMC9499417 77 Liu H. Deng Z. Han F. Xia Y. Liu Q.H. Sato M. Time-frequency analysis of air-coupled GPR data for identification of delamination between pavement layers. Constr. Build. Mater. 2017 154 1207 1215 10.1016/j.conbuildmat.2017.06.132 78 Koutsouraki E. Theodoros K. Eleni G. Marianna K. Areti N. Ariadni K. Dimitrios M. Autonomic nervous system disorders in multiple sclerosis. J. Neurol. 2023 270 8 3703 3713 10.1007/s00415-023-11725-y 37084150 79 Marrie R.A. Fisk J.D. Fitzgerald K. Kowalec K. Maxwell C. Rotstein D. Salter A. Tremlett H. Etiology, effects and management of comorbidities in multiple sclerosis: Recent advances. Front. Immunol. 2023 14 1197195 10.3389/fimmu.2023.1197195 37325663 PMC10266935 80 van Langelaar J. Rijvers L. Smolders J. van Luijn M.M. B and T cells driving multiple sclerosis: Identity, mechanisms and potential triggers. Front. Immunol. 2020 11 760 10.3389/fimmu.2020.00760 32457742 PMC7225320 81 Zhao Z. Xue J. Zhuo Z. Zhong W. Liu H. The association of IL7R Neuropsychiatr. Dis. Treat. 2022 18 1855 1859 10.2147/NDT.S376066 36052273 PMC9426677 82 Kallio S.P. Jakkula E. Purcell S. Suvela M. Koivisto K. Tienari P.J. Elovaara I. Pirttilä T. Reunanen M. Bronnikov D. Viander M. Meri S. Hillert J. Lundmark F. Harbo H.F. Lorentzen Å.R. De Jager P.L. Daly M.J. Hafler D.A. Palotie A. Peltonen L. Saarela J. Use of a genetic isolate to identify rare disease variants: C7 on 5p associated with MS. Hum. Mol. Genet. 2009 18 9 1670 1683 10.1093/hmg/ddp073 19221116 PMC2667286 83 Sahami-Fard M.H. Mozhdeh M. Izadpanah F. Kashani H.H. Nezhadi A. Interleukin 7 receptor T244I polymorphism and the multiple sclerosis susceptibility: A meta-analysis. J. Neuroimmunol. 2020 341 577166 10.1016/j.jneuroim.2020.577166 32062178 84 Schott G. Galarza-Muñoz G. Trevino N. Chen X. Weirauch M.T. Gregory S.G. Bradrick S.S. Garcia-Blanco M.A. U2AF2 binds IL7R RNA 2021 27 5 571 583 Epub ahead of print 10.1261/rna.078279.120 33568552 PMC8051268 85 Liu H. Huang J. Dou M. Liu Y. Xiao B. Liu X. Huang Z. Variants in the IL7RA gene confer susceptibility to multiple sclerosis in Caucasians: Evidence based on 9734 cases and 10436 controls. Sci. Rep. 2017 7 1 1207 10.1038/s41598-017-01345-8 28446795 PMC5430888 86 Zhao J.H. Stacey D. Eriksson N. Macdonald-Dunlop E. Hedman Å.K. Kalnapenkis A. Enroth S. Cozzetto D. Digby-Bell J. Marten J. Folkersen L. Herder C. Jonsson L. Bergen S.E. Gieger C. Needham E.J. Surendran P. Metspalu A. Milani L. Mägi R. Nelis M. Hudjašov G. Paul D.S. Polasek O. Thorand B. Grallert H. Roden M. Võsa U. Esko T. Hayward C. Johansson Å. Gyllensten U. Powell N. Hansson O. Mattsson-Carlgren N. Joshi P.K. Danesh J. Padyukov L. Klareskog L. Landén M. Wilson J.F. Siegbahn A. Wallentin L. Mälarstig A. Butterworth A.S. Peters J.E. Genetics of circulating inflammatory proteins identifies drivers of immune-mediated disease risk and therapeutic targets. Nat. Immunol. 2023 24 9 1540 1551 10.1038/s41590-023-01588-w 37563310 PMC10457199 87 Deuitch N. Cudrici C. Ombrello A. Aksentijevich I. TNF receptor-associated periodic fever syndrome. GeneReviews ® 2022 36375008 88 Cudrici C. Deuitch N. Aksentijevich I. Revisiting TNF Receptor-Associated Periodic Syndrome (TRAPS): Current perspectives. Int. J. Mol. Sci. 2020 21 9 3263 10.3390/ijms21093263 32380704 PMC7246474 89 Gomez-Pinedo U. Variant rs4149584 (R92Q) of the TNFRSF1A gene in patients with familial multiple sclerosis. Neurologia 2025 40 1 10 21 10.1016/j.nrleng.2022.07.002 35963536 90 Javor J. Shawkatová I. Ďurmanová V. Párnická Z. Čierny D. Michalik J. Čopíková-Cudráková D. Smahová B. Gmitterová K. Peterajová Ľ. Bucová M. TNFRSF1A Int. J. Immunogenet. 2018 45 5 257 265 10.1111/iji.12388 30009568 91 Zegarska J. Wiesik-Szewczyk E. Hryniewiecka E. Wolska-Kusnierz B. Soldacki D. Kacprzak M. Sobczynska-Tomaszewska A. Czerska K. Siedlecki P. Jahnz-Rozyk K. Bernatowska E. Zagozdzon R. Paczek L. Tumor necrosis factor Receptor-Associated Periodic Syndrome (TRAPS) with a new pathogenic variant in TNFRSF1A J. Clin. Med. 2021 10 3 465 10.3390/jcm10030465 33530412 PMC7865531 92 Probert L. TNF and its receptors in the CNS: The essential, the desirable and the deleterious effects. Neuroscience 2015 302 2 22 10.1016/j.neuroscience.2015.06.038 26117714 93 De Jager P. de Bakker P. Wang J. Ottoboni L. Hauser S. Oksenberg J. Hafler D. F.27. meta-analysis of genome scans and replication identify CD6, ICSBP1, and TNFRSF1A as novel multiple sclerosis susceptibility loci. Clin. Immunol. 2009 131 S101 10.1016/j.clim.2009.03.294 PMC2757648 19525953 94 Eliseeva D.D. Zakharova M.N. Myelin oligodendrocyte glycoprotein as an autoantigen in inflammatory demyelinating diseases of the central nervous system. Biochemistry 2023 88 4 551 563 10.1134/S0006297923040107 37080940 95 Peschl P. Bradl M. Höftberger R. Berger T. Reindl M. Myelin oligodendrocyte glycoprotein: Deciphering a target in inflammatory demyelinating diseases. Front. Immunol. 2017 8 529 10.3389/fimmu.2017.00529 28533781 PMC5420591 96 Didonna A. Oksenberg J.R. Genetic determinants of risk and progression in multiple sclerosis. Clin. Chim. Acta 2015 449 16 22 10.1016/j.cca.2015.01.034 25661088 PMC4524789 97 Zai G. Arnold P.D. Richter M.A. Hanna G.L. Rosenberg D. Kennedy J.L. An association of Myelin Oligodendrocyte Glycoprotein (MOG) gene variants with white matter volume in pediatric obsessive-compulsive disorder. Psychiatry Res. Neuroimaging 2021 307 111231 10.1016/j.pscychresns.2020.111231 33302097 PMC7775903 98 Yang W. Zhou W. Zhang B.K. Kong L.S. Zhu X.X. Wang R.X. Yang Y. Chen Y.F. Chen L.R. Association between CD24 Ala/Val polymorphism and multiple sclerosis risk. Medicine (Baltimore) 2020 99 15 e19530 10.1097/MD.0000000000019530 32282702 PMC7440312 99 Atmaca M. Onalan E. Yildirim H. Yuce H. Koc M. Korkmaz S. The association of myelin oligodendrocyte glycoprotein gene and white matter volume in obsessive–compulsive disorder. J. Affect. Disord. 2010 124 3 309 313 10.1016/j.jad.2010.03.027 20452030 100 Martinsen V. Kursula P. Multiple sclerosis and myelin basic protein: insights into protein disorder and disease. Amino Acids 2022 54 1 99 109 10.1007/s00726-021-03111-7 34889995 PMC8810476 101 Franklin R.J.M. Simons M. CNS remyelination and inflammation: From basic mechanisms to therapeutic opportunities. Neuron 2022 110 21 3549 3565 10.1016/j.neuron.2022.09.023 36228613 102 López-Muguruza E. Matute C. Alterations of oligodendrocyte and myelin energy metabolism in multiple sclerosis. Int. J. Mol. Sci. 2023 24 16 12912 10.3390/ijms241612912 37629092 PMC10454078 103 Wootla B. Eriguchi M. Rodriguez M. Is multiple sclerosis an autoimmune disease? Autoimmune Dis. 2012 2012 1 12 10.1155/2012/969657 22666554 PMC3361990 104 Ambrosius W. Michalak S. Kozubski W. Kalinowska A. Myelin oligodendrocyte glycoprotein antibody-associated disease: Current insights into the disease pathophysiology, diagnosis and management. Int. J. Mol. Sci. 2020 22 1 100 10.3390/ijms22010100 33374173 PMC7795410 105 Stassart R.M. Möbius W. Nave K.A. Edgar J.M. The axon-myelin unit in development and degenerative disease. Front. Neurosci. 2018 12 467 10.3389/fnins.2018.00467 30050403 PMC6050401 106 Alizadeh A. Dyck S.M. Karimi-Abdolrezaee S. Myelin damage and repair in pathologic CNS: Challenges and prospects. Front. Mol. Neurosci. 2015 8 35 10.3389/fnmol.2015.00035 26283909 PMC4515562 107 Nevin Z.S. Factor D.C. Karl R.T. Douvaras P. Laukka J. Windrem M.S. Goldman S.A. Fossati V. Hobson G.M. Tesar P.J. Modeling the mutational and phenotypic landscapes of pelizaeus-merzbacher disease with human iPSC-derived oligodendrocytes. Am. J. Hum. Genet. 2017 100 4 617 634 10.1016/j.ajhg.2017.03.005 28366443 PMC5384098 108 Cloake N.C. Yan J. Aminian A. Pender M.P. Greer J.M. PLP1 Mutations in Patients with Multiple Sclerosis: Identification of a New Mutation and Potential Pathogenicity of the Mutations. J. Clin. Med. 2018 7 10 342 10.3390/jcm7100342 30314286 PMC6210135 109 Ruiz M. Bégou M. Launay N. Ranea-Robles P. Bianchi P. López-Erauskin J. Morató L. Guilera C. Petit B. Vaurs-Barriere C. Guéret-Gonthier C. Bonnet-Dupeyron M.N. Fourcade S. Auwerx J. Boespflug-Tanguy O. Pujol A. Oxidative stress and mitochondrial dynamics malfunction are linked in P M Brain Pathol. 2018 28 5 611 630 10.1111/bpa.12571 29027761 PMC8028267 110 Osório M.J. Goldman S.A. Neurogenetics of Pelizaeus-Merzbacher disease. Handb Clin. Neurol. 2018 148 701 722 10.1016/B978-0-444-64076-5.00045-4 29478609 PMC8167836 111 Nobuta H. Yang N. Ng Y.H. Marro S.G. Sabeur K. Chavali M. Stockley J.H. Killilea D.W. Walter P.B. Zhao C. Huie P. Jr Goldman S.A. Kriegstein A.R. Franklin R.J.M. Rowitch D.H. Wernig M. Oligodendrocyte death in pelizaeus-merzbacher disease is rescued by iron chelation. Cell Stem Cell 2019 25 4 531 541.e6 10.1016/j.stem.2019.09.003 31585094 PMC8282124 112 Chapman W.D. Herink M.C. Cameron M.H. Bourdette D. Polypharmacy in multiple sclerosis: Prevalence, risks, and mitigation strategies. Curr. Neurol. Neurosci. Rep. 2023 23 9 521 529 10.1007/s11910-023-01289-9 37523105 113 Sethi P. Mehan S. Khan Z. Chhabra S. Acetyl-11-keto-beta boswellic acid(AKBA) modulates CSTC-pathway by activating SIRT-1/Nrf2-HO-1 signalling in experimental rat model of obsessive-compulsive disorder: Evidenced by CSF, blood plasma and histopathological alterations. Neurotoxicology 2023 98 61 85 10.1016/j.neuro.2023.08.001 37549874 114 Numasawa-Kuroiwa Y. Okada Y. Shibata S. Kishi N. Akamatsu W. Shoji M. Nakanishi A. Oyama M. Osaka H. Inoue K. Takahashi K. Yamanaka S. Kosaki K. Takahashi T. Okano H. Involvement of ER stress in dysmyelination of Pelizaeus-Merzbacher Disease with PLP1 missense mutations shown by iPSC-derived oligodendrocytes. Stem Cell Reports 2014 2 5 648 661 10.1016/j.stemcr.2014.03.007 24936452 PMC4050482 115 Read A. Schröder M. The unfolded protein response: An overview. Biology (Basel) 2021 10 5 384 10.3390/biology10050384 33946669 PMC8146082 116 Hetz C. Zhang K. Kaufman R.J. Mechanisms, regulation and functions of the unfolded protein response. Nat. Rev. Mol. Cell Biol. 2020 21 8 421 438 10.1038/s41580-020-0250-z 32457508 PMC8867924 117 Cotsapas C. Mitrovic M. Genome-wide association studies of multiple sclerosis. Clin. Transl. Immunology 2018 7 6 e1018 10.1002/cti2.1018 29881546 PMC5983059 118 Elgueta R. Benson M.J. De Vries V.C. Wasiuk A. Guo Y. Noelle R.J. Molecular mechanism and function of CD40/CD40L engagement in the immune system. Immunol. Rev. 2009 229 1 152 172 10.1111/j.1600-065X.2009.00782.x 19426221 PMC3826168 119 Kowalec K. Fitzgerald K.C. Salter A. Dolovich C. Harder A. Bernstein C.N. Bolton J. Cutter G.R. Graff L.A. Hägg S. Hitchon C.A. Lu Y. Lublin F. McKay K.A. Patten S.B. Patki A. Tiwari H.K. Wolinsky J.S. Marrie R.A. Polygenicity of comorbid depression in multiple sclerosis. Neurology 2023 101 5 e522 e532 10.1212/WNL.0000000000207457 37290970 PMC10401690 120 Field J. Shahijanian F. Schibeci S. Johnson L. Gresle M. Laverick L. Parnell G. Stewart G. McKay F. Kilpatrick T. Butzkueven H. Booth D. The MS risk allele of CD40 Is associated with reduced cell-membrane bound expression in antigen presenting cells: Implications for gene function. PLoS One 2015 10 6 e0127080 10.1371/journal.pone.0127080 26068105 PMC4465929 121 Aarts S.A.B.M. Seijkens T.T.P. van Dorst K.J.F. Dijkstra C.D. Kooij G. Lutgens E. The CD40–CD40L dyad in experimental autoimmune encephalomyelitis and multiple sclerosis. Front. Immunol. 2017 8 1 1791 10.3389/fimmu.2017.01791 29312317 PMC5732943 122 Comi G. Bar-Or A. Lassmann H. Uccelli A. Hartung H.P. Montalban X. Sørensen P.S. Hohlfeld R. Hauser S.L. Role of B cells in multiple sclerosis and related disorders. Ann. Neurol. 2021 89 1 13 23 10.1002/ana.25927 33091175 PMC8007167 123 Peters A.L. Stunz L.L. Bishop G.A. CD40 and autoimmunity: The dark side of a great activator. Semin. Immunol. 2009 21 5 293 300 10.1016/j.smim.2009.05.012 19595612 PMC2753170 124 Zhang Y. Liu Q. Yang S. Liao Q. CD58 Immunobiology at a glance. Front. Immunol. 2021 12 5 705260 10.3389/fimmu.2021.705260 34168659 PMC8218816 125 De Jager P.L. Baecher-Allan C. Maier L.M. Arthur A.T. Ottoboni L. Barcellos L. McCauley J.L. Sawcer S. Goris A. Saarela J. Yelensky R. Price A. Leppa V. Patterson N. de Bakker P.I.W. Tran D. Aubin C. Pobywajlo S. Rossin E. Hu X. Ashley C.W. Choy E. Rioux J.D. Pericak-Vance M.A. Ivinson A. Booth D.R. Stewart G.J. Palotie A. Peltonen L. Dubois B. Haines J.L. Weiner H.L. Compston A. Hauser S.L. Daly M.J. Reich D. Oksenberg J.R. Hafler D.A. The role of the CD58 Proc. Natl. Acad. Sci. USA 2009 106 13 5264 5269 10.1073/pnas.0813310106 19237575 PMC2664005 126 Zhou W. Hu W. Tang L. Ma X. Liao J. Yu Z. Qi M. Chen B. Li J. Meta-analysis of the selected genetic variants in immune-related genes and multiple sclerosis risk. Mol. Neurobiol. 2024 61 10 8175 8187 10.1007/s12035-024-04095-7 38478144 127 Krieger S. Cook K. Hersh C.M. Understanding multiple sclerosis as a disease spectrum: Above and below the clinical threshold. Curr. Opin. Neurol. 2024 37 3 189 201 10.1097/WCO.0000000000001262 38535979 PMC11064902 128 Hecker M. Fitzner B. Blaschke J. Blaschke P. Zettl U.K. Susceptibility variants in the CD58 gene locus point to a role of microRNA-548ac in the pathogenesis of multiple sclerosis. Mutat. Res. Rev. Mutat. Res. 2015 763 161 167 10.1016/j.mrrev.2014.10.002 25795118 129 Beecham A.H. Patsopoulos N.A. Xifara D.K. Davis M.F. Kemppinen A. Cotsapas C. Shah T.S. Spencer C. Booth D. Goris A. Oturai A. Saarela J. Fontaine B. Hemmer B. Martin C. Zipp F. D’Alfonso S. Martinelli-Boneschi F. Taylor B. Harbo H.F. Kockum I. Hillert J. Olsson T. Ban M. Oksenberg J.R. Hintzen R. Barcellos L.F. Agliardi C. Alfredsson L. Alizadeh M. Anderson C. Andrews R. Søndergaard H.B. Baker A. Band G. Baranzini S.E. Barizzone N. Barrett J. Bellenguez C. Bergamaschi L. Bernardinelli L. Berthele A. Biberacher V. Binder T.M. Blackburn H. Bomfim I.L. Brambilla P. Broadley S. Brochet B. Brundin L. Buck D. Butzkueven H. Caillier S.J. Camu W. Carpentier W. Cavalla P. Celius E.G. Coman I. Comi G. Corrado L. Cosemans L. Cournu-Rebeix I. Cree B.A. Cusi D. Damotte V. Defer G. Delgado S.R. Deloukas P. di Sapio A. Dilthey A.T. Donnelly P. Dubois B. Duddy M. Edkins S. Elovaara I. Esposito F. Evangelou N. Fiddes B. Field J. Franke A. Freeman C. Frohlich I.Y. Galimberti D. Gieger C. Gourraud P.A. Graetz C. Graham A. Grummel V. Guaschino C. Hadjixenofontos A. Hakonarson H. Halfpenny C. Hall G. Hall P. Hamsten A. Harley J. Harrower T. Hawkins C. Hellenthal G. Hillier C. Hobart J. Hoshi M. Hunt S.E. Jagodic M. Jelčić I. Jochim A. Kendall B. Kermode A. Kilpatrick T. Koivisto K. Konidari I. Korn T. Kronsbein H. Langford C. Larsson M. Lathrop M. Lebrun-Frenay C. Lechner-Scott J. Lee M.H. Leone M.A. Leppä V. Liberatore G. Lie B.A. Lill C.M. Lindén M. Link J. Luessi F. Lycke J. Macciardi F. Männistö S. Manrique C.P. Martin R. Martinelli V. Mason D. Mazibrada G. McCabe C. Mero I.L. Mescheriakova J. Moutsianas L. Myhr K.M. Nagels G. Nicholas R. Nilsson P. Piehl F. Pirinen M. Price S.E. Quach H. Reunanen M. Robberecht W. Robertson N.P. Rodegher M. Rog D. Salvetti M. Schnetz-Boutaud N.C. Sellebjerg F. Selter R.C. Schaefer C. Shaunak S. Shen L. Shields S. Siffrin V. Slee M. Sorensen P.S. Sorosina M. Sospedra M. Spurkland A. Strange A. Sundqvist E. Thijs V. Thorpe J. Ticca A. Tienari P. van Duijn C. Visser E.M. Vucic S. Westerlind H. Wiley J.S. Wilkins A. Wilson J.F. Winkelmann J. Zajicek J. Zindler E. Haines J.L. Pericak-Vance M.A. Ivinson A.J. Stewart G. Hafler D. Hauser S.L. Compston A. McVean G. De Jager P. Sawcer S.J. McCauley J.L. Analysis of immune-related loci identifies 48 new susceptibility variants for multiple sclerosis. Nat. Genet. 2013 45 11 1353 1360 10.1038/ng.2770 24076602 PMC3832895 130 Patsopoulos N.A. The multiple sclerosis genomic map: Role of peripheral immune cells and resident microglia in susceptibility bioRxiv 2019 365 6460 eaav7188 10.1101/143933 PMC7241648 31604244 131 D’Netto M.J. Ward H. Morrison K.M. Ramagopalan S.V. Dyment D.A. DeLuca G.C. Handunnetthi L. Sadovnick A.D. Ebers G.C. Risk alleles for multiple sclerosis in multiplex families. Neurology 2009 72 23 1984 1988 10.1212/WNL.0b013e3181a92c25 19506219 132 Hecker M. Boxberger N. Illner N. Fitzner B. Schröder I. Winkelmann A. Dudesek A. Meister S. Koczan D. Lorenz P. Thiesen H.J. Zettl U.K. A genetic variant associated with multiple sclerosis inversely affects the expression of CD58 and microRNA-548ac from the same gene. PLoS Genet. 2019 15 2 e1007961 10.1371/journal.pgen.1007961 30730892 PMC6382214 133 Leitner J. Herndler-Brandstetter D. Zlabinger G.J. Grubeck-Loebenstein B. Steinberger P. CD58/CD2 Is the primary costimulatory pathway in human CD28−CD8 + J. Immunol. 2015 195 2 477 487 10.4049/jimmunol.1401917 26041540 134 Pandey R. Bakay M. Hakonarson H. CLEC16A Int. J. Mol. Sci. 2023 24 9 8224 10.3390/ijms24098224 37175930 PMC10179542 135 van Luijn M.M. Kreft K.L. Jongsma M.L. Mes S.W. Wierenga-Wolf A.F. van Meurs M. Melief M.J. der Kant R. Janssen L. Janssen H. Tan R. Priatel J.J. Neefjes J. Laman J.D. Hintzen R.Q. Multiple sclerosis-associated CLEC16A controls HLA class II expression via Brain 2015 138 6 1531 1547 10.1093/brain/awv080 25823473 PMC4614123 136 Eriksson A.M. Leikfoss I.S. Abrahamsen G. Sundvold V. Isom M.M. Keshari P.K. Rognes T. Landsverk O.J.B. Bos S.D. Harbo H.F. Spurkland A. Berge T. Exploring the role of the multiple sclerosis susceptibility gene CLEC16A Scand. J. Immunol. 2021 94 1 e13050 10.1111/sji.13050 34643957 137 Pandey R. Bakay M. Strenkowski B.P. Hain H.S. Hakonarson H. JAK/STAT inhibitor therapy partially rescues the lipodystrophic autoimmune phenotype in Clec16a KO mice. Sci. Rep. 2021 11 1 7372 10.1038/s41598-021-86493-8 33795715 PMC8016875 138 Mero I-L. Ban M. Lorentzen Å.R. Smestad C. Celius E.G. Sæther H. Saeedi H. Viken M.K. Skinningsrud B. Undlien D.E. Aarseth J. Myhr K-M. Granum S. Spurkland A. Sawcer S. Compston A. Lie B.A. Harbo H.F. Exploring the CLEC16A gene reveals a MS-associated variant with correlation to the relative expression of CLEC16A isoforms in thymus. Genes Immun. 2011 12 3 191 198 10.1038/gene.2010.59 21179112 139 Fan H.H. Cui L. Jiang X.X. Song Y.D. Liu S.S. Wu K.Y. Dong H.J. Mao M. Ovlyakulov B. Wu H.M. Zhu J.H. Zhang X. Autoimmune disease associated CLEC16A Front. Genet. 2022 13 1 856493 10.3389/fgene.2022.856493 35432448 PMC9007333 140 Wu M.Y. Wang E.J. Feng D. Li M. Ye R.D. Lu J.H. Pharmacological insights into autophagy modulation in autoimmune diseases. Acta Pharm. Sin. B 2021 11 11 3364 3378 10.1016/j.apsb.2021.03.026 34900523 PMC8642426 141 Yang Z. Goronzy J.J. Weyand C.M. Autophagy in autoimmune disease. J. Mol. Med. (Berl.) 2015 93 7 707 717 10.1007/s00109-015-1297-8 26054920 PMC4486076 142 Salem S. Salem D. Gros P. Role of IRF8 in immune cells functions, protection against infections, and susceptibility to inflammatory diseases. Hum. Genet. 2020 139 6-7 707 721 10.1007/s00439-020-02154-2 32232558 143 Das A. Chauhan K.S. Kumar H. Tailor P. Mutation in Irf8 Irf8 R294C Front. Immunol. 2021 12 758190 10.3389/fimmu.2021.758190 34867997 PMC8635750 144 Chiu S. Bharat A. Role of monocytes and macrophages in regulating immune response following lung transplantation. Curr. Opin. Organ Transplant. 2016 21 3 239 245 10.1097/MOT.0000000000000313 26977996 PMC4858348 145 Moorman H.R. Reategui Y. Poschel D.B. Liu K. IRF8: Mechanism of action and health implications. Cells 2022 11 17 2630 10.3390/cells11172630 36078039 PMC9454819 146 Zhou T. Zhu X. Ye Z. Wang Y.F. Yao C. Xu N. Zhou M. Ma J. Qin Y. Shen Y. Tang Y. Yin Z. Xu H. Zhang Y. Zang X. Ding H. Yang W. Guo Y. Harley J.B. Namjou B. Kaufman K.M. Kottyan L.C. Weirauch M.T. Hou G. Shen N. Lupus enhancer risk variant causes dysregulation of IRF8 through cooperative lncRNA and DNA methylation machinery. Nat. Commun. 2022 13 1 1855 10.1038/s41467-022-29514-y 35388006 PMC8987079 147 Morimoto K. Nakajima K. Role of the immune system in the development of the central nervous system. Front. Neurosci. 2019 13 916 10.3389/fnins.2019.00916 31551681 PMC6735264 148 Matta B. Song S. Li D. Barnes B.J. Interferon regulatory factor signaling in autoimmune disease. Cytokine 2017 98 1 15 26 10.1016/j.cyto.2017.02.006 28283223 PMC8033540 149 Berghout J. Langlais D. Radovanovic I. Tam M. MacMicking J.D. Stevenson M.M. Gros P. Irf8-regulated genomic responses drive pathological inflammation during cerebral malaria. PLoS Pathog. 2013 9 7 e1003491 10.1371/journal.ppat.1003491 23853600 PMC3708918 150 Prinz M. Masuda T. Wheeler M.A. Quintana F.J. Microglia and central nervous system-Associated macrophages from origin to disease modulation. Annu. Rev. Immunol. 2021 39 1 251 277 10.1146/annurev-immunol-093019-110159 33556248 PMC8085109 151 Pons V. Rivest S. Beneficial roles of microglia and growth factors in MS, a brief review. Front. Cell. Neurosci. 2020 14 1 284 10.3389/fncel.2020.00284 33173466 PMC7538672 152 Adams N.M. Lau C.M. Fan X. Rapp M. Geary C.D. Weizman O.E. Diaz-Salazar C. Sun J.C. Transcription factor IRF8 orchestrates the adaptive natural killer cell response. Immunity 2018 48 6 1172 1182.e6 10.1016/j.immuni.2018.04.018 29858012 PMC6233715 153 Moser B. CXCR5, the defining marker for follicular B helper T (TFH) cells. Front. Immunol. 2015 6 9 296 10.3389/fimmu.2015.00296 26106395 PMC4459225 154 Pan Z. Zhu T. Liu Y. Zhang N. Role of the CXCL13/CXCR5 axis in autoimmune diseases. Front. Immunol. 2022 13 1 850998 10.3389/fimmu.2022.850998 35309354 PMC8931035 155 Abdelrahman A. Alvarez E. Advances in multiple sclerosis neurotherapeutics, neuroprotection, and risk mitigation strategies. Neurol. Clin. 2024 42 1 115 135 10.1016/j.ncl.2023.08.002 37980110 156 Gil-Varea E. Fedetz M. Eixarch H. Spataro N. Villar L.M. Urcelay E. Saiz A. Fernández Ó. Leyva L. Ramió-Torrentà L. Vandenbroeck K. Otaegui D. Castillo-Triviño T. Izquierdo G. Malhotra S. Bosch E. Navarro A. Alcina A. Montalban X. Matesanz F. Comabella M. A new risk variant for multiple sclerosis at 11q23.3 Locus CXCR5+ J. Clin. Med. 2020 9 3 625 10.3390/jcm9030625 32110891 PMC7141122 157 Haberman A.M. Gonzalez D.G. Wong P. Zhang T. Kerfoot S.M. Germinal center B cell initiation, GC maturation, and the coevolution of its stromal cell niches. Immunol. Rev. 2019 288 1 10 27 10.1111/imr.12731 30874342 PMC10234181 158 Crotty S. T follicular helper cell differentiation, function, and roles in disease. Immunity 2014 41 4 529 542 10.1016/j.immuni.2014.10.004 25367570 PMC4223692 159 Ueno H. Banchereau J. Vinuesa C.G. Pathophysiology of T follicular helper cells in humans and mice. Nat. Immunol. 2015 16 2 142 152 10.1038/ni.3054 25594465 PMC4459756 160 Yuan J. Ren H. C–C chemokine receptor 5 and acute graft- versus Immun. Inflamm. Dis. 2022 10 9 e687 10.1002/iid3.687 36039647 PMC9382859 161 Mahla R.S. Lymphocytic infiltration in multiple sclerosis. Mult. Scler. Relat. Disord. 2024 85 2 105533 10.1016/j.msard.2024.105533 38479047 162 Verma M.K. Shakya S. Genetic variation in the chemokine receptor 5 gene and course of HIV infection; review on genetics and immunological aspect. Genes Dis. 2021 8 4 475 483 10.1016/j.gendis.2020.04.007 34179311 PMC8209322 163 Barmania F. Pepper M.S. C-C chemokine receptor type five (CCR5): An emerging target for the control of HIV infection. Appl. Transl. Genomics 2013 2 2 3 16 10.1016/j.atg.2013.05.004 27942440 PMC5133339 164 Ellwanger J.H. Kulmann-Leal B. Kaminski V.L. Rodrigues A.G. Bragatte M.A.S. Chies J.A.B. Beyond HIV infection: Neglected and varied impacts of CCR5 and CCR5Δ32 on viral diseases. Virus Res. 2020 286 2 198040 10.1016/j.virusres.2020.198040 32479976 PMC7260533 165 Zeng Z. Lan T. Wei Y. Wei X. CCL5/CCR5 axis in human diseases and related treatments. Genes Dis. 2022 9 1 12 27 10.1016/j.gendis.2021.08.004 34514075 PMC8423937 166 Gumbar S. Bhardwaj S. Mehan S. Khan Z. Narula A.S. Kalfin R. Tabrez S. Zughaibi T.A. Wasi S. Renal mitochondrial restoration by gymnemic acid in gentamicin-mediated experimental nephrotoxicity: Evidence from serum, kidney and histopathological alterations. Front. Pharmacol. 2023 14 1218506 10.3389/fphar.2023.1218506 37521462 PMC10372487 167 Heng A.H.S. Han C.W. Abbott C. McColl S.R. Comerford I. Chemokine-driven migration of pro-inflammatory CD4 + Front. Immunol. 2022 13 817473 10.3389/fimmu.2022.817473 35250997 PMC8889115 168 McLaren P.J. Fellay J. HIV-1 and human genetic variation. Nat. Rev. Genet. 2021 22 10 645 657 10.1038/s41576-021-00378-0 34168330 PMC8223526 169 Nekić J. Stanković Matić I. Rački V. Janko Labinac D. Vuletić V. Kapović M. Ristić S. Peterlin B. Starčević Čizmarević N. CCR5 Δ32 and CTLA-4 +49 A/G gene polymorphisms and interferon-β treatment response in croatian and slovenian multiple sclerosis patients. Int. J. Mol. Sci. 2024 25 13 7412 10.3390/ijms25137412 39000519 PMC11242381 170 Sobhani N. Tardiel-Cyril D.R. Davtyan A. Generali D. Roudi R. Li Y. CTLA-4 in regulatory T cells for cancer immunotherapy. Cancers (Basel) 2021 13 6 1440 10.3390/cancers13061440 33809974 PMC8005092 171 Crepeau R.L. Ford M.L. Challenges and opportunities in targeting the CD28/CTLA-4 pathway in transplantation and autoimmunity. Expert Opin. Biol. Ther. 2017 17 8 1001 1012 10.1080/14712598.2017.1333595 28525959 PMC5590720 172 Daei Sorkhabi A. Komijani E. Sarkesh A. Ghaderi Shadbad P. Aghebati-Maleki A. Aghebati-Maleki L. Advances in immune checkpoint-based immunotherapies for multiple sclerosis: rationale and practice. Cell Commun. Signal. 2023 21 1 321 10.1186/s12964-023-01289-9 37946301 PMC10634124 173 Basile M.S. Bramanti P. Mazzon E. The role of cytotoxic T-lymphocyte antigen 4 in the pathogenesis of multiple sclerosis. Genes (Basel) 2022 13 8 1319 10.3390/genes13081319 35893056 PMC9394409 174 Wang Y. Tsuo K. Kanai M. Neale B.M. Martin A.R. Challenges and opportunities for developing more generalizable polygenic risk scores. Annu. Rev. Biomed. Data Sci. 2022 5 1 293 320 10.1146/annurev-biodatasci-111721-074830 35576555 PMC9828290 175 Salinas-Santander M.A. Cantu-Salinas C.S. Ocampo-Candiani J. Suarez-Valencia V.J. Ramirez-Guerrero J.G. Sanchez-Dominguez C.N. CTLA4 +49AG (rs231775) and CT60 (rs3087243) gene variants are not associated with alopecia areata in a Mexican population from Monterrey Mexico. An. Bras. Dermatol. 2020 95 3 283 288 10.1016/j.abd.2020.03.001 32278632 PMC7253907 176 Das T. Chen Z. Hendriks R.W. Kool M. A20/Tumor necrosis factor α-induced protein 3 in immune cells controls development of autoinflammation and autoimmunity: Lessons from mouse models. Front. Immunol. 2018 9 104 10.3389/fimmu.2018.00104 29515565 PMC5826380 177 Jang D. Lee A.H. Shin H.Y. Song H.R. Park J.H. Kang T.B. Lee S.R. Yang S.H. The role of tumor necrosis factor alpha (TNF-α) in autoimmune disease and current TNF-α inhibitors in therapeutics. Int. J. Mol. Sci. 2021 22 5 2719 10.3390/ijms22052719 33800290 PMC7962638 178 Hoffjan S. Okur A. Epplen J.T. Wieczorek S. Chan A. Akkad D.A. Association of TNFAIP 3 TNFRSF 1A Int. J. Immunogenet. 2015 42 2 106 110 10.1111/iji.12183 25684197 179 Gross C.C. Schulte-Mecklenbeck A. Rünzi A. Kuhlmann T. Posevitz-Fejfár A. Schwab N. Schneider-Hohendorf T. Herich S. Held K. Konjević M. Hartwig M. Dornmair K. Hohlfeld R. Ziemssen T. Klotz L. Meuth S.G. Wiendl H. Impaired NK-mediated regulation of T-cell activity in multiple sclerosis is reconstituted by IL-2 receptor modulation. Proc. Natl. Acad. Sci. USA 2016 113 21 E2973 E2982 10.1073/pnas.1524924113 27162345 PMC4889377 180 Hafler J.P. Maier L.M. Cooper J.D. Plagnol V. Hinks A. Simmonds M.J. Stevens H.E. Walker N.M. Healy B. Howson J.M.M. Maisuria M. Duley S. Coleman G. Gough S.C.L. Worthington J. Kuchroo V.K. Wicker L.S. Todd J.A. CD226 Gly307Ser association with multiple autoimmune diseases. Genes Immun. 2009 10 1 5 10 10.1038/gene.2008.82 18971939 PMC2635550 181 Maiti A.K. Kim-Howard X. Viswanathan P. Guillén L. Qian X. Rojas-Villarraga A. Sun C. Cañas C. Tobón G.J. Matsuda K. Shen N. Cherñavsky A.C. Anaya J.M. Nath S.K. Non-synonymous variant (Gly307Ser) in CD226 is associated with susceptibility to multiple autoimmune diseases. Rheumatology (Oxford) 2010 49 7 1239 1244 10.1093/rheumatology/kep470 20338887 PMC2909799 182 Piédavent-Salomon M. Willing A. Engler J.B. Steinbach K. Bauer S. Eggert B. Ufer F. Kursawe N. Wehrmann S. Jäger J. Reinhardt S. Friese M.A. Multiple sclerosis associated genetic variants of CD226 Brain 2015 138 11 3263 3274 10.1093/brain/awv256 26359290 183 Huang Z. Qi G. Miller J.S. Zheng S.G. CD226: An emerging role in immunologic diseases. Front. Cell Dev. Biol. 2020 8 564 10.3389/fcell.2020.00564 32850777 PMC7396508 184 Dendrou C.A. Cortes A. Shipman L. Evans H.G. Attfield K.E. Jostins L. Barber T. Kaur G. Kuttikkatte S.B. Leach O.A. Desel C. Faergeman S.L. Cheeseman J. Neville M.J. Sawcer S. Compston A. Johnson A.R. Everett C. Bell J.I. Karpe F. Ultsch M. Eigenbrot C. McVean G. Fugger L. Resolving TYK2 Sci. Transl. Med. 2016 8 363 363ra149 10.1126/scitranslmed.aag1974 27807284 PMC5737835 185 Gorman J.A. Hundhausen C. Kinsman M. Arkatkar T. Allenspach E.J. Clough C. West S.E. Thomas K. Eken A. Khim S. Hale M. Oukka M. Jackson S.W. Cerosaletti K. Buckner J.H. Rawlings D.J. The TYK2 Front. Immunol. 2019 10 363 44 10.3389/fimmu.2019.00044 30740104 PMC6355696 186 Tao J.H. Zou Y.F. Feng X.L. Li J. Wang F. Pan F.M. Ye D.Q. Meta-analysis of TYK2 gene polymorphisms association with susceptibility to autoimmune and inflammatory diseases. Mol. Biol. Rep. 2011 38 7 4663 4672 10.1007/s11033-010-0601-5 21140222 187 Pellenz F.M. Dieter C. Lemos N.E. Bauer A.C. Souza B.M. Crispim D. Association of TYK2 polymorphisms with autoimmune diseases: A comprehensive and updated systematic review with meta-analysis. Genet. Mol. Biol. 2021 44 2 e20200425 10.1590/1678-4685-gmb-2020-0425 33949620 PMC8097517 188 Jensen L.T. Attfield K.E. Feldmann M. Fugger L. Allosteric TYK2 inhibition: Redefining autoimmune disease therapy beyond JAK1-3 inhibitors. EBioMedicine 2023 97 104840 10.1016/j.ebiom.2023.104840 37863021 PMC10589750 189 Zanin N. Viaris de Lesegno C. Lamaze C. Blouin C.M. Interferon receptor trafficking and signaling: Journey to the cross roads. Front. Immunol. 2021 11 615603 10.3389/fimmu.2020.615603 33552080 PMC7855707 190 O’Shea J.J. Plenge R. JAK and STAT signaling molecules in immunoregulation and immune-mediated disease. Immunity 2012 36 4 542 550 10.1016/j.immuni.2012.03.014 22520847 PMC3499974 191 Deng Y.N. Bellanti J.A. Zheng S.G. Essential kinases and transcriptional regulators and their roles in autoimmunity. Biomolecules 2019 9 4 145 10.3390/biom9040145 30974919 PMC6523499 192 Putlyaeva L.V. Schwartz A.M. Klepikova A.V. Vorontsov I.E. Kulakovskiy I.V. Kuprash D.V. The minor variant of the single-nucleotide polymorphism rs3753381 affects the activity of a SLAMF1 enhancer. Acta Nat. (Engl. Ed.) 2017 9 3 94 102 10.32607/20758251-2017-9-3-94-102 29104781 PMC5662279 193 Chen S.D. Li H.Q. Shen X.N. Li J.Q. Xu W. Huang Y.Y. Tan L. Dong Q. Yu J.T. Genome-wide association study identifies SLAMF1 affecting the rate of memory decline. J. Alzheimers Dis. 2020 74 1 139 149 10.3233/JAD-191214 31985465 194 Yigit B. Wang N. Herzog R.W. Terhorst C. SLAMF6 in health and disease: Implications for therapeutic targeting. Clin. Immunol. 2019 204 3 13 10.1016/j.clim.2018.10.013 30366106 PMC8969216 195 Maier L.M. Lowe C.E. Cooper J. Downes K. Anderson D.E. Severson C. Clark P.M. Healy B. Walker N. Aubin C. Oksenberg J.R. Hauser S.L. Compston A. Sawcer S. De Jager P.L. Wicker L.S. Todd J.A. Hafler D.A. IL2RA genetic heterogeneity in multiple sclerosis and type 1 diabetes susceptibility and soluble interleukin-2 receptor production. PLoS Genet. 2009 5 1 e1000322 10.1371/journal.pgen.1000322 19119414 PMC2602853 196 Gregory A.P. Dendrou C.A. Attfield K.E. Haghikia A. Xifara D.K. Butter F. Poschmann G. Kaur G. Lambert L. Leach O.A. Prömel S. Punwani D. Felce J.H. Davis S.J. Gold R. Nielsen F.C. Siegel R.M. Mann M. Bell J.I. McVean G. Fugger L. TNF receptor 1 genetic risk mirrors outcome of anti-TNF therapy in multiple sclerosis. Nature 2012 488 7412 508 511 10.1038/nature11307 22801493 PMC4268493 197 Tang T. Cheng X. Truong B. Sun L. Yang X. Wang H. Molecular basis and therapeutic implications of CD40/CD40L immune checkpoint. Pharmacol. Ther. 2021 219 107709 10.1016/j.pharmthera.2020.107709 33091428 PMC7886970 198 Igo R.P. Jr Kinzy T.G. Cooke Bailey J.N. Genetic Risk Scores. Curr. Protoc. Hum. Genet. 2019 104 1 e95 10.1002/cphg.95 31765077 PMC6941594 199 Choi S.W. Mak T.S.H. O’Reilly P.F. Tutorial: a guide to performing polygenic risk score analyses. Nat. Protoc. 2020 15 9 2759 2772 10.1038/s41596-020-0353-1 32709988 PMC7612115 200 Lin J. Zhou J. Xu Y. Potential drug targets for multiple sclerosis identified through Mendelian randomization analysis. Brain 2023 146 8 3364 3372 10.1093/brain/awad070 36864689 PMC10393411 201 Marees A.T. de Kluiver H. Stringer S. Vorspan F. Curis E. Marie-Claire C. Derks E.M. A tutorial on conducting genome-wide association studies: Quality control and statistical analysis. Int. J. Methods Psychiatr. Res. 2018 27 2 e1608 10.1002/mpr.1608 29484742 PMC6001694 202 O’Connor L.J. Schoech A.P. Hormozdiari F. Gazal S. Patterson N. Price A.L. Extreme polygenicity of complex traits is explained by negative selection. Am. J. Hum. Genet. 2019 105 3 456 476 10.1016/j.ajhg.2019.07.003 31402091 PMC6732528 203 Schaid D.J. Chen W. Larson N.B. From genome-wide associations to candidate causal variants by statistical fine-mapping. Nat. Rev. Genet. 2018 19 8 491 504 10.1038/s41576-018-0016-z 29844615 PMC6050137 204 Lewis C.M. Vassos E. Polygenic risk scores: From research tools to clinical instruments. Genome Med. 2020 12 1 44 10.1186/s13073-020-00742-5 32423490 PMC7236300 205 Plomin R. von Stumm S. Polygenic scores: Prediction versus Mol. Psychiatry 2022 27 1 49 52 10.1038/s41380-021-01348-y 34686768 PMC8960389 206 Hone L. Giovannoni G. Dobson R. Jacobs B.M. Predicting multiple sclerosis: Challenges and opportunities. Front. Neurol. 2022 12 1 761973 10.3389/fneur.2021.761973 35211072 PMC8860835 207 Shams H. Shao X. Santaniello A. Kirkish G. Harroud A. Ma Q. Isobe N. Alexander J. Bove R. Baranzini S. Cree B.A.C. Caverzasi E. Cuneo R. Caillier S.J. Cooper T. Green A.J. Guo C-Y. Gelfand J.M. Gomez-O’shea R. Gupta S. Hollenbach J. Harms M. Henry R.G. Hauser S.L. Mendoza M. Oksenberg J.R. Papinutto N. Pleasure S. Powers K. Renschen A. Santaniello A. Sabatino J.J. Jr Stern W.A. Wilson M.R. Zamvil S.S. Schaefer C.A. McCauley J.L. Cree B.A.C. Didonna A. Baranzini S.E. Patsopoulos N.A. Hauser S.L. Barcellos L.F. Henry R.G. Oksenberg J.R. Polygenic risk score association with multiple sclerosis susceptibility and phenotype in Europeans. Brain 2023 146 2 645 656 10.1093/brain/awac092 35253861 PMC10169285 208 Slunecka J.L. van der Zee M.D. Beck J.J. Johnson B.N. Finnicum C.T. Pool R. Hottenga J.J. de Geus E.J.C. Ehli E.A. Implementation and implications for polygenic risk scores in healthcare. Hum. Genomics 2021 15 1 46 10.1186/s40246-021-00339-y 34284826 PMC8290135 209 Selzam S. Ritchie S.J. Pingault J.B. Reynolds C.A. O’Reilly P.F. Plomin R. Comparing within- and between-family polygenic score prediction. Am. J. Hum. Genet. 2019 105 2 351 363 10.1016/j.ajhg.2019.06.006 31303263 PMC6698881 210 Avinun R. Knafo A. Parenting as a reaction evoked by children’s genotype: A meta-analysis of children-as-twins studies. Pers. Soc. Psychol. Rev. 2014 18 1 87 102 10.1177/1088868313498308 23940232 211 Iaffaldano P. Portaccio E. Lucisano G. Simone M. Manni A. Guerra T. Paolicelli D. Betti M. De Meo E. Pastò L. Razzolini L. Rocca M.A. Ferrè L. Brescia Morra V. Patti F. Zaffaroni M. Gasperini C. De Luca G. Ferraro D. Granella F. Pozzilli C. Romano S. Gallo P. Bergamaschi R. Coniglio M.G. Lus G. Vianello M. Banfi P. Lugaresi A. Totaro R. Spitaleri D. Cocco E. Di Palma F. Maimone D. Valentino P. Torri Clerici V. Protti A. Maniscalco G.T. Salemi G. Pesci I. Aguglia U. Lepore V. Filippi M. Trojano M. Amato M.P. Ferraro E. Logullo F.O. Marfia G.A. Bombardi R. Nasuelli D. Bellantonio P. De Riz M. Gazzola P. Cavaletti G. Inglese M. Conte A. Tedeschi G. Di Sapio A. Leone A. Montepietra S. Marini B. Gatto M. Sessa M. Ferrò M.T. Rini A. Cargnelutti D. Mirabella M. Burlina A. Avolio C. Cavalla P. Rovaris M. Ardito B. Piantadosi C. Confalonieri P.A. Clerici R. Strumia S. De Robertis F. Quatrale R. Sinisi L. Fioretti C. Di Lazzaro V. Bucello S. Mancinelli L. Ribizzi G. Zarbo R. Grimaldi L.M.E. Corea F. Sidoti V. Massacesi L. Balgera R. Romano M.C. D’Andrea F. Ancona A.L. Pizzorno M. Rinalduzzi S. Passantino F. Capone L. Bianchi M. Venturi S. Trivelli G. Brichetto G. Fermi S. Bramanti P. Iodice R. Piras M.L. Celani M.G. Barone P. Tassinari T. Marson A. Clerico M. Banfi P. Solaro C. Multiple sclerosis progression and relapse activity in children. JAMA Neurol. 2024 81 1 50 58 10.1001/jamaneurol.2023.4455 38010712 PMC10682937 212 Jelenkovic A. Sund R. Hur Y.M. Yokoyama Y. Hjelmborg J.B. Möller S. Honda C. Magnusson P.K.E. Pedersen N.L. Ooki S. Aaltonen S. Stazi M.A. Fagnani C. D’Ippolito C. Freitas D.L. Maia J.A. Ji F. Ning F. Pang Z. Rebato E. Busjahn A. Kandler C. Saudino K.J. Jang K.L. Cozen W. Hwang A.E. Mack T.M. Gao W. Yu C. Li L. Corley R.P. Huibregtse B.M. Derom C.A. Vlietinck R.F. Loos R.J.F. Heikkilä K. Wardle J. Llewellyn C.H. Fisher A. McAdams T.A. Eley T.C. Gregory A.M. He M. Ding X. Bjerregaard-Andersen M. Beck-Nielsen H. Sodemann M. Tarnoki A.D. Tarnoki D.L. Knafo-Noam A. Mankuta D. Abramson L. Burt S.A. Klump K.L. Silberg J.L. Eaves L.J. Maes H.H. Krueger R.F. McGue M. Pahlen S. Gatz M. Butler D.A. Bartels M. van Beijsterveldt T.C.E.M. Craig J.M. Saffery R. Dubois L. Boivin M. Brendgen M. Dionne G. Vitaro F. Martin N.G. Medland S.E. Montgomery G.W. Swan G.E. Krasnow R. Tynelius P. Lichtenstein P. Haworth C.M.A. Plomin R. Bayasgalan G. Narandalai D. Harden K.P. Tucker-Drob E.M. Spector T. Mangino M. Lachance G. Baker L.A. Tuvblad C. Duncan G.E. Buchwald D. Willemsen G. Skytthe A. Kyvik K.O. Christensen K. Öncel S.Y. Aliev F. Rasmussen F. Goldberg J.H. Sørensen T.I.A. Boomsma D.I. Kaprio J. Silventoinen K. Genetic and environmental influences on height from infancy to early adulthood: An individual-based pooled analysis of 45 twin cohorts. Sci. Rep. 2016 6 1 28496 10.1038/srep28496 27333805 PMC4917845 213 Ahmadzadeh Y.I. Schoeler T. Han M. Pingault J.B. Creswell C. McAdams T.A. Systematic review and meta-analysis of genetically informed research: Associations between parent anxiety and offspring internalizing problems. J. Am. Acad. Child Adolesc. Psychiatry 2021 60 7 823 840 10.1016/j.jaac.2020.12.037 33675965 PMC8259118 214 Willis M.D. Robertson N.P. Multiple sclerosis: Early indicators of disease and assessing future risk. J. Neurol. 2020 267 11 3436 3438 10.1007/s00415-020-10239-1 33030606 PMC7578118 215 Dobson R. Rice D.R. D’hooghe M. Horne R. Learmonth Y. Mateen F.J. Marck C.H. Reyes S. Williams M.J. Giovannoni G. Ford H.L. Social determinants of health in multiple sclerosis. Nat. Rev. Neurol. 2022 18 12 723 734 10.1038/s41582-022-00735-5 36369488 PMC9651126 216 Ginsburg O. Yip C.H. Brooks A. Cabanes A. Caleffi M. Dunstan Yataco J.A. Gyawali B. McCormack V. McLaughlin de Anderson M. Mehrotra R. Mohar A. Murillo R. Pace L.E. Paskett E.D. Romanoff A. Rositch A.F. Scheel J.R. Schneidman M. Unger-Saldaña K. Vanderpuye V. Wu T.Y. Yuma S. Dvaladze A. Duggan C. Anderson B.O. Breast cancer early detection: A phased approach to implementation. Cancer 2020 126 S10 Suppl. 10 2379 2393 10.1002/cncr.32887 32348566 PMC7237065 217 Filippi M. Amato M.P. Centonze D. Gallo P. Gasperini C. Inglese M. Patti F. Pozzilli C. Preziosa P. Trojano M. Early use of high-efficacy disease-modifying therapies makes the difference in people with multiple sclerosis: an expert opinion. J. Neurol. 2022 269 10 5382 5394 10.1007/s00415-022-11193-w 35608658 PMC9489547 218 Gajofatto A. Benedetti M.D. Treatment strategies for multiple sclerosis: When to start, when to change, when to stop? World J. Clin. Cases 2015 3 7 545 555 10.12998/wjcc.v3.i7.545 26244148 PMC4517331 219 Cross B. Turner R. Pirmohamed M. Polygenic risk scores: An overview from bench to bedside for personalised medicine. Front. Genet. 2022 13 1000667 10.3389/fgene.2022.1000667 36437929 PMC9692112 220 Uginet M. Lefeuvre L. Lerusse J. Pot C. Du Pasquier R. Lalive P.H. Traitements de la sclérose en plaques :mise à jour. Rev. Med. Suisse 2024 20 871 837 842 10.53738/REVMED.2024.20.871.837 38665104 221 Chataway J. Williams T. Li V. Marrie R.A. Ontaneda D. Fox R.J. Clinical trials for progressive multiple sclerosis: progress, new lessons learned, and remaining challenges. Lancet Neurol. 2024 23 3 277 301 10.1016/S1474-4422(24)00027-9 38365380 222 Ascherio A. Munger K.L. Lünemann J.D. The initiation and prevention of multiple sclerosis. Nat. Rev. Neurol. 2012 8 11 602 612 10.1038/nrneurol.2012.198 23045241 PMC4467212 223 de Mol C.L. Jansen P.R. Muetzel R.L. Knol M.J. Adams H.H. Jaddoe V.W. Vernooij M.W. Hintzen R.Q. White T.J. Neuteboom R.F. Polygenic multiple sclerosis risk and population-based childhood brain imaging. Ann. Neurol. 2020 87 5 774 787 10.1002/ana.25717 32162725 PMC7187244 224 Qassim A. Souzeau E. Hollitt G. Hassall M.M. Siggs O.M. Craig J.E. Risk stratification and clinical utility of polygenic risk scores in ophthalmology. Transl. Vis. Sci. Technol. 2021 10 6 14 10.1167/tvst.10.6.14 34111261 PMC8114010 225 Eeltink E. van der Horst M.Z. Zinkstok J.R. Aalfs C.M. Luykx J.J. Polygenic risk scores for genetic counseling in psychiatry: Lessons learned from other fields of medicine. Neurosci. Biobehav. Rev. 2021 121 119 127 10.1016/j.neubiorev.2020.11.021 33301779 226 Maxim L.D. Niebo R. Utell M.J. Screening tests: A review with examples. Inhal. Toxicol. 2014 26 13 811 828 10.3109/08958378.2014.955932 25264934 PMC4389712 227 Nair B. Clinical trial designs. Indian Dermatol. Online J. 2019 10 2 193 201 10.4103/idoj.IDOJ_475_18 30984604 PMC6434767 228 Lambert S.A. Abraham G. Inouye M. Towards clinical utility of polygenic risk scores. Hum. Mol. Genet. 2019 28 R2 R133 R142 10.1093/hmg/ddz187 31363735 229 Strianese O. Rizzo F. Ciccarelli M. Galasso G. D’Agostino Y. Salvati A. Del Giudice C. Tesorio P. Rusciano M.R. Precision and personalized medicine: how genomic approach improves the management of cardiovascular and neurodegenerative disease. Genes (Basel) 2020 11 7 747 10.3390/genes11070747 32640513 PMC7397223 230 Bader C. Cossin S. Maillard A. Bénard A. A new approach for sample size calculation in cost-effectiveness studies based on value of information. BMC Med. Res. Methodol. 2018 18 1 113 10.1186/s12874-018-0571-1 30348087 PMC6198488 231 Zeinomar N. Chung W.K. Cases in precision medicine: the role of polygenic risk scores in breast cancer risk assessment. Ann. Intern. Med. 2021 174 3 408 412 10.7326/M20-5874 33253037 PMC7965355 232 Rippe J.M. Lifestyle strategies for risk factor reduction, prevention, and treatment of cardiovascular disease. Am. J. Lifestyle Med. 2019 13 2 204 212 10.1177/1559827618812395 30800027 PMC6378495 233 Gudapati S. Chaudhari K. Shrivastava D. Yelne S. Advancements and applications of preimplantation genetic testing in in vitro Cureus 2024 16 3 e57357 10.7759/cureus.57357 38694414 PMC11061269 234 Chitnis T. Prat A. A roadmap to precision medicine for multiple sclerosis. Mult. Scler. 2020 26 5 522 532 10.1177/1352458519881558 31965904 235 Reay W.R. Atkins J.R. Carr V.J. Green M.J. Cairns M.J. Pharmacological enrichment of polygenic risk for precision medicine in complex disorders. Sci. Rep. 2020 10 1 879 10.1038/s41598-020-57795-0 31964963 PMC6972917 236 Johnson K.B. Wei W.Q. Weeraratne D. Frisse M.E. Misulis K. Rhee K. Zhao J. Snowdon J.L. Precision medicine, AI, and the future of personalized health care. Clin. Transl. Sci. 2021 14 1 86 93 10.1111/cts.12884 32961010 PMC7877825 237 Hadley T.D. Agha A.M. Ballantyne C.M. How do we incorporate polygenic risk scores in cardiovascular disease risk asessment and management? Curr. Atheroscler. Rep. 2021 23 6 28 10.1007/s11883-021-00915-6 33791884 PMC8183125 238 Ormond K.E. Borensztein M.J. Hallquist M.L.G. Buchanan A.H. Faucett W.A. Peay H.L. Smith M.E. Tricou E.P. Uhlmann W.R. Wain K.E. Coughlin C.R. II Defining the critical components of informed consent for genetic testing. J. Pers. Med. 2021 11 12 1304 10.3390/jpm11121304 34945775 PMC8706495 239 Bischof A. Papinutto N. Keshavan A. Rajesh A. Kirkish G. Zhang X. Mallott J.M. Asteggiano C. Sacco S. Gundel T.J. Zhao C. Stern W.A. Caverzasi E. Zhou Y. Gomez R. Ragan N.R. Santaniello A. Zhu A.H. Juwono J. Bevan C.J. Bove R.M. Crabtree E. Gelfand J.M. Goodin D.S. Graves J.S. Green A.J. Oksenberg J.R. Waubant E. Wilson M.R. Zamvil S.S. Cree B.A.C. Hauser S.L. Henry R.G. Spinal cord atrophy predicts progressive disease in relapsing multiple sclerosis. Ann. Neurol. 2022 91 2 268 281 10.1002/ana.26281 34878197 PMC8916838 240 Mishra S. Bapuraj J. Srinivasan A. Multiple sclerosis part 2. Magn. Reson. Imaging Clin. N. Am. 2024 32 2 221 231 10.1016/j.mric.2024.01.002 38555138 241 Cano-Gamez E. Trynka G. From GWAS to function: Using functional genomics to identify the mechanisms underlying complex diseases. Front. Genet. 2020 11 9 424 10.3389/fgene.2020.00424 32477401 PMC7237642 242 Muhammad I.I. Kong S.L. Akmar Abdullah S.N. Munusamy U. RNA-seq and ChIP-seq as complementary approaches for comprehension of plant transcriptional regulatory mechanism. Int. J. Mol. Sci. 2019 21 1 167 10.3390/ijms21010167 31881735 PMC6981605 243 Satam H. Joshi K. Mangrolia U. Waghoo S. Zaidi G. Rawool S. Thakare R.P. Banday S. Mishra A.K. Das G. Malonia S.K. Next-Generation sequencing technology: Current trends and advancements. Biology (Basel) 2023 12 7 997 10.3390/biology12070997 37508427 PMC10376292 244 Manzoni C. Kia D.A. Vandrovcova J. Hardy J. Wood N.W. Lewis P.A. Ferrari R. Genome, transcriptome and proteome: The rise of omics data and their integration in biomedical sciences. Brief. Bioinform. 2018 19 2 286 302 10.1093/bib/bbw114 27881428 PMC6018996 245 Libbrecht M.W. Noble W.S. Machine learning applications in genetics and genomics. Nat. Rev. Genet. 2015 16 6 321 332 10.1038/nrg3920 25948244 PMC5204302 246 Blayney J.W. Francis H. Rampasekova A. Camellato B. Mitchell L. Stolper R. Cornell L. Babbs C. Boeke J.D. Higgs D.R. Kassouf M. Super-enhancers include classical enhancers and facilitators to fully activate gene expression. Cell 2023 186 26 5826 5839.e18 10.1016/j.cell.2023.11.030 38101409 PMC10858684 247 Goodin D.S. Khankhanian P. Gourraud P.A. Vince N. Genetic susceptibility to multiple sclerosis: Interactions between conserved extended haplotypes of the MHC and other susceptibility regions. BMC Med. Genomics 2021 14 1 183 10.1186/s12920-021-01018-6 34246256 PMC8272333 248 White M.J. Yaspan B.L. Veatch O.J. Goddard P. Risse-Adams O.S. Contreras M.G. Strategies for pathway analysis using GWAS and WGS data. Curr. Protoc. Hum. Genet. 2019 100 1 e79 10.1002/cphg.79 30387919 PMC6391732 249 Harty B.L. Coelho F. Pease-Raissi S.E. Mogha A. Ackerman S.D. Herbert A.L. Gereau R.W. IV Golden J.P. Lyons D.A. Chan J.R. Monk K.R. Myelinating Schwann cells ensheath multiple axons in the absence of E3 ligase component Fbxw7. Nat. Commun. 2019 10 1 2976 10.1038/s41467-019-10881-y 31278268 PMC6611888 250 Slim L. Chatelain C. Foucauld H. Azencott C.A. A systematic analysis of gene–gene interaction in multiple sclerosis. BMC Med. Genomics 2022 15 1 100 10.1186/s12920-022-01247-3 35501860 PMC9063218 251 Olsson T. Barcellos L.F. Alfredsson L. Interactions between genetic, lifestyle and environmental risk factors for multiple sclerosis. Nat. Rev. Neurol. 2017 13 1 25 36 10.1038/nrneurol.2016.187 27934854 252 Hedström A.K. Sundqvist E. Bäärnhielm M. Nordin N. Hillert J. Kockum I. Olsson T. Alfredsson L. Smoking and two human leukocyte antigen genes interact to increase the risk for multiple sclerosis. Brain 2011 134 3 653 664 10.1093/brain/awq371 21303861 253 Virolainen S.J. VonHandorf A. Viel K.C.M.F. Weirauch M.T. Kottyan L.C. Gene–environment interactions and their impact on human health. Genes Immun. 2022 24 1 1 11 10.1038/s41435-022-00192-6 36585519 PMC9801363 254 Kahlert J. Gribsholt S. B. Gammelager H. Dekkers O. M. Luta G. Control of confounding in the analysis phase - an overview for clinicians. Clin. Epidemiol. 2017 9 195 204 10.2147/CLEP.S129886 28408854 PMC5384727 255 Axisa P.P. Hafler D.A. Multiple sclerosis. Curr. Opin. Neurol. 2016 29 3 345 353 10.1097/WCO.0000000000000319 27058221 PMC7882195 256 Hasin Y. Seldin M. Lusis A. Multi-omics approaches to disease. Genome Biol. 2017 18 1 83 10.1186/s13059-017-1215-1 28476144 PMC5418815 257 Lowe R. Shirley N. Bleackley M. Dolan S. Shafee T. Transcriptomics technologies. PLOS Comput. Biol. 2017 13 5 e1005457 10.1371/journal.pcbi.1005457 28545146 PMC5436640 258 Shang Z. Sun W. Zhang M. Xu L. Jia X. Zhang R. Fu S. Identification of key genes associated with multiple sclerosis based on gene expression data from peripheral blood mononuclear cells. PeerJ 2020 8 e8357 10.7717/peerj.8357 32117605 PMC7003695 259 Kim D.Y. Kim J.M. Multi-omics integration strategies for animal epigenetic studies — A review. Anim. Biosci. 2021 34 8 1271 1282 10.5713/ab.21.0042 33902167 PMC8255897 260 Ho S.M. Johnson A. Tarapore P. Janakiram V. Zhang X. Leung Y.K. Environmental epigenetics and its implication on disease risk and health outcomes. ILAR J. 2012 53 3-4 289 305 10.1093/ilar.53.3-4.289 23744968 PMC4021822 261 Jendoubi T. Approaches to integrating metabolomics and multi-omics data: A primer. Metabolites 2021 11 3 184 10.3390/metabo11030184 33801081 PMC8003953 262 Al-Amrani S. Al-Jabri Z. Al-Zaabi A. Alshekaili J. Al-Khabori M. Proteomics: Concepts and applications in human medicine. World J. Biol. Chem. 2021 12 5 57 69 10.4331/wjbc.v12.i5.57 34630910 PMC8473418 263 Altieri C. Speranza B. Corbo M.R. Sinigaglia M. Bevilacqua A. Gut-Microbiota, and multiple sclerosis: Background, evidence, and perspectives. Nutrients 2023 15 4 942 10.3390/nu15040942 36839299 PMC9965298 264 Huang W.J. Chen W.W. Zhang X. Multiple sclerosis: Pathology, diagnosis and treatments. Exp. Ther. Med. 2017 13 6 3163 3166 10.3892/etm.2017.4410 28588671 PMC5450788 265 Hedström A.K. Olsson T. Alfredsson L. The increased risk of multiple sclerosis associated with HLA-DRB1*15:01 and smoking is modified by alcohol consumption. Sci. Rep. 2021 11 1 21237 10.1038/s41598-021-00578-y 34707149 PMC8551162 266 Kale N. Optic neuritis as an early sign of multiple sclerosis. Eye Brain 2016 8 195 202 10.2147/EB.S54131 28539814 PMC5398757 267 Filippi M. Rocca M.A. Ciccarelli O. De Stefano N. Evangelou N. Kappos L. Rovira A. Sastre-Garriga J. Tintorè M. Frederiksen J.L. Gasperini C. Palace J. Reich D.S. Banwell B. Montalban X. Barkhof F. MRI criteria for the diagnosis of multiple sclerosis: MAGNIMS consensus guidelines. Lancet Neurol. 2016 15 3 292 303 10.1016/S1474-4422(15)00393-2 26822746 PMC4760851 268 Bove R. Sutton P. Nicholas J. Women’s health and pregnancy in multiple sclerosis. Neurol. Clin. 2024 42 1 275 293 10.1016/j.ncl.2023.07.004 37980119 269 Ömerhoca S. Yazici Akkas S. Kale Icen N. Multiple sclerosis: Diagnosis and differrential diagnosis. Noro Psikiyatri Arsivi 2018 55 3 Suppl. 1 S1 S9 10.29399/npa.23418 30692847 PMC6278620 270 Paul A. Comabella M. Gandhi R. Biomarkers in mMultiple sclerosis. Cold Spring Harb. Perspect. Med. 2019 9 3 a029058 10.1101/cshperspect.a029058 29500303 PMC6396336 271 Parnell G.P. Booth D.R. The Multiple sclerosis (MS) genetic risk factors indicate both acquired and innate immune cell subsets contribute to ms pathogenesis and identify novel therapeutic opportunities. Front. Immunol. 2017 8 425 10.3389/fimmu.2017.00425 28458668 PMC5394466 272 Pardo G. Jones D.E. The sequence of disease-modifying therapies in relapsing multiple sclerosis: Safety and immunologic considerations. J. Neurol. 2017 264 12 2351 2374 10.1007/s00415-017-8594-9 28879412 PMC5688209 273 Yu X. Song L. Zheng H. Wei S. Wen X. Huang B. Liu D. Association between functional genetic variants in retinoid X receptor -α/γ Biosci. Rep. 2021 41 10 BSR20211338 10.1042/BSR20211338 34633445 PMC8529336 274 Henschke A. Desborough J. Parkinson A. Brunoro C. Fanning V. Lueck C. Brew-Sam N. Brüstle A. Drew J. Chisholm K. Elisha M. Suominen H. Tricoli A. Phillips C. Cook M. Personalizing medicine and technologies to address the experiences and needs of people with multiple sclerosis. J. Pers. Med. 2021 11 8 791 10.3390/jpm11080791 34442434 PMC8401762 275 Goetz L.H. Schork N.J. Personalized medicine: Motivation, challenges, and progress. Fertil. Steril. 2018 109 6 952 963 10.1016/j.fertnstert.2018.05.006 29935653 PMC6366451 276 Dara S. Dhamercherla S. Jadav S.S. Babu C.H.M. Ahsan M.J. Machine learning in drug discovery: A review. Artif. Intell. Rev. 2022 55 3 1947 1999 10.1007/s10462-021-10058-4 34393317 PMC8356896 277 Malgorzata M. Maria S. Michał W. Genetic testing—whether to allow complete freedom? Direct to consumer tests versus J. Appl. Genet. 2022 63 1 119 126 10.1007/s13353-021-00670-z 34826052 PMC8755658 278 Mulligan K. Baid D. Doctor J.N. Phelps C. Lakdawalla D.N. Risk preferences over health: Empirical estimates and implications for healthcare decision-making. SSRN 2023 2023 10.2139/ssrn.4533238 38232447 279 Franceschini N. Frick A. Kopp J.B. Genetic testing in clinical settings. Am. J. Kidney Dis. 2018 72 4 569 581 10.1053/j.ajkd.2018.02.351 29655499 PMC6153053 280 Hassan M. Awan F.M. Naz A. deAndrés-Galiana E.J. Alvarez O. Cernea A. Fernández-Brillet L. Fernández-Martínez J.L. Kloczkowski A. Innovations in genomics and big data analytics for personalized medicine and health care: A review. Int. J. Mol. Sci. 2022 23 9 4645 10.3390/ijms23094645 35563034 PMC9104788 281 Crews K.R. Cross S.J. McCormick J.N. Baker D.K. Molinelli A.R. Mullins R. Relling M.V. Hoffman J.M. Development and implementation of a pharmacist-managed clinical pharmacogenetics service. Am. J. Health Syst. Pharm. 2011 68 2 143 150 10.2146/ajhp100113 21200062 PMC3228517 282 Lopez D. Lopez D. Pharmacogenetics: An important part of drug development with a focus on its application. Int. J. Biomed. Investig. 2018 1 2 1 16 10.31531/2581-4745.1000111 32467882 PMC7255432 283 Ahmed S. Zhou Z. Zhou J. Chen S.Q. Pharmacogenomics of drug metabolizing enzymes and transporters: Relevance to precision medicine. Genom. Proteom. Bioinfor. 2016 14 5 298 313 10.1016/j.gpb.2016.03.008 27729266 PMC5093856 284 Oliveri S. Ferrari F. Manfrinati A. Pravettoni G. A systematic review of the psychological implications of genetic testing: a comparative analysis among cardiovascular, neurodegenerative and cancer diseases. Front. Genet. 2018 9 624 10.3389/fgene.2018.00624 30619456 PMC6295518 285 Williams M.J. Orlando C. Akisanya J. Amezcua L. Multiple sclerosis in black and hispanic populations. Neurol. Clin. 2024 42 1 295 317 10.1016/j.ncl.2023.06.005 37980120 286 McGowan M.L. Glinka A. Highland J. Asaad G. Sharp R.R. Genetics patients’ perspectives on clinical genomic testing. Per. Med. 2013 10 4 339 347 10.2217/pme.13.32 24955098 PMC4061708 287 Clarke A. Anticipated stigma and blameless guilt: Mothers’ evaluation of life with the sex-linked disorder, hypohidrotic ectodermal dysplasia (XHED). Soc. Sci. Med. 2016 158 141 148 10.1016/j.socscimed.2016.04.027 27140840 PMC4884667 288 Schrøder K. Assing Hvidt E. Emotional responses and support needs of healthcare professionals after adverse or traumatic experiences in healthcare—evidence from seminars on peer support. Int. J. Environ. Res. Public Health 2023 20 9 5749 10.3390/ijerph20095749 37174266 PMC10178493 289 Ayatollahi H. Hosseini S.F. Hemmat M. Integrating genetic data into electronic health records: medical geneticists’ perspectives. Healthc. Inform. Res. 2019 25 4 289 296 10.4258/hir.2019.25.4.289 31777672 PMC6859263 290 Martinez-Martin N. Magnus D. Privacy and ethical challenges in next-generation sequencing. Expert Rev. Precis. Med. Drug Dev. 2019 4 2 95 104 10.1080/23808993.2019.1599685 32775691 PMC7413244 Fig. (1) The interplay of genetic, immune, and environmental factors in MS pathogenesis. This diagram depicts the complex interaction among genetic, immune response, and environmental factors in the progression of MS. The diagram demonstrates that the aetiology of MS is complex. The figure illustrates how genetic predisposition, particularly in the MHC region, can impact MS risk. The genetic variants of HLA genes are divided into classes I, II, and III. A potent allele, HLA-DRB1*1501, is strongly associated with MS progression in class-II HLA genetic variants. The diverse environmental factors include EBV, vitamin D deficiency, smoking, gastric microbiome, stress, and location. These variables alter the function and activation of the immune system, initiating or aggravating MS symptoms. T cells, B cells, macrophages, and cytokines interact in a circular circuit during the immune response. The diagram illustrates how genetic predisposition and environmental factors can result in an abnormal immune response that infiltrates auto-reactive immune cells into the CNS. These cells demyelinate the myelin sheath, which protects nerve fibres, resulting in central inflammation and additional neurological impairments. In the development of MS, the figure highlights the complex interactions among genetic predisposition, environmental stimuli, and immune response dysregulation. It demonstrates that these three factors may contribute to oligodendrocyte degradation, MBP damage, and myelin damage, all of which increase the likelihood of developing the disease. Abbreviations: Fig. (2) Role of genetic variants in the progression of MS. The graphic diagram illustrates the significant role of specific genetic variations in advancing MS. The haplotypes rs2104286, rs11256593, rs6897932, rs4149584, rs1800693, rs1883832 T, and rs2300747 are associated with important immune-related genes. The discovered SNPs have been found to play a role in controlling the immune response, leading to alterations in the severity and progression of MS. The immunological regulation and cell communication processes require the participation of several molecules, including IL-2RA, IL-7RA, TNFRSF1A, CD40, and CD58. The capacity of genetic sequences to influence the functioning of immune cells, including T cells and antigen-presenting cells, can exert an effect on the pathogenesis and advancement of MS. Specific alleles within these genes, namely rs2104286 and rs11256593, induce T cell activation and CD25 expression in CD4+ cells, along with a modified immunological response, resulting in heightened inflammation and subsequent demyelination. The IL-7RA allele rs6897932 is associated with exon-6 skipping, leading to increased levels of IL-7R in the bloodstream and mRNA. This molecular alteration has been implicated in the development of neuroinflammation and demyelination. The interaction between Tumour Necrosis Factor (TNF) and its receptor TNFR1 leads to the activation of inflammatory responses, cell death, and disruption of the Blood-brain Barrier (BBB). These processes have a role in the evolution of MS. The genetic variations rs4149584 and rs1800693 in the TNFRSF1A gene are responsible for encoding the TNFR1 protein. The genetic variant rs1883832 represents a polymorphism located within the CD40 gene. T activation elicits a response in immune cells, leading to an increase in the production of pro-inflammatory cytokines. The genetic variant rs2300747 has been identified as a CD58 variant that has been found to enhance the presence of several immune cells, such as APC cells (including macrophages and dendritic cells), T cells, and NK cells. This variant is associated with an overexpression of pro-inflammatory cytokines, disrupting the immune system. Consequently, this disruption contributes to inflammation, demyelination, and neuronal damage characteristic of MS. Abbreviations: Fig. (3) Genetic variants associated with T-cell activation, B-cell function, and immune cell migration in MS progression. The diagram depicts the notable contributions of distinct genetic variations to the development of MS. The genetic variations included in this set comprise the haplotypes rs12708716, rs17445836G, rs10191329, rs10892307, CCR5-32, rs5742909, rs231775, rs3087243, and rs11571302. Every variant is correlated with specific elements of MS progression. The genetic variant CLE16A (rs12708716) has been associated with the control of the immune system. It can potentially affect the inflammatory response, which plays a role in the development and progression of MS. The genetic variant IRF8 (rs17445836G) regulates immune responses and can potentially influence the equilibrium between pro-inflammatory and anti-inflammatory signals in MS. The genetic variant DYSF-ZNF638 (rs10191329) can affect the mechanisms involved in brain repair, potentially altering the remyelination process and the integrity of neurons. These factors are known to have significant implications for the progression of MS. The genetic variant CXCR5 (rs10892307) has been found to correlate with the movement and positioning of B-cells inside the CNS. This relationship has the potential to impact the development of inflammatory lesions that are commonly associated with MS. The CCR5 (CCR5-Δ32) gene variant is linked to the migration of immune cells. It potentially impacts the infiltration of immune cells into the CNS, hence playing a role in the development of chronic inflammation observed in MS. The variations rs5742909, rs231775, rs3087243, and rs11571302 of the CTLA4 gene are associated with immunological modulation and T-cell responses. The modulation of CTLA-4 signalling can potentially affect the equilibrium between immunological activation and repression, exerting an influence on the overall progression of MS. Abbreviations: Fig. (4) Role of numerous genetics variants and their pathways in the progression of MS. The diagram depicts the correlation among the TYK2 gene Single Nucleotide Polymorphism (SNP) rs34536443, the CD226 SNP rs763361, and the DNM3-PIGC SNP rs149097173 in the context of neurodegenerative diseases, such as MS. TYK2, belonging to the Janus Kinase (JAK) family, has been identified as a potential hereditary candidate gene associated with autoimmune disorders due to its role in regulating signalling pathways for various cytokines, particularly type I interferon. The non-receptor protein TYK2 interacts with the inactive IFN-I Receptor (IFNAR1) located on the cellular membrane. The process of IFN-binding to IFNAR1 leads to the phosphorylation of STAT 1 and 2, activating the TYK2 and JAK1 proteins. Many genes triggered by Interferons (IFNs) are subject to tight regulation by heterodimers of STAT1 and STAT2 within the nucleus. Autoimmune diseases often arise due to aberrant production of Interferon type I (IFN-I), other cytokines, or members of the JAK kinase family by immune cells. TYK2 influences various cellular processes, including but not limited to its involvement in the IFN-I and other type I and II cytokine receptor pathways. Additionally, TYK2 has a role in modulating natural killer cell activity and regulating the production of B and Treg cells. Furthermore, TYK2 is involved in the differentiation of Th1 and Th17 cells. There exists a correlation between dysregulated expression of TYK2 and autoimmune diseases. The CD226 genetic variant rs763361 holds significance in the activation of regulatory T cells, which are pivotal in the aberrant regulation that contributes significantly to the etiopathogenesis of MS. T lymphocytes undergo activation inside the lymphatic system and subsequently infiltrate the CNS utilizing arterial circulation in the context of MS. Upon arrival, T cells secrete pro-inflammatory cytokines, thereby inducing inflammation and resulting in tissue damage. The process described results in the degradation of myelin, nerve fibres, and the oligodendrocytes responsible for myelin production. A potential relationship was identified between rs149097173 in the DNM3-PIGC gene and significant genetic enrichment in CNS tissues. Elevated expression of the rs149097173 allele was found to be associated with cortical and brain-stem damage, subsequently leading to demyelination and an increased risk of MS. Abbreviations: Table 1 Genetic variants and their possible mechanism of association with MS progression.  Sr. No.  Gene  Genetic Variants (SNPs)  Putative Mechanism Involved  Types of MS  References 1.   HLA-DRB1 HLA-DRB115:01 ↑ Influencing specific antigens presentation to immune cells and inappropriate immune response against self-antigens RRMS [ 48 2.   DYSF–ZNF638 rs10191329 ↓Median time to needing a walking aid; a median of 3.7 years (in homozygous carriers) Relapsing form of MS [ 30 3.   IL-2RA rs2104286 (intronic) Changes in the ratio of soluble to membrane-bound molecules + RRMS [ 70 195 4.   IL7R T2441 rs6897932 ↑ Exon 6 skipping RRMS [ 75 84 5.   TNFRSF1A P46L (rs1800693) (intron-6) ↑Lacking exon-6, altering the soluble/membrane-bound ratio; ↑> TNFR1 RRMS [ 86 89 196 6.   CD40 rs1883832 T CD40-CD40L interaction immune checkpoint RRMS [ 118 197 7.   CD58 rs2300747 (intronic) ↑Expression of CD58 in mononuclear cells of CIS and RRMS patients RRMS and CIS [ 93 8.   CLEC16A rs12708716 ↑ Levels of two distinct CLEC16A transcripts in the thymus (not in blood); splicing regulation may be cell- or thymus-specific Relapsing MS [ 138 9.   IRF8 rs17445836G (intronic) The variant is linked to: SPMS [ 145 10.   CXCR5 rs10892307 (intronic) Immunophenotyping using PBMCs; f expressing CXCR5 Relapsing MS [ 155 11.   CCR5 CCR5- Δ32 Receptor (shortened and non-functional) PPMS, RRMS, and SPMS [ 164 12.   CTLA4 −319C/T (rs5742909); +49A/G (rs231775); CT60A/G (rs3087243); Jo31G/T (rs11571302) Altered immunological response or autoimmune disease susceptibility RRMS, SPMS [ 172 13.   CD226 rs763361; rs727088 ↓Expression on memory T cells in MS patients Relapsing MS [ 182 14.  DNM3-PIGC rs149097173 ↑Genetic enrichment in CNS tissues RRMS [ 30 15.  TYK2 rs34536443 ↓Tfh cells, memory B cells, and IFNAR signalling RRMS [ 185 16.  SLAMF1 rs3753381 ↑Activity of SLAMF1 promotor b> twofold Relapsing MS [ 192 17.  TNFAIP3 rs10499194 Located in the intergenic region In vitro RRMS, SPMS [ 178 18.  EV15 rs10735781 Alters affinity for binding of PAX6 transcription factors RRMS [ 44 Note: Abbreviations: Table 2 PRS and their association with the MS disease progression.  Sr. No.  Variables  Description  References 1. PRS - Utilization of GWAS summary data [ 15 2. Calculation steps -Selection of single SNPs [ 199 202 3. Utility in assessing MS risk -Determine an individual's genetic susceptibility to MS [ 204 4. Predictive power ↑PRS score indicates ↑MS risk [ 206 5. Early identification -Aids in early MS risk identification [ 214 6. DMTs -Early initiation of DMTs based on high PRS [ 218 7. Clinical trial design -Enrichment of clinical trial populations [ 208 8. Counselling and education -Contributes to genetic counselling [ 225 9. Precision medicine -Guides personalized treatments [ 234 10. Considerations -Should be combined with clinical evaluation and other factors for comprehensive risk assessment [ 204 Note: Abbreviations: ",
  "metadata": {
    "Title of this paper": "Privacy and ethical challenges in next-generation sequencing.",
    "Journal it was published in:": "Endocrine, Metabolic & Immune Disorders Drug Targets",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481567/"
  }
}