{
  "title": "Paper_221",
  "abstract": "pmc Environ Microbiol Environ Microbiol 379 blackwellopen EMI Environmental Microbiology 1462-2912 1462-2920 pmc-is-collection-domain yes pmc-collection-title Wiley Open Access Collection PMC12488536 PMC12488536.1 12488536 12488536 41034185 10.1111/1462-2920.70184 EMI70184 7068917 1 Review Review Micropollutants and Their Interactions With Relevant Environmental Viruses Pavi Catielen Paula https://orcid.org/0000-0003-2506-3772  1 Elois Mariana Alves https://orcid.org/0000-0003-2986-6900  1 Jempierre Yasmin Ferreira Souza Hoffmann https://orcid.org/0000-0002-5805-9510  1 Cadamuro Rafael Dorighello https://orcid.org/0009-0007-7890-9512  1 Savi Beatriz Pereira https://orcid.org/0000-0002-7948-6212  1 Pilati Giulia Von Tönnemann https://orcid.org/0000-0001-9689-0279  1 Fongaro Gislaine https://orcid.org/0000-0001-5596-3320  1 gislainefongaro@gmail.com   1 Laboratory of Applied Virology, Department of Microbiology, Immunology and Parasitology Federal University of Santa Catarina Florianópolis Brazil * Correspondence: gislainefongaro@gmail.com 01 10 2025 10 2025 27 10 498134 10.1111/emi.v27.10 e70184 07 9 2025 09 5 2025 22 9 2025 02 10 2025 03 10 2025 03 10 2025 © 2025 The Author(s). Environmental Microbiology https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ ABSTRACT Emerging pollutants encompass a diverse array of chemicals classified as micropollutants, including pharmaceuticals and microplastics (MPs). Viruses are known to adsorb onto MPs, including binding to bacterial biofilms that form the plastisphere. In this review, we conducted an extensive bibliographic survey to critically assess the potential interactions between micropollutants, such as MPs, organic micropollutants and viruses in aquatic environments, within the One Health context. The interaction between viruses and bacterial cell wall components can increase the infectivity and thermal stability of viral particles, which thrive on biofilms commonly found on MPs in aquatic systems. MPs, acting as viral vectors, can impact viral life cycles, survival, transmission and interaction with hosts, posing significant risks to human, animal and environmental health. There is a clear need for additional practical studies to understand how viruses remain stable when in contact with micropollutants. This field of research provides opportunities to better understand the broader impacts of these interactions, including the potential for new viral outbreaks due to the prolonged persistence of pathogens in the environment. Environmental micropollutants increase virus stability. environmental micropollutants microplastic pharmaceuticals virus interactions Coordenação de Aperfeiçoamento de Pessoal de Nível Superior 10.13039/501100002322 88887932144/2024‐00 Conselho Nacional de Desenvolvimento Científico e Tecnológico 10.13039/501100003593 304434‐2023‐0 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:01.10.2025  Pavi C. P. M. A. Elois Y. F. S. H. Jempierre 2025 Micropollutants and Their Interactions With Relevant Environmental Viruses Environmental Microbiology 27 10 e70184 10.1111/1462-2920.70184 41034185 PMC12488536  Funding: 1 Introduction Recently, the adverse effects of uncontrolled human development have increasingly demonstrated the need for mitigation actions that prevent environmental catastrophes. These catastrophes, often resulting from unsustainable practices, have led to significant losses in industry, agriculture and urban infrastructure. The high requirements of resources from society contribute to the pollution of the air, soil and water. Sources of contamination encompass a variety of pollutants, including greenhouse gases, chemicals, nutrients, oil spills, pesticides, the proliferation of disposable goods and non‐biodegradable materials (Gavrilescu et al. 2015 Emerging pollutants encompass a range of chemicals classified as micropollutants, such as pesticides, cosmetics, household products and pharmaceuticals. Various of these chemicals are persistent or pseudo‐persistent in the environment due to their slow degradation and continuous release. Their toxicity affects human health as well as aquatic and terrestrial ecosystems. Because of this, it's fundamental to understand their occurrence, how they are distributed into the environment, their degradation, toxicity and bioaccumulation (Aryal et al. 2020 2022 Additionally, plastic materials are one of the most useful materials present in many anthropogenic activities, and their extensive use contributes to plastic pollution in the environment. Plastics are continually degraded by environmental factors such as exposure to light and rain, resulting in the formation of microplastics (MPs) and nanoplastics (NPs). MPs typically arise from primary or secondary sources, while NPs may originate from primary sources via industrial manufacturing processes or secondary sources through the successive fragmentation and weathering of microplastics (Tumwesigye et al. 2023 Worldwide, 13 million tons of plastic waste are dumped into rivers and oceans each year. Furthermore, it is intriguing that MPs can act as carriers of organic micropollutants, resulting in their accumulation in aquatic organisms and the food chain (Scopetani et al. 2018 2025 2021 Due to the global presence of plastic in the environment and characteristics of these materials, studies have been describing the capacity of MPs to sorb and accumulate organic and inorganic contaminants (L. Fu et al. 2021 2022 2023 The ions adsorbed on the surface of the MPs can serve as nutrients for bacterial development. The weathered surface facilitates biofilm formation, leading to the formation of microorganism communities (e.g., fungi, bacteria, viruses) designated as ‘plastisphere’ (Yang et al. 2023 2022 Besides that, viruses can also adsorb to MPs, including adsorption onto the bacterial plastisphere. Moresco et al. proved, by plaque assay, that rotavirus associated with biofilm has its viral particles protected, reducing their inactivation over time (Moresco et al. 2022 2022 Myoviridae Siphoviridae Podoviridae 2022 2022 Furthermore, wastewater is widely known as a rich environment that can carry numerous microorganisms, including pathogens. The presence of MPs in sewage may increase the likelihood of forming a viral plastisphere, which refers to the association of viruses present in the environment with the microbial communities already adsorbed on MPs (e.g., bacteria, fungi). This interaction can enhance the stability of various viruses, which is a global concern regarding the spread of new infection outbreaks (Reeves et al. 2023 In this review, we conducted a comprehensive literature survey to critically evaluate the potential interactions between micropollutants—such as MPs and organic micropollutants—and pathogens, particularly viruses, in aquatic environments within the One Health context. 2 Micropollutants Micropollutants represent a diverse range of environmental contaminants, often characterised by their low concentrations, which can be in the order of micrograms per litre or less (10 −6 −3 2022 2015 2024 2022 Monitoring programmes demonstrate that micropollutant concentrations can vary across different urban areas (Wicke et al. 2021 2021 It is concerning that these substances are not included in national water quality guidelines (Quadra et al. 2021 2018 2023 Indeed, activities such as vehicular exhaust emission, construction, burning of waste and other industrial activities can increase environmental air pollution, leading to adverse effects on human populations (Kumar et al. 2021 2012 It is known that air pollution can be toxic to human health, contributing to issues with reproductive functions, neurological disorders and inflammatory effects (Fu et al. 2022 2021 2020 Regarding ecosystems, studies show that nitrogen oxides are decreasing pollinating insects by chemically altering floral odours, which affects both natural ecosystems and the agricultural industry, reaching the global economy (Ryalls et al. 2022 2009 The presence of micropollutants in soil, such as antibiotics, exacerbates the adverse effects of antibiotics and disinfectants on environmental microbial ecosystems. Soil contamination leads to changes in microbial communities, which can decrease agricultural productivity by modifying nutrient cycling and increasing microbial resistance. Sulfamethoxazole in composting material, for example, led to a reduction of protease, urease and cellulase (Moghadam et al. 2023 Furthermore, when it comes to food production, micropollutants can accumulate in edible produce, such as vegetables. These contaminants reach the soil through different pathways, including reclaimed water irrigation, because of inadequate water treatment processes (Ben Mordechay et al. 2022 2024 2024 When addressing water pollution, a significant issue arises concerning the fundamental human right to access safe drinking water, which directly influences human and environmental health (Githaiga et al. 2023 2018 The presence of micropollutants is enriched in wastewater due to anthropogenic activities. The wastewater treatment plants (WWTP) are important barriers to avoid the spread of pollutants into the environment. However, WWTPs can face significant challenges in removing micropollutants due to the diverse array of pollutants with varying physical and chemical properties, making them inefficient (Hube and Wu 2021 To mitigate the process of discharge of micropollutants to the environment, advanced treatment systems must be implemented. The most efficient mechanisms are based on adsorption, oxidation, biological, and physical processes, and have already been implemented in hospitals' wastewater treatment systems. In adsorption, powdered activated carbon (PAC) and granular activated carbon (GAC) are used to remove micropollutants, especially uncharged and nonpolar substances. Oxidation involves processes such as ozonation, UV irradiation and advanced oxidation processes (AOP), which eliminate micropollutants through photodegradation and reactions with highly reactive radicals. Biological processes, such as membrane bioreactors (MBRs), enhance the removal of micropollutants through biodegradation. Meanwhile, physical processes, such as nanofiltration (NF) and reverse osmosis (RO), remove micropollutants through size exclusion or electrostatic interactions (Klatt et al. 2022 Hybrid wastewater treatment facilities, which integrate multiple treatment systems, outperform standalone installations due to their ability to provide multiple treatment stages and diverse microenvironments, allowing for the incorporation of various mitigation mechanisms to remove pollutants and emerging pathogens. Wetland‐based treatment processes, for instance, have proven effective in mitigating a variety of micropollutants through biodegradation, sorption, plant absorption and photodegradation. Wetlands with multiple stages and diversified microenvironments tend to enhance micropollutant removal (Hube et al. 2024 2021 In Brazil, despite 61.9% of the urban population being covered by the wastewater network, only 49.1% of the total wastewater undergoes treatment (Mendonça et al. 2022 2021 The inefficiency of WWTPs leads to the release of polluted water back into the environment, posing an increased risk of bioaccumulation and biomagnification of micropollutants in aquatic organisms. This, in turn, affects the entire food chain and the health of aquatic ecosystems (Salomão et al. 2020 2020 2022 In addition to the issues discussed here, there are also implications regarding the presence of pathogens in water. Specifically, viruses are found in both untreated and treated wastewater, as well as in the water bodies receiving the effluent. The primary source of these viruses in wastewater is human faecal matter from infected individuals, with shedding rates ranging from 10 5 12 2020 Moreover, this poses a significant challenge, especially considering that treated wastewater is often used for recreational activities, agriculture, and as a raw water source for drinking water production (Al‐Hazmi et al. 2023 2021 2022 2020 The potential interactions between micropollutants and pathogens, with an emphasis on viruses, represent an emerging research field that will be further elaborated in the subsequent sections of this work. Table 1 TABLE 1 Micropollutants reported in water sources. Micropollutants Range concentration (mg/L) References Organic Pesticides and herbicides Atrazine 0.002–0.06 Mugudamani et al. ( 2023 Metolachlor 0.002–0.03 Simazine < LOQ‐5.67 Terbuthylazine 0.01–0.06 Glyphosate < LOQ–8.7 Lima et al. ( 2023 Alachlor NA Gu et al. ( 2023 Acetolachlor NA Pharmaceutics Antibiotics Tetracycline 0.6856–0.068 Cheng et al. ( 2020 Sulfamethoxazole 0.00466–0.3244 Amoxicillin NA Penicillin NA Clindamycin NA Ciprofloxacin 0.000233–0.000247 Mastrángelo et al. ( 2022 Anaesthetic Lidocaine 0.001–0.265 Rúa‐Gómez and Püttmann ( 2012 Tramadol 0.009–1.129 Anti‐inflammatory Paracetamol < LOQ–1.553 Huynh et al. ( 2023 Ibuprofen < LOQ–0.00255 Naproxen 0.002653–300 Psychiatric drug Carbamazepine 0.019–11.6 Mastrángelo et al. ( 2022 Venlafaxine 0.097–0.153 Rúa‐Gómez and Püttmann ( 2012 Diazepam NA Bouchard et al. ( 2023 Amitriptyline < LOQ–0.08357 Xiang et al. ( 2018 Lorazepam < LOQ–0.04683 Personal care products Paraben Methylparaben < LOQ–0.016 Bolujoko et al. ( 2022 Ethylparaben < LOQ–0.377 Propylparaben < LOQ–0.229 Volatile organic compounds Benzene < LOQ–18.131 Im et al. ( 2021 Ethylbenzene 0.001–0.1 He et al. ( 2023 Xylene 0.001–0.1 Toluene 0.001–0.1 Perfluorinated compounds Perfluorohexanesulfonic acid < LOQ–0.320742 Zhang et al. ( 2021 Perfluorooctanesulfonic acid < LOQ–0.301596 Perfluorobutanoic acid < LOQ–0.194189 Perfluorooctanoic acid −0.008264 Polycyclic aromatic hydrocarbons Naphthalene 4.15–370 (μg/kg) Wang, Wu, et al. ( 2023 Acenaphthylene 0.38–0.36 (μg/kg) Fluorene < LOQ–1.51 (μg/kg) Benzo[b]fluoranthene 3.23–548 (μg/kg) Microplastics and nanoplasctics Polyethylene terephthalate NA Dilshad et al. ( 2022 2018 Polypropylene NA Polyethylene NA Polystyrene NA Inorganic Heavy metals Chromium NA Zhou et al. ( 2022 Cadmium NA Copper NA Nutrients Fluoride 0.06–6.4 Kurwadkar ( 2019 2019 Nitrate < LOQ–92.81  Note: 2.1 Organic Micropollutants Pharmaceutical drugs are extensively used nowadays, with consumption being a daily routine for managing certain diseases. When metabolised through the hepatic route, they leave pharmacologically active molecules in urine and/or faeces during excretion. Despite wastewater treatment plants attempting to eliminate them, pharmaceutically active compounds and their metabolites persist, becoming environmental pollutants (Vaudin et al. 2022 Furthermore, emerging micropollutants present in wastewater can act as endocrine disrupting chemicals (EDC) or even endocrine modulators to different organisms, acting as agonists or antagonists to endogenous hormones. In this way, these pollutants can interfere with all the biological processes of hormones in organisms, such as synthesis, storage, transport and function, leading to changes in signalling pathways (Sabino et al. 2021 Due to the hazards associated with the presence of these substances in the environment, the European Union's Commission Implementing Decision 2022/1307, issued on July 22, 2022, establishes a watch list of substances for Union‐wide monitoring in the field of water policy as per Directive 2008/105/EC of the European Parliament and of the Council (European Union 2022 2.1.1 Pesticides Pesticides are agents utilised to safeguard crops from pests and diseases and increase crop yield. They are categorised based on target species, with herbicides and insecticides being the most widely used worldwide (Syafrudin et al. 2021 2020 Pesticides are categorised into different groups based on their structures. Organochlorine pesticides (OCP) are composed of chlorinated hydrocarbons and are commonly used in agricultural activities and mosquito control, and include compounds such as dichlorodiphenyltrichloroethane (DDT), endosulfan, hexachlorocyclohexane (HCH) and atrazine (Sackaria and Elango 2020 2023 Organophosphorus pesticides (OPP) are commonly used as insecticides, predominantly in the twentieth century. They undergo a desulfurization reaction of their sulphur atom to be metabolically activated in organs such as the liver, brain and lungs by cytochrome P450 enzymes. OPPs are known to exert neurotoxicity by inhibiting acetylcholinesterase (AChE) (Richardson et al. 2019 2022 2.1.2 Pharmaceuticals—Hormones The organic micropollutants acting as EDCs commonly bind to endogenous oestrogen and activate transcription factors involved in inflammation pathogenesis, while hormone synthesis can be obstructed (Adegoke et al. 2021 2021 The structure of oestrogens includes a phenolic group and, sometimes, an aliphatic hydroxyl group. Their lipophilic characteristics can lead to bioaccumulation in aquatic and terrestrial organisms, including fish, pork, eggs and edible products such as milk derivatives, which are widely consumed foods (Torres et al. 2021 Puckowski et al. ( 2016 2018 2.1.3 Pharmaceuticals—Antidepressants There are several types of antidepressants that target different neurotransmitters. These groups are categorised in Selective serotonin reuptake inhibitors (SSRIs), serotonin norepinephrine reuptake inhibitors (SNRIs), tricyclic antidepressants (TCAs), monoamine oxidase inhibitors (MAOIs) and norepinephrine‐dopamine reuptake inhibitors (NDRIs). Examples of these classes include fluoxetine, sertraline, citalopram, venlafaxine, clomipramine, selegiline, isocarboxazid, phenelzine and bupropion (Moreira et al. 2022 Antidepressants have been detected in both urban and natural water bodies worldwide, leading to bioaccumulation in aquatic organisms. However, in Latin America, reports of the presence of antidepressants in the environment are limited, with only a few studies reporting venlafaxine in Ecuador and Mexico, and fluoxetine in Argentina in the Paraná River (Castillo‐Zacarías et al. 2021 2022 Studies have investigated the behavioural changes in fish exposed to antidepressants in waterways, as these substances can act as EDCs, adversely affecting aquatic fauna. In humans, antidepressants primarily target monoamine transporters, such as serotonin, inhibiting the reabsorption of monoamines from the synaptic cleft into the presynaptic cell. Similarly, in vertebrates of aquatic fauna, antidepressants can disrupt the monoaminergic pathway. For example, exposure to fluoxetine delayed sexual maturation in male mosquitofish (  Gambusia affinis 2022 2.1.4 Pharmaceuticals—Antibiotics The use of antibiotics is essential for maintaining the health of humans and other animals. However, their indiscriminate use is leading to serious problems such as antimicrobial resistance and the emergence of multidrug‐resistant pathogens (Peixoto et al. 2022 2021 Furthermore, wastewater from healthcare facilities often contains resistant bacteria and is frequently discharged into the sewage system without proper treatment (Mackull'ak et al. 2021 2024 2024 2021 2021 The presence of antibiotic classes varies across regions. Common antibiotics found in wastewater samples from pharmaceutical factories in China and hospital wastewater in Iran include fluoroquinolones, macrolides, sulfonamides and tetracyclines. Specifically, fluoroquinolones and macrolides were the most frequently detected classes, with concentrations ranging from 57.03 to 726.79 ng/L, attributable to their extensive use and chemical stability in the environment (Ekwanzala et al. 2020 2021 2023 2023 Normally, the therapeutic use of antibiotics can lead to adverse effects, such as neurotoxic effects, which may include inhibiting neurotransmitter release, altering the functions of neurotransmitter receptors and releasing cytokines in the brain. This can pose a significant problem for children during neural development. Neurotoxic effects have also been observed in aquatic organisms, for example, affecting the development of zebrafish and inducing apoptosis in the brains of zebrafish embryos (Vaudin et al. 2022 2.2 Microplastics Worldwide, only 14% of packaging plastics are collected, and just 5% are successfully recycled into new plastic products (Silvestrim et al. 2022 2022 2022 Nowadays, MPs are ubiquitous, leading to the exposure of humans, animals and other species to their toxicity through the ingestion of contaminated food and water, as well as the inhalation of contaminated air. Furthermore, modifications in MPs can render them physiologically compatible, resulting in toxicological effects (Khan and Jia 2023 2021 2021 Besides that, MPs also interact with organic micropollutants. Most interactions between them occur through adsorption. In adsorption, chemical contaminants remain at the interface between the fluid and solid phases. These include hydrophobic partitioning interaction, pore filling, van der Waals forces and hydrogen bonding. Environmental factors such as pH, salinity and dissolved organic matter also influence these interactions (Yu et al. 2021 Due to their hydrophobic nature, MPs easily adsorb organic micropollutants. Van der Waals forces, such as p–p interactions, increase this adsorption affinity, and electrostatic interactions occur between charged micropollutants and MPs (Yu et al. 2021 2021 More than organic micropollutants, MPs also interact with pathogens. Moreover, the potential of MPs to adsorb organic micropollutants may influence host susceptibility to viral infections. When released into the environment, MPs are colonised by bacteria, fungi, archaea, algae and protozoans, forming biofilm communities known as the “plastisphere,” which increases the chances of human contamination by pathogenic bacteria (Moresco et al. 2022 2023 2023 The associations between microorganisms and MPs may have implications for pathogen–host interaction and subsequent immune response. In humans, for example, bacterial infection can facilitate pathogen entry into the target cell via endocytosis (Yang et al. 2023 2021 2021 2022 2.2.1 Interactions Between Organic Micropollutants and Microplastics Due to the ability of MPs to transport harmful chemicals, such as bisphenols, phthalates, polybrominated diphenyl ethers, polychlorinated biphenyls, organotins, perfluorinated compounds, dioxins, polycyclic aromatic hydrocarbons, organic contaminants and heavy metals, the combination of MPs with EDCs can easily contaminate milk, water and other liquids, affecting the endocrine system of mammals upon exposure. Overall, the majority of micropollutants are not regularly monitored in the environment but possess the capability to infiltrate and induce various health issues (Ajala et al. 2022 2023 1 FIGURE 1 Possible consequences of the activity of emerging micropollutants in the human body. Developed in BioRender Software. Data adapted from Ajala et al. ( 2022 2023 The interaction of MPs with pollutants like heavy metals, polycyclic aromatic hydrocarbons and pharmaceuticals remains contentious. Toxic effects that may result from these interactions include physical injury, impaired growth performance, lipid metabolic disorders, dysbiosis of gut microbiota, neurotoxicity, reproductive system damage, oxidative stress and immunotoxicity. Additionally, MPs can release harmful plastic additives and toxic monomers, such as bisphenol A, phthalates and toluene diisocyanate (Zhang, He, et al. 2022 2022 Building on this, it is important to note that environmental factors—such as pH, salinity, and organic matter—strongly influence the physicochemical properties of MPs. While MPs usually display hydrophobic traits, the addition of surface oxygen‐containing functional groups enhances their polarity. This modification enables them to adsorb hydrophilic compounds such as the antibiotic ciprofloxacin. This finding highlights the potential significance of MPs in altering the adsorption behaviour of polar chemicals (Liu et al. 2019 Extending this perspective to pharmaceuticals, MPs have been observed absorbing and accumulating commonly used drugs such as ibuprofen, diclofenac and naproxen on their surfaces. The sorption of pharmaceutical compounds by MPs is influenced by factors such as the octanol–water partition coefficient (Kow), the polymeric properties of MPs, and matrix conditions such as salinity and dissolved organic matter. Interactions between MPs and pharmaceutical products remain an ongoing area of research, and further studies are needed to understand the mechanisms and extent of these interactions (Tumwesigye et al. 2023 2.2.2 Interactions Between Pathogens and Micropollutants The above discussion highlights important implications regarding potential interactions among pharmaceuticals, MPs, and pathogens such as viruses and bacteria, the pathways of exposure for which are summarised in Figure 2 2023 FIGURE 2 Interactions between pharmaceuticals, micropollutants and viruses: Exposure routes. Developed in BioRender Software. Data adapted from the references presented in this section. Gao et al. ( 2022 Beyond antibiotics, other environmental contaminants have also been shown to interact with biological systems in ways that exacerbate health risks. For instance, Vancamp et al. ( 2021  Xenopus laevis The interactions between humans, animals and plastic pollution are becoming more frequent due to climate change, urbanisation, and intensified agriculture, increasing the risk of evolution and spread of zoonotic pathogens. Viruses are among the most hazardous pathogens for zoonotic transmission to humans, particularly due to their interactions with the plastisphere, which enhances their environmental persistence and may promote mutations that facilitate viral adaptation and stabilisation in new hosts (Ormsby et al. 2024 2024 2024 2021 In a study conducted by Hube et al. ( 2024  Phenylobacterium haematophilum Planctomycetota bacterium Flavobacteriales bacterium The impact of MPs on microbial dynamics suggests broader implications, particularly when considering their ability to simultaneously transport contaminants and pathogens into host systems. With the potential for MPs to adsorb organic micropollutants and bioaccumulate them in animal organisms, it is reasonable to consider the possibility that, once inside the organism, micropollutants may be released due to digestive fluids, leading to localised high contaminant exposure (Yu et al. 2021 2022 2022 Moreover, virus–microplastic interactions vary across environmental conditions, shaped by microplastic type, surface characteristics, environmental matrix, temperature and microbial communities. Affinity is governed by physicochemical traits of both viruses and microplastics, which are further modified by environmental factors (Zhao, Park, et al. 2024 2024 2022 2024 2024 The MPs acting as viral vectors impact the viral life cycle, survival, transmission and interaction with the host. The presence of MPs can increase viral replication and transmission between hosts. This effect is primarily driven by the physical properties of MPs, which can facilitate viral infection by promoting virus entry into host cells and disrupting the natural antiviral signalling pathway, potentially resulting in increased viral replication (Li, An, et al. 2024 2024 Pristine or virgin MPs, which are uncontaminated, are capable of absorbing nearly all T4 bacteriophages, thereby significantly extending their viability. This adsorption process is reversible and varies across the MPs' surfaces. Once the maximum adsorption duration is surpassed, viruses may detach from the MPs. This observation indicates a potential mechanism for viral transport via MPs, wherein viruses can attach in one environment and release in another. The factors that trigger the transition from viral adsorption to detachment could offer new insights into isolating viruses from MPs and reducing further viral spread in the environment (Lu et al. 2022 MPs with smaller dimensions, higher concentrations and those engineered with —COOH surface functional groups showed an increase in viral adsorption capacity. Specifically, MPs of 2 μm diameter (MP2) adsorbed viruses more efficiently than larger MPs of 20 μm (MP20) and 100 μm (MP100), with viral adsorption rates of 98.6% ± 0.2%, 83.6% ± 0.8%, and 73.7% ± 2.1%, respectively, at a concentration of 100 mg/L. Viral adsorption on MP2 also depended on concentration: no adsorption was observed at 0.001 mg/L, 5.6% ± 3.4% adsorption at 0.01 mg/L, with significant increases from 0.1 mg/L up to the maximum of 98.6% ± 0.2% at 100 mg/L. These results indicate that viral adsorption is optimised on small MPs at high concentrations (Lu et al. 2022 In addition to structural features, environmental factors such as UV exposure shape the capacity of MPs to retain and release viral particles. Aged MPs demonstrate a higher ability to absorb and shield viruses due to changes in absolute zeta potential, particle size and surface texture caused by ultraviolet (UV) radiation. UV radiation can break microplastic nanoparticles into smaller fragments, reducing particle size while providing increased protection for viruses (Liu 2010 2022 2010 Additionally, studies have shown that UV ageing induces changes in the morphology of MPs, leading to surface roughening, which is linked to an enhanced phage adhesion capacity (Dika et al. 2013 2020 2020 Furthermore, RNA fragments and viral particles of SARS‐CoV‐2 can be released from MPs in both vacuum and aqueous phases, particularly in sewage systems. This underscores the persistent presence of viral matter in urban wastewater treatment facilities, where the interaction between MPs and viruses poses a significant risk to public health and safety. These interactions are influenced by electrostatic and hydrophobic mechanisms, with the interaction affinity between MPs and viruses affected by the structural characteristics of the MPs (Belišová et al. 2021 2022 2022 Lu et al. ( 2022 The study conducted by Shan et al. ( 2023 Following the issue of infections in marine organisms, the study by Seeley et al. ( 2023 In a cell culture‐based study, Wang, Wu, et al. ( 2023 Bacteriophages, adenoviruses and hepatitis A viruses are highly prevalent in wastewater. Furthermore, reclaimed water has a high viral load compared to drinking water. As hospitals are the main sources of pathogens from infected individuals, the treated wastewater used as reclaimed water contains a high viral load (Petrovich et al. 2020 2008 It is known that the interaction between human viruses and substrates present in effluents can benefit their survival and infectivity in the environment (Moresco et al. 2021 2022 In this same study, viruses associated with biofilm‐colonised MPs were more stable compared to those in the water. RV remained stable during the 48‐h sampling period, while Phi6 stability was significantly impacted, with a reduction ranging from 2.18 to 3.94 log10. Viral particles were protected against inactivation factors when associated with biofilm on microplastic surfaces, especially under conditions of high particulate matter concentration in the liquid phase. Although the presence of an envelope may limit virus interaction with the plastisphere, infectious viruses with and without envelopes were recovered from colonised MPs. Therefore, environmental viruses may interact with MPs or even with the EPS of the biofilm, incorporating the viral capsid or envelope into the plastisphere (Moresco et al. 2022 Taken together, such evidence suggests that MPs contribute to the environmental persistence of both classical and novel viral pathogens. The SARS‐CoV‐2 virus, responsible for the COVID‐19 pandemic, has been identified in influent and treated sewage in various studies (Fongaro et al. 2021 2023 2 3 TABLE 2 Interactions and effects of organic micropollutants, microplastics, and pathogens. Micropollutants Type Association Outcomes Type of study References Pharmaceuticals Citalopram, ketoconazole, ketoconazole transformation products, and sertraline Biofilm matrix Eight different pharmaceuticals were localised in biofilms in a wastewater simulation. In vitro Burzio et al. ( 2023 Microplastics (MPs) Polypropylene and polyethylene Antibiotic (tetracycline) MPs can serve as vectors for the transport and accumulation of antibiotics in the environment. In vitro Gao et al. ( 2022 Pesticide metabolite Pyriproxyfen metabolite, 4′‐OH‐PPF Zika virus (ZIKV) The combination of 4′‐OH‐PPF and ZIKV could potentially worsen the microcephaly phenotype. In vitro and in vivo Vancamp et al. ( 2021 Microplastics (MPs) Polyethylene Gravity‐driven membrane filtration MPs caused a flow reduction of up to 54% compared to the control. There was increased deposition of EPS and divalent cations, along with a rise in bacterial communities. Smaller‐sized MPs and higher quantities caused changes in microbial communities and metabolic functions. In vitro Hube et al. ( 2024 Microplastics (MPs) Polystyrene T4 bacteriophage The adsorption of polystyrene microplastics (MPs) to the T4 bacteriophage can achieve up to 98.6% ± 0.2% adsorption of the phage. In vitro Lu et al. ( 2022 Microplastics (MPs) Polyvinyl chloride White spot syndrome virus (WSSV) infection in shrimp Polyvinyl chloride microplastics (PVC‐MPs) increase white spot syndrome virus (WSSV) replication and survival and maintain virus stability at different temperatures and pH levels. In vivo Shan et al. ( 2023 Microplastics (MPs) Polystyrene MPs, nylon microfiber, and a natural microparticle called ‘spartina’ Infectious haematopoietic necrosis virus (IHNV) in salmonid fish Coexposure to microplastics (MPs) and infectious haematopoietic necrosis virus (IHNV) in salmonid fish increases fish mortality. In vitro and in vivo Seeley et al. ( 2023 Microplastics (MPs) Polybutene (PB), polyethylene (PE), polypropylene (PP), polystyrene (PS), and polyvinyl chloride (PVC) Severe acute respiratory syndrome coronavirus 2 (SARS‐CoV‐2) RNA fragment MPs interact stronger with the SARS‐CoV‐2 RNA fragment than with two other viral RNA fragments, through electrostatic and hydrophobic processes. MPs may influence the environmental behaviour and destiny of the SARS‐CoV‐2 RNA fragment. In silico Zhang, He, et al. ( 2022 Microplastics (MPs) Polyethylene (PE), polyethylene glycol terephthalate (PET) and polypropylene (PP) Rotavirus (RV) SA11 and bacteriophage Phi6 Virus particles attached to the biofilm on microplastic surfaces exhibit prolonged survival. The interaction between viruses and the plastisphere may be constrained by the presence of an envelope. In vitro Moresco et al. ( 2022 Microplastics (MPs) Polystyrene SARS‐CoV‐2 spike protein pseudovirus and authentic SARS‐CoV‐2 Microplastics have the potential to adsorb both SARS‐CoV‐2 pseudovirus (SC2‐P) and authentic SARS‐CoV‐2 onto their surfaces, facilitating the transportation of the virus to the endo‐lysosomal compartment. In vitro Shruti et al. ( 2023 Microplastics (MPs) Polystyrene Influenza A virus (IAV) Polystyrene microplastics promote influenza A virus infection and enrich influenza virus entry into host cells. In vitro Wang, Chen, et al. ( 2023 Microplastics (MPs) — SARS‐CoV‐2 SARS‐CoV‐2 RNA was detected in association with microplastic fibres. SARS‐CoV‐2 aerosols could potentially bind to microplastic particles, enhancing virus survival and potentially facilitating entry into the human body. In vitro Amato‐Lourenço et al. ( 2022 Microplastics (MPs) Polystyrene Israeli acute paralysis virus (IAPV) Polystyrene microplastics that aggregated in the midgut increased the susceptibility of bees to IAPV infection. In vivo Deng et al. ( 2021 Microplastics (MPs) or microfibers — SARS‐CoV‐2 SARS‐CoV‐2 can adhere to solid impurities (e.g., textile microfibers) found in sewage, and washing water can affect their presence in wastewater. In vitro Belišová et al. ( 2021 Microplastics (MPs) Polyethylene (PE), polyethylene glycol terephthalate (PET) and polypropylene (PP) Phages colonising MPs biofilms The number of phages colonising microplastic biofilms was significantly greater than those colonising stones. Furthermore, multiple viral taxa were selectively enriched by the microplastic biofilm. In vitro Niu et al. ( 2023 FIGURE 3 Schematic representation of the adsorption capabilities of MPs and interactions with the environment and viruses. The survival, replication and infectivity of viruses can be enhanced by the adsorption capabilities of MPs developed in BioRender Software. Data adapted from the references presented in this section. Understanding the mechanisms of viral adsorption on MPs presents challenges. Due to the different types of MPs found in the environment and their variable physicochemical properties, combined with the differences in each occurrence matrix, including factors such as pH and salinity variations, the adsorption and interactions of viruses with MPs are impacted (Joo et al. 2021 3 Conclusion Our study underscores the potential interactions among emerging micropollutants themselves and with viral pathogens, particularly in wastewater, one of the primary sources of these contaminants due to human activities. These interactions pose significant risks to human, animal and environmental health. We emphasise that a major knowledge gap lies in the limited number of experimental studies conducted outside laboratory settings, which restricts our ability to predict the environmental behaviour and public health implications of such interactions. Moreover, the influence of micropollutant mixtures, the variability of aquatic matrices and the role of microbial communities in mediating virus‐pollutant dynamics are still underexplored. Future research should prioritise in situ studies and the development of standardised methodologies to assess viral adsorption, persistence and infectivity in complex environmental systems, and how different classes of micropollutants interact. This information is critical to understanding the potential for enhanced viral dissemination and the emergence of novel outbreaks linked to environmental contamination. Author Contributions Conceptualization, investigation and design were performed by Catielen Paula Pavi and Gislaine Fongaro. Mariana Alves Elois performed the investigation and tables. Yasmin Ferreira Souza Hoffmann Jempierre performed the design. The first draft of the manuscript was written by Catielen Paula Pavi, and all authors commented on previous versions of the manuscript. All authors read and approved the final manuscript. Gislaine Fongaro reviewed the final version. Conflicts of Interest The authors declare no conflicts of interest. Acknowledgements The authors thank the Coordination for the Improvement of Higher Education Personnel (CAPES), Brazil, for the financial support (CAPES n.88887.932144/2024‐00) and also acknowledge Conselho Nacional de Desenvolvimento Científico e Tecnológico Grant numbers (304434‐2023‐0) for support. The Article Processing Charge for the publication of this research was funded by the Coordenação de Aperfeiçoamento de Pessoal de Nível Superior ‐ Brasil (CAPES) (ROR identifier: 00x0ma614). Data Availability Statement Data sharing not applicable to this article as no datasets were generated or analysed during the current study. References Adegoke E. O. M. S. Rahman Y. J. Park Y. J. Kim M. G. Pang 2021 Endocrine‐Disrupting Chemicals and Infectious Diseases: From Endocrine Disruption to Immunosuppression International Journal of Molecular Sciences 22 8 3939 10.3390/IJMS22083939 33920428 PMC8069594 Ajala O. J. J. O. Tijani R. B. Salau A. S. Abdulkareem O. S. Aremu 2022 A Review of Emerging Micro‐Pollutants in Hospital Wastewater: Environmental Fate and Remediation Options Results in Engineering 16 100671 10.1016/J.RINENG.2022.100671 Al‐Hazmi H. E. A. Mohammadi A. Hejna 2023 Wastewater Reuse in Agriculture: Prospects and Challenges Environmental Research 236 Pt 1 116711 10.1016/J.ENVRES.2023.116711 37487927 Amato‐Lourenço L. F. N. de Souza Xavier Costa K. C. Dantas 2022 Airborne Microplastics and SARS‐CoV‐2 in Total Suspended Particles in the Area Surrounding the Largest Medical Centre in Latin America Environmental Pollution 292 118299 10.1016/J.ENVPOL.2021.118299 34626707 PMC8494494 Aryal N. J. Wood I. Rijal D. Deng M. K. Jha A. Ofori‐Boadu 2020 Fate of Environmental Pollutants: A Review Water Environment Research: A Research Publication of the Water Environment Federation 92 10 1587 1594 10.1002/WER.1404 32671926 Bailey M. J. N. N. Naik L. E. Wild W. B. Patterson T. L. Alderete 2020 Exposure to Air Pollutants and the Gut Microbiota: A Potential Link Between Exposure, Obesity, and Type 2 Diabetes Gut Microbes 11 5 1188 1202 10.1080/19490976.2020.1749754 32347153 PMC7524284 Belišová N. B. Konečná N. Bachratá 2021 Sorption of SARS‐CoV‐2 Virus Particles to the Surface of Microplastics Released During Washing Processes International Journal of Environmental Research and Public Health 19 1 281 10.3390/IJERPH19010281 35010541 PMC8750602 Ben Mordechay E. V. Mordehay J. Tarchitzky B. Chefetz 2022 Fate of Contaminants of Emerging Concern in the Reclaimed Wastewater‐Soil‐Plant Continuum Science of the Total Environment 822 153574 10.1016/J.SCITOTENV.2022.153574 35114239 Bolesta W. M. Głodniok K. Styszko 2022 From Sewage Sludge to the Soil‐Transfer of Pharmaceuticals: A Review International Journal of Environmental Research and Public Health 19 16 10246 10.3390/IJERPH191610246 36011880 PMC9408069 Bolujoko N. B. O. O. Ogunlaja M. O. Alfred 2022 Occurrence and Human Exposure Assessment of Parabens in Water Sources in Osun State, Nigeria Science of the Total Environment 814 152448 10.1016/J.SCITOTENV.2021.152448 34942254 Bouchard C. M. Monperrus S. Sebihi C. Tentelier V. Bolliet 2023 A Psychiatric Drug Found in Waste‐Water Plant Effluents Alters the Migratory Behavior of Critically Endangered  Anguilla anguilla Ecotoxicology and Environmental Safety 265 115496 10.1016/J.ECOENV.2023.115496 37742579 Burzio C. A. S. Mohammadi P. Malmberg O. Modin F. Persson B. M. Wilén 2023 Chemical Imaging of Pharmaceuticals in Biofilms for Wastewater Treatment Using Secondary Ion Mass Spectrometry Environmental Science & Technology 57 19 7431 7441 10.1021/ACS.EST.2C05027 37130040 PMC10193524 Castillo‐Zacarías C. M. E. Barocio E. Hidalgo‐Vázquez 2021 Antidepressant Drugs as Emerging Contaminants: Occurrence in Urban and Non‐Urban Waters and Analytical Methods for Their Detection Science of the Total Environment 757 143722 10.1016/J.SCITOTENV.2020.143722 33221013 Chen L. Y. Deng S. Dong 2021 The Occurrence and Control of Waterborne Viruses in Drinking Water Treatment: A Review Chemosphere 281 130728 10.1016/J.CHEMOSPHERE.2021.130728 34010719 PMC8084847 Cheng D. L. H. H. Ngo W. S. Guo 2018 Bioprocessing for Elimination Antibiotics and Hormones From Swine Wastewater Science of the Total Environment 621 1664 1682 10.1016/j.scitotenv.2017.10.059 29074241 Cheng D. H. H. Ngo W. Guo 2020 A Critical Review on Antibiotics and Hormones in Swine Wastewater: Water Pollution Problems and Control Approaches Journal of Hazardous Materials 387 121682 10.1016/J.JHAZMAT.2019.121682 31744723 Corpuz M. V. A. A. Buonerba G. Vigliotta 2020 Viruses in Wastewater: Occurrence, Abundance and Detection Methods Science of the Total Environment 745 140910 10.1016/J.SCITOTENV.2020.140910 32758747 PMC7368910 Das S. H. Sakr I. Al‐Huseini 2023 Atrazine Toxicity: The Possible Role of Natural Products for Effective Treatment Plants (Basel, Switzerland) 12 12 2278 10.3390/PLANTS12122278 37375903 PMC10301673 Deng Y. X. Jiang H. Zhao 2021 Microplastic Polystyrene Ingestion Promotes the Susceptibility of Honeybee to Viral Infection Environmental Science and Technology 55 17 11680 11692 10.1021/ACS.EST.1C01619 34374532 Devault D. A. S. Karolak 2020 Wastewater‐Based Epidemiology Approach to Assess Population Exposure to Pesticides: A Review of a Pesticide Pharmacokinetic Dataset Environmental Science and Pollution Research International 27 5 4695 4702 10.1007/S11356-019-07521-9 31907818 Dhalech A. H. T. D. Fuller C. M. Robinson 2021 Specific Bacterial Cell Wall Components Influence the Stability of Coxsackievirus B3 Journal of Virology 95 e0142421 10.1128/JVI.01424-21 34431699 PMC8549498 Dika C. M. H. Ly‐Chatain G. Francius J. F. L. Duval C. Gantzer 2013 Non‐DLVO Adhesion of F‐Specific RNA Bacteriophages to Abiotic Surfaces: Importance of Surface Roughness, Hydrophobic and Electrostatic Interactions Colloids and Surfaces A: Physicochemical and Engineering Aspects 435 178 187 10.1016/J.COLSURFA.2013.02.045 Dilshad A. M. Taneez F. Younas A. Jabeen M. T. Rafiq H. Fatimah 2022 Microplastic Pollution in the Surface Water and Sediments From Kallar Kahar Wetland, Pakistan: Occurrence, Distribution, and Characterization by ATR‐FTIR Environmental Monitoring and Assessment 194 7 511 10.1007/S10661-022-10171-Z 35713715 Ekwanzala M. D. R. F. Lehutso T. K. Kasonga J. B. Dewar M. N. B. Momba 2020 Environmental Dissemination of Selected Antibiotics From Hospital Wastewater to the Aquatic Environment Antibiotics 9 7 431 10.3390/ANTIBIOTICS9070431 32708321 PMC7400012 European Union 2022 Commission Implementing Decision (EU) 2022/1307 of 22 July 2022 Establishing a Watch List of Substances for Union‐Wide Monitoring in the Field of Water Policy Pursuant to Directive 2008/105/EC of the European Parliament and of the Council (Notified Under Document C(2022) 5098) (Text With EEA Relevance) https://eur‐lex.europa.eu/eli/dec_impl/2022/1307/oj Fongaro G. P. H. Stoco D. S. M. Souza 2021 The Presence of SARS‐CoV‐2 RNA in Human Sewage in Santa Catarina, Brazil, November 2019 Science of the Total Environment 778 146198 10.1016/j.scitotenv.2021.146198 33714813 PMC7938741 Fu C. D. Kuang H. Zhang J. Ren J. Chen 2022 Different Components of Air Pollutants and Neurological Disorders Frontiers in Public Health 10 959921 10.3389/FPUBH.2022.959921 36518583 PMC9742385 Fu L. J. Li G. Wang Y. Luan W. Dai 2021 Adsorption Behavior of Organic Pollutants on Microplastics Ecotoxicology and Environmental Safety 217 112207 10.1016/J.ECOENV.2021.112207 33866287 Gao P. C. Ju Z. Tang Y. Qin 2022 Enhanced Adsorption of Tetracycline on Polypropylene and Polyethylene Microplastics After Anaerobically Microbial‐Mediated Aging Process Journal of Hazardous Materials Advances 6 100075 10.1016/J.HAZADV.2022.100075 Garcia A. T. Le P. Jankowski K. Yanaç Q. Yuan M. I. Uyaguari‐Diaz 2022 Quantification of Human Enteric Viruses as Alternative Indicators of Fecal Pollution to Evaluate Wastewater Treatment Processes PeerJ 10 e12957 10.7717/PEERJ.12957 35186509 PMC8852272 Gavrilescu M. K. Demnerová J. Aamand S. Agathos F. Fava 2015 Emerging Pollutants in the Environment: Present and Future Challenges in Biomonitoring, Ecological Risks and Bioremediation New Biotechnology 32 1 147 156 10.1016/J.NBT.2014.01.001 24462777 Githaiga K. B. S. M. Njuguna J. L. Bargul F. Liu R. W. Gituru X. Yan 2023 Decadal Assessment of Microplastics, Pharmaceuticals, and Pesticides as Contaminants of Emerging Concern in Kenya's Surface Waters: A Review Environmental Toxicology and Chemistry 42 10 2105 2118 10.1002/ETC.5707 37377343 Gu W. W. Xing M. Liang 2023 Occurrence, Distribution, and Risk Assessment of Pesticides in Surface Water and Sediment in Jiangsu Province, China Environmental Science and Pollution Research International 30 56 118418 118429 10.1007/S11356-023-30416-9 37907825 Gupta A. S. Kumar Y. Bajpai 2024 Pharmaceutically Active Micropollutants: Origin, Hazards and Removal Frontiers in Microbiology 15 1339469 10.3389/FMICB.2024.1339469 38419628 PMC10901114 Han S. X. Li H. Huang 2021 Simultaneous Determination of Seven Antibiotics and Five of Their Metabolites in Municipal Wastewater and Evaluation of Their Stability Under Laboratory Conditions International Journal of Environmental Research and Public Health 18 20 10640 10.3390/IJERPH182010640/S1 34682386 PMC8535447 He X. S. Q. Pan B. D. Xi J. Zheng Q. Y. Liu Y. Sun 2023 Volatile and Semi‐Volatile Organic Compounds in Landfill Leachate: Concurrence, Removal and the Influencing Factors Water Research 245 120566 10.1016/J.WATRES.2023.120566 37683521 Helmi K. S. Skraber C. Gantzer R. Willame L. Hoffmann H. M. Cauchie 2008 Interactions of Cryptosporidium Parvum Giardia Lamblia Applied and Environmental Microbiology 74 7 2079 2088 10.1128/AEM.02495-07 18281435 PMC2292593 Hube S. S. Veronelli T. Li M. Burkhardt S. Brynjólfsson B. Wu 2024 Microplastics Affect Membrane Biofouling and Microbial Communities During Gravity‐Driven Membrane Filtration of Primary Wastewater Chemosphere 353 141650 10.1016/j.chemosphere.2024.141650 38462183 Hube S. B. Wu 2021 Mitigation of Emerging Pollutants and Pathogens in Decentralized Wastewater Treatment Processes: A Review Science of the Total Environment 779 146545 10.1016/J.SCITOTENV.2021.146545 33752021 Huynh N. C. T. T. T. Nguyen D. T. C. Nguyen T. van Tran 2023 Occurrence, Toxicity, Impact and Removal of Selected Non‐Steroidal Anti‐Inflammatory Drugs (NSAIDs): A Review Science of the Total Environment 898 165317 10.1016/J.SCITOTENV.2023.165317 37419350 Im J. K. S. J. Yu S. Kim S. H. Kim H. R. Noh M. K. Kim 2021 Occurrence, Potential Sources, and Risk Assessment of Volatile Organic Compounds in the Han River Basin, South Korea International Journal of Environmental Research and Public Health 18 7 3727 10.3390/IJERPH18073727 33918372 PMC8038302 Joo S. H. Y. Liang M. Kim J. Byun H. Choi 2021 Microplastics With Adsorbed Contaminants: Mechanisms and Treatment Environmental Challenges (Amsterdam, Netherlands) 3 100042 10.1016/J.ENVC.2021.100042 37521158 PMC9767417 Khan A. Z. Jia 2023 Recent Insights Into Uptake, Toxicity, and Molecular Targets of Microplastics and Nanoplastics Relevant to Human Health Impacts iScience 26 2 106061 10.1016/j.isci.2023.106061 36818296 PMC9929686 Klatt M. F. Beyer J. Einfeldt 2022 Hospital Wastewater Treatment and the Role of Membrane Filtration ‐ Removal of Micropollutants and Pathogens: A Review Water Science and Technology: A Journal of the International Association on Water Pollution Research 86 9 2213 2232 10.2166/WST.2022.321 36378176 Kumar S. A. Sharma R. Thaker 2021 Air Pollutants and Impairments of Male Reproductive Health‐An Overview Reviews on Environmental Health 36 4 565 575 10.1515/REVEH-2020-0136 33544535 Kurwadkar S. 2019 Occurrence and Distribution of Organic and Inorganic Pollutants in Groundwater Water Environment Research: A Research Publication of the Water Environment Federation 91 10 1001 1008 10.1002/WER.1166 31230394 Lee S. J. W. Sorensen R. L. Walker J. B. Emerson G. W. Nicol C. Hazard 2022 Soil pH Influences the Structure of Virus Communities at Local and Global Scales Soil Biology and Biochemistry 166 108569 10.1016/J.SOILBIO.2022.108569 Li R. X. L. An Y. Wang 2024 Viral Metagenome Reveals Microbial Hosts and the Associated Antibiotic Resistome on Microplastics Nature Water 2 553 565 10.1038/s44221-024-00249-y Li R. L. Zhu L. Cui Y. G. Zhu 2022 Viral Diversity and Potential Environmental Risk in Microplastic at Watershed Scale: Evidence From Metagenomic Analysis of Plastisphere Environment International 161 107146 10.1016/J.ENVINT.2022.107146 35183943 Li T. R. Liu Q. Wang 2024 A Review of the Influence of Environmental Pollutants (Microplastics, Pesticides, Antibiotics, Air Pollutants, Viruses, Bacteria) on Animal Viruses Journal of Hazardous Materials 468 133831 10.1016/J.JHAZMAT.2024.133831 38402684 Lima I. B. I. G. Boëchat M. D. Fernandes J. A. F. Monteiro L. Rivaroli B. Gücker 2023 Glyphosate Pollution of Surface Runoff, Stream Water, and Drinking Water Resources in Southeast Brazil Environmental Science and Pollution Research International 30 10 27030 27040 10.1007/S11356-022-24167-2 36376647 Litynska M. 2022 Microplastics in Natural Water: Sources and Determination. Water and Water Purification Technologies Scientific and Technical News 34 3 3 9 10.20535/2218-930032022277748 Liu D.‐L. 2010 Particle Deposition Onto Enclosure Surfaces. Developments in Surface Contamination and Cleaning 1 56 William Andrew Publishing 10.1016/B978-1-4377-7830-4.10001-5 Liu F. G. Liu Z. Zhu S. Wang F. Zhao 2019 Interactions Between Microplastics and Phthalate Esters as Affected by Microplastics Characteristics and Solution Chemistry Chemosphere 214 688 694 10.1016/j.chemosphere.2018.09.174 30292051 Liu Y. D. Cai X. Li 2023 Occurrence, Fate, and Risk Assessment of Antibiotics in Typical Pharmaceutical Manufactories and Receiving Water Bodies From Different Regions PLoS One 18 1 e0270945 10.1371/JOURNAL.PONE.0270945 36662697 PMC9858356 Lovett G. M. T. H. Tear D. C. Evers 2009 Effects of Air Pollution on Ecosystems and Biological Diversity in the Eastern United States Annals of the New York Academy of Sciences 1162 99 135 10.1111/J.1749-6632.2009.04153.X 19432647 Lu J. Z. Yu L. Ngiam J. Guo 2022 Microplastics as Potential Carriers of Viruses Could Prolong Virus Survival and Infectivity Water Research 225 119115 10.1016/j.watres.2022.119115 36137436 Mackull'ak T. K. Cverenkárová A. V. Staňová 2021 Hospital Wastewater‐Source of Specific Micropollutants, Antibiotic‐Resistant Microorganisms, Viruses, and Their Elimination Antibiotics (Basel) 10 9 1070 10.3390/ANTIBIOTICS10091070 34572652 PMC8471966 Mao R. M. Lang X. Yu R. Wu X. Yang X. Guo 2020 Aging Mechanism of Microplastics With UV Irradiation and Its Effects on the Adsorption of Heavy Metals Journal of Hazardous Materials 393 122515 10.1016/J.JHAZMAT.2020.122515 32197203 Martinho S. D. V. C. Fernandes S. A. Figueiredo C. Delerue‐Matos 2022 Microplastic Pollution Focused on Sources, Distribution, Contaminant Interactions, Analytical Methods, and Wastewater Removal Strategies: A Review International Journal of Environmental Research and Public Health 19 9 5610 10.3390/ijerph19095610 35565001 PMC9104288 Mastrángelo M. M. M. E. Valdés B. Eissa 2022 Occurrence and Accumulation of Pharmaceutical Products in Water and Biota of Urban Lowland Rivers Science of the Total Environment 828 154303 10.1016/J.SCITOTENV.2022.154303 35257761 Mdeni N. L. A. O. Adeniji A. I. Okoh O. O. Okoh 2022 Analytical Evaluation of Carbamate and Organophosphate Pesticides in Human and Environmental Matrices: A Review Molecules 27 3 618 10.3390/molecules27030618 35163876 PMC8840499 Mendonça J. M. d. S. J. A. Navoni G. F. de Meiros I. M. C. A. P. Mina 2022 Ecotoxicological Assessment of Estuarine Surface Waters Receiving Treated and Untreated Sanitary Wastewater Environmental Monitoring and Assessment 194 12 908 10.1007/s10661-022-10636-1 36253654 Miller M. E. M. Hamann F. J. Kroon 2020 Bioaccumulation and Biomagnification of Microplastics in Marine Organisms: A Review and Meta‐Analysis of Current Data PLoS One 15 10 e0240792 10.1371/JOURNAL.PONE.0240792 33064755 PMC7567360 Moghadam A. A. W. Shuai E. M. Hartmann 2023 Anthropogenic Antimicrobial Micropollutants and Their Implications for Agriculture Current Opinion in Biotechnology 80 102902 10.1016/J.COPBIO.2023.102902 36812745 Moreira D. G. A. Aires M. de Lourdes Pereira M. Oliveira 2022 Levels and Effects of Antidepressant Drugs to Aquatic Organisms Comparative Biochemistry and Physiology C 256 109322 10.1016/J.CBPC.2022.109322 35272041 Moresco V. A. Charatzidou D. M. Oliver M. Weidmann S. Matallana‐Surget R. S. Quilliam 2022 Binding, Recovery, and Infectiousness of Enveloped and Non‐Enveloped Viruses Associated With Plastic Pollution in Surface Water Environmental Pollution 308 119594 10.1016/j.envpol.2022.119594 35680062 Moresco V. D. M. Oliver M. Weidmann S. Matallana‐Surget R. S. Quilliam 2021 Survival of Human Enteric and Respiratory Viruses on Plastics in Soil, Freshwater, and Marine Environments Environmental Research 199 111367 10.1016/J.ENVRES.2021.111367 34029551 Mugudamani I. S. A. Oke T. P. Gumede S. Senbore 2023 Herbicides in Water Sources: Communicating Potential Risks to the Population of Mangaung Metropolitan Municipality, South Africa Toxics 11 6 538 10.3390/TOXICS11060538 37368638 PMC10302186 Mustafić H. P. Jabre C. Caussin 2012 Main Air Pollutants and Myocardial Infarction: A Systematic Review and Meta‐Analysis JAMA 307 7 713 721 10.1001/JAMA.2012.126 22337682 Niu L. S. Zhao Y. Chen 2023 Diversity and Potential Functional Characteristics of Phage Communities Colonizing Microplastic Biofilms Environmental Research 219 15 115103 10.1016/j.envres.2022.115103 36549484 Nowak‐Lange M. K. Niedziałkowska K. Lisowska 2022 Cosmetic Preservatives: Hazardous Micropollutants in Need of Greater Attention? International Journal of Molecular Sciences 23 22 14495 10.3390/IJMS232214495 36430973 PMC9692320 Ormsby M. J. L. Woodford R. S. Quilliam 2024 Can Plastic Pollution Drive the Emergence and Dissemination of Novel Zoonotic Diseases? Environmental Research 246 118172 10.1016/J.ENVRES.2024.118172 38220083 Peixoto P. S. P. H. Carvalho A. Machado 2022 Development of a Screening Method for Sulfamethoxazole in Environmental Water by Digital Colorimetry Using a Mobile Device Chem 10 1 25 10.3390/CHEMOSENSORS10010025/S1 Petrovich M. L. A. Zilberman A. Kaplan 2020 Microbial and Viral Communities and Their Antibiotic Resistance Genes Throughout a Hospital Wastewater Treatment System Frontiers in Microbiology 11 153 10.3389/FMICB.2020.00153 32140141 PMC7042388 Pivokonsky M. L. Cermakova K. Novotna P. Peer T. Cajthaml V. Janda 2018 Occurrence of Microplastics in Raw and Treated Drinking Water Science of the Total Environment 643 1644 1651 10.1016/J.SCITOTENV.2018.08.102 30104017 Puckowski A. K. Mioduszewska P. Łukaszewicz 2016 Bioaccumulation and Analytics of Pharmaceutical Residues in the Environment: A Review Journal of Pharmaceutical and Biomedical Analysis 127 232 255 10.1016/j.jpba.2016.02.049 26968887 Quadra G. R. Z. Li P. S. A. Silva N. Barros F. Roland A. Sobek 2021 Temporal and Spatial Variability of Micropollutants in a Brazilian Urban River Archives of Environmental Contamination and Toxicology 81 1 142 154 10.1007/S00244-021-00853-Z 33999217 Reeves A. W. A. Shaikh S. Chakraborty P. Chaudhuri J. K. Biswas J. P. Maity 2023 Potential Transmission of SARS‐CoV‐2 Through Microplastics in Sewage: A Wastewater‐Based Epidemiological Review Environmental Pollution 334 122171 10.1016/J.ENVPOL.2023.122171 37437759 Richardson J. R. V. Fitsanakis R. H. S. Westerink A. G. Kanthasamy 2019 Neurotoxicity of Pesticides Acta Neuropathologica 138 3 343 362 10.1007/S00401-019-02033-9 31197504 PMC6826260 Rúa‐Gómez P. C. W. Püttmann 2012 Occurrence and Removal of Lidocaine, Tramadol, Venlafaxine, and Their Metabolites in German Wastewater Treatment Plants Environmental Science and Pollution Research International 19 3 689 699 10.1007/S11356-011-0614-1 21909967 Ryalls J. M. W. B. Langford N. J. Mullinger 2022 Anthropogenic Air Pollutants Reduce Insect‐Mediated Pollination Services Environmental Pollution (Barking, Essex: 1987) 297 118847 10.1016/J.ENVPOL.2022.118847 35063287 Sabino J. A. A. L. de Sá Salomão P. M. de Oliveira Muniz Cunha R. Coutinho M. Marques 2021 Occurrence of Organic Micropollutants in an Urbanized Sub‐Basin and Ecological Risk Assessment Ecotoxicology (London, England) 30 1 130 141 10.1007/S10646-020-02304-2 33175334 Sackaria M. L. Elango 2020 Organic Micropollutants in Groundwater of India‐A Review Water Environment Research: A Research Publication of the Water Environment Federation 92 4 504 523 10.1002/WER.1243 31545539 Salomão A. L. d. S. R. A. Hauser‐Davis M. Marques 2020 Critical Knowledge Gaps and Relevant Variables Requiring Consideration When Performing Aquatic Ecotoxicity Assays Ecotoxicology and Environmental Safety 203 110941 10.1016/J.ECOENV.2020.110941 32678749 Scopetani C. A. Cincinelli T. Martellini 2018 Ingested Microplastic as a Two‐Way Transporter for PBDEs in  Talitrus saltator Environmental Research 167 411 417 10.1016/J.ENVRES.2018.07.030 30118960 Seeley M. E. R. C. Hale P. Zwollo W. Vogelbein G. Verry A. R. Wargo 2023 Microplastics Exacerbate Virus‐Mediated Mortality in Fish Science of the Total Environment 866 161191 10.1016/J.SCITOTENV.2022.161191 36592912 Shan L. P. Y. Hu L. Hu H. W. Liu L. Liu J. Chen 2023 Involvement of Microplastics in the Conflict Between Host Immunity Defense and Viral Virulence: Promoting the Susceptibility of Shrimp to WSSV Infection Environmental Science & Technology 57 31 11634 11642 10.1021/ACS.EST.3C01566 37498082 Shruti V. C. G. Kutralam‐Muniasamy F. Pérez‐Guevara 2023 Do Microbial Decomposers Find Micro‐ and Nanoplastics to Be Harmful Stressors in the Aquatic Environment? A Systematic Review of In Vitro Toxicological Research Science of the Total Environment 903 166561 10.1016/J.SCITOTENV.2023.166561 37633392 Silvestrim E. G. A. A. F. Rivas M. R. S. Vieira G. P. Santana 2022 Recycling Plastic Waste in Manaus (AM): The Case of Waste Pickers Research, Society and Development 11 2 e45111225902 10.33448/RSD-V11I2.25902 Sousa J. C. G. A. R. Ribeiro M. O. Barbosa M. F. R. Pereira A. M. T. Silva 2018 A Review on Environmental Monitoring of Water Organic Pollutants Identified by EU Guidelines Journal of Hazardous Materials 344 146 162 10.1016/J.JHAZMAT.2017.09.058 29032095 Syafrudin M. R. A. Kristanti A. Yuniarto 2021 Pesticides in Drinking Water‐A Review International Journal of Environmental Research and Public Health 18 2 1 15 10.3390/IJERPH18020468 PMC7826868 33430077 Tandukar S. S. P. Sherchan E. Haramoto 2020 Reduction of Human Enteric and Indicator Viruses at a Wastewater Treatment Plant in Southern Louisiana, USA Food and Environmental Virology 12 3 260 263 10.1007/S12560-020-09433-1 32613519 Thompson W. A. M. M. Vijayan 2022 Antidepressants as Endocrine Disrupting Compounds in Fish Frontiers in Endocrinology 13 895064 10.3389/FENDO.2022.895064 35784526 PMC9245512 Torres N. H. G. d. O. S. Santos L. F. Romanholo Ferreira J. H. P. Américo‐Pinheiro K. I. B. Eguiluz G. R. Salazar‐Banda 2021 Environmental Aspects of Hormones Estriol, 17β‐Estradiol and 17α‐Ethinylestradiol: Electrochemical Processes as Next‐Generation Technologies for Their Removal in Water Matrices Chemosphere 267 128888 10.1016/J.CHEMOSPHERE.2020.128888 33190907 Tumwesigye E. C. Felicitas Nnadozie F. Akamagwuna X. Siwe Noundou G. William Nyakairu O. N. Odume 2023 Microplastics as Vectors of Chemical Contaminants and Biological Agents in Freshwater Ecosystems: Current Knowledge Status and Future Perspectives Environmental Pollution (Barking, Essex: 1987) 330 121829 10.1016/J.ENVPOL.2023.121829 37196837 Ullah S. S. Ahmad X. Guo 2023 A Review of the Endocrine Disrupting Effects of Micro and Nano Plastic and Their Associated Chemicals in Mammals Frontiers in Endocrinology 13 1084236 10.3389/FENDO.2022.1084236 36726457 PMC9885170 Vancamp P. P. Spirhanzlova A. Sébillot 2021 The Pyriproxyfen Metabolite, 4′–OH–PPF, Disrupts Thyroid Hormone Signaling in Neural Stem Cells, Modifying Neurodevelopmental Genes Affected by ZIKA Virus Infection Environmental Pollution 285 117654 10.1016/J.ENVPOL.2021.117654 34289950 Vaudin P. C. Augé N. Just S. Mhaouty‐Kodja S. Mortaud D. Pillon 2022 When Pharmaceutical Drugs Become Environmental Pollutants: Potential Neural Effects and Underlying Mechanisms Environmental Research 205 112495 10.1016/J.ENVRES.2021.112495 34883077 Wang C. W. Wu Z. Pang 2023 Polystyrene Microplastics Significantly Facilitate Influenza A Virus Infection of Host Cells Journal of Hazardous Materials 446 130617 10.1016/J.JHAZMAT.2022.130617 36623344 Wang M. H. C. W. Chen C. F. Chen L. C. Wang T. K. Liu C. D. Dong 2023 Occurrence and Emission of Polycyclic Aromatic Hydrocarbons From Water Treatment Plant Sludge in Taiwan Environmental Technology 44 8 1190 1200 10.1080/09593330.2021.1998227 34694956 Wicke D. A. Matzinger H. Sonnenberg 2021 Micropollutants in Urban Stormwater Runoff of Different Land Uses Water (Switzerland) 13 9 1312 10.3390/W13091312/S1 Wu X. P. Liu H. Huang S. Gao 2020 Adsorption of Triclosan Onto Different Aged Polypropylene Microplastics: Critical Effect of Cations Science of the Total Environment 717 137033 10.1016/J.SCITOTENV.2020.137033 32062251 Xiang J. M. Wu J. Lei C. Fu J. Gu G. Xu 2018 The Fate and Risk Assessment of Psychiatric Pharmaceuticals From Psychiatric Hospital Effluent Ecotoxicology and Environmental Safety 150 289 296 10.1016/J.ECOENV.2017.12.049 29289864 Xu D. Y. Ma X. Han Y. Chen 2021 Systematic Toxicity Evaluation of Polystyrene Nanoplastics on Mice and Molecular Mechanism Investigation About Their Internalization Into CaCO‐2 Cells Journal of Hazardous Materials 417 126092 10.1016/J.JHAZMAT.2021.126092 34015712 Xu L. H. Zhang P. Xiong Q. Zhu C. Liao G. Jiang 2021 Occurrence, Fate, and Risk Assessment of Typical Tetracycline Antibiotics in the Aquatic Environment: A Review Science of the Total Environment 753 141975 10.1016/J.SCITOTENV.2020.141975 33207448 Yang W. Y. Li D. Boraschi 2023 Association Between Microorganisms and Microplastics: How Does It Change the Host‐Pathogen Interaction and Subsequent Immune Response? International Journal of Molecular Sciences 24 4 4065 10.3390/IJMS24044065 36835476 PMC9963316 Yu Y. W. Y. Mo T. Luukkonen 2021 Adsorption Behaviour and Interaction of Organic Micropollutants With Nano and Microplastics ‐ A Review Science of the Total Environment 797 149140 10.1016/J.SCITOTENV.2021.149140 34303986 Zapata‐Restrepo L. M. K. Bawden G. Sidaoui‐Haddad E. Spencer I. D. Williams M. Hudson 2025 Microplastics in the European Native Oyster, Ostrea Edulis Environmental Monitoring and Assessment 197 1 17 10.1007/S10661-025-13975-X PMC11993462 40220170 Zhai X. X. H. Zhang M. Yu 2023 Microbial Colonization and Degradation of Marine Microplastics in the Plastisphere: A Review Frontiers in Microbiology 14 1127308 10.3389/FMICB.2023.1127308 36876073 PMC9981674 Zhang F. Y. Wang Z. Wei G. Zhang J. Wang 2021 Perfluorinated Compounds in a River Basin From QingHai‐Tibet Plateau: Occurrence, Sources and Key Factors Ecotoxicology and Environmental Safety 228 113043 10.1016/J.ECOENV.2021.113043 34863078 Zhang F. Z. Wang M. G. Vijver W. J. G. M. Peijnenburg 2022 Theoretical Investigation on the Interactions of Microplastics With a SARS‐CoV‐2 RNA Fragment and Their Potential Impacts on Viral Transport and Exposure Science of the Total Environment 842 156812 10.1016/J.SCITOTENV.2022.156812 35738381 PMC9212631 Zhang Q. Y. He R. Cheng Q. Li Z. Qian X. Lin 2022 Recent Advances in Toxicological Research and Potential Health Impact of Microplastics and Nanoplastics In Vivo Environmental Science and Pollution Research International 29 27 40415 40448 10.1007/S11356-022-19745-3 35347608 Zhao B. K. Park D. Kondo 2024 Comparison on Removal Performance of Virus, Antibiotic‐Resistant Bacteria, Cell‐Associated and Cell‐Free Antibiotic Resistance Genes, and Indicator Chemicals by Ozone in the Filtrated Secondary Effluent of a Sewage Treatment Plant Journal of Hazardous Materials 465 133347 10.1016/J.JHAZMAT.2023.133347 38150766 Zhao H. X. Hong J. Chai 2024 Interaction Between Microplastics and Pathogens in Subsurface System: What We Know So Far Water 16 499 10.3390/W16030499 Zhou L. S. Li F. Li 2022 Damage and Elimination of Soil and Water Antibiotic and Heavy Metal Pollution Caused by Livestock Husbandry Environmental Research 215 114188 10.1016/J.ENVRES.2022.114188 36030917 Zokm G. M. E. M. M. Ismail M. A. E. Okbah 2022 Seaweed as Bioindicators of Organic Micropollutants Polycyclic Aromatic Hydrocarbons (PAHs) and Organochlorine Pesticides (OCPs) Environmental Science and Pollution Research International 29 23 34738 34748 10.1007/S11356-022-18634-Z 35041174 PMC9076741 ",
  "metadata": {
    "Title of this paper": "Seaweed as Bioindicators of Organic Micropollutants Polycyclic Aromatic Hydrocarbons (PAHs) and Organochlorine Pesticides (OCPs)",
    "Journal it was published in:": "Environmental Microbiology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488536/"
  }
}