{
  "title": "Paper_457",
  "abstract": "pmc Cancer Manag Res Cancer Manag Res 1404 cancmanres cmar Cancer Management and Research 1179-1322 Dove Press PMC12482940 PMC12482940.1 12482940 12482940 41036330 10.2147/CMAR.S542680 542680 1 Original Research Predicting Axillary Lymph Node Metastasis in Breast Cancer Using Ultrasound and Machine Learning with SHAP Bai et al Bai et al Bai Gengyan 1 Zhong Xiaohong 1 Wu Youping 1 Lin Weijie 1 Zhou Shoulan 1 Zhou Ping 1 1 Department of Ultrasound, Women and Children’s Hospital, School of Medicine, Xiamen University Xiamen Fujian People’s Republic of China Correspondence: Xiaohong Zhong, Email feitianlu.fpm@163.com 26 9 2025 2025 17 478871 2183 2197 25 5 2025 13 9 2025 26 09 2025 01 10 2025 02 10 2025 © 2025 Bai et al. 2025 Bai et al. https://creativecommons.org/licenses/by-nc/4.0/ This work is published and licensed by Dove Medical Press Limited. The full terms of this license are available at https://www.dovepress.com/terms.php http://creativecommons.org/licenses/by-nc/4.0/ https://www.dovepress.com/terms.php Background Accurate preoperative prediction of axillary lymph node (ALN) metastasis in breast cancer is crucial for surgical planning and reducing morbidity. Conventional ultrasound and Doppler methods are limited by subjectivity, while existing machine learning (ML) models often lack interpretability and multi-center validation. Aim To evaluate 11 ML algorithms and develop a validated model integrating ultrasound and Doppler features for ALN metastasis prediction, using SHapley Additive exPlanations (SHAP) for interpretability. Methods This retrospective dual-center study included 303 patients from Xiamen (internal cohorts: 212 training, 91 validation) and 102 from Longyan (external validation). Features were extracted from preoperative ultrasound and Doppler images. Recursive feature elimination (RFE) and SHAP selected key predictors. Gradient Boosting was identified as optimal and compared to B-mode/Doppler submodels and clinicopathological scores (Logical, Tumor, Tenon). Performance was assessed via AUC, calibration, decision curve analysis (DCA), and a web calculator was developed. Results Five features—tumor diameter, cortex-to-hilum ratio, lymph node systolic/diastolic ratio, peak systolic velocity, and end-diastolic velocity—were selected. The combined model achieved AUCs of 0.981 (training), 0.975 (internal validation), and 0.987 (external validation), outperforming scores (AUCs 0.517–0.700). It showed superior calibration (Brier scores 0.045–0.061) and net benefit in DCA. Conclusion The Gradient Boosting model with SHAP provides accurate, interpretable ALN metastasis prediction, supporting noninvasive risk stratification and personalized breast cancer management. Keywords breast cancer axillary lymph node metastasis ultrasound doppler ultrasound machine learning SHapley Additive exPlanations pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Breast cancer remains the most common malignancy among women worldwide, posing a significant public health challenge. In 2022, approximately 2.3 million new cases were diagnosed globally, resulting in 670,000 deaths, underscoring the urgent need for improved diagnostic and prognostic strategies to reduce mortality and enhance patient outcomes. 1 Axillary lymph node (ALN) metastasis represents a critical determinant of prognosis and treatment planning in breast cancer, as it correlates with increased risks of recurrence and poorer survival. 2 3 Imaging modalities, including ultrasound (US), computed tomography (CT), magnetic resonance imaging (MRI), and positron emission tomography (PET), are routinely employed for ALN evaluation. 4 5 6 Recent advancements in artificial intelligence (AI) and machine learning (ML) have transformed medical imaging by enabling automated, quantitative analysis of complex patterns. 7 8 9 10 Despite these advances, several limitations persist in current approaches. Conventional ultrasound interpretations are subjective and operator-dependent, leading to variability in sensitivity and specificity for detecting ALN metastasis, particularly in early-stage disease where micrometastases may be overlooked. 11 12 13 14 15 16 This study aims to evaluate multiple machine learning algorithms and develop a validated model integrating ultrasound and Doppler features for preoperative prediction of axillary lymph node (ALN) metastasis in breast cancer patients, with Gradient Boosting selected as the optimal method and SHapley Additive exPlanations (SHAP) incorporated for interpretability. Specific objectives include: (1) extracting and selecting key imaging and clinicopathological features using recursive feature elimination (RFE) and SHAP; (2) constructing a combined model and comparing it against established scores (Logical, Tumor, and Tenon); (3) evaluating model performance across internal training, internal validation, and external validation cohorts from two centers using metrics such as AUC, sensitivity, specificity, calibration, and decision curve analysis; and (4) developing a web-based calculator for clinical application. We hypothesize that integrating ultrasound and Doppler features with ML and SHAP will yield superior predictive accuracy and interpretability compared to conventional models and scores, supporting noninvasive risk stratification and personalized treatment. Materials and Methods Study Population This retrospective, dual-center study included consecutive breast cancer patients who underwent preoperative ultrasound and Doppler ultrasound at two institutions: Women and Children’s Hospital, School of Medicine, Xiamen University (Xiamen, China) and Longyan First Hospital (Longyan, China), from April 2018 to August 2024. Eligibility criteria were: (1) histologically confirmed primary breast cancer; (2) preoperative ultrasound and Doppler evaluation of the primary tumor and ipsilateral regional lymph nodes performed at one of the two centers; (3) axillary lymph node (ALN) status confirmed by surgical pathology; and (4) availability of complete clinical, ultrasound, and Doppler data. Exclusion criteria were: (1) receipt of neoadjuvant therapy before imaging; (2) incomplete imaging or clinical data; (3) poor image quality precluding reliable measurements; and (4) distant metastasis at diagnosis. Ethical approval was obtained from the Institutional Review Board of Women and Children’s Hospital, School of Medicine, Xiamen University [KY-2025-046-K01]. Informed consent was waived due to the retrospective nature of the study, which posed minimal risk to participants and involved only anonymized data. All patient data were handled with strict confidentiality, and the study complied with the principles outlined in the Declaration of Helsinki. For model development and validation, cases from Xiamen were randomly partitioned into an internal training set (70%) and an internal validation set (30%), while the independent cohort from Longyan First Hospital was used for external validation. The patient inclusion flow is shown in Figure 1 Figure 1 Patient inclusion flow. Demographics and Clinical Data Demographic information, including age, menopausal status, and tumor location, was collected from the patients’ medical records. Clinical data encompassed histological grade, histological type, progesterone receptor (PR) status, human epidermal growth factor receptor 2 (Her2) status, Ki-67 index, p53 status, and vascular endothelial growth factor-C (VEGF-C) status. These parameters were obtained through pathological examination of surgical specimens or biopsy samples. Pathological diagnoses were independently conducted by two experienced pathologists. In cases where their interpretations differed, a third senior pathologist was consulted to participate in a joint review and discussion to reach a final consensus diagnosis. Ultrasound and Doppler Ultrasound Examination All ultrasound examinations were performed using high-resolution ultrasound systems equipped with Doppler capabilities (Philips EPIQ 7, with L18-4 linear probe) at two participating centers: Women and Children’s Hospital, School of Medicine, Xiamen University, Xiamen, China, and Longyan First Hospital, Longyan, China. To ensure consistency across centers, imaging followed a standardized protocol developed collaboratively between the sites, with all examinations conducted by experienced radiologists blinded to pathological outcomes. For each patient, both the breast tumor and the ipsilateral axillary lymph nodes (ALNs) were assessed in a uniform manner, including B-mode grayscale imaging for morphological evaluation and color/pulsed-wave Doppler for hemodynamic assessment. To mitigate potential operator dependency in feature extraction, radiologists at both centers underwent joint training sessions on the protocol, emphasizing standardized probe positioning, gain settings, and measurement techniques. All ultrasound interpretations were independently reviewed by two experienced radiologists (one from each center when possible). In cases of discordant interpretations, a third senior radiologist was consulted, and a consensus interpretation was reached through joint discussion and review of archived images. Features were extracted using predefined measurement protocols for reproducibility: ·Cortical and medullary areas (cm²): On grayscale images, cortical and medullary regions were manually outlined using the system’s caliper tool. Boundaries were defined based on echogenicity differences (hypoechoic cortex versus hyperechoic medulla with a clear demarcation line). Areas were calculated automatically by the software, and the cortex-to-medulla ratio (CH) was derived. Three measurements were averaged per lymph node to account for variability. Peak systolic flow velocity (PS, cm/s): Measured using pulsed-wave Doppler within the tumor and lymph nodes, targeting the most prominent vessel. Three Doppler waveforms were analyzed per node, with insonation angle correction maintained at ≤45° to minimize velocity estimation errors. End-diastolic flow velocity (EDF, cm/s): Assessed from the same Doppler spectra as PS, at the end-diastolic phase, with averaging across three waveforms per node and angle correction ≤45°. Systolic/diastolic velocity ratio (SD ratio): Calculated as the ratio of PS to EDF, reflecting vascular resistance, derived from averaged measurements. Resistance index (RI) and pulsatility index (PI): Automatically computed by the ultrasound machine from the Doppler spectra, using standard formulas (RI = (PS - EDF)/PS; PI = (PS - EDF)/mean velocity). All ultrasound interpretations and quantitative measurements were independently reviewed by two experienced radiologists at each center. If discrepancies occurred, a third senior radiologist adjudicated, and a consensus was reached through joint discussion. Interobserver variability was rigorously evaluated for these key features. For continuous variables (eg, areas, velocities, ratios, indices), intraclass correlation coefficients (ICCs) ranged from 0.85 to 0.95 across a subset of 50 cases reviewed independently by radiologists from both centers, indicating excellent reproducibility. This, combined with the standardized protocol and consensus mechanism, effectively addressed operator dependency and enhanced the reliability of feature extraction. Feature Extraction Continuous variables such as flow velocities and areas were averaged across three measurements per lesion or lymph node. For categorical ultrasound features—shape regularity (yes/no), boundary clarity (clear/obscure), echo pattern (homogeneous/heterogeneous), calcification (yes/no), and presence of calcification (yes/no)—agreement was evaluated using Cohen’s kappa coefficient. Model Comparison To facilitate a comprehensive evaluation of our predictive model, we compared its performance with three previously published and clinically relevant models for axillary lymph node metastasis (ALNM) prediction, namely the models proposed by Qiu et al. 9 17 15 Qiu et al developed a multivariable logistic regression model based on sonographic and clinicopathologic features in early-stage breast cancer patients, named Logical Score. Key predictors included lymph node transverse diameter, cortical thickness, hilum absence, histologic grade, tumor size, and estrogen receptor (ER) status. The final model equation was: Logical Score = 0.063 × a + 0.277 × b + 1.420 × c + 1.502 × d1 + 2.090 × d2 + 0.305 × e + 0.379 × f − 5.710 where p is the probability of ALNM; a = lymph node transverse diameter (mm); b = cortical thickness (mm); c = hilum absence (0 = no, 1 = yes); d1 and d2 = histologic grade dummy variables (G2, G3; G1 as reference); e = tumor size (cm); f = ER score (0–3). Zhang et al established a nationwide multi-center logistic regression model incorporating age, clinical T stage, tumor quadrant, local invasion, clinical nodal status, histologic type, and molecular subtype, named Tumor score. The model equation was: Tumor score = −0.014 × a + 0.204 × b2 + 0.663 × b3 − 0.944 × c1 − 0.529 × c2 − 1.444 × c3 − 0.237 × c4 − 0.642 × c5 + 0.768 × d + 1.235 × e + 2.944 × f1 + 2.884 × f2 + 2.111 × f3 + 0.322 × g1 + 0.141 × g2 − 2.483 where a = age; b2 and b3 = T2 and T3 stages (T1 as reference); c1–c5 = tumor location dummy variables (central, UIQ, UOQ, LIQ, LOQ, others); d = local invasion; e = clinical nodal status; f1–f3 = histologic type dummies; g1 and g2 = molecular subtype dummies. The Tenon score is a point-based clinical tool designed to predict non-sentinel lymph node (non-SLN) involvement in patients with positive SLN, aiming to reduce unnecessary axillary lymph node dissection (ALND). It is calculated by summing three components: size of SLN metastasis (0 or 2 points), primary tumor size (0, 1.5, or 3 points), and the ratio of positive SLNs to total SLNs removed (0, 1, or 2 points). A total score ≤ 3.5 is generally considered low risk for non-SLN involvement. For each of these models, the published coefficients or scoring rules were directly applied to our cohort to generate predicted probabilities or scores, enabling head-to-head performance comparison with our proposed model. Statistical Analysis Continuous variables were expressed as mean ± standard deviation (SD), while categorical variables were summarized as frequencies and percentages. Group differences between the training and validation cohorts, as well as between patients with and without lymph node metastasis, were evaluated using the Chi-square test or Fisher’s exact test for categorical variables and either the independent t U Data from Xiamen Maternal and Child Health Hospital were randomly partitioned into an internal training set (70%) and an internal validation set (30%). Data from Longyan First Hospital served as an independent external validation set to assess generalizability across centers. The internal training set was utilized to develop and optimize a broad array of ML classifiers, including Logistic Regression (LR), Random Forest (RF), Gradient Boosting (GB), Support Vector Classifier (SVC), Decision Tree, K-Nearest Neighbors (KNN), Naive Bayes, Extreme Gradient Boosting (XGBoost), Light Gradient Boosting Machine (LightGBM), Ridge Classifier, Extra Trees, Adaptive Boosting (AdaBoost), and an ensemble Voting Classifier. For the Gradient Boosting model, hyperparameter tuning was conducted exclusively within the internal training set using a grid search strategy combined with 10-fold cross-validation to ensure robust parameter optimization and avoid overfitting. The tuned parameters included the number of estimators (range: 50–500), learning rate (0.01–0.3), maximum tree depth (3–10), subsample ratio (0.6–1.0), and maximum features considered at each split (“sqrt” or “log2”). The area under the ROC curve (AUC-ROC) was used as the primary optimization metric. Feature selection using recursive feature elimination (RFE) was performed only within the training folds of cross-validation to avoid data leakage. Specifically, RFE was applied after each training fold split, and the selected features were then used to fit the model on that fold’s training data. The validation fold remained completely unseen during feature selection and model training, ensuring unbiased evaluation. Model performance was evaluated using multiple metrics: AUC-ROC, accuracy, sensitivity, specificity, positive predictive value (PPV), negative predictive value (NPV), precision, recall, and F1-score. The model exhibiting the highest AUC-ROC on the internal validation set was selected as the optimal predictive algorithm and subsequently evaluated on the external validation set from Longyan First Hospital. Additionally, the predictive performance of the ML models was benchmarked against traditional logistic regression models utilizing the same feature set. To enhance model interpretability and facilitate clinical trust, SHAP values were computed. SHAP quantifies the contribution of each input feature to the final prediction at both the global and individual patient levels. Feature importance rankings, as well as interaction effects between key ultrasound and Doppler parameters, were visualized through summary and dependence plots, enabling deeper insights into the model’s decision-making process. Result Basic Information of All Patients A total of 405 breast cancer patients were retrospectively enrolled in this study, including 212 in the internal training cohort, 91 in the internal validation cohort, and 102 in the external validation cohort. The mean age was similar across the three cohorts, and no statistically significant differences were observed in menopausal status, tumor location, body mass index, tumor diameter, multifocality, histological grade, pathological type, ER, PR, HER2 status, or Ki-67 index. Ultrasound parameters, including axillary lymph node short diameter, cortex thickness, cortex-to-hilum ratio, LNSD, LNPS, and LNEDF, as well as logical score, tumor score, and Tenon score, were also comparable among the three cohorts (all P > 0.05) ( Table 1 Table 1 Basic Characteristics of All Patients Variable Internal Training Internal Validation External Validation Statistic P value Lymph metastasis – No metastasis 115 (54.2%) 55 (60.4%) 61 (59.8%) 1.423 0.491 – Metastasis 97 (45.8%) 36 (39.6%) 41 (40.2%) Menopausal – Premenopausal 99 (46.7%) 46 (50.5%) 48 (47.1%) 0.398 0.82 – Postmenopausal 113 (53.3%) 45 (49.5%) 54 (52.9%) Location – Upper–out 57 (26.9%) 26 (28.6%) 33 (32.4%) 5.044 0.753 – Lower–out 26 (12.3%) 16 (17.6%) 13 (12.7%) – Upper inner 56 (26.4%) 19 (20.9%) 29 (28.4%) – Lower inner 58 (27.4%) 24 (26.4%) 23 (22.5%) – Center 15 (7.1%) 6 (6.6%) 4 (3.9%) Histological grade – I 43 (20.3%) 19 (20.9%) 26 (25.5%) 1.808 0.771 – II 59 (27.8%) 29 (31.9%) 27 (26.5%) – III 110 (51.9%) 43 (47.3%) 49 (48.0%) Histological type – Ductal 190 (89.6%) 82 (90.1%) 95 (93.1%) 1.914 0.727 – Lobular 10 (4.7%) 6 (6.6%) 4 (3.9%) – Other 12 (5.7%) 3 (3.3%) 3 (2.9%) ER – 1+ 27 (12.7%) 18 (19.8%) 17 (16.7%) 5.904 0.434 – 2+ 32 (15.1%) 8 (8.8%) 12 (11.8%) – 3+ 80 (37.7%) 29 (31.9%) 33 (32.4%) – Negative 73 (34.4%) 36 (39.6%) 40 (39.2%) PR – 1+ 28 (13.2%) 17 (18.7%) 22 (21.6%) 8.345 0.214 – 2+ 34 (16.0%) 15 (16.5%) 19 (18.6%) – 3+ 55 (25.9%) 14 (15.4%) 23 (22.5%) – Negative 95 (44.8%) 45 (49.5%) 38 (37.3%) HER2 – Negative 135 (63.7%) 60 (65.9%) 69 (67.6%) 0.507 0.776 – positive 77 (36.3%) 31 (34.1%) 33 (32.4%) Ki–67 – <14% 34 (16.0%) 20 (22.0%) 12 (11.8%) 3.7 0.157 – >14% 178 (84.0%) 71 (78.0%) 90 (88.2%) P53 – Negative 73 (34.4%) 34 (37.4%) 36 (35.3%) 0.239 0.887 – Positive 139 (65.6%) 57 (62.6%) 66 (64.7%) VEGF–C – Negative 55 (25.9%) 23 (25.3%) 32 (31.4%) 1.237 0.539 – Positive 157 (74.1%) 68 (74.7%) 70 (68.6%) Regular shape – yes 109 (51.4%) 47 (51.6%) 60 (58.8%) 1.653 0.438 – no 103 (48.6%) 44 (48.4%) 42 (41.2%) Boundary – clearly 99 (46.7%) 45 (49.5%) 50 (49.0%) 0.262 0.877 – obscure 113 (53.3%) 46 (50.5%) 52 (51.0%) Echo – homogeneous 100 (47.2%) 48 (52.7%) 48 (47.1%) 0.891 0.641 – heterogeneous 112 (52.8%) 43 (47.3%) 54 (52.9%) Calcification – no 103 (48.6%) 46 (50.5%) 56 (54.9%) 1.1 0.577 – yes 109 (51.4%) 45 (49.5%) 46 (45.1%) Age (years) 49.6 ± 8.7 49.6 ± 8.6 49.9 ± 9.5 0.053 0.974 Diameter (mm) 14.6 ± 5.3 13.5 ± 5.5 14.6 ± 5.3 3.347 0.188 Tumor peak systolic flow velocity, PS (cm/s) 38.2 ± 6.1 38.1 ± 6.2 38.9 ± 6.5 1.507 0.471 Tumor end-diastolic flow velocity, EDF (cm/s) 10.2 ± 2.1 9.8 ± 2.3 9.7 ± 2.4 4.438 0.109 Tumor systolic/diastolic ratio, SD 3.9 ± 1.0 4.2 ± 1.4 4.3 ± 1.4 5.542 0.063 Tumor resistance index, RI 0.6 ± 0.2 0.6 ± 0.2 0.6 ± 0.2 0.883 0.643 Tumor pulsatility index, PI 1.8 ± 0.3 1.8 ± 0.3 1.8 ± 0.3 0.985 0.611 Lymph node transverse diameter (mm) 6.0 ± 1.3 5.8 ± 1.3 5.9 ± 1.3 2.52 0.284 Lymph node longitudinal diameter (mm) 11.6 ± 2.0 11.5 ± 2.3 11.8 ± 2.1 0.999 0.607 Cortex-to-hilum area ratio, CH 1.9 ± 0.3 1.9 ± 0.3 1.9 ± 0.3 3.444 0.179 Lymph node PS (cm/s) 17.4 ± 6.1 17.5 ± 6.2 17.2 ± 5.8 0.26 0.878 Lymph node EDF (cm/s) 8.0 ± 2.0 8.0 ± 2.1 8.2 ± 1.8 0.914 0.633 Lymph node SD 3.3 ± 1.8 3.0 ± 1.3 2.9 ± 1.2 3.152 0.207 Lymph node RI 0.6 ± 0.2 0.6 ± 0.2 0.6 ± 0.2 0.021 0.99 Lymph node PI 1.7 ± 0.3 1.6 ± 0.3 1.7 ± 0.3 0.856 0.652 Logical Score 0.4 ± 0.2 0.3 ± 0.2 0.3 ± 0.2 1.495 0.474 Tumor Score 0.5 ± 0.2 0.6 ± 0.2 0.5 ± 0.2 1.17 0.557 Tenon Score 3.4 ± 1.5 3.3 ± 1.7 3.1 ± 1.5 2.006 0.367 Information in Training Cohort Table 2 Table 2 Data in Training Cohort Variable No Metastasis Metastasis Statistic P value Menopausal – Premenopausal 59 (51.3%) 40 (41.2%) 1.757 0.185 – Postmenopausal 56 (48.7%) 57 (58.8%) Location – Upper–out 32 (27.8%) 25 (25.8%) 2.51 0.643 – Lower–out 12 (10.4%) 14 (14.4%) – Upper inner 33 (28.7%) 23 (23.7%) – Lower inner 32 (27.8%) 26 (26.8%) – Center 6 (5.2%) 9 (9.3%) Histological grade – I 22 (19.1%) 21 (21.6%) 0.229 0.892 – II 32 (27.8%) 27 (27.8%) – III 61 (53.0%) 49 (50.5%) Histological type – Ductal 101 (87.8%) 89 (91.8%) 0.172 0.519 – Lobular 7 (6.1%) 3 (3.1%) – Other 7 (6.1%) 5 (5.2%) ER – 1+ 16 (13.9%) 11 (11.3%) 0.544 0.909 – 2+ 16 (13.9%) 16 (16.5%) – 3+ 44 (38.3%) 36 (37.1%) – Negative 39 (33.9%) 34 (35.1%) PR – 1+ 16 (13.9%) 12 (12.4%) 3.386 0.336 – 2+ 20 (17.4%) 14 (14.4%) – 3+ 24 (20.9%) 31 (32.0%) – Negative 55 (47.8%) 40 (41.2%) HER2 – Negative 77 (67.0%) 58 (59.8%) 0.878 0.349 – positive 38 (33.0%) 39 (40.2%) Ki–67 – <14% 20 (17.4%) 14 (14.4%) 0.158 0.691 – >14% 95 (82.6%) 83 (85.6%) P53 – Negative 49 (42.6%) 24 (24.7%) 6.669 0.01 – Positive 66 (57.4%) 73 (75.3%) VEGF–C – Negative 43 (37.4%) 12 (12.4%) 15.867 <0.001 – Positive 72 (62.6%) 85 (87.6%) Regular shape – yes 54 (47.0%) 55 (56.7%) 1.629 0.202 – no 61 (53.0%) 42 (43.3%) Boundary – clearly 51 (44.3%) 48 (49.5%) 0.37 0.543 – obscure 64 (55.7%) 49 (50.5%) Echo – homogeneous 57 (49.6%) 43 (44.3%) 0.388 0.534 – heterogeneous 58 (50.4%) 54 (55.7%) Calcification – no 49 (42.6%) 54 (55.7%) 3.09 0.079 – yes 66 (57.4%) 43 (44.3%) Age (years) 48.9 ± 8.9 50.5 ± 8.4 4966 0.169 Diameter (mm) 11.9 ± 4.1 17.9 ± 4.6 1841.5 <0.001 Tumor peak systolic flow velocity, PS (cm/s) 38.9 ± 6.2 37.3 ± 6.0 6359 0.079 Tumor end-diastolic flow velocity, EDF (cm/s) 10.2 ± 2.1 10.3 ± 2.1 5433 0.746 Tumor systolic/diastolic ratio, SD 4.0 ± 1.0 3.8 ± 1.0 6203 0.16 Tumor resistance index, RI 0.6 ± 0.2 0.6 ± 0.2 4886 0.12 Tumor pulsatility index, PI 1.8 ± 0.3 1.8 ± 0.3 5561 0.971 Lymph node transverse diameter (mm) 5.8 ± 1.2 6.3 ± 1.3 4379 0.006 Lymph node longitudinal diameter (mm) 11.5 ± 2.0 11.8 ± 1.9 5059 0.239 Cortex-to-hilum area ratio, CH 1.8 ± 0.2 2.0 ± 0.3 3260 <0.001 Lymph node PS (cm/s) 15.9 ± 5.7 19.2 ± 6.1 3789 <0.001 Lymph node EDF (cm/s) 8.1 ± 1.9 7.8 ± 2.2 5797 0.623 Lymph node SD 2.4 ± 0.9 4.4 ± 2.1 1299 <0.001 Lymph node RI 0.6 ± 0.2 0.6 ± 0.2 6171 0.183 Lymph node PI 1.7 ± 0.3 1.7 ± 0.3 4895 0.125 Logical Score 0.3 ± 0.2 0.4 ± 0.2 4541 0.02 Tumor Score 0.5 ± 0.2 0.5 ± 0.2 5387 0.669 Tenon Score 3.0 ± 1.5 3.8 ± 1.4 3916 <0.001 Performance Comparison of Machine Learning Algorithms and Feature Selection In the internal training cohort, Figure 2A Figure 2B Figure 2C Figure 2D Figure 2E Figure 2 Performance comparison of machine learning algorithms and feature selection. ( A B C D E ROC Figure 3 Supplementary Table 1 Figure 3 Figure 3A Figure 3B Figure 3C Figure 3 Receiver operating characteristic (ROC) curves for the Combined Model, Logical Score, Tumor Score, and Tenon Score in predicting axillary lymph node metastasis across cohorts. ( A B C Correspondingly, Supplementary Table 1 Calibration Curve Figure 4 Supplementary Table 2 Figure 4 Figure 4A Figure 4B Figure 4C Supplementary Table 2 Figure 4 Calibration curves for the Combined Model, Logical Score, Tumor Score, and Tenon Score in predicting axillary lymph node metastasis across cohorts. ( A B C Decision Curve Analysis (DCA) Curve Figure 5 Supplementary Table 3 Figure 5 Figure 5A Figure 5B Figure 5C Supplementary Table 3 Figure 5 Decision curve analysis (DCA) for the Combined Model, Logical Score, Tumor Score, and Tenon Score in predicting axillary lymph node metastasis across cohorts. ( A B C Waterfall in Different Scene Figure 6 Figure 6 Waterfall plots of individual predicted risk scores stratified by classification outcome. ( A B C D Construction and Testing of the Web-Based Calculator To ensure simplicity and user-friendliness, we developed a web-based calculator for predicting axillary lymph node (ALN) metastasis in breast cancer patients (URL: https://lymphatic-metastasis-2rkk8cjhfei7krq2xmehdy.streamlit.app/ Figure 7 Figure 7 Web-based calculator demonstration. To evaluate usability and accuracy, we conducted a clinician-based pilot test involving 10 breast imaging specialists from the two participating centers. Each clinician was asked to input 30 anonymized cases with known pathological outcomes into the calculator. The results were compared with the gold-standard pathological diagnoses, yielding an overall prediction accuracy of 89%, with positive and negative predictive values of 87% and 90%, respectively. All participants reported that the interface was intuitive, and the input process required less than one minute per patient, supporting its feasibility for clinical use. Discussion The primary objective of this study was to evaluate and compare 11 machine learning algorithms to identify the optimal method for integrating ultrasound and Doppler features in the preoperative prediction of axillary lymph node (ALN) metastasis in breast cancer patients, incorporating SHapley Additive exPlanations (SHAP) for interpretability. Key findings revealed that Gradient Boosting emerged as the superior algorithm, enabling a combined model that demonstrated exceptional discriminatory performance (AUC >0.95 across cohorts) and clinical net benefit relative to established clinicopathological scores, with tumor diameter, cortex-to-hilum ratio (CH), and Doppler parameters identified as the top predictors. The model’s feature selection underscores the biological relevance of noninvasive ultrasound markers in metastasis detection. Tumor diameter, as the leading feature, aligns with established tumor biology, where larger lesions promote lymphatic invasion through enhanced proliferative activity and extracellular matrix degradation, potentially activating pathways like PI3K/AKT that facilitate epithelial-mesenchymal transition. 18 19 20 Comparisons with prior literature affirm the model’s contributions while addressing discrepancies. Ultrasound-based ML models, such as that by Zheng et al, reported an AUC of 0.88 using dynamic video features but lacked multi-center validation, contrasting our AUCs exceeding 0.95 with external testing, likely due to our incorporation of Doppler hemodynamics absent in their grayscale-focused approach. 16 13 8 15 14 The significance of these findings lies in advancing precision oncology through accessible tools. Academically, the model refines understanding of ultrasound features as surrogates for molecular events, such as VEGF-mediated angiogenesis linked to Doppler alterations, potentially guiding biomarker discovery. 7 3 1 4 Limitations and Future Directions Despite the promising results, our study has several limitations. First, although the data were collected from two independent centers, the overall sample size remains relatively small, which may limit the statistical power and generalizability of our findings. Larger-scale, multi-center studies involving more diverse patient populations are warranted to further validate the robustness of the model. Second, while our dual-center design improves external validity compared to single-center studies, both participating institutions are located within the same geographic region, and potential regional or institutional biases cannot be entirely excluded. Third, the current model was developed solely from ultrasound and Doppler ultrasound features. Incorporating additional imaging modalities (eg, MRI, PET/CT) and integrating molecular or serological biomarkers may further enhance predictive performance. Fourth, the present study did not directly evaluate how model predictions translate into patient-centered clinical outcomes, such as overall survival, disease-free survival, recurrence rates, or reduction in unnecessary sentinel lymph node biopsy (SLNB) or axillary lymph node dissection (ALND). Finally, the model has not yet been embedded into a clinical decision-support system, which may limit its immediate applicability in daily practice. Future research should aim to: (1) validate the model in larger, geographically diverse, multi-center cohorts to improve generalizability; (2) prospectively evaluate the impact of model-guided decision-making on patient outcomes, including survival, recurrence, and avoidance of unnecessary SLNB/ALND, thereby providing concrete evidence of clinical utility; (3) integrate multimodal imaging and molecular biomarkers to enhance accuracy; and (4) develop and test user-friendly, automated software platforms for real-time clinical use, ultimately facilitating widespread adoption and improving the efficiency of axillary staging in breast cancer management. Conclusion In summary, this interpretable ML model enhances ALN metastasis prediction by leveraging ultrasound features, offering superior accuracy and utility over traditional scores. Future research should explore prospective integration with multimodal data and long-term outcome assessments to maximize clinical translation. Acknowledgments The authors would like to thank Dr. Huang Rushao from the Department of Ultrasound, Longyan First Hospital, for generously providing 102 patient cases for use as the external validation cohort in this study. The authors confirm that they have no financial or personal conflicts of interest associated with the publication of this manuscript. They also attest that all data and analyses included are original and faithfully represent the outcomes of the study. Ethical Statement Ethical approval was obtained from the Institutional Review Board of Women and Children’s Hospital, School of Medicine, Xiamen University [KY-2025-046-K01]. Informed consent was waived due to the retrospective nature of the study, which posed minimal risk to participants and involved only anonymized data. All patient data were handled with strict confidentiality, and the study complied with the principles outlined in the Declaration of Helsinki. Disclosure The authors report no conflicts of interest in this work. References 1. World Health Organization Breast cancer[EB/OL]. (2024-03-13)[2025-08-10] Available from https://www.who.int/news-room/fact-sheets/detail/breast-cancer Accessed September 22 2. Lehman CD Gatsonis C Romanoff J Axillary nodal evaluation in breast cancer: state of the art Radiology 2020 295 3 500 515 10.1148/radiol.2020192534 32315268 3. Giuliano AE Edge SB Hortobagyi GN Eighth edition of the AJCC cancer staging manual: breast cancer Ann Surg Oncol 2018 25 7 1783 1785 10.1245/s10434-018-6486-6 29671136 4. Senkus E Kyriakides S Ohno S Primary breast cancer: ESMO clinical practice guidelines for diagnosis, treatment and follow-up Ann Oncol 2015 26 Suppl 5 v8 v30 10.1093/annonc/mdv298 26314782 5. Evans A Trimboli RM Athanasiou A Breast ultrasound: recommendations for information to women and referring physicians by the European Society of Breast Imaging Insights Into Imaging 2018 9 4 449 455 10.1007/s13244-018-0636-z 30094592 PMC6108964 6. Yang WT Chang CB Park HL Role of color Doppler sonography in the evaluation of malignant lymphomas of the neck J Ultrasound Med 2002 21 9 987 994 10.7863/jum.2002.21.9.987 7. Bi WL Hosny A Schabath MB Artificial intelligence in cancer imaging: clinical challenges and applications CA 2019 69 2 127 157 10.3322/caac.21552 30720861 PMC6403009 8. Wang SR Cao CL Du TT Machine learning model for predicting axillary lymph node metastasis in clinically node positive breast cancer based on peritumoral ultrasound radiomics and SHAP feature analysis J Ultrasound Med 2024 43 9 1611 1625 10.1002/jum.16483 38808580 9. Qiu SQ Zeng HC Zhang F A nomogram to predict the probability of axillary lymph node metastasis in early breast cancer patients with positive axillary ultrasound Sci Rep 2016 6 21196 10.1038/srep21196 26875677 PMC4753408 10. Lundberg SM Erion G Chen H From local explanations to global understanding with explainable AI for trees Nature Mach Intell 2020 2 1 56 67 10.1038/s42256-019-0138-9 32607472 PMC7326367 11. Alvarez S Añorbe E Alcorta P Role of sonography in the diagnosis of axillary lymph node metastases in breast cancer: a systematic review Am J Roentgenol 2006 186 5 1342 1348 10.2214/AJR.05.0936 16632729 12. Cetin Tuncez H Murat Koc A Hilal Adibelli Z Diagnostic efficacy of ultrasonography, Doppler ultrasonography and elastography in the evaluation of suspected malignant lymph nodes J Ultrason 2023 23 92 1 9 10.15557/JoU.2023.0001 36880001 PMC9985183 13. Yu Y He Z Ouyang J Deep learning radiomics based prediction of axillary lymph node metastasis in breast cancer using ultrasound images Npj Breast Cancer 2024 10 1 18 10.1038/s41523-024-00628-4 38472210 PMC10933422 14. Ali S Abedi A Khankeshipour A Explainable artificial intelligence in breast cancer detection and risk prediction: a systematic scoping review Cancer Innovation 2024 3 2 e136 10.1002/cai2.136 39430216 PMC11488119 15. Rouzier R Uzan C Rousseau A Multicenter prospective evaluation of the reliability of the combined use of two models to predict non-sentinel lymph node status in breast cancer patients with metastatic sentinel lymph nodes: the MSKCC nomogram and the Tenon score. Results of the NOTEGS study Br J Cancer 2017 116 9 1135 1140 10.1038/bjc.2017.47 28324891 PMC5418441 16. Zheng X Yao B Liu Y A deep learning model and human-machine fusion for prediction of EBV-associated gastric cancer from histopathology Nat Commun 2022 13 1 2797 10.1038/s41467-022-30491-2 35589792 PMC9120175 17. Zhang J Li X Huang R A nomogram to predict the probability of axillary lymph node metastasis in female patients with breast cancer in China: a nationwide, multicenter, 10-year epidemiological study Oncotarget 2017 8 21 35311 35325 10.18632/oncotarget.13330 27852049 PMC5471057 18. Hanahan D Weinberg RA Hallmarks of cancer: the next generation Cell 2011 144 5 646 674 10.1016/j.cell.2011.02.013 21376230 19. Carter CL Allen C Henson DE Relation of tumor size, lymph node status, and survival in 24,740 breast cancer cases Cancer 1989 63 1 181 187 10.1002/1097-0142(19890101)63:1 2910416 20. Folkman J Role of angiogenesis in tumor growth and metastasis Semin Oncol 2002 29 6 Suppl 16 15 18 10.1053/sonc.2002.37263 12516034 ",
  "metadata": {
    "Title of this paper": "Role of angiogenesis in tumor growth and metastasis",
    "Journal it was published in:": "Cancer Management and Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482940/"
  }
}