{
  "title": "Paper_38",
  "abstract": "pmc Nutr Metab (Lond) Nutr Metab (Lond) 272 nutrmeta Nutrition & Metabolism 1743-7075 BMC PMC12490156 PMC12490156.1 12490156 12490156 10.1186/s12986-025-01011-1 1011 1 Review Vitamin D and bone health: from physiological function to disease association Liu Yu 1 2 Wang Wei 1 2 Yang Yusheng 1 Deng Jiezhong 13350335437@163.com 1 Zhang Zehua zhangzehuatmmu@163.com 1 1 https://ror.org/02jn36537 grid.416208.9 0000 0004 1757 2259 Department of Orthopedics, Southwest Hospital, Third Military Medical University (Army Medical University), 2 https://ror.org/05w21nn13 grid.410570.7 0000 0004 1760 6682 College of Basic Medical Science, Third Military Medical University (Army Medical University, 2 10 2025 2025 22 478882 113 25 6 2025 8 9 2025 02 10 2025 03 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Vitamin D (VD) is a pleiotropic secosteroid hormone with well-established roles in calcium homeostasis, bone metabolism, and emerging functions in immune regulation, inflammation, and chronic disease modulation. In this paper, we provide a comprehensive summary of the current research on the significance of VD for bone health, with emphasis on its mechanism of action and its clinical significance in bone health. This review starts with an overview of VD metabolism, with emphasis on the enzyme transformation of vitamin D3 (VD3) and vitamin D2 (VD2) into the active 1,25-dihydroxyvitamin D (1α,25(OH) 2 Keywords Vitamin D Bone destruction diseases Immunoregulation https://doi.org/10.13039/501100001809 National Natural Science Foundation of China 81972082 Zhang Zehua Chongqing Postdoctoral Program for Innovative Talents CQYC202105037 Zhang Zehua pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Vitamin D (VD) is a secosteroid hormone that plays a crucial role in calcium absorption and bone mineralization. There are two primary forms of VD: VD3, which is important for animals and synthesized in the skin, and VD2, which is produced by plants [ 1 2 3 2 4 2 5 6 7 8 7 4 2 9 The biological activity of 1α,25(OH) 2 10 11 12 2 10 2 13 14 14 13 The function of the VDR in combination with co-activators relies on the binding of 1α,25(OH) 2 13 2 10 13 10 13 10 VD is an essential hormone that facilitates calcium absorption and bone mineralization, which are positively correlated with bone mineral density (BMD). The metabolite of VD3, 1α,25(OH) 2 15 2 16 2 17 18 2 4 11 16 11 The component and functions of VD VD is derived from two main sources: the endogenous pathway and the exogenous pathway. The synthesis of VD is influenced by several factors, with geographical location being a key determinant of its synthesis efficiency. Furthermore, lifestyle, environmental, and physiological factors also impact VD production [ 3 1 19 2 20 2 21 2 2 2 22 2 2 23 2 20 2 2 24 25 2 2 26 1 The genomic activity of 1α,25(OH) 2 2 27 2 28 2 13 29 30 29 30 31 24 32 10 10 33 However, the pleiotropic activities of VD are unable to be fully explained by VDR-mediated transcriptional regulation, which demonstrate the existence of rapid and non-genomic activity of VD. G-coupled membrane receptor (GPCR) was found to involve in VD signaling and after 1α,25(OH) 2 34 35 2+ 2 2 34 VD plays a pivotal role in regulating the innate immune response, including the upregulation of cathelicidin, activation of cytokine production, promotion of autophagy, and other related mechanisms [ 36 37 38 39 40 41 42 43 43 The VDR gene has various polymorphisms, such as TaqI, ApaI, BsmI, FokI, and Cdx2, which are associated with a spectrum of diseases. Specifically, the FokI SNP is linked to an increased risk of coronary artery disease (CAD) [ 44 45 46 47 48 48 48 47 49 50  Fig. 1 Synthesis and Metabolism of VD. (1) (2) (3) 2 2 (4) Vitamin D deficiency Vitamin D deficiency is a significant global concern, particularly among pediatric and geriatric populations. This deficiency is influenced by various factors, including gender, age, latitude, weather conditions, cultural and social aspects [ 51 52 52 53 52 53 Maternal VD insufficiency during pregnancy is a global public health concern [ 54 2+ 54 55 56 57 58 59 57 54 54 60 54 61 56 54 Multiple digestive system diseases can lead to vitamin D deficiency. CKD is a prevalent disease worldwide, and it can result in a high risk of vitamin D deficiency. This deficiency is associated with various adverse outcomes, such as bone disease, cardiovascular disease, increased mortality and secondary hyperparathyroidism (SHPT) [ 62 25 63 63 64 65 66 67 69 1  Table 1 Vitamin D deficiency and diseases Risk population and risk diseases​​ ​​Key characteristics​​ Bone health consequence ​​Clinical recommendations​ Infants & children The highest risk of developing vitamin D deficiency (exclusive breastfeeding in developing countries) Peak bone mass decrease (males) Decreased bone mineralization Maintain 25(OH)D ≧ 75 nmol/L Pregnant women Maternal obesity Autoimmune diseases Neutral to slightly negative calcium balance VD supplementation Screen the VD levels of pregnant women Chronic kidney disease (CKD) Increase serum calcium High risk of vitamin D deficiency Bone diseases SHPT High-dose cholecalciferol supplementation (the safety and efficacy uncertain) Malabsorption syndromes Malabsorption Result in deficiency of VD Osteomalacia VD supplementation Vitamin D in the pathogenesis of bone-destructive diseases Osteoarthritis (OA) OA, one of the most common degenerative joint disorders, has affected more than 500 million population worldwide, especially the elderly [ 70 71 72 73 74 74 75 Evidences suggest that VD plays an important role in the progression of OA [ 76 77 78 79 80 76 81 82 83 84 Sufficient 1,25(OH) 2 2 85 2 86 2 82 87 87 88 89 90 91 92 93 Patients with sufficient VD is less likely to develop OA, and VD sufficiency and supplementation reduce articular cartilage degeneration radiographically. Zhiqiang Wang et al. found among patients who did not have knee surgery, there is a significant improvement in Western Ontario and McMaster Universi ties Osteoarthritis Index (WOMAC) function in VD supplementation group compared to the placebo group [ 94 77 95 96 97 98 99 100 It is reported expression of VDR in the articular cartilage of OA patients, but not in that of healthy volunteers [ 76 95 101 102 The effect of VD in OA treatment is controversial. In the past, the majority of studies have shown that VD supplementation has no effect on pain and function improvement in patients with KOA. However, with further in-depth researches coming out, VD were demonstrated to have a strong association with OA. Although supplementation of VD is instrumental to relieve pain in patients of OA to some extent, the evidence is not enough on the effect of VD supplementation on OA prevention [ 95 103 104 2 105 2 Osteoporosis (OP) OP is a common systematical skeletal disorder among the elderly. With the aging of population, OP has risen to a major public health problem in the past decade. As a metabolic bone disease, OP is characterized by reduced bone mass, micro-structural deterioration and bone fragility, which contributes to the low bone mineral density and increased risk of fractures [ 106 107 108 109 Vitamin D deficiency is associated with OP, which is significant to the calcium homeostasis and bone mineralization in our bodies. Vitamin D deficiency can lead to secondary hyperparathyroidism, leading to bone turnover, osteomalacia, bone loss and osteoporotic fractures [ 110 111 112 2 2 113 114 115 110 114 116 However, research results about the effect of VD supplementation on OP and fractures are inconsistent. VD supplementation in healthy middle-aged and elderly people may be ineffective in reducing the fracture risk [ 117 118 111 119 120 121 122 123 114 124 2 Rheumatoid arthritis (RA) RA is a chronic, immune, and systemic inflammatory disease that can lead to OP, disability, and even mortality [ 125 127 128 129 130 131 132 133 86 134 In recent years, the association between vitamin D deficiency and RA has gained significant attention [ 128 135 136 125 126 130 131 135 137 138 136 139 The fundamental mechanisms by which VD affects RA have been widely reported [ 140 142 139 143 2 144 2 137 145 2 130 2 143 2 Bone tuberculosis Tuberculosis is a chronic infectious disease caused by Mycobacterium tuberculosis 146 147 148 Research has found Vitamin D deficiency is associated with the setup and development of spinal tuberculosis. The serum concentration of 25(OH)D in spinal tuberculosis group was lower compared with healthy control group. People with low serum level of VD (< 25 nmol/L) were more likely to develop necrotic lesions than patients with high serum VD concentration (≥ 25 nmol/L) [ 149 2 150 151 VD, specifically its active Metabolite 1,25(OH) 2 150 151 147 149 Due to ultraviolet radiation, PTH, VDR gene polymorphism and other factors, the specific effect and dosage of VD in the treatment of tuberculosis are still uncertain. Clinical evidence regarding VD supplementation for tuberculosis prevention or treatment remains mixed. While some studies, like a prospective case-control study in India, found a significantly higher prevalence of tuberculosis among VD-deficient individuals compared to sufficient one [ 152 153 151 148 150 2  Fig. 2 VD and bone destruction diseases. It displayed the roles of VD in various physiological processes related to bone health and immune function. (Left Section) 2 (Middle Section) (Right Section) Discussion Previous studies mainly focused on the classical roles of VD in calcium metabolism and bone mineralization. Now, it has been discovered that VD not only regulates bone homeostasis but also functions as a signaling molecule to modulate the immune, inflammatory and microbiota responses of the body. The genomic and non-genomic signaling pathways mediated by the VDR underpin its diverse biological effects, spanning osteoblast-osteoclast crosstalk, innate and adaptive immunity, and chronic disease modulation. While the skeletal benefits of VD in preventing rickets and osteomalacia are well-established, its therapeutic potential in complex bone destruction diseases such as OA, OP, RA, and tuberculosis, remains contentious. For instance, in OA, conflicting clinical evidence highlights the dual nature of VD, where supplementation may mitigate cartilage degradation and pain in select cohorts but fails to universally alter disease progression. Similarly, in OP, vitamin D deficiency exacerbates bone loss, yet the efficacy of supplementation is highly dependent on baseline levels, concomitant calcium intake, and genetic polymorphisms in VDR and CYP enzymes. The immunomodulatory effects of VD further complicate its role in autoimmune-driven conditions like RA, where it suppresses pathogenic Th17 responses while promoting regulatory T-cell activity, yet fails to consistently correlate with reduced radiographic damage in clinical studies. A critical gap in current understanding Lies in defining context-specific thresholds for VD sufficiency, particularly for non-skeletal outcomes. While 25(OH)D levels > 50 nmol/L are widely accepted for bone health, optimal thresholds for immune regulation or Metabolic modulation remain undefined. Furthermore, the interplay between VDR polymorphisms and disease susceptibility underscores the need for personalized supplementation strategies, as genetic variants influence receptor function, Ligand affinity, and downstream gene expression. Due to improper use of VD, reports of VD poisoning have increased significantly since 2010. The toxicity of VD is mainly mediated by hypercalcemia. The symptoms can range from mild (such as thirst and polyuria) to severe (such as seizures, coma and death), and are more common in children and the elderly [ 154 155 156 157 158 Emerging evidence highlights the complex disease-modifying roles of VD across bone destruction disorders, though therapeutic translation remains nuanced. In OA, VD’s putative anti-inflammatory and chondroprotective mechanisms including suppression of matrix metalloproteinases and enhancement of autophagy via AMPK/mTOR signaling contrast with inconsistent clinical outcomes. While observational studies correlate Vitamin D deficiency with accelerated cartilage degradation and pain severity, randomized trials demonstrate marginal structural benefits despite modest symptomatic improvements in WOMAC scores. This discrepancy may reflect threshold-dependent effects, as higher serum 1,25(OH) 2 2 Compared with previous systematic reviews on VD and bone-related diseases, this review systematically elucidates the molecular-cellular-disease cascade mechanisms of VD in multifactorial bone-destructive disorders such as OA, OP, RA and tuberculosis, covering immune regulation, autophagy-mediated osteocyte homeostasis maintenance, classical VDR-RXR nuclear transcriptional regulation, and non-genomic membrane receptor-mediated rapid calcium signaling responses. It further integrates epigenetic regulatory mechanisms with VDR gene polymorphisms, addressing the shortcomings of existing reviews in the integration of cross-disease mechanisms and the depth of epigenetic regulatory mechanisms [ 159 162 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Yu Liu and Wei Wang contributed equally. Acknowledgements We are grateful to the members of our lab and our partners for attentively reading the text and providing insightful feedback. All the original elements used in the figures are acquired from Biorender ( https://app.biorender.com/ Author contributions ZHZ and JZD designed and directed the review. YL and WW contributed to collecting the resources and writing the manuscript. YL, WW and YSY contributed to designing and drawing the figures and tables. All authors critically read and approved the final manuscript. Funding This work was supported by a grant from the National Natural Science Foundation of China (81972082) and a grant from the Chongqing Postdoctoral Program for Innovative Talents (CQYC202105037). Data availability No datasets were generated or analysed during the current study. Declarations Competing interests The authors declare no competing interests. Compliance with ethics requirements This article does not involve any studies with human or animal subjects. References 1. Saponaro F Saba A Zucchi R An update on vitamin D metabolism Int J Mol Sci 2020 10.3390/ijms21186573 32911795 PMC7554947 Saponaro F, Saba A, Zucchi R. An update on vitamin D metabolism. Int J Mol Sci. 2020. 10.3390/ijms21186573. 32911795 10.3390/ijms21186573 PMC7554947 2. Ismailova A White JH Vitamin D. Infections and immunity Rev Endocr Metab Disord 2022 23 265 77 10.1007/s11154-021-09679-5 34322844 PMC8318777 Ismailova A, White JH. Vitamin D. Infections and immunity. Rev Endocr Metab Disord. 2022;23:265–77. 10.1007/s11154-021-09679-5. 34322844 10.1007/s11154-021-09679-5 PMC8318777 3. Bekas KN Zafeiris C The role of bone mineral density in a successful lumbar interbody fusion: a narrative review Cureus 2024 10.7759/cureus.54727 38524011 PMC10960932 Bekas KN, Zafeiris C. The role of bone mineral density in a successful lumbar interbody fusion: a narrative review. Cureus. 2024. 10.7759/cureus.54727. 38524011 10.7759/cureus.54727 PMC10960932 4. Goltzman D Functions of vitamin D in bone Histochem Cell Biol 2018 10.1007/s00418-018-1648-y 29435763 Goltzman D. Functions of vitamin D in bone. Histochem Cell Biol. 2018. 10.1007/s00418-018-1648-y. 29435763 10.1007/s00418-018-1648-y 5. Kazemian E Pourali A Sedaghat F Karimi M Basirat V Sajadi Hezaveh Z Davoodi SH Holick MF Effect of supplemental vitamin D3 on bone mineral density: a systematic review and meta-analysis Nutr Rev 2023 81 511 30 10.1093/nutrit/nuac068 36308775 Kazemian E, Pourali A, Sedaghat F, Karimi M, Basirat V, Sajadi Hezaveh Z, et al. Effect of supplemental vitamin D3 on bone mineral density: a systematic review and meta-analysis. Nutr Rev. 2023;81:511–30. 10.1093/nutrit/nuac068. 36308775 10.1093/nutrit/nuac068 6. Hou Y-C Lu C-L Zheng C-M Liu W-C Yen T-H Chen R-M Lin Y-F Chao C-T Lu K-C The role of vitamin D in modulating mesenchymal stem cells and endothelial progenitor cells for vascular calcification IJMS 2020 21 2466 10.3390/ijms21072466 32252330 PMC7177675 Hou Y-C, Lu C-L, Zheng C-M, Liu W-C, Yen T-H, Chen R-M, Lin Y-F, Chao C-T, Lu K-C. The role of vitamin D in modulating mesenchymal stem cells and endothelial progenitor cells for vascular calcification. IJMS. 2020;21:2466. 10.3390/ijms21072466. 32252330 10.3390/ijms21072466 PMC7177675 7. Vitamin D. Supplementation and Bone Health, (2018). 8. Wu X Song M Qiu P Li F Wang M Zheng J Wang Q Xu F Xiao H A metabolite of nobiletin, 4′-demethylnobiletin and Atorvastatin synergistically inhibits human colon cancer cell growth by inducing G0/G1 cell cycle arrest and apoptosis Food Funct 2018 9 87 95 10.1039/C7FO01155E 29063088 PMC6375479 Wu X, Song M, Qiu P, Li F, Wang M, Zheng J, Wang Q, Xu F, Xiao H. A metabolite of nobiletin, 4′-demethylnobiletin and Atorvastatin synergistically inhibits human colon cancer cell growth by inducing G0/G1 cell cycle arrest and apoptosis. Food Funct. 2018;9:87–95. 10.1039/C7FO01155E. 29063088 10.1039/c7fo01155e PMC6375479 9. Kuang X Liu C Guo X Li K Deng Q Li D The combination effect of vitamin K and vitamin D on human bone quality: a meta-analysis of randomized controlled trials Food Funct 2020 11 3280 97 10.1039/c9fo03063h 32219282 Kuang X, Liu C, Guo X, Li K, Deng Q, Li D. The combination effect of vitamin K and vitamin D on human bone quality: a meta-analysis of randomized controlled trials. Food Funct. 2020;11:3280–97. 10.1039/c9fo03063h. 32219282 10.1039/c9fo03063h 10. Carlberg C Vitamin D and its target genes Nutrients 2022 14 1354 10.3390/nu14071354 35405966 PMC9003440 Carlberg C. Vitamin D and its target genes. Nutrients. 2022;14:1354. 10.3390/nu14071354. 35405966 10.3390/nu14071354 PMC9003440 11. Suda T Physiological functions of vitamin D: what we have learned from global and conditional VDR knockout mouse studies Curr Opin Pharmacol 2015 10.1016/j.coph.2015.04.001 25938686 Suda T. Physiological functions of vitamin D: what we have learned from global and conditional VDR knockout mouse studies. Curr Opin Pharmacol. 2015. 10.1016/j.coph.2015.04.001. 25938686 10.1016/j.coph.2015.04.001 12. Li Y Zhao P Jiang B Liu K Zhang L Wang H Tian Y Li K Liu G Modulation of the vitamin d/vitamin D receptor system in osteoporosis pathogenesis: insights and therapeutic approaches J Orthop Surg Res 2023 10.1186/s13018-023-04320-4 37957749 PMC10644527 Li Y, Zhao P, Jiang B, Liu K, Zhang L, Wang H, et al. Modulation of the vitamin d/vitamin D receptor system in osteoporosis pathogenesis: insights and therapeutic approaches. J Orthop Surg Res. 2023. 10.1186/s13018-023-04320-4. 37957749 10.1186/s13018-023-04320-4 PMC10644527 13. Haussler MR Jurutka PW Mizwicki M Norman AW Vitamin D receptor (VDR)-mediated actions of 1α,25(OH)2vitamin D3: genomic and non-genomic mechanisms Best Pract Res Clin Endocrinol Metab 2011 25 4 543 59 10.1016/j.beem.2011.05.010 21872797 Haussler MR, Jurutka PW, Mizwicki M, Norman AW. Vitamin D receptor (VDR)-mediated actions of 1α,25(OH)2vitamin D3: genomic and non-genomic mechanisms. Best Pract Res Clin Endocrinol Metab. 2011;25(4):543–59. 10.1016/j.beem.2011.05.010. 21872797 10.1016/j.beem.2011.05.010 14. Bakke D, Sun J. Ancient nuclear receptor VDR with new functions: Microbiome and inflammation. Inflamm Bowel Dis. 2018;24(6):1149–54. 10.1093/ibd/izy092. 10.1093/ibd/izy092 PMC6148749 29718408 15. Department of Surgery, The University of Melbourne, Australia Me B P P Biomechanics and Spine Research Group, Queensland University of Technology, Australia Cp R Western Clinical School, The University of Melbourne, Australia Effect of vitamin D supplementation on fracture healing: a systematic review of prospective clinical trials JSM Bone and Joint Dis 2022 3 1 7 10.47739/2578-3351.bonejoint.1015 Department of Surgery, The University of Melbourne, Australia, Me B, P P, Biomechanics and Spine Research Group, Queensland University of Technology, Australia, Cp R, Western Clinical School, The University of Melbourne, Australia. Effect of vitamin D supplementation on fracture healing: a systematic review of prospective clinical trials. JSM Bone and Joint Dis. 2022;3:1–7. 10.47739/2578-3351.bonejoint.1015. 16. Van Driel M Van Leeuwen JPTM Vitamin D and Bone: A Story of Endocrine and Auto/Paracrine Action in Osteoblasts Nutrients 2023 15 480 10.3390/nu15030480 36771187 PMC9919888 Van Driel M, Van Leeuwen JPTM. Vitamin D and Bone: A Story of Endocrine and Auto/Paracrine Action in Osteoblasts. Nutrients. 2023;15:480. 10.3390/nu15030480. 36771187 10.3390/nu15030480 PMC9919888 17. Alloisio G Ciaccio C Fasciglione GF Tarantino U Marini S Coletta M Gioia M Effects of extracellular osteoanabolic agents on the endogenous response of osteoblastic cells Cells 2021 10 2383 10.3390/cells10092383 34572032 PMC8471159 Alloisio G, Ciaccio C, Fasciglione GF, Tarantino U, Marini S, Coletta M, Gioia M. Effects of extracellular osteoanabolic agents on the endogenous response of osteoblastic cells. Cells. 2021;10:2383. 10.3390/cells10092383. 34572032 10.3390/cells10092383 PMC8471159 18. Intestinal Regulation of Calcium Vitamin D and bone physiology Advances in experimental medicine and biology 2017 Cham Springer International Publishing 3 12 10.1007/978-3-319-66653-2_1 29101648 Intestinal Regulation of Calcium. Vitamin D and bone physiology. Advances in experimental medicine and biology. Cham: Springer International Publishing; 2017. pp. 3–12. 10.1007/978-3-319-66653-2_1. 10.1007/978-3-319-66653-2_1 29101648 19. Slominski AT Kim T-K Janjetovic Z Slominski RM Li W Jetten AM Indra AK Mason RS Tuckey RC Biological effects of CYP11A1-derived vitamin D and Lumisterol metabolites in the skin J Invest Dermatol 2024 144 2145 61 10.1016/j.jid.2024.04.022 39001720 PMC11416330 Slominski AT, Kim T-K, Janjetovic Z, Slominski RM, Li W, Jetten AM, et al. Biological effects of CYP11A1-derived vitamin D and Lumisterol metabolites in the skin. J Invest Dermatol. 2024;144:2145–61. 10.1016/j.jid.2024.04.022. 39001720 10.1016/j.jid.2024.04.022 PMC11416330 20. Farrell C-J Herrmann M Determination of vitamin D and its metabolites Best Pract Res Clin Endocrinol Metab 2013 27 675 88 10.1016/j.beem.2013.06.001 24094638 Farrell C-J, Herrmann M. Determination of vitamin D and its metabolites. Best Pract Res Clin Endocrinol Metab. 2013;27:675–88. 10.1016/j.beem.2013.06.001. 24094638 10.1016/j.beem.2013.06.001 21. Bikle D Christakos S New aspects of vitamin D metabolism and action — addressing the skin as source and target Nat Rev Endocrinol 2020 16 234 52 10.1038/s41574-019-0312-5 32029884 Bikle D, Christakos S. New aspects of vitamin D metabolism and action — addressing the skin as source and target. Nat Rev Endocrinol. 2020;16:234–52. 10.1038/s41574-019-0312-5. 32029884 10.1038/s41574-019-0312-5 22. Alonso N Zelzer S Eibinger G Herrmann M Vitamin D Metabolites Analytical challenges and clinical relevance Calcif Tissue Int 2022 112 158 77 10.1007/s00223-022-00961-5 35238975 PMC8892115 Alonso N, Zelzer S, Eibinger G, Herrmann M, Vitamin D, Metabolites. Analytical challenges and clinical relevance. Calcif Tissue Int. 2022;112:158–77. 10.1007/s00223-022-00961-5. 35238975 10.1007/s00223-022-00961-5 PMC8892115 23. Yazdi Z. Critical Role for 24-Hydroxylation in Homeostatic Regulation of Vitamin D Metabolism, (n.d.). 10.1101/2023.06.27.23291942 10.1210/clinem/dgae156 PMC11747702 38481375 24. Christakos S, Dhawan P, Verstuyf A, Verlinden L, Carmeliet G. METABOLISM, MOLECULAR MECHANISM OF ACTION, AND PLEIOTROPIC EFFECTS. Physiol Rev. 2016;96. 10.1152/physrev.00014.2015. 10.1152/physrev.00014.2015 PMC4839493 26681795 25. Sheriff A Mathew G Sinha A Hari S Gupta N Ramakrishnan L Hari P Bagga A Short-term effects of cholecalciferol supplementation on cFGF23 levels in children with chronic kidney disease and vitamin D insufficiency Indian J Pediatr 2022 89 1037 9 10.1007/s12098-022-04247-4 35771347 Sheriff A, Mathew G, Sinha A, Hari S, Gupta N, Ramakrishnan L, et al. Short-term effects of cholecalciferol supplementation on cFGF23 levels in children with chronic kidney disease and vitamin D insufficiency. Indian J Pediatr. 2022;89:1037–9. 10.1007/s12098-022-04247-4. 35771347 10.1007/s12098-022-04247-4 26. Ratsma DMA Muller M Koedam M Zillikens MC Van der eerden, In vitro Eur J Endocrinol 2023 189 448 59 10.1093/ejendo/lvad131 37796032 Ratsma DMA, Muller M, Koedam M, Zillikens MC. Van der eerden, In vitro 37796032 10.1093/ejendo/lvad131 27. Żmijewski MA Nongenomic activities of vitamin D Nutrients 2022 14 5104 10.3390/nu14235104 36501134 PMC9737885 Żmijewski MA. Nongenomic activities of vitamin D. Nutrients. 2022;14:5104. 10.3390/nu14235104. 36501134 10.3390/nu14235104 PMC9737885 28. Warwick T Schulz MH Günther S Gilsbach R Neme A Carlberg C Brandes RP Seuter S A hierarchical regulatory network analysis of the vitamin D induced transcriptome reveals novel regulators and complete VDR dependency in monocytes Sci Rep 2021 11 6518 10.1038/s41598-021-86032-5 33753848 PMC7985518 Warwick T, Schulz MH, Günther S, Gilsbach R, Neme A, Carlberg C, Brandes RP, Seuter S. A hierarchical regulatory network analysis of the vitamin D induced transcriptome reveals novel regulators and complete VDR dependency in monocytes. Sci Rep. 2021;11:6518. 10.1038/s41598-021-86032-5. 33753848 10.1038/s41598-021-86032-5 PMC7985518 29. Rochel N Vitamin D and its receptor from a structural perspective Nutrients 2022 14 2847 10.3390/nu14142847 35889804 PMC9325172 Rochel N. Vitamin D and its receptor from a structural perspective. Nutrients. 2022;14:2847. 10.3390/nu14142847. 35889804 10.3390/nu14142847 PMC9325172 30. Ekimoto T Kudo T Yamane T Ikeguchi M Mechanism of vitamin D receptor ligand-binding domain regulation studied by gREST simulations J Chem Inf Model 2021 61 3625 37 10.1021/acs.jcim.1c00534 34189910 Ekimoto T, Kudo T, Yamane T, Ikeguchi M. Mechanism of vitamin D receptor ligand-binding domain regulation studied by gREST simulations. J Chem Inf Model. 2021;61:3625–37. 10.1021/acs.jcim.1c00534. 34189910 10.1021/acs.jcim.1c00534 31. Apprato G Fiz C Fusano I Bergandi L Silvagno F Natural epigenetic modulators of vitamin D receptor Appl Sci 2020 10 4096 10.3390/app10124096 Apprato G, Fiz C, Fusano I, Bergandi L, Silvagno F. Natural epigenetic modulators of vitamin D receptor. Appl Sci. 2020;10:4096. 10.3390/app10124096. 32. Mady LJ Zhong Y Dhawan P Christakos S Role of coactivator associated arginine methyltransferase 1 (CARM1) in the regulation of the biological function of 1,25-dihydroxyvitamin D3 Cells 2023 12 1407 10.3390/cells12101407 37408241 PMC10216765 Mady LJ, Zhong Y, Dhawan P, Christakos S. Role of coactivator associated arginine methyltransferase 1 (CARM1) in the regulation of the biological function of 1,25-dihydroxyvitamin D3. Cells. 2023;12:1407. 10.3390/cells12101407. 37408241 10.3390/cells12101407 PMC10216765 33. Carlberg C Raczyk M Zawrotna N Vitamin D A master example of nutrigenomics Redox Biol 2023 62 102695 10.1016/j.redox.2023.102695 37043983 PMC10119805 Carlberg C, Raczyk M, Zawrotna N, Vitamin D. A master example of nutrigenomics. Redox Biol. 2023;62:102695. 10.1016/j.redox.2023.102695. 37043983 10.1016/j.redox.2023.102695 PMC10119805 34. Żmijewski MA Nongenomic activities of vitamin D Nutrients 2022 10.3390/nu14235104 36501134 PMC9737885 Żmijewski MA. Nongenomic activities of vitamin D. Nutrients. 2022. 10.3390/nu14235104. 36501134 10.3390/nu14235104 PMC9737885 35. Sterling T, Khanal R, Nemere I. The 1,25 dihydroxyvitamin D3-membrane-associated, rapid response steroid-binding receptor. OA Biochem. 2013;1. 10.13172/2052-9651-1-1-444. 36. Aldekwer S Goncalves-Mendes N Bingula R Martinroche G Lanchais K Rougé S Farges M-C Rossary A Diab-Assaf M Vasson M-P Talvas J 25-hydroxyvitamin D potentializes extracellular Cathelicidin release from human PBMC stimulated ex vivo with either bacterial (LPS) or viral (P: IC) mimetics J Physiol Biochem 2022 78 335 42 10.1007/s13105-021-00868-z 34985728 PMC8727486 Aldekwer S, Goncalves-Mendes N, Bingula R, Martinroche G, Lanchais K, Rougé S, et al. 25-hydroxyvitamin D potentializes extracellular Cathelicidin release from human PBMC stimulated ex vivo with either bacterial (LPS) or viral (P: IC) mimetics. J Physiol Biochem. 2022;78:335–42. 10.1007/s13105-021-00868-z. 34985728 10.1007/s13105-021-00868-z PMC8727486 37. Van Harten RM Van Woudenbergh E Van Dijk A Haagsman HP Cathelicidins: immunomodulatory antimicrobials Vaccines 2018 6 63 10.3390/vaccines6030063 30223448 PMC6161271 Van Harten RM, Van Woudenbergh E, Van Dijk A, Haagsman HP. Cathelicidins: immunomodulatory antimicrobials. Vaccines. 2018;6:63. 10.3390/vaccines6030063. 30223448 10.3390/vaccines6030063 PMC6161271 38. Watkins RR Lemonovich TL Salata RA An update on the association of vitamin D deficiency with common infectious diseases Can J Physiol Pharmacol 2015 10.1139/cjpp-2014-0352 25741906 Watkins RR, Lemonovich TL, Salata RA. An update on the association of vitamin D deficiency with common infectious diseases. Can J Physiol Pharmacol. 2015;93(5):363–8. 10.1139/cjpp-2014-0352. 25741906 10.1139/cjpp-2014-0352 39. Fantini C Corinaldesi C Lenzi A Migliaccio S Crescioli C Vitamin D as a shield against aging IJMS 2023 24 4546 10.3390/ijms24054546 36901976 PMC10002864 Fantini C, Corinaldesi C, Lenzi A, Migliaccio S, Crescioli C. Vitamin D as a shield against aging. IJMS. 2023;24:4546. 10.3390/ijms24054546. 36901976 10.3390/ijms24054546 PMC10002864 40. Ahsan N Imran M Mohammed Y Al Anouti F Khan MI Banerjee T Adnan M Ashfaq F Kieliszek M Ashraf SA Haq A Mechanistic insight into the role of vitamin D and zinc in modulating immunity against COVID-19: a view from an immunological standpoint Biol Trace Elem Res 2023 201 5546 60 10.1007/s12011-023-03620-4 36890344 PMC9995175 Ahsan N, Imran M, Mohammed Y, Al Anouti F, Khan MI, Banerjee T, et al. Mechanistic insight into the role of vitamin D and zinc in modulating immunity against COVID-19: a view from an immunological standpoint. Biol Trace Elem Res. 2023;201:5546–60. 10.1007/s12011-023-03620-4. 36890344 10.1007/s12011-023-03620-4 PMC9995175 41. Daryabor G Gholijani N R Kahmini F A review of the critical role of vitamin D axis on the immune system Exp Mol Pathol 2023 132–133 104866 10.1016/j.yexmp.2023.104866 37572961 Daryabor G, Gholijani N, R Kahmini F. A review of the critical role of vitamin D axis on the immune system. Exp Mol Pathol. 2023;132–133:104866. 10.1016/j.yexmp.2023.104866. 37572961 10.1016/j.yexmp.2023.104866 42. Farias AS Spagnol GS Bordeaux-Rego P Oliveira COF Fontana AGM De Paula RFO Santos MPA Pradella F Moraes AS Oliveira EC Longhini ALF Rezende ACS Vaisberg MW Santos LMB Vitamin D 3 + CNS Neurosci Ther 2013 19 269 77 10.1111/cns.12071 23521914 PMC6493393 Farias AS, Spagnol GS, Bordeaux-Rego P, Oliveira COF, Fontana AGM, De Paula RFO, Santos MPA, Pradella F, Moraes AS, Oliveira EC, Longhini ALF, Rezende ACS, Vaisberg MW, Santos LMB. Vitamin D 3 + 23521914 10.1111/cns.12071 PMC6493393 43. Zhao R Zhang W Ma C Zhao Y Xiong R Wang H Chen W Zheng SG Immunomodulatory function of vitamin D and its role in autoimmune thyroid disease Front Immunol 2021 12 574967 10.3389/fimmu.2021.574967 33679732 PMC7933459 Zhao R, Zhang W, Ma C, Zhao Y, Xiong R, Wang H, Chen W, Zheng SG. Immunomodulatory function of vitamin D and its role in autoimmune thyroid disease. Front Immunol. 2021;12:574967. 10.3389/fimmu.2021.574967. 33679732 10.3389/fimmu.2021.574967 PMC7933459 44. González Rojo P, Pérez Ramírez C, Gálvez JM, Navas LE, Pineda Lancheros S, Rojo Tolosa MDC, Ramírez Tortosa A. Jiménez Morales, Vitamin D-Related Single Nucleotide Polymorphisms as Risk Biomarker of Cardiovascular Disease, IJMS 23 (2022) 8686. 10.3390/ijms23158686 10.3390/ijms23158686 PMC9368814 35955825 45. Tabaei S Motallebnezhad M Tabaee SS Vitamin D receptor (VDR) gene polymorphisms and risk of coronary artery disease (CAD): systematic review and meta-analysis Biochem Genet 2021 59 813 36 10.1007/s10528-021-10038-x 33590380 Tabaei S, Motallebnezhad M, Tabaee SS. Vitamin D receptor (VDR) gene polymorphisms and risk of coronary artery disease (CAD): systematic review and meta-analysis. Biochem Genet. 2021;59:813–36. 10.1007/s10528-021-10038-x. 33590380 10.1007/s10528-021-10038-x 46. Jeong SP Sharma N An SSA Role of calcitriol and vitamin D receptor (VDR) gene polymorphisms in alzheimer’s disease IJMS 2024 25 4806 10.3390/ijms25094806 38732025 PMC11084202 Jeong SP, Sharma N, An SSA. Role of calcitriol and vitamin D receptor (VDR) gene polymorphisms in alzheimer’s disease. IJMS. 2024;25:4806. 10.3390/ijms25094806. 38732025 10.3390/ijms25094806 PMC11084202 47. Agliardi C Guerini FR Bolognesi E Zanzottera M Clerici M VDR gene single nucleotide polymorphisms and autoimmunity: a narrative review Biology 2023 12 916 10.3390/biology12070916 37508347 PMC10376382 Agliardi C, Guerini FR, Bolognesi E, Zanzottera M, Clerici M. VDR gene single nucleotide polymorphisms and autoimmunity: a narrative review. Biology. 2023;12:916. 10.3390/biology12070916. 37508347 10.3390/biology12070916 PMC10376382 48. Ruiz-Ballesteros AI, Meza-Meza MR, Vizmanos-Lamotte B, Parra-Rojas I, De La Cruz-Mosso U. Association of vitamin D metabolism gene polymorphisms with autoimmunity: evidence in population genetic studies. IJMS. 2020;21:9626. 10.3390/ijms21249626. 10.3390/ijms21249626 PMC7766382 33348854 49. Petre-Mandache B Burada E Cucu MG Atasie D Riza A-L Streață I Mitruț R Pleșea R Dobrescu A Pîrvu A Popescu-Hobeanu G Mitruț P Burada F Lack of association between BsmI and FokI polymorphisms of the VDR gene and sporadic colorectal cancer in a Romanian cohort—a preliminary study Curr Oncol 2024 31 6406 18 10.3390/curroncol31100476 39451780 PMC11505952 Petre-Mandache B, Burada E, Cucu MG, Atasie D, Riza A-L, Streață I, et al. Lack of association between BsmI and FokI polymorphisms of the VDR gene and sporadic colorectal cancer in a Romanian cohort—a preliminary study. Curr Oncol. 2024;31:6406–18. 10.3390/curroncol31100476. 39451780 10.3390/curroncol31100476 PMC11505952 50. Pineda Lancheros LE Rojo Tolosa S Gálvez Navas JM Martínez Martínez F Sánchez Martín A Jiménez Morales A Pérez ramírez, effect of single nucleotide polymorphisms in the vitamin D metabolic pathway on susceptibility to Non-Small-Cell lung cancer Nutrients 2022 14 4668 10.3390/nu14214668 36364930 PMC9659229 Pineda Lancheros LE, Rojo Tolosa S, Gálvez Navas JM, Martínez Martínez F, Sánchez Martín A, Jiménez Morales A. Pérez ramírez, effect of single nucleotide polymorphisms in the vitamin D metabolic pathway on susceptibility to Non-Small-Cell lung cancer. Nutrients. 2022;14:4668. 10.3390/nu14214668. 36364930 10.3390/nu14214668 PMC9659229 51. Horan MP Williams K Hughes D The role of vitamin D in pediatric orthopedics Orthop Clin North Am 2019 50 181 91 10.1016/j.ocl.2018.10.002 30850077 Horan MP, Williams K, Hughes D. The role of vitamin D in pediatric orthopedics. Orthop Clin North Am. 2019;50:181–91. 10.1016/j.ocl.2018.10.002. 30850077 10.1016/j.ocl.2018.10.002 52. Joshi M Uday S Vitamin D deficiency in chronic childhood disorders: importance of screening and prevention Nutrients 2023 15 2805 10.3390/nu15122805 37375708 PMC10302516 Joshi M, Uday S. Vitamin D deficiency in chronic childhood disorders: importance of screening and prevention. Nutrients. 2023;15:2805. 10.3390/nu15122805. 37375708 10.3390/nu15122805 PMC10302516 53. Zhu K Oddy WH Holt P Ping-Delfos WCS Mountain J Lye S Pennell C Hart PH Walsh JP Tracking of vitamin D status from childhood to early adulthood and its association with peak bone mass Am J Clin Nutr 2017 106 276 83 10.3945/ajcn.116.150524 28592609 Zhu K, Oddy WH, Holt P, Ping-Delfos WCS, Mountain J, Lye S, et al. Tracking of vitamin D status from childhood to early adulthood and its association with peak bone mass. Am J Clin Nutr. 2017;106:276–83. 10.3945/ajcn.116.150524. 28592609 10.3945/ajcn.116.150524 54. Larqué E Morales E Leis R Blanco-Carnero JE Maternal and foetal health implications of vitamin D status during pregnancy Ann Nutr Metab 2018 72 179 92 10.1159/000487370 29533937 Larqué E, Morales E, Leis R, Blanco-Carnero JE. Maternal and foetal health implications of vitamin D status during pregnancy. Ann Nutr Metab. 2018;72:179–92. 10.1159/000487370. 29533937 10.1159/000487370 55. Karras SN Anagnostis P Bili E Naughton D Petroczi A Papadopoulou F Goulis DG Maternal vitamin D status in pregnancy and offspring bone development: the unmet needs of vitamin D era Osteoporos Int 2014 25 795 805 10.1007/s00198-013-2468-5 23907574 Karras SN, Anagnostis P, Bili E, Naughton D, Petroczi A, Papadopoulou F, Goulis DG. Maternal vitamin D status in pregnancy and offspring bone development: the unmet needs of vitamin D era. Osteoporos Int. 2014;25:795–805. 10.1007/s00198-013-2468-5. 23907574 10.1007/s00198-013-2468-5 56. Brustad N Chawes BL Thorsen J Krakauer M Lasky-Su J Weiss ST Stokholm J Bønnelykke K Bisgaard H High-dose vitamin D supplementation in pregnancy and 25(OH)D sufficiency in childhood reduce the risk of fractures and improve bone mineralization in childhood: follow-up of a randomized clinical trial eClin Med 2022 43 101254 10.1016/j.eclinm.2021.101254 PMC8718890 35005585 Brustad N, Chawes BL, Thorsen J, Krakauer M, Lasky-Su J, Weiss ST, et al. High-dose vitamin D supplementation in pregnancy and 25(OH)D sufficiency in childhood reduce the risk of fractures and improve bone mineralization in childhood: follow-up of a randomized clinical trial. eClin Med. 2022;43:101254. 10.1016/j.eclinm.2021.101254. 10.1016/j.eclinm.2021.101254 PMC8718890 35005585 57. Ryan BA Kovacs CS Maternal and fetal vitamin D and their roles in mineral homeostasis and fetal bone development J Endocrinol Invest 2021 44 643 59 10.1007/s40618-020-01387-2 32772256 Ryan BA, Kovacs CS. Maternal and fetal vitamin D and their roles in mineral homeostasis and fetal bone development. J Endocrinol Invest. 2021;44:643–59. 10.1007/s40618-020-01387-2. 32772256 10.1007/s40618-020-01387-2 58. Kovacs CS. Calcium and Phosphate Metabolism and Related Disorders During Pregnancy and Lactation, (n.d.). 25905396 59. Ricarte FR Le Henaff C Kolupaeva VG Gardella TJ Partridge NC Parathyroid hormone(1–34) and its analogs differentially modulate osteoblastic Rankl expression via PKA/SIK2/SIK3 and PP1/PP2A–CRTC3 signaling J Biol Chem 2018 293 20200 13 10.1074/jbc.ra118.004751 30377251 PMC6311504 Ricarte FR, Le Henaff C, Kolupaeva VG, Gardella TJ, Partridge NC. Parathyroid hormone(1–34) and its analogs differentially modulate osteoblastic Rankl expression via PKA/SIK2/SIK3 and PP1/PP2A–CRTC3 signaling. J Biol Chem. 2018;293:20200–13. 10.1074/jbc.ra118.004751. 30377251 10.1074/jbc.RA118.004751 PMC6311504 60. Karras SN Dursun E Alaylıoğlu M Gezen-Ak D Annweiler C Skoutas D Evangelidis D Kiortsis D Diverse effects of combinations of maternal-neonatal VDR polymorphisms and 25-hydroxyvitamin D concentrations on neonatal birth anthropometry: functional phenocopy variability dependence, highlights the need for targeted maternal 25-hydroxyvitamin D cut-offs during pregnancy Nutrients 2021 13 443 10.3390/nu13020443 33572874 PMC7912032 Karras SN, Dursun E, Alaylıoğlu M, Gezen-Ak D, Annweiler C, Skoutas D, et al. Diverse effects of combinations of maternal-neonatal VDR polymorphisms and 25-hydroxyvitamin D concentrations on neonatal birth anthropometry: functional phenocopy variability dependence, highlights the need for targeted maternal 25-hydroxyvitamin D cut-offs during pregnancy. Nutrients. 2021;13:443. 10.3390/nu13020443. 33572874 10.3390/nu13020443 PMC7912032 61. Sugiyama T Gestational vitamin D and childhood bone health Lancet Diabetes Endocrinol 2017 5 417 8 10.1016/S2213-8587(17)30147-X 28549506 Sugiyama T. Gestational vitamin D and childhood bone health. Lancet Diabetes Endocrinol. 2017;5:417–8. 10.1016/S2213-8587(17)30147-X. 28549506 10.1016/S2213-8587(17)30147-X 62. Agoro R White KE Regulation of FGF23 production and phosphate metabolism by bone–kidney interactions Nat Rev Nephrol 2023 19 185 93 10.1038/s41581-022-00665-x 36624273 Agoro R, White KE. Regulation of FGF23 production and phosphate metabolism by bone–kidney interactions. Nat Rev Nephrol. 2023;19:185–93. 10.1038/s41581-022-00665-x. 36624273 10.1038/s41581-022-00665-x 63. Javorsky BR, Maybee N, Padia SH, Dalkin AC. Vitamin D Deficiency in Gastrointestinal Disease, (n.d.). 64. Giustina A Vitamin D and malabsorptive gastrointestinal conditions: a bidirectional relationship? Rev Endocr Metab Disord 2023 10.1007/s11154-023-09792-7 36813995 PMC9946876 Giustina A. Vitamin D and malabsorptive gastrointestinal conditions: a bidirectional relationship? Rev Endocr Metab Disord. 2023. 10.1007/s11154-023-09792-7. 36813995 10.1007/s11154-023-09792-7 PMC9946876 65. Kolosovych I Hanol I Bystrytska M Uzun H Changes in vitamin D and calcium-phosphorus metabolism in patients with severe acute pancreatitis Turk J Surg 2022 38 327 33 10.47717/turkjsurg.2022.5669 36875274 PMC9979554 Kolosovych I, Hanol I, Bystrytska M, Uzun H. Changes in vitamin D and calcium-phosphorus metabolism in patients with severe acute pancreatitis. Turk J Surg. 2022;38:327–33. 10.47717/turkjsurg.2022.5669. 36875274 10.47717/turkjsurg.2022.5669 PMC9979554 66. Precechtelova M, Dite P, Buckova D, Bojkova M, Kianicka B, Solil D, Dolina J. Vitamin D in blood serum and chronic pancreatitis. Bratisl Lek Listy. 2024;125(8):508–12. 10.4149/BLL_2024_79. 10.4149/BLL_2024_79 38989753 67. Konstantakis C Vitamin D deficiency in patients with liver cirrhosis Aog 2016 10.20524/aog.2016.0037 PMC4923814 27366029 Konstantakis C. Vitamin D deficiency in patients with liver cirrhosis. Aog. 2016. 10.20524/aog.2016.0037. 10.20524/aog.2016.0037 PMC4923814 27366029 68. Kubesch A Quenstedt L Saleh M Rüschenbaum S Schwarzkopf K Martinez Y Welsch C Zeuzem S Welzel TM Lange CM Vitamin D deficiency is associated with hepatic decompensation and inflammation in patients with liver cirrhosis: a prospective cohort study PLoS ONE 2018 13 e0207162 10.1371/journal.pone.0207162 30408125 PMC6224127 Kubesch A, Quenstedt L, Saleh M, Rüschenbaum S, Schwarzkopf K, Martinez Y, et al. Vitamin D deficiency is associated with hepatic decompensation and inflammation in patients with liver cirrhosis: a prospective cohort study. PLoS ONE. 2018;13:e0207162. 10.1371/journal.pone.0207162. 30408125 10.1371/journal.pone.0207162 PMC6224127 69. Lin S Wang W Shi L Yang X Chen Y Liu X Li J Ye F An X Zhang X Severe vitamin D deficiency is strongly associated with liver dysfunction and disease severity in hepatitis B virus related cirrhosis and liver failure patients J Nutr Sci Vitaminol 2022 68 16 22 10.3177/jnsv.68.16 35228491 Lin S, Wang W, Shi L, Yang X, Chen Y, Liu X, Li J, Ye F, An X, Zhang X. Severe vitamin D deficiency is strongly associated with liver dysfunction and disease severity in hepatitis B virus related cirrhosis and liver failure patients. J Nutr Sci Vitaminol. 2022;68:16–22. 10.3177/jnsv.68.16. 35228491 10.3177/jnsv.68.16 70. Cao F Xu Z Li X-X Fu Z-Y Han R-Y Zhang J-L Wang P Hou S Pan H-F Trends and cross-country inequalities in the global burden of osteoarthritis, 1990–2019: a population-based study Ageing Res Rev 2024 99 102382 10.1016/j.arr.2024.102382 38917934 Cao F, Xu Z, Li X-X, Fu Z-Y, Han R-Y, Zhang J-L, et al. Trends and cross-country inequalities in the global burden of osteoarthritis, 1990–2019: a population-based study. Ageing Res Rev. 2024;99:102382. 10.1016/j.arr.2024.102382. 38917934 10.1016/j.arr.2024.102382 71. Glyn-Jones S Palmer AJR Agricola R Price AJ Vincent TL Weinans H Carr AJ Osteoarthritis Lancet 2015 386 376 87 10.1016/S0140-6736(14)60802-3 25748615 Glyn-Jones S, Palmer AJR, Agricola R, Price AJ, Vincent TL, Weinans H, et al. Osteoarthritis. Lancet. 2015;386:376–87. 10.1016/S0140-6736(14)60802-3. 25748615 10.1016/S0140-6736(14)60802-3 72. Colombini A, Cauci S, Lombardi G, Lanteri P, Croiset S, Brayda-Bruno M, Banfi G. Relationship between vitamin D receptor gene (VDR) polymorphisms, vitamin D status, osteoarthritis and intervertebral disc degeneration. J Steroid Biochem Mol Biol. 2013;138:24–40. 10.1016/j.jsbmb.2013.03.001. 10.1016/j.jsbmb.2013.03.001 23500379 73. Mora JC Przkora R Cruz-Almeida Y Knee osteoarthritis: pathophysiology and current treatment modalities J Pain Res 2018 11 2189 96 10.2147/JPR.S154002 30323653 PMC6179584 Mora JC, Przkora R, Cruz-Almeida Y. Knee osteoarthritis: pathophysiology and current treatment modalities. J Pain Res. 2018;11:2189–96. 10.2147/JPR.S154002. 30323653 10.2147/JPR.S154002 PMC6179584 74. Yao Q Wu X Tao C Gong W Chen M Qu M Zhong Y He T Chen S Xiao G Osteoarthritis: pathogenic signaling pathways and therapeutic targets Sig Transduct Target Ther 2023 8 56 10.1038/s41392-023-01330-w PMC9898571 36737426 Yao Q, Wu X, Tao C, Gong W, Chen M, Qu M, Zhong Y, He T, Chen S, Xiao G. Osteoarthritis: pathogenic signaling pathways and therapeutic targets. Sig Transduct Target Ther. 2023;8:56. 10.1038/s41392-023-01330-w. 10.1038/s41392-023-01330-w PMC9898571 36737426 75. Warmink K Vinod P Korthagen NM Weinans H Rios JL Macrophage-driven inflammation in metabolic osteoarthritis: implications for biomarker and therapy development IJMS 2023 24 6112 10.3390/ijms24076112 37047082 PMC10094694 Warmink K, Vinod P, Korthagen NM, Weinans H, Rios JL. Macrophage-driven inflammation in metabolic osteoarthritis: implications for biomarker and therapy development. IJMS. 2023;24:6112. 10.3390/ijms24076112. 37047082 10.3390/ijms24076112 PMC10094694 76. Garfinkel RJ Dilisio MF Agrawal DK Vitamin D and its effects on articular cartilage and osteoarthritis Orthop J Sports Med 2017 5 2325967117711376 10.1177/2325967117711376 28680892 PMC5480771 Garfinkel RJ, Dilisio MF, Agrawal DK. Vitamin D and its effects on articular cartilage and osteoarthritis. Orthop J Sports Med. 2017;5:2325967117711376. 10.1177/2325967117711376. 28680892 10.1177/2325967117711376 PMC5480771 77. Barker T Henriksen VT Rogers VE Aguirre D Trawick RH Lynn Rasmussen G Momberger NG Vitamin D deficiency associates with γ-tocopherol and quadriceps weakness but not inflammatory cytokines in subjects with knee osteoarthritis Redox Biol 2014 2 466 74 10.1016/j.redox.2014.01.024 24624336 PMC3949095 Barker T, Henriksen VT, Rogers VE, Aguirre D, Trawick RH, Lynn Rasmussen G, Momberger NG. Vitamin D deficiency associates with γ-tocopherol and quadriceps weakness but not inflammatory cytokines in subjects with knee osteoarthritis. Redox Biol. 2014;2:466–74. 10.1016/j.redox.2014.01.024. 24624336 10.1016/j.redox.2014.01.024 PMC3949095 78. Heidari B Heidari P Hajian-Tilaki K Association between serum vitamin D deficiency and knee osteoarthritis Int Orthop 2011 35 1627 31 10.1007/s00264-010-1186-2 21191580 PMC3193973 Heidari B, Heidari P, Hajian-Tilaki K. Association between serum vitamin D deficiency and knee osteoarthritis. Int Orthop. 2011;35:1627–31. 10.1007/s00264-010-1186-2. 21191580 10.1007/s00264-010-1186-2 PMC3193973 79. Alabajos-Cea A Herrero-Manley L Suso-Martí L Viosca-Herrero E Cuenca-Martínez F Varangot-Reille C Blanco-Díaz M Calatayud J Casaña J The role of vitamin D in early knee osteoarthritis and its relationship with their physical and psychological status Nutrients 2021 13 4035 10.3390/nu13114035 34836290 PMC8622912 Alabajos-Cea A, Herrero-Manley L, Suso-Martí L, Viosca-Herrero E, Cuenca-Martínez F, Varangot-Reille C, Blanco-Díaz M, Calatayud J, Casaña J. The role of vitamin D in early knee osteoarthritis and its relationship with their physical and psychological status. Nutrients. 2021;13:4035. 10.3390/nu13114035. 34836290 10.3390/nu13114035 PMC8622912 80. Amirkhizi F Ghoreishy SM Baker E Hamedi-Shahraki S Asghari S The association of vitamin D status with oxidative stress biomarkers and matrix metalloproteinases in patients with knee osteoarthritis Front Nutr 2023 10 1101516 10.3389/fnut.2023.1101516 36845046 PMC9944738 Amirkhizi F, Ghoreishy SM, Baker E, Hamedi-Shahraki S, Asghari S. The association of vitamin D status with oxidative stress biomarkers and matrix metalloproteinases in patients with knee osteoarthritis. Front Nutr. 2023;10:1101516. 10.3389/fnut.2023.1101516. 36845046 10.3389/fnut.2023.1101516 PMC9944738 81. Bergink AP Uitterlinden AG Van Leeuwen JP Buurman CJ Hofman A Verhaar JA Pols HA Vitamin D status, bone mineral density, and the development of radiographic osteoarthritis of the knee: The Rotterdam Study J Clin Rheumatol 2009 10.1097/rhu.0b013e3181b08f20 19654490 Bergink AP, Uitterlinden AG, Van Leeuwen JP, Buurman CJ, Hofman A, Verhaar JA, et al. Vitamin D status, bone mineral density, and the development of radiographic osteoarthritis of the knee:The Rotterdam Study. J Clin Rheumatol. 2009;15(5):230–7. 10.1097/rhu.0b013e3181b08f20. 19654490 10.1097/RHU.0b013e3181b08f20 82. Chen J Zhang J Li J Qin R Lu N Goltzman D Miao D Yang R 1,25-dihydroxyvitamin D deficiency accelerates aging-related osteoarthritis via downregulation of Sirt1 in mice Int J Biol Sci 2023 10.7150/ijbs.78785 36632467 PMC9830508 Chen J, Zhang J, Li J, Qin R, Lu N, Goltzman D, et al. 1,25-dihydroxyvitamin D deficiency accelerates aging-related osteoarthritis via downregulation of Sirt1 in mice. Int J Biol Sci. 2023;19(2):610–24. 10.7150/ijbs.78785. 36632467 10.7150/ijbs.78785 PMC9830508 83. Zuo A Jia Q Zhang M Zhou X Li T Wang L The association of vitamin D with knee osteoarthritis pain: an analysis from the osteoarthritis initiative database Sci Rep 2024 10.1038/s41598-024-81845-6 39632940 PMC11618375 Zuo A, Jia Q, Zhang M, Zhou X, Li T, Wang L. The association of vitamin D with knee osteoarthritis pain: an analysis from the osteoarthritis initiative database. Sci Rep. 2024. 10.1038/s41598-024-81845-6. 39632940 10.1038/s41598-024-81845-6 PMC11618375 84. Wang J Fan J Yang Y Moazzen S Chen D Sun L He F Li Y Vitamin D status and risk of all-cause and cause-specific mortality in osteoarthritis patients: results from NHANES III and NHANES 2001–2018 Nutrients 2022 14 4629 10.3390/nu14214629 36364891 PMC9655488 Wang J, Fan J, Yang Y, Moazzen S, Chen D, Sun L, et al. Vitamin D status and risk of all-cause and cause-specific mortality in osteoarthritis patients: results from NHANES III and NHANES 2001–2018. Nutrients. 2022;14:4629. 10.3390/nu14214629. 36364891 10.3390/nu14214629 PMC9655488 85. Manoy P Yuktanandana P Tanavalee A Anomasiri W Ngarmukos S Tanpowpong T Honsawek S Vitamin D supplementation improves quality of life and physical performance in osteoarthritis patients Nutrients 2017 9 799 10.3390/nu9080799 28933742 PMC5579593 Manoy P, Yuktanandana P, Tanavalee A, Anomasiri W, Ngarmukos S, Tanpowpong T, Honsawek S. Vitamin D supplementation improves quality of life and physical performance in osteoarthritis patients. Nutrients. 2017;9:799. 10.3390/nu9080799. 28933742 10.3390/nu9080799 PMC5579593 86. Sakalyte R Denkovskij J Bernotiene E Stropuviene S Mikulenaite SO Kvederas G Porvaneckas N Tutkus V Venalis A Butrimiene I The expression of inflammasomes NLRP1 and NLRP3, Toll-like receptors, and vitamin D receptor in synovial fibroblasts from patients with different types of knee arthritis Front Immunol 2022 12 767512 10.3389/fimmu.2021.767512 35126351 PMC8807559 Sakalyte R, Denkovskij J, Bernotiene E, Stropuviene S, Mikulenaite SO, Kvederas G, et al. The expression of inflammasomes NLRP1 and NLRP3, Toll-like receptors, and vitamin D receptor in synovial fibroblasts from patients with different types of knee arthritis. Front Immunol. 2022;12:767512. 10.3389/fimmu.2021.767512. 35126351 10.3389/fimmu.2021.767512 PMC8807559 87. Kong C Wang C Shi Y Yan L Xu J Qi W Active vitamin D activates chondrocyte autophagy to reduce osteoarthritis via mediating the AMPK–mTOR signaling pathway Biochem Cell Biol 2020 98 434 42 10.1139/bcb-2019-0333 31815524 Kong C, Wang C, Shi Y, Yan L, Xu J, Qi W. Active vitamin D activates chondrocyte autophagy to reduce osteoarthritis via mediating the AMPK–mTOR signaling pathway. Biochem Cell Biol. 2020;98:434–42. 10.1139/bcb-2019-0333. 31815524 10.1139/bcb-2019-0333 88. Liu P Zhou J Cui H Xu J Ruan G Ding C Wang K 1,25(OH)2D3 induces chondrocyte autophagy and reduces the loss of proteoglycans in osteoarthritis through inhibiting the NF-κB pathway Clin Rheumatol 2025 44 811 22 10.1007/s10067-024-07281-z 39775461 Liu P, Zhou J, Cui H, Xu J, Ruan G, Ding C, Wang K. 1,25(OH)2D3 induces chondrocyte autophagy and reduces the loss of proteoglycans in osteoarthritis through inhibiting the NF-κB pathway. Clin Rheumatol. 2025;44:811–22. 10.1007/s10067-024-07281-z. 39775461 10.1007/s10067-024-07281-z 89. Saengsiwaritt W Ngamtipakon P Udomsinprasert W Vitamin D and autophagy in knee osteoarthritis: a review Int Immunopharmacol 2023 123 110712 10.1016/j.intimp.2023.110712 37523972 Saengsiwaritt W, Ngamtipakon P, Udomsinprasert W. Vitamin D and autophagy in knee osteoarthritis: a review. Int Immunopharmacol. 2023;123:110712. 10.1016/j.intimp.2023.110712. 37523972 10.1016/j.intimp.2023.110712 90. Ramasamy B Magne F Tripathy SK Venugopal G Mukherjee D Balamurugan R Association of gut microbiome and vitamin D deficiency in knee osteoarthritis patients: a pilot study Nutrients 2021 10.3390/nu13041272 33924396 PMC8069973 Ramasamy B, Magne F, Tripathy SK, Venugopal G, Mukherjee D, Balamurugan R. Association of gut microbiome and vitamin D deficiency in knee osteoarthritis patients: a pilot study. Nutrients. 2021. 10.3390/nu13041272. 33924396 10.3390/nu13041272 PMC8069973 91. Basak S Hridayanka KSN Duttaroy AK Bioactives and their roles in bone metabolism of osteoarthritis: evidence and mechanisms on gut-bone axis Front Immunol 2024 10.3389/fimmu.2023.1323233 38235147 PMC10792057 Basak S, Hridayanka KSN, Duttaroy AK. Bioactives and their roles in bone metabolism of osteoarthritis: evidence and mechanisms on gut-bone axis. Front Immunol. 2024. 10.3389/fimmu.2023.1323233. 38235147 10.3389/fimmu.2023.1323233 PMC10792057 92. Qu Z Yang F Yan Y Huang J Zhao J Hong J Li S Jiang G Wang W Yan S A Mendelian randomization study on the role of serum parathyroid hormone and 25-hydroxyvitamin D in osteoarthritis Osteoarthritis Cartilage 2021 29 1282 90 10.1016/j.joca.2021.04.015 33975017 Qu Z, Yang F, Yan Y, Huang J, Zhao J, Hong J, et al. A Mendelian randomization study on the role of serum parathyroid hormone and 25-hydroxyvitamin D in osteoarthritis. Osteoarthritis Cartilage. 2021;29:1282–90. 10.1016/j.joca.2021.04.015. 33975017 10.1016/j.joca.2021.04.015 93. Guan J Li Z Niu G Li S Li W Song C Leng H Protective effects of vitamin D on proteoglycans of human articular chondrocytes through TGF-β1 signaling Nutrients 2024 16 2991 10.3390/nu16172991 39275306 PMC11396982 Guan J, Li Z, Niu G, Li S, Li W, Song C, Leng H. Protective effects of vitamin D on proteoglycans of human articular chondrocytes through TGF-β1 signaling. Nutrients. 2024;16:2991. 10.3390/nu16172991. 39275306 10.3390/nu16172991 PMC11396982 94. Wang Z Zhu Z Pan F Zheng S Parameswaran V Blizzard L Ding C Antony B Long-term effects of vitamin D supplementation and maintaining sufficient vitamin D on knee osteoarthritis over 5 years Arthritis Res Ther 2023 25 178 10.1186/s13075-023-03167-8 37740217 PMC10517449 Wang Z, Zhu Z, Pan F, Zheng S, Parameswaran V, Blizzard L, Ding C, Antony B. Long-term effects of vitamin D supplementation and maintaining sufficient vitamin D on knee osteoarthritis over 5 years. Arthritis Res Ther. 2023;25:178. 10.1186/s13075-023-03167-8. 37740217 10.1186/s13075-023-03167-8 PMC10517449 95. Park CY Vitamin D in the prevention and treatment of osteoarthritis: from clinical interventions to cellular evidence Nutrients 2019 11 243 10.3390/nu11020243 30678273 PMC6413222 Park CY. Vitamin D in the prevention and treatment of osteoarthritis: from clinical interventions to cellular evidence. Nutrients. 2019;11:243. 10.3390/nu11020243. 30678273 10.3390/nu11020243 PMC6413222 96. Jin X Ding C Hunter DJ Gallego B Effectiveness of vitamin D supplementation on knee osteoarthritis - a target trial emulation study using data from the osteoarthritis initiative cohort Osteoarthr Cartil 2022 30 1495 505 10.1016/j.joca.2022.06.005 35764205 Jin X, Ding C, Hunter DJ, Gallego B. Effectiveness of vitamin D supplementation on knee osteoarthritis - a target trial emulation study using data from the osteoarthritis initiative cohort. Osteoarthr Cartil. 2022;30:1495–505. 10.1016/j.joca.2022.06.005. 10.1016/j.joca.2022.06.005 35764205 97. Bergink AP Trajanoska K Uitterlinden AG Mendelian randomization study on vitamin D levels and osteoarthritis risk: a concise report Rheumatology 2021 10.1093/rheumatology/keaa697 33463692 Bergink AP, Trajanoska K, Uitterlinden AG. Mendelian randomization study on vitamin D levels and osteoarthritis risk: a concise report. Rheumatology. 2021. 10.1093/rheumatology/keaa697. 33463692 10.1093/rheumatology/keaa697 98. Zheng S Jin X Cicuttini F Wang X Zhu Z Wluka A Han W Winzenberg T Antony B Aitken D Blizzard L Jones G Ding C Maintaining vitamin D sufficiency is associated with improved structural and symptomatic outcomes in knee osteoarthritis Am J Med 2017 130 1211 8 10.1016/j.amjmed.2017.04.038 28549923 Zheng S, Jin X, Cicuttini F, Wang X, Zhu Z, Wluka A, et al. Maintaining vitamin D sufficiency is associated with improved structural and symptomatic outcomes in knee osteoarthritis. Am J Med. 2017;130:1211–8. 10.1016/j.amjmed.2017.04.038. 28549923 10.1016/j.amjmed.2017.04.038 99. Gao X-R Chen Y-S Deng W The effect of vitamin D supplementation on knee osteoarthritis: a meta-analysis of randomized controlled trials Int J Surg 2017 46 14 20 10.1016/j.ijsu.2017.08.010 28797917 Gao X-R, Chen Y-S, Deng W. The effect of vitamin D supplementation on knee osteoarthritis: a meta-analysis of randomized controlled trials. Int J Surg. 2017;46:14–20. 10.1016/j.ijsu.2017.08.010. 28797917 10.1016/j.ijsu.2017.08.010 100. Zhao Z-X He Y Peng L-H Luo X Liu M He C-S Chen J Does vitamin D improve symptomatic and structural outcomes in knee osteoarthritis? A systematic review and meta-analysis Aging Clin Exp Res 2021 33 2393 403 10.1007/s40520-020-01778-8 33783714 Zhao Z-X, He Y, Peng L-H, Luo X, Liu M, He C-S, Chen J. Does vitamin D improve symptomatic and structural outcomes in knee osteoarthritis? A systematic review and meta-analysis. Aging Clin Exp Res. 2021;33:2393–403. 10.1007/s40520-020-01778-8. 33783714 10.1007/s40520-020-01778-8 101. Colombini A Cauci S Lombardi G Lanteri P Croiset S Brayda-Bruno M Banfi G Relationship between vitamin D receptor gene (VDR) polymorphisms, vitamin D status, osteoarthritis and intervertebral disc degeneration J Steroid Biochem Mol Biol 2013 138 24 40 10.1016/j.jsbmb.2013.03.001 23500379 Colombini A, Cauci S, Lombardi G, Lanteri P, Croiset S, Brayda-Bruno M, et al. Relationship between vitamin D receptor gene (VDR) polymorphisms, vitamin D status, osteoarthritis and intervertebral disc degeneration. J Steroid Biochem Mol Biol. 2013;138:24–40. 10.1016/j.jsbmb.2013.03.001. 23500379 10.1016/j.jsbmb.2013.03.001 102. Li H-M Liu Y Zhang R-J Ding J-Y Shen C-L Vitamin D receptor gene polymorphisms and osteoarthritis: a meta-analysis Rheumatology 2021 60 538 48 10.1093/rheumatology/keaa644 33147632 Li H-M, Liu Y, Zhang R-J, Ding J-Y, Shen C-L. Vitamin D receptor gene polymorphisms and osteoarthritis: a meta-analysis. Rheumatology. 2021;60:538–48. 10.1093/rheumatology/keaa644. 33147632 10.1093/rheumatology/keaa644 103. Thomas JE Bhat AK Rao M Guddattu V Sekhar S Use of vitamin D supplements in osteoarthritis: an observational study in a tertiary health care facility J Am Coll Nutr 2019 38 227 34 10.1080/07315724.2018.1494641 30485164 Thomas JE, Bhat AK, Rao M, Guddattu V, Sekhar S. Use of vitamin D supplements in osteoarthritis: an observational study in a tertiary health care facility. J Am Coll Nutr. 2019;38:227–34. 10.1080/07315724.2018.1494641. 30485164 10.1080/07315724.2018.1494641 104. Georgescu B Oprea D Georgescu B-A Lungu C-M Borgazi E Iliescu M-G Update in exploring the connection and clinical implications between vitamin D and knee osteoarthritis Balneo PRM Res J 2024 15 736 736 10.12680/balneo.2024.736 Georgescu B, Oprea D, Georgescu B-A, Lungu C-M, Borgazi E, Iliescu M-G. Update in exploring the connection and clinical implications between vitamin D and knee osteoarthritis. Balneo PRM Res J. 2024;15:736–736. 10.12680/balneo.2024.736. 105. Szulc M Świątkowska-Stodulska R Pawłowska E Derwich M Vitamin D3 metabolism and its role in temporomandibular joint osteoarthritis and autoimmune thyroid diseases IJMS 2023 24 4080 10.3390/ijms24044080 36835491 PMC9964750 Szulc M, Świątkowska-Stodulska R, Pawłowska E, Derwich M. Vitamin D3 metabolism and its role in temporomandibular joint osteoarthritis and autoimmune thyroid diseases. IJMS. 2023;24:4080. 10.3390/ijms24044080. 36835491 10.3390/ijms24044080 PMC9964750 106. Ensrud KE Crandall CJ Osteoporosis Ann Intern Med 2017 167 ITC17–32 10.7326/AITC201708010 28761958 Ensrud KE, Crandall CJ. Osteoporosis. Ann Intern Med. 2017;167:ITC17–32. 10.7326/AITC201708010. 28761958 10.7326/AITC201708010 107. Matzkin EG DeMaio M Charles JF Franklin CC Diagnosis and treatment of osteoporosis: what orthopaedic surgeons need to know J Am Acad Orthop Surg 2019 27 e902 12 10.5435/JAAOS-D-18-00600 31021891 Matzkin EG, DeMaio M, Charles JF, Franklin CC. Diagnosis and treatment of osteoporosis: what orthopaedic surgeons need to know. J Am Acad Orthop Surg. 2019;27:e902–12. 10.5435/JAAOS-D-18-00600. 31021891 10.5435/JAAOS-D-18-00600 108. Lee DO Hong YH Cho MK Choi YS Chun S Chung Y-J Hong SH Hwang KR Kim J Kim H Lee D-Y Lee SR Park H-T Seo SK Shin J-H Song JY Yi KW Paik H Lee JY The 2024 guidelines for osteoporosis - Korean society of menopause J Menopausal Med 2024 30 1 10.6118/jmm.24000 38714490 PMC11103071 Lee DO, Hong YH, Cho MK, Choi YS, Chun S, Chung Y-J, et al. The 2024 guidelines for osteoporosis - Korean society of menopause. J Menopausal Med. 2024;30:1. 10.6118/jmm.24000. 38714490 10.6118/jmm.24000 PMC11103071 109. Gosset A Pouillès J-M Trémollieres F Menopausal hormone therapy for the management of osteoporosis Best Pract Res Clin Endocrinol Metab 2021 35 101551 10.1016/j.beem.2021.101551 34119418 Gosset A, Pouillès J-M, Trémollieres F. Menopausal hormone therapy for the management of osteoporosis. Best Pract Res Clin Endocrinol Metab. 2021;35:101551. 10.1016/j.beem.2021.101551. 34119418 10.1016/j.beem.2021.101551 110. Reid IR Bolland MJ Calcium and/or vitamin D supplementation for the prevention of fragility fractures: who needs it?? Nutrients 2020 12 1011 10.3390/nu12041011 32272593 PMC7231370 Reid IR, Bolland MJ. Calcium and/or vitamin D supplementation for the prevention of fragility fractures: who needs it?? Nutrients. 2020;12:1011. 10.3390/nu12041011. 32272593 10.3390/nu12041011 PMC7231370 111. De Martinis M Allegra A Sirufo MM Tonacci A Pioggia G Raggiunti M Ginaldi L Gangemi S Vitamin D deficiency, osteoporosis and effect on autoimmune diseases and hematopoiesis: a review IJMS 2021 22 8855 10.3390/ijms22168855 34445560 PMC8396272 De Martinis M, Allegra A, Sirufo MM, Tonacci A, Pioggia G, Raggiunti M, et al. Vitamin D deficiency, osteoporosis and effect on autoimmune diseases and hematopoiesis: a review. IJMS. 2021;22:8855. 10.3390/ijms22168855. 34445560 10.3390/ijms22168855 PMC8396272 112. Capozzi A Scambia G Lello S Calcium, vitamin D, vitamin K2, and magnesium supplementation and skeletal health Maturitas 2020 140 55 63 10.1016/j.maturitas.2020.05.020 32972636 Capozzi A, Scambia G, Lello S. Calcium, vitamin D, vitamin K2, and magnesium supplementation and skeletal health. Maturitas. 2020;140:55–63. 10.1016/j.maturitas.2020.05.020. 32972636 10.1016/j.maturitas.2020.05.020 113. Yang R Chen J Zhang J Qin R Wang R Qiu Y Mao Z Goltzman D Miao D 1,25-Dihydroxyvitamin D protects against age‐related osteoporosis by a novel VDR‐Ezh2‐p16 signal axis Aging Cell 2020 19 e13095 10.1111/acel.13095 31880094 PMC6996957 Yang R, Chen J, Zhang J, Qin R, Wang R, Qiu Y, Mao Z, Goltzman D, Miao D. 1,25-Dihydroxyvitamin D protects against age‐related osteoporosis by a novel VDR‐Ezh2‐p16 signal axis. Aging Cell. 2020;19:e13095. 10.1111/acel.13095. 31880094 10.1111/acel.13095 PMC6996957 114. Liu C Kuang X Li K Guo X Deng Q Li D Effects of combined calcium and vitamin D supplementation on osteoporosis in postmenopausal women: a systematic review and meta-analysis of randomized controlled trials Food Funct 2020 11 10817 27 10.1039/D0FO00787K 33237064 Liu C, Kuang X, Li K, Guo X, Deng Q, Li D. Effects of combined calcium and vitamin D supplementation on osteoporosis in postmenopausal women: a systematic review and meta-analysis of randomized controlled trials. Food Funct. 2020;11:10817–27. 10.1039/D0FO00787K. 33237064 10.1039/d0fo00787k 115. Catalano A Bellone F Santoro D Schwarz P Gaudio A Basile G Sottile MC Stoian SA Corica F Morabito N Vitamin D boosts alendronate tail effect on bone mineral density in postmenopausal women with osteoporosis Nutrients 2021 13 1878 10.3390/nu13061878 34072655 PMC8226654 Catalano A, Bellone F, Santoro D, Schwarz P, Gaudio A, Basile G, Sottile MC, Stoian SA, Corica F, Morabito N. Vitamin D boosts alendronate tail effect on bone mineral density in postmenopausal women with osteoporosis. Nutrients. 2021;13:1878. 10.3390/nu13061878. 34072655 10.3390/nu13061878 PMC8226654 116. Peppone LJ Kleckner AS Fung C Puzas JE Reschke JE Culakova E Inglis J Kamen C Friedberg JW Janelsins M Mustian K Heckler CE Mohile S High-dose vitamin D to attenuate bone loss in patients with prostate cancer on androgen deprivation therapy: a phase 2 RCT Cancer 2024 130 2538 51 10.1002/cncr.35275 38520382 PMC11214601 Peppone LJ, Kleckner AS, Fung C, Puzas JE, Reschke JE, Culakova E, et al. High-dose vitamin D to attenuate bone loss in patients with prostate cancer on androgen deprivation therapy: a phase 2 RCT. Cancer. 2024;130:2538–51. 10.1002/cncr.35275. 38520382 10.1002/cncr.35275 PMC11214601 117. Malaeb H El-Khoury JM Vitamin D and bone fractures revisited Clin Chem 2023 69 209 209 10.1093/clinchem/hvac196 36724482 Malaeb H, El-Khoury JM. Vitamin D and bone fractures revisited. Clin Chem. 2023;69:209–209. 10.1093/clinchem/hvac196. 36724482 10.1093/clinchem/hvac196 118. Yao P Bennett D Mafham M Lin X Chen Z Armitage J Clarke R Vitamin D and calcium for the prevention of fracture: a systematic review and meta-analysis JAMA Netw Open 2019 2 e1917789 10.1001/jamanetworkopen.2019.17789 31860103 PMC6991219 Yao P, Bennett D, Mafham M, Lin X, Chen Z, Armitage J, et al. Vitamin D and calcium for the prevention of fracture: a systematic review and meta-analysis. JAMA Netw Open. 2019;2:e1917789. 10.1001/jamanetworkopen.2019.17789. 31860103 10.1001/jamanetworkopen.2019.17789 PMC6991219 119. Reid IR Bolland MJ Grey A Effects of vitamin D supplements on bone mineral density: a systematic review and meta-analysis Lancet 2014 383 146 55 10.1016/S0140-6736(13)61647-5 24119980 Reid IR, Bolland MJ, Grey A. Effects of vitamin D supplements on bone mineral density: a systematic review and meta-analysis. Lancet. 2014;383:146–55. 10.1016/S0140-6736(13)61647-5. 24119980 10.1016/S0140-6736(13)61647-5 120. Romano F Serpico D Cantelli M Sarno AD Dalia C Arianna R Lavorgna M Colao A Di Somma C Osteoporosis and dermatoporosis: a review on the role of vitamin D Front Endocrinol 2023 10.3389/fendo.2023.1231580 PMC10484397 37693364 Romano F, Serpico D, Cantelli M, Sarno AD, Dalia C, Arianna R, et al. Osteoporosis and dermatoporosis: a review on the role of vitamin D. Front Endocrinol. 2023;14:1231580. 10.3389/fendo.2023.1231580. 10.3389/fendo.2023.1231580 PMC10484397 37693364 121. LeBoff MS Chou SH Ratliff KA Cook NR Khurana B Kim E Cawthon PM Bauer DC Black D Gallagher JC Lee I-M Buring JE Manson JE Supplemental vitamin D and incident fractures in midlife and older adults N Engl J Med 2022 387 299 309 10.1056/NEJMoa2202106 35939577 PMC9716639 LeBoff MS, Chou SH, Ratliff KA, Cook NR, Khurana B, Kim E, Cawthon PM, Bauer DC, Black D, Gallagher JC, Lee I-M, Buring JE, Manson JE. Supplemental vitamin D and incident fractures in midlife and older adults. N Engl J Med. 2022;387:299–309. 10.1056/NEJMoa2202106. 35939577 10.1056/NEJMoa2202106 PMC9716639 122. De Souza MDM Moraes Dantas RL Leão Durães V Defante MLR Mendes TB Vitamin D supplementation and the incidence of fractures in the elderly healthy population: a meta-analysis of randomized controlled trials J Gen Intern Med 2024 39 2829 36 10.1007/s11606-024-08933-1 38997531 PMC11534935 De Souza MDM, Moraes Dantas RL, Leão Durães V, Defante MLR, Mendes TB. Vitamin D supplementation and the incidence of fractures in the elderly healthy population: a meta-analysis of randomized controlled trials. J Gen Intern Med. 2024;39:2829–36. 10.1007/s11606-024-08933-1. 38997531 10.1007/s11606-024-08933-1 PMC11534935 123. Appel LJ Michos ED Mitchell CM Blackford AL Sternberg AL Miller ER Juraschek SP Schrack JA Szanton SL Charleston J Minotti M Baksh SN Christenson RH Coresh J Drye LT Guralnik JM Kalyani RR Plante TB Shade DM Roth DL Tonascia J The effects of four doses of vitamin D supplements on falls in older adults: a response-adaptive, randomized clinical trial Ann Intern Med 2021 174 145 56 10.7326/M20-3812 33284677 PMC8240534 Appel LJ, Michos ED, Mitchell CM, Blackford AL, Sternberg AL, Miller ER, et al. The effects of four doses of vitamin D supplements on falls in older adults: a response-adaptive, randomized clinical trial. Ann Intern Med. 2021;174:145–56. 10.7326/M20-3812. 33284677 10.7326/M20-3812 PMC8240534 124. Wanigatunga AA Sternberg AL Blackford AL Cai Y Mitchell CM Roth DL Miller ER Szanton SL Juraschek SP Michos ED Schrack JA Appel, for the STURDY collaborative research group The effects of vitamin D supplementation on types of falls J Am Geriatr Soc 2021 69 2851 64 10.1111/jgs.17290 34118059 PMC8497407 Wanigatunga AA, Sternberg AL, Blackford AL, Cai Y, Mitchell CM, Roth DL, et al. The effects of vitamin D supplementation on types of falls. J Am Geriatr Soc. 2021;69:2851–64. 10.1111/jgs.17290. 34118059 10.1111/jgs.17290 PMC8497407 125. Cai B Zhou M Xiao Q Zou H Zhu X L-shaped association between serum 25-hydroxyvitamin D and all-cause mortality of individuals with rheumatoid arthritis Rheumatology 2023 62 575 82 10.1093/rheumatology/keac341 35689616 Cai B, Zhou M, Xiao Q, Zou H, Zhu X. L-shaped association between serum 25-hydroxyvitamin D and all-cause mortality of individuals with rheumatoid arthritis. Rheumatology. 2023;62:575–82. 10.1093/rheumatology/keac341. 35689616 10.1093/rheumatology/keac341 126. Mouterde G Gamon E Rincheval N Lukas C Seror R Berenbaum F Dupuy A-M Daien C Daurès J-P Combe B Association between vitamin D deficiency and disease activity, disability, and radiographic progression in early rheumatoid arthritis: the ESPOIR cohort J Rheumatol 2020 47 1624 8 10.3899/jrheum.190795 31839594 Mouterde G, Gamon E, Rincheval N, Lukas C, Seror R, Berenbaum F, Dupuy A-M, Daien C, Daurès J-P, Combe B. Association between vitamin D deficiency and disease activity, disability, and radiographic progression in early rheumatoid arthritis: the ESPOIR cohort. J Rheumatol. 2020;47:1624–8. 10.3899/jrheum.190795. 31839594 10.3899/jrheum.190795 127. Smolen JS Aletaha D McInnes IB Rheumatoid arthritis Lancet 2016 388 2023 38 10.1016/S0140-6736(16)30173-8 27156434 Smolen JS, Aletaha D, McInnes IB. Rheumatoid arthritis. Lancet. 2016;388:2023–38. 10.1016/S0140-6736(16)30173-8. 27156434 10.1016/S0140-6736(16)30173-8 128. Al-Saoodi H Kolahdooz F Andersen JR Jalili M Effect of vitamin D on inflammatory and clinical outcomes in patients with rheumatoid arthritis: a systematic review and dose–response meta-analysis of randomized controlled trials Nutr Rev 2024 82 600 11 10.1093/nutrit/nuad083 37437898 Al-Saoodi H, Kolahdooz F, Andersen JR, Jalili M. Effect of vitamin D on inflammatory and clinical outcomes in patients with rheumatoid arthritis: a systematic review and dose–response meta-analysis of randomized controlled trials. Nutr Rev. 2024;82:600–11. 10.1093/nutrit/nuad083. 37437898 10.1093/nutrit/nuad083 129. Ashiq K, Ashiq S, Mobashar A, Abid F, Yasmeen A, Shehzadi N, Tanveer Khan M, Hussain K. An Updated Review on Rheumatoid Arthritis (RA): Epidemiology, Pathophysiology, Diagnosis, and the Current Approaches for Its Treatment, SJMS 18 (2023) 539–551. 10.18502/sjms.v18i4.14742 130. Zou J Thornton C Chambers ES Rosser EC Ciurtin C Exploring the evidence for an immunomodulatory role of vitamin D in juvenile and adult rheumatic disease Front Immunol 2021 11 616483 10.3389/fimmu.2020.616483 33679704 PMC7930375 Zou J, Thornton C, Chambers ES, Rosser EC, Ciurtin C. Exploring the evidence for an immunomodulatory role of vitamin D in juvenile and adult rheumatic disease. Front Immunol. 2021;11:616483. 10.3389/fimmu.2020.616483. 33679704 10.3389/fimmu.2020.616483 PMC7930375 131. Cutolo M Soldano S Sulli A Smith V Gotelli E Influence of seasonal vitamin D changes on clinical manifestations of rheumatoid arthritis and systemic sclerosis Front Immunol 2021 12 683665 10.3389/fimmu.2021.683665 34267753 PMC8276051 Cutolo M, Soldano S, Sulli A, Smith V, Gotelli E. Influence of seasonal vitamin D changes on clinical manifestations of rheumatoid arthritis and systemic sclerosis. Front Immunol. 2021;12:683665. 10.3389/fimmu.2021.683665. 34267753 10.3389/fimmu.2021.683665 PMC8276051 132. El-Banna HS Gado SE Vitamin D Does it help Tregs in active rheumatoid arthritis patients Expert Rev Clin Immunol 2020 16 847 53 10.1080/1744666X.2020.1805317 32783547 El-Banna HS, Gado SE, Vitamin D. Does it help Tregs in active rheumatoid arthritis patients. Expert Rev Clin Immunol. 2020;16:847–53. 10.1080/1744666X.2020.1805317. 32783547 10.1080/1744666X.2020.1805317 133. Li D Jeffery LE Jenkinson C Harrison SR Chun RF Adams JS Raza K Hewison M Serum and synovial fluid vitamin D metabolites and rheumatoid arthritis J Steroid Biochem Mol Biol 2019 187 1 8 10.1016/j.jsbmb.2018.10.008 30611909 PMC6444051 Li D, Jeffery LE, Jenkinson C, Harrison SR, Chun RF, Adams JS, Raza K, Hewison M. Serum and synovial fluid vitamin D metabolites and rheumatoid arthritis. J Steroid Biochem Mol Biol. 2019;187:1–8. 10.1016/j.jsbmb.2018.10.008. 30611909 10.1016/j.jsbmb.2018.10.008 PMC6444051 134. Zhou L Wang J Li J Li T Chen Y June RR Zheng SG 1,25-dihydroxyvitamin D3 ameliorates collagen-induced arthritis via suppression of Th17 cells through miR-124 mediated inhibition of IL-6 signaling Front Immunol 2019 10.3389/fimmu.2019.00178 30792721 PMC6374300 Zhou L, Wang J, Li J, Li T, Chen Y, June RR et al. 1,25-dihydroxyvitamin D3 ameliorates collagen-induced arthritis via suppression of Th17 cells through miR-124 mediated inhibition of IL-6 signaling. Front Immunol. 2019;10:178. 10.3389/fimmu.2019.00178. 30792721 10.3389/fimmu.2019.00178 PMC6374300 135. Athanassiou L Kostoglou-Athanassiou I Koutsilieris M Shoenfeld Y Vitamin D and autoimmune rheumatic diseases Biomolecules 2023 13 709 10.3390/biom13040709 37189455 PMC10135889 Athanassiou L, Kostoglou-Athanassiou I, Koutsilieris M, Shoenfeld Y. Vitamin D and autoimmune rheumatic diseases. Biomolecules. 2023;13:709. 10.3390/biom13040709. 37189455 10.3390/biom13040709 PMC10135889 136. Zhang T-P Li H-M Huang Q Wang L Li X-M Metabolic pathway genes polymorphisms and their methylation levels in association with rheumatoid arthritis Front Immunol 2021 12 731565 10.3389/fimmu.2021.731565 34925313 PMC8677352 Zhang T-P, Li H-M, Huang Q, Wang L, Li X-M. Metabolic pathway genes polymorphisms and their methylation levels in association with rheumatoid arthritis. Front Immunol. 2021;12:731565. 10.3389/fimmu.2021.731565. 34925313 10.3389/fimmu.2021.731565 PMC8677352 137. Charoenngam N Vitamin D Diseases R A review of clinical evidence IJMS 2021 22 10659 10.3390/ijms221910659 34639000 PMC8508879 Charoenngam N, Vitamin D, Diseases R. A review of clinical evidence. IJMS. 2021;22:10659. 10.3390/ijms221910659. 34639000 10.3390/ijms221910659 PMC8508879 138. Despotović M Jevtović Stoimenov T Stojanović S Bašić J Kundalić J Đorđević B Ranđelović M Pavlović D Association of vitamin D receptor genetic variants with bone mineral density and inflammatory markers in rheumatoid arthritis Clin Biochem 2021 87 26 31 10.1016/j.clinbiochem.2020.10.006 33068571 Despotović M, Jevtović Stoimenov T, Stojanović S, Bašić J, Kundalić J, Đorđević B, Ranđelović M, Pavlović D. Association of vitamin D receptor genetic variants with bone mineral density and inflammatory markers in rheumatoid arthritis. Clin Biochem. 2021;87:26–31. 10.1016/j.clinbiochem.2020.10.006. 33068571 10.1016/j.clinbiochem.2020.10.006 139. Guan Y Hao Y Guan Y Bu H Wang H The effect of vitamin D supplementation on rheumatoid arthritis patients: a systematic review and meta-analysis Front Med 2020 7 596007 10.3389/fmed.2020.596007 PMC7661491 33195358 Guan Y, Hao Y, Guan Y, Bu H, Wang H. The effect of vitamin D supplementation on rheumatoid arthritis patients: a systematic review and meta-analysis. Front Med. 2020;7:596007. 10.3389/fmed.2020.596007. 10.3389/fmed.2020.596007 PMC7661491 33195358 140. Wu J Dong J Li S Luo J Zhang Y Liu H Ni Y Li X Zhou J Yang H Xie Q Jiang X Wang T Wang P Zeng F Chu Y Yang J Zeng F The role of vitamin D in combination treatment for patients with rheumatoid arthritis Front Med 2020 7 312 10.3389/fmed.2020.00312 PMC7381115 32766259 Wu J, Dong J, Li S, Luo J, Zhang Y, Liu H, et al. The role of vitamin D in combination treatment for patients with rheumatoid arthritis. Front Med. 2020;7:312. 10.3389/fmed.2020.00312. 10.3389/fmed.2020.00312 PMC7381115 32766259 141. Tian R Li X Li Y Wang K Wang C Yang P 1,25(OH)2D3 promotes chondrocyte apoptosis and restores physical function in rheumatoid arthritis through the NF-κB signal pathway Biomed Pharmacother 2018 106 149 55 10.1016/j.biopha.2018.06.061 29957465 Tian R, Li X, Li Y, Wang K, Wang C, Yang P. 1,25(OH)2D3 promotes chondrocyte apoptosis and restores physical function in rheumatoid arthritis through the NF-κB signal pathway. Biomed Pharmacother. 2018;106:149–55. 10.1016/j.biopha.2018.06.061. 29957465 10.1016/j.biopha.2018.06.061 142. Xu X Luo H Chen Q Wang Z Chen X Li X Chen H Wang M Xu Y Dai M Wang J Huang X Wu B Li Y Detecting potential mechanism of vitamin D in treating rheumatoid arthritis based on network pharmacology and molecular docking Front Pharmacol 2022 13 1047061 10.3389/fphar.2022.1047061 36532774 PMC9749856 Xu X, Luo H, Chen Q, Wang Z, Chen X, Li X, et al. Detecting potential mechanism of vitamin D in treating rheumatoid arthritis based on network pharmacology and molecular docking. Front Pharmacol. 2022;13:1047061. 10.3389/fphar.2022.1047061. 36532774 10.3389/fphar.2022.1047061 PMC9749856 143. Dankers W Den Braanker H Paulissen SMJ Van Hamburg JP Davelaar N Colin EM Lubberts E The heterogeneous human memory CCR6 + t helper-17 populations differ in t-bet and cytokine expression but all activate synovial fibroblasts in an IFNγ-independent manner Arthritis Res Ther 2021 23 157 10.1186/s13075-021-02532-9 34082814 PMC8173960 Dankers W, Den Braanker H, Paulissen SMJ, Van Hamburg JP, Davelaar N, Colin EM, et al. The heterogeneous human memory CCR6 + t helper-17 populations differ in t-bet and cytokine expression but all activate synovial fibroblasts in an IFNγ-independent manner. Arthritis Res Ther. 2021;23:157. 10.1186/s13075-021-02532-9. 34082814 10.1186/s13075-021-02532-9 PMC8173960 144. Harrison SR Li D Jeffery LE Raza K Hewison M Vitamin D Autoimmune disease and rheumatoid arthritis Calcif Tissue Int 2020 106 58 75 10.1007/s00223-019-00577-2 31286174 PMC6960236 Harrison SR, Li D, Jeffery LE, Raza K, Hewison M, Vitamin D. Autoimmune disease and rheumatoid arthritis. Calcif Tissue Int. 2020;106:58–75. 10.1007/s00223-019-00577-2. 31286174 10.1007/s00223-019-00577-2 PMC6960236 145. Zhang Y Li S Zhuo F Wang H Geng X Xu B Yin L Sun H Yan X Additive effects of VDBP and 1,25(OH)2D3 on the viability and apoptosis of rheumatoid arthritis synovial fibroblasts Front Endocrinol 2021 11 583229 10.3389/fendo.2020.583229 PMC7876401 33584536 Zhang Y, Li S, Zhuo F, Wang H, Geng X, Xu B, Yin L, Sun H, Yan X. Additive effects of VDBP and 1,25(OH)2D3 on the viability and apoptosis of rheumatoid arthritis synovial fibroblasts. Front Endocrinol. 2021;11:583229. 10.3389/fendo.2020.583229. 10.3389/fendo.2020.583229 PMC7876401 33584536 146. Global Tuberculosis Report. 2024, 1st ed, World Health Organization, Geneva, 2024. 147. Shapira Y Agmon-Levin N Shoenfeld Y Autoimmunity MT Vitamin D Clin Rev Allerg Immunol 2010 38 169 77 10.1007/s12016-009-8150-1 19543859 Shapira Y, Agmon-Levin N, Shoenfeld Y, Autoimmunity MT, Vitamin D. Clin Rev Allerg Immunol. 2010;38:169–77. 10.1007/s12016-009-8150-1. 10.1007/s12016-009-8150-1 19543859 148. Cai L Wang G Zhang P Hu X Zhang H Wang F Tong Y The progress of the prevention and treatment of vitamin D to tuberculosis Front Nutr 2022 9 873890 10.3389/fnut.2022.873890 35662926 PMC9159148 Cai L, Wang G, Zhang P, Hu X, Zhang H, Wang F, et al. The progress of the prevention and treatment of vitamin D to tuberculosis. Front Nutr. 2022;9:873890. 10.3389/fnut.2022.873890. 35662926 10.3389/fnut.2022.873890 PMC9159148 149. Tang L Liu S Bao Y Gao R Han C Sun X Zhang W Feng S Study on the relationship between vitamin D deficiency and susceptibility to spinal tuberculosis Int J Surg 2017 44 99 103 10.1016/j.ijsu.2017.05.077 28629765 Tang L, Liu S, Bao Y, Gao R, Han C, Sun X, Zhang W, Feng S. Study on the relationship between vitamin D deficiency and susceptibility to spinal tuberculosis. Int J Surg. 2017;44:99–103. 10.1016/j.ijsu.2017.05.077. 28629765 10.1016/j.ijsu.2017.05.077 150. Papagni R Pellegrino C Di Gennaro F Patti G Ricciardi A Novara R Cotugno S Musso M Guido G Ronga L Stolfa S Bavaro DF Romanelli F Totaro V Lattanzio R De Iaco G Palmieri F Saracino A Gualano G Impact of vitamin D in prophylaxis and treatment in tuberculosis patients IJMS 2022 23 3860 10.3390/ijms23073860 35409219 PMC8999210 Papagni R, Pellegrino C, Di Gennaro F, Patti G, Ricciardi A, Novara R, Cotugno S, Musso M, Guido G, Ronga L, Stolfa S, Bavaro DF, Romanelli F, Totaro V, Lattanzio R, De Iaco G, Palmieri F, Saracino A, Gualano G. Impact of vitamin D in prophylaxis and treatment in tuberculosis patients. IJMS. 2022;23:3860. 10.3390/ijms23073860. 35409219 10.3390/ijms23073860 PMC8999210 151. Ralph AP Lucas RM Norval M Vitamin D and solar ultraviolet radiation in the risk and treatment of tuberculosis Lancet Infect Dis 2013 13 77 88 10.1016/S1473-3099(12)70275-X 23257233 Ralph AP, Lucas RM, Norval M. Vitamin D and solar ultraviolet radiation in the risk and treatment of tuberculosis. Lancet Infect Dis. 2013;13:77–88. 10.1016/S1473-3099(12)70275-X. 23257233 10.1016/S1473-3099(12)70275-X 152. Tabsh N Bilezikian JP Vitamin D status as a risk factor for tuberculosis infection Adv Nutr 2025 16 100394 10.1016/j.advnut.2025.100394 39986573 PMC11979928 Tabsh N, Bilezikian JP. Vitamin D status as a risk factor for tuberculosis infection. Adv Nutr. 2025;16:100394. 10.1016/j.advnut.2025.100394. 39986573 10.1016/j.advnut.2025.100394 PMC11979928 153. Ganmaa D Uyanga B Zhou X Gantsetseg G Delgerekh B Enkhmaa D Khulan D Ariunzaya S Sumiya E Bolortuya B Yanjmaa J Enkhtsetseg T Munkhzaya A Tunsag M Khudyakov P Seddon JA Marais BJ Batbayar O Erdenetuya G Amarsaikhan B Spiegelman D Tsolmon J Martineau AR Vitamin D supplements for prevention of tuberculosis infection and disease N Engl J Med 2020 383 359 68 10.1056/NEJMoa1915176 32706534 PMC7476371 Ganmaa D, Uyanga B, Zhou X, Gantsetseg G, Delgerekh B, Enkhmaa D, Khulan D, Ariunzaya S, Sumiya E, Bolortuya B, Yanjmaa J, Enkhtsetseg T, Munkhzaya A, Tunsag M, Khudyakov P, Seddon JA, Marais BJ, Batbayar O, Erdenetuya G, Amarsaikhan B, Spiegelman D, Tsolmon J, Martineau AR. Vitamin D supplements for prevention of tuberculosis infection and disease. N Engl J Med. 2020;383:359–68. 10.1056/NEJMoa1915176. 32706534 10.1056/NEJMoa1915176 PMC7476371 154. Taylor PN Davies JS A review of the growing risk of vitamin D toxicity from inappropriate practice Br J Clin Pharmacol 2018 84 1121 7 10.1111/bcp.13573 29498758 PMC5980613 Taylor PN, Davies JS. A review of the growing risk of vitamin D toxicity from inappropriate practice. Br J Clin Pharmacol. 2018;84:1121–7. 10.1111/bcp.13573. 29498758 10.1111/bcp.13573 PMC5980613 155. Vieira IH Rodrigues D Paiva I Vitamin D and autoimmune thyroid Disease—Cause, consequence, or a vicious cycle?? Nutrients 2020 12 2791 10.3390/nu12092791 32933065 PMC7551884 Vieira IH, Rodrigues D, Paiva I. Vitamin D and autoimmune thyroid Disease—Cause, consequence, or a vicious cycle?? Nutrients. 2020;12:2791. 10.3390/nu12092791. 32933065 10.3390/nu12092791 PMC7551884 156. Bouillon R Manousaki D Rosen C Trajanoska K Rivadeneira F Richards JB The health effects of vitamin D supplementation: evidence from human studies Nat Rev Endocrinol 2022 18 96 110 10.1038/s41574-021-00593-z 34815552 PMC8609267 Bouillon R, Manousaki D, Rosen C, Trajanoska K, Rivadeneira F, Richards JB. The health effects of vitamin D supplementation: evidence from human studies. Nat Rev Endocrinol. 2022;18:96–110. 10.1038/s41574-021-00593-z. 34815552 10.1038/s41574-021-00593-z PMC8609267 157. Bikle DD. Extraskeletal actions of vitamin D, (2017). 10.1111/nyas.13219 PMC5031366 27649525 158. Yan X Li X Liu B Huang J Xiang Y Hu Y Tang X Zhang Z Huang G Xie Z Zhou H Liu Z Wang X Leslie RD Zhou Z Combination therapy with saxagliptin and vitamin D for the preservation of β-cell function in adult-onset type 1 diabetes: a multi-center, randomized, controlled trial Sig Transduct Target Ther 2023 8 158 10.1038/s41392-023-01369-9 PMC10115841 37076476 Yan X, Li X, Liu B, Huang J, Xiang Y, Hu Y, Tang X, Zhang Z, Huang G, Xie Z, Zhou H, Liu Z, Wang X, Leslie RD, Zhou Z. Combination therapy with saxagliptin and vitamin D for the preservation of β-cell function in adult-onset type 1 diabetes: a multi-center, randomized, controlled trial. Sig Transduct Target Ther. 2023;8:158. 10.1038/s41392-023-01369-9. 10.1038/s41392-023-01369-9 PMC10115841 37076476 159. Giustina A Bilezikian JP Adler RA Banfi G Bikle DD Binkley NC Bollerslev J Bouillon R Brandi ML Casanueva FF Di Filippo L Donini LM Ebeling PR Fuleihan GE-H Fassio A Frara S Jones G Marcocci C Martineau AR Minisola S Napoli N Procopio M Rizzoli R Schafer AL Sempos CT Ulivieri FM Virtanen JK Consensus statement on vitamin D status assessment and supplementation: whys, whens, and hows Endocr Rev 2024 45 625 54 10.1210/endrev/bnae009 38676447 PMC11405507 Giustina A, Bilezikian JP, Adler RA, Banfi G, Bikle DD, Binkley NC, et al. Consensus statement on vitamin D status assessment and supplementation: whys, whens, and hows. Endocr Rev. 2024;45:625–54. 10.1210/endrev/bnae009 38676447 10.1210/endrev/bnae009 PMC11405507 160. Pickering M-E Souberbielle J-C Boutten A Breuil V Briot K Chapurlat R Fardellone P Javier R-M Koumakis E Cortet B Daily or intermittent vitamin D supplementation in patients with or at risk of osteoporosis: position statement from the GRIO Joint Bone Spine 2025 92 105858 10.1016/j.jbspin.2025.105858 39978583 Pickering M-E, Souberbielle J-C, Boutten A, Breuil V, Briot K, Chapurlat R, Fardellone P, Javier R-M, Koumakis E, Cortet B. Daily or intermittent vitamin D supplementation in patients with or at risk of osteoporosis: position statement from the GRIO. Joint Bone Spine. 2025;92:105858. 10.1016/j.jbspin.2025.105858. 39978583 10.1016/j.jbspin.2025.105858 161. Wiedemann TG Jin HW Gallagher B Witek L Miron RJ Talib HS Vitamin D screening and supplementation—a novel approach to higher success: an update and review of the current literature J Biomed Mater Res 2025 10.1002/jbm.b.35558 39976133 Wiedemann TG, Jin HW, Gallagher B, Witek L, Miron RJ, Talib HS. Vitamin D screening and supplementation—a novel approach to higher success: an update and review of the current literature. J Biomed Mater Res. 2025. 10.1002/jbm.b.35558. 10.1002/jbm.b.35558 39976133 162. Clasen JL Cole R Aune D Sellon E Heath AK Vitamin D status and risk of rheumatoid arthritis: systematic review and meta-analysis BMC Rheumatol 2023 10.1186/s41927-023-00325-y 36918989 PMC10015722 Clasen JL, Cole R, Aune D, Sellon E, Heath AK. Vitamin D status and risk of rheumatoid arthritis: systematic review and meta-analysis. BMC Rheumatol. 2023. 10.1186/s41927-023-00325-y. 36918989 10.1186/s41927-023-00325-y PMC10015722 ",
  "metadata": {
    "Title of this paper": "Vitamin D status and risk of rheumatoid arthritis: systematic review and meta-analysis",
    "Journal it was published in:": "Nutrition & Metabolism",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490156/"
  }
}