{
  "title": "Paper_614",
  "abstract": "pmc Front Urol Front Urol 4779 fruro Front. Urol. Frontiers in Urology 2673-9828 Frontiers Media SA PMC12479309 PMC12479309.1 12479309 12479309 41035487 10.3389/fruro.2025.1657553 1 Urology Original Research Prevalence of erectile dysfunction and associated factors among newly diagnosed ART naïve men living with HIV: a cross sectional study in Mwanza, Northwestern Tanzania Iddi Shabani  1  * Matovelo Dismas  2 Marwa Karol J.  3 Kidenya Benson R.  4 Dika Haruna  1 Kalluvya Samuel E.  5  1 Department of Physiology, Weill Bugando School of Medicine, Catholic University of Health and Allied Sciences Mwanza Tanzania  2 Department of Obstetrics and Gynecology, Weill Bugando School of Medicine, Catholic University of Health and Allied Sciences Mwanza Tanzania  3 Department of Pharmacology, Weill Bugando School of Medicine, Catholic University of Health and Allied Sciences Mwanza Tanzania  4 Department of Biochemistry and Molecular Biology, Weill Bugando School of Medicine, Catholic University of Health and Allied Sciences Mwanza Tanzania  5 Department of Internal Medicine, Weill Bugando School of Medicine, Catholic University of Health and Allied Sciences Mwanza Tanzania Edited by: Diego Ripamonti Reviewed by: Mohammed Abu El-Hamd  Jerman Dereje *Correspondence: Shabani Iddi, shabsizya2007@yahoo.co.uk 16 9 2025 2025 5 494538 1657553 01 7 2025 29 8 2025 16 09 2025 01 10 2025 02 10 2025 Copyright © 2025 Iddi, Matovelo, Marwa, Kidenya, Dika and Kalluvya. 2025 Iddi, Matovelo, Marwa, Kidenya, Dika and Kalluvya https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Background Erectile dysfunction (ED) is a frequent finding in men living with human immunodeficiency virus (HIV) (MLWH) and this remains a major concern because of its negative impact on the quality of life of those affected. There is limited data about the magnitude of ED and associated factors among MLWH in Tanzania. Thus this study was aimed to determine the prevalence of ED and associated factors among newly diagnosed antiretroviral therapy (ART)-naive MLWH in Mwanza, Northwestern Tanzania. Methods A cross-sectional study was conducted among 373 newly diagnosed ART-naïve MLWH attending voluntary counseling and testing centers of four selected hospitals in Mwanza region who were consecutively enrolled and subjected to thorough clinical and general physical examination, including anthropometric measurements. A pre-structured questionnaire was used to collect socio-demographic characteristics and clinical data. ED was assessed using the International Index of Erectile Function–5. Serum total testosterone, follicle-stimulating hormone, luteinizing hormone and estradiol were estimated. Data were entered in Microsoft Excel, cleaned and analyzed using STATA version 15. Results Of the 373 analyzed participants with a median age of 40 [IQR: 33–46] years, ED was found in 56.3% (95% CI 51.2%–61.3%), whereas the majority presented with mild (45.2%) to mild-moderate (40.0%) ED. The median testosterone was significantly lower in men with ED as compared with men without (294.5 [135–469] versus 482 [191–602] ng/ml; p < Conclusion ED was found in more than half of ART naïve MLWH. The majority had a mild to mild-moderate ED. There was a significant association between ED and WHO clinical stage 4 for HIV infection, low testosterone level, and being non-self-employed. This finding emphasizes the need to routinely screen for early detection and management of ED in care and treatment center (CTC) clinics. HIV antiretroviral naïve males erectile dysfunction associated factors Tanzania The author(s) declare that no financial support was received for the research and/or publication of this article. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Male Urology Introduction Erectile dysfunction (ED) is defined as the inability to achieve or maintain a satisfactory penile erection during sexual intercourse ( 1 2 3 4 5 4 6 9 4 7 10 11 2 12 4 13 14 15 12 16 17 18 19 20 The prevalence of ED is higher in men living with human immunodeficiency virus (HIV) (MLWH) than in the general population reaching to 74% in some studies ( 21 22 23 24 26 21 27 28 3 29 33 Even though ED is more prevalent in MLWH than in the general population, little consideration has been given worldwide to the diagnosis and management of ED among MLWH, and Tanzania inclusive. There is paucity of evidence on the magnitude and factors associated with ED in MLWH in Tanzania. This study is aimed to determine the prevalence of ED and its associated factors among newly diagnosed MLWH, in Mwanza, Northwestern Tanzania. Materials and methods Study design, setting and period A hospital-based, multi-center, cross-sectional study involving newly diagnosed HIV positive males was conducted at Voluntary Counseling and Testing (VCT) centers at Sekou-Toure Regional Referral Hospital (STRRH), Bugando Medical Centre (BMC), Nyamagana District Hospital (NDH) and Magu District Hospital (MDH), Mwanza, Tanzania from January 2020 and August 2022. Study population and eligibility criteria All newly diagnosed HIV positive (diagnosed as per WHO guidelines 2015) males aged 18 years and above who attended the VCTs during the study period were included in the study. Patients with previous history of gonadal dysfunction, taking drugs known to affect hormone levels (i.e. androgens, sex steroids, dehydroepiandrosterone, antiandrogens, anabolic agents, GnRH agonists and psycholeptic agents), having chronic liver disease, coinfection with hepatitis B virus (HBV) and hepatitis C virus (HCV) chronic kidney injury, tuberculosis and Diabetes mellitus (DM) that could serve as confounders were excluded from this study. Sample size and sampling procedure Sample size for this study was calculated using Kish-Leslie formula (1965) ( 34 n = Z σ 2 x ( p ) × ( 1 − p ) ϵ 2 Where: n = minimum sample size Zσ = Z score level of significance (1.96) P = Prevalence from previous study ϵ = Precision of the study (set at 5% or 0.05) Using the prevalence of ED of 37.8% from a study done in Nigeria ( 35 Data collection and laboratory procedure All participants were evaluated clinically by comprehensive history taking and a general physical examination including anthropometric measurements such as waist circumference (WC) and body mass index (BMI). Socio-demographic data including age, employment status, marital status and herbal medicine use status (whether they used any herbal medicine within the past six months or not) were collected using a pre-structured questionnaire. Height was measured in the upright standing position using a calibrated stadiometer. Body weight was measured with minimal clothing by using a standard calibrated weighing scale, and BMI was then calculated by the formula: weight in kilograms divided by height in meters squared. WC was measured at the approximate midpoint between the lower margin of the last palpable rib and the top of the iliac crest using flexible plastic tape and was calculated as an average of 3 measurements. Anthropometric parameters were measured by a single trained research assistant at each hospital. ED was studied by using the validated Swahili translated 5-item version of the International Index of Erectile Function (IIEF-5) questionnaire ( 36 40 36 41 Five milliliters (mls) of venous blood sample was collected from each of the study participants between 8.00 AM and 11.00 AM and serum was harvested. The serum was used for the estimation of total testosterone (TT) hormone, follicle stimulating hormone (FSH), luteinizing hormone (LH) and estradiol levels. The serum samples were stored at -20°C for not more than 30 days until analyzed. The hormonal tests were done using chemiluminescence immunoassay (CLIA) techniques. The CLIA kits were sourced from the Snibe Co., Ltd, Shnzhen, China. Serum hormones (TT, FSH, LH and estradiol) were estimated using the fully-automated chemiluminescence immunoassay analyzer model Maglumi 2000 (Snibe Diagnostic, China) following CLIA principles and the kit manufacturer’s instructions. The CD4+ count was assessed by flow cytometry (Roche diagnostics). Hypogonadism was defined as a serum TT level of<300ng/dl or a serum TT level of ≥300 ng/dl with high FSH (>12 mlU/L) or LH (>12 mlU/L) level ( 42 42 43 Data analysis Data were cleaned and checked for completeness and consistency and then corrected. The data were coded and entered into Microsoft Excel and then transported to STATA software, version 15 (Texas, USA) for analysis. For descriptive statistics results were expressed in tables, bar graphs and pie charts. Categorical variables were summarized using frequencies and percentages while continuous variables were summarized using median with interquartile range (IQR). Graphical distribution plots and Shapiro-Wilk test was used to assess the normality of data distribution. The associations between categorical variables and ED were determined using a Pearson’s Chi-square test or Fisher’s exact test where appropriate. To assess the significance of difference when comparing various patient characteristics (Age, BMI, Waist circumference, CD4 cell count and TT) between participants with ED and those without ED we used Wilcoxon rank-sum test. Univariate followed by multivariate logistic regression models were used to determine risk factors for ED whereby factors with a p value less than 0.2 in the univariate were subjected to multivariate logistic regression analysis. In all analyses, the statistical significance was set at a p-value of less than 0.05. Ethical considerations Ethical approval was granted by the Joint Catholic University of Health and Allied Sciences and Bugando Medical Center (CUHAS/BMC) research ethics and review committee with ethical clearance certificate number CREC/407/2019. Permission to carry out the study was also sought from the appropriate hospital authorities. The study participants provided written informed consent before participating in the study. No information was shared with any third party, and numbers were used in the questionnaires instead of personal identifiers. The copies of the hormone assay results report were shared to the clinicians, and all participants diagnosed with hypogonadism and ED were advised to report to the clinicians for advice and further management. Results A total of 388 participants were enrolled in this study, however, the final analysis included 373 newly diagnosed ART naïve MLWH with a median age [IQR] of 40 [33–46] years. Fifteen participants were excluded from the final analysis as they did not complete the IIEF-5 questionnaire for ED assessment. Of the 373 participants, 35% (132/373) were from NDH, 29% (110/373), 28% (105/373) and 7.0% (26/373) from BMC, STRR and MDH respectively. The majority (58.7%, 219/373) of participants were in the age range 31–45 years, were married (64.3%, 240/373) and reported to have not used herbal medicine in the past six months (66.5%, 248/373). The median BMI and WC of the study participants were 21.1 [19.4–23.5] kg/m 2  Table 1 Table 1 Socio-demographic characteristics of study participants (N = 373). Variable Frequency (n)/Median Percent (%)/IQR Median age (Years) 40 [33 – 46] Age groups (Years) 18-30 52 13.9 31-45 219 58.7 ≥ 46 102 27.4 Median BMI (kg/m 2 21.1 [19.4 – 23.5] BMI category (kg/m 2 <18.5 55 14.9 18.5 – 24.9 262 70.8 25-29.9 49 13.2 ≥ 30 4 1.1 Median Waist Circumference (cm) 80 [76 – 83] Waist circumference category (cm) <81 206 55.2 81 – 93 156 41.8 94 – 115 11 3.0 Marital status Married 240 64.3 Single 81 21.7 Divorced/separated 52 14.0 Herbal medicine use Yes 125 33.5 No 248 66.5 Employment status Non self employed 68 18.2 Self Employed 280 75.1 Unemployed 25 6.7 Clinical characteristics of study participants Among 267 study participants who had CD4+ data, the median CD4+ count was 297 [164.0–409]. The majority, 62.5% (233/376) of the study participants were grouped in stage one of the disease according to World Health Organization HIV staging. The median testosterone was 376 [165–553] and the majority (56.3%, 210/373) had testosterone levels above normal. Hypogonadism was present in nearly half (48.8%, 182/373) of study participants (  Table 2 Table 2 Clinical characteristics of study participants (N = 373). Variable Frequency (n)/Median Percent (%)/IQR Median CD4 count (cells/µl) 297 [164 – 409] CD4 category >350 103 38.6 <200 80 30.0 200-350 84 31.5 WHO clinical stage Stage 1 233 62.5 Stage 2 58 15.5 Stage 3 60 16.1 Stage 4 22 5.9 Median Total Testosterone (TT) (ng/ml) 376 [165 – 553] TT category ≥300 210 56.3 <300 163 43.7 Hypogonadism Yes 182 48.8 No 191 51.2 Prevalence of erectile dysfunction Erectile dysfunction (ED) was found in 56.3% ( 95%  Figure 1  Figure 2 < )  Table 3 Figure 1 Prevalence of erectile dysfunction among study participants. Pie chart illustrating erectile dysfunction prevalence. Fifty-six point three percent, represented in red, indicates erectile dysfunction present. Forty-three point seven percent, shown in blue, signifies no erectile dysfunction. Total sample size is three hundred seventy-three. Figure 2 Categories of ED among participants with ED. Bar chart showing percentages of erectile dysfunction severity among a group. Mild: 45.2% (95/210), mild moderate: 40.0% (84/210), moderate: 11.4% (24/210), severe: 3.3% (7/210). Table 3 Socio-demographic and clinical characteristics of study participants according to the erectile function status (N = 373). Characteristics With erectile dysfunction Without Erectile dysfunction p-Value Median age (Years) (Median [IQR]) 41 [35–48] 38[32–45] 0.009† Age groups (Years) 18-30 26 (50.0) 26 (50.0) 0.117 31-45 118 (53.9) 101 (46.1) ≥ 46 66 (64.7) 36 (35.3) Median BMI (kg/m 2 20.9 [9.3–23.4] 21.4 [19.5–23.8] 0.224† BMI category (kg/m 2 <18.5 34 (61.8) 21 (38.2) 0.439* 18.5–24.9 148 (56.5) 114 (43.5) 25-29.9 25 (51.0) 24 (49.0) ≥ 30 1 (25.0) 3 (75.0) Median Waist Circumference (cm) 80 [76–84] 80 [77–83] 0.699† Waist circumference category (cm) <81 113 (54.8) 93 (45.2) 0.782* 81–93 90 (57.7) 66 (42.3) 94–115 7 (63.6) 4 (36.4) Marital status Married 146 (60.8) 94 (39.2) 0.056 Single 40 (49.4) 41 (50.6) Divorced/separated 24 (46.2) 28 (53.8) Herbal medicine use Yes 79 (63.2) 46 (36.8) 0.056 No 131 (52.8) 117 (47.2) Employment status Non self employed 51 (75.0) 17 (25.0) 0.002 Self Employed 144 (51.4) 136 (48.6) Unemployed 15 (60.0) 10 (40.0) CD4 count (cells/µl) 289 [148–404] 309 [209–421] 0.245† CD4 category >350 57 (55.3) 46 (44.7) 0.297 <200 53 (66.3) 27 (33.7) 200-350 48 (57.1) 36 (42.9) WHO clinical stage Stage 1 118 (50.6) 115 (49.4) 0.023 Stage 2 37 (63.8) 21 (36.2) Stage 3 38 (63.3) 22 (36.7) Stage 4 17 (77.3) 5 (22.7) Median Total Testosterone (TT) (ng/ml) 294.5 [135–496] 482 [191–602] < 0.001† TT category ≥300 103 (49.1) 107 (50.9) 0.001 <300 107 (65.6) 56 (34.4) Hypogonadism Yes 117 (64.3) 65 (35.7) 0.002 No 93 (48.7) 98 (51.3) *Fisher’s exact. †Two-sample Wilcoxon rank-sum (Mann-Whitney) test. Factors associated with erectile dysfunction among study participants In the univariate analysis the independent variables associated with ED were non-self-employment status (COR 2.8; 95% CI 1.6–5.1; p = 0.001)), WHO clinical stage 4 of HIV infection (COR 3.3; 95% CI 1.2–9.3; p = 0.023)), low testosterone level (< 300) (COR 2.0; 95% CI 1.3–3.0; p = 0.001) and hypogonadism (COR 1.9; 95% CI 1.3–2.9; p = 0.003). Following multivariate logistic regression analysis, newly diagnosed ART naïve MLWH who were non-self-employed (AOR 3.7; 95% CI 2.0–7.0; p< 0.001) were four times more likely to develop ED as compared to self-employed MLWH, newly diagnosed ART naïve MLWH in WHO clinical stage 4 for HIV infection (AOR 3.2; 95% CI 1.1–9.2; p = 0.032) were three times more likely to develop ED as compared to those in WHO clinical stage 1 for HIV infection and newly diagnosed ART naïve MLWH with low testosterone level (< 300) (AOR 1.9; 95% CI 1.2–3.0; p = 0.010) were two times more likely to develop ED as compared to those with normal and above testosterone level. Univariate analysis, CD4+ count (COR 0.6; 95% CI 0.3–1.2; p = 0.136), and hypogonadism (COR 1.9; 95% CI 1.3–2.9; p = 0.003) were not subjected to multivariate logistic regression analysis due to collinearity with WHO clinical stage and Testosterone (TT) respectively (  Table 4 Table 4 Factors associated with erectile dysfunction among newly diagnosed ART naive HIV-infected males (Univariate and multivariate logistic regression). Characteristics Erectile dysfunction Univariate Multivariate Yes n (%) No n (%) COR (95% CI) p-value AOR (95% CI) p-value Age (Years) 18-30 26 (50.0) 26 (50.0) 1.0 1.0 31-45 118 (53.9) 101 (46.1) 1.2 (0.6–2.1) 0.614 1.1 (0.5–2.2 0.589 ≥ 46 66 (64.7) 36 (35.3) 1.8 (0.9–3.6) 0.080 1.6 (0.7–3.6) 0.266 BMI (kg/m 2 18.5–24.9 148 (56.5) 114 (43.5) 1.0 – – <18.5 34 (61.8) 21 (38.2) 1.2 (0.7–2.3) 0.468 – – 25-29.9 25 (51.0) 24 (49.0) 0.8 (0.4–1.4) 0.480 – – ≥ 30 1 (25.0) 3 (75.0) 0.3 (0.03–2.5) 0.242 – – Waist circumference (cm) 81–93 90 (57.7) 66 (42.3) 1.0 – – <81 113 (54.8) 93 (45.2) 0.9 (0.6–1.4) 0.590 – – 94–115 7 (63.6) 4 (36.4) 1.3 (0.4–4.6) 0.700 – – Marital status Single 40 (49.4) 41 (50.6) 1.0 1.0 Married 146 (60.8) 94 (39.2) 1.6 (0.9–2.6) 0.072 1.4 (0.8–2.6) 0.253 Divorced/separated 24 (46.2) 28 (53.8) 0.9 (0.4–1.8) 0.716 0.6 (0.3–1.4) 0.243 Herbal medicine use No 131 (52.8) 117 (47.2) 1.0 1.0 Yes 79 (63.2) 46 (36.8) 1.5 (0.9–2.4) 0.057 1.4 (0.9–2.40 0.156 Employment status Self-employed 144 (51.4) 136 (48.6) 1.0 1.0 Non Self-Employed 51 (75.0) 17 (25.0) 2.8 (1.6–5.1) 0.001 3.7 (2.0–7.0)  < 0.001 Unemployed 15 (60.0) 10 (40.0) 1.4 (0.6–3.3) 0.413 1.6 (0.7–4.1) 0.284 CD4 count (cells/µl) >350 57 (55.3) 46 (44.7) 1.0 – – <200 53 (66.3) 27 (33.7) 0.7 (0.4–1.3) 0.232 – – 200-350 48 (57.1) 36 (42.9) 0.6 (0.3–1.2) 0.136* – – WHO clinical stage – – Stage 1 118 (50.6) 115 (49.4) 1.0 1.0 Stage 2 37 (63.8) 21 (36.2) 1.7 (0.9–3.1) 0.074 1.7 (0.9–3.2) 0.094 Stage 3 38 (63.3) 22 (36.7) 1.7 (0.9–3.0) 0.081 1.4 (0.7–2.6) 0.351 Stage 4 17 (77.3) 5 (22.7) 3.3 (1.2–9.3) 0.023 3.2 (1.1-9.2)  0.032 TT (ng/ml) ≥300 103 (49.1) 107 (50.9) 1.0 1.0 <300 107 (65.6) 56 (34.4) 2.0 (1.3–3.0) 0.001 1.9 (1.2–3.0)  0.010 Hypogonadism status No 93 (48.7) 98 (51.3) 1.0 – – Yes 117 (64.3) 65 (35.7) 1.9 (1.3–2.9) 0.003* – – *These factors were not subjected to multivariate logistic regression analysis because of collinearity with WHO clinical stage and TT respectively. Bold p-value = significant. COR, Crude Odds Ratio. AOR, Adjusted Odds Ratio. Discussion Erectile dysfunction (ED) is a global public health concern owing to its negative impact on the well-being of individuals, families, and communities. In this study, the prevalence of ED among ART naïve MLWH was found to be 56.3% ( 95% 44 45 46 2 28 35 3 5 47 50 51 3 35 Regarding categories of ED according to severity among participants, of the 210 subjects with ED in our study, 95 (45.2%) were mild ED, 84 (40.0%) were mild to moderate ED, 24 (11.4%) were moderate ED and 7 (3.3%) had severe ED. A closely similar pattern was reported by Mbwambo et al. in Northern Tanzania ( 45 46 3 52 53 58 The risk factors for ED include vascular diseases, hypertension and obesity which are typically more common in the elderly population ( 59 2 16 28 35 45 21 60 61 3 30 In our study, no significant association was found between marital status and ED. This finding corresponds to the reports by Gomez et al. ( 3 45 46 58 62 64 62 64 62 65 66 In this study, an association between herbal medicine use and ED was not observed. In a previous report, herbal medicine use was found to be significantly associated with hypogonadism in newly diagnosed ART naïve HIV-infected males ( 67 22 Findings of the present study show that employment status is significantly associated with ED and this is in support of the findings of previous studies ( 3 58 A statistically significant association was also found between WHO clinical stage (that determines the clinical progression of the disease) and ED whereby MLWH in WHO clinical stage 4 for HIV infection were three times more likely to develop ED as compared to those in stage 1. HIV infection causes impaired immunity with an associated decrease in CD4+ count leading to comorbid conditions, hence poor health status. This observation may be explained by the link between poor health status and impaired gonadal function ( 6 68 69 72 Furthermore, this study shows that nearly half of the study participants had hypogonadism. Several studies have also demonstrated an association between HIV and low serum testosterone ( 28 73 74 23 45 68 75 Strengths and limitations Limitations of this study include determination of ED only through self-report while it is recommended to establish ED diagnosis after a complete physical and psychological evaluation to determine vasculogenic or psychogenic factors ( 76 77 78 79 In addition, this study is limited by failure to rule out factors that may also cause erectile dysfunction (by affecting neuron functions) such as hypertension, other sexually transmitted infections like syphilis, gonorrhea and chlamydia. Further in the current study, we did not include other factors such as alcohol use, cigarette smoking and education status of which other studies have shown there is an association between them and ED ( 2 16 28 46 This was the first study on ED in HIV patients in Northwestern Tanzania, and provides information on risk factors and magnitude of ED in our setting. Also this study being done among newly diagnosed ART-naïve HIV males allows observation of the impact of chronic inflammation of the virus itself rather than the role of ART which was not distinguished in most of the previous studies. Further studies are required to compare ED between men who are HIV positive and those who are HIV negative and follow-up studies to compare before and after initiation of ARTs. Conclusion Slightly more than half of ART naïve MLWH were found to have ED with the majority presenting with a mild to mild-moderate form of ED. There was a significant association of ED with WHO clinical stage 4 for HIV infection, lower testosterone level, and being non self-employed. The results of this study emphasizes the need to include ED screening as part of the overall care of MLWH in CTC clinics as well as to strengthen the HIV screening program for early diagnosis and treatment to mitigate most of the observed risk factors for ED. Acknowledgments The authors would like to thank the staff of VCT centers and CTC clinics at BMC, STRRH, NDH, IDH and MDH for their valuable assistance during data collection; and laboratory technicians of the CUHAS multipurpose Laboratory and BMC Central Laboratory for their assistance in laboratory sample processing and analysis. The authors also wish to express their gratitude to all HIV-infected men who agreed to participate in this study. This work was supported by Catholic University of Health and Allied Sciences as part of PhD study. Data availability statement The raw data supporting the conclusions of this article will be made available by the authors, without undue reservation. Ethics statement The studies involving humans were approved by Joint Catholic University of Health and Allied Sciences and Bugando Medical Center (CUHAS/BMC) research ethics and review committee. The studies were conducted in accordance with the local legislation and institutional requirements. The participants provided their written informed consent to participate in this study. Author contributions SI: Data curation, Validation, Project administration, Conceptualization, Visualization, Methodology, Formal analysis, Writing – original draft, Writing – review & editing, Investigation. HD: Visualization, Writing – review & editing, Methodology, Supervision, Conceptualization. KM: Visualization, Writing – review & editing. BK: Formal analysis, Visualization, Writing – review & editing. SK: Writing – review & editing, Conceptualization, Supervision, Methodology, Visualization. DM: Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1 Cohan P Korenman SG Erectile dysfunction J Clin Endocrinol Metab 2001 86 2391–4 10.1210/jcem.86.6.7576 11397828 2 Perez I Moreno T Navarro F Santos J Palacios R Prevalence and factors associated with erectile dysfunction in a cohort of HIV-infected patients Int J STD AIDS 2013 24 712–5 10.1177/0956462413482423 23970586 3 Gomes TV Brites C Prevalence and risk factors for erectile dysfunction in HIV-infected patients in Salvador, Brazil Braz J Infect Dis 2019 23 464–7 10.1016/j.bjid.2019.08.006 31545951 PMC9428189 4 Faramarzia H Marzban M AminiLari M Shams M Hypogonadism and associated factors in patients with HIV infection based on total and free testosterone Shiraz E-Medical J 2014 15 1–7 10.17795/semj19734 5 Klein RS Lo Y Santoro N Dobs AS Androgen levels in older men who have or who are at risk of acquiring HIV infection Clin Infect Dis 2005 41 1794–803 10.1086/498311 16288406 PMC2426822 6 De Vincentis S Decaroli MC Fanelli F Diazzi C Mezzullo M Morini F Health status is related to testosterone, estrone and body fat: moving to functional hypogonadism in adult men with HIV Eur J Endocrinol 2021 184 107–22 10.1530/EJE-20-0855 33112262 7 Roberson DW Kosko DA Men living with HIV and experiencing sexual dysfunction: an analysis of treatment options J Assoc Nurses AIDS Care 2013 24 S135–S45 10.1016/j.jana.2012.08.010 23290373 8 Blick G Optimal diagnostic measures and thresholds for hypogonadism in men with HIV/AIDS: comparison between 2 transdermal testosterone replacement therapy gels Postgrad Med 2013 125 30–9 10.3810/pgm.2013.03.2639 23816769 9 Engelson ES Rabkin JG Rabkin R Kotler DP Effects of testosterone upon body composition JAIDS J Acquired Immune Def Syndromes 1996 11 510,1 10.1097/00042560-199604150-00012 8605597 10 Grinspoon SK Bilezikian JP HIV disease and the endocrine system N Engl J Med 1992 327 1360–5 10.1056/NEJM199211053271906 1406838 11 Rietschel P Corcoran C Stanley T Basgoz N Klibanski A Grinspoon S Prevalence of hypogonadism among men with weight loss related to human immunodeficiency virus infection who were receiving highly active antiretroviral therapy Clin Infect Dis 2000 31 1240–4 10.1086/317457 11073758 12 Staiman VR Lowe FC Urologic problems in patients with acquired immunodeficiency syndrome Sci World J 2004 4 427 10.1100/tsw.2004.84 15349565 PMC5956433 13 Amini Lari M Parsa N Marzban M Shams M Faramarzi H Depression, testosterone concentration, sexual dysfunction and methadone use among men with hypogonadism and HIV infection AIDS Behav 2012 16 2236–43 10.1007/s10461-012-0234-x 22722881 14 Hart TA Moskowitz D Cox C Li X Ostrow DG Stall RD The cumulative effects of medication use, drug use, and smoking on erectile dysfunction among men who have sex with men J Sex Med 2012 9 1106–13 10.1111/j.1743-6109.2011.02648.x 22321450 PMC3319271 15 Laudat A Blum L Guéchot J Picard O Cabane J Imbert JC Changes in systemic gonadal and adrenal steroids in asymptomatic human immunodeficiency virus-infected men: relationship with the CD4 cell counts Eur J Endocrinol 1995 133 418–24 10.1530/eje.0.1330418 7581964 16 Fumaz CR Ayestaran A Perez-Alvarez N Muñoz-Moreno JA Ferrer MJ Negredo E Clinical and emotional factors related to erectile dysfunction in HIV-infected men Am J Men’s Health 2017 11 647–53 10.1177/1557988316669041 27645512 PMC5675217 17 de Tubino Scanavino M Abdo CHN Sexual dysfunctions among people living with AIDS in Brazil Clinics 2010 65 511–9 10.1590/51807-593220010000500009 20535370 PMC2882546 18 Roozbeh N Rostami S Abdi F A review on herbal medicine with fertility and infertility characteristics in males Iranian J Obstetrics Gynecol Infertil 2016 19 18 32 10.22038/ijogi.2016.7278 19 Kimambo SJ 252 Acceptance of and adherence to anti-retroviral therapy in Tanzania: the influence of lipodystrophy and of traditional medicine JAIDS J Acquired Immune Def Syndromes 2009 51 10.1097/01.qai.0000351207.62305.78 20 Peltzer K Preez NF-D Ramlagan S Fomundam H Use of traditional complementary and alternative medicine for HIV patients in KwaZulu-Natal, South Africa BMC Public Health 2008 8 1 14 10.1186/1471-2458-8-255 18652666 PMC2503977 21 Ende AR Re VL III DiNubile MJ Mounzer K Erectile dysfunction in an urban HIV-positive population AIDS Patient Care STDs 2006 20 75–8 10.1089/apc.2006.20.75 16475887 22 Crum NF Furtek KJ Olson PE Amling CL Wallace MR A review of hypogonadism and erectile dysfunction among HIV-infected men during the pre-and post-HAART eras: diagnosis, pathogenesis, and management AIDS Patient Care STDs 2005 19 655–71 10.1089/apc.2005.19.655 16232050 23 De Vincentis S Decaroli M Diazzi C Morini F Bertani D Fanelli F Testosterone (T) is poorly related to sexual desire and Erectile Dysfunction (ED) in Young/Middle Aged Human immunodeficiency virus (HIV)-Infected Men Endocrine Abstracts Bioscientifica Ltd 24 Asboe D Catalan J Mandalia S Dedes N Florence E Schrooten W Sexual dysfunction in HIV-positive men is multi-factorial: a study of prevalence and associated factors AIDS Care 2007 19 955–65 10.1080/09540120701209847 17851990 25 Collazos J Martínez E Mayo J Ibarra S Sexual dysfunction in HIV-infected patients treated with highly active antiretroviral therapy JAIDS J Acquired Immune Def Syndromes 2002 31 322–6 10.1097/00126334-200211010-00008 12439208 26 Zhang H Dornadula G Beumont M Livornese L Van Uitert B Henning K Human immunodeficiency virus type 1 in the semen of men receiving highly active antiretroviral therapy N Engl J Med 1998 339 1803–9 10.1056/NEJM199812173392502 9854115 27 Cove J Petrak J Factors associated with sexual problems in HIV-positive gay men Int J STD AIDS 2004 15 732–6 10.1258/0956462042395221 15537458 28 Crum-Cianflone NF Bavaro M Hale B Amling C Truett A Brandt C Erectile dysfunction and hypogonadism among men with HIV AIDS Patient Care STDs 2007 21 9 19 10.1089/apc.2006.0071 17263654 29 Driemeier M de Andrade SMO Pontes ERJC Paniago AMM da Cunha RV Vulnerability to AIDS among the elderly in an urban center in central Brazil Clinics 2012 67 19 25 10.6061/clinics/2012(01)04 22249476 PMC3248596 30 Shindel AW Horberg MA Smith JF Breyer BN Sexual dysfunction, HIV, and AIDS in men who have sex with men AIDS Patient Care STDs 2011 25 341–9 10.1089/apc.2011.0059 21501095 PMC3101920 31 Catalan J Meadows J Sexual dysfunction in gay and bisexual men with HIV infection: evaluation, treatment and implications AIDS Care 2000 12 279–86 10.1080/09540120050042927 10928204 32 van Griensven F Thienkrua W Sukwicha W Wimonsate W Chaikummao S Varangrat A Sex frequency and sex planning among men who have sex with men in Bangkok, Thailand: implications for pre-and post-exposure prophylaxis against HIV infection J Int AIDS Soc 2010 13 13– 10.1186/1758-2652-13-13 20398261 PMC2873546 33 De Ryck I Van Laeken D Apers L Colebunders R Erectile dysfunction, testosterone deficiency, and risk of coronary heart disease in a cohort of men living with HIV in Belgium J Sex Med 2013 10 1816–22 10.1111/jsm.12175 23651241 34 Singh AS Masuku MB Sampling techniques & determination of sample size in applied statistics research: An overview Int J Econ Commerce Manage 2014 2 1 22 35 Adebimpe W Omobuwa O Adeoye O Prevalence and predictors of erectile dysfunctions among men on antiretroviral therapy in south−western Nigeria Ann Med Health Sci Res 2015 5 279–83 26229717 10.4103/2141-9248.160179 PMC4512121 36 Rosen RC Cappelleri J Smith M Lipsky J Pena B Development and evaluation of an abridged, 5-item version of the International Index of Erectile Function (IIEF-5) as a diagnostic tool for erectile dysfunction Int J Impot Res 1999 11 319 10.1038/sj.ijir.3900472 10637462 37 Cappelleri JC Rosen RC Smith MD Mishra A Osterloh IH Diagnostic evaluation of the erectile function domain of the International Index of Erectile Function Urology 1999 54 346–51 10.1016/S0090-4295(99)00099-0 10443736 38 Rosen RC Riley A Wagner G Osterloh IH Kirkpatrick J Mishra A The international index of erectile function (IIEF): a multidimensional scale for assessment of erectile dysfunction Urology 1997 49 822–30 10.1016/S0090-4295(97)00238-0 9187685 39 Rosen R Cappelleri J The sexual health inventory for men (IIEF-5): reply to Vroege Int J Impot Res 2000 12 342–3 10.1038/sj.ijir.3900615 11416839 40 Pallangyo P Nicholaus P Kisenge P Mayala H Swai N Janabi M A community-based study on prevalence and correlates of erectile dysfunction among Kinondoni District Residents, Dar Es Salaam, Tanzania Reprod Health 2016 13 140 10.1186/s12978-016-0249-2 27899129 PMC5129661 41 Rhoden E Telöken C Sogari P Souto CV The use of the simplified International Index of Erectile Function (IIEF-5) as a diagnostic tool to study the prevalence of erectile dysfunction Int J Impot Res 2002 14 245 10.1038/sj.ijir.3900859 12152112 42 Rochira V Zirilli L Orlando G Santi D Brigante G Diazzi C Premature decline of serum total testosterone in HIV-infected men in the HAART-era PLoS One 2011 6 e28512 10.1371/journal.pone.0028512 22174826 PMC3235128 43 Bajaj S Pathak Y Varma S Verma S Metabolic status and hypogonadism in human immunodeficiency virus-infected males Indian J Endocrinol Metab 2017 21 684 10.4103/ijem.IJEM_127_17 28989874 PMC5628536 44 Nyalile KB Mushi EH Moshi E Leyaro BJ Msuya SE Mbwambo O Prevalence and factors associated with erectile dysfunction among adult men in Moshi municipal, Tanzania: community-based study Basic Clin Androl 2020 30 1 7 10.1186/s12610-020-00118-0 33292186 PMC7709403 45 Mbwambo OJ Lyatuu M Ngocho G Abdallah K Godfrey P Ngowi BN The high burden of erectile dysfunction among men living with HIV in northern Tanzania: a call for evidence-based interventions Front Urol 2023 3 1238293 10.3389/fruro.2023.1238293 40778063 PMC12327309 46 Falade O Kofoworade AY Ojedokun SA Amoko A Alabi KM Odeigah LO Prevalence and pattern of erectile dysfunction among people living with HIV/AIDS in a tertiary hospital in north-central Nigeria Int J Trop Dis Health. 2023 44 9–16 10.9734/ijtdh/2023/v44i31391 47 Punjani N Nayan M Jarvi K Lo K Lau S Grober ED The effect of ethnicity on semen analysis and hormones in the infertile patient Can Urol Assoc J 2020 14 31 10.5489/cuaj.5897 31348744 PMC7012289 48 Hu H Odedina FT Reams RR Lissaker CT Xu X Racial differences in age-related variations of testosterone levels among US males: potential implications for prostate cancer and personalized medication J Racial Ethnic Health Disparities 2015 2 69 76 10.1007/s40615-014-0049-8 26863244 49 Richard A Rohrmann S Zhang L Eichholzer M Basaria S Selvin E Racial variation in sex steroid hormone concentration in black and white men: a meta-analysis Andrology 2014 2 428–35 10.1111/j.2047-2927.2014.00206.x 24648111 PMC4327897 50 Ahn J Schumacher FR Berndt SI Pfeiffer R Albanes D Andriole GL Quantitative trait loci predicting circulating sex steroid hormones in men from the NCI-Breast and Prostate Cancer Cohort Consortium (BPC3) Hum Mol Genet 2009 18 3749–57 10.1093/hmg/ddp302 19574343 PMC2742399 51 De Boer B Bots M Lycklama A Nijeholt A Moors J Pieters H Impact of various questionnaires on the prevalence of erectile dysfunction. The ENIGMA-study Int J Impot Res 2004 16 214–9 10.1038/sj.ijir.3901053 14973534 52 Enoma A Ching SM Hoo FK Omar SFS Prevalence and factors associated with erectile dysfunction in male patients with human immunodeficiency virus in a teaching hospital in West Malaysia Med J Malaysia 2017 72 186–9 10.5555/20183035810 28733567 53 Mazzilli F Erectile dysfunction: causes, diagnosis and treatment: an update MDPI; 2022 p 6429 10.3390/jcm11216429 36362656 PMC9657711 54 Nicolosi A Moreira ED Jr. Shirai M Tambi MIBM Glasser DB Epidemiology of erectile dysfunction in four countries: cross-national study of the prevalence and correlates of erectile dysfunction Urology 2003 61 201–6 10.1016/S0090-4295(02)02102-7 12559296 55 Gandaglia G Briganti A Jackson G Kloner RA Montorsi F Montorsi P A systematic review of the association between erectile dysfunction and cardiovascular disease Eur Urol 2014 65 968–78 10.1016/j.eururo.2013.08.023 24011423 56 Fedele D Coscelli C Santeusanio F Bortolotti A Chatenoud L Colli E Erectile dysfunction in diabetic subjects in Italy. Gruppo Italiano Studio Deficit Erettile nei Diabetici Diabetes Care 1998 21 1973–7 10.2337/diacare.21.11.1973 9802753 57 Rastrelli G Corona G Mannucci E Maggi M Vascular and chronological age in men with erectile dysfunction: a longitudinal study J Sex Med 2016 13 200–8 10.1016/j.jsxm.2015.11.014 26953832 58 Mark R Huri HZ Razack AHA Demographic, clinical and lifestyle predictors for severity of erectile dysfunction and biomarkers level in Malaysian patients Braz J Pharm Sci 2018 54 e17552 10.1590/s2175-97902018000317552 59 Gareri P Castagna A Francomano D Cerminara G De Fazio P Erectile dysfunction in the elderly: an old widespread issue with novel treatment perspectives Int J Endocrinol 2014 2014 878670 10.1155/2014/878670 24744785 PMC3976909 60 Guaraldi G Luzi K Murri R Granata A Paola MD Orlando G Sexual dysfunction in HIV-infected men: role of antiretroviral therapy, hypogonadism and lipodystrophy Antiviral Ther 2007 12 1059–66 10.1177/135965350701200713 18018764 61 Schrooten W Colebunders R Youle M Molenberghs G Dedes N Koitz G Sexual dysfunction associated with protease inhibitor containing highly active antiretroviral treatment Aids 2001 15 1019–23 11399984 10.1097/00002030-200105250-00010 62 Rezali MS Mohamad Anuar MF Abd Razak MA Chong ZL Shaharudin AB Kassim MSA Prevalence and associated factors of moderate to severe erectile dysfunction among adult men in Malaysia Sci Rep 2023 13 21483 10.1038/s41598-023-48778-y 38057375 PMC10700487 63 Calzo JP Austin SB Charlton BM Missmer SA Kathrins M Gaskins AJ Erectile dysfunction in a sample of sexually active young adult men from a US cohort: demographic, metabolic and mental health correlates J Urol 2021 205 539–44 10.1097/JU.0000000000001367 32935616 PMC7790854 64 Chew K-K Stuckey B Bremner A Earle C Jamrozik K Male erectile dysfunction: Its prevalence in Western Australia and associated sociodemographic factors J Sex Med 2008 5 60–9 10.1111/j.1743-6109.2007.00548.x 17645447 65 Pellón-Elexpuru I Van Dijk R van der Valk I Martínez-Pampliega A Molleda A Cormenzana S Divorce and physical health: A three-level meta-analysis Soc Sci Med 2024 352 117005 10.1016/j.socscimed.2024.117005 38824838 66 Kongkanand A Group TEDES Prevalence of erectile dysfunction in Thailand Int J Androl 2000 23 77 80 10.1046/j.1365-2605.2000.00022.x 10849502 67 Iddi S Dika H Kidenya B Kalluvya S Prevalence of hypogonadism and associated risk factors among newly diagnosed ART naïve HIV-infected males in mwanza, Tanzania Int J Endocrinol 2024 2024 9679935 10.1155/2024/9679935 38476640 PMC10932624 68 Rochira V Diazzi C Santi D Brigante G Ansaloni A Decaroli MC Low testosterone is associated with poor health status in men with human immunodeficiency virus infection: a retrospective study Andrology 2015 3 298 308 10.1111/andr.310 25704864 69 Swindells S Cobos DG Lee N Lien EA Fitzgerald AP Pauls JS Racial/ethnic differences in CD4 T cell count and viral load at presentation for medical care and in follow-up after HIV-1 infection AIDS 2002 16 1832–4 10.1097/00002030-200209060-00020 12218399 70 Achhra AC Amin J Race and CD4+ T-cell count in HIV prognosis and treatment Future Virol 2012 7 193 203 10.2217/fvl.11.143 71 Avendano EE Blackmon SA Nirmala N Chan CW Morin RA Balaji S Race, ethnicity and risk for colonisation and infection with key bacterial pathogens: a scoping review BMJ Global Health 2025 10 1–13 10.1136/bmjgh-2024-017404 40780833 PMC12336480 72 Nadimpalli ML Chan CW Doron S Jacque B Bascom-Slack C 17157 Racial/ethnic disparities in antibiotic-resistant infections: Knowledge gaps and opportunities for educational interventions J Clin Trans Sci 2021 5 77 10.1017/cts.2021.601 34374701 PMC8327542 73 Scanavino MDT Sexual dysfunctions of HIV-positive men: associated factors, pathophysiology issues, and clinical management Adv Urol 2011 2011 854792 10.1155/2011/854792 22046183 PMC3199204 74 De Vincentis S Tartaro G Rochira V Santi D HIV and sexual dysfunction in men J Clin Med 2021 10 1088 10.3390/jcm10051088 33807833 PMC7961513 75 Monroe AK Dobs AS Palella FJ Kingsley LA Witt MD Brown TT Morning free and total testosterone in HIV-infected men: implications for the assessment of hypogonadism AIDS Res Ther 2014 11 1 5 10.1186/1742-6405-11-6 24450960 PMC3900935 76 Cavallini G Resolution of erectile dysfunction after an andrological visit in a selected population of patients affected by psychogenic erectile dysfunction Asian J Androl 2017 19 219–22 10.4103/1008-682X.172646 26806083 PMC5312222 77 Kellesarian SV Kellesarian TV Ros Malignaggi V Al-Askar M Ghanem A Malmstrom H Association between periodontal disease and erectile dysfunction: a systematic review Am J Men’s Health 2018 12 338–46 10.1177/1557988316639050 27030114 PMC5818109 78 De Vincentis S Decaroli MC Fanelli F Diazzi C Mezzullo M Tartaro G Primary, secondary and compensated male biochemical hypogonadism in people living with HIV (PLWH): relevance of sex hormone-binding globulin (SHBG) measurement and comparison between liquid chromatography-tandem mass spectrometry (LC-MS/MS) and chemiluminescent immunoassay for sex steroids assay Aging Male 2022 25 41 53 10.1080/13685538.2022.2039116 35318882 79 Moreno-Pérez O Escoín C Serna-Candel C Portilla J Boix V Alfayate R The determination of total testosterone and free testosterone (RIA) are not applicable to the evaluation of gonadal function in HIV-infected males J Sex Med 2010 7 2873–83 10.1111/j.1743-6109.2010.01886.x 20626606 ",
  "metadata": {
    "Title of this paper": "The determination of total testosterone and free testosterone (RIA) are not applicable to the evaluation of gonadal function in HIV-infected males",
    "Journal it was published in:": "Frontiers in Urology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479309/"
  }
}