{
  "title": "Paper_273",
  "abstract": "pmc BMC Cancer BMC Cancer 16 bmccanc BMC Cancer 1471-2407 BMC PMC12487258 PMC12487258.1 12487258 12487258 41034794 10.1186/s12885-025-14908-0 14908 1 Research Combined anti-tumor effects of metformin and azacitidine in breast cancer cells Hosseini Setayesh Sadat http://orcid.org/0000-0002-9462-1144 Askari Nahid nahidaskari@gmail.com Yaghoobi Mohammad Mehdi https://ror.org/0451xdy64 grid.448905.4 0000 0004 4910 146X Department of Biotechnology, Institute of Science and High Technology and Environmental Sciences, Graduate University of Advanced Technology, 1 10 2025 2025 25 478185 1487 26 6 2025 21 8 2025 01 10 2025 02 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Breast cancer is the most common cancer in women. While treatments exist, combination therapies may enhance effectiveness and reduce drug resistance. Metformin-a common diabetes medication has shown promising anticancer properties. Azacitidine, primarily an epigenetic regulator, also exhibits anticancer effects. Methods and materials The GSE45827 CCND1 ELAVL1 EIF4EBP1 Results Bioinformatics analysis identified CCND1 ELAVL1 EIF4EBP1 Conclusion The metformin-azacitidine combination synergistically suppresses breast cancer cell proliferation, likely through coordinated modulation of CCND1 ELAVL1 EIF4EBP1 Keywords Breast cancer Metformin Azacitidine Bioinformatic Gene expression pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Breast cancer is the most common cancer in women. Its development involves environmental, genetic, and epigenetic factors that drive tumor growth. Epigenetic changes allow cancer cells to adapt [ 1 2 3 In silico studies are powerful tools for examining large-scale genomic and proteomic data. These methods provide comprehensive and important information about the unknown mechanisms of breast cancer and accelerate the discovery of therapeutic targets and predictive biomarkers. However, predictions from these studies require in vitro experimental validation to prove accuracy and efficacy [ 4 5 Cell lines are essential biomedical research tools enabling study of cellular processes, disease mechanisms, drug responses, and genetic and molecular pathways. Among the cell lines used in breast cancer research, MDA-MB-231 is recognized as one of the most widely used models for studying triple-negative breast cancer (TNBC). This aggressive subgroup of breast cancer characterized by lack of progesterone, estrogen, and HER2 receptors. Additionally, this cell line demonstrates a high level of epithelial-mesenchymal transition (EMT), conferring enhanced metastatic potential [ 6 One of the main challenges in oncologyis discovering new and effective therapeutic compounds that can reduce drug side effects and overcome treatment resistance. The use of multi-drug compounds and dual-action inhibitors represent a promising strategy against therapy-resistant malignancies [ 7 In this study, two drugs, azacitidine and metformin, have been examined. Azacitidine -an FDA-approved DNA methyltransferase inhibitor for myelodysplastic syndromes, with emerging evidence in solid tumors. Metformin, a biguanide-type antidiabetic drug, is recognized as the first-line medication in the management of type II diabetes and has recently garnered attention due to its potential anticancer properties. Additionally, doxorubicin, an anticancer drug from the anthracycline class, is widely used in the treatment of various cancers. This drug inhibits the enzyme topoisomerase II, causing breaks in the DNA of cancer cells and preventing their proliferation [ 8 10 This study aims to characterize the synergistic effects of the azacitidine-metformin combination and to develop a mechanistic framework for epigenetic-metabolic combination therapy in triple-negative breast cancer. Method and materials Bioinformatics analysis The dataset used The GSE45827 https://www.ncbi.nlm.nih.gov/geo/ Identification of DEGs The data of this dataset were analyzed using the GEO2R tool in the GEO section. The obtained DEGs were adjusted based on log2FC, and p Functional enrichment analysis of differentially expressed genes Gene ontology and DEG enrichment pathways were analyzed using ShinyGO ( http://bioinformatics.sdstate.edu/go/ Protein-protein interaction (PPI) network analysis STITCH ( http://stitch.embl.de/ 11 12 Expression analysis of highly interacting genes in the network To examine the activity of genes in tissues and cells of the human body, the GTEx Portal database at https://gtexportal.org/ https://tnmplot.com/analysis/ 13 Patient survival analysis The Kaplan-Meier plotter database at https://kmplot.com/ Drugs targets Using the database https://www.way2drug.com/passonline/ 14 15 Cell culture The MDA-MB-231 cell line, which was obtained from Tehran Pasteur Cell Bank, was cultured in DMEM medium (Manufactured by Gibco USA) supplemented with 10% fetal bovine serum (Gibco, USA), 100 µg/ml amphotericin B (CIPLA LTD, India), penicillin (Jaber Ebne Hayyan Pharmaceutical, Iran), and streptomycin (Nitin life science, India). They were maintained in an incubator with 5% CO2 at 36.5 °C. The medium inside the flask was changed every 72 h. MTT assays MTT assays used to measure cell viability and calculate IC50 values. Cells were seeded in 96-well plates (10,000 cells/well) and treated with metformin (10,20, 40, and 80 µM) or azacitidine (1020, 40, 80, and 160 µM) for 48 h, with a mid-treatment refresh. Doxorubicin (EBEWE, Austria) in concentration of 2 mg/ml, served as positive control. After MTT incubation and DMSO solubilization, absorbance was measured at 570/630 nm to determine IC50 values using the ED50plus Excel add-in. Each treatment consisted of 3 replicates. Isobologram test In the first step, 10,000 isolated cells were seeded in 100 µL of culture medium per well. After 24 h of incubation, each well was washed with Phosphate-buffered saline (PBS) (Sigma, USA) and different concentrations of 70, 140, and 280 µM metformin in combination with a fixed concentration of 150 µM azacitidine and varying concentrations of 70, 140, and 280 µM azacitidine in combination with a fixed concentration of 140 µM metformin were prepared in a final volume of 150 µL and incubated for 24 h. Also, to examine and compare the effects of the drugs, the control drug doxorubicin was used to treat the cells. After 24 h of incubation, the drugs were recharged (except doxorubicin) and the plate was incubated for another 24 h. In the final step, the isobologram test was performed according to the method mentioned for MTT, and the color value of each well was read with an ELISA reader at wavelengths of 570 and 630 nm. Each treatment consisted of 3 replicates. Wound healing test This test can simulate the cellular migration in the body using cell-cell connections to heal the wound. Initially, 100,000 cells were added to each well of a 24-well plate using TRED and symmetrically spread. After 24 h of incubation and observing a cell density of about 80%, a direct scratch was made in each well’s middle using the yellow pipette’s tip. Next, the fresh culture medium with selected concentrations of each drug (155.52 µM and 141.34 µM for metformin and azacitidine, respectively) and their combination were treated with the cells. Photos were taken of the wound area at 0, 24, and 48 h of incubation. Finally, the image analysis was performed using the ImageJ software (wound healing plugin), and the statistical analysis was performed using Prism software (version 8.0). Data were analyzed using two-way ANOVA, followed by Tukey’s post hoc tests for comprehensive comparison of means in all possible pairs of experimental groups. Gene expression analysis using Real-time PCR Specific primers ( CCND1 EIF4EBP1 ELAVL1 GAPDH p 1 p Table 1 Sequences of primers used in the Real-Time PCR reaction Products TM Sequences Accession number Genes 149 bp 40.4 (F) GAGTCAACGGATTTGGTCG NM_0012 GAPDH 41.2 (R) GAATTTGCCATGGGTGGA 197 bp 35.8 (F) CGCTTTGTCTGTCGTGAT NM_053056.3 CCND1 39.3 (R) TACATGTTGGTGCTGGGAA 128 bp 46.3 (F) AGCCCTTCCAGTGATGAGCC NM_004095.4 EIF4EBP1 43.9 (R) ACACGATGGCTGGTGCTTTA 146 bp 43.8 (F) TAAGGTGTCGTATGCTCGCC NM_001419.3 ELAVL1 46.9 (R) CGGATAAACGCAACCCCTCT Results Identification of DEGs After analyzing the GSE45827 2 Table 2 From the dataset, 173 DEGs were obtained and validated Expression change Genes name Up regulate PIGR ADIPOQ SFRP1 C2orf40 FABP4 SCARA5 RBP4 KRT14 LEP ADH1B GABRP IRX1 NTRK2 ACACB PLIN1 CHRDL1 SH3GL3 MYBPC1 CD36 ABCA8 LPL PLIN4 FRG1BP DST TGFBR3 GALNT16 SCGB3A1 RBP7 GPD1 CFD OXTR CD300LG SOX10 SYNM HOXA5 WIF1 COL6A6 BTNL9 ITIH5 TIMP4 CIDEC TF KRT5 ELF5 S100B FMO2 KRT15 PI15 PTN CRYAB KLHL13 ADAMTS5 ATP1A2 PLAC9 PCOLCE2 FAM189A2 SCN4B PPP1R14A SDPR MYH11 SEMA3G G0S2 MAOA CCL28 RELN IGF1 ZBTB16 TUSC5 IL17RD SORBS1 LRRN4CL FXYD1 OGN ZNF595 ACKR1 KIT ID4 AKR1C1 DMD GPIHBP1 CA4 TP63 THRSP ELAVL1 Down regulate RRM2 VCAN TOP2A CXCL10 CEACAM6 TPD52 KIAA0101 MMP11 GPRC5A COL12A1 INHBA HSP90AB1 ESRP1 EZR P4HB PRC1 TOB1 SULF1 UBE2C S100A8 NUSAP1 UBE2T VMP1 ENO1 GRB7 HACD3 MALAT1 FUS EIF5A SMC4 ATAD2 TPX2 CCNB1 ASPM YWHAZ CDK1 ALYREF PLAU CXCR4 PNP ZWINT MMP1 CDKN3 TMED2 SLC52A2 COMP GJB2 LAPTM4B PLEKHF2 CDC20 GALNT7 BIRC5 STIP1 FOXA1 CENPF GPR160 TMEM165 UBXN4 POSTN SRSF1 CENPU CD46 H2BFS SPAG5 SQLE ATP6V1A CCNB2 ANP32E ANLN UBE2N PRR11 SEC61A1 IL13RA1 MIEN1 KIF2C GDE1 BHLHE40 CKS2 WISP1 FAM83D MAD2L1 KMO RANBP9 ECT2 DTL OAS1 EZH2 EIF4EBP1 CCND1T These genes include 84 genes with increased expression and 89 genes with decreased expression in tumor tissue compared to normal tissue Functional enrichment analysis of DEGs To investigate the biological and molecular functions of 173 DEGs, an ontology analysis of these genes was performed in the ShinyGO database. The results indicated that most of these genes are involved in the regulation of biological quality, multicellular organismal process, developmental process, and Cell Cycle (Table 3 Table 3 Table of biological functions of the mentioned DEGs classified based on enrichment FDR Pathways nGenes Pathway genes Enrichment FDR Positive reg. of cell cycle proc. 16 274 9.6E-08 Positive reg. of cell cycle 19 378 3.9E-08 Mitotic cell cycle phase transition 19 476 5.1E-07 Cell division 27 689 3.0E-09 Nuclear division 19 514 1.4E-06 Reg. of mitotic cell cycle 19 534 2.5E-06 Cell cycle phase transition 21 598 5.8E-07 Mitotic cell cycle proc. 27 825 3.9E-08 Reg. of cell cycle proc. 25 781 1.8E-07 Positive reg. of cell differentiation 27 933 2.3E-07 Reg. of cell cycle 35 1213 3.0E-09 Mitotic cell cycle 28 996 2.2E-07 Cell cycle proc. 34 1321 5.0E-08 Positive reg. of developmental proc. 36 1424 3.9E-08 Reg. of cell differentiation 37 1700 3.0E-07 Reg. of cell population proliferation 38 1835 5.8E-07 Cell cycle 39 1937 6.8E-07 Reg. of developmental proc. 49 2680 1.8E-07 Reg. of multicellular organismal proc. 53 3024 1.4E-07 Reg. of biological quality 63 4103 2.2E-07 Protein-protein interaction (PPI) network analysis Using the STITCH database, a network of DEG173 interactions was drawn, which is fully shown in Fig. 1 Fig. 1 Research graphical abstract PPI analysis of these DEGs was then performed in Cytoscape, and the network, which includes nodes and interactions, can be seen in Fig. 2 3 Fig. 2 The connection network between DEGs representing different gene clusters is constructed by the STITCH database Fig. 3 Protein-protein interaction network of DEG96 was plotted using Cytoscape software. Key gene clusters were identified using the MCODE plugin and scored 5 or higher Analysis of the expression of genes with high interaction in the network First, the expression of 49 genes with high interaction in the core network was examined in the GTEx Portal database and a heat map of their expression in healthy human tissues was drawn (Fig. 4 Fig. 4 This cluster network of 49 genes was separated from the main network by Cytoscape software. These genes significantly interacted with each other and had a P Then, 22 genes with the highest expression in breast tissue were selected and entered into the shynigo site, and their signaling pathways were examined. Most of these genes were involved in the AMPK, PI3K-Akt signaling pathways, and cancer-related pathways (Table 4 Table 4 Enrichment analysis of KEGG pathways related to identified DEGs Pathways nGenes Pathway genes Enrichment FDR AMPK signaling pathway 8 121 2.6E-11 Adipocytokine signaling pathway 4 69 2.5E-05 PPAR signaling pathway 4 75 2.7E-05 Acute myeloid leukemia 3 67 4.4E-04 Prostate cancer 4 97 5.0E-05 Pancreatic cancer 3 76 5.4E-04 Cell cycle 4 126 1.2E-04 Chemical carcinogenesis-receptor activation 5 197 3.1E-05 PI3K-Akt signaling pathway 7 354 2.3E-06 Pathways in cancer 6 530 1.6E-04 In the next step, 8 genes involved in AMPK were isolated. For this reason, we chose this pathway because the genes in this pathway have the lowest P CCND1 ELAVL1 HuR 4EBP1 EIF4EBP1 5 Fig. 5 Expression of genes with high interactions in the main network in different cells and tissues obtained from the GTEx Portal database Then, the names of the hub genes were entered into the TNM PLOT database, and their expression difference graph and p 6 5 Fig. 6 The AMPK signaling pathway is activated by metformin, which subsequently turns on the relevant genes and triggers other pathways Table 5 Comparison table of hub gene expression in 3 states: healthy, non-metastatic, and metastatic tumors Gene name Normal-tumor Normal- metastatic Tumor- metastatic CCND1 7.28e-07 6.76e-02 1.33e-01 ELAVL1 7.55e-31 6.64e-31 3.16e-09 EIF4EBP1 5.31e-25 9.00e-15 2.67e-03 Their significance is written as a P Patients survival Patient survival rates using the Kaplan-Meier plotter database indicate that aberrant expression of these genes is associated with reduced survival in breast cancer patients (Fig. 7 Fig. 7 Expression diagram of CCND1 ELAVL1 EIF4EBP1 Finding drugs targets The results from the Way2drug database are listed in Table 6 Table 6 Possible targets of metformin and azacitidine drugs that bind to these molecules with the listed binding probabilities inside cells Drug name Target name Confidence Metformin Protein-arginine deiminase inhibitor 0.939 CDP-glycerol glycerophosphotransferase inhibitor 0.898 NADPH peroxidase inhibitor 0.847 Azacitidine TP53 expression enhancer 0.971 CDP-glycerol glycerophosphotransferase inhibitor 0.950 Nucleoside oxidase (H2O2-forming) inhibitor 0.947 MTT test MTT test results After 48 h, the absorbance was read by an ELISA reader at wavelengths of 570 and 630 nm, and the results obtained are shown in Fig. 8 Fig. 8 Kaplan-Meier plots show the difference in patient survival when there is a change in gene expression due to mutation. Figure ( A CCND1 B ELAVL1 HUR C EIF4EBP1 D Control group showed 100% viability, establishing a baseline. In the metformin-treated groups, cell viability at the 10 µM dose was 92.71%, only slightly lower than in the control group. At the 20, 40, and 80 µM dose levels, viability decreased to 76%, 83.35%, and 74.48%, respectively. This decrease was approximately dose-dependent, indicating a cytotoxic effect of metformin at high concentrations. Azacitidine also appeared to exert a similar dose-dependent decrease in the viability of the treated groups. The 10 µM dose showed 89.61% viability, thus presenting a well-tolerated dose. However, with increasing azacitidine concentrations to 20, 40, and 80 µM, the viability decreased to (70.61%, 74.23%, and 72.56%), respectively, indicating that high concentrations of azacitidine reduced cell survival. The doxorubicin-treated group was a positive control. This group resulted in a survival of 84.21%, as it is a well-known standard chemotherapeutic agent with well-known cytotoxic properties. The IC50 of each drug was then calculated with the ED50 plus add-in version 0.1 in Excel software. This value was approximately 155.52 µM for metformin and 141.34 µM for azacitidine. Isobologram test Similar to the MTT test, the results obtained from the recovery of formazan crystals after 48 h were obtained by reading the absorbance using an ELISA reader, as shown in Fig. 9 Fig. 9 MTT assay results in MDA-MB-231 cells show metformin and azacitidine lethality. Error bars represent standard deviation The drug combination plot showed decreased cell survival in this cell line. The control group (without drug treatment) showed 100% survival, as expected. The combination of metformin and azacitidine had cytotoxic effects and showed different degrees of cell survival at different concentrations. A fixed concentration of 280 µM of metformin with a variable concentration of 150 µM of azacitidine had the highest lethality, which was higher than the positive control drug doxorubicin. Wound healing test After the cells were plated in 24-well plates and reached a cell density of approximately 80%, a scratch was created. Then, images were taken of the control and treated groups at 0, 24, and 48 h. The resulting images were analyzed using ImageJ software and the Wound Healing Analyzer plugin. Images allow visual assessment of drug effects on MDA-MB-231 cell migration and scratch closure, aiding understanding of their mechanism and migration inhibition potential. The results presented in Figs. 10 11 Fig. 10 Results of the isobologram experiment in MDA-MB-231 cells showing the survival gradient at different drug concentrations. Error bars represent standard deviation Fig. 11 Results from the wound healing test show a reduction in the rate of invasion in the combined concentration treatments of the two drugs and azacitidine alone Gene expression analysis by real-time PCR EIF4EBP1 ELAVL CCND1 GAPDH 12 CCND1 EIF4EBP1 CCND1 Fig. 12 Comparison of cell migration rates in the MDA-MB-231 cell line in the control group (without treatment) and groups treated with doxorubicin (positive control), metformin, azacitidine, and the combination of metformin and azacitidine. Images were recorded at 0, 24, and 48 h after scratch creation and show the effect of each drug on the speed of scratch healing compared to the control group. The magnification for each image is 100x Another gene whose expression was measured was ELAVL1 Results were analyzed in Prism using ANOVA, with significance determined by stars (Fig. 13 Fig. 13 Expression graph of CCND1 EIF4EBP1 ELAVL1 HUR CCND1 EIF4EBP1 ELVAL1 Discussion Metformin and azacitidine individually show antiproliferative effects on cancer cells [ 16 17 he MTT assay results showed that both drugs generally exhibited a dose-dependent effect, although a notable deviation was observed in the metformin group, where cell viability at the 40 µM concentration (83.35%) was slightly higher than at 20 µM (76.00%). We hypothesize that this phenomenon could be due to a transient adaptive response (hormesis), in which the cells temporarily activate defensive mechanisms against the drug. This hypothesis is consistent with our results at the 80 µM concentration, where dose-dependent cytotoxicity is re-observed [ 18 19 Isobologram analysis showed that these two drugs have potential synergistic effects at specific concentrations, especially where a greater reduction in cell viability than the expected additive effect was observed. in wound healing test, azacitidine significantly reduced cell migration and altered cell morphology. At 24 and 48 h, the scratch width was greater than at time 0. This suggests that azacitidine likely reduces cell migration by affecting extracellular matrix and matrix metalloproteinases, which are essential for cell attachment and movement [ 20 21 Expression results of CCND1 EIF4EBP1 ELAVL1 CCND1 CCND1 22 CCND1 All three drug treatments reduced EIF4EBP1 23 EIF4EBP1 24 25 EIF4EBP1 Metformin-treated cells expressed very little of the ELAVL1 26 ELAVL1 27 In molecular terms, the synergistic effect observed between metformin and azacitidine is likely due to the convergence of two complementary mechanisms: Metformin inhibits mitochondrial Complex I, raising the AMP/ATP ratio and activating AMPK, which in turn suppresses the mTOR pathway resulting in reduced protein synthesis, cell cycle arrest, and downregulation of CCND1 EIF4EBP1 28 29 Azacitidine, as a DNMT inhibitor, becomes incorporated into DNA and RNA, forming covalent adducts with DNMTs that lead to their degradation and global hypomethylation—reactivating tumor suppressor genes. Additionally, its incorporation into RNA disrupts protein synthesis, likely contributing to decreased EIF4EBP1 ELAVL1 30 The combined action targeting mTOR/protein synthesis and epigenetic regulation thus produces a more pronounced inhibitory effect on cell survival, migration, and oncogene expression. The interplay between metabolic (AMPK/mTOR) and epigenetic pathways enhances the overall anticancer response, although further mechanistic studies are warranted to confirm these interactions [ 31 32 To strengthen the innovative value of our metformin-azacitidine combination, it is helpful to compare it with other metformin-based epigenetic regimens. In osteosarcoma cell models, metformin synergistically enhanced the antitumor activity of the HDAC inhibitor trichostatin A, leading to decreased viability and G1/G2 cell-cycle arrest an effect that was independent of AMPK activation [ 33 34 35 From a clinical perspective, the combination of metformin and azacitidine has significant potential. Metformin is safe and well tolerated, and in some clinical studies has improved pathological response in advanced cancer. Azacitidine, which is also used in the treatment of leukemia, has shown efficacy and acceptable toxicity in combination with anticancer drugs in solid tumors [ 36 We applied a pooled differential expression analysis to gain an initial overview due to limited access to additional cell lines and resources, although this may obscure subtype-specific patterns, which we now acknowledge as a limitation and recommend future stratified analyses. Next steps include dose-finding studies in animal models and phase I/II clinical designs in patients with advanced breast cancer. Selection of molecular markers (such as mTOR activity, hypermethylation pattern, or expression of mentioned genes) and dynamic pharmacological markers such as AMPK activation can help in further targeting and greater effectiveness [ 37 Conclusion This study demonstrated both metformin and azacitidine individually exhibited significant antiproliferative effects on MDA-MB-231 cells, reducing cell survival dose-dependently. Potential synergistic effects were observed, particularly reducing expression of key genes involved in cancer progression, suggesting this combination could be a more effective therapeutic strategy. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements This research was supported by the Graduate University of Advanced Technology, Kerman, Iran. Author contributions MM.Y contributed to design and implementation of the research; SS.H and N.A participated in the collection of data and contributed substantially to the drafting, writing and revising of the manuscript; all authors have approved the final version of the manuscript. Funding This study was not funded by any specific grants from public, commercial, or non-profit funding organizations. Data availability All data essential to replicate this study are included in this article and its supplementary material. Additional raw data are available from the corresponding author upon request. Declarations Ethics approval and consent to participate Not applicable. Consent for publication Not applicable. Competing interests The authors declare no competing interests. Abbreviations DEGs Differentially expressed genes PPI Protein-protein interaction TNBC Triple-negative breast cancer EMT Epithelial-mesenchymal transition DMEM Dulbecco's modified eagle medium PBS Phosphate-buffered saline DMSO Dimethyl sulfoxide References 1. Hanahan D Weinberg RA Hallmarks of cancer: the next generation Cell 2011 144 5 646 74 10.1016/j.cell.2011.02.013 21376230 Hanahan D, Weinberg RA. Hallmarks of cancer: the next generation. Cell. 2011;144(5):646–74. 21376230 10.1016/j.cell.2011.02.013 2. Sung H Ferlay J Siegel RL Laversanne M Soerjomataram I Jemal A Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2021 71 3 209 49 33538338 10.3322/caac.21660 Sung H, Ferlay J, Siegel RL, Laversanne M, Soerjomataram I, Jemal A, et al. Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. CA Cancer J Clin. 2021;71(3):209–49. 33538338 10.3322/caac.21660 3. Jasim HS The role of epigenetic drugs in cancer therapy South Asian Res J Med Sci 2022 4 4 54 62 10.36346/sarjms.2022.v04i04.001 Jasim HS. The role of epigenetic drugs in cancer therapy. South Asian Res J Med Sci. 2022;4(4):54–62. 4. Dakal TC, Dhakar R, Beura A, Moar K, Maurya PK, Sharma NK, et al. Emerging methods and techniques for cancer biomarker discovery. Pathol-Res Pract. 2024;262:155567. 10.1016/j.prp.2024.155567 39232287 5. Das S Dey MK Devireddy R Gartia MR Biomarkers in cancer detection, diagnosis, and prognosis Sensors 2023 24 1 37 10.3390/s24010037 38202898 PMC10780704 Das S, Dey MK, Devireddy R, Gartia MR. Biomarkers in cancer detection, diagnosis, and prognosis. Sensors. 2023;24(1):37. 38202898 10.3390/s24010037 PMC10780704 6. Amaro A Angelini G Mirisola V Esposito AI Reverberi D Matis S A highly invasive subpopulation of MDA-MB-231 breast cancer cells shows accelerated growth, differential chemoresistance, features of apocrine tumors and reduced tumorigenicity in vivo Oncotarget 2016 7 42 68803 10.18632/oncotarget.11931 27626697 PMC5356591 Amaro A, Angelini G, Mirisola V, Esposito AI, Reverberi D, Matis S, et al. A highly invasive subpopulation of MDA-MB-231 breast cancer cells shows accelerated growth, differential chemoresistance, features of apocrine tumors and reduced tumorigenicity in vivo. Oncotarget. 2016;7(42):68803. 27626697 10.18632/oncotarget.11931 PMC5356591 7. Victoir B Croix C Gouilleux F Prié G Targeted therapeutic strategies for the treatment of cancer Cancers (Basel) 2024 16 2 461 10.3390/cancers16020461 38275901 PMC10814619 Victoir B, Croix C, Gouilleux F, Prié G. Targeted therapeutic strategies for the treatment of cancer. Cancers (Basel). 2024;16(2):461. 38275901 10.3390/cancers16020461 PMC10814619 8. Bohl SR Bullinger L Rücker FG Epigenetic therapy: Azacytidine and decitabine in acute myeloid leukemia Expert Rev Hematol 2018 11 5 361 71 10.1080/17474086.2018.1453802 29543073 Bohl SR, Bullinger L, Rücker FG. Epigenetic therapy: Azacytidine and decitabine in acute myeloid leukemia. Expert Rev Hematol. 2018;11(5):361–71. 29543073 10.1080/17474086.2018.1453802 9. Nicoletto RE Ofner CM III Cytotoxic mechanisms of doxorubicin at clinically relevant concentrations in breast cancer cells Cancer Chemother Pharmacol 2022 89 3 285 311 10.1007/s00280-022-04400-y 35150291 Nicoletto RE, Ofner CM III. Cytotoxic mechanisms of doxorubicin at clinically relevant concentrations in breast cancer cells. Cancer Chemother Pharmacol. 2022;89(3):285–311. 35150291 10.1007/s00280-022-04400-y 10. Zarei E Sefidi-Heris Y Saadat I Synergistic effects of Metformin and Curcumin on cytotoxicity of chemotherapy drugs using a gastric cancer cell line model EXCLI J 2021 20 1488 34924899 10.17179/excli2021-4091 PMC8678059 Zarei E, Sefidi-Heris Y, Saadat I. Synergistic effects of Metformin and Curcumin on cytotoxicity of chemotherapy drugs using a gastric cancer cell line model. EXCLI J. 2021;20:1488. 34924899 10.17179/excli2021-4091 PMC8678059 11. Deng J-L Xu Y-h Wang G Identification of potential crucial genes and key pathways in breast cancer using bioinformatic analysis Front Genet 2019 10 695 10.3389/fgene.2019.00695 31428132 PMC6688090 Deng J-L, Xu Y-h, Wang G. Identification of potential crucial genes and key pathways in breast cancer using bioinformatic analysis. Front Genet. 2019;10:695. 31428132 10.3389/fgene.2019.00695 PMC6688090 12. Szklarczyk D Santos A von Mering C Jensen LJ Bork P Kuhn M STITCH 5: augmenting protein-chemical interaction networks with tissue and affinity data Nucleic Acids Res 2016 44 D1 D380 4 10.1093/nar/gkv1277 26590256 PMC4702904 Szklarczyk D, Santos A, von Mering C, Jensen LJ, Bork P, Kuhn M. STITCH 5: augmenting protein-chemical interaction networks with tissue and affinity data. Nucleic Acids Res. 2016;44(D1):D380–4. 26590256 10.1093/nar/gkv1277 PMC4702904 13. Bartha Á Győrffy B TNMplot. com: a web tool for the comparison of gene expression in normal, tumor and metastatic tissues Int J Mol Sci 2021 22 5 2622 10.3390/ijms22052622 33807717 PMC7961455 Bartha Á, Győrffy B. TNMplot. com: a web tool for the comparison of gene expression in normal, tumor and metastatic tissues. Int J Mol Sci. 2021;22(5):2622. 33807717 10.3390/ijms22052622 PMC7961455 14. Daina A Michielin O Zoete V SwissTargetPrediction: updated data and new features for efficient prediction of protein targets of small molecules Nucleic Acids Res 2019 47 W1 W357 64 10.1093/nar/gkz382 31106366 PMC6602486 Daina A, Michielin O, Zoete V. SwissTargetPrediction: updated data and new features for efficient prediction of protein targets of small molecules. Nucleic Acids Res. 2019;47(W1):W357–64. 31106366 10.1093/nar/gkz382 PMC6602486 15. Filimonov D Lagunin A Gloriozova T Rudik A Druzhilovskii D Pogodin P Prediction of the biological activity spectra of organic compounds using the PASS online web resource Chem Heterocycl Compd 2014 50 444 57 10.1007/s10593-014-1496-1 Filimonov D, Lagunin A, Gloriozova T, Rudik A, Druzhilovskii D, Pogodin P, et al. Prediction of the biological activity spectra of organic compounds using the PASS online web resource. Chem Heterocycl Compd. 2014;50:444–57. 16. Christman JK 5-azacytidine and 5-aza-2′-deoxycytidine as inhibitors of DNA methylation: mechanistic studies and their implications for cancer therapy Oncogene 2002 21 35 5483 95 10.1038/sj.onc.1205699 12154409 Christman JK. 5-azacytidine and 5-aza-2′-deoxycytidine as inhibitors of DNA methylation: mechanistic studies and their implications for cancer therapy. Oncogene. 2002;21(35):5483–95. 12154409 10.1038/sj.onc.1205699 17. Zhao B Luo J Yu T Zhou L Lv H Shang P Anticancer mechanisms of metformin: a review of the current evidence Life Sci 2020 254 117717 10.1016/j.lfs.2020.117717 32339541 Zhao B, Luo J, Yu T, Zhou L, Lv H, Shang P. Anticancer mechanisms of metformin: a review of the current evidence. Life Sci. 2020;254:117717. 32339541 10.1016/j.lfs.2020.117717 18. Anderson LM Cancer biology and hormesis: comments on calabrese (2005) Crit Rev Toxicol 2005 35 6 583 6 10.1080/10408440500246777 16422393 Anderson LM. Cancer biology and hormesis: comments on calabrese (2005). Crit Rev Toxicol. 2005;35(6):583–6. 16422393 10.1080/10408440500246777 19. Smith F 24A. Hormesis and integrative medicine Global Adv Health Med 2013 2 1suppl gahmj Smith F. 24A. Hormesis and integrative medicine. Global Adv Health Med. 2013;2(1suppl):gahmj. 2013.097 CP. S24A. 20. Tonon F Cemazar M Kamensek U Zennaro C Pozzato G Caserta S 5-azacytidine downregulates the proliferation and migration of hepatocellular carcinoma cells in vitro and in vivo by targeting miR-139-5p/ROCK2 pathway Cancers (Basel) 2022 14 7 1630 10.3390/cancers14071630 35406401 PMC8996928 Tonon F, Cemazar M, Kamensek U, Zennaro C, Pozzato G, Caserta S, et al. 5-azacytidine downregulates the proliferation and migration of hepatocellular carcinoma cells in vitro and in vivo by targeting miR-139-5p/ROCK2 pathway. Cancers (Basel). 2022;14(7):1630. 35406401 10.3390/cancers14071630 PMC8996928 21. Stuermer EK Besser M Terberger N Koester V Bachmann HS Severing AL Side effects of frequently used oral antidiabetics on wound healing in vitro Naunyn Schmiedebergs Arch Pharmacol 2019 392 3 371 80 10.1007/s00210-018-01597-9 30535571 Stuermer EK, Besser M, Terberger N, Koester V, Bachmann HS, Severing AL. Side effects of frequently used oral antidiabetics on wound healing in vitro. Naunyn Schmiedebergs Arch Pharmacol. 2019;392(3):371–80. 30535571 10.1007/s00210-018-01597-9 22. Ikhlas S Ahmad M Metformin. Insights into its anticancer potential with special reference to AMPK dependent and independent pathways Life Sci 2017 185 53 62 10.1016/j.lfs.2017.07.029 28755883 Ikhlas S, Ahmad M. Metformin. Insights into its anticancer potential with special reference to AMPK dependent and independent pathways. Life Sci. 2017;185:53–62. 28755883 10.1016/j.lfs.2017.07.029 23. Rutkovsky AC Yeh ES Guest ST Findlay VJ Muise-Helmericks RC Armeson K Eukaryotic initiation factor 4E-binding protein as an oncogene in breast cancer BMC Cancer 2019 19 1 15 10.1186/s12885-019-5667-4 31122207 PMC6533768 Rutkovsky AC, Yeh ES, Guest ST, Findlay VJ, Muise-Helmericks RC, Armeson K, et al. Eukaryotic initiation factor 4E-binding protein as an oncogene in breast cancer. BMC Cancer. 2019;19:1–15. 31122207 10.1186/s12885-019-5667-4 PMC6533768 24. Chen X An Y Tan M Xie D Liu L Xu B Biological functions and research progress of eIF4E Front Oncol 2023 13 1076855 10.3389/fonc.2023.1076855 37601696 PMC10435865 Chen X, An Y, Tan M, Xie D, Liu L, Xu B. Biological functions and research progress of eIF4E. Front Oncol. 2023;13:1076855. 37601696 10.3389/fonc.2023.1076855 PMC10435865 25. MERKEROVA MD KLEMA J KUNDRAT D SZIKSZAI K KREJCIK Z HRUSTINCOVA A Noncoding RNAs and their response predictive value in Azacitidine-treated patients with myelodysplastic syndrome and acute myeloid leukemia with myelodysplasia-related changes Cancer Genomics - Proteom 2022 19 2 205 28 10.21873/cgp.20315 PMC8865042 35181589 MERKEROVA MD, KLEMA J, KUNDRAT D, SZIKSZAI K, KREJCIK Z, HRUSTINCOVA A, et al. Noncoding RNAs and their response predictive value in Azacitidine-treated patients with myelodysplastic syndrome and acute myeloid leukemia with myelodysplasia-related changes. Cancer Genomics - Proteom. 2022;19(2):205–28. 10.21873/cgp.20315 PMC8865042 35181589 26. Cai Z Xu H Bai G Hu H Wang D Li H ELAVL1 promotes prostate cancer progression by interacting with other m6A regulators Front Oncol 2022 12 939784 10.3389/fonc.2022.939784 35978821 PMC9376624 Cai Z, Xu H, Bai G, Hu H, Wang D, Li H, et al. ELAVL1 promotes prostate cancer progression by interacting with other m6A regulators. Front Oncol. 2022;12:939784. 35978821 10.3389/fonc.2022.939784 PMC9376624 27. Goutas D Pergaris A Giaginis C Theocharis S HuR as therapeutic target in cancer: what the future holds Curr Med Chem 2022 29 1 56 65 10.2174/0929867328666210628143430 34182901 Goutas D, Pergaris A, Giaginis C, Theocharis S. HuR as therapeutic target in cancer: what the future holds. Curr Med Chem. 2022;29(1):56–65. 34182901 10.2174/0929867328666210628143430 28. Aimiuwu J Wang H Chen P Xie Z Wang J Liu S RNA-dependent inhibition of ribonucleotide reductase is a major pathway for 5-azacytidine activity in acute myeloid leukemia Blood 2012 119 22 5229 38 10.1182/blood-2011-11-382226 22517893 PMC3369613 Aimiuwu J, Wang H, Chen P, Xie Z, Wang J, Liu S, et al. RNA-dependent inhibition of ribonucleotide reductase is a major pathway for 5-azacytidine activity in acute myeloid leukemia. Blood. 2012;119(22):5229–38. 22517893 10.1182/blood-2011-11-382226 PMC3369613 29. Cuyàs E Verdura S Martin-Castillo B Menendez JA Metformin: targeting the metabolo-epigenetic link in cancer biology Front Oncol 2021 10 620641 10.3389/fonc.2020.620641 33604300 PMC7884859 Cuyàs E, Verdura S, Martin-Castillo B, Menendez JA. Metformin: targeting the metabolo-epigenetic link in cancer biology. Front Oncol. 2021;10:620641. 33604300 10.3389/fonc.2020.620641 PMC7884859 30. Schaefer M Hagemann S Hanna K Lyko F Azacytidine inhibits RNA methylation at DNMT2 target sites in human cancer cell lines Cancer Res 2009 69 20 8127 32 10.1158/0008-5472.CAN-09-0458 19808971 Schaefer M, Hagemann S, Hanna K, Lyko F. Azacytidine inhibits RNA methylation at DNMT2 target sites in human cancer cell lines. Cancer Res. 2009;69(20):8127–32. 19808971 10.1158/0008-5472.CAN-09-0458 31. Conza D Mirra P Fiory F Insabato L Nicolò A Beguinot F Metformin: a new inhibitor of the Wnt signaling pathway in cancer Cells 2023 12 17 2182 10.3390/cells12172182 37681914 PMC10486775 Conza D, Mirra P, Fiory F, Insabato L, Nicolò A, Beguinot F, et al. Metformin: a new inhibitor of the Wnt signaling pathway in cancer. Cells. 2023;12(17):2182. 37681914 10.3390/cells12172182 PMC10486775 32. Yu X Mao W Zhai Y Tong C Liu M Ma L Anti-tumor activity of metformin: from metabolic and epigenetic perspectives Oncotarget 2016 8 3 5619 10.18632/oncotarget.13639 PMC5354934 27902459 Yu X, Mao W, Zhai Y, Tong C, Liu M, Ma L, et al. Anti-tumor activity of metformin: from metabolic and epigenetic perspectives. Oncotarget. 2016;8(3):5619. 10.18632/oncotarget.13639 PMC5354934 27902459 33. Duo J Ma Y Wang G Han X Zhang C Metformin synergistically enhances antitumor activity of histone deacetylase inhibitor trichostatin A against osteosarcoma cell line DNA Cell Biol 2013 32 4 156 64 10.1089/dna.2012.1926 23451817 Duo J, Ma Y, Wang G, Han X, Zhang C. Metformin synergistically enhances antitumor activity of histone deacetylase inhibitor trichostatin A against osteosarcoma cell line. DNA Cell Biol. 2013;32(4):156–64. 23451817 10.1089/dna.2012.1926 34. Hatulely CA Diabetes medications as monotherapy or metformin-based combination therapy for type 2 diabetes: a systematic review J Adv Res Med Health Sci ISSN 2023 2208 2425 Hatulely CA. Diabetes medications as monotherapy or metformin-based combination therapy for type 2 diabetes: a systematic review. J Adv Res Med Health Sci ISSN. 2023;2208:2425. 35. Gu Z Ye F Luo H Li X Gong Y Mao S Metformin sensitizes triple-negative breast cancer to histone deacetylase inhibitors by targeting FGFR4 J Biomed Sci 2025 32 1 36 10.1186/s12929-025-01129-7 40091020 PMC11912690 Gu Z, Ye F, Luo H, Li X, Gong Y, Mao S, et al. Metformin sensitizes triple-negative breast cancer to histone deacetylase inhibitors by targeting FGFR4. J Biomed Sci. 2025;32(1):36. 40091020 10.1186/s12929-025-01129-7 PMC11912690 36. Martin-Castillo B Pernas S Dorca J Álvarez I Martínez S Pérez-Garcia JM A phase 2 trial of neoadjuvant metformin in combination with trastuzumab and chemotherapy in women with early HER2-positive breast cancer: the METTEN study Oncotarget 2018 9 86 35687 10.18632/oncotarget.26286 30479698 PMC6235018 Martin-Castillo B, Pernas S, Dorca J, Álvarez I, Martínez S, Pérez-Garcia JM, et al. A phase 2 trial of neoadjuvant metformin in combination with trastuzumab and chemotherapy in women with early HER2-positive breast cancer: the METTEN study. Oncotarget. 2018;9(86):35687. 30479698 10.18632/oncotarget.26286 PMC6235018 37. Barakat HE Hussein RR Elberry AA Zaki MA Ramadan ME The impact of Metformin use on the outcomes of locally advanced breast cancer patients receiving neoadjuvant chemotherapy: an open-labelled randomized controlled trial Sci Rep 2022 12 1 7656 10.1038/s41598-022-11138-3 35538143 PMC9091204 Barakat HE, Hussein RR, Elberry AA, Zaki MA, Ramadan ME. The impact of Metformin use on the outcomes of locally advanced breast cancer patients receiving neoadjuvant chemotherapy: an open-labelled randomized controlled trial. Sci Rep. 2022;12(1):7656. 35538143 10.1038/s41598-022-11138-3 PMC9091204 ",
  "metadata": {
    "Title of this paper": "The impact of Metformin use on the outcomes of locally advanced breast cancer patients receiving neoadjuvant chemotherapy: an open-labelled randomized controlled trial",
    "Journal it was published in:": "BMC Cancer",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487258/"
  }
}