{
  "title": "Paper_472",
  "abstract": "pmc Eur J Med Res Eur J Med Res 1786 eurjmedres European Journal of Medical Research 0949-2321 2047-783X BMC PMC12482578 PMC12482578.1 12482578 12482578 41024269 10.1186/s40001-025-03165-3 3165 1 Review Effects of exercise on neuroinflammation in age-related neurodegenerative disorders Su Yiping 1 Su Zhanguo suzhanguo@126.com 2 3 1 https://ror.org/00rzspn62 grid.10347.31 0000 0001 2308 5949 Faculty of Sports and Exercise Science, University of Malaya, 2 https://ror.org/03n7a5z57 grid.464320.7 0000 0004 1763 3613 Faculty of Physical Education, Huainan Normal University, 3 https://ror.org/04d8yqq70 grid.443692.e 0000 0004 0617 4511 International College, Krirk University, 29 9 2025 2025 30 478380 909 28 2 2025 8 8 2025 3 9 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Neuroinflammation plays a critical role in the pathogenesis of aging-related neurodegenerative disorders such as Alzheimer's disease, Parkinson's disease, and Multiple Sclerosis. It involves the activation of glial cells and the release of pro-inflammatory mediators and reactive oxygen and nitrogen species, which, when chronically sustained, contribute to neuronal damage and cognitive decline. Recent evidence suggests that regular physical exercise exerts neuroprotective effects by modulating neuroinflammatory pathways and enhancing brain health. Exercise has been shown to regulate the activity of microglia and astrocytes, strengthen the blood–brain barrier, and reduce systemic and gut-derived inflammation—all of which are implicated in the progression of neurodegeneration. Additionally, exercise influences inflammasome signaling, a key component in the innate immune response, further mitigating inflammation-induced neuronal injury. This review summarizes current findings on the impact of physical activity on inflammation and inflammasome pathways in aging-related neurodegenerative diseases, highlighting the therapeutic potential of exercise as a non-pharmacological intervention. Further research is warranted to optimize exercise protocols for maximal neuroprotective benefits. Keywords Aging Neurodegenerative disorders Exercise Inflammation Inflammasome pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction In 2022, the official recognition by the World Health Organization designated neurological disorders as the primary cause of disabilities and the second highest contributor to global mortality rates. According to the Global Burden of Disease (GBD) study, the total number of fatalities caused by neurological disorders in 2016 was approximately 9 million, which Marked a 39% rise since 1990 [ 1 1 1 2 3 4 5 6 7 Engaging in physical activity can act as a source of stress both during and after its performance, potentially leading to inflammation [ 8 9 10 11 12 13 8 14 18 9 10 14 21 22 23 24 24 27 28 29 30 31 32 33 Literature search strategy To conduct this review, a comprehensive literature search was performed using the following electronic databases: PubMed, Scopus, Web of Science, and Google Scholar. Keywords and combinations of terms such as “exercise” “physical activity” “neuroinflammation” “inflammasome” “neurodegenerative diseases” “aging” “Alzheimer’s disease”, “Parkinson’s disease”, “Amyotrophic lateral sclerosis” “Multiple Sclerosis” Inflammation and neurodegenerative disorders Neurodegenerative diseases exhibit a multitude of similar and distinct pathological and clinical traits, such as specific vulnerability of brain regions and the accumulation of various proteins. Neurodegenerative diseases not only display distinct neuropathological and clinical features, but also demonstrate persistent and long-lasting inflammation [ 34 36 37 39 40 41 34 42 47 48 1 Fig. 1 The Cycle of Neuroinflammation in Neurodegeneration This diagram illustrates how triggers, such as protein aggregates or pathogens, activate glial cells (microglia and astrocytes). This activation leads to the release of pro-inflammatory mediators, which cause neuronal damage and create a self-perpetuating cycle of inflammation and cell death. DAMPs, damage-associated molecular patterns; PAMPs, pathogen-associated molecular patterns. Alzheimer’s disease In the year 1907, Alois Alzheimer recognized Alzheimer's disease as the most commonly occurring type of neurodegenerative disorder. Roughly 10% of individuals over the age of 65, and around 30% of those over 85, experience AD, with the figures on the rise [ 49 34 . 50 51 52 53 54 57 58 59 60 61 62 64 65 67 2 68 69 Fig. 2 The Role of Neuroinflammation in Alzheimer’s Disease (AD). This schematic illustrates the central inflammatory cascade in AD. A B C Amyotrophic lateral sclerosis The progressive deterioration of the central nervous system's upper and lower motor neurons, which is also referred to as ALS, was first documented by Charcot in 1869. ALS is an untreatable condition with a certain outcome of death, typically occurring within a span of 2 to 5 years following diagnosis [ 70 71 72 73 75 76 77 78 42 79 81 71 82 3 83 84 Fig. 3 Neuroinflammatory Mechanisms in Amyotrophic Lateral Sclerosis (ALS). This diagram illustrates how cytoplasmic aggregates of proteins like TDP-43 and SOD1 can cause mitochondrial dysfunction. The release of mitochondrial DNA (mtDNA) can activate the cGAS-STING pathway, initiating an inflammatory response that contributes to the progressive degeneration of motor neurons Parkinson’s disease Parkinson's disease (PD) is the second most common degenerative disorder, characterized by Lewy bodies, groups of α-synuclein protein, and a decline in dopaminergic neurons in the substantia nigra [ 85 86 87 88 87 89 90 92 93 94 95 96 97 99 87 100 101 85 102 103 104 105 106 107 108 110 4 111 112 109 113 115 Fig. 4 The Role of Inflammation in Parkinson's Disease (PD) This figure depicts how aggregated α-synuclein activates microglia. This activation leads to increased oxidative stress and mitochondrial dysfunction, which enhances the neurotoxicity of α-synuclein and contributes to the loss of dopaminergic neurons. DAMPs, damage-associated molecular patterns. Huntington’s disease Huntington’s disease (HD) is a progressive, autosomal dominant neurodegenerative disorder caused by an abnormal expansion of CAG trinucleotide repeats in the huntingtin 116 117 118 120 121 122 Pathologically, HD is characterized by widespread neuronal loss, most notably in the striatum and cortex. The disease progresses over 15 to 20 years, leading to severe disability and ultimately death. Despite the identification of the genetic mutation responsible for HD over two decades ago, there is still no cure, and treatment remains symptomatic [ 123 124 126 127 128 129 130 131 132 133 1 Table 1 Inflammatory Mechanisms In Neurodegenerative Diseases Neurodegenerative disease Primary inflammatory mechanisms Exercise/exercise-mimetic effects Alzheimer’s disease (AD) Microglial activation, NLRP3 inflammasome activation, increased IL-1α, TNF-β, and oxidative stress Reduces pro-inflammatory cytokines, enhances neurogenesis, decreases amyloid-β accumulation Parkinson’s disease (PD) Microglial activation, α-synuclein-induced inflammation, increased cytokines (IL-6, TNF-β), mitochondrial dysfunction Modulates microglial response, reduces α-synuclein aggregation, improves mitochondrial function Amyotrophic lateral sclerosis (ALS) Neuroinflammation via TLR4 and NF-κB signaling, microglial activation, oxidative stress, astrocyte dysfunction Decreases pro-inflammatory signaling, improves antioxidant defenses, supports motor neuron survival Huntington’s disease (HD) Microglial and astrocyte activation, elevated cytokines (IL-6, TNF-α), inflammasome activation Reduces neuroinflammation, modulates glial activity, improves synaptic function, enhances neuroplasticity Numerous studies have demonstrated that the activation of inflammasomes plays a crucial role in initiating autoimmune and inflammatory responses among individuals with Multiple Sclerosis [ 134 135 136 5 135 137 138 5 Fig. 5 Inflammatory Contributors to Huntington’s Disease (HD). An overview of how the mutant huntingtin (mHTT) protein promotes neurodegeneration. It triggers inflammation through multiple pathways, including the activation of microglia and astrocytes, peripheral immune responses, and inflammasome signaling, all converging to create a neurotoxic environment. Table 1 The protein ASC is found in various parts of inactive cells, including the mitochondria, nucleus, and cytosol. Upon activation of the inflammasome, ASC relocates from its original position to the cytosol, enabling it to interact with various sensors such as NLR, ALR, and pryin [ 139 140 When triggered by various factors such as infection, tissue injury, and alterations in metabolic functions, inflammasomes are crucial in producing functional types of IL-1β and IL-18. This process is influenced by several elements such as abnormalities in lysosome activity, disruption of mitochondrial processes, release of mitochondrial DNA, generation of reactive oxygen species, and increased levels of cellular calcium. When a disease-causing particle or an injury-causing molecule binds to the NLR segment of the inflammasome, it prompts the clustering of NLR proteins. This is made possible by the interactions between comparable pyrin or caspase-recruitment domain components. Taking into consideration these engagements, the detectors belonging to the inflammasome come together to form structures, either with the assistance of the connector molecule ASC or independently. To effectively process cytokines, there must be a gathering of ASC and organization within the inflammasome [ 141 142 When procaspases are combined and self-activate, the inflammasome is considered to be active. Consequently, the activation of caspase-1 triggers the transformation of pro-IL-1β and pro-IL-18, which are inactive forms, into their active forms [ 143 144 145 145 145 6 Fig. 6 Activation of the NLRP3 Inflammasome. This diagram details the canonical and non-canonical pathways. The canonical pathway requires a priming signal (Signal 1) via NF-κB and an activation signal (Signal 2) from triggers like ATP or reactive oxygen species (ROS). This leads to caspase-1 activation, which cleaves Gasdermin D (GSDMD) to induce pyroptosis and processes pro-inflammatory cytokines IL-1β and IL-18 into their active forms Caspase-1 also breaks down GSDMD, freeing GSDMD-N [ 146 147 147 148 148 148 7 Fig. 7 Activation Mechanisms of NLRP1 and AIM2 Inflammasomes. This figure contrasts the activation of two other key inflammasomes. The NLRP1 inflammasome is activated by sensing pathogenic functions that lead to its auto-cleavage. The AIM2 inflammasome is activated by directly binding to double-stranded DNA in the cytosol. Both pathways converge on caspase-1 activation to trigger inflammation and pyroptosis. ASC, apoptosis-associated speck-like protein; CARD, caspase-recruitment domain Studies have revealed that the NLRP3 inflammasome plays a vital role in the neuroinflammation associated with Alzheimer's disease. This is evident from the elevated levels of IL-1β and IL-18 found in patients with the disease [ 149 152 153 154 155 156 Beyond NLRP3, the NLRP1 inflammasome has also been implicated in AD. Studies show increased NLRP1 mRNA in affected neurons, where it may contribute to Aβ₄₂ accumulation through a caspase-1 and caspase-6-dependent pathway [ 157 A plethora of studies have gathered strong evidence suggesting that the NLRP3 inflammasome might be a significant factor in the onset of multiple sclerosis. Approximately ten years ago, Gris and his colleagues put forth the idea that the Nlrp3 gene plays a crucial part in the formation of experimental autoimmune encephalomyelitis (EAE), the primary animal-based model utilized in researching multiple sclerosis in human subjects [ 158 159 158 160 Studies have demonstrated a rise in the levels of caspase-1 and IL-1β proteins in the peripheral blood mononuclear cells and cerebrospinal fluid of patients with multiple sclerosis [ 161 162 163 164 165 158 166 168 169 170 171 The NLRP3 inflammasome is a key driver of inflammation in PD. Fibrillar α-synuclein, a hallmark of the disease, acts as an endogenous danger signal that directly triggers NLRP3 activation in microglia. This leads to caspase-1-mediated maturation of IL-1β, propagating the inflammatory cycle [ 172 173 174 175 176 177 178 179 180 79 181 182 Exercise, inflammation, and inflammasome The number of medical issues, including type 2 diabetes, is growing globally due to the continual growth of obesity rates. The disruptions can be attributed to a collapse in the connection between metabolic processes and immune responses, commonly referred to as immunometabolism [ 183 184 188 189 187 190 193 186 188 190 7 190 193 194 195 15 196 197 15 197 15 197 200 201 202 204 205 206 207 207 208 209 210 211 210 212 213 214 215 213 216 217 215 218 219 205 220 205 221 Figure 7 Exercise and inflammation, inflammasome in neurodegenerative disorders Physical exercise exerts its neuroprotective effects through several common, overlapping pathways across different neurodegenerative conditions. These core mechanisms include (1) suppressing the activation of the NLRP3 inflammasome [ 222 224 225 226 227 228 229 2 Table 2 Summary of Exercise Interventions and Their Effects in Models of Neurodegenerative Disease Disease Study model Exercise protocol (type, duration, frequency) Key molecular & cellular findings Key behavioral/clinical outcomes & reference Alzheimer's Disease (AD) Mice (Aβ₁₋₄₀ injected) Moderate treadmill running; 4 weeks ↓ Hippocampal microglial reactivity (Iba-1); ↓ NLRP3 inflammasome pathway activation (NLRP3, TXNIP, caspase-1) Not specified [ 230 Genetically engineered AD mice Treadmill running; 20 weeks ↓ Hippocampal NLRP3, IL-1β, and Aβ₁₋₄₂ levels; ↓ microglial activation and neuronal impairment Improved cognitive performance [ 231 Parkinson's Disease (PD) Human (PD patients) High-Intensity Interval Training (HIIT); 12 weeks ↓ TNF-α, ↑ IL-10, ↑ superoxide dismutase (SOD); ↓ neutrophil counts Potential slowing of disease progression [ 232 Mice (MPTP-induced) Treadmill running; concurrent with MPTP ↓ Microglial activation; ↓ NLRP3 +/Iba-1 + cells; Suppressed TLR4/MyD88/NF-κB signaling Ameliorated motor deficits and dopaminergic neuron loss [ 223 Mice (MPTP-induced) Environmental Enrichment (includes voluntary exercise) ↓ α-synuclein, TNF-α, IL-1β; Blocked TLR2 signaling; Restored tyrosine hydroxylase Improved motor function 75[ 233 Amyotrophic Lateral Sclerosis (ALS) Transgenic mice (G93A-SOD1) Moderate voluntary running Not specified, but protects motor neurons Prolonged survival and delayed disease onset 8 [ 234 235 ALS model mice Swimming ↑ Brain-Derived Neurotrophic Factor (BDNF), ↑ Insulin-like Growth Factor 1 (IGF-1); Reduced motor neuron loss Not specified [ 236 Multiple Sclerosis (MS) Mice (EAE model) Treadmill running; 5x/week for 4 weeks ↓ Hippocampal demyelination; ↑ BDNF levels Improved performance in memory tasks [ 237 Human (Females with MS) Aerobic and resistance training (unspecified duration) ↓ Leptin, ↓ TNF-α; ↑ IL-10, ↑ adiponectin Reduced body weight and inflammation [ 238 Alzheimer's disease Alzheimer's disease disrupts the proper functioning of neuroglial cells, including microglia, astrocytes, and oligodendrocytes, causing neuroinflammation. As a consequence, the situation deteriorates at an accelerated pace. In the Mild Cognitive Impairment (MCI) phase, the BBB weakens and becomes permeable, allowing external elements such as LPS to enter and activate immune cells in the brain [ 239 240 241 243 244 245 246 247 248 249 , 8 250 251 230 Fig. 8 Engaging in physical activity has a significant and diverse influence on the advancement of Alzheimer's disease, greatly impacting the body's overall well-being Beyond microglia, exercise confers benefits to other essential components of the central nervous system. It reduces the inflammatory reactivity of astrocytes, improves their ability to clear neurotransmitters, and supports neuronal energy metabolism [ 252 253 254 255 This multi-faceted neuroprotection translates to tangible cognitive benefits. For example, a long-term study by Li and colleagues demonstrated that 20 weeks of treadmill exercise in a genetic AD mouse model significantly improved cognitive performance. These behavioral enhancements were linked to key molecular changes in the hippocampus, including a marked reduction in NLRP3 inflammasome components, IL-1β, and Aβ₁₋₄₂ levels. The exercise also preserved hippocampal neurons by reducing pathological microglial activity, highlighting a direct link between exercise-induced anti-inflammation and the preservation of cognitive function [ 231 Taken together, the evidence strongly supports physical activity as a potent, non-pharmacological strategy to mitigate neuroinflammation and slow disease progression in Alzheimer's disease. Parkinson's disease In Parkinson's disease, where the aggregation of α-synuclein and the loss of dopaminergic neurons are driven by neuroinflammation, exercise provides targeted neuroprotection. By leveraging the same core anti-inflammatory mechanisms seen in AD, physical activity directly counteracts PD pathology. For example, exercise is known to suppress the activation of the NLRP3 inflammasome in microglia, a pathway directly triggered by fibrillar α-synuclein [ 256 Evidence from clinical and preclinical studies supports these benefits. A 12-week high-intensity interval training (HIIT) program in individuals with PD led to a significant decrease in the pro-inflammatory cytokine TNF-α and a rise in anti-inflammatory IL-10, demonstrating a powerful systemic effect [ 232 257 258 259 261 256 265 Providing a more nuanced perspective, a large 2021 systematic review by Li and colleagues confirmed that physical activity beneficially lowered UPDRS motor scores and raised BDNF levels. However, they found the evidence for a direct reduction in systemic inflammation and oxidative stress markers to be of low certainty, highlighting the need for further high-quality trials to clarify the precise mechanisms underlying the observed clinical improvements [ 262 Collectively, these findings underscore the potential of exercise to slow PD progression by improving clinical outcomes and mitigating α-synuclein-driven inflammation, even as the full spectrum of its mechanistic action continues to be explored. Other neurodegenerative diseases The benefits of exercise extend to other neurodegenerative conditions, although the mechanisms and optimal protocols may vary depending on the specific pathology of each disease. Huntington’s disease (HD) While research is still emerging compared to AD and PD, exercise is considered a promising strategy for managing symptoms in Huntington's disease. Animal models show that exercise can improve motor function and delay disease progression [ 263 265 129 266 Amyotrophic lateral sclerosis (ALS) The role of exercise in ALS is particularly nuanced and highlights the importance of intensity. A critical distinction exists between strenuous physical exertion, which has been linked to an increased risk of developing ALS in elite athletes, and moderate, controlled exercise, which shows therapeutic promise [ 267 270 234 235 236 271 Multiple sclerosis (MS) In multiple sclerosis, an autoimmune disorder characterized by demyelination and neuroinflammation, exercise acts as a potent immunomodulator. In the experimental autoimmune encephalomyelitis (EAE) animal model, exercise has been shown to reduce disease severity by promoting a shift away from pro-inflammatory Th1 and Th17 cells toward anti-inflammatory regulatory T cells (Tregs) [ 272 238 273 274 237 275 Conclusion As the global population ages, the incidence of neurodegenerative disorders—and the associated healthcare burden—continues to rise. Physical exercise remains one of the most effective non-pharmacological strategies for preserving cognitive function and mitigating neuroinflammation. However, in individuals unable to engage in regular physical activity due to illness, frailty, or injury, circulating factors found in “runner's plasma” have emerged as promising exercise mimetics. Recent studies have identified several of these bioactive molecules capable of reducing neuroinflammation, promoting neurogenesis, enhancing synaptic plasticity, and decreasing pathological protein accumulation in models of Alzheimer's and Parkinson's diseases. While preclinical data are encouraging, the molecular mechanisms underlying these effects remain incompletely understood, and only a small subset of candidate molecules has been thoroughly investigated. This review aimed to summarize emerging evidence on exercise-induced factors that mimic the neuroprotective effects of physical activity. Although these findings suggest potential therapeutic value, clinical validation is lacking. It is important to acknowledge that while the mechanistic evidence detailed in this review is extensive, much of it is derived from preclinical models. The existing human clinical studies, though more limited, provide encouraging and consistent results. For instance, investigations in patients with Parkinson's disease and multiple sclerosis have demonstrated that structured exercise programs can significantly reduce systemic inflammatory markers, like TNF-α, while concurrently improving clinical motor scores and well-being [ 232 238 262 To advance this field, future research must focus on identifying and characterizing additional exercise-responsive molecules, clarifying their mechanisms of action, and evaluating their efficacy, safety, dosage, and treatment duration in human populations. Ultimately, well-designed clinical trials are essential to determine whether exercise mimetics can become viable therapeutic interventions for neurodegenerative diseases. Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements Not applicable. Author contributions YiPing Su, and Zhanguo Su contributed to the conception, design, and drafting of the manuscript. Funding Not applicable. Data availability No datasets were generated or analysed during the current study. Declarations Ethical approval and consent to participate Not applicable. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Feigin VL Nichols E Alam T Bannick MS Beghi E Blake N Culpepper WJ Dorsey ER Elbaz A Ellenbogen RG Fisher JL Global, regional, and national burden of neurological disorders, 1990–2016: a systematic analysis for the Global Burden of Disease Study 2016 Lancet Neurol 2019 18 5 459 480 10.1016/S1474-4422(18)30499-X 30879893 PMC6459001 Feigin VL, Nichols E, Alam T, Bannick MS, Beghi E, Blake N, et al. Global, regional, and national burden of neurological disorders, 1990–2016: a systematic analysis for the Global Burden of Disease Study 2016. Lancet Neurol. 2019;18(5):459–80. 30879893 10.1016/S1474-4422(18)30499-X PMC6459001 2. Yang W Current and projected future economic burden of Parkinson's disease in the U.S. NPJ Parkinsons Dis 2020 6 15 10.1038/s41531-020-0117-1 32665974 PMC7347582 Yang W, et al. Current and projected future economic burden of Parkinson’s disease in the U.S. NPJ Parkinsons Dis. 2020;6:15. 32665974 10.1038/s41531-020-0117-1 PMC7347582 3. who/news-room/fact-sheets/detail/physical-activity. https://www.who.int/news-room/fact-sheets/detail/physical-activity 4. Herold F Dose-response matters! - a perspective on the exercise prescription in exercise-cognition research Front Psychol 2019 10 2338 10.3389/fpsyg.2019.02338 31736815 PMC6839278 Herold F, et al. Dose-response matters! - a perspective on the exercise prescription in exercise-cognition research. Front Psychol. 2019;10:2338. 31736815 10.3389/fpsyg.2019.02338 PMC6839278 5. Ruegsegger GN Booth FW Health benefits of exercise Cold Spring Harb Perspect Med 2018 10.1101/cshperspect.a029694 28507196 PMC6027933 Ruegsegger GN, Booth FW. Health benefits of exercise. Cold Spring Harb Perspect Med. 2018. 10.1101/cshperspect.a029694. 28507196 10.1101/cshperspect.a029694 PMC6027933 6. Alanko V Mechanisms underlying non-pharmacological dementia prevention strategies: a translational perspective J Prev Alzheimers Dis 2022 9 1 3 11 10.14283/jpad.2022.9 35098968 PMC12275741 Alanko V, et al. Mechanisms underlying non-pharmacological dementia prevention strategies: a translational perspective. J Prev Alzheimers Dis. 2022;9(1):3–11. 35098968 10.14283/jpad.2022.94 PMC12275741 7. Ross RE The role of exercise in the treatment of depression: biological underpinnings and clinical outcomes Mol Psychiatry 2023 28 1 298 328 10.1038/s41380-022-01819-w 36253441 PMC9969795 Ross RE, et al. The role of exercise in the treatment of depression: biological underpinnings and clinical outcomes. Mol Psychiatry. 2023;28(1):298–328. 36253441 10.1038/s41380-022-01819-w PMC9969795 8. Silveira LS Macrophage polarization: implications on metabolic diseases and the role of exercise Crit Rev Eukaryot Gene Expr 2016 26 2 115 132 10.1615/CritRevEukaryotGeneExpr.2016015920 27480774 Silveira LS, et al. Macrophage polarization: implications on metabolic diseases and the role of exercise. Crit Rev Eukaryot Gene Expr. 2016;26(2):115–32. 27480774 10.1615/CritRevEukaryotGeneExpr.2016015920 9. Gleeson M The anti-inflammatory effects of exercise: mechanisms and implications for the prevention and treatment of disease Nat Rev Immunol 2011 11 9 607 615 10.1038/nri3041 21818123 Gleeson M, et al. The anti-inflammatory effects of exercise: mechanisms and implications for the prevention and treatment of disease. Nat Rev Immunol. 2011;11(9):607–15. 21818123 10.1038/nri3041 10. Allen J Sun Y Woods JA Exercise and the regulation of inflammatory responses Prog Mol Biol Transl Sci 2015 135 337 354 10.1016/bs.pmbts.2015.07.003 26477921 Allen J, Sun Y, Woods JA. Exercise and the regulation of inflammatory responses. Prog Mol Biol Transl Sci. 2015;135:337–54. 26477921 10.1016/bs.pmbts.2015.07.003 11. Oishi Y Manabe I Macrophages in inflammation, repair and regeneration Int Immunol 2018 30 11 511 528 10.1093/intimm/dxy054 30165385 Oishi Y, Manabe I. Macrophages in inflammation, repair and regeneration. Int Immunol. 2018;30(11):511–28. 30165385 10.1093/intimm/dxy054 12. Roca-Rodríguez Mdel M Effects of exercise on inflammation in cardiac rehabilitation Nutr Hosp 2015 31 6 2633 2640 26040375 10.3305/nh.2015.31.6.8868 Roca-Rodríguez Mdel M, et al. Effects of exercise on inflammation in cardiac rehabilitation. Nutr Hosp. 2015;31(6):2633–40. 26040375 10.3305/nh.2015.31.6.8868 13. Pedersen BK Anti-inflammatory effects of exercise: role in diabetes and cardiovascular disease Eur J Clin Invest 2017 47 8 600 611 10.1111/eci.12781 28722106 Pedersen BK. Anti-inflammatory effects of exercise: role in diabetes and cardiovascular disease. Eur J Clin Invest. 2017;47(8):600–11. 28722106 10.1111/eci.12781 14. Moldoveanu AI Shephard RJ Shek PN The cytokine response to physical activity and training Sports Med 2001 31 2 115 144 10.2165/00007256-200131020-00004 11227979 PMC7101891 Moldoveanu AI, Shephard RJ, Shek PN. The cytokine response to physical activity and training. Sports Med. 2001;31(2):115–44. 11227979 10.2165/00007256-200131020-00004 PMC7101891 15. Petersen AM Pedersen BK The anti-inflammatory effect of exercise J Appl Physiol (1985) 2005 98 4 1154 1162 10.1152/japplphysiol.00164.2004 15772055 Petersen AM, Pedersen BK. The anti-inflammatory effect of exercise. J Appl Physiol (1985). 2005;98(4):1154–62. 15772055 10.1152/japplphysiol.00164.2004 16. Timmons BW Cieslak T Human natural killer cell subsets and acute exercise: a brief review Exerc Immunol Rev 2008 14 8 23 19203081 Timmons BW, Cieslak T. Human natural killer cell subsets and acute exercise: a brief review. Exerc Immunol Rev. 2008;14:8–23. 19203081 17. Hennigar SR McClung JP Pasiakos SM Nutritional interventions and the IL-6 response to exercise FASEB j 2017 31 9 3719 3728 10.1096/fj.201700080R 28507168 Hennigar SR, McClung JP, Pasiakos SM. Nutritional interventions and the IL-6 response to exercise. FASEB j. 2017;31(9):3719–28. 28507168 10.1096/fj.201700080R 18. Peake JM Recovery of the immune system after exercise J Appl Physiol (1985) 2017 122 5 1077 1087 10.1152/japplphysiol.00622.2016 27909225 Peake JM, et al. Recovery of the immune system after exercise. J Appl Physiol (1985). 2017;122(5):1077–87. 27909225 10.1152/japplphysiol.00622.2016 19. Bigley AB Simpson RJ NK cells and exercise: implications for cancer immunotherapy and survivorship Discov Med 2015 19 107 433 445 26175401 Bigley AB, Simpson RJ. NK cells and exercise: implications for cancer immunotherapy and survivorship. Discov Med. 2015;19(107):433–45. 26175401 20. Lightfoot AP Cooper RG The role of myokines in muscle health and disease Curr Opin Rheumatol 2016 28 6 661 666 10.1097/BOR.0000000000000337 27548653 Lightfoot AP, Cooper RG. The role of myokines in muscle health and disease. Curr Opin Rheumatol. 2016;28(6):661–6. 27548653 10.1097/BOR.0000000000000337 21. Shaw DM T-cells and their cytokine production: the anti-inflammatory and immunosuppressive effects of strenuous exercise Cytokine 2018 104 136 142 10.1016/j.cyto.2017.10.001 29021092 Shaw DM, et al. T-cells and their cytokine production: the anti-inflammatory and immunosuppressive effects of strenuous exercise. Cytokine. 2018;104:136–42. 29021092 10.1016/j.cyto.2017.10.001 22. Christgen S Kanneganti TD Inflammasomes and the fine line between defense and disease Curr Opin Immunol 2020 62 39 44 10.1016/j.coi.2019.11.007 31837596 PMC7067632 Christgen S, Kanneganti TD. Inflammasomes and the fine line between defense and disease. Curr Opin Immunol. 2020;62:39–44. 31837596 10.1016/j.coi.2019.11.007 PMC7067632 23. Carroll SL Pasare C Barton GM Control of adaptive immunity by pattern recognition receptors Immunity 2024 57 4 632 648 10.1016/j.immuni.2024.03.014 38599163 PMC11037560 Carroll SL, Pasare C, Barton GM. Control of adaptive immunity by pattern recognition receptors. Immunity. 2024;57(4):632–48. 38599163 10.1016/j.immuni.2024.03.014 PMC11037560 24. Li D Wu M Pattern recognition receptors in health and diseases Signal Transduct Target Ther 2021 6 1 291 10.1038/s41392-021-00687-0 34344870 PMC8333067 Li D, Wu M. Pattern recognition receptors in health and diseases. Signal Transduct Target Ther. 2021;6(1):291. 34344870 10.1038/s41392-021-00687-0 PMC8333067 25. Leemans JC Pattern recognition receptors and the inflammasome in kidney disease Nat Rev Nephrol 2014 10 7 398 414 10.1038/nrneph.2014.91 24890433 Leemans JC, et al. Pattern recognition receptors and the inflammasome in kidney disease. Nat Rev Nephrol. 2014;10(7):398–414. 24890433 10.1038/nrneph.2014.91 26. Moretti J Blander JM Insights into phagocytosis-coupled activation of pattern recognition receptors and inflammasomes Curr Opin Immunol 2014 26 100 110 10.1016/j.coi.2013.11.003 24556406 PMC3932007 Moretti J, Blander JM. Insights into phagocytosis-coupled activation of pattern recognition receptors and inflammasomes. Curr Opin Immunol. 2014;26:100–10. 24556406 10.1016/j.coi.2013.11.003 PMC3932007 27. Brandli A Vessey KA Fletcher EL The contribution of pattern recognition receptor signalling in the development of age related macular degeneration: the role of toll-like-receptors and the NLRP3-inflammasome J Neuroinflammation 2024 21 1 64 10.1186/s12974-024-03055-1 38443987 PMC10913318 Brandli A, Vessey KA, Fletcher EL. The contribution of pattern recognition receptor signalling in the development of age related macular degeneration: the role of toll-like-receptors and the NLRP3-inflammasome. J Neuroinflammation. 2024;21(1):64. 38443987 10.1186/s12974-024-03055-1 PMC10913318 28. Spel L Martinon F Inflammasomes contributing to inflammation in arthritis Immunol Rev 2020 294 1 48 62 10.1111/imr.12839 31944344 Spel L, Martinon F. Inflammasomes contributing to inflammation in arthritis. Immunol Rev. 2020;294(1):48–62. 31944344 10.1111/imr.12839 29. Guo H Callaway JB Ting JP Inflammasomes: mechanism of action, role in disease, and therapeutics Nat Med 2015 21 7 677 687 10.1038/nm.3893 26121197 PMC4519035 Guo H, Callaway JB, Ting JP. Inflammasomes: mechanism of action, role in disease, and therapeutics. Nat Med. 2015;21(7):677–87. 26121197 10.1038/nm.3893 PMC4519035 30. Navarro-Pando JM Inhibition of the NLRP3 inflammasome prevents ovarian aging Sci Adv 2021 10.1126/sciadv.abc7409 33523841 PMC7775749 Navarro-Pando JM, et al. Inhibition of the NLRP3 inflammasome prevents ovarian aging. Sci Adv. 2021. 10.1126/sciadv.abc7409. 33523841 10.1126/sciadv.abc7409 PMC7775749 31. Marín-Aguilar F NLRP3 inflammasome suppression improves longevity and prevents cardiac aging in male mice Aging Cell 2020 19 1 e13050 10.1111/acel.13050 31625260 PMC6974709 Marín-Aguilar F, et al. NLRP3 inflammasome suppression improves longevity and prevents cardiac aging in male mice. Aging Cell. 2020;19(1):e13050. 31625260 10.1111/acel.13050 PMC6974709 32. Youm YH Canonical Nlrp3 inflammasome links systemic low-grade inflammation to functional decline in aging Cell Metab 2013 18 4 519 532 10.1016/j.cmet.2013.09.010 24093676 PMC4017327 Youm YH, et al. Canonical Nlrp3 inflammasome links systemic low-grade inflammation to functional decline in aging. Cell Metab. 2013;18(4):519–32. 24093676 10.1016/j.cmet.2013.09.010 PMC4017327 33. Cordero MD Williams MR Ryffel B AMP-activated protein kinase regulation of the NLRP3 inflammasome during aging Trends Endocrinol Metab 2018 29 1 8 17 10.1016/j.tem.2017.10.009 29150317 Cordero MD, Williams MR, Ryffel B. AMP-activated protein kinase regulation of the NLRP3 inflammasome during aging. Trends Endocrinol Metab. 2018;29(1):8–17. 29150317 10.1016/j.tem.2017.10.009 34. Hammond TR Marsh SE Stevens B Immune signaling in neurodegeneration Immunity 2019 50 4 955 974 10.1016/j.immuni.2019.03.016 30995509 PMC6822103 Hammond TR, Marsh SE, Stevens B. Immune signaling in neurodegeneration. Immunity. 2019;50(4):955–74. 30995509 10.1016/j.immuni.2019.03.016 PMC6822103 35. Parodi-Rullán RM Javadov S Fossati S Dissecting the crosstalk between endothelial mitochondrial damage, vascular inflammation, and neurodegeneration in cerebral amyloid angiopathy and Alzheimer’s disease Cells 2021 10 11 2903 10.3390/cells10112903 34831125 PMC8616424 Parodi-Rullán RM, Javadov S, Fossati S. Dissecting the crosstalk between endothelial mitochondrial damage, vascular inflammation, and neurodegeneration in cerebral amyloid angiopathy and Alzheimer’s disease. Cells. 2021;10(11):2903. 34831125 10.3390/cells10112903 PMC8616424 36. Gulen MF cGAS–STING drives ageing-related inflammation and neurodegeneration Nature 2023 620 7973 374 380 10.1038/s41586-023-06373-1 37532932 PMC10412454 Gulen MF, et al. cGAS–STING drives ageing-related inflammation and neurodegeneration. Nature. 2023;620(7973):374–80. 37532932 10.1038/s41586-023-06373-1 PMC10412454 37. Hong S Complement and microglia mediate early synapse loss in Alzheimer mouse models Science 2016 352 6286 712 716 10.1126/science.aad8373 27033548 PMC5094372 Hong S, et al. Complement and microglia mediate early synapse loss in Alzheimer mouse models. Science. 2016;352(6286):712–6. 27033548 10.1126/science.aad8373 PMC5094372 38. Sosna J Early long-term administration of the CSF1R inhibitor PLX3397 ablates microglia and reduces accumulation of intraneuronal amyloid, neuritic plaque deposition and pre-fibrillar oligomers in 5XFAD mouse model of Alzheimer's disease Mol Neurodegener 2018 13 1 11 10.1186/s13024-018-0244-x 29490706 PMC5831225 Sosna J, et al. Early long-term administration of the CSF1R inhibitor PLX3397 ablates microglia and reduces accumulation of intraneuronal amyloid, neuritic plaque deposition and pre-fibrillar oligomers in 5XFAD mouse model of Alzheimer’s disease. Mol Neurodegener. 2018;13(1):11. 29490706 10.1186/s13024-018-0244-x PMC5831225 39. Shi Q Complement C3 deficiency protects against neurodegeneration in aged plaque-rich APP/PS1 mice Sci Transl Med 2017 10.1126/scitranslmed.aaf6295 28566429 PMC6936623 Shi Q, et al. Complement C3 deficiency protects against neurodegeneration in aged plaque-rich APP/PS1 mice. Sci Transl Med. 2017. 10.1126/scitranslmed.aaf6295. 28566429 10.1126/scitranslmed.aaf6295 PMC6936623 40. Hanisch UK Kettenmann H Microglia: active sensor and versatile effector cells in the normal and pathologic brain Nat Neurosci 2007 10 11 1387 1394 10.1038/nn1997 17965659 Hanisch UK, Kettenmann H. Microglia: active sensor and versatile effector cells in the normal and pathologic brain. Nat Neurosci. 2007;10(11):1387–94. 17965659 10.1038/nn1997 41. Bernier LP Microglial metabolic flexibility supports immune surveillance of the brain parenchyma Nat Commun 2020 11 1 1559 10.1038/s41467-020-15267-z 32214088 PMC7096448 Bernier LP, et al. Microglial metabolic flexibility supports immune surveillance of the brain parenchyma. Nat Commun. 2020;11(1):1559. 32214088 10.1038/s41467-020-15267-z PMC7096448 42. Bright F TDP-43 and inflammation: implications for amyotrophic lateral sclerosis and frontotemporal dementia Int J Mol Sci 2021 10.3390/ijms22157781 34360544 PMC8346169 Bright F, et al. TDP-43 and inflammation: implications for amyotrophic lateral sclerosis and frontotemporal dementia. Int J Mol Sci. 2021. 10.3390/ijms22157781. 34360544 10.3390/ijms22157781 PMC8346169 43. Mou Y Gut microbiota interact with the brain through systemic chronic inflammation: implications on neuroinflammation, neurodegeneration, and aging Front Immunol 2022 13 796288 10.3389/fimmu.2022.796288 35464431 PMC9021448 Mou Y, et al. Gut microbiota interact with the brain through systemic chronic inflammation: implications on neuroinflammation, neurodegeneration, and aging. Front Immunol. 2022;13:796288. 35464431 10.3389/fimmu.2022.796288 PMC9021448 44. Park J Kim CH Regulation of common neurological disorders by gut microbial metabolites Exp Mol Med 2021 53 12 1821 1833 10.1038/s12276-021-00703-x 34857900 PMC8741890 Park J, Kim CH. Regulation of common neurological disorders by gut microbial metabolites. Exp Mol Med. 2021;53(12):1821–33. 34857900 10.1038/s12276-021-00703-x PMC8741890 45. Fairley A Diet patterns, the gut microbiome, and Alzheimer's disease J Alzheimers Dis 2022 88 3 933 941 10.3233/JAD-220205 35634849 Fairley A, et al. Diet patterns, the gut microbiome, and Alzheimer’s disease. J Alzheimers Dis. 2022;88(3):933–41. 35634849 10.3233/JAD-220205 46. Zheng X Progranulin deficiency promotes persistent neuroinflammation and causes regional pathology in the hippocampus following traumatic brain injury Glia 2022 70 7 1317 1336 10.1002/glia.24175 35362178 Zheng X, et al. Progranulin deficiency promotes persistent neuroinflammation and causes regional pathology in the hippocampus following traumatic brain injury. Glia. 2022;70(7):1317–36. 35362178 10.1002/glia.24175 47. Duro MV Ebright B Yassine HN Lipids and brain inflammation in APOE4-associated dementia Curr Opin Lipidol 2022 33 1 16 24 10.1097/MOL.0000000000000801 34907965 PMC8769806 Duro MV, Ebright B, Yassine HN. Lipids and brain inflammation in APOE4-associated dementia. Curr Opin Lipidol. 2022;33(1):16–24. 34907965 10.1097/MOL.0000000000000801 PMC8769806 48. Schwartz M Baruch K The resolution of neuroinflammation in neurodegeneration: leukocyte recruitment via the choroid plexus EMBO J 2014 33 1 7 22 10.1002/embj.201386609 24357543 PMC3990679 Schwartz M, Baruch K. The resolution of neuroinflammation in neurodegeneration: leukocyte recruitment via the choroid plexus. EMBO J. 2014;33(1):7–22. 24357543 10.1002/embj.201386609 PMC3990679 49. Zhao L Alzheimer’s disease facts and figures Alzheimers Dement 2020 16 3 391 460 Zhao L. Alzheimer’s disease facts and figures. Alzheimers Dement. 2020;16(3):391–460. 50. Otani K Shichita T Cerebral sterile inflammation in neurodegenerative diseases Inflamm Regen 2020 40 1 28 10.1186/s41232-020-00137-4 33292860 PMC7722432 Otani K, Shichita T. Cerebral sterile inflammation in neurodegenerative diseases. Inflamm Regen. 2020;40(1):28. 33292860 10.1186/s41232-020-00137-4 PMC7722432 51. Villemagne VL Amyloid β deposition, neurodegeneration, and cognitive decline in sporadic Alzheimer's disease: a prospective cohort study Lancet Neurol 2013 12 4 357 367 10.1016/S1474-4422(13)70044-9 23477989 Villemagne VL, et al. Amyloid β deposition, neurodegeneration, and cognitive decline in sporadic Alzheimer’s disease: a prospective cohort study. Lancet Neurol. 2013;12(4):357–67. 23477989 10.1016/S1474-4422(13)70044-9 52. Jack CR Jr Brain β-amyloid load approaches a plateau Neurology 2013 80 10 890 896 10.1212/WNL.0b013e3182840bbe 23446680 PMC3653215 Jack CR Jr, et al. Brain β-amyloid load approaches a plateau. Neurology. 2013;80(10):890–6. 23446680 10.1212/WNL.0b013e3182840bbe PMC3653215 53. Pontecorvo MJ Relationships between flortaucipir PET tau binding and amyloid burden, clinical diagnosis, age and cognition Brain 2017 140 3 748 763 28077397 10.1093/brain/aww334 PMC5382945 Pontecorvo MJ, et al. Relationships between flortaucipir PET tau binding and amyloid burden, clinical diagnosis, age and cognition. Brain. 2017;140(3):748–63. 28077397 10.1093/brain/aww334 PMC5382945 54. Heneka MT Kummer MP Latz E Innate immune activation in neurodegenerative disease Nat Rev Immunol 2014 14 7 463 477 10.1038/nri3705 24962261 Heneka MT, Kummer MP, Latz E. Innate immune activation in neurodegenerative disease. Nat Rev Immunol. 2014;14(7):463–77. 24962261 10.1038/nri3705 55. Zhang Y Toll-like receptor 4 (TLR4) inhibitors: current research and prospective Eur J Med Chem 2022 235 114291 10.1016/j.ejmech.2022.114291 35307617 Zhang Y, et al. Toll-like receptor 4 (TLR4) inhibitors: current research and prospective. Eur J Med Chem. 2022;235:114291. 35307617 10.1016/j.ejmech.2022.114291 56. Wu L Toll-like receptor 4: a promising therapeutic target for Alzheimer’s disease Mediat Inflamm 2022 2022 1 7924199 10.1155/2022/7924199 PMC9420645 36046763 Wu L, et al. Toll-like receptor 4: a promising therapeutic target for Alzheimer’s disease. Mediat Inflamm. 2022;2022(1):7924199. 10.1155/2022/7924199 PMC9420645 36046763 57. Behl T Expatiating the molecular approaches of HMGB1 in diabetes mellitus: highlighting signalling pathways via RAGE and TLRs Mol Biol Rep 2021 48 1869 1881 10.1007/s11033-020-06130-x 33479829 Behl T, et al. Expatiating the molecular approaches of HMGB1 in diabetes mellitus: highlighting signalling pathways via RAGE and TLRs. Mol Biol Rep. 2021;48:1869–81. 33479829 10.1007/s11033-020-06130-x 58. Linnerbauer M Wheeler MA Quintana FJ Astrocyte crosstalk in CNS inflammation Neuron 2020 108 4 608 622 10.1016/j.neuron.2020.08.012 32898475 PMC7704785 Linnerbauer M, Wheeler MA, Quintana FJ. Astrocyte crosstalk in CNS inflammation. Neuron. 2020;108(4):608–22. 32898475 10.1016/j.neuron.2020.08.012 PMC7704785 59. Onyango IG Neuroinflammation in Alzheimer's disease Biomedicines 2021 10.3390/biomedicines9050524 34067173 PMC8150909 Onyango IG, et al. Neuroinflammation in Alzheimer’s disease. Biomedicines. 2021. 10.3390/biomedicines9050524. 34067173 10.3390/biomedicines9050524 PMC8150909 60. Hansen DV Hanson JE Sheng M Microglia in Alzheimer's disease J Cell Biol 2018 217 2 459 472 10.1083/jcb.201709069 29196460 PMC5800817 Hansen DV, Hanson JE, Sheng M. Microglia in Alzheimer’s disease. J Cell Biol. 2018;217(2):459–72. 29196460 10.1083/jcb.201709069 PMC5800817 61. Costantini E D'Angelo C Reale M The role of immunosenescence in neurodegenerative diseases Mediat Inflamm 2018 2018 6039171 10.1155/2018/6039171 PMC5863336 29706800 Costantini E, D’Angelo C, Reale M. The role of immunosenescence in neurodegenerative diseases. Mediat Inflamm. 2018;2018:6039171. 10.1155/2018/6039171 PMC5863336 29706800 62. Meda L Baron P Scarlato G Glial activation in Alzheimer's disease: the role of Abeta and its associated proteins Neurobiol Aging 2001 22 6 885 893 10.1016/S0197-4580(01)00307-4 11754995 Meda L, Baron P, Scarlato G. Glial activation in Alzheimer’s disease: the role of Abeta and its associated proteins. Neurobiol Aging. 2001;22(6):885–93. 11754995 10.1016/s0197-4580(01)00307-4 63. Tan ZS Seshadri S Inflammation in the Alzheimer's disease cascade: culprit or innocent bystander? Alzheimers Res Ther 2010 2 2 6 10.1186/alzrt29 20388190 PMC2876784 Tan ZS, Seshadri S. Inflammation in the Alzheimer’s disease cascade: culprit or innocent bystander? Alzheimers Res Ther. 2010;2(2):6. 20388190 10.1186/alzrt29 PMC2876784 64. Hur JY The innate immunity protein IFITM3 modulates γ-secretase in Alzheimer's disease Nature 2020 586 7831 735 740 10.1038/s41586-020-2681-2 32879487 PMC7919141 Hur JY, et al. The innate immunity protein IFITM3 modulates γ-secretase in Alzheimer’s disease. Nature. 2020;586(7831):735–40. 32879487 10.1038/s41586-020-2681-2 PMC7919141 65. Nisbet RM Tau aggregation and its interplay with amyloid-β Acta Neuropathol 2015 129 2 207 220 10.1007/s00401-014-1371-2 25492702 PMC4305093 Nisbet RM, et al. Tau aggregation and its interplay with amyloid-β. Acta Neuropathol. 2015;129(2):207–20. 25492702 10.1007/s00401-014-1371-2 PMC4305093 66. Yoshiyama Y Synapse loss and microglial activation precede tangles in a P301S tauopathy mouse model Neuron 2007 53 3 337 351 10.1016/j.neuron.2007.01.010 17270732 Yoshiyama Y, et al. Synapse loss and microglial activation precede tangles in a P301S tauopathy mouse model. Neuron. 2007;53(3):337–51. 17270732 10.1016/j.neuron.2007.01.010 67. Maphis N Reactive microglia drive tau pathology and contribute to the spreading of pathological tau in the brain Brain 2015 138 Pt 6 1738 1755 10.1093/brain/awv081 25833819 PMC4542622 Maphis N, et al. Reactive microglia drive tau pathology and contribute to the spreading of pathological tau in the brain. Brain. 2015;138(Pt 6):1738–55. 25833819 10.1093/brain/awv081 PMC4542622 68. Newcombe EA Inflammation: the link between comorbidities, genetics, and Alzheimer's disease J Neuroinflammation 2018 15 1 276 10.1186/s12974-018-1313-3 30249283 PMC6154824 Newcombe EA, et al. Inflammation: the link between comorbidities, genetics, and Alzheimer’s disease. J Neuroinflammation. 2018;15(1):276. 30249283 10.1186/s12974-018-1313-3 PMC6154824 69. Guo T Noble W Hanger DP Roles of tau protein in health and disease Acta Neuropathol 2017 133 5 665 704 10.1007/s00401-017-1707-9 28386764 PMC5390006 Guo T, Noble W, Hanger DP. Roles of tau protein in health and disease. Acta Neuropathol. 2017;133(5):665–704. 28386764 10.1007/s00401-017-1707-9 PMC5390006 70. Glass CK Mechanisms underlying inflammation in neurodegeneration Cell 2010 140 6 918 934 10.1016/j.cell.2010.02.016 20303880 PMC2873093 Glass CK, et al. Mechanisms underlying inflammation in neurodegeneration. Cell. 2010;140(6):918–34. 20303880 10.1016/j.cell.2010.02.016 PMC2873093 71. Liu J Wang F Role of neuroinflammation in amyotrophic lateral sclerosis: cellular mechanisms and therapeutic implications Front Immunol 2017 8 1005 10.3389/fimmu.2017.01005 28871262 PMC5567007 Liu J, Wang F. Role of neuroinflammation in amyotrophic lateral sclerosis: cellular mechanisms and therapeutic implications. Front Immunol. 2017;8:1005. 28871262 10.3389/fimmu.2017.01005 PMC5567007 72. Neumann M Ubiquitinated TDP-43 in frontotemporal lobar degeneration and amyotrophic lateral sclerosis Science 2006 314 5796 130 133 10.1126/science.1134108 17023659 Neumann M, et al. Ubiquitinated TDP-43 in frontotemporal lobar degeneration and amyotrophic lateral sclerosis. Science. 2006;314(5796):130–3. 17023659 10.1126/science.1134108 73. Ingre C Risk factors for amyotrophic lateral sclerosis Clin Epidemiol 2015 7 181 193 25709501 10.2147/CLEP.S37505 PMC4334292 Ingre C, et al. Risk factors for amyotrophic lateral sclerosis. Clin Epidemiol. 2015;7:181–93. 25709501 10.2147/CLEP.S37505 PMC4334292 74. Rubino V Insights on the multifaceted roles of wild-type and mutated superoxide dismutase 1 in amyotrophic lateral sclerosis pathogenesis Antioxidants 2023 12 9 1747 10.3390/antiox12091747 37760050 PMC10525763 Rubino V, et al. Insights on the multifaceted roles of wild-type and mutated superoxide dismutase 1 in amyotrophic lateral sclerosis pathogenesis. Antioxidants. 2023;12(9):1747. 37760050 10.3390/antiox12091747 PMC10525763 75. Xiong L Inflammation-dependent oxidative stress metabolites as a hallmark of amyotrophic lateral sclerosis Free Radic Biol Med 2022 178 125 133 10.1016/j.freeradbiomed.2021.11.031 34871763 PMC8744315 Xiong L, et al. Inflammation-dependent oxidative stress metabolites as a hallmark of amyotrophic lateral sclerosis. Free Radic Biol Med. 2022;178:125–33. 34871763 10.1016/j.freeradbiomed.2021.11.031 PMC8744315 76. Yu CH TDP-43 triggers mitochondrial DNA release via mPTP to activate cGAS/STING in ALS Cell 2020 183 3 636 649 10.1016/j.cell.2020.09.020 33031745 PMC7599077 Yu CH, et al. TDP-43 triggers mitochondrial DNA release via mPTP to activate cGAS/STING in ALS. Cell. 2020;183(3):636–49. 33031745 10.1016/j.cell.2020.09.020 PMC7599077 77. Calió ML Mitochondrial dysfunction, neurogenesis, and epigenetics: putative implications for amyotrophic lateral sclerosis neurodegeneration and treatment Front Neurosci 2020 14 679 10.3389/fnins.2020.00679 32760239 PMC7373761 Calió ML, et al. Mitochondrial dysfunction, neurogenesis, and epigenetics: putative implications for amyotrophic lateral sclerosis neurodegeneration and treatment. Front Neurosci. 2020;14:679. 32760239 10.3389/fnins.2020.00679 PMC7373761 78. Peggion C SOD1 in ALS: taking stock in pathogenic mechanisms and the role of glial and muscle cells Antioxidants 2022 11 4 614 10.3390/antiox11040614 35453299 PMC9032988 Peggion C, et al. SOD1 in ALS: taking stock in pathogenic mechanisms and the role of glial and muscle cells. Antioxidants. 2022;11(4):614. 35453299 10.3390/antiox11040614 PMC9032988 79. Zhao W TDP-43 activates microglia through NF-κB and NLRP3 inflammasome Exp Neurol 2015 273 24 35 10.1016/j.expneurol.2015.07.019 26222336 Zhao W, et al. TDP-43 activates microglia through NF-κB and NLRP3 inflammasome. Exp Neurol. 2015;273:24–35. 26222336 10.1016/j.expneurol.2015.07.019 80. Urushitani M Chromogranin-mediated secretion of mutant superoxide dismutase proteins linked to amyotrophic lateral sclerosis Nat Neurosci 2006 9 1 108 118 10.1038/nn1603 16369483 Urushitani M, et al. Chromogranin-mediated secretion of mutant superoxide dismutase proteins linked to amyotrophic lateral sclerosis. Nat Neurosci. 2006;9(1):108–18. 16369483 10.1038/nn1603 81. Kaur J Singh H Naqvi S Intracellular DAMPs in neurodegeneration and their role in clinical therapeutics Mol Neurobiol 2023 60 7 3600 3616 10.1007/s12035-023-03289-9 36859688 Kaur J, Singh H, Naqvi S. Intracellular DAMPs in neurodegeneration and their role in clinical therapeutics. Mol Neurobiol. 2023;60(7):3600–16. 36859688 10.1007/s12035-023-03289-9 82. Béland LC Immunity in amyotrophic lateral sclerosis: blurred lines between excessive inflammation and inefficient immune responses Brain Commun 2020 10.1093/braincomms/fcaa124 33134918 PMC7585698 Béland LC, et al. Immunity in amyotrophic lateral sclerosis: blurred lines between excessive inflammation and inefficient immune responses. Brain Commun. 2020. 10.1093/braincomms/fcaa124. 33134918 10.1093/braincomms/fcaa124 PMC7585698 83. Turner MR Autoimmune disease preceding amyotrophic lateral sclerosis: an epidemiologic study Neurology 2013 81 14 1222 1225 10.1212/WNL.0b013e3182a6cc13 23946298 PMC3795611 Turner MR, et al. Autoimmune disease preceding amyotrophic lateral sclerosis: an epidemiologic study. Neurology. 2013;81(14):1222–5. 23946298 10.1212/WNL.0b013e3182a6cc13 PMC3795611 84. Li CY Genome-wide genetic links between amyotrophic lateral sclerosis and autoimmune diseases BMC Med 2021 19 1 27 10.1186/s12916-021-01903-y 33541344 PMC7863260 Li CY, et al. Genome-wide genetic links between amyotrophic lateral sclerosis and autoimmune diseases. BMC Med. 2021;19(1):27. 33541344 10.1186/s12916-021-01903-y PMC7863260 85. Tansey MG Inflammation and immune dysfunction in Parkinson disease Nat Rev Immunol 2022 22 11 657 673 10.1038/s41577-022-00684-6 35246670 PMC8895080 Tansey MG, et al. Inflammation and immune dysfunction in Parkinson disease. Nat Rev Immunol. 2022;22(11):657–73. 35246670 10.1038/s41577-022-00684-6 PMC8895080 86. Kordower JH Disease duration and the integrity of the nigrostriatal system in Parkinson's disease Brain 2013 136 Pt 8 2419 2431 10.1093/brain/awt192 23884810 PMC3722357 Kordower JH, et al. Disease duration and the integrity of the nigrostriatal system in Parkinson’s disease. Brain. 2013;136(Pt 8):2419–31. 23884810 10.1093/brain/awt192 PMC3722357 87. Gundersen V Parkinson's disease: can targeting inflammation be an effective neuroprotective strategy? Front Neurosci 2020 14 580311 10.3389/fnins.2020.580311 33716638 PMC7946840 Gundersen V. Parkinson’s disease: can targeting inflammation be an effective neuroprotective strategy? Front Neurosci. 2020;14:580311. 33716638 10.3389/fnins.2020.580311 PMC7946840 88. McGeer PL Reactive microglia are positive for HLA-DR in the substantia nigra of Parkinson's and Alzheimer's disease brains Neurology 1988 38 8 1285 1291 10.1212/WNL.38.8.1285 3399080 McGeer PL, et al. Reactive microglia are positive for HLA-DR in the substantia nigra of Parkinson’s and Alzheimer’s disease brains. Neurology. 1988;38(8):1285–91. 3399080 10.1212/wnl.38.8.1285 89. Milber JM Lewy pathology is not the first sign of degeneration in vulnerable neurons in Parkinson disease Neurology 2012 79 24 2307 2314 10.1212/WNL.0b013e318278fe32 23152586 PMC3578379 Milber JM, et al. Lewy pathology is not the first sign of degeneration in vulnerable neurons in Parkinson disease. Neurology. 2012;79(24):2307–14. 23152586 10.1212/WNL.0b013e318278fe32 PMC3578379 90. Luk KC Pathological α-synuclein transmission initiates Parkinson-like neurodegeneration in nontransgenic mice Science 2012 338 6109 949 953 10.1126/science.1227157 23161999 PMC3552321 Luk KC, et al. Pathological α-synuclein transmission initiates Parkinson-like neurodegeneration in nontransgenic mice. Science. 2012;338(6109):949–53. 23161999 10.1126/science.1227157 PMC3552321 91. Tofaris GK Initiation and progression of α-synuclein pathology in Parkinson’s disease Cell Mol Life Sci 2022 79 4 210 10.1007/s00018-022-04240-2 35347432 PMC8960654 Tofaris GK. Initiation and progression of α-synuclein pathology in Parkinson’s disease. Cell Mol Life Sci. 2022;79(4):210. 35347432 10.1007/s00018-022-04240-2 PMC8960654 92. Haque ME Targeting α-synuclein aggregation and its role in mitochondrial dysfunction in Parkinson's disease Br J Pharmacol 2022 179 1 23 45 10.1111/bph.15684 34528272 Haque ME, et al. Targeting α-synuclein aggregation and its role in mitochondrial dysfunction in Parkinson’s disease. Br J Pharmacol. 2022;179(1):23–45. 34528272 10.1111/bph.15684 93. Zhang W Aggregated alpha-synuclein activates microglia: a process leading to disease progression in Parkinson's disease Faseb J 2005 19 6 533 542 10.1096/fj.04-2751com 15791003 Zhang W, et al. Aggregated alpha-synuclein activates microglia: a process leading to disease progression in Parkinson’s disease. Faseb J. 2005;19(6):533–42. 15791003 10.1096/fj.04-2751com 94. Acuña L Rifampicin and its derivative rifampicin quinone reduce microglial inflammatory responses and neurodegeneration induced in vitro by α-synuclein fibrillary aggregates Cells 2019 10.3390/cells8080776 31349736 PMC6721546 Acuña L, et al. Rifampicin and its derivative rifampicin quinone reduce microglial inflammatory responses and neurodegeneration induced in vitro by α-synuclein fibrillary aggregates. Cells. 2019. 10.3390/cells8080776. 31349736 10.3390/cells8080776 PMC6721546 95. Ludtmann MHR Α-synuclein oligomers interact with ATP synthase and open the permeability transition pore in Parkinson's disease Nat Commun 2018 9 1 2293 10.1038/s41467-018-04422-2 29895861 PMC5997668 Ludtmann MHR, et al. Α-synuclein oligomers interact with ATP synthase and open the permeability transition pore in Parkinson’s disease. Nat Commun. 2018;9(1):2293. 29895861 10.1038/s41467-018-04422-2 PMC5997668 96. Di Maio, R., et al., α-Synuclein binds to TOM20 and inhibits mitochondrial protein import in Parkinson's disease. 8 10.1126/scitranslmed.aaf3634 PMC5016095 27280685 97. Duffy MF Lewy body-like alpha-synuclein inclusions trigger reactive microgliosis prior to nigral degeneration J Neuroinflammation 2018 15 1 129 10.1186/s12974-018-1171-z 29716614 PMC5930695 Duffy MF, et al. Lewy body-like alpha-synuclein inclusions trigger reactive microgliosis prior to nigral degeneration. J Neuroinflammation. 2018;15(1):129. 29716614 10.1186/s12974-018-1171-z PMC5930695 98. Krashia P Blunting neuroinflammation with resolvin D1 prevents early pathology in a rat model of Parkinson's disease Nat Commun 2019 10 1 3945 10.1038/s41467-019-11928-w 31477726 PMC6718379 Krashia P, et al. Blunting neuroinflammation with resolvin D1 prevents early pathology in a rat model of Parkinson’s disease. Nat Commun. 2019;10(1):3945. 31477726 10.1038/s41467-019-11928-w PMC6718379 99. Cardinale A Calabrese V The intricate debate on neurodegeneration and neuroinflammation in Parkinson's disease: which came first? Neural Regen Res 2023 18 1 125 126 10.4103/1673-5374.343895 35799526 PMC9241404 Cardinale A, Calabrese V. The intricate debate on neurodegeneration and neuroinflammation in Parkinson’s disease: which came first? Neural Regen Res. 2023;18(1):125–6. 35799526 10.4103/1673-5374.343895 PMC9241404 100. Kim C Neuron-released oligomeric α-synuclein is an endogenous agonist of TLR2 for paracrine activation of microglia Nat Commun 2013 4 1562 10.1038/ncomms2534 23463005 PMC4089961 Kim C, et al. Neuron-released oligomeric α-synuclein is an endogenous agonist of TLR2 for paracrine activation of microglia. Nat Commun. 2013;4:1562. 23463005 10.1038/ncomms2534 PMC4089961 101. Choi I Microglia clear neuron-released α-synuclein via selective autophagy and prevent neurodegeneration Nat Commun 2020 11 1 1386 10.1038/s41467-020-15119-w 32170061 PMC7069981 Choi I, et al. Microglia clear neuron-released α-synuclein via selective autophagy and prevent neurodegeneration. Nat Commun. 2020;11(1):1386. 32170061 10.1038/s41467-020-15119-w PMC7069981 102. Grozdanov V Increased immune activation by pathologic α-synuclein in Parkinson's disease Ann Neurol 2019 86 4 593 606 10.1002/ana.25557 31343083 Grozdanov V, et al. Increased immune activation by pathologic α-synuclein in Parkinson’s disease. Ann Neurol. 2019;86(4):593–606. 31343083 10.1002/ana.25557 103. Chavarría C Ivagnes R Souza JM Extracellular alpha-synuclein: mechanisms for glial cell internalization and activation Biomolecules 2022 10.3390/biom12050655 35625583 PMC9138387 Chavarría C, Ivagnes R, Souza JM. Extracellular alpha-synuclein: mechanisms for glial cell internalization and activation. Biomolecules. 2022. 10.3390/biom12050655. 35625583 10.3390/biom12050655 PMC9138387 104. Pajares M Inflammation in Parkinson's disease: mechanisms and therapeutic implications Cells 2020 10.3390/cells9071687 32674367 PMC7408280 Pajares M, et al. Inflammation in Parkinson’s disease: mechanisms and therapeutic implications. Cells. 2020. 10.3390/cells9071687. 32674367 10.3390/cells9071687 PMC7408280 105. Kawahata I Finkelstein DI Fukunaga K Pathogenic impact of α-synuclein phosphorylation and its kinases in α-synucleinopathies Int J Mol Sci 2022 10.3390/ijms23116216 35682892 PMC9181156 Kawahata I, Finkelstein DI, Fukunaga K. Pathogenic impact of α-synuclein phosphorylation and its kinases in α-synucleinopathies. Int J Mol Sci. 2022. 10.3390/ijms23116216. 35682892 10.3390/ijms23116216 PMC9181156 106. Reimer L Inflammation kinase PKR phosphorylates α-synuclein and causes α-synuclein-dependent cell death Neurobiol Dis 2018 115 17 28 10.1016/j.nbd.2018.03.001 29501855 Reimer L, et al. Inflammation kinase PKR phosphorylates α-synuclein and causes α-synuclein-dependent cell death. Neurobiol Dis. 2018;115:17–28. 29501855 10.1016/j.nbd.2018.03.001 107. Ghanem SS α-Synuclein phosphorylation at serine 129 occurs after initial protein deposition and inhibits seeded fibril formation and toxicity Proc Natl Acad Sci U S A 2022 119 15 e2109617119 10.1073/pnas.2109617119 35353605 PMC9169642 Ghanem SS, et al. α-Synuclein phosphorylation at serine 129 occurs after initial protein deposition and inhibits seeded fibril formation and toxicity. Proc Natl Acad Sci U S A. 2022;119(15):e2109617119. 35353605 10.1073/pnas.2109617119 PMC9169642 108. Kasen A Upregulation of α-synuclein following immune activation: possible trigger of Parkinson's disease Neurobiol Dis 2022 166 105654 10.1016/j.nbd.2022.105654 35143968 Kasen A, et al. Upregulation of α-synuclein following immune activation: possible trigger of Parkinson’s disease. Neurobiol Dis. 2022;166:105654. 35143968 10.1016/j.nbd.2022.105654 109. Xia Y Reactive microglia enhance the transmission of exosomal α-synuclein via toll-like receptor 2 Brain 2021 144 7 2024 2037 10.1093/brain/awab122 33792662 Xia Y, et al. Reactive microglia enhance the transmission of exosomal α-synuclein via toll-like receptor 2. Brain. 2021;144(7):2024–37. 33792662 10.1093/brain/awab122 110. Olanow CW Temporal evolution of microglia and α-synuclein accumulation following foetal grafting in Parkinson's disease Brain 2019 142 6 1690 1700 10.1093/brain/awz104 31056668 Olanow CW, et al. Temporal evolution of microglia and α-synuclein accumulation following foetal grafting in Parkinson’s disease. Brain. 2019;142(6):1690–700. 31056668 10.1093/brain/awz104 111. Scheiblich H Microglia jointly degrade fibrillar alpha-synuclein cargo by distribution through tunneling nanotubes Cell 2021 10.1016/j.cell.2021.09.007 34555357 PMC8527836 Scheiblich H, et al. Microglia jointly degrade fibrillar alpha-synuclein cargo by distribution through tunneling nanotubes. Cell. 2021. 10.1016/j.cell.2021.09.007. 34555357 10.1016/j.cell.2021.09.007 PMC8527836 112. Rostami J Crosstalk between astrocytes and microglia results in increased degradation of α-synuclein and amyloid-β aggregates J Neuroinflammation 2021 18 1 124 10.1186/s12974-021-02158-3 34082772 PMC8173980 Rostami J, et al. Crosstalk between astrocytes and microglia results in increased degradation of α-synuclein and amyloid-β aggregates. J Neuroinflammation. 2021;18(1):124. 34082772 10.1186/s12974-021-02158-3 PMC8173980 113. Sulzer D T cells from patients with Parkinson's disease recognize α-synuclein peptides Nature 2017 546 7660 656 661 10.1038/nature22815 28636593 PMC5626019 Sulzer D, et al. T cells from patients with Parkinson’s disease recognize α-synuclein peptides. Nature. 2017;546(7660):656–61. 28636593 10.1038/nature22815 PMC5626019 114. Lindestam Arlehamn CS Α-synuclein-specific T cell reactivity is associated with preclinical and early Parkinson's disease Nat Commun 2020 11 1 1875 10.1038/s41467-020-15626-w 32313102 PMC7171193 Lindestam Arlehamn CS, et al. Α-synuclein-specific T cell reactivity is associated with preclinical and early Parkinson’s disease. Nat Commun. 2020;11(1):1875. 32313102 10.1038/s41467-020-15626-w PMC7171193 115. Karikari AA Neurodegeneration by α-synuclein-specific T cells in AAV-A53T-α-synuclein Parkinson's disease mice Brain Behav Immun 2022 101 194 210 10.1016/j.bbi.2022.01.007 35032575 Karikari AA, et al. Neurodegeneration by α-synuclein-specific T cells in AAV-A53T-α-synuclein Parkinson’s disease mice. Brain Behav Immun. 2022;101:194–210. 35032575 10.1016/j.bbi.2022.01.007 116. Tabrizi SJ Potential disease-modifying therapies for Huntington's disease: lessons learned and future opportunities Lancet Neurol 2022 21 7 645 658 10.1016/S1474-4422(22)00121-1 35716694 PMC7613206 Tabrizi SJ, et al. Potential disease-modifying therapies for Huntington’s disease: lessons learned and future opportunities. Lancet Neurol. 2022;21(7):645–58. 35716694 10.1016/S1474-4422(22)00121-1 PMC7613206 117. Tabrizi SJ A biological classification of Huntington's disease: the integrated staging system Lancet Neurol 2022 21 7 632 644 10.1016/S1474-4422(22)00120-X 35716693 Tabrizi SJ, et al. A biological classification of Huntington’s disease: the integrated staging system. Lancet Neurol. 2022;21(7):632–44. 35716693 10.1016/S1474-4422(22)00120-X 118. Iennaco R The evolutionary history of the polyQ tract in huntingtin sheds light on its functional pro-neural activities Cell Death Differ 2022 29 2 293 305 10.1038/s41418-021-00914-9 34974533 PMC8817008 Iennaco R, et al. The evolutionary history of the polyQ tract in huntingtin sheds light on its functional pro-neural activities. Cell Death Differ. 2022;29(2):293–305. 34974533 10.1038/s41418-021-00914-9 PMC8817008 119. Aviner R Ribotoxic collisions on CAG expansions disrupt proteostasis and stress responses in Huntington’s disease BiorXiv 2022 10.1038/s41556-024-01414-x Aviner R, et al. Ribotoxic collisions on CAG expansions disrupt proteostasis and stress responses in Huntington’s disease. BiorXiv. 2022. 10.1038/s41556-024-01414-x. 120. Aviner R Polyglutamine-mediated ribotoxicity disrupts proteostasis and stress responses in Huntington’s disease Nat Cell Biol 2024 26 6 892 902 10.1038/s41556-024-01414-x 38741019 PMC12288859 Aviner R, et al. Polyglutamine-mediated ribotoxicity disrupts proteostasis and stress responses in Huntington’s disease. Nat Cell Biol. 2024;26(6):892–902. 38741019 10.1038/s41556-024-01414-x PMC12288859 121. Ranganathan M Age of onset and behavioral manifestations in Huntington's disease: an enroll-HD cohort analysis Clin Genet 2021 99 1 133 142 10.1111/cge.13857 33020896 Ranganathan M, et al. Age of onset and behavioral manifestations in Huntington’s disease: an enroll-HD cohort analysis. Clin Genet. 2021;99(1):133–42. 33020896 10.1111/cge.13857 122. Warner JH Standardizing the CAP score in Huntington’s disease by predicting age-at-onset J Huntingtons Dis 2022 11 2 153 171 10.3233/JHD-210475 35466943 Warner JH, et al. Standardizing the CAP score in Huntington’s disease by predicting age-at-onset. J Huntingtons Dis. 2022;11(2):153–71. 35466943 10.3233/JHD-210475 123. Hong EP Huntington’s disease pathogenesis: two sequential components J Huntingtons Dis 2021 10 1 35 51 10.3233/JHD-200427 33579862 PMC7990433 Hong EP, et al. Huntington’s disease pathogenesis: two sequential components. J Huntingtons Dis. 2021;10(1):35–51. 33579862 10.3233/JHD-200427 PMC7990433 124. Du G Altered gut microbiota related to inflammatory responses in patients with Huntington’s disease Front Immunol 2021 11 603594 10.3389/fimmu.2020.603594 33679692 PMC7933529 Du G, et al. Altered gut microbiota related to inflammatory responses in patients with Huntington’s disease. Front Immunol. 2021;11:603594. 33679692 10.3389/fimmu.2020.603594 PMC7933529 125. Jia Q Neuroinflammation in Huntington’s disease: from animal models to clinical therapeutics Front Immunol 2022 13 1088124 10.3389/fimmu.2022.1088124 36618375 PMC9815700 Jia Q, et al. Neuroinflammation in Huntington’s disease: from animal models to clinical therapeutics. Front Immunol. 2022;13:1088124. 36618375 10.3389/fimmu.2022.1088124 PMC9815700 126. Khaboushan AS Circulating levels of inflammatory biomarkers in Huntington's disease: a systematic review and meta-analysis J Neuroimmunol 2023 385 578243 10.1016/j.jneuroim.2023.578243 37984118 Khaboushan AS, et al. Circulating levels of inflammatory biomarkers in Huntington’s disease: a systematic review and meta-analysis. J Neuroimmunol. 2023;385:578243. 37984118 10.1016/j.jneuroim.2023.578243 127. Bilal H Associations of inflammatory cytokines and cortisol with nonmotor features of Huntington's disease Ann Clin Transl Neurol 2024 11 4 989 999 10.1002/acn3.52016 38356101 PMC11021624 Bilal H, et al. Associations of inflammatory cytokines and cortisol with nonmotor features of Huntington’s disease. Ann Clin Transl Neurol. 2024;11(4):989–99. 38356101 10.1002/acn3.52016 PMC11021624 128. Jambi EJ 6-shogaol against 3-nitropropionic acid-induced Huntington’s disease in rodents: based on molecular docking/targeting pro-inflammatory cytokines/NF-κB-BDNF-Nrf2 pathway PLoS ONE 2024 19 7 e0305358 10.1371/journal.pone.0305358 39008492 PMC11249262 Jambi EJ, et al. 6-shogaol against 3-nitropropionic acid-induced Huntington’s disease in rodents: based on molecular docking/targeting pro-inflammatory cytokines/NF-κB-BDNF-Nrf2 pathway. PLoS ONE. 2024;19(7):e0305358. 39008492 10.1371/journal.pone.0305358 PMC11249262 129. Saba J Neuroinflammation in Huntington’s disease: a starring role for astrocyte and microglia Curr Neuropharmacol 2022 20 6 1116 1143 10.2174/1570159X19666211201094608 34852742 PMC9886821 Saba J, et al. Neuroinflammation in Huntington’s disease: a starring role for astrocyte and microglia. Curr Neuropharmacol. 2022;20(6):1116–43. 34852742 10.2174/1570159X19666211201094608 PMC9886821 130. Khakh BS Goldman SA Astrocytic contributions to Huntington's disease pathophysiology Ann N Y Acad Sci 2023 1522 1 42 59 10.1111/nyas.14977 36864567 PMC10145027 Khakh BS, Goldman SA. Astrocytic contributions to Huntington’s disease pathophysiology. Ann N Y Acad Sci. 2023;1522(1):42–59. 36864567 10.1111/nyas.14977 PMC10145027 131. Gómez-Jaramillo L A new perspective on Huntington’s disease: how a neurological disorder influences the peripheral tissues Int J Mol Sci 2022 23 11 6089 10.3390/ijms23116089 35682773 PMC9181740 Gómez-Jaramillo L, et al. A new perspective on Huntington’s disease: how a neurological disorder influences the peripheral tissues. Int J Mol Sci. 2022;23(11):6089. 35682773 10.3390/ijms23116089 PMC9181740 132. de Oliveira Furlam T Inflammasome activation and assembly in Huntington’s disease Mol Immunol 2022 151 134 142 10.1016/j.molimm.2022.09.002 36126501 de Oliveira Furlam T, et al. Inflammasome activation and assembly in Huntington’s disease. Mol Immunol. 2022;151:134–42. 36126501 10.1016/j.molimm.2022.09.002 133. Paldino E Fusco FR Emerging role of NLRP3 inflammasome/pyroptosis in Huntington’s disease Int J Mol Sci 2022 23 15 8363 10.3390/ijms23158363 35955494 PMC9368941 Paldino E, Fusco FR. Emerging role of NLRP3 inflammasome/pyroptosis in Huntington’s disease. Int J Mol Sci. 2022;23(15):8363. 35955494 10.3390/ijms23158363 PMC9368941 134. Markowitz CE Multiple sclerosis update Am J Manag Care 2013 19 16 Suppl s294 300 24494618 Markowitz CE. Multiple sclerosis update. Am J Manag Care. 2013;19(16 Suppl):s294-300. 24494618 135. Latz E Xiao TS Stutz A Activation and regulation of the inflammasomes Nat Rev Immunol 2013 13 6 397 411 10.1038/nri3452 23702978 PMC3807999 Latz E, Xiao TS, Stutz A. Activation and regulation of the inflammasomes. Nat Rev Immunol. 2013;13(6):397–411. 23702978 10.1038/nri3452 PMC3807999 136. Miao EA Rajan JV Aderem A Caspase-1-induced pyroptotic cell death Immunol Rev 2011 243 1 206 214 10.1111/j.1600-065X.2011.01044.x 21884178 PMC3609431 Miao EA, Rajan JV, Aderem A. Caspase-1-induced pyroptotic cell death. Immunol Rev. 2011;243(1):206–14. 21884178 10.1111/j.1600-065X.2011.01044.x PMC3609431 137. Takeuchi O Akira S Pattern recognition receptors and inflammation Cell 2010 140 6 805 820 10.1016/j.cell.2010.01.022 20303872 Takeuchi O, Akira S. Pattern recognition receptors and inflammation. Cell. 2010;140(6):805–20. 20303872 10.1016/j.cell.2010.01.022 138. Vajjhala PR Mirams RE Hill JM Multiple binding sites on the pyrin domain of ASC protein allow self-association and interaction with NLRP3 protein J Biol Chem 2012 287 50 41732 41743 10.1074/jbc.M112.381228 23066025 PMC3516722 Vajjhala PR, Mirams RE, Hill JM. Multiple binding sites on the pyrin domain of ASC protein allow self-association and interaction with NLRP3 protein. J Biol Chem. 2012;287(50):41732–43. 23066025 10.1074/jbc.M112.381228 PMC3516722 139. Zhou R A role for mitochondria in NLRP3 inflammasome activation Nature 2011 469 7329 221 225 10.1038/nature09663 21124315 Zhou R, et al. A role for mitochondria in NLRP3 inflammasome activation. Nature. 2011;469(7329):221–5. 21124315 10.1038/nature09663 140. Misawa T Microtubule-driven spatial arrangement of mitochondria promotes activation of the NLRP3 inflammasome Nat Immunol 2013 14 5 454 460 10.1038/ni.2550 23502856 Misawa T, et al. Microtubule-driven spatial arrangement of mitochondria promotes activation of the NLRP3 inflammasome. Nat Immunol. 2013;14(5):454–60. 23502856 10.1038/ni.2550 141. Mariathasan S Differential activation of the inflammasome by caspase-1 adaptors ASC and Ipaf Nature 2004 430 6996 213 218 10.1038/nature02664 15190255 Mariathasan S, et al. Differential activation of the inflammasome by caspase-1 adaptors ASC and Ipaf. Nature. 2004;430(6996):213–8. 15190255 10.1038/nature02664 142. Van Opdenbosch N Activation of the NLRP1b inflammasome independently of ASC-mediated caspase-1 autoproteolysis and speck formation Nat Commun 2014 5 3209 10.1038/ncomms4209 24492532 PMC3926011 Van Opdenbosch N, et al. Activation of the NLRP1b inflammasome independently of ASC-mediated caspase-1 autoproteolysis and speck formation. Nat Commun. 2014;5:3209. 24492532 10.1038/ncomms4209 PMC3926011 143. Martinon F Burns K Tschopp J The inflammasome: a molecular platform triggering activation of inflammatory caspases and processing of proIL-beta Mol Cell 2002 10 2 417 426 10.1016/S1097-2765(02)00599-3 12191486 Martinon F, Burns K, Tschopp J. The inflammasome: a molecular platform triggering activation of inflammatory caspases and processing of proIL-beta. Mol Cell. 2002;10(2):417–26. 12191486 10.1016/s1097-2765(02)00599-3 144. Kesavardhana S Malireddi RKS Kanneganti TD Caspases in cell death, inflammation, and pyroptosis Annu Rev Immunol 2020 38 567 595 10.1146/annurev-immunol-073119-095439 32017655 PMC7190443 Kesavardhana S, Malireddi RKS, Kanneganti TD. Caspases in cell death, inflammation, and pyroptosis. Annu Rev Immunol. 2020;38:567–95. 32017655 10.1146/annurev-immunol-073119-095439 PMC7190443 145. Kayagaki N Caspase-11 cleaves gasdermin D for non-canonical inflammasome signalling Nature 2015 526 7575 666 671 10.1038/nature15541 26375259 Kayagaki N, et al. Caspase-11 cleaves gasdermin D for non-canonical inflammasome signalling. Nature. 2015;526(7575):666–71. 26375259 10.1038/nature15541 146. Shi H Nlrp3 activation and mitosis are mutually exclusive events coordinated by NEK7, a new inflammasome component Nat Immunol 2016 17 3 250 258 10.1038/ni.3333 26642356 PMC4862588 Shi H, et al. Nlrp3 activation and mitosis are mutually exclusive events coordinated by NEK7, a new inflammasome component. Nat Immunol. 2016;17(3):250–8. 26642356 10.1038/ni.3333 PMC4862588 147. Aglietti RA GsmdD p30 elicited by caspase-11 during pyroptosis forms pores in membranes Proc Natl Acad Sci U S A 2016 113 28 7858 7863 10.1073/pnas.1607769113 27339137 PMC4948338 Aglietti RA, et al. GsmdD p30 elicited by caspase-11 during pyroptosis forms pores in membranes. Proc Natl Acad Sci U S A. 2016;113(28):7858–63. 27339137 10.1073/pnas.1607769113 PMC4948338 148. Matikainen S Nyman TA Cypryk W Function and regulation of noncanonical Caspase-4/5/11 inflammasome J Immunol 2020 204 12 3063 3069 10.4049/jimmunol.2000373 32513874 Matikainen S, Nyman TA, Cypryk W. Function and regulation of noncanonical Caspase-4/5/11 inflammasome. J Immunol. 2020;204(12):3063–9. 32513874 10.4049/jimmunol.2000373 149. Awad F Impact of human monocyte and macrophage polarization on NLR expression and NLRP3 inflammasome activation PLoS ONE 2017 12 4 e0175336 10.1371/journal.pone.0175336 28403163 PMC5389804 Awad F, et al. Impact of human monocyte and macrophage polarization on NLR expression and NLRP3 inflammasome activation. PLoS ONE. 2017;12(4):e0175336. 28403163 10.1371/journal.pone.0175336 PMC5389804 150. Heneka MT NLRP3 is activated in Alzheimer's disease and contributes to pathology in APP/PS1 mice Nature 2013 493 7434 674 678 10.1038/nature11729 23254930 PMC3812809 Heneka MT, et al. NLRP3 is activated in Alzheimer’s disease and contributes to pathology in APP/PS1 mice. Nature. 2013;493(7434):674–8. 23254930 10.1038/nature11729 PMC3812809 151. La Rosa F Stavudine reduces NLRP3 inflammasome activation and modulates amyloid-β autophagy J Alzheimers Dis 2019 72 2 401 412 10.3233/JAD-181259 31594217 La Rosa F, et al. Stavudine reduces NLRP3 inflammasome activation and modulates amyloid-β autophagy. J Alzheimers Dis. 2019;72(2):401–12. 31594217 10.3233/JAD-181259 152. Saresella M The NLRP3 and NLRP1 inflammasomes are activated in Alzheimer's disease Mol Neurodegener 2016 11 23 10.1186/s13024-016-0088-1 26939933 PMC4778358 Saresella M, et al. The NLRP3 and NLRP1 inflammasomes are activated in Alzheimer’s disease. Mol Neurodegener. 2016;11:23. 26939933 10.1186/s13024-016-0088-1 PMC4778358 153. Halle A The NALP3 inflammasome is involved in the innate immune response to amyloid-beta Nat Immunol 2008 9 8 857 865 10.1038/ni.1636 18604209 PMC3101478 Halle A, et al. The NALP3 inflammasome is involved in the innate immune response to amyloid-beta. Nat Immunol. 2008;9(8):857–65. 18604209 10.1038/ni.1636 PMC3101478 154. Heneka MT Inflammasome activation and innate immunity in Alzheimer's disease Brain Pathol 2017 27 2 220 222 10.1111/bpa.12483 28019679 PMC8029274 Heneka MT. Inflammasome activation and innate immunity in Alzheimer’s disease. Brain Pathol. 2017;27(2):220–2. 28019679 10.1111/bpa.12483 PMC8029274 155. Dempsey C Inhibiting the NLRP3 inflammasome with MCC950 promotes non-phlogistic clearance of amyloid-β and cognitive function in APP/PS1 mice Brain Behav Immun 2017 61 306 316 10.1016/j.bbi.2016.12.014 28003153 Dempsey C, et al. Inhibiting the NLRP3 inflammasome with MCC950 promotes non-phlogistic clearance of amyloid-β and cognitive function in APP/PS1 mice. Brain Behav Immun. 2017;61:306–16. 28003153 10.1016/j.bbi.2016.12.014 156. Parajuli B Oligomeric amyloid β induces IL-1β processing via production of ROS: implication in Alzheimer's disease Cell Death Dis 2013 4 12 e975 10.1038/cddis.2013.503 24357806 PMC3877570 Parajuli B, et al. Oligomeric amyloid β induces IL-1β processing via production of ROS: implication in Alzheimer’s disease. Cell Death Dis. 2013;4(12):e975. 24357806 10.1038/cddis.2013.503 PMC3877570 157. Kaushal V Neuronal NLRP1 inflammasome activation of caspase-1 coordinately regulates inflammatory interleukin-1-beta production and axonal degeneration-associated caspase-6 activation Cell Death Differ 2015 22 10 1676 1686 10.1038/cdd.2015.16 25744023 PMC4563782 Kaushal V, et al. Neuronal NLRP1 inflammasome activation of caspase-1 coordinately regulates inflammatory interleukin-1-beta production and axonal degeneration-associated caspase-6 activation. Cell Death Differ. 2015;22(10):1676–86. 25744023 10.1038/cdd.2015.16 PMC4563782 158. Gris D Nlrp3 plays a critical role in the development of experimental autoimmune encephalomyelitis by mediating Th1 and Th17 responses J Immunol 2010 185 2 974 981 10.4049/jimmunol.0904145 20574004 PMC3593010 Gris D, et al. Nlrp3 plays a critical role in the development of experimental autoimmune encephalomyelitis by mediating Th1 and Th17 responses. J Immunol. 2010;185(2):974–81. 20574004 10.4049/jimmunol.0904145 PMC3593010 159. Ransohoff RM Animal models of multiple sclerosis: the good, the bad and the bottom line Nat Neurosci 2012 15 8 1074 1077 10.1038/nn.3168 22837037 PMC7097342 Ransohoff RM. Animal models of multiple sclerosis: the good, the bad and the bottom line. Nat Neurosci. 2012;15(8):1074–7. 22837037 10.1038/nn.3168 PMC7097342 160. Peelen E Increased inflammasome related gene expression profile in PBMC may facilitate T helper 17 cell induction in multiple sclerosis Mol Immunol 2015 63 2 521 529 10.1016/j.molimm.2014.10.008 25458313 Peelen E, et al. Increased inflammasome related gene expression profile in PBMC may facilitate T helper 17 cell induction in multiple sclerosis. Mol Immunol. 2015;63(2):521–9. 25458313 10.1016/j.molimm.2014.10.008 161. Inoue M Shinohara ML NLRP3 Inflammasome and MS/EAE Autoimmune Dis 2013 2013 859145 23365725 10.1155/2013/859145 PMC3556409 Inoue M, Shinohara ML. NLRP3 Inflammasome and MS/EAE. Autoimmune Dis. 2013;2013:859145. 23365725 10.1155/2013/859145 PMC3556409 162. Mamik MK Power C Inflammasomes in neurological diseases: emerging pathogenic and therapeutic concepts Brain 2017 140 9 2273 2285 10.1093/brain/awx133 29050380 Mamik MK, Power C. Inflammasomes in neurological diseases: emerging pathogenic and therapeutic concepts. Brain. 2017;140(9):2273–85. 29050380 10.1093/brain/awx133 163. Furlan R Peripheral levels of caspase-1 mRNA correlate with disease activity in patients with multiple sclerosis; a preliminary study J Neurol Neurosurg Psychiatry 1999 67 6 785 788 10.1136/jnnp.67.6.785 10567499 PMC1736665 Furlan R, et al. Peripheral levels of caspase-1 mRNA correlate with disease activity in patients with multiple sclerosis; a preliminary study. J Neurol Neurosurg Psychiatry. 1999;67(6):785–8. 10567499 10.1136/jnnp.67.6.785 PMC1736665 164. Ming X Caspase-1 expression in multiple sclerosis plaques and cultured glial cells J Neurol Sci 2002 197 1–2 9 18 10.1016/S0022-510X(02)00030-8 11997061 Ming X, et al. Caspase-1 expression in multiple sclerosis plaques and cultured glial cells. J Neurol Sci. 2002;197(1–2):9–18. 11997061 10.1016/s0022-510x(02)00030-8 165. Keane RW Dietrich WD de Rivero Vaccari JP Inflammasome proteins as biomarkers of multiple sclerosis Front Neurol 2018 9 135 10.3389/fneur.2018.00135 29615953 PMC5868457 Keane RW, Dietrich WD, de Rivero Vaccari JP. Inflammasome proteins as biomarkers of multiple sclerosis. Front Neurol. 2018;9:135. 29615953 10.3389/fneur.2018.00135 PMC5868457 166. Losy J Niezgoda A IL-18 in patients with multiple sclerosis Acta Neurol Scand 2001 104 3 171 173 10.1034/j.1600-0404.2001.00356.x 11551238 Losy J, Niezgoda A. IL-18 in patients with multiple sclerosis. Acta Neurol Scand. 2001;104(3):171–3. 11551238 10.1034/j.1600-0404.2001.00356.x 167. Nicoletti F Increased serum levels of interleukin-18 in patients with multiple sclerosis Neurology 2001 57 2 342 344 10.1212/WNL.57.2.342 11468327 Nicoletti F, et al. Increased serum levels of interleukin-18 in patients with multiple sclerosis. Neurology. 2001;57(2):342–4. 11468327 10.1212/wnl.57.2.342 168. Chen YC Serum levels of interleukin (IL)-18, IL-23 and IL-17 in Chinese patients with multiple sclerosis J Neuroimmunol 2012 243 1–2 56 60 10.1016/j.jneuroim.2011.12.008 22230485 Chen YC, et al. Serum levels of interleukin (IL)-18, IL-23 and IL-17 in Chinese patients with multiple sclerosis. J Neuroimmunol. 2012;243(1–2):56–60. 22230485 10.1016/j.jneuroim.2011.12.008 169. de Jong BA Production of IL-1beta and IL-1Ra as risk factors for susceptibility and progression of relapse-onset multiple sclerosis J Neuroimmunol 2002 126 1–2 172 179 10.1016/S0165-5728(02)00056-5 12020968 de Jong BA, et al. Production of IL-1beta and IL-1Ra as risk factors for susceptibility and progression of relapse-onset multiple sclerosis. J Neuroimmunol. 2002;126(1–2):172–9. 12020968 10.1016/s0165-5728(02)00056-5 170. Burger D Glatiramer acetate increases IL-1 receptor antagonist but decreases T cell-induced IL-1beta in human monocytes and multiple sclerosis Proc Natl Acad Sci U S A 2009 106 11 4355 4359 10.1073/pnas.0812183106 19255448 PMC2649955 Burger D, et al. Glatiramer acetate increases IL-1 receptor antagonist but decreases T cell-induced IL-1beta in human monocytes and multiple sclerosis. Proc Natl Acad Sci U S A. 2009;106(11):4355–9. 19255448 10.1073/pnas.0812183106 PMC2649955 171. Nicoletti F Circulating serum levels of IL-1ra in patients with relapsing remitting multiple sclerosis are normal during remission phases but significantly increased either during exacerbations or in response to IFN-beta treatment Cytokine 1996 8 5 395 400 10.1006/cyto.1996.0054 8726668 Nicoletti F, et al. Circulating serum levels of IL-1ra in patients with relapsing remitting multiple sclerosis are normal during remission phases but significantly increased either during exacerbations or in response to IFN-beta treatment. Cytokine. 1996;8(5):395–400. 8726668 10.1006/cyto.1996.0054 172. Codolo G Triggering of inflammasome by aggregated α-synuclein, an inflammatory response in synucleinopathies PLoS ONE 2013 8 1 e55375 10.1371/journal.pone.0055375 23383169 PMC3561263 Codolo G, et al. Triggering of inflammasome by aggregated α-synuclein, an inflammatory response in synucleinopathies. PLoS ONE. 2013;8(1):e55375. 23383169 10.1371/journal.pone.0055375 PMC3561263 173. Yan Y Dopamine controls systemic inflammation through inhibition of NLRP3 inflammasome Cell 2015 160 1–2 62 73 10.1016/j.cell.2014.11.047 25594175 Yan Y, et al. Dopamine controls systemic inflammation through inhibition of NLRP3 inflammasome. Cell. 2015;160(1–2):62–73. 25594175 10.1016/j.cell.2014.11.047 174. Junn E Repression of alpha-synuclein expression and toxicity by microRNA-7 Proc Natl Acad Sci U S A 2009 106 31 13052 13057 10.1073/pnas.0906277106 19628698 PMC2722353 Junn E, et al. Repression of alpha-synuclein expression and toxicity by microRNA-7. Proc Natl Acad Sci U S A. 2009;106(31):13052–7. 19628698 10.1073/pnas.0906277106 PMC2722353 175. Zhou Y Microrna-7 targets Nod-like receptor protein 3 inflammasome to modulate neuroinflammation in the pathogenesis of Parkinson's disease Mol Neurodegener 2016 11 28 10.1186/s13024-016-0094-3 27084336 PMC4833896 Zhou Y, et al. Microrna-7 targets Nod-like receptor protein 3 inflammasome to modulate neuroinflammation in the pathogenesis of Parkinson’s disease. Mol Neurodegener. 2016;11:28. 27084336 10.1186/s13024-016-0094-3 PMC4833896 176. Lee E MPTP-driven NLRP3 inflammasome activation in microglia plays a central role in dopaminergic neurodegeneration Cell Death Differ 2019 26 2 213 228 10.1038/s41418-018-0124-5 29786072 PMC6329843 Lee E, et al. MPTP-driven NLRP3 inflammasome activation in microglia plays a central role in dopaminergic neurodegeneration. Cell Death Differ. 2019;26(2):213–28. 29786072 10.1038/s41418-018-0124-5 PMC6329843 177. Daniels MJ Fenamate NSAIDs inhibit the NLRP3 inflammasome and protect against Alzheimer's disease in rodent models Nat Commun 2016 7 12504 10.1038/ncomms12504 27509875 PMC4987536 Daniels MJ, et al. Fenamate NSAIDs inhibit the NLRP3 inflammasome and protect against Alzheimer’s disease in rodent models. Nat Commun. 2016;7:12504. 27509875 10.1038/ncomms12504 PMC4987536 178. McCombe PA Henderson RD The role of immune and inflammatory mechanisms in ALS Curr Mol Med 2011 11 3 246 254 10.2174/156652411795243450 21375489 PMC3182412 McCombe PA, Henderson RD. The role of immune and inflammatory mechanisms in ALS. Curr Mol Med. 2011;11(3):246–54. 21375489 10.2174/156652411795243450 PMC3182412 179. Lall D Baloh RH Microglia and C9orf72 in neuroinflammation and ALS and frontotemporal dementia J Clin Invest 2017 127 9 3250 3258 10.1172/JCI90607 28737506 PMC5669558 Lall D, Baloh RH. Microglia and C9orf72 in neuroinflammation and ALS and frontotemporal dementia. J Clin Invest. 2017;127(9):3250–8. 28737506 10.1172/JCI90607 PMC5669558 180. Meissner F Molawi K Zychlinsky A Mutant superoxide dismutase 1-induced IL-1beta accelerates ALS pathogenesis Proc Natl Acad Sci U S A 2010 107 29 13046 13050 10.1073/pnas.1002396107 20616033 PMC2919927 Meissner F, Molawi K, Zychlinsky A. Mutant superoxide dismutase 1-induced IL-1beta accelerates ALS pathogenesis. Proc Natl Acad Sci U S A. 2010;107(29):13046–50. 20616033 10.1073/pnas.1002396107 PMC2919927 181. Debye B Neurodegeneration and NLRP3 inflammasome expression in the anterior thalamus of SOD1(G93A) ALS mice Brain Pathol 2018 28 1 14 27 10.1111/bpa.12467 27880990 PMC8028558 Debye B, et al. Neurodegeneration and NLRP3 inflammasome expression in the anterior thalamus of SOD1(G93A) ALS mice. Brain Pathol. 2018;28(1):14–27. 27880990 10.1111/bpa.12467 PMC8028558 182. Johann S NLRP3 inflammasome is expressed by astrocytes in the SOD1 mouse model of ALS and in human sporadic ALS patients Glia 2015 63 12 2260 2273 10.1002/glia.22891 26200799 Johann S, et al. NLRP3 inflammasome is expressed by astrocytes in the SOD1 mouse model of ALS and in human sporadic ALS patients. Glia. 2015;63(12):2260–73. 26200799 10.1002/glia.22891 183. Mathis D Shoelson SE Immunometabolism: an emerging frontier Nat Rev Immunol 2011 11 2 81 10.1038/nri2922 21469396 PMC4784680 Mathis D, Shoelson SE. Immunometabolism: an emerging frontier. Nat Rev Immunol. 2011;11(2):81. 21469396 10.1038/nri2922 PMC4784680 184. Hotamisligil GS Inflammation and metabolic disorders Nature 2006 444 7121 860 867 10.1038/nature05485 17167474 Hotamisligil GS. Inflammation and metabolic disorders. Nature. 2006;444(7121):860–7. 17167474 10.1038/nature05485 185. Shoelson SE Lee J Goldfine AB Inflammation and insulin resistance J Clin Invest 2006 116 7 1793 1801 10.1172/JCI29069 16823477 PMC1483173 Shoelson SE, Lee J, Goldfine AB. Inflammation and insulin resistance. J Clin Invest. 2006;116(7):1793–801. 16823477 10.1172/JCI29069 PMC1483173 186. Ouchi N Adipokines in inflammation and metabolic disease Nat Rev Immunol 2011 11 2 85 97 10.1038/nri2921 21252989 PMC3518031 Ouchi N, et al. Adipokines in inflammation and metabolic disease. Nat Rev Immunol. 2011;11(2):85–97. 21252989 10.1038/nri2921 PMC3518031 187. Rook GA Dalgleish A Infection, immunoregulation, and cancer Immunol Rev 2011 240 1 141 159 10.1111/j.1600-065X.2010.00987.x 21349092 Rook GA, Dalgleish A. Infection, immunoregulation, and cancer. Immunol Rev. 2011;240(1):141–59. 21349092 10.1111/j.1600-065X.2010.00987.x 188. Leonard BE Inflammation, depression and dementia: are they connected? Neurochem Res 2007 32 10 1749 1756 10.1007/s11064-007-9385-y 17705097 Leonard BE. Inflammation, depression and dementia: are they connected? Neurochem Res. 2007;32(10):1749–56. 17705097 10.1007/s11064-007-9385-y 189. Pradhan AD C-reactive protein, interleukin 6, and risk of developing type 2 diabetes mellitus JAMA 2001 286 3 327 334 10.1001/jama.286.3.327 11466099 Pradhan AD, et al. C-reactive protein, interleukin 6, and risk of developing type 2 diabetes mellitus. JAMA. 2001;286(3):327–34. 11466099 10.1001/jama.286.3.327 190. Pedersen BK Saltin B Evidence for prescribing exercise as therapy in chronic disease Scand J Med Sci Sports 2006 16 3 63 10.1111/j.1600-0838.2006.00520.x 16451303 Pedersen BK, Saltin B. Evidence for prescribing exercise as therapy in chronic disease. Scand J Med Sci Sports. 2006;16:3–63. 16451303 10.1111/j.1600-0838.2006.00520.x 191. Hardman AE Stensel DJ Physical activity and health: the evidence explained 2009 London Routledge Hardman AE, Stensel DJ. Physical activity and health: the evidence explained. London: Routledge; 2009. 192. Warren TY Sedentary behaviors increase risk of cardiovascular disease mortality in men Med Sci Sports Exerc 2010 42 5 879 885 10.1249/MSS.0b013e3181c3aa7e 19996993 PMC2857522 Warren TY, et al. Sedentary behaviors increase risk of cardiovascular disease mortality in men. Med Sci Sports Exerc. 2010;42(5):879–85. 19996993 10.1249/MSS.0b013e3181c3aa7e PMC2857522 193. Walsh NP Position statement. Part one: immune function and exercise Exerc Immunol Rev 2011 17 6 63 21446352 Walsh NP, et al. Position statement. Part one: immune function and exercise. Exerc Immunol Rev. 2011;17:6–63. 21446352 194. Jonas S Phillips EM ACSM's exercise is medicine TM: a clinician's guide to exercise prescription 2012 Ambler Lippincott Williams & Wilkins Jonas S, Phillips EM. ACSM’s exercise is medicine TM: a clinician’s guide to exercise prescription. Ambler: Lippincott Williams & Wilkins; 2012. 195. Kraus WE Effects of the amount and intensity of exercise on plasma lipoproteins N Engl J Med 2002 347 19 1483 1492 10.1056/NEJMoa020194 12421890 Kraus WE, et al. Effects of the amount and intensity of exercise on plasma lipoproteins. N Engl J Med. 2002;347(19):1483–92. 12421890 10.1056/NEJMoa020194 196. Kasapis C Thompson PD The effects of physical activity on serum C-reactive protein and inflammatory markers: a systematic review J Am Coll Cardiol 2005 45 10 1563 1569 10.1016/j.jacc.2004.12.077 15893167 Kasapis C, Thompson PD. The effects of physical activity on serum C-reactive protein and inflammatory markers: a systematic review. J Am Coll Cardiol. 2005;45(10):1563–9. 15893167 10.1016/j.jacc.2004.12.077 197. Mathur N Pedersen BK Exercise as a mean to control low-grade systemic inflammation Mediat Inflamm 2008 2008 109502 10.1155/2008/109502 PMC2615833 19148295 Mathur N, Pedersen BK. Exercise as a mean to control low-grade systemic inflammation. Mediat Inflamm. 2008;2008:109502. 10.1155/2008/109502 PMC2615833 19148295 198. Flynn MG McFarlin BK Toll-like receptor 4: link to the anti-inflammatory effects of exercise? Exerc Sport Sci Rev 2006 34 4 176 181 10.1249/01.jes.0000240027.22749.14 17031256 Flynn MG, McFarlin BK. Toll-like receptor 4: link to the anti-inflammatory effects of exercise? Exerc Sport Sci Rev. 2006;34(4):176–81. 17031256 10.1249/01.jes.0000240027.22749.14 199. Pedersen BK Febbraio MA Muscle as an endocrine organ: focus on muscle-derived interleukin-6 Physiol Rev 2008 88 4 1379 1406 10.1152/physrev.90100.2007 18923185 Pedersen BK, Febbraio MA. Muscle as an endocrine organ: focus on muscle-derived interleukin-6. Physiol Rev. 2008;88(4):1379–406. 18923185 10.1152/physrev.90100.2007 200. Gleeson M McFarlin B Flynn M Exercise and toll-like receptors Exerc Immunol Rev 2006 12 34 53 17201071 Gleeson M, McFarlin B, Flynn M. Exercise and toll-like receptors. Exerc Immunol Rev. 2006;12:34–53. 17201071 201. Kawanishi N Exercise training inhibits inflammation in adipose tissue via both suppression of macrophage infiltration and acceleration of phenotypic switching from M1 to M2 macrophages in high-fat-diet-induced obese mice Exerc Immunol Rev 2010 16 105 118 20839495 Kawanishi N, et al. Exercise training inhibits inflammation in adipose tissue via both suppression of macrophage infiltration and acceleration of phenotypic switching from M1 to M2 macrophages in high-fat-diet-induced obese mice. Exerc Immunol Rev. 2010;16:105–18. 20839495 202. Timmerman KL Exercise training-induced lowering of inflammatory (CD14+CD16+) monocytes: a role in the anti-inflammatory influence of exercise? J Leukoc Biol 2008 84 5 1271 1278 10.1189/jlb.0408244 18664531 Timmerman KL, et al. Exercise training-induced lowering of inflammatory (CD14+CD16+) monocytes: a role in the anti-inflammatory influence of exercise? J Leukoc Biol. 2008;84(5):1271–8. 18664531 10.1189/jlb.0408244 203. Yeh SH Regular tai chi chuan exercise enhances functional mobility and CD4CD25 regulatory T cells Br J Sports Med 2006 40 3 239 243 10.1136/bjsm.2005.022095 16505081 PMC2491999 Yeh SH, et al. Regular tai chi chuan exercise enhances functional mobility and CD4CD25 regulatory T cells. Br J Sports Med. 2006;40(3):239–43. 16505081 10.1136/bjsm.2005.022095 PMC2491999 204. Wang J Effect of exercise training intensity on murine T-regulatory cells and vaccination response Scand J Med Sci Sports 2012 22 5 643 652 10.1111/j.1600-0838.2010.01288.x 21410542 Wang J, et al. Effect of exercise training intensity on murine T-regulatory cells and vaccination response. Scand J Med Sci Sports. 2012;22(5):643–52. 21410542 10.1111/j.1600-0838.2010.01288.x 205. Vandanmagsar B The NLRP3 inflammasome instigates obesity-induced inflammation and insulin resistance Nat Med 2011 17 2 179 188 10.1038/nm.2279 21217695 PMC3076025 Vandanmagsar B, et al. The NLRP3 inflammasome instigates obesity-induced inflammation and insulin resistance. Nat Med. 2011;17(2):179–88. 21217695 10.1038/nm.2279 PMC3076025 206. Wu KK Cheung SW Cheng KK NLRP3 inflammasome activation in adipose tissues and its implications on metabolic diseases Int J Mol Sci 2020 10.3390/ijms21114184 32545355 PMC7312293 Wu KK, Cheung SW, Cheng KK. NLRP3 inflammasome activation in adipose tissues and its implications on metabolic diseases. Int J Mol Sci. 2020. 10.3390/ijms21114184. 32545355 10.3390/ijms21114184 PMC7312293 207. ZhuGe DL Fibroblast growth factor 2 exacerbates inflammation in adipocytes through NLRP3 inflammasome activation Arch Pharm Res 2020 43 12 1311 1324 10.1007/s12272-020-01295-2 33245516 ZhuGe DL, et al. Fibroblast growth factor 2 exacerbates inflammation in adipocytes through NLRP3 inflammasome activation. Arch Pharm Res. 2020;43(12):1311–24. 33245516 10.1007/s12272-020-01295-2 208. McGeough MD TNF regulates transcription of NLRP3 inflammasome components and inflammatory molecules in cryopyrinopathies J Clin Invest 2017 127 12 4488 4497 10.1172/JCI90699 29130929 PMC5707143 McGeough MD, et al. TNF regulates transcription of NLRP3 inflammasome components and inflammatory molecules in cryopyrinopathies. J Clin Invest. 2017;127(12):4488–97. 29130929 10.1172/JCI90699 PMC5707143 209. Bauernfeind F Aging-associated TNF production primes inflammasome activation and NLRP3-related metabolic disturbances J Immunol 2016 197 7 2900 2908 10.4049/jimmunol.1501336 27566828 Bauernfeind F, et al. Aging-associated TNF production primes inflammasome activation and NLRP3-related metabolic disturbances. J Immunol. 2016;197(7):2900–8. 27566828 10.4049/jimmunol.1501336 210. Shuyu XI Effect of treadmill exercise of different intensity on the pparγ/adiponectin/TNF-α mRNA in adipose tissue of rats fed with high fat diet J Chengdu Sport Univ 2015 41 3 98 102 Shuyu XI. Effect of treadmill exercise of different intensity on the pparγ/adiponectin/TNF-α mRNA in adipose tissue of rats fed with high fat diet. J Chengdu Sport Univ. 2015;41(3):98–102. 211. Ahmadian M PPARγ signaling and metabolism: the good, the bad and the future Nat Med 2013 19 5 557 566 10.1038/nm.3159 23652116 PMC3870016 Ahmadian M, et al. PPARγ signaling and metabolism: the good, the bad and the future. Nat Med. 2013;19(5):557–66. 23652116 10.1038/nm.3159 PMC3870016 212. Mardare C Endurance and resistance training affect high fat diet-induced increase of ceramides, inflammasome expression, and systemic inflammation in mice J Diabetes Res 2016 2016 4536470 10.1155/2016/4536470 26788518 PMC4691630 Mardare C, et al. Endurance and resistance training affect high fat diet-induced increase of ceramides, inflammasome expression, and systemic inflammation in mice. J Diabetes Res. 2016;2016:4536470. 26788518 10.1155/2016/4536470 PMC4691630 213. Yue R NLRP3-mediated pyroptosis aggravates pressure overload-induced cardiac hypertrophy, fibrosis, and dysfunction in mice: cardioprotective role of irisin Cell Death Discov 2021 7 1 50 10.1038/s41420-021-00434-y 33723236 PMC7961005 Yue R, et al. NLRP3-mediated pyroptosis aggravates pressure overload-induced cardiac hypertrophy, fibrosis, and dysfunction in mice: cardioprotective role of irisin. Cell Death Discov. 2021;7(1):50. 33723236 10.1038/s41420-021-00434-y PMC7961005 214. Gholamnezhad Z Mégarbane B Rezaee R Molecular mechanisms mediating adaptation to exercise Adv Exp Med Biol 2020 1228 45 61 10.1007/978-981-15-1792-1_3 32342449 Gholamnezhad Z, Mégarbane B, Rezaee R. Molecular mechanisms mediating adaptation to exercise. Adv Exp Med Biol. 2020;1228:45–61. 32342449 10.1007/978-981-15-1792-1_3 215. Lally JS Skeletal muscle AMPK is essential for the maintenance of FNDC5 expression Physiol Rep 2015 10.14814/phy2.12343 25948819 PMC4463812 Lally JS, et al. Skeletal muscle AMPK is essential for the maintenance of FNDC5 expression. Physiol Rep. 2015. 10.14814/phy2.12343. 25948819 10.14814/phy2.12343 PMC4463812 216. Peng J Irisin protects against neuronal injury induced by oxygen-glucose deprivation in part depends on the inhibition of ROS-NLRP3 inflammatory signaling pathway Mol Immunol 2017 91 185 194 10.1016/j.molimm.2017.09.014 28961497 Peng J, et al. Irisin protects against neuronal injury induced by oxygen-glucose deprivation in part depends on the inhibition of ROS-NLRP3 inflammatory signaling pathway. Mol Immunol. 2017;91:185–94. 28961497 10.1016/j.molimm.2017.09.014 217. Clark IA Vissel B Neurodegenerative disease treatments by direct TNF reduction, SB623 cells, maraviroc and irisin and MCC950, from an inflammatory perspective—a commentary Expert Rev Neurother 2019 19 6 535 543 10.1080/14737175.2019.1618710 31092047 Clark IA, Vissel B. Neurodegenerative disease treatments by direct TNF reduction, SB623 cells, maraviroc and irisin and MCC950, from an inflammatory perspective—a commentary. Expert Rev Neurother. 2019;19(6):535–43. 31092047 10.1080/14737175.2019.1618710 218. Sanchez-Delgado G Role of exercise in the activation of brown adipose tissue Ann Nutr Metab 2015 67 1 21 32 10.1159/000437173 26227180 Sanchez-Delgado G, et al. Role of exercise in the activation of brown adipose tissue. Ann Nutr Metab. 2015;67(1):21–32. 26227180 10.1159/000437173 219. Abeyrathna P Su Y The critical role of Akt in cardiovascular function Vascul Pharmacol 2015 74 38 48 10.1016/j.vph.2015.05.008 26025205 PMC4659756 Abeyrathna P, Su Y. The critical role of Akt in cardiovascular function. Vascul Pharmacol. 2015;74:38–48. 26025205 10.1016/j.vph.2015.05.008 PMC4659756 220. Sun X Human umbilical cord-derived mesenchymal stem cells ameliorate insulin resistance by suppressing NLRP3 inflammasome-mediated inflammation in type 2 diabetes rats Stem Cell Res Ther 2017 8 1 241 10.1186/s13287-017-0668-1 29096724 PMC5667486 Sun X, et al. Human umbilical cord-derived mesenchymal stem cells ameliorate insulin resistance by suppressing NLRP3 inflammasome-mediated inflammation in type 2 diabetes rats. Stem Cell Res Ther. 2017;8(1):241. 29096724 10.1186/s13287-017-0668-1 PMC5667486 221. Yi XJ Effects of acute and chronic exercise on fat PI3K/AKT/GLUT4 signal pathway in type 2 diabetic rats Zhongguo Ying Yong Sheng Li Xue Za Zhi 2020 36 1 12 16 32476367 10.12047/j.cjap.5802.2020.003 Yi XJ, et al. Effects of acute and chronic exercise on fat PI3K/AKT/GLUT4 signal pathway in type 2 diabetic rats. Zhongguo Ying Yong Sheng Li Xue Za Zhi. 2020;36(1):12–6. 32476367 10.12047/j.cjap.5802.2020.003 222. Zhao R Aerobic exercise restores hippocampal neurogenesis and cognitive function by decreasing microglia inflammasome formation through Irisin/NLRP3 pathway Aging Cell 2025 24 7 e70061 10.1111/acel.70061 40192010 PMC12266781 Zhao R, et al. Aerobic exercise restores hippocampal neurogenesis and cognitive function by decreasing microglia inflammasome formation through Irisin/NLRP3 pathway. Aging Cell. 2025;24(7):e70061. 40192010 10.1111/acel.70061 PMC12266781 223. Wang W Treadmill exercise alleviates neuronal damage by suppressing NLRP3 inflammasome and microglial activation in the MPTP mouse model of Parkinson’s disease Brain Res Bull 2021 174 349 358 10.1016/j.brainresbull.2021.06.024 34224819 Wang W, et al. Treadmill exercise alleviates neuronal damage by suppressing NLRP3 inflammasome and microglial activation in the MPTP mouse model of Parkinson’s disease. Brain Res Bull. 2021;174:349–58. 34224819 10.1016/j.brainresbull.2021.06.024 224. Liu M-X Exercise-induced neuroprotection against cerebral ischemia/reperfusion injury is mediated via alleviating inflammasome-induced pyroptosis Exp Neurol 2022 349 113952 10.1016/j.expneurol.2021.113952 34921847 Liu M-X, et al. Exercise-induced neuroprotection against cerebral ischemia/reperfusion injury is mediated via alleviating inflammasome-induced pyroptosis. Exp Neurol. 2022;349:113952. 34921847 10.1016/j.expneurol.2021.113952 225. Mee-Inta O Zhao ZW Kuo YM Physical exercise inhibits inflammation and microglial activation Cells 2019 10.3390/cells8070691 31324021 PMC6678635 Mee-Inta O, Zhao ZW, Kuo YM. Physical exercise inhibits inflammation and microglial activation. Cells. 2019. 10.3390/cells8070691. 31324021 10.3390/cells8070691 PMC6678635 226. Ma C The impact of physical activity on blood inflammatory cytokines and neuroprotective factors in individuals with mild cognitive impairment: a systematic review and meta-analysis of randomized-controlled trials Aging Clin Exp Res 2022 34 7 1471 1484 10.1007/s40520-021-02069-6 35025094 Ma C, et al. The impact of physical activity on blood inflammatory cytokines and neuroprotective factors in individuals with mild cognitive impairment: a systematic review and meta-analysis of randomized-controlled trials. Aging Clin Exp Res. 2022;34(7):1471–84. 35025094 10.1007/s40520-021-02069-6 227. de Lima Rosa G Aerobic exercise, alone or combined with an anti-inflammatory drug, reduces the severity of epileptic seizures and levels of central pro-inflammatory cytokines in an animal model of epileptic seizures Epilepsy Res 2022 186 107018 10.1016/j.eplepsyres.2022.107018 36126608 de Lima Rosa G, et al. Aerobic exercise, alone or combined with an anti-inflammatory drug, reduces the severity of epileptic seizures and levels of central pro-inflammatory cytokines in an animal model of epileptic seizures. Epilepsy Res. 2022;186:107018. 36126608 10.1016/j.eplepsyres.2022.107018 228. Oyovwi MO Ogenma UT Onyenweny A Exploring the impact of exercise-induced BDNF on neuroplasticity in neurodegenerative and neuropsychiatric conditions Mol Biol Rep 2025 52 1 140 10.1007/s11033-025-10248-1 39832087 Oyovwi MO, Ogenma UT, Onyenweny A. Exploring the impact of exercise-induced BDNF on neuroplasticity in neurodegenerative and neuropsychiatric conditions. Mol Biol Rep. 2025;52(1):140. 39832087 10.1007/s11033-025-10248-1 229. Diechmann MD Effects of exercise training on neurotrophic factors and subsequent neuroprotection in persons with multiple sclerosis—a systematic review and meta-analysis Brain Sci 2021 11 11 1499 10.3390/brainsci11111499 34827498 PMC8615767 Diechmann MD, et al. Effects of exercise training on neurotrophic factors and subsequent neuroprotection in persons with multiple sclerosis—a systematic review and meta-analysis. Brain Sci. 2021;11(11):1499. 34827498 10.3390/brainsci11111499 PMC8615767 230. Rosa JM Physical exercise prevents amyloid β(1–40)-induced disturbances in NLRP3 inflammasome pathway in the hippocampus of mice Metab Brain Dis 2021 36 2 351 359 10.1007/s11011-020-00646-8 33211258 Rosa JM, et al. Physical exercise prevents amyloid β(1–40)-induced disturbances in NLRP3 inflammasome pathway in the hippocampus of mice. Metab Brain Dis. 2021;36(2):351–9. 33211258 10.1007/s11011-020-00646-8 231. Li X Long-term exercise training inhibits inflammation by suppressing hippocampal NLRP3 in APP/PS1 mice Sports Med Health Sci 2023 5 4 329 335 10.1016/j.smhs.2023.09.009 38314041 PMC10831383 Li X, et al. Long-term exercise training inhibits inflammation by suppressing hippocampal NLRP3 in APP/PS1 mice. Sports Med Health Sci. 2023;5(4):329–35. 38314041 10.1016/j.smhs.2023.09.009 PMC10831383 232. Malczynska-Sims P High-intensity interval training modulates inflammatory response in Parkinson's disease Aging Clin Exp Res 2022 34 9 2165 2176 10.1007/s40520-022-02153-5 35699838 PMC9192928 Malczynska-Sims P, et al. High-intensity interval training modulates inflammatory response in Parkinson’s disease. Aging Clin Exp Res. 2022;34(9):2165–76. 35699838 10.1007/s40520-022-02153-5 PMC9192928 233. Jang Y Neuroprotective effects of endurance exercise against neuroinflammation in MPTP-induced Parkinson's disease mice Brain Res 2017 1655 186 193 10.1016/j.brainres.2016.10.029 27816415 Jang Y, et al. Neuroprotective effects of endurance exercise against neuroinflammation in MPTP-induced Parkinson’s disease mice. Brain Res. 2017;1655:186–93. 27816415 10.1016/j.brainres.2016.10.029 234. Veldink JH Sexual differences in onset of disease and response to exercise in a transgenic model of ALS Neuromuscul Disord 2003 13 9 737 743 10.1016/S0960-8966(03)00104-4 14561497 Veldink JH, et al. Sexual differences in onset of disease and response to exercise in a transgenic model of ALS. Neuromuscul Disord. 2003;13(9):737–43. 14561497 10.1016/s0960-8966(03)00104-4 235. Liebetanz D Extensive exercise is not harmful in amyotrophic lateral sclerosis Eur J Neurosci 2004 20 11 3115 3120 10.1111/j.1460-9568.2004.03769.x 15579165 Liebetanz D, et al. Extensive exercise is not harmful in amyotrophic lateral sclerosis. Eur J Neurosci. 2004;20(11):3115–20. 15579165 10.1111/j.1460-9568.2004.03769.x 236. Deforges S Motoneuron survival is promoted by specific exercise in a mouse model of amyotrophic lateral sclerosis J Physiol 2009 587 Pt 14 3561 3572 10.1113/jphysiol.2009.169748 19491245 PMC2742281 Deforges S, et al. Motoneuron survival is promoted by specific exercise in a mouse model of amyotrophic lateral sclerosis. J Physiol. 2009;587(Pt 14):3561–72. 19491245 10.1113/jphysiol.2009.169748 PMC2742281 237. Kim TW Sung YH Regular exercise promotes memory function and enhances hippocampal neuroplasticity in experimental autoimmune encephalomyelitis mice Neuroscience 2017 346 173 181 10.1016/j.neuroscience.2017.01.016 28108255 Kim TW, Sung YH. Regular exercise promotes memory function and enhances hippocampal neuroplasticity in experimental autoimmune encephalomyelitis mice. Neuroscience. 2017;346:173–81. 28108255 10.1016/j.neuroscience.2017.01.016 238. Mokhtarzade M Effect of aerobic interval training on serum IL-10, TNFα, and adipokines levels in women with multiple sclerosis: possible relations with fatigue and quality of life Endocrine 2017 57 2 262 271 10.1007/s12020-017-1337-y 28616851 Mokhtarzade M, et al. Effect of aerobic interval training on serum IL-10, TNFα, and adipokines levels in women with multiple sclerosis: possible relations with fatigue and quality of life. Endocrine. 2017;57(2):262–71. 28616851 10.1007/s12020-017-1337-y 239. Montagne A APOE4 leads to blood-brain barrier dysfunction predicting cognitive decline Nature 2020 581 7806 71 76 10.1038/s41586-020-2247-3 32376954 PMC7250000 Montagne A, et al. APOE4 leads to blood-brain barrier dysfunction predicting cognitive decline. Nature. 2020;581(7806):71–6. 32376954 10.1038/s41586-020-2247-3 PMC7250000 240. Kerr AW T-cell activation and LPS: a dangerous duo for organ dysfunction J Leukoc Biol 2022 112 2 219 220 10.1002/JLB.3CE0122-019R 35481682 Kerr AW, et al. T-cell activation and LPS: a dangerous duo for organ dysfunction. J Leukoc Biol. 2022;112(2):219–20. 35481682 10.1002/JLB.3CE0122-019R 241. Scheffer DDL Latini A Exercise-induced immune system response: anti-inflammatory status on peripheral and central organs Biochim Biophys Acta Mol Basis Dis 2020 1866 10 165823 10.1016/j.bbadis.2020.165823 32360589 PMC7188661 Scheffer DDL, Latini A. Exercise-induced immune system response: anti-inflammatory status on peripheral and central organs. Biochim Biophys Acta Mol Basis Dis. 2020;1866(10):165823. 32360589 10.1016/j.bbadis.2020.165823 PMC7188661 242. Da Rosa PC The physical exercise-induced oxidative/inflammatory response in peripheral blood mononuclear cells: Signaling cellular energetic stress situations Life Sci 2023 321 121440 10.1016/j.lfs.2023.121440 36921686 Da Rosa PC, et al. The physical exercise-induced oxidative/inflammatory response in peripheral blood mononuclear cells: Signaling cellular energetic stress situations. Life Sci. 2023;321:121440. 36921686 10.1016/j.lfs.2023.121440 243. Gothe NP Yoga, aerobic and stretching exercise effects on neurocognition: Randomized controlled trial protocol Contemp Clin Trials 2023 131 107240 10.1016/j.cct.2023.107240 37244365 PMC10527553 Gothe NP, et al. Yoga, aerobic and stretching exercise effects on neurocognition: Randomized controlled trial protocol. Contemp Clin Trials. 2023;131:107240. 37244365 10.1016/j.cct.2023.107240 PMC10527553 244. Chen K Wang K Wang T Protective effect of irisin against Alzheimer's disease Front Psychiatry 2022 13 967683 10.3389/fpsyt.2022.967683 36203845 PMC9530446 Chen K, Wang K, Wang T. Protective effect of irisin against Alzheimer’s disease. Front Psychiatry. 2022;13:967683. 36203845 10.3389/fpsyt.2022.967683 PMC9530446 245. Choi JW Aerobic exercise attenuates LPS-induced cognitive dysfunction by reducing oxidative stress, glial activation, and neuroinflammation Redox Biol 2024 71 103101 10.1016/j.redox.2024.103101 38408409 PMC10904279 Choi JW, et al. Aerobic exercise attenuates LPS-induced cognitive dysfunction by reducing oxidative stress, glial activation, and neuroinflammation. Redox Biol. 2024;71:103101. 38408409 10.1016/j.redox.2024.103101 PMC10904279 246. Powers SK Exercise-induced oxidative stress: friend or foe? J Sport Health Sci 2020 9 5 415 425 10.1016/j.jshs.2020.04.001 32380253 PMC7498668 Powers SK, et al. Exercise-induced oxidative stress: friend or foe? J Sport Health Sci. 2020;9(5):415–25. 32380253 10.1016/j.jshs.2020.04.001 PMC7498668 247. Mogilenko DA Comprehensive profiling of an aging immune system reveals clonal GZMK(+) CD8(+) T cells as conserved hallmark of inflammaging Immunity 2021 54 1 99 115.e12 10.1016/j.immuni.2020.11.005 33271118 Mogilenko DA, et al. Comprehensive profiling of an aging immune system reveals clonal GZMK(+) CD8(+) T cells as conserved hallmark of inflammaging. Immunity. 2021;54(1):99-115.e12. 33271118 10.1016/j.immuni.2020.11.005 248. Birch J Gil J Senescence and the SASP: many therapeutic avenues Genes Dev 2020 34 23–24 1565 1576 10.1101/gad.343129.120 33262144 PMC7706700 Birch J, Gil J. Senescence and the SASP: many therapeutic avenues. Genes Dev. 2020;34(23–24):1565–76. 33262144 10.1101/gad.343129.120 PMC7706700 249. Victorelli S Apoptotic stress causes mtDNA release during senescence and drives the SASP Nature 2023 622 7983 627 636 10.1038/s41586-023-06621-4 37821702 PMC10584674 Victorelli S, et al. Apoptotic stress causes mtDNA release during senescence and drives the SASP. Nature. 2023;622(7983):627–36. 37821702 10.1038/s41586-023-06621-4 PMC10584674 250. Hu J Huang B Chen K The impact of physical exercise on neuroinflammation mechanism in Alzheimer's disease Front Aging Neurosci 2024 16 1444716 10.3389/fnagi.2024.1444716 39233828 PMC11371602 Hu J, Huang B, Chen K. The impact of physical exercise on neuroinflammation mechanism in Alzheimer’s disease. Front Aging Neurosci. 2024;16:1444716. 39233828 10.3389/fnagi.2024.1444716 PMC11371602 251. Mansoor M Exercise-induced neuroplasticity: adaptive mechanisms and preventive potential in neurodegenerative disorders Physiologia 2025 5 2 13 10.3390/physiologia5020013 Mansoor M, et al. Exercise-induced neuroplasticity: adaptive mechanisms and preventive potential in neurodegenerative disorders. Physiologia. 2025;5(2):13. 252. Liu L Running exercise alleviates hippocampal neuroinflammation and shifts the balance of microglial M1/M2 polarization through adiponectin/AdipoR1 pathway activation in mice exposed to chronic unpredictable stress Mol Psychiatry 2024 29 7 2031 2042 10.1038/s41380-024-02464-1 38361125 Liu L, et al. Running exercise alleviates hippocampal neuroinflammation and shifts the balance of microglial M1/M2 polarization through adiponectin/AdipoR1 pathway activation in mice exposed to chronic unpredictable stress. Mol Psychiatry. 2024;29(7):2031–42. 38361125 10.1038/s41380-024-02464-1 253. Luo Y Running exercise protects oligodendrocytes in the medial prefrontal cortex in chronic unpredictable stress rat model Transl Psychiatry 2019 9 1 322 10.1038/s41398-019-0662-8 31780641 PMC6882819 Luo Y, et al. Running exercise protects oligodendrocytes in the medial prefrontal cortex in chronic unpredictable stress rat model. Transl Psychiatry. 2019;9(1):322. 31780641 10.1038/s41398-019-0662-8 PMC6882819 254. Lee JM Preischemic treadmill exercise ameliorates memory impairment and microvasculature damage in rat model of chronic cerebral hypoperfusion Int Neurourol J 2021 25 Suppl 2 S72 80 10.5213/inj.2142340.170 34844389 PMC8654316 Lee JM, et al. Preischemic treadmill exercise ameliorates memory impairment and microvasculature damage in rat model of chronic cerebral hypoperfusion. Int Neurourol J. 2021;25(Suppl 2):S72-80. 34844389 10.5213/inj.2142340.170 PMC8654316 255. Royes LFF Cross-talk between gut and brain elicited by physical exercise Biochim Biophys Acta Mol Basis Dis 2020 1866 10 165877 10.1016/j.bbadis.2020.165877 32544430 Royes LFF. Cross-talk between gut and brain elicited by physical exercise. Biochim Biophys Acta Mol Basis Dis. 2020;1866(10):165877. 32544430 10.1016/j.bbadis.2020.165877 256. Palasz E Exercise-induced neuroprotection and recovery of motor function in animal models of Parkinson's disease Front Neurol 2019 10 1143 10.3389/fneur.2019.01143 31736859 PMC6838750 Palasz E, et al. Exercise-induced neuroprotection and recovery of motor function in animal models of Parkinson’s disease. Front Neurol. 2019;10:1143. 31736859 10.3389/fneur.2019.01143 PMC6838750 257. Taylor AG High intensity interval training leads to similar inflammatory activation as seen with traditional training in chronic heart failure Front Cardiovasc Med 2021 8 752531 10.3389/fcvm.2021.752531 35211515 PMC8860824 Taylor AG, et al. High intensity interval training leads to similar inflammatory activation as seen with traditional training in chronic heart failure. Front Cardiovasc Med. 2021;8:752531. 35211515 10.3389/fcvm.2021.752531 PMC8860824 258. Malczynska-Sims P High-intensity interval training modulates inflammatory response in Parkinson’s disease Aging Clin Exp Res 2022 34 9 2165 2176 10.1007/s40520-022-02153-5 35699838 PMC9192928 Malczynska-Sims P, et al. High-intensity interval training modulates inflammatory response in Parkinson’s disease. Aging Clin Exp Res. 2022;34(9):2165–76. 35699838 10.1007/s40520-022-02153-5 PMC9192928 259. O'Callaghan A Comparing the influence of exercise intensity on brain-derived neurotrophic factor serum levels in people with Parkinson's disease: a pilot study Aging Clin Exp Res 2020 32 9 1731 1738 10.1007/s40520-019-01353-w 31606860 O’Callaghan A, et al. Comparing the influence of exercise intensity on brain-derived neurotrophic factor serum levels in people with Parkinson’s disease: a pilot study. Aging Clin Exp Res. 2020;32(9):1731–8. 31606860 10.1007/s40520-019-01353-w 260. Marusiak J Interval training-induced alleviation of rigidity and hypertonia in patients with Parkinson's disease is accompanied by increased basal serum brain-derived neurotrophic factor J Rehabil Med 2015 47 4 372 375 10.2340/16501977-1931 25510618 Marusiak J, et al. Interval training-induced alleviation of rigidity and hypertonia in patients with Parkinson’s disease is accompanied by increased basal serum brain-derived neurotrophic factor. J Rehabil Med. 2015;47(4):372–5. 25510618 10.2340/16501977-1931 261. Zoladz JA Moderate-intensity interval training increases serum brain-derived neurotrophic factor level and decreases inflammation in Parkinson's disease patients J Physiol Pharmacol 2014 65 3 441 448 24930517 Zoladz JA, et al. Moderate-intensity interval training increases serum brain-derived neurotrophic factor level and decreases inflammation in Parkinson’s disease patients. J Physiol Pharmacol. 2014;65(3):441–8. 24930517 262. Li JA Does exercise attenuate disease progression in people with Parkinson's disease? A systematic review with meta-analyses Neurorehabil Neural Repair 2023 37 5 328 352 10.1177/15459683231172752 37166181 PMC10272626 Li JA, et al. Does exercise attenuate disease progression in people with Parkinson’s disease? A systematic review with meta-analyses. Neurorehabil Neural Repair. 2023;37(5):328–52. 37166181 10.1177/15459683231172752 PMC10272626 263. Novati A Nguyen HP Schulze-Hentrich J Environmental stimulation in Huntington disease patients and animal models Neurobiol Dis 2022 171 105725 10.1016/j.nbd.2022.105725 35427742 Novati A, Nguyen HP, Schulze-Hentrich J. Environmental stimulation in Huntington disease patients and animal models. Neurobiol Dis. 2022;171:105725. 35427742 10.1016/j.nbd.2022.105725 264. Trovato B Effects of exercise on skeletal muscle pathophysiology in Huntington's disease J Funct Morphol Kinesiol 2022 10.3390/jfmk7020040 35645302 PMC9149967 Trovato B, et al. Effects of exercise on skeletal muscle pathophysiology in Huntington’s disease. J Funct Morphol Kinesiol. 2022. 10.3390/jfmk7020040. 35645302 10.3390/jfmk7020040 PMC9149967 265. Renoir T Effect of enhanced voluntary physical exercise on brain levels of monoamines in Huntington disease mice PLoS Curr 2011 10.1371/currents.RRN1281 22266953 PMC3208413 Renoir T, et al. Effect of enhanced voluntary physical exercise on brain levels of monoamines in Huntington disease mice. PLoS Curr. 2011. 10.1371/currents.RRN1281. 22266953 10.1371/currents.RRN1281 PMC3208413 266. Azman KF Zakaria R Brain-derived neurotrophic factor (BDNF) in Huntington’s disease: neurobiology and therapeutic potential Curr Neuropharmacol 2025 23 4 384 403 10.2174/1570159X22666240530105516 40123457 PMC12105282 Azman KF, Zakaria R. Brain-derived neurotrophic factor (BDNF) in Huntington’s disease: neurobiology and therapeutic potential. Curr Neuropharmacol. 2025;23(4):384–403. 40123457 10.2174/1570159X22666240530105516 PMC12105282 267. Strickland D Physical activity, trauma, and ALS: a case-control study Acta Neurol Scand 1996 94 1 45 50 10.1111/j.1600-0404.1996.tb00038.x 8874593 Strickland D, et al. Physical activity, trauma, and ALS: a case-control study. Acta Neurol Scand. 1996;94(1):45–50. 8874593 10.1111/j.1600-0404.1996.tb00038.x 268. Gotkine M Friedlander Y Hochner H Triathletes are over-represented in a population of patients with ALS Amyotroph Later Scler Frontotemporal Degener 2014 15 7–8 534 536 10.3109/21678421.2014.932383 25007701 Gotkine M, Friedlander Y, Hochner H. Triathletes are over-represented in a population of patients with ALS. Amyotroph Later Scler Frontotemporal Degener. 2014;15(7–8):534–6. 10.3109/21678421.2014.932383 25007701 269. Chiò A Severely increased risk of amyotrophic lateral sclerosis among Italian professional football players Brain 2005 128 Pt 3 472 476 10.1093/brain/awh373 15634730 Chiò A, et al. Severely increased risk of amyotrophic lateral sclerosis among Italian professional football players. Brain. 2005;128(Pt 3):472–6. 15634730 10.1093/brain/awh373 270. Lehman EJ Neurodegenerative causes of death among retired National Football League players Neurology 2012 79 19 1970 1974 10.1212/WNL.0b013e31826daf50 22955124 PMC4098841 Lehman EJ, et al. Neurodegenerative causes of death among retired National Football League players. Neurology. 2012;79(19):1970–4. 22955124 10.1212/WNL.0b013e31826daf50 PMC4098841 271. Mahoney DJ Effects of high-intensity endurance exercise training in the G93A mouse model of amyotrophic lateral sclerosis Muscle Nerve 2004 29 5 656 662 10.1002/mus.20004 15116368 Mahoney DJ, et al. Effects of high-intensity endurance exercise training in the G93A mouse model of amyotrophic lateral sclerosis. Muscle Nerve. 2004;29(5):656–62. 15116368 10.1002/mus.20004 272. Xie Y Effects of moderate- versus high- intensity swimming training on inflammatory and CD4(+) T cell subset profiles in experimental autoimmune encephalomyelitis mice J Neuroimmunol 2019 328 60 67 10.1016/j.jneuroim.2018.12.005 30583216 Xie Y, et al. Effects of moderate- versus high- intensity swimming training on inflammatory and CD4(+) T cell subset profiles in experimental autoimmune encephalomyelitis mice. J Neuroimmunol. 2019;328:60–7. 30583216 10.1016/j.jneuroim.2018.12.005 273. Negaresh R Effects of exercise training on cytokines and adipokines in multiple sclerosis: a systematic review Mult Scler Relat Disord 2018 24 91 100 10.1016/j.msard.2018.06.008 29982111 Negaresh R, et al. Effects of exercise training on cytokines and adipokines in multiple sclerosis: a systematic review. Mult Scler Relat Disord. 2018;24:91–100. 29982111 10.1016/j.msard.2018.06.008 274. Simpson RJ Exercise and the regulation of immune functions Prog Mol Biol Transl Sci 2015 135 355 380 10.1016/bs.pmbts.2015.08.001 26477922 Simpson RJ, et al. Exercise and the regulation of immune functions. Prog Mol Biol Transl Sci. 2015;135:355–80. 26477922 10.1016/bs.pmbts.2015.08.001 275. Sharif K Physical activity and autoimmune diseases: get moving and manage the disease Autoimmun Rev 2018 17 1 53 72 10.1016/j.autrev.2017.11.010 29108826 Sharif K, et al. Physical activity and autoimmune diseases: get moving and manage the disease. Autoimmun Rev. 2018;17(1):53–72. 29108826 10.1016/j.autrev.2017.11.010 ",
  "metadata": {
    "Title of this paper": "Physical activity and autoimmune diseases: get moving and manage the disease",
    "Journal it was published in:": "European Journal of Medical Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482578/"
  }
}