{
  "title": "Paper_310",
  "abstract": "pmc Theranostics Theranostics 1512 theranostics thno Theranostics 1838-7640 Ivyspring International Publisher PMC12486161 PMC12486161.1 12486161 12486161 41041049 10.7150/thno.112661 thnov15p9415 1 Research Paper Alisol A ameliorates vascular cognitive impairment via AMPK/NAMPT/SIRT1-mediated regulation of cholesterol and autophagy Xu Ping 1 2 3 # Zhou Wen 1 2 3 # Wang Shida 1 2 3 Wang Linjiao 1 2 3 Bai Yu 1 2 3 Xing Shan 1 2 3 Xue Wenda 1 2 3 Li Meng 1 2 3 Shi Jun 1 2 3 Wu Haoxin 1 2 3 ✉ 1 2 3 ✉ Corresponding author: College of Traditional Chinese Medicine, Nanjing University of Chinese Medicine, No. 138 Xianlin Road, Nanjing, 210023, China. E-mail addresses: HaoxinWu@njucm.edu.cn # Competing Interests: The authors have declared that no competing interest exists. 2025 22 8 2025 15 18 498071 9415 9446 22 2 2025 3 8 2025 22 08 2025 02 10 2025 03 10 2025 © The author(s) 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License ( https://creativecommons.org/licenses/by/4.0/ https://ivyspring.com/terms Atherosclerosis-related vascular cognitive impairment (VCI) is associated with dysregulated cholesterol metabolism and impaired autophagy. Alisol A, a natural tetracyclic triterpenoid derived from the traditional ZeXieYin Formula, has demonstrated anti-atherosclerotic and neuroprotective effects. However, its role in modulating brain cholesterol homeostasis and mitophagy in VCI remains largely unexplored. Methods: Ldlr -/- Results: Ldlr -/- Conclusion: Alisol A atherosclerosis-related vascular cognitive impairment brain cholesterol homeostasis autophagy pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Atherosclerosis (AS) is the most common form of cardiovascular and cerebrovascular disease. Its principal pathogenic mechanisms are lipid accumulation and large-artery inflammation, which ultimately give rise to clinical complications such as myocardial infarction, stroke, and cognitive impairment. Vascular cognitive impairment (VCI) encompasses the full spectrum of cognitive decline resulting from cerebrovascular pathology including cerebral infarction, hemorrhage, small-vessel disease, or chronic cerebral hypoperfusion ranging from mild subjective cognitive complaints or mild VCI to severe deficits that meet diagnostic criteria for vascular dementia (VaD) 1 2 3 4 5 6 7 8 7 9 6 7 9 10 11 In the nervous system, cholesterol is not only a fundamental structural component of neuronal membranes, contributing to membrane fluidity and stability, but also plays a critical role in neurotransmitter synthesis, synapse formation, maintenance, and signal transmission 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 19 28 29 30 31 32 34 Mitophagy is crucial for maintaining mitochondrial homeostasis by selectively degrading damaged mitochondria 35 36 37 38 39 40 41 42 38 43 44 45 46 47 47 48 49 51 The AMP-activated protein kinase (AMPK)/nicotinamide phosphoribosyltransferase (NAMPT)/sirtuin 1 (SIRT1) axis plays a critical role in regulating key pathways associated with cellular aging, energy metabolism, and neuroprotection 52 53 54 55 56 Nampt 57 58 59 60 ZeXieYin Formula, a classical prescription in traditional Chinese medicine (TCM), has been widely applied in clinical settings for centuries. The herbs included in this formula are rich in bioactive compounds with known metabolic regulatory, anti-inflammatory, and antioxidant properties. In our previous studies, ZeXieYin Formula demonstrated significant therapeutic effects on cognitive impairment induced by high-fat diet related atherosclerosis, with the following key findings: (1) ZeXieYin Formula alleviated neuroinflammation and reduced Aβ deposition by modulating the MAPK/NF-κB signaling pathway in the hippocampus, thereby enhancing synaptic plasticity and improving cognitive function 61 62 63 64 65 66 67 77 78 Notably, Alisol A may exert its effects through sirt1 activation, although the mechanisms remain to be fully elucidated 69 77 80 81 Materials and Methods Model building and drug intervention Five-week-old male C57BL/6 J mice and B6/JGpt- Ldlr em1Cd82 Ldlr -/- 82 83 84 85 Ldlr -/- Alisol A (19885-10-0; MedChemExpress, Shanghai, China) was administered intragastrically (i.g.) at 15 mg/kg or 30 mg/kg once daily for 2 months 81 86 87 88 Cognitive and behavioral tests The Morris water maze (MWM) utilized an artificially partitioned pool with four quadrants and a submerged platform hidden beneath the water's surface. Following an initial day of adaptability training, mice underwent formal training for five consecutive days, culminating in a positioning navigation test on the sixth day. Subsequently, the platform was taken out, allowing mice to swim freely in the pool for 60 s. The time spent in the target quadrant was recorded for analysis. In the Y-maze experiment, mice were subjected to a custom-made apparatus consisting of three symmetrical arms (35 cm × 10 cm × 20 cm), each positioned at a 120° angle. During a 5 min trial, mice explored two arms of the maze while the third arm was blocked. The maze was cleaned before each trial to remove any lingering odors. Subsequent to the training trial, a single 5 min test trial was conducted, during which spontaneous alternations and arm entries were meticulously recorded. The alternation percentage was determined by dividing the number of alternations by the total number of arm entries and multiplying the result by 100%. In the Novel Object Recognition (NOR) task, each mouse underwent a familiarization phase in which they were placed in a box and exposed to two identical objects for a duration of 5 min. To prevent the influence of olfactory cues, the objects were meticulously cleaned between trials. The subsequent day, the mouse was reintroduced to the same box, but one of the familiar objects was replaced with a novel object of distinct color and shape. The exploration time of each object was quantified using the ANY-maze video-tracking system, with a defined 2 cm 2 Model evaluation Hematoxylin-eosin Staining (HE): Mice were sedated with sodium pentobarbital, euthanized by cervical dislocation, and their tissues were promptly dissected on ice. Five mice from each group were randomly chosen for fixation in 4% paraformaldehyde at 4 °C for 24 h. The remaining tissues were dissected on ice, snap-frozen, and stored at -80 °C. The samples were embedded in paraffin and made into tissue sections. After HE staining, sections were observed under an optical microscope and photographed. Oil Red O Staining (ORO): The tissue was frozen quickly in cutting temperature compound (OCT) compound and cut into 10 µm sections. Frozen sections were applied for ORO. Counterstaining was performed using hematoxylin. Following sealing, the slices were examined using a light microscope and imaged. Plaque and vessel measurements were taken using Image J software. Plaque stenosis was determined by comparing plaque area to total vessel area, and lipid content was calculated as the percentage of ORO area in relation to total plaque area. Serum biochemical analysis: Serum triglycerides (TG), total cholesterol (TC), high-density lipoprotein cholesterol (HDL-c), and LDL-c levels were measured using enzymatic kits from Lei Du, Shenzhen, China, and an Automatic Biochemical Analyzer (Chemray240) as per kit instructions. For determination of cholesterol in mouse brain tissue, a Total Cholesterol Assay Kit (A111-1-1; Nanjing Jiancheng Bioengineering Institute, Nanjing, China) was used. Brain samples were accurately weighed and homogenized in nine volumes of homogenization buffer (w/v, g: mL = 1:9) on ice using a mechanical homogenizer. Following the manufacturer's instructions, the homogenate was thoroughly mixed and then incubated at 37 °C for 10 min. Absorbance was measured at 500 nm with a microplate reader. Hippocampal neurons morphology and function Transmission electron microscopy (TEM): Each hippocampal tissue was chopped into small pieces using sterile surgical blades (about 0.5-1 mm 3 Pathological examination: The brains of mice were fixed in paraformaldehyde after anesthesia and perfusion, then cut into 5 µm slices for examination. Sections were then processed for Nissl Staining (NS) or immunohistochemistry (IHC). Optical microscopy was used to observe and capture images. Immunofluorescence (IF): Sections were blocked with 3% BSA in PBS for 30 min at room temperature, then incubated with primary antibodies overnight at 4 °C. After rinsing with cold PBS, secondary antibodies were applied for 1 h at room temperature. Counterstaining was done with DAPI, and images were captured and analyzed using Digital Pathology system and Viewer software. Golgi staining: Experimental animals were injected with anesthesia, then the skin on the top of the mouse skull was cut open to carefully remove the brain. The brain was washed with saline to remove blood stains and then immersed in fixative. Use a shaking slicer for tissue sectioning, with a thickness of 100-200 μm. Capture images with a panoramic digital slice scanning microscope (VS120) and subsequently conduct analysis utilizing Fiji software. The studies used the following antibodies. Anti-GFAP antibody (GB12096, Servicebio, 1:500), anti-IBA-1 antibody (GB12105, Servicebio, 1:500). anti-PSD95 antibody (20665-1-AP, Proteintech, 1:300), anti-SYNAPSIN-1 antibody (20258-1-AP, Proteintech, 1:300), anti-UCP2 antibody (GB11377, Servicebio, 1:300), anti-CD68 antibody ( GB113109 GB111364 GB114324 GB111481 Mendelian randomization analysis Using Mendelian randomization to explore the causal link between coronary atherosclerosis and vascular dementia. The dataset used comes from the IEU Open genome-wide association studies (GWAS) Project. The analysis was performed using the Two Sample MR package (v0.5.7) in R software (v4.3.1). Note: 'Exposure' refers to the exposure data number; 'Outcome' denotes the outcome data number; 'Method' specifies the analysis method employed; 'Q' represents the heterogeneity test Q statistic; 'Q_def' indicates the degrees of freedom associated with the Q statistic; 'Q_pval' is the p-value of the Q statistic, which assesses the statistical significance of the heterogeneity test results. A p-value less than the predetermined significance level (commonly 0.05) suggests the presence of heterogeneity within the data 89 Serum lipidomics The collection and use of human serum samples were approved by Ethics Review Committee of Nanjing Hospital of Chinese Medicine (Ethics Review No. KY2023091). All procedures were performed in strict compliance with the Regulations of Ethical Review of Biomedical Research Involving Human Subjects, the Declaration of Helsinki, and the International Ethical Guidelines for Biomedical Research Involving Human Subjects. Inclusion criteria for clinical serum samples from patients diagnosed with hyperlipidemia are as follows: (1) Demographic parameters: Participants must be aged between 20 and 50 years, with an equal distribution of genders to ensure sample balance. (2) Medical history: Participants should have a confirmed diagnosis of atherosclerosis, while individuals with other metabolic disorders (e.g., diabetes, thyroid disease) are excluded to minimize confounding variables. (3) Biochemical Indicators: The diagnosis of hyperlipidemia is dependent on serum biochemical markers, including cholesterol and triglyceride concentrations. (4) Complications: To maintain the focus of the study and ensure the reliability of the results, individuals with severe complications, such as liver or kidney disease, are excluded. (5) Medication Use: The use of medications by patients is a critical consideration. This study will exclude individuals currently taking drugs that influence lipid metabolism, such as specific steroids or antidepressants, to prevent confounding effects on the outcomes. (6) To avoid individual differences, 4-5 samples were pooled together into one sample for analysis. Samples were thawed on ice, and metabolites were extracted with a lipid extraction buffer. Each 20 μL sample was mixed with 120 μL of precooled buffer (IPA: ACN: H 2 Samples were processed with an LC-MS system following machine instructions. Chromatographic separations used an ACQUITY UPLC System and a Kinetex UPLC C18 column, maintained at 55 °C with a 0.3 ml/min flow rate. The mobile phase comprised solvent A (60% ACN, 40% H 2 A high-resolution TripleTOF6600 mass spectrometer (SCIEX) operated in both positive and negative ion modes with curtain gas at 30 PSI, ion source gases at 60 PSI, and an interface heater at 650 °C. The Ionspray voltage was 5000 V for positive mode and -4500 V for negative mode. Data were collected in IDA mode with a TOF mass range of 60-1200 Da. Survey scans lasted 150 ms, capturing up to 12 product ion scans if they exceeded 100 counts/s and had a 1 + charge state. The cycle time was 0.56 s, using four 11 kHz time bins, monitored by a 40 GHz multichannel TDC detector with four-anode/channel detection. Dynamic exclusion lasted 4 s, and mass accuracy was calibrated every 20 samples. A pooled quality control sample was run after every 10 samples to ensure LC-MS stability. MS data pretreatments, such as peak picking, grouping, retention time correction, and isotope/adduct annotation, were conducted with XCMS software. LC-MS raw data were converted to mzXML and processed using XCMS, CAMERA, and metaX in R, identifying ions by retention time and m/z to create a 3D matrix of peak indices, sample names, and ion intensities. Metabolites were matched to KEGG and HMDB databases within a 10 ppm mass difference, with molecular formulas confirmed by isotopic distribution and validated using an in-house fragment spectrum library. Peak data intensity was processed with metaX, removing features found in less than 50% of QC samples or 80% of biological samples. Missing data were imputed using the k-nearest neighbor method. PCA was used to detect outliers and assess batch effects. A robust LOESS correction was applied to QC data to minimize signal drift over time, and features with over 30% relative standard deviation in QC samples were excluded. Student t-tests identified differences in metabolite concentrations between two phenotypes, with P values adjusted for multiple comparisons using FDR. Supervised PLS-DA via metaX distinguished variables between groups, considering features with a VIP value above 1.0 as important. Gene Expression Omnibus analysis Gene Expression Omnibus (GEO) Dataset: The dataset designated as GSE100927 http://www.ncbi.nlm.nih.gov/geo Molecular dynamics simulations We used Gromacs2020 Molecular dynamics simulations (MD) simulations to investigate NAMPT binding to Alisol-A, using the AMBER99SB-ILDN forcefield for proteins and the GAFF forcefield for ligands. Sobtop was used to establish the GAFF force field. The restrained electrostatic potential (RESP) method26 was then used for charge fitting. The TIP3P water model was used for the explicit waters. The distance between the edge of the box and the solute atom was established at a minimum of 1.0 nm, with the addition of sodium or chloride ions as necessary to achieve charge neutrality within the system. The molecular dynamics simulation process encompassed four key stages: minimization, heating, equilibration, and production run. The ligand-protein complexes were used to calculate the binding free energy. Surface plasmon resonance Surface plasmon resonance (SPR): The aim of this study was to evaluate the binding affinity between NAMPT and Alisol A utilizing SPR technology. For chip preparation, an activator solution was formulated by combining 400 mM EDC and 100 mM NHS immediately before injection. The CM5 sensor chip was activated for 420 s using this mixture at a flow rate of 10 μL/min. Ligand immobilization was performed by diluting NAMPT to a concentration of 20 μg/mL in an immobilization buffer, followed by injection into the sample channel Fc2 at a flow rate of 10 μL/min, typically achieving immobilization levels of approximately 14,700 RU. It is noteworthy that the reference channel Fc1 does not require a ligand immobilization step. Subsequently, the chip was deactivated with 1 M ethanolamine hydrochloride at a flow rate of 10 μL/min for 420 s. Analyte analysis was conducted using a multi-cycle method. Alisol A was diluted with the analyte buffer to achieve eight different concentrations: 100, 50, 25, 12.5, 6.25, 3.12, 1.56, and 0 μM. The Alisol A samples were injected into channels Fc1 through Fc3 at a flow rate of 20 μL/min, allowing for an association phase lasting 100 s, followed by a dissociation phase of 180 s. Both the association and dissociation phases were performed in the analyte buffer. This process was repeated for eight cycles, with analyte concentrations increasing sequentially. After each cycle of interaction analysis, the chip was regenerated. Cell culture The HT22 cell line comes from immortalized mouse hippocampal neurons and was obtained from the Chinese Academy of Sciences cell bank. The culture medium was purchased from Gibco, USA. After growing to 80% confluence, the HT22 cells were used for the experiment. HT22 cells were enriched with cholesterol using β-Amyloid (25-35) (Aβ 25-35 81 90 Primary neuron isolation. Cortical (or hippocampal) neurons were isolated from postnatal day 0-1 (P0-P1) C57BL/6, as previously described. Briefly, brain tissue was dissected, digested with papain, and triturated into single-cell suspension. Neurons were cultured in Neurobasal medium supplemented with B27, GlutaMAX, and penicillin-streptomycin. Cultures were maintained for 7-10 days in vitro Mitochondria membrane potential Mitochondrial activity was measured using JC-1 staining (C2006, Biyuntian, China). After cell treatments, the culture medium was removed and cells were washed three times with PBS. The cells were then exposed to JC-1 working solution for a duration of 20 min at 37 °C, followed by two washes with JC-1 staining buffer, and subsequently visualized using an Olympus fluorescence microscope. Carbonyl cyanide m-chlorophenyl hydrazone (CCCP) (C2006-4, Biyuntian, China) was used to activate mitophagy. Control cells were treated with or without 10 μM CCCP for 20 min. NAD + NAD + + + + ROS, SOD, GSH, and MDA Intracellular reactive oxygen species (ROS) levels were quantified through the utilization of 2', 7'-Dichlorofluorescein diacetate (DCFH-DA, D6883, Sigma-Aldrich) fluorescence. Incubate the sample with a 1000-fold diluted solution of DCFH-DA for a duration of 1 h. The mean fluorescence intensity at an excitation wavelength of 488 nm and an emission wavelength of 535 nm was measured utilizing an Accuri C6 flow cytometer (Beckman Coulter, Brea, CA, USA). Nanjing Jiancheng assay kits were used to measure superoxide dismutase (SOD) (A001-3-2), reduced glutathione (GSH) (A006-2-1), and malondialdehyde (MDA) (A003-4-1) activity in mouse hippocampal tissues as per the manufacturer's instructions. Western blotting Proteins were extracted, electrophoresed, and transferred onto a PVDF membrane. Blots were blocked with milk, incubated with primary and secondary antibodies, and washed with TBST. After dripping the developing solution on the membrane, the chemiluminescence imaging system was used for detection. Blotted bands were quantified with Image J software. The studies used the following antibodies. GAPDH (2118, Cell Signaling Technology, 1:1000), anti-SREBP2 antibody (DF7601, Affinity, 1:1000), anti-NR1H3 Polyclonal antibody (14351-1-AP, Proteintech, 1:2000), anti-CYP46A1 antibody (12486-1-AP, Proteintech, 1:1000), anti-UCP2 antibody (89326, Cell Signaling Technology, 1:1000). anti-AMPK antibody(2532, Cell Signaling Technology, 1:1000), anti-p-AMPKα Thr172 or Thr183 GB114323 T55546 GB112053 T55992 GB111481 siRNA was used to knock down NAMPT expression The Small molecule interfering RNA (siRNA) was purchased from Shanghai Shenggong Biological Engineering Co., Ltd. Following the manufacturer's instructions, Lipofectamine RNAiMAX transfection reagent (13778150, ThermoFisher Scientific, USA) was used for transfection. The lyophilized siRNA was dissolved in RNase-free water to a concentration of 20 μM and aliquoted for storage at -20 °C. For the experiment, the siRNA was diluted to the required working concentration (final 50 nM) using Opti-MEM (Gibco). HT22 cells were seeded at 2 × 10⁵ cells/well in a 6-well plate, with 2 mL of complete medium per well, and cultured until the cells adhered and reached approximately 50-60% confluence. The pre-diluted siRNA was slowly added to the transfection reagent working solution, gently mixed, and incubated at room temperature for 15 min to form stable complexes. The siRNA-transfection reagent mixture was then evenly distributed into each well, and the plate was gently shaken to ensure even distribution within the wells. After 4 to 6 h of transfection, the old medium was discarded, and 2 mL of fresh complete medium was added to continue culture for 48 h. After collecting the cells, protein extraction was performed, and Western blotting was conducted to detect the expression of the target protein. Lentivirus-induced overexpression of NAMPT in cells The NAMPT lentivirus used in the experiment was purchased from Shanghai Jikai Gene Biotechnology Co., Ltd. Before the experiment, cells were prepared as a single-cell suspension at a concentration of 5 × 10⁴ cells/mL and evenly seeded into a 12-well plate. When the cell confluence reached approximately 60% to 70%, the virus infection process was initiated. A virus infection system was prepared based on a multiplicity of infection (MOI) of 10. The original culture medium was then discarded, and fresh complete culture medium was added, along with the prepared infection solution. After a 12 h exposure to the virus, the medium was replaced, and the cells' growth status was monitored in real-time using a microscope. Once the cells stabilized, the culture medium was changed to complete medium containing 1 μg/mL puromycin to select for successfully infected cells, while the transfection efficiency was assessed under a fluorescence microscope. Finally, samples with optimal infection efficiency were selected for subsequent protein extraction and related experimental analysis. Co-immunoprecipitation Co-Immunoprecipitation (COIP): Protein immunoprecipitation kit (Protein A/G magnetic bead method) (G2237, Servicebio). Add an appropriate amount of pre cooled IP cell lysis buffer to the cell culture dish (add protease inhibitor to the IP lysis buffer), lyse the cells at 4 °C for 10 min, and repeatedly blow with a pipette during this period. Then transfer the cell suspension to a 1.5 ml centrifuge tube and continue to lyse on ice for 20 min; Centrifuge at 12000 rpm and 4 °C for 10 min, transfer the supernatant into a new 1.5 ml centrifuge tube, operate on ice, and then measure using the BCA method; Take a small amount of supernatant and denature it for input experiments, i.e. WB detection of target proteins. Add 1.0 μg of IgG and 20 μL of protein A/G beads (thoroughly mixed before use) to the supernatant of the negative control (IgG) group protein. The experimental group directly adds 20 μL of protein A/G beads and incubates at 4 °C for 1 h by shaking; 2000 g, 4 °C, centrifuge for 5 min, take the supernatant; Add antibodies and incubate overnight at 4 °C; Add 80 μL of protein A/G beads and incubate at 4 °C for 2 h; 4 °C, 2000 g, centrifuge for 5 min, collect immunoprecipitation complexes; Wash the immunoprecipitation complex with 1ml pre cooled IP lysis buffer 4 times, each time at 4 °C, 2000 g, and centrifuge for 5 min; After the last wash, try to absorb the supernatant as much as possible, then add 80 μL of 1 × reduction type loading buffer, boil in boiling water for 10 min, 4 °C, 1000 g, centrifuge for 5 min, and take the supernatant sample for WB detection. Cells were treated with 1 μM acetyltransferase inhibitor - trichostatin A (TSA) (A8183, APExBIO) and 5 mM acetyltransferase activator - nicotinamide (NAM) (HY-B0150, MCE) for 12 h. Statistical processing SPSS 18.0 was used for statistical analysis, reporting means ± SEM, with one-way ANOVA and LSD-t test for group comparisons. Results Alisol A improves Atherosclerosis related vascular cognitive impairment in Ldlr -/- As shown in the mouse experimental design flowchart, Ldlr -/- 1 Ldlr -/- 1 P P Ldlr -/- Ldlr -/- 1 P 1 Ldlr -/- Ldlr -/- 1 P Ldlr -/- 1 P P Ldlr -/- 1 1 Ldlr -/- Ldlr -/- 1 Ldlr -/- 1 Ldlr -/- Ldlr -/- Alisol A protects hippocampus neurons from cholesterol metabolism disorders and oxidative stress damage In the in vitro 25-35 20 91 92 93 94 95 First, in the in vitro cell experiments, the results showed that, compared with the control group, in both HT22 cells treated with Aβ 25-35 2 P 2 P in vivo Ldlr -/- 2 P 2 P P Ldlr -/- 2 P Figure 2 91 95 Multiple studies have shown that high cholesterol exacerbates oxidative stress and impairs neuronal function 96 97 98 in vivo Ldlr -/- Ldlr -/- 2 2 P P In the in vitro 25-35 2 P 25-35 2 P P Alisol A exerts neuroprotective effects in Ldlr -/- HE and Nissl staining were used to analyze hippocampal neuronal morphology in the CA1 and DG regions. The control group showed normal hippocampal morphology with well-organized cell layers and consistent staining (Figure 3 Ldlr -/- Ldlr -/- Subsequently, we examined glial inflammatory responses through immunostaining for the glial markers IBA1 (microglia) and GFAP (astrocytes) (Figure 3 Ldlr -/- 3 3 3 Ldlr -/- 3 3 3 Synaptic dysfunction in the hippocampus is the primary cause of cognitive decline 99 100 Ldlr -/- 3 Ldlr -/- Ldlr -/- 3 3 Ldlr -/- 3 AMPK pathway and autophagy may be key mechanisms of Alisol A, with NAMPT playing an important role in their regulation We conducted a two-sample mendelian randomization study, utilizing data from GWAS, to elucidate the causal effect of coronary atherosclerosis on vascular dementia (Figure 4 Table S1 P Table S3 4 4 GSE100927 NAMPT, SIRT1, CYP46A1 LDLR P P TLR4 mTOR 4 P P NAMPT NAMPT Molecular docking simulation demonstrated Alisol A binding to NAMPT, forming hydrogen bonds at GLN-305 and TYR-188 residues. This suggests Alisol A could be an effective agonist for NAMPT activity Figure 4 4 4 4 4 4 4 Alisol A activates the AMPK/NAMPT/SIRT1 pathway and autophagy pathway Peroxisome proliferator-activated receptor gamma coactivator 1-alpha (PGC1-α) is a key cofactor of SIRT1 and plays a role in mitochondrial function and biogenesis 101 102 103 Figure 5 in vivo Ldlr -/- Thr172 or Thr183 5 P P + Ldlr -/- 5 P Ldlr -/- Thr172 or Thr183 + 5 P P Thr172 or Thr183 Thr172 or Thr183 5 P P + 5 P P 5 To investigate the effect of Alisol A on neuronal mitophagy, we measured the expression of autophagy-related proteins by Western blot. Specifically, we probed the autophagic substrate P62 (Sequestosome 1), the key initiation protein BECLIN1, the mitophagy markers PINK1 and PARKIN, and the mitochondrial membrane proteins TOM20 (Translocase of the outer membrane 20) and COXIV. We also assessed LC3B I (Microtubule-associated protein 1A/1B-light chain 3B I) -to-LC3BII conversion to gauge autophagosome formation, and calculated LC3BII/LC3BI and PARKIN/COXIV ratios as quantitative indices of autophagic flux and mitophagy activity. Mitophagy is essential for removing damaged mitochondria and maintaining mitochondrial quality. P62 is a selective autophagy substrate whose levels inversely correlate with overall autophagic activity; its accumulation indicates impaired autophagy 104 105 The results of this study show that, compared to the control group, HT22 cells treated with Aβ 25-35 25-35 5 P P 5 P P 25-35 5 P P The study indicates that mitochondrial membrane potential (MMP) depolarization is positively correlated with the induction of mitophagy 106 108 106 107 109 5 P P 25-35 25-35 5 P P NAMPT as a key target in Alisol A's treatment of atherosclerosis related vascular cognitive impairment To further confirm the protective role of Alisol A is associated with NAMPT, this study used the selective NAMPT inhibitor FK866 to block the NAMPT-related pathway activated by Alisol A. In the in vivo in vitro in vivo in vitro The water maze experiment showed that, compared to the Ldlr -/- 6 P P Ldlr -/- 6 P P Ldlr -/- 6 P P Ldlr -/- 6 P + 6 P Ldlr -/- To investigate the effects of NAMPT on cholesterol metabolism, we examined how modulation of NAMPT expression alters cholesterol homeostasis in both in vitro in vivo 110 6 P P 6 P P 6 P P Protein acetylation is co-regulated by deacetylases (HDACs) and acetyltransferases (HATs). Consequently, we employed two categories of deacetylase inhibitors to target distinct deacetylase activities: type I and type II HDAC family inhibitors, specifically TSA, and a type III (Sirtuins family) inhibitor, NAM. To ensure robust participation of NAMPT in immunoprecipitation assays, we used lentiviral overexpression to substantially increase NAMPT levels. This ensured sufficient protein abundance for detection of its interactions with other proteins. Compared with the IgG control, SIRT1, CYP46A1, and acetyl-lysine modified proteins were all detected in NAMPT immunoprecipitates, indicating that NAMPT interacts with SIRT1, CYP46A1, and acetylated lysine residues and is involved in protein acetylation (Figure 6 P P Relative to the non-IgG control, both TSA- and NAM-treated groups exhibited markedly reduced SIRT1 co-precipitation and significantly increased lysine acetylation. Moreover, TSA treatment produced a significantly lower acetyl-lysine signal than NAM treatment, indicating that NAMPT-mediated protein acetylation is primarily regulated by Sirtuin family deacetylases, particularly SIRT1 (Figure 6 P P 25-35 25-35 25-35 6 P P The inhibition of Nampt attenuates autophagy by diminishing its interaction with PINK1, consequently decreasing the advantageous effects of Alisol A in mitigating oxidative stress and restoring synaptic plasticity To investigate the role of NAMPT in regulating mitophagy, we performed various interventions in Ldlr -/- Ldlr -/- 7 P P 7 P P The PARKIN/COXIV ratio is used to assess mitophagy activation 111 112 113 in vitro 25-35 7 P P 7 P P 7 P P 7 P P 7 P P 7 P P OPTN, an autophagy receptor, is recruited to the mitochondrial surface where it promotes clearance of damaged mitochondria by binding autophagy proteins such as LC3 114 7 P 115 116 To further elucidate the molecular mechanism by which NAMPT regulates mitophagy, we investigated whether NAMPT directly interacts with PINK1 to influence PINK1 expression and stability. Knockdown of NAMPT significantly reduced PINK1 levels in HT22 cells (Figure 7 P 7 P 25-35 25-35 7 P To clarify NAMPT's role in redox homeostasis in the nervous system and to determine whether Alisol A exerts antioxidant effects via the NAMPT pathway, we evaluated UCP2 expression and ROS levels. Immunofluorescence in the hippocampal CA3 region showed that, compared with Ldlr -/- 7 P 7 P Compared with Ldlr -/- 7 P 7 P P 117 118 7 P P Discussion In this study, Alisol A demonstrated potent lipid-modulating and anti-atherosclerotic effects. It lowered serum triglyceride, total cholesterol, and LDL-cholesterol levels, reduced aortic plaque burden, and attenuated lipid deposition in brain tissue. Oil red O and HE staining, together with immunohistochemistry, confirmed that Alisol A markedly decreased lipid content within atherosclerotic lesions, improved plaque architecture, and suppressed α-smooth muscle actin and CD68 expression, indicating stabilization of plaques, anti-inflammatory activity, and inhibition of lesion progression. Behavioral assays including the Morris water maze, Y-maze, and novel object recognition tests revealed that Alisol A significantly enhanced learning, spatial memory, and recognition abilities in Ldlr -/- Disruption of cholesterol metabolism and oxidative stress are key pathological mechanisms in the development of AS related VCI. Alterations in brain cholesterol in humans have been implicated in various neurological and neurodegenerative diseases 12 13 22 23 24 Ldlr -/- Ldlr -/- 12 119 120 121 Ldlr -/- In vitro 25-35 Ldlr -/- Mendelian randomization analysis confirmed that atherosclerosis is a significant risk factor for vascular dementia. Combined lipid metabolomics revealed that differential metabolites were significantly enriched in the AMPK signaling pathway and autophagy pathways. Analysis of GEO datasets showed that NAMPT expression was most markedly altered in atherosclerosis patient samples ( P In vivo 25-35 122 124 125 127 Lysine acetylation represents a reversible post-translational modification capable of modifying protein conformation, consequently influencing its stability, DNA binding affinity, and enzymatic activity. This modification is intricately linked to the cellular metabolic state, as acetyl CoA, the primary substrate for energy production, serves as the exclusive donor of acetyl groups for acetylation processes. Additionally, NAD + 128 sirt1 nampt Ldlr -/- nampt Ldlr -/- Sirt1 102 103 Nampt sirt1 129 130 Sirt1 88 131 In this study, in vivo nampt Ldlr -/- In vitro 25-35 25 26 23 27 132 133 Cyp46a1 19 28 29 Mitophagy is essential for maintaining mitochondrial homeostasis by selectively degrading damaged mitochondria, thus adjusting mitochondrial quantity in response to metabolic demands 134 135 111 111 136 137 139 111 140 49 50 25-35 Ldlr -/- In this study, it was noted that an elevation in the autophagy substrate protein P62, in conjunction with PINK1/PARKIN-dependent compromised mitophagy, was apparent in Ldlr -/- 25-35 Ldlr -/- Immunofluorescence analysis showed that FK866 significantly reduced UCP2 expression, while NMN and Alisol A treatment restored UCP2 levels. ROS assays revealed that FK866 increased ROS accumulation, whereas NAMPT overexpression and Alisol A treatment effectively reduced ROS levels. At the synaptic level, FK866 decreased Synapsin-1 and PSD95 expression in the hippocampus, as shown by immunofluorescence, while both NMN and Alisol A upregulated these synaptic markers. Golgi staining combined with Sholl analysis confirmed that Alisol A increased dendritic spine density and the proportion of mature mushroom-shaped spines, ameliorating FK866-induced dendritic damage. Analysis of NMDA receptor subunits revealed that FK866 suppressed NMDA 2B and increased NMDA 2A expression, indicating a shift toward synaptic inhibition. Alisol A restored the NMDA 2B/2A expression ratio, suggesting enhanced synaptic signaling. Collectively, these findings demonstrate that NAMPT plays a key role in regulating neuronal oxidative stress and synaptic plasticity. Upregulation of NAMPT helps maintain synaptic structure and functional stability. By activating the NAMPT pathway, Alisol A alleviates oxidative damage and promotes synaptic remodeling, thereby effectively improving VCI-related neurological dysfunction. In conclusion, NAMPT is a critical therapeutic target of Alisol A in the treatment of atherosclerosis-related vascular cognitive impairment. Through NAMPT regulation, Alisol A improves cholesterol metabolism, restores mitophagic activity, facilitates the clearance of damaged mitochondria, reduces oxidative stress, and enhances synaptic plasticity, ultimately exerting neuroprotective effects. However, this study has certain limitations. Although FK866 induces MMP collapse and activates apoptosis by inhibiting NAMPT, it lacks single-cell level tracking of the spatiotemporal dynamics underlying the crosstalk between autophagy and apoptosis. It is important to note that autophagy plays a dual role in neurodegenerative conditions: moderate autophagy can remove misfolded proteins and support neuronal survival, whereas excessive autophagy may lead to lysosomal membrane permeabilization and trigger apoptosis 141 142 144 145 Conclusions In conclusion, this study demonstrates two key findings: First, Alisol A exerts neuroprotective effects by activating the AMPK/NAMPT/SIRT1 signaling pathway in hippocampal tissue and neurons, thereby promoting PINK1/PARKIN-mediated mitophagy and restoring the function of damaged mitochondria. Second, NAMPT is identified as a critical therapeutic target of Alisol A in the treatment of AS related VCI. Through regulation of NAMPT, Alisol A improves cholesterol metabolism, restores mitophagic activity, facilitates the clearance of damaged mitochondria, alleviates oxidative stress, and promotes the reconstruction of synaptic plasticity, ultimately contributing to neuroprotection. Our research results offer valuable insights for the continued advancement of Alisol A as a promising lead compound in research as potential anti-AS related VCI candidates. Supplementary Material Supplementary tables. Funding This study was funded by grants from the Natural Science Foundation of China (82074292), the NATCM's Project of High-level Construction of Key TCM Disciplines (2023, Grant No.85), and the Postgraduate Research & Practice Innovation Program of Jiangsu Province (SJCX24_0930). Author contributions P.X. and W.Z. conducted experiments, analyzed data, and wrote the manuscript equally. D.W., L.W., Y.B., and S.X. conducted in vitro Compliance with ethics requirements All Institutional and National Guidelines for the care and use of animals (fisheries) were followed. Abbreviations AS Atherosclerosis VCI Vascular cognitive impairment ZXYF ZeXieYin Formula VaD Vascular dementia LDL Low-density lipoprotein LDL-c Low-density lipoprotein cholesterol ox-LDL Oxidized low-density lipoprotein CSVD Cerebral small vessel disease BBB Blood brain barrier Aβ Amyloid-β LXR Liver X receptor NLRP3 NOD-like receptor family pyrin domain containing 3 TCM Traditional Chinese medicine AMPK AMP-activated protein kinase NAMPT Nicotinamide phosphoribosyltransferase SIRT1 Sirtuin 1 NMN Nicotinamide mononucleotide MWM Morris water maze NOR Novel object recognition ROS Reactive oxygen species SOD Superoxide dismutase GSH Glutathione MDA Malondialdehyde UCP2 Uncoupling protein 2 CYP46A1 Cholesterol 24-hydroxylase HMGCR 3-hydroxy-3-methylglutaryl-coenzyme A reductase ABCA1 ATP-binding cassette transporter A1 ABCG5/8 ATP-binding cassette subfamily G members 5/8 SREBP2 Sterol regulatory element-binding protein 2 PGC1-α Peroxisome proliferator-activated receptor gamma coactivator 1-alpha LC3B Microtubule-associated protein 1A/1B-light chain 3B PINK1 PTEN-induced kinase 1 PARKIN E3 ubiquitin-protein ligase PARK2 TOM20 Translocase of the outer membrane 20 COXIV Cytochrome c oxidase subunit IV BECLIN1 Autophagy protein Beclin-1 P62/SQSTM1 Sequestosome 1 OPTN Optineurin NR2A/NR2B NMDA receptor subunits 2A and 2B PSD95 Postsynaptic density protein 95 SPR Surface plasmon resonance GEO Gene Expression Omnibus GWAS Genome-wide association study IVW Inverse variance weighted TEM Transmission electron microscopy IHC Immunohistochemistry IF Immunofluorescence COIP Co-immunoprecipitation MMP Mitochondrial membrane potential TSA Trichostatin A NAM Nicotinamide NAD⁺ Nicotinamide adenine dinucleotide 1 Tian X Zhu M Ma Y Wang N Shi L Liu C Physical and biopsychosocial frailty, cognitive phenotypes, and plasma biomarkers for Alzheimer's disease in Chinese older adults: A population-based study Alzheimers Dement 2025 21 e70303 40399764 10.1002/alz.70303 PMC12094879 2 Collyer TA Liu M Beare R Andrew NE Ung D Carver A Dual-stream algorithms for dementia detection: Harnessing structured and unstructured electronic health record data, a novel approach to prevalence estimation Alzheimers Dement 2025 21 e70132 40325920 10.1002/alz.70132 PMC12053150 3 Lett TA Vaidya N Jia T Polemiti E Banaschewski T Bokde ALW Framework for Brain-Derived Dimensions of Psychopathology JAMA Psychiatry 2025 10.1001/jamapsychiatry.2025.1246 PMC12177734 40531512 4 Hayes CA Young CB Abdelnour C Reeves A Odden MC Nirschl J The impact of arteriolosclerosis on cognitive impairment in decedents without severe dementia from the National Alzheimer's Coordinating Center Alzheimers Dement 2025 21 e70059 40110658 10.1002/alz.70059 PMC11923572 5 Markus HS Joutel A The pathogenesis of cerebral small vessel disease and vascular cognitive impairment Physiol Rev 2025 105 1075 171 39965059 10.1152/physrev.00028.2024 PMC12182829 6 Ashok A Rai NK Raza W Pandey R Bandyopadhyay S Chronic cerebral hypoperfusion-induced impairment of Abeta clearance requires HB-EGF-dependent sequential activation of HIF1alpha and MMP9 Neurobiol Dis 2016 95 179 93 27431094 10.1016/j.nbd.2016.07.013 7 Nyul-Toth A Patai R Csiszar A Ungvari A Gulej R Mukli P Linking peripheral atherosclerosis to blood-brain barrier disruption: elucidating its role as a manifestation of cerebral small vessel disease in vascular cognitive impairment Geroscience 2024 46 6511 36 38831182 10.1007/s11357-024-01194-0 PMC11494622 8 Jinson S Zhang Z Lancaster GI Murphy AJ Morgan PK Iron, lipid peroxidation, and ferroptosis play pathogenic roles in atherosclerosis Cardiovasc Res 2025 121 44 61 39739567 10.1093/cvr/cvae270 9 French SR Meyer BP Arias JC Levendovzsky SR Weinkauf CC Biomarkers of blood-brain barrier and neurovascular unit integrity in human cognitive impairment and dementia Alzheimers Dement 2025 21 e70104 40145342 10.1002/alz.70104 PMC11947770 10 Markus HS Joutel A The pathogenesis of cerebral small vessel diseases and vascular cognitive impairment Physiol Rev 2025 10.1152/physrev.00028.2024 PMC12182829 39965059 11 Poh L Sim WL Jo DG Dinh QN Drummond GR Sobey CG The role of inflammasomes in vascular cognitive impairment Mol Neurodegener 2022 17 4 35000611 10.1186/s13024-021-00506-8 PMC8744307 12 Suzuki R Lee K Jing E Biddinger SB McDonald JG Montine TJ Diabetes and insulin in regulation of brain cholesterol metabolism Cell Metab 2010 12 567 79 21109190 10.1016/j.cmet.2010.11.006 PMC3205997 13 Li T Yin Y Zhou Z Qiu J Liu W Zhang X Ion mobility-based sterolomics reveals spatially and temporally distinctive sterol lipids in the mouse brain Nat Commun 2021 12 4343 34267224 10.1038/s41467-021-24672-x PMC8282640 14 Zhang Q Huang S Cao Y Dong G Chen Y Zhu X Remnant cholesterol and mild cognitive impairment: A cross-sectional study Front Aging Neurosci 2023 15 1069076 37009458 10.3389/fnagi.2023.1069076 PMC10057110 15 Solomon A Kareholt I Ngandu T Winblad B Nissinen A Tuomilehto J Serum cholesterol changes after midlife and late-life cognition: twenty-one-year follow-up study Neurology 2007 68 751 6 17339582 10.1212/01.wnl.0000256368.57375.b7 16 Iwagami M Qizilbash N Gregson J Douglas I Johnson M Pearce N Blood cholesterol and risk of dementia in more than 1.8 million people over two decades: a retrospective cohort study Lancet Healthy Longev 2021 2 e498 e506 36097999 10.1016/S2666-7568(21)00150-1 17 Ishii M Midlife dyslipidaemia as a modifiable risk factor for later-life dementia Lancet Healthy Longev 2021 2 e453 e4 36097993 10.1016/S2666-7568(21)00175-6 18 Ge X Zheng M Hu M Fang X Geng D Liu S Butyrate ameliorates quinolinic acid-induced cognitive decline in obesity models J Clin Invest 2023 133 10.1172/JCI154612 PMC9927952 36787221 19 Liu LC Liang JY Liu YH Liu B Dong XH Cai WH The Intersection of cerebral cholesterol metabolism and Alzheimer's disease: Mechanisms and therapeutic prospects Heliyon 2024 10 e30523 38726205 10.1016/j.heliyon.2024.e30523 PMC11079309 20 de Dios C Abadin X Roca-Agujetas V Jimenez-Martinez M Morales A Trullas R Inflammasome activation under high cholesterol load triggers a protective microglial phenotype while promoting neuronal pyroptosis Transl Neurodegener 2023 12 10 36895045 10.1186/s40035-023-00343-3 PMC9996936 21 Liao J Chen G Liu X Wei ZZ Yu SP Chen Q C/EBPbeta/AEP signaling couples atherosclerosis to the pathogenesis of Alzheimer's disease Mol Psychiatry 2022 27 3034 46 35422468 10.1038/s41380-022-01556-0 PMC9912845 22 MacHugh ND Bensaid A Davis WC Howard CJ Parsons KR Jones B Characterization of a bovine thymic differentiation antigen analogous to CD1 in the human Scand J Immunol 1988 27 541 7 3287595 10.1111/j.1365-3083.1988.tb02381.x 23 Baloni P Funk CC Yan J Yurkovich JT Kueider-Paisley A Nho K Metabolic Network Analysis Reveals Altered Bile Acid Synthesis and Metabolism in Alzheimer's Disease Cell Rep Med 2020 1 100138 33294859 10.1016/j.xcrm.2020.100138 PMC7691449 24 Essayan-Perez S Sudhof TC Neuronal gamma-secretase regulates lipid metabolism, linking cholesterol to synaptic dysfunction in Alzheimer's disease Neuron 2023 111 3176 94 e7 37543038 10.1016/j.neuron.2023.07.005 PMC10592349 25 Beck SJ Guo L Phensy A Tian J Wang L Tandon N Deregulation of mitochondrial F1FO-ATP synthase via OSCP in Alzheimer's disease Nat Commun 2016 7 11483 27151236 10.1038/ncomms11483 PMC5494197 26 Barbero-Camps E Roca-Agujetas V Bartolessis I de Dios C Fernandez-Checa JC Mari M Cholesterol impairs autophagy-mediated clearance of amyloid beta while promoting its secretion Autophagy 2018 14 1129 54 29862881 10.1080/15548627.2018.1438807 PMC6103708 27 Testa G Staurenghi E Zerbinati C Gargiulo S Iuliano L Giaccone G Changes in brain oxysterols at different stages of Alzheimer's disease: Their involvement in neuroinflammation Redox Biol 2016 10 24 33 27687218 10.1016/j.redox.2016.09.001 PMC5040635 28 Paul SM Doherty JJ Robichaud AJ Belfort GM Chow BY Hammond RS The major brain cholesterol metabolite 24(S)-hydroxycholesterol is a potent allosteric modulator of N-methyl-D-aspartate receptors J Neurosci 2013 33 17290 300 24174662 10.1523/JNEUROSCI.2619-13.2013 PMC3812502 29 Wei X Nishi T Kondou S Kimura H Mody I Preferential enhancement of GluN2B-containing native NMDA receptors by the endogenous modulator 24S-hydroxycholesterol in hippocampal neurons Neuropharmacology 2019 148 11 20 30594698 10.1016/j.neuropharm.2018.12.028 PMC6424632 30 Suri MFK Zhou J Qiao Y Chu H Qureshi AI Mosley T Cognitive impairment and intracranial atherosclerotic stenosis in general population Neurology 2018 90 e1240 e7 29523643 10.1212/WNL.0000000000005250 PMC5890611 31 de Montgolfier O Pouliot P Gillis MA Ferland G Lesage F Thorin-Trescases N Systolic hypertension-induced neurovascular unit disruption magnifies vascular cognitive impairment in middle-age atherosclerotic LDLr(-/-):hApoB(+/+) mice Geroscience 2019 41 511 32 31093829 10.1007/s11357-019-00070-6 PMC6885084 32 Yan J Porch MW Court-Vazquez B Bennett MVL Zukin RS Activation of autophagy rescues synaptic and cognitive deficits in fragile X mice Proc Natl Acad Sci U S A 2018 115 E9707 E16 30242133 10.1073/pnas.1808247115 PMC6187122 33 Fernandez A Meechan DW Karpinski BA Paronett EM Bryan CA Rutz HL Mitochondrial Dysfunction Leads to Cortical Under-Connectivity and Cognitive Impairment Neuron 2019 102 1127 42 e3 31079872 10.1016/j.neuron.2019.04.013 PMC6668992 34 Larramona-Arcas R Gonzalez-Arias C Perea G Gutierrez A Vitorica J Garcia-Barrera T Sex-dependent calcium hyperactivity due to lysosomal-related dysfunction in astrocytes from APOE4 versus APOE3 gene targeted replacement mice Mol Neurodegener 2020 15 35 32517777 10.1186/s13024-020-00382-8 PMC7285605 35 Chen Z Geng Y Gao R Zhong H Chen J Mu X Maternal exposure to CeO(2)NPs derails placental development through trophoblast dysfunction mediated by excessive autophagy activation J Nanobiotechnology 2022 20 131 35292031 10.1186/s12951-022-01334-8 PMC8922923 36 Youle RJ Narendra DP Mechanisms of mitophagy Nat Rev Mol Cell Biol 2011 12 9 14 21179058 10.1038/nrm3028 PMC4780047 37 Fang EF Hou Y Palikaras K Adriaanse BA Kerr JS Yang B Mitophagy inhibits amyloid-beta and tau pathology and reverses cognitive deficits in models of Alzheimer's disease Nat Neurosci 2019 22 401 12 30742114 10.1038/s41593-018-0332-9 PMC6693625 38 Dodson M Liang Q Johnson MS Redmann M Fineberg N Darley-Usmar VM Inhibition of glycolysis attenuates 4-hydroxynonenal-dependent autophagy and exacerbates apoptosis in differentiated SH-SY5Y neuroblastoma cells Autophagy 2013 9 1996 2008 24145463 10.4161/auto.26094 PMC4028343 39 Lou G Palikaras K Lautrup S Scheibye-Knudsen M Tavernarakis N Fang EF Mitophagy and Neuroprotection Trends Mol Med 2020 26 8 20 31375365 10.1016/j.molmed.2019.07.002 40 Wiley CD Velarde MC Lecot P Liu S Sarnoski EA Freund A Mitochondrial Dysfunction Induces Senescence with a Distinct Secretory Phenotype Cell Metab 2016 23 303 14 26686024 10.1016/j.cmet.2015.11.011 PMC4749409 41 Purhonen J Banerjee R Wanne V Sipari N Morgelin M Fellman V Mitochondrial complex III deficiency drives c-MYC overexpression and illicit cell cycle entry leading to senescence and segmental progeria Nat Commun 2023 14 2356 37095097 10.1038/s41467-023-38027-1 PMC10126100 42 Liu Y Yan J Sun C Li G Li S Zhang L Ameliorating mitochondrial dysfunction restores carbon ion-induced cognitive deficits via co-activation of NRF2 and PINK1 signaling pathway Redox Biol 2018 17 143 57 29689442 10.1016/j.redox.2018.04.012 PMC6006734 43 Yang C Su C Iyaswamy A Krishnamoorthi SK Zhu Z Yang S Celastrol enhances transcription factor EB (TFEB)-mediated autophagy and mitigates Tau pathology: Implications for Alzheimer's disease therapy Acta Pharm Sin B 2022 12 1707 22 35847498 10.1016/j.apsb.2022.01.017 PMC9279716 44 Zeng K Yu X Mahaman YAR Wang JZ Liu R Li Y Defective mitophagy and the etiopathogenesis of Alzheimer's disease Transl Neurodegener 2022 11 32 35655270 10.1186/s40035-022-00305-1 PMC9164340 45 Lu Y Li Z Zhang S Zhang T Liu Y Zhang L Cellular mitophagy: Mechanism, roles in diseases and small molecule pharmacological regulation Theranostics 2023 13 736 66 36632220 10.7150/thno.79876 PMC9830443 46 Cho YH Kim GH Park JJ Mitochondrial aconitase 1 regulates age-related memory impairment via autophagy/mitophagy-mediated neural plasticity in middle-aged flies Aging Cell 2021 20 e13520 34799973 10.1111/acel.13520 PMC8672789 47 Zhu DD Huang YL Guo SY Li N Yang XW Sui AR AQP4 Aggravates Cognitive Impairment in Sepsis-Associated Encephalopathy through Inhibiting Na(v) 1.6-Mediated Astrocyte Autophagy Adv Sci (Weinh) 2023 10 e2205862 36922751 10.1002/advs.202205862 PMC10190498 48 Kaushik S Cuervo AM Degradation of lipid droplet-associated proteins by chaperone-mediated autophagy facilitates lipolysis Nat Cell Biol 2015 17 759 70 25961502 10.1038/ncb3166 PMC4449813 49 Shi Y Wang M Wang P Zhang T Yu J Shi L Alisol A is potentially therapeutic in human breast cancer cells Oncol Rep 2020 44 1266 74 32582967 10.3892/or.2020.7654 50 Lou C Xu X Chen Y Zhao H Alisol A Suppresses Proliferation, Migration, and Invasion in Human Breast Cancer MDA-MB-231 Cells Molecules 2019 24 10.3390/molecules24203651 PMC6833085 31658635 51 Xu W Li T Qiu JF Wu SS Huang MQ Lin LG Anti-proliferative activities of terpenoids isolated from Alisma orientalis and their structure-activity relationships Anticancer Agents Med Chem 2015 15 228 35 24893804 10.2174/1871520614666140601213514 52 Ace CI Dalrymple MA Ramsay FH Preston VG Preston CM Mutational analysis of the herpes simplex virus type 1 trans-inducing factor Vmw65 J Gen Virol 1988 69 Pt 10 2595 605 2844968 10.1099/0022-1317-69-10-2595 53 Govyrin VN Didenko AV Iazykov VV [Electrochemical phenomena in autoregulatory reactions of the blood vessels] Fiziol Zh SSSR Im I M Sechenova 1989 75 3 7 2924968 54 Park JH Long A Owens K Kristian T Nicotinamide mononucleotide inhibits post-ischemic NAD(+) degradation and dramatically ameliorates brain damage following global cerebral ischemia Neurobiol Dis 2016 95 102 10 27425894 10.1016/j.nbd.2016.07.018 PMC5580241 55 Malik N Ferreira BI Hollstein PE Curtis SD Trefts E Weiser Novak S Induction of lysosomal and mitochondrial biogenesis by AMPK phosphorylation of FNIP1 Science 2023 380 eabj5559 37079666 10.1126/science.abj5559 PMC10794112 56 Yoshino J Mills KF Yoon MJ Imai S Nicotinamide mononucleotide, a key NAD(+) intermediate, treats the pathophysiology of diet- and age-induced diabetes in mice Cell Metab 2011 14 528 36 21982712 10.1016/j.cmet.2011.08.014 PMC3204926 57 Yao H Liu M Wang L Zu Y Wu C Li C Discovery of small-molecule activators of nicotinamide phosphoribosyltransferase (NAMPT) and their preclinical neuroprotective activity Cell Res 2022 32 570 84 35459935 10.1038/s41422-022-00651-9 PMC9160276 58 Wang L Liu M Zu Y Yao H Wu C Zhang R Optimization of NAMPT activators to achieve in vivo neuroprotective efficacy Eur J Med Chem 2022 236 114260 35385807 10.1016/j.ejmech.2022.114260 59 Johnson S Wozniak DF Imai S CA1 Nampt knockdown recapitulates hippocampal cognitive phenotypes in old mice which nicotinamide mononucleotide improves NPJ Aging Mech Dis 2018 4 10 30416740 10.1038/s41514-018-0029-z PMC6224504 60 Shen C Chen C Wang T Gao TY Zeng M Lu YB The Depletion of NAMPT Disturbs Mitochondrial Homeostasis and Causes Neuronal Degeneration in Mouse Hippocampus Mol Neurobiol 2023 60 1267 80 36441480 10.1007/s12035-022-03142-5 61 Huang R Sun Y Liu R Zhu B Zhang H Wu H ZeXieYin formula alleviates atherosclerosis by inhibiting the MAPK/NF-kappaB signaling pathway in APOE-/- mice to attenuate vascular inflammation and increase plaque stability J Ethnopharmacol 2024 327 117969 38437888 10.1016/j.jep.2024.117969 62 Sun Y Zhang H Liu R Xing S Huang R Di D Zexieyin formula alleviates atherosclerosis with cognitive impairment: A novel role in the treatment of comorbidities and its underlying mechanisms J Ethnopharmacol 2024 323 117715 38181934 10.1016/j.jep.2024.117715 63 Liu J Zhou S Wang Y Liu J Sun S Sun Y ZeXieYin Formula alleviates TMAO-induced cognitive impairment by restoring synaptic plasticity damage J Ethnopharmacol 2023 314 116604 37178985 10.1016/j.jep.2023.116604 64 Sun Y Zhang H Liu R Huang R Zhang X Zhou S Pyrolae herba alleviates cognitive impairment via hippocampal TREM2 signaling modulating neuroinflammation and neurogenesis in lipopolysaccharide-treated mice J Ethnopharmacol 2024 319 117214 37739108 10.1016/j.jep.2023.117214 65 Zhu Boran Study on the anti-atherosclerotic effect of ZeXieYin Formula based on the “Heart-Small Intestine Interior-Exterior Relationship” theory via regulation of gut microbiota [PhD thesis] 2021 66 Sun Yan Mechanistic study of ZeXieYin Formula in improving cognitive impairment through regulation of hippocampal inflammation and neurogenesis based on the Huangdi Neijing theory [PhD thesis] 2024 67 Xu F Lu C Wu Q Gu W Chen J Fang F Studies on the lipid-regulating mechanism of alisol-based compounds on lipoprotein lipase Bioorg Chem 2018 80 347 60 29986183 10.1016/j.bioorg.2018.07.001 68 Bailly C Pharmacological Properties and Molecular Targets of Alisol Triterpenoids from Alismatis Rhizoma Biomedicines 2022 10 10.3390/biomedicines10081945 PMC9406200 36009492 69 Wu Y Wang X Yang L Kang S Yan G Han Y Therapeutic Effects of Alisma orientale and its Active Constituents on Cardiovascular Disease and Obesity Am J Chin Med 2023 51 623 50 36961296 10.1142/S0192415X23500301 70 Xu X Li L Zhang Y Lu X Lin W Wu S Hypolipidemic effect of Alisma orientale (Sam.) Juzep on gut microecology and liver transcriptome in diabetic rats PLoS One 2020 15 e0240616 33035272 10.1371/journal.pone.0240616 PMC7546448 71 Xu F Chen J Zhang Y Wu Q Shen Y Gu W Molecular insight into the mechanism of lipid regulating effect of Alisma orientalis based on ACAT Int J Biol Macromol 2020 158 1141 62 32376257 10.1016/j.ijbiomac.2020.04.260 72 Lin HR Triterpenes from Alisma orientalis act as farnesoid X receptor agonists Bioorg Med Chem Lett 2012 22 4787 92 22683342 10.1016/j.bmcl.2012.05.057 73 Zhu B Zhai Y Ji M Wei Y Wu J Xue W Alisma orientalis Beverage Treats Atherosclerosis by Regulating Gut Microbiota in ApoE(-/-) Mice Front Pharmacol 2020 11 570555 33101028 10.3389/fphar.2020.570555 PMC7545905 74 Liu R Sun Y Di D Zhang X Zhu B Wu H PI3K/AKT/SERBP-1 pathway regulates Alisma orientalis beverage treatment of atherosclerosis in APOE(-/-) high-fat diet mice Pharm Biol 2023 61 473 87 36825364 10.1080/13880209.2023.2168020 PMC9970249 75 Xu L Jing M Yang L Jin L Gong P Lu J The Alisma and Rhizoma decoction abates nonalcoholic steatohepatitis-associated liver injuries in mice by modulating oxidative stress and autophagy BMC Complement Altern Med 2019 19 92 31035991 10.1186/s12906-019-2488-6 PMC6489313 76 Jang MK Han YR Nam JS Han CW Kim BJ Jeong HS Protective Effects of Alisma orientale Extract against Hepatic Steatosis via Inhibition of Endoplasmic Reticulum Stress Int J Mol Sci 2015 16 26151 65 26540043 10.3390/ijms161125944 PMC4661803 77 Ho C Gao Y Zheng D Liu Y Shan S Fang B Alisol A attenuates high-fat-diet-induced obesity and metabolic disorders via the AMPK/ACC/SREBP-1c pathway J Cell Mol Med 2019 23 5108 18 31144451 10.1111/jcmm.14380 PMC6653754 78 Wang K Zhang B Song D Xi J Hao W Yuan J Alisol A Alleviates Arterial Plaque by Activating AMPK/SIRT1 Signaling Pathway in apoE-Deficient Mice Front Pharmacol 2020 11 580073 33224034 10.3389/fphar.2020.580073 PMC7667245 79 Wang Q Chen G Chen X Liu Y Qin Z Lin P Development of a three-step-based novel strategy integrating DMPK with network pharmacology and bioactivity evaluation for the discovery of Q-markers of traditional Chinese medicine prescriptions: Danlou tablet as an example Phytomedicine 2023 108 154511 36334388 10.1016/j.phymed.2022.154511 80 Yue C Dai W Song X Du M Qin J Du J Alisol A inhibits the circ_0001831/miR-346/LIN28B pathway to ameliorate high glucose-induced injury of human renal mesangial cells Nephrology (Carlton) 2024 29 154 63 38013222 10.1111/nep.14258 81 Lu T Ding L Zheng X Li Y Wei W Liu W Alisol A Exerts Neuroprotective Effects Against HFD-Induced Pathological Brain Aging via the SIRT3-NF-kappaB/MAPK Pathway Mol Neurobiol 2024 61 753 71 37659035 10.1007/s12035-023-03592-5 PMC10861652 82 Heyde A Rohde D McAlpine CS Zhang S Hoyer FF Gerold JM Increased stem cell proliferation in atherosclerosis accelerates clonal hematopoiesis Cell 2021 184 1348 61 e22 33636128 10.1016/j.cell.2021.01.049 PMC8109274 83 Shin MK Vazquez-Rosa E Koh Y Dhar M Chaubey K Cintron-Perez CJ Reducing acetylated tau is neuroprotective in brain injury Cell 2021 184 2715 32 e23 33852912 10.1016/j.cell.2021.03.032 PMC8491234 84 Xiao W Su J Gao X Yang H Weng R Ni W The microbiota-gut-brain axis participates in chronic cerebral hypoperfusion by disrupting the metabolism of short-chain fatty acids Microbiome 2022 10 62 35430804 10.1186/s40168-022-01255-6 PMC9013454 85 Li Y Minamino T Tsukamoto O Yujiri T Shintani Y Okada K Ablation of MEK kinase 1 suppresses intimal hyperplasia by impairing smooth muscle cell migration and urokinase plasminogen activator expression in a mouse blood-flow cessation model Circulation 2005 111 1672 8 15795331 10.1161/01.CIR.0000160350.20810.0F 86 Nacarelli T Lau L Fukumoto T Zundell J Fatkhutdinov N Wu S NAD(+) metabolism governs the proinflammatory senescence-associated secretome Nat Cell Biol 2019 21 397 407 30778219 10.1038/s41556-019-0287-4 PMC6448588 87 Tarrago MG Chini CCS Kanamori KS Warner GM Caride A de Oliveira GC A Potent and Specific CD38 Inhibitor Ameliorates Age-Related Metabolic Dysfunction by Reversing Tissue NAD(+) Decline Cell Metab 2018 27 1081 95 e10 29719225 10.1016/j.cmet.2018.03.016 PMC5935140 88 Morato L Astori S Zalachoras I Rodrigues J Ghosal S Huang W eNAMPT actions through nucleus accumbens NAD(+)/SIRT1 link increased adiposity with sociability deficits programmed by peripuberty stress Sci Adv 2022 8 eabj9109 35235362 10.1126/sciadv.abj9109 PMC8890725 89 Pu B Gu P Zheng C Ma L Zheng X Zeng Z Self-reported and genetically predicted effects of coffee intake on rheumatoid arthritis: Epidemiological studies and Mendelian randomization analysis Front Nutr 2022 9 926190 36172525 10.3389/fnut.2022.926190 PMC9510978 90 Shen R Cheng K Li G Pan Z Qiaolongbatu X Wang Y Alisol A, the Eye-Entering Ingredient of Alisma orientale, Relieves Macular Edema Through TNF-alpha as Revealed by UPLC-Triple-TOF/MS, Network Pharmacology, and Zebrafish Verification Drug Des Devel Ther 2024 18 3361 82 10.2147/DDDT.S468119 PMC11297588 39100223 91 Lewandowski CT Laham MS Thatcher GRJ Remembering your A, B, C's: Alzheimer's disease and ABCA1 Acta Pharm Sin B 2022 12 995 1018 35530134 10.1016/j.apsb.2022.01.011 PMC9072248 92 Marquart TJ Allen RM Ory DS Baldan A miR-33 links SREBP-2 induction to repression of sterol transporters Proc Natl Acad Sci U S A 2010 107 12228 32 20566875 10.1073/pnas.1005191107 PMC2901433 93 Calkin AC Tontonoz P Transcriptional integration of metabolism by the nuclear sterol-activated receptors LXR and FXR Nat Rev Mol Cell Biol 2012 13 213 24 22414897 10.1038/nrm3312 PMC3597092 94 Min HK Kapoor A Fuchs M Mirshahi F Zhou H Maher J Increased hepatic synthesis and dysregulation of cholesterol metabolism is associated with the severity of nonalcoholic fatty liver disease Cell Metab 2012 15 665 74 22560219 10.1016/j.cmet.2012.04.004 PMC3361911 95 Fond AM Lee CS Schulman IG Kiss RS Ravichandran KS Apoptotic cells trigger a membrane-initiated pathway to increase ABCA1 J Clin Invest 2015 125 2748 58 26075824 10.1172/JCI80300 PMC4563683 96 Farias HR Costa-Beber LC Costa Rodrigues Guma FT de Oliveira J Hypercholesterolemia, oxidative stress, and low-grade inflammation: a potentially dangerous scenario to blood-brain barrier Metab Brain Dis 2025 40 205 40380979 10.1007/s11011-025-01620-y 97 Backstrom T Doverskog M Blackburn TP Scharschmidt BF Felipo V Allopregnanolone and its antagonist modulate neuroinflammation and neurological impairment Neurosci Biobehav Rev 2024 161 105668 38608826 10.1016/j.neubiorev.2024.105668 98 Esfandiary A Kutsche HS Schreckenberg R Weber M Pak O Kojonazarov B Protection against pressure overload-induced right heart failure by uncoupling protein 2 silencing Cardiovasc Res 2019 115 1217 27 30850841 10.1093/cvr/cvz049 PMC6529920 99 Xu Z Xiao N Chen Y Huang H Marshall C Gao J Deletion of aquaporin-4 in APP/PS1 mice exacerbates brain Abeta accumulation and memory deficits Mol Neurodegener 2015 10 58 26526066 10.1186/s13024-015-0056-1 PMC4631089 100 Zanier ER Bertani I Sammali E Pischiutta F Chiaravalloti MA Vegliante G Induction of a transmissible tau pathology by traumatic brain injury Brain 2018 141 2685 99 30084913 10.1093/brain/awy193 PMC6113646 101 Miguel V Ramos R Garcia-Bermejo L Rodriguez-Puyol D Lamas S The program of renal fibrogenesis is controlled by microRNAs regulating oxidative metabolism Redox Biol 2021 40 101851 33465566 10.1016/j.redox.2020.101851 PMC7815809 102 Yi C Ma M Ran L Zheng J Tong J Zhu J Function and molecular mechanism of acetylation in autophagy regulation Science 2012 336 474 7 22539722 10.1126/science.1216990 103 Huang R Liu W Identifying an essential role of nuclear LC3 for autophagy Autophagy 2015 11 852 3 25945743 10.1080/15548627.2015.1038016 PMC4509442 104 Roy SG Stevens MW So L Edinger AL Reciprocal effects of rab7 deletion in activated and neglected T cells Autophagy 2013 9 1009 23 23615463 10.4161/auto.24468 PMC3722312 105 Tang J Peng W Ji J Peng C Wang T Yang P GPR176 Promotes Cancer Progression by Interacting with G Protein GNAS to Restrain Cell Mitophagy in Colorectal Cancer Adv Sci (Weinh) 2023 10 e2205627 36905238 10.1002/advs.202205627 PMC10131842 106 Dong Y Yu M Wu Y Xia T Wang L Song K Hydroxytyrosol Promotes the Mitochondrial Function through Activating Mitophagy Antioxidants (Basel) 2022 11 10.3390/antiox11050893 PMC9138034 35624756 107 Zhai Q Chen X Fei D Guo X He X Zhao W Nanorepairers Rescue Inflammation-Induced Mitochondrial Dysfunction in Mesenchymal Stem Cells Adv Sci (Weinh) 2022 9 e2103839 34894103 10.1002/advs.202103839 PMC8811813 108 Zhang C Feng X He L Zhang Y Shao L The interrupted effect of autophagic flux and lysosomal function induced by graphene oxide in p62-dependent apoptosis of F98 cells J Nanobiotechnology 2020 18 52 32188458 10.1186/s12951-020-00605-6 PMC7081710 109 Basit F van Oppen LM Schockel L Bossenbroek HM van Emst-de Vries SE Hermeling JC Mitochondrial complex I inhibition triggers a mitophagy-dependent ROS increase leading to necroptosis and ferroptosis in melanoma cells Cell Death Dis 2017 8 e2716 28358377 10.1038/cddis.2017.133 PMC5386536 110 Duan Y Gong K Xu S Zhang F Meng X Han J Regulation of cholesterol homeostasis in health and diseases: from mechanisms to targeted therapeutics Signal Transduct Target Ther 2022 7 265 35918332 10.1038/s41392-022-01125-5 PMC9344793 111 Jiao L Shao W Quan W Xu L Liu P Yang J iPLA2beta loss leads to age-related cognitive decline and neuroinflammation by disrupting neuronal mitophagy J Neuroinflammation 2024 21 228 39294744 10.1186/s12974-024-03219-z PMC11409585 112 Stuke JFM Hummer G AlphaFold2 SLiM screen for LC3-LIR interactions in autophagy Autophagy 2025 1 21 10.1080/15548627.2025.2493999 40320752 113 Lorentzen KC Prescott AR Ganley IG Artificial targeting of autophagy components to mitochondria reveals both conventional and unconventional mitophagy pathways Autophagy 2025 21 315 37 39177530 10.1080/15548627.2024.2395149 PMC11760219 114 Wang H Ye J Peng Y Ma W Chen H Sun H CKLF induces microglial activation via triggering defective mitophagy and mitochondrial dysfunction Autophagy 2024 20 590 613 37908119 10.1080/15548627.2023.2276639 PMC10936627 115 Liu D Webber HC Bian F Xu Y Prakash M Feng X Optineurin-facilitated axonal mitochondria delivery promotes neuroprotection and axon regeneration Nat Commun 2025 16 1789 39979261 10.1038/s41467-025-57135-8 PMC11842812 116 Yan J Chen X Choksi S Liu ZG TGFB signaling induces mitophagy via PLSCR3-mediated cardiolipin externalization in conjunction with a BNIP3L/NIX-, BNIP3-, and FUNDC1-dependent mechanism Autophagy 2025 1 11 10.1080/15548627.2025.2483441 PMC12283012 40119553 117 Kuchling J Jurek B Kents M Kreye J Geis C Wickel J Impaired functional connectivity of the hippocampus in translational murine models of NMDA-receptor antibody associated neuropsychiatric pathology Mol Psychiatry 2024 29 85 96 37875549 10.1038/s41380-023-02303-9 PMC11078734 118 Travaglia A Bisaz R Sweet ES Blitzer RD Alberini CM Infantile amnesia reflects a developmental critical period for hippocampal learning Nat Neurosci 2016 19 1225 33 27428652 10.1038/nn.4348 PMC5003643 119 Kraehling JR Chidlow JH Rajagopal C Sugiyama MG Fowler JW Lee MY Genome-wide RNAi screen reveals ALK1 mediates LDL uptake and transcytosis in endothelial cells Nat Commun 2016 7 13516 27869117 10.1038/ncomms13516 PMC5121336 120 Matsuura F Wang N Chen W Jiang XC Tall AR HDL from CETP-deficient subjects shows enhanced ability to promote cholesterol efflux from macrophages in an apoE- and ABCG1-dependent pathway J Clin Invest 2006 116 1435 42 16670775 10.1172/JCI27602 PMC1451209 121 Hamilton JP Koganti L Muchenditsi A Pendyala VS Huso D Hankin J Activation of liver X receptor/retinoid X receptor pathway ameliorates liver disease in Atp7B(-/-) (Wilson disease) mice Hepatology 2016 63 1828 41 26679751 10.1002/hep.28406 PMC4874878 122 Quattrocelli M Wintzinger M Miz K Levine DC Peek CB Bass J Muscle mitochondrial remodeling by intermittent glucocorticoid drugs requires an intact circadian clock and muscle PGC1alpha Sci Adv 2022 8 eabm1189 35179955 10.1126/sciadv.abm1189 PMC8856622 123 Wu X Kong X Chen D Li H Zhao Y Xia M SIRT1 links CIITA deacetylation to MHC II activation Nucleic Acids Res 2011 39 9549 58 21890893 10.1093/nar/gkr651 PMC3239213 124 Kennedy BE Giacomantonio M Murphy JP Cutler S Sadek M Konda P NAD+ depletion enhances reovirus-induced oncolysis in multiple myeloma Mol Ther Oncolytics 2022 24 695 706 35284625 10.1016/j.omto.2022.02.017 PMC8904403 125 Hopp AK Teloni F Bisceglie L Gondrand C Raith F Nowak K Mitochondrial NAD(+) Controls Nuclear ARTD1-Induced ADP-Ribosylation Mol Cell 2021 81 340 54 e5 33450210 10.1016/j.molcel.2020.12.034 PMC7837215 126 Marcus M Rosenblatt I Yassur Y [Indications and contraindications for laser photocoagulation in diabetic retinopathy-update] Harefuah 1987 112 182 3 3609941 127 Chini CCS Zeidler JD Kashyap S Warner G Chini EN Evolving concepts in NAD(+) metabolism Cell Metab 2021 33 1076 87 33930322 10.1016/j.cmet.2021.04.003 PMC8172449 128 Xu Y Wan W Acetylation in the regulation of autophagy Autophagy 2023 19 379 87 35435793 10.1080/15548627.2022.2062112 PMC9851266 129 Lee IH Cao L Mostoslavsky R Lombard DB Liu J Bruns NE A role for the NAD-dependent deacetylase Sirt1 in the regulation of autophagy Proc Natl Acad Sci U S A 2008 105 3374 9 18296641 10.1073/pnas.0712145105 PMC2265142 130 Yoon MJ Yoshida M Johnson S Takikawa A Usui I Tobe K SIRT1-Mediated eNAMPT Secretion from Adipose Tissue Regulates Hypothalamic NAD+ and Function in Mice Cell Metab 2015 21 706 17 25921090 10.1016/j.cmet.2015.04.002 PMC4426056 131 Ju J Li XM Zhao XM Li FH Wang SC Wang K Circular RNA FEACR inhibits ferroptosis and alleviates myocardial ischemia/reperfusion injury by interacting with NAMPT J Biomed Sci 2023 30 45 37370086 10.1186/s12929-023-00927-1 PMC10304620 132 van der Kant R Langness VF Herrera CM Williams DA Fong LK Leestemaker Y Cholesterol Metabolism Is a Druggable Axis that Independently Regulates Tau and Amyloid-beta in iPSC-Derived Alzheimer's Disease Neurons Cell Stem Cell 2019 24 363 75 e9 30686764 10.1016/j.stem.2018.12.013 PMC6414424 133 Boussicault L Alves S Lamaziere A Planques A Heck N Moumne L CYP46A1, the rate-limiting enzyme for cholesterol degradation, is neuroprotective in Huntington's disease Brain 2016 139 953 70 26912634 10.1093/brain/awv384 PMC4766376 134 Narendra DP Youle RJ The role of PINK1-Parkin in mitochondrial quality control Nat Cell Biol 2024 26 1639 51 39358449 10.1038/s41556-024-01513-9 135 Zeng L Zheng W Liu X Zhou Y Jin X Xiao Y SDC1-TGM2-FLOT1-BHMT complex determines radiosensitivity of glioblastoma by influencing the fusion of autophagosomes with lysosomes Theranostics 2023 13 3725 43 37441590 10.7150/thno.81999 PMC10334832 136 Zhang Z Yang W Wang L Zhu C Cui S Wang T Unraveling the role and mechanism of mitochondria in postoperative cognitive dysfunction: a narrative review J Neuroinflammation 2024 21 293 39533332 10.1186/s12974-024-03285-3 PMC11559051 137 Cho JH Chae CW Lim JR Jung YH Han SJ Yoon JH Sodium butyrate ameliorates high glucose-suppressed neuronal mitophagy by restoring PRKN expression via inhibiting the RELA-HDAC8 complex Autophagy 2024 20 1505 22 38409852 10.1080/15548627.2024.2323785 PMC11210903 138 Du F Yu Q Hu G Lin CS ShiDu Yan S PINK1-dependent NFKB signaling contributes to amyloid pathology in Alzheimer disease Autophagy 2025 1 17 10.1080/15548627.2025.2463322 40320714 139 Li F Wang Y Zheng K Microglial mitophagy integrates the microbiota-gut-brain axis to restrain neuroinflammation during neurotropic herpesvirus infection Autophagy 2023 19 734 6 35849507 10.1080/15548627.2022.2102309 PMC9851194 140 Jiang B Bai F Hu Y Ren Y Su Y Song W Endothelial major vault protein alleviates vascular remodeling via promoting Parkin-mediated mitophagy Nat Commun 2025 16 4365 40348769 10.1038/s41467-025-59644-y PMC12065841 141 Nanayakkara R Gurung R Rodgers SJ Eramo MJ Ramm G Mitchell CA Autophagic lysosome reformation in health and disease Autophagy 2023 19 1378 95 36409033 10.1080/15548627.2022.2128019 PMC10240999 142 Xu QQ Su ZR Yang W Zhong M Xian YF Lin ZX Patchouli alcohol attenuates the cognitive deficits in a transgenic mouse model of Alzheimer's disease via modulating neuropathology and gut microbiota through suppressing C/EBPbeta/AEP pathway J Neuroinflammation 2023 20 19 36717922 10.1186/s12974-023-02704-1 PMC9887791 143 Li X Qi J Wang J Hu W Zhou W Wang Y Nanoparticle technology for mRNA: Delivery strategy, clinical application and developmental landscape Theranostics 2024 14 738 60 38169577 10.7150/thno.84291 PMC10758055 144 Shu F Xiao H Li QN Ren XS Liu ZG Hu BW Epigenetic and post-translational modifications in autophagy: biological functions and therapeutic targets Signal Transduct Target Ther 2023 8 32 36646695 10.1038/s41392-022-01300-8 PMC9842768 145 Yoneda T Hayashi K Yoshimura Y Experience-dependent functional plasticity and visual response selectivity of surviving subplate neurons in the mouse visual cortex Proc Natl Acad Sci U S A 2023 120 e2217011120 36812195 10.1073/pnas.2217011120 PMC9992851 Figure 1 Alisol A treatment alleviates atherosclerosis development and ameliorates cognitive function in Ldlr -/- (B) (C) (D-E) (F-G) (H) (I) (J) (K) (L-M) (N-O) (P) (Q) (R) (S) (T) (U) * P ** P Ldlr -/- # P ## P Figure 2 Alisol A protects hippocampus neurons from cholesterol metabolism disorders and oxidative stress damage. (A) (B) (C) (D) (E) (F) (G) (H) (I) (J) K (L) (M) * P ** P # P ## P 25-35 25-35 25-35 25-35 2 2 * P ** P # P ## P * P ** P Ldlr -/- # P ## P Figure 3 Alisol A treatment improved neural cell morphology and inhibited the activation of astrocytes and microglia, and restored synaptic loss and impairment of Ldlr -/- (B) (C) + + (D) (E) (F) (G) H (I) (J) Ldlr -/- (K) (L) (M) (N) (O) (P) (Q) (R) (S) (T) * P ** P Ldlr -/- # P ## P Figure 4 Atherosclerosis has the potential to impact cognitive function via the autophagy and AMPK signaling pathways, with Alisol A capable of binding to NAMPT and modulating its activity. (A-D) (A) (B) (C) (D) (E-I) (E) (F) (G) (H) (I) (J) GSE100927 (K) (L) (M) (N) (O) (P) (Q) (R) (S) (T) (U) (V) Figure 5 Alisol A activates the NAMPT-related signaling pathway, thereby facilitating lysine deacetylation and autophagy. (A) (B) Thr172 or Thr183 (C) (D) + Ldlr -/- + (E) (F) Thr172 or Thr183 (G) (H) (I) * P ** P # P ## P * P ** P Ldlr -/- # P ## P Figure 6 Inhibiting NAMPT causes cholesterol buildup in the hippocampus, worsening cognitive issues due to reduced NAMPT-SIRT1 interaction, inhibited NAMPT deacetylation, and decreased NAMPT-CYP46A1 interaction. (A-B) (C-D) (E-F) (G) Ldlr -/- (H) Ldlr -/- (I) (J) (K) (L) (M) 25-35 Ldlr -/- * P ** P # P ## P Ldlr -/- Ldlr -/- Ldlr -/- Ldlr -/- Ldlr -/- Ldlr -/- * P ** P # P ## P 25-35 25-35 25-35 25-35 * P ** P # P ## P Figure 7 Modulation of NAMPT activity and its network by Alisol A restores cholesterol balance, mitophagy, and synaptic function in Ldlr -/- (B) (C) (D) (E) (F) (G) (H) (I) (J) (K) (L) Ldlr -/- * P ** P # P ## P * P ** P # P ## P 25-35 2 2 ; * P ** P # P ## P ",
  "metadata": {
    "Title of this paper": "Experience-dependent functional plasticity and visual response selectivity of surviving subplate neurons in the mouse visual cortex",
    "Journal it was published in:": "Theranostics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486161/"
  }
}