{
  "title": "Paper_399",
  "abstract": "pmc Front Immunol Front Immunol 1754 frontimmu Front. Immunol. Frontiers in Immunology 1664-3224 Frontiers Media SA PMC12484198 PMC12484198.1 12484198 12484198 41041327 10.3389/fimmu.2025.1613368 1 Immunology Original Research Bevacizumab and anlotinib combination therapy acts via HIF-1α suppression to exert synergistic anti-angiogenic and anti-tumor effects in non-small cell lung cancer Simayi Nafeisha  1 Li Jiaying  1 Hu Junkai  2 Jia Ning  3 Wan Rongxue  1 Xie Jinbiao  4 Huang Wenhua  1  *  1 Guangdong Engineering Research Center for Translation of Medical 3D Printing Application, Guangdong Provincial Key Laboratory of Digital Medicine and Biomechanics, National Key Discipline of Human Anatomy, School of Basic Medical Sciences, Southern Medical University Guangzhou China  2 Orthopaedic Center, Affiliated Hospital of Guangdong Medical University, Guangdong Medical University Zhanjiang China  3 School of Medicine, Yan ‘an University Yan ‘an China  4 Department of Cardiothoracic Surgery, Affiliated Hospital of Putian University Putian China Edited by: Giulia Piaggio Reviewed by: Laura Rosanò, National Research Council (CNR), Italy  Francesca Di Modugno  Chung-Yu Chen *Correspondence: Wenhua Huang, huangwenhua2009@139.com 17 9 2025 2025 16 480569 1613368 17 4 2025 29 8 2025 17 09 2025 02 10 2025 03 10 2025 Copyright © 2025 Simayi, Li, Hu, Jia, Wan, Xie and Huang. 2025 Simayi, Li, Hu, Jia, Wan, Xie and Huang https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Introduction Tumor angiogenesis is required for the progression of non-small cell lung cancer (NSCLC), and anti-vascular endothelial growth factor (anti-VEGF) antibody bevacizumab and multitarget tyrosine kinase inhibitor anlotinib are anti-cancer treatment options, the combined effect of which in NSCLC remains unclear. Methods A vascularized microfluidic chip was applied to model angiogenesis, together with in vitro in vivo Results Bevacizumab plus anlotinib (B+A) inhibited angiogenesis, reducing vessel density to 10% of control values and also reducing diameter and green fluorescent protein (GFP) area ratio. B+A inhibited cell viability by 78%, colony formation by 90%, and invasion by 75% in NSCLC cell lines A549 and H1299; downregulated N-cadherin 5.34-fold, vimentin 6.46-fold, and α-SMA 4.35-fold; and upregulated E-cadherin 3.75-fold. The rates of apoptosis of A549 and H1299 cells were increased 3.85-fold. The phosphorylation of VEGFR2, PDGFRβ, and FGFR1 was also reduced. B+A reduced tumor volume 7.23-fold and weight 7.08-fold, decreased tumor cell density, and lowered Ki-67 expression in an in vivo + + Conclusion HIF-1α inhibitor PX478 did not enhance the anti-tumor effects of B+A, but HIF-1α activator DMOG reversed them. In addition, the combination therapy enhanced CD4 + + microfluidic chip non-small cell lung cancer bevacizumab anlotinib angiogenesis epithelial–mesenchymal transition The author(s) declare financial support was received for the research and/or publication of this article. This study was supported by the National Natural Science Foundation of China (32271181) and the Science and Technology Development Project of Fujian Province (2012I2004). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Cancer Immunity and Immunotherapy 1 Introduction Non-small cell lung cancer (NSCLC) accounts for approximately 85% of all lung cancer cases, and there are over 2 million new diagnoses per annum ( 1 3 4 6 7 8 9 10 11 12 13 14 15 16 18 19 20 The HIF-1α transcription factor mediates cellular responses to various stressors, including hypoxia, which characterizes many tumors in vivo 21 22 23 26 27 28 29  In vitro 30 32 33 36 in vitro in vivo 2 Materials and methods 2.1 Microfluidic device fabrication Microfluidic devices were fabricated with a three-layered architecture comprising a glass substrate, polydimethylsiloxane (PDMS) structural layer, and a polymethyl methacrylate (PMMA) reservoir layer. Computer-aided design (CAD) software was used to design one central gel channel (8 µL) and two adjacent medium channels with inlet diameters of 1 and 1.5 mm, which were patterned onto a silicon wafer master mold via soft lithography and photolithography. PDMS prepolymer (Sylgard 184, Dow Corning, Midland, MI, USA) was mixed with a curing agent at a 10:1 ratio, degassed to eliminate air bubbles, poured over the master mold, and cured at 60 °C for approximately 2 h. The PDMS layer was peeled off the mold, bonded to a clean glass substrate, and pretreated with oxygen plasma for 30 seconds to increase surface hydrophilicity and promote strong adhesion. The PDMS–glass assembly was plasma-treated for 30 seconds to ensure a robust and leak-proof seal. The PMMA reservoir layer was fabricated by laser cutting (Epilog Laser, Golden, CO, USA) with 40 µL of reservoir volume for the central gel channel and 240 µL for the medium channels with 1- and 1.5-mm inlet diameters. The PMMA layer was integrated by adhesive bonding (Loctite 406, Henkel, Düsseldorf, Germany) onto the PDMS–glass assembly with the alignment of inlet holes and microchannels. The complete microfluidic device was inspected under a microscope (Olympus IX73, Olympus Corporation, Tokyo, Japan) to verify channel dimensions and bond integrity, and leak tests were performed by introducing dye solution (Sigma-Aldrich, St. Louis, MO, USA) into the inlet reservoirs. 2.2 Cells and reagents Primary human umbilical vein endothelial cells expressing GFP (GFP-HUVECs) and primary normal human lung fibroblasts (NHLFs) were purchased from Lonza (Basel, Switzerland). GFP-HUVECs were cultured in endothelial growth medium-2 (EGM-2; Lonza) and NHLFs in fibroblast growth medium-2 (FGM-2; Lonza). NSCLC cell lines A549 (human lung adenocarcinoma) and H1299 (human large cell lung carcinoma) were purchased from American Type Culture Collection (ATCC; Manassas, VA, USA) and cultured in Roswell Park Memorial Institute medium (RPMI-1640, Gibco, Waltham, MA, USA) supplemented with 10% fetal bovine serum (FBS; Gibco) and 1% penicillin–streptomycin (Gibco). Routine cell culture was performed at 37 °C in a humidified incubator with 5% CO 2 2 A 5-µM stock solution of HIF-1α inhibitor PX-478 (Selleck Chemicals, Houston, TX, USA) and a 200-µM stock solution of HIF-1α activator dimethyloxalylglycine (DMOG; Sigma-Aldrich) were prepared in dimethyl sulfoxide (DMSO). Anlotinib (Selleck Chemicals) and bevacizumab (Selleck Chemicals) were also dissolved in DMSO. All stock solutions were stored at −20 °C and diluted with culture media to ensure a final DMSO concentration ≤ 0.1%. A DMSO vehicle control was included in all experiments. 2.3 Cell culture in microfluidic device GFP-HUVECs and NHLFs at passages 3–5 were cultured to over 80% confluence, detached with trypsin–ethylene diamine tetraacetic acid (EDTA) (0.05% trypsin, 0.53 mM EDTA; Gibco), and resuspended in culture media; 7 × 10 5 5 g 2 I24101 2.4 Drug administration in microfluidic chips Anti-angiogenic agents, 10 μM anlotinib and 200 μg/mL bevacizumab, were administered 10 days after seeding either individually or in combination with DMSO as a control. Culture media containing drugs were continuously perfused through the medium channels to maintain consistent drug exposure and mimic physiological perfusion conditions. Chips were incubated for 4 days, during which vascular perfusion assays, permeability assays, and structural quantification were performed. 2.5 Quantification of blood vessel density, area, diameter, and node count The fluorescence microscopy images of GFP-HUVECs were processed using the ImageJ software to perform background subtraction, thresholding, and skeletonization and to estimate blood vessel area as the GFP area ratio (GFAR). Total vascular length and sprout diameter were assessed, and nodes were counted using the particle analysis function of the Analyze Skeleton plugin. Data were averaged across multiple random fields of view, and statistical analysis was performed using one-way analysis of variance (ANOVA) with Tukey’s post-hoc test in GraphPad Prism. A value of p 2.6 Vascular perfusion and permeability assays 2.6.1 Vascular perfusion Ten days after cell seeding, the medium was removed, 300 µL 70-kDa dextran conjugated with red fluorescent protein (RFP) (Danwang Medical) in phosphate-buffered saline (PBS) was introduced via the side channel/reservoir, and fluorescence was monitored under a microscope for 10 seconds. 2.6.2 Permeability DAPI-labeled fluorescent microspheres (Danwang Medical) at a volume of 100 µL were diluted with 900 µL PBS, the medium was removed from the chip, fluorescent microsphere solution was added via the side channel, and real-time fluorescence microscopy was used to visualize and quantify microsphere movement through the vascular network for 10 seconds. Fluorescence images were quantified using the ImageJ software, and statistical analysis was performed using one-way ANOVA and a significance threshold of p 2.7 C 50 Cell Counting Kit-8 (CCK-8; Dojindo Laboratories, Kumamoto, Japan) assays were used to determine half-maximal inhibitory concentrations (IC 50 50 50 2.8 Cell viability assay Cell viability was assessed by CCK-8 assay according to the manufacturer’s protocol. A549 and H1299 cells were seeded into 96-well plates at a density of 5 × 10 3 p 2.9 Colony formation assay A549 and H1299 cells were seeded into six-well plates at a density of 1,000 cells per well, allowed to adhere overnight before the addition of bevacizumab and/or anlotinib, and cultured for 14 days with medium replacement every 3 days. Colonies were fixed with 4% paraformaldehyde for 15 minutes, stained with 0.1% crystal violet for 20 minutes, and counted under a light microscope. Colony formation is expressed as the number of colonies formed as a percentage of the number of cells seeded. All experiments were conducted in triplicate, and statistical analysis was performed using one-way ANOVA with Tukey’s post-hoc test with a threshold of p 2.10 Apoptosis assay Apoptosis was assessed using the Annexin V-FITC/PI Apoptosis Detection Kit (BD Biosciences, San Jose, CA, USA) following the manufacturer’s protocol. A549 and H1299 cells were seeded into six-well plates at a density of 1 × 10 5 + − + + p 2.11 Cell invasion assay A549 or H1299 cells and HUVECs were used for invasion assays. For tumor cells, 1 × 10 5 2 4 p 2.12 Migration assay HUVECs were cultured to 90%–95% confluence in six-well plates. A sterile 200-μL pipette tip was used to create a uniform scratch (wound) across the cell monolayer. The wells were gently washed twice with PBS to remove detached cells and replaced with serum-free medium containing the indicated treatments. The images of the scratch area were captured immediately (0 h) and at 24 h after treatment with different groups using an inverted microscope. The migration rate was quantified by measuring the wound closure area using the ImageJ software and is expressed as a percentage of the initial scratch area. Experiments were performed in triplicate, and statistical significance was assessed using one-way ANOVA, with p 2.13 Enzyme-linked immunosorbent assay A549 and H1299 cells (2.0 × 10 5 g p 2.14 Quantitative real-time polymerase chain reaction Total RNA was extracted from A549 and H1299 cells using the TRIzol reagent (Invitrogen, Carlsbad, CA, USA) according to the manufacturer’s protocol, contaminated genomic DNA was removed by DNase digestion, RNA was quantified using the NanoDrop spectrophotometer (Thermo Fisher Scientific, Waltham, MA, USA), and RNA with an A260/A280 ratio between 1.8 and 2.0 was used. cDNA was synthesized from 1 µg total RNA by reverse transcription using the PrimeScript RT Reagent Kit (Takara, Shiga, Japan) following the manufacturer’s instructions. Quantitative real-time polymerase chain reaction (qRT–PCR) was performed using the SYBR Green PCR Master Mix (Applied Biosystems, Foster City, CA, USA) on an ABI 7500 Real-Time PCR System (Applied Biosystems) with the following reaction conditions: initial denaturation at 95 °C for 10 minutes, followed by 40 cycles of 95 °C for 15 seconds and 60 °C for 1 minute. The relative expression of genes encoding E-cadherin, N-cadherin, vimentin, α-SMA, HIF-1α, Ang2, GLUT1, LDHA, and PDK1 was normalized to GAPDH expression using the 2 −ΔΔCt  Supplementary Table S1 p 2.15 Western blotting Total protein was extracted from A549 and H1299 cells with Radio Immunoprecipitation Assay (RIPA) lysis buffer (Beyotime, Shanghai, China) containing protease and phosphatase inhibitors (Roche, Basel, Switzerland), and protein concentration was determined using the BCA protein assay kit (Thermo Fisher Scientific). Equal amounts of protein (20–30 µg) were separated by sodium dodecyl sulfate-polyacrylamide gel electrohoresis (SDS–PAGE) on 10% or 12% polyacrylamide gels and transferred onto polyvinylidene fluoride (PVDF) membranes (Millipore, Burlington, MA, USA). Membranes were blocked with 5% skimmed milk in Tris-buffered saline with 0.1% Tween-20 (TBS-T) for 1 h at room temperature, incubated with primary antibodies overnight at 4 °C (  Supplementary Table S2 p 2.16  In vivo A human NSCLC tumor xenograft model was established in female immunodeficient BALB/c nude mice (5–6 weeks old, 18–22 g) by subcutaneous injection of 2 × 10 5 3 2.17 TUNEL immunofluorescence staining Paraffin-embedded tumor tissue sections (4 μm thick) from four treatment groups (n = 4 per group) were deparaffinized in xylene and rehydrated from graded ethanol to distilled water. After antigen retrieval in citrate buffer (pH 6.0) by microwave heating for 15 minutes, sections were washed with PBS and permeabilized with 0.3% Triton X-100 in PBS for 15 minutes at room temperature. Apoptotic cells were detected using the In Situ 2.18 H&E staining Tumor samples were fixed in 10% neutral-buffered formalin, embedded in paraffin, and sectioned into 4-µm slices. Sections were deparaffinized in xylene, rehydrated with ethanol gradient, rinsed with distilled water, mounted on resin-coated slides, stained with hematoxylin for 5 minutes, washed with running tap water, and counterstained with eosin for 2 minutes. Stained sections were observed under a light microscope (Leica Microsystems, Wetzlar, Germany) at ×200 magnification to assess tumor morphology and structure. 2.19 IHC staining Paraffin-embedded tumor sections were deparaffinized and rehydrated as described previously. Antigen retrieval was performed in citrate buffer (pH 6.0) by heating in a microwave for 15 minutes. Sections were cooled to room temperature, rinsed with PBS, incubated with 3% hydrogen peroxide for 10 minutes to inhibit endogenous peroxidase activity, and blocked with 5% BSA in PBS for 30 minutes at room temperature. Sections were then incubated overnight at 4 °C with primary antibodies against Ki-67 (1:200, CST), CD4 (1:200, Abcam, Cambridge, UK), CD8 (1:200, Abcam), p-VEGFR2 (1:100, CST), p-PDGFRβ (1:100, CST), or p-FGFR1 (1:100, CST). After washing with PBS, sections were incubated with HRP-conjugated secondary antibody (1:500, CST) for 1 h at room temperature. Immunoreactivity was visualized using 3,3′-diaminobenzidine (DAB) substrate solution (Abcam) followed by counterstaining with hematoxylin. Sections were then dehydrated and mounted with coverslips. The quantification of Ki-67 expression and immune cell infiltration (CD4 + + 2.20 Statistical analysis All data are expressed as mean ± standard deviations (SDs) for at least three independent experiments. Statistical analyses were performed using the GraphPad Prism 9.0 software (GraphPad Software, La Jolla, CA, USA), and intergroup differences were analyzed using one-way ANOVA followed by Tukey’s post-hoc test for multiple comparisons. Comparisons between two groups were made using an unpaired two-tailed Student’s t-test, with a value of p 3 Results 3.1 Development and functional validation of the vascularized microfluidic chip platform In this study, microarray models were developed in order to investigate the angiogenic process and for the screening of anti-vascular drugs. The chip had a central gel channel flanked by two media channels separated by gel pinning barriers, ensuring stable gel injection and cell culture conditions to recapitulate the microvascular environment. The multilayer structure of PDMS layers, PMMA reservoirs, and a glass substrate created a dynamic microenvironment with continuous perfusion to facilitate vascular development (  Figures 1A, B  Supplementary Figure S1  Figure 1C  Figure 1D Figure 1 Structure and functional validation of the vascularized microfluidic chip. (A) (B) (C) (D) (E) (F) (G) (H) Diagram illustrating a microfluidic device (A and B) with labeled parts including media and gel channels. Timeline (C) shows procedure stages from day 0 to day 14 of cellular processes. Microscopy images (D) present brightfield, GFP, and merged views of a cell culture. Panels (E and F) display treatment comparisons: Control, Bevacizumab, Anlotinib, Anlotinib+Bevacizumab with red and blue staining. Graphs (G and H) quantify effects on lumen volume and microvessel branches per treatment. Fluorescent dextran perfusion of control chips seeded with untreated cells demonstrated the presence of the intact and permeable structures expected for functional vasculature. By contrast, treatment with anlotinib and/or bevacizumab abolished dextran diffusion, indicating disrupted vascular permeability and loss of functional vasculature (  Figures 1E, F  Figures 1G, H 3.2 Evaluation of the anti-angiogenic effects of tumor drugs Vascular responses were monitored via assessment of GFAR, vascular density, vascular diameter, and vascular node count over a 4-day period of treatment with anlotinib and bevacizumab. The vascular network remained dense and continuous in untreated control conditions, but treatment with anlotinib or bevacizumab caused progressive fragmentation and reduced vascular density, which was apparent by Day 3. The impact was more pronounced for combined anlotinib and bevacizumab therapy, with significant disruption of vascular structures by Day 2 and near-complete loss of vascular integrity by Day 4 (  Figure 2A  Figures 2B–E  Supplementary Figures S2A–D 37 Figure 2 Anti-angiogenic effects of anlotinib and bevacizumab assessed using vascularized microfluidic chip. (A) (B) (C) (D) (E) Fluorescent microscopy images show vascular growth in various treatments over five days: Control, Bevacizumab, Anlotinib, and their combination. Graphs B-E depict GFAR, vascular formation density, vascular diameter, and the number of vascular nodes across the treatments over four days, indicating significant changes, especially with combination therapy. 3.3 Anti-tumor effects of anlotinib plus bevacizumab in NSCLC Drug sensitivity analyses of A549 and H1299 cells revealed a time-dependent decrease in IC 50  Figure 3A  Figures 3B, C  Figures 3D, E  Figures 3F, G  Figures 3H, I 38 39 Figure 3 Effects of anlotinib, bevacizumab, and B+A combination treatment on survival, colony formation, and apoptosis of A549 and H1299 cells. (A) 50 (B) (C) (D) (E) (F) (G) (H) (I) p p p Graphs and charts display the effects of treatments on A549 and H1299 cells. Panels A and B show dose-response curves for Alectinib, Bevacizumab, Anlotinib, and their combination. Panel C presents bar graphs of cell viability over time. Panel D shows colony formation under different treatments. Panel E displays quantitative analysis of colony numbers. Panel F shows microscopy images of treated cells. Panel G presents corresponding quantification. Panel H shows flow cytometry plots of apoptosis and necrosis. Panel I provides bar graphs of apoptosis percentages. Each treatment is compared to the control. The invasive capacity of HUVECs was evaluated using the Transwell invasion assay. In the control group, the number of invaded cells was the highest, averaging ~370 cells per field. Bevacizumab and anlotinib monotherapies reduced invasion to ~260 and ~240 cells, respectively, representing decreases of ~30%–35% compared with the control. The bevacizumab and anlotinib combination treatment produced a marked further reduction, with only ~120 invaded cells observed, which was significantly lower than either monotherapy. The addition of HIF-1α inhibitor PX478 to the combination group did not result in a statistically significant change compared with the combination alone, indicating that maximal suppression had been reached. In contrast, the addition of HIF-1α activator DMOG partially reversed the inhibitory effect, increasing the number of invaded cells to ~200 (  Supplementary Figure S3 The effect of the treatments on HUVEC migration was evaluated using a wound healing assay. After 24 h, the control group exhibited the highest migratory capacity with wound closure of approximately 69%. Bevacizumab and anlotinib monotherapies moderately reduced migration to ~58% and ~48%, respectively, corresponding to reductions of ~11% and ~21%, compared with the control. The bevacizumab and anlotinib combination treatment markedly suppressed migration, resulting in wound closure of only ~17%, which was significantly lower than either monotherapy. The Combination + PX478 group showed no significant difference compared with the combination group, whereas the Combination + DMOG group partially reversed the inhibitory effect, increasing wound closure to ~39% (  Supplementary Figure S4 3.4 Effects of anlotinib and bevacizumab on angiogenic signaling and the EMT in A549 and H1299 cells Markers of angiogenesis, VEGFR2, PDGFRβ, FGFR1, and of the EMT, E-cadherin, N-cadherin, vimentin, and α-SMA, were assessed via Western blotting in A549 and H1299 cells. All three treatment regimens decreased the levels of phosphorylated angiogenesis markers p-VEGFR2, p-PDGFRβ, and p-FGFR1, but did not change the total protein levels of VEGFR2, PDGFRβ, and FGFR1 in both A549 and H1299 cells. Anlotinib had a greater impact than the two individual drug treatments, with combined therapy producing the most potent inhibition of any treatment (  Figures 4A, B Figure 4 Effect of anlotinib and bevacizumab on angiogenesis and EMT in A549 and H1299 cells. (A) (B) (C) (D) (C) p p p Western blot and bar graph analysis of protein expression in A549 and H1299 cells treated with anlotinib, bevacizumab, and their combination. Panels A and C show blots for various proteins, while panels B and D present relative protein expression levels, with significant differences indicated by asterisks. In HUVECs, Western blotting and densitometric analysis revealed that bevacizumab or anlotinib alone produced minimal and statistically insignificant reductions in p-VEGFR2 and p-PDGFRβ levels compared with the control, whereas both agents modestly but significantly decreased p-FGFR1. The bevacizumab and anlotinib combination treatment markedly reduced the phosphorylation of VEGFR2, PDGFRβ, and FGFR1 to ~25%, ~25%, and ~20% of control values, respectively. The addition of HIF-1α inhibitor PX478 to the combination did not further alter phosphorylation, indicating that dual blockade had already achieved near-maximal inhibition. Conversely, HIF-1α activator DMOG partially reversed these inhibitory effects, restoring the phosphorylation of VEGFR2, PDGFRβ, and FGFR1 to ~80%, ~80%, and ~55% of control values, respectively (  Supplementary Figure S5 Western blotting analysis showed that individual treatment with anlotinib or bevacizumab reduced the expression of mesenchymal markers N-cadherin, vimentin, and α-SMA and increased epithelial marker E-cadherin relative to controls (  Figures 4C, D  Figures 4C, D  Supplementary Figures S6A, B 40 41 42 3.5 Anti-tumor effects of combined anlotinib and bevacizumab therapy {it} in vivo {/it}Xenograft tumors showed a 7.23-fold reduction in volume and a 7.08-fold reduction in weight following treatment of mice with both anlotinib and bevacizumab relative to controls. The inhibition of tumor growth is comparable with a 1.34-fold reduction in volume and a 1.37-fold reduction in weight for bevacizumab monotherapy and a 1.85-fold reduction in volume and a 2.18-fold reduction in weight for anlotinib monotherapy. These results illustrate the increased potency of the combined treatment (  Figures 5A–C  Figures 5D, E  Figure 5F Figure 5 Effects of anlotinib, bevacizumab, and B+A combination treatment in a mouse xenograft model in vivo (A) (B) (C) (D) (E) (F) (G) (H) p p p Scientific illustration with multiple panels showing cancer treatment effects in mouse models. Panel A depicts treatment groups: control, bevacizumab, anlotinib, and combination, alongside tumor images. Panels B and C display bar graphs of tumor volume and weight, respectively. Panel D shows HE and Ki67 staining of tissue samples. Panel E presents graphs of necrotic area and Ki67 percentage. Panel F depicts survival rate curves. Panel G shows protein expression via Western blot for various proteins. Panel H contains bar graphs of relative protein expression. Statistical significance is marked with asterisks. Western blotting analyses of proteins involved in the cell cycle showed a downregulation of cyclin B1, p-CDK1, and p-CHK2 and unchanged levels of total CDK1 and CHK2, indicating cell cycle arrest after drug treatment (  Figure 5G  Figure 5H in vivo 3.6 The effect of combination therapy on immune cell infiltration and vascular endothelial growth factor receptor activation Immunohistochemical analysis was performed to assess immune cell infiltration and angiogenic receptor activation in tumor tissues from different treatment groups (  Supplementary Figure S7 + + + + + + To assess apoptosis in distinct tumor cell populations, TUNEL staining was combined with markers for endothelial cells (CD31), epithelial/tumor cells (CK7), and fibroblasts/smooth muscle cells (α-SMA). Quantitative analysis revealed that in CD31 + + +  Figures 6A–D Figure 6 To assess apoptosis in distinct tumor cell populations, TUNEL staining was combined with markers for endothelial cells (CD31), epithelial/tumor cells (CK7), and fibroblasts/smooth muscle cells (α-SMA). (A) (B) (C) (D) p Fluorescence microscopy images display four conditions: Control, Bevacizumab, Anlotinib, and Combination. Panels A, B, and C show markers CD31, CK7, and α-SMA with TUNEL and DAPI staining, while section D presents a bar graph of TUNEL-positive cells, illustrating significant increases under combination treatment across all markers. 3.7 Inhibitory effects of combined anlotinib and bevacizumab therapy on PI3K/AKT/HIF-1α signaling Western blotting analysis of A549 and H1299 cells showed that 24 h of anlotinib treatment reduced the phosphorylation of PI3K and AKT (p-PI3K and p-AKT) by 33%–61% and downregulated HIF-1α expression by 63%, while total PI3K and AKT protein levels remained unchanged. Bevacizumab monotherapy also reduced p-PI3K and p-AKT by 13%–15% and HIF-1α by 21%. A more dramatic impact was found for the B+A combination therapy, which reduced the markers of PI3K signaling by approximately 80% and HIF-1α by 82% (  Figures 7A, B  Figures 7C, D  Figures 7E, F  Supplementary Figure S8 Figure 7 Effects of anlotinib, bevacizumab, and combination treatment on PI3K/AKT/HIF-1α signaling in A549 and H1299 cells. (A) (B) (A, C) (D) (C) (E) (F) (E) p p p Western blot and bar graph analysis showing the effects of Anlotinib and Bevacizumab on protein expression in A549 and H1299 cells. Panels A and C display protein bands for PI3K, p-PI3K, AKT, p-AKT, HIF-1α, and β-actin under different treatments. Panels B, D, and F show bar graphs comparing relative protein expression levels across different conditions, highlighting significant differences with asterisks. 3.8 HIF-1α as an anti-tumor target of combined anlotinib and bevacizumab therapy Treatment of A549 and H1299 cells with HIF-1α inhibitor PX478 suppressed HIF-1α protein, whereas treatment with HIF-1α activator DMOG stimulated HIF-1α expression compared with the controls (  Figures 8A, B  Figures 8C, D  Figures 8E, F Figure 8 Effects of HIF-1α inhibitor PX478 and activator DMOG on expression of HIF-1α, markers of angiogenesis, and markers of the EMT in A549 and H1299 cells treated with anlotinib, bevacizumab, or B+A combination therapy. (A) (B) (C) (D) (E) (F) p p Western blot and bar graph analysis of protein expression in A549 and H1299 cell lines. Panels A and B display effects of PX478 and DMOG on HIF-α expression. Panels C and D show phosphorylated VEGFR2, PDGFRβ, and FGFR1 with treatments of anlotinib, bevacizumab, PX478, and DMOG, including combinations. Panels E and F exhibit epithelial-mesenchymal transition markers, E-cadherin, N-cadherin, vimentin, and α-SMA, under the same treatments. Bar graphs represent relative protein expression levels with statistical significance indicated. ELISA showed that in both A549 and H1299 cells, TGF-β was the highest in the control group (212 and 193 pg/mL), decreased in the bevacizumab group (175 and 152 pg/mL) and the anlotinib group (124 and 103 pg/mL), and was the lowest in the combination group (52 and 48 pg/mL). TNF-α increased from 42 and 37 pg/mL in controls to 108 and 112 pg/mL in the combination group, IFN-γ from 19 and 18 to 80 and 91 pg/mL, and IL-2 from 21 and 27 to 75 and 101 pg/mL. In contrast, IL-6 decreased from 322 and 175 pg/mL in controls to 95 and 54 pg/mL in the combination group, IL-8 from 558 and 445 to 142 and 142 pg/mL, and IL-10 from 90 and 74 to 29 and 23 pg/mL. Adding PX478 to the combination yielded values close to those of the combination group, whereas DMOG partially reversed these effects, increasing TGF-β to 116 and 95 pg/mL, IL-6 to 182 and 127 pg/mL, and IL-8 to 256 and 214 pg/mL (  Figures 9A, B Figure 9 ELISA detection of pro-angiogenic/immunosuppressive cytokine levels after combination therapy with bevacizumab and anlotinib. (A) (B) p p p Bar graphs display cytokine concentrations (pg/ml) for A549 (top row) and H1299 (bottom row) cell lines across various treatments: Control, Bevacizumab, Anlotinib, Combination, Combination with PX478, and Combination with DMOG. Cytokines include TGF-β, TNF-α, IFN-γ, IL-2, IL-6, IL-8, and IL-10. Significant differences are marked with asterisks, indicating statistical significance. Ang2, GLUT1, LDHA, and PDK1 are known to be downstream targets of HIF-1α. The combination therapy suppressed the expression of these proteins, indicating reduced HIF-1α-mediated metabolic signaling in addition to the previously noted reduced angiogenic signaling. The addition of PX478 did not produce any further suppression of Ang2, GLUT1, LDHA, and PDK1 expression; the addition of DMOG restored levels comparable to those observed with anlotinib monotherapy, neutralizing the contribution of bevacizumab to the combination therapy (  Supplementary Figures S9A, B  Supplementary Figures S10  S11 43 44 4 Discussion A vascularized microfluidic chip platform to recapitulate the formation of functional, interconnected vascular networks was developed and presented. The microfluidic platform promotes 3D tissue formation and dynamic interactions through continuous perfusion ( 45 46 in vivo in vitro 37 47 The antiangiogenic activities of anlotinib (which targets receptor tyrosine kinases) and bevacizumab (which inhibits VEGF-A) have led to their being drugs of choice for many cancers, including NSCLC ( 48 49 49 50 50 51 in vivo 52 53 43 44 PI3K/AKT/HIF-1α signaling has been previously found to be involved in angiogenesis, metabolism, survival, and the EMT ( 54 55 56 57 58 HIF-1α is shown to influence angiogenesis and the EMT in NSCLC, and it is also clear that the bevacizumab component is largely responsible for the inhibitory effect on these processes of B+A treatment. The inhibition of HIF-1α has previously been shown to reduce tumor-induced immune suppression ( 59 60 16 50 51 61 In this study, monotherapy with either bevacizumab or anlotinib had only modest effects on the phosphorylation of VEGFR2, PDGFRβ, and FGFR1, whereas the combination treatment reduced phosphorylation levels to 20%–30% of controls. This indicates that the simultaneous blockade of VEGF ligand binding and multiple angiogenic receptor tyrosine kinases produces a more complete inhibition of angiogenic signaling cascades. The partial restoration of receptor phosphorylation by DMOG further supports a mechanistic link between HIF-1α activation and downstream RTK reactivation, consistent with the role of HIF-1α in regulating pro-angiogenic gene expression under hypoxic conditions. In addition, angiogenic markers were inhibited at the functional level (i.e., phosphorylation), whereas EMT markers were fully regulated at the expression level, reflecting the synergistic anti-tumor effects of anlotinib in combination with bevacizumab treatment through multiple mechanisms and levels working together. This in-depth understanding of the differential protein expression will help to elucidate the mechanism of action of the combination therapy and provide a theoretical basis for the further optimization of targeted therapeutic strategies for NSCLC. In terms of angiogenic signaling, when HIF-1α expression was activated, its downstream pro-angiogenic pathway was reactivated, thus counteracting the pathway of action of bevacizumab by “depleting VEGF”. Thus, this “expression restoration” phenomenon reveals a mechanistic focus: HIF-1α serves as a bridge between the receptor inhibitory effects of anlotinib and the ligand antagonistic effects of bevacizumab, and the synergistic effect of both is dependent on the effective inhibition of HIF-1α. Overall, the action of bevacizumab in combination with anlotinib is dependent on the sustained inhibition of HIF-1α, and its regulation of angiogenesis, EMT, and metabolic pathways is all reflected in the differential regulation of HIF-1α-related protein expression. This differential protein expression reflects the dependence and complementarity between different drug mechanisms and provides theoretical support for the subsequent development of combination strategies targeting HIF-1α. Studies have shown that VEGF-driven tumor vascular abnormalities not only support tumor growth but also aid in tumor immune escape by promoting an immunosuppressive microenvironment ( 62 63 64 65 + + The modulation of immune parameters observed here further supports a broader impact on the tumor microenvironment. Enhanced infiltration of CD4 + + Although this study mainly focused on elucidating the anti-angiogenic effect of this combination therapy through a vascularized microfluidic microarray model and in vitro in vivo in vivo We acknowledge some limitations to the current study. First, the microfluidic chip model lacks the complexity of the tumor microenvironment and allows only limited assessment of cellular interactions. Chip design may be optimized in the future to allow the inclusion of stromal cells, such as those from the immune system. Second, the current in vivo 5 Conclusion A vascularized microfluidic chip platform was constructed and used to test the efficacy of the anti-angiogenic drugs anlotinib and bevacizumab. Anlotinib and bevacizumab were shown to have a synergistic impact on reducing the growth of NSCLC cells in vitro in vivo Data availability statement The datasets presented in this study can be found in online repositories. The names of the repository/repositories and accession number(s) can be found below: https://doi.org/10.6084/m9.figshare.28876859 Ethics statement The animal study was approved by the Animal Welfare and Ethics Committee (approval no.: SYT2024084). The study was conducted in accordance with the local legislation and institutional requirements. Author contributions NS: Data curation, Conceptualization, Writing – original draft, Investigation, Writing – review & editing, Methodology, Formal analysis. JL: Writing – original draft, Validation, Investigation, Writing – review & editing. JH: Data curation, Writing – original draft, Writing – review & editing, Formal analysis. NJ: Formal analysis, Writing – original draft, Writing – review & editing, Data curation. RW: Formal analysis, Writing – review & editing, Writing – original draft, Visualization. JX: Writing – review & editing, Writing – original draft, Visualization, Formal analysis. WH: Supervision, Writing – review & editing, Writing – original draft, Funding acquisition. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fimmu.2025.1613368/full#supplementary-material References 1 Chen Z Fillmore CM Hammerman PS Kim CF Wong KK Non-small-cell lung cancers: A heterogeneous set of diseases Nat Rev Cancer 2014 14 535–46 10.1038/nrc3775 25056707 PMC5712844 2 Relli V Trerotola M Guerra E Alberti S Abandoning the notion of non-small cell lung cancer Trends Mol Med 2019 25 585–94 10.1016/j.molmed.2019.04.012 31155338 3 Miao D Zhao J Han Y Zhou J Li X Zhang T Management of locally advanced non-small cell lung cancer: state of the art and future directions Cancer Commun (Lond) 2024 44 23 46 10.1002/cac2.12505 37985191 PMC10794016 4 Mavrikios A Remon J Quevrin C Mercier O Tselikas L Botticella A Local control strategies for management of nsclc with oligoprogressive disease Cancer Treat Rev 2023 120 102621 10.1016/j.ctrv.2023.102621 37690180 5 Saw SPL Ong BH Chua KLM Takano A Tan DSW Revisiting neoadjuvant therapy in non-small-cell lung cancer Lancet Oncol 2021 22 e501–e16 10.1016/s1470-2045(21)00383-1 34735819 6 JS J Boyle TA Molecular pathology of lung cancer Cold Spring Harb Perspect Med 2022 12 a037812 10.1101/cshperspect.a037812 34751163 PMC8886739 7 Sun D Xie XP Zhang X Wang Z Sait SF Iyer SV Stem-like cells drive nf1-associated mpnst functional heterogeneity and tumor progression Cell Stem Cell 2021 28 1397 410.e4 10.1016/j.stem.2021.04.029 34010628 PMC8349880 8 Dudley AC Griffioen AW The modes of angiogenesis: an updated perspective Angiogenesis 2023 26 477–80 10.1007/s10456-023-09895-4 37640982 PMC10777330 9 Garcia J Hurwitz HI Sandler AB Miles D Coleman RL Deurloo R Bevacizumab (Avastin ® Cancer Treat Rev 2020 86 102017 10.1016/j.ctrv.2020.102017 32335505 10 Zhuang H Shi S Yuan Z Chang JY Bevacizumab treatment for radiation brain necrosis: mechanism, efficacy and issues Mol Cancer 2019 18 21 10.1186/s12943-019-0950-1 30732625 PMC6367784 11 Shaw P Dwivedi SKD Bhattacharya R Mukherjee P Rao G Vegf signaling: role in angiogenesis and beyond Biochim Biophys Acta Rev Cancer 2024 1879 189079 10.1016/j.bbcan.2024.189079 38280470 12 Roviello G Bachelot T Hudis CA Curigliano G Reynolds AR Petrioli R The role of bevacizumab in solid tumours: A literature based meta-analysis of randomised trials Eur J Cancer 2017 75 245–58 10.1016/j.ejca.2017.01.026 28242502 13 Huang M Lin Y Wang C Deng L Chen M Assaraf YG New insights into antiangiogenic therapy resistance in cancer: mechanisms and therapeutic aspects Drug Resist Update 2022 64 100849 10.1016/j.drup.2022.100849 35842983 14 Lawler SE Digging deeper for new targets in bevacizumab resistance Neuro Oncol 2023 25 261–2 10.1093/neuonc/noac269 36516222 PMC9925704 15 Shen G Zheng F Ren D Du F Dong Q Wang Z Anlotinib: A novel multi-targeting tyrosine kinase inhibitor in clinical development J Hematol Oncol 2018 11 120 10.1186/s13045-018-0664-7 30231931 PMC6146601 16 Yan M Yang R Li Q Wang C Chen J Wu Z Anti-angiogenic and antitumor effects of anlotinib combined with bevacizumab for colorectal cancer Transl Oncol 2024 41 101887 10.1016/j.tranon.2024.101887 38262112 PMC10832611 17 Yang S Zhang Z Wang Q Emerging therapies for small cell lung cancer J Hematol Oncol 2019 12 47 10.1186/s13045-019-0736-3 31046803 PMC6498593 18 Quiros-Gonzalez I Tomaszewski MR Golinska MA Brown E Ansel-Bollepalli L Hacker L Photoacoustic tomography detects response and resistance to bevacizumab in breast cancer mouse models Cancer Res 2022 82 1658–68 10.1158/0008-5472.Can-21-0626 35404400 PMC9359720 19 Chen C Guo Y Huang Q Wang B Wang W Niu J Pi3k inhibitor impairs tumor progression and enhances sensitivity to anlotinib in anlotinib-resistant osteosarcoma Cancer Lett 2022 536 215660 10.1016/j.canlet.2022.215660 35318116 20 Song F Hu B Cheng JW Sun YF Zhou KQ Wang PX Anlotinib suppresses tumor progression via blocking the vegfr2/pi3k/akt cascade in intrahepatic cholangiocarcinoma Cell Death Dis 2020 11 573 10.1038/s41419-020-02749-7 32709873 PMC7381674 21 Dong S Liang S Cheng Z Zhang X Luo L Li L Ros/pi3k/akt and wnt/Β-catenin signalings activate hif-1α-induced metabolic reprogramming to impart 5-fluorouracil resistance in colorectal cancer J Exp Clin Cancer Res 2022 41 15 10.1186/s13046-021-02229-6 34998404 PMC8742403 22 Masoud GN Li W Hif-1α Pathway: role, regulation and intervention for cancer therapy Acta Pharm Sin B 2015 5 378–89 10.1016/j.apsb.2015.05.007 26579469 PMC4629436 23 Schödel J Grampp S Maher ER Moch H Ratcliffe PJ Russo P Hypoxia, hypoxia-inducible transcription factors, and renal cancer Eur Urol 2016 69 646–57 10.1016/j.eururo.2015.08.007 26298207 PMC5012644 24 Chen Y Xu X Wang Y Zhang Y Zhou T Jiang W Hypoxia-induced ska3 promoted cholangiocarcinoma progression and chemoresistance by enhancing fatty acid synthesis via the regulation of par-dependent hif-1a deubiquitylation J Exp Clin Cancer Res 2023 42 265 10.1186/s13046-023-02842-7 37821935 PMC10565972 25 Devignes CS Aslan Y Brenot A Devillers A Schepers K Fabre S Hif signaling in osteoblast-lineage cells promotes systemic breast cancer growth and metastasis in mice Proc Natl Acad Sci U.S.A 2018 115 E992 E1001 10.1073/pnas.1718009115 29339479 PMC5798374 26 Erin N Grahovac J Brozovic A Efferth T Tumor microenvironment and epithelial mesenchymal transition as targets to overcome tumor multidrug resistance Drug Resist Update 2020 53 100715 10.1016/j.drup.2020.100715 32679188 27 Cortes E Lachowski D Robinson B Sarper M Teppo JS Thorpe SD Tamoxifen mechanically reprograms the tumor microenvironment via hif-1a and reduces cancer cell survival EMBO Rep 2019 20 e46557 10.15252/embr.201846557 30538116 PMC6322388 28 Chen T Li K Liu Z Liu J Wang Y Sun R Wdr5 facilitates emt and metastasis of cca by increasing hif-1α Accumulation in myc-dependent and independent pathways Mol Ther 2021 29 2134–50 10.1016/j.ymthe.2021.02.017 33601056 PMC8178527 29 Zhang YM Miao ZM Chen YP Song ZB Li YY Liu ZW Ononin promotes radiosensitivity in lung cancer by inhibiting hif-1α/vegf pathway Phytomedicine 2024 125 155290 10.1016/j.phymed.2023.155290 38308918 30 Mark D Haeberle S Roth G von Stetten F Zengerle R Microfluidic lab-on-a-chip platforms: requirements, characteristics and applications Chem Soc Rev 2010 39 1153–82 10.1039/b820557b 20179830 31 Sontheimer-Phelps A Hassell BA Ingber DE Modelling cancer in microfluidic human organs-on-chips Nat Rev Cancer 2019 19 65 81 10.1038/s41568-018-0104-6 30647431 32 Surappa S Multani P Parlatan U Sinawang PD Kaifi J Akin D Integrated “Lab-on-a-chip” Microfluidic systems for isolation, enrichment, and analysis of cancer biomarkers Lab Chip 2023 23 2942–58 10.1039/d2lc01076c 37314731 PMC10834032 33 Hajal C Offeddu GS Shin Y Zhang S Morozova O Hickman D Engineered human blood-brain barrier microfluidic model for vascular permeability analyses Nat Protoc 2022 17 95 128 10.1038/s41596-021-00635-w 34997242 34 Amin R Knowlton S Hart A Yenilmez B Ghaderinezhad F Katebifar S 3d-printed microfluidic devices Biofabrication 2016 8 22001 10.1088/1758-5090/8/2/022001 27321137 35 Bouzetos E Ganar KA Mastrobattista E Deshpande S van der Oost J (R)Evolution-on-a-chip Trends Biotechnol 2022 40 60 76 10.1016/j.tibtech.2021.04.009 34049723 36 Sackmann EK Fulton AL Beebe DJ The present and future role of microfluidics in biomedical research Nature 2014 507 181–9 10.1038/nature13118 24622198 37 Ko J Ahn J Kim S Lee Y Lee J Park D Tumor spheroid-on-a-chip: A standardized microfluidic culture platform for investigating tumor angiogenesis Lab Chip 2019 19 2822–33 10.1039/c9lc00140a 31360969 38 Le X Nilsson M Goldman J Reck M Nakagawa K Kato T Dual egfr-vegf pathway inhibition: A promising strategy for patients with egfr-mutant nsclc J Thorac Oncol 2021 16 205–15 10.1016/j.jtho.2020.10.006 33096270 39 Zhou M Chen X Zhang H Xia L Tong X Zou L China national medical products administration approval summary: anlotinib for the treatment of advanced non-small cell lung cancer after two lines of chemotherapy Cancer Commun (Lond) 2019 39 36 10.1186/s40880-019-0383-7 31221221 PMC6585030 40 Chen R Manochakian R James L Azzouqa AG Shi H Zhang Y Emerging therapeutic agents for advanced non-small cell lung cancer J Hematol Oncol 2020 13 58 10.1186/s13045-020-00881-7 32448366 PMC7245927 41 Krysan K Lee JM Dohadwala M Gardner BK Reckamp KL Garon E Inflammation, epithelial to mesenchymal transition, and epidermal growth factor receptor tyrosine kinase inhibitor resistance J Thorac Oncol 2008 3 107–10 10.1097/JTO.0b013e3181630ece 18303428 42 Xie S Wu Z Qi Y Wu B Zhu X The metastasizing mechanisms of lung cancer: recent advances and therapeutic challenges BioMed Pharmacother 2021 138 111450 10.1016/j.biopha.2021.111450 33690088 43 Taylor CT Scholz CC The effect of hif on metabolism and immunity Nat Rev Nephrol 2022 18 573–87 10.1038/s41581-022-00587-8 35726016 PMC9208707 44 Li Z You Q Zhang X Small-molecule modulators of the hypoxia-inducible factor pathway: development and therapeutic applications J Med Chem 2019 62 5725–49 10.1021/acs.jmedchem.8b01596 30682255 45 Yu T Yang Q Peng B Gu Z Zhu D Vascularized organoid-on-a-chip: design, imaging, and analysis Angiogenesis 2024 27 147–72 10.1007/s10456-024-09905-z 38409567 46 Shakeri A Wang Y Zhao Y Landau S Perera K Lee J Engineering organ-on-a-chip systems for vascular diseases Arterioscler Thromb Vasc Biol 2023 43 2241–55 10.1161/atvbaha.123.318233 37823265 PMC10842627 47 Ghosh LD Mathur T Tronolone JJ Chuong A Rangel K Corvigno S Angiogenesis-enabled human ovarian tumor microenvironment-chip evaluates pathophysiology of platelets in microcirculation Adv Healthc Mater 2024 13 e2304263 10.1002/adhm.202304263 38553940 PMC11281868 48 Agrafiotis AC Berzenji L Koyen S Vermeulen D Winthagen R Hendriks JMH An overview of the use of anti-angiogenic agents in the treatment of thymic epithelial tumors Int J Mol Sci 2023 24 17065 10.3390/ijms242317065 38069386 PMC10707176 49 Zhu AX Abbas AR de Galarreta MR Guan Y Lu S Koeppen H Molecular correlates of clinical response and resistance to atezolizumab in combination with bevacizumab in advanced hepatocellular carcinoma Nat Med 2022 28 1599–611 10.1038/s41591-022-01868-2 35739268 50 Liu Z Qin T Yuan X Yang J Shi W Zhang X Anlotinib downregulates rgc32 which provoked by bevacizumab Front Oncol 2022 12 875888 10.3389/fonc.2022.875888 35664796 PMC9158131 51 Su Y Luo B Lu Y Wang D Yan J Zheng J Anlotinib induces a T cell-inflamed tumor microenvironment by facilitating vessel normalization and enhances the efficacy of pd-1 checkpoint blockade in neuroblastoma Clin Cancer Res 2022 28 793 809 10.1158/1078-0432.Ccr-21-2241 34844980 PMC9377760 52 Song F Hu B Liang XL Cheng JW Wang CG Wang PX Anlotinib potentiates anti-pd1 immunotherapy via transferrin receptor-dependent cd8(+) T-cell infiltration in hepatocellular carcinoma Clin Transl Med 2024 14 e1738 10.1002/ctm2.1738 39095323 PMC11296886 53 Li S Meng W Guan Z Guo Y Han X The hypoxia-related signaling pathways of vasculogenic mimicry in tumor treatment BioMed Pharmacother 2016 80 127–35 10.1016/j.biopha.2016.03.010 27133049 54 Mazurakova A Koklesova L Csizmár SH Samec M Brockmueller A Šudomová M Significance of flavonoids targeting pi3k/akt/hif-1α Signaling pathway in therapy-resistant cancer cells - a potential contribution to the predictive, preventive, and personalized medicine J Adv Res 2024 55 103–18 10.1016/j.jare.2023.02.015 36871616 PMC10770105 55 Khezri MR Hsueh HY Mohammadipanah S Khalili Fard J Ghasemnejad-Berenji M The interplay between the pi3k/akt pathway and circadian clock in physiologic and cancer-related pathologic conditions Cell Prolif 2024 57 e13608 10.1111/cpr.13608 38336976 PMC11216939 56 Jacoby JJ Erez B Korshunova MV Williams RR Furutani K Takahashi O Treatment with hif-1alpha antagonist px-478 inhibits progression and spread of orthotopic human small cell lung cancer and lung adenocarcinoma in mice J Thorac Oncol 2010 5 940–9 10.1097/JTO.0b013e3181dc211f 20512076 PMC3782111 57 Yu L Ran H Lu Y Ma Q Huang H Liu W Targeting hif-1α Alleviates the inflammatory responses and rebuilds the cd4(+) T cell subsets balance in the experimental autoimmune myasthenia gravis inflammation model via regulating cellular and humoral immunity Life Sci 2024 336 122287 10.1016/j.lfs.2023.122287 37995933 58 Jiang M Qin B Luo L Li X Shi Y Zhang J A clinically acceptable strategy for sensitizing anti-pd-1 treatment by hypoxia relief J Control Release 2021 335 408–19 10.1016/j.jconrel.2021.06.001 34089792 59 Luo F Lu FT Cao JX Ma WJ Xia ZF Zhan JH Hif-1α Inhibition promotes the efficacy of immune checkpoint blockade in the treatment of non-small cell lung cancer Cancer Lett 2022 531 39 56 10.1016/j.canlet.2022.01.027 35090965 60 McGettrick AF O’Neill LAJ The role of hif in immunity and inflammation Cell Metab 2020 32 524–36 10.1016/j.cmet.2020.08.002 32853548 61 Wu X Giobbie-Hurder A Liao X Lawrence D McDermott D Zhou J Vegf neutralization plus ctla-4 blockade alters soluble and cellular factors associated with enhancing lymphocyte infiltration and humoral recognition in melanoma Cancer Immunol Res 2016 4 858–68 10.1158/2326-6066.Cir-16-0084 27549123 PMC5050160 62 Hack SP Zhu AX Wang Y Augmenting anticancer immunity through combined targeting of angiogenic and pd-1/pd-L1 pathways: challenges and opportunities Front Immunol 2020 11 598877 10.3389/fimmu.2020.598877 33250900 PMC7674951 63 Zhou Y Liu Z Yu A Zhao G Chen B Immune checkpoint inhibitor combined with antiangiogenic agent synergistically improving the treatment efficacy for solid tumors Immunotargets Ther 2024 13 813–29 10.2147/itt.S494670 39763508 PMC11700879 64 Sha H Tong F Ni J Sun Y Zhu Y Qi L First-line penpulimab (an anti-pd1 antibody) and anlotinib (an angiogenesis inhibitor) with nab-paclitaxel/gemcitabine (Paag) in metastatic pancreatic cancer: A prospective, multicentre, biomolecular exploratory, phase ii trial Signal Transduct Target Ther 2024 9 143 10.1038/s41392-024-01857-6 38844468 PMC11156675 65 Oaknin A Gladieff L Martínez-García J Villacampa G Takekuma M De Giorgi U Atezolizumab plus bevacizumab and chemotherapy for metastatic, persistent, or recurrent cervical cancer (Beatcc): A randomised, open-label, phase 3 trial Lancet 2024 403 31 43 10.1016/s0140-6736(23)02405-4 38048793 ",
  "metadata": {
    "Title of this paper": "Atezolizumab plus bevacizumab and chemotherapy for metastatic, persistent, or recurrent cervical cancer (Beatcc): A randomised, open-label, phase 3 trial",
    "Journal it was published in:": "Frontiers in Immunology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484198/"
  }
}