{
  "title": "Paper_882",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12474968 PMC12474968.1 12474968 12474968 41006434 10.1038/s41598-025-17114-x 17114 1 Article Effects of Slit2 on hypertrophic scar formation: an in vitro study in fibroblasts Cui Hui Song 1 Cho Yoon Soo 2 Joo So Young 2 Zheng Ya Xin 1 Ro Yu Mi 1 Jeon Kibum pourmythe@naver.com 3 Seo Cheong Hoon chseomd@gmail.com 2 1 https://ror.org/03sbhge02 grid.256753.0 0000 0004 0470 5964 Department of Rehabilitation Medicine, Hangang Sacred Heart Hospital, College of Medicine, Burn Institute, Hallym University, 2 https://ror.org/03sbhge02 grid.256753.0 0000 0004 0470 5964 Department of Rehabilitation Medicine, Hangang Sacred Heart Hospital, College of Medicine, Hallym University, 3 https://ror.org/03sbhge02 grid.256753.0 0000 0004 0470 5964 Department of Laboratory Medicine, Hangang Sacred Heart Hospital, College of Medicine, Hallym University, 26 9 2025 2025 15 478255 33117 14 3 2025 21 8 2025 26 09 2025 28 09 2025 28 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Hypertrophic scarring (HTS) is a common complication of burns and has been associated with Slit2 protein. Slit2 plays various physiological and pathological roles in some body organs and tumors. However, its role in HTS development remains poorly understood. Therefore, this study investigated the involvement of intracellular and exogenous Slit2 in hypertrophic scar formation in vitro. Human normal fibroblasts (HNFs) and hypertrophic scar fibroblasts (HTSFs) were isolated from normal skin and hypertrophic scar tissues, respectively. Immunohistochemistry was conducted, and molecular expressions were detected by real-time polymerase chain reaction and western blotting. Cell proliferation and mobility were assessed. The results showed that Slit2 and Robo1 expressions were higher in the dermis of HTS tissues and HTSFs than in normal skin and HNFs. Downregulation of Slit2 expression by siRNA transfection reduced the expression of alpha-smooth muscle actin (α-SMA) and extracellular matrix in HTSFs. Additionally, treatment with recombinant Slit2 protein enhanced cell proliferation, expression of α-SMA, ECM, vimentin, N-cadherin, and migration by inducing the phosphorylation of both SMAD and non-SMAD signaling in HNFs. These findings highlight the active role of Slit2 in HTS formation, offer new insights into HTS pathology, and suggest Slit2 as a potential therapeutic target for post-burn hypertrophic scarring. Supplementary Information The online version contains supplementary material available at 10.1038/s41598-025-17114-x. Keywords Slit2 Post-burn hypertrophic scar Fibroblast SMAD Non-SMAD Subject terms Molecular biology Pathogenesis Hallym University Research Fund HURF-2023-11 Jeon Kibum pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Hypertrophic scars (HTS) are the most frequent sequelae of burn injuries and are classified as a fibrotic disorder characterized by the excessive accumulation of extracellular matrix (ECM) components 1 1 HTS is conventionally attributed to dermal pathology, in which ECM-producing dermal fibroblasts play a critical role in HTS formation. HTS derived fibroblast (HTSF) exhibit larger cell size, higher expression of alpha-smooth muscle actin (α-SMA), transforming growth factor β1 (TGF-β1), fibronectin, type I and III collagen, fibroblast-specific protein 1 (FSP1), vimentin, and N-cadherin compared with normal dermal fibroblasts 2 3 4 In the pathology of HTS formation, FMT is primarily driven by TGF-β1 signaling, which includes both SMAD (canonical) and non-SMAD (non-canonical) pathways 5 6 7 8 9 9 10 11 12 Slit is a family of secreted glycoproteins that specifically binds to a transmembrane receptor protein known as roundabout (Robo). Three Slit genes (Slit1, Slit2, and Slit3) and four Robo genes (Robo1, Robo2, Robo3, and Robo4) have been identified 13 13 14 15 16 17 18 A recent study demonstrated that Slit1 expression is upregulated in HTSFs compared to normal dermal fibroblasts. Moreover, treatment with exogenous recombinant Slit1 protein promoted fibroblast proliferation and differentiation through the activation of both SMAD-dependent and SMAD-independent signaling pathways. In present study, we after reviewing previous clinical studies and reports on the role of Slit2 in various organ fibrosis, we hypothesized that Slit2 plays a critical role in HTS formation by participating in complex fibrosis-related signaling pathways. Herein, we investigated Slit2 expression in HTS tissues and HTSFs, the antifibrotic effects of Slit2 siRNA in HTSFs, and the profibrotic effects of exogenous Slit2 administration in normal fibroblasts. Our findings demonstrated the critical role of Slit2 in HTS formation through both SMAD and non-SMAD signaling, thereby identifying a potential therapeutic target for post-burn HTS treatment. Material and methods Patients and samples Table 1 Table 1 Demographic characteristics of patients with post-burn hypertrophic scar. Patients Location of specimens Age (years) Sex Months post-burn 1 Hand 30 Male 8 2 Foot 34 Male 11 3 Hand 47 Male 10 4 Hand 48 Male 13 Immunohistochemistry (IHC) Fresh HTS and normal tissues were sectioned into 1 cm 3 19 20 Fibroblast isolation and culture All primary culture procedures were performed as previously described 21 23 2 Recombinant Slit2 protein treatment HNFs were cultured in T75 flasks (Eppendorf, Hamburg, Germany). When the cells reached 50–60% confluence, the medium was changed to one containing 0.05% FBS for 24 h to induce starvation. The cells were then treated with recombinant Slit2 (rSlit2) N-terminal (Novus Biologicals, R&D Systems, Centennial, CO, USA) at concentrations of 1, 10, and 100 ng/mL for 1 h (cell signaling detection) or 24 h (mRNA and protein detection). Control cells were treated with DPBS. Cell proliferation assay Cell proliferation was assessed using the CellTiter-Glo Luminescent Cell Viability Assay Kit (Promega, Madison, WI, USA). HNFs were cultured in 96-well plates at a density of 1 × 10 4 Cell migration assay Cell migration was assessed using a culture-insert 2-well in μ-dishes (Ibidi, GmbH, Planegg, Germany) according to the manufacturer’s instructions. HNFs were seeded at a density of 1 × 10 4 24 RNA interference (RNAi) and TGF-β1 treatment After culturing HSFs and HNFs for 24 h to achieve 50–60% confluence, the medium was replaced with an antibiotic-free medium containing 10% FBS. A mixture of 100 nM Slit2-targeting siRNA and transfection reagent (Bioneer, Seoul, Korea) was added to the cells for 5 h. At the same time, control cells were transfected with 100 nM control siRNA. Subsequently, cells were cultured in a complete medium for 19 h, followed by 6 h in a medium containing 0.05% FBS. Finally, cells were treated with 10 ng/mL of TGF-β1 (Peprotech, Rocky Hill, NJ, USA) for either 1 h (for cell signaling detection) or 24 h (for mRNA and protein detection). Reverse transcription-quantitative polymerase chain reaction (RT-qPCR) Cells were harvested through detachment using Accutase® solution (Thermo Fisher Scientific, Waltham, MA, USA) and lysed with TRIzol (Invitrogen, Carlsbad, CA, USA). Tissues were homogenized in TRIzol using a gentleMACS™ Dissociator (Miltenyi Biotec, Bergisch-Gladbach, Germany). Total RNA was extracted using the ReliaPrep RNA Miniprep Systems Kit (Promega) according to the manufacturer’s instructions. RNA concentration was measured using a NanoDrop spectrophotometer (BioTek, Winooski, VT, USA). In total, 2 µg of RNA was used for cDNA synthesis with PrimeScript™ RT Master Mix (Perfect Real-Time) (Takara, Shiga, Japan). The cDNA was dispensed into a 20-μL reaction system containing 2 × PCR premixes (Takara), and the primers are listed in Table 2 −ΔΔCT Table 2 Real-time PCR primer sequences. Gene Forward (5′ → 3′) Reverse (5′ → 3′) SLIT2 CAGAGCTTCAGCAACATGACCC GAAAGCACCTTCAGGCACAACAG Robo1 AGTGAGCCTCAGTTCATCCAGC GCTCCAATACCTGCTATGAAGGC ACTA2 CCGACCGAATGCAGAAGGA ACAGAGTATTTGCGCTCCGAA FN1 CCAGTCCACAGCTATTCCTG ACAACCACGGATGAGCTG COL1A1 ATGTTCAGCTTTGTGGACCTC CTGTACGCAGGTGATTGGTG COL3A1 CACTGGGGAATGGAGCAAAAC ATCAGGACCACCAATGTCATAGG CDH2 ACCGACACTCCTACAAGATTT GCAGAAACAAGTTGGTTGGATA VIM GTCAGAACTAAAGGAGCTGC TGTTGCTGTCCAAGTTGCTC GAPDH CATGAGAAGTATGACAACAGCCT AGTCCTTCCACGATACCAAAGT Western blotting Cells were harvested and lysed to extract proteins using a radioimmunoprecipitation assay (RIPA) buffer, which included protease and phosphatase inhibitors (Sigma-Aldrich, St. Louis, MO, USA). Normal skin samples and HTS tissues were washed three times with cold DPBS (Biowest) and cut into pieces of approximately 2–3 mm × 8–10 mm, soaked in dispase II solution (1 unit/mL, Gibco), which was prepared using the cell culture medium. The samples were then stored at 4 °C with shaking for 18 h to separate the epidermis and dermis. Then, tissues were homogenized in RIPA buffer using a gentleMACS™ Dissociator. The samples were centrifuged three times at 15,000 × g 3 Table 3 Primary antibodies used in western blot analysis. Target Host Dilution Company (cat. no.) GAPDH Rabbit 1:1000 Cell signaling technology (2118S) GAPDH Mouse 1:1000 Santa cruz technology (sc-47724) Robo1 Rabbit 1:1000 Cusabio technology (CSB-PA896760LA01HU) Slit2 Rabbit 1:1000 Cusabio technology (CSB- PA245341 α-SMA Mouse 1:500 Abcam (ab7817) Fibronectin Rabbit 1:2000 Abcam (ab6328) Collagen Ⅰ Rabbit 1:1000 Abcam (ab34710) Collagen Ⅲ Rabbit 1:1000 Abcam (ab7778) Vimentin Mouse 1:3000 Abcam (ab92547) N-cadherin Mouse 1:1000 Invitrogen (333900) Phospho-SMAD2 Rabbit 1:1000 Cell signaling technology (3108S) SMAD2 Rabbit 1:1000 Abcam (ab33875) Phospho-SMAD3 Rabbit 1:1000 Invitrogen (MA5-14936) SMAD3 Rabbit 1:1000 Cell signaling technology (9523S) Phospho-SMAD1/5/8 Rabbit 1:1000 Merck millipore (AB3848-Ⅰ) SMAD1 Rabbit 1:1000 Cell signaling technology (6944S) Phospho-TAK1 Rabbit 1:1000 Cell signaling technology (9339S) TAK1 Rabbit 1:1000 Cell signaling technology (5206S) Phospho-p38 Mouse 1:1000 Cell signaling technology (9216S) p38 Rabbit 1:1000 Cell signaling technology (8690S) Phospho-JNK Rabbit 1:1000 Cell signaling technology (9251S) JNK Rabbit 1:1000 Cell signaling technology (9252S) Phospho-ERK Rabbit 1:1000 Cell signaling technology (4370S) ERK Mouse 1:1000 Cell signaling technology (4696S) Phospho-AKT Rabbit 1:1000 Cell signaling technology (4060S) AKT Rabbit 1:1000 Cell signaling technology (4671S) Statistical analysis All experimental data are presented as means ± standard deviations (SDs). Statistical analyses were performed using PASW Statistics, version 24 (SPSS Inc., Chicago, IL, USA). Kruskal–Wallis one-way analysis of variance (ANOVA) was used to test the significance of differences between multiple samples. Subsequently, the Mann–Whitney U test was used to compare the two groups. Significance was set at P P Results Slit2 and Robo1 expressions are increased in the dermis of HTS Slit2 expression in HTS tissues and corresponding normal skin was assessed using IHC staining (Fig. 1 P 1 P 1 P 1 Fig. 1 Expression of Slit2 and Robo1 was elevated in HTS tissues. IHC staining results demonstrated that the epidermal thickness in HTS tissues was significantly higher than in normal skin. Scale bar = 50 μm ( a b c d P In contrast, IHC staining showed a significant decrease in Slit2 expression in the epidermis of HTS tissues (0.19 ± 0.12-fold decrease, P P P Knockdown of elevated Slit2 expression by siRNA transfection inhibits expression of fibrotic markers in HTSFs IHC and western blotting showed that Slit2 was highly elevated expression of Slit2 in the dermis of HTS tissues. To further investigate, HTSFs were isolated from HTS tissues and compared to HNFs. Slit2 expression in HTSFs was significantly increased at mRNA (2.37 ± 0.29-fold increase, P 2 P 2 P 2 P 2 Fig. 2 Knockdown of elevated Slit2 expression by siRNA transfection inhibited expression of fibrotic markers in HTSFs. HNFs and HTSFs were isolated from normal skin tissues, and post-burn HTS matched with normal skin, respectively. Slit2 mRNA and protein levels were significantly higher in HTSFs than in HNFs ( a b c d e f g h i j k l m n P To assess the functional relevance of intracellular Slit2 expression, siRNA-mediated knockdown was performed. Transfection with Slit2-targeting siRNA resulted in a significant reduction of Slit2 expression at mRNA (0.15 ± 0.02-fold decrease, P 2 P 2 P P 2 P P 2 P P 2 P P 2 Slit2–siRNA downregulates fibrotic markers and related signaling in TGF-β1-induced fibrosis models To elucidate the role of downregulation of Slit2 expression in suppressing the expression of fibrosis markers in HTSFs, TGF-β1 stimulation was performed following siRNA transfection, and the expression of fibrotic markers, as well as SMAD and non-SMAD signaling were evaluated. TGF-β1 treatment significantly increased Slit2 expression at mRNA (2.77 ± 0.29-fold increase, P 3 P 3 P P 3 P 3 P 3 P 3 P 3 P 3 P 3 Fig. 3 Slit2–siRNA inhibited TGF-β1-induced expression of fibrotic markers in HNFs. HNFs were transfected with siRNA, followed by treatment with TGF-β1 (10 ng/mL) for 24 h. TGF-β1 treatment significantly increased Slit2 mRNA and protein expression in HNFs ( a b c c d e f P In parallel, Slit2–siRNA transfection significantly reduced TGF-β1-induced phosphorylation of SMAD signaling molecules in HNFs, decreasing the phosphorylation of SMAD2 (0.67 ± 0.07-fold decrease, P 4 P 4 P 4 P 5 P 5 P 5 P 5 P 5 P 5 Fig. 4 Slit2–siRNA inhibited TGF-β1-induced SMAD signaling in HNFs. HNFs were transfected with siRNA and treated with TGF-β1 (10 ng/mL) for 1 h. Slit2–siRNA significantly decreased TGF-β1-induced phosphorylation of SMAD2 ( a b a c a d P Fig. 5 Slit2–siRNA inhibited TGF-β1-induced non-SMAD signaling in HNFs. HNFs were transfected with siRNA followed by treated with TGF-β1 (10 ng/mL) for 1 h. Slit2–siRNA significantly decreased TGF-β1-induced phosphorylation of TAK1 ( a b a c a d a e a f P Exogenous rSlit2 induces FMT in HNFs Given the observed upregulation of Slit2 in the dermis of HTS tissues, we hypothesized that Slit2 functions as a secreted factor influencing target cell behavior. To test this, human normal fibroblasts (HNFs) were treated with recombinant Slit2 (rSlit2) at concentrations of 1, 10, and 100 ng/mL for 24 h. Treatment with 1 ng/mL rSlit2 resulted in no significant change in proliferation compared to the control group (1.05 ± 0.07-fold increase, P 6 P P 6 25 P P 6 P P 6 P P 6 Fig. 6 rSlit2 treatment induced cell proliferation, differentiation, and synthesis of ECM in HNFs. Cell proliferation ( a b c d e f g h i P P Further analysis revealed that rSlit2 promoted ECM synthesis. Treatment with rSlit2 at 10 and 100 ng/mL significantly upregulated the expression of ECM. Specifically, type I collagen expression were increased at mRNA (10 ng/mL: 2.23 ± 0.36-fold increase, P P 6 P P 6 P P 6 P P 6 P P 6 P P 6 FMT is also characterized by upregulation of migration-related molecules, including vimentin and N-cadherin 21 P P 7 P P 7 P P 7 P P 7 P 7 P 7 Fig. 7 rSlit2 treatment induced changes related to FMT in HNFs. Treatment with rSlit2 at 10 and 100 ng/mL for 24 h significantly increased mRNA and protein expression of vimentin ( a b c d e f P P Exogenous rSlit2 induces SMAD and non-SMAD signaling pathways in HNFs rSlit2 treatment induced FMT. Therefore, we investigated whether rSlit2 affected FMT-related signaling, including the SMAD and non-SMAD signaling pathways. HNFs treated with rSlit2 at 10 and 100 ng/mL for 1 h showed significantly increased SMAD signaling by increasing the phosphorylation of SMAD2 (10 ng/mL: 1.79 ± 0.19-fold increase, P P 8 P 8 8 P P 9 P P 9 P P 9 P P 9 P P 9 P P 9 Fig. 8 rSlit2 treatment induced SMAD signaling in HNFs. Treatment with rSlit2 at 10 or 100 ng/mL for 1 h significantly increased phosphorylation of SMAD2 ( a b a c a d P P Fig. 9 rSlit2 treatment induced non-SMAD signaling in HNFs. Treatment with rSlit2 at 10 and 100 ng/mL for 1 h significantly increased phosphorylation of TAK1 ( a b a c a d a e a f P P Exogenous rSlit2 does not activate TGF-β receptors in HNFs To clarify whether rSlit2-induced activation of SMAD and non-SMAD signaling occurs via TGF-β receptors (TGFβR) activation, HNFs were treated with rSlit2 in the presence or absence of SB431542, an inhibitor of TGF-β type I activin receptor-like kinase (ALK) receptors. Treatment with 100 ng/mL rSlit2 alone or in combination with 20 μM SB431542 for 1 h significantly increased SMAD signaling, as indicated by the enhanced phosphorylation of SMAD2 in rSlit2-only group (17.73 ± 2.12-fold increase, P P P P To further validate these findings, western blot analysis of α-SMA and fibronectin was performed after 24-h treatments. Proteins were significantly upregulated in rSlit2-treated group (α-SMA: 2.60 ± 0.29-fold increase, P P P P Discussion Slit2, a member of the Slit protein family, is primarily known for its role in neural development, particularly in axon guidance and neuronal migration 13 14 15 4 15 Our findings suggest that not only endogenous Slit2 but also exogenous Slit2 plays a crucial role in HTS formation by regulating TGF-β1 signaling pathways. HTS formation depends on the depth of the burn injury, whether deep dermal or full thickness 26 27 28 29 30 To explain the role of intracellular Slit2 in HTSFs, we downregulated Slit2 using siRNA transfection, which significantly inhibited the FMT marker α-SMA and ECM components, both are also HTS markers. Although TGF-β1 treatment increased Slit2 expression in HNFs, Slit2–siRNA downregulated the expression of α-SMA and ECM components. This downregulation is attributed to blocked TGF-β1-induced SMAD and non-SMAD signaling. Slit2 functions both upstream and downstream of TGF-β1 in other fibrotic tissues, however, the specific mechanism of Slit2 function remains to be fully elucidated. In airway fibrosis, Slit2 operates upstream of TGF-β1 in the signaling pathway, and a feedback loop targeting TGF-β1 is present 18 14 31 Interestingly, we found that TGF-β1 induced the expression of Slit2 while inhibiting the expression of its main receptor, Robo1. The downregulation of Robo1 may represent a cellular self-protection mechanism, which potentially resulted from TGF-β1-induced upregulation of Slit2, subsequently amplifying both SMAD and non-SMAD signaling pathways through its autocrine effects. However, Robo1 was significantly upregulated in HTS tissues and HTSFs. Therefore, an alternative mechanism might govern Robo1 expression during HTS. Robo1 expression is elevated in human liver and cardiac fibrosis tissues and is upregulated in hepatocellular carcinoma cells and cardiac fibroblasts in response to TGF-β1 and angiotensin II, respectively 14 15 18 Exogenous rSlit1 promotes scar formation by inducing SMAD and non-SMAD signaling in an in vitro model 32 33 34 2 35 36 37 38 In addition, exogenous rSlit2 treatment induced SMAD-dependent signaling involving SMAD2, SMAD3, and SMAD1/5/8 and SMAD-independent signaling involving TAK1, MAPKs (JNK, ERK1/2, and p38), and AKT. SMAD3 is more closely associated with tissue fibrosis than SMAD2 39 9 40 42 43 44 14 15 However, findings regarding fibrosis in other organs, such as pulmonary and renal fibrosis, are contradictory 16 17 17 16 Despite the valuable insights gained, our study has several limitations. First, while we demonstrated that downregulation of Slit2 protein inhibits ECM formation in HTSFs, these cells do not function in isolation. In the HTS microenvironment, fibroblasts interact dynamically with other cell types, including endothelial cells, macrophages, and keratinocytes. Therefore, to fully elucidate the role of Slit2 in ECM deposition and HTS pathogenesis under physiologically relevant conditions, future studies employing in vivo models are essential. Second, our findings raise an intriguing and unresolved question: The mechanism by which downregulation of intracellular Slit2 expression or treatment with exogenous Slit2 protein modulates TGF-β signaling remains to be elucidated. Addressing this question will be critical not only for our research group but also for the broader scientific community investigating the role of Slit2 in fibrotic diseases. Finally, although we demonstrated that reduced Slit2 expression attenuates scar formation in a TGF-β1-stimulated fibrosis model, it is important to acknowledge that mechanical tension is widely recognized as a primary initiator of fibrotic signaling. Mechanical stress can upregulate TGF-β expression and activation, establishing a positive feedback loop that amplifies fibrosis. High tension at wound sites activates mechanotransduction pathways, such as those mediated by integrins and focal adhesion kinase (FAK), which further potentiate TGF-β-driven ECM production 45 In conclusion, this study demonstrated that both intracellular and exogenous Slit2 can regulate TGF-β1 signaling, thereby influencing HTS formation in vitro. Suppression of intracellular Slit2 expression attenuated TGF-β1 signaling and reduced ECM synthesis in HTSFs. Conversely, treatment with exogenous Slit2 protein induced scar formation by activating TGF-β1 signaling pathways in HNFs. These findings suggest that Slit2 may serve as a potential therapeutic target for the development of future treatment strategies for HTS. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1  Supplementary Material 2 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Hui Song Cui and Yoon Soo Cho contributed equally to this work. We thank Editage ( www.editage.co.kr Author contributions H.S.C.: design, investigation, and writing—original draft; Y.S.C.: writing—original draft and data analysis; S.Y.J.: conceptualization, investigation, writing—original draft, and data analysis; Y.X.Z.: investigation and writing—original draft; Y.M.R.: investigation; K.B.J. and C.H.S.: conceptualization and writing—review and editing. All authors contributed to the writing of the manuscript. All authors have read and agreed to the published version of the manuscript. Funding The Basic Science Research Program supported this study through the Hallym University Research Fund (HURF-2023-11). Data availability No datasets were generated or analysed during the current study. Declarations Competing interests The authors declare no competing interests. References 1. Zhu Z Ding J Tredget EE The molecular basis of hypertrophic scars Burn. Trauma 2016 4 2 10.1186/s41038-015-0026-4 PMC4963951 27574672 Zhu, Z., Ding, J. & Tredget, E. E. The molecular basis of hypertrophic scars. Burn. Trauma 4 10.1186/s41038-015-0026-4 PMC4963951 27574672 2. Cui HS Extracorporeal shock wave therapy alters the expression of fibrosis-related molecules in fibroblast derived from human hypertrophic scar Int. J. Mol. Sci. 2018 10.3390/ijms19010124 29301325 PMC5796073 Cui, H. S. et al. Extracorporeal shock wave therapy alters the expression of fibrosis-related molecules in fibroblast derived from human hypertrophic scar. Int. J. Mol. Sci. 29301325 10.3390/ijms19010124 PMC5796073 3. Younesi FS Miller AE Barker TH Rossi FMV Hinz B Fibroblast and myofibroblast activation in normal tissue repair and fibrosis Nat. Rev. Mol. Cell. Biol. 2024 25 617 638 10.1038/s41580-024-00716-0 38589640 Younesi, F. S., Miller, A. E., Barker, T. H., Rossi, F. M. V. & Hinz, B. Fibroblast and myofibroblast activation in normal tissue repair and fibrosis. Nat. Rev. Mol. Cell. Biol. 25 38589640 10.1038/s41580-024-00716-0 4. Schuster R Younesi F Ezzo M Hinz B The role of myofibroblasts in physiological and pathological tissue repair Cold Spring Harb. Perspect. Biol. 2023 10.1101/cshperspect.a041231 36123034 PMC9808581 Schuster, R., Younesi, F., Ezzo, M. & Hinz, B. The role of myofibroblasts in physiological and pathological tissue repair. Cold Spring Harb. Perspect. Biol. 36123034 10.1101/cshperspect.a041231 PMC9808581 5. Gauglitz GG Korting HC Pavicic T Ruzicka T Jeschke MG Hypertrophic scarring and keloids: Pathomechanisms and current and emerging treatment strategies Mol. Med. 2011 17 113 125 10.2119/molmed.2009.00153 20927486 PMC3022978 Gauglitz, G. G., Korting, H. C., Pavicic, T., Ruzicka, T. & Jeschke, M. G. Hypertrophic scarring and keloids: Pathomechanisms and current and emerging treatment strategies. Mol. Med. 17 20927486 10.2119/molmed.2009.00153 PMC3022978 6. Whitman M Smads and early developmental signaling by the TGFbeta superfamily Genes Dev. 1998 12 2445 2462 10.1101/gad.12.16.2445 9716398 Whitman, M. Smads and early developmental signaling by the TGFbeta superfamily. Genes Dev. 12 9716398 10.1101/gad.12.16.2445 7. Zhang YE Non-smad signaling pathways of the TGF-β family Cold Spring Harb. Perspect. Biol. 2017 10.1101/cshperspect.a022129 27864313 PMC5287080 Zhang, Y. E. Non-smad signaling pathways of the TGF-β family. Cold Spring Harb. Perspect. Biol. 27864313 10.1101/cshperspect.a022129 PMC5287080 8. Maddali P Ambesi A McKeown-Longo PJ Induction of pro-inflammatory genes by fibronectin DAMPs in three fibroblast cell lines: Role of TAK1 and MAP kinases PLoS ONE 2023 18 e0286390 10.1371/journal.pone.0286390 37228128 PMC10212165 Maddali, P., Ambesi, A. & McKeown-Longo, P. J. Induction of pro-inflammatory genes by fibronectin DAMPs in three fibroblast cell lines: Role of TAK1 and MAP kinases. PLoS ONE 18 37228128 10.1371/journal.pone.0286390 PMC10212165 9. Bale S Pharmacological inhibition of TAK1 prevents and induces regression of experimental organ fibrosis JCI Insight. 2023 10.1172/jci.insight.165358 37306632 PMC10443806 Bale, S. et al. Pharmacological inhibition of TAK1 prevents and induces regression of experimental organ fibrosis. JCI Insight. 37306632 10.1172/jci.insight.165358 PMC10443806 10. Benus GF Inhibition of the transforming growth factor beta (TGFbeta) pathway by interleukin-1beta is mediated through TGFbeta-activated kinase 1 phosphorylation of SMAD3 Mol. Biol. Cell. 2005 16 3501 3510 10.1091/mbc.e04-11-1033 15917296 PMC1182292 Benus, G. F. et al. Inhibition of the transforming growth factor beta (TGFbeta) pathway by interleukin-1beta is mediated through TGFbeta-activated kinase 1 phosphorylation of SMAD3. Mol. Biol. Cell. 16 15917296 10.1091/mbc.E04-11-1033 PMC1182292 11. Dowdy SC Mariani A Janknecht R HER2/Neu- and TAK1-mediated up-regulation of the transforming growth factor beta inhibitor Smad7 via the ETS protein ER81 J. Biol. Chem. 2003 278 44377 44384 10.1074/jbc.M307202200 12947087 Dowdy, S. C., Mariani, A. & Janknecht, R. HER2/Neu- and TAK1-mediated up-regulation of the transforming growth factor beta inhibitor Smad7 via the ETS protein ER81. J. Biol. Chem. 278 12947087 10.1074/jbc.M307202200 12. Kajino T Omori E Ishii S Matsumoto K Ninomiya-Tsuji J TAK1 MAPK kinase kinase mediates transforming growth factor-beta signaling by targeting SnoN oncoprotein for degradation J. Biol. Chem. 2007 282 9475 9481 10.1074/jbc.M700875200 17276978 PMC2175395 Kajino, T., Omori, E., Ishii, S., Matsumoto, K. & Ninomiya-Tsuji, J. TAK1 MAPK kinase kinase mediates transforming growth factor-beta signaling by targeting SnoN oncoprotein for degradation. J. Biol. Chem. 282 17276978 10.1074/jbc.M700875200 PMC2175395 13. Tong M Jun T Nie Y Hao J Fan D The role of the Slit/Robo signaling pathway J. Cancer 2019 10 2694 2705 10.7150/jca.31877 31258778 PMC6584916 Tong, M., Jun, T., Nie, Y., Hao, J. & Fan, D. The role of the Slit/Robo signaling pathway. J. Cancer 10 31258778 10.7150/jca.31877 PMC6584916 14. Liu Y Crosstalk between the activated Slit2-Robo1 pathway and TGF-β1 signalling promotes cardiac fibrosis ESC Heart Fail. 2021 8 447 460 10.1002/ehf2.13095 33236535 PMC7835586 Liu, Y. et al. Crosstalk between the activated Slit2-Robo1 pathway and TGF-β1 signalling promotes cardiac fibrosis. ESC Heart Fail. 8 33236535 10.1002/ehf2.13095 PMC7835586 15. Chang J Activation of Slit2-Robo1 signaling promotes liver fibrosis J. Hepatol. 2015 63 1413 1420 10.1016/j.jhep.2015.07.033 26264936 Chang, J. et al. Activation of Slit2-Robo1 signaling promotes liver fibrosis. J. Hepatol. 63 26264936 10.1016/j.jhep.2015.07.033 16. Yuen DA Recombinant n-terminal Slit2 inhibits TGF-β-induced fibroblast activation and renal fibrosis J. Am. Soc. Nephrol. 2016 27 2609 2615 10.1681/asn.2015040356 26869008 PMC5004640 Yuen, D. A. et al. Recombinant n-terminal Slit2 inhibits TGF-β-induced fibroblast activation and renal fibrosis. J. Am. Soc. Nephrol. 27 26869008 10.1681/ASN.2015040356 PMC5004640 17. Pilling D Zheng Z Vakil V Gomer RH Fibroblasts secrete Slit2 to inhibit fibrocyte differentiation and fibrosis Proc. Natl. Acad. Sci. USA 2014 111 18291 18296 10.1073/pnas.1417426112 25489114 PMC4280645 Pilling, D., Zheng, Z., Vakil, V. & Gomer, R. H. Fibroblasts secrete Slit2 to inhibit fibrocyte differentiation and fibrosis. Proc. Natl. Acad. Sci. USA 111 25489114 10.1073/pnas.1417426112 PMC4280645 18. He C Recombinant Slit2 attenuates tracheal fibroblast activation in benign central airway obstruction by inhibiting the TGF-β1/Smad3 signaling pathway Mol. Cell. Probes 2024 73 101947 10.1016/j.mcp.2023.101947 38122948 He, C. et al. Recombinant Slit2 attenuates tracheal fibroblast activation in benign central airway obstruction by inhibiting the TGF-β1/Smad3 signaling pathway. Mol. Cell. Probes 73 38122948 10.1016/j.mcp.2023.101947 19. Crowe AR Yue W Semi-quantitative determination of protein expression using immunohistochemistry staining and analysis: An integrated protocol Bio. Protoc. 2019 10.21769/BioProtoc.3465 31867411 PMC6924920 Crowe, A. R. & Yue, W. Semi-quantitative determination of protein expression using immunohistochemistry staining and analysis: An integrated protocol. Bio. Protoc. 31867411 10.21769/BioProtoc.3465 PMC6924920 20. Seo CH Cui HS Kim JB Altered K(Ca)3.1 expression following burn injury and the therapeutic potential of TRAM-34 in post-burn hypertrophic scar formation Transl. Res. 2021 236 133 146 10.1016/j.trsl.2021.04.007 33905948 Seo, C. H., Cui, H. S. & Kim, J. B. Altered K(Ca)3.1 expression following burn injury and the therapeutic potential of TRAM-34 in post-burn hypertrophic scar formation. Transl. Res. 236 33905948 10.1016/j.trsl.2021.04.007 21. Cui HS Exosomes derived from human hypertrophic scar fibroblasts induces smad and TAK1 signaling in normal dermal fibroblasts Arch. Biochem. Biophys. 2022 722 109215 10.1016/j.abb.2022.109215 35430216 Cui, H. S. et al. Exosomes derived from human hypertrophic scar fibroblasts induces smad and TAK1 signaling in normal dermal fibroblasts. Arch. Biochem. Biophys. 722 35430216 10.1016/j.abb.2022.109215 22. Cui HS Effect of hypertrophic scar fibroblast-derived exosomes on keratinocytes of normal human skin Int. J. Mol. Sci. 2023 10.3390/ijms24076132 37047109 PMC10094451 Cui, H. S. et al. Effect of hypertrophic scar fibroblast-derived exosomes on keratinocytes of normal human skin. Int. J. Mol. Sci. 37047109 10.3390/ijms24076132 PMC10094451 23. Cui HS Exosomes derived from hypertrophic scar fibroblasts suppress melanogenesis in normal human epidermal melanocytes Int. J. Mol. Sci. 2024 10.3390/ijms25137236 39000342 PMC11241421 Cui, H. S. et al. Exosomes derived from hypertrophic scar fibroblasts suppress melanogenesis in normal human epidermal melanocytes. Int. J. Mol. Sci. 39000342 10.3390/ijms25137236 PMC11241421 24. Schreier T Degen E Baschong W Fibroblast migration and proliferation during in vitro wound healing. A quantitative comparison between various growth factors and a low molecular weight blood dialysate used in the clinic to normalize impaired wound healing Res. Exp. Med. 1993 193 195 205 10.1007/bf02576227 8235072 Schreier, T., Degen, E. & Baschong, W. Fibroblast migration and proliferation during in vitro wound healing. A quantitative comparison between various growth factors and a low molecular weight blood dialysate used in the clinic to normalize impaired wound healing. Res. Exp. Med. 193 10.1007/BF02576227 8235072 25. Klingberg F Hinz B White ES The myofibroblast matrix: Implications for tissue repair and fibrosis J. Pathol. 2013 229 298 309 10.1002/path.4104 22996908 PMC4005341 Klingberg, F., Hinz, B. & White, E. S. The myofibroblast matrix: Implications for tissue repair and fibrosis. J. Pathol. 229 22996908 10.1002/path.4104 PMC4005341 26. Finnerty CC Hypertrophic scarring: The greatest unmet challenge after burn injury Lancet 2016 388 1427 1436 10.1016/s0140-6736(16)31406-4 27707499 PMC5380137 Finnerty, C. C. et al. Hypertrophic scarring: The greatest unmet challenge after burn injury. Lancet 388 27707499 10.1016/S0140-6736(16)31406-4 PMC5380137 27. Frangogiannis N Transforming growth factor-β in tissue fibrosis J. Exp. Med. 2020 217 e20190103 10.1084/jem.20190103 32997468 PMC7062524 Frangogiannis, N. Transforming growth factor-β in tissue fibrosis. J. Exp. Med. 217 32997468 10.1084/jem.20190103 PMC7062524 28. Tredget EE Transforming growth factor-beta in thermally injured patients with hypertrophic scars: Effects of interferon alpha-2b Plast. Reconstr. Surg. 1998 102 1317 1328 10.1097/00006534-199810000-00001 9773986 Tredget, E. E. et al. Transforming growth factor-beta in thermally injured patients with hypertrophic scars: Effects of interferon alpha-2b. Plast. Reconstr. Surg. 102 9773986 10.1097/00006534-199810000-00001 29. Wang R Hypertrophic scar tissues and fibroblasts produce more transforming growth factor-beta1 mRNA and protein than normal skin and cells Wound Repair Regen. 2000 8 128 137 10.1046/j.1524-475x.2000.00128.x 10810039 Wang, R. et al. Hypertrophic scar tissues and fibroblasts produce more transforming growth factor-beta1 mRNA and protein than normal skin and cells. Wound Repair Regen. 8 10810039 10.1046/j.1524-475x.2000.00128.x 30. Schmid P Itin P Cherry G Bi C Cox DA Enhanced expression of transforming growth factor-beta type I and type II receptors in wound granulation tissue and hypertrophic scar Am. J. Pathol. 1998 152 485 493 9466575 PMC1857945 Schmid, P., Itin, P., Cherry, G., Bi, C. & Cox, D. A. Enhanced expression of transforming growth factor-beta type I and type II receptors in wound granulation tissue and hypertrophic scar. Am. J. Pathol. 152 9466575 PMC1857945 31. Macias H SLIT/ROBO1 signaling suppresses mammary branching morphogenesis by limiting basal cell number Dev. Cell 2011 20 827 840 10.1016/j.devcel.2011.05.012 21664580 PMC3129866 Macias, H. et al. SLIT/ROBO1 signaling suppresses mammary branching morphogenesis by limiting basal cell number. Dev. Cell 20 21664580 10.1016/j.devcel.2011.05.012 PMC3129866 32. Cui HS Slit1 promotes hypertrophic scar formation through the TGF-β signaling pathway Medicina 2024 10.3390/medicina60122051 39768930 PMC11678377 Cui, H. S. et al. Slit1 promotes hypertrophic scar formation through the TGF-β signaling pathway. Medicina 39768930 10.3390/medicina60122051 PMC11678377 33. Wang J Human hypertrophic scar-like nude mouse model: Characterization of the molecular and cellular biology of the scar process Wound Repair Regen. 2011 19 274 285 10.1111/j.1524-475X.2011.00672.x 21362096 Wang, J. et al. Human hypertrophic scar-like nude mouse model: Characterization of the molecular and cellular biology of the scar process. Wound Repair Regen. 19 21362096 10.1111/j.1524-475X.2011.00672.x 34. van der Veer WM Time course of the angiogenic response during normotrophic and hypertrophic scar formation in humans Wound Repair Regen. 2011 19 292 301 10.1111/j.1524-475X.2011.00692.x 21539647 van der Veer, W. M. et al. Time course of the angiogenic response during normotrophic and hypertrophic scar formation in humans. Wound Repair Regen. 19 21539647 10.1111/j.1524-475X.2011.00692.x 35. Yan C Epithelial to mesenchymal transition in human skin wound healing is induced by tumor necrosis factor-alpha through bone morphogenic protein-2 Am. J. Pathol. 2010 176 2247 2258 10.2353/ajpath.2010.090048 20304956 PMC2861090 Yan, C. et al. Epithelial to mesenchymal transition in human skin wound healing is induced by tumor necrosis factor-alpha through bone morphogenic protein-2. Am. J. Pathol. 176 20304956 10.2353/ajpath.2010.090048 PMC2861090 36. Wikan N Potikanond S Nimlamool W Alpinetin suppresses effects of TGF-β1 on stimulating the production and organization of fibrotic markers in human primary dermal fibroblasts Cells 2022 10.3390/cells11172731 36078140 PMC9455016 Wikan, N., Potikanond, S. & Nimlamool, W. Alpinetin suppresses effects of TGF-β1 on stimulating the production and organization of fibrotic markers in human primary dermal fibroblasts. Cells 36078140 10.3390/cells11172731 PMC9455016 37. Ostrowska-Podhorodecka Z Ding I Norouzi M McCulloch CA Impact of vimentin on regulation of cell signaling and matrix remodeling Front. Cell Dev. Biol. 2022 10 869069 10.3389/fcell.2022.869069 35359446 PMC8961691 Ostrowska-Podhorodecka, Z., Ding, I., Norouzi, M. & McCulloch, C. A. Impact of vimentin on regulation of cell signaling and matrix remodeling. Front. Cell Dev. Biol. 10 35359446 10.3389/fcell.2022.869069 PMC8961691 38. Nguyen T Enhanced cell-cell contact stability and decreased N-cadherin-mediated migration upon fibroblast growth factor receptor-N-cadherin cross talk Oncogene 2019 38 6283 6300 10.1038/s41388-019-0875-6 31312021 Nguyen, T. et al. Enhanced cell-cell contact stability and decreased N-cadherin-mediated migration upon fibroblast growth factor receptor-N-cadherin cross talk. Oncogene 38 31312021 10.1038/s41388-019-0875-6 39. Flanders KC Smad3 as a mediator of the fibrotic response Int. J. Exp. Pathol. 2004 85 47 64 10.1111/j.0959-9673.2004.00377.x 15154911 PMC2517464 Flanders, K. C. Smad3 as a mediator of the fibrotic response. Int. J. Exp. Pathol. 85 15154911 10.1111/j.0959-9673.2004.00377.x PMC2517464 40. Hu X The role of ERK and JNK signaling in connective tissue growth factor induced extracellular matrix protein production and scar formation Arch. Dermatol. Res. 2013 305 433 445 10.1007/s00403-013-1334-9 23494140 Hu, X. et al. The role of ERK and JNK signaling in connective tissue growth factor induced extracellular matrix protein production and scar formation. Arch. Dermatol. Res. 305 23494140 10.1007/s00403-013-1334-9 41. Li Y Adipose tissue-derived stem cells suppress hypertrophic scar fibrosis via the p38/MAPK signaling pathway Stem Cell Res. Ther. 2016 7 102 10.1186/s13287-016-0356-6 27484727 PMC4970202 Li, Y. et al. Adipose tissue-derived stem cells suppress hypertrophic scar fibrosis via the p38/MAPK signaling pathway. Stem Cell Res. Ther. 7 27484727 10.1186/s13287-016-0356-6 PMC4970202 42. Shirakami E Yamakawa S Hayashida K Strategies to prevent hypertrophic scar formation: A review of therapeutic interventions based on molecular evidence Burns Trauma 2020 8 tkz003 10.1093/burnst/tkz003 32341924 PMC7175766 Shirakami, E., Yamakawa, S. & Hayashida, K. Strategies to prevent hypertrophic scar formation: A review of therapeutic interventions based on molecular evidence. Burns Trauma 8 32341924 10.1093/burnst/tkz003 PMC7175766 43. He S Mechanisms of transforming growth factor beta(1)/Smad signalling mediated by mitogen-activated protein kinase pathways in keloid fibroblasts Br. J. Dermatol. 2010 162 538 546 10.1111/j.1365-2133.2009.09511.x 19772524 He, S. et al. Mechanisms of transforming growth factor beta(1)/Smad signalling mediated by mitogen-activated protein kinase pathways in keloid fibroblasts. Br. J. Dermatol. 162 19772524 10.1111/j.1365-2133.2009.09511.x 44. He J Fang B Shan S Li Q Mechanical stiffness promotes skin fibrosis through FAPα-AKT signaling pathway J. Dermatol. Sci. 2024 113 51 61 10.1016/j.jdermsci.2023.12.004 38155020 He, J., Fang, B., Shan, S. & Li, Q. Mechanical stiffness promotes skin fibrosis through FAPα-AKT signaling pathway. J. Dermatol. Sci. 113 38155020 10.1016/j.jdermsci.2023.12.004 45. Yagmur C Akaishi S Ogawa R Guneren E Mechanical receptor–related mechanisms in scar management: A review and hypothesis Plast. Reconstr. Surg. 2010 126 426 434 10.1097/PRS.0b013e3181df715d 20375759 Yagmur, C., Akaishi, S., Ogawa, R. & Guneren, E. Mechanical receptor–related mechanisms in scar management: A review and hypothesis. Plast. Reconstr. Surg. 126 20375759 10.1097/PRS.0b013e3181df715d ",
  "metadata": {
    "Title of this paper": "Mechanical receptor–related mechanisms in scar management: A review and hypothesis",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474968/"
  }
}