{
  "title": "Paper_1198",
  "abstract": "pmc Cancers (Basel) Cancers (Basel) 2105 cancers cancers Cancers 2072-6694 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468999 PMC12468999.1 12468999 12468999 41008853 10.3390/cancers17183009 cancers-17-03009 1 Article Cytokine Profiling of Children, Adolescents, and Young Adults Newly Diagnosed with Sarcomas Demonstrates the Role of IL-1β in Osteosarcoma Metastasis https://orcid.org/0000-0002-3562-6690 Kastner Laurel Methodology Software Formal analysis Investigation Data curation Writing – original draft Writing – review & editing 1 2 Kandalaft William Methodology Software Formal analysis Investigation 1 https://orcid.org/0000-0002-0530-122X Mahant Aakash Mahant Methodology Software Formal analysis Investigation 1 Crimella Jessica Project administration 3 Hakim Sydney Investigation 4 https://orcid.org/0000-0002-7738-1150 Peng Xiao P. 1 https://orcid.org/0000-0003-4790-9919 Isakoff Michael S. Conceptualization Writing – review & editing Funding acquisition 5 https://orcid.org/0000-0002-9508-0159 Hayashi Masanori Conceptualization Resources Writing – review & editing Supervision Project administration Funding acquisition 4 https://orcid.org/0000-0002-7319-5000 Loeb David M. 1 2 6 7 8 * Moreno Carlos S. Academic Editor 1 aakash.mahant@einsteinmed.edu xpeng@montefiore.org 2 3 jessica.crimella@moffitt.org 4 sydney.hakim@cuanschutz.edu masanori.hayashi@cuanschutz.edu 5 misakoff@connecticutchildrens.org 6 7 8 * david.loeb@einsteinmed.edu 15 9 2025 9 2025 17 18 497140 3009 06 8 2025 09 9 2025 10 9 2025 15 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Cytokine Profiling of Children, Adolescents, and Young Adults Newly Diagnosed with Sarcomas Demonstrates a Role for IL-1β in Osteosarcoma Metastasis 7 4 2025 2025.04.05.25325205 medRxiv PMC12036375 40297413 Simple Summary Sarcomas are a group of relatively common pediatric tumors that arise from connective tissues. This study characterizes the poorly understood immune landscape in newly diagnosed sarcoma patients by measuring levels of immune signals called cytokines. We found elevated levels of several pro-inflammatory cytokines in the plasma of these patients. Many of these were associated with inferior event-free or overall survival in patients with osteosarcoma. A particular cytokine, IL-1β, was associated with metastatic presentation and inferior event-free survival in patients with osteosarcoma. In the context of previously published preclinical work demonstrating that blocking IL-1 signaling can inhibit osteosarcoma metastasis, our work supports the development of a clinical trial testing this concept in patients with osteosarcoma. Abstract Background: Methods: Results: Conclusions: sarcoma cytokines IL-1B luminex immunotherapy biomarkers pediatric cancer osteosarcoma Ewing sarcoma National Cancer Institute 5R01CA262802 National Pediatric Cancer Foundation 09-33693-20-09 Einstein CFAR biomarker core 5P30AI124414-05 Montefiore Einstein Comprehensive Cancer Center 2P30CA013330 This work was supported in part by a grant from the National Cancer Institute (5R01CA262802 to DML) and a grant from the National Pediatric Cancer Foundation (09-33693-20-09 to DML). We are grateful for support from the Einstein CFAR biomarker core (funded by grant 5P30AI124414-05) and the Montefiore Einstein Comprehensive Cancer Center support grant (2P30CA013330). Clinical trial MCC 20320 is supported by the National Pediatric Cancer Foundation. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Immune activity in the tumor microenvironment (TME) is widely recognized as an important contributor to oncogenic disease establishment and progression through numerous mechanisms, including modulation of tumor proliferation, immune response to tumor cells, angiogenesis, tumor cell metabolism, and dissemination of tumor cells [ 1 2 3 4 5 6 7 8 With a unique mesenchymal lineage, sarcomas are rare and less well-studied than other solid tumors in adults; however, they are more common in children, adolescents, and young adults [ 9 10 11 In this study, we characterized the cytokine profiles of children, adolescents, and young adults newly diagnosed with Ewing sarcoma, osteosarcoma, rhabdomyosarcoma, and other subtypes. The goal of this work was to test the hypothesis that the nature of the immunologic response to a tumor affects patient outcome. We simultaneously quantified plasma levels of thirteen pro-tumorigenic [ 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 8 13 19 24 25 27 28 29 30 31 32 33 34 35 36 37 38 39 40 2. Methods 2.1. Patients Research subjects were enrolled in an ongoing multi-center clinical trial, MCC20320, a study evaluating blood-based biomarkers of disease response and prognosis in children, adolescents, and young adults with sarcomas. This multi-center clinical trial was approved by Advarra, and was conducted in accordance with the Ethical Principles and Guidelines for the Protection of Human Subjects of Research. Newly diagnosed patients less than or equal to 40 years old and weighing over 8 kg were enrolled at participating centers. Cohorts were defined as follows: Cohort 1: Ewing sarcoma patients with confirmed diagnosis of Ewing sarcoma (ES) with a t (11;22) EWS-FLI1 or t (21;22) EWS-ERG translocation. Cohort 2: Fusion-positive rhabdomyosarcoma (FP-RMS) patients with confirmed diagnosis of a rhabdomyosarcoma with a t (2;13) PAX3-FOXO1 or t (1;13) PAX7-FOXO1 translocation. Cohort 3: Fusion-negative rhabdomyosarcoma (FN-RMS) with a confirmed diagnosis of a rhabdomyosarcoma without a t (2;13) PAX3-FOXO1 or t (1;13) PAX7-FOXO1 translocation. Cohort 4: Confirmed patients with osteosarcoma. Cohort 5: Other translocation-driven sarcomas not included in the other 4 cohorts. Plasma from clinical waste of presumed healthy individuals was used for healthy controls. Study accrual opened in 2019 and is ongoing, but this report focuses on subjects with Ewing sarcoma and osteosarcoma—the cohorts with sufficient subject enrollment for meaningful analysis. Only treatment-naive samples drawn at the time of diagnosis were evaluated. 2.2. Plasma Extraction Blood was collected at enrollment in a Streck Cell-free DNA BCT ® 41 2.3. Luminex Assays All samples were measured in technical duplicates and averaged for a final concentration. IL-1β, IL-4, IL-6, IL-8, IL-10, IL-12 (p40), IL-15, IL-27, and CXCL10 were measured using kit HCYTA-60K-10. CCL21, CXCL5, IL-16, IL-24, and CXCL12 were measured using kit HCYTB-60K-06. MIF, TGF-β1, and IGF-1 were measured using HSP1MAG-63K-01, TGFBMAG-64K-01, and HIGFMAG-52K-01, respectively, all obtained from Sigma Millipore (St. Louis, MO, USA). All kits were used according to the manufacturer’s instructions. Additional dilution was required to quantify IGF-1 (1:120) and TGF-β1 (1:270). Data were acquired on a Luminex Magpix XMAP Multiplex Reader (Luminex Technologies (Madison, WI, USA), RRID:SCR_023348) and were analyzed using Belysa Immunoassay Curve Fitting Software (Millipore Sigma, Burlington, MA, USA). Interpolated concentrations of all analytes were log-transformed before analysis to reduce non-normal skew and inter-assay variability. 2.4. Statistical Analysis Healthy controls and sarcoma cohorts were analyzed using Singular Value Decomposition (SVD) with imputation to calculate principal component analysis (PCA) with unit variance scaling applied using ClustVis software ( https://biit.cs.ut.ee/clustvis/ 42 Individual analyte concentrations in each cohort were compared to healthy controls using a Mann–Whitney test. Further analysis was performed on groups that had a sufficient sample size, including Ewing sarcoma, osteosarcoma, and all patients not separated by cohort, referred to as “mixed cohorts”. To explore the effect of multiple elevated or depressed cytokines in conjunction, patient outcomes to date (responsive, refractory, or relapsed disease) were distributed by the number of elevated or depressed analytes. Cytokines were considered elevated if plasma concentration was greater than the 95th percentile of the healthy cohort. Depressed levels were below the 5th percentile. Additionally, patients were grouped as 0–3 and ≥4 elevated cytokines or 0 and ≥1 depressed cytokines. Based on these groupings, event-free survival (EFS) and overall survival (OS) were analyzed with Kaplan–Meier curves with an 18-month endpoint, and hazard ratios were generated using a Log-rank (Mantel–Cox) test. EFS and OS were also determined for high and low cytokine levels, with high defined as anything at or above 75th percentile within that cohort. Further analysis was performed comparing adult (age ≥ 22) and pediatric (age ≤ 21) and localized or metastatic stage of bone sarcomas at diagnosis using the Mann–Whitney test. Since IL-1β had compelling results, we also used Fisher’s exact test to determine if there was a difference in the number of patients with metastatic or localized disease in the high or low IL-1β groups. 3. Results A total of 123 sarcoma patients and 17 healthy subjects were included in this analysis, and they are presented in Supplementary Table S1 Supplemental Table S1 Figure 1 Figure 1 Figure 1 Figure 1 p p A Spearman correlation matrix was generated for osteosarcoma and Ewing sarcoma samples, which demonstrated several significant correlations, suggesting biologically meaningful relationships ( Supplementary Figure S1 2 p 2 p 2 p 2 p 2 p 2 p 2 p 2 p We next sought to determine if having multiple elevated cytokines had an impact on disease progression. Defining “elevated” as the upper 5% of the level of each cytokine in the healthy control cohort, 44% of Ewing sarcoma and 55% of osteosarcoma patients had four or more cytokines elevated in tandem ( Figure 2 Figure 2 Figure 2 p p p p A complementary result was seen in patients with multiple depressed analytes. Defining “depressed” as the lower 5% of the cytokine level in healthy controls, we found that although only 6% of Ewing sarcoma and 2% of osteosarcoma patients had four or more cytokines depressed in total ( Figure 3 Figure 3 Figure 3 p p p p The plasma levels of individual cytokines differ in patients with sarcoma compared to healthy controls. Levels of IL-1β, IL-4, IL-6, CXCL5, CXCL12, CXCL14, MIF, IGF-1, TGFβ-1, and CCL21 were increased in one or more sarcoma cohorts compared with controls, and levels of IL-15 and IL-16 were significantly lower in one or more sarcoma cohorts compared to healthy controls ( Figure 4 Supplementary Table S2 Supplementary Figure S2 Next, we tested whether median cytokine levels in patients with Ewing sarcoma, osteosarcoma, and patients in the “mixed cohorts” subgroup correlate with clinically relevant parameters such as age, stage at diagnosis, or clinical outcome. Adult patients in the “mixed cohorts” group had statistically significantly lower levels of IL-6 (0.29 pg/mL vs. 0.64 pg/mL; p p p p p p Supplementary Table S3 In contrast to comparisons based on median cytokine levels, high-level expression (defined as the upper 25th percentile of the cohort) of several cytokines correlated with 18-month OS and EFS ( Figure 5 Supplementary Table S4 p p p p p Of the cytokines examined, IL-1β emerged as the cytokine with the most significant correspondence to the features of disease progression. As mentioned above, IL-1β expression was significantly higher in the plasma of patients with metastatic disease from the mixed cohort ( Figure 6 p p p p Figure 6 p p Figure 6 p 4. Discussion Sarcomas represent one of the most common pediatric cancers, and treatment options remain limited, especially for patients who present with metastatic disease [ 10 43 44 45 46 Just as mouse models may show Th1 or Th2 skewing, for example, human beings are also predisposed towards certain innate and adaptive immune responses. Indeed, genetic studies have shown that there has been positive selection for variants that once conferred resistance to life-threatening infections at a time when hygiene and antimicrobials were unavailable; these same alleles now predispose individuals to inflammatory and autoimmune conditions [ 47 NLRP3 MEFV 48 Using unsupervised hierarchical clustering, three endotypes were apparent among patients. These endotypes represent clusters of related immune cells, pathways, and processes, whether suppressive innate and adaptive immune responses elicited by tumors (Groups 1 and 2) or more mixed effects (Group 3). The group with the worst EFS and OS for osteosarcoma and Ewing sarcoma, Group 1, was defined by an increase in CXCL5, CXCL12, and MIF. These pro-tumorigenic chemokines are implicated in recruiting and activating myeloid-derived suppressor cells (MDSCs) and regulatory T cells (Tregs), immune cell populations that impair anti-tumor responses, as well as inducing angiogenesis and metastasis [ 16 17 49 50 31 51 It is interesting to note that statistically significant correlations between cytokine expression and outcomes, such as EFS and OS, are predominantly observed in patients with osteosarcoma. Osteosarcoma appears to be the only sarcoma in children, adolescents, and young adults with a track record (albeit a weak one) of response to ICI. For example, in SARC028, a clinical trial of pembrolizumab in advanced sarcomas, 5% of osteosarcoma patients had a partial response and 30% had stable disease, whereas none of the patients with Ewing sarcoma responded [ 52 53 54 Analysis of individual cytokine levels demonstrated robust differences in cytokine concentration in patients with sarcoma compared to healthy subjects. Furthermore, dramatic increases in expression were mostly observed in pro-tumorigenic cytokines (IL-1β, IL-4, IL-6, CXCL5, CXCL12, CXCL14 MIF, and TGF-β1), with few, if any, differences in the levels of anti-tumorigenic cytokines such as IL-12 p40, IL-24, and IL-27 when compared to healthy controls. IL-15, a potent activator of NK and T cell anti-tumor activity [ 23 55 7 39 13 27 30 31 51 56 57 58 59 Our findings relate to IL-1β are particularly translationally relevant. Plasma levels of IL-1β were higher in patients with sarcoma than in healthy controls, and patients with osteosarcoma in particular with elevated IL-1β levels at diagnosis were more likely to present with metastatic disease and had a shortened EFS. For patients with osteosarcoma, metastasis is the strongest determinant for prognosis at diagnosis; patients with localized disease have a 70% five-year survival rate, which drops to <20% for patients who present with metastasis [ 10 60 61 62 61 5. Conclusions In summary, our cytokine profiling of newly diagnosed patients with sarcoma uncovered several tantalizing findings worthy of further investigation. We found that plasma cytokine levels in patients newly diagnosed with sarcoma differ from those in healthy controls, but not from one sarcoma type to another. We also discovered three distinct endotypes within the sarcoma patient groups. Although these do not have statistically significant prognostic significance based on our current data, these data remain immature, and re-evaluation in the future may demonstrate prognostic or other significance. Interestingly, when comparing Ewing sarcoma and osteosarcoma—the populations with the largest representation in this study—we found correlations between certain cytokines and survival in patients with osteosarcoma, but not in patients with Ewing sarcoma. It is notable that osteosarcoma is at times responsive to ICI, whereas Ewing sarcoma is not. This highlights the importance of considering more than adaptive immune cells alone, and considering which processes of cell-intrinsic, innate, and/or adaptive immunity contribute to each tumor at each stage of its development. It remains to be seen whether the correlation between cytokines and response to immunotherapy is causal (i.e., osteosarcoma is responsive because it elicits a more robust response from the patient’s immune system) or merely correlative. Perhaps most importantly, our work, in the context of preclinical studies from other groups, supports the contribution of IL-1-mediated inflammation to osteosarcoma metastasis, and this finding justifies a clinical trial of IL-1 blockade to prevent metastatic recurrence in these patients. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/cancers17183009/s1 p p p p p p p p p p Author Contributions Conceptualization: M.H., M.S.I. and D.M.L.; Methodology, D.M.L., L.K., W.K. and A.M.M.; Software, L.K., W.K. and A.M.M.; Validation, X.P.P.; Formal Analysis, L.K., D.M.L., X.P.P., W.K. and A.M.M.; Investigation, S.H., L.K., W.K., A.M.M. and D.M.L.; Resources, M.H.; Data Curation, L.K.; Writing—Original Draft Preparation, L.K. and D.M.L.; Writing—Review and Editing, L.K., X.P.P., M.H., D.M.L. and M.S.I.; Visualization, X.P.P.; Supervision, M.H. and D.M.L.; Project Administration, J.C., M.H. and D.M.L.; Funding Acquisition, M.H., M.S.I. and D.M.L. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was conducted according to the guidelines of the Declaration of Helsinki, and was approved by the Advarra Institutional Review Board. Informed Consent statement Informed consent was obtained from all subjects involved in this study. Data Availability Statement Original Data is available in supplemental figures Conflicts of Interest The authors declare no conflicts of interest. References 1. Kartikasari A.E.R. Huertas C.S. Mitchell A. Plebanski M. Tumor-Induced Inflammatory Cytokines and the Emerging Diagnostic Devices for Cancer Detection and Prognosis Front. Oncol. 2021 11 692142 10.3389/fonc.2021.692142 34307156 PMC8294036 2. Yi M. Li T. Niu M. Zhang H. Wu Y. Wu K. Dai Z. Targeting cytokine and chemokine signaling pathways for cancer therapy Signal Transduct. Target. Ther. 2024 9 176 10.1038/s41392-024-01868-3 39034318 PMC11275440 3. Lamot L. Niemietz I. Brown K.L. Methods for type I interferon detection and their relevance for clinical utility and improved understanding of rheumatic diseases Clin. Exp. Rheumatol. 2019 37 1077 1083 30943143 4. Yang H. Zhao L. Zhang Y. Li F. A comprehensive analysis of immune infiltration in the tumor microenvironment of osteosarcoma Cancer Med. 2021 10 5696 5711 10.1002/cam4.4117 34258887 PMC8366103 5. Kloen P. Gebhardt M.C. Perez-Atayde A. Rosenberg A.E. Springfield D.S. Gold L.I. Mankin H.J. Expression of transforming growth factor-β (TGF-beta) isoforms in osteosarcomas: TGF-β3 is related to disease progression Cancer 1997 80 2230 2239 10.1002/(SICI)1097-0142(19971215)80:12&#x0003c;2230::AID-CNCR3&#x0003e;3.0.CO;2-Y 9404699 6. Lee M.H. Laajala E. Kreutzman A. Järvinen P. Nísen H. Mirtti T. Hollmén M. Mustjoki S. The tumor and plasma cytokine profiles of renal cell carcinoma patients Sci. Rep. 2022 12 13416 10.1038/s41598-022-17592-3 35927313 PMC9352752 7. Luo J.H. Zhang C.Y. Lu C.Y. Guo G.H. Tian Y.P. Li Y.L. Serum expression level of cytokine and chemokine correlates with progression of human ovarian cancer Eur. J. Gynaecol. Oncol. 2017 38 33 39 10.12892/ejgo3207.2017 29767861 8. Munisamy S. Radhakrishnan A.K. Ramdas P. Samuel P.J. Singh V.A. Immune Biomarkers in Blood from Sarcoma Patients: A Pilot Study Curr. Oncol. 2022 29 5585 5603 10.3390/curroncol29080441 36005179 PMC9406743 9. Helman L.J. Meltzer P. Mechanisms of sarcoma development Nat. Rev. Cancer 2003 3 685 694 10.1038/nrc1168 12951587 10. Grünewald T.G. Alonso M. Avnet S. Banito A. Burdach S. Cidre-Aranaz F. Di Pompo G. Distel M. Dorado-Garcia H. Garcia-Castro J. Sarcoma treatment in the era of molecular medicine EMBO Mol. Med. 2020 12 e11131 10.15252/emmm.201911131 33047515 PMC7645378 11. Wang M. Xia F. Wei Y. Wei X. Molecular mechanisms and clinical management of cancer bone metastasis Bone Res. 2020 8 30 10.1038/s41413-020-00105-1 32793401 PMC7391760 12. Yao M. Brummer G. Acevedo D. Cheng N. Cytokine Regulation of Metastasis and Tumorigenicity Adv. Cancer Res. 2016 132 265 367 10.1016/bs.acr.2016.05.005 27613135 13. Landuzzi L. Ruzzi F. Pellegrini E. Lollini P.-L. Scotlandi K. Manara M.C. IL-1 Family Members in Bone Sarcomas Cells 2024 13 233 10.3390/cells13030233 38334625 PMC10854900 14. Richmond J. Tuzova M. Cruikshank W. Center D. Regulation of Cellular Processes by Interleukin-16 in Homeostasis and Cancer J. Cell Physiol. 2014 229 139 147 10.1002/jcp.24441 23893766 15. Mirlekar B. Tumor promoting roles of IL-10, TGF-β, IL-4, and IL-35: Its implications in cancer immunotherapy SAGE Open Med. 2022 10 1 15 10.1177/20503121211069012 35096390 PMC8793114 16. Deng J. Jiang R. Meng E. Wu H. CXCL5: A coachman to drive cancer progression Front. Oncol. 2022 12 944494 10.3389/fonc.2022.944494 35978824 PMC9376318 17. Nobre C.C.G. De Araújo J.M.G. Fernandes T.A.A.D.M. Cobucci R.N.O. Lanza D.C.F. Andrade V.S. Fernandes J.V. Macrophage Migration Inhibitory Factor (MIF): Biological Activities and Relation with Cancer Pathol. Oncol. Res. 2017 23 235 244 10.1007/s12253-016-0138-6 27771887 18. Liang W. Yang C. Peng J. Qian Y. Wang Z. The Expression of HSPD1, SCUBE3, CXCL14 and Its Relations with the Prognosis in Osteosarcoma Cell Biochem. Biophys. 2015 73 763 768 10.1007/s12013-015-0579-7 27259322 19. Mancarella C. Morrione A. Scotlandi K. Unraveling the IGF System Interactome in Sarcomas Exploits Novel Therapeutic Options Cells 2021 10 2075 10.3390/cells10082075 34440844 PMC8392407 20. Li Y. Flores R. Yu A. Okcu M.F. Murray J. Chintagumpala M. Hicks J. Lau C.C. Man T.-K. Elevated expression of CXC chemokines in pediatric osteosarcoma patients Cancer 2011 117 207 217 10.1002/cncr.25563 20806347 PMC2997117 21. Lu J. Song G. Tang Q. Zou C. Han F. Zhao Z. Yong B. Yin J. Xu H. Xie X. IRX1 hypomethylation promotes osteosarcoma metastasis via induction of CXCL14/NF-κB signaling J. Clin. Investig. 2015 125 1839 1856 10.1172/JCI78437 25822025 PMC4463198 22. Smyth M.J. Taniguchi M. Street S.E.A. The Anti-Tumor Activity of IL-12: Mechanisms of Innate Immunity That Are Model and Dose Dependent J. Immunol. 2000 165 2665 2670 10.4049/jimmunol.165.5.2665 10946296 23. Fiore P.F. Di Matteo S. Tumino N. Mariotti F.R. Pietra G. Ottonello S. Negrini S. Bottazzi B. Moretta L. Mortier E. Interleukin-15 and cancer: Some solved and many unsolved questions J. Immunother. Cancer 2020 8 e001428 10.1136/jitc-2020-001428 33203664 PMC7674108 24. Fisher P.B. Is mda-7/IL-24 Cancer Res. 2005 65 10128 10138 10.1158/0008-5472.CAN-05-3127 16287994 25. Yoshida H. Hunter C.A. The Immunobiology of Interleukin-27 Annu. Rev. Immunol. 2015 33 417 443 10.1146/annurev-immunol-032414-112134 25861977 26. Lin Y. Sharma S. John M. CCL21 Cancer Immunotherapy Cancers 2014 6 1098 1110 10.3390/cancers6021098 24810425 PMC4074818 27. Ruka W. Rutkowski P. Kaminska J. Rysinska A. Steffen J. Alterations of routine blood tests in adult patients with soft tissue sarcomas: Relationships to cytokine serum levels and prognostic significance Ann. Oncol. 2001 12 1423 1432 10.1023/A:1012527006566 11762815 28. Cleary M.M. Bharathy N. Abraham J. Kim J.-A. Rudzinski E.R. Michalek J.E. Keller C. Interleukin-4 Receptor Inhibition Targeting Metastasis Independent of Macrophages Mol. Cancer Ther. 2021 20 906 914 10.1158/1535-7163.MCT-20-0199 33853867 PMC8934606 29. Li Z. Chen L. Qin Z. Paradoxical Roles of IL-4 in Tumor Immunity Cell Mol. Immunol. 2009 6 415 422 10.1038/cmi.2009.53 20003817 PMC4003035 30. Allende C. Higgins B. Johns J. Comparison of serum cytokine concentrations between healthy dogs and canine osteosarcoma patients at the time of diagnosis Vet. Immunol. Immunopathol. 2020 227 110084 10.1016/j.vetimm.2020.110084 32559421 31. Rutkowski P. Kamińska J. Kowalska M. Ruka W. Steffen J. Cytokine and cytokine receptor serum levels in adult bone sarcoma patients: Correlations with local tumor extent and prognosis J. Surg. Oncol. 2003 84 151 159 10.1002/jso.10305 14598359 32. Hagi T. Nakamura T. Iino T. Matsubara T. Asanuma K. Matsumine A. Sudo A. The diagnostic and prognostic value of interleukin-6 in patients with soft tissue sarcomas Sci. Rep. 2017 7 9640 10.1038/s41598-017-08781-6 28851899 PMC5575335 33. Rademacher M.J. Cruz A. Faber M. Oldham R.A.A. Wang D. Medin J.A. Schloemer N.J. Sarcoma IL-12 overexpression facilitates NK cell immunomodulation Sci. Rep. 2021 11 8321 10.1038/s41598-021-87700-2 33859303 PMC8050085 34. Lollini P.-L. Palmieri G. De Giovanni C. Landuzzi L. Nicoletti G. Rossi I. Griffoni C. Frabetti F. Scotlandi K. Benini S. Expression of interleukin 15 (IL-15) in human rhabdomyosarcoma, osteosarcoma and Ewing’s sarcoma Int. J. Cancer 1997 71 732 736 10.1002/(SICI)1097-0215(19970529)71:5&#x0003c;732::AID-IJC7&#x0003e;3.0.CO;2-S 9180138 35. Rebhun R.B. York D. Cruz S.M. Judge S.J. Razmara A.M. Farley L.E. Brady R.V. Johnson E.G. Burton J.H. Willcox J. Inhaled recombinant human IL-15 in dogs with naturally occurring pulmonary metastases from osteosarcoma or melanoma: A phase 1 study of clinical activity and correlates of response J. Immunother. Cancer 2022 10 e004493 10.1136/jitc-2022-004493 35680383 PMC9174838 36. Tang Y.-J. Wang J.-L. Xie K.-G. Lan C.-G. Association of interleukin 16 gene polymorphisms and plasma IL16 level with osteosarcoma risk Sci. Rep. 2016 6 34607 10.1038/srep34607 27703190 PMC5050415 37. Zhuo B. Wang X. Shen Y. Li J. Li S. Li Y. Wang R. Interleukin-24 inhibits the phenotype and tumorigenicity of cancer stem cell in osteosarcoma via downregulation Notch and Wnt/β-catenin signaling J. Bone Oncol. 2021 31 100403 10.1016/j.jbo.2021.100403 34804789 PMC8581362 38. Kushlinskii N.E. Timofeev Y.S. Solov’ev Y.N. Gerstein E.S. Lyubimova N.V. Bulycheva I.V. Components of the RANK/RANKL/OPG System, IL-6, IL-8, IL-16, MMP-2, and Calcitonin in the Sera of Patients with Bone Tumors Bull. Exp. Biol. Med. 2014 157 520 523 10.1007/s10517-014-2605-y 25110097 39. Li W. Chen F. Gao H. Xu Z. Zhou Y. Wang S. Lv Z. Zhang Y. Xu Z. Huo J. Cytokine concentration in peripheral blood of patients with colorectal cancer Front. Immunol. 2023 14 1175513 10.3389/fimmu.2023.1175513 37063892 PMC10098211 40. Khoshroo M. Yazdanpanah M.J. Yasrebi S. Serum IL-24 Levels in Gastric and Breast Cancers and Non-cancerous Inflammations Middle East J. Cancer 2021 12 183 189 10.30476/mejc.2020.82945.1122 41. Hayashi M. Chu D. Meyer C.F. Llosa N.J. McCarty G. Morris C.D. Levin A.S. Wolinsky J.-P. Albert C.M. Steppan D.A. Highly personalized detection of minimal Ewing sarcoma disease burden from plasma tumor DNA Cancer 2016 122 3015 3023 10.1002/cncr.30144 27351911 PMC5102400 42. Metsalu T. Vilo J. ClustVis: A web tool for visualizing clustering of multivariate data using Principal Component Analysis and heatmap Nucleic Acids Res. 2015 43 W566 W570 10.1093/nar/gkv468 25969447 PMC4489295 43. Evdokimova V. Gassmann H. Radvanyi L. Burdach S.E.G. Current State of Immunotherapy and Mechanisms of Immune Evasion in Ewing Sarcoma and Osteosarcoma Cancers 2022 15 272 10.3390/cancers15010272 36612267 PMC9818129 44. Kelesidis T. Yang O. Good’s syndrome remains a mystery after 55 years: A systematic review of the scientific evidence Clin. Immunol. 2010 135 347 363 10.1016/j.clim.2010.01.006 20149753 PMC8071094 45. Marx A. Belharazem D. Lee D.-H. Popovic Z.V. Reißfelder C. Schalke B. Schölch S. Ströbel P. Weis C.-A. Yamada Y. Molecular pathology of thymomas: Implications for diagnosis and therapy Virchows Arch. 2021 478 101 110 10.1007/s00428-021-03068-8 33674910 PMC7966134 46. Shi Y. Wang C. When the Good Syndrome Goes Bad: A Systematic Literature Review Front. Immunol. 2021 12 679556 10.3389/fimmu.2021.679556 34113351 PMC8185358 47. Kerner G. Neehus A.-L. Philippot Q. Bohlen J. Rinchai D. Kerrouche N. Puel A. Zhang S.-Y. Boisson-Dupuis S. Abel L. Genetic adaptation to pathogens and increased risk of inflammatory disorders in post-Neolithic Europe Cell Genom. 2023 3 100248 10.1016/j.xgen.2022.100248 36819665 PMC9932995 48. Schnappauf O. Chae J.J. Kastner D.L. Aksentijevich I. The Pyrin Inflammasome in Health and Disease Front. Immunol. 2019 10 1745 10.3389/fimmu.2019.01745 31456795 PMC6698799 49. Dang H. Wu W. Wang B. Cui C. Niu J. Chen J. Chen Z. Liu Y. CXCL5 Plays a Promoting Role in Osteosarcoma Cell Migration and Invasion in Autocrine- and Paracrine-Dependent Manners Oncol. Res. Featur. Preclin. Clin. Cancer Ther. 2017 25 177 186 10.3727/096504016X14732772150343 PMC7840695 28277189 50. Brylka L.J. Schinke T. Chemokines in Physiological and Pathological Bone Remodeling Front. Immunol. 2019 10 2182 10.3389/fimmu.2019.02182 31572390 PMC6753917 51. Rutkowski P. Kaminska J. Kowalska M. Ruka W. Steffen J. Cytokine serum levels in soft tissue sarcoma patients: Correlations with clinico-pathological features and prognosis Int. J. Cancer 2002 100 463 471 10.1002/ijc.10496 12115531 52. Tawbi H.A. Burgess M. Bolejack V. Van Tine B.A. Schuetze S.M. Hu J. D’Angelo S. Attia S. Riedel R.F. Priebat D.A. Pembrolizumab in advanced soft-tissue sarcoma and bone sarcoma (SARC028): A multicentre, two-cohort, single-arm, open-label, phase 2 trial Lancet Oncol. 2017 18 1493 1501 10.1016/S1470-2045(17)30624-1 28988646 PMC7939029 53. Li M. Bao Q. Zhang Z. Wang B. Liu Z. Wen J. Wan R. Shen Y. Zhang W. Exceptional response to PD-1 inhibition immunotherapy in advanced metastatic osteosarcoma with tumor site infection J. Immunother. Cancer 2022 10 e004673 10.1136/jitc-2022-004673 54. Grimes C.L. Ariyananda L.D.Z. Melnyk J.E. O’Shea E.K. The innate immune protein Nod2 binds directly to MDP, a bacterial cell wall fragment J. Am. Chem. Soc. 2012 134 13535 13537 10.1021/ja303883c 22857257 PMC3424850 55. Cai M. Huang X. Huang X. Ju D. Zhu Y.Z. Ye L. Research progress of interleukin-15 in cancer immunotherapy Front. Pharmacol. 2023 14 1184703 10.3389/fphar.2023.1184703 37251333 PMC10213988 56. Inoue Y. Inui N. Karayama M. Asada K. Fujii M. Matsuura S. Uto T. Hashimoto D. Matsui T. Ikeda M. Cytokine profiling identifies circulating IL-6 and IL-15 as prognostic stratifiers in patients with non-small cell lung cancer receiving anti-PD-1/PD-L1 blockade therapy Cancer Immunol. Immunother. 2023 72 2717 2728 10.1007/s00262-023-03453-z 37099186 PMC10991122 57. Tsukamoto T. Kumamoto Y. Miyao N. Masumori N. Takahashi A. Yanase M. Interleukin-6 in Renal Cell Carcinoma J. Urol. 1992 148 1778 1781 10.1016/S0022-5347(17)37026-X 1433606 58. Martín F. Santolaria F. Batista N. Milena A. González-Reimers E. Brito M.J. Oramas J. CYTOKINE LEVELS (IL-6 AND IFN-γ), ACUTE PHASE RESPONSE AND NUTRITIONAL STATUS AS PROGNOSTIC FACTORS IN LUNG CANCER Cytokine 1999 11 80 86 10.1006/cyto.1998.0398 10080883 59. Tartour E. Dorval T. Mosseri V. Deneux L. Mathiot C. Brailly H. Montero F. Joyeux I. Pouillart P. Fridman W. Serum interleukin 6 and C-reactive protein levels correlate with resistance to IL-2 therapy and poor survival in melanoma patients Br. J. Cancer 1994 69 911 913 10.1038/bjc.1994.175 8180022 PMC1968905 60. Han Z.-P. Liu D.-B. Wu L.-Q. Li Q. Wang Z.-G. Zang X.-F. IL-1β secreted by macrophage M2 promotes metastasis of osteosarcoma via NF-κB/miR-181α-5p/RASSF1A/Wnt pathway Transl. Cancer Res. 2020 9 2721 2733 10.21037/tcr.2020.02.52 35117631 PMC8798966 61. Reinecke J.B. Saraf A. Hinckley J. Gross A.C. Pommellette H.L. Garcia L.J. Cam M. Cannon M.V. Vatelle S. Gryder B.E. Metastasis-initiating osteosarcoma subpopulations establish paracrine interactions with both lung and tumor cells to create a metastatic niche Cancer Res. 2025 10.1158/0008-5472.CAN-24-3360 40882022 62. Eislmayr K. Bestehorn A. Morelli L. Borroni M. Walle L.V. Lamkanfi M. Kovarik P. Nonredundancy of IL-1α and IL-1β is defined by distinct regulation of tissues orchestrating resistance versus tolerance to infection Sci. Adv. 2022 8 eabj7293 10.1126/sciadv.abj7293 35235356 PMC8890706 Figure 1 Unsupervised clustering of sarcomas compared to healthy controls. ( A B C p Figure 2 Comparison of outcomes based on total number of elevated analytes, defined by top 5% of healthy cohort mean. ( A B C Figure 3 Comparison of outcome based on total number of depressed analytes, defined by bottom 5% of the healthy cohort’s mean. ( A B C Figure 4 Levels of pro-tumorigenic and anti-tumorigenic cytokines in sarcoma patients compared to healthy controls. ( A B C p p p p Figure 5 Cytokines that affected event-free survival (EFS) and overall survival (OS) of osteosarcoma and Ewing sarcoma. Significance determined by log rank test. Figure 6 IL-1B is associated with worse outcomes in sarcomas. ( A B C p ",
  "metadata": {
    "Title of this paper": "Nonredundancy of IL-1α and IL-1β is defined by distinct regulation of tissues orchestrating resistance versus tolerance to infection",
    "Journal it was published in:": "Cancers",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468999/"
  }
}