{
  "title": "Paper_876",
  "abstract": "pmc NPJ Sci Food NPJ Sci Food 3680 npjscifood NPJ Science of Food 2396-8370 Nature Publishing Group PMC12475101 PMC12475101.1 12475101 12475101 41006283 10.1038/s41538-025-00549-x 549 1 Review Potential health benefits of insect bioactive metabolites and consumer attitudes towards edible insects http://orcid.org/0000-0003-4789-4040 Ishara Jackson jack.ishara@outlook.com 1 2 3 http://orcid.org/0009-0005-2254-9584 Ekaette Idaresit 4 5 http://orcid.org/0000-0002-8492-7166 Matendo Rehema 1 2 6 http://orcid.org/0000-0001-9172-7595 Vandenberg Grant 7 8 http://orcid.org/0000-0003-1061-4041 Niassy Saliou 9 10 http://orcid.org/0000-0003-1146-8808 Katcho Karume 11 12 http://orcid.org/0000-0001-5006-5599 Kinyuru John 2 13 1 https://ror.org/0306pcd50 grid.442835.c 0000 0004 6019 1275 Department of Food Science and Technology, Université Evangélique en Afrique, 2 https://ror.org/015h5sy57 grid.411943.a 0000 0000 9146 7108 Department of Food Science and Technology, Jomo Kenyatta University of Agriculture and Technology, 3 4 https://ror.org/01pxwe438 grid.14709.3b 0000 0004 1936 8649 Department of Food Science and Agricultural Chemistry, McGill University, 5 https://ror.org/01pxwe438 grid.14709.3b 0000 0004 1936 8649 Department of Bioresource Engineering, McGill University, 6 https://ror.org/02pad2v09 grid.442836.f 0000 0004 7477 7760 Department of Environmental and Agronomic Sciences, Université Officielle de Bukavu, 7 8 https://ror.org/04sjchr03 grid.23856.3a 0000 0004 1936 8390 Département des sciences animales, Faculté des sciences de l’agriculture et de l’alimentation, Université Laval, 9 10 https://ror.org/00g0p6g84 grid.49697.35 0000 0001 2107 2298 Department of Zoology and Entomology, Faculty of Natural and Agricultural Sciences University of Pretoria, Hatfield, 11 https://ror.org/0306pcd50 grid.442835.c 0000 0004 6019 1275 Faculty of Agriculture and Environmental Sciences, Université Evangélique en Afrique, 12 13 https://ror.org/03w2dn060 grid.463067.0 African Institute for Capacity Development (AICAD), 26 9 2025 2025 9 478326 195 11 11 2024 10 8 2025 26 09 2025 28 09 2025 28 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Particular attention has been paid to the nutritional potential of edible insects as well as the health benefits associated with their bioactive compounds. This paper focused on an in-depth review compiling the most recent information on health benefits of insect bioactive metabolites as well as their purification and identification, in addition to consumer attitudes towards edible insects. It was found that, insect bioactive metabolites, including marcocarpal, grandinol, trolline, pancratistatin, narciclasin, ungeremin, cantharidin, cordycepin, roseoflavin, lecithin, reblastatin, chitin, chitosan and desmosterol deemed to have biological activities, such as tumor suppression, anticancer, antihypertensive, anti-inflammatory, antioxidant, immunomodulator, neuroprotective, glycemic and lipid regulation, blood pressure reduction, regulation of intestinal bacterial flora and cardiovascular protection among others. Furthermore, proper sample preparation and extraction is the first step in the purification of bioactive metabolites from edible insects. After concentration, bioactive metabolites are purified using chromatographic and separation techniques including High-Performance Liquid Chromatography (HPLC), Gas Chromatography (GC), Thin-Layer Chromatography (TLC), Size-Exclusion Chromatography (SEC). Finally, their nutritional potential, health benefits, environmentally friendly, great taste, traditions, taboo, safety concerns, unpleasant past experiences, allergies, and unnaturalness are among the main factors influencing attitudes towards insect consumption. Subject terms Biochemistry Biotechnology pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction With a rapidly growing world population 1 2 3 4 5 6 7 8 9 10 11 12 13 14 In many parts of the world, entomotherapy is used as medicine and is an important alternative to modern therapy through their bioactive metabolites including pancratistatin, narciclasin, ungeremin, cantharidin, cordycepin, roseoflavin, lecithin, reblastatin, chitin, and chitosan 15 16 14 17 Given their diverse functions, high bioavailability and efficacy even at low concentrations, bioactive compounds attract a great deal of attention, although some bioactive compounds are naturally present in isolation, many are hidden within the intact structure 18 19 20 8 21 Considering the attention paid to insects as food and feed, this review compiled the most recent information focusing on health benefits of insect bioactive metabolites as well as their purification and identification, and finally a particular attention was paid to sensory attributes and consumer attitudes towards edible insects. Potential health benefits of insect bioactive metabolites Insects are characterized by several bioactive metabolites, including marcocarpal, grandinol, trolline, pancratistatin, narciclasine, ungeremine, cantharidin, cordycepin, roseoflavin, lecithin, reblastatin, chitin, chitosan and desmosterol (Fig. 1 1 2 1 Fig. 1 Health benefits of insect bioactive metabolites and their potential mechanisms. Fig. 2 Chemical structures of selected bioactive metabolites found in edible insects. Table 1 Potential health benefits of bioactive metabolites found in edible insects Scientific name Metabolite Biological activity and study description Reference Blattodea Macrotermes natalensis Actinomycin D Antibacterial, antitumor (In vitro). Assessment using two different bioassays. Benndorf et al. 22 Rubterolone A–F Farnesyl-protein transferase inhibitor (In vitro). Assessment using two different bioassays. Benndorf et al. 22 Barceloneic acid A Benndorf et al. 22 Periplaneta americana Periplatins A–D Antiproliferative (In vitro). Significant cytotoxic activities in HepG2 and MCF-7 cells with IC 50 Luo et al. 23 Polyphaga plancyi Eupolyphagin Antiproliferative. Two series of novel 2-substituted-4-amino-6-halogenquinolines 8a-l and 13a-H were designed, synthesized and evaluated for their antiproliferative activity against H-460, HT-29, HepG2 and SGC-7901 cancer cell lines in vitro. IC 50 Jiang et al. 112 Polyphaga plancyi Plancyamides A; and B, plancypyrazine A; plancyols A and B Antiproliferative activity evaluated toward extracellular matrix in animal model (rat renal proximal tubular cells), human cancer cells (K562, A549, and Huh7), EV71, ROCK2, JAK3, DDR1, and coagulation. Zhu et al. 113 Odontotermes formosanus 5-Hydroxyramulosin and biatriosporin M Antifungal and antibacterial. The phylogenetic diversity of fungi isolated from O. formosanus E. coli B. subtilis S. aureus C. albicans B. subtilis S. aureus Xu et al. 64 1-(2,5-Dihydroxyphenyl)-3-hydroxybutan- 1-one Xu et al. 64 Roseoflavin Xu et al. 64 Roseoflavin Zhou et al. 65 8-methylamino-8-demethyl-d-riboflavin Zhou et al. 65 Periplaneta americana Isocoumarins periplatins A–D Cytotoxic activities against human liver (HepG2) and breast cancer (MCF-7) cells with IC 50 Luo et al. 23 Polyphaga plancyi Plancyamide A; Plancypyrazine A; Plancypyrazine B; Plancyol A Antiproliferative activity evaluated toward extracellular matrix in rat renal proximal tubular cells, human cancer cells (K562, A549, and Huh7), EV71, ROCK2, JAK3, DDR1, and coagulation. Zhu et al. 113 Macrotermes natalensis Natalamycin A Bioassay-guided fractionation based on antifungal activity led to the isolation of natalamycin A, Geldanamycin and Reblastatin (In vitro). Kim et al. 114 Geldanamycin Reblastatin Termisoflavones A–C Improved cisplatin-induced kidney cell damage to 80% of the control value at a cisplatin dose of 25 μM (In vitro). Kang et al. 115 Isoflavanoids Dentigerumycins B–D Cisplatin-induced cytotoxity. The structures of the complex nonribosomal peptide synthetase-polyketide synthase (NRPS/PKS) hybrid bioactive compounds were determined by 1D- and 2D-NMR spectroscopy, high-resolution mass spectrometry, and circular dichroism (CD) spectroscopy. Wyche et al. 116 Macrotermycin A–C Bioassay-guided metabolomic analyses. Macrotermycins A and C had antibacterial activity against human-pathogenic S. aureus Beemelmanns et al. 31 Banegasine, Cyclo-NMe-L-3,5-dichlorotyrosine-Dhb Antifungal (In vitro). Antifungal activity assessed using two different bioassays. Benndorf et al. 22 Rubrominin A–B Microtermolide A–B Farnesyl-protein transferase inhibitor. Microtermolides A and B were isolated from a Streptomyces sp Carr et al. 117 Drimenol-type sesquiterpenes Antibacterial (In vitro). Formation of two structurally related monocyclic sesquiterpenes (nectrianolines) was catalyzed by heterologously expressed enzymes potentially involved in terpene biosynthesis. Kreuzenbeck et al. 63 Natalenamides A–C Inhibitory effects on 3-isobutyl-1-methylxanthine (IBMX)-induced melanin production (In vitro). Lee et al. 32 Macrotermes spp Efomycin K, Efomycin L, Efomycin M, Efomycin G and Elaiophylin Antifungal. Phylogenetic analysis of gene cluster domains was used to provide a biosynthetic rational for these new derivatives. Klassen et al. 72 Efomycin M Inhibited selectin-mediated leukocyte rolling In vivo inflammatory skin models using transplanted human skin biopsies. von Bonin et al. 118 Roseoflavin, 8-methylamino-8-demethyl-; D-riboflavin; Natalamycin; Termisoflavones A-C Antibacterial and antifungal (In vitro). Zhou et al. 65 Coleoptera  Blaps japanensis Blapsols A–D Structures determined by means of spectroscopic and X-ray crystallographic methods. Chiral HPLC was used to separate (-)- and (+)-enantiomers of compounds 1-4, which were isolated from Blaps japanensis 50 Seabrooks & Hu 17 Yan et al. 42  Catharsius molossus Molossusamides A–C Antibacterial and anti-inflammatory (In vitro). Cytotoxicity, MDCK cell based anti-influenza, EV71 inhibition and cyclooxygenase inhibitory assays were used to evaluate the biological activities of all the compounds. Lu et al. 67  Cantharis vesicatoria Cantharidin and norcantharidin Caprine luteal cell steroidogenesis inhibitor. Steroidogenic effects of cantharidin and norcantharidin (0.1, 1.0, and 10 μg ml -1 Twu et al. 119  Copris tripartitus Tripartin Histone H3 lysine 9 demethylase KDM4 inhibitor (In vitro). Kim et al. 120 Coprisamides A–B Quinone reductase inducer (In vitro). Kim et al. 121 122 Coprisidin A Na + /K+ ATPase inhibitor (In vitro). Coprisidin B NAD(P)H:quinone oxidoreductase 1 inducer (In vitro). Tripartilactam Its structure was elucidated by the combination of NMR, MS, UV, and IR spectroscopy and multistep chemical derivatization. Tripartilactam was evaluated as a Na + /K+ ATPase inhibitor (IC 50 Park et al. 123 Dendroctonus frontalis Mycangimycin, Frontalamide A, and Frontalamide B Antimalarial (In vitro). Genome analyses and genetic manipulation of the producing organism led to the identification of the frontalamide biosynthetic gene cluster and several biosynthetic intermediates. Blodgett et al. 124 Holotrichia diomphalia Tricin, palmitinic acid; eicosane Antifungal (In vitro). Chemical compositions of the fatty oils were obtained by two different methods and determined by GC/MS. Dong et al. 73 Hycleus lunata Cantharidin Antitumor in mice model. Cantharidin treatment induced abnormal mitochondrial characteristics, with a decrease in mitochondrial glutathione, succinate dehydrogenase activity, mitochondrial membrane potential, and induced apoptosis and necrosis in DL cells. Prasad & Verma 125 Cantharidin and norcantharidin SoNar, a highly responsive NAD + /NADH sensor, allows high-throughput Metabolic screening of anti-tumor agents in vitro and in vivo. Zhao et al. 126 Palasonin and Palasoninimide Whole specimens of Hycleus lunata Hycleus Dettner et al. 127 Cantharidin Antiproliferative; immunomodulatory Lang & Lang 128 Mylabris phalerata Cantharidin and norcantharidin Caprine luteal cell steroidogenesis inhibitor. Steroidogenic effects of cantharidin and norcantharidin (0.1, 1.0, and 10 μg ml -1 Twu et al. 119 Onthophagus lenzii Lenzimycins A–B Selective isolation of bacterial strains associated with the dung beetle, O. lenzii Bacillus sp E. faecium E. faecalis An et al. 68 Tenebrio molitor Defatted larvae Diet enriched with defatted larvae of the mealworm Tenebrio molitor Pessina et al. 30 Peptides CSR, APVAH, PAALST, AAGAPP AR and APYF Fractionation and identification of dipeptidyl peptidase IV (DPP-IV) and α-glucosidase inhibitory peptides was carried out. Peptides from 500 to 1600 Da showed the highest level of DPP-IV inhibition with IC 50 −1 50 −1 Rivero-Pino et al. 129 Tenebrio molitor Peptides NYVADGLG, AAAPVAVAK, YDDGSYKPH Antioxidant and anti-inflammatory activities of peptide fractions from hydrolysates obtained by in vitro gastrointestinal digestion. Peptide fraction from the T. molitor 50 −1 Zielinska et al. 130 131 Diptera Hermetia illucens Pyrone derivatives Compounds from C. multifidum H. illucens C. multifidum S. aureus 50 Correa et al. 69 Diketopiperazine Photoinduced, melanins and ommochromes Antibacterial, antifungal, antioxidant, and anti-inflammatory. Isolated pigments were analyzed by HPLC and represented a mixture of several ommochromes of the ommatin series. Dontsov et al. 44 34 Defensins-DLP2 and DLP4 Peptides-DLP2 and DLP4 showed potent antimicrobial activity against Gram-positive bacteria. The survival of mice challenged with MRSA were 80-100% at the doses of 3-7.5 mg/kg DLP2 or DLP4. The bacterial translocation burden over 95% in spleen and kidneys and serum pro-inflammatory cytokines levels were reduced by DLP2 and DLP4, and promoted anti-inflammatory cytokines levels; as well as improved lung and spleen injury. Li et al. 47 Bioactive peptides Antioxidant activity. Proteomics-based analysis was used to characterize and quantify functional proteins and bioactive peptides produced from the enzymatic digestion of H. illucens Lu et al. 43 Musca domestica Protein-enriched fraction (PEF) Antiviral, immunomodulatory, and free radical scavenging activities of PEF isolated from the larvae of the housefly was assessed. Infection of avian influenza virus H9N2 and had a virucidal effect against the multicapsid nucleopolyhedrovirus of the alfalfa looper, A. californica Ai et al. 48 Hemiptera Aspongopus chinensis (±)-Aspongamide A Inhibition of Smad3 phosphorylation in transforming growth factor-β1 (TGF-β1) induced rat renal proximal tubular cells and suppressed extracellular matrix expression in mesangial cells under diabetic conditions. Yan et al. 132 133 Aspongopusamides A–D Anti-inflammatory and therapeutic agents against renal protection in high-glucose-induced mesangial cells and COX-2 inhibition. Shi et al. 133 Kerria lacca Shellolic acid A Isolated from Shellac. HR-ESI-MS, UV, IR, 1D and 2D NMR methods were used to elucidate the structures. The Mosher’s method, circular dichroism (CD) and optical rotation analyses were used for absolute configurations. Cytotoxic and anti-bacterial activities of the isolates were evaluated. Inhibitory activity against B. subtilis Lu et al. 53 Hymenoptera Apis mellifera Lupeol, lupenone; Lupeol acetate This paper proposed a new accelerated solvent extraction method to obtain low-polarity actives with a high cytotoxic profile from red propolis. To identify the chemical compounds, the extracts were analyzed by gas chromatography-mass spectrometry. To profile the cytotoxicity of the bioactives obtained, the 3-(4,5-dimethyl-2-thiazole)-2,5-diphenyl-2-H-tetrazolium bromide colorimetric assay was performed on different tumor cell lines (HCT116 and PC3). The extract obtained at 70 °C and a 10-minute extraction cycle showed the highest cytotoxic activity against the cell lines tested. de Carvalho et al. 134 Apis mellifera Polypeptide components (BPP-21 and BPP-22) Immunomodulatory activity in vivo and in vitro. Protein hydrolysis using alkaline protease yielded novel bee chrysalis polypeptides (BPP). A diethylaminoethylsepharose fast-flow column and a Sephadex G-25 column were used to isolate and purify two purified polypeptide components (BPP-21 and BPP-22). Identification was made using HPLC size exclusion and amino acid composition analyses. BPP-22 significantly increased the delayed-type hypersensitivity reaction, cytokine levels (interleukin (IL)-2 and interferon (IFN)-γ), immunoglobulin (Ig) levels (IgA, IgG and IgM) and common blood indices in immunosuppressed mice treated with cyclophosphamide. BPP-22 potentially promoted cytokine secretion (IL-2, tumor necrosis factor-α and IFN-γ) and nitric oxide production by increasing homologous mRNA expression, and could exert immunomodulatory activity by increasing phosphorylation of ERK and p38, and modulating expression of intranuclear transcription factors (EIK-1, MEF-2 and CREB) in the MAPK signaling pathway. Chen et al. 50 Polyrhachis dives (±)-Polyrhadopamine A, ( ± )-Polyrhadopamine B, ( ± )-Polyrhadopamine C, trolline, ( ± )-Polyrhadopamine C; β-carboline-3-carboxamide 5-(3-indolylmethyl)- nicotinsaureamide Thirteen non-peptidic nitrogen compounds were isolated from Polyrhachis dives Tang et al. 35 132 Polybia paulista Polybioside From the venom of the social wasp P. paulista Saidemberg et al. 51 Tetraponera rufonigra Tetraponerins A general stereocontrolled methodology was applied to access all natural tetraponerins from (+)-T1 to (+)-T8. Their anticancer activity against four different human cell lines, notably the MCF-7 breast carcinoma cell line, was observed through the cytotoxic activity of (+)-T7. Bosque et al. 52 Solenopsis invicta Solenopsin A The SVR angiogenesis assay was used to isolate solenopsine, an alkaloid component of the fire ant ( Solenopsis invicta Arbiser et al. 135 Lepidoptera Bombyx mori Hexapeptide Ultramicroprocessed silkworm chrysalis protein alkalase hydrolysate was used to purify a novel immunomodulatory hexapeptide using sephadex gel filtration chromatography and reverse-phase high-performance liquid chromatography. The purified peptide had a molecular mass of 656.17 Da and an amino acid sequence of Pro-Asn-Pro-Asn-Thr-Asn (PNPNTN). Splenocyte proliferation was 87.35% in the presence of 100 μg/ml of purified peptide. Li et al. 49 Bombyx mori Peptides SQSPA, QPGR, NSPR, QPPT, KHV and GNPWM. α-glucosidase in silico SGID, simulated gastrointestinal digestion (pepsin, trypsin, pancreatin, depending on the authors). Zhang et al. 136 Bombyx mori Alkaloids and flavonoids The anti-diabetic effects of the α-glucosidase inhibitor 1-deoxynojirimycin (DNJ) isolated from B. mori Kong et al. 137 138 Byasa polyeuctes Papilistatin A novel inhibitor of cancer cell growth, papilistatin was isolated by bioassay-guided separation of an extract from the wings of a Taiwanese butterfly, Byasa polyeuctes termessa 50 Pettit et al. 71 Orthoptera Brachystola magna Pancratistatin; Narciclasine; Ungeremine Anticancer and antiproliferative in vitro. Seabrooks & Hu 17 Pettit et al. 139 Gryllodes sigillatus Peptides IIAPPER, KVEGDLK, LAPSTIK, VAPEEHPV, YKPRP, PHGAP and VGPPQ α-Amylase, a-glucosidase, DPP-IV, ACE inhibition, lipase inhibition and anti-inflammatory. Hall et al. 140 130 131 Schistocerca gregaria Desmosterol, (3β, 5α) cholesta-8, 14, 24-trien-3-ol, 4, 4-dimethyl, (3β, 20 R) cholesta-5, 24-dien-3, 20-diol Antimicrobial Cheseto et al. 55 α-Glucosidase (AIGVGAIER, GKDAVIV, FDPFPK and YETGNGIK) ACE and lipase inhibition, antioxidant and anti-inflammatory. Zielinska et al. 130 131 Anti-cancer and tumor suppressive effects have been observed for bioactive metabolites such as actinomycin-D, isocoumarins periplatins A-D, (R)-(+)-palasonin, palasonimide, cantharimide, palasonin, cantharidin, norcantharidin, pederin, pancratistatin, narciclasin and ungeremin found in insect species including Macrotermes natalensis 22 Periplaneta americana 23 Hycleus oculatus 24 Hycleus lunata 25 Paederus sp 26 Brachystola magna 17 Hypertension is one of the main risk factors for cardiovascular disease, affecting millions of people every year. Angiotensin-converting enzyme (ACE) plays a key role in the regulation of blood pressure, and its efficacy in the treatment of hypertension has been proven 27 Bombyx mori Tenebrio molitor Spodoptera littoralis Oecophylla smaragdina 27 28 29 Pessina and collaborators 30 Tenebrio molitor Macrotermes natalensis 31 32 Blaps japanensis 17 33 Hermetia illucens 34 Polyrhachis dives 35 Chitin is the second most abundant biopolymer found in the exoskeletons of arthropods including insects 36 37 38 Glycosaminoglycan, a polysaccharide found in Gryllus bimaculatus 39 39 40 41 Gryllus bimaculatus The A-D blapsols contained in Blaps japanensis 42 43 44 Dactylopius coccus 17 45 46 37 Cantharidin 17 47 Hycleus lunata Musca domestica 48 Bombyx mori 49 Apis mellifera 50 Pessina and collaborators 30 Tenebrio molitor Paederus sp 26 51 52 Polybia paulista Tetraponera rufonigra Anti-microbial effects have been observed in several insect bioactive metabolites, such as Shellolic acid A found in Kerria lacca 53 Amauronematus amplus Arge sp Dineura pullior Nematus brevivalvis Nematus pravus Nematus viridescens Nematus viridis Perga affinis Pristiphora alpestris Trichiosoma scalesii 54 Schistocerca gregaria 55 The antimicrobial effect of Tenebrio molitor Zophobas morio E. coli Salmonella 56 57 58 59 60 61 62 Antibacterial activity was observed for actinomycin-D, macrotermycin A-D and pseudoxyallemycin-B present in Macrotermes natalensis 22 31 63 Odontotermes formosanus 64 65 Macrotermes spp 65 66 Catharsius molossus 67 Onthophagus lenzii 68 Hermetia illucens 69 70 Byasa polyeuctes 71 Bioactive metabolites found in insects such as 5-Hydroxyramulosin and biatriosporin-M found in Odontotermes formosanus 64 Macrotermes natalensis 22 Macrotermes spp 65 72 Holotrichia diomphalia 73 Insect-based feeding is associated with the production of short-chain fatty acids (SCFAs), in terms of increasing the abundance and diversity of beneficial bacteria in the gut. One study showed that chitin is broken down into propionate and butyrate SCFAs by the gut microbiota 58 58 74 H. illucens 75 There are a variety of hypoglycemic bioactive metabolites in insects and their products, including proteins, peptides, polysaccharides, unsaturated fatty acids, alkaloids, and flavonoids 76 53 77 78 79 80 Studies on trace elements show that magnesium, zinc, calcium, iron, copper, chromium, nickel, selenium among others are linked to human blood sugar metabolism with hypoglycemic effects 81 Clanis bilineata tsingtauica Tenebrio molitor Zophobas atratus 82 Tenebrio molitor 78 83 Moreover, Teixeira et al. 84 Gryllodes sigillatu Gryllus assimilis Schistocerca gregaria, Alphitobius diaperinus, Tenebrio molitor,Polyphylla adspersa, Apis mellifera, Oecophylla smaragdina, Bombyx mori, Spodoptera littoralis, Hermetia illucens Musca domestica Purification and identification of bioactive metabolites found in edible insects The purification of bioactive metabolites from edible insects Several key techniques and methodologies are being used to isolate, identify and purify bioactive metabolites present in the tissues of edible insects. These bioactive metabolites are of growing interest due to their potential health benefits, including antimicrobial, antioxidant, anti-inflammatory and anticancer properties. The general process for purifying bioactive metabolites from edible insects is described below. Sample preparation and extraction Proper sample preparation and extraction is the first step in the purification of bioactive metabolites from edible insects. The insect species selected can vary according to the bioactive compounds sought 85 86 87 88 89 Purification Techniques Once extraction is complete, techniques such as rotary evaporation are used to remove the solvent and concentrate the solution. In addition, insoluble solids are removed by filtration, leaving a clear extract ready for further purification. After concentration, bioactive metabolites are purified using chromatographic and separation techniques including High-Performance Liquid Chromatography (HPLC), one of the most common methods for separating and purifying bioactive metabolites from insect extracts 90 91 92 93 Characterization of purified bioactive metabolites in edible insects After purification, isolated metabolites are characterized to confirm their identity as well as their bioactivity using several techniques including mass spectrometry (MS): a powerful tool for identifying the molecular weight and structure of bioactive metabolites 94 95 Identification of bioactive metabolites in edible insects The identification of bioactive metabolites in edible insects has garnered much attention due their potential health benefits, such as antimicrobial, antioxidant, anti-inflammatory and even anticancer properties, due to their wealth of bioactive compounds, including peptides, lipids, polyphenols, vitamins, minerals and chitin derivatives 96 97 Moreover, edible insects are caracerized by a variety of lipids, including essential fatty acids important for human health. Insects such as crickets, mealworms and grasshoppers contain polyunsaturated fatty acids (PUFAs), notably omega-3 and omega-6 fatty acids 98 61 Additionally, edible insects contain essential vitamins and minerals that support various bodily functions including metabolism, immune function, wound healing, bone health, red blood cell production, and maintaining a healthy nervous system 8 99 98 Consumer attitudes toward edible insects Consumer attitudes toward edible insects have been a subject of interest and debate in recent years 19 14 21 One of the primary factors influencing consumer attitudes toward edible insects is cultural and societal norms 100 101 102 103 Many people are concerned about the safety of consuming insects, particularly regarding potential allergenic reactions or contamination 104 105 9 Traditional livestock production, such as cattle farming, is resource-intensive and contributes to greenhouse gas emissions and deforestation. In contrast, insects require minimal resources, emit fewer greenhouse gases, and can be reared on organic waste, making them an environmentally friendly alternative 106 5 107 108 The way edible insects are marketed and presented to consumers can significantly impact their perception and willingness to try them 109 110 111 Furthermore, taste preferences are often developed through exposure and personal experiences. Offering opportunities for consumers to sample and taste insect-based products in a non-threatening and controlled environment can help overcome the initial resistance and foster positive experiences 110 It can be concluded that some of the main positive factors influencing attitudes towards insects include nutritional potential, health benefits, environmentally friendly, great taste, and traditions; on the other hand, the main factors underlining negative attitudes towards insects are, among others, taboo, safety concerns, unpleasant past experiences, allergies and unnaturalness as summarized in Fig. 3 Fig. 3 Attitudes towards edible insects as food. Conclusion and future perspectives It can be generally concluded that insect bioactive metabolites, including marcocarpal, grandinol, trolline, pancratistatin, narciclasin, ungeremin, cantharidin, cordycepin, roseoflavin, lecithin, reblastatin, chitin, chitosan and desmosterol play a crucial role in conferring several beneficial biological activities, such as tumor suppression, anticancer, antihypertensive, anti-inflammatory, antioxidant, immunomodulator, neuroprotective, glycemic and lipid regulation, blood pressure reduction, regulation of intestinal bacterial flora and cardiovascular protection among others. However, proper sample preparation and extraction is the first step in the purification of bioactive metabolites from edible insects. After concentration, bioactive metabolites are purified using chromatographic and separation techniques including High-Performance Liquid Chromatography (HPLC), Gas Chromatography (GC), Thin-Layer Chromatography (TLC), Size-Exclusion Chromatography (SEC). It is noteworthy that nutritional potential, health benefits, environmentally friendly, great taste, traditions, taboo, safety concerns, unpleasant past experiences, allergies, and unnaturalness are among the main factors influencing attitudes towards insects. Given the immense insect biodiversity, more in-depth investigations should focus on undiscovered bioactive metabolites, for more information on their potential as a sustainable therapeutic source. Particular attention should be paid to increasingly describing the therapeutic benefits and modes of action of insect bioactive metabolites. Additionally, as many human experiments as possible to explore the biological activities of these bioactive metabolites should also be carried out. Studies focusing on cross-reactivity of edible insects, as well as novelty, smart marketing, and good education can further influence attitudes towards insect consumption. Publisher’s note Acknowledgements We would like to thank JKUAT, UEA and the RUFORUM for their support. Author contributions J.I., S.N., K.K. and J.K. contributed to the research design, wrote and revised the manuscript; J.I. processed data, conceptualization and formal analysis; J.I., S.N., K.K. and J.N. data curation and investigation; J.I. drafted the manuscript; all authors reviewed the manuscript. All authors contributed to this work and approved the final text of the manuscript. Data Availability The datasets generated or analyzed in the current study are available from the corresponding author upon reasonable request. Competing interests The authors declare no competing interests. References 1. Desa UN World population prospects 2019 Highlights N. Y. U. Nations Dep. Econ. Soc. Aff. 2019 11 125 Desa, U. N. World population prospects 2019. Highlights N. Y. U. Nations Dep. Econ. Soc. Aff. 11 2. McClements DJ Building a resilient, sustainable, and healthier food supply through innovation and technology Annu. Rev. Food Sci. Technol. 2021 12 1 28 10.1146/annurev-food-092220-030824 33348992 McClements, D. J. et al. Building a resilient, sustainable, and healthier food supply through innovation and technology. Annu. Rev. Food Sci. Technol. 12 33348992 10.1146/annurev-food-092220-030824 3. Godfray HCJ Food security: the challenge of feeding 9 billion people Sci. 2010 327 812 818 10.1126/science.1185383 20110467 Godfray, H. C. J. et al. Food security: the challenge of feeding 9 billion people. Sci. 327 10.1126/science.1185383 20110467 4. Dickie, F., Miyamoto, M. & Collins, C. M. T. The potential of insect farming to increase food security. Edible Insects 5. Ishara, J., Ogunyiola, A., Matendo, R., Kiyala, J. C. K. & Karume, K. Climate Change and Its Implications on Food Security in the Great Lakes Region. In Climate Change and Socio-political Violence in Sub-Saharan Africa in the Anthropocene: Perspectives from Peace Ecology and Sustainable Development 6. Tabari H Climate change impact on flood and extreme precipitation increases with water availability Sci. Rep. 2020 10 13768 10.1038/s41598-020-70816-2 32792563 PMC7426818 Tabari, H. Climate change impact on flood and extreme precipitation increases with water availability. Sci. Rep. 10 32792563 10.1038/s41598-020-70816-2 PMC7426818 7. Lange KW Nakamura Y Edible insects as future food: chances and challenges J. Futur. foods 2021 1 38 46 10.1016/j.jfutfo.2021.10.001 Lange, K. W. & Nakamura, Y. Edible insects as future food: chances and challenges. J. Futur. foods 1 8. Ishara J The contribution of commonly consumed edible insects to nutrition security in the Eastern DR Congo Sci. Rep. 2024 14 16186 10.1038/s41598-024-64078-5 39003308 PMC11246483 Ishara, J. et al. The contribution of commonly consumed edible insects to nutrition security in the Eastern DR Congo. Sci. Rep. 14 39003308 10.1038/s41598-024-64078-5 PMC11246483 9. Van Huis A Rumpold B Maya C Roos N Nutritional qualities and enhancement of edible insects Annu. Rev. Nutr. 2021 41 551 576 10.1146/annurev-nutr-041520-010856 34186013 Van Huis, A., Rumpold, B., Maya, C. & Roos, N. Nutritional qualities and enhancement of edible insects. Annu. Rev. Nutr. 41 34186013 10.1146/annurev-nutr-041520-010856 10. Mishyna M Chen J Benjamin O Sensory attributes of edible insects and insect-based foods–Future outlooks for enhancing consumer appeal Trends Food Sci. Technol. 2020 95 141 148 10.1016/j.tifs.2019.11.016 Mishyna, M., Chen, J. & Benjamin, O. Sensory attributes of edible insects and insect-based foods–Future outlooks for enhancing consumer appeal. Trends Food Sci. Technol. 95 11. Dobermann, D., Swift, J. A. & Field, L. M. Opportunities and hurdles of edible insects for food and feed. Nutr. Bull 12. Tanga CM Edible insect farming as an emerging and profitable enterprise in East Africa Curr. Opin. insect Sci. 2021 48 64 71 10.1016/j.cois.2021.09.007 34649017 Tanga, C. M. et al. Edible insect farming as an emerging and profitable enterprise in East Africa. Curr. Opin. insect Sci. 48 34649017 10.1016/j.cois.2021.09.007 13. Panassiti B Insects benefit from agri-environmental schemes aiming at grassland extensification Agric. Ecosyst. Environ. 2023 356 108613 10.1016/j.agee.2023.108613 Panassiti, B. et al. Insects benefit from agri-environmental schemes aiming at grassland extensification. Agric. Ecosyst. Environ. 356 14. Nowakowski AC Miller AC Miller ME Xiao H Wu X Potential health benefits of edible insects Crit. Rev. Food Sci. Nutr. 2022 62 3499 3508 10.1080/10408398.2020.1867053 33397123 Nowakowski, A. C., Miller, A. C., Miller, M. E., Xiao, H. & Wu, X. Potential health benefits of edible insects. Crit. Rev. Food Sci. Nutr. 62 33397123 10.1080/10408398.2020.1867053 15. Koutsos E Modica B Freel T Immunomodulatory potential of black soldier fly larvae: applications beyond nutrition in animal feeding programs Transl. Anim. Sci. 2022 6 txac084 10.1093/tas/txac084 35854966 PMC9280983 Koutsos, E., Modica, B. & Freel, T. Immunomodulatory potential of black soldier fly larvae: applications beyond nutrition in animal feeding programs. Transl. Anim. Sci. 6 35854966 10.1093/tas/txac084 PMC9280983 16. Bingqian, N. et al. Insect bioactive compounds and their potential use in animal diets and medicine. Entomol. Res 17. Seabrooks L Hu L Insects: an underrepresented resource for the discovery of biologically active natural products Acta Pharm. Sin. B 2017 7 409 426 10.1016/j.apsb.2017.05.001 28752026 PMC5518667 Seabrooks, L. & Hu, L. Insects: an underrepresented resource for the discovery of biologically active natural products. Acta Pharm. Sin. B 7 28752026 10.1016/j.apsb.2017.05.001 PMC5518667 18. Akbarian M Khani A Eghbalpour S Uversky VN Bioactive peptides: Synthesis, sources, applications, and proposed mechanisms of action Int. J. Mol. Sci. 2022 23 1445 10.3390/ijms23031445 35163367 PMC8836030 Akbarian, M., Khani, A., Eghbalpour, S. & Uversky, V. N. Bioactive peptides: Synthesis, sources, applications, and proposed mechanisms of action. Int. J. Mol. Sci. 23 35163367 10.3390/ijms23031445 PMC8836030 19. Megido CR Edible insects acceptance by B elgian consumers: promising attitude for entomophagy development J. Sens. Stud. 2014 29 14 20 10.1111/joss.12077 Megido, C. R. et al. Edible insects acceptance by B elgian consumers: promising attitude for entomophagy development. J. Sens. Stud. 29 20. Payne CLR Scarborough P Rayner M Nonaka K A systematic review of nutrient composition data available for twelve commercially available edible insects, and comparison with reference values Trends Food Sci. Technol. 2016 47 69 77 10.1016/j.tifs.2015.10.012 Payne, C. L. R., Scarborough, P., Rayner, M. & Nonaka, K. A systematic review of nutrient composition data available for twelve commercially available edible insects, and comparison with reference values. Trends Food Sci. Technol. 47 21. Wendin KME Nyberg ME Factors influencing consumer perception and acceptability of insect-based foods Curr. Opin. food Sci. 2021 40 67 71 10.1016/j.cofs.2021.01.007 Wendin, K. M. E. & Nyberg, M. E. Factors influencing consumer perception and acceptability of insect-based foods. Curr. Opin. food Sci. 40 22. Benndorf R Natural products from Actinobacteria associated with fungus-growing termites Antibiotics 2018 7 83 10.3390/antibiotics7030083 30217010 PMC6165096 Benndorf, R. et al. Natural products from Actinobacteria associated with fungus-growing termites. Antibiotics 7 30217010 10.3390/antibiotics7030083 PMC6165096 23. Luo S-L Isocoumarins from American cockroach (Periplaneta americana) and their cytotoxic activities Fitoterapia 2014 95 115 120 10.1016/j.fitote.2014.03.004 24631766 Luo, S.-L. et al. Isocoumarins from American cockroach (Periplaneta americana) and their cytotoxic activities. Fitoterapia 95 24631766 10.1016/j.fitote.2014.03.004 24. Mebs D Pogoda W Schneider M Kauert G Cantharidin and demethylcantharidin (palasonin) content of blister beetles (Coleoptera: Meloidae) from southern Africa Toxicon 2009 53 466 468 10.1016/j.toxicon.2009.01.005 19708124 Mebs, D., Pogoda, W., Schneider, M. & Kauert, G. Cantharidin and demethylcantharidin (palasonin) content of blister beetles (Coleoptera: Meloidae) from southern Africa. Toxicon 53 19708124 10.1016/j.toxicon.2009.01.005 25. Wang J Functional study on the mutations in the silkworm (Bombyx mori) acetylcholinesterase type 1 gene (ace 1) and its recombinant proteins Mol. Biol. Rep. 2014 41 429 437 10.1007/s11033-013-2877-8 24323194 PMC3889635 Wang, J. et al. Functional study on the mutations in the silkworm (Bombyx mori) acetylcholinesterase type 1 gene (ace 1) and its recombinant proteins. Mol. Biol. Rep. 41 24323194 10.1007/s11033-013-2877-8 PMC3889635 26. Kellner RLL Dettner K Allocation of pederin during lifetime of Paederus rove beetles (Coleoptera: Staphylinidae): evidence for polymorphism of hemolymph toxin J. Chem. Ecol. 1995 21 1719 1733 10.1007/BF02033672 24233825 Kellner, R. L. L. & Dettner, K. Allocation of pederin during lifetime of Paederus rove beetles (Coleoptera: Staphylinidae): evidence for polymorphism of hemolymph toxin. J. Chem. Ecol. 21 24233825 10.1007/BF02033672 27. Dai C Ma H Luo L Yin X Angiotensin I-converting enzyme (ACE) inhibitory peptide derived from Tenebrio molitor (L.) larva protein hydrolysate Eur. Food Res. Technol. 2013 236 681 689 10.1007/s00217-013-1923-z Dai, C., Ma, H., Luo, L. & Yin, X. Angiotensin I-converting enzyme (ACE) inhibitory peptide derived from Tenebrio molitor (L.) larva protein hydrolysate. Eur. Food Res. Technol. 236 28. Cito A Botta M Francardi V Dreassi E Insects as source of angiotensin converting enzyme inhibitory peptides J. Insects Food Feed 2017 3 231 240 10.3920/JIFF2017.0017 Cito, A., Botta, M., Francardi, V. & Dreassi, E. Insects as source of angiotensin converting enzyme inhibitory peptides. J. Insects Food Feed 3 29. Hadi J Brightwell G Safety of alternative proteins: Technological, environmental and regulatory aspects of cultured meat, plant-based meat, insect protein and single-cell protein Foods 2021 10 1226 10.3390/foods10061226 34071292 PMC8230205 Hadi, J. & Brightwell, G. Safety of alternative proteins: Technological, environmental and regulatory aspects of cultured meat, plant-based meat, insect protein and single-cell protein. Foods 10 34071292 10.3390/foods10061226 PMC8230205 30. Pessina F Antihypertensive, cardio-and neuro-protective effects of Tenebrio molitor (Coleoptera: Tenebrionidae) defatted larvae in spontaneously hypertensive rats PLoS One. 2020 15 e0233788 10.1371/journal.pone.0233788 32470081 PMC7259609 Pessina, F. et al. Antihypertensive, cardio-and neuro-protective effects of Tenebrio molitor (Coleoptera: Tenebrionidae) defatted larvae in spontaneously hypertensive rats. PLoS One. 15 32470081 10.1371/journal.pone.0233788 PMC7259609 31. Beemelmanns C Macrotermycins A–D, glycosylated macrolactams from a termite-associated Amycolatopsis sp M39. Org. Lett. 2017 19 1000 1003 10.1021/acs.orglett.6b03831 28207275 PMC6006516 Beemelmanns, C. et al. Macrotermycins A–D, glycosylated macrolactams from a termite-associated Amycolatopsis sp. M39. Org. Lett. 19 28207275 10.1021/acs.orglett.6b03831 PMC6006516 32. Lee SR Natalenamides A–C, cyclic tripeptides from the termite-associated Actinomadura sp. RB99 Molecules 2018 23 3003 10.3390/molecules23113003 30453579 PMC6278286 Lee, S. R. et al. Natalenamides A–C, cyclic tripeptides from the termite-associated Actinomadura sp. RB99. Molecules 23 30453579 10.3390/molecules23113003 PMC6278286 33. Yan Y-M Compounds from the insect Blaps japanensis with COX-1 and COX-2 inhibitory activities Bioorg. Med. Chem. Lett. 2015 25 2469 2472 10.1016/j.bmcl.2015.04.085 25980909 Yan, Y.-M. et al. Compounds from the insect Blaps japanensis with COX-1 and COX-2 inhibitory activities. Bioorg. Med. Chem. Lett. 25 25980909 10.1016/j.bmcl.2015.04.085 34. Richter H Gover O Schwartz B Anti-inflammatory activity of black soldier fly oil associated with modulation of tlr signaling: A metabolomic approach Int. J. Mol. Sci. 2023 24 10634 10.3390/ijms241310634 37445812 PMC10341857 Richter, H., Gover, O. & Schwartz, B. Anti-inflammatory activity of black soldier fly oil associated with modulation of tlr signaling: A metabolomic approach. Int. J. Mol. Sci. 24 37445812 10.3390/ijms241310634 PMC10341857 35. Tang J-J Constituents from the edible Chinese black ants (Polyrhachis dives) showing protective effect on rat mesangial cells and anti-inflammatory activity Food Res. Int. 2015 67 163 168 10.1016/j.foodres.2014.11.022 Tang, J.-J. et al. Constituents from the edible Chinese black ants (Polyrhachis dives) showing protective effect on rat mesangial cells and anti-inflammatory activity. Food Res. Int. 67 36. Wijesekara T Xu B New insights into sources, bioavailability, health-promoting effects, and applications of chitin and chitosan J. Agric. Food Chem. 2024 72 17138 17152 10.1021/acs.jafc.4c02162 39042786 Wijesekara, T. & Xu, B. New insights into sources, bioavailability, health-promoting effects, and applications of chitin and chitosan. J. Agric. Food Chem. 72 39042786 10.1021/acs.jafc.4c02162 37. Eunice Boko AC Blei SH Koko AC Angaman DM Evaluating Nudaurelia dione (Saturniidae), an Edible Insect, for Sustainable Nutrition: Composition, Benefits, and Antinutritional Insights J. Food Biochem. 2024 2024 5559567 10.1155/2024/5559567 Eunice Boko, A. C., Blei, S. H., Koko, A. C. & Angaman, D. M. Evaluating Nudaurelia dione (Saturniidae), an Edible Insect, for Sustainable Nutrition: Composition, Benefits, and Antinutritional Insights. J. Food Biochem. 2024 38. Mu, L., Wu, L., Wu, S., Ye, Q. & Zhong, Z. Progress in chitin/chitosan and their derivatives for biomedical applications: Where we stand. Carbohydr. Polym 10.1016/j.carbpol.2024.122233 39174074 39. Ahn MY Han JW Hwang JS Yun EY Lee BM Anti-inflammatory effect of glycosaminoglycan derived from Gryllus bimaculatus (a type of cricket, insect) on adjuvant-treated chronic arthritis rat model J. Toxicol. Environ. Heal. Part A. 2014 77 1332 1345 10.1080/15287394.2014.951591 25343284 Ahn, M. Y., Han, J. W., Hwang, J. S., Yun, E. Y. & Lee, B. M. Anti-inflammatory effect of glycosaminoglycan derived from Gryllus bimaculatus (a type of cricket, insect) on adjuvant-treated chronic arthritis rat model. J. Toxicol. Environ. Heal. Part A. 77 10.1080/15287394.2014.951591 25343284 40. Ahn MY Hwang JS Kim M-J Park K-K Antilipidemic effects and gene expression profiling of the glycosaminoglycans from cricket in rats on a high fat diet Arch. Pharm. Res. 2016 39 926 936 10.1007/s12272-016-0749-1 27138285 Ahn, M. Y., Hwang, J. S., Kim, M.-J. & Park, K.-K. Antilipidemic effects and gene expression profiling of the glycosaminoglycans from cricket in rats on a high fat diet. Arch. Pharm. Res. 39 27138285 10.1007/s12272-016-0749-1 41. Ahn MY Anti-diabetic activity of field cricket glycosaminoglycan by ameliorating oxidative stress BMC Complement. Med. Ther. 2020 20 1 10 10.1186/s12906-020-03027-x 32698784 PMC7376639 Ahn, M. Y. et al. Anti-diabetic activity of field cricket glycosaminoglycan by ameliorating oxidative stress. BMC Complement. Med. Ther. 20 32698784 10.1186/s12906-020-03027-x PMC7376639 42. Yan Y-M Luo Q Li J-J Tu Z-C Cheng Y-X Novel spirooxindole alkaloid derivatives from the medicinal insect Blaps japanensis and their biological evaluation Bioorg. Chem. 2023 141 106845 10.1016/j.bioorg.2023.106845 37797453 Yan, Y.-M., Luo, Q., Li, J.-J., Tu, Z.-C. & Cheng, Y.-X. Novel spirooxindole alkaloid derivatives from the medicinal insect Blaps japanensis and their biological evaluation. Bioorg. Chem. 141 37797453 10.1016/j.bioorg.2023.106845 43. Lu J Probing the antioxidant activity of functional proteins and bioactive peptides in Hermetia illucens larvae fed with food wastes Sci. Rep. 2022 12 2799 10.1038/s41598-022-06668-9 35181682 PMC8857240 Lu, J. et al. Probing the antioxidant activity of functional proteins and bioactive peptides in Hermetia illucens larvae fed with food wastes. Sci. Rep. 12 35181682 10.1038/s41598-022-06668-9 PMC8857240 44. Dontsov AE Ommochromes from the compound eyes of insects: physicochemical properties and antioxidant activity Biochem 2020 85 668 678 32586230 10.1134/S0006297920060048 Dontsov, A. E. et al. Ommochromes from the compound eyes of insects: physicochemical properties and antioxidant activity. Biochem 85 32586230 10.1134/S0006297920060048 45. Zielińska E Baraniak B Karaś M Antioxidant and anti-inflammatory activities of hydrolysates and peptide fractions obtained by enzymatic hydrolysis of selected heat-treated edible insects Nutrients 2017 9 970 10.3390/nu9090970 28869499 PMC5622730 Zielińska, E., Baraniak, B. & Karaś, M. Antioxidant and anti-inflammatory activities of hydrolysates and peptide fractions obtained by enzymatic hydrolysis of selected heat-treated edible insects. Nutrients 9 28869499 10.3390/nu9090970 PMC5622730 46. Di Mattia C Battista N Sacchetti G Serafini M Antioxidant activities in vitro of water and liposoluble extracts obtained by different species of edible insects and invertebrates Front. Nutr. 2019 6 106 10.3389/fnut.2019.00106 31380385 PMC6643021 Di Mattia, C., Battista, N., Sacchetti, G. & Serafini, M. Antioxidant activities in vitro of water and liposoluble extracts obtained by different species of edible insects and invertebrates. Front. Nutr. 6 31380385 10.3389/fnut.2019.00106 PMC6643021 47. Li Z Antibacterial and immunomodulatory activities of insect defensins-DLP2 and DLP4 against multidrug-resistant Staphylococcus aureus Sci. Rep. 2017 7 12124 10.1038/s41598-017-10839-4 28935900 PMC5608901 Li, Z. et al. Antibacterial and immunomodulatory activities of insect defensins-DLP2 and DLP4 against multidrug-resistant Staphylococcus aureus. Sci. Rep. 7 28935900 10.1038/s41598-017-10839-4 PMC5608901 48. Ai H Wang F Zhang N Zhang L Lei C Antiviral, immunomodulatory, and free radical scavenging activities of a protein-enriched fraction from the larvae of the housefly, Musca domestica J. Insect Sci. 2013 13 112 10.1673/031.013.11201 24735244 PMC4011367 Ai, H., Wang, F., Zhang, N., Zhang, L. & Lei, C. Antiviral, immunomodulatory, and free radical scavenging activities of a protein-enriched fraction from the larvae of the housefly, Musca domestica. J. Insect Sci. 13 24735244 10.1673/031.013.11201 PMC4011367 49. Li Z Purification and characterization of a novel immunomodulatory hexapeptide from alcalase hydrolysate of ultramicro-pretreated silkworm (Bombyx mori) pupa protein J. Asia. Pac. Entomol. 2019 22 633 637 10.1016/j.aspen.2019.04.005 Li, Z. et al. Purification and characterization of a novel immunomodulatory hexapeptide from alcalase hydrolysate of ultramicro-pretreated silkworm (Bombyx mori) pupa protein. J. Asia. Pac. Entomol. 22 50. Chen Y Purification of novel polypeptides from bee pupae and their immunomodulatory activity in vivo and in vitro J. Insects Food Feed 2022 8 1117 1132 10.3920/JIFF2021.0190 Chen, Y. et al. Purification of novel polypeptides from bee pupae and their immunomodulatory activity in vivo and in vitro. J. Insects Food Feed 8 51. Saidemberg DM da Silva-Filho LC Tognoli LMMC Tormena CF Palma MS Polybioside, a neuroactive compound from the venom of the social wasp Polybia paulista J. Nat. Prod. 2010 73 527 531 10.1021/np900424t 20158240 Saidemberg, D. M., da Silva-Filho, L. C., Tognoli, L. M. M. C., Tormena, C. F. & Palma, M. S. Polybioside, a neuroactive compound from the venom of the social wasp Polybia paulista. J. Nat. Prod. 73 20158240 10.1021/np900424t 52. Bosque I Gonzalez-Gomez JC Loza MI Brea J Natural tetraponerines: A general synthesis and antiproliferative activity J. Org. Chem. 2014 79 3982 3991 10.1021/jo500446f 24731136 Bosque, I., Gonzalez-Gomez, J. C., Loza, M. I. & Brea, J. Natural tetraponerines: A general synthesis and antiproliferative activity. J. Org. Chem. 79 24731136 10.1021/jo500446f 53. Lu J Sesquiterpene acids from Shellac and their bioactivities evaluation Fitoterapia 2014 97 64 70 10.1016/j.fitote.2014.05.014 24879899 Lu, J. et al. Sesquiterpene acids from Shellac and their bioactivities evaluation. Fitoterapia 97 24879899 10.1016/j.fitote.2014.05.014 54. Vihakas MA Kapari L Salminen J-P New types of flavonol oligoglycosides accumulate in the hemolymph of birch-feeding sawfly larvae J. Chem. Ecol. 2010 36 864 872 10.1007/s10886-010-9822-2 20589418 Vihakas, M. A., Kapari, L. & Salminen, J.-P. New types of flavonol oligoglycosides accumulate in the hemolymph of birch-feeding sawfly larvae. J. Chem. Ecol. 36 20589418 10.1007/s10886-010-9822-2 55. Cheseto X Potential of the desert locust Schistocerca gregaria (Orthoptera: Acrididae) as an unconventional source of dietary and therapeutic sterols PLoS One 2015 10 e0127171 10.1371/journal.pone.0127171 25970517 PMC4429980 Cheseto, X. et al. Potential of the desert locust Schistocerca gregaria (Orthoptera: Acrididae) as an unconventional source of dietary and therapeutic sterols. PLoS One 10 25970517 10.1371/journal.pone.0127171 PMC4429980 56. Islam MM Yang C-J Efficacy of mealworm and super mealworm larvae probiotics as an alternative to antibiotics challenged orally with Salmonella and E. coli infection in broiler chicks Poult. Sci. 2017 96 27 34 10.3382/ps/pew220 27520069 Islam, M. M. & Yang, C.-J. Efficacy of mealworm and super mealworm larvae probiotics as an alternative to antibiotics challenged orally with Salmonella and E. coli infection in broiler chicks. Poult. Sci. 96 27520069 10.3382/ps/pew220 57. Stull VJ Impact of edible cricket consumption on gut microbiota in healthy adults, a double-blind, randomized crossover trial Sci. Rep. 2018 8 1 13 10.1038/s41598-018-29032-2 30018370 PMC6050247 Stull, V. J. et al. Impact of edible cricket consumption on gut microbiota in healthy adults, a double-blind, randomized crossover trial. Sci. Rep. 8 30018370 10.1038/s41598-018-29032-2 PMC6050247 58. Borrelli L Insect-based diet, a promising nutritional source, modulates gut microbiota composition and SCFAs production in laying hens Sci. Rep. 2017 7 16269 10.1038/s41598-017-16560-6 29176587 PMC5701250 Borrelli, L. et al. Insect-based diet, a promising nutritional source, modulates gut microbiota composition and SCFAs production in laying hens. Sci. Rep. 7 29176587 10.1038/s41598-017-16560-6 PMC5701250 59. Liaqat F Eltem R Chitooligosaccharides and their biological activities: A comprehensive review Carbohydr. Polym. 2018 184 243 259 10.1016/j.carbpol.2017.12.067 29352917 Liaqat, F. & Eltem, R. Chitooligosaccharides and their biological activities: A comprehensive review. Carbohydr. Polym. 184 29352917 10.1016/j.carbpol.2017.12.067 60. Nino MC Reddivari L Osorio C Kaplan I Liceaga AM Insects as a source of phenolic compounds and potential health benefits J. Insects Food Feed 2021 7 1077 1088 10.3920/JIFF2020.0113 Nino, M. C., Reddivari, L., Osorio, C., Kaplan, I. & Liceaga, A. M. Insects as a source of phenolic compounds and potential health benefits. J. Insects Food Feed 7 61. Torres-Castillo JA Olazarán-Santibáñez FE Insects as source of phenolic and antioxidant entomochemicals in the food industry Front. Nutr. 2023 10 1133342 10.3389/fnut.2023.1133342 36937358 PMC10014852 Torres-Castillo, J. A. & Olazarán-Santibáñez, F. E. Insects as source of phenolic and antioxidant entomochemicals in the food industry. Front. Nutr. 10 36937358 10.3389/fnut.2023.1133342 PMC10014852 62. Kim J-K Anti-inflammatory effect of roasted licorice extracts on lipopolysaccharide-induced inflammatory responses in murine macrophages Biochem. Biophys. Res. Commun. 2006 345 1215 1223 10.1016/j.bbrc.2006.05.035 16716255 Kim, J.-K. et al. Anti-inflammatory effect of roasted licorice extracts on lipopolysaccharide-induced inflammatory responses in murine macrophages. Biochem. Biophys. Res. Commun. 345 16716255 10.1016/j.bbrc.2006.05.035 63. Kreuzenbeck NB Isolation, (bio)synthetic studies and evaluation of antimicrobial properties of drimenol-type sesquiterpenes of Termitomyces fungi Commun. Chem. 2023 6 79 10.1038/s42004-023-00871-z 37095327 PMC10126200 Kreuzenbeck, N. B. et al. Isolation, (bio)synthetic studies and evaluation of antimicrobial properties of drimenol-type sesquiterpenes of Termitomyces fungi. Commun. Chem. 6 37095327 10.1038/s42004-023-00871-z PMC10126200 64. Xu X Diversity, bacterial symbionts, and antimicrobial potential of termite-associated fungi Front. Microbiol. 2020 11 300 10.3389/fmicb.2020.00300 32231643 PMC7082625 Xu, X. et al. Diversity, bacterial symbionts, and antimicrobial potential of termite-associated fungi. Front. Microbiol. 11 32231643 10.3389/fmicb.2020.00300 PMC7082625 65. Zhou Y Nutritional Composition, Health Benefits, and Application Value of Edible Insects: A Review Foods 2022 11 3961 10.3390/foods11243961 36553703 PMC9777846 Zhou, Y. et al. Nutritional Composition, Health Benefits, and Application Value of Edible Insects: A Review. Foods 11 36553703 10.3390/foods11243961 PMC9777846 66. Kang CK Antibacterial cotton fibers treated with silver nanoparticles and quaternary ammonium salts Carbohydr. Polym. 2016 151 1012 1018 10.1016/j.carbpol.2016.06.043 27474649 Kang, C. K. et al. Antibacterial cotton fibers treated with silver nanoparticles and quaternary ammonium salts. Carbohydr. Polym. 151 27474649 10.1016/j.carbpol.2016.06.043 67. Lu J Identification of N-acetyldopamine dimers from the dung beetle Catharsius molossus and their COX-1 and COX-2 inhibitory activities Molecules 2015 20 15589 15596 10.3390/molecules200915589 26343619 PMC6331819 Lu, J. et al. Identification of N-acetyldopamine dimers from the dung beetle Catharsius molossus and their COX-1 and COX-2 inhibitory activities. Molecules 20 26343619 10.3390/molecules200915589 PMC6331819 68. An JS Lenzimycins A and B, metabolites with antibacterial properties from Brevibacillus sp. associated with the dung beetle Onthophagus lenzii Front. Microbiol. 2020 11 599911 10.3389/fmicb.2020.599911 33193283 PMC7661691 An, J. S. et al. Lenzimycins A and B, metabolites with antibacterial properties from Brevibacillus sp. associated with the dung beetle Onthophagus lenzii. Front. Microbiol. 11 33193283 10.3389/fmicb.2020.599911 PMC7661691 69. Correa Y Identification and characterization of compounds from Chrysosporium multifidum, a fungus with moderate antimicrobial activity isolated from Hermetia illucens gut microbiota PLoS One 2019 14 e0218837 10.1371/journal.pone.0218837 31860650 PMC6924690 Correa, Y. et al. Identification and characterization of compounds from Chrysosporium multifidum, a fungus with moderate antimicrobial activity isolated from Hermetia illucens gut microbiota. PLoS One 14 31860650 10.1371/journal.pone.0218837 PMC6924690 70. Mudalungu CM Tanga CM Kelemu S Torto B An overview of antimicrobial compounds from African edible insects and their associated microbiota Antibiotics 2021 10 621 10.3390/antibiotics10060621 34067471 PMC8224635 Mudalungu, C. M., Tanga, C. M., Kelemu, S. & Torto, B. An overview of antimicrobial compounds from African edible insects and their associated microbiota. Antibiotics 10 34067471 10.3390/antibiotics10060621 PMC8224635 71. Pettit GR Ye Q Herald DL Hogan F Pettit RK Antineoplastic agents. 573. isolation and structure of papilistatin from the papilionid butterfly Byasa polyeuctes termessa J. Nat. Prod. 2010 73 164 166 10.1021/np9004689 20085286 PMC2834410 Pettit, G. R., Ye, Q., Herald, D. L., Hogan, F. & Pettit, R. K. Antineoplastic agents. 573. isolation and structure of papilistatin from the papilionid butterfly Byasa polyeuctes termessa. J. Nat. Prod. 73 20085286 10.1021/np9004689 PMC2834410 72. Klassen JL Lee SR Poulsen M Beemelmanns C Kim KH Efomycins K and L from a termite-associated Streptomyces sp. M56 and their putative biosynthetic origin Front. Microbiol. 2019 10 1739 10.3389/fmicb.2019.01739 31447803 PMC6691879 Klassen, J. L., Lee, S. R., Poulsen, M., Beemelmanns, C. & Kim, K. H. Efomycins K and L from a termite-associated Streptomyces sp. M56 and their putative biosynthetic origin. Front. Microbiol. 10 31447803 10.3389/fmicb.2019.01739 PMC6691879 73. Dong Q-F Antifungal activity of crude extracts and fat-soluble constituents of Holotrichia diomphalia larvae Bioresour. Technol. 2008 99 8521 8523 10.1016/j.biortech.2008.03.010 18424040 Dong, Q.-F. et al. Antifungal activity of crude extracts and fat-soluble constituents of Holotrichia diomphalia larvae. Bioresour. Technol. 99 18424040 10.1016/j.biortech.2008.03.010 74. Harikrishnan R Kim J-S Balasundaram C Heo M-S Immunomodulatory effects of chitin and chitosan enriched diets in Epinephelus bruneus against Vibrio alginolyticus infection Aquaculture 2012 326 46 52 10.1016/j.aquaculture.2011.11.034 Harikrishnan, R., Kim, J.-S., Balasundaram, C. & Heo, M.-S. Immunomodulatory effects of chitin and chitosan enriched diets in Epinephelus bruneus against Vibrio alginolyticus infection. Aquaculture 326 75. Marono S Productive performance and blood profiles of laying hens fed Hermetia illucens larvae meal as total replacement of soybean meal from 24 to 45 weeks of age Poult. Sci. 2017 96 1783 1790 10.3382/ps/pew461 28339710 Marono, S. et al. Productive performance and blood profiles of laying hens fed Hermetia illucens larvae meal as total replacement of soybean meal from 24 to 45 weeks of age. Poult. Sci. 96 28339710 10.3382/ps/pew461 76. Liu Y Hormonal and nutritional regulation of insect fat body development and function Arch. Insect Biochem. Physiol. Publ. Collab. Entomol. Soc. Am. 2009 71 16 30 10.1002/arch.20290 19353653 Liu, Y. et al. Hormonal and nutritional regulation of insect fat body development and function. Arch. Insect Biochem. Physiol. Publ. Collab. Entomol. Soc. Am. 71 10.1002/arch.20290 19353653 77. Zhao P Genome-wide identification and immune response analysis of serine protease inhibitor genes in the silkworm, Bombyx mori PLoS One 2012 7 e31168 10.1371/journal.pone.0031168 22348050 PMC3278429 Zhao, P. et al. Genome-wide identification and immune response analysis of serine protease inhibitor genes in the silkworm, Bombyx mori. PLoS One 7 22348050 10.1371/journal.pone.0031168 PMC3278429 78. Hahn T Current state of chitin purification and chitosan production from insects J. Chem. Technol. Biotechnol. 2020 95 2775 2795 10.1002/jctb.6533 Hahn, T. et al. Current state of chitin purification and chitosan production from insects. J. Chem. Technol. Biotechnol. 95 79. Finke MD Complete nutrient content of four species of feeder insects Zoo. Biol. 2013 32 27 36 10.1002/zoo.21012 22689347 Finke, M. D. Complete nutrient content of four species of feeder insects. Zoo. Biol. 32 22689347 10.1002/zoo.21012 80. Belluco S Edible insects in a food safety and nutritional perspective: a critical review Compr. Rev. food Sci. food Saf. 2013 12 296 313 10.1111/1541-4337.12014 Belluco, S. et al. Edible insects in a food safety and nutritional perspective: a critical review. Compr. Rev. food Sci. food Saf. 12 81. Kulma, M., Kou, L., Homolková, D. & Plachý, V. Effect of developmental stage on the nutritional value of edible insects. A case study with Blaberus craniifer and Zophobas morio. J. Food Compos. Anal 92 82. Kong B Xiong YL Antioxidant activity of zein hydrolysates in a liposome system and the possible mode of action J. Agric. Food Chem. 2006 54 6059 6068 10.1021/jf060632q 16881717 Kong, B. & Xiong, Y. L. Antioxidant activity of zein hydrolysates in a liposome system and the possible mode of action. J. Agric. Food Chem. 54 16881717 10.1021/jf060632q 83. da Silva Lucas AJ de Oliveira LM Da Rocha M Prentice C Edible insects: An alternative of nutritional, functional and bioactive compounds Food Chem. 2020 311 126022 10.1016/j.foodchem.2019.126022 31869637 da Silva Lucas, A. J., de Oliveira, L. M., Da Rocha, M. & Prentice, C. Edible insects: An alternative of nutritional, functional and bioactive compounds. Food Chem. 311 31869637 10.1016/j.foodchem.2019.126022 84. Teixeira CSS Villa C Costa J Ferreira IM Mafra I Edible insects as a novel source of bioactive peptides: A systematic review Foods 2023 12 2026 10.3390/foods12102026 37238844 PMC10216942 Teixeira, C. S. S., Villa, C., Costa, J., Ferreira, I. M. & Mafra, I. Edible insects as a novel source of bioactive peptides: A systematic review. Foods 12 37238844 10.3390/foods12102026 PMC10216942 85. Psarianos, M., Aghababaei, F. & Schlüter, O. K. Bioactive compounds in edible insects: Aspects of cultivation, processing and nutrition. Food Res. Int 10.1016/j.foodres.2025.115802 40022332 86. Gullón P Gullón B Romaní A Rocchetti G Lorenzo JM Smart advanced solvents for bioactive compounds recovery from agri-food by-products: A review Trends Food Sci. Technol. 2020 101 182 197 10.1016/j.tifs.2020.05.007 Gullón, P., Gullón, B., Romaní, A., Rocchetti, G. & Lorenzo, J. M. Smart advanced solvents for bioactive compounds recovery from agri-food by-products: A review. Trends Food Sci. Technol. 101 87. Karrar E Lipid-soluble vitamins from dairy products: extraction, purification, and analytical techniques Food Chem. 2022 373 131436 10.1016/j.foodchem.2021.131436 34740052 Karrar, E. et al. Lipid-soluble vitamins from dairy products: extraction, purification, and analytical techniques. Food Chem. 373 34740052 10.1016/j.foodchem.2021.131436 88. Farooq S Abdullah Zhang H Weiss J A comprehensive review on polarity, partitioning, and interactions of phenolic antioxidants at oil–water interface of food emulsions Compr. Rev. Food Sci. Food Saf. 2021 20 4250 4277 10.1111/1541-4337.12792 34190411 Farooq, S., Abdullah, Zhang, H. & Weiss, J. A comprehensive review on polarity, partitioning, and interactions of phenolic antioxidants at oil–water interface of food emulsions. Compr. Rev. Food Sci. Food Saf. 20 34190411 10.1111/1541-4337.12792 89. Rose A Jaczynski J Matak K Extraction of lipids from insect powders using a one-step organic solvent extraction process Futur. Foods 2021 4 100073 10.1016/j.fufo.2021.100073 PMC11240939 38998618 Rose, A., Jaczynski, J. & Matak, K. Extraction of lipids from insect powders using a one-step organic solvent extraction process. Futur. Foods 4 10.3390/foods13132113 PMC11240939 38998618 90. An R Isolation, purification and identification of biological compounds from Beauveria sp. and their evaluation as insecticidal effectiveness against Bemisia tabaci Sci. Rep. 2021 11 12020 10.1038/s41598-021-91574-9 34103637 PMC8187347 An, R. et al. Isolation, purification and identification of biological compounds from Beauveria sp. and their evaluation as insecticidal effectiveness against Bemisia tabaci. Sci. Rep. 11 34103637 10.1038/s41598-021-91574-9 PMC8187347 91. Giovannoni S Determination of variability of terpenes and terpenoids in Cannabis sativa by gas chromatography-flame ionization detection and gas chromatography-mass spectrometry J. Chromatogr. A 2023 1687 463669 10.1016/j.chroma.2022.463669 36463647 Giovannoni, S. et al. Determination of variability of terpenes and terpenoids in Cannabis sativa by gas chromatography-flame ionization detection and gas chromatography-mass spectrometry. J. Chromatogr. A 1687 36463647 10.1016/j.chroma.2022.463669 92. da Silva Lucas AJ Extraction, physicochemical characterization, and morphological properties of chitin and chitosan from cuticles of edible insects Food Chem. 2021 343 128550 10.1016/j.foodchem.2020.128550 33191008 da Silva Lucas, A. J. et al. Extraction, physicochemical characterization, and morphological properties of chitin and chitosan from cuticles of edible insects. Food Chem. 343 33191008 10.1016/j.foodchem.2020.128550 93. Yea, C. S., Ahmadi, R., Zarei, M. & Muhialdin, B. J. Fractionation and Purification of Bioactive Peptides. in Bioactive Peptides from Food 94. Gupta P Mass spectrometry-based technology and workflows for studying the chemistry of fungal endophyte derived bioactive compounds ACS Chem. Biol. 2021 16 2068 2086 10.1021/acschembio.1c00581 34724607 Gupta, P. et al. Mass spectrometry-based technology and workflows for studying the chemistry of fungal endophyte derived bioactive compounds. ACS Chem. Biol. 16 34724607 10.1021/acschembio.1c00581 95. Shakir N Impact of NaCl stress on phytoconstituents and bioactivity of Matricaria chamomilla: a multi-analytical approach Sci. Rep. 2024 14 19717 10.1038/s41598-024-70672-4 39181928 PMC11344756 Shakir, N. et al. Impact of NaCl stress on phytoconstituents and bioactivity of Matricaria chamomilla: a multi-analytical approach. Sci. Rep. 14 39181928 10.1038/s41598-024-70672-4 PMC11344756 96. Rivas-Navia DM Bioactive compounds of insects for food use: Potentialities and risks J. Agric. Food Res. 2023 14 100807 Rivas-Navia, D. M. et al. Bioactive compounds of insects for food use: Potentialities and risks. J. Agric. Food Res. 14 97. Zhang, J., Li, M., Han, Z. & Shao, J.-H. A review of insect peptides: From extraction and preparation to bioactivities. Curr. Opin. Food Sci 98. Stull VJ Weir TL Chitin and omega-3 fatty acids in edible insects have underexplored benefits for the gut microbiome and human health Nat. Food 2023 4 283 287 10.1038/s43016-023-00728-7 37117549 Stull, V. J. & Weir, T. L. Chitin and omega-3 fatty acids in edible insects have underexplored benefits for the gut microbiome and human health. Nat. Food 4 37117549 10.1038/s43016-023-00728-7 99. Mudalungu CM Mokaya HO Tanga CM Beneficial sterols in selected edible insects and their associated antibacterial activities Sci. Rep. 2023 13 10786 10.1038/s41598-023-37905-4 37402875 PMC10319837 Mudalungu, C. M., Mokaya, H. O. & Tanga, C. M. Beneficial sterols in selected edible insects and their associated antibacterial activities. Sci. Rep. 13 37402875 10.1038/s41598-023-37905-4 PMC10319837 100. Siddiqui, S. A. et al. Legal situation and consumer acceptance of insects being eaten as human food in different nations across the world–A comprehensive review. Compr. Rev. Food Sci. Food Saf 10.1111/1541-4337.13243 37823805 101. Sidali KL Pizzo S Garrido-Pérez EI Schamel G Between food delicacies and food taboos: A structural equation model to assess Western students’ acceptance of Amazonian insect food Food Res. Int. 2019 115 83 89 10.1016/j.foodres.2018.07.027 30599985 Sidali, K. L., Pizzo, S., Garrido-Pérez, E. I. & Schamel, G. Between food delicacies and food taboos: A structural equation model to assess Western students’ acceptance of Amazonian insect food. Food Res. Int. 115 30599985 10.1016/j.foodres.2018.07.027 102. Kelemu S African edible insects for food and feed: inventory, diversity, commonalities and contribution to food security J. Insects Food Feed 2015 1 103 119 10.3920/JIFF2014.0016 Kelemu, S. et al. African edible insects for food and feed: inventory, diversity, commonalities and contribution to food security. J. Insects Food Feed 1 103. Ishara J Inventory reveals wide biodiversity of edible insects in the Eastern Democratic Republic of Congo Sci. Rep. 2022 12 1576 10.1038/s41598-022-05607-y 35091646 PMC8799670 Ishara, J. et al. Inventory reveals wide biodiversity of edible insects in the Eastern Democratic Republic of Congo. Sci. Rep. 12 35091646 10.1038/s41598-022-05607-y PMC8799670 104. Imathiu S Benefits and food safety concerns associated with consumption of edible insects NFS J. 2020 18 1 11 10.1016/j.nfs.2019.11.002 Imathiu, S. Benefits and food safety concerns associated with consumption of edible insects. NFS J. 18 105. Ng’ang’a J Microbial quality of edible grasshoppers Ruspolia differens (Orthoptera: Tettigoniidae): From wild harvesting to fork in the Kagera Region, Tanzania J. Food Saf. 2019 39 e12549 10.1111/jfs.12549 Ng’ang’a, J. et al. Microbial quality of edible grasshoppers Ruspolia differens (Orthoptera: Tettigoniidae): From wild harvesting to fork in the Kagera Region, Tanzania. J. Food Saf. 39 106. Borges MM da Costa DV Trombete FM Câmara AKFI Edible insects as a sustainable alternative to food products: An insight into quality aspects of reformulated bakery and meat products Curr. Opin. Food Sci. 2022 46 100864 10.1016/j.cofs.2022.100864 Borges, M. M., da Costa, D. V., Trombete, F. M. & Câmara, A. K. F. I. Edible insects as a sustainable alternative to food products: An insight into quality aspects of reformulated bakery and meat products. Curr. Opin. Food Sci. 46 107. Van Huis, A. and Oonincx D. G. A. B. The environmental sustainability of insects as food and feed. A review. Agron. Sustain. Dev 108. Ishara J Insights into the effects of geographical sourcing area on nutrient composition and sensory attributes of nine edible insects Sci. Rep. 2025 15 11610 10.1038/s41598-025-90659-z 40185807 PMC11971241 Ishara, J. et al. Insights into the effects of geographical sourcing area on nutrient composition and sensory attributes of nine edible insects. Sci. Rep. 15 40185807 10.1038/s41598-025-90659-z PMC11971241 109. Hopkins I Farahnaky A Gill H Newman LP Danaher J Australians’ experience, barriers and willingness towards consuming edible insects as an emerging protein source Appetite 2022 169 105832 10.1016/j.appet.2021.105832 34896167 Hopkins, I., Farahnaky, A., Gill, H., Newman, L. P. & Danaher, J. Australians’ experience, barriers and willingness towards consuming edible insects as an emerging protein source. Appetite 169 34896167 10.1016/j.appet.2021.105832 110. Mishyna, M., Chen, J. & Benjamin, O. Sensory attributes of edible insects and insect-based foods – Future outlooks for enhancing consumer appeal. Trends Food Sci. Technol 111. Melgar-lalanne, G., Hernandez-Alvarez, A.-J. & Salinas-Castro, A. Edible Insects Processing: Traditional and Innovative Technologies. Compr. Rev. Food Sci. Food Saf 18 10.1111/1541-4337.12463 33336989 112. Jiang N Design, synthesis and antiproliferative activity of novel 2-substituted-4-amino-6-halogenquinolines Molecules 2012 17 5870 5881 10.3390/molecules17055870 22592090 PMC6268466 Jiang, N. et al. Design, synthesis and antiproliferative activity of novel 2-substituted-4-amino-6-halogenquinolines. Molecules 17 22592090 10.3390/molecules17055870 PMC6268466 113. Zhu H-J Xu T Yan Y-M Tu Z-C Cheng Y-X Neolignans and norlignans from insect medicine Polyphaga plancyi and their biological activities Nat. Products Bioprospect. 2021 11 51 62 10.1007/s13659-020-00262-0 PMC7933325 32876846 Zhu, H.-J., Xu, T., Yan, Y.-M., Tu, Z.-C. & Cheng, Y.-X. Neolignans and norlignans from insect medicine Polyphaga plancyi and their biological activities. Nat. Products Bioprospect. 11 10.1007/s13659-020-00262-0 PMC7933325 32876846 114. Kim KH Natalamycin A, an ansamycin from a termite-associated Streptomyces sp Chem. Sci. 2014 5 4333 4338 10.1039/C4SC01136H 25386334 PMC4224317 Kim, K. H. et al. Natalamycin A, an ansamycin from a termite-associated Streptomyces sp. Chem. Sci. 5 25386334 10.1039/C4SC01136H PMC4224317 115. Kang HR Termisoflavones A–C, isoflavonoid glycosides from termite-associated Streptomyces sp. RB1 J. Nat. Prod. 2016 79 3072 3078 10.1021/acs.jnatprod.6b00738 28006913 Kang, H. R. et al. Termisoflavones A–C, isoflavonoid glycosides from termite-associated Streptomyces sp. RB1. J. Nat. Prod. 79 28006913 10.1021/acs.jnatprod.6b00738 116. Wyche TP Linear peptides are the major products of a biosynthetic pathway that encodes for cyclic depsipeptides Org. Lett. 2017 19 1772 1775 10.1021/acs.orglett.7b00545 28326787 PMC6013059 Wyche, T. P. et al. Linear peptides are the major products of a biosynthetic pathway that encodes for cyclic depsipeptides. Org. Lett. 19 28326787 10.1021/acs.orglett.7b00545 PMC6013059 117. Carr G Microtermolides A and B from termite-associated Streptomyces sp. and structural revision of vinylamycin Org. Lett. 2012 14 2822 2825 10.1021/ol301043p 22591554 PMC3365539 Carr, G. et al. Microtermolides A and B from termite-associated Streptomyces sp. and structural revision of vinylamycin. Org. Lett. 14 22591554 10.1021/ol301043p PMC3365539 118. von Bonin A Efomycine M: an inhibitor of selectins? Nat. Med. 2006 12 873 10.1038/nm0806-873a 16892024 von Bonin, A. et al. Efomycine M: an inhibitor of selectins?. Nat. Med. 12 16892024 10.1038/nm0806-873a 119. Twu N-F Srinivasan R Chou C-H Wu L-S Chiu C-H Cantharidin and norcantharidin inhibit caprine luteal cell steroidogenesis in vitro Exp. Toxicol. Pathol. 2012 64 37 44 10.1016/j.etp.2010.06.003 20594813 Twu, N.-F., Srinivasan, R., Chou, C.-H., Wu, L.-S. & Chiu, C.-H. Cantharidin and norcantharidin inhibit caprine luteal cell steroidogenesis in vitro. Exp. Toxicol. Pathol. 64 20594813 10.1016/j.etp.2010.06.003 120. Kim S-H Tripartin, a histone demethylase inhibitor from a bacterium associated with a dung beetle larva Org. Lett. 2013 15 1834 1837 10.1021/ol4004417 23550720 Kim, S.-H. et al. Tripartin, a histone demethylase inhibitor from a bacterium associated with a dung beetle larva. Org. Lett. 15 23550720 10.1021/ol4004417 121. Kim MJ Population genetic characterization of the endangered dung beetle Copris tripartitus (Coleoptera: Scarabaeidae) using novel microsatellite markers J. Asia. Pac. Entomol. 2022 25 101899 10.1016/j.aspen.2022.101899 Kim, M. J. et al. Population genetic characterization of the endangered dung beetle Copris tripartitus (Coleoptera: Scarabaeidae) using novel microsatellite markers. J. Asia. Pac. Entomol. 25 122. Um S Naphthoquinone–oxindole alkaloids, coprisidins A and B, from a gut-associated bacterium in the dung beetle, Copris tripartitus Org. Lett. 2016 18 5792 5795 10.1021/acs.orglett.6b02555 27934498 Um, S. et al. Naphthoquinone–oxindole alkaloids, coprisidins A and B, from a gut-associated bacterium in the dung beetle, Copris tripartitus. Org. Lett. 18 27934498 10.1021/acs.orglett.6b02555 123. Park S-H Tripartilactam, a cyclobutane-bearing tricyclic lactam from a Streptomyces sp. in a dung beetle’s brood ball Org. Lett. 2012 14 1258 1261 10.1021/ol300108z 22360311 Park, S.-H. et al. Tripartilactam, a cyclobutane-bearing tricyclic lactam from a Streptomyces sp. in a dung beetle’s brood ball. Org. Lett. 14 22360311 10.1021/ol300108z 124. Blodgett JAV Common biosynthetic origins for polycyclic tetramate macrolactams from phylogenetically diverse bacteria Proc. Natl Acad. Sci. 2010 107 11692 11697 10.1073/pnas.1001513107 20547882 PMC2900643 Blodgett, J. A. V. et al. Common biosynthetic origins for polycyclic tetramate macrolactams from phylogenetically diverse bacteria. Proc. Natl Acad. Sci. 107 20547882 10.1073/pnas.1001513107 PMC2900643 125. Prasad SB Verma AK Cantharidin-mediated ultrastructural and biochemical changes in mitochondria lead to apoptosis and necrosis in murine Dalton’s lymphoma Microsc. Microanal. 2013 19 1377 1394 10.1017/S143192761301324X 24029497 Prasad, S. B. & Verma, A. K. Cantharidin-mediated ultrastructural and biochemical changes in mitochondria lead to apoptosis and necrosis in murine Dalton’s lymphoma. Microsc. Microanal. 19 24029497 10.1017/S143192761301324X 126. Zhao Y SoNar, a highly responsive NAD+/NADH sensor, allows high-throughput metabolic screening of anti-tumor agents Cell Metab. 2015 21 777 789 10.1016/j.cmet.2015.04.009 25955212 PMC4427571 Zhao, Y. et al. SoNar, a highly responsive NAD+/NADH sensor, allows high-throughput metabolic screening of anti-tumor agents. Cell Metab. 21 25955212 10.1016/j.cmet.2015.04.009 PMC4427571 127. Dettner K Occurrence of terpene anhydride Palasonin and Palasoninimide in blister beetle Hycleus lunata (Coleoptera: Meloidae) Biochem. Syst. Ecol. 2003 31 203 205 10.1016/S0305-1978(02)00069-8 Dettner, K. et al. Occurrence of terpene anhydride Palasonin and Palasoninimide in blister beetle Hycleus lunata (Coleoptera: Meloidae). Biochem. Syst. Ecol. 31 128. Lang, E. & Lang, F. Triggers, inhibitors, mechanisms, and significance of eryptosis: the suicidal erythrocyte death. Biomed Res. Int 2015 10.1155/2015/513518 PMC4364016 25821808 129. Rivero-Pino F Guadix A Guadix EM Identification of novel dipeptidyl peptidase IV and α-glucosidase inhibitory peptides from Tenebrio molitor Food Funct. 2021 12 873 880 10.1039/D0FO02696D 33410437 Rivero-Pino, F., Guadix, A. & Guadix, E. M. Identification of novel dipeptidyl peptidase IV and α-glucosidase inhibitory peptides from Tenebrio molitor. Food Funct. 12 33410437 10.1039/d0fo02696d 130. Zielińska E Baraniak B Karaś M Identification of antioxidant and anti-inflammatory peptides obtained by simulated gastrointestinal digestion of three edible insects species (Gryllodes sigillatus, Tenebrio molitor, Schistocerca gragaria) Int. J. Food Sci. Technol. 2018 53 2542 2551 10.1111/ijfs.13848 Zielińska, E., Baraniak, B. & Karaś, M. Identification of antioxidant and anti-inflammatory peptides obtained by simulated gastrointestinal digestion of three edible insects species (Gryllodes sigillatus, Tenebrio molitor, Schistocerca gragaria). Int. J. Food Sci. Technol. 53 131. Zielińska E Karaś M Baraniak B Jakubczyk A Evaluation of ACE, α-glucosidase, and lipase inhibitory activities of peptides obtained by in vitro digestion of selected species of edible insects Eur. Food Res. Technol. 2020 246 1361 1369 10.1007/s00217-020-03495-y Zielińska, E., Karaś, M., Baraniak, B. & Jakubczyk, A. Evaluation of ACE, α-glucosidase, and lipase inhibitory activities of peptides obtained by in vitro digestion of selected species of edible insects. Eur. Food Res. Technol. 246 132. Tang J-J Dopamine derivatives from the insect Polyrhachis dives as inhibitors of ROCK1/2 and stimulators of neural stem cell proliferation Tetrahedron 2014 70 8852 8857 10.1016/j.tet.2014.09.095 Tang, J.-J. et al. Dopamine derivatives from the insect Polyrhachis dives as inhibitors of ROCK1/2 and stimulators of neural stem cell proliferation. Tetrahedron 70 133. Shi Y-N Bioactive compounds from the insect Aspongopus chinensis Bioorg. Med. Chem. Lett. 2014 24 5164 5169 10.1016/j.bmcl.2014.09.083 25442305 Shi, Y.-N. et al. Bioactive compounds from the insect Aspongopus chinensis. Bioorg. Med. Chem. Lett. 24 25442305 10.1016/j.bmcl.2014.09.083 134. de Carvalho FM Brazilian red propolis: Extracts production, physicochemical characterization, and cytotoxicity profile for antitumor activity Biomolecules 2020 10 726 10.3390/biom10050726 32384801 PMC7277404 de Carvalho, F. M. et al. Brazilian red propolis: Extracts production, physicochemical characterization, and cytotoxicity profile for antitumor activity. Biomolecules 10 32384801 10.3390/biom10050726 PMC7277404 135. Arbiser JL Solenopsin, the alkaloidal component of the fire ant (Solenopsis invicta), is a naturally occurring inhibitor of phosphatidylinositol-3-kinase signaling and angiogenesis Blood 2007 109 560 565 10.1182/blood-2006-06-029934 16990598 PMC1785094 Arbiser, J. L. et al. Solenopsin, the alkaloidal component of the fire ant (Solenopsis invicta), is a naturally occurring inhibitor of phosphatidylinositol-3-kinase signaling and angiogenesis. Blood 109 16990598 10.1182/blood-2006-06-029934 PMC1785094 136. Zhang Y Molecular mechanisms of novel peptides from silkworm pupae that inhibit α-glucosidase Peptides 2016 76 45 50 10.1016/j.peptides.2015.12.004 26724364 Zhang, Y. et al. Molecular mechanisms of novel peptides from silkworm pupae that inhibit α-glucosidase. Peptides 76 26724364 10.1016/j.peptides.2015.12.004 137. Kong W-H Antiobesity effects and improvement of insulin sensitivity by 1-deoxynojirimycin in animal models J. Agric. Food Chem. 2008 56 2613 2619 10.1021/jf073223i 18363357 Kong, W.-H. et al. Antiobesity effects and improvement of insulin sensitivity by 1-deoxynojirimycin in animal models. J. Agric. Food Chem. 56 18363357 10.1021/jf073223i 138. Liu S Antioxidant activity and phenolic compounds of Holotrichia parallela Motschulsky extracts Food Chem. 2012 134 1885 1891 10.1016/j.foodchem.2012.03.091 23442634 Liu, S. et al. Antioxidant activity and phenolic compounds of Holotrichia parallela Motschulsky extracts. Food Chem. 134 23442634 10.1016/j.foodchem.2012.03.091 139. Pettit GR Meng Y Herald DL Knight JC Day JF Antineoplastic Agents. 553. The Texas Grasshopper Brachystola m agna J. Nat. Prod. 2005 68 1256 1258 10.1021/np0402367 16124772 PMC3251507 Pettit, G. R., Meng, Y., Herald, D. L., Knight, J. C. & Day, J. F. Antineoplastic Agents. 553. The Texas Grasshopper Brachystola m agna. J. Nat. Prod. 68 16124772 10.1021/np0402367 PMC3251507 140. Hall F Reddivari L Liceaga AM Identification and characterization of edible cricket peptides on hypertensive and glycemic in vitro inhibition and their anti-inflammatory activity on RAW 264.7 macrophage cells Nutrients 2020 12 3588 10.3390/nu12113588 33238450 PMC7700588 Hall, F., Reddivari, L. & Liceaga, A. M. Identification and characterization of edible cricket peptides on hypertensive and glycemic in vitro inhibition and their anti-inflammatory activity on RAW 264.7 macrophage cells. Nutrients 12 33238450 10.3390/nu12113588 PMC7700588 ",
  "metadata": {
    "Title of this paper": "Identification and characterization of edible cricket peptides on hypertensive and glycemic in vitro inhibition and their anti-inflammatory activity on RAW 264.7 macrophage cells",
    "Journal it was published in:": "NPJ Science of Food",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12475101/"
  }
}