{
  "title": "Paper_219",
  "abstract": "pmc Discov Nano Discov Nano 4402 discovernano Discover Nano 2731-9229 Springer PMC12488552 PMC12488552.1 12488552 12488552 41032182 10.1186/s11671-025-04280-0 4280 1 Review SERS-guided photodynamic therapy: pioneering strategies in advanced cancer diagnosis and treatment Jaikumar Tharun 1 George Sharon 1 Saju Hendry 1 Raj Reshma 1 Nisarga R. 1 Sontakke Samruddhi 1 Sangshetti Jaiprakash jnsangshetti@rediffmail.com 2 Prakash Jaya jayap@iisc.ac.in 3 Arote Rohidas B. rohidas.arote@jainuniversity.ac.in 1 1 https://ror.org/01cnqpt53 grid.449351.e 0000 0004 1769 1282 Centre for Nano and Material Sciences, Jain University, 2 3 https://ror.org/04dese585 grid.34980.36 0000 0001 0482 5067 Department of Instrumentation and Applied Physics, Indian Institute of Science, 1 10 2025 12 2025 20 1 478452 171 23 1 2025 4 6 2025 01 10 2025 03 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Abstract Cancer remains a leading cause of mortality worldwide, and while advances in conventional therapies such as chemotherapy, radiotherapy, and targeted therapies have improved patient outcomes, these treatments often fail to meet the demand for precision and specificity. Many current therapies struggle with limitations such as non-specific targeting, drug resistance, and significant side effects, often leading to incomplete tumor eradication and damage to surrounding healthy tissues. The urgent need for more precise, minimally invasive, and efficient cancer treatment strategies has paved the way for novel therapeutic approaches. Cancer theranostics has evolved exceptionally by incorporating new diagnostic tools that ultimately improve the therapeutic outcome of the treatment. Surface Enhanced Raman Spectroscopy (SERS)-guided photodynamic therapy (PDT) is rapidly gaining attention as a highly sophisticated modality in cancer theranostics, offering a dual advantage of enhanced diagnostic precision and effective therapeutic action. SERS, an ultra-sensitive molecular imaging technique, provides real-time, high-resolution detection of cancer biomarkers, enabling precise tumor localization and characterization. SERS-based theranostic probes can show potential results in both in-vivo and in-vitro studies. Herein this review critically discusses the key roles of SERS during the PDT treatment and also focuses on providing brief information on the fundamentals of both SERS and PDT. In combination with PDT, which selectively destroys cancer cells through photosensitizer activation under light exposure, SERS-guided PDT ensures a targeted therapeutic approach that minimizes damage to surrounding healthy tissues and reduces side effects. Graphical abstract  Keywords Surface-enhanced Raman spectroscopy Photodynamic therapy Cancer Theranostics Multimodal probes Sensing Cellular imaging Monitoring treatment pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Science+Business Media, LLC, part of Springer Nature 2025 Introduction Cancer is a multifactorial and multifaceted chronic disease that is considered a global issue. According to the World Health Organization (WHO), cancer is one of the leading causes of death and it is estimated that by 2040 the annual cases could surge up to 28.9 million [ 1 2 3 1 4 5 6 Fig. 1 Overview of various treatment modalities available for cancer theranostics. The figure depicts the comprehensive and multifaceted approach to cancer diagnosis and treatment, highlighting advancements and the importance of personalized medicine in improving patient outcomes Accounting for the limitations of conventional therapies, huge efforts have been implemented to develop state-of-the-art strategies which overcome complex treatments and severe side effects. Recently, nanomaterials have been used to diagnose and treat cancer due to their tunability and ability to penetrate the tumor by enhanced permeation and retention effect (EPR) [ 5 7 8 9 11 In phototherapies PDT has gained worldwide recognition due to its non-invasive and cost-effective procedure, and lesser post-treatment care time [ 12 13 PDT can be combined with other techniques for greater efficacy, therapeutic modalities like immunotherapy, chemotherapy, radiation therapy and surgery have improved results when combined with PDT [ 14 15 16 In the courtroom of cancer theranostics, imaging and monitoring techniques are the primary evidence or visual testimony for rendering a verdict, thus the results from these techniques must be reliable and precise. Early diagnosis and specific targeting hinges on the recognition of over-expressive biomolecules which serve as a biomarker for disease stratification [ 17 18 19 Currently, non-invasive or minimally invasive imaging methods are encouraged for cancer diagnosis and early detection. SERS has proved to be an excellent imaging, sensing and monitoring technique in the biomedical field due to its unique molecular fingerprinting, high sensitivity and multiplexing capabilities [ 20 21 In recent years, SERS has been used as a monitoring and imaging tool for phototherapies and there are numerous studies on SERS-guided photothermal therapy (PTT) and PDT, but as far as we know, there have been very few literature reviews specifically addressing SERS-guided PDT. So in this review, we start by providing an overview of PDT and SERS, proceed to assess the possibilities of using SERS during PDT, and finally provide future perspectives to improve the current limitations. Photodynamic therapy for cancer treatment Light as a tool for treating diseases dates back over 4000 years when ancient Indian, Egyptian and Chinese civilizations used it to treat various diseases like skin cancer, psoriasis and other skin diseases [ 22 23 24 25 26 27 28 29 30 31 32 PDT mechanism on tumor In photoreactions, the key stages are light absorption and energy transfer (Fig. 2 1 33 3 2 2 • 3 2 1 2 13 33 34 Fig. 2 Schematic illustration of PDT and its mechanisms of tumor destruction. The diagram depicts the process of PDT, where a PS is administered and preferentially accumulates in tumor cells. a b The pathways are simultaneous and highly dependent on the PS used; hence the careful choice of PS is pivotal for effective treatment [ 35 34 2 35 37 Direct tumor killing Cytotoxic radicals can cause direct cellular damage by apoptotic (programmed) pathways and necrosis (non-programmed) pathways. Generally, a high dosage of light can enhance necrosis ablation [ 34 34 38 −2 39 40 41 32 42 43 Vascular damage Cutting off the supply of nutrients to the tumor cells is a promising approach to stop the proliferation, therefore targeting the blood vessels connected to the tumor cells, localizing the PS to damage the vessels (vascular effect) and blocking the oxygen supply of the tumor cell is the pathway for long term tumor control. The choice of PS paves the way for different destructive mechanisms like thrombus formation, vascular leakage and blood flow stasis during PDT [ 33 40 44 36 45 36 Immune response Compared to the other two mechanisms the immune response is not spontaneous but it can lead to long-term benefits with prolonged post-treatment effects on the whole body. PDT can either trigger or suppress the immune system. For instance, during PDT treatment, it produces inflammatory molecules to signal the immune system. Neutrophils, which are abundant in the body are the first cells to respond when methylene blue PS is used. Even though they get adhered to the treated site their myeloperoxidase activity doesn’t get altered but their ROS production increases [ 37 46 13 47 48 50 37 46 33 40 48 Role of photosensitizer The PS is the main pillar of support to determine the therapeutic outcome of the PDR. Hence, PS with great photophysical, photochemical and better pharmacokinetics are ideal for improving the efficiency of photoreactions. Parameters such as tumor uptake kinetics, toxicity under dark conditions, side effects to nearby healthy cells and amphilicity nature of the moiety are crucial when choosing the PS that will be used during in vivo and in vitro studies [ 41 51 1 Table 1 Pros and cons of different generations of photosensitizers Type of photosensitizers Pros Cons First generation PS • Simple synthesis • Effective tumor destruction • Negligible dark toxicity • Intravenous dosage formulation Example: Photofrin • High dosage requirement • Cannot absorb higher wavelength light • Prolong accumulation on the cells • Off-target effects • High photobleaching Second generation PS • Longer wavelength absorption • Better selectivity • Less photobleaching • Lower retention on the tissues • Negligible dark toxicity Example: Temoporfin • Complex synthesis • Limited clinical validation • Limited availability • Limited water solubility Third generation PS • Superior selectivity • Improved pharmacokinetics • Longer wavelength absorption • Multimodal functionality • Prevents unwanted side reactions • Personalized and tailored treatment Example: Ce6 tumor-targeting nanoparticles • Limited clinical validation • Toxicity due to the carrier used • Complex synthesis • Cost of production • Not well established hence lower availability First-generation PS are generally tetrapyrrole compounds like porphyrin and hematoporphyrin derivatives (HPD). They are known for their high absorbance of visible light and water solubility. Clinically they are used to treat the brain, lungs, skin, colorectal and other carcinomas. Photofrin (a purified form of HPD) was the first PS to be clinically approved as a photoactive moiety for treating cancer [ 52 34 Compared to the first generation there has been a lot of improvement in the structure and composition of the second-generation PS. Porphyrinoid compounds and non-porphyrinoid compounds like benzoporphyrins, anthraquinones, chlorins, phenothiazinium dyes, psoraleans, phthalocyanines, protoporphyrin IX (PpIX) and other macrocyclic structures are collectively labelled as second-generation PS. They have advantages such as higher selectivity, lower retention on the skin and less photobleaching than their predecessor compounds [ 53 34 Some commercially available PS are hydrophilic, while others are hydrophobic. Compounds that contain a porphyrin ring backbone such as chlorin, temoporfin, PpIX, etc. are hydrophobic. PS such as aminolevulinic acid (ALA), and mono-L-aspartyl chlorin e6 (MACE), are highly hydrophilic. However, it’s known that hydrophobic nature allows the PS to penetrate the cell membrane and locate sub-cellular components. High hydrophobicity can cause complications in biodistribution and photophysical properties ultimately lowering its efficacy. Hence the necessary substitution on the frame structure can make the PS amphiphilic to solve the imposed drawbacks [ 40 54 55 34 51 56 To obtain highly selective, reduced adverse effects and improved pharmacokinetics, researchers developed the third-generation PS [ 57 58 61 62 63 Limitations and possible improvements of PDT For a PDR to orchestrate, we need essential components: light, PS and oxygen. However, it is intriguing to observe that the essential components that are responsible for its success can also limit its efficacy. Hence, careful choice of a light source, tumor environment and adequate PS can be the right move towards obtaining potential therapeutic results. Light used during PDR plays an important role in exciting the PS moiety in a light-induced reaction. So, the choice of light source is dependent on the PS used. Generally, the penetration ability of light depends on its wavelength and tissue components. It is to be noted that sub-cellular components and other metalloproteins in the body tend to absorb, scatter, reflect or transmit light [ 64 66 67 68 69 Oxygen is a vital component of PDT and the efficacy is also determined by the concentration of oxygen available in the tumour tissues. Hypoxia regions of the tumor where deficiency of oxygen is observed can cause complications during the PDT pathway. Hence combination with hyperbaric oxygen (HBO 2 70 66 Apart from absorbing light and reacting with oxygen to produce cytotoxic radicals, PS can be used for imaging, targeting and monitoring the tumor [ 71 40 57 Other than conventional methods to improve the existing limitations, several more novel strategies can be implemented to enhance the PDR outcome. Specific targeting of mitochondria [ 72 73 74 75 76 77 Role of monitoring and imaging in PDT The cornerstone of improving the accuracy of PDT is the ability to predict early treatment planning and post and pre-treatment monitoring. As discussed previously imaging tools help in the laboratory as well as clinical research. They aid in predicting the PDT mechanism, PS localization, organ/vascular interactions, cell death monitoring, photobleaching and many more. Generally, the assessment of structural, functional and molecular imaging information regarding the tumor, tumor microenvironment (TME) and biomarkers is great for pre-treatment planning, monitoring and post-treatment follow-ups (Fig. 3 18 78 79 18 80 4 81 82 Fig. 3 Schematic matrix diagram depicting the roles of different imaging types and their functions in various steps of treatment. The matrix highlights how various imaging modalities, such as MRI, computed tomography, PET, and ultrasound, contribute to distinct phases of the treatment process, including diagnosis, treatment planning, treatment delivery, and follow-up. Each cell in the matrix illustrates specific applications of imaging modalities. This comprehensive matrix underscores the importance of multimodal imaging in enhancing the precision and effectiveness of cancer treatment [ 18 Surface-enhanced Raman spectroscopy for cancer diagnosis Light scattering can be broadly classified into two types elastic and inelastic (Fig. 4 4 0 0 83 84 85 86 87 88 89 90 91 92 Fig. 4 Illustration of different mechanisms of light scattering and enhancement in SERS. The diagram demonstrates the following key concepts: a b c SERS mechanisms The first accepted SERS enhancement mechanism is electromagnetic enhancement (EM), which is the major contributor to the Raman signal enhancement factor (10 10 11 93 4 94 95 7 8 96 At the same time, another SERS enhancement mechanism was also accepted which is the chemical enhancement (CM). The CM is viewed as the change in the Raman polarizability tensor of an analyte upon adsorption onto the metal surface due to the charge transfer (CT) mechanism [ 97 2 3 98 99 (Fig. 4 F 97 100 SERS substrates and detection strategies We have discussed previously that substrate plays an important role in the enhancement factor of Raman signals, hence designing an optimal substrate with high reproducibility and reliability for a specific application is always crucial. Over a few decades, researchers have developed various plasmonic substrates and non-plasmonic materials such as carbon-based materials, metal oxides, semiconductors and polymers for sensing and disease diagnosis [ 101 103 85 94 Colloidal substrates are frequently used in SERS applications due to their low cost and simple fabrication techniques. Additionally, colloidal SERS substrates account for simpler sample manipulation and faster analysis than solid substrates [ 104 105 106 106 107 106 108 109 109 106 110 On the other hand, the first-ever report by Yamada et al. [ 111 101 112 101 113 So far, we have seen the types of substrates used for SERS enhancement and now let’s delve into the different types of detection strategies used. There are two ways of detection using SERS: label-free and labelled detection [ 114 Label-free detection is a simple strategy where the analyte is in direct contact with the substrate, so the signals for the spectrometer are the original fingerprint of the analyte. This strategy has great scope in biomedical applications such as determining protein structures and monitoring biological mechanisms in the cells [ 114 115 116 117 The second strategy is labelled detection using SERS. Generally, the labelled strategy is subdivided into two types, labelled substrate and SERS tags. The labelled substrate is where the substrate is functionalized with specific biorecognition molecules like aptamers or antibodies to specifically bind to the target analyte for quantitative reports. Whereas SERS tags are colloidal substrates which are nanostructures that are functionalized with Raman reporters and directly mixed with the target analyte [ 102 118 89 119 120 122 103 123 Chemometrics and SERS Improving signal reliability in SERS is a pivotal need during detection and early diagnosis. Keeping in mind that SERS signals are highly sensitive and can be easily affected by other biomolecules in complex media, hence to solve this issue the use of functionalisation of SERS probes and/or utilization of chemometric tools is implemented. Here more focus is on chemometric techniques since we have already discussed the functionalization of SERS probes previously. Chemometrics are statistical methods which interpret complex data, signal processing, and discriminant datasets [ 91 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 SERS for cancer detection It is clear that the survival rate of patients is high with early detection of cancer, however considering the recent advancements in treatment and diagnosis, most cases are still detected only when the tumour spreads to other parts of the body. There is a need for precise and advanced techniques to tackle this problem. Techniques such as SERS can be used to detect cancer (Fig. 5 141 142 142 Fig. 5 Schematic diagram illustrating the process of using SERS for detecting cancer. This schematic highlights the specificity, sensitivity, and non-invasive nature of SERS as a powerful diagnostic tool for early cancer detection In-vitro SERS studies In-vitro SERS detection has shown promising growth and development due to its molecular fingerprinting ability and highly sensitive detection of cancer biomarkers. Both labelled and label-free approaches can be used for detecting the active molecule in a laboratory setting. Over the past years, research has delved towards developing SERS-active materials for monitoring cell death and detecting overexpressed biomarkers. A few reports (Table 2 143 2 144 145 6 6 146 147 148 In-vivo SERS studies In vivo SERS detection for cancer offers real-time, non-invasive diagnosis of the tumors. SERS probes designed for in vivo detection offer several advantages like, multiplex detection capacity, stable signals without photobleaching, superior selectivity with active targeting and low auto-fluorescence background [ 115 149 150 151 152 However, the challenges and limitations of using SERS have hindered its widespread adoption for cancer detection and diagnosis in clinical practice. Some common difficulties observed are the lack of established protocols, standardization, and reproducibility of signal intensities [ 153 21 154 150 155 From the recent advancements in SERS technology, it is clear that SERS has the potential to improve conventional and commercially available methods [ 156 157 159 Table 2 Examples of SERS-based cancer detection SERS active nanostructures Targeted biomarker Analyte source Sensing mode LOD References Fe 3 4 microRNA-10b Exosome SERS assay 1.86 aM [ 160 SiO 2 Sarcosine – SERS 1.76 nM [ 143 anti-B7-H6@ATP@AuNPs B7-H6 Blood serum SERS immunosensor 10.8 fg mL −1 [ 161 Au/Ag/porous GaN microRNA (miR-K12-5-5p) – SERS 8.84 × 10 −10 [ 162 Au-film deposition PSA and thrombin – SERS-Microfluidics 0.01 ng mL −1 [ 163 Q-structured TiO x EFGR – SERS 1 nM [ 164 Cu 2 Exosome Serum SERS immunosensor – [ 165 mF-MoS2 NS microRNA (miR-106a) Serum SERS-Electrochemical 67.44 fM and 248.01 fM [ 166 Au@EBP@Au NR arrays and Au@MBN@Ag NPs 5-HT Serum Ratiometric SERS 4.9 × 10 −9 [ 167 Au-AgNPs microRNA (miR-21) Serum CHA-SERS 0.15 pM [ 168 This table lists various studies demonstrating the use of SERS for identifying and diagnosing different types of cancer, along with the target biomarkers and key findings of each study. The table emphasizes the versatility and efficacy of SERS in detecting various cancer biomarkers, showcasing its potential for early and accurate cancer diagnosis SERS-guided photodynamic therapy During the PDT studies at in vitro or in vivo stages, SERS can generally help in two ways. The first is by imaging the cancer cell and sub-cellular components, and the second is by in situ monitoring of the treatment or the changes in the other internal factors of the tumor. This section delves the advancements and the role of SERS imaging/monitoring in improving treatment planning and real-time outcome assessment. SERS imaging of cell and sub-cellular components Theranostic probes that are used for PDT treatment are functionalized or loaded with PS moiety to generate ROS. Additionally, the complementary fluorescence ability of the PS moiety can be used for fluorescence imaging (FI) of the tumor. However, relying only on FI can hold distinct disadvantages such as poor selectivity, autofluorescence and photobleaching which can affect the reliability of the results. Hence, developing probes with multiple imaging abilities is considered to address the shortcomings of using only a single imaging method. SERS-based imaging can be utilized because of its sensitivity and the ability to generate unique spectral signals [ 169 170 Additionally, the sensitivity of SERS can also improve cancer cell imaging and eliminate false positive results, Zhang et al. [ 171 6 172 −1 173 174 5 −1 6 Fig. 6 A 171 © 2013 WILEY–VCH Verlag GmbH & Co. KGaA, Weinheim. B −1 174 https://creativecommons.org/licenses/by/4.0/ Apart from the metal nanoparticle, the Raman reporter used plays an important role in SERS detection and imaging during the PDT. Conventional Raman reporters like MB, DTTC, DTDC, Rhodamine B (RhB), 2-naphthalenethiol (NPT), and mercaptobenzoic acid (MBA) have sharp Raman signals and when functionalized on the surface of the metal nanoparticle, it can be even used to detect cancer at early stages [ 175 −1 176 −1 Another important criterion for improving the treatment as well as imaging is utilizing the over-expressive biomarker receptors as a target to selectively localize the theranostic probe on the tumor can improve the treatment outcome as well as provide enhanced SERS imaging. However, to selectively target the tumor, functionalization of the nanomaterials with antibodies, aptamers or proteins and functional groups is needed, for example, TAT peptide-functionalization [ 177 178 2 179 Additionally, the increase in the length of the self-assembled nanochain improved the SERS enhancement factor increased. Finally, the SERS detection of the nanoparticle localization was done utilizing the peak at 765, 1064, and 1375 cm −1 180 181 7 Fig. 7 A 181 © 2021 American Chemical Society. B 182 Advanced studies like intracellular imaging and 3D imaging by SERS can be a breakthrough within optical imaging techniques. For example, Simon et al. [ 182 −1 7 183 −1 184 −1 SERS monitoring Monitoring the PDT treatment can provide information regarding the treatment effects, biological mechanism, quantitative analysis, outcome assessment and most importantly the changes in the internal conditions of the TME [ 18 185 186 2 2 −1 −1 2 2 2 2 187 8 Fig. 8 A 188 © 2019 WILEY–VCH Verlag GmbH & Co. KGaA, Weinheim. B A B C 187 https://creativecommons.org/licenses/by/4.0/ C 190 As discussed, earlier plasmonic nanostructures are widely explored in the field of SERS imaging and monitoring however, the recent advancements in 2D non-plasmonic nanostructure have paved the way towards SERS sensing and monitoring of PDT treatment because of their high stability, lower cost and better selectivity. For example, Liu et al. [ 188 −1 −1 8 189 −1 −1 −1 Recently, transition metal complexes like cyclometalated iridium have been used for SERS sensing and PDT because of their solubility and the ability to generate ROS, for example, Shanmughan et al. [ 191 −1 192 −1 The pH dysregulation in the TME due to the Warburg effect is associated with tumor progression and metastasis. Monitoring the pH changes during the PDT is beneficial to understand the intracellular changes and dynamics mechanisms. SERS-based real-time pH monitoring can provide feedback on the changes in TME pH during PDT, which is valuable information for precise dosimetry. For example, Yue et al. [ 193 −1 194 −1 190 8 In another work, Jibin et al. [ 195 −1 −1 −1 Monitoring the intratumor oxygen stress and predicting the catalytic pathways of ROS damage to tumors during the PDT process is vital information required to gain insight into the therapeutic mechanism. However, in some cases, the ROS generated can be neutralized by some reducing species in the TME to establish the equilibrium of the cell. Hence, to tackle this problem nanoparticles with artificial enzyme-like activity capable of producing ROS and depleting reducing species are needed to improve the efficacy of the treatment. Li et al. [ 196 −1 2 2 9 2 2 9 9 Fig. 9 A 196 https://creativecommons.org/licenses/by/4.0/ B 197 https://creativecommons.org/licenses/by/4.0/ Similar to early detection of cancer, outcome assessments like cell survival and follow-up are both potential information which can be used to predict the efficacy of the treatment and quantify the resistant cells after PDT. However, very few protocols are used to investigate the post-treatment changes of the treated cancer cells. For example, Veloso et al. [ 197 −1 −1 9 −1 −1 9 SERS and PDT are not restricted to cancer treatment and diagnosis, they are also utilized in pathogen sensing and anti-bacterial/anti-viral PDT as well. For example, Chia et al. [ 198 −1 S. aureus 2 −2 199 200 S. aureus, E. coli 201 202 3 Table 3 Summary of research reports published on SERS-guided PDT Material Cell line Role of SERS Raman reporter Significant peaks Remarks References Cyclometalated iridium complex (III) HepG2 Monitoring the NADH concentration Cell death evaluation – 1042 cm −1 LOD of NADH was 15 pM Apoptotic cell death during PDT was confirmed by SERS [ 191 Cyclometalated iridium complex (III) MCF-7 To track the apoptotic events Monitoring the cyt c release – 2129 cm −1 Apoptotic mechanism was confirmed with help of SERS and Annexin V-FITC [ 192 Gold Nanorod (GNR) with FA, PpIX and MBA HeLa To observe the nanodrug internalization and image its distribution on the cell MBA 1077 cm −1 1583 cm −1 The targeting ability of the developed nanodrugs was confirmed by the SERS tracing function [ 183 GNR functionalized with MLS and 4-MPy MCF-7 HepG2 LO2 Monitoring the intramitochondrial pH change 4-MPy 1095 cm −1 pH monitoring by SERS confirmed the unique spectral response of different cell towards PDT [ 193 GNR functionalized with mPEG-SH NLS & RGD B16 Monitoring the molecular dynamics of the nucleus during PDT Cell death evaluation – 602 cm −1 1001 cm −1 829 cm −1 1001 cm −1 PDT time-dependent cell nucleus change mechanism was predicted by SERS [ 187 GNR coated with mSiO 2 MDA-MB-231 Imaging cancer cell – 445 cm −1 1397 cm −1 1624 cm −1 Early detection of cancer cells was achieved using SERS imaging [ 175 SiO 2 BT549 Imaging of cancer cell DTTC – Theranostic probe with both SERS imaging and PDT was developed [ 170 TAT-SiO 2 BT549 Imaging of cancer cell DTDC 1120 cm −1 1150 cm −1 The intracellular imaging was possible using SERS [ 177 SiO 2 HeLa SK-BR-3 Imaging of cancer cell P MBA 1076 cm −1 1580 cm −1 The targeted imaging ability of the developed probe was confirmed by the SERS [ 178 2D Graphitic carbon nitride with RhB labeled peptide U87 Ratiometric monitoring of MMP-9 PDT assessment with SERS imaging RhB 1242 cm −1 1503 cm −1 LOD of MMP-9 was 35 fg mL −1 PDT efficacy was confirmed with ratiometric SERS [ 189 PpIX & DTTC encapsulated silica coated GNR HeLa in vivo detection of nanoparticle accumulation DTTC 508 cm −1 Bimodal detection by SERS and fluorescence was able identify the location of tumor [ 171 CuPu and HG functionalized on 2D hexagonal boron nitride MCF-7 Monitoring miR-21 in different stages of tumor Imaging miR-21 in cancer cells – 1530 cm −1 1367 cm −1 LOD of miR-21 was 0.7fM Monitoring of miR-21 in different stages of tumor helped early detection and treatment planning [ 188 MB-Pluronic loaded Au C-26 To observe the nanodrug distribution on the cell MB 1623 cm −1 SERS imaging and FI was utilized to detect the nanoparticle in 3D level [ 182 MB-loaded SiO 2 CT-26 Imaging of cancer cell MB 446 cm −1 1380 cm −1 1605 cm −1 The single cancer cell imaging was possible using SERS [ 172 SiO 2 CT-26 Imaging of cancer cell MB 450 cm −1 502 cm −1 The intracellular imaging was possible using SERS [ 173 anti-Her2 tagged MB loaded cucurbituril [ 8 SK-BR-3 MCF-7 To observe the nano construct internalization and image its distribution on the cell MB 452 cm −1 1394 cm −1 1623 cm −1 The prepared construct was able to specifically accumulate on the cell surface which was confirmed by SERS [ 181 CS-PpIX-FA conjugated on Au-rGO hybrid MDA-MB-231 DLA in vivo imaging Track DOX release Time dependent changes – 455 cm −1 1340 cm −1 −1 Bimodal detection was able observe the distribution, PDT effect and DOX release to the tumor [ 195 TMPyP4 and DOX coloaded Janus AuNp MCF-7 HEK-293 T Monitoring ATP Conc in cancer cells Imaging of cancer cells DTNB 1327 cm −1 LOD of ATP was 2.3 nM pH dependent drug release was monitored by SERS [ 190 DOX and FA functionalized silver NP MES-SA SKOV-3 Monitor cellular uptake Monitoring DOX release PDT and cell death mechanism – 1453 cm −1 1160 cm −1 240 cm −1 1110 cm −1 pH dependent drug release was monitored. Apoptotic cell death during PDT was confirmed [ 194 Graphitic carbon nitride assembled with CuPc and HA HeLa Imaging of cancer cell in vivo distribution of nanoprobe CuPc 1533 cm −1 The in vitro and in vivo imaging was possible using SERS [ 174 Prussian blue shell Au core functionalized with HA 4T1 Imaging of cancer cell PB 2156 cm −1 The single cancer cell imaging and in vivo imaging was possible using SERS [ 176 Ce6, NPT, FA and HA-HCA functionalized AuNp MCF-7 A549 To detect the probe’s localization on the cancer cell NPT 1380 cm −1 765 cm −1 1067 cm −1 The developed SERS active theranostic probe was able to selectively accumulate on the cancer cells [ 180 Pheo, NPT and HA-HCA functionalized AuNp HeLa To detect the probe’s localization on the cancer cell NPT 1375 cm −1 765 cm −1 1064 cm −1 The developed SERS active theranostic probe was able to selectively accumulate on the cancer cells [ 179 Catalase, TAPP and 3-MPBA functionalized JNP 4T1 Ratiometric Monitoring and quantification of H 2 2 3- MPBA 998 cm −1 882 cm −1 The in-situ detection of H 2 2 [ 186 HA and DOX functionalized Au nano framework MDA-MB-231 Imaging of cancer cell 4-ATP 1085 cm −1 1585 cm −1 The in vitro and in vivo imaging was possible using SERS and photo acoustics [ 184 Nanoemulsions loaded with ClAlP 4T1 Cell death evaluation – 608 cm −1 1231 cm −1 SERS and PCA was used to determine the necrotic cell death mechanism [ 197 Gold core and poly(styrene-alt-maleic acid) shell HeLa Imaging of cancer cell MB 1623 cm −1 SERS imaging and FI was utilized to detect the nanoparticle accumulation [ 203 Gold core and carbon dot shell 4T1 Real time monitoring of catalytic process in PDT TMB 1192 cm −1 1337 cm −1 1611 cm −1 The oxidative stress generated during the PDT was monitored by SERS [ 196 MB and AuNP deposited polylactic acid microneedles – Detecting metabolites of bacteria ( S. aureus Monitoring PS concentration – 735 cm −1 458 cm −1 LOD of MB and was below 200 ppb LOD of S. aureus was 10 2 −2 [ 198 Nc and Van functionalized SiO2 coated Ag@AuNp – To image bacterial strains ( B Subtilis, E. faecium, E. faecalis, E. coli 4-MBA 1075 cm −1 1585 cm −1 SERS imaging was able to demonstrate the binding affinity of nanocomplex [ 199 Ag-Au-Prussian blue nanojujubes with Van – Detecting bacterial strains ( S. aureus, E. coli PB 2150 cm −1 LOD of bacterial strains was 56 CFU/mL [ 200 diethynylarene-linked bis(triaryl borane) cations HEK-293 T A549 WI-38 Sensing ctDNA – 1557 cm −1 −1 SERS sensing of ctDNA was up to 0.1 molar ratio High anti-viral and tumor cells PDT was observed [ 202 This table provides an overview of key studies, including the type of cancer, PS used, SERS substrates, and notable outcomes. This summary highlights the integration of SERS with PDT, showcasing advancements in cancer treatment through enhanced targeting, monitoring, and therapeutic efficacy Future perspective and conclusion This article reviewed the scope of combining SERS and PDT for improved cancer theranostics. While it’s clear that PDT can be a potential therapeutic method for treating cancer, it still requires developments addressing the shortcomings of the PS. Additionally, imaging and monitoring of PDT is a vital factor which should be considered to enhance the understanding of the cellular and therapeutic mechanisms. SERS-based imaging and monitoring have been recently exploited due to their sensitivity and non-invasive methodology. Furthermore, the integration of both SERS and PDT offers researchers the distinct advantages of imaging tumor cells, monitoring subcellular changes, and tracking drug release. However, due to the lack of established standardized protocols, and reproducibility of results, SERS use in clinical studies is still in the preliminary stages. Efforts have been made to optimise the experimental setup, detection strategies and result validation using chemometric tools, implementation of these factors can elevate the clinical translation of SERS-based imaging and monitoring approaches [ 204 205 Apart from discussing the importance of combination therapy (SERS and PDT), this article also provided an overview of the fundamental mechanisms, detection strategies and applications in cancer and pathogen detection using SERS-based approaches. Furthermore, the fundaments and limitations of PDT and the role of imaging and monitoring during PDT treatment were also discussed for a better understanding of the reason for combining both PDT and SERS. Interestingly, multimodal nanoprobes capable of performing multiple therapies and diagnostics are extensively researched due to their ability to provide complementary results which can aid in confirmatory assessment. It is to be noted that the majority of the probes contain PS moiety either loaded or functionalized on the surface of the shell which is useful for generating ROS for treating the tumor, However, the monitoring and imaging with only the fluorescence property of the PS is not sufficient. Hence the development of SERS active PS which can enable SERS detection along with ROS generation with the same wavelength irradiation. This approach can be useful for real-time monitoring of the PS photobleaching which can improve the PS dosimetry [ 206 The efficiency of the SERS for in vivo imaging and monitoring can be improved by utilizing more advanced Raman detectors which are capable of deep tissue imaging and wide field view. Furthermore, combining SERS with chemometrics and artificial intelligence can help discriminate the SERS spectra to refine the complex biochemical changes during the treatment [ 207 The immune system can hinder the SERS-guided PDT nanoprobes therapeutic intervention by assuming they are some foreign substances or even pathogens, hence developed nanoprobe must be engineered with strategies to evade immune system detection. Surface modification with coatings such as PEGylation, carbohydrate and other Biomimetic polymers has shown the cloaking ability to evade the immune system. Additionally, size and morphological changes can play a significant role in evading the immune system. Studies have shown immune suppression (avoid being phagocytosed) while using rod-shaped morphology compared to spherical-shaped. Similarly, a high surface charge on the probe either anionic or cationic is targeted by the immune system. By keeping all these points in mind, the systematic and efficient development of SERS-guided PDT therapeutic probes can perform better [ 208 From our perspective, we believe that the fruitful outcome of the combinational approach of incorporating SERS with PDT active theranostic probes would be when the SERS probe can generate the Multiplexing capability of the biomolecular matrix and in situ monitoring of their changes for understanding the destruction mechanism. Additionally, if the PS moiety used is SERS active then the dosimetry of the PS used can also be calculated. Lastly incorporating chemometric tools and machine learning algorithms improves the reliability and accuracy of the results obtained, developing such SERS active PDT probes and methodologies could be the way forward. In conclusion, SERS can undoubtedly improve the efficacy of the theranostic probe. While it cannot directly enhance the effectiveness of the treatment on the tumor, it can aid the imaging and detection aspect of the tumor cells by monitoring and imaging the subcellular changes. Additionally, it can also help in monitoring the drug delivery and in some case monitor the PS photobleaching during the PDT treatment. Hence this information is crucial and can be used for developing precision and advanced cancer theranostic probes. Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements This work is supported by the Minor Research Project Grants of Jain (Deemed-to-be) University, Bangalore, India. Author contributions TJ and RBA Conceptualized the idea. TJ, SG, HS, RR, NR, and SS did a literature survey and worked on the Manuscript framework. TJ, SG, and HS wrote the initial part of the manuscript. RBA, JP and JS revised the draft manuscript. JP and RBA proofread and supervised the preparation of the original manuscript. All the authors reviewed the manuscript. Funding This research did not receive any specific grant from funding agencies in the public, commercial, or not-for-profit sectors. Data availability No datasets were generated or analysed during the current study. Declarations Ethics approval and consent to participate Not applicable. Consent to publish declaration Not Applicable. Clinical trial number Not Applicable. Competing interests The authors declare no competing interests. References 1. World Health Organization. Cancer [Internet]. 2022. https://www.who.int/news-room/fact-sheets/detail/cancer 2. Crosby D Bhatia S Brindle KM Coussens LM Dive C Emberton M Early detection of cancer Science 1979 375 6586 eaay9040 10.1126/science.aay9040 35298272 Crosby D, Bhatia S, Brindle KM, Coussens LM, Dive C, Emberton M, et al. Early detection of cancer. Science. 1979;375(6586):eaay9040. 10.1126/science.aay9040. 10.1126/science.aay9040 35298272 3. Azarin SM Yi J Gower RM Aguado BA Sullivan ME Goodman AG In vivo capture and label-free detection of early metastatic cells Nat Commun 2015 6 1 8094 10.1038/ncomms9094 26348915 PMC4563812 Azarin SM, Yi J, Gower RM, Aguado BA, Sullivan ME, Goodman AG, et al. In vivo capture and label-free detection of early metastatic cells. Nat Commun. 2015;6(1):8094. 10.1038/ncomms9094. 26348915 10.1038/ncomms9094 PMC4563812 4. Hong SJ Ahn MH Sangshetti JN Arote RB Sugar alcohol-based polymeric gene carriers: synthesis, properties and gene therapy applications Acta Biomater 2019 97 105 115 10.1016/j.actbio.2019.07.029 31326667 Hong SJ, Ahn MH, Sangshetti JN, Arote RB. Sugar alcohol-based polymeric gene carriers: synthesis, properties and gene therapy applications. Acta Biomater. 2019;97:105–15. 10.1016/j.actbio.2019.07.029. 31326667 10.1016/j.actbio.2019.07.029 5. Kim YD Pofali P Park TE Singh B Cho K Maharjan S Gene therapy for bone tissue engineering Tissue Eng Regen Med. 2016 13 2 111 125 10.1007/s13770-016-9063-8 30603391 PMC6170855 Kim YD, Pofali P, Park TE, Singh B, Cho K, Maharjan S, et al. Gene therapy for bone tissue engineering. Tissue Eng Regen Med. 2016;13(2):111–25. 10.1007/s13770-016-9063-8. 30603391 10.1007/s13770-016-9063-8 PMC6170855 6. Shin JY Lim HT Minai-Tehrani A Noh MS Kim JE Kim JH Aerosol delivery of beclin1 enhanced the anti-tumor effect of radiation in the lungs of K-rasLA1 mice J Radiat Res 2012 53 4 506 515 10.1093/jrr/rrs005 22843615 PMC3393344 Shin JY, Lim HT, Minai-Tehrani A, Noh MS, Kim JE, Kim JH, et al. Aerosol delivery of beclin1 enhanced the anti-tumor effect of radiation in the lungs of K-rasLA1 mice. J Radiat Res. 2012;53(4):506–15. 10.1093/jrr/rrs005. 22843615 10.1093/jrr/rrs005 PMC3393344 7. Soares S Sousa J Pais A Vitorino C Nanomedicine: principles, properties, and regulatory issues Front Chem 2018 10.3389/fchem.2018.00360 30177965 PMC6109690 Soares S, Sousa J, Pais A, Vitorino C. Nanomedicine: principles, properties, and regulatory issues. Front Chem. 2018. 10.3389/fchem.2018.00360. 30177965 10.3389/fchem.2018.00360 PMC6109690 8. Fatima SW Khare SK Benefits and challenges of antibody drug conjugates as novel form of chemotherapy J Control Release 2022 341 555 565 10.1016/j.jconrel.2021.12.013 34906604 Fatima SW, Khare SK. Benefits and challenges of antibody drug conjugates as novel form of chemotherapy. J Control Release. 2022;341:555–65. 10.1016/j.jconrel.2021.12.013. 34906604 10.1016/j.jconrel.2021.12.013 9. Abedin MR Powers K Aiardo R Barua D Barua S Antibody–drug nanoparticle induces synergistic treatment efficacies in HER2 positive breast cancer cells Sci Rep 2021 11 1 7347 10.1038/s41598-021-86762-6 33795712 PMC8016985 Abedin MR, Powers K, Aiardo R, Barua D, Barua S. Antibody–drug nanoparticle induces synergistic treatment efficacies in HER2 positive breast cancer cells. Sci Rep. 2021;11(1):7347. 10.1038/s41598-021-86762-6. 33795712 10.1038/s41598-021-86762-6 PMC8016985 10. Florentsen CD Moreno-Pescador GS Kjær A Oddershede LB Bendix PM Plasmonic material engineering for targeted therapeutics Adv Opt Mater. 2020 10.1002/adom.202000616 Florentsen CD, Moreno-Pescador GS, Kjær A, Oddershede LB, Bendix PM. Plasmonic material engineering for targeted therapeutics. Adv Opt Mater. 2020. 10.1002/adom.202000616. 11. Taheri-Ledari R Zhang W Radmanesh M Cathcart N Maleki A Kitaev V Plasmonic photothermal release of docetaxel by gold nanoparticles incorporated onto halloysite nanotubes with conjugated 2D8-E3 antibodies for selective cancer therapy J Nanobiotechnol 2021 19 1 239 10.1186/s12951-021-00982-6 PMC8359560 34380469 Taheri-Ledari R, Zhang W, Radmanesh M, Cathcart N, Maleki A, Kitaev V. Plasmonic photothermal release of docetaxel by gold nanoparticles incorporated onto halloysite nanotubes with conjugated 2D8-E3 antibodies for selective cancer therapy. J Nanobiotechnol. 2021;19(1):239. 10.1186/s12951-021-00982-6. 10.1186/s12951-021-00982-6 PMC8359560 34380469 12. Sobhani N Samadani AA Implications of photodynamic cancer therapy: an overview of PDT mechanisms basically and practically J Egypt Natl Canc Inst. 2021 10.1186/s43046-021-00093-1 34778919 Sobhani N, Samadani AA. Implications of photodynamic cancer therapy: an overview of PDT mechanisms basically and practically. J Egypt Natl Canc Inst. 2021. 10.1186/s43046-021-00093-1. 34778919 10.1186/s43046-021-00093-1 13. Dolmans DEJGJ Fukumura D Jain RK Photodynamic therapy for cancer Nat Rev Cancer 2003 3 5 380 387 10.1038/nrc1071 12724736 Dolmans DEJGJ, Fukumura D, Jain RK. Photodynamic therapy for cancer. Nat Rev Cancer. 2003;3(5):380–7. 10.1038/nrc1071. 12724736 10.1038/nrc1071 14. Zhang Q Li L Photodynamic combinational therapy in cancer treatment JBUON 2018 23 3 561 567 30003719 Zhang Q, Li L. Photodynamic combinational therapy in cancer treatment. JBUON. 2018;23(3):561–7. 30003719 15. Pandey SK Gryshuk AL Sajjad M Zheng X Chen Y Abouzeid MM Multimodality agents for tumor imaging (PET, fluorescence) and photodynamic therapy. A possible, “see and treat” approach J Med Chem 2005 48 20 6286 95 10.1021/jm050427m 16190755 Pandey SK, Gryshuk AL, Sajjad M, Zheng X, Chen Y, Abouzeid MM, et al. Multimodality agents for tumor imaging (PET, fluorescence) and photodynamic therapy. A possible, “see and treat” approach. J Med Chem. 2005;48(20):6286–95. 10.1021/jm050427m. 16190755 10.1021/jm050427m 16. Li L Jiang R Yu J Li M A near-infrared II Photo-triggered multifunctional plasmonic hyperthermia immunomodulator for SERS-guided combination cancer immunotherapy Small 2025 10.1002/smll.202409154 39564687 Li L, Jiang R, Yu J, Li M. A near-infrared II Photo-triggered multifunctional plasmonic hyperthermia immunomodulator for SERS-guided combination cancer immunotherapy. Small. 2025. 10.1002/smll.202409154. 39564687 10.1002/smll.202409154 17. Guerrini L Pazos-Perez N Garcia-Rico E Alvarez-Puebla R Cancer characterization and diagnosis with SERS-encoded particles Cancer Nanotechnol 2017 10.1186/s12645-017-0031-3 Guerrini L, Pazos-Perez N, Garcia-Rico E, Alvarez-Puebla R. Cancer characterization and diagnosis with SERS-encoded particles. Cancer Nanotechnol. 2017. 10.1186/s12645-017-0031-3. 18. Celli JP Spring BQ Rizvi I Evans CL Samkoe KS Verma S Imaging and photodynamic therapy: mechanisms, monitoring, and optimization Chem Rev 2010 110 5 2795 2838 10.1021/cr900300p 20353192 PMC2896821 Celli JP, Spring BQ, Rizvi I, Evans CL, Samkoe KS, Verma S, et al. Imaging and photodynamic therapy: mechanisms, monitoring, and optimization. Chem Rev. 2010;110(5):2795–838. 10.1021/cr900300p. 20353192 10.1021/cr900300p PMC2896821 19. Sarbadhikary P George BP Abrahamse H Recent advances in photosensitizers as multifunctional theranostic agents for imaging-guided photodynamic therapy of cancer Theranostics 2021 10.7150/thno.62479 34522227 PMC8419035 Sarbadhikary P, George BP, Abrahamse H. Recent advances in photosensitizers as multifunctional theranostic agents for imaging-guided photodynamic therapy of cancer. Theranostics. 2021. 10.7150/thno.62479. 34522227 10.7150/thno.62479 PMC8419035 20. Andreou C Kishore SA Kircher MF Surface-enhanced Raman spectroscopy: a new modality for cancer imaging J Nucl Med 2015 10.2967/jnumed.115.158196 26182971 PMC4634711 Andreou C, Kishore SA, Kircher MF. Surface-enhanced Raman spectroscopy: a new modality for cancer imaging. J Nucl Med. 2015. 10.2967/jnumed.115.158196. 26182971 10.2967/jnumed.115.158196 PMC4634711 21. Pérez-Jiménez AI Lyu D Lu Z Liu G Ren B Surface-enhanced Raman spectroscopy: benefits, trade-offs and future developments Chem Sci R Soc Chem 2020 10.1039/d0sc00809e PMC8159237 34122914 Pérez-Jiménez AI, Lyu D, Lu Z, Liu G, Ren B. Surface-enhanced Raman spectroscopy: benefits, trade-offs and future developments. Chem Sci R Soc Chem. 2020. 10.1039/d0sc00809e. 10.1039/d0sc00809e PMC8159237 34122914 22. Daniell MD Hill JS A history of photodynamic therapy Aust N Z J Surg 1991 61 5 340 348 10.1111/j.1445-2197.1991.tb00230.x 2025186 Daniell MD, Hill JS. A history of photodynamic therapy. Aust N Z J Surg. 1991;61(5):340–8. 10.1111/j.1445-2197.1991.tb00230.x. 2025186 10.1111/j.1445-2197.1991.tb00230.x 23. Finsen NR Phototherapy:(1) the chemical rays of light and small-pox, (2) light as a stimulant, (3) the treatment of lupus vulgaris by concentrated chemical rays 1901 London Arnold Finsen NR. Phototherapy:(1) the chemical rays of light and small-pox, (2) light as a stimulant, (3) the treatment of lupus vulgaris by concentrated chemical rays. London: Arnold; 1901. 24. Lipson RL Baldes EJ Gray MJ Hematoporphyrin derivative for detection and management of cancer Cancer 1967 20 12 2255 2257 10.1002/1097-0142(196712)20:12&#x0003c;2255::AID-CNCR2820201229&#x0003e;3.0.CO;2-U 6073903 Lipson RL, Baldes EJ, Gray MJ. Hematoporphyrin derivative for detection and management of cancer. Cancer. 1967;20(12):2255–7. 10.1002/1097-0142(196712)20:12%3c2255::AID-CNCR2820201229%3e3.0.CO;2-U. 6073903 10.1002/1097-0142(196712)20:12<2255::aid-cncr2820201229>3.0.co;2-u 25. Tappeiner H Die photodynamische Erscheinung (Sensibilisierung durch fluoreszierende Stoffe) Ergebnisse der Physiologie 1909 8 1 698 741 10.1007/BF02321096 Tappeiner H. Die photodynamische Erscheinung (Sensibilisierung durch fluoreszierende Stoffe). Ergebnisse der Physiologie. 1909;8(1):698–741. 10.1007/BF02321096. 26. Gunaydin G Gedik ME Ayan S Photodynamic therapy for the treatment and diagnosis of cancer–a review of the current clinical status Front Chem. 2021 10.3389/fchem.2021.686303 34409014 PMC8365093 Gunaydin G, Gedik ME, Ayan S. Photodynamic therapy for the treatment and diagnosis of cancer–a review of the current clinical status. Front Chem. 2021. 10.3389/fchem.2021.686303. 34409014 10.3389/fchem.2021.686303 PMC8365093 27. Turksoy A Yildiz D Akkaya EU Photosensitization and controlled photosensitization with BODIPY dyes Coord Chem Rev 2019 379 47 64 10.1016/j.ccr.2017.09.029 Turksoy A, Yildiz D, Akkaya EU. Photosensitization and controlled photosensitization with BODIPY dyes. Coord Chem Rev. 2019;379:47–64. 10.1016/j.ccr.2017.09.029. 28. Niculescu AG Grumezescu AM Photodynamic therapy—an up-to-date review Appl Sci (Switzerland) 2021 10.3390/app11083626 Niculescu AG, Grumezescu AM. Photodynamic therapy—an up-to-date review. Appl Sci (Switzerland). 2021. 10.3390/app11083626. 29. Lal S Clare SE Halas NJ Nanoshell-enabled photothermal cancer therapy: Impending clinical impact Acc Chem Res 2008 41 12 1842 1851 10.1021/ar800150g 19053240 Lal S, Clare SE, Halas NJ. Nanoshell-enabled photothermal cancer therapy: Impending clinical impact. Acc Chem Res. 2008;41(12):1842–51. 10.1021/ar800150g. 19053240 10.1021/ar800150g 30. Tony LB Phototherapy in cancer prevention and treatment J Cancer Prev Curr Res 2017 10.15406/jcpcr.2017.07.00224 Tony LB. Phototherapy in cancer prevention and treatment. J Cancer Prev Curr Res. 2017. 10.15406/jcpcr.2017.07.00224. 31. Shi H Sadler PJ How promising is phototherapy for cancer? Br J Cancer. 2020 10.1038/s41416-020-0926-3 32587359 PMC7492227 Shi H, Sadler PJ. How promising is phototherapy for cancer? Br J Cancer. 2020. 10.1038/s41416-020-0926-3. 32587359 10.1038/s41416-020-0926-3 PMC7492227 32. Overchuk M Weersink RA Wilson BC Zheng G Photodynamic and photothermal therapies: synergy opportunities for nanomedicine ACS Nano 2023 17 9 7979 8003 10.1021/acsnano.3c00891 37129253 PMC10173698 Overchuk M, Weersink RA, Wilson BC, Zheng G. Photodynamic and photothermal therapies: synergy opportunities for nanomedicine. ACS Nano. 2023;17(9):7979–8003. 10.1021/acsnano.3c00891. 37129253 10.1021/acsnano.3c00891 PMC10173698 33. Allison RR Moghissi K Photodynamic therapy (PDT): PDT mechanisms Clin Endosc 2013 46 1 24 29 10.5946/ce.2013.46.1.24 23422955 PMC3572346 Allison RR, Moghissi K. Photodynamic therapy (PDT): PDT mechanisms. Clin Endosc. 2013;46(1):24–9. 10.5946/ce.2013.46.1.24. 23422955 10.5946/ce.2013.46.1.24 PMC3572346 34. Castano AP Demidova TN Hamblin MR Mechanisms in photodynamic therapy: part one—photosensitizers, photochemistry and cellular localization Photodiagnosis Photodyn Ther 2004 10.1016/S1572-1000(05)00007-4 25048432 PMC4108220 Castano AP, Demidova TN, Hamblin MR. Mechanisms in photodynamic therapy: part one—photosensitizers, photochemistry and cellular localization. Photodiagnosis Photodyn Ther. 2004. 10.1016/S1572-1000(05)00007-4. 25048432 10.1016/S1572-1000(05)00007-4 PMC4108220 35. Austin E Wang JY Ozog DM Zeitouni N Lim HW Jagdeo J Photodynamic therapy: overview and mechanism of action J Am Acad Dermatol 2025 10.1016/j.jaad.2025.02.037 39986394 Austin E, Wang JY, Ozog DM, Zeitouni N, Lim HW, Jagdeo J. Photodynamic therapy: overview and mechanism of action. J Am Acad Dermatol. 2025. 10.1016/j.jaad.2025.02.037. 39986394 10.1016/j.jaad.2025.02.037 36. Fingar VH Vascular effects of photodynamic therapy J Clin Laser Med Surg 1996 14 5 323 8 10.1089/clm.1996.14.323 9612199 Fingar VH. Vascular effects of photodynamic therapy. J Clin Laser Med Surg. 1996;14(5):323–8. 10.1089/clm.1996.14.323. 9612199 10.1089/clm.1996.14.323 37. Castano AP Mroz P Hamblin MR Photodynamic therapy and anti-tumour immunity Nat Rev Cancer 2006 6 7 535 545 10.1038/nrc1894 16794636 PMC2933780 Castano AP, Mroz P, Hamblin MR. Photodynamic therapy and anti-tumour immunity. Nat Rev Cancer. 2006;6(7):535–45. 10.1038/nrc1894. 16794636 10.1038/nrc1894 PMC2933780 38. Castano AP Demidova TN Hamblin MR Mechanisms in photodynamic therapy: part two—cellular signaling, cell metabolism and modes of cell death Photodiagnosis Photodyn Ther 2005 10.1016/S1572-1000(05)00030-X 25048553 PMC4108176 Castano AP, Demidova TN, Hamblin MR. Mechanisms in photodynamic therapy: part two—cellular signaling, cell metabolism and modes of cell death. Photodiagnosis Photodyn Ther. 2005. 10.1016/S1572-1000(05)00030-X. 25048553 10.1016/S1572-1000(05)00030-X PMC4108176 39. Plaetzer K Kiesslich T Krammer B Hammerl P Characterization of the cell death modes and the associated changes in cellular energy supply in response to AlPcS4-PDT Photochem Photobiol Sci 2002 1 3 172 177 10.1039/b108816e 12659513 Plaetzer K, Kiesslich T, Krammer B, Hammerl P. Characterization of the cell death modes and the associated changes in cellular energy supply in response to AlPcS4-PDT. Photochem Photobiol Sci. 2002;1(3):172–7. 10.1039/b108816e. 12659513 10.1039/b108816e 40. Castano AP Demidova TN Hamblin MR Mechanisms in photodynamic therapy: part three—photosensitizer pharmacokinetics, biodistribution, tumor localization and modes of tumor destruction Photodiagnosis Photodyn Ther 2005 10.1016/S1572-1000(05)00060-8 25048669 PMC4108218 Castano AP, Demidova TN, Hamblin MR. Mechanisms in photodynamic therapy: part three—photosensitizer pharmacokinetics, biodistribution, tumor localization and modes of tumor destruction. Photodiagnosis Photodyn Ther. 2005. 10.1016/S1572-1000(05)00060-8. 25048669 10.1016/S1572-1000(05)00060-8 PMC4108218 41. Abrahamse H Hamblin MR New photosensitizers for photodynamic therapy Biochem J 2016 10.1042/BJ20150942 26862179 PMC4811612 Abrahamse H, Hamblin MR. New photosensitizers for photodynamic therapy. Biochem J. 2016. 10.1042/BJ20150942. 26862179 10.1042/BJ20150942 PMC4811612 42. Messmann H Mlkvy P Buonaccorsi G Davies CL MacRobert AJ Bown SG Enhancement of photodynamic therapy with 5-aminolaevulinic acid-induced porphyrin photosensitisation in normal rat colon by threshold and light fractionation studies Br J Cancer 1995 72 3 589 594 10.1038/bjc.1995.378 7669566 PMC2033889 Messmann H, Mlkvy P, Buonaccorsi G, Davies CL, MacRobert AJ, Bown SG. Enhancement of photodynamic therapy with 5-aminolaevulinic acid-induced porphyrin photosensitisation in normal rat colon by threshold and light fractionation studies. Br J Cancer. 1995;72(3):589–94. 10.1038/bjc.1995.378. 7669566 10.1038/bjc.1995.378 PMC2033889 43. Pogue BW Hasan T A theoretical study of light fractionation and dose-rate effects in photodynamic therapy Radiat Res 1997 147 5 551 559 10.2307/3579621 9146700 Pogue BW, Hasan T. A theoretical study of light fractionation and dose-rate effects in photodynamic therapy. Radiat Res. 1997;147(5):551–9. 9146700 10.2307/3579621 44. Fingar VH Wieman TJ Karavolos PS Doak KW Ouellet R van Lier JE The effects of photodynamic therapy using differently substituted zinc phthalocyanines on vessel constriction, vessel leakage and tumor response Photochem Photobiol 1993 58 2 251 258 10.1111/j.1751-1097.1993.tb09557.x 8415918 Fingar VH, Wieman TJ, Karavolos PS, Doak KW, Ouellet R, van Lier JE. The effects of photodynamic therapy using differently substituted zinc phthalocyanines on vessel constriction, vessel leakage and tumor response. Photochem Photobiol. 1993;58(2):251–8. 10.1111/j.1751-1097.1993.tb09557.x. 8415918 10.1111/j.1751-1097.1993.tb09557.x 45. West CML West DC Kumar S Moore JV A Comparison of the sensitivity to photodynamic treatment of endothelial and tumour cells in different proliferative states Int J Radiat Biol 1990 58 1 145 156 10.1080/09553009014551501 1973432 West CML, West DC, Kumar S, Moore JV. A Comparison of the sensitivity to photodynamic treatment of endothelial and tumour cells in different proliferative states. Int J Radiat Biol. 1990;58(1):145–56. 10.1080/09553009014551501. 1973432 10.1080/09553009014551501 46. Dudzik T Domański I Makuch S The impact of photodynamic therapy on immune system in cancer—an update Front Immunol. 2024 10.3389/fimmu.2024.1335920 38481994 PMC10933008 Dudzik T, Domański I, Makuch S. The impact of photodynamic therapy on immune system in cancer—an update. Front Immunol. 2024. 10.3389/fimmu.2024.1335920. 38481994 10.3389/fimmu.2024.1335920 PMC10933008 47. Henderson BW Dougherty TJ How does photodynamic therapy work? Photochem Photobiol 1992 55 1 145 157 10.1111/j.1751-1097.1992.tb04222.x 1603846 Henderson BW, Dougherty TJ. How does photodynamic therapy work? Photochem Photobiol. 1992;55(1):145–57. 1603846 10.1111/j.1751-1097.1992.tb04222.x 48. Tan L Shen X He Z Lu Y The role of photodynamic therapy in triggering cell death and facilitating antitumor immunology Front Oncol 2022 10.3389/fonc.2022.863107 35692783 PMC9184441 Tan L, Shen X, He Z, Lu Y. The role of photodynamic therapy in triggering cell death and facilitating antitumor immunology. Front Oncol. 2022. 10.3389/fonc.2022.863107. 35692783 10.3389/fonc.2022.863107 PMC9184441 49. Krosl G Korbelik M Dougherty G Induction of immune cell infiltration into murine SCCVII tumour by photofrin-based photodynamic therapy Br J Cancer 1995 71 3 549 555 10.1038/bjc.1995.108 7880738 PMC2033617 Krosl G, Korbelik M, Dougherty G. Induction of immune cell infiltration into murine SCCVII tumour by photofrin-based photodynamic therapy. Br J Cancer. 1995;71(3):549–55. 10.1038/bjc.1995.108. 7880738 10.1038/bjc.1995.108 PMC2033617 50. Coutier S Bezdetnaya L Marchal S Melnikova V Belitchenko I Merlin JL Foscan (mTHPC) photosensitized macrophage activation: enhancement of phagocytosis, nitric oxide release and tumour necrosis factor-a-mediated cytolytic activity Br J Cancer 1999 81 37 10.1038/sj.bjc.6690648 10487610 PMC2374281 Coutier S, Bezdetnaya L, Marchal S, Melnikova V, Belitchenko I, Merlin JL, et al. Foscan (mTHPC) photosensitized macrophage activation: enhancement of phagocytosis, nitric oxide release and tumour necrosis factor-a-mediated cytolytic activity. Br J Cancer. 1999;81:37. 10487610 10.1038/sj.bjc.6690648 PMC2374281 51. Lucky SS Soo KC Zhang Y Nanoparticles in photodynamic therapy Chem Rev 2015 10.1021/cr5004198 25602130 Lucky SS, Soo KC, Zhang Y. Nanoparticles in photodynamic therapy. Chem Rev. 2015. 10.1021/cr5004198. 25602130 10.1021/cr5004198 52. Kessel D Photosensitization with derivatives of haematoporphyrin Int J Radiat Biol Relat Stud Phys Chem Med 1986 49 6 901 907 10.1080/09553008514553131 2940198 Kessel D. Photosensitization with derivatives of haematoporphyrin. Int J Radiat Biol Relat Stud Phys Chem Med. 1986;49(6):901–7. 10.1080/09553008514553131. 2940198 10.1080/09553008514553131 53. Zhao X Liu J Fan J Chao H Peng X Recent progress in photosensitizers for overcoming the challenges of photodynamic therapy: from molecular design to application Chem Soc Rev 2021 10.1039/d0cs00173b 33527104 Zhao X, Liu J, Fan J, Chao H, Peng X. Recent progress in photosensitizers for overcoming the challenges of photodynamic therapy: from molecular design to application. Chem Soc Rev. 2021. 10.1039/d0cs00173b. 33527104 10.1039/d0cs00173b 54. Rück A Steiner R Basic reaction mechanisms of hydrophilic and lipophilic photosensitisers in photodynamic tumour treatment Minim Invasive Ther Allied Technol 1998 7 6 503 509 10.3109/13645709809152895 Rück A, Steiner R. Basic reaction mechanisms of hydrophilic and lipophilic photosensitisers in photodynamic tumour treatment. Minim Invasive Ther Allied Technol. 1998;7(6):503–9. 10.3109/13645709809152895. 55. Yvette Konan N Gurny R Allemann E State of the art in the delivery of photosensitizers for photodynamic therapy J Photochem Photobiol B 2002 66 89 10.1016/S1011-1344(01)00267-6 11897509 Yvette, Konan N, Gurny R, Allemann E. State of the art in the delivery of photosensitizers for photodynamic therapy. J Photochem Photobiol B. 2002;66:89. 11897509 10.1016/s1011-1344(01)00267-6 56. Dummin H Cernay T Zimmermann HW Selective photosensitization of mitochondria in HeLa cells by cationic Zn (II) phthalocyanines with lipophilic side-chains J Photochem Photobiol B 1997 37 219 10.1016/S1011-1344(96)07416-7 9085567 Dummin H, Cernay T, Zimmermann HW. Selective photosensitization of mitochondria in HeLa cells by cationic Zn (II) phthalocyanines with lipophilic side-chains. J Photochem Photobiol B. 1997;37:219. 9085567 10.1016/s1011-1344(96)07416-7 57. Escudero A Carrillo-Carrión C Castillejos MC Romero-Ben E Rosales-Barrios C Khiar N Photodynamic therapy: photosensitizers and nanostructures Mater Chem Front 2021 10.1039/d0qm00922a Escudero A, Carrillo-Carrión C, Castillejos MC, Romero-Ben E, Rosales-Barrios C, Khiar N. Photodynamic therapy: photosensitizers and nanostructures. Mater Chem Front. 2021. 10.1039/d0qm00922a. 58. Yoo JW Irvine DJ Discher DE Mitragotri S Bio-inspired, bioengineered and biomimetic drug delivery carriers Nat Rev Drug Discov 2011 10.1038/nrd3499 21720407 Yoo JW, Irvine DJ, Discher DE, Mitragotri S. Bio-inspired, bioengineered and biomimetic drug delivery carriers. Nat Rev Drug Discov. 2011. 10.1038/nrd3499. 21720407 10.1038/nrd3499 59. Alonso MJ Nanomedicines for overcoming biological barriers Biomed Pharmacother 2004 58 3 168 172 10.1016/j.biopha.2004.01.007 15082339 Alonso MJ. Nanomedicines for overcoming biological barriers. Biomed Pharmacother. 2004;58(3):168–72. 10.1016/j.biopha.2004.01.007. 15082339 10.1016/j.biopha.2004.01.007 60. Couvreur P Gref R Andrieux K Malvy C Nanotechnologies for drug delivery: application to cancer and autoimmune diseases Prog Solid State Chem 2006 34 2–4 231 235 10.1016/j.progsolidstchem.2005.11.009 Couvreur P, Gref R, Andrieux K, Malvy C. Nanotechnologies for drug delivery: application to cancer and autoimmune diseases. Prog Solid State Chem. 2006;34(2–4):231–5. 10.1016/j.progsolidstchem.2005.11.009. 61. Mura S Nicolas J Couvreur P Stimuli-responsive nanocarriers for drug delivery Nat Mater 2013 10.1038/nmat3776 24150417 Mura S, Nicolas J, Couvreur P. Stimuli-responsive nanocarriers for drug delivery. Nat Mater. 2013. 10.1038/nmat3776. 24150417 10.1038/nmat3776 62. Mfouo-Tynga IS Dias LD Inada NM Kurachi C Features of third generation photosensitizers used in anticancer photodynamic therapy: review Photodiagnosis Photodyn Ther 2021 10.1016/j.pdpdt.2020.102091 33453423 Mfouo-Tynga IS, Dias LD, Inada NM, Kurachi C. Features of third generation photosensitizers used in anticancer photodynamic therapy: review. Photodiagnosis Photodyn Ther. 2021. 10.1016/j.pdpdt.2020.102091. 33453423 10.1016/j.pdpdt.2020.102091 63. Rak J Pouckova P Benes J Vetvicka D Drug delivery systems for phthalocyanines for photodynamic therapy Anticancer Res 2019 10.21873/anticanres.13475 31262853 Rak J, Pouckova P, Benes J, Vetvicka D. Drug delivery systems for phthalocyanines for photodynamic therapy. Anticancer Res. 2019. 10.21873/anticanres.13475. 31262853 10.21873/anticanres.13475 64. Mourant JR Canpolat M Brocker C Esponda-Ramos O Johnson TM Matanock A Light scattering from cells: the contribution of the nucleus and the effects of proliferative status J Biomed Opt 2000 5 2 131 10.1117/1.429979 10938776 Mourant JR, Canpolat M, Brocker C, Esponda-Ramos O, Johnson TM, Matanock A, et al. Light scattering from cells: the contribution of the nucleus and the effects of proliferative status. J Biomed Opt. 2000;5(2):131. 10.1117/1.429979. 10938776 10.1117/1.429979 65. van Straten D Mashayekhi V de Bruijn HS Oliveira S Robinson DJ Oncologic photodynamic therapy: basic principles, current clinical status and future directions Cancers (Basel) 2017 10.3390/cancers9020019 28218708 PMC5332942 van Straten D, Mashayekhi V, de Bruijn HS, Oliveira S, Robinson DJ. Oncologic photodynamic therapy: basic principles, current clinical status and future directions. Cancers (Basel). 2017. 10.3390/cancers9020019. 28218708 10.3390/cancers9020019 PMC5332942 66. Gunaydin G Gedik ME Ayan S Photodynamic therapy—current limitations and novel approaches Front Chem 2021 10.3389/fchem.2021.691697 34178948 PMC8223074 Gunaydin G, Gedik ME, Ayan S. Photodynamic therapy—current limitations and novel approaches. Front Chem. 2021. 10.3389/fchem.2021.691697. 34178948 10.3389/fchem.2021.691697 PMC8223074 67. Kim MM Darafsheh A Light sources and dosimetry techniques for photodynamic therapy Photochem Photobiol 2020 10.1111/php.13219 32003006 Kim MM, Darafsheh A. Light sources and dosimetry techniques for photodynamic therapy. Photochem Photobiol. 2020. 10.1111/php.13219. 32003006 10.1111/php.13219 68. Gibson KF Kernohant WG Lasers in medicine-a review J Med Eng Technol 1993 17 2 51 57 10.3109/03091909309008351 8366508 Gibson KF, Kernohant WG. Lasers in medicine-a review. J Med Eng Technol. 1993;17(2):51–7. 10.3109/03091909309008351. 8366508 10.3109/03091909309008351 69. Brancaleon L Moseley H Laser and non-laser light sources for photodynamic therapy Lasers Med Sci 2002 17 173 10.1007/s101030200027 12181632 Brancaleon L, Moseley H. Laser and non-laser light sources for photodynamic therapy. Lasers Med Sci. 2002;17:173. 12181632 10.1007/s101030200027 70. Al-Waili NS Butler GJ Beale J Hamilton RW Lee BY Lucas P Hyperbaric oxygen and malignancies: a potential role in radiotherapy, chemotherapy, tumor surgery and phototherapy Med Sci Monit 2005 11 9 RA279 RA89 16127374 Al-Waili NS, Butler GJ, Beale J, Hamilton RW, Lee BY, Lucas P. Hyperbaric oxygen and malignancies: a potential role in radiotherapy, chemotherapy, tumor surgery and phototherapy. Med Sci Monit. 2005;11(9):RA279–89. 16127374 71. Lovell JF Liu TWB Chen J Zheng G Activatable photosensitizers for imaging and therapy Chem Rev 2010 110 5 2839 2857 10.1021/cr900236h 20104890 Lovell JF, Liu TWB, Chen J, Zheng G. Activatable photosensitizers for imaging and therapy. Chem Rev. 2010;110(5):2839–57. 10.1021/cr900236h. 20104890 10.1021/cr900236h 72. Karaman O Almammadov T Emre Gedik M Gunaydin G Kolemen S Gunbas G Mitochondria-targeting selenophene-modified BODIPY-based photosensitizers for the treatment of hypoxic cancer cells ChemMedChem 2019 14 22 1879 1886 10.1002/cmdc.201900380 31663667 Karaman O, Almammadov T, Emre Gedik M, Gunaydin G, Kolemen S, Gunbas G. Mitochondria-targeting selenophene-modified BODIPY-based photosensitizers for the treatment of hypoxic cancer cells. ChemMedChem. 2019;14(22):1879–86. 10.1002/cmdc.201900380. 31663667 10.1002/cmdc.201900380 73. Nguyen VN Baek G Qi S Heo S Yim Y Yoon J A lysosome-localized thionaphthalimide as a potential heavy-atom-free photosensitizer for selective photodynamic therapy Dyes Pigments 2020 10.1016/j.dyepig.2020.108265 Nguyen VN, Baek G, Qi S, Heo S, Yim Y, Yoon J. A lysosome-localized thionaphthalimide as a potential heavy-atom-free photosensitizer for selective photodynamic therapy. Dyes Pigments. 2020. 10.1016/j.dyepig.2020.108265. 74. Luo GF Chen WH Hong S Cheng Q Qiu WX Zhang XZ A self-transformable pH-driven membrane-anchoring photosensitizer for effective photodynamic therapy to inhibit tumor growth and metastasis Adv Funct Mater 2017 10.1002/adfm.201702122 Luo GF, Chen WH, Hong S, Cheng Q, Qiu WX, Zhang XZ. A self-transformable pH-driven membrane-anchoring photosensitizer for effective photodynamic therapy to inhibit tumor growth and metastasis. Adv Funct Mater. 2017. 10.1002/adfm.201702122. 75. Chen W Liu J Wang Y Jiang C Yu B Sun Z A C5N2 nanoparticle based direct nucleus delivery platform for synergistic cancer therapy Angewandte Chemie Int Edn 2019 58 19 6290 6294 10.1002/anie.201900884 30835932 Chen W, Liu J, Wang Y, Jiang C, Yu B, Sun Z, et al. A C5N2 nanoparticle based direct nucleus delivery platform for synergistic cancer therapy. Angewandte Chemie Int Edn. 2019;58(19):6290–4. 10.1002/anie.201900884. 10.1002/anie.201900884 30835932 76. Ayan S Gunaydin G Yesilgul-Mehmetcik N Gedik ME Seven O Akkaya EU Proof-of-principle for two-stage photodynamic therapy: hypoxia triggered release of singlet oxygen Chem Commun 2020 56 94 14793 14796 10.1039/d0cc06031c 33196713 Ayan S, Gunaydin G, Yesilgul-Mehmetcik N, Gedik ME, Seven O, Akkaya EU. Proof-of-principle for two-stage photodynamic therapy: hypoxia triggered release of singlet oxygen. Chem Commun. 2020;56(94):14793–6. 10.1039/d0cc06031c. 10.1039/d0cc06031c 33196713 77. Shi X Zhang CY Gao J Wang Z Recent advances in photodynamic therapy for cancer and infectious diseases Wiley Interdiscip Rev Nanomed Nanobiotechnol. 2019 10.1002/wnan.1560 31058443 PMC6697192 Shi X, Zhang CY, Gao J, Wang Z. Recent advances in photodynamic therapy for cancer and infectious diseases. Wiley Interdiscip Rev Nanomed Nanobiotechnol. 2019. 10.1002/wnan.1560. 31058443 10.1002/wnan.1560 PMC6697192 78. Arms L Smith DW Flynn J Palmer W Martin A Woldu A Advantages and limitations of current techniques for analyzing the biodistribution of nanoparticles Front Pharmacol 2018 10.3389/fphar.2018.00802 30154715 PMC6102329 Arms L, Smith DW, Flynn J, Palmer W, Martin A, Woldu A, et al. Advantages and limitations of current techniques for analyzing the biodistribution of nanoparticles. Front Pharmacol. 2018. 10.3389/fphar.2018.00802. 30154715 10.3389/fphar.2018.00802 PMC6102329 79. Moore JV Waller ML Zhao S Dodd NJF Acton PD Jeavons AP Feasibility of imaging photodynamic injury to tumours by high-resolution positron emission tomography Eur J Nucl Med 1998 25 1248 10.1007/s002590050292 9724373 Moore JV, Waller ML, Zhao S, Dodd NJF, Acton PD, Jeavons AP, et al. Feasibility of imaging photodynamic injury to tumours by high-resolution positron emission tomography. Eur J Nucl Med. 1998;25:1248. 9724373 10.1007/s002590050292 80. Foster TH Gao L Dosimetry in photodynamic therapy: oxygen and the critical importance of capillary density Radiat Res 1992 130 3 379 10.2307/3578385 1594766 Foster TH, Gao L. Dosimetry in photodynamic therapy: oxygen and the critical importance of capillary density. Radiat Res. 1992;130(3):379. 10.2307/3578385. 1594766 10.2307/3578385 81. Kim J Kim H Chang JH Endoscopic probe for ultrasound-assisted photodynamic therapy of deep-lying tissue IEEE Access 2020 8 179745 179753 10.1109/ACCESS.2020.3026372 Kim J, Kim H, Chang JH. Endoscopic probe for ultrasound-assisted photodynamic therapy of deep-lying tissue. IEEE Access. 2020;8:179745–53. 10.1109/ACCESS.2020.3026372. 82. Li L Jiang R Shan B Lu Y Zheng C Li M Near-infrared II plasmonic porous cubic nanoshells for in vivo noninvasive SERS visualization of sub-millimeter microtumors Nat Commun 2022 13 1 5249 10.1038/s41467-022-32975-w 36068273 PMC9448796 Li L, Jiang R, Shan B, Lu Y, Zheng C, Li M. Near-infrared II plasmonic porous cubic nanoshells for in vivo noninvasive SERS visualization of sub-millimeter microtumors. Nat Commun. 2022;13(1):5249. 10.1038/s41467-022-32975-w. 36068273 10.1038/s41467-022-32975-w PMC9448796 83. Kauffmann TH Kokanyan N Fontana MD Use of Stokes and anti-Stokes Raman scattering for new applications J Raman Spectrosc 2019 50 3 418 424 10.1002/jrs.5523 Kauffmann TH, Kokanyan N, Fontana MD. Use of Stokes and anti-Stokes Raman scattering for new applications. J Raman Spectrosc. 2019;50(3):418–24. 10.1002/jrs.5523. 84. Pivonka DE Griffiths PR Chalmers JM Griffiths PR Introduction to vibrational spectroscopy Handbook of vibrational spectroscopy 2001 New York Wiley Pivonka DE, Griffiths PR. Introduction to vibrational spectroscopy. In: Chalmers JM, Griffiths PR, editors. Handbook of vibrational spectroscopy. New York: Wiley; 2001. 10.1002/9780470027325.s8901. 85. Fleischmann M Hendra PJ McQuillan AJ Raman spectra of pyridine adsorbed at a silver electrode Chem Phys Lett 1974 26 2 163 166 10.1016/0009-2614(74)85388-1 Fleischmann M, Hendra PJ, McQuillan AJ. Raman spectra of pyridine adsorbed at a silver electrode. Chem Phys Lett. 1974;26(2):163–6. 10.1016/0009-2614(74)85388-1. 86. Jeanmaire DL Van Duyne RP Surface Raman spectroelectrochemistry J Electroanal Chem Interfacial Electrochem 1977 84 1 1 20 10.1016/S0022-0728(77)80224-6 Jeanmaire DL, Van Duyne RP. Surface Raman spectroelectrochemistry. J Electroanal Chem Interfacial Electrochem. 1977;84(1):1–20. 10.1016/S0022-0728(77)80224-6. 87. Albrecht MG Creighton JA Anomalously intense Raman spectra of pyridine at a silver electrode J Am Chem Soc 1977 99 15 5215 5217 10.1021/ja00457a071 Albrecht MG, Creighton JA. Anomalously intense Raman spectra of pyridine at a silver electrode. J Am Chem Soc. 1977;99(15):5215–7. 10.1021/ja00457a071. 88. Wang Z Zong S Wu L Zhu D Cui Y SERS-activated platforms for immunoassay: probes, encoding methods, and applications Chem Rev. 2017 10.1021/acs.chemrev.7b00027 28534612 Wang Z, Zong S, Wu L, Zhu D, Cui Y. SERS-activated platforms for immunoassay: probes, encoding methods, and applications. Chem Rev. 2017. 10.1021/acs.chemrev.7b00027. 28534612 10.1021/acs.chemrev.7b00027 89. Liu H Gao X Xu C Liu D SERS tags for biomedical detection and bioimaging Theranostics 2022 10.7150/thno.66859 35198078 PMC8825578 Liu H, Gao X, Xu C, Liu D. SERS tags for biomedical detection and bioimaging. Theranostics. 2022. 10.7150/thno.66859. 35198078 10.7150/thno.66859 PMC8825578 90. Shanmugasundaram KB Li J Sina AI Wuethrich A Trau M Toward precision oncology: SERS microfluidic systems for multiplex biomarker analysis in liquid biopsy Mater Adv 2022 3 3 1459 1471 10.1039/d1ma00848j Shanmugasundaram KB, Li J, Sina AI, Wuethrich A, Trau M. Toward precision oncology: SERS microfluidic systems for multiplex biomarker analysis in liquid biopsy. Mater Adv. 2022;3(3):1459–71. 10.1039/d1ma00848j. 91. dos Santos DP Sena MM Almeida MR Mazali IO Olivieri AC Villa JEL Unraveling surface-enhanced Raman spectroscopy results through chemometrics and machine learning: principles, progress, and trends Anal Bioanal Chem 2023 10.1007/s00216-023-04620-y 36864313 PMC9981450 dos Santos DP, Sena MM, Almeida MR, Mazali IO, Olivieri AC, Villa JEL. Unraveling surface-enhanced Raman spectroscopy results through chemometrics and machine learning: principles, progress, and trends. Anal Bioanal Chem. 2023. 10.1007/s00216-023-04620-y. 36864313 10.1007/s00216-023-04620-y PMC9981450 92. Gao F Li F Wang J Yu H Li X Chen H SERS-Based optical nanobiosensors for the detection of Alzheimer’s disease Biosensors (Basel). 2023 10.3390/bios13090880 37754114 PMC10526933 Gao F, Li F, Wang J, Yu H, Li X, Chen H, et al. SERS-Based optical nanobiosensors for the detection of Alzheimer’s disease. Biosensors (Basel). 2023. 10.3390/bios13090880. 37754114 10.3390/bios13090880 PMC10526933 93. Moskovits M Surface roughness and the enhanced intensity of Raman scattering by molecules adsorbed on metals J Chem Phys 1978 69 9 4159 4161 10.1063/1.437095 Moskovits M. Surface roughness and the enhanced intensity of Raman scattering by molecules adsorbed on metals. J Chem Phys. 1978;69(9):4159–61. 10.1063/1.437095. 94. Yamamoto YS Ozaki Y Itoh T Recent progress and frontiers in the electromagnetic mechanism of surface-enhanced Raman scattering J Photochem Photobiol C Photochem Rev 2014 10.1016/j.jphotochemrev.2014.10.001 Yamamoto YS, Ozaki Y, Itoh T. Recent progress and frontiers in the electromagnetic mechanism of surface-enhanced Raman scattering. J Photochem Photobiol C Photochem Rev. 2014. 10.1016/j.jphotochemrev.2014.10.001. 95. Eric C. Le Ru and Pablo G. Etchegoin. Principles of surface-enhanced Raman spectroscopy. Eric C. Le Ru PGE, editor. Elsevier; 2009. 10.1016/B978-0-444-52779-0.X0001-3 96. Ding S-Y You E-M Tian Z-Q Moskovits M Electromagnetic theories of surface-enhanced Raman spectroscopy Chem Soc Rev 2017 46 13 4042 4076 10.1039/C7CS00238F 28660954 Ding S-Y, You E-M, Tian Z-Q, Moskovits M. Electromagnetic theories of surface-enhanced Raman spectroscopy. Chem Soc Rev. 2017;46(13):4042–76. 10.1039/C7CS00238F. 28660954 10.1039/c7cs00238f 97. Le Ru EC Etchegoin PG SERS enhancement factors and related topics Princ Surf Enhanc Raman Spectrosc 2009 10.1016/B978-0-444-52779-0.00010-6 Le Ru EC, Etchegoin PG. SERS enhancement factors and related topics. Princ Surf Enhanc Raman Spectrosc. 2009. 10.1016/B978-0-444-52779-0.00010-6. 98. Langer J Jimenez de Aberasturi D Aizpurua J Alvarez-Puebla RA Auguié B Baumberg JJ Present and future of surface-enhanced Raman scattering ACS Nano 2020 14 1 28 117 10.1021/acsnano.9b04224 31478375 PMC6990571 Langer J, Jimenez de Aberasturi D, Aizpurua J, Alvarez-Puebla RA, Auguié B, Baumberg JJ, et al. Present and future of surface-enhanced Raman scattering. ACS Nano. 2020;14(1):28–117. 10.1021/acsnano.9b04224. 31478375 10.1021/acsnano.9b04224 PMC6990571 99. Shvalya V Filipič G Zavašnik J Abdulhalim I Cvelbar U Surface-enhanced Raman spectroscopy for chemical and biological sensing using nanoplasmonics: the relevance of interparticle spacing and surface morphology Appl Phys Rev 2020 10.1063/5.0015246 Shvalya V, Filipič G, Zavašnik J, Abdulhalim I, Cvelbar U. Surface-enhanced Raman spectroscopy for chemical and biological sensing using nanoplasmonics: the relevance of interparticle spacing and surface morphology. Appl Phys Rev. 2020. 10.1063/5.0015246. 100. Han XX Rodriguez RS Haynes CL Ozaki Y Zhao B Surface-enhanced Raman spectroscopy Nat Rev Methods Prim 2021 10.1038/s43586-021-00083-6 Han XX, Rodriguez RS, Haynes CL, Ozaki Y, Zhao B. Surface-enhanced Raman spectroscopy. Nat Rev Methods Prim. 2021. 10.1038/s43586-021-00083-6. 101. Li D Aubertin K Onidas D Nizard P Félidj N Gazeau F Recent advances in non-plasmonic surface-enhanced Raman spectroscopy nanostructures for biomedical applications Wiley Interdiscip Rev Nanomed Nanobiotechnol 2022 10.1002/wnan.1795 35362261 Li D, Aubertin K, Onidas D, Nizard P, Félidj N, Gazeau F, et al. Recent advances in non-plasmonic surface-enhanced Raman spectroscopy nanostructures for biomedical applications. Wiley Interdiscip Rev Nanomed Nanobiotechnol. 2022. 10.1002/wnan.1795. 35362261 10.1002/wnan.1795 102. Tahir MA Dina NE Cheng H Valev VK Zhang L Surface-enhanced Raman spectroscopy for bioanalysis and diagnosis Nanoscale 2021 10.1039/d1nr00708d 34231627 Tahir MA, Dina NE, Cheng H, Valev VK, Zhang L. Surface-enhanced Raman spectroscopy for bioanalysis and diagnosis. Nanoscale. 2021. 10.1039/d1nr00708d. 34231627 10.1039/d1nr00708d 103. Chen Y An Q Teng K Liu C Sun F Li G Application of SERS in in-vitro biomedical detection Chem Asian J 2023 10.1002/asia.202201194 36581747 Chen Y, An Q, Teng K, Liu C, Sun F, Li G. Application of SERS in in-vitro biomedical detection. Chem Asian J. 2023. 10.1002/asia.202201194. 36581747 10.1002/asia.202201194 104. Ge K Hu Y Li G Recent Progress on solid substrates for surface-enhanced Raman spectroscopy analysis Biosensors (Basel) 2022 12 11 941 10.3390/bios12110941 36354450 PMC9687977 Ge K, Hu Y, Li G. Recent Progress on solid substrates for surface-enhanced Raman spectroscopy analysis. Biosensors (Basel). 2022;12(11):941. 10.3390/bios12110941. 36354450 10.3390/bios12110941 PMC9687977 105. Ye Z Li C Chen Q Xu Y Bell SEJ Self-assembly of colloidal nanoparticles into 2D arrays at water–oil interfaces: rational construction of stable SERS substrates with accessible enhancing surfaces and tailored plasmonic response Nanoscale 2021 13 12 5937 5953 10.1039/D0NR08803J 33650605 Ye Z, Li C, Chen Q, Xu Y, Bell SEJ. Self-assembly of colloidal nanoparticles into 2D arrays at water–oil interfaces: rational construction of stable SERS substrates with accessible enhancing surfaces and tailored plasmonic response. Nanoscale. 2021;13(12):5937–53. 10.1039/D0NR08803J. 33650605 10.1039/d0nr08803j 106. Long L Ju W Yang H-Y Li Z Dimensional design for surface-enhanced Raman spectroscopy ACS Mater 2022 2 5 552 575 10.1021/acsmaterialsau.2c00005 PMC9928417 36855623 Long L, Ju W, Yang H-Y, Li Z. Dimensional design for surface-enhanced Raman spectroscopy. ACS Mater. 2022;2(5):552–75. 10.1021/acsmaterialsau.2c00005. 10.1021/acsmaterialsau.2c00005 PMC9928417 36855623 107. Ko H Singamaneni S Tsukruk VV Nanostructured surfaces and assemblies as SERS media Small 2008 10.1002/smll.200800337 18844309 Ko H, Singamaneni S, Tsukruk VV. Nanostructured surfaces and assemblies as SERS media. Small. 2008. 10.1002/smll.200800337. 18844309 10.1002/smll.200800337 108. Chen M Zhao X Wang B Li D Xu X Liu H Flower-like gap-enhanced Raman tags wrapped with polydopamine-functionalized MoS2 nanosheets for phototheranostic nanoplatform J Mater Sci 2025 60 4 1873 1890 10.1007/s10853-024-10532-8 Chen M, Zhao X, Wang B, Li D, Xu X, Liu H, et al. Flower-like gap-enhanced Raman tags wrapped with polydopamine-functionalized MoS2 nanosheets for phototheranostic nanoplatform. J Mater Sci. 2025;60(4):1873–90. 10.1007/s10853-024-10532-8. 109. Geng X Wu C Liu S Han Y Song L Zhang Y Fabrication optimization and application of 3D hybrid SERS substrates RSC Adv 2021 11 50 31400 31407 10.1039/d1ra04473g 35496872 PMC9041343 Geng X, Wu C, Liu S, Han Y, Song L, Zhang Y. Fabrication optimization and application of 3D hybrid SERS substrates. RSC Adv. 2021;11(50):31400–7. 10.1039/d1ra04473g. 35496872 10.1039/d1ra04473g PMC9041343 110. Yin T Peng Y Chao K Li Y Emerging trends in SERS-based veterinary drug detection: multifunctional substrates and intelligent data approaches NPJ Sci Food 2025 9 1 31 10.1038/s41538-025-00393-z 40089516 PMC11910576 Yin T, Peng Y, Chao K, Li Y. Emerging trends in SERS-based veterinary drug detection: multifunctional substrates and intelligent data approaches. NPJ Sci Food. 2025;9(1):31. 10.1038/s41538-025-00393-z. 40089516 10.1038/s41538-025-00393-z PMC11910576 111. Yamada H Yamamoto Y Tani N Surface-enhanced Raman scattering (SERS) of adsorbed molecules on smooth surfaces of metals and a metal oxide Chem Phys Lett 1982 86 4 397 400 10.1016/0009-2614(82)83531-8 Yamada H, Yamamoto Y, Tani N. Surface-enhanced Raman scattering (SERS) of adsorbed molecules on smooth surfaces of metals and a metal oxide. Chem Phys Lett. 1982;86(4):397–400. 10.1016/0009-2614(82)83531-8. 112. Powell JA Venkatakrishnan K Tan B Toward universal SERS Detection of disease signaling bioanalytes using 3D self-assembled nonplasmonic near-quantum-scale silicon probe ACS Appl Mater Interfaces 2017 9 46 40127 40142 10.1021/acsami.7b15393 29083860 Powell JA, Venkatakrishnan K, Tan B. Toward universal SERS Detection of disease signaling bioanalytes using 3D self-assembled nonplasmonic near-quantum-scale silicon probe. ACS Appl Mater Interfaces. 2017;9(46):40127–42. 10.1021/acsami.7b15393. 29083860 10.1021/acsami.7b15393 113. Barbillon G Latest novelties on plasmonic and non-plasmonic nanomaterials for SERS sensing Nanomaterials 2020 10.3390/nano10061200 32575470 PMC7353120 Barbillon G. Latest novelties on plasmonic and non-plasmonic nanomaterials for SERS sensing. Nanomaterials. 2020. 10.3390/nano10061200. 32575470 10.3390/nano10061200 PMC7353120 114. Zheng XS Jahn IJ Weber K Cialla-May D Popp J Label-free SERS in biological and biomedical applications: recent progress, current challenges and opportunities Spectrochim Acta A Mol Biomol Spectrosc 2018 197 56 77 10.1016/j.saa.2018.01.063 29395932 Zheng XS, Jahn IJ, Weber K, Cialla-May D, Popp J. Label-free SERS in biological and biomedical applications: recent progress, current challenges and opportunities. Spectrochim Acta A Mol Biomol Spectrosc. 2018;197:56–77. 10.1016/j.saa.2018.01.063. 29395932 10.1016/j.saa.2018.01.063 115. Chang H Hur W Kang H Jun B-H In vivo surface-enhanced Raman scattering techniques: nanoprobes, instrumentation, and applications Light Sci Appl 2025 14 1 79 10.1038/s41377-024-01718-5 39934124 PMC11814295 Chang H, Hur W, Kang H, Jun B-H. In vivo surface-enhanced Raman scattering techniques: nanoprobes, instrumentation, and applications. Light Sci Appl. 2025;14(1):79. 10.1038/s41377-024-01718-5. 39934124 10.1038/s41377-024-01718-5 PMC11814295 116. Esposito A Bonifacio A Sergo V Fornasaro S Label-free surface enhanced Raman scattering (SERS) on centrifugal silver plasmonic paper (CSPP): A novel methodology for unprocessed biofluids sampling and analysis Biosensors (Basel) 2021 11 11 467 10.3390/bios11110467 34821683 PMC8615985 Esposito A, Bonifacio A, Sergo V, Fornasaro S. Label-free surface enhanced Raman scattering (SERS) on centrifugal silver plasmonic paper (CSPP): A novel methodology for unprocessed biofluids sampling and analysis. Biosensors (Basel). 2021;11(11):467. 10.3390/bios11110467. 34821683 10.3390/bios11110467 PMC8615985 117. Lee W Kang BH Yang H Park M Kwak JH Chung T Spread spectrum SERS allows label-free detection of attomolar neurotransmitters Nat Commun 2021 10.1038/s41467-020-20413-8 33420035 PMC7794485 Lee W, Kang BH, Yang H, Park M, Kwak JH, Chung T, et al. Spread spectrum SERS allows label-free detection of attomolar neurotransmitters. Nat Commun. 2021. 10.1038/s41467-020-20413-8. 33420035 10.1038/s41467-020-20413-8 PMC7794485 118. Harper MM McKeating KS Faulds K Recent developments and future directions in SERS for bioanalysis Phys Chem Chem Phys 2013 15 15 5312 5328 10.1039/c2cp43859c 23318580 Harper MM, McKeating KS, Faulds K. Recent developments and future directions in SERS for bioanalysis. Phys Chem Chem Phys. 2013;15(15):5312–28. 10.1039/c2cp43859c. 23318580 10.1039/c2cp43859c 119. Li M Qiu Y Fan C Cui K Zhang Y Xiao Z Design of SERS nanoprobes for Raman imaging: materials, critical factors and architectures Acta Pharm Sin B 2018 8 3 381 389 10.1016/j.apsb.2018.01.010 29881677 PMC5989826 Li M, Qiu Y, Fan C, Cui K, Zhang Y, Xiao Z. Design of SERS nanoprobes for Raman imaging: materials, critical factors and architectures. Acta Pharm Sin B. 2018;8(3):381–9. 10.1016/j.apsb.2018.01.010. 29881677 10.1016/j.apsb.2018.01.010 PMC5989826 120. Zang Y Xu Y Zhao L Wang Z Liu G Wang T Improved surface-enhanced Raman scattering detection of miRNA employing polyhedral gold plasmonic nanoparticles in conjunction with DNA cascade amplification strategy Sens Actuators B Chem 2025 429 137320 10.1016/j.snb.2025.137320 Zang Y, Xu Y, Zhao L, Wang Z, Liu G, Wang T, et al. Improved surface-enhanced Raman scattering detection of miRNA employing polyhedral gold plasmonic nanoparticles in conjunction with DNA cascade amplification strategy. Sens Actuators B Chem. 2025;429: 137320. 10.1016/j.snb.2025.137320. 121. Hickey ME Gao S He L Comparison of label-free and label-based approaches for surface-enhanced Raman microscopic imaging of bacteria cells Anal Sci Adv 2020 1 4 245 253 10.1002/ansa.202000088 38716390 PMC10989132 Hickey ME, Gao S, He L. Comparison of label-free and label-based approaches for surface-enhanced Raman microscopic imaging of bacteria cells. Anal Sci Adv. 2020;1(4):245–53. 10.1002/ansa.202000088. 38716390 10.1002/ansa.202000088 PMC10989132 122. Liu Y Zhou H Hu Z Yu G Yang D Zhao J Label and label-free based surface-enhanced Raman scattering for pathogen bacteria detection: a review Biosens Bioelectron 2017 94 131 140 10.1016/j.bios.2017.02.032 28262610 Liu Y, Zhou H, Hu Z, Yu G, Yang D, Zhao J. Label and label-free based surface-enhanced Raman scattering for pathogen bacteria detection: a review. Biosens Bioelectron. 2017;94:131–40. 10.1016/j.bios.2017.02.032. 28262610 10.1016/j.bios.2017.02.032 123. Leong SX Leong YX Tan EX Sim HYF Koh CSL Lee YH Noninvasive and point-of-care surface-enhanced Raman scattering (SERS)-based breathalyzer for mass screening of coronavirus disease 2019 (COVID-19) under 5 min ACS Nano 2022 16 2 2629 2639 10.1021/acsnano.1c09371 35040314 Leong SX, Leong YX, Tan EX, Sim HYF, Koh CSL, Lee YH, et al. Noninvasive and point-of-care surface-enhanced Raman scattering (SERS)-based breathalyzer for mass screening of coronavirus disease 2019 (COVID-19) under 5 min. ACS Nano. 2022;16(2):2629–39. 10.1021/acsnano.1c09371. 35040314 10.1021/acsnano.1c09371 124. Guo S Popp J Bocklitz T Chemometric analysis in Raman spectroscopy from experimental design to machine learning–based modeling Nat Protoc. 2021 10.1038/s41596-021-00620-3 34741152 Guo S, Popp J, Bocklitz T. Chemometric analysis in Raman spectroscopy from experimental design to machine learning–based modeling. Nat Protoc. 2021. 10.1038/s41596-021-00620-3. 34741152 10.1038/s41596-021-00620-3 125. Smith LI (2002) A tutorial on principal components analysis 126. Holland SM (2018) Principal components analysis (PCA). Principal components analysis (PCA. Department of Geology, University of Georgia, Athens, GA. p. 2501 127. Kobayashi S Kaneko S Tamaki T Kiguchi M Tsukagoshi K Terao J Principal component analysis of surface-enhanced raman scattering spectra revealing isomer-dependent electron transport in Spiropyran molecular junctions: implications for nanoscale molecular electronics ACS Omega 2022 7 6 5578 5583 10.1021/acsomega.1c07105 35187372 PMC8851897 Kobayashi S, Kaneko S, Tamaki T, Kiguchi M, Tsukagoshi K, Terao J, et al. Principal component analysis of surface-enhanced raman scattering spectra revealing isomer-dependent electron transport in Spiropyran molecular junctions: implications for nanoscale molecular electronics. ACS Omega. 2022;7(6):5578–83. 10.1021/acsomega.1c07105. 35187372 10.1021/acsomega.1c07105 PMC8851897 128. Avram L Iancu SD Stefancu A Moisoiu V Colnita A Marconi D SERS-based liquid biopsy of gastrointestinal tumors using a portable raman device operating in a clinical environment J Clin Med. 2020 10.3390/jcm9010212 31941009 PMC7019591 Avram L, Iancu SD, Stefancu A, Moisoiu V, Colnita A, Marconi D, et al. SERS-based liquid biopsy of gastrointestinal tumors using a portable raman device operating in a clinical environment. J Clin Med. 2020. 10.3390/jcm9010212. 31941009 10.3390/jcm9010212 PMC7019591 129. Pirouz DM An overview of partial least squares SSRN Electron J 2006 10.2139/ssrn.1631359 Pirouz DM. An overview of partial least squares. SSRN Electron J. 2006. 10.2139/ssrn.1631359. 130. Ruiz-Perez D Guan H Madhivanan P Mathee K Narasimhan G So you think you can PLS-DA? BMC Bioinf 2020 10.1186/s12859-019-3310-7 PMC7724830 33297937 Ruiz-Perez D, Guan H, Madhivanan P, Mathee K, Narasimhan G. So you think you can PLS-DA? BMC Bioinf. 2020. 10.1186/s12859-019-3310-7. 10.1186/s12859-019-3310-7 PMC7724830 33297937 131. Saleem M Majeed MI Nawaz H Iqbal MA Hassan A Rashid N Surface-enhanced raman spectroscopy for the characterization of the antibacterial properties of imidazole derivatives against bacillus subtilis with principal component analysis and partial least squares-discriminant analysis Anal Lett 2022 55 13 2132 2146 10.1080/00032719.2022.2047997 Saleem M, Majeed MI, Nawaz H, Iqbal MA, Hassan A, Rashid N, et al. Surface-enhanced raman spectroscopy for the characterization of the antibacterial properties of imidazole derivatives against bacillus subtilis with principal component analysis and partial least squares-discriminant analysis. Anal Lett. 2022;55(13):2132–46. 10.1080/00032719.2022.2047997. 132. Bari RZA Nawaz H Majeed MI Rashid N Tahir M Ul Hasan HM Characterization of bacteria inducing chronic sinusitis using surface-enhanced Raman spectroscopy (SERS) with multivariate data analysis Anal Lett. 2023 56 8 1351 65 10.1080/00032719.2022.2130349 Bari RZA, Nawaz H, Majeed MI, Rashid N, Tahir M, Ul Hasan HM, et al. Characterization of bacteria inducing chronic sinusitis using surface-enhanced Raman spectroscopy (SERS) with multivariate data analysis. Anal Lett. 2023;56(8):1351–65. 10.1080/00032719.2022.2130349. 133. De Juan A Jaumot J Tauler R Multivariate curve resolution (MCR). Solving the mixture analysis problem Anal Methods 2014 6 14 4964 4976 10.1039/C4AY00571F De Juan A, Jaumot J, Tauler R. Multivariate curve resolution (MCR). Solving the mixture analysis problem. Anal Methods. 2014;6(14):4964–76. 134. Rutan SC de Juan A Tauler R Introduction to multivariate curve resolution Compreh Chemometr 2020 10.1016/B978-0-12-409547-2.14890-5 Rutan SC, de Juan A, Tauler R. Introduction to multivariate curve resolution. Compreh Chemometr. 2020. 10.1016/B978-0-12-409547-2.14890-5. 135. Villa JEL Pasquini C Poppi RJ Surface-enhanced Raman spectroscopy and MCR-ALS for the selective sensing of urinary adenosine on filter paper Talanta 2018 187 99 105 10.1016/j.talanta.2018.05.022 29853071 Villa JEL, Pasquini C, Poppi RJ. Surface-enhanced Raman spectroscopy and MCR-ALS for the selective sensing of urinary adenosine on filter paper. Talanta. 2018;187:99–105. 10.1016/j.talanta.2018.05.022. 29853071 10.1016/j.talanta.2018.05.022 136. Mamián-López MB Poppi RJ SERS hyperspectral imaging assisted by MCR-ALS for studying polymeric microfilms loaded with paracetamol Microchem J 2015 123 243 251 10.1016/j.microc.2015.07.003 Mamián-López MB, Poppi RJ. SERS hyperspectral imaging assisted by MCR-ALS for studying polymeric microfilms loaded with paracetamol. Microchem J. 2015;123:243–51. 10.1016/j.microc.2015.07.003. 137. Marini F Bucci R Magrì AL Magrì AD Artificial neural networks in chemometrics: history, examples and perspectives Microchem J 2008 88 2 178 185 10.1016/j.microc.2007.11.008 Marini F, Bucci R, Magrì AL, Magrì AD. Artificial neural networks in chemometrics: history, examples and perspectives. Microchem J. 2008;88(2):178–85. 10.1016/j.microc.2007.11.008. 138. Xie Y Su X Wen Y Zheng C Li M Artificial intelligent label-free SERS profiling of serum exosomes for breast cancer diagnosis and postoperative assessment Nano Lett 2022 22 19 7910 7918 10.1021/acs.nanolett.2c02928 36149810 Xie Y, Su X, Wen Y, Zheng C, Li M. Artificial intelligent label-free SERS profiling of serum exosomes for breast cancer diagnosis and postoperative assessment. Nano Lett. 2022;22(19):7910–8. 10.1021/acs.nanolett.2c02928. 36149810 10.1021/acs.nanolett.2c02928 139. Skvortsova A Trelin A Sedlar A Erzina M Travnickova M Svobodova L SERS-CNN approach for non-invasive and non-destructive monitoring of stem cell growth on a universal substrate through an analysis of the cultivation medium Sens Actuators B Chem 2023 375 132812 10.1016/j.snb.2022.132812 Skvortsova A, Trelin A, Sedlar A, Erzina M, Travnickova M, Svobodova L, et al. SERS-CNN approach for non-invasive and non-destructive monitoring of stem cell growth on a universal substrate through an analysis of the cultivation medium. Sens Actuators B Chem. 2023;375: 132812. 10.1016/j.snb.2022.132812. 140. Li JQ Dukes PV Lee W Sarkis M Vo-Dinh T Machine learning using convolutional neural networks for SERS analysis of biomarkers in medical diagnostics J Raman Spectrosc 2022 53 12 2044 2057 10.1002/jrs.6447 37067872 PMC10087982 Li JQ, Dukes PV, Lee W, Sarkis M, Vo-Dinh T. Machine learning using convolutional neural networks for SERS analysis of biomarkers in medical diagnostics. J Raman Spectrosc. 2022;53(12):2044–57. 10.1002/jrs.6447. 37067872 10.1002/jrs.6447 PMC10087982 141. Alvarez-Puebla RA Liz-Marzán LM SERS-based diagnosis and biodetection Small 2010 6 5 604 610 10.1002/smll.200901820 20108237 Alvarez-Puebla RA, Liz-Marzán LM. SERS-based diagnosis and biodetection. Small. 2010;6(5):604–10. 10.1002/smll.200901820. 20108237 10.1002/smll.200901820 142. Chakraborty A Ghosh A Barui A Advances in surface-enhanced Raman spectroscopy for cancer diagnosis and staging J Raman Spectrosc 2020 10.1002/jrs.5726 Chakraborty A, Ghosh A, Barui A. Advances in surface-enhanced Raman spectroscopy for cancer diagnosis and staging. J Raman Spectrosc. 2020. 10.1002/jrs.5726. 143. Pandey A Sarkar S Pandey SK Srivastava A Silica nanospheres coated silver islands as an effective opto-plasmonic SERS active platform for rapid and sensitive detection of prostate cancer biomarkers Molecules 2022 10.3390/molecules27227821 36431921 PMC9697738 Pandey A, Sarkar S, Pandey SK, Srivastava A. Silica nanospheres coated silver islands as an effective opto-plasmonic SERS active platform for rapid and sensitive detection of prostate cancer biomarkers. Molecules. 2022. 10.3390/molecules27227821. 36431921 10.3390/molecules27227821 PMC9697738 144. Wu J Zhou X Li P Lin X Wang J Hu Z Ultrasensitive and simultaneous SERS detection of multiplex MicroRNA using fractal gold nanotags for early diagnosis and prognosis of hepatocellular carcinoma Anal Chem 2021 93 25 8799 8809 10.1021/acs.analchem.1c00478 34076420 Wu J, Zhou X, Li P, Lin X, Wang J, Hu Z, et al. Ultrasensitive and simultaneous SERS detection of multiplex MicroRNA using fractal gold nanotags for early diagnosis and prognosis of hepatocellular carcinoma. Anal Chem. 2021;93(25):8799–809. 10.1021/acs.analchem.1c00478. 34076420 10.1021/acs.analchem.1c00478 145. Haldavnekar R Venkatakrishnan K Tan B Non plasmonic semiconductor quantum SERS probe as a pathway for in vitro cancer detection Nat Commun 2018 10.1038/s41467-018-05237-x 30076296 PMC6076273 Haldavnekar R, Venkatakrishnan K, Tan B. Non plasmonic semiconductor quantum SERS probe as a pathway for in vitro cancer detection. Nat Commun. 2018. 10.1038/s41467-018-05237-x. 30076296 10.1038/s41467-018-05237-x PMC6076273 146. Su X Xie Y Liu X Chen M Zheng C Zhong H Absolute quantification of serum exosomes in patients with an SERS-lateral flow strip biosensor for noninvasive clinical cancer diagnosis ACS Appl Mater Interfaces 2023 15 31 37130 37142 10.1021/acsami.3c05039 37525365 Su X, Xie Y, Liu X, Chen M, Zheng C, Zhong H, et al. Absolute quantification of serum exosomes in patients with an SERS-lateral flow strip biosensor for noninvasive clinical cancer diagnosis. ACS Appl Mater Interfaces. 2023;15(31):37130–42. 10.1021/acsami.3c05039. 37525365 10.1021/acsami.3c05039 147. Treerattrakoon K Roeksrungruang P Dharakul T Japrung D Faulds K Graham D Detection of a miRNA biomarker for cancer diagnosis using SERS tags and magnetic separation Anal Methods 2022 14 20 1938 1945 10.1039/D2AY00210H 35441184 Treerattrakoon K, Roeksrungruang P, Dharakul T, Japrung D, Faulds K, Graham D, et al. Detection of a miRNA biomarker for cancer diagnosis using SERS tags and magnetic separation. Anal Methods. 2022;14(20):1938–45. 10.1039/D2AY00210H. 35441184 10.1039/d2ay00210h 148. Li X Yang T Li S Zhang S Jin L Discrimination of rectal cancer through human serum using surface-enhanced Raman spectroscopy Appl Phys B 2015 119 2 393 398 10.1007/s00340-015-6088-y Li X, Yang T, Li S, Zhang S, Jin L. Discrimination of rectal cancer through human serum using surface-enhanced Raman spectroscopy. Appl Phys B. 2015;119(2):393–8. 10.1007/s00340-015-6088-y. 149. Dinish US Balasundaram G Chang Y-T Olivo M Actively targeted in vivo multiplex detection of intrinsic cancer biomarkers using biocompatible SERS nanotags Sci Rep 2014 4 1 4075 10.1038/srep04075 24518045 PMC3921631 Dinish US, Balasundaram G, Chang Y-T, Olivo M. Actively targeted in vivo multiplex detection of intrinsic cancer biomarkers using biocompatible SERS nanotags. Sci Rep. 2014;4(1):4075. 10.1038/srep04075. 24518045 10.1038/srep04075 PMC3921631 150. Wang Y Qian H Shao X Zhang H Liu S Pan J Multimodal convolutional neural networks based on the Raman spectra of serum and clinical features for the early diagnosis of prostate cancer Spectrochim Acta A Mol Biomol Spectrosc 2023 293 122426 10.1016/j.saa.2023.122426 36787677 Wang Y, Qian H, Shao X, Zhang H, Liu S, Pan J, et al. Multimodal convolutional neural networks based on the Raman spectra of serum and clinical features for the early diagnosis of prostate cancer. Spectrochim Acta A Mol Biomol Spectrosc. 2023;293: 122426. 10.1016/j.saa.2023.122426. 36787677 10.1016/j.saa.2023.122426 151. Tan Y Yan B Xue L Li Y Luo X Ji P Surface-enhanced Raman spectroscopy of blood serum based on gold nanoparticles for the diagnosis of the oral squamous cell carcinoma Lipids Health Dis 2017 16 1 73 10.1186/s12944-017-0465-y 28388900 PMC5384146 Tan Y, Yan B, Xue L, Li Y, Luo X, Ji P. Surface-enhanced Raman spectroscopy of blood serum based on gold nanoparticles for the diagnosis of the oral squamous cell carcinoma. Lipids Health Dis. 2017;16(1):73. 10.1186/s12944-017-0465-y. 28388900 10.1186/s12944-017-0465-y PMC5384146 152. Sigurdsson S Philipsen PA Hansen LK Larsen J Gniadecka M Wulf HC Detection of skin cancer by classification of Raman spectra IEEE Trans Biomed Eng 2004 51 10 1784 1793 10.1109/TBME.2004.831538 15490825 Sigurdsson S, Philipsen PA, Hansen LK, Larsen J, Gniadecka M, Wulf HC. Detection of skin cancer by classification of Raman spectra. IEEE Trans Biomed Eng. 2004;51(10):1784–93. 10.1109/TBME.2004.831538. 15490825 10.1109/TBME.2004.831538 153. Masson J-F The need for benchmarking surface-enhanced Raman scattering (SERS) sensors ACS Sens 2021 6 11 3822 3823 10.1021/acssensors.1c02275 34823364 Masson J-F. The need for benchmarking surface-enhanced Raman scattering (SERS) sensors. ACS Sens. 2021;6(11):3822–3. 10.1021/acssensors.1c02275. 34823364 10.1021/acssensors.1c02275 154. Fornasaro S Alsamad F Baia M Batista de Carvalho LAE Beleites C Byrne HJ Surface enhanced Raman spectroscopy for quantitative analysis: results of a large-scale European multi-instrument interlaboratory study Anal Chem. 2020 92 5 4053 64 10.1021/acs.analchem.9b05658 32045217 PMC7997108 Fornasaro S, Alsamad F, Baia M, Batista de Carvalho LAE, Beleites C, Byrne HJ, et al. Surface enhanced Raman spectroscopy for quantitative analysis: results of a large-scale European multi-instrument interlaboratory study. Anal Chem. 2020;92(5):4053–64. 10.1021/acs.analchem.9b05658. 32045217 10.1021/acs.analchem.9b05658 PMC7997108 155. Li Q Huo H Wu Y Chen L Su L Zhang X Design and synthesis of SERS materials for in vivo molecular imaging and biosensing Adv Sci 2023 10.1002/advs.202202051 PMC10015885 36683237 Li Q, Huo H, Wu Y, Chen L, Su L, Zhang X, et al. Design and synthesis of SERS materials for in vivo molecular imaging and biosensing. Adv Sci. 2023. 10.1002/advs.202202051. 10.1002/advs.202202051 PMC10015885 36683237 156. Cialla-May D Bonifacio A Markin A Markina N Fornasaro S Dwivedi A Recent advances of surface enhanced Raman spectroscopy (SERS) in optical biosensing TrAC Trends Anal Chem 2024 181 117990 10.1016/j.trac.2024.117990 Cialla-May D, Bonifacio A, Markin A, Markina N, Fornasaro S, Dwivedi A, et al. Recent advances of surface enhanced Raman spectroscopy (SERS) in optical biosensing. TrAC Trends Anal Chem. 2024;181: 117990. 10.1016/j.trac.2024.117990. 157. Saylan Y Akgönüllü S Bereli N Yavuz H Denizli A Scaling up of biosensors for clinical applications and commercialization Adv Biosens Virus Detect 2022 10.1016/B978-0-12-824494-4.00022-9 Saylan Y, Akgönüllü S, Bereli N, Yavuz H, Denizli A. Scaling up of biosensors for clinical applications and commercialization. Adv Biosens Virus Detect. 2022. 10.1016/B978-0-12-824494-4.00022-9. 158. Carreón RV Rodríguez-Hernández AG Serrano de la Rosa LE Calixto ME Gervacio-Arciniega JJ Krishnan SK A scalable synthesis of Ag nanoporous film as an efficient SERS-substrates for sensitive detection of nanoplastics Langmuir 2024 40 33 17476 17488 10.1021/acs.langmuir.4c01671 39102563 PMC11340027 Carreón RV, Rodríguez-Hernández AG, Serrano de la Rosa LE, Calixto ME, Gervacio-Arciniega JJ, Krishnan SK. A scalable synthesis of Ag nanoporous film as an efficient SERS-substrates for sensitive detection of nanoplastics. Langmuir. 2024;40(33):17476–88. 39102563 10.1021/acs.langmuir.4c01671 PMC11340027 159. Liu L Martinez Pancorbo P Xiao T Noguchi S Marumi M Segawa H Highly scalable, wearable surface-enhanced Raman spectroscopy Adv Opt Mater 2022 10.1002/adom.202200054 Liu L, Martinez Pancorbo P, Xiao T, Noguchi S, Marumi M, Segawa H, et al. Highly scalable, wearable surface-enhanced Raman spectroscopy. Adv Opt Mater. 2022. 10.1002/adom.202200054. 160. Pang Y Wang C Lu LC Wang C Sun Z Xiao R Dual-SERS biosensor for one-step detection of microRNAs in exosome and residual plasma of blood samples for diagnosing pancreatic cancer Biosens Bioelectron 2019 130 204 213 10.1016/j.bios.2019.01.039 30745282 Pang Y, Wang C, Lu LC, Wang C, Sun Z, Xiao R. Dual-SERS biosensor for one-step detection of microRNAs in exosome and residual plasma of blood samples for diagnosing pancreatic cancer. Biosens Bioelectron. 2019;130:204–13. 10.1016/j.bios.2019.01.039. 30745282 10.1016/j.bios.2019.01.039 161. Panikar SS Banu N Haramati J Gutierrez-Silerio GY Bastidas-Ramirez BE Tellez-Bañuelos MC Anti-fouling SERS-based immunosensor for point-of-care detection of the B7–H6 tumor biomarker in cervical cancer patient serum Anal Chim Acta 2020 1138 110 122 10.1016/j.aca.2020.09.019 33161972 Panikar SS, Banu N, Haramati J, Gutierrez-Silerio GY, Bastidas-Ramirez BE, Tellez-Bañuelos MC, et al. Anti-fouling SERS-based immunosensor for point-of-care detection of the B7–H6 tumor biomarker in cervical cancer patient serum. Anal Chim Acta. 2020;1138:110–22. 10.1016/j.aca.2020.09.019. 33161972 10.1016/j.aca.2020.09.019 162. Han Y Qiang L Gao Y Gao J He Q Liu H Large-area surface-enhanced Raman spectroscopy substrate by hybrid porous GaN with Au/Ag for breast cancer miRNA detection Appl Surf Sci 2021 10.1016/j.apsusc.2020.148456 Han Y, Qiang L, Gao Y, Gao J, He Q, Liu H, et al. Large-area surface-enhanced Raman spectroscopy substrate by hybrid porous GaN with Au/Ag for breast cancer miRNA detection. Appl Surf Sci. 2021. 10.1016/j.apsusc.2020.148456.33012933 163. Lu Y Zhan C Yu L Yu Y Jia H Chen X Multifunctional nanocone array as solid immunoassay plate and SERS substrate for the early diagnosis of prostate cancer on microfluidic chip Sens Actuators B Chem 2023 10.1016/j.snb.2022.133046 Lu Y, Zhan C, Yu L, Yu Y, Jia H, Chen X, et al. Multifunctional nanocone array as solid immunoassay plate and SERS substrate for the early diagnosis of prostate cancer on microfluidic chip. Sens Actuators B Chem. 2023. 10.1016/j.snb.2022.133046. 164. Keshavarz M Kassanos P Tan B Venkatakrishnan K Metal-oxide surface-enhanced Raman biosensor template towards point-of-care EGFR detection and cancer diagnostics Nanoscale Horiz 2020 5 2 294 307 10.1039/c9nh00590k Keshavarz M, Kassanos P, Tan B, Venkatakrishnan K. Metal-oxide surface-enhanced Raman biosensor template towards point-of-care EGFR detection and cancer diagnostics. Nanoscale Horiz. 2020;5(2):294–307. 10.1039/c9nh00590k. 165. Ma J Zhao J Liu X Gu C Zeng S Birowosuto MD Ultrasensitive SERS-based detection of prostate cancer exosome using Cu2O–CuO@Ag composite nanowires Biosens Bioelectron 2024 10.1016/j.bios.2023.115775 39492182 Ma J, Zhao J, Liu X, Gu C, Zeng S, Birowosuto MD, et al. Ultrasensitive SERS-based detection of prostate cancer exosome using Cu2O–CuO@Ag composite nanowires. Biosens Bioelectron. 2024. 10.1016/j.bios.2023.115775. 39492182 10.1016/j.bios.2023.115775 166. Zhai J Li X Zhang J Pan H Peng Q Gan H SERS/electrochemical dual-mode biosensor based on multi-functionalized molybdenum disulfide nanosheet probes and SERS-active Ag nanorods array electrodes for reliable detection of cancer-related miRNA Sens Actuators B Chem. 2022 10.1016/j.snb.2022.132245 Zhai J, Li X, Zhang J, Pan H, Peng Q, Gan H, et al. SERS/electrochemical dual-mode biosensor based on multi-functionalized molybdenum disulfide nanosheet probes and SERS-active Ag nanorods array electrodes for reliable detection of cancer-related miRNA. Sens Actuators B Chem. 2022. 10.1016/j.snb.2022.132245. 167. Fan M Han S Huang Q Chen J Feng S Lu Y Ratiometric SERS-based assay with “sandwich” structure for detection of serotonin Microchimica Acta 2023 10.1007/s00604-023-05634-0 36821003 Fan M, Han S, Huang Q, Chen J, Feng S, Lu Y, et al. Ratiometric SERS-based assay with “sandwich” structure for detection of serotonin. Microchimica Acta. 2023. 10.1007/s00604-023-05634-0. 36821003 10.1007/s00604-023-05634-0 168. Si Y Xu L Deng T Zheng J Li J Catalytic hairpin self-assembly-based SERS sensor array for the simultaneous measurement of multiple cancer-associated miRNAs ACS Sens 2020 5 12 4009 4016 10.1021/acssensors.0c01876 33284591 Si Y, Xu L, Deng T, Zheng J, Li J. Catalytic hairpin self-assembly-based SERS sensor array for the simultaneous measurement of multiple cancer-associated miRNAs. ACS Sens. 2020;5(12):4009–16. 10.1021/acssensors.0c01876. 33284591 10.1021/acssensors.0c01876 169. Kenry NF Clark L Panikkanvalappil SR Andreiuk B Andreou C Advances in surface enhanced Raman spectroscopy for in vivo imaging in oncology Nanotheranostics 2022 10.7150/ntno.62970 34976579 PMC8671959 Kenry NF, Clark L, Panikkanvalappil SR, Andreiuk B, Andreou C. Advances in surface enhanced Raman spectroscopy for in vivo imaging in oncology. Nanotheranostics. 2022. 10.7150/ntno.62970. 34976579 10.7150/ntno.62970 PMC8671959 170. Fales AM Yuan H Vo-Dinh T Silica-coated gold nanostars for combined surface-enhanced Raman scattering (SERS) detection and singlet-oxygen generation: a potential nanoplatform for theranostics Langmuir 2011 27 19 12186 12190 10.1021/la202602q 21859159 PMC4022297 Fales AM, Yuan H, Vo-Dinh T. Silica-coated gold nanostars for combined surface-enhanced Raman scattering (SERS) detection and singlet-oxygen generation: a potential nanoplatform for theranostics. Langmuir. 2011;27(19):12186–90. 10.1021/la202602q. 21859159 10.1021/la202602q PMC4022297 171. Zhang Y Qian J Wang D Wang Y He S Multifunctional gold nanorods with ultrahigh stability and tunability for in vivo fluorescence imaging, SERS detection, and photodynamic therapy Angewandte Chemie Int Edition 2013 52 4 1148 1151 10.1002/anie.201207909 23233455 Zhang Y, Qian J, Wang D, Wang Y, He S. Multifunctional gold nanorods with ultrahigh stability and tunability for in vivo fluorescence imaging, SERS detection, and photodynamic therapy. Angewandte Chemie Int Edition. 2013;52(4):1148–51. 10.1002/anie.201207909. 10.1002/anie.201207909 23233455 172. Seo SH Kim BM Joe A Han HW Chen X Cheng Z NIR-light-induced surface-enhanced Raman scattering for detection and photothermal/photodynamic therapy of cancer cells using methylene blue-embedded gold nanorod@SiO2 nanocomposites Biomaterials 2014 35 10 3309 3318 10.1016/j.biomaterials.2013.12.066 24424205 PMC4576838 Seo SH, Kim BM, Joe A, Han HW, Chen X, Cheng Z, et al. NIR-light-induced surface-enhanced Raman scattering for detection and photothermal/photodynamic therapy of cancer cells using methylene blue-embedded gold nanorod@SiO2 nanocomposites. Biomaterials. 2014;35(10):3309–18. 10.1016/j.biomaterials.2013.12.066. 24424205 10.1016/j.biomaterials.2013.12.066 PMC4576838 173. Seo SH Joe A Han HW Manivasagan P Jang ES Mesoporous silica-layered gold nanorod core@silver shell nanostructures for intracellular SERS imaging and phototherapy Pharmaceutics. 2024 10.3390/pharmaceutics16010137 38276508 PMC10821141 Seo SH, Joe A, Han HW, Manivasagan P, Jang ES. Mesoporous silica-layered gold nanorod core@silver shell nanostructures for intracellular SERS imaging and phototherapy. Pharmaceutics. 2024. 10.3390/pharmaceutics16010137. 38276508 10.3390/pharmaceutics16010137 PMC10821141 174. Su Y Yuan B Jiang Y Wu P Huang X Zhu J-J A bioinspired hollow g-C 3 4 Chem Sci 2022 13 22 6573 6582 10.1039/D2SC01534J 35756512 PMC9172571 Su Y, Yuan B, Jiang Y, Wu P, Huang X, Zhu J-J, et al. A bioinspired hollow g-C 3 4 35756512 10.1039/d2sc01534j PMC9172571 175. Seo SH Joe A Han HW Manivasagan P Jang ES Methylene blue-loaded mesoporous silica-coated gold nanorods on graphene oxide for synergistic photothermal and photodynamic therapy Pharmaceutics. 2022 10.3390/pharmaceutics14102242 36297675 PMC9612258 Seo SH, Joe A, Han HW, Manivasagan P, Jang ES. Methylene blue-loaded mesoporous silica-coated gold nanorods on graphene oxide for synergistic photothermal and photodynamic therapy. Pharmaceutics. 2022. 10.3390/pharmaceutics14102242. 36297675 10.3390/pharmaceutics14102242 PMC9612258 176. Zhu W Gao MY Zhu Q Chi B Zeng LW Hu JM Monodispersed plasmonic Prussian blue nanoparticles for zero-background SERS/MRI-guided phototherapy Nanoscale 2020 12 5 3292 3301 10.1039/c9nr08471a 31971195 Zhu W, Gao MY, Zhu Q, Chi B, Zeng LW, Hu JM, et al. Monodispersed plasmonic Prussian blue nanoparticles for zero-background SERS/MRI-guided phototherapy. Nanoscale. 2020;12(5):3292–301. 10.1039/c9nr08471a. 31971195 10.1039/c9nr08471a 177. Fales AM Yuan H Vo-Dinh T Cell-penetrating peptide enhanced intracellular Raman imaging and photodynamic therapy Mol Pharm 2013 10 6 2291 2298 10.1021/mp300634b 23659475 PMC3997176 Fales AM, Yuan H, Vo-Dinh T. Cell-penetrating peptide enhanced intracellular Raman imaging and photodynamic therapy. Mol Pharm. 2013;10(6):2291–8. 10.1021/mp300634b. 23659475 10.1021/mp300634b PMC3997176 178. Fales AM Crawford BM Vo-Dinh T Folate receptor-targeted theranostic nanoconstruct for surface-enhanced Raman scattering imaging and photodynamic therapy ACS Omega 2016 1 4 730 735 10.1021/acsomega.6b00176 30023488 PMC6044700 Fales AM, Crawford BM, Vo-Dinh T. Folate receptor-targeted theranostic nanoconstruct for surface-enhanced Raman scattering imaging and photodynamic therapy. ACS Omega. 2016;1(4):730–5. 10.1021/acsomega.6b00176. 30023488 10.1021/acsomega.6b00176 PMC6044700 179. Zhao L Kim TH Kim HW Ahn JC Kim SY Surface-enhanced Raman scattering (SERS)-active gold nanochains for multiplex detection and photodynamic therapy of cancer Acta Biomater 2015 20 155 164 10.1016/j.actbio.2015.03.036 25848726 Zhao L, Kim TH, Kim HW, Ahn JC, Kim SY. Surface-enhanced Raman scattering (SERS)-active gold nanochains for multiplex detection and photodynamic therapy of cancer. Acta Biomater. 2015;20:155–64. 10.1016/j.actbio.2015.03.036. 25848726 10.1016/j.actbio.2015.03.036 180. Zhao L Choi J Lu Y Kim SY Targeted photodynamic therapy activities of surface-enhanced Raman scattering-active theranostic system based on folate/hyaluronic acid-functionalized gold nanochains J Biomed Nanotechnol 2019 15 3 544 554 10.1166/jbn.2019.2710 31165699 Zhao L, Choi J, Lu Y, Kim SY. Targeted photodynamic therapy activities of surface-enhanced Raman scattering-active theranostic system based on folate/hyaluronic acid-functionalized gold nanochains. J Biomed Nanotechnol. 2019;15(3):544–54. 10.1166/jbn.2019.2710. 31165699 10.1166/jbn.2019.2710 181. Narayanan N Kim JH Santhakumar H Joseph MM Karunakaran V Shamjith S Nanotheranostic Probe built on methylene blue loaded cucurbituril [8] and gold nanorod: targeted phototherapy in combination with SERS imaging on breast cancer cells J Phys Chem B 2021 125 49 13415 13424 10.1021/acs.jpcb.1c08609 34871005 Narayanan N, Kim JH, Santhakumar H, Joseph MM, Karunakaran V, Shamjith S, et al. Nanotheranostic Probe built on methylene blue loaded cucurbituril [8] and gold nanorod: targeted phototherapy in combination with SERS imaging on breast cancer cells. J Phys Chem B. 2021;125(49):13415–24. 10.1021/acs.jpcb.1c08609. 34871005 10.1021/acs.jpcb.1c08609 182. Simon T Potara M Gabudean A-M Licarete E Banciu M Astilean S Designing theranostic agents based on pluronic stabilized gold nanoaggregates loaded with methylene blue for multimodal cell imaging and enhanced photodynamic therapy ACS Appl Mater Interfaces 2015 7 30 16191 16201 10.1021/acsami.5b04734 26151097 Simon T, Potara M, Gabudean A-M, Licarete E, Banciu M, Astilean S. Designing theranostic agents based on pluronic stabilized gold nanoaggregates loaded with methylene blue for multimodal cell imaging and enhanced photodynamic therapy. ACS Appl Mater Interfaces. 2015;7(30):16191–201. 10.1021/acsami.5b04734. 26151097 10.1021/acsami.5b04734 183. Tang P Xing M Xing X Tao Q Cheng W Liu S Receptor-mediated photothermal/photodynamic synergistic anticancer nanodrugs with SERS tracing function Colloids Surf B Biointerf 2021 10.1016/j.colsurfb.2020.111550 33385819 Tang P, Xing M, Xing X, Tao Q, Cheng W, Liu S, et al. Receptor-mediated photothermal/photodynamic synergistic anticancer nanodrugs with SERS tracing function. Colloids Surf B Biointerf. 2021. 10.1016/j.colsurfb.2020.111550. 10.1016/j.colsurfb.2020.111550 33385819 184. Wang J Sun J Wang Y Chou T Zhang Q Zhang B Gold nanoframeworks with mesopores for Raman-photoacoustic imaging and photo-chemo tumor therapy in the second near-infrared biowindow Adv Funct Mater 2020 10.1002/adfm.201908825 34163312 PMC8218930 Wang J, Sun J, Wang Y, Chou T, Zhang Q, Zhang B, et al. Gold nanoframeworks with mesopores for Raman-photoacoustic imaging and photo-chemo tumor therapy in the second near-infrared biowindow. Adv Funct Mater. 2020. 10.1002/adfm.201908825. 34163312 10.1002/adfm.201908825 PMC8218930 185. Spedalieri C Kneipp J Surface enhanced Raman scattering for probing cellular biochemistry Nanoscale 2022 14 14 5314 5328 10.1039/D2NR00449F 35315478 PMC8988265 Spedalieri C, Kneipp J. Surface enhanced Raman scattering for probing cellular biochemistry. Nanoscale. 2022;14(14):5314–28. 10.1039/D2NR00449F. 35315478 10.1039/d2nr00449f PMC8988265 186. Chen S Sun X Fu M Liu X Pang S You Y Dual-source powered nanomotor with integrated functions for cancer photo-theranostics Biomaterials 2022 10.1016/j.biomaterials.2022.121744 35999081 Chen S, Sun X, Fu M, Liu X, Pang S, You Y, et al. Dual-source powered nanomotor with integrated functions for cancer photo-theranostics. Biomaterials. 2022. 10.1016/j.biomaterials.2022.121744. 35999081 10.1016/j.biomaterials.2022.121744 187. Yue J Liang L Shen Y Guan X Zhang J Li Z Investigating dynamic molecular events in melanoma cell nucleus during photodynamic therapy by SERS Front Chem 2019 10.3389/fchem.2018.00665 30746359 PMC6360157 Yue J, Liang L, Shen Y, Guan X, Zhang J, Li Z, et al. Investigating dynamic molecular events in melanoma cell nucleus during photodynamic therapy by SERS. Front Chem. 2019. 10.3389/fchem.2018.00665. 30746359 10.3389/fchem.2018.00665 PMC6360157 188. Liu J Zheng T Tian Y Functionalized h-BN Nanosheets as a theranostic platform for SERS real-time monitoring of MicroRNA and photodynamic therapy Angewandte Chemie Int Edition 2019 58 23 7757 7761 10.1002/anie.201902776 30963650 Liu J, Zheng T, Tian Y. Functionalized h-BN Nanosheets as a theranostic platform for SERS real-time monitoring of MicroRNA and photodynamic therapy. Angewandte Chemie Int Edition. 2019;58(23):7757–61. 10.1002/anie.201902776. 10.1002/anie.201902776 30963650 189. Li J Tian Y Zheng T A multifunctional nanoprobe for real-time SERS monitoring of invasion ability affected by photodynamic therapy Chem Commun 2022 58 45 6542 6545 10.1039/d2cc01140a 35579480 Li J, Tian Y, Zheng T. A multifunctional nanoprobe for real-time SERS monitoring of invasion ability affected by photodynamic therapy. Chem Commun. 2022;58(45):6542–5. 10.1039/d2cc01140a. 10.1039/d2cc01140a 35579480 190. Zhang X Ge Y Liu M Pei Y He P Song W DNA-Au janus nanoparticles for in situ SERS detection and targeted chemo-photodynamic synergistic therapy Anal Chem 2022 94 22 7823 7832 10.1021/acs.analchem.1c05649 35603574 Zhang X, Ge Y, Liu M, Pei Y, He P, Song W, et al. DNA-Au janus nanoparticles for in situ SERS detection and targeted chemo-photodynamic synergistic therapy. Anal Chem. 2022;94(22):7823–32. 10.1021/acs.analchem.1c05649. 10.1021/acs.analchem.1c05649 35603574 191. Shamjith S Joseph MM Murali VP Remya GS Nair JB Suresh CH NADH-depletion triggered energy shutting with cyclometalated iridium (III) complex enabled bimodal Luminescence-SERS sensing and photodynamic therapy Biosens Bioelectron 2022 10.1016/j.bios.2022.114087 35182836 Shamjith S, Joseph MM, Murali VP, Remya GS, Nair JB, Suresh CH, et al. NADH-depletion triggered energy shutting with cyclometalated iridium (III) complex enabled bimodal Luminescence-SERS sensing and photodynamic therapy. Biosens Bioelectron. 2022. 10.1016/j.bios.2022.114087. 35182836 10.1016/j.bios.2022.114087 192. Reghukumar C Shamjith S Murali VP Ramya PK Radhakrishnan KV Maiti KK Cyclometalated Ir(III) theranostic molecular probe enabled mitochondria targeted fluorescence-SERS-guided phototherapy in breast cancer cells J Photochem Photobiol B 2024 10.1016/j.jphotobiol.2023.112832 38142588 Reghukumar C, Shamjith S, Murali VP, Ramya PK, Radhakrishnan KV, Maiti KK. Cyclometalated Ir(III) theranostic molecular probe enabled mitochondria targeted fluorescence-SERS-guided phototherapy in breast cancer cells. J Photochem Photobiol B. 2024. 10.1016/j.jphotobiol.2023.112832. 38142588 10.1016/j.jphotobiol.2023.112832 193. Yue J Shen Y Liang L Cong L Xu W Shi W Revealing mitochondrial microenvironmental evolution triggered by photodynamic therapy Anal Chem 2020 92 8 6081 6087 10.1021/acs.analchem.0c00497 32208680 Yue J, Shen Y, Liang L, Cong L, Xu W, Shi W, et al. Revealing mitochondrial microenvironmental evolution triggered by photodynamic therapy. Anal Chem. 2020;92(8):6081–7. 10.1021/acs.analchem.0c00497. 32208680 10.1021/acs.analchem.0c00497 194. Srinivasan S Bhardwaj V Nagasetti A Fernandez-Fernandez A McGoron AJ Multifunctional surface-enhanced Raman spectroscopy-detectable silver nanoparticles for combined photodynamic therapy and pH-triggered chemotherapy J Biomed Nanotechnol 2016 12 12 2202 2219 10.1166/jbn.2016.2312 29372971 Srinivasan S, Bhardwaj V, Nagasetti A, Fernandez-Fernandez A, McGoron AJ. Multifunctional surface-enhanced Raman spectroscopy-detectable silver nanoparticles for combined photodynamic therapy and pH-triggered chemotherapy. J Biomed Nanotechnol. 2016;12(12):2202–19. 10.1166/jbn.2016.2312. 29372971 10.1166/jbn.2016.2312 195. Jibin K Prasad JS Saranya G Shenoy SJ Maiti KK Jayasree RS Optically controlled hybrid metamaterial of plasmonic spiky gold inbuilt graphene sheets for bimodal imaging guided multimodal therapy Biomater Sci 2020 8 12 3381 3391 10.1039/d0bm00312c 32377650 Jibin K, Prasad JS, Saranya G, Shenoy SJ, Maiti KK, Jayasree RS. Optically controlled hybrid metamaterial of plasmonic spiky gold inbuilt graphene sheets for bimodal imaging guided multimodal therapy. Biomater Sci. 2020;8(12):3381–91. 10.1039/d0bm00312c. 32377650 10.1039/d0bm00312c 196. Li L Yang J Wei J Jiang C Liu Z Yang B SERS monitoring of photoinduced-enhanced oxidative stress amplifier on Au@carbon dots for tumor catalytic therapy Light Sci Appl. 2022 10.1038/s41377-022-00968-5 36180470 PMC9525678 Li L, Yang J, Wei J, Jiang C, Liu Z, Yang B, et al. SERS monitoring of photoinduced-enhanced oxidative stress amplifier on Au@carbon dots for tumor catalytic therapy. Light Sci Appl. 2022. 10.1038/s41377-022-00968-5. 36180470 10.1038/s41377-022-00968-5 PMC9525678 197. Veloso AB Longo JPF Muehlmann LA Tollstadius BF Souza PEN Azevedo RB SERS investigation of cancer cells treated with PDT: quantification of cell survival and follow-up Sci Rep 2017 10.1038/s41598-017-07469-1 28775257 PMC5543153 Veloso AB, Longo JPF, Muehlmann LA, Tollstadius BF, Souza PEN, Azevedo RB, et al. SERS investigation of cancer cells treated with PDT: quantification of cell survival and follow-up. Sci Rep. 2017. 10.1038/s41598-017-07469-1. 28775257 10.1038/s41598-017-07469-1 PMC5543153 198. Chia ZC Chen YL Chuang CH Hsieh CH Chen YJ Chen KH Polyphenol-assisted assembly of Au-deposited polylactic acid microneedles for SERS sensing and antibacterial photodynamic therapy Chem Commun 2023 59 42 6339 6342 10.1039/d3cc00733b 37186113 Chia ZC, Chen YL, Chuang CH, Hsieh CH, Chen YJ, Chen KH, et al. Polyphenol-assisted assembly of Au-deposited polylactic acid microneedles for SERS sensing and antibacterial photodynamic therapy. Chem Commun. 2023;59(42):6339–42. 10.1039/d3cc00733b. 10.1039/d3cc00733b 37186113 199. Zhou Z Peng S Sui M Chen S Huang L Xu H Multifunctional nanocomplex for surface-enhanced Raman scattering imaging and near-infrared photodynamic antimicrobial therapy of vancomycin-resistant bacteria Colloids Surf B Biointerfaces 2018 161 394 402 10.1016/j.colsurfb.2017.11.005 29112913 Zhou Z, Peng S, Sui M, Chen S, Huang L, Xu H, et al. Multifunctional nanocomplex for surface-enhanced Raman scattering imaging and near-infrared photodynamic antimicrobial therapy of vancomycin-resistant bacteria. Colloids Surf B Biointerfaces. 2018;161:394–402. 10.1016/j.colsurfb.2017.11.005. 29112913 10.1016/j.colsurfb.2017.11.005 200. Zhang X Xiong Y Cai S Wu T Lian Z Wang C Versatile gold-silver-PB nanojujubes for multi-modal detection and photo-responsive elimination against bacteria Front Chem 2023 10.3389/fchem.2023.1211523 37284578 PMC10239827 Zhang X, Xiong Y, Cai S, Wu T, Lian Z, Wang C, et al. Versatile gold-silver-PB nanojujubes for multi-modal detection and photo-responsive elimination against bacteria. Front Chem. 2023. 10.3389/fchem.2023.1211523. 37284578 10.3389/fchem.2023.1211523 PMC10239827 201. Ferger M Ban Ž Krošl I Tomić S Dietrich L Lorenzen S Bis(phenylethynyl)arene linkers in Tetracationic Bis-triarylborane chromophores control fluorimetric and Raman sensing of Various DNAs and RNAs Chem Eur J 2021 27 16 5142 5159 10.1002/chem.202005141 33411942 PMC8048639 Ferger M, Ban Ž, Krošl I, Tomić S, Dietrich L, Lorenzen S, et al. Bis(phenylethynyl)arene linkers in Tetracationic Bis-triarylborane chromophores control fluorimetric and Raman sensing of Various DNAs and RNAs. Chem Eur J. 2021;27(16):5142–59. 10.1002/chem.202005141. 33411942 10.1002/chem.202005141 PMC8048639 202. Božinović K Nestić D Michail E Ferger M Košćak M Lambert C Diethynylarene-linked bis(triarylborane)cations as theranostic agents for tumor cell and virus-targeted photodynamic therapy J Photochem Photobiol B 2022 10.1016/j.jphotobiol.2022.112523 35868133 Božinović K, Nestić D, Michail E, Ferger M, Košćak M, Lambert C, et al. Diethynylarene-linked bis(triarylborane)cations as theranostic agents for tumor cell and virus-targeted photodynamic therapy. J Photochem Photobiol B. 2022. 10.1016/j.jphotobiol.2022.112523. 35868133 10.1016/j.jphotobiol.2022.112523 203. Liu TM Yu J Chang CA Chiou A Chiang HK Chuang YC One-step shell polymerization of inorganic nanoparticles and their applications in SERS/nonlinear optical imaging, drug delivery, and catalysis Sci Rep 2014 10.1038/srep05593 24998932 PMC4083277 Liu TM, Yu J, Chang CA, Chiou A, Chiang HK, Chuang YC, et al. One-step shell polymerization of inorganic nanoparticles and their applications in SERS/nonlinear optical imaging, drug delivery, and catalysis. Sci Rep. 2014. 10.1038/srep05593. 24998932 10.1038/srep05593 PMC4083277 204. Cialla-May D Bonifacio A Bocklitz T Markin A Markina N Fornasaro S Biomedical SERS—the current state and future trends Chem Soc Rev 2024 10.1039/D4CS00090K 39109571 Cialla-May D, Bonifacio A, Bocklitz T, Markin A, Markina N, Fornasaro S, et al. Biomedical SERS—the current state and future trends. Chem Soc Rev. 2024. 10.1039/D4CS00090K. 39109571 10.1039/d4cs00090k 205. Moisoiu V Iancu SD Stefancu A Moisoiu T Pardini B Dragomir MP SERS liquid biopsy: an emerging tool for medical diagnosis Colloids Surf B Biointerfaces 2021 10.1016/j.colsurfb.2021.112064 34517219 Moisoiu V, Iancu SD, Stefancu A, Moisoiu T, Pardini B, Dragomir MP, et al. SERS liquid biopsy: an emerging tool for medical diagnosis. Colloids Surf B Biointerfaces. 2021. 10.1016/j.colsurfb.2021.112064. 34517219 10.1016/j.colsurfb.2021.112064 206. Farhadi A Roxin Á Wilson BC Zheng G Nano-enabled SERS reporting photosensitizers Theranostics 2015 5 5 469 476 10.7150/thno.10694 25767614 PMC4350009 Farhadi A, Roxin Á, Wilson BC, Zheng G. Nano-enabled SERS reporting photosensitizers. Theranostics. 2015;5(5):469–76. 10.7150/thno.10694. 25767614 10.7150/thno.10694 PMC4350009 207. Hanna K Krzoska E Shaaban AM Muirhead D Abu-Eid R Speirs V Raman spectroscopy: current applications in breast cancer diagnosis, challenges and future prospects Br J Cancer 2022 10.1038/s41416-021-01659-5 34893761 PMC8661339 Hanna K, Krzoska E, Shaaban AM, Muirhead D, Abu-Eid R, Speirs V. Raman spectroscopy: current applications in breast cancer diagnosis, challenges and future prospects. Br J Cancer. 2022. 10.1038/s41416-021-01659-5. 34893761 10.1038/s41416-021-01659-5 PMC8661339 208. Malachowski T Hassel A Engineering nanoparticles to overcome immunological barriers for enhanced drug delivery Eng Regener 2020 1 35 50 10.1016/j.engreg.2020.06.001 Malachowski T, Hassel A. Engineering nanoparticles to overcome immunological barriers for enhanced drug delivery. Eng Regener. 2020;1:35–50. 10.1016/j.engreg.2020.06.001. ",
  "metadata": {
    "Title of this paper": "Engineering nanoparticles to overcome immunological barriers for enhanced drug delivery",
    "Journal it was published in:": "Discover Nano",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488552/"
  }
}