{
  "title": "Paper_1236",
  "abstract": "Cancer Epidemiol Biomarkers Prev Cancer Epidemiol Biomarkers Prev 319 nihpa Cancer epidemiology, biomarkers & prevention : a publication of the American Association for Cancer Research, cosponsored by the American Society of Preventive Oncology 1055-9965 1538-7755 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12468573 PMC12468573.1 12468573 12468573 NIHMS2021066 39208026 10.1158/1055-9965.EPI-24-0678 NIHMS2021066 NIHPA2021066 1 Article Prostate cancer disparities in clinical characteristics and survival among Black and Latino patients considering nativity: findings from the California Cancer Registry Freedland Alexis R. 1 * Mendez Joel Sanchez 2 * Liu Lihua 2 3 4 Hamilton Ann S. 2 3 4 Zhang Juanjuan 2 3 Hwang Amie E. 2 3 Ballas Leslie 5 Abreu Andre Luis 6 Deapen Dennis 2 3 4 Stern Mariana C. 2 4 6 1 2 3 4 5 6 * These authors contributed equally to this work as co-first authors Author Contributions: Correspondence: marianas@usc.edu The authors declare no potential conflicts of interest. 01 11 2024 33 11 497541 1512 1522 18 09 2025 26 09 2025 27 09 2025 27 09 2025 Background. We investigated clinical characteristics and prostate cancer (PCa) survival patterns among Latino patients considering nativity compared to non-Latino Black (NLB) and non-Latino White (NLW) patients. Methods. We used data from the California Cancer Registry (1995–2021), which included 347,540 NLW, 50,032 NLB, and 75,238 Latino PCa patients. Frequencies of sociodemographic and clinical variables were assessed with Chi-square tests. Multivariable regression models were fitted to evaluate determinants of treatment reception, Gleason upgrade, and survival differences. Exploratory analyses were conducted grouping Latino cases into US-born and non-US-born by country-of-origin. Results. Compared to NLW, NLB cases had the greatest proportion of younger patients, whereas non-US-born Latino patients had the greatest proportion of low socio-economic status and uninsured patients. Non-US-born Latinos showed greater proportion of diagnoses completed with <6 core biopsies, Gleason >8, stage IV tumors and metastasis. Multivariable analyses showed that compared to NLW, Latino patients were as likely to receive treatment, whereas NLB cases were less likely (OR = 0.81, 95% CI: 0.67–0.98, p = 0.029). Compared to NLW, Non-US-born Latino cases were less likely to die of PCa (HR = 0.78; 95% CI = 0.64–0.94, p=0.011), with no difference reported for NLB cases. Conclusions. Considering sociodemographic and clinical characteristics, non-US-born Latino PCa patients had better survival than NLW. This highlights the need to identify key determinants of these survival differences, and the importance of sociodemographic and clinical determinants in survival disparities. Impact. Our study emphasizes the importance of considering nativity among Latino patients to understand PCa disparities and outcomes in this population. Latino Hispanic prostate cancer Black African American pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Prostate cancer disparities in clinical characteristics and survival among Black and Latino patients considering nativity: findings from the California Cancer Registry",
    "Journal it was published in:": "Cancer epidemiology, biomarkers & prevention : a publication of the American Association for Cancer Research, cosponsored by the American Society of Preventive Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468573/"
  }
}