{
  "title": "Paper_587",
  "abstract": "pmc Discov Oncol Discov Oncol 4139 discon Discover Oncology 2730-6011 Springer PMC12480192 PMC12480192.1 12480192 12480192 41021173 10.1007/s12672-025-03577-x 3577 1 Research Deciphering key chemotherapeutic drug targets within tyrosine metabolism for breast cancer and advancing a wide-ranging diagnostic strategy Lu Dan 1 Yang Jun 2 Wu Reng-min 2 Xie Zi-lu 2 Cao Shu-hang 2 Shi Huan-huan 2 Jiang Shaofeng 2 Yi Chen 470835297@qq.com 2 Chen Dong-juan chendj@alumni.hust.edu.cn 1 3 1 https://ror.org/00p991c53 grid.33199.31 0000 0004 0368 7223 Department of Laboratory Medicine, Maternal and Child Health Hospital of Hubei Province, Tongji Medical college, Huazhong University of Science and Technology, 2 3 https://ror.org/02taaxx56 grid.477484.c Children’s Infectious Diseases Prevention and Control Center, Maternal and Child Health Hospital of Hubei Province, 29 9 2025 12 2025 16 478248 1749 2 5 2025 2 9 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background The impact of tyrosine metabolism on the early diagnosis and treatment of breast cancer remains unclear. This underlines importance of exploring its mechanisms. Methods This study conducted an integrated analysis of breast cancer transcriptome data from the TCGA and GEO databases, utilizing differential expression analysis, enrichment analysis, immune infiltration analysis, single-cell RNA sequencing analysis, hdWGCNA analysis, and molecular docking to investigate the role of tyrosine metabolism in breast cancer and its relationship with chemotherapy response. Results The co-expression prognosis model of tyrosine metabolism developed in this study demonstrated superior performance in the prognostic assessment of breast cancer, achieving an AUC value of 0.735, surpassing traditional clinical indicators. The identified two key genes(MAOA, MAOB) and their interaction network showed significant value in the diagnosis and prognosis of breast cancer. Moreover, the early diagnosis model “Extra Trees (BO)” developed using machine learning algorithms exhibited excellent stability and generalization capability. These findings not only highlight the critical role of tyrosine metabolism in regulating the tumor immune microenvironment but also mark Monoamine oxidase A (MAOA) and Monoamine oxidase B (MAOB) as important potential biomarkers linking immunotherapy and chemotherapy. Conclusion This research provides an effective model for the prognostic assessment and early diagnosis of breast cancer, opening new avenues for research into the precision treatment of breast cancer and the management of chemotherapy side effects. Supplementary Information The online version contains supplementary material available at 10.1007/s12672-025-03577-x. Keywords Tyrosine metabolism Tumor immune microenvironment Chemotherapy Early diagnosis Precision medicine the PhD fellowship of Nanchang Hangkong University EA202008259 Yi Chen Natural Science Foundation of Hubei Province 2019CFB391 Chen Dong-juan pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Science+Business Media LLC, part of Springer Nature 2025 Introduction Breast cancer is one of the most common malignant tumors among women globally [ 1 2 3 4 5 6 7 8 9 10 11 12 13 In recent years, research has indicated that the liver plays a significant role in tyrosine breakdown metabolism (TM) [ 14 15 14 16 17 18 19 20 This study focuses on the role of tyrosine metabolism in breast cancer. By integrating multiple gene expression databases, including TCGA and GEO, we identified commonly differentially expressed genes in breast cancer. Functional enrichment analyses of these genes revealed key biological pathways and genes closely associated with breast cancer progression. Recognizing that tyrosine metabolism involves complex interactions among multiple genes, we constructed a prognostic risk model for breast cancer based on the expression profiles of tyrosine metabolism-related genes (TMRGs). Compared with traditional clinical indicators, this model showed superior performance in predicting patient outcomes. We also established a protein–protein interaction (PPI) network to pinpoint core genes and subnetworks involved in tyrosine metabolism. One key module, TMSn1, was selected for further analysis. Genes related to TMSn1 were evaluated for their independent value in breast cancer diagnosis and prognosis. In addition, we applied various machine learning algorithms to develop a model for early breast cancer detection. The study further explored how TMSn1-related genes influence the tumor immune microenvironment, aiming to provide theoretical support for immunotherapy. Based on the expression profiles of 33 TMRGs, we identified two distinct molecular subtypes of breast cancer and compared their functional characteristics and treatment responses. A subtype-specific diagnostic model was also built using TMSn1-related genes. To promote precise treatment and manage chemotherapy-related side effects, we conducted molecular docking analyses between tyrosine metabolism core genes and existing chemotherapeutic agents, including drugs used to control side effects. This helped identify potential therapeutic targets and biomarkers. Additionally, by integrating single-cell RNA sequencing data and high-dimensional weighted gene co-expression network analysis (hdWGCNA), we further validated the central role of tyrosine metabolism in the breast cancer immune microenvironment. Finally, the findings were robustly validated using eight GEO datasets and real-time quantitative PCR experiments, ensuring the reliability and applicability of our conclusions.  Fig. 1 The specific process of this study Methods Data source The RNA transcriptome data (113 Normal, 1103 Tumor), corresponding clinical data (163 Normal, 1121 Tumor), and survival data (1081 Tumor) of breast cancer were obtained from the USCS Xena database ( https://xena.ucsc.edu/ GSE14999 GSE22820 GSE24124 GSE29044 GSE32641 GSE42568 GSE53752 https://www.ncbi.nlm.nih.gov/geo/ GSE176078 https://www.cancerrxgene.org/ \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:\\begin{array}{c}{TPM}_{i}=\\left(\\frac{{FPKM}_{i}}{{\\sum}_{j}{FPKM}_{j}}\\right)\\cdot\\:{10}^{6}\\:\\end{array}$$\\end{document} In this formula, i represents gene i, and j represents the total number of genes, with a total of j genes. Identify key pathway and acquire associated genes To accurately identify key pathways in breast cancer, differential expression analysis was performed separately on the TCGA breast cancer transcriptomic dataset and the three GEO datasets ( GSE24124 GSE32641 GSE53752 Due to inherent differences in data statistics across different databases, to prevent the occurrence of randomness in the identified genes related to tyrosine metabolism, relevant genes for tyrosine metabolism were separately obtained from the Kyoto Encyclopedia of Genes and Genomes (KEGG) database ( https://www.kegg.jp/ https://www.gsea-msigdb.org Co-expression analysis of tyrosine metabolism-related genes Owing to the fact that in a signaling pathway, it is often not individual genes acting alone, but rather, there exists close interconnection among them. Therefore, to verify the existence of close connections among these 33 tyrosine metabolism-related genes (TMRGs), the correlation analysis was conducted on these 33 TMRGs, evaluating the strength of their correlation using the Pearson coefficient. Subsequently, as ridge regression does not have feature selection functionality, which aligns with the intention here of not discarding genes, ridge regression was employed to establish the prognosis coefficients for the 33 TMRGs. The TM score prognosis model was established using formula (2), wherein the prognostic significance of the TM score prognosis model in breast cancer patients was assessed through Kaplan-Meier curve. Additionally, timeROC was utilized to evaluate the prognostic effectiveness of the TM Score prognosis model at 1-year, 3-year, and 5-year interval in breast cancer. \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:\\begin{array}{c}TM\\:Score=\\sum\\limits_{0}^{33}{Exp}_{i}\\cdot {x}_{i}\\:\\end{array}$$\\end{document} In this formula, Exp represents the expression level of gene i, where i represents gene i, and x represents the ridge regression coefficient. To investigate the relationship between TM Score and clinical indicators (age, M, N, T, stage, weight) in breast cancer patients, correlation analysis was first conducted. Furthermore, to further validate the efficacy of the TM Score prognosis model in the clinical prognosis of breast cancer patients, its prognostic effects at 1-year, 3-year, and 5-year interval were comprehensively compared with these commonly encountered clinical indicators in breast cancer patients. The effectiveness of the prognosis model was evaluated using timeROC. Although the cooperative efforts of the 33 TMRGs were crucial for TM, whether there existed key regulatory networks and key genes within the 33 TMRGs, and their roles in breast cancer patients, remained unknown. Therefore, to explore the key regulatory networks among these 33 TMRGs and identify hub genes, a Protein-Protein Interaction (PPI) network of these 33 genes was constructed using the Search Tool for Recurring Instances of Neighboring Genes (STRING) database ( https://cn.string-db.org/ Analysis of diagnostic and prognostic independence Based on the aforementioned analysis, it was determined that there were 12 genes associated with the tyrosine metabolism subnetwork 1 (TMSn1). Firstly, the diagnostic independence and prognostic independence of these 12 genes were evaluated. In terms of diagnostic independence, independent diagnostic models were established for each of the 12 genes, and the diagnostic performance of each diagnostic model was assessed using ROC analysis. Concerning prognostic independence, the expression levels of the 12 genes in breast cancer were examined for prognostic significance using Kaplan-Meier curve, and independent prognostic models were developed accordingly. The prognostic performance of each model at 1 year, 3 years, and 5 years was evaluated using timeROC. The establishment of diagnostic model for the co-expression of 12 genes Among the 12 genes related to TMSn1, although some genes demonstrated relatively high independent diagnostic value, the performance of most genes in diagnosing breast cancer patients was not satisfactory. Additionally, in order to enhance the early diagnosis rate of breast cancer and thus increase the treatment rate, diagnostic models for the co-expression of the 12 genes were constructed using 150 Machine learning methods. These methods included 9 basic machine learning models: Adaptive Boosting (Adaboost), Categorical Boosting (CatBoost), Decision Tree (DT), Extremely Randomized Trees (Extra Trees), Gradient Boosting Decision Tree (GBDT), K-Nearest Neighbor (KNN), Light Gradient Boosting Machine (LightGBM), Logistic Regression (LR), Multilayer Perceptron (MLP), Naive Bayes (NB), Random Forest (RF), Support Vector Machines (SVM), Linear Discriminant Analysis (LDA); and 5 optimization algorithms: Bayesian Optimization (BO), Particle Swarm Optimization (PSO), Genetic Algorithm (GA), Random Searching (RS), Simulated Annealing (SA); as well as two algorithm stacking techniques: VoteClassifier (VC) and Stacking. The AUC values of the test sets were outputted to evaluate the diagnostic performance of the models. To enhance the generalization ability of the models and avoid chance discoveries, RNA transcriptome data of the 12 genes from the TCGA database were used as the training set for each model, while GSE22820 GSE32641 GSE24124 GSE53572 GSE14999 GSE29044 GSE9309 The relationship between the TMSn1 and the immune microenvironment The Leukocyte signature matrix (LM22) dataset was downloaded from a previous study by Newman AM et al. for CIBERSORT analysis of breast cancer patients [ 21 http://cistrome.org/TIMER/ The identification and mechanistic study of BRCA subtype Consensus clustering was applied to 1,081 breast cancer samples to identify molecular subtypes and investigate differences in clinical prognosis and drug resistance. To improve clustering accuracy, expression profiles of 33 TMRGs were used. The optimal number of clusters (K = 2) was determined using the PAC algorithm. In the Consensus clustering process, 80% of the samples and all genes were resampled 1,000 times. The clustering was performed using the PAM algorithm with Pearson correlation as the distance metric. Principal Component Analysis (PCA) was further used to validate the clustering results of the two subtypes. To assess differences in clinical prognosis between the subtypes, Kaplan-Meier survival curves were generated based on patient survival data. To explore potential molecular mechanisms, differential gene expression analysis was performed between the two subtypes, followed by construction of a PPI network and its subnetworks. Subnetworks with a score greater than 5 were selected for further analysis. GO and KEGG enrichment analyses were conducted, and the top five pathways with the highest absolute Z-scores were selected to provide mechanistic insights and guide precision therapy for breast cancer. Additionally, the immune microenvironment differences between the two subtypes were preliminarily evaluated using the CIBERSORT and ssGSEA algorithms. For drug resistance analysis, drug response predictions were conducted for the 1,081 patients using the “calcPhenotype” function in the “oncoPredict” R package, with the parameter set to “standardize” and the GDSC2 cell line Matrix used as the training dataset. Pearson correlation was used to evaluate the associations between the 33 TMRGs and TM Score with IC50 values of 198 drugs. Drugs with an absolute correlation coefficient greater than 0.55 were selected for inter-subtype comparison. Finally, considering the diagnostic significance, independent diagnostic models were constructed for each of the 12 genes related to the TMSn1 subnetwork. The diagnostic performance of each model in distinguishing the two subtypes was assessed using ROC curve analysis. Molecular docking To investigate the binding efficacy of proteins with existing chemotherapy drugs and agents for managing chemotherapy-induced side effects, this study selected two hub genes associated with tyrosine metabolism (MAOA and MAOB), four chemotherapy drugs (doxorubicin, paclitaxel, cyclophosphamide, palbociclib), three small-molecule drugs for treating chemotherapy side effects (palonosetron, netupitant, dexamethasone), and three MAOA/MAOB inhibitors (clorgyline, selegiline, rasagiline) for molecular docking experiments to explore their interaction mechanisms. The 3D structures of small-molecule drugs were obtained from the PubChem database ( https://pubchem.ncbi.nlm.nih.gov/ https://www.chemspider.com/Default.aspx https://www.rcsb.org/ 22 Single cell sequencing analysis and high-dimensional weighted gene co-expression network analysis (hdWGCNA) Based on the GSE176078 n To further study the mechanisms of the above cell clusters, hdWGCNA [ 23 n \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$kME = cor(x, ME)$$\\end{document} In this equation, x represents gene expression level, and ME represents feature vectors. To further investigate the relationship between individual modules and cell clusters, the OverlapModulesDEGs function was used to calculate the odds ratio values between cell clusters and modules. The modules with the strongest associations were selected for GO enrichment analysis and KEGG enrichment analysis. Additionally, the correlation network between modules and the 12 genes related to the TMSn1 was constructed using the Hmisc package and Cytoscape software. External data validation To verify the authenticity of the conclusions drawn in this study and to avoid chance occurrences, expression level differences of two hub genes related to tyrosine metabolism (MAOA and MAOB) were analyzed based on eight datasets: GSE9303, GSE14999 GSE22820 GSE24124 GSE29044 GSE32641 GSE42568 GSE53752 1  Table 1 qPCR primer sequence Primer names Sequence Amplification fragment size (bp) MAOA-F AGGAACGGAAGTTTGTAGGT 191 MAOA-R AGTCAAGGTCGGAGGGAT MAOB-F TGGAGGCACAACAAGAAT 224 MAOB-R TAGGAGGAATAGCACTAATCAC H-GAPDH-F GGGAAACTGTGGCTTGAT 299 H-GAPDH-R GAGTGGGTGTCGCTGTTGA Statistical analysis All statistical analyses in this study were completed using R (v 4.2.1). Pearson coefficient was employed to assess the strength of all correlations, while the Wilcoxon rank sum test was used for comparing differences between two groups. All graphical materials were sourced from Servier Medical Art (smart.servier.com). The significance level of P Results Identification of key pathway in breast cancer To uncover the Main regulatory Biological signaling pathways in BRCA, the differential analysis was performed initially on TCGA breast cancer transcriptome data and three GEO datasets. The analysis revealed 11,046 differentially expressed genes in the TCGA breast cancer transcriptome data, with 6971 genes significantly upregulated and 4075 genes significantly downregulated (Fig. 2 GSE24124 2 GSE32641 2 GSE53572 2 In order to identify genes playing a key role in BRCA, we initially performed an intersection analysis on differentially expressed genes from three GEO datasets, resulting in 443 common genes (Fig. 2 2 Given the potential gene expression differences arising from different platforms and sequencing methods, to rule out the randomness of analysis results, the KEGG enrichment analysis on the shared 257 differentially expressed genes was conducted by integrating the logFC from differential analyses across various datasets (Fig. 2 In order to identify the key regulatory genes in tyrosine metabolism, we retrieved 36 genes from the KEGG database and 47 genes from the MSigDB database. Through the intersection analysis of these two gene sets, we ultimately identified 33 genes as key regulators in tyrosine metabolism (Fig. 2  Fig. 2 Acquisition of genes associated with key biological processes. A B GSE24124 C GSE32641 D GSE53752 E F G H GSE24124 I GSE32641 J GSE53752 K Co-expression analysis of tyrosine metabolism-related genes in BRCA Various Biological processes could not be solely completed by individual genes. Therefore, to investigate whether there was a certain correlation among 33 tyrosine metabolism-related genes in BRCA, the interrelationships among the 33 tyrosine metabolism-related genes were analyzed first. The results showed the significant correlation among these 33 tyrosine metabolism-related genes (Fig. 3 3 3 3  Fig. 3 Establish tyrosine-related genes risk prognostic model. A B C D E P P P Furthermore, the analysis of the correlation between TM Score and various clinical indicators revealed the significant positive correlation with most clinical indicators, including age, M, N, and stage (Fig. 4 4  Fig. 4 The prognostic value of TM Score and clinical indicators in BRCA. A B C D P P P To further investigate the correlation among 33 genes related to tyrosine metabolism, the PPI network was constructed. The results revealed that the PPI network comprised a total of 33 nodes and 181 edges, supporting the notion that there was a close connection among the genes associated with tyrosine metabolism (Fig. 5 5 5  Fig. 5 The construction of the PPI network for the 33 genes related to tyrosine metabolism. A B C The study on the gene independence of tyrosine metabolism subnetwork 1 To delve into the regulatory role of tyrosine metabolism subnetwork 1 in both BRCA and tyrosine metabolism, the assessment was initially conducted on the expression level and independent diagnostic values of its 12 genes (Fig. 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6  Fig. 6 The study on the expression level and independent diagnostic significance of the 12 genes. A B C D E F G H I J K L M N O P Q R S T U V W X P P P Moreover, to assess the independent prognostic value of the 11 genes in tyrosine metabolism subnetwork 1 in BRCA, the evaluations was conducted through KM curves and 1-year, 3-year, and 5-year timeROC analysis (Supplemental Fig. 1A–V). Notably, due to there less than three groups for ADH7 in the underexpression subgroup, it was excluded from the analysis in this context. The analysis results revealed that among the 11 genes, only MAOB exhibited significant independent prognostic significance, with BRCA patients in the underexpression group showing an unfavorable prognosis (Supplemental Fig. 1U). However, it was important to note that the prognostic performance of MaOB at 1 year, 3 years, and 5 years was not favorable, with timeROC AUC values of 0.526, 0.435, and 0.455, respectively, indicating a relatively low independent prognostic value for this gene (Supplemental Fig. 1V). The construction of the co-expression diagnostic model In order to improve the early diagnosis rate of breast cancer patients, the diagnostic model was established by using 150 Machine learning methods when 12 genes related to the TMSn1 work together (Fig. 7 GSE22820 GSE32641 GSE24124 GSE53572 GSE14999 GSE29044 GSE42568  Fig. 7 The early breast cancer diagnosis models was constructed using multiple machine learning methods The connection between 12 genes and the immune microenvironment of BRCA To investigate the correlation between the 12 genes of tyrosine metabolism subnetwork 1 and the immune microenvironment of BRCA, the CIBERSORT algorithm was utilized to calculate the correlation between 22 types of immune cells and the 12 genes (Fig. 8 8 Fig. 8 The relationship between the 12 tyrosine metabolism genes and the immune microenvironment. A B P P P To further investigate the relationship between the 12 tyrosine-related genes and the immune microenvironment, the analysis of the correlation between these 12 genes and 6 types of immune cells was performed using the TIMER database (Fig. 9 The identification of BRCA subtype Tyrosine metabolism relies on the collaborative action of various genes. Therefore, in order to achieve precision treatment for BRCA through tyrosine metabolism, 33 tyrosine metabolism-related genes were employed for BRCA subtype identification. The PAC algorithm was employed to achieve optimal subtype classification, resulting in two clusters: Cluster 1 (C1) and Cluster 2 (C2). Additionally, the examination of clustering outcomes at various K values (Fig. 9 9 9 9  Fig. 9 The identification of BRCA subtype through consensus algorithm. A B C D The functional study and diagnosis of two BRCA subtypes To investigate whether there are differences in biological functions between two BRCA subtypes, differential analysis was first conducted on C1 and C2, resulting in a total of 165 differentially expressed genes (DEGs), with 72 genes upregulated and 93 genes downregulated (Fig. 10 10 10 10 10 To further investigate the 165 DEGs, GO enrichment analysis and KEGG enrichment analysis were performed on subtype subnetwork 1. The GO enrichment analysis indicated that subtype subnetwork 1 was Mainly associated with hormone activity, neuropeptide receptor binding, signaling receptor activator activity, receptor Ligand activity, and G protein-coupled receptor Binding, all with Z scores greater than 0 (Fig. 10 10  Fig. 10 The analysis of differential genes for two subtypes. A B C D E F G Solely assessing the biological functional differences between the two subtypes from the genetic perspective was undoubtedly insufficient. Therefore, the CIBERSORT algorithm and ssGSEA algorithm were separately employed to conduct preliminary analyses on the quantity and proportion of immune cells between the two subtypes (Supplemental Fig. 3 A, B). The analysis results indicated that, in the CIBERSORT algorithm analysis, the proportion of most immune cells in C1 was significantly higher than in C2, including Macrophages M0, Macrophages M2, etc. Conversely, the proportions of cells such as B cells naive and plasma cells were significantly higher in C2 than in C1 (Supplemental Fig. 3 A). In the ssGSEA algorithm analysis results, significant difference in the quantity of most immune cells between the two subtypes were observed (Supplemental Fig. 3B). Taken together, these results suggested that there may be substantial difference in the regulation of the immune microenvironment between the two subtypes. In order to delve into the connection between tyrosine metabolism and two subtypes of BRCA, the correlation between 33 tyrosine metabolism-related genes and 198 drugs was calculated. Drugs with the absolute correlation coefficient greater than 0.55 were selected for analysis, and the drug-gene correlation network was plotted based on the correlation between the IC50 value of drug and gene expression level in BRCA. This network revealed 4 genes: COMT, MIF, IL4I1, FAH, and 9 drugs: CDK9_5576_1708, CDK9_5038_1709, Daporinad_1248, Ribociclib_1632, Axitinib_1021, PF-4708671_1129, ZM447439_1050, WEHI-539_1997, AZD7762_1022 (Fig. 11 11 11 R 11 R 11 11 R 11 R 11 R 11 R  Fig. 11 Drug sensitivity analysis of 33 tyrosine metabolism-related genes. A B C D E F G H I J K L By comparing the IC50 value of the nine drugs obtained above in two subtypes, we aim to explore the relationship between these two subtypes and the nine drugs (Fig. 12 12 12 12 12 12 12 12 12 12  Fig. 12 Drug sensitivity analysis of nine drugs in two subtypes. A B C D E F G H I P P P The analysis results revealed substantial differences between the two subtypes, both in terms of Biological functions and therapeutic implications. Therefore, to achieve precision medicine for BRCA, the expression level of 12 genes in the tyrosine metabolism network 1 were analyzed in C1 and C2, along with their diagnostic efficacy for the two subtypes (Fig. 13 13 13 13 13 13 13 13  Fig. 13 Analysis of the expression level and diagnostic efficacy of 12 key genes in tyrosine metabolism in two subtypes. A B C D E F G H I J K L M N O P Q R T U V W X P P P Docking conformation and interaction force analysis of tyrosine metabolism hub genes Through molecular docking of two hub genes in tyrosine metabolism (MAOA, MAOB) with four BRCA chemotherapy drugs (Cyclophosphamide, Doxorubicin, Paclitaxel, Palbociclib), the connection between tyrosine metabolism and chemotherapy was explored. The analysis results revealed that both MaOA and MAOB can effectively Bind to the four chemotherapy drugs. MaOA formed 3 hydrogen bonds with Cyclophosphamide, with a binding energy of −4.33 kcal/mol (Supplemental Fig. 4A). MaOA bound with Doxorubicin, forming 8 hydrogen bonds and 4 hydrophobic interactions, with a binding energy of −3.75 kcal/mol (Supplemental Fig. 4B). MaOA bound with Paclitaxel, forming 3 hydrogen bonds and 6 hydrophobic interactions, with a binding energy of −2.89 kcal/mol (Supplemental Fig. 4C). MaOA bound with Palbociclib, forming 6 hydrogen bonds and 2 hydrophobic interactions, with a binding energy of −6.11 kcal/mol (Supplemental Fig. 4D). Furthermore, MaOB bound with Cyclophosphamide, forming 3 hydrogen bonds, 1 hydrophobic interaction, and 1 halogen bond, with a binding energy of −4.15 kcal/mol (Fig. 14 14 14 14  Fig. 14 Molecular docking analysis of MAOB with four chemotherapy drugs. A B C D To investigate the relationship between tyrosine metabolism and three antiemetic drugs (Dexamethasone, Netupitant, Palonosetron), molecular docking analysis was conducted for the interaction between MaOA and MaOB with these drugs. The results revealed that MaOA formed 3 hydrogen bonds and 7 hydrophobic interactions with Dexamethasone, with a binding energy of −4.78 kcal/mol (Supplemental Fig. 5A). MaOA formed 6 hydrophobic interactions with Netupitant, resulting in a binding energy of −3.83 kcal/mol (Supplemental Fig. 5B). MaOA formed 8 hydrophobic interactions with Palonosetron, leading to a binding energy of −6.83 kcal/mol (Supplemental Fig. 5C). This suggested that MaOA can effectively Bind to all three antiemetic drugs, with the strongest binding observed with Palonosetron. Similarly, MaOB also demonstrated effective Binding with the antiemetic drugs. MaOB formed 4 hydrogen bonds and 2 hydrophobic interactions with Dexamethasone, resulting in a binding energy of −6.21 kcal/mol (Fig. 15 15 15  Fig. 15 Molecular docking analysis of MAOB with three antiemetic drugs. A B C To establish a comparative experiment, this study investigated the binding energies of three MAOA and MAOB inhibitors (Clorgyline, Selegiline, Rasagiline) with their respective targets. The binding energy of MAOA with Clorgyline was − 5.07 kcal/mol, with Selegiline − 5.32 kcal/mol, and with Rasagiline − 6.11 kcal/mol. For MAOB, the binding energy with Clorgyline was − 4.92 kcal/mol, with Selegiline − 5.87 kcal/mol, and with Rasagiline − 5.98 kcal/mol (Table 2  Table 2 Hub gene-inhibitor binding energies Gene Small molecule drugs Binding energy (kcal/mol) MAOA Clorgyline − 5.07 Selegiline − 5.32 Rasagiline − 6.11 MAOB Clorgyline − 4.92 Selegiline − 5.87 Rasagiline − 5.98 The identification of the cell population for BRCA and HdWGCNA Based on scRNA-seq data from GSE176078 16 16 16 16 16  Fig. 16 The identification of cell clusters in BRCA tissue and the construction of the co-expression network. A B C D E By calculating the kME value for each gene in every module, the top 20 genes with the highest kME value were obtained (Supplemental Fig. 6A). Subsequently, the Ucell algorithm was employed to score the top 20 genes in each module, and the distribution of these scores within each module was analyzed. Notably, modules Celltype-M3, Celltype-M4, Celltype-M6, Celltype-M5, Celltype-M6, and Celltype-M8 exhibited a more concentrated distribution (Supplemental Fig. 6B). Simultaneously, based on the top 20 genes from each module, the top 5 genes were selected from each module to construct a composite central gene network (Supplemental Fig. 6 C). Analysis results revealed a tight interconnection among the 5 genes in each module, except for M9, where the 5 genes showed weaker correlations. For ease of observation regarding the distribution of each module, the supervised UMAP was employed to distinguish between the modules. Each point represented a gene, and it was evident that modules M5, M6, and M8 had a broader distribution range (Supplemental Fig. 6D). Overall, the clustering performance of these 10 modules was satisfactory, enabling subsequent research endeavors. For further exploration of the Biological function of each module and their connections with the seven cell communities, the analysis was conducted on the correlations between the 10 modules, as well as between the modules and traits such as cell gene expression levels, cell gene numbers (nFeature_RNA, nCount_RNA), and the correlation with the seven cell communities. The analysis of inter-module correlation revealed potential close relationships among the modules, with most showing positive correlation. However, Celltype-M6 exhibited negative correlation with five modules: Celltype-M2, Celltype-M3, Celltype-M4, Celltype-M8, and Celltype-M10 (Supplemental Fig. 7A). Furthermore, through comprehensive analysis of the relationship between each module and traits, as well as the seven cell communities, it was observed that most modules exhibited significant positive correlation (Supplemental Fig. 7B). Specifically, the nCount_RNA trait of B cells showed significant negative correlations with nine modules, with no correlation observed with Celltype-M10. Notably, Celltype-M6 was the only module significantly negatively correlated with the expression level and gene numbers of all cells. To explore the relationship between the modules and the seven cell communities from various perspectives, odds ratios were evaluated for the overlap of each module with the seven cell communities. The results indicated that only Celltype-M6 had a unique overlap with the T cell community, exhibiting a high degree of overlap (Supplemental Fig. 7C). In summary, Celltype-M6 module demonstrated significant research value. To delve into its biological functions, genes from the module were extracted, and a protein-protein interaction (PPI) network was constructed (Supplemental Fig. 7D). To investigate the biological functions of the Celltype-M6 module, GO enrichment analysis and KEGG enrichment analysis were performed (Fig. 17 17 17 17 17  Fig. 17 The biological functional analysis of Celltype-M6. A B C D External data verification To validate the conclusions of this study and to avoid the randomness caused by the same group experiments, qPCR experiment was conducted using blood samples from 5 breast cancer patients and 7 healthy individuals, as well as blood samples from 5 breast cancer patients and 3 healthy individuals, to analyze the expression of two tyrosine metabolism hub genes: MAOA and MAOB (Fig. 18 18 18 18 GSE42568 18 Fig. 18 The verification of tyrosine metabolism hub gene expression level. A B C D E GSE14999 F GSE14999 G GSE22820 H GSE22820 I GSE24124 J GSE24124 K GSE29044 L GSE29044 M GSE32641 N GSE32641 O GSE42568 P GSE42568 Q GSE53752 R GSE53752 Discussion Breast cancer, as a highly heterogeneous malignant disease, is dynamically regulated by multidimensional metabolic pathway networks during its development and progression. Classical studies have demonstrated that glycolysis (the Warburg effect) facilitates rapid remodeling of energy supply in tumor cells by upregulating rate-limiting enzymes such as HK2 and LDHA, while glutamine metabolism supports nucleotide synthesis through the GLS1-mediated glutaminolysis pathway, providing essential nitrogen sources and maintaining mitochondrial redox homeostasis [ 24 25 Monoamine oxidase A (MAOA) and Monoamine oxidase B (MAOB) were identified as two hub genes in tyrosine metabolism, with their encoded proteins being mitochondrial enzymes in the human body [ 26 27 28 29 30 31 32 33 34 Although MAOA and MAOB are primarily associated with neuropsychiatric disorders, with a substantial body of research already demonstrating this [ 35 37 38 39 40 41 In this study, a new approach for early diagnosis and clinical treatment targets for breast cancer patients was sought by identifying key pathways - tyrosine metabolism-related genes from different datasets. By establishing the TM Score prognosis model and comparing its prognostic efficacy with common clinical indicators in breast cancer patients, it was found that TM Score generally outperformed various clinical indicators in prognostic efficacy at 1, 3, and 5 years, providing a new tool for clinical prognosis and risk assessment for breast cancer patients. Based on 33 TMRs, the PPI was constructed, and two hub genes of tyrosine metabolism (MAOA and MAOB) as well as a key subnetwork - TMSn1 were identified. In TMSn1, there were a total of 12 genes, including MaOA and MaOB. In the subsequent independent diagnostic and prognostic evaluation of these 12 genes, the independent diagnostic efficacy of the 12 genes varied. Among them, the independent diagnostic AUC value of MaOA was 0.939, and that of MaOB was 0.810. However, almost none of the 12 genes had independent prognostic value, with P values all greater than 0.05, except for MAOB’s independent prognostic model which had statistical significance ( P Through the aforementioned analysis, it was found that both MaOA and MaOB played significant roles in the diagnosis and prognosis of breast cancer. However, they were also found to play important roles in the tumor immune microenvironment. A preliminary analysis of the mechanisms of these 12 genes in the immune tumor microenvironment was conducted based on the CIBERSORT algorithm and the Estimate algorithm. By studying the correlation between 22 types of immune cells and 12 genes, it was observed that these 12 genes were significantly correlated with most immune cells. Specifically, MAOA and MAOB were both significantly negatively correlated with macrophages, and MAOA and MAOB were significantly positively correlated with StromalScore. Additionally, MAOB was also significantly positively correlated with ESTIMATEScore. The results from the TIMER database were consistent with these findings. Macrophages are a key component of the immunosuppressive tumor microenvironment, capable of suppressing the anti-tumor response of T cells in most solid tumors [ 42 43 It is well known that breast cancer is a heterogeneous disease [ 44 45 46 In this study, breast cancer was classified into two subtypes using the Consensus algorithm, with subtype 1 showing a poorer prognosis compared to subtype 2. By studying the molecular functional differences between the two subtypes, it was found that the differences primarily centered around molecular metabolism and hormone action. Furthermore, the two subtypes also exhibited significant differences in the immune microenvironment, with subtype 1 showing significantly higher proportions of Macrophages than subtype 2, while the expression levels of Macrophages in subtype 1 were significantly lower than in subtype 2. This suggested that macrophages may have different effects on tumor immunity in the two subtypes. In addition, the two subtypes showed significant differences in drug resistance in clinical treatment, with COMT, as a gene in TMSn1, being identified as a differential gene between the two subtypes. COMT was mainly negatively correlated with CDK9_5038_1709 and CDK9_5576_1708, and subtype 1 showed sensitivity to both drugs. The subsequent analysis indirectly validated this conclusion by showing significant overexpression of COMT in subtype 1. To achieve precision medicine for breast cancer patients, an independent diagnostic model for 12 TMSn1-related genes was established. Among the 12 independent diagnostic models, the model for MaOB showed the best performance, with an AUC value of 0.848, laying the theoretical foundation for future personalized treatment of breast cancer. Although various treatment methods for breast cancer have emerged nowadays, chemotherapy remains the primary approach for its treatment [ 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 To delve deeper into the impact of tyrosine metabolism on the immune microenvironment of breast cancer, single-cell sequencing analysis was conducted on 26 breast cancer tissue samples from GSE176078 To ensure the authenticity of experimental results and avoid chance conclusions, the expression levels of MAOA and MAOB were validated across eight datasets. It was found that MAOA showed significantly low expression in all eight datasets, while MAOB showed similarly significant low expression in seven datasets, with stable expression in GSE42568 Limitations This study has several limitations that should be acknowledged. First, the absence of functional validation experiments at the cellular and animal levels limits our ability to fully elucidate the dynamic regulatory mechanisms of tyrosine metabolism in breast cancer. Future studies integrating in vivo and in vitro models are necessary to validate the biological relevance of our findings. Second, the precise roles and regulatory networks of MAOA and MAOB within the tumor immune microenvironment—such as their interactions with immune cells and metabolite-mediated signaling—remain insufficiently characterized. Further investigation using integrated multi-omics approaches, including transcriptomics, metabolomics, and single-cell analysis, will be essential to dissect their mechanistic contributions in this context. Additionally, while our molecular docking results suggest potential interactions between candidate drugs and MAOA/MAOB, the lack of molecular dynamics (MD) simulations and time-dependent binding analyses prevents a comprehensive understanding of binding stability and pharmacodynamics. Future research should incorporate MD simulations alongside in vitro binding assays to refine the evaluation of drug efficacy and specificity. Lastly, the relatively small sample size in the qPCR validation cohort may introduce random bias due to limited statistical power. Expanding the clinical sample pool in future studies will be critical to enhancing the robustness and generalizability of our conclusions. Despite these limitations, our findings provide a foundational framework for understanding the involvement of tyrosine metabolism and MAO-related pathways in breast cancer. We anticipate that future work building upon these insights will help clarify therapeutic mechanisms and guide the development of more targeted, metabolism-informed treatment strategies. Conclusion This study established a robust breast cancer prognosis model using 33 TMRGs. Through comparison, it demonstrated excellent performance in clinical prognosis of breast cancer. Additionally, aiming to improve the early diagnosis rate of breast cancer, a diagnostic model was built based on 150 machine learning algorithms. Among them, the Extra Trees (BO) model performed the best among the 150 algorithms and exhibited strong generalization capability, making it applicable for early clinical diagnosis of breast cancer. Furthermore, two hub genes in tyrosine metabolism, MAOA and MAOB, were identified. These genes were found to play crucial roles in the tumor immune microenvironment of breast cancer and might serve as important molecular biomarkers bridging immunotherapy and chemotherapy, as well as targeting therapy and management of chemotherapy side effects. Moreover, two breast cancer subtypes were identified to enable precision medicine, showing significant differences in biological functions and drug resistance in clinical therapy. MAOB was identified as a biomolecular diagnostic marker for subtype diagnosis. Supplementary Information  Supplementary Material 1.  Supplementary Material 2. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Dan Lu and Jun Yang contributed equally Authors contributions Dan Lu: Conducted data analysis and interpretation, drafted the initial manuscript, and participated in revisions across all versions. Jun Yang: Contributed to the research design, primarily participated in data analysis. Ren-min Wu: responsible for data collection, and also contributed to data interpretation. Zilu Xie: Managed medical image processing and data visualization, as well as statistical analyses of the relevant data. Shu-hang Cao: Conducted experimental procedures and data collection, and participated in data analysis and interpretation. Huan-huan Shi: Assist in data visualization. Shaofeng Jiang: Spearheaded the entire research project. Chen Yi: As a co-corresponding author, also offered research direction and insights, managed the laboratory operations, and conducted rigorous quality control and review for each version of the manuscript. Dongjuan Chen: As the corresponding author, provided overall project direction and supervision, oversaw sample collection and experimental validation, and participated in the final manuscript review. Funding We gratefully acknowledge the financial supports from the PhD fellowship of Nanchang Hangkong University (EA202008259), Natural Science Foundation of Hubei Province(2019CFB391). Data availability The data used to support this study is available from the corresponding author upon request. Declarations Ethics approval and consent to participate The study was approved by the Committee on Human Research of Maternal and Child Health Hospital of Hubei Province (2023IEC055). All research was performed in accordance with relevant guidelines and regulations. Consent for publication This manuscript is approved by all authors for publication. Competing interests The authors declare no competing interests. References 1. Shao F Pang X Baeg GH Targeting the JAK/STAT signaling pathway for breast cancer Curr Med Chem 2021 28 25 5137 51 10.2174/0929867328666201207202012 33290193 Shao F, Pang X, Baeg GH. Targeting the JAK/STAT signaling pathway for breast cancer. Curr Med Chem. 2021;28(25):5137–51. 33290193 10.2174/0929867328666201207202012 2. Zhang M circRNA-miRNA-mRNA in breast cancer Clin Chim Acta 2021 523 120 30 10.1016/j.cca.2021.09.013 34537217 Zhang M, et al. circRNA-miRNA-mRNA in breast cancer. Clin Chim Acta. 2021;523:120–30. 34537217 10.1016/j.cca.2021.09.013 3. Watkins EJ Overview of breast cancer Jaapa 2019 32 10 13 7 10.1097/01.JAA.0000580524.95733.3d 31513033 Watkins EJ. Overview of breast cancer. Jaapa. 2019;32(10):13–7. 31513033 10.1097/01.JAA.0000580524.95733.3d 4. Siegel RL Giaquinto AN Jemal A Cancer statistics, 2024 CA Cancer J Clin 2024 74 1 12 49 38230766 10.3322/caac.21820 Siegel RL, Giaquinto AN, Jemal A. Cancer statistics, 2024. CA Cancer J Clin. 2024;74(1):12–49. 38230766 10.3322/caac.21820 5. Grabinski VF Brawley OW Disparities in breast cancer Obstet Gynecol Clin North Am 2022 49 1 149 65 10.1016/j.ogc.2021.11.010 35168767 Grabinski VF, Brawley OW. Disparities in breast cancer. Obstet Gynecol Clin North Am. 2022;49(1):149–65. 35168767 10.1016/j.ogc.2021.11.010 6. Montemagno C Pages G Metastatic heterogeneity of breast cancer: companion and theranostic approach in nuclear medicine Cancers (Basel) 2020 10.3390/cancers12040821 32235331 PMC7226533 Montemagno C, Pages G. Metastatic heterogeneity of breast cancer: companion and theranostic approach in nuclear medicine. Cancers (Basel). 2020. 10.3390/cancers12040821. 32235331 10.3390/cancers12040821 PMC7226533 7. Ibragimova MK Organ-specificity of breast cancer metastasis Int J Mol Sci 2023 10.3390/ijms242115625 37958607 PMC10650169 Ibragimova MK, et al. Organ-specificity of breast cancer metastasis. Int J Mol Sci. 2023. 10.3390/ijms242115625. 37958607 10.3390/ijms242115625 PMC10650169 8. Pentheroudakis G Metastatic breast cancer with liver metastases: a registry analysis of clinicopathologic, management and outcome characteristics of 500 women Breast Cancer Res Treat 2006 97 3 237 44 10.1007/s10549-005-9117-4 16322882 Pentheroudakis G, et al. Metastatic breast cancer with liver metastases: a registry analysis of clinicopathologic, management and outcome characteristics of 500 women. Breast Cancer Res Treat. 2006;97(3):237–44. 16322882 10.1007/s10549-005-9117-4 9. Tulotta C Ottewell P The role of IL-1B in breast cancer bone metastasis Endocr Relat Cancer 2018 25 7 R421 34 10.1530/ERC-17-0309 29760166 PMC5987176 Tulotta C, Ottewell P. The role of IL-1B in breast cancer bone metastasis. Endocr Relat Cancer. 2018;25(7):R421-34. 29760166 10.1530/ERC-17-0309 PMC5987176 10. Xiong Z Bone metastasis pattern in initial metastatic breast cancer: a population-based study Cancer Manag Res 2018 10 287 95 10.2147/CMAR.S155524 29467583 PMC5811177 Xiong Z, et al. Bone metastasis pattern in initial metastatic breast cancer: a population-based study. Cancer Manag Res. 2018;10:287–95. 29467583 10.2147/CMAR.S155524 PMC5811177 11. Smid M Subtypes of breast cancer show preferential site of relapse Cancer Res 2008 68 9 3108 14 10.1158/0008-5472.CAN-07-5644 18451135 Smid M, et al. Subtypes of breast cancer show preferential site of relapse. Cancer Res. 2008;68(9):3108–14. 18451135 10.1158/0008-5472.CAN-07-5644 12. Zou Y The Single-Cell landscape of intratumoral heterogeneity and the immunosuppressive microenvironment in liver and brain metastases of breast cancer Adv Sci (Weinh) 2023 10 5 e2203699 10.1002/advs.202203699 36529697 PMC9929130 Zou Y, et al. The Single-Cell landscape of intratumoral heterogeneity and the immunosuppressive microenvironment in liver and brain metastases of breast cancer. Adv Sci (Weinh). 2023;10(5):e2203699. 36529697 10.1002/advs.202203699 PMC9929130 13. Liu C Breast cancer liver metastasis: pathogenesis and clinical implications Front Oncol 2022 12 1043771 10.3389/fonc.2022.1043771 36387238 PMC9641291 Liu C, et al. Breast cancer liver metastasis: pathogenesis and clinical implications. Front Oncol. 2022;12:1043771. 36387238 10.3389/fonc.2022.1043771 PMC9641291 14. Zhou Y Identification and validation of a tyrosine metabolism-related prognostic prediction model and characterization of the tumor microenvironment infiltration in hepatocellular carcinoma Front Immunol 2022 13 994259 10.3389/fimmu.2022.994259 36341373 PMC9633179 Zhou Y, et al. Identification and validation of a tyrosine metabolism-related prognostic prediction model and characterization of the tumor microenvironment infiltration in hepatocellular carcinoma. Front Immunol. 2022;13:994259. 36341373 10.3389/fimmu.2022.994259 PMC9633179 15. Wang J Decreased SLC27A5 suppresses lipid synthesis and tyrosine metabolism to activate the cell cycle in hepatocellular carcinoma Biomedicines 2022 10 2 234 10.3390/biomedicines10020234 35203444 PMC8869743 Wang J, et al. Decreased SLC27A5 suppresses lipid synthesis and tyrosine metabolism to activate the cell cycle in hepatocellular carcinoma. Biomedicines. 2022;10(2):234. 35203444 10.3390/biomedicines10020234 PMC8869743 16. Bian X Lipid metabolism and cancer J Exp Med 2021 10.1084/jem.20201606 33601415 PMC7754673 Bian X, et al. Lipid metabolism and cancer. J Exp Med. 2021. 10.1084/jem.20201606. 33601415 10.1084/jem.20201606 PMC7754673 17. Huang B Song BL Xu C Cholesterol metabolism in cancer: mechanisms and therapeutic opportunities Nat Metab 2020 2 2 132 41 10.1038/s42255-020-0174-0 32694690 Huang B, Song BL, Xu C. Cholesterol metabolism in cancer: mechanisms and therapeutic opportunities. Nat Metab. 2020;2(2):132–41. 32694690 10.1038/s42255-020-0174-0 18. Krause N, Wegner A. Fructose metabolism cancer cells. 2020;9(12). 10.3390/cells9122635 PMC7762580 33302403 19. Sun L Activation of tyrosine metabolism in CD13 + cancer stem cells drives relapse in hepatocellular carcinoma Cancer Res Treat 2020 52 2 604 21 10.4143/crt.2019.444 32019286 PMC7176959 Sun L, et al. Activation of tyrosine metabolism in CD13 + cancer stem cells drives relapse in hepatocellular carcinoma. Cancer Res Treat. 2020;52(2):604–21. 32019286 10.4143/crt.2019.444 PMC7176959 20. Nazemi M The extracellular matrix supports breast cancer cell growth under amino acid starvation by promoting tyrosine catabolism PLoS Biol 2024 22 1 e3002406 10.1371/journal.pbio.3002406 38227562 PMC10791009 Nazemi M, et al. The extracellular matrix supports breast cancer cell growth under amino acid starvation by promoting tyrosine catabolism. PLoS Biol. 2024;22(1):e3002406. 38227562 10.1371/journal.pbio.3002406 PMC10791009 21. Newman AM Robust enumeration of cell subsets from tissue expression profiles Nat Methods 2015 12 5 453 7 10.1038/nmeth.3337 25822800 PMC4739640 Newman AM, et al. Robust enumeration of cell subsets from tissue expression profiles. Nat Methods. 2015;12(5):453–7. 25822800 10.1038/nmeth.3337 PMC4739640 22. Adasme MF PLIP 2021: expanding the scope of the protein-ligand interaction profiler to DNA and RNA Nucleic Acids Res 2021 49 W1 W530 W534 10.1093/nar/gkab294 33950214 PMC8262720 Adasme MF, et al. PLIP 2021: expanding the scope of the protein-ligand interaction profiler to DNA and RNA. Nucleic Acids Res. 2021;49(W1):W530–4. 33950214 10.1093/nar/gkab294 PMC8262720 23. Morabito S HdWGCNA identifies co-expression networks in high-dimensional transcriptomics data Cell Rep Methods 2023 3 6 100498 10.1016/j.crmeth.2023.100498 37426759 PMC10326379 Morabito S, et al. HdWGCNA identifies co-expression networks in high-dimensional transcriptomics data. Cell Rep Methods. 2023;3(6):100498. 37426759 10.1016/j.crmeth.2023.100498 PMC10326379 24. Wolf A Hexokinase 2 is a key mediator of aerobic glycolysis and promotes tumor growth in human glioblastoma multiforme J Exp Med 2011 208 2 313 26 10.1084/jem.20101470 21242296 PMC3039857 Wolf A, et al. Hexokinase 2 is a key mediator of aerobic glycolysis and promotes tumor growth in human glioblastoma multiforme. J Exp Med. 2011;208(2):313–26. 21242296 10.1084/jem.20101470 PMC3039857 25. Fantin VR St-Pierre J Leder P Attenuation of LDH-A expression uncovers a link between glycolysis, mitochondrial physiology, and tumor maintenance Cancer Cell 2006 9 6 425 34 10.1016/j.ccr.2006.04.023 16766262 Fantin VR, St-Pierre J, Leder P. Attenuation of LDH-A expression uncovers a link between glycolysis, mitochondrial physiology, and tumor maintenance. Cancer Cell. 2006;9(6):425–34. 16766262 10.1016/j.ccr.2006.04.023 26. Li J MAOA-mediated reprogramming of stromal fibroblasts promotes prostate tumorigenesis and cancer stemness Oncogene 2020 39 16 3305 21 10.1038/s41388-020-1217-4 32066880 Li J, et al. MAOA-mediated reprogramming of stromal fibroblasts promotes prostate tumorigenesis and cancer stemness. Oncogene. 2020;39(16):3305–21. 32066880 10.1038/s41388-020-1217-4 27. Bi S Mitochondria-related gene MAOB is a key biomarker of osteoarthritis and inhibition of its expression reduces LPS-induced chondrocyte damage Biochem Genet 2024 62 3 2314 31 10.1007/s10528-023-10486-7 37651071 Bi S, et al. Mitochondria-related gene MAOB is a key biomarker of osteoarthritis and inhibition of its expression reduces LPS-induced chondrocyte damage. Biochem Genet. 2024;62(3):2314–31. 37651071 10.1007/s10528-023-10486-7 28. Castro Goncalves AB MAOA uVNTR genetic variant and major depressive disorder: a systematic review Cells 2022 10.3390/cells11203267 36291132 PMC9600429 Castro Goncalves AB, et al. MAOA uVNTR genetic variant and major depressive disorder: a systematic review. Cells. 2022. 10.3390/cells11203267. 36291132 10.3390/cells11203267 PMC9600429 29. Pitsillou E The cellular and molecular basis of major depressive disorder: towards a unified model for understanding clinical depression Mol Biol Rep 2020 47 1 753 70 10.1007/s11033-019-05129-3 31612411 Pitsillou E, et al. The cellular and molecular basis of major depressive disorder: towards a unified model for understanding clinical depression. Mol Biol Rep. 2020;47(1):753–70. 31612411 10.1007/s11033-019-05129-3 30. Naoi M Riederer P Maruyama W Modulation of monoamine oxidase (MAO) expression in neuropsychiatric disorders: genetic and environmental factors involved in type A MAO expression J Neural Transm 2016 123 2 91 106 10.1007/s00702-014-1362-4 25604428 Naoi M, Riederer P, Maruyama W. Modulation of monoamine oxidase (MAO) expression in neuropsychiatric disorders: genetic and environmental factors involved in type A MAO expression. J Neural Transm. 2016;123(2):91–106. 25604428 10.1007/s00702-014-1362-4 31. Ziegler C Domschke K Epigenetic signature of MAOA and MAOB genes in mental disorders J Neural Transm 2018 125 11 1581 8 10.1007/s00702-018-1929-6 30242487 Ziegler C, Domschke K. Epigenetic signature of MAOA and MAOB genes in mental disorders. J Neural Transm. 2018;125(11):1581–8. 30242487 10.1007/s00702-018-1929-6 32. Shih JC Wu JB Chen K Transcriptional regulation and multiple functions of MAO genes J Neural Transm 2011 118 7 979 86 10.1007/s00702-010-0562-9 21359973 PMC3125068 Shih JC, Wu JB, Chen K. Transcriptional regulation and multiple functions of MAO genes. J Neural Transm. 2011;118(7):979–86. 21359973 10.1007/s00702-010-0562-9 PMC3125068 33. Nam MH Revisiting the role of astrocytic MAOB in Parkinson’s disease Int J Mol Sci 2022 10.3390/ijms23084453 35457272 PMC9028367 Nam MH, et al. Revisiting the role of astrocytic MAOB in Parkinson’s disease. Int J Mol Sci. 2022. 10.3390/ijms23084453. 35457272 10.3390/ijms23084453 PMC9028367 34. Park JH Newly developed reversible MAO-B inhibitor circumvents the shortcomings of irreversible inhibitors in Alzheimer’s disease Sci Adv 2019 5 3 eaav0316 10.1126/sciadv.aav0316 30906861 PMC6426469 Park JH, et al. Newly developed reversible MAO-B inhibitor circumvents the shortcomings of irreversible inhibitors in Alzheimer’s disease. Sci Adv. 2019;5(3):eaav0316. 30906861 10.1126/sciadv.aav0316 PMC6426469 35. Ma R MAOA genotype modulates default mode network deactivation during inhibitory control Biol Psychol 2018 138 27 34 10.1016/j.biopsycho.2018.08.006 30092258 Ma R, et al. MAOA genotype modulates default mode network deactivation during inhibitory control. Biol Psychol. 2018;138:27–34. 30092258 10.1016/j.biopsycho.2018.08.006 36. Moriguchi S Monoamine oxidase B total distribution volume in the prefrontal cortex of major depressive disorder: an [11 C]SL25.1188 positron emission tomography study JAMA Psychiat 2019 76 6 634 41 10.1001/jamapsychiatry.2019.0044 PMC6551845 30840042 Moriguchi S, et al. Monoamine oxidase B total distribution volume in the prefrontal cortex of major depressive disorder: an [11 C]SL25.1188 positron emission tomography study. JAMA Psychiat. 2019;76(6):634–41. 10.1001/jamapsychiatry.2019.0044 PMC6551845 30840042 37. Yang H Methylation of the MAOA promoter is associated with schizophrenia Ann Transl Med 2020 8 14 864 10.21037/atm-20-4481 32793708 PMC7396778 Yang H, et al. Methylation of the MAOA promoter is associated with schizophrenia. Ann Transl Med. 2020;8(14):864. 32793708 10.21037/atm-20-4481 PMC7396778 38. Han H Monoamine oxidase A (MAOA): a promising target for prostate cancer therapy Cancer Lett 2023 563 216188 10.1016/j.canlet.2023.216188 37076041 Han H, et al. Monoamine oxidase A (MAOA): a promising target for prostate cancer therapy. Cancer Lett. 2023;563:216188. 37076041 10.1016/j.canlet.2023.216188 39. Pu T Stromal-derived MAOB promotes prostate cancer growth and progression Sci Adv 2024 10 6 eadi4935 10.1126/sciadv.adi4935 38335292 PMC10857382 Pu T, et al. Stromal-derived MAOB promotes prostate cancer growth and progression. Sci Adv. 2024;10(6):eadi4935. 38335292 10.1126/sciadv.adi4935 PMC10857382 40. Wang Y Norepinephrine enhances aerobic Glycolysis and May act as a predictive factor for immunotherapy in gastric cancer J Immunol Res 2021 2021 p5580672 10.1155/2021/5580672 PMC8019630 33855088 Wang Y, et al. Norepinephrine enhances aerobic Glycolysis and May act as a predictive factor for immunotherapy in gastric cancer. J Immunol Res. 2021;2021:p5580672. 10.1155/2021/5580672 PMC8019630 33855088 41. Wang YY MAOA NDRG1 PI3K/AKT/mTOR Cell Oncol (Dordr) 2023 46 5 1429 44 10.1007/s13402-023-00821-w 37249744 Wang YY, et al. MAOA NDRG1 PI3K/AKT/mTOR 37249744 10.1007/s13402-023-00821-w 42. Peranzoni E Macrophages impede CD8 T cells from reaching tumor cells and limit the efficacy of anti-PD-1 treatment Proc Natl Acad Sci U S A 2018 115 17 E4041 50 10.1073/pnas.1720948115 29632196 PMC5924916 Peranzoni E, et al. Macrophages impede CD8 T cells from reaching tumor cells and limit the efficacy of anti-PD-1 treatment. Proc Natl Acad Sci U S A. 2018;115(17):E4041-50. 29632196 10.1073/pnas.1720948115 PMC5924916 43. Wang YC Targeting monoamine oxidase A-regulated tumor-associated macrophage polarization for cancer immunotherapy Nat Commun 2021 12 1 3530 10.1038/s41467-021-23164-2 34112755 PMC8192781 Wang YC, et al. Targeting monoamine oxidase A-regulated tumor-associated macrophage polarization for cancer immunotherapy. Nat Commun. 2021;12(1):3530. 34112755 10.1038/s41467-021-23164-2 PMC8192781 44. Yeo SK Guan JL Breast cancer: multiple subtypes within a tumor?? Trends Cancer 2017 3 11 753 60 10.1016/j.trecan.2017.09.001 29120751 PMC5802368 Yeo SK, Guan JL. Breast cancer: multiple subtypes within a tumor?? Trends Cancer. 2017;3(11):753–60. 29120751 10.1016/j.trecan.2017.09.001 PMC5802368 45. Dai X Breast cancer intrinsic subtype classification, clinical use and future trends Am J Cancer Res 2015 5 10 2929 43 26693050 PMC4656721 Dai X, et al. Breast cancer intrinsic subtype classification, clinical use and future trends. Am J Cancer Res. 2015;5(10):2929–43. 26693050 PMC4656721 46. Turner KM Heterogeneity within molecular subtypes of breast cancer Am J Physiol Cell Physiol 2021 321 2 C343 54 10.1152/ajpcell.00109.2021 34191627 PMC8424677 Turner KM, et al. Heterogeneity within molecular subtypes of breast cancer. Am J Physiol Cell Physiol. 2021;321(2):C343–54. 34191627 10.1152/ajpcell.00109.2021 PMC8424677 47. Monteran L Chemotherapy-induced complement signaling modulates immunosuppression and metastatic relapse in breast cancer Nat Commun 2022 13 1 5797 10.1038/s41467-022-33598-x 36184683 PMC9527249 Monteran L, et al. Chemotherapy-induced complement signaling modulates immunosuppression and metastatic relapse in breast cancer. Nat Commun. 2022;13(1):5797. 36184683 10.1038/s41467-022-33598-x PMC9527249 48. Early Breast Cancer Trialists’ Collaborative Group Electronic address, b.o.c.o.a.u. And G. Early breast cancer trialists’ collaborative, Anthracycline-containing And taxane-containing chemotherapy for early-stage operable breast cancer: a patient-level meta-analysis of 100 000 women from 86 randomised trials Lancet 2023 401 10384 1277 92 10.1016/S0140-6736(23)00285-4 37061269 PMC11023015 Early Breast Cancer Trialists’ Collaborative Group. Electronic address, b.o.c.o.a.u. And G. Early breast cancer trialists’ collaborative, Anthracycline-containing And taxane-containing chemotherapy for early-stage operable breast cancer: a patient-level meta-analysis of 100 000 women from 86 randomised trials. Lancet. 2023;401(10384):1277–92. 37061269 10.1016/S0140-6736(23)00285-4 PMC11023015 49. Mittendorf EA Neoadjuvant Atezolizumab in combination with sequential nab-paclitaxel and anthracycline-based chemotherapy versus placebo and chemotherapy in patients with early-stage triple-negative breast cancer (IMpassion031): a randomised, double-blind, phase 3 trial Lancet 2020 396 10257 1090 100 10.1016/S0140-6736(20)31953-X 32966830 Mittendorf EA, et al. Neoadjuvant Atezolizumab in combination with sequential nab-paclitaxel and anthracycline-based chemotherapy versus placebo and chemotherapy in patients with early-stage triple-negative breast cancer (IMpassion031): a randomised, double-blind, phase 3 trial. Lancet. 2020;396(10257):1090–100. 32966830 10.1016/S0140-6736(20)31953-X 50. Bhatia S Identifying therapies to combat epithelial mesenchymal plasticity-associated chemoresistance to conventional breast cancer therapies using an ShRNA library screen Cancers (Basel) 2020 10.3390/cancers12051123 32365878 PMC7281530 Bhatia S, et al. Identifying therapies to combat epithelial mesenchymal plasticity-associated chemoresistance to conventional breast cancer therapies using an ShRNA library screen. Cancers (Basel). 2020. 10.3390/cancers12051123. 32365878 10.3390/cancers12051123 PMC7281530 51. Aebi S Karlsson P Wapnir IL Locally advanced breast cancer Breast 2022 62 Suppl 1 S58 62 10.1016/j.breast.2021.12.011 34930650 PMC9097810 Aebi S, Karlsson P, Wapnir IL. Locally advanced breast cancer. Breast. 2022;62(Suppl 1):S58–62. 34930650 10.1016/j.breast.2021.12.011 PMC9097810 52. Vuger AT Anthracyclines in the treatment of early breast cancer friend or foe? Breast 2022 65 67 76 10.1016/j.breast.2022.06.007 35839583 PMC9289865 Vuger AT, et al. Anthracyclines in the treatment of early breast cancer friend or foe? Breast. 2022;65:67–76. 35839583 10.1016/j.breast.2022.06.007 PMC9289865 53. Meyer LS Riley EP Social play in juvenile rats prenatally exposed to alcohol Teratology 1986 34 1 1 7 10.1002/tera.1420340102 3764769 Meyer LS, Riley EP. Social play in juvenile rats prenatally exposed to alcohol. Teratology. 1986;34(1):1–7. 3764769 10.1002/tera.1420340102 54. Szczepaniak P Breast cancer chemotherapy induces vascular dysfunction and hypertension through a NOX4-dependent mechanism J Clin Invest 2022 10.1172/JCI149117 35617030 PMC9246378 Szczepaniak P, et al. Breast cancer chemotherapy induces vascular dysfunction and hypertension through a NOX4-dependent mechanism. J Clin Invest. 2022. 10.1172/JCI149117. 35617030 10.1172/JCI149117 PMC9246378 55. Turkovic L, et al. Development and validation of a novel LC-MS/MS method for the simultaneous determination of abemaciclib, palbociclib, ribociclib, anastrozole, letrozole, and fulvestrant in plasma samples: a prerequisite for personalized breast cancer treatment. Pharmaceuticals (Basel), 2022. 15(5). 10.3390/ph15050614 PMC9147789 35631440 56. Kim SD Efficacy and safety of ginger on the side effects of chemotherapy in breast cancer patients: systematic review and meta-analysis Int J Mol Sci 2022 10.3390/ijms231911267 36232567 PMC9569531 Kim SD, et al. Efficacy and safety of ginger on the side effects of chemotherapy in breast cancer patients: systematic review and meta-analysis. Int J Mol Sci. 2022. 10.3390/ijms231911267. 36232567 10.3390/ijms231911267 PMC9569531 57. Deb S Hopefl R Simulation of drug-drug interactions between breast cancer chemotherapeutic agents and antiemetic drugs Daru 2023 31 2 95 105 10.1007/s40199-023-00463-1 37223851 PMC10624783 Deb S, Hopefl R. Simulation of drug-drug interactions between breast cancer chemotherapeutic agents and antiemetic drugs. Daru. 2023;31(2):95–105. 37223851 10.1007/s40199-023-00463-1 PMC10624783 58. Aapro M Double-blind, randomised, controlled study of the efficacy and tolerability of palonosetron plus dexamethasone for 1 day with or without dexamethasone on days 2 and 3 in the prevention of nausea and vomiting induced by moderately emetogenic chemotherapy Ann Oncol 2010 21 5 1083 8 10.1093/annonc/mdp584 20080830 Aapro M, et al. Double-blind, randomised, controlled study of the efficacy and tolerability of palonosetron plus dexamethasone for 1 day with or without dexamethasone on days 2 and 3 in the prevention of nausea and vomiting induced by moderately emetogenic chemotherapy. Ann Oncol. 2010;21(5):1083–8. 20080830 10.1093/annonc/mdp584 59. Rugo HS Efficacy of NEPA (netupitant/palonosetron) across multiple cycles of chemotherapy in breast cancer patients: a subanalysis from two phase III trials Breast 2017 33 76 82 10.1016/j.breast.2017.02.017 28285236 Rugo HS, et al. Efficacy of NEPA (netupitant/palonosetron) across multiple cycles of chemotherapy in breast cancer patients: a subanalysis from two phase III trials. Breast. 2017;33:76–82. 28285236 10.1016/j.breast.2017.02.017 60. Piechotta V Antiemetics for adults for prevention of nausea and vomiting caused by moderately or highly emetogenic chemotherapy: a network meta-analysis Cochrane Database Syst Rev 2021 11 11 CD012775 34784425 10.1002/14651858.CD012775.pub2 PMC8594936 Piechotta V, et al. Antiemetics for adults for prevention of nausea and vomiting caused by moderately or highly emetogenic chemotherapy: a network meta-analysis. Cochrane Database Syst Rev. 2021;11(11):CD012775. 34784425 10.1002/14651858.CD012775.pub2 PMC8594936 61. Shirley M Palonosetron N A review in Chemotherapy-Induced nausea and vomiting Drugs 2021 81 11 1331 42 10.1007/s40265-021-01558-2 34292534 PMC8463343 Shirley M, Palonosetron N. A review in Chemotherapy-Induced nausea and vomiting. Drugs. 2021;81(11):1331–42. 34292534 10.1007/s40265-021-01558-2 PMC8463343 62. Zelek L Single-dose NEPA versus an aprepitant regimen for prevention of chemotherapy-induced nausea and vomiting in patients receiving moderately emetogenic chemotherapy Cancer Med 2023 12 15 15769 76 10.1002/cam4.6121 37537943 PMC10469631 Zelek L, et al. Single-dose NEPA versus an aprepitant regimen for prevention of chemotherapy-induced nausea and vomiting in patients receiving moderately emetogenic chemotherapy. Cancer Med. 2023;12(15):15769–76. 37537943 10.1002/cam4.6121 PMC10469631 63. Raghunath A Duration of dexamethasone administration for the prevention of chemotherapy-induced nausea and vomiting - a systematic review and meta-analysis Crit Rev Oncol Hematol 2020 152 103012 10.1016/j.critrevonc.2020.103012 32593142 Raghunath A, et al. Duration of dexamethasone administration for the prevention of chemotherapy-induced nausea and vomiting - a systematic review and meta-analysis. Crit Rev Oncol Hematol. 2020;152:103012. 32593142 10.1016/j.critrevonc.2020.103012 ",
  "metadata": {
    "Title of this paper": "Duration of dexamethasone administration for the prevention of chemotherapy-induced nausea and vomiting - a systematic review and meta-analysis",
    "Journal it was published in:": "Discover Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12480192/"
  }
}