{
  "title": "Paper_10",
  "abstract": "pmc Plast Reconstr Surg Glob Open Plast Reconstr Surg Glob Open 2522 prsgo GOX Plastic and Reconstructive Surgery Global Open 2169-7574 Wolters Kluwer Health PMC12490643 PMC12490643.1 12490643 12490643 10.1097/GOX.0000000000007159 GOX-D-25-00499 1 3 Global Health Original Article Disparities and Barriers to Care in Plastic and Reconstructive Surgery for Native American and First Nations Populations Bohler Forrest BS * Pham Madeline N. BS † Attisha Tamara ‡ Burmeister James R. BS § Chaiyasate Kongkrit MD, FACS ¶ From the * † ‡ § ¶ Forrest Bohler, BS, Oakland University William Beaumont School of Medicine, 586 Pioneer Drive, Rochester, MI 48309, E-mail: forrestbohler@yahoo.com 10 2025 02 10 2025 13 10 498115 e7159 15 5 2025 12 8 2025 02 10 2025 03 10 2025 03 10 2025 Copyright © 2025 The Authors. Published by Wolters Kluwer Health, Inc. on behalf of The American Society of Plastic Surgeons. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution-Non Commercial-No Derivatives License 4.0 (CCBY-NC-ND) Background: American Indian and Alaska Native and First Nations populations face well-documented health disparities, yet inequities in access to plastic and reconstructive surgery (PRS) remain underrecognized. These communities experience a higher burden of PRS-relevant conditions, including orofacial clefts, trauma, burns, and postoncological defects, but disproportionately low usage of PRS services. Methods: This narrative synthesizes existing literature on disparities in PRS access for Indigenous populations in the United States and Canada. The key focus areas included disease prevalence, barriers to care, and proposed strategies for improving access. Peer-reviewed articles and policy sources were reviewed to identify recurring themes and evidence-based solutions. Results: Indigenous patients face significant barriers to PRS care, including geographic isolation, chronic underfunding of systems such as the Indian Health Service, a shortage of specialized providers in rural regions, socioeconomic hardship, and cultural mistrust rooted in historical trauma. Solutions discussed include expanding telehealth, establishing residency-based domestic outreach programs, supporting short-term training for local providers, and strengthening partnerships between academic institutions and tribal health systems. Increasing Indigenous representation in PRS and promoting tribal self-determination in healthcare are also emphasized as critical components of sustainable change. Conclusions: Efforts to address PRS disparities in Indigenous populations must be multifaceted, combining immediate access improvements with long-term investments in workforce development, infrastructure, and culturally attuned care. A coordinated approach among academic programs, policy stakeholders, and Indigenous communities is essential to achieving surgical equity. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes OPEN-ACCESS TRUE COUNTRY UNITED STATES Takeaways Question: Findings: Meaning: INTRODUCTION Health disparities among Indigenous peoples of North America are well documented. In the United States, American Indian and Alaska Native (AI/AN) communities face disproportionate burdens of disease and barriers to care compared with the general population. 1 3 4 5 6 7 7 8 PRS encompasses care for congenital anomalies, trauma injuries, burns, and oncological reconstruction, among other areas. These services often require highly specialized multidisciplinary teams and infrastructure typically found in urban centers, away from tribal lands where the majority of AI/AN communities reside. This review outlined the current disparities and barriers in access to care in PRS for AI/AN communities while discussing potential solutions to address these inequities. DISPARITIES IN PLASTIC SURGERY Orofacial Clefts AI/AN populations have the highest incidence of cleft lip and palate of any ethnic group. 9 10 10 10 Breast Cancer and Reconstruction Overall breast cancer incidence among Native American women is slightly lower than that in White women, but there is evidence of later-stage presentation and higher mortality in AI/AN populations. 11 12 11 13 11 Trauma and Injury Unintentional injuries and violence are leading causes of morbidity and mortality in adolescent Indigenous populations. 14 15 16 16 15 17 18 19 Burn Injuries Indigenous people experience severe burns more frequently and with worse outcomes in some contexts. A review of burn center data found that AI burn patients had different injury profiles and hospital courses compared with non-Natives. 20 20 21 21 BARRIERS TO CARE Geographic Isolation and Health System Limitations Rural geography is one of the most significant barriers to specialty surgical care for Indigenous populations. Many AI/AN and First Nations communities are located in remote areas such as reservations, Northern territories, and rural regions far from urban hospitals where reconstructive surgeons practice. Similarly, on remote First Nations reserves in Canada or in Alaska Native villages, there may be no resident surgeons, and even basic procedures might require air transport to tertiary centers. The health systems serving Indigenous peoples have not fully overcome these geographic challenges. The United States’ Indian Health Service (IHS) is charged with providing healthcare to AI/AN communities as a matter of treaty obligation. 22 23 24 7 25 In Canada, Indigenous people theoretically have access to the same provincial health services as other citizens, but in practice, those living on remote reserves face similar geographic hurdles. The healthcare infrastructure in rural Indigenous communities often consists of nursing stations or primary care clinics with visiting physicians. Specialist visits are infrequent, and plastic surgeons seldom form part of these outreach teams. 26 27 28 An additional system-level factor is the governance of Indigenous health services. Notably, in the United States, more than 60% of IHS-funded facilities are now operated by tribes themselves under self-determination policies. 7 29 30 31 Socioeconomic and Insurance Barriers Socioeconomic disadvantage is a pervasive barrier that impacts access to all forms of healthcare, including reconstructive surgery in Native communities. Indigenous people in both the United States and Canada have higher rates of poverty and lower average incomes compared with the general population. 32 33 Cultural and Historical Barriers Cultural factors and historical experiences with healthcare institutions play a profound role in Indigenous patients’ engagement with plastic surgery services. Centuries of colonization, forced assimilation policies such as residential schools in Canada, and unethical medical practices in the past have understandably fostered mistrust toward healthcare systems among Indigenous people. 34 37 Implicit bias and lack of cultural competency among healthcare providers further exacerbate these issues. Studies outside of surgery have shown that implicit bias can lead to suboptimal care for AI/AN patients. 38 40 Various cultural beliefs among AI/AN communities likely also play a role in health-seeking behaviors within PRS. In a study of AI/AN women who received surgical treatment for breast cancer, the majority of those interviewed preferred reconstruction with autologous tissue rather than implant-based reconstruction. 41 41 STRATEGIES AND POTENTIAL SOLUTIONS Expanding Telehealth Initiatives Telemedicine has emerged as a powerful tool to extend specialty care to remote and underserved areas. IHS has committed to using telehealth to enhance care delivery in tribal communities, and this can be extended in part to plastic surgery. 42 43 44 45 45 Residency-based Outreach In addition to telehealth and visiting specialist clinics, academic plastic surgery programs could play a fundamental role by adopting domestic outreach models modeled after global surgery missions. 46 47 Programs at well-established academic institutions may already have existing relationships that can serve as a foundation for domestic surgical outreach to Indigenous communities. For example, the Pre-Admission Workshop (PAW) is a collaborative initiative aimed at increasing the number of qualified AI/AN applicants to medical school. PAW is jointly organized by the University of Utah’s Spencer Fox Eccles School of Medicine’s Office of Academic Culture and Community, the Association of American Indian Physicians, and the Four Corners Alliance, in partnership with the University of Arizona College of Medicine—Phoenix, the University of Arizona College of Medicine—Tucson, the University of Colorado School of Medicine, and the University of New Mexico School of Medicine. 48 Balancing Access and Quality Through Community-based Surgical Training Another strategy lies in empowering local general surgeons in areas without reconstructive surgeons to perform essential reconstructive procedures through focused training initiatives such as cleft lip repair, skin grafting, and acute burn care. This strategy represents a proven and sustainable model for expanding access in geographically isolated Indigenous communities. 49 49 Improved Tribal Sovereignty in Healthcare Empowering Indigenous communities to have greater control over their healthcare services can lead to more culturally attuned and effective care. The Indian Self-Determination and Education Assistance Act of 1975 allowed tribes in the United States to assume management of IHS facilities and programs. 50 Increasing Indigenous Representation in PRS Currently, AI/AN individuals are markedly underrepresented at every stage of the medical training pathway beyond high school. 51 51 51 52 Representation could also benefit from having Indigenous leaders in healthcare administration and policy. Supporting the career development of Indigenous surgeons into leadership roles such as department chiefs and health directors could increase the likelihood that institutional priorities align with closing disparity gaps. These leaders may then advocate for allocating resources to underserved areas and for culturally mindful practices. CONCLUSIONS Disparities in PRS affecting AI/AN populations are significant and multifaceted. Indigenous communities experience a higher burden of conditions such as cleft lip/palate, trauma, burns, and advanced cancers, yet they face substantial barriers in accessing the reconstructive care that can treat these conditions. 10 12 18 20 41 13 19 51 DISCLOSURE The authors have no financial interest to declare in relation to the content of this article. Published online 2 October 2025.  Disclosure statements are at the end of this article, following the correspondence information. REFERENCES 1. Eberly LA Shultz K Merino M Cardiovascular disease burden and outcomes among American Indian and Alaska Native Medicare beneficiaries. JAMA Netw Open 2023 6 e2334923 37738051 10.1001/jamanetworkopen.2023.34923 PMC10517375 2. Newsroom Disparities | Fact Sheets. Available at https://www.ihs.gov/newsroom/factsheets/disparities/ 3. Laffey KG Nelson AD Laffey MJ Regional differences in American Indian/Alaska native chronic respiratory disease disparity: evidence from national survey results. Int J Environ Res Public Health 2024 21 1070 39200679 10.3390/ijerph21081070 PMC11354713 4. McVicar JA Poon A Caron NR Postoperative outcomes for Indigenous Peoples in Canada: a systematic review. CMAJ 2021 193 E713 E722 34001549 10.1503/cmaj.191682 PMC8177941 5. Simianu VV Morris AM Varghese TK Evaluating disparities in inpatient surgical cancer care among American Indian/Alaska Native patients. Am J Surg 2016 212 297 304 26846176 10.1016/j.amjsurg.2015.10.030 PMC4939142 6. Abella MKIL Lee AY Kitamura RK Disparities and risk factors for surgical complication in American Indians and Native Hawaiians. J Surg Res 2023 288 99 107 36963299 10.1016/j.jss.2023.02.016 7. Livermont TEOL Kandi LAC Weaver TLC Invisibility of Native American communities in plastic and reconstructive surgery: the role of tribal sovereignty and self-governance to improve access. Plast Reconstr Surg Glob Open 2024 12 e6177 39296614 10.1097/GOX.0000000000006177 PMC11410331 8. White MJ Prathibha S Praska C Disparities in postmastectomy reconstruction use among American Indian and Alaska Native women. Plast Reconstr Surg 2024 154 21e 32e 10.1097/PRS.0000000000010935 37467081 9. Mulliken JB The changing faces of children with cleft lip and palate. N Engl J Med 2004 351 745 747 15317886 10.1056/NEJMp048157 10. Wolfswinkel EM Howell AC MacDonald B American Indian and Alaska native accessibility to comprehensive cleft lip and palate treatment. Cleft Palate Craniofac J 2023 60 1376 1384 35642251 10.1177/10556656221104942 11. White A Richardson LC Li C Breast cancer mortality among American Indian and Alaska Native women, 1990–2009. Am J Public Health 2014 104 S432 S438 24754658 10.2105/AJPH.2013.301720 PMC4035864 12. Gaba AG Cao L Renfrew RJ Differences in breast cancers among American Indian/Alaska Native and non-Hispanic Whites in the USA. J Racial Ethn Health Disparities 2024 11 2378 2389 37432561 10.1007/s40615-023-01704-4 13. Nguyen AT Duckworth E Kandi L Disparities in postmastectomy breast reconstruction among American Indian and Alaska Native women: a systematic literature review and meta-analysis. Ann Surg Oncol 2025 32 4041 4052 39937404 10.1245/s10434-025-17005-5 14. Berger LR Wallace LJD Bill NM Injuries and injury prevention among Indigenous children and young people. Pediatr Clin North Am 2009 56 1519 1537 19962034 10.1016/j.pcl.2009.09.016 15. George MA Jin A Brussoni M Intentional injury among the Indigenous and total populations in British Columbia, Canada: trends over time and ecological analyses of risk. Int J Equity Health 2017 16 141 28789649 10.1186/s12939-017-0629-4 PMC5549349 16. Arizona Department of Health Services American Indian Trauma Report 2020. Available at https://www.azdhs.gov/documents/director/tribal-liaison/american-indian-trauma-report-2020.pdf 17. Stephenson J High suicide rates among American Indian or Alaska native persons surging even higher. JAMA Health Forum 2022 3 e224179 36218954 10.1001/jamahealthforum.2022.4179 18. JAMA Network Possible geographical barriers to trauma center access for vulnerable patients in the United States: an analysis of urban and rural communities. JAMA Surg 2011 146 46 52 Available at https://jamanetwork.com/journals/jamasurgery/fullarticle/406563 10.1001/archsurg.2010.299 PMC3121679 21242445 19. Stamey HM Meyers KR Fordham JT Access to trauma care in a rural state: a descriptive geographic and demographic analysis. J Emerg Med 2024 66 e20 e26 37867034 10.1016/j.jemermed.2023.08.011 20. Swann JA Matthews MR Bay C Burn injury outcome differences in Native Americans. Burns 2019 45 494 501 30337157 10.1016/j.burns.2018.09.018 21. Smith MB Brownson E Newman AK Experiences of Alaska Native people living with burn injury and opportunities for health system strengthening. BMC Health Serv Res 2023 23 1260 37968627 10.1186/s12913-023-10243-x PMC10652576 22. Rainie S Jorgensen M Cornell S The changing landscape of health care provision to American Indian nation. Am Indian Cult Res J 2015 39 1 24 23. IHS Understanding the Purchased/Referred Care program: part 1. September 2011 blogs. Newsroom. Available at https://www.ihs.gov/newsroom/directorsblog/september2011/understanding-the-purchased-referred-care-program-part-1/ 24. IHS Purchased/Referred Care (PRC). Fact Sheets. Newsroom. Available at https://www.ihs.gov/newsroom/factsheets/purchasedreferredcare/ 25. U.S. GAO Indian Health Service: spending levels and characteristics of IHS and three other federal health care programs. Available at https://www.gao.gov/products/gao-19-74r 26. Oosterveer TM Kue Young T Primary health care accessibility challenges in remote indigenous communities in Canada’s North. Int J Circumpolar Health 2015 74 29576 26507717 10.3402/ijch.v74.29576 PMC4623283 27. Nguyen NH Subhan FB Williams K Barriers and mitigating strategies to healthcare access in indigenous communities of Canada: a narrative review. Healthcare (Basel 2020 8 112 32357396 10.3390/healthcare8020112 PMC7349010 28. Government of Canada Non-insured health benefits for First Nations and Inuit. Available at https://www.sac-isc.gc.ca/eng/1572537161086/1572537234517 29. Indian Health Service Indian Health Service health equity report. April, 2024. https://www.ihs.gov/sites/newsroom/themes/responsive2017/display_objects/documents/factsheets/IHS_Health_Equity_Report_FactSheet_2024.pdf 30. Warne D Frizzell LB American Indian health policy: historical trends and contemporary issues. Am J Public Health. 2014 104 S263 S267 24754649 10.2105/AJPH.2013.301682 PMC4035886 31. Elmorsi R Raborn L Smith BT Racial and ethnic diversity in American plastic surgery residency. J Surg Educ 2025 82 103317 39689583 10.1016/j.jsurg.2024.103317 32. Office of Minority Health American Indian/Alaska Native Health. Available at https://minorityhealth.hhs.gov/american-indianalaska-native-health 33. Canadian Poverty Institute Poverty in Canada. Available at https://www.povertyinstitute.ca/poverty-canada 34. Guadagnolo BA Cina K Helbig P Medical mistrust and less satisfaction with health care among Native Americans presenting for cancer treatment. J Health Care Poor Underserved 2009 20 210 226 19202258 10.1353/hpu.0.0108 PMC2665798 35. Jaramillo ET Sommerfeld DH Haozous EA Causes and consequences of not having a personal healthcare provider among American Indian elders: a mixed-method study. Front Public Health 2022 10 832626 35309185 10.3389/fpubh.2022.832626 PMC8926165 36. Whitney E Native Americans feel invisible in U.S. health care system. NPR Available at https://www.npr.org/sections/health-shots/2017/12/12/569910574/native-americans-feel-invisible-in-u-s-health-care-system 37. Vogel L Broken trust drives native health disparities. CMAJ 2015 187 E9 E10 25452318 10.1503/cmaj.109-4950 PMC4284180 38. Zestcott CA Spece L McDermott D Health care providers’ negative implicit attitudes and stereotypes of American Indians. J Racial Ethn Health Disparities 2021 8 230 236 32445056 10.1007/s40615-020-00776-w 39. Puumala SE Burgess KM Kharbanda AB The role of bias by emergency department providers in care for American Indian Children. Med Care 2016 54 562 569 26974675 10.1097/MLR.0000000000000533 PMC4865441 40. Walls ML Gonzalez J Gladney T Unconscious biases: racial microaggressions in American Indian health care. J Am Board Family Med 2015 28 231 239 10.3122/jabfm.2015.02.140194 PMC4386281 25748764 41. Scott K Marquez J Tausinga T Attitudes toward breast reconstruction among American Indian/Alaska Native women in the mountain west region: a qualitative study. Plast Reconstr Surg Glob Open 2024 12 8 9 42. Indian Health Service (IHS) Telehealth. Available at https://www.ihs.gov/telehealth/ 43. Gruen RL Weeramanthri TS Knight SSE Specialist outreach clinics in primary care and rural hospital settings. Cochrane Database Syst Rev 2004 2003 CD003798 14974038 10.1002/14651858.CD003798.pub2 PMC9016793 44. www.army.mil At first medical outreach clinic of Exercise Balikatan 2012, civil affairs coordinate, docs deliver. Available at https://www.army.mil/article/78115/at_first_medical_outreach_clinic_of_exercise_balikatan_2012_civil_affairs_coordinate_docs_deliver 2012 45. Torres Perez-Iglesias CA Corlew DS Expanding the capacity of the Indian Health Service through partnerships with plastic and reconstructive graduate programs. Ann Plast Surg 2023 90 273 274 36752522 10.1097/SAP.0000000000003394 46. Yan A Castellanos SL Chao AH Plastic surgical outreach to low- and middle-income countries and global health priorities: an analysis of 96 nongovernmental organizations. Plast Reconstr Surg Glob Open 2023 11 e5477 38148941 10.1097/GOX.0000000000005477 PMC10749701 47. Chung KY Plastic and reconstructive surgery in global health: let’s reconstruct global surgery. Plast Reconstr Surg Glob Open 2017 5 e1273 28507847 10.1097/GOX.0000000000001273 PMC5426866 48. School of Medicine | University of Utah Health Tribal, rural, and underserved programs. Available at https://medicine.utah.edu/oacc/students-med/tribal-rural-and-underserved-programs 49. Association Of Rural Surgeons Of India About. Available at https://arsiindia.org/about-us/ 50. Indian Affairs Self-Determination. Available at https://www.bia.gov/regional-offices/great-plains/self-determination 51. Persad-Paisley EM Uriarte SA Kuruvilla AS Examining racial and gender diversity in the plastic surgery pipeline: where is the leak? Plast Reconstr Surg Glob Open 2024 12 e5552 38274104 10.1097/GOX.0000000000005552 PMC10810573 52. Association of American Indian Physicians Our team. Available at https://www.aaip.org/our-team ",
  "metadata": {
    "Title of this paper": "Our team.",
    "Journal it was published in:": "Plastic and Reconstructive Surgery Global Open",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490643/"
  }
}