{
  "title": "Paper_827",
  "abstract": "pmc Genome Biol Genome Biol 7 genbio Genome Biology 1474-7596 1474-760X BMC PMC12476631 PMC12476631.1 12476631 12476631 41015771 10.1186/s13059-025-03790-5 3790 1 Methodology Hybrid BAG-seq: DNA and RNA from the same single nucleus reveals interactions between genomic and transcriptomic landscapes in human tumor samples Li Siran siranli@cshl.edu 1 Alexander Joan 1 Kendall Jude 1 Andrews Peter 1 Rose Elizabeth 1 Orjuela Hope 1 Park Sarah 1 Podszus Craig 1 Shanley Liam 1 Ranade Nissim 1 Morris Patrick 1 Stauder Danielle 1 Bradford Daniel 1 Laster Zachary 1 Ronemus Michael 1 Rishi Arvind 2 Frimer Marina 3 Ma Rong 4 5 6 Donoho David L. 7 Goldberg Gary L. 1 3 Wigler Michael 1 Levy Dan levy@cshl.edu 1 1 https://ror.org/02qz8b764 grid.225279.9 0000 0001 1088 1567 Cold Spring Harbor Laboratory, 2 https://ror.org/01ff5td15 grid.512756.2 0000 0004 0370 4759 Department of Pathology and Laboratory Medicine, Zucker School of Medicine at Hofstra/Northwell, 3 https://ror.org/02bxt4m23 grid.416477.7 0000 0001 2168 3646 Department of Obstetrics and Gynecology, Division of Gynecologic Oncology, Zucker School of Medicine at Hofstra/Northwell, 4 https://ror.org/05n894m26 Department of Biostatistics, Harvard T.H. Chan School of Public Health, 5 https://ror.org/05a0ya142 grid.66859.34 0000 0004 0546 1623 Eric and Wendy Schmidt Center, Broad Institute of MIT and Harvard, 6 https://ror.org/02jzgtq86 grid.65499.37 0000 0001 2106 9910 Department of Data Science, Dana-Farber Cancer Institute, 7 https://ror.org/00f54p054 grid.168010.e 0000 0004 1936 8956 Department of Statistics, Stanford University, 27 9 2025 2025 26 478174 314 14 9 2024 14 9 2025 27 09 2025 29 09 2025 29 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ We introduce hybrid BAG-seq: a high-throughput, multi-omic method that simultaneously captures DNA and RNA from single nuclei. We apply this protocol to 65,499 single nuclei from samples of five uterine cancer patients and validate the clustering using RNA-only and DNA-only protocols from the same tissues. Multiple tumor genome or expression clusters are often present within a patient, with different tumor clones projecting into distinct or shared expression states, demonstrating nearly all possible genome-transcriptome correlations. We also identify mutant stroma with significant X chromosome loss in various cell types and patient-specific stromal subtypes exhibiting aberrant expression patterns. Supplementary Information The online version contains supplementary material available at 10.1186/s13059-025-03790-5. http://dx.doi.org/10.13039/100000893 Simons Foundation 519054 https://doi.org/10.13039/100001006 Breast Cancer Research Foundation pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Background Single-cell analysis offers an opportunity for insight into cancers and their interactions with the host. From single-cell RNA data, we can obtain valuable information about the cell type and state. This is key in characterizing the various types of normal stroma as well as the diverse expression states within the tumor. From single-cell DNA data, we can determine important lineage information. This enables us to distinguish tumor cells from normal cells and partition tumor cells into subclones. The fusion of these two types of analysis, high-throughput data of RNA and DNA from the same single cells, presents a significant advancement. By assigning both a distinct DNA and RNA identity to each single cell, we may begin to observe the complex interplay between cancer cells and stroma, the emergence of malignant cells from pre-malignant ones, the driving forces behind specific expression states, and possible patterns of mutation in certain types of host stroma. Methods for the high-throughput capture of either single-cell DNA [ 1 3 4 11 12 24 25 29 30 31 34 In this study, we introduce, characterize, and implement a hybrid high-throughput droplet-based technology that enables the capture of both DNA and RNA templates from the same cell nucleus. This multi-omic technology is an evolution of our BAG platform [ 35 35 We utilized this hybrid BAG approach on frozen tissues obtained from five patients diagnosed with uterine cancer. We found sufficient transcriptional complexity in the nuclear RNA to clearly distinguish cell types. The DNA layer provided sufficient genome copy number information to differentiate stroma from tumor, to identify distinct subclones within the tumor, and to detect mutant stroma. We further confirmed these clustering patterns through comparison with results obtained from validated RNA-only and DNA-only BAG protocols. Clustering in single-cell analysis presents a unique challenge. Popular methods like tSNE [ 36 37 38 39 The tumor and host expression clusters from each patient exhibited distinct characteristics. We use the gene count vectors for the clusters to determine differential gene expression sets that inform labels of cell type and state. Combining expression data from all five patients’ samples, we observed that the profiles of the stromal cell types are broadly consistent across all patients, but with some notable differences. Using high-quality, high-throughput single-cell RNA and DNA data, we explore the complex genomic and expression landscape of five uterine tumors. We observe that cells resembling stromal cell types in their expression profiles are mainly diploid. However, we also identify intriguing instances of subclones within normal cells. In one tumor, we find diploid cells with X chromosome loss accounting for about half the plasma cell component. Upon closer examination of the expression data, we confirmed this DNA-RNA subcluster as the clonal expansion of a single B-cell lineage. Making such observations about stromal clonality requires a multi-omic approach. Hybrid DNA-RNA data reveal an extensive range of associations between DNA tumor subclones and distinct expression states. Even at this simplest level, these interrelationships span from one-to-one correspondences to more complex many-to-many interactions, and some patterns are strongly suggestive of epigenetic variation. These observations could not be made without a multi-omic approach. Consequently, even deeper analysis was undertaken. We find cases where DNA subclones reveal additional subpopulations within an RNA expression cluster: we separate the RNA expression cluster based on DNA subclones and derive differential gene sets for the subpopulations. These subtle details would also not be observable using RNA-only data. Overall, our data highlight the potential of multi-omic technologies to better understand cancer evolution, stromal mutations, and the tumor microenvironment. This broad view, coming from single cells alone, can be further honed by using differential gene sets to explore the spatial relationships using multi-probe high-resolution microscopy [ 40 41 Results Experimental design Samples We obtained fresh tissue samples of primary tumors from five patients with uterine cancer (Additional file 1: Table S1), and in three cases, distal “normal” endometrium (see Additional file 2: Table S2 for a detailed description). The tumor types surveyed include two carcinosarcomas, a serous carcinoma, an endometrioid adenocarcinoma, and a leiomyosarcoma. Each sample was frozen and pulverized into a powder. From this powder, nuclei were extracted for single-cell DNA, single-cell RNA, and single-cell DNA-RNA (“hybrid”) BAG platform. We also used the same source material to perform whole-genome sequencing (WGS). This comprehensive approach ensured that all types of cells were proportionately represented in each method of analysis. To refine our methodology and study doublet collisions, we mixed powders from different patients prior to single-nucleus sorting, as discussed later. Additional file 2: Table S2 provides a comprehensive overview of the datasets utilized in our study, detailing the combination of sample origin (including unique setups like the mixed powder experiment), the associated protocols, and the respective experimental parameters. The hybrid BAG platform Our study uses the BAG platform, a versatile method that captures templates from a single-cell entity, either whole cells or nuclei. The BAG platform was built for flexibility, allowing for the reagent customization needed to capture DNA and RNA from the same single cells in a high-throughput manner. As described in Fig. 1 35 BAG tag 3 Fig. 1 Overview of hybrid BAG-seq protocol and performance on cell-mixture experiment. A D A Encapsulation B Polymerization and primer extension C Split-and-pool barcoding D Sequencing and layer assignment E I E F G H I Genomic filters All three protocols—DNA-only, RNA-only, and hybrid—require mapping reads to the genome and then organizing the mapped reads based on their BAG and template tags. First, each read is checked for having the expected structure of barcodes and primer sequences. Second, with the tag and primer sequences removed, the rest of the read is mapped to the reference genome. Reads that share a template tag and a BAG tag, and that co-localize in the genome, are collected into read aggregates For classifying molecules into DNA or RNA origin, templates are assigned to either the RNA or DNA molecular layers based on the composition of their read aggregates. As detailed in the Methods RNA layer DNA layer indeterminate We initially applied the molecular-layer concept to a mixture experiment involving two human cell lines: a normal fibroblast, SKN1, and a breast cancer cell line, SKBR3. The distributions of the basic parameters and downsampling curves from this experiment are shown in Additional file 3: Fig. S3B–G. We illustrate the clustering results and heatmaps based on the copy number and gene expression in Fig. 1 35 42 1 Clustering RNA and DNA layers We used the Seurat package [ 43 2 Fig. 2 Comparative clustering analysis using the hybrid BAG-seq protocol versus DNA-only and RNA-only protocols. A N A B C D B C Ta Tb F EP EC Multinomial wheel Whether dealing with DNA or RNA data, a common question often arises: how well does a single cell “fit” within its assigned cluster? To investigate this question within the context of a pre-established set of clusters, we first use multinomial probabilities. We take as a given the N N However, multinomial probabilities do not translate into a useful metric for deviation from a cluster. Every cell is assigned with almost no ambiguity to one of the major clusters. To properly identify cells that fall between clusters, we incorporate mixed cluster states into a multinomial wheel. For every pair of clusters, A and B with multinomial vectors p A B α A B N N The hybrid platform is comparable to DNA-only and RNA-only platforms In this section, we compare the hybrid BAGs to the DNA-only and RNA-only BAG platforms. We first focus on comparing the hybrid DNA layer to the DNA-only data, and then the hybrid RNA layer to the RNA-only data. We use the tumor tissue sample from patient 2 as a representative example, with similar comparisons for the other tumor tissue samples provided in Additional file 3: Figs. S6–S9. DNA layer Figure 2 To verify the congruence of profiles between platforms, we compared the average copy number profiles for each cluster in Fig. 2 RNA layer We next analyzed the RNA layer of hybrid data compared to the RNA-only protocol. We first combined all the nuclei from both the hybrid and RNA-only platforms and clustered the integrated dataset into 8 clusters as shown in Fig. 2 We reserve a discussion of the differentially expressed genes for later, but currently label the clusters as monocytes, T-cells, F (fibroblasts), EC (endothelial), EP (epithelial), plasma cells, and two distinct tumor RNA clusters, Ta and Tb. The central agreement matrices, formatted as heatmaps, show the consistency of cell classification across platforms within the merged dataset. The top matrix compares hybrid cluster assignments to merged dataset classifications, while the bottom does the same for RNA-only data. For both datasets, a significant proportion (95%) of cells align diagonally, confirming that cluster identities are well preserved across the two platforms. Profiling genome and transcriptome of tumor samples using hybrid data For each of the five tumors, we clustered the DNA and RNA layers of the hybrid data, respectively (Fig. 3 Fig. 3 Connecting genomic and transcriptomic data across five tumor samples using alluvial diagrams. A E Based on the dual DNA and RNA identities assigned to single cells in the hybrid dataset, we quantified the frequency with which cells from a specific DNA cluster appear in a given RNA cluster. This cross-layer association is visualized using alluvial diagrams. For example, in panel A from Tumor Sample 1, the alluvial diagram illustrates that the diploid N cells map exclusively with non-malignant expression profiles (macrophage, F + EC, and EP). Conversely, both tumor clones A 1 1 1 1 We now delve into the unique characteristics of each of the five tumor specimens, drawing comprehensive insights from both DNA and RNA layers. Focusing on the tumor genome projection patterns, each of the five tumors displayed a different projection pattern, and we observed almost all the possible patterns. To classify projections, we used a set of letters and numbers to represent the tumor genome and tumor RNA clusters, respectively. For example, [A:1,2; B:2] indicates tumor clone A projected into RNA clusters 1 and 2, whereas tumor clone B from the same primary tumor tissue projected only into RNA cluster 2. We have seen: distinct tumor clones could each project into distinct expression clusters (e.g., [A:1; B:2] for Tumor 5), into shared clusters (e.g., [A:1,2; B:1,2] for Tumor 1), or into a combination of distinct and shared clusters (e.g., [A:1,2; B:1] for Tumor 4). Alternatively, multiple DNA clones could project into a single RNA cluster (e.g., [A:1; B:1; C:2; D:2] for Tumor 2), or a single tumor clone could project into two RNA clusters (e.g., [A:1,2] for Tumor 3). Furthermore, based on the alluvial plots and the underlying tumor cell identity contingency tables, we calculated the Rand Index and Adjusted Rand Index to quantify the correspondence between DNA and RNA cluster assignments (Additional file 4: Table S3). Higher values of these indices indicate stronger concordance between the two clustering schemes. Tumors 2 and 5, which showed more evident alignment between DNA and RNA clusters, exhibited higher Rand Index and Adjusted Rand Index values compared to Tumors 1, 3, and 4. The latter tumors displayed more mixed projections across modalities, suggesting greater transcriptional plasticity. With the details of the five cases using the hybrid protocol provided in Additional file 5: Supplementary text, we briefly highlight the important findings regarding these respective cases here. Tumor 1 was a uterine carcinosarcoma, which is pathologically observed as a biphasic tumor containing both carcinomatous and sarcomatous components. Echoing this in the RNA analyses, cluster Ta 1 FGFR3 COL9A2 COL27A1 1 1 1 1 1 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 Tumor 3 is an endometrial adenocarcinoma. It contains a single tumor DNA clone that projects to two distinct RNA clusters—one estrogen receptor (ER) positive and the other ER negative. This observation is consistent with the pathological findings, with the immunohistochemistry (IHC) images showing that ER-positive and ER-negative tumor cells are spatially intermixed within the tissue (Additional file 3: Fig. S15). Tumor 4 is another uterine carcinosarcoma case. Unlike the other carcinosarcoma case Tumor 1, the tumor cells here globally exhibit sarcomatous-like features, with one RNA cluster, Ta 4 4 4 4 4 4 4 4 4 4 4 4 4 4 4 1 1 Tumor 5 is a uterine leiomyosarcoma, with the most intuitively straightforward tumor DNA-RNA correspondence among these five cases, as it exhibits a nearly one-to-one mapping between the two tumor DNA clones and two RNA clusters, despite some cross-projections. Similar to Tumor 4, an RNA cluster representing proliferating cells is distinguishable at this hierarchical level, but unlike Tumor 4, both tumor DNA clones proportionally contribute to this cluster Tc. Combined clustering of all patient samples Integrative clustering analysis and cluster phylogeny In our previous sections, we examined one patient at a time, while in this section, we aim to understand how patient expression profiles interrelate and potentially achieve finer resolution in our clustering analysis. To gain such a global picture of the hybrid data, we performed cluster analysis on the combined data from all patients, separately for RNA layer and DNA layer, as demonstrated in Fig. 4 + 1 Fig. 4 Integrated cluster analysis and unique cluster identification using aggregate tumor and normal tissue data from all patients. A 3 B C D A E J C I J B Table 1 Co-clustering counts across all samples. This table presents the distribution of nuclei for each patient (P1 to P5) and tissue sample (Tumor or Normal) categorized by DNA cluster: diploid (flat, white), diploid with one X chromosome (X-loss, blue), and aneuploid (CN+, red). It details the total count of nuclei within each category, along with sub-counts for each expression cluster Specifically, our gene expression clustering procedure incorporates several novel features, which we detail below for clarity. First, we include 3500 “empty” cells derived from the RNA layer of DNA-only BAGs. These empty cells were clustered together in Fig. 4 As before, we use Seurat’s FindClusters and UMAP functions to cluster and display 40,149 nuclei, which uses the UMAP coordinates to visualize the single cells, as shown in Fig. 4 We use UMAP coordinates to obtain a planar representation of the cells, and our method of multinomial analysis to color the cells by expression type. The aggregate of templates in each subcluster forms a gene probability vector, wherein the total number of templates mapping to a gene is normalized by the total number of templates mapping to any 4 We then use the multinomial distributions to establish a distance metric between any two subclusters, each with its own multinomial distribution. The asymmetric disparity between two multinomial distributions, A and B, is determined by simulation, in which we determine the number of unique RNA-layer templates of a cell simulated from distribution A that are needed to preferentially assign the cell to A rather than to B, for some given confidence threshold. We then symmetrize the disparity measure, combining A to B and B to A. Clusters with distinct profiles will require fewer templates to establish separation, while those with similar profiles require more templates for differentiation. We invert this measure to establish a pairwise distance (Additional file 3: Fig. S17) and use neighbor-joining to build a phylogeny over the expression clusters (Fig. 4 On the DNA front, from a total of 35,369 nuclei from the sources indicated in Fig. 4 4 Common and unique features in stromal subpopulations Combining RNA and DNA clustering information, the projections of nuclei from six sample sources into the combined RNA space (Fig. 4 4 Although the normal-genome stromal clusters are mostly shared between patients, the distribution and abundance of different subtypes vary significantly by patient and sample. For example, there are substantial differences in immune cell proportions among the five patients, as illustrated in Fig. 4 1 4 4 3 4 1 4 From a hierarchical and phylogenetic perspective, the multinomial tree (Fig. 4 4 5 4 4 5 The tumor clones from each patient occupy distinct sub-branches in the tree. The uterine leiomyosarcoma (purple), a muscle-derived tumor, has expression subclusters on the fibroblast branch of the tree. The other four tumors share a deep branch with the epithelial cells. One sub-branch contains the two uterine carcinosarcomas (red and dark red). Nearer the epithelial cells in the tree, are the endometrial adenocarcinoma (green) and nearer still the uterine serous carcinoma (blue). The branch lengths provide a relative measure of similarity, showing that Ta 1 1 3 3 2 2 Multinomial wheel and crossovers In the previous section, we observed that the majority of nuclei exhibit concordant DNA and RNA profiles: diploid DNA with stromal RNA expression (flat, N N 44 To determine if crossover nuclei are a unique biological state or collision artifacts, we employed the multinomial wheel to differentiate mixed states. Integrating DNA-layer data across all hybrid-protocol experiments, we constructed a multinomial wheel with tumor clusters, diploid cells and diploid cells with X-loss as the individual spokes of the wheel (Additional file 3: Fig. S18A). Some tumor DNA clusters are so similar (A 1 1 4 4 1 1 4 4 From the DNA counts of each nucleus, we evaluate the probability that those observations are derived from each of the (495 + 11) = 506 multinomial distributions in the wheel. We assign each nucleus to the node with the highest posterior probability. Notably, more than 60% of nuclei align with a “pure” cluster on the multinomial wheel by residing on a vertex, and 85% are situated within two units’ distance from a pure cluster (Additional file 3: Fig. S18A). Informed by two mixture experiments, detailed in the Methods and Additional file 3: Fig. S18B–E, we apply a collision filter, marking for removal nuclei that are 3 or more units from a vertex and fall between a normal DNA cluster (N, Nx) and a tumor DNA cluster (A i i If crossovers are the result of cryptic collisions, the collision filter will disproportionately reduce the frequency of crossovers compared to the concordant nuclei between the DNA and RNA layers. Indeed, our observations align with these expectations: while the collision filter removed 14% of concordant nuclei, it removed a substantial 71% of crossover nuclei (Additional file 8: Table S6). Removing collisions does not alter the results presented in the previous section. A version of Table 1 restricted to nuclei that pass the collision filter can be found in Additional file 10: Table S8. The multinomial wheel can be used for much more than detecting doublets. It quantitatively measures how much a single cell deviates from the centroids of major clusters in DNA or RNA space and can provide insights into genomic heterogeneity, particularly for cells transitioning between states. It does not rely on PCA or UMAP coordinates, and by using only cluster centroids as reference points, it offers an interpretable, coordinate-free metric for cell-wise distance that aids interpretation of nonlinear, reduced-dimensional embeddings such as UMAP. For example, in Additional file 3: Fig. S19, we extracted tumor cells from three cases in which only two major tumor clones were present and projected them onto a one-dimensional space based on their best multinomial probability. The proportion of cells classified as “in transition” by the one-dimensional multinomial wheel agrees with the intuitive spatial distribution observed in UMAP space and is significantly higher than expected from doublet rates, suggesting the presence of intermediate or transitioning cells that share features of both clones. Loss of X chromosome in stromal lineage In this final analysis, we revisit the occurrence of X chromosome loss in diploid cells, particularly noted in the plasma cell population from patient 2’s tumor sample. X chromosome loss, while reported before in various tissues associated with cancer [ 45 46 47 48 To determine whether the X chromosome loss was the result of a clonal event or occurred independently across different cells, we performed a haplotype analysis: If all affected cells lost the same X chromosome, it would suggest a common ancestry; whereas if they lost different copies of the X, it would point to independent, convergent events. The tumor genome from patient 2 has two subclones with X-loss (A 2 2 5 5 XIST TSIX IGHG1 IGHG2 XIST 49 51 Fig. 5 Analysis of chromosome X loss in somatic cells of the primary tumor 2. A B C D I D E F E F G I D F Considering the distinct IGH expression in the plasma subclusters, we further investigated the clonality of the Plasma-Nx 52 5 To corroborate our findings and further visualize the loss of the X chromosome, we applied RNAScope technology on the same tumor tissue from patient 2. The spatial transcriptomics images (Fig. 5 5 2 2 5 5 5 We next extended our X-loss analysis to the other tissue samples. For patient 1, we noted a 5% X-loss in the diploid component of the normal distal sample, predominantly in the smooth muscle (F 2 1 2 Discussion In our analysis of the hybrid data, we observed a small but significant population of cells that appear to violate their identities: tumor cells with normal expression and diploid cells with tumor expression. The former suggests a sort of mimicry in which the cancer cells appear like normal stroma, while the latter may point to a pre-aneuploid tumor precursor state or stromal cells dramatically altered by the tumor microenvironment. However, the application of a collision detection method significantly reduced these crossover populations. This reduction has tempered our initial belief in the prevalence of mimicry or progenitor states as observed in the hybrid dataset. The existence of such cells cannot be completely dismissed, and further refinements to the method, larger datasets, and additional data types will be required to determine their frequency and biological significance. The current version of hybrid BAG-seq yields relatively low DNA-layer template counts, lower than those obtained from the DNA-only protocol. This is likely due, in part, to suboptimal primer denaturation and hybridization time and temperature conditions, which have not yet been fully optimized and could be improved in the future to increase yield. In addition, we applied very conservative filtering criteria for DNA-layer molecules to ensure copy number accuracy-restricting analysis to intergenic templates and excluding hotspot regions. Furthermore, the majority of captured templates, especially for nuclei samples, actually fall within intronic regions, which we did not use for either DNA-layer or RNA-layer analyses in this work, but they are worth further investigation to develop better algorithms for assignment to the RNA or DNA layer. Regarding RNA yield, we used NST buffer for nuclei isolation but did not test alternative methods that may better preserve RNA integrity and potentially further enhance recovery for different tissue types [ 53 56 Most tumors exhibit detectable copy number differences [ 57 58 61 Although the DNA analyses in this study were mostly based on coverage-derived copy number information, we also performed loss-of-heterozygosity (LoH) analyses using germline SNPs from matched blood whole-genome sequencing. These SNP-based analyses were used to validate cluster differences inferred from copy number variation and also to provide additional phylogenetic information. In the same vein, this DNA-RNA paired dataset also presents an opportunity to explore allele-specific expression (ASE) in the RNA layer, which could potentially help resolve subclones with similar copy number profiles but different allelic gene expression patterns. A transcriptome-wide ASE analysis is for future studies, but we have included a proof-of-concept example by analyzing RNA-layer data from nuclei of the A 2 2 2 2 2 Building on its capacity to detect genomic mutations, future versions of the BAG platform could also be adapted to incorporate epigenetic features. For example, transposons modified with Acrydite could be incorporated via transposase to access open chromatin regions, which can be covalently linked to BAGs. This linkage of original genomic DNA molecules to BAGs would also allow for parallel genomic variation and epigenetic DNA methylation analyses. The RNAscope assay on X chromosome loss in this study briefly touches on the potential of using spatial transcriptomics to image stromal mutations, which are difficult to validate or infer using single-omic sequencing techniques. In the spatial context, hybrid BAG-seq holds even greater promise. With the advancement of spatial platforms like Xenium, Visium, and MERSCOPE that can resolve hundreds of genes across millions of cells, hybrid BAGs can guide the selection of informative genes that best represent tumor subclones, somatic variations, and even stromal mutations, thereby empowering spatial transcriptomics assays for genomic lineage tracing and mutation-informed mapping. Conclusions RNA-only data cannot definitively distinguish a stromal expression state from that of the tumor or tumor precursors. Identifying which expression patterns belong to stromal cells and which belong to tumor cells becomes particularly challenging when stromal populations exhibit atypical expression or when tumor cells mimic normal cells. Moreover, there is little hope of connecting tumor genomic changes marked by DNA clonality with changes in expression states marked by RNA clusters. To close this gap in our understanding requires integrating single-cell DNA and RNA together from the same nuclei, ideally with thousands of nuclei per tissue sample. We achieved this by leveraging our BAG (balls of acrylamide gel) platform. The BAG platform uses a microfluidics oil-emulsion technique to co-encapsulate single nuclei with Acrydite-modified primers and acrylamide monomers into a droplet. The primers hybridize to the cellular nucleic acids, which are subsequently copolymerized to convert the droplet into a permeable gel matrix or BAG. Depending on primer design, hybridization conditions, and polymerases, BAGs can capture either DNA or RNA alone, as we have previously shown. In this paper, we introduce a new method that captures DNA and RNA together in hybrid BAGs. We demonstrate that hybrid BAGs provide sequence data that are consistent with those obtained from DNA-only or RNA-only BAGs. The hybrid data are sufficient to establish the same genomic and expression identities identified by the other two methods. In the five patients we examined, we observed comparable and consistent clusters (Fig. 2 Having established the effectiveness of the hybrid method for each modality, we then explored the interplay between the DNA and RNA layers. We found that the combination of expression and genomic data from hybrid BAGs clarified the subpopulation composition of the primary site of tumors. We used several standard tools from the Seurat package, including cell type clustering, subset selection, and UMAP visualizations. We also developed additional modules: (1) using Seurat to cluster the DNA copy number data; (2) alluvial plots to visualize the mappings of genomic clusters into expression clusters; (3) multinomial methods to determine cell cluster membership and to filter collisions; (4) establishing distance metrics relating clusters; and (5) cluster back propagation, which uses information from the DNA-layer to divide RNA clusters, and the reverse. By examining the alluvial plots in Fig. 3 1 1 1 In cases where different tumor DNA clones project to the same RNA cluster, we use a process unique to hybrid data that we call back-propagation. In back-propagation, we use the DNA-layer identities to look for additional substructures in the RNA-layer expression states (and vice versa) and then test those groups for significant differences in expression. Subclustering obtained in this way usually does not emerge when clustering RNA-layer alone, or it does not appear at the same hierarchical level as other major tumor clusters, but the genes detected through this approach may have important implications for tumor evolution and could serve as lineage-specific expression markers. In the combined data from all samples, we identified 23 distinct stromal expression clusters. The majority of these clusters (21 of 23) include nuclei from more than one patient, suggesting that many stromal cell types have consistent expression patterns across individuals. In contrast, every tumor cluster occurs in one and only one patient with little in common between the tumor clusters from different patients. By analyzing highly expressed genes, we accurately determined the likely cell type or state for most of these clusters. Our analysis revealed two stromal expression clusters unique to patient 1: a fibroblast population in the distal normal tissue with activation of the AP-1 pathway, and an epithelial population in the tumor tissue with unique makers for signaling and response to stimuli. This epithelial population was distinct in both the UMAP and the multinomial tree. Without the DNA-layer from the hybrid data, we could not have confidently concluded that this unique cluster derives from diploid cells. While most of the diploid cells are copy number 2 everywhere (labeled as N), in every patient we identified a subset of diploid nuclei that exhibited the loss of an X chromosome (labeled Nx). While this phenomenon has been previously observed in both tumors and stromal populations, the hybrid BAGs provide new insights into their role in tumor biology. In patient 2, we identified an X-loss event in a significant proportion of the plasma cell and T-cell populations. Using the RNA data and the DNA data together, we determined that each plasma cell lost the same X chromosome, whereas the T-cells lost either one or the other equally. This strongly suggested that the plasma cell population may have a common origin. Comparing the expression profiles of plasma-N plasma-Nx XIST TSIX IGH1 IGH2 Methods Pulverization of frozen tissue samples in liquid nitrogen All patient tissue samples were pulverized in liquid nitrogen (LN2) with a sterile mortar and pestle prior to analysis. Mortar and pestles were submerged in LN2 and cooled to LN2 temperature. The cooled vessels were then partially filled with fresh LN2 and transferred to a basin containing a shallow pool of LN2. The presence of LN2 in both the mortar and basin helped maintain a constant temperature during the pulverization process and prevent sample heating due to friction. The tissue samples were then transferred to the sterile mortar, submerged in LN2, and pulverized until they were mostly a fine, homogeneous powder. Once pulverized, residual tissue material was scraped off the pestle back into the mortar with a sterile, LN2-cooled disposable spatula. The mortar was then removed from the basin to allow for the LN2 to evaporate out of the mortar. Subsequently, pulverized tissue was immediately collected with a fresh, sterile, LN2-cooled disposable spatula into 2.0 mL DNA LoBind Eppendorf tubes submerged in LN2. Pulverized samples were placed on dry ice with the caps open to allow for temperature equilibration before closing the tubes, and then stored at − 80 °C until further use. All samples were pulverized with separate sterile mortar and pestles to avoid cross-contamination between tumor and normal tissues. The sample cohort We studied samples from five patients (patient 1–patient 5). The samples were from their uterine cancers (Tumor 1–Tumor 5), and in three patients also from an adjacent normal endometrial site (Normal 1, Normal 2, and Normal 4). For most samples (Normal 1, Tumor 1, Tumor 2, Tumor 3, Normal 4, Tumor 4, Tumor 5), we sequenced single nuclei of the same sample on each of three platforms: DNA-only, RNA-only, and the hybrid protocol. We performed comparison analyses and showed the validity of the hybrid protocol mainly using the above five trio data sets. Hybrid BAG generation A detailed step-by-step bench protocol is archived at protocols.io [ 62 42 42 35 35 The first critical change was an incubation step at 85 °C for 5 min instead of 95 °C for 12 min for DNA denaturation in the DNA-only protocol. Otherwise, we observed significant destruction of the RNA. The second critical change took place after the BAGs were formed. The RNA and genomic DNA trapped in the BAGs were used as templates to make covalently bound copies, and in the new hybrid protocol, both reverse transcriptase and DNA polymerase were used. Template-switch-oligos were also introduced in the hybrid protocol so that the cDNA products which were covalently linked to the BAG matrix ended with a double-stranded region. This double-stranded DNA region included an NLA-III cleavage site. Subsequently, DNA polymerase (Klenow) was added to extend the captured genomic DNA from primers, forming a copy that was also covalently linked to the BAGs. Some, perhaps most, of the cDNA-mRNA sequence was further partially converted to double-stranded cDNA. BAGs were pooled and the covalently captured DNA and cDNA were cleaved with NLAIII leaving a sticky end used for subsequent extensions. BAG barcodes and varietal tags were added to the 3′ ends of the covalently captured nucleic acids in split-and-pool reactions. The BAG barcodes were present on both the genomic-DNA and RNA copies. The varietal tags were used for counting. The first BAG barcode and varietal tag were introduced by ligation extension, as described in the step-by-step hybrid BAG-seq experimental protocol [ 62 These amplified products were pooled and converted by tagmentation into paired-end Illumina sequencing libraries. One end of the reads contained BAG barcode and varietal tag, as well as genomic or transcriptomic sequence information. The other end from random tagmentation was mostly genomic or transcriptomic sequence information. Initial data processing Sequencing libraries were sequenced in paired-end 150 bp format using an Illumina NovaSeq 6000. Briefly, each processing step is described in more detail in the immediately following sections. We first checked the structure of each read pair in the fastq files. For the good read pairs with the correct structure as shown in Fig. 1 Step 1—check sequence structure First, we filtered out reads from the fastq files where either Read 1 or Read 2 were less than 100 bases. Second, we examined if the sequences from the expected BAG barcode positions exactly matched one of the 96 × 96 × 96 barcodes, and if the “CATG” cutting site was in the expected location, allowing for one base mismatch. We removed read pairs that did not satisfy these requirements. Third, from Read 1 which started with barcodes and varietal tags, we trimmed away the first 80 bases containing the BAG barcode, varietal tag, and adapter sequences, and also checked if the reverse complementary sequence of the universal primer (“CCAAACACACCCAA”) or oligo-dT (“AAAAAAAAAAAAAA”) was present. If present, it meant we had reached the end of the template, so these primer-related sequences were trimmed off for downstream mapping. Similarly, for Read 2, the tagmentation end, we checked and removed the adapter sequence (“GAGCGGACTCTGCG”) from the first split-and-pool if it existed. After trimming, we required both Read 1 and Read 2 to be at least 30 bases long. All the bases from Read 1 and Read 2 after trimming were then used for paired-end mapping (step 3). Step 2—extract BAG barcode and varietal tags If a read pair passed step 1, we extracted the BAG barcode and varietal tag information from the first 80 bases of Read 1, and this information was appended to the read ID. The 17 base BAG barcodes came from three cycles of the split-and-pool procedure, of which five bases came from the 1st-split, six bases came from the 2nd-split, and six bases came from the 3rd-split. There were 96 different barcodes for each split, so there were altogether 96 × 96 × 96 (≈ 1 million) varieties. The 12 base varietal tag came from both the split-and-pool primers and the genomic sequence. Out of these twelve bases, four bases came from the 1st-split, four bases came from the 2nd-split, and four bases came from the genomic sequence that was two bases away from the “CATG” cutting site. These twelve bases provide 4 12 Step 3—map to the human genome After steps 1 and 2 above, read pairs were mapped to the UCSC hg19 human genome using HISAT2 version 2.1.0 [ 63 Step 4—combine read information with original template information We grouped the mapped reads based on their BAG barcodes. For the reads with the same BAG barcode, we sorted the varietal tags by the number of reads associated with each tag in descending order. We performed a “rollup” algorithm on the sorted varietal tags and discarded varietal tags within a Hamming distance of one from a more abundant varietal tag having at least ten times more reads. We assumed the eliminated varietal tags originated from the tags with more abundant reads but contained sequencing or PCR errors. Using the varietal tags from the above “rollup” step, we aggregated the mapped segments for all the reads with the same varietal tag. We checked the total coverage of each varietal tag against all exons and transcript boundaries from the NCBI refSeq gene annotation file downloaded from the UCSC genome browser and wrote out one line per varietal tag with all the useful information into a “template table.” Each line of the template table contains the following information: BAG barcode, varietal tag, chromosome, start mapping position, end mapping position, start and end mapping position for each fragment if there was more than one continuous fragments, total bases covered by this template, number of reads, number of genes, gene list, bases overlapping with the transcript of the best-matched genes, bases overlapping with exons, number of splice junctions, number of unspliced sites, bases overlapping with the coding regions, 5′UTR, and 3′UTR of the gene. The downstream data analyses were mainly based on the information from this table. The best-mapped gene was deemed to be the gene from the annotated transcript file having the highest overlap to the transcript. If more than one transcript had the same overlap then best was determined by overlap to exons, then overlap to coding sequence, then the number of splice junctions, then the fewest unspliced sites. If more than one gene tied for all these criteria, then all genes are listed in the template table. Template processing Sequence classification Starting from the template data table described above, each initial molecule was classified as one of the four categories: “Exonic,” “Intronic,” “Intergenic,” and “Uncategorized.” This process was applied uniformly regardless of the protocol types (RNA-only, DNA-only, or hybrid). We classified a template as an “Exonic” template if over 90% of its bases were mapped within one gene. Furthermore, we refined the “Exonic” classification only if 50% or more covered bases from this template were exonic, or if 20% or more covered bases were exonic and at least one splicing event was observed (RNA layer). If all the bases from a template were mapped to intergenic regions, we classified it as “Intergenic.” If a template was not classified as “Intergenic,” but less than 10% of its covered bases were exonic and no splicing events were observed, this template was classified as “Intronic.” Only a small proportion of templates failed to be classified into the above three categories, and these templates were classified as “Uncategorized.” For expression clustering, we only used “Exonic” templates assigned to a single gene regardless of protocols. For copy number clustering, we tested four versions of template choices on all the libraries, which we will discuss in the next section. Refinement of copy number estimation methods We demonstrated four progressively refined versions of copy number estimation, named “all_molecules,” “no_exon,” “no_gene,” and “no_gene.avoid50closeTN” (Additional file 3: Fig. S1). The “all_molecules” method simply used all molecules from each retained nucleus for copy number estimation, as the name implies. The “no_exon” method used only molecules classified as “Intronic” or “Intergenic,” as described in the previous paragraph. The “no_gene” method further restricted the data to only “Intergenic” templates, excluding any molecules with bases overlapping annotated transcripts. For each sample, we first downsampled the DNA-only reads using a per-cell binomial draw so that the total number of DNA molecules matched those of the hybrid library. Cells with fewer molecules than the hybrid depth were left unchanged. When comparing copy number data derived from intergenic templates in the hybrid protocol to those in the RNA-only protocol, we noticed that certain high-count genomic bins in the RNA-only data also appeared in the hybrid protocol. To investigate this, we aggregated all intergenic templates from seven RNA-only BAG-seq libraries (from two normal and five tumor tissues), sorted them by genomic position, and measured the distances between consecutive templates. Histograms of these distances revealed that the majority (> 77%) of adjacent intergenic RNA-only molecules were within 50 bp (Additional file 3: Fig. S21). Therefore, we defined RNA hotspots as genomic stretches where all consecutive inter-molecular distances are ≤ 50 bp after sorting by genomic position. We later found that these hotspot regions often contain poly-A (or poly-T) genomic DNA sequences. Since these hotspots distorted copy number profiles in both normal and tumor specimens, we eliminated them from downstream analysis. This filtering step improved copy number quality, as demonstrated using normal tissue samples (Additional file 3: Fig. S1). The final method, “no_gene.avoid50closeTN,” retained only the “Intergenic” templates from the “no_gene” method that were located at least 50 bases away from RNA hotspots. We observed that each successive filtering criterion progressively improved copy number quality. To quantify this improvement, we introduced a “terrain” metric to measure coverage uniformity across the genome. It is defined as the sum of absolute differences between adjacent bins; lower terrain values indicate smoother and more uniform copy number profiles. As shown in Additional file 3: Fig. S1, the DNA-only libraries consistently exhibit lower terrain scores than hybrid libraries, but the difference diminishes as more stringent filters are applied—from “all_molecules,” to “no_exon,” to “no_gene,” and finally to “no_gene.avoid50closeTN.” This final criterion, “no_gene.avoid50closeTN,” was used to define the DNA-layer molecules of the hybrid BAG-seq protocol and was applied in all downstream analyses throughout this study. Empirical binning strategy for copy number analysis Separately for each of the four copy number molecule selection methods described above, we used the genomic positions of all molecules from two normal-tissue DNA samples to determine empirical bin boundaries for 300 genomic bins, each containing approximately equal molecule counts. Excluding any molecules mapped to chromosome Y, we assigned to chromosomes 1–22 and X a number of bins proportional to their fraction of the total molecule count. Within each chromosome, bin boundaries were assigned greedily from the chromosome start, such that all but the final bin contained at least the number of molecules equal to the chromosome-specific total molecule count divided by its assigned number of bins. The observed count of molecules per bin was recorded as a normalization factor for later use during per-sample copy number estimation. This factor accounts for residual bin-to-bin differences resulting from unequal molecule distributions and rounding of bin assignments per chromosome. Because a small total number of bins (300) were used, perfect proportional allocation was not possible, and normalization factors could vary by up to 30% between chromosomes. Additional file 11: Table S9 provides the details of the 300 empirical bins used for hybrid protocol DNA-layer copy number analysis. This table includes the start and end genomic positions of each bin, bin length, GC content, and the actual number of intergenic molecules from the two normal samples (“n_good”) used to compute per-bin normalization weights in single-cell copy number analysis. We used the following formula to transform the raw per-cell bin count vector into a normalized bin count vector, without changing the sum of total bin counts for each cell. Applying this transformation does not affect clustering results but makes the bin counts of normal cells more uniform and improves the visual appearance of the copy-number heatmaps. Let us define: \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${{\\varvec{r}}{\\varvec{a}}{\\varvec{w}}}_{{\\varvec{c}}{\\varvec{b}}}$$\\end{document} r a w c b c b \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${{\\varvec{n}}}_{{\\varvec{b}}}$$\\end{document} n b b \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${\\text{T}}{\\text{c}}$$\\end{document} Tc \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${\\sum }_{b}\\frac{{{\\varvec{r}}{\\varvec{a}}{\\varvec{w}}}_{{\\varvec{c}}{\\varvec{b}}}}{{n}_{b}}$$\\end{document} ∑ b r a w c b n b c \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${\\text{N}}{\\text{c}}$$\\end{document} Nc \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${\\sum }_{b}{raw}_{cb}$$\\end{document} ∑ b raw cb c Then, the normalized value is \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${{\\varvec{n}}{\\varvec{o}}{\\varvec{r}}{\\varvec{m}}}_{{\\varvec{c}}{\\varvec{b}}}$$\\end{document} n o r m c b \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\left(\\frac{{{\\varvec{r}}{\\varvec{a}}{\\varvec{w}}}_{{\\varvec{c}}{\\varvec{b}}}}{{{\\varvec{n}}}_{{\\varvec{b}}}}\\right)\\bullet \\frac{{{\\varvec{N}}}_{{\\varvec{c}}}}{{{\\varvec{T}}}_{{\\varvec{c}}}}$$\\end{document} r a w c b n b ∙ N c T c Segmentation and visualization of copy number profiles Copy number segmentation was used only to generate visual copy number profiles for population-based plotting, such as in Fig. 2 64 RNA clustering The RNA clustering was performed using Seurat package (version 3.1.5) following the standard Seurat clustering pipeline [ 43 https://github.com/siranli01/DNA_RNA RNAScope imaging analysis RNAScope Multiplex Fluorescent Reagent Kit v2 (Advanced Cell Diagnostics) was employed to visualize RNA transcripts within tissue sections. Formalin-fixed, paraffin-embedded (FFPE) tissue slides from Tumor 2 were prepared according to the manufacturer’s instructions. Following deparaffinization and rehydration, sections underwent hydrogen peroxide treatment and target retrieval. Protease treatment was then applied to facilitate probe penetration. The following RNAScope probes were used for target detection: IGHG-pool (Cat No. 481901), which targets IGHG (1–4) with 11–19 ZZ pairs, and human XIST (Cat No. 311231-C2), which targets the XIST RNA transcript. Signal amplification was performed using the RNAScope Multiplex Fluorescent Reagent Kit v2. The TSA Vivid Dyes were used for fluorescent signal development: IGHG was visualized using TSA Vivid Fluorophore 520 dye (Cat No. 323271), and XIST was visualized using TSA Vivid Fluorophore 570 dye (Cat No. 323272). Amplification steps followed the standard protocol provided by Advanced Cell Diagnostics, ensuring optimal signal-to-noise ratio. Imaging was conducted on a Nikon Ti spinning-disk confocal microscope equipped with a YOKOGAWA spinning-disk system and controlled by Nikon Elements software AR 5.42.04. Fluorophores were excited with the following laser lines: DAPI at 405 nm, IGHG (TSA Vivid Fluorophore 520) at 488 nm, and XIST (TSA Vivid Fluorophore 570) at 561 nm. Fluorescent signals for DAPI, IGHG, and XIST were pseudo-colored for visualization. Copy number clustering Similar to RNA clustering, we used “RunUMAP” and “FindClusters” functions of Seurat to cluster nuclei based on copy number. For each library, we had a bin-counts matrix, similar to the gene matrix for RNA clustering. There were 300 rows in the matrix, representing 300 genomic bins. Each column represented a nucleus. Each element of the 2D matrix represented the tag counts of the corresponding bin in the corresponding nucleus. We first normalized the matrix by columns: for each nucleus, we divided each bin count by the mean of 300 bins and then multiplied by 2. We not only used these 300 normalized single bin counts for clustering, but we also included the median normalized bin counts of every two and three adjacent bins, as long as these adjacent bins were within the same chromosome. The reason for this step was that copy number segmentation usually requires similar amplification or deletion patterns in at least two contiguous bins. By doing this, we appended another 277 rows from the two adjacent bins and 254 rows from the three adjacent bins onto the original 300-row normalized bin-count matrix. We performed clustering using the new matrix with 831 rows. We used a workflow similar to that for RNA clustering, but we did not use “NormalizedData” function since the matrix had already been normalized. For “FindVariableFeatures” function, we used the top 500 features by inputting “selection.method = “vst”, nfeatures = 500”. Copy number heatmap The single-nucleus copy-number heatmap was plotted using Seurat “DoHeatmap” function. Each row represented the median normalized counts of two adjacent bins, except for the first bin of each chromosome, in which we used the normalized count of that single bin. The total of 300 rows were sorted in genomic order, with chromosome Y eliminated. Multinomial distributions For a cluster X, we sum the RNA template counts over each gene for all cells in the cluster. If a gene contains zero counts over the population of cells, we assign a value of ½, to avoid zero probabilities when comparing to a cell that containing a gene unobserved in cluster X. We normalize by the count vector by its total to obtain a probability distribution over the set of genes. We compute this probability vector for each stromal expression cluster as determined by the Seurat iterative clustering of the stromal cell types, for each tumor cluster as determined in the individual tumor RNA clusters, and for an “empty” cluster composed of the RNA-layer from 500 DNA-only BAGs. The expression multinomial distributions are used for two purposes: Cluster assignment. We assign each nucleus to the distribution with the maximum likelihood of generating its observed counts, assuming a uniform prior on the space of clusters. These identities determine the color of the points in Fig. 4 1 Inter-cluster dissimilarity. We compute a pairwise dissimilarity between clusters using the multinomial distributions induced by the cluster average. For any two clusters X and Y, and template count t between 1 and 300, we compute by simulation (100,000 samples per data point) the posterior probability that a single nucleus generated from the multinomial distribution on X and a count of t templates comes from X, conditioned on the prior probability of originating from X or Y with equal probability. For each value of t, we compute the AUROC (equivalent to the average posterior probability). To define a measure of how likely X is correctly identified against Y, we compute M(X, Y), the smallest value of t for which the AUROC exceeds 0.999 (Additional file 3: Fig. S17). To convert this matrix into a pairwise dissimilarity between clusters, we compute a similarity measure S(X, Y) = ½ * [M(X, Y) + M(Y, X)] and invert this to obtain a dissimilarity measure D(X, Y) = 300 − S(X, Y). We then apply the neighbor-joining algorithm to the dissimilarity measure to obtain a tree (Fig. 4 Multinomial wheel To build a multinomial wheel in DNA space, we first computed a multinomial vector to represent each Seurat cluster. Each multinomial vector had 300 elements, representing 300 genomic bins. Each element was the total bin counts from all the nuclei in that cluster. We normalized each vector to sum to one, serving as the multinomial probability vector representing that cluster. Next, we computed the linear combination of multinomial probability vectors of every two Seurat clusters, and created 9 equally spaced sampling states \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${C}_{\\text{1,2},\\dots ,9}=pA+\\left(1-p\\right)B$$\\end{document} C 1,2 , ⋯ , 9 = p A + 1 - p B p A B We applied a similar idea to create the RNA multinomial wheel. Different from the DNA multinomial vector where each element was a genomic bin, in RNA space, each element represented one of the 29,637 genes. We computed the sum of gene counts for each Seurat cluster \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${V}_{\\text{1,2},\\dots ,n}$$\\end{document} V 1,2 , ⋯ , n n \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${V}_{i}$$\\end{document} V i \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$i=\\text{1,2},\\dots ,n$$\\end{document} i = 1,2 , ⋯ , n \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${V}_{i}^{*}$$\\end{document} V i ∗ j \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${V}_{i}^{*}\\left[j\\right] = {V}_{i}\\left[j\\right]+\\left(0.05\\times (\\sum_{j}{V}_{i}\\left[j\\right])\\right)\\times (\\sum_{i}{V}_{i}\\left[j\\right])\\div (\\sum_{i,j}{V}_{i}\\left[j\\right])$$\\end{document} V i ∗ j = V i j + 0.05 × ( ∑ j V i j ) × ( ∑ i V i j ) ÷ ( ∑ i , j V i j ) \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${V}_{i}^{*}$$\\end{document} V i ∗ i Supplementary Information  Additional file 1: Table S1 Patients overview. Additional file 2: Table S2 BAG library parameters. Additional file 3: Figures S1–S21. Additional file 4: Table S3 Contingency matrices. Additional file 5: Supplementary text. Additional file 6: Table S4 Tumor subcluster expression. Additional file 7: Table S5 Stromal marker genes. SAdditional file 8: Table S6 Crossover analysis. Additional file 9: Table S7 Crossover summary, effects of filtering. Additional file 10: Table S8 Co-clustering all (filtered for collisions). Additional file 11: Table S9 Empirical bin boundaries for hybrid protocol. Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements We thank P. Moody for cell sorting; J. Preall, C. Regan, and E. Zhang in CSHL single-cell core facility for assistance; Q. Gao for histology assistance; A. Runnels from NYGC and E. Ghiban from CSHL for Illumina sequencing assistance; M. Yao, S. Kleeman, D. Fearon, T. Janowitz, J. Boyd, and D. Tuveson from CSHL and N. Chiorazzi from Northwell for helpful discussion; and A. Kapedani, M. A. Green, and S. Chin from the Clinical Research Team in the Department of Obstetrics and Gynecology of Northwell Long Island Jewish Medical Center for clinical information assistance. Additionally, we extend our gratitude to S. S. Fox, M. Heywood, K. Quinn, B. M. Weil, and J. Jacob from Biobanking/Anatomic Pathology Team in the Northwell Health Biospecimen Repository (NHBR) in Northwell Health Cancer Institute for sample transfer and pathological information assistance. Peer review information Andrew Cosgrove was the primary editor of this article and managed its editorial process and peer review in collaboration with the rest of the editorial team. The peer-review history is available in the online version of this article. Authors’ contributions S.L. and M.W. conceived the idea and designed the study; S.L., J.K., P.A., R.M., M.W., and D.L. developed bioinformatic analysis programs; S.L. and M.W. developed the experimental protocol; S.L., J.A., E.R., H.O., S.P., L.S., P.M., and D.B. performed single-cell BAG-seq experiments; J.A., C.P., and D.S. assisted in sample transfer and sample preparation; A.R. performed histology analyses; M.F. and G.L.G provided samples and clinical guidance; S.L., J.K., P.A., R.M., N.R., Z.L., M.R., D.L.D., M.W., and D.L. performed informatics analyses and results interpretation; S.L., M.W., and D.L. wrote the manuscript with input from all coauthors. All authors read and approved the final manuscript. Funding This work was supported by a grant from the Simons Foundation, Life Sciences Founders Directed Giving-Research (award number 519054 to M.W.); The Breast Cancer Research Foundation (BCRF, to M.W.); and by support from the Cold Spring Harbor Laboratory and Northwell Health Affiliation (awarded to M.W.). Simons Foundation,519054,Breast Cancer Research Foundation Data availability Illumina sequencing data for all the single-nucleus libraries are available at NCBI Sequencing Read Archive (SRA) with accession code (PRJNA773107) [ 65 An end-to-end pipeline for converting BAG paired-end FASTQ files into gene-resolved read tables suitable for repertoire analysis and quality control is available at GitHub ( https://github.com/levycshl/bag-pipe 66 67 R scripts for downstream clustering, multinomial wheel analyses, and related analyses are available at GitHub ( https://github.com/siranli01/DNA_RNA 68 69 Declarations Ethics approval and consent to participate Women presenting to the Department of Obstetrics and Gynecology at the Long Island Jewish Medical Center (LIJMC) at Northwell Health with a clinical suspicion of ovarian or endometrial cancer (type I or type II) were prospectively enrolled between October 2018 and March 2021 as part of an ongoing study of endometrial and ovarian cancers. The hybrid BAG-seq method was applied to blood and tissue biopsies collected from five patients (P1–P5) who underwent total hysterectomy and bilateral salpingo-oophorectomy at LIJMC. All patients provided individual informed consent. The study (TAP#1805) was approved by the Northwell Health Biospecimen Repository Committee on Tissue Governance and Protocol Support. Demographic and clinical data related to uterine cancer diagnoses were collected and maintained in the Department of Obstetrics and Gynecology database at Northwell Health. All procedures were performed in accordance with the Declaration of Helsinki. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Lan F Demaree B Ahmed N Abate AR Single-cell genome sequencing at ultra-high-throughput with microfluidic droplet barcoding Nat Biotechnol 2017 35 7 640 646 10.1038/nbt.3880 28553940 PMC5531050 Lan F, Demaree B, Ahmed N, Abate AR. Single-cell genome sequencing at ultra-high-throughput with microfluidic droplet barcoding. Nat Biotechnol. 2017;35(7):640–6. 28553940 10.1038/nbt.3880 PMC5531050 2. Vitak SA Torkenczy KA Rosenkrantz JL Fields AJ Christiansen L Wong MH Sequencing thousands of single-cell genomes with combinatorial indexing Nat Methods 2017 14 3 302 308 10.1038/nmeth.4154 28135258 PMC5908213 Vitak SA, Torkenczy KA, Rosenkrantz JL, Fields AJ, Christiansen L, Wong MH, et al. Sequencing thousands of single-cell genomes with combinatorial indexing. Nat Methods. 2017;14(3):302–8. 28135258 10.1038/nmeth.4154 PMC5908213 3. Andor N, Lau BT, Catalanotti C, Sathe A, Kubit M, Chen J, et al. Joint single cell DNA-seq and RNA-seq of gastric cancer cell lines reveals rules of in vitro evolution. NAR genomics and bioinformatics. 2020;2(2):lqaa016. 10.1093/nargab/lqaa016 PMC7079336 32215369 4. Macosko EZ Basu A Satija R Nemesh J Shekhar K Goldman M Highly parallel genome-wide expression profiling of individual cells using nanoliter droplets Cell 2015 161 5 1202 1214 10.1016/j.cell.2015.05.002 26000488 PMC4481139 Macosko EZ, Basu A, Satija R, Nemesh J, Shekhar K, Goldman M, et al. Highly parallel genome-wide expression profiling of individual cells using nanoliter droplets. Cell. 2015;161(5):1202–14. 26000488 10.1016/j.cell.2015.05.002 PMC4481139 5. Klein AM Mazutis L Akartuna I Tallapragada N Veres A Li V Droplet barcoding for single-cell transcriptomics applied to embryonic stem cells Cell 2015 161 5 1187 1201 10.1016/j.cell.2015.04.044 26000487 PMC4441768 Klein AM, Mazutis L, Akartuna I, Tallapragada N, Veres A, Li V, et al. Droplet barcoding for single-cell transcriptomics applied to embryonic stem cells. Cell. 2015;161(5):1187–201. 26000487 10.1016/j.cell.2015.04.044 PMC4441768 6. Gierahn TM Wadsworth MH Hughes TK Bryson BD Butler A Satija R Seq-well: portable, low-cost RNA sequencing of single cells at high throughput Nat Methods 2017 14 4 395 398 10.1038/nmeth.4179 28192419 PMC5376227 Gierahn TM, Wadsworth MH, Hughes TK, Bryson BD, Butler A, Satija R, et al. Seq-well: portable, low-cost RNA sequencing of single cells at high throughput. Nat Methods. 2017;14(4):395–8. 28192419 10.1038/nmeth.4179 PMC5376227 7. Cao J Packer JS Ramani V Cusanovich DA Huynh C Daza R Comprehensive single-cell transcriptional profiling of a multicellular organism Science 2017 357 6352 661 667 10.1126/science.aam8940 28818938 PMC5894354 Cao J, Packer JS, Ramani V, Cusanovich DA, Huynh C, Daza R, et al. Comprehensive single-cell transcriptional profiling of a multicellular organism. Science. 2017;357(6352):661–7. 28818938 10.1126/science.aam8940 PMC5894354 8. Rosenberg AB Roco CM Muscat RA Kuchina A Sample P Yao Z Single-cell profiling of the developing mouse brain and spinal cord with split-pool barcoding Science 2018 360 6385 176 182 10.1126/science.aam8999 29545511 PMC7643870 Rosenberg AB, Roco CM, Muscat RA, Kuchina A, Sample P, Yao Z, et al. Single-cell profiling of the developing mouse brain and spinal cord with split-pool barcoding. Science. 2018;360(6385):176–82. 29545511 10.1126/science.aam8999 PMC7643870 9. Habib N Li Y Heidenreich M Swiech L Avraham-Davidi I Trombetta JJ Div-seq: single-nucleus RNA-seq reveals dynamics of rare adult newborn neurons Science 2016 353 6302 925 928 10.1126/science.aad7038 27471252 PMC5480621 Habib N, Li Y, Heidenreich M, Swiech L, Avraham-Davidi I, Trombetta JJ, et al. Div-seq: single-nucleus RNA-seq reveals dynamics of rare adult newborn neurons. Science. 2016;353(6302):925–8. 27471252 10.1126/science.aad7038 PMC5480621 10. Gao R Kim C Sei E Foukakis T Crosetto N Chan L-K Nanogrid single-nucleus RNA sequencing reveals phenotypic diversity in breast cancer Nat Commun 2017 8 1 1 12 10.1038/s41467-017-00244-w 28794488 PMC5550415 Gao R, Kim C, Sei E, Foukakis T, Crosetto N, Chan L-K, et al. Nanogrid single-nucleus RNA sequencing reveals phenotypic diversity in breast cancer. Nat Commun. 2017;8(1):1–12. 28794488 10.1038/s41467-017-00244-w PMC5550415 11. Zheng GX Terry JM Belgrader P Ryvkin P Bent ZW Wilson R Massively parallel digital transcriptional profiling of single cells Nat Commun 2017 8 1 1 12 10.1038/ncomms14049 28091601 PMC5241818 Zheng GX, Terry JM, Belgrader P, Ryvkin P, Bent ZW, Wilson R, et al. Massively parallel digital transcriptional profiling of single cells. Nat Commun. 2017;8(1):1–12. 28091601 10.1038/ncomms14049 PMC5241818 12. Dey SS Kester L Spanjaard B Bienko M Van Oudenaarden A Integrated genome and transcriptome sequencing of the same cell Nat Biotechnol 2015 33 3 285 9 10.1038/nbt.3129 25599178 PMC4374170 Dey SS, Kester L, Spanjaard B, Bienko M, Van Oudenaarden A. Integrated genome and transcriptome sequencing of the same cell. Nat Biotechnol. 2015;33(3):285–9. 25599178 10.1038/nbt.3129 PMC4374170 13. Macaulay IC Haerty W Kumar P Li YI Hu TX Teng MJ G&T-seq: parallel sequencing of single-cell genomes and transcriptomes Nat Methods 2015 12 6 519 522 10.1038/nmeth.3370 25915121 Macaulay IC, Haerty W, Kumar P, Li YI, Hu TX, Teng MJ, et al. G&T-seq: parallel sequencing of single-cell genomes and transcriptomes. Nat Methods. 2015;12(6):519–22. 25915121 10.1038/nmeth.3370 14. Han KY Kim K-T Joung J-G Son D-S Kim YJ Jo A SIDR: simultaneous isolation and parallel sequencing of genomic DNA and total RNA from single cells Genome Res 2018 28 1 75 87 10.1101/gr.223263.117 29208629 PMC5749184 Han KY, Kim K-T, Joung J-G, Son D-S, Kim YJ, Jo A, et al. SIDR: simultaneous isolation and parallel sequencing of genomic DNA and total RNA from single cells. Genome Res. 2018;28(1):75–87. 29208629 10.1101/gr.223263.117 PMC5749184 15. Hou Y Guo H Cao C Li X Hu B Zhu P Single-cell triple omics sequencing reveals genetic, epigenetic, and transcriptomic heterogeneity in hepatocellular carcinomas Cell Res 2016 26 3 304 319 10.1038/cr.2016.23 26902283 PMC4783472 Hou Y, Guo H, Cao C, Li X, Hu B, Zhu P, et al. Single-cell triple omics sequencing reveals genetic, epigenetic, and transcriptomic heterogeneity in hepatocellular carcinomas. Cell Res. 2016;26(3):304–19. 26902283 10.1038/cr.2016.23 PMC4783472 16. Bian S Hou Y Zhou X Li X Yong J Wang Y Single-cell multiomics sequencing and analyses of human colorectal cancer Science 2018 362 6418 1060 1063 10.1126/science.aao3791 30498128 Bian S, Hou Y, Zhou X, Li X, Yong J, Wang Y, et al. Single-cell multiomics sequencing and analyses of human colorectal cancer. Science. 2018;362(6418):1060–3. 30498128 10.1126/science.aao3791 17. Han L Zi X Garmire LX Wu Y Weissman SM Pan X Co-detection and sequencing of genes and transcripts from the same single cells facilitated by a microfluidics platform Sci Rep 2014 4 1 1 9 10.1038/srep06485 PMC4175731 25255798 Han L, Zi X, Garmire LX, Wu Y, Weissman SM, Pan X, et al. Co-detection and sequencing of genes and transcripts from the same single cells facilitated by a microfluidics platform. Sci Rep. 2014;4(1):1–9. 10.1038/srep06485 PMC4175731 25255798 18. Van Strijp D Vulders R Larsen N Schira J Baerlocher L Van Driel M Complete sequence-based pathway analysis by differential on-chip DNA and RNA extraction from a single cell Sci Rep 2017 7 1 1 9 28887473 10.1038/s41598-017-10704-4 PMC5591254 Van Strijp D, Vulders R, Larsen N, Schira J, Baerlocher L, Van Driel M, et al. Complete sequence-based pathway analysis by differential on-chip DNA and RNA extraction from a single cell. Sci Rep. 2017;7(1):1–9. 28887473 10.1038/s41598-017-10704-4 PMC5591254 19. Kong SL Li H Tai JA Courtois ET Poh HM Lau DP Concurrent single-cell RNA and targeted DNA sequencing on an automated platform for comeasurement of genomic and transcriptomic signatures Clin Chem 2019 65 2 272 81 10.1373/clinchem.2018.295717 30523199 Kong SL, Li H, Tai JA, Courtois ET, Poh HM, Lau DP, et al. Concurrent single-cell RNA and targeted DNA sequencing on an automated platform for comeasurement of genomic and transcriptomic signatures. Clin Chem. 2019;65(2):272–81. 30523199 10.1373/clinchem.2018.295717 20. Cheow LF Courtois ET Tan Y Viswanathan R Xing Q Tan RZ Single-cell multimodal profiling reveals cellular epigenetic heterogeneity Nat Methods 2016 13 10 833 836 10.1038/nmeth.3961 27525975 Cheow LF, Courtois ET, Tan Y, Viswanathan R, Xing Q, Tan RZ, et al. Single-cell multimodal profiling reveals cellular epigenetic heterogeneity. Nat Methods. 2016;13(10):833–6. 27525975 10.1038/nmeth.3961 21. Rodriguez-Meira A, Buck G, Clark S-A, Povinelli BJ, Alcolea V, Louka E, et al. Unravelling intratumoral heterogeneity through high-sensitivity single-cell mutational analysis and parallel RNA sequencing. Molecular cell. 2019;73(6):1292–305. e8. 10.1016/j.molcel.2019.01.009 PMC6436961 30765193 22. Li W Calder RB Mar JC Vijg J Single-cell transcriptogenomics reveals transcriptional exclusion of ENU-mutated alleles Mutation Research/Fundamental and Molecular Mechanisms of Mutagenesis 2015 772 55 62 10.1016/j.mrfmmm.2015.01.002 25733965 PMC4342853 Li W, Calder RB, Mar JC, Vijg J. Single-cell transcriptogenomics reveals transcriptional exclusion of ENU-mutated alleles. Mutation Research/Fundamental and Molecular Mechanisms of Mutagenesis. 2015;772:55–62. 25733965 10.1016/j.mrfmmm.2015.01.002 PMC4342853 23. Yu L Wang X Mu Q Tam SST Loi DSC Chan AK Scone-seq: a single-cell multi-omics method enables simultaneous dissection of phenotype and genotype heterogeneity from frozen tumors Sci Adv 2023 9 1 eabp8901 10.1126/sciadv.abp8901 36598983 PMC9812385 Yu L, Wang X, Mu Q, Tam SST, Loi DSC, Chan AK, et al. Scone-seq: a single-cell multi-omics method enables simultaneous dissection of phenotype and genotype heterogeneity from frozen tumors. Sci Adv. 2023;9(1):eabp8901. 36598983 10.1126/sciadv.abp8901 PMC9812385 24. Vandereyken K Sifrim A Thienpont B Voet T Methods and applications for single-cell and spatial multi-omics Nat Rev Genet 2023 24 8 494 515 10.1038/s41576-023-00580-2 36864178 PMC9979144 Vandereyken K, Sifrim A, Thienpont B, Voet T. Methods and applications for single-cell and spatial multi-omics. Nat Rev Genet. 2023;24(8):494–515. 36864178 10.1038/s41576-023-00580-2 PMC9979144 25. Gao R Bai S Henderson YC Lin Y Schalck A Yan Y Delineating copy number and clonal substructure in human tumors from single-cell transcriptomes Nat Biotechnol 2021 39 5 599 608 10.1038/s41587-020-00795-2 33462507 PMC8122019 Gao R, Bai S, Henderson YC, Lin Y, Schalck A, Yan Y, et al. Delineating copy number and clonal substructure in human tumors from single-cell transcriptomes. Nat Biotechnol. 2021;39(5):599–608. 33462507 10.1038/s41587-020-00795-2 PMC8122019 26. Fan J Lee H-O Lee S Ryu D-e Lee S Xue C Linking transcriptional and genetic tumor heterogeneity through allele analysis of single-cell RNA-seq data Genome Res 2018 28 8 1217 1227 10.1101/gr.228080.117 29898899 PMC6071640 Fan J, Lee H-O, Lee S, Ryu D-e, Lee S, Xue C, et al. Linking transcriptional and genetic tumor heterogeneity through allele analysis of single-cell RNA-seq data. Genome Res. 2018;28(8):1217–27. 29898899 10.1101/gr.228080.117 PMC6071640 27. Elyanow R Zeira R Land M Raphael BJ STARCH: copy number and clone inference from spatial transcriptomics data Phys Biol 2021 18 3 035001 10.1088/1478-3975/abbe99 33022659 PMC9876615 Elyanow R, Zeira R, Land M, Raphael BJ. STARCH: copy number and clone inference from spatial transcriptomics data. Phys Biol. 2021;18(3):035001. 33022659 10.1088/1478-3975/abbe99 PMC9876615 28. Patel AP Tirosh I Trombetta JJ Shalek AK Gillespie SM Wakimoto H Single-cell RNA-seq highlights intratumoral heterogeneity in primary glioblastoma Science 2014 344 6190 1396 1401 10.1126/science.1254257 24925914 PMC4123637 Patel AP, Tirosh I, Trombetta JJ, Shalek AK, Gillespie SM, Wakimoto H, et al. Single-cell RNA-seq highlights intratumoral heterogeneity in primary glioblastoma. Science. 2014;344(6190):1396–401. 24925914 10.1126/science.1254257 PMC4123637 29. Erickson A He M Berglund E Marklund M Mirzazadeh R Schultz N Spatially resolved clonal copy number alterations in benign and malignant tissue Nature 2022 608 7922 360 367 10.1038/s41586-022-05023-2 35948708 PMC9365699 Erickson A, He M, Berglund E, Marklund M, Mirzazadeh R, Schultz N, et al. Spatially resolved clonal copy number alterations in benign and malignant tissue. Nature. 2022;608(7922):360–7. 35948708 10.1038/s41586-022-05023-2 PMC9365699 30. Ronemus M Bradford D Laster Z Li S Exploring genome-transcriptome correlations in cancer Biochem Soc Trans 2025 53 01 113 120 10.1042/BST20240108 PMC12224911 39910794 Ronemus M, Bradford D, Laster Z, Li S. Exploring genome-transcriptome correlations in cancer. Biochem Soc Trans. 2025;53(01):113–20. 10.1042/BST20240108 PMC12224911 39910794 31. Yin Y, Jiang Y, Lam K-WG, Berletch JB, Disteche CM, Noble WS, et al. High-throughput single-cell sequencing with linear amplification. Molecular cell. 2019;76(4):676–90. e10. 10.1016/j.molcel.2019.08.002 PMC6874760 31495564 32. Olsen TR, Talla P, Sagatelian RK, Furnari J, Bruce JN, Canoll P, et al. Scalable co-sequencing of RNA and DNA from individual nuclei. Nat Methods. 2025;22(3):477–87. 10.1038/s41592-024-02579-x PMC12272635 39939719 33. Otoničar J Lazareva O Mallm J-P Simovic-Lorenz M Philippos G Sant P HIPSD&r-seq enables scalable genomic copy number and transcriptome profiling Genome Biol 2024 25 1 1 22 10.1186/s13059-024-03450-0 39696535 PMC11657747 Otoničar J, Lazareva O, Mallm J-P, Simovic-Lorenz M, Philippos G, Sant P, et al. HIPSD&r-seq enables scalable genomic copy number and transcriptome profiling. Genome Biol. 2024;25(1):1–22. 39696535 10.1186/s13059-024-03450-0 PMC11657747 34. Li Y Huang Z Xu L Fan Y Ping J Li G UDA-seq: universal droplet microfluidics-based combinatorial indexing for massive-scale multimodal single-cell sequencing Nat Methods. 2025 22 6 1199 1212 10.1038/s41592-024-02586-y 39833568 PMC12165859 Li Y, Huang Z, Xu L, Fan Y, Ping J, Li G, et al. UDA-seq: universal droplet microfluidics-based combinatorial indexing for massive-scale multimodal single-cell sequencing. Nat Methods. 2025;22(6):1199–212. 39833568 10.1038/s41592-024-02586-y PMC12165859 35. Li S Kendall J Park S Wang Z Alexander J Moffitt A Copolymerization of single-cell nucleic acids into balls of acrylamide gel Genome Res 2020 30 1 49 61 10.1101/gr.253047.119 31727682 PMC6961581 Li S, Kendall J, Park S, Wang Z, Alexander J, Moffitt A, et al. Copolymerization of single-cell nucleic acids into balls of acrylamide gel. Genome Res. 2020;30(1):49–61. 31727682 10.1101/gr.253047.119 PMC6961581 36. Van der Maaten L, Hinton G. Visualizing data using t-SNE. J Mach Learn Res. 2008;9(Nov):2579–605. 37. McInnes L, Healy J, Melville J. Umap: uniform manifold approximation and projection for dimension reduction. arXiv preprint arXiv:180203426. 2018. 38. Becht E McInnes L Healy J Dutertre C-A Kwok IW Ng LG Dimensionality reduction for visualizing single-cell data using UMAP Nat Biotechnol 2019 37 1 38 44 10.1038/nbt.4314 30531897 Becht E, McInnes L, Healy J, Dutertre C-A, Kwok IW, Ng LG, et al. Dimensionality reduction for visualizing single-cell data using UMAP. Nat Biotechnol. 2019;37(1):38–44. 10.1038/nbt.4314 30531897 39. Townes FW Hicks SC Aryee MJ Irizarry RA Feature selection and dimension reduction for single-cell RNA-seq based on a multinomial model Genome Biol 2019 20 1 16 10.1186/s13059-019-1861-6 31870412 PMC6927135 Townes FW, Hicks SC, Aryee MJ, Irizarry RA. Feature selection and dimension reduction for single-cell RNA-seq based on a multinomial model. Genome Biol. 2019;20:1–16. 31870412 10.1186/s13059-019-1861-6 PMC6927135 40. Chen KH Boettiger AN Moffitt JR Wang S Zhuang X Spatially resolved, highly multiplexed RNA profiling in single cells Science 2015 348 6233 aaa6090 10.1126/science.aaa6090 25858977 PMC4662681 Chen KH, Boettiger AN, Moffitt JR, Wang S, Zhuang X. Spatially resolved, highly multiplexed RNA profiling in single cells. Science. 2015;348(6233):aaa6090. 25858977 10.1126/science.aaa6090 PMC4662681 41. Janesick A Shelansky R Gottscho AD Wagner F Williams SR Rouault M High resolution mapping of the tumor microenvironment using integrated single-cell, spatial and in situ analysis Nat Commun 2023 14 1 8353 10.1038/s41467-023-43458-x 38114474 PMC10730913 Janesick A, Shelansky R, Gottscho AD, Wagner F, Williams SR, Rouault M, et al. High resolution mapping of the tumor microenvironment using integrated single-cell, spatial and in situ analysis. Nat Commun. 2023;14(1):8353. 38114474 10.1038/s41467-023-43458-x PMC10730913 42. Navin N Kendall J Troge J Andrews P Rodgers L McIndoo J Tumour evolution inferred by single-cell sequencing Nature 2011 472 7341 90 94 10.1038/nature09807 21399628 PMC4504184 Navin N, Kendall J, Troge J, Andrews P, Rodgers L, McIndoo J, et al. Tumour evolution inferred by single-cell sequencing. Nature. 2011;472(7341):90–4. 21399628 10.1038/nature09807 PMC4504184 43. Stuart T, Butler A, Hoffman P, Hafemeister C, Papalexi E, Mauck III WM, et al. Comprehensive integration of single-cell data. Cell. 2019;177(7):1888–902. e21. 10.1016/j.cell.2019.05.031 PMC6687398 31178118 44. Xi NM, Li JJ. Benchmarking computational doublet-detection methods for single-cell RNA sequencing data. Cell systems. 2021;12(2):176–94. e6. 10.1016/j.cels.2020.11.008 PMC7897250 33338399 45. Spatz A Borg C Feunteun J X-chromosome genetics and human cancer Nat Rev Cancer 2004 4 8 617 629 10.1038/nrc1413 15286741 Spatz A, Borg C, Feunteun J. X-chromosome genetics and human cancer. Nat Rev Cancer. 2004;4(8):617–29. 15286741 10.1038/nrc1413 46. Zhou Y, Bian S, Zhou X, Cui Y, Wang W, Wen L, et al. Single-cell multiomics sequencing reveals prevalent genomic alterations in tumor stromal cells of human colorectal cancer. Cancer cell. 2020;38(6):818–28. e5. 10.1016/j.ccell.2020.09.015 33096021 47. Machiela MJ Zhou W Karlins E Sampson JN Freedman ND Yang Q Female chromosome X mosaicism is age-related and preferentially affects the inactivated X chromosome Nat Commun 2016 7 1 11843 10.1038/ncomms11843 27291797 PMC4909985 Machiela MJ, Zhou W, Karlins E, Sampson JN, Freedman ND, Yang Q, et al. Female chromosome X mosaicism is age-related and preferentially affects the inactivated X chromosome. Nat Commun. 2016;7(1):11843. 27291797 10.1038/ncomms11843 PMC4909985 48. Liu A Genovese G Zhao Y Pirinen M Zekavat SM Kentistou KA Genetic drivers and cellular selection of female mosaic X chromosome loss Nature 2024 631 8019 134 141 10.1038/s41586-024-07533-7 38867047 Liu A, Genovese G, Zhao Y, Pirinen M, Zekavat SM, Kentistou KA, et al. Genetic drivers and cellular selection of female mosaic X chromosome loss. Nature. 2024;631(8019):134–41. 38867047 10.1038/s41586-024-07533-7 49. Panning B Dausman J Jaenisch R X chromosome inactivation is mediated by Xist RNA stabilization Cell 1997 90 5 907 916 10.1016/S0092-8674(00)80355-4 9298902 Panning B, Dausman J, Jaenisch R. X chromosome inactivation is mediated by Xist RNA stabilization. Cell. 1997;90(5):907–16. 9298902 10.1016/s0092-8674(00)80355-4 50. Weakley SM Wang H Yao Q Chen C Expression and function of a large non-coding RNA gene XIST in human cancer World J Surg 2011 35 1751 1756 10.1007/s00268-010-0951-0 21212949 PMC3275083 Weakley SM, Wang H, Yao Q, Chen C. Expression and function of a large non-coding RNA gene XIST in human cancer. World J Surg. 2011;35:1751–6. 21212949 10.1007/s00268-010-0951-0 PMC3275083 51. Huang K-C Rao PH Lau CC Heard E Ng S-K Brown C Relationship of XIST expression and responses of ovarian cancer to chemotherapy Mol Cancer Ther 2002 1 10 769 776 12492109 Huang K-C, Rao PH, Lau CC, Heard E, Ng S-K, Brown C, et al. Relationship of XIST expression and responses of ovarian cancer to chemotherapy. Mol Cancer Ther. 2002;1(10):769–76. 12492109 52. Bolotin DA Poslavsky S Mitrophanov I Shugay M Mamedov IZ Putintseva EV MiXCR: software for comprehensive adaptive immunity profiling Nat Methods 2015 12 5 380 381 10.1038/nmeth.3364 25924071 Bolotin DA, Poslavsky S, Mitrophanov I, Shugay M, Mamedov IZ, Putintseva EV, et al. MiXCR: software for comprehensive adaptive immunity profiling. Nat Methods. 2015;12(5):380–1. 25924071 10.1038/nmeth.3364 53. Segovia C Desrosiers V Khadangi F Robitaille K Armero VS D’Astous M A versatile and efficient method to isolate nuclei from low-input cryopreserved tissues for single-nuclei transcriptomics Sci Rep 2025 15 1 5581 10.1038/s41598-025-90070-8 39955438 PMC11829965 Segovia C, Desrosiers V, Khadangi F, Robitaille K, Armero VS, D’Astous M, et al. A versatile and efficient method to isolate nuclei from low-input cryopreserved tissues for single-nuclei transcriptomics. Sci Rep. 2025;15(1):5581. 39955438 10.1038/s41598-025-90070-8 PMC11829965 54. Nadelmann ER Gorham JM Reichart D Delaughter DM Wakimoto H Lindberg EL Isolation of nuclei from mammalian cells and tissues for single-nucleus molecular profiling Curr Protoc 2021 1 5 e132 10.1002/cpz1.132 34043278 PMC8191490 Nadelmann ER, Gorham JM, Reichart D, Delaughter DM, Wakimoto H, Lindberg EL, et al. Isolation of nuclei from mammalian cells and tissues for single-nucleus molecular profiling. Curr Protoc. 2021;1(5):e132. 34043278 10.1002/cpz1.132 PMC8191490 55. Slyper M Porter CB Ashenberg O Waldman J Drokhlyansky E Wakiro I A single-cell and single-nucleus RNA-seq toolbox for fresh and frozen human tumors Nat Med 2020 26 5 792 802 10.1038/s41591-020-0844-1 32405060 PMC7220853 Slyper M, Porter CB, Ashenberg O, Waldman J, Drokhlyansky E, Wakiro I, et al. A single-cell and single-nucleus RNA-seq toolbox for fresh and frozen human tumors. Nat Med. 2020;26(5):792–802. 32405060 10.1038/s41591-020-0844-1 PMC7220853 56. Masilionis I, Chaudhary O, Urben BM, Chaligne R. Nuclei extraction for 10x Genomics Single Cell Multiome ATAC+ Gene Expression from frozen tissue using Singulator™ 100 or 200 (S2 Genomics) V2. 0. 2023. 57. Krasnitz A Kendall J Alexander J Levy D Wigler M Early detection of cancer in blood using single-cell analysis: a proposal Trends Mol Med 2017 23 7 594 603 10.1016/j.molmed.2017.05.005 28587830 PMC5502711 Krasnitz A, Kendall J, Alexander J, Levy D, Wigler M. Early detection of cancer in blood using single-cell analysis: a proposal. Trends Mol Med. 2017;23(7):594–603. 28587830 10.1016/j.molmed.2017.05.005 PMC5502711 58. Nam AS Kim K-T Chaligne R Izzo F Ang C Taylor J Somatic mutations and cell identity linked by genotyping of transcriptomes Nature 2019 571 7765 355 360 10.1038/s41586-019-1367-0 31270458 PMC6782071 Nam AS, Kim K-T, Chaligne R, Izzo F, Ang C, Taylor J, et al. Somatic mutations and cell identity linked by genotyping of transcriptomes. Nature. 2019;571(7765):355–60. 31270458 10.1038/s41586-019-1367-0 PMC6782071 59. Penter L Borji M Nagler A Lyu H Lu WS Cieri N Integrative genotyping of cancer and immune phenotypes by long-read sequencing Nat Commun 2024 15 1 32 10.1038/s41467-023-44137-7 38167262 PMC10762175 Penter L, Borji M, Nagler A, Lyu H, Lu WS, Cieri N, et al. Integrative genotyping of cancer and immune phenotypes by long-read sequencing. Nat Commun. 2024;15(1):32. 38167262 10.1038/s41467-023-44137-7 PMC10762175 60. Lareau CA Ludwig LS Muus C Gohil SH Zhao T Chiang Z Massively parallel single-cell mitochondrial DNA genotyping and chromatin profiling Nat Biotechnol 2021 39 4 451 461 10.1038/s41587-020-0645-6 32788668 PMC7878580 Lareau CA, Ludwig LS, Muus C, Gohil SH, Zhao T, Chiang Z, et al. Massively parallel single-cell mitochondrial DNA genotyping and chromatin profiling. Nat Biotechnol. 2021;39(4):451–61. 32788668 10.1038/s41587-020-0645-6 PMC7878580 61. Lindenhofer D, Bauman JR, Hawkins JA, Fitzgerald D, Yildiz U, Marttinen JM, et al. Functional phenotyping of genomic variants using multiomic scDNA-scRNA-seq. bioRxiv. 2024:2024.05. 31.596895. 62. Bradford D, Li S. Hybrid BAG-Seq protocol for DNA-RNA co-assay. protocols.io. 2025. 63. Kim D Paggi JM Park C Bennett C Salzberg SL Graph-based genome alignment and genotyping with HISAT2 and HISAT-genotype Nat Biotechnol 2019 37 8 907 915 10.1038/s41587-019-0201-4 31375807 PMC7605509 Kim D, Paggi JM, Park C, Bennett C, Salzberg SL. Graph-based genome alignment and genotyping with HISAT2 and HISAT-genotype. Nat Biotechnol. 2019;37(8):907–15. 31375807 10.1038/s41587-019-0201-4 PMC7605509 64. Olshen AB Venkatraman E Lucito R Wigler M Circular binary segmentation for the analysis of array-based DNA copy number data Biostatistics 2004 5 4 557 572 10.1093/biostatistics/kxh008 15475419 Olshen AB, Venkatraman E, Lucito R, Wigler M. Circular binary segmentation for the analysis of array-based DNA copy number data. Biostatistics. 2004;5(4):557–72. 15475419 10.1093/biostatistics/kxh008 65. Li S. PRJNA773107. Datasets. Sequence Read Archive (SRA). 2021. https://www.ncbi.nlm.nih.gov/sra/?term=PRJNA773107 66. Levy D. levycshl/bag-pipe. GitHub. 2025. https://github.com/levycshl/bag-pipe 67. Levy D. levycshl/bag-pipe. 2025. Zenodo. 10.5281/zenodo.17048209. 68. Li S. siranli01/DNA_RNA. GitHub. 2025. https://github.com/siranli01/DNA_RNA 69. Li S, Hybrid BAG. R scripts Zenodo. 2025. 10.5281/zenodo.17051405. ",
  "metadata": {
    "Title of this paper": "Circular binary segmentation for the analysis of array-based DNA copy number data",
    "Journal it was published in:": "Genome Biology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476631/"
  }
}