{
  "title": "Paper_486",
  "abstract": "pmc Brain Behav Immun Health Brain Behav Immun Health 4098 bbih Brain, Behavior, & Immunity - Health 2666-3546 Elsevier PMC12482293 PMC12482293.1 12482293 12482293 41036088 10.1016/j.bbih.2025.101108 S2666-3546(25)00166-8 101108 1 Full Length Article Dysregulated miR-1246 and miR-1253 link inflammatory protein markers in plasma to major depressive disorder in female adolescents Johannessen Kristine a 1 Braný Dušan b 1 Dvorská Dana b Krivošová Michaela b Oppa Miloslav c Ondrejka Igor c Strnádel Ján b Ferencová Nikola b Tonhajzerová Ingrid c d Danková Zuzana b Halašová Erika b Mokrý Juraj e Elfving Betina betina.elfving@clin.au.dk a ⁎ a b c d e ⁎ betina.elfving@clin.au.dk 1 Contributed equally. 11 2025 16 9 2025 49 497567 101108 9 9 2025 13 9 2025 16 09 2025 01 10 2025 02 10 2025 © 2025 The Author(s) 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Major depressive disorder (MDD) in adolescents is a prevalent psychiatric condition worldwide with severe consequences. Growing evidence shows that microRNAs (miRNAs) regulate many processes hypothesized to be involved in the pathogenesis of MDD including inflammation, suggesting their suitability as biomarkers. Still, more research is needed regarding miRNAs as biomarkers and the role of inflammation in adolescents with MDD. This study applied the NanoString nCounter technology to identify dysregulated miRNAs in plasma from hospitalized female adolescents with MDD compared to healthy controls, as well as before and after antidepressant treatment. A multiplexed immunoassay was also performed to assess the plasma levels of 27 inflammatory proteins. A total of 33 patients and 14 healthy controls were included in the study. miR-1246 and miR-1253 were downregulated in female adolescents with MDD compared to healthy controls, suggesting their potential as diagnostic biomarkers. Additionally, miR-496 was downregulated with treatment, indicating its potential as a prognostic biomarker. Moreover, increased levels of PDGF-BB and IL-7 were seen in adolescents with MDD compared to healthy controls, while IL-9 and MIP-1β levels decreased with antidepressant treatment. Finally, the expression of specific miRNAs were found to correlate with the levels of several inflammatory proteins. In summary, miR-1246, miR-1253, and miR-496 are suggested as potential diagnostic and prognostic biomarkers. Furthermore, this study contributes in more detail to our understanding of miRNAs, inflammation, and MDD in female adolescents. Highlights • miRNA profiling and investigations of 27 inflammatory markers in adolescents with MDD. • miR-1246 and miR-1253 were identified as diagnostic biomarkers of MDD. • miR-496 was downregulated with treatment, indicating its potential as a prognostic biomarker. • PDGF-BB and IL-7 were increased in adolescents with MDD compared to healthy controls. Keywords microRNA Inflammation Female adolescents NanoString technology Biomarkers Major depressive disorder pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction Adolescence is a transitional period between childhood and adulthood, marked by major neurobiological development that begins with the onset of puberty ( Dumontheil, 2016 Thapar et al., 2012 GBD Compare Data Visualization, 2024 GBD Compare Data Visualization, 2024 A depressive period in adolescents usually lasts around 27 weeks ( Avenevoli et al., 2015 Mason et al., 2019 Keenan-Miller et al., 2007 Hasler et al., 2005 Haarasilta et al., 2004 Galaif et al., 2007 GBD Compare Data Visualization, 2024 Korczak and Goldstein, 2009 Bylund and Reed, 2007 Recently, circulating microRNAs (miRNAs) have been proposed as potential biomarkers of MDD and could serve as molecular tools to support diagnosis and prognosis in the future. miRNAs are short single-stranded non-coding RNAs, typically with a length of 19–25 nucleotides. They regulate post-transcriptional silencing of target genes, and a single miRNA can target several mRNAs, thereby influencing the expression of numerous genes ( Ding et al., 2023 Gilad et al., 2008 Zhou et al., 2021 Żurawek and Turecki, 2021 Ortega et al., 2021 To date, a few studies have identified specific dysregulated miRNAs in adolescents with MDD compared to healthy subjects ( Ran et al., 2022 Honorato-Mauer et al., 2023 Krivosova et al., 2023 Li et al., 2022 Gabbay et al., 2009 Peters et al., 2019 Lee et al., 2020a Amitai et al., 2016 Pérez-Sánchez et al., 2018 Lee et al., 2020b In a previous study, we have with a biased approach identified dysregulated miRNAs and protein levels of vascular endothelial growth factor (VEGF) in plasma from adolescents with MDD compared to healthy subjects ( Krivosova et al., 2023 2 Materials and methods 2.1 Population An overview of the patients and the controls are given in Tables S1 and S2 Table S1 Busner and Targum, 2007 The CGI-S scale measures the severity of a patient's mental illness by assessing observed and reported symptoms, behaviour, and daily functioning (the higher the score, the worse the symptoms). The average CGI-S at the hospital admission was 4.4 (3–7) and improved to 2.5 (1–4) at the hospital discharge. In the study, we also included a control group of 14 healthy adolescent volunteers (16–19 years old) with an average age of 17.2 ± 1.0 years old. The control group met the following inclusion criteria: no regular medication use, normal body weight (neither obese, overweight, nor underweight), no addictions to smoking, drugs, or alcohol, no chronic cardiovascular, respiratory, endocrine, neurological, or mental disorders, and no current infections. 2.2 Plasma blood samples Fasting blood samples were drawn from both patients and controls in the morning hours. In patients, the first blood sample was collected before antidepressant treatment initiation, the second at the end of the hospitalization. The blood samples were drawn into K2 EDTA tubes and centrifuged at 590× g Shah et al. (2016) 2.3 RNA extraction RNA was extracted from plasma samples using the commercial kit miRNeasy Serum/Plasma Advanced Kit (Qiagen, Germany). The extraction was done according to the distributor's description and stored at −80 °C until miRNA profiling. 2.4 miRNA profiling Profiling of the miRNA expression was performed using the NanoString nCounter SPRINT profiler (Bruker Spatial Biology, Inc, USA) and the Human v3b miRNA Panel detecting 827 miRNAs. The protocol was carried out using 3 μL of purified RNA according to the manufacturer's recommendations, except for a few modifications based on previous studies in the Elfving laboratorium. The modifications were to use a surplus of 5 % of the Hybridization Master Mix, the Capture Probe Set and of the miRNA sample prepared in the first part of the protocol. The samples were left to hybridize for 20h at 65 °C. Finally, 30 μL of the hybridized samples were loaded onto a plastic cartridge and analyzed on the nCounter SPRINT profiler. The raw output consisted of counts from each probe counted in the assay. The raw miRNA counts were analyzed using the NanoString nSolver 4.0 analysis software (Bruker Spatial Biology, Inc, USA). Quality Control (QC) parameters were set using settings as described in the “Gene Expression Data Analysis Guidelines” by NanoString ( NanoString Technologies, 2017 2.5 Normalization using different strategies The raw data were normalized in the nSolver 4.0 software using four different normalization methods in a two-step process. First, a “Positive Control Normalization” was carried out using positive control probes included in the kit which are spiked into every lane. Secondly, a “CodeSet Content Normalization” was performed using one of the following four methods. 1. The geometric mean of the best combination of the 2 most stably expressed miRNAs (miR-16-5p and miR-23a-3p) as identified by the NormFinder software (referred to as the “NF 2 genes” method). 2. The geometric mean of the 5 most stably expressed miRNAs (miR-23a-3p, miR-25-3p, miR-16-5p, let-7b-5p and miR-451a) as identified by the NormFinder software (referred to as the “NF 5 genes” method). 3. The geometric mean of the top 50 expressed miRNAs (referred to as the “Top 50” method). 4. The geometric mean of all miRNAs with counts above a set threshold. The threshold was set to be the mean + 1 standard deviation (SD) of the negative control probes included in the assay (referred to as the “Total miRNA” method). To adjust for background noise, a threshold was set using the mean + 1SD of the raw values of the negative control probes included in the assay. Only miRNAs where the average count across all samples were above this threshold, were used in the subsequent analyses. The stably expressed miRNAs were identified with NormFinder as described in “nCounter® miRNA Expression Analysis in Plasma and Serum Samples” by NanoString ( NanoString Technologies, 2019 2.6 The plasma protein levels of inflammatory markers Plasma samples from female adolescents with MDD before and after antidepressant treatment (n = 31), as well as healthy controls (n = 14) were used to measure the protein concentration of 27 inflammatory markers with a magnetic bead-based kit (Bio-Plex Pro™ Human Cytokine 27-Plex). The protein levels were quantified using the Luminex xMAP multiplexing technology and the Bio-Plex® 200 System (Bio-Rad Laboratories, Inc, USA). The analysis was carried out according to the manufacturer's description. A standard curve in duplicate was included on the plate. The plasma samples were diluted 1:4 and assessed in singlets. Using a Logistic-5PL regression, the observed concentration of each analyte was calculated in the individual samples. The data were exported to Microsoft Excel (Microsoft Corporation, USA) for further analyses. 2.7 Statistical analyses The fold change (FC) of miRNA expression was computed in nSolver using log-transformed, normalized miRNA counts. When investigating data from patients compared to controls, a two-tailed Welch's t t The statistical analyses of the protein data were performed in GraphPad Prism 10.3.1 and included Shapiro-Wilk test of normality. Based on the test of normality for each protein marker, either the non-parametric Wilcoxon rank sum test or unpaired t t Furthermore, a non-parametric Spearman's rank correlation coefficient was calculated between the count values of normalized miRNA expression and the level of inflammatory cytokines in patients before treatment. The miRNA count values used in the matrix were normalized with the NF 5 genes method, as this was the normalization method preferred by NanoString. Correlations were calculated between the 4 inflammatory cytokines found to be dysregulated and all 9 miRNAs identified as dysregulated with the NF 5 genes method. Additionally, the protein levels of IFN-y, TNF-α, IL-1β, IL-6 and VEGF were included in the matrix due to their hypothesized role in MDD, even though they were not dysregulated in this study. Generally, a p-value <0.05 was considered statistically significant, and correction for multiple comparisons was not performed for any analyses considering the analyses are hypothesis-generating. 2.8 Bioinformatic analyses Bioinformatic analyses were carried out using the online tools miRTargetLink 2.0 ( Kern et al., 2021 Szklarczyk et al., 2020 3 Results 3.1 miR-1246 and miR-1253 were found to be decreased in adolescents with MDD compared to healthy controls across different normalization methods Two miRNAs (miR-1246 and miR-1253) were significantly downregulated in patients compared to controls when normalizing with all four normalization procedures. A few miRNAs (miR-146a-5p, miR-15b-5p, miR-223-3p) were significantly downregulated and a single miRNA, miR-451a, were significantly upregulated in patients compared to controls only when normalizing with either of the NormFinder methods. Similarly, a few miRNAs (miR-378f, miR-378i, miR-548ar-5p) were significantly downregulated in patients compared to controls only when normalizing with either of the “Targets above background” methods ( Table 1 Table 1 Dysregulated miRNA expression in female adolescents with MDD before antidepressant treatment compared to healthy controls, identified with either the NF 5 or 2 genes method, Top 50, or Total miRNA. Data are presented as Log2 FC, p-value. Table 1 Normalization method NormFinder Targets above background Dysregulated miRNA NF 5 genes NF 2 genes Top 50 Total miRNA miR-1246 −1.17, p = 0.0145 −1.11, p = 0.0136 −0.76, p = 0.0074 −0.76, p = 0.0099 miR-1253 −1.1, p = 0.0464 −1.05, p = 0.0506 −0.69, p = 0.0036 −0.69, p = 0.0008 miR-146a-5p −0.68, p = 0.0385 −0.62, p = 0.0256 miR-15b-5p −0.56, p = 0.0326 miR-223-3p −1.01, p = 0.0228 −0.96, p = 0.0204 miR-378f −0.45, p = 0.0267 −0.45, p = 0.0078 miR-378i −0.43, p = 0.0370 miR-451a 0.72, p = 0.0385 miR-548ar-5p −0.45, p = 0.0178 A Spearman correlation between the expression of miR-1246 and miR-1253 and CGI-S did not reveal significant results; miR-1246: r = 0.1, p = 0.7147 and miR-1253: r = 0.2, p = 0.3664, respectively. 3.2 miR-496 was identified as increased with antidepressant treatment across the different normalization methods In patients before and after treatment, a single miRNA (miR-496) was identified as significantly increased with treatment when normalizing with either of the four different normalization methods. Furthermore, miR-106a-5p + miR-17-5p (measured by a probe targeting both miRNAs) was found to decrease with antidepressant treatment only when normalizing with either the NF 2 genes or Top 50 method. A single miRNA (miR-150-5p) was found to decrease with antidepressant treatment with either of the NormFinder normalization methods, whereas a decrease in two miRNAs (miR-144-3p and miR-16-5p) were identified only when normalizing with the NF 5 genes method. When normalizing with either the Total miRNA or Top 50 method, miR-1253 and miR-203a-5p were found to respectively increase and decrease with antidepressant treatment ( Table 2 Table 2 Dysregulated miRNA expression in female adolescents with MDD before antidepressant treatment compared to after antidepressant treatment, identified with either the NF 5 or 2 genes method, Top 50, or Total miRNA. Data are presented as Log2 FC, p-value. Table 2 Normalization method NormFinder Targets above background Dysregulated miRNA NF 5 genes NF 2 genes Top 50 Total miRNA miR-106a-5p + miR-17-5p a −0.39, p = 0.0425 −0.38, p = 0.0288 miR-1253 0.25, p = 0.0468 0.27, p = 0.0255 miR-144-3p 0.49, p = 0.0480 miR-150-5p −0.24, p = 0.0168 −0.29, p = 0.0174 miR-16-5p 0.24, p = 0.0373 miR-203a-5p −0.31, p = 0.0206 −0.28, p = 0.0144 miR-496 0.51, p = 0.0396 0.47, p = 0.0361 0.49, p = 0.0016 0.51, p = 0.0015 a Unspecific probe for both miRNAs. A Spearman correlation between the expression of miR-496 and CGI-S was not significant (r = 0.2, p = 0.2429). 3.3 Protein levels of PDGF-BB and IL-7 were increased in female adolescents with MDD compared to healthy controls A screening panel of 27 cytokines and chemokines was used to investigate the role of inflammation. The levels of IL-5 and IL-10 were below the detection limit for all samples, and the levels of IL-6, IL-7, IL-15, and VEGF, were below detection limit for only some of the samples. Additionally, a single patient exhibited extreme outlier values based on visual inspection and was excluded from further analysis. An overview of the concentration and p-values of all 27 inflammatory markers can be found in Table S3 and Table S4 Out of the 27 inflammatory markers measured, only two markers were dysregulated in female adolescents with MDD compared to healthy controls. The results revealed that the plasma protein concentration of platelet-derived growth factor, two B subunits (PDGF-BB; Controls: 113.50 pg/ml, Patients: 182.34 pg/ml, p = 0.0066) and IL-7 (Controls: 44.70 pg/ml, Patients: 169.59 pg/ml, p = 0.0002) were significantly increased in female adolescents with MDD compared to healthy controls ( Fig. 1 Fig. 1 Plasma protein concentrations of significantly increased inflammatory markers PDGF-BB (a) and IL-7 (b) in female adolescents with MDD before treatment compared to healthy controls, and of reduced inflammatory markers IL-9 (c) and MIP-1β (d) in female adolescents with MDD before and after antidepressant treatment. The number included from each group is given on the graph. Data are presented as mean ± SD. ∗p < 0.05, ∗∗p < 0.01, ∗∗∗p < 0.001. Fig. 1 3.4 The levels of IL-9 and MIP-1β were reduced following antidepressant treatment in female adolescent patients with MDD The levels of IL-9 and MIP-1β were significantly reduced after antidepressant treatment in plasma from female adolescents with MDD (IL-9 - Before: 477.18 pg/ml, After: 453.11 pg/ml, p = 0.0293; MIP-1β - Before: 310.71 pg/ml, After: 288.46 pg/ml, p = 0.0106), respectively ( Fig. 1 Table S4 3.5 Correlations between miRNAs and inflammatory markers in plasma from female adolescents with MDD Spearman correlations were calculated to assess the association between the expression of the dysregulated miRNAs and inflammatory markers in patients before treatment. The results revealed that the levels of PDGF-BB were positively correlated with miR-1253 (r = 0.4, p = 0.0392) and miR-496 (r = 0.5, p = 0.0225). Furthermore, the levels of IL-9 were positively correlated with miR-150-5p and negatively correlated with miR-223-3p ( Table 3 Table 3 Spearman correlations between dysregulated cytokines and miRNA expression in female patients with MDD before treatment. Spearman's r Table 3 Additionally, we investigated correlations between the dysregulated miRNAs and other inflammatory markers implied to play a role in depression but not dysregulated in the current study such as IFN-y, TNF-α, IL-1β, IL-6 and VEGF. Interestingly, these results showed that the levels of IFN-y were positively correlated with miR-1246, miR-1253, miR-144-3p, miR-150-5p, and miR-496, and negatively correlated with miR-223-3p. The levels of TNF-α were positively correlated with miR-144-3p and negatively correlated with miR-223-3p. Furthermore, the levels of IL-6 were positively correlated with miR-1253, miR-146a-5p, miR-150-5p, and miR-496, and negatively correlated with miR-451a. Finally, the levels of VEGF were negatively correlated with miR-223-3p ( Table 4 Table 4 Spearman correlations between dysregulated miRNA expression and cytokines hypothesized to be related to MDD in female patients with MDD before treatment. Spearman's r Table 4 3.6 Bioinformatic analyses Using the miRTargetlink 2.0 tool, we identified mRNA targets for miR-1253 and miR-1246, which were shown to be downregulated in MDD patients compared to controls across all normalization methods, and miR-496, whose changes in expression were associated with treatment response. For miR-1246, five mRNA targets were identified ( NFIB AXIN2 PRKAR1A GSK3B DYRK1A BTK (MTOR) Table S5 Tables S6–S9 4 Discussion The main finding of the present study is a dysregulation of miR-1246 and miR-1253 in plasma from female adolescents with MDD compared to healthy controls, suggesting their potential as diagnostic biomarkers. Additionally, miR-496 was regulated after antidepressant treatment, indicating its potential as a predictive biomarker. Furthermore, elevated levels of PDGF-BB and IL-7 were observed in patients versus controls, while levels of IL-9 and MIP-1β decreased with treatment. miR-1246 and miR-1253 were identified as significantly downregulated in plasma from female adolescents with depression compared to healthy control when normalizing with all four normalization procedures. Both miRNAs have been suggested as diagnostic biomarkers for various types of cancer ( Moshiri et al., 2018 Hindle et al., 2019 Shimomura et al., 2016 Kavoosi et al., 2024 Weinberg et al., 2015 Barnett et al., 2023 Table S5 Jope, 2011 Duda et al., 2020 Gruber et al., 2024 Li et al., 2021 miR-496 was identified as significantly increased with antidepressant treatment when normalizing with each of the four different normalization methods and could possibly be used to monitor an antidepressant response in female adolescents with MDD. This finding is supported by a previous study where miR-496 was found to be downregulated in the prefrontal cortex of adult suicide completers with MDD ( Smalheiser et al., 2012 Winter 2015 Rubie et al., 2016 Chen et al. (2024) Liu et al., 2015 Zhou et al., 2014 Hwang et al., 2021 The literature suggests an association between depression and inflammatory markers in adolescents ( Gabbay et al., 2009 Annam et al., 2024 Dahl et al., 2014 Smyth et al., 2022 Carestia et al., 2023 Lv et al., 2023 Barata et al., 2019 Chen et al., 2021 Meyer et al., 2022 Szekanecz and Koch, 2007 Takata et al., 2021 Yang et al., 2019 Another interesting finding is that IL-9 and MIP-1β were reduced with antidepressant treatment. The cytokine IL-9 is produced by a range of immune cells, including mast cells, natural killer T cells, a range of T-helper (Th) cells (Th2, Th17 and Th9), and plays a role in Th1/Th17 mediated inflammation ( Noelle and Nowak, 2010 Maghazachi, 2010 Gao et al., 2022 Kofod et al., 2022 Becerril-Villanueva et al., 2019 We conducted Spearman correlation analyses to explore the potential relationship between specific inflammatory markers and dysregulated miRNAs. These analyses revealed several significant associations, supporting the hypothesis that the identified miRNAs may regulate targets linked to inflammatory markers. We identified positive correlations between miR-1246 and IFN-γ, as well as between miR-1253 and PDGF-BB, IFN-γ, and IL-6. Furthermore, we identified a positive correlation with miR-496 and the levels of PDGF-BB, IFN-γ, and IL-6 in patients before antidepressant treatment. Additionally, several miRNAs were associated with inflammatory markers previously associated with MDD, including IFN-γ, IL-6, and TNF-α. Although these proteins were not altered in the current study, it is an interesting association which could be investigated further in a later study. Based on the results from this study, one could speculate that the target genes of the regulated miRNAs are related to inflammatory signaling and the PDGF signaling pathway. Both miR-150-5p and miR-223-3p target multiple components of the IL-9 signaling pathways, including key transcription factors such as STAT1, STAT3, and STAT5A/B, which are known to mediate inflammatory responses and cell proliferation. Furthermore a study by Wu et al. found that a down-regulation of miR-223-3p resulted in the activation of STAT3 and the promotion of pro-inflammatory cytokines ( Wu et al., 2019 Malik et al., 2017 Finally, we performed STRING analyses to investigate whether changes in the expression of the regulated miRNAs could influence biological processes affecting the levels of the regulated cytokines. Given that 1) the levels of IL-9 were positively correlated with miR-150-5p and negatively correlated with miR-223-3p expression, and 2) the levels of PDGF-BB were positively correlated with miR-1253 and miR-496 expression levels, we primarily focused on whether there may be alterations in 1) processes affecting cells producing IL-9 – especially the differentiation of CD4 + Andrae et al., 2008 Plikus et al., 2021 Regarding IL-9, we found that the protein products translated from the mRNA targets of mir-150-5p were included in IL-9 signalling (HSA-8985947) and JAK-STAT signalling pathway (hsa04630). Furthermore, we found they were involved in networks associated with lymphocyte production and differentiation, which may alter the levels of IL-9 through the formation of CD4 + Table S6 Table S7 As for PDGF-BB, we found that the protein product of BTK, which was identified as mRNA target of miR-1253, was involved in several networks possibly altering the levels of PDGF-BB. These networks included: Mast cell degranulation (GO:0043303; GO:0043304), Mast cell activation (GO:045576), Positive regulation of macrophage cytokine production (GO:0060907), Platelet activation ( GO:0030168 GO:0090330 Table S8 Table S9 Normalization of miRNA data is essential to address pre-analytical variations and differences introduced during RNA extraction or the NanoString assay, ensuring reliable interpretation of the data. Literature suggests that results from NanoString assays are influenced by the normalization method applied ( Adamova et al., 2024 Chilimoniuk et al., 2024 Table 1 Table 2 Kolshus et al., 2017 van der Zee et al., 2022 Foley et al., 2023 Kim et al., 2019 Camkurt et al., 2015 Mizohata et al., 2021 Camkurt et al., 2015 Hu et al., 2024 Smalheiser et al., 2012 Camkurt et al., 2015 Valiuliene et al., 2023 Brás et al., 2023 Kaurani et al., 2023 Fan et al., 2020 Rusca and Monticelli, 2011 Long et al., 2020 Ding et al., 2018 This study has several limitations that should be considered. First, the variety of antidepressants prescribed to the patients is a limitation. However, due to the naturalistic of the study, there were not enough patients in each group to analyze each treatment arm separately. Second, the short treatment period is another limitation. A follow-up timepoint could be included in future studies to investigate how the expression of the miRNAs and the levels of inflammatory markers are altered over time following treatment with antidepressants. Third, while the NanoString nCounter technology is a robust method for miRNA quantification, it is limited by a lack of consensus on how to normalize the data. Finally, the study focused only on female adolescents, as females were most represented in the clinic due to the higher prevalence. Yet, this limits the applicability of these findings to males and excludes the investigations of potential sex-based differences in the regulation of miRNA and inflammatory markers in adolescents with MDD. In addition, the exploratory nature of this study highlighted specific miRNAs that warrant validation in larger, independent cohorts. Future studies with larger cohorts and treatment arms, as well as longitudinal designs are needed to address these limitations and build upon the findings of this study. 5 Conclusion In summary, the study suggests that miR-1246 and miR-1253 could serve as potential biomarkers for diagnosing MDD, whereas miR-496 could be used to monitor an antidepressant response. Additionally, the downregulation of inflammatory-related miRNAs, increased levels of inflammatory markers, and the correlation between the two contribute to the hypothesis of increased inflammation in adolescent patients with MDD. While further research is needed to investigate the mechanisms linking miRNAs to inflammatory proteins in MDD, the current findings highlight the potential of specific miRNAs as biomarkers and contribute to our understanding of miRNAs, inflammation, and MDD in female adolescents. CRediT authorship contribution statement Kristine Johannessen: Dušan Braný: Dana Dvorská: Michaela Krivošová: Miloslav Oppa: Igor Ondrejka: Ján Strnádel: Nikola Ferencová: Ingrid Tonhajzerová: Zuzana Danková: Erika Halašová: Juraj Mokrý: Betina Elfving: Ethics statement The study was approved by the Ethical Committee of Jessenius Faculty of Medicine in Martin, Comenius University in Bratislava (EK 1983/2017 and EK 84/2021) and the included patients, their legal guardians, and controls gave a written informed consent. Declaration of generative AI and AI-assisted Technologies in the Writing process Nothing to disclose. Funding This work was supported by the Scientific Grant Agency of the Ministry of Education Declaration of competing interest Our paper represents unique original material and is not considered for publication elsewhere. The authors have no competing interests, and all have approved the manuscript. References Adamova P. Powell A.K. Dykes I.M. Assessment of NanoString technology as a tool for profiling circulating miRNA in maternal blood during pregnancy Extracellular Vesicles and Circulating Nucleic Acids 5 2024 471 496 39697629 10.20517/evcna.2024.38 PMC11648433 Amitai M. The relationship between plasma cytokine levels and response to selective serotonin reuptake inhibitor treatment in children and adolescents with depression and/or anxiety disorders J. Child Adolesc. Psychopharmacol. 26 2016 727 732 10.1089/cap.2015.0147 26771135 Andrae J. Gallini R. Betsholtz C. Role of platelet-derived growth factors in physiology and medicine Genes Dev. 22 2008 1276 1312 10.1101/gad.1653708 18483217 PMC2732412 Annam J. Plasma cytokine and growth factor response to acute psychosocial stress in major depressive disorder J. Psychiatr. Res. 169 2024 224 230 10.1016/j.jpsychires.2023.11.029 38043258 Avenevoli S. Swendsen J. He J.P. Burstein M. Merikangas K.R. Major depression in the national comorbidity survey-adolescent supplement: prevalence, correlates, and treatment J. Am. Acad. Child Adolesc. Psychiatry 54 2015 37 44.e32 10.1016/j.jaac.2014.10.010 25524788 PMC4408277 Barata J.T. Durum S.K. Seddon B. Flip the coin: IL-7 and IL-7R in health and disease Nat. Immunol. 20 2019 1584 1593 10.1038/s41590-019-0479-x 31745336 Barnett M.M. miRNA cargo in circulating vesicles from neurons is altered in individuals with schizophrenia and associated with severe disease Sci. Adv. 9 2023 eadi4386 10.1126/sciadv.adi4386 PMC10686555 38019909 Becerril-Villanueva E. Alterations in the levels of growth factors in adolescents with major depressive disorder: a longitudinal study during the treatment with fluoxetine Mediat. Inflamm. 2019 2019 9130868 10.1155/2019/9130868 PMC6885844 31827384 Brás J.P. Combining inflammatory miRNA molecules as diagnostic biomarkers for depression: a clinical study Front. Psychiatr. 14 2023 1227618 10.3389/fpsyt.2023.1227618 PMC10413105 37575572 Busner J. Targum S.D. The clinical global impressions scale: applying a research tool in clinical practice Psychiatry (Edgmont) 4 2007 28 37 PMC2880930 20526405 Bylund D.B. Reed A.L. Childhood and adolescent depression: why do children and adults respond differently to antidepressant drugs? Neurochem. Int. 51 2007 246 253 10.1016/j.neuint.2007.06.025 17664028 PMC2694752 Camkurt M.A. Comparison of plasma MicroRNA levels in drug naive, first episode depressed patients and healthy controls J. Psychiatr. Res. 69 2015 67 71 10.1016/j.jpsychires.2015.07.023 26343596 Carestia A. Godin L.C. Jenne C.N. Step up to the platelet: role of platelets in inflammation and infection Thromb. Res. 231 2023 182 194 10.1016/j.thromres.2022.10.001 36307228 Chen D. Tang T.X. Deng H. Yang X.P. Tang Z.H. Interleukin-7 biology and its effects on immune cells: mediator of generation, differentiation, survival, and homeostasis Front. Immunol. 12 2021 747324 10.3389/fimmu.2021.747324 PMC8674869 34925323 Chen Y. Guan W. Wang M.-L. Lin X.-Y. PI3K-AKT/mTOR signaling in psychiatric disorders: a valuable target to stimulate or suppress? Int. J. Neuropsychopharmacol. 27 2024 10.1093/ijnp/pyae010 PMC10888523 38365306 Chilimoniuk J. Erol A. Rödiger S. Burdukiewicz M. Challenges and opportunities in processing NanoString nCounter data Comput. Struct. Biotechnol. J. 23 2024 1951 1958 10.1016/j.csbj.2024.04.061 38736697 PMC11087919 Dahl J. The plasma levels of various cytokines are increased during ongoing depression and are reduced to normal levels after recovery Psychoneuroendocrinology 45 2014 77 86 10.1016/j.psyneuen.2014.03.019 24845179 Ding Q. MiR-223-3p overexpression inhibits cell proliferation and migration by regulating inflammation-associated cytokines in glioblastomas Pathol. Res. Pract. 214 2018 1330 1339 10.1016/j.prp.2018.05.012 30033329 Ding R. The role of microRNAs in depression Front. Pharmacol. 14 2023 1129186 10.3389/fphar.2023.1129186 PMC10090555 37063278 Duda P. Hajka D. Wójcicka O. Rakus D. Gizak A. GSK3β: a master player in depressive disorder pathogenesis and treatment responsiveness Cells 9 2020 10.3390/cells9030727 PMC7140610 32188010 Dumontheil I. Adolescent brain development Current Opinion in Behavioral Sciences 10 2016 39 44 10.1016/j.cobeha.2016.04.012 Fan W. MicroRNA-146a is a wide-reaching neuroinflammatory regulator and potential treatment target in neurological diseases Front. Mol. Neurosci. 13 2020 90 10.3389/fnmol.2020.00090 32581706 PMC7291868 Foley H.B. Depression, perceived stress, and distress during pregnancy and EV-associated miRNA profiles in MADRES J. Affect. Disord. 323 2023 799 808 10.1016/j.jad.2022.12.039 36563790 PMC9844263 Gabbay V. Immune system dysregulation in adolescent major depressive disorder J. Affect. Disord. 115 2009 177 182 10.1016/j.jad.2008.07.022 18790541 PMC2770721 Galaif E.R. Sussman S. Newcomb M.D. Locke T.F. Suicidality, depression, and alcohol use among adolescents: a review of empirical findings Int. J. Adolesc. Med. Health 19 2007 27 35 10.1515/ijamh.2007.19.1.27 17458321 PMC3134404 Gao W. Serum CC chemokines as potential biomarkers for the diagnosis of major depressive disorder Psychol. Res. Behav. Manag. 15 2022 2971 2978 10.2147/PRBM.S384267 36310625 PMC9604417 GBD compare data visualization https://vizhub.healthdata.org/gbd-compare 2024 Gilad S. Serum microRNAs are promising novel biomarkers PLoS One 3 2008 e3148 10.1371/journal.pone.0003148 PMC2519789 18773077 Gruber R.C. BTK regulates microglial function and neuroinflammation in human stem cell models and mouse models of multiple sclerosis Nat. Commun. 15 2024 10116 10.1038/s41467-024-54430-8 PMC11584639 39578444 Haarasilta L.M. Marttunen M.J. Kaprio J.A. Aro H.M. Correlates of depression in a representative nationwide sample of adolescents (15-19 years) and young adults (20-24 years) Eur. J. Publ. Health 14 2004 280 285 10.1093/eurpub/14.3.280 15369034 Hasler G. Depressive symptoms during childhood and adult obesity: the Zurich cohort study Mol. Psychiatr. 10 2005 842 850 10.1038/sj.mp.4001671 15838533 Hindle A.G. Identification of candidate miRNA biomarkers for glaucoma Investig. Ophthalmol. Vis. Sci. 60 2019 134 146 10.1167/iovs.18-24878 30629727 PMC6329203 Honorato-Mauer J. Alterations in microRNA of extracellular vesicles associated with major depression, attention-deficit/hyperactivity and anxiety disorders in adolescents Transl. Psychiatry 13 2023 47 10.1038/s41398-023-02326-4 36746925 PMC9902559 Hu P. MicroRNA-451a is a candidate biomarker and therapeutic target for major depressive disorder Gen. Psychiatry 37 2024 e101291 10.1136/gpsych-2023-101291 PMC10831421 38304710 Hwang H.-Y. Shim J.S. Kim D. Kwon H.J. Antidepressant drug sertraline modulates AMPK-MTOR signaling-mediated autophagy via targeting mitochondrial VDAC1 protein Autophagy 17 2021 2783 2799 10.1080/15548627.2020.1841953 33124469 PMC8525979 Jope R.S. Glycogen synthase Kinase-3 in the etiology and treatment of mood disorders Front. Mol. Neurosci. 4 2011 2011 10.3389/fnmol.2011.00016 PMC3152743 21886606 Kaurani L. Baseline levels of miR-223-3p correlate with the effectiveness of electroconvulsive therapy in patients with major depression Transl. Psychiatry 13 2023 294 10.1038/s41398-023-02582-4 37699900 PMC10497550 Kavoosi S. Shahraki A. Sheervalilou R. Identification of microRNA-mRNA regulatory networks with therapeutic values in alzheimer's disease by bioinformatics analysis J. Alzheim. Dis. 98 2024 671 689 10.3233/JAD-230966 38427479 Keenan-Miller D. Hammen C.L. Brennan P.A. Health outcomes related to early adolescent depression J. Adolesc. Health 41 2007 256 262 10.1016/j.jadohealth.2007.03.015 17707295 PMC2034364 Kern F. miRTargetLink 2.0—interactive miRNA target gene and target pathway networks Nucleic Acids Res. 49 2021 W409 W416 10.1093/nar/gkab297 34009375 PMC8262750 Kim H.K. Plasma microRNA expression levels and their targeted pathways in patients with major depressive disorder who are responsive to duloxetine treatment J. Psychiatr. Res. 110 2019 38 44 10.1016/j.jpsychires.2018.12.007 30580082 Kofod J. Elfving B. Nielsen E.H. Mors O. Köhler-Forsberg O. Depression and inflammation: correlation between changes in inflammatory markers with antidepressant response and long-term prognosis Eur. Neuropsychopharmacol. 54 2022 116 125 10.1016/j.euroneuro.2021.09.006 34598835 Kolshus E. Peripheral blood microRNA and VEGFA mRNA changes following electroconvulsive therapy: implications for psychotic depression Acta Psychiatr. Scand. 136 2017 594 606 10.1111/acps.12821 28975998 Korczak D.J. Goldstein B.I. Childhood onset major depressive disorder: course of illness and psychiatric comorbidity in a community sample J. Pediatr. 155 2009 118 123 10.1016/j.jpeds.2009.01.061 19394039 Krivosova M. The VEGF protein levels, miR-101-3p, and miR-122-5p are dysregulated in plasma from adolescents with major depression J. Affect. Disord. 334 2023 60 68 10.1016/j.jad.2023.04.094 37127118 Lee H. Song M. Lee J. Kim J.B. Lee M.S. Prospective study on cytokine levels in medication-naïve adolescents with first-episode major depressive disorder J. Affect. Disord. 266 2020 57 62 10.1016/j.jad.2020.01.125 32056928 Lee H. Song M. Lee J. Kim J.-B. Lee M.-S. Prospective study on cytokine levels in medication-naïve adolescents with first-episode major depressive disorder J. Affect. Disord. 266 2020 57 62 10.1016/j.jad.2020.01.125 32056928 Li W. Ibrutinib alleviates LPS-Induced neuroinflammation and synaptic defects in a mouse model of depression Brain Behav. Immun. 92 2021 10 24 10.1016/j.bbi.2020.11.008 33181270 Li Y. Childhood trauma and the plasma levels of IL-6, TNF-α are risk factors for major depressive disorder and schizophrenia in adolescents: a cross-sectional and case-control study J. Affect. Disord. 305 2022 227 232 10.1016/j.jad.2022.02.020 35151670 Liu X.-L. Fluoxetine regulates mTOR signalling in a region-dependent manner in depression-like mice Sci. Rep. 5 2015 16024 10.1038/srep16024 PMC4629199 26522512 Long F.-q. Kou C.-x. Li K. Wu J. Wang Q.-q. MiR-223-3p inhibits rTp17-induced inflammasome activation and pyroptosis by targeting NLRP3 J. Cell Mol. Med. 24 2020 14405 14414 10.1111/jcmm.16061 33145937 PMC7754033 Lv W. Jiang X. Zhang Y. The role of platelets in the blood-brain barrier during brain pathology Front. Cell. Neurosci. 17 2023 1298314 10.3389/fncel.2023.1298314 PMC10800710 38259501 Maghazachi A.A. The Chemokine System in Experimental and Clinical Hematology 2010 Springer Berlin Heidelberg 37 58 Malik S. Transcription factor Foxo1 is essential for IL-9 induction in T helper cells Nat. Commun. 8 2017 815 10.1038/s41467-017-00674-6 28993609 PMC5634439 Mason M. Mennis J. Russell M. Moore M. Brown A. Adolescent depression and substance use: the protective role of prosocial peer behavior J. Abnorm. Child Psychol. 47 2019 1065 1074 10.1007/s10802-018-0501-z 30547314 PMC6788757 Meyer A. Parmar P.J. Shahrara S. Significance of IL-7 and IL-7R in RA and autoimmunity Autoimmun. Rev. 21 2022 103120 10.1016/j.autrev.2022.103120 PMC9987213 35595051 Mizohata Y. Neural extracellular vesicle-derived miR-17 in blood as a potential biomarker of subthreshold depression Hum. Cell 34 2021 1087 1092 10.1007/s13577-021-00553-9 34013455 Moshiri F. Circulating miR-106b-3p, miR-101-3p and miR-1246 as diagnostic biomarkers of hepatocellular carcinoma Oncotarget 9 2018 15350 15364 29632649 10.18632/oncotarget.24601 PMC5880609 NanoString Technologies I. Gene expression data analysis guidelines https://nanostring.com/wp-content/uploads/Gene_Expression_Data_Analysis_Guidelines.pdf 2017 NanoString Technologies I. nCounter® miRNA expression analysis in plasma and serum samples https://nanostring.com/wp-content/uploads/TN_MK1342_Plasma-Serum_r6.pdf 2019 Noelle R.J. Nowak E.C. Cellular sources and immune functions of interleukin-9 Nat. Rev. Immunol. 10 2010 683 687 10.1038/nri2848 20847745 PMC3828627 Ortega M.A. MicroRNAs as critical biomarkers of major depressive disorder: a comprehensive perspective Biomedicines 9 2021 1659 34829888 10.3390/biomedicines9111659 PMC8615526 Pérez-Sánchez G. Inflammatory profiles in depressed adolescents treated with fluoxetine: an 8-Week Follow-up open study Mediat. Inflamm. 2018 2018 4074051 10.1155/2018/4074051 PMC6312587 30662368 Peters A.T. Interplay between pro-inflammatory cytokines, childhood trauma, and executive function in depressed adolescents J. Psychiatr. Res. 114 2019 1 10 10.1016/j.jpsychires.2019.03.030 30978658 Plikus M.V. Fibroblasts: origins, definitions, and functions in health and disease Cell 184 2021 3852 3872 10.1016/j.cell.2021.06.024 34297930 PMC8566693 Ran L.Y. Serum extracellular vesicle microRNA dysregulation and childhood trauma in adolescents with major depressive disorder Bosn. J. Basic Med. Sci. 22 2022 959 971 10.17305/bjbms.2022.7110 35659238 PMC9589301 Rubie C. microRNA-496 – a new, potentially aging-relevant regulator of mTOR Cell Cycle 15 2016 1108 1116 10.1080/15384101.2016.1158360 27097372 PMC4889276 Rusca N. Monticelli S. MiR-146a in immunity and disease Molecular Biology International 2011 2011 437301 10.4061/2011/437301 PMC3200075 22091404 Shah J.S. Soon P.S. Marsh D.J. Comparison of methodologies to detect low levels of hemolysis in serum for accurate assessment of serum microRNAs PLoS One 11 2016 e0153200 10.1371/journal.pone.0153200 PMC4824492 27054342 Shimomura A. Novel combination of serum microRNA for detecting breast cancer in the early stage Cancer Sci. 107 2016 326 334 10.1111/cas.12880 26749252 PMC4814263 Smalheiser N.R. MicroRNA expression is down-regulated and reorganized in prefrontal cortex of depressed suicide subjects PLoS One 7 2012 e33201 10.1371/journal.pone.0033201 PMC3302855 22427989 Smyth L.C.D. Characterisation of PDGF-BB:PDGFRβ signalling pathways in human brain pericytes: evidence of disruption in Alzheimer's disease Commun. Biol. 5 2022 235 10.1038/s42003-022-03180-8 35301433 PMC8931009 Szekanecz Z. Koch A.E. Mechanisms of disease: angiogenesis in inflammatory diseases Nat. Clin. Pract. Rheumatol. 3 2007 635 643 10.1038/ncprheum0647 17968334 Szklarczyk D. The STRING database in 2021: customizable protein–protein networks, and functional characterization of user-uploaded gene/measurement sets Nucleic Acids Res. 49 2020 D605 D612 10.1093/nar/gkaa1074 PMC7779004 33237311 Takata F. Nakagawa S. Matsumoto J. Dohgu S. Blood-brain barrier dysfunction amplifies the development of neuroinflammation: understanding of cellular events in brain microvascular endothelial cells for prevention and treatment of BBB dysfunction Front. Cell. Neurosci. 15 2021 661838 10.3389/fncel.2021.661838 PMC8475767 34588955 Thapar A. Collishaw S. Pine D.S. Thapar A.K. Depression in adolescence The lancet 379 2012 1056 1067 10.1016/S0140-6736(11)60871-4 PMC3488279 22305766 Valiuliene G. Anti-neuroinflammatory microRNA-146a-5p as a potential biomarker for neuronavigation-guided rTMS therapy success in medication resistant depression disorder Biomed. Pharmacother. 166 2023 115313 10.1016/j.biopha.2023.115313 37572636 van der Zee Y.Y. Blood miR-144-3p: a novel diagnostic and therapeutic tool for depression Mol. Psychiatr. 27 2022 4536 4549 10.1038/s41380-022-01712-6 PMC9832789 35902629 Weinberg R.B. Mufson E.J. Counts S.E. Evidence for a neuroprotective microRNA pathway in amnestic mild cognitive impairment Front. Neurosci. 9 2015 430 10.3389/fnins.2015.00430 26594146 PMC4633499 Winter J. MicroRNAs of the miR379-410 cluster: new players in embryonic neurogenesis and regulators of neuronal function Neurogenesis (Austin) 2 2015 e1004970 10.1080/23262133.2015.1004970 PMC4973610 27504472 Wu J. Impact of miR-223-3p and miR-2909 on inflammatory factors IL-6, IL-1ß, and TNF-α, and the TLR4/TLR2/NF-κB/STAT3 signaling pathway induced by lipopolysaccharide in human adipose stem cells PLoS One 14 2019 e0212063 10.1371/journal.pone.0212063 PMC6391004 30807577 Yang R.-C. Meningitic escherichia coli-induced upregulation of PDGF-B and ICAM-1 aggravates blood-brain barrier disruption and neuroinflammatory response J. Neuroinflammation 16 2019 101 10.1186/s12974-019-1497-1 31092253 PMC6521501 Zhou W. Ketamine-induced antidepressant effects are associated with AMPA receptors-mediated upregulation of mTOR and BDNF in rat hippocampus and prefrontal cortex Eur. Psychiatry 29 2014 419 423 10.1016/j.eurpsy.2013.10.005 24321772 Zhou L. Zhu Y. Chen W. Tang Y. Emerging role of microRNAs in major depressive disorder and its implication on diagnosis and therapeutic response J. Affect. Disord. 286 2021 80 86 33714174 10.1016/j.jad.2021.02.063 Żurawek D. Turecki G. The miRNome of depression Int. J. Mol. Sci. 22 2021 11312 10.3390/ijms222111312 PMC8582693 34768740 Appendix A Supplementary data The following are the Supplementary data to this article: Multimedia component 1 Multimedia component 1 Multimedia component 2 Multimedia component 2 Multimedia component 3 Multimedia component 3 Multimedia component 4 Multimedia component 4 Multimedia component 5 Multimedia component 5 Appendix A Supplementary data to this article can be found online at https://doi.org/10.1016/j.bbih.2025.101108 ",
  "metadata": {
    "Title of this paper": "The miRNome of depression",
    "Journal it was published in:": "Brain, Behavior, & Immunity - Health",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482293/"
  }
}