{
  "title": "Paper_1098",
  "abstract": "pmc J Imaging J Imaging 4082 jimaging jimaging Journal of Imaging 2313-433X Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470485 PMC12470485.1 12470485 12470485 41003363 10.3390/jimaging11090313 jimaging-11-00313 1 Article Maternal Factors, Breast Anatomy, and Milk Production During Established Lactation—An Ultrasound Investigation https://orcid.org/0000-0001-6841-2958 Gridneva Zoya 1 2 3 * Rea Alethea 4 Weight David 4 https://orcid.org/0000-0002-6648-1316 McEachran Jacki L. 1 2 3 https://orcid.org/0000-0002-9025-4922 Lai Ching Tat 1 2 3 https://orcid.org/0000-0002-7727-7767 Perrella Sharon L. 1 2 3 Geddes Donna T. 1 2 3 Magoulianitis Vasileios Academic Editor Jogi Pawan Academic Editor Thermos Spyridon Academic Editor 1 jacki.mceachran@uwa.edu.au ching-tat.lai@uwa.edu.au sharon.perrella@uwa.edu.au donna.geddes@uwa.edu.au 2 3 4 alethea.rea@murdoch.edu.au david.weight@murdoch.edu.au * zoya.gridneva@uwa.edu.au 12 9 2025 9 2025 11 9 497645 313 17 7 2025 03 9 2025 07 9 2025 12 09 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Obesity is linked to suboptimal breastfeeding outcomes, yet the relationships between maternal adiposity, breast anatomy, and milk production (MP) have not been investigated. We conducted ultrasound imaging to assess the breast anatomy of 34 lactating women. The amount of glandular tissue (glandular tissue representation (GTR)) was classified as low, moderate, or high. Number and diameters of main milk ducts and mammary blood flow (resistive index) were measured. Women completed a 24 h MP measurement and an obstetric/lactation history questionnaire. Body composition was measured with bioimpedance spectroscopy. Statistical analysis employed correlation networks. Multiple relationships were revealed, with later menarche correlating with minimal pubertal and pregnancy breast growth. A minimal breast growth was further correlated with lower mammary blood flow during lactation and lower numbers and smaller diameters of main milk ducts, which in turn correlated with a lower MP. Importantly, higher adiposity also correlated with minimal breast growth during pregnancy and low GTR and MP. Several modifiable and non-modifiable maternal factors may be associated with breast development and MP. Antenatal lactation assessment and intervention in high-risk women may ensure they reach their full lactation potential and inform future interventions, such as maintaining healthy adiposity. ultrasound glandular tissue milk ducts breast anatomy breastfeeding lactation milk production body composition Medela AG (Switzerland) This research was funded by unrestricted research grant from Medela AG (Switzerland). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Breastfeeding is a major public health and nutrition focus. Breastfeeding is linked to multiple dose-related health benefits for breastfeeding dyads [ 1 2 3 4 5 6 7 8 9 Animal models show a more rapid mammary gland response and more milk during secretory activation with subsequent lactations [ 10 11 12 13 14 15 16 17 18 17 18 19 20 21 22 14 15 17 18 19 20 23 24 25 26 Diagnostic ultrasound imaging of the breast has largely been limited to the non-lactating breast for the detection of pathologies. Studies of the lactating breast including ultrasound investigations are rare, but they help to understand the macro- and micro-anatomy pertaining to MP and removal [ 1 27 27 28 28 While mammary blood flow doubles during pregnancy [ 29 30 30 This pilot study employed ultrasound to elucidate the relationships between (a) the breast anatomy of lactating women, (b) adiposity, (c) medical, obstetric and lactation history, and (d) 24 h MP and milk removal efficacy. A preliminary summary of this study’s results has been presented at the ABREAST Conference 2023 [ 31 2. Materials and Methods 2.1. Participants and Study Design This is a cross-sectional study of lactating women 1–6 months postpartum who lived in the Perth metropolitan area, Western Australia, and attended a study visit at The University of Western Australia between 2018 and 2020. During the study visit, breast anatomy was assessed with ultrasound imaging. Maternal body composition was measured with bioimpedance spectroscopy. Women completed questionnaires regarding demographic and obstetric details, including age, the onset of menarche, breast growth during puberty and pregnancy, parity, previous lactation duration, birth mode, birth gestation, use of hormonal contraception, and postpartum return of menstruation. Prior to the study visit, women used electronic scales in their home to conduct 24 h MP measurements to enable calculation of total volume, average, and maximum feed volumes and breast storage capacity (24 h MP parameters). Selection criteria included breastfeeding mothers of singleton term infants between 1 and 6 months postpartum. This study was conducted in accordance with the Declaration of Helsinki and was approved by The University of Western Australia Human Research Ethics Committee (RA/4/1/4492 and RA/4/1/8532). Informed written consent was obtained from all participants. 2.2. Ultrasound Examination of the Breast We conducted ultrasound examination to assess breast anatomy using a Xario 200 ultrasound machine (Canon Medical Systems ANZ, Castle Hill, NSW, Australia), a high-resolution transducer with frequency range of 7.0–12.0 MHz (PLU-1005BT) and Parker ultrasonic gel (Fairfield, NJ, USA). For all measurements, a single breast was randomly selected and scanned prior to expressing milk. All measurements were made at the same venue by the same experienced sonographer with demonstrated good intra- and interrater reliability [ 30 The number of main milk ducts and duct diameters beneath the areola were measured as described using the radial clock face method [ 28 Figure 1 32 Due to the difficult and time-consuming nature of methods used to quantify mammary glandular and adipose tissue [ 28 Figure 1 28 Blood flow in the dominant branch of the internal mammary artery, which contributes the greater proportion of blood flow to the lactating breast (60–70%) [ 30 33 Figure 2 30 The internal mammary arterial resistive index, derived from the maximum and minimum velocities, was calculated using the formula below (Equation (1)), where RI PSV EDV 34 35 (1) R I = ( P S V − E D V ) / P S V 2.3. Anthropometric and Body Composition Measurements Participants’ body weights were measured using an electronic scale (accuracy ± 0.1 kg; Seca, Chino, CA, USA). Height was self-reported by participants or measured against a calibrated marked wall (accuracy ± 0.1 cm). BMI was calculated as kg/m 2 3 36 Body composition was measured with bioelectrical impedance spectroscopy using an Impedimed SFB7 bioelectrical impedance analyser (ImpediMed, Brisbane, QLD, Australia), according to protocols described previously [ 37 38 39 2.4. The 24 h Milk Profile Data Collection The 24 h MP measurements were performed on average 2.6 ± 4.8 (mean ± SD) weeks prior to the study visit using the test-weighing method [ 25 40 41 During the 24 h MP measurement, participants collected small (<2.0 mL) milk samples pre- and post-expressions and/or breastfeeds by manual expression into 5 mL polypropylene tubes (P5016SL, Techno Plas Pty Ltd., St Marys, SA, Australia). Samples were stored in the participant’s home freezer until transported to the laboratory, where fat concentration was analyzed using the creamatocrit method [ 42 43 44 2.5. Statistical Analyses Descriptive statistics are presented as mean ± standard deviation (SD) or median and interquartile range for continuous variables and frequencies/counts and percentages for categorical variables. Statistical analysis used the correlation networks method [ 45 46 r p p 47 Additionally, the correlations were visualized with heat maps completed in Excel using the correlation coefficients and displaying the correlations between multiple variables as a two-colour gradient. The colour of each cell corresponds to the magnitude of the cell amount with the darker colours representing stronger correlations and colours themselves representing the direction of correlation using the diverging colour palette and enabling clustering [ 48 3. Results 3.1. Participants’ Demographics and Obstetric History Thirty-four lactating women participated in this study ( Table 1 n n n n n n 49 Participants’ reproductive and obstetric history are presented in Table 2 3.2. Breast Anatomy Parameters The breast ultrasound examination showed that most of the milk ducts (70%) were positioned in the inferior half of the breast ( Table 3 3.3. The 24 h Milk Production Parameters The 24 h MP was measured at 3.5 ± 1.2 months postpartum and was 809 ± 235 g (min–max: 321–1274 g; Table 4 24 25 3.4. Correlation Matrix Results The correlation matrix results ( Figure 3 Figure 3 Figure 4 Figure 5 Figure 6 Table A1 Table A2 Table A3 Table A4 Table A5 3.4.1. Breast Development and Anatomy There were multiple strong positive correlations between the number of main milk ducts and the sum of diameters measured in both halves of the breast combined and in the superior and inferior halves; however, the mean of the duct diameters did not correlate with the numbers of ducts ( Table A6 The number of main milk ducts was positively correlated with breast growth both during puberty and in pregnancy ( Figure 4 Table A1 Table A2 GTR was positively correlated with breast growth during pregnancy and the use of hormonal contraception and negatively with maternal age, parity, and duration of previous lactations ( Figure 4 Table A1 Table A2 3.4.2. The 24 h Milk Production There were multiple strong positive correlations between the 24 h MP parameters, including the total 24 h MP as well as the test breast’s 24 h MP, maximum feed volume, average feed volume, PAMR, and breast storage capacity ( Table A7 The relationships of 24 h MP with maternal factors, body composition, and breast anatomy are presented in Figure 5 Table A3 The total 24 h MP and test breast’s 24 h MP, maximum feed volume, and average feed volume were positively correlated with the means and sums of the duct diameters and negatively with maternal %FM and FM/FFM ( Figure 5 Table A3 The breast storage capacity was positively correlated with mean duct diameters in the inferior half of the breast and negatively with maternal %FM and FM/FFM. The PAMR was not significantly correlated with any maternal characteristics, body composition, or breast anatomy parameters. Breast volume, GTR, and the number of main milk ducts had no relationships with 24 h MP parameters ( Figure 5 Table A3 3.4.3. Maternal Characteristics and Body Composition There were multiple strong positive correlations between maternal body composition parameters ( Table A8 All maternal body composition parameters were positively correlated with breast volume and negatively correlated with breast growth during pregnancy. All maternal body composition parameters were negatively correlated with hormonal contraception use apart from FFM. The FFMI was also positively correlated with parity and breast growth during pregnancy ( Figure 6 Table A4 Table A5 Later onset of menarche was negatively correlated with breast growth during puberty and pregnancy. Breast growth during puberty was positively correlated with breast growth during pregnancy and negatively with parity. The duration of previous lactations was positively correlated with parity. Older mothers were less likely to use hormonal contraception, whilst mothers that had a vaginal birth were more likely to have a larger breast volume ( Figure 6 Table A4 Table A5 4. Discussion This comprehensive pilot study shows that several modifiable and non-modifiable maternal factors including adiposity may potentially lead to compromised breast development and impact MP ( Figure 7 4.1. Breast Growth During Puberty and Pregnancy Whilst the human breast is preferably the sole source of infant nutrition during the first six months of life, studies of the lactating breast and its development are extremely rare [ 1 50 51 In our study, breast growth during puberty correlated with increased numbers and diameters of main milk ducts as well as with the mammary blood flow (internal mammary artery resistive index) during established lactation ( Figure 3 Table A1 Table A2 52 53 54 Indeed, during pregnancy, further extension and branching of the ductal system occurs, together with intensified lobular-alveolar growth (mammogenesis) influenced by multiple hormones, such as estrogen, progesterone, prolactin, growth hormone, insulin-like growth factor, epidermal growth factor, fibroblast growth factor, parathyroid hormone-related protein, and placental lactogen [ 55 56 57 58 3 26 n 26 Figure 3 Table A1 Table A2 4.2. Breast Anatomy, Body Composition, and 24 h Milk Production We did not observe any direct correlations of 24 h MP parameters with the onset of menarche, breast growth during puberty and pregnancy, nor with the number of main milk ducts or GTR. The latter two are in line with another smaller ultrasound study ( n 28 Figure 4 Table A3 Sufficient volume of functional glandular tissue is a key requirement for successful lactation [ 27 28 28 49 Figure 3 Table A1 Figure 5 Table A4 Figure 3 Table A5 The higher adipose tissue content in the breast with an increased BMI, which can be detected by ultrasound, may potentially impact several milk synthesis pathways. Leptin produced by the mammary gland adipocytes contributes to local proinflammatory mechanisms stimulating the production of inflammatory factors such as IL-1, IL-6, and TNF-α and enhances oxidative damage in the cells [ 59 60 61 62 This evidence positions maternal adiposity as a central factor impacting MP on multiple levels. As such, we identified multiple negative correlations between maternal adiposity (FM, %FM, and FM/FFM) and 24 h MP parameters ( Figure 4 Table A3 Figure 5 Table A5 63 n n 64 Interestingly, milk duct characteristics, mammary blood flow, and milk removal parameters such as PAMR were not correlated with maternal body composition. This suggests the milk ejection reflex is intact, and that the anatomical composition of the breast does not impact the efficacy of milk removal (by the infant or the breast pump) in women with overweight/obesity or LMS. Thus, milk volume removed from the breast is likely limited by its synthetic and/or storage capacity rather than the mode of removal. 4.3. Mammary Blood Flow Our study found that the internal mammary artery resistive index was positively correlated with both the breast growth during puberty and the return of the menstrual cycle but not 24 h MP ( Figure 3 Table A1 29 65 66 67 68 69 6 7 70 A single study of 55 women using different blood flow parameters also failed to find a relationship with the MP [ 30 30 30 4.4. Maternal Characteristics We have also found several novel relationships between maternal characteristics, including reproductive and obstetric history, with breast anatomy and MP. Increased parity was related to higher numbers and diameters of the main milk ducts, as well as higher 24 h MP parameters including the maximum feed volume and breast storage capacity ( Figure 4 Table A3 71 72 73 74 75 76 77 25 78 79 80 13 In this study, use of hormonal contraception during lactation was related to a greater GTR and 24 h MP ( Figure 3 Figure 4 Table A1 Table A3 81 9 81 The return of menses was correlated with smaller milk duct diameters and a lower total and test breast 24 h MP ( Figure 3 Figure 4 Table A2 Table A3 82 83 84 85 86 87 The strengths of our study include the use of an ultrasound to assess breast anatomy and blood flow and the validated reference method to measure 24 h MP [ 88 Our study does have several limitations. Whilst it is the largest study of this kind to date, it is a small pilot cross-sectional study of Australian women with mainly European ancestry and from a high socioeconomic setting; thus, the results cannot be generalized. We also collected self-reported bra size, as well as reproductive and obstetric history data, which may be affected by recall bias [ 89 90 90 91 92 93 94 94 94 Whilst maternal diet is known to affect human milk composition, particularly fatty acids [ 95 96 97 98 99 5. Conclusions Findings from this comprehensive study identify several modifiable and non-modifiable maternal factors, such as high adiposity and minimal breast growth during puberty and pregnancy that may potentially lead to compromised breast development and impact milk production. Ultrasound imaging represents a low-risk potential diagnostic tool to identify the low proportion of glandular tissue as a limiting factor for milk production. Further research may inform interventions aimed at maintaining healthy adiposity not only during pre-conception, pregnancy, and lactation but as early as childhood. Our results provide a rationale for the antenatal lactation assessment of women and timely interventions in those at an increased risk of low milk supply to ensure they reach their full lactation potential. Acknowledgments We thank all of the participants for help with breastfeeding research. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, Z.G. and D.T.G.; methodology, D.T.G., J.L.M., S.L.P. and Z.G.; data collection, Z.G. and D.T.G.; formal analysis, Z.G., A.R. and D.W.; investigation, Z.G. and D.T.G.; resources, D.T.G.; data curation, Z.G., J.L.M., C.T.L. and S.L.P.; writing—original draft preparation, Z.G.; writing—review and editing, A.R., D.W., J.L.M., S.L.P., C.T.L. and D.T.G.; visualization, A.R., D.W. and ZG.; supervision, D.T.G.; project administration, J.L.M.; funding acquisition, D.T.G. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was conducted in accordance with the Declaration of Helsinki. The study was approved by the Human Research Ethics Committee at The University of Western Australia (RA/4/1/4492, 26 November 2010 and RA/4/1/8532, 3 May 2015) and conducted in accordance with the relevant guidelines and regulations. Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Data Availability Statement The data presented in this study are available on request from the corresponding author due to ethical reasons. Conflicts of Interest D.T.G. declares past participation in the Scientific Advisory Board of Medela AG. All authors are supported by an unrestricted research grant from Medela AG, administered by The University of Western Australia. The funders had no role in the design of the study; in the collection, analyses, or interpretation of data; in the writing of the manuscript; or in the decision to publish the results. Appendix A jimaging-11-00313-t0A1_Table A1 Table A1 Correlations between maternal characteristics and breast anatomy (part 1). Predictors GTR Internal Mammary Artery RI Total MD Number MD Number in Inferior HB MD Number in Superior HB Parity  −0.36 1  0.039 2 −0.29 0.091 −0.07 0.71 −0.07 0.71 −0.02 0.92 Duration of previous lactations (months)  −0.34  0.049 −0.28 0.10 0.07 0.70 0.07 0.69 0.01 0.94 Time postpartum (months) 0.28 0.10 −0.11 0.54 −0.20 0.25 −0.22 0.21 −0.03 0.87 Maternal age (years)  −0.35  0.040 0.04 0.81 −0.11 0.54 −0.01 0.97 −0.17 0.33 Weight (kg)  −0.65  <0.001 −0.14 0.41 −0.02 0.90 0.12 0.50 −0.21 0.24 Body mass index (kg/m 2  −0.63  <0.001 0.02 0.92 0.07 0.68 0.24 0.18 −0.21 0.23 Fat-free mass (kg)  −0.37  0.029 −0.13 0.48 −0.09 0.59 0.10 0.56 −0.30 0.084 Fat-free mass index (kg/m 2  −0.40  0.018 0.07 0.69 0.02 0.89 0.26 0.14 −0.33 0.058 Fat mass (kg)  −0.70  <0.001 −0.15 0.39 0.03 0.85 0.11 0.54 −0.10 0.58 Fat mass index (kg/m 2  −0.68  <0.001 −0.04 0.81 0.10 0.58 0.18 0.30 −0.10 0.59 Fat mass (%)  −0.74  <0.001 −0.14 0.44 0.11 0.55 0.10 0.59 0.04 0.83 Fat mass to fat-free mass ratio  −0.71  <0.001 −0.14 0.42 0.11 0.54 0.09 0.60 0.05 0.79 Breast volume (cm 3  −0.72  <0.001 −0.07 0.70 −0.08 0.66 0.01 0.94 −0.15 0.39 Age at menarche (years) −0.20 0.25 −0.27 0.12 −0.01 0.96 −0.04 0.80 0.04 0.82 Puberty breast growth (yes) −0.04 0.82  0.53  0.001  0.34  0.047  0.48  0.004 −0.01 0.95 Pregnancy breast growth (yes)  0.39  0.022 0.19 0.28  0.34  0.046 0.04 0.81  0.48  0.004 Birth mode (vaginal) −0.21 0.24 −0.25 0.15 0.17 0.34 −0.04 0.84 0.33 0.057 Cycle commenced (yes) −0.09 0.63  0.40  0.021 −0.19 0.27 −0.31 0.079 0.11 0.53 Hormonal contraception use (yes)  0.59  <0.001 0.11 0.54 −0.17 0.34 −0.33 0.058 0.12 0.51 1 2 p jimaging-11-00313-t0A2_Table A2 Table A2 Correlations between maternal characteristics and breast anatomy (part 2). Predictors Mean MD Diameter Mean MD Diameter in Inferior HB Mean MD Diameter in Superior HB Total Sum of MD Diameters Sum of MD Diameters in Inferior HB Sum of MD Diameters in Superior HB Parity  0.57 1  <0.001 2  0.47  0.006  0.43  0.012  0.38  0.025 0.28 0.11  0.37  0.033 Duration of previous lactations (months)  0.53  0.001  0.39  0.022  0.49  0.004  0.44  0.009 0.31 0.077  0.41  0.016 Time postpartum (months) 0.19 0.27 0.25 0.15 0.06 0.73 −0.03 0.85 −0.02 0.91 −0.04 0.84 Maternal age (years) −0.01 0.98 −0.08 0.65 0.11 0.55 −0.08 0.66 −0.07 0.68 −0.04 0.80 Weight (kg) 0.01 0.94 −0.02 0.91 0.04 0.82 0.00 1.00 0.06 0.73 −0.10 0.58 Body mass index (kg/m 2 0.10 0.58 0.03 0.84 0.14 0.44 0.12 0.51 0.17 0.33 −0.05 0.80 Fat-free mass (kg) 0.14 0.43 0.12 0.50 0.15 0.39 0.06 0.75 0.14 0.42 −0.12 0.50 Fat-free mass index (kg/m 2 0.25 0.15 0.19 0.28 0.29 0.10 0.20 0.25 0.29 0.09 −0.07 0.70 Fat mass (kg) −0.09 0.63 −0.12 0.50 −0.04 0.80 −0.04 0.82 −0.01 0.95 −0.06 0.72 Fat mass index (kg/m 2 −0.03 0.88 −0.08 0.65 0.02 0.93 0.04 0.83 0.06 0.72 −0.02 0.89 Fat mass (%) −0.18 0.31 −0.20 0.25 −0.14 0.43 −0.07 0.69 −0.07 0.70 −0.03 0.86 Fat mass to fat-free mass ratio −0.18 0.31 −0.21 0.22 −0.13 0.46 −0.07 0.71 −0.08 0.66 −0.01 0.96 Breast volume (cm 3 0.14 0.44 −0.05 0.77 0.29 0.092 0.01 0.94 −0.06 0.74 0.12 0.52 Age at menarche (years) 0.08 0.67 −0.01 0.96 0.11 0.54 0.13 0.46 0.02 0.93 0.15 0.38 Puberty breast growth (yes) 0.08 0.66 0.08 0.65 0.16 0.37 0.33 0.054  0.49  0.003 0.03 0.84 Pregnancy breast growth (yes) 0.07 0.70 0.07 0.71 0.03 0.86  0.35  0.044 0.17 0.35  0.37  0.031 Birth mode (vaginal) 0.10 0.58 −0.06 0.72 0.22 0.20 0.18 0.30 −0.07 0.71  0.48  0.004 Cycle commenced (yes)  −0.41  0.016 −0.30 0.085  −0.70  <0.001 −0.43  0.010  −0.36  0.036 −0.25 0.16 Hormonal contraception use (yes) −0.09 0.63 −0.09 0.60 −0.05 0.80 −0.26 0.14  −0.37  0.033 0.02 0.90 1 2 p jimaging-11-00313-t0A3_Table A3 Table A3 Correlations between maternal characteristics and breast anatomy and 24 h milk production parameters. Predictors Total 24 h MP TB 24 h MP TB Maximum Feed TB Average Feed TB PAMR TB Storage Capacity Parity  0.36 1  0.039 2 0.31 0.070  0.36  0.034 0.32 0.068 0.02 0.89 0.39  0.024 Duration of previous lactations (months) 0.33 0.056 0.31 0.072 0.26 0.14 0.29 0.10 0.12 0.50 0.25 0.16 Time postpartum (months) 0.11 0.54 0.21 0.22 0.11 0.54 0.19 0.28 0.33 0.057 −0.03 0.88 Maternal age (years) −0.10 0.58 −0.10 0.58 0.06 0.75 0.03 0.86 0.04 0.84 −0.03 0.87 Weight (kg) −0.12 0.50 −0.14 0.43 −0.23 0.19 −0.19 0.27 −0.27 0.13 −0.07 0.71 Body mass index (kg/m 2 −0.15 0.39 −0.17 0.34 −0.20 0.27 −0.15 0.38 −0.18 0.31 −0.12 0.49 Fat-free mass (kg) 0.08 0.65 0.05 0.76 −0.01 0.95 0.08 0.63 −0.20 0.26 0.19 0.29 Fat-free mass index (kg/m 2 0.02 0.91 0.01 0.96 0.02 0.89 0.13 0.46 −0.10 0.59 0.11 0.52 Fat mass (kg) −0.25 0.16 −0.26 0.14  −0.36  0.039  −0.37  0.032 −0.27 0.12 −0.24 0.17 Fat mass index (kg/m 2 −0.26 0.14 −0.27 0.12 −0.33 0.059 −0.34 0.050 −0.21 0.23 −0.27 0.12 Fat mass (%)  −0.37  0.032  −0.34  0.049  −0.42  0.013  −0.50  0.003 −0.23 0.19  −0.40  0.021 Fat mass to fat-free mass ratio  −0.36  0.038  −0.36  0.037  −0.43  0.010  −0.50  0.002 −0.23 0.20  −0.41  0.015 Breast volume (cm 3 −0.02 0.93 −0.14 0.44 −0.25 0.15 −0.20 0.26 −0.13 0.47 −0.02 0.92 Glandular tissue representation (low, medium, and high) 0.19 0.27 0.25 0.15 0.25 0.16 0.28 0.11 0.09 0.60 0.25 0.16 Total MD number 0.28 0.11 0.23 0.19 0.15 0.39 0.13 0.48 −0.07 0.71 0.18 0.30 MD number in inferior half 0.26 0.14 0.19 0.29 0.15 0.40 0.22 0.21 0.00 0.99 0.16 0.36 MD number in superior half 0.10 0.58 0.12 0.50 0.05 0.78 −0.10 0.58 −0.12 0.52 0.08 0.64 Total sum of MD diameters (mm)  0.42  0.013  0.43  0.012  0.38  0.025  0.41  0.015 0.17 0.35 0.33 0.056 Sum of MD diameters in inferior half (mm)  0.35  0.046  0.41  0.017  0.39  0.022  0.47  0.005 0.19 0.27 0.33 0.054 Sum of MD diameters in superior half (mm) 0.31 0.074 0.22 0.21 0.16 0.37 0.09 0.61 0.03 0.87 0.14 0.42 Mean MD diameter (mm)  0.43  0.012  0.44  0.009  0.40  0.019  0.48  0.004 0.33 0.053 0.30 0.087 Mean MD diameter in inferior half (mm)  0.38  0.025  0.53  0.001  0.45  0.008  0.50  0.002 0.30 0.084  0.38  0.025 Mean MD diameter in superior half (mm) 0.31 0.070 0.14 0.44 0.27 0.13  0.39  0.021 0.26 0.14 0.15 0.41 IMA resistive index −0.02 0.91 −0.17 0.34 −0.07 0.70 0.02 0.93 0.30 0.081 −0.10 0.59 Age at menarche (years) 0.14 0.44 0.03 0.86 0.16 0.38 −0.05 0.79 0.13 0.46 0.02 0.92 Puberty breast growth (yes) −0.02 0.93 −0.04 0.84 −0.29 0.093 −0.07 0.71 −0.05 0.79 −0.22 0.21 Pregnancy breast growth (yes) 0.12 0.51 −0.11 0.55 0.17 0.33 0.12 0.51 0.11 0.52 0.04 0.84 Birth mode (vaginal) −0.06 0.73 0.00 1.00 −0.07 0.70 −0.02 0.90 −0.18 0.31 0.23 0.19 Cycle commenced (yes)  −0.55  <0.001  −0.55  <0.001 0.00 1.00 −0.11 0.53 0.04 0.84 0.06 0.75 Hormonal contraception use (yes)  0.36  0.034 0.28 0.11 −0.02 0.92 0.01 0.95 −0.16 0.38 0.29 0.10 1 2 p jimaging-11-00313-t0A4_Table A4 Table A4 Correlations between maternal characteristics and body composition parameters (part 1). Predictors Parity Duration of Previous Lactations Maternal Age Breast Volume Parity NA NA  1.00  <0.001 0.30 0.089 0.26 0.14 Duration of previous lactations (months)  1.00 1  <0.001 2 NA NA 0.33 0.053 0.26 0.14 Time postpartum (months) −0.13 0.46 −0.17 0.34 −0.20 0.27 −0.14 0.43 Maternal age (years) 0.30 0.089 0.33 0.053 NA NA −0.04 0.82 Weight (kg) 0.25 0.15 0.15 0.39 −0.01 0.94 0.66  <0.001 Body mass index (kg/m 2 0.28 0.11 0.22 0.22 0.04 0.83 0.71  <0.001 Fat-free mass (kg) 0.30 0.084 0.13 0.45 −0.02 0.91 0.50  0.003 Fat-free mass index (kg/m 2  0.35  0.042 0.23 0.19 0.06 0.76 0.61  <0.001 Fat mass (kg) 0.18 0.31 0.14 0.44 −0.01 0.97 0.66  <0.001 Fat mass index (kg/m 2 0.20 0.27 0.18 0.32 0.02 0.91 0.68  <0.001 Fat mass (%) 0.09 0.63 0.12 0.51 0.04 0.81 0.51  0.002 Fat mass to fat-free mass ratio 0.08 0.65 0.11 0.52 0.02 0.89 0.53  0.001 Breast volume (cm 3 0.26 0.14 0.26 0.14 −0.04 0.82 NA NA Age at menarche (years) 0.08 0.63 0.00 0.98 0.02 0.90 0.24 0.17 Puberty breast growth (yes)  −0.36  0.037 −0.12 0.49 0.15 0.39 −0.03 0.85 Pregnancy breast growth (yes) 0.16 0.38 0.27 0.12 0.09 0.61 −0.55  0.001 Birth mode (vaginal) 0.19 0.28 0.19 0.29 −0.07 0.70 0.40  0.018 Cycle commenced (yes) −0.03 0.89 −0.20 0.25 0.32 0.068 0.15 0.39 Hormonal contraception use (yes) −0.28 0.11 −0.32 0.065  −0.34  0.049 −0.16 0.37 1 2 p jimaging-11-00313-t0A5_Table A5 Table A5 Correlations between maternal characteristics and body composition parameters (part 2). Predictors Age at Menarche Breast Growth During Puberty Breast Growth During Pregnancy Birth Mode (Vaginal) Cycle Commenced Hormonal Contraception Use Parity 0.08 1 0.63 2  −0.36  0.037 0.16 0.38 0.19 0.28 −0.03 0.89 −0.28 0.11 Duration of previous lactations (months) 0.00 0.98 −0.12 0.49 0.27 0.12 0.19 0.29 −0.20 0.25 −0.32 0.065 Time postpartum (months) 0.12 0.49 −0.25 0.15 −0.22 0.20 −0.30 0.081 −0.23 0.19 −0.17 0.34 Maternal age (years) 0.02 0.90 0.15 0.39 0.09 0.61 −0.07 0.70 0.32 0.068  −0.34  0.049 Weight (kg) 0.26 0.13 −0.12 0.49  −0.66  <0.001 0.03 0.86 −0.10 0.59  −0.45  0.008 Body mass index (kg/m 2 0.07 0.71 0.13 0.46  −0.64  <0.001 −0.03 0.88 0.03 0.85  −0.57  <0.001 Fat-free mass (kg) 0.16 0.37 0.04 0.84  −0.60  <0.001 0.03 0.85 −0.12 0.50 −0.25 0.15 Fat-free mass index (kg/m 2 −0.09 0.62  0.39  0.022  −0.52  0.002 −0.03 0.86 0.05 0.77  −0.43  0.010 Fat mass (kg) 0.31 0.079 −0.21 0.23  −0.59  <0.001 0.02 0.89 −0.06 0.75  −0.56  0.001 Fat mass index (kg/m 2 0.18 0.30 −0.07 0.71  −0.60  <0.001 −0.02 0.91 0.01 0.94  −0.62  <0.001 Fat mass (%) 0.24 0.16 −0.26 0.14  −0.57  <0.001 −0.06 0.73 0.05 0.76  −0.51  0.002 Fat mass to fat-free mass ratio 0.28 0.11 −0.27 0.12  −0.52  0.001 −0.03 0.86 0.02 0.91  −0.56  0.001 Breast volume (cm 3 0.24 0.17 −0.03 0.85  −0.55  0.001  0.40  0.018 0.15 0.39 −0.16 0.37 Age at menarche (years) NA NA  −0.94  <0.001  −0.44  0.009 0.32 0.065 −0.10 0.58 −0.14 0.42 Puberty breast growth (yes)  −0.94  <0.001 NA NA  0.40  0.020 −0.29 0.095 0.09 0.61 0.19 0.29 Pregnancy breast growth (yes)  −0.44  0.009  0.40  0.020 NA NA −0.15 0.39 0.02 0.91 0.08 0.66 Birth mode (vaginal) 0.32 0.065 −0.29 0.095 −0.15 0.39 NA NA 0.19 0.29 0.29 0.10 Cycle commenced (yes) −0.10 0.58 0.09 0.61 0.02 0.91 0.19 0.29 NA NA 0.27 0.12 Hormonal contraception use (yes) −0.14 0.42 0.19 0.29 0.08 0.66 0.29 0.10 0.27 0.12 NA NA 1 2 p jimaging-11-00313-t0A6_Table A6 Table A6 Correlations between number of milk ducts, sum of duct diameters and mean duct diameters in the test breast. Predictors Total MD Number MD Number in IH MD Number in SH Total Sum of MDD Sum of MDD in IH Sum of MDD in SH Mean MDD Mean MDD in IH Mean MDD in SH Total MD number NA NA 0.80 1 <0.001 2  0.54  0.001  0.66  <0.001  0.58  <0.001  0.41  0.016 −0.03 0.88 0.05 0.77 −0.10 0.59 MD number in IH  0.80  <0.001 NA NA −0.07 0.69  0.53  0.001  0.71  <0.001 −0.06 0.73 −0.01 0.95 0.06 0.74 0.03 0.87 MD number in SH  0.54  0.001 −0.07 0.69 NA NA  0.35  0.041 −0.03 0.87  0.77  <0.001 −0.03 0.87 0.00 0.98 −0.25 0.16 Total sum of MDD (mm)  0.66  <0.001  0.53  0.001  0.35  0.041 NA NA  0.88  <0.001  0.64  <0.001  0.71  <0.001  0.72  <0.001  0.48  0.004 Sum of MDD in IH (mm)  0.58  <0.001  0.71  <0.001 −0.03 0.87  0.88  <0.001 NA NA 0.19 0.27  0.62  <0.001  0.72  <0.001  0.36  0.034 Sum of MDD in SH (mm)  0.41  0.016 −0.06 0.73  0.77  <0.001  0.64  <0.001 0.19 0.27 NA NA  0.48  0.004 0.33 0.059  0.49  0.003 Mean MDD (mm) −0.03 0.88 −0.01 0.95 −0.03 0.87  0.71  <0.001  0.62  <0.001  0.48  0.004 NA NA  0.92  <0.001  0.76  <0.001 Mean MDD in IH (mm) 0.05 0.77 0.06 0.74 0.00 0.98  0.72  <0.001  0.72  <0.001 0.33 0.059  0.92  <0.001 NA NA  0.47  0.005 Mean MDD in SH (mm) −0.10 0.59 0.03 0.87 −0.25 0.16  0.48  0.004  0.36  0.034  0.49  0.003  0.76  <0.001  0.47  0.005 NA NA 1 2 p jimaging-11-00313-t0A7_Table A7 Table A7 Correlations between 24 h milk production parameters. Predictors Total 24 h MP 24 h MP, TB Maximum Feed, TB Average Feed, TB Average PAMR, TB Breast Storage Capacity, TB Total 24 h MP (g) NA NA 0.80 1 <0.001 2  0.54  <0.001  0.52  0.002 0.23 0.19  0.47  0.005 24 h MP, test breast 2 (g)  0.80  <0.001 NA NA  0.58  <0.001  0.59  <0.001 0.19 0.28  0.54  <0.001 Average feed, test breast (g)  0.54  <0.001  0.58  <0.001 NA NA  0.91  <0.001  0.39  0.024  0.69  <0.001 Maximum feed, test breast (g)  0.52  0.002  0.59  <0.001  0.91  <0.001 NA NA  0.51  0.002  0.61  <0.001 Average PAMR, test breast (%) 0.23 0.19 0.19 0.28  0.39  0.024  0.51  0.002 NA NA −0.23 0.19 Breast storage capacity, test breast (g)  0.47  0.005  0.54  <0.001  0.69  <0.001  0.61  <0.001 −0.23 0.19 NA NA 1 2 p jimaging-11-00313-t0A8_Table A8 Table A8 Correlations between maternal body composition parameters. Predictors Weight BMI FFM FFMI FM FMI %FM FM/FFM Breast Volume Weight (kg) NA NA 0.80 1 <0.001 2  0.86  <0.001  0.76  <0.001  0.93  <0.001  0.85  <0.001  0.65  <0.001  0.68  <0.001  0.66  <0.001 BMI (kg/m 2  0.89  <0.001 NA NA  0.68  <0.001  0.88  <0.001  0.88  <0.001  0.94  <0.001  0.71  <0.001  0.72  <0.001  0.71  <0.001 FFM (kg)  0.86  <0.001  0.68  <0.001 NA NA  0.80  <0.001  0.60  <0.001  0.50  0.003 0.18 0.31 0.21 0.24  0.50  0.003 FFMI (kg/m 2  0.76  <0.001  0.88  <0.001  0.80  <0.001 NA NA  0.59  <0.001  0.66  <0.001 0.29 0.095 0.30 0.085  0.61  <0.001 FM (kg)  0.93  <0.001  0.88  <0.001  0.60  <0.001  0.59  <0.001 NA NA  0.96  <0.001  0.88  <0.001  0.90  <0.001  0.66  <0.001 FMI (kg/m 2  0.85  <0.001  0.94  <0.001  0.50  0.003  0.66  <0.001  0.96  <0.001 NA NA  0.90  <0.001  0.91  <0.001  0.68  <0.001 %FM (%)  0.65  <0.001  0.71  <0.001 0.18 0.31 0.29 0.095  0.88  <0.001  0.90  <0.001 NA NA  0.99  <0.001  0.51  0.002 FM/FFM  0.68  <0.001  0.72  <0.001 0.21 0.24 0.30 0.085  0.90  <0.001  0.91  <0.001  0.99  <0.001 NA NA  0.53  0.001 Breast volume (cm 3  0.66  <0.001  0.71  <0.001  0.50  0.003  0.61  <0.001  0.66  <0.001  0.68  <0.001  0.51  0.002  0.53  0.001 NA NA 1 2 p References 1. Geddes D.T. Gridneva Z. Perrella S.L. Mitoulas L.R. Kent J.C. Stinson L.F. Lai C.T. Sakalidis V. Twigger A.J. Hartmann P.E. 25 years of research in human lactation: From discovery to translation Nutrients 2021 13 3071 10.3390/nu13093071 34578947 PMC8465002 2. Oken E. Fields D.A. Lovelady C.A. Redman L.M. TOS Scientific Position Statement: Breastfeeding and Obesity Obesity 2017 25 1864 1866 10.1002/oby.22024 29086503 PMC9048856 3. Mantzorou M. Papandreou D. Vasios G.K. Pavlidou E. Antasouras G. Psara E. Taha Z. Poulios E. Giaginis C. Exclusive breastfeeding for at least four months is associated with a lower prevalence of overweight and obesity in mothers and their children after 2–5 years from delivery Nutrients 2022 14 3599 10.3390/nu14173599 36079855 PMC9459704 4. Yan J. Liu L. Zhu Y. Huang G. Wang P.P. The association between breastfeeding and childhood obesity: A meta-analysis BMC Public Health 2014 14 1267 10.1186/1471-2458-14-1267 25495402 PMC4301835 5. Tuoyire D.A. Tampah-Naah A.M. Association of breastfeeding duration with overweight and obesity among women in Ghana Front. Glob. Women’s Health 2024 5 1251849 10.3389/fgwh.2024.1251849 39351345 PMC11439822 6. Gianni M.L. Bettinelli M.E. Manfra P. Sorrentino G. Bezze E. Plevani L. Cavallaro G. Raffaeli G. Crippa B.L. Colombo L. Breastfeeding difficulties and risk for early breastfeeding cessation Nutrients 2019 11 2266 10.3390/nu11102266 31547061 PMC6835226 7. Gatti L. Maternal perceptions of insufficient milk supply in breastfeeding J. Nurs. Scholarsh. 2008 40 355 363 10.1111/j.1547-5069.2008.00234.x 19094151 PMC4508856 8. Galipeau R. Duma s.L. Lepage M. Perception of not having enough milk and actual milk production of first-time breastfeeding mothers: Is there a difference? Breastfeed. Med. 2017 12 210 217 10.1089/bfm.2016.0183 28326807 9. Jin X. Perrella S.L. Lai C.T. Taylor N.L. Geddes D.T. Causes of low milk supply: The roles of estrogens, progesterone, and related external factors Adv. Nutr. 2023 15 100129 10.1016/j.advnut.2023.10.002 37832920 PMC10831895 10. Lang S.L. Iverson S.J. Bowen W.D. Primiparous and multiparous females differ in mammary gland alveolar development: Implications for milk production J. Exp. Biol. 2012 215 2904 2911 10.1242/jeb.067058 22837465 11. Dos Santos C.O. Dolzhenko E. Hodges E. Smith A.D. Hannon G.J. An epigenetic memory of pregnancy in the mouse mammary gland Cell Rep. 2015 11 1102 1109 10.1016/j.celrep.2015.04.015 25959817 PMC4439279 12. Buonfiglio D.C. Ramos-Lobo A.M. Freitas V.M. Zampieri T.T. Nagaishi V.S. Magalhães M. Cipolla-Neto J. Cella N. Donato J. Jr. Obesity impairs lactation performance in mice by inducing prolactin resistance Sci. Rep. 2016 6 22421 10.1038/srep22421 26926925 PMC4772384 13. Warden A.H. Sakalidis V.S. McEachran J.L. Lai C.T. Perrella S.L. Geddes D.T. Gridneva Z. Consecutive lactation, infant birth weight and sex do not associate with milk production and infant milk intake in breastfeeding women Nutrients 2025 17 1062 10.3390/nu17061062 40292444 PMC11945202 14. Hilson J.A. Rasmussen K.M. Kjolhede C.L. High prepregnant body mass index is associated with poor lactation outcomes among white, rural women independent of psychosocial and demographic correlates J. Hum. Lact. 2004 20 18 29 10.1177/0890334403261345 14974697 15. Bever Babendure J. Reifsnider E. Mendias E. Moramarco M.W. Davila Y.R. Reduced breastfeeding rates among obese mothers: A review of contributing factors, clinical considerations and future directions Int. Breastfeed. J. 2015 10 21 10.1186/s13006-015-0046-5 26140049 PMC4488037 16. Rasmussen K.M. Hilson J.A. Kjolhede C.L. Obesity may impair lactogenesis II J. Nutr. 2001 131 3009S 3011S 10.1093/jn/131.11.3009S 11694637 17. Lepe M. Bacardi Gascon M. Castaneda-Gonzalez L.M. Perez Morales M.E. Jimenez Cruz A. Effect of maternal obesity on lactation: Systematic review Nutr. Hosp. 2011 26 1266 1269 22411371 10.1590/S0212-16112011000600012 18. Amir L.H. Donath S. A systematic review of maternal obesity and breastfeeding intention, initiation and duration BMC Pregnancy Childbirth 2007 7 9 10.1186/1471-2393-7-9 17608952 PMC1937008 19. Hilson J.A. Rasmussen K.M. Kjolhede C.L. Maternal obesity and breast-feeding success in a rural population of white women Am. J. Clin. Nutr. 1997 66 1371 1378 10.1093/ajcn/66.6.1371 9394689 20. Ballesta-Castillejos A. Gomez-Salgado J. Rodriguez-Almagro J. Ortiz-Esquinas I. Hernandez-Martinez A. Relationship between maternal body mass index with the onset of breastfeeding and its associated problems: An online survey Int. Breastfeed. J. 2020 15 55 10.1186/s13006-020-00298-5 32539791 PMC7296910 21. Hauff L.E. Leonard S.A. Rasmussen K.M. Associations of maternal obesity and psychosocial factors with breastfeeding intention, initiation, and duration Am. J. Clin. Nutr. 2014 99 524 534 10.3945/ajcn.113.071191 24401717 PMC3927688 22. Perez M.R. de Castro L.S. Chang Y.S. Sañudo A. Marcacine K.O. Amir L. Ross M.G. Coca K.P. Breastfeeding practices and problems among obese women compared with nonobese women in a Brazilian hospital Women’s Health Rep. 2021 2 219 226 10.1089/whr.2021.0021 PMC8243705 34235509 23. Dalrymple K.V. Briley A.L. Tydeman F.A.S. Seed P.T. Singh C.M. Flynn A.C. White S.L. Poston L. UPBEAT Consortium Breastfeeding behaviours in women with obesity; associations with weight retention and the serum metabolome: A secondary analysis of UPBEAT Int. J. Obes. 2024 48 1472 1480 10.1038/s41366-024-01576-6 PMC11420090 39048696 24. Nommsen-Rivers L.A. Wagner E.A. Roznowski D.M. Riddle S.W. Ward L.P. Thompson A. Measures of maternal metabolic health as predictors of severely low milk production Breastfeed. Med. 2022 17 566 576 10.1089/bfm.2021.0292 35475660 PMC9299530 25. Kent J.C. Mitoulas L.R. Cregan M.D. Ramsay D.T. Doherty D.A. Hartmann P.E. Volume and frequency of breastfeedings and fat content of breast milk throughout the day Pediatrics 2006 117 e387 e395 10.1542/peds.2005-1417 16510619 26. Jin X. Lai C.T. Perrella S.L. McEachran J.L. Gridneva Z. Geddes D.T. Maternal breast growth and body mass index are associated with low milk production in women Nutrients 2024 16 2854 10.3390/nu16172854 39275171 PMC11397153 27. Geddes D.T. The anatomy of the lactating breast: Latest research and clinical implications Infant 2007 3 59 63 28. Ramsay D.T. Kent J.C. Hartmann R.A. Hartmann P.E. Anatomy of the lactating human breast redefined with ultrasound imaging J. Anat. 2005 206 525 534 10.1111/j.1469-7580.2005.00417.x 15960763 PMC1571528 29. Thoresen M. Wesche J. Doppler measurements of changes in human mammary and uterine blood flow during pregnancy and lactation Acta Obstet. Gynecol. Scand. 1988 67 741 745 10.3109/00016349809004301 3250187 30. Geddes D.T. Aljazaf K.M. Kent J.C. Prime D.K. Spatz D.L. Garbin C.P. Lai C.T. Hartmann P.E. Blood flow characteristics of the human lactating breast J. Hum. Lact. 2012 28 145 152 10.1177/0890334411435414 22526342 31. Gridneva Z. Rea A. Weight D. McEachran J.L. Lai C.T. Perrella S.L. Geddes D.T. Maternal factors and breast anatomy and milk production during established lactation Proceedings 2023 93 11 10.3390/proceedings2023093011 PMC12470485 41003363 32. Prime D.K. Geddes D.T. Spatz D.L. Robert M. Trengove N.J. Hartmann P.E. Using milk flow rate to investigate milk ejection in the left and right breasts during simultaneous breast expression in women Int. Breastfeed. J. 2009 4 10 10.1186/1746-4358-4-10 19852864 PMC2774287 33. Vorherr H. The Breast: Morphology, Physiology and Lactation Academic Press London, UK 1974 34. Boote E.J. AAPM/RSNA physics tutorial for residents: Topics in US: Doppler US techniques: Concepts of blood flow detection and flow dynamics Radiographics 2003 23 1315 1327 10.1148/rg.235035080 12975518 35. Bude R.O. Rubin J.M. Relationship between the resistive index and vascular compliance and resistance Radiology 1999 211 411 417 10.1148/radiology.211.2.r99ma48411 10228522 36. Calculating Cup Volume and Breast Weight Available online: https://en.wikipedia.org/wiki/Bra_size#cite_note-Plussize_Chart-103 (accessed on 30 January 2025) 37. Gridneva Z. Rea A. Hepworth A.R. Ward L.C. Lai C.T. Hartmann P.E. Geddes D.T. Relationships between breastfeeding patterns and maternal and infant body composition over the first 12 months of lactation Nutrients 2018 10 45 10.3390/nu10010045 29303992 PMC5793273 38. Ward L.C. Isenring E. Dyer J.M. Kagawa M. Essex T. Resistivity coefficients for body composition analysis using bioimpedance spectroscopy: Effects of body dominance and mixture theory algorithm Physiol. Meas. 2015 36 1529 1549 10.1088/0967-3334/36/7/1529 26034992 39. VanItallie T.B. Yang M.U. Heymsfield S.B. Funk R.C. Boileau R.A. Height-normalized indices of the body’s fat-free mass and fat mass: Potentially useful indicators of nutritional status Am. J. Clin. Nutr. 1990 52 953 956 10.1093/ajcn/52.6.953 2239792 40. Kent J. Hepworth A. Sherriff J. Cox D. Mitoulas L. Hartmann P. Longitudinal changes in breastfeeding patterns from 1 to 6 months of lactation Breastfeed. Med. 2013 8 401 407 10.1089/bfm.2012.0141 23560450 41. Neville M.C. Keller R. Seacat J. Lutes V. Neifert M. Casey C. Allen J. Archer P. Studies in human lactation: Milk volumes in lactating women during the onset of lactation and full lactation Am. J. Clin. Nutr. 1988 48 1375 1386 10.1093/ajcn/48.6.1375 3202087 42. Tie W.J. Kent J.C. Lai C.T. Rea A. Hepworth A.R. Murray K. Geddes D.T. Reproducibility of the creamatocrit technique for the measurement of fat content in human milk Food Chem. 2021 356 129708 10.1016/j.foodchem.2021.129708 33845253 43. Kent J.C. Mitoulas L.R. Cregan M.D. Geddes D.T. Larsson M. Doherty D.A. Hartmann P.E. Importance of vacuum for breastmilk expression Breastfeed. Med. 2008 3 11 19 10.1089/bfm.2007.0028 18333764 44. Kent J.C. Ramsay D.T. Doherty D. Larsson M. Hartmann P.E. Response of breasts to different stimulation patterns of an electric breast pump J. Hum. Lact. 2003 19 179 186 10.1177/0890334403252473 12744535 45. Batushansky A. Toubiana D. Fait A. Correlation-based network generation, visualization, and analysis as a powerful tool in biological studies: A case study in cancer cell metabolism BioMed Res. Int. 2016 2016 8313272 10.1155/2016/8313272 27840831 PMC5090126 46. Epskamp S. Cramer A.O.J. Waldorp L.J. Schmittmann V.D. Borsboom D. qgraph: Network Visualizations of Relationships in Psychometric Data J. Stat. Softw. 2012 48 1 18 10.18637/jss.v048.i04 47. Jamshidian M. Mata M. 2-Advances in Analysis of Mean and Covariance Structure when Data are Incomplete Handbook of Computing and Statistics with Applications Lee S.-Y. Handbook of Latent Variable and Related Models North-Holland Amsterdam, The Netherlands 2007 21 44 48. Gehlenborg N. Wong B. Points of View: Heat maps Nat. Methods 2012 9 213 10.1038/nmeth.1902 27974286 49. Gallagher D. Heymsfield S.B. Heo M. Jebb S.A. Murgatroyd P.R. Sakamoto Y. Healthy percentage body fat ranges: An approach for developing guidelines based on body mass index Am. J. Clin. Nutr. 2000 72 694 701 10.1093/ajcn/72.3.694 10966886 50. Geddes D.T. Inside the lactating breast: The latest anatomy research J. Midwifery Women’s Health 2007 52 556 563 10.1016/j.jmwh.2007.05.004 17983992 51. Pang W.W. Hartmann P.E. Initiation of human lactation: Secretory differentiation and secretory activation J. Mammary Gland Biol. Neoplasia 2007 12 211 221 10.1007/s10911-007-9054-4 18027076 52. Russo J. Russo I.H. Development of the human breast Maturitas 2004 49 2 15 10.1016/j.maturitas.2004.04.011 15351091 53. Rose S.R. Municchi G. Barnes K.M. Kamp G.A. Uriarte M.M. Ross J.L. Cassorla F. Cutler G.B.J. Spontaneous growth hormone secretion increases during puberty in normal girls and boys J. Clin. Endocrinol. Metab. 1991 73 428 435 10.1210/jcem-73-2-428 1856268 54. Ankarberg-Lindgren C. Elfving M. Wikland K.A. Norjavaara E. Nocturnal application of transdermal estradiol patches produces levels of estradiol that mimic those seen at the onset of spontaneous puberty in girls J. Clin. Endocrinol. Metab. 2001 86 3039 3044 10.1210/jcem.86.7.7667 11443165 55. Oka T. Yoshimura M. Lavandero S. Wada K. Ohba Y. Control of growth and differentiation of the mammary gland by growth factors J. Dairy Sci. 1991 74 2788 2800 10.3168/jds.S0022-0302(91)78459-2 1918550 56. Kelly P.A. Bachelot A. Kedzia C. Hennighausen L. Ormandy C.J. Kopchick J.J. Binart N. The role of prolactin and growth hormone in mammary gland development Mol. Cell. Endocrinol. 2002 197 127 131 10.1016/S0303-7207(02)00286-1 12431805 57. Wysolmerski J.J. McCaughern-Carucci J.F. Daifotis A.G. Broadus A.E. Philbrick W.M. Overexpression of parathyroid hormone-related protein or parathyroid hormone in transgenic mice impairs branching morphogenesis during mammary gland development Development 1995 121 3539 3547 10.1242/dev.121.11.3539 8582268 58. Cox D.B. Kent J.C. Casey T.M. Owens R.A. Hartmann P.E. Breast growth and the urinary excretion of lactose during human pregnancy and early lactation: Endocrine relationships Exp. Physiol. 1999 84 421 434 10.1111/j.1469-445X.1999.01807.x 10226182 59. Delort L. Rossary A. Farges M.C. Vasson M.P. Caldefie-Chézet F. Leptin, adipocytes and breast cancer: Focus on inflammation and anti-tumor immunity Life Sci. 2015 40 37 48 10.1016/j.lfs.2015.04.012 25957709 60. Shan-Ni L. Liang H. Yasui Y. Ninomiya K. Uehara T. Nishimura T. Kobayashi K. Leptin on the apical surface inhibits casein production and STAT5 phosphorylation in mammary epithelial cells Exp. Cell Res. 2024 443 114330 10.1016/j.yexcr.2024.114330 39536931 61. Andreas N.J. Hyde M.J. Gale C. Parkinson J.R.C. Jeffries S. Holmes E. Modi N. Effect of maternal body mass index on hormones in breast milk: A systematic review PLoS ONE 2014 9 e115043 10.1371/journal.pone.0115043 25536196 PMC4275218 62. Savino F. Liguori S.A. Petrucci E. Lupica M.M. Fissore M.F. Oggero R. Silvestro L. Evaluation of leptin in breast milk, lactating mothers and their infants Eur. J. Clin. Nutr. 2010 64 972 977 10.1038/ejcn.2010.105 20588294 63. Montana A.V. Mildon A. Daniel A.I. Pitino M.A. Baxter J.B. Beggs M.R. Unger S.L. O’Connor D.L. Walton K. Is maternal body weight or composition associated with onset of lactogenesis II, human milk production, or infant consumption of mother’s own milk? A systematic review and meta-analysis Adv. Nutr. 2024 15 100228 10.1016/j.advnut.2024.100228 38609047 PMC11163153 64. Ard J. Huett-Garcia A. Bildner M. Tackling the complexity of obesity in the US through adaptation of public health strategies Front. Public Health 2025 13 1477401 10.3389/fpubh.2025.1477401 40236318 PMC11996779 65. Christensen K. Nielsen M.O. Bauer R. Hilden K. Evaluation of mammary blood flow measurements in lactating goats using the ultrasound doppler principle Comp. Biochem. Physiol. 1989 92 385 392 10.1016/0300-9629(89)90580-X 2565789 66. Stelwagen K. Davis S.R. Farr V.C. Prosser C.G. Sherlock R.A. Mammary epithelial cell tight junction integrity and mammary blood flow during an extended milking interval in goats J. Dairy Sci. 1994 77 426 432 10.3168/jds.S0022-0302(94)76969-1 8182166 67. Linzell J. Mammary blood flow and methods of identifying and measuring precursors of milk Lactation Larson B.L. Smith V.R. Academic Press New York, NY, USA 1974 Volume 1 143 68. Maltz E. Blatchford D.R. Peaker M. Effects of frequent milking on milk secretion and mammary blood flow in the goat Q. J. Exp. Physiol. 1984 69 127 132 10.1113/expphysiol.1984.sp002773 6718677 69. Lacasse P. Prosser C.G. Mammary blood flow does not limit milk yield in lactating goats J. Dairy Sci. 2003 86 2094 2097 10.3168/jds.S0022-0302(03)73798-9 12836945 70. Horsley K. Chaput K. Da Costa D. Nguyen T.V. Dayan N. Tomfohr-Madsen L. Tough S. Hypertensive disorders of pregnancy and breastfeeding practices: A secondary analysis of data from the All Our Families Cohort Acta Obstet. Gynecol. Scand. 2022 101 871 879 10.1111/aogs.14378 35610941 PMC9564688 71. Kanguru L. McCaw-Binns A. Bell J. Yonger-Coleman N. Wilks R. Hussein J. The burden of obesity in women of reproductive age and in pregnancy in a middle-income setting: A population based study from Jamaica PLoS ONE 2017 12 e0188677 10.1371/journal.pone.0188677 29236710 PMC5728527 72. Lin J. Ye S. Ke H. Lin L. Wu X. Guo M. Jiao B. Chen C. Zhao L. Changes in the mammary gland during aging and its links with breast diseases Acta Biochim. Biophys. Sin. 2023 55 1001 1019 10.3724/abbs.2023073 37184281 PMC10326422 73. Sabek A. Li C. Du C. Nan L. Ni J. Elgazzar E. Ma Y. Salem A.Z.M. Zhang S. Effects of parity and days in milk on milk composition in correlation with β-hydroxybutyrate in tropic dairy cows Trop. Anim. Health Prod. 2021 53 270 10.1007/s11250-021-02690-7 33876309 74. Hinde K. Power M.L. Oftedal O.T. Rhesus macaque milk: Magnitude, sources, and consequences of individual variation over lactation Am. J. Phys. Anthropol. 2009 138 148 157 10.1002/ajpa.20911 18711734 PMC2615798 75. Kent J.C. Ashton E. Hardwick C.M. Rea A. Murray K. Geddes D.T. Causes of perception of insufficient milk supply in Western Australian mothers Matern. Child. Nutr. 2021 17 e13080 10.1111/mcn.13080 32954674 PMC7729526 76. Ingram J.C. Woolridge M.W. Greenwood R.J. McGrath L. Maternal predictors of early breast milk output Acta Paediatr. 1999 88 493 499 10.1111/j.1651-2227.1999.tb00164.x 10426170 77. Ingram J. Woolridge M. Greenwood R. Breastfeeding: It is worth trying with the second baby Lancet 2001 358 986 987 10.1016/S0140-6736(01)06126-8 11583756 78. Butte N.F. Garza C. Stuff J.E. Smith E.O. Nichols B.L. Effect of maternal diet and body composition on lactational performance Am. J. Clin. Nutr. 1984 39 296 306 10.1093/ajcn/39.2.296 6695830 79. Dewey K.G. Lönnerdal B. Infant self-regulation of breast milk intake Acta Paediatr. 1986 75 893 898 10.1111/j.1651-2227.1986.tb10313.x 3564971 80. Rattigan S. Ghisalberti A.V. Hartmann P.E. Breast-milk production in Australian women Br. J. Nutr. 1981 45 243 249 10.1079/BJN19810100 7213579 81. Sausjord I.K. Acton L.W. White K.O. O’Connor S.K. Lerner N.M. Breastfeeding and hormonal contraception: A sscoping review of clinical guidelines, professional association recommendations, and the literature Breastfeed. Med. 2023 18 645 665 10.1089/bfm.2023.0118 37672571 82. Potten C.S. Watson R.J. Williams G.T. Tickle S. Roberts S.A. Harris M. Howel l.A. The effect of age and menstrual cycle upon proliferative activity of the normal human breast Br. J. Cancer 1988 58 163 170 10.1038/bjc.1988.185 3166907 PMC2246757 83. Longacre T.A. Bartow S.A. A correlative morphologic study of human breast and endometrium in the menstrual cycle Am. J. Surg. Pathol. 1986 10 382 393 10.1097/00000478-198606000-00003 3717495 84. Chao S. The effect of lactation on ovulation and fertility Clin. Perinatol. 1987 14 39 50 10.1016/S0095-5108(18)30780-2 3549114 85. Pérez A. Labbok M.H. Queenan J.T. Clinical study of the lactational amenorrhoea method for family planning Lancet 1992 339 968 970 10.1016/0140-6736(92)91538-J 1348806 86. Hartmann P.E. Prosser C.G. Acute changes in the composition of milk during the ovulatory menstrual cycle in lactating women J. Physiol. 1982 324 21 30 10.1113/jphysiol.1982.sp014098 7097597 PMC1250691 87. Martin C.R. Ling P.R. Blackburn G.L. Review of infant feeding: Key features of breast milk and infant formula Nutrients 2016 8 279 10.3390/nu8050279 27187450 PMC4882692 88. Scanlon K.S. Alexander M.P. Serdula M.K. Davis M.K. Bowman B.A. Assessment of infant feeding: The validity of measuring milk intake Nutr. Rev. 2002 60 235 251 10.1301/002966402320289368 12199299 89. Ng C.D. Biases in self-reported height and weight measurements and their effects on modeling health outcomes SSM-Popul. Health 2019 7 100405 10.1016/j.ssmph.2019.100405 31193386 PMC6527819 90. Coughlin S.S. Recall bias in epidemiologic studies J. Clin. Epidemiol. 1990 43 87 91 10.1016/0895-4356(90)90060-3 2319285 91. Bean J.A. Leeper J.D. Wallace R.B. Sherman B.M. Jagger H. Variations in the reporting of menstrual histories Am. J. Epidemiol. 1979 109 181 185 10.1093/oxfordjournals.aje.a112673 425957 92. Rolan E.P. Robertson O. Nonkovic N. Marceau K. Reliability of prospective and retrospective maternal reports of prenatal experiences BMC Pregnancy Childbirth 2022 22 968 10.1186/s12884-022-05286-7 36575374 PMC9793511 93. Dewey K.G. Maternal and fetal stress are associated with impaired lactogenesis in humans J. Nutr. 2001 131 3012S 3015S 10.1093/jn/131.11.3012S 11694638 94. Nagel E.M. Howland M.A. Pando C. Stang J. Mason S.M. Fields D.A. Demerath E.W. Maternal psychological distress and lactation and breastfeeding outcomes: A narrative review Clin. Ther. 2022 44 215 227 10.1016/j.clinthera.2021.11.007 34937662 PMC8960332 95. Anderson N.K. Beerman K.A. McGuire M.A. Dasgupta N. Grinari J.M. Williams J. McGuire M.K. Dietary fat type influences total milk fat content in lean women J. Nutr. 2005 135 416 421 10.1093/jn/135.3.416 15735072 96. Nommsen L.A. Lovelady C.A. Heinig M. Lonnerdal B. Dewey K.G. Determinants of energy, protein, lipid, and lactose concentrations in human milk during the first 12 mo of lactation: The DARLING Study Am. J. Clin. Nutr. 1991 53 457 465 10.1093/ajcn/53.2.457 1989413 97. Öner Sayar C. Köseoğlu S.Z.A. Evaluation of the effect of different diets applied to breastfeeding mothers on the composition and quantity of human milk Eur. J. Clin. Nutr. 2025 79 660 666 10.1038/s41430-025-01588-z 40065103 PMC12274128 98. González-Cossío T. Habicht J. Rasmussen K.M. Delgado H.L. Impact of food supplementation during lactation on infant breast-milk intake and on the proportion of infants exclusively breast-fed J. Nutr. 1998 128 1692 1702 10.1093/jn/128.10.1692 9772138 99. ESPGHAN Committee on Nutrition Agostoni C. Braegger C. Decsi T. Kolacek S. Koletzko B. Michaelsen K.F. Mihatsch W. Moreno L. Puntis J. Breast-feeding: A commentary by the ESPGHAN Committee on Nutrition J. Pediatr. Gastroenterol. Nutr. 2009 49 112 125 10.1097/MPG.0b013e31819f1e05 19502997 Figure 1 Ultrasound image of the lactating breast showing main milk ducts (dark, hypoechoic) within the breast, under the areola. Glandular tissue is hyperechoic and the fat more hypoechoic compared to the glandular tissue. Figure 2 Colour flow Doppler imaging of the internal mammary artery visualised as the coloured vessel within the green box. The colours represent velocity of the blood flow. A, peak systolic velocity; B, end diastolic velocity as measured by pulsed wave doppler sampled within the internal mammary artery. Figure 3 The correlation matrix results ( n 2 3 2 2 Figure 4 The correlation coefficients between breast anatomy parameters and maternal characteristics including adiposity. IMA, intra mammary artery; MD, milk ducts. Dark blue represents strong positive and dark pink strong negative correlations. Figure 5 The correlation coefficients between 24 h milk production parameters and maternal characteristics, maternal adiposity, and breast anatomy parameters. IMA, intra mammary artery; MD, milk ducts; and PAMR, percentage of available milk removed. Dark blue represents strong positive and dark pink strong negative correlations. Figure 6 The correlation coefficients between maternal characteristics and maternal body composition parameters. Dark blue represents strong positive and dark pink strong negative correlations. Grey colour—not applicable. Figure 7 The findings of this study suggest that several modifiable and non-modifiable maternal factors may potentially lead to compromised breast development and impact milk production (red arrows). On the contrary, epigenetic changes from the first or previous lactations may positively impact the robustness of subsequent lactations (blue arrows). jimaging-11-00313-t001_Table 1 Table 1 Maternal demographic and anthropometric characteristics. Maternal Characteristics ( n Mean (SD) or n Age (years) 33.1 ± 4.6 1 Highest education level n High school 2 (6.5) Certificate/apprenticeship 24 (77.4) Tertiary degree 5 (16.1) Race n Australian 27 (90.0) Asian 1 (3.3) Other 2 (6.7) Anhropometrics and BC with BIS n BC measurement time (months postpartum) 4.0 ± 1.2 Weight (kg) 73.7 ± 12.7 Height (cm) 167.1 ± 6.7 Body mass index (kg/m 2 26.4 ± 4.6 Fat-free mass (kg) 45.4 ± 6.0 Fat-free mass index (kg/m 2 16.3 ± 2.1 Fat mass (kg) 28.3 ± 8.2 Fat mass index (kg/m 2 10.2 ± 3.0 Fat mass (%) 37.8 ± 5.4 Fat mass/fat-free mass ratio 0.62 ± 0.14 Breast volume (cm 3 791 ± 231 1 n jimaging-11-00313-t002_Table 2 Table 2 Participants’ reproductive and obstetric history. Maternal and Infant Characteristics Mean (SD) or n Maternal characteristics n Parity (primiparous) 20 (58.8) 1 Previous lactation(s) duration (months) 2 24.7 ± 15.5 Age at menarche (years) 3 12.7 ± 1.7 Breast growth during puberty (yes) 4 16 (76.2) Breast growth during pregnancy (yes) 31 (91.2) Cycle commensed prior to study visit (yes) 6 (17.6) Current use of hormonal contraception (yes) 7 (20.6) Cycle commenced + hormonal contraception use (yes) 2 (5.9) Birth details n Birth gestation (weeks) 39.3 ± 1.0 Vaginal birth 19 (55.9) Elective cesarean 10 (29.4) Non-elective cesarean 5 (14.7) 1 n 2 n 3 n 4 n jimaging-11-00313-t003_Table 3 Table 3 Breast anatomy parameters. Parameters ( n Mean (SD) or n Milk ducts’ measurements n Total MD number 11.2 ± 3.0 1 MD number in inferior half of the breast 7.8 ± 2.5 MD number in superior half of the breast 3.4 ± 1.8 Mean MD diameter 2 1.6 ± 0.5 Mean MD diameter in inferior half of the breast 2 1.6 ± 0.5 Mean MD diameter in superior half of the breast 2 1.9 ± 0.8 Sum of MD diameters 18.4 ± 7.0 Sum of MD diameters in inferior of the breast 12.4 ± 5.5 Sum of MD diameters in superior half of the breast 6.0 ± 3.4 Glandular tissue representation (GTR) n Low (<30%) 5 (14.7) Moderate (30–70%) 10 (29.4) High (>70%) 19 (55.9) Resistive index measurements n IMA peak systolic velocity (cm/s) 39.3 ± 18.9 IMA end diastolic velocity (cm/s) 17.6 ± 9.3 IMA resistive index 1.3 ± 0.4 1 n 2 n jimaging-11-00313-t004_Table 4 Table 4 The 24 h milk production parameters. Parametres ( n Mean (SD) Total 24 h MP (g) 809 ± 235 1 24 h MP, test breast 2 429 ± 144 Average feed, test breast (g) 76.0 ± 36.1 Maximum feed, test breast (g) 122.0 ± 54.3 Average PAMR, test breast (%) 62.8 ± 13.9 Breast storage capacity, test breast (g) 197.5 ± 78.7 1 2 ",
  "metadata": {
    "Title of this paper": "Breast-feeding: A commentary by the ESPGHAN Committee on Nutrition",
    "Journal it was published in:": "Journal of Imaging",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470485/"
  }
}