{
  "title": "Paper_376",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12484806 PMC12484806.1 12484806 12484806 41028821 10.1038/s41598-025-11573-y 11573 1 Article Integrated proteome, phospho-proteome and malonyl-proteome revealed a molecular alteration of breast cancer Guo Chenxu Zhang Mingliang Jin Xin Zhu Chao Xu Rui Sun Jiahe Qian Jun qianjun215036@sina.com Department of Surgical Oncology, The First Affiliated Hospital of Bengbu Medical University, Bengbu, China 30 9 2025 2025 15 478255 34004 6 8 2024 10 7 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Breast cancer is a heterogeneous disease with a high incidence, but its proteomes have not yet been thoroughly characterized. To construct a comprehensive dynamic network of breast cancer-related proteins, we integrated the whole-cell proteome (WCP), phospho-proteome, malonyl-proteome of breast cancer tumor tissues and adjacent healthy tissues. We identified 2,417 differentially expressed proteins (DEPs), 646 differentially phosphorylated proteins (DPPs), and 107 differentially malonylated proteins (DMPs). Functional enrichment analysis revealed that these differentially expressed proteins are involved in extracellular matrix (ECM) interactions and immune-related pathways. Protein‒protein interaction (PPI) analysis revealed posttranslational modification (PTM) crosstalk between proteins involved in phosphorylation and malonylation. The acetyltransferase EP300 and deacetylase HDAC1 are involved in the DPP network, whereas the phosphatase PKM is a hub protein in the DMP network. Kinase-substrate enrichment analysis (KSEA) revealed the activation of the kinases CSNK1D, ROCK1, ROCK2, and CDK2. Overall, this study provides a foundation for understanding the functions of phosphorylation and malonylation in breast cancer. It systematically reveals critical features of breast cancer, providing a resource for exploring PTM crosstalk within and across proteins involved in the disease. Supplementary Information The online version contains supplementary material available at 10.1038/s41598-025-11573-y. Keywords Breast cancer Posttranslational modification Phosphorylation Malonylation Subject terms Breast cancer Kinases Metabolomics 2023 Bengbu Medical University Science and Technology Project Natural Science key project 2023byzd055 2023byzd055 2023byzd055 2023byzd055 2023byzd055 2023byzd055 2023byzd055 Guo Chenxu Zhang Mingliang Jin Xin Zhu Chao Xu Rui Sun Jiahe Qian Jun pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Breast cancer is a major global health concern, representing a significant proportion of cancer cases in women 1 2 3 4 Advances in high-throughput sequencing technologies have significantly enhanced our understanding of gene‒phenotype associations in tumor tissues. Comprehensive transcriptomic analyses of various tumor types have provided valuable insights into the mechanisms of tumor proliferation, invasion, and recurrence 5 7 8 A comprehensive understanding of cancer development and progression requires in-depth proteomic research. Extensive proteomic data can ultimately guide the development of more effective therapeutic strategies, bridging the gap between transcriptomic data and clinical outcomes 9 10 11 PTMs are generally enzymatic modifications of proteins following protein biosynthesis that significantly impact cancer occurrence and progression by influencing key mechanisms such as signal transduction, protein stability, subcellular localization, protein interactions, and metabolic rates 12 13 14 Phosphorylation, which occurs on serine, threonine, and tyrosine residues, is a common PTM involved in cell signaling, cell cycle control, and apoptosis 15 16 17 18 19 Malonylation is an emerging form of protein acylation that occurs on lysine residues 20 21 22 23 24 25 22 To further elucidate the mechanisms underlying breast cancer, we systematically integrated proteomics, succinylproteomics, and phosphoproteomics to identify critical features of proteins and posttranslational modifications. This comprehensive profiling could contribute to the development of novel biomarkers and targeted therapeutics. Results Overview of multilevel proteomics To investigate the posttranslational modifications (PTMs) involved in breast cancer, we analyzed the changes in the whole-cell proteome (WCP), phospho-proteome, and malonyl-proteome of breast cancer tumor tissues and adjacent healthy tissues (Fig. 1 1 S1 1 S1 1  Fig. 1 Overview of multilevel proteomics. ( a 66 b n c n d Profiles of deps in the whole-cell proteome In the WCP, we identified a total of 7,459 proteins, with 1,630 notably upregulated and 787 significantly downregulated in tumor tissues (Fig. 2 2 2  Fig. 2 Characteristics of the differentially expressed proteins (DEPs). ( a b c Functional enrichment analysis of deps Next, we performed functional enrichment analysis on the differentially expressed proteins (DEPs). KEGG enrichment analysis (Fig. 3 S2  Fig. 3 Functional analysis of DEPs. ( a b c d p p p To further investigate the potential biological functions of these proteins, we divided the differentially expressed proteins into four groups on the basis of FC (Fig. 3 3 Profiles of DPPs and motif analysis of phosphorylation sites In the phospho-proteome, we identified a total of 4,870 proteins (569 upregulated and 787 downregulated) and 18,108 phosphorylation sites (787 upregulated and 1,154 downregulated) (Fig. 4 4  Fig. 4 Characteristics of the differentially phosphorylated proteins (DPPs). ( a b c d The phosphorylation sites exhibited a certain degree of conservation, and we used Motif-X to analyze the frequency of sequence motifs around the modification site (Fig. 4 4 26 27 28 In our study, we found some transcription factors, such as CREB1, STAT3, FOXA1, were DPPs. For example, STAT3 phosphorylation at tyrosine 705 (pSTAT3 Y705) was downregulated. STAT3 dimerization, nuclear translocation and transcriptional activity required for pSTAT3 Y705 29 Profiles of DMPs and motif analysis of Kma sites In the malonyl proteome, we identified 107 differentially malonylated proteins (DMPs), with 116 upregulated and 110 downregulated malonylation-lysine (Kma) sites (Fig. 5 5  Fig. 5 Characteristics of the DMPs. ( a b c d Motif analysis revealed that alanine (A), glycine (G), and valine (V) were enriched around the Kma sites, whereas proline (P), arginine (R), tryptophan (W), and glutamine (Q) were less common near the Kma sites (Fig. 5 30 Moreover, we predicted the subcellular localization of DMPs (Fig. 5 29 31 32 6  Fig. 6 Statistical analysis chart of the four groups DPPs ( a b c d Functional enrichment analysis of DPPs and DMPs Similarly, we classified DPPs and DMPs into four groups on the basis of their fold changes (Fig. 6 6 DMPs in the Q1 group were enriched mainly in the ECM‒receptor interaction, focal adhesion, and PI3K‒Akt signaling pathways; those in the Q2 group were enriched in metabolic pathways such as galactose metabolism, glycolysis and glycerolipid metabolism; those in the Q3 group were not enriched in any pathway; and those in the Q4 group were enriched in base excision repair, NF-κB pathway, and pyrimidine metabolism (Fig. 6 Network analysis of PTMs We performed PPI network analysis on the DPPs and DMPs. As shown in Fig. 7 7  Fig. 7 Protein–protein interaction network of DPPs ( a b Moreover, we performed Kinase-Substrate Enrichment Analysis (KSEA) for analysis kinase activity, which scores each candidate kinase based on the relative hyperphosphorylation or dephosphorylation of most substrates. KSEA results indicated marked activation of the kinases CSNK1D, ROCK1, ROCK2, and CDK2 and inhibition of CSNK2A2, PDPK1, CLK1, CSNK2A1, and SRC (Supplementary Fig. S3, Supplementary Table S2 Discussion Proteomics has provided insights into breast cancer. Anurag et al. performed proteogenomics to explore the molecular basis for triple-negative breast cancer and reported the activation of DNA repair, E2F targets, the G2-M checkpoint, interferon-gamma signaling, and immune checkpoint pathways 10 33 34 35 36 37 The enrichment of these differential pathways may be closely related to significant changes in the tumor immune microenvironment (TIME) of breast cancer, indicating extensive immune cell infiltration in tumor tissues. Different types of infiltration have distinct effects on tumor tissues. For example, extensive infiltration of Treg cells hinders the host antitumor immune response and promotes tumor growth and metastasis 38 39 Posttranslational modifications (PTMs) are ubiquitous and play crucial roles in various cellular functions 40 41 42 43 44 45 We performed PTM proteomics to investigate the characteristics of phosphorylation and malonylation in breast cancer and revealed its potential significance. There have been no reports about malonylation in breast cancer. In the phosphorylation proteome, we identified a total of 4,870 phosphorylated proteins, among which PDCD11, SNPH, and TNAC2 presented significantly increased phosphorylation levels. PDCD11 can promote the G2/M transition in colorectal cancer (CRC) cells, facilitating tumor progression 46 Syntaphilin (SNPH) functions as an anchor, immobilizing mitochondria 47 48 49 50 Our KSEA results revealed significant upregulation of casein kinase 1 delta (CSNK1D) activity in breast cancer tissues. CSNK1D plays a tumor-promoting role in various cancers. Inhibition of CSNK1D can delay the growth of breast tumors 51 52 53 54 55 In the malonylation proteomics analysis, 107 DMPs were identified, with 116 upregulated Kma sites and 110 downregulated Kma sites. Among these, Ezrin (EZR) has multiple Kma sites, suggesting that it may play a significant role in cellular processes. EZR, a member of the Ezrin-Radixin-Moesin (ERM) family, interacts with cell surface adhesion molecules such as CD44, E-cadherin, and ICAM-1, regulating cell morphology and migration 56 57 56 20 20 22 KEGG enrichment analysis revealed that phosphorylation and malonylation modifications primarily impact tumor cell glycolipid metabolism, ECM interactions, and mismatch repair. These findings indicate that phosphorylation and malonylation may be associated with typical tumor cell features, including glycolipid metabolism, increased de novo fatty acid synthesis, and mismatch repair deficiencies. In summary, our study provides a proteomic overview of breast cancer and clarifies the changes in phosphorylation and malonylation in breast cancer tissues and paracancerous tissues. In addition, our study identified several novel protein markers that may have potential value in clinical diagnosis. Our study offers new insights into the complexity of breast cancer and lays the foundation for future research on breast cancer. Materials and methods Sample collection and clinical information Fresh tumor samples were collected from breast cancer patients at the First Affiliated Hospital of Bengbu Medical University. Breast cancer tumor tissues and adjacent nontumorous tissues from five patients were used for proteomic analysis. This study was approved by the Bengbu Medical College Ethics Committee (No. 2021KY165), all methods were carried out in accordance with relevant guidelines and regulations, and all patients provided written informed consent. Supplementary Table S1 Proteomics and PTM proteomics The samples were ground into a powder via liquid nitrogen and then lysed in four volumes of lysis buffer (1% Triton X-100, 1% protease inhibitors, 3 µM TSA, 50 mM NAM). The lysates were sonicated (227 W, 2 s on, 3 s off, for 10 min) and then centrifuged at 12,000 × g for 10 min at 4 °C. The supernatant was transferred to a new centrifuge tube, and the protein concentration was determined via a BCA assay, adjusting to a uniform concentration. TCA was added to a final concentration of 20%, the mixture was vortexed, and the mixture was allowed to precipitate at 4 °C for 2 h. The mixture was centrifuged at 4500 × g for 5 min, the supernatant was discarded, and the pellet was washed with prechilled acetone 2–3 times. After air-drying the pellet, TEAB was added to a final concentration of 200 mM, the pellet was resuspended, and trypsin was added at a 1: 50 ratio overnight digestion. Dithiothreitol (DTT) was added to the peptides at a final concentration of 5 mM, and the mixture was incubated at 56 °C for 30 min. IAA was then added to the mixture at a final concentration of 11 mM, and the mixture was incubated in the dark at room temperature for 15 min. Phosphorylated peptide enrichment Peptide mixtures were first incubated with IMAC microsphere suspensions with vibration in loading buffer (50% acetonitrile/0.5% acetic acid). To remove the nonspecifically adsorbed peptides, the IMAC microspheres were sequentially washed with 50% acetonitrile/ 0.5% acetic acid and 30% acetonitrile/ 0.1% trifluoroacetic acid. To elute the enriched phosphopeptides, elution buffer containing 10% NH 4 Malonylated peptide enrichment The peptide was dissolved in an IP buffer solution (100 mM NaCl, 1 mM EDTA, 50 mM Tris-HCl, 0.5% NP-40, pH 8.0). Then, the supernatant was transferred to prewashed antibody resin (PTM904, Jingjie Biotechnology) and placed on a rotating shaker at 4 °C with gentle shaking and an overnight incubation. After incubation, the resin was washed four times with IP buffer solution and twice with deionized water. Finally, the resin-bound peptide segment was eluted three times with 0.1% trifluoroacetic acid as the eluent. The eluent was collected and drained by vacuum freezing, followed by desalting according to the C18 ZipTips instructions before vacuum freezing and draining again for LC‒MS analysis. LC‒MS/MS analysis The peptides were dissolved in mobile phase A via liquid chromatography and separated via the Easy-nLC1000 ultrahigh-performance liquid phase system. The mobile phase consisted of solvent A (0.1% formic acid, 2% acetonitrile/in water) and solvent B (0.1% formic acid in acetonitrile). Peptides were separated with following gradient: 0–18 min, 2-22%B;18–22 min, 22-35%B; 22–26 min, 35-90%B; 26–30 min, 90%B. The peptide segment was subsequently injected into the capillary ion source for ionization and introduced into the timsTOF Pro mass spectrometer for data acquisition. The ion source voltage was set to 1.75 kV, and time-of-flight (TOF) analysis was employed to detect and analyze both the parent ions of the peptide segment and its secondary fragments. The data acquisition mode utilized is known as data-independent parallel cumulative serial fragmentation (DIA-PASEF) mode. After setting the scanning range of primary mass spectrometry from 300 to 1500 m/z, samples were collected in PASEF mode 20 times for each primary mass spectrometry scan. The full MS scan was set as100-1700 (MS/MS scan range) and 22 PASEF (MS/MS mode) -MS/MS scans were acquired per cycle. The MS/MS scan range was set as 395–1395 and isolation window was set as 20 m/z. Database search The DIA data were retrieved via the Spectronaut (v17) search engine with default parameters. The database utilized was “Homo_sapiens_9606_SP_20220107.fasta,” comprising 20,389 protein sequences. Trypsin/P was specified as the cleavage enzyme, allowing up to 2 missed cleavages. Carbamidomethylation of cysteine was designated as a fixed modification. Variable modifications included methionine oxidation (proteome, phospho-proteome), N-terminal protein acetylation (proteome, malonyl-proteome, phospho-proteome), lysine malonylation (malonyl-proteome), and phosphorylation of serine, threonine, and tyrosine (phospho-proteome). An inverse library was also incorporated to calculate the false discovery rate (FDR) resulting from random matching. The FDR for protein, peptide, and peptide-spectrum match (PSM) identification was set at 1%. Search results were filtered at 1% FDR, and the peptide confidence level was set for at least one unique peptides per protein for protein identification. The corresponding spectral library was imported into Spectronaut (v.17.0) software to predicts the retention time by nonlinear correction and searched against with DIA data. Bioinformatics methods The fold change (FC) was used to calculate the difference between tumor tissue (T) and adjacent nontumorous tissues (N). Fisher’s exact test was used to analyze the significance of functional enrichment of differentially expressed proteins. For phospho-proteome and malonyl-proteome, FC was calculated as the ratio of the mean relative quantification values for each modification site between two groups. The relative quantification values of the modification site are divided by the relative quantification values of its corresponding protein to eliminate the influence of protein expression on the modification expression. Differentially expressed proteins (DEPs), differentially phosphorylated proteins (DPPs) and differentially malonylated proteins (DMPs) were identified by an absolute value of FC > 1.5 and a p 58 59 63 Motif analysis utilized the MoMo analysis tool 64 p 65 For further hierarchical clustering based on differentially expressed protein functional classification. We collated all the categories obtained after enrichment along with their p p p 10 p p Electronic supplementary material Below is the link to the electronic supplementary material.  Supplementary Material 1  Supplementary Material 2 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements The study was supported by 2023 Bengbu Medical University Science and Technology Project Natural Science key project (2023byzd055). Author contributions Chenxu Guo and Jun Qian had full access to all of the data in the study and take responsibility for the integrity of the data and the accuracy of the data analysis. Mingliang Zhang and Xin Jin were involved in the study concepts and design. All authors (Chenxu Guo，Mingliang Zhang，Xin Jin，Chao Zhu，Rui Xu，Jiahe Sun and Jun Qian) involved in the acquisition, analysis and interpretation of data. Mingliang Zhang and Xin Jin supervised the analysis. Chenxu Guo and Jun Qian involved in the draft of the manuscript. All authors read, critically revised and approved the manuscript. Data availability The mass spectrometry proteomics data have been deposited to the iProX database (https://www.iprox.cn/page/DSV021.html;?url=1750831793988uOpk) with password tJ8g. Declarations Competing interests The authors declare no competing interests. References 1. BRAY F Global cancer statistics 2018: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries [J] Cancer J. Clin. 2018 68 6 394 424 10.3322/caac.21492 30207593 BRAY, F. et al. Global cancer statistics 2018: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries [J]. Cancer J. Clin. 68 10.3322/caac.21492 30207593 2. LEE, S. SHANTI A. Effect of exogenous pH on cell growth of breast Cancer cells [J]. Int. J. Mol. Sci. 22 10.3390/ijms22189910 PMC8464873 34576073 3. SCHMIDT, B. et al. Resveratrol, Curcumin and Piperine alter human glyoxalase 1 in MCF-7 breast Cancer cells [J]. Int. J. Mol. Sci. 21 10.3390/ijms21155244 PMC7432303 32721999 4. LICHTENSTEIN P Environmental and heritable factors in the causation of cancer–analyses of cohorts of twins from sweden, denmark, and Finland [J] N. Engl. J. Med. 2000 343 2 78 85 10.1056/NEJM200007133430201 10891514 LICHTENSTEIN, P. et al. Environmental and heritable factors in the causation of cancer–analyses of cohorts of twins from sweden, denmark, and Finland [J]. N. Engl. J. Med. 343 10891514 10.1056/NEJM200007133430201 5. LIU SQ Single-cell and spatially resolved analysis uncovers cell heterogeneity of breast cancer [J] J. Hematol. Oncol. 2022 15 1 19 10.1186/s13045-022-01236-0 35241110 PMC8895670 LIU, S. Q. et al. Single-cell and spatially resolved analysis uncovers cell heterogeneity of breast cancer [J]. J. Hematol. Oncol. 15 35241110 10.1186/s13045-022-01236-0 PMC8895670 6. PRADAT Y Integrative Pan-Cancer genomic and transcriptomic analyses of refractory metastatic Cancer [J] Cancer Discov. 2023 13 5 1116 1143 10.1158/2159-8290.CD-22-0966 36862804 PMC10157368 PRADAT, Y. et al. Integrative Pan-Cancer genomic and transcriptomic analyses of refractory metastatic Cancer [J]. Cancer Discov. 13 36862804 10.1158/2159-8290.CD-22-0966 PMC10157368 7. KEELAN, S. et al. Dynamic epi-transcriptomic landscape mapping with disease progression in Estrogen receptor-positive breast cancer [J]. Cancer communications (London, England), 43 10.1002/cac2.12407 PMC10174082 36670046 8. LIU Y BEYER A On the dependency of cellular protein levels on mRNA Abundance [J] Cell. 2016 165 3 535 550 27104977 10.1016/j.cell.2016.03.014 LIU, Y. & BEYER, A. On the dependency of cellular protein levels on mRNA. Abundance [J] Cell. 165 27104977 10.1016/j.cell.2016.03.014 9. FERRAROTTO, R. et al. Proteogenomic Analysis of Salivary Adenoid Cystic Carcinomas Defines Molecular Subtypes and Identifies Therapeutic Targets [J]. Clin. cancer research: official J. Am. Association Cancer Res. 27 10.1158/1078-0432.CCR-20-1192 PMC7854509 33172898 10. ANURAG M Proteogenomic markers of chemotherapy resistance and response in Triple-Negative breast Cancer [J] Cancer Discov. 2022 12 11 2586 2605 10.1158/2159-8290.CD-22-0200 36001024 PMC9627136 ANURAG, M. et al. Proteogenomic markers of chemotherapy resistance and response in Triple-Negative breast Cancer [J]. Cancer Discov. 12 36001024 10.1158/2159-8290.CD-22-0200 PMC9627136 11. KRUG K Proteogenomic landscape of breast Cancer tumorigenesis and targeted therapy [J] Cell 2020 183 5 1436 56e31 10.1016/j.cell.2020.10.036 33212010 PMC8077737 KRUG, K. et al. Proteogenomic landscape of breast Cancer tumorigenesis and targeted therapy [J]. Cell 183 33212010 10.1016/j.cell.2020.10.036 PMC8077737 12. CHEN L LIU S TAO Y Regulating tumor suppressor genes: post-translational modifications [J] Signal. Transduct. Target. Therapy 2020 5 1 90 10.1038/s41392-020-0196-9 PMC7293209 32532965 CHEN, L., LIU, S. & TAO, Y. Regulating tumor suppressor genes: post-translational modifications [J]. Signal. Transduct. Target. Therapy 5 10.1038/s41392-020-0196-9 PMC7293209 32532965 13. GEFFEN, Y. et al. Pan-cancer analysis of post-translational modifications reveals shared patterns of protein regulation [J]. Cell 186 10.1016/j.cell.2023.07.013 PMC10680287 37582358 14. YAO, S. U. N. L. & GUO, Z. Z, Et Al. Comprehensive Analysis of the Lysine Acetylome in Aeromonas hydrophila Reveals cross-talk between Lysine Acetylation and Succinylation in LuxS [J] 10.1080/22221751.2019.1656549 PMC6735345 31448697 15. BILBROUGH T PIEMONTESE E Dissecting the role of protein phosphorylation: a chemical biology toolbox [J] Chem. Soc. Rev. 2022 51 13 5691 5730 10.1039/D1CS00991E 35726784 BILBROUGH, T. & PIEMONTESE, E. Dissecting the role of protein phosphorylation: a chemical biology toolbox [J]. Chem. Soc. Rev. 51 35726784 10.1039/d1cs00991e 16. VIATOUR P Phosphorylation of NF-kappaB and IkappaB proteins: implications in cancer and inflammation [J] Trends Biochem. Sci. 2005 30 1 43 52 10.1016/j.tibs.2004.11.009 15653325 VIATOUR, P. et al. Phosphorylation of NF-kappaB and IkappaB proteins: implications in cancer and inflammation [J]. Trends Biochem. Sci. 30 15653325 10.1016/j.tibs.2004.11.009 17. ZHENG, L. et al. Roquin-1 Regulates Macrophage Immune Response and Participates in Hepatic Ischemia-Reperfusion Injury [J]. Journal of immunology (Baltimore, Md: 2020, 204(5): 1322-33. (1950). 10.4049/jimmunol.1900053 PMC7026771 31996460 18. ZHANG, X. et al. Matrine Inhibits the Development and Progression of Ovarian cancer by Repressing cancer Associated Phosphorylation Signaling Pathways [J] 10.1038/s41419-019-2013-3 PMC6787190 31601793 19. CHEN, X. et al. Activation of mTOR Mediates hyperglycemia-induced Renal Glomerular Endothelial Hyperpermeability Via the RhoA/ROCK/pMLC Signaling Pathway [J] 10.1186/s13098-021-00723-7 PMC8501565 34627341 20. FU Y Oncometabolites drive tumorigenesis by enhancing protein acylation: from chromosomal remodelling to nonhistone modification [J] J. Experimental Clin. cancer Research: CR 2022 41 1 144 10.1186/s13046-022-02338-w PMC9013066 35428309 FU, Y. et al. Oncometabolites drive tumorigenesis by enhancing protein acylation: from chromosomal remodelling to nonhistone modification [J]. J. Experimental Clin. cancer Research: CR 41 10.1186/s13046-022-02338-w PMC9013066 35428309 21. PENG C The first identification of lysine malonylation substrates and its regulatory enzyme [J] Mol. Cell. Proteomics: MCP 2011 10 12 M111012658 10.1074/mcp.M111.012658 PMC3237090 21908771 PENG, C. et al. The first identification of lysine malonylation substrates and its regulatory enzyme [J]. Mol. Cell. Proteomics: MCP 10 10.1074/mcp.M111.012658 PMC3237090 21908771 22. SHANG S LIU J HUA F Protein acylation: mechanisms, biological functions and therapeutic targets [J] Signal. Transduct. Target. Therapy 2022 7 1 396 10.1038/s41392-022-01245-y PMC9797573 36577755 SHANG, S., LIU, J. & HUA, F. Protein acylation: mechanisms, biological functions and therapeutic targets [J]. Signal. Transduct. Target. Therapy 7 10.1038/s41392-022-01245-y PMC9797573 36577755 23. GALVáN-PEñA S Malonylation of GAPDH is an inflammatory signal in macrophages [J] Nat. Commun. 2019 10 1 338 10.1038/s41467-018-08187-6 30659183 PMC6338787 GALVáN-PEñA, S. et al. Malonylation of GAPDH is an inflammatory signal in macrophages [J]. Nat. Commun. 10 30659183 10.1038/s41467-018-08187-6 PMC6338787 24. COLAK, G. et al. DAI L,. Proteomic and Biochemical Studies of Lysine Malonylation Suggest Its Malonic Aciduria-associated Regulatory Role in Mitochondrial Function and Fatty Acid Oxidation [J]. Molecular & cellular proteomics: MCP, 14(11): 3056-71. (2015). 10.1074/mcp.M115.048850 PMC4638046 26320211 25. BRUNING, U. et al. Impairment of angiogenesis by fatty acid synthase Inhibition involves mTOR malonylation [J]. Cell Metabol. 28 10.1016/j.cmet.2018.07.019 PMC8057116 30146486 26. WHITMARSH A J, DAVIS RJ Regulation of transcription factor function by phosphorylation [J] Cell. Mol. Life Sci. 2000 57 8–9 1172 1183 10.1007/PL00000757 11028910 PMC11146857 WHITMARSH A J, DAVIS, R. J. Regulation of transcription factor function by phosphorylation [J]. Cell. Mol. Life Sci. 57 11028910 10.1007/PL00000757 PMC11146857 27. DüSTER R Structural basis of Cdk7 activation by dual T-loop phosphorylation [J] Nat. Commun. 2024 15 1 6597 10.1038/s41467-024-50891-z 39097586 PMC11297931 DüSTER, R. et al. Structural basis of Cdk7 activation by dual T-loop phosphorylation [J]. Nat. Commun. 15 39097586 10.1038/s41467-024-50891-z PMC11297931 28. GUTIERREZ H DAVIES AM Regulation of neural process growth, elaboration and structural plasticity by NF-κB [J] Trends Neurosci. 2011 34 6 316 325 10.1016/j.tins.2011.03.001 21459462 PMC3115056 GUTIERREZ, H. & DAVIES, A. M. Regulation of neural process growth, elaboration and structural plasticity by NF-κB [J]. Trends Neurosci. 34 21459462 10.1016/j.tins.2011.03.001 PMC3115056 29. HONG J Y, CHUNG K S, SHIN, J. S. et al. The Anti-Proliferative activity of the hybrid TMS-TMF-4f compound against human cervical Cancer involves apoptosis mediated by STAT3 inactivation [J]. Cancers 11 10.3390/cancers11121927 PMC6966466 31816985 30. VINOGRADOV A A, CHANG J S, ONAKA H Accurate models of substrate preferences of Post-Translational modification enzymes from a combination of mRNA display and deep learning [J] ACS Cent. Sci. 2022 8 6 814 824 10.1021/acscentsci.2c00223 35756369 PMC9228559 VINOGRADOV A A, CHANG J S, ONAKA, H. et al. Accurate models of substrate preferences of Post-Translational modification enzymes from a combination of mRNA display and deep learning [J]. ACS Cent. Sci. 8 35756369 10.1021/acscentsci.2c00223 PMC9228559 31. NISHIDA Y, RARDIN M J, CARRICO C SIRT5 regulates both cytosolic and mitochondrial protein malonylation with Glycolysis as a major target [J] Mol. Cell 2015 59 2 321 332 10.1016/j.molcel.2015.05.022 26073543 PMC4571487 NISHIDA Y, RARDIN M J, CARRICO, C. et al. SIRT5 regulates both cytosolic and mitochondrial protein malonylation with Glycolysis as a major target [J]. Mol. Cell 59 26073543 10.1016/j.molcel.2015.05.022 PMC4571487 32. CARRICO C The mitochondrial acylome emerges: proteomics, regulation by sirtuins, and metabolic and disease implications [J] Cell Metabol. 2018 27 3 497 512 10.1016/j.cmet.2018.01.016 PMC5863732 29514063 CARRICO, C. et al. The mitochondrial acylome emerges: proteomics, regulation by sirtuins, and metabolic and disease implications [J]. Cell Metabol. 27 10.1016/j.cmet.2018.01.016 PMC5863732 29514063 33. YEN T Y, WONG, R. et al. Over-Expression of RNA processing, heat shock, and DNA repair proteins in breast tumor compared to normal tissue [J]. Proteomics 10.1002/pmic.202000044 PMC7855622 32663359 34. BRESNICK A R WEBER D J ZIMMER D B S100 proteins in cancer [J] Nat. Rev. Cancer 2015 15 2 96 109 10.1038/nrc3893 25614008 PMC4369764 BRESNICK A R, WEBER D J & ZIMMER D B S100 proteins in cancer [J]. Nat. Rev. Cancer 15 25614008 10.1038/nrc3893 PMC4369764 35. CHEN Y S100A8 and S100A9 in Cancer [J] Biochim. Et Biophys. Acta Reviews cancer 2023 1878 3 188891 10.1016/j.bbcan.2023.188891 37001615 CHEN, Y. et al. S100A8 and S100A9 in Cancer [J]. Biochim. Et Biophys. Acta Reviews cancer 1878 10.1016/j.bbcan.2023.188891 37001615 36. CHEN, Y. et al. Critical Role of the MCAM-ETV4 axis Triggered by Extracellular S100A8/A9 in Breast cancer Aggressiveness [J] 10.1016/j.neo.2019.04.006 PMC6520639 31100639 37. ZHANG X S100A8/A9 as a risk factor for breast cancer negatively regulated by DACH1 [J] Biomark. Res. 2023 11 1 106 10.1186/s40364-023-00548-8 38093319 PMC10720252 ZHANG, X. et al. S100A8/A9 as a risk factor for breast cancer negatively regulated by DACH1 [J]. Biomark. Res. 11 38093319 10.1186/s40364-023-00548-8 PMC10720252 38. FATTORI S ROUX H Therapeutic targeting of Tumor-Infiltrating regulatory T cells in breast Cancer [J] Cancer Res. 2022 82 21 3868 3879 10.1158/0008-5472.CAN-22-0654 36040356 FATTORI, S. & ROUX, H. Therapeutic targeting of Tumor-Infiltrating regulatory T cells in breast Cancer [J]. Cancer Res. 82 36040356 10.1158/0008-5472.CAN-22-0654 39. HUANG D Targeting regulator of G protein signaling 1 in tumor-specific T cells enhances their trafficking to breast cancer [J] Nat. Immunol. 2021 22 7 865 879 10.1038/s41590-021-00939-9 34140678 HUANG, D. et al. Targeting regulator of G protein signaling 1 in tumor-specific T cells enhances their trafficking to breast cancer [J]. Nat. Immunol. 22 34140678 10.1038/s41590-021-00939-9 40. TAN X SUMO1 promotes mesangial cell proliferation through inhibiting autophagy in a cell model of IgA nephropathy [J] Front. Med. 2022 9 834164 10.3389/fmed.2022.834164 PMC9008726 35433764 TAN, X. et al. SUMO1 promotes mesangial cell proliferation through inhibiting autophagy in a cell model of IgA nephropathy [J]. Front. Med. 9 10.3389/fmed.2022.834164 PMC9008726 35433764 41. SONG L Proto-oncogene Src links lipogenesis via lipin-1 to breast cancer malignancy [J] Nat. Commun. 2020 11 1 5842 10.1038/s41467-020-19694-w 33203880 PMC7672079 SONG, L. et al. Proto-oncogene Src links lipogenesis via lipin-1 to breast cancer malignancy [J]. Nat. Commun. 11 33203880 10.1038/s41467-020-19694-w PMC7672079 42. ABU-THURAIA A, GOYETTE M A, BOULAIS J AXL confers cell migration and invasion by hijacking a PEAK1-regulated focal adhesion protein network [J] Nat. Commun. 2020 11 1 3586 10.1038/s41467-020-17415-x 32681075 PMC7368075 ABU-THURAIA A, GOYETTE M A, BOULAIS, J. et al. AXL confers cell migration and invasion by hijacking a PEAK1-regulated focal adhesion protein network [J]. Nat. Commun. 11 32681075 10.1038/s41467-020-17415-x PMC7368075 43. FADó R RODRíGUEZ-RODRíGUEZ R CASALS N The return of malonyl-CoA to the brain: cognition and other stories [J] Prog. Lipid Res. 2021 81 101071 10.1016/j.plipres.2020.101071 33186641 FADó, R., RODRíGUEZ-RODRíGUEZ, R. & CASALS, N. The return of malonyl-CoA to the brain: cognition and other stories [J]. Prog. Lipid Res. 81 33186641 10.1016/j.plipres.2020.101071 44. KOJIMA Y Decreased liver B vitamin-related enzymes as a metabolic hallmark of cancer cachexia [J] Nat. Commun. 2023 14 1 6246 10.1038/s41467-023-41952-w 37803016 PMC10558488 KOJIMA, Y. et al. Decreased liver B vitamin-related enzymes as a metabolic hallmark of cancer cachexia [J]. Nat. Commun. 14 37803016 10.1038/s41467-023-41952-w PMC10558488 45. WANG HL Sirtuin5 protects colorectal cancer from DNA damage by keeping nucleotide availability [J] Nat. Commun. 2022 13 1 6121 10.1038/s41467-022-33903-8 36253417 PMC9576705 WANG, H. L. et al. Sirtuin5 protects colorectal cancer from DNA damage by keeping nucleotide availability [J]. Nat. Commun. 13 36253417 10.1038/s41467-022-33903-8 PMC9576705 46. DING L Programmed cell death 11 modulates but not entirely relies on p53-HDM2 loop to facilitate G2/M transition in colorectal cancer cells [J] Oncogenesis 2023 12 1 57 10.1038/s41389-023-00501-2 38062028 PMC10703783 DING, L. et al. Programmed cell death 11 modulates but not entirely relies on p53-HDM2 loop to facilitate G2/M transition in colorectal cancer cells [J]. Oncogenesis 12 38062028 10.1038/s41389-023-00501-2 PMC10703783 47. CHEN Y SHENG ZH Kinesin-1-syntaphilin coupling mediates activity-dependent regulation of axonal mitochondrial transport [J] J. Cell Biol. 2013 202 2 351 364 10.1083/jcb.201302040 23857772 PMC3718985 CHEN, Y. & SHENG, Z. H. Kinesin-1-syntaphilin coupling mediates activity-dependent regulation of axonal mitochondrial transport [J]. J. Cell Biol. 202 23857772 10.1083/jcb.201302040 PMC3718985 48. HUANG, N. et al. Reprogramming an energetic AKT-PAK5 axis boosts axon energy supply and facilitates neuron survival and regeneration after injury and ischemia [J]. Curr. Biology: CB 31 10.1016/j.cub.2021.04.079 PMC8319057 34087103 49. SCHULER MH Miro1-mediated mitochondrial positioning shapes intracellular energy gradients required for cell migration [J] Mol. Biol. Cell 2017 28 16 2159 2169 10.1091/mbc.e16-10-0741 28615318 PMC5531732 SCHULER, M. H. et al. Miro1-mediated mitochondrial positioning shapes intracellular energy gradients required for cell migration [J]. Mol. Biol. Cell 28 28615318 10.1091/mbc.E16-10-0741 PMC5531732 50. LIBRING, S. & BERESTESKY E D, REINHART-KING C, A. The Movement of Mitochondria in Breast Cancer: Internal Motility and Intercellular Transfer of Mitochondria [J] 10.1007/s10585-024-10269-3 PMC11499424 38489056 51. ROSENBERG L H, LAFITTE M Therapeutic targeting of casein kinase 1δ in breast cancer [J] Sci. Transl. Med. 2015 7 318 318ra202 26676609 10.1126/scitranslmed.aac8773 PMC4809734 ROSENBERG L H, LAFITTE, M. Therapeutic targeting of casein kinase 1δ in breast cancer [J]. Sci. Transl. Med. 7 26676609 10.1126/scitranslmed.aac8773 PMC4809734 52. CHENG S Transforming acidic coiled-coil-containing protein 2 (TACC2) in human breast cancer, expression pattern and clinical/prognostic relevance [J] Cancer Genomics Proteom. 2010 7 2 67 73 20335520 CHENG, S. et al. Transforming acidic coiled-coil-containing protein 2 (TACC2) in human breast cancer, expression pattern and clinical/prognostic relevance [J]. Cancer Genomics Proteom. 7 20335520 53. ONODERA Y TACC2 (transforming acidic coiled-coil protein 2) in breast carcinoma as a potent prognostic predictor associated with cell proliferation [J] Cancer Med. 2016 5 8 1973 1982 10.1002/cam4.736 27333920 PMC4971925 ONODERA, Y. et al. TACC2 (transforming acidic coiled-coil protein 2) in breast carcinoma as a potent prognostic predictor associated with cell proliferation [J]. Cancer Med. 5 27333920 10.1002/cam4.736 PMC4971925 54. BARROS T P, KINOSHITA K Aurora A activates D-TACC-Msps complexes exclusively at centrosomes to stabilize centrosomal microtubules [J] J. Cell Biol. 2005 170 7 1039 1046 10.1083/jcb.200504097 16186253 PMC2171528 BARROS T P, KINOSHITA, K. et al. Aurora A activates D-TACC-Msps complexes exclusively at centrosomes to stabilize centrosomal microtubules [J]. J. Cell Biol. 170 16186253 10.1083/jcb.200504097 PMC2171528 55. NELSON K N, MEYER A N, SIARI A Oncogenic gene fusion FGFR3-TACC3 is regulated by tyrosine phosphorylation [J] Mol. cancer Research: MCR 2016 14 5 458 469 10.1158/1541-7786.MCR-15-0497 26869289 NELSON K N, MEYER A N, SIARI, A. et al. Oncogenic gene fusion FGFR3-TACC3 is regulated by tyrosine phosphorylation [J]. Mol. cancer Research: MCR 14 26869289 10.1158/1541-7786.MCR-15-0497 56. XU J ZHANG W EZR promotes pancreatic cancer proliferation and metastasis by activating FAK/AKT signaling pathway [J] Cancer Cell Int. 2021 21 1 521 10.1186/s12935-021-02222-1 34627255 PMC8502343 XU, J. & ZHANG, W. EZR promotes pancreatic cancer proliferation and metastasis by activating FAK/AKT signaling pathway [J]. Cancer Cell Int. 21 34627255 10.1186/s12935-021-02222-1 PMC8502343 57. SONG Y Ezrin mediates invasion and metastasis in tumorigenesis: A review [J] Front. Cell. Dev. Biology 2020 8 588801 10.3389/fcell.2020.588801 PMC7683424 33240887 SONG, Y. et al. Ezrin mediates invasion and metastasis in tumorigenesis: A review [J]. Front. Cell. Dev. Biology 8 10.3389/fcell.2020.588801 PMC7683424 33240887 58. HUERTA-CEPAS J SZKLARCZYK D EggNOG 5.0: a hierarchical, functionally and phylogenetically annotated orthology resource based on 5090 organisms and 2502 viruses [J] Nucleic Acids Res. 2019 47 D1 D309 d14 10.1093/nar/gky1085 30418610 PMC6324079 HUERTA-CEPAS, J. & SZKLARCZYK, D. EggNOG 5.0: a hierarchical, functionally and phylogenetically annotated orthology resource based on 5090 organisms and 2502 viruses [J]. Nucleic Acids Res. 47 30418610 10.1093/nar/gky1085 PMC6324079 59. KANEHISA M SATO Y KAWASHIMA M KEGG mapping tools for Uncovering hidden features in biological data [J] Protein Science: Publication Protein Soc. 2022 31 1 47 53 10.1002/pro.4172 PMC8740838 34423492 KANEHISA, M., SATO, Y. & KAWASHIMA, M. KEGG mapping tools for Uncovering hidden features in biological data [J]. Protein Science: Publication Protein Soc. 31 10.1002/pro.4172 PMC8740838 34423492 60. GABLE A L SZKLARCZYKD STRING v11: protein-protein association networks with increased coverage, supporting functional discovery in genome-wide experimental datasets [J] Nucleic Acids Res. 2019 47 D1 D607 d13 10.1093/nar/gky1131 30476243 PMC6323986 GABLE A L, S. Z. K. L. A. R. C. Z. Y. K. D. et al. STRING v11: protein-protein association networks with increased coverage, supporting functional discovery in genome-wide experimental datasets [J]. Nucleic Acids Res. 47 30476243 10.1093/nar/gky1131 PMC6323986 61. KANEHISA M KEGG: biological systems database as a model of the real world [J] Nucleic Acids Res. 2025 53 D1 D672 d7 10.1093/nar/gkae909 39417505 PMC11701520 KANEHISA, M. et al. KEGG: biological systems database as a model of the real world [J]. Nucleic Acids Res. 53 39417505 10.1093/nar/gkae909 PMC11701520 62. KANEHISA M Toward Understanding the origin and evolution of cellular organisms [J] Protein Science: Publication Protein Soc. 2019 28 11 1947 1951 10.1002/pro.3715 PMC6798127 31441146 KANEHISA M. Toward Understanding the origin and evolution of cellular organisms [J]. Protein Science: Publication Protein Soc. 28 10.1002/pro.3715 PMC6798127 31441146 63. KANEHISA M KEGG: Kyoto encyclopedia of genes and genomes [J] Nucleic Acids Res. 2000 28 1 27 30 10.1093/nar/28.1.27 10592173 PMC102409 KANEHISA, M. KEGG: Kyoto encyclopedia of genes and genomes [J]. Nucleic Acids Res. 28 10592173 10.1093/nar/28.1.27 PMC102409 64. CHENG, A. et al. MoMo: discovery of statistically significant post-translational modification motifs [J]. Bioinf. (Oxford England) 35 10.1093/bioinformatics/bty1058 PMC6691336 30596994 65. WIREDJA D D, KOYUTüRK M The KSEA app: a web-based tool for kinase activity inference from quantitative phosphoproteomics [J] Bioinf. (Oxford England) 2017 33 21 3489 3491 10.1093/bioinformatics/btx415 PMC5860163 28655153 WIREDJA D D, KOYUTüRK, M. The KSEA app: a web-based tool for kinase activity inference from quantitative phosphoproteomics [J]. Bioinf. (Oxford England) 33 10.1093/bioinformatics/btx415 PMC5860163 28655153 66. JIANG S Generic diagramming platform (GDP): a comprehensive database of high-quality biomedical graphics [J] Nucleic Acids Res. 2025 53 D1 D1670 d6 10.1093/nar/gkae973 39470721 PMC11701665 JIANG, S. et al. Generic diagramming platform (GDP): a comprehensive database of high-quality biomedical graphics [J]. Nucleic Acids Res. 53 39470721 10.1093/nar/gkae973 PMC11701665 ",
  "metadata": {
    "Title of this paper": "Generic diagramming platform (GDP): a comprehensive database of high-quality biomedical graphics [J]",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484806/"
  }
}