{
  "title": "Paper_898",
  "abstract": "pmc Endocr Connect Endocr Connect 2122 endoconn EC Endocrine Connections 2049-3614 Bioscientifica Ltd. PMC12474799 PMC12474799.1 12474799 12474799 40919714 10.1530/EC-25-0444 EC-25-0444 1 Research EC-Hormones-and-Cancer Hormones and Cancer Genomic features of the methylosome protein MEP50 and its implications in hormone signaling and cancer https://orcid.org/0000-0002-2787-6673 Pollin Gareth  1  2 https://orcid.org/0000-0001-9220-9511 Chi Young-In  1  2 https://orcid.org/0000-0002-1640-6780 Urrutia Raul  1  2  3 https://orcid.org/0000-0001-5463-789X Lomberk Gwen  1  2  4 1 2 3 4 Correspondence should be addressed to G Lomberk: glomberk@mcw.edu This paper forms part of a themed collection, highlighting the dynamic landscape and the highly interactive network of key transcriptional factors underlying endocrine disorders. The Collection Editors were Gwen Lomberk and Rosalia C M Simmen. 24 9 2025 08 9 2025 9 2025 14 9 496342 e250444 19 7 2025 27 8 2025 05 9 2025 24 09 2025 28 09 2025 28 09 2025 © the author(s) 2025 the author(s) https://creativecommons.org/licenses/by/4.0/ Creative Commons Attribution 4.0 International License. Graphical Abstract  Abstract Dysfunction of several WD40 family proteins causes diverse endocrine diseases. Until recently, MEP50, a WD40 protein, was considered a gene of unknown significance because no inherited disease had been linked to its function. However, genetic inactivation of MEP50 in mouse models or somatic mutations in humans drives oncogenesis in several endocrine-related cancers, including those of the prostate, breast, and uterus. In this study, we generate new knowledge through a multi-tier integration of evolutionary genomics, sequence and structural analyses, molecular mechanic calculations, and dynamic simulations of wild-type and cancer-mutated MEP50 proteins. Indeed, we find that a conserved splicing event across evolution generates an alternative MEP50 isoform, which is smaller than the canonical MEP50 and lacks the final β-sheet of the first WD40 domain, the entirety of the second WD40 domain, and the first β-sheet of the third WD40 domain. Notably, we find that this novel, short MEP50 (s-MEP50) transcript encodes a 278 amino acid protein that retains aspects of the key regulatory and interaction sites, including those critical for androgen receptor and PRMT5 binding. Finally, we analyze the mutational landscape of MEP50 in endocrine-regulated cancers and use molecular mechanic calculations and dynamic simulations to reveal that cancer-associated mutations disrupt conserved bonding networks and induce widespread structural destabilization within the WD40 domain architecture. Thus, by combining evolutionary, structural, and biophysical approaches, we advance the understanding of MEP50 genomics, providing significant mechanistic and clinically relevant insights into endocrine-regulated tissues and their cancers. Keywords functional genomics methylosome MEP50 WDR77 alternative splicing National Institutes of Health https://doi.org/10.13039/100000002 R01DK52913, R01CA247898 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ifp:collection EC-Hormones-and-Cancer Introduction The WD repeat-containing protein 77 (MEP50/WDR77) is a multifunctional scaffolding protein within endocrine signaling cascades and serves as a core structural component of the PRMT5 methylosome complex, which incorporates one of several mutually exclusive adaptor proteins, including RIOK1, COPRS, or pICLn ( 1 2 3 4 5 6 7 Materials and methods MEP50 knockdown data acquisition and enrichment analysis Transcriptomic datasets from the Gene Expression Omnibus (GEO) contain RNA-seq profiles of endocrine tumor cell lines subjected to MEP50 perturbation. In particular, we analyzed GSE75743 GSE154951 8 9 10 11 12 MEP50 paralog and ortholog sequence collection, filtering, and analysis To analyze conserved features among human WD40 domain-containing paralogs, we began with the PF00400 seed alignment, which encompasses 1,465 WD40 repeat sequences ( 13 14 15 16 17 18 19 20 Phylogenetic reconstruction of the MEP50 short isoform Thirteen orthologs of the s-MEP50 (278 amino acids) were identified using NCBI Protein BLAST, with the human WDR77 short isoform ( NP_001303993 16 14 15 21 22 MD-associated parameter measurements MD simulations were performed to characterize the structural and dynamic effects of MEP50 and its variants ( 23 24 25 26 Results Evolutionary genomics identifies residues needed for MEP50 structural integrity and its regulation We analyzed 95 human WD40 domain-containing paralogs to identify conserved residues within the six WD40 repeats of MEP50. This analysis revealed conserved histidine residues in WD40_2 (H124), WD40_3 (H166), WD40_5 (H254), and WD40_6 (H296). A valine residue was conserved across all WD40 repeats except WD40_4, with conserved positions identified at V83 (WD40_1), V128 (WD40_2), V170 (WD40_3), V258 (WD40_5), and V300 (WD40_6). A second hydrophobic residue, located three residues downstream of this valine, was leucine in WD40_1 (L86), WD40_4 (L218), and WD40_5 (L261) and valine in WD40_2 (V131) and WD40_3 (V173), reflecting conservation of side-chain character across repeats. Proline residues were conserved across WD40_3–6: WD40_3 (P177), WD40_4 (P222), WD40_5 (P265), and WD40_6 (P307). Repeat 3 retained an LS motif at residues 184–185. However, WD40 domains WD40_1 and WD40_5 both conserved the serine but contained an alanine instead of the leucine, while WD40_6 contained a threonine, a comparable phosphorylatable residue. The final eight residues of each repeat showed the highest level of conservation across paralogs ( Fig. 1A Figure 1 Sequence conservation and structural annotation of MEP50 across human paralogs and evolutionary orthologs. (A) Alignment of 95 human WD40 repeat-containing proteins highlights residues conserved within MEP50 (WDR77) WD40_1–WD40_6 domains. (B) Multiple sequence alignment of MEP50 orthologs across 200 species illustrates conservation along the 342 amino acid full-length isoform. WD40 domains are indicated with large black arrows and annotated; accordingly, secondary structure elements are annotated above the sequence. Post-translational modification sites are marked (blue, phosphorylation; gray, ubiquitination). The black boxes denote regions critical for PRMT5 interaction. The yellow bars indicate per-residue conservation; sequence logos below highlight tolerated variation at less conserved positions. Next, we conducted an ortholog analysis of 200 MEP50 sequences from diverse species, all encoding a 342 amino acid protein identical in length to the canonical human isoform. This analysis revealed that the MEP50 protein remains largely conserved across species. Most sequence variations are localized outside the WD40 domains, indicating that these structured repeats maintain strong evolutionary constraint, while more flexible regions tolerate greater divergence. Among these, WD40_1 showed the highest conservation (89%), followed by WD40_6 (75%), WD40_2 (71%), and WD40_3 (70%). WD40_4 and WD40_5 exhibited lower conservation, at 46 and 40%, respectively. At the residue level, methionine (M), tryptophan (W), and tyrosine (Y) were completely conserved. Aspartic acid (D) showed 94.74% conservation, followed by lysine (K, 89%), histidine (H, 82%), and phenylalanine (F, 80%). Glycine (G, 74%) and asparagine ( n Fig. 1B Table 1 5 27 28 Fig. 1B Figure 2 Structural and interaction surface comparison between canonical and short MEP50 isoforms. (A) Pairwise sequence alignment of full-length human MEP50 (WDR77) and the 278 amino acid short isoform (s-MEP50), annotated with UniProt accession IDs. (B) Structural models of canonical MEP50 and s-MEP50 showing WD40 β-propeller architecture and changes in the overall protein structure. (C) Surface patch analysis of both isoforms, mapping predicted protein–protein interaction interfaces. Table 1 Interaction interface between PRMT5 (chain A) and MEP50 (chain B). Residue-level contacts between PRMT5 and MEP50 at the protein–protein interface are categorized by bond type and include electrostatic interactions, hydrogen bonds, and hydrophobic contacts. Each entry specifies the interacting atoms, the bond type, and the interatomic distance in angstroms. Electrostatic and hydrogen bonds predominantly involve residues in the central binding groove of MEP50 (B:47–205) and the PRMT5 interaction surface (A:21–170), while hydrophobic interactions span multiple regions that contribute to complex stabilization. From residues To residues Bond type Distance B:LYS201:NZ A:ASP166:OD2 Electrostatic 3.57246 A:ASN21:HD22 B:ASP126:OD1 Hydrogen bond 1.93406 A:ARG49:HH22 B:SER47:OG Hydrogen bond 2.41855 A:ARG68:HE B:ARG52:O Hydrogen bond 2.47626 A:ARG68:HH21 B:ARG52:O Hydrogen bond 2.36152 A:ASP165:HN B:ARG164:O Hydrogen bond 1.89245 A:GLU169:HN B:ALA203:O Hydrogen bond 2.17046 A:ASN170:HD22 B:GLN205:O Hydrogen bond 1.87691 B:SER50:HG A:PRO65:O Hydrogen bond 1.75149 B:CYS53:HG A:GLU25:OE1 Hydrogen bond 2.41197 B:TRP54:HN A:PRO24:O Hydrogen bond 1.85796 B:ARG164:HN A:ASP165:OD2 Hydrogen bond 2.01046 B:LYS201:HZ3 A:ASP166:OD1 Hydrogen bond 2.04311 B:ALA203:HN A:ILE167:O Hydrogen bond 2.22807 B:SER204:HG A:GLU169:OE1 Hydrogen bond 3.05836 B:GLN205:HN A:ASN170:OD1 Hydrogen bond 1.77534 A:PRO24:HA B:TRP54:O Hydrogen bond 2.46472 A:THR67:HA B:SER50:OG Hydrogen bond 2.83833 A:ARG164:HA B:ARG164:O Hydrogen bond 3.08918 A:ARG164:HD2 B:ALA165:O Hydrogen bond 2.62451 A:ILE168:HA B:ALA203:O Hydrogen bond 2.40966 B:CYS53:HA A:PRO24:O Hydrogen bond 2.30828 B:LYS201:HE2 A:ASP166:O Hydrogen bond 2.31996 B:SER204:HA A:ASN170:OD1 Hydrogen bond 2.66058 B:SER204:HB2 A:GLU169:OE1 Hydrogen bond 2.92596 A:ARG68:NH1 B:TRP54 Electrostatic 3.366 A:HIS47 B:TRP54 Hydrophobic 5.27225 A:HIS47 B:TRP54 Hydrophobic 5.20001 B:ALA81 A:CYS22 Hydrophobic 4.51158 B:ALA165 A:ILE167 Hydrophobic 4.69601 B:ALA165 A:ILE168 Hydrophobic 5.06572 B:PRO202 A:ILE167 Hydrophobic 4.76546 B:ALA203 A:ILE168 Hydrophobic 4.53013 A:HIS47 B:LEU49 Hydrophobic 4.39068 A:PHE50 B:LEU49 Hydrophobic 5.28455 B:TRP54 A:ARG68 Hydrophobic 5.11059 MEP50 undergoes alternative splicing to produce isoforms with distinct structural features and regulatory potential The most recent NCBI annotation confirms that the MEP50 locus encodes two distinct isoforms, which we refer to here as MEP50 (342 amino acids) and short MEP50 (s-MEP50) (278 amino acids). When searching available MEP50-specific antibodies, we found that some antibodies show two distinct bands. One notable example targets the canonical isoform of MEP50, which runs at ∼43 KDa, but also demonstrates a second band at ∼34 KDa (Supplementary Fig. S1A (see the section on Supplementary materials Fig. 2A Fig. 2B Fig. 2C Table 1 Fig. 2A Figure 3 Evolutionary conservation and phylogenetic distribution of s-MEP50 across mammals. (A) Multiple sequence alignment of the 278 amino acid short-MEP50 (s-MEP50) isoform across diverse mammalian species, annotated with NCBI RefSeq accession numbers and species names. (B) Phylogenetic tree of s-MEP50-encoding species, with branch tips labeled by species and corresponding RefSeq accession. (C) Heatmap of per-residue conservation scores across the aligned s-MEP50 sequences. Evolutionary analysis demonstrates alternatively spliced isoform is highly conserved across multiple species We found evidence of this s-MEP50 isoform in a wide range of organisms, suggesting that evolutionary pressure has preserved isoform variation as a constant feature of the MEP50 Homo sapiens Macaca fascicularis Pan troglodytes Figure 4 Transcriptomic consequences of MEP50 (WDR77) knockdown in endocrine cancer models. (A) Heatmap of gene expression changes following MEP50 knockdown in prostate and breast cancer cells. Z-scores reflect relative expression changes (red, upregulated; blue, downregulated). Expression profiles reveal distinct, tissue-specific transcriptional responses to MEP50 depletion. (B) Gene set enrichment analysis (GSEA) of RNA-seq data from MEP50-depleted cells. The bubble plot shows normalized enrichment scores (NESs) for significantly altered pathways. Endocrine signaling and DNA damage response pathways are negatively enriched in both models, indicating disruption of hormone-regulated transcription and genome maintenance programs. To characterize this s-MEP50, we examined its evolutionary context by comparing its sequence to orthologs in other mammals of similar length (278 a.a.) ( Fig. 3A Fig. 3B Fig. 3B Fig. 3C Fig. 3C Cancer-associated mutations in MEP50 disrupt conserved bonding networks and induce widespread structural destabilization To investigate the clinical relevance of MEP50, we analyzed large-scale cancer genomics data from cBioPortal. We found that MEP50 is altered in multiple cancer types through point mutations and deep deletions. Notably, in endocrine-related cancers, such as breast cancer, ovarian epithelial tumors, endometrial cancer, adrenocortical carcinoma, and prostate cancer, we find frequent amplification of the MEP50 locus (Supplementary Fig. S1B). These alterations suggest that MEP50 activity may contribute to the pathogenesis of hormone-driven tumors. Moreover, MEP50 alterations frequently co-occurred with changes in other components of the methylosome complex, including PRMT5, CLNS1A, RIOK1, and COPRS, indicating a potential coordinated dysregulation of this epigenetic machinery (Supplementary Fig. S1C). For this reason, we next focused on understanding how specific residues influence the structural and dynamic properties of MEP50 that may result in its dysregulation. We selected two core tryptophan residues (W59 and W152), essential for maintaining the β-propeller fold, as positive controls which we predict to cause significant local disruptions, alongside three endocrine cancer-associated mutations: A97T, E107K, and A303V. To dissect their functional roles, we evaluated how each variant influences the stability of the β-propeller architecture. Notably, A303 was the only mutated residue not highly conserved across MEP50 orthologs ( Table 2 Table 2 Local interaction profiles of conserved and cancer-associated MEP50 mutations. Change in folding free energy (ΔΔG, kcal/mol) for MEP50 mutants, as calculated by structural modeling. W59R and W152K affect conserved tryptophan residues critical for WD40 domain integrity, while A97T, E107K, and A303V correspond to somatic mutations found in endocrine cancers. Mutation Energy Effect W59R 5.66 Destabilizing W152K 6.2 Destabilizing A97T −1.06 Destabilizing E107K 1.97 Destabilizing A303V 1.57 Destabilizing To define the structural mechanisms of conserved tryptophan residues in MEP50, we first examined the non-covalent interaction formed by W59 and W152. In its native state, W59 forms a dense network of stabilizing interactions, including hydrogen bonds, with L44 and S57, π-sulfur contact with C73, and multiple π-alkyl interactions with M7, A23, and P24. Substituting W59 with arginine disrupts these interactions, preserving only a few hydrogen and alkyl bonds while eliminating π-alkyl and π-sulfur contacts (Supplementary Table 1). Likewise, wild-type W152 forms multiple stabilizing interactions, including hydrogen and carbon–hydrogen bonds, with A140, Q139, and A158, and π-alkyl contacts with V103, V150, and V159. In the W152K mutant, lysine abolishes the aromatic interactions and diminishes the hydrogen bonding network. These results highlight the structural importance of W59 and W152 in stabilizing the WD40_1 and WD40_2 repeats, as each tryptophan anchors a network of aromatic, hydrophobic, and hydrogen bond interactions that maintain the local fold. Replacement of W59 with arginine or W152 with a lysine, which are polar, non-aromatic residues, removes the key π-mediated contacts and introduces steric and electrostatic strain. Although chemically distinct, both substitutions disrupt local packing, emphasizing the essential role of tryptophan in preserving WD40 repeat integrity. To explore the structural and biological relevance of mutations found in endocrine cancers, we next analyzed patient-derived variants by examining the non-covalent interaction networks of wild-type and mutant residues, with a focus on their impact on WD40 domain architecture. We first looked at the cancer mutation A97T, which was identified in a patient with endometrioid carcinoma. A97 forms modest hydrogen and alkyl interactions in the wild-type state. Substituting the alanine to a threonine preserves hydrogen bonding but introduces an additional side-chain interaction. In contrast, E107K, a variant found in pancreatic tumors, forms a critical salt bridge with K118, engaging in multiple hydrogen bonds that are disrupted upon substitution for lysine. The E107K variant replaces the electrostatic network with weaker hydrophobic contacts, reducing the local structural cohesion. Finally, we reveal that the A303V variant found in endometrioid carcinoma contributes to local hydrophobic packing through hydrogen bonds with N302 and T314 and alkyl contacts with L274 and L313. The A303V mutation preserves these interactions but introduces additional contacts with V262 and A272. We extended this analysis to evaluate how endocrine tumor-associated mutations alter the global flexibility of MEP50. To do this, we calculated residue-level root mean square fluctuations (RMSFs) for all currently known endocrine-related cancer variants and compared the results to the wild-type structure (Supplementary Table 2). Each mutation produced a unique pattern of flexibility changes, which we mapped to the six WD40 repeats of the β-propeller fold. The A303V mutation, located in WD40_6, increased local flexibility at the mutation site (RMSF Δ: +0.43 Å at A303) and elevated fluctuations across WD40_6 (+0.055 Å). This mutation also increased RMSF in WD40_2 (+0.057 Å), WD40_4 (+0.063 Å), and to a lesser extent WD40_5 (+0.035 Å), indicating that changes originating in the C-terminal repeat propagated allosterically to central regions of the structure. The A97T variant, positioned in WD40_1, maintained local flexibility at the mutation site but redistributed motion across the structure. This variant increased RMSF in WD40_4 (+0.008 Å), WD40_6 (+0.114 Å), and slightly in WD40_5 and WD40_2, highlighting a dynamic shift from the N-terminal to C-terminal half of the protein. The E107K mutation, also in WD40_1, disrupted a conserved salt bridge and increased flexibility across several domains. We recorded marked RMSF gains in WD40_4 (+0.078 Å), WD40_5 (+0.071 Å), and WD40_6 (+0.086 Å). These findings suggest that the loss of electrostatic stability in WD40_1 weakens inter-repeat communication and destabilizes distal regions. The D146H substitution, located between WD40_2 and WD40_3, induced widespread rigidity. RMSF values decreased in WD40_6 (−0.242 Å), WD40_1 (−0.046 Å), WD40_2 (−0.044 Å), and WD40_3 (−0.038 Å), suggesting that this variant reinforces inter-repeat packing at the cost of overall flexibility. G76R, which resides in WD40_1, reduced flexibility throughout the structure. The mutation introduced a bulky charged residue that rigidified WD40_6 (−0.034 Å), WD40_5 (−0.027 Å), and modestly dampened motion in other repeats. These reductions indicate that steric hindrance in WD40_1 propagates globally and suppresses backbone fluctuations. L86P, another WD40_1 mutation, produced a similar effect. This substitution slightly decreased flexibility in WD40_5 (−0.015 Å), WD40_6 (−0.017 Å), and the core of WD40_2 and WD40_3, reinforcing the conclusion that alterations in repeat 1 influence the entire β-propeller. The S98Y mutation, also in WD40_1, further confirmed this pattern. Although local flexibility remained unchanged, we measured reduced RMSF values in WD40_5 (−0.043 Å) and WD40_6 (−0.021 Å), suggesting that loss of polar contacts or π-interactions at this site dampens distant dynamic zones. T79M, which lies in WD40_1, produced the opposite effect. This mutation increased flexibility in WD40_4 (+0.025 Å), WD40_5 (+0.010 Å), and especially WD40_6 (+0.108 Å), indicating that even conservative substitutions can amplify backbone mobility across structurally distant repeats. Y163N, which resides in WD40_2, exerted more subtle effects. It slightly increased flexibility in WD40_3 (+0.008 Å) while reducing motion in other regions. These shifts suggest that this mutation produces a more localized redistribution of motion without significant structural destabilization. V182M, located in WD40_3, reduced RMSF values across the structure. This mutation decreased flexibility in WD40_5 (−0.037 Å) and WD40_6 (−0.026 Å), pointing to a restrained dynamic state induced by hydrophobic overpacking. Together, these findings demonstrate that mutations in MEP50 affect protein dynamics in both a site-specific and repeat-wide manner. Substitutions in WD40_1 often act as hubs for allosteric regulation, transmitting structural strain or dampening through multiple repeats. Mutations in the C-terminal region, such as A303V, propagate motion back toward the core. These distinct dynamic signatures highlight the structural fragility of the β-propeller architecture and support a model in which cancer-associated mutations compromise MEP50 function through coordinated disruption of inter-repeat dynamics. Molecular characterization of MEP50 reveals its impact on cancer-related signaling To complement our structural and MD analyses and gain functional insights, we next investigated the transcriptional consequences of MEP50 dysregulation in endocrine cancer model systems. By leveraging RNA sequencing data from genetic knockdown experiments in cancer-derived cell lines of prostate and breast origin ( 8 9 Fig. 4A GSEA revealed that, despite distinct transcriptional profiles, MEP50 knockdown induces overlapping molecular programs across cancer models, prominently affecting endocrine signaling, DNA repair, and protein homeostasis pathways. Both the breast and prostate cancer models exhibit significantly reduced enrichment of endocrine-related gene sets involved in progesterone-mediated regulation (breast, NES = −1.68; prostate, NES = −1.06). In the breast cancer model, MEP50 loss further diminishes the expression of genes associated with endocrine resistance (NES = −1.28), estrogen signaling (NES = −1.34), and thyroid hormone activity (NES = −1.41) ( Fig. 4B Fig. 4B Discussion This study defines the genomic, structural, and functional landscape of MEP50, a WD40 domain scaffold central to hormone signaling and endocrine cancers. By integrating evolutionary genomics and molecular modeling, we discover a conserved alternative splicing event in MEP50 that removes the last β-sheet of the first WD40 domain, the entire second WD40 domain, and the first β-sheet of the third WD40 domain. Our molecular modeling of cancer-associated mutations combined with transcriptomic profiling demonstrates that the β-propeller architecture of MEP50 is structurally constrained and essential for function. Disruption of this architecture by mutation leads to dysfunction. We further examine the molecular and functional consequences of MEP50 loss, showing its impact on hormone signaling, DNA repair, and cellular homeostasis in endocrine cancer contexts. WD40 domains, which form highly stable seven-bladed β-propeller scaffolds, rank among the most abundant protein domains in eukaryotes and emerged during the early stages of eukaryotic evolution. These domains mediate diverse protein–protein interactions, including scaffolding and the cooperative assembly of dynamic multi-subunit complexes involved in chromatin regulation and signal transduction ( 29 30 2 19 31 32 33 Our integrated structural and transcriptomic analyses establish MEP50 (WDR77) as a critical driver of oncogenic programs in endocrine tumors. By maintaining the structural integrity of the PRMT5 methylosome, MEP50 governs downstream signaling pathways by facilitating the accurate substrate positioning for methylation. Our analysis of large-scale cancer genomics data reveals that MEP50 frequently undergoes amplification and point mutation in hormone-driven cancers ( 34 35 36 To explore the potential functional consequences of MEP50 disruption in hormone-responsive cancers, we analyzed RNA-seq data from MEP50 knockdown experiments in breast and prostate cancer models ( 8 9 9 9 7 33 In conclusion, our comprehensive analyses establish MEP50 as an evolutionarily conserved scaffold essential for maintaining the integrity and regulatory capacity of the PRMT5 methylosome in endocrine tissues. Alongside the structural and functional consequences of cancer-associated mutations, we define a conserved alternatively spliced isoform of MEP50 that removes the essential elements of the WD40 β-propeller. This variant is predicted to alter scaffolding interactions with PRMT5 while retaining AR binding, suggesting it may act in a context-dependent or PRMT5-independent manner. Its evolutionary conservation implies regulatory significance, and future studies delineating its expression dynamics, protein stability, and binding partners will be essential for determining whether s-MEP50 serves as a dominant-negative or supports alternative MEP50 functions. Furthermore, through ortholog conservation and cancer-associated mutations, we identify a network of critical residues and structural domains required for MEP50 stability, along with candidate sites for post-translational regulation. Disruption of this architecture is likely to compromise methylosome catalytic activity, leading to broad dysregulation in hormone signaling, DNA repair, and cellular homeostasis. These findings position MEP50 as a central vulnerability in hormone-driven cancers and support its development as both a biomarker and therapeutic target in tumors dependent on methylosome function. Supplementary materials Declaration of interest The authors declare that there is no conflict of interest that could be perceived as prejudicing the impartiality of the work reported. Funding This work was supported by NIH https://doi.org/10.13039/100000002 References 1 Guderian G Peter C Wiesner J et al. RioK1, a new interactor of protein arginine methyltransferase 5 (PRMT5), competes with pICln for binding and modulates PRMT5 complex composition and substrate specificity J Biol Chem 2011 286 1976 1986 10.1074/jbc.M110.148486 21081503 PMC3023494 2 Friesen WJ Wyce A Paushkin S et al. A novel WD repeat protein component of the methylosome binds Sm proteins J Biol Chem 2002 277 8243 8247 10.1074/jbc.M109984200 11756452 3 Lacroix M El Messaoudi S Rodier G et al. The histone-binding protein COPR5 is required for nuclear functions of the protein arginine methyltransferase PRMT5 EMBO Rep 2008 9 452 458 10.1038/embor.2008.45 18404153 PMC2373370 4 Li Y Tian L Ligr M et al. Functional domains of androgen receptor coactivator p44/Mep50/WDR77and its interaction with Smad1 PLoS One 2013 8 e64663 10.1371/journal.pone.0064663 23734213 PMC3667176 5 Asberry AM Cai X Deng X et al. Discovery and biological characterization of PRMT5:MEP50 protein:protein interaction inhibitors J Med Chem 2022 65 13793 13812 10.1021/acs.jmedchem.2c01000 36206451 PMC11167723 6 Liu S Kumari S Hu Q et al. A comprehensive analysis of coregulator recruitment, androgen receptor function and gene expression in prostate cancer ELife 2017 6 e28482 10.7554/eLife.28482 28826481 PMC5608510 7 Poulard C Ha Pham T Drouet Y et al. Nuclear PRMT5 is a biomarker of sensitivity to tamoxifen in ERα + breast cancer EMBO Mol Med 2023 15 e17248 10.15252/emmm.202217248 37458145 PMC10405064 8 Rengasamy M Zhang F Vashisht A et al. The PRMT5/WDR77 complex regulates alternative splicing through ZNF326 in breast cancer Nucleic Acids Res 2017 45 11106 11120 10.1093/nar/gkx727 28977470 PMC5737218 9 Beketova E Fang S Owens JL et al. Protein arginine methyltransferase 5 promotes pICln-dependent androgen receptor transcription in castration-resistant prostate cancer Cancer Res 2020 80 4904 4917 10.1158/0008-5472.CAN-20-1228 32999000 PMC7669631 10 Edgar R Domrachev M Lash AE Gene Expression Omnibus: NCBI gene expression and hybridization array data repository Nucleic Acids Res 2002 30 207 210 10.1093/nar/30.1.207 11752295 PMC99122 11 Korotkevich G Sukhov V Budin N et al Fast gene set enrichment analysis bioRxiv 2016 060012 10.1101/060012 12 Kanehisa M Furumichi M Sato Y et al. KEGG: biological systems database as a model of the real world Nucleic Acids Res 2025 53 D672 D677 10.1093/nar/gkae909 39417505 PMC11701520 13 Blum M Andreeva A Florentino LC et al. InterPro: the protein sequence classification resource in 2025 Nucleic Acids Res 2025 53 D444 D456 10.1093/nar/gkae1082 39565202 PMC11701551 14 Hall T BioEdit A user-friendly biological sequence alignment editor and analysis program for windows 95/98/NT Nucleic Acids Symposium Series 41 95 98 London, UK Oxford University Press 1999 15 Thompson JD Higgins DG Gibson TJ CLUSTAL W: improving the sensitivity of progressive multiple sequence alignment through sequence weighting, position-specific gap penalties and weight matrix choice Nucleic Acids Res 1994 22 4673 4680 10.1093/nar/22.22.4673 7984417 PMC308517 16 Sayers EW Beck J Bolton EE et al. Database resources of the national center for biotechnology information in 2025 Nucleic Acids Res 2025 53 D20 D29 10.1093/nar/gkae979 39526373 PMC11701734 17 Waterhouse AM Procter JB Martin DMA et al. Jalview Version 2 – a multiple sequence alignment editor and analysis workbench Bioinformatics 2009 25 1189 1191 10.1093/bioinformatics/btp033 19151095 PMC2672624 18 Crooks GE Hon G Chandonia JM et al. WebLogo: a sequence logo generator Genome Res 2004 14 1188 1190 10.1101/gr.849004 15173120 PMC419797 19 Hornbeck PV Zhang B Murray B et al. PhosphoSitePlus, 2014: mutations, PTMs and recalibrations Nucleic Acids Res 2015 43 D512 D520 10.1093/nar/gku1267 25514926 PMC4383998 20 Robert X Gouet P Deciphering key features in protein structures with the new ENDscript server Nucleic Acids Res 2014 42 W320 W324 10.1093/nar/gku316 24753421 PMC4086106 21 Kumar S Stecher G Suleski M et al. MEGA12: molecular evolutionary genetic analysis version 12 for adaptive and green computing Mol Biol Evol 2024 41 msae263 10.1093/molbev/msae263 39708372 PMC11683415 22 Zheng X Qin Y Wang J A Poisson model of sequence comparison and its application to coronavirus phylogeny Math Biosci 2009 217 159 166 10.1016/j.mbs.2008.11.006 19073197 PMC7094598 23 Huang J Rauscher S Nawrocki G et al. CHARMM36m: an improved force field for folded and intrinsically disordered proteins Nat Methods 2017 14 71 73 10.1038/nmeth.4067 27819658 PMC5199616 24 Berman HM Westbrook J Feng Z et al. The protein data bank Nucleic Acids Res 2000 28 235 242 10.1093/nar/28.1.235 10592235 PMC102472 25 Webb B Sali A Comparative protein structure modeling using modeller Curr Protoc Bioinformatics 2016 54 5.6.1 5.6.37 10.1002/cpbi.3 PMC5031415 27322406 26 Grant BJ Rodrigues APC ElSawy KM et al. Bio3d: an R package for the comparative analysis of protein structures Bioinformatics 2006 22 2695 2696 10.1093/bioinformatics/btl461 16940322 27 Kim ST Lim DS Canman CE et al. Substrate specificities and identification of putative substrates of ATM kinase family members J Biol Chem 1999 274 37538 37543 10.1074/jbc.274.53.37538 10608806 28 O’Neill T Dwyer AJ Ziv Y et al. Utilization of oriented peptide libraries to identify substrate motifs selected by ATM J Biol Chem 2000 275 22719 22727 10.1074/jbc.M001002200 10801797 29 Stirnimann CU Petsalaki E Russell RB et al. WD40 proteins propel cellular networks Trends Biochem Sci 2010 35 565 574 10.1016/j.tibs.2010.04.003 20451393 30 Antonysamy S Bonday Z Campbell RM et al. Crystal structure of the human PRMT5:MEP50 complex Proc Natl Acad Sci U S A 2012 109 17960 17965 10.1073/pnas.1209814109 23071334 PMC3497828 31 Deniz O Hasygar K Hietakangas V Cellular and physiological roles of the conserved atypical MAP kinase ERK7 FEBS Lett 2023 597 601 607 10.1002/1873-3468.14521 36266944 32 Saelzler MP Spackman CC Liu Y et al. ERK8 down-regulates transactivation of the glucocorticoid receptor through Hic-5 J Biol Chem 2006 281 16821 16832 10.1074/jbc.M512418200 16624805 33 Wu Y Wang Z Han L et al. PRMT5 regulates RNA m6A demethylation for doxorubicin sensitivity in breast cancer Mol Ther 2022 30 2603 2617 10.1016/j.ymthe.2022.03.003 35278676 PMC9263239 34 Ligr M Patwa RR Daniels G et al. Expression and function of androgen receptor coactivator p44/Mep50/WDR77 in ovarian cancer PLoS One 2011 6 e26250 10.1371/journal.pone.0026250 22022581 PMC3192795 35 Suresh S Vinet M Dakroub R et al. Expression, localization and prognosis association of MEP50 in breast cancer Cancers 2022 14 4766 10.3390/cancers14194766 36230689 PMC9563057 36 Stopa N Krebs JE Shechter D The PRMT5 arginine methyltransferase: many roles in development, cancer and beyond Cell Mol Life Sci 2015 72 2041 2059 10.1007/s00018-015-1847-9 25662273 PMC4430368 ",
  "metadata": {
    "Title of this paper": "The PRMT5 arginine methyltransferase: many roles in development, cancer and beyond",
    "Journal it was published in:": "Endocrine Connections",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474799/"
  }
}