{
  "title": "Paper_812",
  "abstract": "pmc World J Stem Cells 1470 wjsc WJSC World Journal of Stem Cells 1948-0210 Baishideng Publishing Group Inc PMC12476815 PMC12476815.1 12476815 12476815 41025099 10.4252/wjsc.v17.i9.106381 jWJSC.v17.i9.eid106381 1 Retrospective Study Expression of cancer stem cell markers and their prognostic significance in stage IIIA non-small cell lung cancer Lin T et al Lin Tao Department of Cardio-Thoracic Surgery, Sanmen People’s Hospital, Sanmen 317100, Zhejiang Province, China Jiang Si-Cong Department of Thoracic and Endocrine Surgery, University Hospitals and University of Geneva, Geneva 450000, Switzerland He Xian-Ming Department of Oncology, The Second Affiliated Hospital, Jiangxi Medical College, Nanchang University, Nanchang 330006, Jiangxi Province, China Xu Wen-Zhen Department of Cardio-Thoracic Surgery, Sanmen People’s Hospital, Sanmen 317100, Zhejiang Province, China Jin Cai-Jin Department of Cardio-Thoracic Surgery, Sanmen People’s Hospital, Sanmen 317100, Zhejiang Province, China Guo You-Dan Department of Respiratory Disease, Jiangxi Provincial People’s Hospital, Nanchang 330006, Jiangxi Province, China. 13970945069@163.com Author contributions: Lin T and Jiang SC prepared the figures; Lin T, Jiang SC, Jin CJ, and Guo YD wrote and improved the main manuscript; He XM and Xu WZ contributed to revision of the main manuscript text and prepared the table; Jin CJ and Guo YD contributed to supervision and replied to review comments; All authors read and approved the final manuscript. Corresponding author: You-Dan Guo, Department of Respiratory Disease, Jiangxi Provincial People’s Hospital, No. 92 Aiguo Road, Nanchang 330006, Jiangxi Province, China. 13970945069@163.com 26 9 2025 26 9 2025 17 9 497739 106381 21 3 2025 16 5 2025 4 8 2025 26 09 2025 29 09 2025 30 09 2025 ©The Author(s) 2025. Published by Baishideng Publishing Group Inc. All rights reserved. 2025 https://creativecommons.org/licenses/by-nc/4.0/ This article is an open-access article that was selected by an in-house editor and fully peer-reviewed by external reviewers. It is distributed in accordance with the Creative Commons Attribution NonCommercial (CC BY-NC 4.0) license, which permits others to distribute, remix, adapt, build upon this work non-commercially, and license their derivative works on different terms, provided the original work is properly cited and the use is non-commercial. See: https://creativecommons.org/Licenses/by-nc/4.0/ BACKGROUND Non-small cell lung cancer (NSCLC) is the most prevalent subtype of lung cancer, accounting for approximately 85% of all lung cancer cases and remaining a major cause of cancer-related mortality worldwide. Despite advances in diagnostic and therapeutic approaches, the incidence and mortality rates of NSCLC continue to rise, especially in low-income and middle-income countries. AIM To investigate the expression of cancer stem cell (CSC) markers and their relationship with the prognosis and survival of patients with stage IIIA NSCLC. METHODS A retrospective analysis was conducted on the clinical data and survival follow-up information of 61 patients with stage IIIA NSCLC treated at our hospital from February 2020 to June 2022, and all cases were confirmed as primary (non-recurrent) diagnoses based on clinical and pathological records. All patients were followed up through outpatient visits or telephone interviews. The follow-up duration ranged from 6 to 51 months with a median follow-up time of 36 months. Overall survival (OS) was defined as the time from the date of pathological diagnosis to death or the last follow-up. Univariate and multivariate Cox regression analyses were performed to examine the relationship between clinical characteristics and OS. Immunohistochemistry was used to detect the expression of CSC markers [octamer-binding transcription factor 4 (OCT4), trophoblast cell surface antigen-2 (TROP-2), ATP-binding cassette subfamily G member 2 (ABCG2), p75 neurotrophin receptor (p75NTR)] in NSCLC, followed by immunohistochemical scoring. The high H-scores of CSC markers, age, and micropapillary components were combined to generate a tumor stemness index (TSI). The Kaplan-Meier method was used to analyze the relationship between CSC markers, TSI, and OS in patients with NSCLC. RESULTS Multivariate Cox regression analysis showed that age [hazard ratio (HR) = 1.952, 95% confidence interval (CI): 1.087-2.481, P P P P P P CONCLUSION Age and micropapillary components were related to OS in patients with stage IIIA NSCLC. High expression of OCT4 and high TSI were associated with poor prognosis. Stage IIIA non-small cell lung cancer Tumor stem cell markers Tumor stemness index Prognosis survival Relationship pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes  Core Tip: INTRODUCTION Non-small cell lung cancer (NSCLC) is the most prevalent subtype of lung cancer, accounting for approximately 85% of all lung cancer cases and remaining a major cause of cancer-related mortality worldwide. Despite advances in diagnostic and therapeutic approaches, the incidence and mortality rates of NSCLC continue to rise, especially in low-income and middle-income countries[ 1 2 3 A growing body of evidence suggests that tumor heterogeneity and the presence of cancer stem cells (CSCs) are major contributors to therapeutic resistance, tumor recurrence, and metastasis in NSCLC[ 4 5 6 Several markers have been identified to characterize CSCs in NSCLC, including octamer-binding transcription factor 4 (OCT4), trophoblast cell surface antigen-2 (TROP-2), ATP-binding cassette subfamily G member 2 (ABCG2), and p75 neurotrophin receptor (p75NTR). These markers have been implicated in stemness maintenance, drug efflux, epithelial-mesenchymal transition, and modulation of the tumor microenvironment[ 7 11 For example, OCT4 is a well-known transcription factor essential for maintaining pluripotency and self-renewal in CSCs. TROP-2 is involved in cell proliferation and metastatic potential. ABCG2 mediates drug resistance through its role as an efflux transporter, and p75NTR is linked to cell survival and migration within the tumor microenvironment. While other established CSC markers such as CD133 and aldehyde dehydrogenase 1 have also been widely studied, their expression patterns and prognostic significance can vary significantly among NSCLC subtypes and stages. Furthermore, due to limitations in specimen availability and antibody validation within our retrospective cohort, these markers were not included in the current analysis but are recognized as important targets for future research. Although numerous studies have explored the prognostic relevance of these markers in NSCLC, few have specifically focused on their expression patterns and clinical implications in patients with stage IIIA. Given the unique biological characteristics of stage IIIA NSCLC, it is imperative to examine the role of CSC markers in this subset more closely. In the present study we retrospectively analyzed tumor specimens from 61 patients with stage IIIA NSCLC to evaluate the expression levels of four CSC markers, OCT4, TROP-2, ABCG2, and p75NTR, using immunohistochemistry (IHC). We further proposed and calculated a composite tumor stemness index (TSI) by integrating the expression status of these markers with selected clinicopathological parameters. This study aimed to explore the relationship between CSC marker expression and overall survival (OS) and to assess the utility of TSI in stratifying prognosis for patients with stage IIIA NSCLC. This integrative approach will provide new insights into CSC biology and offer a potential tool for clinical decision-making in this complex disease stage. MATERIALS AND METHODS Study subjects A retrospective analysis was conducted on the clinical data and survival follow-up information of 61 patients with stage IIIA NSCLC treated at our hospital from February 2020 to June 2022, and all cases were confirmed as primary (non-recurrent) diagnoses based on clinical and pathological records. Inclusion criteria were: (1) Patients aged ≥ 18 years and < 80 years, regardless of gender; (2) Histopathologically confirmed stage IIIA NSCLC via 12 Among the 61 patients 50 were male and 11 were female; the median age of the patients was 64 years with 25 patients aged ≤ 65 years and 36 patients aged ≥ 65 years. Overall, 29 cases were lung squamous cell carcinoma (LUSC), and 32 cases were lung adenocarcinoma (LUAD). All patients had completed OS endpoint follow-up with a median follow-up time of 20 months. This study was approved by the Medical Ethics Committee of the First Affiliated Hospital of Nanchang Medical College (approval number: FA240011), and the study strictly adhered to the ethical guidelines of the “Helsinki Declaration.” IHC staining method IHC staining was used to detect the expression of CSC markers (OCT4, TROP-2, ABCG2, and p75NTR) in tumor tissue samples from patients with stage IIIA NSCLC. Formalin-fixed, paraffin-embedded tissues were cut into 4 μm sections, mounted on poly-L-lysine-coated slides, and baked at 60 °C for 2 h. Sections were dewaxed in xylene, rehydrated through graded ethanol, and subjected to antigen retrieval using sodium citrate buffer (pH = 6.0) in a pressure cooker at 121 °C for 2 min. After cooling endogenous peroxidase activity was blocked with 3% hydrogen peroxide for 10 min. Non-specific binding was blocked with 10% goat serum for 30 min at room temperature. Primary antibodies against OCT4 (1:200), TROP-2 (1:100), ABCG2 (1:150), and p75NTR (1:200) (all from Abcam, United States) were applied and incubated overnight at 4 °C. After washing HRP-labeled goat anti-rabbit or anti-mouse secondary antibodies (1:500) were applied for 30 min at 37 °C. Immunoreactivity was visualized using DAB chromogen, followed by hematoxylin counterstaining. Slides were then dehydrated, cleared, and mounted using neutral resin. Positive controls (known marker-expressing tissues) and negative controls (omission of primary antibodies) were included in each staining run to ensure specificity and consistency. IHC scoring In this study IHC staining results were independently evaluated by two senior pathologists who were blinded to the clinical and pathological data of the patients to ensure objectivity and consistency. In the event of discrepancies, a consensus was reached through discussion. Tumor sections were observed under a light microscope at × 200 magnification to assess marker expression. Staining intensity was scored based on an established 4-tier scale: 0 (negative, no staining); 1 (weak, light yellow); 2 (moderate, brown-yellow); and 3 (strong, dark brown), following the criteria reported by Robert et al 13 14 15 Image analysis was performed using Image-Pro Plus 6.0 (Media Cybernetics, MD, United States). All images were acquired under standardized microscope and camera settings. No tissue sections were excluded from analysis, and each sample was evaluated in at least three representative fields to reduce variability. Although we were unable to provide representative IHC images in the current version due to technical constraints, the scoring method described above has been applied in multiple peer-reviewed studies and is well validated. Statistical analysis All statistical analyses in this study were performed using R language (version 3.6.3). In the survival analysis univariate and multivariate Cox proportional hazards regression models were used to evaluate the association between various clinical variables and OS. The calculations for the Cox regression model were based on the coxph function from the R survival package, and the results were expressed as hazard ratios (HR) with 95% confidence intervals (CI). Kaplan-Meier survival analysis was performed to plot survival curves, and the log-rank test was used to compare survival rates between different groups. Survival curves were drawn using the survfit function from the survival package and visualized with the ggsurvplot function. All statistical tests were two-sided with a significance level set at P RESULTS Relationship between NSCLC clinical features and OS Univariate Cox regression analysis revealed that age, carcinoembryonic antigen, squamous cell carcinoma, neuron-specific enolase, cancer antigen-125, and micropapillary components were associated with OS. Multivariate Cox regression analysis indicated that age (HR = 1.952, 95%CI: 1.087-2.481, P P 1 Table 1 Relationship between non-small cell lung cancer clinical features and overall survival  Characteristic  Univariate analysis  Multivariate analysis  OS (95%CI)  HR (95%CI)   P  HR (95%CI)   P Gender Male 614.2 (449.6-715.3) Female 581.7 (336.4-828.5) 1.122 (0.527-2.418) 0.759 Age (years) < 65 688.7 (581.6-814.9) ≥ 65 554.3 (274.3-682.1) 1.903 (1.059-3.398) 0.043 1.952 (1.087-2.481) 0.029 Smoking history Yes 639.3 (477.5-814.9) No 584.5 (335.6-711.3) 0.981 (0.551-1.763) 0.954 Pathological type LUSC 625.8 (451.7-763.4) LUAD 597.2 (434.5-735.3) 0.873 (0.635-1.492) 0.897 Tumor position Central 680.7 (582.3-774.6) Peripheral 587.8 (361.5-708.6) 1.395 (0.772-2.521) 0.264 pT stage T1 708.4 (204.3-1212.6) T2 556.2 (361.4-715.8) 0.918 (0.395-2.156) 0.847 T3 695.7 (589.3-802.5) 0.931 (0.337-2.578) 0.891 T4 616.1 (450.4-782.6) 1.163 (0.442-3.073) 0.772 pN stage N0 585.7 (582.6-590.3) N1 681.5 (365.7-997.4) 0.796 (0.278-2.274) 0.675 N2 559.3 (361.2-715.8) 0.762 (0.285-1.998) 0.581 CEA (ng/mL) ≥ 3.60 647.3 (582.6-715.8) < 3.60 412.7 (273.9-643.4) 1.712 (1.008-2.572) 0.047 1.256 (0.987-1.976) 0.086 SCC (ng/mL) ≥ 1.10 611.8 (336.7-714.8) < 1.10 453.6 (359.2-671.5) 1.408 (1.002-1.981) 0.045 1.119 (0.978-1.421) 0.095 NSE (ng/mL) ≥ 21.30 583.6 (551.7-711.8) < 21.30 662.7 (453.2-709.4) 0.977 (0.935-0.999) 0.049 0.982 (0.951-1.016) 0.102 CA125 (kU/L) ≥ 30.00 662.4 (478.5-724.7) < 30.00 483.5 (271.6-609.3) 1.018 (1.004-1.052) 0.048 1.072 (0.993-1.217) 0.091 Squamous Without 558.9 (336.5-708.4) With 636.2 (581.9-718.5) 0.845 (0.483-1.479) 0.558 Acinar Without 642.3 (478.6-715.4) With 559.2 (361.5-714.8) 0.985 (0.561-1.774) 0.996 Lepidic Without 585.2 (451.6-710.7) With 647.3 (582.9-715.1) 5.976 (0.753-47.871) 0.093 Micropapillary Without 647.5 (582.3-715.9) With 303.2 (270.8-709.5) 2.554 (1.243-5.256) 0.013 2.716 (1.259-5.837) 0.013 Papillary Without 647.3 (478.5-715.6) With 556.7 (270.4-709.2) 1.351 (0.732-2.495) 0.343 Solid Without 638.5 (559.7-714.4) With 381.6 (270.2-734.8) 1.047 (0.583-1.886) 0.892 Chemotherapy Yes 617.5 (478.6-710.7) No 586.3 (314.4-725.9) 0.991 (0.542-1.816) 0.965 PORT Yes 648.2 (361.7-936.5) No 589.4 (450.3-709.2) 1.116 (0.403-3.107) 0.837 OS: Overall survival; HR: Hazard ratio; CI: Confidence interval; LUSC: Lung squamous cell carcinoma; LUAD: Lung adenocarcinoma; CEA: Carcinoembryonic antigen; SCC: Squamous cell carcinoma; NSE: Neuron-specific enolase; CA125: Cancer antigen-125; PORT: Postoperative radiotherapy. Relationship between CSC-related marker expression and OS In NSCLC 21 cases had high OCT4 H-scores, 27 cases had high TROP-2 H-scores, 44 cases had high ABCG2 H-scores, and 44 cases had high p75NTR H-scores as shown in Table 2 P P 1 P P 2 Figure 1  Relationships between octamer-binding transcription factor 4 H-score, trophoblast cell surface antigen-2 H-score, ATP-binding cassette subfamily G member 2 H-score, and p75 neurotrophin receptor H-score and overall survival. Figure 2  Association between high octamer-binding transcription factor 4 expression and overall survival in different non-small cell lung cancer subtypes. Table 2 Cancer stem cells marker immunohistochemistry H-score results  Variables  NSCLC ( n OCT4 Low H-score 40 (65.57) High H-score 21 (34.43) TROP-2 Low H-score 34 (55.74) High H-score 27 (44.26) ABCG2 Low H-score 17 (27.87) High H-score 44 (72.13) p75NTR Low H-score 17 (27.87) High H-score 44 (72.13) NSCLC: Non-small cell lung cancer; OCT4: Octamer-binding transcription factor 4; TROP-2: Trophoblast cell surface antigen-2; ABCG2: ATP-binding cassette subfamily G member 2; p75NTR: P75 neurotrophin receptor. Relationship between TSI and OS To comprehensively understand whether the simultaneous expression of multiple CSC-related markers was correlated with NSCLC prognosis, this study combined several indicators into a composite score called TSI. The TSI calculation method involved adding up the genes with an H-score above 5 and including age ≥ 65 years and the presence of a micropapillary component as positive indicators. The cumulative sum of these indicators formed the TSI. Using the median as a cutoff, a TSI > 3 was considered high TSI, and a TSI < 3 was considered low TSI. Survival analysis showed that patients with high TSI had a median survival of 502.6 days (95%CI: 468.3-645.8), which was worse than the 708.6 days (95%CI: 559.4-735.1) for patients with low TSI. The difference was statistically significant (HR = 2.209, 95%CI: 1.238-3.681, P 2 DISCUSSION Lung cancer, particularly NSCLC, has remained one of the leading causes of cancer-related mortality globally, posing a severe threat to human health[ 16 17 18 19 20 Therefore, this study systematically explored the relationship between the clinical characteristics of patients with NSCLC, CSC-related markers (OCT4, TROP-2, ABCG2, p75NTR), and patient prognosis. Our study found that patient age and the presence of micropapillary components significantly affected OS. In particular the pathological feature of micropapillary components was closely related to patient prognosis, showing poorer survival even in early stages[ 21 Future studies should include comprehensive pathological assessments, including vascular and lymphatic invasion status, to clarify the biological and clinical implications of micropapillary patterns in NSCLC progression. Therefore, in clinical practice it is recommended that more detailed and targeted follow-up strategies be established for patients with such characteristics after surgery. This will help to detect potential recurrence or metastasis in a timely manner, improving the patient’s quality of life and survival time. OCT4 is a transcription factor closely associated with stem cell pluripotency and self-renewal capacity. Recent studies have demonstrated that OCT4 is overexpressed in various types of cancers[ 22 23 P 24 26 Moreover, OCT4 has been linked not only to the malignancy of NSCLC but also to treatment resistance. Studies have shown that OCT4 overexpression can enhance tumor cell resistance to conventional chemotherapy agents, contributing to tumor recurrence[ 27 In comparison to OCT4 the relationship between the expression of TROP-2, ABCG2, and p75NTR and prognosis in patients with NSCLC was more complex in this study. TROP-2 as a tumor-associated antigen is highly expressed in various tumor types and is closely related to tumor proliferation, metastasis, and chemotherapy resistance[ 28 29 30 31 vs ABCG2, a drug efflux pump protein, is often highly expressed in CSCs and is associated with tumor chemotherapy resistance[ 32 33 p75NTR, a neurotrophin receptor, is expressed in various tumors and is closely associated with tumor cell migration, invasion, and resistance[ 34 35 In this study we established a TSI composite scoring system that combines OCT4, TROP-2, ABCG2, p75NTR, and clinical characteristics of patients with NSCLC, aiming for a more comprehensive assessment of tumor stemness characteristics. We found that patients with a high TSI had worse OS, suggesting that TSI may be an independent predictor of prognosis in patients with stage IIIA NSCLC. Compared with single markers, TSI through the combined analysis of multiple stem cell markers better reflects the biological characteristics of the tumor, thus providing a more accurate prognosis assessment. Previous studies have also indicated that TSI is closely related to prognosis in various cancer types[ 36 37 Our study further confirmed the application value of TSI in NSCLC and provided a new prognostic evaluation tool for clinical practice. However, the clinical application of TSI still faces several challenges. First, the accuracy and consistency of the immunohistochemical scoring method may affect the calculation of the stemness index, and standardized scoring processes are required. In this study IHC H-scores were used to semi-quantitatively assess the expression levels of OCT4, TROP-2, ABCG2, and p75NTR in tumor samples. Although the scoring was independently performed by two experienced pathologists with high interobserver consistency, we acknowledge that H-scores remain a semi-quantitative method and are subject to inherent limitations such as observer bias. To enhance the reliability of IHC-based evaluation, future studies could incorporate more quantitative validation approaches, such as assessing the correlation between H-scores and mRNA levels ( via via Second, the TSI scoring system still needs further refinement, especially in terms of marker selection and weight distribution. In this study the TSI was calculated by integrating three equally weighted factors: IHC H-score total > 5; age ≥ 65 years; and presence of micropapillary structures. While this composite index is practical and demonstrated prognostic utility, we acknowledge that the equal weighting lacks detailed biological rationale. These factors likely contribute to prognosis via Despite providing important data on CSC markers and TSI in the clinical significance of stage IIIA NSCLC, this study still had some limitations. First, as a single-center retrospective study, the sample size was relatively small, potentially leading to nonsignificant relationships between some markers and prognosis. Future large-scale multicenter prospective studies could further validate the reliability and generalizability of these results. Second, this study only analyzed four markers, OCT4, TROP-2, ABCG2, and p75NTR, while CSC characteristics go beyond these markers. With the development of molecular biology techniques, future studies can explore more CSC markers using genomics, proteomics, and other methods, optimizing TSI and enhancing its clinical predictive ability in different NSCLC subtypes and stages. Additionally, CSC markers are not only closely related to the biological characteristics of tumors but are also influenced by factors such as the immune microenvironment, tumor metabolic features, and the responsiveness to external therapies. Therefore, future research could explore the application of CSC markers in immunotherapy and targeted therapies, particularly in the context of novel treatments such as immune checkpoint inhibitors and molecular-targeted drugs in which CSC characteristics may impact treatment efficacy and resistance. CONCLUSION This study provided new directions for the prognosis assessment and treatment of patients with stage IIIA NSCLC. OCT4, TSI, and other markers could serve as potential biomarkers for prognosis evaluation, assisting clinicians in formulating personalized treatment plans. However, before clinical application further validation of the effectiveness and reliability of these markers in various clinical settings is required, particularly in assessing prognosis across different tumor subtypes and treatment backgrounds. Additionally, with the development of molecular targeted therapies and immunotherapies, CSC markers may become new therapeutic targets, offering patients more treatment options. In conclusion CSC markers and TSI provide valuable information for the prognosis assessment of stage IIIA NSCLC, laying a foundation for further clinical research and the development of personalized treatment strategies.  Institutional review board statement:  Informed consent statement:  Conflict-of-interest statement:  Provenance and peer review:  Peer-review model:  Specialty type:  Country of origin:  Peer-review report’s classification  Scientific Quality:  Novelty:  Creativity or Innovation:  Scientific Significance:  P-Reviewer: S-Editor: L-Editor: P-Editor: 1 Ding CZ Wang GL Jiang GQ Wang HT Liu YY Zhang HL Sun F Wei L [circDDX17 targets miR-223-3p/RIP3 to regulate the proliferation and apoptosis of non-small cell lung cancer cells] Zhonghua Zhong Liu Za Zhi 2024 46 239 248 38494770 10.3760/cma.j.cn112152-20231024-00243 2 Maliarchuk K Ganul AV Borisyuk BO Bororov LV Shevchenko AI Sovenko VM Prospects of neoadjuvant chemoradiotherapy in patients with stage III A non-small cell lung cancer as a method of improving survival Wiad Lek 2022 75 2098 2102 36256935 10.36740/WLek202209109 3 Parisi S Ferini G Lillo S Brogna A Chillari F Ferrantelli G Settineri N Santacaterina A Platania A Leotta S Casablanca G Russo A Pontoriero A Adamo V Minutoli F Bottari A Cacciola A Pergolizzi S Stereotactic boost on residual disease after external-beam irradiation in clinical stage III non-small cell lung cancer: mature results of stereotactic body radiation therapy post radiation therapy (SBRTpostRT) study Radiol Med 2023 128 877 885 37294366 10.1007/s11547-023-01659-w 4 Chang JY Kim JH Kang J Park Y Park SJ Cheon JH Kim WH Kim H Park JJ Kim TI mTOR Signaling Combined with Cancer Stem Cell Markers as a Survival Predictor in Stage II Colorectal Cancer Yonsei Med J 2020 61 572 578 32608200 10.3349/ymj.2020.61.7.572 PMC7329744 5 Tsuchiya H Shiota G Clinical and Biological Implications of Cancer Stem Cells in Hepatocellular Carcinoma Yonago Acta Med 2021 64 1 11 33642898 10.33160/yam.2021.02.002 PMC7902159 6 Dai L Zhao X Ma L Li X Zuo D Li Y Wei B Sui Y Xu F [TNF-α activates PI3K/AKT pathway to promote proliferation of SW620(Lgr5+) colon cancer stem cells] Xi Bao Yu Fen Zi Mian Yi Xue Za Zhi 2020 36 33 41 32314722 7 Kalantari E Taheri T Fata S Abolhasani M Mehrazma M Madjd Z Asgari M Significant co-expression of putative cancer stem cell markers, EpCAM and CD166, correlates with tumor stage and invasive behavior in colorectal cancer World J Surg Oncol 2022 20 15 35016698 10.1186/s12957-021-02469-y PMC8751119 8 Li H Jin Y Zhu Y Shen B Xu Y Suppression of ZNF205-AS1/EGR4 positive feedback loop attenuates cisplatin resistance of non-small cell lung cancer cells via targeting miR-138-5p/OCT4 pathway J Thorac Dis 2024 16 296 310 38410545 10.21037/jtd-23-1171 PMC10894440 9 Xu J Liu J Mei S Zhou Q [Research Progress and Perspectives of Antibody-drug Conjugates Targeting Trophoblast Cell Surface Antigen-2 in Advanced Non-small Cell Lung Cancer] Zhongguo Fei Ai Za Zhi 2024 27 763 776 39631833 10.3779/j.issn.1009-3419.2024.101.25 PMC11629093 10 Sorf A Vagiannis D Ahmed F Hofman J Ceckova M Dabrafenib inhibits ABCG2 and cytochrome P450 isoenzymes; potential implications for combination anticancer therapy Toxicol Appl Pharmacol 2022 434 115797 34780725 10.1016/j.taap.2021.115797 11 Kosuge H Nakakido M Nagatoishi S Fukuda T Bando Y Ohnuma SI Tsumoto K Proteomic identification and validation of novel interactions of the putative tumor suppressor PRELP with membrane proteins including IGFI-R and p75NTR J Biol Chem 2021 296 100278 33428936 10.1016/j.jbc.2021.100278 PMC7948961 12 Sanchez DF Fernandez-Nestosa MJ Cañete-Portillo S Cubilla AL Evolving insights into penile cancer pathology and the eighth edition of the AJCC TNM staging system Urol Oncol 2022 40 215 222 33008752 10.1016/j.urolonc.2020.09.010 13 Robert ME Rüschoff J Jasani B Graham RP Badve SS Rodriguez-Justo M Kodach LL Srivastava A Wang HL Tang LH Troncone G Rojo F Van Treeck BJ Pratt J Shnitsa I Kumar G Karasarides M Anders RA High Interobserver Variability Among Pathologists Using Combined Positive Score to Evaluate PD-L1 Expression in Gastric, Gastroesophageal Junction, and Esophageal Adenocarcinoma Mod Pathol 2023 36 100154 36925069 10.1016/j.modpat.2023.100154 14 Park E Park SY Sun PL Jin Y Kim JE Jheon S Kim K Lee CT Kim H Chung JH Prognostic significance of stem cell-related marker expression and its correlation with histologic subtypes in lung adenocarcinoma Oncotarget 2016 7 42502 42512 27285762 10.18632/oncotarget.9894 PMC5173151 15 Shimada Y Saji H Nomura M Matsubayashi J Yoshida K Kakihana M Kajiwara N Ohira T Ikeda N Cancer stem cell-related marker expression in lung adenocarcinoma and relevance of histologic subtypes based on IASLC/ATS/ERS classification Onco Targets Ther 2013 6 1597 1604 24235845 10.2147/OTT.S52353 PMC3825709 16 Society of Cancer Precision of Chinese Anti-Cancer Association Lung Cancer Expert Group of Chinese Medical Journal Chinese Society of Clinical Oncology, Expert Committee on Non-small Cell Lung Cancer [Chinese expert consensus on the diagnosis and treatment of advanced RET fusion-positive non-small cell lung cancer (2023 edition)] Zhonghua Zhong Liu Za Zhi 2023 45 991 1002 38110308 10.3760/cma.j.cn112152-20230711-00290 17 Oncology Society of Chinese Medical Association [Chinese Medical Association guideline for clinical diagnosis and treatment of lung cancer (2024 edition)] Zhonghua Zhong Liu Za Zhi 2024 46 805 843 39045625 10.3760/cma.j.cn112152-20240510-00189 18 Joshi P Waghmare S Molecular signaling in cancer stem cells of tongue squamous cell carcinoma: Therapeutic implications and challenges World J Stem Cells 2023 15 438 452 37342225 10.4252/wjsc.v15.i5.438 PMC10277967 19 Xie WJ Li J Obesity and cancer stem cells: Roles in cancer initiation, progression and therapy resistance World J Stem Cells 2023 15 120 135 37181008 10.4252/wjsc.v15.i4.120 PMC10173809 20 Yu Z Sun J Fang K Xu J Yang J Chunlei D Gong Y Ma H SLC2A1 boosts the resistance of non-small cell lung cancer to taxanes by stimulating the formation of EPCAM(+) cancer stem-like cells via glycolysis Transl Oncol 2024 49 102082 39126936 10.1016/j.tranon.2024.102082 PMC11364050 21 Jeon HW Kim YD Sim SB Moon MH Significant difference in recurrence according to the proportion of high grade patterns in stage IA lung adenocarcinoma Thorac Cancer 2021 12 1952 1958 34037324 10.1111/1759-7714.13984 PMC8258359 22 Zhang J Qi MX Li YX Li XB Zhang GZ Chai YM [Oct4 promotes the progression and radioresistance of esophageal squamous cell carcinoma by regulating epithelial-mesenchymal transition] Zhonghua Zhong Liu Za Zhi 2024 46 1019 1028 39622734 10.3760/cma.j.cn112152-20230815-00084 23 Guo XP Chen YF Chen P Pan J Ying PT Zhao N Tang YM [Effect of Human Bone Marrow Mesenchymal Stem Cells with Ectopic High OCT4 Expression on T Lymphocyte Function] Zhongguo Shi Yan Xue Ye Xue Za Zhi 2023 31 1523 1530 37846711 10.19746/j.cnki.issn.1009-2137.2023.05.043 24 Tyagunova EE Drozd SF Kalennik OV Samoylenkova NS Savchenko EA Danilov GV Pavlova GV Prognostic model for assessing the human glioma cell malignancy grade based on MDM2, MELK, SOX2, CDK4, DR5 and OCT4 gene expression Zh Vopr Neirokhir Im N N Burdenko 2023 87 43 51 38054226 10.17116/neiro20238706143 25 Lu CS Shiau AL Su BH Hsu TS Wang CT Su YC Tsai MS Feng YH Tseng YL Yen YT Wu CL Shieh GS Oct4 promotes M2 macrophage polarization through upregulation of macrophage colony-stimulating factor in lung cancer J Hematol Oncol 2020 13 62 32487125 10.1186/s13045-020-00887-1 PMC7268452 26 Upadhyay VA Shah KA Makwana DP Raval AP Shah FD Rawal RM Putative stemness markers octamer-binding transcription factor 4, sex-determining region Y-box 2, and NANOG in non-small cell lung carcinoma: A clinicopathological association J Cancer Res Ther 2020 16 804 810 32930122 10.4103/jcrt.JCRT_213_18 27 Liu L Zhu H Liao Y Wu W Liu L Liu L Wu Y Sun F Lin HW Inhibition of Wnt/β-catenin pathway reverses multi-drug resistance and EMT in Oct4(+)/Nanog(+) NSCLC cells Biomed Pharmacother 2020 127 110225 32428834 10.1016/j.biopha.2020.110225 28 Wang X Qi L Chen M Zhang Y Gao X Cai Y Feasibility study of ADCs targeting TROP-2, HER2, and CD46 in Ductal Adenocarcinoma and Intraductal Carcinoma of the prostate World J Urol 2024 42 404 38990246 10.1007/s00345-024-05109-8 29 Izci H Punie K Waumans L Laenen A Wildiers H Verdoodt F Desmedt C Ardui J Smeets A Han SN Nevelsteen I Neven P Floris G Correlation of TROP-2 expression with clinical-pathological characteristics and outcome in triple-negative breast cancer Sci Rep 2022 12 22498 36577919 10.1038/s41598-022-27093-y PMC9797547 30 Belluomini L Avancini A Sposito M Milella M Rossi A Pilotto S Antibody-drug conjugates (ADCs) targeting TROP-2 in lung cancer Expert Opin Biol Ther 2023 23 1077 1087 36995069 10.1080/14712598.2023.2198087 31 Parisi C Mahjoubi L Gazzah A Barlesi F TROP-2 directed antibody-drug conjugates (ADCs): The revolution of smart drug delivery in advanced non-small cell lung cancer (NSCLC) Cancer Treat Rev 2023 118 102572 37230055 10.1016/j.ctrv.2023.102572 32 Yousaf M Ali M Modulation of ABCG2 surface expression by Rab5 and Rab21 to overcome multidrug resistance in cancer cells Xenobiotica 2020 50 988 996 31928387 10.1080/00498254.2020.1716107 33 Tan Y Cao K Ren G Qin Z Zhao D Li N Chen X Xia Y Lu Y Effects of the ABCB1 and ABCG2 polymorphisms on the pharmacokinetics of afatinib in healthy Chinese volunteers Xenobiotica 2020 50 237 243 31021303 10.1080/00498254.2019.1610585 34 Chen J Wang N Zhang H Zhang X Zhao L Zhu L Li Z Bei C [Lentivirus-mediated silencing of P75 neurotrophin receptor combined with nerve growth factor overexpression and transfection of bone marrow mesenchymal stem cells combined with demineralized bone matrix for heterotopic osteogenesis] Zhongguo Xiu Fu Chong Jian Wai Ke Za Zhi 2020 34 1438 1445 33191703 10.7507/1002-1892.202003166 PMC8171707 35 Meek S Singh-Dolt K Sutherland L Sharp MGF Del-Pozo J Walker D Burdon T Redundancy of p75NTR neurotrophin receptor function in development, growth and fertility in the rat Transgenic Res 2024 33 255 266 38981975 10.1007/s11248-024-00395-9 PMC11319401 36 Wu Z Fang Y Wu J Wang J Ling Y Liu T Tong Q Yao Y Activation of Glycolysis by MCM10 Increases Stemness and Paclitaxel Resistance in Gastric Cancer Cells Turk J Gastroenterol 2023 34 1107 1115 37860833 10.5152/tjg.2023.23169 PMC10724805 37 Zheng J Zhang YW Pan ZF [Dysregulation of MAD2L1/CAMK2A/PTTG1 Gene Cluster Maintains the Stemness Characteristics of Uterine Corpus Endometrial Carcinoma] Zhongguo Yi Xue Ke Xue Yuan Xue Bao 2021 43 685 695 34728029 10.3881/j.issn.1000-503X.13271 Data sharing statement No additional data are available. ",
  "metadata": {
    "Title of this paper": "[Dysregulation of MAD2L1/CAMK2A/PTTG1 Gene Cluster Maintains the Stemness Characteristics of Uterine Corpus Endometrial Carcinoma]",
    "Journal it was published in:": "World Journal of Stem Cells",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476815/"
  }
}