{
  "title": "Paper_659",
  "abstract": "Neurosci Bull Neurosci Bull 3225 neuroscibull Neuroscience Bulletin 1673-7067 1995-8218 Springer PMC11422540 PMC11422540.1 11422540 11422540 38589712 10.1007/s12264-024-01202-5 1202 1 Original Article Deletion of Luzp2 Cheng Cheng 1 2 Zhu Guangjie 1 2 Wang Kaijian 3 Bu Chuan 4 Li Siyu 1 Qiu Yue 1 Lu Jie 5 Ji Xinya 5 Hao Wenli 1 Wang Junguo 1 2 Zhu Chengwen 1 2 Yang Ye 1 2 Gu Yajun 1 Qian Xiaoyun 1 2 Yu Chenjie entphd@163.com 1 2 Gao Xia gaoxia@nju.edu.cn 1 2 1 https://ror.org/01rxvg760 grid.41156.37 0000 0001 2314 964X Department of Otolaryngology-Head and Neck Surgery, Drum Tower Hospital, Affiliated Hospital of the Medical School, Jiangsu Provincial Key Medical Discipline (Laboratory), Nanjing University, 2 3 https://ror.org/02afcvw97 grid.260483.b 0000 0000 9530 8833 Department of Otorhinolaryngology, Qidong People’s Hospital, Qidong Liver Cancer Institute, Affiliated Qidong Hospital of Nantong University, 4 grid.460072.7 The First Affiliated Hospital of Kangda College of Nanjing Medical University, The First People’s Hospital of Lianyungang, 5 grid.452743.3 0000 0004 1788 4869 Northern Jiangsu People’s Hospital Affiliated to Yangzhou University, 9 4 2024 10 2024 40 10 471399 1519 1528 7 9 2023 19 11 2023 01 10 2025 01 10 2025 26 09 2024 01 10 2025 © Center for Excellence in Brain Science and Intelligence Technology, Chinese Academy of Sciences 2024. Springer Nature or its licensor (e.g. a society or other partner) holds exclusive rights to this article under a publishing agreement with the author(s) or other rightsholder(s); author self-archiving of the accepted manuscript version of this article is solely governed by the terms of such publishing agreement and applicable law. 2024 Correction to: Deletion of Luzp2 40 10 2 8 2024 1597 1598 Neuroscience Bulletin PMC11422339 39093371 Deafness is the prevailing sensory impairment among humans, impacting every aspect of one's existence. Half of congenital deafness cases are attributed to genetic factors. Studies have shown that Luzp2 Luzp2 Luzp2 Luzp2 Luzp2 Luzp2 Luzp2 Keywords Hearing loss Luzp2 Hair cell Stereocilia Ribbon synapse pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Center for Excellence in Brain Science and Intelligence Technology, Chinese Academy of Sciences 2024 ",
  "metadata": {
    "Title of this paper": "Correction to: Deletion of ",
    "Journal it was published in:": "Neuroscience Bulletin",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11422540/"
  }
}