{
  "title": "Paper_1241",
  "abstract": "pmc Curr Issues Mol Biol Curr Issues Mol Biol 4181 cimb cimb Current Issues in Molecular Biology 1467-3037 1467-3045 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468540 PMC12468540.1 12468540 12468540 41020799 10.3390/cimb47090677 cimb-47-00677 1 Article Low Expression of Selenoprotein S Modulates Osteogenic Differentiation Through Bidirectional Regulation of the SP7 HSP47 COL1A1 SPARC Wu Hao Methodology Software Formal analysis Data curation Writing – original draft Visualization † Zhao Yun-Shan † Li Chun-Shen Shi Jing-Yi Li Yi Software Data curation Zhong Liang-Qiu-Yue Investigation Data curation Liu Yan Software https://orcid.org/0000-0001-8593-3923 Chen Xi Conceptualization Methodology Validation Resources Writing – review & editing Supervision Project administration Funding acquisition * Rizzo Maria Giovanna Academic Editor Department of Stomatology, First Affiliated Hospital, College of Medicine, Xi’an Jiaotong University, 277 Yanta West Road, Xi’an 710061, China; wuhaowuh@stu.xjtu.edu.cn * 13038598996@163.com † The two authors contributed equally to this work. 23 8 2025 9 2025 47 9 497442 677 11 7 2025 15 8 2025 18 8 2025 23 08 2025 27 09 2025 30 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Previous studies revealed that low expression of Selenoprotein S (SELS) could enhance osteogenic differentiation, but the underlying mechanisms remain unclear. In this study, we aimed to elucidate the role of SELS and its transcription-factor-based regulatory mechanism during osteogenic differentiation. In comparison with 12-week-old mice, which represent the stage of stable osteogenic differentiation, 3-week-old mice, representing the active ossification stage, showed significantly higher levels of SELS in the mandible. Transcriptomic analysis revealed that SELS is primarily associated with extracellular matrix organization and collagen biosynthesis during mandibular development. In bone marrow mesenchymal stem cells (BMSCs) with SELS knockdown, SP7 SP7 Sels SP7 HSP47 SP7 HSP47 SP7 COL1A1 SPARC SP7 HSP47 COL1A1 SPARC selenoprotein S osteogenic differentiation BMSCs collagen synthesis High Education Joint Research Project of Shanxi Province 2020GXLH-Y-014 This research was funded by High Education Joint Research Project of Shanxi Province, grant number 2020GXLH-Y-014. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Selenium is a vital trace element required for maintaining human health, primarily exerting its effects through its involvement in the synthesis of selenoproteins. These proteins play critical roles in antioxidant defense and endocrine regulation, with alterations in their expression impacting the functions of various cell types. Notably, multiple selenoproteins exhibit functions tightly linked to collagen synthesis and osteogenic differentiation, underscoring their crucial roles in bone tissue formation and regeneration. Among the 25 selenoproteins identified in humans, SELS predominantly resides in the endoplasmic reticulum, near the nucleus, and in the Golgi apparatus [ 1 2 3 4 5 Bone metabolism is a critical physiological function, with the long-term balance between bone resorption and bone formation being essential for overall health [ 6 7 SP7 8 9 SP7 COL1A1 SPARC 10 11 12 SP7 SP7 13 SP7 SP7 Our previous study revealed a discrepancy between the mRNA and protein expression levels of SELS during osteogenic induction and showed that low expression of SELS facilitates osteogenic differentiation [ 14 2. Materials and Methods 2.1. Cell Culture Bone Marrow Mesenchymal Stromal Cells (BMSCs, Procell, Wuhan, China) were maintained in α-MEM (Gibco, Grand Island, NE, USA) formulated with 10% fetal bovine serum (FBS; Cyagen, Guangzhou, China) and 1% penicillin–streptomycin (Beyotime, Shanghai, China), while 293T cells (Procell, Wuhan, China) were grown in DMEM (Gibco, Grand Island, NE, USA) under the same conditions, and the medium was renewed every two days. The cell culture incubator was kept at 37° and 5% CO 2 2.2. Cell Transfection After subculturing and plating the cells, lentiviral solution and the transfection reagent polybrene (Beyotime, Shanghai, China) were added to the cultures when the cell density reached approximately 30%. The cells were co-cultured for about 20 h, after which the medium was changed and the cells were maintained for a further 24 h. When the cell confluency was approximately 90%, the cells were subcultured again. Once the cells adhered, puromycin (Beyotime, Shanghai, China) was added, yielding a selection concentration of 5 µg/mL, and the selected cells were used for subsequent experiments. In this study, the lentiviral knockdown group was designated as “sh-Sels,” while the blank control group was designated as “sh-NC.” The SELS interference sequence used in this study was CAGGAAGATCTAAATGCCCAA. 2.3. Osteogenic Induction Osteogenic induction medium was prepared by supplementing the complete culture medium with dexamethasone, β-glycerophosphate, and ascorbic acid (Beyotime, Shanghai, China), and the final concentrations of the three components in the induction medium were adjusted to 0.1 μmol/L, 10 mmol/L, and 50 μg/mL, respectively. During the osteogenic induction process, the induction medium was replaced every other day. 2.4. Quantitative Real-Time PCR Total RNA was purified using a fast RNA isolation kit (Fastgen, Shanghai, China) and promptly converted into cDNA via reverse transcription. Gene expression levels were quantified via the 2 −ΔΔCT Table 1 2.5. Animals Sels Selenos Sels n Sels −/− n 2.6. Western Blotting Protein extraction was performed using RIPA buffer (Yamei, Shanghai, China), denatured via boiling, and separated via electrophoresis on a polyacrylamide gel (PAGE, Yamei, Shanghai, China). The mandibular bone tissue was ground into powder using cryogenic high-speed grinding, followed by routine protein extraction. After transfer to a PVDF membrane (Merck Millipore, Billerica, MA, USA), the proteins were blocked in 10% skim milk and subjected to incubation with primary and secondary antibodies. Finally, the membrane was immersed in ECL luminescent solution (MedChem Express, Monmouth Junction, NJ, USA) and imaged using a gel imaging system. The primary antibodies employed for the experiments included the following: anti-SELS (1:1000, Proteintech, Wuhan, China), anti- SP7 HSP47 SPARC 2.7. Immunohistochemical Staining The mandibles were fixed in 4% formalin (Service, Wuhan, China) at room temperature for one week. Subsequently, the mandibles were decalcified by immersion in 13% ethylenediaminetetraacetic acid (EDTA) solution (Service, Wuhan, China) at a volume at least 10 times greater than that of the tissue, using a shaker at room temperature, with the solution replaced every 2 days for a total of 14 days. Following decalcification, the tissues were embedded in paraffin. Sagittal sections approximately 5 μm thick were prepared along the dental arch to ensure the inclusion of the first and second molars. Sections were dewaxed sequentially in xylene and graded ethanol series, before being subjected to antigen retrieval via incubation in compound repair solution (Boster, Wuhan, China) at 37 °C for 30 min. After two washes with PBS (5 min each), endogenous peroxidase activity was blocked via incubation with 3% hydrogen peroxide (Boster, Wuhan, China) at 37 °C for 30 min, followed by two additional PBS washes (5 min each). Subsequently, sections were blocked with goat serum (Boster, Wuhan, China) at 37 °C for 30 min. After briefly draining the serum, the sections were incubated with the primary antibody for 2 h at 37 °C. The sections were treated with secondary antibodies, proceeding with DAB staining (ZSBio, Beijing, China) for 1 h. Later, the sections were stained with hematoxylin, subjected to routine dehydration, and mounted with neutral gum. The primary antibody utilized was anti- SP7 2.8. Immunofluorescence The pretreatment of tissue sections followed the same procedure as that used for immunohistochemistry. Following hydration, the sections were incubated with 0.1% Triton X-100 (Beyotime, Shanghai, China) for 15 min, followed by antigen retrieval at 37 °C for 30 min and blocking at 37 °C for 30 min. The sections were placed with the primary antibody and left to incubate at 37 °C for 2 h. Later, sections were kept with a fluorescence-conjugated secondary antibody at room temperature for 1 h, followed by nuclear counterstaining with DAPI (Beyotime, Shanghai, China) at room temperature for 10 min. Coverslips were then mounted with an anti-fade mounting medium (Beyotime, Shanghai, China). The primary antibodies applied were anti- SP7 COL1A1 2.9. Transcription Factor Target Gene Screening and Binding Sequence Prediction To investigate the molecular mechanisms via which SP7 SP7 15 16 SP7 HSP47 17 SP7 HSP47 SP7 HSP47 Table 2 2.10. The Dual-Luciferase Reporter Assay Based on bioinformatics predictions, we performed dual-luciferase reporter assays to examine the potential interaction between SP7 HSP47 SP7 2.11. Chromatin Immunoprecipitation To determine whether there is a direct regulatory relationship between SP7 HSP47 2.12. Transcriptome Analyses The transcriptomic analysis was based on both publicly available data derived from the GEO database ( GSE121197 14 GSE121197 GSE121197 p 2.13. Statistical Analysis Statistical differences were assessed using an unpaired two-tailed Student t-test, assuming data normality and applying a 95% confidence interval. The results of the luciferase reporter assay were statistically analyzed using one-way ANOVA. The analysis was conducted in GraphPad Prism software (version 6.0.0). Values are reported as the mean ± standard deviation (SD). 3. Results 3.1. Expression of SELS During the Active Phase of Osteogenesis To explore the expression dynamics of SELS during osteogenesis, proteins were extracted from the mandibular bones of 3-week-old and 12-week-old mice, representing the active and stable phases of osteogenesis, respectively. Western blot analysis revealed that SP7 Figure 1 Figure 1 3.2. SELS Expression Patterns and Related Transcriptomic Changes During Mandibular Osteogenesis To elucidate the regulatory mechanisms through which SELS influences osteogenic differentiation, we conducted a preliminary analysis using publicly available transcriptomic data. This dataset collected sequencing data from mandibular tissues of 12.5-day mouse embryos. In this study, sequencing data from the proximal and distal parts of the mandible in the control group were included, with three samples per group, totaling six samples, labeled as “proximal” and “distal,”, respectively. Given that different regions of the mandible at various developmental stages represent distinct levels of osteogenic differentiation, we first assessed the expression pattern of SELS during mandibular development. A significant difference in SELS expression was observed between the proximal and distal regions of the mandible ( Figure 2 Figure 2 Figure 2 Figure 2 Figure 2 Figure 2 3.3. Histological Analysis of the Impact of Low SELS Expression on Mandibular Bone To explore the role of Sels Sels SP7 Sels Figure 3 SP7 Figure 3 SP7 SP7 3.4. Identification of HSP47 as a Downstream Target of SP7 and Its Expression During Osteogenic Differentiation in BMSCs with Low SELS Expression We combined predictions from online databases with an osteogenesis-related gene set and identified HSP47 SP7 Figure 4 HSP47 Supplementary Figure S1 HSP47 Figure 4 HSP47 Figure 4 3.5. HSP47 Expression Is Regulated by SP7 Binding at Its Promoter Region To determine whether SP7 HSP47 Table 2 Figure 5 Figure 5 SP7 HSP47 Figure 5 SP7 HSP47 HSP47 SP7 SP7 HSP47 Figure 5 3.6. Upregulation of SP7 Downstream Targets COL1A1 and SPARC Under Conditions of Low SELS Expression To further clarify the downstream mechanisms by which SP7 SP7 COL1A1 SPARC COL1A1 SPARC Figure 6 COL1A1 Sels Figure 6 3.7. Mechanism Diagram The mechanism via which SELS regulates osteogenic differentiation through SP7 HSP47 COL1A1 SPARC Figure 7 SP7 HSP47 COL1A1 SPARC COL1A1 SPARC HSP47 SP7 4. Discussion In this study, we integrated bioinformatics with in vivo and in vitro experiments to assess the role of SELS in osteogenic differentiation. SELS expression was elevated in the mandibles of 3-week-old wild-type mice, representing the active ossification stage, compared to that in 12-week-old wild-type mice, which represent the stage of stable osteogenic differentiation. Through in vitro osteogenic induction of BMSCs with SELS knockdown, and assessment of SP7 Sels SP7 HSP47 SP7 HSP47 SP7 COL1A1 SPARC SP7 HSP47 COL1A1 SPARC Figure 7 Our earlier research revealed that the expression of SELS was altered during osteogenic differentiation, with discordant expression trends between mRNA and protein [ 14 18 19 To explore the regulatory role of SELS in osteogenic differentiation, we first assessed its expression dynamics and reanalyzed transcriptomic data previously generated and published by our research group [ 14 20 21 22 23 24 The roles of selenium and its associated selenoproteins in the human body are primarily related to antioxidation and homeostasis [ 25 26 27 28 2 4 29 4 SP7 30 31 SP7 COL1A1 SPARC SP7 8 SP7 SP7 13 SP7 To address this gap, we identified HSP47 SP7 HSP47 SP7 SP7 HSP47 HSP47 HSP47 32 33 HSP47 HSP47 34 HSP47 35 HSP47 36 HSP47 37 HSP47 COL1A1 SP7 COL1A1 SPARC SP7 SP7 COL1A1 38 SPARC 39 COL1A1 SPARC SP7 HSP47 SP7 COL1A1 SPARC HSP47 SP7 COL1A1 SPARC HSP47 SP7 HSP47 COL1A1 SPARC 5. Conclusions Our study demonstrates that SELS expression increases during the active phase of osteogenic differentiation. Low SELS expression promotes osteogenic differentiation by upregulating SP7 HSP47 COL1A1 SPARC SP7 HSP47 COL1A1 SPARC Acknowledgments I would like to show our gratitude to Jing-Hong Chen, who provided insights and great expertise in assisting. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at https://www.mdpi.com/article/10.3390/cimb47090677/s1 Author Contributions Conceptualization, X.C.; methodology, H.W., Y.-S.Z., C.-S.L., Y.L. (Yi Li) and X.C.; software, H.W. and Y.L. (Yi Li); validation, X.C.; formal analysis, H.W., Y.-S.Z. and J.-Y.S.; investigation, Y.-S.Z., J.-Y.S. and L.-Q.-Y.Z.; resources, X.C.; data curation, H.W., Y.-S.Z., C.-S.L. and Y.L. (Yan Liu); writing—original draft preparation, H.W.; writing—review and editing, X.C.; visualization, H.W.; supervision, X.C.; project administration, X.C.; funding acquisition, X.C. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The animal study protocol was approved by the Institutional Animal Care and Use Committees of Xi’an Jiao tong University (protocol code XJTUAE20–1984 and date of 24 June 2024). Informed Consent Statement Not applicable. Data Availability Statement The raw data supporting the conclusions of this article will be made available by the authors on request. Conflicts of Interest The authors declare no conflicts of interest. References 1. Bubenik J.L. Miniard A.C. Driscoll D.M. Alternative transcripts and 3′UTR elements govern the incorporation of selenocysteine into selenoprotein S PLoS ONE 2013 8 e62102 10.1371/journal.pone.0062102 23614019 PMC3628699 2. Ghelichkhani F. Gonzalez F.A. Kapitonova M.A. Schaefer-Ramadan S. Liu J. Cheng R. Rozovsky S. Selenoprotein S: A versatile disordered protein Arch. Biochem. Biophys. 2022 731 109427 10.1016/j.abb.2022.109427 36241082 PMC10026367 3. Blackwood E.A. MacDonnell L.F. Thuerauf D.J. Bilal A.S. Murray V.B. Bedi K.C. Jr. Margulies K.B. Glembotski C.C. Noncanonical Form of ERAD Regulates Cardiac Hypertrophy Circulation 2023 147 66 82 10.1161/CIRCULATIONAHA.122.061557 36317534 PMC9797446 4. Gao Y. Hannan N.R. Wanyonyi S. Konstantopolous N. Pagnon J. Feng H.C. Jowett J.B. Kim K.H. Walder K. Collier G.R. Activation of the selenoprotein SEPS1 gene expression by pro-inflammatory cytokines in HepG2 cells Cytokine 2006 33 246 251 10.1016/j.cyto.2006.02.005 16574427 5. Ye Y. Bian W. Fu F. Hu J. Liu H. Selenoprotein S inhibits inflammation-induced vascular smooth muscle cell calcification J. Biol. Inorg. Chem. 2018 23 739 751 10.1007/s00775-018-1563-7 29721770 6. Jin J. Huang R. Chang Y. Yi X. Roles and mechanisms of optineurin in bone metabolism Biomed. Pharmacother. 2024 172 116258 10.1016/j.biopha.2024.116258 38350370 7. Cichocka E. Górczyńska-Kosiorz S.B. Niemiec P. Trautsolt W. Gumprecht J. The Impact of Selected COL1A1 Int. J. Mol. Sci. 2025 26 4981 10.3390/ijms26114981 40507792 PMC12154782 8. Liu Q. Li M. Wang S. Xiao Z. Xiong Y. Wang G. Recent Advances of Osterix Transcription Factor in Osteoblast Differentiation and Bone Formation Front. Cell Dev. Biol. 2020 8 601224 10.3389/fcell.2020.601224 33384998 PMC7769847 9. Qu S. Wu J. Bao Q. Yao B. Duan R. Chen X. Li L. Yuan H. Jin Y. Ma C. Osterix promotes the migration and angiogenesis of breast cancer by upregulation of S100A4 expression J. Cell Mol. Med. 2019 23 1116 1127 10.1111/jcmm.14012 30450809 PMC6349213 10. Ortuño M.J. Susperregui A.R. Artigas N. Rosa J.L. Ventura F. Osterix induces COL1A1 Bone 2013 52 548 556 10.1016/j.bone.2012.11.007 23159876 11. Niger C. Lima F. Yoo D.J. Gupta R.R. Buo A.M. Hebert C. Stains J.P. The transcriptional activity of osterix requires the recruitment of Sp1 to the osteocalcin proximal promoter Bone 2011 49 683 692 10.1016/j.bone.2011.07.027 21820092 PMC3170016 12. Yang Y. Huang Y. Zhang L. Zhang C. Transcriptional regulation of bone sialoprotein gene expression by Osx Biochem. Biophys. Res. Commun. 2016 476 574 579 10.1016/j.bbrc.2016.05.164 27261434 13. Lee S.J. Lee E.H. Park S.Y. Kim J.E. Induction of fibrillin-2 and periostin expression in Osterix-knockdown MC3T3-E1 cells Gene 2017 596 123 129 10.1016/j.gene.2016.10.018 27751812 14. Wu H. Shi J.Y. Zhao Y.S. Shi Y.W. Zhong L.Q. Feng H.N. Liu Y. Chen J.H. Chen X. Low Expression of Selenoprotein S Promotes Osteogenic Differentiation in Bone Marrow Mesenchymal Stromal Cells Biol. Trace Elem. Res. 2025 1 10 10.1007/s12011-025-04657-3 40342061 15. Kolmykov S. Yevshin I. Kulyashov M. Sharipov R. Kondrakhin Y. Makeev V.J. Kulakovskiy I.V. Kel A. Kolpakov F. GTRD: An integrated view of transcription regulation Nucleic Acids Res. 2021 49 D104 D111 10.1093/nar/gkaa1057 33231677 PMC7778956 16. Taing L. Dandawate A. L’Yi S. Gehlenborg N. Brown M. Meyer C.A. Cistrome Data Browser: Integrated search, analysis and visualization of chromatin data Nucleic Acids Res. 2024 52 D61 D66 10.1093/nar/gkad1069 37971305 PMC10767960 17. Rauluseviciute I. Riudavets-Puig R. Blanc-Mathieu R. Castro-Mondragon J.A. Ferenc K. Kumar V. Lemma R.B. Lucas J. Chèneby J. Baranasic D. JASPAR 2024: 20th anniversary of the open-access database of transcription factor binding profiles Nucleic Acids Res. 2024 52 D174 D182 10.1093/nar/gkad1059 37962376 PMC10767809 18. Kim C.Y. Kim K.H. Dexamethasone-induced selenoprotein S degradation is required for adipogenesis J. Lipid Res. 2013 54 2069 2082 10.1194/jlr.M034603 23687306 PMC3708358 19. Jiao Z. Chai H. Wang S. Sun C. Huang Q. Xu W. SOST gene suppression stimulates osteocyte Wnt/β-catenin signaling to prevent bone resorption and attenuates particle-induced osteolysis J. Mol. Med. 2023 101 607 620 10.1007/s00109-023-02319-2 37121919 PMC10163143 20. Selvaraj V. Sekaran S. Dhanasekaran A. Warrier S. Type 1 collagen: Synthesis, structure and key functions in bone mineralization Differentiation 2024 136 100757 10.1016/j.diff.2024.100757 38437764 21. Su H. Liao Y. Yuan X. Huang J. Chen Y. Zhao B. G/ β- TCP composite scaffold material promotes osteogenic differentiation of bone marrow mesenchymal stem cells J. Biomed. Mater. Res. B Appl. Biomater. 2023 111 2025 2031 10.1002/jbm.b.35302 37530537 22. Xu S. Chen Y. Miao J. Li Y. Liu J. Zhang J. Liang J. Chen S. Hou S. Esculin inhibits hepatic stellate cell activation and CCl 4 Phytomedicine 2024 128 155465 10.1016/j.phymed.2024.155465 38471319 23. Sofyanti Putri R. Putra A. Chodidjah D. Masyitah Darlan D. Trisnadi S. Thomas S. Amalina N.D. Candra Irawan R. Clitorea ternatea flower extract induces platelet-derived growth factor(PDGF) and GPx gene overexpression in ultraviolet (UV) B irradiationinduced collagen loss Med. Glas. 2023 20 15 21 10.17392/1530-22 36692983 24. Robin M. Mouloungui E. Castillo Dali G. Wang Y. Saffar J.L. Pavon-Djavid G. Divoux T. Manneville S. Behr L. Cardi D. Mineralized collagen plywood contributes to bone autograft performance Nature 2024 636 100 107 10.1038/s41586-024-08208-z 39567697 PMC11618095 25. Mojadadi A. Au A. Salah W. Witting P. Ahmad G. Role for Selenium in Metabolic Homeostasis and Human Reproduction Nutrients 2021 13 3256 10.3390/nu13093256 34579133 PMC8469766 26. Qi Z. Duan A. Ng K. Selenoproteins in Health Molecules 2023 29 136 10.3390/molecules29010136 38202719 PMC10779588 27. Hu X. Li B. Wu F. Liu X. Liu M. Wang C. Shi Y. Ye L. GPX7 Facilitates BMSCs Osteoblastogenesis via ER Stress and mTOR Pathway J. Cell Mol. Med. 2021 25 10454 10465 10.1111/jcmm.16974 34626080 PMC8581313 28. Qin Q. Yang H. Guo R. Zheng Y. Huang Y. Jin L. Fan Z. Li W. FAM96B negatively regulates FOSL1 to modulate the osteogenic differentiation and regeneration of periodontal ligament stem cells via ferroptosis Stem Cell Res. Ther. 2024 15 471 10.1186/s13287-024-04083-7 39696611 PMC11656916 29. Wang H. Li Z. Liu Y. Zhang M. Shi Y. Zhang Y. Mi G. Wang M. He Y. Chen Y. Effects of Selenoprotein S Knockdown on Endoplasmic Reticulum Stress in ATDC5 Cells and Gene Expression Profiles in Hypertrophic Chondrocytes Biol. Trace Elem. Res. 2023 201 1965 1976 10.1007/s12011-022-03313-4 35725994 30. Gopinathan G. Luan X. Diekwisch T.G.H. Epigenetic Repression of RUNX2 and OSX Promoters Controls the Nonmineralized State of the Periodontal Ligament Genes. 2023 14 201 10.3390/genes14010201 36672941 PMC9858805 31. Fan Y. Cui C. Rosen C.J. Sato T. Xu R. Li P. Wei X. Bi R. Yuan Q. Zhou C. Klotho in Osx + Signal Transduct. Target. Ther. 2022 7 155 10.1038/s41392-022-00957-5 35538062 PMC9090922 32. Bellaye P.S. Burgy O. Bonniaud P. Kolb M. HSP47 Expert. Opin. Ther. Targets 2021 25 49 62 10.1080/14728222.2021.1861249 33287600 33. Marini J.C. Blissett A.R. New genes in bone development: What’s new in osteogenesis imperfecta J. Clin. Endocrinol. Metab. 2013 98 3095 3103 10.1210/jc.2013-1505 23771926 PMC3733862 34. Herbert A. Osteogenesis imperfecta type 10 and the cellular scaffolds underlying common immunological diseases Genes. Immun. 2024 25 265 276 10.1038/s41435-024-00277-4 38811682 35. Khan E.S. Däinghaus T. HSP47 Clin. Transl. Med. 2024 14 e1755 10.1002/ctm2.1755 39135385 PMC11319607 36. Ito S. Nagata K. Biology of HSP47 Semin. Cell Dev. Biol. 2017 62 142 151 10.1016/j.semcdb.2016.11.005 27838364 37. Abraham E.T. Oecal S. Mörgelin M. Schmid P.W.N. Buchner J. Baumann U. Gebauer J.M. Collagen’s primary structure determines collagen: HSP47 J. Biol. Chem. 2021 297 101169 10.1016/j.jbc.2021.101169 34487762 PMC8626583 38. Devos H. Zoidakis J. Roubelakis M.G. Latosinska A. Vlahou A. Reviewing the Regulators of COL1A1 Int. J. Mol. Sci. 2023 24 10004 10.3390/ijms241210004 37373151 PMC10298483 39. Ghanemi A. Yoshioka M. St-Amand J. Therapeutic Potential of Exercise-Induced SPARC in Bone Health? Biomedicines 2025 13 945 10.3390/biomedicines13040945 40299645 PMC12024751 Figure 1 Expression of SELS at different stages of osteogenic differentiation. ( A SP7 B C B SP7 C p Figure 2 Transcriptomic analysis of SELS-related osteogenic regulation. ( A B C D E F n p Figure 3 Histological analysis of the effects of Sels A SP7 Sels B SP7 C SP7 Sels D SP7 Sels −/− Sels n p p Figure 4 The identification of HSP47 SP7 A HSP47 SP7 B HSP47 C D HSP47 Sels p p Figure 5 SP7 HSP47 A B SP7 HSP47 C D SP7 SP7 p p Figure 6 Expression of SP7 COL1A1 SPARC A COL1A1 SPARC B COL1A1 SPARC C D COL1A1 SPARC E COL1A1 Sels F COL1A1 Sels Sels −/− n p p p Figure 7 Mechanism via which SELS regulates osteogenic differentiation. SELS, located in the endoplasmic reticulum, indirectly modulates the expression of the osteogenesis-related transcription factor SP7 SP7 SP7 HSP47 COL1A1 SPARC HSP47 COL1A1 SPARC cimb-47-00677-t001_Table 1 Table 1 Primers for qPCR. Genes Forward Reverse  Gapdh 5′-TTGATGGCAACAATCTCCAC-3′ 5′-CGTCCCGTAGACAAAATGGT-3′  Selenos 5′-GCТGGСТАGТТGGТАGGТТGА-3′ 5′-CGCATCCCGTCACAGAGA-3′  HSP47 5′-GCAGCAGCAAGCAACACTACAACT-3′ 5′-AGAACATGGCGTTCACAAGCAGTG-3′  COL1A1 5′-GCTCCTCTTAGGGGCCACT-3′ 5′-CCACGTCTCACCATTGGGG-3′  SPARC 5′-ACCCCCGGCAATTTCATGG-3′ 5′-TGTCTTCCCAGCTCTTGATGTAA-3′ cimb-47-00677-t002_Table 2 Table 2 Predicted SP7 HSP47 Matrix ID Name Score Sequence ID Start End Strand Predicted Sequence UN0264.1 UN0264.1. SP7 8.447574 NC_000073.7 1515 1525 − AGCTTTAATCA UN0264.1 UN0264.1. SP7 8.249999 NC_000073.7 22 32 − TTCTATTATCA UN0264.1 UN0264.1. SP7 7.20972 NC_000073.7 1379 1389 + AGCTAGAATTC UN0264.1 UN0264.1. SP7 7.020698 NC_000073.7 1264 1274 + TGCTGTATTTA UN0264.1 UN0264.1. SP7 6.8002434 NC_000073.7 615 625 + CTCTATAACTG ",
  "metadata": {
    "Title of this paper": "Therapeutic Potential of Exercise-Induced SPARC in Bone Health?",
    "Journal it was published in:": "Current Issues in Molecular Biology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468540/"
  }
}