{
  "title": "Paper_1039",
  "abstract": "pmc Medicina (Kaunas) Medicina (Kaunas) 3494 medicina medicina Medicina 1010-660X 1648-9144 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471955 PMC12471955.1 12471955 12471955 41011057 10.3390/medicina61091666 medicina-61-01666 1 Article Synchronous/Metachronous Prostate Cancer with Other Cancer Sites—The Experience of a Single Center in Romania Rahnea-Nita Gabriela Software Data curation Writing – original draft 1 2 Dumitru Mihaela Methodology Formal analysis Writing – review & editing 3 Nechifor Alexandru Resources Funding acquisition 4 Rahnea-Nita Roxana-Andreea Software Visualization 2 5 * Maier Adrian-Cornel Data curation 4 * Andronache Liliana Florina Conceptualization Data curation 6 Cernea Andreea 3 Rebegea Alexandru 4 Rebegea Laura-Florentina Validation Supervision 3 4 Lusuardi Lukas Academic Editor 1 gabriela.rahnea-nita@umfcd.ro 2 3 mihaeladumitru11@yahoo.com cernea_georgia@yahoo.com laura.rebegea@ugal.ro 4 alexandru.nechifor@ugal.ro alexandru.rebegea20@gmail.com 5 6 liliana.andronache@umfcd.ro * roxana.rahnea-nita@umfcd.ro adrian.maier@ugal.ro 14 9 2025 9 2025 61 9 497654 1666 28 7 2025 27 8 2025 10 9 2025 14 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Published by MDPI on behalf of the Lithuanian University of Health Sciences. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background and Objectives Materials and Methods Results Conclusions multiple primary malignancy synchronous/metachronous prostate cancer staging therapeutic management This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction In order to diagnose multiple primary malignancies (MPMs), it is necessary that the following criteria be met: each tumor must be malignant, it must be different histopathologically, and the possibility that one tumor is the metastasis of another must be ruled out [ 1 Multiple primary malignancies (MPMs) can be synchronous or metachronous. Synchronous tumors are those that occur at the same time or within a two-month interval, according to the definition provided by the Surveillance Epidemiology and End Results (SEER) project, or within a 6-month interval, according to the definition provided by the International Association of Cancer Registries and International Agency for Research on Cancer (IACR/IARC) [ 1 2 3 4 The incidence of multiple primary malignancies was 1.63% in a study conducted in Taiwan on 109,054 cancer patients, monitored for a period of 25 years. In most patients (70.87%), the second cancer occurred after two months [ 5 The risk factors for MPMs are viral infections, genetic factors (BRCA1, BRCA2, HOX B13 mutations, mismatch repair genes, genetic instability, and Lynch Syndrome), chronic inflammation, environmental factors, betel quid chewing habit, chemotherapy, and any history of previous radiotherapy [ 6 7 8 9 10 11 12 13 14 15 The general mechanisms involved in the occurrence of synchronous and metachronous prostate cancers are BRCA1 and BRCA2 genetic mutations, TP 53 mutation, genomic instability and MMR gene mutations in Lynch syndrome, any history of previous radiotherapy (radiation-induced cancers—rectal, bladder, or colon cancer occurring after radiotherapy for prostate cancer or the occurrence of prostate cancers after radiotherapy for bladder or rectal cancers), and hormonal therapy with antiandrogens that can alter hormonal balance and induce other types of cancers, such as breast cancer in men, which is very rare, but possible. The management of patients with multiple primary malignancies (MPMs) is often difficult. It is performed by a multidisciplinary team whose purpose is to individualize the treatment plan and to determine the strategies that will improve the patient’s care [ 16 17 18 19 20 21 Prostate cancer occurs most commonly in men aged 45–60 years; it is the second most common type of cancer in men worldwide, has the most common cause related to cancer in Western countries, and ranks fifth worldwide in terms of cancer-related mortality in men [ 22 23 24 25 Post-therapeutic evolution is directly influenced by tumor grading and the stage of cancer at the time of treatment initiation. Prostate cancer has a second metachronous site, i.e. colorectal cancer, thus ranking second in terms of metachronous associations. Head and neck cancer have esophageal cancer as a second metachronous site, thus ranking first in terms of metachronous associations [ 5 26 2. Materials and Methods This cohort study was conducted at “Sf. Apostol Andrei” County Emergency Hospital in Galati, Romania. In this retrospective study, we analyzed 26 patients with prostate cancer either synchronous or metachronous with another cancer site, registered at “Sf. Apostol Andrei” County Emergency Hospital in Galati, Romania, over a 15-year time period (2010–2025). Inclusion and Exclusion Criteria  The inclusion criteria were - Age > 18 years; - Patients with a histopathologically confirmed diagnosis of prostate cancer; - Patients with a histopathologically confirmed diagnosis of a second primary cancer; - Comprehensive pretherapeutic assessment; - Patients who signed the informed consent form.  The exclusion criteria were - Patients without a histopathologically confirmed diagnosis of prostate cancer and a second or third primary cancer; - <6 months of available followup data; - Patients who did not sign the informed consent form.  Data collection: The patients’ files were reviewed for information regarding the diagnosis, the stage of the disease, the date of the positive histopathological result, and the complex treatment and follow-up of prostate cancer and cancer/cancers with another site. The date of diagnosis was defined as the date of the positive histopathological result. The data were recorded until the date of the last visit or until the time of death. 3. Results The median age of 26 patients was 72.5 years (ranging from 56 to 83 years). The first tumor site was prostate for 14 patients (53.86%); 3 patients (11.54%) had renal cancer as the first tumor site. The second tumor site was prostate for 10 patients (38.46%), each lung for 4 patients (15.38%), and colon-rectum for 5 patients. The third tumor site was prostate for 2 patients (7.69%), colon-rectum for 2 patients (7.69%) and pancreas for 1 patient (3.85%) ( Table 1 The first tumor site occurred between 2010 and 2024. The histopathological diagnosis for the first tumor site was adenocarcinoma in 16 cases (61.54%). For the first tumor, the treatment performed was surgery in 12 cases (46.15%), external beam radiotherapy in 15 cases (57.69%), chemotherapy in 4 patients (15.38%), and hormonal therapy in 10 cases (38.46%) ( Table 2 The second tumor site occurred between 2014 and 2024. The histopathological diagnosis for the second tumor site was adenocarcinoma in 18 cases (69.23%) and papillary carcinoma in 3 cases (2 patients were diagnosed with thyroid cancer and 1 patient was diagnosed with bladder neoplasm). For the second tumor, the treatment performed was surgery in 16 cases (61.53%), external beam radiotherapy in 10 cases (38,46%), chemotherapy in 6 patients (23.07%), and hormonal therapy in 9 cases (30.77%) ( Table 3 The third tumor sites occurred between 2020 and 2025. The histopathological diagnosis for the third tumor site was adenocarcinoma for all patients. For the third tumor, the treatment performed was surgery in two cases (40%), external beam radiotherapy in three cases (60%), and hormonal therapy in two cases (40%) ( Table 4 The most frequent combinations are shown in Table 5 The mean time interval between the first and the second tumor site occurrence was 54 months (ranging from 1 to 180 months); 2 cases had synchronous cancers and 24 patients had metachronous neoplasm ( Table 6 Table 7 Table 8 Regarding Gleason score, we have made a comparison between two groups: the first group included patients with first primary prostate cancer and the second group patients with prostate cancer as the second or third neoplasm. This analysis concluded that 3 patients from the first group and 4 patients from the second group had a Gleason score of 6; 6 patients from the first group and 3 patients from the second group has a Gleason score of 7; and 1 patient from the first group and 4 patients from the second group had a Gleason score of 9. A Gleason score of 8 was encountered in three patients in the first group and two patients in the second group (with prostate cancer as the second or third neoplasm); this comparison was not statically significant, p Survival analysis. Figure 1 p Figure 2 We performed an analysis on the survival rate, using Gleason score ( Figure 3 Figure 4 p p In order to explore more factors influencing survival, we performed a multiple linear regression test, analyzing the influence of Gleason score and sequencing of prostate tumor (the first, second, or third neoplasia) on overall survival. These analyses revealed that none of these factors influenced survival in any significant way ( Table 9 4. Discussion The survival of cancer patients has improved globally in recent years, thanks to early diagnostic methods, screening, and the development of systemic therapies, targeted therapies, and radiotherapy techniques. Patients who have survived one neoplastic site occurrence may develop a second or even a third neoplastic site during their lifetime, and the incidence of multiple primary synchronous or metachronous cancers has increased in recent years. Our cohort of patients is heterogeneous, with various diagnoses and different types of sequencing. Prostate tumors, as a first, second, or third tumor site, were encountered in 50%, 42.31%, and 7.69% of patients, respectively. In our patients, there were more cases of second and third primary metachronous neoplasms of prostate cancer with a 9 Gleason score than cases of first primary neoplasms of prostate cancer; in these cases, we might interpret this as an increase in the aggressiveness of prostate cancer when it appears as a metachronous second site. In 8 out of the 26 patients in our study group, the metachronous prostate tumor was associated with another site occurrence, namely, cancer of the urogenital system, as follows: 4 cases of bladder urothelial tumors and 4 cases of Gravitz-type renal tumors. In our study, the treatment of prostate cancer was determined according to the recommendations of the urologic oncology guidelines: total androgenic blockade or radiotherapy/radical prostatectomy in cases where the tumor is localized. In 2024, Zhang Y et al. published the case of a patient with synchronous prostate and kidney cancer and revealed that the treatment was surgical (prostatectomy and nephrectomy) for localized tumors, while in synchronous metastasized cancers, the starting point of metastases must be investigated in order to determine an adequate treatment [ 27 27 In our study, there were three patients with prostate and renal cancer. In two of them (patient no. 12 and patient no. 26), renal cancer was the primary tumor site, while in one patient (patient no. 25), prostate cancer was the primary tumor site. All three patients underwent surgery for renal cancer. Regarding prostate cancer, patient no. 12 received ADT, while patients nos. 25 and 26 received EBRT and ADT. In 2023, Bunnag N et al. published the case of an 84-year-old patient with synchronous prostate and lung cancer, revealing that the therapeutic strategy was different from prostate cancer with single-lung metastasis, a situation that is extremely rare in the initial staging of prostate cancer [ 28 In 2021, Sarkar S et al. published the case of a patient with synchronous prostate and lung cancer that started with symptoms specific to both lung cancer (cough and hemoptysis) and prostate cancer (difficulty in eliminating urine), within a one-month interval [ 29 Four patients in our study had prostate cancer and lung cancer. In all four patients, lung cancer was the second neoplastic site. The patients were tested for genetic mutations and the three of them who were EGFR-, ALK-, and PDL1-negative, underwent systemic treatment. One patient had an EGFR mutation (patient no. 5) and thus underwent a third-generation anti-TKI treatment with Osimertinib, at present exhibiting a stable pulmonary condition. Prostate cancer was treated with surgery in patient no. 2, with EBRT in patient no. 5, with EBRT plus ADT in patient no. 4, and with EBRT plus ADT plus ARPI in patient no. 1. In 2020, Luqman W et al. published the case of a patient with synchronous prostate cancer and sarcoma with bone metastases, for whom a diagnosis of leiomyosarcoma was made through the biopsy of bone metastasis from the iliac bone [ 30 30 There was a patient in our study (patient no. 19) with three cancer sites, two of which were prostate cancer and sarcoma (leiomyosarcoma), the third site being colon cancer. The treatment for prostate cancer was EBRT plus ADT, while the treatment for sarcoma consisted of surgery plus adjuvant EBRT; the colon cancer was treated with surgery. In 2025, Edfelt E et al. published the largest cohort study on synchronous prostate and rectal cancer [ 31 31 B.U. Sidiqi et al. also conducted a retrospective study over a 5-year period (2017–2022) and identified 10 patients out of 2204 prostate cancer patients with synchronous rectal cancer [ 32 32 In 2023, Sossa J et al. published the case of a patient with metachronous prostate cancer, with the second site being breast cancer, and revealed that the treatment must combine the known therapy for each one of them [ 33 In our study, we had a patient with breast cancer as the first tumor site, with prostate cancer as the second site (patient no. 20). The treatment for breast cancer consisted of surgery, radiotherapy, and chemotherapy plus hormone therapy (5 years), while the treatment for prostate cancer consisted of definitive EBRT plus ADT. Regarding the association between prostate cancer and breast cancer, which occurred in patient no. 20, a study published by Abhyankar N et al., in 2017, concluded that the incidence of prostate cancer in men with a history of breast cancer is similar to the general population [ 34 There is a question related to patient no. 20 (a male patient) with a first neoplasia of breast cancer and the second of prostate cancer; the latter occurred within a 3-year interval. Might this case have a hormonal component? Family history is also an important risk factor in prostate cancer. There is evidence that prostate and breast cancers can occur together in some patients, the hereditary breast cancer-related gene 2 (BRCA2) being identified to contribute to these conditions [ 35 36 37 38 BRCA2 mutations significantly increase the risk of both prostate and breast cancer in men. While men generally have a low risk of developing breast cancer, BRCA2 mutations raise that risk substantially, and they also increase the likelihood of developing prostate cancer, potentially at a younger age and with more aggressive forms. The association of breast cancer and prostate cancer (patient no. 20) is very rare, and in terms of sequencing, most case reports show the occurrence of prostate cancer as the primary neoplasm, and breast cancer occurs more frequently as the second cancer site in a metachronous association. There have been some published cases about synchronous occurrence [ 39 In 2022, Millican J et al. published the experience of a single facility in Western Sydney, Australia, regarding 15 patients with synchronous/metachronous prostate and rectal cancer, over the period between 1 January, 2008, and 1 January, 2020, revealing that there was an increase in the incidence of the two cancer types over time, these two ranking second and third after lung cancer [ 40 40 In our study, there were two patients with rectal and prostate cancer (patient no. 17 and patient no. 22), with rectal cancer being the second cancer site. The treatment for rectal cancer consisted of surgery in one patient, whereas in the second patient, surgery and EBRT plus chemotherapy were performed. Patient no. 17 underwent EBRT plus ADT (36 months) for prostate cancer, while patient no. 22 underwent EBRT upon relapse plus ADT. Patient no. 5, as previously mentioned, had three cancer sites, namely, prostate, lung, and rectum. In 2024, Hoshi S et al. published three cases of prostate cancer with metachronous urothelial cancer (both ureteral and renal pelvis), revealing that in the follow-up process of patients with urological cancer, it is important to monitor not only the progression of the first urological cancer but also the possibility of occurrence of a second urological cancer [ 41 41 We had four patients with bladder and prostate cancer in our study; in two of them (patient no. 14 and patient no. 21), bladder cancer was the first site, while in the other two patients (patient no. 3 and patient no. 7), prostate cancer was the first site. The treatment for bladder cancer consisted of TUR-V plus CHT instillation in one patient, TUR-V plus EBRT upon relapse in one patient, surgery in one patient, and TUR-V plus CHT in one patient. The treatment for prostate cancer consisted of EBRT plus ADT + ARPI in one patient, EBRT plus ADT in one patient, and surgery in two patients. In 2021, Zhao T et al. published the case of a patient with triple metachronous cancer sites of the kidney, prostate, and squamous cell carcinoma of the lung, and it revealed that genetic analysis is essential in the diagnosis of triple cancers [ 42 42 In our study, we had five patients with three metachronous cancer sites, with prostate cancer being the third tumor site in two patients (patient no. 18 and patient no. 25). In the other three patients, the third cancer site was the rectum, colon, and pancreas. Regarding the association between thyroid cancer, renal cancer, and prostate cancer found in one of the patients in our study, namely, patient no. 18, a study in the specialized literature published by Bellini et al. in 2022, reveals that there is a common association between thyroid cancer and other cancers such as prostate cancer, breast cancer, colorectal cancer, and renal cancer [ 35 35 There is a question arising from this analysis, namely, whether there is a causality connection between radiotherapy and the second cancer appearance (radio-induced cancer) in those cases in which the second cancer occurred after the performance of radiotherapy for the first cancer site; this might be a possible cause for the following patients: no. 17 (prostate cancer in 2014 and rectum cancer in 2024) and no. 21 (bladder cancer in 2015 and prostate cancer in 2024). Case 17 developed upper rectal cancer 10 years after radiotherapy for prostate cancer. Surgery followed by chemotherapy was performed for rectal cancer. It is possible that this cancer was radiation-induced. Prostate cancer survivors treated with prior radiotherapy are at increased risk of developing rectal cancer compared to those treated with prostatectomy [ 43 There are studies that do not show a statistically significant association between rectal cancer and a history of radiotherapy to the prostate [ 44 Other authors have found a risk of developing bladder cancer after radiotherapy for prostate cancer [ 44 Regarding patient no. 21, he developed prostate cancer 9 years after undergoing radiotherapy for bladder cancer. Also, in this case, there is a possibility that it was a radiation-induced cancer. There is very little information in the literature on the occurrence of prostate cancer after radiotherapy for bladder cancer; most studies have investigated the incidence of bladder, rectal, and colon cancers after radiotherapy for prostate cancer. However, Wallis’ meta-analysis of eight studies with 157,239 participants found an increased incidence of rectal cancer after radiotherapy for prostate cancer in unadjusted analysis. Moreover, a 5-year analysis of three studies with 204,064 patients found no statistically significant association, noting that there was considerable heterogeneity between studies and between radiotherapy techniques [ 45 The latency period between radiotherapy performed for a primary site and a second malignancy occurring in the treated volume is estimated on average at 10 years after radiotherapy [ 45 Also, the implications of a high proportion of urological second primary sites (bladder or renal) suggest possible shared etiologic factors that are worth emphasizing in follow-up strategies. We observed a higher Gleason score in patients who developed metachronous prostate cancer. It is possible that previous therapies for the first neoplastic site used resistant clones. These tumors are also characterized by genomic instability, and studies show that patients who later develop prostate cancer may have more aggressive forms. In this regard, patients who have been treated for a primary neoplasm are recommended to be monitored to detect relapses, to monitor complications of oncological treatments, and to detect the appearance of a second cancer. A study published in 2019, analyzing 30,964 patients, found that in patients with prostate cancer in Taiwan, the risk of developing a second neoplasm was lower for the lung, while patients younger than 64 years of age had a higher risk of thyroid cancer [ 46 Table 10 This article highlights the need for future studies regarding the management of synchronous/metachronous prostate cancer when other cancer sites are involved. A further direction of investigation is related to patient no. 20, who presents a BRCA (breast cancer gene) mutation and consequently might have a hormonal component, and also related to patients no. 17 and 21, for whom the second cancer site may have been radio-induced or not. We propose genetic susceptibility (BRCA1/2, HOXB13, and mismatch repair genes), therapy-related mutagenesis, hormonal interactions, and environmental exposures prevalent in Romania for future analyses. The limitations of the study are the small sample with no comparison group (regarding the risk of developing bladder, colon, or rectal cancer in prostate cancer patients who have undergone prostatectomy versus definitive radiotherapy.); the fact that the study was conducted in a single medical facility and the patients were treated by means of various radiotherapy techniques; the lack of molecular profiling and the lack of BRCA testing. 5. Conclusions This series represents a cohort study regarding synchronous/metachronous prostate cancer with other cancer sites. There are few reports on the management of these patients and there is a need to optimize clinical strategies for this complex patient group. This case series adds more experience to the already existing experience in the literature, providing guidelines in making decisions regarding the monitoring and treatment of the diseases. Our study revealed that treatment must combine the known multimodal therapy for each cancer. The therapeutic strategy of these tumors does not differ from the one of patients with a single tumor, but we must take into account that the sample size was small. As for future directions, considering that prostate cancer is a frequent location and with long survival, with different treatments depending on the stage of the disease, the genomic profile, the life expectancy, and the patient’s options, including different radiotherapy techniques introduced in the past decade (SBRT), and considering the potential risk of the appearance of the second neoplasm in the irradiated volume, we propose performing molecular biomarker analysis (BRCA 1, BRCA 2, CHEK 2, and CDK12) in metastatic prostate cancer patients and genetic testing in genetic/familial cancers. In patients who have a history of radiotherapy for prostate cancer, we suggest colonoscopy every 2–3 years. What we propose is the careful monitoring (clinical examination, imaging investigations, PSA determination, and colonoscopy) and the assessment of individual risks based on genetic factors, treatments performed, and the lifestyle of patients with localized disease even 5 years after the completion of treatments. Acknowledgments The authors have reviewed and edited the output and take full responsibility for the content of this publication. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, L.F.A.; Methodology, M.D.; Software, G.R.-N. and R.-A.R.-N.; Validation, L.-F.R.; Formal Analysis, M.D.; Resources, A.N.; Data curation, G.R.-N., A.-C.M., L.F.A., A.C., and A.R.; Writing—Original Draft, G.R.-N. and A.C.; Writing—Review and Editing, M.D.; Visualization, R.-A.R.-N.; Supervision, L.-F.R.; Funding Acquisition, A.N. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement This study was approved by the Ethics Committee of “Sf. Apostol Andrei” County Emergency Hospital in Galati (no. 7777/16.04.2025). Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Data Availability Statement The data presented in this study are available on request from the corresponding author due to privacy policy. These data are collected from the medical files of patients and might be available if requested. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: BRCA2 breast cancer-related gene 2 MPMs multiple primary malignancies SEER Surveillance, Epidemiology, and End Results Program IACR/IARC International Association of Cancer Registries and International Agency for Research on Cancer EBRT external beam radiotherapy ADT androgen deprivation therapy CHT chemotherapy TKI tyrosine kinase inhibitor GIST Gastrointestinal Stromal Tumor ARPI Androgen receptor pathway inhibitors References 1. Warren S. Gates O. Multiple Primary Malignant Tumors: A Survey of the Literature and Statistical Study Am. J. Cancer 1932 16 1358 1414 2. Pan S.Y. Huang C.P. Chen W.C. Synchronous/Metachronous Multiple Primary Malignancies: Review of Associated Risk Factors Diagnostics 2022 12 1940 10.3390/diagnostics12081940 36010291 PMC9406460 3. Amer M.H. Multiple neoplasms, single primaries, and patient survival Cancer Manag. Res. 2014 6 119 134 10.2147/CMAR.S57378 24623992 PMC3949559 4. Coyte A. Morrison D.S. McLoone P. Second primary cancer risk—The impact of applying different definitions of multiple primaries: Results from a retrospective population-based cancer registry study BMC Cancer 2014 14 272 10.1186/1471-2407-14-272 24742063 PMC4005906 5. Tanjak P. Suktitipat B. Vorasan N. Juengwiwattanakitti P. Thiengtrong B. Songjang C. Therasakvichya S. Laiteerapong S. Chinswangwatanakul V. Risks and cancer associations of metachronous and synchronous multiple primary cancers: A 25-year retrospective study BMC Cancer 2021 21 1045 10.1186/s12885-021-08766-9 34556087 PMC8461969 6. Huang S.F. Li H.F. Liao C.T. Wang H.M. Chen I.H. Chang J.T. Chen Y.J. Cheng A.J. Association of HPV infections with second primary tumors in early-staged oral cavity cancer Oral Dis. 2012 18 809 815 10.1111/j.1601-0825.2012.01950.x 22747969 7. Rotondo J.C. Mazzoni E. Bononi I. Tognon M. Martini F. Association Between Simian Virus 40 and Human Tumors Front. Oncol. 2019 9 670 10.3389/fonc.2019.00670 31403031 PMC6669359 8. Schlenker B. Schneede P. The Role of Human Papilloma Virus in Penile Cancer Prevention and New Therapeutic Agents Eur. Urol. Focus 2019 5 42 45 10.1016/j.euf.2018.09.010 30262198 9. Biller L.H. Syngal S. Yurgelun M.B. Recent advances in Lynch syndrome Fam. Cancer 2019 18 211 219 10.1007/s10689-018-00117-1 30627969 PMC6450737 10. Pilarski R. The Role of BRCA Testing in Hereditary Pancreatic and Prostate Cancer Families Am. Soc. Clin. Oncol. Educ. Book 2019 39 79 86 10.1200/EDBK_238977 31099688 11. Daly M.B. Pilarski R. Yurgelun M.B. Berry M.P. Buys S.S. Dickson P. Domchek S.M. Elkhanany A. Friedman S. Garber J.E. NCCN Guidelines Insights: Genetic/Familial High-Risk Assessment: Breast, Ovarian, and Pancreatic, Version 1.2020 J. Natl. Compr. Cancer Netw. 2020 18 380 391 10.6004/jnccn.2020.0017 32259785 12. Concolino P. Costella A. Capoluongo E.D. Multiple endocrine neoplasia type 1 (MEN1): An update of 208 new germline variants reported in the last nine years Cancer Genet. 2016 209 36 41 10.1016/j.cancergen.2015.12.002 26767918 13. Parsa N. Environmental Factors Inducing Human Cancers Iran. J. Public Health 2012 41 1 9 PMC3521879 23304670 14. Chen P.-H. Mahmood Q. Mariottini G.L. Chiang T.-A. Lee K.-W. Adverse Health Effects of Betel Quid and the Risk of Oral and Pharyngeal Cancers BioMed Res. Int. 2017 2017 3904098 10.1155/2017/3904098 29376073 PMC5742426 15. Elicin O. Sermaxhaj B. Bojaxhiu B. Shelan M. Giger R. Rauch D. Aebersold D.M. Incidence of second primary cancers after radiotherapy combined with platinum and/or cetuximab in head and neck cancer patients Strahlenther. Und Onkol. 2019 195 468 474 10.1007/s00066-018-1400-5 30465265 16. Law N.L.W. Hong L.W. Tan S.S.N. Foo C.J. Lee D. Voon P.J. Barriers and Challenges of Multidisciplinary Teams in Oncology Management: A Scoping Review Protocol BMJ Open 2024 14 e079559 10.1136/bmjopen-2023-079559 PMC10862282 38341218 17. Ghinescu M. Olaroiu M. Aurelian S. Halfens R.J. Dumitrescu L. Schols J.M. Rahnea-Nita G. Curaj A. Alexa I. van den Heuvel W.J. Assessment of care problems in Romania: Feasibility and exploration J. Am. Med. Dir. Assoc. 2015 16 86.e9 86.e12 10.1016/j.jamda.2014.10.015 25528283 18. He C. Multidisciplinary Team Meetings: Barriers to Implementation in Cancer Care Oncology 2024 38 339 344 10.46883/2024.25921026 39356965 19. de Castro Jr G. Souza F.H. Lima J. Bernardi L.P. Teixeira C.H.A. Prado G.F. Grupo Brasileiro de Oncologia Torácica (GBOT) Does Multidisciplinary Team Management Improve Clinical Outcomes in NSCLC? A Systematic Review with Meta-Analysis JTO Clin. Res. Rep. 2023 4 100580 10.1016/j.jtocrr.2023.100580 38046377 PMC10689272 20. Alfieri S. Brunelli C. Borreani C. Capri G. Angi M. Bianchi G.V. Lo Dico S. Spada P. Fusetti V. Zecca E. Characterizing Different Multidisciplinary Team Models Implemented Within One Comprehensive Cancer Center J. Multidiscip. Healthc. 2023 16 1845 1855 10.2147/JMDH.S402348 37404961 PMC10317525 21. Rahnea-Nita R.A. Stoian A.R. Anghel R.M. Rebegea L.F. Ciuhu A.N. Bacinschi X.E. Zgura A.F. Trifanescu O.G. Toma R.V. Constantin G.B. The Efficacy of Immunotherapy in Long-Term Survival in Non-Small Cell Lung Cancer (NSCLC) Associated with the Syndrome of Inappropriate Antidiuretic Hormone Secretion (SIADH) Life 2023 13 1279 10.3390/life13061279 37374062 PMC10303290 22. Chen J. Zhang D. Yan W. Yang D. Shen B. Translational Bioinformatics for Diagnostic and Prognostic Prediction of Prostate Cancer in the Next-Generation Sequencing Era BioMed Res. Int. 2013 2013 901578 10.1155/2013/901578 23957008 PMC3727129 23. Sekhoacha M. Riet K. Motloung P. Gumenku L. Adegoke A. Mashele S. Prostate Cancer Review: Genetics, Diagnosis, Treatment Options, and Alternative Approaches Molecules 2022 27 5730 10.3390/molecules27175730 36080493 PMC9457814 24. Rahnea-Nita R.-A. Rebegea L.-F. Nechifor A. Mareș C. Toma R.-V. Stoian A.-R. Ciuhu A.-N. Andronache L.-F. Constantin G.B. Rahnea-Nita G. The Complexity of Treatments and the Multidisciplinary Team—A Rare Case of Long-Term Progression—Free Survival in Prostate Cancer until Development of Liver and Brain Metastases J. Clin. Med. 2023 12 5579 10.3390/jcm12175579 37685646 PMC10488423 25. Sung H. Ferlay J. Siegel R.L. Laversanne M. Soerjomataram I. Jemal A. Bray F. Global Cancer Statistics 2020: GLOBOCAN Estimates of Incidence and Mortality Worldwide for 36 Cancers in 185 Countries CA A Cancer J. Clin. 2021 71 209 249 10.3322/caac.21660 33538338 26. Rebegea L. Stefan A.M. Firescu D. Miron D. Romila A. Paraneoplastic pemphigus associated with a hypopharynx squamous cell carcinoma. Case report authors Acta Medica Mediterr. 2018 34 1265 10.19193/0393-6384_2018_5_195 27. Zhang Y. Chen J. Xu L. Hu X. Zeng H. Liu Z. Case report: Synchronous prostate cancer and renal cell carcinoma with prostate cancer-origin metastases to adrenal and renal hilar lymph nodes Front. Oncol. 2024 14 1412067 10.3389/fonc.2024.1412067 39435284 PMC11491287 28. Bunnag N. Wongwijitsook J. Vachatimanont S. Synchronous Pulmonary Malignancy Detected During PSMA Ligand PET/CT for Initial Staging of Prostate Cancer: A Case Report Nucl. Med. Mol. Imaging 2023 57 287 290 10.1007/s13139-023-00798-2 37982101 PMC10654289 29. Sarkar S. Chaudhuri T. Roy S. Bose S. A rare synchronous presentation of double primary malignancies—Lung and prostate J. Cancer Res. Ther. 2021 17 1576 1579 10.4103/jcrt.JCRT_822_17 34916401 30. Wali L. Husain F. Shah A. Tahir H. Alam F. Khan M. Ghosh S. Prostate cancer and sarcoma: Challenges of synchronous malignancies Radiol. Case Rep. 2020 15 2303 2307 10.1016/j.radcr.2020.08.069 32983304 PMC7494932 31. Edfelt E. Shahrivar M. Holmsten K. Radkiewicz C. Rising incidence trends of synchronous prostate and rectal cancers: A population-based study Acta Oncol. 2025 64 374 379 10.2340/1651-226X.2025.42592 40052250 PMC11905149 32. Sidiqi B. Nosrati J. Wu V. Kobritz M. La Gamma N. Whelan R. Parashar B. King D. Tchelebi L. Herman J. The Prevalence and Management of Synchronous Prostate and Rectal Cancer Int. J. Radiat. Oncol. Biol. Phys. 2023 117 e339 10.1016/j.ijrobp.2023.06.2398 33. Jean S. Trésor M.G. Lionelle F. Félicien H.Y. Inès Y.D.M. Jean-Martin H.F. Georges A.D.J. A Prostate Cancer Metachronous to A Breast Cancer in A 74-Year-Old Male J. Med. Res. 2023 9 109 111 10.31254/jmr.2023.9503 34. Abhyankar N. Hoskins K.F. Abern M.R. Calip G.S. Descriptive characteristics of prostate cancer in patients with a history of primary male breast cancer—A SEER analysis BMC Cancer 2017 17 659 10.1186/s12885-017-3640-7 28946846 PMC5613320 35. Bellini M.I. Lori E. Forte F. Lauro A. Tripodi D. Amabile M.I. Cantisani V. Varanese M. Ferent I.C. Baldini E. Thyroid and renal cancers: A bidirectional association Front. Oncol. 2022 12 951976 10.3389/fonc.2022.951976 36212468 PMC9538481 36. Pritchard C.C. Mateo J. Walsh M.F. De Sarkar N. Abida W. Beltran H. Garofalo A. Gulati R. Carreira S. Eeles R. Inherited DNA-repair gene mutations in men with metastatic prostate cancer N. Engl. J. Med. 2016 375 443 453 10.1056/NEJMoa1603144 27433846 PMC4986616 37. Meissner V.H. Jahnen M. Herkommer K. Familial prostate cancer and genetic predisposition Der Urol. 2021 60 567 575 10.1007/s00120-021-01491-y 33721089 38. Liu Z. Huang Q. Ding M. Wang T. Chen Y. Zhang K. BRCA2 mutations in familial breast cancer with prostate cancer: A case report and literature review Front. Oncol. 2024 14 1428849 10.3389/fonc.2024.1428849 39364320 PMC11446893 39. Moosavi L. Kim P. Uche A. Cobos E. A Synchronous Diagnosis of Metastatic Male Breast Cancer and Prostate Cancer J. Investig. Med. High Impact Case Rep. 2019 7 2324709619847230 10.1177/2324709619847230 31053047 PMC6505228 40. Millican J. Wong M. Treatment of rectal cancer after previous prostate cancer: A single institution experience Oncol. Lett. 2022 25 20 10.3892/ol.2022.13606 36478912 PMC9713775 41. Hoshi S. Bilim V. Hoshi K. Ogawa Y. Kato T. Urano K. Yamada T. Sakagami R. Kudo T. Numahata K. Double Primary Cancer of the Prostate and Urothelial Cancer: A Single Institution Experience J. Pers. Med. 2024 14 510 10.3390/jpm14050510 38793091 PMC11121936 42. Zhao T. Tian Y. Ding X. Liu L. Tan B. Yang B. Wu J. Lei T. Wang R. Ding Y. Genetic Analysis and Targeted Therapy Using Buparlisib and MK2206 in a Patient with Triple Metachronous Cancers of the Kidney, Prostate, and Squamous Cell Carcinoma of the Lung: A Case Report Onco Targets Ther. 2021 14 2839 2845 10.2147/OTT.S298697 33953569 PMC8091866 43. Fan C.Y. Huang W.Y. Lin C.S. Su Y.F. Lo C.H. Tsao C.C. Liu M.Y. Lin C.L. Kao C.H. Risk of second primary malignancies among patients with prostate cancer: A population-based cohort study PLoS ONE 2017 12 e0175217 10.1371/journal.pone.0175217 28384363 PMC5383246 44. Omer D.M. Thompson H.M. Verheij F.S. Yuval J.B. Rosen R. Beets N.R.A. Luthra A. Romesser P.B. Paty P.B. Garcia-Aguilar J. Rectal Cancer after Prostate Radiation: A Complex and Controversial Disease Cancers 2023 15 2214 10.3390/cancers15082214 37190143 PMC10136617 45. Neugut A.I. Ahsan H. Robinson E. Ennis R.D. Bladder carcinoma and other second malignancies after radiotherapy for prostate carcinoma Cancer 1997 79 1600 1604 10.1002/(SICI)1097-0142(19970415)79:8&#x0003c;1600::AID-CNCR24&#x0003e;3.0.CO;2-0 9118045 46. Wallis C.J. Mahar A.L. Choo R. Herschorn S. Kodama R.T. Shah P.S. Danjoux C. Narod S.A. Nam R.K. Second malignancies after radiotherapy for prostate cancer: Systematic review and meta-analysis BMJ 2016 352 i851 10.1136/bmj.i851 26936410 PMC4775870 Figure 1 Overall survival. Figure 2 Comparative analysis of survival for patients with metachronous vs. synchronous prostate cancer. Figure 3 Comparative analysis of survival for patients with Gleason score 7 vs. Gleason scores 5 and 6. Figure 4 Comparative analysis of survival for patients with Gleason score 7 vs. Gleason scores 8 and 9. medicina-61-01666-t001_Table 1 Table 1 Clinical and therapeutic parametrics. Clinical and Therapeutic Parametrics No. of Patients (%) Median age (range) (years) 72.5 (56–83)  First tumor site  - Prostate 14 (53.86) - Bladder 2 (7.69) - Kidney 3 (11.54) - Colon-rectum 2 (7.69) - Breast 1 (3.85) - Larynx 2 (7.69) - Liver 1 (3.85) - Nasopharynx 1 (3.85)  Second tumor site  - Prostate 10 (38.46) - Lung 4 (15.38) - Bladder 2 (7.69) - Colon-rectum 5 (19.23) - Stromal gastric tumor 1 (3.85) - Thyroid 2 (7.69) - Kidney 1 (3.85) - Soft tissues 1 (3.85)  Third tumor site  - Prostate 2 (7.69) - Colon-rectum 2 (7.69) - Pancreas 1 (3.85) medicina-61-01666-t002_Table 2 Table 2 The first primary cancer site. Patient No. Diagnosis HP (Histopathological Exam); Molecular Markers Year Stage of the Disease Treatment 1 Prostate Adenocarcinoma 2022 IV  EBRT ADT + ARPI 2 Prostate Adenocarcinoma 2022 III Surgery   3 Prostate Adenocarcinoma G2 2019 III  EBRT ADT + ARPI 4 Prostate Adenocarcinoma 2023 II  EBRT ADT 5 Prostate Adenocarcinoma 2023 III  EBRT  6 Prostate Adenocarcinoma 2021 IV  EBRT ADT 7 Prostate Adenocarcinoma 2024 II Surgery   8 Larynx Squamous carcinoma G1 2011 I Surgery   9 Colon Adenocarcinoma 2014 II Surgery   10 Prostate Adenocarcinoma Gleason 6 (3 + 3) 2016 III   ADT 11 Prostate Adenocarcinoma 2018 II  EBRT ADT 12 Kidney Clear cell carcinoma 2015 IV Surgery   13 Larynx Squamous cell carcinoma 2013 III Surgery EBRT adjuvant  14 Bladder Papillary carcinoma 2010 II TUR-V  Instillation CHT 15 Colon adenocarcinoma 2022 II Surgery  CHT 16 Prostate Adenocarcinoma 2021 IV  EBRT ADT 17 Prostate Adenocarcinoma 2014 IV  EBRT ADT (36 months) 18 Kidney Oncocytoma 2010 I Surgery   19 Prostate Adenocarcinoma 2010 II  EBRT ADT 20 Breast Invasive breast carcinoma Luminal B, RE-80%, PR-30%, HER2-negative KI 67 25% 2015 II Surgery EBRT CHT, HT (adjuvant, 5 years) 21 Bladder Urothelial carcinoma 2015 II TUR-V EBRT at relapse  22 Prostate Adenocarcinoma 2023 III  EBRT at relapse ADT 23 Liver Unresectable carcinoma 2018    Chemoembolization, Sorafenib 24 Prostate Adenocarcinoma 2018 III  EBRT  25 Nasopharynx Carcinoma 2010 II  EBRT  26 Kidney Clear cell carcinoma 2020 III Surgery   Abbreviations: ER = estrogen receptor; PR = progesterone receptor; HER2 = human epidermal growth factor; EBRT = external beam radiotherapy; HT = hormonal therapy; ARPI = androgen receptor pathway inhibitors); ADT = androgen deprivation therapy; CHT = chemotherapy; TURBT = Transurethral resection of bladder tumor. Patient no./Diagnosis/Histopathological exam/Year of diagnosis/The stage of the disease (nonmetastatic/metastatic)/Treatment (Surgery/EBRT /CHT/ADT/TKI = cellular marker for proliferation). medicina-61-01666-t003_Table 3 Table 3 The second primary cancer site. Patient No. Diagnosis HP (Histopathological Exam); Molecular Markers Year Stage Treatment 1 Lung Adenocarcinoma 2023 III Surgery  CHT 2 Lung Large cell, EGFR-negative, 2024 IV   CHT 3 Bladder Papillary carcinoma 2024 I Surgery   4 Lung Adenocarcinoma 2024 III Surgery  CHT 5 Lung Adenocarcinoma G2, EGFR-positive, ALK-negative 2024 III   Anti-EGFR therapy-Osimertinib 6 Colon Adenocarcinoma 2024 III Surgery   7. Bladder Urothelial carcinoma 2024 II TUR-V  CHT 8. Prostate Adenocarcinoma 2021 II-INTERMEDIATE GROUP RISK  EBRT ADT 9 Prostate Adenocarcinoma 2022 II  EBRT ADT + ARPI (Enzalutamide) 10 Colon Adenocarcinoma 2024 II Surgery   11 GIST GIST 2018  Surgery  Imatinib 12 Prostate Adenocarcinoma 2022 II  EBRT ADT 13 Prostate Adenocarcinoma 2016 III  EBRT ADT (36 months) 14 Prostate Adenocarcinoma 2017 II Surgery   15 Prostate Adenocarcinoma 2024 IV  EBRT ADT + ARPI 16 Colon Adenocarcinoma 2024 I Surgery   17 Rectum Adenocarcinoma 2024 III Surgery  CHT 18 Thyroid Papillary carcinoma 2019  Surgery-thyroidectomy Radioactive Iodine Therapy Sorafenib 19 Sarcoma Leiomyosarcoma 2014  Surgery adjuvant EBRT  20 Prostate Adenocarcinoma 2023 IV  EBRT ADT 21 Prostate Adenocarcinoma 2024 IV  EBRT ADT 22 Rectum Adenocarcinoma 2024 III Surgery EBRT CHT 23 Prostate Adenocarcinoma 2023 II Surgery  ADT (36 months) 24 Thyroid Papillary carcinoma 2019  Surgery   25 Kidney Clear cell carcinoma 2016 II Surgery   26 Prostate Adenocarcinoma 2023 IV  EBRT ADT Abbreviations: GIST = Gastrointestinal Stromal Tumor. Patient no./Diagnosis/Histopathological exam/Year of diagnosis/Stage of the disease (nonmetastatic/metastatic)/Treatment (Surgery/EBRT/CHT/ADT/TKI = tyrosine kinase inhibitor). medicina-61-01666-t004_Table 4 Table 4 The third primary cancer site (five patients). Patient No. Diagnosis HP (Histopathological Exam) Year Stage Treatment 5 Rectum Adenocarcinoma 2025 IV  EBRT  18 Prostate Adenocarcinoma 2025 IV  EBRT ADT 19 Colon Adenocarcinoma 2021 II Surgery   24 Pancreas Adenocarcinoma 2021 II Surgery   25 Prostate Adenocarcinoma 2020 IV  EBRT ADT medicina-61-01666-t005_Table 5 Table 5 The most frequent combinations. No. Combination No. of Cases 1 Prostate Cancer plus Bladder/Renal Cancer 7 2 Prostate Cancer plus Colon/Rectum 7 3 Prostate Cancer plus Two Cancers 5 4 Prostate Cancer plus Lung Cancer 4 medicina-61-01666-t006_Table 6 Table 6 Time period (months) between the first and the second cancer site occurrence. Synchronous/metachronous cancer. Patient No. Time Period (Months) Between the First and the Second Cancer Site Occurrence Synchronous/Metachronous Cancer 1 12 metachronous 2 24 metachronous 3 60 metachronous 4 12 metachronous 5 3 synchronous 6 36 metachronous 7 4 synchronous 8 120 metachronous 9 96 metachronous 10 96 metachronous 11 8 metachronous 12 84 metachronous 13 36 metachronous 14 84 metachronous 15 24 metachronous 16 36 metachronous 17 120 metachronous 18 108 metachronous 19 48 metachronous 20 96 metachronous 21 108 metachronous 22 12 metachronous 23 60 metachronous 24 12 metachronous 25 72 metachronous 26 36 metachronous medicina-61-01666-t007_Table 7 Table 7 Time period (months) between the first and the third cancer site occurrence. Synchronous/metachronous (five patients). Patient No. Time Period (Months) Between the First and the Third Cancer Site Occurrence Synchronous/Metachronous 5 24 metachronous 18 180 metachronous 19 132 metachronous 24 36 metachronous 25 120 metachronous medicina-61-01666-t008_Table 8 Table 8 Time period (months) between the second and the third cancer site occurrence. Synchronous/metachronous (five patients). Patient No. Time Period (Months) Between the Second and the Third Cancer Site Occurrence Synchronous/Metachronous 5 12 metachronous 18 72 metachronous 19 84 metachronous 24 24 metachronous 25 48 metachronous medicina-61-01666-t009_Table 9 Table 9 Regression summary for survival. Regression Summary for Survival Predictor Standard Error t Stat p 95% Lower 95% Upper Intercept 0.518 1.717 0.1001 −0.185 1.964 Gleason 0.0713 0.076 0.9397 −0.142 0.153 Prostate tumor_P1 0.0954 0.687 0.8832 −0.098 0.154 Prostate tumor_P2 0.151 0.477 0.6381 −0.242 0.386 Prostate tumor_P3 0.277 0.251 0.8042 −0.505 0.644 medicina-61-01666-t010_Table 10 Table 10 Comparative analytical data. No. Author, Year Subject: Prostate Cancer/Other Cancer; Synchronous/Metachronous Reference No. 1 Zhang Y et al., 2024 Prostate/renal; case report; synchronous [ 27 2 Bunnag N et al., 2023 Prostate/lung; case report; synchronous [ 28 3 Sarkar S et al., 2021 Prostate/Lung; case report; synchronous [ 29 4 Luqman W et al., 2020 Prostate/sarcoma; case report; synchronous [ 30 5 Edfelt E et al., 2025 Prostate/rectum; large cohort study; synchronous [ 31 6 B.U. Sidiqi et al., 2023 Prostate/rectum; case series (10 cases); synchronous [ 32 7 Sossa J et al., 2023 Prostate/breast; case report; metachronous [ 33 8 Millican J et al., 2022 Prostate/rectum; single-institution experience; synchronous/metachronous [ 40 9 Hoshi S et al., 2024 Prostate/urothelial; three cases; metachronous [ 40 10 Zhao T et al., 2021 Kidney/prostate/lung; case report; metachronous [ 41 11 Omer DM et al., 2023 Rectal cancer after prostate radiation; synchronous/metachronous [ 44 12 Neugut AI et al., 1997 Second malignancies after radiotherapy for prostate carcinoma; synchronous/metachronous [ 45 13 Wallis CJ et al., 2019 Second malignancies after radiotherapy for prostate cancer; synchronous/metachronous [ 46 ",
  "metadata": {
    "Title of this paper": "Second malignancies after radiotherapy for prostate cancer: Systematic review and meta-analysis",
    "Journal it was published in:": "Medicina",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471955/"
  }
}