{
  "title": "Paper_1189",
  "abstract": "pmc PLoS One PLoS One 440 plosone plos PLOS One 1932-6203 PLOS PMC12469160 PMC12469160.1 12469160 12469160 41004458 10.1371/journal.pone.0332932 PONE-D-25-28161 1 Research Article People and Places Population Groupings Professions Medical Personnel Pharmacists Medicine and Health Sciences Pharmacology Drug Research and Development Research and Analysis Methods Database and Informatics Methods Database Searching Medicine and Health Sciences Pharmacology Drug Research and Development Drug Regulation Research and Analysis Methods Research Design Social Sciences Law and Legal Sciences Regulations Science Policy Research Funding Government Funding of Science Research and Analysis Methods Research Design Survey Research Questionnaires Role of community pharmacists in the safe and effective use of complementary and alternative medicine in the Middle East: A scoping review Community pharmacists and CAM use in the Middle East Naja Farah Conceptualization Supervision Writing – original draft Writing – review & editing  1  2 Ahmad Maiss Data curation Formal analysis Writing – original draft  3 Shatila Hibeh Data curation Formal analysis Methodology Writing – original draft  4 Abu Shihab Katia Hazim N. Formal analysis Validation  1  2 https://orcid.org/0000-0003-0018-6151 Naalbandian Sally Data curation Methodology  5 Saqan Roba Data curation  2 Alzubaidi Hamzah Validation  2  6 https://orcid.org/0000-0002-9829-235X Hijazi Mohamad Ali Conceptualization Formal analysis Methodology Supervision Writing – original draft Writing – review & editing  7 * 1 Department of Clinical Nutrition and Dietetics, College of Health Sciences, University of Sharjah, Sharjah, United Arab Emirates 2 Research Institute of Medical & Health Sciences (RIMHS), University of Sharjah, Sharjah, United Arab Emirates 3 Department of Applied Health Sciences, Public Health Programme, University of Birmingham Dubai, International Academic City, Dubai, United Arab Emirates 4 Human Nutrition Department, College of Health Sciences, QU Health, Qatar University, Doha, Qatar 5 Science & Agriculture Library, University Libraries, American University of Beirut, Beirut, Lebanon 6 Department of Pharmacy Practice and Pharmacotherapeutics, College of Pharmacy, University of Sharjah, Sharjah, United Arab Emirates 7 Pharmaceutical Sciences Department, Beirut Arab University, Beirut, Lebanon Mohammed Ali Haider Editor  Universiti Monash Malaysia: Monash University Malaysia, MALAYSIA * E-mail: m.hijazi@bau.edu.lb Competing Interests: 26 9 2025 2025 20 9 496058 e0332932 27 5 2025 7 9 2025 26 09 2025 27 09 2025 27 09 2025 © 2025 Naja et al 2025 Naja et al https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License Role of community pharmacists in the safe and effective use of complementary and alternative medicine in the Middle East: A scoping review. 20 9 26 9 2025 e0332932 e0332932 PLoS One 10.1371/journal.pone.0332932 41004458 Role of community pharmacists in the safe and effective use of complementary and alternative medicine in the Middle East: A scoping review. 20 9 26 9 2025 e0332932 e0332932 PLoS One 10.1371/journal.pone.0332932 41004458 Background Community pharmacists (CPs) play a crucial role in promoting safe use of Complementary and Alternative Medicine (CAM). This scoping review examined existing evidence on the role of CPs in CAM in the Middle East, a region harboring one of the fastest growing markets of CAM. Methods A comprehensive search of nine electronic databases was conducted to identify relevant studies published between 2000 and 2025. A total of 155 studies met the inclusion criteria. Key study characteristics were extracted using a standardized data extraction form. Thematic analysis of findings and recommendations was carried out using NVivo software to identify common patterns, themes, and gaps in the literature. Results The studies primarily used quantitative cross-sectional designs and were predominantly led by academic institutions. International and regional collaborations were scarce. Over the past 25 years, there has been a notable rise in the annual number of published papers; however, this upward trend was not reflected in the impact factors of the journals in which these papers appeared. The thematic analysis revealed three main themes: (1) Opportunities, including pharmacists’ positive attitudes and willingness to take on active roles in CAM; (2) Challenges, such as knowledge gaps, poor reporting practices, logistical barriers to counseling, weak regulatory oversight, and misinformation driven by media; and (3) Recommendations, targeting improvements in practice, education, and policy. Conclusions The review findings suggest the need for studies to diversify their designs and strengthen cross-sector collaborations. To enhance CPs’ role in ensuring the safe use of CAM, coordinated, evidence-based strategies are required. These should integrate professional development, regulatory reform, and targeted public education, ultimately supporting CPs in delivering informed, patient-centered CAM services. The author(s) received no specific funding for this work. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Data Availability All relevant data are within the manuscript and its Supporting information Data Availability All relevant data are within the manuscript and its Supporting information Introduction Over the last decade, there has been a worldwide increase in the use of complementary and alternative medicine (CAM) [ 1 2 3 4 5 1 6 7 The widespread use of CAM and its growing popularity could in many instances threaten public health, specifically in the absence of rigorous clinical evidence about the safety or efficacy of some CAM modalities [ 7 9 10 11 12 11 8 13 At the intersection between evidence-based recommendations for CAM and sale of CAM products is the profession of Community Pharmacists (CPs) [ 8 14 15 6 14 14 16 17 18 The Middle East (ME) region harbors one of the fastest growing markets of CAM [ 19 20 21 22 23 24 25 28 26 28 30 31 33 Given the widespread use of CAM in the ME, the potential for adverse outcomes, and the lack of robust regulatory frameworks governing the CAM market, the role of CPs becomes increasingly critical. This scoping review was therefore conducted to explore and evaluate the existing evidence on the roles and responsibilities of CPs in supporting safe CAM use in the ME region. Methodology In order to examine the existing evidence regarding the CPs roles in CAM in the ME region, a scoping review was conducted. This type of review was most appropriate especially considering that this research did not intend to measure any construction or provide any clinical conclusions [ 34 34 The research question for this review was broad to encompass a comprehensive range of insights within the subject of the investigation. Specifically, the guiding question for this review was: “What original research has been published concerning the involvement of pharmacists in Complementary and Alternative Medicine (CAM) within the ME region?”. Inclusion criteria For documents to be considered for inclusion in this review, they must satisfy the following inclusion criteria: Published after year 2000 Written in languages used in ME countries namely English, French, Arabic, Turkish, Kurdish, Persian, Greek, and Hebrew Be an original article or review (conference papers, books, book chapters, theses, dissertations, editorials, errata, letters, abstracts were not included. Conducted partially or completely in one of the ME countries. For the purpose of this review, the Middle East was defined based on a geopolitical framework commonly adopted by the United States and NATO, encompassing the following countries: Bahrain, Cyprus, Egypt, Iran, Iraq, Israel, Jordan, Kuwait, Lebanon, Oman, Palestine (Gaza and West Bank), Qatar, Saudi Arabia, Syria, Turkey, and the United Arab Emirates. This definition was selected to reflect both regional proximity and strategic relevance in international policy and health discourse. The articles address the role of pharmacist in any form of CAM. Search strategy A comprehensive literature search was conducted between July 2022 and January 2025 in 9 electronic databases MEDLINE (Ovid), Scopus, Web of Science Core Collection, Global Health, Directory of Open Access Journals (DOAJ), Al-Manhal, Arab World Research Source: Al-Masdar, E-Marefa, Iraqi Academic Scientific Journals, in addition to Google Scholar. DOAJ and Google Scholar were searched to identify any documents not indexed in the databases. A combination of subject-specific keywords and MeSH terms were used to identify relevant literature related to the three concept domains: pharmacist, CAM, and ME countries. The search strategy was developed by the research team in consultation with a subject librarian who executed the search in the 9 databases and Google Scholar ( S1 Appendix The search results were exported into EndNote X9.3.3 and duplicates were removed. The de-deduplicated EndNote library was shared with reviewer 1 (HC). Data extraction In alignment with the scope of this research inquiry, the research team developed a data charting form to determine the characteristics to be extracted from each research article. The form was based on previously published data extraction templates and was further adapted to address the specific objectives of this research. The data extraction form included information such as general information about each article (title, journal name, publication date, affiliation of authors, country of affiliation, type of collaboration, study design), study population, study characteristics, and pharmacy related detailed section. The full extraction form can be found in S2 Appendix Evidence screening and selection The two stages of screening were completed independently by HC and SN using EndNote. The title-abstract fields of 774 articles identified through database searching were screened and 563 documents were excluded for not meeting the inclusion criteria (93.82% agreement between the 2 reviewers). The full text of 207 articles was acquired and a detailed screening was conducted resulting in the exclusion of 76 articles (87.64% agreement between the 2 reviewers), the reasons for exclusion were: Articles published under a different name as per the record’s author (n = 1), articles in which pharmacists have a minor role, focus is on other healthcare professionals (n = 34), focus is not on CAM (n = 41). Nine articles were identified during cited reference searching and 15 articles were identified through email alerts resulting in the inclusion of 155 Fig 1 10.1371/journal.pone.0332932.g001 Fig 1 The process of selecting and screening literature. From: https://doi.org/10.1136/bmj.n71 http://www.prisma-statement.org/ The research team conducted multiple meetings throughout the screening process to address issues related to study selection. The selection of relevant articles was a two-step process performed independently by two reviewers, namely S.N and H.C. In the initial step, the reviewers screened the titles and abstracts of the identified articles. Subsequently, the second step involved a thorough examination of the full texts. After each step, the level of agreement between the reviewers was assessed. Disagreements concerning the inclusion or exclusion of specific documents were resolved through discussions involving the two primary reviewers, as well as consultation with two additional reviewers, F.N and M.H, who were a part of the research team. The included studies and their countries are listed in the S3 Appendix Data analysis The analysis map for this scoping review was set based on the study objectives. Thus, the analysis has considered two dimensions: the first dimension was focused on the various characteristics of the papers as per the data extraction form. The second analysis dimension was conducted to produce a broad qualitative synthesis of the outcomes stated in the collected studies. This step was accomplished by two independent reviewers, M.H. and M.A., using basic coding techniques. One of the reviewers coded the data manually, while the second coded the data with the assistance of NVivo 20. The analysis started with a pilot review of 30 random studies. During this pilot phase, coding discrepancies were discussed in detail between the two reviewers and resolved through iterative consensus-building discussions. Both reviewers independently applied initial codes to the same 30 randomly selected studies, after which their coding outputs were compared to assess consistency in interpretation and application of codes. Any disagreements were examined to refine the coding framework, clarify code definitions, and ensure a shared understanding of the thematic constructs. This process enhanced inter-rater reliability by establishing a consistent coding approach prior to analyzing the full dataset. Once alignment in coding was achieved and the refined codebook was finalized, the reviewers proceeded with coding the remaining studies independently using the agreed-upon framework. The qualitative synthesis of the data was carried out in two rounds. The first round identified the main themes while the second led to the characterization of the subthemes. To ensure the trustworthiness of the findings, themes and subthemes were validated through multiple team meetings involving both coders and senior members of the research team, during which the thematic structure was reviewed for clarity, consistency, and relevance to the research objectives. Results Table 1 10.1371/journal.pone.0332932.t001 Table 1 Characterization of research studies addressing role of pharmacists in CAM in ME (2000 - 2023). (n = 155). Document Type n (%) Journal 155(100.0)  Language of publication  n (%) English 151(98.9) Turkish 3(2.0) Arabic 1(1.1)  Study setting  n (%) Saudi Arabia 33 (21.29) Jordan 26 (16.77) Turkey 15 (9.68) Palestine 12 (7.74) UAE 11 (7.10) Iran 10 (6.45) Iraq 9 (5.81) Multiple Arab Countries 7 (4.52) Lebanon 7 (4.52) Kuwait 5 (3.23) Qatar 4 (2.58) Cyprus 3 (1.94) Egypt 3 (1.94) Oman 3 (1.94) Yemen 2 (1.29) Sudan 2 (1.29) Syria 1 (0.65) A review, so NA 2 (1.29)  Study design  n (%) Cross-sectional 152 (98.06%) Pre-post interventional study 1 (0.65%) Reviews (systematic and scoping) 2 (1.3%)  Type of data collected  n (%) Quantitative 142 (91.61%) Qualitative 7 (4.52%) Mixed Methods 4 (2.58%) NA as the study design was a review 2 (1.29%)  Type of Qualitative study  n (%) Key-informant interview 6 (3.87%) Focus group discussion and key informant interview 3 (1.94%) Delphi technique (observational design) 1 (0.65%)  Collaboration of authors between countries  n (%) No collaboration, all authors same country 89 (57.42%) Collaboration with non-ME countries 31 (20%) NA, only one author 18 (11.61%) Collaboration between ME countries 17 (10.97%)  Affiliation of the authors  *  n (%) Academic institutions 154 (99.35%) Governmental Agencies 17 (10.97%) Hospital 15 (9.68%) Private Industry 8 (5.16%) NGO 3 (1.94%) Other ** 3 (1.94%)  Funding sources  n (%) Academic 30 (19.35%) Governmental 1 (0.65%) Private 1 (0.65%) Statement of no funding 56 (36.13%) Not stated 67 (43.23%)  IRB approved among human research  n (%) Yes 117 (75.48%) Not Specified 36 (23.23%) NA as the study design was a review 2 (1.29%)  Type of study participants  †  n (%) Community pharmacists 83 (53.55%) Community pharmacists only 55 (35.48%) Consumers 33 (21.29%) Hospital-based pharmacists 44 (28.39%) Physicians 18 (11.61%) Allied health professionals 15 (9.68%) Pharmacy assistants 5 (3.23%) CAM practitioners 4 (2.58%) Others 13 (8.39%)  Was the questionnaire validated?  n (%) Yes 93 (60.00%) Not stated 54 (34.84%) NA ‡ 6 (3.87%) NA as the study design was a review 2 (1.29%)  Was the questionnaire pilot tested?  n (%) Yes 99 (63.87%) Not stated 49 (31.61%) NA ‡ 7 (4.52%)  The main aim of the article was about CAM-Pharmacy  n (%) Yes 90 (58.06%) No 65 (41.94%) *More than one application therefore does not add up to 100%, **Pharmacists association, professional organization †More than one application therefore does not add up to 100%, ‡Not applicable because a questionnaire was not used Most of the studies focused on community pharmacists as participants, accounting for 53.55% of the total studies included. In terms of questionnaire validation, 60.0% of the studies reported that their questionnaires underwent a validation process, indicating a commitment to rigorous methodology. Pilot testing of questionnaires was a common practice among the studies, with 63.87% indicating that their questionnaires were subjected to pilot testing. Fig 2 10.1371/journal.pone.0332932.g002 Fig 2 Time trend in the numbers and Impact Factor (IF)* of papers addressing research studies on the role of pharmacists in CAM in ME (2000 - 2024). (n = 155). *Articles with no published IF according to Journal Citation Reports Synthesis of the literature’s findings on CPs roles in CAM in the ME region The qualitative examination of the papers led to three main themes and several subthemes as shown in Fig 3 10.1371/journal.pone.0332932.g003 Fig 3 Thematic map to represent the analytical process linking the overarching themes to the individual sub themes Opportunities. Pharmacists’ willingness to enhance their knowledge about CAM : Many studies elaborated on the willingness of pharmacists to improve their knowledge and skills in CAM. Many reviewed studies indicated that pharmacists have positive attitudes towards receiving education or training on CAM products, whether as a university requirement or as continuous education [ 35 42 17 43 45 Pharmacists’ positive attitude towards CAM use : A considerable number of reviewed studies reported that pharmacists in the ME region believe in the efficacy and safety of CAM products and that they have general positive attitudes towards CAM use [ 46 53 39 54 56 36 37 42 44 57 61 Users’ positive perspectives about the role of CPs in CAM: 47 54 58 62 76 Challenges Gaps in CPs knowledge of CAM: 39 41 44 46 48 50 52 54 56 58 61 62 77 92 Another reported challenge was CPs’ referral to unreliable scientific resources to get information about CAM. Several studies reported that the most cited CAM information sources by CPs were industry websites and representatives, product labels, or media with only a minority of CPs who reported their referral to scientific databases [ 55 56 80 93 97 49 Poor reporting practices of CAM adverse reactions or interactions: 41 48 78 98 99 Logistic barriers for adequate counseling on CAM: 89 70 82 100 103 104 106 Poor regulatory framework for CAM market and practices 46 49 50 63 80 107 109 84 100 101 107 110 Negative influence of media: 44 45 48 63 93 111 116 Recommendations Recommendations from the reviewed articles were grouped into three subthemes: 1) Recommendations related to CPs practices in CAM, 2) Recommendations related to CAM policies and regulatory framework, 3) Recommendations related to CPs education on CAM. Recommendations related to CPs practices in CAM Extension of CPs services to ensure safe and effective use of CAM. CPs were encouraged to provide thorough consultations on the efficacy and safety of CAM products. Moreover, pharmacists’ practices on CAM were perceived as an extension to their professional role in patient care [ 38 47 58 60 70 89 99 100 102 103 117 121 Pharmacists were expected to follow evidence- based practices and not profit-oriented practices in CAM [ 17 48 50 54 74 80 93 96 122 123 Pharmacists were advised to routinely ask patients about their CAM use, follow up, and encourage users to report any adverse effects [ 38 48 73 79 91 98 109 124 126 Interprofessional collaboration. CPs, physicians, nutritionists, and herbalists were encouraged to work collaboratively when providing care for CAM users [ 47 64 90 115 120 124 127 128 CPs were advised to be proactive and provide updated information on CAM to other healthcare providers [ 40 47 64 122 129 Proactive role in raising public awareness on safe and effective use CAM. The responsibility of pharmacists to play a better role in educating the public about CAM safety, efficacy, indications, and rational use was emphasized [ 38 44 45 47 102 113 114 121 123 125 127 130 Recommendations related to CPs education on CAM Integrating CAM into pharmacy educational curricula. Academic institutions were encouraged to integrate courses or modules on CAM use, safety, and interactions into the undergraduate curriculum for pharmacy students [ 35 38 39 41 48 50 52 55 56 61 62 79 81 85 86 91 93 95 97 100 101 129 131 133 Academic institutions were called upon to integrate training on counseling and communication skills within undergraduate curriculum for pharmacy students [ 70 84 92 101 103 Continuous Professional Education (CPE). Pharmacy professional associations and groups in collaboration with academic institutions were encouraged to develop CPE programs for pharmacists that include modules and training session on CAM as well as communication and counseling skills [ 38 44 46 49 51 54 56 62 79 81 87 90 96 97 100 102 106 116 129 131 134 Information resources. Pharmacy professional associations and industry management were advised to provide training for CPs on how to search for CAM information resources easily, rapidly, and effectively to make evidence-based decisions on CAM [ 49 56 58 94 100 Recommendations related to CAM policies and regulatory framework Regulations for CAM market. Regulatory bodies and health authorities to revise and update CAM importation, registration, packaging, labeling and pricing laws [ 45 47 49 50 63 71 73 80 107 133 135 Regulatory bodies and health authorities control CAM advertising and selling outside pharmacies [ 44 47 108 110 111 122 136 137 Regulatory bodies and health authorities are encouraged to strengthen pharmacists’ role by empowering them and raising public awareness of their expertise in disease treatment and prevention, using complementary and alternative medicine (CAM), and enabling them to actively address infodemics and plan for future emergencies [ 17 68 76 82 90 92 109 118 120 134 138 139 Regulatory bodies and health authorities to establish and enforce CAM post-market surveillance [ 91 139 41 46 99 Regulatory bodies and health authorities establish frameworks that allow, support, and regulate the practices of pharmacists, including those related to complementary and alternative medicine (CAM), in the digital landscape, telepharmacy, and online health product marketing [ 131 140 Regulations for standardizing pharmacists’ knowledge and practices on CAM. Health system in collaboration with universities and professional associations to establish reliable CAM database and practice guidelines (i.e., drug and CAM information centers) to assist pharmacists in making evidence-based decisions in their daily CAM practices [ 49 50 106 128 131 141 143 Health system in collaboration with universities ensures that all pharmacists have adequate level of knowledge on CAM, and to set this as a one of the licensing requirements for CPs [ 47 52 92 Financial compensation on CAM provided services. Regulatory bodies in collaboration with professional associations to develop and apply remuneration schemes for extended pharmacists’ services in CAM advocacy and users’ care [ 101 102 Discussion The results of this review provide a detailed examination of the published literature pertaining to the landscape of the CPs’ professional roles regarding CAM in the ME region. Additionally, our findings provide a thematic synthesis of the opportunities, challenges and main recommendations to enact and optimize the roles of CPs related to CAM in the ME region. Markedly, the time trend and the number of published papers shows a contentious publication momentum which indicates a considerable growing academic and professional attention to CPs roles in CAM in the ME region. This evolving attention is in line with the global evolving interest and focus on this topic [ 6 97 144 145 145 145 146 This stagnation in journal impact factor, despite rising publication volume, may also reflect broader challenges in the region’s research ecosystem, as found in this review. These include limited cross-border or international collaborations, a predominance of observational or descriptive designs with fewer interventional or longitudinal studies, and methodological shortcomings that may reduce the likelihood of acceptance in higher-impact journals. Furthermore, structural issues such as constrained research funding, limited access to research infrastructure, and underinvestment in training and capacity-building may also contribute to this trend. In addition, the review highlighted a striking lack of exploration into emerging domains such as the integration of digital health technologies in CAM pharmacy practice and the evaluation of successful policy implementation cases—both of which are essential to advancing the field in line with global healthcare innovations. Collectively, these factors may hinder the visibility, scientific influence, and citation potential of Middle Eastern research, underscoring the importance of policy-level investment in research quality, mentorship, and global engagement. Collectively, these factors may hinder the visibility, scientific influence, and citation potential of Middle Eastern research, underscoring the importance of policy-level investment in research quality, mentorship, and global engagement. Our findings underscore three main gaps related to the study design; first, the absence of intervention studies, which are widely acknowledged as a gold standard for producing high-quality scientific evidence in the pharmacy practice field, specifically in implementing and evaluating new programs and strategies [ 147 148 149 150 151 14 145 The findings related to the affiliation of the authors indicate that vast majority of the published research was conducted by researchers from the academic sector with modest contribution by governmental entities and significantly poor contribution by other sectors, such as industry and NGOs. While the role of academic institutions remains crucial in setting proper ethical and scientific research framework, the academic-practice or academic-business partnership in research is an important pillar for bridging the gaps in all domains of pharmacy practice (including CAM) and encouraging innovative solutions for mutually beneficial pharmacy quality enhancement [ 152 153 Although the primary aim of scoping reviews is to map the extent and nature of existing evidence rather than to assess study quality, certain methodological concerns warrant attention. Beyond the predominance of cross-sectional designs and the lack of longitudinal and interventional studies, our review identified additional limitations in research rigor. Notably, only 60% of the studies reported using validated tools or pilot-testing their questionnaires, which raises concerns about the reliability of the data collected. Furthermore, only 75% of the studies indicated obtaining Institutional Review Board (IRB) approval, and 55% did not include any funding statement, limiting transparency and potentially introducing bias. These findings highlight the need for more robust methodological standards in future research on CAM practices in pharmacy practice. Table 2 10.1371/journal.pone.0332932.t002 Table 2 Main gaps in the research articles reviewed in this study and suggestions for future research in the field. Aspect of Research Identified Gaps Practical Recommendations  Study design Predominance of cross-sectional surveys; limited intervention and cohort studies Encourage the use of longitudinal, interventional, and mixed methods designs to assess outcomes over time and the impact of specific programs Limited qualitative research Promote in-depth qualitative and mixed-methods research to capture contextual insights and lived experiences of pharmacists and CAM users  Study tools Limited use of validated research instruments Develop and adopt standardized, validated tools across studies  Study themes Repetitive topics; lack of innovation; under-exploration of digital technologies and policy implementation outcomes Prioritize gap analysis during research planning; promote studies that explore digital health integration, telepharmacy, AI tools, and evaluations of real-world policy implementation  Collaborations Limited international and cross-sectoral collaborations Strengthen inter sectoral partnerships to support multidisciplinary, cross-border projects  Ethical considerations A sizeable proportion of studies did not report ethical approval Require IRB approval for all studies involving human subjects as a standard practice  Funding Constrained and inconsistently reported funding Advocate for national and regional funding initiatives for CAM and pharmacy research; encourage greater transparency in reporting funding sources The thematic analysis in this scoping review shows that the reviewed studies from various countries in the ME reported similar barriers, opportunities and recommendations. Part of this similarity can be explained by the similarities in the objective, design and research tools that were applied among the studies. The consistent recommendations observed in this scoping review in various ME countries since the year of 2000 might indicate slow and intangible progress in CAM policies, education and professional development. Such a lag between evidence-based recommendations and policy development has also been reported by several studies in other regions of the world, where community pharmacists and other stakeholders are still trying to introduce policy reform to define, facilitate and expand CPs roles in CAM [ 14 145 153 15 The results of this scoping review underscore the importance of standardizing CAM education and training for pharmacists in addition to improving ongoing CPE programs, as those were central recommendations across most reviewed studies. Such recommendations were prompted from the observations that current undergraduate and continuing professional training programs for pharmacists in the ME offered limited instructions on the safety, efficacy, and regulations of CAM. These findings are consistent with those reported by several other studies, which also underscored the necessity to revise and update pharmacy curriculum and accreditation requirements to guide future advancements in the pharmacy practice in the CAM field [ 145 153 15 Developing and implementing well-defined practice guidelines for outlining the scope of CPs’ practices associated with CAM was a recurring crucial concept across most of the analyzed studies in this review. The proposed guidelines included several priority areas, such as establishing an ethical and practical framework for promoting and selling CAM. This priority, which was signified by various recent studies in the field of CAM, was also sought as a fundamental step for improving pharmacy education and relevant resources [ 145 153 16 13 8 145 16 13 Strengths and limitations One strength of this review is that it followed the standard reporting guidelines offered by the Meta-Analysis Extension for Scoping Reviews and the Preferred Reporting Items for Systematic Reviews [ 34 Conclusion This review presents a comprehensive examination of the literature on the roles of CPs related to CAM in the ME region. The analysis reveals growing research activity, though characterized by repetitive approaches and limited collaboration. These findings provide a foundation for developing an evidence-informed research agenda that addresses overlooked areas, promotes innovative methodologies—including interventional, qualitative, mixed, and longitudinal designs—and fosters collaboration among academia, the pharmacy and CAM sectors, and NGOs. In the short term, policymakers and educators should integrate CAM content into pharmacy curricula, expand continuing education, and improve access to validated tools and reliable information. Long-term strategies should focus on establishing national practice guidelines, strengthening regulatory frameworks, formalizing CAM service models in pharmacies, and supporting cross-sectoral research infrastructure and global collaboration. These short- and long-term actions offer a roadmap to enhance educational, regulatory, and professional aspects of CAM pharmacy practice. The evidence presented can support researchers, policymakers, educators, and healthcare professionals in optimizing the contribution of CPs to the safe and effective use of CAM across the Middle East. Supporting information S1 Appendix Search Strategy. (DOCX) S2 Appendix Data Charting form. (DOCX) S3 Appendix Included studies and their countries. (DOCX) S1 Data PRISMA-ScR-Fillable-Checklist. (DOCX) References 1 WHO WHO global report on traditional and complementary medicine 2019 World Health Organization 2019 2 Lee EL Richards N Harrison J Barnes J Prevalence of Use of Traditional, Complementary and Alternative Medicine by the General Population: A Systematic Review of National Studies Published from 2010 to 2019 Drug Saf 2022 45 7 713 35 doi: 10.1007/s40264-022-01189-w 35788539 PMC9296440 3 National Center for Complementary and Integrative Health. Complementary, alternative, or integrative health: what’s in a name? Available from: https://nccih.nih.gov 4 Yalcin S Hurmuz P McQuinn L Naing A Prevalence of Complementary Medicine Use in Patients With Cancer: A Turkish Comprehensive Cancer Center Experience J Glob Oncol 2018 4 1 6 doi: 10.1200/JGO.2016.008896 30241173 PMC6180833 5 Tangkiatkumjai M Boardman H Walker DM Potential factors that influence usage of complementary and alternative medicine worldwide: a systematic review BMC Complement Med Ther 2020 20 1 1 15 33228697 10.1186/s12906-020-03157-2 PMC7686746 6 Abheiden H, Teut M, Berghöfer A. Predictors of the use and approval of CAM: results from the German General Social Survey (ALLBUS). 2020;9:1–11. 10.1186/s12906-020-02966-9 PMC7291752 32527256 7 Stampini V Bortoluzzi S Allara E Amadori R Surico D Prodam F et al The use of Complementary and Alternative Medicine (CAM) among Italian children: A cross-sectional survey Complement Ther Med 2019 47 102184 doi: 10.1016/j.ctim.2019.08.018 31780014 8 Halpin SN Potapragada NR Bergquist SH Jarrett T Use and factors associated with non-disclosure of complementary and alternative medicine among older adults Educ Gerontol 2020 46 1 18 25 9 Okaiyeto K Oguntibeju OO African Herbal Medicines: Adverse Effects and Cytotoxic Potentials with Different Therapeutic Applications Int J Environ Res Public Health 2021 18 11 5988 doi: 10.3390/ijerph18115988 34199632 PMC8199769 10 Phua DH Zosel A Heard K Dietary supplements and herbal medicine toxicities-when to anticipate them and how to manage them Int J Emerg Med 2009 2 2 69 76 doi: 10.1007/s12245-009-0105-z 20157447 PMC2700222 11 Ali BH Blunden G Tanira MO Nemmar A Some phytochemical, pharmacological and toxicological properties of ginger (Zingiber officinale Roscoe): a review of recent research Food Chem Toxicol 2008 46 2 409 20 doi: 10.1016/j.fct.2007.09.085 17950516 12 Hijazi MA Shatila H El-Lakany A Aboul Ela M Kharroubi S Alameddine M et al Beliefs, practices and knowledge of community pharmacists regarding complementary and alternative medicine: national cross-sectional study in Lebanon BMJ Open 2019 9 3 doi: 10.1136/bmjopen-2018-025074 30852542 PMC6429928 13 Foley H Steel A Cramer H Wardle J Adams J Disclosure of complementary medicine use to medical providers: a systematic review and meta-analysis Sci Rep 2019 9 1 1573 doi: 10.1038/s41598-018-38279-8 30733573 PMC6367405 14 Harnett JE Desselle S Ung COL Towards consensus: defining and supporting a professional role for pharmacists associated with traditional and complementary medicines - a protocol of implementing an international e-survey BMJ Open 2022 12 7 doi: 10.1136/bmjopen-2022-061352 35902196 PMC9341198 15 Ng JY Tahir U Dhaliwal S Barriers, knowledge, and training related to pharmacists’ counselling on dietary and herbal supplements: a systematic review of qualitative studies BMC Health Serv Res 2021 21 1 499 doi: 10.1186/s12913-021-06502-4 34034710 PMC8147056 16 Salman Popattia A La Caze A An ethical framework for the responsibilities of pharmacists when selling complementary medicines Res Social Adm Pharm 2021 17 5 850 7 doi: 10.1016/j.sapharm.2020.07.002 32747136 17 Harnett JE Desselle SP Fernandes MB Yao D Modun D Hallit S et al Defining and supporting a professional role for pharmacists associated with traditional and complementary medicines: a cross-country survey of pharmacists Front Pharmacol 2023 14 1215475 doi: 10.3389/fphar.2023.1215475 37654614 PMC10467277 18 Kwan D Hirschkorn K Boon H U.S. and Canadian pharmacists’ attitudes, knowledge, and professional practice behaviors toward dietary supplements: a systematic review BMC Complement Altern Med 2006 6 31 doi: 10.1186/1472-6882-6-31 16984649 PMC1586212 19 GVR Alternative and complementary medicine market analysis by intervention (botanicals, acupuncture, mind, body, and yoga, magnetic intervention), by distribution method, and segment forecasts, 2013 - 2025 2017 20 Aljawadi MH Khoja AT AlOtaibi AD Alharbi KT Alodayni MA AlMetwazi MS et al The Utilization of Complementary and Alternative Medicine among Saudi Older Adults: A Population-Based Study Evid Based Complement Alternat Med 2020 2020 4357194 doi: 10.1155/2020/4357194 32831865 PMC7428939 21 Almaqhawi A Hayim E Amer FA Almuhanna S Khteeb NA Khwajah SH Use of Complementary and Alternative Medicines (CAMs) Among Diabetic Patients in Al Ahsa, Saudi Arabia: A Cross-Sectional Study Mater Sociomed 2023 35 4 256 63 38380291 10.5455/msm.2023.35.256-263 PMC10875948 22 Sawalha AF Complementary and alternative medicine (CAM) in Palestine: use and safety implications J Altern Complement Med 2007 13 2 263 9 doi: 10.1089/acm.2006.6280 17388770 23 Quzmar Y Istiatieh Z Nabulsi H Zyoud SH Al-Jabi SW The use of complementary and alternative medicine during pregnancy: a cross-sectional study from Palestine BMC Complement Med Ther 2021 21 1 108 doi: 10.1186/s12906-021-03280-8 33794888 PMC8017862 24 Al-Jabi SW Khader M Hamarsha I Atallh D Bani-Odeh S Daraghmeh A et al Complementary and alternative medicine use among pediatrics in Palestine: a cross-sectional study BMC Pediatr 2021 21 1 503 doi: 10.1186/s12887-021-02985-6 34758756 PMC8582129 25 Eker HH Eriş C Kartal M Abuduli M Atmaca S Topçu G The Consumption Preferences on the Use of Herbal Products in Turkey and Opinions on Pharmacists Int J Sci Eng Res 2017 5 12 2347 3878 26 Azaizeh H Saad B Cooper E Said O Traditional Arabic and Islamic Medicine, a Re-emerging Health Aid Evid Based Complement Alternat Med 2010 7 4 419 24 doi: 10.1093/ecam/nen039 18955344 PMC2892355 27 Tülek E Yarici F Yavuz DO Modu MB Meriçli F Herbal Medicines Use in Pregnancy in Northern Cyprus J Pharm Res Int 2021 33 487 504 28 El-Jardali F Lavis JN Ataya N Jamal D Use of health systems and policy research evidence in the health policymaking in eastern Mediterranean countries: views and practices of researchers Implement Sci 2012 7 2 doi: 10.1186/1748-5908-7-2 22236561 PMC3286421 29 IQVIA The Impact of COVID-19 on Middle- East Healthcare: Current and Future 2020 30 BMI R Middle East & Africa pharma & healthcare 2018 31 Akik C Semaan A Shaker-Berbari L Jamaluddine Z Saad GE Lopes K et al Responding to health needs of women, children and adolescents within Syria during conflict: intervention coverage, challenges and adaptations Confl Health 2020 14 37 doi: 10.1186/s13031-020-00263-3 32523615 PMC7278078 32 Daher S Ziade F Nasreddine L Baroudi M Naja F Breastfeeding and complementary feeding in fragile settings: the case of Syrian refugees and their host communities in North Lebanon Int Breastfeed J 2022 17 1 37 doi: 10.1186/s13006-022-00480-x 35568877 PMC9107246 33 Abu Mhadi A Ong SC Abed Y Exploring medicines use patterns and practices among the public in the Gaza strip, Palestine: A qualitative study Journal of Research in Pharmacy 2023 27 1 469 80 34 Peters MDJ Marnie C Tricco AC Pollock D Munn Z Alexander L et al Updated methodological guidance for the conduct of scoping reviews JBI Evid Synth 2020 18 10 2119 26 doi: 10.11124/JBIES-20-00167 33038124 35 Tarhan N Arslan M Şar S A structural equation model for pharmacy students’ acquiring knowledge-based behavior towards complementary and alternative medicine Eur J Integr Med 2017 16 54 60 36 Alshahrani SM Assessment of Knowledge, Attitudes, and Practice of Community Pharmacists Regarding Weight Reduction Agents and Supplements in Aseer Region, Saudi Arabia Risk Manag Healthc Policy 2020 13 347 53 doi: 10.2147/RMHP.S234818 32368165 PMC7183337 37 Ahmed J Khan F Community pharmacists’ knowledge, attitudes and practices towards the use of herbal remedies J Pharm Res Int 2019 31 6 1 8 38 Albassam A Awad A Community pharmacists’ services for women during pregnancy and breast feeding in Kuwait: a cross-sectional study BMJ Open 2018 8 1 doi: 10.1136/bmjopen-2017-018980 29306891 PMC5780848 39 Awad AI Al-Ajmi S Waheedi MA Knowledge, perceptions and attitudes toward complementary and alternative therapies among Kuwaiti medical and pharmacy students Med Princ Pract 2012 21 4 350 4 doi: 10.1159/000336216 22377503 40 Basheti IA Elayeh ER Dalal B Al Natour DB El Hait SS Opinions of pharmacists and herbalists on herbal medicine use and receiving herbal medicine education in Jordan Tropical Journal of Pharmaceutical Research 2017 16 3 689 96 41 Naja F Abbas N Khaleel S Zeb F Osaili TAH Obaid RS et al Beyond pillbox: a national cross-sectional study on the attitudes, practices, and knowledge of community pharmacists regarding complementary and alternative medicine BMC Complement Med Ther 2024 24 1 107 doi: 10.1186/s12906-024-04391-8 38418995 PMC10902973 42 Renda G Gökkaya İ Kandemir G Özyiğit T Kurt T Pharmacy Students’ Knowledge and Attitudes about Homeopathy: A Descriptive Survey Conducted in Turkey Homeopathy 2024 113 1 41 8 doi: 10.1055/s-0043-1761267 37105218 43 Hijazi MA Shatila H Abu Qiyas S Aboul-Ela M El-Lakany A Naja F Complementary and alternative medicine use during the COVID-19 pandemic: Community pharmacists’ knowledge, attitudes, and practices Research in Social and Administrative Pharmacy 2022 10.1016/j.sapharm.2022.10.009 PMC9617642 36371308 44 AlMukdad S Zaghloul N Awaisu A Mahfoud ZR Kheir N El Hajj MS Exploring the Role of Community Pharmacists in Obesity and Weight Management in Qatar: A Mixed-Methods Study Risk Manag Healthc Policy 2021 14 2771 87 doi: 10.2147/RMHP.S309142 34234592 PMC8256378 45 Alshammari KF Alradaddi FM Alshammari KF Almutairi MQ Almakhalfi NS Almeshari RA et al Assessment of Knowledge about Traditional Medicine Reveals Overuse as a Potential Risk for Aggravating COVID-19 and Underlying Diseases in Geriatrics and Women’s Health in the Saudi Population Clin Pract 2022 12 3 363 73 doi: 10.3390/clinpract12030041 35645318 PMC9149801 46 Shilbayeh SA Exploring knowledge and attitudes towards counselling about vitamin supplements in Jordanian community pharmacies Pharm Pract (Granada) 2011 9 4 242 51 doi: 10.4321/s1886-36552011000400010 24198863 PMC3818741 47 Qunaibi E Basheti IA Hamadi SA Bulatova NR Shanah A Abu-Gharbieh E Effect of divergence in patients’ socioeconomic background on their perspective of the role of the community pharmacist in Amman, Jordan Tropical Journal of Pharmaceutical Research 2013 12 2 247 53 48 Jalil B Naser AY M Prieto J Heinrich M Herbal supplements in Jordan: a cross-sectional survey of pharmacists’ perspectives and knowledge BMJ Open 2022 12 7 doi: 10.1136/bmjopen-2021-057405 35896285 PMC9335029 49 Mahnashi MH Knowledge, attitude, practice, and the perceived barriers with respect to the use of herbal medicines Curr Top Nutraceutical Res 2021 19 1 29 35 50 Mohammed SI Al-Shadedi MI Kasim AA Knowledge, use and recommendation of Iraqi pharmacist toward complementary and alternative medicine Iraqi Journal of Pharmaceutical Sciences 2020 29 1 88 93 51 Ghosn SA Brian A Mohammad DA Community pharmacist’s knowledge, attitude, and practices towards vitamin supplements in Al-Khobar region, Saudi Arabia: A descriptive cross-sectional study J Pharm Bioallied Sci 2017 7 10 1 5 10.4103/jpbs.JPBS_99_19 PMC6791078 31619915 52 Sheriff MM Alotaibi SD Alharbi GH Alghamdi MMO Aljadani NM Alzahrani HA et al A Cross-Sectional Study on the Awareness and Practice of the Use of Supplemental Vitamin C, Arginine, and Zinc in Managing Wounds Among Healthcare Workers in Saudi Arabia Cureus 2023 15 12 10.7759/cureus.51235 PMC10821765 38283517 53 Satil F Aktaÿ E Covid-19 Pandemic, Healthcare Workers’ Use of Medicinal and Aromatic Plants Journal Title 2023 26 2 263 70 54 Altamimi M Hamdan M Badrasawi M Allahham S Knowledge, Attitudes and Practices Related to Dietary Supplements among a Group of Palestinian Pharmacists Sultan Qaboos Univ Med J 2021 21 4 613 20 doi: 10.18295/squmj.4.2021.029 34888082 PMC8631217 55 Fahmy SA Abdu S Abuelkhair M Pharmacists’ attitude, perceptions and knowledge towards the use of herbal products in Abu Dhabi, United Arab Emirates Pharm Pract (Granada) 2010 8 2 109 15 doi: 10.4321/s1886-36552010000200005 25132878 PMC4133064 56 Abahussain NA Abahussain EA Al-Oumi FM Pharmacists’ attitudes and awareness towards the use and safety of herbs in Kuwait Pharm Pract (Granada) 2007 5 3 125 9 doi: 10.4321/s1886-36552007000300005 25214928 PMC4154746 57 Hijazi MA Shatila H El-Lakany A Al Rifai H Aboul-Ela M Naja F Role of community pharmacists in weight management: results of a national study in Lebanon BMC Health Serv Res 2020 20 1 386 doi: 10.1186/s12913-020-05258-7 32381084 PMC7204056 58 Hijazi MA Shatila H Omeich Z El-Lakany A Ela MA Naja F The role of pharmacists in complementary and alternative medicine in Lebanon: users’ perspectives BMC Complement Med Ther 2021 21 1 81 doi: 10.1186/s12906-021-03256-8 33691698 PMC7944898 59 Hussain FN Rainkie D Alali FQ Wilby KJ Association of pharmacy students’ cultural beliefs with perceived knowledge, beliefs, confidence, and experience with complementary medicine Curr Pharm Teach Learn 2021 13 2 159 63 doi: 10.1016/j.cptl.2020.09.009 33454073 60 Ababneh M Elrashed N Al-Azayzih A Evaluation of Jordanian Healthcare Providers’ Knowledge, Attitudes, and Practice Patterns towards Probiotics Expert Rev Pharmacoecon Outcomes Res 2020 20 1 93 7 doi: 10.1080/14737167.2019.1609354 31023117 61 Alsai d AMAH Mohamed MS Mallhi TH Panda DS Khan YH Butt MH Knowledge, Attitude and Practice of Community Pharmacists towards Food-Drug Interactions; A Prospective Cross-Sectional Analysis from Sudan Latin American Journal of Pharmacy 2022 41 3 506 14 62 Alrabiah Z Al-Arifi MN Alghadeer SM Wajid S AlQahtani A Almotari N et al Knowledge of community pharmacists about the risks of medication use during pregnancy in central region of Saudi Arabia Saudi Pharm J 2017 25 7 1093 6 doi: 10.1016/j.jsps.2017.05.005 29158721 PMC5681324 63 Ezzat S A study of the use of drugs in the treatment of obesity among adult females Int J Health Care Qual Assur 2012 25 8 730 41 doi: 10.1108/09526861211270668 23276065 64 Sarinca Y Doganli B Sezer Senol F Orhan IE Assessment of consumer perceptions in Ankara (Turkey) toward herbal medicinal products: A survey analysis in the Etimesgut district Clinical and Experimental Health Sciences 2017 65 Al-Ramahi R Patterns and attitudes of self-medication practices and possible role of community pharmacists in Palestine Int J Clin Pharmacol Ther 2013 51 7 562 7 doi: 10.5414/CP201814 23587151 66 Suleiman AA Alboqai OK Yasein N Al-Essa MK El Masri K Prevalence of vitamin-mineral supplement use among Jordan University students Saudi Med J 2008 29 9 1326 31 18813421 67 Wazaify M Al-Bsoul-Younes A Abu-Gharbieh E Tahaineh L Societal perspectives on the role of community pharmacists and over-the-counter drugs in Jordan Pharm World Sci 2008 30 6 884 91 doi: 10.1007/s11096-008-9244-1 18683077 68 Nassar RI Thiab S Basheti IA The battle against COVID-19 in Jordan: A cross-sectional study assessing the experience of Jordanians who have been infected with COVID-19 Pharm Pract (Granada) 2023 21 1 2791 doi: 10.18549/PharmPract.2023.1.2791 37090460 PMC10117353 69 Karim WA Rabea IS Abdulwahid HH Enhancing adherence to recommended micronutrient supplements during pregnancy through pharmacist intervention Kerb J Pharm Sci 2023 1 70 Bajuayfir A Alhazmi M Alshareef O Rawas A Alsharif S Almasoudi A et al Evaluation of Current Community Pharmacist Practice in Saudi Arabia: A Cross-sectional Study from Patients’ Perspective (PART I) J Res Pharm Pract 2023 12 1 15 20 doi: 10.4103/jrpp.jrpp_12_23 38213603 PMC10779689 71 Sweiss K Naser AY Tayseer A-R Jordanian Use of and Beliefs Concerning the Efficacy of Medicinal Plants: A Cross-Sectional Study Cureus 2023 15 4 doi: 10.7759/cureus.37494 37187647 PMC10181450 72 Abdelmotalab MAA Alhaj MMA Eltaib MZA Abd Alghafar MSE Nour ASM Ali HHM Knowledge, attitudes, and practice of self-medication among medical students at Sudan International University, Sudan Al-Kindy College Medical Journal 2023 19 1 57 61 73 Özcan V Şakul AA Özbek H Measuring level of information and demand of users about the content of drug and food supplements Turk Hijyen ve Deneysel Biyoloji Dergisi 2022 79 2 199 208 74 Ghaith AS Population perceptions and views of community pharmacists during the Covid-19 pandemic: a comparative, cross-sectional study in Jordan and Kuwait Regional Statistics 2024 14 4 793 812 75 Nassar RI Basheti IA Ahmad A Al-Majmaie S Awajan D Al-Alwany RR An overview of the experience of Iraqi COVID-19 patients, and the role of the pharmacists during their infection Pharm Pract (Granada) 2024 22 3 1 10 76 Basheti IA Barqawi H Nassar RI Thiab S Atatreh N Abu-Gharbieh E The Effects of Medications and the Roles of Pharmacists on the Recovery of Patients with COVID-19 Infection: An Epidemiological Study from the United Arab Emirates Healthcare (Basel) 2023 11 4 467 doi: 10.3390/healthcare11040467 36833001 PMC9957395 77 Al-Arifi MN Wajid S Al-Manie NK Al-Saker FM Babelgaith SD Asiri YA Evaluation of knowledge of health care professionals on warfarin interactions with drug and herbal medicines Pak J Med Sci 2016 32 1 229 33 27022381 10.12669/pjms.321.8902 PMC4795875 78 Aldryhim AY Alomair A Alqhtani M Mahmoud MA Alshammari TM Pont LG Factors that facilitate reporting of adverse drug reactions by pharmacists in Saudi Arabia Expert Opin Drug Saf 2019 18 8 745 52 31232612 10.1080/14740338.2019.1632287 79 Sweileh W Abu Arrah E Abu Taha A Sawalha A Salah O Jamous R Dispensing practices, attitudes and knowledge of pharmacists towards herbal products in Palestine Ibnosina Journal of Medicine and Biomedical Sciences 2013 5 3 123 30 80 Kheir N Gad HY Abu-Yousef SE Pharmacists’ knowledge and attitudes about natural health products: a mixed-methods study Drug Healthc Patient Saf 2014 6 7 14 doi: 10.2147/DHPS.S57756 24501547 PMC3912048 81 Duraz AY Khan SA Knowledge, attitudes and awareness of community pharmacists towards the use of herbal medicines in Muscat region SA Pharmaceutical Journal 2011 78 7 35 7 10.5001/omj.2011.115 PMC3251205 22253959 82 Khram N Aboul Ela M Ali Hijazi M Soubra L Assessment of the Lebanese Community Pharmacist Knowledge, Practice and Barriers Regarding the Prevention of Osteoporosis BAU Journal - Health and Well-Being 2022 4 2 83 Mahdi AS Warid F Saleem M Techniques M Directorate BE A statistical study about knowledge pharmacy students with drugs indicated and contraindicated in pregnancy Journal of Population Therapeutics and Clinical Pharmacology 2023 30 3 84 Sancar M Tezcan E Okuyan B Izzettin FV Assessment of the attitude of community pharmacists and pharmacy technicians towards diarrhea: A simulated patient study in Turkey Tropical Journal of Pharmaceutical Research 2015 14 8 1509 15 85 Naseef H, Ayyash N, Almtour M, Shrateeh A, AbuKhalil A, Ni’meh, et al. Exploring the role of community pharmacists in drug interactions: A cross-sectional study in Palestine. 2021;44(1):81–8. 86 Alhubail SA Alharthi MM Alsayyah FF Younis NS Healthcare Professionals and Undergraduate Students’ Knowledge Toward Drug-Food Interactions in the Eastern Region of Saudi Arabia J Multidiscip Healthc 2023 16 2883 92 doi: 10.2147/JMDH.S419544 37790990 PMC10543414 87 Koni AA Qashoa H Musa AA Masri M Hazem W Taha S et al Knowledge and practice of community pharmacists regarding the safety of drugs during pregnancy: a cross-sectional study from a developing country BMC Pregnancy Childbirth 2024 24 1 1 10 38468217 10.1186/s12884-024-06393-3 PMC10926555 88 Alqahtani SS Alam N Alharbi SM Najmi WH Daghriri SH Ahmad S Knowledge, attitude, and practice regarding vitamin D and dietary supplements use: a community pharmacy based cross-sectional study in Jazan, Saudi Arabia Curr Top Nutraceutical Res 2021 20 2 431 7 89 Jarab AS Al-Qerem W Mubarak DF Abu Heshmeh SR Naser AY Al Hamarneh YN Practice, competency and attitude toward weight management service and the barriers for its implementation in the community pharmacy setting Pharm Pract (Granada) 2024 22 2 1 8 90 Dumenci M Mericli F Tosun Ö Yavuz DÖ The attitude, knowledge, and evaluation of herbal medicinal products for respiratory diseases in Northern Cyprus among pharmacists, patients, and pulmonologists Indian Journal of Pharmaceutical Education and Research 2023 57 4 1242 50 91 Jairoun AA Al Hemyari SS Abdulla NM Shahwan M Jairoun M Godman B et al Development and Validation of a Tool to Improve Community Pharmacists’ Surveillance Role in the Safe Dispensing of Herbal Supplements Front Pharmacol 2022 13 916223 doi: 10.3389/fphar.2022.916223 35860014 PMC9289787 92 Alzahrani AS Greenfield SM Shrestha S Paudyal V Views of healthcare professionals on complementary and alternative medicine use by patients with diabetes: a qualitative study BMC Complement Med Ther 2024 24 1 81 doi: 10.1186/s12906-024-04385-6 38336657 PMC10854181 93 Al-Hinai SM Haridass S Hassali M Nouri I Verma A Knowledge, attitude, and use of complementary and alternative medicine (CAM) among pharmacy and nursing students in Oman International Journal of Advanced Community Medicine 2018 1 1 40 5 94 Alnaim L Almazrou S Alsunbul M Alhaji A Alenazi A Alboami S Pharmacist’s knowledge and attitudes towards complementary and alternative medicine in Saudi Arabia: A cross-sectional study Adv Integr Med 2018 5 3 96 102 95 Başar Güneş H Bayraktar Ekincioğlu A Karakan T Demirkan K Assessment of Knowledge and Attitudes of Physicians and Pharmacists on Probiotics: A Cross-Sectional Survey Turk J Pharm Sci 2024 21 1 36 41 doi: 10.4274/tjps.galenos.2023.36974 38528810 PMC10982882 96 Alshahrani SM Community pharmacists’ knowledge, attitudes, and barriers toward prescribing probiotics in Aseer region, Saudi Arabia Curr Top Nutraceutical Res 2024 22 2 612 6 97 Lam Ung CO Kbar N Aslani P Smith L Gelissen IC Harnett JE Pharmacy education in traditional and complementary medicines - A systematic review Res Social Adm Pharm 2023 19 10 1331 53 doi: 10.1016/j.sapharm.2023.07.007 37482480 98 Issa RA Basheti IA Herbal products use among chronic patients and its impact on treatments safety and efficacy: A clinical survey in the Jordanian field Trends in Medical Research 2016 12 1 32 44 99 Kasim HF Prevalence of potential drug interactions among outpatients’ prescriptions of community pharmacies in Nineveh Governorate, Iraq J Pharm Pharmacogn Res 2023 11 2 281 90 100 Shraim NY Shawahna R Sorady MA Aiesh BM Alashqar GS Jitan RI et al Community pharmacists’ knowledge, practices and beliefs about complementary and alternative medicine in Palestine: a cross-sectional study BMC Complement Altern Med 2017 17 1 429 doi: 10.1186/s12906-017-1940-8 28851351 PMC5575941 101 Awad A Waheedi M Community Pharmacists role in obesity treatment in Kuwait: a cross-sectional study BMC Public Health 2012 12 863 doi: 10.1186/1471-2458-12-863 23057422 PMC3491033 102 Basheti IA Qunaibi EA Hamadi SA Abu-Gharbieh E Saleh S AbuRuz S Patient perspectives of the role of the community pharmacist in the Middle East: Jordan, United Arab Emirates and Iraq Pharmacology & Pharmacy 2014 5 6 588 99 103 Dabaghzadeh F Hajjari R Practice of community pharmacists related to multivitamin supplements: a simulated patient study in Iran Int J Clin Pharm 2018 40 1 190 5 doi: 10.1007/s11096-017-0579-3 29270735 104 Karout S Khojah HMJ Itani R Jaffal F El-Lakany A Assessing the pharmaceutical care provision to suspected COVID-19 patients in community pharmacies: a simulated patient study BMC Health Serv Res 2022 22 1 467 doi: 10.1186/s12913-022-07870-1 35397543 PMC8994087 105 Alshahrani A Knowledge, attitudes, and practice of community pharmacists towards providing counseling on vitamins, and nutritional supplements in Saudi Arabia AIMS Public Health 2020 7 3 697 712 doi: 10.3934/publichealth.2020054 32968687 PMC7505785 106 Jarab AS Al-Qerem W Alzoubi KH Tharf M Abu Heshmeh S Al-Azayzih A et al Patterns of drug-related problems and the services provided to optimize drug therapy in the community pharmacy setting Saudi Pharm J 2023 31 9 101746 doi: 10.1016/j.jsps.2023.101746 37649677 PMC10462881 107 Khdour MR Kurdi M Hallak HO Jarab AS Dweib M Al-Shahed QN Pharmacists’ knowledge, attitudes and practices towards herbal remedies in West Bank, Palestine Int Arch Med 2016 1 9 108 Assi M Fahs I Lteif R Hallal Z Hdaib F Herbal medicine use among adult Lebanese patients with chronic diseases: A descriptive cross-sectional study Open Public Health J 2024 17 1 1 9 109 Nikvarz N Sedighi B Ansari M Shahdizade S Shojaei R Sharififar F Medicinal plants used in multiple sclerosis patients, prevalence and associated factors: a descriptive cross-sectional study BMC Complement Med Ther 2024 24 1 278 doi: 10.1186/s12906-024-04587-y 39039480 PMC11265095 110 Yumrukaya L Sözen-Şahne B Saraçoğlu İ Yeğenoğlu S Exploring the Dietary Supplement Use During COVID-19: Insights from Community Pharmacists, Pharmacy Staff, Academics, and Industry Experts J Integr Complement Med 2024 30 12 1179 88 doi: 10.1089/jicm.2023.0632 39046925 PMC11659460 111 Awad A Al-Shaye D Public awareness, patterns of use and attitudes toward natural health products in Kuwait: a cross-sectional survey BMC Complement Altern Med 2014 14 105 doi: 10.1186/1472-6882-14-105 24646341 PMC3999934 112 Fathy H El-Hawy R Hassan R Attitudes, knowledge and practice of herbal remedy use among the population visiting pharmacies and health care providers in Alexandria, Egypt: A cross-sectional study Eur J Med Plants 2019 30 2 1 10 113 Alameri MA Gharaibeh L Al-Hawamdeh MI Atwan R Daoud E Awareness, knowledge, and behaviour of Jordanian public regarding misuse and overuse of proton pump inhibitors Pharm Pract (Granada) 2024 22 2 2 7 114 Loni SB Eid Alzahrani R Alzahrani M Khan MO Khatoon R Abdelrahman HH et al Prevalence of self-medication and associated factors among female students of health science colleges at Majmaah University: A cross-sectional study Front Public Health 2023 11 1090021 doi: 10.3389/fpubh.2023.1090021 36875361 PMC9978380 115 Alnaimat F Alduraidi H Alhafez L Abu Raddad L Haddad BI Hamdan M et al Rates, patterns, and predictors of complementary medicine use among patients with musculoskeletal diseases PLoS One 2023 18 6 doi: 10.1371/journal.pone.0287337 37352251 PMC10289458 116 Babelghaith SD Sales I Syed W Al-Arifi MN The use of complementary and alternative medicine for functional gastrointestinal disorders among the saudi population Saudi Pharm J 2024 32 6 102084 doi: 10.1016/j.jsps.2024.102084 38716111 PMC11074969 117 Tezcan S Butur M Evaluation of the attitudes and practices of patients regarding the use of herbal products Ankara Universitesi Eczacilik Fakultesi Dergisi 2022 46 3 817 26 118 Iskandar K Hallit S Haddad C Mohammed I Fekihromdhane F Jabeen R Highlighting the pivotal role of the pharmacist in influencing health behaviours during emergency crisis: A lesson from the COVID-19 pandemic Pharmacy Education 2023 23 1 676 92 119 El-Gamal F Alsahafi BA Alsammak I Darwesh E Albogami R Taha A Knowledge, attitude, and practice towards over-the-counter drugs (OTC) use among adult population in Jeddah, Saudi Arabia World Family Medicine Journal/Middle East Journal of Family Medicine 2022 1 120 Alrasheedy AA Pharmaceutical Activities, Services, Medicines, and Products at Community Pharmacies in the Qassim Region of Saudi Arabia: Findings and Implications for the Future Cureus 2024 16 8 doi: 10.7759/cureus.67957 39193053 PMC11349288 121 Al-Hadi AH Mikhael EM Pharmacists’ perception about efficacy, safety, and quality of dietary supplements that used for rheumatic disorders in the Iraqi pharmaceutical market PLoS One 2024 19 7 doi: 10.1371/journal.pone.0306380 39052573 PMC11271853 122 Tobaiqy M AlZahrani FA Hassan AS Alirbidi AH Alraddadi OA AlSadah OA et al Community Pharmacists’ Knowledge, Attitudes and the Perceived Safety and Effectiveness of Melatonin Supplements: A Cross-Sectional Survey Pharmacy (Basel) 2023 11 5 147 doi: 10.3390/pharmacy11050147 37736919 PMC10514787 123 Darwish RM Shehadeh M Jalouqa S Suaifan G Users’ knowledge and self medications in relation to gastric problems among adults in a middle income country; Jordan J Subst Use 2022 27 5 470 4 124 Bahha A Habib A Alluqmani A Alqurashi A Alotaibi A Al-Hindi Y Awareness of natural herbs’ effect on blood pressure among the western region of Saudi Arabia population: A cross-sectional study Pharmacognosy Res 2022 14 4 461 7 125 Mohamed Ibrahim OH Ibrahim RM Al-Tameemi NK Bahy Mohammed Ebaed S AlMazrouei N Riley K Evaluation of the use and attitudes of pregnant and postpartum women towards medicine utilisation during pregnancy in the United Arab Emirates: A national cross-sectional study Int J Clin Pract 2021 75 9 doi: 10.1111/ijcp.14344 33977619 126 Jaber D Alhusban A Long-term complications of COVID-19 in Jordan: A study on persisting symptoms and management Clin Epidemiol Glob Health 2024 28 101627 127 Alghadir AH Iqbal A Iqbal ZA Attitude, Beliefs, and Use of Herbal Remedies by Patients in the Riyadh Region of Saudi Arabia Healthcare (Basel) 2022 10 5 907 doi: 10.3390/healthcare10050907 35628044 PMC9141412 128 Sakallı HK Tosun Ö Yavuz DÖ Meriçli F Attitudes and approaches towards COVID-19 management among the public and pharmacists in Northern Cyprus Tropical Journal of Pharmaceutical Research 2022 21 6 1309 16 129 Bastani P Nia AA Shabanpoor M Mehravar S Kashefian S Knowledge, Attitude and Practice of Iranian Pharmacists, Body Builders, and Their Coaches Regarding Sports Supplements J Res Pharm Pract 2017 6 3 166 72 doi: 10.4103/jrpp.JRPP_17_35 29026842 PMC5632937 130 Mirnia K Saeedi M Sangsari R Talebi A Who are the main recommenders of herbal drugs for treating neonatal jaundice? Journal of Comprehensive Pediatrics 2024 15 1 1 5 131 Rabbani SA Sharma S Mahtab A Pottoo FH Sridhar SB A systematic scoping review of implementation of telepharmacy during COVID-19 J Appl Pharm Sci 2023 13 4 30 44 132 Saadeh A Jaradat R Jarab AS Saadeh N Assessment of Jordanian community pharmacists’ confidence to provide health services and advice on self-medication for women during pregnancy and breastfeeding Int J Pharm Pract 2023 31 2 183 9 doi: 10.1093/ijpp/riad003 36929412 133 Abdulla NM Blair I Ádám B Oulhaj A Jairoun AA The link between knowledge and practices in relation to herbal supplement use: for a rapid transfer of knowledge in the field of phytovigilance and pharmacovigilance health care systems Journal of Pharmaceutical Health Services Research 2023 14 2 151 8 134 Dmour I Al-Hamaideh KD Al-Qudah SA Al-Shawabkeh JD Self-care interventions among the Jordanians during the COVID-19 lockdown: A cross-sectional study of community pharmacists’ observations J Appl Pharm Sci 2023 13 8 212 22 135 Dabaghian F Hasanpour M Maroufizadeh S Joulani MH Khanavi M Use of medicinal plants and its association with health literacy in the general population of Iran during the COVID-19 pandemy: a web-based cross-sectional survey Res J Pharmacognosy 2023 10 1 31 40 136 Maslat A, Nadia AA, Manal AN, Mashaal LKHA, Alrashdan Y, Al-Rawashdeh NH. Drug misuse and self-medication among pharmacy students in Jordan. 2023;LI(3). 10.36740/Merkur202305104 38069846 137 Bulatova N Younes S Arabiyat M Abukaff A Madanat S Alqudah E et al Use of traditional and complementary medicine for COVID 19 prophylaxis among healthcare professionals and students in Jordan: A cross-sectional study PLoS One 2022 17 10 doi: 10.1371/journal.pone.0276015 36264917 PMC9584517 138 Keshvari N Yousefi N Peiravian F Sharif Z Exploring health seeking behaviors for common cold management Explor Res Clin Soc Pharm 2023 11 100301 doi: 10.1016/j.rcsop.2023.100301 37533759 PMC10392600 139 Gökkaya İ Renda G Coşkun H Koçak M Özgen U A descriptive survey study in endocrinology clinic: evaluation of the use of natural products Curr Med Res Opin 2023 39 11 1439 49 doi: 10.1080/03007995.2023.2270898 37830875 140 Gülpinar G Community pharmacists’ perspectives on the use of social media opinion leaders (influencer) in the marketing and sales of food supplements and herbal content products Ankara Universitesi Eczacilik Fakultesi Dergisi 2023 47 2 1 10 141 Saleh EA Haddadin RN Saleh B Elayeh E Changes in drug demand when a pandemic coincides with other outbreaks in a war zone country: a cross-sectional pilot study J Pharm Policy Pract 2022 15 1 89 doi: 10.1186/s40545-022-00487-z 36419090 PMC9682693 142 Daghash RM Al-Saideh MA Itani R Evaluation of pharmacotherapy standards during pregnancy among Jordanian pharmacy colleges graduates Jordan Journal of Pharmaceutical Sciences 2023 16 3 607 20 143 Hasan RF Hadi NR Marzooq HF Najaf HN Knowledge, attitude and practice of community pharmacists on medication risks on pregnant women in Al Najaf City, Iraq Latin American Journal of Pharmacy 2023 42 4 842 8 144 Chung VCH Ma PHX Lau CH Wong SYS Yeoh EK Griffiths SM Views on traditional Chinese medicine amongst Chinese population: a systematic review of qualitative and quantitative studies Health Expect 2014 17 5 622 36 doi: 10.1111/j.1369-7625.2012.00794.x 22647085 PMC5060915 145 Harnett JE Lam Ung CO Towards defining and supporting pharmacists’ professional role associated with traditional and complementary medicines – a systematic literature review Research in Social and Administrative Pharmacy 2023 19 10.1016/j.sapharm.2022.11.001 36404259 146 Obaid D El-Dahiyat F Babar ZUD Pharmacy practice and clinical pharmacy research in the Middle East: a scoping review of studies from Bahrain, Iraq, Jordan, Kuwait, Lebanon, Oman, Palestine, Qatar, Saudi Arabia, Syria, United Arab Emirates, and Yemen J Pharm Policy Pract 2022 15 1 1 15 35676727 10.1186/s40545-022-00434-y PMC9175494 147 Ritchie A Seubert L Clifford R Perry D Bond C Do randomised controlled trials relevant to pharmacy meet best practice standards for quality conduct and reporting? A systematic review Int J Pharm Pract 2020 28 3 220 32 doi: 10.1111/ijpp.12578 31573121 148 Thiese MS Observational and interventional study design types; an overview Biochem Med (Zagreb) 2014 24 2 199 210 doi: 10.11613/BM.2014.022 24969913 PMC4083571 149 Spector PE Do not cross me: optimizing the use of cross-sectional designs J Bus Psychol 2019 34 2 150 Yadav D Criteria for good qualitative research: A comprehensive review Asia-Pacific Education Researcher 2022 31 6 151 Yin RK Validity and generalization in future case study evaluations Evaluation 2013 19 3 152 Gubbins PO Micek ST Badowski M Cheng J Gallagher J Johnson SG Innovation in clinical pharmacy practice and opportunities for academic-practice partnership Pharmacotherapy 2014 34 10.1002/phar.1427 24877189 153 Lam Ung CO Kbar N Aslani P Smith L Gelissen IC Harnett JE Pharmacy education in traditional and complementary medicines – a systematic review Research in Social and Administrative Pharmacy 2023 19 10.1016/j.sapharm.2023.07.007 37482480 10.1371/journal.pone.0332932.r001 Decision Letter 0 Mohammed Ali Haider Academic Editor © 2025 Ali Haider Mohammed 2025 Ali Haider Mohammed https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License Submission Version 0  6 Jul 2025 Dear Dr. Hijazi, Please submit your revised manuscript by Aug 20 2025 11:59PM. If you will need more time than this to complete your revisions, please reply to this message or contact the journal office at plosone@plos.org https://www.editorialmanager.com/pone/ A rebuttal letter that responds to each point raised by the academic editor and reviewer(s). You should upload this letter as a separate file labeled 'Response to Reviewers'. A marked-up copy of your manuscript that highlights changes made to the original version. You should upload this as a separate file labeled 'Revised Manuscript with Track Changes'. An unmarked version of your revised paper without tracked changes. You should upload this as a separate file labeled 'Manuscript'. If you would like to make changes to your financial disclosure, please include your updated statement in your cover letter. Guidelines for resubmitting your figure files are available below the reviewer comments at the end of this letter. If applicable, we recommend that you deposit your laboratory protocols in protocols.io to enhance the reproducibility of your results. Protocols.io assigns your protocol its own identifier (DOI) so that it can be cited independently in the future. For instructions see: https://journals.plos.org/plosone/s/submission-guidelines#loc-laboratory-protocols https://plos.org/protocols?utm_medium=editorial-email&utm_source=authorletters&utm_campaign=protocols We look forward to receiving your revised manuscript. Kind regards, Ali Haider Mohammed Academic Editor PLOS ONE Journal requirements: When submitting your revision, we need you to address these additional requirements. 1. Please ensure that your manuscript meets PLOS ONE's style requirements, including those for file naming. The PLOS ONE style templates can be found at https://journals.plos.org/plosone/s/file?id=wjVg/PLOSOne_formatting_sample_main_body.pdf  https://journals.plos.org/plosone/s/file?id=ba62/PLOSOne_formatting_sample_title_authors_affiliations.pdf Additional Editor Comments: 1. Limited Diversity in Study Design Across Included Studies While the scoping review is comprehensive, nearly all of the included studies employed cross-sectional designs (98.06%). This methodological homogeneity limits the depth of insight into causality, change over time, or the impact of interventions related to CAM practices. The authors should: More explicitly acknowledge this limitation in the discussion and recommend that future studies explore longitudinal, experimental, or mixed-methods designs to advance the field. Consider stratifying findings by study design type (e.g., observational vs. interventional) to assess whether recommendations differ depending on methodological rigor. 2. Lack of Visual Representation of Thematic Synthesis Although the manuscript notes a thematic synthesis using NVivo, there is no visible presentation of how themes and subthemes were derived (e.g., thematic map, concept framework, or coding tree). Please include a visual figure (e.g., thematic map or framework) showing the analytical process from raw codes to themes. This would enhance transparency and help readers understand how conclusions were drawn from the data. 3. Absence of Quality Assessment or Risk of Bias Appraisal Although scoping reviews typically do not require formal risk of bias assessments, the authors could improve transparency by briefly commenting on the overall methodological quality of included studies (e.g., through a descriptive overview of sample sizes, response rates, or validation processes). Consider discussing whether any quality trends (e.g., lack of validated tools or unreported response rates) might affect the robustness of findings and recommendations. At minimum, justify why quality appraisal was not conducted and explain how this affects interpretation. 4. Inconsistent Handling of Terminology (e.g., \"Middle East\") The use of \"Middle East\" (ME) is not explicitly defined in terms of which countries were included. While a country list appears in the results section, it should be clearly stated earlier (e.g., in the methods or inclusion criteria). Please define the scope of \"Middle East\" explicitly, possibly with reference to WHO or geopolitical classifications. Also, consider adding a supplementary table listing the included studies by country to enhance clarity and transparency. 5. Insufficient Detail on Limitations of Narrative Synthesis The limitations section acknowledges the use of narrative synthesis but does not elaborate on the specific interpretive challenges this presents. The authors should clearly explain the implications of using narrative synthesis for a dataset with heterogeneous study aims, tools, and outcomes. Acknowledge that subjective interpretation could bias the conclusions, even with dual-coding and software support. 6. Underdeveloped Discussion of Impact Factor Trends The manuscript presents an interesting finding on the increasing volume of publications but stagnating journal impact factors. However, this point is underexplored. The discussion would benefit from a more critical interpretation: What does this trend imply about scientific visibility, research quality, or regional research funding? Are papers being published in lower-impact journals due to limited collaboration, lack of interventional studies, or methodological weaknesses? 7. No Explicit Link Between Themes and Policy Recommendations The paper outlines strong thematic categories (opportunities, challenges, recommendations) but stops short of aligning these directly with practical or policy-level interventions. Consider including a concise table that maps each theme (e.g., knowledge gaps, poor regulation) to specific, evidence-based recommendations for policy, education, or clinical practice. [Note: HTML markup is below. Please do not edit.] Reviewers' comments: Reviewer's Responses to Questions  Comments to the Author 1. Is the manuscript technically sound, and do the data support the conclusions? Reviewer #1: Yes ********** 2. Has the statistical analysis been performed appropriately and rigorously? -->?> Reviewer #1: N/A ********** 3. Have the authors made all data underlying the findings in their manuscript fully available??> The PLOS Data policy Reviewer #1: Yes ********** 4. Is the manuscript presented in an intelligible fashion and written in standard English??> Reviewer #1: Yes ********** Reviewer #1: General Comments This manuscript presents a comprehensive scoping review that explores the role of community pharmacists (CPs) in the use of Complementary and Alternative Medicine (CAM) across the Middle East (ME). The topic is timely and relevant, given the widespread use of CAM and the strategic position of pharmacists to guide its use. The manuscript is well-structured, methodologically sound, and offers valuable insights into opportunities, barriers, and recommendations related to CPs and CAM. However, there are areas that need improvement to enhance clarity, coherence, and impact. Strengths Thorough literature search across nine databases and regional sources. Clear thematic synthesis (opportunities, challenges, and recommendations). Adherence to PRISMA-ScR guidelines. Extensive reference list, suggesting strong literature coverage. Major Comments Novelty and Redundancy The discussion acknowledges repeated themes across studies. While this reinforces consistency, the manuscript would benefit from more emphasis on gaps that remain under-explored (e.g., digital health integration, policy implementation success stories). Consider adding a visual or tabular summary highlighting under-researched countries or topics within the region. Methodology Transparency The process of thematic analysis is briefly described, but lacks depth. Clarify how inter-rater reliability was ensured and how themes were validated. The PRISMA flowchart is referenced but missing (\"Error! Reference source not found.\"). Ensure figures and tables are properly inserted and labeled. Presentation of Results The manuscript relies heavily on textual description. Consider condensing parts of the results into summary tables (e.g., summary of challenges per country or per theme). Some statistics are over-detailed (e.g., breakdowns of questionnaire validation); grouping similar categories could improve readability. Language and Style The language is generally academic, but some paragraphs are overly verbose or redundant. Example: lines 377–386 and 439–451 can be condensed without losing meaning. Minor grammatical errors (e.g., \"it is wide use\" should be “its wide use”). Policy and Practice Implications While the recommendations are well-presented, more concrete suggestions for implementation would strengthen the practical value of the review. It is advisable to distinguish between short-term and long-term recommendations for policymakers and educators. Minor Comments Line 50: Consider stating the countries covered rather than just “ME region”. Line 78: “desire to be actively engaged in their health decision-making” – clarify or simplify phrasing. Line 289: Correct “who reporting” to “who reported”. Line 308: Consider rewording for clarity: “restrains their daily practices across several ME countries”. Recommendation Minor Revision This manuscript is a valuable contribution to the field of pharmacy practice and CAM. With minor revisions focusing on clarity, methodological transparency, and result presentation, it can significantly enhance its impact and usefulness to readers and stakeholders. ********** what does this mean? If you choose “no”, your identity will remain anonymous but your review may still be made public. Do you want your identity to be public for this peer review? Privacy Policy Reviewer #1: Yes: ********** [NOTE: If reviewer comments were submitted as an attachment file, they will be attached to this email and accessible via the submission site. Please log into your account, locate the manuscript record, and check for the action link \"View Attachments\". If this link does not appear, there are no attachment files.] While revising your submission, please upload your figure files to the Preflight Analysis and Conversion Engine (PACE) digital diagnostic tool, https://pacev2.apexcovantage.com/ figures@plos.org 10.1371/journal.pone.0332932.r002 Author response to Decision Letter 1 Submission Version 1  29 Jul 2025 Dear Editor and members of the review board, We thank you and the reviewers for the thoughtful and constructive feedback provided on our manuscript. We have carefully revised the manuscript in response to the comments and have addressed each point in detail below. The suggestions greatly contributed to improving the clarity, rigor, and relevance of our work. In the attached file, we provide a point-by-point response outlining the changes made in the revised version. Attachment Submitted filename: Response to Reviewers.docx 10.1371/journal.pone.0332932.r003 Decision Letter 1 Mohammed Ali Haider Academic Editor © 2025 Ali Haider Mohammed 2025 Ali Haider Mohammed https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License Submission Version 1  8 Sep 2025 Role of community pharmacists in the safe and effective use of complementary and alternative medicine in the Middle East: a scoping review PONE-D-25-28161R1 Dear Dr. Mohamad, We’re pleased to inform you that your manuscript has been judged scientifically suitable for publication and will be formally accepted for publication once it meets all outstanding technical requirements. Within one week, you’ll receive an e-mail detailing the required amendments. When these have been addressed, you’ll receive a formal acceptance letter and your manuscript will be scheduled for publication. An invoice will be generated when your article is formally accepted. Please note, if your institution has a publishing partnership with PLOS and your article meets the relevant criteria, all or part of your publication costs will be covered. Please make sure your user information is up-to-date by logging into Editorial Manager at Editorial Manager® billing support If your institution or institutions have a press office, please notify them about your upcoming paper to help maximize its impact. If they’ll be preparing press materials, please inform our press team as soon as possible -- no later than 48 hours after receiving the formal acceptance. Your manuscript will remain under strict press embargo until 2 pm Eastern Time on the date of publication. For more information, please contact onepress@plos.org. Kind regards, Ali Haider Mohammed Academic Editor PLOS ONE Additional Editor Comments (optional): Reviewer #1: Reviewers' comments: Reviewer's Responses to Questions  Comments to the Author Reviewer #1: All comments have been addressed ********** 2. Is the manuscript technically sound, and do the data support the conclusions??> Reviewer #1: Yes ********** 3. Has the statistical analysis been performed appropriately and rigorously? -->?> Reviewer #1: Yes ********** 4. Have the authors made all data underlying the findings in their manuscript fully available??> The PLOS Data policy Reviewer #1: Yes ********** 5. Is the manuscript presented in an intelligible fashion and written in standard English??> Reviewer #1: Yes ********** Reviewer #1: Dear Authors, I greatly appreciate your hard work. All the required amendments were addressed in a very professional way. Regards, ********** what does this mean? If you choose “no”, your identity will remain anonymous but your review may still be made public. Do you want your identity to be public for this peer review? Privacy Policy Reviewer #1: Yes: ********** 10.1371/journal.pone.0332932.r004 Acceptance letter Mohammed Ali Haider Academic Editor © 2025 Ali Haider Mohammed 2025 Ali Haider Mohammed https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License PONE-D-25-28161R1 PLOS ONE Dear Dr. Hijazi, I'm pleased to inform you that your manuscript has been deemed suitable for publication in PLOS ONE. Congratulations! Your manuscript is now being handed over to our production team. At this stage, our production department will prepare your paper for publication. This includes ensuring the following: * All references, tables, and figures are properly cited * All relevant supporting information is included in the manuscript submission, * There are no issues that prevent the paper from being properly typeset You will receive further instructions from the production team, including instructions on how to review your proof when it is ready. Please keep in mind that we are working through a large volume of accepted articles, so please give us a few days to review your paper and let you know the next and final steps. Lastly, if your institution or institutions have a press office, please let them know about your upcoming paper now to help maximize its impact. If they'll be preparing press materials, please inform our press team within the next 48 hours. Your manuscript will remain under strict press embargo until 2 pm Eastern Time on the date of publication. For more information, please contact onepress@plos.org. You will receive an invoice from PLOS for your publication fee after your manuscript has reached the completed accept phase. If you receive an email requesting payment before acceptance or for any other service, this may be a phishing scheme. Learn how to identify phishing emails and protect your accounts at https://explore.plos.org/phishing If we can help with anything else, please email us at customercare@plos.org. Thank you for submitting your work to PLOS ONE and supporting open access. Kind regards, PLOS ONE Editorial Office Staff on behalf of Dr. Ali Haider Mohammed Academic Editor PLOS ONE ",
  "metadata": {
    "Title of this paper": "Acceptance letter",
    "Journal it was published in:": "PLOS One",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469160/"
  }
}