{
  "title": "Paper_759",
  "abstract": "pmc Front Pharmacol Front Pharmacol 1524 frontpharmacol Front. Pharmacol. Frontiers in Pharmacology 1663-9812 Frontiers Media SA PMC12477429 PMC12477429.1 12477429 12477429 41031165 10.3389/fphar.2025.1673427 1673427 1 Pharmacology Original Research Breaking the cancer code: a novel DNA minicircle to disable STAT3 in ovarian cancer cells SKOV3 Vasilescu et al. 10.3389/fphar.2025.1673427 Vasilescu Adina-Gabriela  1 Vasilescu Andrei-Mihai  1 Sima Livia Elena  2 Baran Natalia  3  4 * Szedlacsek Ștefan-Eugen  1 *  1 Department of Enzymology Institute of Biochemistry of the Romanian Academy Bucharest Romania  2 Department of Molecular Biology of the Cell Institute of Biochemistry of the Romanian Academy Bucharest Romania  3 Department of Hematology and Central Hematology Laboratory, Inselspital, Bern University Hospital, University of Bern Bern Switzerland  4 Department of Internal Medicine, University of South Dakota Sioux Falls SD United States  Edited by: Ximena Maria Muresan  Reviewed by: Veronica Andrea Burzio  Hitesh Vasiyani  Franziska Maria Schwarz *Correspondence: Natalia Baran, natalia.baran@insel.ch stefan.szedlacsek@biochim.ro 15 9 2025 2025 16 480654 1673427 25 7 2025 29 8 2025 15 09 2025 30 09 2025 01 10 2025 Copyright © 2025 Vasilescu, Vasilescu, Sima, Baran and Szedlacsek. 2025 Vasilescu, Vasilescu, Sima, Baran and Szedlacsek https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Introduction Ovarian Cancer remains a significant global health concern, with high mortality rates, largely due to late-stage diagnosis and limited treatment options. These extrinsic factors are driven or exacerbated by intrinsic mechanisms such as persistent activation or upregulation of Signal Transducer and Activator of Transcription 3 (STAT3). STAT3 promotes tumor growth, inhibits apoptosis, accelerates angiogenesis and metastasis, facilitates immune evasion, and contributes to chemoresistance. Consequently, STAT3 activation fosters an aggressive ovarian cancer phenotype, contributing to treatment failure, poor prognosis and low survival rates, highlighting the urgent need for novel, safe, effective and affordable STAT3-targeted therapeutic strategies. In this study, we developed a novel double-stranded DNA minicircle (mcDNA) inhibitor, designed to act as a decoy for STAT3, preventing its binding to target gene promoters. Methods Utilizing the SKOV3 ovarian cancer cell line, we evaluated the effects of our inhibitor in vitro Results We demonstrate that anti-STAT3 mcDNA significantly reduces the viability of SKOV3 cells at low nanomolar concentrations, while sparing the control group. The effect observed was dose-dependent. Mechanistically, anti-STAT3 mcDNA induces apoptosis and necrosis in treated cells, also revealing a certain dose-dependency, while also decreasing cell proliferation. Finally, our inhibitor significantly downregulates STAT3-dependent anti-apoptotic genes MCL1 PIM1 Conclusion These findings suggest that anti-STAT3 mcDNA is a promising, effective and specific candidate for targeted STAT3 inhibition in SKOV3 ovarian cancer cells, warranting further validation in ovarian cancer, in vivo STAT3 DNA minicircle ovarian cancer decoy inhibitor apoptosis Inselspital, Universitätsspital Bern 10.13039/100018234 The author(s) declare that financial support was received for the research and/or publication of this article. The authors declare that this research did not receive any specific grant from funding agencies in the public, commercial, or not-for-profit sectors for reagents. The conceptual development of this article was supported in part by a Fulbright Visiting Scholar grant (No. 779/14.06.2022) awarded to Ș-ES. The funder had no involvement in this study. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Translational Pharmacology 1 Introduction Ovarian cancer (OC) is one of the most aggressive gynecological malignancies worldwide, primarily due to its silent growth and rapid progression ( National Cancer Institute, 2025 World Cancer Research Fund, 2025 Silver et al., 2004 Huang et al., 2022 Gao et al., 2021 The JAK/STAT3 pathway is a fundamental signaling cascade activated by cytokines and growth factors that coordinates major cellular processes ( Kiu and Nicholson, 2012 Jatiani et al., 2010 Schindler et al., 2007 Martincuks et al., 2016 Azami et al., 2025 Levy and Lee, 2002 Persistent STAT3 hyperactivation may result from excessive cytokine or growth factor signaling, increased JAK kinase activity, or the loss of STAT3 negative regulatory mechanisms ( Tolomeo and Cascio, 2021 Sonnenblick et al., 2012 Harada et al., 2014 Geiger et al., 2016 Saini et al., 2017 Leslie et al., 2006 Shirogane et al., 1999 Bcl-2, Bcl-xL, survivin, PIM1, or MCL1 Shirogane et al., 1999 Kanda et al., 2004 Yu and Jove, 2004 Tsareva et al., 2007 Furthermore, STAT3 suppresses death receptor signaling pathways, such as Fas, allowing cells to evade apoptosis ( Barré et al., 2007 Pepper et al., 1992 Niu et al., 2002 Given these observations, there is a pressing clinical and scientific need to develop effective STAT3 inhibitors to establish foundational therapeutic strategies. Various molecular approaches have been developed to inhibit STAT3 signaling in cancer. Notably, several studies have focused on designing and synthesizing peptides (such as PY*LKTK) or small molecules (including STATTIC, OPB-31121, C188, or Napabucasin) that target the SH2 or DNA-binding (DBD) domains of STAT3, effectively abrogating its signaling. Yet, these molecules generally exhibit rather limited success in clinical use due to toxic side effects, unsatisfactory pharmacokinetic properties, high levels of nonspecific activity, or limited therapeutic efficacy ( Turkson et al., 2001 Schust et al., 2006 Brambilla et al., 2015 Lewis et al., 2015 Shitara et al., 2019 BCL-2 survivin Glienke et al., 2010 Nucleic acid-based inhibitors targeting STAT3 expression represent another class of therapeutic agents that have been explored. Antisense oligonucleotides, which are short 12–25 nucleotides-long DNA molecules, were designed complementary to STAT3 mRNA in order to disrupt the translation of the STAT3 protein ( Hong et al., 2015 Sun et al., 2015 Han et al., 2013 Crinelli et al., 2002 Liu et al., 2014 By diverting STAT3 binding, these decoys inhibit the expression of downstream anti-apoptotic and pro-survival genes ( Johari et al., 2020 Bcl-xL cyclin D1 Zhang et al., 2007 Sen et al., 2012 Njatcha et al., 2018 Sen et al., 2014 This work demonstrates, for the first time, the generation and application of double-stranded DNA minicircles bearing three GAS-like motifs as inhibitors of STAT3 in vitro Ishiguro et al., 2016 We believe that the advantages of our minicircles include: (i) the presence of 3 GAS-like motifs on the same molecule maximizing the chance of DBD-STAT3 binding; (ii) a closed circular structure, which confers increased stability and resistance to nuclease degradation; (iii) a potentially long half-life when administered in vivo 2 Materials and methods 2.1 Cell culture The human ovarian carcinoma cell line SKOV3 (stored in our laboratory; American Type Culture Collection–ATCC, ref. no. HTB-77) was used for all cell-based experiments. The cells were confirmed to be mycoplasma-free and grown in RPMI 1640 medium (PAN Biotech, with L-Glutamine, Cat no. P04-16500) supplemented with 10% heat-inactivated fetal bovine serum (FBS), MEM Non-Essential Amino-Acids (Gibco, Cat no. 11140–050) and antibiotics (50 IU/mL penicillin and 50 μg/mL streptomycin). Cultures were maintained at 37 °C in a humidified atmosphere with 5% CO 2 2.2 Anti-STAT3 and mock oligonucleotides The 5′ phosphorylated sense and antisense strands of 95 nucleotides, required to produce the anti-STAT3 and mock minicircles, were ordered from GenScript Biotech (Netherlands). The sequences of the anti-STAT3 strands were designed to contain three equally spaced GAS-like motifs (in bold): 5′ GGG​CGC​ATA​TTC​GGA​CGG​A TT​CCC​GTA​A TTC​CCG​TAA T​TCC​CGT​AA TTA​CGG​GAA T​TAC​GGG​AA TT​ACG​GGA​A TA​GCC​TTA​A T​AGC​CTT​AA ​TTA​AGG​CTA T​TAA​GGC​TA TT​AAG​GCT​A 2.3 Double-helical complex splint-assisted enzymatic cyclization of oligonucleotides Each oligo and its corresponding splint (1 µM oligo:3 µM splint) were combined in nuclease-free water to a final solution volume of 1 mL and T4 DNA Ligase Reaction Buffer (NEB, final concentrations 50 mM Tris-HCl pH 7.5, 10 mM MgCl2, 1 mM ATP, 10 mM Dithiothreitol–DTT). To ensure the efficiency of the reaction and to avoid linear ligation, which results in unwanted multimer formation, the oligonucleotides utilized were very diluted in the ligation reaction. The mixture was incubated in a thermoblock at 90 °C for 10 min with inversion every 2 min, then allowed to slowly cool down to room temperature (RT, 25 °C) to facilitate annealing. Subsequently, DTT (Promega; Cat no V3155) was added to a final concentration of 10 mM, ATP (NEB; Cat no P0756L) to a final concentration of 100 μM and 3 U/µL of Hi-T4™ DNA Ligase (NEB, Cat no M2622S) to a final volume of 1 mL. The ligation reaction was incubated at RT for 16 h to achieve circularization. 2.4 Isolation of circular single-stranded molecules, annealing and enzymatic verification Following the ligation incubation, T4 DNA Ligase was inactivated at 65 °C for 10 min, then the samples were immediately placed on ice. The reaction volume was reduced using a speed vacuum concentrator, and the DNA was mixed with 6X Loading Dye Purple (NEB; Cat no B7024S). The samples were subjected to electrophoresis and run on a 3.5% agarose gel at 55V for 1 h and 30 min. DNA bands corresponding to the single-stranded minicircles were excised and purified using Zymoclean Gel DNA Recovery Kit (Zymo Research, Cat no D4001T). The concentration and the purity of the recovered DNA were determined with a NanoDrop™ 2000 (Thermo Scientific). The purified single-stranded circles, the precursors to the anti-STAT3 mcDNA, were annealed to form double-stranded minicircles. Annealing was performed in buffer containing 10 mM Tris-HCl (pH 8.0), 50 mM NaCl, and 1 mM MgCl 2 2.5 Determination of anti-STAT3 mcDNA interaction with STAT3 protein through electrophoretic mobility shift assay (EMSA) Professor Eyal Arbely from the Department of Chemistry, Ben-Gurion University of the Negev, Beer-Sheva 8410501, Israel, kindly provided a plasmid encoding STAT3, which was used in our lab to obtain the STAT3 protein, as previously described ( Belo et al., 2019 2.6 Transfection of anti-STAT3 and mock mcDNA molecules Transfection was performed using Lipofectamine™ 3000 Transfection Reagent (Invitrogen, Cat no L3000001). One day prior to transfection, SKOV3 cells were seeded to achieve 70%–90% confluence at the time of transfection. Cells were transfected with either anti-STAT3 mcDNA or mock mcDNA using a DNA (µg) to Lipofectamine 3000 (µL) ratio of 1:1. Six hours post-transfection, the culture medium was replaced with fresh complete RPMI medium without antibiotics. The cells were incubated for 48 h post-transfection. The concentrations of anti-STAT3 mcDNA and mock mcDNA used for the MTS assay were 0 nM, 1.56 nM, 3.12 nM, 6.25 nM, 12.5 nM, 25 nM, 50 nM, and 100 nM. For flow cytometry analysis, transfection concentrations of 5 nM, 10 nM, and 20 nM were employed. For RT-qPCR and Western blot experiments, a concentration of 10 nM was used. 2.7 MTS assay Cell viability was assessed using the CellTiter 96 ® 2.8 Flow cytometry analysis for transfection efficiency We performed transient transfection using either Polyethylenimine (PEI; Merck, Cat no 408727) or Lipofectamine™ 3000 Transfection Reagent. One day prior to transfection, SKOV3 cells were seeded 1 × 10 5 per To determine transfection efficiency, cells were washed with PBS, trypsinized, and collected by centrifugation at 1500 rpm for 5 min at 4 °C. Pelleted cells were resuspended in FACS buffer (2% FBS in PBS) and counted, then adjusted to a final density of 1 × 10 6 2.9 Apoptosis evaluation through flow cytometry At 48 h post-transfection, cells were washed with cold PBS, collected into FACS tubes, and centrifuged at 1500 rpm for 5 min at 4 °C. Cell pellets were resuspended in Annexin buffer (10 mM HEPES pH 7.4, 2.5 mM CaCl 2 6 per Kotecha et al., 2010 2.10 RT-qPCR assay Total RNA was extracted using the RNeasy kit (QIAGEN, Cat no 74104). RNA concentration and quality were determined with a NanoDrop™ 2000 spectrophotometer. Reverse transcription was performed with 1 µg of RNA using the Maxima First Strand cDNA Synthesis Kit for RT-qPCR with dsDNase (Thermo Scientific; Cat no K1641), following the manufacturer’s instructions for incubation times and temperatures. Quantitative PCR (qPCR) was carried out using 1 µL of cDNA with gene-specific primers and the SensiFAST™ SYBR ® MCL1 PIM1 GAPDH Supplementary Table S1 Warton et al., 2004 2.11 Western blot analysis SKOV3 cells were lysed directly in RIPA buffer supplemented with protease and phosphatase inhibitors (cOmplete™ EDTA-free Protease Inhibitor Cocktail, Roche, Cat no 4693132001), 1 mM sodium orthovanadate, 1 mM Phenylmethylsulfonyl fluoride (PMSF), and 5 mM iodoacetic acid. Lysates were incubated at 4 °C with gentle shaking for 40 min, then centrifuged at 20,000 x g for 40 min at 4 °C. The supernatant was collected, and protein concentrations were determined using the Pierce™ BCA Protein Assay Kit (Thermo Fisher; Cat no 23225). Absorbance was measured at 562 nm after a 30-min of incubation at 37 °C using a FLUOstar Omega plate reader (BMG Labtech), with lysis buffer as the blank. Equal amounts of protein were mixed with Laemmli sample buffer, boiled for 5 min at 95 °C, and separated by SDS-PAGE on either in-house prepared Tris-glycine or precast gels (Bio-Rad). Proteins were transferred in a wet system to PVDF membranes for 1 h and 30 min at 300 mA, and then blocked in 5% non-fat milk in Tris-buffered saline-Tween (TBS-T) solution for 1 h, at RT. Membranes were incubated overnight at 4 °C with primary antibodies: anti-STAT3, mouse monoclonal (BioLegend, Cat no 678001), anti-phospho-STAT3 (Tyr705), mouse monoclonal (BioLegend, Cat no 651001), anti-GAPDH, mouse monoclonal (BioLegend, Cat no 649201), anti-Ki-67, mouse monoclonal (BioLegend, Cat no 350501), anti-cleaved caspase 3, rabbit monoclonal (Cell Signaling, Cat no 9661S), anti-Mcl-1, rabbit monoclonal (Cell Signaling, Cat no 5453T), anti-alpha Tubulin, rabbit polyclonal (Abcam, Cat no ab15246) and anti-Pim-1, rabbit monoclonal (Cell Signaling, Cat no 3247T). Antibody dilutions were 1:1000, except for anti-α Tubulin at 1:8000, following manufacturers’ instructions. After three washes with TBS-T (5 min each), membranes were incubated with the horseradish peroxidase (HRP)-conjugated secondary antibodies: HRP-goat anti-mouse polyclonal antibody (BioLegend, Cat no 405306) and HRP-mouse anti-rabbit polyclonal antibody (Invitrogen, Cat no 61–6520), at a dilution of 1:4000 each, for 1 h, at RT. All the antibodies were diluted in the blocking solution. Subsequently, membranes were washed three times with TBS-T (10 min each), then developed with either Immobilon ® 2.12 Data analysis and statistics All experiments were performed independently in triplicate ( n t p 50 Abramson et al., 2024 3 Results 3.1 Design of minicircles and the principle of circularization In this study, we utilized linear 5′-phosphorylated DNA molecules of 95 nucleotides in length, each containing three equidistant GAS-like sequences. First, two single-stranded complementary oligonucleotides were circularized separately using the “Double-helical complex splint-assisted enzymatic cyclization of oligonucleotides with T4 DNA ligase” method ( Diegelman and Kool, 2000 Figure 1 FIGURE 1 Schematic overview of the process for circularizing oligonucleotides via the splint-assisted enzymatic ligation method. The annealing of two complementary single-stranded circles results in the formation of mcDNA molecules. The SmaI restriction site is used to verify successful circularization, while EcoRV digestion confirms the double-stranded status of the minicircles. Diagram showing the annealing and ligation of an oligonucleotide with a splint, leading to circular DNA formation with GAS-like motifs. It features SmaI and EcoRV restriction sites. Two circles labeled A and B anneal to form AB, incorporating restriction sites. 3.2 Development and validation of DNA minicircles To obtain the double-stranded anti-STAT3 and mock minicircles, we circularized the corresponding oligonucleotides using specific splints, establishing a unique SmaI restriction site at the ligation point within the newly formed double-stranded region (oligonucleotide plus splint). Upon annealing, the complementary single-stranded circles form a final molecule where, on the opposite side of the SmaI site, a unique EcoRV restriction site is generated. Thus, the SmaI site confirms circularization, while the EcoRV site verifies the complete annealing of the two complementary single-stranded circles. As shown in Figure 2 FIGURE 2 Agarose gel electrophoresis of anti-STAT3 mcDNA. Lane 1: ligation product of single-stranded minicircle A; Lane 2: ligation product of the complementary single-stranded minicircle B; Lane 3: Quick-Load ® Gel electrophoresis image showing DNA bands in lanes labeled 1 to 10. A DNA ladder in lane 3 marks sizes from 100 to 300 base pairs. Bands near 95 nucleotides are indicated with an arrow. The result of the enzymatic circularization and ligation reaction present in lanes 1 and 2 of Figure 2 Figure 2 SmaI EcoRV Supplementary Figure S1 3.3 Anti-STAT3 mcDNA specifically binds STAT3 protein To assess the capability of the anti-STAT3 mcDNA to be recognized by and interact with the STAT3 protein, we performed an EMSA assay utilizing various molar ratios of DNA:protein. Figure 3 FIGURE 3 Agarose gel showing the interaction between the anti-STAT3 mcDNA and STAT3 protein in an EMSA assay. Binding was performed in varying minicircle:STAT3 protein molar ratios. Lane 1: mock mcDNA, without protein; Lane 2: mock mcDNA:STAT3 in a ratio of 1:3; Lane 3: mock mcDNA:STAT3 in a ratio of 1:4; Lane 4: anti-STAT3 mcDNA, without protein; Lane 5: anti-STAT3 mcDNA:STAT3 in a ratio of 1:0.75; Lane 6: anti-STAT3 mcDNA:STAT3 in a ratio of 1:1.5; Lane 7: anti-STAT3 mcDNA:STAT3 in a ratio of 1:2; Lane 8: anti-STAT3 mcDNA:STAT3 in a ratio of 1:3; Lane 9: anti-STAT3 mcDNA:STAT3 in a ratio of 1:4; Lane 10: empty; Lane 11: Quick-Load ® Gel electrophoresis image showing eleven lanes. Lanes one to five contain bright bands of free mcDNA near the bottom. Lanes six to ten show partial binding with smeared bands. Lane eleven contains a DNA ladder with multiple bands. Arrows indicate \"Free mcDNA\" on the lower left and \"Bound mcDNA\" on the right. 3.4 Anti-STAT3 mcDNA reduces the viability of SKOV3 ovarian cancer cells To evaluate the transfectability of the SKOV3 ovarian cancer cell line and to identify the transfection reagent with the highest transfection efficiency, we transfected SKOV3 cells with a GFP-expressing plasmid using various DNA-to-reagent ratios for Lipofectamine 3000 and PEI, respectively. Supplementary Figure S2 Supplementary Figure S2A Supplementary Figure S2B As we observed a high transfection rate for SKOV3 cells utilizing Lipofectamine 3000, we proceeded to assess the effect of anti-STAT3 mcDNA on cell viability. SKOV3 cells were transfected with anti-STAT3 minicircle or mock minicircle at the concentrations: 1.56 nM, 3.12 nM, 6.25 nM, 12.5 nM, 25 nM, 50 nM and 100 nM in technical triplicate. Lipofectamine-only transfection mixes corresponding to 25 nM, 50 nM and 100 nM compound were used as the technical negative controls. The technical positive control was a 15-min treatment with Triton X-100 0.02%. After 48 h, cell viability was assessed using the MTS assay. As shown in Figure 4A 50 Figure 4B 50 FIGURE 4 The inhibitory effect of anti-STAT3 mcDNA on SKOV3 ovarian carcinoma cells, assessed by the MTS assay. (A) (B) p p p p n (A) Line graph showing cell viability percentage against log concentration in nanomolars, comparing anti-STAT3 mcDNA (red) and mock mcDNA (black). The IC50 is 13.48 nanomolars. (B) Bar graph illustrating cell viability across treatments: untreated, Lipofectamine and anti-STAT3 mcDNA at varying concentrations, with significance indicated by asterisks. 3.5 Inhibition of STAT3 activity by anti-STAT3 mcDNA induces apoptosis and necrosis in representative ovarian cancer cells Given the very promising and specific SKOV3 viability reduction that we observed for anti-STAT3 mcDNA in the MTS assay, we proceeded to evaluate the underlying effects of our compound on apoptosis and necrosis in these representative ovarian cancer cells. SKOV3 cells were transfected with three concentrations of anti-STAT3 mcDNA (5 nM, 10 nM and 20 nM) and compared to the mock control. Forty-eight hours post-transfection with anti-STAT3 mcDNA, flow cytometry revealed a dose-dependent increase in apoptosis and necrosis ( Figure 5 Figure 5B Figure 5A + − + + Figure 5B FIGURE 5 Effect of anti-STAT3 mcDNA on apoptosis and necrosis in SKOV3 OC cells. (A) (B) + − + + n Flow cytometry analysis with two panels. Panel A shows three scatter plots: ungated, singlets gated, and apoptosis gated. Panel B presents scatter plots of treated and untreated cells showing Annexin V and Propidium Iodide staining: anti-STAT3 mcDNA, mock mcDNA at 5, 10, and 20 nM, untreated, Lipofectamine 3000, Triton X-100, and CisPlatin-treated cells. Blue quadrants indicate different cell populations and percentages. Increasing the concentration to 10 nM further increased apoptosis and necrosis, with effects plateauing at higher concentrations. These findings demonstrate that anti-STAT3 mcDNA promotes apoptosis and necrosis in SKOV3 cells in a dose-dependent manner within the 0–10 nM range. 3.6 Anti-STAT3 mcDNA treatment decreases proliferation of SKOV3 To further evaluate the effects of anti-STAT3 mcDNA on SKOV3 OC cells, we determined the levels of STAT3, phosphoTyr705-STAT3 (p-STAT3), Ki-67 and cleaved caspase-3 by Western blot analysis of total cell lysates after treatment with 10 nM of anti-STAT3 mcDNA and mock mcDNA (experimental negative control). The STAT3 protein expression in cells treated with anti-STAT3 mcDNA was slightly lower than in cells treated with Lipofectamine alone (technical negative control), or mock mcDNA ( Figure 6 FIGURE 6 Western blot analysis of SKOV3 cell lysates. (A) (B) t p p p n Panel A shows a Western blot analysis for proteins Ki-67, STAT3, phosphorylated STAT3 (Tyr705), Cleaved Caspase 3, and GAPDH across different conditions: Lipofectamine, anti-STAT3 mcDNA, and mock mcDNA. Panel B presents a bar graph depicting relative expression levels for STAT3, p-STAT3, and Ki-67 under the same conditions, with statistical significance marked by asterisks. 3.7 Inhibition of STAT3 reduces anti-apoptotic and pro-survival gene expression To assess the impact of STAT3 inhibition on the expression of downstream target genes as a possible cause for the treated cell phenotypes observed in MTS and flow cytometry, we performed RT-qPCR analysis of MCL1 PIM1 Figure 7A MCL1 p PIM1 p FIGURE 7 Effects of anti-STAT3 mcDNA treatment on downstream targets. (A) MCL1 PIM1 GAPDH t n (B) (C) t p p p p n Graphical representation of experimental data showing gene and protein expression levels. Panel A presents a bar graph comparing relative gene expression percentages of MCL1 and PIM1, with higher expression in mock mcDNA samples compared to anti-STAT3 mcDNA. Panel B displays Western blot images for Mcl-1, GAPDH, Alpha Tubulin, and Pim-1 proteins, with labeled molecular weights. Panel C shows another bar graph indicating relative expression levels of Mcl-1, comparing anti-STAT3 mcDNA, mock mcDNA, and Lipofectamine conditions. Statistical significance is marked with asterisks. Furthermore, we also assessed the protein levels of Mcl-1 and Pim-1 by Western blot in SKOV3 cells. Mcl-1 protein expression was significantly reduced (over 2-fold) in anti-STAT3 mcDNA-treated cells, compared to mock mcDNA (experimental negative control) ( Figures 7B,C These findings, together with the RT-qPCR results, suggest that anti-STAT3 mcDNA effectively reduces the expression of STAT3 target genes, contributing to decreased survival and proliferation of SKOV3 ovarian cancer cells. 4 Discussion STAT3 is an essential transcription factor involved in regulating numerous genes controlling critical cellular processes, including cell growth, survival, proliferation, immune response and stemness ( Levy and Lee, 2002 Hu et al., 2024 Several strategies have been developed over time to inhibit STAT3 expression or activity. One such strategy is the use of small molecules that inhibit STAT3 signaling through binding its SH2 or DBD domain, like STATTIC or Napabucasin. However, in the clinical setting, they displayed non-specific activity and high toxicity, or their effects were not highly significant, as the patient sample size was too low, which drastically reduce their relevance as therapeutics ( Schust et al., 2006 Shitara et al., 2019 Nair et al., 2023 Sun et al., 2015 Han et al., 2013 Crinelli et al., 2002 Liu et al., 2014 Sen et al., 2012 Sen et al., 2014 This study highlights the potential of targeting STAT3 activity in SKOV3 OC cells using a novel double-stranded DNA circular molecule designed to specifically bind the DBD of STAT3. The anti-STAT3 minicircle contains three equally spaced GAS-like motifs, increasing the likelihood of interaction with STAT3 and achieving targeted inhibition. The anti-STAT3 mcDNA we developed may offer improved target selectivity for inhibiting the STAT3 signaling pathway with minimal off-target effects compared to small-molecule or JAK2 inhibitors ( Schust et al., 2006 Shitara et al., 2019 Nair et al., 2023 in vitro in vivo Sun et al., 2015 Han et al., 2013 Casas et al., 2022 Sen et al., 2014 We selected the GAS-like sequence 5′ TTCCCGTAA 3′ due to its status as a consensus sequence with high affinity for STAT3 ( Yang et al., 2003 Supplementary Figure S3 Figure 2 Supplementary Figure S1 Diegelman and Kool, 2000 A valuable study by Casas et al. (2022) in vivo The SKOV3 ovarian cancer cell line, characterized by the fifth highest level of STAT3 expression ( The Human Protein Atlas, 2025 Sun et al., 2008 Our functional assays revealed that the anti-STAT3 mcDNA, 48 h post-transfection, has a promising IC 50 Sen et al., 2012 50 Casas et al., 2022 Casas et al., 2022 Flow cytometry demonstrated that treatment with anti-STAT3 mcDNA induced apoptosis and necrosis across all tested concentrations (5, 10, and 20 nM), effects that were absent in cells treated with mock mcDNA. These results demonstrated the specificity of minicircles in targeting the STAT3 protein thanks to the presence of GAS-like motifs. The similar effect between 10 nM and 20 nM anti-STAT3 mcDNA treatment, in the absence of any toxic effect from Lipofectamine, could be explained by the saturation of cells upon transfection. Our results are also supported by a previous study in which a very similar apoptosis and necrosis effect was obtained, utilizing DNA minicircles ( Casas et al., 2022 Western blot further confirmed the obtained results: cleaved caspase-3, a hallmark of both the intrinsic and extrinsic apoptosis pathways, was detected only in anti-STAT3-treated cells, while the levels of proliferation marker Ki-67 were significantly reduced, compared to mock-treated cells, indicating suppressed cell cycle progression ( Eskandari and Eaves, 2022 Sun and Kaufman, 2018 Ichiba et al., 1998 MCL1 PIM1 MCL1 PIM1 This work provides an initial proof-of-concept for a novel circular DNA-based inhibitor that effectively impairs cell growth and survival in vitro in vivo To move towards translational studies, delivery strategies such as solid lipid nanoparticles (SLN) can be employed. The advantages of using SLNs over other lipid emulsions, such as liposomes, as carriers of the active minicircles are: protection and stability for the encapsulated drug, the ability to control the drug release in vivo Akanda et al., 2023 He et al., 2025 Akanda et al., 2023 In a future study, we plan to test the compound on additional ovarian cancer cell lines with diverse genetic backgrounds, followed by evaluation of its stability and efficacy in xenograft mouse models. These investigations will be essential to assess translational potential and to explore the feasibility of advancing this approach toward clinical application in ovarian cancer. In conclusion, the unique structural features of our anti-STAT3 mcDNA - including the presence of three GAS-like motifs, its circular and double-stranded configuration and its chemical simplicity - confer enhanced specificity, increased probability of interaction with the target, high stability, increased nuclease resistance and cost-effective production, including via bacterial cloning. These attributes position anti-STAT3 mcDNA as a promising future therapeutic candidate for downregulation of STAT3 activity. Our findings support further development toward preclinical validation and, ultimately, clinical application of this technology, not only in ovarian cancer but also in other STAT3-driven malignancies. Given these strengths, anti-STAT3 mcDNA may represent a potentially effective therapeutic approach for modulating STAT3 activity in cancer. We are grateful to Professor Eyal Arbely from the Department of Chemistry, Ben-Gurion University of the Negev, Beer-Sheva 8410501, Israel, who kindly provided the STAT3 plasmid. We would like to thank our colleagues from the Enzymology Department at the Institute of Biochemistry of the Romanian Academy (IBRA): Otilia-Cristina Donțu for logistical and technical support and Cătălin-Constantin Bica and Andra Elena Coşoreanu-Șulea for assistance with the experiments. We also extend our gratitude to Ioana Monica Tudor and Sorina-Andreea Anghel from the Department of Molecular Biology of the Cell, from the IBRA, for their help with the experimental work. Our thanks also go to the Viral Glycoproteins Department from the IBRA for providing the Lipofectamine 3000 reagent and the anti-alpha Tubulin antibody. Data availability statement The original contributions presented in the study are included in the article/ Supplementary Material Ethics statement Ethical approval was not required for the studies on humans in accordance with the local legislation and institutional requirements because only commercially available established cell lines were used. Author contributions A-GV: Conceptualization, Formal Analysis, Investigation, Methodology, Validation, Visualization, Writing – original draft, Writing – review and editing. A-MV: Investigation, Methodology, Validation, Writing – review and editing. LS: Investigation, Methodology, Writing – review and editing. NB: Supervision, Writing – review and editing. Ș-ES: Conceptualization, Project administration, Supervision, Writing – review and editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fphar.2025.1673427/full#supplementary-material Abbreviations STAT3, Signal Transducer and Activator of Transcription 3; JAK, Janus kinase; mcDNA, minicircle DNA; OC, ovarian cancer; PEI, polyethylenimine. References Abramson J. Adler J. Dunger J. Evans R. Green T. Pritzel A. 2024 Accurate structure prediction of biomolecular interactions with AlphaFold 3 Nature 630 8016 493 500 10.1038/s41586-024-07487-w 38718835 PMC11168924 Akanda M. Mithu M. S. H. Douroumis D. 2023 Solid lipid nanoparticles: an effective lipid-based technology for cancer treatment J. Drug Deliv. Sci. Technol. 86 104709 10.1016/j.jddst.2023.104709 Azami T. Theeuwes B. Nu Ton M. L. Mansfield W. Harland L. Kinoshita M. 2025 STAT3 signaling enhances tissue expansion during postimplantation mouse development Cell Rep. 44 4 115506 10.1016/j.celrep.2025.115506 40188437 Barré B. Vigneron A. Perkins N. Roninson I. B. Gamelin E. Coqueret O. 2007 The STAT3 oncogene as a predictive marker of drug resistance Trends Mol. Med. 13 1 4 11 10.1016/j.molmed.2006.11.001 17118707 Belo Y. Mielko Z. Nudelman H. Afek A. Ben-David O. Shahar A. 2019 Unexpected implications of STAT3 acetylation revealed by genetic encoding of acetyl-lysine Biochim. Biophys. Acta Gen. Subj. 1863 9 1343 1350 10.1016/j.bbagen.2019.05.019 31170499 PMC6625855 Brambilla L. Genini D. Laurini E. Merulla J. Perez L. Fermeglia M. 2015 Hitting the right spot: mechanism of action of OPB-31121, a novel and potent inhibitor of the signal transducer and activator of transcription 3 (STAT3) Mol. Oncol. 9 6 1194 1206 10.1016/j.molonc.2015.02.012 25777967 PMC5528765 Casas G. Perche F. Midoux P. Pichon C. Malinge J. M. 2022 DNA minicircles as novel STAT3 decoy oligodeoxynucleotides endowed with anticancer activity in triple-negative breast cancer Mol. Ther. Nucleic Acids 29 162 175 10.1016/j.omtn.2022.06.012 35847174 PMC9263874 Crinelli R. Bianchi M. Gentilini L. Magnani M. 2002 Design and characterization of decoy oligonucleotides containing locked nucleic acids Nucleic Acids Res. 30 11 2435 2443 10.1093/nar/30.11.2435 12034831 PMC117200 Diegelman A. M. Kool E. T. 2000 Chemical and enzymatic methods for preparing circular single‐stranded DNAs Curr. Protoc. Nucleic Acid. Chem. 5 10.1002/0471142700.nc0502s00 18428858 Eskandari E. Eaves C. J. 2022 Paradoxical roles of caspase-3 in regulating cell survival, proliferation, and tumorigenesis J. Cell Biol. 221 6 e202201159 10.1083/jcb.202201159 35551578 PMC9106709 Gao S. Zhang W. Yan N. Li M. Mu X. Yin H. 2021 The impact of STAT3 and phospho-STAT3 expression on the prognosis and clinicopathology of ovarian cancer: a systematic review and meta-analysis J. Ovarian Res. 14 1 164 18 10.1186/s13048-021-00918-6 34789292 PMC8600722 Geiger J. L. Grandis J. R. Bauman J. E. 2016 The STAT3 pathway as a therapeutic target in head and neck cancer: barriers and innovations Oral Oncol. 56 84 92 10.1016/j.oraloncology.2015.11.022 26733183 PMC5590227 Glienke W. Maute L. Wicht J. Bergmann L. 2010 Curcumin inhibits constitutive STAT3 phosphorylation in human pancreatic cancer cell lines and downregulation of Survivin/BIRC5 gene expression Cancer Invest 28 2 166 171 10.3109/07357900903287006 20121547 Han Z. Feng J. Hong Z. Chen L. Li W. Liao S. 2013 Silencing of the STAT3 signaling pathway reverses the inherent and induced chemoresistance of human ovarian cancer cells Biochem. Biophys. Res. Commun. 435 2 188 194 10.1016/j.bbrc.2013.04.087 23665025 Harada D. Takigawa N. Kiura K. 2014 The role of STAT3 in non-small cell lung cancer Cancers 6 2 708 722 10.3390/cancers6020708 24675568 PMC4074799 He W. Li H. Sun W. Zhang Y. Wu D. Ao C. 2025 B7–H3 and c-MET in advanced prostate cancer: exploring possibilities of novel bi-specific drug development Eur. J. Med. Res. 30 1 467 10.1186/s40001-025-02729-7 40490821 PMC12147274 Hong D. Kurzrock R. Kim Y. Woessner R. Younes A. Nemunaitis J. 2015 AZD9150, a next-generation antisense oligonucleotide inhibitor of STAT3 with early evidence of clinical activity in lymphoma and lung cancer Sci. Transl. Med. 7 314 314ra185 10.1126/scitranslmed.aac5272 26582900 PMC5279222 Hu Y. Dong Z. Liu K. 2024 Unraveling the complexity of STAT3 in cancer: molecular understanding and drug discovery J. Exp. & Clin. Cancer Res. 43 1 23 29 10.1186/s13046-024-02949-5 38245798 PMC10799433 Huang B. Lang X. Li X. 2022 The role of IL-6/JAK2/STAT3 signaling pathway in cancers Front. Oncol. 12 1023177 10.3389/fonc.2022.1023177 36591515 PMC9800921 Ichiba M. Nakajima K. Yamanaka Y. Kiuchi N. Hirano T. 1998 Autoregulation of the Stat3 gene through cooperation with a cAMP- responsive element-binding protein J. Biol. Chem. 273 11 6132 6138 10.1074/jbc.273.11.6132 9497331 Ishiguro K. Zhu Y. L. Lin Z. P. Penketh P. G. Shyam K. Zhu R. 2016 Cataloging antineoplastic agents according to their effectiveness against platinum-resistant and platinum-sensitive ovarian carcinoma cell lines J. Transl. Sci. 2 2 117 124 10.15761/JTS.1000127 27076919 PMC4827869 Jatiani S. S. Baker S. J. Silverman L. R. Premkumar Reddy E. 2010 JAK/STAT pathways in cytokine signaling and myeloproliferative disorders: approaches for targeted therapies Genes Cancer 1 10 979 993 10.1177/1947601910397187 21442038 PMC3063998 Johari B. Rahmati M. Nasehi L. Mortazavi Y. Faghfoori M. H. Rezaeejam H. 2020 Evaluation of STAT3 decoy oligodeoxynucleotides’ synergistic effects on radiation And/or chemotherapy in metastatic breast cancer cell line Cell Biol. Int. 44 12 2499 2511 10.1002/cbin.11456 32841450 Kanda N. Seno H. Konda Y. Marusawa H. Kanai M. Nakajima T. 2004 STAT3 is constitutively activated and supports cell survival in association with survivin expression in gastric cancer cells Oncogene 23 28 4921 4929 10.1038/sj.onc.1207606 15077160 Kiu H. Nicholson S. E. 2012 Biology and significance of the JAK/STAT signalling pathways Growth factors 30 2 88 106 10.3109/08977194.2012.660936 22339650 PMC3762697 Kotecha N. Krutzik P. O. Irish J. M. 2010 Web-based analysis and publication of flow cytometry experiments Curr. Protoc. Cytom. 10 Suppl. 53 10.1002/0471142956.cy1017s53 20578106 PMC4208272 Leslie K. Lang C. Devgan G. Azare J. Berishaj M. Gerald W. 2006 Cyclin D1 is transcriptionally regulated by and required for transformation by activated signal transducer and activator of transcription 3 Cancer Res. 66 5 2544 2552 10.1158/0008-5472.CAN-05-2203 16510571 Levy D. E. Lee C. kuo 2002 What does Stat3 do? J. Clin. Investigation 109 9 1143 1148 10.1172/JCI15650 11994402 PMC150972 Lewis K. M. Bharadwaj U. Eckols T. K. Kolosov M. Kasembeli M. M. Fridley C. 2015 Small-molecule targeting of signal transducer and activator of transcription (STAT) 3 to treat non-small cell lung cancer Lung Cancer 90 2 182 190 10.1016/j.lungcan.2015.09.014 26410177 PMC4619129 Liu M. Wang F. Wen Z. Shi M. Zhang H. 2014 Blockage of STAT3 signaling pathway with a decoy oligodeoxynucleotide inhibits growth of human ovarian cancer cells Cancer Invest. 32 1 8 12 10.3109/07357907.2013.861471 24328557 Martincuks A. Fahrenkamp D. Haan S. Herrmann A. Küster A. Müller-Newen G. 2016 Dissecting functions of the N-terminal domain and GAS-Site recognition in STAT3 nuclear trafficking Cell Signal 28 8 810 825 10.1016/j.cellsig.2016.03.011 27040695 Nair P. C. Piehler J. Tvorogov D. Ross D. M. Lopez A. F. Gotlib J. 2023 Next-generation JAK2 inhibitors for the treatment of myeloproliferative neoplasms: lessons from structure-based drug discovery approaches American Association for Cancer Research Inc. 4 352 364 10.1158/2643-3230.BCD-22-0189 PMC10472187 37498362 National Cancer Institute 2025 Ovarian cancer — cancer stat facts NIH Available online at: https://seer.cancer.gov/statfacts/html/ovary.html Niu G. Wright K. L. Huang M. Song L. Haura E. Turkson J. 2002 Constitutive Stat3 activity up-regulates VEGF expression and tumor angiogenesis Oncogene 21 13 2000 2008 10.1038/sj.onc.1205260 11960372 Njatcha C. Farooqui M. Kornberg A. Johnson D. E. Grandis J. R. Siegfried J. M. 2018 STAT3 cyclic decoy demonstrates robust antitumor effects in non–small cell lung cancer Mol. Cancer Ther. 17 9 1917 1926 10.1158/1535-7163.MCT-17-1194 29891486 PMC6125196 Pepper M. S. Ferrara N. Orci L. Montesano R. 1992 Potent synergism between vascular endothelial growth factor and basic fibroblast growth factor in the induction of angiogenesis in vitro Biochem. Biophys. Res. Commun. 189 2 824 831 10.1016/0006-291x(92)92277-5 1281999 Saini U. Naidu S. Elnaggar A. C. Bid H. K. Wallbillich J. J. Bixel K. 2017 Elevated STAT3 expression in ovarian cancer ascites promotes invasion and metastasis: a potential therapeutic target Oncogene 36 2 168 181 10.1038/onc.2016.197 27292260 PMC5338638 Schindler C. Levy D. E. Decker T. 2007 JAK-STAT signaling: from interferons to cytokines J. Biol. Chem. 282 28 20059 20063 10.1074/jbc.R700016200 17502367 Schust J. Sperl B. Hollis A. Mayer T. U. Berg T. 2006 Stattic: a small-molecule inhibitor of STAT3 activation and dimerization Chem. Biol. 13 11 1235 1242 10.1016/j.chembiol.2006.09.018 17114005 Sen M. Thomas S. M. Kim S. Yeh J. I. Ferris R. L. Johnson J. T. 2012 First-in-human trial of a STAT3 decoy oligonucleotide in head and neck tumors: implications for cancer therapy Cancer Discov. 2 8 694 705 10.1158/2159-8290.CD-12-0191 22719020 PMC3668699 Sen M. Paul K. Freilino M. L. Li H. Li C. Johnson D. E. 2014 Systemic administration of a cyclic signal transducer and activator of transcription 3 (STAT3) decoy oligonucleotide inhibits tumor growth without inducing toxicological effects Mol. Med. 20 1 46 56 10.2119/molmed.2013.00104 24395569 PMC3951464 Shirogane T. Fukada T. Muller J. M. M. Shima D. T. Hibi M. Hirano T. 1999 Synergistic roles for Pim-1 and c-Myc in STAT3-mediated cell cycle progression and antiapoptosis Immunity 11 6 709 719 10.1016/s1074-7613(00)80145-4 10626893 Shitara K. Yodo Y. Iino S. 2019 A phase I study of napabucasin plus paclitaxel for Japanese patients with advanced/recurrent gastric cancer Vivo (Brooklyn) 33 3 933 937 10.21873/invivo.11561 31028219 PMC6559899 Silver D. L. Naora H. Liu J. Cheng W. Montell D. J. 2004 Activated signal transducer and activator of transcription (STAT) 3: localization in focal adhesions and function in ovarian cancer cell motility Cancer Res. 64 10 3550 3558 10.1158/0008-5472.CAN-03-3959 15150111 Sonnenblick A. Shriki A. Galun E. Axelrod J. H. Daum H. Rottenberg Y. 2012 Tissue microarray-based study of patients with lymph node-positive breast cancer shows tyrosine phosphorylation of signal transducer and activator of transcription 3 (tyrosine705-STAT3) is a marker of good prognosis Clin. Transl. Oncol. 14 3 232 236 10.1007/s12094-012-0789-z 22374428 Sun X. Kaufman P. D. 2018 Ki-67: more than a proliferation marker Chromosoma 127 2 175 186 10.1007/s00412-018-0659-8 29322240 PMC5945335 Sun X. Zhang J. Wang L. Tian Z. 2008 Growth inhibition of human hepatocellular carcinoma cells by blocking STAT3 activation with decoy-ODN Cancer Lett. 262 2 201 213 10.1016/j.canlet.2007.12.009 18248786 Sun Y. Guo B. feng bo Xu L. Zhong J. teng Liu Z. wen Liang H. 2015 Stat3-siRNA inhibits the growth of gastric cancer in vitro in vivo Cell Biochem. Funct. 33 7 495 502 10.1002/cbf.3148 26486443 The Human Protein Atlas 2025 STAT3 protein expression summary - the human protein atlas Available online at: https://www.proteinatlas.org/ENSG00000168610-STAT3 Tolomeo M. Cascio A. 2021 The multifaced role of STAT3 in cancer and its implication for anticancer therapy Int. J. Mol. Sci. 22 2 603 10.3390/ijms22020603 33435349 PMC7826746 Tsareva S. A. Moriggl R. Corvinus F. M. Wiederanders B. Schütz A. Kovacic B. 2007 Signal transducer and activator of transcription 3 activation promotes invasive growth of colon carcinomas through matrix metalloproteinase induction Neoplasia 9 4 279 291 10.1593/neo.06820 17460772 PMC1854849 Turkson J. Ryan D. Kim J. S. Zhang Y. Chen Z. Haura E. 2001 Phosphotyrosyl peptides block Stat3-mediated DNA binding activity, gene regulation, and cell transformation J. Biol. Chem. 276 48 45443 45455 10.1074/jbc.M107527200 11579100 Warton K. Foster N. C. Gold W. A. Stanley K. K. 2004 A novel gene family induced by acute inflammation in endothelial cells Gene 342 1 85 95 10.1016/j.gene.2004.07.027 15527968 World Cancer Research Fund 2025 Ovarian cancer statistics | world cancer research fund Available online at: https://www.wcrf.org/preventing-cancer/cancer-statistics/ovarian-cancer-statistics/#ovarian-cancer-incidence-cases Yang E. Lerner L. Besser D. Darnell J. E. 2003 Independent and cooperative activation of chromosomal c-fos promoter by STAT3 J. Biol. Chem. 278 18 15794 15799 10.1074/jbc.M213073200 12600988 Yu H. Jove R. 2004 The stats of cancer - new molecular targets come of age Nat. Rev. Cancer 4 2 97 105 10.1038/nrc1275 14964307 Zhang X. Zhang J. Wang L. Wei H. Tian Z. 2007 Therapeutic effects of STAT3 decoy oligodeoxynucleotide on human lung cancer in xenograft mice London, UK BMC Cancer 7 149 11 10.1186/1471-2407-7-149 17683579 PMC1988829 ",
  "metadata": {
    "Title of this paper": "Therapeutic effects of STAT3 decoy oligodeoxynucleotide on human lung cancer in xenograft mice",
    "Journal it was published in:": "Frontiers in Pharmacology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477429/"
  }
}