{
  "title": "Paper_330",
  "abstract": "pmc Cancer Sci Cancer Sci 2682 cas CAS Cancer Science 1347-9032 1349-7006 Wiley PMC12485656 PMC12485656.1 12485656 12485656 40702700 10.1111/cas.70148 CAS70148 CAS-OA-0238-2025.R1 1 Original Article ORIGINAL ARTICLE Cell, Molecular, and Stem Cell Biology APE1 Attenuates ALK Tyrosine Kinase Inhibitors Sensitivity in NPM1‐ALK Positive Anaplastic Large Cell Lymphoma Liu Zheng  1  2 Jing Xinming  1 Li Dong https://orcid.org/0000-0002-9669-4873  2 Bao Lingbo  2 Liu Yi  3 Hang Ruyi  1 Kuang Xunjie  1 Jiang Ziqi  1 Dai Xiaoyan  1 Tong Xueling  1 Tell Gianluca  4 Li Mengxia https://orcid.org/0009-0007-9987-7302  1 limengxia@tmmu.edu.cn   1 Cancer Center, Daping Hospital & Army Medical Center of PLA Army Medical University (Third Military Medical University) Chongqing China   2 Department of Oncology The General Hospital of Western Theater Command Chengdu China   3 Department of Hypertension and Endocrinology, Center for Hypertension and Metabolic Diseases, Daping Hospital Army Medical University (Third Military Medical University) Chongqing China   4 Laboratory of Molecular Biology and DNA Repair, Department of Medicine University of Udine Udine Italy * Correspondence: limengxia@tmmu.edu.cn 23 7 2025 10 2025 116 10 498068 10.1111/cas.v116.10 2723 2736 18 4 2025 31 1 2025 09 7 2025 23 07 2025 02 10 2025 02 10 2025 © 2025 The Author(s). Cancer Science https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by-nc-nd/4.0/ ABSTRACT Anaplastic lymphoma kinase (ALK), a tyrosine kinase receptor of the RTK insulin superfamily, was named after its initial identification in anaplastic large cell lymphoma (ALCL). Following a reciprocal chromosomal translocation with nucleophosmin 1 (NPM1), ALK protein is abnormally expressed, promoting the malignant transformation of T cells into a more aggressive lymphoma. The inhibition of ALK activity could therefore benefit ALK+ ALCL patients. Despite the market availability and success of ALK tyrosine kinase inhibitors (TKIs), real‐world ALK+ ALCL patients exhibit significant heterogeneity in terms of disease stage at first diagnosis, tumor progression, and responses to medication. This indicates a need for more detailed differentiation of ALK+ ALCL patients in clinical practice. Here, we discovered that apurinic/apyrimidinic endonuclease‐reduction/oxidation factor 1 (APE1/REF1), an interacting partner of NPM1, could stabilize NPM1‐ALK fusion protein oligomers and enhance ALK tumor‐promoting activity and growth, decreasing cell sensitivity to ALK‐TKIs. Our results also reveal that disruption of the interaction weakens cell growth and augments the therapeutic efficacy of crizotinib and alectinib, ALK‐TKIs, against ALK+ ALCL. Thus, high expression of APE1 indicates a faster growth of ALK+ ALCL; targeting this interaction may potentially achieve improved therapeutic outcomes, providing a reference for more precise treatment of ALK+ ALCL patients in clinical practice. The multifunctional DNA repair protein APE1 could activate NPM1‐ALK and reduce ALK‐TKI sensitivity through stabilization of NPM1‐ALK oligomer. APE1 low expression or mutation of the interaction point decreased tumor growth and increased TKI sensitivity in NPM1‐ALK+ ALCL. ALCL ALK‐TKI APE1 NPM1‐ALK TKI sensitivity Postgraduate Research & Practice Innovation Program of Chongqing Province CYB240289 National Natural Science Foundation of China 10.13039/501100001809 the Talent Innovation and Capacity Building Program (Organized Research) of Army Medical Center of PLA ZXYZZKY07 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:01.10.2025  Funding: Zheng Liu, Xinming Jing, and Dong Li are contributed equally to this work. Abbreviations ALCL anaplastic large cell lymphoma ALK anaplastic lymphoma kinase APE1 apurinic/apyrimidinic endonuclease 1 BER base excision repair NPM1 Nucleophosmin 1 TKI tyrosine kinase inhibitor 1 Introduction Anaplastic large cell lymphoma (ALCL) is an aggressive mature T‐cell tumor frequently found in children and young adults, with about 50%–80% of cases expressing anaplastic lymphoma kinase (ALK) [ 1 2 3 4 5 6 Alk Npm1 Npm1‐alk 7 8 9 10 11 12 13 14 15 NCT03505554 16 17 18 Apurinic/apyrimidinic endonuclease‐1 (APE1), a crucial enzyme in DNA damage repair pathways and cellular responses, participates in base excision repair (BER), transcriptional regulation, redox reactions, RNA metabolism, and various other cellular processes [ 19 20 21 22 23 24 25 26 27 28 29 20 2 Material and Methods 2.1 Reagents Antibodies against APE1 were purchased from Abcam (MA, USA); NPM1, NPM‐C were purchased from Santa Cruz (Shanghai, China); ALK, phospho‐ALK, Stat3, ERK1/2, Akt, phospho‐p44/42 (Thr202/Tyr204), phospho‐Akt, phospho‐Stat3 (Tyr705), and normal rabbit IgG were purchased from Cell Signaling Technology (Danvers, MA, USA). Crizotinib and alectinib were obtained from MedChemExpress (Shanghai, China). 2.2 Cell Culture and Treatments All cells were purchased from Biospes (Chongqing, China) in September 2020 and were authenticated by STR in November 2020. SU‐DHL‐1 and Karpas‐299 cells were maintained in RPMI 1640 medium (Procell, China), supplemented with 10% fetal bovine serum and 1% penicillin–streptomycin; 293 T cells were maintained in DMEM. Passaging of the cells was performed with 0.25% trypsin–EDTA (Procell). All cell lines were tested for mycoplasma contamination at regular intervals and results always showed negative. Protein knockdown (KD) or overexpression (OE) experiments were conducted using lentivirus or plasmid. The methods that lentivirus was packaged, transfection, and verification were stated before [ 30 2.3 IHC Acquisition of all samples in this research was approved by the Ethics Committee of Daping Hospital. Briefly, the formalin‐fixed and paraffin‐embedded (FFPE) ALCL clinical specimen sections were obtained from the Department of Pathology, Daping Hospital. Xenograft sections were prepared with an intelligent program‐controlled automatic hydroextractor (Taiva Technology, Hubei, China). After dewaxing, heat‐induced epitope retrieval (HIER) was conducted with EDTA (pH 8.0) or slightly acidic buffer citrate (pH 6.0). After 10 min of incubation at room temperature with endogenous peroxidase blocker (MXB, China), sections were incubated with specific antibodies at 4°C overnight. The next day, sections were incubated with HRP‐coupling second antibody at 37°C for 30 min and stained with DAB. Nuclear was stained with hematoxylin. The expression of in the dicated protein was evaluated with ImageJ based on the H H 2.4 Westernblot Cells and xenograft tissue were homogenized in T‐PER Tissue Protein Extraction Reagent (Thermo Fisher, USA), supplemented with a proteinase and phosphatase inhibitor mixture (Thermo), then mixture was incubated at 4°C for 20 min and centrifuged for 15 min at 18000 g after ultrasonication to get whole‐cell extraction. The protein levels in the extracts were quantified using NanoDrop One Microvolume UV–Vis Spectrophotometer (Thermo). For the preparation of a 10% separating gel (15 mL total volume), combine 6 mL of ddH₂O, 4.95 mL of acrylamide mix (30% acrylamide solution and 2% bis‐acrylamide solution at 29:1 ratio), 3.75 mL of 1.5 M Tris–HCl (pH 8.8), 0.15 mL of 10% SDS, 0.18 mL of 10% APS, and 12 μL TEMED. Mix thoroughly and pour into the gel‐casting apparatus to polymerize. For the 4% stacking gel (3 mL total volume), combine 2.1 mL of ddH₂O, 0.5 mL of the same acrylamide mix, 0.38 mL of 0.5 M Tris–HCl (pH 6.8), 0.03 mL of 10% SDS, 50 μL of 10% APS, and 5 μL TEMED. For western blotting, whole‐cell extracts (25–30 μg/lane) were resolved on wells and run it by electrophoresis at 110 V until the dye front reaches the bottom of the gel. For membrane transfer: 100 V for 90–120 min, proteins were transferred to a nitrocellulose membrane (0.2 μm; Bio‐Rad, CA, USA) in 25 mM Tris‐base, 190 mM glycine and 20% methanol with a semidry blotter. 4%–20% gradient gels were purchased from ACE (ACE Biotechnology, China). Membranes were blocked with 5% bovine serum albumin (BSA) or defatted milk for l.5 h, then incubated with a primary antibody (suggested dilution rate) and secondary antibody sequentially. Protein bands were detected using a clarity max western ECL substrate (Bio‐Rad), and light emission was captured on a chemidoc touch imaging system (Bio‐Rad). 2.5  CO Whole‐cell extracts were prepared with Cell lysis buffer for IP (Beyotime, China) without ultrasonication and incubated with a particular antibody or normal rabbit IgG and A/G magnetic beads at 4°C temperature for 12–16 h. Magnetic beads were collected with a magnetic rack. After washing with PBST for five times, beads were homogenized with SDS‐PAGE sample loading buffer and boiled for 5 min in a metal bath at 95°C. Next steps were conducted as WB. 2.6 Immunofluorescence Before the experiment, ALCL cells were washed 3 times with PBS and maintained on glass bottom cell culture dishes (NEST, China), then centrifuged the dishes for 5 min at 750  g 2.7  FLOW Cell apoptosis was measured by an Annexin V‐PE/7‐AAD Apoptosis Detection Kit (Bestbio, China). Briefly, cells were plated in 6‐well plates; after 72 h of treatment, cells were harvested and washed with PBS. All steps were conducted under the guidance of the kit. Apoptotic cells were determined by flow cytometry (Beckman Coulter, USA); 10,000 events were recorded for analysis with CytExpert 2.6 software. 2.8 Multiplex Immunohistochemistry MIHC staining was performed on 2 μm histologic tumor sections from FFPE tumor samples with the 7‐Color mIHC Kit (Panovue, China). The IF markers were grouped into the panel consisting of ALK (1:500), APE1 (1:2000), pALK (1:200), pSTAT3 (1:200), and pERK (1:300). Briefly, all steps are conducted following the specifications of the 7‐Color mIHC kit. The deparaffinized and epitope retrieval procedures were the same as IHC. Only one antigen was incubated each round, followed by epitope retrieval and protein blocking again. After nucleus staining, slides were visualized using the phenoimager Fusion (Akoya Biosciences). 2.9 PLA Proximity Ligation assay (PLA) was performed following Duolink PLA manufacturer's instructions (Sigma, USA). Cells were plated on glass bottom cell culture dishes 1 day before experiments. After fixation and permeabilization (the same as IF), cells were incubated with rabbit ALK antibody, mouse APE1 antibodies, or no antibody overnight at 4°C, followed by incubation with secondary antibodies conjugated with PLA probe at 37°C for 1 h. Then, ligation and amplification were performed following construction (Sigma, USA). 293 T cells uninfected by NPM1‐ALK lentivirus were used as a biological negative control to detect the specificity of primary antibodies; technical negative control (NC) was set with no primary antibody used during the experiment to exclude background signals. Lastly, imaging was conducted with a confocal microscopy (TCS SP5, Leica, Germany). 2.10 Xenograft Studies Three‐to‐four‐week‐old male NCG mice (T001475) were purchased from GemPharmatech (Jiangsu, China). All mice were maintained in a temperature‐controlled (22°C–25°C), pathogen‐free environment and had free access to food and water in Animal Centre of Daping Hospital. Mice were randomly divided into four groups when they reached the age of 4 weeks and an average body weight of 25 g. For subcutaneous xenografts, 5 × 10 6 K4pleA 3 2.11 Statistical Analysis Statistical data were expressed as mean ± SD. All of the statistical analyses were assessed by GraphPad Prism 9.5.1 software and ggpubr package with R 4.3.2; comparisons among groups were done by chi‐square test, the independent sample two‐sided Student t p p p p 3 Results 3.1  APE1 NPM1 ALK ALK ALCL To identify candidate novel determinants, we first employed immunoprecipitation (IP) with ALK antibodies and used proteomic studies to determine proteins bound to the NPM1‐ALK fusion protein from SU‐DHL‐1 cell extracts. We found that NPM1‐ALK captured the multifunctional protein APE1 (Figure 1A 1 1B S1A 1C 1C S1B H S1 1D–F FIGURE 1 APE1 is highly correlated with later Lugano stage and NPM1‐ALK activation in ALK+ALCL patients. (A) LC–MS/MS results of protein outcomes after immunoprecipitation with ALK antibody in SU‐DHL‐1 cells showing APE1 and NPM1. (B) Representative immunohistochemical staining with APE1, NPM1‐ALK, or Ki‐67 antibody in ALK+ALCL samples. Scale bars, 20 μm. (C) APE1 and Ki‐67 expression were quantified by immunostaining, and their H H n n p p p p TABLE 1 Clinical characteristics of ALCL patients. All, (No. %) Patients ALK positive ALK negative Characteristic 35 11 24 Patients Median age, years (range) 54 (23–70) 39 (23–68) 66 (31–70) Sex Male 26 (74) 9 (82) 17 (71) Female 9 (26) 2 (18) 7 (29) Smoking history Never 20 (57) 6 (55) 14 (58) Remote former smoker 3 (9) 1 (9) 2 (8) Current smoker 12 (34) 4 (36) 8 (33) Drink history Never 27 (77) 10 (91) 17 (71) Light 4 (11) 0 4 (16) Heavy 4 (11) 1 (9) 3 (13) Stage at diagnosis (Lugano 2014) Limited (I and II) 15 (43) 4 (36) 11 (46) Advanced (III and IV) 20 (57) 7 (64) 13 (54) IPI score 0 4 (11) 2 (18) 2 (8) 1 10 (29) 3 (27) 7 (29) 2 12 (34) 4 (36) 8 (33) 3 7 (20) 1 (9) 6 (25) 4 2 (6) 1 (9) 1 (4) 3.2  APE1 OE NPM1 ALK ALK TKI To figure out what happens in ALK+ ALCL, we overexpressed (OE) APE1 in ALK+ ALCL cell lines (SU‐DHL‐1 and Karpas‐299) using a lentivirus system. Specifically, we found that infection of the APE1‐FLAG OE lentiviral particle, but not the negative control virus (NC), resulted in an increased cell growth velocity (Figure 2A 2B FIGURE 2 APE1 OE activates NPM1‐ALK and reduces ALK‐TKI sensitivity in ALK+ ALCL. (A) APE1 was overexpressed in SU‐DHL‐1 and Karpas‐299 cells with a lentivirus system. Cell viability was evaluated by a CCK‐8 kit at the specified time points. (B) WB analysis performed on APE1 OE and NC ALK+ ALCL cell line; ALK and its downstream biological en‐points were assessed. Bands were normalized on β‐tubulin. (C) ALK‐TKI IC50 of APE1 OE and NC ALK+ ALCL cells is evaluated by a CCK‐8 kit. Cells were treated with crizotinib or alectinib for 72 h. (D) NPM1‐ALK positive ALCL cells were treated with 300 nM crizotinib or 100 nM alectinib, and then cell viability was evaluated by CCK‐8 Kit at different time points (0, 24, 48, and 72 h). (E) After 72 h of crizotinib treatment, the phosphorylation levels of NPM1‐ALK and its downstream proteins were assessed by WB in APE1 OE and NC ALK+ ALCL cells. (F) WB analysis on ALK oligomerization in APE1 OE, NC, and KD ALK+ALCL cells. Since APE1 activates NPM1‐ALK, we determined the effect of APE1 OE on ALK activation in the presence of an ALK‐TKI, that is, crizotinib, alectinib, which were used to control ALK activity for ALK+ ALCL patients clinically in China, Japan, and the USA. Increasing concentrations of each inhibitor were added, and cell viability was assessed by a cell counting kit. Results showed that the IC50 of APE1 OE cells was significantly higher than NC in two cell lines, especially crizotinib (Figure 2C 2E S2 Previous studies of ALK revealed that oligomerization of the ALK fusion protein is vital for its activation, such that monomerization of the ALK intracellular domain via an inducible system inhibited ALK phosphorylation [ 31 2F 2F 3.3  APE1 NPM1 ALK Given the previously described interaction between the ALK fusion partner NPM1 and APE1 [ 20 3A,B 3C S3A S3B K4pleA 32 3A–C 20 S4 FIGURE 3 APE1 interacts with NPM1‐ALK in the nucleus. (A–C) Co‐immunoprecipitation (CO‐IP) with APE1, NPM1‐ALK antibodies, N△33APE1 and APE1 K4pleA K4pleA p p p p Double immunofluorescent detections revealed co‐localization of APE1 and NPM1‐ALK proteins in SU‐DHL‐1 and Karpas‐299 cells in both the cytoplasm and nucleus, whereas antibodies against the unique C‐terminal region of NPM1 revealed only nucleolar localization of the endogenous (non‐fusion) protein (Figure 3D K4pleA K4pleA 3E 3.4 Interaction Site Mutation of APE1 NPM1 ALK ALK TKI To figure out what happened when this interaction was weakened, we evaluated cell viability using a CCK‐8 assay; results showed that in both ALK+ALCL cell lines, the APE1 K4pleA 4A 4B 4C K4pleA K4pleA 4D K4pleA 4E K4pleA 4F FIGURE 4 Interaction site mutation of APE1 attenuated phosphorylation of NPM1‐ALK and enhanced tumor inhibitory effect of ALK‐TKI. (A) Cell viabilities of APE1 wt and APE1 K4pleA K4pleA K4pleA K4pleA K4pleA p p p p 3.5 Mutant APE1 K4pleA NPM1 ALK ALCL To validate the translational relevance of our findings in vivo, APE1 wt and APE1 K4pleA 5A K4pleA 5B 5C,D K4pleA K4pleA 5E,F FIGURE 5 Mutant APE1 K4pleA 3 p p p p 4 Discussion In this paper, we identified a novel factor affecting ALK‐driven activity and ALK‐TKI sensitivity. Our data suggest that APE1, an interacting protein of the ALK fusion partner NPM1, sustains survival and proliferation signals and reduces ALK‐TKI sensitivity of ALK+ ALCL cells through its N‐terminal Lys27/31/32/35. In clinical samples, ALK+ ALCL patients with higher APE1 expression levels in tumors were significantly associated with elevated serum LDH levels and more advanced clinical stages at initial diagnosis; their tumors also showed a higher Ki‐67 expression and higher ALK‐downstream gene activation. To confirm this, we overexpressed APE1 in vitro and found that OE of APE1 promotes the survival and growth of ALK+ ALCL cells, reduces ALK‐TKI sensitivity by interacting with NPM1‐ALK, and the destruction of the interaction attenuated phosphorylation of NPM1‐ALK and enhanced ALK‐TKI sensitivity. With the increasingly understanding of various ALK‐fusion associated malignancies, the so‐called ALKoma, we are just increasingly aware of the vital role of ALK oligomerization in its activation [ 33 34 32 K4pleA Therefore, despite most attention being paid to the ALK kinase region [ 35 6 35 36 37 Human APE1 N‐terminal region is especially conserved in mammals, in charge of nuclear localization and post‐translational modification and protein–protein interactions [ 38 39 13 14 Historically, in NPM1‐ALK‐positive ALCL, as well as other ALKoma, downstream signaling pathways, such as ERK, AKT, and STAT3 are predominantly driven by ALK signaling [ 40 Many ongoing clinical researches have focused on the heterogeneity of ALK+ NSCLC patients [ 41 42 In summary, this paper demonstrated that NPM1's interaction protein APE1 improves cell growth and reduce ALK‐TKI sensitivity in NPM1‐ALK ALCL by stabilizing its oligomerization, and APE1 K4pleA 6A FIGURE 6 Schematic diagram of APE1 affecting the NPM1‐ALK fusion protein in ALK+ ALCL. (A) NPM1's interaction protein APE1 improves cell proliferation and reduce ALK‐TKI sensitivity in NPM1‐ALK ALCL by stabilizing its oligomerization, and APE1 K4pleA Author Contributions  Mengxia Li: Zheng Liu: Xinming Jing: Dong Li: Lingbo Bao: Yi Liu: Ruyi Hang: Xunjie Kuang: Ziqi Jiang: Xiaoyan Dai: Xueling Tong: Gianluca Tell: Ethics Statement Approval of the research protocol by an Institutional Reviewer Board: All protocols and informed consent in this study were approved by the Ethics Committee of Army Medical Center of PLA, with ratification No: 2024 (408). Animal Studies: All procedures involving mice in this study are approved by the Laboratory Animal Welfare and Ethics Committee of the Army Medical University (AMUWEC20237160). Consent Protocol, informed consent form was approved by the Ethics committee of Army Medical Center of PLA. Conflicts of Interest The authors declare no conflicts of interest. Supporting information  Figure S1.  Figure S2.  Figure S3.  Figure S4.  Table S1. H Acknowledgments We thank all of the financial supporters for this research. We gratefully acknowledge Yi Cheng for kindly providing cell lines. We extend our sincere thanks to Yuxin Yang for their expert assistance in coordinating pathological sample collection and processing. Special appreciation is given to Xin Guo for her contributions to plasmid design, viral vector construction, and validation experiments. These collective efforts significantly advanced the experimental progress of this study. References 1 X. Zhang P. Chien S. Nam C. Heo Anaplastic Large Cell Lymphoma: Molecular Pathogenesis and Treatment Cancers 14 2022 1650 35406421 10.3390/cancers14071650 PMC8997054 2 M. Shiota J. Fujimoto T. Semba H. Satoh T. Yamamoto S. Mori Hyperphosphorylation of a Novel 80 kDa Protein‐Tyrosine Kinase Similar to Ltk in a Human Ki‐1 Lymphoma Cell Line, AMS3 Oncogene 9 1994 1567 1574 8183550 3 E. Bergaggio W. Tai A. Aroldi ALK Inhibitors Increase ALK Expression and Sensitize Neuroblastoma Cells to ALK.CAR‐T Cells Cancer Cell 41 2023 2100 2116 38039964 10.1016/j.ccell.2023.11.004 PMC10793157 4 M. Kalinova M. Mrhalova E. Kabickova Molecular Screening in Anaplastic Lymphoma Kinase–Positive Anaplastic Large Cell Lymphoma: Anaplastic Lymphoma Kinase Analysis, Next‐Generation Sequencing Fusion Gene Detection, and T‐Cell Receptor Immunoprofiling Modern Pathology 37 2024 100428 38266918 10.1016/j.modpat.2024.100428 5 J. Luedersen U. Z. Stadt J. Richter VariantALK‐Fusion Positive Anaplastic Large Cell Lymphoma (ALCL): A Population‐Based Paediatric Study of theNHL‐BFM Study Group British Journal of Haematology 204 2024 1894 1898 38279625 10.1111/bjh.19308 6 M. Elshatlawy J. Sampson K. Clarke R. Bayliss EML4‐ALK Biology and Drug Resistance in Non‐Small Cell Lung Cancer: A New Phase of Discoveries Molecular Oncology 17 2023 950 963 37149843 10.1002/1878-0261.13446 PMC10257413 7 J. E. Herrera J. J. Correia A. E. Jones M. O. J. Olson Sedimentation Analyses of the Salt‐ and Divalent Metal Ion‐Induced Oligomerization of Nucleolar Protein B23 Biochemistry 35 1996 2668 2673 8611572 10.1021/bi9523320 8 M. Saluri A. Leppert G. V. Gese A ‘Grappling Hook’ Interaction Connects Self‐Assembly and Chaperone Activity of Nucleophosmin 1 PNAS Nexus 2 2023 pgac303 36743470 10.1093/pnasnexus/pgac303 PMC9896144 9 S. S. Rajan A. D. Amin L. Li The Mechanism of Cancer Drug Addiction in ALK‐Positive T‐Cell Lymphoma Oncogene 39 2020 2103 2117 31804622 10.1038/s41388-019-1136-4 PMC7060126 10 V. R. Belum K. Marulanda C. Ensslin Alopecia in Patients Treated With Molecularly Targeted Anticancer Therapies Annals of Oncology 26 2015 2496 2502 26387145 10.1093/annonc/mdv390 PMC4658542 11 C. Laurent A. Nicolae C. Laurent Gene Alterations in Epigenetic Modifiers and JAK‐STAT Signaling Are Frequent in Breast Implant‐Associated ALCL Blood 135 2019 360 370 10.1182/blood.2019001904 PMC7059458 31774495 12 M. Menotti C. Ambrogio T. Cheong Wiskott–Aldrich Syndrome Protein (WASP) is a Tumor Suppressor in T Cell Lymphoma Nature Medicine 25 2019 130 140 10.1038/s41591-018-0262-9 PMC6556382 30510251 13 Y. P. Mossé M. S. Lim S. D. Voss Safety and Activity of Crizotinib for Paediatric Patients With Refractory Solid Tumours or Anaplastic Large‐Cell Lymphoma: A Children's Oncology Group Phase 1 Consortium Study Lancet Oncology 14 2013 472 480 23598171 10.1016/S1470-2045(13)70095-0 PMC3730818 14 R. Fukano T. Mori M. Sekimizu Alectinib for Relapsed or Refractory Anaplastic Lymphoma Kinase‐Positive Anaplastic Large Cell Lymphoma: An Open‐Label Phase II Trial Cancer Science 111 2020 4540 4547 33010107 10.1111/cas.14671 PMC7734006 15 G. Rindone A. Aroldi E. Bossi A Monocentric Analysis of the Long‐Term Safety and Efficacy of Crizotinib in Relapsed/Refractory ALK+ Lymphomas Blood Advances 7 2023 314 316 35914224 10.1182/bloodadvances.2022007538 PMC9898594 16 R. Russell‐Jones World Health Organization Classification of Hematopoietic and Lymphoid Tissues: Implications for Dermatology Journal of the American Academy of Dermatology 48 2003 93 102 12522377 10.1067/mjd.2003.45 17 R. Wu M. S. Lim Updates in Pathobiological Aspects of Anaplastic Large Cell Lymphoma Frontiers in Oncology 13 2023 1241532 37810974 10.3389/fonc.2023.1241532 PMC10556522 18 J. Wang L. Zhong W. Lin JAK/STAT3 Signaling Activation Related to Distinct Clinicopathologic Features in Systemic ALK− Anaplastic Large Cell Lymphomas American Journal of Surgical Pathology 47 2023 55 64 36315833 10.1097/PAS.0000000000001995 19 M. Poletto M. C. Malfatti D. Dorjsuren Inhibitors of the Apurinic/Apyrimidinic Endonuclease 1 (APE1)/nucleophosmin (NPM1) Interaction That Display Anti‐Tumor Properties Molecular Carcinogenesis 55 2016 688 704 25865359 10.1002/mc.22313 PMC4600639 20 C. Vascotto D. Fantini M. Romanello APE1/Ref‐1 Interacts With NPM1 Within Nucleoli and Plays a Role in the rRNA Quality Control Process Molecular and Cellular Biology 29 2009 1834 1854 19188445 10.1128/MCB.01337-08 PMC2655621 21 G. Tell D. Fantini F. Quadrifoglio Understanding Different Functions of Mammalian AP Endonuclease (APE1) as a Promising Tool for Cancer Treatment Cellular and Molecular Life Sciences 67 2010 3589 3608 20706766 10.1007/s00018-010-0486-4 PMC11115856 22 K. A. Robertson H. A. Bullock Y. Xu Altered Expression of Ape1/Ref‐1 in Germ Cell Tumors and Overexpression in NT2 Cells Confers Resistance to Bleomycin and Radiation Cancer Research 61 2001 2220 2225 11280790 23 Y. Du Y. Zhou X. Yan APE1 Inhibition Enhances Ferroptotic Cell Death and Contributes to Hepatocellular Carcinoma Therapy Cell Death and Differentiation 31 2024 431 446 38418695 10.1038/s41418-024-01270-0 PMC11043431 24 M. C. Malfatti A. Bellina G. Antoniali G. Tell Revisiting Two Decades of Research Focused on Targeting APE1 for Cancer Therapy: The Pros and Cons Cells 12 2023 1895 37508559 10.3390/cells12141895 PMC10378182 25 G. Antoniali E. Dalla G. Mangiapane APE1 Controls DICER1 Expression in NSCLC Through miR‐33a and miR‐130b Cellular and Molecular Life Sciences 79 2022 446 35876890 10.1007/s00018-022-04443-7 PMC9314295 26 A. V. Popov A. V. Endutkin D. D. Yatsenko Molecular Dynamics Approach to Identification of New OGG1 Cancer‐Associated Somatic Variants With Impaired Activity Journal of Biological Chemistry 296 2021 100229 33361155 10.1074/jbc.RA120.014455 PMC7948927 27 M. L. Hegde T. K. Hazra S. Mitra Functions of Disordered Regions in Mammalian Early Base Excision Repair Proteins Cellular and Molecular Life Sciences 67 2010 3573 3587 20714778 10.1007/s00018-010-0485-5 PMC2996047 28 D. Fantini C. Vascotto D. Marasco Critical Lysine Residues Within the Overlooked N‐Terminal Domain of Human APE1 Regulate Its Biological Functions Nucleic Acids Research 38 2010 8239 8256 20699270 10.1093/nar/gkq691 PMC3001066 29 N. Moor E. I. Vasil O. Lavrik Functional Role of N‐Terminal Extension of Human AP Endonuclease 1 in Coordination of Base Excision DNA Repair via Protein–Protein Interactions International Journal of Molecular Sciences 21 2020 3122 32354179 10.3390/ijms21093122 PMC7247576 30 M. Li X. Yang X. Lu APE1 Deficiency Promotes Cellular Senescence and Premature Aging Features Nucleic Acids Research 46 2018 5664 5677 29750271 10.1093/nar/gky326 PMC6009672 31 N. Hirai T. Sasaki S. Okumura Y. Minami S. Chiba Y. Ohsaki Monomerization of ALK Fusion Proteins as a Therapeutic Strategy in ALK‐Rearranged Non‐Small Cell Lung Cancers Frontiers in Oncology 10 2020 419 32300555 10.3389/fonc.2020.00419 PMC7142238 32 G. Mangiapane M. Notarangelo G. Canarutto The DNA‐Repair Protein APE1 Participates With hnRNPA2B1 to Motif‐Enriched and Prognostic miRNA Secretion Oncogene 43 2024 1861 1876 38664500 10.1038/s41388-024-03039-8 33 M. W. Richards E. W. Law L. P. Rennalls Crystal Structure of EML1 Reveals the Basis for Hsp90 Dependence of Oncogenic EML4‐ALK by Disruption of an Atypical β‐Propeller Domain Proceedings of the National Academy of Sciences of the United States of America 111 2014 5195 5200 24706829 10.1073/pnas.1322892111 PMC3986153 34 M. W. Richards L. O'Regan D. Roth Microtubule Association of EML Proteins and the EML4‐ALK Variant 3 Oncoprotein Require an N‐Terminal Trimerization Domain Biochemical Journal 467 2015 529 536 25740311 10.1042/BJ20150039 35 J. L. Schneider J. J. Lin A. T. Shaw ALK‐Positive Lung Cancer: A Moving Target Nature Cancer 4 2023 330 343 36797503 10.1038/s43018-023-00515-0 PMC10754274 36 A. J. Cooper L. V. Sequist J. J. Lin Third‐Generation EGFR and ALK Inhibitors: Mechanisms of Resistance and Management Nature Reviews. Clinical Oncology 19 2022 499 514 10.1038/s41571-022-00639-9 PMC9621058 35534623 37 A. Shiba‐Ishii T. W. Johnson I. Dagogo‐Jack Analysis of Lorlatinib Analogs Reveals a Roadmap for Targeting Diverse Compound Resistance Mutations in ALK‐Positive Lung Cancer Nature Cancer 3 2022 710 722 35726063 10.1038/s43018-022-00399-6 PMC9732888 38 E. B. Jackson Analysis of Nuclear Transport Signals in the Human Apurinic/Apyrimidinic Endonuclease (APE1/Ref1) Nucleic Acids Research 33 2005 3303 3312 15942031 10.1093/nar/gki641 PMC1143697 39 G. Antoniali F. Serra L. Lirussi Mammalian APE1 Controls miRNA Processing and Its Interactome Is Linked to Cancer RNA Metabolism Nature Communications 8 2017 797 10.1038/s41467-017-00842-8 PMC5630600 28986522 40 S. Zhao J. Li Q. Xia K. Liu Z. Dong New Perspectives for Targeting Therapy in ALK‐Positive Human Cancers Oncogene 42 2023 1959 1969 37149665 10.1038/s41388-023-02712-8 41 J. M. Heuckmann M. Hölzel M. L. Sos ALK Mutations Conferring Differential Resistance to Structurally Diverse ALK Inhibitors Clinical Cancer Research 17 2011 7394 7401 21948233 10.1158/1078-0432.CCR-11-1648 PMC3382103 42 M. Guan J. Xu Q. Shi Molecular Determinants of Clinical Outcomes for Anaplastic Lymphoma Kinase‐Positive Non‐Small Cell Lung Cancer in Chinese Patients: A Retrospective Study Cancer Genetics 270‐271 2023 32 38 10.1016/j.cancergen.2022.11.005 36502690 ",
  "metadata": {
    "Title of this paper": "Molecular Determinants of Clinical Outcomes for Anaplastic Lymphoma Kinase‐Positive Non‐Small Cell Lung Cancer in Chinese Patients: A Retrospective Study",
    "Journal it was published in:": "Cancer Science",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485656/"
  }
}