{
  "title": "Paper_792",
  "abstract": "pmc Int J Genomics Int J Genomics 2080 ijg IJOG International Journal of Genomics 2314-436X 2314-4378 Wiley PMC12455245 PMC12455245.1 12455245 12455245 41031221 10.1155/ijog/5520810 IJOG5520810 1 Research Article Article NRG‐1 Promotes Axon Regeneration of Dorsal Root Ganglion Neurons in Diabetic Rats via ITGB1/FAK/AKT Pathway Zhan Peng https://orcid.org/0000-0002-2809-1827  1 Xiong Hewei  2 Zheng Hongmei https://orcid.org/0009-0004-9864-3211  1 2022zl0002@hust.edu.cn Liu Hongda liuhongda@njmu.edu.cn   1 Breast Cancer Center Hubei Cancer Hospital Tongji Medical College Huazhong University of Science and Technology National Key Clinical Specialty Discipline Construction Program Hubei Provincial Clinical Research Center for Breast Cancer Wuhan Clinical Research Center for Breast Cancer Wuhan Hubei China hust.edu.cn   2 Department of Emergency Surgery Union Hospital Tongji Medical College Huazhong University of Science and Technology Wuhan China tjmu.edu.cn 23 9 2025 2025 2025 480730 5520810 21 8 2025 21 7 2025 01 9 2025 23 09 2025 30 09 2025 01 10 2025 Copyright © 2025 Peng Zhan et al. International Journal of Genomics published by John Wiley & Sons Ltd. 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/  Objectives:  Result: β  Conclusion: Keywords axons ganglion cells integrins nerve regeneration neuregulin (NRG) Type I diabetes Hubei Cancer Hospital Biomedical Center Research Project 2022SWZX09 2022SWZX03 Chen Xiao-Ping Foundation for the Development of Science and Technology of Hubei Province CXPJJH123001-2320 Hubei Provincial Natural Science Foundation Innovation and Development Joint Fund Project 2024AFD454 Hubei Province Medical Youth Top Talent Project EWT[2023]65 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:23.09.2025  Zhan Peng Xiong Hewei Zheng Hongmei NRG‐1 Promotes Axon Regeneration of Dorsal Root Ganglion Neurons in Diabetic Rats via ITGB1/FAK/AKT Pathway International Journal of Genomics 2025 5520810 2025 10.1155/ijog/5520810  Academic Editor: 1. Introduction Diabetic neuropathy is one of the common complications of chronic diabetes, which induces the peripheral processes of sensory neuron axons, including segmental demyelination or axon atrophy and loss. Deficient neurotrophin support has been proposed to contribute to the development of diabetic neuropathy, as the capacity to reorganize and regrow axons is compromised due to reduced neurotrophic support [ 1 2 NRG‐1 comprises a group of polypeptide neurotrophic factors, with several subtypes (such as NRG‐1 α β γ β 3 5 β 6 7 β 8 Some researchers have detected that ITGB1 mRNA is differentially expressed in DRG tissues between streptozotocin (STZ)‐induced diabetic rats and normal control [ 9 10 13 2. Method 2.1. Induction of Diabetes Mellitus (DM) Rats All rats had free access to food and water under a 24‐h light‐dark cycle, and all experimental procedures were approved by and conducted in accordance with the guidelines of the Animal Care Committee of Tongji Medical College. Male Sprague–Dawley (SD) rats (weighing 180–220 g) were acquired and acclimatized for 1 week under standard laboratory conditions. The day before the induction of diabetes, the rats were fasted for 12 h but allowed free access to water. Diabetes was induced by a single intraperitoneal injection of STZ (75 mg/kg, Sigma‐Aldrich, United States) [ 14 15 2.2. Cell Isolation and Culture As described previously in the Method section, cultures of DRG neurons were seeded at a density of 5 × 10 4 16 2.3. Western Blot Western blotting was performed following our laboratory’s standard protocol [ 17 β 2.4. qRT‐PCR Total RNA was extracted from DRGs using TRIzol reagent (TaKaRa, Dalian, China). cDNA was synthesized with the M‐MLV reverse transcriptase kit (ELK Biotechnology, EQ002). The qRT‐PCR was applied using EnTurbo SYBR Green PCR (qRT‐PCR) SuperMix kit (ELK Biotechnology, EQ001). The primer sequences used were as follows: ITGB, forward: ATGCTATCCCAACTACACTGGC, reverse: CACCAAGGCAGGTCTGACAG and β − Δ Δ 2.5. Immunostaining The DRGs isolated from diabetic rats on 25 mm glass cover slips were fixed with 4% paraformaldehyde. Then, the primary antibody was added and incubated overnight at 4°C. For immunocytochemistry, rabbit anti‐tubulin‐ β 2.6. Axon Length Measurement Confocal image stacks were flattened, and neurite branches were traced using a tracer plugin named Neuron J in FIJI (Fiji Is Just ImageJ). After setting the spatial scale (micrometers per pixel), the axonal length was calculated by multiplying the total number of pixels in the trace by the length corresponding to a single pixel. For dissociated cultures, the longest neurite of 20 DRGs selected randomly from independent optical fields in each group was measured. 2.7. Small Interfering RNA (siRNA) Silencing Two integrin β 2.8. Statistical Analysis Data from more than two groups was analyzed by one‐way ANOVA with post hoc Dunnett’s test. Student’s t p 3. Result 3.1. STZ‐Induced Diabetes Rats After 3 days of STZ (75 mg/kg) being administered via intraperitoneal injection, STZ was dissolved in 0.1 M citrate buffer (pH 4.5) freshly prepared on the day of injection. Injections were performed within 30 min of dissolution to avoid degradation. The blood glucose of the DM group was significantly increased (> 16.8 mM) compared with the control group, and the symptoms of polydipsia and polyuria gradually appeared. Blood glucose was measured daily for the first week post‐STZ injection, then weekly for 8 weeks. After 8 weeks of feeding, three rats of the DM group died, and the average blood glucose concentration of the surviving rats is a 3.8‐fold increase compared to sham‐injected rats (25.7 ± 1.28 mM vs. 6.74 ± 0.64 mM, respectively). In terms of body weight, the DM rats decreased 36% compared to control rats (Table 1 Table 1 Blood glucose levels and weight of control, DM group.  Groups  Number  Blood glucose (mM)  P 1  Weight (g)  P 2 Before induction Control 10 6.31 ± 0.31 0.85 195.4 ± 3.578 0.2934 DM 30 6.51 ± 0.19 190.3 ± 2.466  4 weeks after induction Control 10 7.31 ± 0.51 < 0.0001 273.6 ± 4.817 < 0.0001 DM 28 26.25 ± 0.92 236.7 ± 3.208  8 weeks after induction Control 10 6.74 ± 0.64 < 0.0001 393.2 ± 9.459 < 0.0001 DM 27 25.7 ± 1.28 251.4 ± 5.246  Note: P 1 P 2 t 3.2. ITGB1/FAK/AKT Pathway Has a Low Expression in Diabetic Rat DRGs ITGB1 is an important participating molecule in the process of axon regeneration, and whether it is differently expressed in DRG neurons of diabetic rats remains unknown. We isolated sensory neurons as described in the Method section. Adult DRGs from control and STZ‐induced diabetic rats were cultured for 72 h under defined conditions. RT‐qPCR results showed that the mRNA level of ITGB1 was decreased by 40% ( p 1a 1b 1c Figure 1 Expression of ITGB1 in diabetic rats. (a) RT‐qPCR result of ITGB1 mRNA in DRG neurons from normal ( n n ∗ p ∗∗ p (a) (b) (c) 3.3. Effects of Different NRG‐1 Concentrations on Axon Regeneration of DRGs The suitable concentration of NRG‐1 promoting neuronal axon regeneration from diabetic rats needs to be explored. Immunofluorescence images were used to analyze the length of axon regeneration, and protein expression of Tau and GAP‐43 was analyzed by western blot to reflect the molecular level of axon regeneration. The level of GAP‐43 protein expression is closely linked to nerve regeneration, which exerts a key effect on recovering functional and structural plasticity of axon for reconstruction [ 18 20 21 Immunofluorescence and grayscale value analysis showed that all treated groups promoted axon growth to different extents (Figure 2c p 2a b 2c p 2d Figure 2 DRGs from diabetic rats treated with different concentrations of NRG‐1 for 72 h. (a) Western blot result of GAP‐43 and Tau expression in cells of five groups and (b) band analysis using ImageJ software. (c) Immunofluorescence staining of tubulin‐ β μ ∗ p ∗∗ p ∗∗∗ p # p ## p ### p (a) (b) (c) (d) 3.4. siRNA Effectiveness Test DRGs from diabetic rats were treated with two specific ITGB1‐siRNAs and a control siRNA. After 72 h of transfection, the silencing effect was analyzed by western blot. The expression of ITGB1 in the siRNA‐2 group was significantly decreased (Figure 3a p 3b Figure 3 siRNA interference effect. (a) Western blot analysis of ITGB1 protein in sensory neurons. (b) Relative gray value analyses were conducted. ∗∗ p ∗∗∗ p # p (a) (b) 3.5. NRG‐1 Promotes Axon Outgrowth by Enhancing ITGB1/FAK/AKT Pathway Expression To explore the relevance of the ITGB1/FAK/AKT pathway to NRG‐1 stimulated axonal regeneration, DRGs were transfected with siRNA and then analyzed by western blot and immunofluorescence. At 72 h, the results showed that the neurite length of the DM+N group increased by 3.33‐fold (Figure 4c μ μ β 4a,b μ μ β Figure 4 NRG‐1 promotes axonal outgrowth via ITGB1/FAK/AKT pathway. (a) Western blot analysis of ITBA1, FAK, p‐FAK, AKT, tubulin‐ β β μ μ ∗ p ∗∗ p ∗∗∗ p # p ## p ∗∗∗ p When we cultured neuronal cells for 96 h, the immunofluorescence results showed that the axons in each group exhibited increased density and significantly greater length (Figures 4d 4e 4f These results indicate that exogenous NRG‐1 increases the axonal regeneration ability of diabetic rats DRGs, likely by promoting nerve repair through modulation of ITGB1/FAK/AKT expression. Silencing ITGB1 can reverse this effect and reduce the promotive effects. 4. Discussion Nerve fiber loss was found during diabetic peripheral neuropathy, leading to dysesthesia which might put patients at a high risk of foot ulceration and serious injuries [ 22 23 24 Integrins, a family of heterodimeric transmembrane and cell adhesion receptors, mainly recognize extracellular matrix (ECM) ligands and cell surface ligands [ 25 α β β 26 β 27 28 The fact that NRG‐1b can stimulate neurite extension via the ErbB4 receptor–p42/44 MAPK signaling pathways in embryonic hippocampal neurons is well known [ 8 β 29 β 30 We used GAP‐43 and Tau proteins to assess changes at the molecular levels during axonal regeneration after treatment with different concentrations of NRG‐1. The level of GAP‐43 protein expression is closely linked to nerve regeneration, which exerts a key effect on recovering functional and structural plasticity of axons for reconstruction [ 18 20 21 GAP‐43 is discovered as an intracellular growth–associated protein, which exerts an important function in stimulating the transduction of signals to mediate cytoskeletal organization at the end of the neurite [ 31 33 34 When we analyzed the reinforced regeneration ability of axon by NRG‐1, the result conformed to the findings of previous research, showing NRG‐1 exerts differential promotive effects on axonal regeneration compared to NGF. NRG‐1 has more potential to promote neurite elongation, while NGF has more advantages in promoting neurite density and branching [ 35 36 In conclusion, our results indicate that ITGB1 mRNA expression is attenuated in diabetic rats and that the expression of the ITGB1/FAK/AKT pathway is decreased. However, under the stimulation of exogenous NRG, DRGs exhibited the ability to enhance axonal growth and upregulated this pathway. Furthermore, when ITGB1‐siRNA was added, the expression of this pathway was further inhibited, partially reversing the promotion of axonal growth by NRG‐1. The results of this experiment may provide a breakthrough for the treatment of diabetic neuropathy. Ethics Statement All animal experiments were conducted according to the guidelines and standards of the Experimental Animal Center of Tongji Medical College, Huazhong University of Science and Technology. Consent The authors have nothing to report. Conflicts of Interest The authors declare no conflicts of interest. Author Contributions P.Z. and H.X. designed the experiments, and P.Z. analyzed the data. P.Z. wrote the paper, and the manuscript was reviewed by H.Z. Funding This study was funded by the Hubei Province Medical Youth Top Talent Project (EWT[2023]65, Oncology), the Hubei Provincial Natural Science Foundation Innovation and Development Joint Fund Project (2024AFD454), the Chen Xiao‐Ping Foundation for the Development of Science and Technology of Hubei Province (CXPJJH123001‐2320), and the Hubei Cancer Hospital Biomedical Center Research Project (2022SWZX03 and 2022SWZX09). Acknowledgments The authors have nothing to report. Data Availability Statement The experimental data included in this study can be obtained by contacting the corresponding author. 1 Christianson J. A. Riekhof J. T. Wright D. E. Restorative Effects of Neurotrophin Treatment on Diabetes-Induced Cutaneous Axon Loss in Mice Experimental Neurology 2003 179 188 199 10.1016/S0014-4886(02)00017-1 12618126 2 Apfel S. C. Neurotrophic Factors in Peripheral Neuropathies: Therapeutic Implications Brain Pathology 1999 9 393 413 10.1111/j.1750-3639.1999.tb00234.x 10219753 PMC8098328 3 Chen S. Velardez M. O. Warot X. Yu Z. X. Miller S. J. Cros D. Corfas G. Neuregulin 1-erbB Signaling Is Necessary for Normal Myelination and Sensory Function Journal of Neuroscience 2006 26 3079 3086 10.1523/JNEUROSCI.3785-05.2006 16554459 PMC6674097 4 Thompson M. Lauderdale S. Webster M. J. Chong V. Z. McClintock B. Saunders R. Weickert C. S. Widespread Expression of ErbB2, ErbB3 and ErbB4 in Non-Human Primate Brain Brain Research 2007 1139 95 109 10.1016/j.brainres.2006.11.047 17280647 5 Lok J. Sardi S. P. Guo S. Besancon E. Ha D. M. Rosell A. Kim W. J. Corfas G. Lo E. H. Neuregulin-1 Signaling in Brain Endothelial Cells Journal of Cerebral Blood Flow and Metabolism 2009 29 39 43 10.1038/jcbfm.2008.94 18728681 PMC3680122 6 Pearson R. J. Carroll S. L. ErbB Transmembrane Tyrosine Kinase Receptors Are Expressed by Sensory and Motor Neurons Projecting Into Sciatic Nerve Journal of Histochemistry and Cytochemistry 2004 52 1299 1311 10.1177/002215540405201006 15385576 7 Reinhard S. Vela E. Bombara N. Devries G. H. Raabe T. D. Developmental Regulation of Neuregulin1 Isoforms and erbB Receptor Expression in Intact Rat Dorsal Root Ganglia Neurochemical Research 2009 34 17 22 10.1007/s11064-008-9732-7 18465224 8 Gerecke K. M. Wyss J. M. Carroll S. L. Neuregulin-1 β Molecular and Cellular Neurosciences 2004 27 379 393 10.1016/j.mcn.2004.08.001 15555917 9 Guo G. Liu Y. Ren S. Kang Y. Duscher D. Machens H. G. Chen Z. Comprehensive Analysis of Differentially Expressed MicroRNAs and mRNAs in Dorsal Root Ganglia From Streptozotocin-Induced Diabetic Rats PLoS One 2018 13 e0202696 10.1371/journal.pone.0202696 30118515 PMC6097669 10 Huck L. Pontier S. M. Zuo D. M. Muller W. J.  β Proceedings of the National Academy of Sciences of the United States of America 2010 107 15559 15564 10.1073/pnas.1003034107 20713705 PMC2932605 11 Kuramochi Y. Guo X. Sawyer D. B. Neuregulin Activates erbB2-Dependent src/FAK Signaling and Cytoskeletal Remodeling in Isolated Adult Rat Cardiac Myocytes Journal of Molecular and Cellular Cardiology 2006 41 228 235 10.1016/j.yjmcc.2006.04.007 16769082 PMC1847613 12 Lahlou H. Sanguin-Gendreau V. Frame M. C. Muller W. J. Focal Adhesion Kinase Contributes to Proliferative Potential of ErbB2 Mammary Tumour Cells but Is Dispensable for ErbB2 Mammary Tumour Induction In Vivo Breast Cancer Research 2012 14 10.1186/bcr3131 PMC3496154 22373082 13 Mocanu M. M. Fazekas Z. Petrás M. Nagy P. Sebestyén Z. Isola J. Tímár J. Park J. W. Vereb G. Szöllosi J. Associations of ErbB2, Beta1-Integrin and Lipid Rafts on Herceptin (Trastuzumab) Resistant and Sensitive Tumor Cell Lines Cancer Letters 2005 227 201 212 10.1016/j.canlet.2005.01.028 16112423 14 Hao G. M. Liu Y. G. Wu Y. Xing W. Guo S. Z. Wang Y. Wang Z. L. Li C. Lv T. T. Wang H. L. Shi T. J. Wang W. Han J. The Protective Effect of the Active Components of ERPC on Diabetic Peripheral Neuropathy in Rats Journal of Ethnopharmacology 2017 202 162 171 10.1016/j.jep.2017.03.015 28315720 15 Calcutt N. A. Jorge M. C. Yaksh T. L. Chaplan S. R. Tactile Allodynia and Formalin Hyperalgesia in Streptozotocin-Diabetic Rats: Effects of Insulin, Aldose Reductase Inhibition and Lidocaine Pain 1996 68 293 299 10.1016/S0304-3959(96)03201-0 9121817 16 Lindsay R. M. Nerve Growth Factors (NGF, BDNF) Enhance Axonal Regeneration but Are Not Required for Survival of Adult Sensory Neurons Journal of Neuroscience 1988 8 2394 2405 10.1523/JNEUROSCI.08-07-02394.1988 3249232 PMC6569525 17 Yang X. Xue P. Liu X. Xu X. Chen Z. HMGB1/Autophagy Pathway Mediates the Atrophic Effect of TGF- β Cell Communication and Signaling: CCS 2018 16 10.1186/s12964-018-0310-6 PMC6286536 30526602 18 Ceber M. Sener U. Mihmanli A. Kilic U. Topcu B. Karakas M. The Relationship Between Changes in the Expression of Growth Associated Protein-43 and Functional Recovery of the Injured Inferior Alveolar Nerve Following Transection Without Repair in Adult Rats Journal of Cranio-Maxillo-Facial Surgery 2015 43 1906 1913 10.1016/j.jcms.2015.08.018 26421471 19 Holahan M. R. A Shift From a Pivotal to Supporting Role for the Growth-Associated Protein (GAP-43) in the Coordination of Axonal Structural and Functional Plasticity Frontiers in Cellular Neuroscience 2017 11 10.3389/fncel.2017.00266 PMC5583208 28912688 20 Carriel V. Garzón I. Campos A. Cornelissen M. Alaminos M. Differential Expression of GAP-43 and Neurofilament During Peripheral Nerve Regeneration Through Bio-Artificial Conduits Journal of Tissue Engineering and Regenerative Medicine 2017 11 553 563 10.1002/term.1949 25080900 21 Hernandez-Morato I. Sharma S. Pitman M. J. Changes in Neurotrophic Factors of Adult Rat Laryngeal Muscles During Nerve Regeneration Neuroscience 2016 333 44 53 10.1016/j.neuroscience.2016.07.004 27421227 22 Tesfaye S. Selvarajah D. Advances in the Epidemiology, Pathogenesis and Management of Diabetic Peripheral Neuropathy Diabetes/Metabolism Research and Reviews 2012 28 8 14 10.1002/dmrr.2239 22271716 23 Malik R. A. Tesfaye S. Thompson S. D. Veves A. Sharma A. K. Boulton A. J. M. Ward J. D. Endoneurial Localisation of Microvascular Damage in Human Diabetic Neuropathy Diabetologia 1993 36 454 459 10.1007/BF00402283 8314451 24 Newrick P. G. Wilson A. J. Jakubowski J. Boulton A. J. Ward J. D. Sural Nerve Oxygen Tension in Diabetes British Medical Journal (Clinical Research Ed.) 1986 293 1053 1054 10.1136/bmj.293.6554.1053 3094772 PMC1341910 25 Hynes R. O. Integrins: Bidirectional, Allosteric Signaling Machines Cell 2002 110 673 687 10.1016/S0092-8674(02)00971-6 12297042 26 Shimaoka M. Springer T. A. Therapeutic Antagonists and Conformational Regulation of Integrin Function Nature Reviews. Drug Discovery 2003 2 703 716 10.1038/nrd1174 12951577 27 Tomaselli K. J. Doherty P. Emmett C. J. Damsky C. H. Walsh F. S. Reichardt L. F. Expression of Beta 1 Integrins in Sensory Neurons of the Dorsal Root Ganglion and Their Functions in Neurite Outgrowth on Two Laminin Isoforms Journal of Neuroscience 1993 13 4880 4888 10.1523/JNEUROSCI.13-11-04880.1993 7693896 PMC2710121 28 Wallquist W. Zelano J. Plantman S. Kaufman S. J. Cullheim S. Hammarberg H. Dorsal Root Ganglion Neurons Up-Regulate the Expression of Laminin-Associated Integrins After Peripheral but Not Central Axotomy Journal of Comparative Neurology 2004 480 162 169 10.1002/cne.20345 15514929 29 Kim S. A. Kwon S. M. Kim J. A. Kang K. W. Yoon J. H. Ahn S. G. 5’-Nitro-Indirubinoxime, an Indirubin Derivative, Suppresses Metastatic Ability of Human Head and Neck Cancer Cells Through the Inhibition of Integrin β Cancer Letters 2011 306 197 204 10.1016/j.canlet.2011.03.006 21463917 30 Wang H. J. Song G. Liang J. Gao Y. Y. Wang C. J. Involvement of Integrin β Brain Research Bulletin 2017 135 149 156 10.1016/j.brainresbull.2017.10.008 29031858 31 Benowitz L. I. Routtenberg A. GAP-43: An Intrinsic Determinant of Neuronal Development and Plasticity Trends in Neurosciences 1997 20 84 91 10.1016/S0166-2236(96)10072-2 9023877 32 Dani J. W. Armstrong D. M. Benowitz L. I. Mapping the Development of the Rat Brain by GAP-43 Immunocytochemistry Neuroscience 1991 40 277 287 10.1016/0306-4522(91)90190-Y 1711176 33 Denny J. B. Molecular Mechanisms, Biological Actions, and Neuropharmacology of the Growth-Associated Protein GAP-43 Current Neuropharmacology 2006 4 293 304 10.2174/157015906778520782 18654638 PMC2475799 34 Karns L. R. Ng S. C. Freeman J. A. Fishman M. C. Cloning of Complementary DNA for GAP-43, a Neuronal Growth-Related Protein Science 1987 236 597 600 10.1126/science.2437653 2437653 35 Audisio C. Mantovani C. Raimondo S. Geuna S. Perroteau I. Terenghi G. Neuregulin1 Administration Increases Axonal Elongation in Dissociated Primary Sensory Neuron Cultures Experimental Cell Research 2012 318 570 577 10.1016/j.yexcr.2012.01.011 22269328 36 Murphy S. P. Bielby-Clarke K. Neuregulin Signaling in Neurons Depends on ErbB4 Interaction With PSD-95 Brain Research 2008 1207 32 35 10.1016/j.brainres.2008.02.063 18374309 ",
  "metadata": {
    "Title of this paper": "Neuregulin Signaling in Neurons Depends on ErbB4 Interaction With PSD-95",
    "Journal it was published in:": "International Journal of Genomics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12455245/"
  }
}