{
  "title": "Paper_1064",
  "abstract": "pmc Medicina (Kaunas) Medicina (Kaunas) 3494 medicina medicina Medicina 1010-660X 1648-9144 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471327 PMC12471327.1 12471327 12471327 41011010 10.3390/medicina61091619 medicina-61-01619 1 Review The Receptor Tyrosine Kinase Axl in (Advanced) Gastric Cancer—From Pathophysiology to Therapeutic Impact Schreiner Oliver Daniel 1 2 3 Schreiner Thomas Gabriel 1 4 https://orcid.org/0000-0001-9087-8893 Miron Lucian 1 2 Ciobanu Romeo Cristian 3 * Nakazawa-Miklasevica Miki Academic Editor 1 schreiner.oliver-daniel@d.umfiasi.ro lucian.miron@umfiasi.ro 2 3 4 * r.c.ciobanu@tuiasi.ro 08 9 2025 9 2025 61 9 497654 1619 30 7 2025 31 8 2025 05 9 2025 08 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Published by MDPI on behalf of the Lithuanian University of Health Sciences. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background Objectives Materials and Methods Results Conclusions gastric cancer receptor tyrosine kinase Axl molecular mechanisms of Axl in tumors cancer treatment targeting Axl This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Gastric cancer (GC) remains a major global health concern, ranking as the fifth most common malignancy and the fourth leading cause of cancer-related mortality worldwide [ 1 2 3 4 5 6 6 7 RTKs play crucial roles in regulating cell proliferation, survival, migration, and differentiation [ 8 9 10 Axl, a member of the TAM family of RTKs, which additionally comprises Tyro3 and MerTK, has garnered increasing attention for its multifaceted roles in oncogenesis [ 11 12 13 14 This review aims to provide a comprehensive overview of Axl signaling in gastric cancer, with a focus on its contribution to tumor progression, immune modulation, and drug resistance. The current understanding of Axl expression and function in GC is summarized, highlighting its potential as a prognostic biomarker and evaluating emerging therapeutic strategies targeting Axl, particularly in the context of advanced disease. By elucidating the multifaceted role of Axl in gastric cancer biology, this review aims to inform future research directions and promote the development of more effective, targeted treatment approaches. 2. Materials and Methods 2.1. Literature Search Strategy A comprehensive literature search was performed in PubMed/MEDLINE, Web of Science, and Embase, covering publications from January 2000 to May 2025. The search strategy combined controlled vocabulary and free-text terms related to “gastric cancer,” “stomach neoplasms”, “Axl”, “receptor tyrosine kinase”, “immune modulation”, “drug resistance”, and “targeted therapy”. Additional references were identified by manually screening the bibliographies of relevant reviews and included articles. The review was conducted in accordance with the Preferred Reporting Items for Systematic Reviews and Meta-Analyses extension for Scoping Reviews (PRISMA-ScR). 2.2. Eligibility Criteria (PICOTS Framework) Population (P): Patients with gastric or gastroesophageal junction adenocarcinoma. Intervention (I): Studies evaluating Axl expression, signaling pathways, or therapeutic targeting of Axl (e.g., small-molecule inhibitors, monoclonal antibodies, antibody–drug conjugates). Comparator (C): Non-tumor gastric tissue, Axl-negative cohorts, standard of care, or alternative targeted therapies (when applicable). Outcomes (O): Biological function of Axl in tumor progression, immune modulation, and drug resistance; prognostic or predictive biomarker value; efficacy and safety outcomes of Axl-targeting strategies. Timing (T): No restriction on follow-up duration. Setting (S): Preclinical (cell line, animal models) and clinical studies (retrospective/prospective cohorts, trials). 2.3. Study Selection All articles retrieved from the initial search were checked for duplication, with titles and abstracts being screened independently by two reviewers. Full-text articles were then assessed for eligibility. The inclusion criteria were represented by original research articles (preclinical or clinical), clinical trials, and translational studies reporting on Axl in gastric cancer. Information from relevant new reviews was also included, particularly in the section discussing Axl’s role in gastric cancer. Exclusion criteria consisted of conference abstracts without full text, non-English articles, studies on other tumor entities without data specific to GC, and studies with insufficient methodological detail. 2.4. Data Extraction and Reviewer Agreement A standardized extraction sheet was used to collect data on study characteristics (authors, year, design, population, methods, key findings). Two reviewers (O.D.S. and T.G.S.) independently extracted data. Discrepancies were resolved by discussion; if consensus was not reached, a third reviewer (L.M.) adjudicated. 2.5. Limitations of the Scoping Review The present review has several limitations that warrant consideration. First, the available body of evidence on Axl signaling in gastric cancer is limited, with many mechanistic insights and therapeutic findings extrapolated from other malignancies. While these cross-tumor comparisons provide valuable hypotheses, they cannot substitute for gastric cancer–specific validation. Second, most data in gastric cancer derive from preclinical models or small patient cohorts, with a lack of large-scale genomic, transcriptomic, and clinical correlation studies. Third, the therapeutic relevance of Axl blockade in gastric cancer remains speculative, as clinical trial data are still largely absent. Finally, as a scoping review, our work was designed to summarize the breadth of evidence rather than systematically assess the quality of studies or the risk of bias. These limitations highlight the urgent need for dedicated mechanistic and translational studies in gastric cancer to establish whether Axl truly represents a viable biomarker and therapeutic target in this disease. 3. Axl’s Role in Gastric Cancer 3.1. Axl Structure and Ligands Axl is a member of the TAM family of receptor tyrosine kinases, characterized by their conserved domain architecture and shared ligands. The Axl receptor consists of an extracellular domain, a single transmembrane region, and an intracellular tyrosine kinase domain [ 15 16 Figure 1 The primary and best-characterized ligand for Axl is growth arrest-specific 6 (Gas6), a vitamin K-dependent protein that is structurally related to protein S [ 17 18 18 19 In addition to Gas6, recent studies have identified alternative ligands and co-regulators of Axl, including protein S and apoptotic cell-derived phosphatidylserine complexes [ 20 21 Understanding Axl’s structural features and ligand-binding dynamics is critical for the rational design of targeted therapies. Several therapeutic agents, including small-molecule inhibitors and monoclonal antibodies, aim to disrupt Axl signaling by either preventing ligand-receptor interaction or inhibiting receptor autophosphorylation, highlighting the clinical relevance of this pathway in oncogenesis. 3.2. Axl in Cancer Pathophysiology Axl plays a multifaceted role in the pathophysiology of cancer, including GC, where it contributes to several processes in the onset and evolution of the malignancy. Its activation drives key biological processes that support tumor progression, therapeutic resistance, and immune evasion. Firstly, Axl activation supports cancer cell proliferation and survival primarily through the PI3K/AKT and MAPK/ERK pathways, which regulate cell cycle progression and resistance to apoptosis [ 22 23 24 In GC cell lines, Axl overexpression is correlated with an enhanced proliferative capacity and resistance to cytotoxic stress [ 25 26 27 Regarding migration and invasion, Axl is a key driver of epithelial-to-mesenchymal transition (EMT), a process crucial for tumor invasion and metastasis [ 28 29 In gastric cancer models, Axl knockdown or inhibition has been shown to suppress cell migration and invasion in vitro, accompanied by a reversal of EMT-associated transcriptional profiles [ 16 30 Axl signaling also contributes to tumor angiogenesis, a vital process for sustained tumor growth and dissemination. Axl enhances the expression of pro-angiogenic factors such as vascular endothelial growth factor (VEGF) and interleukin-8 (IL-8), facilitating endothelial cell proliferation and new vessel formation [ 31 32 In vivo studies using xenograft models of GC have demonstrated that Axl inhibition leads to reduced microvessel density and impaired tumor vascularization, further supporting its role in angiogenesis [ 33 Finally, one of the most clinically relevant functions of Axl is its ability to drive therapeutic resistance. Axl expression is frequently upregulated in response to cytotoxic chemotherapy, targeted agents, and even immune checkpoint blockade, suggesting a role in adaptive resistance mechanisms [ 34 35 35 Mechanistically, Axl activation sustains pro-survival signaling and may induce a stem-like phenotype characterized by increased aldehyde dehydrogenase (ALDH) activity, sphere-forming capacity, and expression of stemness-associated transcription factors such as Sox2 and Nanog. These features contribute to tumor heterogeneity and plasticity, hallmarks of aggressive and treatment-refractory gastric cancers. Table 1 Figure 2 3.3. Correlation with Clinical Outcomes The clinical significance of Axl expression in GC has been increasingly recognized, particularly in the context of disease aggressiveness, therapeutic resistance, and overall patient outcomes. Accumulating evidence demonstrates a consistent association between elevated Axl expression and adverse clinical features in GC. Immunohistochemical analyses of resected GC specimens have shown that Axl is overexpressed in approximately 30–50% of cases, though prevalence rates vary depending on the detection method and cohort composition [ 36 37 38 Numerous studies have evaluated the prognostic impact of Axl expression in GC, one topic being the strong association between Axl overexpression and adverse prognostic features in GC. Notably, He et al. demonstrated that Axl and its ligand Gas6 are significantly upregulated in GC cell lines compared to normal gastric epithelial cells. Using Kaplan–Meier survival analysis, they showed that high Axl expression was significantly associated with reduced overall survival in GC patients (HR ≈ 2.2; p 38 Building on these observations, a more recent study by Zhou et al. analyzed transcriptomic data from The Cancer Genome Atlas (TCGA) and confirmed that elevated AXL mRNA levels correlated with poor clinical outcomes in a cohort of 375 patients with gastric adenocarcinoma. Multivariate Cox regression analysis identified high AXL expression as an independent predictor of overall survival, irrespective of clinicopathological variables [ 39 40 A final interesting and practically oriented aspect is related to the soluble form of Axl (sAxl), generated by proteolytic cleavage of the extracellular domain, which has emerged as a promising non-invasive biomarker. SAxl can be detected in peripheral blood, providing a dynamic readout of Axl pathway activity in real-time. Although its clinical utility in gastric cancer remains largely unexplored, mounting evidence from other solid tumors supports its potential relevance in GC. In hepatocellular carcinoma (HCC), elevated serum sAxl levels have been associated with tumor burden, vascular invasion, and poor prognosis. Reichl et al. demonstrated that sAxl levels were significantly higher in HCC patients compared to cirrhotic and healthy controls, and levels increased in tandem with disease progression and metastatic spread. Importantly, high pre-treatment sAxl predicted reduced overall survival, and dynamic changes in sAxl were reflective of treatment response, suggesting its potential for longitudinal disease monitoring [ 40 41 42 Still, Axl’s ability to be repeatedly measured from serum makes it an attractive candidate for real-time monitoring, particularly in advanced disease, where tissue access is often limited. Prospective studies in GC are needed to define the kinetics, specificity, and prognostic value of sAxl. Nevertheless, early data provide a compelling rationale for investigating sAxl as a circulating biomarker in the context of gastric cancer. Table 2 medicina-61-01619-t002_Table 2 Table 2 Correlations between Axl status and clinical outcome in gastric cancer (↑—increase in value). Axl Status/Biomarker Main Findings/Correlations Clinical Implications Relevant References High Axl expression (IHC, ~30–50% of GC cases) Associated with advanced pathological features: deeper invasion (T3–T4), lymphovascular and perineural invasion, lymph node metastasis, higher TNM stage (III–IV), poorly differentiated/diffuse histology, EMT phenotype (↑ mesenchymal markers, ↑ microvessel density). Marker of aggressiveness, invasiveness, and metastatic potential. [ 36 37 38 High Axl expression (tumor tissue—survival data) Kaplan–Meier analysis: significantly reduced overall survival (HR ~2.2, p Prognostic biomarker for poor outcome. [ 38 39 Meta-analysis (25 studies, >3000 patients, including GC) Axl overexpression correlated with worse OS (HR ≈ 2.03) and DFS (HR ≈ 1.85), and advanced TNM stage, LN involvement, distant metastasis. Broadly supports Axl as a pan-cancer poor prognostic factor, validated in GC. [ 40 Soluble Axl (sAxl, serum) Elevated levels linked to tumor burden, vascular invasion, poor survival, and treatment response in HCC, melanoma, PDAC. Not yet validated in GC, but mechanistically plausible. Promising non-invasive biomarker for real-time disease monitoring in GC (prospective validation needed). [ 41 42 43 4. Therapeutic Targeting of Axl in Gastric Cancer 4.1. Axl Inhibitors in Development The blockade of Axl signaling represents a promising therapeutic avenue in GC, particularly in combating chemoresistance, metastasis development, and immune evasion. Pharmacological strategies include small molecules targeting the kinase domain of Axl, monoclonal antibodies directed against Axl or its ligand Gas6, and combination treatments integrating Axl inhibition with chemotherapy, immunotherapy, or other targeted agents. Among the small molecule inhibitors, worth mentioning are Bemcentinib (R428/BGB324) and TP-0903. R428 is the most extensively studied selective Axl inhibitor, with an IC 50 44 45 46 44 47 48 49 49 50 51 Monoclonal antibodies and decoy receptors represent another relevant class. Therapeutics targeting the extracellular Axl–Gas6 axis have advanced into preclinical and early clinical stages. 20G7-D9, an antibody against Axl, reduced Gas6-induced Akt activation, EMT marker expression, and tumor growth in pancreatic and breast cancer xenografts [ 52 53 54 55 NCT02988817 NCT03425279 56 57 Figure 3 4.2. Preclinical Evidence in Gastric Cancer Preclinical studies have provided evidence supporting the therapeutic targeting of Axl in GC. A range of experimental approaches, including genetic silencing, small molecule inhibitors, and combination strategies, have demonstrated that Axl plays a crucial role in promoting tumor cell survival, proliferation, invasion, and resistance to therapy in both in vitro and in vivo models of GC. One relevant preclinical study on Axl in GC was conducted by Bae et al. [ 58 58 The potential for pharmacological inhibition of Axl was further supported by studies using dual tyrosine kinase inhibitors targeting both MET and Axl. Given that co-activation of MET and Axl is commonly observed in gastric tumors, researchers evaluated the effects of combined inhibition in GC cell lines and xenograft models. A good example is the study by Zhu et al., which investigated the effects of LY2801653, a dual MET and AXL inhibitor, on gastric cancer. LY2801653 demonstrated inhibition of cancer cell proliferation, migration, and epithelial–mesenchymal transition (EMT), as well as induction of apoptosis and cell cycle arrest. In mouse models, it significantly reduced tumor growth, especially in tumors with high MET and AXL expression. At higher doses, LY2801653 also affected tumors lacking MET/AXL expression by reducing angiogenesis and M2 macrophages in the tumor microenvironment. Overall, the study supports MET and AXL as prognostic biomarkers and highlights LY2801653 as a promising therapeutic option for gastric cancer [ 56 In addition to single-agent activity, Axl inhibitors have shown promise in combination with chemotherapeutic agents. Although much of the combination data stems from other malignancies, the mechanistic rationale applies strongly to gastric cancer. In models of breast and lung cancer, treatment with the selective Axl inhibitor R428 (bemcentinib) in combination with cisplatin resulted in enhanced tumor suppression and delayed metastatic spread compared to monotherapy. The synergy is thought to arise from the ability of Axl inhibition to prevent chemotherapy-induced activation of survival pathways such as AKT and STAT3, which are frequently upregulated in chemoresistant GC cells. Extrapolating to gastric cancer, where resistance to platinum and fluoropyrimidine-based regimens is a major clinical challenge, Axl inhibition may sensitize tumor cells to cytotoxic agents by disrupting the protective signaling networks [ 45 Recent studies have also focused on identifying molecular subtypes of GC that may be particularly susceptible to Axl inhibition. Hu et al., 2024 [ 59 59 This preclinical data (summarized in Table 3 4.3. Clinical Trials While most clinical development of Axl inhibitors has focused on other cancer types, the literature on GC remains scarce. Several trials have directly included gastric cancer (GC), particularly through dual or multi-kinase inhibitors with Axl activity. The most compelling GC-specific clinical data come from a phase I/II trial of LY2801653 (Merestinib), an oral ATP-competitive inhibitor targeting both MET and Axl. In a preclinical study by Zhu et al., LY2801653 demonstrated potent anti-proliferative, anti-EMT, anti-angiogenic, and apoptosis-inducing effects in gastric carcinoma models [ 58 NCT01285037 60 Another study evaluated CT053PTSA, a novel multi-target TKI against MET, Axl, and VEGFR2, in a phase I dose-escalation trial involving patients with advanced solid tumors, including GC. Preclinical work in SNU-5 and MKN-45 xenograft models demonstrated dose-dependent inhibition of tumor growth, along with excellent pharmacokinetic and safety profiles. The Phase I trial showed acceptable tolerability up to 150 mg daily, although recruitment was not restricted to patients with gastric cancer [ 61 Additionally, cabozantinib, an oral TKI targeting MET, VEGFR2, and Axl, is being studied in combination with the anti-PD-L1 agent durvalumab in advanced gastroesophageal cancers, including gastric cancer, in a phase I/II open-label multi-cohort trial ( NCT03539822 36 In summary, while no trials to date have used Axl-selective agents in GC-exclusive cohorts, emerging data from multi-kinase inhibitors that include Axl strongly support its therapeutic relevance in gastric cancer. The safety and preliminary efficacy signals from Merestinib, CT053PTSA, cabozantinib, and the BioSeedin agent provide a solid foundation for future trials of selective Axl inhibitors or combination regimens in GC. Priorities for future clinical investigation should include selective Axl-targeted agents and combinations that exploit synergistic opportunities, such as immunotherapy or anti-MET approaches, in biomarker-enriched GC populations. 4.4. Combination Strategies Recent preclinical studies have provided compelling mechanistic evidence that Axl inhibition enhances the efficacy of the PD-1/PD-L1 immune checkpoint blockade, offering a promising combination strategy for GC, where immune resistance and immunosuppressive microenvironments are current challenges. One key study demonstrated that pharmacologic blockade or genetic knockout of Axl in murine syngeneic tumor models significantly potentiates antitumor immune responses when combined with anti–PD-1 therapy. In immunocompetent breast cancer models, Axl deletion resulted in increased CD8 + 62 Similar results were reported by Yeo et al. [ 63 + + At the molecular level, Axl signaling has been linked to upregulation of PD-L1 expression in multiple tumor types [ 64 65 + Moreover, studies in pancreatic and lung carcinoma models combining Axl inhibitors (e.g., SKI-G-801, BGB324) with standard chemotherapy and anti–PD–1 therapy have shown enhanced tumor control, associated with increased memory T cells and activated macrophages, alongside a reduction in regulatory T cells [ 66 Although direct clinical data in gastric cancer are pending, the pronounced immunomodulatory effects observed with Axl blockade in other tumor models—restoring T-cell presence, lowering checkpoint ligand expression, and improving response to PD-1/PD-L1 therapy—strongly support clinical exploration of this combination strategy in GC. Given the immunosuppressive tumor microenvironment and high PD-L1 expression in many GC tumors, integrating Axl inhibitors with immune checkpoint blockade holds significant promise. The incorporation of immune profiling, soluble Axl (sAxl) levels, and PD-L1 expression as biomarkers may further refine patient selection and enhance therapeutic outcomes in future clinical trials. 5. Axl, Tumor Microenvironment, and Therapeutic Implications Another clinically and therapeutically relevant aspect of Axl is its influence, which extends beyond cancer cell-intrinsic signaling to significantly remodel the tumor microenvironment (TME). One of its primary ligands, GAS6, is abundantly secreted by tumor-associated macrophages (TAMs), endothelial cells, and fibroblasts within the TME [ 18 27 67 Axl functions as a central node in a complex signaling network and often engages in crosstalk with other receptor tyrosine kinases (RTKs), including MET, HER2, and EGFR [ 13 68 69 13 EGFR signaling is also modulated by Axl through both direct and indirect mechanisms. Axl can activate EGFR-independent pathways that converge on shared downstream effectors such as SRC, STAT3, and NF-κB, thereby sustaining oncogenic signaling under therapeutic pressure [ 70 Despite promising preclinical and early clinical data, resistance to Axl-targeted therapies has emerged as a significant challenge. Mechanisms of resistance include, in a great manner, secondary mutations. Mutations within the Axl kinase domain may reduce drug binding affinity or confer constitutive activation, resulting in the loss of inhibitor sensitivity [ 71 72 The TME can directly support resistance through cytokine-mediated signaling or cellular interactions. For example, TAM-derived GAS6 can sustain Axl activation even in the presence of receptor blockades, while cancer-associated fibroblasts (CAFs) can modulate extracellular membrane (ECM) remodeling and stiffness, influencing receptor localization and signaling dynamics [ 73 Axl expression and activation status could emerge as both prognostic and predictive biomarkers in GC. High Axl expression might be associated with advanced stage, lymph node metastasis, and reduced overall survival [ 74 p 14 Emerging data also suggest that co-expression of Axl and other RTKs (e.g., MET, HER2) may predict sensitivity to dual or multi-kinase inhibition strategies [ 74 6. Conclusions and Future Directions With the increasing unfavorable epidemiological data related to GC, novel biomarkers and therapeutic targets must be explored. In this context, Axl could be a desirable molecule that plays a significant role in the pathogenesis and progression of gastric cancer by promoting tumor cell survival, proliferation, epithelial-to-mesenchymal transition, angiogenesis, and therapeutic resistance. Its activation through ligands such as Gas6 triggers multiple oncogenic pathways, contributing to immune evasion and tumor aggressiveness. Clinically, Axl overexpression might correlate with advanced disease features and poor prognosis, making it a valuable prognostic biomarker and potential therapeutic target. The soluble form of Axl (sAxl), detectable in blood, also could show promise as a non-invasive biomarker for disease monitoring. Together, these insights underscore the importance of Axl in gastric cancer biology and support ongoing efforts to target this pathway in precision oncology strategies. Therapeutic targeting of Axl in GC has gained momentum, supported by preclinical data and emerging clinical evidence. Small-molecule inhibitors, monoclonal antibodies, and decoy receptors have demonstrated efficacy in inhibiting Axl-driven processes, including EMT, metastasis, and immune evasion. Dual MET/Axl inhibitors, such as LY2801653 and CT053PTSA, have shown promising activity in gastric cancer models and early-phase trials. Furthermore, combination strategies—particularly those involving immune checkpoint inhibitors—have demonstrated synergistic effects in various tumor types, thereby enhancing CD8 + Furthermore, Axl plays a critical role in reshaping the tumor microenvironment in gastric cancer, promoting immune evasion, therapy resistance, and tumor progression through the GAS6–Axl axis. By fostering an immunosuppressive milieu—characterized by increased M2-like macrophages, Tregs, and reduced antigen presentation—Axl contributes to poor immune infiltration and elevated PD-L1 expression, making it a prime candidate for combination with immune checkpoint inhibitors. Its extensive crosstalk with MET, HER2, and EGFR underscores its role in signaling redundancy and resistance to targeted therapies. However, resistance to Axl inhibitors can arise via secondary mutations, bypass signaling, and persistent TME-mediated activation. As both a prognostic and predictive biomarker, Axl expression, along with phospho-Axl, GAS6 levels, and EMT-related gene signatures, can inform patient stratification and therapeutic response. These insights advocate for integrative, biomarker-driven approaches to Axl-targeted therapy, especially in combination with RTK or immune-based regimens, to overcome resistance and optimize outcomes in gastric cancer. The development of more selective and potent Axl inhibitors represents a critical next step in advancing targeted therapies for gastric cancer. Current agents, while promising, are often limited by off-target effects, resistance mechanisms, and suboptimal activity in biomarker-unselected populations. To accelerate clinical translation, several research priorities should be emphasized. First, comprehensive biomarker development is essential, including prospective validation of Axl expression, phospho-Axl activity, and circulating sAxl levels as predictive tools for patient selection. Second, rational trial design should integrate Axl inhibitors with standard-of-care chemotherapy, immunotherapy, or HER2/MET inhibitors, guided by preclinical evidence of synergy. Furthermore, mechanistic studies are needed to clarify resistance mechanisms, such as compensatory RTK activation or TME-mediated immunosuppression, that may limit therapeutic efficacy. Finally, early-phase, biomarker-enriched gastric cancer trials should be prioritized to bridge the gap between promising preclinical findings and clinical applicability. Additionally, comparative multi-omics approaches (proteomics, phosphoproteomics, and single-cell transcriptomics) should be applied to identify GC-specific Axl-driven subtypes, which may facilitate the development of precision strategies rather than broad, unstratified treatment approaches. Future efforts should prioritize the design of next-generation inhibitors with enhanced specificity, improved pharmacokinetics, and the ability to overcome known resistance pathways. Additionally, alternative strategies such as antibody–drug conjugates, bispecific antibodies, and ligand traps offer complementary avenues to inhibit Axl signaling. Incorporating these innovations into biomarker-guided clinical trials will be essential to fully realize the therapeutic potential of Axl targeting in gastric cancer. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, methodology, O.D.S. and T.G.S.; formal analysis, investigation, data curation, O.D.S., T.G.S., R.C.C. and L.M.; writing—original draft preparation, O.D.S. and R.C.C.; writing—review and editing, R.C.C.; supervision, L.M. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement All data are available in the manuscript. Conflicts of Interest The authors declare no conflicts of interest. References 1. Machlowska J. Baj J. Sitarz M. Maciejewski R. Sitarz R. Gastric Cancer: Epidemiology, Risk Factors, Classification, Genomic Characteristics and Treatment Strategies Int. J. Mol. Sci. 2020 21 4012 10.3390/ijms21114012 32512697 PMC7312039 2. Yang W.-J. Zhao H.-P. Yu Y. Wang J.-H. Guo L. Liu J.-Y. Pu J. Lv J. Updates on global epidemiology, risk and prognostic factors of gastric cancer World J. Gastroenterol. 2023 29 2452 2468 10.3748/wjg.v29.i16.2452 37179585 PMC10167900 3. Siegel R.L. Miller K.D. Jemal A. Cancer statistics, 2020 CA Cancer J. Clin. 2020 70 7 30 10.3322/caac.21590 31912902 4. Wonglhow J. Tantipisit J. Wetwittayakhlang P. Sunpaweravong P. Sathitruangsak C. Kanjanapradit K. Thongwatchara P. Dechaphunkul A. Association Between Epstein-Barr Virus Infection and PD-L1 Expression in Gastric Cancer: Prevalence, Clinicopathological Features, and Prognostic Implications Cancers 2025 17 1492 10.3390/cancers17091492 40361419 PMC12070931 5. Dienstmann R. Ruiz-García E. Alsina M. Ruiz-Pace F. Schooten T.G.-V. Martínez-Ciarpaglini C. Fernández-Figueroa E. Herrera-Goepfert R. Díaz-Romero C. Lino-Silva L. Integrated clinico-molecular analysis of gastric cancer in European and Latin American populations: LEGACY project ESMO Open 2025 10 104482 10.1016/j.esmoop.2025.104482 40036904 PMC11926697 6. Suh Y.-S. Na D. Lee J.-S. Chae J. Kim E. Jang G. Lee J. Min J. Ock C.-Y. Kong S.-H. Comprehensive Molecular Characterization of Adenocarcinoma of the Gastroesophageal Junction Between Esophageal and Gastric Adenocarcinomas Ann. Surg. 2022 275 706 717 10.1097/SLA.0000000000004303 33086305 7. Hua X. Bi X.-W. Zhao J.-L. Shi Y.-X. Lin Y. Wu Z.-Y. Zhang Y.-Q. Zhang L.-H. Zhang A.-Q. Huang H. Trastuzumab Plus Endocrine Therapy or Chemotherapy as First-line Treatment for Patients with Hormone Receptor-Positive and HER2-Positive Metastatic Breast Cancer (SYSUCC-002) Clin. Cancer Res. 2022 28 637 645 10.1158/1078-0432.CCR-21-3435 34810217 PMC9377763 8. Zhang N. Li Y. Receptor tyrosine kinases: Biological functions and anticancer targeted therapy MedComm 2023 4 e446 10.1002/mco2.446 38077251 PMC10701465 9. Yamaguchi H. Nagamura Y. Miyazaki M. Receptor Tyrosine Kinases Amplified in Diffuse-Type Gastric Carcinoma: Potential Targeted Therapies and Novel Downstream Effectors Cancers 2022 14 3750 10.3390/cancers14153750 35954414 PMC9367326 10. Liu Y.J. Shen D. Yin X. Gavine P. Zhang T. Su X. Zhan P. Xu Y. Lv J. Qian J. HER2, MET and FGFR2 oncogenic driver alterations define distinct molecular segments for targeted therapies in gastric carcinoma Br. J. Cancer 2014 110 1169 1178 10.1038/bjc.2014.61 24518603 PMC3950883 11. Wium M. Ajayi-Smith A.F. Paccez J.D. Zerbini L.F. The Role of the Receptor Tyrosine Kinase Axl in Carcinogenesis and Development of Therapeutic Resistance: An Overview of Molecular Mechanisms and Future Applications Cancers 2021 13 1521 10.3390/cancers13071521 33806258 PMC8037968 12. Engelsen A.S.T. Lotsberg M.L. Khouzam R.A. Thiery J.-P. Lorens J.B. Chouaib S. Terry S. Dissecting the Role of AXL in Cancer Immune Escape and Resistance to Immune Checkpoint Inhibition Front. Immunol. 2022 13 869676 10.3389/fimmu.2022.869676 35572601 PMC9092944 13. Yadav M. Sharma A. Patne K. Tabasum S. Suryavanshi J. Rawat L. Machaalani M. Eid M. Singh R.P. Choueiri T.K. AXL signaling in cancer: From molecular insights to targeted therapies Signal Transduct. Target. Ther. 2025 10 37 10.1038/s41392-024-02121-7 39924521 PMC11808115 14. Repici A. Ardizzone A. De Luca F. Colarossi L. Prestifilippo A. Pizzino G. Paterniti I. Esposito E. Capra A.P. Signaling Pathways of AXL Receptor Tyrosine Kinase Contribute to the Pathogenetic Mechanisms of Glioblastoma Cells 2024 13 361 10.3390/cells13040361 38391974 PMC10886920 15. Tang Y. Zang H. Wen Q. Fan S. AXL in cancer: A modulator of drug resistance and therapeutic target J. Exp. Clin. Cancer Res. 2023 42 148 10.1186/s13046-023-02726-w 37328828 PMC10273696 16. Zhu C. Wei Y. Wei X. AXL receptor tyrosine kinase as a promising anti-cancer approach: Functions, molecular mechanisms and clinical applications Mol. Cancer 2019 18 153 10.1186/s12943-019-1090-3 31684958 PMC6827209 17. Sasaki T. Knyazev P.G. Clout N.J. Cheburkin Y. Göhring W. Ullrich A. Timpl R. Hohenester E. Structural basis for Gas6-Axl signalling EMBO J. 2006 25 80 87 10.1038/sj.emboj.7600912 16362042 PMC1356355 18. Zhai X. Pu D. Wang R. Zhang J. Lin Y. Wang Y. Zhai N. Peng X. Zhou Q. Li L. Gas6/AXL pathway: Immunological landscape and therapeutic potential Front. Oncol. 2023 13 1121130 10.3389/fonc.2023.1121130 37265798 PMC10231434 19. Apostolo D. D’onghia D. Nerviani A. Ghirardi G.M. Sola D. Perazzi M. Tonello S. Colangelo D. Sainaghi P.P. Bellan M. Could Gas6/TAM Axis Provide Valuable Insights into the Pathogenesis of Systemic Sclerosis? Curr. Issues Mol. Biol. 2024 46 7486 7504 10.3390/cimb46070444 39057085 PMC11275301 20. Lemke G. Phosphatidylserine Is the Signal for TAM Receptors and Their Ligands Trends Biochem. Sci. 2017 42 738 748 10.1016/j.tibs.2017.06.004 28734578 PMC5600686 21. Martínez-Bosch N. Cristóbal H. Iglesias M. Gironella M. Barranco L. Visa L. Calafato D. Jiménez-Parrado S. Earl J. Carrato A. Soluble AXL is a novel blood marker for early detection of pancreatic ductal adenocarcinoma and differential diagnosis from chronic pancreatitis EBioMedicine 2022 75 103797 10.1016/j.ebiom.2021.103797 34973624 PMC8724936 22. Loureiro G. Bahia D.M. Lee M.L.M. de Souza M.P. Kimura E.Y.S. Rezende D.C. Silva M.C.d.A. Chauffaille M.d.L.L.F. Yamamoto M. MAPK/ERK and PI3K/AKT signaling pathways are activated in adolescent and adult acute lymphoblastic leukemia Cancer Rep. 2023 6 e1912 10.1002/cnr2.1912 PMC10728523 37867416 23. Kim C.-W. Lee J.M. Park S.W. Divergent roles of the regulatory subunits of class IA PI3K Front. Endocrinol. 2024 14 1152579 10.3389/fendo.2023.1152579 PMC10839044 38317714 24. Scaltriti M. Elkabets M. Baselga J. Molecular Pathways: AXL, a Membrane Receptor Mediator of Resistance to Therapy Clin. Cancer Res. 2016 22 1313 1317 10.1158/1078-0432.CCR-15-1458 26763248 PMC4957976 25. Liu Y. Xu L. Dou Y. He Y. AXL: Shapers of tumor progression and immunosuppressive microenvironments Mol. Cancer 2025 24 11 10.1186/s12943-024-02210-9 39799359 PMC11724481 26. Ryu Y.-S. Shin S. An H.-G. Kwon T.-U. Baek H.-S. Kwon Y.-J. Chun Y.-J. Synergistic Induction of Apoptosis by the Combination of an Axl Inhibitor and Auranofin in Human Breast Cancer Cells Biomol Ther 2020 28 473 481 10.4062/biomolther.2020.051 PMC7457171 32536618 27. Hung C.-N. Chen M. DeArmond D.T. Chiu C.H.-L. Limboy C.A. Tan X. Kusi M. Chou C.-W. Lin L.-L. Zhang Z. AXL-initiated paracrine activation of pSTAT3 enhances mesenchymal and vasculogenic supportive features of tumor-associated macrophages Cell Rep. 2023 42 113067 10.1016/j.celrep.2023.113067 37659081 PMC10577802 28. Asiedu M.K. Beauchamp-Perez F.D. Ingle J.N. Behrens M.D. Radisky D.C. Knutson K.L. AXL induces epithelial-to-mesenchymal transition and regulates the function of breast cancer stem cells Oncogene 2014 33 1316 1324 10.1038/onc.2013.57 23474758 PMC3994701 29. Liu F. Gu L.-N. Shan B.-E. Geng C.-Z. Sang M.-X. Biomarkers for EMT and MET in breast cancer: An update Oncol. Lett. 2016 12 4869 4876 10.3892/ol.2016.5369 28105194 PMC5228449 30. Tan X. Yan Y. Song B. Zhu S. Mei Q. Wu K. Focal adhesion kinase: From biological functions to therapeutic strategies Exp. Hematol. Oncol. 2023 12 83 10.1186/s40164-023-00446-7 37749625 PMC10519103 31. Tanaka M. Siemann D.W. Axl signaling is an important mediator of tumor angiogenesis Oncotarget 2019 10 2887 2898 10.18632/oncotarget.26882 31080559 PMC6499597 32. Sperb N. Tsesmelis M. Wirth T. Crosstalk between Tumor and Stromal Cells in Pancreatic Ductal Adenocarcinoma Int. J. Mol. Sci. 2020 21 5486 10.3390/ijms21155486 32752017 PMC7432853 33. Lei X. Chen M. Nie Q. Hu J. Zhuo Z. Yiu A. Chen H. Xu N. Huang M. Ye K. In vitro and in vivo antiangiogenic activity of desacetylvinblastine monohydrazide through inhibition of VEGFR2 and Axl pathways Am. J. Cancer Res. 2016 6 843 858 Erratum in Am. J. Cancer Res. 2023 13 27186435 PMC4859888 34. Rosell R. Karachaliou N. Morales-Espinosa D. Costa C. Molina M.A. Sansano I. Gasco A. Viteri S. Massuti B. Wei J. Adaptive resistance to targeted therapies in cancer Transl. Lung. Cancer Res. 2013 2 152 159 10.3978/j.issn.2218-6751.2012.12.08 25806228 PMC4367602 35. Adam-Artigues A. Arenas E.J. Martínez-Sabadell A. Brasó-Maristany F. Cervera R. Tormo E. Hernando C. Martínez M.T. Carbonell-Asins J. Simón S. Targeting HER2-AXL heterodimerization to overcome resistance to HER2 blockade in breast cancer Sci. Adv. 2022 8 eabk2746 10.1126/sciadv.abk2746 35594351 PMC9122332 36. Pidkovka N. Belkhiri A. Altered expression of AXL receptor tyrosine kinase in gastrointestinal cancers: A promising therapeutic target Front. Oncol. 2023 13 1079041 10.3389/fonc.2023.1079041 37469409 PMC10353021 37. Ho H. Cheng C.-Y. Huang C.-Y. Chu S.-E. Liang Y.-J. Sun J.-T. Chen Y.-L. Association Between Phosphorylated AXL Expression and Survival in Patients with Gastric Cancer J. Clin. Med. 2024 13 6694 10.3390/jcm13226694 39597836 PMC11595014 38. Zhou J. Kong Q. Liu X. Huang Y. Integrated analysis of myeloperoxidase in gastric health and cancer: Associations with pepsinogen levels, immune regulation, and prognosis in a large healthy population-based and TCGA cohorts Front. Immunol. 2025 16 1590257 10.3389/fimmu.2025.1590257 40547041 PMC12179060 39. Zhang S. Xu X.S. Yang J.X. Guo J.H. Chao T.F. Tong Y. The prognostic role of Gas6/Axl axis in solid malignancies: A meta-analysis and literature review Onco Targets Ther. 2018 11 509 519 10.2147/OTT.S150952 29416351 PMC5789043 40. Reichl P. Mikulits W. Accuracy of serum Axl as a biomarker for early and advanced hepatocellular carcinoma J. Hepatol. 2015 62 48 55 41. Flem-Karlsen K. McFadden E. Ann Flørenes V. Davidson B. Soluble AXL is a marker of disease progression and prognosis in malignant melanoma PLoS ONE 2020 15 e0227187 10.1371/journal.pone.0227187 31917795 PMC6952099 42. Martinez-Bosch N. Cristóbal H. Iglesias M. Gironella M. Barranco L. Visa L. Calafato D. Jiménez-Parrado S. Earl J. Carrato A. Soluble AXL as a novel diagnostic biomarker for pancreatic cancer: Improving the performance of CA 19–9 Mol. Oncol. 2021 15 885 901 43. Kimani S.G. Kumar S. Bansal N. Singh K. Kholodovych V. Comollo T. Peng Y. Kotenko S.V. Sarafianos S.G. Bertino J.R. Small molecule inhibitors block Gas6-inducible TAM activation and tumorigenicity Sci. Rep. 2017 7 43908 10.1038/srep43908 28272423 PMC5341070 44. Holland S.J. Pan A. Franci C. Hu Y. Chang B. Li W. Duan M. Torneros A. Yu J. Heckrodt T.J. R428, a selective small molecule inhibitor of Axl kinase, blocks tumor spread and prolongs survival in models of metastatic breast cancer Cancer Res. 2010 70 1544 1554 10.1158/0008-5472.CAN-09-2997 20145120 45. Chen F. Song Q. Yu Q. Axl inhibitor R428 induces apoptosis of cancer cells by blocking lysosomal acidification and recycling independent of Axl inhibition Am. J. Cancer Res. 2018 8 1466 1482 30210917 PMC6129480 46. Yang R. Li Y. Wang H. Qin T. Yin X. Ma X. Therapeutic progress and challenges for triple negative breast cancer: Targeted therapy and immunotherapy Mol. Biomed. 2022 3 8 10.1186/s43556-022-00071-6 35243562 PMC8894518 47. Kubasch A.S. Peterlin P. Cluzeau T. Götze K.S. Sockel K. Teipel R. Jentzsch M. Attalah H. Sebert M. Chermat F. Efficacy and safety of bemcentinib in patients with advanced myelodysplastic neoplasms or acute myeloid leukemia failing hypomethylating agents- the EMSCO phase II BERGAMO trial Leukemia 2023 37 2309 2313 10.1038/s41375-023-02029-1 37735558 PMC10624604 48. Zhang Y. Arner E.N. Rizvi A. Toombs J.E. Huang H. Warner S.L. Foulks J.M. Brekken R.A. AXL Inhibitor TP-0903 Reduces Metastasis and Therapy Resistance in Pancreatic Cancer Mol. Cancer Ther. 2022 21 38 47 10.1158/1535-7163.MCT-21-0293 34675118 PMC8742768 49. Sakemura R.L. Hefazi M. Cox M.J. Siegler E.L. Sinha S. Hansen M.J. Stewart C.M. Feigin J.M. Roman C.M. Schick K.J. AXL Inhibition Improves the Antitumor Activity of Chimeric Antigen Receptor T Cells Cancer Immunol. Res. 2023 11 1222 1236 10.1158/2326-6066.CIR-22-0254 37378662 PMC10530462 50. Wu X. Liu X. Koul S. Lee C.Y. Zhang Z. Halmos B. AXL kinase as a novel target for cancer therapy Oncotarget 2014 5 9546 9563 10.18632/oncotarget.2542 25337673 PMC4259419 51. Leconet W. Chentouf M. du Manoir S. Chevalier C. Sirvent A. Aït-Arsa I. Busson M. Jarlier M. Radosevic-Robin N. Theillet C. Therapeutic Activity of Anti-AXL Antibody against Triple-Negative Breast Cancer Patient-Derived Xenografts and Metastasis Clin. Cancer Res. 2017 23 2806 2816 10.1158/1078-0432.CCR-16-1316 27923843 52. Chang H.W. Wang J. Liu H. Xing C. Chen J. Frey G. Boyle W.J. Short J.M. Preclinical development of mecbotamab vedotin (BA3011), a novel, AXL-specific conditional active biologic antibody-drug conjugate Antib. Ther. 2025 8 145 156 10.1093/abt/tbaf006 40491605 PMC12146481 53. Boshuizen J. Koopman L.A. Krijgsman O. Shahrabi A. van den Heuvel E.G. A Ligtenberg M.A. Vredevoogd D.W. Kemper K. Kuilman T. Song J.-Y. Cooperative targeting of melanoma heterogeneity with an AXL antibody-drug conjugate and BRAF/MEK inhibitors Nat. Med. 2018 24 203 212 10.1038/nm.4472 29334371 54. Tanaka M. Siemann D.W. Therapeutic Targeting of the Gas6/Axl Signaling Pathway in Cancer Int. J. Mol. Sci. 2021 22 9953 10.3390/ijms22189953 34576116 PMC8469858 55. Kariolis M.S. Miao Y.R. Diep A. Nash S.E. Olcina M.M. Jiang D. Jones D.S. 2nd Kapur S. Mathews I.I. Koong A.C. Inhibition of the GAS6/AXL pathway augments the efficacy of chemotherapies J. Clin. Investig. 2017 127 183 198 10.1172/JCI85610 27893463 PMC5199716 56. Fuh K.C. Bookman M.A. Liu J.F. Coleman R.L. Herzog T.J. Thaker P.H. Monk B.J. Anderson R. McIntyre G. Rangwala R. Phase 1b study of AVB-500 in combination with paclitaxel or pegylated liposomal doxorubicin platinum-resistant recurrent ovarian cancer Gynecol. Oncol. 2021 163 254 261 10.1016/j.ygyno.2021.08.020 34474927 57. Bae C.A. Ham I.-H. Oh H.J. Lee D. Woo J. Son S.-Y. Yoon J.H. Lorens J.B. Brekken R.A. Kim T.-M. Inhibiting the GAS6/AXL axis suppresses tumor progression by blocking the interaction between cancer-associated fibroblasts and cancer cells in gastric carcinoma Gastric Cancer 2020 23 824 836 10.1007/s10120-020-01066-4 32239298 58. Zhu C. Shi H. Wu M. Wei X. A dual MET/AXL small-molecule inhibitor exerts efficacy against gastric carcinoma through killing cancer cells as well as modulating tumor microenvironment MedComm 2020 1 103 118 10.1002/mco2.11 34766112 PMC8489669 59. Hu C. Song J. Kwok T. Nguyen E.V. Shen X. Daly R.J. Proteome-based molecular subtyping and therapeutic target prediction in gastric cancer Mol. Oncol. 2024 18 1437 1459 10.1002/1878-0261.13654 38627210 PMC11161736 60. Ma Y.-X. Liu F.-R. Zhang Y. Chen Q. Chen Z.-Q. Liu Q.-W. Huang Y. Yang Y.-P. Fang W.-F. Xi N. Preclinical characterization and phase I clinical trial of CT053PTSA targets MET, AXL, and VEGFR2 in patients with advanced solid tumors Front. Immunol. 2022 13 1024755 10.3389/fimmu.2022.1024755 36341335 PMC9632963 61. Son H.Y. Jeong H.K. Immune Evasion Mechanism and AXL Front. Oncol. 2021 11 756225 10.3389/fonc.2021.756225 34778071 PMC8581356 62. Yeo X.H. Sundararajan V. Wu Z. Phua Z.J.C. Ho Y.Y. Peh K.L.E. Chiu Y.C. Tan T.Z. Kappei D. Ho Y.S. The effect of inhibition of receptor tyrosine kinase AXL on DNA damage response in ovarian cancer Commun Biol. 2023 6 660 Erratum in Commun Biol. 2023 6 10.1038/s42003-023-05045-0 37349576 PMC10287694 63. Vandewalle N. De Beule N. De Becker A. De Bruyne E. Menu E. Vanderkerken K. Breckpot K. Devoogdt N. De Veirman K. AXL as immune regulator and therapeutic target in Acute Myeloid Leukemia: From current progress to novel strategies Exp. Hematol. Oncol. 2024 13 99 10.1186/s40164-024-00566-8 39367387 PMC11453060 64. Sadahiro H. Kang K.D. Gibson J.T. Minata M. Yu H. Shi J. Chhipa R. Chen Z. Lu S. Simoni Y. Activation of the Receptor Tyrosine Kinase AXL regulates the Immune Microenvironment in Glioblastoma Cancer Res. 2018 78 3002 3013 10.1158/0008-5472.CAN-17-2433 29531161 PMC5984695 65. Lee W. Kim D.K. Synn C.-B. Lee H.K. Park S. Jung D.-S. Choi Y. Kim J.H. Byeon Y. Kim Y.S. Incorporation of SKI-G-801, a Novel AXL Inhibitor, With Anti-PD-1 Plus Chemotherapy Improves Anti-Tumor Activity and Survival by Enhancing T Cell Immunity Front. Oncol. 2022 12 821391 10.3389/fonc.2022.821391 35356198 PMC8959645 66. Rayford A. Gärtner F. Ramnefjell M.P. Lorens J.B. Micklem D.R. Aanerud M. Engelsen A.S.T. AXL expression reflects tumor-immune cell dynamics impacting outcome in non-small cell lung cancer patients treated with immune checkpoint inhibitor monotherapy Front. Immunol. 2024 15 1444007 10.3389/fimmu.2024.1444007 39238637 PMC11375292 67. Marino F.Z. Della Corte C.M. Ciaramella V. Erra S. Ronchi A. Fiorelli A. Vicidomini G. Santini M. Scognamiglio G. Morgillo F. AXL and MET Tyrosine Kinase Receptors Co-Expression as a Potential Therapeutic Target in Malignant Pleural Mesothelioma J. Pers. Med. 2022 12 1993 10.3390/jpm12121993 36556214 PMC9783837 68. Li W. Xiong X. Abdalla A. Alejo S. Zhu L. Lu F. Sun H. HGF-induced formation of the MET-AXL-ELMO2-DOCK180 complex promotes RAC1 activation, receptor clustering, and cancer cell migration and invasion J. Biol. Chem. 2018 293 15397 15418 10.1074/jbc.RA118.003063 30108175 PMC6177597 69. Meyer A.S. Miller M.A. Gertler F.B. Lauffenburger D.A. The receptor AXL diversifies EGFR signaling and limits the response to EGFR-targeted inhibitors in triple-negative breast cancer cells Sci. Signal. 2013 6 ra66 10.1126/scisignal.2004155 23921085 PMC3947921 70. Auyez A. Sayan A.E. Kriajevska M. Tulchinsky E. AXL Receptor in Cancer Metastasis and Drug Resistance: When Normal Functions Go Askew Cancers 2021 13 4864 10.3390/cancers13194864 34638349 PMC8507788 71. Xiao Z. Hammes S.R. AXL cooperates with EGFR to mediate neutrophil elastase-induced migration of prostate cancer cells iScience 2021 24 103270 10.1016/j.isci.2021.103270 34761189 PMC8567381 72. Kanzaki R. Naito H. Kise K. Takara K. Eino D. Minami M. Shintani Y. Funaki S. Kawamura T. Kimura T. Gas6 derived from cancer-associated fibroblasts promotes migration of Axl-expressing lung cancer cells during chemotherapy Sci. Rep. 2017 7 10613 10.1038/s41598-017-10873-2 28878389 PMC5587707 73. Wang L. Liu K. Yu J. Sun E. A retrospective analysis of the correlation between AXL expression and clinical outcomes of patients with urothelial bladder carcinoma Transl. Cancer Res. 2019 8 976 984 10.21037/tcr.2019.06.06 35116837 PMC8798078 74. Iweala E.E.J. Amuji D.N. Oluwajembola A.M. Ugbogu E.A. Targeting c-Met in breast cancer: From mechanisms of chemoresistance to novel therapeutic strategies Curr. Res. Pharmacol. Drug Discov. 2024 7 100204 10.1016/j.crphar.2024.100204 39524211 PMC11543557 Figure 1 Axl structure and functional pathways in gastric cancer (used with agreement from Engelsen et al. [ 12 Figure 2 Axl-related pathways and the most relevant biological processes, applicable also in the case of gastric cancer (used with agreement from Tang et al. [ 15 Figure 3 Axl inhibitors currently in development (suitable for the treatment of gastric cancer). medicina-61-01619-t001_Table 1 Table 1 Most relevant roles of Axl in (gastric) cancer pathophysiology—a qualitative analysis. Biological Process Mechanism of Axl Involvement Related Pathways Potential Implications in GC Cell proliferation and survival Activation of PI3K/AKT and MAPK/ERK pathways via recruitment of p85 and Grb2 PI3K, AKT, MAPK, ERK Promotes cell cycle progression, inhibits apoptosis, supports tumor growth Apoptosis resistance Upregulates anti-apoptotic proteins (e.g., BCL-2, Cyclin D1), downregulates pro-apoptotic proteins (e.g., BAX) AKT, STAT3 Confers resistance to cisplatin and other chemotherapies Migration and invasion (EMT) Induction of EMT transcription factors (Snail, Twist); modulation of cell adhesion and cytoskeletal dynamics Vimentin, N-cadherin, E-cadherin, Rac1, RhoA, FAK Enhances metastatic potential and invasiveness Angiogenesis Induces pro-angiogenic cytokines (e.g., VEGF, IL-8); enhances crosstalk with endothelial cells VEGF, IL-8, pericyte interactions Supports tumor vascularization and growth Therapeutic resistance Upregulation after treatment; heterodimerization with HER2, MET, FGFR2 sustains survival signaling despite therapy PI3K/AKT, MAPK, HER2, MET, FGFR2 Resistance to trastuzumab, TKIs, and chemotherapy; associated with poor outcomes medicina-61-01619-t003_Table 3 Table 3 Preclinical evidence for Axl targeting in (gastric) cancer (→—determines the following process; ↑—increase in value). Study Design/Approach Most Relevant Conclusions Potential Therapeutic/Translational Implications Bae et al., 2020 [ 57 GC cell lines + CAF co-culture; Axl inhibition (genetic, BGB324); patient tissue analysis CAF-derived GAS6 activates Axl → ↑ migration, survival, EMT; Axl inhibition reverses effects; P-Axl correlates with poor prognosis Supports Axl inhibition (e.g., BGB324) as a strategy to target CAF-driven aggressiveness in GC Zhu et al., LY2801653 study [ 58 Dual Axl/MET inhibitor in GC cell lines and xenografts Inhibits proliferation, migration, EMT; induces apoptosis; decreased tumor growth in high MET/AXL models; decreased angiogenesis and M2 TAMs Dual MET/AXL inhibition may benefit Axl+/MET+ GC; reduces tumor microenvironment support R428 + chemotherapy (cross-cancer data) [ 45 Breast/lung cancer models; extrapolated to GC Axl inhibition prevents AKT/STAT3 activation by chemotherapy; enhances cisplatin efficacy and delays metastasis Supports combining Axl inhibitors with standard chemotherapy in GC to overcome drug resistance Hu et al., 2024 (Phosphoproteomics) [ 59 MS-based analysis of GC cell lines and subtypes Identifies EMT and metabolism subtypes; Axl activity enriched in EMT subtype; subtype-specific kinase vulnerabilities Axl inhibitors may be especially effective in mesenchymal/EMT-enriched GC subtypes ",
  "metadata": {
    "Title of this paper": "Targeting c-Met in breast cancer: From mechanisms of chemoresistance to novel therapeutic strategies",
    "Journal it was published in:": "Medicina",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471327/"
  }
}