{
  "title": "Paper_97",
  "abstract": "pmc Front Bioinform Front Bioinform 4317 fbinf Front. Bioinform. Frontiers in Bioinformatics 2673-7647 Frontiers Media SA PMC12488637 PMC12488637.1 12488637 12488637 10.3389/fbinf.2025.1630161 1630161 1 Methods Quantitative measures to assess the quality of cellular indexing of transcriptomes and epitopes by sequencing data Sun et al. 10.3389/fbinf.2025.1630161 Sun Jie  1  † Writing – review & editing Software Visualization Methodology Formal analysis Morrison Robert  2  3  4  † Conceptualization Writing – review & editing Software Visualization Kim Soyeon  5 Conceptualization Writing – original draft Yan Kairuo  6 Validation Writing – review & editing Park Hyun Jung  1 * Methodology Conceptualization Funding acquisition Writing – original draft Writing – review & editing  1 Department of Human Genetics, School of Public Health, University of Pittsburgh Pittsburgh PA United States  2 Department of Medicine and Division of Hematology/Oncology, University of Pittsburgh, School of Medicine Pittsburgh PA United States  3 Department of Immunology, University of Pittsburgh, School of Medicine Pittsburgh PA United States  4 Department of Computational and Systems Biology, University of Pittsburgh Medical Center Pittsburgh PA United States  5 Division of Pulmonary Medicine, Department of Pediatrics, UPMC Children’s Hospital of Pittsburgh, University of Pittsburgh Pittsburgh PA United States  6 Department of Computer Science, Northeastern University Boston MA United States * hyp15@pitt.edu † These authors have contributed equally to this work 18 9 2025 2025 5 481848 1630161 17 5 2025 29 7 2025 18 09 2025 03 10 2025 03 10 2025 Copyright © 2025 Sun, Morrison, Kim, Yan and Park. 2025 Sun, Morrison, Kim, Yan and Park https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY) Background Cellular indexing of transcriptomes and epitopes by sequencing (CITE-Seq) is a powerful technique to simultaneously measure gene expression and cell surface protein abundances in individual cells. To obtain accurate and reliable biological findings from CITE-Seq data, it is critical to ensure rigorous quality control (QC). However, no public method has yet been developed for CITE-Seq QC. Results In this study, we propose the first software package for multi-layered, systemic, and quantitative quality control (CITESeQC). Recognizing the multi-layered nature of CITE-Seq data, CITESeQC performs QC across gene expressions, surface proteins, and their interactions. It systemically evaluates all genes and protein markers assayed in the data and filters out some of them based on individual quality measures. Furthermore, for quantitative QC that enables objective and standardized analyses, CITESeQC quantifies cell type-specific expression of genes and surface proteins using Shannon entropy and correlation-based measures. Finally, to ensure broad applicability, CITESeQC guides users through a simple process that generates a complete markdown report with supporting figures and explanations, requiring minimal user intervention. Conclusion By quantifying the quality of CITE-Seq data, CITESeQC enables precise characterization of gene expression within cell types and reliable classification of cell types using surface protein markers, thereby enhancing its value for clinical applications. CITE-Seq quality control (QC) multi-omics integration biomarker discovery computational software The author(s) declare that financial support was received for the research and/or publication of this article. This work was supported by the UPMC Hillman Cancer Center Biostatistics Shared Resource, which is supported in part by award P30CA047904 and R01GM108618 from the NIH. This work was also supported by the Hillman Cancer Center Career Enhancement Program Award (P50 CA254865-01). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Single Cell Bioinformatics Background While traditional single-cell RNA-seq techniques assay only gene expression by capturing and sequencing RNA molecules, cellular indexing of transcriptomes and epitopes by sequencing (CITE-Seq) assays both RNA molecules and surface proteins of interest simultaneously by utilizing unique DNA-barcoded antibodies, also known as “antibody-derived tags (ADTs).” Since cell surface proteins serve as markers and communicators of a cell’s identity and function, CITE-Seq data enable the identification not only of cell-type specific gene expression patterns but also of cell types defined by specific surface proteins that may be used for further clinical applications. For example, although some immune cell types, such as γ/δ T cells ( Zakeri et al., 2022 Li et al., 2023 Jacquelot et al., 2022 Geh et al., 2022 Stoeckius et al., 2017 Hao et al., 2021 Mazzurana et al., 2021 Scheyltjens et al., 2022 Stoeckius et al., 2017 To ensure high-quality discoveries from CITE-Seq data, the first critical step is to control the quality (QC) of the input CITE-Seq data. For QC of CITE-Seq data, previous studies performed a limited set of analyses, and there was no standalone method. To develop a desirable standalone method for CITE-Seq QC, we recognize the following three limitations in the current CITE-Seq studies. First, some studies performed QC only at the RNA level, e.g., in terms of either transcriptome library size ( Butler et al., 2018 Stuart et al., 2021 Hong et al., 2022 Grob et al., 2023 Subramanian et al., 2022 Nettersheim et al., 2022 Granja et al., 2019 In this study, we introduce CITESeQC, the first software package specifically designed to provide a comprehensive and interpretable set of quantitative metrics for assessing the quality of CITE-Seq data. Rather than performing direct filtering or removal of cells or features, CITESeQC serves as a diagnostic framework that guides users in making informed quality control (QC) decisions tailored to their dataset. CITESeQC supports multi-layered QC by offering seven modules for evaluating RNA or protein data individually and five additional modules for assessing cross-modality relationships, such as RNA–protein consistency. To ensure systematic coverage, these 12 modules collectively assess all genes and surface proteins in the dataset while flagging low-quality features using individual QC metrics. For quantitative evaluation, CITESeQC computes Shannon entropy to assess cell type-specific expression patterns and correlation coefficients to capture expected relationships between gene expression and protein abundance. Designed for broad usability, CITESeQC guides users through a streamlined process that generates a complete markdown report, including informative visualizations and interpretations, with minimal user intervention. This flexible, user-guided approach enables researchers to evaluate data quality in a nuanced and biologically informed manner—supporting both standardized workflows and exploratory analyses—without relying on rigid, pre-defined thresholds. Results CITESeQC quantifies various aspects of CITE-Seq quality CITESeQC provides 12 R modules to assess the quality of RNAs, surface proteins, and their interactions in multiple aspects and one R module to define cell clusters or import cell cluster definitions ( Figure 1 1. “RNA_read_corr()” produces a scatterplot correlating the number of molecules/genes with the number of genes identified in the transcriptome. Since the cutoffs for good-quality cells will be passed as the arguments to the function, users can modify them for their data. Default values are from the Seurat-guided clustering tutorial. Spearman’s correlation coefficient is calculated to allow users to test the hypothesis that the total number of genes increases with the number of detected genes in the transcriptome. 2. “ADT_read_corr()” produces a scatterplot correlating the number of detected ADTs with the total number of ADT molecules identified on the cell surfaces. Since the cutoffs identifying good-quality cells are annotated on the plot as passed as the arguments of the function, users can modify them for their data. Default values are from the Seurat-guided clustering tutorial. Spearman’s correlation coefficient is calculated to allow users to test the hypothesis that the total number of ADT molecules increases with the number of detected ADTs on the cell surface. 3. “RNA_mt_read_corr()” produces a scatterplot correlating the number of genes identified in the transcriptome with the percentage of the mitochondrial genes. Spearman’s correlation coefficient is calculated to allow users to test the hypothesis that the mitochondrial percentage remains constant regardless of the number of identified molecules. 4. “def_clust()” either defines the cell clusters based on the input gene expression matrix or imports the definition. To define the cell clusters, it employs the Seurat package with the input clustering resolution. For each cell cluster, whether defined internally or imported, this function identifies marker genes for later use. 5. “RNA_dist()” visualizes the specificity of the input gene expression across the cell clusters defined or imported using def_clust(). For quantification and comparison, it calculates Shannon entropy on the expression distribution across clusters, which is defined as follows:  H n o r m a l i z e d = − 1 log 2 N ∑ i = 1 n p i ⁡ log 2 p i N 6. “multiRNA_hist()” is a histogram of Shannon entropy values of the marker genes identified in def_clust(). The histogram displays the specificity of marker genes across clusters. Users can modify the number of marker genes. A histogram peak at high entropy values suggests that the marker genes lack specificity. 7. “ADT_dist()” visualizes the specificity of the input ADT abundance across the cell clusters. Specifically, it calculates normalized Shannon entropy on the expression distribution across clusters. Note that the clusters were defined based on gene expression unless provided by the users. 8. “multiADT_hist()” is a histogram of normalized Shannon entropy values of all ADTs identified for the cell clusters. The histogram displays the specificity of ADT markers across clusters. Note that the clusters were defined based on gene expression unless provided by the users. A histogram peak at high entropy values suggests that the marker genes lack specificity. 9. “RNA_ADT_read_corr()” produces a scatterplot showing the correlation between the number of assayed genes in the transcriptome and the number of assayed cell surface proteins across the cells. Spearman’s correlation coefficient is calculated to allow users to test the hypothesis that the number of assayed proteins increases with the number of assayed genes. 10. “RNA_ADT_UMAP_corr()” produces pairs of UMAP plots and a scatterplot. Each UMAP plot pair is drawn for the abundance of the input ADT and the corresponding gene expression, respectively. The scatterplot plots the abundance of ADTs and the expression of the RNAs of the input gene. 11. “RNA_ADT_cluster_corr()” is a set of scatterplots, each drawn for each cell cluster, showing the correlation between input ADT abundance and the corresponding gene expression for the cluster. 12. “RNA_ADT_hist()” is a histogram of the correlation coefficients in all pairs of ADTs and the corresponding genes in expression. 13. “RNA_ADT_cluster_hist()” is a set of histograms, each showing the distribution of the correlation coefficients in all pairs of ADTs and the corresponding genes for each cell cluster. FIGURE 1 Illustrative categorization of the 12 R functions in CITESeQC. The additional def_clust() function needs to be run before running functions in “with cell clusters” category. Grid diagram categorizing analyses by color: white for prerequisites, blue for correlation, red for distribution, and purple for distribution on correlation. Categories include RNA only, ADT only, and RNA+ADT, further divided into analyses without and with cell clusters such as RNA_read_corr and RNA_dist. CITESeQC interpretation of diagnostic quality metrics We demonstrate the applicability of CITESeQC using two example CITE-Seq datasets from healthy donors. The first comprises peripheral blood mononuclear cells (PBMCs), and the second comprises cord blood mononuclear cells (CBMCs). On the datasets, three functions beginning with either “RNA” or “ADT” and ending with “read_corr” inspect the correlation between the total number of reads and those aligned with RNAs or proteins across cells, enabling users to test whether the alignment process contributes to the quality. CITESeQC calculates Spearman’s correlation coefficient and a permutation-based p Supplementary Figures S1A–C, 2A–C Figures 2A,B Figures 2C–E Figures 2D–F Figures 2F,G,S Figures 2G,H Supplementary Figures S1D–G, 3, 4, 5 Supplementary Figures S6, 7 FIGURE 2 CITESeQC functions showing and quantifying relative abundance distribution of (A) (B) (C) (D) (E) (F) (G) Panel A shows a line graph of Shannon entropy for the gene CCR7, with clusters labeled on the x-axis and entropy values on the y-axis. Panel B displays a similar graph for the gene CST7. Panels C and D are UMAP plots showing data distribution, with color gradients representing expression levels for different genes. Panel E is another UMAP plot, showing clusters in distinct colors, each with a numerical label. Panels F and G present bar charts depicting entropy frequency distributions with entropy on the x-axis and frequency on the y-axis. Systematic evaluation of CITESeQC’s sensitivity to technical noise in CITE-Seq data To show how CITESeQC detects systemic errors, we performed two controlled noise-injection experiments using 10% of the cells randomly selected in the PBMC dataset. First, to simulate noise introduced by systemic disruptions in feature-count relationships, we shuffled expression values for 5%, 10%, and 20% of RNA features and 10%, 20%, and 30% of ADT features. We selected higher percentages for ADT data to ensure a noticeable effect despite its smaller feature set (33,538 RNAs vs. 17 ADTs). For RNA, each condition was repeated 10 times; for ADT, 50 times for statistical significance and computational efficiency. To quantify the noise effect, CITESeQC calculates Spearman’s correlation between nFeature (the number of unique genes or proteins detected in a cell) and nCount (total count per cell). In high-quality data, these metrics are expected to show a strong positive correlation—cells with more detected features tend to have higher total counts. Our shuffling strategy is to preserve cell-level relationships while disrupting the gene- or protein-level relationships. In the results, we observed a consistent decrease in correlation values with increasing levels of noise for both RNA and ADT ( Figures 3A,B p Figure 3C p Figure 3D FIGURE 3 Spearman’s correlation of 10% randomly selected cells in the PBMC dataset estimated between nFeature and nCount of (A) (B) (C) (D) Graphs showing correlation and density analysis. (A) Box plots of Spearman correlation for RNA, with percentages shuffled, showing a decrease in correlation with increased shuffling. (B) Similar box plots for ADT, revealing a similar pattern with higher initial correlation. (C) Density plot for RNA showing Shannon entropy with varying distributions at different shuffled percentages. (D) Density plot for ADT displaying the impact of shuffling on Shannon entropy distribution, with notable peaks. CITESeQC facilitates marker specificity analysis To demonstrate how CITESeQC’s quantitative measures can improve downstream biological analysis, we systematically determined a Shannon entropy cutoff to assess the specificity of marker genes. Specifically, we focused on defining an empirical threshold that distinguishes truly cluster-specific markers from background, non-specific genes. To establish this threshold, we first randomly selected 1,000 expressed RNAs (>5 in average expression) that were not differentially expressed across any clusters in the PBMC dataset to serve as a negative control. We then calculated the Shannon entropy of these non-marker genes across pre-defined clusters. Because these genes are expected to be broadly and non-specifically expressed, their entropy distribution reflects a null distribution of non-specific expression. We defined the marker specificity cutoff as the 5th percentile of this distribution (i.e., the left tail), identifying entropy values below this threshold as statistically specific. We then applied this empirical cutoff to evaluate the top 10, 20, and 30 RNA markers (ranked by differential expression p-value) identified in our analysis ( Supplementary Figure S8 Supplementary Table S1 Discussion The CITESeQC package is the first software package that assesses the quality of CITE-Seq data in terms of the individual RNAs, surface proteins, and their interactions. For quantitative evaluation, CITESeQC computes Shannon entropy and RNA–ADT correlation coefficients—two biologically informed metrics. Although entropy itself is designed to quantify expression distribution and is not a direct indicator of technical quality, it becomes informative about data quality when applied to marker genes or proteins. In high-quality CITE-Seq data, well-established cell type markers—such as CD3 for T cells or CD19 for B cells—should exhibit low entropy, with expression localized to the expected clusters. If these canonical markers instead show unexpectedly high entropy—that is, broadly or randomly distributed expression—it may suggest technical issues such as ambient RNA contamination that causes marker expression to bleed into unrelated clusters, poor clustering resolution that reflects insufficient transcriptomic signal, or antibody non-specificity or background staining in the ADT layer. Similarly, for a subset of well-characterized, high-expression surface markers, a moderate to strong positive correlation between mRNA and protein levels is expected in biologically consistent and technically sound CITE-Seq data. When known concordant markers exhibit unexpectedly low or erratic correlations, it can suggest technical artifacts such as antibody dropout or mislabeling, droplet barcoding or ambient tag misassignment, or batch effects or sample degradation. CITESeQC does not use these metrics to impose strict thresholds or automatically discard features; instead, it provides them as diagnostic tools to allow users to distinguish between meaningful biological heterogeneity and technical noise. Altogether, we provide a comprehensive set of computational QC measures for CITE-Seq data that assess and quantify various aspects of data quality at both individual RNA and protein levels and in their interactions. To determine the quality of a CITE-Seq dataset using the quantitative measures provided by CITESeQC, the next step is to determine appropriate cutoff values for each measure. However, establishing some cutoff values is not straightforward. For example, measures correlating RNAs with their corresponding surface proteins depend not only on data quality but also on the translation efficiency of the RNAs. Even for datasets of same quality, translation efficiency can vary across biological contexts due to post-transcriptional regulatory processes such as alternative polyadenylation and competing endogenous RNAs ( Fan, et al., 2020 Kim, et al., 2020 Park, et al., 2018 Methods CITESeQC in user-friendly R markdown CITESeQC (version 0.9.1) is an R package with minimal prerequisites and is publicly available at https://github.com/sunjie001130/CITESeQC Experiment data PBMCs, which have a single round nucleus, include lymphocytes (T cells, B cells, and NK cells) and monocytes isolated from peripheral blood. We downloaded the dataset from https://www.10xgenomics.com/ https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE100866 Acknowledgements This research was supported in part by the University of Pittsburgh Center for Research Computing, RRID:SCR_022735, through the resources provided. Specifically, this work used the HTC cluster, which is supported by NIH award number S10OD028483.  Edited by: Lin Wan  Reviewed by: Jingyi Cao  Zidong Zhang Data availability statement The original contributions presented in the study are included in the article/ Supplementary Material Ethics statement Ethical approval was not required for the study involving humans in accordance with the local legislation and institutional requirements. Written informed consent to participate in this study was not required from the participants or the participants’ legal guardians/next of kin in accordance with the national legislation and the institutional requirements. Author contributions JS: Writing – review and editing, Software, Visualization, Methodology, Formal analysis. RM: Conceptualization, Writing – review and editing, Software, Visualization. SK: Conceptualization, Writing – original draft. KY: Validation, Writing – review and editing. HP: Methodology, Conceptualization, Funding acquisition, Writing – original draft, Writing – review and editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fbinf.2025.1630161/full#supplementary-material SUPPLEMENTARY FIGURE S1 CITESeQC functions based on correlation drawn for the example PBMC CITE-Seq dataset. (A) p (B) (C) (D) (E) (F) (G) SUPPLEMENTARY FIGURE S2 CITESeQC functions based on correlation drawn for the example CBMC CITE-Seq dataset. (A) p (B) p (C) (D) (E) (F) (G) SUPPLEMENTARY FIGURE S3 Set of scatterplots (A-O) SUPPLEMENTARY FIGURE S4 CITESeQC functions on the example CBMC dataset showing the distribution of (A) (B) (C) (D) SUPPLEMENTARY FIGURE S5 Set of scatterplots (A-R) SUPPLEMENTARY FIGURE S6 Set of histograms for PBMC data, each showing the distribution of the correlation coefficients in all pairs of ADTs and the corresponding genes across all cell clusters (A) (B-P) SUPPLEMENTARY FIGURE S7 Set of histograms for CBMC data, each showing the distribution of the correlation coefficients in all pairs of ADTs and the corresponding genes for each cell cluster (A-R) SUPPLEMENTARY FIGURE S8 Shannon entropy density plot of marker genes across defined clusters of RNAs after 5%, 10%, and 20% shuffling in 10% randomly selected cells of the (A) (B) References Butler A. Hoffman P. Smibert P. Papalexi E. Satija R. 2018 Integrating single-cell transcriptomic data across different conditions, technologies, and species Nat. Biotechnol. 36 411 420 10.1038/nbt.4096 29608179 PMC6700744 Fan Z. Kim S. Bai Y. Diergaarde B. Park H. J. 2020 3'-UTR shortening contributes to subtype-specific cancer growth by breaking stable ceRNA crosstalk of housekeeping genes Front. Bioeng. Biotechnol. 8 334 10.3389/fbioe.2020.00334 32411683 PMC7201092 Geh D. Leslie J. Rumney R. Reeves H. L. Bird T. G. Mann D. A. 2022 Neutrophils as potential therapeutic targets in hepatocellular carcinoma Nat. Rev. Gastroenterol. Hepatol. 19 4 257 273 10.1038/s41575-021-00568-5 35022608 Granja J. M. Klemm S. McGinnis L. M. Kathiria A. S. Mezger A. Corces M. R. 2019 Single-cell multiomic analysis identifies regulatory programs in mixed-phenotype acute leukemia Nat. Biotechnol. 37 12 1458 1465 10.1038/s41587-019-0332-7 31792411 PMC7258684 Grob L. Bertolini A. Carrara M. Lischetti U. Tastanova A. Beisel C. 2023 gExcite: a start-to-end framework for single-cell gene expression, hashing, and antibody analysis Bioinformatics 39 5 btad329 10.1093/bioinformatics/btad329 37220897 PMC10229235 Hao Y. Hao S. Andersen-Nissen E. Mauck W. M. III Zheng S. Butler A. 2021 Integrated analysis of multimodal single-cell data Cell 184 3573 3587.e29 10.1016/j.cell.2021.04.048 34062119 PMC8238499 Hong R. Koga Y. Bandyadka S. Leshchyk A. Wang Y. Akavoor V. 2022 Comprehensive generation, visualization, and reporting of quality control metrics for single-cell RNA sequencing data Nat. Commun. 13 1 1688 10.1038/s41467-022-29212-9 35354805 PMC8967915 Jacquelot N. Seillet C. Vivier E. Belz G. T. 2022 Innate lymphoid cells and cancer Nat. Immunol. 23 3 371 379 10.1038/s41590-022-01127-z 35228695 Kim S. Bai Y. Fan Z. Diergaarde B. Tseng G. C. Park H. J. 2020 The microRNA target site landscape is a novel molecular feature associating alternative polyadenylation with immune evasion activity in breast cancer Briefings Bioinforma. 22 bbaa191 10 10.1093/bib/bbaa191 32844230 PMC8138879 Li Y. R. Zhou K. Wilson M. Kramer A. Zhu Y. Dawson N. 2023 Mucosal-associated invariant T cells for cancer immunotherapy Mol. Ther. 31 3 631 646 10.1016/j.ymthe.2022.11.019 36463401 PMC10014234 Mazzurana L. Czarnewski P. Jonsson V. Wigge L. Ringnér M. Williams T. C. 2021 Tissue-specific transcriptional imprinting and heterogeneity in human innate lymphoid cells revealed by full-length single-cell RNA-sequencing Cell Res. 31 5 554 568 10.1038/s41422-020-00445-x 33420427 PMC8089104 Nettersheim F. S. Armstrong S. S. Durant C. Blanco-Dominguez R. Roy P. Orecchioni M. 2022 Titration of 124 antibodies using CITE-Seq on human PBMCs Sci. Rep. 12 1 20817 10.1038/s41598-022-24371-7 36460735 PMC9718773 Park H. J. Ji P. Kim S. Xia Z. Rodriguez B. Li L. 2018 3' UTR shortening represses tumor-suppressor genes in trans by disrupting ceRNA crosstalk Nat. Genet. 50 6 783 789 10.1038/s41588-018-0118-8 29785014 PMC6689271 Scheyltjens I. Van Hove H. De Vlaminck K. Kancheva D. Bastos J. Vara-Pérez M. 2022 Single-cell RNA and protein profiling of immune cells from the mouse brain and its border tissues Nat. Protoc. 17 10 2354 2388 10.1038/s41596-022-00716-4 35931780 Stoeckius M. Hafemeister C. Stephenson W. Houck-Loomis B. Chattopadhyay P. K. Swerdlow H. 2017 Simultaneous epitope and transcriptome measurement in single cells Nat. methods 14 865 868 10.1038/nmeth.4380 28759029 PMC5669064 Stuart T. Srivastava A. Madad S. Lareau C. A. Satija R. 2021 Single-cell chromatin state analysis with Signac Nat. Methods 18 11 1333 1341 10.1038/s41592-021-01282-5 34725479 PMC9255697 Subramanian A. Alperovich M. Yang Y. Li B. 2022 Biology-inspired data-driven quality control for scientific discovery in single-cell transcriptomics Genome Biol. 23 1 267 10.1186/s13059-022-02820-w 36575523 PMC9793662 Zakeri N. Hall A. Swadling L. Pallett L. J. Schmidt N. M. Diniz M. O. 2022 Characterisation and induction of tissue-resident gamma delta T-cells to target hepatocellular carcinoma Nat. Commun. 13 1 1372 10.1038/s41467-022-29012-1 35296658 PMC8927126 ",
  "metadata": {
    "Title of this paper": "Characterisation and induction of tissue-resident gamma delta T-cells to target hepatocellular carcinoma",
    "Journal it was published in:": "Frontiers in Bioinformatics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488637/"
  }
}