{
  "title": "Paper_430",
  "abstract": "pmc Asia Pac J Oncol Nurs Asia Pac J Oncol Nurs 3090 apjon Asia-Pacific Journal of Oncology Nursing 2347-5625 2349-6673 Elsevier PMC12483648 PMC12483648.1 12483648 12483648 41036181 10.1016/j.apjon.2025.100782 S2347-5625(25)00130-1 100782 1 Original Article Symptom clusters and sentinel symptoms during post-transplant recovery in recipients of allogeneic hematopoietic stem cell transplantation: A cross-sectional study Xu Ping a b c Ding Shuyi a b Zheng Li a Cheng Yin a b Ye Yishan b Li Lin b Li Zhiru a Tao Yuexian c Wang Huafen 2185015@zju.edu.cn a ⁎ a b c ⁎ 2185015@zju.edu.cn 12 2025 01 9 2025 12 477402 100782 5 5 2025 27 8 2025 01 09 2025 01 10 2025 02 10 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Objective This study explored symptom clusters and sentinel symptoms among recipients of allogeneic hematopoietic stem cell transplantation (allo-HSCT) during the recovery period, with the aim of identifying clustering patterns and establishing a clinical reference framework for early detection and management. Methods A convenience sample of 209 hematologic oncology recipients who had completed allo-HSCT and were in the recovery phase, attending regular outpatient follow-up in China between December 2024 and March 2025, was recruited. Data were collected using a general information questionnaire and the Chinese version of the Memorial Symptom Assessment Scale. Symptom clusters were identified through exploratory factor analysis, and sentinel symptoms were determined via association analysis using the Apriori algorithm. Results A total of 209 allo-HSCT recipients were included, with a median age of 39.6 years (interquartile range [IQR] 33.7–48.2) and a median time from diagnosis to transplantation of 6.0 months (IQR 4.8–9.8). During recovery, recipients reported a median of 5 symptoms (IQR 3–9), with a maximum of 18 concurrent symptoms. The most prevalent symptoms were lack of energy (56.5%), worrying (43.5%), and difficulty sleeping (42.1%), with median severity scores of 3.0 (IQR 1.0–4.0), 3.0 (IQR 1.0–4.0), and 2.0 (IQR 1.0–3.0), respectively. Exploratory factor analysis (Kaiser-Meyer-Olkin [KMO] ​= ​0.737; Bartlett's χ 2 P Conclusions Recipients of allo-HSCT continue to experience diverse symptoms during recovery, which aggregate into distinct clusters. Importantly, three sentinel symptoms act as early indicators that markedly impair quality of life. Nurses should prioritize these sentinel symptoms as key intervention targets to guide precision nursing strategies, mitigate symptom progression, and improve clinical outcomes. Keywords Algorithms Hematopoietic stem cell transplantation Recovery of function Symptom assessment Cluster analysis pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Hematologic malignancies (HM), characterized by high aggressiveness, rapid progression, and significant treatment challenges, now rank as the fourth most prevalent type of cancer worldwide. 1 2 3 4 5 6 7 Symptom clusters are defined as two or more clinically interrelated symptoms that co-occur temporally while maintaining distinct phenomenological characteristics. 8 9 10 11 12 , 13 14 15 16 17 18 , 19 To identify actionable targets for symptom cluster interventions, Brown et al. 20 21 22 23 24 25 Methods Study design and participants This cross-sectional study aimed to investigate the symptom clusters and sentinel symptoms in recipients during the recovery phase following allo-HSCT, with the dual objectives of characterizing symptom clustering patterns and establishing clinical references for early identification and management. The Strengthening the Reporting of Observational Studies in Epidemiology (STROBE) Statement 26 Supplementary File 1 Sample size The sample size was determined based on requirements for exploratory factor analysis, 27 F i n a l s a m p l e s i z e = I n i t i a l s a m p l e s i z e 1 − expected non − response / incompletion rate = 160 1 − 0.10 = 160 0.9 ≈ 178 The final required sample size was calculated to be at least 178 participants. Data collection After screening allo-HSCT recipients through the hospital's electronic medical record system to confirm their eligibility based on inclusion/exclusion criteria, researchers trained in unison contacted recipients by phone. The research team consisted of nursing graduate students, HSCT nurses, and experts in the transplant field. Interviews were conducted in a dedicated, quiet room within the department, equipped with a designated follow-up telephone. Although participants attended outpatient follow-ups, we prioritized telephone interviews to avoid prolonging clinic visits, accommodate unpredictable recovery schedules of allo-HSCT recipients, minimize infection risks for immunocompromised individuals, and ensure standardized symptom assessment across diverse locations, with quality assurance provided by trained nursing postgraduates. After screening allo-HSCT recipients through the hospital's electronic medical record system to confirm eligibility based on inclusion/exclusion criteria, members of the research team contacted eligible recipients by phone. The research team comprised three graduate nursing researchers (two master's candidates and one PhD candidate), four senior HSCT clinical nurses holding advanced professional titles (Chief Nurse/Associate Chief Nurse/Supervisor Nurse), and two HSCT physicians (MD/PhD), thus combining research execution capabilities with specialized HSCT clinical expertise. The telephone survey interviews were primarily conducted by two of the graduate student researchers, while the senior clinical nurses and physicians provided crucial support through participant screening, oversight and guidance, and subsequent in-depth analyses. To ensure effectiveness and accuracy, recipients were contacted in advance. Researchers politely identified themselves, stated the purpose of the call, inquired about the recipient's availability, and provided an estimated duration for the interview to allow for scheduling. Before commencing the interview, researchers confirmed the participants' environment was suitable and free from excessive distractions to safeguard data quality and reliability. At the start of the call, researchers ensured participants fully understood the study purpose, procedures, and data confidentiality measures. The procedure involved reiterating the research purposes using plain-language explanations, verifying participant comprehension through structured feedback (e.g., “Could you summarize your expected involvement?”), and documenting verbal authorization via dual investigator signatures on consent forms. Additional clarifications were provided as necessary, with strict adherence to voluntary participation principles and privacy protection protocols throughout. All participants received explicit assurances that their data would remain confidential and be used strictly for academic purposes, emphasizing that there were no right or wrong responses and underscoring the imperative of capturing authentic experiences in their own words. Researchers ensured participants understood each item, clarifying any questions promptly to guarantee data authenticity and completeness. The questionnaire comprised two sections: recipient self-reports (demographic characteristics and the Chinese version of the Memorial Symptom Assessment Scale) and physician-reported medical data extracted from the EMR system. To ensure response accuracy, a bidirectional “question-confirmation” communication model was employed. Researchers inquired about items interactively, providing real-time clarification when necessary. The average interview duration was 15 minutes. During questioning, researchers recorded in real-time the frequency, severity, and distress of symptoms reported by the recipient. For data quality assurance, researchers implemented centralized daily verification of all collected questionnaires. A dual verification protocol for all questionnaires post-collection, including reconciling discrepancies through follow-up communications, cross-validating responses with medical records, and verifying or supplementing incomplete/contradictory data through direct participant confirmation. Data deemed invalid due to apparent carelessness during the interview or significant inconsistencies with electronic medical record records were excluded. All datasets were anonymized according to de-identification standards prior to database entry, with strict adherence to privacy protection protocols throughout the process. From 212 attempted telephone interviews, 209 completed surveys met quality criteria (3 excluded due to non-response to core items stemming from physiological barriers like oral mucositis/pain and psychological mechanisms including distrust and symptom concealment), yielding a 98.58% valid response rate. This rigorous methodology ensured reliable capture of both subjective recipient's experiences and objective clinical parameters while maintaining ethical research standards. Measures Demographic information questionnaire Designed by the research team, the form covers demographic data (age, gender, registration, marital status, education, number of children, insurance type) and disease-related information (hematologic malignancy type, interval from diagnosis to transplant, pre-transplant relapses, chemotherapy cycles, pre-transplant condition, donor relationship, ABO compatibility). Memorial Symptom Assessment Scale-Chinese version (MSAS-Ch) Developed by the Memorial Sloan Kettering Cancer Center and adapted into Chinese by scholars like Cheng, 28 29 Validity and reliability This study followed the Strengthening the Reporting of Observational Studies in Epidemiology (STROBE) guidelines. In accordance with research ethical guidelines, all study participants provided informed consent. ensuring adherence to appropriate standards for human research. Methods and procedures were conducted in compliance with relevant regulations and guidelines stated in the declaration. The scales used in the study had good reliability and validity. Strict quality control was performed during data collection, including investigator training, standardization of assessment tools and guidelines and screening of participants according to inclusion and exclusion criteria. The investigators ensured completeness, accuracy and authenticity of the data, promptly addressing any missing data by communicating with the recipients. Data analysis We established a database using EpiData 3.1 and conducted statistical analyses with SPSS Statistics 26.0 and SPSS Modeler 18.0. Quantitative data following a normal distribution were presented as mean ​± ​standard deviation (Mean ​± ​SD), while data that did not follow a normal distribution were presented as median (interquartile range) [ M P 25 P 75 Results Participant characteristics This study included 209 eligible allo-HSCT recipients, predominantly from Eastern China with a small proportion from Central and Southern China. The cohort was aged 16–59 years with a median age of 39.60 [33.65, 48.15] years. Time from diagnosis to transplantation ranged from 1.9 to 201.2 months (median 6.00 [4.80, 9.75] months). Additional demographics and clinical characteristics are detailed in Table 1 Table 1 Sample demographics and clinical characteristics of allo-HSCT recipients ( N Table 1 Variables Frequency (%) Sex Male 100 (47.8) Female 109 (52.2) Registered residence Urban 80 (38.3) Rural 129 (61.7) Age (years) ≤ ​29 18 (8.6) 30∼ 74 (35.4) 40∼ 62 (29.7) ≥ ​50 55 (26.3) Marital status Single 25 (12.0) Married 179 (85.6) Divorced 5 (2.4) Number of children 0 35 (16.7) 1 93 (44.5) 2 77 (36.8) ≥ ​3 4 (1.9) Education Primary school or below 25 (12.0) Junior high school 46 (22.0) High school or secondary specialized school 43 (20.6) Junior college or higher 95 (45.5) Hematologic malignancy Acute lymphoblastic leukemia 64 (30.6) Acute myeloid leukemia 104 (49.8) Myelodysplastic syndrome 29 (13.9) Myeloid sarcoma 1 (0.5) Chronic myeloid leukemia in blast phase 4 (1.9) Acute mixed phenotype leukemia 4 (1.9) Hodgkin lymphoma 2 (1.0) Non-Hodgkin lymphoma 1 (0.5) Blood related donor transplant Yes 158 (75.6) No 51 (24.4) ABO compatibility Matched 101 (48.3) Mismatched 108 (51.7) Number of chemotherapy cycles 0 7 (3.3) 1 150 (71.8) 2 38 (18.2) 3 9 (4.3) ≥ ​4 5 (2.4) Number of pre-transplant relapses 0 174 (83.3) 1 28 (13.4) 2 7 (3.3) Pre-transplant disease status CR1 157 (75.1) CR2 26 (12.4) > ​CR2 5 (2.4) Non-remission 21 (10.0) HSCT, hematopoietic stem cell transplantation. Recovery phase symptoms and symptom clusters after allo-HSCT The number of symptoms in the recovery period of allo-HSCT recipients was 5.00 (3.00, 9.00), with a maximum of 18 symptoms simultaneously. The incidence of each symptom ranges from 0.96% to 56.46%. Lack of energy is the most common symptom (56.46%), followed by Worrying (43.54%) and Difficulty sleeping (42.11%), with severity scores of 3.00 (1.00, 4.00), 3.00 (1.00, 4.00), and 2.00 (1.00, 3.00), respectively. Symptoms with a severity score ≥ 1 were considered to have occurred (incidence ​= ​number of recipients with the symptom / total sample size ​× ​100%). Referring to previous studies, to eliminate interfering factors and ensure clinical significance, 15 symptoms with an incidence ≥ 20% were analyzed. Principal component analysis and varimax rotation were performed based on symptom severity scores. The Kaiser-Meyer-Olkin (KMO) measure yielded a value of 0.737, and Bartlett's sphericity test result of χ 2 P Table 2 Table 2 Factor analysis of symptom clusters in the recovery period of allo-HSCT recipients. Table 2 Symptom Symptom occurrence rates n Psychological symptom cluster Fatigue symptom cluster Gastrointestinal symptom cluster Neurological symptom cluster Feeling nervous 66 (31.58) 0.864 Feeling irritable 62 (29.67) 0.846 Feeling sad 59 (28.23) 0.814 Worrying 91 (43.54) 0.806 Pain 74 (35.41) 0.766 Difficulty sleeping 88 (42.11) 0.755 Feeling drowsy 68 (32.54) 0.754 Lack of energy 118 (56.46) 0.702 Difficulty concentrating 81 (38.76) 0.697 Lack of appetite 48 (22.97) 0.901 Dry mouth 65 (31.10) 0.900 Diarrhea 47 (22.49) 0.785 Itching 87 (41.63) 0.875 Changes in skin 73 (34.93) 0.867 Numbness/tingling in hands/feet 63 (30.14) 0.825 HSCT, hematopoietic stem cell transplantation. Sentinel symptoms of symptom clusters during the recovery period in recipients undergoing allo-HSCT Using the Apriori algorithm for association rule mining, three valid rules were generated for the psychological symptom cluster, six for the fatigue cluster, and two for the neurological cluster. No significant antecedent–consequent associations were identified for the gastrointestinal symptom cluster. All generated rules met the predefined criteria of antecedent support > 40%, confidence > 60%, and confidence exceeding antecedent support for sentinel symptom identification 28 Table 3 Table 3 Associations within symptom clusters during recovery in allo-HSCT recipients. Table 3 Symptom cluster Antecedent Consequent Support (%) Confidence (%) Psychological symptom cluster Worrying Feeling nervous 43.54 67.03 Worrying Feeling irritable 43.54 62.64 Worrying Feeling sad 43.54 60.44 Fatigue symptom cluster Difficulty sleeping Lack of energy 42.11 84.09 Difficulty sleeping Pain 42.11 71.59 Lack of energy Difficulty concentrating 56.46 62.71 Lack of energy Difficulty sleeping 56.46 62.71 Difficulty sleeping Feeling drowsy 42.11 61.36 Difficulty sleeping Difficulty concentrating 42.11 61.36 Neurological symptom cluster Itching Changes in skin 41.63 75.86 Itching Numbness/tingling in hands/feet 41.63 62.07 HSCT, hematopoietic stem cell transplantation. Discussion The 1- to 2-year period following allo-HSCT is pivotal to recipient outcomes. As evidenced by Kliman D's study, 18 30 14 Current status of symptoms and symptom clusters during the recovery period in allo-HSCT recipients The findings of this study revealed four symptom clusters during the recovery period after allo-HSCT: psychological symptom cluster (feeling nervous, feeling irritable, feeling sad, and worrying), fatigue symptom cluster (pain, difficulty sleeping, feeling drowsy, lack of energy, and difficulty concentrating), gastrointestinal symptom cluster (lack of appetite, dry mouth, and diarrhea), and neurological symptom cluster (itching, changes in skin, and numbness/tingling in hands/feet). These results indicate that although various symptoms may emerge during follow-up care for allo-HSCT recipients in the recovery phase, symptoms tend to occur in clustered patterns. Health care professionals should pay particular attention to these symptom clusters and implement preventive measures. Furthermore, developing targeted interventions addressing these symptom clusters may prove crucial for improving the overall symptom experience in this recipient's population during this recovery phase. Among the 30 symptoms assessed, lack of energy was the most common and severe symptom. The fatigue symptom cluster was notably prevalent during the recovery phase in this population, consistent with findings from Eriksson et al., 31 32 33 34 35 33 36 37 38 39 40 The second symptom cluster identified in this study is the psychological symptom cluster, which aligns with findings from a 5-year longitudinal study by Esser et al. 9 41 42 43 16 44 45 46 This study also identified gastrointestinal and neurological symptom clusters in the recipients. The results of this study demonstrate consistency with the gastrointestinal symptom cluster composition identified by Frödin et al., 47 48 49 50 51 52 53 54 Analysis of Sentinel Symptoms in Symptom Clusters During the Recovery Period of allo-HSCT Recipients. Worrying is the sentinel symptom of the psychological symptom cluster The findings of this study reveal that worrying serves as a sentinel symptom within the psychological symptom cluster among allo-HSCT recipients during their 1- to 2-year recovery period, distinct from the sentinel symptoms identified in psychological clusters of other cancer survivors. 55 43 56 57 58 Difficulty sleeping is the sentinel symptom of the fatigue symptom cluster Among allo-HSCT recipients during the 1- to 2-year recovery period, this study demonstrates that difficulty sleeping serves as a sentinel symptom within the fatigue symptom cluster, aligning with findings reported by Noyan et al.. 15 59 60 61 62 63 64 65 66 67 68 , 69 Itching is the sentinel symptom of the neurological symptom cluster This study demonstrates that itching serves as a sentinel symptom within the neurological symptom cluster among allo-HSCT recipients in their 1- to 2-year recovery phase. While previous research has addressed post-transplant neurological symptom clusters, none have focused on identifying early warning signals within these clusters. Our survey further revealed a high incidence of itching among recipients during the recovery phase, consistent with prior studies. 70 71 72 73 74 This research not only provides novel insights into the pathogenesis of post-transplant neurological symptom clusters but also establishes quantifiable monitoring parameters and intervention targets for clinical practice. Future multicenter randomized controlled trials (RCTs) should validate the health-economic value of sentinel symptom-based interventions in improving quality of life and reducing health care utilization, ultimately advancing patient-centered precision medicine models. Implications for nursing practice and research The study identified four distinct symptom clusters experienced by allo-HSCT recipients during their 1- to 2-year recovery. Crucially, three sentinel symptoms were identified as predictive markers for specific clusters: Worrying predicts the psychological cluster, Difficulty sleeping foreshadows the fatigue-related cluster, and Itching signals the neurological cluster (often linked to neuroinflammation). These sentinel symptoms act as practical biomarkers, giving health care providers clear starting points during follow-up visits. To establish a foundation for precision nursing interventions, clinical staff should prioritize monitoring and addressing these sentinel symptoms in symptom cluster management. These findings open new precision pathways for clinical practice and academic research. During clinical follow-up and outpatient visits for recipients recovering from allo-HSCT, sentinel symptoms serve as early warning signs for specific symptom clusters. This enables a shift from “universal screening” to “sentinel-directed stratified management” in follow-up care. Rapid responses by multidisciplinary teams significantly improve the efficiency of early symptom intervention. Targeted early interventions based on these markers may mitigate the progression of symptom clusters. Furthermore, the customized development of recipient education and self-management tools empowers recipients and their families to participate in symptom monitoring, creating a “prevention-identification-intervention” closed loop. Academically, this research advances symptom cluster analysis from “phenomenological description” towards “mechanism exploration.” By integrating previous literature with the current analytical results, it preliminarily explores the biological basis of sentinel symptoms and fosters interdisciplinary collaboration. This accelerates the development of sentinel symptom-directed intervention strategies, ultimately establishing a “recipient-centered” precision rehabilitation system. Future research should focus on creating and testing tailored strategies – such as specialized itch treatments, mindfulness programs for worrying, or sleep-focused therapies – aimed directly at modulating these sentinel symptoms to improve allo-HSCT survivors' quality of life. This significantly improves the long-term quality of life and prognosis for post-transplant recipients. Limitations The current research has certain limitations. Firstly, our utilization of the generic MSAS-Ch may not comprehensively capture the full spectrum of symptoms experienced by allo-HSCT recipients during the recovery phase. Future research should develop and validate symptom-specific assessment instruments tailored to this unique population. Secondly, the relatively small sample size limits generalizability. Future studies should prioritize expanding the cohort. Thirdly, detailed clinical data (e.g., medication regimens, GVHD activity, infections) were not captured, precluding analysis of their influence on symptom clusters. Additionally, while our focused investigation on the 1–2-year post-transplant period addresses a critical clinical gap in allo-HSCT care, this design inherently precludes analysis of acute-phase (< 1 year) or long-term (> 2 years) symptom clusters and prevents tracking of sentinel symptom trajectories across the entire recovery spectrum. We therefore recommend longitudinal studies to map symptom evolution, specifically identifying sentinel symptoms from immediate post-transplant through long-term survivorship. Conclusions In summary, our study revealed the existence of multiple symptom clusters with identifiable sentinel symptoms during the recovery phase of allo-HSCT. We recommend that clinical nursing practitioners use these sentinel symptoms as early warning indicators to help analyze the underlying causes of individual symptoms. This approach facilitates the implementation of precision-oriented symptom cluster management strategies, which may prevent or mitigate the progression of symptom clusters and ultimately enhance the long-term quality of life for this recipient's population. Furthermore, by leveraging sentinel symptoms as intervention starting points, health care teams should conduct prospective monitoring and systematic evaluations to accurately predict potential manifestations of additional symptoms. Early intervention strategies based on such predictions could effectively alleviate symptom exacerbation and reduce the emergence of new symptoms, thereby significantly improving clinical outcomes for allo-HSCT recipients. This paradigm shift from “reactive management” to “proactive prevention and control” holds significant potential for advancing transplantation nursing practices. CRediT authorship contribution statement Ping Xu: Conceptualization, Methodology, Writing – Original Draft. Shuyi Ding & li zheng: Data Curation, Formal Analysis, Visualization. Yin Cheng: Resources, Supervision, Writing – Review & Editing. Yishan Ye & Lin Li: Supervision. Zhiru Li: Software, Validation. Yuexian Tao & Huafen Wang: Project Administration, Funding Acquisition. All authors have read and approved the final manuscript. Ethics statement The study was approved by the Institutional Review Board of The First Affiliated Hospital, Zhejiang University School of Medicine (IRB No. IIT20241533) and was conducted in accordance with the 1964 Helsinki Declaration and its later amendments or comparable ethical standards. All participants provided written informed consent. Data availability statement The data are not publicly available due to restrictions their containing information that could compromise the privacy of research participants. Declaration of generative AI and AI-assisted technologies in the writing process No AI tools/services were used during the preparation of this work. Funding This study was supported by the Nursing Discipline Construction Research Project of the First Affiliated Hospital, Zhejiang University School of Medicine (ZD-ZYHL-2501); Zhejiang University 2024 \"Double First-Class\" Construction Nursing Advantaged and Characteristic Discipline Scientific Research Cultivation Fund (HL202408); Zhejiang Provincial Medical and Health Science and Technology Project (2025KY811). The funders had no role in considering the study design or in the collection, analysis, interpretation of data, writing of the report, or decision to submit the article for publication. Declaration of competing interest The authors declare no conflict of interest. References 1 Zhang N. Wu J. Wang Q. Global burden of hematologic malignancies and evolution patterns over the past 30 years Blood Cancer J 13 1 2023 82 10.1038/s41408-023-00853-3 e-pub ahead of print 20230517 37193689 PMC10188596 2 Kuwatsuka Y. Ito H. Tabuchi K. Trends in allogeneic hematopoietic cell transplantation survival using population-based descriptive epidemiology method: analysis of national transplant registry data Bone Marrow Transplant 59 9 2024 1295 1301 10.1038/s41409-024-02326-y e-pub ahead of print 20240619 38898226 3 Huang L. He J. Trend analysis of hematological tumors in adolescents and young adults from 1990 to 2019 and predictive trends from 2020 to 2044: a Global Burden of Disease study Cancer Med 13 18 2024 e70224 10.1002/cam4.70224 PMC11447274 39359159 4 Bhatia S. Dai C. Landier W. Trends in late mortality and life expectancy after allogeneic blood or marrow transplantation over 4 decades: a blood or marrow transplant survivor study report JAMA Oncol 7 11 2021 1626 1634 10.1001/jamaoncol.2021.3676 34499078 PMC8430905 5 Harrison R.A. Sharafeldin N. Rexer J.L. Neurocognitive impairment after hematopoietic stem cell transplant for hematologic malignancies: phenotype and mechanisms Oncologist 26 11 2021 e2021 e2033 10.1002/onco.13867 e-pub ahead of print 20210712 34156729 PMC8571768 6 Xue R. Dai M. Jiang E. Effect of pre-transplant cytoreductive therapy on the outcomes of patients with MDS or secondary AML evolving from MDS undergoing allo-HSCT: a secondary analysis of an RCT Blood Cancer J 15 1 2025 21 10.1038/s41408-025-01233-9 e-pub ahead of print 20250219 39971949 PMC11840129 7 Ruan J. Cheng H. Liu Q. Survivorship experiences of allogeneic hematopoietic stem cell transplantation survivors: a qualitative systematic review Cancer Nurs 2024 10.1097/NCC.0000000000001383 e-pub ahead of print 20240716 39016254 8 Kim H.J. McGuire D.B. Tulman L. Barsevick A.M. Symptom clusters: concept analysis and clinical implications for cancer nursing Cancer Nurs 28 4 2005 270 282 10.1097/00002820-200507000-00005 quiz 283-274 16046888 9 Esser P. Kuba K. Scherwath A. Stability and priority of symptoms and symptom clusters among allogeneic HSCT patients within a 5-year longitudinal study J Pain Symptom Manage 54 4 2017 493 500 10.1016/j.jpainsymman.2017.07.012 e-pub ahead of print 20170713 28711754 10 Penack O. Marchetti M. Aljurf M. Prophylaxis and management of graft-versus-host disease after stem-cell transplantation for haematological malignancies: updated consensus recommendations of the European Society for Blood and Marrow Transplantation Lancet Haematol 11 2 2024 e147 e159 10.1016/S2352-3026(23)00342-3 e-pub ahead of print 20240103 38184001 11 Stem Cell Application Group CSoHCMA [Chinese expert consensus on the management of long-term complications after hematopoietic stem cell transplantation Zhonghua Xue Ye Xue Za Zhi 44 9 2023 717 722 10.3760/cma.j.issn.0253-2727.2023.09.003 2023 38049314 PMC10630577 12 Amonoo H.L. Massey C.N. Freedman M.E. Psychological considerations in hematopoietic stem cell transplantation Psychosomatics 60 4 2019 331 342 10.1016/j.psym.2019.02.004 e-pub ahead of print 20190214 31072626 PMC6626677 13 Eduardo F.P. Bezinelli L.M. Gobbi M. Retrospective study of the digestive tract mucositis derived from myeloablative and non-myeloablative/reduced-intensity conditionings with busulfan in hematopoietic cell transplantation patient Support Care Cancer 27 3 2019 839 848 10.1007/s00520-018-4362-3 e-pub ahead of print 20180814 30109488 14 Lindman A. Handberg C. Olesen G. Duijts S. Health-related quality of life and physical functioning in patients participating in a rehabilitation programme, undergoing non-myeloablative allogeneic haematopoietic stem cell transplantation: outcomes from a single arm longitudinal study Eur J Cancer Care (Engl) 30 6 2021 e13478 10.1111/ecc.13478 e-pub ahead of print 20210714 34263492 15 Noyan S. Gündogdu F. Bozdağ S.C. The level of fatigue, insomnia, depression, anxiety, stress, and the relationship between these symptoms following allogeneic hematopoietic stem cell transplantation: a cross-sectional study Support Care Cancer 31 4 2023 244 10.1007/s00520-023-07703-9 e-pub ahead of print 20230329 36977784 16 Chen J. Yu J. Xie M. Wu Y. Hu R. Understanding the symptom experience and self-management strategies of adult hematopoietic stem cell transplantation patients during hospitalization: findings from a qualitative longitudinal study Support Care Cancer 30 12 2022 10137 10147 10.1007/s00520-022-07428-1 e-pub ahead of print 20221109 36350378 PMC9643937 17 Valkova V. Jircikova J. Trnkova M. The quality of life following allogeneic hematopoietic stem cell transplantation - a multicenter retrospective study Neoplasma 63 5 2016 743 751 10.4149/neo_2016_511 27468878 18 Kliman D. Nivison-Smith I. Gottlieb D. Hematopoietic stem cell transplant recipients surviving at least 2 Years from transplant have survival rates approaching population levels in the modern era of transplantation Biol Blood Marrow Transplant 26 9 2020 1711 1718 10.1016/j.bbmt.2020.03.005 e-pub ahead of print 20200316 32194285 19 Ortola-Alonso P. Santacatalina-Roig E. Chover-Sierra E. Merelles-Tormo A. Ballestar-Tarin M.L. Martinez-Sabater A. Hematopoietic stem cell transplantation impact on patients' perceived quality of life: a longitudinal study Nurs Rep 14 1 2024 197 211 10.3390/nursrep14010016 e-pub ahead of print 20240118 38251194 PMC10801518 20 Brown J.K. Cooley M.E. Chernecky C. Sarna L. A symptom cluster and sentinel symptom experienced by women with lung cancer Oncol Nurs Forum 38 6 2011 E425 E435 10.1188/11.ONF.E425-E435 22037342 21 Jim H.S. Jacobsen P.B. Phillips K.M. Wenham R.M. Roberts W. Small B.J. Lagged relationships among sleep disturbance, fatigue, and depressed mood during chemotherapy Health Psychol 32 7 2013 768 774 10.1037/a0031322 e-pub ahead of print 20130225 23437852 PMC3700563 22 Luo Y. Mao D. Zhang L. Yang Z. Miao J. Zhang L. Identification of symptom clusters and sentinel symptoms during the first cycle of chemotherapy in patients with lung cancer Support Care Cancer 32 6 2024 385 10.1007/s00520-024-08600-5 e-pub ahead of print 20240527 38801450 PMC11130015 23 Rha S.Y. Park M. Lee J. Stability of symptom clusters and sentinel symptoms during the first two cycles of adjuvant chemotherapy Support Care Cancer 27 5 2019 1687 1695 10.1007/s00520-018-4413-9 e-pub ahead of print 20180817 30120557 24 Lu X. Geng W. Liu F. Symptom clusters and sentinel symptoms in breast cancer survivors based on self-reported outcomes:A cross-sectional survey J Clin Nurs 34 3 2025 1072 1080 10.1111/jocn.17383 e-pub ahead of print 20240729 39075789 PMC11808415 25 Liang M.Y. Zhong T. Knobf M.T. Sentinel and networked symptoms in patients with breast cancer undergoing chemotherapy Eur J Oncol Nurs 70 2024 102566 10.1016/j.ejon.2024.102566 38513452 26 von Elm E. Altman D.G. Egger M. The strengthening the reporting of observational studies in epidemiology (STROBE) statement: guidelines for reporting observational studies Int J Surg 12 12 2014 1495 1499 10.1016/j.ijsu.2014.07.013 e-pub ahead of print 20140718 25046131 27 Wolf E.J. Harrington K.M. Clark S.L. Miller M.W. Sample size requirements for structural equation models: an evaluation of power, bias, and solution propriety Educ Psychol Meas 76 6 2013 913 934 10.1177/0013164413495237 25705052 PMC4334479 28 Cheng K.K. Wong E.M. Ling W.M. Chan C.W. Thompson D.R. Measuring the symptom experience of Chinese cancer patients: a validation of the Chinese version of the memorial symptom assessment scale J Pain Symptom Manage 37 1 2009 44 57 10.1016/j.jpainsymman.2007.12.019 e-pub ahead of print 20080606 18538976 29 Teng L. Zhou Z. Yang Y. Identifying central symptom clusters and correlates in patients with lung cancer post-chemotherapy: a network analysis Asia Pac J Oncol Nurs 11 4 2024 100383 10.1016/j.apjon.2024.100383 e-pub ahead of print 20240120 PMC10940888 38495643 30 Lin C.Y. Sajeev G. Stiff P. Health-related quality of life following allogeneic hematopoietic stem cell transplantation with omidubicel versus standard umbilical cord blood Cl Lymph Myelom Leuk 22 2022 S432 S433 10.1016/j.jtct.2022.09.018 PMC9825638 36179986 31 Eriksson L.V. Holmberg K. Lundh Hagelin C. Wengstrom Y. Bergkvist K. Winterling J. Symptom burden and recovery in the first year after allogeneic hematopoietic stem cell transplantation Cancer Nurs 46 1 2023 77 85 10.1097/NCC.0000000000001077 e-pub ahead of print 20220314 35283470 32 Yang H. Wu B. Hu R. Wang Y. Symptom experiences and self-management strategies of patients with haematological malignancy undergoing chemotherapy: a qualitative study Asia Pac J Oncol Nurs 11 9 2024 100563 10.1016/j.apjon.2024.100563 e-pub ahead of print 20240730 PMC11374969 39239475 33 Hacker E.D. Fink A.M. Peters T. Park C. Fantuzzi G. Rondelli D. Persistent fatigue in hematopoietic stem cell transplantation survivors Cancer Nurs 40 3 2017 174 183 10.1097/NCC.0000000000000405 27333126 PMC5177539 34 Farhadfar N. Gharaibeh R.Z. Dahl W.J. Gut microbiota dysbiosis associated with persistent fatigue in hematopoietic cell transplantation survivors Transplant Cell Ther 27 6 2021 498 e491 498 10.1016/j.jtct.2021.02.017 e498. e-pub ahead of print 20210227 33775619 35 Salvetti M.G. Machado C.S.P. Donato S.C.T. Silva A.M.D. Prevalence of symptoms and quality of life of cancer patients Rev Bras Enferm 73 2 2020 e20180287 10.1590/0034-7167-2018-0287 e-pub ahead of print 20200227 32162649 36 Gielissen M.F. Schattenberg A.V. Verhagen C.A. Rinkes M.J. Bremmers M.E. Bleijenberg G. Experience of severe fatigue in long-term survivors of stem cell transplantation Bone Marrow Transplant 39 10 2007 595 603 10.1038/sj.bmt.1705624 e-pub ahead of print 20070319 17369868 37 Fabi A. Bhargava R. Fatigoni S. Cancer-related fatigue: ESMO clinical practice guidelines for diagnosis and treatment Ann Oncol 31 6 2020 713 723 10.1016/j.annonc.2020.02.016 e-pub ahead of print 20200312 32173483 38 Tolotti A. Bonetti L. Pedrazzani C. Nursing management of fatigue in cancer patients and suggestions for clinical practice: a mixed methods study BMC Nurs 20 1 2021 182 10.1186/s12912-021-00699-9 e-pub ahead of print 20210928 34583693 PMC8477483 39 Johns S.A. Tarver W.L. Secinti E. Effects of mindfulness-based interventions on fatigue in cancer survivors: a systematic review and meta-analysis of randomized controlled trials Crit Rev Oncol Hematol 160 2021 103290 10.1016/j.critrevonc.2021.103290 e-pub ahead of print 20210304 PMC8200642 33675902 40 Ullrich C.K. Baker K.K. Carpenter P.A. Fatigue in hematopoietic cell transplantation survivors: correlates, care team communication, and patient-identified mitigation strategies Transplant Cell Ther 29 3 2023 200 e201 200 10.1016/j.jtct.2022.11.030 e208. e-pub ahead of print 20221206 36494015 41 Amonoo H.L. Daskalakis E. Deary E.C. Feasibility of a positive psychology intervention (PATH) in allogeneic hematopoietic stem cell transplantation survivors: randomized pilot trial design and methods Contemp Clin Trials 131 2023 107272 10.1016/j.cct.2023.107272 e-pub ahead of print 20230626 PMC10839810 37380022 42 Janicsak H. Ungvari G.S. Gazdag G. Psychosocial aspects of hematopoietic stem cell transplantation World J Transplant 11 7 2021 263 276 10.5500/wjt.v11.i7.263 34316451 PMC8290998 43 Hansen J.L. Juckett M.B. Foster M.A. Psychological and physical function in allogeneic hematopoietic cell transplant survivors with chronic graft-versus-host disease J Cancer Surviv 17 3 2023 646 656 10.1007/s11764-023-01354-9 e-pub ahead of print 20230314 36917433 PMC10246467 44 Voskanyan V. Marzorati C. Sala D. Psychosocial factors associated with quality of life in cancer survivors: umbrella review J Cancer Res Clin Oncol 150 5 2024 249 10.1007/s00432-024-05749-8 e-pub ahead of print 20240510 38727730 PMC11087342 45 Cioce M. Lohmeyer F.M. Moroni R. Impact of educational interventions on psychological distress during allogeneic hematopoietic stem cell transplantation: a randomised study Mediterr J Hematol Infect Dis 12 1 2020 e2020067 10.4084/MJHID.2020.067 e-pub ahead of print 20200901 PMC7485479 32952978 46 Ruan J.Y. Cheng H.L. Wu L.Y. Perceptions and experiences of acceptance and commitment therapy among people with mental disorders: a qualitative systematic review J Context Behav Sci 30 2023 80 96 10.1016/j.jcbs.2023.09.003 47 Frodin U. Lotfi K. Fomichov V. Juliusson G. Borjeson S. Frequent and long-term follow-up of health-related quality of life following allogeneic haematopoietic stem cell transplantation Eur J Cancer Care 24 6 2015 898 910 10.1111/ecc.12350 e-pub ahead of print 20150707 26156141 48 Kroemeke A. Sobczyk-Kruszelnicka M. Kwissa-Gajewska Z. Everyday life following hematopoietic stem cell transplantation: decline in physical symptoms within the first month and change-related predictors Qual Life Res 27 1 2018 125 135 10.1007/s11136-017-1705-3 e-pub ahead of print 20170912 28900828 PMC5770502 49 Bryant A.L. Coffman E. Phillips B. Pilot randomized trial of an electronic symptom monitoring and reporting intervention for hospitalized adults undergoing hematopoietic stem cell transplantation Support Care Cancer 28 3 2020 1223 1231 10.1007/s00520-019-04932-9 e-pub ahead of print 20190620 31222392 PMC6923608 50 Wu J. Lu A.D. Zhang L.P. Zuo Y.X. Jia Y.P. [Study of clinical outcome and prognosis in pediatric core binding factor-acute myeloid leukemia] Zhonghua Xue Ye Xue Za Zhi 40 1 2019 52 57 10.3760/cma.j.issn.0253-2727.2019.01.010 30704229 PMC7351698 51 Müller M. Canfora E.E. Blaak E.E. Gastrointestinal transit time, glucose homeostasis and metabolic health: modulation by dietary fibers Nutrients 10 3 2018 275 10.3390/nu10030275 29495569 PMC5872693 52 Madini N. Vincenti A. Beretta A. Santero S. Viroli G. Cena H. Addressing inflammaging and disease-related malnutrition: adequacy of oral nutritional supplements in clinical care Nutrients 16 23 2024 10.3390/nu16234141 e-pub ahead of print 20241129 PMC11643944 39683535 53 Lambert N. Forte F. El Moussaoui M. Central nervous system manifestations in acute and chronic graft-versus-host disease Brain 2024 10.1093/brain/awae340 e-pub ahead of print 20241023 PMC11967822 39442000 54 Bergkvist K. Winterling J. Johansson E. General health, symptom occurrence, and self-efficacy in adult survivors after allogeneic hematopoietic stem cell transplantation: a cross-sectional comparison between hospital care and home care Support Care Cancer 23 5 2015 1273 1283 10.1007/s00520-014-2476-9 e-pub ahead of print 20141017 25322970 55 Ma J. Xu H. Liu S. Wang A. An investigation of symptom clusters and sentinel symptoms during the first 2 cycles of postoperative chemotherapy in patients with lung cancer Cancer Nurs 45 6 2022 488 496 10.1097/NCC.0000000000001058 e-pub ahead of print 20220131 35089876 56 Kadri N. Amu S. Iacobaeus E. Boberg E. Le Blanc K. Current perspectives on mesenchymal stromal cell therapy for graft versus host disease Cell Mol Immunol 20 6 2023 613 625 10.1038/s41423-023-01022-z e-pub ahead of print 20230510 37165014 PMC10229573 57 Pawelczak-Szastok M. Ilska M. Swoboda R. Giebel S. Trajectories of quality of life during hematopoietic stem cell transplantation: longitudinal cohort study Sci Rep 15 1 2025 5142 10.1038/s41598-025-88748-0 e-pub ahead of print 20250211 39934268 PMC11814371 58 Amonoo H.L. El-Jawahri A. Celano C.M. A positive psychology intervention to promote health outcomes in hematopoietic stem cell transplantation: the PATH proof-of-concept trial Bone Marrow Transplant 56 9 2021 2276 2279 10.1038/s41409-021-01296-9 e-pub ahead of print 20210420 33879852 PMC8416696 59 Yavlal F. Aras Y.G. Ulas S.B. Evaluation of sleep disorders before and after transplantation in patients undergoing hematopoietic stem cell transplantation Eur Rev Med Pharmacol Sci 26 23 2022 8935 8944 10.26355/eurrev_202212_30568 36524513 60 Nelson A.M. Coe C.L. Juckett M.B. Sleep quality following hematopoietic stem cell transplantation: longitudinal trajectories and biobehavioral correlates Bone Marrow Transplant 49 11 2014 1405 1411 10.1038/bmt.2014.179 e-pub ahead of print 20140818 25133898 PMC4221490 61 Haack M. Simpson N. Sethna N. Kaur S. Mullington J. Sleep deficiency and chronic pain: potential underlying mechanisms and clinical implications Neuropsychopharmacology 45 1 2020 205 216 10.1038/s41386-019-0439-z e-pub ahead of print 20190617 31207606 PMC6879497 62 Wang Y.Q. Ma W.X. Kong L.X. Ambient chemical and physical approaches for the modulation of sleep and wakefulness Sleep Med Rev 79 2025 102015 10.1016/j.smrv.2024.102015 e-pub ahead of print 20241012 39447526 63 Garbarino S. Lanteri P. Bragazzi N.L. Magnavita N. Scoditti E. Role of sleep deprivation in immune-related disease risk and outcomes Commun Biol 4 1 2021 1304 10.1038/s42003-021-02825-4 e-pub ahead of print 20211118 34795404 PMC8602722 64 De Pasquale C. El Kazzi M. Sutherland K. Sleep hygiene - what do we mean? A bibliographic review Sleep Med Rev 75 2024 101930 10.1016/j.smrv.2024.101930 e-pub ahead of print 20240416 38761649 65 Kim N. Ka S. Park J. Effects of exercise timing and intensity on physiological circadian rhythm and sleep quality: a systematic review Phys Act Nutr 27 3 2023 52 63 10.20463/pan.2023.0029 e-pub ahead of print 20230930 37946447 PMC10636512 66 Briguglio M. Vitale J.A. Galentino R. Healthy eating, physical activity, and sleep hygiene (HEPAS) as the winning triad for sustaining physical and mental health in patients at risk for or with neuropsychiatric disorders: considerations for clinical practice Neuropsychiatr Dis Treat 16 2020 55 70 10.2147/NDT.S229206 e-pub ahead of print 20200108 32021199 PMC6955623 67 Ravyts S.G. Sannes T.S. Dzierzewski J.M. Check your sleep before you start: a secondary analysis of a stress management intervention for caregivers of stem cell transplant patients Psychooncology 30 6 2021 936 945 10.1002/pon.5680 e-pub ahead of print 20210331 33749066 PMC8855839 68 El Iskandarani S. Sun L. Li S.Q. Pereira G. Giralt S. Deng G. Acupuncture improves certain aspects of sleep in hematopoietic stem cell transplantation patients: a secondary analysis of a randomized controlled trial Acupunct Med 41 6 2023 319 326 10.1177/09645284231181403 e-pub ahead of print 20230706 37409464 PMC11193154 69 Cheung D.S.T. Yeung W.F. Chau P.H. Patient-centred, self-administered acupressure for Chinese advanced cancer patients experiencing fatigue and co-occurring symptoms: a pilot randomised controlled trial Eur J Cancer Care 31 5 2022 e13314 10.1111/ecc.13314 e-pub ahead of print 20200907 32896014 70 Cho A. Paulitschke V. Just U. Knobler R. Cutaneous manifestations of acute and chronic graft-versus-host disease G Ital Dermatol Venereol 155 1 2020 76 87 10.23736/S0392-0488.19.06535-0 32100975 71 Baumrin E. Loren A.W. Falk S.J. Mays J.W. Cowen E.W. Chronic graft-versus-host disease. Part I: epidemiology, pathogenesis, and clinical manifestations J Am Acad Dermatol 90 1 2024 1 16 10.1016/j.jaad.2022.12.024 e-pub ahead of print 20221223 36572065 PMC10287844 72 Cevikbas F. Wang X. Akiyama T. A sensory neuron-expressed IL-31 receptor mediates T helper cell-dependent itch: involvement of TRPV1 and TRPA1 J Allergy Clin Immunol 133 2 2014 448 460 10.1016/j.jaci.2013.10.048 e-pub ahead of print 20131225 24373353 PMC3960328 73 Babakoohi S. Gu S.L. Ehsan H. Markova A. Dermatologic complications in transplantation and cellular therapy for acute leukemia Best Pract Res Clin Haematol 36 2 2023 101464 10.1016/j.beha.2023.101464 e-pub ahead of print 20230406 PMC10291442 37353285 74 Wang F. Trier A.M. Li F. A basophil-neuronal axis promotes itch Cell 184 2 2021 422 440 10.1016/j.cell.2020.12.033 e417. e-pub ahead of print 20210114 33450207 PMC7878015 Appendix A Supplementary data The following is the Supplementary data to this article. Multimedia component 1 Multimedia component 1 Appendix A Supplementary data to this article can be found online at https://doi.org/10.1016/j.apjon.2025.100782 ",
  "metadata": {
    "Title of this paper": "A basophil-neuronal axis promotes itch",
    "Journal it was published in:": "Asia-Pacific Journal of Oncology Nursing",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483648/"
  }
}