{
  "title": "Paper_503",
  "abstract": "pmc Front Pharmacol Front Pharmacol 1524 frontpharmacol Front. Pharmacol. Frontiers in Pharmacology 1663-9812 Frontiers Media SA PMC12481900 PMC12481900.1 12481900 12481900 41035914 10.3389/fphar.2025.1628165 1628165 1 Pharmacology Systematic Review A systematic review of progress toward unlocking the power of epigenetics in breast cancer: latest updates and perspectives Alotaibi 10.3389/fphar.2025.1628165 Alotaibi Ghallab *  †  Department of Pharmacology College of Pharmacy Shaqra University Shaqra Saudi Arabia  Edited by: Zhendong Shi  Reviewed by: Irina Nakashidze  Tuoen Liu  Safia Habib *Correspondence: Ghallab Alotaibi, ghalotaibi@su.edu.sa  † ORCID: Ghallab Alotaibi, orcid.org/0000-0003-4780-7082 16 9 2025 2025 16 480654 1628165 13 5 2025 29 8 2025 16 09 2025 01 10 2025 02 10 2025 Copyright © 2025 Alotaibi. 2025 Alotaibi https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Breast cancer (BC) is among the most prevalent malignancies globally. It is progressively acknowledged as a diverse type of cancer, exhibiting considerable differences in its genomic and transcriptomic characteristics. Its growing evidence highlights the substantial role of epigenetic modification in pathogenesis, prognosis and treatment. Cancer and epigenetics are closely linked; abnormal epigenetic changes can influence numerous aspects of cancer biology, including unusual transcription patterns, initiation of cancer, its progression, resistance to drugs, and metastasis. Epigenetic drugs (epi-drugs), including DNA methyltransferase (DNMT) and histone deacetylase (HDAC) inhibitors, serve as promising therapeutic agents, particularly in combination with conventional therapies. Additionally, nanotechnology-assisted epi-drug delivery systems are emerging as innovative approaches to enhance treatment efficacy and reduce systemic toxicity. While several epigenetic biomarkers have shown potential in liquid and tissue biopsies, their clinical validation remains a challenge. The integration of epigenetic insights into personalized medicine could revolutionize BC management, offering more targeted and effective treatment strategies. This systematic review aims to evaluate recent advancement in epigenetic research related to BC, focusing on diagnostic and prognostic biomarkers, epigenetic-based therapies and ongoing clinical trials. A comprehensive literature search was carried out in databases like PubMed, Scopus, and Google Scholar up to January 2025, following PRISMA guidelines. Seventy two (72) studies were included, addressing key aspects of DNA methylation, histone modification, and non-coding RNAs as potential biomarkers for early detection and disease progression monitoring. breast cancer epigenetics biomarkers personalized medicine nanotechnology The author(s) declare that no financial support was received for the research and/or publication of this article. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Pharmacology of Anti-Cancer Drugs 1 Introduction Breast cancer (BC) is among the most common cancer diagnosed in the U.S among women. Every year, almost 32% of all newly diagnosed cancers in women are breast cancer ( Nwosu and Piccolo, 2024 Nounou et al., 2015 Between 2004 and 2017, the incidence of BC surged across various race and ethnic groups in the US, with the most significant average annual percentage increases noted among non-Hispanic Black women (0.9%), particularly those residing in rural areas (1.2%), lower poverty areas (0.8%), and all regions except the West (0.8%–1.0%). Non-Hispanic Blacks experienced sharper increases for local-stage disease and for certain subgroups with distant-stage disease. Among most subgroups, non-Hispanic Blacks experienced the least reduction in regional-stage disease. Likewise, Hispanic women saw the highest increases in certain subgroups, such as those from areas of greater poverty (0.6%–1.2%) and in the West (0.8%), for both local- and distant-stage disease ( Kaur et al., 2022 Several genetic factors that play a role in cancer progression include high-penetrance genes including BRCA1, BRCA2, p53, PTEN, ATM, NBS1, and LKB1, low penetrance cytochrome genes include CYP1A1, CYP2D6, and CYP19, along with genes from the glutathione S-transferase family such as GSTM1 and GSTP1. Additionally, there are genes related to alcohol and one-carbon metabolism like ADH1C and MTHFR, as well as genes that play a role in DNA repair, including XRCC1, XRCC3, and ERCC4/XPF. Furthermore, there are genes that encode cell signalling molecules such as PR, ER, TNF-α, and heat shock protein 70 (HSP70) ( Mahendran et al., 2024 Nounou et al., 2015 Breast cancer (BC) is progressively acknowledged as a diverse type of cancer, exhibiting considerable differences in its genomic and transcriptomic characteristics ( Dai et al., 2015 Baylin and Jones, 2016 Epigenetics refers to a hereditary molecular process influenced by exterior elements that governs gene expression without changing the underlying DNA sequence ( Holliday, 1994 Dawson and Kouzarides, 2012 Pasculli et al., 2018 Methylation of DNA is a recognized epigenetic change entailing covalent attachment of methyl group to cytosine base of CpG dinucleotides, leading to the suppression of transcription ( Sulewska et al., 2023 Sulewska et al., 2023 Salas et al., 2020 Histone modifications, including phosphorylation, acetylation, ubiquitination, and methylation can influence the expression of gene by changing chromatin accessibility and the process of gene transcription ( Sulewska et al., 2023 Guo et al., 2018 Recently, non-coding RNAs (ncRNAs) have been found to play a role in various epigenetic mechanisms that regulate gene expression, including transcription regulation, post-transcriptional modifications, and the alteration of chromatin structure ( Penna et al., 2016 Sher et al., 2022 Epi-regulation encompasses interactions that are more intricate than standalone occurrences, like the relationship between DNA methylation and miRNAs in silencing protein-coding genes ( Yamashita et al., 2015 Sulewska et al., 2023 Sun et al., 2014 Liu et al., 2017 Langevin et al., 2015 Epi-drugs utilized as treatment options have the capacity to trigger the recovery of damaged genes, restore genes that suppress or slow down tumor growth and survival, address the problem of tumor heterogeneity, and prove effective against tumors lacking actionable mutations ( Ansari et al., 2016 Kalia, 2015 Kalia, 2015 Brzeziańska et al., 2013 Erdmann et al., 2015 + Kim et al., 2023 Figure 1 FIGURE 1 Role of epigenetic modification in progression and epi-drugs in recovery of BC. Diagram showing a breast cancer progression model involving epigenetic modifications, including DNA methylation, histone modification, and non-coding RNAs. Epi-drugs, such as DNMT inhibitors, HDAC inhibitors, and combination therapies, aim to achieve tumor recovery. Illustrations of a cancerous and recovering breast accompany the text. Our comprehensive review of epigenetics in beast cancer offers a current overview and new insights. We conducted a search from its inception until January 2025 for literature on this subject, concentrating on (i) diagnostic and prognostic epigenetic biomarkers in BC, (ii) epigenetic-based therapies for BC, and (iii) clinical trials. We are convinced that advancements in epigenetic research will enhance our comprehension of the disease’s development and foster a more tailored management approach. 2 Materials and methods 2.1 Search strategy This research adhered to the 2020 PRISMA guidelines checklist ( Table 1 Page et al., 2021 Table 2 TABLE 1 Search terms used for the systematic reviews. BC epigenetics Epigenetic diagnosis BC prognosis TNBC diagnosis Epigenetic therapy BC Epi-drugs HDAC inhibitors miRNA prognosis lncRNA prognosis DNA methylation prognosis miRNA diagnosis lncRNA diagnosis TABLE 2 The most highly investigated epigenetic markers. S. No. Potential biomarker Function Sample type Role References 1. ALU247 Diagnostic Plasma Detect metastatic BC  Agostini et al. (2011) 2. APC, RARβ Do Serum Early ductal TNBC diagnosis  Swellam et al. (2015) 3. APC, FOXA1, & RASSF1A Do Plasma Detection and monitoring of BC patients  Salta et al. (2018) 4. ESR1 Predictive Peripheral Blood (CTCs) Predict endocrine therapy efficacy in BC patients  Mastoraki et al. (2018) 5. FHIT Diagnostic Serum Early diagnosis of ductal BC  Liu et al. (2015) 6. HYAL2 Do Peripheral Blood (Leukocyte) Early diagnose of BC  Yang et al. (2015) 7. KEAP1 Prognostic & predictive Tissue Predict resistance to chemotherapy regimens involving taxanes  Parrella (2018) 8. RARβ, RASSF1A Diagnostic Serum Detect in situ  Kim et al. (2010) 9. SFN, P16, hMLH1, HOXD13, PCDHGB7 & RASSF1A Do Serum Detection and monitoring of BC  Shan et al. (2016) 2.2 Eligibility criteria To be eligible for inclusion in the review, studies needed to satisfy the criteria as: (i) they must have been carried out in patients with BC or in BC cell lines; (ii) they should focus on diagnostic/prognostic epigenetic biomarkers (iii) studies involving humans must provide relevant clinical pathological characteristics (iv) those with diagnostic and prognostic significance required information regarding survival outcomes; (vi) therapeutic studies and (vii) publications must be in English, and the complete text must be accessible. The search terms are in the Table 1 Research was excluded if any of the below criteria were met: (i) Duplicate reports; (ii) studies involving non-human subjects, non-cell line research, animal experimentation, or those not available in English; (iii) studies lacking accessible data or containing partial or retracted information. 2.3 Study selection and data extraction The selection process for publications that met the inclusion criteria was conducted manually by the author, without using any automated tools. After eliminating duplicates, a total of 318 items were identified. 90 citations were excluded by title and screened 228 abstracts for retrieval. Finally, 228 eligible studies were included. The queries, along with the corresponding sections of the paper related to diagnosis, prognosis, and therapy, resulted in 72 separate studies utilized across three sections of the paper ( Figure 2 FIGURE 2 Flowchart showing identification of studies via various databases/registers and included and excluded studies. Flowchart showing the identification of studies via databases and registers. Identified records: 1693. Removed duplicates: 1375. Screened records: 318, 90 excluded by title. Sought for retrieval: 228, all retrieved. Eligibility assessed: 228, 156 excluded. Final review: 72 studies, including 32 diagnostic, 32 therapy, and 8 clinical trials. 3 Results The search terms employed in this systematic review are summarized in Table 1 4 Detailed results and discussion 4.1 Diagnostic and prognostic epigenetic biomarkers At present, one of the greatest hurdles in oncology is the initial-stage diagnosis of BC ( Ginsburg et al., 2020 Unger‐Saldaña et al., 2015 Wang, 2017 Sarvari et al., 2022 The significance of identifying biomarkers extends beyond their prognostic role, which indicates the likely progression of a disease; they also offer insights into how a patient may respond to a chosen treatment. Consequently, it is essential to have diagnostic biomarkers for screening and categorizing breast cancer patients. Conversely, prognostic biomarkers are crucial for estimating a patient’s survival prospects ( Louie et al., 2021 Alba-Bernal et al., 2020 Epigenetic changes, like irregular methylation of DNA and acetylation of histone at gene promoter regions, represent some of the earliest events in the mechanism that leads to cancer, as they play a role in silencing specific genes. Reports indicate that the quantity of genes with irregular methylation detected in BC is rising quickly ( Zubor et al., 2019 Salta et al., 2018 Egger, 2018 Xu et al., 2020 Cheng et al., 2019 For example, the hypermethylation of hyaluronoglucosaminidase 2 (HYAL2) in blood can be identified in the initial stages of breast cancer (BC) cases. This indicates that the methylation level of HYAL2 may serve as an early indicator for detecting BC, demonstrating a high sensitivity of 64% and a specificity of 90% ( Yang et al., 2015 Kim et al., 2010 Figure 3 Shan et al., 2016 FIGURE 3 Methylation detection in a six-gene panel for BC diagnosis. Flowchart illustrating the process of diagnosing breast cancer using DNA methylation assay (MethyLight). It starts with serum collected from a breast cancer patient, transferred to a PCR plate and machine. cfDNA is analyzed for methylated genes (SFN, P16, hMLH1, HOXD13, PCDHGB7, RASSF1A) to evaluate sensitivity and specificity in diagnosis. Furthermore, new DNA methylation markers, including PRAC2, TDR10, and TMEM132C, were discovered to be promising diagnostic and prognostic indicators because of their elevated expression in breast tumor tissue, particularly among ER + de Almeida et al., 2019 Nandy et al., 2020 The epigenetic features of BC can likewise be identified through ctDNA analysis for the purpose of timely detection and targeted treatment of BC ( Rohanizadegan, 2018 ® Agostini et al., 2011 Liu et al., 2015 Epigenetic biomarkers may serve as indicators to anticipate how patients will respond to therapeutic drugs ( Berdasco and Esteller, 2019 Parrella, 2018 Goyal et al., 2019 Thomas and Marcato, 2018 Methylation of ESR1 DNA in plasma ctDNA samples is expressively linked with absence of estrogen receptor (ER) expression in excised tumors, which is related with a reduced response to endocrine therapy ( Martínez-Galán, 2014 Stone et al., 2015 Mastoraki et al., 2018 Liu et al., 2015 Laham-Karam et al., 2020 FDA has approved a blood-based test for biomarkers related to breast cancer. Various cancer antigen biomarkers, including CA15−3, CA27.29, CA-125, CEA (carcinoembryonic antigen), and CTCs, are primarily suggested as prognostic indicators to evaluate the effectiveness of treatment and detect disease recurrence, rather than for early diagnosis. At present, the only screening test utilized for hereditary BC involves mutation analysis applying gene mutation markers (BRCA1 and BRCA2) ( Tang et al., 2016 in vitro + + Vieira and Schmitt, 2018 Sher et al., 2022 Recently, Garcia and colleagues suggested that cfDNAs found in plasma could serve as a prognostic indicator for individuals with metastatic BC ( Fernandez-Garcia et al., 2019 Panagopoulou et al., 2019 Peled et al., 2020 4.2 Epigenetic based therapy for BC Histone methyltransferases alteration promote development of epidrugs aimed at various chromatin regulators ( Richart and Margueron, 2020 + Kim et al., 2023 + + Fang et al., 2021 Cuyàs et al., 2020 4.2.1 DNMT inhibitors (DNMTis) DNMT inhibitors hold significant promise for the treatment of cancer. Recently, their application has been highlighted within the realm of immuno-oncology. DNMT inhibitors enhance the immunogenicity of tumors by promoting the secretion of cytokines through immune cell activation. DNMT inhibitors represent a hopeful therapeutic option for cancer treatment and demonstrate anti-tumor effects specifically against BC ( Wong, 2021 Su et al., 2018 Yu et al., 2018 Vernier et al., 2020 Azacitidine may work as a new therapeutic option in treatment of preclinical BC. Treatment with azacitidine hinders the metastasis of breast cancer to the brain. It reduces Wnt signaling pathway, as well as cell invasion, cell migration and tumour development in cells that colonize the brain ( Butler et al., 2020 Terranova-Barberio et al., 2017 in vivo Gilmer, 2020 Wong, 2021 Liraglutide, an anti-diabetic, can function as a DNMT inhibitor in BC both in laboratory settings and in Ehnlich mouse tumor models. The findings indicated that it decreased cell migration, viability and DNMT activity ( Ayipo et al., 2022 Chequin et al., 2021 4.2.2 HDAC inhibitors HDACs have a crucial role in regulating important genes related with the development and survival of cancer cells. Consequently, inhibiting HDACs is an effective approach for treating cancer cells. HDAC inhibitors can be categorized into benzamides, short-chain fatty acids, hydroxamic acids (hydroxamates), sirtuin inhibitors and cyclic tetrapeptides ( Cappellacci et al., 2020 Vorinostat was the inaugural HDAC inhibitor to receive approval from FDA ( Zhou et al., 2019 Patra et al., 2022 in vivo Zucchetti et al., 2019 Transwell assays for migration, invasion and healing of wound have demonstrated that treatment with trichostatin A (TSA) significantly hampers the invasion and migration capabilities of BC cells ( Wang et al., 2020 Wang et al., 2021 in vivo Qin et al., 2019 Laengle et al., 2020 Huang et al., 2019 Wawruszak et al., 2021 Wawruszak et al., 2021 Wu et al., 2021 Ediriweera et al., 2019 HDACi effectiveness in solid tumours as a standalone treatment is not consistently positive. For this reason, it is advised to use them in combination with other therapies like hormone therapy, chemotherapy and immunomodulatory agents. HDAC inhibitors have the ability to restore proteins unchecked acetylation linked to the pathways of cancer and reactive tumor suppressor genes, which can result in the arrest of the cell cycle and induce apoptosis in cancer cells ( Song et al., 2021 Kim et al., 2023 In a recent investigation, researchers successfully developed patient-derived organoids for TNBC, creating a valuable model of conducting high-throughput drug screenings. Through this approach, they discovered new epigenetic compounds that target histone deacetylase, JAK/STAT, aurora kinase and histone demethylases pathways, demonstrating a notable tumour-killing properties against TNBC. In the identified compounds, TAK-901, panobinostat, JIB-04 and pacritinib displayed greater effectiveness compared to paclitaxel. These results emphasize that these compounds may serve as good therapeutic options for TNBC and support the importance of patient-derived organoids in progressing drug discovery ( Rao et al., 2024 4.2.3 Bromodomain and extraterminal domain (BET) inhibitors In the treatment of malignant tumors, bromodomain (BRDs) and extraterminal (BET) proteins inhibitors have been appeared to be novel targeted medicines that control the epigenetic alterations in such conditions ( Filippakopoulos et al., 2010 Filippakopoulos et al., 2012 Dawson et al., 2011 Bell et al., 2019 Filippakopoulos et al., 2010 Filippakopoulos et al., 2010 A small molecule inhibitor of BRD2, BRD3 and BRD4, OTX015, having a structure similarity to JQ1, represents a significant advancement in its oral administration ( Boi et al., 2015 Coudé et al., 2015 Baratta et al., 2015 in vitro Boi et al., 2015 Piha- et al., 2020 Zhang G. et al., 2015 Zhang G. et al., 2015 in vivo in vitro Hu et al., 2023 in vitro in vivo Deng et al., 2022 4.2.4 Non-coding RNA-Based therapies According to data from the Human Genome Project, more than 90% of genome is transcribed but around about 2% of it is translated while the total RNAs consisted of 98% non-coding (nc) RNAs. In contrast to genes of protein-coding, research has demonstrated that ncRNAs have important functions in many biological processes, including transcription, chromatin remodeling, signal transduction and post-transcriptional modification ( Merrill et al., 2020 Wang et al., 2019 Levin, 2019 Yardim-Akaydin et al., 2022 Xiong et al., 2023 Kopp and Mendell, 2018 Winkle et al., 2021 Given the possibility of ncRNA therapies, the associated challenges of complexity and diversity, stability problems, delivery methods, specificity, further investigation are necessary to produce clinically useful applications. Illuminating the various roles and modes of action of ncRNA is one of the biggest difficulties in the field of present time research. This is important because it will help determine its clinical relevance and develop its potential application as a therapeutic target or biomarker ( Nemeth et al., 2024 4.2.4.1 lncRNA therapy in breast cancer chemoresistance Metastasis and resistance are the two main issues that emerge during the treatment of breast cancer ( Echeverria et al., 2019 Chen et al., 2022 Luo et al., 2024 Liu Z. et al., 2022 Chen et al. (2023) Yang et al. (2024) Liu X. et al. (2022) Liu et al., 2023 4.2.4.2 miRNA-targeted therapy in breast cancer miRNAs produced from circulating extracellular vesicles (EVs) have become increasingly recognized as next-generation “therapeutic diagnostic” tools for cancer that have significant clinical utility ( Giordano et al., 2023 Donnarumma et al., 2017 Melo et al., 2014 Zhang J. et al., 2015 Wang et al., 2018 Chen et al., 2021 Yang et al., 2021 Wortzel et al., 2019 Liang et al., 2016 Ikeda et al., 2015 + Arabkari et al., 2023 4.2.4.3 Targeted delivery during miRNA therapy The capacity of tumor cells to undergo EMT, invasion, and metastasis may be diminished by over expression of some miRNAs that function as oncogenes in malignancies. But the biggest obstacle to using miRNAs as therapeutic agents is still their distribution within cells ( Mollaei et al., 2019 Adams et al., 2009 Chaudhari et al. (2022) Garrido-Cano et al. (2023) Ma et al., 2022 Kardani et al. (2020) in vivo Fang et al., 2022 Nie et al., 2020 4.2.4.4 Potential therapies for other non-coding RNAs in breast cancer CircRNAs control endocrine resistance by acting as miRNA sponges ( Yi et al., 2023 Xia et al. (2023) Liang et al., 2019 Jiang et al. (2023) Li et al. (2020) Wu Y. et al., 2019 Behrouzian Fard et al., 2024 in vitro Mao et al., 2023 Moitra et al., 2024 4.2.5 Combination therapy Past research has explored the effectiveness of DNMT inhibitors and HDAC inhibitors in treating breast cancer. Nevertheless, these studies have demonstrated limited effectiveness even at the highest tolerated doses. As a result, epidrugs have been utilized alongside cytotoxic drugs, radiation treatment, targeted therapies, and hormonal treatments for breast cancer ( Exman et al., 2019 Buocikova et al., 2020 Yellapu et al., 2022 Laengle et al., 2020 The oncogenic E2-ERα axis is the main target of endocrine treatments. In 1896, when BC patients’ tumors shrank after both ovaries had been surgically removed, steroid hormone signaling was first linked to the advancement of BC. This finding supported the use of endocrine therapy ( Beatson, 1896 + Hanker et al., 2020 For more than 30 years, tamoxifen has been remained the main treatment option for patients with both early and metastatic BC. It was the first ERα-targeted medication to receive clinical approval. Tamoxifen is a SERM that inhibits coactivator recruitment mediated by the LBD of ERα and competes with E2 for ERα binding. Through a ligand-independent mechanism, in vitro Liu et al., 2001 Group, 2005 Guan et al., 2019 Robertson et al., 2016 Guan et al., 2019 Fanning and Greene, 2019 Burstein, 2020 + Burstein, 2020 + + Jeselsohn et al., 2015 de novo Razavi et al., 2018 + Given, endocrine therapy has established itself as a vital treatment option for breast tumors that respond to hormones. However, there is an urgent need to create techniques to tackle the apparently unavoidable resistant phenotype. The emerging new era of epigenetic-based therapeutics to screen and treat a variety of diseases, including BC, is evidenced by recent advancements in the epidrug field. 4.2.6 Epi-drugs with nanotechnology The instability, toxicity, and unintended effects of epidrugs are significant barriers to their effectiveness in treating solid tumors. Nanotechnology offers a means to specifically and directly target therapies at cancer cells. This approach allows for safer and more efficient delivery of epidrugs. Additionally, cancer nanotechnology can mitigate systemic toxicity by enhancing pharmacokinetics and selectively delivering anticancer medications to tumors. For example, nanoparticles such as albumin, membrane-camouflaged, lactoferrin and exosome-disguised nanoparticles represent innovative nanotechnologies aimed at directing tumor cells and modifying microenvironment of tumour in BC. Nano-delivery based on epigenetics promotes apoptosis and disrupts migration and proliferation ( Zhang et al., 2023 Roberti et al., 2019 Table 3 TABLE 3 Epigenetic agents and their mechanism. Epidrugs Mechanism Iadademstat anti-SOX-2 Decitabine demethylates DNA Azacitidine Hinders metastasis of BC to the brain and reduces the Wnt signaling pathway Vorinostat increase in the expression of PD-L1 mRNA Guadecitabine enhances the expression of PD-L1 and MHC class I while reducing the proliferation of tumor cells. Liraglutide decreased cell viability, migration, and DNMT activity Simvastatin and Vorinostat blocking Rab7 prenylation in xenograft mice in vivo Letrozole an aromatase inhibitor Trichostatin A strong inhibitor of pandeacetylase Panobinostat an HDAC inhibitor Varprobic acid Suppresses proliferation of HER2+ BC cells by increasing the expression of p21 WAF1 Azacytidine and Entinostat Cause re-expression of ER and effective resistance to anti-estrogen treatments in ER-positive BC BET inhibitor JQ1 either on its own or when paired with specific molecules that promote the downregulation of estrogen receptors, inhibited the proliferation of tamoxifen-resistant cells 4.3 Clinical trials Connecting epigenetic research with practical medical use presents multiple obstacles. Converting discoveries from the lab into successful treatments demands not only a thorough knowledge of epigenetic processes but also comprehensive clinical trials to evaluate their effectiveness and safety. For instance, although epigenetic medications might demonstrate potential in cell cultures or animal experiments, their safety and effectiveness in human patients can be established solely through thorough clinical trials ( Prabhu et al., 2024 Preclinical research has shown that epi-drug DNMT inhibitors can diminish the tumorigeniNON-c potential of cancer stem cells by downregulating genes associated with stemness and differentiation. HDAC inhibitors reduce the functionality of cancer stem cells by affecting various critical genes that play a role in the maintenance of these cells, including those that code for β, γ-catenin, Stat3, and Notch1, which leads to a decrease in tumor formation ( Xu et al., 2022 Hogg et al., 2020 in vivo Leclercq et al., 2011 Tomaselli et al., 2020 Hydralazine has the potential to promote demethylation and reactivate tumor suppressor genes when used as a treatment for hypertension. This may increase the effectiveness of both biological and chemical therapies. In phase I, a clinical trial was undertaken to establish the safety of the dosage alongside standard cytotoxic chemotherapy in breast cancer patients. The findings from phase I revealed that hydralazine was well tolerated and showed no adverse effects on chemotherapy at doses of 200 mg or lower. Zambrano et al. demonstrated that demethylation occurred in up to 52% of the promoter region in selected tumor suppressor genes within a safe dose range to minimize toxicity. Further research on the combination of hydralazine and conventional cytotoxic chemotherapy is necessary, as these appear to be promising approaches to enhance effectiveness in phase II ( Wu Y. S. et al., 2019 Cai et al., 2011 A recent study performed immunohistochemical profiling of over 20 histone biomarkers, which included histone modifications, modifiers, and oncohistone mutations, across two cohorts of breast cancer tissues, a discovery cohort and a validation cohort, as well as healthy controls and cell line models. To assess the impact of the G9a small-molecule inhibitor in various breast cancer models, transcriptomic and cell growth analyses were carried out. Notable histone biomarkers such as H3K9me2, H3K36me2, and H3K79me showed differential expression among the breast cancer subtypes. H3K9me2 was identified as an independent marker for differentiating triple-negative breast cancer (TNBC) from other, less aggressive breast cancer subtypes, with increased expression linked to higher tumor grades and stages. Inhibition of G9a led to reduced cell proliferation and alteration of epithelial-mesenchymal transition pathways, particularly exhibiting the most pronounced effects in basal-like TNBC. Disruption in the regulation of oncogenes and tumor suppressors, such as TP53 and SATB1, was found in TNBC. This research emphasizes the context-dependent functions of G9a in breast cancer, indicating its potential as a target for therapy. The results lay the groundwork for epigenetic therapies tailored to specific subtypes to enhance outcomes for aggressive breast cancer types ( Huo et al., 2025 5 Limitations and prospects There are several difficulties linked to the primary strategies of epidrugs concerning cytotoxicity, tolerance, selectivity, and potency. When patients with early-stage ER+ breast cancer are treated solely with epidrugs, one-third experience treatment resistance, and there is also drug resistance observed in TNBC ( Jones et al., 2016 de Lera and Ganesan, 2016 Li et al., 2017 Webster et al., 2017 Benedetti et al., 2015 Doostmohammadi et al., 2024 Xu et al., 2022 6 Conclusion Epigenetic has emerged as a crucial field in breast cancer, providing novel insights into disease progression and treatment resistance. This review highlights the potential of epigenetic biomarkers in improving early detection and patient stratification, paving the way for precision oncology. Despite the promising advancements, challenges such as the stability and reproducibility of epigenetic signatures, as well as the clinical translation of epi-drugs, remain to be addressed. Future research should focus on large-scale clinical trials to validate epigenetic biomarker and optimize combination therapies for enhanced therapeutic outcomes. Additionally, the integration of nanotechnology in epigenetic drug delivery holds promise for overcoming drug resistance and minimizing adverse effects. As our understanding of BC epigenetics continues to evolve, leveraging these molecular insights could lead to more effective, personalized treatment strategies, ultimately improving patient prognosis and survival rates. Moreover, public health education programs and awareness campaigns including Breast Cancer Awareness Month, community screening drives, and risk reduction workshops have been implemented globally to improve early detection and inform women at risk, highlighting the importance of integrating epigenetic knowledge into community-level education and prevention strategies. The author would like to thank the Deanship of Scientific Research at Shaqra University for supporting this work. Data availability statement The raw data supporting the conclusions of this article will be made available by the author, without undue reservation. Author contributions GA: Writing – original draft, Writing – review and editing. Conflict of interest The author declares that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References Adams B. D. Cowee D. M. White B. A. 2009 The role of miR-206 in the epidermal growth factor (EGF) induced repression of estrogen receptor-alpha (ERalpha) signaling and a luminal phenotype in MCF-7 breast cancer cells Mol. Endocrinol. 23 8 1215 1230 10.1210/me.2009-0062 19423651 PMC2718747 Agostini M. Enzo M. V. Bedin C. Belardinelli V. Goldin E. Del Bianco P. 2011 Circulating cell-free DNA: a promising marker of regional lymphonode metastasis in breast cancer patients Cancer Biomarkers 11 2-3 89 98 10.3233/CBM-2012-0263 23011155 Alba-Bernal A. Lavado-Valenzuela R. Domínguez-Recio M. E. Jiménez-Rodriguez B. Queipo-Ortuño M. I. Alba E. 2020 Challenges and achievements of liquid biopsy technologies employed in early breast cancer EBioMedicine 62 103100 10.1016/j.ebiom.2020.103100 33161226 PMC7670097 Ansari J. Shackelford R. E. El-Osta H. 2016 Epigenetics in non-small cell lung cancer: from basics to therapeutics Transl. Lung Cancer Res. 5 2 155 171 10.21037/tlcr.2016.02.02 27186511 PMC4858572 Arabkari V. Barua D. Hossain M. M. Webber M. Smith T. Gupta A. 2023 miRNA-378 is downregulated by XBP1 and inhibits growth and migration of luminal breast cancer cells Int. J. Mol. Sci. 25 1 186 10.3390/ijms25010186 38203358 PMC10778669 Ayipo Y. O. Ajiboye A. T. Osunniran W. A. Jimoh A. A. Mordi M. N. 2022 Epigenetic oncogenesis, biomarkers and emerging chemotherapeutics for breast cancer Biochimica Biophysica Acta (BBA)-Gene Regul. Mech. 1865 7 194873 10.1016/j.bbagrm.2022.194873 36064110 Baratta M. G. Schinzel A. C. Zwang Y. Bandopadhayay P. Bowman-Colin C. Kutt J. 2015 An in-tumor genetic screen reveals that the BET bromodomain protein, BRD4, is a potential therapeutic target in ovarian carcinoma Proc. Natl. Acad. Sci. 112 1 232 237 10.1073/pnas.1422165112 25535366 PMC4291641 Baylin S. B. Jones P. A. 2016 Epigenetic determinants of cancer Cold Spring Harb. Perspect. Biol. 8 9 a019505 10.1101/cshperspect.a019505 27194046 PMC5008069 Beatson G. T. 1896 On the treatment of inoperable cases of carcinoma of the mamma: suggestions for a new method of treatment, with illustrative cases Trans. Medico-Chirurgical Soc. Edinb. 15 153 179 29584099 PMC5518378 Behrouzian Fard G. Ahmadi M. H. Gholamin M. Amirfakhrian R. Saberi Teimourian E. Karimi M. A. 2024 CRISPR‐Cas9 technology: as an efficient genome modification tool in the cancer diagnosis and treatment Biotechnol. Bioeng. 121 2 472 488 10.1002/bit.28603 37986642 Bell C. C. Fennell K. A. Chan Y. C. Rambow F. Yeung M. M. Vassiliadis D. 2019 Targeting enhancer switching overcomes non-genetic drug resistance in acute myeloid leukaemia Nat. Commun. 10 1 2723 10.1038/s41467-019-10652-9 31222014 PMC6586637 Benedetti R. Conte M. Iside C. Altucci L. 2015 Epigenetic-based therapy: from single-to multi-target approaches Int. J. Biochem. & Cell Biol. 69 121 131 10.1016/j.biocel.2015.10.016 26494003 Berdasco M. Esteller M. 2019 Clinical epigenetics: seizing opportunities for translation Nat. Rev. Genet. 20 2 109 127 10.1038/s41576-018-0074-2 30479381 Boi M. Gaudio E. Bonetti P. Kwee I. Bernasconi E. Tarantelli C. 2015 The BET bromodomain inhibitor OTX015 affects pathogenetic pathways in preclinical B-cell tumor models and synergizes with targeted drugs Clin. Cancer Res. 21 7 1628 1638 10.1158/1078-0432.CCR-14-1561 25623213 Brzeziańska E. Dutkowska A. Antczak A. 2013 The significance of epigenetic alterations in lung carcinogenesis Mol. Biol. Rep. 40 1 309 325 10.1007/s11033-012-2063-4 23086271 PMC3518808 Buocikova V. Rios-Mondragon I. Pilalis E. Chatziioannou A. Miklikova S. Mego M. 2020 Epigenetics in breast cancer therapy—new strategies and future nanomedicine perspectives Cancers 12 12 3622 10.3390/cancers12123622 33287297 PMC7761669 Burstein H. J. 2020 Systemic therapy for estrogen receptor–positive, HER2-negative breast cancer N. Engl. J. Med. 383 26 2557 2570 10.1056/NEJMra1307118 33369357 Butler C. Sprowls S. Szalai G. Arsiwala T. Saralkar P. Straight B. 2020 Hypomethylating agent azacitidine is effective in treating brain metastasis triple-negative breast cancer through regulation of DNA methylation of keratin 18 gene Transl. Oncol. 13 6 100775 10.1016/j.tranon.2020.100775 32408199 PMC7225776 Cai F.-F. Kohler C. Zhang B. Wang M. H. Chen W. J. Zhong X. Y. 2011 Epigenetic therapy for breast cancer Int. J. Mol. Sci. 12 7 4465 4487 10.3390/ijms12074465 21845090 PMC3155363 Cappellacci L. Perinelli D. R. Maggi F. Grifantini M. Petrelli R. 2020 Recent progress in histone deacetylase inhibitors as anticancer agents Curr. Med. Chem. 27 15 2449 2493 10.2174/0929867325666181016163110 30332940 Chaudhari R. Nasra S. Meghani N. Kumar A. 2022 MiR-206 conjugated gold nanoparticle based targeted therapy in breast cancer cells Sci. Rep. 12 1 4713 10.1038/s41598-022-08185-1 35304514 PMC8933417 Chen B. Sang Y. Song X. Zhang D. Wang L. Zhao W. 2021 Exosomal miR-500a-5p derived from cancer-associated fibroblasts promotes breast cancer cell proliferation and metastasis through targeting USP28 Theranostics 11 8 3932 3947 10.7150/thno.53412 33664871 PMC7914354 Chen X. Luo R. Zhang Y. Ye S. Zeng X. Liu J. 2022 Long noncoding RNA DIO3OS induces glycolytic-dominant metabolic reprogramming to promote aromatase inhibitor resistance in breast cancer Nat. Commun. 13 1 7160 10.1038/s41467-022-34702-x 36418319 PMC9684133 Chen X. Ding J. C. Hu G. S. Shu X. Y. Liu Y. Du J. 2023 Estrogen‐Induced LncRNA, LINC02568, promotes estrogen receptor‐positive breast cancer development and drug resistance through both in trans and in cis mechanisms Adv. Sci. 10 25 2206663 10.1002/advs.202206663 37404090 PMC10477896 Cheng Y. Wang M. Ma X. Mo F. Yang S. 2019 Targeting epigenetic regulators for cancer therapy: mechanisms and advances in clinical trials Signal Transduct. Target. Ther. 4 1 62 10.1038/s41392-019-0095-0 31871779 PMC6915746 Chequin A. Costa L. E. de Campos F. F. Moncada A. D. B. de Lima L. T. F. Sledz L. R. 2021 Antitumoral activity of liraglutide, a new DNMT inhibitor in breast cancer cells in vitro in vivo Chemico-Biological Interact. 349 109641 10.1016/j.cbi.2021.109641 34534549 Coudé M.-M. Braun T. Berrou J. Dupont M. Bertrand S. Masse A. 2015 BET inhibitor OTX015 targets BRD2 and BRD4 and decreases c-MYC in acute leukemia cells Oncotarget 6 19 17698 17712 10.18632/oncotarget.4131 25989842 PMC4627339 Cuyàs E. Gumuzio J. Verdura S. Brunet J. Bosch-Barrera J. Martin-Castillo B. 2020 The LSD1 inhibitor iadademstat (ORY-1001) targets SOX2-driven breast cancer stem cells: a potential epigenetic therapy in luminal-B and HER2-positive breast cancer subtypes Aging (Albany NY) 12 6 4794 4814 10.18632/aging.102887 32191225 PMC7138538 Dai X. Li T. Bai Z. Yang Y. Liu X. Zhan J. 2015 Breast cancer intrinsic subtype classification, clinical use and future trends Am. J. cancer Res. 5 10 2929 2943 26693050 PMC4656721 Dawson M. A. Kouzarides T. 2012 Cancer epigenetics: from mechanism to therapy cell 150 1 12 27 10.1016/j.cell.2012.06.013 22770212 Dawson M. A. Prinjha R. K. Dittmann A. Giotopoulos G. Bantscheff M. Chan W. I. 2011 Inhibition of BET recruitment to chromatin as an effective treatment for MLL-fusion leukaemia Nature 478 7370 529 533 10.1038/nature10509 21964340 PMC3679520 de Almeida B. P. Apolónio J. D. Binnie A. Castelo-Branco P. 2019 Roadmap of DNA methylation in breast cancer identifies novel prognostic biomarkers BMC cancer 19 219 12 10.1186/s12885-019-5403-0 30866861 PMC6416975 de Lera A. R. Ganesan A. 2016 Epigenetic polypharmacology: from combination therapy to multitargeted drugs Clin. Epigenetics 8 1 105 10.1186/s13148-016-0271-9 27752293 PMC5062873 Deng G. Zeng F. He Y. Meng Y. Sun H. Su J. 2022 EEF2K silencing inhibits tumour progression through repressing SPP1 and synergises with BET inhibitors in melanoma Clin. Transl. Med. 12 2 e722 10.1002/ctm2.722 35184394 PMC8858631 Donnarumma E. Fiore D. Nappa M. Roscigno G. Adamo A. Iaboni M. 2017 Cancer-associated fibroblasts release exosomal microRNAs that dictate an aggressive phenotype in breast cancer Oncotarget 8 12 19592 19608 10.18632/oncotarget.14752 28121625 PMC5386708 Doostmohammadi A. Jooya H. Ghorbanian K. Gohari S. Dadashpour M. 2024 Potentials and future perspectives of multi-target drugs in cancer treatment: the next generation anti-cancer agents Cell Commun. Signal 22 1 228 10.1186/s12964-024-01607-9 38622735 PMC11020265 Echeverria G. V. Ge Z. Seth S. Zhang X. Jeter-Jones S. Zhou X. 2019 Resistance to neoadjuvant chemotherapy in triple-negative breast cancer mediated by a reversible drug-tolerant state Sci. Transl. Med. 11 488 eaav0936 10.1126/scitranslmed.aav0936 30996079 PMC6541393 Ediriweera M. K. Tennekoon K. H. Samarakoon S. R. 2019 Emerging role of histone deacetylase inhibitors as anti-breast-cancer agents Drug Discov. Today 24 3 685 702 10.1016/j.drudis.2019.02.003 30776482 Egger G. 2018 Epigenetic biomarkers in cancer ESMO open 3 5 e000416 10.1136/esmoopen-2018-000416 30116593 PMC6088343 Erdmann A. Halby L. Fahy J. Arimondo P. B. 2015 Targeting DNA methylation with small molecules: what's next? J. Med. Chem. 58 6 2569 2583 10.1021/jm500843d 25406944 Exman P. Barroso-Sousa R. Tolaney S. M. 2019 Evidence to date: talazoparib in the treatment of breast cancer Onco Targets Ther. 12 5177 5187 10.2147/OTT.S184971 31303769 PMC6612288 Fang Y. Yang C. Yu Z. Li X. Mu Q. Liao G. 2021 Natural products as LSD1 inhibitors for cancer therapy Acta Pharm. Sin. B 11 3 621 631 10.1016/j.apsb.2020.06.007 32837872 PMC7305746 Fang Z. Zhang X. Huang H. Wu J. 2022 Exosome based miRNA delivery strategy for disease treatment Chin. Chem. Lett. 33 4 1693 1704 10.1016/j.cclet.2021.11.050 Fanning S. W. Greene G. L. 2019 Next-generation ERα inhibitors for endocrine-resistant ER+ breast cancer Next-Generation ER α Inhibitors Endocrine-Resistant ER+ Breast Cancer. 160 4 759 769 10.1210/en.2018-01095 30753408 Fernandez-Garcia D. Hills A. Page K. Hastings R. K. Toghill B. Goddard K. S. 2019 Plasma cell-free DNA (cfDNA) as a predictive and prognostic marker in patients with metastatic breast cancer Breast Cancer Res. 21 149 13 10.1186/s13058-019-1235-8 31856868 PMC6924016 Filippakopoulos P. Qi J. Picaud S. Shen Y. Smith W. B. Fedorov O. 2010 Selective inhibition of BET bromodomains Nature 468 7327 1067 1073 10.1038/nature09504 20871596 PMC3010259 Filippakopoulos P. Picaud S. Mangos M. Keates T. Lambert J. P. Barsyte-Lovejoy D. 2012 Histone recognition and large-scale structural analysis of the human bromodomain family Cell 149 1 214 231 10.1016/j.cell.2012.02.013 22464331 PMC3326523 Garrido-Cano I. Adam-Artigues A. Lameirinhas A. Blandez J. F. Candela-Noguera V. Lluch A. 2023 Delivery of miR-200c-3p using tumor-targeted mesoporous silica nanoparticles for breast cancer therapy ACS Appl. Mater. & Interfaces 15 32 38323 38334 10.1021/acsami.3c07541 37549382 PMC10436244 Gilmer J.-J. 2020 Comb. Ther. Guadecitabine Immune Checkp. Inhibitors a Murine Triple-Negative Breast Cancer Model Ginsburg O. Yip C. H. Brooks A. Cabanes A. Caleffi M. Dunstan Yataco J. A. 2020 Breast cancer early detection: a phased approach to implementation Cancer 126 2379 2393 10.1002/cncr.32887 32348566 PMC7237065 Giordano C. Accattatis F. M. Gelsomino L. Del Console P. Győrffy B. Giuliano M. 2023 miRNAs in the box: potential diagnostic role for extracellular vesicle-packaged miRNA-27a and miRNA-128 in breast cancer Int. J. Mol. Sci. 24 21 15695 10.3390/ijms242115695 37958677 PMC10649351 Goyal A. Sahu R. K. Kumar M. Sharma S. Qayyum S. Kaur N. 2019 p16 promoter methylation, expression, and its association with estrogen receptor, progesterone receptor, and human epidermal growth factor receptor 2 subtype of breast carcinoma J. cancer Res. Ther. 15 5 1147 1154 10.4103/jcrt.JCRT_472_18 31603125 Group E. B. C. T. C. 2005 Effects of chemotherapy and hormonal therapy for early breast cancer on recurrence and 15-year survival: an overview of the randomised trials Lancet 365 9472 1687 1717 10.1016/S0140-6736(05)66544-0 15894097 Guan J. Zhou W. Hafner M. Blake R. A. Chalouni C. Chen I. P. 2019 Therapeutic ligands antagonize estrogen receptor function by impairing its mobility Cell 178 4 949 963.e18 10.1016/j.cell.2019.06.026 31353221 Guo P. Chen W. Li H. Li L. 2018 The histone acetylation modifications of breast cancer and their therapeutic implications Pathology & Oncol. Res. 24 807 813 10.1007/s12253-018-0433-5 29948617 Hanker A. B. Sudhan D. R. Arteaga C. L. 2020 Overcoming endocrine resistance in breast cancer Cancer cell 37 4 496 513 10.1016/j.ccell.2020.03.009 32289273 PMC7169993 Hogg S. J. Beavis P. A. Dawson M. A. Johnstone R. W. 2020 Targeting the epigenetic regulation of antitumour immunity Nat. Rev. Drug Discov. 19 11 776 800 10.1038/s41573-020-0077-5 32929243 Holliday R. 1994 Epigenetics: an overview 10.1002/dvg.1020150602 7834903 Hu R. Li Y. Guo Y. Li X. Du S. Liao M. 2023 BRD4 inhibitor suppresses melanoma metastasis via the SPINK6/EGFR-EphA2 pathway Pharmacol. Res. 187 106609 10.1016/j.phrs.2022.106609 36516883 Huang M. Zhang J. Yan C. Li X. Zhang J. Ling R. 2019 Small molecule HDAC inhibitors: promising agents for breast cancer treatment Bioorg. Chem. 91 103184 10.1016/j.bioorg.2019.103184 31408831 Huo Z. Zhang S. Su G. Cai Y. Chen R. Jiang M. 2025 Immunohistochemical profiling of histone modification biomarkers identifies subtype-specific epigenetic signatures and potential drug targets in breast cancer Int. J. Mol. Sci. 26 2 770 10.3390/ijms26020770 39859484 PMC11765579 Ikeda K. Horie-Inoue K. Ueno T. Suzuki T. Sato W. Shigekawa T. 2015 miR-378a-3p modulates tamoxifen sensitivity in breast cancer MCF-7 cells through targeting GOLT1A Sci. Rep. 5 1 13170 10.1038/srep13170 26255816 PMC4530347 Jeselsohn R. Buchwalter G. De Angelis C. Brown M. Schiff R. 2015 ESR1 mutations—a mechanism for acquired endocrine resistance in breast cancer Nat. Rev. Clin. Oncol. 12 10 573 583 10.1038/nrclinonc.2015.117 26122181 PMC4911210 Jiang W. Yu Y. Ou J. Li Y. Zhu N. 2023 Exosomal circRNA RHOT1 promotes breast cancer progression by targeting miR-204-5p/PRMT5 axis Cancer cell Int. 23 1 260 10.1186/s12935-023-03111-5 37924099 PMC10623849 Jones P. A. Issa J.-P. J. Baylin S. 2016 Targeting the cancer epigenome for therapy Nat. Rev. Genet. 17 10 630 641 10.1038/nrg.2016.93 27629931 Kalia M. 2015 Biomarkers for personalized oncology: recent advances and future challenges Metabolism 64 3 Suppl. 1 S16 S21 10.1016/j.metabol.2014.10.027 25468140 Kardani A. Yaghoobi H. Alibakhshi A. Khatami M. 2020 Inhibition of miR‐155 in MCF‐7 breast cancer cell line by gold nanoparticles functionalized with antagomir and AS1411 aptamer J. Cell. Physiology 235 10 6887 6895 10.1002/jcp.29584 32003016 Kaur M. Joshu C. E. Visvanathan K. Connor A. E. 2022 Trends in breast cancer incidence rates by race/ethnicity: patterns by stage, socioeconomic position, and geography in the United States, 1999‐2017 Cancer 128 5 1015 1023 10.1002/cncr.34008 34731501 PMC9533488 Kim J.-H. Shin M. H. Kweon S. S. Park M. H. Yoon J. H. Lee J. S. 2010 Evaluation of promoter hypermethylation detection in serum as a diagnostic tool for breast carcinoma in Korean women Gynecol. Oncol. 118 2 176 181 10.1016/j.ygyno.2010.04.016 20466412 Kim A. Mo K. Kwon H. Choe S. Park M. Kwak W. 2023 Epigenetic regulation in breast cancer: insights on epidrugs Epigenomes 7 1 6 10.3390/epigenomes7010006 36810560 PMC9953240 Kopp F. Mendell J. T. 2018 Functional classification and experimental dissection of long noncoding RNAs Cell 172 3 393 407 10.1016/j.cell.2018.01.011 29373828 PMC5978744 Laengle J. Kabiljo J. Hunter L. Homola J. Prodinger S. Egger G. 2020 Histone deacetylase inhibitors valproic acid and vorinostat enhance trastuzumab-mediated antibody-dependent cell-mediated phagocytosis J. Immunother. cancer 8 1 e000195 10.1136/jitc-2019-000195 31940587 PMC7057438 Laham-Karam N. Pinto G. P. Poso A. Kokkonen P. 2020 Transcription and translation inhibitors in cancer treatment Front. Chem. 8 276 10.3389/fchem.2020.00276 32373584 PMC7186406 Langevin S. M. Kratzke R. A. Kelsey K. T. 2015 Epigenetics of lung cancer Transl. Res. 165 1 74 90 10.1016/j.trsl.2014.03.001 24686037 PMC4162853 Leclercq S. Gueugnon F. Boutin B. Guillot F. Blanquart C. Rogel A. 2011 A 5-aza-2'-deoxycytidine/valproate combination induces cytotoxic T-cell response against mesothelioma Eur. Respir. J. 38 5 1105 1116 10.1183/09031936.00081310 21540307 Levin A. A. 2019 Treating disease at the RNA level with oligonucleotides N. Engl. J. Med. 380 1 57 70 10.1056/NEJMra1705346 30601736 Li J. Hao D. Wang L. Wang H. Wang Y. Zhao Z. 2017 Epigenetic targeting drugs potentiate chemotherapeutic effects in solid tumor therapy Sci. Rep. 7 1 4035 10.1038/s41598-017-04406-0 28642588 PMC5481380 Li Q. Qin T. Bi Z. Hong H. Ding L. Chen J. 2020 Rac1 activates non-oxidative pentose phosphate pathway to induce chemoresistance of breast cancer Nat. Commun. 11 1 1456 10.1038/s41467-020-15308-7 32193458 PMC7081201 Liang A.-L. Zhang T. T. Zhou N. Wu C. Y. Lin M. H. Liu Y. J. 2016 MiRNA-10b sponge: an anti-breast cancer study in vitro Oncol. Rep. 35 4 1950 1958 10.3892/or.2016.4596 26820121 PMC4774667 Liang W. H. Yuan Z. Q. Qian X. L. Wang Z. H. 2019 DSCAM‐AS1 promotes tumor growth of breast cancer by reducing miR‐204‐5p and up‐regulating RRM2 Mol. Carcinog. 58 4 461 473 10.1002/mc.22941 30457164 Liu H. Lee E. S. Deb Los Reyes A. Zapf J. W. Jordan V. C. 2001 Silencing and reactivation of the selective estrogen receptor modulator-estrogen receptor α complex Cancer Res. 61 9 3632 3639 11325832 Liu L. Sun L. Li C. Li X. Zhang Y. Yu Y. 2015 Quantitative detection of methylation of FHIT and BRCA1 promoters in the serum of ductal breast cancer patients Bio-medical Mater. Eng. 26 s1 S2217 S2222 10.3233/BME-151527 26406001 Liu C. Lv D. Zhang X. Sun G. Bai Y. 2017 Hypermethylation of miRNA-589 promoter leads to upregulation of HDAC5 which promotes malignancy in non-small cell lung cancer Int. J. Oncol. 50 6 2079 2090 10.3892/ijo.2017.3967 28440397 Liu Z. Liu J. Ebrahimi B. Pratap U. P. He Y. Altwegg K. A. 2022 SETDB1 interactions with PELP1 contributes to breast cancer endocrine therapy resistance Breast Cancer Res. 24 1 26 10.1186/s13058-022-01520-4 35395812 PMC8991965 Liu X X. Zhang G. Yu T. He J. Liu J. Chai X. 2022 Exosomes deliver lncRNA DARS-AS1 siRNA to inhibit chronic unpredictable mild stress-induced TNBC metastasis Cancer Lett. 543 215781 10.1016/j.canlet.2022.215781 35688263 Liu X. Zhang G. Yu T. Liu J. Chai X. Yin D. 2023 CL4-modified exosomes deliver lncRNA DARS-AS1 siRNA to suppress triple-negative breast cancer progression and attenuate doxorubicin resistance by inhibiting autophagy Int. J. Biol. Macromol. 250 126147 10.1016/j.ijbiomac.2023.126147 37544559 Louie A. D. Huntington K. Carlsen L. Zhou L. El-Deiry W. S. 2021 Integrating molecular biomarker inputs into development and use of clinical cancer therapeutics Front. Pharmacol. 12 747194 10.3389/fphar.2021.747194 34737704 PMC8560682 Luo F. Zhang M. Sun B. Xu C. Yang Y. Zhang Y. 2024 LINC00115 promotes chemoresistant breast cancer stem-like cell stemness and metastasis through SETDB1/PLK3/HIF1α signaling Mol. Cancer 23 1 60 10.1186/s12943-024-01975-3 38520019 PMC10958889 Ma C. He D. Tian P. Wang Y. He Y. Wu Q. 2022 miR-182 targeting reprograms tumor-associated macrophages and limits breast cancer progression Proc. Natl. Acad. Sci. 119 6 e2114006119 10.1073/pnas.2114006119 35105806 PMC8833194 Mahendran G. Shangaradas A. D. Romero-Moreno R. Wickramarachchige Dona N. Sarasija S. H. G. S. Perera S. 2024 Unlocking the epigenetic code: new insights into triple-negative breast cancer Front. Oncol. 14 1499950 10.3389/fonc.2024.1499950 39744000 PMC11688480 Mao Q. Wu P. Li H. Fu X. Gao X. Yang L. 2023 CRISPR/Cas9-mediated EZH2 knockout suppresses the proliferation and migration of triple-negative breast cancer cells Oncol. Lett. 26 2 343 10.3892/ol.2023.13929 37427349 PMC10326815 Martínez-Galán J. 2014 ESR1 gene promoter region methylation in free circulating DNA and its correlation with estrogen receptor protein expression in tumor tissue in breast cancer patients BMC cancer 14 1 8 24495356 10.1186/1471-2407-14-59 PMC3922625 Mastoraki S. Strati A. Tzanikou E. Chimonidou M. Politaki E. Voutsina A. 2018 ESR1 methylation: a liquid biopsy–based epigenetic assay for the follow-up of patients with metastatic breast cancer receiving endocrine treatment Clin. Cancer Res. 24 6 1500 1510 10.1158/1078-0432.CCR-17-1181 29284708 Melo S. A. Sugimoto H. O'Connell J. T. Kato N. Villanueva A. Vidal A. 2014 Cancer exosomes perform cell-independent microRNA biogenesis and promote tumorigenesis Cancer cell 26 5 707 721 10.1016/j.ccell.2014.09.005 25446899 PMC4254633 Merrill N. M. Lachacz E. J. Vandecan N. M. Ulintz P. J. Bao L. Lloyd J. P. 2020 Molecular determinants of drug response in TNBC cell lines Breast cancer Res. Treat. 179 2 337 347 10.1007/s10549-019-05473-9 31655920 PMC7323911 Moitra P. Skrodzki D. Molinaro M. Gunaseelan N. Sar D. Aditya T. 2024 Context-responsive nanoparticle derived from synthetic zwitterionic ionizable phospholipids in targeted CRISPR/Cas9 therapy for basal-like breast cancer ACS nano 18 12 9199 9220 10.1021/acsnano.4c01400 38466962 Mollaei H. Safaralizadeh R. Rostami Z. 2019 MicroRNA replacement therapy in cancer J. Cell. physiology 234 8 12369 12384 10.1002/jcp.28058 30605237 Nandy D. Rajam S. M. Dutta D. 2020 A three layered histone epigenetics in breast cancer metastasis Cell & Biosci. 10 1 52 10.1186/s13578-020-00415-1 32257110 PMC7106732 Nemeth K. Bayraktar R. Ferracin M. Calin G. A. 2024 Non-coding RNAs in disease: from mechanisms to therapeutics Nat. Rev. Genet. 25 3 211 232 10.1038/s41576-023-00662-1 37968332 Nie H. Xie X. Zhang D. Zhou Y. Li B. Li F. 2020 Use of lung-specific exosomes for miRNA-126 delivery in non-small cell lung cancer Nanoscale 12 2 877 887 10.1039/c9nr09011h 31833519 Nounou M. I. ElAmrawy F. Ahmed N. Abdelraouf K. Goda S. Syed-Sha-Qhattal H. 2015 Breast cancer: conventional diagnosis and treatment modalities and recent patents and technologies Breast cancer basic Clin. Res. 9 17 34 10.4137/BCBCR.S29420 26462242 PMC4589089 Nwosu I. O. Piccolo S. R. 2024 A comprehensive meta-analysis of breast cancer gene expression bioRxiv 2024.08. 30.610515 Page M. J. McKenzie J. E. Bossuyt P. M. Boutron I. Hoffmann T. C. Mulrow C. D. 2021 The PRISMA 2020 statement: an updated guideline for reporting systematic reviews BMJ 372 n71 10.1136/bmj.n71 33782057 PMC8005924 Panagopoulou M. Karaglani M. Balgkouranidou I. Biziota E. Koukaki T. Karamitrousis E. 2019 Circulating cell-free DNA in breast cancer: size profiling, levels, and methylation patterns lead to prognostic and predictive classifiers Oncogene 38 18 3387 3401 10.1038/s41388-018-0660-y 30643192 Parrella P. 2018 The value of epigenetic biomarkers in breast cancer Taylor & Francis 937 940 10.2217/bmm-2018-0187 30041537 Pasculli B. Barbano R. Parrella P. 2018 Epigenetics of breast cancer: biology and clinical implication in the era of precision medicine Seminars in cancer biology Elsevier 10.1016/j.semcancer.2018.01.007 29339244 Patra S. Praharaj P. P. Klionsky D. J. Bhutia S. K. 2022 Vorinostat in autophagic cell death: a critical insight into autophagy-mediated,-associated and-dependent cell death for cancer prevention Drug Discov. today 27 1 269 279 10.1016/j.drudis.2021.08.004 34400351 PMC8714665 Peled M. Agassi R. Czeiger D. Ariad S. Riff R. Rosenthal M. 2020 Cell-free DNA concentration in patients with clinical or mammographic suspicion of breast cancer Sci. Rep. 10 1 14601 10.1038/s41598-020-71357-4 32884019 PMC7471679 Penna I. Gigoni A. Costa D. Vella S. Russo D. Poggi A. 2016 The inhibition of 45A ncRNA expression reduces tumor formation, affecting tumor nodules compactness and metastatic potential in neuroblastoma cells Oncotarget 8 5 8189 8205 10.18632/oncotarget.14138 28029658 PMC5352393 Piha-Paul S. A. Hann C. L. French C. A. Cousin S. Braña I. Cassier P. A. 2020 Phase 1 study of molibresib (GSK525762), a bromodomain and extra-terminal domain protein inhibitor, in NUT carcinoma and other solid tumors JNCI Cancer Spectr. 4 2 pkz093 10.1093/jncics/pkz093 32328561 PMC7165800 Prabhu K. S. Sadida H. Q. Kuttikrishnan S. Junejo K. Bhat A. A. Uddin S. 2024 Beyond genetics: exploring the role of epigenetic alterations in breast cancer Pathology - Res. Pract. 254 155174 10.1016/j.prp.2024.155174 38306863 Qin G. Li Y. Xu X. Wang X. Zhang K. Tang Y. 2019 Panobinostat (LBH589) inhibits Wnt/β-catenin signaling pathway via upregulating APCL expression in breast cancer Cell. Signal. 59 62 75 10.1016/j.cellsig.2019.03.014 30880222 Rao X. Qiao Z. Yang Y. Deng Y. Zhang Z. Yu X. 2024 Unveiling epigenetic vulnerabilities in triple-negative breast cancer through 3D organoid drug screening Pharmaceuticals 17 2 225 10.3390/ph17020225 38399440 PMC10892330 Razavi P. Chang M. T. Xu G. Bandlamudi C. Ross D. S. Vasan N. 2018 The genomic landscape of endocrine-resistant advanced breast cancers Cancer cell 34 3 427 438.e6 10.1016/j.ccell.2018.08.008 30205045 PMC6327853 Richart L. Margueron R. 2020 Drugging histone methyltransferases in cancer Curr. Opin. Chem. Biol. 56 51 62 10.1016/j.cbpa.2019.11.009 31981999 Roberti A. Valdes A. F. Torrecillas R. Fraga M. F. Fernandez A. F. 2019 Epigenetics in cancer therapy and nanomedicine Clin. Epigenetics 11 1 81 10.1186/s13148-019-0675-4 31097014 PMC6524244 Robertson J. F. Bondarenko I. M. Trishkina E. Dvorkin M. Panasci L. Manikhas A. 2016 Fulvestrant 500 mg versus anastrozole 1 mg for hormone receptor-positive advanced breast cancer (FALCON): an international, randomised, double-blind, phase 3 trial Lancet 388 10063 2997 3005 10.1016/S0140-6736(16)32389-3 27908454 Rohanizadegan M. 2018 Analysis of circulating tumor DNA in breast cancer as a diagnostic and prognostic biomarker Cancer Genet. 228 159 168 10.1016/j.cancergen.2018.02.002 29572011 PMC6108954 Salas L. A. Lundgren S. N. Browne E. P. Punska E. C. Anderton D. L. Karagas M. R. 2020 Prediagnostic breast milk DNA methylation alterations in women who develop breast cancer Hum. Mol. Genet. 29 4 662 673 10.1093/hmg/ddz301 31943067 PMC7068171 Salta S. P Nunes S. Fontes-Sousa M. Lopes P. Freitas M. Caldas M. 2018 A DNA methylation-based test for breast cancer detection in circulating cell-free DNA J. Clin. Med. 7 11 420 10.3390/jcm7110420 30405052 PMC6262630 Sarvari P. Ramírez-Díaz I. Mahjoubi F. Rubio K. 2022 Advances of epigenetic biomarkers and epigenome editing for early diagnosis in breast cancer Int. J. Mol. Sci. 23 17 9521 10.3390/ijms23179521 36076918 PMC9455804 Shan M. Yin H. Li J. Li X. Wang D. Su Y. 2016 Detection of aberrant methylation of a six-gene panel in serum DNA for diagnosis of breast cancer Oncotarget 7 14 18485 18494 10.18632/oncotarget.7608 26918343 PMC4951303 Sher G. Salman N. A. Khan A. Q. Prabhu K. S. Raza A. Kulinski M. 2022 Epigenetic and breast cancer therapy: promising diagnostic and therapeutic applications Seminars Cancer Biol. 83 152 165 10.1016/j.semcancer.2020.08.009 32858230 Song L. Bretz A. C. Gravemeyer J. Spassova I. Muminova S. Gambichler T. 2021 The HDAC inhibitor domatinostat promotes cell-cycle arrest, induces apoptosis, and increases immunogenicity of merkel cell carcinoma cells J. Investigative Dermatology 141 4 903 912.e4 10.1016/j.jid.2020.08.023 33002502 PMC7987731 Stone A. Zotenko E. Locke W. J. Korbie D. Millar E. K. A. Pidsley R. 2015 DNA methylation of oestrogen-regulated enhancers defines endocrine sensitivity in breast cancer Nat. Commun. 6 1 7758 10.1038/ncomms8758 26169690 PMC4510968 Su Y. Hopfinger N. R. Nguyen T. D. Pogash T. J. Santucci-Pereira J. Russo J. 2018 Epigenetic reprogramming of epithelial mesenchymal transition in triple negative breast cancer cells with DNA methyltransferase and histone deacetylase inhibitors J. Exp. & Clin. Cancer Res. 37 314 318 10.1186/s13046-018-0988-8 30547810 PMC6295063 Sulewska A. Pilz L. Manegold C. Ramlau R. Charkiewicz R. Niklinski J. 2023 A systematic review of progress toward unlocking the power of epigenetics in NSCLC: latest updates and perspectives Cells 12 6 905 10.3390/cells12060905 36980246 PMC10047383 Sun M. Liu X. H. Wang K. M. Nie F. q. Kong R. Yang J. s. 2014 Downregulation of BRAF activated non-coding RNA is associated with poor prognosis for non-small cell lung cancer and promotes metastasis by affecting epithelial-mesenchymal transition Mol. cancer 13 68 12 10.1186/1476-4598-13-68 24655544 PMC3998010 Swellam M. Abdelmaksoud M. D. E. Sayed Mahmoud M. Ramadan A. Abdel-Moneem W. Hefny M. M. 2015 Aberrant methylation of APC and RARβ2 genes in breast cancer patients Iubmb Life 67 1 61 68 10.1002/iub.1346 25684670 Tang Q. Cheng J. Cao X. Surowy H. Burwinkel B. 2016 Blood-based DNA methylation as biomarker for breast cancer: a systematic review Clin. epigenetics 8 115 118 10.1186/s13148-016-0282-6 27895805 PMC5109688 Terranova-Barberio M. Thomas S. Ali N. Pawlowska N. Park J. Krings G. 2017 HDAC inhibition potentiates immunotherapy in triple negative breast cancer Oncotarget 8 69 114156 114172 10.18632/oncotarget.23169 29371976 PMC5768393 Thomas M. L. Marcato P. 2018 Epigenetic modifications as biomarkers of tumor development, therapy response, and recurrence across the cancer care continuum Cancers 10 4 101 10.3390/cancers10040101 29614786 PMC5923356 Tomaselli D. Lucidi A. Rotili D. Mai A. 2020 Epigenetic polypharmacology: a new frontier for epi-drug discovery Med. Res. Rev. 40 1 190 244 10.1002/med.21600 31218726 PMC6917854 Unger‐Saldaña K. Miranda A. Zarco-Espinosa G. Mainero-Ratchelous F. Bargalló-Rocha E. Miguel Lázaro-León J. 2015 Health system delay and its effect on clinical stage of breast cancer: multicenter study Cancer 121 13 2198 2206 10.1002/cncr.29331 25809536 PMC6681165 Vernier M. McGuirk S. Dufour C. R. Wan L. Audet-Walsh E. St-Pierre J. 2020 Inhibition of DNMT1 and ERRα crosstalk suppresses breast cancer via derepression of IRF4 Oncogene 39 41 6406 6420 10.1038/s41388-020-01438-1 32855526 PMC7544553 Vieira A. F. Schmitt F. 2018 An update on breast cancer multigene prognostic tests—emergent clinical biomarkers Front. Med. 5 248 10.3389/fmed.2018.00248 30234119 PMC6131478 Wang L. 2017 Early diagnosis of breast cancer Sensors 17 7 1572 10.3390/s17071572 28678153 PMC5539491 Wang X. Liu Z. Zhang L. Yang Z. Chen X. Luo J. 2018 Targeting deubiquitinase USP28 for cancer therapy Cell death & Dis. 9 2 186 10.1038/s41419-017-0208-z 29415985 PMC5833459 Wang W.-T. Han C. Sun Y. M. Chen T. Q. Chen Y. Q. 2019 Noncoding RNAs in cancer therapy resistance and targeted drug development J. Hematol. & Oncol. 12 1 55 10.1186/s13045-019-0748-z 31174564 PMC6556047 Wang X. Chen S. Shen T. Lu H. Xiao D. Zhao M. 2020 Trichostatin A reverses epithelial-mesenchymal transition and attenuates invasion and migration in MCF-7 breast cancer cells Exp. Ther. Med. 19 3 1687 1694 10.3892/etm.2020.8422 32104221 PMC7027139 Wang Y. Pan X. Li Y. Wang R. Yang Y. Jiang B. 2021 CUL4B renders breast cancer cells tamoxifen‐resistant via miR‐32‐5p/ER‐α36 axis J. Pathology 254 2 185 198 10.1002/path.5657 33638154 Wawruszak A. Halasa M. Okon E. Kukula-Koch W. Stepulak A. 2021 Valproic acid and breast cancer: state of the art in 2021 Cancers (Basel) 13 14 3409 10.3390/cancers13143409 34298623 PMC8306563 Webster R. Castellano J. M. Onuma O. K. 2017 Putting polypills into practice: challenges and lessons learned Lancet 389 10073 1066 1074 10.1016/S0140-6736(17)30558-5 28290996 Winkle M. El-Daly S. M. Fabbri M. Calin G. A. 2021 Noncoding RNA therapeutics—challenges and potential solutions Nat. Rev. Drug Discov. 20 8 629 651 10.1038/s41573-021-00219-z 34145432 PMC8212082 Wong K. K. 2021 DNMT1: a key drug target in triple-negative breast cancer Seminars in cancer biology Elsevier 10.1016/j.semcancer.2020.05.010 32461152 Wortzel I. Dror S. Kenific C. M. Lyden D. 2019 Exosome-mediated metastasis: communication from a distance Dev. cell 49 3 347 360 10.1016/j.devcel.2019.04.011 31063754 Wu Y. Gu W. Li J. Chen C. Xu Z. P. 2019 Silencing PD-1 and PD-L1 with nanoparticle-delivered small interfering RNA increases cytotoxicity of tumor-infiltrating lymphocytes Nanomedicine 14 8 955 967 10.2217/nnm-2018-0237 30901292 Wu Y. S. Lee Z. Y. Chuah L. H. Mai C. W. Ngai S. C. 2019 Epigenetics in metastatic breast cancer: its regulation and implications in diagnosis, prognosis and therapeutics Curr. Cancer Drug Targets 19 2 82 100 10.2174/1568009618666180430130248 29714144 Wu C.-H. Tsai Y. C. Tsai T. H. Kuo K. L. Su Y. F. Chang C. H. 2021 Valproic acid reduces vasospasm through modulation of Akt phosphorylation and attenuates neuronal apoptosis in subarachnoid hemorrhage rats Int. J. Mol. Sci. 22 11 5975 10.3390/ijms22115975 34205883 PMC8198375 Xia W. Chen W. Ni C. Meng X. Wu J. Yang Q. 2023 Chemotherapy-induced exosomal circBACH1 promotes breast cancer resistance and stemness via miR-217/G3BP2 signaling pathway Breast Cancer Res. 25 1 85 10.1186/s13058-023-01672-x 37461019 PMC10351125 Xiong Q. Zhang Y. 2023 Small RNA modifications: regulatory molecules and potential applications J. Hematol. & Oncol. 16 1 64 10.1186/s13045-023-01466-w 37349851 PMC10286502 Xu Z. Sandler D. P. Taylor J. A. 2020 Blood DNA methylation and breast cancer: a prospective case-cohort analysis in the sister study JNCI J. Natl. Cancer Inst. 112 1 87 94 10.1093/jnci/djz065 30989176 PMC7489106 Xu Y. Li P. Liu Y. Xin D. Lei W. Liang A. 2022 Epi-immunotherapy for cancers: rationales of epi-drugs in combination with immunotherapy and advances in clinical trials Cancer Commun. (Lond) 42 6 493 516 10.1002/cac2.12313 35642676 PMC9198339 Yamashita R. Sato M. Kakumu T. Hase T. Yogo N. Maruyama E. 2015 Growth inhibitory effects of miR‐221 and miR‐222 in non‐small cell lung cancer cells Cancer Med. 4 4 551 564 10.1002/cam4.412 25641933 PMC4402070 Yang R. Pfütze K. Zucknick M. Sutter C. Wappenschmidt B. Marme F. 2015 DNA methylation array analyses identified breast cancer‐associated HYAL2 methylation in peripheral blood Int. J. cancer 136 8 1845 1855 10.1002/ijc.29205 25213452 Yang Q. Zhao S. Shi Z. Cao L. Liu J. Pan T. 2021 Chemotherapy-elicited exosomal miR-378a-3p and miR-378d promote breast cancer stemness and chemoresistance via the activation of EZH2/STAT3 signaling J. Exp. & Clin. Cancer Res. 40 1 120 10.1186/s13046-021-01901-1 33823894 PMC8022546 Yang L. Wang M. Wang Y. Zhu Y. Wang J. Wu M. 2024 LINC00460-FUS-MYC feedback loop drives breast cancer metastasis and doxorubicin resistance Oncogene 43 17 1249 1262 10.1038/s41388-024-02972-y 38418543 Yardim-Akaydin S. Karahalil B. Baytas S. N. 2022 New therapy strategies in the management of breast cancer Drug Discov. Today 27 6 1755 1762 10.1016/j.drudis.2022.03.014 35337961 Yellapu N. K. Ly T. Sardiu M. E. Pei D. Welch D. R. Thompson J. A. 2022 Synergistic anti-proliferative activity of JQ1 and GSK2801 in triple-negative breast cancer BMC Cancer 22 1 627 10.1186/s12885-022-09690-2 35672711 PMC9173973 Yi J. Wang L. Hu G. S. Zhang Y. Y. Du J. Ding J. C. 2023 CircPVT1 promotes ER‐positive breast tumorigenesis and drug resistance by targeting ESR1 and MAVS EMBO J. 42 10 e112408 10.15252/embj.2022112408 37009655 PMC10183818 Yu J. Qin B. Moyer A. M. Nowsheen S. Liu T. Qin S. 2018 DNA methyltransferase expression in triple-negative breast cancer predicts sensitivity to decitabine J. Clin. investigation 128 6 2376 2388 10.1172/JCI97924 29708513 PMC5983332 Zhang G. Smith S. G. Zhou M.-M. 2015 Discovery of chemical inhibitors of human bromodomains Chem. Rev. 115 21 11625 11668 10.1021/acs.chemrev.5b00205 26492937 Zhang J. Li S. Li L. Li M. Guo C. Yao J. 2015 Exosome and exosomal microRNA: trafficking, sorting, and function Genomics, proteomics & Bioinforma. 13 1 17 24 10.1016/j.gpb.2015.02.001 25724326 PMC4411500 Zhang J. Huang L. Hu K. 2023 Emerging epigenetic-based nanotechnology for cancer therapy: modulating the tumor microenvironment Adv. Sci. (Weinh) 10 7 e2206169 10.1002/advs.202206169 36599655 PMC9982594 Zhou X. Liu Z. Wang H. Liu X. Zhou Z. Tang J. 2019 SAHA (vorinostat) facilitates functional polymer-based gene transfection via upregulation of ROS and synergizes with TRAIL gene delivery for cancer therapy J. drug Target. 27 3 306 314 10.1080/1061186X.2018.1519028 30188217 Zubor P. Kubatka P. Kajo K. Dankova Z. Polacek H. Bielik T. 2019 Why the gold standard approach by mammography demands extension by multiomics? Application of liquid biopsy miRNA profiles to breast cancer disease management Int. J. Mol. Sci. 20 12 2878 10.3390/ijms20122878 31200461 PMC6627787 Zucchetti B. Shimada A. K. Katz A. Curigliano G. 2019 The role of histone deacetylase inhibitors in metastatic breast cancer Breast 43 130 134 10.1016/j.breast.2018.12.001 30553187 ",
  "metadata": {
    "Title of this paper": "The role of histone deacetylase inhibitors in metastatic breast cancer",
    "Journal it was published in:": "Frontiers in Pharmacology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481900/"
  }
}