{
  "title": "Paper_543",
  "abstract": "pmc Comput Struct Biotechnol J Comput Struct Biotechnol J 2373 csbj Computational and Structural Biotechnology Journal 2001-0370 Research Network of Computational and Structural Biotechnology PMC12481025 PMC12481025.1 12481025 12481025 41035502 10.1016/j.csbj.2025.09.026 S2001-0370(25)00386-1 1 Research Article A miRNA signature linked to high lipoprotein (a) and coronary calcification in familial hypercholesterolaemia Escate Rafael a b Muñoz-Torrero Juan F Sánchez c Mauri Marta d Mata Pedro e Badimon Lina a b f 1 Padro Teresa tpadro@santpau.cat a b ⁎ 1 a b c d e f ⁎ tpadro@santpau.cat 1 These authors contributed equally to the direction of this work 2025 17 9 2025 27 478314 4096 4105 29 5 2025 16 9 2025 16 9 2025 17 09 2025 01 10 2025 02 10 2025 © 2025 The Authors. Published by Elsevier B.V. on behalf of Research Network of Computational and Structural Biotechnology. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Background High lipoprotein(a) [Lp(a)] levels are associated with increased coronary artery calcification (CAC) in familial hypercholesterolaemia (FH) patients. However, mechanisms linking high Lp(a) with CAC remain poorly understood. In this study, we have performed a bioinformatics and system biology analysis to identify miRNAs and their target genes involved in Lp(a)-associated atherosclerotic lesion and coronary calcification in FH patients. Methods Patients with a genetic diagnosis of FH ( n In silico Results Forty-two miRNAs had > 1.5-fold difference in their detection levels when grouped by Lp(a) [FH-Lp(a)> 50 ( n vs n In silico Conclusion Our results identify a miRNA signature that regulates atherosclerotic processes associated with high Lp(a) levels and CAC in asymptomatic FH patients. These findings offer new insights into the underlying mechanisms and highlight potential therapeutic targets. Graphical Abstract Highlights • A 9-miRNA signature is expressed in FH patients with Lp(a) > 50 mg/dL and CCS(+). • The signature is associated with immune regulation and apoptosis-related pathways. • The 9-miRNA target genes are implicated in the development of atherosclerosis. • The target genes appear to contribute to high Lp(a) and CCS(+) in FH patients. Keywords Atherosclerosis Coronary calcium Lipoprotein (a) in silico Plasma miRNAs pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction High levels of lipoprotein (a) [Lp(a)] and low-density lipoprotein cholesterol (LDL-C), as seen in familial hypercholesterolaemia (FH), are genetically determined and strongly associated with atherosclerotic cardiovascular disease (ASCVD). Notably, elevated Lp(a) levels are more commonly observed in FH patients compared to non-FH individuals [1] [2] [3] [4] [5] Lp(a) is a low-density lipoprotein (LDL)-like particle with an additional protein, apolipoprotein(a), covalently bound to apolipoprotein B-100. Lp(a) levels above 50 mg/dL are linked to an increased risk of cardiovascular disease (CVD) [6] [3] [7] [8] [9] Atherosclerosis is a chronic inflammatory disease, induced by elevated lipids and the continuous interaction between molecular and cellular components of the blood and the arterial vessel wall [10] [6] [11] MicroRNAs (miRNAs) are small non-coding RNAs involved in post-transcriptional regulation [12] [13] [14] [15] [16] Circulating plasma miRNAs have been proposed as potential diagnostic and prognostic biomarkers of CVD [17] [18] [13] In this study, we conducted a bioinformatics and system biology analysis to identify the miRNA signature associated with atherogenic Lp(a) levels in FH patients with subclinical atherosclerosis, differentiating those with and without coronary calcification. 2 Material and methods 2.1 Clinical population The study included 24 patients (12 men and 12 women) with genetic diagnosis of heterozygous familial hypercholesterolaemia (FH) from the SAFEHEART cohort [18] [19] n n Supplementary Table S1 vs p vs [22] [23] [24] [25] [26] [27] [28] 2 p p [20] p p Excluded criteria were pregnancy, sepsis, inflammatory disorders, a history of cancer or clinical cardiovascular events. The study was approved by the local ethics committee of the Investigación Clínical Fundación Jiménez Díaz (protocol number: 01/09) and conducted in accordance with the Declaration of Helsinki. Informed consent was obtained from all participants. 2.2 In silico study design 2.2.1 miRNA profiling analysis In a first stage, the study design ( Fig. S1 GSE178126 [18] GSE178126 vs A new analysis ( GSE265997 GSE178126 n vs n 2.2.2 Target gene prediction Differentially detected miRNAs were identified and their annotations validated in miRBase v22.1 ( https://www.mirbase.org/ Potential target genes with a high predicted probability of being regulated by the selected miRNAs were obtained using the miRWalk search algorithm ( http://mirwalk.umm.uni-heidelberg.de/ In addition, the miRWalk was also used to assess the robustness of the miRNA-target gene interactions by calculating the minimum free energy (MFE), expressed as a negative real value in kcal/mol; lower (more negative) MFE values indicate stronger miRNA-target gene binding [13] 2.2.3 Integrated analysis of gene and miRNA functions Genes associated with lipid metabolism and atherosclerosis were obtained from the KEGG database ( https://www.genome.jp/pathway/hsa05417 Tissue-specific expression patterns of the selected miRNAs and their target genes were obtained from publicly available resources: the miRNA Tissue Atlas ( https://ccb-compute2.cs.uni-saarland.de/mirnatissueatlas_2025 https://www.gtexportal.org/home/ Enrichment analysis of target genes were performed using ShinyGO v0.82 ( http://bioinformatics.sdstate.edu/go/ 2.2.4 Interaction network of miRNAs and target genes Genes associated with atherosclerosis and their molecular affinities by protein-protein interaction were analysed using STRING Protein query and MCODE, both integrated into the Cytoscape v3.10.3 platform ( https://cytoscape.org/ 2.3 Statistical analysis Initial descriptive analysis was provided using number of cases ( n t p 3 Results 3.1 miRNA profiling in FH patients with high Lp(a) levels In a previous study, we identified 4603 miRNAs (pre-mature and mature forms) in the plasma of FH patients ( n [18] GSE265997 n n Of the 4603 circulating miRNAs, 285 showed significantly different detection levels in plasma ( p ( Fig. 1 Table S2 ) Fig. 1 Affymetrix microarray analysis. Circulating plasma miRNAs analysed by microarray in FH patients [ GSE265997 n vs n (A) p p p (B) GSE265997 GSE178126 vs vs Fig. 1 Genomic distribution analysis of the 42 differential miRNAs revealed that six miRNAs (miR-6805–5p, miR-3940–5p, miR-4530, miR-6789–5p, miR-150–5p and miR-1227–5p) were located on chromosome 19, while none were mapped to chromosomes 1, 4, 5, 8, 12, 18, or sex chromosomes X and Y. These findings suggest a genomic pattern of epigenetic regulation by miRNAs in FH patients with high Lp(a) ( Table S2 ) Comparison of the 42 differential miRNAs associated with high plasma Lp(a) with those of the differential miRNA signature previously reported by our group for coronary calcium status [CCS(+) vs GSE178126 [18] ( Fig. 1 Table S2 ) in silico 3.2 Target genes for the 9-miRNA signature associated with high-Lp(a) / CCS(+) in FH patients In silico ( Fig. 1 ) Further analysis using STRING (species: Homo sapiens ( Fig. S2 ). ( Table S3 ). To refine the analysis, Minimum Free Energy (MFE) was used as a predictor of miRNA-mRNA interaction stability. Among the 68 targets initially identified, we selected those with the greatest thermodynamic stability (lowest MFE values) for each miRNA (top 10), and that also presented multiple binding sites (MBS ≥2 miRNAs) for the 9-miRNA signature. This approach identified 39 different target genes with MFE values < -23.5 Kcal/mol, 28 of which had MBS ≥ 3 miRNAs ( Table S3 ). Fig. 2 Fig. 2 The 9 miRNA target genes within lipid and atherosclerosis pathway. Fig. 2 3.3 Features of functions for the 9-miRNA target genes We investigated the tissue expression patterns of the 9 miRNAs and their 39 selected target genes. For miRNAs, we used the ncRNA pattern tool from the miRNA Tissue Atlas database, while for target gene expression, we utilized the GTEx portal. As shown in Fig. 3 , Fig. 3 Features of functions of 9-miRNA target genes. (A) (B) Fig. 3 The 39 target genes were analysed using the ShinyGO database to classify them according to Reactome canonical pathways and Gene Ontology (GO) terms for biological processes (BP) and molecular functions (MF) ( Table S4 Fig. 3 ) 3.4 Molecular interactions of the 9-miRNA target genes Network analysis using STRING and MCODE (Cytoscape bioinformatics tools) revealed that 67 % of the 39 target genes were interconnected through protein-protein interactions, forming three clusters. Cluster 1 included 15 genes (score 8.3), Cluster 2 included 8 genes (score 6.3) and Cluster 3 included 3 genes (score 3.0), with MAPK14, APAF1 and ATF6 serving as the respective seed molecules for Cluster 1, Cluster 2 and Cluster 3 ( Fig. 4 ). Fig. 4 Molecular network analysis of 9-miRNA target genes. Molecular interactions and clustering algorithm for the target genes obtained by STRING Protein query and MCODE, both bioinformatics tools of Cytoscape platform. Seed clusters are indicated with a star symbol. Network connections are defined by protein-protein interaction and clusters by scoring. Reactome pathways for Cluster 1 and Cluster 2 are sorted by number of target genes and related to FDR values and Fold enrichment. Fig. 4 Further in silico ( Fig. 4 ) in silico 3.5 Target genes of the 9-miRNA signature related to Lp(a) regulation and calcification To elucidate potential interactions between our 9-miRNA signature targets and established genes in Lp(a)-related and vascular calcification pathways, we performed an additional in silico Using STRING, with a confidence cut-off of 0.7, we identified 81 apo(a)-related genes and an additional 81 genes directly associated with a group of 12 calcification-related genes that we had previously reported [18] Fig. S3 First-neighbour analysis revealed interactions among the 23 target genes with 29 genes related to Lp(a) and 45 genes of pro-calcification ( Fig. S3 Fig. 5 ) ( Table S3 Fig. 5 ) Fig. 5 Relationship of 9-miRNA target genes and genes related to Lp(a) and calcification . Fig. 5 4 Discussion Lp(a) contributes significantly to ASCVD through its high content of oxidized phospholipids, which exert pro-inflammatory effects [21] [11] [22] [3] [8] [9] [23] [24] in silico Plasma miRNAs, which are known to modulate lipoprotein metabolism and atherosclerosis [13] [25] [26] Our in silico [18] [27] [28] [29] [30] in silico The 9-miRNA signature identified in this study includes components that have been linked to key biological processes associated with atherosclerosis. These include inflammatory regulation (miR-6786–5p) [31] [32] [33] [34] [35] [36] [37] [38] In silico Our analysis of miRNA-target genes, focusing on those with the lowest MFE values identified genes associated with Lp(a) metabolism and pro-calcification processes. These include AKT3, APAF1, BCL2L1, TRAF6, MYD88, STAT3 and CASP9. These genes, regulated by the 9-miRNA signature associated with Lp(a) > 50 mg/dL and calcified plaques in FH, are involved in critical cellular processes, including cellular response (AKT3), apoptosis (APAF1, BCL2L1 and CASP9), inflammatory processes via the TRAF protein family (TRAF6), IL-1 and TLR signalling via the adapter protein (MYD88), and the STAT family in response to cytokines (STAT3). Atherosclerotic plaque formation and inflammation have been related to myeloid differentiation factor 88 (MYD88) gene, which lays a key role in Toll-like receptor (TLRs) signalling [39] [40] Studies in atherosclerosis-prone mice have shown that genetic deficiency of MYD88 or lack of TLR4 significantly reduces the area of aortic plaque [39] [41] [42] The miRNA signature associated with Lp(a) targets several caspase genes (CASP6, CASP8 and CASP9), which are involved in apoptotic pathways [43] [44] [45] Previous studies in murine models have demonstrated the important role of AKT3 in atherosclerosis progression [46] [47] [46] [47] [48] Lipid-lowering therapies such as statins and PCSK9 inhibitors are known to modulate microRNA expression, thereby influencing pathways involved in cholesterol metabolism and atherosclerosis [49] [50] [51] [52] [51] [53] [54] [52] [55] Taken together, these considerations highlight both the novelty and the exploratory nature of our findings. However, this bioinformatics and system biology study, designed to be hypothesis-generating, had certain limitations, primarily due to its sample size. Nevertheless, our findings provide a rationale for further studies in a larger FH population, encompassing patients with diverse Lp(a) levels and varying degrees of atherosclerotic plaque severity. In summary, consistent with previous research identifying distinct miRNA signatures associated with familial hypercholesterolemia and cardiovascular risk, we identified a nine-plasma miRNA signature in asymptomatic FH patients with elevated Lp(a) levels (>50 mg/dL) and evidence of coronary calcification. This represents a novel epigenetic axis linked to atherogenesis in this high-risk population. Prior studies using LDL/Lp(a) apheresis and pharmacologic lipid lowering therapies have shown modulation of miRNAs involved in cholesterol homeostasis, inflammation, and endothelial dysfunction, including miR-92a, miR-21, miR-126, miR-185, and miR-33b [56] CRediT authorship contribution statement Teresa Padro: Lina Badimon: Pedro Mata: Marta Mauri: Juan F Sánchez Muñoz-Torrero: Rafael Escate: Funding This study is funded by the Institute of Health Carlos III PMP22/00108 Spanish Ministry of Economy and Competitiveness of Science PID2019–107160RB-I00 FEDER Fundación Occidente PMP22/00108 Declaration of Competing Interest L.B. declares to have acted as SAB member of Sanofi, Ionnis and NovoNordisk; to have received speaker fees from Sanofi and NovoNordisk and to have founded the Spin-off Ivastatin Therapeutics S (all unrelated to this work). T.P. declares to be co-founder of the Spin-offs Ivastatin Therapeutics S (unrelated to this work). The remaining authors have nothing to disclose. References 1 Hamasakia M. Kotania K. Lipoprotein(a) and familial hypercholesterolemia: a short review including the laboratory viewpoint Cardiol Res 11 2020 356 359 10.14740/cr1145 33224379 PMC7666595 2 Trinder M. DeCastro M.L. Azizi H. Cermakova L. Jackson L.M. Frohlich J. Ascertainment bias in the association between elevated Lipoprotein(a) and familial hypercholesterolemia J Am Coll Cardiol 75 2020 2682 2693 10.1016/j.jacc.2020.03.065 32466883 3 Alonso R. Andres E. Mata N. Fuentes-Jiménez F. Badimón L. López-Miranda J. Lipoprotein(a) levels in familial hypercholesterolemia: an important predictor of cardiovascular disease independent of the type of LDL receptor mutation J Am Coll Cardiol 63 2014 1982 1989 10.1016/j.jacc.2014.01.063 24632281 4 Alonso R. Argüeso R. Álvarez-Baños P. Muñiz-Grijalvo O. Diaz-Diaz J.L. Mata P. Familial hypercholesterolemia and Lipoprotein(a): two partners in crime? Curr Atheroscler Rep 24 2022 427 434 10.1007/s11883-022-01019-5 35386090 5 Ellis K.L. Pérez de Isla L. Alonso R. Fuentes F. Watts G.F. Mata P. Value of measuring Lipoprotein(a) during cascade testing for familial hypercholesterolemia J Am Coll Cardiol 73 2019 1029 1039 10.1016/j.jacc.2018.12.037 30846097 6 Nordestgaard B.G. Chapman M.J. Ray K. Borén J. Andreotti F. Watts G.F. Lipoprotein(a) as a cardiovascular risk factor: current status Eur Heart J 31 2010 2844 2853 10.1093/eurheartj/ehq386 20965889 PMC3295201 7 Loh W.J. Chan D.C. Mata P. Watts G.F. Familial hypercholesterolemia and elevated Lipoprotein(a): cascade testing and other implications for contextual models of care Front Genet 13 2022 10.3389/fgene.2022.905941 PMC9091303 35571022 8 Catapano A.L. Graham I. 2016 ESC/EAS guidelines for the management of dyslipidaemias Eur Heart J 37 2016 2999 3058 10.1093/eurheartj/ehw272 27567407 9 Alonso R. Mata P. Muñiz O. Fuentes-Jimenez F. Díaz J.L. Zambón D. PCSK9 and lipoprotein (a) levels are two predictors of coronary artery calcification in asymptomatic patients with familial hypercholesterolemia Atherosclerosis 254 2016 249 253 10.1016/j.atherosclerosis.2016.08.038 27594539 10 Hansson G.K. Inflammation, atherosclerosis, and coronary artery disease N Engl J Med 352 2005 1685 1695 10.1056/NEJMra043430 15843671 11 Rehberger Likozar A. Zavrtanik M. Šebeštjen M. Lipoprotein(a) in atherosclerosis: from pathophysiology to clinical relevance and treatment options Ann Med 52 2020 162 177 10.1080/07853890.2020.1775287 32453609 PMC7877976 12 Bartel D.P. Abbott A.L. Alvarez-Saavedra E. Miska E.A. Lau N.C. Bartel D.P. MicroRNAs: target recognition and regulatory functions Cell 136 2009 215 233 10.1016/j.cell.2009.01.002 19167326 PMC3794896 13 Escate R. Padró T. Suades R. Camino S. Muñiz O. Diaz-Diaz J.L. High miR-133a levels in the circulation anticipates presentation of clinical events in familial hypercholesterolaemia patients Cardiovasc Res 117 2021 109 122 10.1093/cvr/cvaa039 32061123 14 Desgagné V. Bouchard L. Guérin R. MicroRNAs in lipoprotein and lipid metabolism: from biological function to clinical application Clin Chem Lab Med 55 2017 667 686 10.1515/cclm-2016-0575 27987357 15 Goettsch C. Hutcheson J.D. Aikawa E. MicroRNA in cardiovascular calcification: focus on targets and extracellular vesicle delivery mechanisms Circ Res 112 2013 1073 1084 10.1161/CIRCRESAHA.113.300937 23538277 PMC3668680 16 Lu Y. Thavarajah T. Gu W. Cai J. Xu Q. Impact of miRNA in atherosclerosis Arterioscler Thromb Vasc Biol 38 2018 E159 E170 10.1161/ATVBAHA.118.310227 30354259 PMC6795547 17 Min P.K. Chan S.Y. The biology of circulating microRNAs in cardiovascular disease Eur J Clin Invest 45 2015 860 874 10.1111/eci.12475 26046787 PMC4514545 18 Escate R. Padró T. Pérez de Isla L. Fuentes F. Alonso R. Mata P. Circulating miR-6821-5p levels and coronary calcification in asymptomatic familial hypercholesterolemia patients Atherosclerosis 392 2024 117502 10.1016/j.atherosclerosis.2024.117502 38513437 19 Perez De Isla L. Alonso R. Watts G.F. Mata N. Saltijeral Cerezo A. Muñiz O. Attainment of LDL-cholesterol treatment goals in patients with familial hypercholesterolemia: 5-year SAFEHEART registry follow-up J Am Coll Cardiol 67 2016 1278 1285 10.1016/j.jacc.2016.01.008 26988947 20 Wierzbicki A.S. Humphries S.E. Minhas R. Familial hypercholesterolaemia: summary of NICE guidance BMJ 337 2008 a1095 10.1136/bmj.a1095 18753174 21 Duarte Lau F. Giugliano R.P. Lipoprotein(a) and its significance in cardiovascular disease: a review JAMA Cardiol 7 2022 760 769 10.1001/jamacardio.2022.0987 35583875 22 Tsimikas S. Karwatowska-Prokopczuk E. Gouni-Berthold I. Tardif J.-C. Baum S.J. Steinhagen-Thiessen E. Lipoprotein(a) reduction in persons with cardiovascular disease N Engl J Med 382 2020 244 255 10.1056/nejmoa1905239 31893580 23 Pérez De Isla L. Alonso R. Mata N. Fernández-Pérez C. Muñiz O. Díaz-Díaz J.L. Predicting cardiovascular events in familial hypercholesterolemia: the SAFEHEART registry (Spanish Familial Hypercholesterolemia Cohort Study) Circulation 135 2017 2133 2144 10.1161/CIRCULATIONAHA.116.024541 28275165 24 Gallo A. Charrières S. Vimont A. Chapman M.J. Angoulvant D. Boccara F. SAFEHEART risk-equation and cholesterol-year-score are powerful predictors of cardiovascular events in French patients with familial hypercholesterolemia Atherosclerosis 306 2020 41 49 10.1016/j.atherosclerosis.2020.06.011 32688103 25 Ruiz-Roso M.B. Gil-Zamorano J. López de las Hazas M.C. Tomé-Carneiro J. Crespo M.C. Latasa M.J. Intestinal lipid metabolism genes regulated by miRNAs Front Genet 11 2020 707 10.3389/fgene.2020.00707 32742270 PMC7366872 26 Knoka E. Trusinskis K. Mazule M. Briede I. Crawford W. Jegere S. Circulating plasma microRNA-126, -145 and -155 and their association with atherosclerotic plaque characteristics J Clin Transl Res 5 2019 60 67 10.18053/jctres.05.201902.002 PMC7197049 32377580 27 Longstreth J.H. Wang K. The role of fibronectin in mediating cell migration Am J Physiol Cell Physiol 326 2024 C1212 C1225 10.1152/ajpcell.00633.2023 38372136 28 Moore K.J. Fisher E.A. The double-edged sword of fibronectin in atherosclerosis EMBO Mol Med 4 2012 561 563 10.1002/emmm.201200238 22649036 PMC3407944 29 Chen C. Wu Y. Lu H.L. Liu K. Qin X. Identification of potential biomarkers of vascular calcification using bioinformatics analysis and validation in vivo PeerJ 10 2022 e13138 10.7717/peerj.13138 PMC8934046 35313524 30 Ehnholm C. Jauhiainen M. Metso J. Interaction of lipoprotein(a) with fibronectin and its potential role in atherogenesis Eur Heart J 11 1990 190 195 10.1093/eurheartj/11.suppl_e.190 2146125 31 Xu X. Bu B. Tian H. Wu R. Yang J. MicroRNAs combined with the TLR4/TDAG8 mRNAs and proinflammatory cytokines are biomarkers for the rapid diagnosis of sepsis Mol Med Rep 26 2022 334 10.3892/mmr.2022.12850 36102304 PMC9494599 32 Hu W.J. Wei H. Cai L.L. Xu Y.H. Du R. Zhou Q. Magnetic targeting enhances the neuroprotective function of human mesenchymal stem cell-derived iron oxide exosomes by delivering miR-1228-5p J Nanobiotechnol 22 2024 665 10.1186/s12951-024-02941-3 PMC11514807 39468528 33 Funatsuki T. Ogata H. Tahara H. Shimamoto A. Takekita Y. Koshikawa Y. Changes in multiple microRNA levels with antidepressant treatment are associated with remission and interact with key pathways: a comprehensive microRNA analysis Int J Mol Sci 24 2023 12199 10.3390/ijms241512199 37569574 PMC10418406 34 Gabler J. Basílio J. Steinbrecher O. Kollars M. Kyrle P.A. Eichinger S. MicroRNA signatures in plasma of patients with venous thrombosis: a preliminary report Am J Med Sci 361 2021 509 516 10.1016/j.amjms.2020.12.002 33781391 35 Ji Z.C. Han S.H. Xing Y.F. Overexpression of miR-3196 suppresses cell proliferation and induces cell apoptosis through targeting ERBB3 in breast cancer Eur Rev Med Pharm Sci 22 2018 8383 8390 10.26355/eurrev_201812_16536 30556879 36 Zhou C. Chen L. Chen R. Xu F. Huang Z. Huang R. miR-4486 enhances cisplatin sensitivity of gastric cancer cells by restraining the JAK3/STAT3 signalling pathway J Chemother 34 2022 35 44 10.1080/1120009X.2021.1936957 34167436 37 Lin Z. Huang W. Xie Z. Yi Y. Li Z. Expression, clinical significance, immune infiltration, and regulation network of miR-3940-5p in lung adenocarcinoma based on bioinformatic analysis and experimental validation Int J Gen Med 15 2022 6451 6464 10.2147/IJGM.S375761 35966511 PMC9365057 38 Nikpay M. Beehler K. Valsesia A. Hager J. Harper M.E. Dent R. Genome-wide identification of circulating-miRNA expression quantitative trait loci reveals the role of several miRNAs in the regulation of cardiometabolic phenotypes Cardiovasc Res 115 2019 1629 1645 10.1093/cvr/cvz030 30715214 39 Michelsen K.S. Wong M.H. Shah P.K. Zhang W. Yano J. Doherty T.M. Lack of Toll-like receptor 4 or myeloid differentiation factor 88 reduces atherosclerosis and alters plaque phenotype in mice deficient in apolipoprotein e Proc Natl Acad Sci USA 101 2004 10679 10684 10.1073/pnas.0403249101 15249654 PMC489994 40 Kong P. Cui Z.Y. Huang X.F. Zhang D.D. Guo R.J. Han M. Inflammation and atherosclerosis: signaling pathways and therapeutic intervention Signal Transduct Target Ther 7 2022 131 10.1038/s41392-022-00955-7 35459215 PMC9033871 41 Zheng D. Zang Y. Xu H. Wang Y. Cao X. Wang T. MicroRNA-214 promotes the calcification of human aortic valve interstitial cells through the acceleration of inflammatory reactions with activated MyD88/NF-κB signaling Clin Res Cardiol 108 2019 691 702 10.1007/s00392-018-1398-9 30519780 42 Balic J.J. Albargy H. Luu K. Kirby F.J. Jayasekara W.S.N. Mansell F. STAT3 serine phosphorylation is required for TLR4 metabolic reprogramming and IL-1β expression Nat Commun 11 2020 3816 10.1038/s41467-020-17669-5 32732870 PMC7393113 43 Cavalcante G.C. Schaan A.P. Cabral G.F. Santana-Da-Silva M.N. Pinto P. Vidal A.F. A cell’s fate: an overview of the molecular biology and genetics of apoptosis Int J Mol Sci 20 2019 10.3390/ijms20174133 PMC6747454 31450613 44 Riedl S.J. Salvesen G.S. The apoptosome: signalling platform of cell death Nat Rev Mol Cell Biol 8 2007 405 413 10.1038/nrm2153 17377525 45 Sobenin I.A. Bobryshev Y.V. Korobov G.A. Borodachev E.N. Postnov A.Y. Orekhov A.N. Quantitative analysis of the expression of caspase 3 and caspase 9 in different types of atherosclerotic lesions in the human aorta Exp Mol Pathol 99 2015 1 6 10.1016/j.yexmp.2015.05.004 25962658 46 Ding L. Biswas S. Morton R.E. Smith J.D. Hay N. Byzova T.V. Akt3 deficiency in macrophages promotes foam cell formation and atherosclerosis in mice Cell Metab 15 2012 861 872 10.1016/j.cmet.2012.04.020 22632897 PMC3372639 47 Ding L. Zhang L. Kim M. Byzova T. Podrez E. Akt3 kinase suppresses pinocytosis of low-density lipoprotein by macrophages via a novel WNK/SGK1/Cdc42 protein pathway J Biol Chem 292 2017 9283 9293 10.1074/jbc.M116.773739 28389565 PMC5454109 48 Fukai A. Kawamura N. Saito T. Oshima Y. Ikeda T. Kugimiya F. Akt1 in murine chondrocytes controls cartilage calcification during endochondral ossification under physiologic and pathologic conditions Arthritis Rheum 62 2010 826 836 10.1002/art.27296 20187155 49 Citrin K.M. Fernández-Hernando C. Suárez Y. MicroRNA regulation of cholesterol metabolism Ann N Y Acad Sci 1495 2021 55 77 10.1111/nyas.14566 33521946 PMC8938903 50 Lu Y. Thavarajah T. Gu W. Cai J. Xu Q. Impact of miRNA in atherosclerosis Arterioscler Thromb Vasc Biol 38 2018 E159 E170 10.1161/ATVBAHA.118.310227 30354259 PMC6795547 51 Vartak T. Giardini E. Kelly D. Moran B. Kennedy C. Barry M. Induction of let-7d-5p miRNA modulates aortic smooth muscle inflammatory signaling and phenotypic switching Atherosclerosis 395 2024 117573 10.1016/j.atherosclerosis.2024.117573 38796407 52 Rehberger Likozar A. Levstek T. Karun T. Trebušak Podkrajšek K. Zupan J. Šebeštjen M. Treatment with PCSK9 inhibitors influences microRNAs expression and changes of arterial wall properties: a randomized controlled trial Eur J Med Res 30 2025 138 10.1186/s40001-025-02398-6 40001082 PMC11863757 53 Wang H. Lu H.M. Yang W.H. Luo C. Lu S.H. Zhou Y. The influence of statin therapy on circulating microRNA-92a expression in patients with coronary heart disease Chin Crit Care Med 24 2012 215 218 10.3760/cma.j.issn.1003-0603.2012.04.007 22464573 54 Dagli-Hernandez C. Freitas R.C.C. de Luchessi A.D. Hirata T.D.C. Fajardo C.M. Borges J.B. Statin treatment alters the expression profile of plasma exosome-derived microRNAs in patients with familial hypercholesterolemia J Pharm Exp Ther 392 2025 103626 10.1016/j.jpet.2025.103626 40609152 55 Levstek T. Karun T. Rehberger Likozar A. Šebeštjen M. Trebušak Podkrajšek K. Interplay between microRNAs, serum proprotein convertase Subtilisin/Kexin type 9 (PCSK9), and lipid parameters in patients with very high Lipoprotein(a) treated with PCSK9 inhibitors Genes (Basel) 14 2023 10.3390/genes14030632 PMC10048228 36980904 56 Dlouha D. Blaha M. Huckova P. Lanska V. Hubacek J.A. Blaha V. Long-Term LDL-Apheresis treatment and dynamics of circulating miRNAs in patients with severe familial hypercholesterolemia Genes (Basel) 14 2023 10.3390/genes14081571 PMC10454435 37628623 Appendix A Supplementary material  Supplementary material Data Availability The datasets and computer code produced in this study are available in the following databases: • Affymetrix microarray (GeneChip microRNA 4.0) dataset: miRNA profiling GSE178126 https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE178126 • Affymetrix microarray (GeneChip microRNA 4.0) dataset: miRNA profiling GSE265997 https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc GSE265997 Acknowledgments The authors thank Monserrat Gomez-Pardo for technical assistance, the Spanish Familial Hypercholesterolaemia Foundation for assistance in the recruitment and follow-up of participants and to the FH families for their valuable contribution and willingness to participate. Appendix A Supplementary data associated with this article can be found in the online version at doi:10.1016/j.csbj.2025.09.026 ",
  "metadata": {
    "Title of this paper": "Long-Term LDL-Apheresis treatment and dynamics of circulating miRNAs in patients with severe familial hypercholesterolemia",
    "Journal it was published in:": "Computational and Structural Biotechnology Journal",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481025/"
  }
}