{
  "title": "Paper_112",
  "abstract": "pmc Oncology Oncology 2985 kargersd OCL Oncology 0030-2414 1423-0232 pmc-is-collection-domain yes pmc-collection-title Karger Author's Choice PMC12490838 PMC12490838.1 12490838 12490838 39715602 10.1159/000543281 543281 1 Clinical Study Adjuvant Sequential Chemotherapy for Salivary Duct Carcinomas: A Retrospective Comparative Analysis Adjuvant Chemotherapy for Salivary Duct Carcinoma 2767495 Kim Younghac  a 2767496 Choi Nayeon  a 2767497 Kim Eun-Hye  a 2767498 Chung Man Ki  a 2767499 Son Young-Ik  a 2767500 Oh Dongryul  b 2767501 Ahn Yong Chan  b 2767502 Lee Se-Hoon  c 2767503 Jung Hyun-Ae  c 2767504 Park Sehhoon  c 2767505 Kim Jinyong  c 2767506 Jeong Han-Sin  a 2767507 Ahn Myung-Ju  c  a Seoul South Korea  b Seoul South Korea  c Seoul South Korea Correspondence to: Han-Sin Jeong, hansjeong@skku.edu silkahn@skku.edu 23 12 2024 10 2025 103 10 498211 888 898 9 10 2024 16 12 2024 2025 23 12 2024 03 10 2025 03 10 2025 © 2024 The Author(s). Published by S. Karger AG, Basel 2024 https://creativecommons.org/licenses/by-nc/4.0/ This article is licensed under the Creative Commons Attribution-NonCommercial 4.0 International License (CC BY-NC) ( http://www.karger.com/Services/OpenAccessLicense Abstract Introduction This study aimed to report the efficacy and safety of adjuvant sequential chemotherapy after definitive treatment of salivary duct carcinoma (SDC) compared with the standard treatment alone (surgery with postoperative radiation therapy). Methods This was a retrospective study of pathologically confirmed 135 SDC patients (study period 2009 to 2022). After curative surgery and adjuvant radiation therapy, 55 of 135 patients decided to receive additional chemotherapy (OP + RT + chemo group), while 80 opted for surgery and radiation (OP + RT group). Treatment outcomes of overall survival (OS), disease-free survival (DFS), and distant metastasis-free survival (DMFS) were compared using a propensity score matching (PSM) analysis. Results Adjuvant chemotherapy consisted of three cycles of cisplatin-based regimen, which was well tolerated in most patients with minimal adverse events. Multivariable analyses indicated that the addition of chemotherapy did not improve OS ( p p p p p p Conclusions Current cisplatin-based adjuvant chemotherapy did not significantly improve treatment outcomes of SDC patients over the surgery and adjuvant radiation. Further development or clinical studies are required to improve the outcomes of SDC, including chemotherapeutic, biomarkers, immune checkpoint inhibitors, or treatment strategies. Plain Language Summary Salivary duct carcinoma (SDC) is a rare and aggressive cancer that arises in the salivary glands. While the standard treatment involves surgery followed by radiation therapy, the prognosis remains poor, with many patients experiencing recurrence or distant spread of the disease. This study looked at whether adding chemotherapy to the standard treatment could improve SDC patient outcomes. Researchers analyzed 135 patients treated over 13 years and found that while chemotherapy was safe and well tolerated, it did not significantly improve survival or reduce the risk of recurrence. New approaches, such as targeted therapies or immune treatments, are needed to improve outcomes for patients with this challenging disease. Keywords Salivary gland neoplasms Adjuvant chemotherapy Neoplasm metastasis Progression-free survival Treatment outcome No authors received any funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf no pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes accessibilitySummary WCAG 2.1 Level AA accessibility-pdf-ua-compliance yes Introduction Salivary duct carcinoma (SDC) is a rare malignant tumor originating from the ductal epithelial cells of the salivary glands [ 1 2 3 4 5 6 9 10 11 For the current reported adjuvant chemotherapy on SDC, the number of involved cases was very small (less than 10 cases for each study), and the response to single cisplatin-based chemotherapy seemed ineffective [ 12 13 14 16 17 18 In patients with non-small cell lung cancer or triple-negative breast cancer, there have been some evidences indicating that platinum-based chemotherapy following definitive treatment can improve disease-free survival (DFS) or overall survival (OS) [ 19 20 21 22 23 23 Materials and Methods Study Cohort This was a retrospective study that compared the outcomes following standard treatments (surgery and adjuvant RT) with or without chemo. The inclusion criteria for this study were patients who had pathologically confirmed salivary gland origin SDC and underwent curative resection and adjuvant RT at our hospital. A total of 244 patients with SDC who met the inclusion criteria between 2009 and 2022 were identified. The exclusion criteria were recurrent or systemic spread diseases at the time of diagnosis, incomplete standard treatments, previous history of head and neck cancer within 5 years, and/or incomplete medical information due to follow-up loss of shorter than 2 years. With these criteria, 109 patients were excluded and a total of 135 patients were eligible for this study. The tumor-node-metastasis status of each tumor was classified according to the 8th Edition of the American Joint Committee on Cancer (AJCC) Staging Manual [ 24 Standard Treatments: Surgery and Adjuvant Radiation Treatment Preoperative histologic diagnosis using needle aspiration cytology or biopsy was attempted in all patients. Histologic diagnosis of SDC subtype was not clearly made in 76 patients (56.3%), while high-grade carcinoma was diagnosed in 28 (20.7%) and SDC in 31 (22.9%). The primary treatment was adequate surgical resection for the primary lesion. During surgery, frozen biopsy confirmed the primary tumor as high-grade carcinoma in unclear cases preoperatively, leading to concurrent selective neck lymph node dissection. Neck lymph node dissection was performed together electively on the cases without clinical nodal metastasis (lymph node levels 1 to 3) or therapeutically on the cN(+) cases (ipsilateral levels 1 to 5). Based on the surgical pathology information, all patients underwent adjuvant RT, delivering 54–66 Gy by either three-dimensional conformal RT ( N N Adjuvant Sequential Chemotherapy At the time of completion of adjuvant RT, information about chemo including the potential benefits and morbidity risk was provided to the patients through the multidisciplinary discussion. Then, decisions for chemo were made by patients. In total, 55 of 135 patients decided to receive additional chemotherapy (OP + RT + chemo group), while 80 patients did not (OP + RT group). The chemotherapy regimens consisted of three (median = 3, range 1–4) cycles of cyclophosphamide, doxorubicin, and cisplatin combination (CAP regimen) in 38 patients, docetaxel and cisplatin combination (DP regimen) in seven, 5-fluorouracil and cisplatin combination (FP regimen) in three, and cisplatin alone in 7 patients, respectively. The chemotherapy was administered within 1 month of RT completion, which was given either weekly or once every 3 weeks. Treatment-related toxicities were monitored based on the Common Terminology Criteria for Adverse Events (CTCAE) version 4.0 [ 25 Follow-Up and Outcomes All patients included in this study had a minimum of 2 years of follow-up, except for those who died within 2 years. The starting point of the follow-up period was the time of completion of adjuvant treatments. The endpoint of follow-up was the time of the last hospital visit or documented event (death, recurrence, or metastasis). Cases without predefined events were censored at the last hospital visit. The mean follow-up period was 46.5 months (range 7 to 227, interquartile range 21 to 73). During the clinical courses, the follow-up protocol was based on the current National Comprehensive Cancer Network (NCCN) guidelines [ 4 Statistical Analysis The initial baseline characteristics were compared between the two groups using the chi-square test or Fisher’s exact test, two-sample t Univariable and multivariable analyses using a Cox proportional hazards model were conducted for OS, DFS, and DMFS in all patients and between the two groups. As the distribution of baseline characteristics was uneven between the two groups, we conducted propensity score matching (PSM) analysis to reduce the bias for potential confounding factors. We matched the propensity scores of the selected variables from the univariable analyses (caliper width = 0.15 for OS, DFS, and DMFS) and built a comparison group of 46 (DFS and OS) or 50 (DMFS) matched pairs of patients between two groups (absolute standardized mean difference 0.0 to 0.57). Then, the outcomes of interest were compared between the two treatment groups, after further adjusting the variables >0.1 in ASMD. To confirm our results, sensitivity analyses were also conducted by exchanging the variables included in the PSM analysis. All statistical analyses were performed using R p Results Baseline Characteristics of Enrolled SDC Patients All patients had high-grade SDC, which was confirmed by surgical pathology. Of 135 patients included in the study, 80 underwent surgery and postoperative RT (OP + RT) and 55 did surgery, postoperative RT, and subsequent chemotherapy (OP + RT + chemo) ( Table 1 p p Table 1. Baseline characteristics and treatment outcomes of enrolled SDC patients  N Total patients ( N OP + RT ( N OP + RT + chemo ( N  p Age (mean±SD) 61.0±11.7 62.5±12.0 58.7±11.0 0.061 Sex (M:F) 0.728 Male 106 (78.5) 62 (77.5) 44 (80.0) Female 29 (21.5) 18 (22.5) 11 (20.0) ECOG status 0.172 0 40 (29.6) 16 (20.0) 24 (43.6) 1 79 (58.5) 52 (65.0) 27 (49.1) 2 16 (11.9) 12 (15.0) 4 (7.3) Smoking status 0.745 None + ex-smoker 71 (52.6) 43 (53.8) 28 (51.0) Current smoker 64 (47.4) 37 (46.2) 27 (49.0) TNM stage (AJCC 8th ed.) pT status 0.912 T1 22 (16.3) 13 (16.3) 9 (16.4) T2 43 (31.9) 27 (33.7) 16 (29.1) T3 40 (29.6) 22 (27.5) 18 (32.7) T4 30 (22.2) 18 (22.5) 12 (21.8) pN status 0.447 N0 65 (48.2) 43 (53.8) 22 (40.0) N1 9 (6.7) 5 (6.3) 4 (7.3) N2 22 (16.3) 11 (13.7) 11 (20.0) N3 39 (28.9) 21 (26.2) 18 (32.7) Overall stage (TNM) 0.041 I 14 (10.4) 10 (12.5) 4 (7.3) II 29 (21.5) 23 (28.8) 6 (10.9) III 22 (16.3) 11 (13.7) 11 (20.0) IV 70 (51.8) 36 (45.0) 34 (61.8) RM status 0.188 Negative 42 (31.1) 28 (35.0) 14 (25.5) Close <5 mm 23 (17.0) 10 (12.5) 13 (23.6) Positive 70 (51.9) 42 (52.5) 28 (50.9) LVI present 60 (44.4) 30 (37.5) 30 (54.6) 0.050 PNI present 50 (37.0) 28 (35.0) 22 (40.0) 0.554 ENE present 40 (29.6) 22 (27.5) 18 (32.7) 0.513 Chemotherapy regimen CAP 38 (69.1) DP 7 (12.7) Cisplatin (alone) 7 (12.7) FP 3 (5.5) SDC, salivary duct carcinoma; OP, surgery, curative; RT, radiation therapy; chemo, adjuvant chemotherapy; SD, standard deviation; ECOG Status, Eastern Cooperative Oncology Group Performance Status; TNM stage, tumor-node-metastasis prognostic stage; AJCC 8th ed., American Joint Committee on Cancer staging system 8th edition; CAP, cisplatin, doxorubicin, and cyclophosphamide; DP, docetaxel and cisplatin; FP, 5-fluorouracil and cisplatin. Adverse Events of Chemotherapy In the 55 patients in OP + RT + chemo group, the most common adverse event was grades 1–2 vomiting (7, 12.7%), followed by grades 1–2 laryngeal inflammation (edema) (4, 7.3%), and grade 3 neutropenia (4, 7.3%), respectively ( Table 2 Table 2. Adverse events of chemo ( N Adverse events Regimen Grade  N Vomiting ≤2 7 (12.7) CAP 4 (7.3) DP 1 (1.8) Cisplatin 1 (1.8) FP 1 (1.8) Laryngeal inflammation ≤2 4 (7.3) DP 2 (3.6) Cisplatin 2 (3.6) Neutropenia CAP 3 4 (7.3) Weight loss 2 3 (5.5) CAP 2 (3.6) Cisplatin 1 (1.8) Diarrhea ≤2 3 (5.5) CAP 2 (3.6) DP 1 (1.8) Mucositis ≤2 3 (5.5) CAP 2 (3.6) Cisplatin 1 (1.8) Dry skin CAP 1 1 (1.8) Neck edema FP 1 1 (1.8) Grade of toxicity according to Common Terminology Criteria for Adverse Events (CTCAE) v4.0. CAP, cisplatin, doxorubicin, and cyclophosphamide; DP, docetaxel and cisplatin; FP, 5-fluorouracil and cisplatin. Treatment Outcomes of Enrolled SDC Patients Without adjustment of any variables, overall oncological outcomes between the two groups were similar with a mean follow-up of 46.5 months ( Table 3 p p Table 3. Treatment outcomes of enrolled SDC patients Variables Total patients ( N OP + RT ( N OP + RT + chemo ( N  p Local recurrence, n 9 (6.7) 6 (7.5) 3 (5.5) 0.738 Regional recurrence, n 15 (11.1) 8 (10.0) 7 (12.7) 0.781 Combined loco-regional recurrence, n 22 (16.3) 13 (16.3) 9 (16.4) 0.999 Distant metastasis, n 36 (26.7) 19 (23.8) 17 (30.9) 0.429 Death, any cause, n 37 (27.4) 24 (30.0) 13 (23.6) 0.440 Follow-up duration (mean±SD), months 46.5±39.1 45.4±42.1 48.1±34.9 0.696 SDC, salivary duct carcinoma; OP, surgery, curative; RT, radiation therapy; chemo, adjuvant chemotherapy; SD, standard deviation. Multivariable Analyses of Risk Factors for OS, DFS, and DMFS in SDC Patients To confirm the actual effect of chemo on oncological outcomes, we conducted multivariable analyses of identified risk factors for OS, DFS, and DMFS in total SDC patients. Before multivariable analyses, we pre-checked the proportional hazard assumption of the included variables with Shoenfeld’s individual test and time-dependent plots and found that the relative hazard remained constant over time with different covariate levels. As shown in Table 4 p https://doi.org/10.1159/000543281 Table 4. Uni- and multivariable analyses of risk factors for OS and DFS in SDC patients Variables OS DFS univariable analyses multivariable analysis univariable analyses multivariable analysis HR 95% CI  p HR 95% CI  p HR 95% CI  p HR 95% CI  p Age (1-year increase) 1.03 1.00–1.06 0.056 1.02 0.99–1.04 0.135 Sex (F to M) 0.43 0.15–1.23 0.115 0.47 0.21–1.03 0.059 ECOG status (2 to 0–1) 5.11 2.52–10.35 <0.001 6.72 2.71–16.65 <0.001 2.94 1.54–5.59 0.001 3.48 1.62–7.49 0.001 Smoking status (yes to no) 2.73 1.32–5.63 0.007 2.30 1.09–4.85 0.029 2.23 1.28–3.89 0.004 1.71 0.94–3.10 0.079 TNM stage (AJCC 8th ed.) pT status T1 (reference) T2 1.23 0.43–3.53 0.706 0.95 0.40–2.27 0.909 T3 1.07 0.36–3.22 0.899 1.15 0.49–2.73 0.747 T4 1.97 0.69–5.62 0.203 2.04 0.89–4.70 0.093 pN status N0 (reference) N1–2 3.86 1.46–10.19 0.006 11.19 1.72–72.85 0.016 3.98 1.90–8.34 <0.001 4.45 1.32–15.02 0.016 N3 5.78 2.41–13.85 <0.001 4.55 0.79–26.10 0.089 4.74 2.37–9.46 <0.001 2.17 0.68–6.90 0.191 Overall stage I (reference) II 0.24 0.04–1.34 0.104 0.10 0.01–0.68 0.018 0.28 0.07–1.19 0.084 0.14 0.03–0.67 0.013 III 0.33 0.06–1.83 0.206 0.11 0.01–1.19 0.069 0.54 0.14–2.02 0.360 0.24 0.05–1.17 0.078 IV 1.79 0.62–5.16 0.279 0.29 0.04–2.07 0.219 2.34 0.92–5.94 0.073 0.59 0.14–2.47 0.466 RM status Negative (reference) Close (<5 mm) 0.54 0.25–1.14 0.106 0.82 0.34–2.00 0.670 0.69 0.37–1.31 0.260 0.83 0.40–1.71 0.610 Positive 1.57 0.68–3.64 0.292 1.70 0.60–4.84 0.321 2.51 1.27–4.95 0.008 2.79 1.18–6.59 0.019 LVI 2.82 1.42–5.60 0.003 0.64 0.24–1.74 0.383 2.64 1.52–4.58 <0.001 0.61 0.28–1.33 0.214 PNI 2.83 1.46–5.46 0.002 2.48 1.07–5.76 0.035 2.85 1.67–4.86 <0.001 2.24 1.14–4.41 0.020 ENE 3.14 1.62–6.08 <0.001 2.51 1.47–4.30 <0.001 Treatment modality OP + RT (reference) OP + RT + chemo 0.70 0.35–1.39 0.309 0.45 0.20–1.00 0.050 1.10 0.64–1.88 0.738 0.77 0.42–1.40 0.386 ENE variable was excluded in the multivariable models due to the multicollinearity with pN status variable. OS, overall survival; DFS, disease-free survival; SDC, salivary duct carcinoma; HR, hazard ratio; 95% CI, 95% confidence interval; ECOG Status, Eastern Cooperative Oncology Group Performance Status; TNM stage, tumor-node-metastasis prognostic stage; AJCC 8th ed., American Joint Committee on Cancer staging system 8th edition; OP, surgery, curative; RT, radiation therapy; chemo, adjuvant chemotherapy. Comparison of Outcomes with PSM Analysis according to Treatment Groups Based on the univariable analyses, we conducted PSM analysis for OS and DFS and we chose a well-fitted model with a caliper width of 0.15, leaving 46 cases in each treatment group ( Table 5 Table 6 Table 5. PSM of the two groups for OS and DFS comparison (caliper width = 0.15) Variables OP + RT ( N N OP + RT + chemo ( N N ASMD pre-matching post-matching Age (mean±SD) 62.0±11.5 60.6±10.4 0.33 0.13 Sex (M:F) 37:9 (80.4:19.6) 37:9 (80.4:19.6) 0.06 0.00 ECOG status (0–1:2) 42:4 (91.3:8.7) 43:3 (93.5:6.5) 0.25 0.08 Smoking status (none + ex-smoker:current smoker) 22:24 (47.8:52.2) 22:24 (47.8:52.2) 0.06 0.00 TNM stage (AJCC 8th ed.) pT status (T1:T2:T3:T4) 8:10:17:11 (17.4:21.7:37.0:23.9) 7:11:16:12 (15.2:23.9:34.8:26.1) 0.13 0.09 pN status (N0:N1–2:N3) 19:11:16 (41.3:24.0:34.7) 20:12:14 (43.5:26.1:30.4) 0.28 0.09 Overall stage (I:II:III:IV) 5:5:8:28 (10.9:10.9:17.4:60.8) 4:6:9:27 (8.7:13.0:19.6:58.7) 0.53 0.11 RM status (negative:close <5 mm:positive) 15:26:5 (32.6:56.5:10.9) 13:22:11 (28.3:47.8:23.9) 0.32 0.35 LVI (no:yes) 27:19 (58.7:41.3) 21:25 (45.6:54.4) 0.35 0.26 PNI (no:yes) 29: 17 (63.0: 37.0) 27: 19 (58.7: 41.3) 0.10 0.09 ENE (no:yes) 29:17 (63.0:37.0) 32:14 (69.6:30.4) 0.11 0.14 OS, overall survival; DFS, disease-free survival; OP, surgery, curative; RT, radiation therapy; chemo, adjuvant chemotherapy; ASMD, absolute value of standardized mean difference; SD, standard deviation; ECOG Status, Eastern Cooperative Oncology Group Performance Status; TNM stage, tumor-node-metastasis prognostic stage; AJCC 8th ed., American Joint Committee on Cancer staging system 8th edition. Table 6. Comparison of treatment outcomes between the two groups (OP + RT vs. OP + RT + chemo) after PSM, adjusted with matching variables of ASMD >0.10 Survival outcomes Treatment groups HR 95% CI  p OS OP + RT (reference) OP + RT + chemo 0.40 0.12–1.29 0.126 DFS OP + RT (reference) OP + RT + chemo 0.69 0.30–1.56 0.367 DMFS OP + RT (reference) OP + RT + chemo 0.96 0.46–1.99 0.903 OP, surgery, curative; RT, radiation therapy; chemo, adjuvant chemotherapy; ASMD, absolute value of standardized mean difference; HR, hazard ratio; 95% CI, 95% confidence interval; OS, overall survival; DFS, disease-free survival; DMFS, distant metastasis-free survival. Compared with OP + RT group, the hazard ratio of OP + RT + chemo group was 0.40 (95% confidence interval [95% CI] = 0.12–1.29) for OS, 0.69 (95% CI = 0.30–1.56) for DFS, and 0.96 (95% CI = 0.46–1.99) for DMFS, respectively. All survival outcomes showed no statistical difference between the two groups ( Fig. 1 Fig. 1.  a–f Discussion Among SDC patients who undergo the current standard treatments (surgery with postoperative RT), outcomes are not satisfactory: the reported 5-year OS is only 43%–64% [ 6 9 26 10 11 23 23 Regarding the chemotherapeutic agents, the results from prospective randomized clinical trials have been limited due to the rarity of this disease and there still is lack of guidance on chemotherapy usage in SDC [ 27 28 29 30 14 31 32 However, the previous reports were all based on the outcomes of recurrent or metastatic disease, rather than in the adjuvant settings [ 14 28 31 Even with our efforts to adjust the confounders to estimate the treatment outcomes, we had several study limitations to draw a more solid conclusion. First, as this study was a retrospective analysis, the allocation to treatment modalities could have been biased. Although we conducted multivariable analyses and PSM analysis to minimize the bias, hidden confounding factors might have existed, which could have affected the treatment outcomes. Second, the chemotherapeutic drugs prescribed in this study were rather heterogeneous, and due to the small number of patients, we could not explore the actual effects according to each chemotherapeutic regimen, if present. Due to the small number of patients in the adjuvant DP, FP, or cisplatin chemotherapy subgroups, the comparison of efficacy among chemotherapeutic regimens was evaluated by dividing the patients into two groups: the CAP group ( N N Nevertheless, our study assessed the outcomes of chemo for specific SDC histology among various high-risk salivary gland cancers, which have not been previously reported in real-world setting. This study suggested the future directions to include new chemotherapy regimens (e.g., anti-HER-2 antibody-drug conjugates [ 33 Conclusion Cisplatin-based chemo, added to the standard surgery with RT, had no additional benefit in improving the treatment outcomes in SDC patients. Further development or clinical studies are required to improve the outcomes of SDC, including chemotherapeutics, biomarkers, immune checkpoint inhibitors, or treatment strategies. Statement of Ethics All procedures performed in this study were in accordance with the ethical standards of the institutional and national research committees and with the 1964 Helsinki Declaration and its later amendments or comparable ethical standards. The study protocol was approved before data collection, and the need for informed consent was waived by the Institutional Review Board of Samsung Medical Center (Seoul, Korea; Approval No. SMC IRB 2024-04-093) due to the retrospective nature. Conflict of Interest Statement The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Funding Sources No authors received any funding. Author Contributions Y. Kim: investigation, formal analysis, resources, data curation, and writing original draft. N. Choi: methodology, formal analysis, investigation, visualization, and writing – review and editing. E.H. Kim: resources, data curation, and investigation. M.K. Chung, Y.I. Son, and D. Oh: resources, and writing – review and editing. Y.C. Ahn, H.S. Jeong, and M.J. Ahn: conceptualization, investigation, supervision, visualization, and writing – review and editing. S.H. Lee, H.A. Jung, S. Park, and J. Kim: resources, investigation, and writing – review and editing. All authors gave their final approval and agreed to be accountable for all aspects of the work. Data Availability Statement The data supporting the findings of this study are available from the corresponding author (H.-S. Jeong) upon request. The data are not publicly available because they contain information that could compromise the privacy of the research participants. Supplementary Material Supplementary Material Supplementary Material Supplementary Material References 1. Kleinsasser O Klein H Hübner GS Salivary duct carcinoma. A group of salivary gland tumors analogous to mammaryduct carcinoma Arch Klin Exp Ohren- Nasen- Kehlkopfheilkd 1968 192 1 100 5 4301301 2. Zhang D Li L Prognostic models for estimating survival of salivary duct carcinoma: a population-based study Eur Arch Oto-Rhino-Laryngol 2023 280 4 1939 54 10.1007/s00405-022-07755-3 36422671 3. Skalova A Hyrcza MD Leivo I Update from the 5th edition of the world Health organization classification of head and neck tumors: salivary glands Head Neck Pathol 2022 16 1 40 53 35312980 10.1007/s12105-022-01420-1 PMC9018948 4. National Comprehensive Cancer Network Head and neck cancers (Version 3.2024) https://www.nccn.org/professionals/physician_gls/pdf/head-and-neck.pdf/ 5. Geiger JL Ismaila N Beadle B Caudell JJ Chau N Deschler D Management of salivary gland malignancy: ASCO guideline J Clin Oncol 2021 39 17 1909 41 33900808 10.1200/JCO.21.00449 6. Jayaprakash V Merzianu M Warren GW Arshad H Hicks WL Jr Rigual NR Survival rates and prognostic factors for infiltrating salivary duct carcinoma: analysis of 228 cases from the Surveillance, Epidemiology, and End Results database Head Neck 2014 36 5 694 701 23606370 10.1002/hed.23350 PMC4524549 7. D'Heygere E Meulemans J Vander Poorten V Salivary duct carcinoma Curr Opin Otolaryngol Head Neck Surg 2018 26 2 142 51 29373327 10.1097/MOO.0000000000000436 8. Otsuka K Imanishi Y Tada Y Kawakita D Kano S Tsukahara K Clinical outcomes and prognostic factors for salivary duct carcinoma: a multi-institutional analysis of 141 patients Ann Surg Oncol 2016 23 6 2038 45 26790669 10.1245/s10434-015-5082-2 PMC4858547 9. Boon E Bel M van Boxtel W van der Graaf WTA van Es RJJ Eerenstein SEJ A clinicopathological study and prognostic factor analysis of 177 salivary duct carcinoma patients from The Netherlands Int J Cancer 2018 143 4 758 66 29492965 10.1002/ijc.31353 PMC6055864 10. Roh JL Lee JI Choi SH Nam SY Kim SO Cho KJ Prognostic factors and oncologic outcomes of 56 salivary duct carcinoma patients in a single institution: high rate of systemic failure warrants targeted therapy Oral Oncol 2014 50 11 e64 6 25218000 10.1016/j.oraloncology.2014.08.010 11. Guzzo M Di Palma S Grandi C Molinari R Salivary duct carcinoma: clinical characteristics and treatment strategies Head Neck 1997 19 2 126 33 9059870 10.1002/(sici)1097-0347(199703)19:2<126::aid-hed7>3.0.co;2-6 12. Mifsud M Sharma S Leon M Padhya T Otto K Caudell J Salivary Duct Carcinoma of the Parotid Otolaryngol Head Neck Surg 2016 154 6 1041 6 26980918 10.1177/0194599816636812 13. Johnston ML Huang SH Waldron JN Atenafu EG Chan K Cummings BJ Salivary duct carcinoma: Treatment, outcomes, and patterns of failure Head Neck 2016 38 Suppl 1 E820 6 25916947 10.1002/hed.24107 14. Nakano K Sato Y Sasaki T Shimbashi W Fukushima H Yonekawa H Combination chemotherapy of carboplatin and paclitaxel for advanced/metastatic salivary gland carcinoma patients: differences in responses by different pathological diagnoses Acta Otolaryngol 2016 136 9 948 51 27094013 10.3109/00016489.2016.1170876 15. Okada T Saotome T Nagao T Masubuchi T Fushimi C Matsuki T Carboplatin and docetaxel in patients with salivary gland carcinoma: a retrospective study In Vivo 2019 33 3 843 53 31028207 10.21873/invivo.11549 PMC6559918 16. Dreyfuss AI Clark JR Fallon BG Posner MR Norris CM Jr Miller D Cyclophosphamide, doxorubicin, and cisplatin combination chemotherapy for advanced carcinomas of salivary gland origin Cancer 1987 60 12 2869 72 2824016 10.1002/1097-0142(19871215)60:12<2869::aid-cncr2820601203>3.0.co;2-y 17. Limaye SA Posner MR Krane JF Fonfria M Lorch JH Dillon DA Trastuzumab for the treatment of salivary duct carcinoma Oncologist 2013 18 3 294 300 23429737 10.1634/theoncologist.2012-0369 PMC3607526 18. Hanna GJ Bae JE Lorch JH Haddad RI Jo VY Schoenfeld JD The benefits of adjuvant trastuzumab for HER‐2‐positive salivary gland cancers Oncologist 2020 25 7 598 608 32310325 10.1634/theoncologist.2019-0841 PMC7356716 19. Yu KD Ye FG He M Fan L Ma D Mo M Effect of adjuvant paclitaxel and carboplatin on survival with triple-negative breast cancer: a phase 3 randomized clinical trial JAMA Oncol 2020 6 9 1390 6 32789480 10.1001/jamaoncol.2020.2965 PMC7426881 20. Ou W Sun HB Ye X Zhang BB Yang H Fang Q Adjuvant carboplatin-based chemotherapy in resected stage IIIA-N2 non-small cell lung cancer J Thorac Oncol 2010 5 7 1033 41 20502361 10.1097/JTO.0b013e3181d95db4 21. Dauzier E Lacas B Blanchard P Le QT Simon C Wolf G Role of chemotherapy in 5000 patients with head and neck cancer treated by curative surgery: A subgroup analysis of the meta-analysis of chemotherapy in head and neck cancer Oral Oncol 2019 95 106 41 31345376 10.1016/j.oraloncology.2019.06.001 PMC7029787 22. Ma J Liu Y Huang X-L Zhang Z-Y Myers JN Neskey DM Induction chemotherapy decreases the rate of distant metastasis in patients with head and neck squamous cell carcinoma but does not improve survival or locoregional control: a meta-analysis Oral Oncol 2012 48 11 1076 84 22800881 10.1016/j.oraloncology.2012.06.014 23. Gordon AJ Chow MS Patel A Hu KS Li Z Jacobson AS Adoption of adjuvant chemotherapy in high-risk salivary gland malignancies Head Neck 2023 45 1 167 77 36245302 10.1002/hed.27222 24. Amin MB Greene FL Edge SB Compton CC Gershenwald JE Brookland RK The Eighth Edition AJCC Cancer Staging Manual: continuing to build a bridge from a population-based to a more “personalized” approach to cancer staging CA Cancer J Clin 2017 67 2 93 9 28094848 10.3322/caac.21388 25. National Cancer Institute Cancer therapy evaluation program Common terminology criteria for adverse events:(CTCAE) (Version 4.03) https://ctep.cancer.gov/protocolDevelopment/electronic_applications/ctc.htm/ 26. Johnston ML Huang SH Waldron JN Atenafu EG Chan K Cummings BJ Salivary duct carcinoma: treatment, outcomes, and patterns of failure Head Neck 2016 38 Suppl 1 E820 6 25916947 10.1002/hed.24107 27. Weaver AN Lakritz S Mandair D Ulanja MB Bowles DW A molecular guide to systemic therapy in salivary gland carcinoma Head Neck 2023 45 5 1315 26 36859797 10.1002/hed.27307 28. Uijen MJM Lassche G van Engen-van Grunsven ACH Tada Y Verhaegh GW Schalken JA Systemic therapy in the management of recurrent or metastatic salivary duct carcinoma: a systematic review Cancer Treat Rev 2020 89 102069 32717621 10.1016/j.ctrv.2020.102069 29. Creagan ET Woods JE Rubin J Schaid DJ Cisplatin-based chemotherapy for neoplasms arising from salivary glands and contiguous structures in the head and neck Cancer 1988 62 11 2313 9 3179947 10.1002/1097-0142(19881201)62:11<2313::aid-cncr2820621110>3.0.co;2-4 30. Licitra L Cavina R Grandi C Palma SD Guzzo M Demicheli R Cisplatin, doxorubicin and cyclophosphamide in advanced salivary gland carcinoma. A phase II trial of 22 patients Ann Oncol 1996 7 6 640 2 8879381 10.1093/oxfordjournals.annonc.a010684 31. Viscuse PV Price KA Garcia JJ Schembri-Wismayer DJ Chintakuntlawar AV First line androgen deprivation therapy vs. Chemotherapy for patients with androgen receptor positive recurrent or metastatic salivary gland carcinoma-A retrospective study Front Oncol 2019 9 701 31428578 10.3389/fonc.2019.00701 PMC6688187 32. Airoldi M Garzaro M Pedani F Ostellino O Succo G Riva G Cisplatin+Vinorelbine treatment of recurrent or metastatic salivary gland malignancies (rmsgm): a final report on 60 cases Am J Clin Oncol 2017 40 1 86 90 25089531 10.1097/COC.0000000000000112 33. Filippini DM Pagani R Tober N Lorini L Riefolo M Molinari G HER2-targeted therapies for salivary gland cancers Oral Oncol 2024 148 106612 38016228 10.1016/j.oraloncology.2023.106612 ",
  "metadata": {
    "Title of this paper": "HER2-targeted therapies for salivary gland cancers",
    "Journal it was published in:": "Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490838/"
  }
}