{
  "title": "Paper_67",
  "abstract": "pmc J Contemp Brachytherapy J Contemp Brachytherapy 1978 jcbrachy JCB Journal of Contemporary Brachytherapy 1689-832X 2081-2841 Termedia Publishing PMC12489535 PMC12489535.1 12489535 12489535 10.5114/jcb.2025.153852 56606 1 Original Paper Safety and efficacy of iridium-192 high-dose-rate interstitial brachytherapy for pleural and chest wall tumours: preliminary results Zhang Jing PhD * Chen Bin MD * Lin Sheng PhD Pang Haowen PhD Shi Xiangxiang MD Department of Oncology, The Affliated Hospital, Southwest Medical University, Luzhou, China Address for correspondence: haowenpang@foxmail.com uiokjh@163.com * Jing Zhang and Bin Chen contributed equally to this work. 26 8 2025 8 2025 17 4 498172 213 220 13 5 2025 27 7 2025 01 08 2025 03 10 2025 03 10 2025 Copyright © 2025 Termedia 2025 https://creativecommons.org/licenses/by-nc-sa/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International (CC BY-NC-SA 4.0). License ( http://creativecommons.org/licenses/by-nc-sa/4.0/ Purpose To evaluate the safety and efficacy of computed tomography (CT)-guided iridium-192 ( 192 Material and methods This single-centre retrospective cohort study involved 21 patients with pleural/chest wall malignant tumours treated between January 2024 and January 2025. All patients underwent HDR ISBT (30 Gy in a single fraction). Treatment included CT-guided needle implantation, three-dimensional dose optimisation (Oncentra system), and adherence to Radiation Therapy Oncology Group dose constraints for organs at risk (OARs). Efficacy endpoints included objective response (Response Evaluation Criteria in Solid Tumours v1.1), pain relief (Numerical Rating Scale), and dosimetric comparison with virtual stereotactic body radiotherapy. Safety was assessed using the Radiation Therapy Oncology Group/European Organisation for Research and Treatment of Cancer toxicity criteria. Results The median follow-up duration was 7.48 months. The objective response rate (complete response + partial response) was 76.19%, with 28.57% achieving a complete response and 47.62% achieving a partial response. Pain relief was achieved in 87.5% of patients with pretreatment pain, with numerical rating scale scores decreasing from moderate to severe (median, 6) to mild (median, 3) at 1 month. No ≥ grade II complications (e.g. bronchopleural fistula, pneumothorax) occurred; only four patients experienced minor subcutaneous haemorrhage/emphysema. Dosimetric analysis showed a significantly higher target mean dose with ISBT than with stereotactic body radiotherapy ( p Conclusions Computed tomography-guided 192 pleural and chest wall tumour brachytherapy safety efficacy pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Purpose Malignant pleural and chest wall tumours pose significant clinical challenges and often originate from various primary cancers, including breast cancer, sarcoma, lung cancer, and oesophageal cancer. These tumours are highly invasive and prone to recurrence [ 1 2 3 5 Currently, several treatment options are available for pleural and chest wall tumours; however, each has limitations. Surgery may alleviate pain in selected patients but is constrained by lesion extent and may result in chest wall defects and functional impairment. Additionally, not all patients are suitable candidates for surgery [ 6 7 8 9 Interstitial brachytherapy (ISBT) offers the distinct advantage of delivering a radioactive source directly adjacent to tumour tissue, enabling high-dose irradiation of the tumour while sparing surrounding normal tissues [ 10 14 Material and methods Study design and population This retrospective cohort study was approved by the institutional review board. Written procedural consent was obtained from all patients prior to brachytherapy. Patient and tumour characteristics, treatment details, and outcomes were collected from medical records. This study included 21 consecutive patients with malignant pleural or chest wall tumours treated between January 2024 and January 2025. The inclusion criteria for ISBT were: 1) aged 18-80 years with an Eastern Cooperative Oncology Group (ECOG) performance status score of 0 or 1; 2) pathologically or radiologically diagnosed pleural or chest wall tumours; 3) expected survival time exceeding 6 months; and 4) intolerance of or refusal to undergo surgery or EBRT. The contraindications included: 1) severe organ dysfunction; 2) coagulation disorders; 3) active infection within the past 3 months; 4) psychiatric illness; and 5) lesions invading the skin (to avoid refractory skin ulcers that may result from irradiation). ISBT procedure All patients underwent ISBT using a risk-adapted fractionation schedule (30 Gy delivered in a single fraction). This dose has been previously recommended in clinical trials evaluating HDR brachytherapy for thoracic tumours [ 13 14 Radiation oncologists contoured the gross tumour volume (GTV) using all available diagnostic information sources, and dose–volume constraints for OARs were applied to optimise the brachytherapy plan. ISBT was administered to the 90% isodose line of the GTV at a single dose of 30 Gy. The prospective dose constraints for OARs were as follows: D 1000cm3 1500cm3 max 15cm3 0.035cm3 5cm3 0.035cm3 4cm3 max max 1cm3 max 15 17 After brachytherapy planning was approved, an iridium-192 ( 192 Follow-up Patients were discharged 3 days after the ISBT procedure, with follow-up assessments routinely performed at 1, 3, 6, and 12 months after ISBT, and subsequently every 6 months until disease progression or death. Follow-up assessments were conducted during the regular outpatient visits. Radiotherapy-related toxic effects were graded according to the toxicity criteria of the RTOG and European Organisation for Research and Treatment of Cancer (EORTC) standards [ 18 19 20 21 Dosimetric comparison of ISBT plan and virtual SBRT plan Virtual stereotactic body radiotherapy (SBRT) plans were generated using the sliding-window intensity-modulated radiotherapy (IMRT) technique with the Eclipse treatment planning system (Version 16.0; Varian Medical Systems, USA). CT images obtained from the pre-ISBT plan were transferred to the SBRT planning system to create the virtual plan. The GTV was delineated by the same radiation oncologist who performed the ISBT contouring. GTV margins were uniformly expanded by 0.3 cm to generate the planning target volume (PTV). Respiratory motion was addressed by simulating clinical SBRT protocols, including the use of a vacuum mould for patient immobilisation. Although explicit respiratory gating was not employed in the virtual plan, the 0.3 cm PTV margin inherently accounted for microscopic motion uncertainties. For SBRT, the prescription dose was normalised to match that of brachytherapy, requiring at least 95% of the PTV to receive 30 Gy in a single fraction. Dose constraints for OAR were identical to those in the ISBT plan. The dosimetric parameters used to evaluate treatment plan quality included: V 100 90 95% mean The conformity index (CI) was used to describe the degree of dose-distribution conformity. The formula [ 22 C I = T V R I T V × T V R I V R I ; where TV RI RI The gradient index (R 50 Statistical analysis Side effects and adverse events were continuously monitored. For statistical comparisons between the above dose metrics and those outlined in the RTOG 0915 protocol, Friedman tests were performed, followed by post-hoc Wilcoxon t Results The characteristics and dosimetric plan quality results for all patients are summarised in Table 1 3 3 Table 1 Patient and tumour characteristics Parameter Number of patients 21 Gender, n Male 15 (71.43) Female 6 (28.57) Age (years), mean (SD) 60.81 (9.11) ECOG status, median (IQR) 0.5 (0-1) Tumour volume (cm 3 12.23 (0.79-45.16) Tumour location, n Pleura 11 (52.38) Chest wall 10 (47.62) Tumour histology, n Non-small cell lung cancer 11 (52.38) Sarcoma 4 (19.05) Colorectal cancer 4 (19.05) Breast cancer 1 (4.76) Thymic cancer 1 (4.76) ECOG – Eastern Cooperative Oncology Group Safety and efficacy of ISBT All 21 patients tolerated the procedure well, with no intra- or perioperative complications. Specifically, no grade II or higher complications such as bronchopleural fistula, pneumothorax, haemoptysis, or chest wall necrosis were detected on physical examination or follow-up CT. Only two patients developed minor subcutaneous haemorrhage, and another two developed minor subcutaneous emphysema. The median follow-up was 7.48 months (3-11 months). Among the patients, six (28.57%) achieved a CR, ten (47.62%) achieved a PR, four (19.05%) had SD, and one (4.76%) experienced PD. CT scans taken at baseline, 1 month, and 3 months after treatment for two representative patients are shown in Figure 1 Fig. 1 Patterns of radiologic response to interstitial brachytherapy CT before treatment, at 1 month, and at 3 months after treatment for two patients Of the 11 patients who reported pretreatment pain (one severe, six moderate, and four mild), the pain relief rate was 87.5% (9/11). One patient with moderate pain and two with mild pain experienced complete pain relief after ISBT, while six patients with moderate pain reported partial pain relief. Dosimetric comparison between ISBT and SBRT The dosimetric and plan quality results for all patients are summarised in Table 2 mean p 50 30Gy 5Gy Figure 2 Fig. 2 Dose distributions of interstitial brachytherapy and stereotactic body radiotherapy (SBRT) for treated lesions in different cross-sections. A B Table 2 Dosimetric and plan quality results for all patients Dosimetric parameters Brachytherapy SBRT  p GTV D 99 30.04 ±0.00 30.05 ±0.63 0.614 D mean 81.36 ±10.86 35.09 ±0.84 < 0.001 V 100 99.02 ±0.02 100.00 ±0.00 < 0.001 V 90 99.84 ±0.01 100.00 ±0.00 < 0.001 Conformity index 0.66 ±0.09 0.91 ±0.02 < 0.001 R 50 2.75 ±0.13 3.59 ±0.31 < 0.001 V 30Gy 3 17.50 ±17.82 20.28 ±17.37 0.001 V 15Gy 3 46.92 ±46.75 68.90 ±54.62 < 0.001 Spinal cord D max 3.06 ±2.61 5.61 ±3.96 < 0.001 D 0.35cm3 2.48 ±2.47 4.92 ±3.35 < 0.001 D 1.2cm3 2.06 ±2.18 4.27 ±2.81 < 0.001 Oesophagus D max 2.58 ±3.96 5.17 ±4.99 < 0.001 D 5cm3 1.23 ±1.69 1.59 ±1.33 0.009 Heart D max 3.98 ±6.37 4.81 ±5.48 0.122 D 15cm3 1.56 ±1.27 2.26 ±1.72 0.231 Aorta D max 6.13 ±9.10 9.26 ±9.72 < 0.001 D 10cm3 2.43 ±3.22 3.83 ±3.22 0.001 Trachea D max 1.50 ±2.51 2.47 ±4.60 0.689 D 4cm3 0.82 ±1.50 1.45 ±2.96 0.005 Ribs and chest wall D max 25.24 ±6.47 28.44 ±4.40 0.001 D 1cm3 14.12 ±6.05 19.77 ±5.02 < 0.001 Skin D max 4.19 ±3.14 8.78 ±2.28 < 0.001 D 10cm3 2.32 ±1.41 4.51 ±1.71 < 0.001 Total lung V 5Gy 3.31 ±2.95 4.21 ±2.41 < 0.001 V 10Gy 1.16 ±1.07 1.68 ±1.18 < 0.001 V 20Gy 0.35 ±0.35 0.48 ±0.37 0.001 Ipsilateral lung V 5Gy 6.41 ±5.29 8.29 ±4.68 < 0.001 V 10Gy 2.41 ±2.17 3.57 ±2.70 0.001 V 20Gy 0.72 ±0.73 1.04 ±0.83 0.001 SBRT – stereotactic body radiotherapy, GTV – gross tumour volume, D 99 mean 100 90 50 30Gy 15Gy 3 max 0.35cm3 1cm3 1.2cm3 4cm3 5cm3, 10cm3 15cm3 3 3 3 3 3 3 3 5Gy 10Gy 20Gy Dose constraints were achieved for all OARs except for the ribs and chest wall. The ribs and chest wall maximum dose of 1 cm 3 1cm3 max 1cm3 max max 15cm3 max Discussion The treatment of pleural and chest wall tumours has long been challenging owing to their anatomical proximity to vital organs (e.g. lungs, pleura, and ribs) and their tendency to invade neural structures (e.g. intercostal nerves and mural pleura), leading to severe pain and dysfunction. In this study, we focused on CT-guided 192 Anatomically, ISBT is safe in complex thoracic regions. Chan et al 23 192 In terms of clinical efficacy, we achieved encouraging results: the objective remission rate (CR + PR) reached 76.19%, the pain relief rate was 87.5%, and no serious grade II complications were observed. Notably, among the 11 patients with pre-treatment pain, 3 (27.27%) achieved complete remission, and 6 (54.55%) achieved partial remission. NRS scores decreased from 4-9 (median, 6; indicating moderate to severe pain) before treatment to 0-5 (median, 3; mild pain) at 1 month after treatment. These findings suggest that ISBT offers rapid and sustained efficacy in managing tumour-associated neuropathic pain. The mechanism of action may involve the single high-dose radiation (30 Gy) provided by ISBT, including tumour regression to alleviate compression, inhibition of inflammatory factor release, and direct damage to nerve fibres. ISBT may be a therapeutic option for intractable chest wall pain, especially in patients who are intolerant of or resistant to opioids. From a dosimetric perspective, ISBT offers unique advantages by delivering highly conformal high doses to the GTV while significantly reducing exposure to surrounding normal tissues, embodying the “precision strike” concept. This is exemplified by our finding, which shows a significantly higher GTV D mean et al 24 50 Surgical treatment of chest wall tumours often results in structural defects and is indicated only for limited lesions. Cryoablation, although effective for pain management, carries a risk of chest wall necrosis in post-radiotherapy tissues [ 25 26 192 27 28 29 via via This study primarily examines HDR ISBT, although low-dose-rate brachytherapy (LDR BT) remains a viable alternative involving the prolonged implantation of radioactive sources (over several days to weeks) to deliver low-dose irradiation. While LDR BT has demonstrated efficacy in treating slow-growing tumours, it necessitates extended hospitalisation and is associated with a higher risk of source displacement and infection [ 30 31 via This study provides preliminary evidence supporting the safety and efficacy of ISBT; however, several limitations must be acknowledged. First, the small sample size and single-centre, retrospective design limit generalisability. The findings in this cohort of 21 patients require validation in multicentre, prospective studies. In particular, the relatively short follow-up period (median: 7.48 months) limits assessment of late toxicities (e.g. rib fractures, skin ulceration) and long-term tumour control. Extended follow-up is essential in future studies, as short-term data may not capture the full spectrum of delayed complications or recurrence. Second, the lack of a quantitative quality of life assessment is a key limitation; pain was evaluated solely using the NRS, without incorporating standardised instruments such as the EORTC Quality of Life Questionnaire – Core 30 (QLQ-C30), which would have better reflected treatment-related impacts on patients’ sleep and mobility. Conclusions In this study, we systematically evaluated the safety and efficacy of CT-guided 192 Acknowledgements We would like to thank Editage ( www.editage.com Funding This work was supported by grants from Central Guided Local Science and Technology Development Fund Project (No. 2024ZYD0334); Sichuan Medical and Health Care Promotion Institute Project (No. KY2022SJ0377); Luzhou-Southwest Medical University Transformation and Landing Support Project (No. 2024LZXNYDZ002); and the Southwest Medical University Foundation (No. 2023QN105). Disclosures This retrospective study was approved by the Research Ethics Committee (Approval No. KY2021242) and in accordance with the 1964 Declaration of Helsinki and its later amendments or comparable ethical standards. Written informed consent was obtained from all individual participants included in the study. The authors declare no conflict of interest. 1 De Paoli L Quaia E Poillucci G et al Imaging characteristics of pleural tumours Insights Imaging 2015 6 729 740 26475741 10.1007/s13244-015-0441-x PMC4656241 2 Majeed FA Ali A Chatha SS et al Management of malignant chest wall tumors J Coll Physicians Surg Pak 2021 31 833 836 34271786 10.29271/jcpsp.2021.07.833 3 Brawley OW Smith DE Kirch RA Taking action to ease suffering: advancing cancer pain control as a health care priority CA Cancer J Clin 2009 59 285 289 19684302 10.3322/caac.20030 4 Quinten C Coens C Mauer M et al Baseline quality of life as a prognostic indicator of survival: a meta-analysis of individual patient data from EORTC clinical trials Lancet Oncol 2009 10 865 871 19695956 10.1016/S1470-2045(09)70200-1 5 MacLeod N Kelly C Stobo J et al Pain in malignant pleural mesothelioma: A prospective characterization study Pain Med 2016 17 2119 2126 27117437 10.1093/pm/pnw061 6 Wouters MW van Geel AN Nieuwenhuis L et al Outcome after surgical resections of recurrent chest wall sarcomas J Clin Oncol 2008 26 5113 5118 18794540 10.1200/JCO.2008.17.4631 7 Westhoff PG de Graeff A Monninkhof EM et al Quality of life in relation to pain response to radiation therapy for painful bone metastases Int J Radiat Oncol Biol Phys 2015 93 694 701 26281825 10.1016/j.ijrobp.2015.06.024 8 Abtin F Quirk MT Suh RD et al Percutaneous cryoablation for the treatment of recurrent malignant pleural mesothelioma: Safety, early-term efficacy, and predictors of local recurrence J Vasc Interv Radiol 2017 28 213 221 27979596 10.1016/j.jvir.2016.09.027 9 Fintelmann FJ Braun P Mirzan SH et al Percutaneous cryoablation: safety and efficacy for pain palliation of metastases to pleura and chest wall [published correction appears in J Vasc Interv Radiol. 2020 Sep 31(9):1516. doi: 10.1016/j.jvir.2020.07.005.] J Vasc Interv Radiol 2020 31 294 300 31899108 10.1016/j.jvir.2019.09.013 10 Itami J Modern development of high-dose-rate brachytherapy Jpn J Clin Oncol 2020 50 490 501 32134450 10.1093/jjco/hyaa029 11 Manning MA Zwicker RD Arthur DW Arnfield M Biologic treatment planning for high-dose-rate brachytherapy Int J Radiat Oncol Biol Phys 2001 49 839 845 11172968 10.1016/s0360-3016(00)01453-x 12 Wu T Lee A Suh R et al Salvage percutaneous high-dose-rate brachyablation after stereotactic body radiation therapy for early-stage non-small cell lung cancer J Contemp Brachytherapy 2024 16 150 155 38808204 10.5114/jcb.2024.139103 PMC11129647 13 Xiang L Ren PR Li HX et al Effect of 3-dimensional interstitial high-dose-rate brachytherapy with regional metastatic lymph node intensity-modulated radiation therapy in locally advanced peripheral non-small cell lung cancer: 5-year follow-up of a phase 2 clinical trial Int J Radiat Oncol Biol Phys 2023 115 347 355 35901979 10.1016/j.ijrobp.2022.07.028 14 Xiang L Zhang JW Lin S et al Computed tomography-guided interstitial high-dose-rate brachytherapy in combination with regional positive lymph node intensity-modulated radiation therapy in locally advanced peripheral non-small cell lung cancer: A phase 1 clinical trial Int J Radiat Oncol Biol Phys 2015 92 1027 1034 26194678 10.1016/j.ijrobp.2015.04.019 15 Ryu S Pugh SL Gerszten PC et al RTOG 0631 phase II/III study of image-guided stereotactic radiosurgery for localized (1-3) spine metastases: Phase II results Int J Radiat Oncol Biol Phys 2011 81 S131 S132 23864755 10.1016/j.prro.2013.05.001 16 Bezjak A Paulus R Gaspar LE et al Safety and efficacy of a five-fraction stereotactic body radiotherapy schedule for centrally located non-small-cell lung cancer: NRG Oncology/RTOG 0813 Trial J Clin Oncol 2019 37 1316 1325 30943123 10.1200/JCO.18.00622 PMC6524984 17 Videtic GM Hu C Singh AK et al A randomized phase 2 study comparing 2 stereotactic body radiation therapy schedules for medically inoperable patients with stage I peripheral non-small cell lung cancer: NRG Oncology RTOG 0915 (NCCTG N0927) [published correction appears in Int J Radiat Oncol Biol Phys. 2016 Mar 1;94(3):638. doi: 10.1016/j.ijrobp.2015.11.031. Timmerman, Robert D [added]] Int J Radiat Oncol Biol Phys 2015 93 757 764 26530743 10.1016/j.ijrobp.2015.07.2260 PMC4744654 18 Cox JD Stetz J Pajak TF Toxicity criteria of the Radiation Therapy Oncology Group (RTOG) and the European Organization for Research and Treatment of Cancer (EORTC) Int J Radiat Oncol Biol Phys 1995 31 1341 1346 7713792 10.1016/0360-3016(95)00060-C 19 Eisenhauer EA Therasse P Bogaerts J et al New response evaluation criteria in solid tumours: revised RECIST guideline (version 1.1) Eur J Cancer 2009 45 228 247 19097774 10.1016/j.ejca.2008.10.026 20 Swarm RA Paice JA Anghelescu DL et al Adult Cancer Pain, Version 3.2019, NCCN Clinical Practice Guidelines in Oncology J Natl Compr Canc Netw 2019 17 977 1007 31390582 10.6004/jnccn.2019.0038 21 Farrar JT Young JP Jr LaMoreaux L et al Clinical importance of changes in chronic pain intensity measured on an 11-point numerical pain rating scale Pain 2001 94 149 158 11690728 10.1016/S0304-3959(01)00349-9 22 Feuvret L Noël G Mazeron JJ Bey P Conformity index: a review Int J Radiat Oncol Biol Phys 2006 64 333 342 16414369 10.1016/j.ijrobp.2005.09.028 23 Chan MK Lee VW Kadoya N et al Single fraction computed tomography-guided high-dose-rate brachytherapy or stereotactic body radiotherapy for primary and metastatic lung tumors J Contemp Brachytherapy 2018 10 446 453 30479622 10.5114/jcb.2018.79335 PMC6251454 24 Pang H Wu K Shi X et al Hypofractionated 192Ir source stereotactic ablative brachytherapy with coplanar template assistance in the primary treatment of peripheral lung cancer J Contemp Brachytherapy 2019 11 370 378 31523239 10.5114/jcb.2019.87218 PMC6737569 25 Chaudhuri AA Binkley MS Aggarwal S et al Severe chest wall toxicity from cryoablation in the setting of prior stereotactic ablative radiotherapy Cureus 2016 8 e477 27004154 10.7759/cureus.477 PMC4780688 26 Farley P Buckley CT Mullen PR et al Cryoablation for chest wall trauma: A brief report Am Surg 2022 88 984 985 34978206 10.1177/00031348211058630 27 Lin M Eiken P Blackmon S Image guided thermal ablation in lung cancer treatment [published correction appears in J Thorac Dis. 2021 Jan 13(1):502. doi: 10.21037/jtd-2021-03.] J Thorac Dis 2020 12 7039 7047 33282409 10.21037/jtd-2019-cptn-08 PMC7711386 28 Kok HP Cressman ENK Ceelen W et al Heating technology for malignant tumors: a review Int J Hyperthermia 2020 37 711 741 32579419 10.1080/02656736.2020.1779357 PMC7781160 29 Wu T Lee A Suh R et al Salvage percutaneous high-dose-rate brachyablation after stereotactic body radiation therapy for early-stage non-small cell lung cancer J Contemp Brachytherapy 2024 16 150 155 38808204 10.5114/jcb.2024.139103 PMC11129647 30 Pellizzon AC Evidence and clinical outcomes of adult soft tissue sarcomas of the extremities treated with adjuvant high-dose-rate brachytherapy–a literature review J Contemp Brachytherapy 2014 6 318 322 25337137 10.5114/jcb.2014.45758 PMC4200188 31 Escobar-Sacristán JA Granda-Orive JI Gutiérrez Jiménez T et al Endobronchial brachytherapy in the treatment of malignant lung tumours Eur Respir J 2004 24 348 352 15358689 10.1183/09031936.04.00114902 ",
  "metadata": {
    "Title of this paper": "Endobronchial brachytherapy in the treatment of malignant lung tumours",
    "Journal it was published in:": "Journal of Contemporary Brachytherapy",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489535/"
  }
}