{
  "title": "Paper_572",
  "abstract": "pmc Nat Commun Nat Commun 2873 ncomms Nature Communications 2041-1723 Nature Publishing Group PMC12480548 PMC12480548.1 12480548 12480548 41022821 10.1038/s41467-025-63685-8 63685 1 Article Cytoplasmic TRIM24 promotes colorectal cancer cell proliferation by activating Wnt/β-catenin signaling Wang Ya 1 2 3 Yao Yuanbing 1 Liu Zehong 1 Long Shichao 1 Yi Feng 1 Fang Qing 4 Wu Dongbo 5 Zhu Qing 6 Zai Hongyan 6 http://orcid.org/0000-0003-0830-2188 Xiao Shuai xiaoshuai1982@hotmail.com 4 7 8 http://orcid.org/0000-0001-9216-9767 Wan Fengyi fwan1@jhu.edu 9 http://orcid.org/0000-0001-8571-5352 Fu Kai fu_kai@csu.edu.cn 1 3 10 11 1 https://ror.org/00f1zfq44 grid.216417.7 0000 0001 0379 7164 Institute of Molecular Precision Medicine and Hunan Key Laboratory of Molecular Precision Medicine, Department of General Surgery, Xiangya Hospital, Central South University, 2 https://ror.org/03mqfn238 grid.412017.1 0000 0001 0266 8918 The First Affiliated Hospital, Hunan Provincial Key Laboratory of Multi-omics and Artificial Intelligence of Cardiovascular Diseases, Hengyang Medical School, University of South China, 3 https://ror.org/00f1zfq44 grid.216417.7 0000 0001 0379 7164 MOE Key Lab of Rare Pediatric Diseases & Hunan Key Laboratory of Medical Genetics of the School of Life Sciences, Central South University, 4 https://ror.org/03mqfn238 grid.412017.1 0000 0001 0266 8918 The First Affiliated Hospital, Cancer Research Institute, Hengyang Medical School, University of South China, 5 https://ror.org/011ashp19 grid.13291.38 0000 0001 0807 1581 Center of Infectious Diseases, West China Hospital, Sichuan University, 6 https://ror.org/00f1zfq44 grid.216417.7 0000 0001 0379 7164 Department of General Surgery, Xiangya Hospital, Central South University, 7 https://ror.org/03mqfn238 grid.412017.1 0000 0001 0266 8918 Department of Gastrointestinal Surgery, The First Affiliated Hospital, Hengyang Medical School, University of South China, 8 https://ror.org/05szwcv45 grid.507049.f 0000 0004 1758 2393 National Health Commission Key Laboratory of Birth Defects for Research and Prevention, Hunan Provincial Maternal and Child Health Care Hospital, 9 https://ror.org/00za53h95 grid.21107.35 0000 0001 2171 9311 Department of Biochemistry and Molecular Biology, Bloomberg School of Public Health, Johns Hopkins University, 10 11 https://ror.org/00f1zfq44 grid.216417.7 0000 0001 0379 7164 Hunan Key Laboratory of Aging Biology, Xiangya Hospital, Central South University, 29 9 2025 2025 16 478256 8598 11 9 2024 27 8 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Aberrant activation of Wnt/β-catenin signaling is proposed as a major molecular mechanism underlying the occurrence and progression of colorectal cancer (CRC). However, the precise mechanisms controlling the accumulation of β-catenin protein in CRC cells remain incompletely understood. Here, we show that TRIM24 Aberrant activation of Wnt/β-catenin signaling contributes to colorectal cancer (CRC) pathogenesis. Here the authors find that the cytoplasmic distribution of TRIM24 E3 ubiquitin ligase triggers ubiquitination and degradation of von Hippel-Lindau, resulting in the accumulation of β-catenin protein in CRC cells. Subject terms Colon cancer Oncogenes https://doi.org/10.13039/501100011002 National Science Foundation of China | National Natural Science Foundation of China-Yunnan Joint Fund (NSFC-Yunnan Joint Fund) 32170726 32100580 Wang Ya Fu Kai https://doi.org/10.13039/501100004751 Chinese Ministry of Science and Technology | Department of S and T for Social Development (Department of S&T for Social Development) 2022YFE0133400 Fu Kai pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Colorectal cancer (CRC) is the third most common cancer and the fourth leading cause of cancer-related death worldwide, with both incidence and mortality expected to rise in the coming decades 1 2 3 The Wnt/β-catenin signaling pathway, crucial for regulating development, proliferation, stemness, cell-cell adhesion, and epithelial-mesenchymal transition, is among the most frequently altered signaling pathways in clinical CRC specimens 4 5 6 7 8 9 APC 10 11 APC 12 13 Tripartite motif containing 24 (TRIM24), also known as transcription intermediary factor 1-alpha (TIF1α), is an important member of the transcription intermediary factor family 14 15 17 18 19 21 Here we report that TRIM24 Results TRIM24 is critical for the proliferation of CRC cells To evaluate the role of TRIM24 in CRC, we first assessed the expression levels and prognostic value of TRIM24 TRIM24 1A 1C TRIM24 TRIM24 1B 1D S1 1 1E 1E 1F S2A–C 1G S3A–E 22 1H 1I, J 1K S4B 1L Fig. 1 TRIM24 is highly expressed in CRC tissues and plays a critical role in the proliferation of CRC cells. A TRIM24 n n t BEST B C n n t https://proteomics.cancer.gov/programs/cptac A C D n t E F G H n t I n t J I K I n n t L n t TRIM24 determines the activation of the Wnt/β-catenin signaling pathway in CRC cells To explore the TRIM24-mediated signaling pathway involved in regulating CRC cell proliferation, we divided the TCGA-COAD dataset into two groups based on the median TRIM24 https://rookieutopia.hiplot.com.cn/app_direct/BEST/ 2A 2A, B S5 1G S3B–E 23 24 25 26 2C 2D 2E c-MYC S6A 2A S5 2E S6A, B S6C S6D Fig. 2 High expression of TRIM24 correlates with activation of Wnt/β-catenin signaling pathway in colorectal cancer. A https://rookieutopia.hiplot.com.cn/app_direct/BEST/ B C t n D MYC CD44 CDC25A EFNB2 HNF1A ACTB t n E TRIM24 interacts with VHL and promotes its ubiquitination TRIM24 primarily serves as a transcriptional regulator and E3 ubiquitin ligase 27 28 30 3A 3B 3C 3D S7 31 3E 3E 3F 1D 3G, H 3G, I Fig. 3 TRIM24 interacts with and ubiquitinates VHL. A B t C D E F G H I H I n 2 p Phosphorylation of serine 1042 is critical for cytoplasmic localization of TRIM24 VHL predominantly localizes in the cytoplasm and/or the cell membrane (Supplementary Fig. S8 32 33 21 34 4A 2 35 4B 4E 36 4C 37 4D 4B, E, F S9A, B 4G 4H 4I 4J Fig. 4 Phosphorylation of S1042 determines the cytoplasmic distribution of TRIM24. A n https://www.proteinatlas.org/ B C O15164 D E B F E G H I t J S1042 phosphorylation of TRIM24 by AURKB kinase is critical for the activation of Wnt/β-catenin signaling Protein phosphorylation, catalysed by kinases, serves as a crucial cellular regulatory mechanism to activate or deactivate numerous signaling proteins 38 5A 5B 5C 5D 5E S10 5F 5G Fig. 5 TRIM24 is phosphorylated by AURKB at S1042 in CRC cells. A B C D E F G t n AURKB inhibition retards development of CRC in mouse models AURKB inhibitors have emerged as a promising alternative for cancer treatment 39 40 6A, B 4G, H S11A, B 6A, B 4G, H S11A, B S11C–F 6C–E 6C, D S12A–C 6E S13 6F 6G Fig. 6 AURKB inhibition retards the proliferation of CRC cells. A B A C n t D E D n F G D F G Discussion Despite the hyperactivation of Wnt/β-catenin signaling being considered the initiating and driving event of CRC 41 42 TRIM24 16 17 43 TRIM24 1A, C, D TRIM24 1B 44 TRIM24 2A, B 2C–E 1F–L S2A–C 44 S14A, B TRIM24 is a multifunctional protein that acts as a co-regulator of nuclear receptors and a histone reader, typically localized in the nucleus. In addition to the aforementioned functions, TRIM24 could act as an E3 ubiquitin ligase, particularly with the characteristic RING domain 27 21 45 3C, D S7 3A, B 30 46 47 3G–I 4I To elucidate the causal relationship between TRIM24 and Wnt/β-catenin signaling in CRC cells, a series of mechanistic experiments were performed. First, overexpression of a constitutively active AKT mutant (AKT S473D S473D S15A–C S16A–C S17A, B S18 S19A–D S20 It has been reported that VHL is primarily distributed in the cytoplasm and/or the cell membrane 32 33 21 34 4A 21 20 16 48 48 49 4B 4C 50 51 4J 37 4E, F S21 21 5D 5B, C S22B 5F, G 6A–D S12A–C In summary, our study demonstrates that TRIM24 is a pivotal protein that controls the VHL-AKT-GSK3β axis-mediated β-catenin degradation, which activates Wnt/β-catenin signaling and promotes the proliferation of CRC cells. These findings provide insights into the pathogenic mechanisms of CRC and a potential therapeutic strategy for CRC treatment, particularly for the patients with cytoplasmic TRIM24 distribution in the tumor cells. Methods Ethics statement All procedures involving human participants were conducted in compliance with the ethical standards set by the institutional and national research committees, in alignment with the 1964 Helsinki Declaration and its subsequent amendments. The project was approved by the institutional ethics committee of the First Affiliated Hospital of the University of South China (approval No: 2023LL0810002). Informed consent was obtained from all participants involved in the research. The Animal Ethics Committee of the University of South China approved all animal experiments (approval No: USC2024XS247). Tumor burden was strictly monitored and did not exceed the maximum permitted size (1.5 cm in diameter or 2000 mm³ in volume for mice) as per institutional guidelines. All participants gave informed consent to be included in the study. We fully adhere to SAGER guidelines and our study design was not related to gender. Database and bioinformatics analysis The TCGA CRC dataset was used in this study, which containing 632 CRC samples. The bioinformatics analysis was performed using BEST. The Kaplan–Meier curves of disease-free survival (DFS) was performed with log-rank test by a cutoff “median”. The Hallmark gene set enrichment analysis (GSEA) was obtained from Molecular Signatures Database (MSigDB). Cell culture, reagents, and antibodies All cell lines were purchased from the Cell Bank of the Chinese Academy of Sciences (China) and BDbio (China). TRIM24 KO DLD1 cells and TRIM24 KO SW620 cells were obtained through the CRISPR-Cas9 system. FHC, DLD1, SW620, HCT116, RKO, SW480, HT29, LS174T, SW1643, LOVO, and HEK293T cells were cultured in DMEM medium containing 10% fetal calf serum, 100 U/mL penicillin and streptomycin. In addition to the above conditions, FHC also requires extra 10 mM HEPES (for a final conc. of 25 mM); 10 ng/mL cholera toxin; 0.005 mg/mL insulin; 0.005 mg/mL transferrin; 100 ng/mL hydrocortisone; 20 ng/mL human recombinant EGF. Hesperadin and cycloheximide were purchased from MCE (USA). MG132 and AKT Inhibitor VIII were purchased from Beyotime (China). Alkaline phosphatase was purchased from Thermo Fisher (USA). 3-(4,5)-dimethylthiahiazo (-z-y1)-3,5-di- phenytetrazoliumromide (MTT) was purchased from Coolaber (China). Barasertib and CX-4945 were purchased from TOPSCIENCE (China). Recombinant human AURKB, recombinant human AKT1 protein and crystal violet were purchased from Solarbio (China). Antibodies used were as follows: TRIM24 (14208-1-AP, Proteintech, China), TRIM24 ( R27382 R22961 R23412 ABM40124 R26636 RNA interference and transfection Human siRNA was designed and synthesized by GenePharma (China). We performed liposome-mediated transfection for knockdown using Lipofectamine™ 2000 (Life Technologies, USA) according to the instructions. The specific siRNA sequence are as follows: TRIM24-1 siRNA (sense sequence: 5′-GAGCUCAUCAGAGGGUAAATT-3′, antisense sequence: 5′-UUUACCCUCUGAUGAGCUCTT-3′), TRIM24-2 siRNA (sense sequence: 5′-GCCACCAAGUGGUUUAUCATT-3′, antisense sequence: 5′-UGAUAAACCACUUGGUGGCTT-3′), AKT1 siRNA (sense sequence: 5′-AGGAAGUCAUCGUGGCCAATT-3′, antisense sequence: 5′-UUGGCCACGAUGACUUCCUTT-3′), AKT2 siRNA (sense sequence: 5′-GCUCUUGAGUACUUGCACUTT-3′, antisense sequence: 5′-AGUGCAAGUACUCAAGAGCTT-3′), AKT3 siRNA (sense sequence: 5′-GCCUUGGACUAUCUACAUUTT-3′, antisense sequence: 5′-AAUGUAGAUAGUCCAAGGCTT-3′), AURKA siRNA (sense sequence: 5′-GCAAUUUCCUUGUCAGAAUTT-3′, antisense sequence: 5′-AUUCUGACAAGGAAAUUGCTT-3′), AURKB siRNA (sense sequence: 5′-GCAUUGGAGUGCUUUGCUATT-3′, antisense sequence: 5′-UAGCAAAGCACUCCAAUGCTT-3′), CK2α siRNA (sense sequence: 5′-CCUCUCCUUGAUGCAGCUUTT-3′, antisense sequence: 5′-AAGCUGCAUCAAGGAGAGGTT-3′), VHL siRNA (sense sequence: 5′-GAGGUCACCUUUGGCUCUUTT-3′, antisense sequence: 5′-AAGAGCCAAAGGUGACCUCTT-3′). Three-dimensional organoid culture The CRC tissue was collected from a CRC patient at the First Affiliated Hospital, University of South China. The human tissue-related experiments were approved by the Medical Ethics Committee of the First Affiliated Hospital, University of South China, and the informed consent was obtained from the patient. The CRC tissue was removed from the resected colon segment and stored in ice-cold RPMI 1640 with 1% Penicillin-Streptomycin. The tissue was washed in ice-cold PBS supplemented with 1% Penicillin-Streptomycin, then cut into 1–3 mm 3 g g g 2 Plasmids TRIM24 DNA was purchased from Addgene (Plasmid #28138, USA). Point and deletion mutants of TRIM24 were generated by subcloning PCR products. VHL DNA was purchased from Addgene (Plasmid #20790). YAP/TAZ luciferase reporter was purchased from Addgene (Plasmid #34615). TOPFlash/FOPFlash assay TOPFlash and FOPFlash constructs are commonly used to evaluate β-catenin-dependent transcriptional activity 26 Cell viability assay and colony formation assay Cell viability assay is a method to detect cell survival and growth, and the final concentration of MTT is usually 5 mg/mL. The target cells were treated according to the experimental requirements and inoculated into 96-well plates. After a certain time, add 10% MTT solution to each well and incubate in the incubator for 4 h. Then an equal amount of triple solution (10 mM HCl, 10% SDS, and 5% isobutanol) was added to each well and incubated for 4–6 h. After all the crystals were dissolved, the absorbance was measured at 570 nm. Clonal formation assay is an effective method to determine the proliferative ability of individual cells. Cells of logarithmic growth stage were inoculated in a culture dish with appropriate cell density and cultured in a cell incubator for 1–2 weeks. When visible clones appear, the culture is terminated. Clean with 1 × PBS and fix with 4% paraformaldehyde (Biosharp, China) for 15 min. Add an appropriate amount of 0.01% crystal violet solution for 10–20 min, then slowly wash away the dyeing solution with running water, and air dry. The plate was inverted and photographed for statistics. Flow cytometric analysis of cell cycle The cells were digested with trypsin and the cell suspension was collected into the centrifuge tube. After washing the cells with pre-cooled PBS twice, about 50 μL of PBS was left in the suspended cells. The cells were added to 1 mL of pre-cooled 70% ethanol and fixed at 4 °C for 2 h or overnight. The cells to be tested were added with 500 μL prepared PI staining solution (20 μg/mL) (Yeasen Biotechnology, China) and incubated at room temperature for 30 min away from light. Cell cycle analysis was performed by flow cytometry. Flow cytometry data were acquired using a BD FACSCANTO II and analyzed with FlowJo software. Cell cycle distribution was evaluated using MODFIT. Cells were first gated on forward scatter (FSC) vs. side scatter (SSC) to define the main population (P1), followed by doublet exclusion using FSC-A vs. FSC-H (P2). A total of 10,000 events were collected per sample. The final gated population (P2) was analyzed for cell cycle distribution using propidium iodide (PI) staining and MODFIT software. Flow cytometric analysis of CD44 in CRC cells The cells were digested with trypsin and collected (1 × 10 6 Real-time quantitative PCR (RT-qPCR) First, prepare the RNA sample to be detected, including the extraction of target RNA molecules (Trizol method), purification, and quantification. cDNA was synthesized by reverse transcription using cDNA synthesis kit (Novoprotein, China). Using cDNA as template, qPCR kit (Yeasen Biotechnology) was used for PCR amplification. Real-time PCR instrument can monitor the change of fluorescence intensity in the process of PCR reaction in real time, and carry out quantitative analysis of DNA content according to the change curve of light signal. ACTB 3 Immunoprecipitation and immunoblot Immunoprecipitation was performed using a Beads Protein A/G immunoprecipitation Kit (Beaver, China) according to the manufacturer’s instructions. Briefly, certain antibodies were applied to 30 µl of protein A/G magnetic beads in PBS containing 0.1% BSA, and rotated for 2 h at 4 °C. Then, magnetic beads were washed twice with PBS. Cells were collected and lysed on ice in 0.4 mL of lysis buffer (50 mM Tris-HCl [pH 8.0], 150 mM NaCl, 1% NP-40, and 0.5% sodium deoxycholate, supplemented with a complete mini protease inhibitor cocktail [Roche, USA]) for 30 min. After centrifugation at 13,000 × g GST pull-down assays GST or GST-fused proteins were bacterially expressed. The bacterial lysate was applied to GST purification magbeads (Absin, China), and incubated for 1 h at 4 °C. After washing twice with PBS, His-labelled recombinant proteins were added and incubated for 2 h at 4 °C. The magbeads were washed four times with HNTG buffer (HEPES [pH7.4], NaCl 150 mM, glycerol 10%, Triton ×-100 0.1%, supplemented with a complete mini protease inhibitor cocktail [Roche]), and subjected to immunoblotted. Subcellular fractionation assay The subcellular fractionation assay was performed as previously described 52 6 2 g 2 g In vitro kinase assays The GST-TRIM24 and GST-TRIM24-S1042A recombinant proteins were induced and purified as previously described. In a kinase buffer (50 mM Hepes [pH 7.5], 150 mm NaCl, 4 mM MnCl 2 2 Mouse tumor xenografts and treatments Male BALB/c nude mice (6–8 weeks old) were obtained from Shanghai SLAC Laboratory Animal Co., Ltd. (Shanghai, China) and maintained under specific pathogen-free (SPF) conditions with a 12-h light/dark cycle, ambient temperature of ~22 °C, and relative humidity of 50 ± 5%. For xenograft studies, mice were randomly divided into two groups and subcutaneously injected with 1 × 10⁶ DLD1 or SW1643 cells suspended in 0.1 mL PBS. When tumors became palpable (typically by day 6 or 7), each group was further divided into two subgroups and treated with either hesperadin (2.5 mg/kg), barasertib (2 mg/kg or 10 mg/kg), or PBS (vehicle control) via intraperitoneal injection every 2 days. Tumor size was measured approximately every 3 days using calipers, and tumor volume was calculated using the formula: 0.52 × length × width². In a separate experiment, 1 × 10⁶ DLD1-WT or DLD1-KO-1 cells were subcutaneously injected into male BALB/c nude mice (6–8 weeks old). Tumor growth was monitored every 3 days starting around day 7 post-injection. The experiment was terminated when tumor volume exceeded approximately 300 mm³. At the endpoint, all mice were euthanized, and the subcutaneous tumors were excised, photographed, and fixed in 4% paraformaldehyde for subsequent immunohistochemical analysis. Immunocytochemistry Paraffin-embedded samples were cut into 5 μm thick sections. The sections were completely immersed in citric acid antigen retrieval solution (pH = 6.0, Servicebio) and heated to boiling for 15–20 min for antigen retrieval. Endogenous tissue peroxidase was blocked by treatment with 3% hydrogen peroxide for 15–20 min. After 5% BSA blocking, the sections were incubated with PCNA antibody at 4 °C overnight. Immunodetection was performed the next day using DAB staining. Immunofluorescence microscopy Immunofluorescence microscopy was performed as previously described 53 In vitro ubiqutination assay HEK293T cells were transiently transfected with GFP-TRIM24 or TRIM24 mutant (GFP-△Ring) for 36 h and cell lysates were immunoprecipitated using an anti-GFP antibody. The immunoprecipitants were washed twice with lysis buffer and twice with ubiquitylation buffer (25 mM Tris-HCl [pH 7.6], 5 mM MgCl 2 Label-free relative quantitative mass spectrum analysis This analysis was conducted at Institutional Center for Shared Technologies and Facilities of SIMM, Chinese Academy of Sciences. In brief, immunoprecipitation experiments were carried out to enrich TRIM24 following the lysis of DLD1 cells. The sample was added to 100 µL of 100 mM NH 4 3 g g TUNEL TUNEL in situ on tumor tissue sections was performed using the TUNEL BrightGreen Apoptosis Detection Kit (Vazyme, China) following the manufacturer’s instructions. Statistical analysis All statistical analysis was performed using GraphPad Prism version 8.0. The differences between treated and control groups were examined by unpaired Student’s t Reporting summary Further information on research design is available in the Nature Portfolio Reporting Summary Supplementary information  Supplementary Information Reporting Summary Transparent Peer Review file Source data  Source Data Publisher’s note These authors contributed equally: Ya Wang, Yuanbing Yao. Supplementary information The online version contains supplementary material available at 10.1038/s41467-025-63685-8. Acknowledgements We are grateful to the Cancer Genome Atlas Program for the database. We thank the online bioinformatics analysis site BEST, by which Figs. 1A, B 2A, B S5 Author contributions K.F., FW., and S.X. performed study concept and design; Y.W., Y.Y., Z.L., S.L., F.Y., Q.F., D.W., Q.Z., and H.Z. performed experiments and analysed the data; DW provided technical and material support; K.F. and Y.W. provided funding acquisition; K.F., Y.W., and Y.Y. wrote, reviewed, and revised the paper; Y.W. and Y.Y. provided acquisition, analysis and interpretation of data, and statistical analysis. All authors read and approved the final paper. Peer review Peer review information Nature Communications Data availability The kinases potentially responsible for TRIM24 Ser1042 phosphorylation were predicted using online tools including KinasePhos 2.0, GPS 3.0, and iGPS 1.0. The specific website URL is as follows: http://kinasephos2.mbc.nctu.edu.tw/ http://hprd.org/PhosphoMotif_finder http://gps.biocuckoo.cn/ http://igps.biocuckoo.org/index.php https://portal.gdc.cancer.gov/ BEST https://proteomics.cancer.gov/programs/cptac 54 55 https://www.proteinatlas.org/ https://proteomecentral.proteomexchange.org Source data Competing interests The authors declare no competing interests. References 1. Hossain MS Colorectal cancer: a review of carcinogenesis, global epidemiology, current challenges, risk factors, preventive and treatment strategies Cancers 2022 14 1732 10.3390/cancers14071732 35406504 PMC8996939 Hossain, M. S. et al. Colorectal cancer: a review of carcinogenesis, global epidemiology, current challenges, risk factors, preventive and treatment strategies. Cancers 14 35406504 10.3390/cancers14071732 PMC8996939 2. Bray F Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J. Clin. 2024 74 229 263 38572751 10.3322/caac.21834 Bray, F. et al. Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. CA Cancer J. Clin. 74 38572751 10.3322/caac.21834 3. Tsikitis VL Larson DW Huebner M Lohse CM Thompson PA Predictors of recurrence free survival for patients with stage II and III colon cancer BMC Cancer 2014 14 336 10.1186/1471-2407-14-336 24886281 PMC4029910 Tsikitis, V. L., Larson, D. W., Huebner, M., Lohse, C. M. & Thompson, P. A. Predictors of recurrence free survival for patients with stage II and III colon cancer. BMC Cancer 14 24886281 10.1186/1471-2407-14-336 PMC4029910 4. Zhao H Wnt signaling in colorectal cancer: pathogenic role and therapeutic target Mol. cancer 2022 21 144 10.1186/s12943-022-01616-7 35836256 PMC9281132 Zhao, H. et al. Wnt signaling in colorectal cancer: pathogenic role and therapeutic target. Mol. cancer 21 35836256 10.1186/s12943-022-01616-7 PMC9281132 5. Albrecht LV Tejeda-Muñoz N De Robertis EM Cell biology of canonical Wnt signaling Annu. Rev. Cell Dev. Biol. 2021 37 369 389 10.1146/annurev-cellbio-120319-023657 34196570 Albrecht, L. V., Tejeda-Muñoz, N. & De Robertis, E. M. Cell biology of canonical Wnt signaling. Annu. Rev. Cell Dev. Biol. 37 34196570 10.1146/annurev-cellbio-120319-023657 6. Liu J Wnt/β-catenin signalling: function, biological mechanisms, and therapeutic opportunities Signal Transduct. Target. Ther. 2022 7 3 10.1038/s41392-021-00762-6 34980884 PMC8724284 Liu, J. et al. Wnt/β-catenin signalling: function, biological mechanisms, and therapeutic opportunities. Signal Transduct. Target. Ther. 7 34980884 10.1038/s41392-021-00762-6 PMC8724284 7. Prossomariti A Piazzi G Alquati C Ricciardiello L Are Wnt/β-catenin and PI3K/AKT/mTORC1 distinct pathways in colorectal cancer? Cell. Mol. Gastroenterol. Hepatol. 2020 10 491 506 10.1016/j.jcmgh.2020.04.007 32334125 PMC7369353 Prossomariti, A., Piazzi, G., Alquati, C. & Ricciardiello, L. Are Wnt/β-catenin and PI3K/AKT/mTORC1 distinct pathways in colorectal cancer?. Cell. Mol. Gastroenterol. Hepatol. 10 32334125 10.1016/j.jcmgh.2020.04.007 PMC7369353 8. Daisy Precilla S Biswas I Kuduvalli SS Anitha TS Crosstalk between PI3K/AKT/mTOR and WNT/β-Catenin signaling in GBM - Could combination therapy checkmate the collusion? Cell. Signal. 2022 95 110350 10.1016/j.cellsig.2022.110350 35525406 Daisy Precilla, S., Biswas, I., Kuduvalli, S. S. & Anitha, T. S. Crosstalk between PI3K/AKT/mTOR and WNT/β-Catenin signaling in GBM - Could combination therapy checkmate the collusion?. Cell. Signal. 95 35525406 10.1016/j.cellsig.2022.110350 9. Nagini S Sophia J Mishra R Glycogen synthase kinases: moonlighting proteins with theranostic potential in cancer Semin. Cancer Biol. 2019 56 25 36 10.1016/j.semcancer.2017.12.010 29309927 Nagini, S., Sophia, J. & Mishra, R. Glycogen synthase kinases: moonlighting proteins with theranostic potential in cancer. Semin. Cancer Biol. 56 29309927 10.1016/j.semcancer.2017.12.010 10. Rowan AJ APC mutations in sporadic colorectal tumors: a mutational “hotspot” and interdependence of the “two hits Proc. Natl. Acad. Sci. USA 2000 97 3352 3357 10.1073/pnas.97.7.3352 10737795 PMC16243 Rowan, A. J. et al. APC mutations in sporadic colorectal tumors: a mutational “hotspot” and interdependence of the “two hits”. Proc. Natl. Acad. Sci. USA 97 10737795 10.1073/pnas.97.7.3352 PMC16243 11. Aghabozorgi AS Role of adenomatous polyposis coli (APC) gene mutations in the pathogenesis of colorectal cancer; current status and perspectives Biochimie 2019 157 64 71 10.1016/j.biochi.2018.11.003 30414835 Aghabozorgi, A. S. et al. Role of adenomatous polyposis coli (APC) gene mutations in the pathogenesis of colorectal cancer; current status and perspectives. Biochimie 157 30414835 10.1016/j.biochi.2018.11.003 12. Bala P Kavadipula P Sarkar S Bashyam MD To β or not to β: lack of correlation between APC mutation and β-catenin nuclear localization in colorectal cancer J. Gastrointest. Cancer 2023 54 1181 1184 10.1007/s12029-022-00886-0 36586069 Bala, P., Kavadipula, P., Sarkar, S. & Bashyam, M. D. To β or not to β: lack of correlation between APC mutation and β-catenin nuclear localization in colorectal cancer. J. Gastrointest. Cancer 54 36586069 10.1007/s12029-022-00886-0 13. Blundon MA Proteomic analysis reveals APC-dependent post-translational modifications and identifies a novel regulator of β-catenin Development 2016 143 2629 2640 27287809 10.1242/dev.130567 PMC4958330 Blundon, M. A. et al. Proteomic analysis reveals APC-dependent post-translational modifications and identifies a novel regulator of β-catenin. Development 143 27287809 10.1242/dev.130567 PMC4958330 14. McAvera RM Crawford LJ TIF1 proteins in genome stability and cancer Cancers 2020 12 2094 10.3390/cancers12082094 32731534 PMC7463590 McAvera, R. M. & Crawford, L. J. TIF1 proteins in genome stability and cancer. Cancers 12 32731534 10.3390/cancers12082094 PMC7463590 15. Khetchoumian K Loss of Trim24 (Tif1alpha) gene function confers oncogenic activity to retinoic acid receptor alpha Nat. Genet. 2007 39 1500 1506 10.1038/ng.2007.15 18026104 Khetchoumian, K. et al. Loss of Trim24 (Tif1alpha) gene function confers oncogenic activity to retinoic acid receptor alpha. Nat. Genet. 39 18026104 10.1038/ng.2007.15 16. Tsai WW TRIM24 links a non-canonical histone signature to breast cancer Nature 2010 468 927 932 10.1038/nature09542 21164480 PMC3058826 Tsai, W. W. et al. TRIM24 links a non-canonical histone signature to breast cancer. Nature 468 21164480 10.1038/nature09542 PMC3058826 17. Groner AC TRIM24 is an oncogenic transcriptional activator in prostate cancer Cancer Cell. 2016 29 846 858 10.1016/j.ccell.2016.04.012 27238081 PMC5124371 Groner, A. C. et al. TRIM24 is an oncogenic transcriptional activator in prostate cancer. Cancer Cell. 29 27238081 10.1016/j.ccell.2016.04.012 PMC5124371 18. Reymond A The tripartite motif family identifies cell compartments EMBO J. 2001 20 2140 2151 10.1093/emboj/20.9.2140 11331580 PMC125245 Reymond, A. et al. The tripartite motif family identifies cell compartments. EMBO J. 20 11331580 10.1093/emboj/20.9.2140 PMC125245 19. Jain AK Allton K Duncan AD Barton MC TRIM24 is a p53-induced E3-ubiquitin ligase that undergoes ATM-mediated phosphorylation and autodegradation during DNA damage Mol. Cell. Biol. 2014 34 2695 2709 10.1128/MCB.01705-12 24820418 PMC4097665 Jain, A. K., Allton, K., Duncan, A. D. & Barton, M. C. TRIM24 is a p53-induced E3-ubiquitin ligase that undergoes ATM-mediated phosphorylation and autodegradation during DNA damage. Mol. Cell. Biol. 34 24820418 10.1128/MCB.01705-12 PMC4097665 20. Zhu Q TRIM24 facilitates antiviral immunity through mediating K63-linked TRAF3 ubiquitination J. Exp. Med. 2020 217 e20192083 10.1084/jem.20192083 32324863 PMC7336305 Zhu, Q. et al. TRIM24 facilitates antiviral immunity through mediating K63-linked TRAF3 ubiquitination. J. Exp. Med. 217 32324863 10.1084/jem.20192083 PMC7336305 21. Wei W TRIM24 is an insulin-responsive regulator of P-bodies Nat. Commun. 2022 13 3972 10.1038/s41467-022-31735-0 35803934 PMC9270398 Wei, W. et al. TRIM24 is an insulin-responsive regulator of P-bodies. Nat. Commun. 13 35803934 10.1038/s41467-022-31735-0 PMC9270398 22. Xu H Niu M Yuan X Wu K Liu A CD44 as a tumor biomarker and therapeutic target Exp. Hematol. Oncol. 2020 9 36 10.1186/s40164-020-00192-0 33303029 PMC7727191 Xu, H., Niu, M., Yuan, X., Wu, K. & Liu, A. CD44 as a tumor biomarker and therapeutic target. Exp. Hematol. Oncol. 9 33303029 10.1186/s40164-020-00192-0 PMC7727191 23. Dutta-Simmons J Aurora kinase A is a target of Wnt/beta-catenin involved in multiple myeloma disease progression Blood 2009 114 2699 2708 10.1182/blood-2008-12-194290 19652203 Dutta-Simmons, J. et al. Aurora kinase A is a target of Wnt/beta-catenin involved in multiple myeloma disease progression. Blood 114 19652203 10.1182/blood-2008-12-194290 24. Leow PC Tian Q Ong ZY Yang Z Ee PL Antitumor activity of natural compounds, curcumin and PKF118-310, as Wnt/β-catenin antagonists against human osteosarcoma cells Invest. New Drugs 2010 28 766 782 10.1007/s10637-009-9311-z 19730790 Leow, P. C., Tian, Q., Ong, Z. Y., Yang, Z. & Ee, P. L. Antitumor activity of natural compounds, curcumin and PKF118-310, as Wnt/β-catenin antagonists against human osteosarcoma cells. Invest. New Drugs 28 19730790 10.1007/s10637-009-9311-z 25. Sarkar S Mandal C Sangwan R Mandal C Coupling G2/M arrest to the Wnt/β-catenin pathway restrains pancreatic adenocarcinoma Endocr. -Relat. Cancer 2014 21 113 125 10.1530/ERC-13-0315 24402132 Sarkar, S., Mandal, C., Sangwan, R. & Mandal, C. Coupling G2/M arrest to the Wnt/β-catenin pathway restrains pancreatic adenocarcinoma. Endocr. -Relat. Cancer 21 24402132 10.1530/ERC-13-0315 26. Ishitani T The TAK1-NLK-MAPK-related pathway antagonizes signalling between beta-catenin and transcription factor TCF Nature 1999 399 798 802 10.1038/21674 10391247 Ishitani, T. et al. The TAK1-NLK-MAPK-related pathway antagonizes signalling between beta-catenin and transcription factor TCF. Nature 399 10391247 10.1038/21674 27. Yao Y Zhou S Yan Y Fu K Xiao S The tripartite motif-containing 24 is a multifunctional player in human cancer Cell Biosci. 2024 14 103 10.1186/s13578-024-01289-3 39160596 PMC11334367 Yao, Y., Zhou, S., Yan, Y., Fu, K. & Xiao, S. The tripartite motif-containing 24 is a multifunctional player in human cancer. Cell Biosci. 14 39160596 10.1186/s13578-024-01289-3 PMC11334367 28. Gao T Furnari F Newton AC PHLPP: a phosphatase that directly dephosphorylates Akt, promotes apoptosis, and suppresses tumor growth Mol. Cell. 2005 18 13 24 10.1016/j.molcel.2005.03.008 15808505 Gao, T., Furnari, F. & Newton, A. C. PHLPP: a phosphatase that directly dephosphorylates Akt, promotes apoptosis, and suppresses tumor growth. Mol. Cell. 18 15808505 10.1016/j.molcel.2005.03.008 29. Brognard J Sierecki E Gao T Newton AC PHLPP and a second isoform, PHLPP2, differentially attenuate the amplitude of Akt signaling by regulating distinct Akt isoforms Mol. Cell. 2007 25 917 931 10.1016/j.molcel.2007.02.017 17386267 Brognard, J., Sierecki, E., Gao, T. & Newton, A. C. PHLPP and a second isoform, PHLPP2, differentially attenuate the amplitude of Akt signaling by regulating distinct Akt isoforms. Mol. Cell. 25 17386267 10.1016/j.molcel.2007.02.017 30. Guo J pVHL suppresses kinase activity of Akt in a proline-hydroxylation-dependent manner Science 2016 353 929 932 10.1126/science.aad5755 27563096 PMC5326551 Guo, J. et al. pVHL suppresses kinase activity of Akt in a proline-hydroxylation-dependent manner. Science 353 27563096 10.1126/science.aad5755 PMC5326551 31. McClellan AJ Scott MD Frydman J Folding and quality control of the VHL tumor suppressor proceed through distinct chaperone pathways Cell 2005 121 739 748 10.1016/j.cell.2005.03.024 15935760 McClellan, A. J., Scott, M. D. & Frydman, J. Folding and quality control of the VHL tumor suppressor proceed through distinct chaperone pathways. Cell 121 15935760 10.1016/j.cell.2005.03.024 32. Lee S Nuclear/cytoplasmic localization of the von Hippel-Lindau tumor suppressor gene product is determined by cell density Proc. Natl. Acad. Sci. USA 1996 93 1770 1775 10.1073/pnas.93.5.1770 8700833 PMC39856 Lee, S. et al. Nuclear/cytoplasmic localization of the von Hippel-Lindau tumor suppressor gene product is determined by cell density. Proc. Natl. Acad. Sci. USA 93 8700833 10.1073/pnas.93.5.1770 PMC39856 33. Iliopoulos O Kibel A Gray S Kaelin WG Jr. Tumour suppression by the human von Hippel-Lindau gene product Nat. Med. 1995 1 822 826 10.1038/nm0895-822 7585187 Iliopoulos, O., Kibel, A., Gray, S. & Kaelin, W. G. Jr. Tumour suppression by the human von Hippel-Lindau gene product. Nat. Med. 1 7585187 10.1038/nm0895-822 34. Wang Y TRIM24 is critical for the cellular response to DNA double-strand breaks through regulating the recruitment of MRN complex Oncogene 2023 42 586 600 10.1038/s41388-022-02580-8 36550358 Wang, Y. et al. TRIM24 is critical for the cellular response to DNA double-strand breaks through regulating the recruitment of MRN complex. Oncogene 42 36550358 10.1038/s41388-022-02580-8 35. Kosugi S Hasebe M Tomita M Yanagawa H Systematic identification of cell cycle-dependent yeast nucleocytoplasmic shuttling proteins by prediction of composite motifs Proc. Natl. Acad. Sci. USA 2009 106 10171 10176 10.1073/pnas.0900604106 19520826 PMC2695404 Kosugi, S., Hasebe, M., Tomita, M. & Yanagawa, H. Systematic identification of cell cycle-dependent yeast nucleocytoplasmic shuttling proteins by prediction of composite motifs. Proc. Natl. Acad. Sci. USA 106 19520826 10.1073/pnas.0900604106 PMC2695404 36. Varadi M AlphaFold protein structure database in 2024: providing structure coverage for over 214 million protein sequences Nucleic Acids Res. 2024 52 D368 d375 10.1093/nar/gkad1011 37933859 PMC10767828 Varadi, M. et al. AlphaFold protein structure database in 2024: providing structure coverage for over 214 million protein sequences. Nucleic Acids Res. 52 37933859 10.1093/nar/gkad1011 PMC10767828 37. Andrew CD Warwicker J Jones GR Doig AJ Effect of phosphorylation on alpha-helix stability as a function of position Biochemistry 2002 41 1897 1905 10.1021/bi0113216 11827536 Andrew, C. D., Warwicker, J., Jones, G. R. & Doig, A. J. Effect of phosphorylation on alpha-helix stability as a function of position. Biochemistry 41 11827536 10.1021/bi0113216 38. Ardito F Giuliani M Perrone D Troiano G Lo Muzio L The crucial role of protein phosphorylation in cell signaling and its use as targeted therapy (Review) Int. J. Mol. Med. 2017 40 271 280 10.3892/ijmm.2017.3036 28656226 PMC5500920 Ardito, F., Giuliani, M., Perrone, D., Troiano, G. & Lo Muzio, L. The crucial role of protein phosphorylation in cell signaling and its use as targeted therapy (Review). Int. J. Mol. Med. 40 28656226 10.3892/ijmm.2017.3036 PMC5500920 39. Tanaka K Targeting Aurora B kinase prevents and overcomes resistance to EGFR inhibitors in lung cancer by enhancing BIM- and PUMA-mediated apoptosis Cancer Cell. 2021 39 1245 1261.e1246 10.1016/j.ccell.2021.07.006 34388376 PMC8440494 Tanaka, K. et al. Targeting Aurora B kinase prevents and overcomes resistance to EGFR inhibitors in lung cancer by enhancing BIM- and PUMA-mediated apoptosis. Cancer Cell. 39 34388376 10.1016/j.ccell.2021.07.006 PMC8440494 40. Zhang Y Hesperadin suppresses pancreatic cancer through ATF4/GADD45A axis at nanomolar concentrations Oncogene 2022 41 3394 3408 10.1038/s41388-022-02328-4 35551503 Zhang, Y. et al. Hesperadin suppresses pancreatic cancer through ATF4/GADD45A axis at nanomolar concentrations. Oncogene 41 35551503 10.1038/s41388-022-02328-4 41. Disoma C Zhou Y Li S Peng J Xia Z Wnt/β-catenin signaling in colorectal cancer: is therapeutic targeting even possible? Biochimie 2022 195 39 53 10.1016/j.biochi.2022.01.009 35066101 Disoma, C., Zhou, Y., Li, S., Peng, J. & Xia, Z. Wnt/β-catenin signaling in colorectal cancer: is therapeutic targeting even possible?. Biochimie 195 35066101 10.1016/j.biochi.2022.01.009 42. Schatoff EM Leach BI Dow LE Wnt signaling and colorectal cancer Curr. Colorectal Cancer Rep. 2017 13 101 110 28413363 10.1007/s11888-017-0354-9 PMC5391049 Schatoff, E. M., Leach, B. I. & Dow, L. E. Wnt signaling and colorectal cancer. Curr. Colorectal Cancer Rep. 13 28413363 10.1007/s11888-017-0354-9 PMC5391049 43. Zhang LH TRIM24 promotes glioma progression and enhances chemoresistance through activation of the PI3K/Akt signaling pathway Oncogene 2015 34 600 610 10.1038/onc.2013.593 24469053 Zhang, L. H. et al. TRIM24 promotes glioma progression and enhances chemoresistance through activation of the PI3K/Akt signaling pathway. Oncogene 34 24469053 10.1038/onc.2013.593 44. Xie W Tripartite motif containing 24 regulates cell proliferation in colorectal cancer through YAP signaling Cancer Med. 2020 9 6367 6376 10.1002/cam4.3310 32677374 PMC7476840 Xie, W. et al. Tripartite motif containing 24 regulates cell proliferation in colorectal cancer through YAP signaling. Cancer Med. 9 32677374 10.1002/cam4.3310 PMC7476840 45. Allton K Trim24 targets endogenous p53 for degradation Proc. Natl. Acad. Sci. USA 2009 106 11612 11616 10.1073/pnas.0813177106 19556538 PMC2710642 Allton, K. et al. Trim24 targets endogenous p53 for degradation. Proc. Natl. Acad. Sci. USA 106 19556538 10.1073/pnas.0813177106 PMC2710642 46. Fang Z TRIM24 promotes the aggression of gastric cancer via the Wnt/β-catenin signaling pathway Oncol. Lett. 2017 13 1797 1806 10.3892/ol.2017.5604 28454326 PMC5403329 Fang, Z. et al. TRIM24 promotes the aggression of gastric cancer via the Wnt/β-catenin signaling pathway. Oncol. Lett. 13 28454326 10.3892/ol.2017.5604 PMC5403329 47. Tian H TRIM24 promotes colorectal cancer cell progression via the Wnt/β-catenin signaling pathway activation Am. J. Transl. Res. 2022 14 831 848 35273688 PMC8902576 Tian, H. et al. TRIM24 promotes colorectal cancer cell progression via the Wnt/β-catenin signaling pathway activation. Am. J. Transl. Res. 14 35273688 PMC8902576 48. Klapper L TRIM24 expression as an independent biomarker for prognosis and tumor recurrence in HNSCC J. Pers. Med. 2022 12 991 10.3390/jpm12060991 35743773 PMC9225579 Klapper, L. et al. TRIM24 expression as an independent biomarker for prognosis and tumor recurrence in HNSCC. J. Pers. Med. 12 35743773 10.3390/jpm12060991 PMC9225579 49. Kikuchi M TRIM24 mediates ligand-dependent activation of androgen receptor and is repressed by a bromodomain-containing protein, BRD7, in prostate cancer cells Biochim. Biophys. Acta 2009 1793 1828 1836 10.1016/j.bbamcr.2009.11.001 19909775 Kikuchi, M. et al. TRIM24 mediates ligand-dependent activation of androgen receptor and is repressed by a bromodomain-containing protein, BRD7, in prostate cancer cells. Biochim. Biophys. Acta 1793 19909775 10.1016/j.bbamcr.2009.11.001 50. Mertins P Proteogenomics connects somatic mutations to signalling in breast cancer Nature 2016 534 55 62 10.1038/nature18003 27251275 PMC5102256 Mertins, P. et al. Proteogenomics connects somatic mutations to signalling in breast cancer. Nature 534 27251275 10.1038/nature18003 PMC5102256 51. Schweppe DK Rigas JR Gerber SA Quantitative phosphoproteomic profiling of human non-small cell lung cancer tumors J. Proteom. 2013 91 286 296 10.1016/j.jprot.2013.07.023 PMC3825743 23911959 Schweppe, D. K., Rigas, J. R. & Gerber, S. A. Quantitative phosphoproteomic profiling of human non-small cell lung cancer tumors. J. Proteom. 91 10.1016/j.jprot.2013.07.023 PMC3825743 23911959 52. Liu Y Bacterial genotoxin accelerates transient infection-driven murine colon tumorigenesis Cancer Discov. 2022 12 236 249 10.1158/2159-8290.CD-21-0912 34479870 PMC8758537 Liu, Y. et al. Bacterial genotoxin accelerates transient infection-driven murine colon tumorigenesis. Cancer Discov. 12 34479870 10.1158/2159-8290.CD-21-0912 PMC8758537 53. Fu K Sam68/KHDRBS1-dependent NF-kappaB activation confers radioprotection to the colon epithelium in gamma-irradiated mice Elife 2016 5 e21957 10.7554/eLife.21957 27996939 PMC5214542 Fu, K. et al. Sam68/KHDRBS1-dependent NF-kappaB activation confers radioprotection to the colon epithelium in gamma-irradiated mice. Elife 5 27996939 10.7554/eLife.21957 PMC5214542 54. Uhlén M Proteomics. Tissue-based map of the human proteome Science 2015 347 1260419 10.1126/science.1260419 25613900 Uhlén, M. et al. Proteomics. Tissue-based map of the human proteome. Science 347 25613900 10.1126/science.1260419 55. Uhlen M A pathology atlas of the human cancer transcriptome Science 2017 357 eaan2507 10.1126/science.aan2507 28818916 Uhlen, M. et al. A pathology atlas of the human cancer transcriptome. Science 357 28818916 10.1126/science.aan2507 ",
  "metadata": {
    "Title of this paper": "A pathology atlas of the human cancer transcriptome",
    "Journal it was published in:": "Nature Communications",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12480548/"
  }
}