{
  "title": "Paper_873",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12475169 PMC12475169.1 12475169 12475169 41006440 10.1038/s41598-025-17732-5 17732 1 Article LIMK1 is a prognosis and treatment biomarker in hepatocellular carcinoma Jiang Nan-Fang 1 Zhou Zhe 2 Zhang Hai-Ping 592005427@qq.com 1 1 https://ror.org/041c9x778 grid.411854.d 0000 0001 0709 0000 Department of Gastroenterology, Hubei No. 3 People’s Hospital of Jianghan University, 2 https://ror.org/004je0088 grid.443620.7 0000 0001 0479 4096 Department of Radiology, The Affiliated Hospital of Wuhan Sports University, 26 9 2025 2025 15 478255 33191 25 5 2025 26 8 2025 26 09 2025 28 09 2025 28 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ This study aimed to evaluate the clinical significance and underlying biological mechanisms of LIM kinase 1 (LIMK1) in hepatocellular carcinoma (HCC). Using multi-omics data from TCGA and ICGC cohorts, we analyzed LIMK1 expression and its prognostic value. Clinical validation was performed via immunohistochemistry on tissue microarray specimens. A multivariate Cox model integrating LIMK1 and clinicopathological features was constructed and evaluated using machine learning. Tumor immune microenvironment was profiled using multiple immune deconvolution algorithms. Immunotherapy cohorts and drug sensitivity data were leveraged to assess therapeutic implications. LIMK1 was significantly overexpressed in HCC tissues across all cohorts and correlated with poor overall survival (TCGA HR = 2.26, P P P Supplementary Information The online version contains supplementary material available at 10.1038/s41598-025-17732-5. Keywords LIMK1 Hepatocellular carcinoma Biomarker Tumor microenvironment Immunotherapy Subject terms Tumour biomarkers Liver cancer Hepatology Prognostic markers Data mining Bioinformatics pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Hepatocellular carcinoma (HCC) is commonly diagnosed worldwide, especially in eastern Asia 1 2 3 4 5 LIM kinase 1 (LIMK1) is a member of the LIM kinase family and serves as a crucial regulator of the cytoskeleton by phosphorylating and inactivating cofilin. Growing evidence suggests that LIMK1 is a versatile protein involved in various physiological processes, including cell migration, cell cycle, apoptosis, and cell differentiation 6 7 7 8 9 10 11 13 14 15 16 18 17 Currently, an increasing number of well-developed biological databases and well-designed cohorts with large samples are publicly available, which makes it possible to explore potential prognostic and treatment biomarkers for cancer patients 19 22 23 24 25 26 Material and methods Data source The RNA-seq expression profile and clinical data of HCC samples were downloaded from the UCSC Xena database ( https://tcga.xenahubs.net/ https://dcc.icgc.org/projects/LIRI-JP S1 Immunohistochemistry analysis of tissue microarray specimens For immunohistochemistry (IHC) analysis, anti-LIMK1 antibody (ab119084) was purchased from Abcam. After deparaffinization and rehydration, antigen retrieval was carried out by heat-induced epitope retrieval in citrate buffer (pH 6.0) at 95 °C for 20 min using a microwave oven. The primary antibody was then incubated with the tissues at 4 °C overnight. After washing, the sections are incubated with a biotin-conjugated secondary antibody that binds to the primary antibody. HRP/DAB kit (Maixin Biotech, Fuzhou, China) was used to visualize the staining. The IHC score was assessed by calculating the percentage of positive area and intensity, as described in a previous study 27 Expression level and prognostic value of LIMK1 This study compared the expression of LIMK1 between normal and HCC samples using Wilcoxon rank-sum test. The “pROC” package was employed to construct receiver operating characteristic (ROC) curves to assess the diagnostic accuracy of LIMK1.To evaluate the prognosis value of LIMK1, the Kaplan–Meiers method was utilized by “survminer” package. To adjust for other influencing clinical factors, multivariate Cox regression analyses were conducted, offering a more nuanced understanding of the independent effect of LIMK1 on patient prognosis. The “rms” package was used to create a multivariate Cox model by integrating LIMK1 and clinicopathological features. To enhance the interpretability of the model and quantify individual feature contributions to risk predictions, we applied SHAP (SHapley Additive exPlanations) analysis using the “kernelshap” R package. Time-dependent ROC curve was calculated to evaluate the prediction accuracy for patient prognosis. Calibration curve was plotted to estimate the model performance, providing insights into potential overfitting or underfitting. Decision curve was also plotted to assess the clinical utility by integrating the costs and benefits of different decision thresholds, helping to determine the value of the model in clinical decision-making. Functional analyses of LIMK1 The differentially expressed genes (DEGs) in high versus low LIMK1 groups were identified through the “limma” R package. Genes with a fold change of greater than two and a false discovery rate (FDR) of less than 0.05 were classified as DEGs. To gain further insight into the biological significance, gene set enrichment analysis (GSEA) was performed through the “clusterProfiler” and “msigdbr” R packages. The p value of the GSEA results was adjusted using the Benjamini–Hochberg method. GO, KEGG and Hallmark terms with adjusted p 28 Tumor immune microenvironment analysis The immune landscape was systematically profiled using an integrative approach combining TIMER 29 30 31 32 33 34 http://tide.dfci.harvard.edu 35 36 GSE106128 37 38 39 Chemotherapy sensitivity analysis Drug screening datasets have great potential for drug discovery and clinical treatment response prediction. The “OncoPredict” package was utilized to leverage large-scale gene expression and drug screening data. This package employs ridge regression, a type of linear regression that includes regularization to prevent overfitting, to calculate the IC50 values of various chemotherapy agents 22 Results Expression level and prognostic value of LIMK1 LIMK1 expression in pan-cancer was displayed in Fig. 1 1 2 2 2 P P 2 P P P P S2 2 Fig. 1 Expression level and prognostic value of LIMK1 in pan cancer. ( A B C Fig. 2 Expression level and prognostic value of LIMK1 in HCC. ( A B C D E F G H For clinical validation of LIMK1 protein expression, IHC was performed on a tissue microarray (HLivH180Su30). IHC analysis revealed distinct cytoplasmic localization of LIMK1 in HCC tumor tissues, exhibiting diffuse granular brown staining (Fig. 3 3 3 P P S2 4 4 4 4 4 4 Fig. 3 Clinical validation in the tissue microarray cohort. ( A B C Fig. 4 Model construction and evaluation. ( A B C D E F Functional analyses The GO and KEGG enrichment results revealed immune-related pathways, including immune response, adaptive immune response, leukocyte transendothelial migration, and complement and coagulation cascades (Fig. 5 5 Fig. 5 GSEA results of LIMK1. ( A B C D E Tumor immune microenvironment analysis To evaluate the function of LIMK1 in the tumor immune microenvironment of HCC, the association between LIMK1 expression and various immune cells was investigated. Higher immune scores and ESTIMATE scores were noted in LIMK1 high expression group in the TCGA and ICGC datasets (Fig. 6 6 7 Fig. 6 Relationship between LIMK1 and immune cells. ( A B Fig. 7 Relationship between LIMK1 and immune modulators. ( A B Immunotherapy response prediction To further assess LIMK1’s potential for predicting immunotherapeutic response, the relationship between the LIMK1 and TIDE score was investigated. TIDE analysis demonstrated that elevated LIMK1 expression correlated with heightened immune dysfunction and exclusion (Fig. 8 8 8 Fig. 8 Predictive value of LIMK1 in immunotherapy response through TIDE analysis. ( A B C D E F Moreover, LIMK1 demonstrated robust predictive capacity across multiple immunotherapy cohorts. In the Braun2020 and PRJNA482620 cohorts, elevated LIMK1 expression correlated with significantly poorer prognosis in patients receiving anti-PD-1 immunotherapy (Fig. 9 9 GSE106128 9 Fig. 9 High LIMK1 expression correlates with poor prognosis in patients receiving immunotherapy. ( A B C D GSE106128 Chemotherapy sensitivity analysis LIMK1 expression was negatively correlated with the IC50 values of various chemotherapy agents (Fig. 10 10 Fig. 10 Predictive value of LIMK1 in drug sensitivity. ( A B C D Discussion Recent studies have indicated that LIMK1 significantly enhances tumor growth across various cancers by promoting cell proliferation, migration, and invasion 8 10 13 15 18 Our findings reveal that LIMK1 is significantly overexpressed in HCC tissues compared to adjacent normal tissues across TCGA, ICGC, and in-house cohorts. The expression level of LIMK1 effectively stratified patients into subgroups with opposite survival outcomes, independent of various clinicopathological features. Notably, the multivariate Cox model incorporating LIMK1 achieves robust prognostic accuracy (1-year AUC = 0.90). The calibration curve shows good consistency between our predictive values and the actual values, and decision curve shows great potential for application in clinical practice. While previous studies reported nuclear LIMK1 as a prognostic marker in HCC 40 The biological role of LIMK1 in tumor development has attracted increasing interest from researchers. Knockdown of LIMK1 has been reported to impede cell proliferation and invasion of several cancer cells 7 9 13 15 18 6 7 41 42 41 42 43 Previous research has shown that overexpression of LIMK1 can facilitate the invasion of drug-resistant osteosarcoma cells 44 45 Although significant progress has been made in immunotherapy 46 47 48 49 42 43 50 This study has several limitations. First, the validation cohort’s small sample size and single-center design may limit generalizability, necessitating multi-center validation with larger cohorts. Second, while our data identified LIMK1 as an indicator of immunosuppression in HCC, the mechanistic link between LIMK1 and immune cell infiltration remains correlative. Although the \"LIMK1-EMT-Immune Evasion\" axis Conclusion In conclusion, LIMK1 is found to be helpful in prognosis assessment, immune status estimation, immunotherapy response prediction and chemotherapy drug sensitivity evaluation in patients with HCC. These findings pave the way for future research aimed at leveraging LIMK1 as a prognostic indicator and therapeutic target, potentially leading to more effective strategies for managing HCC and improving outcome. Future research should focus on mechanistic validation and translational applications to fully harness LIMK1’s clinical utility. Supplementary Information  Supplementary Information. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Author contributions Nan-Fang Jiang: Conceptualization, methodology, validation, software, formal analysis, writing—original draft. Hai-Ping Zhang: Conceptualization, methodology, software, formal analysis, project administration, writing—original draft, writing—review and editing. Zhe Zhou: Methodology, validation, formal analysis, investigation, visualization, writing—original draft. Data availability RNA seq data were downloaded from the TCGA and ICGC projects. The data of tissue microarray will be available upon reasonable request by contacting Hai-Ping Zhang at 592005427@qq.com. Declarations Competing interests The authors declare competing interests. References 1. Bray F Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J. Clin. 2024 74 229 263 10.3322/caac.21834 38572751 Bray, F. et al. Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. CA Cancer J. Clin. 74 38572751 10.3322/caac.21834 2. Rumgay H Global burden of primary liver cancer in 2020 and predictions to 2040 J. Hepatol. 2022 77 1598 1606 10.1016/j.jhep.2022.08.021 36208844 PMC9670241 Rumgay, H. et al. Global burden of primary liver cancer in 2020 and predictions to 2040. J. Hepatol. 77 36208844 10.1016/j.jhep.2022.08.021 PMC9670241 3. European Association for the Study of the Liver EASL Clinical Practice Guidelines: Management of hepatocellular carcinoma J. Hepatol. 2018 69 182 236 10.1016/j.jhep.2018.03.019 29628281 European Association for the Study of the Liver. EASL Clinical Practice Guidelines: Management of hepatocellular carcinoma. J. Hepatol. 69 29628281 10.1016/j.jhep.2018.03.019 4. Heimbach JK AASLD guidelines for the treatment of hepatocellular carcinoma Hepatology 2018 67 358 380 10.1002/hep.29086 28130846 Heimbach, J. K. et al. AASLD guidelines for the treatment of hepatocellular carcinoma. Hepatology 67 28130846 10.1002/hep.29086 5. Llovet JM Immunotherapies for hepatocellular carcinoma Nat. Rev. Clin. Oncol. 2022 19 151 172 10.1038/s41571-021-00573-2 34764464 Llovet, J. M. et al. Immunotherapies for hepatocellular carcinoma. Nat. Rev. Clin. Oncol. 19 34764464 10.1038/s41571-021-00573-2 6. Ribba AS Fraboulet S Sadoul K Lafanechere L The role of LIM kinases during development: A lens to get a glimpse of their implication in pathologies Cells 2022 10.3390/cells11030403 35159213 PMC8834001 Ribba, A. S., Fraboulet, S., Sadoul, K. & Lafanechere, L. The role of LIM kinases during development: A lens to get a glimpse of their implication in pathologies. Cells 35159213 10.3390/cells11030403 PMC8834001 7. Villalonga E LIM kinases, LIMK1 and LIMK2, are crucial node actors of the cell fate: Molecular to pathological features Cells 2023 10.3390/cells12050805 36899941 PMC10000741 Villalonga, E. et al. LIM kinases, LIMK1 and LIMK2, are crucial node actors of the cell fate: Molecular to pathological features. Cells 36899941 10.3390/cells12050805 PMC10000741 8. Yoshioka K Foletta V Bernard O Itoh K A role for LIM kinase in cancer invasion Proc. Natl. Acad. Sci. U. S. A. 2003 100 7247 7252 10.1073/pnas.1232344100 12777619 PMC165861 Yoshioka, K., Foletta, V., Bernard, O. & Itoh, K. A role for LIM kinase in cancer invasion. Proc. Natl. Acad. Sci. U. S. A. 100 12777619 10.1073/pnas.1232344100 PMC165861 9. Kang X LIMK1 promotes peritoneal metastasis of gastric cancer and is a therapeutic target Oncogene 2021 40 3422 3433 10.1038/s41388-021-01656-1 33883692 PMC8116207 Kang, X. et al. LIMK1 promotes peritoneal metastasis of gastric cancer and is a therapeutic target. Oncogene 40 33883692 10.1038/s41388-021-01656-1 PMC8116207 10. You T Overexpression of LIMK1 promotes tumor growth and metastasis in gastric cancer Biomed. Pharmacother. 2015 69 96 101 10.1016/j.biopha.2014.11.011 25661344 You, T. et al. Overexpression of LIMK1 promotes tumor growth and metastasis in gastric cancer. Biomed. Pharmacother. 69 25661344 10.1016/j.biopha.2014.11.011 11. Liao Q LIM kinase 1 interacts with myosin-9 and alpha-actinin-4 and promotes colorectal cancer progression Br. J. Cancer 2017 117 563 571 10.1038/bjc.2017.193 28664914 PMC5558682 Liao, Q. et al. LIM kinase 1 interacts with myosin-9 and alpha-actinin-4 and promotes colorectal cancer progression. Br. J. Cancer 117 28664914 10.1038/bjc.2017.193 PMC5558682 12. Liu X LIMK1: A promising prognostic and immune infiltration indicator in colorectal cancer Oncol. Lett. 2022 24 234 10.3892/ol.2022.13354 35720504 PMC9185146 Liu, X. et al. LIMK1: A promising prognostic and immune infiltration indicator in colorectal cancer. Oncol. Lett. 24 35720504 10.3892/ol.2022.13354 PMC9185146 13. Sun X Li S Lin H LIMK1 interacts with STK25 to regulate EMT and promote the proliferation and metastasis of colorectal cancer J. Oncol. 2022 2022 3963883 10.1155/2022/3963883 35265128 PMC8901301 Sun, X., Li, S. & Lin, H. LIMK1 interacts with STK25 to regulate EMT and promote the proliferation and metastasis of colorectal cancer. J. Oncol. 2022 35265128 10.1155/2022/3963883 PMC8901301 14. Zhang W Gan N Zhou J Immunohistochemical investigation of the correlation between LIM kinase 1 expression and development and progression of human ovarian carcinoma J. Int. Med. Res. 2012 40 1067 1073 10.1177/147323001204000325 22906279 Zhang, W., Gan, N. & Zhou, J. Immunohistochemical investigation of the correlation between LIM kinase 1 expression and development and progression of human ovarian carcinoma. J. Int. Med. Res. 40 22906279 10.1177/147323001204000325 15. Chen P Zeng M Zhao Y Fang X Upregulation of Limk1 caused by microRNA-138 loss aggravates the metastasis of ovarian cancer by activation of Limk1/cofilin signaling Oncol. Rep. 2014 32 2070 2076 10.3892/or.2014.3461 25190487 Chen, P., Zeng, M., Zhao, Y. & Fang, X. Upregulation of Limk1 caused by microRNA-138 loss aggravates the metastasis of ovarian cancer by activation of Limk1/cofilin signaling. Oncol. Rep. 32 25190487 10.3892/or.2014.3461 16. Davila M Frost AR Grizzle WE Chakrabarti R LIM kinase 1 is essential for the invasive growth of prostate epithelial cells: Implications in prostate cancer J. Biol. Chem. 2003 278 36868 36875 10.1074/jbc.M306196200 12821664 Davila, M., Frost, A. R., Grizzle, W. E. & Chakrabarti, R. LIM kinase 1 is essential for the invasive growth of prostate epithelial cells: Implications in prostate cancer. J. Biol. Chem. 278 12821664 10.1074/jbc.M306196200 17. Huang JB Up-regulation of LIMK1 expression in prostate cancer is correlated with poor pathological features, lymph node metastases and biochemical recurrence J. Cell. Mol. Med. 2020 24 4698 4706 10.1111/jcmm.15138 32168432 PMC7176864 Huang, J. B. et al. Up-regulation of LIMK1 expression in prostate cancer is correlated with poor pathological features, lymph node metastases and biochemical recurrence. J. Cell. Mol. Med. 24 32168432 10.1111/jcmm.15138 PMC7176864 18. Mardilovich K Elevated LIM kinase 1 in nonmetastatic prostate cancer reflects its role in facilitating androgen receptor nuclear translocation Mol. Cancer Ther. 2015 14 246 258 10.1158/1535-7163.MCT-14-0447 25344584 PMC4297197 Mardilovich, K. et al. Elevated LIM kinase 1 in nonmetastatic prostate cancer reflects its role in facilitating androgen receptor nuclear translocation. Mol. Cancer Ther. 14 25344584 10.1158/1535-7163.MCT-14-0447 PMC4297197 19. Chervitz SA Data standards for Omics data: The basis of data sharing and reuse Methods Mol. Biol. 2011 719 31 69 10.1007/978-1-61779-027-0_2 21370078 PMC4152841 Chervitz, S. A. et al. Data standards for Omics data: The basis of data sharing and reuse. Methods Mol. Biol. 719 21370078 10.1007/978-1-61779-027-0_2 PMC4152841 20. Fu J Large-scale public data reuse to model immunotherapy response and resistance Genome Med. 2020 12 21 10.1186/s13073-020-0721-z 32102694 PMC7045518 Fu, J. et al. Large-scale public data reuse to model immunotherapy response and resistance. Genome Med. 12 32102694 10.1186/s13073-020-0721-z PMC7045518 21. Lanczky A Gyorffy B Web-based survival analysis tool tailored for medical research (KMplot): Development and implementation J. Med. Internet Res. 2021 23 e27633 10.2196/27633 34309564 PMC8367126 Lanczky, A. & Gyorffy, B. Web-based survival analysis tool tailored for medical research (KMplot): Development and implementation. J. Med. Internet Res. 23 34309564 10.2196/27633 PMC8367126 22. Maeser D Gruener RF Huang RS oncoPredict: An R package for predicting in vivo or cancer patient drug response and biomarkers from cell line screening data Brief. Bioinform. 2021 10.1093/bib/bbab260 34260682 PMC8574972 Maeser, D., Gruener, R. F. & Huang, R. S. oncoPredict: An R package for predicting in vivo or cancer patient drug response and biomarkers from cell line screening data. Brief. Bioinform. 34260682 10.1093/bib/bbab260 PMC8574972 23. Jawhar NM Tissue Microarray: A rapidly evolving diagnostic and research tool Ann. Saudi Med. 2009 29 123 127 10.4103/0256-4947.51806 19318744 PMC2813639 Jawhar, N. M. Tissue Microarray: A rapidly evolving diagnostic and research tool. Ann. Saudi Med. 29 19318744 10.4103/0256-4947.51806 PMC2813639 24. Hewitt SM Tissue microarrays as a tool in the discovery and validation of predictive biomarkers Methods Mol. Biol. 2012 823 201 214 10.1007/978-1-60327-216-2_13 22081347 PMC7457565 Hewitt, S. M. Tissue microarrays as a tool in the discovery and validation of predictive biomarkers. Methods Mol. Biol. 823 22081347 10.1007/978-1-60327-216-2_13 PMC7457565 25. Berrou J Preclinical evaluation of a novel small molecule inhibitor of LIM kinases (LIMK) CEL_amide in philadelphia-chromosome positive (BCR::ABL+) acute lymphoblastic leukemia (ALL) J. Clin. Med. 2022 10.3390/jcm11226761 36431240 PMC9692768 Berrou, J. et al. Preclinical evaluation of a novel small molecule inhibitor of LIM kinases (LIMK) CEL_amide in philadelphia-chromosome positive (BCR::ABL+) acute lymphoblastic leukemia (ALL). J. Clin. Med. 36431240 10.3390/jcm11226761 PMC9692768 26. Djamai H Synergy of FLT3 inhibitors and the small molecule inhibitor of LIM kinase1/2 CEL_Amide in FLT3-ITD mutated Acute Myeloblastic Leukemia (AML) cells Leuk. Res. 2021 100 106490 10.1016/j.leukres.2020.106490 33373830 Djamai, H. et al. Synergy of FLT3 inhibitors and the small molecule inhibitor of LIM kinase1/2 CEL_Amide in FLT3-ITD mutated Acute Myeloblastic Leukemia (AML) cells. Leuk. Res. 100 33373830 10.1016/j.leukres.2020.106490 27. Zhou Y Identification of a three-gene expression signature and construction of a prognostic nomogram predicting overall survival in lung adenocarcinoma based on TCGA and GEO databases Transl. Lung Cancer Res. 2022 11 1479 1496 10.21037/tlcr-22-444 35958325 PMC9359966 Zhou, Y. et al. Identification of a three-gene expression signature and construction of a prognostic nomogram predicting overall survival in lung adenocarcinoma based on TCGA and GEO databases. Transl. Lung Cancer Res. 11 35958325 10.21037/tlcr-22-444 PMC9359966 28. Kanehisa M KEGG: Biological systems database as a model of the real world Nucleic Acids Res. 2025 53 D672 D677 10.1093/nar/gkae909 39417505 PMC11701520 Kanehisa, M. et al. KEGG: Biological systems database as a model of the real world. Nucleic Acids Res. 53 39417505 10.1093/nar/gkae909 PMC11701520 29. Li T TIMER: A web server for comprehensive analysis of tumor-infiltrating immune cells Cancer Res. 2017 77 e108 e110 10.1158/0008-5472.CAN-17-0307 29092952 PMC6042652 Li, T. et al. TIMER: A web server for comprehensive analysis of tumor-infiltrating immune cells. Cancer Res. 77 29092952 10.1158/0008-5472.CAN-17-0307 PMC6042652 30. Racle J de Jonge K Baumgaertner P Speiser DE Gfeller D Simultaneous enumeration of cancer and immune cell types from bulk tumor gene expression data Elife 2017 10.7554/eLife.26476 29130882 PMC5718706 Racle, J., de Jonge, K., Baumgaertner, P., Speiser, D. E. & Gfeller, D. Simultaneous enumeration of cancer and immune cell types from bulk tumor gene expression data. Elife 29130882 10.7554/eLife.26476 PMC5718706 31. Finotello F Molecular and pharmacological modulators of the tumor immune contexture revealed by deconvolution of RNA-seq data Genome Med. 2019 11 34 10.1186/s13073-019-0638-6 31126321 PMC6534875 Finotello, F. et al. Molecular and pharmacological modulators of the tumor immune contexture revealed by deconvolution of RNA-seq data. Genome Med. 11 31126321 10.1186/s13073-019-0638-6 PMC6534875 32. Charoentong P Pan-cancer immunogenomic analyses reveal genotype-immunophenotype relationships and predictors of response to checkpoint blockade Cell Rep. 2017 18 248 262 10.1016/j.celrep.2016.12.019 28052254 Charoentong, P. et al. Pan-cancer immunogenomic analyses reveal genotype-immunophenotype relationships and predictors of response to checkpoint blockade. Cell Rep. 18 28052254 10.1016/j.celrep.2016.12.019 33. Becht E Estimating the population abundance of tissue-infiltrating immune and stromal cell populations using gene expression Genome Biol. 2016 17 218 10.1186/s13059-016-1070-5 27765066 PMC5073889 Becht, E. et al. Estimating the population abundance of tissue-infiltrating immune and stromal cell populations using gene expression. Genome Biol. 17 27908289 10.1186/s13059-016-1113-y PMC5134277 34. Yoshihara K Inferring tumour purity and stromal and immune cell admixture from expression data Nat. Commun. 2013 4 2612 10.1038/ncomms3612 24113773 PMC3826632 Yoshihara, K. et al. Inferring tumour purity and stromal and immune cell admixture from expression data. Nat. Commun. 4 24113773 10.1038/ncomms3612 PMC3826632 35. Jiang P Signatures of T cell dysfunction and exclusion predict cancer immunotherapy response Nat. Med. 2018 24 1550 1558 10.1038/s41591-018-0136-1 30127393 PMC6487502 Jiang, P. et al. Signatures of T cell dysfunction and exclusion predict cancer immunotherapy response. Nat. Med. 24 30127393 10.1038/s41591-018-0136-1 PMC6487502 36. Braun DA Interplay of somatic alterations and immune infiltration modulates response to PD-1 blockade in advanced clear cell renal cell carcinoma Nat. Med. 2020 26 909 918 10.1038/s41591-020-0839-y 32472114 PMC7499153 Braun, D. A. et al. Interplay of somatic alterations and immune infiltration modulates response to PD-1 blockade in advanced clear cell renal cell carcinoma. Nat. Med. 26 32472114 10.1038/s41591-020-0839-y PMC7499153 37. Garcia-Salum T Molecular signatures associated with tumor-specific immune response in melanoma patients treated with dendritic cell-based immunotherapy Oncotarget 2018 9 17014 17027 10.18632/oncotarget.24795 29682201 PMC5908302 Garcia-Salum, T. et al. Molecular signatures associated with tumor-specific immune response in melanoma patients treated with dendritic cell-based immunotherapy. Oncotarget 9 29682201 10.18632/oncotarget.24795 PMC5908302 38. Zhao J Author Correction: Immune and genomic correlates of response to anti-PD-1 immunotherapy in glioblastoma Nat Med 2019 25 1022 10.1038/s41591-019-0449-8 30996326 Zhao, J. et al. Author Correction: Immune and genomic correlates of response to anti-PD-1 immunotherapy in glioblastoma. Nat Med 25 30996326 10.1038/s41591-019-0449-8 39. Gide TN Distinct immune cell populations define response to anti-PD-1 monotherapy and anti-PD-1/anti-CTLA-4 combined therapy Cancer Cell 2019 35 238 255 10.1016/j.ccell.2019.01.003 30753825 Gide, T. N. et al. Distinct immune cell populations define response to anti-PD-1 monotherapy and anti-PD-1/anti-CTLA-4 combined therapy. Cancer Cell 35 30753825 10.1016/j.ccell.2019.01.003 40. Pan Z LIMK1 nuclear translocation promotes hepatocellular carcinoma progression by increasing p-ERK nuclear shuttling and by activating c-Myc signalling upon EGF stimulation Oncogene 2021 40 2581 2595 10.1038/s41388-021-01736-2 33686242 Pan, Z. et al. LIMK1 nuclear translocation promotes hepatocellular carcinoma progression by increasing p-ERK nuclear shuttling and by activating c-Myc signalling upon EGF stimulation. Oncogene 40 33686242 10.1038/s41388-021-01736-2 41. Vlecken DH Bagowski CP LIMK1 and LIMK2 are important for metastatic behavior and tumor cell-induced angiogenesis of pancreatic cancer cells Zebrafish 2009 6 433 439 10.1089/zeb.2009.0602 20047470 Vlecken, D. H. & Bagowski, C. P. LIMK1 and LIMK2 are important for metastatic behavior and tumor cell-induced angiogenesis of pancreatic cancer cells. Zebrafish 6 20047470 10.1089/zeb.2009.0602 42. Guo D Regulatory effects of LIM kinase 1 on the proliferation and metastasis of hepatocellular carcinoma cells Zhonghua Gan Zang Bing Za Zhi 2021 29 427 432 10.3760/cma.j.cn501113-20191113-00419 34107579 Guo, D. et al. Regulatory effects of LIM kinase 1 on the proliferation and metastasis of hepatocellular carcinoma cells. Zhonghua Gan Zang Bing Za Zhi 29 34107579 10.3760/cma.j.cn501113-20191113-00419 43. Ding B Lou W Fan W Pan J Exosomal miR-374c-5p derived from mesenchymal stem cells suppresses epithelial-mesenchymal transition of hepatocellular carcinoma via the LIMK1-Wnt/beta-catenin axis Environ. Toxicol. 2023 38 1038 1052 10.1002/tox.23746 36722453 Ding, B., Lou, W., Fan, W. & Pan, J. Exosomal miR-374c-5p derived from mesenchymal stem cells suppresses epithelial-mesenchymal transition of hepatocellular carcinoma via the LIMK1-Wnt/beta-catenin axis. Environ. Toxicol. 38 36722453 10.1002/tox.23746 44. Zhang H Overexpression of LIMK1 promotes migration ability of multidrug-resistant osteosarcoma cells Oncol. Res. 2011 19 501 509 10.3727/096504012x13286534482511 22715593 Zhang, H. et al. Overexpression of LIMK1 promotes migration ability of multidrug-resistant osteosarcoma cells. Oncol. Res. 19 22715593 10.3727/096504012x13286534482511 45. Chen Q Downregulation of LIMK1 level inhibits migration of lung cancer cells and enhances sensitivity to chemotherapy drugs Oncol. Res. 2013 20 491 498 10.3727/096504013X13657689382699 24063279 Chen, Q. et al. Downregulation of LIMK1 level inhibits migration of lung cancer cells and enhances sensitivity to chemotherapy drugs. Oncol. Res. 20 24063279 10.3727/096504013X13657689382699 46. Ren Z Sintilimab plus a bevacizumab biosimilar (IBI305) versus sorafenib in unresectable hepatocellular carcinoma (ORIENT-32): A randomised, open-label, phase 2–3 study Lancet Oncol. 2021 22 977 990 10.1016/S1470-2045(21)00252-7 34143971 Ren, Z. et al. Sintilimab plus a bevacizumab biosimilar (IBI305) versus sorafenib in unresectable hepatocellular carcinoma (ORIENT-32): A randomised, open-label, phase 2–3 study. Lancet Oncol. 22 34143971 10.1016/S1470-2045(21)00252-7 47. Finn RS Atezolizumab plus bevacizumab in unresectable hepatocellular carcinoma N. Engl. J. Med. 2020 382 1894 1905 10.1056/NEJMoa1915745 32402160 Finn, R. S. et al. Atezolizumab plus bevacizumab in unresectable hepatocellular carcinoma. N. Engl. J. Med. 382 32402160 10.1056/NEJMoa1915745 48. Donne R Lujambio A The liver cancer immune microenvironment: Therapeutic implications for hepatocellular carcinoma Hepatology 2023 77 1773 1796 10.1002/hep.32740 35989535 PMC9941399 Donne, R. & Lujambio, A. The liver cancer immune microenvironment: Therapeutic implications for hepatocellular carcinoma. Hepatology 77 35989535 10.1002/hep.32740 PMC9941399 49. Oura K Morishita A Tani J Masaki T Tumor immune microenvironment and immunosuppressive therapy in hepatocellular carcinoma: A review Int. J. Mol. Sci. 2021 10.3390/ijms22115801 34071550 PMC8198390 Oura, K., Morishita, A., Tani, J. & Masaki, T. Tumor immune microenvironment and immunosuppressive therapy in hepatocellular carcinoma: A review. Int. J. Mol. Sci. 34071550 10.3390/ijms22115801 PMC8198390 50. Taki M Tumor immune microenvironment during epithelial-mesenchymal transition Clin. Cancer Res. 2021 27 669 4679 10.1158/1078-0432.CCR-20-4459 33827891 Taki, M. et al. Tumor immune microenvironment during epithelial-mesenchymal transition. Clin. Cancer Res. 27 10.1158/1078-0432.CCR-20-4459 33827891 ",
  "metadata": {
    "Title of this paper": "Tumor immune microenvironment during epithelial-mesenchymal transition",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12475169/"
  }
}