{
  "title": "Paper_454",
  "abstract": "pmc Prog Retin Eye Res Prog Retin Eye Res 319 nihpa Progress in retinal and eye research 1350-9462 1873-1635 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12483061 PMC12483061.1 12483061 12483061 NIHMS2112771 40334739 10.1016/j.preteyeres.2025.101362 NIHMS2112771 NIHPA2112771 1 Article Glands of Moll: history, current knowledge and their role in ocular surface homeostasis and disease Stopfer Michael a Zahn Ingrid a Jüngert Katharina a Aumüller Gerhard b Moll Frans L. c Schicht Martin a Makarenkova Helen P. d de Paiva Cintia S. e http://orcid.org/0000-0002-0527-0953 Paulsen Friedrich P. a * a b c d e * friedrich.paulsen@fau.de 5 2025 05 5 2025 106 497820 101362 101362 28 09 2025 30 09 2025 01 10 2025 02 10 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license ( http://creativecommons.org/licenses/by/4.0/ Corrigendum to \"Glands of Moll: history, current knowledge and their role in ocular surface homeostasis and disease\" [Progr. Retin. Eye Res. 106 (2025) 101362]. 20 5 2025 101364 101364 Prog Retin Eye Res 10.1016/j.preteyeres.2025.101364 40399160 Over the last 20 years, research into the Meibomian glands of the eyelids has increased exponentially and is now widely recognized as a field of research. It is all the more astonishing that knowledge about another type of gland in the eyelids, the Moll glands or ciliary glands, has almost stagnated and there has been little to almost no progress, even though this type of gland as a whole takes up a relatively large volume in the upper and lower eyelids. There is not much information about the namesake Moll or the function of the glands although these are listed in nearly every textbook of anatomy, histology and ophthalmology. For this reason, we set out to compile the existing knowledge about the Moll glands of the eyelids in order to create a basis for follow-up studies and to stimulate research into this type of gland. In our literature research, we went back to the middle of the 19th century and made contact with a descendant of the Moll family and illustrate their relevance for the present. The structure of the secretory part of the Moll glands is very well described, a number of secretory products are known, but the current state of research allows only very rough speculations about their function. The overview provides numerous interesting insights, which, however, raise more questions than they provide answers. Jacob Anthonie Moll Moll glands Ciliary glands Glandulae ciliares conjunctivales Sweat gland Apocrine gland Ocular surface Lid margin Tear film pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The lacrimal functional unit (LFU) is a highly complex and dynamic system that ensures the maintenance, regulation, and stability of the tear film, which is essential for ocular surface health and visual function. It comprises multiple interconnected components, including the lacrimal glands, the ocular surface (cornea and conjunctiva), the eyelids and their associated glands (such as Meibomian and accessory lacrimal glands), as well as the complex network of sensory, autonomic, and motor nerves that coordinate their function ( Stern et al., 2004 Stern et al., 2004 Extensive research has been done on the lacrimal glands as well as on the Meibomian glands in the eyelids (the latter have experienced a veritable scientific boom in the last 20 years) ( Knop et al., 2011 Khan et al., 2022 Yeu et al., 2024 2. Jacob Anthonie Moll The human Moll glands are named after Jacob Anthonie Moll, a Dutch physician ( Fig. 1 Fig. 2 Suppl. Fig. 1 Fig. 2 Fig. 2 Suppl. Fig. 2 Fig. 2 From 1850, Jacob Anthonie Moll studied medicine at the University of Utrecht/Netherlands. In June 1854, Moll became an assistant to Professor F. C. Donders, 1 Fig. 3 Moll, 1857   1 In August 1857, Moll was appointed to the Buitengasthuis in Amsterdam, where he obtained a second doctorate in surgery on April 17, 1858 under the mentorship of the surgeon Prof. van Ittersum in Amsterdam. At the age of 26, Moll then opened his own practice in The Hague/Netherlands and worked here until his retirement on December 31, 1901. Jacob Anthonie Moll died at the age of 81 on January 27, 1914 in The Hague ( Suppl Fig. 3 To summarize and bring it up to date, Jacob Anthonie Moll was a doctoral student of Professor F. C. Donders, 1 3. Moll’s description of the glandulae ciliares conjunctivales in the context of his time Although the glandulae ciliares conjunctivales (glandulae tarsals ciliares) are named after Moll, they were described by Albert von Kölliker (1817–1905, professor of anatomy in Würzburg) as early as 1850 as ‘sweat glands of conspicuous appearance, which frequently open into the upper end of the hair follicles of the eyelashes’ ( Kölliker, 1850 In his doctoral thesis ( Moll, 1857 Moll, 1858 Henle (1871) Sattler, 1877 Sattler, 1877 Subsequent studies on the Moll glands were conducted by Waldeyer (1874) Königstein (1884) Contino (1907) Ask (1908) Virchow (1922) Peter and Horn (1935) Tabara (1953) Tartuferi (1879) Eggeling (1904) Zietzschmann (1904) Schaffer (1940) Ikeda (1953) Table 1 Table 1 In addition, Ikeda (1953) Fig. 4 Histologically, Moll glands are categorized as apocrine sweat glands ( Lüllmann-Rauch and Asan, 2024 Sattler, 1877 Fig. 5A The proximal, nodular secretory gland part of a Moll gland has a wide lumen ( Figs. 5 6 Fig. 6 Fig. 6 Fig. 6 Montagna, 1992 Schaffer, 1940 Welsch et al., 1998 Stoeckelhuber et al., 2003 Table 2 Stoeckelhuber et al., 2004 Table 3 Yasui et al. (2006) Table 3 Table 3 Stöckelhuber et al. ( Stoeckelhuber et al., 2003 Jakobiec and Zakka (2011) Sattler (1877) Stoeckelhuber et al., 2003 Ikeda (1953) Table 1 Stoeckelhuber et al., 2004 Ultrastructurally, active Moll gland epithelial cells have tall apical protrusions with loosely distributed microvilli on the apical membrane ( Stoeckelhuber et al., 2003 Figs. 6 7 Sattler (1877) Fig. 7 Stoeckelhuber et al., 2003 Stoeckelhuber et al., 2003 Stoeckelhuber et al., 2003 Fig. 7 Stoeckelhuber et al., 2003 The excretory ducts were already described in detail by Sattler (1877) Stoeckelhuber et al., 2003 Figs. 6 7 4. Cells involved in the structure of the Moll glands Morphologically, Moll glands are formed by several different cell types ( Jakobiec and Zakka, 2011 Stoeckelhuber et al., 2003 Yasui et al., 2006 Muschler and Streuli, 2010 Watson and Khaled, 2008 Lu et al., 2012 5. Apocrine versus eccrine glands in mammals Humans have around 2–4 million sweat glands distributed throughout the body ( Baker, 2019 Lu and Fuchs, 2014 Jakobiec and Zakka, 2011 Lu and Fuchs, 2014 Sato et al., 1989 Wilke et al., 2007 Preti and Leyden, 2010 Shehadeh and Kligman, 1963 Groscurth, 2002 There are several indications that there are other types of sweat glands in addition to eccrine and apocrine glands. For example, apoeccrine or mixed sweat glands have been described in human axillary and perianal skin ( Ito, 1988 Sato et al., 1987 Groscurth, 2002 van der Putte, 1993 Groscurth, 2002 Eccrine sweat glands make up 90 per cent of all sweat glands (~700/cm 2 Groscurth, 2002 Hwang and Baik, 1997 Szabo, 1967 Asahina et al., 2015 Groscurth, 2002 Sato, 1993 Groscurth, 2002 Lu and Fuchs, 2014 Sato et al., 1989 Beer et al. (2006) McEwan Jenkinson et al., 2006 Schmidt-Nielsen et al., 1957 6. Prenatal development of Moll glands The rudiments of the apocrine sweat glands are formed at the same time as those of the eccrine glands ( Groscurth, 2002 Lu and Fuchs, 2014 Groscurth, 2002 Groscurth, 2002 Hashimoto, 1970 Hoepke, 1927 Sato et al., 1989 Sattler, 1877 Stoeckelhuber et al., 2003 Requena et al., 1998 Lu et al., 2016 Lu et al., 2016 The further maturation of the apocrine sweat glands appears to be dependent on sex hormones, but not their maintenance, since gonadectomy in adults has no effect on their function ( Groscurth, 2002 Stoeckelhuber et al., 2003 7. Function of the Moll glands Stöckelhuber et al. ( Stoeckelhuber et al., 2003 Takahashi et al., 2013 Garreis et al., 2010 McDermott, 2009 Stoeckelhuber et al., 2003 Stoeckelhuber et al., 2003 2004 2008 Garreis et al., 2017 Because eyelashes form a barrier between the external and internal environments of the eye, they are extremely sensitive to a variety of threats and stimuli and are intensely innervated to perform this function ( Aumond and Bitton, 2018 Montagna and Ford, 1969 Liotet et al., 1977 Montagna and Ford, 1969 Na et al., 2006 Singh et al., 2024 Aumond and Bitton (2018) Aumond and Bitton, 2018 Marieb et al., 2005 Aumond and Bitton, 2018 The eyelashes are a crucial component of the eyelid margin anatomy, along with the Meibomian glands, the eyelid skin and the biofilm, all of which contribute to the overall homeostasis of the ocular surface ( Aumond and Bitton, 2018 Yeu et al., 2024 Craig et al., 2017 Aumond and Bitton, 2018 Craig et al., 2017 Cheng et al., 2021 Trattler et al., 2022 Rhee et al., 2023 Fig. 8 Fromstein et al., 2018 Fromstein et al., 2018 Biernat et al., 2018 Fig. 8 Fromstein et al., 2018 Biernat et al., 2018 Rhee et al., 2023 Trattler et al., 2022 Cheng et al., 2015 Fig. 8A Fig. 8B In addition to their role in self-protection and immune defense, the secretion of the Moll glands can also be crucial for maintaining the homeostasis of the eyelid margin. This secretion likely contributes to the proper functioning of the eyelid, particularly in facilitating smooth and healthy eyelid movement during eyelid closure. The presence of these secretions may also help lubricate the eyelid margin, reducing friction and wear during the blinking process. Thus, the Moll glands could also play a role in maintaining the integrity of the tear film and protecting the ocular surface from potential damage. But even this is just a theory that has yet to be scientifically verified. 8. Thermoregulation In order to be able to adapt intensively to climatic conditions, humans have evolved to develop eccrine sweat glands and a strong reduction in apocrine sweat glands ( Lu and Fuchs, 2014 Lu and Fuchs, 2014 McEwan Jenkinson et al., 2006 Schmidt-Nielsen et al., 1957 Nagymihályi et al., 2004 Nagymihályi et al., 2004 Rosenfeld et al., 2013 Terada et al., 2004 Kashio et al., 2024 Fig. 9 Lüllmann-Rauch and Asan, 2024 9. Communication of psychological state, emotional sweating The sweat of the apocrine glands contains, among other things, pheromones and odor signals ( Beer et al., 2006 Beier et al., 2005 Cowley and Brooksbank, 1991 Grosser et al., 2000 Sobel et al., 1999 Groscurth, 2002 Hoepke, 1927 Sobel et al., 1999 Cowley and Brooksbank, 1991 Cutler et al., 1998 Grosser et al., 2000 Stern and McClintock, 1998 Monti-Bloch et al., 1998 Shinohara et al., 2000 Other authors take a more critical view of the existence of pheromones in humans ( Precone et al., 2020 Gelstein et al., 2011 Precone et al., 2020 Shirokova et al., 2008 Precone et al., 2020 Precone et al., 2020 However, only humans can shed emotional tears ( Gelstein et al., 2011 Messmer, 2009 Murube et al., 1999 Murube, 2009a 2009b Messmer, 2009 Gelstein et al., 2011 Messmer, 2009 Stoeckelhuber et al., 2006 In addition, it should be discussed whether some of the proteins produced by the Moll glands may turn out to be interesting biomarkers that may also play a role in ocular surface diseases. Tear fluid has become increasingly important in recent years due to advances in detection methods for measuring ultra-low biomaker levels from low sample volumes ( Gijs et al., 2025 www.tearrese archnetwork.com Amorim et al., 2022 Chatterjee and Singh, 2023 Cross et al., 2023 Gijs et al., 2025 Hefley et al., 2022 Martins et al., 2024 Shiju and Yuan, 2024 van der Merwe and Steketee, 2017 Welsh et al., 2024 Yeung et al., 2022 Shiju and Yuan, 2024 10. Nervous control and secretion mechanism Apocrine gland cells are activated by sexual arousal and emotional stress ( Hu et al., 2018 Slominski et al., 2012 Sack et al., 2005 2007 Apocrine sweat glands are innervated by sympathetic nerve fibers originating from the same spinal cord segments as the eccrine glands ( Sato, 1993 Groscurth, 2002 Harker, 2013 Robertshaw, 1974 Lindsay et al., 2008 Harker, 2013 Ishikawa et al., 1998 Seifert and Spitznas (1999) Sato et al., 2022 11. Homeostasis and wound healing It has long been suggested that the sweat duct may serve as a “matrix for replacement” of glandular cells ( Lobnitz et al., 1954 Ito et al., 2005 Levy et al., 2007 Nowak et al., 2008 Snippert et al., 2010 Biedermann et al., 2010 Brouard and Barrandon, 2003 Lu and Fuchs, 2014 There is a particularly large amount of knowledge about the homeostasis and wound healing of eccrine sweat glands from the mouse ( Lu and Fuchs, 2014 Lu and Fuchs, 2014 Lin and Lu, 2021 Lu and Fuchs, 2014 Lu and Fuchs, 2014 Lu and Fuchs, 2014 Yuan et al., 2023 Ikeda (1953) Table 1 12. Pathological states A deeper understanding of the Moll gland function is also desirable from a clinical point of view. It is well known that bacterial inflammation of a Moll gland, as well as bacterial inflammation of a Zeis or Meibomian gland, leads to hordeulum externum ( Sun et al., 2019 Barker-Griffith et al., 2006 Eiger-Moscovich et al., 2019 Jakobiec and Zakka, 2011 Dusseldorp, 1929 Gates et al., 1943 Hagedoorn, 1937 Seregard, 1993 Stout and Cooley, 1951 Whorton and Patterson, 1955 Zeeman, 1923 Rosales Santillan et al., 2019 Rosales Santillan et al., 2019 13. Conclusions and future perspectives This review makes it clear that our knowledge of the Moll glands, which occupy a considerable volume in the eyelids, is extremely limited. Despite their obvious importance, there is basically only descriptive information on their morphology and some cellular contents/secretion products. The rest is speculation and no reliable data regarding their functions. Further research, especially basic science studies, is essential to gain a deeper understanding. In addition, clinical morphologic studies are crucial to investigate whether changes in the Moll glands are associated with common eye diseases such as dry eye disease and meibomian gland dysfunction. These diseases are known to disrupt the tear film and affect the overall health of the eye. Understanding the effects on the Moll glands and vice versa could provide valuable insight into the contribution of the glands to these pathologies and could also provide indications of good biomarkers. Deeper insights would also potentially help to better understand changes and diseases of eyelashes and the lid margin and help identify potential therapeutic targets to improve ocular surface health. This would also be highly desirable in view of the large amount of lifestyle products used on the eyelid margin and eye ( Craig et al., 2023 Possible questions that could advance Moll gland research would be, for example, to clarify which animals would be useful for experimental studies. Apart from those studied by Ikeda (1953) Table 1 ex vivo Ikeda (1953) Hisey et al., 2023 In summary, we can say that our review article has shed some light on the person who gave the Moll glands their name, that we however know much to less about the Moll glands themselves and that great efforts are needed to be made to close this knowledge gap as quickly as possible. Supplementary Material Supplemental figures 1-3 Acknowledgments The authors would like to gratefully thank Arie van Oosterwijk for the help with the historical data and Jörg Pekarsky from the Institute of Functional and Clinical Anatomy at FAU for the creation of the graphic illustrations. We would also like to thank Andrea Eichhorn and Elke Kretschmar for their help in preparing histological and transmission electron micrographs. Histological and transmission electron micrographs in Figs. 5 7 Funding Partly supported by DFG grant PA738/15-2 (F.P.) from the Deutsche Forschungsgemeinschaft (German Research Foundation). The Funding organizations had no role in the design or conduct of this research. This study has been also partially supported by NIH/NEI R01EY035333 (HPM, CSdP), NIH/NEI R01EY026202 (HPM). Conflicts of interest The authors declare no conflict of interest. The funders had no role in the design of the study; in the collection, analyses, or interpretation of data; in the writing of the manuscript; or the decision to publish the results. CRediT authorship contribution statement Michael Stopfer: Ingrid Zahn: Katharina Jüngert: Gerhard Aumüller: Frans L. Moll: Martin Schicht: Helen P. Makarenkova: Cintia S. de Paiva: Friedrich P. Paulsen: Informed consent statement The study was conducted in accordance with the Declaration of Helsinki. Declaration of generative AI and AI-assisted technologies in the writing process During the preparation of this work the author(s) used DeepL ( deepl.com 1 Franciscus (Frans) Cornelius Donders (27.05.1818–24.03.1889) was a Dutch physiologist, anatomist and ophthalmologist. He held a professorship in physiology in Utrecht and was internationally recognized as an authority on eye diseases. He headed the Netherlands Hospital for Eye Patients. Together with Albrecht von Graefe (22.05.1828–20.07.1870/Berlin/Germany) and Hermann von Helmholtz (31.08.1821–08.09.1894/Berlin/Germany), he was one of the founders of science-based ophthalmology and, together with his friend Albrecht von Graefe, founded the first scientific eye journal ‘Archiv für Augenheilkunde’, which Donders and Ferdinand von Arlt (18.04.1812–07.03.1887/Prague/Czech and Vienna/Austria) renamed Graefe’s Archiv für Augenheilkunde after the death of Graefe (today Graefe’s Archiv for Clinical and Experimental Ophthalmology). Appendix A. Supplementary data Supplementary data https://doi.org/10.1016/j.preteyeres.2025.101362 Data availability Data will be made available on request. Data availability statement All data presented in this study are available on request from the corresponding author (F.P.). References Amorim M Martins B Caramelo F Gonçalves C Trindade G Simão J Barreto P Marques I Leal EC Carvalho E Reis F Ribeiro-Rodrigues T Girão H Rodrigues-Santos P Farinha C Ambrósio AF Silva R Fernandes R 2022 Putative biomarkers in tears for diabetic retinopathy diagnosis Front. Med 9 873483 10.3389/fmed.2022.873483 PMC9174990 35692536 Asahina M Poudel A Hirano S 2015 Sweating on the palm and sole: physiological and clinical relevance. Clinical autonomic research Off. J. Clin. Autonom. Res. Soc 25 3 153 159 10.1007/s10286-015-0282-1 25894655 Ask F 1908 Über die Entwicklung der Lidränder, der Tränenkarunkel und der Nickhaut beim Menschen, nebst Bemerkungen zur Entwicklung der Tränenableitungswege Anatomische Hefte von Merkel und Bonnet 109 Aumond S Bitton E 2018 The eyelash follicle features and anomalies: a review J. Optometr 11 4 211 222 10.1016/j.optom.2018.05.003 PMC6147748 30017866 Baker LB 2019 Physiology of sweat gland function: the roles of sweating and sweat composition in human health Temperature (Austin) 6 3 211 259 31608304 10.1080/23328940.2019.1632145 PMC6773238 Barker-Griffith AE Streeten BW Charles NC 2006 Moll gland neoplasms of the eyelid: a clinical and pathological spectrum in 5 cases Arch. Ophthalmol 124 11 1645 1649 Chicago, Ill 17102015 10.1001/archopht.124.11.1645 Beer GM Baumüller S Zech N Wyss P Strasser D Varga Z Seifert B Hafner J Mihic-Probst D 2006 Immunohistochemical differentiation and localization analysis of sweat glands in the adult human axilla Plast. Reconstr. Surg 117 6 2043 2049 16651982 10.1097/01.prs.0000210681.90799.b1 Beier K Ginez I Schaller H 2005 Localization of steroid hormone receptors in the apocrine sweat glands of the human axilla Histochem. Cell Biol 123 1 61 65 15609040 10.1007/s00418-004-0736-3 Biedermann T Pontiggia L Böttcher-Haberzeth S Tharakan S Braziulis E Schiestl C Meuli M Reichmann E 2010 Human eccrine sweat gland cells can reconstitute a stratified epidermis J. Invest. Dermatol 130 8 1996 2009 20376062 10.1038/jid.2010.83 Biernat MM Rusiecka-Ziółkowska J Piątkowska E Helemejko I Biernat P Gościniak G 2018 Occurrence of Demodex species in patients with blepharitis and in healthy individuals: a 10-year observational study Jpn. J. Ophthalmol 62 6 628 633 30255395 10.1007/s10384-018-0624-3 Brouard M Barrandon Y 2003 Controlling skin morphogenesis: hope and despair Curr. Opin. Biotechnol 14 5 520 525 14580583 10.1016/j.copbio.2003.09.005 Chatterjee A Singh R 2023 Extracellular vesicles: an emerging player in retinal homeostasis Front. Cell Dev. Biol 11 1059141 37181750 10.3389/fcell.2023.1059141 PMC10166895 Cheng AM Hwang J Dermer H Galor A 2021 Prevalence of ocular demodicosis in an older population and its association with symptoms and signs of dry eye Cornea 40 8 995 1001 32956104 10.1097/ICO.0000000000002542 PMC7981278 Cheng AMS Sheha H Tseng SCG 2015 Recent advances on ocular Demodex infestation Curr. Opin. Ophthalmol 26 4 295 300 26058028 10.1097/ICU.0000000000000168 Contino A 1907 Über Bau und Entwicklung des Lidrandes beim Menschen Graefes Arhiv für Ophthalmologie (Albrecht von Graefes Archiv für Ophthalmologie) 66 3 505 577 Cowley JJ Brooksbank BW 1991 Human exposure to putative pheromones and changes in aspects of social behaviour J. Steroid Biochem. Mol. Biol 39 4B 647 659 1892794 10.1016/0960-0760(91)90264-6 Craig JP Alves M Wolffsohn JS Downie LE Efron N Galor A Gomes JAP Jones L Markoulli M Stapleton F Starr CE Sullivan AG Willcox MDP Sullivan DA 2023 TFOS lifestyle report executive summary: a lifestyle epidemic - ocular surface disease Ocul. Surf 30 240 253 37659474 10.1016/j.jtos.2023.08.009 Craig JP Nichols KK Akpek EK Caffery B Dua HS Joo C-K Liu Z Nelson JD Nichols JJ Tsubota K Stapleton F 2017 TFOS DEWS II definition and classification report Ocul. Surf 15 3 276 283 28736335 10.1016/j.jtos.2017.05.008 Cross T Øvstebø R Brusletto BS Trøseid A-MS Olstad OK Aspelin T Jackson CJ Chen X Utheim TP Haug KBF 2023 RNA profiles of tear fluid extracellular vesicles in patients with dry eye-related symptoms Int. J. Mol. Sci 24 20 10.3390/ijms242015390 PMC10607363 37895069 Cutler WB Friedmann E McCoy NL 1998 Pheromonal influences on sociosexual behavior in men Arch. Sex. Behav 27 1 1 13 9494686 10.1023/a:1018637907321 Dusseldorp M 1929 Adenocarcinoma de glandula de Moll 999 1006 Eggeling v. 1904 Zur Morphologie der Augenlider der Säuger Jenaische Zeitschrift für Naturwissenschaft 39 1 42 Eiger-Moscovich M Zhang PJL Lally SE Shields CL Eagle RC Milman T 2019 Tubular apocrine adenoma of the eyelid - a case report and literature review Saudi J. Ophthalmol. : Off. J. Saudi Ophthalmol. Soc 33 3 304 307 10.1016/j.sjopt.2019.07.005 PMC6819710 31686976 Fromstein SR Harthan JS Patel J Opitz DL 2018 Demodex blepharitis: clinical perspectives Clin. Optom 10 57 63 10.2147/OPTO.S142708 PMC6118860 30214343 Garreis F Gottschalt M Paulsen FP 2010 Antimicrobial peptides as a major part of the innate immune defense at the ocular surface Dev. Ophthalmol 45 16 22 20502023 10.1159/000315016 Garreis F Jahn J Wild K Abrar DB Schicht M Schröder J-M Paulsen F 2017 Expression and regulation of S100 fused-type protein hornerin at the ocular surface and lacrimal apparatus Investig. Ophthalmol. Vis. Sci 58 13 5968 5977 29183042 10.1167/iovs.17-22637 Gates O Warren S Warvi WN 1943 Tumors of sweat glands Am. J. Pathol 19 4 591 631 19970710 PMC2033085 Gelstein S Yeshurun Y Rozenkrantz L Shushan S Frumin I Roth Y Sobel N 2011 Human tears contain a chemosignal Science (New York, N.Y.) 331 6014 226 230 21212322 10.1126/science.1198331 Gijs M van de Sande N Bonnet C Schmeetz J Fernandes R Travé-Huarte S Huertas-Bello M Bo Chiang JC Boychev N Sharma S 2025 A comprehensive scoping review of methodological approaches and clinical applications of tear fluid biomarkers Prog. Retin. Eye Res 101338 39954936 10.1016/j.preteyeres.2025.101338 Groscurth P 2002 Anatomy of sweat glands Kreyden O Böni R Burg G Hyperhidrosis and Botulinum Toxin in Dermatology Karger Medical and Scientific Publishers 1 9 Grosser BI Monti-Bloch L Jennings-White C Berliner DL 2000 Behavioral and electrophysiological effects of androstadienone, a human pheromone Psychoneuroendocrinology 25 3 289 299 10737699 10.1016/s0306-4530(99)00056-6 Hagedoorn A 1937 Paget’s disease of the eyelid associated with carcinoma Br. J. Ophthalmol 21 5 234 241 18169447 10.1136/bjo.21.5.234 PMC1142791 Harker M 2013 Psychological sweating: a systematic review focused on aetiology and cutaneous response Skin Pharmacol. Physiol 26 2 92 100 23428634 10.1159/000346930 Hashimoto K 1970 The ultrastructure of the skin of human embryos. VII. Formation of the apocrine gland Acta Derm. Venereol 50 4 241 251 4195857 Hefley BS Deighan C Vasini B Khan A Hjortdal J Riaz KM Liu Y Karamichos D 2022 Revealing the presence of tear extracellular vesicles in Keratoconus Exp. Eye Res 224 109242 36084727 10.1016/j.exer.2022.109242 PMC10159047 Henle J 1871 Handbuch der systematischen Anatomie des Menschen Friedrich Vieweg, Braunschweig Hisey EA Galor A Leonard BC 2023 A comparative review of evaporative dry eye disease and meibomian gland dysfunction in dogs and humans Vet. Ophthalmol 26 Suppl. 1 16 30 36786010 10.1111/vop.13066 PMC10175238 Hoepke H 1927 Die haut Möllendorff W. von Bargmann W Handbuch der mikroskopischen Anatomie des Menschen 29 Bände. Springer, Berlin. Hu Y Converse C Lyons MC Hsu WH 2018 Neural control of sweat secretion: a review Br. J. Dermatol 178 6 1246 1256 28714085 10.1111/bjd.15808 Hwang K Baik SH 1997 Distribution of hairs and sweat glands on the bodies of Korean adults: a morphometric study Acta Anat 158 2 112 120 9311420 10.1159/000147920 Ikeda M 1953 Über die Ciliardrüsen der Säugetiere Okajimas Folia Anat. Jpn 163 168 13145184 10.2535/ofaj1936.25.4_163 Ishikawa Y Eguchi T Skowronski MT Ishida H 1998 Acetylcholine acts on M3 muscarinic receptors and induces the translocation of aquaporin5 water channel via cytosolic Ca2+ elevation in rat parotid glands Biochem. Biophys. Res. Commun 245 3 835 840 9588201 10.1006/bbrc.1998.8395 Ito M Liu Y Yang Z Nguyen J Liang F Morris RJ Cotsarelis G 2005 Stem cells in the hair follicle bulge contribute to wound repair but not to homeostasis of the epidermis Nat. Med 11 12 1351 1354 16288281 10.1038/nm1328 Ito T 1988 Morphological connections of the human apocrine and eccrine sweat gland–occurrence of the so-called “mixed sweat glands”–a review Okajimas Folia Anat. Jpn 65 5 315 335 3075729 10.2535/ofaj1936.65.5_315 Jäger F Paulsen F Bergua A Jungbauer R Hammer CM 2022a Immunohistochemical detection of urea transporter-A in the tear-producing part of the lacrimal system Ann. Anatom. = Anatomisch. Anzeig. : Off. Organ Anatomische Gesellschaft 244 151991 10.1016/j.aanat.2022.151991 35987427 Jäger F Paulsen F Bergua A Jungbauer R Hammer CM 2022b Urea transporter-B expression on the ocular surface and in the lacrimal glands Ann. Anatom. = Anatomisch. Anzeig. : Off. Organ Anatomische Gesellschaft 243 151954 10.1016/j.aanat.2022.151954 35537669 Jakobiec FA Zakka FR 2011 A reappraisal of eyelid eccrine and apocrine hidrocystomas: microanatomic and immunohistochemical studies of 40 lesions Am. J. Ophthalmol 151 2 358 74.e2 21168812 10.1016/j.ajo.2010.08.028 Kashio M Derouiche S Yoshimoto RU Sano K Lei J Kido MA Tominaga M 2024 Involvement of TRPV4 in temperature-dependent perspiration in mice Elife 13 10.7554/eLife.92993 PMC11223765 38963781 Khan S Fitch S Knox S Arora R 2022 Exocrine gland structure-function relationships Development (Cambridge, England) 149 1 10.1242/dev.197657 34989394 Knop E Knop N Millar T Obata H Sullivan DA 2011 The international workshop on meibomian gland dysfunction: report of the subcommittee on anatomy, physiology, and pathophysiology of the meibomian gland Investig. Ophthalmol. Vis. Sci 52 4 1938 1978 21450915 10.1167/iovs.10-6997c PMC3072159 Kölliker A. von 1850 Mikroskopische Anatomie oder Gewebelehre des Menschen. 2,2, Specielle Gewebelehre. 2. Hälfte: Von den Verdauungs-, Respirations-, Harn- und Geschlechtsorganen, vom Gefässsystem und den höhern Sinnesorganen Engelmann Verlag, Leipzig Königstein L 1884 Histologische notizen Arch. Ophthalmol 30 1 Chicago, Ill Levy V Lindon C Zheng Y Harfe BD Morgan BA 2007 Epidermal stem cells arise from the hair follicle after wounding FASEB J. : Off Publ. Federat. Am. Soc. Experiment. Biol 21 7 1358 1366 10.1096/fj.06-6926com 17255473 Lin M-J Lu CP-J 2021 Glandular stem cells in the skin during development, homeostasis, wound repair and regeneration Exp. Dermatol 30 4 598 604 33686662 10.1111/exd.14319 Lindsay SL Holmes S Corbett AD Harker M Bovell DL 2008 Innervation and receptor profiles of the human apocrine (epitrichial) sweat gland: routes for intervention in bromhidrosis Br. J. Dermatol 159 3 653 660 18637900 10.1111/j.1365-2133.2008.08740.x Liotet S Riera M Nguyen H 1977 Les cils. Physiologie, structure, pathologie Arch. Ophtalmol 37 11 697 708 147666 Lobnitz W Holyoke J Montagna W 1954 Responses of the human eccrine sweat duct to controlled injury: growth center of the epidermal sweat duct unit J. Invest. Dermatol 23 5 329 344 13212169 10.1038/jid.1954.116 Lu C Fuchs E 2014 Sweat gland progenitors in development, homeostasis, and wound repair Cold Spring Harb. Perspect. Med 4 2 10.1101/cshperspect.a015222 PMC3904096 24492848 Lu CP Polak L Keyes BE Fuchs E 2016 Spatiotemporal antagonism in mesenchymal-epithelial signaling in sweat versus hair fate decision Science (New York, N.Y.) 354 6319 10.1126/science.aah6102 PMC5333576 28008008 Lu CP Polak L Rocha AS Pasolli HA Chen S-C Sharma N Blanpain C Fuchs E 2012 Identification of stem cell populations in sweat glands and ducts reveals roles in homeostasis and wound repair Cell 150 1 136 150 22770217 10.1016/j.cell.2012.04.045 PMC3423199 Lüllmann-Rauch R Asan E 2024 Taschenlehrbuch histologie, 7. Vollständig Überarbeitete, Auflage ed Thieme, Stuttgart Marieb EN Hoehn K Dubé S 2005 Anatomie et physiologie humaines. Éditions du Renouveau pédagogique- Pearson education, Montréal (Québec) Martins B Pires M Ambrósio AF Giräo H Fernandes R 2024 Contribution of extracellular vesicles for the pathogenesis of retinal diseases: shedding light on blood-retinal barrier dysfunction J. Biomed. Sci 31 1 48 38730462 10.1186/s12929-024-01036-3 PMC11088087 McDermott AM 2009 The role of antimicrobial peptides at the ocular surface Ophthalmic Res 41 2 60 75 19122467 10.1159/000187622 PMC3712804 McEwan Jenkinson D Elder HY Bovell DL 2006 Equine sweating and anhidrosis Part 1–equine sweating Vet. Dermatol 17 6 361 392 17083570 10.1111/j.1365-3164.2006.00545.x Messmer EM 2009 Emotionale Tränen. Der Ophthalmologe : Zeitschrift der Deutschen Ophthalmologischen Gesellschaft 106 7 593 602 10.1007/s00347-009-1966-5 19568753 Moll JA 1857 Bijdragen tot de Anatomie en Physiologie der Oogenleden Dissertation, Utrecht Moll JA 1858 Bemerkungen über den Bau der Augenlider des Menschen Arlt F Donders FC A von Graefe A Archiv für Ophthalmologie Anatiposi Verlag Montagna W 1992 Atlas of Normal Human Skin Springer, New York New York, NY Montagna W Ford DM 1969 Histology and cytochemistry of human skin. 3. The eyelid Arch. Dermatol 100 3 328 335 5822379 Monti-Bloch L Jennings-White C Berliner DL 1998 The human vomeronasal system A review. Ann. N. Y. Acad. Sci 855 373 389 9929629 10.1111/j.1749-6632.1998.tb10595.x Murube J 2009a Basal, reflex, and psycho-emotional tears Ocul. Surf 7 2 60 66 19383274 10.1016/s1542-0124(12)70296-3 Murube J 2009b Hypotheses on the development of psychoemotional tearing Ocul. Surf 7 4 171 175 19948100 10.1016/s1542-0124(12)70184-2 Murube J Murube L Murube A 1999 Origin and types of emotional tearing Eur. J. Ophthalmol 9 2 77 84 10435417 10.1177/112067219900900201 Muschler J Streuli CH 2010 Cell-matrix interactions in mammary gland development and breast cancer Cold Spring Harbor Perspect. Biol 2 10 a003202 10.1101/cshperspect.a003202 PMC2944360 20702598 Na JI Kwon OS Kim BJ Park WS Oh JK Kim KH Cho KH Eun HC 2006 Ethnic characteristics of eyelashes: a comparative analysis in Asian and Caucasian females Br. J. Dermatol 155 6 1170 1176 17107385 10.1111/j.1365-2133.2006.07495.x Nagymihályi A Dikstein S Tiffany JM 2004 The influence of eyelid temperature on the delivery of meibomian oil Exp. Eye Res 78 3 367 370 15106914 10.1016/s0014-4835(03)00197-0 Nowak JA Polak L Pasolli HA Fuchs E 2008 Hair follicle stem cells are specified and function in early skin morphogenesis Cell Stem Cell 3 1 33 43 18593557 10.1016/j.stem.2008.05.009 PMC2877596 Peter K Horn G 1935 Die Gestalt der Stoffdrüsen des Menschen nach Plattenmodellen Z. für Mikroskopisch-Anatomische Forsch. (Leipz.) 38 Precone V Paolacci S Beccari T Dalla Ragione L Stuppia L Baglivo M Guerri G Manara E Tonini G Herbst KL Unfer V Bertelli M 2020 Pheromone receptors and their putative ligands: possible role in humans Eur. Rev. Med. Pharmacol. Sci 24 4 2140 2150 32141584 10.26355/eurrev_202002_20394 Preti G Leyden JJ 2010 Genetic influences on human body odor: from genes to the axillae J. Invest. Dermatol 130 2 344 346 20081888 10.1038/jid.2009.396 Requena L Kiryu H Ackerman AB 1998 Neoplasms with Apocrine Differentiation Lippincott-Raven Philadelphia, PA Rhee MK Yeu E Barnett M Rapuano CJ Dhaliwal DK Nichols KK Karpecki P Mah FS Chan A Mun J Gaddie IB 2023 Demodex blepharitis: a comprehensive review of the disease, current management, and emerging therapies Eye Contact Lens 49 8 311 318 37272680 10.1097/ICL.0000000000001003 PMC10351901 Robertshaw D 1974 Proceedings: neural and humoral control of apocrine glands J. Invest. Dermatol 63 1 160 167 4152036 10.1111/1523-1747.ep12679280 Rosales Santillan M Tschen JA Soparkar CN 2019 Apocrine adenocarcinoma of the eyelid: case report and literature review on management Dermatol. Online J 25 5 31220897 Rosenfeld L Cerretani C Leiske DL Toney MF Radke CJ Fuller GG 2013 Structural and rheological properties of meibomian lipid Investig. Ophthalmol. Vis. Sci 54 4 2720 2732 23513065 10.1167/iovs.12-10987 Sack R Conradi L Beaton A Sathe S McNamara N Leonardi A 2007 Antibody array characterization of inflammatory mediators in allergic and normal tears in the open and closed eye environments Exp. Eye Res 85 4 528 538 17719576 10.1016/j.exer.2007.07.004 Sack RA Conradi L Krumholz D Beaton A Sathe S Morris C 2005 Membrane array characterization of 80 chemokines, cytokines, and growth factors in open- and closed-eye tears: angiogenin and other defense system constituents Investig. Ophthalmol. Vis. Sci 46 4 1228 1238 15790883 10.1167/iovs.04-0760 Sato A Yajima T Tachiya D Ichikawa H Sato T 2022 Innervation of the human minor salivary glands; immunohistochemical study for neurochemical substances Tissue Cell 79 101934 36126414 10.1016/j.tice.2022.101934 Sato K 1993 Biology of the eccrine sweat gland Freedberg IM Fitzpatrick TB Fitzpatrick’s Dermatology in General Medicine McGraw-Hill Health Professions Division New York Sato K Kang WH Saga K Sato KT 1989 Biology of sweat glands and their disorders. I. Normal sweat gland function J. Am. Acad. Dermatol 20 4 537 563 2654204 10.1016/s0190-9622(89)70063-3 Sato K Leidal R Sato F 1987 Morphology and development of an apoeccrine sweat gland in human axillae Am. J. Physiol 252 1 Pt 2 R166 R180 3812728 10.1152/ajpregu.1987.252.1.R166 Sattler H 1877 Beitrag zur Kenntniss der modificierten Moll’schen Schweissdrüsen des Lidrandes George St Waldeyer W Archiv für Mikroskopische Anatomie 13 788 795 Schaffer J 1940 Die Hautdrüsenorgane der Säugetiere : mit besonderer Berücksichtigung ihres histologischen Aufbaues und Bemerkungen über die Proktodäaldrüsen Urban & Schwarzenberg Berlin Schicht M Garreis F Hartjen N Beileke S Jacobi C Sahin A Holland D Schröder H Hammer CM Paulsen F Bräuer L 2018 SFTA3 - a novel surfactant protein of the ocular surface and its role in corneal wound healing and tear film surface tension Sci. Rep 8 1 9791 29955092 10.1038/s41598-018-28005-9 PMC6023927 Schmidt-Nielsen K Schmidt-Nielsen B Jarnum SA Houpt TR 1957 Body temperature of the camel and its relation to water economy Am. J. Physiol 188 1 103 112 13402948 10.1152/ajplegacy.1956.188.1.103 Seifert P Spitznas M 1999 Vasoactive intestinal polypeptide (VIP) innervation of the human eyelid glands Exp. Eye Res 68 6 685 692 10375432 10.1006/exer.1999.0652 Seregard S 1993 Apocrine adenocarcinoma arising in Moll gland cystadenoma Ophthalmology 100 11 1716 1719 8233400 10.1016/s0161-6420(93)31412-0 Shehadeh N Kligman AM 1963 The bacteria responsible for axillary odor J. Invest. Dermatol 41 39 43 14043010 Shiju TM Yuan A 2024 Extracellular vesicle biomarkers in ocular fluids associated with ophthalmic diseases Exp. Eye Res 241 109831 38401855 10.1016/j.exer.2024.109831 Shinohara K Morofushi M Funabashi T Mitsushima D Kimura F 2000 Effects of 5alpha-androst-16-en-3alpha-ol on the pulsatile secretion of luteinizing hormone in human females Chem. Senses 25 4 465 467 10944511 10.1093/chemse/25.4.465 Shirokova E Raguse JD Meyerhof W Krautwurst D 2008 The human vomeronasal type-1 receptor family–detection of volatiles and cAMP signaling in HeLa/Olf cells FASEB J. : Off Publ. Federat. Am. Soc. Experiment. Biol 22 5 1416 1425 10.1096/fj.07-9233com 18096815 Singh S Hammer CM Paulsen F 2024 New insights into the anatomy of the eyelashes with regard to ethnic differences against a clinical background Ophthalmic Plast. Reconstr. Surg 40 1 99 103 37995151 10.1097/IOP.0000000000002533 Slominski AT Zmijewski MA Skobowiat C Zbytek B Slominski RM Steketee JD 2012 Sensing the environment: regulation of local and global homeostasis by the skin’s neuroendocrine system Adv. Anat. Embryol. Cell Biol 212 1 115 10.1007/978-3-642-19683-6_1 PMC3422784 22894052 Snippert HJ Haegebarth A Kasper M Jaks V van Es JH Barker N van de Wetering M van den Born M Begthel H Vries RG Stange DE Toftgård R Clevers H 2010 Lgr6 marks stem cells in the hair follicle that generate all cell lineages of the skin Science (New York, N.Y.) 327 5971 1385 1389 20223988 10.1126/science.1184733 Sobel N Prabhakaran V Hartley CA Desmond JE Glover GH Sullivan EV Gabrieli JD 1999 Blind smell: brain activation induced by an undetected air-borne chemical Brain : J. Neurol 122 Pt 2 209 217 10.1093/brain/122.2.209 10071050 Stern K McClintock MK 1998 Regulation of ovulation by human pheromones Nature 392 6672 177 179 9515961 10.1038/32408 Stern ME Gao J Siemasko KF Beuerman RW Pflugfelder SC 2004 The role of the lacrimal functional unit in the pathophysiology of dry eye Exp. Eye Res 78 3 409 416 15106920 10.1016/j.exer.2003.09.003 Stoeckelhuber M Matthias C Andratschke M Stoeckelhuber BM Koehler C Herzmann S Sulz A Welsch U 2006 Human ceruminous gland: ultrastructure and histochemical analysis of antimicrobial and cytoskeletal components Anat. Rec. Part A, Discoveries in molecular, cellular, and evolutionary biology 288 8 877 884 10.1002/ar.a.20356 16835926 Stoeckelhuber M Messmer EM Schubert C Stoeckelhuber BM Koehler C Welsch U Bals R 2008 Immunolocalization of defensins and cathelicidin in human glands of Moll Ann. Anatom. = Anatomisch. Anzeig. : Off. Organ Anatomische Gesellschaft 190 3 230 237 10.1016/j.aanat.2007.12.001 18396392 Stoeckelhuber M Stoeckelhuber BM Welsch U 2003 Human glands of Moll: histochemical and ultrastructural characterization of the glands of Moll in the human eyelid J. Invest. Dermatol 121 1 28 36 12839560 10.1046/j.1523-1747.2003.12328.x Stoeckelhuber M Stoeckelhuber BM Welsch U 2004 Apocrine glands in the eyelid of primates contribute to the ocular host defense Cells Tissues Organs 176 4 187 194 15118398 10.1159/000077035 Stout AP Cooley SGE 1951 Carcinoma of sweat glands Cancer 4 3 521 536 14839609 10.1002/1097-0142(195105)4:3<521::aid-cncr2820040306>3.0.co;2-e Sun MT Huang S Huilgol SC Selva D 2019 Eyelid lesions in general practice Austr.J. General Pract 48 8 509 514 10.31128/AJGP-03-19-4875 31370126 Szabo G 1967 The regional anatomy of the human integument with special reference to the distribution of hair follicles, sweat glands and melanocytes Phil. Trans. Roy. Soc. Lond. B 252 779 447 485 Tabara T 1953 Genetische Untersuchung der Moll’schen Drüsen der menschlichen Embryonen Kaibogaku Zasshi 5 Takahashi Y Watanabe A Matsuda H Nakamura Y Nakano T Asamoto K Ikeda H Kakizaki H 2013 Anatomy of secretory glands in the eyelid and conjunctiva: a photographic review Ophthalmic Plast. Reconstr. Surg 29 3 215 219 23381567 10.1097/IOP.0b013e3182833dee Tartuferi F 1879 Le glandule di Moll studiate nelle palpebre dell’ uomo e degli altri mammiferi e comparate alle tubulari cutanee Arch. delle scienze mediche IV 323 Terada O Chiba K Senoo T Obara Y 2004 Ocular surface temperature of meibomia gland dysfunction patients and the melting point of meibomian gland secretions Nippon. Ganka Gakkai Zasshi 108 11 690 693 15584354 Trattler W Karpecki P Rapoport Y Sadri E Schachter S Whitley WO Yeu E 2022 The prevalence of Demodex blepharitis in US eye care clinic patients as determined by collarettes: a pathognomonic sign Clin. Ophthalmol 16 1153 1164 35449733 10.2147/OPTH.S354692 PMC9017705 van der Merwe Y Steketee MB 2017 Extracellular vesicles: biomarkers, therapeutics, and vehicles in the visual system Curr. Ophthalmol. Rep 5 4 276 282 29399421 10.1007/s40135-017-0153-0 PMC5780545 van der Putte SC 1993 Ultrastructure of the human anogenital “sweat” gland Anat. Rec 235 4 583 590 8465990 10.1002/ar.1092350411 Virchow H 1922 Mikroskopische Anatomie der äußeren Augenhaut und des Lidapparates Graefe AK Handbuch der Gesamten Augenheilkunde 2 ed. Springer, Berlin/Heidelberg Berlin, Heidelberg Waldeyer W 1874 Mikroskopische Anatomie der Lider und Konjunktiva Graefe AK Saemisch T Handbuch der gesamten Augenheilkunde 1 ed. Springer, Berlin/Heidelberg Berlin, Heidelberg Watson CJ Khaled WT 2008 Mammary development in the embryo and adult: a journey of morphogenesis and commitment Development (Cambridge, England) 135 6 995 1003 18296651 10.1242/dev.005439 Welsch U van Dyk G Moss D Feuerhake F 1998 Cutaneous glands of male and female impalas (Aepyceros melampus): seasonal activity changes and secretory mechanisms Cell Tissue Res 292 2 377 394 9560480 10.1007/s004410051068 Welsh JA Goberdhan DCI O’Driscoll L Buzas EI Blenkiron C Bussolati B Cai H Di Vizio D Driedonks TAP Erdbrügger U Falcon-Perez JM Fu Q-L Hill AF Lenassi M Lim SK Mahoney MG Mohanty S Möller A Nieuwland R Ochiya T Sahoo S Torrecilhas AC Zheng L Zijlstra A Abuelreich S Bagabas R Bergese P Bridges EM Brucale M Burger D Carney RP Cocucci E Crescitelli R Hanser E Harris AL Haughey NJ an Hendrix Ivanov AR Jovanovic-Talisman T Kruh-Garcia NA Ku’ulei-Lyn Faustino V Kyburz D Lässer C Lennon KM Lötvall J Maddox AL Martens-Uzunova ES Mizenko RR Newman LA Ridolfi A Rohde E Rojalin T Rowland A Saftics A Sandau US Saugstad JA Shekari F Swift S Ter-Ovanesyan D Tosar JP Useckaite Z Valle F Varga Z van der Pol E van Herwijnen MJC Wauben MHM Wehman AM Williams S Zendrini A Zimmerman AJ Théry C Witwer KW 2024 Minimal information for studies of extracellular vesicles (MISEV2023): from basic to advanced approaches J. Extracell. Vesicles 13 2 e12404 38326288 10.1002/jev2.12404 PMC10850029 Whorton CM Patterson JB 1955 Carcinoma of moll’s glands with extramammary paget’s disease of the eyelid Cancer 8 5 1009 1015 13261058 10.1002/1097-0142(1955)8:5<1009::aid-cncr2820080525>3.0.co;2-i Wilke K Martin A Terstegen L Biel SS 2007 A short history of sweat gland biology Int. J. Cosmet. Sci 29 3 169 179 18489347 10.1111/j.1467-2494.2007.00387.x Yasui T Tsukise A Nara T Kuwahara Y Meyer W 2006 Morphological, histochemical and immunohistochemical characterization of secretory production of the ciliary glands in the porcine eyelid Eur. J. Histochem. : EJH 50 2 99 108 16864120 Yeu E Garg S Ayres BD Beckman K Chamberlain W Lee B Raju L Rao N Rocha KM Schallhorn J Zavodni Z Mah FS Farid M 2024 Current state and future perspectives in the diagnosis of eyelid margin disease: clinical review J. Cataract Refract. Surg 50 8 868 875 38758201 10.1097/j.jcrs.0000000000001483 Yeung V Boychev N Farhat W Ntentakis DP Hutcheon AEK Ross AE Ciolino JB 2022 Extracellular vesicles in corneal fibrosis/scarring Int. J. Mol. Sci 23 11 10.3390/ijms23115921 PMC9180085 35682600 Yuan X Duan X Enhejirigala Li Z Yao B Song W Wang Y Kong Y Zhu S Zhang F Liang L Zhang M Zhang C Kong D Zhu M Huang S Fu X 2023 Reciprocal interaction between vascular niche and sweat gland promotes sweat gland regeneration Bioact. Mater 21 340 357 36185745 10.1016/j.bioactmat.2022.08.021 PMC9483744 Zeeman WPC 1923 Hydatis en carcinoma van een klier van moll Ned. Tijdschr. Geneeskd 67 1194 1198 Zietzschmann O 1904 Vergleichend histologische Untersuchungen über den Bau der Augenlider der Haussäugetiere Albr. Graefe’s Arch. Ophthalmol 58 61 122 Fig. 1. Jacob Anthonie Moll aged around 65, private property of the Moll family (Jaap Moll, second cousin of coauthor Frans Moll). At the bottom reference to the portrait painter: “painted by Dora Aried Paschied ? in Kiel. Fig. 2. Family tree of Jacob Antonie Moll (shown in bold). [The youngest son of Jacob Anthonie Moll after whom the gands of Moll are named bore the same name as hist farther]. Fig. 3. Title page of the dissertation by Jacob Anthonie Moll (1957): Translation: Contributions to the anatomy and physiology of the eyelids - Dissertation for the degree of Doctor of Medicine at the University of Utrecht - defended on March 18, 1857 by J. A. Moll - Utrecht - P.W. van de Weijer 1875. Fig. 4. Distribution of the Moll glands along the upper and lower eyelid (drawing by Jörg Pekarsky). The illustration shows that the totality of all Moll glands in the upper and lower eyelids results in an extensive glandular volume, which in its entirety accounts for more volume than the main lacrimal gland. Fig. 5. Depiction of a Moll gland (gland of Moll) on the hair funnel (epithelial root sheet). (drawing by Jörg Pekarsky) and histological representation of the secretory part of a Moll gland between the muscle fibers of the Riolan muscle. A Moll gland unit B A B Fig. 6. A illustration of an opened Moll gland with secretory part and excretory duct part. The various functional states of the Moll epithelial cells and the wide glandular lumen can be seen in the secretory part. The secretory part is surrounded by myoepithelial cells. (Drawing by Jörg Pekarsky). B C D B-D Fig. 7. Transmission electron micrographs of a Moll gland with inactive and active glandular parts. A B C D Fig. 8. Schematic representation of an eyelash with Zeis gland and Moll gland opening into the hair funnel. A B Fig. 9. To date, it is completely unknown whether Moll glands have a thermoregulatory function at all and if so whether central proteins that are important for thermoregulation in sweat glands such as the transient receptor potential cation channel subfamily V member 4 (TRPV4) channel, the voltage-gated calcium-activated anion channel anoctamine 1, the water channel aquaporins 5 and others have a thermoregulatory function for Moll glands and which nerve fibres stimulate the secretion of Moll glands. The schematic illustration shows a Moll gland in high magnification with a section magnification in which this hypothesis is shown (drawing by Jörg Pekarsky). Further research must clarify whether Moll glands are involved in maintaining the health at the lid margin and maybe also the ocular surface. Table 1 Occurrence and distribution of Moll glands in different species ( Ikeda, 1953 spezies occurrence strongest occurrence human X Middle part of upper eyelid monkey X Medial and middle part of upper eyelid cattle X Middle part of upper eyelid horse X Middle part of upper eyelid pig X Middle part of upper eyelid dog X Medial part upper eyelid cat X Medial part upper eyelid rabbit 0 guinea pig 0 rat 0 mouse 0 hamster 0 Table 2 Staining characteristics in the secretory cells of human Moll’s glands done so far with conventional dyes and lectins ( Stoeckelhuber et al., 2003 Dye Staining  Nile blue Supranuclear granules stained in active and inactive epithelial gland cells. PAS reaction Weak or negative staining in cells, strong reaction in granules and luminal material. Alcian blue (pH 2.5) Strong apical staining in inactive cells and active cell protrusions.  Lectin  Staining Canavalia ensiformis agglutinin (ConA) Weak to medium cytoplasmic staining, strong apical staining. Helix pomatia agglutinin (HPA) Medium intensity throughout the cell, strong apical staining. Ricinus communis agglutinin I (RCAI) Weak to no cytoplasmic staining, strong apical staining and luminal material. Wheat germ agglutinin (WGA) Strong apical staining in both active and inactive cells. Peanut agglutinin (PNA) Variable cytoplasmic staining, strong apical reaction. Ulex europaeus agglutinin I (UEAI) Intensive apical staining in some cells, weak cytoplasmic staining. Table 3 Proteins investigated in the secretory cells of human Moll glands. The table summarizes what is currently known about the secretion products build by Moll glands. However, whether these are actually secreted is unknown and needs to be analyzed further. Abbreviation Protein name Description Distribution in Moll’s glands References IgA Immunoglobulin A role in the immune function of mucous membranes Variable reactivity: Granular IgA in some cells, apical staining in others.  Stoeckelhuber et al. (2003) SC of IgA Secretory component of immunoglobulin A a proteolytic cleavage product of the polymeric immunoglobulin receptor which remains associated with dimeric IgA in sero-mucous secretions Strong apical reactivity and IgA-positive secretory material in the lumen.  Stoeckelhuber et al. (2003) lysozyme Lysozyme a small (14-kDa) cationic protein that exerts antibacterial activity through its ability to hydrolyze peptidoglycans in the bacterial cell wall Variable reactivity, often in granules and positive in luminal material.  Stoeckelhuber et al. (2003) MUC1 Mucin 1 role in mucus, and involvement in cell signaling Weak to medium cytoplasmic reactivity, strong apical reactivity.  Stoeckelhuber et al. (2003) AR Androgen receptor a type of nuclear receptor activated by androgenic hormones, including testosterone and dihydrotestosterone (DHT) in the cytoplasm and then translocating into the nucleus Only a few cells show positive nuclear reactivity.  Stoeckelhuber et al. (2003) ER Estrogen receptor mediates the effects of estrogenic compounds on its target tissue No nuclear reactivity  Stoeckelhuber et al. (2003) actin Actin protein that is an important contributor to the contractile property of muscle and other cells Medium to strong reactivity in all secretory cells, stronger apically in active cells.  Stoeckelhuber et al. (2003) CK19/CK7 Cytokeratin 19/7 is a 40 kDa protein that in humans is encoded by the FRT19 gene Weak to strong cytoplasmic reactivity, stronger at the base of apical protrusions.  Stoeckelhuber et al. (2003) hBD-1 Human beta-defensin 1 skin inflammation and/or skin responsiveness to any kind of allergic reactio Weak to moderate cytoplasmic reactivity, strong apical reactivity, especially in protrusions; lumen material strongly reactive; some granules react intensely in active cells.  Stoeckelhuber et al. (2004) hBD-2 Human beta-defensin 2 broad-spectrum activity against gram-positive and gram-negative bacteria and kill bacteria in a number of ways Moderate reactivity in the entire epithelium, slightly more intense in protrusions; positive luminal reactivity; fine granular pattern observed at higher magnification in active cells.  Stoeckelhuber et al. (2004) LL37 Cathelicidin belongs to a third general class of epithelial antimicrobial peptides that are expressed in epithelia and kill microorganisms by membrane disruption Moderate reactivity in the cytoplasm and protrusions; luminal material positive; some granules show intense apical reactivity in active cells.  Stoeckelhuber et al. (2004) GCDFP-15 (PIP, SABP) Gross cystic disease fliud protein-15 Prolactin-induced protein normally is found in the saliva and other bodily secretions of mammals, but can also be detected in pathological changes in the mammary glands Strong reactivity in the apocrine secretory spiral of Moll glands, no reactivity in the apocrine duct.  Jakobiec and Zakka (2011) α-SMA Alpha-smooth muscle actin is a smooth muscle protein that is responsible for cell structure, motility and contractility Strong reactivity in the apocrine secretory spiral of Moll glands, no reactivity in the apocrine duct.  Jakobiec and Zakka (2011) CK7 (KRT7) Cytokeratin 7 cytokeratin or brief keratin 7, is a type II keratin that is found in various epithelial tissues of the human body. Strong reactivity in the apocrine secretory spiral of Moll glands, no reactivity in the apocrine duct.  Jakobiec and Zakka (2011) EMA Epithelial membrane antigen immunohistological marker that is expressed by many epithelial cells; belongs to the cytokeratins;in its soluble form, which occurs in blood plasma, it is known as cancer antigen 15-3 (CA15-3) Strong reactivity in the apocrine secretory spiral of Moll glands, some reactivity in the apocrine duct.  Jakobiec and Zakka (2011) CEA Carcinoembyonic antigen protein that is produced in the intestine, liver, pancreas, mammary gland and others, and can be measured in the blood; important tumor marker Strong reactivity in the apocrine secretory spiral of Moll glands, some reactivity in the apocrine duct.  Jakobiec and Zakka (2011) HRNR S100 fused-type protein hornerin S100 fused-type protein that plays a role in the epidermal differentiation complex that is involved in terminal differentiation of keratinocytes Cytoplasmic reactivity of epithelial cells.  Garreis et al. (2017) FLG2 S100 fused-type protein filaggrin-2 essential for normal cell-cell adhesion in the cornified cell layers No reactivity  Garreis et al. (2017) SFTA3/SP-H Surfactant protein H surfactant protein with physicochemical properties Cytoplasmic reactivity of epithelial cells.  Schicht et al. (2018) UT-A Urea transporter A membrane transport protein, transporting urea Marked UT-A signals in the tubular epithelium, especially in the apical cell compartments.  Jäger et al. (2022a) UT-B Urea transporter B membrane transport protein, transporting urea Pronounced UT-B-specific immunoreactivity in the tubular epithelium, especially in the apical parts of the cells.  Jäger et al. (2022b) ",
  "metadata": {
    "Title of this paper": "Vergleichend histologische Untersuchungen über den Bau der Augenlider der Haussäugetiere",
    "Journal it was published in:": "Progress in retinal and eye research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483061/"
  }
}