{
  "title": "Paper_762",
  "abstract": "pmc J Tissue Eng J Tissue Eng 1450 jte TEJ Journal of Tissue Engineering 2041-7314 SAGE Publications PMC12477366 PMC12477366.1 12477366 12477366 41030473 10.1177/20417314251349675 10.1177_20417314251349675 1 Original Research Article Design of an artificial natural killer cell mimicking system to target tumour cells https://orcid.org/0009-0003-6655-0718 Chugh Vaishali 1 Kanala Vijaya Krishna 1 Quandt Dagmar 1 Kelly Suainibhe 2 King Damien 3 Jensen Lasse D. 4 Simpson Jeremy C. 2 https://orcid.org/0000-0002-6292-4933 Pandit Abhay 1 1 2 3 4 Abhay Pandit, CÚRAM, Research Ireland Centre for Medical Devices, University of Galway, Upper Newcastle, Galway H91W2TY, Ireland. Email: abhay.pandit@universityofgalway.ie 27 9 2025 Jan-Dec 2025 16 478548 20417314251349675 5 3 2025 29 5 2025 27 09 2025 30 09 2025 01 10 2025 © The Author(s) 2025 2025 SAGE Publications https://creativecommons.org/licenses/by/4.0/ This article is distributed under the terms of the Creative Commons Attribution 4.0 License ( https://creativecommons.org/licenses/by/4.0/ https://us.sagepub.com/en-us/nam/open-access-at-sage NK cell mimics are assemblies of a cell membrane and a template that replicate biomimetic features and physicochemical properties, respectively. To develop this targeted drug delivery system, gelatin microspheres (cG) were fabricated using a water-in-oil emulsion and reinforced via DMTMM cross-linking to exhibit tunable Young’s modulus, a critical parameter for cell–material interactions. These microspheres were subsequently coated with membranes derived from the human NK cell line KHYG-1 to form biomimetic NK cell mimics (cGCM), combining physicochemical control with bioinspired functionality. These engineered cGCM were non-toxic, non-inflammatory, and capable of reducing macrophage uptake by ~10% when incubated with differentiated THP-1 cells. In vitro studies demonstrated significant interaction/ proximity of the cGCM with cancer cells in 2D cultures of breast cancer cells (MDA-MB-231), 3D spheroids of liver (HepG2), and colon (HT-29) cancer cell models, and a zebrafish breast cancer xenograft (MDA-MB-231) model. The cGCM also evaded macrophage detection in a Kdrl:EGFP Spil:Ds Red zebrafish model. Furthermore, in a pilot assessment, loading and release of the sialyltransferase inhibitor (STI, 3Fax-Peracetyl Neu5Ac) using cGCM significantly reduced α-2,6 sialylation in 2D cultures of MDA-MB-231 cells, demonstrating the STI’s intact functionality in inhibiting sialylation. By integrating bioinspired membranes with mechanically tunable gelatin-based carriers, our system demonstrates a multifunctional immune-mimicking platform with relevance to tissue engineering, tumour modelling, immune modulation, and drug delivery. These findings offer a promising foundation for future therapeutic strategies in cancer research and immuno-engineering. NK cell membrane gelatin microspheres biomaterials 3D spheroids zebrafish xenograft breast tumour model science foundation ireland https://doi.org/10.13039/501100001602 13/RC/2073_P2 MSCA-RISE “3D-NEONET: Drug Discovery and Delivery NEtwork for ONcology and Eye Therapeutics” 734907 european regional development fund https://doi.org/10.13039/501100008530 13/RC/2073_P2 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes cover-date January-December 2025 typesetter ts1 Introduction Designing delivery systems that can effectively interact with their physiological micro-immune-environment and conserve functionality is a vastly unmet need in the field of biomedicine. Non-specific absorption of blood proteins on their surface and elimination by the mononuclear phagocyte system (MPS) are example scenarios that impede their bio-interfacing. 1 3 4 7 8 10 11 13 14 15 16 19 20 24 15 25  26 While red blood cell (RBC) membranes are widely used for their excellent immune evasion capabilities due to their innate “self” markers (e.g. CD47), they lack active targeting properties, limiting their effectiveness in tumour-specific delivery. Macrophage and neutrophil membrane-coated systems offer improved tumour-homing capabilities due to inflammation-resolving functions, but may also carry immunosuppressive signals or promote pro-tumour effects depending on their polarization states. T-cell membranes, although offering strong antigen-specific targeting via T-cell receptors, require prior activation and can vary in functional stability, complicating reproducibility. In contrast, NK cell membranes provide an optimal balance by combining inherent tumour recognition (via receptors like NKp30 and NKG2D), consistent anti-tumour identity, and immune evasion without prior activation. These unique attributes position NK cell membrane-coated systems as a highly promising and versatile platform for tumour-targeted therapies. KHYG-1 is a human NK cell line closely resembling primary NK cells, characterized by high levels of activating (DNAM-1, NKp30, NKG2D), and adhesion (CD11a), and NK identifying (CD56) surface receptors. These cells does not require prior activation (like primary NK cells) and the scalability of this cell line enables harvesting sufficient amounts of cell membrane, therefore was selected for designing NK cell mimics. 27 31 Structural templates play a crucial role in shaping the mechanical properties of CMC mimics. Elasticity in the drug delivery systems provides additional mechanical characteristics that enhances circulation time, bio stability, cellular uptake, tumour penetration, immune evasion, biocompatibility, and mechanical adaptability. Although, for nanoparticles smaller than 200 nm, flexibility might be a less critical factor but for microparticles (~5 µm), elasticity becomes a key factor, particularly in cancer therapy. While the significance of elasticity has been well established in scaffolds and cell culture substrates, 38 40 35 37 36 37 41 42 In this study ( Schemes 1 2 32 33 34 40 41 47  48 Scheme 1. Overview on key conceptual elements of the study, including biomimetic design, tumour targeting capability, interaction with macrophages, and the localized delivery strategy. Scheme 2. Overview of NK cell mimics’ comprehensive study: design, interactions and therapeutic potential in tumour therapy. NK cell mimics were designed by coating KHYG-1 cell membrane onto gelatin microspheres, exhibiting moderate elasticity. NK cell mimics’ interaction with macrophages (2D in vitro differentiated THP-1 model) were investigated to examine their pro-inflammatory response and phagocytosis. The NK cell mimics’ interaction towards tumour cells without prior activation were evaluated in various in vitro models using 2D breast cancer cell cultures (MDA-MB-231), 3D spheroids of liver (HepG2), and colon (HT-29) cancer cells. Further, their interaction with breast cancer cells and macrophages in an in vivo zebrafish model was investigated. Finally, NK cell mimics’ loading and drug release behaviour was assessed using sialyltransferase inhibitor (STI, 3Fax-Peracetyl Neu5Ac) as a relevant model drug. To assess the effectiveness of our NK cell mimics in releasing therapeutic payloads, we conducted a pilot study focussing on altered glycans, particularly through the use of sialyltransferase inhibitors (STIs).  49  50 51 52 49 53 54 56 Materials and methods Materials Gelatin (porcine skin, gel strength ~300 g Bloom, Type A), 4-(4,6-dimethoxy-1,3,5-triazin-2-yl)-4-methyl-morpholinium chloride (DMTMM), mineral oil, sorbitan monooleate 80, Dextran-FITC (MW: 40,000), radioimmune precipitation (RIPA) buffer, phenylmethylsulfonylfluoride (PMSF), phorbol 12-myristate 13-acetate (PMA), 3Fax-Peracetyl Neu5Ac (sialyltransferase inhibitor), RPMI 1640 medium with L-glutamine and sodium bicarbonate, foetal bovine serum (FBS), 1 mM sodium pyruvate solution, 1% Penicillin-streptomycin (Pen-Strep), tricane, 0.01% Poly-L-Lysine (PLL) solution, 2,4,6-Trinitrobenzenesulfonic acid (TNBS) solution, NaCl, and CaCl 2 Hoechst 33342 ® Breeding and maintenance of zebrafish Zebrafish embryos from the AB strain and the Kdrl:EGFP Spil:Ds Red strain were bred and maintained at the zebrafish facility in Linköping, Sweden. These zebrafish were used for all in vivo experimental procedures. The zebrafishes were fertilized and stored as reported previously. 57 58 4 2 KHYG-1 cell culture conditions KHYG-1 cells were cultured at cell density of 300,000 to 500,000 cells/ml in RPMI 1640 medium with L-glutamine and sodium bicarbonate supplemented with 10% heat inactivated foetal bovine serum, 1 mM sodium pyruvate solution, 1% Penicillin-, and 10 ng/ml human IL-2 IS research grade. Isolation of KHYG-1 cell membranes About 300 million KHYG-1 cells were homogenized by using the combination of hypotonic buffer (10 mM HEPES, 42 mM KCl, 5 mM MgCl 2 g g Synthesis of cross-linked gelatin microspheres Gelatin microspheres were obtained using water-in-oil emulsion technique.  59 Mechanical properties (Young’s modulus) using nano-indentation Three different cross-linked gelatin hydrogels were prepared in the same manner as gelatin microspheres using 10 mM DMTMM, 50 mM DMTMM and 100 mM DMTMM. Two 500 μl 10% aqueous gelatin solution was dropped on a silicon mould placed on ice to provide structure to the hydrogel for each set of DMTMM concentration. After few minutes, these two hydrogels were dipped in 2 ml of specific DMTMM solution aqueous solution each and kept on shaker for 3 h for crosslinking at room temperature. Further, after 3 h of crosslinking the hydrogels were placed on glass cover slip in 24 well plate and topped up with 500 μl of deionized water for the measurement in Optics11Life-Pavone High-Throughput Indentation Platform. For measuring elastic modulus or Young’s modulus of the three different cross-linked gelatin hydrogels (three replicates each), displacement control mode was operated with the same parameters that is, (1) tip radius of the probe = 9.50 μm, (2) stiffness of the probe = 0.200 N/m, (3) calibration factor = 2.072, (4) air temperature = 34.450°C, (5) humidity = 4.350%, (6) Poisson’s ratio = 0.5. Ten measurement/indentations were made for each sample covering the whole area (including centre and corners) of sample as much as possible. During the mode of operation, the instrument recorded piezo movement (blue curve) and cantilever bending (green curve) and the validation of these results was solidified through Load-indentation curves, where the Hertz fit (red curve) perfectly overlapped with the piezo movement (blue curve), which ensured the accuracy of the young’s modulus assessment for all hydrogel types ( Figure S1 Lab-on-disc centrifugal microfluidics The microfluidics chip design was inspired by a previously established concept with some modifications. 60 62 Figure S8 Figures 1(e) S2 Figure 1. Characterization of gelatin microspheres: (a) field emission scanning electron microscopic (FESEM) image cross-linked gelatin microspheres (cG) using 50 mM DMTMM, scale bar = 5 μm, (b) size distribution of cG by laser diffraction, (c) surface charge on gelatin microspheres before crosslinking (G) and after crosslinking (cG) using zetasizer ( N N Fabrication of NK cell mimics About 1 mg of the gelatin cross-linked microspheres and 1 mg of isolated cell membrane were dispersed in 1 ml of deionized water in separate two capped 2 ml centrifuge tube and sonicated at 100 W for 5 min on ice in water bath sonicator. After 5 min, 1 mg/ml solution of gelatin microspheres was mixed with 1 mg/ml isolated cell membrane solution and sonicated at 100 W for 5 min on ice in water bath sonicator. Further, the mixture was centrifuged at 14,000 rpm in pico™ 17 microcentrifuge at 4°C for 20 min. Protein loading yield Protein loading yield is defined as the weight ratio of immobilized proteins to the gelatin microspheres after cell membrane coating. 63 65  (1) Protein loading Yield ( % ) = Protein quantified per 1 mg of NK cell mimics Protein quantified per 1 mg of isolated cell membrane * 100 Protein absorption study About 1 mg each of gelatin microspheres and NK cell mimics were incubated in 500 ml of foetal bovine serum for 3 h at 37°C with constant agitation. Further, gelatin microspheres and NK cell mimics were separated by centrifugation at 14,000 rpm in pico™ 17 microcentrifuge for 20 min. Both the spheres’ pellets were washed three times in Dulbecco’s phosphate-buffered saline buffer, centrifuged and discarded the supernatant. After the washing steps, the pellets were added to 100 μl of cold radioimmune precipitation (RIPA) buffer (50 mM TrisHCl, pH 8.0, 150 mM NaCl, 0.02% sodium azide, 0.1% sodium dodecyl sulphate (SDS), 1% Nonidet P-40, 0.5% sodium deoxycholate) with protease inhibitor cocktail (1:100), phosphatase inhibitor cocktail (1:10) and phenylmethylsulfonylfluoride (1:50). After 15 min on ice, vortexed and centrifuged the sample at 14,000 rpm in pico™ 17 microcentrifuge at 4°C for 20 min. Supernatant after the centrifugation was used for protein quantification. Total protein concentration on gelatin microspheres and NK cell mimics was determined by Pierce™ BCA Protein Assay Kit to measure the absorbance at 562 nm. Bovine serum albumin protein was used for the standard curve. Each set of sample treatment was done in triplicates. Protein analysis of the NK cell mimics The protein profile in the gelatin microspheres, isolated NK cell membrane, and NK cell mimics was visualized, analysed, and compared qualitatively by loading and running the same amount of protein in a 12% of SDS-PAGE gel that allowed the separation of protein-based on mass. After the separation of proteins, these gels were stained with irreversible 0.1% Coomassie brilliant blue G-250 dye (w/v in 50% methanol + 5% acetic acid glacial) for 20 min with gentle agitation. Further, the gel was de-stained using de-staining solution (20% methanol + 5% acetic acid glacial) under shaking, to release all the unbound coomassie brilliant blue dye. The de-staining solution was replenished several times until background of the gel is fully de-stained. Finally, de-stained gel was scanned on gel-scanner. Protein detection in the NK cell mimics The total protein was extracted from KHYG-1 cells, isolated cell membrane and NK cell mimics using ice cold RIPA buffer and quantified the total protein content using BCA assay kit as mentioned in the above sections. Further, 5 µg protein from each sample (KHYG-1 cells, isolated cell membrane and NK cell mimics) was separated in a desired SDS polyacrylamide gel electrophoresis (10% or 12% gel depending on specific antibody, mentioned in Table S1 ® Table S1 Table S1 Visualization of NK cell membrane onto gelatin microspheres Three imaging techniques including transmission electron microscopy (TEM), field-emission scanning electron microscopy (FESEM), and confocal laser scanning microscopy (CLSM), were used to examine the structural integrity and morphology of the NK cell mimics. First, prepared 1 mg/ml NK cell mimics sample in deionized water. For TEM, added 10 μl into copper TEM grids. Left to dry for 24 h and imaged the sample in Hitachi 7500 (B-076 HBB). For FESEM, added 20 μl of NK cell mimics on an aluminium foil piece on carbon stab. The sample was sputter coated for 3 min at 2.2 kV and imaged using scanning Electron Microscope Hitachi S-4700 EDX (B-076 HBB). For CLSM, NK cell mimics were using 1 mg of dextran-cascade blue loaded gelatin microspheres and 1 mg of wheat germ agglutinin (WGA)-FITC labelled cell membrane. Appropriate (~20 μl) amount of NK cell mimics were placed on glass slide, covered with coverslip and let it dry for few min and applied transparent paint on the side of cover slips to avoid movement of coverslip while imaging. The glass slide with sample is covered with aluminium foil to avoid bleaching of the dyes. Then, the fluorescent colocalization was observed in Olympus ® In vitro The pro-inflammatory behaviour of the prepared gelatin microspheres (cG) and NK cell mimics (cGCM) was tested using standard cytokine release assay (i.e. enzyme-linked immunosorbent assay (ELISA)). In brief, 50,000 THP-1 cells were seeded in 24 well plate and differentiated using 100 ng/ml phorbol 12-myristate 13-acetate (PMA) for 24 h. After PMA treatment, THP-1 cells adhered to the surface of the well plate. Further, removed the old medium gently and washed with Dulbecco’s phosphate-buffered saline (DPBS) twice. Further, differentiated THP-1 cells were treated with gelatin microspheres (cG, 500 μg/ml), NK cell membrane (CM, 500 μg/ml) and NK cell mimics (cGCM, 500 μg/ml) at 37°C for 24 h. After 24 h incubation, cell culture supernatant were collected, centrifuged, removed debris and stored at −20°C as small aliquots. For cytokine assay, samples were thawed and analysed for pro-inflammatory cytokines, human interleukin 1β and human tumour necrosis factor α using ELISA and as per the manufacture recommendations. For positive control, cells were dosed with 100 ng/ml of lipopolysaccharide for 3 h. Each set of sample treatment was done in triplicates. In vitro First, 1 × 10 6 ImageStream ® X Mark II In vitro MDA-MB-231 cells were first stained with CM-DiI cell tracker dye and seeded 20,000 cells/well of Corning ® Hoechst 33342 ® In vitro The 3D spheroids of HepG2 and HT-29 cells was prepared in CellCarrier Ultra 96-well microplates (Perkin Elmer) as described in an established protocol.  66 Hoechst 33342  66 Microinjection method of the gelatin microspheres and NK cell mimics into zebrafish embryos for the interaction studies For the injection of gelatin microspheres, the borosilicate glass needles were incubated in 0.01% Poly-L-Lysine (PLL) solution for 30 min. Further, washed twice with Dulbecco’s Phosphate Buffered Saline (DPBS) and used for loading gelatin microspheres. For the injection of NK cell mimics, the borosilicate glass needles were directly used without PLL coating. Further, capillaries were made with the glass needles using Narishige PC-10 dual stage glass micropipette puller (heater level: 65.1). About 1 mg of gelatin microspheres and NK cell mimics were re-suspended in 10 μl of PBS and sonicated for 30 min in water bath sonicator prior to injection. Further, the 5 μl from the mixture was transferred into the capillary using microloader™-microcapillary tips. Finally, the gelatin microspheres or NK cell mimics were injected using a microinjector (PV830 Pneumatic Picopump, with Narishige M-152 manipulator) equipped with a glass capillary. In vivo Day 1, 2 dpf AB embryos ( N perivitelline space (PVS) 57 67 68 6 After 24 h of MDA-MB-231 cells injection, at day two, dextran-FITC loaded gelatin microspheres (cG) and NK cell mimics (cGCM) were injected on the other side of the PVS site to that of tumour cells ( Figure 7(a) There were two possibilities that is, (1) many tumour cells surrounding one gelatin microsphere/NK cell mimic; (2) one tumour cell interacting with more than one gelatin microsphere or NK cell mimics at a time. Therefore, the interaction was analysed in terms of the total number of tumour cells or the total number of spheres in the specific embryos. Two types of analysis have been presented using ImageJ software that is,  (2) 1 . A r e a o f t u m o u r c e l l s i n t e r a c t i o n ( % ) = A r e a o f i n t e r a c t e d t u m o u r c e l l s ( y e l l o w c o − l o c a l i z a t i o n ) A r e a o f t o t a l t u m o u r c e l l s * 100  (3) 2 . A r e a o f g e l a t i n m i c r o s p h e r e s o r N K c e l l m i m i c s i n t e r a c t i o n ( % ) = A r e a o f i n t e r a c t e d g e l a t i n m i c r o s p h e r e s o r N K c e l l m i m i c s ( y e l l o w c o − l o c a l i z a t i o n ) A r e a o f t o t a l g e l a t i n m i c r o s p h e r e s o r N K c e l l m i m i c s 2 . * 100 In vivo At 3 dpf, Kdrl:EGFP Spil:Ds Red zebrafish ( N perivitelline space (PVS)  (4) M a c r o p h a g e i n t e r a c t i o n o r u p t a l e ( % ) = A r e a o f i n t e r a c t e d g e l a t i n m i c r o s p h e r e s o r N K c e l l m i m i c s ( y e l l o w c o − l o c a l i z a t i o n ) A r e a o f t o t a l g e l a t i n m i c r o s p h e r e s o r N K c e l l m i m i c s * 100 Loading of sialyltransferase inhibitor (STI) in gelatin microspheres and NK cell mimics Sialyltransferase Inhibitor, 3Fax-Peracetyl Neu5Ac was used to load into gelatin microspheres (cG) and NK cell mimics (cGCM). First, 0.05 M stock solution of STI was prepared in dimethyl sulphoxide (DMSO) and stored in aliquots at −80°C until use. About 1 mg of gelatin microspheres were suspended and sonicated in 463.5 μl of PBS in glass vial, further 36.5 μl of STI from the stock solution was added, covered the glass vial with aluminium foil and kept on agitation at 100 rpm for 3 h at room temperature. After 3 h, the sample was centrifuged at 14,000 rpm using multifuge X3R centrifuge for 30 min. The supernatant (PBS) was used for estimating the unloaded STI. The pellet (i.e. STI loaded gelatin microspheres) after centrifugation was further used to prepare NK cell mimics. Estimation of loading and release of STI using high performance liquid chromatography (HP-LC) The concentration of 3Fax-Peracetyl Neu5Ac loaded in the spheres was determined using a high performance liquid chromatography (HPLC) system (Shimadzu) equipped with C18 column (250 mm × 4.6 mm) with a constant rate of 1 ml/min and ultraviolent detection at 230 nm. The mobile phase used was 10% acetonitrile to 100% acetonitrile with 0.1% formic acid. The calibration curve for STI was obtained using various concentration from 2 to 0.05 mg/ml in PBS and determined the area under the curve (AUC; Figure S9A  (5) A m o u n t o f S T I l o a d e d = I n i t i a l c o n c . o f S T I − U n l o a d e d S T I i n t h e s u p e r n a t a n t The release profile of STI was studied by incubating STI loaded gelatin microspheres and NK cell mimics in 1 ml of PBS at 37°C with 100 rpm agitation. At various time intervals (8, 12, 24, 48, 60 h), 200 μl of PBS was used for HPLC analysis and replaced with 200 μl fresh PBS. Treatment of STI loaded gelatin microspheres and NK cell mimics on breast cancer cells (MDA-MB-231) to perform lectin staining About 20,000 MDA-MB-231 cells/well were seeded in Corning ® 2 2  69 ® Statistical analysis All statistical analyses used GraphPad Prism 8.00 software. Most data were analysed by One-Way analysis of variance (ANOVA) followed by Tukey multiple comparison test for comparing more than three samples, and two-tailed unpaired t p p p p Results Characterization of cross-linked gelatin microspheres Scanning electron microscopic image of the gelatin microspheres after crosslinking (cG) with the 50 mM DMTMM reflects consistent smooth spherical morphology (shown in Figure 1(a) Figure 1(b) Figure 1(c) Figure S3 Figure 1(d) Figures 1(f) g Characterization of NK cell mimics NK cell mimics were fabricated by coating isolated KHYG-1 cell membrane onto gelatin microspheres using 50 mM DMTMM. The post-assembly zeta potential of gelatin core shifted from +23.9 mV to a negative value (−19.3 mV) due to the KHYG-1 cell membrane (−38.3 mV; Figure 2(a) −1 −1 Figure 2(b) Figure 2. Characterization of NK cell mimics: (a) surface charge on cG, CM and cGCM, N N p N Abbreviations: cG: cross-linked gelatin microspheres; cG_FBS: cross-linked gelatin microspheres incubated in foetal bovine serum; cGCM_FBS: NK cell mimics incubated in foetal bovine serum; CL: KHYG-1 cell lysate; CM: isolated KHYG-1 cell membrane; cGCM: NK cell mimics; MW: molecular weight. Graphs are plotted in box and whiskers format with max and min value showing all data points. * p p p p SDS-PAGE gel electrophoresis showed gelatin microspheres devoid of protein content before coating. Protein profiles of CM and cGCM closely matched, validating cell membrane protein immobilization on gelatin microspheres ( Figure 2(c) equation (1) Figure 2(d) Figure 2(e) p p Figure 2(f) Figure 3(a) Figure S5 Figure 3(b) Figure 3(c) Figure 3. Visualization of NK cell membrane onto gelatin microspheres: (a) transmission electron microscopy (TEM) images of uncoated gelatin microspheres (cG) and NK cell membrane-coated microspheres (cGCM). The cGCM images reveal a dark gelatin core with a surrounding lighter layer corresponding to the NK cell membrane coating. Due to the thin and low-contrast nature of the membrane layer, enlarged views of the red-highlighted regions are included to aid in visualizing coating integrity. Scale bar = 500 nm, (b) field emission scanning electron microscopic (FESEM) images of cG and cGCM, Scale bar = 1 μm, and (c) confocal laser scanning microscopic (CLSM) images of dextran cascade blue loaded gelatin spheres coated with WGA labelled KHYG-1 cell membrane, Scale bar = 10 μm. Abbreviations: cG: cross-linked gelatin microspheres; cGCM: NK cell mimics, WGA-FITC: wheat germ agglutinin-fluorescein isothiocyanate. In vitro Cytotoxicity assessment of gelatin microspheres (cG) and NK cell mimics (cGCM) against diff. THP-1 cells indicated no toxicity at all concentrations (10–100 µg/ml; Figure S6 Figure S7 Figure 4(a) Figure 4(b) p Figure 5(a) b Figure 4. In vitro cellular uptake studies of zymosan A (S. cerevisiae) bioparticles™, gelatin microspheres (cG), and NK cell mimics (cGCM) by differentiated (diff.) THP-1 cells as macrophages for 3 h using Image Stream X (cell/particle: 1:1): (a) For each condition (zymosan, cG–Cascade Blue, and cGCM–Cascade Blue), two representative single-cell uptake images are shown. Each pair includes a brightfield (BF) and the corresponding fluorescence image captured from the same field of view, highlighting the internalization and localization of particles within individual cells at 37°C and (b) comparative analysis of the uptake at 4°C and 37°C (cG vs cGCM, p p Graphs are plotted in box and whiskers format with max and min value showing all data points. * p p p p Figure 5. Pro-inflammatory assessment of gelatin microspheres (cG), NK cell mimics (cGCM), NK cell membrane (CM) with differentiated THP-1 cells. Quantitative measurement of pro-inflammatory cytokines, (a) interleukin 1β (IL-1β), p p N Lipopolysaccharides (LPS) was used as positive control. Graphs are plotted in box and whiskers format with max and min value showing all data points. * p p p p In vitro Automated quantitative high-content analysis ( Figure 6(a) p p Figure S8 Figure 6. In vitro interaction studies of gelatin microspheres (cG) and NK cell mimics (cGCM) with 2D cultures of MDA-MB-231 (human breast cancer cell line) and 3D spheroids of HT-29 (human colon cancer cell line) and HepG2 (human liver cancell cell line) using various cell: sphere ratios (1:1, 1:5, 1:10, 1:20) after 24 h incubation: (a) comparative analysis of number of cG and cGCM interacting or in the close proximity with the MDA-MB-231(One-way ANOVA, cG vs cGCM (1:5), p p N p p p p p p p p N p p p p In vitro Automated quantitative high-content analysis ( Figure 6(b) p p p p p p p p Figure 6(c) Interaction studies of gelatin microspheres (cG) and NK cell mimics (cGCM) with MDA-MB-231 cells in zebrafish xenograft breast tumour model Quantification analysis reveals that at 24 hpi, a more significant interaction of tumour cells with cGCM was observed, as shown in Figure 7(b) equation (2) Figure 7(c) p equation (3) Figure 7(d) p Figure 7. In vivo interaction studies with MDA-MB-231 (breast cancer cell line) in zebrafish xenograft breast tumour model: (a) schematics of the site and time of injection of MDA-MB-231 cells, dextran-FITC loaded gelatin microspheres and NK cell mimics, (b) microscopic images (bright field, red and green fluorescence) of same embryos at 0 h post injection (hpi) of MDA-MB-231 cells, at 3 and 24 hpi of dextran-FITC loaded gelatin microspheres (cG) and NK cell mimics (cGCM), Scale bar = 500 μm, Zoom view of the selected region is also presented for 24 hpi, Scale bar = 500 μm, (c) quantification of the interaction with respect to tumour cells (One-way ANOVA, cG vs cGCM (24 hpi), p p p N Note. * p p p p Interaction studies of gelatin microspheres and NK cell mimics with macrophages in zebrafish Quantification analysis reveals that at 24 h post injection (hpi), the macrophages were found closer to or crowded near the gelatin microspheres more than compared to the NK cell mimics, as shown in Figure 8(a) Figure 8(b) equation (4) p Figure 8. In vivo interaction/cellular uptake studies of gelatin microspheres (cG) and NK cell mimics (cGCM) with macrophages in zebrafish model: (a) microscopic images (bright field, red and green fluorescence) presenting the interaction at 24 h post injection (hpi) of dextran-FITC loaded gelatin microspheres (cG) and NK cell mimics (cGCM) with DsRed macrophages in 3 day post fertilized (dpf) Kdrl:EGFP Spil:DsRed Zebrafish strain model, Scale bar = 200 μm. The zebrafish embryos’ blood vessel were EGFP tagged, and spheres were FITC labelled. Therefore, both blood vessels and spheres were shown in the green channel. The background green fluorescence for the blood vessels was removed in Image J for analysis and marked the position of the spheres with white arrow for better analysis of the images to avoid the overlap of green channels, and (b) quantification of interaction/cellular uptake of cG and cGCM with macrophages at 24 hpi of spheres (unpaired t p N Graphs are plotted in box and whiskers format with max and min value showing all data points. * p p p p Sialyltransferase inhibitor (STI, 3Fax-peracetyl Neu5Ac) studies The optimization of STI detection via HPLC yielded a characteristic peak ~16.29 min ( Figure S9B equation (5) Figure 9(a) Figure 9(b) p p p p p Figure 9(c) Figure 9(d)–(f) Figure 9. Sialyltransferase inhibitor (STI, 3Fax-Peracetyl Neu5Ac) studies: (a) Release of STIanalysis from gelatin microspheres (cG) and NK cell mimics (cGCM) using a high-performance liquid chromatography (HPLC) system, N p p p p p N Abbreviations: C: Control (cells with only media), cG: gelatin microspheres, cGCM: NK cell mimics. Note. * p p p p Discussion The overarching goal of this study is to integrate the surface characteristics, size, and relevant cell-like mechanical properties into the designed NK cell mimics. The mimics are assembled using cell membrane from KHYG-1 (human NK cell line) cells onto cross-linked gelatin microspheres as template. The selection of KHYG-1 cell line offered two main advantages: first, their close resemblance to primary NK cells and presence of key activating receptors (DNAM-1, NKp30, NKG2D), adhesion receptor (CD11a) and NK cell identifying receptor (CD56) on their surface that help target and adhesion to tumour cells. 70 72 29 31 73 74 59 75 76 77 32 33 Figure S10  78  79 Microspheres showed an increase in positive surface charge post cross-linking suggesting a decrease in free carboxylic groups while maintaining a consistent spherical morphology ( Figure 1(a) c Figure 1(b)  80 While the bio-distribution and circulation times of RBCs are well known to benefit from their elastic properties, 81 82  83 84 86 The final step in the assembly process involved coating cell membrane onto the gelatin microspheres. Homogenous dispersions of cG and isolated KHYG-1 cell membrane in water were individually prepared by sonication, stabilized due to the surface positive and negative charges of cG and cell membrane respectively. The dispersions were mixed and sonicated to assemble the NK cell mimics (cGCM). Electrostatic interactions between cG and cell membrane (CM) can be attributed to the stability of this final assembly. Noticeable shift in the zeta potential of the gelatin core from positive to negative confirmed coating of cell membrane ( Figure 2(a) Figure 2(b) 87 89 Figure 2(c) Figure 2(d) Figure 2(e) 90 91 Figure 2(f) Figure 3 Figures 3(a) S5 Introduction of polymer-based delivery systems into biological circulation triggers a foreign body reaction and clearance driven by macrophages via phagocytosis. Their rate of clearance depends on surface properties and size.  92  93  94  95 96 97 Figure 4 Additionally, NK cell mimics were evaluated for pro-inflammatory response and biocompatibility. cG and cGCM were co-incubated with macrophages (diff. THP-1 cells) and the secretion of pro-inflammatory cytokines, such as TNF-alpha and IL-1beta, quantified by ELISA. Our assessment revealed absence of pro-inflammatory cytokines in the cultures and good biocompatibility for both cG and cGCM ( Figures 5 S6 As part of tumour annihilating mechanism, NK cells recognize and target tumorous cells using their surface receptors; DNAM-1, NKp30, NKG2D. 98 99 Figure 6(a) 100 101  102  103 104 105 Figure 6(b) Figure 6(c)  106  107  108 109 110  111 Although macrophage and tumour cell evaluations were conducted separately to allow for the use of optimized, cell-specific conditions and analytical tools, the resulting data collectively highlight the functional selectivity of cGCMs. The reduced uptake by macrophages, alongside increased interaction with tumour cells in both 2D and 3D models, demonstrates the dual functionality intended in NK cell mimics—simultaneous immune evasion, and tumour targeting. While the current study design offers strong foundational evidence of this selective interaction, co-culture systems incorporating both macrophages and tumour spheroids represent a valuable future direction to further explore these dynamics in a more integrated, physiologically relevant environment. Additionally, the in vivo zebrafish model used here inherently captures interactions between immune and tumour components, providing complementary insights into cellular behaviour within a live, multicellular system. Zebrafish embryos and larvae are the second most commonly used animal models for medical, biological, and biotechnological studies. To evaluate the effectiveness of our NK cell mimics, we used a zebrafish breast cancer xenograft model, which is increasingly recognized in cancer research. 46 112 34 37 38 40  48 57 67 68 Figure 7 100 103 113 114  115 Figure 8 Furthermore, to demonstrate the capability of cGCM to encapsulate and deliver therapeutic payloads for cancer-related applications, we conducted a pilot study targeting altered glycans, specifically by inhibiting sialyltransferases (STIs).  49 52 53 116  54  117  118  119 54 56 R 2 Figure 9(b) c Figure 9(d)–(f) Nonetheless, STI-cGCM retained functional integrity of the inhibitor, as evidenced by a significant reduction in α-2,6 sialylation on MDA-MB-231 cells, confirming that the membrane coating did not compromise therapeutic activity. These findings not only validate the potential of cGCMs for targeted therapeutic delivery but also illustrate their ability to maintain payload bioactivity while offering additional layers of biological functionality, such as immune evasion and tumour targeting. While this was a preliminary investigation, it establishes a foundation for future studies exploring STI-loaded NK cell mimics in the context of tumour glycan modulation and precision cancer therapy. It is also important to highlight that the interaction and sialylation studies were performed without incorporating cytotoxic payloads; thus, the main objective was to assess NK cell mimic–tumour cell interactions and the controlled release of functional glycan modulators. These foundational findings pave the way for future designs combining sialylation-targeting strategies with chemotherapeutic agents for enhanced tumour cell killing. Conclusion In conclusion, we developed a safe and effective method for cross-linking gelatin microspheres using the non-toxic cross-linker DMTMM, enhancing their stability with tunable mechanical properties. These modified microspheres were successfully coated with KHYG-1 cell membranes, creating NK cell mimics with surface characteristics, size, and relevant cell-like mechanical properties. These NK cell mimics demonstrated tissue and cell compatibility, reduced macrophage uptake, and did not elicit any pro-inflammatory response. In vitro studies confirmed their enhanced interaction with tumour cells, even at low concentrations in both 2D and 3D tumour cell cultures. Moreover, NK cell mimics showed enhanced tumour interaction in zebrafish breast tumour xenograft model and can elude macrophage detection. Additionally, the loading and release of a sialyltransferase inhibitor (STI) from these mimics were effective and reduces sialylation on breast tumour cells suggesting potential therapeutic applications. These findings collectively highlight the promising potential of NK cell mimics for targeted cancer therapies. Supplemental Material sj-docx-1-tej-10.1177_20417314251349675 – Supplemental material for Design of an artificial natural killer cell mimicking system to target tumour cells Supplemental material, sj-docx-1-tej-10.1177_20417314251349675 for Design of an artificial natural killer cell mimicking system to target tumour cells by Vaishali Chugh, Vijaya Krishna Kanala, Dagmar Quandt, Suainibhe Kelly, Damien King, Lasse D. Jensen, Jeremy C. Simpson and Abhay Pandit in Journal of Tissue Engineering sj-tif-10-tej-10.1177_20417314251349675 – Supplemental material for Design of an artificial natural killer cell mimicking system to target tumour cells Supplemental material, sj-tif-10-tej-10.1177_20417314251349675 for Design of an artificial natural killer cell mimicking system to target tumour cells by Vaishali Chugh, Vijaya Krishna Kanala, Dagmar Quandt, Suainibhe Kelly, Damien King, Lasse D. Jensen, Jeremy C. Simpson and Abhay Pandit in Journal of Tissue Engineering sj-tif-11-tej-10.1177_20417314251349675 – Supplemental material for Design of an artificial natural killer cell mimicking system to target tumour cells Supplemental material, sj-tif-11-tej-10.1177_20417314251349675 for Design of an artificial natural killer cell mimicking system to target tumour cells by Vaishali Chugh, Vijaya Krishna Kanala, Dagmar Quandt, Suainibhe Kelly, Damien King, Lasse D. Jensen, Jeremy C. Simpson and Abhay Pandit in Journal of Tissue Engineering sj-tif-2-tej-10.1177_20417314251349675 – Supplemental material for Design of an artificial natural killer cell mimicking system to target tumour cells Supplemental material, sj-tif-2-tej-10.1177_20417314251349675 for Design of an artificial natural killer cell mimicking system to target tumour cells by Vaishali Chugh, Vijaya Krishna Kanala, Dagmar Quandt, Suainibhe Kelly, Damien King, Lasse D. Jensen, Jeremy C. Simpson and Abhay Pandit in Journal of Tissue Engineering sj-tif-3-tej-10.1177_20417314251349675 – Supplemental material for Design of an artificial natural killer cell mimicking system to target tumour cells Supplemental material, sj-tif-3-tej-10.1177_20417314251349675 for Design of an artificial natural killer cell mimicking system to target tumour cells by Vaishali Chugh, Vijaya Krishna Kanala, Dagmar Quandt, Suainibhe Kelly, Damien King, Lasse D. Jensen, Jeremy C. Simpson and Abhay Pandit in Journal of Tissue Engineering sj-tif-4-tej-10.1177_20417314251349675 – Supplemental material for Design of an artificial natural killer cell mimicking system to target tumour cells Supplemental material, sj-tif-4-tej-10.1177_20417314251349675 for Design of an artificial natural killer cell mimicking system to target tumour cells by Vaishali Chugh, Vijaya Krishna Kanala, Dagmar Quandt, Suainibhe Kelly, Damien King, Lasse D. Jensen, Jeremy C. Simpson and Abhay Pandit in Journal of Tissue Engineering sj-tif-5-tej-10.1177_20417314251349675 – Supplemental material for Design of an artificial natural killer cell mimicking system to target tumour cells Supplemental material, sj-tif-5-tej-10.1177_20417314251349675 for Design of an artificial natural killer cell mimicking system to target tumour cells by Vaishali Chugh, Vijaya Krishna Kanala, Dagmar Quandt, Suainibhe Kelly, Damien King, Lasse D. Jensen, Jeremy C. Simpson and Abhay Pandit in Journal of Tissue Engineering sj-tif-6-tej-10.1177_20417314251349675 – Supplemental material for Design of an artificial natural killer cell mimicking system to target tumour cells Supplemental material, sj-tif-6-tej-10.1177_20417314251349675 for Design of an artificial natural killer cell mimicking system to target tumour cells by Vaishali Chugh, Vijaya Krishna Kanala, Dagmar Quandt, Suainibhe Kelly, Damien King, Lasse D. Jensen, Jeremy C. Simpson and Abhay Pandit in Journal of Tissue Engineering sj-tif-7-tej-10.1177_20417314251349675 – Supplemental material for Design of an artificial natural killer cell mimicking system to target tumour cells Supplemental material, sj-tif-7-tej-10.1177_20417314251349675 for Design of an artificial natural killer cell mimicking system to target tumour cells by Vaishali Chugh, Vijaya Krishna Kanala, Dagmar Quandt, Suainibhe Kelly, Damien King, Lasse D. Jensen, Jeremy C. Simpson and Abhay Pandit in Journal of Tissue Engineering sj-tif-8-tej-10.1177_20417314251349675 – Supplemental material for Design of an artificial natural killer cell mimicking system to target tumour cells Supplemental material, sj-tif-8-tej-10.1177_20417314251349675 for Design of an artificial natural killer cell mimicking system to target tumour cells by Vaishali Chugh, Vijaya Krishna Kanala, Dagmar Quandt, Suainibhe Kelly, Damien King, Lasse D. Jensen, Jeremy C. Simpson and Abhay Pandit in Journal of Tissue Engineering sj-tif-9-tej-10.1177_20417314251349675 – Supplemental material for Design of an artificial natural killer cell mimicking system to target tumour cells Supplemental material, sj-tif-9-tej-10.1177_20417314251349675 for Design of an artificial natural killer cell mimicking system to target tumour cells by Vaishali Chugh, Vijaya Krishna Kanala, Dagmar Quandt, Suainibhe Kelly, Damien King, Lasse D. Jensen, Jeremy C. Simpson and Abhay Pandit in Journal of Tissue Engineering The authors would also like to acknowledge the graphic design support of Mr Maciek Dozkyk for Scheme 2. ORCID iDs: https://orcid.org/0009-0003-6655-0718 Abhay Pandit https://orcid.org/0000-0002-6292-4933 Author contributions: Funding: The author(s) declared no potential conflicts of interest with respect to the research, authorship, and/or publication of this article. Data availability statement: Supplemental material: References 1 Hadjidemetriou M Kostarelos K. Nanomedicine: evolution of the nanoparticle corona Nat Nanotechnol 2017 12 4 288 290 28383044 10.1038/nnano.2017.61 2 Cai P Zhang X Wang M et al Combinatorial nano-bio interfaces ACS Nano 2018 12 6 5078 5084 29883094 10.1021/acsnano.8b03285 3 Nienhaus K Wang H Nienhaus GU. Nanoparticles for biomedical applications: exploring and exploiting molecular interactions at the nano-bio interface Mater Today Adv 2020 5 100036 100055 4 Chugh V Vijaya Krishna K Pandit A. Cell membrane-coated mimics: a methodological approach for fabrication, characterization for therapeutic applications, and challenges for clinical translation ACS Nano 2021 15 11 17080 17123 34699181 10.1021/acsnano.1c03800 PMC8613911 5 Liu Y Luo J Chen X et al Cell membrane coating technology: a promising strategy for biomedical applications Nanomicro Lett 2019 11 1 100 146 34138027 10.1007/s40820-019-0330-9 PMC7770915 6 Liu L Pan D Chen S et al Systematic design of cell membrane coating to improve tumor targeting of nanoparticles Nat Commun 2022 13 1 6181 6195 36261418 10.1038/s41467-022-33889-3 PMC9580449 7 Zeng S Tang Q Xiao M et al Cell membrane-coated nanomaterials for cancer therapy Mater Today Bio 2023 20 100633 100658 10.1016/j.mtbio.2023.100633 PMC10148189 37128288 8 Li LL Xu JH Qi GB et al Core-shell supramolecular gelatin nanoparticles for adaptive and “on-demand” antibiotic delivery ACS Nano 2014 8 5 4975 4983 24716550 10.1021/nn501040h 9 Chen Y Zhang Y Zhuang J et al Cell-membrane-cloaked oil nanosponges enable dual-modal detoxification ACS Nano 2019 13 6 7209 7215 31117372 10.1021/acsnano.9b02773 10 Zhang Y Zhang J Chen W et al Erythrocyte membrane-coated nanogel for combinatorial antivirulence and responsive antimicrobial delivery against staphylococcus aureus infection J Control Release 2017 263 185 191 28087406 10.1016/j.jconrel.2017.01.016 PMC5503807 11 Xu L Gao F Fan F et al Platelet membrane coating coupled with solar irradiation endows a photodynamic nanosystem with both improved antitumor efficacy and undetectable skin damage Biomaterials 2018 159 59 67 29309994 10.1016/j.biomaterials.2017.12.028 12 Zuo H Tao J Shi H et al Platelet-mimicking nanoparticles co-loaded with w18o49 and metformin alleviate tumor hypoxia for enhanced photodynamic therapy and photothermal therapy Acta Biomater 2018 80 296 307 30223092 10.1016/j.actbio.2018.09.017 13 Ye H Wang K Wang M et al Bioinspired nanoplatelets for chemo-photothermal therapy of breast cancer metastasis inhibition Biomaterials 2019 206 1 12 30921730 10.1016/j.biomaterials.2019.03.024 14 Thamphiwatana S Angsantikul P Escajadillo T et al Macrophage-like nanoparticles concurrently absorbing endotoxins and proinflammatory cytokines for sepsis management Proc Natl Acad Sci U S A 2017 114 43 11488 11493 29073076 10.1073/pnas.1714267114 PMC5664555 15 Kang T Zhu Q Wei D et al Nanoparticles coated with neutrophil membranes can effectively treat cancer metastasis ACS Nano 2017 11 2 1397 1411 28075552 10.1021/acsnano.6b06477 16 Zhu J Zhang M Zheng D et al A universal approach to render nanomedicine with biological identity derived from cell membranes Biomacromolecules 2018 19 6 2043 2052 29584410 10.1021/acs.biomac.8b00242 17 Zhang J Miao Y Ni W et al Cancer cell membrane coated silica nanoparticles loaded with icg for tumour specific photothermal therapy of osteosarcoma Artif Cells Nanomed Biotechnol 2019 47 1 2298 2305 31174440 10.1080/21691401.2019.1622554 18 Nie D Dai Z Li J et al Cancer-cell-membrane-coated nanoparticles with a yolk-shell structure augment cancer chemotherapy Nano Lett 2020 20 936 946 31671946 10.1021/acs.nanolett.9b03817 19 Rao L Yu GT Meng QF et al Cancer cell membrane-coated nanoparticles for personalized therapy in patient-derived xenograft models Adv Funct Mater 2019 29 51 1905671 1905680 20 Wu Y Wan S Yang S et al Macrophage cell membrane-based nanoparticles: a new promising biomimetic platform for targeted delivery and treatment J Nanobiotechnol 2022 20 1 542 582 10.1186/s12951-022-01746-6 PMC9794113 36575429 21 Meng QF Rao L Zan M et al Macrophage membrane-coated iron oxide nanoparticles for enhanced photothermal tumor therapy Nanotechnol 2018 29 13 134004 10.1088/1361-6528/aaa7c7 29334363 22 Rao L He Z Meng QF et al Effective cancer targeting and imaging using macrophage membrane-camouflaged upconversion nanoparticles J Biomed Mater Res 2017 105 2 521 530 10.1002/jbm.a.35927 27718539 23 Xuan M Shao J Dai L et al Macrophage cell membrane camouflaged mesoporous silica nanocapsules for in vivo cancer therapy Adv Healthc Mater 2015 4 11 1645 1652 25960053 10.1002/adhm.201500129 24 Quijia CR Navegante G Sábio RM et al Macrophage cell membrane coating on piperine-loaded mil-100(fe) nanoparticles for breast cancer treatment J Funct Biomater 2023 14 6 319 332 37367283 10.3390/jfb14060319 PMC10299274 25 Xuan M Shao J Dai L et al Macrophage cell membrane camouflaged au nanoshells for in vivo prolonged circulation life and enhanced cancer photothermal therapy ACS Appl Mater Interfaces 2016 8 15 9610 9618 27039688 10.1021/acsami.6b00853 26 Han Y Pan H Li W et al T cell membrane mimicking nanoparticles with bioorthogonal targeting and immune recognition for enhanced photothermal therapy Adv Sci 2019 6 15 1900251 1900259 10.1002/advs.201900251 PMC6685477 31406665 27 Chester C Fritsch K Kohrt HE. Natural killer cell immunomodulation: targeting activating, inhibitory, and co-stimulatory receptor signaling for cancer immunotherapy Front Immunol 2015 6 601 609 26697006 10.3389/fimmu.2015.00601 PMC4667030 28 Lorenzo-Herrero S López-Soto A Sordo-Bahamonde C et al Nk cell-based immunotherapy in cancer metastasis Cancer 2018 11 1 1 22 10.3390/cancers11010029 PMC6357056 30597841 29 Cheng M Zhang J Jiang W et al Natural killer cell lines in tumor immunotherapy Front Med 2012 6 1 56 66 22460449 10.1007/s11684-012-0177-7 30 Suck G Branch DR Smyth MJ et al Khyg-1, a model for the study of enhanced natural killer cell cytotoxicity Exp Hematol 2005 33 10 1160 1171 16219538 10.1016/j.exphem.2005.06.024 31 Zhang J Zheng H Diao Y. Natural killer cells and current applications of chimeric antigen receptor-modified nk-92 cells in tumor immunotherapy Int J Mol Sci 2019 20 2 317 336 30646574 10.3390/ijms20020317 PMC6358726 32 Krishna KV Benito A Alkorta J et al Crossing the hurdles of translation—a robust methodology for synthesis, characterization and gmp production of cross-linked high molecular weight hyaluronic acid particles (cha) Nano Select 2020 1 3 353 371 33 Beghetto V Gatto V Conca S et al Development of 4-(4,6-dimethoxy-1,3,5-triazin-2-yl)-4-methyl-morpholinium chloride cross-linked carboxymethyl cellulose films Carbohydr Polym 2020 249 116810 116820 32933659 10.1016/j.carbpol.2020.116810 34 Lee KY Jang GH Byun CH et al Zebrafish models for functional and toxicological screening of nanoscale drug delivery systems: promoting preclinical applications Biosci Rep 2017 37 3 1 13 10.1042/BSR20170199 PMC5463258 28515222 35 Chakraborty C Sharma AR Sharma G et al Zebrafish: a complete animal model to enumerate the nanoparticle toxicity J Nanobiotechnol 2016 14 1 65 77 10.1186/s12951-016-0217-6 PMC4992559 27544212 36 He S Lamers GE Beenakker JM et al Neutrophil-mediated experimental metastasis is enhanced by vegfr inhibition in a zebrafish xenograft model J Pathol 2012 227 4 431 445 22374800 10.1002/path.4013 PMC3504093 37 Sieber S Grossen P Bussmann J et al Zebrafish as a preclinical in vivo screening model for nanomedicines Adv Drug Deliv Rev 2019 151–152 152 168 10.1016/j.addr.2019.01.001 30615917 38 Dadwal A Baldi A Narang RK Nanoparticles as carriers for drug delivery in cancer Artif Cells Nanomed Biotechnol 2018 46 295 305 30043651 10.1080/21691401.2018.1457039 39 Senapati S Mahanta AK Kumar S et al Controlled drug delivery vehicles for cancer treatment and their performance Signal Transduct Target Ther 2018 3 7 25 29560283 10.1038/s41392-017-0004-3 PMC5854578 40 Nadar RA Asokan N Degli Esposti L et al Preclinical evaluation of platinum-loaded hydroxyapatite nanoparticles in an embryonic zebrafish xenograft model Nanoscale 2020 12 25 13582 13594 32555916 10.1039/d0nr04064a 41 Pruvot B Jacquel A Droin N et al Leukemic cell xenograft in zebrafish embryo for investigating drug efficacy Haematologica 2011 96 4 612 616 21228037 10.3324/haematol.2010.031401 PMC3069240 42 Drabsch Y He S Zhang L et al Transforming growth factor-β signalling controls human breast cancer metastasis in a zebrafish xenograft model Breast Cancer Res 2013 15 10.1186/bcr3573 PMC3978640 24196484 43 Latifi A Abubaker K Castrechini N et al Cisplatin treatment of primary and metastatic epithelial ovarian carcinomas generates residual cells with mesenchymal stem cell-like profile J Cell Biochem 2011 112 10 2850 2864 21618587 10.1002/jcb.23199 44 Xu W Foster BA Richards M et al Characterization of prostate cancer cell progression in zebrafish xenograft model Int J Oncol 2018 52 1 252 260 29115578 10.3892/ijo.2017.4189 PMC5743385 45 Wertman J Veinotte CJ Dellaire G et al The zebrafish xenograft platform: Evolution of a novel cancer model and preclinical screening tool Adv Exp Med Biol 2016 916 289 314 27165359 10.1007/978-3-319-30654-4_13 46 Evensen L Johansen PL Koster G et al Zebrafish as a model system for characterization of nanoparticles against cancer Nanoscale 2016 8 2 862 877 26648525 10.1039/c5nr07289a 47 Amatruda JF Shepard JL Stern HM et al Zebrafish as a cancer model system Cancer Cell 2002 1 3 229 231 12086858 10.1016/s1535-6108(02)00052-1 48 Ali Z Islam A Sherrell P et al Adjustable delivery of pro-angiogenic fgf-2 by collagen-alginate microspheres Biol Open 2018 12 7 1 36 10.1242/bio.027060 PMC5898261 29449216 49 Wang L Liu Y Wu L et al Sialyltransferase inhibition and recent advances Biochim Biophys Acta 2016 1864 1 143 153 26192491 10.1016/j.bbapap.2015.07.007 50 Bhide GP Colley KJ. Sialylation of n-glycans: mechanism, cellular compartmentalization and function Histochem Cell Biol 2017 147 2 149 174 27975143 10.1007/s00418-016-1520-x PMC7088086 51 Zhou X Chi K Zhang C et al Sialylation: a cloak for tumors to trick the immune system in the microenvironment Biology 2023 12 6 832 852 37372117 10.3390/biology12060832 PMC10294807 52 Dobie C Skropeta D. Insights into the role of sialylation in cancer progression and metastasis Br J Cancer 2021 124 1 76 90 33144696 10.1038/s41416-020-01126-7 PMC7782833 53 Natoni A Bohara R Pandit A et al Targeted approaches to inhibit sialylation of multiple myeloma in the bone marrow microenvironment Front Bioeng Biotechnol 2019 7 252 260 31637237 10.3389/fbioe.2019.00252 PMC6787837 54 Macauley MS Arlian BM Rillahan CD et al Systemic blockade of sialylation in mice with a global inhibitor of sialyltransferases J Biol Chem 2014 289 51 35149 35158 25368325 10.1074/jbc.M114.606517 PMC4271204 55 Büll C Boltje TJ Wassink M et al Targeting aberrant sialylation in cancer cells using a fluorinated sialic acid analog impairs adhesion, migration, and in vivo tumor growth Mol Cancer Ther 2013 12 10 1935 1946 23974695 10.1158/1535-7163.MCT-13-0279 56 Natoni A Farrell ML Harris S et al Sialyltransferase inhibition leads to inhibition of tumor cell interactions with e-selectin, vcam1, and madcam1, and improves survival in a human multiple myeloma mouse model Haematologica 2020 105 2 457 467 31101754 10.3324/haematol.2018.212266 PMC7012485 57 Kowald S Huge Y Tandiono D et al Novel zebrafish patient-derived tumor xenograft methodology for evaluating efficacy of immune-stimulating bcg therapy in urinary bladder cancer Cells 2023 12 3 508 523 36766850 10.3390/cells12030508 PMC9914090 58 Ali Z Mukwaya A Biesemeier A et al Intussusceptive vascular remodeling precedes pathological neovascularization Arterioscler Thromb Vasc Biol 2019 39 7 1402 1418 31242036 10.1161/ATVBAHA.118.312190 PMC6636809 59 Graziola F Candido TM Oliveira CAD et al Gelatin-based microspheres crosslinked with glutaraldehyde and rutin oriented to cosmetics Braz J Pharm Sci 2016 52 4 603 612 60 King D Glynn M Cindric S et al Label-free multi parameter optical interrogation of endothelial activation in single cells using a lab on a disc platform Sci Rep 2019 9 1 4157 4160 30858536 10.1038/s41598-019-40612-8 PMC6411894 61 Burger R Reith P Kijanka G et al Array-based capture, distribution, counting and multiplexed assaying of beads on a centrifugal microfluidic platform Lab Chip 2012 12 7 1289 1295 22334354 10.1039/c2lc21170j 62 Burger R Kurzbuch D Gorkin R et al An integrated centrifugo-opto-microfluidic platform for arraying, analysis, identification and manipulation of individual cells Lab Chip 2015 15 2 378 381 25407668 10.1039/c4lc01002g 63 Gao W Fang RH Thamphiwatana S et al Modulating antibacterial immunity via bacterial membrane-coated nanoparticles Nano Lett 2015 15 2 1403 1409 25615236 10.1021/nl504798g PMC4399974 64 Chen W Zhang Q Luk BT et al Coating nanofiber scaffolds with beta cell membrane to promote cell proliferation and function Nanoscale 2016 8 19 10364 10370 27139582 10.1039/c6nr00535g PMC4866884 65 Xuan M Shao J Zhao J et al Magnetic mesoporous silica nanoparticles cloaked by red blood cell membranes: applications in cancer therapy Angew Chem Int Ed 2018 57 21 6049 6053 10.1002/anie.201712996 29480962 66 Cutrona MB Simpson JC. A high-throughput automated confocal microscopy platform for quantitative phenotyping of nanoparticle uptake and transport in spheroids Small 2019 15 37 10.1002/smll.201902033 31334922 67 Fernández-Barral A Orgaz JL Baquero P et al Regulatory and functional connection of microphthalmia-associated transcription factor and anti-metastatic pigment epithelium derived factor in melanoma Neoplasia 2014 16 6 529 542 25030625 10.1016/j.neo.2014.06.001 PMC4198745 68 Ali Z Vildevall M Rodriguez GV et al Zebrafish patient-derived xenograft models predict lymph node involvement and treatment outcome in non-small cell lung cancer J Exp Clin Cancer Res 2022 41 1 58 75 35139880 10.1186/s13046-022-02280-x PMC8827197 69 Rebelo AL Contessotto P Joyce K et al An optimized protocol for combined fluorescent lectin/immunohistochemistry to characterize tissue-specific glycan distribution in human or rodent tissues STAR Protoc 2021 2 1 100237 100254 33364625 10.1016/j.xpro.2020.100237 PMC7753946 70 Swift BE Williams BA Kosaka Y et al Natural killer cell lines preferentially kill clonogenic multiple myeloma cells and decrease myeloma engraftment in a bioluminescent xenograft mouse model Haematologica 2012 97 7 1020 1028 22271890 10.3324/haematol.2011.054254 PMC3396673 71 Yagita M Huang CL Umehara H et al A novel natural killer cell line (khyg-1) from a patient with aggressive natural killer cell leukemia carrying a p53 point mutation Leukemia 2000 14 5 922 930 10803526 10.1038/sj.leu.2401769 72 Suck G Tan SM Chu S et al Khyg-1 and nk-92 represent different subtypes of lfa-1-mediated nk cell adhesiveness Front Biosci 2011 3 1 166 178 10.2741/e230 21196295 73 Harris P Normand V Norton IT et al Gelatin Caballero B Finglas P Toldra F Encyclopedia of food scien-ces and nutrition 2003 Academic Press 2865 2871 74 Hanani ZAN Gelatin Caballero B Finglas P Toldra F 2016 Academic Press 191 195 75 Nguyen AH McKinney J Miller T et al Gelatin methacrylate microspheres for controlled growth factor release Acta Biomater 2015 13 101 110 25463489 10.1016/j.actbio.2014.11.028 PMC4293288 76 Damink LHHO Dijkstra PJ Luyn MJA et al Glutaraldehyde as a crosslinking agent for collagen-based biomaterials J Mater Sci Mater Med 1995 6 460 472 77 Farris S Song J Huang Q. Alternative reaction mechanism for the cross-linking of gelatin with glutaraldehyde J Agric Food Chem 2010 58 2 998 1003 20043635 10.1021/jf9031603 78 Kunishima M Kawachi C Hioki K et al Formation of carboxamides by direct condensation of carboxylic acids and amines in alcohols using a new alcohol- and watersoluble condensing agent: DMT-MM Tetrahedron 2001 57 8 1551 1558 79 D’Este M Eglin D Alini M A systematic analysis of DMTMM vs EDC/NHS for ligation of amines to hyaluronan in water Carbohydr Polym 2014 108 239 246 24751270 10.1016/j.carbpol.2014.02.070 80 Ichise H Tsukamoto S Hirashima T et al Functional visualization of nk cell-mediated killing of metastatic single tumor cells eLife 2022 11 10.7554/eLife.76269 PMC8849286 35113018 81 Hayashi K Yamada S Hayashi H et al Red blood cell-like particles with the ability to avoid lung and spleen accumulation for the treatment of liver fibrosis Biomaterials 2018 156 45 55 29190497 10.1016/j.biomaterials.2017.11.031 82 Hayashi K Yamada S Sakamoto W et al Red blood cell-shaped microparticles with a red blood cell membrane demonstrate prolonged circulation time in blood ACS Biomater Sci Eng 2018 4 8 2729 2732 33434998 10.1021/acsbiomaterials.8b00197 83 Dulińska I Targosz M Strojny W et al Stiffness of normal and pathological erythrocytes studied by means of atomic force microscopy J Biochem Biophys Methods 2006 66 1–3 1 11 16443279 10.1016/j.jbbm.2005.11.003 84 Bufi N Saitakis M Dogniaux S et al Human primary immune cells exhibit distinct mechanical properties that are modified by inflammation Biophys J 2015 108 9 2181 2190 25954876 10.1016/j.bpj.2015.03.047 PMC4423053 85 Hu M Wang J Zhao H et al Nanostructure and nanomechanics analysis of lymphocyte using AFM: from resting, activated to apoptosis J Biomech 2009 42 10 1513 1519 19477449 10.1016/j.jbiomech.2009.03.051 86 Lee YJ Patel D Park S. Local rheology of human neutrophils investigated using atomic force microscopy Int J Biol Sci 2011 7 102 111 21278920 10.7150/ijbs.7.102 PMC3030146 87 Kaur M Hardman A Melia CD et al Improved SDS-page molecular weight determination of a succinylated limed ossein gelatin Int J Polym Anal Charact 2002 7 3 195 209 88 Hummel KM Penheiter AR Gathman AC et al Anomalous estimation of protease molecular weights using gelatin-containing sds-page Anal Biochem 1996 233 140 142 8789159 10.1006/abio.1996.0019 89 Mad-Ali S Benjakul S Prodpran T et al Characteristics and gel properties of gelatin from goat skin as influenced by alkaline-pretreatment conditions Asian-Australas J Anim Sci 2016 29 6 845 854 26954127 10.5713/ajas.15.0784 PMC4852252 90 Adibnia V Mirbagheri M Salimi S et al Nonspecific interactions in biomedical applications Curr Opin Colloid Interface Sci 2020 47 70 83 91 Chen J Almo SC Wu Y. General principles of binding between cell surface receptors and multi-specific ligands: a computational study PLoS Comput Biol 2017 13 10 10.1371/journal.pcbi.1005805 PMC5654264 29016600 92 Chew SA Hinojosa VA Arriaga MA Bioresorbable polymer microparticles in the medical and pharmaceutical fields Perale G Hilborn J Bioresorbable polymers for biomedical applications 2017 Woodhead Publishing 229 264 93 Chanput W Mes JJ Wichers HJ. Thp-1 cell line: an in vitro cell model for immune modulation approach Int Immunopharmacol 2014 23 1 37 45 25130606 10.1016/j.intimp.2014.08.002 94 Zuba-Surma EK Kucia M Abdel-Latif A et al The imagestream system: a key step to a new era in imaging Folia Histochem Cytobiol 2007 45 4 279 290 18165167 95 Mittar D Paramban RMC Flow cytometry and high-content imaging to identify markers of monocyte-macrophage differentiation BD Biosciences 2011 5 1 1 19 96 Headland SE Jones HR D’Sa AS et al Cutting-edge analysis of extracellular microparticles using imagestream(x) imaging flow cytometry Sci Rep 2014 4 5237 5246 24913598 10.1038/srep05237 PMC4050385 97 Godino E Restrepo Sierra AM Danelon C. Imaging flow cytometry for high-throughput phenotyping of synthetic cells ACS Synth Biol 2023 12 7 2015 2028 37155828 10.1021/acssynbio.3c00074 PMC10367129 98 Yu Y. The function of nk cells in tumor metastasis and nk cell-based immunotherapy Cancers 2023 15 8 2323 2351 37190251 10.3390/cancers15082323 PMC10136863 99 Peipp M Klausz K Boje AS et al Immunotherapeutic targeting of activating natural killer cell receptors and their ligands in cancer Clin Exp Immunol 2022 209 1 22 32 35325068 10.1093/cei/uxac028 PMC9307233 100 Zheng Q Gao J Yin P et al Cd155 contributes to the mesenchymal phenotype of triple-negative breast cancer Cancer Sci 2020 111 2 383 394 31830330 10.1111/cas.14276 PMC7004517 101 Martin TA Lane J Harrison GM et al The expression of the nectin complex in human breast cancer and the role of nectin-3 in the control of tight junctions during metastasis PLoS One 2013 8 12 10.1371/journal.pone.0082696 PMC3873263 24386110 102 Zhang B Sun J Yao X et al Knockdown of b7h6 inhibits tumor progression in triple-negative breast cancer Oncol Lett 2018 16 1 91 96 29963127 10.3892/ol.2018.8689 PMC6019890 103 Shen J Pan J Du C et al Silencing nkg2d ligand-targeting mirnas enhances natural killer cell-mediated cytotoxicity in breast cancer Cell Death Discov 2017 8 4 10.1038/cddis.2017.158 PMC5477582 28383557 104 Pinto B Henriques AC Silva PMA et al Three-dimensional spheroids as in vitro preclinical models for cancer research Pharmaceutics 2020 12 12 1186 1223 33291351 10.3390/pharmaceutics12121186 PMC7762220 105 Metzger W Rother S Pohlemann T et al Evaluation of cell-surface interaction using a 3d spheroid cell culture model on artificial extracellular matrices Mater Sci Eng C Mater Biol Appl 2017 73 310 318 28183614 10.1016/j.msec.2016.12.087 106 Jin AL Zhang CY Zheng WJ et al Cd155/src complex promotes hepatocellular carcinoma progression via inhibiting the p38 mapk signalling pathway and correlates with poor prognosis Clin Transl Med 2022 12 4 10.1002/ctm2.794 PMC8982318 35384345 107 Cao W Xi X Wang Z et al Four novel ulbp splice variants are ligands for human nkg2d Int Immunol 2008 20 8 981 991 18544572 10.1093/intimm/dxn057 108 Chen L Feng J Xu B et al Expression of b7-h6 expression in human hepatocellular carcinoma and its clinical significance Cancer Cell Int 2018 18 126 135 30186042 10.1186/s12935-018-0627-7 PMC6122564 109 Zheng Q Wang B Gao J et al CD155 knockdown promotes apoptosis via AKT/Bcl-2/Bax in colon cancer cells J Cell Mol Med 2018 22 1 131 140 28816021 10.1111/jcmm.13301 PMC5742678 110 Zhand S Hosseini S Tabarraei M et al Analysis of poliovirus receptor, cd155 expression in different human colorectal cancer cell lines: implications for poliovirus virotherapy J Cancer Res Ther 2019 15 1 61 67 30880756 10.4103/jcrt.JCRT_13_17 111 Kalousková B Skořepa O Cmunt D et al Tumor marker b7-h6 bound to the coiled coil peptide-polymer conjugate enables targeted therapy by activating human natural killer cells Biomedicines 2021 9 11 1597 1616 34829829 10.3390/biomedicines9111597 PMC8615638 112 Astell KR Sieger D. Zebrafish in vivo models of cancer and metastasis Cold Spring Harb Perspect Med 2020 10 8 1 17 10.1101/cshperspect.a037077 PMC7397842 31615862 113 Guo P Huang J Wang L et al Icam-1 as a molecular target for triple negative breast cancer Proc Natl Acad Sci U S A 2014 111 41 14710 14715 25267626 10.1073/pnas.1408556111 PMC4205631 114 Zhu L Mu Q Yu J et al Icam-1 targeted drug combination nanoparticles enhanced gemcitabine-paclitaxel exposure and breast cancer suppression in mouse models Pharmaceutics 2021 14 1 89 104 35056985 10.3390/pharmaceutics14010089 PMC8779833 115 Pensado-López A Fernández-Rey J Reimunde P et al Zebrafish models for the safety and therapeutic testing of nanoparticles with a focus on macrophages Nanomaterials 2021 11 7 1784 1817 34361170 10.3390/nano11071784 PMC8308170 116 Szabo R Skropeta D. Advancement of sialyltransferase inhibitors: therapeutic challenges and opportunities Med Res Rev 2017 37 2 219 270 27678392 10.1002/med.21407 117 Izumi M Wada K Yuasa H et al Synthesis of bisubstrate and donor analogues of sialyltransferase and their inhibitory activities J Org Chem 2005 70 22 8817 8824 16238314 10.1021/jo0512608 118 Lee L Chang K Valiyev F et al Synthesis and biological evaluation of 5′-Triazole nucleosides J Chin Chem Soc 2006 53 6 1547 1555 119 Niu X Fan X Sun J et al Inhibition of fucosyltransferase vii by gallic acid and its derivatives Arch Biochem Biophys 2004 425 1 51 57 15081893 10.1016/j.abb.2004.02.039 ",
  "metadata": {
    "Title of this paper": "Inhibition of fucosyltransferase vii by gallic acid and its derivatives",
    "Journal it was published in:": "Journal of Tissue Engineering",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477366/"
  }
}