{
  "title": "Paper_415",
  "abstract": "pmc Front Endocrinol (Lausanne) Front Endocrinol (Lausanne) 1753 frontendo Front. Endocrinol. Frontiers in Endocrinology 1664-2392 Frontiers Media SA PMC12483926 PMC12483926.1 12483926 12483926 41040853 10.3389/fendo.2025.1546512 1 Endocrinology Review The strategic role of lipidomics in biomarker identification and diagnosis of gynecological diseases Hou Menghui  † Chu Xinying  † Wang Shuxin Zhang Qingyue Ma Mingjie Ma Jing  *  First Teaching Hospital of Tianjin University of Traditional Chinese Medicine, National Clinical Research Center for Chinese Medicine Acupuncture and Moxibustion Tianjin China Edited by: Richard Ivell Reviewed by: Yue Gao  Manuela Machado *Correspondence: Jing Ma, majing2609@163.com †These authors have contributed equally to this work and share first authorship 17 9 2025 2025 16 480647 1546512 17 12 2024 01 9 2025 17 09 2025 02 10 2025 03 10 2025 Copyright © 2025 Hou, Chu, Wang, Zhang, Ma and Ma. 2025 Hou, Chu, Wang, Zhang, Ma and Ma https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Lipidomics, an emerging field in medical research, has deepened our understanding of lipid metabolism, signal transduction pathways, and intercellular communication through qualitative and quantitative analyses of patient lipid profiles. It has closely linked these biological processes to the occurrence and progression of diseases, opening new avenues of research and providing new perspectives on the diagnosis, treatment, and personalized medicine of clinical diseases. Gynecological diseases have a profound impact on women’s health but often face challenges due to delayed diagnosis and inadequate treatment options. Lipids play a crucial role in regulating cell proliferation, differentiation, and signal transduction, making them significant in the occurrence and development of gynecological diseases. The technological progress in lipidomics has greatly advanced our comprehension of lipid metabolism and biochemical mechanisms in these diseases, while also offering new technical pathways for identifying potential biomarkers. Thus, this review summarized the application of lipidomics in gynecological diseases, especially those with high incidence rates such as ovarian cancer, cervical cancer, and endometriosis, to assesses its application potential in the diagnosis, prognosis monitoring, and development of new treatment strategies for gynecological diseases, and discusses its future development trends. lipidomics gynecological diseases diagnosis mass spectrometry treatment cell-cell communication The author(s) declare financial support was received for the research and/or publication of this article. This study was supported by funds from the Science and Technology Project of Haihe Laboratory of Modern Chinese Medicine (24HHZYSS00014). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Reproduction 1 Introduction Omics technologies have been widely applied in the field of life sciences to systematically investigate the structure and function of organisms, aiming to uncover regulatory mechanisms. These technologies play a pivotal role in disease diagnosis, treatment, and prognosis, and are considered one of the important technical tools for advancing precision medicine. Among them, genomics serves as the foundation of omics research, providing genetic information of an organism; epigenomics investigates the regulatory mechanisms that control gene expression through chemical modifications such as DNA methylation and histone modifications; transcriptomics focuses on gene expression patterns and transcriptional regulation, revealing dynamic changes in gene expression; proteomics explores the structure and functional states of proteins, the final products of gene expression; and metabolomics analyzes small molecule metabolites and their dynamic changes within the organism. Lipidomics, focusing specifically on lipids, investigates their diverse structures, functions, and dynamic alterations. Lipids, as crucial components of cellular metabolism, reflect the ultimate effects of gene expression and protein activity under various physiological and pathological conditions. These omics disciplines complement and support each other, collectively contributing to biomarker screening, disease mechanism research, drug target identification, disease stratification, and the provision of personalized treatment.  Figure 1 Figure 1 An introduction to multi-omics functions. Diagram illustrating the interaction between environment and genetics in health and disease through various omics layers. From bottom to top: Genomics (DNA structure), Epigenetics (DNA modifications), Transcriptomics (RNA transcription), Proteomics (protein function), Metabolomics (metabolite dynamics), and Lipidomics (lipid functions). The left side shows ascending processes from “Plan” to “Result” related to health, while the right side indicates progression towards disease. Lipid metabolism, constituting approximately 70% of the metabolites in plasma, represents a fundamental component of the human metabolic network. Lipids, as major components of cell membranes and lipid droplets, are deeply involved in critical biological processes such as signal transduction, energy supply, and intercellular communication ( 1 2 Lipids play a crucial multidimensional role in the pathophysiology of gynecological diseases, influencing cellular function, signal transduction, energy metabolism, and inflammatory responses ( 3 4 6 7 2 Lipidomics strategy and process: an overview 2.1 Lipid classification and function Lipids are part of biological membranes and are involved in the regulation of cellular activities such as signaling, immune response, and energy storage. They play essential roles in cell proliferation, survival, death, and intercellular interactions, and are constantly changing along with physiological, pathological, and environmental changes, thereby affecting the development of various diseases such as metabolic diseases, cardiovascular diseases and tumors ( 8 9 10 11 12 13 14 16  Figure 2 Figure 2 Lipid classification and function. Illustration showing lipid types and their functions in a cell. The central part depicts cell structures like the nucleus, Golgi, and endoplasmic reticulum, highlighting processes like ion channels and signal transduction. The enlarged section displays the cell membrane, featuring the phospholipid bilayer, glycoproteins, and cholesterol. Surrounding the cell are lipid categories: sterols, fatty acids, prenols, sphingolipids, polyketides, glycerophospholipids, glycerolipids, and saccharolipids, each labeled with their roles, including metabolism regulation, energy supply, endocrinology participation, and membrane formation. 2.2 Selection of appropriate lipidomics strategies for analysis Lipidomics is the comprehensive, systematic, qualitative, and quantitative analysis and identification of lipids in organisms, tissues, and cells. The core objective of lipidomics is to elucidate the basic structure and function of lipids. By comparing the changes in lipids and their interacting molecules across different pathophysiological states, researchers can uncover the underlying relationship between lipid metabolism and physiological and pathological processes in cells, organs, and organisms. This analytical approach shows significant potential in exploring the pathogenesis of clinical diseases, identifying potential therapeutic targets, and discovering biomarkers for early diagnosis and prognostic monitoring ( 17 Lipidomics technology has evolved over the past three decades, encompassing key methodological processes including lipid extraction, separation, analysis, identification, and bioinformatic interpretation ( 18 19 20 The selection of an appropriate analytical strategy is crucial for the successful implementation of lipidomics studies. Mass spectrometry (MS)-based lipidomics can be categorized into targeted, untargeted, and pseudo-targeted approaches, each suitable for different research contexts and emphases, enabling comprehensive lipid profiling from various perspectives. Choosing the most appropriate strategy based on specific research objectives ensures both the accuracy and the interpretive value of the lipidomics data. 2.2.1 Untargeted lipidomics Untargeted lipidomics is a comprehensive and exploratory analytical approach, which aims to provide a comprehensive and unbiased analysis of organismal lipids by identifying global changes and the abundance of lipid molecules. HRMS is the tool of choice for non-targeted lipidomic analyses because of its excellent mass resolution and accuracy, particularly for elucidating the structural composition of lipids ( 21 22 2.2.2 Targeted lipidomics Targeted lipidomics allows the precise identification and quantification of specific lipid molecules with higher accuracy and sensitivity. This approach is often used to validate key lipid molecules or potential biomarkers that have been initially identified through non-targeted lipidomics analyses ( 23 24 2.2.3 Pseudo-targeted lipidomics Pseudo-targeted lipidomics combines the advantages of both targeted and non-targeted lipidomics to ensure the detection of a sufficient number of compounds and their quantitative accuracy ( 25 26 2.3 Lipidomics methods and procedures The lipidomics workflow is a complex and intricate process that encompasses the interdisciplinary intersection of chemistry, biology, computer science, and medicine ( 27  Figure 3 Figure 3 Lipidomics analysis process. Flowchart illustrating the lipidomics analysis process. Step 1 involves lipidomics strategy with targeted, untargeted, and pseudotargeted lipidomics. Step 2 focuses on lipid extraction from blood, urine, tissues, and cells using LLE, SPME, and SPE. Step 3 covers MS-based lipidomics analysis using TLC-MS, GC-MS, LC-MS, and MSI with data acquisition methods including PRM, MRM, and DIA, applied for accurate lipid quantification and biomarker identification. Step 4 involves data processing and analysis with peak assignment, species identification, and bioinformatics for statistical and pathway analysis. 2.3.1 Sample selection Various biological samples such as tissue, plasma, serum, urine, and exosomes can be used for lipidomic studies. To ensure the quality of the samples, they are quickly frozen in liquid nitrogen and stored at ultra-low temperatures to inhibit enzymatic activity and prevent lipid degradation. The sample should be homogenized to ensure that the extracted lipids are representative of the entire sample ( 28 2.3.2 Lipid extraction Lipidomics requires efficient and reproducible sample extraction methods that cover a wide range of analytes. Commonly used extraction techniques include liquid-liquid extraction (LLE), solid-phase extraction (SPE), and solid-phase microextraction (SPME). SPE effectively enriches lipids with a very low endogenous abundance and is suitable for targeted lipidomic analysis, whereas LLE achieves comprehensive lipid extraction and is the most commonly used and well-established technique for non-targeted whole-lipid analysis ( 29 30 31 32 2.3.3 Detection based on MS separation Mass spectrometry-based separation and identification are central to lipidomics analysis. Lipid samples are typically first separated using chromatography techniques and subsequently identified by HRMS to determine lipid types, structural characteristics, and molecular weights. MS has become an essential tool in lipidomics research due to its high sensitivity, high resolution, and molecular specificity ( 33 34 35 36 In complex lipid analysis, liquid chromatography-mass spectrometry (LC-MS) is widely employed due to its high accuracy, sensitivity and resolution, making it a primary technique for studying complex lipid mixtures. Gas chromatography-mass spectrometry (GC-MS) exhibits excellent separation capabilities, particularly for volatile compounds. Shotgun lipidomics enables high-throughput analysis through direct infusion without the need for complex separation steps, allowing for rapid generation of large-scale, high-quality data, demonstrating substantial potential for various applications ( 37 During MS analysis, ionized lipid compounds are analyzed based on their mass-to-charge ratio (m/z). Quadrupole mass analyzers serve as mass filters, allowing only ions within specific m/z ranges to pass through, while time-of-flight (TOF), orbitrap, and Fourier-transform ion cyclotron resonance (FT-ICR) analyzers can acquire high-resolution spectra in a single scan. TOF analyzers determine m/z by measuring the time ions take to travel through the flight tube, while orbitrap analyzers detect image currents from trapped ions and generate spectra via Fourier transform. These high-resolution analyzers offer significant advantages for the analysis of complex samples. Tandem MS (MS/MS), which involves multiple mass analyzers, further enhances lipid molecule identification and structural elucidation. Nuclear Magnetic Resonance technology, due to its non-destructive testing advantages and efficient extraction capabilities for molecular structural information, remains an indispensable and powerful tool in lipidomics research. The selection of an appropriate analytical method based on the lipid type is essential for achieving effective detection and precise characterization. 2.3.4 Data processing and raw data analysis Following lipidomic profiling to obtain qualitative and quantitative data, rigorous data processing and analysis become imperative for discerning biologically relevant lipid species and characterizing their potential functional roles ( 38 39 40 41 42 Lipidomics analyses routinely generate extensive multidimensional datasets, highlighting the critical need for appropriate software platforms to facilitate lipid identification, quantification, bioinformatics analysis, and data visualization ( 43 44 3 The strategic role of lipidomics in the diagnosis and treatment of gynecological diseases 3.1 Differences in lipidomic analysis in gynecological diseases Lipidomics enables comprehensive characterization of lipid profiles through qualitative and quantitative analyses, providing insights into lipid composition, signaling pathways, and their functional associations with disease states ( 45  Figure 4 Figure 4 Gynecological diseases with lipid metabolism abnormalities. Illustration of the female reproductive system with conditions such as PCOS, menopause, ovarian cancer, endometriosis, cervical cancer, and endometrial cancer. Each condition highlights changes in lipid profiles, indicated by upward or downward arrows for various lipid types, including TAG, LPC, SM, LPE, and others. 3.1.1 Ovarian cancer Ovarian cancer, a prevalent gynecological malignancy with frequently poor prognosis due to late detection, demonstrates significant lipid dysregulation that critically influences cancer cell survival, proliferation, and invasion. Multiple lipid classes including lysophosphatidylcholines (LPCs), phosphatidylcholines (PCs), ceramides (Cers), and TGs contribute to oncogenic processes in ovarian cancer development ( 46 47 47 49 50 51 52 53 54 55 48 46 56 3.1.2 Cervical cancer and cervical intraepithelial neoplasia Cervical cancer, a prevalent malignancy in women, frequently arises from CIN, with high-risk human papillomavirus (HPV) infection playing a pivotal role in its pathogenesis. Emerging evidence highlights the significance of lipid metabolism dysregulation in cervical carcinogenesis ( 57 58 59 3.1.3 Endometrial cancer Abnormal lipid metabolism is a key contributing factor in the pathogenesis of endometrial cancer. Studies analyzing endometrial cancer and healthy human serum using targeted lipidomics have identified sphingolipid (SP) and glycerophospholipid (GP) metabolism as the most significantly altered pathways ( 60 61 62 63 3.1.4 Polycystic ovary syndrome Approximately 70% of patients with PCOS have abnormal lipid metabolism involving various metabolic pathways, such as FAs, GLs and GPs metabolism ( 64 65 66 67 69 69 3.1.5 Endometriosis Endometriosis has features such as invasion, implantation, and metastasis, which are similar to those of malignant tumors, making early recognition and diagnosis important ( 70 71 in situ 72 73 74 3.1.6 Other gynecological diseases Lipid levels in pregnant women with hypothyroidism differ significantly from those in healthy pregnant women and are associated with adverse pregnancy outcomes. Studies using untargeted LC-MS found that PCs and PEs levels were elevated, whereas SMs was downregulated in pregnant women with hypothyroidism compared to normal pregnant women ( 75 76 78 3.2 Diagnostic and treatment value of lipidomics in gynecological diseases 3.2.1 Potential as a diagnostic marker Lipidomics has emerged as a powerful approach for elucidating the pathogenesis of gynecological diseases through comprehensive qualitative and quantitative analysis of lipid profiles. These investigations provide critical insights for disease diagnosis and therapeutic development. As summarized in  Figure 5  Table 1 Figure 5 Lipids involved in diagnostic markers for gynecological diseases. Graphic illustrating relationships between various gynecological and hormonal conditions with lipid components in cell membranes. Conditions include ovarian cancer, cervical cancer, endometrial cancer, endometriosis, hypothyroidism in pregnancy, and PCOS. Lipid components PC, PE, SM, Cer, and cholesterol are connected to these conditions with lines. A diagram below shows membrane changes: loss of bilayer asymmetry, increased membrane deformability, and increased rigidity/decreased fluidity. Table 1 Lipid biomarkers and analytical strategies for gynecological diseases. Gynecological diseases Lipids biomarkers Analytical strategy MS References Ovarian cancer lysoPC a C16:1, PC aa C32:2, PC aa C34:4, and PC aa C 36:6 targeted UHPLC-MS ( 79 C16-Cer, C18:1-Cer, and C18-Cer targeted UHPLC/MS/MS ( 82 LPA, PPE, LPC (14:0, 12:0) with CA125 targeted ESI/LC - MS ( 49 Cer(d18:1/16:0), PC-O(36:2), PE (16:0p_18:1) and (O-acyl)-1-hydroxy FA (18:2_24:6) untargeted UPLC-MS ( 80 lysophosphatidylglycerol (20:5) untargeted UPLC/MS ( 83 Cervical cancer and cervical intraepithelial neoplasia PC 14:0/18:2, PE 15:1e/22:6, and PE 16:1e/18:2 untargeted UHPLC/Q-TOF-MS ( 59 Cer CE (29:1), sphinganine (d18:0) and a Cer could not be firmly characterized untargeted HLPC/Q-TOF-MS ( 94 prostaglandins, PLs, SFs, Tetranor-PGFM and hydroperoxide lipid untargeted ESI/Q-Orbitrap MS ( 95 LPC O-16:0, PE P-16:0/20:4, and sphingomyelins SM d16:0/18:1, SM d22:0/20:3, SM d18:0/16:0 untargeted ESI-QTOF MS ( 96 Endometrial cancer 6-keto-PGF1α, PA (37:4), LysoPC (20:1) and PS (36:0) untargeted UPLC-Q-TOF/MS ( 97 acylcarnitine C16: phosphatidylcholine PCae C40:1, proline: tyrosine, PCaa C42:0 and PCae C44:5 targeted ESI-MS ( 98 Endometriosis hydroxyl sphingomyelin SMOH C16:1, phosphatidylcholine PC aa C36:2, and ether PLs PCae C34:2 targeted ESI-MS/MS ( 74 DAG, TAG, LPI, acylcarnitine untargeted UPLC-MS ( 84 C0/PC ae C36:0 and PC aa C30:0/PC ae C32:2 targeted ESI-MS/MS ( 85 cardiolipin CL 16:0_18:0_22:5_22:6 and plasmenylethanolamine PE P-16:0/18:1 untargeted HPLC-MS ( 99 PCOS PI (18:0/20:3)-H and PE (18:1p/22:6)-H untargeted UHPLC-Q-Exactive Orbitrap MS ( 86 Cer (OH_N16:0/N18:0) and Cer (N22:0) untargeted MDMS-SL ( 87 In cervical carcinogenesis, dysregulated lipid metabolism has been implicated in the progression from cervical intraepithelial neoplasia to invasive carcinoma. Rapid shotgun lipidomics of cervical tissue transformation stages revealed significant alterations in PCs, LPCs, PEs, LPEs, and SMs compared to adjacent normal tissue. ESI-MS-based analysis identified 23 signature lipids strongly correlated (more than 90%) with cervical transformation grade, forming a diagnostic model with 88% sensitivity and 71% specificity ( 57 59 In ovarian cancer biology, lipid metabolism plays a crucial role, with emerging lipidomic signatures showing significant diagnostic potential. UHPLC-MS analyses have identified several novel lipid biomarkers, including lysophosphatidylcholines (LysoPC) a C16:1, PC aa C32:2, PC aa C34:4, and PC aa C36:6, which demonstrate clinical utility for ovarian cancer detection ( 79 80 81 82 83 SMs and PCs demonstrate significant associations with endometriosis pathogenesis. ESI-MS analysis identified a diagnostic model incorporating hydroxyl sphingomyelin SM (OH) C16:1, phosphatidylcholine PC aa C36:2, and ether phospholipid PC ae C34:2, which achieved 90.0% sensitivity and 84.3% specificity for detecting ovarian endometriosis ( 74 84 85 Recent lipidomics studies have identified several lipid species as potential biomarkers for PCOS. PI) (18:0/20:3)-H and PE (18:1p/22:6)-H were proposed as diagnostic candidates, with a biomarker panel achieving an area under the curve (AUC) of 0.815 in the test set, demonstrating 74% accuracy, 88% specificity, and 70% sensitivity ( 86 87 85 3.2.2 Potential for treatment and prognosis Lipidomics has uncovered fundamental alterations in lipid metabolism that provide novel targets for the diagnosis and treatment of gynecologic malignancies. In ovarian cancer, bioactive lipids such as Cers, sphingosine, and S1P critically regulate tumor angiogenesis and metastatic progression, offering promising avenues for both biomarker development and targeted therapy ( 48 88 89 90 In endometrial cancer, lipidomic profiling enables preoperative risk stratification to guide surgical management, while metabolic interventions such as stearoyl-CoA desaturase 1 (SCD1) inhibition suppress tumor growth ( 88 91 93 89 The integration of lipidomics with multi-omics approaches is revolutionizing our understanding of gynecologic diseases, revealing not only disease-specific lipid signatures but also actionable therapeutic vulnerabilities ( 92 93 4 Conclusion In this comprehensive review, we have delineated the strategic significance of lipidomics in the diagnostic and therapeutic landscape of gynecological diseases, with a particular emphasis on its role in ovarian, cervical, and endometrial pathologies. The aberrations in lipid metabolism are not only a common pathological hallmark of these diseases but also intricately linked to disease progression. Advances in high-resolution mass spectrometry have propelled lipidomics forward, enabling detailed structural elucidation of lipids, identification of novel lipid species, and quantification of lipid abundance, thereby unlocking new avenues for the discovery of biomarkers and therapeutic targets in gynecological diseases. Despite the substantial potential demonstrated by lipidomics in gynecological research, challenges remain in the realms of data standardization, clinical translation, and complex data analysis. Heterogeneity in sample preparation and variability in preprocessing can lead to inconsistent outcomes, while the sophisticated nature of data analysis necessitates specialized bioinformatics support, limiting its broader clinical application. Future studies should prioritize the optimization of sample processing workflows and analytical protocols to enhance precision and reproducibility of lipidomic research. As innovations in material science, analytical instrumentation, and artificial intelligence continue to evolve, lipidomic analysis is expected to become increasingly precise, high-throughput, and clinically applicable. Lipidomics is poised to play a central role in the era of precision medicine by enabling mechanistic insights into disease pathogenesis and supporting the development of individualized therapeutic strategies. Beyond treatment, lipidomics also holds significant promise for disease prevention and early diagnosis, offering a window of opportunity for timely intervention. With the ongoing integration of lipidomics into multi-omics frameworks, a more comprehensive understanding of gynecological diseases is emerging. This systems-level approach will empower clinicians and researchers alike to identify novel biomarkers, refine risk stratification, and design mechanism-based therapies, ultimately advancing the standard of care and improving patient outcomes in gynecological medicine. Author contributions MH: Writing – original draft, Writing – review & editing. XC: Writing – original draft. SW: Writing – original draft. QZ: Writing – original draft. MM: Writing – original draft. JM: Writing – original draft, Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1 Shevchenko A Simons K Lipidomics: coming to grips with lipid diversity Nat Rev Mol Cell Biol 2010 11 593–8 10.1038/nrm2934 20606693 2 Hornburg D Wu S Moqri M Zhou X Contrepois K Bararpour N Dynamic lipidome alterations associated with human health, disease and ageing Nat Metab 2023 5 1578–94 10.1038/s42255-023-00880-1 37697054 PMC10513930 3 Szanto M Gupte R Kraus WL Pacher P Bai P PARPs in lipid metabolism and related diseases Prog Lipid Res 2021 84 101117 10.1016/j.plipres.2021.101117 34450194 4 Wang X Li Y Hou X Li J Ma X Lipid metabolism reprogramming in endometrial cancer: biological functions and therapeutic implications Cell Commun Signal 2024 22 436 10.1186/s12964-024-01792-7 39256811 PMC11385155 5 Yuan L Jiang H Jia Y Liao Y Shao C Zhou Y Fatty acid oxidation supports lymph node metastasis of cervical cancer via acetyl-coA-mediated stemness Adv Sci (Weinh) 2024 11 e2308422 10.1002/advs.202308422 38520724 PMC11151054 6 Zipinotti Dos Santos D de Souza JC Pimenta TM da Silva Martins B Junior RSR Butzene SMS The impact of lipid metabolism on breast cancer: a review about its role in tumorigenesis and immune escape Cell Commun Signal 2023 21 161 10.1186/s12964-023-01178-1 37370164 PMC10304265 7 Wenk MR Lipidomics: new tools and applications Cell 2010 143 888–95 10.1016/j.cell.2010.11.033 21145456 8 Rustam YH Reid GE Analytical challenges and recent advances in mass spectrometry based lipidomics Anal Chem 2018 90 374–97 10.1021/acs.analchem.7b04836 29166560 9 Liebisch G Fahy E Aoki J Dennis EA Durand T Ejsing CS Update on LIPID MAPS classification, nomenclature, and shorthand notation for MS-derived lipid structures J Lipid Res 2020 61 1539–55 10.1194/jlr.S120001025 33037133 PMC7707175 10 Kostidis S Sanchez-Lopez E Giera M Lipidomics analysis in drug discovery and development Curr Opin Chem Biol 2023 72 102256 10.1016/j.cbpa.2022.102256 36586190 11 Han X Gross RW The foundations and development of lipidomics J Lipid Res 2022 63 100164 10.1016/j.jlr.2021.100164 34953866 PMC8953652 12 Li Y Ruan Q Li Y Ye G Lu X Lin X A novel approach to transforming a non-targeted metabolic profiling method to a pseudo-targeted method using the retention time locking gas chromatography/mass spectrometry-selected ions monitoring J Chromatogr A 2012 1255 228–36 10.1016/j.chroma.2012.01.076 22342183 13 Zullig T Trotzmuller M Kofeler HC Lipidomics from sample preparation to data analysis: a primer Anal Bioanal Chem 2020 412 2191–209 10.1007/s00216-019-02241-y 31820027 PMC7118050 14 O’Donnell VB FitzGerald GA Murphy RC Liebisch G Dennis EA Quehenberger O Steps toward minimal reporting standards for lipidomics mass spectrometry in biomedical research publications Circ Genom Precis Med 2020 13 e003019 10.1161/CIRCGEN.120.003019 33196315 PMC8376269 15 Bianco M Calvano CD Ventura G Losito I Cataldi TRI Proteomics for microalgae extracts by high-resolution mass spectrometry Methods Mol Biol 2024 2820 67 88 10.1007/978-1-0716-3910-8_8 38941016 16 Cajka T Hricko J Rudl Kulhava L Paucova M Novakova M Fiehn O Exploring the impact of organic solvent quality and unusual adduct formation during LC-MS-based lipidomic profiling Metabolites 2023 13 9 966 10.3390/metabo13090966 37755246 PMC10536874 17 Hondo T Ota C Miyake Y Furutani H Toyoda M Microscale supercritical fluid extraction combined with supercritical fluid chromatography and proton-transfer-reaction ionization time-of-flight mass spectrometry for a magnitude lower limit of quantitation of lipophilic compounds J Chromatogr A 2022 1682 463495 10.1016/j.chroma.2022.463495 36126560 18 Liu M Wei F Lv X Dong XY Chen H Rapid and sensitive detection of free fatty acids in edible oils based on chemical derivatization coupled with electrospray ionization tandem mass spectrometry Food Chem 2018 242 338–44 10.1016/j.foodchem.2017.09.069 29037698 19 Züllig T Köfeler HC High resolution mass spectrometry in lipidomics Mass Spectrom Rev 2021 40 162–76 10.1002/mas.21627 32233039 PMC8049033 20 Xia F Wan JB Chemical derivatization strategy for mass spectrometry-based lipidomics Mass Spectrom Rev 2023 42 432–52 10.1002/mas.21729 34486155 21 Xu T Hu C Xuan Q Xu G Recent advances in analytical strategies for mass spectrometry-based lipidomics Anal Chim Acta 2020 1137 156–69 10.1016/j.aca.2020.09.060 33153599 PMC7525665 22 Tokiyoshi K Matsuzawa Y Takahashi M Takeda H Hasegawa M Miyamoto J Using data-dependent and -independent hybrid acquisitions for fast liquid chromatography-based untargeted lipidomics Anal Chem 2024 96 991–6 10.1021/acs.analchem.3c04400 38206184 23 Zhao XE Zhu S Liu H Recent progresses of derivatization approaches in the targeted lipidomics analysis by mass spectrometry J Sep Sci 2020 43 1838–46 10.1002/jssc.201901346 32068330 24 Kontostathi G Makridakis M Zoidakis J Vlahou A Applications of multiple reaction monitoring targeted proteomics assays in human plasma Expert Rev Mol Diagn 2019 19 499 515 10.1080/14737159.2019.1615448 31057016 25 Zhang NR Hatcher NG Ekroos K Kedia K Kandebo M Marcus JN Validation of a multiplexed and targeted lipidomics assay for accurate quantification of lipidomes J Lipid Res 2022 63 100218 10.1016/j.jlr.2022.100218 35489416 PMC9168725 26 Bowden JA Ulmer CZ Jones CM Koelmel JP Yost RA NIST lipidomics workflow questionnaire: an assessment of community-wide methodologies and perspectives Metabolomics 2018 14 53 10.1007/s11306-018-1340-1 30830346 PMC11493135 27 Lisa M Cifkova E Khalikova M Ovcacikova M Holcapek M Lipidomic analysis of biological samples: Comparison of liquid chromatography, supercritical fluid chromatography and direct infusion mass spectrometry methods J Chromatogr A 2017 1525 96 108 10.1016/j.chroma.2017.10.022 29037587 28 Matyash V Liebisch G Kurzchalia TV Shevchenko A Schwudke D Lipid extraction by methyl-tert-butyl ether for high-throughput lipidomics J Lipid Res 2008 49 1137–46 10.1194/jlr.D700041-JLR200 18281723 PMC2311442 29 Ventura SPM E.S. FA Quental MV Mondal D Freire MG Coutinho JAP Ionic-liquid-mediated extraction and separation processes for bioactive compounds: past, present, and future trends Chem Rev 2017 117 6984 7052 10.1021/acs.chemrev.6b00550 28151648 PMC5447362 30 van de Velde B Guillarme D Kohler I Supercritical fluid chromatography - Mass spectrometry in metabolomics: Past, present, and future perspectives J Chromatogr B Analyt Technol BioMed Life Sci 2020 1161 122444 10.1016/j.jchromb.2020.122444 33246285 31 Baghdady YZ Schug KA Review of in situ J Sep Sci 2016 39 102–14 10.1002/jssc.201501003 26496130 32 Zaikin VG Borisov RS Options of the main derivatization approaches for analytical ESI and MALDI mass spectrometry Crit Rev Anal Chem 2022 52 1287–342 10.1080/10408347.2021.1873100 33557614 33 Domon B Aebersold R Mass spectrometry and protein analysis Science 2006 312 212–7 10.1126/science.1124619 16614208 34 Haag AM Mass analyzers and mass spectrometers Adv Exp Med Biol 2016 919 157–69 10.1007/978-3-319-41448-5_7 27975216 35 Abreu S Solgadi A Chaminade P Optimization of normal phase chromatographic conditions for lipid analysis and comparison of associated detection techniques J Chromatogr A 2017 1514 54 71 10.1016/j.chroma.2017.07.063 28774713 36 Pati S Nie B Arnold RD Cummings BS Extraction, chromatographic and mass spectrometric methods for lipid analysis BioMed Chromatogr 2016 30 695 709 10.1002/bmc.3683 26762903 PMC8425715 37 Xie H Sdougkou K Bonnefille B Papazian S Bergdahl IA Rantakokko P Chemical exposomics in human plasma by lipid removal and large-volume injection gas chromatography-high-resolution mass spectrometry Environ Sci Technol 2024 58 17592–605 10.1021/acs.est.4c05942 39376097 PMC11465644 38 Xie Y Wu Z Qin Z Wu B Lv X Wei F Methods of lipidomic analysis: extraction, derivatization, separation, and identification of lipids Adv Exp Med Biol 2021 1280 173–87 10.1007/978-3-030-51652-9_12 33791982 39 Ni Z Wolk M Jukes G Mendivelso Espinosa K Ahrends R Aimo L Guiding the choice of informatics software and tools for lipidomics research applications Nat Methods 2023 20 193 204 10.1038/s41592-022-01710-0 36543939 PMC10263382 40 Conroy MJ Andrews RM Andrews S Cockayne L Dennis EA Fahy E LIPID MAPS: update to databases and tools for the lipidomics community Nucleic Acids Res 2024 52 D1677–82 10.1093/nar/gkad896 37855672 PMC10767878 41 Sud M Fahy E Cotter D Azam K Vadivelu I Burant C Metabolomics Workbench: An international repository for metabolomics data and metadata, metabolite standards, protocols, tutorials and training, and analysis tools Nucleic Acids Res 2016 44 D463–70 10.1093/nar/gkv1042 26467476 PMC4702780 42 Haug K Cochrane K Nainala VC Williams M Chang J Jayaseelan KV MetaboLights: a resource evolving in response to the needs of its scientific community Nucleic Acids Res 2020 48 D440–4 10.1093/nar/gkz1019 31691833 PMC7145518 43 Khoury S Canlet C Lacroix MZ Berdeaux O Jouhet J Bertrand-Michel J Quantification of lipids: model, reality, and compromise Biomolecules 2018 8 4 174 10.3390/biom8040174 30558107 PMC6316828 44 Mohamed A Hill MM LipidSuite: interactive web server for lipidomics differential and enrichment analysis Nucleic Acids Res 2021 49 W346–51 10.1093/nar/gkab327 33950258 PMC8262688 45 Lv J Zhang L Yan F Wang X Clinical lipidomics: a new way to diagnose human diseases Clin Transl Med 2018 7 12 10.1186/s40169-018-0190-9 29704148 PMC5923182 46 Tzelepi V Gika H Begou O Timotheadou E The contribution of lipidomics in ovarian cancer management: A systematic review Int J Mol Sci 2023 24 18 13961 10.3390/ijms241813961 37762264 PMC10531399 47 Braicu EI Darb-Esfahani S Schmitt WD Koistinen KM Heiskanen L Poho P High-grade ovarian serous carcinoma patients exhibit profound alterations in lipid metabolism Oncotarget 2017 8 102912–22 10.18632/oncotarget.22076 29262533 PMC5732699 48 Pitman M Oehler MK Pitson SM Sphingolipids as multifaceted mediators in ovarian cancer Cell Signal 2021 81 109949 10.1016/j.cellsig.2021.109949 33571664 49 Shan L Chen YA Davis L Han G Zhu W Molina AD Measurement of phospholipids may improve diagnostic accuracy in ovarian cancer PloS One 2012 7 e46846 10.1371/journal.pone.0046846 23082132 PMC3474784 50 Zhao G Tan Y Cardenas H Vayngart D Wang Y Huang H Ovarian cancer cell fate regulation by the dynamics between saturated and unsaturated fatty acids Proc Natl Acad Sci U.S.A 2022 119 e2203480119 10.1073/pnas.2203480119 36197994 PMC9564215 51 Xuan Y Wang H Yung MM Chen F Chan WS Chan YS SCD1/FADS2 fatty acid desaturases equipoise lipid metabolic activity and redox-driven ferroptosis in ascites-derived ovarian cancer cells Theranostics 2022 12 3534–52 10.7150/thno.70194 35547771 PMC9065188 52 Wang J Zheng G Wang L Meng L Ren J Shang L Dysregulation of sphingolipid metabolism in pain Front Pharmacol 2024 15 1337150 10.3389/fphar.2024.1337150 38523645 PMC10957601 53 Rani S Lai A Nair S Sharma S Handberg A Carrion F Extracellular vesicles as mediators of cell-cell communication in ovarian cancer and beyond - A lipids focus Cytokine Growth Factor Rev 2023 73 52 68 10.1016/j.cytogfr.2023.06.004 37423866 54 Kozar N Kruusmaa K Bitenc M Argamasilla R Adsuar A Goswami N Metabolomic profiling suggests long chain ceramides and sphingomyelins as a possible diagnostic biomarker of epithelial ovarian cancer Clin Chim Acta 2018 481 108–14 10.1016/j.cca.2018.02.029 29481776 55 Hishinuma E Shimada M Matsukawa N Saigusa D Li B Kudo K Wide-targeted metabolome analysis identifies potential biomarkers for prognosis prediction of epithelial ovarian cancer Toxins (Basel) 2021 13 7 461 10.3390/toxins13070461 34209281 PMC8309959 56 Cheng L Zhang K Qing Y Li D Cui M Jin P Proteomic and lipidomic analysis of exosomes derived from ovarian cancer cells and ovarian surface epithelial cells J Ovarian Res 2020 13 9 10.1186/s13048-020-0609-y 31969186 PMC6977352 57 Starodubtseva NL Chagovets VV Nekrasova ME Nazarova NM Tokareva AO Bourmenskaya OV Shotgun lipidomics for differential diagnosis of HPV-associated cervix transformation Metabolites 2022 12 6 503 10.3390/metabo12060503 35736434 PMC9229224 58 Nam M Seo SS Jung S Jang SY Lee J Kwon M Comparable plasma lipid changes in patients with high-grade cervical intraepithelial neoplasia and patients with cervical cancer J Proteome Res 2021 20 740–50 10.1021/acs.jproteome.0c00640 33241689 59 Cheng F Wen Z Feng X Wang X Chen Y A serum lipidomic strategy revealed potential lipid biomarkers for early-stage cervical cancer Life Sci 2020 260 118489 10.1016/j.lfs.2020.118489 32976882 60 Cheng F Fan W Gui L Liu Y Ling Y Huang R Serum lipidomic profiling by UHPLC-MS/MS may be able to detect early-stage endometrial cancer Anal Bioanal Chem 2023 415 1841–54 10.1007/s00216-023-04586-x 36799979 61 Altadill T Dowdy TM Gill K Reques A Menon SS Moiola CP Metabolomic and lipidomic profiling identifies the role of the RNA editing pathway in endometrial carcinogenesis Sci Rep 2017 7 8803 10.1038/s41598-017-09169-2 28821813 PMC5562852 62 Shafiee MN Ortori CA Barrett DA Mongan NP Abu J Atiomo W Lipidomic biomarkers in polycystic ovary syndrome and endometrial cancer Int J Mol Sci 2020 21 13 4753 10.3390/ijms21134753 32635401 PMC7370092 63 Zhang S Han X The regulatory role of lipid metabolism in endometrial cancer J Oncol 2022 2022 6458877 10.1155/2022/6458877 36072980 PMC9444396 64 Dapas M Dunaif A Deconstructing a syndrome: genomic insights into PCOS causal mechanisms and classification Endocr Rev 2022 43 927–65 10.1210/endrev/bnac001 35026001 PMC9695127 65 Qian Y Tong Y Zeng Y Huang J Liu K Xie Y Integrated lipid metabolomics and proteomics analysis reveal the pathogenesis of polycystic ovary syndrome J Transl Med 2024 22 364 10.1186/s12967-024-05167-x 38632610 PMC11022415 66 Guo F Gong Z Fernando T Zhang L Zhu X Shi Y The lipid profiles in different characteristics of women with PCOS and the interaction between dyslipidemia and metabolic disorder states: A retrospective study in chinese population Front Endocrinol (Lausanne) 2022 13 892125 10.3389/fendo.2022.892125 35860700 PMC9289193 67 Yang YZ Xu F Zhao XJ Hou LH Xu GW Serum lipidomics analysis of polycystic ovary syndrome patients based on liquid chromatography-mass spectrometry Chin J Analytical Chem 2015 43 1445–51 10.1038/s41598-019-38944-6 30824725 PMC6397209 68 Zhang TP Duan JJ Liu CX Jiang T Improving clinical diagnosis and treatment of PCOS: seeking new breakthroughs in lipidomics J Mol Diagn Ther 2023 15 1658–62 10.19930/j.cnki.jmdt.2023.09.033 69 Sun Z Chang HM Wang A Song J Zhang X Guo J Identification of potential metabolic biomarkers of polycystic ovary syndrome in follicular fluid by SWATH mass spectrometry Reprod Biol Endocrinol 2019 17 45 10.1186/s12958-019-0490-y 31186025 PMC6560878 70 Taylor HS Kotlyar AM Flores VA Endometriosis is a chronic systemic disease: clinical challenges and novel innovations Lancet 2021 397 839–52 10.1016/S0140-6736(21)00389-5 33640070 71 Lin CC Chen ZY Wang CY Xi YM Research advances in endometriosis biomarkers based on lipidomics J Zhejiang Univ (Med Sci) 2020 49 779–84 10.3785/j.issn.1008-9292.2020.12.14 33448182 PMC8800742 72 Chagovets VV Wang Z Kononikhin AS Starodubtseva NL Borisova A Salimova D Endometriosis foci differentiation by rapid lipid profiling using tissue spray ionization and high resolution mass spectrometry Sci Rep 2017 7 2546 10.1038/s41598-017-02708-x 28566741 PMC5451410 73 Li J Gao Y Guan L Zhang H Sun J Gong X Discovery of phosphatidic acid, phosphatidylcholine, and phosphatidylserine as biomarkers for early diagnosis of endometriosis Front Physiol 2018 9 14 10.3389/fphys.2018.00014 29410629 PMC5787104 74 Vouk K Hevir N Ribic-Pucelj M Haarpaintner G Scherb H Osredkar J Discovery of phosphatidylcholines and sphingomyelins as biomarkers for ovarian endometriosis Hum Reprod 2012 27 2955–65 10.1093/humrep/des152 22859507 75 Cai Y Xu Y Ban Y Li J Sun Z Zhang M Plasma lipid profile and intestinal microflora in pregnancy women with hypothyroidism and their correlation with pregnancy outcomes Front Endocrinol (Lausanne) 2021 12 792536 10.3389/fendo.2021.792536 35126311 PMC8807684 76 Nogueira IAL da Cruz E Fontenele AMM Figueiredo Neto JA Alterations in postmenopausal plasmatic lipidome PloS One 2018 13 e0203027 10.1371/journal.pone.0203027 30180197 PMC6122933 77 Ke C Hou Y Zhang H Yang K Wang J Guo B Plasma metabolic profiles in women are menopause dependent PloS One 2015 10 e0141743 10.1371/journal.pone.0141743 26580805 PMC4651324 78 Ko SH Kim HS Menopause-associated lipid metabolic disorders and foods beneficial for postmenopausal women Nutrients 2020 12 1 202 10.3390/nu12010202 31941004 PMC7019719 79 Plewa S Horala A Derezinski P Nowak-Markwitz E Matysiak J Kokot ZJ Wide spectrum targeted metabolomics identifies potential ovarian cancer biomarkers Life Sci 2019 222 235–44 10.1016/j.lfs.2019.03.004 30853626 80 Wang Y Wang Y Chen C Ren F Cao R Wang Y Serum lipid profiling analysis and potential marker discovery for ovarian cancer based on liquid chromatography-Mass spectrometry J Pharm BioMed Anal 2021 199 114048 10.1016/j.jpba.2021.114048 33836461 81 Niemi RJ Braicu EI Kulbe H Koistinen KM Sehouli J Puistola U Ovarian tumours of different histologic type and clinical stage induce similar changes in lipid metabolism Br J Cancer 2018 119 847–54 10.1038/s41416-018-0270-z 30293997 PMC6189177 82 Knapp P Bodnar L Blachnio-Zabielska A Swiderska M Chabowski A Plasma and ovarian tissue sphingolipids profiling in patients with advanced ovarian cancer Gynecol Oncol 2017 147 139–44 10.1016/j.ygyno.2017.07.143 28800942 83 Li J Xie H Li A Cheng J Yang K Wang J Distinct plasma lipids profiles of recurrent ovarian cancer by liquid chromatography-mass spectrometry Oncotarget 2017 8 46834–45 10.18632/oncotarget.11603 27564116 PMC5564526 84 Dominguez F Ferrando M Diaz-Gimeno P Quintana F Fernandez G Castells I Lipidomic profiling of endometrial fluid in women with ovarian endometriosisdagger Biol Reprod 2017 96 772–9 10.1093/biolre/iox014 28340140 85 Vouk K Ribic-Pucelj M Adamski J Rizner TL Altered levels of acylcarnitines, phosphatidylcholines, and sphingomyelins in peritoneal fluid from ovarian endometriosis patients J Steroid Biochem Mol Biol 2016 159 60–9 10.1016/j.jsbmb.2016.02.023 26921767 86 Chen JY Chen WJ Zhu ZY Xu S Huang LL Tan WQ Screening of serum biomarkers in patients with PCOS through lipid omics and ensemble machine learning PloS One 2025 20 e0313494 10.1371/journal.pone.0313494 39775242 PMC11706364 87 Jiang Y Qi J Xue X Huang R Zheng J Liu W Ceramide subclasses identified as novel lipid biomarker elevated in women with polycystic ovary syndrome: a pilot study employing shotgun lipidomics Gynecol Endocrinol 2020 36 508–12 10.1080/09513590.2019.1698026 31793360 88 van Vlerken LE Duan Z Seiden MV Amiji MM Modulation of intracellular ceramide using polymeric nanoparticles to overcome multidrug resistance in cancer Cancer Res 2007 67 4843–50 10.1158/0008-5472.CAN-06-1648 17510414 89 Klymenko Y Bos B Campbell L Loughran E Liu Y Yang J Lysophosphatidic acid modulates ovarian cancer multicellular aggregate assembly and metastatic dissemination Sci Rep 2020 10 10877 10.1038/s41598-020-67565-7 32616784 PMC7331713 90 Chae CS Sandoval TA Hwang SM Park ES Giovanelli P Awasthi D Tumor-derived lysophosphatidic acid blunts protective type I interferon responses in ovarian cancer Cancer Discov 2022 12 1904–21 10.1158/2159-8290.CD-21-1181 35552618 PMC9357054 91 Muhammad N Ruiz F Stanley J Rashmi R Cho K Jayachandran K Monounsaturated and diunsaturated fatty acids sensitize cervical cancer to radiation therapy Cancer Res 2022 82 4515–27 10.1158/0008-5472.CAN-21-4369 36214635 PMC9772149 92 Li W Xu Y Zeng X Tan J Wang Y Wu H Etiological relationship between lipid metabolism and endometrial carcinoma Lipids Health Dis 2023 22 116 10.1186/s12944-023-01868-2 37537560 PMC10401764 93 Zhao C Zhang Z Sun L Bai R Wang L Chen S Genome sequencing provides potential strategies for drug discovery and synthesis Acupunct Herbal Med 2023 3 244–55 10.1097/HM9.0000000000000076 94 Porcari AM Negrao F Tripodi GL Pitta DR Campos EA Montis DM Molecular signatures of high-grade cervical lesions Front Oncol 2018 8 99 10.3389/fonc.2018.00099 29707519 PMC5907284 95 Neves ACO Morais CLM Mendes TPP Vaz BG Lima KMG Mass spectrometry and multivariate analysis to classify cervical intraepithelial neoplasia from blood plasma: an untargeted lipidomic study Sci Rep 2018 8 3954 10.1038/s41598-018-22317-6 29500376 PMC5834598 96 Tokareva A Chagovets V Attoeva D Starodubtseva N Nazarova N Gusakov K Non-invasive differential diagnosis of cervical neoplastic lesions by the lipid profile analysis of cervical scrapings Metabolites 2022 12 9 883 10.3390/metabo12090883 36144287 PMC9506087 97 Yan X Zhao W Wei J Yao Y Sun G Wang L A serum lipidomics study for the identification of specific biomarkers for endometrial polyps to distinguish them from endometrial cancer or hyperplasia Int J Cancer 2022 150 1549–59 10.1002/ijc.33943 35076938 98 Knific T Vouk K Smrkolj S Prehn C Adamski J Rizner TL Models including plasma levels of sphingomyelins and phosphatidylcholines as diagnostic and prognostic biomarkers of endometrial cancer J Steroid Biochem Mol Biol 2018 178 312–21 10.1016/j.jsbmb.2018.01.012 29360580 99 Starodubtseva N Chagovets V Tokareva A Dumanovskaya M Kukaev E Novoselova A Diagnostic value of menstrual blood lipidomics in endometriosis: A pilot study Biomolecules 2024 14 8 899 10.3390/biom14080899 39199287 PMC11351896 ",
  "metadata": {
    "Title of this paper": "Diagnostic value of menstrual blood lipidomics in endometriosis: A pilot study",
    "Journal it was published in:": "Frontiers in Endocrinology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483926/"
  }
}