{
  "title": "Paper_521",
  "abstract": "pmc Dermatol Reports 2611 dermreps DR Dermatology Reports 2036-7392 2036-7406 PAGEPress PMC12481490 PMC12481490.1 12481490 12481490 40952253 10.4081/dr.2025.10095 1 Article Melanoma in pregnancy: multidisciplinary treatment management and outcome Grippaudo Francesca Romana  1 Ruggeri Giulia  1 De Simone Paola  2 Di Prete Monia  3 Tellan Guglielmo  4 Govoni Elena Rita  5 Migliano Emilia  6 1 2 San Gallicano Dermatological Institute IRCCS Rome 3 Dermatopathology Unit San Gallicano Dermatological Institute IRCCS Rome 4 5 6 San Gallicano Dermatological Institute IRCCS Italy Department of Plastic Surgery, Policlinico Umberto I, Sapienza University of Rome, viale del Policlinico 155, 00161 Rome, Italy. giulia.ruggeri@uniroma1.it +39.3342200772. The authors declare that they have no competing interests. Ethics approval and consent to participate: this study has been authorized by the ethical committee “Comitato Etico Centrale IRCCS Lazio, Sezione IRCCS IFO – Fondazione G.B. Bietti.” Protocol number 15483, 05/12/2023 – IFO_AOO – AOO – IFO Reg. Sperim. N. 62/ISG/23.  Publisher's note: all claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. 15 1 2025 22 8 2025 17 3 496635 10095 25 7 2024 05 1 2025 15 01 2025 01 10 2025 01 10 2025 Copyright © 2025, the Author(s) 2025 Licensee PAGEPress, Italy https://creativecommons.org/licenses/by-nc/4.0/ This work is licensed under a Creative Commons Attribution NonCommercial 4.0 License (CC BY-NC 4.0 Pregnancy-associated melanoma affects both maternal and fetal health. This study aims to demonstrate how a specialized center and a multidisciplinary approach can provide the best outcomes. From January 2006 to September 2023, a bicentric observational study was conducted at the Plastic Surgery Department of Policlinico Umberto I, Sapienza University of Rome, and at the Plastic and Regenerative Surgery Department of the San Gallicano Dermatological Institute IRCCS, Rome, Italy. Out of 6,800 melanoma cases, twenty pregnant women were selected: thirteen underwent only wide local excision (WLE), while seven also had sentinel node biopsy (SLNB). All preoperative, operative, and postoperative steps were performed to ensure the safety of mothers and fetuses. Two patients developed metastases, with one fatality from hepatic metastases. At 5-year follow-up overall survival was 86%, while disease-free survival in advanced-stage melanoma patients was 72%. No maternal or fetal complications related to surgery were reported. Additionally, early deliveries at 7 and 8 months did not result in neonatal complications. Surgical treatment should be conducted in centers with both surgeons and gynecologists, and special care is necessary for procedures on pregnant women. Based on our experience, pregnancy does not seem to be a negative prognostic factor for melanoma. Key words melanoma pregnancy skin cancer sentinel lymph node biopsy survival Funding: this research was funded by the Scientific Direction of IRCCS San Gallicano Dermatological Institute, financed by the Ministry of Italian Health. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Melanoma is a malignant skin cancer, and its incidence is rapidly increasing worldwide. According to Italian Association of Medical Oncology (AIOM) guidelines, 85% of cases occur in North America, Europe, and Oceania, and skin melanoma is one of the most common cancers that presents in young people 1 Some studies report that one-third of female patients who develop melanoma are of childbearing age. 2 Pregnancy-associated melanoma (PAM) is defined as a melanoma diagnosed during pregnancy or in the first year postpartum. 3 2 4 Multiple factors seem to adversely affect the possibility of developing melanoma and its eventual course during pregnancy. 2 Recent studies document transient clinical-dermatoscopic changes of melanocytic nevi during pregnancy. Consequently, a close follow-up of pigmented lesions, both clinical and instrumental, is advised during pregnancy, and care must be taken to reveal the presence of other risk factors for melanoma. 5 Tumor lymphangiogenesis has been described as the strongest independent predictor of sentinel lymph node (SLN) invasion from melanoma metastases. 6 7 8 Literature on the mortality of pregnancy-related melanoma is still contradictory. Despite several studies showing that prognosis is similar when pregnant and non-pregnant women are affected by similar stages of melanoma, 9 10 In the management of pregnancy-related melanoma, the tumoral stage and the gestational period must be taken into account, as well as the will of the child-bearing mother, properly and fully informed. Procrastination of the treatment until after partum may be responsible for a poorer prognosis. In selected cases, anticipating partum may be advised to proceed with more invasive surgical procedures or oncological treatments. Materials and Methods From January 2006 to March 2023, a bicentered observational study that involved the Plastic Surgery Department of Policlinico Umberto I, Sapienza University of Rome and the Plastic and Regenerative Surgery Department of the San Gallicano Dermatological Institute IRCCS (Rome, Italy) was carried out. The inclusion criteria were gestational age from the 1 st th Twenty pregnant women were enrolled; thirteen underwent wide local excision (WLE), and seven underwent WLE and sentinel node biopsy (SLNB). Four received diagnoses during the first trimester, six during the second trimester, and ten during the third trimester ( Table 1 Multidisciplinary team treatment was crucial: plastic surgeons, dermatologists, oncologists, anesthesiologists, obstetric gynecologists, neonatologists, pathologists, and radiologists were involved. Psychological support was offered to each patient, and pregnant patients were included in every medical decision. The surgical treatments were performed according to the AIOM guidelines. 1 The patients in the first and second trimester who needed WLE and SLNB waited for the third trimester to safely undergo lymphoscintigraphy. After the first trimester of gestational age, 99mTc lymphoscintigraphy is considered a safe procedure in pregnancy. Methylene blue is instead avoided because of its teratogenic effects. 1 After a multidisciplinary discussion of the cases, early delivery at the 7 th th Figure 1. Therapeutic planning and specialized medical figures involved. Table 1. Patients receiving WLE only. Case Age Site Trimester Histotype Breslow mm Stage 5-years follow-up 1 35 Trunk III SSM In situ pTis alive 2 34 Trunk III SSM 0,4 pT1a alive 3 29 Trunk III SSM 0,7 pT1a alive 4 30 Leg I SSM 0,7 pT1a alive 5 33 Trunk III SSM 0,5 pT1a alive 6 28 Leg II SSM 0,6 pT1a alive 7 40 Trunk III SSM 0,4 pT1a alive 8 38 Leg II SSM 0,5 pT1a alive 9 35 Leg III SSM 0,6 pT1a alive 10 32 Chest III SSM 0,5 pT1a alive 11 38 Trunk II SSM In situ pTis alive 12 33 Arm I SSM 0,4 pT1a alive 13 39 Leg I SSM 0,4 PT1a alive WLE, wide local excision; SSM, superficial spreading melanoma. Blood tests, electrocardiograms, and lymph node echography were performed before the surgery was planned. Pregnant patients underwent anesthesiologic, gynecological, neonatological, and surgical preoperative medical examinations to properly assess the maternal and fetal risks. Vitals (arterial pressure, saturation) were constantly monitored. The gynecologist was paged in the operating theater before the surgery to perform cardiac fetal monitoring, which was repeated at the end of the procedure. When possible, the patients were positioned in the lateral left tilt position to avoid aortocaval compression syndrome. When the surgical procedure was WLE, local anesthesia with lidocaine was performed by surgeons under anesthesiologic supervision. When SLNB had to be performed, a new anesthesiologic evaluation was carried out to decide the best anesthesia procedure (general anesthesia, spinal anesthesia, nerve block). Antibiotic perioperative administration was performed using penicillin-based derivatives and cephalosporins; none of the enrolled patients reported drug allergies. Figure 1 Results The median maternal age was 34.1 for patients shown in Table 1 Table 2 Intraoperative maternal complications, intraoperative fetal complications, and maternal-fetal complications strictly related to surgery were evaluated in this study. In this sample, general, spinal, or local anesthesia did not cause intraoperative maternal complications, and no significant variation in vital parameters of the mother was detected. Fetal abnormalities were not detected preoperatively or post-operatively: fetal heart rate monitoring was normal before and after surgery in every patient. No fetal distress was identified when further investigations were requested by obstetric gynecologists (such as ultrasounds). There were no maternal-fetal complications strictly related to surgery. In our cases, early delivery, at the 7 th th Table 2 Discussion Breast cancer, melanoma, and thyroid cancers are the most frequently diagnosed during pregnancy; 11 PAM represents a critical clinical situation, both for cancer diagnosis and pregnancy, as it involves numerous complex clinical and ethical decisions. Oncologic and surgical management of pregnant women should take into account the patient’s desire; it should weigh maternal and fetal risks, well-being, and optimal treatment. Termination of pregnancy can be evaluated when aggressive and advanced cancer is diagnosed in early pregnancy; preterm induction should be avoided when possible. 12 According to old literature, PAM was considered to have a worse prognosis compared to melanoma diagnosis in non-pregnant women. 13 5 14 In earlier studies, disease-free survival or thickness did not show significant differences when a localized invasive melanoma was diagnosed. 15 A recent meta-analysis questioned whether a subsequent pregnancy after being diagnosed with melanoma could negatively affect the prognosis: findings do not suggest that, but further studies are needed. 16 Treatment considerations Ultrasounds, chest X-rays with appropriate shields, and magnetic resonance, preferably without gadolinium, can be performed to complete tumoral staging. 17 Once the cancer stage is assessed, surgical treatment has to be planned. According to the American Joint Committee on Cancer (AJCC), the European Society for Medical Oncology (ESMO), and AIOM guidelines, wide excision is always indicated. SLNB is indicated when the histological report is pT1b. 1 18 19 20 Table 2. Patients receiving WLE + SLNB. Case Age Site Trimester Histotype Breslow mm Stage 5-years follow-up 1 29 Trunk II SSM 0,9 pT1bN0 alive 2 28 Leg II SSM 1 pT2a N0 alive 3 27 Leg III SSM 1 pT2aN0 alive 4 A* 32 Trunk II NM 1,2 pT2aN1M1 dead 5 A# 30 Trunk I SSM 2,2 pT3aN1 alive 6 A* 33 Trunk III SSM 4 pT4aN0 alive 7 42 Leg III NM 2,8 pT3bN0M1 alive WLE, wide local excision; SLNB, sentinel lymph node biopsy; SSM, superficial spreading melanoma; NM, nodular melanoma; *early delivery performed at month 8 of gestation; #early delivery performed at month 7 of gestation. SLNB is not contraindicated during pregnancy, and if the patient is toward the end of pregnancy, it should be discussed, especially when adjuvant therapy is most likely needed. When SLNB is requested, lymphoscintigraphy can be safely carried out after the first trimester, avoiding methylene blue due to its teratogenic effects. 1 14 3 21 Blood tests and cardiologic examinations are routinely performed to assess anesthesiologic risk for every non-pregnant patient. Gynecologic consultation should be performed before undergoing non-obstetric surgery or before performing any invasive procedure. The safest time to perform surgery in pregnant women is the second trimester; during the third trimester, the greatest risk is premature labor and delivery due to the stress of surgery. For this reason, intraoperative fetal monitoring is mandatory after 24 weeks of gestation (third trimester). 21 SLNB and lymphadenectomy are surgeries that often require general anesthesia, depending on where the sentinel node is located. When it comes to surgery and anesthesia during pregnancy, there are known clinical concerns about proceeding with or delaying the surgical procedure. 22 23 In 2016, the American College of Obstetricians and Gynecologists, together with the American Society of Anesthesiologists, stated that “a pregnant woman should never be denied indicated surgery”. Therefore, it is advisable to postpone elective surgery when possible and perform non-urgent surgery in the second trimester. 24 Fetal heart rate (FHR) during surgery faces several challenges, such as difficult interpretation and technical difficulties, especially in abdominal surgeries. FHR monitoring still has limitations. 25 A systematic review investigated the incidence of intraoperative cesarean deliveries that occurred when non-reassuring intraoperative fetal heart rate monitoring (NR-iFHRM) was detected during non-obstetric surgery after 22 weeks of gestation. The review concluded that the available data were insufficient and recommended that further studies are needed. 26 Limitations On one hand, we were able to enroll a significant number of patients with PAM, despite its low incidence. On the other hand, this low incidence also explains the limited number of patients enrolled over the years. Moreover, we focused on the diagnosis and the surgical treatment of PAM, not focusing specifically on the implications of pharmacological/medical treatment. We could recommend a multidisciplinary approach and customized treatment for all patients who have undergone surgery. Further studies are needed to develop international guidelines for the management of a condition as challenging and complex as PAM. Conclusions Recent studies document transient clinical-dermoscopic changes of melanocytic nevi during pregnancy, recommending a close follow-up of these lesions. PAM is a critical diagnosis whose management still needs consensus. The multidisciplinary team is fundamental for the proper handling of this condition. Child-bearing mothers should be strictly involved during every step and decision, fully informed of the risks and benefits, both maternal and fetal. Psychological support should be taken into account. This study aimed to show that proper management of preoperative, perioperative, and postoperative steps significantly decreased maternal and fetal complications related to surgery. In our cases, early delivery, at the 7 th th Surgical treatment should be conducted in centers where both the surgeon and the gynecologist are present. Our results confirm that pregnancy itself does not seem to be a negative prognostic factor for melanoma. Availability of data and materials All data generated or analyzed during this study are included in this published article and come from an institutional database. References 1. AIOM Linee guida 2023 https://www.iss.it/ documents/20126/8403839/LG+127_Melanoma_aggago2023.pdf 2. Still R Brennecke S. Melanoma in Pregnancy Obstet Med 2017 10 107 12 29051777 10.1177/1753495X17695001 PMC5637994 3. Zelin E Conforti C Giuffrida R Melanoma in Pregnancy: Certainties Unborn Melanoma Manag 2020 7 MMT48 32922730 10.2217/mmt-2020-0007 PMC7475795 4. Todd SP Driscoll MS Prognosis for Women Diagnosed with Melanoma during, before, or after Pregnancy: Weighing the Evidence Int J Womens Dermatol 2017 3 26 9 28492051 10.1016/j.ijwd.2016.12.004 PMC5419023 5. Silipo V De Simone P Mariani G Malignant melanoma and pregnancy Melanoma Res 2006 16 497 500 17119450 10.1097/01.cmr.0000232295.91536.09 6. Dadras SS Lange-Asschenfeldt B Velasco P Tumor Lymphangiogenesis Predicts Melanoma Metastasis to Sentinel Lymph Nodes Mod Pathol 2005 18 1232 42 15803182 10.1038/modpathol.3800410 7. Byrom L Olsen C Knight L Increased Mortality for Pregnancy-Associated Melanoma: Systematic Review and Meta-Analysis J Eur Acad Dermatol Venereol 2015 29 1457 66 25690106 10.1111/jdv.12972 8. Carter TJ George C Harwood C Nathan P. Melanoma in Pregnancy: Diagnosis and Management in Early-Stage and Advanced Disease Eur J Cancer 2022 166 240 53 35325701 10.1016/j.ejca.2022.02.016 9. Ribero S Longo C Dika E Members of the Melanoma Group of the EORTC. Pregnancy and Melanoma: A European-Wide Survey to Assess Current Management and a Critical Literature Overview J Eur Acad Dermatol Venereol 2017 31 669 10.1111/jdv.13722 27231086 10. Driscoll MS Martires K Bieber AK Pregnancy and Melanoma J Am Acad Dermatol 2016 75 669 78 27646737 10.1016/j.jaad.2016.01.061 11. McCormick A Peterson E. Cancer in Pregnancy Obstet Gynecol Clin North Am 2018 45 187 200 29747725 10.1016/j.ogc.2018.01.009 12. Amant F Vandenbroucke T Verheecke M Pediatric Outcome after Maternal Cancer Diagnosed during Pregnancy N Engl J Med 2015 373 1824 34 26415085 10.1056/NEJMoa1508913 13. Shiu MH Schottenfeld D Maclean B Fortner JG Adverse effect of pregnancy on melanoma: a reappraisal Cancer 1976 37 181 7 1247953 10.1002/1097-0142(197601)37:1<181::aid-cncr2820370126>3.0.co;2-f 14. Garbe C Amaral T Peris K European Consensus-Based Interdisciplinary Guideline for Melanoma. Part 1: Diagnostics: Update 2022 Eur Cancer 2022 170 236 55 10.1016/j.ejca.2022.03.008 35570085 15. Daryanani D Plukker JT De Hullu JA Pregnancy and Early-Stage Melanoma Cancer 2003 97 2248 53 12712479 10.1002/cncr.11321 16. Byrom L Olsen CM Knight L Does Pregnancy After a Diagnosis of Melanoma Affect Prognosis? Systematic Review and Meta-Analysis Dermatol Surg 2015 41 875 82 26177116 10.1097/DSS.0000000000000406 17. Committee Opinion No 723: Guidelines for Diagnostic Imaging During Pregnancy and Lactation Obstet Gynecol 2017 130 e2106 Erratum in: Obstet Gynecol 2018 132 786 10.1097/AOG.0000000000002355 28937575 18. Berk-Krauss J Liebman TN Stein JA Pregnancy and Melanoma: Recommendations for Clinical Scenarios Int J Womens Dermatol 2018 4 113 5 29872687 10.1016/j.ijwd.2017.11.006 PMC5986258 19. Kouba DJ LoPiccolo MC Alam M Guidelines for the Use of Local Anesthesia in Office-Based Dermatologic Surgery J Am Acad Dermatol 2016 74 1201 19 26951939 10.1016/j.jaad.2016.01.022 20. Li JN Nijhawan RI Srivastava D. Cutaneous Surgery in Patients Who Are Pregnant or Breastfeeding Dermatol Clin 2019 37 307 17 31084725 10.1016/j.det.2019.03.002 21. Shachar SS Gallagher K McGuire K Multidisciplinary Management of Breast Cancer During Pregnancy The Oncologist 2017 22 324 34 28232597 10.1634/theoncologist.2016-0208 PMC5344634 22. Broer N Buonocore S Goldberg C Proposal for the Timing of Management of Patients with Melanoma Presenting during Pregnancy J Surg Oncol 2012 106 36 40 22331751 10.1002/jso.23035 PMC3355205 23. Ní Mhuireachtaigh R O’Gorman DA Anesthesia in Pregnant Patients for Nonobstetric Surgery J Clin Anesth 2006 18 60 6 16517336 10.1016/j.jclinane.2004.11.009 24. Committee Opinion No 696: Nonobstetric Surgery During Pregnancy Obstet Gynecol 2017 129 777 8 28333816 10.1097/AOG.0000000000002014 25. Higgins MF Pollard L McGuinness SK Kingdom JC Fetal Heart Rate Monitoring in Nonobstetric Surgery: A Systematic Review of the Evidence Am J Obstet Gynecol MFM 2019 1 100048 33345838 10.1016/j.ajogmf.2019.100048 26. Po’ G Olivieri C Rose CH Intraoperative Fetal Heart Monitoring for Non-Obstetric Surgery: A Systematic Review Eur J Obstet Gynecol Reprod Biol 2019 238 12 19 31082738 10.1016/j.ejogrb.2019.04.033 ",
  "metadata": {
    "Title of this paper": "Intraoperative Fetal Heart Monitoring for Non-Obstetric Surgery: A Systematic Review",
    "Journal it was published in:": "Dermatology Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481490/"
  }
}