{
  "title": "Paper_378",
  "abstract": "pmc Nat Commun Nat Commun 2873 ncomms Nature Communications 2041-1723 Nature Publishing Group PMC12484688 PMC12484688.1 12484688 12484688 41028718 10.1038/s41467-025-63745-z 63745 1 Article A histone-centric multi-omics study shows that increased H3K4 methylation sustains triple-negative breast cancer phenotypes http://orcid.org/0000-0002-7267-1079 Noberini Roberta roberta.noberini@ieo.it 1 http://orcid.org/0000-0002-9444-7369 Robusti Giulia 1 Vai Alessandro 1 http://orcid.org/0000-0003-3357-9920 Savoia Evelyn Oliva 1 Jodice Maria Giovanna 1 http://orcid.org/0000-0002-4862-7705 Bertalot Giovanni 1 6 7 http://orcid.org/0009-0003-3431-3398 Çat Betül 1 Pallavicini Isabella 1 Bonizzi Giuseppina 2 Capra Maria 2 Sangalli Claudia Anna 3 http://orcid.org/0000-0003-3487-4331 Zambelli Federico 4 Fusco Nicola 2 5 Pece Salvatore 1 5 Pavesi Giulio 4 Minucci Saverio 1 5 http://orcid.org/0000-0003-3556-1265 Bonaldi Tiziana tiziana.bonaldi@ieo.it 1 5 1 https://ror.org/02vr0ne26 grid.15667.33 0000 0004 1757 0843 Department of Experimental Oncology, IEO European Institute of Oncology IRCSS, 2 https://ror.org/02vr0ne26 grid.15667.33 0000 0004 1757 0843 Biobank for Translational and Digital Medicine, IEO European Institute of Oncology IRCCS, 3 https://ror.org/02vr0ne26 grid.15667.33 0000 0004 1757 0843 Clinical Trial Office, IEO European Institute of Oncology IRCSS, 4 https://ror.org/00wjc7c48 grid.4708.b 0000 0004 1757 2822 Dipartimento di Bioscienze, Università degli Studi di Milano, 5 https://ror.org/00wjc7c48 grid.4708.b 0000 0004 1757 2822 Department of Oncology and Hematology-Oncology, University of Milan, 6 7 https://ror.org/05trd4x28 grid.11696.39 0000 0004 1937 0351 Present Address: Centre for Medical Sciences – CISMed, University of Trento, 30 9 2025 2025 16 478256 8716 3 12 2024 27 8 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Altered histone post-translational modifications are frequently associated with cancer. Here, we apply mass-spectrometry to study the epigenetic landscapes of breast cancer subtypes, with a particular focus on triple-negative breast cancers (TNBCs), a heterogeneous group lacking well-defined molecular targets and effective therapies. The analysis of over 200 tumors reveals epigenetic signatures that discriminate TNBCs from the other BC subtypes, and that distinguish TNBC patients with different prognoses. Employing a multi-OMICs approach integrating epigenomics, transcriptomics, and proteomics data, we investigate the mechanistic role of increased H3K4 methylation in TNBCs, demonstrating that H3K4me2 sustains the expression of genes associated with the TNBC phenotype. Through CRISPR-mediated editing, we establish a causal relationship between H3K4me2 and gene expression for several targets. Furthermore, treatment with H3K4 methyltransferase inhibitors reduce TNBC cell growth in vitro and in vivo. Collectively, our results unravel a novel epigenetic pathway implicated in TNBC pathogenesis and suggest new opportunities for targeted therapy. Using a histone focused multi-omics approach, here the authors show that increased H3K4 methylation drives triple-negative breast cancer phenotypes, revealing potential novel therapeutic avenues. Subject terms Breast cancer Epigenetics Mass spectrometry https://doi.org/10.13039/501100003196 Ministero della Salute (Ministry of Health, Italy) GR-2016-02361522 Bonaldi Tiziana https://doi.org/10.13039/501100005010 Associazione Italiana per la Ricerca sul Cancro (Italian Association for Cancer Research) IG-2023-28767 pre-doctoral fellowship Vai Alessandro Bonaldi Tiziana https://doi.org/10.13039/100010661 EC | Horizon 2020 Framework Programme (EU Framework Programme for Research and Innovation H2020) 823839 Bonaldi Tiziana pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Breast cancer (BC) is the most common cancer in women worldwide. Despite a significant improvement in patient survival over the last decades, 40% of BC patients experience relapse, eventually succumbing to their disease. BC therefore remains the first cause of cancer-related death in women. BC subtypes are typically defined based on the immunoreactivity of hormone receptors (Estrogen Receptor-ER, or Progesteron Receptor - PGR), the HER2 receptor and the proliferation marker Ki-67. The main breast cancer molecular subtypes include: Luminal A, Luminal B, HER2-positive and triple negative. Among BC subtypes, triple negative breast cancers (TNBCs), which represent 15–20% of all breast cancers, are more aggressive and have a worse clinical outcome compared to other subtypes of breast tumors. Treatment of TNBC patients has been challenging due to the heterogeneity of the disease and the absence of molecular targets, and unlike ER-positive and HER2-positive breast cancer, there is no approved targeted therapy for TNBC. Recently, a step towards this goal was achieved through gene expression analysis of TNBCs, which suggested the existence of six subtypes – which were then revised to four – displaying unique gene expressions and ontologies and distinct responses to different chemotherapeutic agents 1 2 Cancer arises as the result of the accumulation of genetic defects such as mutations and copy number changes 3 4 5 6 7 8 9 10 11 12 13 16 Global alterations of histone marks observed in cancer are often caused by aberrations in the activity or expression of histone modifying enzymes 17 1 18 19 In this study, we perform an epi-proteomics analysis of large cohorts ( n Results Mass spectrometry-based profiling of BC clinical samples identifies a histone PTM signature of triple negative breast cancer Liquid chromatography coupled with MS has emerged as the most powerful tool for the analysis of histone PTMs and variants. During the last years we have developed various bottom-up MS-based methods that allow profiling up to 100 differentially modified peptides from formalin-fixed paraffin embedded (FFPE) and frozen patient tissues 13 15 20 21 1 1 14 16 15 16 1a 22 23 Fig. 1 Mass spectrometry-based histone PTM profiling of breast cancer molecular subtypes. a https://smart.servier.com/ https://creativecommons.org/licenses/by/4.0/ b p c b d p p The heatmap in Fig. 1b 1b 1c 24 1d 2 7 These results represent the first comprehensive and systematic profiling of histone PTMs in breast cancer clinical samples, and reveal specific epigenetic profiles associated with different subtypes, with TN samples showing the most divergent profiles. Epigenetic profiling of a validation cohort comprising LuA and TN samples To validate the findings from our epigenetic profiling, we gathered an independent cohort of 31 fresh-frozen samples, comprising 15 LuA and 16 TN cases (Supplementary Fig. 1 1 25 25 2a 3 Fig. 2 Validation of the TNBC epigenetic signature. a P p b p t p Because histone PTM abundances have been shown to change during the cell cycle 26 27 28 2b 3c 2b As an additional control, for a subset of samples (4 LuA and 12 TN tissues, Supplementary Fig. 1 2a 13 Epigenetic marks show prognostic value in TNBC We next focused on the TN subtype and asked whether histone PTM levels can stratify patients based on their survival. The comparison of the epigenetic profiles of TNBC primary tumors from patients with or without relapse 3 years after chemotherapy showed few significant/close to significant changes in histone PTMs (Fig. 3a 4a 3a, b Fig. 3 The H3K4me2 mark is associated with worse prognosis in TNBC. a P p b p p c n n n d n n Additionally, we analyzed the association between histone PTMs and the probability of survival in a total of 107 TNBCs comprising 56 samples from Cohort 1, 16 from Cohort 2 and additional 35 samples (Cohort 3, Supplementary Fig. 1 3c 5 3d 5 4b 4c A multi-OMICs approach to dissect the downstream effects of increased H3K4me2 levels in TNBC H3K4me2 is typically associated with positive regulation of transcription and has been shown to localize at cis-regulatory regions, such as promoters and enhancers 29 4a Fig. 4 A multi-OMICs approach to dissect the downstream effects of increased H3K4me2 levels in TNBC. a b c n n n d e P f g p We performed H3K4me2 ChIP-seq in 7 LuA and 8 TN clinical breast cancer samples (Supplementary Fig. 6a 4b n n 4c 30 4d In order to verify whether the presence of a H3K4me2-unique peak correlates with increased transcript levels, we integrated the ChIP-seq data with LuA and TN transcriptomic data from The Cancer Genome Atlas Program (TCGA). This analysis unraveled a clear correlation between H3K4me2 presence at promoters and enhancers (retrieved from 31 4e 4e 6b 32 4f 4g 33 4g 34 6a, c Taken together, the intersection of ChIP-seq and transcriptomics/proteomics data revealed that H3K4me2 potentially regulates multiple genes related with the TNBC phenotype. H3K4me2 regulates the expression of genes linked with the TNBC phenotype To mechanistically prove the causal link between the presence of H3K4me2 and the expression of genes associated with the TNBC phenotype that emerged from our multi-OMICs analysis, we took advantage of the CRISPR interference (CRISPRi) technology, which allows epigenetic editing and targeting of specific genomic regions of interest by using protein domains specific for histone PTMs removal or deposition 35 36 PLA2G4A IGF2BP3 AIM2 GLS GLIPR2 PLCG2 5 5b 7 PLA2G4A 37 IGF2BP3 38 AIM2 39 40 GLS 41 GLIPR2 42 PLCG2 43 Fig. 5 H3K4me2 regulates the expression of genes linked with the TNBC aggressive phenotype. a b c n d n p p p We engineered the MDA-MB-231 cell line to stably express d-Cas9, which was tagged with the mCherry fluorescent marker, and fused to the effector domain of LSD1 (dCas9LSD1) (Supplementary Fig. 8 1 5c 5d Inhibiting H3K4 methyltransferases reduces TNBC cell growth in vitro and in vivo Our results showed that H3K4me2 is increased in TNBCs compared with normal tissues and tumors belonging to other BC molecular subtypes, and that the increase in this epigenetic mark is associated with worse overall and disease-free survival in TNBCs. In addition, we found that the increase in H3K4me2 at specific genomic regions in TNBC favors the expression of a set of genes that may drive the TNBC aggressive phenotype. Interestingly, one of the methyltransferases responsible for the deposition of this PTM, KMT2B 6a 9 44 44 45 46 47 Fig. 6 Inhibiting H3K4 methyltransferases reduces TNBC cell growth in vitro and in vivo . a b P c d n e f g p n h 50 i 5 n n p n In MDA-MB-231 cells, treatment for 72 hours with OICR-9429 reduced the level of H3K4me2 in a dose-dependent manner, as assessed by MS (Fig. 6b 6c 10a 6d 5 CHRM3 GABRE TMEM71 TRVP4 48 51 10b, c 50 6e 50 50 11a, b We therefore focused on OICR-9429, which we further characterized at the phenotypic level. OICR-9429 inhibited the growth of MDA-MB-231 cells in combination with doxorubicin, showing an additive effect (Bliss synergy score = − 6f 6g 10d 6h 11c 12 6i Discussion Our epi-proteomics analysis of BC subtypes revealed a TNBC-specific histone PTM profile, which showed differences compared with other subtypes that were reproducible across different independent patient tissue cohorts. This first comprehensive and quantitative description of the epigenomics landscapes of BC subtypes was made possible thanks to MS-based approaches, which enabled us to profile all the best-characterized histone marks at once, in a highly quantitative manner. This represents a major advancement compared to antibody-based methods, such as immunohistochemistry, which are more commonly employed to study histone PTMs in clinical samples, but suffer from a number of limitations, including cross reactivity, antigen masking, poor quantitative accuracy and a limited number of simultaneously analyzable epigenetic marks. Our analysis primarily focused on methylations and acetylations on histone H3 and H4, which have been extensively characterized and can be associated with a functional outcome on gene expression. However, modifications localized on other histones or uncommon and less characterized PTMs may also contribute to the distinct epigenetic landscapes of breast cancer subtypes. TNBCs are characterized by loss of H4K20me3, which is paralleled by an increase of unmodified H4K20, compared with all the other subtypes except the HER+. H4K20me3 is generally localized at repetitive regions and is associated with transcriptional repression 52 7 53 13 15 14 54 55 26 27 Despite our follow-up work focused in particular on dissecting the downstream consequences of H3K4me2 increase in TNBC, our epigenetic profiling highlighted several other changes worth of further investigation, both as potential biomarkers and as the starting point for mechanistic investigations aimed at identifying novel therapeutic avenues. Histone PTM changes in cancer are determined by multiple factors, but -in the simplest scenario- they are the consequence of alterations in the levels of the histone modifying enzymes responsible for their deposition and removal, which can be targeted for therapeutic intervention with epigenetic drugs. When searching for possible associations between the gene expression of histone modifying enzymes and the changes observed in the levels of histone PTMs in the TNBC subtype (Supplementary Fig. 9 SUV39H1 SUV39H2 SETDB1 KDM3B PHF2 SMYD2 EZH2 56 57 59 7 Among the histone PTMs emerging from our BC profiling, H3K4me2 stood out as the most interesting mark. Indeed, H3K4me2 was increased in TNBC compared with all the other BC subtypes, was consistently identified in all the cohorts analyzed, including laser microdissected samples, and was associated with diminished disease-free survival in TNBC. Consistent with the higher levels of H3K4me2 in TN tumors, the H3K4-specific KMT2B KMT2B 60 To investigate the downstream effects of the changes observed in H3K4me2 levels, we exploited the complementarity of epi-proteomic data, which provides quantitative but bulk histone PTM levels, with more conventional epi-genomic and transcriptomic methods, in order to study H3K4me2 genomic localization and its effects at the gene expression level. The multi-OMICs analysis of a small set of clinical samples that we carried out showed that genes displaying H3K4me2 peaks uniquely in TN samples presented higher expression levels in this subtype. While this applies to both promoters or enhancers, it appears like the differences between the TN and LuA samples based on peak distribution (MDS in Fig. 4b 4e 61 Because our data suggests that reducing the levels of H3K4me2 could reduce the expression of several pro-disease genes, we tested several inhibitors targeting the interaction of MLL methyltransferases with WDR5 or menin. While menin inhibitors were more potent in phenotypic assays, they did not elicit significant changes in H3K4me2 levels at IC 50 62 50 11d, e Overall, our MS-based profiling integrated with a multi-OMIC analysis of clinical samples identified H3K4me2 as a potential epigenetic driver of TNBC, suggesting strategies to reduce its levels as a therapeutic avenue for the treatment of this tumor. In particular, the inhibitor OICR-9429, which reduces H3K4 methylation levels and has been shown in our study to inhibit tumor growth in a xenograft model, may warrant further investigation in preclinical and clinical settings. Methods Ethical statement The research described complies with all relevant ethical regulations. Breast cancer and normal breast samples were obtained from patients undergoing surgery at the European Institute of Oncology (Milan). The patients provided informed consent and this study was approved by the Ethical Committee of the European Institute of Oncology (Study UID 2550). The animal experiments were approved by the Italian Ministry of Health (Project no. 679/20 and 485/2025), conducted in accordance with Italian law and under the control of institutional (European Institute of Oncology) local animal welfare (Cogentech Organismo Preposto al Benessere degli Animali (OPBA)) and ethical committees. Tissue specimens The levels of hormone receptors, HER-2, and Ki-67 of tumor samples were ascertained by immunohistochemistry, and breast cancer subtypes were defined in accordance to the ASCO/CAP guidelines. Samples with infiltrating carcinoma were selected to have a tumor cellularity of at least 40% for histone PTM analysis, as assessed by hematoxylin and eosin (H&E) staining. The samples subjected to the multi-OMICs analysis had a minimum tumor cellularity of 60%. Specimens with in situ carcinoma areas, large necrosis areas, and massive flogistic infiltrate were discarded. For storage, samples were collected and snap frozen in liquid nitrogen, frozen in optimal cutting temperature compound (OCT) or fixed overnight in 4% formalin and embedded in paraffin. In some cases, homogenous tumor populations were isolated from fresh-frozen tissue sections by laser capture microdissection (25000-100000 cells were collected per sample) 25 1 Sample preparation for MS analysis Histones were enriched from tissue samples through the PAT-H-MS method 21 21 15 22 22 23 15 25 15 6A LC-MS/MS analysis Peptide mixtures were separated by reversed-phase chromatography on an EASY-nLC 1200 high performance liquid chromatography (HPLC) system through an EASY-Spray column (Thermo Fisher Scientific), 25-cm long (inner diameter 75 µm, PepMap C18, 2 µm particles), which was connected online to a Q Exactive Plus or HF (Thermo Fisher Scientific) instrument through an EASY-Spray™ Ion Source (Thermo Fisher Scientific). Solvent A was 0.1% formic acid (FA) in ddH 2 6 5 63 MS data analysis The acquired histone RAW data were analyzed using EpiProfile 2.0 64 15 15 2 3 65 66 s https://proteomic.datacommons.cancer.gov/pdc 33 67 Chromatin Immunoprecipitation (ChIP) and ChIP-PCR The chromatin was prepared from 1-5 x 10 7 3 Drosophila 68 (ΔCt) 2 ChIP Sequencing (ChIP-seq) and ChIP-seq analysis DNA libraries were prepared from 5–10 ng of input and IP DNA through an in-house protocol 69 70 71 72 73 31 74 75 For the analysis of ChIP-seq data from MDA-MB-231 cells treated with OICR-9429 with the Drosophila 76 Drosophila Drosophila 77 78 Visualization of genomic tracks Big Wig enrichment tracks were generated starting from BAM files with the bamCoverage function of deepTools 79 80 80 RNA extraction, RT-qPCR analysis and RNA sequencing Total RNA was extracted from 0.5–1 x 10 6 2 RNA-seq analysis For TN vs LuA comparison, the harmonized HTSeq count table was retrieved from TCGA on the Gencode 22 gene annotation. Short non-coding RNA and mitochondrial genes were removed from the count table prior to further processing. Samples were assigned to LuA and TN subtype according to Table S3 2 81 http://bioinformatics.mdanderson.org/tcgambatch/ 82 83 Over-representation and survival analyses For the over-representation analysis the R package clusterProfiler 84 85 Cell lines and cell culture A list of the breast cancer cell lines used and their growth media is provided in Supplementary Table 3 RDB15446 28 2 CRISPRi: generation of stable cell line expressing dCas9 Lentiviral transductions were performed in a Biosafety level 2 laboratory (BSL-2). Lentiviral constructs were transiently transfected in HEK-293T cells by using the calcium phosphate transfection method together with the packaging plasmid pCMV-DR8.91 and the envelope plasmid pMD2G-VSVG. One 10 cm plate of HEK-293T was used to infect a well of a 6-well plate of MDA-MB-231. After 12 hours of transfection, the supernatant was removed, and 6 ml of fresh medium was added. After 48 and 72 hours from transfection, the supernatant containing the virus was harvested and used to infect MDA-MB-231 with the addition of Polybrene 1x. To generate a CRISPRi stable cell line, MDA-MB-231 cells were transduced with a lentivirus expressing Tet-On 3 G rtTA transactivator with Blasticidin resistance (pLVX-Tet3G Blasticidin, Addgene, #128061) and selected for 10 days with the addition of 10 µg/µl Blasticidin to the cell media. Next, the cells were transduced with dCas9-LSD1_mCherry (pHR_TRE3G-LSD1-dCas9-P2A-mCherry, Addgene #138462). The cells were grown in culture medium with the addition of tetracycline-free serum (Tetraclyine free Serum, Euroclone Spa, ECS0182L) and 1 µg/ml doxycycline (Thermo Fisher Scientific) was added following infection. Cells expressing mCherry were isolated by FACS sorting. CRISPRi: sgRNA design and vector cloning Target regions for sgRNAs were chosen by selecting two regions within the signal of H3K4me2 in the promoter or enhancer region (Supplementary Table 1 86 1 87 6 13 14 Immunoblot analysis MDA-MB-231 cells treated with methyltransferase inhibitors were lysed in nuclei isolation buffer as described above. 1 μg of protein was separated on a 4-12% PAA pre-cast gel, transferred onto a PVDF (Immobilon, Merck Life Science S.R.L.) membrane and probed by immunoblotting with primary antibodies (Anti-CRISPR-Cas9 antibody [7A9-3A3] (ab191468, Abcam, 1 μg/ml), H3K4me2 antibody (ab7766, Abcam, 1 μg/ml), anti-histone H3 Antibody (ab1791, Abcam, 1:5000)), followed by secondary peroxidase-conjugated antibodies (Thermo Scientific). Images were acquired on a ChemiDoc XRS instrument (Biorad) and quantified using the Image Lab software (Version 6.1). Flow cytometry and cell sorting Flow cytometry analyses were performed using a FACSCelesta and the FACSDiva Software v8.01.1, and were analyzed using the FlowJo 9.3 Software. For the analysis of CRISPRi cells, 0.5-1 x 10 6 6 Cell treatment and phenotypic assays OICR-9429 was purchased from MedChemExpress and Target Mol. MI-136, MI-463, and MI-503 were purchased from MedChemExpress. All drugs were resuspended in DMSO for in vitro experiments. Doxorubicin was purchased from Pfizer. Cell viability was assessed with the Cell Titer Glo (Promega) assay following the manufacturer instructions and was performed in 96 well plate after seeding 2000 cells/well. Breast cancer cell lines were treated with either DMSO or OICR-9429 at 25-50 μM, alone or in combination with different doses of Doxorubicin for 72 hours. The luminescence was measured with Glomax Explorer. IC 50 88 89 In vivo animal experiments Mice were purchased from Charles River Italia and bred and housed under pathogen-free conditions in the animal facilities at the European Institute of Oncology–Italian Foundation for Cancer Research (FIRC) Institute of Molecular Oncology (IEO–IFOM, Milan, Italy) campus. Animals were housed at constant temperature (23 ± 2 °C) and approximately 66% humidity in 12 hour light/dark cycles. Prior to injection, tumor cells MDA-MB-231 were trypsin detached, washed, and resuspended in medium to a final concentration of 500000 cells/10 μL. The cell suspension was then mixed with 10-μL growth factor–reduced Matrigel (Corning 356231) and maintained on ice until injection. Female NOD SCID IL2RGnull mice (NSG from Charles River, Italy, 8 weeks old) were anesthetized with isoflurane and injected with 20 μL of cell suspension in Matrigel directly in the right fourth mammary fad pad with a Hamilton syringe. Tumor growth was monitored twice a week, by bi-dimensional measurements using a caliper, and the tumor volume was calculated according to the formula: L × W2/2 = mm3, where “w” and “W” are “minor side” and “major side” (in mm), respectively. When the major side of the tumor reached 15 mm, the mice were sacrificed. After the tumors appeared as established palpable masses (~20 days after cell injection), the mice were randomized in different groups. OIRC-9429, at 30 mg/kg dissolved in 10% DMSO + 40% PEG300 + 5% Tween 80 + 45% physiological solution, was administered three times a week via intraperitoneal injection, for 3 weeks Reporting summary Further information on research design is available in the Nature Portfolio Reporting Summary Supplementary information  Supplementary Information Description of Additional Supplementary Files Supplementary Dataset 1 Supplementary Dataset 2 Supplementary Dataset 3 Reporting Summary Transparent Peer Review file Source data  Source data Publisher’s note These authors contributed equally: Roberta Noberini, Giulia Robusti, Alessandro Vai. Supplementary information The online version contains supplementary material available at 10.1038/s41467-025-63745-z. Acknowledgements Italian Ministry of Health, grant number GR-2016-02361522 (RN). -Italian Association for Cancer Research (AIRC), grant numbers IG-2018-21834 (TB) and IG-2023-28767 (TB). Fondazione IEO-Monzino (FIEORDT-2023-BONALDI) (TB). EPIC-XS, project number 823839, funded by the Horizon 2020 program of the European Union. Alessandro Vai is a PhD student within the European School of Molecular Medicine (SEMM) and is supported by an AIRC fellowship for Italy. We thank Camilla Restellini and Alberto Dalmasso for technical help and Paola Scaffidi for insightful comments on the manuscript. The results shown here are in part based upon data generated by the TCGA Research Network: https://www.cancer.gov/tcga Author contributions Conceptualization: T.B., R.N., S.M. Methodology: R.N., E.O.S., G.R. Formal Analysis: A.V. Investigation: G.R., R.N., A.V., E.O.S., I.P., M.G.J., G.Be, C.A.S., B.C., G.Bo, M.C., F.Z., S.P. Visualization: A.V., R.N. Funding acquisition: R.N., T.B. Project administration: T.B. Supervision: T.B., R.N., N.F., S.M., G.P. Writing – original draft: R.N., G.R. Writing – review & editing: T.B, A.V. Peer review Peer review information Nature Communications Data availability The MS proteomics data have been deposited to the ProteomeXchange Consortium via the PRIDE 90 PXD057150 PXD064421 91 GSE283103 Source data Code availability The code used in this study has been deposited on GitHub ( https://github.com/alessandro-vai/BC-H3K4me2 92 Competing interests The authors declare no competing interests. References 1. Lehmann BD Identification of human triple-negative breast cancer subtypes and preclinical models for selection of targeted therapies J. Clin. Invest. 2011 121 2750 2767 10.1172/JCI45014 21633166 PMC3127435 Lehmann, B. D. et al. Identification of human triple-negative breast cancer subtypes and preclinical models for selection of targeted therapies. J. Clin. Invest. 121 21633166 10.1172/JCI45014 PMC3127435 2. Lehmann BD Refinement of triple-negative breast cancer molecular subtypes: implications for neoadjuvant chemotherapy selection PLoS One 2016 11 e0157368 10.1371/journal.pone.0157368 27310713 PMC4911051 Lehmann, B. D. et al. Refinement of triple-negative breast cancer molecular subtypes: implications for neoadjuvant chemotherapy selection. PLoS One 11 27310713 10.1371/journal.pone.0157368 PMC4911051 3. Rheinbay E Louis DN Bernstein BE Suva ML A tell-tail sign of chromatin: histone mutations drive pediatric glioblastoma Cancer Cell 2012 21 329 331 10.1016/j.ccr.2012.03.001 22439930 Rheinbay, E., Louis, D. N., Bernstein, B. E. & Suva, M. L. A tell-tail sign of chromatin: histone mutations drive pediatric glioblastoma. Cancer Cell 21 22439930 10.1016/j.ccr.2012.03.001 4. Vogelstein B Cancer genome landscapes Science 2013 339 1546 1558 10.1126/science.1235122 23539594 PMC3749880 Vogelstein, B. et al. Cancer genome landscapes. Science 339 23539594 10.1126/science.1235122 PMC3749880 5. Nguyen VT Differential epigenetic reprogramming in response to specific endocrine therapies promotes cholesterol biosynthesis and cellular invasion Nat. Commun. 2015 6 10044 10.1038/ncomms10044 26610607 PMC4674692 Nguyen, V. T. et al. Differential epigenetic reprogramming in response to specific endocrine therapies promotes cholesterol biosynthesis and cellular invasion. Nat. Commun. 6 26610607 10.1038/ncomms10044 PMC4674692 6. Suva ML Riggi N Bernstein BE Epigenetic reprogramming in cancer Science 2013 339 1567 1570 10.1126/science.1230184 23539597 PMC3821556 Suva, M. L., Riggi, N. & Bernstein, B. E. Epigenetic reprogramming in cancer. Science 339 23539597 10.1126/science.1230184 PMC3821556 7. Fraga MF Loss of acetylation at Lys16 and trimethylation at Lys20 of histone H4 is a common hallmark of human cancer Nat. Genet 2005 37 391 400 10.1038/ng1531 15765097 Fraga, M. F. et al. Loss of acetylation at Lys16 and trimethylation at Lys20 of histone H4 is a common hallmark of human cancer. Nat. Genet 37 15765097 10.1038/ng1531 8. Seligson DB Global levels of histone modifications predict prognosis in different cancers Am. J. Pathol. 2009 174 1619 1628 10.2353/ajpath.2009.080874 19349354 PMC2671251 Seligson, D. B. et al. Global levels of histone modifications predict prognosis in different cancers. Am. J. Pathol. 174 19349354 10.2353/ajpath.2009.080874 PMC2671251 9. Seligson DB Global histone modification patterns predict risk of prostate cancer recurrence Nature 2005 435 1262 1266 10.1038/nature03672 15988529 Seligson, D. B. et al. Global histone modification patterns predict risk of prostate cancer recurrence. Nature 435 15988529 10.1038/nature03672 10. Khan SA Reddy D Gupta S Global histone post-translational modifications and cancer: Biomarkers for diagnosis, prognosis and treatment? World J. Biol. Chem. 2015 6 333 345 10.4331/wjbc.v6.i4.333 26629316 PMC4657128 Khan, S. A., Reddy, D. & Gupta, S. Global histone post-translational modifications and cancer: Biomarkers for diagnosis, prognosis and treatment? World J. Biol. Chem. 6 26629316 10.4331/wjbc.v6.i4.333 PMC4657128 11. Elsheikh SE Global histone modifications in breast cancer correlate with tumor phenotypes, prognostic factors, and patient outcome Cancer Res. 2009 69 3802 10.1158/0008-5472.CAN-08-3907 19366799 Elsheikh, S. E. et al. Global histone modifications in breast cancer correlate with tumor phenotypes, prognostic factors, and patient outcome. Cancer Res. 69 19366799 10.1158/0008-5472.CAN-08-3907 12. Soldi M Bremang M Bonaldi T Biochemical systems approaches for the analysis of histone modification readout Biochim Biophys. Acta 2014 1839 657 668 10.1016/j.bbagrm.2014.03.008 24681439 Soldi, M., Bremang, M. & Bonaldi, T. Biochemical systems approaches for the analysis of histone modification readout. Biochim Biophys. Acta 1839 24681439 10.1016/j.bbagrm.2014.03.008 13. Noberini R PAT-H-MS coupled with laser microdissection to study histone post-translational modifications in selected cell populations from pathology samples Clin. Epigenet. 2017 9 69 10.1186/s13148-017-0369-8 PMC5504751 28702092 Noberini, R. et al. PAT-H-MS coupled with laser microdissection to study histone post-translational modifications in selected cell populations from pathology samples. Clin. Epigenet. 9 10.1186/s13148-017-0369-8 PMC5504751 28702092 14. Noberini, R. et al. Profiling of epigenetic features in clinical samples reveals novel widespread changes in cancer. Cancers. 11 10.3390/cancers11050723 PMC6562406 31137727 15. Noberini R Uggetti A Pruneri G Minucci S Bonaldi T Pathology tissue-quantitative mass spectrometry analysis to profile histone post-translational modification patterns in patient samples Mol. Cell. Proteom. 2016 15 866 877 10.1074/mcp.M115.054510 PMC4813706 26463340 Noberini, R., Uggetti, A., Pruneri, G., Minucci, S. & Bonaldi, T. Pathology tissue-quantitative mass spectrometry analysis to profile histone post-translational modification patterns in patient samples. Mol. Cell. Proteom. 15 10.1074/mcp.M115.054510 PMC4813706 26463340 16. Restellini C Alternative digestion approaches improve histone modification mapping by mass spectrometry in clinical samples Proteom. Clin. Appl. 2019 13 e1700166 10.1002/prca.201700166 30471193 Restellini, C. et al. Alternative digestion approaches improve histone modification mapping by mass spectrometry in clinical samples. Proteom. Clin. Appl. 13 10.1002/prca.201700166 30471193 17. Chi P Allis CD Wang GG Covalent histone modifications-miswritten, misinterpreted and mis-erased in human cancers Nat. Rev. Cancer 2010 10 457 469 10.1038/nrc2876 20574448 PMC3262678 Chi, P., Allis, C. D. & Wang, G. G. Covalent histone modifications-miswritten, misinterpreted and mis-erased in human cancers. Nat. Rev. Cancer 10 20574448 10.1038/nrc2876 PMC3262678 18. West AC Johnstone RW New and emerging HDAC inhibitors for cancer treatment J. Clin. Invest. 2014 124 30 39 10.1172/JCI69738 24382387 PMC3871231 West, A. C. & Johnstone, R. W. New and emerging HDAC inhibitors for cancer treatment. J. Clin. Invest. 124 24382387 10.1172/JCI69738 PMC3871231 19. Nebbioso A Carafa V Benedetti R Altucci L Trials with ‘epigenetic’ drugs: an update Mol. Oncol. 2012 6 657 682 10.1016/j.molonc.2012.09.004 23103179 PMC5528349 Nebbioso, A., Carafa, V., Benedetti, R. & Altucci, L. Trials with ‘epigenetic’ drugs: an update. Mol. Oncol. 6 23103179 10.1016/j.molonc.2012.09.004 PMC5528349 20. Noberini, R. et al. Extensive and systematic rewiring of histone post-translational modifications in cancer model systems. Nucleic Acids Res. 46 10.1093/nar/gky224 PMC5934616 29618087 21. Noberini, R., Restellini, C., Savoia, E. O. & Bonaldi, T. Enrichment of histones from patient samples for mass spectrometry-based analysis of post-translational modifications. Methods 184 10.1016/j.ymeth.2019.10.001 31605746 22. Noberini R Bonaldi T A Super-SILAC strategy for the accurate and multiplexed profiling of histone posttranslational modifications Methods Enzymol. 2017 586 311 332 10.1016/bs.mie.2016.09.036 28137569 Noberini, R. & Bonaldi, T. A Super-SILAC strategy for the accurate and multiplexed profiling of histone posttranslational modifications. Methods Enzymol. 586 28137569 10.1016/bs.mie.2016.09.036 23. Noberini R Longhi E Bonaldi T A Super-SILAC approach for profiling histone posttranslational modifications Methods Mol. Biol. 2023 2603 87 102 10.1007/978-1-0716-2863-8_7 36370272 Noberini, R., Longhi, E. & Bonaldi, T. A Super-SILAC approach for profiling histone posttranslational modifications. Methods Mol. Biol. 2603 36370272 10.1007/978-1-0716-2863-8_7 24. Asleh K Riaz N Nielsen TO Heterogeneity of triple negative breast cancer: Current advances in subtyping and treatment implications J. Exp. Clin. Cancer Res 2022 41 265 10.1186/s13046-022-02476-1 36050786 PMC9434975 Asleh, K., Riaz, N. & Nielsen, T. O. Heterogeneity of triple negative breast cancer: Current advances in subtyping and treatment implications. J. Exp. Clin. Cancer Res 41 36050786 10.1186/s13046-022-02476-1 PMC9434975 25. Noberini R Spatial epi-proteomics enabled by histone post-translational modification analysis from low-abundance clinical samples Clin. Epigenet. 2021 13 145 10.1186/s13148-021-01120-7 PMC8317427 34315505 Noberini, R. et al. Spatial epi-proteomics enabled by histone post-translational modification analysis from low-abundance clinical samples. Clin. Epigenet. 13 10.1186/s13148-021-01120-7 PMC8317427 34315505 26. Bonenfant D Analysis of dynamic changes in post-translational modifications of human histones during cell cycle by mass spectrometry Mol. Cell Proteom. 2007 6 1917 1932 10.1074/mcp.M700070-MCP200 17644761 Bonenfant, D. et al. Analysis of dynamic changes in post-translational modifications of human histones during cell cycle by mass spectrometry. Mol. Cell Proteom. 6 10.1074/mcp.M700070-MCP200 17644761 27. Zane L Chapus F Pegoraro G Misteli T HiHiMap: single-cell quantitation of histones and histone posttranslational modifications across the cell cycle by high-throughput imaging Mol. Biol. Cell 2017 28 2290 2302 10.1091/mbc.e16-12-0870 28615324 PMC5555657 Zane, L., Chapus, F., Pegoraro, G. & Misteli, T. HiHiMap: single-cell quantitation of histones and histone posttranslational modifications across the cell cycle by high-throughput imaging. Mol. Biol. Cell 28 28615324 10.1091/mbc.E16-12-0870 PMC5555657 28. Sakaue-Sawano A Genetically encoded tools for optical dissection of the mammalian cell cycle Mol. Cell 2017 68 626 640 e5 10.1016/j.molcel.2017.10.001 29107535 Sakaue-Sawano, A. et al. Genetically encoded tools for optical dissection of the mammalian cell cycle. Mol. Cell 68 29107535 10.1016/j.molcel.2017.10.001 29. Black JC Van Rechem C Whetstine JR Histone lysine methylation dynamics: establishment, regulation, and biological impact Mol. Cell 2012 48 491 507 10.1016/j.molcel.2012.11.006 23200123 PMC3861058 Black, J. C., Van Rechem, C. & Whetstine, J. R. Histone lysine methylation dynamics: establishment, regulation, and biological impact. Mol. Cell 48 23200123 10.1016/j.molcel.2012.11.006 PMC3861058 30. Frescas D Guardavaccaro D Bassermann F Koyama-Nasu R Pagano M JHDM1B/FBXL10 is a nucleolar protein that represses transcription of ribosomal RNA genes Nature 2007 450 309 313 10.1038/nature06255 17994099 Frescas, D., Guardavaccaro, D., Bassermann, F., Koyama-Nasu, R. & Pagano, M. JHDM1B/FBXL10 is a nucleolar protein that represses transcription of ribosomal RNA genes. Nature 450 17994099 10.1038/nature06255 31. Corces, M. R. et al. The chromatin accessibility landscape of primary human cancers. Science 362 10.1126/science.aav1898 PMC6408149 30361341 32. Yoshino S Suzuki HI The molecular understanding of super-enhancer dysregulation in cancer Nagoya J. Med Sci. 2022 84 216 229 35967935 10.18999/nagjms.84.2.216 PMC9350580 Yoshino, S. & Suzuki, H. I. The molecular understanding of super-enhancer dysregulation in cancer. Nagoya J. Med Sci. 84 35967935 10.18999/nagjms.84.2.216 PMC9350580 33. Mertins P Proteogenomics connects somatic mutations to signalling in breast cancer Nature 2016 534 55 62 10.1038/nature18003 27251275 PMC5102256 Mertins, P. et al. Proteogenomics connects somatic mutations to signalling in breast cancer. Nature 534 27251275 10.1038/nature18003 PMC5102256 34. Cox J Mann M 1D and 2D annotation enrichment: a statistical method integrating quantitative proteomics with complementary high-throughput data BMC Bioinforma. 2012 13 S12 10.1186/1471-2105-13-S16-S12 PMC3489530 23176165 Cox, J. & Mann, M. 1D and 2D annotation enrichment: a statistical method integrating quantitative proteomics with complementary high-throughput data. BMC Bioinforma. 13 10.1186/1471-2105-13-S16-S12 PMC3489530 23176165 35. Gilbert LA CRISPR-mediated modular RNA-guided regulation of transcription in eukaryotes Cell 2013 154 442 451 10.1016/j.cell.2013.06.044 23849981 PMC3770145 Gilbert, L. A. et al. CRISPR-mediated modular RNA-guided regulation of transcription in eukaryotes. Cell 154 23849981 10.1016/j.cell.2013.06.044 PMC3770145 36. Li K Interrogation of enhancer function by enhancer-targeting CRISPR epigenetic editing Nat. Commun. 2020 11 485 10.1038/s41467-020-14362-5 31980609 PMC6981169 Li, K. et al. Interrogation of enhancer function by enhancer-targeting CRISPR epigenetic editing. Nat. Commun. 11 31980609 10.1038/s41467-020-14362-5 PMC6981169 37. Vecchi, L. et al. Phospholipase A(2) Drives Tumorigenesis and cancer aggressiveness through its interaction with Annexin A1. Cells 10 10.3390/cells10061472 PMC8231270 34208346 38. Zhang, X. et al. IGF2BP3 mediates the mRNA degradation of NF1 to promote triple-negative breast cancer progression via an m6A-dependent manner. Clin. Transl. Med. 13 10.1002/ctm2.1427 PMC10518495 37743642 39. Zhu H The complex role of AIM2 in autoimmune diseases and cancers Immun. Inflamm. Dis. 2021 9 649 665 10.1002/iid3.443 34014039 PMC8342223 Zhu, H. et al. The complex role of AIM2 in autoimmune diseases and cancers. Immun. Inflamm. Dis. 9 34014039 10.1002/iid3.443 PMC8342223 40. Huang QF Fang DL Nong BB Zeng J Focal pyroptosis-related genes AIM2 and ZBP1 are prognostic markers for triple-negative breast cancer with brain metastases Transl. Cancer Res. 2021 10 4845 4858 10.21037/tcr-21-2182 35116337 PMC8797367 Huang, Q. F., Fang, D. L., Nong, B. B. & Zeng, J. Focal pyroptosis-related genes AIM2 and ZBP1 are prognostic markers for triple-negative breast cancer with brain metastases. Transl. Cancer Res. 10 35116337 10.21037/tcr-21-2182 PMC8797367 41. Vidula N Yau C Rugo HS Glutaminase (GLS1) gene expression in primary breast cancer Breast Cancer 2023 30 1079 1084 10.1007/s12282-023-01502-0 37679553 Vidula, N., Yau, C. & Rugo, H. S. Glutaminase (GLS1) gene expression in primary breast cancer. Breast Cancer 30 37679553 10.1007/s12282-023-01502-0 42. Huang S GLIPR-2 overexpression in HK-2 cells promotes cell EMT and migration through ERK1/2 activation PLoS One 2013 8 e58574 10.1371/journal.pone.0058574 23516513 PMC3596275 Huang, S. et al. GLIPR-2 overexpression in HK-2 cells promotes cell EMT and migration through ERK1/2 activation. PLoS One 8 23516513 10.1371/journal.pone.0058574 PMC3596275 43. Jackson JT Mulazzani E Nutt SL Masters SL The role of PLCgamma2 in immunological disorders, cancer, and neurodegeneration J. Biol. Chem. 2021 297 100905 10.1016/j.jbc.2021.100905 34157287 PMC8318911 Jackson, J. T., Mulazzani, E., Nutt, S. L. & Masters, S. L. The role of PLCgamma2 in immunological disorders, cancer, and neurodegeneration. J. Biol. Chem. 297 34157287 10.1016/j.jbc.2021.100905 PMC8318911 44. Yang, L., Jin, M. & Jeong, K. W. Histone H3K4 Methyltransferases as targets for drug-resistant cancers. Biology 10 10.3390/biology10070581 PMC8301125 34201935 45. Punzi S WDR5 inhibition halts metastasis dissemination by repressing the mesenchymal phenotype of breast cancer cells Breast Cancer Res. 2019 21 123 10.1186/s13058-019-1216-y 31752957 PMC6873410 Punzi, S. et al. WDR5 inhibition halts metastasis dissemination by repressing the mesenchymal phenotype of breast cancer cells. Breast Cancer Res. 21 31752957 10.1186/s13058-019-1216-y PMC6873410 46. Borkin D Pharmacologic inhibition of the Menin-MLL interaction blocks progression of MLL leukemia in vivo Cancer Cell 2015 27 589 602 10.1016/j.ccell.2015.02.016 25817203 PMC4415852 Borkin, D. et al. Pharmacologic inhibition of the Menin-MLL interaction blocks progression of MLL leukemia in vivo. Cancer Cell 27 25817203 10.1016/j.ccell.2015.02.016 PMC4415852 47. Malik R Targeting the MLL complex in castration-resistant prostate cancer Nat. Med. 2015 21 344 352 10.1038/nm.3830 25822367 PMC4390530 Malik, R. et al. Targeting the MLL complex in castration-resistant prostate cancer. Nat. Med. 21 25822367 10.1038/nm.3830 PMC4390530 48. Azimi, I. et al. Activation of the ion channel TRPV4 induces epithelial to mesenchymal transition in breast cancer cells. Int. J. Mol. Sci. 21 10.3390/ijms21249417 PMC7764818 33322037 49. Calaf, G. M., Crispin, L. A., Munoz, J. P., Aguayo, F. & Bleak, T. C. Muscarinic receptors associated with cancer. Cancers 14 10.3390/cancers14092322 PMC9100020 35565451 50. Sizemore GM Sizemore ST Seachrist DD Keri RA GABA(A) receptor pi (GABRP) stimulates basal-like breast cancer cell migration through activation of extracellular-regulated kinase 1/2 (ERK1/2) J. Biol. Chem. 2014 289 24102 24113 10.1074/jbc.M114.593582 25012653 PMC4148843 Sizemore, G. M., Sizemore, S. T., Seachrist, D. D. & Keri, R. A. GABA(A) receptor pi (GABRP) stimulates basal-like breast cancer cell migration through activation of extracellular-regulated kinase 1/2 (ERK1/2). J. Biol. Chem. 289 25012653 10.1074/jbc.M114.593582 PMC4148843 51. Xie J TMEM71 is crucial for cell proliferation in lower-grade glioma and is linked to unfavorable prognosis Cancer Cell Int. 2025 25 109 10.1186/s12935-025-03747-5 40119335 PMC11927289 Xie, J. et al. TMEM71 is crucial for cell proliferation in lower-grade glioma and is linked to unfavorable prognosis. Cancer Cell Int. 25 40119335 10.1186/s12935-025-03747-5 PMC11927289 52. Schotta G A silencing pathway to induce H3-K9 and H4-K20 trimethylation at constitutive heterochromatin Genes Dev. 2004 18 1251 1262 10.1101/gad.300704 15145825 PMC420351 Schotta, G. et al. A silencing pathway to induce H3-K9 and H4-K20 trimethylation at constitutive heterochromatin. Genes Dev. 18 15145825 10.1101/gad.300704 PMC420351 53. Yokoyama Y Loss of histone H4K20 trimethylation predicts poor prognosis in breast cancer and is associated with invasive activity Breast Cancer Res. 2014 16 R66 10.1186/bcr3681 24953066 PMC4229880 Yokoyama, Y. et al. Loss of histone H4K20 trimethylation predicts poor prognosis in breast cancer and is associated with invasive activity. Breast Cancer Res. 16 24953066 10.1186/bcr3681 PMC4229880 54. Wei Y Loss of trimethylation at lysine 27 of histone H3 is a predictor of poor outcome in breast, ovarian, and pancreatic cancers Mol. Carcinog. 2008 47 701 706 10.1002/mc.20413 18176935 PMC2580832 Wei, Y. et al. Loss of trimethylation at lysine 27 of histone H3 is a predictor of poor outcome in breast, ovarian, and pancreatic cancers. Mol. Carcinog. 47 18176935 10.1002/mc.20413 PMC2580832 55. Marsolier J H3K27me3 conditions chemotolerance in triple-negative breast cancer Nat. Genet. 2022 54 459 468 10.1038/s41588-022-01047-6 35410383 PMC7612638 Marsolier, J. et al. H3K27me3 conditions chemotolerance in triple-negative breast cancer. Nat. Genet. 54 35410383 10.1038/s41588-022-01047-6 PMC7612638 56. Michealraj KA Metabolic Regulation of the Epigenome Drives Lethal Infantile Ependymoma Cell 2020 181 1329 1345 e24 10.1016/j.cell.2020.04.047 32445698 PMC10782558 Michealraj, K. A. et al. Metabolic Regulation of the Epigenome Drives Lethal Infantile Ependymoma. Cell 181 32445698 10.1016/j.cell.2020.04.047 PMC10782558 57. Bachman KE Histone modifications and silencing prior to DNA methylation of a tumor suppressor gene Cancer Cell 2003 3 89 95 10.1016/S1535-6108(02)00234-9 12559178 Bachman, K. E. et al. Histone modifications and silencing prior to DNA methylation of a tumor suppressor gene. Cancer Cell 3 12559178 10.1016/s1535-6108(02)00234-9 58. Espada J Human DNA methyltransferase 1 is required for maintenance of the histone H3 modification pattern J. Biol. Chem. 2004 279 37175 37184 10.1074/jbc.M404842200 15220328 Espada, J. et al. Human DNA methyltransferase 1 is required for maintenance of the histone H3 modification pattern. J. Biol. Chem. 279 15220328 10.1074/jbc.M404842200 59. Tamaru H Selker EU A histone H3 methyltransferase controls DNA methylation in Neurospora crassa Nature 2001 414 277 283 10.1038/35104508 11713521 Tamaru, H. & Selker, E. U. A histone H3 methyltransferase controls DNA methylation in Neurospora crassa. Nature 414 11713521 10.1038/35104508 60. Di Nisio, E. et al. A truncated and catalytically inactive isoform of KDM5B histone demethylase accumulates in breast cancer cells and regulates H3K4 tri-methylation and gene expression. Cancer Gene Ther. 30 10.1038/s41417-022-00584-w PMC10281864 36697763 61. Huang H Defining super-enhancer landscape in triple-negative breast cancer by multiomic profiling Nat. Commun. 2021 12 2242 10.1038/s41467-021-22445-0 33854062 PMC8046763 Huang, H. et al. Defining super-enhancer landscape in triple-negative breast cancer by multiomic profiling. Nat. Commun. 12 33854062 10.1038/s41467-021-22445-0 PMC8046763 62. Freire PR Identification of a Novel Chromatin structure associated with the transcriptional response to menin inhibitors in AML Blood 2024 144 952 10.1182/blood-2024-211004 Freire, P. R. et al. Identification of a Novel Chromatin structure associated with the transcriptional response to menin inhibitors in AML. Blood 144 63. Noberini, R. et al. Label-Free Mass Spectrometry-based quantification of Linker Histone H1 variants in clinical samples. Int. J. Mol. Sci 21 10.3390/ijms21197330 PMC7582528 33020374 64. Yuan ZF EpiProfile 2.0: A computational platform for processing epi-proteomics Mass Spectrometry Data J. Proteome Res. 2018 17 2533 2541 10.1021/acs.jproteome.8b00133 29790754 PMC6387837 Yuan, Z. F. et al. EpiProfile 2.0: A computational platform for processing epi-proteomics Mass Spectrometry Data. J. Proteome Res. 17 29790754 10.1021/acs.jproteome.8b00133 PMC6387837 65. Gu Z Eils R Schlesner M Complex heatmaps reveal patterns and correlations in multidimensional genomic data Bioinformatics 2016 32 2847 2849 10.1093/bioinformatics/btw313 27207943 Gu, Z., Eils, R. & Schlesner, M. Complex heatmaps reveal patterns and correlations in multidimensional genomic data. Bioinformatics 32 27207943 10.1093/bioinformatics/btw313 66. Ritchie ME limma powers differential expression analyses for RNA-sequencing and microarray studies Nucleic Acids Res. 2015 43 e47 10.1093/nar/gkv007 25605792 PMC4402510 Ritchie, M. E. et al. limma powers differential expression analyses for RNA-sequencing and microarray studies. Nucleic Acids Res. 43 25605792 10.1093/nar/gkv007 PMC4402510 67. Zhu Y DEqMS: A method for accurate variance estimation in differential protein expression analysis Mol. Cell Proteom. 2020 19 1047 1057 10.1074/mcp.TIR119.001646 PMC7261819 32205417 Zhu, Y. et al. DEqMS: A method for accurate variance estimation in differential protein expression analysis. Mol. Cell Proteom. 19 10.1074/mcp.TIR119.001646 PMC7261819 32205417 68. Greulich F Mechtidou A Horn T Uhlenhaut NH Protocol for using heterologous spike-ins to normalize for technical variation in chromatin immunoprecipitation STAR Protoc. 2021 2 100609 10.1016/j.xpro.2021.100609 34189474 PMC8220248 Greulich, F., Mechtidou, A., Horn, T. & Uhlenhaut, N. H. Protocol for using heterologous spike-ins to normalize for technical variation in chromatin immunoprecipitation. STAR Protoc. 2 34189474 10.1016/j.xpro.2021.100609 PMC8220248 69. Blecher-Gonen R High-throughput chromatin immunoprecipitation for genome-wide mapping of in vivo protein-DNA interactions and epigenomic states Nat. Protoc. 2013 8 539 554 10.1038/nprot.2013.023 23429716 Blecher-Gonen, R. et al. High-throughput chromatin immunoprecipitation for genome-wide mapping of in vivo protein-DNA interactions and epigenomic states. Nat. Protoc. 8 23429716 10.1038/nprot.2013.023 70. Langmead B Trapnell C Pop M Salzberg SL Ultrafast and memory-efficient alignment of short DNA sequences to the human genome Genome Biol. 2009 10 R25 10.1186/gb-2009-10-3-r25 19261174 PMC2690996 Langmead, B., Trapnell, C., Pop, M. & Salzberg, S. L. Ultrafast and memory-efficient alignment of short DNA sequences to the human genome. Genome Biol. 10 19261174 10.1186/gb-2009-10-3-r25 PMC2690996 71. Zhang Y Model-based analysis of ChIP-Seq (MACS) Genome Biol. 2008 9 R137 10.1186/gb-2008-9-9-r137 18798982 PMC2592715 Zhang, Y. et al. Model-based analysis of ChIP-Seq (MACS). Genome Biol. 9 18798982 10.1186/gb-2008-9-9-r137 PMC2592715 72. Neph S BEDOPS: high-performance genomic feature operations Bioinformatics 2012 28 1919 1920 10.1093/bioinformatics/bts277 22576172 PMC3389768 Neph, S. et al. BEDOPS: high-performance genomic feature operations. Bioinformatics 28 22576172 10.1093/bioinformatics/bts277 PMC3389768 73. Quinlan AR Hall IM BEDTools: a flexible suite of utilities for comparing genomic features Bioinformatics 2010 26 841 842 10.1093/bioinformatics/btq033 20110278 PMC2832824 Quinlan, A. R. & Hall, I. M. BEDTools: a flexible suite of utilities for comparing genomic features. Bioinformatics 26 20110278 10.1093/bioinformatics/btq033 PMC2832824 74. Liao Y Smyth GK Shi W featureCounts: an efficient general purpose program for assigning sequence reads to genomic features Bioinformatics 2014 30 923 930 10.1093/bioinformatics/btt656 24227677 Liao, Y., Smyth, G. K. & Shi, W. featureCounts: an efficient general purpose program for assigning sequence reads to genomic features. Bioinformatics 30 24227677 10.1093/bioinformatics/btt656 75. Robinson MD McCarthy DJ Smyth GK edgeR: a Bioconductor package for differential expression analysis of digital gene expression data Bioinformatics 2010 26 139 140 10.1093/bioinformatics/btp616 19910308 PMC2796818 Robinson, M. D., McCarthy, D. J. & Smyth, G. K. edgeR: a Bioconductor package for differential expression analysis of digital gene expression data. Bioinformatics 26 19910308 10.1093/bioinformatics/btp616 PMC2796818 76. Bressan D Fernandez-Perez D Romanel A Chiacchiera F SpikeFlow: automated and flexible analysis of ChIP-Seq data with spike-in control NAR Genom. Bioinform. 2024 6 lqae118 10.1093/nargab/lqae118 39211331 PMC11358820 Bressan, D., Fernandez-Perez, D., Romanel, A. & Chiacchiera, F. SpikeFlow: automated and flexible analysis of ChIP-Seq data with spike-in control. NAR Genom. Bioinform. 6 39211331 10.1093/nargab/lqae118 PMC11358820 77. Krug B Pervasive H3K27 acetylation leads to ERV Expression and a therapeutic vulnerability in H3K27M Gliomas Cancer Cell 2019 35 782 797 e8 10.1016/j.ccell.2019.04.004 31085178 PMC6521975 Krug, B. et al. Pervasive H3K27 acetylation leads to ERV Expression and a therapeutic vulnerability in H3K27M Gliomas. Cancer Cell 35 31085178 10.1016/j.ccell.2019.04.004 PMC6521975 78. Love MI Huber W Anders S Moderated estimation of fold change and dispersion for RNA-seq data with DESeq2 Genome Biol. 2014 15 550 10.1186/s13059-014-0550-8 25516281 PMC4302049 Love, M. I., Huber, W. & Anders, S. Moderated estimation of fold change and dispersion for RNA-seq data with DESeq2. Genome Biol. 15 25516281 10.1186/s13059-014-0550-8 PMC4302049 79. Ramirez F deepTools2: a next generation web server for deep-sequencing data analysis Nucleic Acids Res. 2016 44 W160 W165 10.1093/nar/gkw257 27079975 PMC4987876 Ramirez, F. et al. deepTools2: a next generation web server for deep-sequencing data analysis. Nucleic Acids Res. 44 27079975 10.1093/nar/gkw257 PMC4987876 80. Lopez-Delisle L pyGenomeTracks: reproducible plots for multivariate genomic datasets Bioinformatics 2021 37 422 423 10.1093/bioinformatics/btaa692 32745185 PMC8058774 Lopez-Delisle, L. et al. pyGenomeTracks: reproducible plots for multivariate genomic datasets. Bioinformatics 37 32745185 10.1093/bioinformatics/btaa692 PMC8058774 81. Zhang Y Parmigiani G Johnson WE ComBat-seq: batch effect adjustment for RNA-seq count data NAR Genom. Bioinform. 2020 2 lqaa078 10.1093/nargab/lqaa078 33015620 PMC7518324 Zhang, Y., Parmigiani, G. & Johnson, W. E. ComBat-seq: batch effect adjustment for RNA-seq count data. NAR Genom. Bioinform. 2 33015620 10.1093/nargab/lqaa078 PMC7518324 82. Colaprico A TCGAbiolinks: an R/Bioconductor package for integrative analysis of TCGA data Nucleic Acids Res. 2016 44 e71 10.1093/nar/gkv1507 26704973 PMC4856967 Colaprico, A. et al. TCGAbiolinks: an R/Bioconductor package for integrative analysis of TCGA data. Nucleic Acids Res. 44 26704973 10.1093/nar/gkv1507 PMC4856967 83. Dobin A STAR: ultrafast universal RNA-seq aligner Bioinformatics 2013 29 15 21 10.1093/bioinformatics/bts635 23104886 PMC3530905 Dobin, A. et al. STAR: ultrafast universal RNA-seq aligner. Bioinformatics 29 23104886 10.1093/bioinformatics/bts635 PMC3530905 84. Wu T clusterProfiler 4.0: A universal enrichment tool for interpreting omics data Innovation 2021 2 100141 34557778 10.1016/j.xinn.2021.100141 PMC8454663 Wu, T. et al. clusterProfiler 4.0: A universal enrichment tool for interpreting omics data. Innovation 2 34557778 10.1016/j.xinn.2021.100141 PMC8454663 85. Liberzon A The Molecular Signatures Database (MSigDB) hallmark gene set collection Cell Syst. 2015 1 417 425 10.1016/j.cels.2015.12.004 26771021 PMC4707969 Liberzon, A. et al. The Molecular Signatures Database (MSigDB) hallmark gene set collection. Cell Syst. 1 26771021 10.1016/j.cels.2015.12.004 PMC4707969 86. Concordet J-P Haeussler M CRISPOR: intuitive guide selection for CRISPR/Cas9 genome editing experiments and screens Nucleic Acids Res. 2018 46 W242 W245 10.1093/nar/gky354 29762716 PMC6030908 Concordet, J.-P. & Haeussler, M. CRISPOR: intuitive guide selection for CRISPR/Cas9 genome editing experiments and screens. Nucleic Acids Res. 46 29762716 10.1093/nar/gky354 PMC6030908 87. Kelly MR A multi-omic dissection of super-enhancer driven oncogenic gene expression programs in ovarian cancer Nat. Commun. 2022 13 4247 10.1038/s41467-022-31919-8 35869079 PMC9307778 Kelly, M. R. et al. A multi-omic dissection of super-enhancer driven oncogenic gene expression programs in ovarian cancer. Nat. Commun. 13 35869079 10.1038/s41467-022-31919-8 PMC9307778 88. Zheng S SynergyFinder plus: toward better interpretation and annotation of drug combination screening datasets Genomics Proteom. Bioinforma. 2022 20 587 596 10.1016/j.gpb.2022.01.004 PMC9801064 35085776 Zheng, S. et al. SynergyFinder plus: toward better interpretation and annotation of drug combination screening datasets. Genomics Proteom. Bioinforma. 20 10.1016/j.gpb.2022.01.004 PMC9801064 35085776 89. Franken NA Rodermond HM Stap J Haveman J van Bree C Clonogenic assay of cells in vitro Nat. Protoc. 2006 1 2315 2319 10.1038/nprot.2006.339 17406473 Franken, N. A., Rodermond, H. M., Stap, J., Haveman, J. & van Bree, C. Clonogenic assay of cells in vitro. Nat. Protoc. 1 17406473 10.1038/nprot.2006.339 90. Perez-Riverol Y The PRIDE database and related tools and resources in 2019: improving support for quantification data Nucleic Acids Res 2019 47 D442 D450 10.1093/nar/gky1106 30395289 PMC6323896 Perez-Riverol, Y. et al. The PRIDE database and related tools and resources in 2019: improving support for quantification data. Nucleic Acids Res 47 30395289 10.1093/nar/gky1106 PMC6323896 91. Edgar R Domrachev M Lash AE Gene Expression Omnibus: NCBI gene expression and hybridization array data repository Nucleic Acids Res 2002 30 207 210 10.1093/nar/30.1.207 11752295 PMC99122 Edgar, R., Domrachev, M. & Lash, A. E. Gene Expression Omnibus: NCBI gene expression and hybridization array data repository. Nucleic Acids Res 30 11752295 10.1093/nar/30.1.207 PMC99122 92. Vai, A. Code used for the data analysis of the manuscript: “A Histone-Centric Multi-Omics Study Shows that Increased H3K4 Methylation Sustains Triple Negative Breast Cancer Phenotypes. (Zenodo, 2025). 10.1038/s41467-025-63745-z 41028718 ",
  "metadata": {
    "Title of this paper": "Gene Expression Omnibus: NCBI gene expression and hybridization array data repository",
    "Journal it was published in:": "Nature Communications",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484688/"
  }
}