{
  "title": "Paper_328",
  "abstract": "pmc Cancer Sci Cancer Sci 2682 cas CAS Cancer Science 1347-9032 1349-7006 Wiley PMC12485659 PMC12485659.1 12485659 12485659 40706636 10.1111/cas.70144 CAS70144 CAS-OA-3330-2024.R3 1 Original Article ORIGINAL ARTICLE Cell, Molecular, and Stem Cell Biology Endothelial‐Mesenchymal Transition in Tumor Microenvironment Promotes Neuroendocrine Differentiation of Prostate Cancer Kageyama Takumi https://orcid.org/0000-0003-3690-2973  1 Kato Manabu  1 Miyachi Shiori  1 Bao Xin  1 Sekito Sho  1  2 Sugino Yusuke  1 Higashi Shinichiro  1 Sasaki Takeshi  1 Nishikawa Kouhei  1 Murakawa Yasuhiro  2 Watanabe Masatoshi  3 Inoue Takahiro https://orcid.org/0000-0001-8586-784X  1 tinoue28@med.mie-u.ac.jp   1 Department of Nephro‐Urologic Surgery and Andrology Mie University Graduate School of Medicine Tsu Japan   2 Institute for the Advanced Study of Human Biology Kyoto University Kyoto Japan   3 Department of Oncologic Pathology Mie University Graduate School of Medicine Tsu Japan * Correspondence: tinoue28@med.mie-u.ac.jp 24 7 2025 10 2025 116 10 498068 10.1111/cas.v116.10 2712 2722 03 7 2025 17 12 2024 09 7 2025 24 07 2025 02 10 2025 02 10 2025 © 2025 The Author(s). Cancer Science https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by-nc-nd/4.0/ ABSTRACT Neuroendocrine prostate cancer (NEPC) is a highly aggressive and treatment‐resistant subtype of castration‐resistant prostate cancer (CRPC) that often emerges during progression under androgen‐receptor (AR) pathway inhibition. While lineage plasticity in cancer cells has been recognized as a key mechanism of resistance, the role of the tumor microenvironment in driving this transition remains unclear. Among its cellular components, vascular endothelial cells can undergo endothelial‐mesenchymal transition (EndoMT), a phenotypic shift associated with tumor progression and fibrosis. Here, we investigated whether EndoMT contributes to NEPC development. Human umbilical vein endothelial cells (HUVEC) were induced to undergo EndoMT using IL‐1β and TGF‐β2, and are hereafter referred to as EndoMTed HUVEC. EndoMTed HUVEC promoted neuroendocrine features and functional changes in LNCaP cells. Transcriptome analysis revealed marked upregulation of granulocyte‐macrophage colony‐stimulating factor (GM‐CSF) in EndoMTed HUVEC. Neutralization of GM‐CSF signaling using mavrilimumab, a monoclonal antibody targeting the GM‐CSF receptor alpha (CSF2RA), and siRNA‐mediated CSF2RA knockdown both suppressed the neuroendocrine phenotype and STAT3 signaling of LNCaP cells. Conversely, GM‐CSF stimulation alone reproduced these changes. Enzalutamide‐treated LNCaP cells secreted IL‐1β and TGF‐β2, which in turn triggered EndoMT, suggesting a reciprocal loop. These findings indicate that anti‐androgen therapy may inadvertently promote NEPC through a paracrine loop involving tumor‐derived cytokines and endothelial GM‐CSF secretion, highlighting EndoMT as a microenvironmental driver of treatment resistance. Endothelial‐mesenchymal transition (EndoMT) contributes to neuroendocrine differentiation (NED) in prostate cancer. Using in vitro co‐culture models, we show that EndoMTed endothelial cells promote NED in prostate cancer cells via GM‐CSF signaling. These findings reveal a previously unrecognized paracrine mechanism by which the tumor microenvironment drives therapy‐induced NED. androgen deprivation therapy endothelial‐mesenchymal transition granulocyte‐macrophage colony‐stimulating factor neuroendocrine differentiation prostate cancer Japan Society for the Promotion of Science 10.13039/501100001691 24K02576 24K12434 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:01.10.2025  Funding: Abbreviations αSMA Alpha smooth muscle actin AR Androgen receptor CAF Cancer‐associated fibroblast CD31 Platelet endothelial cell adhesion molecule‐1 (PECAM‐1) CgA Chromogranin A CRPC Castration‐resistant prostate cancer CSF2 Colony‐stimulating factor 2 (gene encoding GM‐CSF) CSF2RA Colony‐stimulating factor 2 receptor alpha subunit EMT Epithelial‐mesenchymal transition EndoMT Endothelial‐mesenchymal transition GM‐CSF Granulocyte‐macrophage colony‐stimulating Factor HUVEC Human umbilical vein endothelial cell NE Neuroendocrine NED Neuroendocrine differentiation NEPC Neuroendocrine prostate cancer PSA Prostate‐specific antigen TME Tumor microenvironment 1 Introduction Tumor cells exist within a complex and dynamic microenvironment composed of stromal, immune, and endothelial cells. The tumor microenvironment (TME) is now recognized as essential in cancer progression, supporting tumor growth, metastatic dissemination, and therapy resistance [ 1 2 Initially described in the context of cardiac development [ 3 4 5 Prostate cancer exemplifies how interactions with the TME can drive tumor cell plasticity. Advanced prostate adenocarcinomas under therapeutic pressure can undergo lineage plasticity to acquire neuroendocrine (NE) features [ 6 7 8 9 10 11 12 13 Given that EndoMT can confer a pro‐inflammatory, fibroblast‐like secretory profile on endothelial cells [ 14 Specifically, we proposed that EndoMT‐derived cytokines could activate pathways, such as the JAK/STAT pathway, analogous to IL‐6‐mediated mechanisms [ 15 2 Materials and Methods 2.1 Human Samples Prostate tissue specimens used in this study were carefully selected from surgical specimens of patients with NEPC with complete clinicopathological data. The prostate cancer tissues were acquired via prostate tumor biopsy or transurethral resection. Samples were embedded in paraffin and subjected to immunofluorescence staining. 2.2 Antibodies The antibodies used in this study for western blotting and immunofluorescence staining, along with their sources, catalog numbers, RRIDs, and working concentration, are detailed in Table S1 2.3 Cell Sources and Cell Culture LNCaP, C4‐2, PC3, and DU145 prostate cancer cell lines were obtained from ATCC (Manassas, VA, USA). HUVEC were purchased from Lonza Biosciences (Lonza, C2519A, Basel, Switzerland). Cell culture conditions are detailed in Doc S1 2.4 Induction of Endothelial‐Mesenchymal Transition EndoMT was induced in HUVEC by interleukin‐1 beta (IL‐1β) and human transforming growth factor beta 2 (TGF‐β2) as previously described [ 16 S2 2.5 Co‐Culture of Prostate Cancer Cell Lines With EndoMTed HUVEC Prostate cancer cells were co‐cultured with untreated or EndoMTed HUVEC in a two‐chamber system under androgen‐deprived conditions. HUVEC were seeded in inserts and induced to undergo EndoMT prior to co‐culture, as detailed in Doc S3 2.6 Cell Quantification Cells were trypsinized and collected to quantify viable cells using an automated cell counter (AMQAX1000, Thermo Fisher Scientific [Thermo], Waltham, MA, USA) with trypan blue exclusion, according to the manufacturer's instructions. 2.7 Cell Migration Assay Transwell migration assays (12‐well, 8.0 μm pores) were used to assess LNCaP cells' migration toward conditioned media from EndoMTed or control HUVEC, or granulocyte‐macrophage colony‐stimulating factor (GM‐CSF)‐supplemented medium, as detailed in Doc S4 2.8 Immunofluorescence Staining Cells were fixed with 4% paraformaldehyde, permeabilized, and blocked before incubation with primary antibodies. Antigen retrieval was performed for paraffin‐embedded sections. Detailed protocols are provided in Doc S5 2.9  RNA cDNA PCR TaqMan PCR Total RNA was extracted (RNeasy Mini Kit, Qiagen, 74104, Venlo, Netherlands) and reverse‐transcribed (High‐Capacity RNA‐to‐cDNA Kit, Thermo, 4387406). Quantitative PCR (qPCR) was performed using TaqMan assays on a QuantStudio 1 Real‐Time PCR system (Thermo), with expression levels normalized to GAPDH 18S rRNA S6 S7 2.10 ELISA Aliquots of conditioned medium were analyzed by ELISA (Quantikine kits: IL‐1β [DLB50], TGF‐β2 [DB250], GM‐CSF [DGM00]; Bio‐Techne, Minneapolis, MN, USA) to quantify protein levels per the manufacturer's instructions. 2.11 Western Blot Analysis Cells were lysed in RIPA buffer with protease and phosphatase inhibitors. Proteins (30 μg) were separated by SDS‐PAGE and transferred to PVDF membranes. Protein bands were visualized using enhanced chemiluminescence and quantified by densitometry using Image (RRID: SCR_003070) [ 17 S8 2.12  RNA Libraries were sequenced on a NovaSeq 6000 platform (Illumina, San Diego, CA, USA). Reads were processed using Trimmomatic, STAR, featureCounts, and edgeR, and differentially expressed genes were identified with a false discovery rate (FDR) < 0.01. The resulting data were analyzed using RStudio (RRID: SCR_000432). Detailed protocols are provided in Doc S9 2.13  GM CSF To evaluate the effect of GM‐CSF signaling inhibition on NED, mavrilimumab, a human monoclonal antibody targeting the GM‐CSF receptor α subunit (CSF2RA) (Selleck Chemicals, A2532, Houston, TX, USA), was added to the co‐culture at 10 μg/mL under androgen‐deprived conditions. Methods are detailed in Doc S10 2.14  siRNA CSF2RA To genetically suppress GM‐CSF receptor signaling, LNCaP cells were transfected with siRNAs targeting CSF2RA S11 2.15 Stimulation of LNCaP GM CSF To evaluate the effect of GM‐CSF on NED, LNCaP cells were cultured under androgen‐deprived conditions and treated with recombinant human GM‐CSF (PeproTech, 300–03, Cranbury, NJ, USA) at a final concentration of 1 nM. After 96 h of stimulation, cells were harvested for gene and protein expression analysis. Protocols are detailed in Doc S12 2.16 Colocalization Analysis Colocalization analysis was performed to evaluate the spatial relationship between NE cells (CgA‐positive) and vascular endothelial cells (CD31‐positive) in the immunofluorescence‐stained sections. Image processing and analysis were conducted using Fiji (RRID: SCR_002285) [ 18 19 S13 2.17 Statistical Analysis All experiments were performed in triplicate. Data are shown as mean ± SD. Group differences were assessed by Student's t‐test or one‐way ANOVA, with significance set at p 3 Results 3.1 Treatment With IL TGF As previously described [ 20 S1A S1A CD31, CDH5 ACTA2, TAGLN FAP, PDGFR S1B 3.2 Co‐Culture With EndoMTed HUVEC LNCaP As tumor plasticity is modulated by the TME, we evaluated whether EndoMTed HUVEC could induce NED of prostate cancer cells. As shown in Figure 1A CHGA 1C 2A,B 2C,D FIGURE 1 Neuroendocrine differentiation‐like changes of LNCaP cells after co‐cultured with EndoMTed HUVEC. (A) Immunofluorescence staining of LNCaP cells co‐cultured with EndoMTed HUVEC (w/EndoMTed HUVEC), untreated HUVEC (w/HUVEC), or cultured alone, showing chromogranin A (CgA) expression. Scale bar: 200 μM. (B) CHGA FIGURE 2 Phenotypical changes in androgen‐dependent prostate cancer cells, LNCaP, co‐cultured with EndoMTed HUVEC. (A) Brightfield microscope images of LNCaP cells alone, co‐cultured with untreated HUVEC (w/HUVEC), or with EndoMTed HUVEC (w/EndoMTed HUVEC) 24 h after seeding (start of co‐culture) and 96 h after co‐culturing. Scale bar 200 μM. (B) Cell proliferation rates at 96 h relative to 24 h under each condition. (C, D) Transwell migration assay using conditioned medium (CM) from HUVEC and EndoMTed HUVEC. Migrated cells were counted in five random fields per insert (20×). The average number of migrated cells per field was calculated. * p CHGA To further confirm this transition, gene expression analysis using cDNA microarray revealed upregulation of NE‐related transcriptional programs, including CHGA SYP FOXA2 AURKA MYCN 2E 2F We also checked whether the phenomenon is reversible or not. We observed that if LNCaP cells co‐cultured with EndoMTed HUVEC were returned to androgen‐containing, standard RPMI‐1640 medium with 10% FBS relatively early (after 96 h of co‐culturing), they began to re‐express PSA to some extent, and their CHGA 2G To assess whether the NED induced by EndoMTed HUVEC is a generalizable phenomenon among prostate cancer cell lines, we performed co‐culture experiments using additional cell lines. In AR‐positive C4‐2 cells, co‐culture with EndoMTed HUVEC led to increased expression of CHGA S2 CHGA S2 3.3 Granulocyte‐Macrophage Colony‐Stimulating Factor Might Participate in the Transition of Prostate Cancer Cells to Neuroendocrine Cells We comprehensively analyzed gene expressions in HUVEC and EndoMTed HUVEC using RNA‐Seq to investigate the factors excreted by EndoMTed HUVEC that might induce NED of LNCaP cells. Several genes were significantly upregulated in EndoMTed HUVEC (Figure 3A S3A CSF2 3B CSF2 S3B S3C 21 FIGURE 3 Expression analysis between HUVEC and EndoMTed HUVEC. (A) Heatmap of RNA‐seq analysis showing upregulated genes in EndoMTed HUVEC ( n To determine the functional relevance of GM‐CSF signaling in NED, we first examined the activation of downstream effectors in LNCaP cells co‐cultured with EndoMTed HUVEC. Western blotting showed an increased phosphorylation of STAT3 (Y705) and upregulation of MYC (c‐MYC) (Figure 4A 2F FIGURE 4 GM‐CSF–STAT3–MYC axis mediates neuroendocrine differentiation in LNCaP cells. (A) Western blotting of STAT3/MYC signaling pathway in LNCaP cells co‐cultured with HUVEC (w/HUVEC) or EndoMTed HUVEC (w/EndoMTed HUVEC). (B) Western blotting of NE markers and STAT3–MYC (c‐MYC) signaling in LNCaP cells co‐cultured with EndoMTed HUVEC and treated with mavrilimumab. (C) Western blotting of NE markers and STAT3–MYC signaling after siRNA‐mediated CSF2RA knockdown in LNCaP cells. (D) Western blotting of NE markers in LNCaP cells stimulated with recombinant GM‐CSF under androgen‐deprived conditions. (E) Transwell migration assay of LNCaP culture stimulated with GM‐CSF under androgen‐deprived conditions. (F) Quantification of migrated LNCaP cells; five random fields per insert were counted under a light microscope at 20× magnification. * p We next performed two independent intervention experiments to validate whether GM‐CSF plays the role through the GM‐CSF receptor α chain (CSF2RA). First, treatment with mavrilimumab, a monoclonal antibody targeting CSF2RA, significantly reduced STAT3 phosphorylation, c‐MYC expression, and suppressed NE marker induced in LNCaP cells co‐cultured with EndoMTed HUVEC (Figure 4B 4C To confirm that GM‐CSF alone is sufficient to recapitulate these phenotypic changes, we directly treated LNCaP cells with recombinant GM‐CSF under androgen‐deprived conditions. This stimulation led to increased expression of CgA and FOXA2 while suppressing FOXA1 expression—molecular patterns consistent with those observed in the co‐culture system (Figure 4D 4E,F S4 3.4 Androgen‐Receptor Blockade Induces IL TGF LNCaP EndoMT HUVEC We further investigated whether IL‐1β and TGF‐β2 would be secreted by prostate cancer cells through AR blockade. Treatment with enzalutamide led to elevated secretion of cytokines, IL‐1β and TGF‐β2, in LNCaP cells (Figure 5A 5B FIGURE 5 Elevated secretion of IL‐1β and TGF‐β2 in LNCaP cells, and EndoMT induction of HUVEC by LNCaP conditioned medium. (A) ELISA of IL‐1β and TGF‐β2 in culture media from LNCaP cells treated with or without enzalutamide (5 nM for 96 h, Selleck Chemicals, S1250). (B) Immunofluorescence staining of endothelial marker CD31 and mesenchymal marker αSMA in HUVEC exposed to conditioned media from untreated or enzalutamide‐treated LNCaP cells for 96 h, with one medium change at 48 h. * p 3.5 Vascular Endothelial Cells Closely Reside With Neuroendocrine‐Differentiated Prostate Cancer Cells in Human Castration‐Resistant Prostate Cancer Tissues Finally, we examined whether prostate cancer cells and vascular endothelial cells closely reside in human CRPC tissues. We selected three CRPC tissue samples with NED. We found that immunofluorescence staining revealed the proximity of vascular endothelial and NE cells (Figure 6 FIGURE 6 Histopathological features of human castration‐resistant prostate cancer tissues. Representative images of hematoxylin and eosin (HE) and immunofluorescence (IF) staining from three castration‐resistant prostate cancer (CRPC) cases with neuroendocrine differentiation (A–C). Colocalization analysis using ImageJ software quantitatively assessed the spatial relationship between vascular endothelial cells (CD31‐positive) and neuroendocrine cells (CgA‐positive), with Pearson's correlation coefficients (PCCs) of 0.39, 0.53, and 0.40 for patients A, B, and C, respectively (average PCC: 0.47). Green: CgA; Red: CD31; Blue: Nuclei. Scale bar: 50 μm. Clinical characteristics of each patient are summarized in Table S2 4 Discussion In this study, we demonstrate that EndoMT within the prostate TME can directly promote NED of cancer cells via a paracrine mechanism. Endothelial cells induced to undergo EndoMT secreted factors that drove adjacent prostate cancer cells toward an NE‐like phenotype, characterized by the expression of NE markers. Among these factors, GM‐CSF was a candidate that activated STAT3 signaling in tumor cells and upregulated c‐MYC, ultimately facilitating NED and cell proliferation. These findings reveal an interesting microenvironment‐driven mechanism of tumor cell plasticity with significant implications for prostate cancer progression and therapy. Our results reveal an interaction between tumor endothelial cells and cancer cells. EndoMT is increasingly recognized as an adaptive process in cancerous tissue, yielding mesenchymal‐like cells (often akin to CAFs) that can promote tumor growth, invasiveness, and therapeutic resistance [ 22 23 One of the most clinically relevant aspects of NED in prostate cancer is its association with treatment resistance and poor outcomes [ 24 11 6 25 26 A major finding of this study is the identification of the GM‐CSF secreted by EndoMTed HUVEC through CSF2RA as a contributing pathway for NED in prostate cancer. Additionally, this pathway upregulated the STAT3–c‐MYC pathway, which might contribute to the cell proliferation of prostate cancer cells. Neutralizing GM‐CSF signaling with mavrilimumab (an antibody against the GM‐CSF receptor‐α) or silencing its receptor (CSF2RA) suppressed NE marker expression, diminished STAT3 activation, and reduced c‐MYC expression. These findings suggest that the GM‐CSF/CSF2RA pathway might be a key component of the inflammatory network driving lineage plasticity and be a promising target of treatment‐induced NEPC. From a translational perspective, our finding that factors secreted from EndoMTed endothelial cells promote NED in prostate cancer suggests several potential therapeutic opportunities. One approach may involve targeting EndoMT itself: preventing or reversing this process in tumor‐associated endothelial cells could attenuate the paracrine signaling that promotes NEPC emergence. Given that EndoMT is primarily driven by TGF‐β and other cytokines [ 27 28 29 30 31 Notably, hormone therapy with enzalutamide, intended to suppress prostate cancer progression, increased the secretion of cytokines like IL‐1β and TGF‐β2 in LNCaP cells. The IL‐1β and TGF‐β2 further promoted the induction of HUVEC to the mesenchymal phenotype, EndoMTed HUVEC. EndoMTed HUVEC subsequently induced NED of LNCaP cells. Although new‐generation anti‐androgens, such as enzalutamide, may more effectively suppress AR signaling and reduce AR‐positive prostate cancer cells, they promote the enrichment of AR‐negative NE cells, potentially worsening treatment‐resistant forms such as NEPC [ 32 33 Although the number of clinical cases evaluated in this study was small, we found that vascular endothelial cells and NE cells in human CRPC tissue were closely located. However, we could not differentiate between EndoMTed endothelial cells and other CAFs by immunofluorescence staining. Therefore, we alternatively examined the relative distances between vascular endothelial cells and CgA‐positive prostate cancer cells, representing neuroendocrine‐differentiated cells. Although our results do not directly translate into an interaction between neuroendocrine‐differentiated prostate cancer cells and EndoMTed endothelial cells, we propose that our in vitro phenomenon might also partly occur in human CRPC tissues. We acknowledge that our study has several limitations. First, we employed an in vitro co‐culture and conditioned medium model using HUVEC to investigate the influence of EndoMT on prostate cancer cells. While this reductionist system allowed us to dissect specific stromal–epithelial interactions, it does not fully recapitulate the complexity of the in vivo TME, which includes immune cells, fibroblasts, and various soluble factors. For instance, other cytokines such as IL‐6 and IL‐8 are also known to promote NED and may act synergistically with GM‐CSF in vivo [ 34 Second, although we observed spatial proximity between CD31‐positive endothelial cells and CgA‐positive tumor cells in human CRPC tissue samples, these data are correlative and do not provide causal evidence for the contribution of EndoMT to the development of t‐NEPC. To directly address this question, in vivo studies are warranted. A possible strategy would be to establish a subcutaneous xenograft model by implanting spheroid models constructed by co‐culturing LNCaP cells and HUVEC in a 3D culture into immunocompromised mice, as demonstrated in similar multicellular tumor spheroid models for non‐small cell lung cancer [ 35 36 Third, although the GM‐CSF/CSF2RA pathway might participate in prostate cancer cell proliferation through the STAT3–c‐MYC pathway, we did not have any results of molecular pathways contributing to prostate cancer cell migration or invasion. There are several hypotheses as follows: (1) GM‐CSF has been reported to upregulate matrix metalloproteinases (MMPs) in tumor cells and associated stromal cells [ 37 26 22 In conclusion, this study identifies EndoMT in the TME as a key driver of NED in prostate cancer (Figure  7 FIGURE 7 LNCaP‐derived IL‐1β and TGF‐β2 induce HUVEC endothelial‐mesenchymal transition under androgen deprivation conditions, and the EndoMTed HUVEC, in turn, promotes LNCaP castration resistance. Targeting the EndoMT–GM‐CSF signaling axis may represent a new therapeutic approach to prevent the emergence of treatment‐induced NEPC. Our results underscore the importance of tumor microenvironmental cues in shaping cancer cell plasticity and support more integrative strategies for managing advanced prostate cancer. Author Contributions  Takumi Kageyama: Manabu Kato: Shiori Miyachi: Xin Bao: Sho Sekito: Yusuke Sugino: Shinichiro Higashi: Takeshi Sasaki: Kouhei Nishikawa: Yasuhiro Murakawa: Masatoshi Watanabe: Takahiro Inoue: Disclosure Registry and the Registration No. of the Study/Trial: Not applicable. Animal Studies: All animal experiments were approved by the Animal Research Committee of Mie University (approval number: 2019–32). Ethics Statement Approval of the research protocol by an Institutional Review Board: This study was approved by the Institutional Review Board of the Mie University Hospital (approval number: 2425) and adhered to the highest ethical standards. Consent Written informed consent was obtained from all patients after full disclosure of the purpose and nature of all procedures. Conflicts of Interest The authors declare no conflicts of interest. Supporting information  Table S1.  Table S2.  Doc S1.  Doc S2.  Doc S3.  Doc S4.  Doc S5.  Doc S6.  Doc S7.  Doc S8.  Doc S9.  Doc S10.  Doc S11.  Doc S12.  Doc S13.  Figure S1.  Figure S2.  Figure S3.  Figure S4. Acknowledgments We would like to thank DNA Chip Research Inc. (Kanagawa, Japan) for their support with RNA‐Seq analysis and data acquisition. We also thank Editage (Mumbai, India) for professional English language editing and graphical abstract preparation. Data Availability Statement The RNA‐seq data from this study are available online from NCBI Sequence Read Archive (RRID: SCR_00489, accession number: PRJNA1181033) and Gene Expression Omnibus (RRID: SCR_005012, accession number: GSE281995 References 1 S. Maman I. P. Witz A History of Exploring Cancer in Context Nature Reviews Cancer 18 6 2018 359 376 29700396 10.1038/s41568-018-0006-7 2 D. F. Quail J. A. Joyce Microenvironmental Regulation of Tumor Progression and Metastasis Nature Medicine 19 11 2013 1423 1437 10.1038/nm.3394 PMC3954707 24202395 3 J. C. Kovacic S. Dimmeler R. P. Harvey Endothelial to Mesenchymal Transition in Cardiovascular Disease: JACC State‐Of‐The‐Art Review Journal of the American College of Cardiology 73 2 2019 190 209 30654892 10.1016/j.jacc.2018.09.089 PMC6865825 4 E. M. Zeisberg S. Potenta L. Xie M. Zeisberg R. Kalluri Discovery of Endothelial to Mesenchymal Transition as a Source for Carcinoma‐Associated Fibroblasts Cancer Research 67 21 2007 10123 10128 17974953 10.1158/0008-5472.CAN-07-3127 5 Y. Yoshimatsu I. Wakabayashi S. Kimuro TNF‐α Enhances TGF‐β‐Induced Endothelial‐To‐Mesenchymal Transition via TGF‐β Signal Augmentation Cancer Science 111 7 2020 2385 2399 32385953 10.1111/cas.14455 PMC7385392 6 Y. Yamada H. Beltran Clinical and Biological Features of Neuroendocrine Prostate Cancer Current Oncology Reports 23 2 2021 15 33433737 10.1007/s11912-020-01003-9 PMC7990389 7 S. Belkahla I. Nahvi S. Biswas I. Nahvi N. Ben Amor Advances and Development of Prostate Cancer, Treatment, and Strategies: A Systemic Review Frontiers in Cell and Developmental Biology 10 2022 991330 36158198 10.3389/fcell.2022.991330 PMC9501970 8 S. Owa T. Sasaki R. Ikadai Psoas Mass Index at the Level of the Third Lumbar Vertebra on Computed Tomography Is a Prognostic Predictor for Metastatic Castration‐Sensitive Prostate Cancer International Journal of Clinical Oncology 29 6 2024 840 846 38587577 10.1007/s10147-024-02514-2 9 S. Akamatsu T. Inoue O. Ogawa M. E. Gleave Clinical and Molecular Features of Treatment‐Related Neuroendocrine Prostate Cancer International Journal of Urology : Official Journal of the Japanese Urological Association 25 4 2018 345 351 29396873 10.1111/iju.13526 10 A. R. Lee Y. Gan N. Xie V. R. Ramnarine J. M. Lovnicki X. Dong Alternative RNA Splicing of the GIT1 Gene Is Associated With Neuroendocrine Prostate Cancer Cancer Science 110 1 2019 245 255 30417466 10.1111/cas.13869 PMC6317919 11 R. Romero T. Chu T. J. González Robles The Neuroendocrine Transition in Prostate Cancer Is Dynamic and Dependent on ASCL1 Nature Cancer 5 11 2024 1641 1659 39394434 10.1038/s43018-024-00838-6 PMC11584404 12 F. Sun Z. W. Zhang E. M. Tan Icaritin Suppresses Development of Neuroendocrine Differentiation of Prostate Cancer Through Inhibition of IL‐6/STAT3 and Aurora Kinase A Pathways in TRAMP Mice Carcinogenesis 37 7 2016 701 711 27207661 10.1093/carcin/bgw044 13 S. Araki Y. Omori D. Lyn Interleukin‐8 Is a Molecular Determinant of Androgen Independence and Progression in Prostate Cancer Cancer Research 67 14 2007 6854 6862 17638896 10.1158/0008-5472.CAN-07-1162 14 V. Platel S. Faure I. Corre N. Clere Endothelial‐To‐Mesenchymal Transition (EndoMT): Roles in Tumorigenesis, Metastatic Extravasation and Therapy Resistance Journal of Oncology 2019 2019 8361913 8361945 10.1155/2019/8361945 PMC6701373 31467544 15 D. E. Johnson R. A. O'Keefe J. R. Grandis Targeting the IL‐6/JAK/STAT3 Signalling Axis in Cancer Nature Reviews Clinical Oncology 15 4 2018 234 248 10.1038/nrclinonc.2018.8 PMC5858971 29405201 16 T. T. A. Liguori G. R. Liguori L. F. P. Moreira M. C. Harmsen Adipose Tissue‐Derived Stromal Cells' Conditioned Medium Modulates Endothelial‐Mesenchymal Transition Induced by IL‐1β/TGF‐β2 but Does Not Restore Endothelial Function Cell Proliferation 52 6 2019 e12629 31468648 10.1111/cpr.12629 PMC6869467 17 T. Inoue T. Yoshida Y. Shimizu Requirement of Androgen‐Dependent Activation of Protein Kinase Czeta for Androgen‐Dependent Cell Proliferation in LNCaP Cells and Its Roles in Transition to Androgen‐Independent Cells Molecular Endocrinology (Baltimore, md) 20 12 2006 3053 3069 16931574 10.1210/me.2006-0033 18 J. Schindelin I. Arganda‐Carreras E. Frise Fiji: An Open‐Source Platform for Biological‐Image Analysis Nature Methods 9 7 2012 676 682 22743772 10.1038/nmeth.2019 PMC3855844 19 K. W. Dunn M. M. Kamocka J. H. McDonald A practical guide to evaluating colocalization in biological microscopy American Journal of Physiology‐Cell Physiology 300 4 2011 C723 C742 21209361 10.1152/ajpcell.00462.2010 PMC3074624 20 M. Maleszewska J. R. Moonen N. Huijkman B. van de Sluis G. Krenning M. C. Harmsen IL‐1β and TGFβ2 Synergistically Induce Endothelial to Mesenchymal Transition in an NFκB‐Dependent Manner Immunobiology 218 4 2013 443 454 22739237 10.1016/j.imbio.2012.05.026 21 J. A. Hamilton GM‐CSF in Inflammation Journal of Experimental Medicine 217 1 2020 e20190945 31611249 10.1084/jem.20190945 PMC7037240 22 P. Leone E. Malerba N. Susca Endothelial Cells in Tumor Microenvironment: Insights and Perspectives Frontiers in Immunology 15 2024 1367875 38426109 10.3389/fimmu.2024.1367875 PMC10902062 23 S. Piera‐Velazquez S. A. Jimenez Endothelial to Mesenchymal Transition: Role in Physiology and in the Pathogenesis of Human Diseases Physiological Reviews 99 2 2019 1281 1324 30864875 10.1152/physrev.00021.2018 PMC6734087 24 S. Liu B. R. Alabi Q. Yin T. Stoyanova Molecular Mechanisms Underlying the Development of Neuroendocrine Prostate Cancer Seminars in Cancer Biology 86 Pt 3 2022 57 68 35597438 10.1016/j.semcancer.2022.05.007 25 A. Kumar A. Taghi Khani A. Sanchez Ortiz S. Swaminathan GM‐CSF: A Double‐Edged Sword in Cancer Immunotherapy Frontiers in Immunology 13 2022 901277 35865534 10.3389/fimmu.2022.901277 PMC9294178 26 K. I. Ansari A. Bhan M. Saotome Autocrine GMCSF Signaling Contributes to Growth of HER2(+) Breast Leptomeningeal Carcinomatosis Cancer Research 81 18 2021 4723 4735 34247146 10.1158/0008-5472.CAN-21-0259 PMC8986153 27 C. Qian G. Dong C. Yang Broadening Horizons: Molecular Mechanisms and Disease Implications of Endothelial‐To‐Mesenchymal Transition Cell Communication and Signaling : CCS 23 1 2025 16 39789529 10.1186/s12964-025-02028-y PMC11720945 28 R. Fontana A. Mestre‐Farrera J. Yang Update on Epithelial‐Mesenchymal Plasticity in Cancer Progression Annual Review of Pathology 19 2024 133 156 10.1146/annurev-pathmechdis-051222-122423 PMC10872224 37758242 29 M. C. Cid S. H. Unizony D. Blockmans Efficacy and Safety of Mavrilimumab in Giant Cell Arteritis: A Phase 2, Randomised, Double‐Blind, Placebo‐Controlled Trial Annals of the Rheumatic Diseases 81 5 2022 653 661 35264321 10.1136/annrheumdis-2021-221865 PMC8995812 30 R. M. Fleischmann D. van der Heijde V. Strand Anti‐GM‐CSF Otilimab Versus Tofacitinib or Placebo in Patients With Active Rheumatoid Arthritis and an Inadequate Response to Conventional or Biologic DMARDs: Two Phase 3 Randomised Trials (contRAst 1 and contRAst 2) Annals of the Rheumatic Diseases 82 12 2023 1516 1526 37699654 10.1136/ard-2023-224482 PMC10646845 31 Z. Temesgen C. D. Burger J. Baker Lenzilumab in Hospitalised Patients With COVID‐19 Pneumonia (LIVE‐AIR): A Phase 3, Randomised, Placebo‐Controlled Trial Lancet Respiratory Medicine 10 3 2022 237 246 34863332 10.1016/S2213-2600(21)00494-X PMC8635458 32 W. Butler J. Huang Neuroendocrine Cells of the Prostate: Histology, Biological Functions, and Molecular Mechanisms Precision Clinical Medicine 4 1 2021 25 34 33842835 10.1093/pcmedi/pbab003 PMC8023015 33 H. Beltran D. Prandi J. M. Mosquera Divergent Clonal Evolution of Castration‐Resistant Neuroendocrine Prostate Cancer Nature Medicine 22 3 2016 298 305 10.1038/nm.4045 PMC4777652 26855148 34 Z. Culig Response to Androgens and Androgen Receptor Antagonists in the Presence of Cytokines in Prostate Cancer Cancers 13 12 2021 2944 34204596 10.3390/cancers13122944 PMC8231240 35 S. H. Kim Y. Song H. R. Seo GSK‐3β Regulates the Endothelial‐To‐Mesenchymal Transition via Reciprocal Crosstalk Between NSCLC Cells and HUVECs in Multicellular Tumor Spheroid Models Journal of Experimental & Clinical Cancer Research 38 1 2019 46 10.1186/s13046-019-1050-1 30709379 PMC6359813 36 D. R. Enis B. R. Shepherd Y. Wang Induction, Differentiation, and Remodeling of Blood Vessels After Transplantation of Bcl‐2‐Transduced Endothelial Cells Proceedings of the National Academy of Sciences of the United States of America 102 2 2005 425 430 15625106 10.1073/pnas.0408357102 PMC544288 37 I. S. Hong Stimulatory Versus Suppressive Effects of GM‐CSF on Tumor Progression in Multiple Cancer Types Experimental & Molecular Medicine 48 7 2016 e242 27364892 10.1038/emm.2016.64 PMC4973317 ",
  "metadata": {
    "Title of this paper": "Stimulatory Versus Suppressive Effects of GM‐CSF on Tumor Progression in Multiple Cancer Types",
    "Journal it was published in:": "Cancer Science",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485659/"
  }
}