{
  "title": "Paper_245",
  "abstract": "J Natl Cancer Inst J Natl Cancer Inst 319 nihpa Journal of the National Cancer Institute 0027-8874 1460-2105 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12487841 PMC12487841.1 12487841 12487841 NIHMS2112057 41022397 10.1093/jnci/djaf280 NIHMS2112057 NIHPA2112057 1 Article Use of Hair Straighteners/Chemical Relaxers and Incidence of Non-Reproductive Cancers Bailey Jared T. MPH 1 Chang Che-Jung PhD 2 3 Gaston Symielle A. PhD, MPH 2 Jackson Chandra L. PhD, MS 2 Sandler Dale P. PhD 2 O’Brien Katie M. PhD 2 White Alexandra J. PhD, MSPH 2 1 2 3 Corresponding Author: alexandra.white@nih.gov Conflicts of Interest: 30 9 2025 498036 djaf280 20 09 2025 01 10 2025 02 10 2025 02 10 2025 Background: Use of hair straighteners and chemical relaxers has been associated with increased incidence of breast, uterine, and ovarian cancers. However, their potential association with non-reproductive cancers remains unknown, despite evidence that some ingredients in these products may be genotoxic. We therefore examined use of hair straighteners/chemical relaxers in relation to the incidence of non-reproductive cancers. Material and Methods. We analyzed data from 46,287 cancer-free women from the Sister Study, a U.S.-wide cohort enrolled between 2003–2009 (ages 35–74). Participants reported frequency of hair straightener/chemical relaxer use in the 12 months prior to enrollment. Incident cancers (melanoma, thyroid, lung, non-Hodgkin’s lymphoma, leukemia, pancreatic, colorectal, and kidney cancers) were self-reported and confirmed with pathology reports when possible. We used multivariable Cox proportional hazards models to estimate hazard ratios (HRs) and 95% confidence intervals (CIs) for hair straighteners/chemical relaxer use and incident cancers, adjusting age, race and ethnicity, educational attainment, and smoking status. Results. During a median follow-up of 13.1 years, use of hair straighteners/chemical relaxers was associated with a higher incidence of thyroid cancer (n=225 cases; HR:1.71, 95% CI:1.01–2.89), non-Hodgkin’s lymphoma (n=313 cases; HR:1.62, 95% CI:0.94– 2.80), and pancreatic cancer (n=138 cases; HR:2.66, 95% CI: 1.25–5.66). There was little evidence of dose-response with increasing frequency of use. We observed negligible or imprecise associations for the remaining cancer types. Conclusions and Relevance: Use of hair straighteners/chemical relaxers may be associated with a higher incidence of thyroid cancer, non-Hodgkin’s lymphoma, and pancreatic cancer. Further research is needed to confirm these findings. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf yes pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Use of Hair Straighteners/Chemical Relaxers and Incidence of Non-Reproductive Cancers",
    "Journal it was published in:": "Journal of the National Cancer Institute",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487841/"
  }
}