{
  "title": "Paper_211",
  "abstract": "pmc Front Public Health Front Public Health 2277 frontpubhealth Front. Public Health Frontiers in Public Health 2296-2565 Frontiers Media SA PMC12488642 PMC12488642.1 12488642 12488642 10.3389/fpubh.2025.1646950 1 Public Health Original Research Estimation of the current healthcare costs of gout in Liaoning Province from 2015 to 2022 based on the SHA2011 accounting system Shi Xiaoxia  1 Zheng Fengchun  2 Wan Quan  3 Chai Peipei  3 Wang Guilin  4 Pang Zhenmiao  1  * Ma Yuedan  5  * 1 School of Public Health and Management, Guangzhou University of Chinese Medicine Guangzhou China 2 Liaoning Health Economics Association Shenyang China 3 China National Health Development Research Center Beijing China 4 Department of Traditional Chinese Medicine, School of Graduate Students, Liaoning University of Traditional Chinese Medicine Shenyang China 5 Department of Public Management, School of Economics and Management, Liaoning University of Traditional Chinese Medicine Shenyang China Edited by: Xiaozhen Lai Reviewed by: Styliani A. Geronikolou Ran Tao *Correspondence: Zhenmiao Pang, pangzhenmiao@gzucm.edu.cn mydpony@163.com 18 9 2025 2025 13 480651 1646950 17 6 2025 01 9 2025 18 09 2025 03 10 2025 03 10 2025 Copyright © 2025 Shi, Zheng, Wan, Chai, Wang, Pang and Ma. 2025 Shi, Zheng, Wan, Chai, Wang, Pang and Ma https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Background Gout has become a major public health problem worldwide, causing severe pain, discomfort, inflammation, mobility problems and impaired physical functioning, resulting in heavy economic losses and social burdens. Methods The study was based on System of Health Accounts 2011 (SHA2011) and data of 97,907 patients from 1,084 healthcare organizations were taken using multistage stratified random sampling method. Descriptive analysis of therapeutic care expenditures (CCE), Sankey diagram to analyze the flow of CCE, Mann–Whitney U test to analyze 2 independent samples, Kruskal-Wallis H to analyze K independent samples significance. Multifactorial analysis of CCE influences, Structural Equation Modeling (SEM) to analyze the direct and indirect effects and mediating role. Results CCE increases from CNY 25.32 million in 2015 to CNY 116.02 million in 2022, with a concentration of ages 30–69. The proportion of public health financing decreases with age and is dominated by general hospitals. The difference is significant in single-factor analysis, and the high cost in multi-factor analysis is related to purchase drugs, elective treatment, basic medical insurance for urban and rural residents, provincial level, Chinese medicine hospitals, and large standardized coefficients in 2020, and outpatient/inpatient care, drugs, type of institution, insurance status, and gender by path coefficients in the SEM in the order of directly or indirectly affecting the CCE. Conclusion Gout disease in Liaoning Province imposes a heavy financial burden on patients and the health insurance system. It is recommended to increase reimbursement for gout inpatient costs, improve primary care guidelines and purinol dose adherence, strengthen primary care collaborative personalized education and care to achieve uric acid-lowering effects, increase subsidies and inclusion of gout prescription medications in the local health insurance directory, and for men to reduce consumption of high-purine foods and alcohol at social events. gout direct medical expenditure medical service utilization SHA2011 social health insurance The author(s) declare that financial support was received for the research and/or publication of this article. This research was funded by China National Health Development Research Center Project of Humanities and Social Sciences Grant No. 2022000000430. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Health Economics 1 Introduction Due to the accumulation of urate crystals in the joints, gout causes highly intense pain, lingering discomfort and inflammation, and limited range of motion at the joints, it has become a common metabolic disease after diabetes ( 1 2 3 4 5 6 7 8 9 4 4 10 Gout leads to mobility problems and impaired physical functioning, gout also imposes financial costs on the patient ( 11 12 13 6 14 15 16 17 18 19 20 21 18 22 23 24 25 26 27 27 28 29 29 30 26 31 32 31 33 According to a recent survey of thirty-one different provinces in continental China, gout has become a major public health problem in China, the loaded rate was 3.2% for adult gout in China, and it is estimated that by the year 2021 to 100 million people in China will suffer from gout ( 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 In gout studies, all have used the Wilcoxon signed rank sum test primarily for continuous variables and the χ 2 23 52 18 25 52 53 2 52 26 18 26 29 53 54 55 56 57 58 59 SHA2011 is an internationally recognized scientific method and systematic tool for tracking the entire flow of health funds from source, to flow, to use, and is an important method for identifying the health care burden of the population and the degree of risk protection, and is currently the most advanced international health cost accounting method ( 60 61 62 2 Methods 2.1 Data source The macroeconomic indicators of Liaoning Province utilized in this study include the 2015–2022 Liaoning Health Statistics Yearbook, the Liaoning Health Financial Annual Report, the Liaoning government health input monitoring table, the social decision table of the Liaoning Provincial Department of Finance, the breakdown of various types of health insurance of the Liaoning Provincial Health Insurance Bureau, the results of the Liaoning source and institutional methods of measurement, and the Liaoning Provincial Supervisory Bureau’s statistical table of the operation of insurance, which provide great support for the measurement of the Liaoning Province gout. This is a great support for measuring the cost of gout in Liaoning Province. Liaoning Province has 14 cities and municipalities, the overall size of the population is exceptionally large, the overall number of healthcare organizations is exceptionally high, 37,124, involving plus the geographic location is exceptionally wide, so this study adopts a multi-stage sampling method to draw the sample. Multi-stage stratified random sampling saves costs and time, and enhances the typicality and reliability of the sample. According to the Liaoning Statistical Yearbook 2023, the 2022 GDP ranking can be determined that Dalian City ranked 1st, Panjin City ranked 5th, Jinzhou City ranked 6th, Fushun City ranked 9th, Tieling City ranked 13th, 14 cities ranked in the middle and back of the sample, the GDP of the cities and municipalities accounted for 44.04% of the province’s GDP, the representativeness of the city is high; and then according to the geographic location of the city can be seen, Fushun City is located in the east of Liaodong, Jinzhou City belongs to western Liaoning, Dalian City belongs to southern Liaoning, Tieling City belongs to northern Liaoning, and Panjin City belongs to central Liaodong. Then, according to the geographic location, Fushun City is located in Liaodong, Jinzhou City belongs to Liaosi, Dalian City belongs to Liaonan, Tieling City belongs to Liaonan, and Panjin City belongs to Liaonanzhong, which makes the geographic distribution of the sampled cities more comprehensive; in the ranking of the number of permanent resident population in 2022, Dalian City ranked the 2nd, Tieling City ranked the 4th, Jinzhou City ranked the 8th, Fushun City ranked the 11th, and Panjin City ranked the 13th, and the permanent resident population of the sampled cities accounted for 39.56% of the province, which is a strong representation. In 2022, the number of medical and health institutions in Dalian City ranked 3rd, Tieling City ranked 4th, Jinzhou City ranked 8th, Fushun City ranked 11th, and Panjin City ranked 13th, and the number of medical and health institutions in the sampled cities accounted for 34.12% of the province ( Table 1 Figure 1 Table 1 GDP, resident population, and number of healthcare institutions in 14 cities in Liaoning Province, 2022. Cities GDP (CNY million) Rankings Resident population (thousand) Rankings Number of Health Institutions Rankings Shenyang 769580.00 2 6087.00 2 5,103 1 Dalian 843090.00 1 7658.00 1 4,027 3 Anshan 186320.00 3 3306.00 3 2,140 7 Fushun 92770.00 9 1788.00 11 1,353 11 Benxi 93080.00 8 2269.00 9 827 14 Dandong 89070.00 11 1293.00 14 1827 9 Jinzhou 120170.00 6 2273.00 8 1938 8 Yingkou 143160.00 4 1993.00 10 2,301 6 Fuxin 57770.00 14 2703.00 7 1,239 12 Liaoyang 89180.00 10 1701.00 12 1,472 10 Panjin 139430.00 5 1402.00 13 1,155 13 Tieling 75420.00 13 3255.00 4 2,678 4 Chaoyang 99500.00 7 2861.00 5 4,068 2 Huludao 87060.00 12 2805.00 6 2,551 5 Proportion of sampled municipalities in the province (%) 44.04 39.56 34.12 Sample cities include Dalian, Fushun, Jinzhou, Panjin and Tielin. Figure 1 Map of provinces and cities studied. Map of China highlighting Liaoning province in red. An inset map shows detailed divisions within Liaoning, colored to represent different regions: Shenyang, Dalian, Fushun, Jinzhou, Panjin, and Tieling, each marked with specific colors. 2.2 Samples The research samples were patients in Liaoning Province diagnosed with gout disease for the first time from January 1, 2015 to December 31, 2022, and the diagnostic criterion was M10 of the tenth revised edition of the International Classification of Diseases (ICD-10), and a total of 99,055 cases of gout-related diseases were collected. The cleaning of outpatient hospitalization information entries included in the calculation mainly includes gender, which can only appear in codes 1 and 2; age, which cannot have negative values or unreasonable age numbers; disease name and ICD-10 must correspond to the ICD-10 code list one by one, and if the name of the disease appears to be garbled, it should be supplemented correctly according to the ICD-10, and only the name of the disease needs to be supplemented with the ICD-10; the time needs to be accurate only up to Year, month and day, do not need to be accurate to the specific day minutes and seconds, etc.; the type of institution, the type of insurance can only appear in the country issued outpatient hospitalization template labeled consistent; at the same time, for the emergence of health insurance, the integrated fund payment and personal account must have a numerical value, or else the type of health insurance for the out-of-pocket expenses. For the organization level needs to be strictly in accordance with the organization belongs to the provincial urban and county level units to determine. Finally, the total outpatient costs should be consistent with the sum of the outpatient cost details and also with the sum of the funds reimbursed by each type of insurance ( 63 66 67 64 2.3 Calculating the CCE process for gouty diseases SHA2011 accounts for Liaoning Province’s general health costs by estimating the total based on the sample. A basic database of patient visit costs for the sample institutions was established by collecting patient visit cost data from the sample institutions in the sample cities of Liaoning Province. The cost data of nonpublic health institutions were obtained from statistical yearbook of health, and the cost data of public health institutions were obtained from annual report of health finance, which together summed up to the total health cost data of Liaoning Province. The proportion of healthcare expenses of gout patients in the sample to the healthcare expenses of patients with all sample diseases was first calculated, and then multiplied with the total healthcare expenses of Liaoning Province to derive the CCE of gout patients within Liaoning Province. The gout CCE includes basic expenditure subsidy (BES) and curative income (CI). S gCCE = S gOBES + S gOCI + S gIBES + S gICI  S gCCE  S gOBES  S gOCI  S gIBES  S gICI Since gout inpatient CCE is calculated in the same way as outpatient, this study only demonstrates the gout outpatient CCE calculation process. S gOCCE = S gOBES + S gOCI  S gOCCE S gOCI = S gOTMI × ( 1 − α p α )  S gOTMI  α p  α The formula for calculating the gout outpatient CI for a particular dimension is as follows: S gOCI ′ = ∑ i = 1 n ( S gOCI × α i α − α p )  S gOCI ′  α i β S g OBES = S TOBES × ( 1 − β )  S TOBES β = α α + e × K K is the conversion relationship between a physician’s workload of one inpatient bed day and one outpatient visit by the National Center for Health Development Research (NCHDR) by investigating the relationship between the workload of a physician as one inpatient bed day and one outpatient visit, resulting in K = 0.1. e = b × ( 1 − c d ) The formula for calculating the OBES for gout in a particular dimension is as follows: S gOBES ′ = ∑ i = 1 n ( S gOBES × α i α − α p ) The follow-up of this study according to different types of healthcare organizations, different levels of healthcare organizations, and age groups were all calculated according to this formula. 2.4 Factors affecting the expenditure of gout disease Descriptive statistics were used in this study for different subgroups, and because the cost data were positively skewed, costs for gout disease were described by intermediate and interquartile range (IQR). We performed univariate analysis with Mann–Whitney U test as well as Kruskal-Wallis H test to determine the significance of within-group differences in gout costs, and two-by-two comparisons of three and more categorical variables that were significant to further determine the significance of within-group differences in three and more categorical variables. Categorical variables with significant results were first set as dummy variables and then included in multiple linear regression analyses to analyze variables that have a large influence on gout disease. Further, the direct and indirect effects of different variables on the cost of gout disease were analyzed by constructing structural equation models. All comparisons were analyzed using STATA 15.0, SPSS 25.0, AMOS 20.0 (SPSS) statistical software and statistical significance of all comparisons had a p 3 Results According to the findings in Table 2 Table 2 Gout CCE in Liaoning Province, 2015 to 2022 (CNY million). Year Gout health CCE Outpatient Inpatient Total Rheumatic Immunological Diseases Outpatient Inpatient Gouty diseases as a proportion of rheumatic diseases (%) 2015 25.32 13.37 11.95 811.07 330.34 480.72 3.12 2016 52.08 16.74 35.34 1279.53 632.67 646.87 4.07 2017 89.42 39.99 49.43 1072.85 325.87 746.98 8.33 2018 98.27 41.00 57.27 1296.61 695.97 763.74 7.58 2019 107.46 48.89 58.57 1365.35 550.53 814.82 7.87 2020 95.95 34.63 61.33 1025.91 527.22 498.69 9.35 2021 106.77 29.19 77.58 1403.46 476.19 927.27 7.61 2022 116.02 24.87 91.14 2099.81 1290.55 809.26 5.53 According to Figure 2 Figure 2 Distribution of CCE g g Bar chart displaying percentage distribution across age groups from 2015 to 2022. Each year is represented by a different colored bar. Peaks are visible in the 30-39, 40-49, 50-59, and 60-69 age groups. The sankey diagram of this study is classified into general hospitals, traditional Chinese hospitals, specialized hospitals, and primary health care institutions (communal medical service centers, village health centers) ( Figure 3 Figure 3 Distribution of average CCEg flows from the three financing modalities to different health care organizations, 2015–2022. Sankey diagram visualizing the flow of healthcare financing to institution types. On the left, financing schemes are categorized as voluntary, public, and out-of-pocket. Flow paths lead to institution types on the right: specialized, basic, general hospitals, and traditional Chinese medicine hospitals. Each flow's width represents funding magnitude. The CCE for gout disease in Liaoning province from 2015 to 2022 were CNY 25.32 millions for 2015, CNY 52.08 millions for 2016, CNY 89.42 millions for 2017, CNY 98.27 millions for 2018, CNY 107.46 millions for 2019, CNY 95.96 millions for 2020, CNY 2021 106.77 million, and CNY 116.01 million in 2022. Financing is divided into three types of financing: public financing, voluntary financing, and self-funding, and the share of government financing programs in public financing grows from 48.36% in 2015 to a peak of 50.38% in 2018, and then decreases and then rises again to 42.43% in 2019, and decreases to 21.67% in 2022. Social health insurance in public financing grows from 40.13% in 2015 to a peak of 44.98% in 2017 in the last 8 years, decreases in 2018 to 35.57% in 2019, and gradually decreases to 29.75% in 2020–2022. Out-of-pocket payments grow from 46.45% in 2015 to 2018 58.20%, after decreasing and then growing at 58.17% in 2020 and finally decreasing to 46.17% in 2022. Voluntary financing scheme is the lowest percentage of the three financing methods, with a minimum of 1.39% in 2018 and a maximum value of 11.80% in 2022( Table 3 Table 3 Gout financing cost distribution in Liaoning Province, 2015–2022 [millions (%)]. Year Public financing scheme Voluntary financing scheme Out-of-pocket payments Total Total Government financing scheme Social health insurance Total commercial insurance Social donation Enterprise financing plan 2015 11.85 (48.36) 2.01 (8.22) 9.83 (40.13) 1.24 (5.20) 0.79 (3.30) 0.04 (0.16) 0.42 (1.74) 12.23 (46.45) 25.32 (100.00) 2016 26.55 (47.14) 2.12 (3.76) 24.43 (43.37) 2.86 (4.92) 1.44 (2.48) 0.08 (0.13) 1.34 (2.31) 22.67 (47.94) 52.08 (100.00) 2017 48.56 (50.38) 5.20 (5.40) 43.35 (44.98) 6.36 (7.78) 4.33 (5.30) 0.03 (0.04) 1.99 (2.44) 34.51 (41.84) 89.42 (100.00) 2018 42.01 (40.42) 10.28 (9.89) 31.73 (30.53) 1.49 (1.39) 0.61 (0.56) 0.17 (0.16) 0.72 (0.67) 54.77 (58.20) 98.27 (100.00) 2019 45.61 (42.43) 7.37 (6.86) 38.24 (35.57) 4.97 (4.58) 4.27 (3.93) 0.05 (0.05) 0.64 (0.59) 56.88 (53.00) 107.46 (100.00) 2020 41.93 (40.36) 7.67 (7.39) 34.25 (32.97) 1.15 (1.47) 0.00 (0.00) 0.33 (0.42) 0.82 (1.05) 52.88 (58.17) 95.96 (100.00) 2021 43.80 (37.66) 9.05 (7.78) 34.75 (29.88) 9.11 (4.83) 7.28 (3.86) 0.16 (0.09) 1.67 (0.88) 53.86 (57.51) 106.77 (100.00) 2022 42.03 (36.23) 7.52 (6.48) 34.51 (29.75) 13.69 (11.80) 12.89 (11.11) 0.12 (0.10) 0.68 (0.59) 60.29 (51.97) 116.01 (100.00) Liaoning Province 2015–2022 gout disease cost composition in the choice of purchase drug in 2015–2019, 2021 are greater than 96% or so, 2022 accounted for the lowest, only about 80%. By gender, gout disease occurs mainly in males, with the least share being above 88%. Gout mainly occurs in the age of 30–69 years, with a share of more than 76%. The type of medical insurance is concentrated in urban workers’ medical insurance 60–70%, urban and rural residents’ medical insurance between 12 and 32%. The tiers of medical institutions consulted were mainly at the provincial level (65–89%) and 20% and below at the district level, and the types of medical institutions were mainly in general hospitals (70–80%), followed by traditional Chinese medicine hospitals (10–20%) ( Table 4 Table 4 Distribution of expenses for gout by different groups, 2015–2022 (million(%)). 2015 2016 2017 2018 2019 2020 2021 2022 Outpatient/inpatient Outpatient 13.37(52.80) 16.74(32.14) 39.99(44.72) 41.00(41.72) 48.89(45.50) 34.63(36.09) 29.19(27.34) 24.87(21.44) Inpatient 11.95(47.20) 35.34(67.86) 49.43(55.28) 57.27(58.28) 58.57(54.50) 61.33(63.92) 77.58(72.66) 91.14(78.56) Whether to purchase drug Yes 24.40(96.36) 49.37(94.81) 86.23(96.43) 94.80(96.47) 103.82(96.61) 85.64(89.26) 96.14(90.04) 92.87(80.05) No 0.92(3.64) 2.71(5.19) 3.19(3.57) 3.47(3.53) 3.64(3.39) 10.31(10.74) 10.63(9.96) 23.15(19.95) Whether to select treatment Yes 23.12(91.33) 42.29(81.20) 81.24(90.85) 68.62(69.83) 83.96(78.13) 68.20(71.08) 86.03(80.57) 82.40(71.03) No 2.20(8.67) 9.79(18.80) 8.18(9.15) 29.65(30.17) 23.50(21.87) 27.75(28.92) 20.74(19.43) 33.62(28.97) Sex Female 2.56(10.12) 3.77(7.23) 6.10(6.82) 4.85(4.94) 5.67(5.27) 6.70(6.98) 7.30(6.83) 13.64(11.76) Male 22.76(89.88) 48.31(92.77) 83.32(93.18) 93.42(95.06) 101.79(94.73) 89.25(93.02) 99.47(93.17) 102.38(88.24) Age 0–29 2.45(9.68) 5.74(11.03) 8.20(9.17) 10.64(10.83) 10.94(10.18) 13.55(14.12) 11.73(10.98) 10.74(9.26) 30–69 19.37(76.49) 40.30(77.37) 70.37(78.69) 80.26(81.67) 85.08(79.18) 75.54(78.73) 81.52(76.35) 91.08(78.51) ≥70 3.50(13.83) 6.04(11.60) 10.85(12.14) 7.37(7.50) 11.44(10.64) 6.86(7.15) 13.52(12.66) 14.20(12.24) Insurance status Urban employees’ basic medical insurance 16.68(65.86) 35.60(68.36) 53.45(59.77) 67.60(68.79) 68.00(63.28) 58.21(60.66) 69.66(65.24) 71.49(61.62) Basic medical insurance for urban and rural residents 4.63(18.30) 6.40(12.29) 28.69(32.08) 19.24(19.57) 23.53(21.90) 20.90(21.78) 22.77(21.32) 21.35(18.40) Self-funded 4.01(15.84) 10.08(19.35) 7.29(8.15) 11.44(11.64) 15.93(14.82) 16.85(17.56) 14.34(13.43) 23.18(19.98) Institution level Provincial level 22.29(88.04) 46.67(89.61) 62.71(70.14) 82.73(84.18) 70.88(65.96) 70.07(73.02) 57.72(54.06) 55.83(48.12) Municipal level 2.36(9.34) 3.88(7.45) 21.85(24.44) 8.96(9.12) 22.31(20.76) 18.62(19.41) 16.38(15.35) 24.00(20.69) District level 0.08(0.33) 0.14(0.27) 0.59(0.66) 0.22(0.22) 5.63(5.24) 1.00(1.04) 23.11(21.64) 14.75(12.71) Country level 0.58(2.29) 1.39(2.67) 4.27(4.77) 6.36(6.47) 8.63(8.03) 6.27(6.53) 9.56(8.95) 21.44(18.48) Institution type General hospital 19.99(78.96) 43.15(82.86) 64.22(71.83) 74.62(75.93) 76.83(71.49) 73.09(76.18) 76.35(71.51) 83.32(71.82) Traditional Chinese medicine hospital 5.28(20.84) 8.74(16.78) 24.78(27.72) 23.40(23.81) 29.94(27.86) 22.10(23.03) 28.89(27.05) 29.81(25.69) Specialized hospital 0.01(0.01) 0.15(0.29) 0.06(0.07) 0.00(0.00) 0.01(0.01) 0.02(0.02) 0.05(0.05) 0.16(0.14) Primary medical institutions 0.03(0.12) 0.01(0.01) 0.28(0.31) 0.14(0.14) 0.65(0.61) 0.54(0.56) 1.27(1.19) 2.64(2.27) Outpatient service organizations 0.02(0.07) 0.03(0.05) 0.04(0.04) 0.04(0.04) 0.03(0.03) 0.20(0.21) 0.21(0.19) 0.08(0.07) Total 25.32(100.00) 52.08(100.00) 89.40(100.00) 98.20(100.00) 107.46(100.00) 95.95(100.00) 106.76(100.00) 116.01(100.00) The sample of gout disease in Liaoning province from 2015 to 2022 contains 97,907 cases ( Table 5 p p Table 5 Differences in gout expenses according to the subgroups ( n Variables n (%) Expenditure median (IQR) Z/H P A two-by-two comparison P Outpatient/Inpatient −144.987 a <0.001 None None Outpatient 90,213(92.14) 116.60(30.11–329.12) Inpatient 7,694(7.86) 7113.03(4956.19–9223.37) Whether to purchase drug −144.715 a <0.001 Yes 55,489(56.68) 281.00(86.90–777.91) No 42,418(43.32) 46.00(11.70–173.40) Whether to select treatment −119.913 a <0.001 Yes 39,778(40.63) 334.69(98.64–966.98) No 58,129(59.37) 82.20(19.20–238.66) Sex −9.885 a <0.001 Female 37,639(38.44) 130.97(32.96–409.92) Male 60,268(61.56) 152.00(36.00–455.84) Age 62.272 b <0.001 0–29 19,219(19.63) 138.00(32.96–384.68) (0–29)-(30–69) <0.001 30–69 71,445(72.97) 139.84(32.96–436.31) (0–29)-(≥70) <0.001 ≥70 7,243(7.40) 138.10(33.96–447.05) (30–69)-(≥70) <0.001 Insurance status 3608.618 b <0.001 Urban employees’ basic medical insurance 30,893(31.55) 219.00(62.87–677.80) employees-residents <0.001 Basic medical insurance for urban and rural residents 10,877(11.11) 156.63(40.36–628.00) employees-self <0.001 Self-funded 56,137(57.34) 106.00(22.30–330.04) residents-self <0.001 Institution level 16880.032 b <0.001 provincial-municipal <0.001 Provincial level 44,092(45.03) 324.39(100.91–798.73) provincial-district <0.001 Municipal level 23,582(24.09) 112.00(33.96–267.38) provincial-country <0.001 District level 9,982(10.20) 40.00(9.60–167.88) municipal-district <0.001 Country level 20,251(20.68) 45.34(10.99–142.00) municipal-country <0.001 Institution type 9157.601 b <0.001 district-country <0.001 General hospital 70,238(71.74) 117.53(28.22–334.77) general-traditional <0.001 Traditional Chinese medicine hospital 21,106(21.56) 403.68(119.22–952.71) general-primary; general-outpatient <0.001 Specialized hospital 62(0.06) 136.15(44.29–401.25) traditional-specialize; traditional-primary <0.001 Primary medical institutions 4,980(5.09) 51.08(19.26–143.98) traditional-outpatient; specialize-primary <0.001 Outpatient service organizations 1,521(1.55) 32.00(25.00–60.00) specialize-outpatient; primary-outpatient <0.001 Year 2324.703 b <0.001 2015–2016;2015–2017;2015–2018 <0.001 2015 3,951(4.04) 160.60(45.34–505.55) 2015–2020;2015–2016;2015–2017 <0.001 2016 5,979(6.11) 158.75(44.60–415.02) 2015–2018;2015–2020;2015–2021 <0.001 2017 6,139(6.27) 209.00(71.00–559.48) 2015–2022;2016–2017;2016–2018 <0.001 2018 6,429(6.57) 247.52(61.67–714.98) 2016–2019;2016–2020;2016–2021 <0.001 2019 9,654(9.86) 180.38(35.30–522.30) 2016–2022;2017–2019;2017–2020 <0.001 2020 13,937(14.23) 226.43(53.70–527.37) 2017–2021;2017–2022;2018–2019 <0.001 2021 28,174(28.78) 95.43(27.54–325.35) 2018–2020;2018–2021;2018–2022 <0.001 2022 23,644(24.15) 98.88(22.03–353.71) 2019–2020;2019–2021;2019–2022;2020–2021 <0.001 a Represents application of Mann–Whitney U test (2 independent samples). b Denotes non-parametric Kruskal-Wallis H-test (k independent samples). IQR stands for percentile. Linear regression ( Table 6 Table 6 Multi-linear correlation analysis of cost influencing factors for gouty diseases. Variable Unstandardization coefficient Standardization coefficient T Sig B(95%CI) SE Beta Constant 2.501 0.018 135.911 Outpatient/inpatient Outpatient −1.327 0.007 −0.427 −184.065 <0.001 Inpatient Reference Whether to purchase drug Yes 0.567 0.004 0.332 150.138 <0.001 No Reference Whether to select treatment Yes 0.369 0.004 0.216 91.078 <0.001 No Reference Sex Female −0.014 0.005 −0.008 −2.663 0.008 Male Reference Age 0–29 −0.048 0.008 −0.022 −6.121 <0.001 30–69 −0.043 0.007 −0.023 −6.376 <0.001 ≥70 Reference Insurance status Urban employees’ basic medical insurance 0.039 0.004 0.022 9.596 <0.001 Basic medical insurance for urban and rural residents 0.088 0.006 0.033 13.992 <0.001 Self-funded Reference Institution level Provincial level 0.424 0.005 0.251 79.708 <0.001 Municipal level 0.213 0.005 0.108 38.928 <0.001 District level −0.022 0.007 −0.008 −3.135 0.002 Country level Reference Institution type General hospital 0.158 0.014 0.085 11.022 <0.001 Traditional Chinese medicine hospital 0.194 0.015 0.095 13.011 <0.001 Specialized hospital 0.242 0.069 0.007 3.504 <0.001 Primary medical institutions 0.098 0.016 0.026 6.228 <0.001 Outpatient service organizations Reference Year 2015 −0.185 0.011 −0.044 −17.296 <0.001 2016 −0.143 0.009 −0.041 −15.856 <0.001 2017 0.011 0.009 0.003 1.198 0.231 2018 0.081 0.009 0.024 9.408 <0.001 2019 0.037 0.008 0.013 4.833 <0.001 2020 0.152 0.006 0.063 25.822 <0.001 2021 −0.029 0.005 −0.015 −5.958 <0.001 2022 Reference R 2 p t In order to check the robustness of the linear regression model, this study replaced whether to select treatment with whether to have a checkup because the variable whether to have a checkup has been previously explored by this research team for its impact on the cost of the illnesses under study ( 68 Table 7 Table 7 Multi-linear correlation analysis of cost influencing factors for gouty diseases. Variable Unstandardization coefficient Standardization coefficient T Sig B(95%CI) SE Beta Constant 2.362 0.019 123.095 Outpatient/inpatient Outpatient −1.171 0.008 −0.377 −137.876 <0.001 Inpatient Reference Whether to purchase drug Yes 0.526 0.004 0.308 139.17 <0.001 No Reference Whether to have a checkup Yes 0.437 0.006 0.189 72.291 <0.001 No Reference Sex Female −0.038 0.005 −0.022 −7.335 <0.001 Male Reference Age 0–29 −0.007 0.008 −0.003 −0.891 0.373 30–69 −0.026 0.007 −0.014 −3.792 <0.001 ≥70 Reference Insurance status Urban employees’ basic medical insurance 0.028 0.004 0.016 6.868 <0.001 Basic medical insurance for urban and rural residents 0.062 0.006 0.023 9.763 <0.001 Self-funded Reference Institution level Provincial level 0.497 0.005 0.294 93.547 <0.001 Municipal level 0.229 0.006 0.116 41.237 <0.001 District level 0.018 0.007 0.006 2.601 0.009 Country level Reference Institution type General hospital 0.19 0.015 0.102 13.025 <0.001 Traditional Chinese medicine hospital 0.365 0.015 0.179 24.388 <0.001 Specialized hospital 0.346 0.07 0.01 4.945 <0.001 Primary medical institutions 0.159 0.016 0.041 9.965 <0.001 Outpatient service organizations Reference Year 2015 −0.181 0.011 −0.043 −16.686 <0.001 2016 −0.135 0.009 −0.039 −14.7 <0.001 2017 0.068 0.009 0.02 7.546 <0.001 2018 0.016 0.009 0.005 1.792 0.073 2019 0.007 0.008 0.002 0.875 0.382 2020 0.125 0.006 0.052 20.882 <0.001 2021 −0.022 0.005 −0.012 −4.553 <0.001 2022 Reference R 2 P The high linear correlation between the independent variables explains 59.1% of the gout costs in Liaoning Province after the robustness check and 60.3% of the gout costs before replacing the variables, which shows that the degree of explanation is still high after replacing the variables, which shows that the model is robust, so the results in Table 6 This study explored the direct and indirect influences of variables on gout disease costs (inpatient and outpatient costs) by constructing a SEM ( Figure 4 2 P P P P P P P P Figure 4 Structural equation modeling and path coefficients of gout disease costs in Liaoning province. Insurance status (in order of actual reimbursement rate): urban workers’ basic medical insurance [actual reimbursement rate = 75.60% ( 69 69 Path analysis diagram illustrating relationships among variables: Sex, Insurance Status, Institution Type, Drug, Outpatient/Inpatient, and Log Gout Expenditure. Arrows represent pathways with coefficients, indicating direct influences. Residuals (e1-e5) are shown with associated values. 4 Discussion To the best of our knowledge, this is the first study to analyze the use of and trends in all-age gout funding over an 8-year period from 2015 to 2022 based on the SHA2011 accounting framework. This study provides a comprehensive assessment of the economic burden of gout disease in Liaoning Province and finds that the social and personal economic burden of gout disease is heavy, and the economic burden varies widely across patient populations and healthcare organizations. Outpatient and inpatient costs were imbalanced. The number of gout prevalence in the 8 years studied showed an inverted V-shaped trend, increasing and then decreasing, peaking in 2021. CCE showed an N-shaped change, with 2020 being the low point in the last 5 years. CCE gradually decreased in 2015–2019 at ages 39 years and above, with the greatest value in 2020–2022 at ages 40–59 years. Gout CCE is associated with outpatient/Inpatient, sex, whether to purchase drug, insurance status, institution type, and these correlates contribute to gout cost reduction and policy adjustments. In our study, we found that the average annual hospitalization burden for gout was CNY 55.33 million, with the share of hospitalized gout increasing from 47.20 to 78.56%, and the average annual outpatient cost was CNY 31.09 million, with a decrease from 52.80 to 21.44%, which is in line with the tendency of the existing studies, where most of the costs were for inpatient hospitalization (71.15%) related to gout ( 23 26 p 20 25 70 72 73 The descriptive statistics of this study analyzed purchase drug expenditure amounted to CNY 24.40million (96.36%) and drug expenditure accounted for more than 80% of the gout cost, which is consistent with the Australian high drug expenditure studies ( 74 75 p 30 76 77 78 79 80 In this study general hospital had the highest cost, with the proportion of 70% and above in 2015–2021, followed by Chinese hospitals, with the proportion of 16–27%, and the univariate analysis of Chinese hospitals expenditure median (CNY 403.68) was greater than that of general hospitals expenditure median (CNY 117.53), and p post hoc Table 4 81 82 83 84 85 19 The standardized coefficients for urban employees’ basic medical insurance and basic medical insurance for urban and rural residents in the multifactor analysis insurance status were 0.022 and 0.033, and the SEM results showed a direct negative effect on the logarithmic transformation of gout costs, with a value of −0.043, suggesting that medical insurance for urban employees and urban and rural residents has higher gout costs relative to self-funded. The reason for this may be that having health insurance is likely to be a symbol of high socio-economic status ( 24 86 88 89 90 91 92 93 94 Sex descriptive analysis of male cost share was the largest at 95.06% in 2018, male share was the smallest both at 88.24% from 2015 to 2021, and female maximum cost share was 11.76%. The univariate results were higher and significant ( p 82 95 99 58 100 101 102 103 104 105 6 106 107 108 109 110 111 The research offers further endorsement of public health and primary care initiatives to tackle risk elements and better manage gout. The preventability and treatability of gout suggests that a reduction in the healthcare burden is achievable. New drugs such as febuxostat can be considered for inclusion in local health insurance catalogs in different regions of China to provide more and better choices for the treatment of gout, so that the quality of patient’s survival can be substantially improved, and medical practitioners can be given references for decision-making, so that healthcare resources can be allocated in a more optimal way ( 112 113 88 114 This study has the following limitations, firstly only direct medical costs were calculated in this study, with gout being a disabling primary disease related to loss of employment production ( 33 115 6 14 5 Conclusion Gout disease in Liaoning Province places a heavy financial burden on patients and the health insurance system. Current 2015–2022 gout outpatient and inpatient costs are not reasonably distributed, and the costs are mainly from inpatient costs. Costs are mainly concentrated in the age group of 30–69 years old, financing is mainly concentrated in OOP and public financing programs, and patients’ personal burden is heavy. CCE influencing factors are mainly outpatient/inpatient, institution type, drug, insurance status, sex, and it is recommended to increase the reimbursement rate of gout inpatient cost. The main factors affecting CCE are outpatient/inpatient, institution type, drug, insurance status, sex. It is recommended to increase the reimbursement rate for inpatient gout expenses, to strengthen patients’ adherence to primary care guidelines and purinol dosage, to strengthen the formation of a personalized education and care in the primary care setting led by GPs in collaboration with pharmacists, nurses, community health workers, community advocates to achieve a lowering effect of uric acid, to increase the tilting of the primary care gout policy, to increase the subsidies on gout prescription medicines, to strengthen the addition of gout medicines into the local health insurance directory. Insurance schemes to subsidize most of the costs of general practitioner and specialist consultations and medicines to reduce the financial burden of individual patient visits, and for men to reduce the burden of gout by reducing socialization, consumption of high-purine foods, alcohol consumption, and increased exercise. We thank all the participants and China National Health Development Research Center for help with SHA2011 analysis. We thank to the support of Health Economics Association of Liaoning Province in providing data. We are grateful for the support of Health Commission of Liaoning Province in providing data. Data availability statement The original contributions presented in the study are included in the article/supplementary material; further inquiries can be directed to the corresponding authors. Ethics statement Patients’ personal information is digitally coded, and the numbers inside are desensitized, so there is no personal privacy involved. Author contributions XS: Writing – original draft, Formal analysis, Methodology, Data curation, Writing – review & editing, Conceptualization. FZ: Methodology, Writing – review & editing, Conceptualization, Investigation, Data curation. QW: Writing – original draft, Investigation, Conceptualization, Data curation. PC: Data curation, Investigation, Writing – original draft, Software. GW: Conceptualization, Investigation, Writing – review & editing, Software, Data curation. ZP: Project administration, Writing – original draft, Formal analysis, Methodology, Data curation. YM: Methodology, Writing – review & editing, Funding acquisition, Writing – original draft, Formal analysis, Data curation. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The authors declare that no Gen AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1. Hong Y Chen X Li Z Zhang X Zhou C Wang Y A lifetime economic research of universal HLA-B*58:01 genotyping or febuxostat initiation therapy in Chinese gout patients with mild to moderate chronic kidney disease Pharmacogenet Genomics 2023 33 24 34 10.1097/FPC.0000000000000488 36729770 2. Zhang J Jin C Ma B Sun H Chen Y Zhong Y Global, regional and national burdens of gout in the young population from 1990 to 2019: a population-based study RMD Open 2023 9 e003025 10.1136/rmdopen-2023-003025 37094981 PMC10152042 3. Yang Y Liu Z The changing burden of gout in adults aged 70 and above based on the global burden of disease 2019 Front Public Health 2025 13 1455726 10.3389/fpubh.2025.1455726 39980931 PMC11840442 4. Vizhub 2021 https://vizhub.healthdata.org/gbd-results/ 5. Li ZH Wu Q Guo S Hu W Association between triglyceride glycemic index and gout in US adults J Health Popul Nutr 2024 43 10.1186/s41043-024-00613-4 39113110 PMC11308556 6. Dehlin M Jacobsson L Roddy E Global epidemiology of gout: prevalence, incidence, treatment patterns and risk factors Nat Rev Rheumatol 2020 16 380 90 10.1038/s41584-020-0441-1 32541923 7. Xu C Yokose M Rai C Pillinger SK Choi MH Contemporary prevalence of gout and hyperuricemia in the United States and decadal trends: the national health and nutrition examination survey, 2007-2016 Arthritis Rheumatol 2019 71 991 9 10.1002/art.40807 30618180 PMC6536335 8. Kuo CF Grainge MJ Mallen C Zhang W Doherty M Rising burden of gout in the UK but continuing suboptimal management: a nationwide population study Ann Rheum Dis 2015 74 661 7 10.1136/annrheumdis-2013-204463 24431399 PMC4392307 9. Anagnostopoulos I Zinzaras E Alexiou I Papathanasiou AA Davas E Koutroumpas A The prevalence of rheumatic diseases in Central Greece: a population survey BMC Musculoskelet Disord 2010 11 98 10.1186/1471-2474-11-98 20504294 PMC2890601 10. Kiadaliri AA Uhlig T Englund M Burden of gout in the Nordic region, 1990-2015: findings from the global burden of disease study 2015 Scand J Rheumatol 2018 47 410 7 10.1080/03009742.2017.1405461 29376465 11. Singh AJ Racial and gender disparities among patients with gout Curr Rheumatol Rep 2013 15 307 10.1007/s11926-012-0307-x 23315156 PMC3545402 12. Collaborators GBDG Global, regional, and national burden of gout, 1990-2020, and projections to 2050: a systematic analysis of the global burden of disease study 2021 Lancet Rheumatol 2024 6 e507 17 10.1016/S2665-9913(24)00117-6 38996590 PMC11263476 13. Li CZ Xu B Wu G Yuan Q Xue X Global, regional, and national burden of gout in elderly 1990-2021: an analysis for the global burden of disease study 2021 BMC Public Health 2024 24 3298 10.1186/s12889-024-20799-w 39604924 PMC11600630 14. Perez-Ruiz F Desideri G Improving adherence to gout therapy: an expert review Ther Clin Risk Manag 2018 14 793 802 10.2147/tcrm.S162956 29765222 PMC5939914 15. Mhanna M Jabri A Omar YA Al-Abdouh A Beran A Ramahi A The burden of cardiac arrhythmias in gout: a National Representative Database Study Curr Probl Cardiol 2023 48 101437 10.1016/j.cpcardiol.2022.101437 36183979 16. Mody MG Rheumatology in Africa-challenges and opportunities Arthritis Res Ther 2017 19 49 10.1186/s13075-017-1259-3 28270202 PMC5341350 17. Amiri F Kolahi AA Nejadghaderi SA Noori M Khabbazi A Sullman MJM The burden of gout and its attributable risk factors in the Middle East and North Africa region, 1990 to 2019 J Rheumatol 2023 50 107 16 10.3899/jrheum.220425 36455948 18. Brook RA Kleinman NL Patel PA Melkonian AK Brizee TJ Smeeding JE The economic burden of gout on an employed population Curr Med Res Opin 2006 22 1381 9 10.1185/030079906X112606 16834837 19. Wertheimer A Morlock R Becker MA A revised estimate of the burden of illness of gout Curr Ther Res Clin Exp 2013 75 1 4 10.1016/j.curtheres.2013.04.003 24465034 PMC3898191 20. Jackson R Shiozawa A Buysman EK Altan A Korrer S Choi H Flare frequency, healthcare resource utilisation and costs among patients with gout in a managed care setting: a retrospective medical claims-based analysis BMJ Open 2015 5 e007214 10.1136/bmjopen-2014-007214 26109113 PMC4480013 21. Klein RW Kabadi S Cinfio FN Bly CA Taylor DC Szymanski KA Budget impact of adding lesinurad for second-line treatment of gout: a US health plan perspective J Comp Eff Res 2018 7 807 16 10.2217/cer-2017-0103 29792516 22. Annemans L Spaepen E Gaskin M Bonnemaire M Malier V Gilbert T Gout in the UK and Germany: prevalence, comorbidities and management in general practice 2000-2005 Ann Rheum Dis 2008 67 960 6 10.1136/ard.2007.076232 17981913 PMC2564789 23. Wu EQ Forsythe A Guérin A Yu AP Latremouille-Viau D Tsaneva M Comorbidity burden, healthcare resource utilization, and costs in chronic gout patients refractory to conventional urate-lowering therapy Am J Ther 2012 19 e157 66 10.1097/MJT.0b013e31820543c5 21317625 24. Wong PKK Ng BCK Mitchell J Han J Lam C Spencer D The disproportionately large contribution of the Maori and Pacific islander community to the healthcare burden of gout in Western Sydney Intern Med J 2023 53 1450 7 10.1111/imj.15831 35670212 25. Hanly JG Skedgel C Sketris I Cooke C Linehan T Thompson K Gout in the elderly--a population health study J Rheumatol 2009 36 822 30 10.3899/jrheum.080768 19286852 26. Wu EQ Patel PA Yu AP Mody RR Cahill KE Tang J Disease-related and all-cause health care costs of elderly patients with gout J Manag Care Pharm 2008 14 164 75 10.18553/jmcp.2008.14.2.164 18331118 PMC10437756 27. Fischer A Cloutier M Goodfield J Borrelli R Marvin D Dziarmaga A The direct economic burden of gout in an elderly Canadian population J Rheumatol 2017 44 95 101 10.3899/jrheum.160300 27803136 28. Nathan N Nguyen AD Stocker S Laba TL Baysari MT Day RO Out-of-pocket spending among a cohort of Australians living with gout Int J Rheum Dis 2021 24 327 34 10.1111/1756-185X.13979 32975889 29. Sicras-Mainar A Navarro-Artieda R Ibanez-Nolla J Resource use and economic impact of patients with gout: a multicenter, population-wide study Reumatol Clin 2013 9 94 100 10.1016/j.reuma.2012.06.014 23313534 30. Park H Rascati KL Prasla K McBayne T Evaluation of health care costs and utilization patterns for patients with gout Clin Ther 2012 34 640 52 10.1016/j.clinthera.2012.01.020 22381710 31. Lee YY Kuo LN Chen JH Lin YC Chen LF Ko Y Prescribing patterns and healthcare costs of gout Curr Med Res Opin 2019 35 1051 8 10.1080/03007995.2018.1552577 30474438 32. Chi MJ Lee CY Wu SC The prevalence of chronic conditions and medical expenditures of the elderly by chronic condition indicator (CCI) Arch Gerontol Geriatr 2011 52 284 9 10.1016/j.archger.2010.04.017 20452688 33. Spaetgens B Wijnands JM van Durme C van der Linden S Boonen A Cost of illness and determinants of costs among patients with gout J Rheumatol 2015 42 335 44 10.3899/jrheum.140679 25399391 34. Liu R Han C Wu D Xia X Gu J Guan H Prevalence of hyperuricemia and gout in mainland China from 2000 to 2014: a systematic review and Meta-analysis Biomed Res Int 2015 2015 762820 10.1155/2015/762820 26640795 PMC4657091 35. Grassi D Ferri L Desideri G Di Giosia P Cheli P Del Pinto R Chronic hyperuricemia, uric acid deposit and cardiovascular risk Curr Pharm Des 2013 19 2432 8 10.2174/1381612811319130011 23173592 PMC3606968 36. Luo H Fang W Zuo X Analysis of clinical characteristics and current status of diagnosis and treatment of gout patients in China Chin J Intern Med 2018 57 27 31 10.3760/cma.j.issn.0578-1426.2018.01.005 29325307 37. Li Y Analysis of factors associated with insulin resistance in primary gouty arthritis (dissertation/master's thesis) Guangzhou Guangzhou Medical University 2021 38. Nan H Qiao Q Dong Y Gao W Tang B Qian R The prevalence of hyperuricemia in a population of the coastal city of Qingdao, China J Rheumatol 2006 33 1346 50 10.1016/j.jbspin.2005.12.011 16821269 39. Miao Z Li C Chen Y Zhao S Wang Y Wang Z Dietary and lifestyle changes associated with high prevalence of hyperuricemia and gout in the Shandong coastal cities of eastern China J Rheumatol 2008 35 1859 64 18634142 40. Li R Sun J Ren LM Wang HY Liu WH Zhang XW Epidemiology of eight common rheumatic diseases in China: a large-scale cross-sectional survey in Beijing Rheumatology (Oxford) 2012 51 721 9 10.1093/rheumatology/ker370 22179737 41. Huang J Zhou B Chen S A study on the current status of gout and hyperuricemia in a community-based population in Ningbo Zhejiang Preventive Med 2013 25 8 10 10.19485/j.cnki.issn1007-0931.2013.07.003 42. Zou J Yang J Dong J Epidemiologic survey of hyperuricemia and gout in Beichuan Qiang population Contemp Med 2011 17 12 4 10.3969/j.issn.1009-4393.2011.31.006 43. Cui S Wei H Tian Z Survey on the prevalence of hyperuricemia and gout among workers in Weixian County, Zhangjiakou region Clinical Meta Anal 2014 29 1028 9 10.3969/i.issn.1004-583X.2014.09.020 44. Shao J Mo B Yu R Epidemiologic survey of hyperuricemia and gout in a community population in Nanjing Chin J Dis Prev 2003 7 305 8 45. Yan S Zhao S Li C Five-year follow-up study of hyperuricemia and gout in coastal residents of Shandong Province Chin J Endocrinol Metab 2011 27 548 52 10.3760/cma.j.issn.1000-6699.2011.07.002 46. Li M Study on the epidemiology and influencing factors of hyperuricemia and gout J Math Med 2019 32 1649 50 10.3969/i.issn.1004-4337.2019.11.033 47. Tan L Zhu J Yan M Epidemiologic survey of gout and hyperuricemia in Huiyang district, Huizhou city from 2008 to 2014 Modern Diagn Treat 2016 27 1919 20 10.3760/j.issn:1000-6699.2006.05.005 48. Jin S Zhang X Zheng H Epidemiologic investigation of hyperuricemia and gout in the Brown ethnic population in the Brown Mountain region of Yunnan J Pract Med 2018 34 3796 800 10.3969/j.issn.1006-5725.2018.22.031 49. Xu W Zhang Y Qian K Efficacy and economic evaluation of 127 gout patients treated with standardized therapy for one year PharmacoEconomics 2019 14 14 20 10.12010/j.issn.1673-5846.2019.01.003 50. Jin Wu YX Gaofeng X Analysis of the use of commonly used hyperuricemia and antigout drugs in a hospital from 2019 to 2021 China Prescript Drugs 2023 21 85 8 51. Liu Y A study on the impact of the new policy of health insurance payment-payment by case fraction on the hospitalization cost of public hospital a in Guangzhou (dissertation/master's thesis) Guangzhou South China University of Technology 2022 52. Halpern R Fuldeore MJ Mody RR Patel PA Mikuls TR The effect of serum urate on gout flares and their associated costs: an administrative claims analysis J Clin Rheumatol 2009 15 3 7 10.1097/RHU.0b013e3181945d2c 19125135 53. Lynch W Chan W Kleinman N Andrews LM Yadao AM Economic burden of gouty arthritis attacks for employees with frequent and infrequent attacks Popul Health Manag 2013 16 138 45 10.1089/pop.2012.0057 23113634 54. Liu W Ye L Hua B Yang Y Dong Z Jiang Y Association between combined exposure to ambient air pollutants, genetic risk, and incident gout risk: a prospective cohort study in the UK biobank Semin Arthritis Rheum 2024 66 152445 10.1016/j.semarthrit.2024.152445 38579592 55. Hennequin M El Osta N Munoz-Sanchez ML Vandenberghe Descamps M Andreeva VA Feron G Age related impairments in ingestion from a large population based-sample Appetite 2024 196 107287 10.1016/j.appet.2024.107287 38452933 56. Ou G Wu J Wang S Jiang Y Chen Y Kong J Dietary factors and risk of gout: a two-sample Mendelian randomization study Foods 2024 13 13 10.3390/foods13081269 38672942 PMC11049247 57. Cho C Kim B Kim DS Hwang MY Shim I Song M Large-scale cross-ancestry genome-wide meta-analysis of serum urate Nat Commun 2024 15 3441 10.1038/s41467-024-47805-4 38658550 PMC11043400 58. Chang Y Park JY Song TJ Association between the triglyceride/high-density lipoprotein (TG/HDL) ratio and incidence of gout: a nationwide cohort study Front Endocrinol 2024 15 1453458 10.3389/fendo.2024.1453458 39866735 PMC11757121 59. Punjwani S Jani C Liu W Kakoullis L Salciccioli I Al Omari O Burden of gout among different WHO regions, 1990-2019: estimates from the global burden of disease study Sci Rep 2024 14 15953 10.1038/s41598-024-61616-z 38987583 PMC11236997 60. Zhai T Zhang Y Wan Q A methodological study on China's health cost accounting based on the “health cost accounting system 2011” China Health Econ 2015 34 9 11 10.7664/CHE20150303 61. Zhai T Zhang Y Wan Q A new system of health cost accounting: an introduction to SHA2011 China Health Econ 2013 32 13 5 10.7664/CHE20130103 62. Si X Huang L Ding Q Zhang W Zhao R Ai C Comparison of clinical and economic evaluation between selected generic and original febuxostat tablets in Chinese gout patients with hyperuricemia: a real-world multicenter retrospective study Medicine (Baltimore) 2024 103 e37081 10.1097/MD.0000000000037081 38277524 PMC10817005 63. Zheng A Zhu Y Wang Y Liu F Jin F Zang S Assessment of medical expenditure for patients with breast Cancer in China: evidence from current curative expenditure by system of health accounts 2011 Value Health 2022 25 77 83 10.1016/j.jval.2021.06.015 35031102 64. Fang Q Shang D Zhang Y Geng X Liu F Zhang Q Will the zero-margin drug policy reduce the economic burden of stroke patients in China? J Glob Health 2021 11 08007 10.7189/jogh.11.08007 34671464 PMC8501452 65. Zhu Y Liu C Zhang L Fang Q Zang S Wang X How to control the economic burden of treating cardio-cerebrovascular diseases in China? Assessment based on system of health accounts 2011 J Glob Health 2020 10 010802 10.7189/jogh.10.010802 32373337 PMC7182356 66. Shi X Analysis of the current situation of the total cost of traditional Chinese medicine in Liaoning Province for 2019–2021 based on SHA2011 (dissertation/master's thesis) Shenyang Liaoning University of Traditional Chinese Medicine 2024 67. Ma Z Deng G Meng Z Wu H Hospitalization expenditures and out-of-pocket expenses in patients with stroke in Northeast China, 2015-2017: a pooled Cross-sectional study Front Pharmacol 2020 11 596183 10.3389/fphar.2020.596183 33613278 PMC7892892 68. Shi X Zhao Y Wan Q Chai P Ma Y Curative care expenditure of outpatient anxiety disorder in Liaoning Province, 2015-2020-based on \"system of health accounts 2011\" Front Public Health 2024 12 1329596 10.3389/fpubh.2024.1329596 39022419 PMC11251961 69. NHSA 2020 http://www.nhsa.gov.cn/art/2020/6/24/art_7_3268.html 70. Yelin E Wanke LA An assessment of the annual and long-term direct costs of rheumatoid arthritis: the impact of poor function and functional decline Arthritis Rheum 1999 42 1209 18 10.1002/1529-0131(199906)42:6&#x0003c;1209::Aid-anr18&#x0003e;3.0.Co;2-m 10366114 71. van Jaarsveld CH Jacobs JW Schrijvers AJ Heurkens AH Haanen HC Bijlsma JW Direct cost of rheumatoid arthritis during the first six years: a cost-of-illness study Br J Rheumatol 1998 37 837 47 10.1093/rheumatology/37.8.837 9734674 72. Ward MM Functional disability predicts total costs in patients with ankylosing spondylitis Arthritis Rheum 2002 46 223 31 10.1002/1529-0131(200201)46:1&#x0003c;223::Aid-art498&#x0003e;3.0.Co;2-# 11817595 73. Singh JA Bharat A Khanna D Aquino-Beaton C Persselin JE Duffy E Health care utilization in patients with gout: a prospective multicenter cohort study BMC Musculoskelet Disord 2017 18 233 10.1186/s12891-017-1573-6 28569193 PMC5452408 74. Yusuf F Leeder SR Can't escape it: the out-of-pocket cost of health care in Australia Med J Aust 2013 199 475 8 10.5694/mja12.11638 24099208 75. Essue BM Beaton A Hull C Belfrage J Thompson S Meachen M Living with economic hardship at the end of life BMJ Support Palliat Care 2015 5 129 37 10.1136/bmjspcare-2013-000460 24644185 76. Feenstra J Heerdink ER Grobbee DE Stricker BH Association of nonsteroidal anti-inflammatory drugs with first occurrence of heart failure and with relapsing heart failure: the Rotterdam study Arch Intern Med 2002 162 265 70 10.1001/archinte.162.3.265 11822918 77. Hoskison KT Wortmann RL Management of gout in older adults: barriers to optimal control Drugs Aging 2007 24 21 36 10.2165/00002512-200724010-00002 17233545 78. Robinson PC Gout - An update of aetiology, genetics, co-morbidities and management Maturitas 2018 118 67 73 10.1016/j.maturitas.2018.10.012 30415758 79. Singh JA Facilitators and barriers to adherence to urate-lowering therapy in African-Americans with gout: a qualitative study Arthritis Res Ther 2014 16 R82 10.1186/ar4524 24678765 PMC4060486 80. Jeon YH Essue B Jan S Wells R Whitworth JA Economic hardship associated with managing chronic illness: a qualitative inquiry BMC Health Serv Res 2009 9 182 10.1186/1472-6963-9-182 19818128 PMC2766369 81. Wall GC Koenigsfeld CF Hegge KA Bottenberg MM Adherence to treatment guidelines in two primary care populations with gout Rheumatol Int 2010 30 749 53 10.1007/s00296-009-1056-7 19590874 82. Smith E Hoy D Cross M Merriman TR Vos T Buchbinder R The global burden of gout: estimates from the global burden of disease 2010 study Ann Rheum Dis 2014 73 1470 6 10.1136/annrheumdis-2013-204647 24590182 83. Wilson A Childs S The relationship between consultation length, process and outcomes in general practice: a systematic review Br J Gen Pract 2002 52 1012 20 10.1111/j.1600-0463.2007.00831.x 12528590 PMC1314474 84. Janssens HJ van de Lisdonk EH Bor H van den Hoogen HJ Janssen M Gout, just a nasty event or a cardiovascular signal? A study from primary care Fam Pract 2003 20 413 6 10.1093/fampra/cmg413 12876112 85. Chung Y Lu CY Graham GG Mant A Day RO Utilization of allopurinol in the Australian community Intern Med J 2008 38 388 95 10.1111/j.1445-5994.2008.01641.x 18422564 86. Yu Q Study on the current status and influencing factors of self-management of hypertensive patients in Urumqi (dissertation/master's thesis) Urumqi Xinjiang Medical University 2012 87. Sun S A study on the current status and influencing factors of self-management of diabetes mellitus patients (dissertation/master's thesis) Beijing Peking Union Medical College 2010 88. Zhang F Research on the status quo and influencing factors of self-management of gout patients (dissertation/master's thesis) Qingdao Qingdao University 2017 89. WHO 2017 https://www.who.int/healthinfo/universal_health_coverage/report/2017/en/ 90. Health AIo, and Welfare Australia's health 2012 Canberra AIHW 2012 91. Underwood M Diagnosis and management of gout BMJ 2006 332 1315 9 10.1136/bmj.332.7553.1315 16740561 PMC1473078 92. Liao L. Family risk asset allocation and business insurance decisions (dissertation/master's thesis) Guangdong Province Guangdong University of Finance and Economics 2024 93. Yang J. 2024 A study of the impact of residents' family status on their decision to enroll in commercial supplemental health insurance policies (dissertation/master's thesis) Hebei Province North China University of Science and Technology 94. Guo B Chen G Zhang R Impact of physical activity on out-of-pocket medical expenses of urban middle-aged and elderly people in the context of aging: an empirical analysis based on data from the Chinese household tracking survey J Beijing Sport Univ 2025 48 35 52 10.19582/j.cnki.11-3785/g8.2025.03.003 95. Kang DH Lee YJ Ha IH Song HS Lee YS Trends in healthcare utilization by patients with gout: a cross-sectional study using Health Insurance Review and Assessment Service data Medicine 2024 103 e36436 10.1097/MD.0000000000036436 38363901 PMC10869061 96. Safiri S Kolahi AA Cross M Carson-Chahhoud K Hoy D Almasi-Hashiani A Prevalence, incidence, and years lived with disability due to gout and its attributable risk factors for 195 countries and territories 1990-2017: a systematic analysis of the global burden of disease study 2017 Arthritis Rheumatol 2020 72 1916 27 10.1002/art.41404 32755051 97. Xia Y Wu Q Wang H Zhang S Jiang Y Gong T Global, regional and national burden of gout, 1990-2017: a systematic analysis of the global burden of disease study Rheumatology 2020 59 1529 38 10.1093/rheumatology/kez476 31624843 98. Kramer HM Curhan G The association between gout and nephrolithiasis: the National Health and nutrition examination survey III, 1988-1994 Am J Kidney Dis 2002 40 37 42 10.1053/ajkd.2002.33911 12087559 99. Hak AE Curhan GC Grodstein F Choi HK Menopause, postmenopausal hormone use and risk of incident gout Ann Rheum Dis 2010 69 1305 9 10.1136/ard.2009.109884 19592386 PMC3142742 100. Saseen JJ Agashivala N Allen RR Ghushchyan V Yadao AM Nair KV Comparison of patient characteristics and gout-related health-care resource utilization and costs in patients with frequent versus infrequent gouty arthritis attacks Rheumatology 2012 51 2004 12 10.1093/rheumatology/kes183 22829689 101. Guillen AG Te Karu L Singh JA Dalbeth N Gender and ethnic inequities in gout burden and management Rheum Dis Clin N Am 2020 46 693 703 10.1016/j.rdc.2020.07.008 32981646 102. Ting K Gill TK Keen H Tucker GR Hill CL Prevalence and associations of gout and hyperuricaemia: results from an Australian population-based study Intern Med J 2016 46 566 73 10.1111/imj.13006 26765205 103. Doherty M New insights into the epidemiology of gout Rheumatology (Oxford) 2009 48 ii2 8 10.1093/rheumatology/kep086 19447779 104. Jandial C Tandon VR Sharma S Mahajan A Gout and menopause Jammu, J&K Journal of Medical Education and Research 2007 105. Bruderer SG Bodmer M Jick SS Meier CR Association of hormone therapy and incident gout: population-based case-control study Menopause 2015 22 1335 42 10.1097/gme.0000000000000474 25968834 106. Harrold LR Etzel CJ Gibofsky A Kremer JM Pillinger MH Saag KG Sex differences in gout characteristics: tailoring care for women and men BMC Musculoskelet Disord 2017 18 108 10.1186/s12891-017-1465-9 28292303 PMC5351188 107. Antón FM Puig JG Ramos T González P Ordás J Sex differences in uric acid metabolism in adults: evidence for a lack of influence of estradiol-17 beta (E2) on the renal handling of urate Metab Clinic Exp 1986 35 343 8 10.1016/0026-0495(86)90152-6 3959904 108. Puig JG Mateos FA Miranda ME Torres RJ de Miguel E Pérez de Ayala C Purine metabolism in women with primary gout Am J Med 1994 97 332 8 10.1016/0002-9343(94)90299-2 7942934 109. Song P Wang H Xia W Chang X Wang M An L Prevalence and correlates of hyperuricemia in the middle-aged and older adults in China Sci Rep 2018 8 4314 10.1038/s41598-018-22570-9 29531237 PMC5847518 110. Choi HK Curhan G Beer, liquor, and wine consumption and serum uric acid level: the third National Health and nutrition examination survey Arthritis Rheum 2004 51 1023 9 10.1002/art.20821 15593346 111. Choi HK Atkinson K Karlson EW Willett W Curhan G Alcohol intake and risk of incident gout in men: a prospective study Lancet 2004 363 1277 81 10.1016/s0140-6736(04)16000-5 15094272 112. Zhao J Chen Y A review of pharmacoeconomic evaluation studies for the treatment of gout Modern Bus Indus 2018 39 100 4 10.19311/j.cnki.1672-3198.2018.03.050 113. Liu Q Evaluation of the management of gout patients in the community and the effect of health education intervention Contemp Med 2010 16 155 6 10.3969/j.issn.1009-4393.2010.03.124 114. Wu W Zhang J Jiang C Analysis of the composition of rheumatology outpatient diseases and diagnosis and treatment status in the old urban area of Guangzhou Mod Hosp 2015 15 103 5 10.3969/j.issn.1671-332X.2015.08.044 115. Liu S Wu S Bao X Ji J Ye Y Guo J Changes in blood pressure is associated with bone loss in US adults: a Cross-sectional study from NHANES 2005-2018 Calcif Tissue Int 2024 114 276 85 10.1007/s00223-023-01176-y 38261009 ",
  "metadata": {
    "Title of this paper": "Changes in blood pressure is associated with bone loss in US adults: a Cross-sectional study from NHANES 2005-2018",
    "Journal it was published in:": "Frontiers in Public Health",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488642/"
  }
}