{
  "title": "Paper_844",
  "abstract": "pmc Int J Nanomedicine Int J Nanomedicine 616 intjnano ijn International Journal of Nanomedicine 1176-9114 1178-2013 Dove Press PMC12476184 PMC12476184.1 12476184 12476184 41019236 10.2147/IJN.S543433 543433 1 Review Hepatotoxicity of Nanoparticle-Based Anti-Cancer Drugs: Insights into Toxicity and Mitigation Strategies Skorzynski et al Skorzynski et al http://orcid.org/0000-0001-6665-9041 Skorzynski Marcin  1 http://orcid.org/0000-0003-0421-5167 Krol Magdalena  2 http://orcid.org/0000-0002-2525-1290 Braniewska Agata  1 1 Department of Immunology, Mossakowski Medical Research Institute, Polish Academy of Sciences Warsaw Poland 2 Department of Cancer Biology, Institute of Biology, Warsaw University of Life Sciences Warsaw Poland Correspondence: Marcin Skorzynski, Department of Immunology, Mossakowski Medical Research Institute, Polish Academy of Sciences Pawinskiego 5 Str Warsaw 02-106 Poland 23 9 2025 2025 20 478586 11697 11715 28 5 2025 03 9 2025 23 09 2025 28 09 2025 29 09 2025 © 2025 Skorzynski et al. 2025 Skorzynski et al. https://creativecommons.org/licenses/by-nc/4.0/ This work is published and licensed by Dove Medical Press Limited. The full terms of this license are available at https://www.dovepress.com/terms.php http://creativecommons.org/licenses/by-nc/4.0/ https://www.dovepress.com/terms.php Abstract Despite significant progress in developing novel, efficient nanoparticle-based anticancer drugs, hepatotoxicity remains a major challenge. The liver, as the primary organ responsible for detoxification, is particularly susceptible to nanoparticle accumulation, particularly through the action of Browicz-Kupffer cells (B-KCs) and liver sinusoidal endothelial cells (LSECs). These phagocytic cells accumulate nanoparticles, leading to the production of reactive oxygen species (ROS), interleukin 1 beta (IL-1β) and tumor necrosis factor-alpha (TNF-α), which ultimately cause hepatocyte damage. In recent years, various nanoparticle modification strategies have been investigated to reduce hepatotoxicity. One of the most common and effective approaches is the PEGylation of liposomes and graphene nanoparticles, which decreases their uptake by the liver via the reticuloendothelial system (RES). Other strategies to mitigate hepatotoxicity are also being explored, including the incorporation of negatively charged lipids into liposomes, charge manipulation of inorganic-organic nanoparticles, the use of specific protein-based nanoparticles that selectively bind to cancer cells (thereby reducing hepatic uptake), the use of appropriate viral capsids in the production of virus-like protein-based drugs, and the manipulation of the size of protein, metal and graphene nanoparticles. Moreover, modifications aimed at pH-responsive drug release are employed in liposomes, self-assembled and graphene nanoparticles. This article discusses several types of nanoparticles used as carriers in currently approved therapies and explores potential strategies to minimize their hepatotoxicity. Keywords hepatotoxicity nanoparticles cancer treatment Browicz-Kupffer cells endothelial cells Warsaw University of Life Sciences-SGGW National Science Centre 10.13039/501100004281 We acknowledge the support of Warsaw University of Life Sciences-SGGW which funded the article processing charge through institutional affiliation of one of the contributing authors. We acknowledge the support of the National Science Centre, grant number 2020/39/B/NZ7/01382 through the contributing authors. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Significant progress has been made in cancer treatment in recent years. Due to its systemic approach, chemotherapy remains a cornerstone of oncology, as it can target cancer cells throughout the body, including those that have metastasized. However, its effectiveness is limited to only a subset of patients. Chemotherapy has been shown to be effective against various cancers, including leukemia, lymphoma, breast cancer, lung cancer, colorectal cancer, and ovarian cancer. Ongoing chemotherapy research aims to improve efficacy while minimizing adverse effects. These effects can range from mild symptoms, such as nausea and hair loss, to severe complications, including cardiac dysfunction and cognitive impairment. Certain chemotherapy drugs are notably associated with organ-specific toxicities. For instance, doxorubicin has been linked to the development of cardiomyopathy, and bleomycin has been associated with pulmonary fibrosis. Furthermore, many chemotherapy drugs can induce liver damage, including anti-tumor antibiotics (eg, mitomycin and dactinomycin) and platinum-based agents (eg, oxaliplatin and cisplatin). One promising strategy for mitigating these adverse effects is the precise delivery of chemotherapeutic agents via nanoparticles. 1–3 Nanotechnology has emerged as a pivotal element in advancing drug delivery systems. Nanoparticles, such as liposomes and polymeric nanoparticles, are engineered to deliver drugs directly to target cells. This enhances therapeutic efficacy and minimizes the side effects commonly associated with traditional delivery methods. These nanoscale systems can traverse biological barriers, release drugs in a controlled manner, and respond to specific internal stimuli, such as changes in pH or temperature. 4 5 One of the key advantages of nanoparticle-based drug delivery systems is their ability to target tumor cells. This targeting is largely driven by the enhanced permeability and retention (EPR) effect, which causes nanoparticles to accumulate in tumor tissues because of their leaky vasculature. 6 7 8 9 10 11 12 13 14 15 Moreover, nanoparticles can be engineered to carry multiple therapeutic agents simultaneously, enabling combination therapies that can target different pathways involved in cancer progression. 6 16 17 Nanoparticle-based drug delivery systems have emerged as a promising strategy, particularly for treating solid tumors. Improving therapeutic efficacy and minimizing systemic toxicity are of paramount importance in these cases. These systems use the unique physicochemical properties of nanoparticles to enhance drug solubility and stability and to deliver drugs more precisely to tumor sites. Currently, many types of nanoparticles are undergoing clinical trials, and several have received regulatory approval for use in cancer therapy ( Table 1 Table 1 Approved Nanoparticle-Based Anticancer Drugs Nanostructure Product Drug Indication Company Approval (Year) Liposome-based nanoparticles Doxil Doxorubicin Kaposi’s sarcoma, ovarian Ca, multiple myeloma. Ortho Biotech FDA (1995) Caelyx Doxorubicin Metastatic breast, Ca., ovarian Ca., Kaposi’s sarcoma, and multiple myeloma Schering-Plough EMA (1996) DaunoXome Daunorubicin Kaposi’s sarcoma Galen FDA (1996) DepoCyt Cytarabine Neoplastic meningitis Pacira Pharmaceuticals FDA (1999) Myoce Doxorubicin Metastatic breast Ca. Teva UK EMA (2000) Lipusu Paclitaxel Breast, lung and ovarian cancer Luye Pharma NMPA (2006) Mepact Mifamurtide Osteosarcoma Millenium EMA (2009) Marqibo Vincristine Acute lymphoid, leukaemia Spectrum FDA (2012) Onivyde Irinotecan Pancreatic Ca., Colorectal Ca. Merrimack FDA (2015) Vyxeos Daunorubicin Cytarabine Acute myeloid, leukaemia Jazz Pharmaceuticals EMA (2018) Protein-based nanoparticles Oncaspar Pegaspargase Acute lymphoblastic leukaemia Les Laboratoires Servier FDA (1994) Ontak Denileukin Diftitox Cutaneous T-cell lymphoma Les Laboratoires Servier FDA (1999) Eligard Leuprorelin acetate Prostate cancer Recordati Industria Chimica e Farmaceutica FDA (2002) Abraxane Paclitaxel Breast Ca. Non-small lung Ca., Pancreatic Ca. American Biosciencem, Inc. FDA (2005) Kadcyla DM1 (or Emtansine) HER2+ breast Ca. Roche Genentech EMA (2013) FDA (2013) Pazenir Paclitaxel Metastatic breast Ca., metastatic adenocarcinoma of the pancreas, non-small cell lung Ca. Ratiopharm GmbH EMA (2019) Metallic nanoparticles NanoTherm Fe2O3 Glioblastoma, prostate, and pancreatic Ca. Magforce EMA (2013) Hensify HfO2 Locally advanced soft tissue sarcoma (STS) Nanobiotix EMA (2019) Self-assembled nanoparticles Genexol-PM Paclitaxel Head and neck, breast cancer Samyang Biopharmaceuticals Corporation Korea (2006) Nanoxel Docetaxel Metastatic breast cancer, ovarian cancer, non-small-cell lung cancer, prostate, gastric, esophageal, squamous cell carcinoma in the head and neck Fresenius Kabi DCGI (2007) Notes 18–22 Despite the wide use of nanoparticle-based anticancer drugs, their toxicity, particularly hepatotoxicity, remains a substantial concern. As the primary organ involved in drug metabolism and detoxification, the liver is susceptible to drug-induced toxicity. 23 In recent years, the hepatotoxicity of nanoparticles, particularly in drug delivery systems for anticancer therapies, has received significant attention. Research has demonstrated that the interaction of nanoparticles with liver cells can trigger adverse effects such as oxidative stress, inflammation, and apoptosis. A major cause of hepatotoxicity is the accumulation of nanoparticles in Browicz-Kupffer cells (B-KCs). These cells can contribute to hepatotoxicity by producing inflammatory mediators such as tumor necrosis factor-alpha (TNF-α), interleukin-1 beta (IL-1b), 24 24 25–27 25 Liver sinusoidal endothelial cells (LSECs) have been shown to play a role in nanoparticle-induced hepatotoxicity. LSECs serve as a selective barrier within the hepatic sinusoid and possess specialized properties that facilitate the exchange of materials between the blood and liver parenchymal cells. 28 29 30 Figure 1 Figure 1 Mechanism of nanoparticle-induced hepatotoxicity. Liver macrophages, known as Browicz-Kupffer cells (B-KCs) and liver sinusoidal endothelial cells (LSECs), internalize nanoparticles by phagocytosis. Upon nanoparticle uptake, these cells generate reactive oxygen species (ROS) and secrete tumor necrosis factor-alpha (TNF-α). The increased production of ROS and TNF-α leads to oxidative stress and inflammatory responses, which collectively contribute to hepatocyte damage. Created in BioRender. Taciak, B. (2025) https://BioRender.com/ucmzgur In the following sections, we will review the primary types of nanoparticle-based anticancer drugs and explore of methodologies for mitigating their hepatotoxicity. Nanoparticles-Based Anticancer Drugs ( Figure 2 Liposome-Based Nanoparticles Liposomes are among the most widely studied and clinically utilized nanoparticle systems. These spherical vesicles are generally categorized as either multilamellar or unilamellar vesicles and play a fundamental role in drug delivery by encapsulating both hydrophilic and hydrophobic agents within their aqueous core and lipid bilayer, respectively. 31 32 33 34 34 35 36 37 Figure 2 Selected nanoparticles used in anticancer therapy. The application of nanoparticles in modern anticancer therapies enables improved biodistribution of drugs to tumor tissues, which may reduce off-target toxicity. However, their use remains associated with hepatotoxicity. Created in BioRender. Taciak, B. (2025) https://BioRender.com/j3mhlsa Liposomes are versatile and can be used to treat several types of cancer, including breast, lung, and ovarian. Liposomal doxorubicin (Doxil ® 38 In recent years, a specific type of liposome called a cubosome has been developed. Cubosomes are lipid-based nanocarriers with a bicontinuous cubic internal structure. Due to their high drug encapsulation efficiency, controlled release properties, and versatility in functionalization, they have emerged as promising platforms in cancer treatment. 39 40 39 40 Protein-Based Nanoparticles Due to their biocompatibility, ability to target specific tissues, and controlled drug release properties, protein-based nanoparticles (PNPs) offer significant advantages in cancer therapy. They enhance drug accumulation in tumor tissues via the enhanced permeability and retention (EPR) effect, which is especially useful for treating solid tumors. 41 PNPs can consist of multiple asymmetric subunits that self-assemble into highly symmetric three-dimensional hollow structures, typically ranging from 10 to 100 nm in diameter. Common structural symmetries used in biomedical applications include icosahedral, octahedral, and tetrahedral arrangements. 42 43 44 In addition to drug delivery, protein-based nanoparticles can exhibit immunogenic properties that enhance the antitumor immune response. They efficiently target antigen-presenting cells (APCs), significantly boosting antigen uptake by dendritic cells (DCs), key players in the initiation of adaptive immunity. Studies suggest that encapsulating soluble protein or peptide antigens within 20–50 nm nanoparticles can improve lymphatic drainage, enhance antigen presentation, and strengthen immune responses against tumors. 45 One key example of a protein-based anticancer therapy is an antibody-drug conjugate (ADC). ADCs consist of monoclonal antibodies that are linked to cytotoxic drugs. This enables the drugs to be delivered directly to cancer cells that express specific antigens. This targeted approach improves the therapeutic index by concentrating the cytotoxic effects at the tumor site while reducing systemic toxicity. 46 47 46 Virus-like particles (VLPs) are a prominent class of protein-based nanoparticles. Due to their unique structural properties and ability to induce immune responses, VLPs have gained significant interest in drug delivery and cancer immunotherapy. These non-infectious, self-assembled structures mimic viral morphology while lacking genetic material, making them safe for therapeutic use. VLPs can encapsulate various therapeutic agents, including chemotherapeutics and immunomodulatory compounds. This positions them as a versatile platform for targeted drug delivery in cancer treatment. 48 49 50 51 52 Metal-Based Nanoparticles Metal-based nanoparticles have emerged as a promising drug delivery platform for cancer treatment. They offer unique advantages, such as enhanced stability and targeted delivery. They also have the ability to combine therapeutic and diagnostic functions. One of the key advantages of metal-based nanoparticles, such as gold and silver, is that they can easily be functionalized with targeting ligands. This feature enables the selective delivery of anticancer drugs to tumor cells while minimizing exposure to healthy tissues. For instance, bombesin-functionalized gold nanoparticles have demonstrated receptor specificity for cancer cells, thereby enhancing their therapeutic efficacy in vitro and in vivo. 53 In addition to their targeting capabilities, metal nanoparticles can also enhance the therapeutic effects of conventional chemotherapeutics through mechanisms such as photothermal therapy. For example, liquid-metal core-shell particles have been developed to deliver doxorubicin and provide photothermal treatment when exposed to light, leading to increased cancer cell death. 54 Metal nanoparticles can improve the solubility and stability of poorly soluble drugs. Gold nanoparticles (AuNPs), in particular, have been extensively studied for their ability to encapsulate various chemotherapeutic agents, thereby improving their bioavailability. 55 Moreover, some metal nanoparticles act as therapeutic agents. Silver nanoparticles (AgNPs), for example, exhibit intrinsic cytotoxic properties against cancer cells. 56 57 58 Self‐Assembled Nanoparticles Recent studies highlight self-assembled nanoparticles as a dynamic and versatile approach in cancer therapy. They offer significant advantages over conventional drug delivery systems, including improved targeting, controlled drug release, and minimized systemic toxicity. These nanoparticles form through noncovalent interactions, including hydrogen bonding and π-π stacking, which are noncovalent interactions between the pi bonds of aromatic rings, as well as hydrophobic effects. These interactions allow for the spontaneous organization of building blocks, such as peptides, small organic molecules, and polymers, into well-defined nanostructures. 59 Graphene-Based Nanoparticle Polymeric nanoparticles represent a promising class of nanocarriers for cancer therapy due to their inherent advantages, including high biocompatibility, controlled drug release, and the ability to be surface-functionalized for active targeting. Engineered from natural or synthetic polymers, these nanoparticles are characterized by tunable physicochemical properties that allow for the encapsulation of various chemotherapeutic agents. This improves therapeutic indices while minimizing systemic toxicity. 60 61 62 61 62 The large surface area and ease of functionalization of graphene make it an excellent carrier for drug molecules. This allows for the co-delivery of chemotherapeutic agents and photosensitizers, facilitating combination therapy with synergistic effects. 63 64 Inorganic-Organic Hybrid Nanoparticles In recent years, inorganic-organic nanoparticles are increasingly recognized as a highly promising class of theragnostic agents in cancer treatment. These nanoparticles combine the robust, often unique physical properties of inorganic materials with the versatile, biocompatible functions of organic molecules. This hybridization enables for the simultaneous integration of diagnostic imaging, controlled drug release, and targeted therapeutic action into a single nanosystem. 65 65 66 Hybrid inorganic-organic nanoparticles are particularly relevant in photothermal therapy and chemotherapy. For instance, antibody-conjugated gold nanorods have been used for the selective photothermal ablation of cancer cells. In this process, the gold core absorbs near-infrared light and generates localized heat, which induces tumor cell death without damaging the surrounding tissues. 67 68 67 68 Nanoparticles’ Hepatotoxicity and Methods of Mitigation The following sections describe mechanism of hepatotoxicity and discuss strategies to improve the effectiveness of nanoparticle-based anticancer drugs while reducing their toxicity, particularly hepatotoxicity ( Figure 3 Figure 3 Strategies for modifying various nanoparticle types to reduce hepatotoxicity. Approaches include size, charge, and shape manipulation; PEGylation; coating; pH-sensitivity; and incorporation of targeting or hepatoprotective agents. These alterations aim to improve biocompatibility, reduce liver accumulation, and enhance targeted delivery. Created in BioRender. Taciak, B. (2025) https://BioRender.com/kkllu37 Hepatotoxicity of Liposome-Based Nanoparticles and Methods of Mitigation The mechanisms underlying hepatotoxicity induced by lipid-based nanoparticles primarily involve oxidative stress, lipid peroxidation, and mitochondrial dysfunction. 69–71 69 72 73 Furthermore, the size and surface properties of nanoparticles influence hepatotoxicity. Smaller nanoparticles tend to accumulate more readily in the liver, thereby exacerbating toxic effects. 74 One strategy for prolonging the circulation of drug-loaded liposomes and reducing hepatotoxicity is to conjugate them with polyethylene glycol (PEG). 75 76 77 Cationic lipids in liposomal formulations contribute to hepatotoxicity by inducing ROS generation and disrupting intracellular calcium homeostasis. 78 79 Negatively charged liposomes have been shown to be less toxic and less hepatotoxic than their cationic counterparts, especially in drug delivery applications. This can be attributed to their interaction with biological membranes, biodistribution, and the stability of the formulations. 80 81 82 83 82 84 Additionally, neutral-charge liposomes, such as 1,2-dioleoyl-sn-glycero-3-phosphatidylcholine (DOPC), demonstrate reduced toxicity compared to cationic liposomes. DOPC nanoliposomes have demonstrated effective systemic siRNA delivery and antitumor efficacy in preclinical models of various cancers, including ovarian, 79 85–87 88 89 90 91 Another promising strategy for enhancing liposomal specificity and reducing toxicity is development of pH-sensitive liposomes. These liposomes release their payload in response to the acidic tumor microenvironment, thereby improving drug delivery efficiency. 92 93 Cubosomes Cubosomes are an interesting example of liposomes with an unusual shape and structure. As previously mentioned, cubosomes are lipid-based nanocarriers with a bicontinuous cubic internal structure. Recent studies have highlighted their potential to enhance the therapeutic index of anticancer drugs. Xie et al demonstrated that when doxorubicin (DOX) is incorporated into pH-sensitive cubosomes, it exhibits minimal release under near-neutral conditions while showing enhanced release in the acidic tumor microenvironment. This reduces cytotoxicity in normal cells, including hepatocytes. These findings underscore how cubosomes can be engineered to exploit tumor-specific physiological conditions for improved drug delivery. 94 Targeted delivery strategies further expand the therapeutic potential of cubosomes in oncology. The functionalization of cubosome surfaces with anti-CEA Affimer tags has been shown to actively target colorectal cancer cells. 95 96 97 98 Hepatotoxicity of Protein-Based Nanoparticles and Methods of Mitigation The primary pathway underlying the liver toxicity associated with protein-based nanoparticles is the activation of B-KCs, the liver’s resident macrophages, that play a critical role in the immune response and the clearance of foreign particles. 99 100 One approach to minimizing hepatotoxicity is using proteins that have a high affinity for cancer cells. Using transferrin as a protein-based nanoparticle enables the effective delivery of conjugated drugs to cancer cells. Transferrin is an iron-binding transport protein that specifically interacts with transferrin receptors, which is commonly overexpressed on cancer cells due to the increased iron demand. This makes transferrin a promising candidate for targeted drug delivery systems. This selective affinity significantly reduces the likelihood of nanoparticle-drug uptake by healthy liver cells. 101 Another protein that uses the transferrin receptor for internalization is ferritin, which can also carry drugs. Due to their nanocage architecture, ferritins have been extensively studied for targeted drug delivery. Ferritin-based nanocarriers exhibit high drug loading efficiency and controlled release properties. They have been used to encapsulate chemotherapeutic agents, such as doxorubicin and cisplatin, thereby improving biocompatibility, circulation half-life, and target selectivity while reducing systemic toxicity. Additionally, ferritins have been used to encapsulate photosensitizers for photodynamic cancer therapy, improving targeting and safety. 102 The size of protein-based nanoparticles can be manipulated to significantly enhance their accumulation within the tumor microenvironment. This benefit is largely attributed to the enhanced permeability and retention (EPR) effect, which reduces damage and toxicity to normal cells by facilitating targeted delivery. 11 103 Virus-Like Particles Using specific VLPs can significantly reduce hepatotoxicity. Clinical studies have provided insight into the safety profile of these VLPs. For example, Nakao et al conducted a Phase I trial of the oncolytic virus HF10, which demonstrated a broad spectrum of anticancer activity with minimal toxicity in humans. This study emphasized that the clinical effects of oncolytic virus therapy are closely related to the host immune response. This indicates that, although VLPs may be effective, their safety must be continuously monitored, especially when combined with other immune stimuli. 104 Regarding specific VLP applications, Franke et al examined the use of the tobacco mosaic virus (TMV) as a nanocarrier for delivering cisplatin to platinum-resistant ovarian cancer cells. They found that TMV-based delivery systems could restore drug efficacy while minimizing the cytotoxicity associated with higher cisplatin doses. 105 However, some studies have reported cytotoxic effects associated with certain VLP formulations. For instance, Shao et al developed polyethyleneimine-coated adeno-associated virus-like particles for siRNA delivery in breast cancer therapy. While the study found a mild immune response, it also raised concerns about the potential toxicity of the delivery system itself. 106 Hepatotoxicity of Metal-Based Nanoparticle (MNP) and Methods of Mitigation One of the primary mechanisms of MNP-induced hepatotoxicity is the production of reactive oxygen species (ROS). ROS can cause oxidative stress, which damages cellular components, including lipids, proteins, and DNA. Ying et al demonstrated that MNPs induce oxidative stress in hepatocytes, resulting in apoptosis and other forms of cell death. 107 108 109 110 111 Metallic nanoparticles (MNPs) can disrupt mitochondrial function. This leads to the release of cytochrome c and the activation of caspases, which play a key role in the apoptotic pathway. The generation of reactive oxygen species (ROS) exacerbates this process, causing lipid peroxidation and damage to subcellular organelles within hepatocytes. The accumulation of MNPs in the liver, primarily by B-KCs and LSECs, triggers inflammatory responses involving increased levels of proinflammatory cytokines, including IL-1β and IL-8. This inflammatory environment can further increase oxidative stress, creating a vicious cycle of cellular damage and apoptosis. 107 The physicochemical properties of MNPs, such as size, shape, and surface charge, significantly influence their toxicity. Therefore, modifying these properties can mitigate the associated risk. Silver and gold nanoparticles have been studied for their ability to induce apoptosis in cancer cells by generating reactive oxygen species (ROS). While these nanoparticles exhibit cytotoxic effects on cancer cells, their design can be optimized to minimize hepatotoxicity by controlling their size and surface properties, which affect their interaction with liver cells. 112 54 Wang et al discovered that the transformation of copper-based nanomaterials under physiological conditions impacts their stability and toxicity. Typically, smaller particles exhibit higher reactivity and a greater potential to induce cellular damage. 113 Several studies have documented the toxicological effects of iron oxide nanoparticles. 114–117 118 119 120 Hepatotoxicity of Self‐assembled Nanoparticles and Methods of Mitigation Similar to other nanoparticles, the hepatotoxicity of self-assembled nanoparticles arises due to multiple factors, such as their high surface reactivity, potential to generate reactive oxygen species (ROS), and subsequent inflammatory responses upon uptake and accumulation in hepatocytes. 24 24 Many self-assembled nanoparticles are designed to maximize therapeutic efficacy while minimizing side effects, including hepatotoxicity. For example, the self-assembly of cisplatin (CDDP) and olaparib (OLA) through hydrogen bonding creates uniform nanoparticles that release their payloads preferentially within the acidic tumor microenvironment. This enhances chemotherapeutic sensitivity while mitigating systemic side effects. 121 Study by Liu et al demonstrated that pH-responsive polymer–drug conjugate micelles could optimize drug release kinetics and significantly reduce hepatotoxicity associated with the free drug. Their system is designed so that the self-assembled micellar nanoparticles remain stable in neutral pH conditions and undergo rapid disassembly in the acidic environment of tumor cell endosomes. 122 Recent developments have highlighted the role of self-assembled, peptide-based nanoparticles in modulating the immune response to cancer. A notable example is peptide-derived proteolysis-targeting chimera (PROTAC) nanoparticles, which have been shown to durably degrade PD-L1 on tumor cells, paving the way for more effective and sustained anticancer immunotherapy. The ability to fine-tune the self-assembly process enables the creation of nanostructures that mimic natural cellular components. This facilitates improved cellular uptake, which may help avoid liver damage. 123 Another effective strategy is to incorporate hepatoprotective agents into the self-assembled structure. Huang et al reported on the development of self-assembled nanoparticles composed of chitosan and heparin that deliver fibroblast growth factor 21 (FGF21). In a murine model of acetaminophen-induced acute liver injury, these nanoparticles provided a sustained release of FGF21. This attenuated oxidative damage and suppressed inflammatory responses in the liver. The study highlighted the potential of such self-assembled delivery systems to effectively target therapeutic agents and actively counteract drug-induced hepatotoxicity by improving the in vivo distribution and release profile of FGF21. 124 Advances in pure drug self‐assembled nanosystems (PDANSs) have expanded the therapeutic possibilities for cancer treatment. These systems capitalize on the intrinsic self-assembly properties of therapeutic agents, providing a novel route for combination therapy that enhances safety and efficacy. By eliminating the need for additional carrier materials, PDANSs reduce potential toxicity, simplify regulatory approval, and maintain the drug concentration within the tumor at an optimal therapeutic level. 125 Hepatotoxicity of Graphene-Based Nanoparticles (GNPs) and Methods of Mitigation Graphene-based nanoparticles (GNPs) have emerged as a promising material in various fields, including drug delivery. However, concerns have been raised about their potential hepatotoxicity, which calls into question their safety and biocompatibility. The toxicity mechanisms associated with GNPs, particularly in the liver, are attributed to several factors, including oxidative stress, cellular uptake, and inflammatory responses. One of the primary mechanisms of hepatotoxicity associated with GNPs is the production of ROS. Studies have shown that exposure to GO and other graphene derivatives can increase ROS production. This, in turn, induces oxidative stress in liver cells. This oxidative stress can result in cellular damage, apoptosis, and necrosis. For example, GNPs have been reported to deplete mitochondrial membrane potential and elevate intracellular ROS levels, thereby triggering apoptotic pathways in various cell types, including hepatocytes. 112 126 The size and surface properties of GNPs significantly influence their toxicity. Smaller nanoparticles tend to be more toxic due to their increased surface area and reactivity, which allows for higher cellular uptake. Additionally, surface functionalization can alter graphene’s interaction with biological systems, affecting its biocompatibility. For instance, studies have demonstrated that functionalized graphene oxide exhibits dose- and size-dependent toxicity. This finding suggests that the concentration and physicochemical properties of GNPs play critical roles in their hepatotoxic effects. 127 128 Another critical aspect of GNP-induced hepatotoxicity is inflammatory responses. The accumulation of GNPs in the liver activates immune cells, which leads to the release of pro-inflammatory cytokines and chemokines. This inflammatory response can contribute to liver damage and dysfunction. Furthermore, studies have shown that GNPs can affect the quantity and activity of B-KCs cells, which are the liver’s resident macrophages and play a vital role in maintaining hepatic homeostasis and responding to injury. 129 In vivo studies have demonstrated that GNPs can accumulate in the liver following intravenous administration, raising concerns about their long-term effects on liver function. The biodistribution of GNPs is influenced by their size, surface charge, and coating. These factors can affect clearance from the body and potential toxicity. 127 130 Studies has shown that GO can be functionalized with PEG to form a stable, biocompatible nanocarrier for anticancer drugs, such as doxorubicin and cisplatin. This process, known as PEGylation, enhances the solubility and dispersibility of the nanoparticles in biological fluids, thereby improving their efficacy in targeting tumor cells. 131 132 133 Furthermore, graphene-based nanoparticles can be engineered to respond to specific stimuli, such as changes in pH or temperature, that are characteristic of the tumor microenvironment. This behavior allows for the controlled release of encapsulated drugs, ensuring that therapeutic agents are released precisely where and when needed. 134 Chen et al developed a nanographene oxide-based multifunctional nanosystem that has been constructed by a unique sequential double redox strategy to co-integrate superparamagnetic Fe 3 4 135 In addition to their role in drug delivery, graphene-based nanoparticles are being studied for their potential in immunotherapy. Their inherent properties can stimulate immune responses, making them suitable adjuvants for cancer vaccines. For example, combining graphene with gold nanoparticles has been shown to enhance photothermal therapy. In this therapy, localized heating induced by near-infrared light can selectively destroy cancer cells while sparing healthy tissue. 136 Hepatotoxicity of Inorganic-Organic Hybrid Nanoparticles and Methods of Mitigation Hybrid systems combine the unique optical, magnetic, and structural properties of inorganic materials with the biocompatibility, targeted binding, and drug loading capabilities of organic molecules. This produces multifunctional platforms suitable for diagnosis, therapy, and theranostics. 137 138 139 Inorganic-organic hybrid systems developed for breast cancer and other tumors have been engineered to carry large amounts of chemotherapeutic drugs. For example, high-load nanoparticles have been developed to encapsulate SN-38 and FdUMP. 137 Furthermore, advanced synthesis strategies such as anionic emulsion polymerization have made it possible to encapsulate inorganic cores with tailored organic polymers. This technique improves nanoparticle stability and allows for the incorporation of multiple functional groups, which is essential for targeted delivery and efficient drug release under physiological conditions. 139 Conclusion Nanoparticle-based drug delivery systems have revolutionized cancer therapeutics. These systems enable the targeted delivery of chemotherapeutic agents, reduce off-target toxicity, and improve pharmacokinetics. These systems use materials like lipids, proteins, metals, polymers, graphene, and hybrid structures. They are designed to take advantage of the EPR effect. This effect allows nanoparticles to accumulate in tumor tissues because of their abnormal vasculature and impaired lymphatic drainage. 6 9 12 24 27 Table 2 Table 2 Strategies for Mitigating Hepatotoxicity of Various Types of Nanoparticles Strategies for Mitigating Hepatotoxicity of Various Types of Nanoparticles Nanoparticle Type Mitigation Strategy References Liposomes PEGylation to reduce RES uptake, use of neutral/negatively charged lipids, pH-sensitive release, size control [ 69–78 87 88 Cubosomes Surface ligand functionalization (eg, angiopep-2), pH-triggered release, chitosan coating [ 91–93 Protein-Based NPs Use of cancer-specific ligands (transferrin, ferritin), size manipulation to exploit EPR, [ 101–103 VLPs Careful material selection, monitor immune response, avoid immunogenic coatings [ 104–106 Metal NPs Size, surface charge and shape control, functionalization (folate, antibodies) [ 54 112 113 118–120 Self-Assembled NPs pH and enzyme sensitivity, eliminate carriers (PDANS), incorporate hepatoprotective agents [ 121–125 Graphene NPs PEGylation, incorporate aptamer, metal particles addition (eg, gold) [ 61 126–136 Hybrid Inorganic-Organic NPs Polymer coating for biocompatibility, optimize size and release kinetics [ 66 137–139 Liposomes, a type of lipid-based nanoparticle, are widely used for encapsulating hydrophilic and hydrophobic drugs. Approved formulations like Doxil ® 31 32 74 80 75 79 96 97 Protein-based nanoparticles, including carriers such as albumin, transferrin, ferritin, and antibody-drug conjugates, offer biocompatibility and the ability to target specific areas. Ferritin and transferrin specifically bind to TfR1, which is overexpressed in many tumor types. This reduces hepatic uptake and enhances tumor specificity. 102 103 46 Metal-based nanoparticles, including silver and gold variants, have many uses in therapy and diagnostics. However, their use is limited by their ability to induce oxidative stress, mitochondrial dysfunction, and inflammation in hepatocytes. 108 113 Graphene-based nanoparticles, including GO, rGO, and GQDs are valued for their large surface area, drug-loading capacity, and potential applications in imaging and therapy. However, these nanoparticles present hepatotoxic risks, primarily through ROS generation, mitochondrial membrane disruption, and inflammatory responses involving hepatic immune cells, such as B-KCs. 126 127 129 134 61–63 Self-assembled nanoparticles formed through non-covalent interactions, such as hydrogen bonding and hydrophobic effects, are a promising platform for pH-sensitive drug delivery. These structures can carry combinations of chemotherapeutics, such as cisplatin and olaparib, and release their payload in an acidic tumor microenvironment, sparing healthy liver tissue. 121 122 125 Inorganic-organic hybrid nanoparticles combine the strength of inorganic components, such as gold nanorods or magnetic cores, with the flexibility and biocompatibility of organic polymers or antibodies. These systems can carry high drug payloads and enable controlled release and dual therapeutic and diagnostic functionality (theranostics). 66 18 Acknowledgments We thank Tomasz P. Rygiel for proofreading the manuscript. Abbreviations ADCs, antibody-drug conjugates; AgNPs, silver nanoparticles; APCs, antigen-presenting cells; AuNPs, gold nanoparticles; B-KCs, Browicz-Kupffer cells; CDDP, cisplatin; DOPC, 1,2-dioleoyl-sn-glycero-3-phosphatidylcholine; DCs, dendritic cells; DOTAP, 1,2-dioleoyl-3-trimethylammonium propane; DOX, doxorubicine; EPR, enhanced permeability and retention; FGF21, fibroblast growth factor 21; GNPs, Graphene-based nanoparticles; GO, graphene oxide; GQDs, graphene quantum dots; IL-1β, interleukin 1 beta; LSECs, liver sinusoidal endothelial cells; MDR, multidrug resistance; MNPs, metal-based nanoparticles; OLA, olaparib; PDANSs, pure drug self‐assembled nanosystems; PEG, polyethylene glycol; PNPs, protein-based nanoparticles; PROTAC, peptide-derived proteolysis-targeting chimera; PTT, photothermal therapy; RES, reticuloendothelial system; rGO, reduced graphene oxide; ROS, reactive oxygen species; siRNA, small interfering RNA; TfR1, transferrin receptor 1; TMV, tobacco mosaic virus; TNF-α, tumor necrosis factor-alpha; VLPs, virus-like particles. Disclosure The authors report no conflicts of interest in this work. References 1. Gao Y Wang K Zhang J Duan X Sun Q Men K Multifunctional nanoparticle for cancer therapy MedComm 2023 4 1 1 52 10.1002/mco2.187 PMC9834710 36654533 2. Anselmo AC Mitragotri S Nanoparticles in the clinic Bioeng Transl Med 2016 1 1 10 29 10.1002/btm2.10003 29313004 PMC5689513 3. Elumalai K Srinivasan S Shanmugam A Review of the efficacy of nanoparticle-based drug delivery systems for cancer treatment Biomed Technol 2024 5 109 122 10.1016/j.bmt.2023.09.001 4. Patra JK Das G Fraceto LF Nano based drug delivery systems: recent developments and future prospects J Nanobiotechnology 2018 16 1 1 33 10.1186/s12951-018-0392-8 30231877 PMC6145203 5. Mirza AZ Siddiqui FA Nanomedicine and drug delivery: a mini review Int Nano Lett 2014 4 1 94 10.1007/s40089-014-0094-7 6. Jain RK Stylianopoulos T Delivering nanomedicine to solid tumors Nat Rev Clin Oncol 2010 7 11 653 664 10.1038/nrclinonc.2010.139 20838415 PMC3065247 7. Ficai D Ficai A Andronescu E Advances in cancer treatment: role of nanoparticles Nanomater Toxicol Risk Assess 2015 1 22 10.5772/60665 8. Umam AH Alam T Nanoparticle-based drug delivery systems for cancer treatment: a review Int Res J Mod Eng Technol Sci 2023 5 5 10.56726/irjmets38886 9. Bazak R Houri M El Achy S Hussein W Refaat T Passive targeting of nanoparticles to cancer: a comprehensive review of the literature Mol Clin Oncol 2014 2 6 904 908 10.3892/mco.2014.356 25279172 PMC4179822 10. Kreuter J Nanoparticles-a historical perspective Int J Pharm 2007 331 1 1 10 10.1016/j.ijpharm.2006.10.021 17110063 11. Fang J Nakamura H Maeda H The EPR effect: unique features of tumor blood vessels for drug delivery, factors involved, and limitations and augmentation of the effect Adv Drug Deliv Rev 2011 63 3 136 151 10.1016/j.addr.2010.04.009 20441782 12. Maeda H The enhanced permeability and retention (EPR) effect in tumor vasculature: the key role of tumor-selective macromolecular drug targeting Adv Enzyme Regul 2001 41 1 189 207 10.1016/S0065-2571(00)00013-3 11384745 13. Yuan F Dellian M Fukumura D Vascular permeability in a human tumor xenograft: molecular size dependence and cutoff size Cancer Res 1995 55 17 3752 3756 7641188 14. Charrois GJR Allen TM Rate of biodistribution of STEALTH ® Biochim Biophys Acta Biomembr 2003 1609 1 102 108 10.1016/S0005-2736(02)00661-2 12507764 15. Yin L Yuvienco C Montclare JK Protein based therapeutic delivery agents: contemporary developments and challenges Biomaterials 2017 134 91 116 10.1016/j.biomaterials.2017.04.036 28458031 PMC5513498 16. Yao Y Zhou Y Liu L Nanoparticle-based drug delivery in cancer therapy and its role in overcoming drug resistance Front Mol Biosci 2020 7 1 14 10.3389/fmolb.2020.00193 32974385 PMC7468194 17. Singh S Sharma A Robertson GP Realizing the clinical potential of cancer nanotechnology by minimizing toxicologic and targeted delivery concerns Cancer Res 2012 72 22 5663 5668 10.1158/0008-5472.CAN-12-1527 23139207 PMC3616627 18. Rodríguez F Caruana P De la Fuente N Nano-based approved pharmaceuticals for cancer treatment: present and future challenges Biomolecules 2022 12 6 1 27 10.3390/biom12060784 PMC9221343 35740909 19. Zhang Q Huang XE Gao LL A clinical study on the premedication of paclitaxel liposome in the treatment of solid tumors Biomed Pharmacother 2009 63 8 603 607 10.1016/j.biopha.2008.10.001 19019625 20. Wicki A Witzigmann D Balasubramanian V Huwyler J Nanomedicine in cancer therapy: challenges, opportunities, and clinical applications J Control Release 2015 200 138 157 10.1016/j.jconrel.2014.12.030 25545217 21. Bonvalot S Rutkowski PL Thariat J NBTXR3, a first-in-class radioenhancer hafnium oxide nanoparticle, plus radiotherapy versus radiotherapy alone in patients with locally advanced soft-tissue sarcoma (Act.In.Sarc): a multicentre, Phase 2–3, randomised, controlled trial Lancet Oncol 2019 20 8 1148 1159 10.1016/S1470-2045(19)30326-2 31296491 22. Mi P Miyata K Kataoka K Cabral H Clinical Translation of Self-Assembled Cancer Nanomedicines Adv Ther 2021 4 1 1 29 10.1002/adtp.202000159 23. Singh D Cho WC Upadhyay G Drug-induced liver toxicity and prevention by herbal antioxidants: an overview Front Physiol 2016 6 1 18 10.3389/fphys.2015.00363 PMC4726750 26858648 24. Gao C Wang M Zheng Y Hepatotoxicity of nanomaterials: from mechanism to therapeutic strategy Nanotechnol Rev 2024 13 1 20240074 10.1515/ntrev-2024-0074 25. Guidolin K Zheng G Nanomedicines lost in translation ACS Nano 2019 13 12 13620 13626 10.1021/acsnano.9b08659 31800203 26. Shi J Kantoff PW Wooster R Farokhzad OC Cancer nanomedicine: progress, challenges and opportunities Nat Rev Cancer 2017 17 1 20 37 10.1038/nrc.2016.108 27834398 PMC5575742 27. Sharma S Parveen R Chatterji BP Toxicology of nanoparticles in drug delivery Curr Pathobiol Rep 2021 9 4 133 144 10.1007/s40139-021-00227-z 34840918 PMC8611175 28. Puri M Sonawane S Liver sinusoidal endothelial cells in the regulation of immune responses and fibrosis in metabolic dysfunction-associated fatty liver disease Int J Mol Sci 2025 26 9 1 19 10.3390/ijms26093988 PMC12071881 40362227 29. Li J Chen C Xia T Understanding nanomaterial–liver interactions to facilitate the development of safer nanoapplications Adv Mater 2022 34 11 1 30 10.1002/adma.202106456 PMC9040585 35029313 30. Asada S Kaji K Nishimura N Tofogliflozin delays portal hypertension and hepatic fibrosis by inhibiting Sinusoidal Capillarization in Cirrhotic Rats Cells 2024 13 6 538 10.3390/cells13060538 38534382 PMC10968969 31. Dhillon A Singh R Senwar KR An extensive review on novel liposomes: classification, methodology, characterization, current formulations Int J Drug Deliv Technol 2024 14 3 1842 1852 10.25258/ijddt.14.3.83 32. Ashtankar A Sufi MB Deolekar R Katare D A review on liposomes – a novel drug delivery system Int J Adv Res Sci Commun Technol 2023 27 444709 333 338 10.48175/ijarsct-14045 33. Kieler-Ferguson HM Chan D Sockolosky J Encapsulation, controlled release, and antitumor efficacy of cisplatin delivered in liposomes composed of sterol-modified phospholipids Eur J Pharm Sci 2017 103 85 93 10.1016/j.ejps.2017.03.003 28263913 PMC5473525 34. Pereira S Lee J Rubio N Cationic liposome- multi-walled carbon nanotubes hybrids for dual siPLK1 and doxorubicin delivery in vitro Pharm Res 2015 32 10 3293 3308 10.1007/s11095-015-1707-1 26085038 PMC4577551 35. Soleimani A Mirzavi F Nikoofal-Sahlabadi S CD73 downregulation by EGFR-targeted liposomal CD73 siRNA potentiates antitumor effect of liposomal doxorubicin in 4T1 tumor-bearing mice Sci Rep 2022 12 1 1 17 10.1038/s41598-022-14392-7 35729230 PMC9213518 36. Rolle F Bincoletto V Gazzano E Coencapsulation of disulfiram and doxorubicin in liposomes strongly reverses multidrug resistance in breast cancer cells Int J Pharm 2020 580 119191 10.1016/j.ijpharm.2020.119191 32142738 37. Walls ZF Gong H Wilson RJ Liposomal coencapsulation of doxorubicin with listeriolysin O increases potency via subcellular targeting Mol Pharm 2016 13 3 1185 1190 10.1021/acs.molpharmaceut.5b00674 26751497 38. Huang Q Zhang L Sun X Zeng K Li J Liu YN Coating of carboxymethyl dextran on liposomal curcumin to improve the anticancer activity RSC Adv 2014 4 103 59211 59217 10.1039/c4ra11181h 39. Valarmathi S Abarna S Dharshini J Vijai S Cubosomes as advanced nanocarriers for drug delivery J Pharma Insight Res 2025 3 1 035 042 10.69613/22seee98 40. Srinivas M Reddy MS Revolutionizing drug delivery: unraveling the nanostructural marvels of cubosomes and their comprehensive evaluation in pharmaceutical applications Int J Res Publ Rev 2024 5 1 1880 1890 10.55248/gengpi.5.0124.0226 41. Sandra F Khaliq NU Sunna A Care A Developing protein-based nanoparticles as versatile delivery systems for cancer therapy and imaging Nanomaterials 2019 9 9 1329 10.3390/nano9091329 31527483 PMC6781024 42. Bhaskar S Lim S Engineering protein nanocages as carriers for biomedical applications NPG Asia Mater 2017 9 4 1 18 10.1038/am.2016.128 PMC7091667 32218880 43. Molino NM Wang SW Caged protein nanoparticles for drug delivery Curr Opin Biotechnol 2014 28 75 82 10.1016/j.copbio.2013.12.007 24832078 PMC4087095 44. Schoonen L Van Hest JCM Functionalization of protein-based nanocages for drug delivery applications Nanoscale 2014 6 13 7124 7141 10.1039/c4nr00915k 24860847 45. Neek M Kim TI Wang SW Protein-based nanoparticles in cancer vaccine development Nanomedicine 2019 15 1 164 174 10.1016/j.nano.2018.09.004 30291897 PMC6289732 46. Warnders FJ Lub-de Hooge MN de Vries EGE Kosterink JGW Influence of protein properties and protein modification on biodistribution and tumor uptake of anticancer antibodies, antibody derivatives, and non-Ig scaffolds Med Res Rev 2018 38 6 1837 1873 10.1002/med.21498 29635825 47. Chen L Xu N Wang P Nanoalbumin–prodrug conjugates prepared via a thiolation-and-conjugation method improve cancer chemotherapy and immune checkpoint blockade therapy by promoting CD8+ T-cell infiltration Bioeng Transl Med 2023 8 1 1 16 10.1002/btm2.10377 PMC9842047 36684090 48. Kim KR Lee AS Kim SM Heo HR Kim CS Virus-like nanoparticles as a theranostic platform for cancer Front Bioeng Biotechnol 2023 10 1 19 10.3389/fbioe.2022.1106767 PMC9878189 36714624 49. He J Yu L Lin X Virus-like particles as nanocarriers for intracellular delivery of biomolecules and compounds Viruses 2022 14 9 1905 10.3390/v14091905 36146711 PMC9503347 50. Hu H Steinmetz NF Doxorubicin-loaded physalis mottle virus particles function as a pH-responsive prodrug enabling cancer therapy Biotechnol J 2020 15 12 1 8 10.1002/biot.202000077 PMC7888571 32918857 51. Finbloom JA Aanei IL Bernard JM Evaluation of three morphologically distinct virus-like particles as nanocarriers for convection-enhanced drug delivery to glioblastoma Nanomaterials 2018 8 12 1007 10.3390/nano8121007 30563038 PMC6315496 52. Zhao Q Chen W Chen Y Zhang L Zhang J Zhang Z Self-assembled virus-like particles from rotavirus structural protein VP6 for targeted drug delivery Bioconjug Chem 2011 22 3 346 352 10.1021/bc1002532 21338097 53. Chanda N Kattumuri V Shukla R Bombesin functionalized gold nanoparticles show in vitro and in vivo cancer receptor specificity Proc Natl Acad Sci U S A 2010 107 19 8760 8765 10.1073/pnas.1002143107 20410458 PMC2889350 54. Ahn S Kang SH Woo H Liquid-metal core–shell particles coated with folate and phospholipids for targeted drug delivery and photothermal treatment of cancer cells Nanomaterials 2023 13 13 2017 10.3390/nano13132017 37446533 PMC10343683 55. Ren F Bhana S Norman DD Gold nanorods carrying paclitaxel for photothermal-chemotherapy of cancer Bioconjug Chem 2013 24 3 376 386 10.1021/bc300442d 23360450 56. Zhang XF Liu ZG Shen W Gurunathan S Silver nanoparticles: synthesis, characterization, properties, applications, and therapeutic approaches Int J Mol Sci 2016 17 9 1534 10.3390/ijms17091534 27649147 PMC5037809 57. Indrakumar J Korrapati PS Steering efficacy of nano molybdenum towards cancer: mechanism of action Biol Trace Elem Res 2020 194 1 121 134 10.1007/s12011-019-01742-2 31123924 PMC7223681 58. Gobin AM Watkins EM Quevedo E Colvin VL West JL Near-infrared-resonant gold/gold sulfide nanoparticles as a photothermal cancer therapeutic agent Small 2010 6 6 745 752 10.1002/smll.200901557 20183810 PMC3014644 59. Singh M Kaur G Singh I Molecular self-assembly of peptides into supramolecular nanoarchitectures for target-specific drug delivery ACS Appl Bio Mater 2025 8 6 4467 4488 10.1021/acsabm.5c00138 40359489 60. Ku TH Shen WT Hsieh CT Chen GS Shia WC Specific forms of graphene quantum dots induce apoptosis and cell cycle arrest in breast cancer cells Int J Mol Sci 2023 24 4 4046 10.3390/ijms24044046 36835458 PMC9968019 61. Muzammal M Awan M Mukhtar A Mohsin M Qamar MA Graphene-based nanomaterials are a potent and innovative technology for the treatment of cancer: a review ChemistrySelect 2024 9 40 1 21 10.1002/slct.202403554 62. Khan MZ Tahir D Asim M Israr M Haider A Xu DD Revolutionizing cancer care: advances in carbon-based materials for diagnosis and treatment Cureus 2024 16 1 e52511 10.7759/cureus.52511 38371088 PMC10874252 63. Hajipour Keyvani A Mohammadnejad P Pazoki-Toroudi H Advancements in cancer treatment: harnessing the synergistic potential of graphene-based nanomaterials in combination therapy ACS Appl Mater Interfaces 2025 17 2 2756 2790 10.1021/acsami.4c15536 39745785 64. Holca A Cucuiet V Astilean S Lamy de la Chapelle M Focsan M Recent advances in gold nanoparticle-graphene hybrid nanoplatforms with visible to near-infrared response for photodynamic and photothermal therapy and bioimaging RSC Adv 2025 15 15 11902 11922 10.1039/d4ra09100k 40236567 PMC11998979 65. He C Lin W Hybrid nanoparticles for cancer imaging and therapy Mirkin C Meade T Petrosko S Stegh A Nanotechnology-Based Precision Tools for the Detection and Treatment of Cancer. Cancer Treatment and Research 166 Cham Springer 2015 10.1007/978-3-319-16555-4_8 25895869 66. Gautier J Allard-Vannier E Hervé-Aubert K Soucé M Chourpa I Design strategies of hybrid metallic nanoparticles for theragnostic applications Nanotechnology 2013 24 43 432002 10.1088/0957-4484/24/43/432002 24107712 67. Huang X El-Sayed IH Qian W El-Sayed MA Cancer cell imaging and photothermal therapy in the near-infrared region by using gold nanorods J Am Chem Soc 2006 128 6 2115 2120 10.1021/ja057254a 16464114 68. Park J von Maltzahn G Ruoslahti E Bhatia SN Sailor MJ Micellar hybrid nanoparticles for simultaneous magnetofluorescent imaging and drug delivery Angew Chem 2008 120 38 7394 7398 10.1002/ange.200801810 PMC3999904 18696519 69. Abdou EM Fayed MAA Helal D Ahmed KA Assessment of the hepatoprotective effect of developed lipid-polymer hybrid nanoparticles (LPHNPs) encapsulating naturally extracted β-Sitosterol against CCl4 induced hepatotoxicity in rats Sci Rep 2019 9 1 1 14 10.1038/s41598-019-56320-2 31875004 PMC6930297 70. Liu M Wu E Pan F Effects of drug-induced liver injury on the in vivo fate of liposomes Eur J Pharm Biopharm 2024 201 114389 10.1016/j.ejpb.2024.114389 38945407 71. Rennert C Heil T Schicht G Prolonged lipid accumulation in cultured primary human hepatocytes rather leads to er stress than oxidative stress Int J Mol Sci 2020 21 19 1 23 10.3390/ijms21197097 PMC7582586 32993055 72. Waseem M Kaushik P Dutta S Chakraborty R Hassan MI Parvez S Modulatory role of quercetin in mitochondrial dysfunction in titanium dioxide nanoparticle-induced hepatotoxicity ACS Omega 2022 7 4 3192 3202 10.1021/acsomega.1c04740 35128232 PMC8811893 73. Lee TY Liu MS Huang LJ Bioenergetic failure correlates with autophagy and apoptosis in rat liver following silver nanoparticle intraperitoneal administration Part Fibre Toxicol 2013 10 1 1 13 10.1186/1743-8977-10-40 23958063 PMC3765627 74. Inglut CT Sorrin AJ Kuruppu T Immunological and toxicological considerations for the design of liposomes Nanomaterials 2020 10 2 190 10.3390/nano10020190 31978968 PMC7074910 75. Ishida T Iden DL Allen TM A combinatorial approach to producing sterically stabilized (Stealth) immunoliposomal drugs FEBS Lett 1999 460 1 129 133 10.1016/S0014-5793(99)01320-4 10571074 76. Sofou S Enmon R Palm S Large anti-HER2/neu liposomes for potential targeted intraperitoneal therapy of micrometastatic cancer J Liposome Res 2010 20 4 330 340 10.3109/08982100903544185 20070139 PMC3172685 77. Meng J Guo F Xu H Liang W Wang C Yang XD Combination therapy using co-encapsulated resveratrol and paclitaxel in liposomes for drug resistance reversal in breast cancer cells in vivo Sci Rep 2016 6 1 11 10.1038/srep22390 26947928 PMC4780086 78. Dokka S Toledo D Shi X Castranova V Rojanasakul Y Oxygen radical-mediated pulmonary toxicity induced by some cationic liposomes Pharm Res 2000 17 5 521 525 10.1023/A:1007504613351 10888302 79. Landen CN Chavez-Reyes A Bucana C Therapeutic EphA2 gene targeting in vivo using neutral liposomal small interfering RNA delivery Cancer Res 2005 65 15 6910 6918 10.1158/0008-5472.CAN-05-0530 16061675 80. Akhtar A Wang SX Ghali L Bell C Wen X Effective delivery of arsenic trioxide to HPV-positive cervical cancer cells using optimised liposomes: a size and charge study Int J Mol Sci 2018 19 4 1081 10.3390/ijms19041081 29617346 PMC5979440 81. Zarchi AAK Amini SM Salimi A Kharazi S Synthesis and characterisation of liposomal doxorubicin with loaded gold nanoparticles IET Nanobiotechnol 2018 12 6 846 849 10.1049/iet-nbt.2017.0321 30104461 PMC8676531 82. Vhora I Khatri N Desai J Thakkar HP Caprylate-conjugated cisplatin for the development of novel liposomal formulation AAPS Pharm Sci Tech 2014 15 4 845 857 10.1208/s12249-014-0106-y PMC4113617 24700295 83. Alhariri M Majrashi MA Bahkali AH Efficacy of neutral and negatively charged liposome-loaded gentamicin on planktonic bacteria and biofilm communities Int J Nanomed 2017 12 6949 6961 10.2147/IJN.S141709 PMC5609801 29075113 84. Shi M Anantha M Wehbe M Liposomal formulations of carboplatin injected by convection-enhanced delivery increases the median survival time of F98 glioma bearing rats J Nanobiotechnology 2018 16 1 1 12 10.1186/s12951-018-0404-8 30290821 PMC6172733 85. Halder J Kamat AA Landen CN Focal adhesion kinasetargeting using in vivo short interfering RNA delivery in neutral liposomes for ovarian carcinoma therapy Clin Cancer Res 2006 12 16 4916 4924 10.1158/1078-0432.CCR-06-0021 16914580 PMC3144499 86. Merritt WM Lin YG Spannuth WA Effect of interleukin-8 gene silencing with liposome-encapsulated small interfering RNA on ovarian cancer cell growth J Natl Cancer Inst 2008 100 5 359 372 10.1093/jnci/djn024 18314475 PMC2770251 87. Nick AM Stone RL Armaiz-Pena G Silencing of p130Cas in ovarian carcinoma: a novel mechanism for tumor cell death J Natl Cancer Inst 2011 103 21 1596 1612 10.1093/jnci/djr372 21957230 PMC3206039 88. Gray MJ Van Buren G Dallas NA Therapeutic targeting of neuropilin-2 on colorectal carcinoma cells implanted in the murine liver J Natl Cancer Inst 2008 100 2 109 120 10.1093/jnci/djm279 18182619 89. Tekedereli I Alpay SN Akar U Therapeutic silencing of Bcl-2 by systemically administered siRNA nanotherapeutics inhibits tumor growth by autophagy and apoptosis and enhances the efficacy of chemotherapy in orthotopic xenograft models of ER (-) and ER (+) breast cancer Mol Ther Nucleic Acids 2013 2 e121 10.1038/mtna.2013.45 24022053 PMC4028016 90. Shao L Tekedereli I Wang J Highly specific targeting of the TMPRSS2/ERG fusion gene using liposomal nanovectors Clin Cancer Res 2012 18 24 6648 6657 10.1158/1078-0432.CCR-12-2715 23052253 PMC3525716 91. Villares GJ Zigler M Wang H Targeting melanoma growth and metastasis with systemic delivery of liposome-incorporated protease-activated receptor-1 small interfering RNA Cancer Res 2008 68 21 9078 9086 10.1158/0008-5472.CAN-08-2397 18974154 PMC2597081 92. Garu A Moku G Gulla SK Examples of tumor growth inhibition properties of liposomal formulations of pH-sensitive histidinylated cationic amphiphiles ACS Biomater Sci Eng 2015 1 8 646 655 10.1021/acsbiomaterials.5b00025 33435088 93. Zhao Y Liu C Chen H Synthesis of asymmetrically dihydrophobic chain poly(ethylene glycol) lipids for long circulation and membrane fusion J Surfactants Deterg 2022 25 5 643 654 10.1002/jsde.12598 94. Xie C Wang B Qi X Investigation of anticancer therapy using pH-sensitive carbon dots-functionalized doxorubicin in cubosomes ACS Appl Bio Mater 2024 7 3 1958 1967 10.1021/acsabm.3c01306 38363649 95. Khaled YS Khot MI Aiyappa-Maudsley R Photoactive imaging and therapy for colorectal cancer using a CEA-Affimer conjugated Foslip nanoparticle Nanoscale 2023 16 14 7185 7199 10.1039/d3nr04118b PMC10993305 38506227 96. Cai X Refaat A Gan PY Angiopep-2-functionalized lipid cubosomes for blood-brain barrier crossing and glioblastoma treatment ACS Appl Mater Interfaces 2024 16 10 12161 12174 10.1021/acsami.3c14709 38416873 97. Louis D Rizkalla CMZ Rashad A Cubosomes as delivery system to repositioning nitrofurantoin in breast cancer management Drug Des Devel Ther 2024 18 6173 6184 10.2147/DDDT.S499068 PMC11668685 39722678 98. Mneimneh AT Hayar B Al Hadeethi S Darwiche N Mehanna MM Development of chitosan-coated atorvastatin-loaded liquid crystalline nanoparticles: intersection of drug repurposing and nanotechnology in colorectal cancer management Pharmaceutics 2025 17 6 1 26 10.3390/pharmaceutics17060698 PMC12196457 40574011 99. Ohara Y Oda T Yamada K Effective delivery of chemotherapeutic nanoparticles by depleting host Kupffer cells Int J Cancer 2012 131 10 2402 2410 10.1002/ijc.27502 22362271 100. Chen T Zhang Y Zhang Y Autophagic degradation of MVBs in LSECs promotes Aldosterone induced-HSCs activation Hepatol Int 2024 18 1 273 288 10.1007/s12072-023-10559-0 37330971 101. Kaltbeitzel J Wich PR Protein-based nanoparticles: from drug delivery to imaging, nanocatalysis and protein therapy Angewandte Chemie Int Ed 2023 62 44 e202216097 10.1002/anie.202216097 36917017 102. Palombarini F Di Fabio E Boffi A Macone A Bonamore A Ferritin nanocages for protein delivery to tumor cells Molecules 2020 25 4 825 10.3390/molecules25040825 32070033 PMC7070480 103. Sun T Zhang YS Pang B Hyun DC Yang M Xia Y Engineered nanoparticles for drug delivery in cancer therapy Angewandte Chemie Int Ed 2014 53 46 12320 12364 10.1002/anie.201403036 25294565 104. Nakao A Kasuya H Sahin TT A phase i dose-escalation clinical trial of intraoperative direct intratumoral injection of HF10 oncolytic virus in non-resectable patients with advanced pancreatic cancer Cancer Gene Ther 2011 18 3 167 175 10.1038/cgt.2010.65 21102422 105. Franke CE Czapar AE Patel RB Steinmetz NF Tobacco mosaic virus-delivered cisplatin restores efficacy in platinum-resistant ovarian cancer cells Mol Pharm 2018 15 8 2922 2931 10.1021/acs.molpharmaceut.7b00466 28926265 106. Shao W Paul A Abbasi S A novel polyethyleneimine-coated adenoassociated virus-like particle formulation for efficient siRNA delivery in breast cancer therapy: preparation and in vitro analysis Int J Nanomed 2012 7 1575 1586 10.2147/IJN.S26891 PMC3356177 22619514 107. Yao Y Zang Y Qu J Tang M Zhang T The toxicity of metallic nanoparticles on liver: the subcellular damages, mechanisms, and outcomes Int J Nanomed 2019 14 8787 8804 10.2147/IJN.S212907 PMC6844216 31806972 108. Boey A Ho HK All roads lead to the liver: metal nanoparticles and their implications for liver health Small 2020 16 21 1 18 10.1002/smll.202000153 32163668 109. Khalaf AA Zaki AR Galal MK Ogaly HA Ibrahim MA Hassan A The potential protective effect of α-lipoic acid against nanocopper particle-induced hepatotoxicity in male rats Hum Exp Toxicol 2017 36 9 881 891 10.1177/0960327116674526 27827802 110. ElBadry H El-Atrash A Abdelhalim S Tousson E Role of Chitosan nanoparticles in improving hepatic and renal toxicity induced by silver nanoparticles coated by Fe3O4 in rats Asian J Res Biochem 2021 9 3 1 8 10.9734/ajrb/2021/v9i330200 111. Isoda K Tanaka A Fuzimori C Toxicity of gold nanoparticles in mice due to nanoparticle/drug interaction induces acute kidney damage Nanoscale Res Lett 2020 15 1 141 10.1186/s11671-020-03371-4 32617798 PMC7332653 112. Ali D Alarifi S Alkahtani S Almeer RS Silver-doped graphene oxide nanocomposite triggers cytotoxicity and apoptosis in human hepatic normal and carcinoma cells Int J Nanomed 2018 13 5685 5699 10.2147/IJN.S165448 PMC6161714 30288041 113. Wang Z Von Dem Bussche A Kabadi PK Kane AB Hurt RH Biological and environmental transformations of copper-based nanomaterials ACS Nano 2013 7 10 8715 8727 10.1021/nn403080y 24032665 PMC3894052 114. Bellusci M La Barbera A Padella F Biodistribution and acute toxicity of a nanofluid containing manganese iron oxide nanoparticles produced by a mechanochemical process Int J Nanomed 2014 9 1 1919 1929 10.2147/IJN.S56394 PMC4000180 24790434 115. Sun B Liu R Ye N Xiao ZD Comprehensive evaluation of microrna expression profiling reveals the neural signaling specific cytotoxicity of superparamagnetic iron oxide nanoparticles (SPIONs) through N-Methyl-D-Aspartate Receptor PLoS One 2015 10 3 1 11 10.1371/journal.pone.0121671 PMC4370573 25798908 116. Sadeghi L Tanwir F Yousefi Babadi V In vitro toxicity of iron oxide nanoparticle: oxidative damages on Hep G2 cells Exp Toxicol Pathol 2015 67 2 197 203 10.1016/j.etp.2014.11.010 25497787 117. Rajiv S Jerobin J Saranya V Comparative cytotoxicity and genotoxicity of cobalt (II, III) oxide, iron (III) oxide, silicon dioxide, and aluminum oxide nanoparticles on human lymphocytes in vitro Hum Exp Toxicol 2016 35 2 170 183 10.1177/0960327115579208 25829403 118. Feng Q Liu Y Huang J Chen K Huang J Xiao K Uptake, distribution, clearance, and toxicity of iron oxide nanoparticles with different sizes and coatings Sci Rep 2018 8 1 1 13 10.1038/s41598-018-19628-z 29391477 PMC5794763 119. Lee JH Ju JE Kim BI Rod-shaped iron oxide nanoparticles are more toxic than sphere-shaped nanoparticles to murine macrophage cells Environ Toxicol Chem 2014 33 12 2759 2766 10.1002/etc.2735 25176020 120. Kiyani MM Bokhari SAI Syed A Rehman H Elmorsy E Shah SSH A histological study for the evaluation of potential harmful effects of orally ingested iron oxide nanoparticles in mice Ann Clin Anal Med 2021 12 03 238 241 10.4328/acam.20244 121. Zhang T Li X Wu L Enhanced cisplatin chemotherapy sensitivity by self-assembled nanoparticles with Olaparib Front Bioeng Biotechnol 2024 12 1 12 10.3389/fbioe.2024.1364975 PMC10898354 38415186 122. Liu S Ono RJ Yang C Dual pH-responsive shell-cleavable polycarbonate micellar nanoparticles for in vivo anticancer drug delivery ACS Appl Mater Interfaces 2018 10 23 19355 19364 10.1021/acsami.8b01954 29757607 123. Moon Y Cho H Kim J Self‐assembled Peptide‐Derived Proteolysis‐Targeting Chimera (PROTAC) nanoparticles for tumor‐targeted and durable PD‐L1 degradation in cancer immunotherapy Angew Chem 2025 137 5 e202414146 10.1002/ange.202414146 39572518 124. Huang Z Wang H Chun C Li X Xu S Zhao Y Self-assembled FGF21 nanoparticles alleviate drug-induced acute liver injury Front Pharmacol 2023 13 1 11 10.3389/fphar.2022.1084799 PMC9871310 36703750 125. Niu R Liu X Yang X Advances in pure drug self-assembled nanosystems: a novel strategy for combined cancer therapy Pharmaceutics 2025 17 1 68 10.3390/pharmaceutics17010068 39861716 PMC11768559 126. Wang Z Ciacchi LC Wei G Recent advances in the synthesis of graphene-based nanomaterials for controlled drug delivery Appl Sci 2017 7 11 1175 10.3390/app7111175 127. Ou L Song B Liang H Toxicity of graphene-family nanoparticles: a general review of the origins and mechanisms Part Fibre Toxicol 2016 13 1 57 10.1186/s12989-016-0168-y 27799056 PMC5088662 128. Domi B Rumbo C García-Tojal J Sima LE Negroiu G Tamayo-Ramos JA Interaction analysis of commercial graphene oxide nanoparticles with unicellular systems and biomolecules Int J Mol Sci 2020 21 1 5 8 10.3390/ijms21010205 PMC6982217 31892228 129. Afzali M Parivar K Roodbari NH Badiei A Study of nano-graphene oxide effects on the number of kupffer cells and megakaryocytes in liver of NMRI strain mouse embryo in vivo Special Issue Curr World Environ 2015 10 Special Issue May 2015 713 718 10.12944/CWE.10.Special-Issue1.85 130. Kanakia S Toussaint JD Mullick Chowdhury S Dose ranging, expanded acute toxicity and safety pharmacology studies for intravenously administered functionalized graphene nanoparticle formulations Biomaterials 2014 35 25 7022 7031 10.1016/j.biomaterials.2014.04.066 24854092 PMC4104699 131. Pei X Zhu Z Gan Z PEGylated nano-graphene oxide as a nanocarrier for delivering mixed anticancer drugs to improve anticancer activity Sci Rep 2020 10 1 1 15 10.1038/s41598-020-59624-w 32066812 PMC7026168 132. Tang Y Hu H Zhang MG An aptamer-targeting photoresponsive drug delivery system using “off-on” graphene oxide wrapped mesoporous silica nanoparticles Nanoscale 2015 7 14 6304 6310 10.1039/c4nr07493a 25782595 PMC5242368 133. Wang X Han Q Yu N Aptamer-conjugated graphene oxide-gold nanocomposites for targeted chemo-photothermal therapy of cancer cells J Mater Chem B 2015 3 19 4036 4042 10.1039/c5tb00134j 32262625 134. Khakpour E Salehi S Naghib SM Ghorbanzadeh S Zhang W Graphene-based nanomaterials for stimuli-sensitive controlled delivery of therapeutic molecules Front Bioeng Biotechnol 2023 11 1 9 10.3389/fbioe.2023.1129768 PMC9947473 36845181 135. Chen Y Xu P Shu Z Multifunctional graphene oxide-based triple stimuli-responsive nanotheranostics Adv Funct Mater 2014 24 28 4386 4396 10.1002/adfm.201400221 136. Yang L Tseng YT Suo G Photothermal therapeutic response of cancer cells to aptamer-gold nanoparticle-hybridized graphene oxide under NIR illumination ACS Appl Mater Interfaces 2015 7 9 5097 5106 10.1021/am508117e 25705789 137. Sabljo K Ischyropoulou M Napp J Alves F Feldmann C High-load nanoparticles with a chemotherapeutic SN-38/FdUMP drug cocktail Nanoscale 2024 16 31 14853 14860 10.1039/d4nr01403k 39034735 138. Gimeno-Ferrero R de Jesús JR Leal MP Efficient strategy to synthesize tunable pH-responsive hybrid micelles based on iron oxide and gold nanoparticles Langmuir 2024 40 22 11775 11784 10.1021/acs.langmuir.4c01318 38769025 PMC11155236 139. Joshi S Klier J Beltramo PJ Encapsulation of inorganic nanoparticles by anionic emulsion polymerization of diethyl methylene malonate for developing hybrid microparticles with tailorable composition Colloids Interfaces 2024 8 1 10 10.3390/colloids8010010 ",
  "metadata": {
    "Title of this paper": "Encapsulation of inorganic nanoparticles by anionic emulsion polymerization of diethyl methylene malonate for developing hybrid microparticles with tailorable composition",
    "Journal it was published in:": "International Journal of Nanomedicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476184/"
  }
}