{
  "title": "Paper_259",
  "abstract": "pmc BMC Cancer BMC Cancer 16 bmccanc BMC Cancer 1471-2407 BMC PMC12487571 PMC12487571.1 12487571 12487571 41034761 10.1186/s12885-025-14946-8 14946 1 Research Targeting GSTM3 for therapeutic potential in advanced prostate cancer Seven Didem didem.seven@yeditepe.edu.tr 1 Dalan Altay Burak 2 Bayrak Ömer Faruk 1 1 https://ror.org/025mx2575 grid.32140.34 0000 0001 0744 4075 Department of Medical Genetics, Yeditepe University School of Medicine, 2 https://ror.org/025mx2575 grid.32140.34 0000 0001 0744 4075 Department of Biochemistry, Yeditepe University School of Medicine, 1 10 2025 2025 25 478185 1493 27 5 2025 27 8 2025 01 10 2025 02 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Prostate cancer (PCa) represents one of the most prevalent malignancies among men worldwide. When diagnosed at an early, localized stage, PCa is generally associated with a favorable prognosis and is often amenable to curative treatment modalities. However, the management of advanced PCa continues to pose significant therapeutic challenges despite the availability of conventional treatment modalities such as androgen deprivation therapy (ADT), salvage radiotherapy, and systemic chemotherapy. This underscores the urgent need to identify novel molecular targets that can enhance therapeutic efficacy and improve clinical outcomes in advanced disease. Glutathione S-transferase mu 3 (GSTM3), a detoxification enzyme involved in redox regulation and cellular homeostasis, has emerged as a potential contributor to PCa progression. The present study investigates the expression profile and functional significance of GSTM3 in advanced PCa, with the aim of elucidating its role in disease pathobiology and therapeutic targeting. GSTM3 expression levels were analyzed using public datasets from GEO and UALCAN. Quantitative RT-PCR was employed to validate expression levels in DU-145 and PC-3 cell lines, as well as in tumorsphere models. GSTM3 silencing was achieved using siRNA. ROS and mtMP were measured using H2DCFDA and Rhodamine assays, respectively. The impact on the cell cycle was assessed via PI staining, apoptosis and necrosis were evaluated using flow cytometry. Analysis of previous datasets and current experimental data revealed that GSTM3 was overexpressed in advanced PCa cells. Tumorsphere models exhibited even higher GSTM3 expression compared to conventional cell lines. In GSTM3-silenced cells, mtMP increased, while ROS levels showed a slight decrease. Silencing GSTM3 also led to cell cycle arrest in the G0/G1 phase, with a significant increase in necrosis and a modest rise in apoptosis. Our findings demonstrate the functional role of GSTM3 in advanced PCa, highlighting its potential as a therapeutic target. The consistent data suggest that targeting GSTM3 could offer new avenues for PCa treatment. Keywords Prostate cancer GSTM3 DNA damage Oxidative stress pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction PCa is a serious health concern for men worldwide, characterized by its complexity and increasing prevalence with age. It is most commonly diagnosed in men aged 45 to 60, with the incidence rising sharply in those over 65 years old [ 1 2 3 4 5 6 PCa commonly metastasis to specific sites within the body such as bone, brain, lymph nodes and lung. Recent data indicate a significant upward trend in the incidence of metastatic prostate cancer (mPCa) over the past decade. Between 2008 and 2016, the incidence of mPCa rose by 72%, contrasting with a 37% decline in the incidence of low-risk PCa during the same period [ 7 8 Treatment strategies for regional PCa include active surveillance, radical prostatectomy and ablative radiotherapy [ 9 10 The Glutathione S-transferase mu 3 (GSTM3) gene, a member of the GST family, plays a pivotal role in the detoxification of carcinogens [ 11 12 The expression level of the GSTM3 gene varies significantly across different cancer types, reflecting its complex role in tumor biology. Low GSTM3 expression has been reported in several cancers, including esophageal squamous cell carcinoma [ 13 14 15 16 17 18 19 20 Material methods GSTM3 gene expression across multiple cancers To determine GSTM3 gene expression across multiple cancers, we used a web based tool, Correlation AnalyzeR. Correlation AnalyzeR was run with default parameters. Single gene section was used to profile the GSTM3 level in multiple cancers. The analysis integrates key metrics such as log2 fold change, base mean and statistical significance obtained from differential expression gene (DEG) analysis. The corrplot package of the analysis leads to visualization of the results [ 21 Prostate cancer dataset and Geo2R analysis To identify the genes accountable for the development of PCa, we obtained two distinct datasets from the GEO database. The array GSE200879 GSE210205 GEO2R is an analytical tool designed to examine gene expression data retrieved from the GEO database. It is particularly valuable for conducting comparative analyses of gene expression across different experimental conditions or groups. Using GEO2R, we employed DEG analysis to identify differentially expressed genes in tumor cells compared with benign control cells, with a false discovery rate of 0.001. The tool’s instructions were followed using default parameters, which involved using raw counts to assess gene expression through DeSeq2, with adjustments made for sequencing depth and RNA composition variability by standardizing median ratios. Normalization for sequence depth had a negligible effect on the samples derived from a particular study. The analysis incorporated volcano plots. The volcano plot displays differentially expressed genes by correlating the statistical significance of changes (the negative logarithm of the p-value, expressed as -log10(p value) with the magnitude of gene expression change (the logarithm base 2 of the fold change, or log2(fold change)), thereby providing an intuitive representation of genes with both statistical significance and substantial expression variations. The genes exhibiting differential expression were pinpointed by filtering the expression data, with an adjusted p-value threshold set at < 0.001 and a log2 fold change of ≥ 0.5, utilising default parameters and the findings of previous studies, as well as a consideration of the size of the resultant gene set identified as differentially expressed between tumor and benign cells. To evaluate the expression pattern of GSTM3 across various cancer types, we utilized the UALCAN online database ( http://ualcan.path.uab.edu Cell culture The DU145 cell line, derived from brain metastatic site and the PC3 cell line, representing bone metastatic PCa whereas the PNT1A cells, which are non-tumorigenic prostate epithelial cells, were cultured in RPMI medium. All cell lines were regularly confirmed to be mycoplasma free. Cells were maintained in RPMI medium supplemented with 10% FBS and 1% Penicillin-Streptomycin, and incubated at 37°C in a 5% CO2 atmosphere. The medium was refreshed three times a week, and cells were passaged via trypsinization upon reaching 80% confluence. Sphere formation assay To evaluate the sphere-forming potential of PCa cells, single-cell suspensions were prepared, and 15,000 cells were seeded well in by using 24 well ultra low attachment plates (Corning Inc., Corning, NY, USA). The cells were cultured in RPMI medium supplemented with 10 ng/mL basic fibroblast growth factor (bFGF) and 10 ng/mL epidermal growth factor (EGF) (GIBCO, USA), 2% B27 supplement (GIBCO, USA), 1% N2 supplement (GIBCO, USA), and 1% penicillin-streptomycin. The spheroids were incubated for 7 days and subsequently imaged. The cell pellet was then collected for RNA isolation. SiRNA transfection siRNA transfection was applied based on the manufacturer’s protocol. DU145 and PC3 cells were transfected with 10 nM GSTM3-specific siRNAs (Catalog Number: 4392420, ID: s6271) or control siRNA (Catalog Number: 4390847) (Ambion/Applied Biosystems) through Lipofectamine (Invitrogen) in OPTI-MEM medium (Gibco). The efficiency of gene silencing was assessed 48 h post-transfection to evaluate the functional effects of the knockdown. Cell viability Cell viability was assessed using the MTS assay. CTRL siRNA and GSTM3-silenced cells were placed in 96-well plates at 2000 cells per well and incubated at 37°C overnight. After 24–48–72 h of treatment, MTS solution was added to each well (CellTiter 96 ® RNA isolation and cDNA synthesis The extraction of total RNA from each cell pellet was meticulously performed using the TRIzol Reagent (Invitrogen, Life Technologies), adhering rigorously to the manufacturer’s protocol to ensure consistency and reliability. The purity and concentration of the extracted RNA were then evaluated with precision using the NanoDrop ND-1000 spectrophotometer, Subsequently, cDNA synthesis was carried out with 1 µg of total RNA, carefully reverse transcribed in a 20 µL reaction volume. This process utilized the High Capacity cDNA Reverse Transcription Kit (Applied Biosystems, Rotkreuz, Switzerland) following the provided guidelines. Quantitative real-time PCR (qPCR) analysis Quantitative PCR was performed using TaqMan Gene Expression Assays and TaqMan Universal PCR Master Mix (Applied Biosystems) on a StepOne Plus Real-Time PCR System (Applied Biosystems). The cycling conditions were as follows: 50°C for 2 min, 95°C for 10 min, followed by 40 cycles of 95°C for 15 s and 60°C for 1 min. Based on initial observations of mitochondrial membrane potential and ROS levels, GPX4 gene expression was evaluated to investigate whether antioxidant response pathways were activated following GSTM3 silencing. GPX4, a key regulator of lipid peroxidation and ferroptosis, was selected due to its known role in redox homeostasis and its potential functional relationship with GSTM3. GSTM3 (Assay ID: Hs00356079_m1), GPX4 (Assay ID: Hs00989766_g1), ACTB (Assay ID: Hs99999903_m1) as the endogenous control were used in the study. Relative gene expression levels were calculated using the ΔΔCt method. All reactions were performed in triplicate, and expression data were normalized to ACTB. Determination of ROS levels Intracellular reactive oxygen species (ROS) levels were assessed using the oxidative conversion of the cell-permeable probe 2′,7′-dichlorofluorescein diacetate (H2DCFDA) (Thermo Fisher Scientific, USA), which is measured by flow cytometer. Cells (1 × 10⁵ per well) were seeded in 6-well plates and allowed to adhere overnight. After rinsing with PBS, cells were incubated with 10 µM H2DCFDA for 30 min in the dark at 37°C. Following incubation, cells were detached, washed with PBS, and analyzed for DCF fluorescence using a BD FACS Aria III flow cytometer with excitation at 488 nm and emission at 535 nm. Detection of mitochondrial membrane potential MtMP (mitochondrial membrane potential) was utilized using a cationic dye, Rhodamine 123. 10⁵ per well cells were seeded in 6-well plates. Prior to and following treatment, cells were rinsed with PBS. Subsequently, cells were incubated with 10 µM Rhodamine 123 for 30 min in the dark at 37°C. After the incubation, cells were detached and washed with PBS. Mitochondrial membrane potential was then quantified by measuring the fluorescence intensity of Rhodamine 123 in the cells using a BD FACSAria III flow cytometer, with an excitation wavelength of 507 nm and emission wavelength of 523 nm. Cell apoptosis assay In order to investigate the potential role of GSTM3 in apoptosis, an Apoptosis and Necrosis Kit (Abcam) was utilized in accordance with the manufacturers instructions. Briefly, prostate cells were harvested and centrifuged at 200 × g for 5 min to collect the cell pellet. The cells were then resuspended in Apoptosis Assay Buffer containing Apopxin Green Indicator to label apoptotic cells, 7-AAD to stain necrotic cells, and CytoCalcein Indicator to identify healthy, live cells. The prepared samples were incubated in a dark environment for 60 min at room temperature to allow optimal staining. Following incubation, the samples were analyzed using a flow cytometer. Apoptotic cells were detected based on fluorescence at excitation/emission wavelengths of 490/525 nm, necrotic cells at 546/647 nm, and live cells at 405/450 nm. Cell cycle analysis 1 × 10⁵ cells were seeded per well in 6 well plates and placed incubator to allow attachment. Cells were centrifuged at 300 × g for 5 min, and the supernatant was discarded. The cell pellet was resuspended in PBS and fixed in 70% ice-cold ethanol for at least 2 h at 4°C or overnight. Fixed cells were then washed twice with PBS to remove excess ethyl alcohol. The fixated cells were resuspended in PBS and treated with RNase A (50 µg/mL) for 30 min at 37°C to remove RNA interference. After incubation, cells were stained with Propidium Iodide (PI) (50 µg/mL) for 30 min at room temperature in a dark room. A minimum of 10,000 events for each sample were counted. The DNA content of the cells was assessed by measuring the fluorescence emitted from PI at an excitation wavelength of 488 nm and emission wavelength of 617 nm. The flow cytometer data was analyzed using ModFit software, and the cell cycle distribution were determined. DNA damage was assessed by quantifying the sub-G1 cell population using flow cytometry with propidium iodide (PI) staining, which serves as an indicator of DNA fragmentation. Statistical analysis All statistical analyses were performed using the either the R programme with appropriate standard packages or Graphpad. Group comparisons were carried out using one-way ANOVA followed by Tukey’s post hoc test for multiple comparisons, or unpaired t-tests where applicable. Statistical significance was applied at a threshold of p Results Expression of GSTM3 levels in prostate cancer A significant elevation in GSTM3 expression was detected in various cancers compared to normal tissues, including those of the pancreas, brain, respiratory system, liver, bone, and prostate (Fig. 1 GSE210205 GSE200879 2 GSE210205 GSE200879 p 3 4 5 5  Fig. 1 Expression of GSTM3 in various cancers compared to healthy tissues  Fig. 2 The volcano plots illustrate the differential gene expression profiles of two transcriptome datasets. A GSE210205 B GSE200879 p  Fig. 3 Expression levels of GSTM3 across different datasets: data are presented as TPM (Transcripts Per Million) read counts. A GSE210205 B GSE200879  Fig. 4 Expression of GSTM3 in cell lines. High level of GSTM3 is observed in PC3 and DU-145 cell lines compared to the PNT1A.(*: p p  Fig. 5 Tumorsphere formation from prostate cancer cells and GSTM3 expression levels. A B Functional effects of GSTM3 silencing in prostate cancer The functional role of the GSTM3 gene was also investigated in PCa. To do so, we utilized gene-specific siRNA to knockdown its expression. This resulted in a significant reduction of GSTM3 levels in the silenced cell lines, as shown in Fig. 6 6 7 8 9 10 10 11  Fig. 6 Silencing GSTM3 gene expression. A B p p  Fig. 7 MtMP in GSTM3- Silenced Cells. GSTM3-silenced prostate cancer cells exhibit a significant increase in mitochondrial membrane potential (*: p  Fig. 8 ROS Levels in Silenced Cells. GSTM3-silenced cells show a decrease in ROS levels  Fig. 9 GPX4 mRNA expression following GSTM3 knockdown (KD) in PCa cells  Fig. 10 Cell cycle analysis of prostate cancer cells. A B p p  Fig. 11 Impact of GSTM3 silencing on apoptosis. A rise in the apoptotic cell population following GSTM3 silencing. The data reveals that silencing GSTM3 leads to an increase in both early and late apoptotic cells, as indicated by quadrants Q1 and Q2, respectively and Q3 highlights the proportion of necrotic cells. Discussion In this study, we aimed to investigate the significance of the GSTM3 gene in advanced PCa. To explore its expression, we leveraged metadata that highlighted the expression levels of GSTM3 across multiple cancers and their corresponding healthy tissues. Additionally, two datasets derived from the Gene Expression Omnibus (GEO) were analyzed, both of which corroborated that PCa tissues with high Gleason scores and metastatic PCa cell lines exhibited significantly elevated GSTM3 expression compared to their healthy tissue or cell line counterparts. Previous studies provide further context for our findings. For instance, a comparative analysis demonstrated that African American men exhibited significantly higher GSTM3 expression levels compared to other populations [ 22 20 23 The reduction of the expression of the GSTM3 gene significantly impacted reduced cell viability, with pronounced effects being observed especially in PC3 cells within 72 h, exhibiting a time-dependent pattern. The temporal nature of this response suggests that GSTM3 plays a critical role in maintaining cellular survival over time, potentially through mechanisms involving cell cycle regulation or stress response pathways. Literature research revealed that a similar trend was observed in T98G brain tumor cells, where GSTM3 knockdown not only reduced cell viability but also enhanced sensitivity to temozolomide. This finding highlights the potential dual role of GSTM3 in tumor cell survival. The increased sensitivity to temozolomide suggests that GSTM3 may influence pathways involved in DNA repair or drug metabolism, making it a promising target for combination therapies aimed at overcoming chemoresistance in aggressive cancers [ 24 18 25 26 25 Cell cycle analysis revealed that silencing the GSTM3 gene led to G0/G1 cell cycle arrest, with a significant increase in DNA damage. Although GPX4 levels were elevated as a compensatory defense mechanism, this upregulation appears insufficient to mitigate the observed DNA damage. Supporting our findings, previous studies have demonstrated that among the GST family members, GSTM3 plays a pivotal role in protecting cells from electrophilic DNA damage by catalyzing the conjugation of reactive oxygen species (ROS) with glutathione [ 14 27 28 13 25 29 30 Silencing of GSTM3 in advanced PCa cells revealed multifaceted downstream effects that implicate this gene in critical cellular processes beyond detoxification. Notably, the observed increase in mtMP despite a reduction in ROS levels suggests a decoupling of mitochondrial activity and oxidative stress, potentially driven by a compensatory upregulation of GPX4. As a key antioxidant enzyme involved in lipid peroxide detoxification and ferroptosis regulation, GPX4 induction may represent an adaptive mechanism to buffer redox imbalance in the absence of GSTM3 [ 18 27 Most studies on GSTM3 have focused on its genetic polymorphisms. However, its expression and functional significance in PCa warrant further research. Our findings underscore GSTM3 as a critical regulator of oxidative stress, mitochondrial function, and cell death pathways in PCa cells. These results position GSTM3 as a pivotal factor in maintaining cellular homeostasis and suggest its potential as a therapeutic target in PCa. Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Authors’ contributions Conceptualization: DS, Methodology: DS, Formal analysis and investigation: DS; Writing - original draft preparation: DS, Writing - review and editing: DS, ABD, ÖFB. Funding This research was supported by Yeditepe Research Funding. Data availability The datasets used and/or analysed during the current study are available from the corresponding author on reasonable request. Declarations Ethics approval and consent to participate This study utilized commercially available cell lines; therefore, no ethical approval was required. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Rawla P Epidemiology of Pmtmptate cancer World J Oncol 2019 10 63 10.14740/wjon1191 31068988 PMC6497009 Rawla P. Epidemiology of Pmtmptate cancer. World J Oncol. 2019;10:63. 31068988 10.14740/wjon1191 PMC6497009 2. Lin J Nousome D Jiang J Five-year survival of patients with late-stage prostate cancer: comparison of the military health system and the US general population Br J Cancer 2023 128 1070 6 10.1038/s41416-022-02136-3 36609596 PMC10006403 Lin J, Nousome D, Jiang J, et al. Five-year survival of patients with late-stage prostate cancer: comparison of the military health system and the US general population. Br J Cancer. 2023;128:1070–6. 36609596 10.1038/s41416-022-02136-3 PMC10006403 3. Cruz-Lebrón A Faiez TS Hess MM Sfanos KS Diet and the microbiome as mediators of prostate cancer risk, progression, and therapy response Urol Oncol Semin Orig Investig 2025 10.1016/j.urolonc.2024.12.001 39757039 Cruz-Lebrón A, Faiez TS, Hess MM, Sfanos KS. Diet and the microbiome as mediators of prostate cancer risk, progression, and therapy response. Urol Oncol Semin Orig Investig. 2025. 10.1016/j.urolonc.2024.12.001. 10.1016/j.urolonc.2024.12.001 39757039 4. Stopsack KH Vijai J Conry M Germline DNA damage repair variants and prognosis of patients with high-risk or metastatic prostate cancer Clin Cancer Res 2025 31 1 122 9 10.1158/1078-0432.CCR-24-2483 39450704 PMC12407385 Stopsack KH, Vijai J, Conry M, et al. Germline DNA damage repair variants and prognosis of patients with high-risk or metastatic prostate cancer. Clin Cancer Res. 2025;31(1):122–9. 39450704 10.1158/1078-0432.CCR-24-2483 PMC12407385 5. Williams IS McVey A Perera S Modern paradigms for prostate cancer detection and management Med J Aust 2022 217 424 33 10.5694/mja2.51722 36183329 PMC9828197 Williams IS, McVey A, Perera S, et al. Modern paradigms for prostate cancer detection and management. Med J Aust. 2022;217:424–33. 10.5694/mja2.51722. 36183329 10.5694/mja2.51722 PMC9828197 6. Sandhu S, Moore CM, Chiong E et al. SG Williams Prostate cancer. 2021;398. 10.1016/S0140-6736(21)00950-8. 10.1016/S0140-6736(21)00950-8 34370973 7. Weiner AB Matulewicz RS Eggener SE Schaeffer EM Increasing incidence of metastatic prostate cancer in the united States (2004–2013) Prostate Cancer Prostatic Dis 2016 19 395 7 10.1038/pcan.2016.30 27431496 Weiner AB, Matulewicz RS, Eggener SE, Schaeffer EM. Increasing incidence of metastatic prostate cancer in the united States (2004–2013). Prostate Cancer Prostatic Dis. 2016;19:395–7. 27431496 10.1038/pcan.2016.30 8. Devarajan N Tumor hypoxia: the major culprit behind cisplatin resistance in cancer patients Crit Rev Oncol-Hematol 2021 162 103327 10.1016/j.critrevonc.2021.103327 33862250 Devarajan N. Tumor hypoxia: the major culprit behind cisplatin resistance in cancer patients. Crit Rev Oncol-Hematol. 2021;162:103327. 33862250 10.1016/j.critrevonc.2021.103327 9. Wasim S Park J Nam S Kim J Review of current treatment intensification strategies for prostate cancer patients Cancers 2023 15 5615 10.3390/cancers15235615 38067321 PMC10705205 Wasim S, Park J, Nam S, Kim J. Review of current treatment intensification strategies for prostate cancer patients. Cancers. 2023;15:5615. 38067321 10.3390/cancers15235615 PMC10705205 10. Sekhoacha M Riet K Motloung P Prostate cancer review: genetics, diagnosis, treatment options, and alternative approaches Molecules 2022 27 5730 10.3390/molecules27175730 36080493 PMC9457814 Sekhoacha M, Riet K, Motloung P, et al. Prostate cancer review: genetics, diagnosis, treatment options, and alternative approaches. Molecules. 2022;27:5730. 36080493 10.3390/molecules27175730 PMC9457814 11. Li D, Gao Q, Xu L, Pang S, Liu Z, Wang C et al. Characterization of glutathione S-transferases in the detoxification of metolachlor in two maize cultivars of differing herbicide tolerance. Pestic Biochem Physiol. 2017;143:265-71. 10.1016/j.pestbp.2016.12.003 29183603 12. Shiota M Fujimoto N Itsumi M Gene polymorphisms in antioxidant enzymes correlate with the efficacy of androgen-deprivation therapy for prostate cancer with implications of oxidative stress Ann Oncol 2017 28 569 75 10.1093/annonc/mdw646 27993795 Shiota M, Fujimoto N, Itsumi M, et al. Gene polymorphisms in antioxidant enzymes correlate with the efficacy of androgen-deprivation therapy for prostate cancer with implications of oxidative stress. Ann Oncol. 2017;28:569–75. 27993795 10.1093/annonc/mdw646 13. Yang F Wen J Luo K Fu J Low GSTM3 expression is associated with poor disease-free survival in resected esophageal squamous cell carcinoma Diagn Pathol 2021 16 10 10.1186/s13000-021-01069-4 33482859 PMC7821639 Yang F, Wen J, Luo K, Fu J. Low GSTM3 expression is associated with poor disease-free survival in resected esophageal squamous cell carcinoma. Diagn Pathol. 2021;16:10. 10.1186/s13000-021-01069-4. 33482859 10.1186/s13000-021-01069-4 PMC7821639 14. Wang S Yang J You L GSTM3 function and polymorphism in cancer: emerging but promising CMAR Volume 2020 12 10377 88 10.2147/CMAR.S272467 PMC7585806 33116892 Wang S, Yang J, You L, et al. GSTM3 function and polymorphism in cancer: emerging but promising. CMAR Volume. 2020;12:10377–88. 10.2147/CMAR.S272467. 10.2147/CMAR.S272467 PMC7585806 33116892 15. Tan AC Ashley DM López GY Management of glioblastoma: state of the art and future directions CA Cancer J Clin 2020 70 299 312 10.3322/caac.21613 32478924 Tan AC, Ashley DM, López GY, et al. Management of glioblastoma: state of the art and future directions. CA Cancer J Clin. 2020;70:299–312. 10.3322/caac.21613. 32478924 10.3322/caac.21613 16. Meding S Balluff B Elsner M Tissue-based proteomics reveals FXYD3, S100A11 and GSTM3 as novel markers for regional lymph node metastasis in colon cancer J Pathol 2012 228 459 70 10.1002/path.4021 22430872 Meding S, Balluff B, Elsner M, et al. Tissue-based proteomics reveals FXYD3, S100A11 and GSTM3 as novel markers for regional lymph node metastasis in colon cancer. J Pathol. 2012;228:459–70. 10.1002/path.4021. 22430872 10.1002/path.4021 17. Mitra AP Pagliarulo V Yang D Generation of a concise gene panel for outcome prediction in urinary bladder cancer JCO 2009 27 3929 37 10.1200/JCO.2008.18.5744 PMC2799152 19620494 Mitra AP, Pagliarulo V, Yang D, et al. Generation of a concise gene panel for outcome prediction in urinary bladder cancer. JCO. 2009;27:3929–37. 10.1200/JCO.2008.18.5744. 10.1200/JCO.2008.18.5744 PMC2799152 19620494 18. Lin J-H Tu S-H Chen L-C Oestrogen receptor-regulated glutathione S-transferase mu 3 expression attenuates hydrogen peroxide-induced cytotoxicity, which confers tamoxifen resistance on breast cancer cells Breast Cancer Res Treat 2018 172 45 59 10.1007/s10549-018-4897-5 30054830 Lin J-H, Tu S-H, Chen L-C, et al. Oestrogen receptor-regulated glutathione S-transferase mu 3 expression attenuates hydrogen peroxide-induced cytotoxicity, which confers tamoxifen resistance on breast cancer cells. Breast Cancer Res Treat. 2018;172:45–59. 30054830 10.1007/s10549-018-4897-5 19. Li Y-S Liu M Nakata Y Tang H-B β-catenin accumulation in nuclei of hepatocellular carcinoma cells up-regulates glutathione-s-transferase M3 mRNA World J Gastroenterology: WJG 2011 17 1772 10.3748/wjg.v17.i13.1772 PMC3072644 21483640 Li Y-S, Liu M, Nakata Y, Tang H-B. β-catenin accumulation in nuclei of hepatocellular carcinoma cells up-regulates glutathione-s-transferase M3 mRNA. World J Gastroenterology: WJG. 2011;17:1772. 10.3748/wjg.v17.i13.1772 PMC3072644 21483640 20. Stevens C Hightower A Buxbaum SG Genomic, epigenomic, and transcriptomic signatures of prostate cancer between African American and European American patients Front Oncol 2023 13 1079037 10.3389/fonc.2023.1079037 36937425 PMC10018228 Stevens C, Hightower A, Buxbaum SG, et al. Genomic, epigenomic, and transcriptomic signatures of prostate cancer between African American and European American patients. Front Oncol. 2023;13:1079037. 36937425 10.3389/fonc.2023.1079037 PMC10018228 21. Miller HE Bishop AJR Correlation analyzer: functional predictions from gene co-expression correlations BMC Bioinformatics 2021 22 206 10.1186/s12859-021-04130-7 33879054 PMC8056587 Miller HE, Bishop AJR. Correlation analyzer: functional predictions from gene co-expression correlations. BMC Bioinformatics. 2021;22:206. 10.1186/s12859-021-04130-7. 33879054 10.1186/s12859-021-04130-7 PMC8056587 22. Rayford W Beksac AT Alger J Comparative analysis of 1152 African-American and European-American men with prostate cancer identifies distinct genomic and immunological differences Commun Biol 2021 4 670 10.1038/s42003-021-02140-y 34083737 PMC8175556 Rayford W, Beksac AT, Alger J, et al. Comparative analysis of 1152 African-American and European-American men with prostate cancer identifies distinct genomic and immunological differences. Commun Biol. 2021;4:670. 34083737 10.1038/s42003-021-02140-y PMC8175556 23. Rodrigues RM De Kock J Branson S Human skin-derived stem cells as a novel cell source for in vitro hepatotoxicity screening of pharmaceuticals Stem Cells Dev 2014 23 44 55 10.1089/scd.2013.0157 23952781 PMC3870603 Rodrigues RM, De Kock J, Branson S, et al. Human skin-derived stem cells as a novel cell source for in vitro hepatotoxicity screening of pharmaceuticals. Stem Cells Dev. 2014;23:44–55. 10.1089/scd.2013.0157. 23952781 10.1089/scd.2013.0157 PMC3870603 24. Cheng S-Y Chen N-F Wen Z-H Glutathione S-transferase M3 is associated with Glycolysis in intrinsic temozolomide-resistant glioblastoma multiforme cells Int J Mol Sci 2021 22 7080 10.3390/ijms22137080 34209254 PMC8268701 Cheng S-Y, Chen N-F, Wen Z-H, et al. Glutathione S-transferase M3 is associated with Glycolysis in intrinsic temozolomide-resistant glioblastoma multiforme cells. Int J Mol Sci. 2021;22:7080. 34209254 10.3390/ijms22137080 PMC8268701 25. Kang Z Wang P Wang B Echinatin suppresses cutaneous squamous cell carcinoma by targeting GSTM3-mediated ferroptosis Phytomedicine 2024 10.1016/j.phymed.2024.155752 38833947 Kang Z, Wang P, Wang B, et al. Echinatin suppresses cutaneous squamous cell carcinoma by targeting GSTM3-mediated ferroptosis. Phytomedicine. 2024. 10.1016/j.phymed.2024.155752. 38833947 10.1016/j.phymed.2024.155752 26. Kumar B Koul S Khandrika L Oxidative stress is inherent in prostate cancer cells and is required for aggressive phenotype Cancer Res 2008 68 1777 85 10.1158/0008-5472.CAN-07-5259 18339858 Kumar B, Koul S, Khandrika L, et al. Oxidative stress is inherent in prostate cancer cells and is required for aggressive phenotype. Cancer Res. 2008;68:1777–85. 18339858 10.1158/0008-5472.CAN-07-5259 27. Dusinska M Staruchova M Horska A Are glutathione S transferases involved in DNA damage signalling? Interactions with DNA damage and repair revealed from molecular epidemiology studies Mutat Res-Fund Mol Mech Mutagen 2012 736 130 7 10.1016/j.mrfmmm.2012.03.003 22450146 Dusinska M, Staruchova M, Horska A, et al. Are glutathione S transferases involved in DNA damage signalling? Interactions with DNA damage and repair revealed from molecular epidemiology studies. Mutat Res-Fund Mol Mech Mutagen. 2012;736:130–7. 10.1016/j.mrfmmm.2012.03.003 22450146 28. Li G Cai Y Wang C LncRNA GAS5 regulates the proliferation, migration, invasion and apoptosis of brain glioma cells through targeting GSTM3 expression. The effect of LncRNA GAS5 on glioma cells J Neurooncol 2019 143 525 36 10.1007/s11060-019-03185-0 31172354 Li G, Cai Y, Wang C, et al. LncRNA GAS5 regulates the proliferation, migration, invasion and apoptosis of brain glioma cells through targeting GSTM3 expression. The effect of LncRNA GAS5 on glioma cells. J Neurooncol. 2019;143:525–36. 31172354 10.1007/s11060-019-03185-0 29. Chen Y Feng Y Lin Y GSTM3 enhances radiosensitivity of nasopharyngeal carcinoma by promoting radiation-induced ferroptosis through USP14/FASN axis and GPX4 Br J Cancer 2024 130 755 68 10.1038/s41416-024-02574-1 38228715 PMC10912431 Chen Y, Feng Y, Lin Y, et al. GSTM3 enhances radiosensitivity of nasopharyngeal carcinoma by promoting radiation-induced ferroptosis through USP14/FASN axis and GPX4. Br J Cancer. 2024;130:755–68. 38228715 10.1038/s41416-024-02574-1 PMC10912431 30. Chen T Jinlin D Wang F GSTM3 deficiency impedes DNA mismatch repair to promote gastric tumorigenesis via CAND1/NRF2-KEAP1 signaling Cancer Lett 2022 538 215692 10.1016/j.canlet.2022.215692 35487311 Chen T, Jinlin D, Wang F, et al. GSTM3 deficiency impedes DNA mismatch repair to promote gastric tumorigenesis via CAND1/NRF2-KEAP1 signaling. Cancer Letters. 2022;538:215692. 35487311 10.1016/j.canlet.2022.215692 ",
  "metadata": {
    "Title of this paper": "GSTM3 deficiency impedes DNA mismatch repair to promote gastric tumorigenesis via CAND1/NRF2-KEAP1 signaling",
    "Journal it was published in:": "BMC Cancer",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487571/"
  }
}