{
  "title": "Paper_129",
  "abstract": "pmc Ann Med Ann Med 3997 annmed Annals of Medicine 0785-3890 1365-2060 Taylor & Francis PMC12490351 PMC12490351.1 12490351 12490351 41033840 10.1080/07853890.2025.2568117 2568117 1 Version of Record Review Article Emergency Medicine Initial management and disposition of metastatic spinal cord compression in the emergency department: a review of the literature E. Singer et al. https://orcid.org/0009-0006-3390-6556 Singer Emad Conceptualization Methodology Resources Visualization Writing – original draft  a Elsayem Ahmed Conceptualization Writing – review & editing  a Nassif Tracy Conceptualization Writing – review & editing  b Rodriguez Christopher Resources Writing – original draft  a Zoghbi Marianne Conceptualization Resources Writing – original draft  c Dagher Jim Conceptualization Resources Writing – original draft  d Yammine Nicole Conceptualization Resources  d Kamal Mona Resources Writing – original draft  e Cruz Carreras Maria T. Conceptualization Writing – review & editing  a Vu Trien Conceptualization Resources Writing – original draft  a https://orcid.org/0000-0003-0063-8461 Qdaisat Aiham Conceptualization Resources Visualization Writing – original draft  a Yeung Sai-Ching J. Conceptualization Resources Supervision Visualization Writing – review & editing  a Chaftari Patrick Conceptualization Resources Supervision Visualization Writing – review & editing  a a Department of Emergency Medicine, The University of Texas MD Anderson Cancer Center Houston TX USA b Department of Radiation Oncology, Beaumont University Hospital Royal Oak MI USA c Department of Sarcoma Medical Oncology, The University of Texas MD Anderson Cancer Center Houston TX USA d Faculty of Medicine, Saint Joseph University of Beirut Beirut Lebanon e College of Medicine, Ain Shams University Cairo Egypt CONTACT Patrick Chaftari pchaftari@mdanderson.org Sai-Ching J. Yeung syeung@mdanderson.org Department of Emergency Medicine, The University of Texas MD Anderson Cancer Center Houston TX 77030 USA 1 10 2025 2025 57 1 476479 2568117 01 10 2025 03 10 2025 03 10 2025 14 5 2025 1 8 2025 23 9 2025 KnowledgeWorks Global Ltd. 1 10 2025 published online in a building issue 1 10 2025 © 2025 The Author(s). Published by Informa UK Limited, trading as Taylor & Francis Group 2025 The Author(s) https://creativecommons.org/licenses/by-nc/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution-NonCommercial License ( http://creativecommons.org/licenses/by-nc/4.0/ Abstract Background Metastatic spinal cord compression (MSCC) is a serious medical emergency that can complicate the course of various malignancies, including prostate, breast, and lung cancers. Appropriate evaluation and effective management of MSCC early in the emergency department are necessary to minimize neurologic deterioration and optimize the trajectory of patient recovery. Methods This literature review examines and summarizes current evidence surrounding the emergency department approach for timely recognition, initial evaluation, and management of MSCC. Results A comprehensive clinical history, nerve root or spinal cord clinical examination, and urgent imaging procedures are fundamental for early diagnosis and initial management. The urgency of intervention depends on the rate of onset of motor deficits, which can progress during work-up. Patients should be stratified into subgroups: those requiring immediate surgery, those who can be treated with radiotherapy, and those who may be discharged for outpatient care. Some patients can be observed for 24 h to adjust the medical and/or surgical treatment. In most cases, systemic steroid administration with dexamethasone should be started immediately upon diagnosis, followed by a tapering course of oral dexamethasone. Selected patients should undergo surgical decompression with or without stabilization. A multidisciplinary approach involving both spinal surgeons and radiation oncologists is essential for diagnosis and stratification. Conclusion For patients with MSCC, early and effective evaluation and intervention in the emergency department, through a coordinated multidisciplinary effort, are vital to optimizing patient outcomes. Keywords Spinal cord compression metastatic MSCC emergency cancer diagnosis evaluation management steroid oncology pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Background Metastatic spinal cord compression (MSCC) is a serious condition that can complicate the course of various malignancies. While spinal cord compression lacks a standardized definition, MSCC usually presents with several neoplastic deposits in the vertebral column or the epidural space that cause pressure on the spinal cord. Prostate, breast, and pulmonary malignancies are well known for their predilection for spinal involvement and together constitute 45%-60% of MSCC instances [ 1 2 Given the complexity of MSCC management in the emergency room, the appropriate disposition of patients with MSCC is essential for timely and comprehensive care. The disposition depends on the severity of a patient’s clinical presentation. Stable patients with strong home support can opt for outpatient care with follow-up. Some may need up to 24 h of clinic observation. Severe cases require urgent inpatient admission and potential surgery. Consultative services from radiation oncology or neurosurgery may be appropriate to determine the best treatment pathway between radiotherapy, surgical de-compression, or a combined treatment approach. Dexamethasone can also aid in the acute setting by decreasing spinal cord oedema and associated symptoms, improving patient comfort and quality of life. The degree of involvement within the epidural space and the extent of spinal cord displacement exhibit variability, and these considerations significantly influence treatment choices [ 3 2. Incidence The prevalence of MSCC among cancer patients varies between 0.2% and 7.9%, depending on the cancer type [ 1 2 4 1 2 4 5 5 5 3. Etiology and pathophysiology MSCC transpires due to hematogenous dissemination, initially affecting the vertebral body and subsequently encroaching upon the epidural space. This mechanism accounts for up to 85% of MSCC cases [ 1 6 1 7 8 9 The pathophysiology of MSCC is based on mechanical compression of the spinal cord, which triggers a sequence of secondary events. First, this compression raises venous hypertension and causes oedema in the white matter. These processes further compromise the arterial blood supply, eventually progressing to infarction of the cord parenchyma, leading to cellular death [ 1 7 1 4. Medical history The earliest possible intervention is crucial for a positive outcome for MSCC and requires an understanding of the range of presentations. Acute spinal cord compression caused by metastases has a variable and non-specific presentation, and patients might have atypical symptoms such as radicular pain, motor weakness, sensory disturbance, and autonomic dysfunction [ 10 11 10 11 Spinal cord metastases often present insidiously, with non-specific axial stiffness and pain, especially in patients with an underlying malignancy history. Progressive back pain, particularly at night or with recumbency, could be suggestive of vertebral metastasis. Radicular pain might suggest nerve root impingement by a metastatic tumour [ 10 11 10 11 10 11 5. Physical examination Although a thorough physical examination is integral to the initial evaluation of spinal cord compression, clinical findings can be nonspecific or absent, particularly in early or acute presentations. Combining physical examination with a high index of clinical suspicion and timely imaging is essential to ensure prompt diagnosis and management. Findings such as radicular pain, percussion tenderness, motor asymmetry, or sensory deficits and abnormalities, although not specific, are commonly seen in MSCC [ 12 12 The American Spinal Injury Association (ASIA) impairment scale (AIS) provides a structured framework for classifying spinal cord injuries based on detailed sensory and motor neurologic examination [ 13 14 13 14 13 14 In the ED, AIS can support rapid neurologic assessment and triage, determine the extent of spinal compromise and track any deterioration or change in the neurologic status. The ASIA scale is incorporated within the neurologic component of the NOMS framework, which helps to personalize MSCC treatment by integrating neurologic impairment with tumour behaviour, spinal stability, and overall health. Together, AIS and NOMS support evidence-based triage and care planning in the ED [ 15–19 17 19–23 6. Diagnostic imaging Urgent imaging is crucial when MSCC is suspected. Magnetic resonance imaging (MRI) of the entire spine is the gold standard [ 24 1 25 26 27 28 Table 1 3 7 Table 1. MSCC 6-point grading system developed by bilsky et al. [ 3 Grade Radiographic Characteristics Grade 0 Involvement limited to bone structures. Grade 1a Epidural impingement observed, but no deformation of the thecal sac. Grade 1b Epidural impingement causing deformation of the thecal sac, without spinal cord contact. Grade 1c Deformation of the thecal sac accompanied by spinal cord abutment. Grade 2 Spinal cord compression with cerebrospinal fluid (CSF) still visible. Grade 3 Spinal cord compression with no visible CSF. When MRI is not feasible due to specific patient factors, alternatives such as X-ray myelography or computed tomography of the spine with contrast can be considered [ 29 30–33 30 7. Initial management and emergency disposition Patients diagnosed with MSCC should be broadly categorized into distinct sub-groups, each demanding a tailored approach to patient disposition. Some cases necessitate immediate surgical decompression to alleviate spinal cord compression and prevent further neurological deterioration. In contrast, others might benefit significantly from prompt initiation of radiotherapy to mitigate tumour burden and relieve associated symptoms. For those with stable neurological function and adequate home support, safe discharge with diligent outpatient follow-up and palliative care support can be appropriate, ensuring continued monitoring of symptoms and treatment response. Additionally, certain patients might warrant placement in a clinical observation unit for 24 h, allowing for close surveillance of their neurological status and response to initial therapeutic interventions, thereby facilitating timely adjustment of the management plan based on emerging clinical insights. Stratifying these patients into distinct subgroups is crucial for optimizing outcomes and ensuring the timely delivery of appropriate interventions tailored to their unique clinical needs. Figure 1 Table 2 Figure 1. Workflow for emergency management of suspected MSCC based on current practice and evidence from guidelines. Table 2. Summary of recommendations and guidelines for metastatic spinal cord compression (MSCC). Guideline Recommendation Affected level Impairment ESTRO ACROP Guidelines [ 8 Patients with single-site MSCC, <48 hours of paraplegia, and life expectancy >3 months Refer for surgical decompression, stabilization, and postoperative radiotherapy. Level 1B Grade A Patients with suspected spinal instability Seek consultation with a spinal surgeon. Level 5 Grade D All other patients Undergo urgent multidisciplinary team discussion involving radiation oncologist and spinal surgeon. Level 2a Grade B Urgently assess suspected MSCC for clinical evidence of a primary tumor Clinical evaluation for primary tumor signs. Level 2b Grade C If no known malignancy is present, pursue urgent tissue diagnosis Use blood markers, surgery, CT-guided or image-guided soft-tissue biopsy for diagnosis. Level 5 Grade D Initiate IV dexamethasone (10–16 mg) immediately after diagnostic procedures Begin intravenous dexamethasone post-diagnosis. Level 2b Grade C Follow IV dexamethasone with a tapering course of oral dexamethasone over 10–14 days Transition to oral dexamethasone with a tapering schedule. Level 2b Grade C Consider proton pump inhibitor for gastric protection when using dexamethasone, especially with NSAIDs Use a proton pump inhibitor if necessary. Level 2a Grade B NICE 2008 (UK) Guidelines [ 23 Suspected bone metastasis Evaluation within 1 week. – – Unilateral radicular pain Assessment within 1 week. – – Suspected MSCC Urgent evaluation within 24 hours, or sooner if compelling clinical necessity. – – Confirmed MSCC Initiate definitive treatment within 24 hours. – – Groenen et al. 2018 (Netherlands) Guidelines [ 24 Suspected bone metastasis with local back pain Evaluation within 2 weeks. – – Progressive unilateral radicular deficit developing over 7 days Assessment within 48 hours. – – Progressive unilateral radicular deficit developing in less than 7 days Evaluation within 24 hours. – – Suspected MSCC Urgent assessment as soon as possible, ideally within 12 hours. – – Confirmed MSCC Initiation of definitive treatment within 24 hours. – – Abbreviations: ESTRO ACROP, European Society for Radiotherapy and Oncology Advisory Committee for Radiation Oncology Practice; NICE, National Institute for Health and Care Excellence; MSCC, Metastatic spinal cord compression. MSCC is a medical emergency that requires immediate intervention to mitigate the risk of advancing neurological impairments. The urgency of intervention in cases of spinal cord compression is directly related to the rate of motor deficit development. When motor deficits evolve gradually over 7 days, it presents a more favourable scenario for retaining ambulatory function, and radiotherapy becomes a viable treatment option [ 34 34 34 Ideally, a tissue diagnosis will be established before steroid treatment begins because steroid therapy can alter cellular morphology, particularly in haematological malignancies [ 35 35 35 In general, glucocorticoids should be started for MSCC as early as possible, unless there are clear contraindications or there is diagnosis uncertainty. Following the completion of diagnostic procedures, glucocorticoids should be promptly initiated and not be postponed till after consultations, given that timely treatment can prevent functional decline, cord edema, and irreversible neurologic injury [ 20 21 36 37 19 20 36–38 19 36 37 39 40 40–42 43 Pain control related to MSCC often follows a stepwise pathway, starting with non-opioid analgesics (i.e. NSAIDs and paracetamol), mild opioids (codeine, tramadol) for mild to moderate breakthrough pain, and strong opioids (morphine, oxycodone, hydromorphone, transdermal fentanyl) for severe breakthrough pain [ 44 44 44 44 8. Frameworks for treatment decisions The NOMS (Neurologic, Oncologic, Mechanical, and Systemic) framework, mostly used in clinical practice, categorizes patients based on neurological criteria, distinguishing between low-grade (Grades 0–1) and high-grade (Grades 2–3) spinal cord compression [ 3 17 45 46 45 46 47–49 In addition to NOMS, the Spine Instability Neoplastic Score (SINS) criteria were established through expert consensus and incorporated six clinical and radiographic parameters, yielding a total score of 18. This scoring system aids in identifying patients with spinal instability, defined by a score exceeding 12, who are likely to benefit from surgical intervention [ 50 9. Role of radiotherapy and surgery Historically, surgical decompressive laminectomy was not found to be superior to RT alone for pain management and ambulation improvement in patients with MSCC [ 51–53 54 55 49 10. Prognosis Failure to promptly identify and treat MSCC can result in debilitating consequences, such as paraplegia, quadriplegia, sensory neuropathies, and impairments in bladder and bowel function, whose severity depends on the extent of spinal cord involvement. Early diagnosis and treatment are crucial for patients with acute MSCC, as delays can lead to permanent neurological damage with a low chance of recovery. The overall prognosis of MSCC is poor, with median survival ranging between 2.4 to 30 months and a one-year survival rate ranging between 12%-58% [ 56 56 57 58 11. Future directions While progress has been made in identifying optimal treatments for MSCC, unresolved questions remain, particularly for asymptomatic patients with intermediate- (Grades 1c-2) or high-grade (Grades 2–3) compression from less radiosensitive tumors. Current classification systems often categorize ESCC as low (Grades 0–1) or high grade, though some studies propose an intermediate category [ 45 59 45 59 Figure 1 12. Conclusion Metastatic spinal cord compression poses a significant challenge in the context of cancer care, demanding immediate clinical attention and precise management. Early detection and a multidisciplinary approach are the cornerstones of successful management. A prompt clinical assessment, urgent imaging, and, if necessary, tissue diagnosis play pivotal roles in shaping the course of treatment. The administration of steroids, the initiation of surgical interventions for specific cases, and the use of radiotherapy in conjunction with surgical decompression and stabilization contribute to improving patient outcomes. While the approach to treatment varies based on individual patient characteristics, the overarching goal remains preserving spinal cord function and alleviating neurological deficits. Acknowledgments The authors thank Sarah Bronson, ELS, of the Research Medical Library at the University of Texas MD Anderson Cancer Center for editing this manuscript. Disclosure statement No potential conflict of interest was reported by the authors. Data availability statement Data sharing is not applicable to this article as no new data were created or analyzed in this study. References 1 Cole JS Patchell RA. Metastatic epidural spinal cord compression Lancet Neurol 2008 7 5 459 466 10.1016/S1474-4422(08)70089-9 18420159 2 Kim JM Losina E Bono CM et al. Clinical outcome of metastatic spinal cord compression treated with surgical excision ± radiation versus radiation therapy alone: a systematic review of literature Spine (Phila Pa 1976) 2012 37 1 78 84 10.1097/BRS.0b013e318223b9b6 21629164 PMC3876411 3 Bilsky MH Laufer I Fourney DR et al. Reliability analysis of the epidural spinal cord compression scale J Neurosurg Spine 2010 13 3 324 328 10.3171/2010.3.SPINE09459 20809724 4 Loblaw DA Laperriere NJ Mackillop WJ. A population-based study of malignant spinal cord compression in Ontario Clin Oncol (R Coll Radiol) 2003 15 4 211 217 10.1016/s0936-6555(02)00400-4 12846501 5 Van den Brande R Cornips EM Peeters M et al. Epidemiology of spinal metastases, metastatic epidural spinal cord compression and pathologic vertebral compression fractures in patients with solid tumors: a systematic review J Bone Oncol 2022 35 100446 10.1016/j.jbo.2022.100446 35860387 PMC9289863 6 Pigott KH Baddeley H Maher EJ. Pattern of disease in spinal cord compression on MRI scan and implications for treatment Clin Oncol (R Coll Radiol) 1994 6 1 7 10 10.1016/s0936-6555(05)80361-9 8172840 7 Prasad D Schiff D. Malignant spinal-cord compression Lancet Oncol 2005 6 1 15 24 10.1016/S1470-2045(04)01709-7 15629272 8 Oldenburger E Brown S Willmann J et al. ESTRO ACROP guidelines for external beam radiotherapy of patients with complicated bone metastases Radiother Oncol 2022 173 240 253 10.1016/j.radonc.2022.06.002 35688398 9 Loblaw DA Laperriere NJ. Emergency treatment of malignant extradural spinal cord compression: an evidence-based guideline J Clin Oncol 1998 16 4 1613 1624 10.1200/JCO.1998.16.4.1613 9552073 10 Jarvis C Eckhardt AL. Physical examination and health assessment E-book Elsevier Health Sciences 2023 11 Cavalli F Kaye SB Hansen HH et al. Textbook of medical oncology CRC Press 2009 12 Lee SS Kim MK Sym SJ et al. Intramedullary spinal cord metastases: a single-institution experience J Neurooncol 2007 84 1 85 89 10.1007/s11060-007-9345-z 17310265 13 Rajasekaran S Jain AK Shetty AP et al. Spinal infections and trauma Jaypee Brothers Publishers 2011 14 Kirshblum S Snider B Rupp R et al. Updates of the International Standards for Neurologic Classification of Spinal Cord Injury: 2015 and 2019 Phys Med Rehabil Clin N Am 2020 31 3 319 330 10.1016/j.pmr.2020.03.005 32624097 15 Barzilai O Laufer I Yamada Y et al. Integrating evidence-based medicine for treatment of spinal metastases into a decision framework: neurologic, oncologic, mechanicals stability, and systemic disease J Clin Oncol 2017 35 21 2419 2427 10.1200/JCO.2017.72.7362 28640703 16 Barzilai O Versteeg AL Goodwin CR et al. Association of neurologic deficits with surgical outcomes and health-related quality of life after treatment for metastatic epidural spinal cord compression Cancer 2019 125 23 4224 4231 10.1002/cncr.32420 31410854 17 Laufer I Rubin DG Lis E et al. The NOMS framework: approach to the treatment of spinal metastatic tumors Oncologist 2013 18 6 744 751 10.1634/theoncologist.2012-0293 23709750 PMC4063402 18 MacLean MA Touchette CJ Georgiopoulos M Tumor AOSKF Systemic considerations for the surgical treatment of spinal metastatic disease: a scoping literature review Lancet Oncol 2022 23 7 e321 e33 10.1016/S1470-2045(22)00126-7 35772464 PMC9844540 19 Ropper AE Ropper AH. Acute spinal cord compression N Engl J Med 2017 376 14 1358 1369 10.1056/NEJMra1516539 28379788 20 Lawton AJ Lee KA Cheville AL et al. Assessment and management of patients with metastatic spinal cord compression: a multidisciplinary review J Clin Oncol 2019 37 1 61 71 10.1200/JCO.2018.78.1211 30395488 21 Rispoli R Reverberi C Targato G et al. Multidisciplinary approach to patients with metastatic spinal cord compression: a diagnostic therapeutic algorithm to improve the neurological outcome Front Oncol 2022 12 902928 10.3389/fonc.2022.902928 35747823 PMC9210572 22 Esperança-Martins M Roque D Barroso T et al. Multidisciplinary approach to spinal metastases and metastatic spinal cord compression-a new integrative flowchart for patient management Cancers (Basel) 2023 15 6 1796 10.3390/cancers15061796 36980681 PMC10046378 23 Barzilai O Fisher CG Bilsky MH. State of the art treatment of spinal metastatic disease Neurosurgery 2018 82 6 757 769 10.1093/neuros/nyx567 29481645 24 Gold M. Magnetic resonance imaging of spinal emergencies Top Magn Reson Imaging 2015 24 6 325 330 10.1097/RMR.0000000000000069 26636638 25 Colletti PM Siegel HJ Woo MY et al. The impact on treatment planning of MRI of the spine in patients suspected of vertebral metastasis: an efficacy study Comput Med Imaging Graph 1996 20 3 159 162 10.1016/0895-6111(96)00009-2 8930468 26 Cook AM Lau TN Tomlinson MJ et al. Magnetic resonance imaging of the whole spine in suspected malignant spinal cord compression: impact on management Clin Oncol (R Coll Radiol) 1998 10 1 39 43 10.1016/s0936-6555(98)80111-8 9543614 27 Eldaya RW Parsons MS Hutchins TA et al. ACR Appropriateness Criteria ® Journal of the American College of Radiology 2025 22 5 S136 S162 10.1016/j.jacr.2025.02.035 40409873 28 Shah VN Parsons MS Boulter DJ et al. ACR Appropriateness Criteria ® Journal of the American College of Radiology 2024 21 11 S504 S517 10.1016/j.jacr.2024.08.016 39488357 29 Patel DM Weinberg BD Hoch MJ. CT Myelography: clinical Indications and Imaging Findings Radiographics 2020 40 2 470 484 10.1148/rg.2020190135 32058837 30 Li KC Poon PY. Sensitivity and specificity of MRI in detecting malignant spinal cord compression and in distinguishing malignant from benign compression fractures of vertebrae Magn Reson Imaging 1988 6 5 547 556 10.1016/0730-725x(88)90129-4 3067022 31 Hagenau C Grosh W Currie M et al. Comparison of spinal magnetic resonance imaging and myelography in cancer patients J Clin Oncol 1987 5 10 1663 1669 10.1200/JCO.1987.5.10.1663 3655863 32 Carmody RF Yang PJ Seeley GW et al. Spinal cord compression due to metastatic disease: diagnosis with MR imaging versus myelography Radiology 1989 173 1 225 229 10.1148/radiology.173.1.2675185 2675185 33 Husband DJ Grant KA Romaniuk CS. MRI in the diagnosis and treatment of suspected malignant spinal cord compression Br J Radiol 2001 74 877 15 23 10.1259/bjr.74.877.740015 11227772 34 Rades D Blach M Bremer M et al. Prognostic significance of the time of developing motor deficits before radiation therapy in metastatic spinal cord compression: one-year results of a prospective trial Int J Radiat Oncol Biol Phys 2000 48 5 1403 1408 10.1016/s0360-3016(00)01408-5 11121640 35 Borenstein SH Gerstle T Malkin D et al. The effects of prebiopsy corticosteroid treatment on the diagnosis of mediastinal lymphoma J Pediatr Surg 2000 35 6 973 976 10.1053/jpsu.2000.6945 10873047 36 Sodji Q Kaminski J Willey C et al. Management of Metastatic Spinal Cord Compression South Med J 2017 110 9 586 593 10.14423/SMJ.0000000000000700 28863223 37 Simoff MJ Lally B Slade MG et al. Symptom management in patients with lung cancer: diagnosis and management of lung cancer, 3rd ed: American College of Chest Physicians evidence-based clinical practice guidelines Chest 2013 143 5 Suppl e455S e4e97 10.1378/chest.12-2366 23649452 38 Boussios S Cooke D Hayward C et al. Metastatic spinal cord compression: unraveling the diagnostic and therapeutic challenges Anticancer Res 2018 38 9 4987 4997 10.21873/anticanres.12817 30194142 39 Alcorn S Cortés ÁA Bradfield L et al. External beam radiation therapy for palliation of symptomatic bone metastases: an ASTRO Clinical Practice Guideline Pract Radiat Oncol 2024 14 5 377 397 10.1016/j.prro.2024.04.018 38788923 40 Sørensen S Helweg-Larsen S Mouridsen H et al. Effect of high-dose dexamethasone in carcinomatous metastatic spinal cord compression treated with radiotherapy: a randomised trial Eur J Cancer 1994 30a 1 22 27 10.1016/s0959-8049(05)80011-5 8142159 41 Vecht CJ Haaxma-Reiche H van Putten WL et al. Initial bolus of conventional versus high-dose dexamethasone in metastatic spinal cord compression Neurology 1989 39 9 1255 1257 10.1212/wnl.39.9.1255 2771077 42 Heimdal K Hirschberg H Slettebø H et al. High incidence of serious side effects of high-dose dexamethasone treatment in patients with epidural spinal cord compression J Neurooncol 1992 12 2 141 144 10.1007/BF00172664 1560260 43 Scarpignato C Gatta L Zullo A et al. Effective and safe proton pump inhibitor therapy in acid-related diseases - A position paper addressing benefits and potential harms of acid suppression BMC Med 2016 14 1 179 10.1186/s12916-016-0718-z 27825371 PMC5101793 44 Spratt DE Beeler WH de Moraes FY et al. An integrated multidisciplinary algorithm for the management of spinal metastases: an International Spine Oncology Consortium report Lancet Oncol 2017 18 12 e720 e30 10.1016/S1470-2045(17)30612-5 29208438 45 von Spreckelsen N Ossmann J Lenz M et al. Role of decompressive surgery in neurologically intact patients with low to intermediate intraspinal metastatic tumor burden Cancers (Basel) 2023 15 2 10.3390/cancers15020385 PMC9857075 36672334 46 Weber-Levine C Jiang K Al-Mistarehi AH et al. The role of combination surgery and radiotherapy in patients with metastatic spinal cord compression: what are the remaining grey areas? A systematic review Clin Neurol Neurosurg 2025 248 108632 10.1016/j.clineuro.2024.108632 39637710 47 Bach F Agerlin N Sørensen JB et al. Metastatic spinal cord compression secondary to lung cancer J Clin Oncol 1992 10 11 1781 1787 10.1200/JCO.1992.10.11.1781 1328552 48 Ma Y He S Liu T et al. Quality of life of patients with spinal metastasis from cancer of unknown primary origin: a longitudinal study of surgical management combined with postoperative radiation therapy JBJS 99 19 1629 1639 10.2106/JBJS.16.00286 28976427 49 Patchell RA Tibbs PA Regine WF et al. Direct decompressive surgical resection in the treatment of spinal cord compression caused by metastatic cancer: a randomised trial Lancet 2005 366 9486 643 648 10.1016/S0140-6736(05)66954-1 16112300 50 Fisher CG DiPaola CP Ryken TC et al. A novel classification system for spinal instability in neoplastic disease: an evidence-based approach and expert consensus from the spine oncology study group. spine Spine (Phila Pa 1976) 2010 35 22 E1221 E1229 10.1097/BRS.0b013e3181e16ae2 20562730 51 Young RF Post EM King GA. Treatment of spinal epidural metastases. Randomized prospective comparison of laminectomy and radiotherapy J Neurosurg 1980 53 6 741 748 10.3171/jns.1980.53.6.0741 7441333 52 Stark RJ Henson RA Evans SJ. Spinal metastases. A retrospective survey from a general hospital Brain 1982 105 Pt 1 189 213 7066672 10.1093/brain/105.1.189 53 Gilbert RW Kim JH Posner JB. Epidural spinal cord compression from metastatic tumor: diagnosis and treatment Ann Neurol 1978 3 1 40 51 10.1002/ana.410030107 655653 54 Klimo P Jr. Thompson CJ Kestle JR et al. A meta-analysis of surgery versus conventional radiotherapy for the treatment of metastatic spinal epidural disease Neuro Oncol 2005 7 1 64 76 10.1215/S1152851704000262 15701283 PMC1871618 55 Bresolin N Sartori L Drago G et al. Systematic review and meta-analysis on optimal timing of surgery for acute symptomatic metastatic spinal cord compression Medicina (Kaunas) 2024 60 4 10.3390/medicina60040631 PMC11052148 38674277 56 Fattal C Fabbro M Gelis A et al. Metastatic paraplegia and vital prognosis: perspectives and limitations for rehabilitation care. Part 1 Arch Phys Med Rehabil 2011 92 1 125 133 10.1016/j.apmr.2010.09.017 21187215 57 Kakutani K Sakai Y Zhang Z et al. Survival rate after palliative surgery alone for symptomatic spinal metastases: a prospective cohort study J Clin Med 2022 11 21 6227 10.3390/jcm11216227 36362455 PMC9658518 58 Suzuki A Terai H Takahashi S et al. Risk factors for poor outcome after palliative surgery for metastatic spinal tumors J Clin Med 2023 12 10 3442 10.3390/jcm12103442 37240548 PMC10219010 59 Maseda M Uei H Nakahashi M et al. Neurological outcome of treatment for patients with impending paralysis due to epidural spinal cord compression by metastatic spinal tumor J Orthop Surg Res 2019 14 1 291 10.1186/s13018-019-1348-x 31481077 PMC6724255 ",
  "metadata": {
    "Title of this paper": "Neurological outcome of treatment for patients with impending paralysis due to epidural spinal cord compression by metastatic spinal tumor",
    "Journal it was published in:": "Annals of Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490351/"
  }
}