{
  "title": "Paper_398",
  "abstract": "pmc Front Public Health Front Public Health 2277 frontpubhealth Front. Public Health Frontiers in Public Health 2296-2565 Frontiers Media SA PMC12484204 PMC12484204.1 12484204 12484204 41041382 10.3389/fpubh.2025.1548258 1 Public Health Original Research Exploring knowledge, attitude, practices and barriers toward colorectal cancer screening in the United Arab Emirates: a mixed-methods study Elbarazi Iffat  1 Alam Zufishan  2 Alshebli Mouza  1 Alsunaidi Lamia  1 Al-Bluwi Ghada S. M.  1  3 Faheem Fayeza  1 Abdullahi Aminu S.  1 Ahmed Luai A.  1  4 Al-Maskari Fatma  1  4  * 1 College of Medicine and Health Sciences, Institute of Public Health, United Arab Emirates University Al-Ain United Arab Emirates 2 School of Health Sciences, Hamdan Bin Mohammed Smart University Dubai United Arab Emirates 3 Department of Internal Medicine, College of Medicine and Health Sciences, United Arab Emirates University Al-Ain United Arab Emirates 4 Zayed Centre for Health Sciences, United Arab Emirates University Al Ain United Arab Emirates Edited by: Benjamin E. Ansa, Augusta University, United States Reviewed by: Ivana Kulhánová Andreas Antzoulas *Correspondence: Fatma Al-Maskari, fatma.am@uaeu.ac.ae 17 9 2025 2025 13 480651 1548258 19 12 2024 18 8 2025 17 09 2025 02 10 2025 03 10 2025 Copyright © 2025 Elbarazi, Alam, Alshebli, Alsunaidi, Al-Bluwi, Faheem, Abdullahi, Ahmed and Al-Maskari. 2025 Elbarazi, Alam, Alshebli, Alsunaidi, Al-Bluwi, Faheem, Abdullahi, Ahmed and Al-Maskari https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Background Colorectal cancer (CRC) is a major contributor to cancer-related morbidity and mortality worldwide. In the United Arab Emirates (UAE), the CRC screening program was introduced in 2014, and it was expected that the program would face challenges, including low participation and poor adherence. However, there is limited research to document awareness and uptake of colorectal cancer screening among the UAE population. Aim This study aimed to assess the knowledge and behaviors of the adult Emirati population in Al-Ain, UAE, toward CRC screening, along with the barriers affecting uptake. Method A mixed methods research design was employed. Participants ( n n Results Low average knowledge scores (10%) and participation levels (12.3%) for CRC screening were evident among the participantsThe majority of the participants held discouraging attitudes, indicating various barriers toward CRC screening. Identified themes relevant to factors affecting screening uptake included knowledge deficits, the influence of inherent beliefs, and the inadequate role of healthcare providers (HCPs). Conclusion In order to encourage CRC screening among individuals, policymakers need to invest in community awareness and education campaigns that target primary care physicians and adults from all educational backgrounds. Arab health behavior (MeSH) colorectal cancer colonoscopy mixed method The author(s) declare that financial support was received for the research and/or publication of this article. This study was funded by SUREPLUS grant, provided by United Arab Emirates University. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Public Health Education and Promotion Highlights CRC screening knowledge and uptake is suboptimal in the Emirati population. Stigma and lack of risk perception have a strong influence on CRC screening uptake. HCPs need to proactively participate in raising CRC prevention awareness. 1 Introduction Colorectal cancer (CRC) is a leading cause of cancer-associated mortality and morbidity worldwide, with incidence on the rise ( 1 2 2 2 3 4 5 Advancements in CRC screening and treatment have improved the survival rates ( 6 7 8 9 7 10 11 CRC screening uptake, especially the Fecal Occult Blood test (FOBT) still remains low till date ( 12 13 14–17 18 Within the Arab world and the Eastern Mediterranean region, the situation is not quite different. According to a study by Navabi and Darvishi ( 19 19 GLOBOCAN and World Health Organization reports recommend need for more efforts to intervene, through proper screening and early detection programs, along with the call for further research ( 20 17 21–23 24 25 26 27 28 29 In the UAE, CRC is the third and second main cause of cancer incidence and mortality in both the sexes, respectively, according to the Ministry of Prevention and Health, MOHAP, 2019 ( 30 31 31 8 32 11 In the UAE, evidence on the topic is also scarce, with few studies focusing on clinicopathological aspects and prognosis of diagnosed CRC cases ( 33 34 35 2 Materials and methods 2.1 Study design This study followed a convergent parallel mixed methods research design including a cross-sectional survey to quantitatively assess CRC screening knowledge, uptake, and attitudes, as well as in-depth interviews to qualitatively explore barriers influencing CRC screening. The method refers to type of mixed methods study whereby both data collection processes are conducted concurrently ( 36 37 38 2.2 Target population and data collection For the quantitative part, participants were conveniently sampled from waiting areas of primary health care clinics in the city of Al Ain, Abu Dhabi in 2016. Al -Ain occupies the eastern geographical region of Abu Dhabi, the capital and the largest of the seven Emirates of UAE. The total population of Abu Dhabi is approximately 2,900,000 with nearly 80% expatriates. Primary Health care in the region is provided via Ambulatory Healthcare Services (AHS) clinics, operated by Abu Dhabi Health Services Company (SEHA) ( 39 39 n = z 2 p (1-p)/d 2 n p 20 d z 22 The questionnaire was developed to assess knowledge, attitudes and practices, barriers to CRC screening and sources of information. It was based on generic version of Cancer Awareness Measure (CAM) ( 40 22 23 41 31 42 The qualitative part of the study included face to face, in depth interviews with a subgroup of participants from the survey. Participants were purposefully sampled, with individuals from both the genders, aged 40 years and above, willing to take part in the interviews, eligible to participate. After participants completed the survey, they were requested to participate in the face-to-face interview. Those indicating willingness were interviewed based on time convenient for them. The interviews were carried out face to face, in Arabic, by a research assistant and two medical students trained in conducting qualitative interviews. The semi structured interview guide, focusing on exploration of factors that could affect CRC screening, was developed based on a thorough literature review. It included topics on participants’ general views on cancer, knowledge of colorectal cancer, its screening modalities, screening participation and experiences; and possible factors that could affect screening uptake. The guide included probes to allow more flexibility and freedom of expression from the participants. The guide was reviewed by two experts in the field of health promotion to ensure relevance and comprehensiveness of the questions. It was also subsequently pilot tested with two participants to ensure the structure and soundness of the questions. The sample size for the qualitative component was determined using theory of saturation, a concept indicating the need to stop data collection at a point when no new ideas or information emerge ( 43 2.3 Ethical considerations Ethics approval was obtained from the Institutional Review Board. Written consent was obtained from all participants for survey as well as the interviews, after they had been provided the information about the study. For participants unable to read, the information was read out. The participants were ensured about the confidentiality of data and their right to withdraw if they did not want to continue with the study. The details of participants were de-identified. 2.4 Data analysis For the quantitative data, Statistical Package for Social Sciences (SPSS), version 28 (IBM Corp., Armonk, N. Y., United States) was used for the analysis ( 44 For the qualitative interviews, audio recordings were transcribed followed by translation of transcripts to English. The transcripts were also back translated and checked for accuracy by the senior researcher. Additionally, the findings were shared with the participants to verify their accuracy and ensure that they resonate with the experiences of participants. The transcripts were then analyzed using inductive thematic process where data led to extraction of themes rather than devising themes based on pre-existing framework or theory. The process involved reading and re-reading of the excerpts to gain familiarity with the content, followed by identification of meaningful segments of data to form initial codes. Similar codes were categorized to constitute subthemes, which were further refined and grouped together to assign themes. These themes thus represented the overarching patterns within the data ( 45 3 Results 3.1 Quantitative—cross sectional study 3.1.1 Demographic characteristics of the participants About four in every five (80.7%) participants were between the ages of 30 and 49 years ( Table 1 Table 1 Table 1 Sociodemographic characteristics of adults taking part in the quantitative survey ( N Demographic characteristics Frequency Percentage Age (years) 30–39 225 45.7 40–49 172 35.0 50–59 66 13.4 60–69 29 5.9 Gender Female 331 67.1 Male 162 32.9 Marital status Single 87 17.6 Married 341 69.2 Divorced 47 9.5 Widowed 18 3.7 Nationality Emirati 355 72.0 Non-Emirati 138 28.0 Current residence Al Ain 431 87.5 Abu Dhabi 35 7.1 Dubai 13 2.6 Others 14 2.8 Employment status Unemployed 146 29.6 Own business 55 11.2 Employed 292 59.2 Highest education Cannot read and write 18 3.7 Elementary 40 8.1 Intermediate 44 8.9 High school 153 31.0 University 205 41.6 Post-graduate 33 6.7 *Some variables may not add to 493 due to missing values. 3.1.2 Knowledge of colorectal cancer screening The overall average CRC screening knowledge score among the participants was 16.3 percent (95% CI = 14.75–17.95) with 0 percent and 80 percent as the minimum and maximum scores, respectively. Based on the answers to individual questions, “Have you ever heard about colorectal cancer screening?” and “What is a Fecal occult Blood Test (FOBT)?” had the highest (31.2%) and the lowest (5.1%) correct responses, respectively ( Table 2 Table 2 Summary of responses to CRC screening knowledge questions among the survey participants ( n Questions Correctly answered Total number of respondents  n % Have you ever heard about colorectal cancer screening? 153 31.2 490 Do you know what the recommendations in UAE for CRC screening are? 76 15.6 487 What is colonoscopy? 129 26.6 485 What is a Fecal occult Blood Test (FOBT)? 24 5.1 475 What is the recommended age to start having a colonoscopy? 44 9.1 486 What is the recommended frequency of a colonoscopy? 25 5.2 482 What is the recommended frequency of a FOBT? 77 15.9 484 When should you visit your doctor for a regular examination? 37 7.6 485 If blood was detected in the stool, does this mean that the person definitely has colorectal cancer? 127 26.2 484 If a person has a lump in the colon or polyp does this mean that he/she has definitely colorectal cancer? 112 23.1 484 The knowledge score was found to be disproportionate across different categories of the participants ( Table 3 p p p p p p p p p Table 3 Differences in CRC screening knowledge scores among various sociodemographic categories of survey participants. Characteristic Knowledge score (%) p Mean (95% CI) SD Gender  0.046 Female 15.26 (13.13–17.18) 18.77 Male 18.58 (16.02–21.14) 16.49 Age  <0.001 <50 17.63 (15.83–19.44) 18.28 ≥50 10.63 (7.38–13.88) 15.97 Nationality 0.116 Emirati 15.55 (13.68–17.42) 17.91 Non-Emirati 18.41 (15.07–21.28) 18.49 Residence  <0.001 Abu Dhabi Emirate 16.89 (15.16–18.48) 18.26 Others 7.04 (2.28–11.80) 12.03 Employment status 0.613 Unemployed 16.99 (14.02–19.95) 18.13 Employed 16.08 (14.07–17.89) 18.11 Education  0.008 Below university 14.27 (12.06–16.49) 17.93 University 18.57 (16.14–20.74) 18.06 Marital status 0.521 Single 15.75 (17.80–19.70) 18.53 Married 17.01 (14.99–18.82) 18.03 Divorced 14.47 (9.07–19.87) 18.39 Widow 11.67 (3.27–20.07) 16.89 Regular medical visit 0.241 No 15.66 (13.61–17.50) 17.86 Yes 17.68 (14.85–20.50) 18.54 Cancer family history  0.004 No 15.50 (13.73–17.12) 17.84 Yes 21.82 (17.16–26.48) 18.97 Screening invitation  <0.001 No 22.35 (18.83–25.87) 17.92 Yes 14.78 (12.92–16.46) 17.84 TV as a source of information  0.003 No 14.29 (12.11–16.21) 17.74 Yes 19.22 (16.72–21.73) 18.25 3.1.3 Attitude The participants’ attitudes toward CRC screening is graphically presented in Figure 1 Figure 1 Participants’ attitude toward colorectal cancer screening expressed in %age ( N Bar chart showing opinions on FOBT and colonoscopy. Statements range from advising tests if recommended by a doctor to fear, pain, and life-saving potential of screenings. Responses are split into \"Strongly agree\" (blue), \"Agree\" (orange), \"Disagree\" (gray), and \"Strongly disagree\" (yellow). Notable findings include strong disagreement with the statement \"Screening and early detection for colorectal cancer can save lives\" being 45.6%. 3.1.4 Practice of and barriers to colorectal cancer screening test Only a minority of the participants (12.4%) reported having a colonoscopy in the last 10 years with reference to the survey period. A similar proportion of the participants (12.4%) reported having FOBT and most (12.2%) of them had it conducted in the last year before the survey The most common reason for not having a CRC screening test was lack of symptoms (34.3%), followed by perceived belief in destiny (30.4%) ( Figure 2 Figure 2 Reasons for lack of participation in the colorectal cancer screening tests expressed in %age ( N Bar chart depicting reasons for avoiding colorectal screening tests. \"I don't have symptoms\" is the highest at 34.3%, followed by \"I believe in God and destiny\" at 30.4%, and \"I am afraid of the result\" at 26.4%. Least cited reasons include \"I am not convinced that screening can save lives\" at 7.5%, and \"I am not convinced that colorectal screening can detect\" at 8.5%. 3.1.5 Sources of information The distribution of the sources of information among the participants is depicted in Figure 3 Figure 3 Proportion of participants by sources of information regarding colorectal cancer screening ( N Funnel chart showing sources of information by percentage. Internet leads with 46.9%, followed by Television at 41.8%, and Doctors at 40.4%. The lowest are Health care professionals at 6.7% and Others at 4.5%. 3.2 Qualitative—in depth interviews The age range of the 16 interviewed participants was 40–75 years. The majority ( n Table 4 3.2.1 Lack of awareness One of the major barriers that could be delineated from conversation with participants was insufficient awareness and knowledge of the cancer type as well its screening methods. Although majority of the participants were knowledgeable of the term “cancer” in general, and had also heard the word “colon cancer,” they did not have sufficient information on details of the disease. They were not aware of the actual organ involved, as many participants misconstrued it as “somewhere in the stomach” (P#10) or “something in the intestines” (P#3). The reason for lack of awareness was outlined as being a less commonly brought up cancer, compared to other types of cancer: “We, in general, women who are housewives, know the most about breast cancer. Because one of my friends got sick, she went to the appointment and found out she had breast cancer. It is the most common type of breast cancer” (P#5). When asked about the CRC burden, participants remained unaware. However, participants did refer to signs and symptoms that it may lead to, including indigestion, diarrhea, and mass in the intestine.: “You know one of my neighbors, she had pain in the stomach, and she lost a lot of weight. They took her to the hospital. She was treated for one year but then she died” (P#13). They were uncertain of the treatment options and when asked about screening methods, it was commonly referred to as testing through blood sample. Few participants also viewed x ray as a way of detecting the disease. Nearly half the patients were not aware of the stool test. Of those that were aware misconceived the purpose, as one female participant explained: “Yes, they check if there are worms” (P#12). Likewise, the majority were not aware of colonoscopy, with few participants confusing it with an endoscope used from above (gastroscope), to check gastric lesions. 3.2.2 Role of inherent beliefs Various innate beliefs reflected in participants’ perspectives regarding screening attendance. Of them, lack of risk perception was predominant. Participants did not consider CRC as a significant threat as they did not have any problem, nor had anyone had in their family. They were of the view that medical attention needs to be sought only when one is experiencing symptoms or is feeling unwell. One of the participants elaborated: “I only go to the hospital when there is a problem, for a specific reason. Why would I have endoscopy if I don’t have any problem” (P#11). Thus, for them concept of accessing preventive healthcare was linked to presence of signs and symptoms denoting the ailment. Few participants also referred to use of alternative treatments and herbal remedies: “I’m a patient person, I try myself with herbs first, then I go to the hospital. I don't go without a reason” (P#6). Another common attitude exhibited by the participants was having fatalistic beliefs, considering all diseases to be predestined and inevitable. According to one of them: “God writes it for a human being. God sends down disease or erases it. Whoever God gives a long life will get treatment. And for whoever God does not write life, then this is by the command of God Almighty. You can’t get well if God does not will” (P#7). Element of shame and embarrassment was also expressed in having the CRC screening, especially colonoscopy. Of the participants that were aware of colonoscopy, most indicated that they would not prefer to get the test from below, owing to the position of private parts: “I refused to do an endoscopy from below. I don't want it from under honestly. I honestly don't accept it. I'm ashamed to let a man do it for me” (P#9). Few participants that misinterpreted colonoscopy for gastroscopy were pleased to have the procedure conducted from above, instead of from below, as the former was disgusting according to them. Table 4 Various themes and subthemes as identified during thematic analysis. Theme Subtheme Lack of awareness of colorectal cancer General awareness of the term “cancer” Role of inherent beliefs Low risk perception Lack of HCP involvement Insufficient recommendations by doctors 3.2.3 Lack of HCP involvement One of the most common factors outlined for nonattendance toward CRC screening uptake among participants, was lack of recommendation by their healthcare practitioners. It seemed obvious that they were not getting enough information from the HCPs. One of the participants when asked if the doctor has recommended him the test, responded: “Doctor has not asked me to do any colon related tests, he just does BP checks” (P#14). This was also evident through elaboration of participants when enquired about their source of information. Social media and television were the most common means: “On TV, I hear people's news, TV stories. Doctors do not tell but children speak” (P#7). It was apparent that participants consider the doctor as trusted sources of information provision and without their active suggestion they do not consider CRC screening necessary. Another reason that was brought up was the inadvertent behavior of HCPs, causing the participants to seek medical help only when strictly required and discouraging seeking preventive healthcare: “I feel that doctors don't encourage you to come without a reason. Their reaction is that one should not come without reason” (P#8). Hence it was evident that participants, without guidance from HCPs, were unaware of the potential benefits of CRC screening as well as unfamiliar with the specific guidelines and recommendations for their age group or risk factors. However, most participants indicated the willingness to attend such programs if recommended by HCPs. They were also appreciative of the available resources provided by their government, available through social media. 3.3 Integration of findings from qualitative and quantitative components The incorporation of results from the questionnaire with those from the interviews enabled data triangulation and validation of study findings. The outcome from the survey, that participants had low levels of CRC screening knowledge and uptake, was corroborated by views brought up in the interviews. The conversations with the participants detailed that awareness of the cancer site and purpose for screening is severely lacking, which leads to insufficient understanding of recommendations as well as lack of motivation for test uptake. Inherent factors such as insufficient perception of disease severity or seeking healthcare when healthy solely for the sake of screening, further provided the context for poor uptake and affecting barriers. Report from the survey that participants who had been recommended by HCPs had more CRC screening knowledge, was also confirmed by interview findings, outlining HCPs’ behavior favoring clinic attendance mostly when suffering from disease. 4 Discussion This research study explored CRC knowledge, uptake and behaviors using a mixed methods study approach. Results suggest low knowledge of CRC screening modalities, as well as poor screening uptake, influenced by diverse attitudes. Reasons for lower knowledge and uptake were further explored to reveal role of misconceptions, inherent behaviors and healthcare provider related issues, acting as barriers toward screening. CRC screening knowledge in general (31.2%) as well in specific about FOBT (5.1%) and colonoscopy (6%), as indicated in our study, was very low. When compared with other studies within the region, it was in consistency with evidence from similar studies conducted in Saudi Arabia (37.4%) and Jordan (24%) ( 22 46 47 35 48 49 The screening uptake for colonoscopy (12.4%) and FOBT (12.4%), as revealed by our study is also low. A study conducted in Abu Dhabi, that utilized health care records of adult Emiratis visiting ambulatory healthcare centers in Abu Dhabi, UAE during 2015–16, reported CRC screening uptake be 23.5% for FOBT and 13.5% for follow-up colonoscopy among individuals with positive FOBT results ( 29 17 28 50 Interviews as well as the survey highlighted commonly prevalent barriers toward screening uptake among the participants. These, include modifiable factors such as lack of risk perception, fatalistic beliefs, fear of pain and discomfort, fear of test results and absence of preventive health seeking practices, and have been reported in the literature previously, corroborating our findings ( 18 51 52 53 60 The quantitative results, aided by the qualitative findings highlighted that HCPs’ role in providing adequate information was not being achieved. A study on knowledge of adult Emiratis regarding CRC revealed that CRC screening was not recommended by HCPs to 95% of participants ( 54 55 41 15 56 57 58 59 A potential limitation of the study is the limited generalizability of results to the overall UAE population, primarily attributable to the convenient sampling method employed. Furthermore, there is an inability to establish causal relationship between CRC screening knowledge and associated factors due to application of a cross-sectional study method for the survey. Additionally due to reliance on self-reported data, findings may be subject to recall and social desirability biases Although, the questionnaire was thoroughly assessed for content validity and reliability, the construct validity was not measured. Future research employing a fully validated questionnaire would be beneficial. An important limitation is that we could not go through the full process of validation using factor analysis nevertheless, we have conducted content validity and Cronbach alpha There is also a potential of researcher bias, as interpretation of qualitative data is dependent upon researcher’s views and beliefs. However, it was overcome by consistent research team meetings for theme discussion. Nevertheless, use of qualitative interviews, along with quantitative questionnaires, allowed for better understanding and triangulation of the results, enhancing study reliability. The study reports findings from data collected in 2016. Although the data can be considered old, it needs to be published in order to provide a baseline for future studies that include assessment of CRC screening knowledge after the screening program in UAE was revised in 2019 as well as for intervention implementation. 5 Conclusion This study provided an insight into the knowledge, attitudes and behaviors regarding CRC screening among residents of Al-Ain, UAE. Results imply that low knowledge and uptake rates, under the influence of varied attitudes and behaviors, prompt action. Considering reluctance to CRC screening as a social and behavioral challenge, steps such as raising awareness, promotion of the benefits of early detection and preventive healthcare and dispelling underlying misconceptions are required. This needs to be tackled through channels not keenly involved in the process such as HCPs. Public health campaigns and tailored messaging can also be effective in changing these beliefs and promoting proactive CRC screening, leading to greater participation in screening initiatives. Future recommendations include the need for more studies in different Emirates and as well as the need for policy makers to invest in more awareness campaigns about CRC and screening availability. We would like to acknowledge all the participants of the study for their contribution. Data availability statement The raw data supporting the conclusions of this article will be made available by the authors, upon reasonable request. Ethics statement The studies involving humans were approved by Ambulatory Health Services Ethics Research Committee, Approval No: T/bb/15-3095. The studies were conducted in accordance with the local legislation and institutional requirements. The participants provided their written informed consent to participate in this study. Author contributions IE: Conceptualization, Methodology, Project administration, Supervision, Writing – original draft, Writing – review & editing. ZA: Formal analysis, Writing – original draft. MA: Investigation, Writing – review & editing. LA: Investigation, Writing – review & editing. GA: Investigation, Writing – review & editing. FF: Writing – original draft. AA: Data curation, Formal analysis, Visualization, Writing – original draft. LAA: Conceptualization, Writing – review & editing. FA-M: Conceptualization, Funding acquisition, Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The authors declare that no Gen AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1. Bray F Ferlay J Soerjomataram I Siegel RL Torre LA Jemal A Global cancer statistics 2018: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2018 68 394 424 10.3322/caac.21492 30207593 2. Sung H Ferlay J Siegel RL Laversanne M Soerjomataram I Jemal A Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2021 71 209 49 10.3322/caac.21660 33538338 3. Mattiuzzi C Sanchis-Gomar F Lippi G Concise update on colorectal cancer epidemiology Ann Transl Med 2019 7 609 10.21037/atm.2019.07.91 32047770 PMC7011596 4. Xi Y Xu P Global colorectal cancer burden in 2020 and projections to 2040 Transl Oncol 2021 14 101174 10.1016/j.tranon.2021.101174 34243011 PMC8273208 5. Morgan E Arnold M Gini A Lorenzoni V Cabasag CJ Laversanne M Global burden of colorectal cancer in 2020 and 2040: Incidence and mortality estimates from GLOBOCAN Gut 2023 72 338 44 10.1136/gutjnl-2022-327736 36604116 6. Ladabaum U Dominitz JA Kahi C Schoen RE Strategies for colorectal cancer screening Gastroenterology 2020 158 418 32 10.1053/j.gastro.2019.06.043 31394083 7. Rabeneck L Chiu HM Senore C International perspective on the burden of colorectal cancer and public health effects Gastroenterology 2020 158 447 52 10.1053/j.gastro.2019.10.007 31622620 8. Shaukat A Levin TR Current and future colorectal cancer screening strategies Nat Rev Gastroenterol Hepatol 2022 19 521 31 10.1038/s41575-022-00612-y 35505243 PMC9063618 9. Levin TR Corley DA Jensen CD Schottinger JE Quinn VP Zauber AG Effects of organized colorectal cancer on cancer incidence and mortality in a large community-based population Gastroenterology 2018 155 1383 1391.e5 10.1053/j.gastro.2018.07.017 30031768 PMC6240353 10. Siegel RL Miller KD Jemal A Colorectal Cancer mortality rates in adults aged 20 to 54 years in the United States, 1970-2014 JAMA 2017 318 572 4 10.1001/jama.2017.7630 28787497 PMC5817468 11. Wolf AM Fontham ET Church TR Flowers CR Guerra CE LaMonte SJ Colorectal cancer screening for average-risk adults: 2018 guideline update from the American Cancer Society CA Cancer J Clin 2018 68 250 81 10.3322/caac.21457 29846947 12. Ameen S Wong MC Turner P Yee KC Improving colorectal cancer screening-consumer-centred technological interventions to enhance engagement and participation amongst diverse cohorts Clin Res Hepatol Gastroenterol 2023 47 102064 10.1016/j.clinre.2022.102064 36494072 13. Wools A Dapper EA Leeuw JD Colorectal cancer screening participation: a systematic review Eur J Pub Health 2016 26 158 68 10.1093/eurpub/ckv148 26370437 14. Kiviniemi MT Hay JL James AS Lipkus IM Meissner HI Stefanek M Decision making about cancer screening: an assessment of the state of the science and a suggested research agenda from the ASPO Behavioral Oncology and Cancer Communication Special Interest Group Cancer Epidemiol Biomarkers Prev 2009 18 3133 7 10.1158/1055-9965.EPI-18-11-ASPO 19900944 PMC2810193 15. Lee HY Rhee TG Kim NK Cancer literacy as a mediator for cancer screening behaviour in Korean adults Health Soc Care Community 2016 24 e34 42 10.1111/hsc.12243 25975449 16. Stacey D Légaré F Lewis K Barry MJ Bennett CL Eden KB Decision aids for people facing health treatment or screening decisions Cochrane Database Syst Rev 2017 2017 CD001431 10.1002/14651858.CD001431.pub5 28402085 PMC6478132 17. Almadi MA Alghamdi F The gap between knowledge and undergoing colorectal cancer screening using the Health Belief Model: A national survey Saudi J Gastroenterol 2019 25 27 39 10.4103/sjg.SJG_455_18 30618441 PMC6373220 18. Honein-AbouHaidar GN Kastner M Vuong V Perrier L Daly C Rabeneck L Systematic review and meta-study synthesis of qualitative studies evaluating facilitators and barriers to participation in colorectal cancer screening Cancer Epidemiol Biomarkers Prev 2016 25 907 17 10.1158/1055-9965.EPI-15-0990 27197277 19. Navabi M Darvishi I The incidence and mortality of cancer in Eastern Mediterranean Regional Office (EMRO) and its relationship with Human Development Index (HDI): an ecological study Asian Pac J Environ Cancer 2018 1 59 67 10.31557/apjec.2018.1.1.59-67 20. Arafa MA Farhat K Colorectal cancer in the Arab world-screening practices and future prospects Asian Pac J Cancer Prev 2015 16 7425 30 10.7314/apjcp.2015.16.17.7425 26625738 21. Almadi MA Mosli MH Bohlega MS Al Essa MA AlDohan MS Alabdallatif TA Effect of public knowledge, attitudes, and behavior on willingness to undergo colorectal cancer screening using the health belief model Saudi J Gastroenterol 2015 21 71 7 10.4103/1319-3767.153814 25843192 PMC4392578 22. Khayyat YM Ibrahim EM Public awareness of colon cancer screening among the general population: A study from the Western Region of Saudi Arabia Qatar Med J 2014 2014 17 24 10.5339/qmj.2014.3 25320688 PMC4197369 23. Zubaidi AM AlSubaie NM AlHumaid AA Shaik SA AlKhayal KA AlObeed OA Public awareness of colorectal cancer in Saudi Arabia: a survey of 1070 participants in Riyadh Saudi J Gastroenterol 2015 21 78 83 10.4103/1319-3767.153819 25843193 PMC4392579 24. Omran S Barakat H Muliira JK Aljadaa N Knowledge, experiences, and barriers to colorectal cancer screening: a survey of health care providers working in primary care settings J Cancer Educ 2015 30 53 61 10.1007/s13187-014-0676-0 24882440 25. Mansour-Ghanaei A Joukar F Mansour-Ghanaei F Rasoulian J Naghipour MR Fani A Knowledge about Colorectal Cancer in Northern Iran: a Population-Based Telephone Survey Asian Pac J Cancer Prev 2015 16 7831 6 10.7314/APJCP.2015.16.17.7831 26625806 26. Qumseya BJ Tayem YI Dasa OY NahhaL KW Abu-limon IM Hmidat AM Barriers to colorectal cancer screening in Palestine: a national study in a medically underserved population Clin Gastroenterol Hepatol 2014 12 463 9 10.1016/j.cgh.2013.08.051 24055899 27. Al-Dahshan A Chehab M Bala M Omer M Almohamed O Alkubisi N Colorectal cancer awareness and its predictors among adults aged 50-74 years attending primary healthcare in the State of Qatar: a cross-sectional study BMJ Open 2020 10 e035651 10.1136/bmjopen-2019-035651 32641359 PMC7342467 28. Tfaily MA Naamani D Kassir A Sleiman S Ouattara M Moacdieh MP Awareness of colorectal cancer and attitudes towards its screening guidelines in Lebanon Ann Glob Health 2019 85 75 10.5334/aogh.2437 31148437 PMC6634322 29. Almansoori A Alzaabi M Alketbi L Colorectal Cancer screening in ambulatory healthcare service clinics in Abu Dhabi, United Arab Emirates in 2015-2016 BMC Cancer 2021 21 897 10.1186/s12885-021-08623-9 34362343 PMC8343888 30. Ministry of Health and Prevention Cancer incidence in United Arab Emirates Annual report of the UAE - National Cancer Registry - 2019 https://mohap.gov.ae/assets/download/f3eb10c9/CANCER%20INCIDENCE%20IN%20UNITED%20ARAB%20EMIRATES%20ANNUAL%20REPORT%20OF%20THE%20UAE%20-%202019.pdf.aspx 31. Ministry of Health and Prevention 2014 The national guidelines for colorectal screening and diagnosis https://www.isahd.ae/content/docs/MOHAP%20Guidelines%20For%20Colorectal%20Cancer%20Screening.pdf 32. Department of Health ADPHC revises recommendations for early colorectal screening 2019 https://www.doh.gov.ae/en/news/ADPHC-revises-recommendations-for-early-colorectal-cancer-screening 33. El Ghazawy IM Bener A Saad El Din SS Abou Azab I Siddiqui M Predictors of surgery outcome for colorectal carcinoma in the United Arab Emirates East Mediterr Health J 2001 7 221 8 12596973 34. Al-Shamsi SR Bener A Al-Sharhan M Al-Mansoor TM Azab IA Rashed A Clinicopathological pattern of colorectal cancer in the United Arab Emirates Saudi Med J 2003 24 518 22 12847629 35. Al-Sharbatti S Muttappallymyalil J Sreedharan J Almosawy Y Predictors of colorectal cancer knowledge among adults in the United Arab Emirates Asian Pac J Cancer Prev 2017 18 2355 9 10.22034/APJCP.2017.18.9.2355 28950678 PMC5720636 36. Creswell J. W. 2013 Steps in conducting a scholarly mixed methods study. DBER Speaker Series 48 https://digitalcommons.unl.edu/dberspeakers/48 37. Von Elm E Altman DG Egger M Pocock SJ Gøtzsche PC Vandenbroucke JP The strengthening the reporting of observational studies in epidemiology (STROBE) statement: guidelines for reporting observational studies Int J Surg 2014 12 1495 9 10.1016/j.ijsu.2014.07.013 25046131 38. Tong A Sainsbury P Craig J Consolidated criteria for reporting qualitative research (COREQ): a 32-item checklist for interviews and focus groups Int J Qual Health Care 2007 19 349 57 10.1093/intqhc/mzm042 17872937 39. Paulo MS Loney T Lapão LV The primary health care in the emirate of Abu Dhabi: are they aligned with the chronic care model elements? BMC Health Serv Res 2017 17 1-0 10.1186/s12913-017-2691-4 29137672 PMC5686807 40. Stubbings S Robb K Waller J Ramirez A Austoker J Macleod U Development of a measurement tool to assess public awareness of cancer Br J Cancer 2009 101 S13 7 10.1038/sj.bjc.6605385 19956157 PMC2790699 41. Koo JH Leong RW Ching J Yeoh KG Wu DC Murdani A Knowledge of, attitudes toward, and barriers to participation of colorectal cancer screening tests in the Asia-Pacific region: a multicenter study Gastrointest Endosc 2012 76 126 35 10.1016/j.gie.2012.03.168 22726471 42. Taherdoost H. Validity and reliability of the research instrument; how to test the validation of a questionnaire/survey in a research. How to test the validation of a questionnaire/survey in a research (August 10, 2016) 2016 43. Fusch P Ness L Are we there yet? Data saturation in qualitative research Qual Rep 2015 20 1408 16 10.46743/2160-3715/2015.2281 44. IBM Corp Released 2021. IBM SPSS Statistics for Windows, Version 28.0 Armonk, NY IBM Corp 45. Taylor SJ Bogdan R DeVault M Introduction to qualitative research methods: A guidebook and resource John Wiley & Sons 2015 46. Taha H Al Jaghbeer M Al-Sabbagh MQ Al Omari L Berggren V Knowledge and practices of colorectal cancer early detection examinations in Jordan: a cross sectional study Asian Pac J Cancer Prev 2019 20 831 8 10.31557/APJCP.2019.20.3.831 30912401 PMC6825773 47. Al-Hajeili M Abdulwassi HK Alshadadi F Alqurashi L Idriss M Halawani L Assessing knowledge on preventive colorectal cancer screening in Saudi Arabia: A cross-sectional study J Family Med Prim Care 2019 8 3140 6 10.4103/jfmpc.jfmpc_508_19 31742133 PMC6857381 48. Alhurry AMAH Rezaianzadeh A Rahimikazerooni S Akool MA Bahrami F Shahidinia SS A review of the incidence of colorectal cancer in the Middle East Iran J Colorectal Res 2017 5 e46292 10.5812/acr.46292 49. Al-Shamsi HO Alzaabi AA Hassan A Abu-Gheida I Alrawi S Early onset colorectal cancer in the United Arab Emirates, where do we stand? Acta Sci Cancer Biol 2020 4 24 7 10.31080/ASCB.2020.04.0267 50. Al-Azri M Al-Khatri S Murthi Panchatcharam S Attitudes toward and knowledge of colorectal cancer screening among an Omani adult population attending a teaching hospital Asian Pac J Cancer Prev 2020 21 3061 8 10.31557/APJCP.2020.21.10.3061 33112568 PMC7798140 51. Alharbi M AlSaleem LS Alrashid MH Alutaibi H Alabdrabulrida SA Mahjari AA Preferences for colorectal cancer screening modalities among the general population in Saudi Arabia Cureus 2023 15 e36020 10.7759/cureus.36020 37050991 PMC10084943 52. Calderwood AH Wasan SK Heeren TC Schroy PC Patient and provider preferences for colorectal cancer screening: how does CT colonography compare to other modalities? Int J Cancer Prev 2011 4 307 38 PMC4165440 25237287 53. Reynolds LM Bissett IP Consedine NS Emotional predictors of bowel screening: the avoidance-promoting role of fear, embarrassment, and disgust BMC Cancer 2018 18 1 9 10.1186/s12885-018-4423-5 29720112 PMC5932793 54. Al Abdouli L Dalmook H Abdo MA Carrick FR Rahman MA Colorectal cancer risk awareness and screening uptake among adults in the United Arab Emirates Asian Pac J Cancer Prev 2018 19 2343 9 10.22034/APJCP.2018.19.8.2343 30141313 PMC6171396 55. Aldukhayel AM Alsudairi HA Alhomidani RA Almutairi NS Alturki FM Almehmadi RG Knowledge and attitude of primary healthcare physicians toward colorectal cancer screening in Qassim Region, Saudi Arabia Int J Med Dev Ctries 2021 5 1784 90 10.24911/IJMDC.51-1631463181 56. Le V Syed S Vega KJ Sharma T Madhoun MF Srinivasan N Patient prompting of their physician resulted in increased colon cancer screening referrals World J Gastrointest Oncol 2014 6 257 62 10.4251/wjgo.v6.i7.257 25024817 PMC4092342 57. Khankari K Eder M Osborn CY Makoul G Clayman M Skripkauskas S Improving colorectal cancer screening among the medically underserved: a pilot study within a federally qualified health center J Gen Intern Med 2007 22 1410 4 10.1007/s11606-007-0295-0 17653808 PMC2305844 58. Dolan NC Ramirez-Zohfeld V Rademaker AW Ferreira MR Galanter WL Radosta J The effectiveness of a physician-only and physician–patient intervention on colorectal cancer screening discussions between providers and African American and Latino patients J Gen Intern Med 2015 30 1780 7 10.1007/s11606-015-3381-8 25986137 PMC4636583 59. Gregory TA Wilson C Duncan A Turnbull D Cole SR Young G Demographic, social cognitive and social ecological predictors of intention and participation in screening for colorectal cancer BMC Public Health 2011 11 38 10.1186/1471-2458-11-38 21232156 PMC3034679 60. Wang H Roy S Kim J Farazi PA Siahpush M Su D Barriers of colorectal cancer screening in rural USA: a systematic review Rural and remote health 2019 19 5181 10.22605/RRH5181 31394041 ",
  "metadata": {
    "Title of this paper": "Barriers of colorectal cancer screening in rural USA: a systematic review",
    "Journal it was published in:": "Frontiers in Public Health",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484204/"
  }
}