{
  "title": "Paper_116",
  "abstract": "JCO Clin Cancer Inform JCO Clin Cancer Inform 319 nihpa JCO clinical cancer informatics 2473-4276 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12490804 PMC12490804.1 12490804 12490804 NIHMS2107050 41032743 10.1200/CCI-25-00102 NIHMS2107050 NIHPA2107050 1 Article Unsupervised Large Language Models to Identify Topics in Cancer Center Patient Portal Messages Chang Ji Hyun MD, PhD 1 2 Ashraf-Ganjouei Amir MD 1 Friesner Isabel BA 1 Benson Ryzen PhD 1 Zack Travis MD, PhD 1 Sinha Sumi MD 1 3 Chan Jason MD 1 3 Braunstein Steve MD, PhD 1 3 Lin Amy MD 1 Singer Lisa MD, PhD 1 3 Hong Julian C MD, MS 1 3 4 1 2 3 4 Corresponding Author: julian.hong@ucsf.edu Conflicts of interest The authors declare that they have no competing interests. 10 2025 01 10 2025 9 498135 e2500102 e2500102 27 08 2025 02 10 2025 03 10 2025 03 10 2025 Background: The increasing use of patient portal messages has enhanced patient-provider communication. However, the high volume of these messages has also contributed to physician burnout. Methods: Patient-generated portal messages sent to a single cancer center from 2011 to 2023 were extracted. BERTopic, a natural language processing topic modeling technique based on large language model, was optimized. For further categorization, the topic words were labeled using GPT-4, followed by review by two oncologists. Uniform Manifold Approximation and Projection was employed for dimensionality reduction and visualizing topics. Message volume changes over time were assessed using a Student’s t-test. Results: A total of 2,280,851 messages were analyzed. The monthly average number of messages increased from 2,071 in 2012 to 43,430 in 2022 (p<0.001). There was a significant rise in message volume following the COVID-19 pandemic, with a posterior probability of a causal effect of 96.4% (p=0.04). Scheduling-related messages were the most frequent across departments, while symptoms and health concerns were second or third most common topics. In medical oncology and surgical oncology, topics on prescriptions and medications were more common compared to radiation oncology and gynecological oncology. Despite concurrent institutional changes in self-scheduling systems, scheduling-related messages did not decrease over time. Conclusions: The substantial increase in patient portal messages, particularly scheduling-related inquiries, underscores the need for streamlined communication to reduce the burden on healthcare providers. These findings highlight the need for strategies to manage message volume and mitigate physician burnout, laying groundwork for artificial intelligence-driven future triage systems to improve message management and patient care. Patient portal message Physician burnout Natural language processing Large language model pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Unsupervised Large Language Models to Identify Topics in Cancer Center Patient Portal Messages",
    "Journal it was published in:": "JCO clinical cancer informatics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490804/"
  }
}