{
  "title": "Paper_115",
  "abstract": "pmc Cureus Cureus 2757 cureus Cureus 2168-8184 Cureus Inc. PMC12490822 PMC12490822.1 12490822 12490822 10.7759/cureus.93720 1 Other Hematology Nephrology Acute Renal Artery Thrombosis Following Delayed Postoperative Anticoagulation in Atrial Fibrillation: A Case Report Supporting Apixaban Monotherapy Muacevic Alexander Adler John R Kureemun Muhammad Rafeeq 1 Rahemtoola Muhammad Shariq 2 Husein Anas Abdallah Ibrahim 3 Dalmia Sanjay 3  1  2  3 Muhammad Rafeeq Kureemun muhammad.kureemun@mft.nhs.uk 2 10 2025 10 2025 17 10 498077 e93720 29 9 2025 02 10 2025 03 10 2025 03 10 2025 Copyright © 2025, Kureemun et al. 2025 Kureemun et al. https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License CC-BY 4.0., which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. This article is available from https://cureus.com/articles/406808-acute-renal-artery-thrombosis-following-delayed-postoperative-anticoagulation-in-atrial-fibrillation-a-case-report-supporting-apixaban-monotherapy Renal artery thrombosis is a rare but potentially devastating vascular emergency, often misdiagnosed due to its nonspecific symptoms. Atrial fibrillation (AF) is a well-known cause of systemic thromboembolism, yet embolisation to the renal arteries remains uncommon. Timely recognition and appropriate anticoagulation are essential to minimise irreversible renal injury. We report the case of an 84-year-old woman with a history of AF (CHA2DS2-VASc score of 5) who developed acute unilateral renal artery thrombosis shortly after undergoing a unilateral mastectomy with sentinel lymph node biopsy. Anticoagulation with apixaban had been appropriately held preoperatively due to bleeding risk, but its resumption was delayed until five days postoperatively. The patient presented with acute flank pain, hypertension, and an acute kidney injury on postoperative day five. A CT abdomen pelvis confirmed a left renal artery thrombosis. Remarkably, a CT angiogram of the whole aorta, performed within 24 hours of restarting apixaban, showed resolution of the thrombus, although renal function did not improve by discharge. This case contributes to the limited but growing body of literature suggesting that direct oral anticoagulant (DOAC) monotherapy, specifically apixaban, is effective in managing renal artery thrombosis. It also reinforces the need for clinicians to consider the timely resumption of anticoagulation and to carefully reassess perioperative management in high-risk AF patients to prevent irreversible thromboembolic complications. acute kidney injury apixaban atrial fib direct oral anticoagulants (doac) post-mastectomy complications postop complication renal artery thrombosis renal infarction secondary hypertension pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Acute renal artery thrombosis is a rare but serious vascular emergency that is often underdiagnosed due to its nonspecific clinical presentation. With an estimated incidence of less than 1% among patients presenting with acute flank pain, it is frequently mistaken for more common conditions such as renal colic, pyelonephritis, or musculoskeletal pain [ 1 2 Atrial fibrillation (AF), the most common sustained cardiac arrhythmia, is a well-established risk factor for thromboembolic events. Risk stratification is commonly performed using the CHA2DS2-VASc score, which incorporates age, comorbidities, and sex to estimate stroke risk [ 3 4 Direct oral anticoagulants (DOACs) such as apixaban and rivaroxaban have become standard therapy for stroke prevention in AF, and there are increasing reports of their successful use in treating visceral arterial thrombosis, including renal infarction. Their rapid onset of action and predictable pharmacokinetics make them an attractive option compared with traditional vitamin K antagonists or heparin bridging, though their efficacy in this setting still needs to be ascertained [ 5 6 We present a case of acute unilateral renal artery thrombosis in a patient with known AF who had recently undergone breast surgery. The thrombus resolved within 24 hours of reinitiating apixaban, as confirmed by a CT angiography of the whole aorta. Although anticoagulation had been appropriately withheld due to the procedural bleeding risk, it was not resumed until five days postoperatively. This case highlights the complexities of perioperative anticoagulation in high-risk patients and adds to the emerging evidence supporting the efficacy of DOAC monotherapy, specifically apixaban, in managing renal artery thrombosis. Case presentation We present the case of an 84-year-old female patient who attended the accident and emergency department (A&E) with a two-day history of left-sided abdominal pain and two episodes of non-bilious vomiting. She denied any associated symptoms such as palpitations, fever, urinary symptoms, or recent trauma. Notably, she had not opened her bowels for five days, although she was still passing flatus. She had been treated in the community for presumed constipation with an enema the day prior to admission. Her past medical history included AF, for which she was on apixaban 5 mg twice daily. However, anticoagulation had been withheld for a total of eight days: two days prior to surgery, on the day of surgery, and for five days postoperatively. She had undergone a left simple mastectomy with sentinel lymph node biopsy five days before her presentation, following a diagnosis of symptomatic left breast cancer. On the day of admission, she was scheduled to restart apixaban. Her other comorbidities included diet-controlled type 2 diabetes mellitus, hyperlipidaemia managed with atorvastatin 20 mg at night, and hypertension managed with lercanidipine 10 mg once daily. She was also on furosemide 40 mg twice daily. No changes were made to the above three medications perioperatively that would significantly alter thromboembolic or bleeding risk. Postoperatively, she had been using codeine phosphate 30 mg four times daily as needed for postoperative pain, which likewise had no impact on thromboembolic or bleeding risk. Upon arrival, she was haemodynamically stable with a temperature of 36.5°C, blood pressure of 185/83 mmHg, and a heart rate of 91 beats per minute, which was irregularly irregular, consistent with her known AF. Her respiratory rate was 18 breaths per minute, and she maintained oxygen saturation of 99% on room air. On examination, she was noted to have generalised abdominal tenderness, with maximal discomfort in the left iliac fossa. Bowel sounds were reduced; a digital rectal examination revealed an empty rectum. Initial blood investigations demonstrated a leukocytosis of 11.40 x 10 9 9 9 9 9 9 1 1 Table 1 Blood results on the preoperative assessment day, on admission, and on discharge This table compares the laboratory blood values obtained during the preoperative assessment (11 days prior to admission), on hospital admission, and on the day of discharge (four days post admission). Reference ranges are provided in the second column. The test results for sodium and alkaline phosphatase (ALP) have been omitted due to their non-clinical relevance to the case. N/A: test not performed Test Reference range & units Preoperative assessment bloods – 11 days pre-admission Admission bloods Bloods on day of discharge – 4 days post-admission White blood cells (WBC) 4.00-11.00 x 10 9 7.20 11.40 9.70 Neutrophils 1.80-7.50 x 10 9 3.82 9.17 4.51 Monocytes 0.20-1.00 x 10 9 0.69 1.09 1.11 Potassium 3.50-5.30 mmol/L 3.90 3.60 4.50 Urea 2.50-7.80 mmol/L 5.60 6.30 6.40 Creatinine 45.00-84.00 µmol/L 71.00 115.00 118.00 eGFR >90.00 ml/min/1.73m 2 68.00 38.00 37.00 Alanine transaminase (ALT) 1.00 -35.00 IU/L 36.00 136.00 N/A C-reactive protein (CRP) 0.00-5.00 mg/L N/A 27.00 N/A Given her abdominal symptoms of vomiting, abdominal pain, and not opening bowels alongside her examination findings of reduced bowel sounds, the clinical impression was that of possible bowel obstruction. She was therefore commenced on intravenous rehydration with Hartmann’s solution (1000 mL over six hours), and a CT of the abdomen and pelvis with contrast (CTAP) was performed to evaluate for obstruction or perforation. Interestingly, while the CTAP did not show evidence of bowel obstruction or perforation, it revealed an incidental finding of thrombus within the left renal artery, involving both the origin and distal branches, as well as segmental arteries supplying the lower pole of the kidney (Figure 1 Figure 1 Axial contrast-enhanced CT abdomen and pelvis (CTAP) The green arrow highlights a filling defect in the left renal artery, consistent with left renal artery thrombosis. There is reduced enhancement of the left kidney compared to the right, suggesting impaired perfusion. Following a multidisciplinary discussion with the vascular surgery team, it was agreed that the patient should be managed conservatively, given the absence of haemodynamic instability and the resolving nature of her abdominal symptoms. Apixaban was promptly restarted at 5 mg twice daily, and additional investigations were arranged to explore the source and extent of embolic disease. A CT angiogram of the whole aorta, performed the following day after the patient had received two doses of apixaban, demonstrated patency of both renal arteries (Figure 2 Figure 2 Axial CT angiogram of the whole aorta The green arrow points to the left renal artery, which now shows normal contrast opacification, indicating resolution of a previously present thrombus. During her hospital stay, the patient's abdominal symptoms improved with continued IV hydration, anticoagulation with apixaban and a second enema to address her constipation. Her renal function remained static, with a creatinine of 118.00 µmol/L and an eGFR of 37 ml/min/1.73 m² over the following four days. This was considered to reflect her new baseline renal function, likely due to partial infarction. Her medications were adjusted to account for the reduced renal clearance, and she was subsequently discharged home with arrangements for renal and cardiology outpatient follow-up. Long-term renal function data were unavailable, limiting outcome assessment. Discussion We present a case of postoperative acute renal infarction secondary to thromboembolism in the setting of AF, following a total of eight-day interruption of anticoagulation: two days prior to surgery, on the day of surgery, and five days postoperatively. The patient presented with generalised abdominal pain, most marked in the left iliac fossa, alongside elevated blood pressure and biochemical evidence of acute kidney injury. A CT abdomen and pelvis revealed acute thrombosis of the left renal artery with multifocal infarction involving the lower pole of the left kidney. Following the reinitiation of anticoagulation with apixaban 5 mg twice daily, a CT angiogram of the whole aorta performed after two doses of the anticoagulant showed resolution of the previously observed thrombus. However, her renal function remained impaired and did not return to baseline by the time of discharge, four days later. Our case raised two important clinical questions. Firstly, what is the optimal timing of restarting apixaban in a patient with AF following surgery (specifically a unilateral mastectomy with sentinel lymph node biopsy), balancing the risk of thromboembolism and postoperative bleeding? Secondly, are renal artery emboli secondary to AF particularly responsive to DOAC therapy, especially apixaban, given the resolution of the left renal artery thrombus on the CT angiogram imaging after only two doses of apixaban? Previous clinical case reports [ 2 7 To address the first one, we have to gain an understanding of the current guidelines on perioperative DOAC management based on the recent evidence. Guidelines on perioperative DOAC management The perioperative management of DOACs is guided by a combination of factors, including the specific pharmacokinetics of the drug (particularly its half-life), the patient’s renal function and thromboembolic risk, and the bleeding risk associated with the planned surgical procedure. Several professional societies [ 8 To consolidate the evolving body of evidence, the 2021 European Heart Rhythm Association (EHRA) Practical Guide [ 8 9 10 2 Table 2 Summary of perioperative DOAC (apixaban) management: PAUSE study and EHRA 2021 guidelines *Both the PAUSE study and the EHRA guidelines provide a list of procedures which are classified as low or high bleeding risk. **Please note that the interruption duration may require adaptation based on the individual patient characteristics (including age, stroke risk, history of bleeding complications, concomitant medication, kidney function, etc.). ***Apixaban resumption is dependent upon whether haemostasis has been achieved. CrCl: creatinine clearance (mL/min); DOAC: direct oral anticoagulant; PAUSE: Perioperative Anticoagulant Use for Surgery Evaluation; EHRA: European Heart Rhythm Association Source Procedure bleeding risk* Apixaban interruption duration** Apixaban resumption postoperatively*** 1. PAUSE study protocol [ 9 Low 24 hours prior 24 hours  High 48 hours prior 48–72 hours 2. EHRA 2021 guidance [ 8 Low 24 hours prior (if CrCl≥30 mL/min), 36 hrs prior (if 15≤CrCl<30 mL/min) 24 hours  High 48 hours prior (if CrCl≥15 mL/min) 48–72 hours Of note, in the per-protocol analysis of the apixaban cohort in the PAUSE study [ 9 The EHRA guide [ 8 Both interruption and resumption of DOAC therapy should be tailored to individual patient factors, including renal function, prior bleeding history and thromboembolic risk. Risk stratification in our patient Bleeding Risk The timing of postoperative DOAC resumption is closely guided by the bleeding risk associated with the procedure. Although unilateral mastectomy with sentinel lymph node biopsy is not explicitly classified, the perioperative management in our case, specifically withholding anticoagulation for two days preoperatively, suggests the procedure was treated as a high bleeding risk. Full-dose anticoagulation was resumed on postoperative day five. Thromboembolic (Arterial) Risk In our patient, a CHA2DS2-VASc score of five (calculated based on the blood results and observations during the preoperative assessment) indicates a high (arterial) thromboembolic risk, corresponding to a 6.7% annual risk of systemic embolism [ 3 Venous Thromboembolism (VTE) Risk Her VTE risk was assessed using a modified Caprini score, taking into account the following factors: age above 70 years, BMI between 25 and 29 kg/m², use of a self-aid device for mobility, operative time under 90 minutes, and presence of an active malignancy (invasive breast cancer). Based on these criteria, she was classified as having moderate VTE risk, for which the recommended prophylactic measures included early postoperative mobilisation, adequate hydration, intraoperative intermittent pneumatic compression (flowtrons), and the use of thrombo-embolic deterrent (TED) stockings. Routine postoperative prophylactic LMWH was not indicated. Therefore, our patient had a high thromboembolic risk (associated with AF) and a high bleeding risk (associated with the type of surgery). Postoperative management gaps According to the patient’s records, the decision to resume apixaban on postoperative day five was documented in the operative note. As discussed earlier, the timing of DOAC resumption should be guided by the confirmation of adequate haemostasis. Notably, both the operative note and nursing documentation (recorded two hours post surgery) stated that haemostasis had been achieved and there was no active bleeding. Of note, a further postoperative reassessment by the surgical team may have supported an earlier resumption of apixaban, potentially reducing the duration the patient remained without anticoagulation. As summarised in Table 2 11 In addition, given that both the bleeding risk and thromboembolic risk were significant, it could be argued that prophylactic low-dose LMWH should have been initiated postoperatively once haemostasis was established (supported by the 2021 EHRA guide [ 8 This case highlights the clinical challenge of navigating bleeding versus thromboembolic risk in the perioperative setting, particularly in high-risk AF patients, and underscores the importance of individualised reassessment to guide timely anticoagulation decisions. Another notable aspect of our case is the rapid resolution of a left renal artery thrombus following just two doses of apixaban, as demonstrated on CT angiography of the whole aorta. This raises an important clinical question: are renal artery emboli secondary to AF particularly responsive to DOAC therapy? Role of DOACs in the management of renal artery thrombosis Evidence guiding the management of renal artery thrombosis remains limited, with most data stemming from case reports and small case series [ 12 The optimal treatment modality for renal artery embolism remains controversial. No randomised clinical trials have established the superiority of one approach over another. While anticoagulation is a common starting point, some clinicians favour endovascular interventions such as thrombolysis or thrombectomy, particularly where there is potential for renal salvage. However, these procedures require experienced interventional radiologists and carry a risk of procedural complications. Although the literature remains sparse, there are emerging reports of DOAC monotherapy for renal artery thrombosis. Costa et al. (2024) [ 13 14 It is also important to distinguish radiographic resolution of thrombus from functional renal recovery. Restoration of blood flow does not guarantee improved kidney function, particularly if infarction has already occurred. In our case, although the thrombus resolved rapidly, renal function did not improve, suggesting that irreversible damage may have already taken place. Nonetheless, early recognition and treatment are associated with better outcomes and may limit the extent of ischaemic injury. Conclusions Our case adds to the limited but growing body of evidence supporting the potential efficacy of DOAC monotherapy, specifically apixaban, in achieving rapid resolution of renal artery thrombosis, as demonstrated by radiographic clearance within 24 hours of DOAC initiation. However, renal function did not improve, underscoring the importance of early diagnosis before irreversible infarction occurs. This observation supports that apixaban may be effective in selected cases, but it should be interpreted with caution, given the limited evidence currently available. Further clinical studies and detailed case reporting are needed to define the role of DOACs in the conservative management of renal artery thrombosis. Similarly, this case also reinforces the need for individualised dynamic reassessment of perioperative anticoagulation in AF patients. The delayed resumption of apixaban combined with the non-consideration of low-dose LMWH and a lack of a further surgical review to confirm haemostasis likely contributed to the development of a renal artery thromboembolism, emphasising the need for individualised anticoagulation planning. Disclosures Human subjects: Conflicts of interest: Payment/services info: Financial relationships: Other relationships: Author Contributions Concept and design: Acquisition, analysis, or interpretation of data: Drafting of the manuscript: Critical review of the manuscript for important intellectual content: References 1 ED presentations of acute renal infarction Am J Emerg Med Huang CC Lo HC Huang HH 164 169 25 2007 17276805 10.1016/j.ajem.2006.06.010 2 Acute renal infarction: a case series Clin J Am Soc Nephrol Bourgault M Grimbert P Verret C 392 398 8 2013 23204242 10.2215/CJN.05570612 PMC3586969 3 Identifying patients at high risk for stroke despite anticoagulation: a comparison of contemporary stroke risk stratification schemes in an anticoagulated atrial fibrillation cohort Stroke Lip GY Frison L Halperin JL Lane DA 2731 2738 41 2010 20966417 10.1161/STROKEAHA.110.590257 4 Noncentral nervous system systemic embolism in patients with atrial fibrillation: results from ROCKET AF (rivaroxaban once daily, oral, direct factor Xa inhibition compared with vitamin K antagonism for prevention of stroke and embolism trial in atrial fibrillation) Circ Cardiovasc Qual Outcomes Orgel R Wojdyla D Huberman D 0 10 2017 10.1161/CIRCOUTCOMES.116.003520 PMC5485838 28495674 5 Bleeding with direct oral anticoagulants vs warfarin: clinical experience Am J Med Eikelboom J Merli G 0 40 129 2016 10.1016/j.amjmed.2016.06.003 27586367 6 Perioperative management of direct oral anticoagulants (DOACs): a systemic review Health Serv Insights Sunkara T Ofori E Zarubin V Caughey ME Gaduputi V Reddy M 25 36 9 2016 28008269 10.4137/HSI.S40701 PMC5156547 7 Spontaneous renal artery thrombosis: a rare cause of acute flank pain Radiol Case Rep Lim HJ Hwang JH Kim JH Park S Lee KH Park SH 9 12 16 2021 33144903 10.1016/j.radcr.2020.10.027 PMC7596017 8 2021 European Heart Rhythm Association practical guide on the use of non-vitamin K antagonist oral anticoagulants in patients with atrial fibrillation Europace Steffel J Collins R Antz M 1612 1676 23 2021 33895845 10.1093/europace/euab065 PMC11636576 9 Perioperative management of patients with atrial fibrillation receiving a direct oral anticoagulant JAMA Intern Med Douketis JD Spyropoulos AC Duncan J 1469 1478 179 2019 31380891 10.1001/jamainternmed.2019.2431 PMC6686768 10 Perioperative factor Xa inhibitor discontinuation for patients undergoing procedures with minimal or low bleeding risk JAMA Netw Open Lee SR Lee KY Park JS 0 8 2025 10.1001/jamanetworkopen.2024.58742 PMC11806392 39918817 11 Periprocedural direct oral anticoagulant management: the RA-ACOD prospective, multicenter real-world registry TH Open Ferrandis R Llau JV Sanz JF 0 37 4 2020 10.1055/s-0040-1712476 PMC7319799 32607466 12 Acute renal artery embolisation: role of local catheter-based intra-arterial thrombolysis BMJ Case Rep Ganju N Sondhi S Kandoria A 0 2018 2018 10.1136/bcr-2018-224767 PMC6020968 29930186 13 Bilateral renal artery thrombosis: a rare case of severe kidney failure with partial recovery under apixaban Port Kid J Costa C Oliveira J Branco C Fernandes P Lopes JA Fonseca JA 108 113 38 2024 14 Renal infarction in a patient with thyrotoxicosis-induced atrial fibrillation treated successfully with dabigatran, a case report and literature review Clin Case Rep Al-Sadi A Abdulgayoom M Alamin M Kolleri J Jawarneh I Almaharmeh Q 0 10 2022 10.1002/ccr3.6693 PMC9723477 36483878 ",
  "metadata": {
    "Title of this paper": "Renal infarction in a patient with thyrotoxicosis-induced atrial fibrillation treated successfully with dabigatran, a case report and literature review",
    "Journal it was published in:": "Cureus",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490822/"
  }
}