{
  "title": "Paper_977",
  "abstract": "pmc Pharmaceuticals (Basel) Pharmaceuticals (Basel) 2102 pharmaceuticals pharmaceuticals Pharmaceuticals 1424-8247 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472990 PMC12472990.1 12472990 12472990 41011132 10.3390/ph18091260 pharmaceuticals-18-01260 1 Article BthTX-II, an Asp49 PLA 2 Bothrops jararacussu Toxoplasma gondii https://orcid.org/0000-0003-0599-7113 Oliveira Vinícius Queiroz Methodology Validation Formal analysis Investigation Writing – original draft Writing – review & editing 1 https://orcid.org/0000-0003-4425-1867 Ferreira Emanuelle Lorrayne Methodology Investigation 1 Morais Lorena Pinheiro Methodology 1 https://orcid.org/0009-0005-8676-630X Garcia Leonardo Alves Methodology 1 Sousa Gabriel de Oliveira Methodology 1 https://orcid.org/0000-0003-3835-1925 Almeida Marcos Paulo Oliveira Methodology Formal analysis Investigation 2 de Souza Guilherme Methodology Investigation 2 Júnior Joed Pires de Lima Methodology 2 dos Santos Natália Carine Lima Methodology 2 https://orcid.org/0000-0002-1608-9172 de Oliveira Rafael Martins Methodology 2 Costa Tássia Rafaela Methodology Investigation 3 Soares Andreimar Martins Methodology Investigation 3 Santos Luísa Carregosa Methodology Investigation 4 Lopes Daiana Silva Supervision 4 https://orcid.org/0000-0002-4735-5162 Beraldo-Neto Emidio Methodology Investigation 5 Gomes Angelica Oliveira Methodology 6 Madeira Jovita Eugênia Gazzinelli Cruz Resources 7 https://orcid.org/0000-0003-4611-2844 Barbosa Bellisa Freitas Conceptualization Resources 2 https://orcid.org/0000-0002-7447-2583 Ferro Eloisa Amália Vieira Conceptualization Resources 2 Teixeira Samuel Cota Conceptualization Resources Writing – review & editing Supervision Project administration 2 * https://orcid.org/0000-0002-3386-9197 Ávila Veridiana de Melo Rodrigues Conceptualization Resources Writing – review & editing Supervision Project administration 1 * Omri Abdelwahab Academic Editor 1 viniciusqueirozbio@gmail.com emanuelle.ferreira@ufu.br lorena10morais@gmail.com garcia7557alves@gmail.com gabrieldeosousa@ufu.br 2 marcospaulooliveiraalmeida@hotmail.com guisbio@hotmail.com joedjunior07@gmail.com carinenatalia@yahoo.com.br rafael_martinso@hotmail.com bellisafb@ufu.br eloisa.ferro@ufu.br 3 tassiarcosta@yahoo.com.br andreimarsoares@gmail.com 4 luisacarregosabio@gmail.com lsdaiana@yahoo.com.br 5 emidio.beraldo@butantan.gov.br 6 angelica.gomes@ufu.br 7 jovigazzinelli@gmail.com * samuel.teixeira@ufu.br veridiana@ufu.br 25 8 2025 9 2025 18 9 497460 1260 27 6 2025 13 8 2025 21 8 2025 25 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives Toxoplasma gondii 2 2 Bothrops jararacussu T. gondii Methods T. gondii Results T. gondii T. gondii Conclusions congenital toxoplasmosis phospholipase A 2 trophoblast snake venom Universidade Federal de Uberlândia (UFU) Fundação de Amparo à Pesquisa do Estado de Minas Gerais (FAPEMIG) Conselho Nacional de Desenvolvimento Científico e Tecnológico (CNPq) This research was funded by the Universidade Federal de Uberlândia (UFU), Fundação de Amparo à Pesquisa do Estado de Minas Gerais (FAPEMIG), and Conselho Nacional de Desenvolvimento Científico e Tecnológico (CNPq). This study was also funded in part by the Coordenação de Aperfeiçoamento de Pessoal de Nível Superior—Brazil (CAPES)—Finance Code 001. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Toxoplasma gondii 1 2 3 4 5 6 In pregnant women, infection may occur during or shortly before pregnancy, allowing tachyzoites to cross the placenta and infect the foetus. This can lead to severe complications, including stillbirth, prematurity, growth restriction, neurological and ocular impairments, and miscarriage [ 1 7 8 9 Maternal immune adaptations are essential for sustaining pregnancy, as cells at the maternal–foetal interface establish a tolerogenic microenvironment within the placenta that supports foetal development [ 10 T. gondii T. gondii 11 12 13 Treatment of infected pregnant individuals often begins with spiramycin to prevent transmission to the foetus; however, its limited ability to cross the placenta restricts its effectiveness against foetal infections [ 14 15 14 14 16 17 18 19 From this perspective, animal toxins have gained attention due to their therapeutic potential, as they comprise a diverse collection of biomolecules capable of effectively interfering with various physiological mechanisms. Among the molecules already known to mediate physiological events are the bradykinin-potentiating peptides (BPPs), isolated from the venom of Bothrops jararaca ® 20 ® ® Ecchis carinatus Sistrurus miliarius barbourin 21 22 In this context, animal-derived toxins have attracted considerable interest for their antiparasitic properties, especially in relation to Toxoplasma gondii 23 24 2 2 25 26 27 PLA 2 28 29 2 2 2 2+ 30 31 32 2 2+ 33 34 The anti- T gondii 2 25 2 Bothrops pauloensis T. gondii 2 Bothrops moojeni 27 T. gondii 2 2 T. gondii BthTX-II, an Asp49 PLA 2 Bothrops jararacussu 2 2+ 35 36 2+ 37 38 38 39 40 41 42 43 44 2 T. gondii 2. Results 2.1. BthTX-II Inhibits Proliferation of T. gondii Without Causing Toxicity to Trophoblasts Cell viability was initially assessed using the [(3-(4,5-dimethylthiazol-2-yl)-2,5-diphenyltetrazolium bromide)] (MTT) assay to determine safe concentrations of BthTX-II for subsequent experiments. BeWo cells were exposed to a twofold serial dilution of BthTX-II (ranging from 100 to 0.78 μg/mL) for 24 h. As shown in Figure 1 p To evaluate the half-maximal inhibitory concentration (IC 50 T. gondii T. gondii p Figure 1 T. gondii p Figure 1 50 2.2. BthTX-II Directly Affects Parasites and Impairs Early Stages of T. gondii Infection in BeWo Cells, but Its Antiparasitic Effect Is Lost After Treatment Removal To investigate the potential of BthTX-II to disrupt the initial stages of T. gondii T. gondii p p Figure 2 p p Figure 2 To validate these findings, we performed a red/green assay to distinguish between adhered and intracellular parasites. Pre-treatment of BeWo cells with BthTX-II (3.125 μg/mL) for 24 h significantly decreased the number of adhered (** p p Figure 2 Figure 2 Figure 2 T. gondii Additionally, we pre-treated T. gondii Figure 2 T. gondii p Figure 2 2.3. BthTX-II Upregulates the IL-6, IL-8, and Macrophage Migration Inhibitory Factor (MIF) Levels and Downregulates VEGF Production in T. gondii-Infected BeWo Cells To investigate the effect of BthTX-II (3.125 μg/mL) in modulating the host immune response triggered by BeWo cells during T. gondii BthTX-II (3.125 μg/mL) treatment upregulated IL-6 levels in both uninfected (** p p Figure 3 p p Figure 3 Similarly, BthTX-II (3.125 μg/mL) led to a marked increase in IL-8 levels in both uninfected and infected cells compared to those in the uninfected, untreated and infected, untreated cells (**** p Figure 3 Figure 3 Moreover, BthTX-II treatment significantly increased MIF production only in T. gondii p Figure 3 Figure 3 The effect of BthTX-II on VEGF production by BeWo cells was also investigated. T. gondii p p p Figure 3 T. gondii Figure 3 IL-4 and IL-10 were undetectable in supernatants from BeWo cells. 2.4. BthTX-II Reduces T. gondii Proliferation in Human Placental Explants To further validate the findings in BeWo cells, we assessed the impact of BthTX-II on the susceptibility of placental explants to T. gondii Cell viability was initially evaluated using the MTT assay, which revealed significant cytotoxicity at concentrations of 6.25 μg/mL and above, compared to that in the control group (**** p Figure 4 p p Figure 4 Figure 4 Figure 4 Corroborating our in vitro findings, treatment with 1.56 μg/mL BthTX-II significantly reduced parasite proliferation compared to that in the control group (*** p Figure 5 p Figure 5 2.5. BthTX-II Modulates IL-8, MIF, and TNF-α Production in T. gondii-Infected Human Placental Explants To evaluate the immunomodulatory effects of BthTX-II, we measured the secretion of cytokines (IL-4, IL-6, IL-8, IL-10, TNF-α, and MIF) from human villous explants under various experimental conditions. Our results demonstrated that both BthTX-II (1.56 μg/mL) and S+P treatments significantly reduced IL-8 production in T. gondii p Figure 5 Treatment with BthTX-II (1.56 μg/mL) (* p p Figure 5 T. gondii p Figure 5 BthTX-II (1.56 μg/mL) treatment significantly increased TNF-α production (* p Figure 5 T. gondii p Figure 5 IL-4, IL-6, and IL-10 production were undetectable in supernatants from BeWo cells. 3. Discussion Congenital toxoplasmosis remains a significant global health challenge. Lack of an effective vaccine or therapeutic treatment underscores the urgent need to identify and develop alternative treatments that are both safe for mothers and foetuses and capable of preventing the vertical transmission of T. gondii 7 45 26 46 47 27 2 B. jararacussu T. gondii BthTX-II effectively inhibited T. gondii 2 2 B. pauloensis T. gondii 25 2 B. moojeni T. gondii T. gondii 27 T. gondii 2 These findings are consistent with those of other studies that investigated Asp49 PLA 2 48 2 Bothrops leucurus 49 2 Naja naja 50 Daboia russelii pulchella 51 Leishmania amazonensis 52 2 Next, we evaluated whether the reduction in parasite proliferation was due to an effect of the toxin on the parasite, the host cell, or both. Our data indicate that BthTX-II pretreatment of both cells and parasites significantly impaired T. gondii 27 T. gondii T. gondii T. gondii Subsequently, we investigated which host mechanisms are triggered by BthTX-II that may contribute to the control of T. gondii T. gondii 53 54 55 53 54 55 According to Jebbari et al. (1998), IL-6 plays a crucial role in both the inflammatory response and its resolution [ 56 57 58 T. gondii T. gondii 53 59 MIF functions as a critical regulator of immune and inflammatory responses, serving as a key cytokine in the defence against pathogens, including T. gondii 11 60 T. gondii 61 T. gondii 62 63 T. gondii 64 65 66 T. gondii 67 68 69 70 The ability of BthTX-II to enhance the production of IL-6, IL-8, and MIF may play a key role in modulating the immune response and limiting T. gondii svPLA 2 28 71 2 72 2 Agkistrodon piscivorus 72 T. gondii 73 The present study demonstrates a significant decrease in VEGF levels in the supernatant of T. gondii 2 T. gondii 27 44 74 75 To support the in vitro findings and confirm the effectiveness of BthTX-II in inhibiting T. gondii T. gondii Given the complexity of immune responses during pregnancy, we evaluated the impact of BthTX-II on cytokine production in villous explants. In contrast to BeWo cells, BthTX-II reduced the secretion of IL-8 and MIF in villi infected by T. gondii 76 77 78 79 T. gondii 4. Materials and Methods 4.1. Preparation of Asp49-PLA 2 BthTX-II used in this study was obtained from the Toxin Repository of the Laboratory of Biochemistry and Animal Toxins (LABITOX), following the recommended purification and storage protocols [ 80 4.2. PL Activity of BthTX-II The PLA 2 81 2 2 4.3. Cell Culture and Parasite Maintenance Human trophoblast cells (BeWo lineage) were obtained from the American Type Culture Collection (CCL-98 TM 65 To control for variability due to cell passage, all experiments were conducted using cells within a limited passage range. The cell passages are an important factor in cell culture, and in our studies, we limited them to 10 passages according to Liao et al., 2014 [ 82 T. gondii 65 2 4.4. Human Placental Explants Third-trimester human placentas (36–40 weeks of gestation, N = 9) were collected following elective caesarean deliveries at the Hospital de Clínicas, Universidade Federal de Uberlândia, MG, Brazil. The study was approved by the appropriate Ethics Committee (approval number: 7.407.162). Placental tissues were selected based on predefined exclusion criteria. Individuals were excluded if they presented with conditions such as preeclampsia, chronic hypertension, active infections (e.g., toxoplasmosis, leishmaniasis, trypanosomiasis), chorioamnionitis, chronic kidney or heart disease, connective tissue disorders, pre-existing or gestational diabetes mellitus, or any other medical issues that could confound the study outcomes [ 65 83 For the human villous explants, these were obtained exclusively from third-trimester placentas, and biological replicates were derived from multiple independent donors (n = 3). We ensured that all donors met the same inclusion criteria and followed standardised collection and processing protocols to minimise inter-donor variability. This approach was adopted to increase the reproducibility and translational relevance of our findings. Floating terminal chorionic villous explants (~10 mm 3 2 4.5. Cell Viability in BeWo Cells BeWo cells (3 × 10 4 2 2 N N 84 4.6. Proliferation of T. gondii To evaluate the effects of BthTX-II on T. gondii 4 2 T. gondii 2 65 T. gondii T. gondii 6 3 55 85 4.7. Invasion and Proliferation Pre-Treating T. gondii or BeWo To evaluate the effect of BthTX-II on T. gondii 4 2 T. gondii 2 T. gondii T. gondii In the second model, BeWo cells (3 × 10 4 T. gondii 2 T. gondii In the third model, BeWo cells (3 × 10 4 2 T. gondii T. gondii T. gondii 4.8. Reversibility Assay The persistence of the antiparasitic effect of BthTX-II was assessed using a reversibility assay, as previously described [ 86 87 4 T. gondii 2 2 T. gondii 4.9. Adhesion and Invasion Assay (“Red/Green Assay”) The green/red antibody differential staining assay was used to confirm the role of BthTX-II in the early stages of T. gondii 65 83 88 5 2 T. gondii 2 T. gondii T. gondii 66 4.10. Viability of Placental Villous Explants Placental villous explants were collected and cultured for 24 h. Tissue viability was assessed using MTT, LDH, and histological assays according to established protocols [ 83 2 T. gondii 65 In parallel, under the same experimental conditions, tissue viability was assessed using the MTT assay. Following treatment, culture supernatants were discarded and replaced with 200 µL of MTT solution (180 µL of culture medium plus 20 µL of MTT [5 mg/mL]) and incubated for 4 h at 37 °C and 5% CO 2 2 4.11. T. gondii Infection in Human Placental Villous Explants We evaluated the intracellular proliferation of T. gondii 2 T. gondii 6 2 T. gondii 65 4.12. Cytokine and VEGF Determination Cytokine assays were performed to assess the host immune responses to T. gondii VEGF levels in the supernatant of BeWo cells were measured using a commercial Cytokine Bead Array kit for cellular proteins (BD Biosciences, San Jose, CA, USA), following the manufacturer’s instructions. VEGF levels were calculated based on a standard curve with a detection limit of 10 pg/mL. Samples were analysed using a CytoFLEX flow cytometer (Beckman Coulter, Brea, CA, USA) and FlowJo software (version 7.6.3). 4.13. Statistical Analysis All data are presented as mean ± standard error of the mean ± SEM. Data were tested for normality. If they met parametric criteria, they were analysed using one-way ANOVA followed by Sidak’s multiple comparison test. For non-parametric data, the Kruskal–Wallis test followed by Dunn’s multiple comparisons post-test was used. Statistical analyses were performed using GraphPad Prism ® p p p p 5. Conclusions Our findings demonstrate that BthTX-II exhibits significant anti- Toxoplasma gondii This study provides novel insights into the potential of BthTX-II as a biotechnological tool for identifying new therapeutic targets in maternal–foetal toxoplasmosis. Additionally, it enhances our understanding of the molecular mechanisms underlying T. gondii Acknowledgments The authors acknowledge the Universidade Federal de Uberlândia (UFU) and the MultiLab Abadia—Centro de Pesquisa Multiusuário Aluízio Prata (Universidade Federal do Triângulo Mineiro, Uberaba, Brazil) for kindly providing access to the Aperio VERSA 200 BF & Fluorescence scanner. Disclaimer/Publisher’s Note: Author Contributions Conceptualisation: B.F.B., E.A.V.F., S.C.T. and V.d.M.R.Á.; Formal analysis: V.Q.O. and M.P.O.A.; Investigation: V.Q.O., E.L.F., M.P.O.A., G.d.S., J.P.d.L.J., N.C.L.d.S., R.M.d.O., T.R.C., A.M.S., L.C.S. and E.B.-N.; Methodology: V.Q.O., E.L.F., L.P.M., L.A.G., G.d.O.S., M.P.O.A., G.d.S., T.R.C., A.M.S., L.C.S., E.B.-N. and A.O.G.; Project administration: S.C.T. and V.d.M.R.Á.; Resources: J.E.G.C.M., B.F.B., E.A.V.F., S.C.T. and V.d.M.R.Á.; Supervision: D.S.L., S.C.T. and V.d.M.R.Á.; Validation: V.Q.O.; Writing—original draft: V.Q.O.; Writing—review and editing: V.Q.O., S.C.T. and V.d.M.R.Á. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was conducted in accordance with the Declaration of Helsinki and approved by the Ethics Committee of Universidade Federal de Uberlândia (protocol code 7.407.162; approved February 2025). Informed Consent Statement Written informed consent was obtained from all participants involved in the study. Data Availability Statement The original data presented in this study are included in this article. Further inquiries can be directed to the corresponding authors. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations PLA 2 2 2 2 N N References 1. Dubey J.P. Murata F.H.A. Cerqueira-Cézar C.K. Kwok O.C.H. Villena I. Congenital Toxoplasmosis in Humans: An Update of Worldwide Rate of Congenital Infections Parasitology 2021 148 1406 1416 10.1017/S0031182021001013 34254575 PMC11010219 2. Montoya J.G. Liesenfeld O. Toxoplasmosis Lancet 2004 363 1965 1976 10.1016/S0140-6736(04)16412-X 15194258 3. Flegr J. Prandota J. Sovičková M. Israili Z.H. Toxoplasmosis-A Global Threat. Correlation of Latent Toxoplasmosis with Specific Disease Burden in a Set of 88 Countries PLoS ONE 2014 9 e90203 10.1371/journal.pone.0090203 24662942 PMC3963851 4. Bollani L. Auriti C. Achille C. Garofoli F. De Rose D.U. Meroni V. Salvatori G. Tzialla C. Congenital Toxoplasmosis: The State of the Art Front. Pediatr. 2022 10 894573 10.3389/fped.2022.894573 35874584 PMC9301253 5. Torgerson P.R. Mastroiacovo P. The Global Burden of Congenital Toxoplasmosis: A Systematic Review Bull. World Health Organ. 2013 91 501 508 10.2471/BLT.12.111732 23825877 PMC3699792 6. de Deus Miranda G. Fiori A.V.D. Martins J.P.P. Vieira L.G.S. Ribeiro T.F.S. Vitorino G.H. da Costa Filho M.A.L. Freire I.F. Um Estudo a Respeito Do Cenário Epidemiológico Da Toxoplasmose Congênita No Brasil Braz. J. Implantol. Health Sci. 2025 7 729 739 10.36557/2674-8169.2025v7n4p729-739 7. Aguirre A.A. Longcore T. Barbieri M. Dabritz H. Hill D. Klein P.N. Lepczyk C. Lilly E.L. McLeod R. Milcarsky J. The One Health Approach to Toxoplasmosis: Epidemiology, Control, and Prevention Strategies EcoHealth 2019 16 378 390 10.1007/s10393-019-01405-7 30945159 PMC6682582 8. De Barros R.A.M. Torrecilhas A.C. Marciano M.A.M. Mazuz M.L. Pereira-Chioccola V.L. Fux B. Toxoplasmosis in Human and Animals Around the World. Diagnosis and Perspectives in the One Health Approach Acta Trop. 2022 231 106432 10.1016/j.actatropica.2022.106432 35390311 9. Robert-Gangneux F. Dardé M.L. Epidemiology of and Diagnostic Strategies for Toxoplasmosis Clin. Microbiol. Rev. 2012 25 264 296 10.1128/CMR.05013-11 22491772 PMC3346298 10. Zhao L. Shao Q. Zhang Y. Zhang L. He Y. Wang L. Kong B. Qu X. Human Monocytes Undergo Functional Re-Programming during Differentiation to Dendritic Cell Mediated by Human Extravillous Trophoblasts Sci. Rep. 2016 6 20409 10.1038/srep20409 26857012 PMC4746586 11. Ferreira P.T.M. Oliveira-Scussel A.C.M. Sousa R.A.P. Gomes B.Q. Félix J.E. Silva R.J. Millian I.B. Assunção T.S.F. Teixeira S.C. Gomes M.D.L.M. Macrophage Migration Inhibitory Factor Contributes to Drive Phenotypic and Functional Macrophages Activation in Response to Toxoplasma gondii Immunobiology 2023 228 152357 10.1016/j.imbio.2023.152357 36857907 12. Zhang J.M. An J. Cytokines, Inflammation, and Pain Int. Anesth. Anesthesiol. Clin. 2007 45 27 37 10.1097/AIA.0b013e318034194e 17426506 PMC2785020 13. Moghaddami R. Mahdipour M. Ahmadpour E. Inflammatory Pathways of Toxoplasma gondii Travel. Med. Infect. Dis. 2024 62 102760 10.1016/j.tmaid.2024.102760 39293589 14. Prasil P. Sleha R. Kacerovsky M. Bostik P. Comparison of Adverse Reactions of Spiramycin versus Pyrimethamine/Sulfadiazine Treatment of Toxoplasmosis in Pregnancy: Is Spiramycin Really the Drug of Choice for Unproven Infection of the Fetus? J. Matern. Fetal Neonatal Med. 2023 36 2215377 10.1080/14767058.2023.2215377 37217458 15. Singh S. Congenital Toxoplasmosis: Clinical Features, Outcomes, Treatment, and Prevention Trop. Parasitol. 2016 6 113 122 10.4103/2229-5070.190813 27722099 PMC5048697 16. Meneceur P. Bouldouyre M.A. Aubert D. Villena I. Menotti J. Sauvage V. Garin J.F. Derouin F. in vitro Susceptibility of Various Genotypic Strains of Toxoplasma gondii Antimicrob. Agents Chemother. 2008 52 1269 10.1128/AAC.01203-07 18212105 PMC2292506 17. Montazeri M. Mehrzadi S. Sharif M. Sarvi S. Tanzifi A. Aghayan S.A. Daryani A. Drug Resistance in Toxoplasma gondii Front. Microbiol. 2018 9 299255 10.3389/fmicb.2018.02587 PMC6215853 30420849 18. Jacobson J.M. Hafner R. Remington J. Farthing C. Holden-Wiltse J. Bosler E.M. Harris C. Jayaweera D.T. Roque C. Luft B.J. Dose-Escalation, Phase 1/11 Study of Azithromycin and Pyrimethamine for the Treatment of Toxoplasmic Encephalitis in AIDS AIDS 2001 15 583 589 10.1097/00002030-200103300-00007 11316995 19. Torres R.A. Weinberg W. Stansell J. Leoung G. Kovacs J. Rogers M. Scott J. Atovaquone for Salvage Treatment and Suppression of Toxoplasmic Encephalitis in Patients with AIDS Clin. Infect. Dis. 1997 24 422 429 10.1093/clinids/24.3.422 9114194 20. Ferreira S.H. A bradykinin-potentiating factor (BPF) present in the venom of Bothrops jararaca Br. J. Pharmacol. Chemother. 1965 24 163 169 10.1111/j.1476-5381.1965.tb02091.x 14302350 PMC1704050 21. Huang T.F. Holt J.C. Lukasiewicz H. Niewiarowski S. Trigramin. A Low Molecular Weight Peptide Inhibiting Fibrinogen Interaction with Platelet Receptors Expressed on Glycoprotein IIb-IIIa Complex J. Biol. Chem. 1987 262 16157 16163 10.1016/S0021-9258(18)47710-1 3680247 22. Koh C.Y. Kini R.M. From Snake Venom Toxins to Therapeutics—Cardiovascular Examples Toxicon 2012 59 497 506 10.1016/j.toxicon.2011.03.017 21447352 23. Bastos L.M. Júnior R.J.O. Silva D.A.O. Mineo J.R. Vieira C.U. Teixeira D.N.S. Homsi-Brandeburgo M.I. Rodrigues V.M. Hamaguchi A. Toxoplasma Gondii: Effects of Neuwiedase, a Metalloproteinase from Bothrops neuwiedi Exp. Parasitol. 2008 120 391 396 10.1016/j.exppara.2008.09.008 18823981 24. Liu X. Zhang P. Liu Y. Li J. Yang D. Liu Z. Jiang L. Anti- Toxoplasma gondii Toxins 2023 15 477 10.3390/toxins15080477 37624234 PMC10467082 25. Borges I.P. Castanheira L.E. Barbosa B.F. De Souza D.L.N. Da Silva R.J. Mineo J.R. Tudini K.A.Y. Rodrigues R.S. Ferro E.A.V. De Melo Rodrigues V. Anti-Parasitic Effect on Toxoplasma gondii 2 Bothrops pauloensis Toxicon 2016 119 84 91 10.1016/j.toxicon.2016.05.010 27212627 26. Teixeira S.C. da Silva M.S. Gomes A.A. Moretti N.S. Lopes D.S. Ferro E.A. de Melo Rodrigues V. Panacea within a Pandora’s Box: The Antiparasitic Effects of Phospholipases A 2 2 Trends Parasitol. 2022 38 80 94 10.1016/j.pt.2021.07.004 34364805 27. Teixeira S.C. de Melo Fernandes T.A. de Souza G. Rosini A.M. Fajardo Martínez A.F. Gomes A.O. Alves R.N. Lopes D.S. da Silva M.V. Beraldo-Neto E. MjTX-II, a Lys49-PLA 2 Bothrops moojeni Toxoplasma gondii Chem. Biol. Interact. 2025 409 111417 10.1016/j.cbi.2025.111417 39922520 28. Kini R.M. Evans H.J. A Model to Explain the Pharmacological Effects of Snake Venom Phospholipases A 2 Toxicon 1989 27 613 635 10.1016/0041-0101(89)90013-5 2665186 29. Soares A.M. Andrião-Escarso S.H. Angulo Y. Lomonte B. Gutiérrez J.M. Marangoni S. Toyama M.H. Arni R.K. Giglio J.R. Structural and Functional Characterization of Myotoxin I, a Lys49 Phospholipase A(2) Homologue from Bothrops moojeni Arch. Biochem. Biophys. 2000 373 7 15 10.1006/abbi.1999.1492 10620318 30. Filkin S.Y. Lipkin A.V. Fedorov A.N. Phospholipase Superfamily: Structure, Functions, and Biotechnological Applications Biochemistry 2020 85 177 195 10.1134/S0006297920140096 32087059 31. Gutiérrez J.M. Lomonte B. Phospholipases A 2 Toxicon 2013 62 27 39 10.1016/j.toxicon.2012.09.006 23025922 32. Lomonte B. Angulo Y. Sasa M. Gutierrez J. The Phospholipase A 2 Protein Pept. Lett. 2009 16 860 876 10.2174/092986609788923356 19689412 33. Lomonte B. Angulo Y. Calderón L. An Overview of Lysine-49 Phospholipase A 2 Toxicon 2003 42 885 901 10.1016/j.toxicon.2003.11.008 15019489 34. Ward R.J. Chioato L. Ruller R. Sá J.M. Active-Site Mutagenesis of a Lys49-Phospholipase A 2 Biochem. J. 2002 362 89 10.1042/bj3620089 11829743 PMC1222363 35. Homsi-Brandeburgo M.I. Queiroz L.S. Santo-Neto H. Rodrigues-Simioni L. Giglio J.R. Fractionation of Bothrops jararacussu Toxicon 1988 26 615 627 10.1016/0041-0101(88)90244-9 3176051 36. Pereira M.F. Novello J.C. Cintra A.C.O. Giglio J.R. Landucci E.T. Oliveira B. Marangoni S. The Amino Acid Sequence of Bothropstoxin-II, an Asp-49 Myotoxin from Bothrops jararacussu 2 J. Protein Chem. 1998 17 381 386 10.1023/A:1022563401413 9619591 37. Corrêa L.C. Marchi-Salvador D.P. Cintra A.C.O. Sampaio S.V. Soares A.M. Fontes M.R.M. Crystal Structure of a Myotoxic Asp49-Phospholipase A 2 2+ Biochim. Biophys. Acta 2008 1784 591 599 10.1016/j.bbapap.2008.01.007 18261474 38. Borges R.J. Salvador G.H.M. Campanelli H.B. Pimenta D.C. de Oliveira Neto M. Usón I. Fontes M.R.M. BthTX-II from Bothrops jararacussu 2 Int. J. Biol. Macromol. 2021 191 255 266 10.1016/j.ijbiomac.2021.09.083 34547312 39. Andrião-Escarso S.H. Soares A.M. Fontes M.R.M. Fuly A.L. Corrêa F.M.A. Rosa J.C. Greene L.J. Giglio J.R. Structural and Functional Characterization of an Acidic Platelet Aggregation Inhibitor and Hypotensive Phospholipase A 2 Bothrops jararacussu Biochem. Pharmacol. 2002 64 723 732 10.1016/S0006-2952(02)01210-8 12167491 40. Boeno C.N. Paloschi M.V. Lopes J.A. Souza Silva M.D. Evangelista J.R. dos Reis V.P. da Setúbal S. Soares A.M. Zuliani J.P. Dynamics of Action of a Lys-49 and an Asp-49 PLA 2 Int. Immunopharmacol. 2022 112 109194 10.1016/j.intimp.2022.109194 36041255 41. De Castro R.C. Landucci E.C.T. Toyama M.H. Giglio J.R. Marangoni S. De Nucci G. Antunes E. Leucocyte Recruitment Induced by Type II Phospholipases A 2 Toxicon 2000 38 1773 1785 10.1016/S0041-0101(00)00107-0 10858516 42. Landucci E.C.T. Castro R.C. Pereira M.F. Cintra A.C.O. Giglio J.R. Marangoni S. Oliveira B. Cirino G. Antunes E. De Nucci G. Mast Cell Degranulation Induced by Two Phospholipase A 2 Eur. J. Pharmacol. 1998 343 257 263 10.1016/S0014-2999(97)01546-X 9570475 43. de Azevedo F.V.P.V. Zóia M.A. Lopes D.S. Gimenes S.N. Vecchi L. Alves P.T. Rodrigues R.S. Silva A.C.A. Yoneyama K.A.G. Goulart L.R. Antitumor and Antimetastatic Effects of PLA 2 Bothrops jararacussu Int. J. Biol. Macromol. 2019 135 261 273 10.1016/j.ijbiomac.2019.05.164 31128190 44. de Azevedo F.V.P.V. Lopes D.S. Zóia M.A.P. Correia L.I.V. Saito N. Fonseca B.B. Polloni L. Teixeira S.C. Goulart L.R. de Melo Rodrigues Ávila V. A New Approach to Inhibiting Triple-Negative Breast Cancer: In Vitro, Ex Vivo and In Vivo Antiangiogenic Effect of BthTx-II, a PLA 2 Bothrops jararacussu Biomolecules 2022 12 258 10.3390/BIOM12020258 35204758 PMC8961627 45. Wei H.-X. Wei S.-S. Lindsay D.S. Peng H.-J. A Systematic Review and Meta-Analysis of the Efficacy of Anti- Toxoplasma gondii PLoS ONE 2015 10 138204 10.1371/journal.pone.0138204 26394212 PMC4578932 46. Zieler H. Keister D.B. Dvorak J.A. Ribeiro J.M.C. A Snake Venom Phospholipase A 2 J. Exp. Biol. 2001 204 4157 4167 10.1242/jeb.204.23.4157 11809789 47. Adade C.M. Carvalho A.L.O. Tomaz M.A. Costa T.F.R. Godinho J.L. Melo P.A. Lima A.P.C.A. Rodrigues J.C.F. Zingali R.B. Souto-Padrón T. Crovirin, a Snake Venom Cysteine-Rich Secretory Protein (CRISP) with Promising Activity against Trypanosomes and Leishmania PLoS Negl. Trop. Dis. 2014 8 e3252 10.1371/journal.pntd.0003252 25330220 PMC4199522 48. Cassani N.M. Santos I.A. Grosche V.R. Ferreira G.M. Guevara-Vega M. Rosa R.B. Pena L.J. Nicolau-Junior N. Cintra A.C.O. Mineo T.P. Roles of Bothrops jararacussu Int. J. Biol. Macromol. 2023 227 630 640 10.1016/j.ijbiomac.2022.12.102 36529220 49. Cecilio A.B. Caldas S. De Oliveira R.A. Santos A.S.B. Richardson M. Naumann G.B. Schneider F.S. Alvarenga V.G. Estevão-Costa M.I. Fuly A.L. Molecular Characterization of Lys49 and Asp49 Phospholipases A 2 Toxins 2013 5 1780 1798 10.3390/toxins5101780 24131891 PMC3813911 50. Sudarshan S. Dhananjaya B.L. Antibacterial Activity of an Acidic Phospholipase A 2 2 Naja naja Springerplus 2016 5 112 10.1186/s40064-016-1690-y 26885465 PMC4740474 51. Sudharshan S. Dhananjaya B.L. Antibacterial Potential of a Basic Phospholipase A 2 Daboia russelii pulchella J. Venom. Anim. Toxins Incl. Trop. Dis. 2015 21 17 10.1186/s40409-015-0014-y 26042153 PMC4453231 52. De Barros N.B. Macedo S.R.A. Ferreira A.S. Tagliari M.P. Zanchi F.B. Kayano A.M. Soares A.M. Nicolete R. Liposomes Containing an ASP49-Phospholipase A 2 Bothrops jararacussu Int. Immunopharmacol. 2016 36 225 231 10.1016/j.intimp.2016.04.025 27174621 53. Castro A.S. Alves C.M.O.S. Angeloni M.B. Gomes A.O. Barbosa B.F. Franco P.S. Silva D.A.O. Martins-Filho O.A. Mineo J.R. Mineo T.W.P. Trophoblast Cells Are Able to Regulate Monocyte Activity to Control Toxoplasma gondii Placenta 2013 34 240 247 10.1016/j.placenta.2012.12.006 23294571 54. Barbosa B.F. Paulesu L. Ietta F. Bechi N. Romagnoli R. Gomes A.O. Favoreto-Junior S. Silva D.A.O. Mineo J.R. Mineo T.W.P. Susceptibility to Toxoplasma gondii Placenta 2014 35 152 162 10.1016/j.placenta.2013.12.013 24433846 55. de Souza G. Silva R.J. Milián I.C.B. Rosini A.M. de Araújo T.E. Teixeira S.C. Oliveira M.C. Franco P.S. da Silva C.V. Mineo J.R. Cyclooxygenase (COX)-2 Modulates Toxoplasma gondii Sci. Rep. 2021 11 12709 10.1038/s41598-021-92120-3 34135407 PMC8209052 56. Jebbari H. Roberts C.W. Ferguson D.J.P. Bluethmann H. Alexander J. A Protective Role for IL-6 during Early Infection with Toxoplasma gondii Parasite Immunol. 1998 20 231 239 10.1046/j.1365-3024.1998.00152.x 9651924 57. Desai T.R. Leeper N.J. Hynes K.L. Gewertz B.L. Interleukin-6 Causes Endothelial Barrier Dysfunction via the Protein Kinase C Pathway J. Surg. Res. 2002 104 118 123 10.1006/jsre.2002.6415 12020130 58. Sakurai T. Takai R. Bürgin H. Ishihara K. Sakamoto Y. Amano J. Higuchi Y. Chiba S. Singer T. Kawamura A. The Effects of Interleukin-6 Signal Blockade on Fertility, Embryo-Fetal Development, and Immunization in vivo Birth Defects Res. B Dev. Reprod. Toxicol. 2012 95 304 317 10.1002/bdrb.21019 22767489 59. Almeida M.P.O. Mota C.M. Mineo T.W.P. Ferro E.A.V. Barbosa B.F. Silva N.M. Heme Oxygenase-1 Induction in Human BeWo Trophoblast Cells Decreases Toxoplasma gondii Front. Microbiol. 2021 12 659028 10.3389/fmicb.2021.659028 33912151 PMC8071940 60. Flores M. Saavedra R. Bautista R. Viedma R. Tenorio E.P. Leng L. Sanchez Y. Juárez I. Satoskar A.A. Shenoy A.S. Macrophage Migration Inhibitory Factor (MIF) Is Critical for the Host Resistance against Toxoplasma gondii FASEB J. 2008 22 3661 3671 10.1096/fj.08-111666 18606868 PMC2537436 61. Ferreira F.B. Gomes M.S.R. de Souza D.L.N. Gimenes S.N.C. Castanheira L.E. Borges M.H. Rodrigues R.S. Yoneyama K.A.G. Brandeburgo M.I.H. Rodrigues V.M. Molecular Cloning and Pharmacological Properties of an Acidic PLA 2 Bothrops pauloensis Toxins 2013 5 2403 2419 10.3390/toxins5122403 24304676 PMC3873693 62. Ferro E.A.V. Roberto Mineo J. Ietta F. Bechi N. Romagnoli R. Aparecida Oliveira Silva D. Sorda G. Bevilacqua E. Ricci Paulesu L. Macrophage Migration Inhibitory Factor Is Up-Regulated in Human First-Trimester Placenta Stimulated by Soluble Antigen of Toxoplasma Gondii, Resulting in Increased Monocyte Adhesion on Villous Explants Am. J. Pathol. 2008 172 50 58 10.2353/ajpath.2008.070432 18165264 PMC2189627 63. de Gomes A.O. De Oliveira Silva D.A. Silva N.M. De Freitas Barbosa B. Silva Franco P. Angeloni M.B. Fermino M.L. Roque-Barreira M.C. Bechi N. Paulesu L.R. Effect of Macrophage Migration Inhibitory Factor (MIF) in Human Placental Explants Infected with Toxoplasma gondii Am. J. Pathol. 2011 178 2792 2801 10.1016/j.ajpath.2011.02.005 21641401 PMC3124335 64. Nejad M.R. Sherafat S.J. Roshani M. Telkabadi M. Lahmi F. Cheraghipour K. Kaboli A.R. Alavi-Moghaddam M. The Evaluation of Interleukin-8 Chemokine in Chronic and Acute Toxoplasma gondii Toxoplasma gondii Gastroenterol. Hepatol. Bed Bench 2011 4 34 37 24834153 PMC4017403 65. Teixeira S.C. Paschoalino M. de Souza G. Rosini A.M. de Lima Junior J.P. Luz L.C. Fajardo Martínez A.F. Alves R.N. Almeida M.P.O. Damasceno J.L. Rottlerin Impairs Early and Late Steps of Toxoplasma gondii Chem. Biol. Interact. 2023 384 110716 10.1016/j.cbi.2023.110716 37722575 66. Denney C.F. Eckmann L. Reed S.L. Chemokine Secretion of Human Cells in Response to Toxoplasma gondii Infect. Immun. 1999 67 1547 10.1128/IAI.67.4.1547-1552.1999 10084985 PMC96495 67. Navia B.A. Petito C.K. Gold J.W.M. Cho E.-S. Jordan B.D. Price R.W. Cerebral Toxoplasmosis Complicating the Acquired Immune Deficiency Syndrome: Clinical and Neuropathological Findings in 27 Patients Ann. Neurol. 1986 19 224 238 10.1002/ana.410190303 3963767 68. Wilson C.B. Remington J.S. Activity of Human Blood Leukocytes against Toxoplasma gondii J. Infect. Dis. 1979 140 890 895 10.1093/infdis/140.6.890 541523 69. Ren Y. Chan H.M. Li Z. Lin C. Nicholls J. Chen C.F. Lee P.Y. Lui V. Bacher M. Tam P.K.H. Upregulation of Macrophage Migration Inhibitory Factor Contributes to Induced N-Myc Expression by the Activation of ERK Signaling Pathway and Increased Expression of Interleukin-8 and VEGF in Neuroblastoma Oncogene 2004 23 4146 4154 10.1038/sj.onc.1207490 15064733 70. Buchholz K.R. Stephens R.S. The Extracellular Signal-Regulated Kinase/Mitogen-Activated Protein Kinase Pathway Induces the Inflammatory Factor Interleukin-8 Following Chlamydia Trachomatis Infection Infect. Immun. 2007 75 5924 5929 10.1128/IAI.01029-07 17893134 PMC2168325 71. Rodrigues R.S. Izidoro L.F.M. de Oliveira R.J. Jr. Soares A.M. Rodrigues V.M. Sampaio S.V. Snake Venom Phospholipases A 2 Protein Pept. Lett. 2009 16 894 898 10.2174/092986609788923266 19689415 72. Yamazaki Y. Matsunaga Y. Nakano Y. Morita T. Identification of Vascular Endothelial Growth Factor Receptor-Binding Protein in the Venom of Eastern Cottonmouth: A New Role of Snake Venom Myotoxic LYS49-Phospholipase A 2 J. Biol. Chem. 2005 280 29989 29992 10.1074/jbc.C500236200 16014630 73. Quan J.H. Ismail H.A.H.A. Cha G.H. Jo Y.J. Gao F.F. Choi I.W. Chu J.Q. Yuk J.M. Lee Y.H. VEGF Production Is Regulated by the AKT/ERK1/2 Signaling Pathway and Controls the Proliferation of Toxoplasma gondii Front. Cell Infect. Microbiol. 2020 10 517925 10.3389/fcimb.2020.00184 PMC7216739 32432052 74. Santos L.C. Oliveira V.Q. Teixeira S.C. Correia T.M.L. Andrade L.O.S.B. Polloni L. Marques L.M. Clissa P.B. Baldo C. Ferro E.A.V. PLA2-MjTX-II from Bothrops moojeni Toxicon 2024 243 107742 10.1016/j.toxicon.2024.107742 38705486 75. Polloni L. Azevedo F.V.P.V. Teixeira S.C. Moura E. Costa T.R. Gimenes S.N.C. Correia L.I.V. Freitas V. Yoneyama K.A.G. Rodrigues R.S. Antiangiogenic Effects of Phospholipase A 2 Bothrops pauloensis Toxicol. Vitr. 2021 72 105099 10.1016/j.tiv.2021.105099 33486049 76. Dupont C.D. Christian D.A. Hunter C.A. Immune Response and Immunopathology during Toxoplasmosis Semin. Immunopathol. 2012 34 793 10.1007/s00281-012-0339-3 22955326 PMC3498595 77. Gazzinelli R.T. Eltoum I. Wynn T.A. Sher A. Acute Cerebral Toxoplasmosis Is Induced by in Vivo Neutralization of TNF-Alpha and Correlates with the down-Regulated Expression of Inducible Nitric Oxide Synthase and Other Markers of Macrophage Activation J. Immunol. 1993 151 3672 3681 10.4049/jimmunol.151.7.3672 7690809 78. Carneiro A.C.A.V. Machado A.S. Béla S.R. Costa J.G.L. Andrade G.M.Q. Vasconcelos-Santos D.V. Januário J.N. Coelho-Dos-Reis J.G. Ferro E.A.V. Teixeira-Carvalho A. Cytokine Signatures Associated with Early Onset, Active Lesions and Late Cicatricial Events of Retinochoroidal Commitment in Infants with Congenital Toxoplasmosis J. Infect. Dis. 2016 213 1962 1970 10.1093/infdis/jiw041 26946460 79. Turco M.Y. Moffett A. Development of the Human Placenta Development 2019 146 dev163428 10.1242/dev.163428 31776138 80. Andrião-Escarso S.H. Soares A.M. Rodrigues V.M. Angulo Y. Díaz C. Lomonte B. Gutiérrez J.M. Giglio J.R. Myotoxic Phospholipases A(2) in Bothrops Snake Venoms: Effect of Chemical Modifications on the Enzymatic and Pharmacological Properties of Bothropstoxins from Bothrops jararacussu Biochimie 2000 82 755 763 10.1016/S0300-9084(00)01150-0 11018293 81. Haas G.H. Postema N.M. Nieuwenhuizen W. van Deenen L.L.M. Purification and Properties of Phospholipase A from Porcine Pancreas Biochim. Biophys. Acta 1968 159 103 117 10.1016/0005-2744(68)90248-9 4967810 82. Liao H. He H. Chen Y. Zeng F. Huang J. Wu L. Chen Y. Effects of Long-Term Serial Cell Passaging on Cell Spreading, Migration, and Cell-Surface Ultrastructures of Cultured Vascular Endothelial Cells Cytotechnology 2013 66 229 10.1007/s10616-013-9560-8 23553018 PMC3918257 83. Teixeira S.C. de Souza G. Borges B.C. de Araújo T.E. Rosini A.M. Aguila F.A. Ambrósio S.R. Veneziani R.C.S. Bastos J.K. Silva M.J.B. Copaifera Spp. Oleoresins Impair Toxoplasma gondii Sci. Rep. 2020 10 15158 10.1038/s41598-020-72230-0 32938966 PMC7495442 84. Menezes R.d.P. Bessa M.A.d.S. Siqueira C.d.P. Teixeira S.C. Ferro E.A.V. Martins M.M. Cunha L.C.S. Martins C.H.G. Antimicrobial, Antivirulence, and Antiparasitic Potential of Capsicum chinense Antibiotics 2022 11 1154 10.3390/antibiotics11091154 36139934 PMC9495104 85. da Silva J.J.M. Crevelin E.J. Carneiro L.J. Rogez H. Veneziani R.C.S. Ambrósio S.R. Beraldo Moraes L.A. Bastos J.K. Development of a Validated Ultra-High-Performance Liquid Chromatography Tandem Mass Spectrometry Method for Determination of Acid Diterpenes in Copaifera Oleoresins J. Chromatogr. A 2017 1515 81 90 10.1016/j.chroma.2017.07.038 28789798 86. Adeyemi O.S. Murata Y. Sugi T. Kato K. Inorganic Nanoparticles Kill Toxoplasma Gondii via Changes in Redox Status and Mitochondrial Membrane Potential Int. J. Nanomed. 2017 12 1647 1661 10.2147/IJN.S122178 28280332 PMC5339004 87. Santiago M.B. dos Santos V.C.O. Teixeira S.C. Silva N.B.S. de Oliveira P.F. Ozelin S.D. Furtado R.A. Tavares D.C. Ambrósio S.R. Veneziani R.C.S. Polyalthic Acid from Copaifera Lucens Pharmaceuticals 2023 16 1357 10.3390/ph16101357 37895828 PMC10610108 88. Lim S.S.Y. Chua K.H. Nölke G. Spiegel H. Goh W.L. Chow S.C. Kee B.P. Fischer R. Schillberg S. Othman R.Y. Plant-Derived Toxoplasma gondii PeerJ 2018 6 e5780 10.7717/PEERJ.5780/SUPP-3 30581655 PMC6294049 Figure 1 Toxin derived from Bothrops jararacussu Toxoplasma gondii A B T. gondii p Figure 2 BthTX-II directly interferes with early steps of T. gondii A T. gondii T. gondii B T. gondii 6 4 T. gondii C D 5 2 T. gondii E p p p p Figure 3 BthTX-II upregulates interleukin (IL)-6, IL-8, and migration inhibitory factor (MIF) production in cells and downregulates vascular endothelial growth factor (VEGF) levels in T. gondii-infected BeWo. BeWo cells, uninfected or infected with T. gondii A B C D p p p p Figure 4 Viability of human placental villous explants after treatment with BthTX-II. Villous explants were incubated for 24 h with BthTX-II (ranging from 100 to 1.56 μg/mL) or culture medium and subjected to viability analysis. ( A B C E C D E p p Figure 5 BthTX-II inhibits T. gondii A T. gondii 6 T. gondii B C D p p p ",
  "metadata": {
    "Title of this paper": "Plant-Derived ",
    "Journal it was published in:": "Pharmaceuticals",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472990/"
  }
}