{
  "title": "Paper_974",
  "abstract": "pmc Pharmaceuticals (Basel) Pharmaceuticals (Basel) 2102 pharmaceuticals pharmaceuticals Pharmaceuticals 1424-8247 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473014 PMC12473014.1 12473014 12473014 41011180 10.3390/ph18091309 pharmaceuticals-18-01309 1 Article Granzyme B PET Imaging Enables Early Assessment of Immunotherapy Response in a Humanized Melanoma Mouse Model https://orcid.org/0000-0002-3779-2895 Summer Priska Methodology Formal analysis Investigation Data curation Writing – original draft Writing – review & editing Project administration Gallon Naomi Formal analysis Investigation Data curation Bulmer Niklas Methodology Formal analysis Data curation https://orcid.org/0000-0001-7414-6123 Mahmood Umar Conceptualization Methodology Resources Supervision Funding acquisition https://orcid.org/0000-0001-6383-465X Heidari Pedram Conceptualization Methodology Formal analysis Resources Writing – review & editing Supervision Funding acquisition * Kopka Klaus Academic Editor Division of Nuclear Medicine and Molecular Imaging, Department of Radiology, Massachusetts General Hospital, Boston, MA 02114, USA * heidari.pedram@mgh.harvard.edu 31 8 2025 9 2025 18 9 497460 1309 24 7 2025 21 8 2025 27 8 2025 31 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives 68 Methods 68 68 68 p p 68 p p 68 Conclusions 68 granzyme B PET imaging molecular imaging checkpoint inhibitor therapy humanized mouse model P.H. K08CA249047 U.M. R01DK123143 U.M. R01CA214744 This research was funded by K08CA249047 (PI: P.H.), R01DK123143 (PI: U.M.), and R01CA214744 (PI: U.M.). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Over the past decade, immunotherapies have revolutionized cancer treatment [ 1 2 3 4 5 1 2 3 4 5 6 7 1 2 3 4 5 6 7 This study aimed to thoroughly evaluate the usefulness of a new human GZB PET imaging tracer, 68 68 2. Results 2.1. 68 The human GZB enzymatic inhibition assay showed that NOTA-CYT-200 inhibited active GZB activity in a concentration-dependent manner. As the concentration of NOTA-CYT-200 increased, the conversion of the substrate to a fluorescent molecule by GZB decreased, resulting in a lower fluorescence intensity measured in relative fluorescence units (RFUs). Based on this, the inhibition constant (Ki) of NOTA-CYT-200 for active GZB was estimated at 4.2 nM (CI: 2.95–5.98) ( Figure 1 68 Figure 1 p Figure 1 2.2. 68 We observed that the 68 p p p p p p p p p p p p p Figure 2 2.3. The Combination Treatment Led to the Most Significant Tumor Size Reduction The tumor volumes for each treatment group were measured regularly every two to three days for up to fifteen days after the initial treatment ( Figure 3 3 3 p 3 p 3 3 p 3 p 3 3 3 3 Figure 3 Overall, these findings confirm that the combination group (n = 14) exhibited the most pronounced and durable reduction in tumor burden, while the group receiving monotherapy (n = 15) also induced significant, but less sustained, tumor suppression compared to the controls (n = 12). 2.4. 68 To identify responders (TRs) and non-responders (TNRs) in groups receiving combination therapy (n = 8) or monotherapy (n = 9), changes in the tumor size (%) at days 5 and 15 after the start of treatment were compared to baseline. Mice with tumors that showed a reduction in size at both timepoints (day 5 and day 15) were classified as TRs. Conversely, mice that exhibited a tumor size reduction at only one—typically the earlier—timepoint or no reduction at all were classified as TNRs. Based on this, three out of nine mice receiving monotherapy were classified as TRs and six as TNRs (TRs, n = 3; TNRs, n = 6). In the group receiving combination therapy (n = 15; subset imaged, n = 8), six mice were TRs and one was a TNR (TRs, n = 6; TNRs, n = 1). One mouse in the combination group showed a 50% reduction in tumor volume five days after the treatment began, but had to be euthanized before day 15 and was therefore not included. The tumor volumes of these subgroups were compared on days 0, 5, 10, and 15 after treatment initiation ( Figure 4 3 3 3 p 3 3 p 3 p 3 3 Figure 4 3 p p p p 68 p p p 2.5. Treated Mice Showed Greater GZB Expression in the Liver and Intestines The measurements of the 68 p p p p p p p p The baseline LBRs were also comparable across all the groups (monotherapy [n = 9] vs. combination [n = 8], p p p p p p p p p p p p Figure 5 68 2.6. Ex Vivo Measurements of GZB Correlate with In Vivo Findings Four days after starting treatment was identified as the peak point for in vivo tracer uptake, indicating the highest GZB activity and immune cell cytotoxic response within the tumor microenvironment. Consequently, we measured the biodistribution of 68 p p p p p p p p To further confirm the PET imaging results, immunofluorescent GZB staining was conducted on tumor, intestinal, and liver tissues collected from all groups on day 4 after treatment. In tumors, the GZB expression was highest for the combination group (49.59 ± 11.99, n = 3), significantly exceeding that of the onotherapy group (3.31 ± 1.19, n = 2, p p p p p p p p Figure 6 3. Discussion To our knowledge, this is the first study to utilize a humanized mouse model that incorporates both human melanoma cells (G361) and human PBMCs, creating a live experimental system with a functional human tumor-immune microenvironment, which enhances its translational relevance. Unlike traditional murine models that lack human immune components, this approach more accurately mimics human immunotherapy responses. The G361 melanoma cell line, known for high GZB expression and responsiveness to immune therapies [ 7 In this study, we used a novel PET imaging probe, 68 4 68 Larimer et al. investigated murine GZB PET probes, such as 68 5 4 8 68 68 PET imaging on tumor-bearing mice was performed on days 4, 7, and 14 following treatment initiation. These specific timepoints were selected based on the established kinetics of cytotoxic lymphocyte activation, GZB activity, and the tumor response in both preclinical and clinical studies of ICI therapy [ 5 9 10 5 11 12 5 10 9 13 To evaluate the duration of immune activation caused by the treatment and differentiate between sustained and transient responses, day 14 was selected as a late timepoint. Previous studies have shown that signal declines occur in non-responders after an initial surge of immune activation, often due to T-cell exhaustion or adaptive resistance [ 7 10 4 11 12 13 68 p 5 7 8 68 7 8 10 When analyzing subgroups, the treatment responders treated with either combination therapy or monotherapy showed significantly lower tumor volumes 15 days after the treatment (97 ± 47 mm 3 3 3 p 68 p p Section 2.4 Figure 4 p 68 2 68 1 10 11 12 68 68 Our study also examined the potential of 68 68 14 15 16 17 18 4 68 18 We acknowledge some limitations of this study, such as the lack of in vivo kinetic analyses of 68 68 68 68 68 4. Materials and Methods 4.1. Animal Studies Fifty-five 8-week-old naïve NSG mice (both males and females) were obtained from Jackson Laboratory (Bar Harbor, ME, USA). The mice were housed in a Biosafety Level 2 facility on a 12 h light–dark cycle with free access to a standard rodent chow diet (approximately 18% protein, 5% fat, and 5% fiber) and water. The body weights at the time of tumor implantation (day 0) averaged 23.62 g ± 4.32. The animals were acclimated for two weeks before the start of the experiments. 4.2. Probe Characterization NOTA-CYT-200 was synthesized (CytoSite Biopharma, Sudbury, MA, USA) with a high chemical purity (>95%) and characterized using mass spectrometry. We performed a fluorometric human GZB activity assay (ab157403) to determine the inhibitor constant (Ki) of NOTA-CYT-200 for active human GZB enzyme activity in vitro. NOTA-CYT-200 was serially diluted with GZB assay buffer, starting from 5000 to 0.00002048 nanomolar. Each dilution was combined with 0.1 µg/µL of active GZB protein (ab285779) and the provided fluorophore. Each well contained a total volume of 50 µL, and all the samples were tested in duplicate using a microplate reader in kinetic mode (BioTek Cytation5, Winooski, VT, USA) after 90 min of incubation at 27 °C. The in vivo specificity of NOTA-CYT-200 labeled with 68gallium ( 68 68 68 4.3. Experimental Design For immune reconstitution, 2 × 10 6 ® 2 6 3 Figure 7 4.4. Radiolabeling and PET-CT Imaging 68 68 68 68 68 4.5. Biodistribution The 68 68 4.6. Immunohistochemistry The tissue samples were dissected four days after the treatment to correlate the PET imaging radiotracer uptake with the immunofluorescent staining for GZB. Staining was performed on deparaffinized tissue samples (combination, n = 3; mono, n = 2; and controls, n = 3) using previously described methods [ 4 4.7. Statistical Analyses Prism (version 9.2; GraphPad) was used to perform quantitative data analyses. The data are presented as the mean ± SEM. The means of the two groups were compared using unpaired Student’s t-tests when appropriate. One- or two-way ANOVA with Tukey’s multiple comparison test was used as needed to compare the differences among the treatment groups. p 5. Conclusions In conclusion, our study demonstrates that 68 Acknowledgments The authors thank Marcella Maus’s laboratory at Massachusetts General Hospital, Boston, MA, for providing the cells. Additionally, we appreciate Bahar Ataeinia for her helpful assistance with PET imaging. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, P.S., U.M., and P.H.; methodology, P.S., U.M., and P.H.; validation, P.S., N.G., and N.B.; formal analysis, P.S.; investigation, P.S., N.G., and N.B.; resources, U.M. and P.H.; data curation, U.M. and P.H.; writing—original draft preparation, P.S.; writing—review and editing, P.S., U.M., and P.H.; visualization, P.S.; supervision, U.M. and P.H.; project administration, P.S. and N.G.; funding acquisition, U.M. and P.H. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The animal study protocol was approved in accordance with the Institutional Animal Care and Use Committee guidelines (2017N000163, approved on 8 October 2022). Informed Consent Statement Not applicable. Data Availability Statement Data presented in this study is contained within the article. Conflicts of Interest Author U.M. is a cofound of and a consultant to CytoSite Biopharma, a company focused on developing PET probes for immuno-oncology. Author U.M. serves on the board of directors of the Radiologic Society of North America (RSNA) and receives no compensation for this role. All other authors declare that the research was conducted in the absence of any commercial or financial relationships that could be constructed as a potential conflict of interest. Abbreviations The following abbreviations are used in this manuscript: ICI Immune checkpoint inhibitor TRs Treatment responders TNRs Treatment non-responders TBR Tumor-to-blood ratio 68 68 i.v. Intravenous s.c. Subcutaneous IrAE Immunotherapy-related adverse event CBR Colon-to-blood ratio LBR Liver-to-blood ratio RFU Relative fluorescence unit PBMC Peripheral Blood Mononuclear Cell NSG NOD scid gamma mouse (immunodeficient strain) PET Positron emission tomography GZB Granzyme B SUV Standard uptake value ANOVA Analysis of variance References 1. Chen P.L. Roh W. Reuben A. Cooper Z.A. Spencer C.N. Prieto P.A. Miller J.P. Bassett R.L. Gopalakrishnan V. Wani K. Analysis of Immune Signatures in Longitudinal Tumor Samples Yields Insight into Biomarkers of Response and Mechanisms of Resistance to Immune Checkpoint Blockade Cancer Discov. 2016 6 827 837 10.1158/2159-8290.CD-15-1545 27301722 PMC5082984 2. Ellingson B.M. Chung C. Pope W.B. Boxerman J.L. Kaufmann T.J. Pseudoprogression, radionecrosis, inflammation or true tumor progression? challenges associated with glioblastoma response assessment in an evolving therapeutic landscape J. Neurooncol. 2017 134 495 504 10.1007/s11060-017-2375-2 28382534 PMC7893814 3. Nguyen A. Ramesh A. Kumar S. Nandi D. Brouillard A. Wells A. Pobezinsky L. Osborne B. Kulkarni A.A. Granzyme B nanoreporter for early monitoring of tumor response to immunotherapy Sci. Adv. 2020 6 eabc2777 10.1126/sciadv.abc2777 33008894 PMC7852386 4. Heidari P. Haj-Mirzaian A. Prabhu S. Ataeinia B. Esfahani S.A. Mahmood U. Granzyme B PET Imaging for Assessment of Disease Activity in Inflammatory Bowel Disease J. Nucl. Med. 2024 65 1137 1143 10.2967/jnumed.123.267344 38754959 PMC11218731 5. Larimer B.M. Wehrenberg-Klee E. Dubois F. Mehta A. Kalomeris T. Flaherty K. Boland G. Mahmood U. Granzyme B PET Imaging as a Predictive Biomarker of Immunotherapy Response Cancer Res. 2017 77 2318 2327 10.1158/0008-5472.CAN-16-3346 28461564 PMC5474226 6. Schmidt G.P. Kramer H. Reiser M.F. Glaser C. Whole-body magnetic resonance imaging and positron emission tomography-computed tomography in oncology Top. Magn. Reson. Imaging 2007 18 193 202 10.1097/RMR.0b013e318093e6bo 17762383 7. Wahl R.L. Jacene H. Kasamon Y. Lodge M.A. From RECIST to PERCIST: Evolving Considerations for PET response criteria in solid tumors J. Nucl. Med. 2009 50 (Suppl. 1) 122S 150S 10.2967/jnumed.108.057307 19403881 PMC2755245 8. Larimer B.M. Bloch E. Nesti S. Austin E.E. Wehrenberg-Klee E. Boland G. Mahmood U. The Effectiveness of Checkpoint Inhibitor Combinations and Administration Timing Can Be Measured by Granzyme B PET Imaging Clin. Cancer Res. 2019 25 1196 1205 10.1158/1078-0432.CCR-18-2407 30327313 PMC6377844 9. Napier T.S. Hunter C.L. Song P.N. Larimer B.M. Sorace A.G. Preclinical PET Imaging of Granzyme B Shows Promotion of Immunological Response Following Combination Paclitaxel and Immune Checkpoint Inhibition in Triple Negative Breast Cancer Pharmaceutics 2022 14 440 10.3390/pharmaceutics14020440 35214172 PMC8875418 10. LaSalle T. Austin E.E. Rigney G. Wehrenberg-Klee E. Nesti S. Larimer B. Mahmood U. Granzyme B PET imaging of immune-mediated tumor killing as a tool for understanding immunotherapy response J. Immunother. Cancer 2020 8 e000291 10.1136/jitc-2019-000291 32461343 PMC7254099 11. Sharma P. Allison J.P. Immune checkpoint targeting in cancer therapy: Toward combination strategies with curative potential Cell 2015 161 205 214 10.1016/j.cell.2015.03.030 25860605 PMC5905674 12. Robert C. Thomas L. Bondarenko I. O’Day S. Weber J. Garbe C. Lebbe C. Baurain J.F. Testori A. Grob J.J. Ipilimumab plus dacarbazine for previously untreated metastatic melanoma N. Engl. J. Med. 2011 364 2517 2526 10.1056/NEJMoa1104621 21639810 13. Boettcher A.N. Preclinical Evaluation of a Granzyme B PET Tracer for the Assessment of Immunotherapy Response Radiol. Imaging Cancer 2021 3 e219001 10.1148/rycan.2021219001 33778766 PMC7983717 14. Weber J.S. Hodi F.S. Wolchok J.D. Topalian S.L. Schadendorf D. Larkin J. Sznol M. Long G.V. Li H. Waxman I.M. Safety Profile of Nivolumab Monotherapy: A Pooled Analysis of Patients with Advanced Melanoma J. Clin. Oncol. 2017 35 785 792 10.1200/JCO.2015.66.1389 28068177 15. Wolchok J.D. Chiarion-Sileni V. Gonzalez R. Rutkowski P. Grob J.J. Cowey C.L. Lao C.D. Wagstaff J. Schadendorf D. Ferrucci P.F. Overall Survival with Combined Nivolumab and Ipilimumab in Advanced Melanoma N. Engl. J. Med. 2017 377 1345 1356 10.1056/NEJMoa1709684 28889792 PMC5706778 16. Jiang F. Zhang Z. Chong X. Shen L. Fan M. Liu X. An J. Peng Z. Zhang C. Extracellular Vesicle-Derived Protein File from Peripheral Blood Predicts Immune-Related Adverse Events in Gastric Cancer Patients Receiving Immunotherapy Cancers 2022 14 4167 10.3390/cancers14174167 36077704 PMC9454680 17. Ferreira C.A. Heidari P. Ataeinia B. Sinevici N. Sise M.E. Colvin R.B. Wehrenberg-Klee E. Mahmood U. Non-invasive Detection of Immunotherapy-Induced Adverse Events Clin. Cancer Res. 2021 27 5353 5364 10.1158/1078-0432.CCR-20-4641 34253581 PMC8752648 18. de Aguiar Ferreira C. Heidari P. Ataeinia B. Sinevici N. Granito A. Kumar H.M. Wehrenberg-Klee E. Mahmood U. Immune Checkpoint Inhibitor-Mediated Cancer Theranostics with Radiolabeled Anti-Granzyme B Peptide Pharmaceutics 2022 14 1460 10.3390/pharmaceutics14071460 35890355 PMC9325142 Figure 1 ( A 68 B C 68 D p 68 68 Figure 2 ( A 68 B 68 68 p p p p Figure 3 ( A B p p C p p Figure 4 ( A 3 B p p Figure 5 ( A 68 B p p p p Figure 6 Immunohistochemical staining was conducted on tumor ( A B C A B p B C Figure 7 Experimental design. Naïve NSG mice received a tumor implantation 14 days after receiving human-derived PBMCs. The mice were then randomly assigned to one of three treatment groups: a combination of checkpoint inhibitors (combination), treatment with a single checkpoint inhibitor (mono), or a vehicle solution (controls). Tumor growth was monitored regularly until the final timepoint. All groups were imaged using PET-CT before the treatment began (baseline) and on days 4 (D4), 7 (D7), and 14 (D14) after the initial dose. ",
  "metadata": {
    "Title of this paper": "Immune Checkpoint Inhibitor-Mediated Cancer Theranostics with Radiolabeled Anti-Granzyme B Peptide",
    "Journal it was published in:": "Pharmaceuticals",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473014/"
  }
}