{
  "title": "Paper_859",
  "abstract": "pmc iScience iScience 3532 isci iScience 2589-0042 Elsevier PMC12475578 PMC12475578.1 12475578 12475578 41019373 10.1016/j.isci.2025.113339 S2589-0042(25)01600-1 113339 1 Article Epigenetic-mediated positive feedback loop facilitates the progression of lung adenocarcinoma Cheng Yihang 1 2 3 11 14 Luo Yifeng 4 14 Hu Tingting 1 2 3 14 Ren Qiaoling 2 5 6 14 Xu Li 1 2 3 Yi Tuo 5 Tan Yuan 10 Li Wei 10 Wang Xuxin 11 Sun Yaoxiang 12 Chen Mingzhi 13 Shen Zhonghua 9 Zhang Bin style608113@163.com 2 5 7 ∗ Bai Youhuang biobai@zju.edu.cn 1 2 3 ∗∗ Tao Yue 397701781@qq.com 5 8 ∗∗∗ Cao Zhihong staff877@yxph.com 4 ∗∗∗∗ Sun Deqiang deqiangs@zju.edu.cn 1 2 3 15 ∗∗∗∗∗ 1 2 3 4 5 6 7 8 9 10 11 12 13 ∗ style608113@163.com ∗∗ biobai@zju.edu.cn ∗∗∗ 397701781@qq.com ∗∗∗∗ staff877@yxph.com ∗∗∗∗∗ deqiangs@zju.edu.cn 14 These authors contributed equally 15 Lead contact 17 10 2025 26 8 2025 28 10 497597 113339 31 3 2025 18 6 2025 7 8 2025 26 08 2025 28 09 2025 29 09 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). Summary Lung adenocarcinoma (LUAD) remains a leading cause of cancer-related mortality. We performed multi-omics approaches on LUAD samples spanning different stages, establishing a detailed epigenetic landscape. We identified 1,416 regions characterized by hypo-DNA methylation and hyperchromatin accessibility associated with high mortality and recurrence rates, serving as a biomarker panel for LUAD staging and diagnosis (AUC of 0.89 and 0.87 for two-class and multi-class models). Epigenetics-related transcription factors, especially the AP-1 family, were observed at these loci, and transcriptomic profiling indicated persistent activation of the mitogen-activated protein kinase (MAPK) signaling pathway. Hypomethylation and hyperaccessibility of AP-1 binding sites enhance EGFR and FGFBP1 expression, activating the MAPK pathway. This reveals an epigenetic-mediated positive feedback loop, MAPK→AP-1/Epigenetic Modifications→EGFR/FGFBP1→MAPK, in LUAD, highlighting the complex interplay between epigenetic modifications and LUAD progression, offering potential detection and treatment targets. These findings define a high-resolution, multi-stage epigenetic landscape of LUAD, providing a resource for biomarker discovery and mechanistic insight. Graphical abstract Highlights • Multi-stage epigenetic map links DNA methylation and accessibility in LUAD • Epi-TFs mediate crosstalk between epigenetic states and LUAD progression • 1,416 epigenetic regions predict LUAD stage with high accuracy (AUC 0.89/0.87) • MAPK–AP-1–EGFR/FGFBP1 loop drives LUAD via epigenetic feedback signaling Biological sciences; Molecular biology; Molecular mechanism of gene regulation Subject areas Biological sciences Molecular biology Molecular mechanism of gene regulation pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Published: August 26, 2025 Introduction Lung cancer is one of the cancers with the highest global morbidity and mortality rates. 1 2 in situ 3 4 , 5 , 6 7 , 8 , 9 10 11 12 13 14 15 , 16 , 17 18 , 19 20 , 21 , 22 23 24 25 , 26 27 The mitogen-activated protein kinase (MAPK) pathway is a crucial intracellular cascade that regulates cellular responses to extracellular stimuli, playing a central role in processes such as cell proliferation, differentiation, and survival. 28 29 30 , 31 32 33 , 34 , 35 36 37 38 In this study, a high-resolution, genome-wide, multi-stage epigenetic landscape of LUAD was established. Using this landscape, epigenetic biomarkers that effectively distinguish between different stages of LUAD were identified. Furthermore, using multi-omics technology, the role of epigenetics in mediating LUAD progression was investigated. The role of AP-1 family members in the MAPK cascade in LUAD has been previously elucidated. Moreover, the findings of this study demonstrate that hypo-DNA methylation and hyperchromatin accessibility at AP-1 binding sites lead to the increased expression of downstream genes, potentially activating the MAPK pathway. This creates a positive feedback loop (MAPK→AP-1/Epigenetic Modifications→EGFR/FGFBP1→MAPK) critical in lung cancer progression, particularly in IAC, offering insights into targeted therapeutic strategies. Results Genome-wide DNA methylation profiles in lung adenocarcinoma For this study, 151 lung tissue specimens were collected from patients and stratified into four cohorts: control conditions such as pneumonia and pulmonary fibrosis (CTL), AIS, MIA, and IAC ( Figure 1 Table S1 Table S2 Table S3 Figure 1 Figure 1 Figure 1 Table S4 Figure 1 Figure 1 Experimental design and genome-wide DNA methylation profiles in LUAD across different stages (A) Experimental design of this article. The sharp-cornered rectangle depicts the experimental data and methods, while the rounded rectangle depicts the main result of this study. (B) Comparative analysis of the mean DNA methylation level across samples within the groups CTL, AIS, MIA, and IAC. Statistical comparisons were made using unpaired two-tailed Student’s t test (∗ p p p p (C) Distribution of DNA methylation level densities for CTL versus AIS (top), CTL versus MIA (middle), and CTL versus IAC (bottom). (D) Evaluation of average DNA methylation levels in specific genomic regions for each group (CTL, AIS, MIA, and IAC). (E) Analysis of CpG methylation levels within a 5,000 bp range upstream and downstream of the TSS (top) and CGI (bottom) across the groups CTL, AIS, MIA, and IAC. Alterations in DNA methylation during the progression of lung adenocarcinoma Differentially methylated CpGs (DMCs) were identified in this genome-wide analysis by comparing the AIS, MIA, and IAC stages with the CTL group, encompassing 29,401,360 CpGs ( Tables S5 Figures 2 Table S5 Table S6 Figure 2 Differential methylation in LUAD across different stages (A) Distribution of DMC density comparing CTL with AIS (left), CTL with MIA (middle), and CTL with IAC (right). The numbers in the upper left and lower right corners indicate the number of hypo-DMCs and hyper-DMCs, respectively. (B) Venn diagram of DMCs identified in each stage. (C) Heatmaps depicting srDMCs for AIS (left), MIA (middle), and IAC (right). The top section of each heatmap illustrates hyper-srDMCs, while the bottom section shows hypo-srDMCs. (D) Density plots illustrating the distribution of srDMRs in proximity to the TSS (blue) and CGIs (red). (E and F) Results from GREAT analysis of hyper-srDMRs in AIS (E) and hypo-srDMRs in IAC (F). (G) TFs significantly enriched in hypo-srDMRs in IAC obtained by HOMER motif analysis. By analyzing DMC alterations across the stages, DMCs associated with LUAD progression (stage-related DMCs [srDMCs]) were identified ( Tables S7 Figure 2 Table S7 Table S8 Figure 2 39 , 40 Figure 2 Figure 2 41 Longer srDMRs were predominantly found in IAC ( Figure S1 42 Figures S1 Figure 2 43 , 44 Chromatin accessibility landscape highlights the enrichment of transcription factor binding sites To elucidate the chromatin accessibility landscape in different LUAD subtypes, ATAC-seq was conducted on 20 samples ( Table S9 Figure 3 Figure 3 Tables S10 Figure 3 Figure 3 Figure 3 Figure 3 Figure 3 Chromatin accessibility landscape and epi TFs in LUAD progression (A) Distribution of ATAC-seq peaks across stages CTL, AIS, MIA, and IAC. (B) Venn diagram of DARs identified in each stage. (C) Heatmaps displaying srDARs for AIS (left), MIA (middle), and IAC (right). (D) Density plots illustrating the distribution of srDARs relative to the TSS (blue) and CGIs (red). (E and F) GREAT analysis of hypo-srDARs in AIS (E) and hyper-srDARs in IAC (F). (G) TFs significantly enriched in hyper srDARs in IAC obtained by HOMER motif analysis. (H) The common epi TFs enriched in both srDMRs and srDARs by HOMER. (I) Classification of 72 epi TFs into 6 groups based on co-localization ratios within srDARs. The heatmap indicates the proportion of shared binding sites between TF pairs, with the adjacent histogram depicting the ratio change of shared sites in srDARs relative to the whole genome. The DNA-binding sites of 139 TFs were enriched in the srDARs across the AIS, MIA, and IAC stages of LUAD ( Figures S1 Figure 3 Figure 3 Figures 3 S2 Gene expression profile alterations throughout the progression of lung adenocarcinoma To elucidate the epigenetic dynamics across LUAD stages, expression profiles were analyzed by selecting 46 tissue samples for simultaneous WGBS and RNA sequencing (RNA-seq) ( Table S11 Figure 4 Table S12 Figure 4 Figure 4 Figure 4 Figure 4 Figure 4 Figure 4 Gene expression profile and functional analysis of LUAD (A) DEGs across stages AIS, MIA, and IAC. (B) Venn diagram of DEGs identified in each stage. (C) Heatmaps delineating srDEGs for AIS (left), MIA (middle), and IAC (right). (D–F) GO enrichment analyses of srDEGs for AIS (D), MIA (E), and IAC (F). (G) Count of genes co-expressed with epi TFs. Red: upregulated TFs, blue: down-regulated TFs. To investigate the co-expression patterns between epi TFs and DEGs, Pearson correlation coefficients were calculated for each TF-DEG pair across all samples (CTL, AIS, MIA, and IAC). A TF and DEG pair was considered co-expressed when p r r Figure 4 Figure S2 Figure S2 45 46 Chromatin accessibility is negatively correlated with DNA methylation levels in hyper-differential chromatin accessibility regions of invasive adenocarcinoma The above investigations demonstrated the enrichment of epi TFs in both srDMRs and srDARs, suggesting a potential association between methylation and chromatin accessibility in these regions. Therefore, the interplay between DNA methylation levels and chromatin accessibility was further explored, and their combined impact on the initial stages of lung cancer progression was assessed. By extracting methylation levels from ATAC-seq peak regions, a Kendall correlation analysis was conducted between peak accessibility and methylation levels. In total, 15,411 regions exhibited a positive correlation between accessibility and methylation levels, whereas 5,977 regions showed a negative correlation. Regions with negative correlations tended to exhibit increased accessibility and reduced methylation levels ( Figure 5 Figure 5 Relationship between chromatin accessibility and DNA methylation levels in LUAD (A) Average methylation and average accessibility of ATAC-seq peaks whose methylation levels are negatively (left), positively (middle) and not (left) correlated with accessibility. (B) Correlation (mean ± SD) between methylation rate and chromatin openness across samples in groups AIS, MIA, and IAC. (C) Heatmap visualization of the interrelation between DNA methylation levels and chromatin accessibility across DARs. (D) Multi-dimensional correlation analysis at the binding sites of 72 epi TFs: methylation levels versus chromatin accessibility (top), chromatin accessibility versus TF expression (middle), and methylation levels versus TF expression (bottom). Correlations are presented as mean ± SD. To study differences in the correlation between chromatin accessibility and methylation levels across different groups, the correlation within individual samples was estimated through sampling. A decrease in the correlation coefficient with LUAD progression was observed ( Figure 5 Table S13 Figure 5 Figures 5 S2 Methylation patterns of stage-related differential chromatin accessibility regions as predictive biomarkers for lung cancer As alterations in the epigenetic landscape can influence the transcriptional activity of TFs, whether the 1,416 regions with significantly altered methylation levels and chromatin accessibility ( Figure 6 Figure 6 Figure 6 Figure 6 Figure 6 Figure 6 Figure 6 Figure 6 Diagnostic and prognostic potential of srDARs and srDMRs as lung cancer biomarkers (A) The 1,416 srDARs that overlap with srDMRs. Three metrics can be used to evaluate the intersection region. srDMR methylation: the methylation level of the srDMR. srDAR methylation: the DNA methylation level of the srDAR. srDAR accessibility: the chromatin accessibility of the srDAR. (B) Heatmaps displaying srDMR methylation (top), srDAR methylation (middle), and srDAR accessibility (bottom). The bar plot represents the -log10( p p (C) Hierarchical clustering based on DNA methylation levels of 1,416 srDARs. (D) Comprehensive heatmap of the 1,416 srDARs, annotated with clinical data including patient survival, recurrence, age, and gender. Event denotes either death or recurrence. (E) Survival analysis curves comparing average methylation levels of 1,416 srDARs. (F) Receiver operating characteristic (ROC) curve for a binary classification model discerning cancerous from non-cancerous tissues, presented for both training (top) and test (bottom) datasets. (G) ROC curve for a multi-class model distinguishing between CTL, AIS, MIA, and IAC stages, with performance metrics for training (top) and test (bottom) datasets. (H) Heatmap of CpG methylation levels in 1,416 srDARs within the lung tissue (TCGA-LUAD, left) and cell-free DNA (GEO: GSE122126 The TCGA-LUAD dataset 47 Figure S3 Figure 6 Figure S3 GSE122126 Figure 6 Positive feedback loop involving mitogen-activated protein kinase and epigenetic regulation in lung adenocarcinoma Enrichment analysis of srDARs and srDEGs revealed a significant association between LUAD and the MAPK pathway ( Figure S4 Figure 7 48 49 Figure S4 Figure 7 Interplay of MAPK signaling and epigenetic regulation in LUAD (A) Highly expressed genes in the MAPK pathway in LUAD. RTK, receptor tyrosine kinase; GF, growth factor; VGCC, voltage-gated calcium channel. PK: protein kinases. (B) DEGs regulated by AP-1 in srDARs. The inner four-layer bar plot illustrates the methylation level at each stage, the outer four-layer bar plot depicts chromatin accessibility across these stages, and the outermost layer represents the DEGs regulated by AP-1. (C) Methylation levels and chromatin accessibility profiles near EGFR (top) and FGFBP1 (bottom) regulatory regions. Green peaks indicate regions of active transcription at the promoters or enhancers. (D) DEG count of stage IAC and A549 cells (left) and GO enrichment analyses of genes in the red grid (right). 100 μM: A549 treatment with 100 μM T-5224; 200 μM: A549 treatment with 200 μM T-5224; Up: up-regulated genes; Down: down-regulated genes. (E) Expression level (mean ± SD, n p p p p (F) Quantitative assessment of A549 cell viability using a CCK-8 assay across a range of T-5224 concentrations (0 μM, 100 μM, 200 μM, and 400 μM). Paired two-tailed t-tests were used (∗ p p p p (G–I) Colony-formation assay (G), transwell migration assay (H), and flow cytometry apoptosis assays (I) of A549 under various concentrations of T-5224 treatment (0 μM, 100 μM, and 200 μM). Scale bar in (H): 100 μm. n p p p p Motif analysis of ATAC-seq peaks revealed 5,740 binding sites of AP-1 within srDARs. These binding sites were further filtered using chromatin immunoprecipitation sequencing (ChIP-seq) data for JUN (ENCODE: ENCFF280RQS), FOS (ENCODE: ENCFF459DPT), and H3K27ac (ENCODE: ENCFF614QOP) in A549 cells, providing experimental evidence that AP-1 binds to regions with significant transcriptional activity. Finally, the binding of AP-1 to 819 srDARs in LUAD was verified. These AP-1 target binding sites reside within or near the transcriptional regulatory regions of 114 DEGs, including critical MAPK cascade activators such as EGFR, FGFBP1, and MET ( Figure 7 Figures 7 S4 Figure S4 To study the regulatory effect of AP-1 binding on downstream genes, A549 cells were treated with the AP-1 inhibitor T-5224. A concurrent increase in DEGs with increasing inhibitor concentrations was observed ( Figure S4 Table S13 Figure 7 50 Figure S4 Figure 7 Figures S4 51 Figure S4 Figures S4 As a key hub in this positive feedback loop, the function of AP-1 in lung cancer was studied in A549 cells treated with different concentrations of T-5224. Treatment with T-5224 resulted in a significant and dose-dependent reduction in A549 cell proliferation ( Figure 7 Figure 7 Figure 7 Figure 7 Discussion AIS and MIA are early stages of LUAD, typically characterized by favorable post-treatment prognoses. In contrast, patients diagnosed with IAC have a less favorable prognosis. 3 , 52 4 , 5 , 6 , 53 54 Epigenetic modifications and TF binding mutually influence each other. 55 , 56 , 57 43 , 58 , 59 , 60 61 62 Using RNA-Seq data, increasing transcriptional dysregulation of genes associated with LUAD was observed. This, together with DNA methylation levels and chromatin accessibility, reveals the molecular evolution from AIS to IAC during lung cancer development. Some members of the MAPK pathway are aberrantly expressed in LUAD, with Gene Ontology (GO) enrichment analysis of DEGs in IAC highlighting the role of the MAPK pathway in lung cancer progression. Key elements of the MAPK pathway, such as EGFR, RAS, ERK, and MET, are recognized lung cancer therapeutic targets. However, drug resistance often occurs during targeted drug treatments. 63 30 , 64 Specific downstream genes, such as EGFR, FGFBP1, and MET, capable of activating the MAPK pathway through AP-1 binding sites were identified in this study, which also showed that AP-1 binds to the transcriptional regulatory regions of EGFR and FGFBP1 and regulates their transcription levels. Methylation levels and chromatin accessibility at AP-1 binding sites correlated with EGFR and FGFBP1 transcription levels, indicating that epigenetic features and AP-1 jointly affect downstream gene expression. This finding delineates an epigenetics-mediated positive feedback loop linking MAPK to AP-1 and vice versa, reinforcing the MAPK pathway. Within this circuit, epigenetic mechanisms play a central role in modulating the expression of downstream genes via AP-1. Numerous other TFs are near AP-1 binding sites in srDMRs and srDARs that can interact with factors such as DNA methylation and chromatin accessibility. 55 , 56 , 57 In conclusion, the epigenetic landscape elucidated across different stages of LUAD in this study holds significant implications for advancing various avenues of research. While the epigenetic-mediated positive feedback loop requires further empirical investigation, the framework outlined herein offers fundamental insights into epigenetic modulation within LUAD, setting the stage for more detailed future research. Limitations of the study Utilizing the epigenetic landscape, lung cancer was investigated from two perspectives: molecular markers and functional mechanisms. However, the present study was subject to certain limitations. First, this investigation yielded improved biomarkers and models exclusive to lung cancer tissue that may not be directly applicable or generalizable to liquid biopsy. Moving forward, this issue will be addressed by collecting blood samples from multiple centers and utilizing WGBS data of cell-free DNA from these samples to further explore the 1,416 regions exhibiting significant epigenetic changes highlighted in this study. Additionally, while the AP-1 family comprises multiple members, this study did not distinguish between individual members. To elucidate the specific involvement of each member in the epigenetic-mediated positive feedback loop observed in LUAD, further investigations will include more intricate and targeted experimental designs. Resource availability Lead contact Further information and requests for resources, reagents, and data should be directed to and will be fulfilled by the lead contact, Deqiang Sun ( deqiangs@zju.edu.cn Materials availability This study did not generate unique reagents. Data and code availability  • The intermediate analysis files for WGBS, ATAC-seq, and RNA-seq reported in this article have been deposited (BioProject: PRJCA024580) in the Genome Sequence Archive of the BIG Data Center ( https://ngdc.cncb.ac.cn/omix/ https://www.encodeproject.org/ https://portal.gdc.cancer.gov/projects/tcga-luad GSE122126 https://www.ncbi.nlm.nih.gov/geo • The associated accession codes of this article are available on GitHub ( https://github.com/hcyvan/epiLUAD • Any additional information required to reanalyze the data reported in this article is available from the lead contact Acknowledgments We gratefully acknowledge the financial support provided by the 10.13039/501100001809 National Natural Science Foundation of China 81773012 10.13039/501100012166 National Key Research and Development Program of China 2022YFA1105200 2023YFA1800700 Author contributions All authors assisted in conducting the study. D.S., Z.C, Y.T., Y.B., and B.Z. participated in the conception and design; Y.C., Y.L., T.H., and Q.R. participated in the data analysis; L.X., T.Y., Y.T., W.L., X.W, and Z.S. participated in the acquisition and preparation of specimens; Y.S., M.C., and Y.C. participated in drafting the article or revised the content of the article critically; Y.C., Y.L., and T.H. participated in reviewing the final version for publication. All authors agree to be responsible for all aspects of the work. Declaration of interests The authors declare that no competing interests exists. STAR★Methods Key resources table  REAGENT or RESOURCE SOURCE IDENTIFIER Biological samples Lung tissues from patients Affiliated Yixing Hospital of Jiangsu University NA Critical commercial assays DNeasy Blood & Tissue Kit Qiagen NA EZ DNA Methylation-Gold Kit Zymo Research NA Nextera DNA Library Preparation Kit Illumina NA MinElute PCR Purification Kit Qiagen NA KAPA Real-Time Library Amplification Kit Roche NA PCRClean DX beads Aline Biosciences NA AHTS Universal V8 RNA-seq Library Prep Kit for Illumina Vazyme NA Cell Counting Kit-8 (CCK-8) Dojindo NA c-Fos/AP-1 inhibitor T-5224 MedChemExpress NA Annexin V-FITC/7-AAD Apoptosis Detection Kit Yeasen Biotechnology NA Deposited data Intermediate analysis files for WGBS, ATAC-seq, and RNA-seq Genome Sequence Archive of the BIG Data Center ( https://ngdc.cncb.ac.cn/omix/ PRJCA024580 ChIP-seq data for JUN ENCODE ( https://www.encodeproject.org/ ENCFF280RQS ChIP-seq data for FOS ENCODE ( https://www.encodeproject.org/ ENCFF459DPT ChIP-seq data for H3K27ac ENCODE ( https://www.encodeproject.org/ ENCFF614QOP methylation array of LUAD the TCGA data portal ( https://portal.gdc.cancer.gov/ TCGA-LUAD methylation array of cell-free DNA GEO ( https://www.ncbi.nlm.nih.gov/geo GSE122126 Experimental models: Cell lines A549 Wuhan, China NA Software and algorithms MOABS (1.3.2) Sun et al. 65 https://github.com/sunnyisgalaxy/moabs FastQC (0.11.9) Bioinformatics tools https://github.com/s-andrews/FastQC fastp (0.20.0) Chen et al. 66 https://github.com/OpenGene/fastp HISAT2 (2.2.1) Kim et al. 67 https://daehwankimlab.github.io/hisat2/ ENCODE ATAC-seq pipeline (2.12) WDL pipeline https://github.com/ENCODE-DCC/atac-seq-pipeline R software (4.3.2) the R Core Team and the R Foundation for Statistical Computing https://www.r-project.org/ ComplexHeatmap (2.18.0) R package https://www.bioconductor.org/packages/release/bioc/html/ComplexHeatmap.html ggplot2 (3.5.1) R package https://cran.r-project.org/web/packages/ggplot2/index.html dplyr (1.1.3) R package https://cran.r-project.org/web/packages/dplyr/index.html reshape2 (1.4.4) R package https://cran.r-project.org/web/packages/reshape2/index.html edgeR (4.0.16) R package https://bioconductor.org/packages/release/bioc/html/edgeR.html ChIPseeker (1.38.0) R package https://bioconductor.org/packages/release/bioc/html/ChIPseeker.html DESeq2 (1.42.1) R package https://bioconductor.org/packages/release/bioc/html/DESeq2.html epiLUAD GitHub code repository containing implementations in R and Python https://github.com/hcyvan/epiLUAD Experimental model and study participant details Ethics approval and consent to participate This study was approved by the Medical Ethics Committee of Yixing People’s Hospital (Approval ID 2021-040). Informed written consent was obtained from all participants. Cell line The human lung cancer cell line A549 was obtained from Procell (Wuhan, China). Method details Patients and sample acquisition Clinical data and samples were systematically collected from 151 patients with lung diseases (comprising 38 CTL, 33 AIS, 37 MIA, and 43 IAC cases) at the Affiliated Yixing Hospital of Jiangsu University. Haematoxylin and eosin (H&E) slides of each case were reviewed independently by two lung cancer pathologists to confirm the diagnosis. The study protocol and any subsequent amendments were approved by the Institutional Review Board. All participating patients provided written informed consent before inclusion in the study. WGBS library preparation and data analysis Genomic DNA was extracted using the DNeasy Blood & Tissue Kit (Qiagen, Valencia, CA) for library preparation. Purified DNA and 1% unmethylated lambda DNA (Promega, Madison, WI, USA) were sonicated to yield fragments ranging from 100 to 700 bp. The DNA fragments were subjected to sodium bisulfite conversion using an EZ DNA 318 Methylation-Gold Kit (Zymo Research, Orange, CA). Subsequently, the library was sequenced using an Illumina HiSeq6000. MOABS 65 ATAC-seq library preparation and data analysis Samples were enzymatically dissociated and lysed in lysis buffer. DNA was simultaneously fragmented and tagged with sequencing adapters using a Nextera DNA Library Preparation Kit (Illumina, California, USA). DNA fragments were purified and amplified using the MinElute PCR Purification Kit (Qiagen, Valencia, CA) and the KAPA Real-Time Library Amplification Kit (Roche, Basel, Switzerland), respectively. Subsequently, sequencing libraries were purified using PCRClean DX beads (Aline Biosciences, Waltham, USA). The library was then sequenced on NextSeq 500 (Illumina). The ENCODE ATAC-seq pipeline (v2.1.2; https://github.com/ENCODE-DCC/atac-seq-pipeline 2 p RNA-seq library preparation and data analysis VAHTS® Universal V8 RNA-seq Library Prep Kit for Illumina was used to prepare the RNA-seq library. Raw reads were assessed with FastQC (v0.11.9) using default settings. Quality filtering and adapter trimming were performed using fastp (v0.20.0) with parameters: --detect_adapter_for_pe, --cut_front, --cut_right, --trim_front1 = 10, and --trim_front2 = 10; other settings were default. Clean reads were aligned to the reference genome using HISAT2 (v2.2.1) with the --dta option. Gene-level quantification was conducted with featureCounts (v2.0.1) using -f -t gene -g gene_id; all other parameters were default. DEGs were identified using edgeR (v4.0.16), which models count data using the negative binomial distribution and estimates dispersion to account for biological variability. Genes with a absolute value of log 2 p Definition and detection of srDMCs, srDARs, and srDEGs LUAD is classified into three progressive stages: AIS, MIA, and IAC. To investigate dynamic molecular changes during tumor progression, we first calculated the alterations in specific attributes—namely DMCs, DARs, and DEGs—at each stage relative to the CTL group. Each attribute was then assigned to a stage based on the earliest time point at which a statistically significant change was detected. Based on the stage in which the change first occurred, attributes were categorized into six distinct groups. Once an attribute exhibited a significant change at a specific stage, its status in subsequent stages was no longer considered in comparison to CTL. As a result, the six categories were mutually exclusive, with no overlapping sites across them. For example, in the case of srDMCs, if a DMC first shows hypermethylation during the MIA stage, it is classified as “hyper in MIA” ( Document S1 Cell culture The LUAD cell line A549 was acquired from the Cell Bank of the Chinese Academy of Medical Sciences (Shanghai, China). The cells were propagated in Dulbecco’s modified Eagle’s medium (DMEM, Gibco, Thermo Fisher Scientific) supplemented with 10% foetal bovine serum (FBS, Sigma-Aldrich) and 1% penicillin-streptomycin solution (Beyotime). A549 cells were cultured in a controlled environment incubator maintained at 37°C with 5% CO 2 Cell proliferation and colony formation assays For the Cell Counting Kit-8 (CCK-8) assay, A549 cells treated with the c-Fos/AP-1 inhibitor T-5224 (MedChemExpress, Shanghai) were seeded in 96-well plates. Subsequently, CCK-8 reagent (Dojindo, Kumamoto, Japan) was added to achieve a final concentration of 10%, and the cells were incubated at 37°C for 3 h before measuring absorbance at a wavelength of 450 nm. These procedures were performed in triplicate to ensure experimental validity. After treatment with T-5224, viable A549 cells were collected by trypsinization, washed with PBS, and resuspended in fresh complete medium. Cell viability was confirmed by trypan blue exclusion (>95% viability in all groups). The cells were then seeded at a density of 500 cells per well in 12-well plates and incubated at 37°C for one week. After incubation, the colonies were fixed with 4% paraformaldehyde for 10 min, stained with 0.1% crystal violet for 10 min, and counted. All experiments were performed in triplicate. Transwell migration assay Transwell migration assays were conducted as previously described. 68 An equal number of viable cells (5 × 104 cells/well) were placed in the upper chamber of the transwell insert in serum-free DMEM, while the lower chamber was filled with DMEM containing 10% FBS. The cells were incubated at 37°C for 24 h to facilitate cell migration. The migratory cells that reached the lower chamber were fixed with 4% paraformaldehyde for 10 min and stained with 0.1% crystal violet for 10 min before quantification. Flow cytometry Apoptosis was detected using an Annexin V-FITC/7-AAD Apoptosis Kit (Yeasen Biotechnology, Shanghai, China). A549 cells were collected after treatment with T-5224 for 24 h, centrifuged at 300 × g Genome reference The genome reference hg38 was used for processing WGBS, ATAC-seq, and RNA-seq data. Quantification and statistical analysis All statistical analyses were performed using R4.3.2 statistical tests. Data are presented as mean ± standard deviation (SD), unless otherwise stated. The exact statistical test used ( n p p p p References 1 Siegel R.L. Miller K.D. Fuchs H.E. Jemal A. Cancer statistics CA Cancer J. Clin. 72 2022 7 33 35020204 10.3322/caac.21708 2 Succony L. Rassl D.M. Barker A.P. McCaughan F.M. Rintoul R.C. Adenocarcinoma spectrum lesions of the lung: Detection, pathology and treatment strategies Cancer Treat Rev. 99 2021 102237 10.1016/j.ctrv.2021.102237 34182217 3 Lambe G. Durand M. Buckley A. Nicholson S. McDermott R. Adenocarcinoma of the lung: from BAC to the future Insights Imaging 11 2020 69 32430670 10.1186/s13244-020-00875-6 PMC7237554 4 Hu X. Estecio M.R. Chen R. Reuben A. Wang L. Fujimoto J. Carrot-Zhang J. McGranahan N. Ying L. Fukuoka J. Evolution of DNA methylome from precancerous lesions to invasive lung adenocarcinomas Nat. Commun. 12 2021 687 33514726 10.1038/s41467-021-20907-z PMC7846738 5 Karasaki T. Moore D.A. Veeriah S. Naceur-Lombardelli C. Toncheva A. Magno N. Ward S. Bakir M.A. Watkins T.B.K. Grigoriadis K. Evolutionary characterization of lung adenocarcinoma morphology in TRACERx Nat. Med. 29 2023 833 845 37045996 10.1038/s41591-023-02230-w PMC7614478 6 Hu X. Fujimoto J. Ying L. Fukuoka J. Ashizawa K. Sun W. Reuben A. Chow C.W. McGranahan N. Chen R. Multi-region exome sequencing reveals genomic evolution from preneoplasia to lung adenocarcinoma Nat. Commun. 10 2019 2978 31278276 10.1038/s41467-019-10877-8 PMC6611767 7 Tremblay M.W. Jiang Y.H. DNA Methylation and Susceptibility to Autism Spectrum Disorder Annu. Rev. Med. 70 2019 151 166 30691368 10.1146/annurev-med-120417-091431 PMC6597259 8 Xi Y. Lin Y. Guo W. Wang X. Zhao H. Miao C. Liu W. Liu Y. Liu T. Luo Y. Multi-omic characterization of genome-wide abnormal DNA methylation reveals diagnostic and prognostic markers for esophageal squamous-cell carcinoma Signal Transduct. Target. Ther. 7 2022 53 35210398 10.1038/s41392-022-00873-8 PMC8873499 9 Portela A. Esteller M. Epigenetic modifications and human disease Nat. Biotechnol. 28 2010 1057 1068 20944598 10.1038/nbt.1685 10 Noro R. Ishigame T. Walsh N. Shiraishi K. Robles A.I. Ryan B.M. Schetter A.J. Bowman E.D. Welsh J.A. Seike M. A Two-Gene Prognostic Classifier for Early-Stage Lung Squamous Cell Carcinoma in Multiple Large-Scale and Geographically Diverse Cohorts J. Thorac. Oncol. 12 2017 65 76 27613525 10.1016/j.jtho.2016.08.141 PMC6503970 11 Zhao L. Wu X. Zheng J. Dong D. DNA methylome profiling of circulating tumor cells in lung cancer at single base-pair resolution Oncogene 40 2021 1884 1895 33564067 10.1038/s41388-021-01657-0 PMC7946637 12 Yu H. Raut J.R. Schöttker B. Holleczek B. Zhang Y. Brenner H. Individual and joint contributions of genetic and methylation risk scores for enhancing lung cancer risk stratification: data from a population-based cohort in Germany Clin. Epigenetics 12 2020 89 32552915 10.1186/s13148-020-00872-y PMC7301507 13 Zhao S.G. Chen W.S. Li H. Foye A. Zhang M. Sjöström M. Aggarwal R. Playdle D. Liao A. Alumkal J.J. The DNA methylation landscape of advanced prostate cancer Nat. Genet. 52 2020 778 789 32661416 10.1038/s41588-020-0648-8 PMC7454228 14 Klughammer J. Kiesel B. Roetzer T. Fortelny N. Nemc A. Nenning K.H. Furtner J. Sheffield N.C. Datlinger P. Peter N. The DNA methylation landscape of glioblastoma disease progression shows extensive heterogeneity in time and space Nat. Med. 24 2018 1611 1624 30150718 10.1038/s41591-018-0156-x PMC6181207 15 Duruisseaux M. Martínez-Cardús A. Calleja-Cervantes M.E. Moran S. Castro de Moura M. Davalos V. Piñeyro D. Sanchez-Cespedes M. Girard N. Brevet M. Epigenetic prediction of response to anti-PD-1 treatment in non-small-cell lung cancer: a multicentre, retrospective analysis Lancet Respir. Med. 6 2018 771 781 30100403 10.1016/S2213-2600(18)30284-4 16 Jurmeister P. Bockmayr M. Seegerer P. Bockmayr T. Treue D. Montavon G. Vollbrecht C. Arnold A. Teichmann D. Bressem K. Machine learning analysis of DNA methylation profiles distinguishes primary lung squamous cell carcinomas from head and neck metastases Sci. Transl. Med. 11 2019 eaaw8513 10.1126/scitranslmed.aaw8513 31511427 17 Vaissiere T. Hung R.J. Zaridze D. Moukeria A. Cuenin C. Fasolo V. Ferro G. Paliwal A. Hainaut P. Brennan P. Tost J. Quantitative Analysis of DNA Methylation Profiles in Lung Cancer Identifies Aberrant DNA Methylation of Specific Genes and Its Association with Gender and Cancer Risk Factors Cancer Res. 69 2008 243 252 10.1158/0008-5472.CAN-08-2489 PMC2613548 19118009 18 Klemm S.L. Shipony Z. Greenleaf W.J. Chromatin accessibility and the regulatory epigenome Nat. Rev. Genet. 20 2019 207 220 30675018 10.1038/s41576-018-0089-8 19 Corces M.R. Granja J.M. Shams S. Louie B.H. Seoane J.A. Zhou W. Silva T.C. Groeneveld C. Wong C.K. Cho S.W. The chromatin accessibility landscape of primary human cancers Science 362 2018 eaav1898 10.1126/science.aav1898 PMC6408149 30361341 20 Xin J. Zhang H. He Y. Duren Z. Bai C. Chen L. Luo X. Yan D.S. Zhang C. Zhu X. Chromatin accessibility landscape and regulatory network of high-altitude hypoxia adaptation Nat. Commun. 11 2020 4928 33004791 10.1038/s41467-020-18638-8 PMC7529806 21 Thurman R.E. Rynes E. Humbert R. Vierstra J. Maurano M.T. Haugen E. Sheffield N.C. Stergachis A.B. Wang H. Vernot B. The accessible chromatin landscape of the human genome Nature 489 2012 75 82 22955617 10.1038/nature11232 PMC3721348 22 Wang Z. Tu K. Xia L. Luo K. Luo W. Tang J. Lu K. Hu X. He Y. Qiao W. The Open Chromatin Landscape of Non–Small Cell Lung Carcinoma Cancer Res. 79 2019 4840 4854 31209061 10.1158/0008-5472.CAN-18-3663 23 Nouruzi S. Ganguli D. Tabrizian N. Kobelev M. Sivak O. Namekawa T. Thaper D. Baca S.C. Freedman M.L. Aguda A. ASCL1 activates neuronal stem cell-like lineage programming through remodeling of the chromatin landscape in prostate cancer Nat. Commun. 13 2022 2282 35477723 10.1038/s41467-022-29963-5 PMC9046280 24 Kusi M. Zand M. Lin L.L. Chen M. Lopez A. Lin C.L. Wang C.M. Lucio N.D. Kirma N.B. Ruan J. 2-Hydroxyglutarate destabilizes chromatin regulatory landscape and lineage fidelity to promote cellular heterogeneity Cell Rep. 38 2022 110220 10.1016/j.celrep.2021.110220 PMC8811753 35021081 25 Lister R. Pelizzola M. Dowen R.H. Hawkins R.D. Hon G. Tonti-Filippini J. Nery J.R. Lee L. Ye Z. Ngo Q.M. Human DNA methylomes at base resolution show widespread epigenomic differences Nature 462 2009 315 322 19829295 10.1038/nature08514 PMC2857523 26 Berman B.P. Weisenberger D.J. Aman J.F. Hinoue T. Ramjan Z. Liu Y. Noushmehr H. Lange C.P.E. van Dijk C.M. Tollenaar R.A.E.M. Regions of focal DNA hypermethylation and long-range hypomethylation in colorectal cancer coincide with nuclear lamina-associated domains Nat. Genet. 44 2011 40 46 22120008 10.1038/ng.969 PMC4309644 27 Buenrostro J.D. Giresi P.G. Zaba L.C. Chang H.Y. Greenleaf W.J. Transposition of native chromatin for fast and sensitive epigenomic profiling of open chromatin, DNA-binding proteins and nucleosome position Nat. Methods 10 2013 1213 1218 24097267 10.1038/nmeth.2688 PMC3959825 28 Ronkina N. Gaestel M. MAPK-Activated Protein Kinases: Servant or Partner? Annu. Rev. Biochem. 91 2022 505 540 35303787 10.1146/annurev-biochem-081720-114505 29 Braicu C. Buse M. Busuioc C. Drula R. Gulei D. Raduly L. Rusu A. Irimie A. Atanasov A.G. Slaby O. A Comprehensive Review on MAPK: A Promising Therapeutic Target in Cancer Cancers 11 2019 1618 31652660 10.3390/cancers11101618 PMC6827047 30 Molina J.R. Adjei A.A. The Ras/Raf/MAPK Pathway J. Thorac. Oncol. 1 2006 7 9 17409820 31 Lee J.T. McCubrey J.A. The Raf/MEK/ERK signal transduction cascade as a target for chemotherapeutic intervention in leukemia Leukemia 16 2002 486 507 11960326 10.1038/sj.leu.2402460 32 Nakano Y. Shimizu W. Brugada Syndrome as a Major Cause of Sudden Cardiac Death in Asians JACC. Asia 2 2022 412 421 36339362 10.1016/j.jacasi.2022.03.011 PMC9627855 33 Dong X. Guo R. Ji T. Zhang J. Xu J. Li Y. Sheng Y. Wang Y. Fang K. Wen Y. YY1 safeguard multidimensional epigenetic landscape associated with extended pluripotency Nucleic Acids Res. 50 2022 12019 12038 35425987 10.1093/nar/gkac230 PMC9756953 34 Fang S. Li J. Xiao Y. Lee M. Guo L. Han W. Li T. Hill M.C. Hong T. Mo W. Tet inactivation disrupts YY1 binding and long-range chromatin interactions during embryonic heart development Nat. Commun. 10 2019 4297 31541101 10.1038/s41467-019-12325-z PMC6754421 35 Xu C. Corces V.G. Nascent DNA methylome mapping reveals inheritance of hemimethylation at CTCF/cohesin sites Science 359 2018 1166 1170 29590048 10.1126/science.aan5480 PMC6359960 36 Katz M. Amit I. Yarden Y. Regulation of MAPKs by growth factors and receptor tyrosine kinases Biochim. Biophys. Acta 1773 2007 1161 1176 17306385 10.1016/j.bbamcr.2007.01.002 PMC2758354 37 Sharma S.V. Bell D.W. Settleman J. Haber D.A. Epidermal growth factor receptor mutations in lung cancer Nat. Rev. Cancer 7 2007 169 181 17318210 10.1038/nrc2088 38 Qi M. Fan S. Huang M. Pan J. Li Y. Miao Q. Lyu W. Li X. Deng L. Qiu S. Targeting FAPα-expressing hepatic stellate cells overcomes resistance to antiangiogenics in colorectal cancer liver metastasis models J. Clin. Investig. 132 2022 e157399 10.1172/JCI157399 PMC9525122 35951441 39 McLean C.Y. Bristor D. Hiller M. Clarke S.L. Schaar B.T. Lowe C.B. Wenger A.M. Bejerano G. GREAT improves functional interpretation of cis-regulatory regions Nat. Biotechnol. 28 2010 495 501 20436461 10.1038/nbt.1630 PMC4840234 40 Tanigawa Y. Dyer E.S. Bejerano G. WhichTF is functionally important in your open chromatin data? PLoS Comput. Biol. 18 2022 e1010378 10.1371/journal.pcbi.1010378 PMC9426921 36040971 41 Whitsett J.A. Wert S.E. Weaver T.E. Alveolar Surfactant Homeostasis and the Pathogenesis of Pulmonary Disease Annu. Rev. Med. 61 2010 105 119 19824815 10.1146/annurev.med.60.041807.123500 PMC4127631 42 Heinz S. Benner C. Spann N. Bertolino E. Lin Y.C. Laslo P. Cheng J.X. Murre C. Singh H. Glass C.K. Simple combinations of lineage-determining transcription factors prime cis-regulatory elements required for macrophage and B cell identities Mol. Cell 38 2010 576 589 20513432 10.1016/j.molcel.2010.05.004 PMC2898526 43 Eferl R. Wagner E.F. AP-1: a double-edged sword in tumorigenesis Nat. Rev. Cancer 3 2003 859 868 14668816 10.1038/nrc1209 44 Bakiri L. Hasenfuss S.C. Guío-Carrión A. Thomsen M.K. Hasselblatt P. Wagner E.F. Liver cancer development driven by the AP-1/c-Jun∼Fra-2 dimer through c-Myc Proc. Natl. Acad. Sci. USA 121 2024 e2404188121 10.1073/pnas.2404188121 PMC11067056 38657045 45 Kyriakis J.M. Activation of the AP-1 Transcription Factor by Inflammatory Cytokines of the TNF Family Gene Expr. 7 1999 217 231 10440223 PMC6174675 46 Ozolins T.R. Hales B.F. Post-translational regulation of AP-1 transcription factor DNA-binding activity in the rat conceptus Mol. Pharmacol. 56 1999 537 544 10462541 10.1124/mol.56.3.537 47 Albertina, B. TCGA-LUAD. The Cancer Imaging Archive (TCIA) https://www.cancerimagingarchive.net/collection/tcga-luad/ 48 Lan C.-N. Cai W.-J. Shi J. Yi Z.-J. MAPK inhibitors protect against early-stage osteoarthritis by activating autophagy Mol. Med. Rep. 24 2021 829 34590154 10.3892/mmr.2021.12469 PMC8503737 49 Ou S. Chen H. Wang H. Ye J. Liu H. Tao Y. Ran S. Mu X. Liu F. Zhu S. Fusobacterium nucleatum upregulates MMP7 to promote metastasis-related characteristics of colorectal cancer cell via activating MAPK(JNK)-AP1 axis J. Transl. Med. 21 2023 704 37814323 10.1186/s12967-023-04527-3 PMC10561506 50 Su Z. Yang Z. Xu Y. Chen Y. Yu Q. Apoptosis, autophagy, necroptosis, and cancer metastasis Mol. Cancer 14 2015 48 25743109 10.1186/s12943-015-0321-5 PMC4343053 51 Tang Z. Kang B. Li C. Chen T. Zhang Z. GEPIA2: an enhanced web server for large-scale expression profiling and interactive analysis Nucleic Acids Res. 47 2019 W556 W560 31114875 10.1093/nar/gkz430 PMC6602440 52 Lee H.-J. Lee C.H. Jeong Y.J. Chung D.H. Goo J.M. Park C.M. Austin J.H.M. IASLC/ATS/ERS International Multidisciplinary Classification of Lung Adenocarcinoma: novel concepts and radiologic implications J. Thorac. Imaging 27 2012 340 353 23086014 10.1097/RTI.0b013e3182688d62 53 Zhu J. Wang W. Xiong Y. Xu S. Chen J. Wen M. Zhao Y. Lei J. Jiang T. Evolution of lung adenocarcinoma from preneoplasia to invasive adenocarcinoma Cancer Med. 12 2023 5545 5557 36325966 10.1002/cam4.5393 PMC10028051 54 Wang S. Meng F. Li M. Bao H. Chen X. Zhu M. Liu R. Xu X. Yang S. Wu X. Multidimensional Cell-Free DNA Fragmentomic Assay for Detection of Early-Stage Lung Cancer Am. J. Respir. Crit. Care Med. 207 2023 1203 1213 36346614 10.1164/rccm.202109-2019OC PMC10161762 55 Stadler M.B. Murr R. Burger L. Ivanek R. Lienert F. Schöler A. van Nimwegen E. Wirbelauer C. Oakeley E.J. Gaidatzis D. DNA-binding factors shape the mouse methylome at distal regulatory regions Nature 480 2011 490 495 22170606 10.1038/nature10716 56 Kaluscha S. Domcke S. Wirbelauer C. Stadler M.B. Durdu S. Burger L. Schübeler D. Evidence that direct inhibition of transcription factor binding is the prevailing mode of gene and repeat repression by DNA methylation Nat. Genet. 54 2022 1895 1906 36471082 10.1038/s41588-022-01241-6 PMC9729108 57 Carter B. Zhao K. The epigenetic basis of cellular heterogeneity Nat. Rev. Genet. 22 2021 235 250 33244170 10.1038/s41576-020-00300-0 PMC10880028 58 Kim J. Minna J.D. AP-1 leads the way in lung cancer transformation Dev. Cell 57 2022 292 294 35134341 10.1016/j.devcel.2022.01.007 PMC10234085 59 Kadur Lakshminarasimha Murthy P. Xi R. Arguijo D. Everitt J.I. Kocak D.D. Kobayashi Y. Bozec A. Vicent S. Ding S. Crawford G.E. Epigenetic basis of oncogenic-Kras-mediated epithelial-cellular proliferation and plasticity Dev. Cell 57 2022 310 328.e9 35134344 10.1016/j.devcel.2022.01.006 PMC8938988 60 Papavassiliou A.G. Musti A.M. The Multifaceted Output of c-Jun Biological Activity: Focus at the Junction of CD8 T Cell Activation and Exhaustion Cells 9 2020 2470 33202877 10.3390/cells9112470 PMC7697663 61 Du K. Sun S. Jiang T. Liu T. Zuo X. Xia X. Liu X. Wang Y. Bu Y. E2F2 promotes lung adenocarcinoma progression through B-Myb- and FOXM1-facilitated core transcription regulatory circuitry Int. J. Biol. Sci. 18 2022 4151 4170 35844795 10.7150/ijbs.72386 PMC9274503 62 Cheung W.K.C. Zhao M. Liu Z. Stevens L.E. Cao P.D. Fang J.E. Westbrook T.F. Nguyen D.X. Control of alveolar differentiation by the lineage transcription factors GATA6 and HOPX inhibits lung adenocarcinoma metastasis Cancer Cell 23 2013 725 738 23707782 10.1016/j.ccr.2013.04.009 PMC3697763 63 Liu W.J. Du Y. Wen R. Yang M. Xu J. Drug resistance to targeted therapeutic strategies in non-small cell lung cancer Pharmacol. Ther. 206 2020 107438 10.1016/j.pharmthera.2019.107438 31715289 64 Roberts P.J. Der C.J. Targeting the Raf-MEK-ERK mitogen-activated protein kinase cascade for the treatment of cancer Oncogene 26 2007 3291 3310 17496923 10.1038/sj.onc.1210422 65 Sun D. Xi Y. Rodriguez B. Park H.J. Tong P. Meong M. Goodell M.A. Li W. MOABS: model based analysis of bisulfite sequencing data Genome Biol. 15 2014 R38 24565500 10.1186/gb-2014-15-2-r38 PMC4054608 66 Chen S. Zhou Y. Chen Y. Gu J. fastp: an ultra-fast all-in-one FASTQ preprocessor Bioinformatics 34 2018 i884 i890 30423086 10.1093/bioinformatics/bty560 PMC6129281 67 Kim D. Paggi J.M. Park C. Bennett C. Salzberg S.L. Graph-based genome alignment and genotyping with HISAT2 and HISAT-genotype Nat. Biotechnol. 37 2019 907 915 31375807 10.1038/s41587-019-0201-4 PMC7605509 68 Kota P. Terrell E.M. Ritt D.A. Insinna C. Westlake C.J. Morrison D.K. M-Ras/Shoc2 signaling modulates E-cadherin turnover and cell–cell adhesion during collective cell migration Proc. Natl. Acad. Sci. USA 116 2019 3536 3545 30808747 10.1073/pnas.1805919116 PMC6397545 Supplemental information  Document S1. Figures S1–S4 and Tables S2, S4, S6, S8, S9, S11, and S13 Table S1. Summary of clinical information of subjects, related to Figure 1A Table S3. Summary of WGBS data, related to Figure 1B Table S5. DMCs identified in LUAD samples, related to Figure 2A (A) DMCs in the AIS vs. the CTL group. (B) DMCs in MIA vs. CTL group. (C) DMCs in IAC vs. CTL group. (D) Statistics of hyper and hypo DMCs in each group. Table S7. srDMCs identified in LUAD samples, related to Figure 2C (A) srDMCs in AIS vs. CTL group. (B) srDMCs in MIA vs. CTL group. (C) srDMCs in IAC vs. CTL group. (D) Statistics of hyper and hypo srDMCs in each group. Table S10. srDARs identified in LUAD samples, related to Figure 3C (A) srDARs in AIS vs. CTL group. (B) srDARs in MIA vs. CTL group. (C) srDARs in IAC vs. CTL group. Table S12. Differentially expressed genes of LUAD samples, related to Figure 1A Supplemental information can be found online at https://doi.org/10.1016/j.isci.2025.113339 ",
  "metadata": {
    "Title of this paper": "M-Ras/Shoc2 signaling modulates E-cadherin turnover and cell–cell adhesion during collective cell migration",
    "Journal it was published in:": "iScience",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12475578/"
  }
}