{
  "title": "Paper_1090",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470752 PMC12470752.1 12470752 12470752 41009777 10.3390/ijms26189215 ijms-26-09215 1 Article Bioactive Compounds and Pharmacological Properties of the Polypore Fomes fomentarius https://orcid.org/0000-0001-5142-9278 Erbiai El Hadi Conceptualization Methodology Software Formal analysis Investigation Data curation Writing – original draft 1 2 3 * Maouni Safae Formal analysis Data curation Visualization 2 4 https://orcid.org/0000-0002-5647-8455 Pinto da Silva Luís Methodology Validation Resources Writing – review & editing Supervision Funding acquisition 3 Saidi Rabah Visualization Funding acquisition 2 Lamrani Zouhaire Validation Visualization Supervision 2 https://orcid.org/0000-0001-8478-3441 Esteves da Silva Joaquim C. G. 3 https://orcid.org/0000-0001-9280-3596 Maouni Abdelfettah Conceptualization Methodology Validation Investigation Resources Writing – review & editing Supervision Project administration Funding acquisition 2 https://orcid.org/0000-0003-2948-5809 Pinto Eugénia Methodology Validation Investigation Resources Writing – review & editing Supervision 5 6 * Garzoli Stefania Academic Editor 1 2 maouni.safae88@gmail.com r.saidi@uae.ac.ma zh.amrani@yahoo.fr amaouni@uae.ac.ma 3 luis.silva@fc.up.pt jcsilva@fc.up.pt 4 5 6 * eherbiai@utad.pt epinto@ff.up.pt 21 9 2025 9 2025 26 18 497349 9215 14 8 2025 13 9 2025 19 9 2025 21 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Polypore mushrooms have been widely recognized for centuries for their use in food and medicine due to their strong capacity to produce numerous biomolecules with beneficial effects on human health. Fomes fomentarius F. fomentarius F. fomentarius p F. fomentarius β 50 Epidermophyton floccosum A. fumigatus F. fomentarius Moroccan mushroom polypore mushrooms Fomes fomentarius bioactive compounds pharmacological properties volatile and non-volatile molecules MESRSI and CNRST PPR2-35/2016 FCT PTDC/QEQ-QAN/5955/2014 PTDC/QUI-QFI/2870/2020 UIDB/00081/2020 LA/P/0056/2020 UIDB/04423/2020 UIDP/04423/2020 UID/04033/2023 LA/P/0126/2020 CEECINST/00069/2021 PRR and European Funds NextGeneration EU BIPD/UTAD/3/2023 This work was supported by a Moroccan project (PPR2-35/2016, titled “Biological control of crop diseases and cancer & Valorization of plants and superior fungi from Northern Morocco”) funded by MESRSI and CNRST. Secondly, this work was completed in the Faculty of Sciences and Faculty of Pharmacy of the University of Porto, within the framework of FCT (“Fundação para a Ciência e Tecnologia”, Portugal)-funded projects PTDC/QEQ-QAN/5955/2014, PTDC/QUI-QFI/2870/2020, UIDB/00081/2020 (CIQUP), and LA/P/0056/2020 (IMS), UIDB/04423/2020, UIDP/04423/2020 (CIIMAR), UID/04033/2023 and LA/P/0126/2020 ( https://doi.org/10.54499/LA/P/0126/2020 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Polypore mushrooms are a diverse group of Basidiomycota 1 2 1 2 3 4 1 3 5 6 7 8 Ganoderma lucidum G. applanatum Inonotus cuticularis I. hispidus I. obliquus Laetiporus sulphureus Grifola umbellata Meripilus giganteus Piptoporus betulinus Trametes hirsuta T. versicolor Wolfiporia cocos Fomes fomentarius 1 3 5 6 7 8 F. fomentarius F. fomentarius 3 9 10 11 12 13 14 15 16 17 11 F. fomentarius 3 10 12 13 14 15 Previous studies on F. fomentarius 3 12 13 10 12 13 14 F. fomentarius F. fomentarius The present study aimed, firstly, to characterize the chemical compound profile of F. fomentarius F. fomentarius F. fomentarius 2. Results and Discussion 2.1. Extraction Yield and Bioactive Compounds Contents in F. fomentarius The extraction of bioactive compounds from the polypore mushroom F. fomentarius 16 12 16 12 As shown in Table 1 F. fomentarius Acacia β β The TPC found in Moroccan F. fomentarius 17 13 16 18 19 16 12 20 Regarding TFC, F. fomentarius 21 18 17 16 F. fomentarius The TTC in the Moroccan mushroom was determined as 0.95 ± 0.07 mg CE/g dry weight (dw), which was substantially higher than the value found in the Tunisian mushroom (0.005 mg/g dw) [ 18 Importantly, this study represents the first report on the content of other key bioactive compounds in F. fomentarius β 2.2. Biomolecules Profiles of F. fomentarius by GC-MS GC–MS, a powerful technique for biomolecule identification, was employed to characterize the biomolecules profile of the F. fomentarius Table 2 Tables S1–S13 Table 2 In the methanolic extract diluted in chloroform, GC–MS analysis identified 39 volatile components, primarily belonging to the classes of phenols (40.30%), fatty acids (15.80%), and alkaloids (11.55%). The predominant compounds were 4-(3,5-di-tert-butyl-4-hydroxyphenyl)butyl acrylate (21.71%), 2,6-di-tert-butyl-4-(dimethylaminomethyl)phenol (18.16%), 6-ethoxy-2,2,4-trimethyl-1,2,3,4-tetrahydroquinoline (12.11%), botulin (10.00%), 5-benzylquinoline (9.87%), and linoelaidic acid (5.28%) ( Figure S1 Table 2 Tables S1–S6 22 23 24 25 26 F. fomentarius 27 28 29 30 Table 2 Table S5 31 32 F. fomentarius In the derivatized extract, the GC–MS chromatogram revealed numerous peaks ( Figure 1 F. fomentarius Table 2 Tables S7–S13 F. fomentarius Table S7 F. fomentarius 4 Table S8 33 34 35 36 20 F. fomentarius Table S9 Table S10 F. fomentarius 27 37 29 27 37 4 F. fomentarius Tables S11–S13 F. fomentarius Acacia 2.3. Individual Polyphenols of F. fomentarius by LC–MS Analysis Phenolic compounds are among the principal bioactive compounds in mushrooms, and LC–MS is a powerful technique for their characterization. In this study, LC–MS analysis of the hydro-methanolic extract of F. fomentarius Figure 2 Table 3 p Table 3 F. fomentarius To date, only a few studies have characterized the individual polyphenols of F. fomentarius 19 16 38 39 40 41 19 16 p F. fomentarius 38 40 o 40 F. fomentarius 41 F. fomentarius F. fomentarius 22 23 24 25 2.4. Antioxidant Properties of F. fomentarius Antioxidants are a large group of beneficial molecules known to mitigate numerous chronic diseases such as inflammation, aging, cancer, cardiovascular diseases, and anemia [ 42 F. fomentarius Table 4 50 Figures S2–S4 F. fomentarius 50 β 50 50 Table 4 22 25 The antioxidant activities of F. fomentarius β For the DPPH assay, the radical-scavenging activity of Moroccan F. fomentarius Figure S2 43 50 50 17 50 12 44 24 45 33 50 F. fomentarius 50 13 16 50 18 Regarding the β F. fomentarius Figure S3 50 Table 4 In the ferric ion-reducing power assay, the methanolic extract demonstrated a steady increase in reducing ability, reaching an absorbance of 1.53 at 800 µg/mL ( Figure S4 50 44 40 50 18 F. fomentarius 16 Pearson’s correlation coefficients (r) between antioxidant activities of the methanolic extract and bioactive compound contents, including nine major individual phenolic compounds, are shown in Figure 3 p 2 p β 22 25 2.5. Antimicrobial Properties of F. fomentarius Following the analysis of bioactive compounds and antioxidant evaluation, the antimicrobial properties of the Moroccan F. fomentarius Table 5 Table 6 F. fomentarius 13 16 18 19 40 43 45 The antibacterial activity was approximately twofold higher against the Gram-positive S. aureus E. coli Table 5 The antifungal activity of the methanolic extract was evaluated against five human pathogenic fungi, including one yeast ( Candida albicans Aspergillus fumigatus Table 6 C. albicans A. fumigatus C. albicans A. fumigatus Epidermophyton floccosum Microsporum canis Trichophyton rubrum Figure 4 F. fomentarius p E. coli S. aureus For antifungal activity, MIC and MFC values against C. albicans A. fumigatus p p 2 T. rubrum E. floccosum p M. canis 22 23 24 25 Antimicrobial activities of both edible and inedible mushrooms have been widely studied using various solvents, methods, and units of measurement, consistently demonstrating potent antimicrobial effects against diverse pathogens [ 46 F. fomentarius 13 16 18 19 40 43 45 Regarding antibacterial activity against S. aureus E. coli F. fomentarius 18 19 F. fomentarius 13 16 40 45 S. aureus E. coli Antifungal studies on F. fomentarius C. albicans 45 A. fumigatus 47 F. fomentarius C. albicans 45 F. fomentarius A. fumigatus 47 Lactarius sanguifluus 48 Overall, the notable antimicrobial effects observed in this study can be attributed to the diverse biomolecules present in F. fomentarius 49 25 F. fomentarius F. fomentarius 3. Materials and Methods 3.1. Chemical Reagents and Standards Phenolic compounds standards (≥95%), linoleic acid (≥98%), gentamicin (≥99%), Trolox ((±)-6-Hydroxy-2,5,7,8-tetramethylchromane-2-carboxylic acid) (97%), β 8 20 21 40 Folin–Ciocalteu 3.2. Mushroom Material The tinder fungus, Fomes fomentarius Acacia A. rubida A. saligna 50 51 F. fomentarius 4 3.3. Determination of Bioactive Compound Contents The determination of bioactive compound contents, including TPC, TFC, TTC, AAC, and βCLC, was performed spectrophotometrically using the same equipment, conditions, and methods previously described by Erbiai et al. [ 52 The Folin–Ciocalteu F. fomentarius Folin–Ciocalteu v v The aluminum chloride (AlCl 3 F. fomentarius 2 3 The vanillin–HCl method was followed to determine the TTC in F. fomentarius v v The AAC in Moroccan F. fomentarius w v The quantification of carotenoids, namely β v v β β 663 505 453 663 505 453 3.4. Biomolecules Analysis of F. fomentarius Methanolic Extract by GC-MS The bioactive compound profile of the methanolic extract of the medicinal mushroom F. fomentarius 53 m z 8 20 21 40 53 3.5. Characterization of Individual Polyphenols by LC-MS Analysis The extraction of polyphenolic compounds from F. fomentarius v v g v v Concerning the chromatographic analysis, individual polyphenol compounds were identified and quantified following previously published work by our research team [ 4 2 3.6. Determination of Antioxidant Properties The antioxidant properties of the bioactive compound constituents in the methanolic extract of F. fomentarius β 50 54 3.6.1. DPPH Radical-Scavenging Activity (RSA) RSA of the methanolic extract of F. fomentarius • DPPH ES DPPH ES DPPH 3.6.2. Inhibition of β β The β F. fomentarius β 0 β 2 β β β β β β 3.6.3. Reducing Power Assay (RPA) The RPA was employed as the third method to evaluate the antioxidant capacity of the methanolic extract of F. fomentarius 3+ 2+ 3.7. Evaluation of Antimicrobial Properties The antimicrobial properties of the biomolecules present in the methanolic extract of F. fomentarius 55 56 57 58 The experimental procedures, reagents, standards, conditions, equipment, and pathogenic strains used in this study were identical to those described in our previous work [ 4 E. coli S. aureus A. fumigatus C. albicans E. floccosum M. canis T. rubrum C. krusei Concerning the determination of MIC and MFC/MBC, the dried methanolic extract and synthetic antimicrobial agents were dissolved in dimethyl sulfoxide (DMSO) at a final concentration of ≤2%, followed by serial dilutions in the appropriate growth media: RPMI-1640 with MOPS (pH 7.0) for fungi and Mueller-Hinton broth (MHB) for bacteria to achieve the necessary concentration range. A 100 µL aliquot of each diluted sample was transferred to the wells of a 96-well microplate, followed by the addition of 100 µL of microbial suspension (1–2 × 10 5 3 4 Aspergillus 3 Candida Aspergillus 3.8. Statistical Analysis Except for GC-MS analysis, all assays were conducted in triplicate using three independent samples, and the results were expressed as mean ± standard deviation (SD). The correlation between bioactive compound content, major phenolic compounds, and pharmacological properties was assessed using Pearson’s correlation coefficient (r). Statistical analyses were performed using GraphPad Prism 8.0.1 (San Diego, CA, USA). 4. Conclusions This study represents the first investigation of the biomolecule composition and pharmacological properties of F. fomentarius F. fomentarius Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/ijms26189215/s1 Author Contributions Conceptualization, E.H.E. and A.M.; Data curation, E.H.E. and S.M.; Formal analysis, E.H.E., S.M.; Funding acquisition, J.C.G.E.d.S., L.P.d.S., R.S. and A.M.; Investigation, E.H.E., A.M., E.P. and J.C.G.E.d.S.; Methodology, E.H.E., A.M., L.P.d.S., E.P. and J.C.G.E.d.S.; Project administration, J.C.G.E.d.S. and A.M.; Resources, A.M.; L.P.d.S.; E.P. and J.C.G.E.d.S.; Software, E.H.E.; Supervision, L.P.d.S.; E.P.; J.C.G.E.d.S.; Z.L. and A.M.; Validation, L.P.d.S.; E.P.; J.C.G.E.d.S.; Z.L., and A.M.; Visualization, S.M., R.S. and Z.L.; Writing—original draft, E.H.E.; Writing—review and editing, A.M.; E.P.; J.C.G.E.d.S. and L.P.d.S. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement Data are contained within the article or Supplementary Material Conflicts of Interest The authors declare no conflicts of interest. References 1. Singh M. Chapter 13—Fungal Strains as Source of Bioactive Compounds and Their Potential Application Volatiles and Metabolites of Microbes Kumar A. Singh J. Samuel J. Academic Press Cambridge, MA, USA 2021 257 282 978-0-12-824523-1 2. Doskocil I. Havlik J. Verlotta R. Tauchen J. Vesela L. Macakova K. Opletal L. Kokoska L. Rada V. In Vitro Immunomodulatory Activity, Cytotoxicity and Chemistry of Some Central European Polypores Pharm. Biol. 2016 54 2369 2376 10.3109/13880209.2016.1156708 26984176 3. Grienke U. Zöll M. Peintner U. Rollinger J.M. European Medicinal Polypores—A Modern View on Traditional Uses J. Ethnopharmacol. 2014 154 564 583 10.1016/j.jep.2014.04.030 24786572 4. Erbiai E.H. Amina B. Kaoutar A. Saidi R. Lamrani Z. Pinto E. Esteves da Silva J.C.G. Maouni A. Pinto da Silva L. Chemical Characterization and Evaluation of Antimicrobial Properties of the Wild Medicinal Mushroom Ganoderma Lucidum Growing in Northern Moroccan Forests Life 2023 13 1217 10.3390/life13051217 37240862 PMC10223331 5. Kozarski M. Klaus A. Špirović-Trifunović B. Miletić S. Lazić V. Žižak Ž. Vunduk J. Bioprospecting of Selected Species of Polypore Fungi from the Western Balkans Molecules 2024 29 314 10.3390/molecules29020314 38257227 PMC10819588 6. Zjawiony J.K. Biologically Active Compounds from Aphyllophorales (Polypore) Fungi J. Nat. Prod. 2004 67 300 310 10.1021/np030372w 14987072 7. Petrovic N. Tosti T. Srbljak I. Đurić A. Kosanic M. Chemical Composition and Bioctivity of the Giant Polypore or Black-Staining Mushroom, Meripilus giganteus Int. J. Med. Mushrooms 2022 24 21 40 10.1615/IntJMedMushrooms.2022044119 35993959 8. Maaloul A. Portillo-Lemus L. Vitou M. Rapior S. Morel S. Fons F. Antioxidant Potential of Several Polypores Mushrooms from the South of France Int. J. Med. Mushrooms 2023 25 1 10 10.1615/IntJMedMushrooms.2023050126 37831508 9. Pirronitto S. Teng F. Verheyen C. Gaucet V. Henin J.-M. Jourez B. Schmitz S. Chandelier A. Characterization of Fomes fomentarius F. inzengae Forests 2024 15 221 10.3390/f15020221 10. Zhang F.-L. Shi C. Sun L.-T. Yang H.-X. He J. Li Z.-H. Feng T. Liu J.-K. Chemical Constituents and Their Biological Activities from the Mushroom Pyropolyporus fomentarius Phytochemistry 2021 183 112625 10.1016/j.phytochem.2020.112625 33360646 11. Morales D. Fomes fomentarius Food Biosci. 2024 61 104781 10.1016/j.fbio.2024.104781 12. Park C.-G. Lim H.-B. Evaluation of Antimutagenic and Antioxidant Properties in Fomes fomentarius Appl. Sci. 2024 14 3927 10.3390/app14093927 13. Kolundžić M. Grozdanić N.Đ. Dodevska M. Milenković M. Sisto F. Miani A. Farronato G. Kundaković T. Antibacterial and Cytotoxic Activities of Wild Mushroom Fomes fomentarius Ind. Crops Prod. 2016 79 110 115 10.1016/j.indcrop.2015.10.030 14. Evidence Based Validation of Traditional Medicines: A Comprehensive Approach Mandal S.C. Chakraborty R. Sen S. Springer Singapore 2021 978-981-15-8126-7 15. Alvandi H. Hatamian-Zarmi A. Mokhtari-Hosseini Z.B. Webster T.J. Ebrahimi Hosseinzadeh B. Selective Biological Effects of Natural Selenized Polysaccharides from Fomes fomentarius J. Drug Deliv. Sci. Technol. 2022 77 103900 10.1016/j.jddst.2022.103900 16. Karaman M. Stahl M. Vulic J. Vesic M. Canadanović-Brunet J.C. Wild-Growing Lignicolous Mushroom Species as Sources of Novel Agents with Antioxidative and Antibacterial Potentials Int. J. Food Sci. Nutr. 2013 65 1465 3478 10.3109/09637486.2013.860584 24295284 17. Mircea C. Cioanc O. Iancu C. In Vitro Antioxidant Activity of Some Extracts Obtained from Agaricus Bisporus Brown, Pleurotus Ostreatus and Fomes fomentarius FARMACIA 2015 63 927 933 18. Khadhri A. Aouadhi C. Aschi-Smiti S. Screening of Bioactive Compounds of Medicinal Mushrooms Collected on Tunisian Territory Int. J. Med. Mushrooms 2017 19 127 135 10.1615/IntJMedMushrooms.v19.i2.40 28436321 19. Nowacka N. Nowak R. Drozd M. Olech M. Los R. Malm A. Antibacterial, Antiradical Potential and Phenolic Compounds of Thirty-One Polish Mushrooms PLoS ONE 2015 10 e0140355 10.1371/journal.pone.0140355 26468946 PMC4607371 20. Kalitukha L. Sari M. Chemical Composition and Ultraviolet Absorption Activity of an Aqueous Alkali Extract from the Fruiting Bodies of the Tinder Conk Mushroom, Fomes fomentarius Int. J. Med. Mushrooms 2021 23 23 37 10.1615/IntJMedMushrooms.2021038160 33822505 21. Abugri D.A. McElhenney W.H. Extraction of Total Phenolic and Flavonoids from Edible Wild and Cultivated Medicinal Mushrooms as Affected by Different Solvents J. Nat. Prod. Plant Resour. 2013 3 37 42 22. Ferreira I. Barros L. Abreu R. Antioxidants in Wild Mushrooms Curr. Med. Chem. 2009 16 1543 1560 10.2174/092986709787909587 19355906 23. Heleno S.A. Martins A. Queiroz M.J.R.P. Ferreira I.C.F.R. Bioactivity of Phenolic Acids: Metabolites versus Parent Compounds: A Review Food Chem. 2015 173 501 513 10.1016/j.foodchem.2014.10.057 25466052 24. Nowacka-Jechalke N. Olech M. Nowak R. Mushroom Polyphenols as Chemopreventive Agents Polyphenols: Prevention and Treatment of Human Disease Elsevier Amsterdam, The Netherlands 2018 137 150 978-0-12-813008-7 25. Abdelshafy A.M. Belwal T. Liang Z. Wang L. Li D. Luo Z. Li L. A Comprehensive Review on Phenolic Compounds from Edible Mushrooms: Occurrence, Biological Activity, Application and Future Prospective Crit. Rev. Food Sci. Nutr. 2022 62 6204 6224 10.1080/10408398.2021.1898335 33729055 26. Marella A. Tanwar O.P. Saha R. Ali M.R. Srivastava S. Akhter M. Shaquiquzzaman M. Alam M.M. Quinoline: A Versatile Heterocyclic Saudi Pharm. J. 2013 21 1 12 10.1016/j.jsps.2012.03.002 23960814 PMC3744984 27. Huang T.-Z. Du D.-Y. Chen Y.-Q. Yuan B. Ju X.-Y. Feng Y.-J. Wang L. Jiang J.-H. Chemical Constituents and Antitumor Activity of Fruiting Body of Fomes fomentarius Mycosystema 2012 5 775 783 28. Lee S.-O. Lee M.-H. Lee K.-R. Lee E.-O. Lee H.-J. Fomes fomentarius Int. J. Mol. Sci. 2019 20 1147 10.3390/ijms20051147 30845749 PMC6429104 29. Kurchenko V.P. Sushinskaya N.V. Kiseleva I.S. Ermoshin A.A. Biologically Active Substances in Fruit Bodies of Wood Decomposing Fungi AIP Conf. Proc. 2022 2390 030045 10.1063/5.0069253 30. Du D. Chen C.-C. Chen X. Wang L. FENG Y. Jiang J. Analysis of Chemical Constituents of Petroleum Ether Fraction from the Fruiting Body of Fomes fomentarius Chin. J. Pharm. Anal. 2011 31 261 265 31. Dutta A. Panchali T. Khatun A. Jarapala S.R. Das K. Ghosh K. Chakrabarti S. Pradhan S. Anti-Cancer Potentiality of Linoelaidic Acid Isolated from Marine Tapra Fish Oil ( Ophisthopterus tardoore Sci. Rep. 2023 13 14125 10.1038/s41598-023-34885-3 37644076 PMC10465529 32. Prasad L. Kundu A. Bahukhandi D. Comparative Analysis of Volatile Fractions of Fomes fomentarius F. rhabarbarinus Indian Phytopathol. 2018 71 25 31 10.1007/s42360-018-0003-5 33. Devappa R.K. Rakshit S.K. Dekker R.F.H. Forest Biorefinery: Potential of Poplar Phytochemicals as Value-Added Co-Products Biotechnol. Adv. 2015 33 681 716 10.1016/j.biotechadv.2015.02.012 25733011 34. Shahruzzaman M. Hossain S. Ahmed T. Kabir S.F. Minhajul Islam M. Rahman A. Sazedul Islam M. Sultana S. Rahman M.M. Chapter 7—Biological Macromolecules as Antimicrobial Agents Biological Macromolecules Nayak A.K. Dhara A.K. Pal D. Academic Press Cambridge, MA, USA 2022 165 202 978-0-323-85759-8 35. Aro A. FATTY ACIDS| Trans Encyclopedia of Food Sciences and Nutrition 2nd ed. Caballero B. Academic Press Oxford, UK 2003 2324 2330 978-0-12-227055-0 36. Shahvaroughi Farahani A. Kurepaz-mahmoodabadi M. Manayi A. Evaluation of Cytotoxic Activity of Fomes fomentarius Adv. Pharmacol. Ther. J. 2022 1 77 85 10.18502/aptj.v1i2.8675 37. Zhang Y. Wang P. Xiao Y. Wang X. Yang S. Liu Q. Chemical Compositions and Antiproliferation Activities of the Chloroform Fraction from Pyropolyporus Fomentarius in K562 Cells Hum. Exp. Toxicol. 2015 34 732 743 10.1177/0960327114558888 25403175 38. Doğan H.H. Kars M.D. Özdemir Ö. Gündüz U. Fomes fomentarius Tricholoma anatolicum Int. J. Med. Mushrooms 2020 22 105 114 10.1615/IntJMedMushrooms.2020033174 32478999 39. Bal C. Akgul H. Sevindik M. Akata I. Yumrutas O. Determination of the Anti-Oxidative Activities of Six Mushrooms Fresenius Environ. Bull. 2017 26 6246 6252 40. Dundar A. Okumus V. Ozdemir S. Celik K.S. Boğa M. Ozcagli E. Determination of Cytotoxic, Anticholinesterase, Antioxidant and Antimicrobial Activities of Some Wild Mushroom Species Cogent Food Agric. 2016 2 1178060 10.1080/23311932.2016.1178060 41. Rašeta M. Kebert M. Pintać Šarac D. Mišković J. Berežni S. Kulmány Á.E. Zupkó I. Karaman M. Jovanović-Šanta S. Bioactive Potential of Balkan Fomes fomentarius Microorganisms 2025 13 1210 10.3390/microorganisms13061210 40572099 PMC12195499 42. Zehiroglu C. Ozturk Sarikaya S.B. The Importance of Antioxidants and Place in Today’s Scientific and Technological Studies J. Food Sci. Technol. 2019 56 4757 4774 10.1007/s13197-019-03952-x 31741500 PMC6828919 43. İrez E.İ. Doğru N.H. Demir N. Fomes fomentarius Biol. Nyssana 2021 12 55 62 10.5281/zenodo.5523017 44. Darkal A.K. Zuraik M.M. Ney Y. Nasim M.J. Jacob C. Unleashing the Biological Potential of Fomes fomentarius Antioxidants 2021 10 303 10.3390/antiox10020303 33669445 PMC7920468 45. Sveta I. Biological Activity of Fomes fomentarius J. Pharm. Pharmacol. 2022 10 294 298 10.17265/2328-2150/2022.11.003 36474900 PMC9691378 46. Alves M. Ferreira I. Dias J. Teixeira V. Martins A. Pintado M. A Review on Antimicrobial Activity of Mushroom (Basidiomycetes) Extracts and Isolated Compounds Planta Med. 2012 78 1707 1718 10.1055/s-0032-1315370 23023950 47. Slama A. Mezni F. Ayari F. Khaldi A. Antifungal Activity of Basidiomycete Carpophores Fungi Against Mycotoxigenic Species IJRASET 2022 10 1790 1793 10.22214/ijraset.2022.46472 48. Erbiai E.H. Bouchra B. da Silva L.P. Lamrani Z. Pinto E. da Silva J.C.G.E. Maouni A. Chemical Composition and Antioxidant and Antimicrobial Activities of Lactarius sanguifluus Euro-Mediterr. J. Environ. Integr. 2021 6 43 10.1007/s41207-021-00247-6 49. Ettakifi H. Abbassi K. Maouni S. Erbiai E.H. Rahmouni A. Legssyer M. Saidi R. Lamrani Z. Esteves da Silva J.C.G. Pinto E. Chemical Characterization and Antifungal Activity of Blue Tansy ( Tanacetum annuum Fusarium oxysporum Antibiotics 2023 12 1451 10.3390/antibiotics12091451 37760747 PMC10526058 50. Malençon G. Bertault R. Flore des Champignons Superieurs du Maroc: Tome I Travaux de l’Institut Scientifique Chérifien et de la Faculté des Sciences de Rabat. Série Botanique et Biologie Végétale; Institut Scientifique Chérifien Rabat, Morocco 1970 Volume 1 51. Régis C. Les Champignons de France—Guide Encyclopédique Eclectis Paris, France 1994 Volume 1 978-2-908975-19-2 52. Erbiai E.H. da Silva L.P. Saidi R. Lamrani Z. Esteves da Silva J.C.G. Maouni A. Chemical Composition, Bioactive Compounds, and Antioxidant Activity of Two Wild Edible Mushrooms Armillaria Mellea and Macrolepiota Procera from Two Countries (Morocco and Portugal) Biomolecules 2021 11 575 10.3390/biom11040575 33920034 PMC8070987 53. Erbiai E.H. Maouni A. Pinto da Silva L. Saidi R. Legssyer M. Lamrani Z. Esteves da Silva J.C.G. Antioxidant Properties, Bioactive Compounds Contents, and Chemical Characterization of Two Wild Edible Mushroom Species from Morocco: Paralepista flaccida Lepista nuda Molecules 2023 28 1123 10.3390/molecules28031123 36770790 PMC9920256 54. Heleno S.A. Barros L. Sousa M.J. Martins A. Ferreira I.C.F.R. Tocopherols Composition of Portuguese Wild Mushrooms with Antioxidant Capacity Food Chem. 2010 119 1443 1450 10.1016/j.foodchem.2009.09.025 55. CLSI Document M27–S3 CLSI Reference Method for Broth Dilution Antifungal Susceptibility Testing of Yeasts. Third Informational Supplement Clinical and Laboratory Standards Institute Wayne, PA, USA 2008 Volume 28 56. CLSI Document M27–A3 CLSI Reference Method for Broth Dilution Antifungal Susceptibility Testing of Yeasts. Approved Standard-Third Edition Clinical and Laboratory Standards Institute Wayne, PA, USA 2008 Volume 28 57. CLSI Document M38–A2 CLSI Reference Method for Broth Dilution Antifungal Susceptibility Testing of Filamentous Fungi. Approved Standard-Second Edition Clinical and Laboratory Standards Institute Wayne, PA, USA 2008 Volume 28 58. CLSI Document M07–A8 CLSI Method for Dilution Antimicrobial Susceptibility Tests of Bacteria That Grow Aerobically; Approved Standard-Eighth Edition Clinical and Laboratory Standards Institute Wayne, PA, USA 2009 Volume 29 Figure 1 GC–MS chromatogram of the biomolecules profile of F. fomentarius Figure 2 LC–MS chromatogram at 280 nm of individual polyphenols in hydromethanolic extract of F. fomentarius Figure 3 Correlogram illustrating PCC (Pearson’s correlation coefficient (r)) between main bioactive compounds (TPC, TFC, TTC, AAC, βCC, LC, and nine major individual polyphenols) and antioxidant activity (EC 50 p β β p p β Figure 4 Correlogram representing Pearson’s correlation coefficient between main bioactive compounds (TPC, TFC, TTC, AAC, βCC, LC, and nine major individual polyphenols) and antimicrobial activity (values of minimum inhibitory concentration (MIC) and minimum bactericidal/fungicidal concentration (MBC/MFC)). Positive correlations are presented in green, and negative ones in red. PCC values were mentioned in colored squares, and the color intensity is directly proportional to the correlation coefficient. * Indicate significant correlations between variables ( p E. coli S. aureus C. albicans A. fumigatus Af Af T. rubrum Tr Tr E. floccosum Ef Ef M. canis Mc Mc ijms-26-09215-t001_Table 1 Table 1 Extraction yield and bioactive compound contents of methanol extract and phenolic compounds in the dried fruiting body of F. fomentarius Bioactive Compounds Content  F. fomentarius Extraction yield (%) 7.59 ± 0.15 1 Total phenolic content (mg GAE/g dme) 75.83 ± 0.33 Total flavonoid content (mg CE/g dme) 37.62 ± 1.09 Total tannin content (mg CE/g dw) 0.95 ± 0.07 Ascorbic acid content (mg AAE/g dw) 3.43 ± 0.07 β 0.59 ± 0.00 Lycopene content (mg/g dme) 0.19 ± 0.00 1 n ijms-26-09215-t002_Table 2 Table 2 Groups of biomolecules identified in the three samples of F. fomentarius Groups of Dilution in Chloroform Derivatized with BSTFA Area (%) Number of Molecules Area (%) Number of Molecules Alcohols 1.06 5 3.27 5 Alkaloids 11.55 2 - - Alkanes 1.66 7 - - Amino acids - - 1.08 6 Fatty acids 15.80 12 14.72 11 Organic acids 3.09 2 5.36 7 Phenols 40.30 3 0.14 1 Steroids 0.31 1 3.75 3 Sugar compositions - - 64.63 24 Other groups 32.99 7 7.03 13 Total 98.65 39 99.98 70 ijms-26-09215-t003_Table 3 Table 3 Quantified phenolic compounds of F. fomentarius 1 Peak No. Rt (min) MW Recorded m z Individual Polyphenols Content (µg/g dw) 1 5.05 170.02 169.67 Gallic acid 25.42 ± 0.06 2 8.60 154.12 153.10 Protocatechuic acid 98.61 ± 0.61 3 9.90 354.31 352.78 Chlorogenic acid 150.80 ± 0.86 4 12.31 290.08 289.51 Catechin 116.90 ± 2.43 5 13.42 138.03 137.45 p 409.00 ± 2.46 6 14.35 180.04 179.01 Caffeic acid 4.96 ± 0.06 7 14.96 168.04 167.86 Vanillic acid 2.19 ± 0.06 8 - - - Syringic acid ND 9 15.78 610.15 608.78 Rutin 95.27 ± 0.25 10 16.84 302.20 303.01 Ellagic acid 5.56 ± 0.15 11 17.31 448.37 448.32 Luteolin 7-glucoside 21.85 ± 0.16 12 17.47 164.05 164.97 p 5.78 ± 0.05 13 18.17 152.05 151.07 Vanillin 15.81 ± 0.03 14 18.98 194.19 193.17 Ferulic acid 3.34 ± 0.02 15 19.30 580.18 578.18 Naringin 2.51 ± 0.03 16 20.14 432.11 432.61 Apigenin 7-glucoside 26.26 ± 0.14 17 21.92 360.08 361.03 Rosmarinic acid 17.15 ± 0.55 18 22.56 138.03 137.03 Salicylic acid 31.90 ± 0.13 19 23.13 152.05 151.94 Methyl paraben 21.46 ± 0.13 20 28.08 286.23 285.12 Luteolin 45.34 ± 0.34 21 28.96 302.04 301.35 Quercetin 99.47 ± 1.09 22 29.78 148.05 148.14 Cinnamic acid 11.02 ± 0.31 23 33.27 270.05 269.15 Apigenin 295.10 ± 0.24 24 33.71 286.05 285.25 Kaempferol 351.10 ± 0.56 25 34.19 316.27 315.26 Isorhamnetin 2734.00 ± 7.33 1 ijms-26-09215-t004_Table 4 Table 4 EC 50 F. fomentarius 1 Antioxidant Assay  F. fomentarius Trolox DPPH radical-scavenging activity 114.40 ± 2.57 Ca 19.17 ± 0.99 Bb β 174.50 ± 1.17 Ba 3.84 ± 0.70 Cb Ferric ion-reducing power 250.70 ± 1.75 Aa 80.11 ± 2.37 Ab 1 50 n p ijms-26-09215-t005_Table 5 Table 5 MIC and MBC values of F. fomentarius 1 Bacteria Strains F. fomentarius Gentamicin (mg/mL) MIC MBC MIC MBC  Escherichia coli 8.00 ± 0.00 Ab 16.00 ± 0.00 Ab 0.0020 ± 0.00 Ac >0.032  Staphylococcus aureus 4.00 ± 0.00 Bb 8.00 ± 0.00 Ba 0.0004 ± 0.00 Bd 0.016 ± 0.00 c 1 n p ijms-26-09215-t006_Table 6 Table 6 MIC and MFC values of F. fomentarius 1 Fungal Pathogen Strains F. fomentarius Voriconazole (mg/mL) Terbinafine (mg/mL) MIC MFC MIC MFC MIC MFC  Candida albicans 32.00 ± 0.00 Ab 53.33 ± 18.48 Aa 0.00038 ± 0.0 Ac >0.004 - -  Aspergillus fumigatus 26.67 ± 9.24 Ba ≥64 0.00025 ± 0.0 Bc 0.00075 ± 0.29 Bb - -  Trichophyton rubrum 2.00 ± 0.00 Db 7.00 ± 1.14 Ba 0.00013 ± 0.0 Cd 0.0015 ± 0.58 Ac 0.00001 ± 0.0 Ce 0.000129 ± 0.0 Ce  Epidermophyton floccosum 2.00 ± 0.00 Db 4.00 ± 0.00 Ca 0.00003 ± 0.0 De 0.00009 ± 0.04 Dd 0.00002 ± 0.0 Bf 0.000038 ± 0.0 Be  Microsporum canis 4.00 ± 0.00 Cb 8.00 ± 0.00 Ba 0.00013 ± 0.0 Ce 0.00038 ± 0.14 Cd 0.00012 ± 0.0 Ae 0.00075 ± 0.0 Ac 1 n p ",
  "metadata": {
    "Title of this paper": "Tocopherols Composition of Portuguese Wild Mushrooms with Antioxidant Capacity",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470752/"
  }
}