{
  "title": "Paper_269",
  "abstract": "pmc J Ovarian Res J Ovarian Res 786 jovares Journal of Ovarian Research 1757-2215 BMC PMC12487345 PMC12487345.1 12487345 12487345 41029755 10.1186/s13048-025-01804-1 1804 1 Research NRF2 promotes the migration of ovarian cancer cell lines by targeting TAGLN mediated epithelial-mesenchymal transition Wang Huan Zhang Panpan Cheng Qi Bao Lingjie blj880418@126.com https://ror.org/04rhdtb47 grid.412312.7 0000 0004 1755 1415 Department of Gynecology, Obstetrics & Gynecology Hospital of Fudan University, Shanghai Key Lab of Reproduction and Development, Shanghai Key Lab of Female Reproductive Endocrine Related Diseases, 30 9 2025 2025 18 478377 213 9 1 2025 3 9 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Objective Migration is one of the essential steps of cancer cell metastasis. Here we try to demonstrate the molecular crosstalk between NRF2-TAGLN pathway and ovarian cancer migration. Methods Western blot and Real-time PCR were used to determine the expression of NRF2 and TAGLN. Pharmacological treatment and gene intervention were employed to modulate gene expression. Wound-healing and Transwell assay were used to examine the migration ability of ovarian cancer cell lines. Dual luciferase activity and chromatin immunoprecipitation assay (CHIP) were applied to verify TAGLN as a NRF2 target gene. Results NRF2 overexpression promoted the migration of ovarian cancer cells. Our previous microarray data indicated 18 putative NRF2 target genes. Among these genes, TAGLN, binding with actin protein, has been reported to affect cytoskeletal dynamics and cell migration. A detailed analysis identified one functional antioxidant response element (ARE) in the promoter region of TAGLN, indicating TAGLN as one NRF2 target gene. Next, we explored the role of TAGLN on ovarian cancer cell migration. It showed that TAGLN overexpression promoted ovarian cancer cell migration. Conversely, knockdown of TAGLN inhibited ovarian cancer cell migration. Furthermore, transient knockdown of TAGLN using specific siRNA notably decreased cell motility in the NRF2 overexpressed ovarian cancer cells, significantly reversing the effect of NRF2 on ovarian cancer cell migration. Besides, NRF2 overexpression activated epithelial-mesenchymal transition (EMT) pathway. While, co-transfection TAGLN siRNA in NRF2 overexpressed cancer cells leaded to the upregulation of E-cadherin and the downregulation of N-cadherin, inactivating EMT pathway. Conclusions Our study shows that NRF2 and the novel target gene TAGLN, plays a critical role in ovarian cancer cell migration via modulating cell motility and EMT. Targeting NRF2-TAGLN axis may be a new strategy to overcome metastasis and improve the ovarian cancer prognosis. Clinical trial number Not applicable. Supplementary Information The online version contains supplementary material available at 10.1186/s13048-025-01804-1. Keywords Ovarian cancer Migration NRF2 TAGLN EMT the Clinical Research Foundation of Shanghai Municipal Health Commission 20214Y0218 Bao Lingjie pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Ovarian cancer has been one of the three major gynecology malignancies threatening women’s health worldwide. In the United States, a total of 19,710 new ovarian cancer cases and 13,270 deaths estimated to occur in 2023 [ 1 2 3 Our previous study mainly focused on the mechanism of cisplatin-resistance in ovarian cancer. Consistent with previously published papers, we also found that increased level of NRF2 induced the cisplatin chemoresistance of ovarian cancer [ 4 4 6 7 Furthermore, chemoresistance has been reported to be the primary contributor to cancer cell distant metastasis through inducing tumor heterogeneity and promoting cancer stemness [ 8 9 10 11 12 13 Our previous microarray data indicated 18 putative NRF2 target genes [ 7 14 16 17 18 In this study, we aim to explore whether NRF2 could transcriptionally target TAGLN and exert influence on ovarian cancer cell migration. We further demonstrate that NRF2-TAGLN axis regulates cancer cell migration via mediating EMT. It enriches the molecular mechanism of ovarian cancer cell migration and provides potential targets for the therapy. Materials and methods Ethics statements Institutional review board approval was obtained via the ethics committee of the Obstetrics and Gynecology Hospital of Fudan University(2022 − 152). Cells and plasmids Human ovarian cancer lines Hey, SKOV3ip and the human ovarian surface epithelial cell line HOSEpiC were obtained from the Shanghai Key Laboratory of Female Reproductive Endocrine Related Diseases (Shanghai, China). HEK293T cells were purchased from American Type Culture Collection (ATCC). The NRF2 plasmid ( NM_006164.5 NM_001001522 Western blot (WB) and immunofluorescence (IF) Western blot and Immunofluorescence staining were performed as previously described [ 7 19 Quantitative real-time PCR (qRT-PCR) Quantitative real-time PCR was performed as previously described [ 4 TAGLN promoter cloning One putative ARE binding site(GTGCCACAGCA), similar to the core ARE sequence (RTGABNNNGCR), was identified in the promoter region of TAGLN ༈-984 bp to + 1006 bp༉ using the pDRAW32 1.1.130 software. The human TAGLN promoter region containing the wild type potential ARE sequence was directly synthesized as following: tctatcgataggtaccgagctcttacgcgtGCTAGCATGCCCTTGCAGGGGAGTGCCACAGCAGTCAGTCCAGGGATCCCACTGTTAGTCTCACCTCTCGAGatctgcgatctaagtaagcttggcattccg. The fragments were digested with the NheI and XhoI restriction enzymes, and cloned into the pGL3-basic vector (Promega, USA). A construct containing the mutated ARE region was synthesized as following: tctatcgataggtaccgagctcttacgcgtGCTAGCATGCCCTTGCAGGGGACACGGTGTCGTGTCAGTCCAGGGATCCCACTGTTAGTCTCACCTCTCGAGatctgcgatctaagtaagcttggcattccg. Each plasmid was verified by sequencing Keygene biotechnology (Jiangsu, China). Dual luciferase assay The dual luciferase assay was performed using Dual-Glo ® 20 ® ® ® Small interfering RNA transfection Human NRF2 siRNA (sequence: GGAUUAUUAUGACUGUUAAAU), Human TAGLN specific siRNA (GGACAGUCAGAUUCUUUCAGA) and nonspecific control siRNA were purchased from Keygene biotechnology (Jiangsu, China). Lipofectamine 3000 was used for all siRNA transfections according to the manufacturer’s protocol. Chromatin immunoprecipitation assay (CHIP) CHIP assay was performed as previously reported [ 7 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:[\\varDelta\\:\\text{C}\\text{t}(\\text{n}\\text{o}\\text{r}\\text{m}\\text{a}\\text{l}\\text{i}\\text{z}\\text{e}\\text{d}\\:\\text{C}\\text{H}\\text{I}\\text{P})-{\\Delta\\:}\\text{C}\\text{t}(\\text{I}\\text{g}\\text{G})$$\\end{document} Wound-healing assay Cells were cultured in 12-well plate to complete confluence. Straight wounds were made by 200 µl pipette tips. After exfoliated cells removed, the adherent cells were treated with pharmaceuticals or siRNA transfection and negative controls for hours. The wounds were photographed at 0, 12 h and 48 h. Assays were conducted triplicate and three independent times. Cell migration assay Cell migration assays were performed in the 24-well plate with chamber inserts (Corning) as reported in literature [ 21 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:\\times\\:10$$\\end{document} 4 Statistical analysis Data were presented as the Mean ± Standard deviation. A two-tailed student’s t-test was used to evaluate the significance between two groups using the SPSS 27.0 software. An ANOVA (Analysis of Variance) test was performed to determine the differences among three or more groups. The Least Significant Difference was used as the post-hoc test to identify the significant difference. P Results NRF2 promotes the migration of ovarian cancer cell lines Western Blot examined the expression of NRF2 in six ovarian cancer cell lines and one human derived ovarian epithelial cell line. The results showed that the ovarian cancer cells all expressed higher NRF2 level than the human ovarian epithelial cell. Among them, Hey expressed the highest level of NRF2 than other ovarian cancer cell lines. SKOV3ip expressed secondly to Hey (Fig. 1 1  Fig. 1 NRF2 promotes the migration of ovarian cancer cell lines. ( A B C TAGLN could be transcriptionally regulated by NRF2 From our previous microarray data, 18 putative NRF2 target genes were identified [ 7 2  Fig. 2 TAGLN functions as one target gene of NRF2. ( A B C D P To explore whether NRF2 transcriptionally targets TAGLN, one potential ARE sequence (GTGCCACAGCA) in the TAGLN promoter in the − 984 bp to + 1006 bp region upstream of the transcription start site (TSS) was identified. A firefly luciferase reporter construct containing the promoter region was cloned. The cloned TAGLN luciferase plasmid and TK-Renilla-luciferase plasmid were co-transfected along with either NRF2 plasmid or an empty control vector into HEK293T cells for 24 h. Relative luciferase activity was calculated as instructed by the manufacturer. As shown in Fig. 2 P 2 P P To confirm that NRF2 binds to the putative ARE of the TAGLN promoter, a CHIP assay was performed in Hey cells. As shown in Fig. 2 P 2 Taken together, the results showed that TAGLN could be transcriptionally regulated by NRF2. TAGLN exerts effects on ovarian cancer cell migration To determine the role of TAGLN in ovarian cancer cells migration, we firstly upregulate TAGLN with plasmid transfection in Hey and SKOV3ip cells. Wound-healing assay and transwell-assay indicated that TAGLN overexpression promoted the migration of ovarian cancer cells. On the contrary, silencing TAGLN with specific siRNA could inhibit the migration of ovarian cancer cells. These results indicated that TAGLN promotes ovarian cancer cell migration (Fig. 3  Fig. 3 TAGLN promotes the migration of ovarian cancer cell lines. ( A B \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:\\text{m}\\text{a}\\text{g}\\text{n}\\text{i}\\text{f}\\text{i}\\text{c}\\text{a}\\text{t}\\text{i}\\text{o}\\text{n}\\:\\times\\:200$$\\end{document} P The effect of NRF2 on ovarian cancer cell line migration could be reversed by TAGLN To determine whether TAGLN is the essential downstream regulator of NRF2-dependent migration on ovarian cancer cells, rescue and function assay was performed. Both wound-healing assay and transwell assay showed that NRF2 overexpression promoted the migration of ovarian cancer cells. However, such effects could be reversed by silencing TAGLN with siRNA (Fig. 4  Fig. 4 TAGLN could reverse the effect of NRF2 on ovarian cancer cell lines migration by regulating the EMT. ( A B C D \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:\\times\\:200)$$\\end{document} P Discussion Metastasis is one of the major challenges for ovarian cancer treatment. Migration is one of the essential steps of cancer cell metastasis. Understanding the molecular mechanisms and exploring potential targets is a promising strategy for this disease. NRF2, an essential antioxidant transcription factor, not only contributes to the chemoresistance in a variety of cancers, but also plays a role in the metastasis of cancers. NRF2 exerts its biological effects through directly targeting hundreds of downstream genes which contains functional ARE in the promoter. For example, overexpression of NRF2 and HO-1 correlates with the lymph node metastasis and distant metastasis of esophageal squamous cell carcinoma [ 22 23 24 11 1 TAGLN encoding gene locates to chromosome 11q23.2 14 25 26 27 28 29 30 31 32 33 4 2 3 However, this study has its limitations. Firstly, experiments in this study were performed in vitro, absent of in vivo experiments and with clinical sample validation, which weakens the translational value of the study. Secondly, we focused on migration of ovarian cancer cell lines. To fully demonstrate the molecular mechanism of ovarian cancer metastasis, invasion of ovarian cancer cells should also be explored in future study. Thirdly, downstream molecular mechanisms of TAGLN-mediated EMT regulation appears to be a relatively one-sided mechanistic interpretation. The TAGLN expression profiles in ovarian cancer tissues and other additional key EMT markers, such as Vimentin and Snail/Slug, should also be analysized in further research. Conclusions TAGLN was identified as one novel NRF2 target gene. We found that NRF2-TAGLN could promote the migration of ovarian cancer cell through regulation of EMT pathway. The current data indicates that targeting TAGLN may be a promising approach to inhibit the ovarian cancer metastasis. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1  Supplementary Material 2  Supplementary Material 3 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements No. Author contributions Lingjie Bao designed the project and edited manuscript. Huan Wang and Panpan Zhang conducted the project and wrote the manuscript. Qi Chen performed the data statistics. Funding This project was supported by the Clinical Research Foundation of Shanghai Municipal Health Commission(20214Y0218). It was also founded by the Shanghai Clinical Research Center for Gynecological Diseases (22MC1940200) Data availability Data and materials of this study were available from the first author upon reasonable request. Declarations Ethics approval Not applicable. Consent to publication Not applicable. Competing interests The authors declare no competing interests. Abbreviations CHIP Chromatin immunoprecipitation assay EMT Epithelial-mesenchymal transition ABCF2 ATP binding cassette transporters family F member 2 NSCLC Non-small cell lung cancer cell MMP Matrix metalloproteinase SM22 Smooth muscle protein 22 IF Immunofluorescence tBHQ Tertiary butylhydroquinone SF Sulforaphane References 1. Siegel RL Miller KD Wagle NS Jemal A Cancer statistics, 2023 CA Cancer J Clin 2023 73 17 48 36633525 10.3322/caac.21763 Siegel RL, Miller KD, Wagle NS, Jemal A. Cancer statistics, 2023. CA Cancer J Clin. 2023;73:17–48. 36633525 10.3322/caac.21763 2. Han B Zheng R Zeng H Cancer incidence and mortality in china, 2022 J Natl Cancer Cent 2024 4 47 53 39036382 10.1016/j.jncc.2024.01.006 PMC11256708 Han B, Zheng R, Zeng H, et al. Cancer incidence and mortality in china, 2022. J Natl Cancer Cent. 2024;4:47–53. 39036382 10.1016/j.jncc.2024.01.006 PMC11256708 3. Thull T Kempton D Ovarian cancer: a review for primary care providers JAAPA 2024 37 32 6 10.1097/01.JAA.0000000000000042 38916368 Thull T, Kempton D. Ovarian cancer: a review for primary care providers. JAAPA. 2024;37:32–6. 38916368 10.1097/01.JAA.0000000000000042 4. Bao LJ Jaramillo MC Zhang ZB Nrf2 induces cisplatin resistance through activation of autophagy in ovarian carcinoma Int J Clin Exp Pathol 2014 7 1502 13 24817946 PMC4014230 Bao LJ, Jaramillo MC, Zhang ZB, et al. Nrf2 induces cisplatin resistance through activation of autophagy in ovarian carcinoma. Int J Clin Exp Pathol. 2014;7:1502–13. 24817946 PMC4014230 5. Wu J Bao L Zhang Z Yi X Nrf2 induces cisplatin resistance via suppressing the iron export related gene slc40a1 in ovarian cancer cells Oncotarget 2017 8 93502 15 10.18632/oncotarget.19548 29212168 PMC5706814 Wu J, Bao L, Zhang Z, Yi X. Nrf2 induces cisplatin resistance via suppressing the iron export related gene slc40a1 in ovarian cancer cells. Oncotarget. 2017;8:93502–15. 29212168 10.18632/oncotarget.19548 PMC5706814 6. Cheng Q Bao L Li M Erastin synergizes with cisplatin via ferroptosis to inhibit ovarian cancer growth in vitro and in vivo J Obstet Gynaecol Res 2021 47 2481 91 10.1111/jog.14779 33882617 Cheng Q, Bao L, Li M, et al. Erastin synergizes with cisplatin via ferroptosis to inhibit ovarian cancer growth in vitro and in vivo. J Obstet Gynaecol Res. 2021;47:2481–91. 33882617 10.1111/jog.14779 7. B L W J D M Abcf2, an nrf2 target gene, contributes to cisplatin resistance in ovarian cancer cells Mol Carcinog 2017 56 1543 53 10.1002/mc.22615 28112439 PMC5509336 B L, W J, D M, et al. Abcf2, an nrf2 target gene, contributes to cisplatin resistance in ovarian cancer cells. Mol Carcinog. 2017;56:1543–53. 28112439 10.1002/mc.22615 PMC5509336 8. Cao Y Lu C Beeraka NM Exploring the relationship between anastasis and mitochondrial ros-mediated ferroptosis in metastatic chemoresistant cancers: a call for investigation Front Immunol 2024 15 1428920 10.3389/fimmu.2024.1428920 39015566 PMC11249567 Cao Y, Lu C, Beeraka NM, et al. Exploring the relationship between anastasis and mitochondrial ros-mediated ferroptosis in metastatic chemoresistant cancers: a call for investigation. Front Immunol. 2024;15:1428920. 39015566 10.3389/fimmu.2024.1428920 PMC11249567 9. Wang H Liu X Long M Nrf2 activation by antioxidant antidiabetic agents accelerates tumor metastasis Sci Transl Med 2016 8 334ra51 27075625 10.1126/scitranslmed.aad6095 Wang H, Liu X, Long M, et al. Nrf2 activation by antioxidant antidiabetic agents accelerates tumor metastasis. Sci Transl Med. 2016;8:334ra51. 27075625 10.1126/scitranslmed.aad6095 10. Zhao Q Mao A Guo R Suppression of radiation-induced migration of non-small cell lung cancer through Inhibition of nrf2-notch axis Oncotarget 2017 8 36603 13 10.18632/oncotarget.16622 28402268 PMC5482680 Zhao Q, Mao A, Guo R, et al. Suppression of radiation-induced migration of non-small cell lung cancer through Inhibition of nrf2-notch axis. Oncotarget. 2017;8:36603–13. 28402268 10.18632/oncotarget.16622 PMC5482680 11. Man S Bi J Liu F Vitamin c inhibited pulmonary metastasis through activating nrf2/ho-1 pathway Mol Nutr Food Res 2024 68 e2300706 10.1002/mnfr.202300706 38419398 Man S, Bi J, Liu F, et al. Vitamin c inhibited pulmonary metastasis through activating nrf2/ho-1 pathway. Mol Nutr Food Res. 2024;68:e2300706. 38419398 10.1002/mnfr.202300706 12. Chien MH Lee WJ Hsieh FK Keap1-nrf2 interaction suppresses cell motility in lung adenocarcinomas by targeting the s100p protein Clin Cancer Res 2015 21 4719 32 10.1158/1078-0432.CCR-14-2880 26078391 Chien MH, Lee WJ, Hsieh FK, et al. Keap1-nrf2 interaction suppresses cell motility in lung adenocarcinomas by targeting the s100p protein. Clin Cancer Res. 2015;21:4719–32. 26078391 10.1158/1078-0432.CCR-14-2880 13. Ji J Lv J Lv M Usp14 regulates Heme metabolism and ovarian cancer invasion through bach1 deubiquitination and stabilization Biochem Biophys Res Commun 2023 667 186 93 10.1016/j.bbrc.2023.04.082 37229827 Ji J, Lv J, Lv M, et al. Usp14 regulates Heme metabolism and ovarian cancer invasion through bach1 deubiquitination and stabilization. Biochem Biophys Res Commun. 2023;667:186–93. 37229827 10.1016/j.bbrc.2023.04.082 14. Li M Li S Lou Z Crystal structure of human Transgelin J Struct Biol 2008 162 229 36 10.1016/j.jsb.2008.01.005 18291675 Li M, Li S, Lou Z, et al. Crystal structure of human Transgelin. J Struct Biol. 2008;162:229–36. 18291675 10.1016/j.jsb.2008.01.005 15. Shapland C Lowings P Lawson D Identification of new actin-associated polypeptides that are modified by viral transformation and changes in cell shape J Cell Biol 1988 107 153 61 10.1083/jcb.107.1.153 2839517 PMC2115168 Shapland C, Lowings P, Lawson D. Identification of new actin-associated polypeptides that are modified by viral transformation and changes in cell shape. J Cell Biol. 1988;107:153–61. 2839517 10.1083/jcb.107.1.153 PMC2115168 16. Zhou L Zhang R Zhang L Upregulation of Transgelin is an independent factor predictive of poor prognosis in patients with advanced pancreatic cancer Cancer Sci 2013 104 423 30 10.1111/cas.12107 23331552 PMC7657166 Zhou L, Zhang R, Zhang L, et al. Upregulation of Transgelin is an independent factor predictive of poor prognosis in patients with advanced pancreatic cancer. Cancer Sci. 2013;104:423–30. 23331552 10.1111/cas.12107 PMC7657166 17. Sun C Zhang K Ni C Transgelin promotes lung cancer progression via activation of cancer-associated fibroblasts with enhanced il-6 release Oncogenesis 2023 12 18 10.1038/s41389-023-00463-5 36990991 PMC10060230 Sun C, Zhang K, Ni C, et al. Transgelin promotes lung cancer progression via activation of cancer-associated fibroblasts with enhanced il-6 release. Oncogenesis. 2023;12:18. 36990991 10.1038/s41389-023-00463-5 PMC10060230 18. Wei X Lou H Zhou D Tagln mediated stiffness-regulated ovarian cancer progression via rhoa/rock pathway J Exp Clin Cancer Res 2021 40 292 10.1186/s13046-021-02091-6 34538264 PMC8451140 Wei X, Lou H, Zhou D, et al. Tagln mediated stiffness-regulated ovarian cancer progression via rhoa/rock pathway. J Exp Clin Cancer Res. 2021;40:292. 34538264 10.1186/s13046-021-02091-6 PMC8451140 19. Bao L Jaramillo MC Zhang Z Induction of autophagy contributes to cisplatin resistance in human ovarian cancer cells Mol Med Rep 2015 11 91 8 10.3892/mmr.2014.2671 25322694 PMC4237096 Bao L, Jaramillo MC, Zhang Z, et al. Induction of autophagy contributes to cisplatin resistance in human ovarian cancer cells. Mol Med Rep. 2015;11:91–8. 25322694 10.3892/mmr.2014.2671 PMC4237096 20. Shen W Lyu Q Yi R Hmgb1 promotes chemoresistance in small cell lung cancer by inducing parp1-related nucleophagy J Adv Res 2024 66 165 80 10.1016/j.jare.2023.12.020 38159843 PMC11674788 Shen W, Lyu Q, Yi R, et al. Hmgb1 promotes chemoresistance in small cell lung cancer by inducing parp1-related nucleophagy. J Adv Res. 2024;66:165–80. 38159843 10.1016/j.jare.2023.12.020 PMC11674788 21. Cui Y, Liu J, Wang X et al. Baicalin attenuates the immune escape of oral squamous cell carcinoma by reducing lactate accumulation in tumor microenvironment. J Adv Res 2025. Online ahead of print. 10.1016/j.jare.2025.01.021 39814222 22. Gao Y Wan L Li M Nrf2/ho-1 axis, birc5, and tp53 expression in Escc and its correlation with clinical pathological characteristics and prognosis Int J Biol Markers 2023 38 174 84 10.1177/03936155231176571 37312528 Gao Y, Wan L, Li M, et al. Nrf2/ho-1 axis, birc5, and tp53 expression in Escc and its correlation with clinical pathological characteristics and prognosis. Int J Biol Markers. 2023;38:174–84. 37312528 10.1177/03936155231176571 23. Luo M, Shen N, Shang L et al. Simultaneous targeting of nqo1 and sod1 eradicates breast cancer stem cells via mitochondrial futile redox cycling. Cancer Res 2024;84:4264–82. 10.1158/0008-5472.CAN-24-0800 PMC11647209 39264695 24. Lizardo MM Hughes C Huang YZ Pharmacologic Inhibition of eif4a blocks nrf2 synthesis to prevent osteosarcoma metastasis Clin Cancer Res 2024 30 4464 81 10.1158/1078-0432.CCR-24-1317 39078310 PMC11443218 Lizardo MM, Hughes C, Huang YZ, et al. Pharmacologic Inhibition of eif4a blocks nrf2 synthesis to prevent osteosarcoma metastasis. Clin Cancer Res. 2024;30:4464–81. 39078310 10.1158/1078-0432.CCR-24-1317 PMC11443218 25. Dvorakova M Nenutil R Bouchal P Transgelins, cytoskeletal proteins implicated in different aspects of cancer development Expert Rev Proteom 2014 11 149 65 10.1586/14789450.2014.860358 24476357 Dvorakova M, Nenutil R, Bouchal P. Transgelins, cytoskeletal proteins implicated in different aspects of cancer development. Expert Rev Proteom. 2014;11:149–65. 10.1586/14789450.2014.860358 24476357 26. Li Q Shi R Wang Y Niu X Tagln suppresses proliferation and invasion, and induces apoptosis of colorectal carcinoma cells Tumour Biol 2013 34 505 13 10.1007/s13277-012-0575-0 23138394 Li Q, Shi R, Wang Y, Niu X. Tagln suppresses proliferation and invasion, and induces apoptosis of colorectal carcinoma cells. Tumour Biol. 2013;34:505–13. 23138394 10.1007/s13277-012-0575-0 27. Zhou HM Fang YY Weinberger PM Transgelin increases metastatic potential of colorectal cancer cells in vivo and alters expression of genes involved in cell motility BMC Cancer 2016 16 55 10.1186/s12885-016-2105-8 26847345 PMC4741053 Zhou HM, Fang YY, Weinberger PM, et al. Transgelin increases metastatic potential of colorectal cancer cells in vivo and alters expression of genes involved in cell motility. BMC Cancer. 2016;16:55. 26847345 10.1186/s12885-016-2105-8 PMC4741053 28. Elsafadi M Manikandan M Almalki S Transgelin is a poor prognostic factor associated with advanced colorectal cancer (crc) stage promoting tumor growth and migration in a tgfβ-dependent manner Cell Death Dis 2020 11 341 10.1038/s41419-020-2529-6 32393769 PMC7214449 Elsafadi M, Manikandan M, Almalki S, et al. Transgelin is a poor prognostic factor associated with advanced colorectal cancer (crc) stage promoting tumor growth and migration in a tgfβ-dependent manner. Cell Death Dis. 2020;11:341. 32393769 10.1038/s41419-020-2529-6 PMC7214449 29. Fu J Wang X Yue Q Functional loss of Tagln inhibits tumor growth and increases chemosensitivity of non-small cell lung cancer Biochem Biophys Res Commun 2020 529 1086 93 10.1016/j.bbrc.2020.06.066 32819569 Fu J, Wang X, Yue Q. Functional loss of Tagln inhibits tumor growth and increases chemosensitivity of non-small cell lung cancer. Biochem Biophys Res Commun. 2020;529:1086–93. 32819569 10.1016/j.bbrc.2020.06.066 30. Rawal N, Hariprasad G, Bandyopadhyay S et al. Molecular biomarkers involved in the progression of gallbladder inflammatory lesions to invasive cancer: a proteomic approach. Biomol Biomed 2024;25:115–43. 10.17305/bb.2024.10704 PMC11647257 39284282 31. Aikins AR, Kim M, Raymundo B, Kim CW. Downregulation of Transgelin blocks interleukin-8 utilization and suppresses vasculogenic mimicry in breast cancer cells. Exp Biol Med (Maywood). 2017;242:573–83. 10.1177/1535370216685435 PMC5685257 28058861 32. Sarubo M Mouri Y Moromizato A Involvement of tgfbi-tagln axis in cancer stem cell property of head and neck squamous cell carcinoma Sci Rep 2024 14 6767 10.1038/s41598-024-57478-0 38514830 PMC10957997 Sarubo M, Mouri Y, Moromizato A, et al. Involvement of tgfbi-tagln axis in cancer stem cell property of head and neck squamous cell carcinoma. Sci Rep. 2024;14:6767. 38514830 10.1038/s41598-024-57478-0 PMC10957997 33. Meagher NS Gorringe KL Wakefield M Gene-expression profiling of mucinous ovarian tumors and comparison with upper and lower Gastrointestinal tumors identifies markers associated with adverse outcomes Clin Cancer Res 2022 28 5383 95 10.1158/1078-0432.CCR-22-1206 36222710 PMC9751776 Meagher NS, Gorringe KL, Wakefield M, et al. Gene-expression profiling of mucinous ovarian tumors and comparison with upper and lower Gastrointestinal tumors identifies markers associated with adverse outcomes. Clin Cancer Res. 2022;28:5383–95. 36222710 10.1158/1078-0432.CCR-22-1206 PMC9751776 ",
  "metadata": {
    "Title of this paper": "Gene-expression profiling of mucinous ovarian tumors and comparison with upper and lower Gastrointestinal tumors identifies markers associated with adverse outcomes",
    "Journal it was published in:": "Journal of Ovarian Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487345/"
  }
}