{
  "title": "Paper_1081",
  "abstract": "pmc J Clin Med J Clin Med 2745 jclinmed jcm Journal of Clinical Medicine 2077-0383 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470937 PMC12470937.1 12470937 12470937 41010553 10.3390/jcm14186348 jcm-14-06348 1 Review Beyond the Cardio–Renal–Metabolic Axis: Emerging Therapeutic Targets and Novel Mechanisms of Action of Flozins https://orcid.org/0000-0001-8279-0373 Matuszewski Wojciech 1 * Tomaszek Lena 2 Szklarz Michał 1 https://orcid.org/0009-0004-8167-6658 Górny Jan Marek 1 https://orcid.org/0000-0002-7590-5790 Kordas Bernard 3 Rutkowska Joanna 1 https://orcid.org/0000-0001-8665-6606 Juranek Judyta 3 Tomlinson Brian Academic Editor 1 michszklarz@gmail.com jangorny245@gmail.com rutkowskaj14@gmail.com 2 tomaszek.lena@gmail.com 3 kordas.ber@gmail.com judytajuranek@gmail.com * wmatuszewski82@wp.pl 09 9 2025 9 2025 14 18 497642 6348 27 7 2025 03 9 2025 04 9 2025 09 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Contemporary diabetes management is progressively moving away from a glucocentric approach, with growing expectations that novel antidiabetic agents offer benefits beyond glycaemic control. Sodium–glucose cotransporter 2 inhibitors (SGLT2i) have emerged as a cornerstone in the treatment of type 2 diabetes mellitus (T2DM). In addition to reducing blood glucose levels by promoting renal glucose excretion, these agents contribute significantly to cardio–renal–metabolic protection and are associated with improved cardiovascular outcomes and prolonged survival. Although SGLT2 inhibitors do not exhibit a class effect in all clinical aspects, growing evidence suggests their potential in a variety of additional therapeutic areas. We conducted an in-depth review of current scientific literature and clinical studies regarding this class of drugs. SGLT2 inhibitors demonstrate neuroprotective properties and may provide benefits in neurodegenerative disorders such as Alzheimer’s and Parkinson’s disease, potentially through the improvement of mitochondrial function and attenuation of inflammatory responses. Their anti-inflammatory and antioxidative effects are closely linked to reductions in cardiac and renal fibrosis. Other observed benefits include weight loss, improved insulin sensitivity, normalization of serum uric acid, and a reduction in hepatic steatosis—each with important metabolic implications. Furthermore, SGLT2 inhibitors have been shown to positively influence iron metabolism and improve erythrocyte indices. Emerging data also indicate beneficial effects in women with polycystic ovary syndrome. Another promising area of investigation involves the modulation of Klotho protein expression and support of vascular homeostasis. In oncology, SGLT2 inhibitors are gaining attention, with encouraging preclinical results observed in malignancies such as pancreatic, thyroid, breast, and lung cancers. Based on a comprehensive evaluation of the existing body of evidence, it is anticipated that the clinical indications for SGLT2 inhibitors will expand beyond the cardio–renal–metabolic axis in the near future. SGLT2 inhibitors diabetes mellitus pleiotropy metabolism This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Sodium-glucose co-transporter 2 inhibitors (SGLT2i) represent a pharmacological class primarily used in the management of type 2 diabetes mellitus (T2DM). The introduction of SGLT2 inhibitors into clinical practice in 2012 marked a major milestone in diabetes therapy. Dapagliflozin was the first SGLT2 inhibitor to be approved for use, followed by other notable drugs such as canagliflozin, empagliflozin, and ertugliflozin, all of which received approval from the European Medicines Agency (EMA) [ 1 2 3 4 5 6 7 2. Materials and Methods The study presents an analysis of current literature data on the use of SGLT2 inhibitors, with particular emphasis on their pleiotropic effects. It also discusses newly identified mechanisms of action and potential future therapeutic targets for this drug class. A Generative AI tool (ChatGPT, OpenAI) was used to assist with translation of technical content, organization of text, and formatting of citations. All scientific content was verified and edited by the authors to ensure accuracy and integrity. 3. Results and Discussion 3.1. Mechanism of Action and Therapeutic Effects of SGLT-2i Glucose is primarily reabsorbed and filtered in the kidneys through two cotransporters: sodium-glucose cotransporter type 1 (SGLT1) and sodium-glucose cotransporter type 2 (SGLT2). In healthy, normoglycemic adults with a glomerular filtration rate (GFR) of 125 mL/min/1.73 m 2 8 9 10 8 11 12 13 14 15 13 16 17 18 19 20 21 22 Figure 1 3.2. Pleiotropic Effects of SGLT-2i 3.2.1. Neuroprotection Alzheimer’s disease (AD) and Parkinson’s disease (PD) are the two most common neurodegenerative disorders, affecting 39.9 million and 6.2 million people worldwide, respectively. It is estimated that by 2050, the number of people with AD will increase threefold, and by 2040, the number of individuals with PD will rise 2.5 times [ 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 45 41 46 3.2.2. Decreasing the Risk of Developing Type 2 Diabetes Prediabetes is an intermediate stage of carbohydrate metabolism disruption between normal fasting glucose levels and glucose tolerance and full-blown diabetes. It can be classified into impaired fasting glucose (IFG) and impaired glucose tolerance (IGT). Among individuals with prediabetes, 5–10% will progress to type 2 diabetes. At the prediabetes stage, typical microvascular changes associated with diabetes may already occur. Currently, both the Polish Diabetes Society and the American Diabetes Association recommend the use of metformin alongside lifestyle modifications for individuals with prediabetes, particularly those with impaired fasting glucose and impaired glucose tolerance, a body mass index (BMI) of ≥35 kg/m 2 47 Figure 2 A 2022 meta-analysis demonstrated that the use of SGLT2 inhibitors is associated with a reduced risk of developing type 2 diabetes in individuals with prediabetes, coronary artery disease, and chronic kidney disease [ 48 49 50 51 52 53 3.2.3. Managing MASLD The pathogenesis of MASLD involves hepatic steatosis, inflammation, and fibrosis, often associated with insulin resistance and metabolic syndrome. Metabolic dysfunction-associated steatotic liver disease (MASLD) is commonly associated with type 2 diabetes. According to a meta-analysis published in 2019, approximately 55.5% of individuals with type 2 diabetes worldwide suffer from MASLD [ 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 65 3.2.4. Reducing Uric Acid Uric acid is the poorly soluble end product of purine metabolism in humans [ 74 75 76 77 78 79 80 81 82 83 84 85 85 86 87 88 3.2.5. SGLT2 Inhibitors and Anemia It has also been observed that SGLT2 inhibitors influence the state of red blood cell parameters. Initially, during treatment with SGLT2 inhibitors, an increase in hematocrit and hemoglobin levels is noted, which may be associated with hemoconcentration due to natriuresis and plasma volume contraction, both linked to their mechanism of action [ 89 90 91 92 93 94 89 p 95 92 96 97 3.2.6. Reducing Inflammation Chronic low-grade inflammation plays a significant role in the pathogenesis of most diseases, especially metabolic disorders. Some of the anti-inflammatory mechanisms of action of SGLT2 inhibitors have already been discussed in this study. These agents act on multiple levels in the progression of inflammation and have shown anti-inflammatory benefits in both diabetic and non-diabetic conditions [ 98 99 100 101 102 103 104 105 106 107 108 109 108 110 111 112 113 114 115 In summary, multiple studies have confirmed that this multi-pathway modulation by SGLT2 inhibitors results in decreased production of key inflammatory mediators, including TNF-α, IL-1β, IL-6, and IFN-γ, as well as various pro-inflammatory chemokines. 3.2.7. Restoring Circadian Metabolic Rhythms and Enhancing Catabolic Processes in Type 2 Diabetes SGLT2 inhibitors promoted a catabolic metabolic shift via sustained overnight glucosuria, altering fuel utilization and enhancing autophagy. By increasing the glucagon-to-insulin ratio, they depleted hepatic glycogen and activated gluconeogenesis, primarily using circulating amino acids. This was accompanied by a fuel switch from glucose to free fatty acids and a shift in mitochondrial morphology from fission to fusion. As amino acids and insulin levels declined, mTORC1 was inhibited, promoting the clearance of dysfunctional organelles. Upon resumption of feeding, anabolic pathways were reactivated, facilitating organelle and protein regeneration. This restoration of diurnal metabolic rhythms may extend benefits beyond glycemic control, with potential therapeutic implications in non-diabetic diseases [ 116 3.2.8. SGLT2 Inhibitors and PCOS Polycystic ovary syndrome (PCOS) is an endocrine disorder affecting 4% to 20% of the worldwide population [ 117 118 119 120 119 120 121 122 118 119 120 118 119 120 122 123 124 125 126 126 127 Table 1 The table summarizes selected experimental, meta-analytical, and clinical trial data investigating the effects of SGLT2 inhibitors in the management of PCOS, with a focus on metabolic, hormonal, and anthropometric outcomes. 3.2.9. Klotho Protein and Its Modulation by SGLT2 Inhibitors Klotho is a membrane-bound and soluble protein primarily expressed in the distal renal tubules, known for its anti-aging, antioxidative, and anti-fibrotic properties. It regulates phosphate and calcium homeostasis, inhibits insulin/IGF-1 signaling, and reduces inflammation and oxidative stress—key contributors to the pathogenesis of diabetic kidney disease (DKD) and cardiovascular dysfunction [ 129 130 129 131 129 131 132 130 133 134 132 135 136 137 3.2.10. Potential Role of SGLT2 Inhibitors in Oncology Initially developed for type 2 diabetes, SGLT2 inhibitors (SGLT2i) have shown promising anticancer activity through inhibition of tumor metabolism, induction of apoptosis, immune modulation, and disruption of oncogenic signaling. Disrupting Tumor Glucose Metabolism and Cell Growth Overexpression of SGLT2 in cancers such as pancreatic, thyroid, colorectal, and NSCLC makes it a viable therapeutic target. SGLT2i (e.g., canagliflozin) reduces glucose uptake and activates AMPK, thereby suppressing AKT/mTOR signaling, leading to cell cycle arrest and apoptosis in thyroid cancer cells [ 138 139 140 141 Antitumor Activity in Animal Models Animal studies demonstrate broad antitumor efficacy across models of NSCLC, glioblastoma, osteosarcoma, and others [ 142 143 + + 143 144 Modulation of Immune Responses and Tumor Microenvironment SGLT2i can augment immune responses by promoting PD-L1 degradation in NSCLC and ovarian cancer cells, enhancing cytotoxic T cell activity [ 145 144 Emerging Clinical Evidence Preliminary clinical findings are encouraging. A Taiwanese cohort study showed reduced cancer-specific and all-cause mortality in diabetic cancer patients using SGLT2i [ 146 147 148 Molecular Mechanisms and Therapeutic Perspectives SGLT2i targets cancer metabolism by inhibiting glycolysis, disrupting mitochondrial function, and modulating key pathways such as AMPK/mTOR, Hippo/YAP, and STING/IRF3, leading to apoptosis and enhanced immune activity [ 138 139 144 149 3.2.11. Emerging Role of SGLT2 Inhibitors in Atrial Fibrillation Prevention Atrial fibrillation (AF) is a common arrhythmia associated with significant morbidity and mortality, particularly in patients with metabolic and cardiovascular diseases—populations frequently treated with SGLT2 inhibitors. Emerging evidence suggests that beyond their established benefits in heart failure and diabetes, SGLT2 inhibitors may reduce the incidence of AF. This effect is likely mediated through their anti-inflammatory, antifibrotic, and metabolic actions, which improve cardiac structure and function. Recent clinical studies indicate a lower risk of new-onset AF among patients receiving SGLT2 inhibitors compared to other glucose-lowering therapies [ 150 151 152 153 Table 2 4. Conclusions SGLT2 inhibitors have evolved from glucose-lowering agents into multifunctional drugs with wide-ranging effects on metabolic and systemic diseases. Their pleiotropic actions—including neuroprotection by reducing oxidative stress and inflammation, anti-inflammatory effects, organ protection, improvements in liver health, anemia correction, and uric acid reduction—highlight their expanding therapeutic potential beyond diabetes. Moreover, emerging evidence suggests benefits in restoring circadian metabolic rhythms and managing endocrine disorders such as polycystic ovary syndrome. Despite promising preclinical data and early clinical findings, much remains to be established regarding the clinical translation of these effects. Future research should focus on large-scale, long-term clinical trials to assess safety, optimal dosing, and efficacy, particularly in non-diabetic populations and patients with comorbidities. Understanding the mechanisms underlying these diverse actions will be crucial to optimizing therapeutic use and tailoring treatment to specific patient groups. Priority areas include investigating neurodegenerative diseases, chronic kidney and liver conditions, reproductive endocrinology, and oncology, where early results are encouraging but preliminary. Bridging the translational gap requires integrating mechanistic insights with clinical evidence, alongside real-world studies to guide precision medicine approaches. Overall, ongoing and future research will be essential to fully harness the broad therapeutic benefits of SGLT2 inhibitors, extending their impact far beyond glycemic control. Acknowledgments We thank the anonymous referees for their useful suggestions. This work utilized ChatGPT, a large language model-based assistant, for language translation, text structuring, and citation formatting support. The authors retained full responsibility for all final content. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, W.M., L.T. and J.J.; methodology, W.M.; software, J.M.G.; validation, W.M., L.T. and J.J.; formal analysis, J.R.; investigation, W.M. and J.R.; resources, M.S., J.M.G. and L.T.; data curation, W.M. and J.M.G.; writing—original draft preparation, W.M., L.T., J.R., B.K. and J.J.; writing—review and editing, W.M., L.T., J.J. and M.S.; visualization, L.T. and B.K.; supervision, W.M., J.R. and J.J.; project administration, W.M. and M.S. All authors have read and agreed to the published version of the manuscript. Data Availability Statement Publicly available datasets were analyzed in this study. Conflicts of Interest The authors declare no conflict of interest. References 1. Haas B. Eckstein N. Pfeifer V. Mayer P. Hass M.D.S. Efficacy, safety and regulatory status of SGLT2 inhibitors: Focus on canagliflozin Nutr. Diabetes 2014 4 e143 10.1038/nutd.2014.40 25365416 PMC4259905 2. Shaffner J. Chen B. Malhotra D.K. Dworkin L.D. Gong R. Therapeutic Targeting of SGLT2: A New Era in the Treatment of Diabetes and Diabetic Kidney Disease Front. Endocrinol. 2021 12 749010 10.3389/fendo.2021.749010 PMC8591164 34790170 3. Anker S.D. Butler J. Filippatos G. Ferreira J.P. Bocchi E. Böhm M. Brunner–La Rocca H.-P. Choi D.-J. Chopra V. Chuquiure-Valenzuela E. Empagliflozin in Heart Failure with a Preserved Ejection Fraction N. Engl. J. Med. 2021 385 1451 1461 10.1056/NEJMoa2107038 34449189 4. Zinman B. Wanner C. Lachin J.M. Fitchett D. Bluhmki E. Hantel S. Mattheus M. Devins T. Johansen O.E. Woerle H.J. Empagliflozin, Cardiovascular Outcomes, and Mortality in Type 2 Diabetes N. Engl. J. Med. 2015 373 2117 2128 10.1056/NEJMoa1504720 26378978 5. EMPA-KIDNEY Collaborative Group Design, recruitment, and baseline characteristics of the EMPA-KIDNEY trial Nephrol. Dial. Transplant. 2022 37 1317 1329 10.1093/ndt/gfac040 35238940 PMC9217655 6. Heerspink H.J.L. Stefánsson B.V. Correa-Rotter R. Chertow G.M. Greene T. Hou F.-F. Mann J.F.E. McMurray J.J.V. Lindberg M. Rossing P. Dapagliflozin in Patients with Chronic Kidney Disease N. Engl. J. Med. 2020 383 1436 1446 10.1056/NEJMoa2024816 32970396 7. Wojciechowska E. Okopień B. What Do We Know about Flozins: New, Pleiotropic Drugs J. Health Study Med. 2023 2023 247 273 10.2478/jhsm-2023-0013 8. Poudel R. Renal glucose handling in diabetes and sodium glucose cotransporter 2 inhibition Indian. J. Endocrinol. Metab. 2013 17 588 10.4103/2230-8210.113725 23961473 PMC3743357 9. Vallon V. Glucose transporters in the kidney in health and disease Pflug. Arch. 2020 472 1345 1370 10.1007/s00424-020-02361-w 32144488 PMC7483786 10. Abdul-Ghani M.A. DeFronzo R.A. Inhibition of Renal Glucose Reabsorption: A Novel Strategy for Achieving Glucose Control in Type 2 Diabetes Mellitus Endocr. Pract. 2008 14 782 790 10.4158/EP.14.6.782 18996802 11. Farber S.J. Berger E.Y. Earle D.P. Effect of Diabetes and Insulin on the Maximum Capacity of the Renal Tubules to Reabsorb Glucose 1 J. Clin. Investig. 1951 30 125 129 10.1172/JCI102424 14814204 PMC436236 12. Mogensen C.E. Maximum Tubular Reabsorption Capacity for Glucose and Renal Hemodynamics during Rapid Hypertonic Glucose Infusion in Normal and Diabetic Subjects Scand. J. Clin. Lab. Investig. 1971 28 101 109 10.3109/00365517109090668 5093515 13. Vallon V. The Mechanisms and Therapeutic Potential of SGLT2 Inhibitors in Diabetes Mellitus Annu. Rev. Med. 2015 66 255 270 10.1146/annurev-med-051013-110046 25341005 14. Nakamura N. Matsui T. Ishibashi Y. Yamagishi S.I. Insulin stimulates SGLT2-mediated tubular glucose absorption via oxidative stress generation Diabetol. Metab. Syndr. 2015 7 48 10.1186/s13098-015-0044-1 26023321 PMC4447012 15. Freitas H.S. Anhê G.F. Melo K.F.S. Okamoto M.M. Oliveira-Souza M. Bordin S. Machado U.F. Na + Endocrinology 2008 149 717 724 10.1210/en.2007-1088 17962340 16. Rajeev S.P. Cuthbertson D.J. Wilding J.P.H. Energy balance and metabolic changes with sodium-glucose co-transporter 2 inhibition Diabetes Obes. Metab. 2016 18 125 134 10.1111/dom.12578 26403227 17. Brown E. Wilding J.P.H. Barber T.M. Alam U. Cuthbertson D.J. Weight loss variability with SGLT2 inhibitors and GLP-1 receptor agonists in type 2 diabetes mellitus and obesity: Mechanistic possibilities Obes. Rev. 2019 20 816 828 10.1111/obr.12841 30972878 18. Nespoux J. Vallon V. SGLT2 inhibition and kidney protection Clin. Sci. 2018 132 1329 1339 10.1042/CS20171298 PMC6648703 29954951 19. Mori I. Ishizuka T. Effects of SGLT2 Inhibitors on Renin-Aldosterone System for One Month and Six Months in Type 2 Diabetes Diabetes 2018 67 (Suppl. S1) 1196-P 10.2337/db18-1196-P 20. Schork A. Saynisch J. Vosseler A. Jaghutriz B.A. Heyne N. Peter A. Häring H.-U. Stefan N. Fritsche A. Artunc F. Effect of SGLT2 inhibitors on body composition, fluid status and renin–angiotensin–aldosterone system in type 2 diabetes: A prospective study using bioimpedance spectroscopy Cardiovasc. Diabetol. 2019 18 46 10.1186/s12933-019-0852-y 30953516 PMC6451223 21. Puglisi S. Rossini A. Poli R. Dughera F. Pia A. Terzolo M. Reimondo G. Effects of SGLT2 Inhibitors and GLP-1 Receptor Agonists on Renin-Angiotensin-Aldosterone System Front. Endocrinol. 2021 12 738848 10.3389/fendo.2021.738848 PMC8567993 34745006 22. Fioretto P. Zambon A. Rossato M. Busetto L. Vettor R. SGLT2 Inhibitors and the Diabetic Kidney Diabetes Care 2016 39 (Suppl. S2) S165 S171 10.2337/dcS15-3006 27440829 23. Hebert L.E. Weuve J. Scherr P.A. Evans D.A. Alzheimer disease in the United States (2010–2050) estimated using the 2010 census Neurology 2013 80 1778 1783 10.1212/WNL.0b013e31828726f5 23390181 PMC3719424 24. Rossi A. Berger K. Chen H. Leslie D. Mailman R.B. Huang X. Projection of the prevalence of Parkinson’s disease in the coming decades: Revisited Mov. Disord. 2018 33 156 159 10.1002/mds.27063 28590580 PMC5720940 25. Gulisano W. Maugeri D. Baltrons M.A. Fà M. Amato A. Palmeri A. D’aDamio L. Grassi C. Devanand D. Honig L.S. Role of Amyloid-β and Tau Proteins in Alzheimer’s Disease: Confuting the Amyloid Cascade J. Alzheimer’s Dis. 2018 64 S611 S631 10.3233/JAD-179935 29865055 PMC8371153 26. Frisoni G.B. Altomare D. Thal D.R. Ribaldi F. van der Kant R. Ossenkoppele R. Blennow K. Cummings J. van Duijn C. Nilsson P.M. The probabilistic model of Alzheimer disease: The amyloid hypothesis revised Nat. Rev. Neurosci. 2022 23 53 66 10.1038/s41583-021-00533-w 34815562 PMC8840505 27. Maiti P. Manna J. Dunbar G.L. Current understanding of the molecular mechanisms in Parkinson’s disease: Targets for potential treatments Transl. Neurodegener. 2017 6 28 10.1186/s40035-017-0099-z 29090092 PMC5655877 28. Gómez-Benito M. Granado N. García-Sanz P. Michel A. Dumoulin M. Moratalla R. Modeling Parkinson’s Disease with the Alpha-Synuclein Protein Front. Pharmacol. 2020 11 356 10.3389/fphar.2020.00356 32390826 PMC7191035 29. Troncoso-Escudero P. Parra A. Nassif M. Vidal R.L. Outside in: Unraveling the Role of Neuroinflammation in the Progression of Parkinson’s Disease Front. Neurol. 2018 9 860 10.3389/fneur.2018.00860 30459700 PMC6232883 30. Gelders G. Baekelandt V. Van der Perren A. Linking Neuroinflammation and Neurodegeneration in Parkinson’s Disease J. Immunol. Res. 2018 2018 4784268 10.1155/2018/4784268 29850629 PMC5926497 31. Sharma N. Nehru B. Characterization of the lipopolysaccharide induced model of Parkinson’s disease: Role of oxidative stress and neuroinflammation Neurochem. Int. 2015 87 92 105 10.1016/j.neuint.2015.06.004 26055970 32. Marttila R.J. Lorentz H. Rinne U.K. Oxygen toxicity protecting enzymes in Parkinson’s disease J. Neurol. Sci. 1988 86 321 331 10.1016/0022-510X(88)90108-6 3221244 33. Trist B.G. Hare D.J. Double K.L. Oxidative stress in the aging substantia nigra and the etiology of Parkinson’s disease Aging Cell 2019 18 e13031 10.1111/acel.13031 31432604 PMC6826160 34. Ni A. Ernst C. Evidence That Substantia Nigra Pars Compacta Dopaminergic Neurons Are Selectively Vulnerable to Oxidative Stress Because They Are Highly Metabolically Active Front. Cell. Neurosci. 2022 16 826193 10.3389/fncel.2022.826193 35308118 PMC8931026 35. Pawlos A. Broncel M. Woźniak E. Gorzelak-Pabiś P. Neuroprotective Effect of SGLT2 Inhibitors Molecules 2021 26 7213 10.3390/molecules26237213 34885795 PMC8659196 36. Mohammed N.N. Tadros M.G. George M.Y. Empagliflozin repurposing in Parkinson’s disease; modulation of oxidative stress, neuroinflammation, AMPK/SIRT-1/PGC-1α, and wnt/β-catenin pathways Inflammopharmacology 2024 32 777 794 10.1007/s10787-023-01384-w 38038781 PMC10907444 37. Rakshe P.S. Dutta B.J. Chib S. Maurya N. Singh S. Unveiling the interplay of AMPK/SIRT1/PGC-1α axis in brain health: Promising targets against aging and NDDs Ageing Res. Rev. 2024 96 102255 10.1016/j.arr.2024.102255 38490497 38. Shi H.-J. Xu C. Liu M.-Y. Wang B.-K. Liu W.-B. Chen D.-H. Zhang L. Xu C.-Y. Li X.-F. Resveratrol Improves the Energy Sensing and Glycolipid Metabolism of Blunt Snout Bream Megalobrama amblycephala Front. Physiol. 2018 9 1258 10.3389/fphys.2018.01258 30254587 PMC6141669 39. Marchetti B. Wnt/β-Catenin Signaling Pathway Governs a Full Program for Dopaminergic Neuron Survival, Neurorescue and Regeneration in the MPTP Mouse Model of Parkinson’s Disease Int. J. Mol. Sci. 2018 19 3743 10.3390/ijms19123743 30477246 PMC6321180 40. Heimke M. Lenz F. Rickert U. Lucius R. Cossais F. Anti-Inflammatory Properties of the SGLT2 Inhibitor Empagliflozin in Activated Primary Microglia Cells 2022 11 3107 10.3390/cells11193107 36231069 PMC9563452 41. Mousa H.H. Sharawy M.H. Nader M.A. Empagliflozin enhances neuroplasticity in rotenone-induced parkinsonism: Role of BDNF, CREB and Npas4 Life Sci. 2023 312 121258 10.1016/j.lfs.2022.121258 36462721 42. Salas I.H. De Strooper B. Diabetes and Alzheimer’s Disease: A Link not as Simple as it Seems Neurochem. Res. 2019 44 1271 1278 10.1007/s11064-018-2690-9 30523576 43. Zhang J. Chen C. Hua S. Liao H. Wang M. Xiong Y. Cao F. An updated meta-analysis of cohort studies: Diabetes and risk of Alzheimer’s disease Diabetes Res. Clin. Pract. 2017 124 41 47 10.1016/j.diabres.2016.10.024 28088029 44. Hierro-Bujalance C. Infante-Garcia C. del Marco A. Herrera M. Carranza-Naval M.J. Suarez J. Alves-Martinez P. Lubian-Lopez S. Garcia-Alloza M. Empagliflozin reduces vascular damage and cognitive impairment in a mixed murine model of Alzheimer’s disease and type 2 diabetes Alzheimers Res. Ther. 2020 12 40 10.1186/s13195-020-00607-4 32264944 PMC7140573 45. Samman W.A. Selim S.M. El Fayoumi H.M. El-Sayed N.M. Mehanna E.T. Hazem R.M. Dapagliflozin Ameliorates Cognitive Impairment in Aluminum-Chloride-Induced Alzheimer’s Disease via Modulation of AMPK/mTOR, Oxidative Stress and Glucose Metabolism Pharmaceuticals 2023 16 753 10.3390/ph16050753 37242536 PMC10223357 46. Kim H.K. Biessels G.J. Yu M.H. Hong N. Lee Y.-H. Lee B.-W. Kang E.S. Cha B.-S. Lee E.J. Lee M. SGLT2 Inhibitor Use and Risk of Dementia and Parkinson Disease Among Patients with Type 2 Diabetes Neurology 2024 103 e209805 10.1212/WNL.0000000000209805 39292986 47. Davidson M.B. Metformin Should Not Be Used to Treat Prediabetes Diabetes Care 2020 43 1983 1987 10.2337/dc19-2221 32936780 48. Mori Y. Duru O.K. Tuttle K.R. Fukuma S. Taura D. Harada N. Inagaki N. Inoue K. Sodium-Glucose Cotransporter 2 Inhibitors and New-onset Type 2 Diabetes in Adults with Prediabetes: Systematic Review and Meta-Analysis of Randomized Controlled Trials J. Clin. Endocrinol. Metab. 2023 108 221 231 10.1210/clinem/dgac591 36217306 49. Butler A.E. Janson J. Bonner-Weir S. Ritzel R. Rizza R.A. Butler P.C. β-Cell Deficit and Increased β-Cell Apoptosis in Humans with Type 2 Diabetes Diabetes 2003 52 102 110 10.2337/diabetes.52.1.102 12502499 50. Kou K. Saisho Y. Satoh S. Yamada T. Itoh H. Change in β-Cell Mass in Japanese Nondiabetic Obese Individuals J. Clin. Endocrinol. Metab. 2013 98 3724 3730 10.1210/jc.2013-1373 23766518 51. Zha J. Chi X. Yu X. Liu X. Liu D. Zhu J. Ji H. Liu R. Interleukin-1β-Targeted Vaccine Improves Glucose Control and β-Cell Function in a Diabetic KK-Ay Mouse Model PLoS ONE 2016 11 e0154298 10.1371/journal.pone.0154298 27152706 PMC4859560 52. Asahara S.I. Ogawa W. SGLT2 inhibitors and protection against pancreatic beta cell failure Diabetol. Int. 2019 10 1 2 10.1007/s13340-018-0374-y 30800558 PMC6357236 53. Al Jobori H. Daniele G. Adams J. Cersosimo E. Solis-Herrera C. Triplitt C. A DeFronzo R. Abdul-Ghani M. Empagliflozin Treatment Is Associated with Improved β-Cell Function in Type 2 Diabetes Mellitus J. Clin. Endocrinol. Metab. 2018 103 1402 1407 10.1210/jc.2017-01838 29342295 PMC7328850 54. Younossi Z.M. Golabi P. de Avila L. Paik J.M. Srishord M. Fukui N. Qiu Y. Burns L. Afendy A. Nader F. The global epidemiology of NAFLD and NASH in patients with type 2 diabetes: A systematic review and meta-analysis J. Hepatol. 2019 71 793 801 10.1016/j.jhep.2019.06.021 31279902 55. Morrison A.E. Zaccardi F. Khunti K. Davies M.J. Causality between non-alcoholic fatty liver disease and risk of cardiovascular disease and type 2 diabetes: A meta-analysis with bias analysis Liver Int. 2019 39 557 567 10.1111/liv.13994 30358050 56. Mantovani A. Byrne C.D. Bonora E. Targher G. Nonalcoholic Fatty Liver Disease and Risk of Incident Type 2 Diabetes: A Meta-analysis Diabetes Care 2018 41 372 382 10.2337/dc17-1902 29358469 57. Chen S.C.C. Tsai S.P. Jhao J.Y. Jiang W.K. Tsao C.K. Chang L.Y. Liver Fat, Hepatic Enzymes, Alkaline Phosphatase and the Risk of Incident Type 2 Diabetes: A Prospective Study of 132,377 Adults Sci. Rep. 2017 7 4649 10.1038/s41598-017-04631-7 28680048 PMC5498613 58. Calzadilla Bertot L. Adams L. The Natural Course of Non-Alcoholic Fatty Liver Disease Int. J. Mol. Sci. 2016 17 774 10.3390/ijms17050774 27213358 PMC4881593 59. Kontana A. Tziomalos K. Role of sodium-glucose co-transporter-2 inhibitors in the management of nonalcoholic fatty liver disease World J. Gastroenterol. 2019 25 3664 3668 10.3748/wjg.v25.i28.3664 31391764 PMC6676552 60. Meng Z. Liu X. Li T. Fang T. Cheng Y. Han L. Sun B. Chen L. The SGLT2 inhibitor empagliflozin negatively regulates IL-17/IL-23 axis-mediated inflammatory responses in T2DM with NAFLD via the AMPK/mTOR/autophagy pathway Int. Immunopharmacol. 2021 94 107492 10.1016/j.intimp.2021.107492 33647823 61. Chiang H. Lee J. Huang H. Huang H. Liu H. Huang C. Delayed intervention with a novel SGLT2 inhibitor NGI001 suppresses diet-induced metabolic dysfunction and non-alcoholic fatty liver disease in mice Br. J. Pharmacol. 2020 177 239 253 10.1111/bph.14859 31497874 PMC6989948 62. Wu P. Wen W. Li J. Xu J. Zhao M. Chen H. Sun J. Systematic Review and Meta-Analysis of Randomized Controlled Trials on the Effect of SGLT2 Inhibitor on Blood Leptin and Adiponectin Level in Patients with Type 2 Diabetes Horm. Metab. Res. 2019 51 487 494 10.1055/a-0958-2441 31408894 63. Petrescu M. Vlaicu S.I. Ciumărnean L. Milaciu M.V. Mărginean C. Florea M. Vesa Ș.C. Popa M. Chronic Inflammation—A Link between Nonalcoholic Fatty Liver Disease (NAFLD) and Dysfunctional Adipose Tissue Medicina 2022 58 641 10.3390/medicina58050641 35630058 PMC9147364 64. Heerspink H.J.L. Perco P. Mulder S. Leierer J. Hansen M.K. Heinzel A. Mayer G. Canagliflozin reduces inflammation and fibrosis biomarkers: A potential mechanism of action for beneficial effects of SGLT2 inhibitors in diabetic kidney disease Diabetologia 2019 62 1154 1166 10.1007/s00125-019-4859-4 31001673 PMC6560022 65. Sumida Y. Yoneda M. Tokushige K. Kawanaka M. Fujii H. Imajo K. Takahashi H. Ono M. Nozaki Y. Hyogo H. Hepatoprotective Effect of SGLT2 Inhibitor on Nonalcoholic Fatty Liver Disease Diabetes Res. Open Access 2020 2 17 25 10.36502/2020/droa.6159 66. Lee J.-Y. Lee M. Lee J.Y. Bae J. Shin E. Lee Y.-H. Lee B.-W. Kang E.S. Cha B.-S. Ipragliflozin, an SGLT2 Inhibitor, Ameliorates High-Fat Diet-Induced Metabolic Changes by Upregulating Energy Expenditure through Activation of the AMPK/SIRT1 Pathway Diabetes Metab. J. 2021 45 921 932 10.4093/dmj.2020.0187 33611885 PMC8640151 67. Androutsakos T. Nasiri-Ansari N. Bakasis A.-D. Kyrou I. Efstathopoulos E. Randeva H.S. Kassi E. SGLT-2 Inhibitors in NAFLD: Expanding Their Role beyond Diabetes and Cardioprotection Int. J. Mol. Sci. 2022 23 3107 10.3390/ijms23063107 35328527 PMC8953901 68. Shimizu M. Suzuki K. Kato K. Jojima T. Iijima T. Murohisa T. Iijima M. Takekawa H. Usui I. Hiraishi H. Evaluation of the effects of dapagliflozin, a sodium-glucose co-transporter-2 inhibitor, on hepatic steatosis and fibrosis using transient elastography in patients with type 2 diabetes and non-alcoholic fatty liver disease Diabetes Obes. Metab. 2019 21 285 292 10.1111/dom.13520 30178600 69. Bajaj H.S. Brown R.E. Bhullar L. Sohi N. Kalra S. Aronson R. SGLT2 inhibitors and incretin agents: Associations with alanine aminotransferase activity in type 2 diabetes Diabetes Metab. 2018 44 493 499 10.1016/j.diabet.2018.08.001 30149145 70. Kuchay M.S. Krishan S. Mishra S.K. Farooqui K.J. Singh M.K. Wasir J.S. Bansal B. Kaur P. Jevalikar G. Gill H.K. Effect of Empagliflozin on Liver Fat in Patients with Type 2 Diabetes and Nonalcoholic Fatty Liver Disease: A Randomized Controlled Trial (E-LIFT Trial) Diabetes Care 2018 41 1801 1808 10.2337/dc18-0165 29895557 71. Kahl S. Gancheva S. Straßburger K. Herder C. Machann J. Katsuyama H. Kabisch S. Henkel E. Kopf S. Lagerpusch M. Empagliflozin Effectively Lowers Liver Fat Content in Well-Controlled Type 2 Diabetes: A Randomized, Double-Blind, Phase 4, Placebo-Controlled Trial Diabetes Care 2020 43 298 305 10.2337/dc19-0641 31540903 72. Mirarchi L. Amodeo S. Citarrella R. Licata A. Soresi M. Giannitrapani L. SGLT2 Inhibitors as the Most Promising Influencers on the Outcome of Non-Alcoholic Fatty Liver Disease Int. J. Mol. Sci. 2022 23 3668 10.3390/ijms23073668 35409028 PMC8998221 73. Shibuya T. Fushimi N. Kawai M. Yoshida Y. Hachiya H. Ito S. Kawai H. Ohashi N. Mori A. Luseogliflozin improves liver fat deposition compared to metformin in type 2 diabetes patients with non-alcoholic fatty liver disease: A prospective randomized controlled pilot study Diabetes Obes. Metab. 2018 20 438 442 10.1111/dom.13061 28719078 74. Becker B.F. Towards the physiological function of uric acid Free Radic. Biol. Med. 1993 14 615 631 10.1016/0891-5849(93)90143-I 8325534 75. Schmidt J.A. Crowe F.L. Appleby P.N. Key T.J. Travis R.C. Serum Uric Acid Concentrations in Meat Eaters, Fish Eaters, Vegetarians and Vegans: A Cross-Sectional Analysis in the EPIC-Oxford Cohort PLoS ONE 2013 8 e56339 10.1371/journal.pone.0056339 23418557 PMC3572016 76. Prasad Sah O.S. Qing Y.X. Associations between Hyperuricemia and Chronic Kidney Disease: A Review Nephro-Urol. Mon. 2015 7 e27233 10.5812/numonthly.7(3)2015.27233 26290849 PMC4537598 77. Krishnan E. Pandya B.J. Chung L. Hariri A. Dabbous O. Hyperuricemia in Young Adults and Risk of Insulin Resistance, Prediabetes, and Diabetes: A 15-Year Follow-up Study Am. J. Epidemiol. 2012 176 108 116 10.1093/aje/kws002 22753829 78. Ahmadieh H. Azar S. Effects of Sodium Glucose Cotransporter-2 Inhibitors on Serum Uric Acid in Type 2 Diabetes Mellitus Diabetes Technol. Ther. 2017 19 507 512 10.1089/dia.2017.0070 28749169 79. Hao Z. Huang X. Shao H. Tian F. Effects of dapagliflozin on serum uric acid levels in hospitalized type 2 diabetic patients with inadequate glycemic control: A randomized controlled trial Ther. Clin. Risk Manag. 2018 14 2407 2413 10.2147/TCRM.S186347 30587997 PMC6294165 80. Yuan T. Liu S. Dong Y. Fu Y. Tang Y. Zhao W.G. Effects of Dapagliflozin on Serum and Urinary Uric Acid Levels in Type 2 Diabetic Patients: A Prospective Pilot Trial Res. Sq. 2020 preprint 10.21203/rs.3.rs-41361/v1 PMC7590796 33117454 81. Aziz H. Noor M. Ahmad B. Ali S. Farhat K. Siddiqi F.A. Comparison of Extraglycemic effects of Dapagliflozin and Empagliflozin Pak. Armed Forces Med. J. 2023 73 938 941 10.51253/pafmj.v73i3.9256 82. Chino Y. Samukawa Y. Sakai S. Nakai Y. Yamaguchi J. Nakanishi T. Tamai I. SGLT2 inhibitor lowers serum uric acid through alteration of uric acid transport activity in renal tubule by increased glycosuria Biopharm. Drug Dispos. 2014 35 391 404 10.1002/bdd.1909 25044127 PMC4223977 83. Novikov A. Fu Y. Huang W. Freeman B. Patel R. van Ginkel C. Koepsell H. Busslinger M. Onishi A. Nespoux J. SGLT2 inhibition and renal urate excretion: Role of luminal glucose, GLUT9, and URAT1 Am. J. Physiol.-Ren. Physiol. 2019 316 F173 F185 10.1152/ajprenal.00462.2018 30427222 PMC6383194 84. Dong M. Chen H. Wen S. Yuan Y. Yang L. Xu D. Zhou L. The Mechanism of Sodium-Glucose Cotransporter-2 Inhibitors in Reducing Uric Acid in Type 2 Diabetes Mellitus Diabetes Metab. Syndr. Obes. 2023 16 437 445 10.2147/DMSO.S399343 36820272 PMC9938669 85. Yan W. Wen S. Zhou L. Effect of Intestinal Flora on Hyperuricemia-Induced Chronic Kidney Injury in Type 2 Diabetic Patients and the Therapeutic Mechanism of New Anti-Diabetic Prescription Medications Diabetes Metab. Syndr. Obes. 2023 16 3029 3044 10.2147/DMSO.S429068 37794899 PMC10547008 86. Prattichizzo F. De Nigris V. Micheloni S. La Sala L. Ceriello A. Increases in circulating levels of ketone bodies and cardiovascular protection with SGLT2 inhibitors: Is low-grade inflammation the neglected component? Diabetes Obes. Metab. 2018 20 2515 2522 10.1111/dom.13488 30073768 87. Zelniker T.A. Wiviott S.D. Raz I. Im K. Goodrich E. Bonaca M.P. Mosenzon O. Kato E. Cahn A. Furtado R.H.M. SGLT2 inhibitors for primary and secondary prevention of cardiovascular and renal outcomes in type 2 diabetes: A systematic review and meta-analysis of cardiovascular outcome trials Lancet 2019 393 31 39 10.1016/S0140-6736(18)32590-X 30424892 88. Khat D.Z. Husain M. Molecular Mechanisms Underlying the Cardiovascular Benefits of SGLT2i and GLP-1RA Curr. Diab. Rep. 2018 18 45 10.1007/s11892-018-1011-7 29886514 89. Sridhar V.S. Davies M.J. Banks P. Girard M. Carroll A.K. Cherney D.Z.I. Effects of sotagliflozin on anaemia in patients with type 2 diabetes and chronic kidney disease stages 3 and 4 Diabetes Obes. Metab. 2025 27 1010 1013 10.1111/dom.16079 39563621 PMC11701173 90. Shih H.M. Wu C.J. Lin S.L. Physiology and pathophysiology of renal erythropoietin-producing cells J. Formos. Med. Assoc. 2018 117 955 963 10.1016/j.jfma.2018.03.017 29655605 91. Packer M. Alleviation of Anemia by SGLT2 Inhibitors in Patients with CKD: Mechanisms and Results of Long-Term Placebo-Controlled Trials Clin. J. Am. Soc. Nephrol. 2024 19 531 534 10.2215/CJN.0000000000000362 PMC11020424 37902773 92. Docherty K.F. Curtain J.P. Anand I.S. Bengtsson O. Inzucchi S.E. Køber L. Kosiborod M.N. Langkilde A.M. Martinez F.A. Ponikowski P. Effect of dapagliflozin on anaemia in DAPA-HF Eur. J. Heart Fail. 2021 23 617 628 10.1002/ejhf.2132 33615642 PMC11497230 93. Sano M. A Role of Sodium-Glucose Co-Transporter 2 in Cardiorenal Anemia Iron Deficiency Syndrome Int. J. Mol. Sci. 2023 24 5983 10.3390/ijms24065983 36983057 PMC10057380 94. Packer M. How can sodium–glucose cotransporter 2 inhibitors stimulate erythrocytosis in patients who are iron-deficient? Implications for understanding iron homeostasis in heart failure Eur. J. Heart Fail. 2022 24 2287 2296 10.1002/ejhf.2731 36377108 PMC10100235 95. Oshima M. Neuen B.L. Jardine M.J. Bakris G. Edwards R. Levin A. Mahaffey K.W. Neal B. Pollock C. Rosenthal N. Effects of canagliflozin on anaemia in patients with type 2 diabetes and chronic kidney disease: A post-hoc analysis from the CREDENCE trial Lancet Diabetes Endocrinol. 2020 8 903 914 10.1016/S2213-8587(20)30300-4 33065060 96. Ferreira J.P. Anker S.D. Butler J. Filippatos G. Iwata T. Salsali A. Butler J. Zeller C. Pocock S.J. Zannad F. Impact of anaemia and the effect of empagliflozin in heart failure with reduced ejection fraction: Findings from EMPEROR-Reduced Eur. J. Heart Fail. 2022 24 708 715 10.1002/ejhf.2409 34957660 PMC9303456 97. Koshino A. Schechter M. Chertow G.M. Vart P. Jongs N. Toto R.D. Rossing P. Correa-Rotter R. McMurray J.J. Górriz J.L. Dapagliflozin and Anemia in Patients with Chronic Kidney Disease NEJM Evid. 2023 2 EVIDoa2300049 10.1056/EVIDoa2300049 38320128 98. Feijóo-Bandín S. Aragón-Herrera A. Otero-Santiago M. Anido-Varela L. Moraña-Fernández S. Tarazón E. Roselló-Lletí E. Portolés M. Gualillo O. González-Juanatey J.R. Role of Sodium-Glucose Co-Transporter 2 Inhibitors in the Regulation of Inflammatory Processes in Animal Models Int. J. Mol. Sci. 2022 23 5634 10.3390/ijms23105634 35628443 PMC9144929 99. Pirklbauer M. Sallaberger S. Staudinger P. Corazza U. Leierer J. Mayer G. Schramek H. Empagliflozin Inhibits IL-1β-Mediated Inflammatory Response in Human Proximal Tubular Cells Int. J. Mol. Sci. 2021 22 5089 10.3390/ijms22105089 34064989 PMC8151056 100. Lee S.-G. Lee S.-J. Lee J.-J. Kim J.-S. Lee O.-H. Kim C.-K. Kim D. Lee Y.-H. Oh J. Park S. Anti-Inflammatory Effect for Atherosclerosis Progression by Sodium-Glucose Cotransporter 2 (SGLT-2) Inhibitor in a Normoglycemic Rabbit Model Korean Circ. J. 2020 50 443 10.4070/kcj.2019.0296 32153145 PMC7098824 101. Lee N. Heo Y.J. Choi S.-E. Jeon J.Y. Han S.J. Kim D.J. Kang Y. Lee K.W. Kim H.J. Hautz T. Anti-inflammatory Effects of Empagliflozin and Gemigliptin on LPS-Stimulated Macrophage via the IKK/NF-κB, MKK7/JNK, and JAK2/STAT1 Signalling Pathways J. Immunol. Res. 2021 2021 9944880 10.1155/2021/9944880 34124273 PMC8192181 102. Maayah Z.H. Ferdaoussi M. Takahara S. Soni S. Dyck J.R.B. Empagliflozin suppresses inflammation and protects against acute septic renal injury Inflammopharmacology 2021 29 269 279 10.1007/s10787-020-00732-4 32564182 103. Schönberger E. Mihaljević V. Steiner K. Šarić S. Kurevija T. Majnarić L.T. Ćurčić I.B. Canecki-Varžić S. Immunomodulatory Effects of SGLT2 Inhibitors—Targeting Inflammation and Oxidative Stress in Aging Int. J. Environ. Res. Public Health 2023 20 6671 10.3390/ijerph20176671 37681811 PMC10487537 104. Packer M. Role of Impaired Nutrient and Oxygen Deprivation Signaling and Deficient Autophagic Flux in Diabetic CKD Development: Implications for Understanding the Effects of Sodium-Glucose Cotransporter 2-Inhibitors J. Am. Soc. Nephrol. 2020 31 907 919 10.1681/ASN.2020010010 32276962 PMC7217421 105. Tuttle K.R. Digging deep into cells to find mechanisms of kidney protection by SGLT2 inhibitors J. Clin. Investig. 2023 133 e167700 10.1172/JCI167700 36856116 PMC9974093 106. Li X. Lu Q. Qiu Y. Carmo J.M.D. Wang Z. da Silva A.A. Mouton A. Omoto A.C.M. Hall M.E. Li J. Direct Cardiac Actions of the Sodium Glucose Co-Transporter 2 Inhibitor Empagliflozin Improve Myocardial Oxidative Phosphorylation and Attenuate Pressure-Overload Heart Failure J. Am. Heart Assoc. 2021 10 e018298 10.1161/JAHA.120.018298 33719499 PMC8174202 107. Kounatidis D. Vallianou N. Evangelopoulos A. Vlahodimitris I. Grivakou E. Kotsi E. Dimitriou K. Skourtis A. Mourouzis I. SGLT-2 Inhibitors and the Inflammasome: What’s Next in the 21st Century? Nutrients 2023 15 2294 10.3390/nu15102294 37242177 PMC10221012 108. Kang M. Huang C.C. Lu Y. Shirazi S. Gajendrareddy P. Ravindran S. Cooper L.F. Bone regeneration is mediated by macrophage extracellular vesicles Bone 2020 141 115627 10.1016/j.bone.2020.115627 32891867 PMC8107826 109. Shapouri-Moghaddam A. Mohammadian S. Vazini H. Taghadosi M. Esmaeili S.-A. Mardani F. Seifi B. Mohammadi A. Afshari J.T. Sahebkar A. Macrophage plasticity, polarization, and function in health and disease J. Cell. Physiol. 2018 233 6425 6440 10.1002/jcp.26429 29319160 110. Markina Y.V. Kirichenko T.V. Tolstik T.V. Bogatyreva A.I. Zotova U.S. Cherednichenko V.R. Postnov A.Y. Markin A.M. Target and Cell Therapy for Atherosclerosis and CVD Int. J. Mol. Sci. 2023 24 10308 10.3390/ijms241210308 37373454 PMC10299192 111. Xu L. Nagata N. Nagashimada M. Zhuge F. Ni Y. Chen G. Mayoux E. Kaneko S. Ota T. SGLT2 Inhibition by Empagliflozin Promotes Fat Utilization and Browning and Attenuates Inflammation and Insulin Resistance by Polarizing M2 Macrophages in Diet-induced Obese Mice EBioMedicine 2017 20 137 149 10.1016/j.ebiom.2017.05.028 28579299 PMC5478253 112. Coppack S.W. Pro-inflammatory cytokines and adipose tissue Proc. Nutr. Soc. 2001 60 349 356 10.1079/PNS2001110 11681809 113. Park H.S. Park J.Y. Yu R. Relationship of obesity and visceral adiposity with serum concentrations of CRP, TNF-α and IL-6 Diabetes Res. Clin. Pract. 2005 69 29 35 10.1016/j.diabres.2004.11.007 15955385 114. Fontana L. Eagon J.C. Trujillo M.E. Scherer P.E. Klein S. Visceral Fat Adipokine Secretion Is Associated with Systemic Inflammation in Obese Humans Diabetes 2007 56 1010 1013 10.2337/db06-1656 17287468 115. Bolinder J. Ljunggren Ö. Kullberg J. Johansson L. Wilding J. Langkilde A.M. Sugg J. Parikh S. Effects of Dapagliflozin on Body Weight, Total Fat Mass, and Regional Adipose Tissue Distribution in Patients with Type 2 Diabetes Mellitus with Inadequate Glycemic Control on Metformin J. Clin. Endocrinol. Metab. 2012 97 1020 1031 10.1210/jc.2011-2260 22238392 116. Esterline R.L. Vaag A. Oscarsson J. Vora J. Mechanisms in Endocrinology: SGLT2 inhibitors: Clinical benefits by restoration of normal diurnal metabolism? Eur. J. Endocrinol. 2018 178 R113 R125 10.1530/EJE-17-0832 29371333 117. Deswal R. Narwal V. Dang A. Pundir C. The Prevalence of Polycystic Ovary Syndrome: A Brief Systematic Review J. Hum. Reprod. Sci. 2020 13 261 10.4103/jhrs.jhrs_95_18 33627974 PMC7879843 118. Zhang J. Xing C. Cheng X. He B. Canagliflozin combined with metformin versus metformin monotherapy for endocrine and metabolic profiles in overweight and obese women with polycystic ovary syndrome: A single-center, open-labeled prospective randomized controlled trial Front. Endocrinol. 2022 13 1003238 10.3389/fendo.2022.1003238 36147577 PMC9486461 119. Javed Z. Papageorgiou M. Deshmukh H. Rigby A.S. Qamar U. Abbas J. Khan A.Y. Kilpatrick E.S. Atkin S.L. Sathyapalan T. Effects of empagliflozin on metabolic parameters in polycystic ovary syndrome: A randomized controlled study Clin. Endocrinol. 2019 90 805 813 10.1111/cen.13968 30866088 120. Tan S. Ignatenko S. Wagner F. Dokras A. Seufert J. Zwanziger D. Dunschen K. Zakaria M. Huseinovic N. Basson C.T. Licogliflozin versus placebo in women with polycystic ovary syndrome: A randomized, double-blind, phase 2 trial Diabetes Obes. Metab. 2021 23 2595 2599 10.1111/dom.14495 34263971 121. Cai M. Shao X. Xing F. Zhang Y. Gao X. Zeng Q. Dilimulati D. Qu S. Zhang M. Efficacy of canagliflozin versus metformin in women with polycystic ovary syndrome: A randomized, open-label, noninferiority trial Diabetes Obes. Metab. 2022 24 312 320 10.1111/dom.14583 34726324 122. Elkind-Hirsch K.E. Chappell N. Seidemann E. Storment J. Bellanger D. Exenatide, Dapagliflozin, or Phentermine/Topiramate Differentially Affect Metabolic Profiles in Polycystic Ovary Syndrome J. Clin. Endocrinol. Metab. 2021 106 3019 3033 10.1210/clinem/dgab408 34097062 123. Pruett J.E. Fernandez E.D.T. Everman S.J. Vinson R.M. Davenport K. Logan M.K. Ye S.A. Romero D.G. Cardozo L.L.Y. Impact of SGLT-2 Inhibition on Cardiometabolic Abnormalities in a Rat Model of Polycystic Ovary Syndrome Int. J. Mol. Sci. 2021 22 2576 10.3390/ijms22052576 33806551 PMC7962009 124. Nevola R. Villani A. Imbriani S. Alfano M. Criscuolo L. Beccia D. Ruocco R. Femine A.D. Gragnano F. Cozzolino D. Sodium-Glucose Co-Transporters Family: Current Evidence, Clinical Applications and Perspectives Front. Biosci.-Landmark 2023 28 103 10.31083/j.fbl2805103 37258483 125. Marinkovic-Radosevic J. Cigrovski Berkovic M. Kruezi E. Bilic-Curcic I. Mrzljak A. Exploring new treatment options for polycystic ovary syndrome: Review of a novel antidiabetic agent SGLT2 inhibitor World J. Diabetes 2021 12 932 938 10.4239/wjd.v12.i7.932 34326946 PMC8311482 126. Rakic D. Jakovljevic V. Jovic N. Ilic M.B. Dimitrijevic A. Vulovic T. Arsenijevic P. Sretenovic J. Nikolic M. Fisenko V.P. The Potential of SGLT-2 Inhibitors in the Treatment of Polycystic Ovary Syndrome: The Current Status and Future Perspectives Biomedicines 2023 11 998 10.3390/biomedicines11040998 37189616 PMC10136160 127. Sinha B. Ghosal S. A Meta-Analysis of the Effect of Sodium Glucose Cotransporter-2 Inhibitors on Metabolic Parameters in Patients with Polycystic Ovary Syndrome Front. Endocrinol. 2022 13 830401 10.3389/fendo.2022.830401 PMC8900375 35265039 128. Khan A. Ahmad F. Ali N. Shah K.U. Effect of canagliflozin alone and in combination with metformin on hormonal derangements and estrous cycle in a polycystic ovary syndrome rat model Khyber Med. Univ. J. 2021 13 94 99 10.35845/kmuj.2021.20602 129. Mora-Fernández C. Sánchez-Niño M.D. Donate-Correa J. Martín-Núñez E. Pérez-Delgado N. Valiño-Rivas L. Fernández-Fernández B. Ortiz A. Navarro-González J.F. Sodium-glucose co-transporter-2 inhibitors increase Klotho in patients with diabetic kidney disease: A clinical and experimental study Biomed. Pharmacother. 2022 154 113677 10.1016/j.biopha.2022.113677 36942605 130. Abbás N.A.T. Salem A.E. Awad M.M. Empagliflozin attenuates renal fibrosis in rats exposed to unilateral ureteric obstruction: Potential role of Klotho expression Naunyn Schmiedebergs Arch. Pharmacol. 2018 391 1347 1360 10.1007/s00210-018-1544-y 30090949 131. Topchii I. Semenovykh P. Shcherban T. Galchinska V. Savicheva K. Serum Klotho protein level in type 2 diabetic patients depending on the renal function Ukr. J. Nephrol. Dial. 2021 3 60 66 10.31450/ukrjnd.3(67).2020.08 132. Wolf I. Föller M. Feger M. The impact of SGLT2 inhibitors on α-Klotho in renal MDCK and HK-2 cells Front. Endocrinol. 2023 14 1069715 10.3389/fendo.2023.1069715 PMC10032406 36967770 133. Castoldi G. Carletti R. Ippolito S. Colzani M. Barzaghi F. Stella A. Zerbini G. Perseghin G. Zatti G. di Gioia C.R.T. Sodium-glucose cotransporter-2 inhibition prevents renal fibrosis in cyclosporine nephropathy Acta Diabetol. 2021 58 1059 1070 10.1007/s00592-021-01681-2 33760995 PMC8272713 134. Karalliedde J. Fountoulakis N. Stathi D. Corcillo A. Flaquer M. Panagiotou A. Maltese G. Mangelis A. Ayis S. Gnudi L. Does Dapagliflozin influence arterial stiffness and levels of circulating anti-aging hormone soluble Klotho in people with type 2 diabetes and kidney disease? Results of a randomized parallel group clinical trial Front. Cardiovasc. Med. 2022 9 992327 10.3389/fcvm.2022.992327 36247425 PMC9562264 135. Frontiers in Endocrinology Editorial Team Klotho’s impact on diabetic nephropathy and its emerging mechanisms Front. Endocrinol. 2023 14 1180169 10.3389/fendo.2023.1180169 PMC10151763 37143722 136. Chen X. Tan H. Xu J. Tian Y. Yuan Q. Zuo Y. Chen Q. Hong X. Fu H. Hou F.F. Klotho-derived peptide 6 ameliorates diabetic kidney disease by targeting Wnt/β-catenin signaling Kidney Int. 2022 102 506 520 10.1016/j.kint.2022.04.028 35644285 137. Upadhyay A. SGLT2 inhibitors and kidney protection: Mechanisms beyond glycemic control Kidney360 2024 5 771 782 10.34067/KID.0000000000000425 38523127 PMC11146657 138. Wang Y. Yang L. Mao L. Zhang L. Zhu Y. Xu Y. Cheng Y. Sun R. Zhang Y. Ke J. SGLT2 inhibition restrains thyroid cancer growth via G1/S phase transition arrest and apoptosis mediated by DNA damage response signaling pathways Cancer Cell Int. 2022 22 74 10.1186/s12935-022-02496-z 35148777 PMC8840070 139. Wang J. Yang W. Advances in sodium-glucose transporter protein 2 inhibitors and tumors Front. Oncol. 2025 15 1522059 10.3389/fonc.2025.1522059 40007997 PMC11850236 140. Anastasio C. Donisi I. Del Vecchio V. Colloca A. Mele L. Sardu C. Marfella R. Balestrieri M.L. D’oNofrio N. SGLT2 inhibitor promotes mitochondrial dysfunction and ER-phagy in colorectal cancer cells Cell. Mol. Biol. Lett. 2024 29 80 10.1186/s11658-024-00599-1 38811901 PMC11134909 141. Karzoon A. Yerer M.B. Cumaoğlu A. Empagliflozin demonstrates cytotoxicity and synergy with tamoxifen in ER-positive breast cancer cells: Anti-proliferative and anti-survival effects Naunyn-Schmiedeberg’s Arch. Pharmacol. 2025 398 781 798 10.1007/s00210-024-03316-z 39066911 PMC11787280 142. Biziotis O. Tsakiridis E.E. Ali A. Ahmadi E. Wu J. Wang S. Mekhaeil B. Singh K. Menjolian G. Farrell T. Canagliflozin mediates tumor suppression alone and in combination with radiotherapy in non-small cell lung cancer (NSCLC) through inhibition of HIF-1α Mol. Oncol. 2023 17 2235 2256 10.1002/1878-0261.13508 37584455 PMC10620129 143. Shoda K. Tsuji S. Nakamura S. Egashira Y. Enomoto Y. Nakayama N. Shimazawa M. Iwama T. Hara H. Canagliflozin Inhibits Glioblastoma Growth and Proliferation by Activating AMPK Cell. Mol. Neurobiol. 2023 43 879 892 10.1007/s10571-022-01221-8 35435536 PMC11415156 144. Wu W. Zhang Z. Jing D. Huang X. Ren D. Shao Z. Zhang Z. SGLT2 inhibitor activates the STING/IRF3/IFN-β pathway and induces immune infiltration in osteosarcoma Cell Death Dis. 2022 13 523 10.1038/s41419-022-04980-w 35662245 PMC9166744 145. Ding L. Chen X. Zhang W. Dai X. Guo H. Pan X. Xu Y. Feng J. Yuan M. Gao X. Canagliflozin primes antitumor immunity by triggering PD-L1 degradation in endocytic recycling J. Clin. Investig. 2023 133 e154754 10.1172/JCI154754 36594471 PMC9797339 146. Huang Y.-M. Chen W.-M. Jao A.-T. Chen M. Shia B.-C. Wu S.-Y. Effects of SGLT2 inhibitors on clinical cancer survival in patients with type 2 diabetes Diabetes Metab. 2024 50 101500 10.1016/j.diabet.2023.101500 38036054 147. Park L.K. Lim K.-H. Volkman J. Abdiannia M. Johnston H. Nigogosyan Z. Siegel M.J. McGill J.B. McKee A.M. Salam M. Safety, tolerability, and effectiveness of the sodium-glucose cotransporter 2 inhibitor (SGLT2i) dapagliflozin in combination with standard chemotherapy for patients with advanced, inoperable pancreatic adenocarcinoma: A phase 1b observational study Cancer Metab. 2023 11 6 10.1186/s40170-023-00306-2 37202813 PMC10193807 148. Karimi M.A. Khadem R. Haraj A. Farahani M.A. Firouzeh P.C.A. Azizinezhad A. Raki H.K. Belbasi M. Bafrani M.A. Deravi N. The impact of sodium-glucose cotransporter-2 inhibitors on breast cancer and cancer-related mortality: A systematic review and meta-analysis of randomized controlled trials BMC Cancer 2025 25 1 10 10.1186/s12885-025-14304-8 40461957 PMC12135325 149. Ren D. Sun Y. Zhang D. Li D. Liu Z. Jin X. Wu H. SGLT2 promotes pancreatic cancer progression by activating the Hippo signaling pathway via the hnRNPK-YAP1 axis Cancer Lett. 2021 519 277 288 10.1016/j.canlet.2021.07.035 34314754 150. Zhang H.-D. Ding L. Mi L.-J. Zhang A.-K. Zhang K. Jiang Z.-H. Yu F.-Y. Yan X.-X. Shen Y.-J. Tang M. Sodium–glucose co-transporter-2 inhibitors for the prevention of atrial fibrillation: A systemic review and meta-analysis Eur. J. Prev. Cardiol. 2024 31 770 779 10.1093/eurjpc/zwad356 37966828 151. Yin Z. Zheng H. Guo Z. Effect of Sodium-Glucose Co-transporter Protein 2 Inhibitors on Arrhythmia in Heart Failure Patients With or Without Type 2 Diabetes: A Meta-Analysis of Randomized Controlled Trials Front. Cardiovasc. Med. 2022 9 902923 10.3389/fcvm.2022.902923 35665272 PMC9157597 152. Cetin E.H.O. Cetin M.S. Könte H.C. Ülvan N. Çelik E.M. Arslan K. Kocyigit D. Korkmaz A. Ozcan F. Ozeke O. The Impact of SGLT2 Inhibitors on Atrial Fibrillation Recurrence and Long-Term Clinical Outcomes in HFrEF Patients Undergoing Cryoballoon Ablation: A New Frontier Beyond Diabetes and Heart Failure J. Cardiovasc. Electrophysiol. 2025 36 952 960 10.1111/jce.16621 40033049 153. Fawzy A.M. Rivera-Caravaca J.M. Underhill P. Fauchier L. Lip G.Y.H. Incident heart failure, arrhythmias and cardiovascular outcomes with sodium-glucose cotransporter 2 (SGLT2) inhibitor use in patients with diabetes: Insights from a global federated electronic medical record database Diabetes Obes. Metab. 2022 25 456 465 10.1111/dom.14854 36054168 PMC10087187 Figure 1 Pleiotropic effects of SGLT2 inhibitors. Figure 2 The potential risk associated with prediabetic state. jcm-14-06348-t001_Table 1 Table 1 Clinical and preclinical studies evaluating the effects of SGLT2 inhibitors in women with polycystic ovary syndrome (PCOS). Author SGLT2i Study Design Outcomes Javed et al., 2019 119 Empagliflozin Randomized controlled trial, comparing effects of empagliflozin vs. metformin on women with PCOS. Empagliflozin was more effective than metformin in reducing weight, body fat, and waist/hip circumference. Sinha et al., 2022 127 N/A Meta-analysis of prospective trials comparing SGLT-2i group to control group. Reduction in body weight, fasting plasma glucose, insulin resistance, improvement in DHEAS levels. Khan et al., 2021 128 Canagliflozin Animal study with Sprague Dawley rats, divided into six groups, tested with canagliflozin and metformin Canagliflozin alone and in combination shows significant hormonal improvements compared to placebo; beter cycle regularization with combination jcm-14-06348-t002_Table 2 Table 2 Summary of SGLT2inhibitors’ pleiotropic effects. Therapeutic Area Proposed Mechanism(s) Key Reference Atrial Fibrillation Prevention Reduced atrial fibrosis, improved mitochondrial function, ionic balance, and anti-inflammatory effects [ 150 151 Oncology Inhibition of glycolysis, AMPK/mTOR modulation, autophagy induction, and immune checkpoint regulation [ 138 139 140 141 PCOS Improved insulin sensitivity, reduced hyperandrogenism and weight loss [ 127 128 Circadian Rhythm Restoration Glucosuria-induced catabolism, mTORC1 inhibition, autophagy activation, and metabolic rhythm normalization [ 116 Klotho Modulation Upregulation of Klotho expression, oxidative stress reduction [ 129 130 Anti-inflammatory Effects NLRP3 inflammasome inhibition, cytokine suppression, and AMPK pathway activation [ 98 100 Anemia Management Increased erythropoietin production, improved renal oxygenation, and reduced hepcidin [ 89 90 Uric Acid Reduction Uricosuric effect via inhibition of renal tubular urate reabsorption [ 80 81 MASLD Management Improved hepatic insulin sensitivity, reduced steatosis, and anti-inflammatory actions [ 60 61 T2D Prevention Enhanced glucose control, reduced insulin resistance, [ 49 Neuroprotection Reduction in stress and inflammation, improved mitochondrial function, modulation of AMPK/SIRT1/PGC-1α and Wnt/β-catenin pathways. [ 35 37 38 ",
  "metadata": {
    "Title of this paper": "Incident heart failure, arrhythmias and cardiovascular outcomes with sodium-glucose cotransporter 2 (SGLT2) inhibitor use in patients with diabetes: Insights from a global federated electronic medical record database",
    "Journal it was published in:": "Journal of Clinical Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470937/"
  }
}